{
    "id": 102,
    "name_simple": "At-Takathur",
    "revelation_place": "makkah",
    "revelation_order": 16,
    "bismillah_pre": true,
    "verses_count": 8,
    "short_text": "The Surah takes its name from the word at takathur in the first verse.",
    "text": [
        "The Surah takes its name from the word at takathur in the first verse.",
        "Period of Revelation",
        "Abu Hayyan and Shaukani say that Surah At-Takathur, according to all commentators, is Makki, and this is the well known view according to Imam Al-Suyuti also. However, there are some traditions, on the basis of which the surah is considered a Madani Surah, and they are as follows:",
        "Ibn Abi Hatim has cited Abu Buraidah as saying that this Surah was sent down concerning the two tribes, Bani Harithah and Bani al-Harth, of the Ansar. The two tribes had first recounted the glories and illustrious deeds of their living men; then they had gone to the graveyard and bragged of the glorious deeds of their dead. Thereupon the Divine Revelation Alhakumu takathur came down. However, if the practice of the Companions and their successors concerning the occasions of revelation is kept in view, this tradition is no argument to prove that Surah At-Takathur was sent down on that very occasion, though it shows that this Surah fully applied to the act of the two tribes.",
        "Imam Bukhari and Ibn Jarir have cited this view of Hadrat Ubayy bin Ka'ab: \"We took the Holy Prophet saying: “If the son of Adam had two valleys full of wealth, he would long for a third valley; the son of Adam's belly cannot be filled but by earth, to be from the Quran until Alhakum at takathur was sent down.”",
        "This Hadith has been regarded as an argument for Surah At-Takathur to be a Madani Surah on the ground that Hadrat Ubayy had become a Muslim in Madinah. However Hadrat Ubayy's statement does not indicate in what sense the Companions regarded this saying of the Holy Prophet (upon whom be peace) as belonging to the Quran. If it means that they regarded it as a verse of the Quran, it cannot be acceptable, for a great majority of the Companions consisted of the men who were well aware of each and every word of the Quran; they could not have the misunderstanding that the Hadith was a verse of the Quran. And if its belonging to the Quran is taken to mean its being derived from the Quran, the tradition can also mean that when the Companions who entered Islam in Madinah heard this Surah for the first time from the Holy Prophet, they thought that it had been revealed just then, and then about the Holy Prophet's above saying they formed the idea that it was derived from this very Surah.",
        "Ibn Jarir Tirmidhi, Ibn al Mundhir and other traditionists have related this view of Hadrat Ali: \"We were in doubt about the torment of the grave until Alhakum at takathur was sent down.\" This view has been regarded as an argument for Surah At-Takathur to be Madani on the grounds that the torment of the grave was first mentioned at Madinah; no mention of it was ever made at Makkah. Yet this is wrong. In the Makki Surahs of the Quran, the torment of the grave has been mentioned in many places so clearly that there can be no room for any doubt; for example, see Al- An'am: 93, An-Nahl: 28, Al-Muminun: 99-100, Al-Mu'min: 45-46 which are all Makki Surahs. Therefore, if anything is proved by Hadrat Ali's saying, it is that Surah At-Takathur had been revealed before the revelation of the above mentioned Makki Surahs and its revelation had removed the Companions' doubt about the torment of the grave.",
        "That is why, in spite of these traditions, a great majority of the commentators are agreed that this Surah is Makki. In our opinion, this is not only a Makki Surah but in view of its contents and style it is one of the earliest Surahs to be revealed at Makkah.",
        "Theme and Subject Matter",
        "In this Surah, the people have been warned of the evil consequences of worship of the world because of which they spend their lives acquiring more and more worldly wealth, material benefits and pleasures, and position and power, and in vying with one another and bragging and boasting about their acquisitions  until death. This one pursuit has occupied them so much that they are left with no time or opportunity for pursuing the higher things in life. After warning the people of its evil end they have been told as if to say: \"These blessings which you are amassing and enjoying thoughtlessly, are not mere blessings but are also a means of your trial. For each one of these blessings and comforts you will surely be called to account in the Hereafter.\""
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the mention of the Rivalry as mentioned in verse 1 . The surah criticizes man’s preoccupation with worldly wealth and stresses that he will be brought to account on the Day of Resurrection.The surah is also known as: Competition, Competition for Gain, Plenitude, Striving for More, The Piling Up, Vying for More and More, Worldly Abundance, Worldly Gains.",
    "name_translation": "Rivalry",
    "name_complex": "At-Takâthur",
    "surah_name_ar": "التكاثر",
    "verses": {
        "Albanian": {
            "verse 102:1": "Juve, u ka hutuar vrapimi (garimi), për pasuri (e fëmijë)",
            "verse 102:2": "deri sa të varroseni (vdisni).",
            "verse 102:3": "Gjithsesi, ju do ta kuptoni (këtë gabim)!",
            "verse 102:4": "E, madje edhe një herë, ju, me siguri, do ta kuptoni (këtë gabim)!",
            "verse 102:5": "Jo, jo! Mashtroheni, sikur ta dini ju mirë, (nuk do të mburreshit me kotësi).",
            "verse 102:6": "Ju do ta shihni skëterrën!",
            "verse 102:7": "E, (madje) edhe një herë, me të vërtetë, do ta shihni skëterrën konkretisht (qartë)!",
            "verse 102:8": "Pastaj, atë Ditë, do t’ju pyesin për kënaqësitë (e kësaj bote)!"
        },
        "Amharic": {
            "verse 102:1": "በብዛት መፎካከር (ጌታችሁን ከመገዛት) አዘነጋችሁ፡፡",
            "verse 102:2": "መቃብሮችን እስከ ጎበኛችሁ ድረስ፡፡",
            "verse 102:3": "ተከልከሉ፤ ወደፊት (ውጤቱን) ታውቃላችሁ፡፡",
            "verse 102:4": "ከዚያም ተከልከሉ፤ ወደ ፊት ታውቃላችሁ፡፡",
            "verse 102:5": "በእውነቱ (የሚጠብቃችሁን) እርግጠኛ ዕውቀትን ብታውቁ ኖሮ፤ (ባልዘናጋችሁ ነበር)፡፡",
            "verse 102:6": "ገሀነምን በእርግጥ ታያላችሁ፡፡",
            "verse 102:7": "ከዚያም እርግጠኛን ማየት ታዩዋታላችሁ፡፡",
            "verse 102:8": "ከዚያም ከድሎታችሁ ሁሉ በዚያ ቀን ትጠየቃላችሁ፡፡"
        },
        "Arabic": {
            "verse 102:1": "ُرُثاَكَّتلا ُمُكاَهْلَأ",
            "verse 102:2": "َرِباَقَمْلا ُمُتْرُز ٰىَّتَح",
            "verse 102:3": "َنوُمَلْعَت َفْوَس اَّلَك",
            "verse 102:4": "َنوُمَلْعَت َفْوَس اَّلَك َّمُث",
            "verse 102:5": "ِنيِقَيْلا َمْلِع َنوُمَلْعَت ْوَل اَّلَك",
            "verse 102:6": "َميِحَجْلا َّنُوَرَتَل",
            "verse 102:7": "ِنيِقَيْلا َنْيَع اَهَّنُوَرَتَل َّمُث",
            "verse 102:8": "ِميِعَّنلا ِنَع ٍذِئَمْوَي َّنُلَأْسُتَل َّمُث"
        },
        "Azerbaijani": {
            "verse 102:1": "Çoxluğa hərisliyiniz başınızı o qədər qatdı ki,",
            "verse 102:2": "gömülməklə qəbirləri ziyarət etdiniz.",
            "verse 102:3": "Yox-yox! Siz aqibətinizi hökmən biləcəksiniz!",
            "verse 102:4": "Bir də yox! Siz aqibətinizi tezliklə biləcəksiniz!",
            "verse 102:5": "Xeyr! Kaş ki, yəqin biləydiniz.",
            "verse 102:6": "Siz Cəhənnəmi mütləq görəcəksiniz!",
            "verse 102:7": "Onu həqiqətən öz gözünüzlə mütləq görəcəksiniz!",
            "verse 102:8": "Sonra, o gün nemətlər barəsində hökmən sorğu-suala tutulacaqsınız."
        },
        "Bengali": {
            "verse 102:1": "প্রাচুর্যের লালসা তোমাদেরকে গাফেল রাখে,",
            "verse 102:2": "এমনকি, তোমরা কবরস্থানে পৌছে যাও।",
            "verse 102:3": "এটা কখনও উচিত নয়। তোমরা সত্ত্বরই জেনে নেবে।",
            "verse 102:4": "অতঃপর এটা কখনও উচিত নয়। তোমরা সত্ত্বরই জেনে নেবে।",
            "verse 102:5": "কখনই নয়; যদি তোমরা নিশ্চিত জানতে।",
            "verse 102:6": "তোমরা অবশ্যই জাহান্নাম দেখবে,",
            "verse 102:7": "অতঃপর তোমরা তা অবশ্যই দেখবে দিব্য প্রত্যয়ে,",
            "verse 102:8": "এরপর অবশ্যই সেদিন তোমরা নেয়ামত সম্পর্কে জিজ্ঞাসিত হবে।"
        },
        "Berber Amazigh": {
            "verse 102:1": "Tem$weô tessedha kwen,",
            "verse 102:2": "armi trezfem ar iéekwan.",
            "verse 102:3": "Xaîi! Deqqal a ppissinem.",
            "verse 102:4": "Da$en, xaîi! Deqqal a ppissinem.",
            "verse 102:5": "Xaîi! Lemmer, s tussna itebbten, ara tissinem,",
            "verse 102:6": "war ccekk, times, a p twalim.",
            "verse 102:7": "D$a, s tiî utebbet, ara p twalim.",
            "verse 102:8": "D$a, assen, war ccekk, fellawen asteqsi $ef lhawiyyat."
        },
        "Bosnian": {
            "verse 102:1": "Zaokuplja vas nastojanje da što imućniji budete",
            "verse 102:2": "sve dok grobove ne naselite.",
            "verse 102:3": "A ne valja tako, saznaćete svakako!",
            "verse 102:4": "I još jednom, ne valja tako! Saznaćete sigurno!",
            "verse 102:5": "Ne valja tako, neka znate pouzdano,",
            "verse 102:6": "Džehennem ćete vidjeti jasno!",
            "verse 102:7": "I još jednom, doista ćete ga vidjeti očigledno!",
            "verse 102:8": "Zatim ćete toga dana za sladak život biti pitani sigurno!"
        },
        "Bulgarian": {
            "verse 102:1": "Увлича ви преумножаването,",
            "verse 102:2": "додето легнете в гробовете.",
            "verse 102:3": "Ала не! Ще узнаете.",
            "verse 102:4": "И пак не! Ще узнаете.",
            "verse 102:5": "Ала не, ако знаете с достоверното знание -",
            "verse 102:6": "ще видите Ада.",
            "verse 102:7": "После ще го видите с достоверен поглед.",
            "verse 102:8": "После ще бъдете питани в този Ден за насладите [на земята]."
        },
        "Chinese": {
            "verse 102:1": "竞赛富庶, 已使你们疏忽,",
            "verse 102:2": "直到你们去游坟地。",
            "verse 102:3": "真的, 你们将来就知道了。",
            "verse 102:4": "真的, 你们将来就知道了。",
            "verse 102:5": "真的, 假若你们有真知灼见, (你们必不疏忽),",
            "verse 102:6": "你们必定看见火狱,",
            "verse 102:7": "然後, 你们必亲眼看见它。",
            "verse 102:8": "在那日, 你们必为恩泽而被审问。"
        },
        "Danish": {
            "verse 102:1": "Jacht naar vermeerdering van rijkdom (en kinderen) maakt u onachtzaam",
            "verse 102:2": "Totdat gij in uw graven nederdaalt",
            "verse 102:3": "Neen - gij zult weldra te weten komen",
            "verse 102:4": "Nogmaals neen! Gij zult weldra te weten komen",
            "verse 102:5": "Waarlijk, indien gij de zekerheid van kennis bezit",
            "verse 102:6": "Zult gij zeker de hel zien",
            "verse 102:7": "Ja, dan zult gij haar met zekerheid van blik zien",
            "verse 102:8": "Op die Dag zult gij worden ondervraagd over de gaven"
        },
        "Dutch": {
            "verse 102:1": "Jullie gaan op in de wedijver om meer.",
            "verse 102:2": "Totdat jullie in de graven terechtkomen.",
            "verse 102:3": "Nee, jullie zullen het weten.",
            "verse 102:4": "Nogmaals, nee! Jullie zullen het weten.",
            "verse 102:5": "Nee! Als jullie het maar met zekere kennis zouden weten!",
            "verse 102:6": "Jullie zullen zeker de Hel zien.",
            "verse 102:7": "Nogmaals, jullie zullen haar met een zeker oog zien.",
            "verse 102:8": "Dan zullen jullie op die Dag ondervraagd worden over de genietingen."
        },
        "English": {
            "verse 102:1": "Competition in [worldly] increase diverts you",
            "verse 102:2": "Until you visit the graveyards.",
            "verse 102:3": "No! You are going to know.",
            "verse 102:4": "Then no! You are going to know.",
            "verse 102:5": "No! If you only knew with knowledge of certainty...",
            "verse 102:6": "You will surely see the Hellfire.",
            "verse 102:7": "Then you will surely see it with the eye of certainty.",
            "verse 102:8": "Then you will surely be asked that Day about pleasure."
        },
        "Filipino": {
            "verse 102:1": "Ang pakikipagpaligsahan sa pagtitipon ng mga makamundong bagay ay nakakapanaig sa inyo upang lumihis (sa higit na mabubuting bagay)",
            "verse 102:2": "Hanggang sa inyong dalawin ang libingan (alalaong baga, hanggang kayo ay mamatay)",
            "verse 102:3": "walang pagsala! Inyong mapag-aalaman (ang katotohanan)",
            "verse 102:4": "At muli, ay inyong mapag-aalaman (ang katotohanan)",
            "verse 102:5": "Hindi! Kung inyo lamang nababatid ng may tiyak na kaalaman (ang kahihinatnan ng pagtitipon ng kayamanan, hindi sana ninyo ginugol ang inyong panahon sa mga makamundong bagay)",
            "verse 102:6": "walang pagsala! Inyong mapagmamalas ang Naglalagablab na Apoy (Impiyerno)",
            "verse 102:7": "At muli, walang pagsala na inyong matutunghayan ito",
            "verse 102:8": "At sa Araw na ito, kayo ay tatanungin hingil sa kasiyahan (na inyong pinagpasasaan sa mundong ito)"
        },
        "French": {
            "verse 102:1": "La course aux richesses vous distrait,",
            "verse 102:2": "jusqu'à ce que vous visitiez les tombes.",
            "verse 102:3": "Mais non! Vous saurez bientôt!",
            "verse 102:4": "(Encore une fois)! Vous saurez bientôt!",
            "verse 102:5": "Sûrement! Si vous saviez de science certaine.",
            "verse 102:6": "Vous verrez, certes, la Fournaise.",
            "verse 102:7": "Puis, vous la verrez certes, avec l'œil de la certitude.",
            "verse 102:8": "Puis, assurément, vous serez interrogés, ce jour-là, sur les délices."
        },
        "Fulah": {
            "verse 102:1": "Soklinii mon wasandirde heewde ngalu e sukaɓe",
            "verse 102:2": "Haa njuuriɗon genaale",
            "verse 102:3": "Alah yaama nganndon",
            "verse 102:4": "Refti ma on nganndu",
            "verse 102:5": "Ko goongo ma on nganndu ganndal yananeede",
            "verse 102:6": "Pellet ma on njii yiite",
            "verse 102:7": "Refti ma on njiirunge gite yananeede",
            "verse 102:8": "Refti ma on naamne ñande heen neema"
        },
        "German": {
            "verse 102:1": "Die Vermehrung lenkt euch ab,",
            "verse 102:2": "bis ihr die Friedhöfe besucht.",
            "verse 102:3": "Keineswegs! Ihr werdet (es noch) erfahren.",
            "verse 102:4": "Abermals: Keineswegs! Ihr werdet (es noch) erfahren.",
            "verse 102:5": "Keineswegs! Wenn ihr es nur mit dem Wissen der Gewißheit wüßtet!",
            "verse 102:6": "Ihr werdet ganz gewiß den Höllenbrand sehen.",
            "verse 102:7": "Abermals: Ihr werdet ihn mit dem Auge der Gewißheit sehen.",
            "verse 102:8": "Hierauf werdet ihr an jenem Tag ganz gewiß nach der Wonne gefragt werden."
        },
        "Hausa": {
            "verse 102:1": "Alfahari da yawan dũkiya da dangi ya shagaltar da ku (dagaibada mai amfaninku).",
            "verse 102:2": "Har kuka ziyarci kaburbura.",
            "verse 102:3": "A'aha! (Nan gaba) zã ku sani.",
            "verse 102:4": "Sa'an nan, tabbas, zã ku sani.",
            "verse 102:5": "Haƙĩƙa, da kuna da sani sani na yaƙĩni.",
            "verse 102:6": "Lalle ne da kuna ganin Jahĩm.",
            "verse 102:7": "Sa'an nan lalle ne za ku gan ta, da idanu, bayyane.",
            "verse 102:8": "Sa'an nan lalle ne za a tambaye ku, a rãnar nan lãbãrin ni'imar (da aka yi muku)."
        },
        "Hindi": {
            "verse 102:1": "कुल व माल की बहुतायत ने तुम लोगों को ग़ाफ़िल रखा",
            "verse 102:2": "यहाँ तक कि तुम लोगों ने कब्रें देखी (मर गए)",
            "verse 102:3": "देखो तुमको अनक़रीब ही मालुम हो जाएगा",
            "verse 102:4": "फिर देखो तुम्हें अनक़रीब ही मालूम हो जाएगा",
            "verse 102:5": "देखो अगर तुमको यक़ीनी तौर पर मालूम होता (तो हरगिज़ ग़ाफिल न होते)",
            "verse 102:6": "तुम लोग ज़रूर दोज़ख़ को देखोगे",
            "verse 102:7": "फिर तुम लोग यक़ीनी देखना देखोगे",
            "verse 102:8": "फिर तुमसे नेअमतों के बारें ज़रूर बाज़ पुर्स की जाएगी"
        },
        "Indonesian": {
            "verse 102:1": "Bermegah-megahan telah melalaikan kamu,",
            "verse 102:2": "sampai kamu masuk ke dalam kubur.",
            "verse 102:3": "Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu),",
            "verse 102:4": "dan janganlah begitu, kelak kamu akan mengetahui.",
            "verse 102:5": "Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin,",
            "verse 102:6": "niscaya kamu benar-benar akan melihat neraka Jahiim,",
            "verse 102:7": "dan sesungguhnya kamu benar-benar akan melihatnya dengan 'ainul yaqin.",
            "verse 102:8": "kemudian kamu pasti akan ditanyai pada hari itu tentang kenikmatan (yang kamu megah-megahkan di dunia itu)."
        },
        "Italian": {
            "verse 102:1": "Il rivaleggiare vi distrarrà,",
            "verse 102:2": "finché visiterete le tombe.",
            "verse 102:3": "Invece no! Ben presto saprete.",
            "verse 102:4": "E ancora no! Ben presto saprete.",
            "verse 102:5": "No! Se solo sapeste con certezza...",
            "verse 102:6": "Vedrete certamente la Fornace.",
            "verse 102:7": "Lo vedrete con l’occhio della certezza,",
            "verse 102:8": "quindi in quel Giorno, sarete interrogati sulla delizia."
        },
        "Japanese": {
            "verse 102:1": "あなたがたは（財産や息子などの）多いことを張り合って，現を抜かす。",
            "verse 102:2": "墓に追い立てられるまでも。",
            "verse 102:3": "いや，やがて（死後）あなたがたは（その真実を）知ろう。",
            "verse 102:4": "もう一度言おうか，いや，やがてあなたがたは知ろう。",
            "verse 102:5": "いや，あなたがたは（今に）はっきり知るとよいのである。",
            "verse 102:6": "あなたがたは必ず獄火を見よう。",
            "verse 102:7": "その時あなたがたはそれを明確に目で見ることであろう。",
            "verse 102:8": "その日あなたがたは，（現を抜かしていた）享楽に就いて，必ず問われるであろう。"
        },
        "Jawa": {
            "verse 102:1": "Sumugih iku nglalekake anggonira ngabekti ing Allah",
            "verse 102:2": "Nganti tekan anggonira ngalih marang kubur",
            "verse 102:3": "Anggonira sumugih iku luput, ing tembe sira mesthi weruh nyatane",
            "verse 102:4": "Luput temenan panemu ira, ing tembe sira weruh temenan nyatane",
            "verse 102:5": "Temen, menawa sira weruh ilmu kang nyata mesthi ora lali ngabekti ing Allah",
            "verse 102:6": "Ing tembe sira mesthi andeleng neraka jahim",
            "verse 102:7": "Handeleng kelawan kasat mata",
            "verse 102:8": "Sira banjur didangu sarupaning kabungahan paparinging Allah nalika ing donya, ya gene ora padha syukur"
        },
        "Kazakh": {
            "verse 102:1": "Сендерді арттыра түсу құмарлығы өзіне бұрып шұғылдандырып қойды",
            "verse 102:2": "тіпті қабірлерді зиярат еткендеріңше",
            "verse 102:3": "Жоқ, олай емес! Сендер жақында білесіңдер",
            "verse 102:4": "Кейін, тағы да жоқ! Сендер жақында білесіңдер",
            "verse 102:5": "Жоқ! Егер сендер айқын біліммен білгендеріңде еді",
            "verse 102:6": "Сендер Жахимді міндетті түрде көресіңдер",
            "verse 102:7": "Кейін оны айқын түрде көресіңдер",
            "verse 102:8": "Содан кейін сол күні сендер берілген игіліктер үшін міндетті түрде сұраласыңдар"
        },
        "Korean": {
            "verse 102:1": "축적한 것들이 너희를 벗어나게 하리니축적한 것들이 너희를 벗어나게 하리니",
            "verse 102:2": "너희가 무덤으로 갈 때 까지 오만하려 하느뇨너희가 무덤으로 갈 때 까지 오만하려 하느뇨",
            "verse 102:3": "그러나 너희는 곧 알게 되리 라그러나 너희는 곧 알게 되리 라",
            "verse 102:4": "실로 너희는 곧 알게 되리라실로 너희는 곧 알게 되리라",
            "verse 102:5": "너희가 분명한 지식을 갖고 있다면 너희는 알게 되리니너희가 분명한 지식을 갖고 있다면 너희는 알게 되리니",
            "verse 102:6": "너희는 지옥의 불을 볼 것이 라너희는 지옥의 불을 볼 것이 라",
            "verse 102:7": "실로 너희는 분명히 눈으로서 목격할 것이라실로 너희는 분명히 눈으로서 목격할 것이라",
            "verse 102:8": "그런 후 너희는 너희가 탐닉 했던 향락에 관하여 힐문을 받을 것이라그런 후 너희는 너희가 탐닉 했던 향락에 관하여 힐문을 받을 것이라"
        },
        "Kurdish": {
            "verse 102:1": "Pesindana (bi mal û mêran) wusa hûn dane mujûl kirin(خه‌ڵکینه‌!!) هه‌ڵپه‌کردن و پێشبڕکێتان بۆ زۆر کردنی (ماڵ و منداڵ و سامان و کۆشك و ته‌لارو... هتد) ئێوه‌ی سه‌رگه‌رم و سه‌رگه‌ردان و بێ ئاگا کردووه له خواناسی و دینداری.",
            "verse 102:2": "Heya hûn diçûne nava goran (we mirîne xwe didane nîşanê hev)تا ئه‌و کاته‌ی که ده‌مرن و ده‌برێنه گۆڕستان (ده‌خرێنه ناو گۆڕێکی ته‌نگ و ته‌سك و تاریکه‌وه‌).",
            "verse 102:3": "Na! (wekî gomana we nîne) lê hûnê di nezîk da (bi xeletî ya xwe) bi zaninواز بهێنن، له‌مه‌ودوا ده‌زانن چ (قوڕێکتان بۆ خۆتان گرتۆته‌وه‌، چ به‌ڵایه‌کتان به‌سه‌ر خۆتان هێناوه‌).",
            "verse 102:4": "Dîsa na! (wekî gotina we nîne) hûnê di nezîk da bi rastî (bi xeletî ya xwe) bi zaninدیسانه‌وه ده‌ڵێم: واز بهێنن.",
            "verse 102:5": "Na! (wekî gomana we nîne) lê heke bi rastî we (maf) bi zanî ya ( we wusa ne dikir)واز بهێنن، ئه‌گه‌ر ئێوه ده‌تانزانی، به‌زانین و دڵنیایه‌کی ته‌واوه‌وه (وا بێ ئاگا نه‌ده‌بوون له خواناسی).",
            "verse 102:6": "Bi sond! hûnê dojê bi bîninسوێند به‌خوا بێگومان دۆزه‌خ ده‌بینن (دۆزه‌خێکی تۆقێنه‌رو پڕ له ئازارو ناسۆره‌).",
            "verse 102:7": "Dîsa bi sond! hûnê ewê (dojê bi çavekî tûj) bi bîninدووباره سوێند به‌خوا دۆزه‌خ به‌چاوی سه‌رتان ده‌یبینن به ئاشکراو دڵنیا ده‌بن (که چه‌نده سامناکه‌).",
            "verse 102:8": "Di wê rojêda hûnêpaşê ji wan qencîne (bi we ra hatine kirinê) bêne pirs kirinêپاشان سوێند به‌خوا له‌و ڕۆژه‌دا پرسیارتان لێ ده‌کرێت ده‌رباره‌ی هه‌موو نازو نیعمه‌ته‌کانی دنیا (چۆنتان په‌یدا کردووه‌و له چیدا به‌کارتان هێناوه‌)."
        },
        "Kyrgyz": {
            "verse 102:1": "(Дүйнө, бала-чака) көбөйтүү (жана аны менен сыймыктануу) силерди (ибадаттан) алаксытып койду",
            "verse 102:2": "Тээ мүрзөгө келгениңерге чейин",
            "verse 102:3": "Жок! (Өмүр деген дүйнөгө кул болуу үчүн берилген эмес!) Силер (муну) жакында билип аласыңар",
            "verse 102:4": "Дагы бир ирет жок! Силер жакында (Кыяматтагы сурак учурунда) билип аласыңар",
            "verse 102:5": "Жок-жок, эгер силер (чындыкты ушул дүйнөдө) анык билгениңерде (дүйнөгө кул болбойт элеңер)",
            "verse 102:6": "(Эми) тозокту көрүшүңөр анык",
            "verse 102:7": "Анан аны албетте өз көзүңөр менен көрөсүңөр",
            "verse 102:8": "Андан соң, ошол күнү (Аллаһ тарабынан аманатка берилген) нээматтар (өмүр, мал-дүйнө, бала-чака) жөнүндө албетте сураласыңар"
        },
        "Malay": {
            "verse 102:1": "Kamu telah dilalaikan (daripada mengerjakan amal bakti) oleh perbuatan berlumba-lumba untuk mendapat dengan sebanyak-banyaknya (harta benda, anak-pinak pangkat dan pengaruh), -",
            "verse 102:2": "Sehingga kamu masuk kubur.",
            "verse 102:3": "Jangan sekali-kali (bersikap demikian)! Kamu akan mengetahui kelak (akibatnya yang buruk semasa hendak mati)!",
            "verse 102:4": "Sekali lagi (diingatkan): jangan sekali-kali (kamu bersikap demikian)! Kamu akan mengetahui kelak akibatnya yang buruk pada hari kiamat)!",
            "verse 102:5": "Demi sesungguhnya! Kalaulah kamu mengetahui - (apa yang kamu akan hadapi) - dengan pengetahuan yang yakin, (tentulah kamu akan mengerjakan perkara-perkara yang menjadi bekalan kamu untuk hari akhirat).",
            "verse 102:6": "(Ingatlah) demi sesungguhnya! - Kamu akan melihat neraka yang marak menjulang.",
            "verse 102:7": "Selepas itu - demi sesungguhnya! - kamu (wahai orang-orang yang derhaka) akan melihatnya dengan penglihatan yang yakin (semasa kamu dilemparkan ke dalamnya)!",
            "verse 102:8": "Selain dari itu, sesungguhnya kamu akan ditanya pada hari itu, tentang segala nikmat (yang kamu telah menikmatinya)!"
        },
        "Malayalam": {
            "verse 102:1": "പരസ്പരം പെരുമനടിക്കുക എന്ന കാര്യം നിങ്ങളെ അശ്രദ്ധയിലാക്കിയിരിക്കുന്നു.",
            "verse 102:2": "നിങ്ങള്‍ ശവകുടീരങ്ങള്‍ സന്ദര്‍ശിക്കുന്നത് വരേക്കും.",
            "verse 102:3": "നിസ്സംശയം, നിങ്ങള്‍ വഴിയെ അറിഞ്ഞ് കൊള്ളും.",
            "verse 102:4": "പിന്നെയും നിസ്സംശയം നിങ്ങള്‍ വഴിയെ അറിഞ്ഞ് കൊള്ളും.",
            "verse 102:5": "നിസ്സംശയം, നിങ്ങള്‍ ദൃഢമായ അറിവ് അറിയുമായിരുന്നെങ്കില്‍",
            "verse 102:6": "ജ്വലിക്കുന്ന നരകത്തെ നിങ്ങള്‍ കാണുക തന്നെ ചെയ്യും.",
            "verse 102:7": "പിന്നെ തീര്‍ച്ചയായും നിങ്ങള്‍ അതിനെ ദൃഢമായും കണ്ണാല്‍ കാണുക തന്നെ ചെയ്യും.",
            "verse 102:8": "പിന്നീട് ആ ദിവസത്തില്‍ സുഖാനുഭവങ്ങളെ പറ്റി തീര്‍ച്ചയായും നിങ്ങള്‍ ചോദ്യം ചെയ്യപ്പെടുകതന്നെ ചെയ്യും."
        },
        "Norwegian": {
            "verse 102:1": "Eie-mest mentaliteten opptar dere",
            "verse 102:2": "til dere går til gravene!",
            "verse 102:3": "Nei, sannelig, dere skal få å vite!",
            "verse 102:4": "Så sannelig, dere skal få å vite!",
            "verse 102:5": "Nei, sannelig, om dere bare visste med visshets kunnskap!",
            "verse 102:6": "Dere skal visselig se helvete!",
            "verse 102:7": "Ja, sannelig skal dere se det med sikkert blikk!",
            "verse 102:8": "Og så, på den dag, skal dere visselig få svare for velstanden."
        },
        "Pashto": {
            "verse 102:1": "تاسو غافله كړئ فخر كولو په یو بل باندې په ډېروالي (د مال، اولاد او قام) سره",
            "verse 102:2": "تر هغه پورې چې تاسو هدېرو ته ورشئ",
            "verse 102:3": "داسې نه ده په كار، ژر ده چې تاسو به پوه شئ",
            "verse 102:4": "بیا بېخي داسې نه ده، ژر ده چې تاسو به پوه شئ",
            "verse 102:5": "داسې نه ده كه تاسو په علم اليقين سره پوهېدلى",
            "verse 102:6": "تاسو به خامخا ضرور دوزخ وینئ",
            "verse 102:7": "بیا به تاسو خامخا ضرور دغه (دوزخ) د یقین په سترګو وینئ",
            "verse 102:8": "بیا به په دغې ورځ كې له تاسو نه خامخا ضرور د نعمتونو په باره كې تپوس كېږي"
        },
        "Persian": {
            "verse 102:1": "به غفلت كشيد شما را نازشِ به بسيارى مال و فرزند،",
            "verse 102:2": "تا به گورها رسيديد.",
            "verse 102:3": "حقا كه به زودى خواهيد دانست.",
            "verse 102:4": "باز هم حقا كه به زودى خواهيد دانست.",
            "verse 102:5": "حقا، اگر از روى يقين بدانيد،",
            "verse 102:6": "البته جهنم را خواهيد ديد.",
            "verse 102:7": "سپس به چشم يقينش خواهيد ديد،",
            "verse 102:8": "كه در آن روز شما را از نعمتهاى دنيوى بازخواست مى‌كنند."
        },
        "Polish": {
            "verse 102:1": "Zabawia was współzawodnictwo w pomnażaniu",
            "verse 102:2": "Do chwili, gdy odwiedzicie groby.",
            "verse 102:3": "Wcale nie! Wy wkrótce będziecie wiedzieć!",
            "verse 102:4": "Jeszcze raz nie! Wy wkrótce będziecie wiedzieć!",
            "verse 102:5": "Wcale nie! Gdybyście wiedzieli wiedzą pewną!",
            "verse 102:6": "Z pewnością zobaczycie ogień piekielny!",
            "verse 102:7": "Potem, z pewnością, zobaczycie go okiem pewności!",
            "verse 102:8": "Potem, z pewnością, zostaniecie zapytani tego Dnia o szczęśliwość!"
        },
        "Portuguese": {
            "verse 102:1": "A cobiça vos entreterá,",
            "verse 102:2": "Até que desçais aos sepulcros.",
            "verse 102:3": "Qual! Logo o sabereis!",
            "verse 102:4": "Novamente, qual! Logo o sabereis!",
            "verse 102:5": "Qual! Se soubésseis da ciência certa!",
            "verse 102:6": "Verdadeiramente, então, havíeis de ver a fogueira do inferno!",
            "verse 102:7": "Logo a vereis claramente.",
            "verse 102:8": "Então, sereis interrogados, nesse dia, a respeito dos prazeres (mundanos)."
        },
        "Punjabi": {
            "verse 102:1": "ਜ਼ਿਆਦਾ ਦੇ ਲਾਲਚ ਨੇ ਤੁਹਾਨੂੰ ਭੂਲਾ ਰੱਖਿਆ ਹੈ।",
            "verse 102:2": "ਇੱਥੋਂ ਤੱਕ ਕਿ ਤੁਸੀਂ ਕਬਰਾਂ ਵਿਚ ਜਾ ਪੁੱਜੇ।",
            "verse 102:3": "ਕਦੇ ਵੀ ਨਹੀਂ, ਤੁਸੀਂ ਬਹੁਤ ਜਲਦੀ ਜਾਣ ਲਵੌਗੇ।",
            "verse 102:4": "ਫਿਰ ਕਦੇ ਵੀ ਨਹੀਂ, ਤੁਸੀਂ ਬਹੁਤ ਜਲਦੀ ਜਾਣ ਲਵੋਗੇ।",
            "verse 102:5": "ਕਦੇ ਵੀ ਨਹੀਂ, ਜੇਕਰ ਤੁਸੀਂ ਵਿਸ਼ਵਾਸ਼ ਦੇ ਨਾਲ ਜਾਣਦੇ।",
            "verse 102:6": "ਕਿ ਤੁਸੀਂ ਨਰਕ ਨੂੰ ਜ਼ਰੂਰ ਦੇਖੌਗੇ।",
            "verse 102:7": "ਫਿਰ ਤੁਸੀਂ ਉਸ ਨੂੰ ਵਿਸ਼ਵਾਸ਼ ਦੀ ਅੱਖ ਨਾਲ ਦੇਖੋਗੇ।",
            "verse 102:8": "ਫਿਰ ਉਸ ਦਿਨ ਯਕੀਨਨ ਤੁਹਾਡੇ ਤੋਂ ਨਿਅਮਤਾਂ ਦੇ ਸੰਬੰਧੀ ਜ਼ਰੂਰ ਪੁੱਛ ਹੋਵੇਗੀ।"
        },
        "Roman english": {
            "verse 102:1": "Al haaku mut takathur",
            "verse 102:2": "Hatta zurtumul-maqaabir",
            "verse 102:3": "Kalla sawfa ta`lamoon",
            "verse 102:4": "Thumma kalla sawfa ta`lamoon",
            "verse 102:5": "Kalla law ta`lamoona `ilmal yaqeen",
            "verse 102:6": "Latara-wun nal jaheem",
            "verse 102:7": "Thumma latara wunnaha `ainal yaqeen",
            "verse 102:8": "Thumma latus alunna yauma-izin `anin na`eem"
        },
        "Russian": {
            "verse 102:1": "Страсть к накоплению добра Вас отвлекает от деяний должных",
            "verse 102:2": "До самой гробовой доски.",
            "verse 102:3": "Но нет, познаете вы скоро!",
            "verse 102:4": "И вновь, познаете вы скоро!",
            "verse 102:5": "Но нет же! Если бы вы знали знаньем достоверным,",
            "verse 102:6": "Узрели бы вы пламя Ада.",
            "verse 102:7": "Поистине, вы оком достоверным Увидите его!",
            "verse 102:8": "Поистине, В тот День Сполна с вас спросят за греховные услады, (Что вы вкусили на земле)."
        },
        "Sindhi": {
            "verse 102:1": "(اي ماڻھو) پاڻ ۾ گھڻائي (تي مرڪڻ) اوھان کي ويسلو ڪيو.",
            "verse 102:2": "تان جو قبرن کي ڏٺوَ.",
            "verse 102:3": "ائين نه آھي سگھوئي ڄاڻندؤ.",
            "verse 102:4": "وري (چئون ٿا ته) سگھوئي ڄاڻندؤ.",
            "verse 102:5": "نه نه! جيڪڏھن پڪي ويساھ سان ڄاڻو ھا (ته ويسلو نه ويھو ھا).",
            "verse 102:6": "قسم آھي ته ضرور دوزخ کي ڏسندؤ.",
            "verse 102:7": "وري به ان کي يقين واريءَ اک سان ضرور ڏسندؤ.",
            "verse 102:8": "وري اُن ڏينھن نعمتن بابت اوھان کان ضرور پڇبو."
        },
        "Sinhalese": {
            "verse 102:1": "තරඟ වදිමින් (වස්තුව) අධික ලෙස රැස් කිරීම (අල්ලාහ් ව සිහිපත් කිරීමෙන්) නුඹලා ව වෙනතකට යොමු කර ඇත.",
            "verse 102:2": "නුඹලා මිනීවළවල් හමු වන තුරු,",
            "verse 102:3": "එසේ නොව, නුඹලා මතු දැන ගනු ඇත.",
            "verse 102:4": "යළි එසේ නොව, නුඹලා මතු දැන ගනු ඇත.",
            "verse 102:5": "එසේ නොව නුඹලා තිරසාර දැනුමින් දැන ගන්නෙහු නම්,",
            "verse 102:6": "නුඹලා සැබැවින්ම නිරය දකිනු ඇත.",
            "verse 102:7": "පසුව නුඹලා එය තිරසාර ලෙස දකිනු ඇත.",
            "verse 102:8": "තවද එදින නුඹලා (භුක්ති වින්දා වූ) සැප සම්පත් පිළිබඳ ව විමසනු ලබනු ඇත."
        },
        "Somali": {
            "verse 102:1": "Waxaa idin shuqliyay Dadow wax badsasho (iyo isu faanid),",
            "verse 102:2": "Intaad Xabaalaha ka tagtaan (dhimataan).",
            "verse 102:3": "Saas ma aha ee waad ogaandoontaan.",
            "verse 102:4": "Haddana saas ma ehee waad ogaandoontaan (Faanka cidhibtiisa).",
            "verse 102:5": "Haddaad dhab ahaan wax u ogtihiin (Waad dayn lahaydeen xumaanta).",
            "verse 102:6": "Dhab ahaan baad u arkaysaan (Naarta) Jaxiima,",
            "verse 102:7": "Ka dibna waxaad u arkaysaan Nartaas si yaqiin ah.",
            "verse 102:8": "Waxaana laydin warsan Maalintaas Nicmadii."
        },
        "Spanish": {
            "verse 102:1": "La rivalidad por tener más os mantiene ocupados",
            "verse 102:2": "hasta que visitáis los cementerios.",
            "verse 102:3": "Pero no! Ya sabréis.",
            "verse 102:4": "Sí, luego sabréis.",
            "verse 102:5": "Si supierais a ciencia cierta.",
            "verse 102:6": "Tened por seguro que veréis el Yahim.",
            "verse 102:7": "Lo veréis con el ojo de la certeza.",
            "verse 102:8": "Y ese día, se os preguntará por los momentos de dicha que hayáis tenido."
        },
        "Swahili": {
            "verse 102:1": "Kumekushughulisheni kutafuta wingi,",
            "verse 102:2": "Mpaka mje makaburini!",
            "verse 102:3": "Sivyo hivyo! Mtakuja jua!",
            "verse 102:4": "Tena sivyo hivyo! Mtakuja jua!",
            "verse 102:5": "Sivyo hivyo! Lau mngeli jua kwa ujuzi wa yakini,",
            "verse 102:6": "Basi bila ya shaka mtaiona Jahannamu!",
            "verse 102:7": "Tena, bila ya shaka, mtaiona kwa jicho la yakini.",
            "verse 102:8": "Tena bila ya shaka mtaulizwa siku hiyo juu ya neema."
        },
        "Swedish": {
            "verse 102:1": "NI FINNER ert nöje i att överglänsa varandra i rikedom och världsliga framgångar",
            "verse 102:2": "ända till dess ni står vid gravens rand.",
            "verse 102:3": "Ack nej! En dag skall ni få veta [ert misstag]!",
            "verse 102:4": "Ja, en dag skall ni få veta [ert misstag]!",
            "verse 102:5": "Ack, om ni visste det [nu] med full visshet...!",
            "verse 102:6": "Ja, ni skall få skåda helvetets eld!",
            "verse 102:7": "Era egna ögons vittnesbörd skall då ge er visshet,",
            "verse 102:8": "och den Dagen skall ni ställas till svars för [vad ni gjorde av] det goda som skänktes er [i livet]!"
        },
        "Tajik": {
            "verse 102:1": "Ба ғафлат кашид шуморо фахр кардан ба бисёрии молу фарзанд,",
            "verse 102:2": "то ба гӯрҳо расидед.",
            "verse 102:3": "Ҳаққо, ки ба зудӣ хоҳед донист.",
            "verse 102:4": "Боз ҳам ҳаққо, ки ба зудӣ хоҳед донист.",
            "verse 102:5": "Ҳаққо агар аз рӯи яқин бидонед,",
            "verse 102:6": "албатта, ҷаҳаннамро хоҳед дид.",
            "verse 102:7": "Сипас ба чашми яқинаш хоҳед дид,",
            "verse 102:8": "сипас дар он рӯз шуморо аз неъматҳои дунявӣ бозхост мекунанд."
        },
        "Tamil": {
            "verse 102:1": "செல்வத்தைப் பெருக்கும் ஆசை உங்களை (அல்லாஹ்வை விட்டும்) பராக்காக்கி விட்டது-",
            "verse 102:2": "நீங்கள் கப்றுகளைச் சந்திக்கும் வரை.",
            "verse 102:3": "அவ்வாறில்லை, விரைவில் (அதன் பலனை) நீங்கள் அறிந்து கொள்வீர்கள்.",
            "verse 102:4": "பின்னர் அவ்வாறல்ல, விரைவில் (அதன் பலனை) நீங்கள் அறிந்து கொள்வீர்கள்.",
            "verse 102:5": "அவ்வாறல்ல - மெய்யான அறிவைக் கொண்டறிந்திருப்பீர்களானால் (அந்த ஆசை உங்களைப் பராக்காக்காது).",
            "verse 102:6": "நிச்சயமாக (அவ்வாசையால்) நீங்கள் நரகத்தைப் பார்ப்பீர்கள்.",
            "verse 102:7": "பின்னும், நீங்கள் அதை உறுதியாகக் கண்ணால் பார்ப்பீர்கள்.",
            "verse 102:8": "பின்னர் அந்நாளில் (இம்மையில் உங்களுக்கு அளிக்கப்பட்டிருந்த) அருட் கொடைகளைப் பற்றி நிச்சயமாக நீங்கள் கேட்கப்படுவீர்கள்."
        },
        "Tatar": {
            "verse 102:1": "Сезне ахирәт өчен кирәк булган гамәлләрдән гафил кылды, алдады, мәхрүм итте, дөнья малын күбәйтү белән мактанышуларыгыз.",
            "verse 102:2": "Хәттә үлеп кабергә кергәнегезгә хәтле алдануыгызны, дәвам иттердегез.",
            "verse 102:3": "Юк, алданмагыз, әле дөньяга алданып тыныч кына яшәсәгез дә, тиздән белерсез алданганыгызны!",
            "verse 102:4": "Янә әйтәмен, әле тыныч кына йөрсәгез дә мәңгегә алданганыгызны тиздән белерсез!",
            "verse 102:5": "Юк алданмагыз, әгәр дөньяга алданып ахирәттән мәхрүм калуның иң зур алдану икәнен чын белү белән белсәгез, әлбәттә, дөньяга һич тә алданмаган булыр идегез.",
            "verse 102:6": "Сез, әлбәттә, җәһәннәмне күрерсез.",
            "verse 102:7": "Соңрак аны якыннан ачык күрерсез.",
            "verse 102:8": "Соңра сезне ахирәт гамәленнән мәхрүм иткән дөнья нигъмәтләреннән соралырсыз. Бит Аллаһ сезгә гакыл фикерне һәм күз, колак, телне һәм аяк-кулны дөньяда яшәр өчен генә түгел, бәлки ахирәткә хәзерләнер өчен биргән иде, шулай ук дөнья байлыгын да ахирәткә хәзерләнү өчен кулланырга биргән иде."
        },
        "Telugu": {
            "verse 102:1": "(ఇహలోక) పేరాస మిమ్మల్ని ఏమరుపాటులో పడవేసింది",
            "verse 102:2": "మీరు గోరీలలోకి చేరే వరకు",
            "verse 102:3": "అలా కాదు! త్వరలోనే మీరు తెలుసు కుంటారు",
            "verse 102:4": "మరొకసారి (వినండి)! వాస్తవంగా, మీరు అతి త్వరలోనే తెలుసుకుంటారు",
            "verse 102:5": "ఎంత మాత్రము కాదు! ఒకవేళ మీరు నిశ్చిత జ్ఞానంతో తెలుసుకొని ఉంటే (మీ వైఖరి ఇలా ఉండేది కాదు)",
            "verse 102:6": "నిశ్చయంగా, మీరు భగభగ మండే నరకాగ్నిని చూడగలరు",
            "verse 102:7": "మళ్ళీ అంటున్నాను! మీరు తప్పక దానిని (నరకాగ్నిని) నిస్సంకోచమైన దృష్టితో చూడగలరు",
            "verse 102:8": "అప్పుడు, ఆ రోజు మీరు (ఈ జీవితంలో అనుభవించిన) సౌఖ్యాలను గురించి తప్పక ప్రశ్నించబడతారు"
        },
        "Thai": {
            "verse 102:1": "การสะสมทรัพย์สมบัติเพื่ออวดอ้างได้ทำให้พวกเจ้าเพลิดเพลิน",
            "verse 102:2": "จนกระทั่งพวกเจ้าได้เข้าไปเยือนหลุมฝังศพ",
            "verse 102:3": "เปล่าเลย พวกเจ้าจะได้รู้",
            "verse 102:4": "แล้วก็เปล่าเลย พวกเจ้าจะได้รู้",
            "verse 102:5": "มิใช่เช่นนั้น ถ้าพวกเจ้าได้รู้อย่างแท้จริงแล้ว",
            "verse 102:6": "แน่นอน พวกเจ้าจะเห็นไฟที่ลุกโชน",
            "verse 102:7": "แล้วแน่นอนพวกเจ้าจะได้เห็นมัน ด้วยสายตาที่แน่ชัด",
            "verse 102:8": "แล้วในวันนั้นพวกเจ้าจะถูกสอบถามเกี่ยวกับความโปรดปรานที่ได้รับ (ในโลกดุนยา)"
        },
        "Turkish": {
            "verse 102:1": "Çoğunluk olmak iddianız sizi o kadar meşgul etti ki, mezarları ziyaretle oradakileri de sayacak kadar oldunuz.",
            "verse 102:2": "Çoğunluk olmak iddianız sizi o kadar meşgul etti ki, mezarları ziyaretle oradakileri de sayacak kadar oldunuz.",
            "verse 102:3": "Hayır; öyle olmayın; yakında bileceksiniz.",
            "verse 102:4": "Hayır; gözünüzü açın; yakında bileceksiniz.",
            "verse 102:5": "Dikkat edin, şayet yaptığınızın sonucunu kesin olarak bir bilseniz!",
            "verse 102:6": "And olsun ki, cehennemi göreceksiniz.",
            "verse 102:7": "And olsun ki, onu gözünüzle kesin olarak göreceksiniz.",
            "verse 102:8": "Sonra o gün, size verilmiş olan her nimetten sorguya çekileceksiniz."
        },
        "Urdu": {
            "verse 102:1": "(لوگو) تم کو (مال کی) بہت سی طلب نے غافل کر دیا",
            "verse 102:2": "یہاں تک کہ تم نے قبریں جا دیکھیں",
            "verse 102:3": "دیکھو تمہیں عنقریب معلوم ہو جائے گا",
            "verse 102:4": "پھر دیکھو تمہیں عنقریب معلوم ہو جائے گا",
            "verse 102:5": "دیکھو اگر تم جانتے (یعنی) علم الیقین (رکھتے تو غفلت نہ کرتے)",
            "verse 102:6": "تم ضرور دوزخ کو دیکھو گے",
            "verse 102:7": "پھر اس کو (ایسا) دیکھو گے (کہ) عین الیقین (آ جائے گا)",
            "verse 102:8": "پھر اس روز تم سے (شکر) نعمت کے بارے میں پرسش ہو گی"
        },
        "Uyghur": {
            "verse 102:1": "تاكى قەبرىلەرنى زىيارەت قىلغىنىڭلارغا (يەنى قەبرىلەرگە كۆمۈلگىنىڭلارغا) قەدەر، (پۇل - مال، بالىلار بىلەن) پەخىرلەنمەك سىلەرنى غەپلەتتە قالدۇردى",
            "verse 102:2": "تاكى قەبرىلەرنى زىيارەت قىلغىنىڭلارغا (يەنى قەبرىلەرگە كۆمۈلگىنىڭلارغا) قەدەر، (پۇل - مال، بالىلار بىلەن) پەخىرلەنمەك سىلەرنى غەپلەتتە قالدۇردى",
            "verse 102:3": "راستلا كەلگۈسىدە بىلىسىلەر",
            "verse 102:4": "ئاندىن راستلا كەلگۈسىدە بىلىسىلەر",
            "verse 102:5": "ئەگەر سىلەر راستلا ھەقىقىي بىلسەڭلار (غەپلەتتە قالماڭلار)",
            "verse 102:6": "سىلەر چوقۇم جەھەننەمنى كۆرىسىلەر",
            "verse 102:7": "ئاندىن ئۇنى چوقۇم ئۆز كۆزۈڭلار بىلەن كۆرىسىلەر",
            "verse 102:8": "ئاندىن (دۇنيادا سىلەرگە بېرىلگەن) نېمەتلەردىن سوئال - سوراق قىلىنىسىلەر"
        },
        "Uzbek": {
            "verse 102:1": "Кимники кўп сизни машғул қилди.",
            "verse 102:2": "То қабрларни зиёрат қилгунингизча",
            "verse 102:3": "Йўқ! Сизлар тезда биласизлар.",
            "verse 102:4": "Яна йўқ! Сизлар тезда биласизлар.",
            "verse 102:5": "Йўқ! Агар сизлар аниқ илм ила билганингизда эди.",
            "verse 102:6": "Албатта, жаҳаннамни кўрасизлар.",
            "verse 102:7": "Ва яна, албатта, уни ишонч кўзи билан кўрасизлар.",
            "verse 102:8": "Сўнгра ўша кунда, албатта, берилган неъматлардан сўраласизлар."
        },
        "Vietnamese": {
            "verse 102:1": "Sự khao khát đạt được nhiều của cải và con cái khiến các ngươi (hỡi con người) bận rộn (đến mức quên Allah).",
            "verse 102:2": "(Các ngươi cứ bận rộn như thế) cho tới khi các ngươi ghé thăm các nghĩa địa.",
            "verse 102:3": "Không! Nhất định các ngươi sẽ biết.",
            "verse 102:4": "Không! Rồi đây, chắc chắn các ngươi sẽ biết.",
            "verse 102:5": "Không! Phải chi các ngươi biết với một sự hiểu biết kiên định (thì chắc chắn các ngươi đã không quá bận rộn với của cải và con cái).",
            "verse 102:6": "Chắc chắn các ngươi sẽ nhìn thấy Hỏa Ngục.",
            "verse 102:7": "Rồi đây, chắc chắn các ngươi sẽ tận mắt nhìn thấy nó một cách chắc chắn.",
            "verse 102:8": "Rồi đây, vào Ngày đó, chắc chắn các ngươi sẽ bị tra hỏi về những lạc thú (mà các ngươi đã tận hưởng)."
        },
        "Yoruba": {
            "verse 102:1": "Wiwa oore aye ni opolopo fun iyanran sise ti ko airoju fesin ba yin",
            "verse 102:2": "titi e fi wo inu saree",
            "verse 102:3": "Rara (ko ye ko ri bee, amo) laipe e maa mo",
            "verse 102:4": "Leyin naa, ni ododo laipe e maa mo",
            "verse 102:5": "Bee ni, ti o ba je pe e ni imo amodaju ni (eyin iba ti se bee)",
            "verse 102:6": "Dajudaju e maa ri ina Jehim",
            "verse 102:7": "Leyin naa, dajudaju e maa ri i ni aridaju",
            "verse 102:8": "Leyin naa, dajudaju ni ojo yen won maa bi yin leere nipa igbadun (aye yii)"
        }
    }
}