{
    "id": 103,
    "name_simple": "Al-'Asr",
    "revelation_place": "makkah",
    "revelation_order": 13,
    "bismillah_pre": true,
    "verses_count": 3,
    "short_text": "The Surah takes its name from the word al-'asr occurring in the first verse.",
    "text": [
        "The Surah takes its name from the word al-'asr occurring in the  first verse .",
        "Period of Revelation",
        "Although Mujahid, Qatadah and Muqatil regard Surah Al-'Asr as a Madani Surah, a great majority of the commentators opine that it is Makki; its subject matter also testifies that it must have been sent down in the earliest stage in Makkah, when the message of Islam was being presented in brief but highly impressive sentences so that the listeners who heard them once could not forget them even if they wanted to, for they were automatically committed to memory.",
        "Theme and Subject Matter",
        "This Surah is a inimitable specimen of comprehensiveness and brevity. A whole world of meaning has been compressed into its few brief words, which is too vast in content to be fully expressed even in a book. In the surah, in a clear and plain way, the way to true success for man and the way to ruin and destruction for him have both been stated. Imam Ash Shafi'i has very rightly said that if the people only considered this Surah well, it alone would suffice them for their guidance. How important this Surah was in the sight of the Companions can be judged from the tradition cited from Hadrat Abdullah bin Hisn ad-Darimi Abu Madinah, according to which whenever any two of them met, they would not part company until they had recited Surah Al-Asr to each other. (Tabarani)"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by the decline of Time and humankind’s absolute loss of every single thing but righteousness, truth, patience, and faith. It takes its name from the phrase “by time” (wal- ʿāṣr) as mentioned in verse 1. The surah shows the way to salvation. The image of a declining day suggests the stage in the day, or in life, when only a short while is left for those wishing to make up for lost time.The surah is also known as: Afternoon, The Decline of Time, The Declining Day, The Epoch, The Late Afternoon, Time and Age, Time through the Ages.",
    "name_translation": "Time",
    "name_complex": "Al-‘Asr",
    "surah_name_ar": "العصر",
    "verses": {
        "Albanian": {
            "verse 103:1": "Betohem në kohë, -",
            "verse 103:2": "me të vërtetë, njeriu është në humbje,",
            "verse 103:3": "përveç atyre që besojnë dhe punojnë vepra të mira, dhe të cilët rekomandojnë njëri-tjetrit të vërtetën (fenë Islame), dhe të cilët i rekomandojnë njëri-tjetrit durimin, (në zbatimin e urdhërave të Perëndisë)."
        },
        "Amharic": {
            "verse 103:1": "በጊዜያቱ እምላለሁ፡፡",
            "verse 103:2": "ሰው ሁሉ በእርግጥ በከሳራ ውስጥ ነው፡፡",
            "verse 103:3": "እነዚያ ያመኑትና መልካሞችን የሠሩት፣ በእውነትም አደራ የተባባሉት፣ በመታገስም አደራ የተባባሉት ብቻ ሲቀሩ፡፡"
        },
        "Arabic": {
            "verse 103:1": "ِرْصَعْلاَو",
            "verse 103:2": "ٍرْسُخ يِفَل َناَسنِإْلا َّنِإ",
            "verse 103:3": "ِرْبَّصلاِب اْوَصاَوَتَو ِّقَحْلاِب اْوَصاَوَتَو ِتاَحِلاَّصلا اوُلِمَعَو اوُنَمآ َنيِذَّلا اَّلِإ"
        },
        "Azerbaijani": {
            "verse 103:1": "And olsun axşam çağına!",
            "verse 103:2": "Həqiqətən, insan ziyan içərisindədir.",
            "verse 103:3": "Yalnız iman gətirib yaxşı işlər görənlər, bir-birinə haqqı məsləhət görənlər və bir-birinə səbirli olmağı məsləhət edənlərdən başqa."
        },
        "Bengali": {
            "verse 103:1": "কসম যুগের (সময়ের),",
            "verse 103:2": "নিশ্চয় মানুষ ক্ষতিগ্রস্ত;",
            "verse 103:3": "কিন্তু তারা নয়, যারা বিশ্বাস স্থাপন করে ও সৎকর্ম করে এবং পরস্পরকে তাকীদ করে সত্যের এবং তাকীদ করে সবরের।"
        },
        "Berber Amazigh": {
            "verse 103:1": "S wakud!",
            "verse 103:2": "Ih, amdan, war ccekk, ar di lexsaôa.",
            "verse 103:3": "Kkes ed wid iumnen, ixeddmen ayen ilhan, ippemyenhun ar tidep, ippemyenhun ar ûûbeô."
        },
        "Bosnian": {
            "verse 103:1": "Tako mi vremena –",
            "verse 103:2": "čovjek, doista, gubi,",
            "verse 103:3": "samo ne oni koji vjeruju i dobra djela čine, i koji jedni drugima istinu preporučuju i koji jedni drugima preporučuju strpljenje."
        },
        "Bulgarian": {
            "verse 103:1": "Кълна се в следобеда -",
            "verse 103:2": "човекът е в загуба,",
            "verse 103:3": "освен онези, които вярват и вършат праведни дела, и взаимно се наставляват за истината, и взаимно се наставляват за търпението."
        },
        "Chinese": {
            "verse 103:1": "以时光盟誓，",
            "verse 103:2": "一切人确是在亏折之中，",
            "verse 103:3": "惟信道而且行善，并以真理相劝，以坚忍相勉的人则不然。"
        },
        "Danish": {
            "verse 103:1": "Bij de tijd",
            "verse 103:2": "Voorzeker, de mens is te midden van verlies",
            "verse 103:3": "Behalve degenen die geloven en goede werken doen, en elkander tot waarheid, en geduld aansporen"
        },
        "Dutch": {
            "verse 103:1": "Bij de tijd.",
            "verse 103:2": "Voorwaar, de mens lijdt zeker verlies.",
            "verse 103:3": "Behalve degenen die geloven en goede daden verrichten en elkaar aansporen tot de Waarheid en elkaar aansporen tot geduld."
        },
        "English": {
            "verse 103:1": "By time,",
            "verse 103:2": "Indeed, mankind is in loss,",
            "verse 103:3": "Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience."
        },
        "Filipino": {
            "verse 103:1": "Sa pamamagitan ng Al-Asr (paglipas ng mga sandali sa tangkay ng panahon)",
            "verse 103:2": "Katotohanan! Ang tao ay nasa kawalan (at pagkapahamak)",
            "verse 103:3": "Maliban sa mga sumasampalataya (sa Kaisahan ni Allah at sa Islam), at nagsisigawa ng mga kabutihan at magkabalikat sa pagtuturo ng Katotohanan (alalaong baga, nagtatagubilin sa kanya [kanila] na magsagawa ng lahat ng uri ng mabubuting gawa na ipinag-uutos ni Allah at pag-iwas sa lahat ng masasamang gawa na ipinagbabawal ni Allah), at nagtatagubilin sa isa’t isa sa pagtitiyaga at pagiging matatag (sa mga pagdurusa, kapinsalaan, at sakit na maaaring maranasan ng sinuman sa panahon ng kanyang pangangaral ng Kanyang Pananampalataya, atbp., tungo sa Kapakanan ni Allah)"
        },
        "French": {
            "verse 103:1": "Par le Temps!",
            "verse 103:2": "L'homme est certes, en perdition,",
            "verse 103:3": "sauf ceux qui croient et accomplissent les bonnes œuvres, s'enjoignent mutuellement la vérité et s'enjoignent mutuellement l'endurance."
        },
        "Fulah": {
            "verse 103:1": "E waqtu asri",
            "verse 103:2": "Pellet neɗɗo woni ko e perte",
            "verse 103:3": "Si wonah ɓeen gomɗimɓe ɓe golli golle moƴƴ ɗe, hino woodani ɓe njoɓdi ndi taƴondirtaa"
        },
        "German": {
            "verse 103:1": "Beim Zeitalter!",
            "verse 103:2": "Der Mensch befindet sich wahrlich in Verlust,",
            "verse 103:3": "außer denjenigen, die glauben und rechtschaffene Werke tun und einander die Wahrheit eindringlich empfehlen und einander die Standhaftigkeit eindringlich empfehlen."
        },
        "Hausa": {
            "verse 103:1": "Ina rantsuwa da zãmani.",
            "verse 103:2": "Lalle ne mutum yana a cikin hasara.",
            "verse 103:3": "Fãce waɗanda suka yi ĩmani, kuma suka aikata ayyukan ƙwarai, kuma suka yi wa juna wasiyya da bin gaskiya, kuma suka yi wa juna wasiyya da yin haƙuri (su kam, basu cikin hasara)."
        },
        "Hindi": {
            "verse 103:1": "नमाज़े अस्र की क़सम",
            "verse 103:2": "बेशक इन्सान घाटे में है",
            "verse 103:3": "मगर जो लोग ईमान लाए, और अच्छे काम करते रहे और आपस में हक़ का हुक्म और सब्र की वसीयत करते रहे"
        },
        "Indonesian": {
            "verse 103:1": "Demi masa.",
            "verse 103:2": "Sesungguhnya manusia itu benar-benar dalam kerugian,",
            "verse 103:3": "kecuali orang-orang yang beriman dan mengerjakan amal saleh dan nasehat menasehati supaya mentaati kebenaran dan nasehat menasehati supaya menetapi kesabaran."
        },
        "Italian": {
            "verse 103:1": "Per il Tempo!",
            "verse 103:2": "Invero l’uomo è in perdita,",
            "verse 103:3": "eccetto coloro che credono e compiono il bene, vicendevolmente si raccomandano la verità e vicendevolmente si raccomandano la pazienza."
        },
        "Japanese": {
            "verse 103:1": "時間にかけて（誓う）。",
            "verse 103:2": "本当に人間は，喪失の中にいる。",
            "verse 103:3": "信仰して善行に勤しみ，互いに真理を勧めあい，また忍耐を勧めあう者たちの外は。"
        },
        "Jawa": {
            "verse 103:1": "dhemi wektu",
            "verse 103:2": "Sayekti manungsa iku temen ana sajeroning kapitunan",
            "verse 103:3": "Kajaba kang padha angestu sarta anindakake panggawe becik, apa dene weling - wineling ing bener, serta weling wineling ing shabar"
        },
        "Kazakh": {
            "verse 103:1": "Асрмен ант етемін",
            "verse 103:2": "Анығында, адам баласы сөзсіз, зиянда",
            "verse 103:3": "тек иманға келген әрі ізгі амал жасаған және бір-біріне ақиқатты насихат етіп, өсиеттеген әрі бір-біріне сабырды насихат етіп, өсиеттегендерден басқалары"
        },
        "Korean": {
            "verse 103:1": "세월을 두고 맹세하사세월을 두고 맹세하사",
            "verse 103:2": "실로 모든 인간은 멸망케 되 니라실로 모든 인간은 멸망케 되 니라",
            "verse 103:3": "그러나 믿음으로 의로운 일을실천하며 서로가 서로에게 진리를권고하며 인내하는 자들은 제외라그러나 믿음으로 의로운 일을실천하며 서로가 서로에게 진리를권고하며 인내하는 자들은 제외라"
        },
        "Kurdish": {
            "verse 103:1": "Bi gav û dananسوێند به زه‌مانه‌، سوێند به‌کاتی عه‌سر.",
            "verse 103:2": "(Sond dixum!) ku meriv di zîyanêdaninبه‌ڕاستی ئاده‌میزاد له زه‌ره‌رمه‌ندی و خه‌ساره‌تمه‌ندیدایه‌.",
            "verse 103:3": "Ji\tpêştirêwan\t(merivne)\tku\tbawerkirine\tûkarê\taştî\tkirine\tû\tşîreta (parisandina) mafê û şîreta bi hewdana (1i ser cefadanê) li hev dikinبێجگه له‌وانه‌ی که باوه‌ڕیان هێناوه‌و کارو کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌و ئامۆژگاری یه‌کتریشیان کردووه که هه‌میشه پابه‌ندی حه‌ق بن (پابه‌ندی حه‌قیش پێویستی به خۆگری هه‌یه‌)، له‌به‌ر ئه‌وه به‌رده‌وام ئامۆژگاری یه‌کتریان کردووه تا هه‌میشه و به‌رده‌وام، خۆگرو ئارامگریش بن."
        },
        "Kyrgyz": {
            "verse 103:1": "Асыргаант",
            "verse 103:2": "Албетте, (ар бир) инсан зыянда",
            "verse 103:3": "Ал эми, ыйман келтирген, салих (сооп) амалдарды жасаган жана бири-бирине акыйкаттык менен сабырдуулукту осуят (насаат) кылгандар гана (зыянда эмес)"
        },
        "Malay": {
            "verse 103:1": "Demi Masa!",
            "verse 103:2": "Sesungguhnya manusia itu dalam kerugian -",
            "verse 103:3": "Kecuali orang-orang yang beriman dan beramal soleh, dan mereka pula berpesan-pesan dengan kebenaran serta berpesan-pesan dengan sabar."
        },
        "Malayalam": {
            "verse 103:1": "കാലം തന്നെയാണ് സത്യം,",
            "verse 103:2": "തീര്‍ച്ചയായും മനുഷ്യന്‍ നഷ്ടത്തില്‍ തന്നെയാകുന്നു;",
            "verse 103:3": "വിശ്വസിക്കുകയും സല്‍കര്‍മ്മങ്ങള്‍ പ്രവര്‍ത്തിക്കുകയും, സത്യം കൈക്കൊള്ളാന്‍ അന്യോന്യം ഉപദേശിക്കുകയും ക്ഷമ കൈക്കൊള്ളാന്‍ അന്യോന്യം ഉപദേശിക്കുകയും ചെയ്തവരൊഴികെ."
        },
        "Norwegian": {
            "verse 103:1": "Ved tidens makt!",
            "verse 103:2": "Mennesket kommer visselig til kort!",
            "verse 103:3": "Unntatt er de som tror og lever rettskaffent, som legger hverandre sannheten på hjertet, og standhaftighet."
        },
        "Pashto": {
            "verse 103:1": "قسم دى په عصر (مازیګر، یا زمانه)",
            "verse 103:2": "چې بېشكه یقینًا انسان په زیان (او تاوان) كې دى",
            "verse 103:3": "غیر له هغو كسانو نه چې ایمان يې راوړى دى او نېك عملونه يې كړې دي او یو بل ته يې د حق (دین) وصیت كړى دى، او یو بل ته يې د صبر وصیت كړى دى"
        },
        "Persian": {
            "verse 103:1": "سوگند به اين زمان،",
            "verse 103:2": "كه آدمى در خسران است.",
            "verse 103:3": "مگر آنها كه ايمان آوردند و كارهاى شايسته كردند و يكديگر را به حق سفارش كردند و يكديگر را به صبر سفارش كردند."
        },
        "Polish": {
            "verse 103:1": "Na porę przedwieczorną!",
            "verse 103:2": "Zaprawdę, człowiek jest na drodze zguby!",
            "verse 103:3": "Z wyjątkiem tych, którzy uwierzyli i czynili dobre dzieła, i zachęcali się wzajemnie do prawdy, i zachęcali się wzajemnie do cierpliwości."
        },
        "Portuguese": {
            "verse 103:1": "Pela era,",
            "verse 103:2": "Que o homem está na perdição,",
            "verse 103:3": "Salvo os fiéis, que praticam o bem, aconselham-se na verdade e recomendam-se, uns aos outros, a paciência e a perseverança!"
        },
        "Punjabi": {
            "verse 103:1": "ਸਹੁੰ ਹੈ, ਜ਼ਮਾਨੇ ਦੀ।",
            "verse 103:2": "ਬੇਸ਼ੱਕ ਮਨੁੱਖ ਘਾਟੇ ਵਿਚ ਹਨ।",
            "verse 103:3": "ਪਰੰਤੂ ਜਿਹੜੇ ਲੋਕ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਚੰਗੇ ਕਰਮ ਕੀਤੇ ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਇੱਕ ਦੂਜੇ ਨੂੰ ਸੱਚਾਈ ਦਾ ਉਪਦੇਸ਼ ਦਿੱਤਾ। ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਇੱਕ ਦੂਜੇ ਨੂੰ ਧੀਰਜ ਰੱਖਣ ਦਾ ਉਪੇਦਸ਼ ਦਿੱਤਾ।"
        },
        "Roman english": {
            "verse 103:1": "Wal` asr",
            "verse 103:2": "Innal insaana lafee khusr",
            "verse 103:3": "Il lal lazeena aamanu wa `amilus saali haati wa tawa saw bil haqqi wa tawa saw bis sabr"
        },
        "Russian": {
            "verse 103:1": "В знак времени (как Моего знаменья), -",
            "verse 103:2": "Уверь, что человек всегда убыток терпит,",
            "verse 103:3": "Помимо тех, кто верует, Деянья добрые творит, Заповедает истину средь братьев И к терпеливой стойкости зовет."
        },
        "Sindhi": {
            "verse 103:1": "پوياڙيءَ جو قسم آھي.",
            "verse 103:2": "ته بيشڪ ماڻھو گھاٽي ۾ آھي.",
            "verse 103:3": "سواءِ انھن جي جن ايمان آندو ۽ چڱا ڪم ڪيا ۽ ھڪ ٻئي کي سچ جي وصيّت ڪيائون، ۽ ھڪ ٻئي کي صبر جي وصّيت ڪيائون."
        },
        "Sinhalese": {
            "verse 103:1": "කාලය මත දිවුරමින්.",
            "verse 103:2": "සැබැවින්ම මිනිස් වර්ගයා අලාභයෙහි පසු වෙයි.",
            "verse 103:3": "නමුත් (සත්යය) විශ්වාස කර, දැහැමි ක්‍රියාවන් ඉටු කර, තවද සත්ය පිළිබඳ එකිනෙකාට උපදෙස් දී, තවද ඉවසීම පිළිබඳව ද එකිනෙකාට උපදෙස් දුන් අය හැර."
        },
        "Somali": {
            "verse 103:1": "Eebe wuxuu ku dhartay Waqtiga Casarka ah.",
            "verse 103:2": "In Dadku khasaaro ku sugunyahay.",
            "verse 103:3": "Marka laga reebo kuwa rumeeyay xaqa ee Camal fiican fala, isuna dardaarma xaqa, isuna dardaarma Samirka."
        },
        "Spanish": {
            "verse 103:1": "Por el Tiempo!",
            "verse 103:2": "Que es cierto que el hombre está en pérdida.",
            "verse 103:3": "Pero no así los que creen, llevan a cabo las acciones de bien, se encomiendan la verdad y se encomiendan la paciencia"
        },
        "Swahili": {
            "verse 103:1": "Naapa kwa Zama!",
            "verse 103:2": "Hakika binaadamu bila ya shaka yumo katika khasara,",
            "verse 103:3": "Ila wale walio amini, na wakatenda mema, na wakausiana kwa haki, na wakausiana kusubiri."
        },
        "Swedish": {
            "verse 103:1": "VID DEN flyende tiden!",
            "verse 103:2": "Människan förbereder helt visst sin egen undergång,",
            "verse 103:3": "utom de som tror och lever ett rättskaffens liv och råder varandra [att hålla fast vid] sanningen och råder varandra [att bära motgång med] tålamod."
        },
        "Tajik": {
            "verse 103:1": "Савганд ба ин замон,",
            "verse 103:2": "ки одамӣ дар зиён аст,",
            "verse 103:3": "ғайри онҳо, ки имон оварданд ва корҳои шоиста карданд ва якдигарро ба ҳақ супориш карданд ва якдигарро ба сабр супориш карданд."
        },
        "Tamil": {
            "verse 103:1": "காலத்தின் மீது சத்தியமாக.",
            "verse 103:2": "நிச்சயமாக மனிதன் நஷ்டத்தில் இருக்கின்றான்.",
            "verse 103:3": "ஆயினும், எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்து, சத்தியத்தைக் கொண்டு ஒருவருக்கொருவர் உபதேசம் செய்து, மேலும் பொறுமையைக் கொண்டும் ஒருவருக்கொருவர் உபதேசிக்கிறார்களோ அவர்களைத் தவிர (அவர்கள் நஷ்டத்திலில்லை)."
        },
        "Tatar": {
            "verse 103:1": "Замана, дәвер, кич, икенде намазы, гасыр белән ант итеп әйтәмен ки.",
            "verse 103:2": "Дөреслектә адәм баласы хәсрәттәдер, кадерле гомерен дөнья өчен генә әрәм итеп зур зарарлануда, кимчелектәдер.",
            "verse 103:3": "Мәгәр Коръән өйрәткәнчә дөрес юл белән чын иман китереп Ислам динен кабул иткән, һәрвакыт изге гамәлләр кылган, Коръән дәлилләре белән, хактан һич тә аерылмаска бер-берсен өндәшкән, һәм тормыш вә дин мәшәкатьләренә, килгән төрле авырлыкларга, бәла-казаларга сабыр итәргә чыдамлы булырга бер-берсен өндәшкән хак мөэминнәр генә зарарлануда, кимчелектә, хәсрәттә булмаслар."
        },
        "Telugu": {
            "verse 103:1": "కాలం సాక్షిగా",
            "verse 103:2": "నిశ్చయంగా మానవుడు నష్టంలో ఉన్నాడు",
            "verse 103:3": "కాని విశ్వసించి, సత్కార్యాలు చేసేవారు మరియు ఒకరికొకరు సత్యాన్ని బోధించుకునే వారు మరియు ఒకరికొకరు సహనాన్ని (స్థైర్యాన్ని) బోధించుకునే వారు తప్ప"
        },
        "Thai": {
            "verse 103:1": "ขอสาบานด้วยกาลเวลา",
            "verse 103:2": "แท้จริงมนุษย์นั้น อยู่ในการขาดทุน",
            "verse 103:3": "นอกจากบรรดาผู้ศรัทธาและกระทำความดีทั้งหลาย และตักเตือนกันและกันในสิ่งที่เป็นสัจธรรม และตักเตือนกันและกันให้มีความอดทน"
        },
        "Turkish": {
            "verse 103:1": "İkindi vaktine (Asra; çağa) and olsun ki,",
            "verse 103:2": "İnsan hiç şüphesiz hüsran içindedir.",
            "verse 103:3": "Ancak inanıp yararlı iş işleyenler, birbirlerine gerçeği tavsiye edenler ve sabırlı olmayı tavsiye edenler bunun dışındadır."
        },
        "Urdu": {
            "verse 103:1": "عصر کی قسم",
            "verse 103:2": "کہ انسان نقصان میں ہے",
            "verse 103:3": "مگر وہ لوگ جو ایمان لائے اور نیک عمل کرتے رہے اور آپس میں حق (بات) کی تلقین اور صبر کی تاکید کرتے رہے"
        },
        "Uyghur": {
            "verse 103:1": "زامان بىلەن قەسەمكى،",
            "verse 103:2": "ئىمان ئېيتقان، ياخشى ئەمەللەرنى قىلغان، بىر - بىرىگە ھەقنى تەۋسىيە قىلىشقان، بىر - بىرىگە سەۋرىنى تەۋسىيە قىلىشقان كىشىلەردىن باشقا ھەممە ئادەم چوقۇم زىيان ئىچىدىدۇر،",
            "verse 103:3": "ئىمان ئېيتقان، ياخشى ئەمەللەرنى قىلغان، بىر - بىرىگە ھەقنى تەۋسىيە قىلىشقان، بىر - بىرىگە سەۋرىنى تەۋسىيە قىلىشقان كىشىلەردىن باشقا ھەممە ئادەم چوقۇم زىيان ئىچىدىدۇر"
        },
        "Uzbek": {
            "verse 103:1": "Аср билан қасам.",
            "verse 103:2": "Албатта, инсон хусрондадир.",
            "verse 103:3": "Магар иймон келтирганлар ва солиҳ амаллар қилганлар, бир-бирларини ҳақга чақирганлар ва бир-бирларини сабрга чақирганлар мустаснодир."
        },
        "Vietnamese": {
            "verse 103:1": "Thề bởi thời gian.",
            "verse 103:2": "Quả thật, con người chắc chắn sẽ ở trong tình trạng thua thiệt.",
            "verse 103:3": "Trừ những ai có đức tin và hành thiện, khuyên bảo nhau điều chân lý và khuyên bảo nhau kiên nhẫn."
        },
        "Yoruba": {
            "verse 103:1": "Allahu bura pelu akoko irole aye",
            "verse 103:2": "Dajudaju eniyan wa ninu ofo",
            "verse 103:3": "Ayafi awon t’o gbagbo ni ododo, ti won se awon ise rere, ti won so asotele ododo laaarin ara won, ti won si tun so asotele suuru laaarin ara won"
        }
    }
}