{
    "id": 106,
    "name_simple": "Quraysh",
    "revelation_place": "makkah",
    "revelation_order": 29,
    "bismillah_pre": true,
    "verses_count": 4,
    "short_text": "The Surah has been titled after the word Quraish in the very first verse.",
    "text": [
        "The Surah has been titled after the word Quraish in the very first verse.",
        "Period of Revelation",
        "Although Dahhak and Kalbi regard Surah Quraysh as a Madani Surah, a great majority of the commentators are agreed that it is Makki, and a manifest evidence of this are the words Rabba hadh-al-Bait (Lord of this House) in this Surah itself. Had it been revealed at Madinah, the words \"this House\" for the Ka'bah could not be relevant. Moreover, its subject matter so closely relates to that of Surah Al-Fil that probably it was revealed immediately after it, without any other Surah intervening between them. On this basis exactly, some of the earliest scholars regard the two Surahs as one entity. This view is strengthened by the traditions which say that in the Quran copy belonging to Hadrat Ubayy bin Ka'b these two were written as one Surah, i.e. without the insertion of the Bismillah between them. Furthermore, Hadrat Umar had once recited the two Surahs as one in the Prayer. However, this view is not acceptable because in the Quran copy which Hadrat Uthman (may Allah bless him) had got written down officially by the cooperation of a large number of the Companions and sent to the centers of Islamic lands, the Bismillah was written between these two Surahs, and since then these two have been written as separate Surahs in all the copies of the Quran everywhere in the world. Moreover, the style of the two Surahs is so different that they manifestly appear as two separate Surahs.",
        "Historical Background",
        "To understand the Surah well it is essential that one should keep the historical background relevant to the contents of this Surah and of Surah Al-Fil in view.",
        "The tribe of Quraish was scattered throughout Hijaz until the time of Qusayy bin Kilab, the ancestor of the Holy Prophet (upon whom be Allah's peace). First of all, Qusayy gathered his tribe in Makkah and this tribe was able to gain authority over the Ka'bah. On that basis Qusayy was called mujammi (uniter, assembler) by his people. This man by his sagacity and wisdom founded a city state in Makkah and made excellent arrangements for the welfare of the pilgrims coming from all over Arabia, with the result that the Quraish were able to gain great influence among the Arabian tribes and lands. After Qusayy, the offices of the state of Makkah were divided between his sons, Abdi Manaf and Abd ad-Dar, but of the two Abdi Manaf gained greater fame even during his father's lifetime and was held in high esteem throughout Arabia. Abdi Manaf had four sons: Hashim, Abdi Shams, Al-Muttalib, and Naufal. Of these, Hashim, father of Abdul Muttalib and grandfather of the Holy Prophet, first conceived the idea to take part in the trade that passed between the eastern countries and Syria and Egypt through Arabia, and also to purchase the necessities of life for the Arabians so that the tribes living by the trade route bought these from them and the merchants living in the interior of the country were attracted to the market of Makkah. This was the time when the Sasanian kingdom of Iran had captured the international trade that was carried out between the northern lands and the eastern countries and Byzantine empire through the Persian Gulf. This had boosted up the trade activity on the trade route leading from southern Arabia to Syria and Egypt along the Red Sea coast. As against the other Arabian caravans, the Quraish had the advantage that the tribes on the route held them in high esteem on account of them being keepers of the Ka'bah. The tribes stood indebted to them for the great generosity with which the Quraish treated them in the Hajj season. That is why the Quraish felt no fear that their caravans would be robbed or harmed anywhere on the way. The tribes on the way did not even charge them the heavy transit taxes that they demanded from the other caravans. Hashim taking advantage of this, prepared the trade scheme and made his three brothers partners in it. Thus, Hashim obtained trade privileges from the Ghassanide king of Syria, Abdi Shams from the Negus, Al-Muttalib from the Yamanite nobles and Naufal from the governments of Iraq and Iran, and their trade began to flourish. That is how the four brothers became famous as traders and began to be called ashab al-ilaf (generators of love and affection) on account of their friendly relations with the tribes and states of the surrounding lands.",
        "Because of their business relations with Syria, Egypt, Iraq, Iran, Yaman and Abyssinia, the Quraish came across opportunities and their direct contact with the culture and civilization of different countries greatly enhanced the level of their knowledge and wisdom such that no tribe in Arabia could match and equal them. In regards to wealth and worldly goods, they became the most affluent tribe, and Makkah became the most important commercial center of the Arabian peninsula. Another great advantage that accrued from these international relations was that they brought from Iraq, tile script which later was used for writing down the Quran. No other Arabian tribe could boast of so many literate people as the Quraish could. For these very reasons the Holy Prophet (upon whom be peace) said: \"Quraish are the leaders of men.\" (Musnad Ahmad: Marwiyat Amr bin al As). And according to a tradition from Hadrat Ali in Baihaqi, the Holy Prophet said: \"First the leadership of the Arabians was in the hands of the people of Himyar, then Allah withdrew it from them and gave it to Quraish.\"",
        "The Quraish were thus prospering and flourishing when the event of Abrahah's invasion of Makkah took place. Had Abrahah at that time succeeded in taking this holy City and destroying the Ka'bah, the glory and renown of not only the Quraish but of the Ka'bah itself, would have faded away, the belief of the pre-Islamic Arabia that the House indeed was Allah's House would have been shattered, and the high esteem in which Quraish were held for being keepers of the House throughout the country would have been tarnished. Then, after the Abyssinian advance to Makkah, the Byzantium also would have taken the initiative to gain control over the trade route between Syria and Makkah and the Quraish would have been reduced to a plight worse than that in which they were involved before Qusayy bin Kilab. But when Allah showed this manifestation of His power that the swarms of birds destroyed 60,000 Abyssinian troops brought by Abrahah by pelting them with stones, and from Makkah to Yaman they went on falling and dying by the wayside, the faith of the Arabs that the Ka'bah indeed was Allah's House increased manifold, and the glory and renown of Quraish too was enhanced considerably throughout the country. Now the Arabs were convinced that they were under Allah's special favor; therefore, they visited every part of Arabia fearlessly and passed through every land with their trade caravans unharmed. No one could dare touch them with an evil intention. Let alone touching the Quraysh, even if they had a non-Quraishite under their protection, he too was allowed to pass unharmed.",
        "Theme and Substance",
        "As all this was well known in the time of the Holy Prophet's appointment to Prophethood, there was no need to mention it in the Surah. That is why in the four brief sentences of this Surah, Quraish were simply asked to consider: \"When you yourselves acknowledge this House (i e. the Ka'bah) to be Allah's House, and not of the idols, and when you fully well know that it is Allah alone Who has granted you peace by virtue of this House, made your trade and commerce flourish and saving you from destitution favored you with prosperity, you should then worship and serve Him alone.\""
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that admonishes the first recipients of the Quran, the Meccan tribe of Quraysh, to give thanks to the One God alone who had long bequeathed to them, in their desert surroundings, abundant provision and security. It takes its name from verse 1, which mentions the Quraysh, the tribe to which the Prophet Muḥammad belonged.The surah is also known as: Koraish, The Quraish, The Quraish (Custodians of the Ka’ba), The Tribe of Quraysh.",
    "name_translation": "Quraysh",
    "name_complex": "Quraysh",
    "surah_name_ar": "قريش",
    "verses": {
        "Albanian": {
            "verse 106:1": "(Perëndia e zhduku ushtrinë e elefantëve) për t’i qetësuar Kurejshët,",
            "verse 106:2": "t’i qetësojë ata në udhëtimin që bëjnë dimër e verë,",
            "verse 106:3": "le të adhurojnë pra Zotin e kësaj shtëpie (Qabes),",
            "verse 106:4": "i cili i ushqen (ngop) ata nga uria dhe i siguroi nga frika."
        },
        "Amharic": {
            "verse 106:1": "ቁረይሽን ለማላመድ (ባለዝሆኖቹን አጠፋ)፡፡",
            "verse 106:2": "የብርድና የበጋን ወራት ጉዞ ሊያላምዳቸው ይህንን ሠራ፡፡",
            "verse 106:3": "ስለዚህ የዚህን ቤት (የከዕባን) ጌታ ይግገዙ፡፡",
            "verse 106:4": "ያንን ከረኃብ ያበላቸውን ከፍርሃትም ያረካቸውን (ጌታ ያምልኩ)፡፡"
        },
        "Arabic": {
            "verse 106:1": "ٍشْيَرُق ِفاَليِإِل",
            "verse 106:2": "ِفْيَّصلاَو ِءاَتِّشلا َةَلْحِر ْمِهِفاَليِإ",
            "verse 106:3": "ِتْيَبْلا اَذَٰه َّبَر اوُدُبْعَيْلَف",
            "verse 106:4": "ٍفْوَخ ْنِّم مُهَنَمآَو ٍعوُج نِّم مُهَمَعْطَأ يِذَّلا"
        },
        "Azerbaijani": {
            "verse 106:1": "Qureyşin birliyi xatirinə,",
            "verse 106:2": "onların qış və yay səfərlərindəki birliyi xatirinə",
            "verse 106:3": "qoy onlar bu Evin Rəbbinə ibadət etsinlər.",
            "verse 106:4": "Allah onlara aclıqdan sonra yemək verdi və qorxudan sonra əmin-amanlıq bəxş etdi."
        },
        "Bengali": {
            "verse 106:1": "কোরাইশের আসক্তির কারণে,",
            "verse 106:2": "আসক্তির কারণে তাদের শীত ও গ্রীষ্মকালীন সফরের।",
            "verse 106:3": "অতএব তারা যেন এবাদত করে এই ঘরের পালনকর্তার",
            "verse 106:4": "যিনি তাদেরকে ক্ষুধায় আহার দিয়েছেন এবং যুদ্ধভীতি থেকে তাদেরকে নিরাপদ করেছেন।"
        },
        "Berber Amazigh": {
            "verse 106:1": "Ilmend n lemwafqa n Qurayc.",
            "verse 106:2": "Lemwafqa nnsen $ef inig unebdu akked win n tegrist.",
            "verse 106:3": "Awufan ad âabden Mass n Uxxam a,",
            "verse 106:4": "iten Iceççen, ur plaéen, iten Ivemnen, ur ppagwaden."
        },
        "Bosnian": {
            "verse 106:1": "Zbog navike Kurejšija,",
            "verse 106:2": "navike njihove da zimi i ljeti putuju,",
            "verse 106:3": "neka se oni Gospodaru hrama ovoga klanjaju,",
            "verse 106:4": "koji ih gladne hrani i od straha brani."
        },
        "Bulgarian": {
            "verse 106:1": "Заради обичая на Курайш,",
            "verse 106:2": "техния обичай да пътуват и зиме, и лете,",
            "verse 106:3": "нека служат на Господа на този Дом,",
            "verse 106:4": "който им даде храна срещу глада и сигурност срещу страха!"
        },
        "Chinese": {
            "verse 106:1": "因为保护古来氏,",
            "verse 106:2": "因为在冬季和夏季的旅行中保护他们,",
            "verse 106:3": "故教他们崇敬这天房的主,",
            "verse 106:4": "他曾为饥荒而赈济他们, 曾为恐怖而保佑他们。"
        },
        "Danish": {
            "verse 106:1": "Ter bescherming van de Qoraishieten",
            "verse 106:2": "Ter bescherming op hun zomer- en winterreis",
            "verse 106:3": "Laten zij derhalve de Heer van dit Huis aanbidden",
            "verse 106:4": "Die hen van voedsel tegen honger heeft voorzien en van vrees bevrijd"
        },
        "Dutch": {
            "verse 106:1": "Vanwege de gewoonte*1 van de Qoeraisj.",
            "verse 106:2": "Hun gewoonte van het maken van tochten in de winter en de zomer.",
            "verse 106:3": "Daarom moeten zij de Heer van dit Huis aanbidden.",
            "verse 106:4": "Degene Die hun tegen de honger voedt en hen veilig stelt voor de angst."
        },
        "English": {
            "verse 106:1": "For the accustomed security of the Quraysh -",
            "verse 106:2": "Their accustomed security [in] the caravan of winter and summer -",
            "verse 106:3": "Let them worship the Lord of this House,",
            "verse 106:4": "Who has fed them, [saving them] from hunger and made them safe, [saving them] from fear."
        },
        "Filipino": {
            "verse 106:1": "Sa pagiging bihasa ng mga (Angkan) ni Quraish",
            "verse 106:2": "(Ay Aming hinayaan) ang mga sasakyan (ng mga Quraish) na bumiyahe ng ligtas sa Taglamig (patungong Timog), at sa Tag-init (patungong Hilaga, ng walang anumang pangangamba)",
            "verse 106:3": "Kaya’t hayaan sila na sumamba (kayAllah), ang Panginoon ng Tahanang ito (ang Ka’ba sa Makkah)",
            "verse 106:4": "(Siya, si Allah) ang nagkaloob sa kanila ng pagkain laban sa pagkagutom at laban sa anumang pangamba (at panganib)"
        },
        "French": {
            "verse 106:1": "A cause du pacte des Coraïch,",
            "verse 106:2": "De leur pacte [concernant] les voyages d'hiver et d'été.",
            "verse 106:3": "Qu'ils adorent donc le Seigneur de cette Maison [la Ka'ba],",
            "verse 106:4": "qui les a nourris contre la faim et rassurés de la crainte!"
        },
        "Fulah": {
            "verse 106:1": "Sabu woowde Quraysi en",
            "verse 106:2": "Goowgol ɓe ɗatngal dabbunde e ceeɗu",
            "verse 106:3": "Yo ɓe ndew jom ndu suudu",
            "verse 106:4": "Oon ñamminɗo ɓe saanga heege O hoolni ɓe e kulol"
        },
        "German": {
            "verse 106:1": "Für die Vereinigung der Qurais",
            "verse 106:2": "ihre Vereinigung während der Reise des Winters und des Sommers.",
            "verse 106:3": "So sollen sie dem Herrn dieses Hauses dienen,",
            "verse 106:4": "Der ihnen Speise nach ihrem Hunger gegeben und ihnen Sicherheit nach ihrer Furcht gewährt hat."
        },
        "Hausa": {
            "verse 106:1": "Sabõda sãbon ¡uraishawa.",
            "verse 106:2": "Sãbonsu na tafiyar hunturu da ta bazara.",
            "verse 106:3": "Sabõda haka sai su bauta wa Ubangijin wannan Gida (Ka'abah).",
            "verse 106:4": "wanda Ya ciyar da su (Ya hana su) daga yunwa, kuma Ya amintar da su daga wani tsõro."
        },
        "Hindi": {
            "verse 106:1": "चूँकि क़ुरैश को जाड़े और गर्मी के सफ़र से मानूस कर दिया है",
            "verse 106:2": "तो उनको मानूस कर देने की वजह से",
            "verse 106:3": "इस घर (काबा) के मालिक की इबादत करनी चाहिए",
            "verse 106:4": "जिसने उनको भूख में खाना दिया और उनको खौफ़ से अमन अता किया"
        },
        "Indonesian": {
            "verse 106:1": "Karena kebiasaan orang-orang Quraisy,",
            "verse 106:2": "(yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas.",
            "verse 106:3": "Maka hendaklah mereka menyembah Tuhan Pemilik rumah ini (Ka'bah).",
            "verse 106:4": "Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan."
        },
        "Italian": {
            "verse 106:1": "Per il patto dei Coreisciti,",
            "verse 106:2": "per il loro patto delle carovane invernali ed estive.",
            "verse 106:3": "Adorino dunque il Signore di questa Casa,",
            "verse 106:4": "Colui Che li ha preservati dalla fame e li ha messi al riparo da [ogni] timore."
        },
        "Japanese": {
            "verse 106:1": "クライシュ族の保護のため，",
            "verse 106:2": "冬と夏のかれらの隊商の保護のため，（そのアッラーの御恵みのために）",
            "verse 106:3": "かれらに，この聖殿の主に仕えさせよ。",
            "verse 106:4": "飢えに際しては，かれらに食物を与え，また恐れに際しては，それを除き心を安らかにして下さる御方に。"
        },
        "Jawa": {
            "verse 106:1": "Minangka pangayoming turun Quraisy",
            "verse 106:2": "Anggone padha manggon ing padunungan ing mongsa panas, lan mangsa adhem",
            "verse 106:3": "Mulane para wong turun Quraisy kon pada ngawula ing Allah, Pangerane Ka’bah Baitullah",
            "verse 106:4": "Kang paring pangan tambaning luwe sarta paring aman tentrem kalis saka barang kang dikuwatirake"
        },
        "Kazakh": {
            "verse 106:1": "Құрайштың қауіпсіздігі таңданарлықіс",
            "verse 106:2": "Олардың қысқы және жазғы сапар- ларындағы қауіпсіздігі",
            "verse 106:3": "Ендеше олар осы Үйдің Қағбаның Раббысына Құлшылық етсін",
            "verse 106:4": "оларды аштықтан кейін тамақтандырған және қауіп-қатерден аман еткен"
        },
        "Korean": {
            "verse 106:1": "꾸레이쉬 족의 보호를 위하여꾸레이쉬 족의 보호를 위하여",
            "verse 106:2": "대상으로 하여금 겨울과 여름에 안전하게 여행케 하였노라대상으로 하여금 겨울과 여름에 안전하게 여행케 하였노라",
            "verse 106:3": "그러므로 이 집의 주님을 그 들로 하여금 경배토록 하라그러므로 이 집의 주님을 그 들로 하여금 경배토록 하라",
            "verse 106:4": "그분은 그들을 기아로부터 배불려 주셨고 공포로부터 안전케 하여 주셨노라그분은 그들을 기아로부터 배불려 주셨고 공포로부터 안전케 하여 주셨노라"
        },
        "Kurdish": {
            "verse 106:1": "Bira ji bona hogirîya Qureyşîyanله‌به‌ر ئه‌وه‌ی قوڕه‌یش هۆگر بووه‌و...",
            "verse 106:2": "Ji bo ku (Yezdan) ewan (Qureyşîyan) hînê barkirina di zivistanê da (li bal Yemenê) û barkirina havînê (ûbal Şamê da kirîye) bikinخوی گرتووه به کاروانی زستانه‌ی (یه‌مه‌ن)و کاروانی هاوینه‌ی (شام) بۆ بازرگانی و (دابین کردنی بژێوی).",
            "verse 106:3": "Îdî bira ewan (Qureyşîyan) ji bona Xuda yê vî xanî (ku Kebe ye) perestîye bikinکه‌واته با په‌روه‌ردگارو خاوه‌نی ئه‌م ماڵه پیرۆزه (که‌عبه‌) بپه‌رستن.",
            "verse 106:4": "Ewî (Xuda yê) ewan (Qureyşîyan) ji birsînê têrkirîne û ewan ji tirsê ewle kirineئه‌و زاته‌ی له‌برسێتی ڕزگاری کردن و خۆراکی پێبه‌خشین و له ترس و بیمی (جه‌رده و ڕێگران) پاڕاستوونی و ئاسایشی بۆ دابین کردوون."
        },
        "Kyrgyz": {
            "verse 106:1": "Курайштын ынтымагы үчүн",
            "verse 106:2": "Кыш жана жай мезгилиндеги сапарында алардын ынтымак-тынчтыгы үчүн",
            "verse 106:3": "Эми, алар (ар кандай таш-кудай, жыгач-кудайларын таштап, өздөрүнө ынтымак жашоо тартуулаган) ушул Үйдүн (Каабынын) Раббисине гана ибадат кылышсын",
            "verse 106:4": "Ал (Рабби) каатчылыкта аларды тамактандырды жана коркунуч(тар)дан аман сактады"
        },
        "Malay": {
            "verse 106:1": "Kerana kebiasaan aman tenteram kaum Quraisy (penduduk Makkah)",
            "verse 106:2": "(laitu) kebiasaan aman tenteram perjalanan mereka (menjalankan perniagaan) pada musim sejuk (ke negeri Yaman), dan pada musim panas (ke negeri Syam),",
            "verse 106:3": "Maka hendaklah mereka menyembah Tuhan yang menguasai rumah (Kaabah) ini,",
            "verse 106:4": "Tuhan yang memberi mereka penghidupan: menyelamatkan mereka dari kelaparan, dan mengamankan mereka dari ketakutan."
        },
        "Malayalam": {
            "verse 106:1": "ഖുറൈശ് ഗോത്രത്തെ കൂട്ടിയിണക്കിയതിനാല്‍.",
            "verse 106:2": "ശൈത്യകാലത്തെയും ഉഷ്ണകാലത്തെയും യാത്രയുമായി അവരെ കൂട്ടിയിണക്കിയതിനാല്‍,",
            "verse 106:3": "ഈ ഭവനത്തിന്‍റെ രക്ഷിതാവിനെ അവര്‍ ആരാധിച്ചുകൊള്ളട്ടെ.",
            "verse 106:4": "അതായത് അവര്‍ക്ക് വിശപ്പിന്ന് ആഹാരം നല്‍കുകയും, ഭയത്തിന് പകരം സമാധാനം നല്‍കുകയും ചെയ്തവനെ."
        },
        "Norwegian": {
            "verse 106:1": "For Quraysh-stammens samordning,",
            "verse 106:2": "samordning av vinter- og sommerkaravanen,",
            "verse 106:3": "så la dem dyrke Herren over dette Hus (Ka’aba),",
            "verse 106:4": "Han som gir dem mat mot sult, og trygghet mot frykt!"
        },
        "Pashto": {
            "verse 106:1": "د قریشو له یو بل سره د الفت له وجې نه",
            "verse 106:2": "د ژمي او اوړي په سفر كې د دوى د الفت په وجه",
            "verse 106:3": "نو لازم دي چې دوى د دې كور د رب عبادت وكړي",
            "verse 106:4": "هغه (رب) چې دوى ته يې له لوږې نه (د بچ كولو لپاره) طعام وركړى دى او دوى ته يې له وېرې نه (د ساتلو لپاره) امن (او بې خوفي) وركړې ده"
        },
        "Persian": {
            "verse 106:1": "براى ائتلاف قريش؛",
            "verse 106:2": "ائتلافشان در سفر زمستانى و تابستانى.",
            "verse 106:3": "پس بايد پروردگار اين خانه را بپرستند:",
            "verse 106:4": "آن كه به هنگام گرسنگى طعامشان داد و از بيم در امانشان داشت."
        },
        "Polish": {
            "verse 106:1": "Dla zgody Kurajszytów,",
            "verse 106:2": "Dla zgody ich w podróżowaniu zimą i latem!",
            "verse 106:3": "Niech oni czczą Pana tego Domu,",
            "verse 106:4": "Który ich nakarmił, kiedy byli głodni, i zapewnił im bezpieczeństwo, aby nie żyli w strachu!"
        },
        "Portuguese": {
            "verse 106:1": "Pelo convênio dos coraixitas,",
            "verse 106:2": "O convênio das viagens de inverno e de verão!",
            "verse 106:3": "Que adorem o Senhor desta Casa,",
            "verse 106:4": "Que os provê contra a fome e os salvaguarda do temor!"
        },
        "Punjabi": {
            "verse 106:1": "ਇਸ ਲਈ ਕਿ ਕੁਰੈਸ਼ ਆਦੀ ਹੋ ਗਏ।",
            "verse 106:2": "ਸਰਦੀ ਅਤੇ ਗਰਮੀ ਦੇ ਸਫ਼ਰ ਦੇ।",
            "verse 106:3": "ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਚਾਹੀਦਾ ਹੈ ਕਿ ਉਹ ਇਸ ਘਰ ਦੇ ਰੱਬ ਦੀ ਸ਼ੰਦਗੀ ਕਰਨ।",
            "verse 106:4": "ਜਿਸ ਨੇ ਉਨ੍ਹਾਂ ਨੂੰ ਕੁੱਖਿਆਂ ਨੂੰ ਭੋਜਨ ਦਿੱਤਾ ਅਤੇ ਭੈਅ ਤੋਂ ਉਨ੍ਹਾਂ ਨੂੰ ਅਮਨ ਦਿੱਤਾ।"
        },
        "Roman english": {
            "verse 106:1": "Li-ilaafi quraish",
            "verse 106:2": "Elaafihim rihlatash shitaa-i wass saif",
            "verse 106:3": "Fal y`abudu rabba haazal-bait",
            "verse 106:4": "Allazi at`amahum min ju`inw-wa-aamana hum min khawf"
        },
        "Russian": {
            "verse 106:1": "Для единенья корейшитов,",
            "verse 106:2": "Для их союза в дальних переходах летом и зимой -",
            "verse 106:3": "Пусть чтят Владыку этого Святого Дома,",
            "verse 106:4": "Кто дал им пищу, и от голода сберег, И от тревог освободил, от страха."
        },
        "Sindhi": {
            "verse 106:1": "قريشين کي اُلفت ڏيارڻ لاءِ.",
            "verse 106:2": "جو سياري ۽ اونھاري جي سفر سببان کين اُلفت ڏيارڻ آھي.",
            "verse 106:3": "تنھنڪري گُھرجين ته ھِن گھر جي (انھيءَ) پالڻھار جي عبادت ڪن.",
            "verse 106:4": "جنھن کين بُک ۾ کاڄ کاريايو، ۽ کين ڀؤ کان امن ڏنو."
        },
        "Sinhalese": {
            "verse 106:1": "කුරෙයිෂ්වරුන්හට හුරුපුරුදුකම් ඇති කිරීම වෙනුවෙන් ද,",
            "verse 106:2": "ශීත හා ශ්‍රීෂ්ම ඍතුවන් හි (ව්යාපාර කටයුතු සඳහා) තවලමෙහි යෑමට ඔවුන්හට හුරුපුරුදුකම් ඇති කිරීම වෙනුවෙන් ද,",
            "verse 106:3": "මෙම නිවසේ පරමාධිපතිට ඔවුන් නැමදුම් කරත්වා!",
            "verse 106:4": "කුසගින්නෙන් (සිටි) ඔවුනට ආහාර පිරිනමා බියෙන් (සිටි) ඔවුනට ආරක්ෂාව පිරිනැමුවේ ඔහුය."
        },
        "Somali": {
            "verse 106:1": "Caadaysigii Qureesheed.",
            "verse 106:2": "Ay ka caadayeesheen Safarka Xagaaga iyo Jilaalka darteed.",
            "verse 106:3": "Ha u caabudeen Eebeha Beydkan (Kacbada).",
            "verse 106:4": "Eebahi ka quudiyay gaajo, kana aamingaliyay cabsi."
        },
        "Spanish": {
            "verse 106:1": "Por la Alianza de los Quraysh.",
            "verse 106:2": "Sus alianzas para el viaje de invierno y de verano.",
            "verse 106:3": "Que adoren pues al Señor de esta Casa.",
            "verse 106:4": "Que los ha alimentado salvándolos del hambre y los ha librado del temor."
        },
        "Swahili": {
            "verse 106:1": "Kwa walivyo zoea Maqureshi,",
            "verse 106:2": "Kuzoea kwao safari za siku za baridi na siku za joto.",
            "verse 106:3": "Basi nawamuabudu Mola Mlezi wa Nyumba hii,",
            "verse 106:4": "Ambaye anawalisha wasipate njaa, na anawalinda na khofu."
        },
        "Swedish": {
            "verse 106:1": "SÅ ATT Quraysh kunde förbli enade och trygga,",
            "verse 106:2": "enade och trygga vad gäller såväl deras vinter- som deras sommarfärder.",
            "verse 106:3": "Därför skall de tillbe Herren till denna Helgedom,",
            "verse 106:4": "som har gett dem föda när hungersnöden hotade och trygghet när fruktan hade fått makt över deras [sinnen]."
        },
        "Tajik": {
            "verse 106:1": "Барои шукри улфату амни Қурайш;",
            "verse 106:2": "улфату амнашон дар сафари зимистониву тобистонӣ»",
            "verse 106:3": "Пас бояд Парвардигори ин хонаро (Каъбаро) бипарастанд:",
            "verse 106:4": "он ки ба ҳангоми гуруснагӣ таъомашон дод ва аз хавф дар амонашон дошт."
        },
        "Tamil": {
            "verse 106:1": "குறைஷிகளுக்கு விருப்பம் உண்டாக்கி,",
            "verse 106:2": "மாரி காலத்துடையவும் கோடைக்காலத்துடையவும் பிரயாணத்தில் அவர்களுக்கு மன விருப்பத்தை உண்டாக்கியமைக்காக-",
            "verse 106:3": "இவ்வீட்டின் (கஅபாவின்) இறைவனை அவர்கள் வணங்குவார்களாக.",
            "verse 106:4": "அவனே, அவர்களுக்கு பசிக்கு உணவளித்தான்; மேலும் அவர்களுக்கு அச்சத்திலிருந்தும் அபயமளித்தான்."
        },
        "Tatar": {
            "verse 106:1": "Кураеш кабиләсенең өлфәтләнүенә ґәҗәбләнегез.",
            "verse 106:2": "Аларның җәй һәм кыш көннәрендә сәүдә белән сәфәрдә йөрүләрендә өлфәтләнүләренә ґәҗәбләнегез! (Кураеш җәй бер мәртәбә, кыш бер мәртәбә Шамга йә Йәмәнгә сәфәр итәләр иде, сәфәрләре Аллаһ ярдәме илә уңышлы булып Мәккә халкын ризык белән тәэмин итеп торалар иде).",
            "verse 106:3": "Алар иман китереп ошбу Кәгъбәнең Раббысы булган Аллаһга гыйбадәт кылсыннар һәм Аның биргән нигъмәтләренә шөкер итсеннәр.",
            "verse 106:4": "Ул – Аллаһ аларны ачлыктан коткарып тук кылды, һәм аларны һәртөрле куркынычлардан имин кылды."
        },
        "Telugu": {
            "verse 106:1": "(అల్లాహ్ రక్షణ మరియు ఆయన కరుణతో) ఖురైషులు (ప్రయాణాలకు) అలవాటు పడ్డారు",
            "verse 106:2": "(అల్లాహ్ కరుణ మరియు ఆయన రక్షణతో) వారు శీతాకాలపు మరియు వేసవి కాలపు ప్రయాణాలు చేయ గలుగుతున్నారు",
            "verse 106:3": "కావున వారు ఆ ఆలయ (కఅబహ్) ప్రభువు (అల్లాహ్)ను మాత్రమే ఆరాధించాలి",
            "verse 106:4": "వారు ఆకలితో ఉన్నప్పుడు ఆయనే వారికి ఆహారమిచ్చాడు మరియు ఆయనే వారిని భయం (ప్రమాదం) నుండి కాపాడాడు"
        },
        "Thai": {
            "verse 106:1": "เพื่อให้ความคุ้นเคยแก่ชาวกุเรช",
            "verse 106:2": "เพื่อให้ความคุ้นเคยแก่พวกเขาในการเดินทางในฤดูหนาว (ไปเยเมน) และฤดูร้อน (ไปชาม)",
            "verse 106:3": "ดังนั้น จงให้พวกเขาเคารพภักดีพระเจ้าแห่งบ้านหลังนี้เถิด (คืออัลกะอฺบะฮฺ)",
            "verse 106:4": "ผู้ทรงให้อาหารแก่พวกเขาให้พ้นจากความหิว และทรงให้ความปลอดภัยแก่พวกเขาให้พ้นจากความหวาดกลัว"
        },
        "Turkish": {
            "verse 106:1": "Kureyş kabilesinin yaz ve kış yolculuklarında uzlaşması ve anlaşması sağlanmıştır.",
            "verse 106:2": "Kureyş kabilesinin yaz ve kış yolculuklarında uzlaşması ve anlaşması sağlanmıştır.",
            "verse 106:3": "Öyleyse kendilerini açken doyuran ve korku içindeyken güven veren bu Ev'in (Kabe'nin) Rabbine kulluk etsinler.",
            "verse 106:4": "Öyleyse kendilerini açken doyuran ve korku içindeyken güven veren bu Ev'in (Kabe'nin) Rabbine kulluk etsinler."
        },
        "Urdu": {
            "verse 106:1": "قریش کے مانوس کرنے کے سبب",
            "verse 106:2": "(یعنی) ان کو جاڑے اور گرمی کے سفر سے مانوس کرنے کے سبب",
            "verse 106:3": "لوگوں کو چاہیئے کہ (اس نعمت کے شکر میں) اس گھر کے مالک کی عبادت کریں",
            "verse 106:4": "جس نے ان کو بھوک میں کھانا کھلایا اور خوف سے امن بخشا"
        },
        "Uyghur": {
            "verse 106:1": "قۇرەيش قوغدالغانلىقلىرى ئۈچۈن،",
            "verse 106:2": "ئۇلار قىشلىق ۋە يازلىق سەپىرىدە قوغدالغانلىقلىرى ئۈچۈن،",
            "verse 106:3": "بۇ ئۆي (يەنى بەيتۇللاھ) نىڭ پەرۋەردىگارىغا ئىبادەت قىلسۇنكى، ئۇ ئۇلارنى ئاچلىقتا ئوزۇقلاندۇردى، ئۇلارنى قورقۇنچتىن ئەمىن قىلدى،",
            "verse 106:4": "بۇ ئۆي (يەنى بەيتۇللاھ) نىڭ پەرۋەردىگارىغا ئىبادەت قىلسۇنكى، ئۇ ئۇلارنى ئاچلىقتا ئوزۇقلاندۇردى، ئۇلارنى قورقۇنچتىن ئەمىن قىلدى"
        },
        "Uzbek": {
            "verse 106:1": "Қурайшнинг лозим тутиши қандай яхши!",
            "verse 106:2": "Уларнинг қиш ва ёз сафарларини ўзларига лозим тутишлари қандай яхши!",
            "verse 106:3": "Бас, улар мана шу Байтнинг Роббисига ибодат қилсинлар!",
            "verse 106:4": "У зот уларини очликдан тўқ қилган, хавфдан омон қилгандир."
        },
        "Vietnamese": {
            "verse 106:1": "Để bảo vệ bộ tộc Quraish được yên bình.",
            "verse 106:2": "TA (Allah) đã làm bằng an cho họ trong chuyến đi vào mùa đông và chuyến đi vào mùa hè.",
            "verse 106:3": "Vì vậy, họ phải thờ phượng Thượng Đế của Ngôi Đền thiêng này.",
            "verse 106:4": "Đấng đã cho họ ăn khi họ đói và ban cho họ sự bình yên khỏi điều sợ hãi."
        },
        "Yoruba": {
            "verse 106:1": "(Ike ni lati odo Allahu) fun idile Ƙuraes lati wa papo ninu aabo",
            "verse 106:2": "(Ike ni se lati odo Allahu) fun won lati wa papo ninu aabo lori irin-ajo ni igba otutu ati igba ooru",
            "verse 106:3": "Nitori naa, ki won josin fun Oluwa Ile (Ka‘bah) yii",
            "verse 106:4": "Eni ti O fun won ni jije (ni asiko) ebi. O si fi won lokan bale ninu ipaya"
        }
    }
}