{
    "id": 108,
    "name_simple": "Al-Kawthar",
    "revelation_place": "makkah",
    "revelation_order": 15,
    "bismillah_pre": true,
    "verses_count": 3,
    "short_text": "The Surah has been titled after the word al-kauthar occurring in the first verse.",
    "text": [
        "The Surah has been titled after the word al-kauthar occurring in the first verse.",
        "Period of Revelation",
        "Ibn Marduyah has cited Hadrat Abdullah bin Abbas, Hadrat Abdullah bin az-Zubair and Hadrat Aishah as saying that this Surah is Makki. Kalbi and Muqatil also regard it as Makki, and the same is the view held by the majority of commentators. But Hadrat Hasan Al-Basri, Ikrimah, Mujahid and Qatadah regard it as Madani. Imam Al-Suyuti in Al-Itqan has confirmed this same view, and Imam Al-Nawawi in his commentary of the Sahih of Muslim has also preferred the same. The reason for this assumption is the tradition which traditionists of the rank of Imam Ahmad, Muslim, Abu Da'ud, Al Nasa'i, Ibn Abi Shaibah, Ibn al-Mundhir, Ibn Marduyah, Baihaqi and others have related from Hadrat Anas bin Malik, saying: \"The Holy Prophet was among us. In the meantime he dozed; then he raised his head, smiling, according to some traditions, the people asked what for he was smiling, according to others, he himself told them that a Surah had just been revealed to him. Then, with 'Bismillah ir-Rahman ir-Rahim', he recited Surah Al-Kauthar; then he asked the people whether they knew what Kauthar was. When they said that Allah and his Messenger had the best knowledge, he said: 'It is a river which my Lord has granted me in Paradise.'\" (The details follow under \"Kauthar \"). The basis of the reasoning from this tradition for this Surah being Madani is that Hadrat Anas belonged to Madinah, and his saying that this Surah was revealed in his presence is a proof that it was Madani.",
        "However, in the first place, Hadrat Anas, Imam Ahmad, Bukhari, Muslim, Abu Da'ud, Tirmidhi and Ibn Jarir have related the traditions which say that this river of Paradise (Al-Kauthar) had been shown to the Holy Prophet (upon whom be peace) on the occasion of the mi'raj (ascension) and everyone knows that mi'raj had taken place at Makkah before the hijrah. Secondly, when, during the mi'raj, the Holy Prophet had not only been informed of this gift of Allah Almighty but also shown it, there was no reason why Surah Al-Kauthar should have been revealed in Madinah to give him the good news of it. Thirdly, if in an assembly of the Companions the Holy Prophet himself had given the news of the revelation of Surah Al-Kauthar which Hadrat Anas has mentioned in his tradition, and it meant that that Surah had been revealed for the first time then, it was not possible that well-informed Companions like Hadrat Aishah, Hadrat Abdullah bin Abbas and Hadrat Abdullah bin Zubair should have declared this Surah to be a Makki revelation and most of the commentators also should have regarded it as Makki. If the matter is considered carefully, there appears to be a flaw in the tradition from Hadrat Anas in that it does not say what was the subject under discussion in the assembly in which the Holy Prophet gave the news about Surah Al-Kauthar. It is possible that at that time, the Holy Prophet was explaining something and in that time, he was informed by revelation that that point was further explained by Surah Al-Kauthar, and he mentioned the same thing, saying that that Surah was revealed to him just then. Such incidents did take place on several occasions, on the basis of which the commentators have opined about certain verses that they were revealed twice. This second revelation, in fact, meant that the verse had been revealed earlier, but on some later occasion the Holy Prophet's attention was invited to it by revelation for the second time. In such traditions, the mention of the revelation of a certain verse is not enough to decide whether it was revealed in Makkah or Madinah, and when precisely it was revealed.",
        "Had this tradition of Hadrat Anas not been there to cause doubt, the whole content of the Surah Al-Kauthar by itself bears evidence that it was revealed in Makkah, and in the period when the Holy Prophet was going through extremely discouraging conditions.",
        "Historical Background",
        "Before this, in Surahs Ad-Duha and Alam Nashrah, we have seen that when in the earliest phase of Prophethood, the Holy Prophet (upon whom be peace) was going through the most trying conditions when the whole nation had turned hostile, there was resistance and opposition on every side, and the Holy Prophet and a handful of his Companions did not see any remote chance of success. Allah in order to console and encourage him at that time had sent down several verses. In Surah Ad- Duha it was said: \"And surely the later period (i.e. every later period) is better for you than the former period, and soon your Lord shall give you so much that you shall be well pleased.\" In Surah Alam Nashrah: \"And We exalted your renown for you.\" That is, \"Though the enemies are trying to defame you throughout the country, We, on the contrary, have arranged to exalt your name and fame.\" and: \"The fact is that along with every hardship there is also ease.\" That is, \"You should not be disheartened by the severity of conditions at this time; this period of hardships will soon pass, and the period of success and victory will follow.\"",
        "Such were the conditions in which Allah by sending down Surah Al-Kauthar consoled the Holy Prophet as well as foretold the destruction of his opponents. The disbelieving Quraish said: \"Muhammad (upon whom be Allah's peace) is cut off from his community and reduced to a powerless and helpless individual.\" According to Ikrimah when the Holy Prophet was appointed a Prophet, and he began to call the people to Islam, the Quraish said: \"Muhammad (upon whom be Allah's peace and blessings) is cut off from his people as a tree is cut off from its root, which might fall to the ground any moment.\" (Ibn Jarir). Muhammad bin Ishaq says: \"Whenever the Prophet (upon whom be peace) was mentioned before As bin Wa'il as-Sehmi, the chief of Makkah, he used to say: \"Let him alone for he is only a childless man (abtar) with no male offspring. When he dies, there will be no one to remember him.\" Shamir bin Atiyyah says that Uqbah bin Abi Mu'ait, also used to say similar things about the Holy Prophet (Ibn Jarir). According to Ibn Abbas, once Ka'b bin Ashraf (the Jewish chief of Madinah) came to Makkah and the Quraish chiefs said to him: \"Just see this boy, who is cut off from his people; he thinks he is superior to us, whereas we manage the Hajj, look after the Ka'bah and water the pilgrims.\" (Bazzar). Concerning this very incident Ikrimah reports that the Quraish had used the words as-sunbur al-munbatir min qaumi-hi (a weak, helpless and childless man who is cut off from his people) for the Holy Prophet. (Ibn Jarir) Ibn Sa'd and lbn Asakir have related that Hadrat Abdullah bin Abbas said: \"The eldest son of the Holy Prophet (upon whom be peace) was Qasim; next to him was Zainab, next to her Hadrat Abdullah and next to him three daughters, viz. Umm Kulthum, Fatimah and Ruqayyah. Of them first Hadrat Qasim died and then Hadrat Abdullah.\" Thereupon As bin Wail said: \"His line has come to an end: now he is abtar (i. e. cut of from root).\" Some traditions add that As bin Wail said \"Muhammad is abtar: he has no son to succeed him. When he dies, his memory will perish and you will be rid of him.\" The tradition from Ibn Abbas, which Abd bin Humaid has related, shows that Abu Jahl also had said similar words on the death of the Holy Prophet's son, Abdullah. Ibn Abi Hatim has related on the authority of Shmir bin Atiyyah that the same kind of meanness was shown by Uqbah bin Abi Mu'ait by rejoicing at this bereavement of the Holy Prophet. Ata says that when the second son of the Holy Prophet died, his own uncle, Abu Lahab (whose house was next to his) hastened to the pagans and gave them the \"good news\": Batira Muhammadun al-lail :\"Muhammad has become childless this night, or he is cut off from root.\"",
        "Such were the disturbing conditions under which Surah Al-Kauthar was sent down. The Quraish were angry with him because he worshiped and served only Allah and repudiated their idolatry publicly. For this very reason he was deprived of the rank, esteem and honor that he enjoyed among his people before Prophethood and was now cut off from his community. The handful of his Companions also were helpless, poor people who were being persecuted and tyrannized. Furthermore, he was bereaved by the death of two sons, one after the other, at which the near relatives and the people of his clan, brotherhood and neighborhood were rejoicing and uttering such words that were disheartening and disturbing for a noble person who had treated even his enemies most kindly. At this, Allah just in one sentence of this brief Surah gave him the good news, better news than that which has ever been given to any man in the world, besides the decision that it will be his opponents who will be cut off from their root and not he."
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that informs the Prophet Muḥammad that God has gifted him with Abundance goodness in this life and far greater resplendence in the Hereafter—for which he is instructed to ever show gratitude and charitable generosity. It takes its name from “the abundance” (al-kawthar) mentioned in verse 1. The surah comes to reassure the Prophet Muḥammad and as a retort to his enemy.The surah is also known as: Abundant Goodness, Plenty, Pre-eminence, The Great Abundance.",
    "name_translation": "Abundance",
    "name_complex": "Al-Kawthar",
    "surah_name_ar": "الكوثر",
    "verses": {
        "Albanian": {
            "verse 108:1": "Na, me të vërtetë, të kemi dhënë ty shumë të mira,",
            "verse 108:2": "andaj, bënë namaz për Zotin tënd dhe therr kurban.",
            "verse 108:3": "Me të vërtetë, ai që të urren ty, ai vetë është i cungët."
        },
        "Amharic": {
            "verse 108:1": "እኛ በጣም ብዙ በጎ ነገሮችን ሰጠንህ፡፡",
            "verse 108:2": "ስለዚህ ለጌታህ ስገድ፤ (በስሙ) ሰዋም፡፡",
            "verse 108:3": "ጠይህ (የሚጠላህ) እርሱ በእርግጥ (ዘሩ) የተቆረጠው ነው፡፡"
        },
        "Arabic": {
            "verse 108:1": "َرَثْوَكْلا َكاَنْيَطْعَأ اَّنِإ",
            "verse 108:2": "ْرَحْناَو َكِّبَرِل ِّلَصَف",
            "verse 108:3": "ُرَتْبَأْلا َوُه َكَئِناَش َّنِإ"
        },
        "Azerbaijani": {
            "verse 108:1": "Həqiqətən, Biz Kovsəri sənə bağışladıq.",
            "verse 108:2": "Sən də Rəbbin üçün namaz qıl və qurban kəs!",
            "verse 108:3": "Doğrusu, sənə ədavət bəsləyənin özü sonsuzdur."
        },
        "Bengali": {
            "verse 108:1": "নিশ্চয় আমি আপনাকে কাওসার দান করেছি।",
            "verse 108:2": "অতএব আপনার পালনকর্তার উদ্দেশ্যে নামায পড়ুন এবং কোরবানী করুন।",
            "verse 108:3": "যে আপনার শত্রু, সেই তো লেজকাটা, নির্বংশ।"
        },
        "Berber Amazigh": {
            "verse 108:1": "Ni$ Nefka yak lufa.",
            "verse 108:2": "èéal i Mass ik, zzlu îêegga.",
            "verse 108:3": "Ih, axûim ik, amengur d neppa."
        },
        "Bosnian": {
            "verse 108:1": "Mi smo ti, uistinu, mnogō dobro dali,",
            "verse 108:2": "zato se Gospodaru svome moli i kurban kolji,",
            "verse 108:3": "onaj koji tebe mrzi sigurno će on bez spomena ostati."
        },
        "Bulgarian": {
            "verse 108:1": "Ние ти дадохме [о, Мухаммад реката] ал-Каусар.",
            "verse 108:2": "Затова отслужвай молитвата към своя Господ и [жертвено животно] коли!",
            "verse 108:3": "Твоят ненавистник - той е лишеният."
        },
        "Chinese": {
            "verse 108:1": "我确已赐你多福,",
            "verse 108:2": "故你应当为你的主而礼拜, 并宰牺牲。",
            "verse 108:3": "怨恨你者, 确是绝后的。"
        },
        "Danish": {
            "verse 108:1": "Voorwaar, Wij hebben u in overvloed het goede gegeven",
            "verse 108:2": "Bid daarom tot uw Heer en offer",
            "verse 108:3": "Voorzeker, uw vijand zal uitsterven"
        },
        "Dutch": {
            "verse 108:1": "Waarlijk, Wij hebben jou de overvloed geschonken.",
            "verse 108:2": "Verricht daarom de shalât voor jouw Heer en slacht offerdieren.",
            "verse 108:3": "Voorwaar, jouw hater, hij is het die afgesneden is."
        },
        "English": {
            "verse 108:1": "Indeed, We have granted you, [O Muhammad], al-Kawthar.",
            "verse 108:2": "So pray to your Lord and sacrifice [to Him alone].",
            "verse 108:3": "Indeed, your enemy is the one cut off."
        },
        "Filipino": {
            "verse 108:1": "Katotohanang sa iyo (O Muhammad) ay ipinagkaloob Namin ang Al-Kawthar (isang Bukal sa Paraiso)",
            "verse 108:2": "Kaya’t sa iyong Panginoon mo lamang ikaw ay mag-ukol ng dalangin at Pag-aalay",
            "verse 108:3": "At sa mga namumuhi sa iyo (o Muhammad), siya ay pagkakaitan (ng bawat mabuting bagay sa mundong ito at pag-asang maaasam sa Kabilang Buhay)"
        },
        "French": {
            "verse 108:1": "Nous t'avons certes, accordé l'Abondance.",
            "verse 108:2": "Accomplis la Salât pour ton Seigneur et sacrifie.",
            "verse 108:3": "Celui qui te hait sera certes, sans postérité."
        },
        "Fulah": {
            "verse 108:1": "Min tottiima AlKawsara. @Corrected",
            "verse 108:2": "juulan joom Ma mboroɗa",
            "verse 108:3": "Gañɗo ma o woni taƴiiɗo"
        },
        "German": {
            "verse 108:1": "Wir haben dir ja al-Kautar gegeben.",
            "verse 108:2": "So bete zu deinem Herrn und opfere.",
            "verse 108:3": "Gewiß, derjenige, der dich haßt, - er ist vom Guten abgetrennt ."
        },
        "Hausa": {
            "verse 108:1": "Lalle ne Mu, Mun yi maka kyauta mai yawa.",
            "verse 108:2": "Saboda haka, ka yi salla dõmin Ubangijinka, kuma ka sõke (baiko, wato sukar raƙumi).",
            "verse 108:3": "Lalle mai aibanta ka shi ne mai yankakkiyar albarka."
        },
        "Hindi": {
            "verse 108:1": "(ऐ रसूल) हमनें तुमको को कौसर अता किया,",
            "verse 108:2": "तो तुम अपने परवरदिगार की नमाज़ पढ़ा करो",
            "verse 108:3": "और क़ुर्बानी दिया करो बेशक तुम्हारा दुश्मन बे औलाद रहेगा"
        },
        "Indonesian": {
            "verse 108:1": "Sesungguhnya Kami telah memberikan kepadamu nikmat yang banyak.",
            "verse 108:2": "Maka dirikanlah shalat karena Tuhanmu; dan berkorbanlah.",
            "verse 108:3": "Sesungguhnya orang-orang yang membenci kamu dialah yang terputus."
        },
        "Italian": {
            "verse 108:1": "In verità ti abbiamo dato l’abbondanza.",
            "verse 108:2": "Esegui l’orazione per il tuo Signore e sacrifica!",
            "verse 108:3": "In verità sarà colui che ti odia a non avere seguito."
        },
        "Japanese": {
            "verse 108:1": "本当にわれは，あなた（ムハソマド）に潤沢を授けた。",
            "verse 108:2": "さあ，あなたの主に礼拝し，犠牲を棒げなさい。",
            "verse 108:3": "本当にあなたを憎悪する者こそ，（将来の希望を）断たれるであろう。"
        },
        "Jawa": {
            "verse 108:1": "Sayekti Ingsun wus aweh kabecikan kaliwat akeh marang sira",
            "verse 108:2": "Mulane shalata marang Pangeranira sarta nyembeliha kurban",
            "verse 108:3": "Sayekti mungsuhira (wong kang sengit) iku wong pedhot becike"
        },
        "Kazakh": {
            "verse 108:1": "Ей, Мұхаммед! Ақиқатында, Біз саған Кәусәрді бердік",
            "verse 108:2": "Раббың үшін намаз оқы және құрбандық шал",
            "verse 108:3": "Анығында, сені жеккөрушінің, өзінің соңы кесілген"
        },
        "Korean": {
            "verse 108:1": "하나님이 그대에게 풍성한 은혜를 베풀었나니하나님이 그대에게 풍성한 은혜를 베풀었나니",
            "verse 108:2": "주님께 기도하고 제물을 바 치라주님께 기도하고 제물을 바 치라",
            "verse 108:3": "실로 그대의 적은 모든 희망 으로부터 단절된 자들이라실로 그대의 적은 모든 희망 으로부터 단절된 자들이라"
        },
        "Kurdish": {
            "verse 108:1": "(Muhemmed!) Bi rastî me ji bona te ra (bostanne) ku ava wan hilwejokin dayeبه‌ڕاستی ئێمه خێر و چاکه و خۆشی (هه‌ر دوو جیهان و ناوبانگی چاکه‌ی‎) تۆمان (محمد (صلی الله علیه وسلم) بێ ئه‌ندازه و بێ سنور کردوه (له هه‌موو جه‌رخ و زه‌مانێکدا).",
            "verse 108:2": "Îdî tu ji bona Xuda yê xwe ra nimej bike û (ji bona qayîlbûna wî) goryan jêbikeکه‌واته نوێژ ته‌نها له‌به‌ر خوا و بۆ خوا و بۆ به‌ده‌ست هێنانی ڕه‌زامه‌ندی په‌روه‌ردگارت ئه‌جام بده‌و قوربانیش بکه (هه‌ر به‌و شێوه‌یه بۆ به‌ده‌ست هێنانی ڕه‌زامه‌ندی په‌روه‌ردگارت).",
            "verse 108:3": "Birastî hey dexesê te bi xweberin poçik birne bêdûmdan in"
        },
        "Kyrgyz": {
            "verse 108:1": "(О, Мухаммад) чынында Биз сага «Каусарды» бердик.”",
            "verse 108:2": "Сен эми, (ушул жакшылыктар үчүн шүгүр кылып) Раббиң үчүн намаз оку жана курмандык чал",
            "verse 108:3": "Албетте, сени айыптаган адамдын өзүнүн арты кесилген"
        },
        "Malay": {
            "verse 108:1": "Sesungguhnya Kami telah mengurniakan kepadamu (wahai Muhammad) kebaikan yang banyak (di dunia dan di akhirat).",
            "verse 108:2": "Oleh itu, kerjakanlah sembahyang kerana Tuhanmu semata-mata, dan sembelihlah korban (sebagai bersyukur).",
            "verse 108:3": "Sesungguhnya orang yang bencikan engkau, Dia lah yang terputus (dari mendapat sebarang perkara yang diingininya)."
        },
        "Malayalam": {
            "verse 108:1": "തീര്‍ച്ചയായും നിനക്ക് നാം ധാരാളം നേട്ടം നല്‍കിയിരിക്കുന്നു.",
            "verse 108:2": "ആകയാല്‍ നീ നിന്‍റെ രക്ഷിതാവിന് വേണ്ടി നമസ്കരിക്കുകയും ബലിയര്‍പ്പിക്കുകയും ചെയ്യുക.",
            "verse 108:3": "തീര്‍ച്ചയായും നിന്നോട് വിദ്വേഷം വെച്ച് പുലര്‍ത്തുന്നവന്‍ തന്നെയാകുന്നു വാലറ്റവന്‍ (ഭാവിയില്ലാത്തവന്‍)."
        },
        "Norwegian": {
            "verse 108:1": "Vi har visselig gitt deg i overflod!",
            "verse 108:2": "Så be til Herren, og bring offer!",
            "verse 108:3": "Sannelig, han som har lagt deg for hat, han har intet etter seg."
        },
        "Pashto": {
            "verse 108:1": "بېشكه مونږ تا ته كوثر دركړى دى",
            "verse 108:2": "نو ته د خپل رب لپاره لمونځ كوه او قرباني كوه",
            "verse 108:3": "بېشكه ستا دښمن هم هغه بې بنیاده (او لاولده) دى"
        },
        "Persian": {
            "verse 108:1": "ما كوثر را به تو عطا كرديم.",
            "verse 108:2": "پس براى پروردگارت نماز بخوان و قربانى كن‌",
            "verse 108:3": "كه بدخواه تو خود اَبتر است."
        },
        "Polish": {
            "verse 108:1": "Zaprawdę, My daliśmy tobie obfitość!",
            "verse 108:2": "Módl się przeto do twego Pana i składaj ofiary!",
            "verse 108:3": "Zaprawdę, ten, kto ciebie nienawidzi - pozostanie bez potomstwa!"
        },
        "Portuguese": {
            "verse 108:1": "Em verdade, agraciamos-te com a abundância.",
            "verse 108:2": "Reza, pois, ao teu Senhor, e faze sacrifício.",
            "verse 108:3": "Em verdade, quem te insultar não terá posteridade."
        },
        "Punjabi": {
            "verse 108:1": "ਅਸੀਂ ਤੁਹਾਨੂੰ ਕੌਸਰ (ਜੰਨਤ ਦੀ ਨਹਿਰ) ਬਖਸ਼ ਦਿੱਤੀ।",
            "verse 108:2": "ਤਾਂ ਆਪਣੇ ਰੱਬ ਲਈ ਨਮਾਜ਼ ਪੜ੍ਹੋ ਅਤੇ ਕੁਰਬਾਨੀ (ਤਿਆਗ) ਕਰੋ।",
            "verse 108:3": "ਬੇਸ਼ੱਕ ਤੁਹਾਡਾ ਵੈਰੀ ਹੀ ਬੇ-ਔਲਾਦ ਰਹੇਗਾ। (ਭਾਵ ਉਸ ਦਾ ਨਿਸ਼ਾਨ ਬਾਕੀ ਨਹੀਂ ਰਹੇਗਾ)।"
        },
        "Roman english": {
            "verse 108:1": "Innaa a`taina kal kauthar",
            "verse 108:2": "Fa salli li rabbika wanhar",
            "verse 108:3": "Inna shani-aka huwal abtar"
        },
        "Russian": {
            "verse 108:1": "Все блага даровали Мы тебе.",
            "verse 108:2": "Так обрати же к Господу свои молитвы и жертвоприноси.",
            "verse 108:3": "Ведь тот, кто ненависть к тебе питает, Отвергнут будет (Им) навечно."
        },
        "Sindhi": {
            "verse 108:1": "(اي پيغمبر) بيشڪ اسان توکي ڪوثر عطا ڪيو.",
            "verse 108:2": "تنھنڪري پنھنجي پالڻھار جي لاءِ نماز پڙھ ۽ قرباني ڪر.",
            "verse 108:3": "بيشڪ تنھنجو ويري ئي بي نسل آھي."
        },
        "Sinhalese": {
            "verse 108:1": "නියත වශයෙන්ම අපි නුඹට අසීමිත සම්පත් පිරිනැමුවෙමු.",
            "verse 108:2": "එබැවින් නුඹ නුඹගේ පරමාධිපතිට සලාතය ඉටු කර නුඹ සත්ත්ව කැපයක් දෙනු.",
            "verse 108:3": "නියත වශයෙන්ම නුඹට දොස් පවරන්නා වන ඔහුමය පෙළපත නොමැත්තා."
        },
        "Somali": {
            "verse 108:1": "Annagaa ku Sinnay Nabiyow Waadi Janno (iyo khary badan).",
            "verse 108:2": "Ee tuko Eebaha dartiis, waxna u gawrac.",
            "verse 108:3": "Ruuxii ku necebna waa mid cidhib beelay."
        },
        "Spanish": {
            "verse 108:1": "Es cierto que te hemos dado la Abundancia.",
            "verse 108:2": "Por eso reza a tu Señor y ofrece sacrificios.",
            "verse 108:3": "Porque es quien te detesta, el que no tendrá posteridad."
        },
        "Swahili": {
            "verse 108:1": "Hakika tumekupa kheri nyingi.",
            "verse 108:2": "Basi sali na uchinje kwa ajili ya Mola wako Mlezi.",
            "verse 108:3": "Hakika anaye kuchukia ndiye aliye mpungufu."
        },
        "Swedish": {
            "verse 108:1": "VI HAR sannerligen gett dig det goda i överflöd!",
            "verse 108:2": "Be därför till din Herre och förrätta [ditt] offer!",
            "verse 108:3": "Det är den som är full av hat mot dig, som är utestängd [från Guds nåd]."
        },
        "Tajik": {
            "verse 108:1": "Мо кавсарро ба ту ато кардем.",
            "verse 108:2": "Пас барои Парвардигорат намоз бихон ва қурбонӣ кун,",
            "verse 108:3": "ки бадхоҳи ту худ абтар аст."
        },
        "Tamil": {
            "verse 108:1": "(நபியே!) நிச்சயமாக நாம் உமக்கு கவ்ஸர் (என்ற தடாகத்தை) கொடுத்திருக்கின்றோம்.",
            "verse 108:2": "எனவே, உம் இறைவனுக்கு நீர் தொழுது, குர்பானியும் கொடுப்பீராக.",
            "verse 108:3": "நிச்சயமாக உம்முடைய பகைவன் (எவனோ) அவன்தான் சந்ததியற்றவன்."
        },
        "Tatar": {
            "verse 108:1": "Ий Мухәммәд г-м, тәхкыйк, Без сиңа күп хәерле нәрсәләр бирдек. Ягъни пәйгамбәрлек дәрәҗәсен, зур белем, күркәм холык һәм ахирәттә кәүсәр елгасын бирдек, ул елга сиңа һәм өммәтеңә хасдыр.",
            "verse 108:2": "Раббың ризалыгы өчен намаз укыгыл һәм ятимнәрне вә фәкыйрьләрне ашатыр өчен корбан чал!",
            "verse 108:3": "Тәхкыйк, сине әбетәр дип кимсетүче дошманың үзе әбетәрдер – нәселе бетүчедер. (Мухәммәд г-мнең ир балалары үлеп бетүләре сәбәпле мөшрикләр, Мухәммәднең ир балалары калмый, нәселе бетә, койрыксыз дип көлгәннәр. Бу сүрә шул хакта инде. Мухәммәд г-мнең нәселе дә һәм өммәте дә бетмәде). Бервакыт мөшрикләр пәйгамбәр алдына килеп: \"Ий Мухәммәд син безнең сынымнарыбызга бераз вакыт гыйбадәт кыл, без дә сннең Раббыңа бераз вакыт гыйбадәт кылырбыз. Әгәр синең динең яхшы булып чыкса, без сиңа иярербез, әгәр безнең динебез яхшы булып чыкса, син безгә иярерсең\", – диделәр. Бу сүрә шул хакта иңде."
        },
        "Telugu": {
            "verse 108:1": "(ఓ ముహమ్మద్!) నిశ్చయంగా, మేము నీకు కౌసర్ ప్రసాదించాము",
            "verse 108:2": "కనుక నీవు నీ ప్రభువు కొరకే నమాజ్ చెయ్యి మరియు బలి (ఖుర్బానీ) కూడా (ఆయన కొరకే) ఇవ్వు",
            "verse 108:3": "నిశ్చయంగా నీ శత్రువు, వాడే! వేరు తెగిన వాడిగా (వారసుడూ, పేరూ లేకుండా) అయిపోతాడు"
        },
        "Thai": {
            "verse 108:1": "แท้จริงเราได้ประทานอัลเกาซัรแก่เจ้าแล้ว",
            "verse 108:2": "ดังนั้นเจ้าจงละหมาดเพื่อพระเจ้าของเจ้าและจงเชือดสัตว์พลี",
            "verse 108:3": "แท้จริงศัตรูของเจ้านั้นเขาเป็นผู้ถูกตัดขาด"
        },
        "Turkish": {
            "verse 108:1": "Doğrusu sana pek çok nimet vermişizdir.",
            "verse 108:2": "Öyleyse Rabbin için namaz kıl, kurban kes.",
            "verse 108:3": "Doğrusu adı sanı ortadan kalkacak olan, sana kin tutan kimsedir."
        },
        "Urdu": {
            "verse 108:1": "(اے محمدﷺ) ہم نے تم کو کوثر عطا فرمائی ہے",
            "verse 108:2": "تو اپنے پروردگار کے لیے نماز پڑھا کرو اور قربانی دیا کرو",
            "verse 108:3": "کچھ شک نہیں کہ تمہارا دشمن ہی بےاولاد رہے گا"
        },
        "Uyghur": {
            "verse 108:1": "بىز ساڭا ھەقىقەتەن نۇرغۇن ياخشىلىقلارنى ئاتا قىلدۇق",
            "verse 108:2": "پەرۋەردىگارىڭ ئۈچۈن ناماز ئوقۇغىن ۋە قۇربانلىق قىلغىن",
            "verse 108:3": "ھەقىقەتەن سېنىڭ دۈشمىنىڭنىڭ نام - نىشانى قالمايدۇ"
        },
        "Uzbek": {
            "verse 108:1": "Албатта, Биз сенга Кавсарни бердик.",
            "verse 108:2": "Бас, Роббингга намоз ўқи ва жонлик сўй.",
            "verse 108:3": "Албатта, сени ёмон кўриб, айбловчининг орқаси кесикдир."
        },
        "Vietnamese": {
            "verse 108:1": "Quả thật, TA (Allah) đã ban cho Ngươi (Thiên Sứ Muhammad) sông Kawthar (nơi Thiên Đàng).",
            "verse 108:2": "Vì vậy, Ngươi hãy hướng về Thượng Đế của Ngươi mà dâng lễ nguyện Salah và giết tế.",
            "verse 108:3": "Quả thật, chỉ kẻ thù của Ngươi mới thực sự bị cắt đứt hết mọi hy vọng."
        },
        "Yoruba": {
            "verse 108:1": "Dajudaju Awa fun o ni opolopo oore",
            "verse 108:2": "Nitori naa, kirun fun Oluwa re, ki o si gunran (fun Un)",
            "verse 108:3": "Dajudaju, eni t’o n binu re, oun ni ko nii leyin"
        }
    }
}