{
    "id": 110,
    "name_simple": "An-Nasr",
    "revelation_place": "madinah",
    "revelation_order": 114,
    "bismillah_pre": true,
    "verses_count": 3,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from the word nasr occurring in the first verse.",
    "text": [
        "\n",
        "The Surah takes its name from the word nasr occurring in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Hadrat Abdullah bin Abbas states that this is the last Surah of the Quran to be revealed, i. e. no complete Surah was sent down to the Holy Prophet after it. (Muslim Nasai, Tabarani, Ibn Abi Shaibah, Ibn Marduyah).",
        "\n",
        "According to Hadrat Abdullah bin Umar, this Surah was sent down on the occasion of the Farewell Pilgrimage in the middle of the Tashriq Days at Mina, and after it the Holy Prophet rode his she camel and gave his well known Sermon. (Tirmidhi, Bazzar, Baihaqi, Ibn Abi Shaibah, Abd bin Humaid, Abn Yala, Ibn Marduyah). Baihaqi in Kitab al- Hajj has related from the tradition of Hadrat Sarra bint-Nabhan the Sermon which the Holy Prophet gave on this occasion. She says:",
        "\n",
        "\"At the Farewell Pilgrimage I heard the Holy Prophet say: O people, do you know what day it is? They said: Allah and His Messenger have the best knowledge. He said: This is the middle day of the Tashriq Days. Then he said: Do you know what place it is? They said: Allah and His Messenger have the best knowledge. He said: This is Masharil-Haram. Then he said: I do not know, I might not meet you here again. Beware, your bloods and your honors are forbidden, until you appear before your Lord, and He questions you about your deeds. Listen: let the one who is near convey it to him who is far away. Listen: have I conveyed the message to you? Then, when we returned to Madinah, the Holy Prophet passed away not many days after that.\"",
        "\n",
        "If both these traditions are read together, it appears that there was an interval of three months and some days between the revelation of Surah An-Nasr and the Holy Prophet's death, for historically the same was the interval between the Farewell Pilgrimage and the passing away of the Holy Prophet.",
        "\n",
        "Ibn Abbas says that when this Surah was revealed, the Holy Prophet said that he had been informed of his death and his time had approached. (Musnad Ahmad, Ibn Jarir, Ibn al-Mundhir, Ibn Marduyah). In the other traditions related from Hadrat Abdullah bin Abbas, it has been stated that at the revelation of this Surah the Holy Prophet understood that he had been informed of his departure from the world.(Musnad Ahmad, Ibn Jarir, Tabarani, Nasai, Ibn Abi Hatim, Ibn Marduyah).",
        "\n",
        "Mother of the Believers, Hadrat Umm Habibah, says that when this Surah was revealed the Holy Prophet said that he would leave the world that year. Hearing this Hadrat Fatimah wept. Thereat he said: \"From among my family you will be the first to join me.\" Hearing this she laughed.(Ibn Abi Hatim, Ibn Marduyah). A tradition containing almost the same theme has been related by Baihaqi from Ibn Abbas.",
        "\n",
        "Ibn Abbas says: \"Hadrat Umar used to invite me to sit in his assembly along with some of the important elderly Companions who had fought at Badr. This was not liked by some of them. They complained that they also had sons who were like the boy. Why then was he in particular invited to sit in the assembly? (Imam Bukhari and Ibn Jarir have pointed out that such a thing was said by Hadrat Abdur Rahman bin Auf).",
        "\n",
        "Hadrat Umar said that the boy enjoyed the position and distinction because of his knowledge. Then one day he invited the Companions of Badr and called me also to sit with them. I understood that he had invited me to the assembly to prove his contention. During the conversation Hadrat Umar asked the Companions of Badr: \"What do you say about Idha jaa nasrullahi wal- fath?\" Some said: \"In it we have been enjoined to praise Allah and ask for His forgiveness when His succor comes and we attain victory.\"Some others said that it implied the conquest of cities and forts. Some kept quiet. Then Hadrat Umar said: \"Ibn Abbas, do you also say the same?\"I said no. He asked: \"What then is your view?\"I submitted that it implied the last hour of Allah's Messenger (upon whom be peace); in it he was informed that when Allah's succor came and victory was attained, it would be a sign that his hour had come; therefore, he should praise Allah and ask for His forgiveness. Thereat Hadrat Umar\r\nsaid \"I know naught but what you have said.\"",
        "\n",
        "In another tradition there is the addition that, Hadrat Umar said to the Companions: \"How can you blame me when you yourselves have seen why I invite this boy to join the assembly?\" (Bukhari, Musnad Ahmad, Tirmidhi, Ibn Jarir, Ibn Marduyah, Baghawi, Baihaqi, Ibn al-Mundhir).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "As is shown by the above traditions, Allah in this Surah had informed His Messenger (upon whom be peace) that when Islam attained complete victory in Arabia and the people started entering Allah's religion in great numbers, it would mean that the mission for which he had been sent to the world, had been fulfilled. Then, he was enjoined to busy himself in praising and glorifying Allah by Whose bounty he had been able to accomplish such a great task, and should implore Him to forgive whatever failings and frailties he might have shown in the performance of the service. Here, by a little consideration one can easily see the great difference that there is between a Prophet and a common worldly leader. If a worldly leader in his own lifetime is able to bring about a revolution, which has the aim and objective of his struggle, this would be an occasion for exultation for him. But here we witness quite another phenomenon. The Messenger of Allah in a brief space of 23 years\r\nrevolutionized an entire nation as regards its beliefs, thoughts, customs, morals, civilization, ways of living, economy, politics and fighting ability, and raising it from ignorance and barbarism enabled it to conquer the world and become leader of nations; yet when he had accomplished this unique task, he was not enjoined to celebrate it but to glorify and praise Allah and to pray for His forgiveness, and he busied himself humbly the implementation of that command.",
        "\n",
        "Hadrat Aishah says: \"The Holy Messenger (upon whom be peace) often used to recite Subhanak-Allahumma wa bi-hamdika astaghfiruka wa atubu ilaika (according to some other traditions, Subhan Allahi wa bi hamdi-hi as- taghfirullaha wa atubu ilaihi) before his death. I asked: O Messenger of Allah, what are these words that you have started reciting now? He replied: A sign has been appointed for me so that when I see it, I should recite these words, and it is: Idha jaa nasrullahi wal-fathu.\" (Musnad Ahmad, Muslim, Ibn Jarir, lbn al-Mundhir, Ibn Marduyah).",
        "\n",
        "In some other traditions on the same subject Hadrat Aishah has reported that the Holy Prophet often recited the following words in his ruku and sajdah: Subhanak-Allahumma wa-bi hamdika, Allahumma- aghfirli. This was the interpretation of the Quran (i. e. of Surah An-Nasr) that he had made.(Bukhari, Muslim Abu Daud, Nasai, Ibn Majah, Ibn Jarir).",
        "\n",
        "Hadrat Umm Salamah says that the Holy Prophet (upon whom be peace) during his last days very often recited the following words sitting and standing, going out of the house and coming back to it: Subhan Allahi wa-bi hamdi-hi. I one day asked: \"Why do you recite these words so often? O Messenger of Allah\". He replied: I have been enjoined to do so. Then he recited this Surah.\" (Ibn Jarir).",
        "\n",
        "According to Hadrat Abdullah bin Masud, when this Surah was revealed, the Messenger of Allah (upon whom be peace) frequently began to recite the words Subhanak-Allahumma wa bi-hamdika, Allahumm-aghfirli, subhanaka Rabbana wa bi-hamdika, Allahumm-aghfirli, innaka anta at- Tawwab al-Ghafur.(Ibn Jarir, Musnad Ahmad, Ibn Abi Hatim).",
        "\n",
        "Ibn Abbas has stated that after the revelation of this Surah the Holy Messenger (upon whom be peace) began to labor so intensively and devotedly hard for the Hereafter as he had never done before.",
        "\n"
    ],
    "description": "The surah that informs the Prophet Muḥammad that The Help of God is imminent in the liberation of Mecca from idolatry, in the throngs whose hearts God will open to Islam, and in the approach of his own passing to the mercy of God. It takes its name from verse 1, in which the phrase “naṣr Allah” (meaning “Allah’s help”) occurs.The surah is also known as: (Divine) Support, The Ultimate Victory.",
    "name_translation": "THE HELP",
    "name_complex": "An-Nasr",
    "surah_name_ar": "النصر",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 110:1": "Kur të arrijë ndihma e Zotit dhe fitorja,",
                            "verse 110:2": "dhe i sheh njerëzit grupe-grupe duke hyrë në fenë e Perëndisë (në Islamizëm)",
                            "verse 110:3": "atëherë lavdëroje Zotin tënd dhe kërko falje nga Ai; se Ai, me të vërtetë, është pranues i madh i pendimeve."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "(Ya Peyğəmbər!) Allahın köməyi və zəfər (Məkkənin fəthi) gəldiyi zaman;",
                            "verse 110:2": "İnsanların dəstə-dəstə Allahın dininə (islama) daxil olduqlarını gördüyün zaman",
                            "verse 110:3": "Rəbbini həmd-səna ilə təqdis et (Onu bütün naqis sifətlərdən uzaq tutub pak bil, \"Sübhanəkə Allahümmə və bihəmdikə\" kəlməsini de) və Ondan bağışlanmağını dilə."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Kada Allahova pomoć i pobjeda dođu,",
                            "verse 110:2": "i vidiš ljude kako u skupinama u Allahovu vjeru ulaze",
                            "verse 110:3": "ti veličaj Gospodara svoga hvaleći Ga i moli Ga da ti oprosti, On je uvijek pokajanje primao."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "যখন আসবে আল্লাহর সাহায্য ও বিজয়",
                            "verse 110:2": "এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন,",
                            "verse 110:3": "তখন আপনি আপনার পালনকর্তার পবিত্রতা বর্ণনা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় তিনি ক্ষমাকারী। দেখবেন,"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 110:1": "Когато дойде подкрепата на Аллах и победата,",
                            "verse 110:2": "и видиш хората да встъпват на тълпи в религията на Аллах,",
                            "verse 110:3": "прославяй своя Господ с възхвала и Го моли за опрощение! Той винаги приема покаянието."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "當真主的援助和勝利降臨 ,",
                            "verse 110:2": "而你看見眾人成群結隊地崇奉真主的宗教時 ,",
                            "verse 110:3": "你應當贊頌你的主超絕萬物 ,并且向他求饒 ,他確是至宥的。 ,"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Až vítězná pomoc Boží přijde, až spěch se dostaví",
                            "verse 110:2": "a uvidíš lidi vstupovat houfně v náboženství Boží,",
                            "verse 110:3": "pak oslavuj chválou Pána svého a pros jej o odpuštění, vždyť On věru ke kajícníku je milostivý! Boží,"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Als de hulp van God en overwinning komt,",
                            "verse 110:2": "En je de mensen groepsgewijze ziet binnentreden tot God’s godsdienst,",
                            "verse 110:3": "Roem dan jouw Heer met de lof, die Hem toekomt en vraag vergiffenis van Hem; voorzeker Hij aanvaard berouw."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 110:1": "When Allah’s succour and the triumph cometh",
                            "verse 110:2": "And thou seest mankind entering the religion of Allah in troops,",
                            "verse 110:3": "Then hymn the praises of thy Lord, and seek forgiveness of Him."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 110:1": "When comes the Help of God, and Victory,",
                            "verse 110:2": "And thou dost see the people enter God’s Religion in crowds,",
                            "verse 110:3": "Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 110:1": "When comes the help of God, and victory,",
                            "verse 110:2": "and thou seest men entering God’s religion in throngs,",
                            "verse 110:3": "then proclaim the praise of thy Lord, and seek His forgiveness; for He turns again unto men."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 110:1": "WHEN GOD’S SUCCOUR comes, and victory,",
                            "verse 110:2": "and thou seest people enter God’s religion in hosts,",
                            "verse 110:3": "extol thy Sustainer’s limitless glory, and praise Him, and seek His forgiveness: for, behold, He is ever an acceptor of repentanc.",
                            "verse 110:4": "religion in the sight of God is",
                            "verse 110:5": "self-surrender unto Him."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 110:1": "(O Prophet,) When there comes Allah’s help and the Victory,",
                            "verse 110:2": "and you see people entering Allah’s (approved) religion in multitudes,",
                            "verse 110:3": "then pronounce the purity and praise of your Lord, and seek forgiveness from Him."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 110:1": "When the help of God comes together with victory",
                            "verse 110:2": "and you see people entering God’s religion in throngs,",
                            "verse 110:3": "then glorify with praise of your Lord and seek forgiveness from Him; for verily He is ever ready to relent."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 110:1": "When there comes Allah’s help and victory,",
                            "verse 110:2": "And you see people joining Allah’s Din (Religion) in droves,",
                            "verse 110:3": "Then glorify Allah’s praise (in gratitude), exalting Him, and beg Him (humbly) for pardon."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Kun Jumalalta apu ja voitto tulee,",
                            "verse 110:2": "kun näet ihmisten suurin joukoin liittyvän Jumalan uskontoon,",
                            "verse 110:3": "silloin ylistä Herrasi kunniaa ja ano Hänen anteeksiantoaan."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 110:1": "Lorsqu'arrivent le secours de Dieu et la victoire,",
                            "verse 110:2": "et que tu vois les hommes entrer en foule dans la Religion de Dieu,",
                            "verse 110:3": "célèbre les louanges de ton Seigneur et demande-Lui pardon."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 110:1": "Lorsque vient le secours de Dieu ainsi que la victoire,",
                            "verse 110:2": "et que tu vois les gens entrer en foule dans la religion de Dieu,",
                            "verse 110:3": "alors, par la louange, célèbre la gloire de ton Seigneur et implore Son pardon."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Wenn Allahs Hilfe kommt und der Sieg",
                            "verse 110:2": "Und du die Menschen scharenweise in die Religion Allahs eintreten siehst,",
                            "verse 110:3": "Dann lobpreise du deinen Herrn und bitte Ihn um Vergebung."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": ",s jlwy tc [+kqnk dh enn vk ig¡qpsxh",
                            "verse 110:2": "vkSj Qrsg ¼eDdk½ gks tk,xh vkSj rqe yksxksa dks ns[kksxs fd xksy ds xksy [+kqnk ds nhu esa nkf[+ky gks jgs gSa",
                            "verse 110:3": "rks rqe vius ijojfnxkj dh rkjhQ+ ds lkFk rlchg djuk vkSj mlh ls ex+Qs+jr dh nqvk ek¡xuk og cs’kd cM+k ekQ+ djus okyk gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Apabila telah datang pertolongan Allah dan kemenangan.",
                            "verse 110:2": "Dan kamu lihat manusia masuk agama Allah dengan berbondong-bondong,",
                            "verse 110:3": "maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Quando verrà l'ausilio di Allah e la vittoria,",
                            "verse 110:2": "e vedrai le genti entrare in massa nella religione di Allah,",
                            "verse 110:3": "glorifica il tuo Signore lodandoLo e chiediGli perdono: in verità Egli è Colui che accetta il pentimento."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "アッラーの援助と勝利が来て，",
                            "verse 110:2": "人びとが群れをなしてアッラーの教え（イスラーム）に入るのを見たら，",
                            "verse 110:3": "あなたの主の栄光を誉め称え，また御赦しを請え。本当にかれは，度々赦される御方である。 人びとが群れをなしてアッラーの教え（イスラーム）に入るのを見たら，"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "하나님의 도움으로 승리하는그때에",
                            "verse 110:2": "떼지어 하나님의 종교로 귀의하는 백성들을 그대는 보리니",
                            "verse 110:3": "주님을 찬미하고 주님께 관용을 구하라 실로 그분은 관용으로 충만하시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "کاتێ یارمه‌تی و کۆمه‌کی خوا دێت، شاری مه‌ککه ڕزگار ده‌کرێت و ده‌رگای ئازادی واڵا ده‌کرێت.",
                            "verse 110:2": "خه‌ڵکیشت بینی پۆل پۆل ده‌چنه ڕیزی ئاینی خواوه‌.",
                            "verse 110:3": "ئه‌وسا ئیتر تۆ سوپاس و ستایشی په‌روه‌ردگارت بکه و داوای لێ خۆش بوونی لێ بکه‌، چونکه به‌ڕاستی خوا زۆر چاوپۆشی ده‌کات و تۆبه وه‌رگره (."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Apabila datang pertolongan Allah dan kemenangan (semasa engkau wahai Muhammad berjaya menguasai negeri Mekah);",
                            "verse 110:2": "Dan engkau melihat manusia masuk dalam agama Allah beramai-ramai;",
                            "verse 110:3": "Maka ucapkanlah tasbih dengan memuji Tuhanmu dan mintalah ampun kepadaNya, sesungguhnya Dia amat menerima taubat."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "هنگامى كه يارى خدا و پيروزى فرارسد،",
                            "verse 110:2": "و ببينى مردم گروه گروه وارد دين خدا مى‏شوند،",
                            "verse 110:3": "پروردگارت را تسبيح و حمد كن و از او آمرزش بخواه كه او بسيار توبه‏پذير است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Quando te chegar o socorro de Deus e o triunfo,",
                            "verse 110:2": "E vires entrar a gente, em massa, na religião de Deus,",
                            "verse 110:3": "Celebra, então, os louvores do teu Senhor, e implora o Seu perdão, porque Ele é Remissório."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 110:1": "Când vine biruința lui Allah și cucerirea",
                            "verse 110:2": "Și-i vezi pe oameni intrând în religia lui Allah în cete ,",
                            "verse 110:3": "Atunci slãvește-L cu laudã pe Domnul tãu și roagã-L pe El de ier- tare, fiindcã El este Iertãtor [cu cel care se cãiește] !",
                            "verse 110:4": "!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 110:1": "Când va veni ajutorul lui Dumnezeu şi biruinţa",
                            "verse 110:2": "şi vei vedea oamenii intrând în Legea lui Dumnezeu cu cetele,",
                            "verse 110:3": "atunci preamăreşte-L pe Domnul tău cu laude, căci El este De-căinţă-primitorul! cetele,"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Когда Господня помощь ниспадетИ с ней победа",
                            "verse 110:2": "И на глазах твоих в религию АллахаВольются толпы праведных людей,",
                            "verse 110:3": "Восславь хвалой Владыку своегоИ испроси Его прощенья, —Поистине, Он отдающ и всепрощающ! людей,"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Cuando venga el auxilio de Alá, así como el éxito,",
                            "verse 110:2": "y veas que los hombres entran en masa en la religión de Alá,",
                            "verse 110:3": "entonces, ¡celebra las alabanzas de tu Señor y pide Su perdón! Es indulgente."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "அல்லாஹ்வுடைய உதவியும், வெற்றியும் வரும்போதும்,",
                            "verse 110:2": "மேலும், அல்லாஹ்வின் மார்க்கத்தில் மக்கள் அணியணியாகப் பிரவேசிப்பதை நீங்கள் காணும் போதும்,",
                            "verse 110:3": "உம்முடைய இறைவனின் புகழைக் கொண்டு (துதித்து) தஸ்பீஹு செய்வீராக, மேலும் அவனிடம் பிழை பொறுக்கத் தேடுவீராக - நிச்சயமாக அவன் \"தவ்பாவை\" (பாவமன்னிப்புக் கோருதலை) ஏற்றுக் கொள்பவனாக இருக்கின்றான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "เมื่อความช่วยเหลือของอัลลอฮ์ และการพิชิตได้มาถึงแล้ว",
                            "verse 110:2": "และเจ้าได้เห็นประชาชนเข้าในศาสนาของอัลลอฮ์เป็นหมู่ๆ",
                            "verse 110:3": "ดังนั้นจงแซ่ซ้องสดุดีด้วยการสรรเสริญพระเจ้าของเจ้า และจงขออภัยโทษต่อพระองค์เถิด แท้จริงพระองค์นั้นเป็นผู้ทรงอภัยโทษเสมอ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Allah'ın yardımı ve zaferi geldiği,",
                            "verse 110:2": "Ve insanların bölük bölük Allah'ın dinine girmekte olduklarını gördüğün vakit ,",
                            "verse 110:3": "Rabbine hamdederek O'nu tesbih et ve O'ndan mağfiret dile."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "جب خدا کی مدد آ پہنچی اور فتح (حاصل ہو گئی)",
                            "verse 110:2": "جب ا? کي مدد اور فتح آپہنچےo",
                            "verse 110:3": "اور آپ لوگوں کو ديکھ ليں (کہ) وہ ا? کے دين ميں جوق دَر جوق داخل ہو رہے ہيںo",
                            "verse 110:4": "اور تم نے دیکھ لیا کہ لوگ غول کے غول خدا کے دین میں داخل ہو رہے ہیں",
                            "verse 110:5": "تو اپنے پروردگار کی تعریف کے ساتھ تسبیح کرو اور اس سے مغفرت مانگو، بے شک وہ معاف کرنے والا ہے",
                            "verse 110:6": "تو آپ (تشکراً) اپنے رب کي حمد کے ساتھ تسبيح فرمائيں اور (تواضعاً) اس سے استغفار کريں، بيشک وہ بڑا ہي توبہ قبول فرمانے والا (اور مزيد رحمت کے ساتھ رجوع فرمانے والا) ہےo ہے"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 110:1": "Вақтики, Аллоҳнинг нусрати ва фатҳ келса.",
                            "verse 110:2": "Ва одамларнинг Аллоҳнинг динига тўп-тўп бўлиб кираётганини кўрсанг.",
                            "verse 110:3": "Бас,Роббингни поклаб ёд эт ва Унга истиғфор айт."
                        }
                    }
                }
            }
        }
    }
}