{
    "id": 110,
    "name_simple": "An-Nasr",
    "revelation_place": "madinah",
    "revelation_order": 114,
    "bismillah_pre": true,
    "verses_count": 3,
    "short_text": "The Surah takes its name from the word nasr occurring in the first verse.",
    "text": [
        "\n",
        "The Surah takes its name from the word nasr occurring in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Hadrat Abdullah bin Abbas states that this is the last Surah of the Quran to be revealed, i. e. no complete Surah was sent down to the Holy Prophet after it. (Muslim Nasai, Tabarani, Ibn Abi Shaibah, Ibn Marduyah).",
        "\n",
        "According to Hadrat Abdullah bin Umar, this Surah was sent down on the occasion of the Farewell Pilgrimage in the middle of the Tashriq Days at Mina, and after it the Holy Prophet rode his she camel and gave his well known Sermon. (Tirmidhi, Bazzar, Baihaqi, Ibn Abi Shaibah, Abd bin Humaid, Abn Yala, Ibn Marduyah). Baihaqi in Kitab al- Hajj has related from the tradition of Hadrat Sarra bint-Nabhan the Sermon which the Holy Prophet gave on this occasion. She says:",
        "\n",
        "\"At the Farewell Pilgrimage I heard the Holy Prophet say: O people, do you know what day it is? They said: Allah and His Messenger have the best knowledge. He said: This is the middle day of the Tashriq Days. Then he said: Do you know what place it is? They said: Allah and His Messenger have the best knowledge. He said: This is Masharil-Haram. Then he said: I do not know, I might not meet you here again. Beware, your bloods and your honors are forbidden, until you appear before your Lord, and He questions you about your deeds. Listen: let the one who is near convey it to him who is far away. Listen: have I conveyed the message to you? Then, when we returned to Madinah, the Holy Prophet passed away not many days after that.\"",
        "\n",
        "If both these traditions are read together, it appears that there was an interval of three months and some days between the revelation of Surah An-Nasr and the Holy Prophet's death, for historically the same was the interval between the Farewell Pilgrimage and the passing away of the Holy Prophet.",
        "\n",
        "Ibn Abbas says that when this Surah was revealed, the Holy Prophet said that he had been informed of his death and his time had approached. (Musnad Ahmad, Ibn Jarir, Ibn al-Mundhir, Ibn Marduyah). In the other traditions related from Hadrat Abdullah bin Abbas, it has been stated that at the revelation of this Surah the Holy Prophet understood that he had been informed of his departure from the world.(Musnad Ahmad, Ibn Jarir, Tabarani, Nasai, Ibn Abi Hatim, Ibn Marduyah).",
        "\n",
        "Mother of the Believers, Hadrat Umm Habibah, says that when this Surah was revealed the Holy Prophet said that he would leave the world that year. Hearing this Hadrat Fatimah wept. Thereat he said: \"From among my family you will be the first to join me.\" Hearing this she laughed.(Ibn Abi Hatim, Ibn Marduyah). A tradition containing almost the same theme has been related by Baihaqi from Ibn Abbas.",
        "\n",
        "Ibn Abbas says: \"Hadrat Umar used to invite me to sit in his assembly along with some of the important elderly Companions who had fought at Badr. This was not liked by some of them. They complained that they also had sons who were like the boy. Why then was he in particular invited to sit in the assembly? (Imam Bukhari and Ibn Jarir have pointed out that such a thing was said by Hadrat Abdur Rahman bin Auf).",
        "\n",
        "Hadrat Umar said that the boy enjoyed the position and distinction because of his knowledge. Then one day he invited the Companions of Badr and called me also to sit with them. I understood that he had invited me to the assembly to prove his contention. During the conversation Hadrat Umar asked the Companions of Badr: \"What do you say about Idha jaa nasrullahi wal- fath?\" Some said: \"In it we have been enjoined to praise Allah and ask for His forgiveness when His succor comes and we attain victory.\"Some others said that it implied the conquest of cities and forts. Some kept quiet. Then Hadrat Umar said: \"Ibn Abbas, do you also say the same?\"I said no. He asked: \"What then is your view?\"I submitted that it implied the last hour of Allah's Messenger (upon whom be peace); in it he was informed that when Allah's succor came and victory was attained, it would be a sign that his hour had come; therefore, he should praise Allah and ask for His forgiveness. Thereat Hadrat Umar\r\nsaid \"I know naught but what you have said.\"",
        "\n",
        "In another tradition there is the addition that, Hadrat Umar said to the Companions: \"How can you blame me when you yourselves have seen why I invite this boy to join the assembly?\" (Bukhari, Musnad Ahmad, Tirmidhi, Ibn Jarir, Ibn Marduyah, Baghawi, Baihaqi, Ibn al-Mundhir).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "As is shown by the above traditions, Allah in this Surah had informed His Messenger (upon whom be peace) that when Islam attained complete victory in Arabia and the people started entering Allah's religion in great numbers, it would mean that the mission for which he had been sent to the world, had been fulfilled. Then, he was enjoined to busy himself in praising and glorifying Allah by Whose bounty he had been able to accomplish such a great task, and should implore Him to forgive whatever failings and frailties he might have shown in the performance of the service. Here, by a little consideration one can easily see the great difference that there is between a Prophet and a common worldly leader. If a worldly leader in his own lifetime is able to bring about a revolution, which has the aim and objective of his struggle, this would be an occasion for exultation for him. But here we witness quite another phenomenon. The Messenger of Allah in a brief space of 23 years\r\nrevolutionized an entire nation as regards its beliefs, thoughts, customs, morals, civilization, ways of living, economy, politics and fighting ability, and raising it from ignorance and barbarism enabled it to conquer the world and become leader of nations; yet when he had accomplished this unique task, he was not enjoined to celebrate it but to glorify and praise Allah and to pray for His forgiveness, and he busied himself humbly the implementation of that command.",
        "\n",
        "Hadrat Aishah says: \"The Holy Messenger (upon whom be peace) often used to recite Subhanak-Allahumma wa bi-hamdika astaghfiruka wa atubu ilaika (according to some other traditions, Subhan Allahi wa bi hamdi-hi as- taghfirullaha wa atubu ilaihi) before his death. I asked: O Messenger of Allah, what are these words that you have started reciting now? He replied: A sign has been appointed for me so that when I see it, I should recite these words, and it is: Idha jaa nasrullahi wal-fathu.\" (Musnad Ahmad, Muslim, Ibn Jarir, lbn al-Mundhir, Ibn Marduyah).",
        "\n",
        "In some other traditions on the same subject Hadrat Aishah has reported that the Holy Prophet often recited the following words in his ruku and sajdah: Subhanak-Allahumma wa-bi hamdika, Allahumma- aghfirli. This was the interpretation of the Quran (i. e. of Surah An-Nasr) that he had made.(Bukhari, Muslim Abu Daud, Nasai, Ibn Majah, Ibn Jarir).",
        "\n",
        "Hadrat Umm Salamah says that the Holy Prophet (upon whom be peace) during his last days very often recited the following words sitting and standing, going out of the house and coming back to it: Subhan Allahi wa-bi hamdi-hi. I one day asked: \"Why do you recite these words so often? O Messenger of Allah\". He replied: I have been enjoined to do so. Then he recited this Surah.\" (Ibn Jarir).",
        "\n",
        "According to Hadrat Abdullah bin Masud, when this Surah was revealed, the Messenger of Allah (upon whom be peace) frequently began to recite the words Subhanak-Allahumma wa bi-hamdika, Allahumm-aghfirli, subhanaka Rabbana wa bi-hamdika, Allahumm-aghfirli, innaka anta at- Tawwab al-Ghafur.(Ibn Jarir, Musnad Ahmad, Ibn Abi Hatim).",
        "\n",
        "Ibn Abbas has stated that after the revelation of this Surah the Holy Messenger (upon whom be peace) began to labor so intensively and devotedly hard for the Hereafter as he had never done before.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that informs the Prophet Muḥammad that The Help of God is imminent in the liberation of Mecca from idolatry, in the throngs whose hearts God will open to Islam, and in the approach of his own passing to the mercy of God. It takes its name from verse 1, in which the phrase “naṣr Allah” (meaning “Allah’s help”) occurs.The surah is also known as: (Divine) Support, The Ultimate Victory.",
    "name_translation": "The Help",
    "name_complex": "An-Nasr",
    "surah_name_ar": "النصر",
    "verses": {
        "Albanian": {
            "verse 110:1": "Kur të arrijë ndihma e Zotit dhe fitorja,",
            "verse 110:2": "dhe i sheh njerëzit grupe-grupe duke hyrë në fenë e Perëndisë (në Islamizëm)",
            "verse 110:3": "atëherë lavdëroje Zotin tënd dhe kërko falje nga Ai; se Ai, me të vërtetë, është pranues i madh i pendimeve."
        },
        "Amharic": {
            "verse 110:1": "የአላህ እርዳታና (መካን) መክፈት በመጣ ጊዜ፤",
            "verse 110:2": "ሰዎችንም ጭፍሮች እየኾኑ፤ በአላህ ሃይማኖት ውስጥ ሲገቡ ባየህ ጊዜ፤",
            "verse 110:3": "ጌታህን ከማመስገን ጋር አጥራው፡፡ ምሕረትንም ለምነው፡፡ እርሱ ጸጸትን በጣም ተቀባይ ነውና፡፡"
        },
        "Arabic": {
            "verse 110:1": "ُحْتَفْلاَو ِهَّللا ُرْصَن َءاَج اَذِإ",
            "verse 110:2": "اًجاَوْفَأ ِهَّللا ِنيِد يِف َنوُلُخْدَي َساَّنلا َتْيَأَرَو",
            "verse 110:3": "اًباَّوَت َناَك ُهَّنِإ ۚ ُهْرِفْغَتْساَو َكِّبَر ِدْمَحِب ْحِّبَسَف"
        },
        "Azerbaijani": {
            "verse 110:1": "Allahın köməyi və qələbə gəldiyi zaman,",
            "verse 110:2": "insanların dəstə-dəstə Allahın dininə girdiklərini gördükdə",
            "verse 110:3": "həmd ilə Rəbbini təriflə və Ondan bağışlanmağını dilə. Həqiqətən, O, tövbələri qəbul edəndir!"
        },
        "Bengali": {
            "verse 110:1": "যখন আসবে আল্লাহর সাহায্য ও বিজয়",
            "verse 110:2": "এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন,",
            "verse 110:3": "তখন আপনি আপনার পালনকর্তার পবিত্রতা বর্ণনা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় তিনি ক্ষমাকারী।"
        },
        "Berber Amazigh": {
            "verse 110:1": "Ma iusa d l$elb n Öebbi, akked rrbeê.",
            "verse 110:2": "D$a twalav imdanen keççmen ddin n Öebbi, d igrawen.",
            "verse 110:3": "Sbuccaâ s ccekôan Mass ik, ssuter aS ssmaê. Neppa Izga Issuruf."
        },
        "Bosnian": {
            "verse 110:1": "Kada Allahova pomoć i pobjeda dođu,",
            "verse 110:2": "i vidiš ljude kako u skupinama u Allahovu vjeru ulaze –",
            "verse 110:3": "ti veličaj Gospodara svoga hvaleći Ga i moli Ga da ti oprosti, On je uvijek pokajanje primao."
        },
        "Bulgarian": {
            "verse 110:1": "Когато дойде подкрепата на Аллах и победата,",
            "verse 110:2": "и видиш хората да встъпват на тълпи в религията на Аллах,",
            "verse 110:3": "прославяй своя Господ с възхвала и Го моли за опрощение! Той винаги приема покаянието."
        },
        "Chinese": {
            "verse 110:1": "当真主的援助和胜利降临,",
            "verse 110:2": "而你看见众人成群结队地崇奉真主的宗教时,",
            "verse 110:3": "你应当赞颂你的主超绝万物, 并且向他求饶, 他确是至宥的。"
        },
        "Danish": {
            "verse 110:1": "Als de hulp van Allah en overwinning komt",
            "verse 110:2": "En gij de mensen groepsgewijze ziet binnentreden tot Allah`s godsdienst",
            "verse 110:3": "Roem dan uw Heer met de lof, die Hem toekomt en vraag vergiffenis van Hem; voorzeker Hij is Berouwaanvaardend"
        },
        "Dutch": {
            "verse 110:1": "Als de hulp van Allah en de overwinning zijn gekomen.",
            "verse 110:2": "En jij (O Mohammed) de mensen in grote groepen tot de godsdienst van Allah ziet toetreden.",
            "verse 110:3": "Prijs dan de Glorie van jouw Heer en vraag Hem om vergeving. Voorwaar, Hij is Berouwaanvaardend."
        },
        "English": {
            "verse 110:1": "When the victory of Allah has come and the conquest,",
            "verse 110:2": "And you see the people entering into the religion of Allah in multitudes,",
            "verse 110:3": "Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance."
        },
        "Filipino": {
            "verse 110:1": "At nang dumatal (sa iyo, o Muhammad) ang kalinga ni Allah at tagumpay (laban sa iyong kaaway)",
            "verse 110:2": "At iyong napagmamasdan ang mga Tao na nagsisipasok sa Pananampalataya ni Allah (Islam) nang maramihan",
            "verse 110:3": "Kaya’t ipagbunyi mo ang mga Papuri sa iyong Panginoon at manalangin na igawad Niya ang Kanyang Kapatawaran. Siya ang tumatanggap ng pagsisisi at nagpapatawad"
        },
        "French": {
            "verse 110:1": "Lorsque vient le secours d'Allah ainsi que la victoire,",
            "verse 110:2": "et que tu vois les gens entrer en foule dans la religion d'Allah,",
            "verse 110:3": "alors, par la louange, célèbre la gloire de ton Seigneur et implore Son pardon. Car c'est Lui le grand Accueillant au repentir."
        },
        "Fulah": {
            "verse 110:1": "Si balllal Alla e udditde Makka ngarii",
            "verse 110:2": "Nji*a yimɓe na naata e diine Alla he dente dente",
            "verse 110:3": "Subhina e yettudede jom Ma njaafanaɗaa Mbo pellet ko O jaɓoowo tuubaabuya sanne"
        },
        "German": {
            "verse 110:1": "Wenn Allahs Hilfe kommt und der Sieg",
            "verse 110:2": "und du die Menschen in Allahs Religion in Scharen eintreten siehst,",
            "verse 110:3": "dann lobpreise deinen Herrn und bitte Ihn um Vergebung; gewiß, Er ist Reueannehmend."
        },
        "Hausa": {
            "verse 110:1": "Idan taimakon Allah ya zo da cin nasara.",
            "verse 110:2": "Kuma ka ga mutane suna shiga addinin Allah, ƙungiya-ƙungiya.",
            "verse 110:3": "To, ka yi tasbihi game da gõde wa Ubangijinka, kuma ka nẽme Shi gafara, lalle Shi (Ubangijinka) Ya kasance Mai karɓar tũba ne."
        },
        "Hindi": {
            "verse 110:1": "ऐ रसूल जब ख़ुदा की मदद आ पहँचेगी",
            "verse 110:2": "और फतेह (मक्का) हो जाएगी और तुम लोगों को देखोगे कि गोल के गोल ख़ुदा के दीन में दाख़िल हो रहे हैं",
            "verse 110:3": "तो तुम अपने परवरदिगार की तारीफ़ के साथ तसबीह करना और उसी से मग़फेरत की दुआ माँगना वह बेशक बड़ा माफ़ करने वाला है"
        },
        "Indonesian": {
            "verse 110:1": "Apabila telah datang pertolongan Allah dan kemenangan,",
            "verse 110:2": "dan kamu lihat manusia masuk agama Allah dengan berbondong-bondong,",
            "verse 110:3": "maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya. Sesungguhnya Dia adalah Maha Penerima taubat."
        },
        "Italian": {
            "verse 110:1": "Quando verrà l’ausilio di Allah e la vittoria,",
            "verse 110:2": "e vedrai le genti entrare in massa nella religione di Allah,",
            "verse 110:3": "glorifica il tuo Signore lodandoLo e chiediGli perdono: in verità Egli è Colui che accetta il pentimento."
        },
        "Japanese": {
            "verse 110:1": "アッラーの援助と勝利が来て，",
            "verse 110:2": "人びとが群れをなしてアッラーの教え（イスラーム）に入るのを見たら，",
            "verse 110:3": "あなたの主の栄光を誉め称え，また御赦しを請え。本当にかれは，度々赦される御方である。"
        },
        "Jawa": {
            "verse 110:1": "Nalika pitulungane Allah lan kemenangan wis teka (karebute Mekkah)",
            "verse 110:2": "Sira deleng manungsa pathan - pathan padha mlebu Islam agamaning Allah",
            "verse 110:3": "Mulane sira nyebuta Maha suci kelawan muji ing Pangeranira. Serta nyuwuna pangapura ing Allah. Satenebe Allah iku kapareng banget ngapura dosa"
        },
        "Kazakh": {
            "verse 110:1": "Ей, Мұхаммед! Аллаһтың көмегі және жеңіс келген кезде",
            "verse 110:2": "әрі адамдардың Аллаһтың дініне топ-тобымен кіргенін көргеніңде",
            "verse 110:3": "Раббыңды мақтаулар айтып дәріпте және Одан кешірім тіле. Ол тәубені істеген күнәсіне шынайы өкініп, Оғанбойсұнуғақайтуды Қабыл етуші"
        },
        "Korean": {
            "verse 110:1": "하나님의 도움으로 승리하는그때에하나님의 도움으로 승리하는그때에",
            "verse 110:2": "떼지어 하나님의 종교로 귀의하는 백성들을 그대는 보리니떼지어 하나님의 종교로 귀의하는 백성들을 그대는 보리니",
            "verse 110:3": "주님을 찬미하고 주님께 관용을 구하라 실로 그분은 관용으로 충만하시니라주님을 찬미하고 주님께 관용을 구하라 실로 그분은 관용으로 충만하시니라"
        },
        "Kurdish": {
            "verse 110:1": "(Muhemmed!) gava arîkarya Yezdan hatibeکاتێ یارمه‌تی و کۆمه‌کی خوا دێت، شاری مه‌ککه ڕزگار ده‌کرێت و ده‌رگای ئازادی واڵا ده‌کرێت.",
            "verse 110:2": "te jî dît, ku meriv deste û deste dikebine ola Yezdanخه‌ڵکیشت بینی پۆل پۆل ده‌چنه ڕیزی ئاینی خواوه‌.",
            "verse 110:3": "Îdî tu bi pesindana Xuda yê xwe (perestî bike, ewî) ji kêmayan paqij bike û baxişandina xwe ji wî bixwaze.Loma bi rastî ewa (Xuda yê te) poşmanîyan pur litê dikeئه‌وسا ئیتر تۆ سوپاس و ستایشی په‌روه‌ردگارت بکه و داوای لێ خۆش بوونی لێ بکه‌، چونکه به‌ڕاستی خوا زۆر چاوپۆشی ده‌کات و تۆبه وه‌رگره (.. ئومێده له ئاینده‌یه‌کی نزیکدا، خوای باڵاده‌ست سه‌رکه‌وتنێک ببه‌خشێت، ئه‌و کاته ئیمانداران هه‌ست ده‌که‌ن ئه‌م سوره‌ته تازه دابه‌زیوه‌)."
        },
        "Kyrgyz": {
            "verse 110:1": "(О, Мухаммад, эгер сага) Аллаһтын жардамы жана жеңиши келсе",
            "verse 110:2": "жана адамдарды Аллаһтын динине топ-топ болуп кирип жатканын көрсөң",
            "verse 110:3": "Анда, Раббиңе хамд (мактоо) айтуу менен (Аны жаман-төмөн сыпаттардан) аруула жана күнөөлөрүңдү кечирүүсүн сура! Чынында, Ал тообаларды кабыл кылуучу"
        },
        "Malay": {
            "verse 110:1": "Apabila datang pertolongan Allah dan kemenangan (semasa engkau wahai Muhammad berjaya menguasai negeri Makkah), -",
            "verse 110:2": "Dan engkau melihat manusia masuk dalam ugama Allah beramai-ramai, -",
            "verse 110:3": "Maka ucapkanlah tasbih dengan memuji Tuhanmu dan mintalah ampun kepadaNya, sesungguhnya Dia amat menerima taubat."
        },
        "Malayalam": {
            "verse 110:1": "അല്ലാഹുവിന്റെ സഹായവും വിജയവും വന്നുകിട്ടിയാല്‍.",
            "verse 110:2": "ജനങ്ങള്‍ അല്ലാഹുവിന്റെ മതത്തില്‍ കൂട്ടംകൂട്ടമായി പ്രവേശിക്കുന്നത് നീ കാണുകയും ചെയ്താല്‍",
            "verse 110:3": "നിന്റെ രക്ഷിതാവിനെ സ്തുതിക്കുന്നതോടൊപ്പം നീ അവനെ പ്രകീര്‍ത്തിക്കുകയും, നീ അവനോട് പാപമോചനം തേടുകയും ചെയ്യുക. തീര്‍ച്ചയായും അവന്‍ പശ്ചാത്താപം സ്വീകരിക്കുന്നവനാകുന്നു."
        },
        "Norwegian": {
            "verse 110:1": "Når Guds hjelp kommer, og seieren,",
            "verse 110:2": "og du ser menneskene tre inn i Guds religion flokkevi",
            "verse 110:3": "lovpris da Herren, og be Ham om tilgivelse! Han er full av miskunn."
        },
        "Pashto": {
            "verse 110:1": "كله چې د الله مدد راشي او فتح",
            "verse 110:2": "او ته خلق ووینې چې د الله په دین كې ډلې ډلې داخلېږي",
            "verse 110:3": "نو ته پاكي بیانوه د خپل رب له ستاينې سره او له ده نه مغفرت غواړه، بېشكه دى تل ښه توبه قبلوونكى دى"
        },
        "Persian": {
            "verse 110:1": "چون يارى خدا و پيروزى فراز آيد،",
            "verse 110:2": "و مردم را ببينى كه فوج‌فوج به دين خدا درمى‌آيند،",
            "verse 110:3": "پس به ستايش پروردگارت تسبيح گوى و از او آمرزش بخواه، كه او توبه‌پذير است."
        },
        "Polish": {
            "verse 110:1": "Kiedy przychodzi pomoc Boga i zwycięstwo,",
            "verse 110:2": "Kiedy widzisz ludzi przystępujących tłumnie do religii Boga,",
            "verse 110:3": "Głoś chwałę twego Pana i proś go o przebaczenie! Zaprawdę, On jest ciągle przebaczający!"
        },
        "Portuguese": {
            "verse 110:1": "Quando te chegar o socorro de Deus e o triunfo,",
            "verse 110:2": "E vires entrar a gente, em massa, na religião de Deus,",
            "verse 110:3": "Celebra, então, os louvores do teu Senhor, e implora o Seu perdão, porque Ele é Remissório."
        },
        "Punjabi": {
            "verse 110:1": "ਜਦੋਂ ਅੱਲਾਹ ਦੀ ਮਦਦ ਆ ਗਈ ਅਤੇ ਜਿੱਤ (ਹੋ ਗਈ)।",
            "verse 110:2": "ਅਤੇ ਤੁਸੀਂ ਦੇਖੋਗੇ ਕਿ ਲੋਕ ਜਥਿਆਂ ਦੇ ਜੱਥੇ ਅੱਲਾਹ ਦੇ ਦੀਨ ਵਿਚ ਸ਼ਾਮਿਲ ਹੋ ਰਹੇ ਹਨ।",
            "verse 110:3": "ਤਾਂ ਆਪਣੇ ਰੱਬ ਦੀ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰੋ, ਉਸ ਦੀ ਪ੍ਰਸੰਸਾ ਦੇ ਨਾਲ ਅਤੇ ਉਸ ਤੋਂ ਮੁਆਫ਼ੀ ਮੰਗੋ। ਬੇਸ਼ੱਕ ਉਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਹੈ।"
        },
        "Roman english": {
            "verse 110:1": "Iza jaa-a nas rullahi walfath",
            "verse 110:2": "Wa ra-aitan naasa yadkhuloona fee deenil laahi afwajah",
            "verse 110:3": "Fa sab bih bihamdi rabbika was taghfir, innahu kaana tawwaaba"
        },
        "Russian": {
            "verse 110:1": "Когда Господня помощь ниспадет И с ней победа",
            "verse 110:2": "И на глазах твоих в религию Аллаха Вольются толпы праведных людей,",
            "verse 110:3": "Восславь хвалой Владыку своего И испроси Его прощенья, - Поистине, Он отдающ и всепрощающ!"
        },
        "Sindhi": {
            "verse 110:1": "جڏھن الله جي مدد ۽ سوڀ اچي،",
            "verse 110:2": "۽ ماڻھن کي الله جي دين ۾ ٽوليون ٽوليون ٿي گھڙندو ڏسين،",
            "verse 110:3": "تڏھن (تون) پنھنجي پالڻھار جي ساراھ سان گڏ پاڪائي بيان ڪر ۽ کانئس بخشش گھر. بيشڪ اُھو ٻاجھ سان موٽندو آھي."
        },
        "Sinhalese": {
            "verse 110:1": "අල්ලාහ්ගේ උපකාරය හා (මක්කා) ජයග්‍රහණය පැමිණි විට ද,",
            "verse 110:2": "තවද අල්ලාහ්ගේ දහමට ජනයා කණ්ඩායම් වශයෙන් පිවිසෙනු නුඹ දකින විට ද,",
            "verse 110:3": "නුඹ නුඹගේ පරමාධිපතිගේ ප්‍රශංසාව තුළින් ඔහු ව පිවිතුරු කරනු. තවද ඔහුගෙන් සමාව අයැද සිටිනු. නියත වශයෙන්ම ඔහු අතික්ෂමාශීලී ය."
        },
        "Somali": {
            "verse 110:1": "Markuu yimaaddo gargaarkii Eebe iyo Fatxiga (Furashada maka).",
            "verse 110:2": "Ood aragtid Dadkoo Diinta Eebe u soo gali Kooxo.",
            "verse 110:3": "U tasbiixso Eebe adoo ku mahadin Dambidhaafna waydiiso illen waa dambidhaaf badanee."
        },
        "Spanish": {
            "verse 110:1": "Cuando llegue la victoria de Allah y la conquista,",
            "verse 110:2": "y veas a la gente entrar por grupos en la adoración de Allah.",
            "verse 110:3": "Glorifica a tu Señor con Su alabanza y pídele perdón.Él siempre acepta a quien a Él se vuelve."
        },
        "Swahili": {
            "verse 110:1": "Itakapo kuja nusura ya Mwenyezi Mungu na ushindi,",
            "verse 110:2": "Na ukaona watu wanaingia katika Dini ya Mwenyezi Mungu kwa makundi,",
            "verse 110:3": "Zitakase sifa za Mola wako Mlezi, na umwombe msamaha; hakika Yeye ndiye anaye pokea toba."
        },
        "Swedish": {
            "verse 110:1": "DÅ GUDS hjälp kommer med segern,",
            "verse 110:2": "och du ser människorna i oräkneliga skaror flocka sig till Guds religion,",
            "verse 110:3": "lova och prisa då din Herres namn och sök Hans förlåtelse! Han är alltid beredd att ta emot den [uppriktigt] ångerfulles ånger."
        },
        "Tajik": {
            "verse 110:1": "Чун ёрии Худову пирӯзӣ ояд",
            "verse 110:2": "ва мардумро бубинӣ, ки гурӯҳ-гурӯҳ ба дини Худо медароянд,",
            "verse 110:3": "пас ба ситоиши Парвардигорат тасбеҳ гӯй ва аз Ӯ бахшоиш бихоҳ, ки Ӯ тавбапазир аст!"
        },
        "Tamil": {
            "verse 110:1": "அல்லாஹ்வுடைய உதவியும், வெற்றியும் வரும்போதும்,",
            "verse 110:2": "மேலும், அல்லாஹ்வின் மார்க்கத்தில் மக்கள் அணியணியாகப் பிரவேசிப்பதை நீங்கள் காணும் போதும்,",
            "verse 110:3": "உம்முடைய இறைவனின் புகழைக் கொண்டு (துதித்து) தஸ்பீஹு செய்வீராக, மேலும் அவனிடம் பிழை பொறுக்கத் தேடுவீராக - நிச்சயமாக அவன் \"தவ்பாவை\" (பாவமன்னிப்புக் கோருதலை) ஏற்றுக் கொள்பவனாக இருக்கின்றான்."
        },
        "Tatar": {
            "verse 110:1": "Әгәр Ислам диненә вә мөселманнарга Аллаһудан ярдәм килсә вә шәһәрләр хосусан Мәккә шәһәре кебек мөселманнар кулына үтсә,",
            "verse 110:2": "шул вакытта күрерсең кешеләрне, төркем-төркем булып Аллаһ дине Исламга керерләр.",
            "verse 110:3": "Раббың булган Аллаһуны һәр кимчелектән пакь дип белеп һәм мактап тәсбих әйт, намаз укы һәм Аңардан ярлыкауны телә, сора! Дөреслектә Ул тәүбәне кабул итеп гөнаһларны гафу кылучыдыр."
        },
        "Telugu": {
            "verse 110:1": "(ఓ ముహమ్మద్!) ఎప్పుడైతే అల్లాహ్ సహాయం వస్తుందో మరియు విజయం (లభిస్తుందో)",
            "verse 110:2": "మరియు నీవు ప్రజలను గుంపులు గుంపులుగా అల్లాహ్ ధర్మం (ఇస్లాం)లో ప్రవేశించడం చూస్తావో",
            "verse 110:3": "అప్పుడు నీవు నీ ప్రభువు స్తోత్రంతో పాటు ఆయన పవిత్రతను కొనియాడు మరియు ఆయన క్షమాభిక్షను అర్థించు. నిశ్చయంగా, ఆయనే పశ్చాత్తాపాన్ని అంగీకరించేవాడు"
        },
        "Thai": {
            "verse 110:1": "เมื่อความช่วยเหลือของอัลลอฮฺ และการพิชิตได้มาถึงแล้ว",
            "verse 110:2": "และเจ้าได้เห็นประชาชนเข้าในศาสนาของอัลลอฮฺเป็นหมู่ ๆ",
            "verse 110:3": "ดังนั้นจงแซ่ซ้องสดุดีด้วยการสรรเสริญพระเจ้าของเจ้า และจงขออภัยโทษต่อพระองค์เถิด แท้จริงพระองค์นั้นเป็นผู้ทรงอภัยโทษเสมอ"
        },
        "Turkish": {
            "verse 110:1": "Allah'ın yardımı ve zafer günü gelip, insanların Allah'ın dinine akın akın girdiklerini görünce, Rabbini överek tesbih et; O'ndan bağışlama dile, çünkü O, tevbeleri daima kabul edendir.",
            "verse 110:2": "Allah'ın yardımı ve zafer günü gelip, insanların Allah'ın dinine akın akın girdiklerini görünce, Rabbini överek tesbih et; O'ndan bağışlama dile, çünkü O, tevbeleri daima kabul edendir.",
            "verse 110:3": "Allah'ın yardımı ve zafer günü gelip, insanların Allah'ın dinine akın akın girdiklerini görünce, Rabbini överek tesbih et; O'ndan bağışlama dile, çünkü O, tevbeleri daima kabul edendir."
        },
        "Urdu": {
            "verse 110:1": "جب خدا کی مدد آ پہنچی اور فتح (حاصل ہو گئی)",
            "verse 110:2": "اور تم نے دیکھ لیا کہ لوگ غول کے غول خدا کے دین میں داخل ہو رہے ہیں",
            "verse 110:3": "تو اپنے پروردگار کی تعریف کے ساتھ تسبیح کرو اور اس سے مغفرت مانگو، بے شک وہ معاف کرنے والا ہے"
        },
        "Uyghur": {
            "verse 110:1": "اﷲ نىڭ ياردىمى ۋە غەلىبىسى كەلگەن ۋە اﷲ نىڭ دىنىغا كىشىلەرنىڭ توپ - توپ بولۇپ كىرگەنلىكىنى كۆرگىنىڭدە",
            "verse 110:2": "اﷲ نىڭ ياردىمى ۋە غەلىبىسى كەلگەن ۋە اﷲ نىڭ دىنىغا كىشىلەرنىڭ توپ - توپ بولۇپ كىرگەنلىكىنى كۆرگىنىڭدە،",
            "verse 110:3": "رەببىڭغا تەسبىھ ئېيتقىن، ھەمدى ئېيتقىن ۋە ئۇنىڭدىن مەغپىرەت تىلىگىن. اﷲ ھەقىقەتەن تەۋبىنى بەك قوبۇل قىلغۇچىدۇر"
        },
        "Uzbek": {
            "verse 110:1": "Вақтики, Аллоҳнинг нусрати ва фатҳ келса...",
            "verse 110:2": "Ва одамларнинг Аллоҳнинг динига тўп-тўп бўлиб кираётганини кўрсанг...",
            "verse 110:3": "Бас, Роббингни поклаб ёд эт ва Унга истиғфор айт. Албатта, У тавбаларни кўплаб қабул этувчидир."
        },
        "Vietnamese": {
            "verse 110:1": "Khi Allah ban cho thắng lợi (và Ngươi) chinh phục được (Makkah).",
            "verse 110:2": "Ngươi sẽ thấy thiên hạ từng đoàn, từng đoàn gia nhập tôn giáo của Allah.",
            "verse 110:3": "(Lúc đó), Ngươi hãy tán dương Thượng Đế của Ngươi và hãy xin Ngài tha thứ cho Ngươi. Quả thật, Ngài là Đấng Tha Thứ."
        },
        "Yoruba": {
            "verse 110:1": "Nigba ti aranse Allahu (lori ota esin) ati sisi ilu (Mokkah) ba sele",
            "verse 110:2": "ti o si ri awon eniyan ti won wonu esin Allahu nijonijo",
            "verse 110:3": "nitori naa, safomo pelu idupe fun Oluwa re. Ki o si toro aforijin lodo Re. Dajudaju O n je Olugba-ironupiwada"
        }
    }
}