{
    "id": 111,
    "name_simple": "Al-Masad",
    "revelation_place": "makkah",
    "revelation_order": 6,
    "bismillah_pre": true,
    "verses_count": 5,
    "short_text": "The Surah takes its name from the word Lahab in the first verse.",
    "text": [
        "\n",
        "The Surah takes its name from the word Lahab in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Although the commentators have not disputed its being a Makki Surah, yet it is difficult to determine in which phase of the life at Makkah precisely it was revealed. However, in view of Abu Lahab's role and conduct against the Holy Prophet's message of Truth, it can be assumed that it must have been revealed in the period when he had transgressed all limits in his mad hostility to him, and his attitude was becoming a serious obstruction in the progress of Islam. It may well have been revealed in the period when the Quraish had boycotted the Holy Prophet (upon whom be peace) together with the people of his clan and besieged them in Shi'b Abi Talib, and Abu Lahab was the only person to join with the enemies against his own relatives. The basis of this assumption is that Abu Lahab was the Holy Prophet's uncle, and public condemnation of the uncle by the tongue of the nephew could not be proper until the extreme excesses committed by the uncle had become visible to everyone. If the\r\nSurah had been revealed before this, in the very beginning, the people would have regarded it as morally discourteous that the nephew should so condemn the uncle.",
        "\n",
        "Background",
        "\n",
        "This is the only place in the Quran where a person from among the enemies of Islam has been condemned by name, whereas in Makkah as well as in Madinah, after the migration, there were many people who were in no way less inimical to Islam and the Prophet Muhammad (upon whom be Allah's peace and blessings) than Abu Lahab. The question is, what was the special trait of the character of this person, which became the basis of this condemnation by name? To understand that it is necessary that one should understand the Arabian society of that time and the role that Abu Lahab played in it.",
        "\n",
        "In ancient days since there prevailed chaos and confusion, bloodshed and plunder throughout Arabia, and the condition for centuries was that a person could have no guarantee of the protection of life, honor and property except with the help and support of his clansmen and blood relations, therefore silah rehmi (good treatment of the kindred) was esteemed most highly among the moral values of the Arabian society and breaking off of connections with the kindred was regarded as a great sin. Under, the influence of the same Arabian tradition when the Holy Prophet (upon whom be peace) began to preach the message of Islam, the other clans of Quraish and their chiefs resisted and opposed him tooth and nail, but the Bani Hashim and the Bani al-Muttalib (children of al-Muttalib, brother of Hashim) not only did not oppose him but continued to support him openly, although most of them had not yet believed in his Prophethood. The other clans of Quraish themselves regarded this\r\nsupport by the blood relations of the Holy Prophet as perfectly in accordance with the moral traditions of Arabia. That is why they never taunted the Bani Hashim and the Bani al-Muttalib in that they had abandoned their ancestral faith by supporting a person who was preaching a new faith. They knew and believed that they could in no case hand over an individual of their clan to his enemies, and their support and aid of a clansman was perfectly natural in the sight of the Quraish and the people of Arabia.",
        "\n",
        "This moral principle, which the Arabs even in the pre-Islamic days of ignorance, regarded as worthy of respect and inviolable was broken only by one man in his enmity of Islam, and that was Abu Lahab, son of Abdul Muttalib. He was an uncle of the Holy Prophet, whose father and he were sons of the same father. In Arabia, an uncle represented the father especially when the nephew was fatherless. The uncle was expected to look after the nephew as one of his own children. But this man in his hostility to Islam and love of kufr trampled all the Arab traditions under foot.",
        "\n",
        "The traditionists have related from Ibn Abbas with several chains of transmitters the tradition that when the Holy Prophet was commanded to present the message of Islam openly, and he was instructed in the Quran to warn first of all his nearest kinsfolk of the punishment of God, he ascended the Mount, Safa one morning and called out aloud: Ya sabahah (O, the calamity of the morning!). This alarm in Arabia was raised by the person who noticed early at dawn an enemy tribe advancing against his tribe. When the Holy Messenger made this call, the people inquired as to who had made the call. They were told that it was Muhammad (upon whom be Allah's peace). There the people of all the clans of Quraish rushed out. Everyone who could, came. He who could not, sent another one for himself. When the People had assembled, the Holy Messenger calling out each clan by name, viz. O Bani Hashim, O Bani Abdul Muttalib, O Bani Fihr, O Bani so and so, said: \"If I were to tell you that behind\r\nthe hill there was an enemy host ready to fall upon you, would you believe me?\" The people responded with one voice, saying that they never had so far experienced a lie from him. The Holy Prophet said: \"Then I warn you that you are heading for a torment.\" Thereupon, before anyone else could speak, Abu Lahab, the Holy Prophet's uncle, said: \"May you perish! Did you summon us for this?\"Another tradition adds that he picked up a stone to throw at the Holy Prophet. (Musnad Ahmad, Bukhari, Muslim, Tirmidhi, Ibn Jarir, and others).",
        "\n",
        "According to Ibn Zaid, one day Abu Lahab asked the Holy Prophet: \"If I were to accept your religion, what would I get?\" The Holy Prophet replied: \"You would get what the other believers would get.\" He said: \"Is there no preference or distinction for me?\" The Holy Prophet replied: \"What else do you want?\" Thereupon he said: \"May this religion perish in which I and all other people should be equal and alike!\" (Ibn Jarir).",
        "\n",
        "In Makkah Abu Lahab was the next door neighbor of the Holy Prophet. Their houses were separated by a wall. Besides him, Hakam bin As (Father of Marwan), Uqbah bin Abi Muait, Adi bin Hamra and Ibn al-Asda il-Hudhali also were his neighbors. These people did not allow him to have peace even in his own house. Sometimes when he was performing the Prayer, they would place the goat's stomach on him; sometimes when food was being cooked in the courtyard, they would throw filth at the cooking pot. The Holy Prophet would come out and say: \"O Bani Abdi Manaf, what kind of neighborliness is it?\"Abu Lahab's wife, Umm Jamil (Abu Sufyan's sister), had made it a practice to cast thorns at his door in the night so that when he or his children came out of the house at dawn, they should run thorns in the foot. (Baihaqi, Ibn Abi Hatim, Ibn Jarir, Ibn Asakir, Ibn Hisham).",
        "\n",
        "Before the proclamation of Prophethood, two of the Holy Prophet's daughters were married to two of Abu Lahab's sons, Utbah and Utaibah. After his call when the Holy Prophet began to invite the people to Islam, Abu Lahab said to both his sons:\"I would forbid myself seeing and meeting you until you divorced the daughters of Muhammad (upon whom be Allah's peace and blessings).\"So, both of them divorced their, wives. Utaibah in particular became so nasty in his spitefulness that one day he came before the Holy Prophet and said: \"I repudiate An-najmi idha hawa and Alladhi dana fatadalla \" and then he spat at him, but his spital did not fall on him. The Holy Prophet prayed: \"O God, subject him to the power of a dog from among Your dogs.\"Afterwards, Utaibah accompanied his father in his journey to Syria. During the journey the caravan halted at a place which, according to local people, was visited by wild beasts at night. Abu Lahab told his companions, the Quraish: \"Make full\r\narrangements for the protection of my son, for I fear the curse invoked by Muhammad (upon whom be Allah's peace) on him.\" Accordingly, the people made their camels sit all around Utaibah and went to sleep. At night a tiger came which crossed the circle of the camels and devoured Utaibah tearing him to pieces. (Ibn Abdul Barr: Al-Istiab ; Ibn Hajar: Al- Isabah; Abu Nuaim al-Isfahani: Dalail an-Nubuwwat ; As-Suhaili: Raud al-Unuf. Here there is a difference of opinion. Some reporters say that the divorce took place after the Holy Prophet's proclamation of Prophethood and some say that it took place after the revelation of Tabbat yada Abi Lahab. There is also a difference of opinion about whether Abu Lahab's this son was Utbah or Utaibah. But this much is confirmed that after the conquest of Makkah, Utbah embraced Islam and took the oath of allegiance at the Holy Prophet's hand. Therefore, the correct view is that it was Utaibah).",
        "\n",
        "Abu Lahab's wickedness can be judged from the fact that when after the death of the Holy Prophet's son Hadrat Qasim, his second son, Hadrat Abdullah, also died, this man instead of joining with his nephew in his bereavement, hastened to the Quraish chiefs joyfully to give them the news that Muhammad (upon whom be Allah's peace and blessings) had become childless that night. This we have already related in the commentary of Surah Al-Kauthar.",
        "\n",
        "Wherever the Holy Prophet went to preach his message of Islam, this man followed him and forbade the people to listen to him. Rabiah bin Abbad ad- Dill has related: \"I was a young boy when I accompanied my father to the face of Dhul-Majaz. There I saw the Holy Messenger (may peace be upon him) who was exhorting the people, saying: 'O people, say: there is no deity but Allah, you will attain success.' Following behind him I saw a man, who was telling the people, \\`This fellow is a liar: he has gone astray from his ancestral faith.' I asked; who is he? The people replied: He is his uncle, Abu Lahab.\" (Musnad Ahmad, Baihaqi).",
        "\n",
        "Another tradition from Hadrat Rabiah is to the effect; \"I saw that the Holy Prophet went to the halting place of each tribe and said: \\`O children of so and so, I have been appointed Allah's Messenger to you. I exhort you to worship only Allah and to associate none with Him. So, affirm faith in me and join me so that I may fulfill the mission for which I have been sent.' Following close behind him there was a man who was saying: \\`O children of so and so, he is leading you astray from Lat and Uzza and inviting you to the religion of error and innovation which he has brought. Do not at all listen to what he says and do not follow him.' I asked my father: who is he? He replied: he is his uncle, Abu Lahab.\" (Musnad Ahmad, Tabarani).",
        "\n",
        "Tariq bin Abdullah al-Muharibi's tradition is similar. He says: \"I saw in the fare of Dhul-Majaz that the Holy Messenger (upon whom be peace) was exhorting the people, saying: \\`O people, say La ilaha ill-Allah, you will attain success', and behind him there was a man who was casting stones at him, until his heels bled, and he was telling the people: 'Do not listen to him, he is a liar.' I asked the people who he was. They said he was his uncle, Abu Lahab.\" (Tirmidhi).",
        "\n",
        "In the 7th year of Prophethood, when all the clans of Quraish boycotted the Bani Hashim and the Bani al-Muttalib socially and economically, and both these clans remaining steadfast to the Holy Prophet's support, were besieged in Shib Abi Talib, Abu Lahab was the only person, who sided with the disbelieving Quraish against his own clan. This boycott continued for three years, so much so that the Bani Hashim and the Bani al-Muttalib began to starve. This, however, did not move Abu Lahab. When a trade caravan came to Makkah and a besieged person from Shib Abi Talib approached it to buy some article of food, Abu Lahab would shout out to the merchants to demand a forbidding price, telling them that he would make up for any loss that they incurred. Thus, they would demand exorbitant rates and the poor customer had to return empty handed to his starving children. Then Abu Lahab would purchase the same articles from them at the market rates. (Ibn Sa'd, Ibn Hisham).",
        "\n",
        "On account of these very misdeeds this man was condemned in this Surah by name, and there was a special need for it. When the Holy Prophet's own uncle followed and opposed him before the Arabs who came for hajj from outside Makkah, or gathered together in the fares held at different places, they regarded it as against the established traditions of Arabia that an uncle should run down his nephew without a reason, should pelt stones at him and bring false accusations against him publicly. They were, therefore, influenced by what Abu Lahab said and were involved in doubt about the Holy Prophet (upon whom be peace). But when this, Surah was revealed, and Abu Lahab, filled with rage, started uttering nonsense, the people realized that what he said in opposition to the Holy Prophet was not at all reliable, for he said all that in his mad hostility to his nephew.",
        "\n",
        "Besides, when his uncle was condemned by name, the people's expectation that the Holy Messenger (upon whom be peace) could treat some relative leniently in the matter of religion was frustrated for ever. When the Holy Messenger's own uncle was taken to task publicly the people understood that there was no room for preference or partiality in their faith. A non-relative could become a near and dear one if he believed, and a near relation a non-relative if he disbelieved. Thus, there is no place for the ties of blood in religion.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that mentions the Palm Fibre rope that in Hellfire shall be twisted around the neck of the wife of the Prophet’s uncle, who bitterly opposed Islam; for she took great pride in wearing an ostentatious necklace she became known for and would slip by night to strew thorns and prickly plants in the Prophet’s path to injure his feet. It takes its name from verse 5 in which the phrase “ḥablun min masad” (meaning “a rope of palm fibre”) occurs.The surah is also known as: Abu Lahab, Fibre, Perish, The Flame, The Palm-Fibre Rope.",
    "name_translation": "Palm Fibre",
    "name_complex": "Al-Masad",
    "surah_name_ar": "المسد",
    "verses": {
        "Albanian": {
            "verse 111:1": "Ju thafshin duart Ebu Lehebit, dhe iu thánë!",
            "verse 111:2": "Nuk i ka ndihmuar atij as pasuria, e as fitimet tjera.",
            "verse 111:3": "Ai, me siguri, do të hudhet në zjarrin flakërues,",
            "verse 111:4": "ashtu dhe gruaja e tij – dru-bartëse;",
            "verse 111:5": "në qafën e saj ka një litar të bërë prej fijeve (të palmës)."
        },
        "Amharic": {
            "verse 111:1": "የአቡ ለሀብ ሁለት እጆች ከሰሩ (ጠፉ፤ እርሱ) ከሰረም፡፡",
            "verse 111:2": "ከእርሱ ገንዘቡና ያም ያፈራው ሁሉ ምንም አልጠቀመውም፡፡",
            "verse 111:3": "የመንቀልቀል ባለቤት የኾነችን እሳት በእርግጥ ይገባል፡፡",
            "verse 111:4": "ሚስቱም (ትገባለች)፤ እንጨት ተሸካሚ ስትኾን፡፡",
            "verse 111:5": "በአንገትዋ ላይ ከጭረት የኾነ ገመድ ያለባት ስትኾን፡፡"
        },
        "Arabic": {
            "verse 111:1": "َّبَتَو ٍبَهَل يِبَأ اَدَي ْتَّبَت",
            "verse 111:2": "َبَسَك اَمَو ُهُلاَم ُهْنَع ٰىَنْغَأ اَم",
            "verse 111:3": "ٍبَهَل َتاَذ اًراَن ٰىَلْصَيَس",
            "verse 111:4": "ِبَطَحْلا َةَلاَّمَح ُهُتَأَرْماَو",
            "verse 111:5": "ٍدَسَّم نِّم ٌلْبَح اَهِديِج يِف"
        },
        "Azerbaijani": {
            "verse 111:1": "Əbu Ləhəbin əlləri qurusun, qurudu da!",
            "verse 111:2": "Nə var-dövləti, nə də qazandıqları onu qurtara bilməyəcək.",
            "verse 111:3": "O, alovlanan oda atılacaqdır.",
            "verse 111:4": "Onun odun şələsi daşıyan arvadı da.",
            "verse 111:5": "Arvadının boynunda xurma liflərindən kəndir olacaqdır."
        },
        "Bengali": {
            "verse 111:1": "আবু লাহাবের হস্তদ্বয় ধ্বংস হোক এবং ধ্বংস হোক সে নিজে,",
            "verse 111:2": "কোন কাজে আসেনি তার ধন-সম্পদ ও যা সে উপার্জন করেছে।",
            "verse 111:3": "সত্বরই সে প্রবেশ করবে লেলিহান অগ্নিতে",
            "verse 111:4": "এবং তার স্ত্রীও-যে ইন্ধন বহন করে,",
            "verse 111:5": "তার গলদেশে খর্জুরের রশি নিয়ে।"
        },
        "Berber Amazigh": {
            "verse 111:1": "A nnger ifassen n Abulahab, u a nnegr is!",
            "verse 111:2": "Iwumi yas wayla s, akked wayen ikseb?",
            "verse 111:3": "Ad iôe$ di tmessi m ujajiê,",
            "verse 111:4": "akked tmeîîut is, i ipbibbin as$aô,",
            "verse 111:5": "tamrart inzizen, $ef umgaôv is."
        },
        "Bosnian": {
            "verse 111:1": "Neka propadne Ebu Leheb, i propao je!",
            "verse 111:2": "Neće mu biti od koristi blago njegovo, a ni ono što je stekao,",
            "verse 111:3": "ući će on, sigurno, u vatru rasplamsalu,",
            "verse 111:4": "i žena njegova, koja spletkari;",
            "verse 111:5": "o vratu njenu biće uže od ličine usukane!"
        },
        "Bulgarian": {
            "verse 111:1": "Да се погубят двете ръце на Абу Лахаб! И той да се погуби!",
            "verse 111:2": "Не го избави неговият имот и онова, което е придобил.",
            "verse 111:3": "Ще гори в огън с пламъци той",
            "verse 111:4": "и жена му, носещата дърва.",
            "verse 111:5": "На шията й ще има въже от сплетени влакна."
        },
        "Chinese": {
            "verse 111:1": "愿焰父两手受伤！他必定受伤,",
            "verse 111:2": "他的财产, 和他所获得的, 将无裨于他,",
            "verse 111:3": "他将入有焰的烈火,",
            "verse 111:4": "他的担柴的妻子, 也将入烈火,",
            "verse 111:5": "她的颈上系著一条坚实的绳子。"
        },
        "Danish": {
            "verse 111:1": "De macht van Aboe Lahab en hijzelf zullen vergaan",
            "verse 111:2": "Zijn rijkdommen en daden zullen hem niet baten",
            "verse 111:3": "Weldra zal hij in een laaiend Vuur branden",
            "verse 111:4": "Ook zijn vrouw, de draagster van brandstof",
            "verse 111:5": "Om haar hals zal een koord van palmvezels hangen"
        },
        "Dutch": {
            "verse 111:1": "Vernietigd zijn de handen van Aboe Lahab en vernietigd is hij.",
            "verse 111:2": "Zijn bezit en wat hij voortbracht, baat hem niet.",
            "verse 111:3": "Hij zal een vuur van vlammen (de Hel) binnengaan.",
            "verse 111:4": "En ook zijn vrouw, aandraagster van brandhout.",
            "verse 111:5": "Om haar nek een touw van vezels."
        },
        "English": {
            "verse 111:1": "May the hands of Abu Lahab be ruined, and ruined is he.",
            "verse 111:2": "His wealth will not avail him or that which he gained.",
            "verse 111:3": "He will [enter to] burn in a Fire of [blazing] flame",
            "verse 111:4": "And his wife [as well] - the carrier of firewood.",
            "verse 111:5": "Around her neck is a rope of [twisted] fiber."
        },
        "Filipino": {
            "verse 111:1": "Maglaho ang mga kamay ni Abu Lahab (ang tiyuhin ng Propeta), ang Ama ng Apoy, maglaho siya",
            "verse 111:2": "Ang kanyang kayamanan at kanyang mga anak, (atbp.), ay walang magiging kapakinabangan sa kanya",
            "verse 111:3": "Hindi magtatagal, siya ay sisilaban sa Naglalagablab na Apoy",
            "verse 111:4": "Gayundin, ang kanyang asawa ay magdadala ng mga tuyong kahoy (mga tinik ng Sadan na kanyang iniuumang sa landas ng Propeta, o ang kanyang paninirang puri sa Propeta), bilang panggatong",
            "verse 111:5": "Sa kanyang leeg ay nakapulupot ang lubid ng Masad (mga himaymay ng palmera)"
        },
        "French": {
            "verse 111:1": "Que périssent les deux mains d'Abû-Lahab et que lui-même périsse.",
            "verse 111:2": "Sa fortune ne lui sert à rien, ni ce qu'il a acquis.",
            "verse 111:3": "Il sera brûlé dans un Feu plein de flammes,",
            "verse 111:4": "de même sa femme, la porteuse de bois,",
            "verse 111:5": "à son cou, une corde de fibres."
        },
        "Fulah": {
            "verse 111:1": "Halkiima juuɗe Abii lahab o halki",
            "verse 111:2": "Nafaani mbo jawdi makko e ko o faggiti",
            "verse 111:3": "Ma o naat e yiite waɗnge lewlewndu",
            "verse 111:4": "E debbo makko doondotooɗo leɗɗe",
            "verse 111:5": "o ɗeɗɗiroyte ka daande makko yoora ɓadoo"
        },
        "German": {
            "verse 111:1": "Zugrunde gehen sollen die Hände Abu Lahabs, und zugrunde gehen soll er (selbst)!",
            "verse 111:2": "Was nützt ihm sein Besitz und das, was er erworben hat?",
            "verse 111:3": "Er wird einem Feuer voller Flammen ausgesetzt sein",
            "verse 111:4": "und (auch) seine Frau, die Brennholzträgerin.",
            "verse 111:5": "Um ihrem Hals ist ein Strick aus Palmfasern."
        },
        "Hausa": {
            "verse 111:1": "Hannãye biyu na Abũlahabi sun halaka, kuma ya halaka.",
            "verse 111:2": "Dũkiyarsa ba ta tsare masa kõme ba, da abin da ya tãra.",
            "verse 111:3": "Zã ya shiga wuta mai hũruwa.",
            "verse 111:4": "Tãre da matarsa mai ɗaukar itacen (wuta).",
            "verse 111:5": "A cikin kyakkyãwan wuyanta akwai igiya ta kaba (Rãnar ¡iyãma)."
        },
        "Hindi": {
            "verse 111:1": "अबु लहब के हाथ टूट जाएँ और वह ख़ुद सत्यानास हो जाए",
            "verse 111:2": "(आख़िर) न उसका माल ही उसके हाथ आया और (न) उसने कमाया",
            "verse 111:3": "वह बहुत भड़कती हुई आग में दाख़िल होगा",
            "verse 111:4": "और उसकी जोरू भी जो सर पर ईंधन उठाए फिरती है",
            "verse 111:5": "और उसके गले में बटी हुई रस्सी बँधी है"
        },
        "Indonesian": {
            "verse 111:1": "Binasalah kedua tangan Abu Lahab dan sesungguhnya dia akan binasa.",
            "verse 111:2": "Tidaklah berfaedah kepadanya harta bendanya dan apa yang ia usahakan.",
            "verse 111:3": "Kelak dia akan masuk ke dalam api yang bergejolak.",
            "verse 111:4": "Dan (begitu pula) istrinya, pembawa kayu bakar.",
            "verse 111:5": "Yang di lehernya ada tali dari sabut."
        },
        "Italian": {
            "verse 111:1": "Periscano le mani di Abû Lahab, e perisca anche lui.",
            "verse 111:2": "Le sue ricchezze e i suoi figli non gli gioveranno.",
            "verse 111:3": "Sarà bruciato nel Fuoco ardente,",
            "verse 111:4": "assieme a sua moglie, la portatrice di legna,",
            "verse 111:5": "che avrà al collo una corda di fibre di palma."
        },
        "Japanese": {
            "verse 111:1": "アブー・ラハブの両手は滅び，かれも滅びてしまえ。",
            "verse 111:2": "かれの富も儲けた金も，かれのために役立ちはしない。",
            "verse 111:3": "やがてかれは，燃え盛る炎の業火の中で焼かれよう。",
            "verse 111:4": "かれの妻はその薪を運ぶ，",
            "verse 111:5": "首に棕櫚の荒縄かけて。"
        },
        "Jawa": {
            "verse 111:1": "Rusak tangane Abu Lahab loro pisan, lan saktemene dheweke bakal kapitunan",
            "verse 111:2": "Bandhane lan panggaweyane ora bisa murungake siksaning Allah",
            "verse 111:3": "Ing tembe dheweke kecemplung neraka murub",
            "verse 111:4": "Mankono uga rabine (Abu Lahab mau) gawa kayu eri",
            "verse 111:5": "Ing gulune ana kalunge arupa dhadung kang kukuh"
        },
        "Kazakh": {
            "verse 111:1": "Әбу Ләһабтың екі қолы құрысын әрі өзі де құрыды",
            "verse 111:2": "Оған дүниесі мен тапқандары пайда бермеді",
            "verse 111:3": "Ол жақында жалындаған отқа кіреді",
            "verse 111:4": "және отын көтеріп оның әйелі де",
            "verse 111:5": "Оның мойнында есілген арқан болады"
        },
        "Korean": {
            "verse 111:1": "아부라합의 손이 멸망하고 파멸 할 것이며아부라합의 손이 멸망하고 파멸 할 것이며",
            "verse 111:2": "그의 재물과 그가 얻은 것이 그에게 유익하지 못하니그의 재물과 그가 얻은 것이 그에게 유익하지 못하니",
            "verse 111:3": "그는 곧 타오르는 볼지옥에 이르게 될 것이라그는 곧 타오르는 볼지옥에 이르게 될 것이라",
            "verse 111:4": "그의 아내는 연료를 운반할 것이요그의 아내는 연료를 운반할 것이요",
            "verse 111:5": "그녀의 목에는 단단히 꼬인 동아줄이 감기리라그녀의 목에는 단단히 꼬인 동아줄이 감기리라"
        },
        "Kurdish": {
            "verse 111:1": "Her du destê Ebî Lehib şîl bibe, şixwa şîl bûye jîده‌سته‌کانی بشکێت ئه‌بو له‌هه‌بو ڕسوا بێت، ئاشکرایه که هه‌ر ڕاسوایش ده‌بێت و‎ (له‌ناو ده‌چێت).",
            "verse 111:2": "Mal û keda (Ebî Leheb) ewa (ji şapata Yezda) neda parisandinêماڵ و دارای و ئه‌و شتانه‌ی که به ده‌ستی هێناوه‌، فریای نه‌که‌وت.",
            "verse 111:3": "Di nêzîk da ewê li bal agirekî bi alev da bê avîtinêله ئاینده‌دا ده‌خرێته ناو ئاگرێکی بڵێسه‌داره‌وه‌.",
            "verse 111:4": "Û Jina wîye, ku êzinga dikişine jî (dikebe agir)هه‌روه‌ها ژنه‌که‌شی که هه‌میشه هه‌ڵگری کۆڵه داره و (ئازاری پێغه‌مبه‌ر ده‌دات).",
            "verse 111:5": "Di sitûyê (wê jinêkê da) kapekî li hev alyaî heyeهه‌میشه گوریسێکی چنراو له پوشی خورما له گه‌ردنیایه‌تی (له قیامه‌تیش دا زنجیری ئاسن ده‌کرێته گه‌ردنی)."
        },
        "Kyrgyz": {
            "verse 111:1": "Абу Лахабдын эки колу (өзү) куурап калсын! Куурап да калды",
            "verse 111:2": "Ага мал- дүйнөсү да, бала-чакасы да пайда берген жок",
            "verse 111:3": "Ал жакында алоолонгон Тозокко ташталат",
            "verse 111:4": "Ал эми (Пайгамбарга каршы доомат - ушак көтөрүп жүргөн) анын аялы болсо (наркы дүйнөдө) отун көтөргөн абалда",
            "verse 111:5": "Анын мойнунда (тозоктогу) курма дарагынын буласынан (эшилген) жип"
        },
        "Malay": {
            "verse 111:1": "Binasalah kedua-dua tangan Abu lahab, dan binasalah ia bersama!",
            "verse 111:2": "Hartanya dan segala yang diusahakannya, tidak dapat menolongnya.",
            "verse 111:3": "Ia akan menderita bakaran api neraka yang marak menjulang.",
            "verse 111:4": "Dan juga isterinya, seorang perempuan pemunggah kayu api. -",
            "verse 111:5": "Di lehernya sejenis tali, dari tali-tali yang dipintal."
        },
        "Malayalam": {
            "verse 111:1": "അബൂലഹബിന്‍റെ ഇരുകൈകളും നശിച്ചിരിക്കുന്നു. അവന്‍ നാശമടയുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 111:2": "അവന്‍റെ ധനമോ അവന്‍ സമ്പാദിച്ചുവെച്ചതോ അവനു ഉപകാരപ്പെട്ടില്ല.",
            "verse 111:3": "തീജ്വാലകളുള്ള നരകാഗ്നിയില്‍ അവന്‍ പ്രവേശിക്കുന്നതാണ്‌.",
            "verse 111:4": "വിറകുചുമട്ടുകാരിയായ അവന്‍റെ ഭാര്യയും.",
            "verse 111:5": "അവളുടെ കഴുത്തില്‍ ഈന്തപ്പനനാരുകൊണ്ടുള്ള ഒരു കയറുണ്ടായിരിക്കും."
        },
        "Norwegian": {
            "verse 111:1": "I undergangen med Abu Lahabs verk, i undergangen med ham!",
            "verse 111:2": "Hans rikdom og det han har tjent, hjelper ham ikke.",
            "verse 111:3": "Han skal havne i flammende ild,",
            "verse 111:4": "mens hans hustru, som bærer brennefang,",
            "verse 111:5": "har en snor av palmefibre rundt halsen!"
        },
        "Pashto": {
            "verse 111:1": "د ابو لهب دواړه لاسونه دې هلاك شي او دى هلاك شو",
            "verse 111:2": "د ده هېڅ په كار رانغى د ده مال او (نه) هغه څه چې ده ګټلي وو",
            "verse 111:3": "ژر ده چې دى به لمبې وهونكي اور ته داخل شي",
            "verse 111:4": "او د ده ښځه هم، (زه د دغې) د لرګو اوچتوونكې (مذمت كوم)",
            "verse 111:5": "د دې په غاړه كې د كجورې د پټ مضبوطه رسۍ ده"
        },
        "Persian": {
            "verse 111:1": "دستهاى ابولهب بريده باد و هلاك بر او.",
            "verse 111:2": "دارايى او و آنچه به دست آورده بود به حالش سود نكرد.",
            "verse 111:3": "زودا كه به آتشى شعله‌ور درافتد.",
            "verse 111:4": "و زنش هيزم‌كش است.",
            "verse 111:5": "و بر گردن ريسمانى از ليف خرما دارد."
        },
        "Polish": {
            "verse 111:1": "Niech zginą obie ręce Abu Lahaba i niech on sam zginie! -",
            "verse 111:2": "Nie zdadzą mu się na nic jego majątek i to, co zyskał.",
            "verse 111:3": "Będzie się palił w ogniu płomiennym,",
            "verse 111:4": "I jego żona - nosząca drzewo;",
            "verse 111:5": "Będzie ona mieć na szyi sznur z włókien palmy."
        },
        "Portuguese": {
            "verse 111:1": "Que pereça o poder de Abu Láhab e que ele pereça também!",
            "verse 111:2": "De nada lhe valerão os seus bens, nem tudo quanto lucrou.",
            "verse 111:3": "Entrará no fogo flamígero,",
            "verse 111:4": "Bem como a sua mulher, a portadora de lenha,",
            "verse 111:5": "Que levará ao pescoço uma corda de esparto."
        },
        "Punjabi": {
            "verse 111:1": "ਅਬੂ ਲਹਬ ਦੇ ਹੱਥ ਟੁੱਟ ਜਾਣ ਅਤੇ ਉਹ ਖ਼ਤਮ ਹੋ ਜਾਵੇ।",
            "verse 111:2": "ਨਾ ਉਸ ਦੀ ਜਾਇਦਾਦ ਉਸ ਦੇ ਕੰਮ ਆਈ ਅਤੇ ਨਾ ਉਹ ਜਿਹੜਾ ਉਸ ਨੇ ਕਮਾਇਆ।",
            "verse 111:3": "ਉਹ ਛੇਤੀ ਹੀ ਭਟਕਦੀ ਹੋਈ ਅੱਗ ਵਿਚ ਡਿੱਗੇਗਾ।",
            "verse 111:4": "ਉਸ ਦੀ ਪਤਨੀ ਵੀ ਜਿਹੜੀ ਸਿਰ ਤੇ ਬਾਲਣ ਚੁੱਕੀ ਫਿਰਦੀ ਹੈ।",
            "verse 111:5": "ਉਸ ਦੀ ਗਰਦਨ ਵਿਚ ਵੱਟੀ ਹੋਈ ਰੱਸੀ ਹੈ।"
        },
        "Roman english": {
            "verse 111:1": "Tab bat yadaa abee Lahabinw-wa tabb",
            "verse 111:2": "Maa aghna `anhu maaluhu wa ma kasab",
            "verse 111:3": "Sa yas laa naran zaata lahab",
            "verse 111:4": "Wam ra-atuh hamma latal-hatab",
            "verse 111:5": "Fee jeediha hab lum mim-masad"
        },
        "Russian": {
            "verse 111:1": "Проклятие рукам Абу Ляхаба! И сам он - будь он проклят!",
            "verse 111:2": "Ему богатство не поможет, Добро накопленное не спасет!",
            "verse 111:3": "Гореть ему во пламенном Огне!",
            "verse 111:4": "И будет проклята его жена - Носительница дров,",
            "verse 111:5": "Чью шею обовьет крученый жгут Из пальмовых волокон!"
        },
        "Sindhi": {
            "verse 111:1": "ابولھب جا ھٿ ڀڳا ۽ (پاڻ به) ھلاڪ ٿيو.",
            "verse 111:2": "سندس مال ۽ جيڪي ڪمايائين تنھن کانئس (الله جو عذاب) نه ٽاريو.",
            "verse 111:3": "ڇيئي واري باھ ۾ سگھو پوندو.",
            "verse 111:4": "۽ سندس زال به، جا ڪاٺين (جي) لَڏ کڻندڙ آھي.",
            "verse 111:5": "جنھن جي ڳچيءَ ۾ کاٻر جو نوڙ پيل آھي."
        },
        "Sinhalese": {
            "verse 111:1": "අබූ ලහබ්ගේ දෑත් විනාශ වේවා! ඔහු ද විනාශ වේවා!",
            "verse 111:2": "ඔහුගේ ධනය ද ඔහු ඉපැයූ දෑ ද ඔහුට ඵලක් ගෙන දුන්නේ නැත.",
            "verse 111:3": "මතුවට ඔහු අග්නි ජාලාවෙන් යුත් නිරයට පිවිස දැවෙනු ඇත.",
            "verse 111:4": "(ඔහු ද) දර උසුලන්නියක් වූ ඔහුගේ බිරිය ද (අග්නි ජාලාවෙන් යුත් නිරයට පිවිස දැවෙනු ඇත).",
            "verse 111:5": "ඇයගේ ගෙලෙහි ඉඳි කෙඳි වලින් ඇඹරූ කඹයකි."
        },
        "Somali": {
            "verse 111:1": "Waxaa khasaaray Gacmihii Abuulahab, halaagmayna.",
            "verse 111:2": "Waxna uma tarin Xoolihiisii iyo wuxuu kasbadayna.",
            "verse 111:3": "Wuxuuna gali Naar Olal leh.",
            "verse 111:4": "Haweenaydiisii Qoryaha xambaari jirtayna (waxay gali Naar).",
            "verse 111:5": "Luqunteedana waxaa la yeeli Xadhig Liif ah."
        },
        "Spanish": {
            "verse 111:1": "Que se pierdan las manos de Abu Lahab! Y perdido está.",
            "verse 111:2": "De nada le servirá su riqueza ni todo lo que ha adquirido.",
            "verse 111:3": "Se abrasará en un fuego inflamado.",
            "verse 111:4": "Y su mujer acarreará la leña.",
            "verse 111:5": "Llevando al cuello una soga de fibra."
        },
        "Swahili": {
            "verse 111:1": "Imeangamia mikono ya Abu Lahab, na yeye pia ameangamia.",
            "verse 111:2": "Hayatamfaa mali yake, wala alivyo vichuma.",
            "verse 111:3": "Atauingia Moto wenye mwako.",
            "verse 111:4": "Na mkewe, mchukuzi wa kuni,",
            "verse 111:5": "Shingoni mwake iko kamba iliyo sokotwa."
        },
        "Swedish": {
            "verse 111:1": "MÅTTE Abu Lahab förgås! Ja, måtte han [hel och hållen] förgås!",
            "verse 111:2": "Vad hjälper honom [nu] hans rikedomar och allt vad han har förvärvat",
            "verse 111:3": "Han skall brinna i en Eld som blossar högt,",
            "verse 111:4": "och hans hustru, alltid på språng med illvilligt skvaller och förtal,",
            "verse 111:5": "skall bära ett tvinnat rep om sin hals."
        },
        "Tajik": {
            "verse 111:1": "Дастҳои Абулаҳаб бурида бод ва ҳалок бар ӯ бод.",
            "verse 111:2": "Моли ӯ ва он чӣ ба даст оварда буд, ба ҳолаш суд накард.",
            "verse 111:3": "Ба зудӣ ба оташе шӯълавар дарояд",
            "verse 111:4": "ва занаш ҳезумкаш аст",
            "verse 111:5": "ва бар гардан ресмоне аз лифи (пӯсти) хурмо дорад."
        },
        "Tamil": {
            "verse 111:1": "அபூலஹபின் இரண்டு கைகளும் நாசமடைக, அவனும் நாசமாகட்டும்.",
            "verse 111:2": "அவனுடைய பொருளும், அவன் சம்பாதித்தவையும் அவனுக்குப் பயன்படவில்லை.",
            "verse 111:3": "விரைவில் அவன் கொழுந்து விட்டெரியும் நெருப்பில் புகுவான்.",
            "verse 111:4": "விறகு சுமப்பவளான அவனுடைய மனைவியோ,",
            "verse 111:5": "அவளுடைய கழுத்தில் முறுக்கேறிய ஈச்சங் கயிறுதான் (அதனால் அவளும் அழிவாள்)."
        },
        "Tatar": {
            "verse 111:1": "Әбү Ләһәбнең ике кулы корысын һәм һәлак булсын! Һәм һәлак тә булды! (Әбү Ләһәбнең исеме Габдул Ґәзи булып Габдул Мутталлибнең угълы, вә Мухәммәд г-мнең атасы белән бертуган кардәшедер. Мухәммәд г-мнең иң зур дошманы иде, үзе һәм хатыны һәрвакыт пәйгамбәргә һәм мөселманнарга зарар тидерергә тырыштылар).",
            "verse 111:2": "Аңа ґәзабтан котылырга малы һәм кәсеп иткән нәрсәләре һич файда бирмәде.",
            "verse 111:3": "Тиздән ул Әбү Ләһәб ялкынлы утка кереп янар.",
            "verse 111:4": "Дәхи хатыны да утка керер утын күтәргән хәлдә.",
            "verse 111:5": "Ул хатынның муенында хөрмә мунчаласыннан булган бау бардыр."
        },
        "Telugu": {
            "verse 111:1": "అబూ లహబ్ రెండు చేతులూ నశించుగాక మరియు అతడు కూడా నశించి పోవు గాక",
            "verse 111:2": "అతడి ధనం మరియు అతడి సంపాదన (సంతానం) అతడికి ఏ మాత్రం పనికి రావు",
            "verse 111:3": "అతడు ప్రజ్వలించే నరకాగ్నిలో కాల్చబడతాడు",
            "verse 111:4": "మరియు అతడి భార్య కూడా! కట్టెలు మోసే (చాడీలు చెప్పి కలహాలు రేకెత్తించే) స్త్రీ",
            "verse 111:5": "ఆమె మెడలో బాగా పేనిని ఖర్జూరపునార త్రాడు (మసద్) ఉంటుంది"
        },
        "Thai": {
            "verse 111:1": "มือทั้งสองของอะบีละฮับจงพินาศ และเขาก็พินาศแล้ว",
            "verse 111:2": "ทรัพย์สมบัติของเขา และสิ่งที่เขาได้ขวนขวายไว้นั้นมิได้อำนวยประโยชน์แก่เขาเลย",
            "verse 111:3": "เขาจะเข้าไปเผาไหม้ในนรกที่มีไฟลุกโชน",
            "verse 111:4": "ทั้งภริยาของเขาด้วย นางเป็นผู้แบกฟืน",
            "verse 111:5": "ที่คอของนางมีเชือกถักด้วยใยอินทผลัม"
        },
        "Turkish": {
            "verse 111:1": "Ebu Leheb'in elleri kurusun; kurudu da!",
            "verse 111:2": "Malı ve kazandığı kendisine fayda vermedi.",
            "verse 111:3": "Alevli ateşe yaslanacaktır.",
            "verse 111:4": "Karısı da, boynunda bir ip olduğu halde ona odun taşıyacaktır.",
            "verse 111:5": "Karısı da, boynunda bir ip olduğu halde ona odun taşıyacaktır."
        },
        "Urdu": {
            "verse 111:1": "ابولہب کے ہاتھ ٹوٹیں اور وہ ہلاک ہو",
            "verse 111:2": "نہ تو اس کا مال ہی اس کے کچھ کام آیا اور نہ وہ جو اس نے کمایا",
            "verse 111:3": "وہ جلد بھڑکتی ہوئی آگ میں داخل ہو گا",
            "verse 111:4": "اور اس کی جورو بھی جو ایندھن سر پر اٹھائے پھرتی ہے",
            "verse 111:5": "اس کے گلے میں مونج کی رسّی ہو گی"
        },
        "Uyghur": {
            "verse 111:1": "ئەبۇ لەھەبنىڭ ئىككى قولى قۇرۇپ كەتسۇن! (ئەمەلدە) قۇرۇپ كەتتى",
            "verse 111:2": "ئۇنىڭغا مال - مۈلكى ۋە ئېرىشكەن نەرسىلىرى ئەسقاتمىدى",
            "verse 111:3": "ئۇ لاۋۇلداپ تۇرغان ئوتقا (يەنى دوزاخقا) كىرىدۇ",
            "verse 111:4": "ئۇنىڭ ئوتۇن توشۇغۇچى (يەنى سۇخەنچى) خوتۇنىمۇ لاۋۇلداپ تۇرغان ئوتقا كىرىدۇ",
            "verse 111:5": "ئۇنىڭ بوينىدا مەھكەم ئېشىلگەن ئارغامچا بولىدۇ"
        },
        "Uzbek": {
            "verse 111:1": "Абу Лаҳабнинг икки қўли ҳалок бўлсин, ҳалок!",
            "verse 111:2": "Унга моли ва касб қилган нарсалари фойда бермади.",
            "verse 111:3": "У тезда чўғи қизиб турган ўтга киради.",
            "verse 111:4": "Ва унинг хотини, ўтин кўтарган аёл ҳам.",
            "verse 111:5": "У(аёл)нинг бўйнида эшилган арқон бор ҳолда."
        },
        "Vietnamese": {
            "verse 111:1": "Abu Lahab, hắn và đôi tay của hắn sẽ bị hủy diệt.",
            "verse 111:2": "Của cải, tiền tài và những gì hắn có được sẽ chẳng giúp ích gì cho hắn.",
            "verse 111:3": "Hắn sẽ bị thiêu đốt trong Lửa ngùn ngụt cháy.",
            "verse 111:4": "Và cả vợ của hắn, kẻ đã vác củi gai (cũng chung số phận với hắn).",
            "verse 111:5": "Cổ của ả ta sẽ bị thắt bởi sợi dây thừng được xe từ xơ."
        },
        "Yoruba": {
            "verse 111:1": "Owo Abu-Lahab mejeeji ti sofo. Oun naa si sofo",
            "verse 111:2": "Awon dukia re ati ohun ti o se nise (iyen, awon omo re) ko si nii ro o loro (nibi iya)",
            "verse 111:3": "O si maa wo inu Ina elejo fofo",
            "verse 111:4": "Ati iyawo re, alaaaru-igi-isepe elegun-un, (o maa wona)",
            "verse 111:5": "Igba-ope ponponran maa wa ni orun re (ninu Ina)"
        }
    }
}