{
    "id": 32,
    "name_simple": "As-Sajdah",
    "revelation_place": "makkah",
    "revelation_order": 75,
    "bismillah_pre": true,
    "verses_count": 30,
    "short_text": "The Surah has been entitled As-Sajdah after the theme of Sajdah (prostration) as expressed in verse 15.",
    "text": [
        "\n",
        "The Surah has been entitled As-Sajdah after the theme of Sajdah (prostration) as expressed in verse 15.",
        "\n",
        "Period of Revelation",
        "\n",
        "From the style of the Surah it appears that it was sent down during the middle Makkah period, more particularly in its initial stage, for one does not find in its background that severity of the persecution and tyranny which one finds in the Surahs sent down in the later stages.",
        "\n",
        "Theme and Topics",
        "\n",
        "The main theme of the Surah is to remove the doubts of the people concerning Tauhid, the Hereafter and the Prophethood, and to invite them to all these three realities. The disbelievers of Makkah, when they talked of the Holy Prophet in private, said to one another, \"This person is forging strange things sometimes he gives news of what will happen after death. He says: when you have become dust, you will be called to render your accounts, and there will be Hell and Heaven. Sometimes he says: these gods and goddesses and saints are nonentities: One God alone is the Deity. And sometimes he says: the discourses which I recite are not my own but Allah's Word. All these are strange things which he presents.\"The answer to these doubts and misgivings forms the theme and subject matter of this Surah.",
        "\n",
        "In this connection, the disbelievers have been told: \"Most certainly it is Allah's Word, which has been sent down in order to arouse a people who are sunk in heedlessness, being deprived of the bounties and blessings of Prophethood. How can you call it a fabrication when its having been sent dawn from Allah is manifest and self evident?\"",
        "\n",
        "Then, they have been asked, \"Use your common sense and judge for yourselves which of the things presented by the Quran is strange and novel?Look at the administration of the heavens and the earth: consider your own creation and structure. Don't these things testify to the teaching which this Prophet is presenting before you in the Quran? Does the system of the universe point to Tauhid or to shirk? When you consider this whole system and your own creation, does your intellect testify that the One Who has given you your present existence, will not be able to create you once again?\"",
        "\n",
        "Then a scene of the Hereafter has been depicted, the fruits of belief and the evil consequences of disbelief have been mentioned and the people exhorted to give up disbelief even before they meet their doom and accept the teaching of the Quran, which will be to their own advantage in the Hereafter.",
        "\n",
        "Then they have been told: It is Allah's supreme Mercy that He does not seize man immediately for his errors to punish him finally and decisively but warns him beforehand by afflicting him with small troubles and hardships and calamities and losses and strokes of misfortune so that he may wake up and take admonition.",
        "\n",
        "Then it is said: \"This is not the first and novel event of its kind that a Book has been sent down upon a man from God. Before this the Book had been sent upon Moses also, which you all know. There is nothing strange in this at which you should marvel. Be assured that this Book has come down from God, and note it well that the same will happen now as has already happened in the time of Moses. Leadership now will be bestowed only on those who will accept this Divine Book. Those who reject it shall be doomed to failure.\"",
        "\n",
        "Then the disbelievers of Makkah have been admonished to the effect:\"See the end of the doomed communities of the past by whose ruined habitations you pass during your trade journeys. Will you like to meet the same doom yourself? Do not be deluded by the apparent and superficial. Today you see that no one is listening to Muhammad (upon whom be Allah's peace) except a few young men and some slaves and poor men, and he is being made the target of curses and ugly remarks from every side. From this you have formed the wrong impression that his mission will fail. But this is only a deception of your eyes. Don't you see the phenomenon in your daily life that a land previously lying absolutely barren starts swelling with vegetation and plant life everywhere just by a single shower of the rain though before this no one could ever imagine that under the layers of its soil there lay hidden such treasures of greenery and herbage?\"",
        "\n",
        "In conclusion, the Holy Prophet has been addressed to the effect: \"These people mock at what you say and ask as to when you will attain this decisive victory. Tell them: when the time comes for the final judgment regarding you and us, believing then will not profit you at all. If you have to believe, believe now. But if you intend to await the final judgment, then await it as you please.\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The only surah beginning with the discrete Arabic letters Alif Lām Mīm that also contains a ayah which requires one who recites it to perform a Prostration of bowing down to the ground before God in worship at the mention of God’s revealed signs. It takes its name from verse 15 which mentions “prostration” (sajdah). The surah emphasized the truth of the Quran at the beginning, and the Prophet is urged at the end of the surah to pay no attention to the disbelievers who cannot see the significance of God’s signs.The surah is also known as: Bowing Down, Bowing down in Worship, The Adoration, Worship.",
    "name_translation": "Prostration",
    "name_complex": "As-Sajdah",
    "surah_name_ar": "السجدة",
    "verses": {
        "Albanian": {
            "verse 32:1": "Elif, Lám, Mîm.",
            "verse 32:2": "Shpallja e këtij Libri, për të cilin s’ka dyshim – është nga Zoti i gjithësisë,",
            "verse 32:3": "e ata thonë: “Ai (Muhammedi) e ka trilluar atë! Jo, ajo është e Vërteta nga Zoti yt – për ta paralajmëruar popullin, të cilit, para teje nuk i ka ardhur kurrfarë paralajmëruesi, që të shkojë në rrugë të drejtë.",
            "verse 32:4": "Perëndia është Ai që ka krijuar qiejt dhe Tokën dhe çdo gjë që gjendet në mes tyre, për gjashtë ditë (periudha kohore), dhe e ka mbizotëruar Gjithësinë (Arshin). Ju, nuk keni – pos Tij, ndihmës as ndërmjetësues; e vallë, a nuk po mendoni?",
            "verse 32:5": "Ai i udhëheq të gjitha gjërat, prej qiellit deri në Tokë, e atëherë kthehen tek Ai në ditën, gjatësia e së cilës është një mijë vjet sipas llogaritjes suaj (në këtë Botë).",
            "verse 32:6": "Ai është dijtës i gjërave të padukshme dhe të dukshme, i Plotëfuqishëm dhe Mëshirues,",
            "verse 32:7": "i cili e ka bërë të mirë çdo gjë që ka krijuar dhe ka filluar krijimin e njeriut prej balte,",
            "verse 32:8": "(e) pastaj, ka bërë që pasardhësit e tij të krijohen prej një rrjedhje të dobët të ujit (spermës),",
            "verse 32:9": "pastaj, e ka krijuar atë (njeriun) dhe i ka dhënë gjallëri, me frymëzimin e Tij. Ai ju ka dhënë të dëgjuarit, të pamurit dhe të menduarit, - e sa pak prej jush që jeni mirënjohës.",
            "verse 32:10": "Dhe ata thonë: “E, vallë, pasi të humbasim nën tokë, përsëri do të ngjallemi?” Dhe ata, nuk besojnë se do të takohen me Zotin e tyre.",
            "verse 32:11": "Thuaju: “Do t’jua merr shpirtin engjëlli i vdekjes, i cili është caktuar për ju, e pastaj do të ktheheni te Zoti juaj”.",
            "verse 32:12": "E, sikur t’i shohësh mëkatarët se si para Zotit të tyre kokëulur thonë: “O Zoti ynë, pamë dhe dëgjuam, andaj, kthena që të punojmë vepra të mira! Na, me të vërtetë, me ngulmëri besojmë!”",
            "verse 32:13": "E, sikur Ne të donim, do t’ia jepnim çdo personi udhëzimin e tij, por kjo është fjala Ime e vërtetë: “Me të vërtetë, do ta mbush xhehennemin me xhindë dhe njerëz bashkërisht!”",
            "verse 32:14": "E, shijoni (dënimin), ngase e keni harruar takimin e kësaj dite. Në të vërtetë, Ne ju kemi braktisur – dhe shijoni dënimin e përhershëm për atë që keni punuar.",
            "verse 32:15": "Ajetet Tona i besojnë vetëm ata të cilët kur të këshillohen me to, bijnë në sexhde, dhe të cilët, e madhërojnë Zotin e tyre duke iu falenderuar Atij, dhe të cilët, nuk bëhen mendjemëdhenj.",
            "verse 32:16": "Pjesët e trupit të tyre ngriten nga shtrati (për t’u falur); i luten Zotit të tyre duke druajtur dhe shpresuar, dhe japin (lëmoshë) nga ajo që u kemi dhënë Ne.",
            "verse 32:17": "Askush nuk di se çfarë gëzime të fshehta janë për ta – shpërblimi për atë që kanë punuar.",
            "verse 32:18": "Vallë! A është njësoj si besimtari si mëkatari? Jo, ata nuk janë të barabartë:",
            "verse 32:19": "ata që kanë besuar dhe punuar vepra të mira, për ta janë kopshtet e xhennetit Meëva – të përgatitur për atë që kanë punuar;",
            "verse 32:20": "e ata që kanë bërë keq, vendbanim i tyre është zjarri; sa herë që duan të dalin nga ai (zjarri), do të kthehen në të dhe do t’u thuhet: “Shijoni dënimin e zjarrit, të cilin e keni përgënjeshtruar!”",
            "verse 32:21": "Dhe Ne, do të bëjmë që të shijojnë dënimin e kësaj jete para (atij) dënimit të madh, për t’u penduar ata.",
            "verse 32:22": "Kush është zullumqar më i madh se ai, që është këshilluar me argumentet e Zotit të tij, e shmanget prej tyre? Na, me të vërtetë, do t’i dënojmë mëkatarët!",
            "verse 32:23": "Na, madje, ia kemi dhënë Librin Musait, dhe mos dysho në takimin me të, dhe e kemi bërë atë (Librin) udhërrëfyes për bijtë e Israelit.",
            "verse 32:24": "Na, prej tyre – kemi bërë udhëheqës, të cilët udhëzonin me urdhërat Tona, meqë ishin të durueshëm dhe besonin bindshëm në argumentet Tona.",
            "verse 32:25": "Me të vërtetë, Zoti yt, do t’i gjykojë në mes tyre Ditën e Kijametit, për atë që e kundërshtuan njëri-tjetrin.",
            "verse 32:26": "(Vallë)! A nuk u është e qartë atyre se sa popuj i kemi shkatërruar Ne para tyre; nëpër shtëpiat e të cilëve ecin? Me të vërtetë, në këto ka argumente, e ata nuk po dëgjojnë (këshillat).",
            "verse 32:27": "Vallë! A nuk shohin ata, që Ne, me të vërtetë e dërgojmë ujin në tokën e shkretëruar, e me të – nxjerrim të lashtat, me të cilat ushqehen shtazët e tyre dhe ata vetë, e ata madje nuk po shohin?!",
            "verse 32:28": "Dhe, ata thonë: “E, kur më fitorja (Dita e Kijametit), nëse thoni të vërtetën?”",
            "verse 32:29": "Thuaju (o Muhammed!): “Ditën e gjykimit, nuk do t’u bëjë dobi mohuesve besimi i tyre, e as që do t’u jepet afat”.",
            "verse 32:30": "Andaj, ti shmangu nga ata dhe prit, edhe ata, me të vërtetë, po presin!"
        },
        "Amharic": {
            "verse 32:1": "አ.ለ.መ (አሊፍ ላም ሚም)፡፡",
            "verse 32:2": "የመጽሐፉ መወረድ ጥርጥር የለበትም፡፡ ከዓለማት ጌታ ነው፡፡",
            "verse 32:3": "ይልቁንም «ቀጠፈው» ይላሉን? አይደለም፡፡ እርሱ ከጌታህ ዘንድ የሆነ እውነት ነው፡፡ በእርሱ ከአንተ በፊት ከአስፈራሪ (ነቢይ) ያልመጣባቸውን ሕዝቦች ልታስፈራራበት (ያወረደልህ ነው)፡፡ እነርሱ ሊምመሩ ይከጀላልና፡፡",
            "verse 32:4": "አላህ ያ ሰማያትንና ምድርን በመካከላቸውም ያለውን ሁሉ በስድስት ቀኖች ውስጥ የፈጠረ ከዚያም በዐርሹ ላይ (ስልጣኑ) የተደላደለ ነው፡፡ ከእርሱ ሌላ ለእናንተ ረዳትም አማላጅም ምንም የላችሁም፤ አትገሰጹምን?",
            "verse 32:5": "ነገሩን ሁሉ ከሰማይ ወደ ምድር ያዘጋጃል፡፡ ከዚያም ከምትቆጥሩት (ዘመን) ልኩ ሺህ ዓመት በሆነ ቀን ውስጥ ወደርሱ ይወጣል (ይመለሳል)፡፡",
            "verse 32:6": "ይህ (ይህንን የሠራው) ሩቁንም ቅርቡንም ሁሉ ዐዋቂው አሸናፊው፣ አዛኙ (ጌታ) ነው፡፡",
            "verse 32:7": "ያ የፈጠረውን ነገር ሁሉ ያሳመረው የሰውንም ፍጥረት ከጭቃ የጀመረው ነው፡፡",
            "verse 32:8": "ከዚያም ዘሮቹን ከተንጣለለ፣ ከደካማ ውሃ ያደረገ ነው፡፡",
            "verse 32:9": "ከዚያም (ቅርጹን) አስተካከለው፡፡ በእርሱ ውስጥም ከመንፈሱ ነፋበት፤ (ነፍስ ዘራበት)፡፡ ለእናንተም ጆሮዎችን፣ ዓይኖችንና ልቦችንም አደረገላችሁ፡፡ በጣም ጥቂትን ብቻ ታመሰግናላችሁ፡፡",
            "verse 32:10": "«በምድርም ውስጥ (በስብሰን) በጠፋን ጊዜ እኛ በአዲስ መፈጠር ውስጥ እንሆናለን?» አሉ፡፡ በእውነቱ እነርሱ በጌታቸው መገናኘት ከሓዲዎች ናቸው፡፡",
            "verse 32:11": "«በእናንተ የተወከለው መልአከ ሞት ይገድላችኋል፡፡ ከዚያም ወደ ጌታችሁ ትመለሳላችሁ» በላቸው፡፡",
            "verse 32:12": "አመጸኞችም በጌታቸው ዘንድ ራሶቻቸውን ያቀረቀሩ ሆነው «ጌታችን ሆይ! አየን፣ ሰማንም፡፡ መልካምን እንሠራለንና (ወደ ምድረ ዓለም) መልሰን፡፡ እኛ አረጋጋጮች ነን፡፡» (የሚሉ ሲሆኑ) ብታይ ኖሮ (አስደንጋጭን ነገር ታይ ነበር)፡፡",
            "verse 32:13": "በሻንም ኖሮ ነፍስን ሁሉ ቅንነቷን (እምነቷን) በሰጠናት ነበር፡፡ ግን ገሀነምን ከአጋንንትና ከሰዎች የተሰበሰቡ ሆነው በእርግጥ እሞላለሁ ማለት ቃሉ ከእኔ ተረጋግጧል፡፡",
            "verse 32:14": "ይህንንም ቀናችሁን መገናኘትን በመርሳታችሁ ምክንያት (ቅጣትን) ቅመሱ! እኛ ተውናችሁ፡፡ ትሠሩት በነበራችሁትም ጥፋት ዘውታሪን ቅጣት ቅመሱ (ይባላሉ)፡፡",
            "verse 32:15": "በአንቀጾቻችን የሚያምኑት እነዚያ በእርሷ በተገሰጹ ጊዜ ሰጋጆች ሆነው የሚወድቁትና እነርሱም የማይኮሩ ሆነው በጌታቸው ምስጋና (ተጎናጽፈው) የሚያወድሱት ብቻ ናቸው፡፡",
            "verse 32:16": "ጌታቸውን ለመፍራትና ለመከጀል የሚጠሩት ሆነው ጎኖቻቸው ከመጋደሚያ ስፍራዎች ይራራቃሉ፡፡ ከሰጠናቸውም (ጸጋ) ይለገሳሉ፡፡",
            "verse 32:17": "ይሠሩትም በነበሩት ለመመንዳት ከዓይኖች መርጊያ ለእነርሱ የተደበቀላቸውን (ጸጋ) ማንኛይቱም ነፍስ አታውቅም፡፡",
            "verse 32:18": "አማኝ የሆነ ሰው አመጸኛ እንደ ሆነ ሰው ነውን? አይስተካከሉም፡፡",
            "verse 32:19": "እነዚያ ያመኑና መልካሞችን የሰሩማ ለእነርሱ ይሠሩት በነበሩት ምክንያት መስተንግዶ ሲሆኑ መኖሪያ ገነቶች አሏቸው፡፡",
            "verse 32:20": "እነዚያ ያመጹትማ፤ መኖሪያቸው እሳት ናት፡፡ ከእርሷ መውጣትን በፈለጉ ቁጥር በእርሷ ውስጥ ይመለሳሉ፡፡ ለእነርሱም «ያንን በእርሱ ታስተባብሉበት የነበራችሁትን የእሳት ቅጣት ቅመሱ» ይባላሉ፡፡",
            "verse 32:21": "ይመለሱ ዘንድም ከትልቁ ቅጣት በፊት (በዚህ ዓለም) ከትንሹ ቅጣት በእርግጥ እናቀምሳቸዋለን፡፡",
            "verse 32:22": "በጌታውም አንቀጾች ከተገሰጸና ከዚያም ከተዋት ሰው ይበልጥ በደለኛ ማነው? (የለም)፤ እኛ ከተንኮለኞቹ ተበቃዮች ነን፡፡",
            "verse 32:23": "ሙሳንም መጽሐፍን በእርግጥ ሰጠነው፡፡ እርሱን ከመገናኘትህም በመጠራጠር ውስጥ አትሁን፡፡ ለእስራኤል ልጆችም መሪ አደረግነው፡፡",
            "verse 32:24": "በታገሱና በተዓምራቶቻችን የሚያረጋግጡ በሆኑም ጊዜ ከእነርሱ በትዕዛዛችን የሚመሩ መሪዎች አደረግን፡፡",
            "verse 32:25": "ጌታህ እርሱ በዚያ በእርሱ ይለያዩበት በነበሩት ነገር በትንሣኤ ቀን በመካከላቸው (በፍርድ) ይለያል፡፡",
            "verse 32:26": "ከክፍለ ዘመናት ሰዎች ብዙዎችን ያጠፋን መሆናችን በመኖሪያዎቻቸው የሚሄዱ ሲሆኑ \tለእነርሱ አልተገለፀላቸውምን? በዚህ ውስጥ ምልክቶች አሉት፤ አይሰሙምን?",
            "verse 32:27": "እኛ ውሃን ወደ ደረቅ ምድር የምንነዳ እንስሶቻቸውና ነፍሶቻቸው ከእርሱ የሚበሉለትንም አዝመራ በእርሱ የምናወጣ መኾናችንን አያዩምን? አይመለከቱምን?",
            "verse 32:28": "«ከእውነተኞችም እንደሆናችሁ ይህ ፍርድ መቼ ነው?» ይላሉ፡፡",
            "verse 32:29": "«በፍርድ ቀን እነዚያን የካዱትን ሰዎች እምነታቸው አይጠቅማቸውም፡፡ እነርሱም ጊዜን አይሰጡም፤» በላቸው፡፡",
            "verse 32:30": "እነርሱንም ተዋቸው፡፡ ተጠባበቅም፤ እነርሱ ተጠባባቂዎች ናቸውና፡፡"
        },
        "Arabic": {
            "verse 32:1": "ملا",
            "verse 32:2": "َنيِمَلاَعْلا ِّبَّر نِم ِهيِف َبْيَر اَل ِباَتِكْلا ُليِزنَت",
            "verse 32:3": "َنوُدَتْهَي ْمُهَّلَعَل َكِلْبَق نِّم ٍريِذَّن نِّم مُهاَتَأ اَّم اًمْوَق َرِذنُتِل َكِّبَّر نِم ُّقَحْلا َوُه ْلَب ۚ ُهاَرَتْفا َنوُلوُقَي ْمَأ",
            "verse 32:4": "َنوُرَّكَذَتَت اَلَفَأ ۚ ٍعيِفَش اَلَو ٍّيِلَو نِم ِهِنوُد نِّم مُكَل اَم ۖ ِشْرَعْلا ىَلَع ٰىَوَتْسا َّمُث ٍماَّيَأ ِةَّتِس يِف اَمُهَنْيَب اَمَو َضْرَأْلاَو ِتاَواَمَّسلا َقَلَخ يِذَّلا ُهَّللا",
            "verse 32:5": "َنوُّدُعَت اَّمِّم ٍةَنَس َفْلَأ ُهُراَدْقِم َناَك ٍمْوَي يِف ِهْيَلِإ ُجُرْعَي َّمُث ِضْرَأْلا ىَلِإ ِءاَمَّسلا َنِم َرْمَأْلا ُرِّبَدُي",
            "verse 32:6": "ُميِحَّرلا ُزيِزَعْلا ِةَداَهَّشلاَو ِبْيَغْلا ُمِلاَع َكِلَٰذ",
            "verse 32:7": "ٍنيِط نِم ِناَسنِإْلا َقْلَخ َأَدَبَو ۖ ُهَقَلَخ ٍءْيَش َّلُك َنَسْحَأ يِذَّلا",
            "verse 32:8": "ٍنيِهَّم ٍءاَّم نِّم ٍةَلاَلُس نِم ُهَلْسَن َلَعَج َّمُث",
            "verse 32:9": "َنوُرُكْشَت اَّم اًليِلَق ۚ َةَدِئْفَأْلاَو َراَصْبَأْلاَو َعْمَّسلا ُمُكَل َلَعَجَو ۖ ِهِحوُّر نِم ِهيِف َخَفَنَو ُهاَّوَس َّمُث",
            "verse 32:10": "(َنوُرِفاَك ْمِهِّبَر ِءاَقِلِب مُه ْلَب ۚ ٍديِدَج ٍقْلَخ يِفَل اَّنِإَأ ِضْرَأْلا يِف اَنْلَلَض اَذِإَأ اوُلاَقَو",
            "verse 32:11": "(َنوُعَجْرُت ْمُكِّبَر ٰىَلِإ َّمُث ْمُكِب َلِّكُو يِذَّلا ِتْوَمْلا ُكَلَّم مُكاَّفَوَتَي ْلُق ۞",
            "verse 32:12": "(َنوُنِقوُم اَّنِإ اًحِلاَص ْلَمْعَن اَنْعِجْراَف اَنْعِمَسَو اَنْرَصْبَأ اَنَّبَر ْمِهِّبَر َدنِع ْمِهِسوُءُر وُسِكاَن َنوُمِرْجُمْلا ِذِإ ٰىَرَت ْوَلَو",
            "verse 32:13": "(َنيِعَمْجَأ ِساَّنلاَو ِةَّنِجْلا َنِم َمَّنَهَج َّنَأَلْمَأَل يِّنِم ُلْوَقْلا َّقَح ْنِكَٰلَو اَهاَدُه ٍسْفَن َّلُك اَنْيَتآَل اَنْئِش ْوَلَو",
            "verse 32:14": "(َنوُلَمْعَت ْمُتنُك اَمِب ِدْلُخْلا َباَذَع اوُقوُذَو ۖ ْمُكاَنيِسَن اَّنِإ اَذَٰه ْمُكِمْوَي َءاَقِل ْمُتيِسَن اَمِب اوُقوُذَف",
            "verse 32:15": "(۩ َنوُرِبْكَتْسَي اَل ْمُهَو ْمِهِّبَر ِدْمَحِب اوُحَّبَسَو اًدَّجُس اوُّرَخ اَهِب اوُرِّكُذ اَذِإ َنيِذَّلا اَنِتاَيآِب ُنِمْؤُي اَمَّنِإ",
            "verse 32:16": "(َنوُقِفنُي ْمُهاَنْقَزَر اَّمِمَو اًعَمَطَو اًفْوَخ ْمُهَّبَر َنوُعْدَي ِعِجاَضَمْلا ِنَع ْمُهُبوُنُج ٰىَفاَجَتَت",
            "verse 32:17": "(َنوُلَمْعَي اوُناَك اَمِب ًءاَزَج ٍنُيْعَأ ِةَّرُق نِّم مُهَل َيِفْخُأ اَّم ٌسْفَن ُمَلْعَت اَلَف",
            "verse 32:18": "(َنوُوَتْسَي اَّل ۚ اًقِساَف َناَك نَمَك اًنِمْؤُم َناَك نَمَفَأ",
            "verse 32:19": "(َنوُلَمْعَي اوُناَك اَمِب اًلُزُن ٰىَوْأَمْلا ُتاَّنَج ْمُهَلَف ِتاَحِلاَّصلا اوُلِمَعَو اوُنَمآ َنيِذَّلا اَّمَأ",
            "verse 32:20": "(َنوُبِّذَكُت ِهِب مُتنُك يِذَّلا ِراَّنلا َباَذَع اوُقوُذ ْمُهَل َليِقَو اَهيِف اوُديِعُأ اَهْنِم اوُجُرْخَي نَأ اوُداَرَأ اَمَّلُك ۖ ُراَّنلا ُمُهاَوْأَمَف اوُقَسَف َنيِذَّلا اَّمَأَو",
            "verse 32:21": "(َنوُعِجْرَي ْمُهَّلَعَل ِرَبْكَأْلا ِباَذَعْلا َنوُد ٰىَنْدَأْلا ِباَذَعْلا َنِّم مُهَّنَقيِذُنَلَو",
            "verse 32:22": "(َنوُمِقَتنُم َنيِمِرْجُمْلا َنِم اَّنِإ ۚ اَهْنَع َضَرْعَأ َّمُث ِهِّبَر ِتاَيآِب َرِّكُذ نَّمِم ُمَلْظَأ ْنَمَو",
            "verse 32:23": "(َليِئاَرْسِإ يِنَبِّل ىًدُه ُهاَنْلَعَجَو ۖ ِهِئاَقِّل نِّم ٍةَيْرِم يِف نُكَت اَلَف َباَتِكْلا ىَسوُم اَنْيَتآ ْدَقَلَو",
            "verse 32:24": "(َنوُنِقوُي اَنِتاَيآِب اوُناَكَو ۖ اوُرَبَص اَّمَل اَنِرْمَأِب َنوُدْهَي ًةَّمِئَأ ْمُهْنِم اَنْلَعَجَو",
            "verse 32:25": "(َنوُفِلَتْخَي ِهيِف اوُناَك اَميِف ِةَماَيِقْلا َمْوَي ْمُهَنْيَب ُلِصْفَي َوُه َكَّبَر َّنِإ",
            "verse 32:26": "(َنوُعَمْسَي اَلَفَأ ۖ ٍتاَيآَل َكِلَٰذ يِف َّنِإ ۚ ْمِهِنِكاَسَم يِف َنوُشْمَي ِنوُرُقْلا َنِّم مِهِلْبَق نِم اَنْكَلْهَأ ْمَك ْمُهَل ِدْهَي ْمَلَوَأ",
            "verse 32:27": "(َنوُرِصْبُي اَلَفَأ ۖ ْمُهُسُفنَأَو ْمُهُماَعْنَأ ُهْنِم ُلُكْأَت اًعْرَز ِهِب ُجِرْخُنَف ِزُرُجْلا ِضْرَأْلا ىَلِإ َءاَمْلا ُقوُسَن اَّنَأ اْوَرَي ْمَلَوَأ",
            "verse 32:28": "(َنيِقِداَص ْمُتنُك نِإ ُحْتَفْلا اَذَٰه ٰىَتَم َنوُلوُقَيَو",
            "verse 32:29": "(َنوُرَظنُي ْمُه اَلَو ْمُهُناَميِإ اوُرَفَك َنيِذَّلا ُعَفنَي اَل ِحْتَفْلا َمْوَي ْلُق",
            "verse 32:30": "(َنوُرِظَتنُّم مُهَّنِإ ْرِظَتناَو ْمُهْنَع ْضِرْعَأَف"
        },
        "Azerbaijani": {
            "verse 32:1": "Əlif. Ləm. Mim.",
            "verse 32:2": "Şübhə yoxdur ki, bu Kitabı aləmlərin Rəbbi olan Allah nazil etmişdir.",
            "verse 32:3": "Yoxsa onlar: “Bunu özündən uydurmuşdur!”– deyirlər. Xeyr, o, Rəbbindən nazil olan bir haqdır ki, səndən öncə xəbərdar edən peyğəmbər gəlməmiş hər hansı bir xalqı xəbərdar edəsən. Bəlkə də, onlar doğru yola yönələlər.",
            "verse 32:4": "Göyləri, yeri və onların arasındakıları altı gündə yaradan, sonra da Ərşə ucalan Allahdır. Sizin Ondan başqa nə bir haminiz, nə də bir şəfaətçiniz vardır. Məgər düşünərək ibrət götürməyəcəksiniz?",
            "verse 32:5": "O, göydən yerə qədər olan bütün işləri idarə edir. Sonra da bu işlər sizin saydığınız illərdən min ilə bərabər olan bir gündə Ona doğru yüksəlir.",
            "verse 32:6": "Qeybi və aşkarı Bilən, Qüdrətli və Rəhmli olan Odur.",
            "verse 32:7": "Hansı ki, yaratdığı hər şeyi gözəl biçimdə yaratmış, insanı ilk olaraq palçıqdan xəlq etmiş,",
            "verse 32:8": "sonra onun nəslini bir damla dəyərsiz sudan əmələ gətirmiş,",
            "verse 32:9": "sonra onu düzəldib müəyyən şəklə salmış və ona Öz ruhundan üfürmüş, sizə qulaqlar, gözlər və ürək vermişdir. Siz necə də az şükür edirsiniz!",
            "verse 32:10": "Onlar deyirlər: “Biz torpağın içində yox olandan sonra yenidənmi yaradılacağıq?” Doğrusu, onlar öz Rəbbi ilə qarşılaşacaqlarını inkar edirlər.",
            "verse 32:11": "De: “Sizə müvəkkil olan ölüm mələyi canınızı alacaq, sonra da Rəbbinizə qaytarılacaqsınız!”",
            "verse 32:12": "Kaş ki, günahkarları öz Rəbbi qarşısında başlarını aşağı dikərək: “Ey Rəbbimiz! Biz gördük və eşitdik. Bizi geri qaytar ki, yaxşı işlər görək. Həqiqətən də, biz qətiyyətlə inandıq!”– deyəndə görəydin!",
            "verse 32:13": "Əgər Biz istəsəydik, hər kəsi doğru yola yönəldərdik. Lakin Mənim: “Cəhənnəmi mütləq bütün günahkar cin və insanlarla dolduracağam!” Sözüm yerinə yetəcək.",
            "verse 32:14": "Bu gününüzlə qarşılaşacağınızı unutduğunuza görə dadın əzabı! Doğrusu, Biz də sizi unutduq. Etdiyiniz əməllərə görə dadın əbədi əzabı!",
            "verse 32:15": "Ayələrimizə ancaq o kəslər iman gətirirlər ki, ayələrimiz onlara xatırlanarkən təkəbbür göstərmədən səcdəyə qapanır, Rəbbinə həmd-səna ilə təriflər deyirlər.",
            "verse 32:16": "Onlar gecə namazını qılmaq üçün böyürlərini yataqdan qaldırır, qorxu və ümid içində öz Rəbbinə yalvarır və onlara verdiyimiz ruzilərdən Allah yolunda xərcləyirlər.",
            "verse 32:17": "Etdikləri əməllərin mükafatı kimi onlar üçün gözlərinə sevinc gətirəcək nələr saxlandığını heç kəs bilmir.",
            "verse 32:18": "Məgər möminlə fasiq eynidirmi? Onlar eyni ola bilməzlər!",
            "verse 32:19": "İman gətirib əməlisaleh olanları etdikləri əməllərə görə Məva bağlarında əbədi ziyafət gözləyir.",
            "verse 32:20": "Fasiqlərə gəldikdə isə, onların sığınacağı yer od olacaqdır. Hər dəfə onlar oradan çıxmaq istədikdə yenidən ora qaytarılacaq və onlara: “Yalan saydığınız odun əzabını dadın!”– deyiləcəkdir.",
            "verse 32:21": "Ən böyük əzabdan əvvəl Biz onlara mütləq kiçik əzabdan (dünya əzabından) daddıracağıq ki, bəlkə doğru yola qayıtsınlar.",
            "verse 32:22": "Rəbbinin ayələri yadına salındıqdan sonra onlardan üz döndərən kəsdən daha zalım kim ola bilər? Şübhəsiz ki, Biz günahkarlardan intiqam alacağıq.",
            "verse 32:23": "Biz Musaya Kitab vermişdik. Sən onunla görüşəcəyinə şübhə etmə. Biz onu İsrail oğullarına doğru yol göstərən rəhbər etmişdik.",
            "verse 32:24": "Səbir etdiklərinə və ayələrimizə yəqinliklə inandıqlarına görə Biz əmrimizlə onlardan doğru yolu göstərən rəhbərlər təyin etmişdik.",
            "verse 32:25": "Həqiqətən, sənin Rəbbin ixtilafda olduqları məsələlər barəsində Qiyamət günü onların arasında hökm verəcəkdir.",
            "verse 32:26": "Yurdlarında gəzib-dolaşdıqları əvvəlki neçə-neçə nəsilləri məhv etməyimiz onları doğru yola gətirmədimi? Həqiqətən, bunda ibrətlər vardır. Məgər onlar qulaq asmırlar?",
            "verse 32:27": "Məgər onlar quru yerə su axıdıb onunla həm heyvanlarının, həm də özlərinin yedikləri nemətlər yetişdirdiyimizi görmürlər? Hələ də bunu görmürlər?",
            "verse 32:28": "Onlar: “Əgər doğru danışanlardansınızsa, deyin görək bu hökm nə vaxt olacaqdır?”– deyirlər.",
            "verse 32:29": "De: “Hökm günü kafirlərə imanları fayda verməyəcək və onlara möhlət də verilməyəcəkdir”.",
            "verse 32:30": "Artıq onlardan üz çevir və gözlə. Doğrusu, onlar da gözləyirlər."
        },
        "Bengali": {
            "verse 32:1": "আলিফ-লাম-মীম।",
            "verse 32:2": "এ কিতাবের অবতরণ বিশ্বপালনকর্তার নিকট থেকে এতে কোন সন্দেহ নেই।",
            "verse 32:3": "তারা কি বলে, এটা সে মিথ্যা রচনা করেছে? বরং এটা আপনার পালনকর্তার তরফ থেকে সত্য, যাতে আপনি এমন এক সম্প্রদায়কে সতর্ক করেন, যাদের কাছে আপনার পূর্বে কোন সতর্ককারী আসেনি। সম্ভবতঃ এরা সুপথ প্রাপ্ত হবে।",
            "verse 32:4": "আল্লাহ যিনি নভোমন্ডল, ভুমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু ছয় দিনে সৃষ্টি করেছেন, অতঃপর তিনি আরশে বিরাজমান হয়েছেন। তিনি ব্যতীত তোমাদের কোন অভিভাবক ও সুপারিশকারী নেই। এরপরও কি তোমরা বুঝবে না?",
            "verse 32:5": "তিনি আকাশ থেকে পৃথিবী পর্যন্ত সমস্ত কর্ম পরিচালনা করেন, অতঃপর তা তাঁর কাছে পৌছবে এমন এক দিনে, যার পরিমাণ তোমাদের গণনায় হাজার বছরের সমান।",
            "verse 32:6": "তিনিই দৃশ্য ও অদৃশ্যের জ্ঞানী, পরাক্রমশালী, পরম দয়ালু,",
            "verse 32:7": "যিনি তাঁর প্রত্যেকটি সৃষ্টিকে সুন্দর করেছেন এবং কাদামাটি থেকে মানব সৃষ্টির সূচনা করেছেন।",
            "verse 32:8": "অতঃপর তিনি তার বংশধর সৃষ্টি করেন তুচ্ছ পানির নির্যাস থেকে।",
            "verse 32:9": "অতঃপর তিনি তাকে সুষম করেন, তাতে রূহ সঞ্চার করেন এবং তোমাদেরকে দেন কর্ণ, চক্ষু ও অন্তঃকরণ। তোমরা সামান্যই কৃতজ্ঞতা প্রকাশ কর।",
            "verse 32:10": "তারা বলে, আমরা মৃত্তিকায় মিশ্রিত হয়ে গেলেও পুনরায় নতুন করে সৃজিত হব কি? বরং তারা তাদের পালনকর্তার সাক্ষাতকে অস্বীকার করে।",
            "verse 32:11": "বলুন, তোমাদের প্রাণ হরণের দায়িত্বে নিয়োজিত ফেরেশতা তোমাদের প্রাণ হরণ করবে। অতঃপর তোমরা তোমাদের পালনকর্তার কাছে প্রত্যাবর্তিত হবে।",
            "verse 32:12": "যদি আপনি দেখতেন যখন অপরাধীরা তাদের পালনকর্তার সামনে নতশির হয়ে বলবে, হে আমাদের পালনকর্তা, আমরা দেখলাম ও শ্রবণ করলাম। এখন আমাদেরকে পাঠিয়ে দিন, আমরা সৎকর্ম করব। আমরা দৃঢ়বিশ্বাসী হয়ে গেছি।",
            "verse 32:13": "আমি ইচ্ছা করলে প্রত্যেককে সঠিক দিক নির্দেশ দিতাম; কিন্তু আমার এ উক্তি অবধারিত সত্য যে, আমি জিন ও মানব সকলকে দিয়ে অবশ্যই জাহান্নাম পূর্ণ করব।",
            "verse 32:14": "অতএব এ দিবসকে ভূলে যাওয়ার কারণে তোমরা মজা আস্বাদন কর। আমিও তোমাদেরকে ভুলে গেলাম। তোমরা তোমাদের কৃতকর্মের কারণে স্থায়ী আযাব ভোগ কর।",
            "verse 32:15": "কেবল তারাই আমার আয়াতসমূহের প্রতি ঈমান আনে, যারা আয়াতসমূহ দ্বারা উপদেশপ্রাপ্ত হয়ে সেজদায় লুটিয়ে পড়ে এবং অহংকারমুক্ত হয়ে তাদের পালনকর্তার সপ্রশংস পবিত্রতা বর্ণনা করে।",
            "verse 32:16": "তাদের পার্শ্ব শয্যা থেকে আলাদা থাকে। তারা তাদের পালনকর্তাকে ডাকে ভয়ে ও আশায় এবং আমি তাদেরকে যে রিযিক দিয়েছি, তা থেকে ব্যয় করে।",
            "verse 32:17": "কেউ জানে না তার জন্যে কৃতকর্মের কি কি নয়ন-প্রীতিকর প্রতিদান লুক্কায়িত আছে।",
            "verse 32:18": "ঈমানদার ব্যক্তি কি অবাধ্যের অনুরূপ? তারা সমান নয়।",
            "verse 32:19": "যারা ঈমান আনে ও সৎকর্ম করে, তাদের জন্যে রয়েছে তাদের কৃতকর্মের আপ্যায়নস্বরূপ বসবাসের জান্নাত।",
            "verse 32:20": "পক্ষান্তরে যারা অবাধ্য হয়, তাদের ঠিকানা জাহান্নাম। যখনই তারা জাহান্নাম থেকে বের হতে চাইবে, তখনই তাদেরকে তথায় ফিরিয়ে দেয়া হবে এবং তাদেরকে বলা হবে, তোমরা জাহান্নামের যে আযাবকে মিথ্যা বলতে, তার স্বাদ আস্বাদন কর।",
            "verse 32:21": "গুরু শাস্তির পূর্বে আমি অবশ্যই তাদেরকে লঘু শাস্তি আস্বাদন করাব, যাতে তারা প্রত্যাবর্তন করে।",
            "verse 32:22": "যে ব্যক্তিকে তার পালনকর্তার আয়াতসমূহ দ্বারা উপদেশ দান করা হয়, অতঃপর সে তা থেকে মুখ ফিরিয়ে নেয়, তার চেয়ে যালেম আর কে? আমি অপরাধীদেরকে শাস্তি দেব।",
            "verse 32:23": "আমি মূসাকে কিতাব দিয়েছি, অতএব আপনি কোরআন প্রাপ্তির বিষয়ে কোন সন্দেহ করবেন না। আমি একে বনী ইসরাঈলের জন্যে পথ প্রদর্শক করেছিলাম।",
            "verse 32:24": "তারা সবর করত বিধায় আমি তাদের মধ্য থেকে নেতা মনোনীত করেছিলাম, যারা আমার আদেশে পথ প্রদর্শন করত। তারা আমার আয়াতসমূহে দৃঢ় বিশ্বাসী ছিল।",
            "verse 32:25": "তারা যে বিষয়ে মত বিরোধ করছে, আপনার পালনকর্তাই কেয়ামতের দিন সে বিষয়ে তাদের মধ্যে ফয়সালা দেবেন।",
            "verse 32:26": "এতে কি তাদের চোখ খোলেনি যে, আমি তাদের পূর্বে অনেক সম্প্রদায়কে ধ্বংস করেছি, যাদের বাড়ী-ঘরে এরা বিচরণ করে। অবশ্যই এতে নিদর্শনাবলী রয়েছে। তারা কি শোনে না?",
            "verse 32:27": "তারা কি লক্ষ্য করে না যে, আমি উষর ভূমিতে পানি প্রবাহিত করে শস্য উদগত করি, যা থেকে ভক্ষণ করে তাদের জন্তুরা এবং তারা কি দেখে না?",
            "verse 32:28": "তারা বলে তোমরা সত্যবাদী হলে বল; কবে হবে এই ফয়সালা?",
            "verse 32:29": "বলুন, ফয়সালার দিনে কাফেরদের ঈমান তাদের কোন কাজে আসবে না এবং তাদেরকে অবকাশ ও দেয়া হবে না।",
            "verse 32:30": "অতএব আপনি তাদের থেকে মুখ ফিরিয়ে নিন এবং অপেক্ষা করুন, তারাও অপেক্ষা করছে।"
        },
        "Berber Amazigh": {
            "verse 32:1": "Alm.",
            "verse 32:2": "Tarusi n Tezmamt, ur illi degs ccekk, s$uô Mass imavalen.",
            "verse 32:3": "Ne$ a d inin: \"isnulfa p id\". Xaîi, neppat, d tidep s$uô Mass ik, iwakken a pnedôev agdud u$uô ur d iusi ara uneddaô, uqbel ik, amar ad pwanhun.",
            "verse 32:4": "Öebbi i Ixelqen tamurt, igenwan, akked wayen illan garasen, di sdis wussan; sinna, Iâannec $ef usgeld. Ur tesâim, war Neppa, bab, ne$ amcafaâ. Day ula d tesmektayem ara?",
            "verse 32:5": "A d Iseyyi lameô seg igenni ar tmurt; sinna, ad iu$al $uôeS deg ibwass, lmudda s: agim iseggwasen, s leêsab nnwen.",
            "verse 32:6": "Akka, Umusnaw n wayen iffren, u n wayen ur neffir, Uzmir Ipêunun.",
            "verse 32:7": "I Iûûegmen akw ayen Ixleq. Inza d lxelq n umdan, si talaxt.",
            "verse 32:8": "Sinna, Issuffe$ ed tarwa s si l$ella, degs cwiî n waman.",
            "verse 32:9": "Sinna, Imesl it, Iûûuv degs, si ôôuê iS. Irra yawen timesliwt, iéôi, ul. Drus ay tesnemmirem.",
            "verse 32:10": "Nnan: \"ma nweddeô di tmurt, day a d nepwaxleq tikelt nniven\"? Xaîi, nekôen timlilit akked Mass nnsen.",
            "verse 32:11": "Ini: \"ad iddem ôôuê nnwen, lmelk n tmeppant i ippukelfen fellawen. Sinna, ar Mass nnwen a ppu$alem\".",
            "verse 32:12": "Lemmer a pwaliv ibe$wviyen, ad brun i iqweôôa nnsen, zdat Mass nnsen: \"a Mass nne$! Nwala, nesla; Err ane$ a nexdem ayen ilhan. S tidep, numen\".",
            "verse 32:13": "Lemmer i £ ihwi, yili Nefka, i yal ôôuê, nnhaya s. Maca, ad ivôu wayen Nni$: \"war ccekk, ad Acaôe$ Loahennama s leonun akked yimdanen, mejmulen\".",
            "verse 32:14": "Ihi, jeôôbet imi teppum a d temlilem d wass nnwen agi! Nekwni, ih, Neppu kwen. Jeôôbet aâaqeb, n lebda, ilmend n wayen txeddmem.",
            "verse 32:15": "I iumnen kan, s issekniyen nne£, d wid, mara ten id mmektin, ara weddin ad knun, ara isbucuâen Mass nnsen s ccekôan, nitni ur pzuxxun.",
            "verse 32:16": "Ppensaren d ibeôdiyen nnsen, seg imîeôêen, pnujun $eô Mass nnsen, s tugwdi d usirem. Seg wayen iten N$at, pseddiqen.",
            "verse 32:17": "Ur iéôi yiwen acu i sen Ffre$ n lfeôê. D arraz n wayen llan xeddmen.",
            "verse 32:18": "Win illan d lmumen, day am win illan d amed$ul? Ur aâdilen.",
            "verse 32:19": "Ihi, i wid iumnen, ixeddmen ayen ilhan, leonanat imôaêbiyen, ara zed$en, ilmend n wayen xeddmeùn.",
            "verse 32:20": "Wanag wid ide$wlen, di tmes ara zed$en. Yal tikelt ideg ara b$un a d ff$en segs, a ten rren $uôes, ad asen inin: \"jeôôbet aâaqeb n tmes i tnekkôem\".",
            "verse 32:21": "Ih, a Nessukk fellasen aâaqeb aqôib mavi, war aâaqeb abarar. Ahat a d u$alen s abrid.",
            "verse 32:22": "Anwa i idensen sennig n win iwumi d dekôen issekniyen n Mass is, iu$al iwexxeô asen? Ih, a d Nerr ppaô seg ibe$wviyen.",
            "verse 32:23": "Ni$ Nefka yas Tazmamt i Musa. Ur ppili di ccekk af temlilit yideS! Nerra p d nnhaya i At Isôail.",
            "verse 32:24": "Nesbedd, segsen, iselmaden; nnehun s lameô nne£, mi ûebôen, u llan pputebbten $ef issekniyen nne£.",
            "verse 32:25": "Ih, Mass ik, Neppa, ad Iêudd garasen, ass n tnekra, $ef wayen i$ef mgarraden.",
            "verse 32:26": "Day ur ten inha ara wayen Nesqucc isuta, uqbel nnsen? La leêêun $ef tnezdu$in nnsen. Deg waya, s tidep, issekniyen. Day ur sellen ara?",
            "verse 32:27": "Day ur zôin ara Neppawi aman s akal aquôan; Nessuffu$ ed, yissen, iâaqqayen; teppen, segsen, nitni akked lmal nnsen. Day ur pwalin ara?",
            "verse 32:28": "Qqaôen: \"melmi l$elb agi, ma tessawalem tidep\"?",
            "verse 32:29": "Ini: \"ass n l$elb, liman n wid ijehlen, ur ten infaâ; ur pganin\".",
            "verse 32:30": "Ihi, wexxeô asen, ggani. Nitni, s tidep, la pganin."
        },
        "Bosnian": {
            "verse 32:1": "Elif Lām Mīm.",
            "verse 32:2": "Knjigu objavljuje, u to nema sumnje, Gospodar svjetova,",
            "verse 32:3": "a oni govore: \"On je izmišlja!\" Ne, ona je istina od Gospodara tvoga da opominješ narod kojemu prije tebe nije došao niko da ga opominje, da bi išao Pravim putem.",
            "verse 32:4": "Allah je nebesa i Zemlju i ono što je između njih u šest vremenskih razdoblja stvorio, a onda svemirom zagospodario; vi, osim Njega, ni zaštitnika ni posrednika nemate, pa zašto se ne urazumite?",
            "verse 32:5": "On upravlja svima, od neba do Zemlje, a onda se sve to Njemu vraća u danu koji, prema vašem računanju vremena, hiljadu godina traje.",
            "verse 32:6": "To je Onaj koji zna i nevidljivi i vidljivi svijet, Silni i Milostivi,",
            "verse 32:7": "koji sve savršeno stvara, koji je prvog čovjeka stvorio od ilovače –",
            "verse 32:8": "a potomstvo njegovo stvara od kapi hude tekućine,",
            "verse 32:9": "zatim mu savršeno udove uobliči i život mu udahne – i On vam i sluh i vid i pameti daje – a kako vi malo zahvaljujete!",
            "verse 32:10": "Oni govore: \"Zar ćemo, kad nestanemo pod zemljom, ponovo stvoreni biti?\" Oni ne vjeruju da će pred Gospodara svoga izići.",
            "verse 32:11": "Reci: \"Melek smrti, koji vam je za to određen, duše će vam uzeti, a poslije ćete se Gospodaru svome vratiti.\"",
            "verse 32:12": "A da ti je vidjeti grješnike kako će, oborenih glava pred Gospodarom svojim, reći: \"Gospodaru naš, vidjeli smo i čuli smo, pa nas povrati da dobra djela činimo, mi, doista, čvrsto vjerujemo!\"",
            "verse 32:13": "A kad bismo htjeli, svakog čovjeka bismo na Pravi put uputili, ali Ja sam već istinu rekao: \"Napuniću, zaista, Džehennem džinima i ljudima zajedno!\"",
            "verse 32:14": "Pa trpite zato što ste zaboravljali da ćete ovaj dan doživjeti – i Mi ćemo vas zaboraviti – i vječnu patnju trpite zbog onoga što ste radili.",
            "verse 32:15": "U Naše riječi vjeruju samo oni koji, kad se njima opomenu, licem na tle padaju, i koji Gospodara svoga veličaju i hvale i koji se ne ohole.",
            "verse 32:16": "Bokovi njihovi se postelja lišavaju i oni se Gospodaru svome iz straha i želje klanjaju, a dio onog što im Mi dajemo udjeljuju.",
            "verse 32:17": "I niko ne zna kakve ih, kao nagrada za ono što su činili, skrivene radosti čekaju.",
            "verse 32:18": "Zar da vjerniku bude isto kao grješniku? Ne, njima neće biti isto:",
            "verse 32:19": "one koji su vjerovali i dobra djela činili čekaju džennetske bašče u kojima će boraviti, kao nagrada za ono što su radili;",
            "verse 32:20": "a one koji nisu vjerovali čeka vatra u kojoj će prebivati; kad god pokušaju iz nje izići, biće u nju vraćeni i biće im rečeno: \"Trpite kaznu u vatri koju ste poricali.\"",
            "verse 32:21": "I Mi ćemo učiniti da blažu kaznu iskuse, prije one najveće, ne bi li se pokajali.",
            "verse 32:22": "A ima li nepravednijeg od onoga koji, opomenut riječima Gospodara svoga, njima leđa okrene? Mi ćemo, zaista, kazniti zlikovce!",
            "verse 32:23": "Musau smo Mi Knjigu dali – ne sumnjaj nimalo u to da je on nije primio – i putokazom je sinovima Israilovim učinili.",
            "verse 32:24": "Između njih smo Mi vođe određivali i oni su, odazivajući se zapovijedi Našoj, na Pravi put upućivali, jer su strpljivi bili i u dokaze Naše čvrsto vjerovali.",
            "verse 32:25": "Gospodar tvoj će među njima na Sudnjem danu presuditi u onome oko čega su se razilazili.",
            "verse 32:26": "Zar ovima nije jasno koliko smo Mi prije njih naroda uništili, po čijim oni nastambama hodaju? To su, zaista, dokazi, pa zašto neće da čuju?",
            "verse 32:27": "Kako oni ne vide da Mi gonimo kišu u ogoljelu zemlju, i činimo da, uz pomoć njenu, niče rastinje kojim se hrani stoka njihova, a i oni sami – pa zašto neće da vide?!",
            "verse 32:28": "I oni govore: \"Kad će već jednom ta pobjeda, ako istinu govorite?\"",
            "verse 32:29": "Reci: \"Na Sudnjem danu, kada nevjernicima neće nikako koristiti to što će tada vjerovati i kad im se nimalo vremena neće dati.\"",
            "verse 32:30": "Zato se ti okreni od njih i čekaj, i oni doista čekaju!"
        },
        "Bulgarian": {
            "verse 32:1": "Алиф. Лам. Мим.",
            "verse 32:2": "Низпославането на Книгата - без съмнение в нея - е от Господа на световете.",
            "verse 32:3": "А [неверниците] казват: “Той я е измислил!” Не, тя е истината от твоя Господ, за да предупредиш народ, при който дотогава не е идвал друг предупредител, та да бъдат напътени.",
            "verse 32:4": "Аллах е, Който сътвори небесата и земята, и всичко между тях в шест дни. После се въздигна [безподобен] Той на Трона. Нямате освен Него друг покровител, нито застъпник. Не ще ли се поучите?",
            "verse 32:5": "Той управлява делата от небето до земята, после те се въздигат към Него в един Ден, колкото хиляда години, според вашето броене.",
            "verse 32:6": "Той е Знаещия и скритото, и явното, Всемогъщия, Милосърдния,",
            "verse 32:7": "Който сътвори със съвършенство всяко нещо и начена сътворяването на човека от глина.",
            "verse 32:8": "После Той сътвори потомството му от капка нищожна вода.",
            "verse 32:9": "После го осъразмери и му вдъхна от Своя дух. И стори за вас слуха и зрението, и сърцата. Колко малко сте признателни!",
            "verse 32:10": "И рекоха: “Нима след като изчезнем в земята, наистина ще бъдем сътворени отново?” Да, в срещата със своя Господ те не вярват.",
            "verse 32:11": "Кажи: “Ще ви прибере душите Ангелът на смъртта, комуто сте възложени. После към вашия Господ ще бъдете върнати.”",
            "verse 32:12": "Ако видиш как престъпниците свеждат глави пред своя Господ: “Господи наш, видяхме и чухме! Върни ни, за да сторим праведни дела! Ние вече сме убедени.”",
            "verse 32:13": "Ако пожелаехме, щяхме да дадем на всекиго неговото напътствие. Но ще се потвърди Словото Ми - ще напълня Ада с джинове и хора заедно.",
            "verse 32:14": "“Вкусете, защото забравихте срещата в този ваш Ден! Забравяме ви и Ние. Вкусете вечното мъчение заради онова, което сте извършили!”",
            "verse 32:15": "Вярват в Нашите знамения само онези, които щом им се спомене за тях, падат, свеждайки чела до земята в суджуд и прославят с възхвала своя Господ, и не се възгордяват.",
            "verse 32:16": "И напускат постелите си, и със страх и копнеж зоват своя Господ, и от онова, което сме им дали, раздават.",
            "verse 32:17": "Никой не знае каква радост за окото е скрита за тях - въздаяние за онова, което са вършили.",
            "verse 32:18": "Нима онзи, който вярва, е като онзи, който е нечестивец? Не са равни те.",
            "verse 32:19": "Които вярват и вършат праведни дела, техни са Градините на обителта - гостоприемство за онова, което са вършили.",
            "verse 32:20": "А които са нечестивци, мястото им е Огънят. Всякога, щом поискат да излязат от него, ще бъдат връщани там. И ще им се казва: “Вкусете мъчението на Огъня, който взимахте за лъжа!”",
            "verse 32:21": "И им даваме да вкусят от най-близкото мъчение преди най-голямото мъчение, за да се покаят.",
            "verse 32:22": "И кой е по-голям угнетител от онзи, комуто се напомнят знаменията на неговия Господ, а после той се отвръща от тях? Отмъщаваме Ние на престъпниците.",
            "verse 32:23": "И дадохме на Муса Писанието: “Не се съмнявай в срещата с Него!” И го сторихме напътствие за синовете на Исраил.",
            "verse 32:24": "И когато бяха търпеливи, и в Нашите знамения се бяха убедили, сторихме от тях водители, напътващи според Нашата повеля.",
            "verse 32:25": "В Деня на възкресението твоят Господ ще отсъди между тях за онова, по което бяха в разногласие.",
            "verse 32:26": "И нима на неверниците не им бе посочено колко поколения преди тях погубихме? [Сега] тези се движат в техните жилища. В това има знамения. Не ще ли се вслушат?",
            "verse 32:27": "И нима не виждат, че Ние насочваме водата към сухата земя, и сторваме с нея да поникнат насаждения, от които ядат те и техният добитък. Не ще ли прозрат?",
            "verse 32:28": "И казват: “Кога ще бъде това отсъждане, ако говорите истината?”",
            "verse 32:29": "Кажи: “За неверниците в Деня на отсъждането не ще е от полза, ако тогава повярват. И не ще им се даде отсрочка.”",
            "verse 32:30": "Отдръпни се от тях и чакай! И те ще чакат."
        },
        "Chinese": {
            "verse 32:1": ". 艾列弗，俩目，米目。",
            "verse 32:2": "（这）是从全世界的主降示的经典，其中毫无疑义。",
            "verse 32:3": "他们说：他捏造它吗？不然！它是从你的主降示的真理，以便你警告在你之前没有任何警告者来临过的一群民众，以便他们遵循正道。",
            "verse 32:4": "真主曾在六日内创造天地万物，然后，升上宝座，除他外，你们没有任何监护者和说情者。你们怎么不记念呢？",
            "verse 32:5": "他治理自天至地的事物，然后那事物在一日之内上升到他那里，那一日的长度，是你们所计算的一千年。",
            "verse 32:6": "那是全知幽明的、万能的、至慈的主。",
            "verse 32:7": "他精制他所创造的万物，他最初用泥土创造人。",
            "verse 32:8": "然后用贱水的精华创造他的子孙。",
            "verse 32:9": "然后使他健全，并将他的精神吹在他的身体中，又为你们创造耳目心灵。你们很少感谢。",
            "verse 32:10": "他们说：我们消失在地下之后，难道我们必定重新受造吗？不然！他们不信将与他们的主相会。",
            "verse 32:11": "你说：奉命主管你们的生命的死神，将使你们死亡，然后你们将被召归于你们的主。",
            "verse 32:12": "假若你得见犯罪者在他们的主那里垂头丧气地说：我们的主啊！我们已经看见了，听见了，求你让我们转回去，我们将做善事，我们确是确信者。假若你看见这种情状。",
            "verse 32:13": "假若我意欲，必以向导赋予每个人，但从我发出的判词已确定了，我必以精灵和人类一起填满火狱。",
            "verse 32:14": "你们尝试吧！因为你们忘记今日的相会，我确已忘记你们了。你们因为自己的行为而尝试永久的刑罚吧。",
            "verse 32:15": "信仰我的迹象的，只有那等人；别人以我的迹象劝戒他们的时候，他们便俯伏叩头并赞颂他们的那超绝万物的主，他们不敢妄自尊大，（此处叩头！）※",
            "verse 32:16": "他们肋不落床，他们以恐惧和希望的心情祈祷他们的主；他们分舍我所赐予他们的。",
            "verse 32:17": "任何人都不知道已为他们贮藏了什么慰藉，以报酬他们的行为。",
            "verse 32:18": "信道者与悖逆者一样吗？他们是不相等的。",
            "verse 32:19": "至于信道而且行善者，将来得以乐园为归宿，那是为了报酬他们的行为的。",
            "verse 32:20": ". 至于悖逆者，他们的归宿，只是火狱，每当他们要想逃出，都被拦回去。有声音对他们说：你们尝试以前你们所否认的火刑吧！",
            "verse 32:21": ". 在最大的刑罚之前，我必使他们尝试最近的刑罚，以便他们悔悟。",
            "verse 32:22": "有人以主的迹象劝戒他，而他不肯听从，这样的人，谁比他还不义呢？我必然要惩治犯罪的人。",
            "verse 32:23": "我确已把经典赏赐穆萨，所以你们对于接受经典，不要陷于犹豫中，我曾以那部经典为以色列后裔的向导。",
            "verse 32:24": "我曾以他们中的一部分人为表率，当他们忍受艰难，确信我的迹象的时候，奉我的命令去引导众人。",
            "verse 32:25": "复活日，你的主必定判决他们所争论的是非。",
            "verse 32:26": "难道他们还不晓得吗？在他们之前，我曾毁灭了许多世代，他们常常经过那些人的故乡，在那里确有许多迹象。他们怎么不听从呢？",
            "verse 32:27": "他们还不知道吗？我把雨水赶到无草的地方，而借它生出他们的牲畜和他们自己所食的庄稼。难道他们看不见吗？",
            "verse 32:28": "他们说：这种判决什么时候实现呢？如果你们是说实话的。",
            "verse 32:29": "你说：不信道者，在判决日，虽信无益，并且不获得宽待。",
            "verse 32:30": "你应当避开他们，你应当等待，他们必定是等待的。"
        },
        "Danish": {
            "verse 32:1": "Alif Laam Miem",
            "verse 32:2": "De openbaring van het Boek is zonder twijfel van de Heer der Werelden",
            "verse 32:3": "Zeggen zij: Hij heeft het verzonnen? Neen, het is de Waarheid van uw Heer, opdat gij een volk moogt waarschuwen onder hetwelk vóór u geen waarschuwer is geweest, opdat zij geleid mogen worden",
            "verse 32:4": "Allah is het, Die de hemelen en de aarde en hetgeen er tussen is in zes dagen schiep; daarna zette Hij Zich op de Troon. Gij hebt geen helper of bemiddelaar buiten Hem. Wilt gij dan geen lering (hieruit) trekken",
            "verse 32:5": "Hij ordent het bestel van de hemel tot de aarde, daarna zal deze tot Hem opstijgen in een dag, waarvan de duur naar uw berekening duizend jaar is",
            "verse 32:6": "Alzo is de Kenner van het onzichtbare en het zichtbare, de Almachtige, de Genadevolle",
            "verse 32:7": "Die de schepping van alles voltooide. En Hij begon de schepping van de mens uit klei",
            "verse 32:8": "Daarna maakte Hij zijn nageslacht uit een uittreksel van een nietige vloeistof",
            "verse 32:9": "Dan vormde Hij hem en ademde hem van Zijn geest in. En Hij gaf u oren, ogen en hart. Maar gij betoont weinig dankbaarheid",
            "verse 32:10": "En zij zeggen: Zullen wij, wanneer wij in de aarde verloren zijn, opnieuw worden geschapen? Neen, zij geloven niet in de ontmoeting met hun Heer",
            "verse 32:11": "Zeg: De doodsengel, aan wie gij toevertrouwd zijt, zal uw ziel nemen; dan zult gij tot uw Heer worden teruggebracht",
            "verse 32:12": "O, kondet gij het slechts zien wanneer de schuldigen hun hoofd zullen buigen voor hun Heer, zeggende: Onze Heer, wij hebben gezien en wij hebben gehoord, zend ons nu terug opdat wij goede werken mogen verrichten; voorzeker wij zijn thans overtuigd",
            "verse 32:13": "Indien Wij het wilden, zouden Wij aan elke ziel haar leiding kunnen geven, maar Mijn woord werd bewaarheid: Ik zal de hel met djinn en mensen allen tezamen vullen",
            "verse 32:14": "Ondergaat daarom (de straf) omdat gij de ontmoeting van deze Dag vergat. Voorzeker nu hebben Wij u vergeten. Ondergaat de duurzame straf voor hetgeen gij deedt",
            "verse 32:15": "Slechts zij geloven in Onze tekenen, die, wanneer zij er aan herinnerd worden, zich met het gelaat ter aarde werpen en hun Heer verheerlijken met de lof die Hem toekomt, en die niet hoogmoedig zijn",
            "verse 32:16": "Zij verwijderen zich van hun bed, hun Heer in vrees en hoop aanroepende en zij doen wel met hetgeen Wij hun hebben geschonken",
            "verse 32:17": "Maar niemand weet welke verkwikking der ogen voor hen verborgen is gehouden als beloning voor wat zij hebben gedaan",
            "verse 32:18": "Zou dan de gelovige gelijk zijn aan hem die ongehoorzaam is? Zij zijn (stellig) niet gelijk",
            "verse 32:19": "Zij, dje geloven en goede werken doen, zullen Tuinen hebben tot verblijf, als onthaal voor hetgeen zij deden",
            "verse 32:20": "Maar het tehuis v an de ongehoorzamen zal het Vuur zijn. Telkens wanneer zij er uit willen komen, zullen zij er weer in worden teruggedreven en hun zal worden gezegd: Ondergaat de straf van het Vuur die gij loochendet",
            "verse 32:21": "Wij zullen hen inderdaad de lichtere straf doen ondergaan vóór de grotere straf opdat zij zich mogen bekeren",
            "verse 32:22": "En wie is onrechtvaardiger dan hij die door het teken van zijn Heer wordt vermaand en zich er toch van afwendt? Wij zullen de schuldigen beslist straffen",
            "verse 32:23": "Voorzeker, Wij gaven Mozes het Boek - twijfel dus niet aan de ontmoeting met Hem - en Wij maakten dit tot een richtsnoer voor de kinderen van Israël",
            "verse 32:24": "En Wij stelden leiders uit hun midden aan, die het volk door Ons gebod leidden, zolang zij standvastig waren en in Onze woorden een hecht geloof hadden",
            "verse 32:25": "Voorwaar, uw Heer zal op de Dag der Opstanding onder hen richten over hetgeen waaromtrent zij onderling verschillen",
            "verse 32:26": "Komen zij niet tot inzicht (door het feit) dat Wij zovele geslachten vóór hen hebben vernietigd in wier woonplaatsen zij nu rondlopen? Daarin zijn zeker tekenen. Willen zij dan niet luisteren",
            "verse 32:27": "Hebben zij niet gezien dat Wij het water naar het droge land voeren en daardoor oogsten voortbrengen waarvan zij en hun vee eten? Willen zij dan niet inzien",
            "verse 32:28": "En zij (de ongelovigen) zeggen: Wanneer zal deze beslissing plaats vinden als gij de waarheid spreekt",
            "verse 32:29": "Zeg: Op de Dag der Beslissing zal het geloof der ongelovigen hen niet baten, noch zal hun uitstel worden verleend",
            "verse 32:30": "Wend u daarom van hen af, en wacht; voorzeker zij wachten ook"
        },
        "Dutch": {
            "verse 32:1": "Alif Lâm Mîm.",
            "verse 32:2": "De neerzending van het Boek waaraan geen twijfel is, is van de Heer der Werelden.",
            "verse 32:3": "Zij zeggen zelfs: \"Hij (Moehammad) heeft hem verzonnen.\" Nee! Het is de Waarheid van jouw Heer, zodat jij een volk waarschuwt tot wie vóór jou geen waarschuwer is gekomen. Hopelijk zulten zij Leiding volgen.",
            "verse 32:4": "Allah is Degene Die de hemelen en de aarde en wat tussen hen is heeft geschapen, in zes dagen (perioden), en Hij zetelde Zich op de Troon. Er is voor jullie buiten Allah geen beschermer en geen voorspreker. Laten jullie je dan niet vermanen?",
            "verse 32:5": "Hij regelt het bestuur vanuit de hemel naar de aarde, waarna die naar Hem opstijgt in een dag waarvan de tijdmaat duizend jaar is, zoals jullie rekenen.",
            "verse 32:6": "Dat is de Kenner van het onwaarneembare en het waarneembare, de Almachtige, de Meest Barmhartige.",
            "verse 32:7": "Degene Die alles wat Hij schiep op de beste manier heeft geschapen. En Hij begon de schepping van de mens uit klei.",
            "verse 32:8": "Daarna maakte Hij zijn nageslacht van een uittreksel van nederig water (sperma).",
            "verse 32:9": "Daarop voltooide Hij hem en blies in hem van de Ziel en Hij maakte voor jullie het gehoor en het gezichtsvermogen en de harten. Weinig dankbaarheid tonen jullie!",
            "verse 32:10": "En zij zeggen: \"Wanneer wij in de aarde zijn vergaan, zullen wij dan zeker tot een nieuwe schepping worden? Zij zijn zelfs ongelovig aan de ontmoeting met hun Heer.",
            "verse 32:11": "Zeg (O Moehammad): \"De Engel des doods die over jullie is aangesteld, zal jullie wegnemen. Vervolgens worden jullie tot jullie Heer teruggekeerd.\"",
            "verse 32:12": "En als jij het kon zien wanneer de zondaren hun hoofden buigen voor hun Heer (en zeggen:) \"Onze Heer, wij hebben gezien en gehoord, breng ons daarom terug, opdat wij goede werken verrichten. Voorwaar, wij zijn overtuigd.\"",
            "verse 32:13": "En als Wij wilden, dan zouden Wij zeker iedere ziel haar Leiding geven, maar het Woord is door Mij bepaald: \"Ik zal de Hel zeker vullen met Djinn's en mensen, allemaal\"",
            "verse 32:14": "Proeft dan (de bestraffing), omdat jullie ie de ontmoeting van deze Dag van jullie vergaten. Voorwaar, Wij hebben jullie vergeten. En proeft de eeuwige bestraffing vanwege wat jullie plachten te doen.\"",
            "verse 32:15": "Voorwaar, gelovig aan Onze Verzen zijn slechts degenen die, wanneer zij ermee vemaand worden, zich neerbuigen, en die de Glorie van hun Heer prijzen met Zijn lofprijzing. En zij zijn niet hoogmoedig.",
            "verse 32:16": "Hun zijden mijden de slaapplaatsen, zij roepen hun Heer aan, vrezend en hopend. En zij geven uit van dat waar Wij hun mee voorzagen.",
            "verse 32:17": "En geen ziet weet welke verkoeling van de ogen voor hen verborgen wordt gehouden, als beloning voor wat zij plachten te doen.",
            "verse 32:18": "Is wie gelovig is, gelijk aan een zwaar zondige? Zij zijn niet gelijk.",
            "verse 32:19": "Wat betreft degenen die geloofden en goede werken verrichtten: voor hen zijn er Tuinen (het Paradijs) als verblijfplaats, als ontvangst voor wal zij plachten te doen.",
            "verse 32:20": "En wat betreft degenen die zware zonden begingen: hun verblijfplaats is de Hel. Iedere keer dat zij eruit willen komen, worden zij erin terruggedreven, en wordt er tot hen gezegd: \"Proeft de bestraffing van de Hel die jullie plachten te loochenen.\"",
            "verse 32:21": "En Wij zullen hun zeker de bestraffing van het wereldse (leven) dom proeven, vóór de grotere bestraffing, Hopelijk zullen zij terugkeren.",
            "verse 32:22": "En wie is er onrechtvaardiger dan degene die met de Verzen van zijn Heer wordt vermand en zich er vervolgens van afwendt? Voorwaar, Wij zullen de zondaren vergelden.",
            "verse 32:23": "En voorzeker, Wij hebben Môesa het Boek (de Taurât) gegeven. Verkeer daarom (O Moehammad) niet in twijfel over de ontvangst ervan (de Koran). En Wij maakten kom (de Taurât) tot Leiding voor de Kinderen van Israël.",
            "verse 32:24": "En Wij stelden vanwege kun geduld onder hen leiders aan, die leiding gaven volgens Ons bevel. En zij waren van Onze Tekenen oveirtuigd.",
            "verse 32:25": "Voorwaar, jouw Heer oordeelt tussen hen op de Dag der Opstanding over dat waarover zij plachten te redetwisten.",
            "verse 32:26": "Is er geen leiding voor hen in hoeveel generaties Wij vóór hen hebben vernietigd? Zij lopen in kun woonplaatsen rond. Voorwaar, daarin zijn zeker Tekenen. Luisteren zij dan niet?",
            "verse 32:27": "En zien zij niet dat Wij het water (in wolken) naar het dorre land drijven, waarna Wij gewassen tevoorschijn doen komen, waarvan hun vee en zij zelf eten? Zien zij dan niet?",
            "verse 32:28": "En zij zeggen: \"Wanneer zal die overwinning plaatsvinden, als jullie waarachtigen zijn?\"",
            "verse 32:29": "Zeg: \"Op de Dag van de overwinning zal het geloof van degenen die ongelovig waren niet meer baten, en hen zal geen uitstel worden gegeven.\"'",
            "verse 32:30": "Wend je daarom van hen af en wacht af: voorwaar, zij zijn afwachtenden."
        },
        "English": {
            "verse 32:1": "Alif, Lam, Meem.",
            "verse 32:2": "[This is] the revelation of the Book about which there is no doubt from the Lord of the worlds.",
            "verse 32:3": "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muhammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided.",
            "verse 32:4": "It is Allah who created the heavens and the earth and whatever is between them in six days; then He established Himself above the Throne. You have not besides Him any protector or any intercessor; so will you not be reminded?",
            "verse 32:5": "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.",
            "verse 32:6": "That is the Knower of the unseen and the witnessed, the Exalted in Might, the Merciful,",
            "verse 32:7": "Who perfected everything which He created and began the creation of man from clay.",
            "verse 32:8": "Then He made his posterity out of the extract of a liquid disdained.",
            "verse 32:9": "Then He proportioned him and breathed into him from His [created] soul and made for you hearing and vision and hearts; little are you grateful.",
            "verse 32:10": "And they say, \"When we are lost within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in [the matter of] the meeting with their Lord, disbelievers.",
            "verse 32:11": "Say, \"The angel of death will take you who has been entrusted with you. Then to your Lord you will be returned.\"",
            "verse 32:12": "If you could but see when the criminals are hanging their heads before their Lord, [saying], \"Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness. Indeed, we are [now] certain.\"",
            "verse 32:13": "And if We had willed, We could have given every soul its guidance, but the word from Me will come into effect [that] \"I will surely fill Hell with jinn and people all together.",
            "verse 32:14": "So taste [punishment] because you forgot the meeting of this, your Day; indeed, We have [accordingly] forgotten you. And taste the punishment of eternity for what you used to do.\"",
            "verse 32:15": "Only those believe in Our verses who, when they are reminded by them, fall down in prostration and exalt [Allah] with praise of their Lord, and they are not arrogant.",
            "verse 32:16": "They arise from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend.",
            "verse 32:17": "And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do.",
            "verse 32:18": "Then is one who was a believer like one who was defiantly disobedient? They are not equal.",
            "verse 32:19": "As for those who believed and did righteous deeds, for them will be the Gardens of Refuge as accommodation for what they used to do.",
            "verse 32:20": "But as for those who defiantly disobeyed, their refuge is the Fire. Every time they wish to emerge from it, they will be returned to it while it is said to them, \"Taste the punishment of the Fire which you used to deny.\"",
            "verse 32:21": "And we will surely let them taste the nearer punishment short of the greater punishment that perhaps they will repent.",
            "verse 32:22": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.",
            "verse 32:23": "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting. And we made the Torah guidance for the Children of Israel.",
            "verse 32:24": "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs.",
            "verse 32:25": "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
            "verse 32:26": "Has it not become clear to them how many generations We destroyed before them, [as] they walk among their dwellings? Indeed in that are signs; then do they not hear?",
            "verse 32:27": "Have they not seen that We drive the water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?",
            "verse 32:28": "And they say, \"When will be this conquest, if you should be truthful?\"",
            "verse 32:29": "Say, [O Muhammad], \"On the Day of Conquest the belief of those who had disbelieved will not benefit them, nor will they be reprieved.\"",
            "verse 32:30": "So turn away from them and wait. Indeed, they are waiting."
        },
        "Filipino": {
            "verse 32:1": "Alif, Lam, Mim (mga titik A, La, Ma)",
            "verse 32:2": "(Naririto ang) kapahayagan ng Aklat (ang Qur’an) na walang alinlangan mula sa Panginoon ng lahat ng mga nilalang",
            "verse 32:3": "o sila ba ay nagsasabi: “Siya (Muhammad) ay kumatha (naggawa-gawa) lamang nito?” Hindi, ito ang Katotohanan mula sa iyong Panginoon upang iyong mapaalalahanan ang mga tao na sa kanila ay walang dumatal na Tagapagbabala nang una sa iyo; upang sila ay tumpak na mapatnubayan",
            "verse 32:4": "Si Allah, Siya ang lumikha ng kalangitan at kalupaan at lahat ng mga nasa pagitan nito sa anim na Araw; at in- Istawa (itinindig) Niya ang Kanyang sarili sa Luklukan (ng kapamahalaan ayon sa paraan na naaayon sa Kanyang Kamahalan). Kayo (O sangkatauhan) ay wala ng iba pa maliban sa Kanya bilang isang Wali (Tagapangalaga, Tagapagtanggol, Kawaksi, atbp.) o isang tagapamagitan (sa inyo). Hindi baga kayo tatanggap ng paala-ala",
            "verse 32:5": "Siya ang namamahala (sa bawat) pangyayari mula sa kalangitan tungo sa kalupaan; at ito (ang pangyayari) ay pumapanhik sa Kanya, sa isang Araw, na ang sukat nito ay katulad ng isang libong taon sa inyong pagbilang (alalaong baga, ang pagbibilang ayon sa ating pangkasalukuyang oras sa mundong ito)",
            "verse 32:6": "Siya (si Allah), ang Ganap na Nakakaalam ng lahat ng bagay, na nakalingid at lantad, ang Pinakamataas sa Kapangyarihan, ang Pinakamaawain",
            "verse 32:7": "Siya na lumikha ng lahat ng bagay sa pinakamainam na paraan at sinimulan Niya ang paglikha sa tao mula sa putik",
            "verse 32:8": "At ginawa Niya ang kanyang (Adan) mga supling mula sa walang katuturang katas (ng semilya ng lalaki at babae)",
            "verse 32:9": "At Kanyang hinubog siya sa ganap na sukat, at hiningahan Niya ito ng Kanyang espiritu (ang kaluluwa na nilikha ni Allah sa gayong tao), at iginawad Niya sa inyo ang pandinig (tainga), paningin (mata) at pang-unawa (puso). Kakarampot na pasasalamat lamang ang inyong ibinibigay",
            "verse 32:10": "At sila ay nagsasabi: “Ano! Kung kami ay pumanaw, matago at mawala sa kalupaaan, kami baga ay lilikhaing muli?” Hindi, datapuwa’t itinatakwil nila ang Pakikipagtipan sa kanilang Panginoon",
            "verse 32:11": "Ipagbadya: “Ang anghel ng kamatayan na nakatalaga sa inyo ay (walang pagsalang) magtatangan ng inyong kaluluwa; at kayo ay muling ibabalik sa inyong Panginoon.”",
            "verse 32:12": "At kung inyo lamang mapagmamasdan kung ang Mujrimun (mga makasalanan, walang pananampalataya, kriminal, mapagsamba sa mga diyus-diyosan, walang pananalig sa Kaisahan ni Allah, atbp.) ay magyuyukod ng kanilang ulo sa harapan ng kanilang Panginoon, (na nagsasabi): “Aming Panginoon! Aming napagmasdan at aming napakinggan; kaya’t kami ay muli Ninyong ibalik (sa kalupaan); kami ay magiging matuwid at gagawa ng kabutihan. Katotohanan! Kami ngayon ay sumasampalataya ng walang alinlangan.”",
            "verse 32:13": "Kung Amin lamang ninais; walang pagsala, na mabibigyan Namin ang bawat kaluluwa ng tamang patnubay; datapuwa’t ang Salita mula sa Akin ay makapangyayari (sa mga mapaggawa ng kasalanan): “Aking pupunuin ang Impiyerno na magkasama ang mga Jinn at mga tao.”",
            "verse 32:14": "“Kaya’t lasapin ninyo ngayon (ang kaparusahan ng Apoy), sapagkat inyong kinalimutan ang inyong Pakikipagtipan sa Araw na ito; at (katotohanang) Kami rin ay makakalimot sa inyo; kaya’t lasapin ninyo ngayon ang walang hanggang kaparusahan dahilan sa inyong kasamaan!”",
            "verse 32:15": "Sila lamang na mga sumasampalataya sa Aming Ayat (mga tanda, kapahayagan, katibayan, aral, atbp.), sila nga, na kung ito ay dinadalit sa kanila ay nangangayupapa sa pagsamba, at nagpaparangal sa pagluwalhati sa kanilang Panginoon, at hindi sila nagmamataas sa kapalaluan",
            "verse 32:16": "Iniiwan nila ang kanilang mga higaan, na nananalangin sa pangangamba at pag-asa; at gumugugol sila sa kawanggawa (tungo sa kapakanan ni Allah) mula sa biyaya na Aming ipinagkaloob sa kanila",
            "verse 32:17": "Ngayon, walang sinuman ang nakakaalam sa kaligayahan (ng paningin) na inilingid (bilang panlaan) sa kanila, isang gantimpala sa kanilang (mabubuting) gawa",
            "verse 32:18": "Siya kaya na isang nananampalataya ay katulad niya na isang Fasiq (walang pananampalataya at palasuway kay Allah)? Sila ay hindi magkatulad",
            "verse 32:19": "At sa mga sumasampalataya (sa Kaisahan ni Allah at sa Islam) at nagsisigawa ng katuwiran at kabutihan, sasakanila ang mga Halamanan (Paraiso) bilang maasikasong tahanan dahilan sa kanilang (mabubuting) gawa",
            "verse 32:20": "At sa kanila na Fasiqun (mga walang pananalig, palasuway kay Allah, buktot, atbp.) ang kanilang tirahan ay Apoy; sa bawat sandaling naisin nila na makalayo rito, sila ay sapilitang ibabalik dito, at sa kanila ay ipagbabadya: “Lasapin ninyo ang kaparusahan ng Apoy, ang bagay na inyong itinatakwil bilang huwad.”",
            "verse 32:21": "At katotohanang hahayaan Namin na lasapin nila ang magaan na pagpaparusa (alalaong baga, ang kaparusahan sa mundong ito tulad ng mga kalamidad, kapinsalaan, atbp.) bago Namin ibigay ang kasaki-sakit na kaparusahan (sa Kabilang Buhay) upang sila ay (magtika) at magbalik loob (at tumanggap sa Islam)",
            "verse 32:22": "At sino pa kaya ang higit na gumagawa ng kamalian kaysa sa kanya, na kung ang Ayat (mga tanda, kapahayagan, katibayan, aral, atbp.) ng kanyang Panginoon ay ipinahahayag, siya ay tumatalilis palayo rito? Katotohanang sa Mujrimun (mga lumalabag sa kautusan, kriminal, walang pananampalataya, buktot, mapagsamba sa diyus-diyosan, atbp.), Aming igagawad sa kanila ang (ganap) na ganti",
            "verse 32:23": "Noon pang una, katiyakang Aming ibinigay ang Kasulatan (Torah, ang mga Batas) kay Moises; kaya’t huwag kang (Muhammad) mag-alinlangan na makakatagpo mo siya (alalaong baga, kung iyong makatagpo si Moises sa panahon ng Gabi ng Al-Isra at Al-Miraj sa ibabaw ng kalangitan); at ginawa Namin ito (ang Torah, ang mga Batas) na isang patnubay sa Angkan ng Israel",
            "verse 32:24": "At Aming hinirang sa karamihan nila (Angkan ng Israel) ang mga Pinuno na nagbibigay sa kanila ng mga patnubay sa ilalim ng Aming Pag-uutos, habang sila ay nagpupunyagi sa pagtitiyaga at patuloy na nananampalataya ng may katiyakan sa Aming Ayat (mga tanda, kapahayagan, katibayan, aral, atbp)",
            "verse 32:25": "Katotohanan, ang iyong Panginoon ang hahatol sa pagitan nila sa Araw ng Muling Pagkabuhay, sa mga bagay na kanilang pinagkahidwaan (sa kanilang mga sarili)",
            "verse 32:26": "Ito baga ay hindi nagdudulot sa kanila ng aral; kung gaano karaming sali’t saling lahi ang Aming winasak noon, na una pa sa kanila, na ang kanilang mga tirahan ay kanilang dinadaan-daanan? Katotohanang naririto ang mga Tanda; hindi baga sila makikinig",
            "verse 32:27": "At hindi baga nila napagmamasdan na Aming itinataboy ang tubig (mga ulap na nagdadala ng ulan) sa tigang na lupa (na hubad sa halaman), at pinatutubo Namin dito ang pananim, na nagsisilbing pagkain sa kanila at sa kanilang hayupan (bakahan)? wala ba silang paningin",
            "verse 32:28": "Sila ay nagsasabi: “Hanggang kailan ang Pagpapasyang ito (sa pagitan namin at sa iyo, alalaong baga, ang Araw ng Muling Pagkabuhay), kung ikaw ay nagsasabi ng katotohanan?”",
            "verse 32:29": "Ipagbadya: “Sa Araw ng Pagpapasya, ito ay walang kapakinabangan sa mga hindi nananampalataya kahit na sila (sa bandang huli) ay manalig! Sila rin ay hindi bibigyan ng palugit.”",
            "verse 32:30": "Kaya’t lumayo ka sa kanila (O Muhammad) at maghintay; katotohanang sila (rin) ay naghihintay"
        },
        "French": {
            "verse 32:1": "Alif, Lâm, Mîm.",
            "verse 32:2": "La Révélation du Livre, nul doute là-dessus, émane du Seigneur de l'univers.",
            "verse 32:3": "Diront-ils qu'il (Muhammad) l'a inventé? Ceci est, au contraire, la vérité venant de ton Seigneur pour que tu avertisses un peuple à qui nul avertisseur avant toi n'est venu, afin qu'ils se guident.",
            "verse 32:4": "Allah qui a créé en six jours les cieux et la terre, et ce qui est entre eux. Ensuite Il S'est établi «Istawâ» sur le Trône. Vous n'avez, en dehors de Lui, ni allié ni intercesseur. Ne vous rappelez-vous donc pas?",
            "verse 32:5": "Du ciel à la terre, Il administre l'affaire, laquelle ensuite monte vers Lui en un jour équivalent à mille ans de votre calcul.",
            "verse 32:6": "C'est Lui le Connaisseur [des mondes] inconnus et visibles, le Puissant, le Miséricordieux,",
            "verse 32:7": "qui a bien fait tout ce qu'Il a créé. Et Il a commencé la création de l'homme à partir de l'argile,",
            "verse 32:8": "puis Il tira sa descendance d'une goutte d'eau vile [le sperme];",
            "verse 32:9": "puis Il lui donna sa forme parfaite et lui insuffla de Son Esprit. Et Il vous a assigné l'ouïe, les yeux et le cœur. Que vous êtes peu reconnaissants!",
            "verse 32:10": "Et ils disent: «Quand nous serons perdus dans la terre [sous forme de poussière], redeviendrons-nous une création nouvelle?» En outre, ils ne croient pas en la rencontre avec leur Seigneur.",
            "verse 32:11": "Dis: «L'Ange de la mort qui est chargé de vous, vous fera mourir. Ensuite, vous serez ramenés vers Votre Seigneur».",
            "verse 32:12": "Si tu voyais alors les criminels [comparaître], têtes basses devant leur Seigneur! «Notre Seigneur, Nous avons vu et entendu, renvoie-nous donc afin que nous puissions faire du bien; nous croyons [maintenant] avec certitude».",
            "verse 32:13": "«Si Nous voulions, Nous apporterions à chaque âme sa guidée. Mais la parole venant de Moi doit être réalisée: «J'emplirai l'Enfer de djinns et d'hommes réunis».",
            "verse 32:14": "«Goûtez donc! Pour avoir oublié la rencontre de votre jour que voici. Nous aussi Nous vous avons oubliés. Goûtez au châtiment éternel pour ce que vous faisiez».",
            "verse 32:15": "Seuls croient en Nos versets ceux qui, lorsqu'on les leur rappelle, tombent prosternés et, par des louanges à leur Seigneur, célèbrent Sa gloire et ne s'enflent pas d'orgueil.",
            "verse 32:16": "Ils s'arrachent de leurs lits pour invoquer leur Seigneur, par crainte et espoir; et ils font largesse de ce que Nous leur attribuons.",
            "verse 32:17": "Aucun être ne sait ce qu'on a réservé pour eux comme réjouissance pour les yeux, en récompense de ce qu'ils œuvraient!",
            "verse 32:18": "Celui qui est croyant est-il comparable au pervers? (Non), ils ne sont point égaux.",
            "verse 32:19": "Ceux qui croient et accomplissent les bonnes œuvres, auront leur résidence dans les Jardins du Refuge, en récompense de ce qu'ils œuvraient.",
            "verse 32:20": "Et quant à ceux qui auront été pervers, leur refuge sera le Feu: toutes les fois qu'ils voudront en sortir, ils y seront ramenés, et on leur dira: «Goûtez au châtiment du Feu auquel vous refusiez de croire».",
            "verse 32:21": "Nous leur ferons certainement goûter au châtiment ici-bas, avant le grand châtiment afin qu'ils retournent (vers le chemin droit)!",
            "verse 32:22": "Qui est plus injuste que celui à qui les versets d'Allah sont rappelés et qui ensuite s'en détourne? Nous nous vengerons certes des criminels.",
            "verse 32:23": "Nous avons effectivement donné à Moïse le Livre - ne sois donc pas en doute sur ta rencontre avec lui -, et l'avons assigné comme guide aux Enfants d'Israël.",
            "verse 32:24": "Et Nous avons désigné parmi eux des dirigeants qui guidaient (les gens) par Notre ordre aussi longtemps qu'ils enduraient et croyaient fermement en Nos versets.",
            "verse 32:25": "Ton Seigneur, c'est Lui qui décidera entre eux, au Jour de la Résurrection, de ce sur quoi ils divergeaient.",
            "verse 32:26": "N'est-ce pas pour eux une indication le fait qu'avant eux, Nous ayons fait périr tant de générations dans les maisons desquelles ils marchent? Il y a en cela des preuves! N'écouteront-ils donc pas?",
            "verse 32:27": "N'ont-ils pas vu que Nous poussons l'eau vers un sol aride, qu'ensuite Nous en faisons sortir une culture que consomment leurs bestiaux et eux-mêmes? Ne voient-ils donc pas,?",
            "verse 32:28": "Et ils disent: «A quand cette victoire, si vous êtes véridiques?»",
            "verse 32:29": "Dis: «Le jour de la Victoire, il sera inutile aux infidèles de croire! Et aucun délai ne leur sera donné».",
            "verse 32:30": "Eloigne-toi d'eux et attends. Eux aussi demeurent dans l'attente."
        },
        "Fulah": {
            "verse 32:1": "Alif, Laam, Miim",
            "verse 32:2": "Jippineede Deftere nden, sikke woo alaa e mu’un, ko immorde ka Jeyɗo winndere nden",
            "verse 32:3": "Walla ɓe wi`ay kanko (Muhammadu) o fefindi nde? Si ko woni, ko nde goongaare, immorde ka Joomi maa, fii yo a jertin yimɓe, ɓe jertinoowo araano e mun ado maaɗa, belajo’o, ɓe feeway",
            "verse 32:4": "Ko Alla woni taguɗo kammuuli ɗin e leydi ndin, e kon ko woni hakkunde majji, e nder balɗe jeegoo. Refti O fotondiri ka dow \"Arski\". Alanaa on gaanin Makko, giɗo wanaa tefoowo. E on waajitotaako? @Corrected",
            "verse 32:5": "Himo fewja fiyaakuuji ɗin ka kammu haa ka leydi, refti ɗi ƴeenga ka Makko, e ñalaande nde emmbere mun woni, duuɓi ujunere e ko limoton",
            "verse 32:6": "On [fewjoowo fii ɗum on], ko Annduɗo wirniiɗi e feeñuɗi, Fooluɗo, Hinnotooɗo",
            "verse 32:7": "On labinɗo kala huunde nde O tagi. O fuɗɗi tagude neɗɗanke ndin e loopal",
            "verse 32:8": "refti O waɗi geyngol makko ngol, e sortondiral, immorde ndihal [maniiyu] lo’uɗam",
            "verse 32:9": "refi O fotndindiri mo, O wutti e makko Ruuhu Makko on. O waɗani on nanɗe, e giiɗe e ɓerɗe. [Kono] fanɗii ko yettonton",
            "verse 32:10": "Ɓe wi’: \"E nee, si min majjii ka leydi, eyoo men wontay e tagu hesu?\" Ko woni kamɓe e hawrugol e Joomi maɓɓe, ko ɓe yedduɓe [ɗum]",
            "verse 32:11": "Maaku: \"Ko hunnata on, ko malaa’ikaajo maayde on wakkilaaɗo on. Refti ko ka Joomi mon rutteteɗon",
            "verse 32:12": "Sinno a yi`ayno, tuma nde bomɓe ɓen ugginta ko`e-maɓɓe ka Joomi maɓɓe! [lƁe wi`a]: \"Joomi amen, men yi`ii men nanii, rutton men, men golla ko moƴƴi; menen men yananaama",
            "verse 32:13": "Sinno Men muuyuno, Men okkayno kala wonkii peewal makki. Ko woni tun, konngol jojjii immorde e An : \"Ma Mi hebbiniray Jahannama on jinna e yimɓe, ɓe denndaangal",
            "verse 32:14": "Meeɗiree (lepte ɗen) sabu welsindagol mon hawrugol e ndee ñalaande mon ɗoo. Menen (kadi) Men yejjitii on. Meeɗiree lepte luttal, sabu ko huuwaynoɗon kon",
            "verse 32:15": "Anndee ko gomɗinta Aayeeje Amen ɗen, ko ɓen tawɓe si ɓe waajoraama ɗe, ɓe suuyiray sujjugol, ɓe subbuhinora yettugol Joomi maɓɓe, kamɓe ɓe townitotaako",
            "verse 32:16": "Becce maɓɓe ɗen hino woɗɗitoo e lelorɗe ɗen, hiɓe noddira Joomi maɓɓe kulol e tama’u; e kon ko Men arsiki ɓe, hiɓe wintoo",
            "verse 32:17": "Wonkii (woo) anndaa ko maranaa ɓe e ko ɓuɓɓinta ɓernde, ɗum ko njoɓdi ko ɓe gollaynoo kon",
            "verse 32:18": "E on laatiiɗo gomɗinɗo wa’ay wa on faasiqe? (aa’aa), ɓe fotataa",
            "verse 32:19": "Si ko ɓen omɗimɓe ɓe golli golle moƴƴe, hino woodani ɓe Aljannaaji weerde jipporde, sabu koɓe gollaynoo kon",
            "verse 32:20": "Si tawii non ko ɓe faasiqiiɓe, haray femporde ɓen ɗon nden, ko ka Yiite: Tuma kala ɓe faalaa yaltugol e magge, ɓe ruttitee e magge, ɓe wi`anee: \"Meeɗee lepte Yiite nge fennayoɗon ngen",
            "verse 32:21": "Ma Men meeɗinir ɓe lepte aduna, ado lepte mawɗe ɗen (laakara), belajo’o, ɓe ruttitoto",
            "verse 32:22": "Alaa ɓurɗo tooñude wano waajoraaɗo Aayeeje Joomi mun ɗen, refti o ɗuurnii ɗe ! Pellet, Menen, ko Men yoftotooɓe e bomɓe ɓen",
            "verse 32:23": "Gomɗii Men okkii Muusaa Deftere nden, - wata a wonu e sikke e fii hawroygol e makko -, Men waɗi nde ɗoworde ɓiɗɓe Israa’iila ɓen",
            "verse 32:24": "Men waɗi e maɓɓe ardiiɓe, ɗowirooɓe (yimɓe ɓen) yamiroore Amen, nde ɓe muññinoo, ɓe woni yananaaɓe e Aayeeje Amen ɗen",
            "verse 32:25": "Pellet, Joomi maa, ko Kanko senndoyta hakkunde maɓɓe, Ñalnde Darngal, e kon ko ɓe lurraynoo e fii mun",
            "verse 32:26": "E feeñanaali ɓe, no foti ɗuuɗude e ko Men halki ado maɓɓe e gire, hiɓe yaha e koɗooli maɓɓe? Pellet, no e ɗum, tasakuyeeji ! E ɓee haqqiltaa",
            "verse 32:27": "E ɓe yi`aali, wonnde Meɗen soggira ndiyam ɗam ka leydi hokkundi, Men yaltinira ɗam remuru, ndu neemoraaɗi maɓɓe e kamɓe ñaamata e mun? E ɓe yi`ataa",
            "verse 32:28": "Hiɓe wi`a: \"Ko honnde tuma woni ngal uddital, si on laatike goonguɓe",
            "verse 32:29": "Maaku: \"Ñalnde uddial ngal, ko heeferɓe ɓen gomɗinoyta nafoytaaɓe, wanaa kamɓe woni nennanteeɓe",
            "verse 32:30": "Ɗuurno ɓe, haɓɓito-ɗaa. Kamɓe kan, ko ɓe haɓɓitiiɓe (lepte)"
        },
        "German": {
            "verse 32:1": "Alif-Lam-Mim.",
            "verse 32:2": "Die Offenbarung des Buches, an dem es keinen Zweifel gibt, ist vom Herrn der Weltenbewohner.",
            "verse 32:3": "Oder sagen sie: \"Er hat es ersonnen\"? Nein! Vielmehr ist es die Wahrheit von deinem Herrn, damit du ein Volk warnst, zu denen noch kein Warner vor dir ge kommen ist, auf daß sie rechtgeleitet werden mögen.",
            "verse 32:4": "Allah ist es, Der die Himmel und die Erde und was dazwischen ist in sechs Tagen erschuf und Sich hierauf über den Thron erhob. Ihr habt außer Ihm weder Schutzherrn noch Fürsprecher. Bedenkt ihr denn nicht?",
            "verse 32:5": "Er regelt die Angelegenheit vom Himmel bis zur Erde. Hierauf steigt sie zu Ihm auf an einem Tag, dessen Maß tausend Jahre nach eurer Berechnung sind.",
            "verse 32:6": "Jener ist der Kenner des Verborgenen und des Offenbaren, der Allmächtige und Barmherzige,",
            "verse 32:7": "Der alles gut macht, was Er erschafft. Und Er machte die Schöpfung des Menschen am Anfang aus Lehm,",
            "verse 32:8": "hierauf machte Er seine Nachkommenschaft aus einem Auszug aus verächtlichem Wasser.",
            "verse 32:9": "Hierauf formte Er ihn zurecht und hauchte ihm von Seinem Geist ein, und Er hat euch Gehör, Augenlicht und Herzen gemacht. Wie wenig ihr dankbar seid!",
            "verse 32:10": "Und sie sagen: \"Sollen wir etwa, wenn wir uns in der Erde verloren haben, denn wirklich wieder in neuer Schöpfung (erstehen)?\" Aber nein! Sie verleugnen die Begegnung mit ihrem Herrn.",
            "verse 32:11": "Sag: Abberufen wird euch der Engel des Todes, der mit euch betraut ist, hierauf werdet ihr zu eurem Herrn zurückgebracht.",
            "verse 32:12": "Könntest du nur sehen, wenn die Übeltäter vor ihrem Herrn die Köpfe hängenlassen: \"Unser Herr, jetzt haben wir gesehen und gehört. Bringe uns zurück, so wollen wir rechtschaffen handeln. Gewiß, wir sind nun überzeugt\"!",
            "verse 32:13": "Und wenn Wir gewollt hätten, hätten Wir jeder Seele ihre Rechtleitung gegeben. Aber (nun) ist das Wort von Mir unvermeidlich fällig geworden: \"Ganz gewiß werde Ich die Hölle mit den Ginn und den Menschen allesamt füllen.\"",
            "verse 32:14": "So kostet (es) dafür, daß ihr die Begegnung mit diesem eurem Tag vergessen habt. Gewiß, Wir haben euch (auch) vergessen'. Kostet die ewige Strafe für das, was ihr zu tun pflegtet.",
            "verse 32:15": "Nur diejenigen glauben an Unsere Zeichen, die, wenn sie damit ermahnt werden, ehrerbietig niederfallen und ihren Herrn lobpreisen und sich nicht hochmütig verhalten.",
            "verse 32:16": "Ihre Seiten weichen vor den Schlafstätten zurück; sie rufen ihren Herrn in Furcht und Begehren an und geben von dem, womit Wir sie versorgt haben, aus.",
            "verse 32:17": "Keine Seele weiß, welche Freuden im Verborgenen für sie bereitgehalten werden als Lohn für das, was sie zu tun pflegten.",
            "verse 32:18": "Ist denn jemand, der gläubig ist, wie jemand, der ein Frevler ist? Sie sind nicht gleich(zustellen).",
            "verse 32:19": "Was nun diejenigen angeht, die glauben und rechtschaffene Werke tun, so wird es für sie die Gärten der Zuflucht zur gastlichen Aufnahme geben für das, was sie zu tun pflegten.",
            "verse 32:20": "Was aber diejenigen angeht, die freveln, so wird das (Höllen)feuer ihr Zufluchtsort sein. Jedesmal, wenn sie aus ihm herauskommen wollen, werden sie dahinein zu rückgebracht, und es wird zu ihnen gesagt: \"Kostet die Strafe des (Höllen)feuers, die ihr für Lüge zu erklären pflegtet.\"",
            "verse 32:21": "Wir werden sie ganz gewiß etwas von der diesseitigen Strafe vor der größeren Strafe kosten lassen, auf daß sie umkehren mögen.",
            "verse 32:22": "Und wer ist ungerechter als jemand, der mit den Zeichen seines Herrn ermahnt wird und sich hierauf von ihnen abwendet? Gewiß, Wir werden an den Übeltätern Vergeltung üben.",
            "verse 32:23": "Wir gaben bereits Musa die Schrift - so sei nicht im Zweifel über die Begegnung mit Ihm - und machten sie zu einer Rechtleitung für die Kinder Isra'ils.",
            "verse 32:24": "Und Wir bestellten unter ihnen Vorbilder, die (sie) nach Unserem Befehl leiteten, als sie sich standhaft gezeigt halten und von Unseren Zeichen überzeugt waren.",
            "verse 32:25": "Gewiß, dein Herr wird zwischen ihnen am Tag der Auferstehung über das entscheiden, worüber sie uneinig waren.",
            "verse 32:26": "Ist ihnen nicht deutlich geworden, wie viele Geschlechter Wir vor ihnen vernichtet haben, in deren Wohnorten sie (nun) umhergehen? Darin sind wahrlich Zeichen. Wollen sie denn nicht hören?",
            "verse 32:27": "Sehen sie denn nicht, daß Wir das Wasser zum dürren Land treiben und dann dadurch Pflanzen hervorbringen, von denen ihr Vieh und sie selbst essen? Wollen sie denn nicht einsichtig sein?",
            "verse 32:28": "Und sie sagen: \"Wann wird diese Entscheidung eintreten, wenn ihr wahrhaftig seid?\"",
            "verse 32:29": "Sag: Am Tag der Entscheidung wird denjenigen, die ungläubig waren, ihr Glaube nicht (mehr) nützen, noch wird ihnen Aufschub gewährt.",
            "verse 32:30": "So wende dich ab von ihnen und warte ab; sie warten ebenfalls ab."
        },
        "Hausa": {
            "verse 32:1": "A. L̃. M̃.",
            "verse 32:2": "Saukar da Littafin bãbu shakka a gare shi, daga Ubangijin tãlikai yake.",
            "verse 32:3": "Kõ sunã cẽwa (Muhammadu ne) ya ƙirƙira shi? Ã'a, shĩ ne gaskiya daga Ubangijinka, dõmin ka yi gargaɗi ga mutãne waɗanda wani mai gargaɗi bai je musu ba a gabãninka, fãtan zã su shiryu.",
            "verse 32:4": "Allah ne wanda Ya halitta sammai da ƙasa da abin da yake a tsakãninsu a cikin kwãnuka shida, sa'an nan Ya daidaita a kan Al'arshi. Bã ku da, baicin Shi, wani majiɓinci kuma babu wani maceci. Shin, bã zã ku yi tunãni ba?",
            "verse 32:5": "Yanã shirya al'amari daga sama zuwa ga ƙasã, sa'an nan ya tãka zuwa gare Shi a cikin yini, wanda gwargwadonsa shẽkaru dubu ne ga abin da kuke lissafãwa.",
            "verse 32:6": "Wannan shĩ ne Masanin fake da bayyane, Mabuwãyi, Mai jinƙai.",
            "verse 32:7": "Wanda Ya kyautata kõme, Wanda Ya halitta shi. Shi ne kuma Ya fãra halittar mutum daga lãka.",
            "verse 32:8": "Sa'an nan Ya sanya ɗiyansa daga wani asali na wani ruwa wulãkantacce.",
            "verse 32:9": "Sa'an nan Ya daidaita shi, kuma Ya hũra a cikinsa, daga ruhinSa kuma Ya sanya muku ji, da ganunuwa da zukãta. Gõdiyarku kaɗan ce ƙwarai.",
            "verse 32:10": "Kuma suka ce: \"Shin, idan mun ɓace a cikin ƙasã, shin, lalle mu, tabbas ne munã zama a cikin wata halitta sãbuwa?\" Ã'a, su game da gamuwa da Ubangijinsu kãfirai",
            "verse 32:11": "Ka ce: \"Mala, ikin mutuwa ne. wanda aka wakkala a gare ku, shĩ ne ke karɓar rãyukanku. Sa'an nan zuwa ga Ubangijinku ake mayar da ku.\"",
            "verse 32:12": "Kuma da kã gani a lõkacin da mãsu laifi suke mãsu sunkuyar da kawunansu a wurin Ubangijinsu, \"Ya Ubangijinmu! Mun gani, kuma mun ji, to, Ka mayar da mu mu aikata aiki na ƙwarai. Lalle mũ mãsu yaƙĩni ne.\"",
            "verse 32:13": "Kuma dã Mun so dã Mun bai wa kõwane rai shiriyarsa to, amma magana ta tabbata daga gare Ni! Lalle ne Inã cika Jahannama daga aljannu da mutãne gabã ɗaya.",
            "verse 32:14": "To, ku ɗanɗana sabõda abin da kuka manta na haɗuwa da ranarku wannan. Lalle Mũ mã Mun manta da ku, kuma ku dãnɗani azãbar dawwama sabõda abin da kuka kasance kunã aikatãwa.",
            "verse 32:15": "Waɗanda ke ĩmãni da ãyõyinMu kawai, sũ ne waɗanda idan aka karanta musu ãyõyinMu sai su fãɗi sunã mãsu sujada kuma su yi tasbĩhi game da gõde wa Ubangijinsu, alhãli kuwa su bã su yin girman kai.",
            "verse 32:16": "Sãsanninsu nã nĩsanta daga wurãren kwanciya, sunã kiran Ubangijinsu bisa ga tsõro da ɗammãni, kuma sunã ciryawa daga abin da Muka azurta su.",
            "verse 32:17": "Sabõda haka wani rai bai san abin da aka ɓõye musu ba, na sanyin idãnu, dõmin sakamako ga abin da suka kasance sunã aikatãwa.",
            "verse 32:18": "Shin, wanda ya zama mũmini yanã kamar wanda ya zama fãsiƙi? Bã zã su yi daidai ba.",
            "verse 32:19": "Amma waɗanda suka yi ĩmãni, kuma suka aikata ayyukan ƙwafai, to, sunã da gidãjen Aljannar makõma, a kan liyãfa sabõda abin da suka kasance sunã aikatãwa.",
            "verse 32:20": "Kuma waɗanda suka yi fãsiƙanci to makõmarsu ita ce wuta, kõ da yaushe suka yi nufin su fita daga gare ta, sai a mayar da su a cikinta, kuma a ce musu: \"Ku ɗanɗana azãbai wutã, wadda kuka kasance kunã ƙaryatãwa game da ita.\"",
            "verse 32:21": "Kuma lalle Munã ɗanɗana musu daga azãba, mafi ƙasƙanci, kãfin a kai ga azãba mafi girma, dõmin fãtan za su kõmo.",
            "verse 32:22": "Kuma wãne ne ya fi zãlunci bisa ga wanda aka tunãtar da ãyõyin Ubangijinsa, sa'an na ya bijire daga barinsu? Lalle Mũ, Mãsu yin azãbar rãmuwa ne ga mãsu laifi.",
            "verse 32:23": "Kuma lalle haƙĩƙa, Mun bai wa Mũsã Littafi, sabõda haka kada ka kasance a cikin shakka daga haɗuwa da shi. Kuma Mun sanya shi ya zama shiriya ga Banĩ Isrã'ĩla.",
            "verse 32:24": "Kuma Mun sanya shugabanni daga cikinsu, sunã shiryarwa da umurninMu, a lõkacin da suka yi haƙuri, kuma sun kasance sunã yin yaƙĩni da ãyõyinMu.",
            "verse 32:25": "Lalle Ubangijinka shĩ ne zai rarrabe a tsakãninsu a Rãnar ¡iyãma a cikin abin da suka kasance sunã sãɓa wa jũna a cikinsa.",
            "verse 32:26": "Shin, ba ya shiryar da su cẽwa da yawa Muka halakara gabãninsu, daga al'ummõmi sunã tafiya a cikin masaukansu? Lalle a cikin wancan akwai ãyõyi. Shin, ba su jĩ ne?",
            "verse 32:27": "Shin, kuma ba su gani ba cẽwa lalle Mũ, Munã kõra ruwa zuwa ga ƙasã ƙeƙasasshiya, sa'an nan Mu fitar, game da shi, wata shũka wadda dabbõbinsu, da su kansu ke ci daga gare ta? Ashe fa ba su gani ba?",
            "verse 32:28": "Kuma sunã cẽwa, \"Yaushe wannan hukunci yake, aukuwa idan kun kasance mãsu gaskiya?\"",
            "verse 32:29": "Ka ce: \"Ranar hukuncin nan, ĩmãnin waɗanda suka kãfirta bã zai amfãne su ba (a cikinta) kuma bã zã a yi musu jinkiri ba.\"",
            "verse 32:30": "Sabõda haka ka kau da kai daga barinsu, kuma, ka yi jira lalle, sũ ma mãsu jira ne."
        },
        "Hindi": {
            "verse 32:1": "अलिफ़ लाम मीम",
            "verse 32:2": "इसमे कुछ शक नहीं कि किताब क़ुरान का नाज़िल करना सारे जहाँ के परवरदिगार की तरफ से है",
            "verse 32:3": "क्या ये लोग (ये कहते हैं कि इसको इस शख्स (रसूल) ने अपनी जी से गढ़ लिया है नहीं ये बिल्कुल तुम्हारे परवरदिगार की तरफ से बरहक़ है ताकि तुम उन लोगों को (ख़ुदा के अज़ाब से) डराओ जिनके पास तुमसे पहले कोई डराने वाला आया ही नहीं ताकि ये लोग राह पर आएँ",
            "verse 32:4": "ख़ुदा ही तो है जिसने सारे आसमान और ज़मीन और जितनी चीज़े इन दोनो के दरमियान हैं छह: दिन में पैदा की फिर अर्श (के बनाने) पर आमादा हुआ उसके सिवा न कोई तुम्हारा सरपरस्त है न कोई सिफारिशी तो क्या तुम (इससे भी) नसीहत व इबरत हासिल नहीं करते",
            "verse 32:5": "आसमान से ज़मीन तक के हर अम्र का वही मुद्ब्बिर (व मुन्तज़िम) है फिर ये बन्दोबस्त उस दिन जिस की मिक़दार तुम्हारे शुमार से हज़ार बरस से होगी उसी की बारगाह में पेश होगा",
            "verse 32:6": "वही (मुदब्बिर) पोशीदा और ज़ाहिर का जानने वाला (सब पर) ग़ालिब मेहरबान है",
            "verse 32:7": "वह (क़ादिर) जिसने जो चीज़ बनाई (निख सुख से) ख़ूब (दुरुस्त) बनाई और इन्सान की इबतेदाई ख़िलक़त मिट्टी से की",
            "verse 32:8": "उसकी नस्ल (इन्सानी जिस्म के) खुलासा यानी (नुत्फे के से) ज़लील पानी से बनाई",
            "verse 32:9": "फिर उस (के पुतले) को दुरुस्त किया और उसमें अपनी तरफ से रुह फूँकी और तुम लोगों के (सुनने के) लिए कान और (देखने के लिए) ऑंखें और (समझने के लिए) दिल बनाएँ (इस पर भी) तुम लोग बहुत कम शुक्र करते हो",
            "verse 32:10": "और ये लोग कहते हैं कि जब हम ज़मीन में नापैद हो जाएँगे तो क्या हम फिर नया जन्म लेगे (क़यामत से नही) बल्कि ये लोग अपने परवरदिगार के (सामने हुज़ूरी ही) से इन्कार रखते हैं",
            "verse 32:11": "(ऐ रसूल) तुम कह दो कि मल्कुलमौत जो तुम्हारे ऊपर तैनात है वही तुम्हारी रुहें क़ब्ज़ करेगा उसके बाद तुम सबके सब अपने परवरदिगार की तरफ लौटाए जाओगे",
            "verse 32:12": "और (ऐ रसूल) तुम को बहुत अफसोस होगा अगर तुम मुजरिमों को देखोगे कि वह (हिसाब के वक्त) अपने परवरदिगार की बारगाह में अपने सर झुकाए खड़े हैं और(अर्ज़ कर रहे हैं) परवरदिगार हमने (अच्छी तरह देखा और सुन लिया तू हमें दुनिया में एक दफा फिर लौटा दे कि हम नेक काम करें",
            "verse 32:13": "और अब तो हमको (क़यामत का)े पूरा पूरा यक़ीन है और (ख़ुदा फरमाएगा कि) अगर हम चाहते तो दुनिया ही में हर शख़्श को (मजबूर करके) राहे रास्त पर ले आते मगर मेरी तरफ से (रोजे अज़ा) ये बात क़रार पा चुकी है कि मै जहन्नुम को जिन्नात और आदमियों से भर दूँगा",
            "verse 32:14": "तो चूँकि तुम आज के दिन हुज़ूरी को भूले बैठे थे तो अब उसका मज़ा चखो हमने तुमको क़सदन भुला दिया और जैसी जैसी तुम्हारी करतूतें थीं (उनके बदले) अब हमेशा के अज़ाब के मज़े चखो",
            "verse 32:15": "हमारी आयतों पर ईमान बस वही लोग लाते हैं कि जिस वक्त उन्हें वह (आयते) याद दिलायी गयीं तो फौरन सजदे में गिर पड़ने और अपने परवरदिगार की हम्दो सना की तस्बीह पढ़ने लगे और ये लोग तकब्बुर नही करते (15) (सजदा)",
            "verse 32:16": "(रात) के वक्त उनके पहलू बिस्तरों से आशना नहीं होते और (अज़ाब के) ख़ौफ और (रहमत की) उम्मीद पर अपने परवरदिगार की इबादत करते हैं और हमने जो कुछ उन्हें अता किया है उसमें से (ख़ुदा की) राह में ख़र्च करते हैं",
            "verse 32:17": "उन लोगों की कारगुज़ारियों के बदले में कैसी कैसी ऑंखों की ठन्डक उनके लिए ढकी छिपी रखी है उसको कोई शख़्श जानता ही नहीं",
            "verse 32:18": "तो क्या जो शख़्श ईमानदार है उस शख़्श के बराबर हो जाएगा जो बदकार है (हरगिज़ नहीं) ये दोनों बराबर नही हो सकते",
            "verse 32:19": "लेकिन जो लोग ईमान लाए और उन्होंने अच्छे अच्छे काम किए उनके लिए तो रहने सहने के लिए (बेहश्त के) बाग़ात हैं ये सामाने ज़ियाफ़त उन कारगुज़ारियों का बदला है जो वह (दुनिया में) कर चुके थे",
            "verse 32:20": "और जिन लोगों ने बदकारी की उनका ठिकाना तो (बस) जहन्नुम है वह जब उसमें से निकल जाने का इरादा करेंगे तो उसी में फिर ढकेल दिए जाएँगे और उन से कहा जाएगा कि दोज़ख़ के जिस अज़ाब को तुम झुठलाते थे अब उसके मज़े चखो",
            "verse 32:21": "और हम यक़ीनी (क़यामत के) बड़े अज़ाब से पहले दुनिया के (मामूली) अज़ाब का मज़ा चखाएँगें जो अनक़रीब होगा ताकि ये लोग अब भी (मेरी तरफ) रुज़ू करें",
            "verse 32:22": "और जिस शख़्श को उसके परवरदिगार की आयतें याद दिलायी जाएँ और वह उनसे मुँह फेर उससे बढ़कर और ज़ालिम कौन होगा हम गुनाहगारों से इन्तक़ाम लेगें और ज़रुर लेंगे",
            "verse 32:23": "और (ऐ रसूल) हमने तो मूसा को भी (आसमानी किताब) तौरेत अता की थी तुम भी इस किताब (कुरान) के (अल्लाह की तरफ से) मिलने में शक में न पड़े रहो और हमने इस (तौरेत) तो तुम को भी बनी इसराईल के लिए रहनुमा क़रार दिया था",
            "verse 32:24": "और उन्ही (बनी इसराईल) में से हमने कुछ लोगों को चूंकि उन्होंने (मुसीबतों पर) सब्र किया था पेशवा बनाया जो हमारे हुक्म से (लोगो की) हिदायत करते थे और (इसके अलावा) हमारी आयतो का दिल से यक़ीन रखते थे",
            "verse 32:25": "(ऐ रसूल) हसमें शक़ नहीं कि जिन बातों में लोग (दुनिया में) बाहम झगड़ते रहते हैं क़यामत के दिन तुम्हारा परवरदिगार क़तई फैसला कर देगा",
            "verse 32:26": "क्या उन लोगों को ये मालूम नहीं कि हमने उनसे पहले कितनी उम्मतों को हलाक कर डाला जिन के घरों में ये लोग चल फिर रहें हैं बेशक उसमे (कुदरते ख़ुदा की) बहुत सी निशानियाँ हैं तो क्या ये लोग सुनते नहीं हैं",
            "verse 32:27": "क्या इन लोगों ने इस पर भी ग़ौर नहीं किया कि हम चटियल मैदान (इफ़तादा) ज़मीन की तरफ पानी को जारी करते हैं फिर उसके ज़रिए से हम घास पात लगाते हैं जिसे उनके जानवर और ये ख़ुद भी खाते हैं तो क्या ये लोग इतना भी नहीं देखते",
            "verse 32:28": "और ये लोग कहते है कि अगर तुम लोग सच्चे हो (कि क़यामत आएगी) तो (आख़िर) ये फैसला कब होगा",
            "verse 32:29": "(ऐ रसूल) तुम कह दो कि फैसले के दिन कुफ्फ़ार को उनका ईमान लाना कुछ काम न आएगा और न उनको (इसकी) मोहलत दी जाएगी",
            "verse 32:30": "ग़रज़ तुम उनकी बातों का ख्याल छोड़ दो और तुम मुन्तज़िर रहो (आख़िर) वह लोग भी तो इन्तज़ार कर रहे हैं"
        },
        "Indonesian": {
            "verse 32:1": "Alif Laam Miim",
            "verse 32:2": "Turunnya Al-Quran yang tidak ada keraguan di dalamnya, (adalah) dari Tuhan semesta alam.",
            "verse 32:3": "Tetapi mengapa mereka (orang kafir) mengatakan: \"Dia Muhammad mengada-adakannya\". Sebenarnya Al-Quran itu adalah kebenaran dari Rabbmu, agar kamu memberi peringatan kepada kaum yang belum datang kepada mereka orang yang memberi peringatan sebelum kamu; mudah-mudahan mereka mendapat petunjuk.",
            "verse 32:4": "Allah lah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam masa, kemudian Dia bersemayam di atas 'Arsy. Tidak ada bagi kamu selain dari pada-Nya seorang penolongpun dan tidak (pula) seorang pemberi syafa'at. Maka apakah kamu tidak memperhatikan?",
            "verse 32:5": "Dia mengatur urusan dari langit ke bumi, kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya adalah seribu tahun menurut perhitunganmu",
            "verse 32:6": "Yang demikian itu ialah Tuhan Yang mengetahui yang ghaib dan yang nyata, Yang Maha Perkasa lagi Maha Penyayang.",
            "verse 32:7": "Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya dan Yang memulai penciptaan manusia dari tanah.",
            "verse 32:8": "Kemudian Dia menjadikan keturunannya dari saripati air yang hina.",
            "verse 32:9": "Kemudian Dia menyempurnakan dan meniupkan ke dalamnya roh (ciptaan)-Nya dan Dia menjadikan bagi kamu pendengaran, penglihatan dan hati; (tetapi) kamu sedikit sekali bersyukur.",
            "verse 32:10": "Dan mereka berkata: \"Apakah bila kami telah lenyap (hancur) dalam tanah, kami benar-benar akan berada dalam ciptaan yang baru?\" Bahkan mereka ingkar akan menemui Tuhannya.",
            "verse 32:11": "Katakanlah: \"Malaikat maut yang diserahi untuk (mencabut nyawa)mu akan mematikanmu, kemudian hanya kepada Tuhanmulah kamu akan dikembalikan\".",
            "verse 32:12": "Dan, jika sekiranya kamu melihat mereka ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata): \"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), kami akan mengerjakan amal saleh, sesungguhnya kami adalah orang-orang yang yakin\".",
            "verse 32:13": "Dan kalau Kami menghendaki niscaya Kami akan berikan kepada tiap-tiap jiwa petunjuk, akan tetapi telah tetaplah perkataan dari pada-Ku: \"Sesungguhnya akan Aku penuhi neraka jahannam itu dengan jin dan manusia bersama-sama\".",
            "verse 32:14": "Maka rasailah olehmu (siksa ini) disebabkan kamu melupakan akan pertemuan dengan harimu ini. Sesungguhnya Kami telah melupakan kamu (pula) dan rasakanlah siksa yang kekal, disebabkan apa yang selalu kamu kerjakan.",
            "verse 32:15": "Sesungguhnya orang yang benar-benar percaya kepada ayat-ayat Kami adalah mereka yang apabila diperingatkan dengan ayat-ayat itu mereka segera bersujud seraya bertasbih dan memuji Rabbnya, dan lagi pula mereka tidaklah sombong.",
            "verse 32:16": "Lambung mereka jauh dari tempat tidurnya dan mereka selalu berdoa kepada Rabbnya dengan penuh rasa takut dan harap, serta mereka menafkahkan apa apa rezeki yang Kami berikan.",
            "verse 32:17": "Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang sebagai balasan bagi mereka, atas apa yang mereka kerjakan.",
            "verse 32:18": "Apakah orang-orang beriman itu sama dengan orang-orang yang fasik? Mereka tidak sama.",
            "verse 32:19": "Adapun orang-orang yang beriman dan mengerjakan amal saleh, maka bagi mereka jannah tempat kediaman, sebagai pahala terhadap apa yang mereka kerjakan.",
            "verse 32:20": "Dan adapun orang-orang yang fasik (kafir) maka tempat mereka adalah jahannam. Setiap kali mereka hendak keluar daripadanya, mereka dikembalikan ke dalamnya dan dikatakan kepada mereka: \"Rasakanlah siksa neraka yang dahulu kamu mendustakannya\".",
            "verse 32:21": "Dan Sesungguhnya Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat), mudah-mudahan mereka kembali (ke jalan yang benar).",
            "verse 32:22": "Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya? Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa.",
            "verse 32:23": "Dan Sesungguhnya Kami telah berikan kepada Musa Al-Kitab (Taurat), maka janganlah kamu (Muhammad) ragu menerima (Al-Quran itu) dan Kami jadikan Al-Kitab (Taurat) itu petunjuk bagi Bani Israil.",
            "verse 32:24": "Dan Kami jadikan di antara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami ketika mereka sabar. Dan adalah mereka meyakini ayat-ayat Kami.",
            "verse 32:25": "Sesungguhnya Tuhanmu Dialah yang memberikan keputusan di antara mereka pada hari kiamat tentang apa yang selalu mereka perselisihkan padanya.",
            "verse 32:26": "Dan apakah tidak menjadi petunjuk bagi mereka, berapa banyak umat sebelum mereka yang telah Kami binasakan sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah). Maka apakah mereka tidak mendengarkan?",
            "verse 32:27": "Dan apakah mereka tidak memperhatikan, bahwasanya Kami menghalau (awan yang mengandung) air ke bumi yang tandus, lalu Kami tumbuhkan dengan air hujan itu tanaman yang daripadanya makan hewan ternak mereka dan mereka sendiri. Maka apakah mereka tidak memperhatikan?",
            "verse 32:28": "Dan mereka bertanya: \"Bilakah kemenangan itu (datang) jika kamu memang orang-orang yang benar?\"",
            "verse 32:29": "Katakanlah: \"Pada hari kemenangan itu tidak berguna bagi orang-orang kafir, iman mereka dan tidak pula mereka diberi tangguh\".",
            "verse 32:30": "Maka berpalinglah kamu dari mereka dan tunggulah, sesungguhnya mereka (juga) menunggu."
        },
        "Italian": {
            "verse 32:1": "Alif, Lâm, Mîm.",
            "verse 32:2": "La rivelazione del Libro [proviene] senza alcun dubbio dal Signore dei mondi.",
            "verse 32:3": "Diranno: “L'ha inventato?”. È invece una verità che [proviene] dal tuo Signore, affinché tu ammonisca un popolo a cui non giunse, prima di te, alcun ammonitore, affinché si lascino guidare.",
            "verse 32:4": "Allah è Colui Che ha creato in sei giorni i cieli e la terra e tutto ciò che vi è frammezzo, quindi Si è innalzato sul Trono. Al di fuori di Lui non avete alcun patrono o intercessore. Non ve ne ricorderete?",
            "verse 32:5": "Dal cielo dirige le cose della terra e poi tutto risalirà a Lui, in un Giorno che sarà come mille anni del vostro contare.",
            "verse 32:6": "Egli è Colui Che conosce il palese e l'invisibile; è l'Eccelso, il Misericordioso;",
            "verse 32:7": "è Colui Che ha perfezionato ogni cosa creata e dall'argilla ha dato inizio alla creazione dell'uomo,",
            "verse 32:8": "quindi ha tratto la sua discendenza da una goccia d'acqua insignificante;",
            "verse 32:9": "quindi gli ha dato forma e ha insufflato in lui del Suo Spirito. Vi ha dato l'udito, gli occhi e i cuori. Quanto poco siete riconoscenti!",
            "verse 32:10": "E dicono: “Quando saremo dispersi nella terra godremo di una nuova creazione?”. È che non credono all'incontro con il loro Signore!",
            "verse 32:11": "Di': “L'angelo della morte che si occuperà di voi, vi farà morire e poi sarete ricondotti al vostro Signore”.",
            "verse 32:12": "Se allora potessi vedere i malvagi, [dire col] capo chino davanti al loro Signore: “Nostro Signore, abbiamo visto e sentito, lasciaci tornare, sì che possiamo fare il bene; [ora] crediamo con certezza”.",
            "verse 32:13": "“Se avessimo voluto, avremmo dato ad ogni anima la sua direzione; si è invece compiuta la mia sentenza: riempirò l'Inferno di uomini e di dèmoni insieme\".",
            "verse 32:14": "Gustate allora [il castigo] per aver dimenticato l'incontro di questo Giorno. In verità [anche] Noi vi dimentichiamo. Gustate il castigo perpetuo per quello che avete fatto!”",
            "verse 32:15": "In verità credono nei Nostri segni solo coloro che, quando vengono loro rammentati, si gettano in prosternazione, lodano il loro Signore rendendoGli gloria e non sono tronfi di orgoglio.",
            "verse 32:16": "Strappano i loro corpi dai letti per invocare il loro Signore, per timore e speranza, e sono generosi di quello che abbiamo loro concesso.",
            "verse 32:17": "Nessuno conosce la gioia immensa che li attende, ricompensa per quello che avranno fatto.",
            "verse 32:18": "Forse il credente è come l'empio? Non sono affatto uguali.",
            "verse 32:19": "Coloro che credono e compiono il bene saranno ospitati nei giardini del Rifugio, premio per quello che avranno fatto,",
            "verse 32:20": "mentre coloro che saranno stati empi avranno per rifugio il fuoco. Ogni volta che vorranno uscirne vi saranno ricondotti e sarà detto loro: “Provate il castigo del fuoco che tacciavate di menzogna!”.",
            "verse 32:21": "Daremo loro un castigo immediato prima del castigo più grande, affinché ritornino [sulla retta via].",
            "verse 32:22": "Chi è peggior ingiusto di colui che si distoglie dai segni di Allah dopo che gli sono stati ricordati? In verità ci vendicheremo dei trasgressori.",
            "verse 32:23": "Già demmo il Libro a Mosè [dicendogli]: “Non dubitare circa il Suo incontro”. Ne facemmo una guida per i Figli di Israele.",
            "verse 32:24": "E [finché] furono perseveranti e credettero con fermezza nei Nostri segni, scegliemmo tra loro dei capi che li dirigessero secondo il Nostro comando.",
            "verse 32:25": "In verità il tuo Signore nel Giorno della Resurrezione giudicherà tra loro, a proposito delle loro divergenze.",
            "verse 32:26": "Non è servito loro da lezione che prima di loro abbiamo fatto perire tante generazioni, nelle cui case [in rovina] si aggirano? In verità in ciò vi sono segni. Non ascolteranno dunque?",
            "verse 32:27": "Non hanno visto come spingiamo l'acqua verso una terra arida, suscitando poi una vegetazione che nutre il loro bestiame e loro stessi? Non vedranno dunque?",
            "verse 32:28": "E dicono: “Quando verrà questa vittoria, se siete veridici?”.",
            "verse 32:29": "Di': “Nel Giorno della Vittoria sarà vano il credere dei miscredenti! Non avranno alcun rinvio”.",
            "verse 32:30": "Allontanati dunque da loro, e aspetta. Anche loro aspetteranno!"
        },
        "Japanese": {
            "verse 32:1": "アリフ・ラーム・ミーム。",
            "verse 32:2": "この啓典の啓示は，万有の主から（下ったもの）で，疑いの余地はない。",
            "verse 32:3": "けれどもかれらは，「かれ（ムハンマド）がこれを捏造した。」と言うのか。いや，これはあなたの主からの真理で，あなた以前に，一人の警告者も来なかった民に，警告するためのものである。必ずかれらは導かれるであろう。",
            "verse 32:4": "アッラーこそは，6日の間に天と地，そしてその間の凡てのものを創造して，御自らその玉座に鎮座なされる方である。あなたがたはかれの外に守護者はなく，執り成す者もないのである。あなたがたはそれでも気が付かないのか。",
            "verse 32:5": "かれは，天から地までの（凡ての）事物を統御なされる。それからそれ（万有）は一日にして，かれの許に登って行く。その（一日の）長さは，あなたがたの計算する千年である。",
            "verse 32:6": "この方こそは，幽玄界と現象界を（凡て）知っておられる方，偉力ならびなく慈悲深い御方であり，",
            "verse 32:7": "創造された一切を，最も善美なものになされ，泥から人間の創造を始められる。",
            "verse 32:8": "かれは，いやしい水（精液）の精からその後継者を創られ，",
            "verse 32:9": "それからかれ（人間）を均整にし，かれの聖霊を吹き込まれ，またあなたがたのために聴覚と視覚と心を授けられた御方。あなたがたはほとんど感謝もしない。",
            "verse 32:10": "かれらは，「地中に消えてから，わたしたちはまた新しく創造されるであろうか。」と言う。いや，かれらは主との会見を信じない。",
            "verse 32:11": "言ってやるがいい。「あなたがたを受け持つ死の天使があなたがたを死なせ，それから主に帰らせる。」",
            "verse 32:12": "罪を犯した者たちが主の御前に項垂れて，「主よ，わたしたちは見ました。聞きました。わたしたちを御返し下さい。わたしたちは善い行いをいたします。わたしたちは本当に悟りました。」（と言う姿を）あなたに見せてやりたいものである。",
            "verse 32:13": "もしわれが欲するならば，それぞれの魂に導きを与えることも出来た。だが「ジン（幽精）と人間たちで，必ず地獄を満たすであろう。」とのわれの言葉は，真実となろう。",
            "verse 32:14": "それであなたがたは味わうがよい。この日の会見を忘れていたことを。本当にわれもあなたがたを忘れよう。あなたがたは自分たちが行ったことに対する永遠の懲罰を味わえ。",
            "verse 32:15": "われの印を信じる者とは，それが述べられた時に敬慕し身を投げだしてサジダし，主の栄光を讃えて唱念する，高慢ではない者たちである。〔サジダ〕",
            "verse 32:16": "かれらの体が臥床を離れると，畏れと希望とを抱いて主に祈り，われが授けたものを施しにさし出す。",
            "verse 32:17": "かれらはその行ったことの報奨として，喜ばしいものが自分のためにひそかに（用意）されているのを知らない。",
            "verse 32:18": "信仰している者が，主の掟に背く者と同じであろうか。かれらは決して同じではない。",
            "verse 32:19": "信仰して善行に勤しむ者は，楽園が住まいで，それは善行をしたことへの報奨である。",
            "verse 32:20": "だが掟に背く者の住まいは地獄の業火である。そこから出ようとする度にかれらはその中に引き戻され，「あなたがたが虚偽であるとしていた業火の懲罰を味わえ。」と言われよう。",
            "verse 32:21": "われは大きい懲罰の前に，必ず手近な懲罰をかれらに味わせる。そうすればかれらも（悔悟してわれに）帰るであろう。",
            "verse 32:22": "主の印に気付いていながらその後背き去る者より酷い罪作りがあろうか。われは必ず罪深い者に報復するであろう。",
            "verse 32:23": "われは，ムーサーにしかと啓典を授けた。だからあなた（ムハンマド）がこれを授かることを疑ってはならない。われはそれを，イスラエルの子孫たちの導きとした。",
            "verse 32:24": "われは，かれらの間から，わが命令を下して（人びとを）導く導師をあげた。かれらはよく耐え忍びまたわれの印を堅く信じていた。",
            "verse 32:25": "本当にあなたの主は，かれらが意見を異にしていたことに関して，審判の日にかれらの間を裁決なされる。",
            "verse 32:26": "かれらに教えなかったか。それ以前にわれが幾世代を滅ぼしたかを。その住まいの中を，（今）かれらは往来している。本当にその中には，種々の印がある。それでもかれらは聞く耳を持たないのか。",
            "verse 32:27": "またわれが水を不毛の地に送り，それで作物を育成させ，かれら自身や家畜に食べさせるのを見ないのか。かれらは見る目を持たないのか。",
            "verse 32:28": "かれらは，「もしあなたがたが言うことが真実ならば勝利はいつ来るのですか。」と言う。",
            "verse 32:29": "言ってやるがいい。「勝利の日には，不信心であった者の信仰はかれらに役立たず，かれらは猶予もされないであろう。」",
            "verse 32:30": "だからあなたは，かれらを避けて待て。かれらも待っているのである。"
        },
        "Jawa": {
            "verse 32:1": "Alif-Laam-Miim",
            "verse 32:2": "Ora semelang yen tumuruning Kitab (al-Qur’an) iku saka Allah Pangerane jagad saisine",
            "verse 32:3": "Wong (kafir) mau padha celathu, \"al-Qur’an iku gaweyane (Muhammad) dhewe?\". Ora, iku kasuyatan saka Pangeranira, amrih sira aweh pepeling marang bangsa sadurungira. Ora anajuru pepeling kang nekani mrono. Supaya dheweke padha miturut dalan kang bener",
            "verse 32:4": "ALlah iku kang gawe bumi lan langit sarta barang antarane, lawase mung rampung dina. Sawise dadi Allah banjur murbawasesa ing kratone(arsy). Sira ora duwe andel - andel liyane Allah. Kang bakal mitulungi utawa nggenepi kekuranganira murungake siksane Allah. Ya gene sira padha ora ngrasak - ngrasakake kang mangkono mahu",
            "verse 32:5": "Allah nindakake lan niti priksa urusan saka langit tumeka bumi. Tumuli urusan - uran mau kanjuk ing Allah ana ing dina (Qiyamat) sing ukurane sewu tahun miturut petungmu",
            "verse 32:6": "Alah nguningani barang kang samar - samar lan kasat mata. Kagungan sifat Mulya lan Asih",
            "verse 32:7": "Allah kang becikake wangune samu barang dedamelane sarta murwani gawe manungsa saka lemah (Adam)",
            "verse 32:8": "Banjur gawe turune manungsa saka sari pathine banyu helek (mani)",
            "verse 32:9": "Allah damel rupa mangungsa banjur dipanjingi ruh sarta padha diparingi pangrungu lan pandeleng lan pikir. Ewadene kang syukur ing Allah mung sathithik",
            "verse 32:10": "(Wong kang maido qiyamat) padha ngucap, \"Malaikat pati kang tinanggenah dening Allah bakal hanglolos nyawamu. Wusana ing tembe kowe bakal padha bali disowanake ana ngarsane Allah Pangeranmu",
            "verse 32:11": "Sira dhawuha, \"Malaikat pati kang tinanggenah dening Allah bakal hanglolos nyawamu. WUsana ing tembe kowe bakal padha bali disowanake ana ngarsane Allah Pangeranmu",
            "verse 32:12": "Sira bakal handeleng para wong kafir padha hanjungkel ana ngarsane Pangerane, tumungkul, sarta padha munjuk, \"Pangeran kawula ! Sapunika kawula sampun sumerep piyambak saha sampun mireng dhawuh Paduka (bab temenipun para Rasul). Sakpunika panyuwun kawula mugi wontena kepareng Paduka mangsulaken (dhateng donya malih), Kawula sanggem badhe nglampahi pandamel sahe. Sapunika kawula sampun ngandel (sayektos dhateng para Rasul)",
            "verse 32:13": "Upama Ingsun kersa, manungsa iku kabeh diparingi pituduh bener. Nanging kersaningsun ora mangkono. Pangandikaningsun, \"Neraka jahannma bakal Ingsun kebaki hisine Jin lan Manungsa",
            "verse 32:14": "Mara padha ngrasakna siksa, patrapane anggonmu padha ora perduli lan ora percaya anane akhera. Aku uga ora perduli marang kowe. Saiki padha ngrasakna siksa langgeng patrapane anggonmu padha tumindak (kafir)",
            "verse 32:15": "Kang mesthi ngandel marang al-Qur’an (ayat - ayatingsun) mung wong kang yen dipituturi kelawan surasaning al-Quran, banjur sungkem sujud ing Allah, Sarta nyebut Maha Suci kelawan memuji ALlah Pangerane. Apadene ora gumedhe",
            "verse 32:16": "Hing wayah wengi padha tangi saka turune, banjur sholat lan nyenyuwun ing Pangeran. Wedi siksane lan kepengin ganjarane. Apa dene padha dhangan mewehake rizki peparing Ingsun",
            "verse 32:17": "Wong siji wae ora ana kang weruh kanugrahan apa kang isih disamar dening Allah, bakal diparingake marang wong mahu, minangka ganjaraning pangabekti kang wis dilakoni",
            "verse 32:18": "Wong kang percaya lan ngestokake ing Allah, apa padha bae karo wong kang duraka? mesthi ora",
            "verse 32:19": "Dene wong kang padha percaya ing Allah, sarta padha nglakoni panggawe becik, iku bakal padha holeh ganjaran suwarga Ma’wa. Minangka ganjaring pangabekti kang wis padha dilakoni",
            "verse 32:20": "Dene wong kang padha duroko panggone ana neraka, saben arep metu saka neraka dibalekake ana ing panggonane ing neraka. Malah padha didhawuhi, \"Pada ngrasakna siksa neraka, kang padha sira paido biyen",
            "verse 32:21": "(Wong kafir mau) ana ing donya Ingsun weruhake rasaning siksa kang mayar, iya iku diboyong lan pahilan sapadhane, sadurunge Ingsun weruhake rasaning siksa kang gedhe ana akhirat kang mangkono mahu supaya padha marenana (anggone kafir)",
            "verse 32:22": "Ora ana wong kang luwih duraka katimbang wong kang dipituturi kelawan surasaning al-QUr’an, nanging banjur mlengos, satemene Ingsun mesthi niksa para wong kafir",
            "verse 32:23": "Ingsun wis maringi kitab (taurat) marang Musa. sira aja sumelang anggonira papatemon karo Musa (nalikane sira Ingsun timbali munggah marang langit) dheweke Ingsun dadekake panuduh dalan bener marang prakara turune Israil",
            "verse 32:24": "Turuning Israel hiya ana kang Ingsun dadekake pangareping manungsa, hiya iku para Nabi padha nuduhake wong akeh ngestokake parentah Ingsun, awit para Nabi mau padha teguh atine, sarta padha ngandel ayatngsun",
            "verse 32:25": "Satemene Allah Pangeranira iku bakal mancas prakara pasulayane para Nabi mahu lan para umate kang pada maido besuk dina qiyamat",
            "verse 32:26": "Wong kafir apa ora wis dituduhake dening Allah para ummat kuna kang padha ditumpesi marga kafir. Wong kafir padha mlaku andeleng patilasane. Kang mangkono mahu mesthi dadi tandha yekti. Ya gene wong kafir ora padha ngrasak - ngrasakake",
            "verse 32:27": "Wong kafir apa ora padha handeleng hanggoningsun ngilekake banyu marang palemahan kang bera. Banjur Ingsun anggo nukulake tetanduran ana ing palemahan mahu, wusana banjur dadi pangane wong kafir dalah ingon - ingone. Apa padha ora deleng kahanan kang mangkono mahu",
            "verse 32:28": "(Wong kafir) padha celathu (marang wong mukmin) yen kandhamu mau temen, besuk apa bedhahe negara Mekkah",
            "verse 32:29": "(Muhammad) dhawuha, \"Bab bedhahe Mekkah utawa dina Qiyamat (Allah piyambak kang wuninga) ing kono tobate wis ora migunani sarta wis ora disrantekake maneh paniksane",
            "verse 32:30": "Mulane sira malengosa marang wong kafir, sarta ngarep - arep pitulunging Allah, wong kafir uga ngarep - arep menange"
        },
        "Kazakh": {
            "verse 32:1": "Әлиф. Ләм. Мим",
            "verse 32:2": "Бұл Кітаптың әлемдердің Раббысынан түсірілгендігіне ешқандай күмән жоқ",
            "verse 32:3": "Әлде олар: «Ол оны ойдан шығарды», дей ме? Жоқ, олай емес! Бұл сенен бұрын ескертуші келмеген елдің тура жолға түсуіне үгіттеп, ескертуің үшін Раббыңнан түскен ақиқат",
            "verse 32:4": "Аллаһ, Ол сондай, аспандарды және жерді әрі екеуінің арасындағыларын алты күнде жаратты, кейін Аршыға көтерілді. Сендер үшін Одан басқа ешбір қамқоршы да, араша түсуші де жоқ. Еске алмайсыңдар ма",
            "verse 32:5": "Ол аспаннан жерге дейін Өз әмірін жүргізеді. Кейін ол ол істер , мөлшері сендердің есептеріңмен мың жыл болатын бір күнде Оған көтеріледі",
            "verse 32:6": "Міне, сол ғайып пен айқын нәрсені Білуші, бәрінен Үстем, ерекше Мейірімді",
            "verse 32:7": "Ол әрбір нәрсені өте жақсы кемел де кемшіліксіз етіп жаратты. Әрі Ол адамның Адам атаның жаратылысын лайдан бастады",
            "verse 32:8": "кейін оның ұрпағын әлсіз елеусіз судың тамшысынан жасады",
            "verse 32:9": "Кейін оны рет-ретімен теңестіріп, оған Өзіндегі иелігіндегі рухтан үрледі. Әрі Ол сендерге естуді, көруді және жүректерді берді. Сендер аз шүкір етесіңдер Оның берген игіліктеріне аз алғысбілдіресіңдер",
            "verse 32:10": "Ал, олар сенбейтіндер : «Біз жермен араласып жоғалсақ та жаңадан қайта жаратыламыз ба?» деді. Жоқ, олар өздерінің Раббысымен жолығуға сенбейді",
            "verse 32:11": "Ей, Мұхаммед! Айт: «Жандарыңды сендерге уәкіл етілген өлім періштесі алады, одан кейін сендер өздеріңнің Раббыңа қайтарыласыңдар», -деп",
            "verse 32:12": "Сен қылмыскерлердің өздерінің Раббы­сы алдында бастарын иіп: «Раббымыз! Біз көрдік және естідік. Бізді артқа қайтар, ізгі амал істейік. Біз енді анық сендік», — деп айтқандарын көргеніңде еді",
            "verse 32:13": "Егер де қалағанымызда, барлық адамды тура жолмен жүргізер едік. Бірақ Менен: «Тозақты жындардың және адамдардың кәпір, күнәһарларының барлығымен әлбетте толтырамын» деп айтылған сөз болды",
            "verse 32:14": "Имансыздарға : «Өздеріңнің осы күндеріңе жолығуды ұмытқандарың үшін азапты татыңдар. Анығында, Біз де сендерді Есеп күнін ұмытқандарыңдай ұмыттық. Істеп өткен амалдарың үшін мәңгіліктің азабын татыңдар», делінеді",
            "verse 32:15": "Анығында, Біздің аяттарымызға, ол арқылы естеріне салынған кезде, өздерін жоғары санап, менменсімей сәждеге жығылып және өздерінің Раббысына мақтаулар айтып, барлық кемшіліктен пәк деп дәріптейтіндер ғана сенеді",
            "verse 32:16": "Олар жамбастары төсектерден ажырап, өздерінің Раббысынан қорқып және үміт етіп тілейді әрі Біз өздеріне ризық етіп бергеннен жұмсайды",
            "verse 32:17": "Ешбір жан істеген амалдары үшін қайтарым сый ретінде өздері көзайым болатын қандай қуаныштың жасырылғанын білмейді",
            "verse 32:18": "Иманды жан мүмін бүлдіруші бойсұнбаушы біреу секілді ме?! Олар тең емес",
            "verse 32:19": "Иманға келген және ізгі амал жасағандарға істеген амалдары үшін Мәуа жәннатының бақтарында сый-құрметтер болады",
            "verse 32:20": "Ал, бұзық іс істейтіндердің бойсұнбағандардың тұрағы От. Олар әркез ол жерден шығуды қалағанда, оған қайтарылады әрі оларға: «Өздерің өтірік санаған от азабын татыңдар», делінеді",
            "verse 32:21": "Әрі міндетті түрде, Біз оларға иманға қайтулары үшін үлкен азаптан алдын жақын азапты осы дүниедегі ауыртпашылықтарды таттырамыз",
            "verse 32:22": "Әрі Раббысының аят-белгілері есіне салынғаннан кейін, одан теріс бұрылғаннан өткен әділетсіз кім бар? Анығында, Біз қылмыскерлерден кек аламыз",
            "verse 32:23": "Ей, Мұхаммед! Біз Мұсаға Кітапты бердік. Онымен жолығудан күмәнда болма. Әрі Біз оны Тәуратты Исраил ұрпақтарына тура жолды ұстануға жолбасшы еттік",
            "verse 32:24": "және олар сабыр етіп, аяттарымызға айқын сенген кезде, араларынан әміріміз бойынша тура жолға бастайтын жетекшілер шығардық",
            "verse 32:25": "Ақиқатында, Раббың Қайта тірілу күні қайшылыққа түскен нәрселеріне қатысты олардың араларына, әлбетте, үкім шығарады",
            "verse 32:26": "Олардан бұрын өткен қаншама ұрпақтарды Біздің жойып жібергеніміз, оларды шынымен жолға салмады ма? Өздері бүгін олардың жұрттарынан мекендерінен өтіп жүр. Ақиқатында, мұнда белгі-ғибраттар бар. Олар сонда да құлақ аспай ма",
            "verse 32:27": "Олар имансыздар суды шел жерге қарай айдап, ол арқылы олардың малдары және өздері жейтін егін шығарғанымызды көрмеді ме? Олар әлі де көрмей ме",
            "verse 32:28": "Әрі олар: «Егер шын сөзді болсаңдар, бұл үкім шешім қашан болады?» дейді",
            "verse 32:29": "Ей, Мұхаммед! Айт: «Үкім берілетін күні сондай күпірлік еткендерге Аллаһқа қарсы келгендерге сенімдері пайда бермейді және оларға мұрсат та берілмейді», -деп",
            "verse 32:30": "Енді олардан теріс бұрыл және күт. Өйткені олар да күтуде"
        },
        "Korean": {
            "verse 32:1": "알리프 람 밈알리프 람 밈",
            "verse 32:2": "이것은 의심할 바 없는 만유 의 주님으로부터 계시된 성서의 말씀이라이것은 의심할 바 없는 만유 의 주님으로부터 계시된 성서의 말씀이라",
            "verse 32:3": "흑은 그가 그것을 날조하였 다 라고 그들이 말할지 모르나 그러나 그것은 그대 주님으로부터의 계시된 진리이며 이는 그대 이전에 어떠한 경고자도 오지 아니 한 백성에게 그대로 하여금 경고 하여 그들이 인도 받도록 함이라흑은 그가 그것을 날조하였 다 라고 그들이 말할지 모르나 그러나 그것은 그대 주님으로부터의 계시된 진리이며 이는 그대 이전에 어떠한 경고자도 오지 아니 한 백성에게 그대로 하여금 경고 하여 그들이 인도 받도록 함이라",
            "verse 32:4": "하나님께서는 하늘과 땅 그리고 그 사이에 있는 모든 것을 엿 새 동안에 창조하신 후 권자에 오르셨으니 그분이 아니면 너희에겐 어떤 보호자도 중재과도 없노 라 너희는 이를 교훈으로 받아들 이려 하지 않느뇨하나님께서는 하늘과 땅 그리고 그 사이에 있는 모든 것을 엿 새 동안에 창조하신 후 권자에 오르셨으니 그분이 아니면 너희에겐 어떤 보호자도 중재과도 없노 라 너희는 이를 교훈으로 받아들 이려 하지 않느뇨",
            "verse 32:5": "그분은 하늘에서부터 땅에 이르기 까지 만사를 주관하시며 심 판의 날에 모든 것이 그분에게 귀의하니 그 기간은 너희가 헤아리 는 천년과 같으리라그분은 하늘에서부터 땅에 이르기 까지 만사를 주관하시며 심 판의 날에 모든 것이 그분에게 귀의하니 그 기간은 너희가 헤아리 는 천년과 같으리라",
            "verse 32:6": "이분은 보이는 것과 보이지 않는 것도 아시는 분이시며 권능 과 자비로 충만하신 분이시라이분은 보이는 것과 보이지 않는 것도 아시는 분이시며 권능 과 자비로 충만하신 분이시라",
            "verse 32:7": "하나님은 그분이 창조하신 모든 것을 가장 조화있게 두셨으며 인간을 흙에서 창조하기 시작하 셨노라하나님은 그분이 창조하신 모든 것을 가장 조화있게 두셨으며 인간을 흙에서 창조하기 시작하 셨노라",
            "verse 32:8": "이리하여 한방울의 정액으로 부터 인간의 자손을 지으셨노라이리하여 한방울의 정액으로 부터 인간의 자손을 지으셨노라",
            "verse 32:9": "그런 후 그것을 형상으로 만 드사 그 안에 그분의 영혼을 불어넣고 청각과 시각과 심장을 주겼 노라 그러나 너희는 감사하는 마 음이 크지 못하더라그런 후 그것을 형상으로 만 드사 그 안에 그분의 영혼을 불어넣고 청각과 시각과 심장을 주겼 노라 그러나 너희는 감사하는 마 음이 크지 못하더라",
            "verse 32:10": "땅속에 묻혀 흙이 된 후 다시 창조된다는 말이뇨 라고 그들 은 말하도다 그들은 주님과의 만 남을 불신하고 있더라땅속에 묻혀 흙이 된 후 다시 창조된다는 말이뇨 라고 그들 은 말하도다 그들은 주님과의 만 남을 불신하고 있더라",
            "verse 32:11": "일러가로되 너희를 맡고 있는 죽음의 천사가 너희를 임종케 하리니 너희는 너희 주님께로 귀 의하노라일러가로되 너희를 맡고 있는 죽음의 천사가 너희를 임종케 하리니 너희는 너희 주님께로 귀 의하노라",
            "verse 32:12": "죄인들이 그들의 주님께 그들의 고개를 숙이며 주여 저희들 은 지켜 보았으며 들어 보았습니 다 저희가 다시 현세로 돌아가도 록 하여주소서 그리하면 저희가 선을 행하여 믿는 자들이 되리라 하더라죄인들이 그들의 주님께 그들의 고개를 숙이며 주여 저희들 은 지켜 보았으며 들어 보았습니 다 저희가 다시 현세로 돌아가도 록 하여주소서 그리하면 저희가 선을 행하여 믿는 자들이 되리라 하더라",
            "verse 32:13": "만일 하나님의 뜻이 있었다면 하나님은 누구에게나 복음을 주었으리라 그러나 하나님으로부 터 말씀이 실현되리니 하나님께서영마와 사람들 모두로 지옥을 채 우리라만일 하나님의 뜻이 있었다면 하나님은 누구에게나 복음을 주었으리라 그러나 하나님으로부 터 말씀이 실현되리니 하나님께서영마와 사람들 모두로 지옥을 채 우리라",
            "verse 32:14": "너희가 오늘의 만남을 망각하였으매 맛을 보라 또한 하나님 은 너희를 생각치 않으리니 너희 가 저질러온 것에 대해 영원한 벌을 맛보게 하리라너희가 오늘의 만남을 망각하였으매 맛을 보라 또한 하나님 은 너희를 생각치 않으리니 너희 가 저질러온 것에 대해 영원한 벌을 맛보게 하리라",
            "verse 32:15": "말씀이 낭송될 때 하나님의말씀을 믿는 자들은 부복하고 주 님의 영광을 찬미하며 거만하지 아니하노라말씀이 낭송될 때 하나님의말씀을 믿는 자들은 부복하고 주 님의 영광을 찬미하며 거만하지 아니하노라",
            "verse 32:16": "그들의 손발은 그들의 침상을 멀리하고 두려움과 희망으로 그들의 주님을 부르며 우리가 그 들에게 베푼 양식으로 자선을 베 푸노라그들의 손발은 그들의 침상을 멀리하고 두려움과 희망으로 그들의 주님을 부르며 우리가 그 들에게 베푼 양식으로 자선을 베 푸노라",
            "verse 32:17": "아무도 모를 것은 그들이 행한 것에 대한 보상이니 그들을 기 쁘게 할 숨겨진 것이라아무도 모를 것은 그들이 행한 것에 대한 보상이니 그들을 기 쁘게 할 숨겨진 것이라",
            "verse 32:18": "믿음을 가진자가 사악한 자 와 같을 수 있느뇨 그 둘은 결코 같을 수 없나니믿음을 가진자가 사악한 자 와 같을 수 있느뇨 그 둘은 결코 같을 수 없나니",
            "verse 32:19": "믿음을 갖고 선을 행하는 자들은 천국이 그들의 안식처가 되 매 이는 그들이 행한 것에 대한 환대라믿음을 갖고 선을 행하는 자들은 천국이 그들의 안식처가 되 매 이는 그들이 행한 것에 대한 환대라",
            "verse 32:20": "그러나 사악한 자들은 불지 옥이 그들의 거주지거늘 그들이 그곳으로부터 도주하려 할 때마다 그들은 그곳으로 다시 들어가게 되어 불지윽의 벌을 맛보라 이는 너 희가 불신한 것에 대한 죄값이라는말을 그들은 듣게 되리라그러나 사악한 자들은 불지 옥이 그들의 거주지거늘 그들이 그곳으로부터 도주하려 할 때마다 그들은 그곳으로 다시 들어가게 되어 불지윽의 벌을 맛보라 이는 너 희가 불신한 것에 대한 죄값이라는말을 그들은 듣게 되리라",
            "verse 32:21": "하나님은 가장 큰 벌에 앞서 가까운 현세의 벌을 그들로 하여 금 맛보게 하리니 이는 그들이 속 죄하기 위함이라하나님은 가장 큰 벌에 앞서 가까운 현세의 벌을 그들로 하여 금 맛보게 하리니 이는 그들이 속 죄하기 위함이라",
            "verse 32:22": "주님의 말씀을 기억한 후 그 말씀을 배반한 자보다 더 사악함 이 어디에 있느뇨 실로 하나님은 죄인들에게 벌을 내릴 것이라주님의 말씀을 기억한 후 그 말씀을 배반한 자보다 더 사악함 이 어디에 있느뇨 실로 하나님은 죄인들에게 벌을 내릴 것이라",
            "verse 32:23": "하나님은 모세에게 성서를 주었나니 그가 성서를 받았음에 의심하지 말라 하나님은 그것으로이라엘 자손의 복음이 되도록 하 였노라하나님은 모세에게 성서를 주었나니 그가 성서를 받았음에 의심하지 말라 하나님은 그것으로이라엘 자손의 복음이 되도록 하 였노라",
            "verse 32:24": "하나님은 그들 가운데 지도 자들을 두어 그분의 명령으로 그 들을 인도하도록 하였으니 그들이인내할 때라 그들이 또한 그분의 말씀을 믿을 때라하나님은 그들 가운데 지도 자들을 두어 그분의 명령으로 그 들을 인도하도록 하였으니 그들이인내할 때라 그들이 또한 그분의 말씀을 믿을 때라",
            "verse 32:25": "실로 그대의 주님은 심판의 날 그들이 서로 달리xCg던 것들을 심판하시니라실로 그대의 주님은 심판의 날 그들이 서로 달리xC2g던 것들을 심판하시니라",
            "verse 32:26": "하나님이 이전에 많은 세대 를 멸망시킨 것이 그들에게 교훈 이 되지 아니 했느뇨 그들의 거주지에서 그들은 지금도 방황하고 있느뇨 실로 그 안에는 말씀이 있건만 그들은 듣지 아니 함이라하나님이 이전에 많은 세대 를 멸망시킨 것이 그들에게 교훈 이 되지 아니 했느뇨 그들의 거주지에서 그들은 지금도 방황하고 있느뇨 실로 그 안에는 말씀이 있건만 그들은 듣지 아니 함이라",
            "verse 32:27": "메마른 황무지에 물을 대어 그것으로 농작물을 재배케하여 그들의 가축들과 그들 자신들이 그 로부터 섭취하도록 했음을 그들은알지 못하고 보지도 못하느뇨메마른 황무지에 물을 대어 그것으로 농작물을 재배케하여 그들의 가축들과 그들 자신들이 그 로부터 섭취하도록 했음을 그들은알지 못하고 보지도 못하느뇨",
            "verse 32:28": "만일 그대가 진실이라면 언 제 심판이 오느뇨 라고 그들이 물으매만일 그대가 진실이라면 언 제 심판이 오느뇨 라고 그들이 물으매",
            "verse 32:29": "일러가로되 심판의 날 불신 한 자들의 믿음은 유용함이 없으 며 그들에게는 믿음을 가질 기회 도 기다리지 아니 함이라일러가로되 심판의 날 불신 한 자들의 믿음은 유용함이 없으 며 그들에게는 믿음을 가질 기회 도 기다리지 아니 함이라",
            "verse 32:30": "그러하매 그들로부터 멀리하고 기다리라 그들은 실로 그날을 기다리고 있을 뿐이라그러하매 그들로부터 멀리하고 기다리라 그들은 실로 그날을 기다리고 있을 뿐이라"
        },
        "Kurdish": {
            "verse 32:1": "Elîf, Lam, Raسه‌رنجی سه‌ره‌تای سووره‌تی (البقرة) بده‌.",
            "verse 32:2": "Daxistina kitêbê tu dudilî tê nîne ku ji perwerdekarê cîhanê yeدابه‌زاندنی ئه‌م قورئانه له‌لایه‌ن په‌روه‌ردگاری جیهانیانه‌وه هیچ گومانی تێدانیه‌.",
            "verse 32:3": "Ma qey ew dibêjin ku: \"Wî bi derew ji ber xwe ve çêkiriye.\" Ne, ew rastiyek e ji perwerdekarê te ji bo tu komelekî ku berî te tu hiþyarker ji wan re nehatine hiþyar bikî. Hêvî heye rast bibîninئایا خوانه‌ناسان ده‌ڵێن: (محمد صلی الله علیه وسلم) ئه‌م قورئانه‌ی هه‌ڵبه‌ستووه‌؟ نه‌خێر وانی یه‌، به‌ڵکو قورئان حه‌ق و ڕاسته و له‌لایه‌ن پروه‌ردگارته‌وه نێردراوه‌، بۆ ئه‌وه‌ی قه‌وم و هۆزێک بێدار بکه‌یته‌وه که پێش تۆ بێدارخه‌ره‌وه‌یه‌کیان بۆ نه‌هاتووه‌، تاڕێگه‌ی هیدایه‌ت و ئیمان بگرنه‌به‌ر.",
            "verse 32:4": "Xuda ye ê ku asîmana û zemîn û tiþtê navbera wan de di þêþ rojan de aferand, paþê ser text vegirt. Ji we re bêyî wî ne tu yar û yawer û ne jî tu mehdervan hene. Ma hûn hêjî nafikirin-þîret nagirinخوا ئه‌و زاته‌یه که ئاسمانه‌کان و زه‌وی و هه‌رچی له نێوانیاندا هه‌یه له شه‌ش ڕۆژدا دروستی کردووه (مه‌رج نیه دڕێژی ئه‌و ڕۆژانه به‌قه‌ده‌ر دڕێژی شه‌و و ڕۆژی زه‌وی بێت که به بیست و چوار سه‌عات جارێک به‌ده‌وری خۆیدا ده‌سوڕێته‌وه‌، چونکه هه‌ندێک ڕۆژ هه‌روه‌ک قورئان خۆی ئاماژه‌ی بۆ ده‌کات هه‌زار ساڵه‌، هه‌ندێکی تری په‌نجا هه‌زار ساڵه‌)، پاشان خوا له‌سه‌ر ته‌ختی فه‌رمانڕه‌واییه‌وه سه‌رپه‌رشتی کارو فرمانی دروستکراوانی ده‌کات و ئه‌وه‌ی ئه‌و عیلمی پێی هه‌یه و ده‌یزانێت و ده‌یه‌وێت، هه‌ر ئه‌وه پێش دێت، (سه‌رنجی ئایه‌تی _2_الرعد بده‌)، خه‌ڵکینه جگه له‌و خوایه‌که‌س نیه پشتیوانیتان لێ بکات یان تکا کارتان بێت، ئایه یاداوه‌ری وه‌رده‌گرن و تێده‌گه‌ن.",
            "verse 32:5": "Ji asîman heya bi zemîn tevdîra kae ew dike, paþê ew (kar) di rojekî ku biqasî hezar salê hûn dijmêrin ne, bal ve bilind dibeئه‌و خوایه له ژوور ئاسمانه‌وه کاروباری زه‌وی ڕێک ده‌خات و سه‌رپه‌رشتی ده‌کات، له‌وه‌ودوا ڕووداوه‌کان و به‌سه‌رهاته‌کان و کارو کرده‌وه‌ی به‌نده‌کان ده‌گه‌رێته‌وه بۆ لای، له ڕۆژێکدا که به‌رامبه‌ر هه‌زار ساڵه به‌و حسابه‌ی ئێوه که ده‌یکه‌ن.",
            "verse 32:6": "Zanayê bi penhan û peyda, serkeftiyê dilovan her evê hayeئا ئه‌و خوایه زانایه به نهێنی و ئاشکراکان، له هه‌مان کاتدا خاوه‌ن ده‌سه‌ڵات و میهره‌بانیشه‌.",
            "verse 32:7": "Ewê ku her tiþtê aferandiye rind çêkiriye û aferandina mirov jî ji heriyê dest pê kiriyeئه‌و خوایه زاتێکه هه‌موو شتێکی به‌چاکی و ڕێکوپێکی به‌دیهێناوه‌، له‌سه‌ره‌تاوه ئاده‌میزادی له قوڕ دروست کردووه‌.",
            "verse 32:8": "Paþê nifþa wî ji dilopek telape ji avekî bereday-bêkêr çêkirپاشان زنجیره‌ی نه‌وه‌کانی له ئاوێکی ساده و بێنرخ به‌دیهێناوه‌.",
            "verse 32:9": "Paþê wî li hev rast kir û ji canê xwe tê pif kir, û ji we re goh û çav û dilan çêkir. Hûn çiqas hindik sipas dikinپاشان ئاده‌میزاده به‌ڕێک و پێکی ڕێکخست، له ڕوح و گیانێک که خۆی خاوه‌نیه‌تی فووی پێداکرد، ئینجا ده‌زگای بیستن و بینین و لێکدانه‌وه‌ی پێبه‌خشیون، که‌متان سوپاسگوزارن.",
            "verse 32:10": "Û gotin: \"Ma gava em (hûr bibin) di axê de hinda bibin, ma bera emê bi aferandineke nû bên aferandin?\" Ne, ew bi pergîhatina perwerdekarê xwe kafir in(له‌گه‌ڵ ئه‌و هه‌موو به‌ڵگه به‌هێزانه‌دا) خوانه‌ناسان ده‌یانوت: ئایه ئه‌گه‌ر مردین و بزر بووین له توێی خاکی زه‌ویدا، ئایا جارێکی تر سه‌رله‌نوێ دروست ده‌کرێینه‌وه‌؟! نه‌خێر ون نابن! به‌ڵکو ئه‌وانه (هه‌ر قسه‌ی به‌تاڵ و پڕوپوچ ده‌که‌ن ئه‌گینا له بنه‌ڕه‌تدا به ئاماده بوونی به‌رده‌م باره‌گای په‌روه‌ردگاریان) بێ باوه‌ڕن...",
            "verse 32:11": "Tu bêje: \"Feriþtê ku can sitendina we pê hatiye sipartin wê canê we bistîne, paþê hûnê bal perwerdekarê xwe ve bêne vegerandinجا پێیان بڵێ: فریشته‌ی گیان کێشان که کاری گیان کێشانتانی پێ سپێردراوه ده‌تانمرێنێت، له‌وه‌ودوا بۆلای په‌روه‌ردگارتان ده‌برێنه‌وه‌.",
            "verse 32:12": "Eger te sûcdarên gunehkar bidîtana gava sitûyê xwe li cem perwerdekarê xwe xor kiribûn (û digotin:) \"Perwerdekarê me! me dît û me bihîst, êdî tu me vegerîne ku em karê qenc bikin; bêguman em ji dil bawer in\" (te yê pirr sosreta bidîtana)ئه‌گه‌ر ده‌تبینی کاتێك ئه‌و تاوانبارانه (که باوه‌ڕیان به‌زیندوو بوونه‌وه نه‌بوو) خه‌جاڵه‌ت و سه‌رشۆڕن له‌به‌رده‌م دادگای خواییدا، ده‌ڵێن: په‌روه‌ردگارا ئه‌وه ئیتر به‌چاوی خۆمان بینیمان، به گوێی خۆمان بیستمان ئه‌وه‌ی بڕوامان پێی نه‌بوو، ئێسته‌ش ئێمه بگێڕه‌وه بۆ دنیا مه‌رج بێت هه‌ر کارو کرده‌وه‌ی چاکه ئه‌نجام بده‌ین، ئێمه ئێسته ته‌واو دڵنیاین..!!",
            "verse 32:13": "Eger me bixwesta, me yê her kesî rêberiya wî bidanayê, lê belê gotin ji min pêwist bû ku ezê hey dojehê ji cinn û mirovan tev tije bikimبێگومان ئه‌گه‌ر بمانوویستایه هه‌موو که‌سێکمان هیدایه‌ت و ڕێنموویی ده‌کرد (به‌ناچاری و به‌بێ ویستی خۆیان)، به‌ڵام بڕیاری من ئه‌وه‌یه (که ئاده‌میزاد و په‌ریه‌کان سه‌ربه‌ست و سه‌رپشك و ئازاد بکه‌م، سه‌رئه‌نجامیش) هه‌ر دۆزه‌خ پڕ ده‌که‌م له په‌ریه‌کان و له خه‌ڵکی تێکرا، (له‌وانه‌ی بڕوایان به خواو پێغه‌مبه‌ره‌کانی نه‌بوو).",
            "verse 32:14": "Vêca (dergevanê dojehê ji wan re dibêjin ku:) \"Hûn bi sedem ku we pergîhatina vê roja xwe ya han ji bîr kiribû, tam bikin. Bêguman me jî we ji bîr kiriye, û hûn bi sedem tiþtê we dikir ezabê hertimî tam bikinده‌ی که‌واته بچێژن ماده‌م ئێوه ئه‌م ڕۆژه‌تان فه‌رامۆش کرد، ئێمه‌ش به‌ڕاستی ئێوه پشتگوێ ده‌خه‌ین، بچێژن ئێش و سزای نه‌بڕاوه‌، له سه‌رئه‌نجامی کارو کرده‌وه‌یه‌ك که ده‌تانکرد.",
            "verse 32:15": "Bêguman bi ayetên me, tenê ewên ku gava di bîra wan tê xistin ew ser dev û rû dikevin secde dibin û bi pesn û sipasê perwerdekarê xwe wî (ji her kêmasiyî) pak bêrî didêrin û ew quretiya nakin bawerî tîninبه‌ڕاستی ته‌نها ئه‌وانه بڕوا به ئایه‌ته‌کانی ئێمه ده‌هێنن، کاتێك یاداوه‌ری ده‌کرێن پێی، خێرا سوژده ده‌به‌ن ته‌سبیحات و سوپاسگوزاری په‌روه‌ردگاریان ده‌که‌ن، له کاتێکدا ئه‌وانه به هیچ شێوه‌یه‌ك فیزیان نیه و خۆیان به‌گه‌وره نازانن.",
            "verse 32:16": "Ew teniþtên wan ji livîna bilind dibe (radibin limêja þevê) bi tirs û hêvî gazî perwerdekarê xwe dikin-wî dihebînin û ji tiþtê me rozî daye wan didin(ئه‌و ئیمانداره به‌خته‌وه‌رانه‌) نێوانیان خۆش نیه له‌گه‌ڵ ڕاکشان له جێگه‌و ڕێگه‌و ڕێگه‌ی گه‌رم و نه‌رما (واته به‌نوێژو خواپه‌رستی به‌شێکی شه‌و ده‌به‌نه سه‌ر)، هه‌میشه نزاو پاڕانه‌وه‌یان ڕوو به په‌روه‌ردگاریانه له خه‌شم و قین و دۆزه‌خی ده‌ترسن، ئاواتی ڕه‌زامه‌ندی و به‌هه‌شتیان هه‌یه و له‌و ڕزق و ڕۆزی و توانایی و زانیاریه‌ی پێمه‌ن به‌خشیوون ده‌به‌خشن.",
            "verse 32:17": "Vêca tu kes nizane ku bergîdana tiîtê kirine çi çavronahî ji wan re hatine veþartinجا هیچ که‌س له‌و به‌خته‌وه‌رانه نازانێت چی بۆهه‌ڵگیراوه وشاراوه‌ته‌وه له نازو نیعمه‌تی جۆراوجۆر لای په‌روه‌ردگاری، که چاوان پێی گه‌ش ده‌بنه‌وه و به‌دیتنی شاد ده‌بن، له پاداشتی کارو کرده‌وه‌ی چاك و پاکیاندا که ئه‌نجامیان ده‌دا.",
            "verse 32:18": "Vêca ma ê bawermend be wekî ê jirêderketî ye? Ew ne wek hev inئایا ئه‌و که‌سه‌ی ئیماندار بوو بێت وه‌ك ئه‌و که‌سه‌یه که تاوانبار بوو بێت؟ وه‌ك یه‌ك نین...",
            "verse 32:19": "Heçî ên bawerî anîne û karên qenc kirine, êdî ji wan re bihiþtê hewyegehê hene, ew ji ber tiþtê kirine ve di qonaxan de têne mazûrvanî kirinبه‌ڵکو ئه‌وانه‌ی که باوه‌ڕیان هێناوه و کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، شوێنیان باخچه‌کانی به‌هه‌شته (که بۆ هه‌میشه جێگه‌ی حه‌وانه‌وه و حه‌سانه‌وه‌یانه‌)، هه‌ر له‌وێ داده‌به‌زن، له پاداشتی کارو کرده‌وه‌یه‌ك که ده‌یانکرد.",
            "verse 32:20": "Û heçî ên ji rê derketine jî, êdî hewyegeha wan agir e. Her cara ew bixwazin ku jê derên ew tê de paþve têne zivirandin û ji wan re tê gotin ku: \"Hûn ezabê agirê ku we wî diderewand tam bikinئه‌وانه‌ش تاوانبار یاخی بوون، شوێنیان ناو ئاگری دۆزه‌خه‌، هه‌ر کاتێك ویستیان لێی ده‌رچن، ده‌گێڕدرێنه‌وه بۆ ناوی، پێیان ده‌وترێت: بچێژن سزای ئه‌و ئاگره‌ی که بڕواتان پێی نه‌بوو.",
            "verse 32:21": "Sond be, emê berî ezabê herî mezin ji ezabê kêmtir (êþ û nexweþiyê dinê) bi wan bidin tam kirin, hêvî heye ku ew vegerinسوێند به‌خوا ئێمه تاڵاو له دنیادا ده‌که‌ین به‌گه‌رویاندا، بێجگه له سزای ڕیشه‌که‌نکردنیان، بۆئه‌وه‌ی هۆش و بیربکه‌نه‌وه‌و بیرێك بکه‌نه‌وه و بگه‌ڕێنه‌وه بۆ لای ئیمان.",
            "verse 32:22": "Ji kesê ku ayetê perwerdekarê wî di bîrê bêne xistin, paþê ew rû ji wan bizivrîne sitemkartir kî heye? Bêguman em, ji sûcdarên gunehkar hey heyfstan inجا کێ له‌و که‌سه سته‌مکارتره که به فه‌رمووده‌کانی خوا یاداوه‌ری و ئامۆژگاری کرابێت، پاشان پشتی لێ هه‌ڵکربێت و گوێی پێنه‌دات، به‌ڕاستی ئێمه تۆڵه له تاوانبارو تاوانکاران ده‌ستێنین.",
            "verse 32:23": "Sond be, me kitêbê da Mûsa, êdî tu di pergîhatina wî de dudilî nebe, û me wî ji zariyê Îsraîl re kire rêberسوێند به خوا به‌ڕاستی ئێمه ته‌وراتمان به‌خشی به موسا، تۆ (ئه‌ی محمد صلی الله علیه وسلم) هیچ گومانت نه‌بێت له دیداری موساو له‌وه‌ش که ته‌ورات له‌لایه‌ن ئێمه‌وه به‌خشراوه به‌و، ئه‌و کاته ئێمه ته‌وراتمان کرد به ڕێنموویی بۆ نه‌وه‌ی ئیسرائیل.",
            "verse 32:24": "Û me, ji wana çi gava bîhna fireh nîþan dan hin pêþwayan çêkir ku bi fermana me rêberî dikin û ew bi ayetên me ji dil bawer bûnپاشان که نه‌وه‌ی ئیسرائیل خۆگری و ئارامیان کرده پیشه‌یان کردمانن به پێشه‌واو ده‌سه‌ڵاتمان پێبه‌خشین، ئه‌و کاته دڵنیایی و بڕوایه‌کی ته‌واویان هه‌بوو به ئایه‌ته‌کانی ئێمه (شایسته‌ی ئه‌و ڕێزه بوون).",
            "verse 32:25": "Bêguman perwerdekarê te, wê roja qiyametê wan di tiþtê ku ew tê de bi hev ketine ji hev biqetîneبه‌ڕاستی په‌روه‌ردگارت خۆی (دوای ئه‌وه‌ی که بوونه چه‌نده‌ها ده‌سته و گرۆ) له ڕۆژی قیامه‌تدا له‌یه‌ك جیایان ده‌کاته‌وه‌، چاك و خراپیان دیاری ده‌کات له‌و شتانه‌دا که‌وا ئه‌وان کێشه‌یان تێدا ده‌کرد و ڕووبه‌ڕوی یه‌ك ده‌بوونه‌وه و به‌رامبه‌ر یه‌ك ده‌وه‌ستانه‌وه‌.",
            "verse 32:26": "Ma ji wan re rêberî nekiriye ku me berî wan çiqas nifþa qelandiye tevî ku ew di þûnwarên wan de diçin û tên jîئایا ئه‌وه په‌ندو ئامۆژگاری وه‌رناگرن له‌وه‌ی: ئێمه پێش ئه‌مان چه‌نده‌ها جیل و نه‌وه‌مان له‌ناوبردوه‌، به‌ناو ماڵه‌کانیاندا دێن و ده‌چن، به‌ڕاستی ئا له‌و دیمه‌نانه‌دا به‌ڵگه‌ی زۆر به‌هێز هه‌یه له‌سه‌ر ده‌سه‌ڵاتی ئێمه‌، ئایا ئه‌وه نابیستن؟!",
            "verse 32:27": "Bêguman di vî de gellek ayet hene. Ma ew hêjî nabihîzinئایا سه‌رنجیان نه‌داوه که به‌ڕاستی چۆن ئێمه ئاوکێش ده‌که‌ین و ده‌یبه‌ین بۆ زه‌وی وزاری وشك و بێ ڕوه‌ك جا به‌و ئاوه ڕوه‌ك و گژوگیا ده‌رده‌هێنین که ماڵاتیان و خۆیشیان لێی ده‌خۆن، ئایا ئه‌وه نابینن و سه‌رنج ناده‌ن؟!",
            "verse 32:28": "Ew dibêjin: \"Eger hûn bera rastgo ne ka ev pîroziya han kîngê yeبێ باوه‌ڕان ده‌ڵێن: باشه‌، ئه‌وه که‌ی ئه‌م جیاکردنه‌وه و سه‌رکه‌وتنی ئیمانداره پێش دێت، ئه‌گه‌ر ڕاست ده‌که‌ن؟!",
            "verse 32:29": "Tu bêje ku: \"Roja pîroziyê, baweriya ên kafir bûne hew bikêra wan tê û ew li bendê jî nayên mayînئه‌ی محمد صلی الله علیه وسلم پێیان بڵێ: ڕۆژی جیاکردنه‌وه و سه‌رکه‌وتنی ئیمان، باوه‌ڕهێنانی کافران هیچ سوودی نابێت بۆیان، هیچ مۆڵه‌تیشیان نادرێت (په‌شیمانییش سوودی نابێت).",
            "verse 32:30": "Vêca tu rû ji wan bizivrîne û li bendê be. Bêguman ew jî li bendê neجا تۆ ڕوویان لێ وه‌رگێڕه و گوێیان مه‌ده‌رێ، به‌ڵکو چاوه‌ڕوان به‌، به‌ڕاستی ئه‌وانه چاوه‌ڕوانن!!"
        },
        "Kyrgyz": {
            "verse 32:1": "Алиф. Лам. Мим",
            "verse 32:2": "(Бул) Китептин түшүрүлүүсү ааламдардын Раббиси тарабынан. Анда (эч бир) шек-күмөн жок",
            "verse 32:3": "Же болбосо алар (Макка мушриктери) «аны (Мухаммад) ойунан чыгарып (жазып) алды» дешеби? Жок (андай эмес). Ал Раббиң тарабынан (мушрик) коомду эскертишиң үчүн (берилген) Акыйкат. Аларга сенден мурун эскертүүчү (пайгамбар) келген эмес.” Кана эми, Туура Жолго түшүп калышса",
            "verse 32:4": "Аллаһ асмандарды, жерди жана ал экөөсүнүн арасындагы (бардык жандуу-жансыз) нерселерди алты күндө жаратып, кийин Арштан Бийик болду?. Силер үчүн Аллаһтан башка дос-башчы да шапаат кылуучу да жок. Эсиңерге келбейсинерби",
            "verse 32:5": "Асмандан жерге чейин (бардык) ишти (Аллаһ Өз өкүмү менен) башкарат. Кийин силердин эсебиңерде миң жылга барабар болгон бир эле күндө (ал өкүмдөрдүн жыйынтыгы) Өзүнө көтөрүлөт",
            "verse 32:6": "Ушул (Аллаһ) кайыпты да ашкерени да билүүчү Кудуреттүү (жана) Ырайымдуу",
            "verse 32:7": "Алар бир нерсени эң мыкты жараткан жана инсандын алгачкы жаралышын ылайдан жасаган",
            "verse 32:8": "Кийин анын урпактарын жийиркеничтүү (бир тамчы) суудан жаратты",
            "verse 32:9": "Кийинаны (кадыресе адам кейипинде) ырастап-келиштирди жана ага Өзүнүн Рухунан үйлөдү.! Жана (Аллаһ) силерге кулактарды, көздөрдү жана жүрөктөрдү жаратты. Аз шүгүр кылып жатасыңар",
            "verse 32:10": "(Мушриктер) айтышат: «Эгер биз жерде (чирип) жок болуп кетсек да жаңыдан жаратылат бекенбиз?!» Жок! Алар Раббилерине жолугууга ишенишпейт",
            "verse 32:11": "Сен айткын: «Силерге өкүл кылынган (дайындалган) өлүм периштеси? жаныңарды алат. Кийин (Кыяматта кайра тирилип) Раббиңерге кайтарыласыңар»",
            "verse 32:12": "(О, Мухаммад!) Эгер сен күнөөкөр (каапыр) адамдарды, Раббилеринин алдында баштарын шылкыйтып: «О, Рабби! (Кыяматтын жана кайра тирилүүнүн бар экенин) көрдүк, уктук. Эми бизди артка кайтар, анык ишенүүчү болгон абалда салих амал кылабыз» дегенин бир көрсөң эле",
            "verse 32:13": "Эгер Биз кааласак, ар бир жанга өз хидаятын (Туура Жолун) бере алмакпыз. Бирок, Менин: «Бардык (каапыр) инсандар жана (каапыр) жиндер менен тозокту толтурамын!»-деген сөзүм акыйкат (өкүм) болуп калган",
            "verse 32:14": "(Тозокко ташталып жаткан мушриктерге:) «Эми, ушул күнүңөрдөгү жолугушууну унут-каныңар себептүү (азап) тарткыла! Биз да силерди «унуттук». Жана кылмышыңарга жараша түбөлүк азапты тарткыла!»-(деп айтылат)",
            "verse 32:15": "Чынында, Биздин аяттарыбызга, аларды эскертилгенде сажда кылган абалда жыгылган жана текеберленбей Раббисине мактоолор айткан адамдар ыйман келтиришет",
            "verse 32:16": "Алардын жамбаштары (өздөрү) жатаар орундарынан ыраак (көбүнчө ибадатта) болушат (жана) коркуп, үмүт кылып Раббисине дуба кылышат. Жана Биз ырыскы кылып берген нерселерден садака кылышат",
            "verse 32:17": "Эч бир (момун) жан, жасаган (жакшы) иштери үчүн өздөрүнө (Бейиште) жашыруун даярдап коюлган кубанычтарды билбейт",
            "verse 32:18": "Момун (пакиза) адамдар бузук (күнөөкөр) адамга окшойбу? Жок, тең болбойт",
            "verse 32:19": "Ал эми, ыйман келтирип, салих амал кылган адамдар үчүн Бейиш орундары бар. Жасаган амалдарына жараша зыяпат иретинде",
            "verse 32:20": "Бузук (каапыр) адамдардын жайы-тозок! Ар качан андан чыгууга аракеттенишсе, ага кайтарылышат жана аларга: «Өзүңөр «жалган» деген тозоктун азабын таткыла!»-деп айтылат",
            "verse 32:21": "Жана эч бир шексиз Биз аларга чоң азапка чейин, жакыныраак (төмөнүрөөк) азапты да таттырабыз. Кана эми, (ушуну ойлоп күнөөлөрүнөн) кайтышса",
            "verse 32:22": "Раббисинин аяттары эскертилгенден соң алардан жүз буруп кеткен адамдан өткөн заалым (каапыр) барбы?! Биз албетте, кылмышкер адамдардан өч алабыз",
            "verse 32:23": "Биз чынында Мусага Китепти (Тооратты) бердик. (О, Мухаммад!) сен анын (Тооратка) жолукканы жөнүндө шек-күмөндө болбогун! Биз Тооратты Исрайил урпактарына хидаят (Туура Жол) кылдык",
            "verse 32:24": "Жана Биз Исрайил урпактарынын арасынан, сабырдуулук көргөзгөн мезгилдеринде, Туура Жолго баштаган жолбашчы-имамдарды чыгардык. Алар Биздин аяттарыбызга бекем ишенишчү",
            "verse 32:25": "Албетте, Сенин Раббиң, Кыямат Күндө алар талашкан маселелерде, алардын арасында Бир Өзү ажырым кылып берет",
            "verse 32:26": "Аларга чейин нечендеген (каапыр) муундарды (өз пайгамбарын «жалганчы» дегени себептүү) кырып-жоюп салганыбыз аларды Туура Жолго баштабайбы?! Ошолордун жашаган жерлеринен (ары-бери) өтүп жүрүшөт го?! Чынында, бул нерседе (Аллаһтын кудуретине) чоң белгилер бар. (Аллаһтын аяттарына) кулак салышпайбы",
            "verse 32:27": "Алар ойлонушпайбы, Биз суусаган жерге суу айдап, аны менен өздөрү жана айбандары жей турган өсүмдүктөрдү чыгардык. (Кудуретибизди) көрүшпөйбү",
            "verse 32:28": "Жана (момундарга): «Эгер чынчыл болсоңор (айткылачы), бул ачылыш! (Кыямат) качан болот?»-дешет",
            "verse 32:29": "Айткын: «Ачылыш (Кыямат) күнү каапырларга ыймандары пайда бербейт жана аларга (тооба кылуу үчүн) да мөөнөт берилбейт",
            "verse 32:30": "(О, Мухаммад!) Сен алардан жүзүңдү бур жана күтө бер алар да күтүп жатышат"
        },
        "Malay": {
            "verse 32:1": "Alif, Laam Miim.",
            "verse 32:2": "Diturunkan Al-Quran ini, dengan tidak ada sebarang syak padanya, dari Tuhan yang memelihara dan mentadbirkan sekalian alam.",
            "verse 32:3": "(Orang-orang kafir tidak mengakui hakikat yang demikian) bahkan mereka mengatakan: \"Dia lah (Muhammad) yang mengada-adakan Al-Quran menurut rekaannya\". (Dakwaan mereka itu tidaklah benar) bahkan Al-Quran ialah perkara yang benar dari Tuhanmu (wahai Muhammad), supaya engkau memberi ingatan dan amaran kepada kaum (mu) yang telah lama tidak didatangi sebarang pemberi ingatan dan amaran sebelummu, semoga mereka beroleh hidayah petunjuk.",
            "verse 32:4": "Allah Tuhan yang menciptakan langit dan bumi serta segala yang ada di antara keduanya dalam enam masa, kemudian Ia bersemayam di atas Arasy; kamu tidak akan beroleh sebarang penolong dan pemberi syafaat selain dari Allah; oleh itu tidakkah kamu mahu insaf dan mengambil iktibar (untuk mencapai keredaanNya)?",
            "verse 32:5": "Allah mentadbirkan makhluk-makhlukNya; (bagi melaksanakan tadbirNya itu Ia menurunkan segala sebab dan peraturan) dari langit ke bumi; kemudian diangkat naik kepada pengetahuanNya (segala yang berlaku dari perlaksanaan tadbirNya itu untuk dihakimiNya) pada suatu masa yang (dirasai oleh orang-orang yang bersalah) banyak bilangan tahunnya menurut hitungan masa kamu yang biasa.",
            "verse 32:6": "Yang demikian sifatnya ialah Tuhan yang mengetahui perkara-perkara yang ghaib dan yang nyata; Yang Maha Kuasa, lagi Maha Mengasihani;",
            "verse 32:7": "Yang menciptakan tiap-tiap sesuatu dengan sebaik-baiknya, dan dimulakanNya kejadian manusia berasal dari tanah;",
            "verse 32:8": "Kemudian Ia menjadikan keturunan manusia itu dari sejenis pati, iaitu dari air (benih) yang sedikit dipandang orang;",
            "verse 32:9": "Kemudian Ia menyempurnakan kejadiannya, serta meniupkan padanya: roh ciptaanNya. Dan Ia mengurniakan kepada kamu pendengaran dan penglihatan serta hati (akal fikiran), (supaya kamu bersyukur, tetapi) amatlah sedikit kamu bersyukur.",
            "verse 32:10": "Dan mereka (yang kafir) itu berkata: \"Adakah apabila kami telah hilang lenyap dalam tanah, kami pula akan hidup semula dalam bentuk kejadian yang baharu? Betulkah demikian? \" (Mereka bukan sahaja tidak percaya tentang hidup semula) bahkan mereka tidak percaya tentang pertemuan dengan Tuhannya.",
            "verse 32:11": "Katakanlah (wahai Muhammad); \"Nyawa kamu akan diambil oleh Malikil Maut yang ditugaskan berbuat demikian ketika habis ajal kamu, kemudian kamu akan dikembalikan kepada Tuhan kamu (untuk menerima balasan)\".",
            "verse 32:12": "Dan (sungguh ngeri) sekiranya engkau melihat ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhan mereka (dalam keadaan malu dan hina, sambil merayu): \"Wahai Tuhan kami, kami telah melihat dan mendengar dengan sejelas-jelasnya (akan segala yang kami ingkari dahulu); maka kembalikanlah kami ke dunia supaya kami mengerjakan amal-amal yang baik; sesungguhnya kami sekarang telah yakin\".",
            "verse 32:13": "Dan (bagi menolak rayuan itu Allah Taala berfirman): \"Kalaulah Kami telah tetapkan persediaan (memberikan hidayah petunjuk untuk beriman dan beramal soleh kepada tiap-tiap seorang dengan ketiadaan usaha dari masing-masing), nescaya Kami berikan kepada tiap-tiap seorang akan hidayah petunjuknya (sebelum masing-masing meninggal dunia, supaya tidak terkena azab di akhirat); tetapi telah tetap hukuman seksa dariKu: ` Demi sesungguhnya! Aku akan memenuhi neraka Jahannam dengan semua jin dan manusia (yang pada masa hidupnya tidak berusaha untuk beriman dan beramal soleh)\".",
            "verse 32:14": "(Lalu dikatakan kepada mereka: \"Oleh sebab kelalaian kamu) maka rasalah azab seksa kerana kamu melupai pertemuan hari kamu ini. Sesungguhnya Kami pun tidak hiraukan keselamatan kamu lagi; dan (dengan yang demikian) rasalah azab yang kekal dengan sebab apa yang kamu telah kerjakan\".",
            "verse 32:15": "Sesungguhnya yang sebenar-benar beriman kepada ayat-ayat keterangan Kami hanyalah orang-orang yang apabila diberi peringatan dan pengajaran dengan ayat-ayat itu, mereka segera merebahkan diri sambil sujud (menandakan taat patuh), dan menggerakkan lidah dengan bertasbih serta memuji Tuhan mereka, dan mereka pula tidak bersikap sombong takbur.",
            "verse 32:16": "Mereka merenggangkan diri dari tempat tidur, (sedikit sangat tidur, kerana mengerjakan sembahyang tahajjud dan amal-amal soleh); mereka sentiasa berdoa kepada Tuhan mereka dengan perasaan takut (akan kemurkaanNya) serta dengan perasaan ingin memperolehi lagi (keredaanNya); dan mereka selalu pula mendermakan sebahagian dari apa yang Kami beri kepada mereka.",
            "verse 32:17": "Maka tidak ada seseorang pun yang mengetahui satu persatu persediaan yang telah dirahsiakan untuk mereka (dari segala jenis nikmat) yang amat indah dipandang dan mengembirakan, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan.",
            "verse 32:18": "(Jika demikian halnya) maka adakah orang yang beriman sama seperti orang yang fasik? Mereka tidaklah sama (dalam menerima balasan).",
            "verse 32:19": "Adapun orang-orang yang beriman dan beramal soleh, maka mereka akan beroleh Syurga tempat tinggal yang tetap sebagai balasan bagi apa yang mereka telah kerjakan.",
            "verse 32:20": "Dan sebaliknya orang-orang yang fasik, maka tempat kediaman mereka ialah neraka; tiap-tiap kali mereka hendak keluar dari neraka itu, mereka dikembalikan kepadanya, serta dikatakan kepada mereka: \"Rasalah azab neraka yang kamu sentiasa mendustakannya di dunia dahulu\".",
            "verse 32:21": "Dan demi sesungguhnya, Kami akan merasakan mereka sedikit dari azab dunia sebelum azab yang besar (di akhirat kelak), supaya mereka rujuk kembali bertaubat.",
            "verse 32:22": "Dan tidaklah ada yang lebih zalim daripada orang yang diberi ingat dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya (dan tetap mengingkarinya); sesungguhnya Kami tetap membalas.",
            "verse 32:23": "Dan demi sesungguhnya! Kami telah memberi kepada Nabi Musa Kitab Taurat (sebagaimana Kami berikan Al-Quran kepadamu wahai Muhammad), maka janganlah engkau ragu-ragu menyambut dan menerimanya; dan Kami jadikan Kitab Taurat itu hidayah penunjuk bagi kaum Bani Israil.",
            "verse 32:24": "Dan Kami jadikan dari kalangan mereka beberapa pemimpin, yang membimbing kaum masing-masing kepada hukum ugama Kami, selama mereka bersikap sabar (dalam menjalankan tugas itu) serta mereka tetap yakin akan ayat-ayat keterangan Kami.",
            "verse 32:25": "(Pertentangan di antara satu golongan dengan yang lain itu) sesungguhnya Tuhanmu sahajalah yang akan memutuskan hukumNya di antara mereka pada hari kiamat, mengenai apa yang mereka berselisihan padanya.",
            "verse 32:26": "Dan belumkah lagi ternyata kepada mereka (yang kafir itu): bahawa Kami telah binasakan berapa banyak dari kaum-kaum yang kufur ingkar dahulu daripada mereka, padahal mereka sekarang berulang-alik melalui tempat-tempat tinggal kaum-kaum itu? Sesungguhnya kebinasaan kaum-kaum itu mengandungi keterangan-keterangan (untuk mengambil iktibar); oleh itu tidakkah mereka mahu mendengar (dan insaf)?",
            "verse 32:27": "Dan tidakkah mereka (yang tidak mahu taat dan bersyukur) itu melihat bahawasanya Kami mengarahkan turunnya hujan ke bumi yang kering kontang, lalu Kami tumbuhkan dengan air hujan itu tanaman-tanaman, yang daripadanya dimakan oleh binatang-binatang ternak mereka dan mereka sendiri? Maka mengapa mereka tidak mahu memerhati (semuanya itu supaya taat dan bersyukur)?",
            "verse 32:28": "Dan mereka bertanya: \"Bilakah datangnya hari pembukaan bicara yang dikatakan itu jika betul kamu orang-orang yang benar?\"",
            "verse 32:29": "Katakanlah (wahai Muhammad): \"(Tidak perlu diketahui masa datangnya tetapi mesti dipercayai bahawa) pada hari pembukaan bicara itu, tidak ada gunanya lagi kepada orang-orang kafir kiranya mereka hendak beriman, dan mereka pula tidak akan diberi tempoh (berbuat demikian)\".",
            "verse 32:30": "Oleh itu, janganlah engkau hiraukan mereka, dan tunggulah (kesudahan mereka), sesungguhnya mereka pun menunggu (kesudahanmu)."
        },
        "Malayalam": {
            "verse 32:1": "അലിഫ്‌-ലാം-മീം",
            "verse 32:2": "ഈ ഗ്രന്ഥത്തിന്‍റെ അവതരണം സര്‍വ്വലോകരക്ഷിതാവിങ്കല്‍ നിന്നാകുന്നു. ഇതില്‍ യാതൊരു സംശയവുമില്ല.",
            "verse 32:3": "അതല്ല, ഇത് അദ്ദേഹം കെട്ടിച്ചമച്ചു എന്നാണോ അവര്‍ പറയുന്നത്‌? അല്ല, അത് നിന്‍റെ രക്ഷിതാവിങ്കല്‍ നിന്നുള്ള സത്യമാകുന്നു. നിനക്ക് മുമ്പ് ഒരു താക്കീതുകാരനും വന്നിട്ടില്ലാത്ത ഒരു ജനതക്ക് താക്കീത് നല്‍കുവാന്‍ വേണ്ടിയത്രെ അത്‌. അവര്‍ സന്‍മാര്‍ഗം പ്രാപിച്ചേക്കാം.",
            "verse 32:4": "ആകാശങ്ങളും ഭൂമിയും അവയ്ക്കിടയിലുള്ളതും ആറു ദിവസങ്ങളില്‍ (ഘട്ടങ്ങളില്‍) സൃഷ്ടിച്ചവനാകുന്നു അല്ലാഹു. പിന്നീട് അവന്‍ സിംഹാസനസ്ഥനായി. അവന്നു പുറമെ നിങ്ങള്‍ക്ക് യാതൊരു രക്ഷാധികാരിയും ശുപാര്‍ശകനുമില്ല. എന്നിരിക്കെ നിങ്ങള്‍ ആലോചിച്ച് ഗ്രഹിക്കുന്നില്ലേ?",
            "verse 32:5": "അവന്‍ ആകാശത്ത് നിന്ന് ഭൂമിയിലേക്ക് കാര്യങ്ങള്‍ നിയന്ത്രിച്ചയക്കുന്നു. പിന്നീട് ഒരു ദിവസം കാര്യം അവങ്കലേക്ക് ഉയര്‍ന്ന് പോകുന്നു. നിങ്ങള്‍ കണക്കാക്കുന്ന തരത്തിലുള്ള ആയിരം വര്‍ഷമാകുന്നു ആ ദിവസത്തിന്‍റെ അളവ്‌.",
            "verse 32:6": "അദൃശ്യവും ദൃശ്യവും അറിയുന്നവനും പ്രതാപിയും കരുണാനിധിയുമാകുന്നു അവന്‍.",
            "verse 32:7": "താന്‍ സൃഷ്ടിച്ച എല്ലാ വസ്തുക്കളെയും വിശിഷ്ടമാക്കിയവനത്രെ അവന്‍. മനുഷ്യന്‍റെ സൃഷ്ടി കളിമണ്ണില്‍ നിന്ന് അവന്‍ ആരംഭിച്ചു.",
            "verse 32:8": "പിന്നെ അവന്‍റെ സന്തതിയെ നിസ്സാരമായ ഒരു വെള്ളത്തിന്‍റെ സത്തില്‍ നിന്ന് അവന്‍ ഉണ്ടാക്കി.",
            "verse 32:9": "പിന്നെ അവനെ ശരിയായ രൂപത്തിലാക്കുകയും, തന്‍റെ വകയായുള്ള ആത്മാവ് അവനില്‍ ഊതുകയും ചെയ്തു. നിങ്ങള്‍ക്കവന്‍ കേള്‍വിയും കാഴ്ചകളും ഹൃദയങ്ങളും ഉണ്ടാക്കിത്തരികയും ചെയ്തു. കുറച്ച് മാത്രമേ നിങ്ങള്‍ നന്ദികാണിക്കുന്നുള്ളൂ.",
            "verse 32:10": "അവര്‍ (അവിശ്വാസികള്‍) പറഞ്ഞു: ഞങ്ങള്‍ ഭൂമിയില്‍ ലയിച്ച് അപ്രത്യക്ഷരായാല്‍ പോലും ഞങ്ങള്‍ പുതുതായി സൃഷ്ടിക്കപ്പെടുമെന്നോ? അല്ല, അവര്‍ തങ്ങളുടെ രക്ഷിതാവിനെ കണ്ടുമുട്ടുന്നതിനെ നിഷേധിക്കുന്നവരാകുന്നു.",
            "verse 32:11": "(നബിയേ,) പറയുക: നിങ്ങളുടെ കാര്യത്തില്‍ ഏല്‍പിക്കപ്പെട്ട മരണത്തിന്‍റെ മലക്ക് നിങ്ങളെ മരിപ്പിക്കുന്നതാണ്‌. പിന്നീട് നിങ്ങളുടെ രക്ഷിതാവിങ്കലേക്ക് മടക്കപ്പെടുന്നതുമാണ്‌.",
            "verse 32:12": "കുറ്റവാളികള്‍ തങ്ങളുടെ രക്ഷിതാവിന്‍റെ അടുക്കല്‍ തല താഴ്ത്തിക്കൊണ്ട,് ഞങ്ങളുടെ രക്ഷിതാവേ, ഞങ്ങളിതാ (നേരില്‍) കാണുകയും കേള്‍ക്കുകയും ചെയ്തിരിക്കുന്നു. അതിനാല്‍ ഞങ്ങളെ നീ തിരിച്ചയച്ചുതരേണമേ. എങ്കില്‍ ഞങ്ങള്‍ നല്ലത് പ്രവര്‍ത്തിച്ച് കൊള്ളാം. തീര്‍ച്ചയായും ഞങ്ങളിപ്പോള്‍ ദൃഢവിശ്വാസമുള്ളവരാകുന്നു. എന്ന് പറയുന്ന സന്ദര്‍ഭം നീ കാണുകയാണെങ്കില്‍ (അതെന്തൊരു കാഴ്ചയായിരിക്കും!)",
            "verse 32:13": "നാം ഉദ്ദേശിച്ചിരുന്നെങ്കില്‍ ഓരോ ആള്‍ക്കും തന്‍റെ സന്‍മാര്‍ഗം നാം നല്‍കുമായിരുന്നു. എന്നാല്‍ ജിന്നുകള്‍, മനുഷ്യര്‍ എന്നീ രണ്ടുവിഭാഗത്തെയും കൊണ്ട് ഞാന്‍ നരകം നിറക്കുക തന്നെചെയ്യും. എന്ന എന്‍റെ പക്കല്‍ നിന്നുള്ള വാക്ക് സ്ഥിരപ്പെട്ട് കഴിഞ്ഞിരിക്കുന്നു.",
            "verse 32:14": "ആകയാല്‍ നിങ്ങളുടെ ഈ ദിവസത്തെ കണ്ടുമുട്ടുന്ന കാര്യം നിങ്ങള്‍ മറന്നുകളഞ്ഞതിന്‍റെ ഫലമായി നിങ്ങള്‍ ശിക്ഷ ആസ്വദിച്ച് കൊള്ളുക. തീര്‍ച്ചയായും നിങ്ങളെ നാം മറന്നുകളഞ്ഞിരിക്കുന്നു. നിങ്ങള്‍ പ്രവര്‍ത്തിച്ച് ക്കൊണ്ടിരുന്നതിന്‍റെ ഫലമായി ശാശ്വതമായ ശിക്ഷ നിങ്ങള്‍ ആസ്വദിച്ച് കൊള്ളുക.",
            "verse 32:15": "നമ്മുടെ ദൃഷ്ടാന്തങ്ങള്‍ മുഖേന ഉല്‍ബോധനം നല്‍കപ്പെട്ടാല്‍ സാഷ്ടാംഗം പ്രണമിക്കുന്നവരായി വീഴുകയും, തങ്ങളുടെ രക്ഷിതാവിനെ സ്തുതിച്ചു കൊണ്ട് പ്രകീര്‍ത്തിക്കുകയും ചെയ്യുന്നവര്‍ മാത്രമേ നമ്മുടെ ദൃഷ്ടാന്തങ്ങളില്‍ വിശ്വസിക്കുകയുള്ളൂ. അവര്‍ അഹംഭാവം നടിക്കുകയുമില്ല.",
            "verse 32:16": "ഭയത്തോടും പ്രത്യാശയോടും കൂടി തങ്ങളുടെ രക്ഷിതാവിനോട് പ്രാര്‍ത്ഥിക്കുവാനായി, കിടന്നുറങ്ങുന്ന സ്ഥലങ്ങള്‍ വിട്ട് അവരുടെ പാര്‍ശ്വങ്ങള്‍ അകലുന്നതാണ്‌. അവര്‍ക്ക് നാം നല്‍കിയതില്‍ നിന്ന് അവര്‍ ചെലവഴിക്കുകയും ചെയ്യും.",
            "verse 32:17": "എന്നാല്‍ അവര്‍ പ്രവര്‍ത്തിച്ചിരുന്നതിനുള്ള പ്രതിഫലമായിക്കൊണ്ട് കണ്‍കുളിര്‍പ്പിക്കുന്ന എന്തെല്ലാം കാര്യങ്ങളാണ് അവര്‍ക്ക് വേണ്ടി രഹസ്യമാക്കിവെക്കപ്പെട്ടിട്ടുള്ളത് എന്ന് ഒരാള്‍ക്കും അറിയാവുന്നതല്ല.",
            "verse 32:18": "അപ്പോള്‍ വിശ്വാസിയായിക്കഴിഞ്ഞവന്‍ ധിക്കാരിയായിക്കഴിഞ്ഞവനെപ്പോലെയാണോ? അവര്‍ തുല്യരാകുകയില്ല.",
            "verse 32:19": "എന്നാല്‍ വിശ്വസിക്കുകയും സല്‍കര്‍മ്മങ്ങള്‍ പ്രവര്‍ത്തിക്കുകയും ചെയ്തവരാരോ അവര്‍ക്കാണ് -തങ്ങള്‍ പ്രവര്‍ത്തിച്ചിരുന്നതിന്‍റെ പേരില്‍ ആതിഥ്യമായിക്കൊണ്ട്‌- താമസിക്കുവാന്‍ സ്വര്‍ഗത്തോപ്പുകളുള്ളത്‌.",
            "verse 32:20": "എന്നാല്‍ ധിക്കാരം കാണിച്ചവരാരോ അവരുടെ വാസസ്ഥലം നരകമാകുന്നു. അവര്‍ അതില്‍ നിന്ന് പുറത്ത് കടക്കാന്‍ ഉദ്ദേശിക്കുമ്പോഴൊക്കെ അതിലേക്ക് തന്നെ അവര്‍ തിരിച്ചയക്കപ്പെടുന്നതാണ്‌. നിങ്ങള്‍ നിഷേധിച്ച് തള്ളിക്കളഞ്ഞിരുന്ന ആ നരകത്തിലെ ശിക്ഷ നിങ്ങള്‍ ആസ്വദിച്ച് കൊള്ളുക.എന്ന് അവരോട് പറയപ്പെടുകയും ചെയ്യും.",
            "verse 32:21": "ഏറ്റവും വലിയ ആ ശിക്ഷ കൂടാതെ (ഐഹികമായ) ചില ചെറിയതരം ശിക്ഷകളും നാം അവരെ ആസ്വദിപ്പിക്കുന്നതാണ്‌. അവര്‍ ഒരു വേള മടങ്ങിയേക്കാമല്ലോ.",
            "verse 32:22": "തന്‍റെ രക്ഷിതാവിന്‍റെ ദൃഷ്ടാന്തങ്ങളെപ്പറ്റി ഉല്‍ബോധനം നല്‍കപ്പെട്ടിട്ട് അവയില്‍ നിന്ന് തിരിഞ്ഞുകളഞ്ഞവനെക്കാള്‍ അക്രമിയായി ആരുണ്ട്‌? തീര്‍ച്ചയായും അത്തരം കുറ്റവാളികളുടെ പേരില്‍ നാം ശിക്ഷാനടപടിയെടുക്കുന്നതാണ്‌.",
            "verse 32:23": "തീര്‍ച്ചയായും മൂസായ്ക്ക് നാം വേദഗ്രന്ഥം നല്‍കിയിട്ടുണ്ട്‌. അതിനാല്‍ അത് കണ്ടെത്തുന്നതിനെ പറ്റി നീ സംശയത്തിലാകരുത്‌. ഇസ്രായീല്‍ സന്തതികള്‍ക്ക് നാം അതിനെ മാര്‍ഗദര്‍ശകമാക്കുകയും ചെയ്തു.",
            "verse 32:24": "അവര്‍ ക്ഷമ കൈക്കൊള്ളുകയും നമ്മുടെ ദൃഷ്ടാന്തങ്ങളില്‍ ദൃഢമായി വിശ്വസിക്കുന്നവരാകുകയും ചെയ്തപ്പോള്‍ അവരില്‍ നിന്ന് നമ്മുടെ കല്‍പന അനുസരിച്ച് മാര്‍ഗദര്‍ശനം നല്‍കുന്ന നേതാക്കളെ നാം ഉണ്ടാക്കുകയും ചെയ്തു.",
            "verse 32:25": "അവര്‍ ഭിന്നത പുലര്‍ത്തിയിരുന്ന വിഷയങ്ങളില്‍ നിന്‍റെ രക്ഷിതാവ് തന്നെ ഉയിര്‍ത്തെഴുന്നേല്‍പിന്‍റെ നാളില്‍ അവര്‍ക്കിടയില്‍ തീര്‍പ്പുകല്‍പിക്കുന്നതാണ്‌; തീര്‍ച്ച.",
            "verse 32:26": "ഇവര്‍ക്ക് മുമ്പ് നാം പല തലമുറകളെയും നശിപ്പിച്ചിട്ടുണ്ട്‌. എന്ന വസ്തുത ഇവര്‍ക്ക് നേര്‍വഴി കാണിച്ചില്ലേ? അവരുടെ വാസസ്ഥലങ്ങളിലൂടെ ഇവര്‍ സഞ്ചരിച്ച് കൊണ്ടിരിക്കുന്നല്ലോ. തീര്‍ച്ചയായും അതില്‍ ദൃഷ്ടാന്തങ്ങളുണ്ട്‌. എന്നിട്ടും ഇവര്‍ കേട്ട് മനസ്സിലാക്കുന്നില്ലേ?",
            "verse 32:27": "വരണ്ട ഭൂമിയിലേക്ക് നാം വെള്ളം കൊണ്ടുചെല്ലുകയും, അത് മൂലം ഇവരുടെ കന്നുകാലികള്‍ക്കും ഇവര്‍ക്കുതന്നെയും തിന്നാനുള്ള കൃഷി നാം ഉല്‍പാദിപ്പിക്കുകയും ചെയ്യുന്നു എന്ന് ഇവര്‍ കണ്ടില്ലേ? എന്നിട്ടും ഇവര്‍ കണ്ടറിയുന്നില്ലേ?",
            "verse 32:28": "അവര്‍ പറയുന്നു: എപ്പോഴാണ് ഈ തീരുമാനം? (പറയൂ) നിങ്ങള്‍ സത്യവാന്‍മാരാണെങ്കില്‍.",
            "verse 32:29": "(നബിയേ,) പറയുക: അവിശ്വസിച്ചിരുന്ന ആളുകള്‍ക്ക് ആ തീരുമാനത്തിന്‍റെ ദിവസം തങ്ങള്‍ വിശ്വസിക്കുന്നത് കൊണ്ട് പ്രയോജനം ഉണ്ടാവുകയില്ല. അവര്‍ക്ക് അവധി നല്‍കപ്പെടുകയുമില്ല.",
            "verse 32:30": "അതിനാല്‍ നീ അവരില്‍ നിന്ന് തിരിഞ്ഞുകളയുകയും കാത്തിരിക്കുകയും ചെയ്യുകഠീര്‍ച്ചയായും അവര്‍ കാത്തിരിക്കുന്നവരാണല്ലോ."
        },
        "Norwegian": {
            "verse 32:1": "Alif Lam Mim",
            "verse 32:2": "Skriftens åpenbaring er fra all verdens Herre, tvil har ingen plass.",
            "verse 32:3": "Mon de sier: «Han har oppdiktet den?» Nei, den er sann- heten fra din Herre, for at du skal advare et folk, som det ikke er kommet noen advarer til før deg, så de må følge ledelsen.",
            "verse 32:4": "Gud er den som skapte himlene og jorden og alt som mellom dem er, på seks dager. Så tok Han plass på tronen. Uten Ham har dere ingen som tar seg av dere, og ingen som taler deres sak. Vil dere da ikke komme til ettertanke?",
            "verse 32:5": "Han utsender Sitt styrende ord fra himmelen til jorden. Så stiger det opp til Ham på en dag, hvis mål er tusen år etter deres regning.",
            "verse 32:6": "Slik er Han, som kjenner det skjulte og det åpenbare, den Mektige, den Nåderike,",
            "verse 32:7": "som har gjort vel alt Han har skapt. I begynnelsen skapte Han mennesket av leire.",
            "verse 32:8": "Så frembrakte Han dets avkom av en slump skrøpelig væske,",
            "verse 32:9": "formet ham, og blåste Sin ånd i ham, og Han har gitt dere hørsel, syn og forstand. Lite takknemlighet viser dere.",
            "verse 32:10": "De sier: «Når vi er blitt borte i jorden, skal vi da bli en ny skapning?» Ja, de fornekter møtet med Herren.",
            "verse 32:11": "Si: «Dødsengelen, som er gitt ansvar for dere, vil ta dere bort, og så vil dere bli brakt tilbake til deres Herre.»",
            "verse 32:12": "Om du kunne se synderne henge med hodet fremfor sin Herre: «Vår Herre, vi har sett og hørt. Send oss tilbake så vi kan leve rettskaffent. Vi har full visshet nå.»",
            "verse 32:13": "Om Vi hadde bestemt slik, kunne Vi gitt hver enkelt ledelse. Men Mitt ord er nå blitt realitet: «Jeg vil fylle helvete med folk og dsjinner, om hverandre.",
            "verse 32:14": "Dere skal nå få føle, fordi dere glemte denne deres dags møte! Vi har glemt dere! Ta nå straffen, som varer, for det dere bedrev!»",
            "verse 32:15": "Kun de tror på Vårt ord som faller ned i ærefrykt når de påminnes om det, idet de priser sin Herre og er uten hovmod.",
            "verse 32:16": "De skyr sitt leie idet de stående påkaller Herren i frykt og lengsel, og gir av det som Vi har gitt dem.",
            "verse 32:17": "Men ingen vet hvilken lyst for øyet som venter dem i det skjulte, som belønning for deres gjerninger.",
            "verse 32:18": "Er vel en troende lik en ugudelig? De er ikke like!",
            "verse 32:19": "De som tror og handler vel, venter paradisets haver som oppholdssted. En velkomsthilsen for deres gjerninger.",
            "verse 32:20": "De som er ugudelige, venter Ilden som oppholdssted. Hver gang de ønsker å komme ut av den, blir de sendt tilbake i den, og det blir sagt til dem: «Føl Ildens straff, som dere pleide å fornekte!»",
            "verse 32:21": "Men Vi skal la dem føle den dennesidige straffen, før den store, så de må vende om!",
            "verse 32:22": "Hvem er vel mer urettferdig enn den som påminnes om Herrens ord, og så vender seg bort fra det. Vi søker hevn over synderne!",
            "verse 32:23": "Vi gav Moses skriften, så vær ikke i tvil om møtet med Ham, og Vi gjorde den til ledelse for Israels barn.",
            "verse 32:24": "Vi innsatte ledere fra deres midte, som rettledet ved Vårt bud, da de var standhaftige og trodde fast på Vårt ord.",
            "verse 32:25": "Herren vil treffe avgjørelser mellom dem på oppstandelsens dag vedrørende det de var uenige om.",
            "verse 32:26": "Finner de ingen rettledning i hvor mange slekter Vi har utslettet før dem, på hvis boplasser de vandrer omkring? I dette er visselig tegn. Vil de da ikke høre?",
            "verse 32:27": "Har de da ikke sett hvordan Vi fører vannet til det tørre land, og frembringer med det avlinger som deres fe og de selv kan spise av? Ser de da ikke?",
            "verse 32:28": "De sier: «Når er så denne seierens dag, om dere snakker sant?»",
            "verse 32:29": "Si: «På seierens dag vil det ikke gagne de vantro å tro, og de får ingen utsettelse!»",
            "verse 32:30": "Så vend deg bort fra dem og vent. De venter også."
        },
        "Pashto": {
            "verse 32:1": "الف، لام، ميم",
            "verse 32:2": "د دغه كتاب نازلول، چې په ده كې هېڅ شك نشته، د رب العالمین له جانبه دي",
            "verse 32:3": "(بلكې) ایا دوى وايي چې ده (محمدﷺ) دا له خپله ځانه جوړ كړى دى، بلكې همدغه ستا د رب له جانبه حق دى، د دې لپاره چې ته هغه قوم ووېروې چې دوى ته له تا نه مخكې هېڅ وېروونكى نه دى راغلى، د دې لپاره چې دوى سمه لاره ومومي",
            "verse 32:4": "الله هغه ذات دى چې اسمانونه او ځمكه او هر هغه څه چې د دې دواړو په مینځ كې دي، په شپږو ورځو كې پیدا كړي دي، بیا يې په عرش باندې استوا وكړه۔، ستاسو لپاره له هغه نه غیر نه هېڅ كارساز شته او نه شفاعت كوونكى، ایا نو تاسو پند نه اخلئ!",
            "verse 32:5": "هغه د كار تدبیر كوي له اسمان نه ځمكې ته (د قیامت د ورځې پورې)، بیا به ده ته دغه (كار) په هغې ورځ كې خېژي چې د هغې مقدار زر كاله دى، له هغو (كلونو) نه چې تاسو يې شمېرئ",
            "verse 32:6": "دغه (الله) د پټو او ښكاره و عالم دى، چې ښه غالب، بې حده مهربان دى",
            "verse 32:7": "هغه (الله) چې ښايسته كړى يې دى هر شى چې ده هغه پیدا كړى دى، او د انسان تخلیق يې له خټې نه شروع كړى دى",
            "verse 32:8": "بیا يې د هغه نسل د ضعیفو حقیرو اوبو له خلاصې نه پیدا كړ",
            "verse 32:9": "بیا يې هغه برابر كړ او په هغه كې يې له خپله روحه ځنې پو كړل او د هغه لپاره يې غوږونه او سترګې او زړونه پیدا كړل (خو) تاسو ډېر لږ شكر وباسئ",
            "verse 32:10": "او دوى وايي: ایا كله چې مونږ په ځمكه كې ورك (او خاورې) شو، ایا مونږ به خامخا په رښتیا سره په نوي تخلیق كې یو۔! بلكې دوى د خپل رب له ملاقات نه انكار كوونكي دي",
            "verse 32:11": "ته (دوى ته) ووایه: ستاسو روحونه هغه د مرګ مَلَك قبض كوي چې په تاسو مقرر كړى شوى دى، بیا به تاسو خپل رب ته بېرته ورګرځولى شئ",
            "verse 32:12": "او كه ته ووینې كله چې مجرمان د خپل رب په وړاندې سركوزي وي (د خپلو سرونو ټیټوونكي وي او وايي به) اى زمونږه ربه! مونږ ولیده او مونږ واورېده، نو ته مونږ بېرته بوځه، چې مونږ نېك عمل وكړو، بېشكه مونږ (اوس) یقین كوونكي یو",
            "verse 32:13": "او كه مونږ غوښتلى (نو) مونږ به خامخا هر نفس ته د هغه هدایت وركړى و او لېكن زما له جانبه دغه خبره ثابته (او لازمه) شوې ده چې زه به جهنّم خامخا ضرور له پېریانو او انسانانو، ټولو نه ډكوم",
            "verse 32:14": "نو تاسو (دا عذاب) وڅكئ په سبب د دې چې تاسو د خپلې دغې ورځې ملاقات هېر كړى و، بېشكه مونږ (هم) تاسو هېر كړئ، نو تاسو (اوس) دغه دايمي عذاب وڅكئ، په سبب د هغو عملونو چې تاسو به كول",
            "verse 32:15": "بېشكه زمونږ په ایتونو خو يواځې هغه كسان ایمان راوړي چې كله دوى ته په دغو (ایتونو) سره پند وركړى شي، نو پرېوځي، په داسې حال كې چې سجده كوونكي وي او د خپل رب د ستاينې سره تسبیح وايي او دوى تكبر نه كوي",
            "verse 32:16": "د دوى ډډې له خپلو خوب ځایونو نه لرې كېږي، دوى خپل رب بولي په وېرې او طمعې سره او له هغه (مال) نه، چې مونږ دوى ته وركړى دى؛ څه لګوي",
            "verse 32:17": "نو هېڅ یو نفس ته معلوم نه دي هغه څه چې د دوى لپاره پټ كړى شوي دي، د سترګو له یخوالي نه، لپاره د بدلې د هغو عملونو چې دوى به كول",
            "verse 32:18": "ایا هغه څوك چې مومن وي، د هغه چا په شان دى چې فاسق وي؟ دوى سره نه برابرېږي",
            "verse 32:19": "هر چې هغه كسان دي چې ایمان يې راوړى دى او نېك عملونه يې كړي دي، نو د دوى لپاره د استوګنې باغونه دي، د مېلمستیا په طریقه، په سبب د هغو عملونو چې دوى به كول",
            "verse 32:20": "او پاتې شو هغه كسان چې فاسقان شوي دي، نو د دوى استوګنه اور دى، هر كله چې دوى اراده وكړي چې له دغه (اور) نه ووځي (نو) بېرته به په هغه كې واپس كړى شي او دوى ته به وویل شي چې تاسو د اور هغه عذاب وڅَكئ چې تاسو به د ده تكذیب كاوه",
            "verse 32:21": "او مونږ به خامخا هرومرو په دوى د نژدې (لږ) عذاب نه وڅكوو، له ډېر لوى عذاب نه مخكې، د دې لپاره چې دوى (له كفر نه اسلام ته) راوګرځي",
            "verse 32:22": "او څوك دى لوى ظالم له هغه چا نه چې هغه ته د خپل رب په ایتونو سره پند وركړى شي، بیا هغه له دغو (ایتونو) نه مخ وګرځوي، بېشكه مونږ له مجرمانو نه انتقام اخيستونكي یو",
            "verse 32:23": "او یقینًا یقینًا مونږ موسٰى ته كتاب وركړى و، نو ته د هغه (موسٰى) له ملاقات نه مه په شك كې كېږه او مونږ هغه د بني اسرائیلو لپاره هدایت ګرځولى و",
            "verse 32:24": "او مونږ په دوى كې ځینې امامان ګرځولي وو چې زمونږ په حكم سره به يې (خلقو ته) لار ښودنه كوله كله چې دوى صبر وكړ، او دوى زمونږ په ایتونو یقین كاوه",
            "verse 32:25": "بېشكه همدغه ستا رب به د قیامت په ورځ د دوى په مینځ كې فیصله كوي، په هغو خبرو كې چې دوى به په هغو كې اختلاف كاوه",
            "verse 32:26": "ایا دوى ته ښكاره شوې نه ده چې مونږ له دوى نه مخكې څومره ډېرې پېړۍ هلاكې كړې دي، چې دوى د هغو په (ورانو) استوګنو كې (تل) تېرېږي، بېشكه په دغو كې خامخا نښې دي، ایا نو دوى نه اوري!",
            "verse 32:27": "او ایا دوى نه دي لیدلي چې بېشكه مونږ وچې (ګیاه ختمې شوې) ځمكې ته اوبه لېږو، نو په دغو (اوبو) سره هغه فصل راوباسو چې له هغه نه د دوى څاروي او د دوى نفسونه خوراك كوي، ایا نو دوى نه ویني",
            "verse 32:28": "او دوى وايي: دغه فیصله به كله وي، كه تاسو رښتیني يئ؟",
            "verse 32:29": "ته (دوى ته) ووایه: د فیصلې په ورځ به كافران شویو كسانو ته د هغوى ایمان راوړل فايده ورنكړي او نه به دوى ته مهلت وركولى شي",
            "verse 32:30": "نو ته له دوى نه مخ واړوه او انتظار كوه، بېشكه دوى (هم) انتظار كوونكي دي"
        },
        "Persian": {
            "verse 32:1": "الف. لام. ميم.",
            "verse 32:2": "نازل شدن اين كتاب، كه در آن هيچ شكى نيست، از جانب پروردگار جهانيان است.",
            "verse 32:3": "آيا مى‌گويند دروغى است كه خود به هم بافته؟ نه، سخنى است بر حق از جانب پروردگارت، تا مردمى را كه پيش از تو بيم‌دهنده‌اى نداشته‌اند بيم دهى. شايد به راه هدايت افتند.",
            "verse 32:4": "خداست كه آسمانها و زمين را و آنچه ميان آنهاست در شش روز بيافريد و آنگاه به عرش پرداخت. شما را جز او كارساز و شفيعى نيست. آيا پند نمى‌گيريد؟",
            "verse 32:5": "كار را از آسمان تا زمين سامان مى‌دهد. سپس در روزى كه مقدار آن هزار سال است -چنان كه مى‌شماريد- به سوى او بالا مى‌رود.",
            "verse 32:6": "اوست كه داناى نهان و آشكار است. پيروزمند و مهربان است.",
            "verse 32:7": "آن كه هر چه را آفريد به نيكوترين وجه آفريد و خلقت انسان را از گل آغاز كرد.",
            "verse 32:8": "سپس نسل او را از عصاره آبى بى‌مقدار پديد آورد.",
            "verse 32:9": "آنگاه بالاى او راست كرد و از روح خود در آن بدميد. و برايتان گوش و چشمها و دلها آفريد. چه اندك شكر مى‌گوييد.",
            "verse 32:10": "و گفتند: آيا وقتى كه در زمين ناپديد شويم، آفرينش تازه‌اى خواهيم يافت؟ آرى، ايشان به ديدار با پروردگارشان ايمان ندارند.",
            "verse 32:11": "بگو: فرشته مرگ كه موكل بر شماست، شما را مى‌ميراند. سپس به سوى پروردگارتان باز گردانيده مى‌شويد.",
            "verse 32:12": "تو را عبرت است آنگاه كه مجرمان را در نزد پروردگارشان سرافكنده بينى. گويند: اى پروردگار ما، ديديم و شنيديم. اكنون ما را بازگردان تا كارى شايسته كنيم، كه اينك به يقين رسيده‌ايم.",
            "verse 32:13": "اگر مى‌خواستيم، هدايت هر كس را به او ارزانى مى‌داشتيم. ولى وعده من كه جهنم را از همه جنيان و آدميان پر مى‌كنم، حق است.",
            "verse 32:14": "به كيفر آنكه ديدار چنين روزى را فراموش كرده بوديد، اكنون بچشيد. ما نيز شما را از ياد برده‌ايم. به سزاى كارهايى كه مى‌كرده‌ايد عذاب جاويد را بچشيد.",
            "verse 32:15": "تنها كسانى به آيات ما ايمان آورده‌اند كه چون آيات ما را بشنوند به سجده بيفتند و پروردگارشان را به پاكى بستايند و سركشى نكنند.",
            "verse 32:16": "از بستر خواب پهلو تهى مى‌كنند، پروردگارشان را با بيم و اميد مى‌خوانند و از آنچه به آنها داده‌ايم انفاق مى‌كنند.",
            "verse 32:17": "و هيچ كس از آن مايه شادمانى خبر ندارد كه به پاداش كارهايى كه مى‌كرده برايش اندوخته شده است.",
            "verse 32:18": "آيا آن كس كه ايمان آورده همانند كسى است كه عصيان مى‌ورزد؟ نه، برابر نيستند.",
            "verse 32:19": "اما آنان كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند، به پاداش اعمالى كه مى‌كرده‌اند منزلگاهى در باغهاى بهشت خواهند يافت.",
            "verse 32:20": "و اما عصيان‌پيشگان، منزلگاهشان آتش است. هرگاه كه بخواهند از آن بيرون آيند، بار ديگر آنها را به درون آتش باز گردانند و بگويندشان: بچشيد عذاب آتشى را كه دروغش مى‌پنداشتيد.",
            "verse 32:21": "و عذاب دنيا را پيش از آن عذاب بزرگ‌تر به ايشان بچشانيم، باشد كه باز گردند.",
            "verse 32:22": "كيست ستمكارتر از آن كسى كه او را به آيات پروردگارش پند دهند ولى اعراض كند؟ ما از مجرمان انتقام مى‌گيريم.",
            "verse 32:23": "هرآينه به موسى كتاب داديم. از ديدار او در ترديد مباش. و آن را راهنماى بنى‌اسرائيل قرار داديم.",
            "verse 32:24": "از ميان آن قوم پيشوايانى پديد آورديم كه چون صبورى پيشه كردند و به آيات ما يقين داشتند، به فرمان ما به هدايت مردم پرداختند.",
            "verse 32:25": "هرآينه پروردگار تو در روز قيامت در آنچه اختلاف مى‌كردند ميانشان داورى خواهد كرد.",
            "verse 32:26": "آيا آن همه مردمى را كه پيش از ايشان هلاك كرديم و اكنون اينان در خانه‌هايشان راه مى‌روند سبب هدايتشان نشد؟ در اين عبرتهاست، چرا نمى‌شنوند؟",
            "verse 32:27": "آيا نمى‌بينند كه آب را به زمين خشك و بى‌گياه روانه مى‌سازيم تا كشتزارها برويانيم و چارپايان و خودشان از آن بخورند؟ چرا نمى‌بينند؟",
            "verse 32:28": "مى‌گويند: اگر راست مى‌گوييد، پيروزى چه وقت خواهد بود؟",
            "verse 32:29": "بگو: در روز پيروزى، ايمان آوردن كافران سودشان ندهد، و مهلتشان ندهند.",
            "verse 32:30": "پس، از ايشان اعراض كن و منتظر باش، كه آنها نيز در انتظارند."
        },
        "Polish": {
            "verse 32:1": "Alif. Lam. Mim.",
            "verse 32:2": "Objawienie Księgi - nie ma co do tego żadnej wątpliwości - pochodzi od Pana światów.",
            "verse 32:3": "Może oni powiedzą: \"On ją wymyślił!\"? Wcale nie! To jest prawda od twego Pana, abyś ostrzegał ludzi, do których nie przyszedł przed tobą żaden ostrzegający. Być może, oni pójdą drogą prostą.",
            "verse 32:4": "Bóg jest Tym, który stworzył niebiosa i ziemię, i to, co jest między nimi, w ciągu sześciu dni. Potem umocnił się na tronie. Nie ma dla was, poza Nim, żadnego opiekuna ani orędownika. Czy sobie przypomnicie?",
            "verse 32:5": "On kieruje z nieba na ziemię Swój rozkaz, który potem wznosi się do Niego w ciągu dnia liczącego tysiąc lat, według waszej rachuby.",
            "verse 32:6": "To On wie, co skryte i co jawne. On jest Potężny, Litościwy!",
            "verse 32:7": "On jest Tym, który doskonale stworzył każdą rzecz, On zaczął stworzenie człowieka z gliny,",
            "verse 32:8": "Potem uczynił jego potomstwo z ekstraktu nędznej wody.",
            "verse 32:9": "Następnie ukształtował go harmonijnie i tchnął w niego nieco ze Swojego Ducha; i dał wam słuch, wzrok i serca. Jakże mało jesteście wdzięczni!",
            "verse 32:10": "Powiedzieli: \"Czy kiedy zabłądzimy na ziemi, to czy z pewnością pojawimy się w nowym stworzeniu?\" Ależ nie! Oni nie wierzą w spotkanie ze swoim Panem.",
            "verse 32:11": "Powiedz: \"Zabierze was anioł śmierci, który miał pieczę nad wami; potem do waszego Pana zostaniecie sprowadzeni!\"",
            "verse 32:12": "Gdybyś widział, jak grzesznicy skłaniają głowy przed swoim Panem: \"Panie nasz! Zobaczyliśmy i usłyszeliśmy. Zawróć nas, abyśmy mogli czynić dobro! My przecież jesteśmy przekonani o prawdzie.\"",
            "verse 32:13": "Gdybyśmy chcieli, to dalibyśmy każdej duszy drogę prostą. Lecz prawdziwe jest Moje słowo: \"Ja z pewnością napełnię Gehennę dżinami i ludźmi - wszystkimi razem!\"",
            "verse 32:14": "Zakosztujcie więc za to, iż zapomnieliście o spotkaniu tego waszego Dnia! Oto My zapomnieliśmy o was! Zakosztujcie kary wieczności za to, co czyniliście!",
            "verse 32:15": "Tylko ci wierzą w Nasze znaki, którzy, kiedy są napominani przez nie, padają na twarz, wybijając pokłony, głoszą chwałę swego Pana i nie wbijają się w pychę.",
            "verse 32:16": "Ich boki wyrywają się z pościeli oni wzywają swego Pana z obawą i nadzieją i rozdają z tego, w co ich zaopatrzyliśmy.",
            "verse 32:17": "I żadna dusza nie wie, jaka radość jest trzymana dla nich w ukryciu w nagrodę za to, co oni czynili.",
            "verse 32:18": "Czy ten, kto jest wierzącym, jest podobny do bezbożnego? Oni obydwaj nie są sobie równi.",
            "verse 32:19": "A dla tych, którzy uwierzyli i pełnili dobre dzieła - będą Ogrody schronienia, jako przyjęcie gościnne za to, co czynili.",
            "verse 32:20": "A dla tych, którzy byli bezbożni, miejscem schronienia będzie ogień. Za każdym razem, kiedy zechcą z niego wyjść, zostaną zawróceni i będzie im powiedziane: \"Zakosztujcie kary ognia, który uznaliście za kłamstwo!\"",
            "verse 32:21": "I damy im zakosztować kary bliższej przed karą większą. Być może, oni powrócą!",
            "verse 32:22": "Kto jest bardziej niesprawiedliwy aniżeli ten, który został napomniany przez znaki swego Pana, a potem odwrócił się od nich? Zaprawdę, zemścimy się na grzesznikach!",
            "verse 32:23": "Oto daliśmy Księgę Mojżeszowi - nie pozostawaj więc w wątpliwości co do spotkania z Nim i uczyniliśmy ją drogą prostą dla synów Izraela.",
            "verse 32:24": "I uczyniliśmy z nich imamów, którzy prowadzą drogą prostą według Naszego rozkazu - za to, iż byli cierpliwi i że byli przekonani o prawdziwości Naszych znaków.",
            "verse 32:25": "Zaprawdę, Pan twój rozstrzygnie między nimi w Dniu Zmartwychwstania sprawy, w jakich się różnili.",
            "verse 32:26": "Czyż nie jest dla nich przewodnictwem, iż wiele pokoleń wytraciliśmy przed nimi? Oni depczą po ich domostwach. Zaprawdę, w tym są znaki! Czy oni nie posłuchają?",
            "verse 32:27": "Czyż oni nie widzieli, że My pędzimy wodę ku wyschniętej ziemi i sprawiamy, iż wyrastają dzięki niej zasiewy, z których jedzą ich trzody i oni sami? Czyż oni nie widzą jasno?",
            "verse 32:28": "Oni mówią: \"Kiedy będzie to zwycięstwo, jeśli jesteście prawdomówni?\"",
            "verse 32:29": "Powiedz: \"W Dniu Zwycięstwa nie pomoże już tym,. którzy nie uwierzyli, ich wiara ani nie będzie im dana zwłoka.\"",
            "verse 32:30": "Odwróć się więc od nich i czekaj! Oni też czekają."
        },
        "Portuguese": {
            "verse 32:1": "Alef, Lam, Mim.",
            "verse 32:2": "Esta é a revelação do Livro indubitável, que emana do Senhor do Universo.",
            "verse 32:3": "Ou dizem: ele o (Alcorão) tem forjado! Qual! É a verdade do teu Senhor, para que admoestes (com ele) um povo, ao qualantes de ti não chegou admoestador algum, para que se encaminhe.",
            "verse 32:4": "Foi Deus Quem criou, em seis dias, os céus e a terra, e tudo quanto há entre ambos; logo assumiu o Trono. Não tendes, além d'Ele, protetor, nem intercessor algum. Não meditais?",
            "verse 32:5": "Ele rege todos os assuntos, desde o céu até à terra; logo (tudo) ascenderá a Ele, em um dia cuja duração será de mil anos, de vosso cômputo.",
            "verse 32:6": "Tal é (Deus), Conhecer do cognoscível e do incognoscível, o Poderoso, o Misericordiosíssimo,",
            "verse 32:7": "Que aperfeiçoou tudo o que criou e iniciou a criação do primeiro homem, de barro.",
            "verse 32:8": "Então, formou-lhe uma prole da essência de sêmen sutil.",
            "verse 32:9": "Depois o modelou; então, alentou-o com Seu Espírito. Dotou a todos vós da audição, da visão e das vísceras. Quão poucoLhe agradeceis!",
            "verse 32:10": "Dizem (os incrédulos): Quando formos consumidos pela terra, seremos, acaso, renovados em uma nova criatura? Qual? Eles negam o comparecimento ante o seu Senhor!",
            "verse 32:11": "Dize-lhes: O anjo da morte, que foi designado para vos guardar, recolher-vos-á, e logo retornareis ao vosso Senhor.",
            "verse 32:12": "Ah, se pudesses ver os pecadores, cabisbaixos, ante o seu Senhor! (Exclamarão): Ó Senhor nosso, agora temos olhospara ver e ouvidos para ouvir! Faze-nos retornar ao mundo, que praticaremos o bem, porque agora estamos persuadidos!",
            "verse 32:13": "E se quiséssemos, teríamos iluminado todo o ser, porém, a Minha sentença foi pronunciada; sabei que encherei o infernocom gênios e humanos, todos juntos.",
            "verse 32:14": "(Ser-lhes-á dito): Sofrei, pois, por terdes esquecido o comparecimento neste vosso dia! Em verdade, vos esqueceremos. E sofrei o castigo, por toda a eternidade, pelo que cometestes!",
            "verse 32:15": "Somente crêem nos Nossos versículos aqueles que, quando eles lhos são recitados, se prostram em adoração e celebramos louvores de seu Senhor, sem, contudo, se ensoberbecerem.",
            "verse 32:16": "São aqueles, cujo corpos não relutam em se afastar dos leitos para invocarem seu Senhor com temor e esperança, e quefazem caridade daquilo com que os agraciamos.",
            "verse 32:17": "Nenhuma alma caridosa sabe que deleite para os olhos lhe está reservado, em recompensa pelo que fez.",
            "verse 32:18": "Poderá, acaso, aquiparar-se ao fiel o ímpio? Jamais se equipararão!",
            "verse 32:19": "Quanto aos fiéis, que tiverem praticado o bem, terão por abrigo jardins de aconchego, por tudo quanto fizeram.",
            "verse 32:20": "Por outra, os depravados terão por morada o fogo infernal. Cada vez que desejarem sair dali, serão ainda maisarraigados nele, e lhes será dito: Provai o tormento do fogo que desmentistes!",
            "verse 32:21": "Em verdade, infligir-lhes-emos o castigo terreno, antes do castigo supremo, para que se arrependam.",
            "verse 32:22": "E haverá alguém mais iníquo do que quem, ao ser exortado com os versículos do seu Senhor, logo os desdenha? Sabeique Nós puniremos os pecadores.",
            "verse 32:23": "Já havíamos concedido o Livro a Moisés. Não vaciles, pois, quando ele chegar a ti. E destinamo-lo como orientaçãopara os israelitas.",
            "verse 32:24": "E designamos líderes dentre eles, os quais encaminham os demais segundo a Nossa ordem, porque perseveraram e sepersuadiram dos Nossos versículos.",
            "verse 32:25": "Certamente teu Senhor julgará entre eles, no Dia da Ressurreição, quanto àquilo a respeito do quê divergiam",
            "verse 32:26": "Acaso, Ele não lhes evidenciou quantas gerações anteriores à deles temos exterminado, apesar de caminharem sobre assuas (antigas) moradas? Certamente, nisto há sinais. Não ouvem, então?",
            "verse 32:27": "Não reparam em que conduzimos a água à terra erma, fazendo com isso, brotar as semeaduras de que se nutrem eles e oseu gado? Não vêem, acaso?",
            "verse 32:28": "E perguntam: Quando chegará essa vitória, se estiverdes certos?",
            "verse 32:29": "Responde-lhes: No dia da vitória de nada valerá a fé tardia dos incrédulos, nem serão tolerados.",
            "verse 32:30": "Afasta-te, pois deles, e espera, porque eles também não perdem por esperar."
        },
        "Punjabi": {
            "verse 32:1": "ਅਲਿਫ.ਲਾਮ.ਮੀਮ",
            "verse 32:2": "ਇਹ ਉਤਰੀਆਂ ਹੋਈਆਂ ਕਿਤਾਬਾਂ ਹਨ, ਇਸ ਵਿਚ ਕੋਈ ਸ਼ੱਕ ਨਹੀਂ। (ਇਹ ਕਿਤਾਬਾਂ) ਸੰਸਾਰ ਦੇ ਮਾਲਕ ਅੱਲਾਹ ਵੱਲੋਂ ਹੀ ਹਨ।",
            "verse 32:3": "ਕੀ ਉਹ ਆਖਦੇ ਹਨ ਕਿ ਇਸ ਬੰਦੇ ਨੇ ਇਸ ਨੂੰ ਖ਼ੁਦ ਘੜ ਲਿਆ। ਸਗੋਂ ਇਹ ਤੁਹਾਡੇ ਰੱਬ ਵੱਲੋਂ ਸੱਚ ਹੈ। ਤਾਂ ਕਿ ਤੁਸੀਂ’ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਨੂੰ ਡਰਾ ਦਿਉ, ਜਿਨ੍ਹਾਂ ਦੇ ਕੌਲ ਤੁਹਾਡੇ ਤੋਂ ਪਹਿਲਾਂ ਕੋਈ ਡਰਾਉਣ ਵਾਲਾ ਨਹੀਂ ਆਇਆ। ਤਾਂ ਕਿ ਉਹ ਰਾਹ ਤੇ ਆ ਜਾਣ।",
            "verse 32:4": "ਅੱਲਾਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਅਕਾਸ਼ਾਂ ਅਤੇ ਧਰਤੀ ਤੇ ਜਿਹੜਾ ਕੁਝ ਇਨ੍ਹਾਂ ਦੇ ਵਿਚਕਾਰ ਹੈ, ਨੂੰ ਛੇ ਦਿਨਾਂ ਵਿਚ ਪੈਦਾ ਕੀਤਾ ਹੈ। ਫਿਰ ਉਹ ਆਸਣ ਤੇ ਬਿਰਾਜਮਾਨ ਹੋਇਆ। ਉਸ ਤੋਂ ਬਿਨਾ ਨਾ ਕੋਈ ਤੁਹਾਡਾ ਸਹਾਇਕ ਹੈ ਅਤੇ ਨਾ ਕੋਈ ਸਿਫ਼ਾਰਸ਼ ਕਰਨ ਵਾਲਾ। ਤਾਂ ਕੀ ਤੁਸੀਂ ਧਿਆਨ ਨਹੀਂ ਕਰਦੇ।",
            "verse 32:5": "ਉਹ ਆਕਾਸ਼ਾਂ ਤੋਂ ਧਰਤੀ ਤੱਕ ਸਾਰੇ ਮਾਮਲਿਆਂ ਨੂੰ ਨਜਿੱਠਦਾ ਹੈ। ਫਿਰ ਉਹ ਉਸ ਵੱਲ ਇੱਕ ਅਜਿਹੇ ਦਿਨ, ਜਿਸ ਦੀ ਲੰਬਾਈ ਤੁਹਾਡੀ ਗਿਣਤੀ ਦੇ ਅਨੁਸਾਰ ਹਜ਼ਾਰ ਸਾਲ ਦੇ ਬਰਾਬਰ ਹੈ, ਵਾਪਿਸ ਜਾਂਦੇ ਹਨ।",
            "verse 32:6": "ਉਹ ਹੀ ਹੈ ਪ੍ਰਗਟ ਅਤੇ ਗੁੱਝੀਆਂ ਨੂੰ ਜਾਣਨ ਵਾਲਾ, ਤਾਕਤਵਰ ਅਤੇ ਰਹਿਮਤ ਵਾਲਾ।",
            "verse 32:7": "ਉਸ ਨੇ ਜਿਹੜੀ ਚੀਜ਼ ਵੀ ਬਣਾਈ ਚੰਗੀ ਤਰਾਂ ਬਣਾਈ। ਅਤੇ ਉਸ ਨੇ ਮਨੁੱਖ ਦੀ ਸਿਰਜਣਾ ਮਿੱਟੀ ਤੋਂ ਆਰੰਭ ਕੀਤੀ।",
            "verse 32:8": "ਫਿਰ ਉਸ ਦੀ ਨਸਲ ਤੁੱਛ ਪਾਣੀ ਦੇ ਸਾਰ ( ਨਿਚੋੜ) ਤੋਂ ਚਲਾਈ।",
            "verse 32:9": "ਫਿਰ ਉਸ ਦੇ ਅੰਗ ਠੀਕ ਕੀਤੇ ਅਤੇ ਉਸ ਵਿਚ ਆਪਣੀ ਰੂਹ (ਆਤਮਾ) ਫੂਕੀ। ਤੁਹਾਡੇ ਲਈ ਕੰਨ, ਅੱਖਾਂ ਅਤੇ ਦਿਲ ਬਣਾਇਆ। ਤੁਸੀਂ ਲੋਕ ਬਹੁਤ ਘੱਟ ਸ਼ੂਕਰ ਗ੍ਰਜ਼ਾਰ ਹੁੰਦੇ ਹੋ।",
            "verse 32:10": "ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਕੀ ਜਦੋਂ ਅਸੀਂ ਧਰਤੀ ਵਿਚ਼ ਲੁਪਤ ਹੋ ਜਾਵਾਂਗੇ। ਤਾਂ ਅਸੀਂ ਫਿਰ ਨਵੇਂ ਸਿਰੇ ਤੋਂ ਪੈਦਾ ਕੀਤੇ ਜਾਵਾਂਗੇ। ਸਗੋਂ ਉਹ ਆਪਣੇ ਰੱਬ ਕੋਲ ਜਾਣ ਤੋਂ ਹੀ ਇਨਕਾਰੀ ਹਨ।",
            "verse 32:11": "ਆਖੋ ਕਿ ਮੌਤ ਦਾ ਫ਼ਰਿਸ਼ਤਾ ਤੁਹਾਡੀ ਜਾਨ ਕੱਢਦਾ ਹੈ, ਜਿਹੜਾ ਤੁਹਾਡੇ ਲਈ ਨਿਯੁਕਤ ਕੀਤਾ ਗਿਆ ਹੈ। ਫਿਰ ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਵੱਲ ਵਾਪਿਸ ਮੋੜੇ ਜਾਉਗੇ।",
            "verse 32:12": "ਅਤੇ ਕਾਸ਼! ਤੁਸੀਂ ਵੇਖੋ ਜਦੋਂ ਇਹ ਅਪਰਾਧੀ ਲੋਕ ਆਪਣੇ ਰੱਬ ਦੇ ਸਾਹਮਣੇ ਸਿਰ ਝੁਕਾ ਕੇ ਖੜੇ ਹੋਣਗੇ। ਹੇ ਸਾਡੇ ਪਾਲਣਹਾਰ! ਅਸੀਂ ਦੇਖ ਲਿਆ ਅਤੇ ਅਸੀਂ ਸੁਣ ਲਿਆ, (ਹੁਣ) ਸਾਨੂੰ ਵਾਪਿਸ ਭੇਜ ਦੇ ਤਾਂ ਕਿ ਅਸੀਂ ਚੰਗੇ ਕਰਮ ਕਰ ਸਕੀਏ। ਅਸੀ’ (ਹੁਣ) ਭਰੋਸਾ ਕਰਨ ਵਾਲੇ ਬਣ ਗਏ।",
            "verse 32:13": "ਅਤੇ ਜੇਕਰ ਅਸੀਂ’ ਚਾਹੁੰਦੇ ਤਾਂ ਹਰੇਕ ਬੰਦੇ ਨੂੰ ਉਸ ਦਾ ਸਿੱਧਾ ਮਾਰਗ ਦਿੰਦੇ। ਪਰੰਤੂ ਮੇਰੀ ਗੱਲ ਸਿੱਧ ਹੋ ਚੁੱਕੀ ਹੈ ਕਿ ਮੈ’ ਨਰਕਾਂ ਨੂੰ ਜਿੰਨਾਂ ਅਤੇ ਮਨੁੱਖਾਂ ਨਾਲ ਭਰਾਂਗਾ।",
            "verse 32:14": "ਤਾਂ ਹੁਣ ਮਜ਼ਾ ਚੱਖੋ ਇਸ ਗੱਲ ਦਾ ਕਿ ਤੁਸੀਂ ਉਸ ਦਿਨ ਦੇ ਆਉਣ ਨੂੰ ਭੂਲਾ ਦਿੱਤਾ ਸੀ। (ਅੱਜ) ਅਸੀਂ ਤੁਹਾਨੂੰ ਭੂਲਾ ਦਿੱਤਾ। ਅਤੇ ਆਪਣੇ ਕਰਮਾਂ ਦੇ ਕਾਰਨ ਹਮੇਸ਼ਾ ਰਹਿਣ ਵਾਲੇ ਕਸ਼ਟ ਦਾ ਮਜ਼ਾ ਚੱਖੋ।",
            "verse 32:15": "ਸਾਡੀਆਂ ਆਇਤਾ ਤੇ ਉਹੀ ਲੋਕ ਈਮਾਨ ਲਿਆਉਂਦੇ ਹਨ, ਜਦੋਂ ਉਨ੍ਹਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਰਾਹੀਂ ਯਾਦ ਕਰਵਾਇਆ ਜਾਂਦਾ ਹੈ। ਤਾਂ ਉਹ ਸਿਜਦੇ ਵਿਚ ਡਿੱਗ ਪੈਂਦੇ ਹਨ। ਅਤੇ ਆਪਣੇ ਰੱਬ ਦੀ ਖੁਸ਼ੀ ਦੇ ਨਾਲ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰਦੇ ਹਨ। ਅਤੇ ਉਹ ਹੰਕਾਰ ਨਹੀਂ ਕਰਦੇ।",
            "verse 32:16": "ਉਨ੍ਹਾਂ ਦੀਆਂ ਪਿੱਠਾਂ (ਪਾਸੇ) ਬਿਸਤਰਿਆਂ ਤੋਂ ਅਲੱਗ ਰਹਿੰਦੇ ਹਨ। ਉਹ ਆਪਣੇ ਰੱਬ ਨੂੰ ਭੈ ਅਤੇ ਆਸ਼ਾ ਨਾਲ ਸਦਦੇ ਹਨ ਅਤੇ ਜਿਹੜਾ ਕੁਝ ਅਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਦਿੱਤਾ, ਉਹ ਉਸ ਵਿਚੋਂ ਖਰਚ ਕਰਦੇ ਹਨ।",
            "verse 32:17": "ਤਾਂ ਕਿਸੇ ਨੂੰ ਨਹੀਂ ਪਤਾ ਕਿ ਇਨ੍ਹਾਂ ਲੋਕਾਂ ਲਈ ਇਨ੍ਹਾਂ ਦੇ ਕਰਮਾਂ ਤੇ ਬਦਲੇ ਵਿਚ ਅੱਖਾਂ ਦੀ ਕਿਹੜੀ ਠੰਡਕ ਲੁਕੋ ਕੇ ਰੱਖੀ ਹੈ।",
            "verse 32:18": "ਤਾ ਕੀ ਜਿਹੜਾ ਮੋਮਿਨ ਹੈ, ਉਹ ਉਸ ਬੰਦੇ ਵਰਗਾ ਹੋਵੇਗਾ, ਜਿਹੜਾ ਆਗਿਆਕਾਰੀ ਨਹੀਂ’ ਹੈ। ਦੋਵੇਂ ਬਰਾਬਰ ਨਹੀਂ ਹੋ ਸਕਦੇ।",
            "verse 32:19": "ਜਿਹੜੇ ਲੋਕ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਚੰਗੇ ਕਰਮ ਕੀਤੇ। ਉਨ੍ਹਾਂ ਲਈ (ਰਹਿਣ ਵਾਸਤੇ) ਜੰਨਤ ਦੇ ਵਿਸ਼ਰਾਮ ਘਰ ਹਨ। ਇਹ ਇਸ ਲਈ ਕਿ ਉਹ ਚੰਗੇ ਕਰਮ ਕਰਦੇ ਸਨ।",
            "verse 32:20": "ਅਤੇ ਜਿਨ੍ਹਾਂ ਲੋਕਾਂ ਨੇ ਅਵੱਗਿਆ ਕੀਤੀ ਤਾਂ ਉਨ੍ਹਾਂ ਦਾ ਟਿਕਾਣਾ ਅੱਗ ਹੈ। ਇਹ ਲੋਕ ਜਦੋਂ ਇਸ (ਅੱਗ) ਵਿਚੋਂ ਨਿਕਲਣਾ ਚਾਹੁੰਣਗੇ, ਫਿਰ ਉਨ੍ਹਾਂ ਨੂੰ ਇਸ (ਅੱਗ) ਵਿਚ ਧੱਕਾ ਦੇ ਦਿੱਤਾ ਜਾਵੇਗਾ। ਅਤੇ ਇਨ੍ਹਾਂ ਨੂੰ ਆਖਿਆ ਜਾਵੇਗਾ ਕਿ ਅੱਗ ਦੀ ਸਜ਼ਾ ਚੱਖੋ, ਜਿਸ ਨੂੰ ਤੁਸੀਂ ਝੁਠਲਾਉਂਦੇ ਸੀ।",
            "verse 32:21": "ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਵੱਡੀ ਸਜ਼ਾ ਤੋਂ ਪਹਿਲਾਂ ਛੋਟੀ ਸਜ਼ਾ ਦੇਵਾਂਗੇ, ਹੋ ਸਕਦਾ ਉਹ ਸੰਭਲ ਜਾਣ।",
            "verse 32:22": "ਅਤੇ ਉਸ ਬੰਦੇ ਤੋਂ ਵੱਡਾ ਜ਼ਾਲਿਮ ਕੌਣ ਹੋਵੇਗਾ, ਜਿਸ ਨੂੰ ਉਸ ਦੇ ਰੱਬ ਦੀਆਂ ਆਇਤਾਂ ਰਾਹੀਂ ਉਪਦੇਸ਼ ਦਿੱਤਾ ਗਿਆ ਹੋਵੇ। ਅਤੇ ਫਿਰ ਉੱਸ ਨੇ (ਉਪਦੇਸ਼) ਤੋਂ ਮੂੰਹ ਮੋੜਿਆ ਹੋਵੇ। ਅਸੀਂ ਅਜਿਹੇ ਅਪਰਾਧੀਆਂ ਨੂੰ ਜ਼ਰੂਰ ਫ਼ਲ (ਸਜ਼ਾ) ਦੇਵਾਂਗੇ।",
            "verse 32:23": "ਅਤੇ ਅਸੀਂ ਸੂਸਾ ਨੂੰ ਕਿਤਾਬ ਦਿੱਤੀ, ਤਾਂ ਤੁਸੀ ਉਸ ਨੂੰ ਮਿਲਣ ਤੇ ਸ਼ੱਕ ਨਾ ਕਰੋਂ। ਅਤੇ ਅਸੀਂ ਉਸ ਨੂੰ ਇਸਰਾਈਲ ਦੇ ਵੰਸ਼ ਲਈ ਰਾਹ ਦਸੇਰਾ ਬਣਾਇਆ।",
            "verse 32:24": "ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਵਿਚ ਨਾਇਕ ਬਣਾਏ, ਜਿਹੜੇ ਸਾਡੇ ਹੁਕਮ ਨਾਲ ਲੋਕਾਂ ਦਾ ਮਾਰਗ ਦਰਸ਼ਨ ਕਰਦੇ ਸਨ। ਹਾਲਾਂਕਿ ਉਨ੍ਹਾਂ ਨੇ ਧੀਰਜ ਰੱਖਿਆ ਅਤੇ ਉਹ ਸਾਡੀਆਂ ਆਇਤਾਂ ਤੇ ਵਿਸ਼ਵਾਸ਼ ਕਰਦੇ ਸਨ।",
            "verse 32:25": "ਬੇਸ਼ੱਕ ਤੇਰਾ ਰੱਬ ਕਿਆਮਤ ਦੇ ਦਿਨ ਉਨ੍ਹਾਂ ਦੇ ਵਿਚਕਾਰ ਮਾਮਲਿਆਂ ਦਾ ਨਿਰਣਾ ਕਰੇਗਾ, ਜਿਨ੍ਹਾਂ ਬਾਰੇ ਉਹ ਆਪਿਸ ਵਿਚ ਮੱਤ ਭੇਦ ਕਰਦੇ ਸਨ।",
            "verse 32:26": "ਕੀ ਉਨ੍ਹਾਂ ਲਈ ਇਹ ਚੀਜ਼ ਨਸੀਹਤ ਵਾਲੀ ਨਾ ਬਣੀ ਕਿ ਉਨ੍ਹਾਂ ਤੋਂ ਪਹਿਲਾਂ ਅਸੀਂ ਕਿੰਨੀਆਂ ਕੌਮਾਂ ਨੂੰ ਨਸ਼ਟ ਕਰ ਦਿੱਤਾ ਹੈ। ਜਿਨ੍ਹਾਂ ਦੀਆਂ ਬਸਤੀਆਂ ਵਿਚ ਇਹ ਲੋਕ ਆਉਂਦੇ ਜਾਂਦੇ ਰਹਿੰਦੇ ਹਨ। ਬੇਸ਼ੱਕ ਇਸ ਵਿਚ ਨਿਸ਼ਾਨੀਆਂ ਹਨ। ਕੀ ਇਹ ਲੋਕ ਸੁਣਦੇ ਨਹੀਂ",
            "verse 32:27": "ਕੀ ਇਨ੍ਹਾਂ ਨੇ ਨਹੀਂ ਦੇਖਿਆ ਕਿ ਅਸੀਂ ਜਲ ਨੂੰ ਪੱਧਰੀ (ਬੰਜਰ) ਜ਼ਮੀਨ ਵੱਲ ਰੋੜ੍ਹ ਕੇ ਲੈ ਜਾਂਦੇ ਹਾਂ। ਫਿਰ ਅਸੀਂ ਉਸ ਵਿਜ਼ੋਂ ਫਸਲਾਂ ਪੈਦਾ ਕਰਦੇ ਹਾਂ, ਜਿਸਨੂੰ ਉਹ ਅਤੇ ਇਨ੍ਹਾਂ ਦੇ ਪਸ਼ੂ ਖਾਂਦੇ ਹਨ। ਫਿਰ ਕੀ ਉਹ ਦੇਖਦੇ ਨਹੀਂ।",
            "verse 32:28": "ਅਤੇ ਉਹ ਆਖਦੇ ਹਨ ਕਿ ਇਹ ਫੈਸਲਾ ਕਦੋਂ ਹੋਵੇਗਾ, (ਦੱਸੋ) ਜੇਕਰ ਤੁਸੀਂ ਸੱਚੇ ਹੋ।",
            "verse 32:29": "ਆਖੋ, ਕਿ ਫੈਸਲੇ ਦੇ ਦਿਨ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਵਾ ਈਮਾਨ ਕੰਮ ਨਹੀਂ ਆਵੇਗਾ, ਜਿਨ੍ਹਾਂ ਨੇ ਅਵੱਗਿਆ ਕੀਤੀ। ਅਤੇ ਨਾ’ ਹੀ ਉਨ੍ਹਾਂ ਨੂੰ ਮੌਕਾ ਦਿੱਤਾ ਜਾਵੇਗਾ।",
            "verse 32:30": "ਤਾਂ ਉਨ੍ਹਾਂ ਤੋਂ ਮੂੰਹ ਮੌੜ ਲਵੋਂ ਅਤੇ ਉਡੀਕ ਕਰੋ, ਇਹ ਵੀ ਉਡੀਕ ਕਰ ਰਹੇ ਹਨ।"
        },
        "Roman english": {
            "verse 32:1": "Alif-Laaam-Meeem",
            "verse 32:2": "Tanzeelul Kitaabi `laaraiba feehi mir rabbil `aalameen",
            "verse 32:3": "Am yaqooloonaf taraahu bal huwal haqqu mir rabbika litunzira qawma maaa ataahum min nazeerim min qablika la`allahum yahtadoon",
            "verse 32:4": "Allaahul lazee khalaqas samaawaati wal arda wa maa bainahumaa fee sittati ayyaam;Thummas tawaa `alal `arsh; maa lakum min doonihee minw-wwaliyyinw-wala shafee`; afala tatazakkaroon",
            "verse 32:5": "Yudabbirul amra minas samaaa`i ilal ardi Thumma ya`ruju ilai Thumma ya`ruju ilaihi fee yawmin kaana miqdaaruhoooo alfa sanatim mimmaa ta`uddoon",
            "verse 32:6": "Zaalika `aalimul ghaybi wa shahaadatil `azeezur raheem",
            "verse 32:7": "Allazee ahsana kulla shai in khalaqa; wa bada a khalqal insaani min teen",
            "verse 32:8": "Thumma ja`ala naslahoo min sulaalatim mim maaa`immaheen",
            "verse 32:9": "Thumma sawwaahu wa nafakha feehi mir roohihih; wa ja`ala lakumus sam`a wal-absaara wal-af`idah; taqaleelam maa tashkuroon",
            "verse 32:10": "Wa qaalooo `a-izaa dalalnaa fil ardi `a-innaa lafee khalqin jadeed; bal hum biliqaaa`i rabbihim kaafirroon",
            "verse 32:11": "Qul yatawaffaakum malakul mawtil lazee wukkila bikum Thumma ilaa rabbikum turja`oon",
            "verse 32:12": "Wa law taraaa izil mujrimoona naakisoo ru`oosihim `inda rabbihim rabbanaaa absarnaa wa sami`naa farji`naa na`mal saalihan innaa mooqinoon",
            "verse 32:13": "Wa law shi`naa la-aatainaa kulla nafsin hudaahaa wa laakin haqqal qawlu minnee la amla`anna jahannama minal jinnati wannaasi ajma`een",
            "verse 32:14": "Fazooqoo bimaa naseetum liqaaa`a yawminkum haaza innaa naseenaakum wa zooqoo `azaabal khuldi bimaa kuntum ta`maloon",
            "verse 32:15": "Innamaa yu`minu bi aayaatinal lazeena izaa zukkiroo bihaa kharroo sujjadanw wa sabbahoo bihamdi rabbihim wa hum laa yastakbiroon",
            "verse 32:16": "Tatajaafaa junoobuhum `anil madaaji`i yad`oona rabbahum khawfanw wa tama`anw wa mimmaa razaqnaahum yunfiqoon",
            "verse 32:17": "Falaa ta`lamu nafsum maaa ukhfiya lahum min qurrati a`yunin jazaaa`am bimaa kaanoo ya`maloon",
            "verse 32:18": "Afaman kaana mu`minan kaman kaana faasiqaa; laa yasta woon",
            "verse 32:19": "Ammal lazeena aamanoo wa `amilus saalihaati falahum jannaatul maawa nuzulam bimaa kaanoo ya`maloon",
            "verse 32:20": "Wa ammal lazeena fasaqoo famaawaahumn Naaru kullamaaa araadooo any yakhrujoo minhaaa u`eedoo feehaa wa qeela lahum zooqoo `zaaaban Naaril lazee kuntum bihee tukazziboon",
            "verse 32:21": "Wa lanuzeeqan nahum minal `azaabil ladnaa doonal `azaabil akbari la`allahum yarji`oon",
            "verse 32:22": "Wa man azlamu mimman zukkira bi aayaati rabbihee summa a`rada `anhaa; innaa minal mujrimeena muntaqimmon",
            "verse 32:23": "Wa laqad aayainaa Moosal Kitaaba falaa takun fee miryatim mil liqaaa`ihee wa ja`alnaahu hudal li Baneee Israaa`eel",
            "verse 32:24": "Wa ja`alnaa minhum a`immatany yahdoona bi amrinaa lammaa sabaroo wa kaanoo bi aayaatinaa yooqinoon",
            "verse 32:25": "Inna rabbaka huwa yafsilu bainahum yawmal qiyaamati feemaa kaanoo feehi yakhtalifoon",
            "verse 32:26": "Awalam yahdi lahum kam ahlaknaa min qablihim minal qurooni yamshoona fee zaalika la aayaatin afalaa yasma`oon",
            "verse 32:27": "Awalam yaraw annaa nasooqul maaa`a ilal lardil juruzi fanukhriju bihee zar`an taakulu minhu an`aamuhum wa anfusuhum afalaa yubsiroon",
            "verse 32:28": "Wa yaqooloona mataa haazal fat hu in kuntum saadiqeen",
            "verse 32:29": "Qul yawmal fat hi laa yanfa`ul lazeena kafarooo eemaanuhum wa laa hum yunzaroon",
            "verse 32:30": "Fa a`rid `anhum wantazir innahum muntazirron"
        },
        "Russian": {
            "verse 32:1": "Алеф - Лям - Мим.",
            "verse 32:2": "Поистине, сомненья нет, Что Откровение сей Книги (Пришло) от Господа миров.",
            "verse 32:3": "Иль они скажут: \"Он его измыслил!\" О нет! Сие есть Истина, Пришедшая от Бога твоего, Чтоб ею ты увещевал людей, К которым до тебя не приходил наставник, Чтобы могли они идти прямой стезею.",
            "verse 32:4": "Аллах есть Тот, Кто небеса и землю сотворил И все, что между ними, за шесть (небесных) дней И после утвердился на Престоле. Кроме Него, защитника вам нет, Нет покровителя иного. Что ж вам не вспомнить (О судьбах прошлых поколений)?",
            "verse 32:5": "Он сводит Повеление Свое с небес на землю, И, (воплотившись на земле), Оно потом к Нему восходит В какой-то День, Что мерится одною тысячью годов По вашему (земному) счету.",
            "verse 32:6": "Таков Он - Ведающий (все): Сокрытое (от вас) или (представленное) явно, - Могущ и милосерден Он,",
            "verse 32:7": "Кто совершенный вид придал всему, что создал, Из глины начал сотворенье человека,",
            "verse 32:8": "Потом продлил его потомство Из капли жидкости презренной,",
            "verse 32:9": "Потом Он выровнял его и соразмерил, От Духа Своего вдохнул, Дал зрение, и слух, и сердце, - И все ж как мало благодарны вы!",
            "verse 32:10": "И говорят они: \"Ужель когда мы затеряемся в земле, Неужто в обновленном виде Мы будем вновь воссозданы?\" Увы! Они во встречу с Господом своим не верят.",
            "verse 32:11": "Скажи (им): \"Ангел смерти, Кому даны на попеченье вы, Приемлет душу вашу по кончине; Потом к Владыке своему вы возвратитесь\".",
            "verse 32:12": "И если б мог ты только видеть, Как головы (в бесчестье) склонят Преступные пред Господом своим: \"Господь наш! Видели и слышали мы то, (О чем нас на земле предупреждали). Верни (на землю) нас, Чтоб мы могли творить благое, - Теперь же в Истине Твоей Убеждены мы всей душой\".",
            "verse 32:13": "И если б Мы того желали, Мы б душу всякую вели прямым путем, Но Мое Слово было неизменно: \"Я Ад людьми и джиннами наполню - всеми вместе;",
            "verse 32:14": "Вкусите же (плоды того), Что вы о встрече с этим Днем забыли! Теперь же Мы забудем вас, - Вкусите кару Вечности за все свои дела!\"",
            "verse 32:15": "Ведь только те в знаменья Наши верят, Кто при помине их ниц падает И воздает свои хвалы Аллаху - Не величаясь, не гордясь.",
            "verse 32:16": "Они свои постели оставляют, И призывают Бога своего Из страха (гнев Его навлечь), С надеждой (на Его благоволенье), И (щедро) раздают (на подать) (Из благ), что низвели Мы им.",
            "verse 32:17": "И ни одна душа из них не знает, (Как много Божьей) благодати Еще сокрыто взорам их В награду за их добрые деянья.",
            "verse 32:18": "Так неужели тот, кто (всей душой) уверовал (в Аллаха), Сравни тому, кто предалсЯ греху? Нет, не равны они нисколько!",
            "verse 32:19": "Тем, кто уверовал и доброе творил, Станут обителью сады Эдема - Как вечное пристанище за праведность их дел.",
            "verse 32:20": "Пристанищем же тем, кто был распутен, Станет огонь (пылающего Ада), И всякий раз, как захотят они его покинуть, Туда их возвратят опять и скажут: \"Вкусите наказание Огнем, Который вы считали ложью!\"",
            "verse 32:21": "(Но прежде) Мы дадим вкусить им кару ближней (жизни), Прежде чем их подвергнуть величайшей (каре во второй), Чтобы могли покаяться они и (к Нам) вернуться.",
            "verse 32:22": "И есть ли нечестивее того, Кому знаменья Господа его напоминают, А он все ж отвращается от них? Поистине, Мы взыщем с грешников сполна!",
            "verse 32:23": "Мы прежде Мусе дали Книгу - Не будь в сомнении о встрече с Ним - И сыновьям Исраиля назначили ее Путеводителем (по жизни)",
            "verse 32:24": "И сделали из их числа имамов, Которые указывают путь по Нашим повеленьям, Пока живет в них стойкое терпенье, Пока в них убежденность есть В Господнем (естестве) знамений.",
            "verse 32:25": "В День Воскресения (на Суд) Господь твой, истинно, рассудит между ними Все то, в чем разошлись они.",
            "verse 32:26": "Разве для них не стало поучительным (уроком), Сколько до них Мы погубили поколений, По обиталищам которых они ходят и поныне? В этом, поистине, знамения для них, - Неужто им они не внемлют?",
            "verse 32:27": "Разве не видно им, Как Мы на выжженную землю льем дожди И ими взращиваем (хлебные) поля и нивы (травяные) И с них едят они и кормится их скот, - Неужто этого они не видят?",
            "verse 32:28": "И говорят они: \"Когда же будет этому развязка, Если вы правду говорите?\"",
            "verse 32:29": "Скажи (им): \"В День Развязки Неверным не поможет вера их, Не будет им дано отсрочки\".",
            "verse 32:30": "Так отвернись от них и жди, - Ведь они тоже ждут!"
        },
        "Sindhi": {
            "verse 32:1": "الٓمّٓ.",
            "verse 32:2": "(ھن) ڪتاب جو لاھڻ جنھن ۾ ڪو شڪ ڪونھي جھانن جي پالڻھار وٽان آھي.",
            "verse 32:3": "چوندا آھن ڇا ته اُن (قرآن) کي پاڻون ٺاھيو اٿس، (نه!) بلڪ اُھو تنھنجي پالڻھار وٽان سچو (آيل) آھي (ھِن لاءِ) ته اُنھيءَ قوم کي ڊيڄارين جن وٽ توکان اڳ ڪو ڊيڄاريندڙ نه آيو آھي ته مانَ اُھي ھدايت لھن.",
            "verse 32:4": "الله اُھو آھي جنھن آسمانن ۽ زمين کي ۽ جيڪي سندن وچ ۾ آھي سوڇھن ڏينھن ۾ بڻايو وري عرش ڏانھن متوجه ٿيو، اُن کانسواءِ اوھان لاءِ نڪي ڪو سڄڻ ۽ نڪي ڪو پارت ڪندڙ آھي، پوءِ نصيحت نه ٿا وٺو ڇا؟",
            "verse 32:5": "آسمان کان زمين ڏانھن ڪم جو بندوبست ڪندو آھي، وري (اُھو بندوبست) اُن ڏينھن ۾ ڏانھس مٿاھون ويندو آھي جنھن ڏينھن جو اندازو ھزار ورھ جيترو انھيءَ ليکي مان آھي جو ڳڻيندا آھيو.",
            "verse 32:6": "اِھو آھي جو ڳجھ ۽ ظاھر جو ڄاڻندڙ غالب مھربان آھي.",
            "verse 32:7": "جنھي جيڪا شيء پيدا ڪئي سا سڀڪا چڱيءَ طرح بڻائي ۽ ماڻھوءَ جي پيدائش کي مٽيءَ مان نئون شروع ڪيائين.",
            "verse 32:8": "وري سندس اولاد بي قدر پاڻيءَ جي نچوڙي مان بڻايائين.",
            "verse 32:9": "وري کيس سئين لڱين ڪيائين ۽ منجھس پنھنجو روح ڦوڪيائين ۽ اوھان لاءِ ڪن ۽ اکيون ۽ دليون بڻايائين، اوھين ٿورو شڪر ڪندا آھيو.",
            "verse 32:10": "۽ چون ٿا ته جڏھن زمين ۾ رلي ملي وياسون (تڏھن به) اسين وري نئين سر بڻباسين ڇا؟ (نه!) بلڪ اُھي پنھنجي پالڻھار جي ملڻ کان منڪر آھن.",
            "verse 32:11": "(اي پيغمبر کين) چؤ ته جيڪو موت جو فرشتو اوھان تي مقرّر ڪيل آھي سو اوھان جو روح ڪڍندو وري پنھنجي پالڻھار ڏانھن موٽائبؤ.",
            "verse 32:12": "۽ (اُنھي مھل) جيڪڏھن ڏسين جنھن مھل گنھگار پنھنجي پالڻھار جي سامھون پنھنجا ڪنڌ اونڌا ڪندڙ ھوندا (ته عجب ڪرين)، (۽ چوندا ته) اي اسانجا پالڻھار ڏٺوسون ۽ ٻڌوسون ھاڻي اسان کي (دُنيا ۾) موٽاءِ ته چڱا ڪم ڪريون بيشڪ اسين يقين ڪندڙ آھيون.",
            "verse 32:13": "۽ جيڪڏھن گھُرون ھا ته سڀڪنھن شخص کي ھدايت ڪريون ھا پر مون وٽان (ھي) حُڪم ٺھرائجي چڪو آھي ته جِنّن ۽ ماڻھن (انھن ئي) مڙني مان دوزخ ضرور ڀريندس.",
            "verse 32:14": "پوءِ ھن ڏينھن جي ملڻ کي جو وساريو ھيؤ تنھن سببان عذاب چکو، بيشڪ اسان (به) اوھان کي وساريو ۽ جيڪي ڪندا ھيؤ تنھن سببان ھميشگيءَ جو عذاب چکو.",
            "verse 32:15": "اسان جي آيتن تي رڳو اُھي ايمان آڻيندا جن کي اُنھن (آيتن) سان جڏھن نصيحت ڏبي آھي تڏھن سجدو ڪندڙ ٿي ڪِرندا آھن ۽ پنھنجي پالڻھار جي ساراھ پاڪائي سان بيان ڪندا آھن ۽ اُھي وڏائي نه ڪندا آھن.",
            "verse 32:16": "سندن پاسا سمھڻ جي ھنڌ کان الڳ ٿي پنھنجي پالڻھار کي خوف ۽ اُميد سان سڏيندا آھن، ۽ جيڪا کين روزي ڏني سون تنھن مان خرچيندا آھن.",
            "verse 32:17": "پوءِ جيڪو اکين جو ٺار انھن لاءِ لڪايو ويو آھي سو ڪو جيء نه ڄاڻندو آھي، اُھو بدلو ھنن جيڪي ڪمايو ھو تنھن سببان آھي.",
            "verse 32:18": "جيڪو مؤمن آھي سو بدڪار جي برابر آھي ڇا؟ (اُھي ٻئي ڪڏھن) برابر نه ٿيندا.",
            "verse 32:19": "جن ايمان آندو ۽ چڱا ڪم ڪيا تِن لاءِ بھشت (جا باغ) مھماني طور رھڻ جو ھنڌ آھي اُنھي سببان جو (چڱا) ڪم ڪندا رھيا.",
            "verse 32:20": "پر جن بڇڙائي ڪئي تن جي رھڻ جو ھنڌ دوزخ آھي، جنھن مھل منجھانئس نڪرڻ جو ارادو ڪندا (تنھن مھل) منجھس ورائي (پيا وجھبا) ۽ کين چئبو ته اُن باھ جو عذاب چکو جنھن کي اوھين ڪوڙ ڀائيندا ھئؤ.",
            "verse 32:21": "۽ کين وڏي عذاب کانسواءِ ھلڪي سزا (دنيا ۾ به) ضرور چکائينداسون ته مانَ اُھي (سڌي واٽ ڏانھن) ورن.",
            "verse 32:22": "۽ اُن کان وڌيڪ ظالم ڪير آھي جنھن کي سندس پالڻھار جي آيتن سان نصيحت ڏجي ته وري اُن کان مُنھن موڙي، بيشڪ اسين ڏوھارين کان بدلو وٺندڙ آھيون.",
            "verse 32:23": "۽ بيشڪ مُوسىٰ کي ڪتاب ڏنوسون پوءِ تون اُن (قرآن) جي ملڻ کان شڪ ۾ نه ٿج ۽ اُن موسىٰ کي بني اسرائيلن لاءِ ھدايت بڻايوسون.",
            "verse 32:24": "منجھانئن پيشوا ڪيا (ھوا) سون جي اسان جي حُڪم سان سڌو رستو ڏيکاريندا ھوا جڏھن جو (اُھي ڏکن تي) صبر ڪندا رھيا، ۽ اُھي اسان جي آيتن تي يقين رکندا ھوا.",
            "verse 32:25": "بيشڪ تنھنجو پالڻھار ئي قيامت جي ڏينھن سندن وچ ۾ انھيءَ (ڳالھ) جو نبيرو ڪندو جنھن بابت جھڳڙو ڪندا ھوا.",
            "verse 32:26": "کين پڌرو نه ٿيو آھي ڇا ته کانئن اڳ ڪيترا (ئي) جُڳ ناس ڪياسون جن جي گھرن ۾ (اُھي) گھُمندا آھن، بيشڪ ھن (ڳالھ) ۾ وڏيون نشانيون آھن، پوءِ نه ٻڌندا آھن پا؟",
            "verse 32:27": "نه ڏٺائون ڇا ته اسين اُٻڙٺ زمين ڏانھن پاڻي وھائيندا آھيون پوءِ اُن سان پوک ڄمائيندا آھيون جنھن مان سندن ڍور ۽ اُھي پاڻ کائيندا آھن، پوءِ نه ڏسندا آھن ڇا؟",
            "verse 32:28": "۽ چون ٿا ته جيڪڏھن اوھين سچا آھيو ته اھو فيصلو ڪڏھن ٿيندو؟",
            "verse 32:29": "(اي پيغمبر کين) چؤ ته فيصلي جي ڏينھن ڪافرن کي سندن ايمان آڻڻ فائدو نه ڏيندو ۽ نڪي کين مُھلت ڏبي.",
            "verse 32:30": "پوءِ کائن مُنھن موڙ ۽ انتظار ڪڍ بيشڪ اُھي (به) انتظار ڪڍندڙ آھن."
        },
        "Sinhalese": {
            "verse 32:1": "අලිෆ්, ලාම්, මීම්.",
            "verse 32:2": "මෙම ග්‍රන්ථයේ පහළවීම ලෝවැසියන්ගේ පරමාධිපතියාණන්ගෙනි. එහි කිසිදු සැකයක් නැත.",
            "verse 32:3": "එසේ නැතහොත් ඔහු එය ගෙතුවේ යැයි ඔවුහු පවසන්නෝ ද? එසේ නොව එය ඔබට පෙර කිසිදු අවවාද කරන්නෙකු හෝ ඔවුන් වෙත නොපැමිණි පිරිසකට ඔබ අවවාද කරනු පිණිසත් ඔවුන් යහමග ලැබිය හැකි වනු පිණිසත්ඔ බගේ පරමාධිපතිගෙන් පැමිණි සත්යයකි.",
            "verse 32:4": "අහස් හා මහපොළොව ද ඒ දෙක අතර ඇති දෑ ද දින හයකින් මැව්වේ අල්ලාහ්ය. පසු ව ඔහු රාජාසනය මත ස්ථාපිත විය. ඔහු හැර කිසිදු භාරකරුවකු හෝ මැදිහත්කරුවකු හෝ නුඹලාට නොමැත. (මෙයින්) නුඹලා උපදෙස් ලැබිය යුතු නොවේ ද?",
            "verse 32:5": "අහසේ සිට මහපොළොව දක්වා වූ සියලුම කරුණු ඔහු සැලසුම් කරයි. පසු ව එහි ප්‍රමාණය නුඹලා ගණන් කරන වසර දහසක් වූ දිනක ඔහු වෙත එය ආරෝහණය වෙයි.",
            "verse 32:6": "ඔහු අදෘශ්යමාන දෑ හා දෘශ්යමාන දෑ පිළිබඳ දැනුමැති සර්ව බලධාරී මහා කරුණාන්විතය.",
            "verse 32:7": "ඔහු මැවූ සියලු දෑ අලංකාරවත් කළේය. තවද මිනිසාගේ මැවීම මැටියෙන් ආරම්භ කළේය.",
            "verse 32:8": "පසුව ඔහුගේ පරපුර අල්පේච්චිත ජල ධාතුවෙන් ඇති කළේය.",
            "verse 32:9": "පසු ව ඔහු ඔහුව හැඩ ගන්වා ඔහුගේ ප්රාණයෙන් ඔහු තුළ පිඹ ප්‍රාණවත් කළේය. තවද නුඹලාට ශ්රවණය, දෘෂ්ටීන් හා හදවත් ඇති කළේය. නමුත් නුඹලා කෘතවේදී වනුයේ ස්වල්පයකි.",
            "verse 32:10": "තවද අපි මහපොළොවෙන් තුරන් ව ගිය විට නියත වශයෙන්ම අපි අලුත් මැවීමක් වන්නෙමු ද? යැයි ඔවුහු ප්‍රශ්න කළෝය. එසේ නොව, ඔවුහු ඔවුන්ගේ පරමාධිපතිගේ හමු ව ප්‍රතික්ෂේප කරන්නෝ වෙති.",
            "verse 32:11": "නුඹලාව භාර කරනු ලැබූ මලකුල් මවුත් හෙවත් මරණයේ දූතයා නුඹලා මරණයට පත් කරයි. පසු ව නුඹලාගේ පරමාධිපති වෙත නුඹලා යොමු කරනු ලබනු ඇත යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 32:12": "එවිට වැරදිකරුවෝ තම පරමාධිපති අබියස තම හිස් පහත් කර ගනිමින් අපගේ පරමාධිපතියාණනි! අපි දුටුවෙමු. අපි සවන් දුන්නෙමු. එහෙයින් අප ව නැවත එවනු මැනව! අපි යහකම් කරන්නෙමු. නියත වශයෙන්ම අපි ස්ථීර ව විශ්වාස කරන්නෝ වෙමු යැයි ඔවුන් පවසනු නුඹ දක්නිනේ නම් (එදින තත්ත්වය නුඹට හෙළි වේ.)",
            "verse 32:13": "තවද අපි අභිමත කළේ නම් සෑම ආත්මයකට එහි යහමග (මුල සිටම) පිරිනමන්නට තිබුණි. නමුත් (අපරාධකාරී) ජින් වර්ගයා සහ මිනිස් වර්ගයා යන සියල්ලන්ගෙන් මම නිරය පුරවන්නෙමි යන මා විසින් වූ ප්‍රකාශය නියම වී ඇත.",
            "verse 32:14": "එහෙයින් මේ නුඹලාගේ දිනයේ හමු ව නුඹලා අමතක කළ බැවින් නුඹලා භුක්ති විඳිනු. නියත වශයෙන්ම අපි නුඹලා අමතක කළෙමු. තවද නුඹලා සිදු කරමින් සිටි දෑ හේතුවෙන් සදාතනික දඬුවම භුක්ති විඳිනු.",
            "verse 32:15": "අපගේ වදන් විශ්වාස කරනුයේ ඒවා ඔවුනට මෙනෙහි කරනු ලබන විට (සිරස බිම තබා) සුජූද් කරමින් බිම වැටී ඔවුන්ගේ පරමාධිපතිගේ ප්‍රශංසා ව තුළින් සුවිශුද්ධ කළ අය වෙති. තවද ඔවුහු උඬගු නොවෙති.",
            "verse 32:16": "ඔවුන්ගේ ඇලපත් නිදියහන් වලින් ඔසවා ගෙන බියෙන් හා ආසාවෙන් ඔවුන්ගේ පරමාධිපතිට ඇරයුම් කරති. තවද අප ඔවුනට පෝෂණය කළ දැයින් ඔවුහු වියදම් කරති.",
            "verse 32:17": "එහෙයින් ඔවුන් සිදු කරමින් සිටි දෑ සඳහා ප්‍රතිඵලයක් වශයෙන් ඔවුන් සඳහා සඟවා තබනු ලැබූ ඇස් පිනවන දෑ කිසිදු ආත්මයක් නොදනී.",
            "verse 32:18": "කවරෙකු විශ්වාසවන්තයෙකු වූයේ ද ඔහු පාපතරයකු වූ අය මෙන් විය හැකි ද? ඔවුහු සමාන නොවෙති.",
            "verse 32:19": "විශ්වාස කොට යහකම් කළවුන් වනාහි ඔවුන් සිදු කළ දෑ හේතුවෙන් ඔවුනට සංග්‍රහයක් වශයෙන් නවාතැන් සහිත ස්වර්ග උයන් ඇත.",
            "verse 32:20": "තවද පාපකම් කළවුන් වූ කලී ඔවුන්ගේ නවාතැන (නිරයේ) ගින්නය. ඉන් බැහැර වීමට ඔවුන් සිතන සෑම මොහොතකම ඔවුන් එහි නැවත යොමු කරනු ලබති. තවද නුඹලා කවර දෙයක් පිළිබඳ බොරු කරමින් සිටියෙහු ද එම ගින්නේ දඬුවම නුඹලා භුක්ති විදිනු යැයි ඔවුනට පවසනු ලැබේ.",
            "verse 32:21": "තවද (පාපකම් වලින්) ඔවුන් නැවත හැරිය හැකි වනු පිණිස මෙම මහත් දඬුවමට පෙර සුළු දඬුවමකින් ඔවුනට විඳවන්නට සලස්වමු.",
            "verse 32:22": "තවද තම පරමාධිපතිගේ වදන් මෙනෙහි කරනු ලැබ පසු ව ඒවා පිටුපාන්නාට වඩා අපරාධකරු කවරෙකු ද? නියත වශයෙන්ම අපි වැරදි කරන්නන්ට ප්‍රතිවිපාක දෙන්නෝ වෙමු.",
            "verse 32:23": "තවද සැබැවින්ම අපි මූසාට ධර්ම ග්‍රන්ථය පිරිනැමුවෙමු. එහෙයින් ඔහුගේ හමුව පිළිබඳ ව සැකයෙහි නොවනු. තවද අපි එය ඉස්රාඊල් දරුවන්ට මග පෙන්වීමක් බවට පත් කළෙමු.",
            "verse 32:24": "තවද ඔවුන් ඉවසා අපගේ වදන් තරයේ විශ්වාස කරමින් සිටි හෙයින් අපගේ නියෝගය පරිදි මග පෙන්වන නායකයින් ඔවුන් අතරින් අපි පත් කළෙමු.",
            "verse 32:25": "ඔවුන් කවර දෙයක් ගැන මතභේද ඇති කරගෙන සිටියේ ද නියත වශයෙන්ම ඒ ගැන මළවුන් කෙරෙන් නැගිටුවනු ලබන දිනයේදී ඔබේ පරමාධිපති වන ඔහු ඔවුන් අතර තීන්දු කරයි.",
            "verse 32:26": "තවද ඔවුනට පෙර, පරම්පරාවන් කොපමණක් අප විනාශ කළෙමු ද? මොවුන් ඔවුන්ගේ වාසස්ථාන හරහා ගමන් කරති. එය ඔවුනට මගපෙන්වීමක් නොවී ද? නියත වශයෙන්ම එහි සංඥා ඇත. ඔවුහු සවන් නොදෙන්නෙහු ද?",
            "verse 32:27": "තවද නියත වශයෙන්ම අප ජලය නිසරු පොළොව වෙත ගෙන ගොස් එමගින් ඔවුන්ගේ ගොවිපළ සතුන් හා ඔවුන් අනුභව කරන භෝග අප හටගැන්වීම ඔවුහු නොදුටුවෝ ද? ඔවුහු නිරීක්ෂා කර නොබලන්නෙහු ද?",
            "verse 32:28": "තවද නුඹලා සත්යවාදීන් ලෙස සිටියෙහු නම් මෙම ජයග්‍රහණය කවදාදැයි (නුඹලා පවසනු යැයි) ඔවුහු විමසති.",
            "verse 32:29": "ජයග්‍රහණයේ දින, දේවත්වය ප්‍රතික්ෂේප කළවුනට ඔවුන්ගේ විශ්වාසය ඵල දෙන්නේ නැත. තවද ඔවුහු අවකාශ දෙනු ලබන්නන් නොවෙති යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 32:30": "එහෙයින් ඔබ ඔවුන් ගැන නොසලකා හරිනු. තවද ඔබ අපේක්ෂාවෙන් සිටිනු. නියත වශයෙන්ම ඔවුහු ද අපේක්ෂාවෙන් සිටින්නෝ වෙති."
        },
        "Somali": {
            "verse 32:1": "waxay ku tusin mugjisada Quraanka",
            "verse 32:2": "soo dajinta Quraanka shaki kuma jiro, wuxuuna ka soodagay Eebaha Calaamka xaggiisa.",
            "verse 32:3": "mise waxay dhihi waxaa been abuurtay (Nabiga) saas ma aha ee waa xaq Quraanku Eebahaa xaggiisa ka yimid si aad ugu digtid qoom uusan u imaanin dige kaa horeeya, si ay u hanuunaan,",
            "verse 32:4": "Eebe waa ka ku abuuray Samooyinka, iyo Dhulka iyo waxa u dhaxeeya Lix maalmood dhexdeed, markaasna ku istawooday Carshiga «si u cunanta» idiinmana sugnaanin Eebe ka sokow wali (gargaare) iyo shafecee midna, ee miyeydaan wax xusuusanayn.",
            "verse 32:5": "amarka Eebaa ka maamula Samada xagga Dhulka markaasaa amarkaasi xagga Eebe u koraa Maalin qadarkeedu yahay Kun sano oo waxaad tirinaysaana.",
            "verse 32:6": "kaasina waa Eebaha og wax maqan iyo waxa joogaba, ee adkaada ee Naxariista.",
            "verse 32:7": "Eebaa wanaajiyey abuuridda wax kasta, wuxuuna ka billaabay abuuridda Dadka Dhoobo, (Nabigii Aadam ahaa).",
            "verse 32:8": "markaas kayeelay faraciisii mid ka soo taxma Biyo taharyar.",
            "verse 32:9": "markaas ekeeyey oo ruuxdiisa ku afuufay idiinna yeelay maqal, Aragyaal iyo quluuba, waxyar baadse Eebe ku mahdisaan.",
            "verse 32:10": "waxay dhaheen Gaaladii ma markaan ku dhexluno dhulka (geeriyoonno) yaa abuurid cusub nala abuuri, saas ma aha ee iyagu la kulanka Eebahood bay ka gaaloobeen.",
            "verse 32:11": "waxaad dhahdaa waxaa idin oofsan (dili) Malaga mowdka laydiin wakiishay markaasaa xagga Eebihiin laydiin celin.",
            "verse 32:12": "haddaad arki lahayd marka dambiilayaashu madaxa hoos u dhigi (qiyaamada) Eebahood agtiisa (iyagoo dhihi) Eebahanow waan aragnay waana maqalay ee naceli si aan camalfiican u fallo waan yaqiininaye (waxaad arki lahayd wax yaableh).",
            "verse 32:13": "haddaan doono waxaan siin lahayn (ku toosin lahayn) Nafkasta hanuunkeeda hase yeeshee waxaa hormaray Hadalkaygii in laga buuxin Jahannamo Jinno iyo Insi dhammaan.",
            "verse 32:14": "ee dhadhamiya halmaanshihiinii la kulanka Maalintiinnan (qiyame) annaguna waan idinka tagaynaa (maanta) ee dhadhamiya cadaabka waaridda camalkiinii dartiis.",
            "verse 32:15": "waxaa uun rumayn aayaadkanaga kuwa marka lagu waaniyo aayadaha sujuud la dhaca kuna tasbiixsada mahadda Eebahood iyagoon is kibrinayn (isla waynayn).",
            "verse 32:16": "waxayna ka dheeraataa dhinacyadoodu jiifka iyagoo baryi Eebahood cabsi iyo rajaynba waxaan ku arzuqnayna wax ka bixiya.",
            "verse 32:17": "ma oga Nafu waxa loo qariyay kuwaas oo Indho ku qaboowsadaan abaal marin waxay camalfalayeen dartiis.",
            "verse 32:18": "ruux Mu'min ah mala midbaa mid faasiq ah, ma eka.",
            "verse 32:19": "kuwa rumeeyay (xaqa) oo camal fiican falay waxay mudan Jannooyinka Ma'wa martiqaad waxay xamal falayeen dartiis.",
            "verse 32:20": "kuwase faasiqoobay waxay ku hoyan Naar, markay doonaan inay ka baxaanna waa lagu celin dhexdeeda waxaana lagu dhihi dhadhamiya Cadaabka Naartii aad beenin jirteen.",
            "verse 32:21": "waxaana dhadhansiinaynaa cadaab hoose cadaab wayn kasokow inay noqdaan darteed.",
            "verse 32:22": "yaa ka dulmi badan ruux lagu waaniyay aayaadka Eebihiis oo ka jeedsaday xaggeeda, anaguna dambiilayaasha waan ka aarsanaynaa.",
            "verse 32:23": "dhab ahaanbaan u siinay Nabi Muuse Kitaabkii (Tawreed) ee hashakiyin lakulankiisa waxaana ka yeelay Kitaabkaas hanuunka Banii Israa'iil.",
            "verse 32:24": "waxaana ka yeelay qaarka mid ah imaamyo ku hanuuniya amarkanaga markay samreen, waxayna ahaayeen kuwa aayaadkanaga yaqiiniya.",
            "verse 32:25": "Eebahaabaana kala bixin dhexdooda Maalinta Qiyaame waxay ahaayeen kuwo isku diidan.",
            "verse 32:26": "myayna ku hanuunin kuwaasi intaan halaagnay hortood oo quruun ah oy socon guryahoodii, taasina waxaa ku sugan calaamado ee miyayna wax maqlaynin.",
            "verse 32:27": "miyeyna arkeyn inaan u soo kaxayno Biyaha Dhul abaar ah oon markaas ku soobixino Beero ay wax ka cunaan Xoolahooda iyo Naftooduba miyeyna wax arkaynin.",
            "verse 32:28": "waxay dhihi waa goorma kala xukunku haddaad run sheegaysaan.",
            "verse 32:29": "waxaad dhahdaa maalinta kala xukunka Gaalada ma anfaco Iimaankoodu lamaga sugo.",
            "verse 32:30": "Ee isaga jeedso oo sug iyana ha sugeene."
        },
        "Spanish": {
            "verse 32:1": "Alif, Lam, Mim.",
            "verse 32:2": "Es una revelación del Libro en el que no hay duda, procedente del Señor de los mundos.",
            "verse 32:3": "O es que dicen que se lo ha inventado?Pero no, es la verdad procedente de tu Señor para que adviertas a unas gentes a las que antes de ti no les había llegado ningún advertidor.Quizás se puedan guiar.",
            "verse 32:4": "Allah es Quien creó los cielos y la tierra y lo que hay entre ellos en seis días, a continuación se asentó en el Trono.Fuera de Él no tenéis quien os proteja ni quien interceda por vosotros. No vais a recapacitar?",
            "verse 32:5": "Los asuntos que decreta bajan desde el cielo a la tierra y luego ascienden a Él en un día que equivale a mil años de los que contáis.",
            "verse 32:6": "Él es Quien conoce el No-Visto y lo Aparente; el Poderoso, el Compasivo.",
            "verse 32:7": "Aquel que todo lo que ha creado lo ha hecho bien y comenzó la creación del hombre a partir de barro.",
            "verse 32:8": "E hizo que su descendencia se produjera a partir de una gota de agua insignificante.",
            "verse 32:9": "Luego le dio forma e insufló en él parte de Su espíritu. Y os dio el oído, la vista y el corazón. Qué poco agradecéis!",
            "verse 32:10": "Y dicen: Acaso cuando hayamos desaparecido bajo la tierra iremos a ser creados de nuevo? Pero no, ellos se niegan a creer que habrán de encontrarse con su Señor.",
            "verse 32:11": "Di: El ángel de la muerte, que está encargado de vosotros, os tomará, luego volveréis a vuestro Señor.",
            "verse 32:12": "Y si pudierais ver cuando los malhechores inclinen la cabeza ante su Señor: Señor nuestro! Míranos, escúchanos y déjanos regresar para que actuemos con rectitud, realmente ahora tenemos certeza.",
            "verse 32:13": "Si hubiéramos querido le habríamos dado a cada uno su guía, sin embargo se ha de cumplir Mi palabra: \"Llenaré Yahannam de genios y hombres todos juntos\".",
            "verse 32:14": "Así pues, gustad, porque olvidasteis que os íbais a encontrar con este día. Nosotros os hemos olvidado.Gustad el castigo de la inmortalidad por lo que hicisteis!",
            "verse 32:15": "Sólo creen en Nuestros signos aquéllos que cuando se les mencionan caen postrados, glorifican a su Señor con las alabanzas que Le son debidas y no tienen soberbia.",
            "verse 32:16": "Levantan su costado de los lechos para invocar a su Señor con temor y anhelo y dan de la provisión que les damos.",
            "verse 32:17": "Nadie sabe la frescura de ojos que les espera como recompensa por lo que hicieron.",
            "verse 32:18": "Acaso el que es creyente es como el descarriado? No son iguales.",
            "verse 32:19": "Los que creen y llevan a cabo las acciones de bien, tendrán como hospedaje, por lo que hicieron, los Jardines del Refugio.",
            "verse 32:20": "Pero los descarriados tendrán como refugio el Fuego.Cada vez que quieran salir de él serán devueltos y se les dirá: Gustad el castigo del Fuego cuya realidad negabais!",
            "verse 32:21": "Y además del castigo mayor les haremos probar el castigo más inmediato por si pudieran volverse atrás.",
            "verse 32:22": "Y quién es más injusto que aquél al que se le mencionan los signos de su Señor y se aparta de ellos? Es cierto que nos vengaremos de los que hagan el mal.",
            "verse 32:23": "Es verdad que le dimos el Libro a Musa, no tengas ninguna duda del encuentro con Nosotros; y lo hicimos un guía para los hijos de Israel.",
            "verse 32:24": "E hicimos de algunos de ellos dirigentes que guiaban según Nuestro mandato, mientras eran pacientes y tenían certeza de Nuestros signos.",
            "verse 32:25": "Tu Señor resolverá entre ellos el Día del Levantamiento acerca de lo que discrepaban.",
            "verse 32:26": "Es que no les sirven de guía todas las generaciones anteriores a ellos que hemos destruido? Caminan por donde vivían.Realmente en eso hay signos.No prestarán atención?",
            "verse 32:27": "Acaso no ven que llevamos el agua a una tierra seca y gracias a ella, hacemos que broten semillas de las que come su ganado y ellos mismos? Es que no van a ver?",
            "verse 32:28": "Y dicen: Cuándo tendrá lugar la victoria si es verdad lo que decís?",
            "verse 32:29": "Di: El día de la victoria, de nada les servirá a los que se negaron a creer que crean ni se les dará un tiempo de espera.",
            "verse 32:30": "Apártate de ellos y espera, que su caso es sólo cuestión de tiempo."
        },
        "Swahili": {
            "verse 32:1": "Alif Lam Mim (A. L. M.)",
            "verse 32:2": "Huu ni mteremsho wa Kitabu kisicho kuwa na shaka yoyote kinacho toka kwa Mola Mlezi wa walimwengu wote.",
            "verse 32:3": "Au wanasema: Amekizua? Bali hichi ni Kweli iliyo toka kwa Mola wako Mlezi ili uwaonye watu wasio fikiwa na mwonyaji kabla yako; huenda wakaongoka.",
            "verse 32:4": "Mwenyezi Mungu ndiye aliye umba mbingu na ardhi na viliomo baina yao kwa siku sita, na akatawala kwenye Kiti cha Enzi. Nyinyi hamna mlinzi wala mwombezi isipo kuwa Yeye tu. Basi, je, hamkumbuki?",
            "verse 32:5": "Anapitisha mambo yote yalio baina mbingu na ardhi, kisha yanapanda kwake kwa siku ambayo kipimo chake ni miaka elfu kwa mnavyo hisabu nyinyi.",
            "verse 32:6": "Huyu ndiye Mwenye kuyajua yasiyo onekana na yanayo onekana. Mwenye nguvu, Mwenye kurehemu.",
            "verse 32:7": "Ambaye ametengeneza vizuri umbo la kila kitu; na akaanzisha kumuumba mtu kwa udongo.",
            "verse 32:8": "Na kisha akajaalia uzao wake utokane na kizazi cha maji madhaifu.",
            "verse 32:9": "Kisha akamtengeneza, na akampulizia roho yake, na akakujaalieni kusikia na kuona, na nyoyo za kufahamu. Ni uchache mnavyo shukuru.",
            "verse 32:10": "Nao husema: Tutapo kwisha potea chini ya ardhi, ni kweli tutarudishwa katika umbo jipya? Bali wao wanakanusha kwamba watakutana na Mola wao Mlezi.",
            "verse 32:11": "Sema: Atakufisheni Malaika wa mauti aliye wakilishwa juu yenu; kisha mtarejeshwa kwa Mola wenu Mlezi.",
            "verse 32:12": "Na ungeli waona wakosefu wanvyo inamisha vichwa vyao mbele ya Mola wao Mlezi, (wakisema): Mola wetu Mlezi! Tumesha ona, na tumesha sikia. Turejeshe tukatende mema, kwani hakika sisi tumekwisha kuwa na yakini sasa.",
            "verse 32:13": "Na lau tungeli taka tunge mpa kila mtu uwongofu wake. Lakini imekwisha kuwa kauli iliyo toka kwangu: Kwa yakini nitaijaza Jahannamu kwa wote hawa, majini na watu.",
            "verse 32:14": "Basi onjeni kwa vile mlivyo usahau mkutano wa Siku yenu hii. Na Sisi hakika tunakusahauni. Basi onjeni adhabu ya milele kwa yale mliyo kuwa mkiyatenda.",
            "verse 32:15": "Hakika wanao ziamini Aya zetu ni hao tu ambao wakikumbushwa hizo, basi wao huanguka kusujudu, na humsabihi Mola wao Mlezi kwa kumhimidi, nao hawajivuni.",
            "verse 32:16": "Mbavu zao zinaachana na vitanda kwa kumwomba Mola wao Mlezi kwa khofu na kutumaini, na hutoa kutokana na tulivyo waruzuku.",
            "verse 32:17": "Nafsi yoyote haijui waliyo fichiwa katika hayo yanayo furahisha macho - ni malipo ya yale waliyo kuwa wakiyatenda.",
            "verse 32:18": "Ati aliye Muumini atakuwa sawa na aliye mpotovu? Hawawi sawa.",
            "verse 32:19": "Ama walio amini na wakatenda mema, watakuwa nazo Bustani za makaazi mazuri. Ndio pa kufikia kwa waliyo kuwa wakiyatenda.",
            "verse 32:20": "Na ama wale walio tenda uovu, basi makaazi yao ni Motoni. Kila wakitaka kutoka humo watarudishwa humo humo. Na wataambiwa: Onjeni adhabu ya Moto ambayo mliyo kuwa mkiikanusha.",
            "verse 32:21": "Na tutawaonjesha adhabu khafifu kabla ya adhabu kubwa, huenda labda watarejea.",
            "verse 32:22": "Na ni nani dhaalimu mkubwa kuliko yule anaye kumbushwa kwa Ishara za Mola wake Mlezi, kisha akazikataa? Hakika Sisi tutajilipiza kwa wakosefu.",
            "verse 32:23": "Hakika Sisi tulikwisha mpa Musa Kitabu. Basi usiwe na shaka kuwa kakipokea. Na tukakifanya kuwa ni uwongofu kwa Wana wa Israili.",
            "verse 32:24": "Na tukawafanya miongoni mwao waongozi wanao ongoa watu kwa amri yetu, walipo subiri na wakawa na yakini na Ishara zetu.",
            "verse 32:25": "Hakika Mola wako Mlezi ndiye atakaye fafanua baina yao Siku ya Kiyama katika waliyo kuwa wakikhitalifiana.",
            "verse 32:26": "Je! Haijawabainikia kwamba kaumu ngapi tuliziangamiza kabla yao, nao wanapita katika maskani zao hizo? Hakika katika hayo zipo Ishara. Basi, je, hawasikii?",
            "verse 32:27": "Je! Hawaoni ya kwamba tunayapeleka maji kwenye ardhi kavu, kisha kwayo tunaitoa mimea wanayo kula wanyama wao na wao wenyewe? Je! Hawaoni?",
            "verse 32:28": "Wanasema: Ushindi huu ni lini, kama mnasema kweli?",
            "verse 32:29": "Sema: Siku ya Ushindi, wale walio kufuru imani yao haitawafaa kitu, wala wao hawatapewa muhula.",
            "verse 32:30": "Basi wapuuze, nawe ngonja; hakika wao wanangoja."
        },
        "Swedish": {
            "verse 32:1": "Alif lam meem.",
            "verse 32:2": "DENNA Skrift har uppenbarats av världarnas Herre - det står utom allt tvivel -",
            "verse 32:3": "och ändå säger de: \"Han har [själv] författat den.\" Nej, den är sanningen från din Herre, [och med den] skall du varna ett folk som ingen varnare har kommit till före dig - kanske skall de låta sig ledas på rätt väg.",
            "verse 32:4": "DET ÄR Gud som har skapat himlarna och jorden och allt däremellan under sex dagar och som tronar [över skapelsen] i Sin allmakts härlighet. Ni har ingen beskyddare utom Honom och ingen som kan tala till er förmån - vill ni inte tänka över detta",
            "verse 32:5": "Han styr skapelsens ordning, från det högsta till det lägsta, och till sist stiger allt upp till Honom under en Dag vars längd, så som ni räknar, är tusen år.",
            "verse 32:6": "Det är Han som känner allt det som är dolt för människor och det som de kan bevittna, den Allsmäktige, den Barmhärtige,",
            "verse 32:7": "som åt allt vad Han skapar ger en fulländad [form]. Först skapar Han människan av lera;",
            "verse 32:8": "därefter låter Han hennes avkomma avlas av en droppe av en oansenlig vätska;",
            "verse 32:9": "därefter formar Han henne och andas in i henne något av Sin ande och skänker henne hörsel och syn samt förmågan att känna och förstå. Men ni visar sällan tacksamhet!",
            "verse 32:10": "Och de säger: \"Skall vi, sedan våra [rester] upplösts i jorden, skapas på nytt?\" Ja, de förnekar till och med mötet med sin Herre!",
            "verse 32:11": "Säg: \"Dödens ängel, som har satts att vaka över er, skall [en dag] samla in era själar och därefter förs ni åter till er Herre.\"",
            "verse 32:12": "Om du såg de obotfärdiga syndarna när de står med sänkta huvuden inför sin Herre [och säger:] \"Herre! Vi har sett och vi har hört; låt oss få återvända [till jorden]! Då skall vi leva ett rättskaffens liv - [nu] har vi visshet.\"",
            "verse 32:13": "Om Vi hade velat, kunde Vi ha väglett varje människa, men [detta var inte Vår vilja och] så bekräftas Mitt ord: \"Jag skall sannerligen fylla helvetet med osynliga väsen och människor, alla tillsammantagna!\"",
            "verse 32:14": "[Och Han skall säga till syndarna:] \"Pröva nu följden av att ni glömde [Vårt] möte denna Dag; Vi har [även] glömt er. Smaka straffet för era handlingar, [ett straff] som skall vara i evighet!\"",
            "verse 32:15": "BARA DE tror på Våra budskap som, när de läses högt för dem, faller ned i tillbedjan och lovprisar sin Herre, utan en skymt av högmod;",
            "verse 32:16": "de som avstår från sömn för att med fruktan och hopp åkalla sin Herre och som ger åt andra av det som Vi har skänkt dem för deras försörjning.",
            "verse 32:17": "Ingen människa vet vilka dolda [skatter av] djup glädje som väntar de [troende] som belöning för deras handlingar.",
            "verse 32:18": "Kan en troende jämföras med syndaren som trotsar [Gud]? De är inte lika [och kommer inte att behandlas lika].",
            "verse 32:19": "De som tror och lever rättskaffens skall som belöning för sina handlingar få en fristad i lustgårdar, där de hälsas välkomna.",
            "verse 32:20": "Men syndarna som trotsar [Gud] skall få Elden till boning - var gång de vill komma ut ur den skall de drivas tillbaka in med ropet: \"Smaka Eldens straff, som ni påstod vara en lögn!\"",
            "verse 32:21": "Innan de får smaka det eviga straffet skall Vi helt visst straffa dem i denna värld - kanske [grips de då av ånger och] vänder tillbaka [till Gud].",
            "verse 32:22": "Och vem är mer orättfärdig än den som, när han blir påmind om sin Herres budskap, vänder dem ryggen? [Sådana] syndare skall Vi sannerligen låta känna på Vårt straff!",
            "verse 32:23": "OCH VI skänkte Moses [Vår] uppenbarelse; tvivla då inte på att du [i Koranen] har fått möta [samma sanning]. Den [tidigare uppenbarelsen] gav Vi till vägledning för Israels barn,",
            "verse 32:24": "och när de bar sina motgångar med tålamod och bevarade sin övertygelse att Våra budskap [utgör sanningen], lät Vi ledare uppstå bland dem som ledde dem i enlighet med Våra bud.",
            "verse 32:25": "PÅ Uppståndelsens dag skall din Herre fälla avgörandet mellan [människorna] i de frågor där de var oense.",
            "verse 32:26": "Skall inte [vetskapen om] alla de släkten som Vi lät gå under före dem - [människor] vars boplatser de trampar - förmå dem att tänka sig för? I allt detta ligger sannerligen budskap; skall de inte lyssna",
            "verse 32:27": "Inser de inte att det är Vi som leder regnet till dött land så att det kan ge skördar som tjänar till föda för deras boskap och för dem själva? Skall de inte öppna sina ögon",
            "verse 32:28": "Men de säger: \"När skall det avgörande [ni talar om] falla, om det som ni säger är sant?\"",
            "verse 32:29": "Säg [Muhammad]: \"Den Dag då avgörandet faller skall de som förnekade sanningen inte ha någon glädje av den tro [som de för sent kommer att bekänna] och de skall inte få något uppskov.\"",
            "verse 32:30": "Lämna dem nu åt sig själva och vänta [på det som skall komma]; även de skall vänta."
        },
        "Tajik": {
            "verse 32:1": "Алиф, Лом, Мим.",
            "verse 32:2": "Нозил шудани ин китоб, ки дар он ҳеҷ шакке нест, аз ҷониби Парвардигори ҷаҳониён аст.",
            "verse 32:3": "Оё мегӯянд: «(Қуръонро) худаш бофтааст?» На, суханест барҳақ аз ҷониби Парвардигорат, то мардумеро, ки пеш аз ту бимдиҳандае надоштаанд, тарсонӣ. Шояд ба роҳи ҳидоят раванд.",
            "verse 32:4": "Худост, ки осмонҳову заминро ва он чӣ миёни онҳост, дар шаш рӯз биёфарид ва он гоҳ ба арш пардохт. Шуморо ҷуз Ӯ корсозу шафеъе нест. Оё панд намегиред?",
            "verse 32:5": "Корро аз осмон то замин сомон медиҳад. Сипас дар рӯзе, ки, миқдори он ҳазор сол аст, чунон ки мешуморед, ба сӯи Ӯ боло меравед.",
            "verse 32:6": "Ӯст, ки донои ниҳону ошкор аст. Пирӯзманду меҳрубон аст.",
            "verse 32:7": "Он кӣ ҳар чиро офарид, ба некӯтарин ваҷҳ офарид ва хилқати офаридани инсонро аз гил оғоз кард.",
            "verse 32:8": "Сипас насли ӯро аз усораи (шираи) обе беқадр падид овард.",
            "verse 32:9": "Он гоҳ, аъзои ӯ рост кард ва аз рӯҳи худ дар он бидамид. Ва бароятон гӯшу чашмҳо ва дилҳо офарид. Чӣ андак шукр мегӯед!",
            "verse 32:10": "Ва гуфтанд: «Оё вақте ки дар замин нопадид шавем, офариниши тозае хоҳем ёфт?» Оре, онҳо ба дидор бо Парвардигорашон имон надоранд!",
            "verse 32:11": "Бигӯ: «Фариштаи марг, ки муваккал (гумошта) бар шумост, шуморо мемиронад. Сипас ба сӯи Парвардигоратон бозгардонида мешавед».",
            "verse 32:12": "Туро ибрат аст, он гоҳ ки гунаҳкоронро дар назди Парвардигорашон сарафканда бинӣ. Гӯянд: «Эй Парвардигори мо, дидем ва шунидем. Акнун моро бозгардон то коре шоиста кунем, ки инак ба яқин расидаем».",
            "verse 32:13": "Агар мехостем, ҳидояти ҳар касро ба ӯ ато мекардем, вале ваъдаи Ман, ки ҷаҳаннамро аз ҳаман ҷинниёну одамиён пур мекунам, ҳақ аст.",
            "verse 32:14": "Ба ҷазои он, ки дидори чунин рӯзеро фаромӯш карда будед, акнун бичашед. Мо низ шуморо аз ёд бурдаем. Ба сазои корҳое, ки мекардаед, азоби ҷовидро бичашед!",
            "verse 32:15": "Танҳо касоне ба оёти Мо имон овардаанд, ки чун оёти Моро бишнаванд, ба саҷда бияфтанд ва Парвардигорашонро ба покӣ биситоянд ва саркашӣ накунанд (Сачда).",
            "verse 32:16": "Аз бистари хоб паҳлӯ тиҳӣ (бедорхобӣ) мекунанд, Парвардигорашонро бо биму умед илтиҷо мекунанд ва аз он чӣ ба онҳо додаем, садақа мекунанд.",
            "verse 32:17": "Ва ҳеҷ кас аз он мукофоте аз хушиву хурсандӣ хабар надорад, ки ба музди корҳои кардааш, барояш пинҳон карда шудааст.",
            "verse 32:18": "Оё он кас, ки имон оварда, мопанди кассет, ки фисқ меварзад? На, баробар нестанд!",
            "verse 32:19": "Аммо онон, ки имон овардаанд ва корҳои шоиста кардаанд, ба ҷазои неки амалҳое, ки макардаанд, манзилгоҳе дар боғҳои биҳишт хоҳанд ёфт.",
            "verse 32:20": "Ва аммо фосиқон, манзилгоҳашон оташ аст. Ҳар гоҳ ки бихоҳанд аз он берун оянд, бори дигар онҳоро ба даруни оташ бозгардонанд ва бигӯяндашон: «Бичашед азоби оташеро, ки дурӯғаш мепиндоштед!»",
            "verse 32:21": "Ва азоби дунёро пеш аз он азоби бузургтар ба онҳо бичашонем, шояд, ки бозгарданд!",
            "verse 32:22": "Кист ситамкортар аз он касе, ки ӯро ба оёти Парвардигораш панд диҳанд, вале рӯй гардонад? Мо аз гунаҳкорон интиқом мегирем!",
            "verse 32:23": "Ҳақиқатан ба Мӯсо китоб додем. Аз дидори ӯ дар шубҳа мабош. Ва онро роҳнамои банӣ-Исроил қарор додем.",
            "verse 32:24": "Аз миёни он қавм пешвоёне падид овардем, ки чун сабр пеша карданд ва ба оёти Мо яқин доштанд, ба фармоии Мо мардумро ҳидоят мекарданд.",
            "verse 32:25": "Албатта Парвардигори ту дар рӯзи қиёмат дар он чӣ ихтилоф мекарданд, миёнашон довари хоҳад кард.",
            "verse 32:26": "Оё он ҳама мардумеро, ки пеш аз онҳо ҳалок кардем ва акнун инҳо дар хонаҳояшон роҳ мераванд, сабаби ҳидояташон нашуд? Дар ин ибратҳост, чаро намешунаванд?",
            "verse 32:27": "Оё намебинанд, ки обро ба замини хушку бегиёҳ равона месозем, то киштзорҳо бирӯёнем ва чорпоён ва худашон аз он бихӯранд? Чаро намебинанд?",
            "verse 32:28": "Мегӯянд: «Агар рост мегӯед, пирӯзӣ чӣ вақт хоҳад буд?»",
            "verse 32:29": "Бигӯ: «Дар рӯзи пирӯзӣ, имон овардани кофирон фоидаашон надиҳад ва мӯҳлаташон надиҳад».",
            "verse 32:30": "Пас аз онҳо рӯй гардон ва мунтазир бош, ки онҳо низ дар интизоранд."
        },
        "Tamil": {
            "verse 32:1": "அலிஃப், லாம், மீம்.",
            "verse 32:2": "அகிலங்களின் இறைவனிடம் இருந்து அருளப்பட்டுள்ளது - இவ்வேதம் என்பதில் சந்தேகமே இல்லை.",
            "verse 32:3": "ஆயினும் அவர்கள் \"இவர் இதை இட்டுக்கட்டிக் (கற்பனை செய்து) கொண்டார்\" என்று (உம்மைப் பற்றிக்) கூறுகிறார்களா? அவ்வாறல்ல, எவர்களுக்கு உமக்கு முன் அச்சமூட்டி எச்சரிப்பவர் வந்ததில்லையோ, அந்த சமூகத்தாருக்கு, அவர்கள் நேர்வழியில் செல்லும் பொருட்டு நீர் அச்சமூட்டி எச்சரிக்கை செய்வதற்காக உம்முடைய இறைவனிடமிருந்து வந்துள்ள உண்மை(வேதமாகும்).",
            "verse 32:4": "அல்லாஹ் தான் வானங்களையும், பூமியையும், இவ்விரண்டிற்கும் இடையிலிருப்பவற்றையும் ஆறு நாட்களில் படைத்துப்பின் அர்ஷின் மீது அமைந்தான்; அவனையன்றி உங்களுக்கு உதவியாளரோ, பரிந்து பேசுபவரோ இல்லை. எனவே (இவற்றையெல்லாம்) நீங்கள் (நினைத்து) சிந்திக்க வேண்டாமா?",
            "verse 32:5": "வானத்திலிருந்து பூமி வரையிலுமுள்ள காரியத்தை அவனே ஒழுங்குபடுத்துகிறான்; ஒரு நாள் (ஒவ்வொரு காரியமும்) அவனிடமே மேலேறிச் செல்லும், அந்த (நாளின்) அளவு நீங்கள் கணக்கிடக்கூடிய ஆயிரம் ஆண்டுகளாகும்.",
            "verse 32:6": "அவனே மறைவானதையும், வெளிப்படையானதையும் நன்கு அறிந்தவன்; (அன்றியும் அவனே யாவற்றையும்) மிகைத்தவன்; அன்புடையோன்.",
            "verse 32:7": "அவனே தான் படைத்துள்ள ஒவ்வொரு பொருளையும் அழகாக்கினான்; இன்னும், அவன் மனிதனின் படைப்பைக் களி மண்ணிலிருந்து ஆரம்பித்தான்.",
            "verse 32:8": "பிறகு (நழுவும்) அற்பத் துளியாகிய (இந்திரிய) சத்திலிருந்து, அவனுடைய சந்ததியை உண்டாக்கினான்.",
            "verse 32:9": "பிறகு அவன் அதைச் சரி செய்து, அதனுள்ளே தன் ரூஹிலிருந்தும் ஊதினான் - இன்னும் உங்களுக்கு அவன் செவிப்புலனையும், பார்வைப் புலன்களையும், இருதயங்களையும் அமைத்தான்; (இருப்பினும்) நீங்கள் நன்றி செலுத்துவது மிகச் சொற்பமேயாகும்.",
            "verse 32:10": "\"நாம் பூமியில் அழிந்து போய் விடுவோமாயின் மெய்யாகவே நாங்கள் புதிய படைப்பாவோமா?\" எனவும் அவர்கள் கூறுகின்றனர்; ஏனெனில் அவர்கள் தங்கள் இறைவனைச் சந்திப்பதையே நிராகரிப்போராய் இருக்கிறார்கள்.",
            "verse 32:11": "\"உங்கள் மீது நியமிக்கப்பட்டிருக்கும், \"மலக்குல் மவ்து\" தாம் உங்கள் உயிரைக் கைப்பற்றுவார் - பின்னர் நீங்கள் உங்கள் இறைவனிடம் மீள்விக்கப்படுவீர்கள்\" என்று (நபியே!) நீர் கூறும்.",
            "verse 32:12": "மேலும், இக்குற்றவாளிகள் தம் இறைவன் முன் தலைகுனிந்தவர்களாய், \"எங்கள் இறைவா! நாங்கள் (இப்பொழுது) பார்த்துக் கொண்டோம், கேட்டும் கொண்டோம் - ஆகவே, நீ (உலகுக்கு) எங்களைத் திருப்பி அனுப்பிவை நாங்கள் நற்கருமங்களையே செய்வோம். நிச்சயமாய் நாங்கள் (நம்பிக்கையில்) உறுதியுள்ளவர்களாக ஆகிவிட்டோம்\" என்று சொல்லும்போது (நபியே!) நீர் பார்ப்பீராயின் (அவர்களுடைய நிலையை நீர் அறிந்து கொள்வீர்).",
            "verse 32:13": "மேலும் நாம் நாடியிருந்தால், ஒவ்வோர் ஆத்மாவுக்கும் அதற்குரிய நேர்வழியை நாம் கொடுத்திருப்போம்; ஆனால் \"நான் நிச்சயமாக நரகத்தை - ஜின்களையும், (தீய) மனிதர்களையும் - ஆகிய யாவரையும் கொண்டு நிரப்புவேன்\" என்று என்னிடமிருந்து (முன்னரே) வாக்கு வந்துள்ளது.",
            "verse 32:14": "ஆகவே, உங்களுடைய இந்த நாளின் சந்திப்பை நீங்கள் மறந்திருந்ததின் (பலனை) அனுபவியுங்கள், நிச்சயமாக நாமும் உங்களை மறந்து விட்டோம்; மேலும் நீங்கள் செய்த (தீ) வினையின் பயனாக என்றென்றும் நிலையான வேதனையை அனுபவியுங்கள்\" (என்று அவர்களுக்குச் சொல்லப்படும்).",
            "verse 32:15": "நம் வசனங்களின் மேல் நம்பிக்கை கொண்டோர் யாரென்றால் அவர்கள், அவற்றின் மூலம் நினைவூட்டப்பட்டால், அவர்கள் விழுந்து ஸுஜூது செய்தவர்களாய்த் தம் இறைவனைப் புகழ்ந்து, துதிப்பார்கள்; அவர்கள் பெருமை அடிக்கவும் மாட்டார்கள்.",
            "verse 32:16": "அவர்களுடைய விலாக்களைப் படுக்கைகளிலிருந்து (தூக்கத்தைத் துறந்து) உயர்த்தி அவர்கள் தங்களுடைய இறைவனை அச்சத்தோடும் நம்பிக்கை ஆர்வத்தோடும் பிரார்த்தனை செய்வார்கள்; மேலும் நாம் அவர்களுக்கு அளித்ததிலிருந்து (தானதர்மங்களில்) செலவும் செய்வார்கள்.",
            "verse 32:17": "அவர்கள் செய்த (நற்) கருமங்களுக்குக் கூலியாக மறைத்து வைக்கப்பட்டுள்ள கண் குளிர்ச்சியை (மறுமையின் பேரின்பத்தை) எந்த ஓர் ஆன்மாவும் அறிந்து கொள்ள முடியாது.",
            "verse 32:18": "எனவே, (அத்தகைய) முஃமினானவர் (வரம்பு மீறிய) பாவியைப் போல் ஆவாரா? (இருவரும்) சமமாக மாட்டார்கள்.",
            "verse 32:19": "எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்களைச் செய்கிறார்களோ அவர்களுக்கு அவர்கள் செய்யும் (நற்)கருமங்களின் காரணமாக சுவனபதிகள் தங்குமிடங்களாகி (அங்கு அவர்கள்) விருந்தினராய் (உப சரிக்கப்படுவார்கள்).",
            "verse 32:20": "ஆனால் எவர்கள் (வரம்பு மீறிப்) பாவம் செய்தார்களோ, அவர்கள் தங்குமிடம் (நரக) நெருப்புத்தான் - அவர்கள் அதை விட்டு வெளியேற நாடும் போதெல்லாம், அதிலேயே மீண்டும் தள்ளப்பட்டு \"எதனை நீங்கள் பொய்ப்பித்துக் கொண்டிருந்தீர்களோ அந்த (நரக) நெருப்பின் வேதனையை அனுபவியுங்கள்\" என்று அவர்களுக்குச் சொல்லப்படும்.",
            "verse 32:21": "மேலும், அவர்கள் (பாவங்களிலிருந்து) திரும்பி விடும் பொருட்டுப் பெரிய வேதனையை (மறுமையில் அவர்கள்) அடைவதற்கு முன்னதாகவே (இம்மையில்) சமீபமான ஒரு வேதனையை அவர்கள் அனுபவிக்கும்படிச் செய்வோம்.",
            "verse 32:22": "எவன் தன்னுடைய இறைவனின் வசனங்களைக் கொண்டு நினைவு படுத்தப்பட்ட பின்னரும் அவற்றைப் புறக்கணித்து விடுகிறானோ, அவனைவிட அநியாயக்காரன் எவன் (இருக்கிறான்)? நிச்சயமாக நாம் (இத்தகைய) குற்றவாளிகளை தண்டிப்போம்.",
            "verse 32:23": "நிச்சயமாக நாம் மூஸாவுக்கு (அவ்) வேதத்தைக் கொடுத்தோம். எனவே, அவர் அதைப் பெற்றதைப்பற்றி சந்தேகப்படாதீர்; நாம் இதனை இஸ்ராயீலின் சந்ததிக்கு வழிகாட்டியாகவும் ஆக்கினோம்.",
            "verse 32:24": "இன்னும் அவர்கள் பொறுமையுடனிருந்து, நம் வசனங்களை உறுதியாக நம்பி ஏற்றுக் கொண்ட போது, நம்முடைய கட்டளைப்படி நேர்வழி காட்டும் தலைவர்களை - இமாம்களை - அவர்களில் நின்றும் உண்டாக்கினோம்.",
            "verse 32:25": "அவர்கள் எ(வ்விஷயத்)தில் அபிப்பிராய பேதம் கொண்டார்களோ, (அதுபற்றி) கியாம நாளில் உம்முடைய இறைவன் நிச்சயமாக அவர்களுக்கிடையில் தீர்ப்புச் செய்வான்.",
            "verse 32:26": "இவர்களுக்கு முன்னர் நாம் எத்தனையோ தலைமுறையினரை அழித்திருப்பதும், அவர்கள் வசித்திருந்த இடங்களில் இவர்கள் நடந்து திரிவதும், இவர்களுக்கு நேர்வழியைக் காட்ட வில்லையா? நிச்சயமாக இதில் (தக்க) அத்தாட்சிகள் இருக்கின்றன. (இதற்கு) இவர்கள் செவிசாய்க மாட்டார்களா?",
            "verse 32:27": "அவர்கள் (இதையும்) கவனிக்கவில்லையா - நிச்சயமாக நாமே வரண்ட பூமியின் பக்கம் மேகங்கள் மூலமாக தண்ணீரை ஓட்டிச் சென்று அதன் மூலம் இவர்களும் இவர்களுடைய கால் நடைகளும் உண்ணக்கூடிய பயிர்களை வெளிப்படுத்துகிறோம்; அவர்கள் (இதை ஆய்ந்து) நோட்டமிட வேண்டாமா?",
            "verse 32:28": "\"நீங்கள் உண்மையாளர்களாக இருந்தால் (வாக்களிக்கப்பட்ட) அந்த வெற்றித் (தீர்ப்பு நாள்) எப்பொழுது (வரும்)?\" என்று அவர்கள் கூறுகிறார்கள்.",
            "verse 32:29": "\"அந்த வெற்றி(த் தீர்ப்பு) நாளின் போது நிராகரிப்போர், நம்பிக்கை கொள்வது அவர்களுக்கு பயன் அளிக்காது - அவர்களுகு; குத்தவணையும் கொடுக்கப்பட மாட்டாது.",
            "verse 32:30": "ஆகவே, நீர் அவர்களைப் புறக்கணித்து (அந்நாளை) எதிர்பார்ப்பீராக! நிச்சயமாக அவர்களும் அதை எதிர்பார்ப்பவர்கள் தாம்."
        },
        "Tatar": {
            "verse 32:1": "Әлиф лам мим.",
            "verse 32:2": "Коръән Кәримнең барча галәмне тәрбия итүче Аллаһудан иңдерелгәнлегенә шик юктыр.",
            "verse 32:3": "Югыйсә Мухәммәд аны үзеннән чыгарып Аллаһуга ифтира итте диярләрме, бәлки аның Раббыңнан булуы хактыр, синнән элек аларга куркытучы пәйгамбәр килмәгән кавемне Аллаһ ґәзабы белән куркытмаклыгың өчен сиңа Коръән иңдерелде, шаять Коръән белән вәгазьләнеп, туры юлга күнәрләр.",
            "verse 32:4": "Аллаһ җир вә күкләрне һәм араларында булган нәрсәләрне алты көндә яратты, соңра Аның әмере Ґәрешкә беркетелде. Ий Коръән белән гамәл кылучылар, сезгә Аллаһудан башка файдалы хуҗа юк, һәм шәфәгать итәчәк аять тә юк, әллә вәгазьләнмисезме?",
            "verse 32:5": "Аллаһ үзенең әмерен күктән җиргә иңдерер, соңра ул әмер яки тәдбир Аллаһуга менәр, сез саный торган дөнья еллары белән мең ел озынлыктагы бер көндә.",
            "verse 32:6": "Яратучы вә тәдбир итүче Аллаһ яшеренне дә, ачыкны да белүче һәр эштә җиңүче вә рәхимледер.",
            "verse 32:7": "Ул – Аллаһ һәрнәрсәне күркәм итеп халык кылды, вә Адәм г-мне балчыктан халык кыла башлады.",
            "verse 32:8": "Соңра нәселен халык кылды бер тамчы судан.",
            "verse 32:9": "Соңра Адәмне халык кылуны тәмам итте, соңра Адәмне җанлы итте, үзе теләгән рухны аңа өрү белән, вә ишетмәк өчен сезгә колак, яратты вә күрмәк өчен күз яратты, вә аңламас өчен күңел яратты, бу әгъзаларның Раббысына аз шөкер итәсез.",
            "verse 32:10": "Үлгәннән соң терелүгә ышанмаган кешеләр әйттеләр: \"Җирдә туфрак булып югалсак, яңадан кеше булып яратылырбызмы?\" Аллаһ әйтте: \"Алар, күрәсез кубарылып Раббыларына юлыгуны инкяр итәләр\".",
            "verse 32:11": "Син әйт: \"Сезнең җаныгызны алырга вәкил ителгән Газраил фәрештә җаныгызны алыр, соңра каберләрегездән кубарылып Раббыгызга кайтырсыз\".",
            "verse 32:12": "Әгәр кәферләрне кыямәт көнне күрсәң, Раббылары хозурында оялып башларын иеп әйтерләр: \"Ий Раббыбыз, безгә вәгъдә иткән ґәзабыңны күрдек, безгә җибәрелгән пәйгамбәрләрнең хаклыгын Синнән ишеттек, инде безне дөньяга кайтар, изге гамәлләр кылыр идек, тәхкыйк без хәзер нәрсә файдалы икәнен белдек\", – дип.",
            "verse 32:13": "Әгәр Без теләсәк һәр кешегә иманны вә һидәятне бирер идек, ләкин җен вә кешеләрнең имансызлары белән җәһәннәмне тутырачакмын дигән Минем сүзем хак булды һәм беркетелде.",
            "verse 32:14": "Инде ґәзабны татыгыз, ошбу көнгә килүне онытып хәзерләнмәгәнегез сәбәпле, бу көн Без сезне онытып ґәзабта калдырачакбыз, ґәзабны мәңге татыгыз, имансызлыкны кәсеп итүегез сәбәпле.",
            "verse 32:15": "Безнең аятьләребезгә нык ышанучылар Коръән вәгазьләрен ишетсәләр, Аллаһудан куркып сәҗдә кылырлар һәм Аллаһ кимчелектән пакь дигән игътикат белән Аны мактап тәсбихләр әйтерләр, ягъни Аллаһны зурлап намаз укырлар, вә алар намаз укудан һәм Аллаһуга итагать итүдән тәкәбберләнмәсләр.",
            "verse 32:16": "Алар яннары вә аркалары белән яткан төшләреннән торып төнлә намаз укырлар вә Раббыларына дога кылырлар, Аның ґәзабыннан куркып вә рәхмәтен өмет итеп, вә алар Без биргән малдан садакалар бирерләр.",
            "verse 32:17": "Җәннәткә керәсе мөэминнәр аларга анда нәрсә хәзерләнгәнлеген алдан һичберсе белмәс, җәннәткә кереп күргәч, күзләре карарланыр, күңелләре шатланыр, аларның кылган яхшылыкларына изге җәза булсын өчен.",
            "verse 32:18": "Аллаһуга итагать итүче иманлы кеше имансыз кеше белән тигез булырмы? Юк, һич тә тигез булмаслар!",
            "verse 32:19": "Әмма иман китереп изге гамәлләр кылган хак мөэминнәргә Мәэва исемле җәннәт булыр, ул җәннәт чын иманны, хак динне кәсеп иткәннәре өчен мәңге торачак урын булып аларга хәзерләнгән.",
            "verse 32:20": "Әмма имансыз фасыйкларның торачак урыннары уттыр, һәркайчан алар ул уттан чыгарга теләсәләр, алар ул утка эчкәрәк кайтарылырлар вә аларга әйтелер: үзегез ялганга тоткан ут ґәзабын татыгыз, – дип.",
            "verse 32:21": "Аларга ахирәтнең олугъ ґәзабыннан элек дөньяда да, әлбәттә, газапны татытачакбыз, шаять калганнары тәүбә итеп иманга килерләр.",
            "verse 32:22": "Раббысының аятьләре белән вәгазьләнеп тә соңра ул вәгазьләрдән баш тарткан кешедән дә залимрак кеше булырмы? Без, әлбәттә, залимнәрдән үч алучыбыз.",
            "verse 32:23": "Тәхкыйк Мусага Тәүратны бирдек, инде син Муса белән очрашуыгызда шик тотма, Мусаны Ягькуб балаларын туры юлга күндерүче кылдык.",
            "verse 32:24": "Вә алардан имамнар кылдык, ул имамнар Тәүраттагы Безнең хөкемнәребез белән һидәяткә күндерәләр иде төрле авырлыкларга сабыр иткән чакларында, вә аятьләребезгә ышанып гамәл кылалар иде.",
            "verse 32:25": "Әлбәттә, Раббың аларның дин эшләрендә ихтыйлаф киткән нәрсәләрендә кыямәт көнне хак белән ялганны аерыр.",
            "verse 32:26": "Әйә аларга мәгълүм булмадымы алардан элек күпме кавемне һәлак иттек, үзләре шул һәлак булган кавемнәрнең урыннарыннан үтеп йөриләр, гакыллы кешеләр өчен бу эштә, әлбәттә, гыйбрәт бар, әллә алар хак сүзне ишетмиләрме?",
            "verse 32:27": "Әйә күрмиләрме Без болытлар белән суны куабыз корылыктан кипкән җиргә, анда яңгыр яудырып игеннәр вә башка үсемлекләрне үстерәбез, аларны хайваннары һәм үзләре ашарлар, әйә шуны күрмиләрме, бу эш Аллаһуның рәхмәте икәнне аңламыйлармы?",
            "verse 32:28": "Кәферләр әйтәләр: \"Кыямәтнең ачылу көне кайчан була, безгә хәбәр бирегез, әгәр дөрес әйтүчеләрдән булсагыз?\"",
            "verse 32:29": "Аларга әйт: \"Кыямәт көнендә кәферләргә файда бирмәс ул көндә генә китергән иманнары, һәм аларга гамәл кылырга вакыт та бирелмәс\", – дип.",
            "verse 32:30": "Инде син алардан кисел, алар белән булышма, кәферләр өстенә Миннән ярдәм көт, алар синең үлүеңне көтәләр, ләкин син хаклыраксың аларның һәлак булуларын көтәргә."
        },
        "Telugu": {
            "verse 32:1": "అలిఫ్-లామ్-మీమ్",
            "verse 32:2": "నిస్సంకోచంగా, ఈ గ్రంథం (ఖుర్ఆన్) అవతరణ సర్వలోకల ప్రభువు తరఫు నుండియే ఉంది",
            "verse 32:3": "ఏమీ? వారు (అవిశ్వాసులు): ఇతనే (ముహమ్మదే) దీనిని కల్పించాడు.\" అని అంటున్నారా? అలా కాదు! వాస్తవానికి ఇది నీ ప్రభువు తరఫు నుండి వచ్చిన సత్యం. నీకు పూర్వం హెచ్చరించే వారెవ్వరూ రాని జాతి వారికి నీవు హెచ్చరిక చేయటానికి, బహుశా వారు మార్గదర్శకత్వం పొందుతారేమోనని",
            "verse 32:4": "అల్లాహ్, ఆయనే ఆకాశాలను, భూమిని మరియు వాటి మధ్య ఉన్నదంతా ఆరు దినములలో (అయ్యామ్ లలో) సృష్టించాడు. ఆ తరువాత సింహాసనాన్ని (అర్ష్ ను) అధిష్టించాడు. ఆయన తప్ప మీకు మరొక సంరక్షకుడు గానీ, సిఫారసు చేసేవాడు గానీ ఎవ్వడూ లేడు, అయినా మీరు హితబోధ గ్రహించరా",
            "verse 32:5": "ఆయనే ఆకాశం నుండి భూమి వరకు ప్రతి వ్యవహారాన్ని నడిపిస్తున్నాడు; తరువాత అంతా ఒకే దినమున, ఆయన వద్దకు పోయి చేరుతుంది; దాని (ఆ దినపు) పరిమాణం మీ లెక్క ప్రకారం వేయి సంవత్సరాలు",
            "verse 32:6": "ఆయన (అల్లాహ్) యే అగోచర మరియు గోచర విషయాల జ్ఞానం గలవాడు, సర్వశక్తిమంతుడు, అపార కరుణా ప్రదాత",
            "verse 32:7": "ఆయన తాను సృష్టించిన ప్రతి దానిని ఉత్తమరీతిలో చేశాడు. మరియు మానవ సృష్టిని మట్టితో ప్రారంభించాడు",
            "verse 32:8": "తరువాత అతని సంతతిని ఒక అధమమైన ద్రవపదార్థపు సారంతో (వీర్యంతో) చేశాడు",
            "verse 32:9": "ఆ తరువాత. అతనిని యుక్తమైన రూపంలో తీర్చిదిద్ది, అతనిలో తన (నుండి) ప్రాణం (ఆత్మ) ఊదాడు. మరియు మీకు వినేశక్తిని, చూసేశక్తిని మరియు హృదయాలను (అర్థం చేసుకునే శక్తిని) ఇచ్చాడు. (అయినా) మీరు కృతజ్ఞతలు తెలుపు కునేది చాలా తక్కువ",
            "verse 32:10": "మరియు వారు (అవిశాసులు) అంటున్నారు: ఏమీ? మేము నశించి, మట్టిలో కలిసి పోయినా, మేము మళ్ళీ క్రొత్తగా సృష్టించబడతామా?\" అది కాదు! వారు తమ ప్రభువుతో కాబోయే సమావేశాన్ని తిరస్కరిస్తున్నారు",
            "verse 32:11": "వారితో ఇలా అను: మీపై నియమించబడిన మృత్యుదూత మీ ప్రాణం తీస్తాడు. ఆ తరువాత మీరు మీ ప్రభువు వద్దకు మరలింపబడతారు",
            "verse 32:12": "మరియు (పునరుత్థాన దినమున) ఈ అపరాధులు, తమ ప్రభువు సమక్షంలో, ఏ విధంగా తమ తలలు వంచుకొని నిలబడి ఉంటారో, నీవు చూడగలిగితే! వారు: ఓ మా ప్రభూ! మేమిప్పుడు చూశాము మరియు విన్నాము, కావున మమ్మల్ని తిరిగి (భూలోకానికి) పంపించు. మేము సత్కార్యాలు చేస్తాము, నిశ్చయంగా, మాకు ఇప్పుడు నమ్మకం కలిగింది.\" అని అంటారు",
            "verse 32:13": "మరియు మేము కోరినట్లయితే, ప్రతి వ్యక్తికి (ఆత్మకు) దాని మార్గదర్శకత్వం చేసి ఉండేవారము. కాని, నేను: నిశ్చయంగా జిన్నాతులు మరియు మానవులందరితో నరకాన్ని నింపివేస్తాను.\" అని పలికిన, నా మాట సత్యమయ్యింది",
            "verse 32:14": "కావున మీరు మీ యొక్క ఈనాటి సమావేశాన్ని మరచిపోయిన దాని ఫలితాన్ని రుచి చూడండి. నిశ్చయంగా, మేము కూడా మిమ్మల్ని మరచి పోయాము. మరియు మీరు మీ కర్మల ఫలితమైన ఈ శాశ్వత శిక్షను రుచి చూడండి",
            "verse 32:15": "నిశ్చయంగా వారే, మా సూచనలు (ఆయాత్) వారికి బోధించినప్పుడు, వాటిని విశ్వసించి సాష్టాంగంలో (సజ్దాలో) పడిపోతారు మరియు తమ ప్రభువు పవిత్రతను కొనియాడుతారు. మరియు ఆయనను స్తుతిస్తారు మరియు వారెన్నడూ గర్వపడరు",
            "verse 32:16": "వారు (రాత్రులలో) తమ ప్రక్కలను తమ పరుపుల నుండి దూరం చేసి, తమ ప్రభువును భయంతో మరియు ఆశతో వేడుకుంటారు మరియు మేము వారికి ప్రసాదించిన జీవనోపాధి నుండి ఖర్చు చేస్తారు",
            "verse 32:17": "కాని వారికి, వారి కర్మల ఫలితంగా వారి కొరకు (పరలోకంలో) కళ్ళకు చలువనిచ్చే ఎటువంటి సామాగ్రి దాచి పెట్టబడి ఉందో ఏ ప్రాణికీ తెలియదు",
            "verse 32:18": "ఏమీ? విశ్వాసి అయినవాడు (దైవభీతి లేని) అవిధేయునితో సమానుడా? (కాదు!) వారు సరిసమానులు కాలేరు",
            "verse 32:19": "ఎవరైతే విశ్వసించి, సత్కార్యాలు చేస్తారో వారికి వారి కర్మల ఫలితంగా, వారి ఆతిథ్యం కొరకు స్వర్గవనాలలో నివాసాలుంటాయి",
            "verse 32:20": "ఇక ఎవరైతే, విద్రోహ వైఖరి అవలంబిస్తారో, వారి నివాసం నరకాగ్నియే. ప్రతిసారి వారు దాని నుండి బయట పడటానికి ప్రయత్నించినప్పుడల్లా, వారందులోకి తిరిగి నెట్టబడతారు. మరియు వారితో ఇలా అనబడుతుంది: మీరు తిరస్కరిస్తూ ఉండిన నరకాగ్ని శిక్షను చవి చూడండి",
            "verse 32:21": "మరియు ఆ పెద్ద శిక్షకు ముందు మేము (ఇహలోకంలో) వారికి సమీప శిక్షను రుచి చూపుతాము. బహుశా, వారు (పశ్చాత్తాప పడి సత్కార్యాల వైపునకు) మరలి వస్తారేమోనని",
            "verse 32:22": "మరియు తన ప్రభువు సూచన (ఆయాత్) ల ద్వారా హితబోధ చేయబడిన తరువాత కూడా, వాటి నుండి విముఖుడయ్యే వాని కంటే ఎక్కువ దుర్మార్గుడెవడు? నిశ్చయంగా, మేము అలాంటి అపరాధులకు ప్రతీకారం చేసి తీరుతాము",
            "verse 32:23": "మరియు వాస్తవంగా, మేము మూసాకు గ్రంథాన్ని ఇచ్చాము. కావున, (ఓ ప్రవక్తా!) నీవు అతనిని (ఇస్రా రాత్రిలో) కలుసుకోబోయే విషయాన్ని గురించి సందేహంలో పడకు. మరియు మేము దానిని (తౌరాత్ ను) ఇస్రాయీల్ సంతతి వారికి మార్గదర్శినిగా చేశాము",
            "verse 32:24": "మరియు మేము (ఇస్రాయీల్ సంతతి) వారిలో నుండి కొందరిని నాయకులుగా చేశాము. వారు, వారికి మా ఆజ్ఞానుసారంగా మార్గదర్శకత్వం చేస్తూ ఉన్నారు - ఎంత వరకైతే వారు సహనం వహించి ఉన్నారో మరియు వారు మా ఆయాత్ (సూచనలను) నమ్ముతూ ఉన్నారో",
            "verse 32:25": "నిశ్చయంగా, నీ ప్రభువు, పునరుత్థాన దినమున, వారికున్న భేదాభిప్రాయాలను గురించి వారి మధ్య తీర్పు చేస్తాడు",
            "verse 32:26": "ఏమీ? వీరికి పూర్వం అనేక తరాలను నాశనం చేసిన విషయం వీరికి మార్గదర్శకత్వం కాదా? వీరు, వారి నివాసస్థలాలలో తిరుగుతున్నారు కదా! నిశ్చయంగా ఇందులో ఎన్నో సూచనలున్నాయి. ఏమీ? వీరు వినటం లేదా",
            "verse 32:27": "ఏమీ? వారు చూడటం లేదా? నిశ్చయంగా, మేము ఒక బంజరు భూమి వైపునకు నీళ్ళను (వర్షాన్ని) పంపి దాని నుండి పైరును ఉత్పత్తి చేస్తే, దానిని వారి పశువులు మరియు వారూ తింటున్నారని. ఏమీ? వారిది గమనించటం (చూడటం) లేదా",
            "verse 32:28": "ఇంకా ఇలా అంటున్నారు: మీరు సత్యవంతులే అయితే, ఆ తీర్పు ఎప్పుడు వస్తుందో చెప్పండి",
            "verse 32:29": "ఇలా అను: ఆ తీర్పుదినం నాడు సత్యతిరస్కారులు విశ్వసించ గోరినా, అది వారికి ఏ విధంగానూ పనికిరాదు! మరియు వారికెలాంటి గడువు కూడా ఇవ్వబడదు",
            "verse 32:30": "కావున నీవు వారితో విముఖుడవగు! మరియు వేచి ఉండు నిశ్చయంగా, వారు కూడా (ఆ దినం కొరకు) వేచి ఉంటారు"
        },
        "Thai": {
            "verse 32:1": "อะลิฟ ลาม มีม",
            "verse 32:2": "การประทานลงมาของคัมภีร์นี้ไม่มีข้อสงสัยใด ๆ ในนั้น จากพระเจ้าแห่งสากลโลก",
            "verse 32:3": "หรือพวกเขากล่าวว่า “เขา (มุฮัมมัด) ได้ปั้นแต่งคัมภีร์นี้ขึ้นมา” แต่ว่าคัมภีร์นี้ คือ สัจธรรมจากพระเจ้าของเจ้า เพื่อเจ้าจักได้ตักเตือนกลุ่มชนหนึ่งที่มิได้มีผู้ตักเตือนคนใดมายังพวกเขาก่อนหน้าเจ้า หวังว่าพวกเขาจะได้อยู่ในแนวทางที่ถูกต้อง \"",
            "verse 32:4": "อัลลอฮฺคือผู้ทรงสร้างชั้นฟ้าทั้งหลาย และแผ่นดิน และสิ่งที่อยู่ในระหว่างทั้งสองในเวลา 6 วัน แล้วพระองค์ทรงสถิตอยู่บนบัลลังก์ สำหรับพวกเจ้านั้นไม่มีผู้คุ้มครองและผู้ช่วยเหลืออื่นจากพระองค์ แล้วพวกเจ้ามิได้ใคร่ครวญบ้างดอกหรือ ?",
            "verse 32:5": "พระองค์ทรงบริหารกิจการจากชั้นฟ้าสู่แผ่นดิน แล้วมันจะขึ้นไปสู่พระองค์ในวันหนึ่งซึ่งกำหนดของมันเท่ากับหนึ่งพันปีตามที่พวกเจ้านับ",
            "verse 32:6": "นั่นคือพระผู้ทรงรอบรู้สิ่งเร้นลับ และเปิดเผย เป็นผู้ทรงอำนาจ ผู้ทรงเมตตาเสมอ",
            "verse 32:7": "ผู้ทรงทำให้ทุกสิ่งที่พระองค์ทรงสร้างมันให้ดีงาม และพระองค์ทรงเริ่มการสร้างมนุษย์จากดิน",
            "verse 32:8": "แล้วทรงให้การสืบตระกูล ของมนุษย์มาจากน้ำ (อสุจิ) อันไร้ค่า",
            "verse 32:9": "แล้วทรงทำให้เขามีสัดส่วนที่สมบูรณ์ และทรงเป่ารูหฺ (วิญญาณ) ของพระองค์เข้าไปในเขาและทรงให้พวกเจ้าได้ยินและได้เห็นและให้มีจิตใจ (สติปัญญา) ส่วนน้อยเท่านั้นที่พวกเจ้าขอบคุณ",
            "verse 32:10": "และพวกเขากล่าวกันว่า “เมื่อเราได้สลายตัวลงสู่ใต้ผืนแผ่นดินไปแล้ว เราจะเกิดขึ้นมาใหม่กระนั้นหรือ” แต่พวกเขาปฏิเสธต่อการพบพระเจ้าของพวกเขา",
            "verse 32:11": "จงกล่าวเถิดมุฮัมมัด “มะลักผู้ปลิดชีวิต ผู้ได้รับมอบหมายเกี่ยวกับพวกท่าน จะปลิดชีวิตของพวกท่าน แล้วพวกท่านจะถูกนำกลับไปยังพระเจ้าของพวกท่าน \"",
            "verse 32:12": "และถ้าเจ้าได้เห็น เมื่อผู้กระทำผิดทั้งหลายก้มศีรษะของพวกเขาลง ณ ที่พระเจ้าของพวกเขา (พลางกล่าวว่า) “ข้าแต่พระเจ้าของเรา เราได้เห็นแล้ว เราได้ยินแล้ว ขอได้ทรงโปรดส่งเรากลับไป (ยังโลกดุนยา) เพื่อเราจะได้กระทำความดี แท้จริงเราเป็นผู้มีความเชื่อมั่นแล้ว (ณบัดนี้)”",
            "verse 32:13": "และถ้าเราประสงค์ แน่นอนเราจะทำให้ทุกชีวิตสู่แนวทางที่ถูกต้องของมัน แต่ว่าคำสัญญาของข้าจะต้องสมจริง แน่นอนข้าจะให้นรกเต็มไปด้วยญินและมนุษย์รวมทั้งหมด",
            "verse 32:14": "ดังนั้น พวกเจ้า (ชาวนรก) จงลิ้มรสเถิด เนื่องด้วยพวกเจ้าได้ลืมการชุมนุมกันในวันนี้ของพวกเจ้า แท้จริงเราก็ลืมพวกเจ้าด้วย และพวกเจ้าจงลิ้มรสการลงโทษอย่างตลอดกาลตามที่พวกเจ้าได้กระทำไว้เถิด",
            "verse 32:15": "แท้จริงบรรดาผู้ศรัทธาต่ออายาตทั้งหลายของเราเท่านั้น ที่เมื่อพวกเขาถูกเตือนให้รำลึกถึงอายาต พวกเขา(ก็จะ)ก้มลงสุญูด และสดุดีสรรเสริญแด่พระจ้าของพวกเขา โดยที่พวกเขาไม่หยิ่งผยอง",
            "verse 32:16": "สีข้างของพวกเขาเคลื่อนห่างจากที่นอน พลางวิงวอนต่อพระเจ้าของพวกเขาด้วยความกลัวและความหวัง และพวกเขาบริจาค สิ่งที่เราได้ให้เป็นเครื่องยังชีพแก่พวกเขา",
            "verse 32:17": "ดังนั้น จึงไม่มีชีวิตใดรู้สิ่งที่ถูกซ่อนไว้สำหรับพวกเขา ให้เป็นที่รื่นรมย์แก่สายตา เป็นการตอบแทนในสิ่งที่พวกเขาได้กระทำไว้",
            "verse 32:18": "ดังนั้น ผู้ศรัทธาจะเหมือนกับคนชั่วช้ากระนั้นหรือ? พวกเขาย่อมไม่เท่าเทียมกันแน่ ๆ",
            "verse 32:19": "ส่วนบรรดาผู้ศรัทธาและกระทำความดีทั้งหลายนั้น สำหรับพวกเขาคือสวนสวรรค์หลากหลาย เป็นที่พำนักเตรียมไว้ตามที่พวกเขาได้กระทำไว้",
            "verse 32:20": "และส่วนบรรดาผู้ชั่วช้านั้น ที่พำนักของพวกเขาคือไฟนรก คราใดที่พวกเขาต้องการจะออกไปจากมัน พวกเขาจะถูกบังคับให้เข้าไปในนั้นอีก และจะมีเสียงกล่าวแก่พวกเขาว่า “จงลิ้มรสการลงโทษของไฟนรกซึ่งพวกท่านเคยปฏิเสธ ไม่เชื่อมัน”",
            "verse 32:21": "และแน่นอน เราจะให้พวกเขาได้ลิ้มรสการลงโทษอันใกล้ (ในโลกนี้) ก่อนการลงโทษอันยิ่งใหญ่ (ในปรโลก)เพื่อว่าพวกเขาจะกลับมาสำนึกผิด",
            "verse 32:22": "และผู้ใดเล่าจะอธรรมยิ่งไปกว่าผู้ถูกเตือนให้รำลึกถึงอายาตทั้งหลายของพระเจ้าของเขา แล้วเขาก็ผินหลังให้กับอายาตเหล่านั้น แท้จริงเราเป็นผู้จองเวรบรรดาผู้กระทำผิด",
            "verse 32:23": "และโดยแน่นอน เราได้ให้คัมภีร์แก่มูซา ดังนั้น เจ้า(มุฮัมมัด) อย่าอยู่ในการสงสัยต่อการพบมัน และเราได้ทำให้มัน (คัมภีร์อัตเรารอฮฺ) เป็นแนวทางที่ถูกต้องแก่วงศ์วานของอิสรออีล",
            "verse 32:24": "และเราได้จัดให้มีหัวหน้าจากพวกเขา เพื่อจะได้ชี้แนะแนวทางที่ถูกต้องตามคำบัญชาของเรา ในเมื่อพวกเขามีความอดทนและพวกเขาเชื่อมั่นต่ออายาตทั้งหลายของเรา",
            "verse 32:25": "แท้จริงพระเจ้าของเจ้า พระองค์จะทรงตัดสินระหว่างพวกเขาในวันกิยามะฮฺ ในสิ่งที่พวกเขาขัดแย้งกันในเรื่องนั้น",
            "verse 32:26": "ยังมิเป็นที่ประจักษ์ชัดแก่พวกเขาดอกหรือว่า กี่มากน้อยแล้วที่เราได้ทำลายประชาชาติก่อนหน้าของเขาไปหลายชั่วศตวรรษ โดยที่พวกเขา (กุฟฟารมักกะฮฺ) ได้ไปพบเห็นมาในที่พำนักอาศัยของพวกเขา แท้จริง ในการนี้ย่อมเป็นสัญญาณอย่างมากหลาย แล้วพวกเขายังไม่เชื่อฟัง (ใคร่ครวญ) อีกหรือ",
            "verse 32:27": "พวกเขาไม่เห็นดอกหรือว่า เราได้ให้น้ำไหลลงสู่แผ่นดินที่แห้งแล้ง แล้วด้วยมัน (น้ำ) เราได้ให้พืชผลงอกเงยออกมา เพื่อปศุสัตว์ของพวกเขาและตัวของพวกเขาเองได้กินจากมัน",
            "verse 32:28": "และพวกเขากล่าวว่า “เมื่อใดเล่าชัยชนะนี้ (จะเกิดขึ้นแก่พวกท่าน) หากพวกท่านเป็นผู้สัตย์จริง",
            "verse 32:29": "จงกล่าวเถิดมุฮัมมัด “วันแห่งชัยชนะนั้น การศรัทธาของบรรดาผู้ปฏิเสธศรัทธาจะไม่อำนวยประโยชน์แก่พวกเขาเลย และพวกเขาก็จะไม่ถูกให้ยืดเวลาออกไป”",
            "verse 32:30": "ดังนั้น จงผินหลังห่างออกจากพวกเขาเสียเถิด และจงคอยดู แท้จริงพวกเขาก็จะเป็นผู้คอยดู"
        },
        "Turkish": {
            "verse 32:1": "Elif, Lam, Mim.",
            "verse 32:2": "Şüphe götürmeyen Kitap, Alemlerin Rabbi'nin indirdiğidir.",
            "verse 32:3": "\"Onu peygamberin kendisi uydurdu\" diyorlar, öyle mi? Hayır; O, senden önce peygamber gönderilmemiş olan bir milleti uyarman için sana Rabbinden gelen bir gerçektir. Belki artık doğru yolu bulurlar.",
            "verse 32:4": "Gökleri, yeri ve ikisinin arasında bulunanları altı günde yaratan, sonra arşa hükmeden Allah'tır. O'ndan başka bir dostunuz ve şefaatçiniz yoktur. Düşünmüyor musunuz?",
            "verse 32:5": "Gökten yere kadar, olan bütün işleri Allah düzenler, sonra, işler sizin hesabınıza göre bin yıl kadar tutan bir gün içinde O'na yükselir.",
            "verse 32:6": "O, görülmeyeni de görüleni de bilendir, güçlüdür, merhametlidir.",
            "verse 32:7": "Yarattığı her şeyi güzel yaratan, insanı başlangıçta çamurdan yaratan, sonra onun soyunu, bayağı bir suyun özünden yapan, sonra onu şekillendirip ruhundan ona üfleyen Allah'tır. Size kulaklar, gözler, kalbler verilmiştir. Öyleyken, pek az şükrediyorsunuz.",
            "verse 32:8": "Yarattığı her şeyi güzel yaratan, insanı başlangıçta çamurdan yaratan, sonra onun soyunu, bayağı bir suyun özünden yapan, sonra onu şekillendirip ruhundan ona üfleyen Allah'tır. Size kulaklar, gözler, kalbler verilmiştir. Öyleyken, pek az şükrediyorsunuz.",
            "verse 32:9": "Yarattığı her şeyi güzel yaratan, insanı başlangıçta çamurdan yaratan, sonra onun soyunu, bayağı bir suyun özünden yapan, sonra onu şekillendirip ruhundan ona üfleyen Allah'tır. Size kulaklar, gözler, kalbler verilmiştir. Öyleyken, pek az şükrediyorsunuz.",
            "verse 32:10": "Puta tapanlar: \"Toprağa karışıp yok olduktan sonra yeniden mi yaratılacağız?\" derler. Evet; onlar, Rab'lerine kavuşmayı inkar edenlerdir.",
            "verse 32:11": "De ki: \"Size vekil kılınan ölüm meleği canınızı alacak, sonra Rabbinize döndürüleceksiniz.\"",
            "verse 32:12": "Suçluları Rablerinin huzurunda, başları öne eğilmiş olarak: \"Rabbimiz! Gördük, dinledik, artık bizi dünyaya geri çevir de iyi iş işleyelim; doğrusu kesin olarak inandık\" derlerken bir görsen!",
            "verse 32:13": "Biz dilesek herkese hidayet verirdik, fakat cehennemi tamamen cin ve insanlarla dolduracağıma dair Benden söz çıkmıştır.",
            "verse 32:14": "\"Bugüne kavuşmayı unutmanızın karşılığını görün; doğrusu Biz de sizi unuttuk, yaptıklarınıza karşılık ebedi azabı tadın\" deriz.",
            "verse 32:15": "Ayetlerimize ancak, kendilerine hatırlatıldığı zaman secdeye kapananlar, büyüklük taslamayarak Rablerini överek yüceltenler, vücudlarını yataklardan uzak tutup korkarak ve umarak Rablerine yalvaranlar ve verdiğimiz rızıklardan sarfedenler inanır.",
            "verse 32:16": "Ayetlerimize ancak, kendilerine hatırlatıldığı zaman secdeye kapananlar, büyüklük taslamayarak Rablerini överek yüceltenler, vücudlarını yataklardan uzak tutup korkarak ve umarak Rablerine yalvaranlar ve verdiğimiz rızıklardan sarfedenler inanır.",
            "verse 32:17": "Yaptıklarına karşılık onlar için saklanan müjdeyi kimse bilmez.",
            "verse 32:18": "İnanan kimse yoldan çıkmış kimseye benzer mi? Bunlar bir olamazlar.",
            "verse 32:19": "İnanıp yararlı iş işleyenlere gelince, onların yaptıklarına karşılık, varacakları cennet konakları vardır.",
            "verse 32:20": "Ama yoldan çıkanların, işte onların varacağı yer ateştir. Oradan çıkmak isteyişlerinin her defasında geri çevrilirler ve onlara: \"Yalanlayıp, durduğunuz ateşin azabını tadın\" denir.",
            "verse 32:21": "Belki yollarından dönerler diye and olsun onlara büyük azabdan önce dünya azabından tattırırız.",
            "verse 32:22": "Rabbinin ayetleri kendisine hatırlatılıp da onlardan yüz çeviren kimseden daha zalim var mıdır? Şüphesiz suçlulardan öç alacağız.",
            "verse 32:23": "And olsun ki Musa'ya Kitap verdik; Sakın sen ona kavuşacağından şüphe etme. Musa'ya verdiğimizi İsrailoğullarına doğruluk rehberi kıldık.",
            "verse 32:24": "Sabredip ayetlerimize kesin olarak inanmalarından ötürü, aralarından, onları buyruğumuzla doğru yola götüren önderler yaptık.",
            "verse 32:25": "Muhakkak ki Rabbin ayrılığa düştükleri şeylerde kıyamet günü aralarında hükmedecektir.",
            "verse 32:26": "Şimdi yurtlarında gezip dolaştıkları, kendilerinden önceki nice nesilleri yok etmiş olmamız onları doğru yola sevketmez mi? Bunlarda şüphesiz ibretler vardır. Dinlemezler mi?",
            "verse 32:27": "Kuru yerlere suyu gönderip onunla hayvanlarının ve kendilerinin yedikleri ekinleri çıkardığımızı görmezler mi? Görmüyorlar mı?",
            "verse 32:28": "\"Doğru söylüyorsanız bildirin bu hüküm ne zaman verilecektir?\" derler.",
            "verse 32:29": "De ki: \"Hükmün verileceği gün inkarcılara ne inanmaları fayda verir ve ne de ertelenirler.\"",
            "verse 32:30": "Onları bırak, bekle; zaten onlar da senin akıbetini beklemektedirler."
        },
        "Urdu": {
            "verse 32:1": "الٓمٓ",
            "verse 32:2": "اس میں کچھ شک نہیں کہ اس کتاب کا نازل کیا جانا تمام جہان کے پروردگار کی طرف سے ہے",
            "verse 32:3": "کیا یہ لوگ یہ کہتے ہیں کہ پیغمبر نے اس کو از خود بنا لیا ہے (نہیں) بلکہ وہ تمہارے پروردگار کی طرف سے برحق ہے تاکہ تم ان لوگوں کو ہدایت کرو جن کے پاس تم سے پہلے کوئی ہدایت کرنے والا نہیں آیا تاکہ یہ رستے پر چلیں",
            "verse 32:4": "خدا ہی تو ہے جس نے آسمانوں اور زمین کو اور جو چیزیں ان دونوں میں ہیں سب کو چھ دن میں پیدا کیا پھر عرش پر جا ٹھہرا۔ اس کے سوا نہ تمہارا کوئی دوست ہے اور نہ سفارش کرنے والا۔ کیا تم نصیحت نہیں پکڑتے؟",
            "verse 32:5": "وہی آسمان سے زمین تک (کے) ہر کام کا انتظام کرتا ہے۔ پھر وہ ایک روز جس کی مقدار تمہارے شمار کے مطابق ہزار برس ہوگی۔ اس کی طرف صعود (اور رجوع) کرے گا",
            "verse 32:6": "یہی تو پوشیدہ اور ظاہر کا جاننے والا (اور) غالب اور رحم والا (خدا) ہے",
            "verse 32:7": "جس نے ہر چیز کو بہت اچھی طرح بنایا (یعنی) اس کو پیدا کیا۔ اور انسان کی پیدائش کو مٹی سے شروع کیا",
            "verse 32:8": "پھر اس کی نسل خلاصے سے (یعنی) حقیر پانی سے پیدا کی",
            "verse 32:9": "پھر اُس کو درست کیا پھر اس میں اپنی (طرف سے) روح پھونکی اور تمہارے کان اور آنکھیں اور دل بنائے مگر تم بہت کم شکر کرتے ہو",
            "verse 32:10": "اور کہنے لگے کہ جب ہم زمین میں ملیامیٹ ہوجائیں گے تو کیا ازسرنو پیدا ہوں گے۔ حقیقت یہ ہے کہ یہ لوگ اپنے پروردگار کے سامنے جانے ہی کے قائل نہیں",
            "verse 32:11": "کہہ دو کہ موت کا فرشتہ جو تم پر مقرر کیا گیا ہے تمہاری روحیں قبض کر لیتا ہے پھر تم اپنے پروردگار کی طرف لوٹائے جاؤ گے",
            "verse 32:12": "اور تم (تعجب کرو) جب دیکھو کہ گنہگار اپنے پروردگار کے سامنے سرجھکائے ہوں گے (اور کہیں گے کہ) اے ہمارے پروردگار ہم نے دیکھ لیا اور سن لیا تو ہم کو (دنیا میں) واپس بھیج دے کہ نیک عمل کریں بیشک ہم یقین کرنے والے ہیں",
            "verse 32:13": "اور اگر ہم چاہتے تو ہر شخص کو ہدایت دے دیتے۔ لیکن میری طرف سے یہ بات قرار پاچکی ہے کہ میں دوزخ کو جنوں اور انسانوں سب سے بھردوں گا",
            "verse 32:14": "سو (اب آگ کے) مزے چکھو اس لئے کہ تم نے اُس دن کے آنے کو بھلا رکھا تھا (آج) ہم بھی تمہیں بھلا دیں گے اور جو کام تم کرتے تھے اُن کی سزا میں ہمیشہ کے عذاب کے مزے چکھتے رہو",
            "verse 32:15": "ہماری آیتوں پر تو وہی لوگ ایمان لاتے ہیں کہ جب اُن کو اُن سے نصیحت کی جاتی ہے تو سجدے میں گرپڑتے اور اپنے پروردگار کی تعریف کے ساتھ تسبیح کرتے ہیں اور غرور نہیں کرتے",
            "verse 32:16": "اُن کے پہلو بچھونوں سے الگ رہتے ہیں (اور) وہ اپنے پروردگار کو خوف اور اُمید سے پکارتے اور جو (مال) ہم نے اُن کو دیا ہے اس میں سے خرچ کرتے ہیں",
            "verse 32:17": "کوئی متنفس نہیں جانتا کہ اُن کے لئے کیسی آنکھوں کی ٹھنڈک چھپا کر رکھی گئی ہے۔ یہ ان اعمال کا صلہ ہے جو وہ کرتے تھے",
            "verse 32:18": "بھلا جو مومن ہو وہ اس شخص کی طرح ہوسکتا ہے جو نافرمان ہو؟ دونوں برابر نہیں ہو سکتے",
            "verse 32:19": "جو لوگ ایمان لائے اور نیک عمل کرتے رہے اُن کے (رہنے کے) لئے باغ ہیں یہ مہمانی اُن کاموں کی جزا ہے جو وہ کرتے تھے",
            "verse 32:20": "اور جنہوں نے نافرمانی کی اُن کے رہنے کے لئے دوزخ ہے جب چاہیں گے کہ اس میں سے نکل جائیں تو اس میں لوٹا دیئے جائیں گے۔ اور اُن سے کہا جائے گا کہ جس دوزخ کے عذاب کو تم جھوٹ سمجھتے تھے اس کے مزے چکھو",
            "verse 32:21": "اور ہم اُن کو (قیامت کے) بڑے عذاب کے سوا عذاب دنیا کا بھی مزہ چکھائیں گے۔ شاید (ہماری طرف) لوٹ آئیں",
            "verse 32:22": "اور اس شخص سے بڑھ کر ظالم کون جس کو اس کے پروردگار کی آیتوں سے نصیحت کی جائے تو وہ اُن سے منہ پھیر لے۔ ہم گنہگاروں سے ضرور بدلہ لینے والے ہیں",
            "verse 32:23": "اور ہم نے موسٰی کو کتاب دی تو تم اُن کے ملنے سے شک میں نہ ہونا اور ہم نے اس (کتاب) کو (یا موسٰی کو) بنی اسرائیل کے لئے (ذریعہ) ہدایت بنایا",
            "verse 32:24": "اور ان میں سے ہم نے پیشوا بنائے تھے جو ہمارے حکم سے ہدایت کیا کرتے تھے۔ جب وہ صبر کرتے تھے اور وہ ہماری آیتوں پر یقین رکھتے تھے",
            "verse 32:25": "بلاشبہ تمہارا پروردگار ان میں جن باتوں میں وہ اختلاف کرتے تھے۔ قیامت کے روز فیصلہ کر دے گا",
            "verse 32:26": "کیا اُن کو اس (امر) سے ہدایت نہ ہوئی کہ ہم نے اُن سے پہلے بہت سی اُمتوں کو جن کے مقامات سکونت میں یہ چلتے پھرتے ہیں ہلاک کر دیا۔ بیشک اس میں نشانیاں ہیں۔ تو یہ سنتے کیوں نہیں",
            "verse 32:27": "کیا اُنہوں نے نہیں دیکھا کہ ہم بنجر زمین کی طرف پانی رواں کرتے ہیں پھر اس سے کھیتی پیدا کرتے ہیں جس میں سے ان کے چوپائے بھی کھاتے ہیں اور وہ خود بھی (کھاتے ہیں) تو یہ دیکھتے کیوں نہیں۔",
            "verse 32:28": "اور کہتے ہیں اگر تم سچے ہو تو یہ فیصلہ کب ہوگا؟",
            "verse 32:29": "کہہ دو کہ فیصلے کے دن کافروں کو ان کا ایمان لانا کچھ بھی فائدہ نہ دے گا اور نہ اُن کو مہلت دی جائے گی",
            "verse 32:30": "تو اُن سے منہ پھیر لو اور انتظار کرو یہ بھی انتظار کر رہے ہیں"
        },
        "Uyghur": {
            "verse 32:1": "ئەلىف، لام، مىم",
            "verse 32:2": "(بۇ) كىتاب (يەنى قۇرئان) نىڭ ئالەملەرنىڭ پەرۋەردىگارى تەرىپىدىن نازىل قىلىنغانلىقىدا ھېچ شەك يوقتۇر",
            "verse 32:3": "مۇشرىكلار: «مۇھەممەد ئۇنى ئۆزى توقۇدى» دەيدۇ. ھەرگىز ئۇنداق ئەمەس، بەلكى ئۇ سەندىن ئىلگىرى ھېچقانداق بىر پەيغەمبەر كەلمىگەن بىر قەۋمنى ھىدايەت تاپسۇن دەپ، ئۇلارنى ئاگاھلاندۇرۇشۇڭ ئۈچۈن، پەرۋەردىگارىڭ تەرىپىدىن كەلگەن ھەقىقەتتۇر",
            "verse 32:4": "اﷲ ئاسمانلارنى، زېمىننى ۋە ئۇلارنىڭ ئارىسىدىكى نەرسىلەرنى ئالتە كۈندە ياراتتى، ئاندىن ئەرش ئۈستىدە (ئۆزىگە لايىق رەۋىشتە) قارار ئالدى. سىلەرگە اﷲ تىن باشقا ھېچقانداق ئىگە يوق، شاپائەت قىلغۇچىمۇ يوق (بۇنى) پىكىر قىلىپ (ئىمان ئېيتمامسىلەر؟)",
            "verse 32:5": "اﷲ ئاسماندىن زېمىنغىچە بولغان (مەخلۇقاتىنىڭ) ئىشلىرىنى ئىدارە قىلىپ تۇرىدۇ، ئاندىن ئۇ ئىشلار ئۇزۇنلۇقى سىلەر ساناۋاتقان مىڭ يىلدەك كېلىدىغان بىر كۈندە اﷲ نىڭ دەرگاھىغا ئۆرلەيدۇ",
            "verse 32:6": "ئۇ (اﷲ) يوشۇرۇننى ۋە ئاشكارىنى بىلگۈچىدۇر، غالىبتۇر. (بەندىلىرىگە) ناھايىتى مېھرىباندۇر",
            "verse 32:7": "ئۇ ھەممە نەرسىنى چىرايلىق (يەنى ھېكمىتىگە مۇۋاپىق، جايىدا) ياراتتى. دەسلەپتە ئىنساننى (يەنى ئىنسانلارنىڭ ئاتىسى ئادەم ئەلەيھىسسالامنى) لايدىن ياراتتى",
            "verse 32:8": "ئاندىن ئۇنىڭ نەسلىنى ئەرزىمەس سۇنىڭ جەۋھىرى (يەنى مەنىي) دىن ياراتتى",
            "verse 32:9": "ئاندىن ئۇنى راۋۇرۇس يارىتىپ، ئۇنىڭغا ئۆزىگە مەنسۇپ روھنى كىرگۈزدى (يەنى جاننى كىرگۈزدى). يەنە سىلەر ئۈچۈن قۇلاقلارنى، كۆزلەرنى ۋە يۈرەكلەرنى ياراتتى، سىلەر ئاز شۈكۈر قىلىسىلەر",
            "verse 32:10": "ئۇلار: «يەر ئاستىدا يوقالغاندىن كېيىن (يەنى گۆردە توپىغا ئايلىنىپ كەتكەندىن كېيىن) راستلا قايتا يارىتىلامدۇق؟» دەيدۇ، بەلكى ئۇلار پەرۋەردىگارىغا مۇلاقات بولۇشنى ئىنكار قىلغۇچىلاردۇر",
            "verse 32:11": "ئېيتقىنكى، «سىلەرنىڭ (جېنىڭلارنى ئېلىشقا) مۇئەككەل قىلىنغان پەرىشتە سىلەرنىڭ جېنىڭلارنى ئالىدۇ، ئاندىن پەرۋەردىگارىڭلارنىڭ دەرگاھىغا قايتۇرۇلىسىلەر»",
            "verse 32:12": "ئەگەر سەن گۇناھكارلارنىڭ پەرۋەردىگارىنىڭ دەرگاھىدا باشلىرىنى ساڭگىلىتىپ تۇرغانلىقىنى كۆرىدىغان بولساڭ (ئەلۋەتتە قورقۇنچلۇق ھالەتنى كۆرگەن بولاتتىڭ)، ئۇلار ئېيتىدۇ: «پەرۋەردىگارىمىز! (ئىشنىڭ ھەقىقىتىنى) كۆردۇق، ئاڭلىدۇق. بىزنى ياخشى ئەمەل قىلىش ئۈچۈن (دۇنياغا) قايتۇرغىن، بىز (ئەمدى) ھەقىقەتەن (سېنىڭ ۋەدەڭنىڭ ھەق ئىكەنلىكىگە) ئىشەنگۈچىلەرمىز»",
            "verse 32:13": "ئەگەر بىز خالىساق، ھەر بىر كىشىگە ئەلۋەتتە ھىدايەت بېرەتتۇق، لېكىن مېنىڭ (گۇناھكارلارنى ئازاب قىلىشتىن ئىبارەت) ھۆكمىم بېكىپ كەتتى. مەن چوقۇم جىنلار ۋە ئىنسانلار (يەنى ئۇلارنىڭ گۇناھكارلىرى) - ھەممىسى بىلەن جەھەننەمنى تولدۇرىمەن",
            "verse 32:14": "(ئەھلى دوزاخقا ئېيتىلىدۇ) «مۇشۇ كۈندىكى ئۇچرىشىشىڭلارنى ئۇنتۇپ قالغانلىقىڭلار ئۈچۈن (بۇ خورلىغۇچى ئازابنى) تېتىڭلار، بىز ھەقىقەتەن سىلەرنى ئۇنتۇدۇق، قىلمىشىڭلار تۈپەيلىدىن مەڭگۈلۈك ئازابنى تېتىڭلار»",
            "verse 32:15": "بىزنىڭ ئايەتلىرىمىزگە ھەقىقەتەن شۇنداق كىشىلەر ئىمان ئېيتىدۇكى، ئۇلارغا شۇ ئايەتلەر بىلەن ۋەز - نەسىھەت قىلىنسا (اﷲ نىڭ ئايەتلىرىنى ئۇلۇغلاش يۈزىسىدىن اﷲ قا) سەجدە قىلغان ھالدا يىقىلىدۇ، پەرۋەردىگارىغا تەسبىھ ئېيتىدۇ، ھەمدۇ ئېيتىدۇ. ئۇلار (پەرۋەردىگارىنىڭ تائەت - ئىبادىتىدىن) چوڭچىلىق قىلىپ باش تارتمايدۇ",
            "verse 32:16": "ئۇلارنىڭ يانلىرى ئورۇن - كۆرپىدىن يىراق بولىدۇ (يەنى ئۇلار كېچىسى ئىبادەت قىلىپ ئاز ئۇخلايدۇ)، ئۇلار پەرۋەردىگارىنىڭ (ئازابىدىن) قورقۇپ، (رەھمىتىنى) ئۈمىد قىلىپ ئۇنىڭغا دۇئا قىلىدۇ، ئۇلارغا بىز رىزىق قىلىپ بەرگەن نەرسىلەردىن (ياخشىلىق يوللىرىغا) سەرپ قىلىدۇ",
            "verse 32:17": "ئۇلارنىڭ قىلغان ئەمەللىرىگە مۇكاپات يۈزىسىدىن اﷲ نىڭ ھۇزۇرىدا ساقلانغان ۋە ئۇلارنى خۇشال قىلىدىغان كاتتا نېمەتنى ھېچكىم بىلمەيدۇ",
            "verse 32:18": "مۆمىن ئادەم پاسىق ئادەمگە ئوخشامدۇ؟ ئۇلار (ئاخىرەتلىك ساۋابتا) باراۋەر ئەمەس",
            "verse 32:19": "ئىمان ئېيتقان ۋە ياخشى ئەمەللەرنى قىلغانلارغا كەلسەك، ئۇلارنىڭ قارارگاھى جەننەت بولىدۇ، (ئۇ) ئۇلارنىڭ قىلغان ئەمەللىرىنى مۇكاپاتلاش يۈزىسىدىن ئۇلا رئۈچۈن تەييارلانغان جايدۇر",
            "verse 32:20": "اﷲ نىڭ ئىتائىتىدىن چىققانلارغا كەلسەك، ئۇلارنىڭ جايى دوزاخ بولىدۇ، ھەر قاچان ئۇلار دوزاختىن چىقماقچى بولسا، ئۇلار دوزاخقا قايتۇرۇلىدۇ. ئۇلارغا: «سىلەر ئىنكار قىلغان دوزاخنىڭ ئازابىنى تېتىڭلار» دېيىلىدۇ",
            "verse 32:21": "ئۇلارنىڭ تەۋبە قىلىشى ئۈچۈن بىز ئۇلارغا چوقۇم ئەڭ چوڭ ئازابتىن (يەنى ئاخىرەت ئازابىدىن) ئىلگىرى ئەڭ يېقىنقى ئازاب (يەنى دۇنيا ئازابى) نى تېتىتىمىز",
            "verse 32:22": "پەرۋەردىگارىنىڭ ئايەتلىرى بىلەن ۋەز - نەسىھەت قىلىنغان، ئاندىن ئۇنىڭدىن يۈز ئۆرۈگەن ئادەمدىنمۇ زالىم ئادەم بارمۇ؟ بىز گۇناھكارلارنى چوقۇم جازالايمىز",
            "verse 32:23": "شەك - شۈبھىسىزكى، بىز مۇساغا كىتاب (يەنى تەۋراتنى) ئاتا قىلدۇق. (ئى مۇھەممەد!) سەن (مىراج كېچىسىدە، يا قىيامەت كۈنىدە) مۇساغا مۇلاقات بولۇشتىن شەكلەنمىگىن، بىز تەۋراتنى ئىسرائىل ئەۋلادىغا يېتەكچى قىلدۇق",
            "verse 32:24": "ئۇلار (كۈلپەتلەرگە) سەۋر قىلغان، بىزنىڭ ئايەتلىرىمىزگە جەزمەن ئىشەنگەن چاغدا، ئۇلاردىن بىر قىسىم كىشىلەرنى بىزنىڭ ئەمرىمىز بىلەن توغرا يول كۆرسىتىدىغان پېشۋالار قىلدۇق",
            "verse 32:25": "سېنىڭ پەرۋەردىگارىڭ قىيامەت كۈنى ئۇلارنىڭ ئارىسىدا ئۇلار ئىختىلاپ قىلىشقان (دىنىي) ئىشلار ئۈستىدە ئەلۋەتتە ھۆكۈم چىقىرىدۇ",
            "verse 32:26": "ئۇلاردىن ئىلگىرى ئۆتكەن قانچىلىغان ئۈممەتلەرنى ھالاك قىلغانلىقىمىزنى ئۇلار بىلمەمدۇ؟ ئۇلار (يەنى مەككىلىكلەر) ئۇلار (يەنى ھالاك بولغانلار) نىڭ يۇرتىدىن ئۆتۈپ تۇرىدۇ، بۇنىڭدا (بىزنىڭ قۇدرىتىمىزنىڭ چوڭلۇقىنى كۆرسىتىدىغان) نۇرغۇن دەلىللەر بار، ئۇلار ئاڭلىمامدۇ؟",
            "verse 32:27": "ئۇلار كۆرمەمدۇكى، بىز گىياھسىز زېمىنغا يامغۇر سۈيىنى سۈرۈپ ئېلىپ بارىمىز، ئۇنىڭ بىلەن ئۇلارنىڭ ھايۋاناتلىرى ۋە ئۆزلىرى يەيدىغان زىرائەتلەرنى ئۈندۈرۈپ چىقىرىمىز، ئۇلار (بۇنى) كۆرمەمدۇ؟",
            "verse 32:28": "ئۇلار (يەنى مەككە كۇففارلىرى مەسخىرە قىلىش يۈزىسىدىن): «(بىز بىلەن سىلەرنىڭ ئاراڭلاردا چىقىرىلىدىغان) بۇ ھۆكۈم قاچان ئەمەلگە ئاشىدۇ؟ ئەگەر سىلەر (دەۋايىڭلاردا) راستچىل بولساڭلار (ئېيتىپ بېرىڭلار)» دەيدۇ",
            "verse 32:29": "ئېيتقىنكى، «ھۆكۈم چىقىرىلىدىغان كۈندە كاپىرلارنىڭ ئېيتقان ئىمانىنىڭ پايدىسى بولمايدۇ، ئۇلارغا مۆھلەتمۇ بېرىلمەيدۇ»",
            "verse 32:30": "سەن ئۇلاردىن يۈز ئۆرۈگىن (يەنى سۆزلىرىگە پەرۋا قىلىپ كەتمىگىن). سەن (اﷲ نىڭ ئۇلارغا چۈشىدىغان ئازابىنى) كۈتكىن، ئۇلارمۇ ھەقىقەتەن (سىلەرگە چۈشىدىغان نەرسىلەرنى) كۈتكۈچىلەردۇر"
        },
        "Uzbek": {
            "verse 32:1": "Алиф. Лам. Мийм.",
            "verse 32:2": "Бу китобнинг нозил қилиниши, ҳеч шак-шубҳасиз, оламларнинг Робби томонидандир.",
            "verse 32:3": "Ёки, унинг ўзи тўқиб олган, дейдиларми?! Йўқ! У сендан олдин ўзларига ҳеч огоҳлантиргувчи келмаган қавмни огоҳлантиришинг учун Роббингдан (келган) ҳақдир. Шояд улар ҳидоят топсалар.",
            "verse 32:4": "Аллоҳ осмонлару ерни ва улар орасидаги нарсаларни олти кунда яратиб, сўнгра аршни эгаллган зотдир. Сиз учун ундан ўзга дўст ҳам, шафоатчи ҳам йўқдир. Ахир, эсламайсизларми?!",
            "verse 32:5": "У зот осмондан ергача барча ишнинг тадбирини қилур. Сўнгра ўша (иш) миқдорини сиз санаётган ҳисобда минг йилга тенг бўлган кунда Унга чиқар.",
            "verse 32:6": "Ана шу Зот ғойибнию ҳозирни билгувчи, азизу раҳиймдир.",
            "verse 32:7": "У Ўзи яратган ҳар бир нарсани гўзал этган ва инсонни яратишни лойдан бошлаган зотдир.",
            "verse 32:8": "Сўнгра унинг наслини ҳақир бир сувдан ажраб чиқадиган қилди.",
            "verse 32:9": "Сўнгра уни ростлади ва унинг ичига Ўз руҳидан пуфлади. У сизларга қулоқ, кўзлар ва диллар пайдо қилди. Камдан-кам шукр қилурсизлар.",
            "verse 32:10": "Улар: «Биз ер остида йўқ бўлиб кетгач ҳам, яна янгитдан яратиламизми?!» дерлар. Йўқ! Улар Роббиларига рўбарў бўлишни инкор қилгувчилардир.",
            "verse 32:11": "Сен: «Сизларга вакил қилинган ўлим фариштаси жонингизни оладир. Сўнгра Роббингизга қайтарилурсиз», деб айт.",
            "verse 32:12": "Гуноҳкорларнинг Роббилари ҳузурида бошларини эгиб туриб: »Эй Роббимиз, кўрдик, эшитдик. Бас, бизни ортга қайтар, яхши амал қиламиз. Албатта, биз ишониб етдик«, дейишларини кўрсанг эди.",
            "verse 32:13": "Агар хоҳлаганимизда, ҳар бир жонга ўз ҳидоятини берар эдик. Лекин мендан: «Албатта, жаҳаннамни жинлар ва одамларни жамлаб тўлдираман», деган сўз ҳақ бўлди.",
            "verse 32:14": "«Бас, тотиб кўринглар, ушбу кунингизда учрашувни унутганингиз туфайли Биз ҳам сизни унутдик. Қилиб ўтган амалларингиз туфайли мангу азобни тотинг!» дейилур.",
            "verse 32:15": "Албатта, Бизнинг оятларимизга уларла эслатма берилганда саждага йиқиладиган, Роббиларига ҳамд ила тасбиҳ айтадиган ва мутакаббирлик қилмайдиганларгина иймон келтирарлар.",
            "verse 32:16": "Уларнинг ёнбошлари ётар жойдан йироқ бўлур. Улар Роббиларига қўрқув ва умидворлик ила дуо қилурлар ва ўзларига ризқ қилиб берган нарсаларимиздан инфоқ қилурлар.",
            "verse 32:17": "Бас, ҳеч бир жон ўзлари учун қилиб ўтган амаллари мукофотига беркитиб қўйилган кўз қувончларини билмас.",
            "verse 32:18": "Ахир, мўмин бўлган одам фосиқ бўлган одамдек бўладими?! Тенг бўлмаслар.",
            "verse 32:19": "Ҳа, иймон келтириб, яхши амалларни қилганларга, бас, уларга қилиб ўтган амаллари учун жаннатул маъво манзилдир.",
            "verse 32:20": "Аммо фосиқлик қилганлар эса, бас, уларнинг жойлари дўзахдир. Ҳар қачон ундан чиқмоқни ирода қилсалар, унга қайтарилурлар ва уларга: «Ўзингиз ёлғонга чиқарган дўзахнинг азобини тотинг», дейилур.",
            "verse 32:21": "Албатта, Биз уларга буюк азобдан олдин яқин азобни тоттирамиз. Шоядки қайтсалар.",
            "verse 32:22": "Роббининг оятлари ила эслатилган, сўнгра улардан юз ўгирган одамдан ҳам золимроқ одам борми?! Албатта, Биз жиноятчилардан интиқом олгувчилармиз.",
            "verse 32:23": "Батаҳқиқ, Биз Мусога китобни бердик. Бас, сен унинг рўбарў бўлишидан шубҳада бўлма. Ва Биз уни Бани Исроилга ҳидоят қилиб бердик.",
            "verse 32:24": "Ва сабр қилган пайтларида улардан Бизнинг амримиз ила ҳидоятга бошлайдиган пешволар чиқардик. Улар Бизнинг оятларимизга аниқ ишонардилар.",
            "verse 32:25": "Албатта, Роббинг Ўзи қиёмат куни улар орасида ихтилоф қилган нарсалари тўғрисида ажрим қилур.",
            "verse 32:26": "Ўзларидан олдин ўтган, масканларида юриб турганлари қанчадан-қанча аср(одам)ларини ҳалок қилганимиз уларни ҳидоятга бошламадими?! Албатта, бунда оят-белгилар бордир. Эшитмайдиларми?!",
            "verse 32:27": "Бизнинг сувни қуруқ ерга ҳайдаб у билан чорвалари ва ўзлари ейдиган зироатни чиқаришимизни билмайдиларми?! Ахир, кўрмайдиларми?!",
            "verse 32:28": "Улар: «Агар ростгўй бўлсаларингиз, бу фатҳ қачон бўлур?!» дерлар.",
            "verse 32:29": "Сен: «Фатҳ куни куфр келтирганларга иймонлари манфаат бермас ва уларга муҳлат ҳам берилмас», деб айт.",
            "verse 32:30": "Бас, улардан юз ўгир ва мунтазир бўл. Албатта, улар ҳам мунтазирдирлар."
        },
        "Vietnamese": {
            "verse 32:1": "Alif. La-m. Mi-m.",
            "verse 32:2": "Không có gì phải hoài nghi về Thiên Kinh (Qur’an) do Thượng Đế của vũ trụ và vạn vật ban xuống.",
            "verse 32:3": "Họ (những kẻ vô đức tin) nói rằng Y (Muhammad) đã bịa đặt ra Nó (Qur’an). Không, (Qur’an) đích thực là Chân Lý từ nơi Thượng Đế của Ngươi (hỡi Thiên Sứ) để Ngươi cảnh báo một đám dân mà trước Ngươi đã không có một người cảnh báo nào đến với họ, mong rằng họ được hướng dẫn đúng đường.",
            "verse 32:4": "Allah là Đấng đã tạo hóa các tầng trời, trái đất và vạn vật giữa chúng trong sáu ngày rồi Ngài an vị trên ‘Arsh (Ngai Vương) của Ngài. (Hỡi nhân loại), ngoài Ngài, các ngươi không có bất cứ vị bảo hộ hay vị can thiệp nào. Dó đó, các ngươi cần luôn ghi nhớ (rằng các ngươi phải thờ phượng Allah – Đấng đã tạo ra các ngươi và chớ thờ phượng ngoài Ngài một ai, vật gì).",
            "verse 32:5": "Ngài sắp đặt mọi việc từ trên trời xuống dưới đất rồi tất cả mọi việc sẽ được đưa lên trình Ngài trong một ngày mà thời gian của nó bằng một ngàn năm theo cách tính của các ngươi (hỡi con người).",
            "verse 32:6": "(Đấng sắp đặt mọi việc) đó là Đấng hằng biết điều vô hình và điều hữu hình, là Đấng Quyền Năng, Đấng Khoan Dung.",
            "verse 32:7": "Ngài hoàn thiện tốt đẹp mọi thứ mà Ngài đã tạo, và Ngài đã khởi tạo con người (Adam) từ đất (một sự tạo hóa chưa từng có trước đó).",
            "verse 32:8": "Rồi, Ngài tạo ra dòng dõi của (Adam) từ một loại nước (tinh dịch) đáng khinh.",
            "verse 32:9": "Sau khi hoàn chỉnh hình thể cho (Adam), Ngài cho thổi vào cơ thể của Y linh hồn từ nơi Ngài. Ngài đã tạo ra cho các ngươi (hỡi con người) thính giác, thị giác và trái tim. (Tuy nhiên), các ngươi rất ít tri ân Ngài.",
            "verse 32:10": "Họ (những kẻ đa thần phủ nhận sự Phục Sinh) nói: “Lẽ nào sau khi (thân xác của) chúng tôi đã phân rã dưới lòng đất, chúng tôi sẽ được tạo hóa mới trở lại ư? (Điều đó thật không hợp lý, có vẻ hoang đường)” Không, họ chỉ phủ nhận việc gặp gỡ Thượng Đế của họ mà thôi.",
            "verse 32:11": "Ngươi (Thiên Sứ) hãy nói với họ: “Thần Chết, vị được giao nhiệm vụ (bắt hồn) các ngươi, sẽ rút hồn các ngươi, rồi các ngươi sẽ được đưa về trình diện Thượng Đế của các ngươi.”",
            "verse 32:12": "Giá như Ngươi (Thiên Sứ) có thể nhìn thấy tình cảnh của những kẻ tội lỗi gục đầu trước mặt Thượng Đế của họ (và van xin Ngài vào Ngày Phán Xét): “Lạy Thượng Đế của bầy tôi! Bầy tôi đã thấy và đã nghe, xin Ngài cho bầy tôi trở lại trần gian lần nữa, bầy tôi quyết sẽ hành thiện, bầy tôi chắc chắn sẽ có đức tin kiên định.”",
            "verse 32:13": "Nếu muốn, TA đã ban cho tất cả linh hồn sự hướng dẫn, nhưng lời phán của TA (về những kẻ tội lỗi) phải được thể hiện đúng sự thật rằng TA sẽ nhét đầy loài Jinn và loài người vào trong Hỏa Ngục.",
            "verse 32:14": "(Vào Ngày Phán Xét, họ được bảo): “Các ngươi hãy nếm (hình phạt) cho những gì mà các ngươi đã lãng quên về cuộc gặp gỡ ngày hôm nay, TA (Allah) quả thật cũng đã quên các ngươi giống như thế. Thôi, các ngươi hãy nếm sự trừng phạt mãi mãi bởi những điều mà các ngươi đã làm.”",
            "verse 32:15": "Người thực sự có đức tin nơi các lời mặc khải của TA chính là những người mà khi họ được nhắc về chúng thì họ liền quỳ lạy tán dương ca ngợi Thượng Đế của họ và họ sẽ không cao ngạo.",
            "verse 32:16": "Họ rời giường ngủ cầu nguyện Thượng Đế của họ với tâm trạng vừa lo sợ (hình phạt của Ngài) vừa ham muốn (Thiên Đàng của Ngài), và họ chi dùng bổng lộc mà TA (Allah) đã ban cấp cho họ (vào con đường chính nghĩa của TA).",
            "verse 32:17": "Không một linh hồn nào biết được niềm vui sướng đã được giấu kín(1) (nơi Thiên Đàng) dùng làm phần thưởng cho họ về những việc thiện mà họ đã từng làm.",
            "verse 32:18": "Lẽ nào người có đức tin lại giống với kẻ bất tuân?! Họ chắc chắn không ngang bằng nhau.",
            "verse 32:19": "Đối với những ai có đức tin và hành thiện thì sẽ được ban thưởng những Ngôi Vườn Thiên Đàng làm nơi cư ngụ (vĩnh hằng), một sự đãi ngộ cho những điều (thiện tốt) mà họ đã làm (trên thế gian).",
            "verse 32:20": "Riêng những kẻ bất tuân và phạm giới thì chỗ ở của họ sẽ là Hỏa Ngục. Mỗi khi họ muốn thoát ra khỏi đó thì sẽ bị lôi vào trong trở lại và họ được bảo: “Các ngươi hãy nếm hình phạt của Hỏa Ngục, cái mà các ngươi đã phủ nhận (trên thế gian).”",
            "verse 32:21": "TA (Allah) chắc chắn sẽ bắt họ nếm hình phạt (trên thế gian) trước khi đến với đại hình phạt (ở cõi Đời Sau), mong rằng họ biết quay về (với Thượng Đế của họ).",
            "verse 32:22": "Còn ai sai quấy hơn kẻ quay lưng với những lời mặc khải của Thượng Đế của y khi y được nhắc về chúng! Chắc chắn TA sẽ trừng trị những kẻ tội lỗi đó.",
            "verse 32:23": "Quả thật, TA đã ban cho Musa Kinh Sách (Tawrah). Do đó, Ngươi (Thiên Sứ) chớ hoài nghi về cuộc gặp gỡ Y (trong chuyến dạ hành và thăng thiên). Và TA đã làm cho (Kinh Tawrah) thành một nguồn Chỉ Đạo cho dân Israel.",
            "verse 32:24": "TA đã bổ nhiệm trong họ (người dân Israel) làm các nhà lãnh đạo hướng dẫn thiên hạ theo Mệnh Lệnh của TA khi họ vẫn biết nhẫn nại và có đức tin kiên định nơi các lời mặc khải của TA.",
            "verse 32:25": "Quả thật vào Ngày Tận Thế, Thượng Đế của Ngươi (hỡi Thiên Sứ) sẽ xét xử giữa họ về những điều mà họ đã thường tranh chấp trong Kinh Sách.",
            "verse 32:26": "Chẳng lẽ việc TA đã hủy diệt bao thế hệ trước họ và họ đi (chứng kiến) các chỗ ở hoang phế đó không hướng dẫn họ ư?! Quả thật trong sự việc đó là những dấu hiệu. Lẽ nào họ không nghe?!",
            "verse 32:27": "Chẳng lẽ họ không nhận thấy việc TA dẫn nước đến vùng đất khô cằn để TA làm mọc ra hoa màu và cây cỏ dùng làm thực phẩm cho gia súc của họ và cả bản thân họ nữa hay sao? Lẽ nào họ không quan sát?!",
            "verse 32:28": "(Những kẻ phủ nhận sự Phục Sinh hối thúc sự trừng phạt) nói: “Vậy bao giờ sự trừng phạt này sẽ đến nếu các người nói thật?”",
            "verse 32:29": "Ngươi (Thiên Sứ) hãy nói với họ: “Vào ngày mà sự trừng phạt xảy đến, đức tin của họ sẽ không giúp ích được gì cho họ và họ cũng sẽ không được gia hạn thêm (để có cơ hội sám hối).”",
            "verse 32:30": "Bởi thế, Ngươi (Thiên Sứ) hãy mặc kệ họ và hãy đợi (xem kết cuộc của họ) và quả thật họ cũng đang đợi (sự trừng phạt được chuẩn bị dành cho họ)."
        },
        "Yoruba": {
            "verse 32:1": "’Alif lam mim",
            "verse 32:2": "Isokale Tira naa, ko si iyemeji ninu re (pe o wa) lati odo Oluwa gbogbo eda",
            "verse 32:3": "Tabi won n wi pe: “O da adapa iro re ni.” Rara o! Ododo ni lati odo Oluwa re nitori ki o le fi sekilo fun awon eniyan kan, ti olukilo kan ko wa ba won ri siwaju re, nitori ki won le mona",
            "verse 32:4": "Allahu ni Eni ti O seda awon sanmo, ile ati nnkan t’o wa laaarin mejeeji laaarin ojo mefa. Leyin naa, O gunwa sori Ite-ola. Ko si alaabo ati olusipe kan fun yin leyin Re. Se e o nii lo iranti ni",
            "verse 32:5": "O n seto oro (eda) lati sanmo wa sori ile. Leyin naa, (abo oro eda) yoo gunke to O lo laaarin ojo kan ti odiwon re to egberun odun ninu onka ti e n ka",
            "verse 32:6": "Iyen ni Onimo-ikoko ati gbangba, Alagbara, Asake-orun",
            "verse 32:7": "Eni t’o se gbogbo nnkan ti O da ni daadaa. O si bere iseda eniyan lati inu erupe amo",
            "verse 32:8": "Leyin naa, O se awon aromodomo re lati ara ohun ti A mu jade lati ara omi lile yepere",
            "verse 32:9": "Leyin naa, O to (orikeerikee) re dogba. O si fe (emi) si i lara ninu emi Re (ti O da). O tun se igboro, iriran ati okan fun yin. Die ni ope ti e n da",
            "verse 32:10": "Won si wi pe: “Nje nigba ti a ba ti poora sinu ile, nje awa tun le wa ni eda titun mo? Ani se, awon ni alaigbagbo ninu ipade Oluwa won",
            "verse 32:11": "So pe: “Molaika iku eyi ti A fi ti yin maa gba emi yin. Leyin naa, odo Oluwa yin ni won maa da yin pada si.” gege bi O se je Eledaa ohun gbogbo. Ko si eda kan ti o maa to isemi wo afi pelu iyonda Allahu (subhanahu wa ta’ala). Ko si si eda kan ti o maa to iku wo afi pelu iyonda Allahu (subhanahu wa ta’ala). Nipa eyi Allahu l’O n fi ase Re gba emi kuro lara eda Re ni akoko ti O ti ko mo on ninu kadara. Iyen ni o jeyo ninu surah az-Zumor; 39:42. Bakan naa",
            "verse 32:12": "(Iwo iba ri eemo) ti o ba je pe o ri awon elese nigba ti won ba sori ko ni odo Oluwa won, (won si maa wi pe): “Oluwa wa, a ti riran, a si ti gboran (bayii), nitori naa, da wa pada (si ile aye) nitori ki a le lo se ise rere; dajudaju awa ni alamodaju.”",
            "verse 32:13": "Ti o ba je pe A ba fe ni, dajudaju A iba fun gbogbo emi kookan ni imona re, sugbon oro naa ti se lati odo Mi (bayii pe): “Dajudaju Mo maa mu ninu awon alujannu ati eniyan ni apapo kun inu ina Jahanamo.”",
            "verse 32:14": "Nitori naa, e to iya wo nitori pe e ti gbagbe ipade ojo yin (oni) yii. Dajudaju Awa naa yoo gbagbe yin sinu Ina. E to iya gbere wo nitori ohun ti e n se nise",
            "verse 32:15": "Awon t’o gbagbo ninu awon ayah Wa ni awon ti o je pe nigba ti won ba fi se isiti fun won, won yoo doju bole ni oluforikanle, won yo si se afomo pelu idupe fun Oluwa won. Won ko si nii segberaga",
            "verse 32:16": "Won n gbe egbe won kuro lori ibusun. Won si n pe Oluwa won ni ti ipaya ati ireti. Won si n na ninu ohun ti A pese fun won",
            "verse 32:17": "Ko si emi kan ti o mo ohun ti A fi pamo fun won ninu awon nnkan itutu oju. (O je) esan ohun ti won n se nise (rere)",
            "verse 32:18": "Nje eni t’o je onigbagbo ododo da bi eni t’o je obileje bi? Won ko dogba",
            "verse 32:19": "Ni ti awon t’o gbagbo ni ododo, ti won si se ise rere, awon ibugbe (ninu) Ogba Idera n be fun won. (O je) ohun ti A pese sile (de won) nitori ohun ti won n se nise (rere)",
            "verse 32:20": "Ni ti awon t’o baleje, Ina ni ibugbe won. Igbakigba ti won ba fe jade kuro ninu re, A o si maa da won pada sinu re. A si maa so fun won pe: “E to iya Ina ti e n pe niro wo.”",
            "verse 32:21": "Dajudaju A maa fun won to wo ninu iya t’o kere julo (nile aye) yato si iya t’o tobi julo (lorun) nitori ki won le seri pada (sibi ododo siwaju iku won)",
            "verse 32:22": "Ati pe ta l’o se abosi t’o tayo eni ti won fi awon ayah Wa se isiti fun, leyin naa, ti o gbunri kuro nibe? Dajudaju Awa maa gbesan lara awon elese",
            "verse 32:23": "Dajudaju A fun (Anabi) Musa ni Tira. Nitori naa, ma se wa ninu iyemeji nipa bi o se pade re (iyen, ninu irin-ajo oru ati gigun sanmo). A si se Tira naa ni imona fun awon omo ’Isro’il",
            "verse 32:24": "Ati pe A se awon asiwaju kan ninu won ni afinimona pelu ase Wa nigba ti won se suuru. Won si n ni amodaju nipa awon ayah Wa",
            "verse 32:25": "Dajudaju Oluwa re, O maa se idajo laaarin won ni Ojo Ajinde nipa ohun ti won n yapa enu si",
            "verse 32:26": "Se ko foju han si won pe, meloo meloo ninu awon iran ti A ti pare siwaju won. Awon naa si n rin koja ninu awon ibugbe won! Dajudaju awon ami wa ninu iyen. Nitori naa, se won ko nii teti gboro (ododo ni)",
            "verse 32:27": "Tabi won ko ri i pe dajudaju Awa l’A n wa omi ojo lo sori ile gbigbe, ti A si n fi mu irugbin jade? Awon eran-osin won ati awon naa si n je ninu re. Nitori naa, se won ko riran ni",
            "verse 32:28": "Won si n wi pe: “Igba wo ni Idajo yii ti e ba je olododo?”",
            "verse 32:29": "So pe: “Ni Ojo Idajo, igbagbo won ko nii sanfaani fun awon t’o sai gbagbo (ninu Allahu). A o si nii fun won ni isinmi (ninu Ina).”",
            "verse 32:30": "Nitori naa, seri kuro lodo won, ki o si maa reti (Ojo Idajo). Dajudaju awon naa n reti (re)"
        }
    }
}