{
    "id": 49,
    "name_simple": "Al-Hujurat",
    "revelation_place": "madinah",
    "revelation_order": 106,
    "bismillah_pre": true,
    "verses_count": 18,
    "short_text": "The Surah takes its name from verse 4 in which the word hujurat has occurred.",
    "text": [
        "\n",
        "The Surah takes its name from verse 4 in which the word hujurat has occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "Traditions show and the subject matter of the Surah also supports the same that this Surah is a collection of the commandments and instructions sent down on different occasions, which have been put together because of the relevancy of the theme. Moreover, the traditions also show that most of these commandments were sent down during the final stage of the Holy Prophet's life at Madinah. For instance, about verse 4 the commentators state that it was sent down concerning the Bani Tamim whose deputation had arrived in Madinah and started calling out to the Holy Prophet from outside the apartments (hujurat) of his wives, and according to all biographical books on the Holy Prophet's life this deputation had visited Madinah in A. H. 9. Likewise, about verse 6 a large number of the traditions of Hadith confirm that it was sent down concerning Walid bin Uqbah whom the Holy Prophet had sent to collect the zakat from the Bani al-Mustaliq, and it is well known that Walid\r\nbin Uqabah had become a Muslim on the conquest of Makkah.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "The subject matter of this Surah is to teach the Muslims the manners worthy of true believers.",
        "\n",
        "In the first five verses they have been taught the manners they should observe with regard to Allah and His Messenger.",
        "\n",
        "Then, they have been given the instruction that it is not right to believe in every news blindly and to act according to it, without due thought. If information is received about a person, a group or a community, it should be seen carefully whether the means of the information is reliable or not. If the means is not reliable, it should be tested and examined to see whether the news is authentic or not before taking any action on it.",
        "\n",
        "Then, it has been told what attitude should the other Muslims adopt in case two groups of the Muslims fall to mutual fighting.",
        "\n",
        "Then the Muslims have been exhorted to safeguard against the evils that corrupt collective life and spoil mutual relationships. Mocking and taunting each other, calling others by nicknames, creating suspicions, prying into other people's affairs and back biting are the evils which are not only sins in themselves but they also corrupt society. Allah has mentioned all these evils separately and forbidden them as unlawful.",
        "\n",
        "After this, the national and racial distinctions that cause universal corruption in the world have been condemned. Nations and tribes and families pride of Ancestry and their looking down upon others as inferior to themselves and their pulling down others only for the sake of establishing their own superiority is an important factor that has filled the world with injustices and tyranny. Allah in a brief verse has cut at the root of this evil by stating that all men are descendants of the same one pair and their division into tribes and communities is only for the sake of recognition, not for boasting and pride, and there is no lawful basis of one man's superiority over the other except on the basis of moral excellence.",
        "\n",
        "In conclusion, the people have been told that the real thing is not the verbal Profession of the Faith but to believe in Allah and His messenger truly, to obey them in practical life and to exert sincerely with one's self and wealth in the cause of Allah. True believers are only those who adopt this attitude. As for those who profess Islam merely orally without affirmation by the heart and then adopt an attitude as if they had done someone a favor by accepting Islam, may be counted among the Muslims in the world, may even be treated as Muslims in society, but they cannot be counted as believers in the sight of Allah.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that criticized as ill-mannered and uncouth those who would stand behind the Apartments of the Prophet’s wives and call him forth for discourse with raised voices. It takes its name from the word “apartments” (ḥujurāt) in verse 4. The surah guides the believers on how to behave with proper respect towards their leader (verse 1 .), and with mutual respect and trust towards each other (verse 9 .). It stresses the unity of mankind and God’s intention that people should live together in harmony (verse 13). It criticizes the desert Arabs for their presumptuous attitude to their faith and to God (verse 14 .).The surah is also known as: The (Inner) Apartments, The Chambers, The Inner Apartments, The Private Quarters, The Private Rooms.",
    "name_translation": "Apartments",
    "name_complex": "Al-Hujurât",
    "surah_name_ar": "الحجرات",
    "verses": {
        "Albanian": {
            "verse 49:1": "O ju që keni besuar! Mos nxitoi para urdhërit (dispozitës) së Perëndisë dhe Pejgamberit të Tij dhe druani Perëndisë! Perëndia, me të vërtetë, i dëgjon të gjitha dhe i di të gjitha.",
            "verse 49:2": "O ju që keni besuar! Mos ngritni zërin tuaj mbi zërin e Pejgamberit dhe mos bisedoni me të me zë të lartë, ashtu si flitni zëshëm njëri me tjetrin, në mëhyrë që mos t’u humbin veprat tuaja – e që ju të mos i hetoni.",
            "verse 49:3": "Me të vërtetë, ata që ulin zërin para (në prezencën e) Pejgamberit të Perëndisë – e ata janë (ata), zemrat e të cilëve Perëndia i ka kalitur për besim. Për ta ka falje dhe shpërblim të madh.",
            "verse 49:4": "Me të vërtetë, ata që të thërrasin ty pas (mureve) të dhomave (tuaja), shumica e tyre nuk mendojnë.",
            "verse 49:5": "E sikur të durojnë ata deri sa t’ju dalish ti atyre, do të ishte më mirë për ta; e Perëndia ësht falës dhe mëshirues.",
            "verse 49:6": "O ju që keni besuar! Nëse ndonjë njeri i pandershëm ju sjell ndonjë lajm, analizoni mirë, për të mos i bërë dëm ndokujt nga mosdijenia, e të pendoheni pastaj për atë që keni punuar.",
            "verse 49:7": "Dhe, dijeni se në mes jush gjendet Pejgamberi i Perëndisë; sikur ai t’ju dëgjonte juve në shumë gjëra, ju do të kishit pësuar; por Perëndia disave prej jush ua ka bërë të këndshëm besimin dhe ua ka zbukuruar atë në zemrat tuaja, e ua ka urryer juve mohimin, ngatërresat dhe mëkatet. Të tillët janë në rrugën e drejtë,",
            "verse 49:8": "me mirësinë dhe dhuntinë e Perëndisë. – E, Perëndia është i Plotëdijshëm dhe i Gjithëdijshëm.",
            "verse 49:9": "Nëse dy grupe muslimanësh luftojnë në mes vete, pajtoni ata, e nëse njëra prej tyre sulmon atë tjetrën, atëherë luftoni kundër sulmuesit, përderisa të mos kthehet në dispozitat e Perëndisë. E, nëse kthehet, atëherë pajtoni ata mes tyre, me të drejtë dhe bëhuni të drejtë. Perëndia, me të vërtetë, i do të drejtët.",
            "verse 49:10": "Me të vërtetë, muslimanët janë vëllezër, andaj pajtoni vëllezërit tuaj në mes vete dhe druajuni Perëndisë, për t’u mëshiruar ju.",
            "verse 49:11": "O ju që keni besuar! Le të mos e përqeshin një popull atë tjetrin. Ndoshta ata të përqeshurit janë më të mirë se ata, e as gratë mos të përqeshin të tjerat. Ndoshta ato (të përqeshurat) janë më të mira se ato, dhe mos e nënçmoni njëri-tjetrin dhe mos e thirrni njëri-tjetrin me llagape (të këqia)! I shëmtuar është emri i keq pas besimit! E, ata që nuk pendohen, ata, me të vërtetë, janë zullumqarë.",
            "verse 49:12": "O ju që keni besuar! Shmanguni prej shumë dyshimeve, meqë disa dyshime janë mëkat. Mos i hulumtoni të metat (e njëri-tjetrit) dhe mos e përgojoni njëri-tjetrin! Mos vallë dëshiron ndokush prej jush të hajë mishin e vëllait të vet të vdekur, e juve kjo u është e neveritshme! Druajuni Perëndisë! Me të vërtetë, Perëndia është pranues i pendimit dhe mëshirues.",
            "verse 49:13": "O njerëz! Ne, me të vërtetë, u krijuam juve prej një mashkulli dhe një femre dhe u bëmë juve popuj dhe fise, për t’u njohur (në mes vete). Më i lavdërueshëm te Perëndia është ai që i druan më së shumti Atij. Me të vërtetë, Perëndia është i Plotëdijshëm dhe asgjë nuk i është e fshehtë Atij.",
            "verse 49:14": "Beduinët (arabët e shkretëtirës) thanë: “Na besojmë”. Thuaju (atyre): “Nuk keni besuar!” Por, thoni: “Na jemi përulur!” meqë në zemrat tuaja ende nuk ka hyrë feja si duhet. E, nëse i përuleni Perëndisë dhe Pejgamberit të Tij, nuk do t’ju pakësohet juve asgjë prej veprave tuaja. Me të vërtetë, Perëndia është falës dhe mëshirues.",
            "verse 49:15": "Besimtarë të vërtetë janë vetëm ata që besojnë Perëndinë dhe Pejgamberin e Tij, dhe pastja nuk dyshojnë dhe luftojnë në rrugën e Perëndisë me pasurinë dhe jetën e tyre. Këta janë besimtarë të sinqertë.",
            "verse 49:16": "Thuaju (atyre): “Vallë, a ju ta lajmëroni Perëndinë për besimin tuaj, e Perëndia i di të gjitha çka ka në qiej dhe në Tokë! Perëndia është i dijshëm për çdo gjë.",
            "verse 49:17": "Ata të përkujtojnë ty, (mirësitë), ngase kanë pranuar islamizmin. Thuaju (atyre): “Mos më përkutjoni ju për atë që keni pranuar islamizmin; përkundrazi, Perëndia ju ka dhuruar mirësi dhe ju ka orientuar në besim, nëse flisni të vërtetën!",
            "verse 49:18": "Perëndia, me të vërtetë; i di fshehtësitë e qiejve dhe Tokës. Perëndia i sheh të gjitha ato që punoni ju."
        },
        "Amharic": {
            "verse 49:1": "እናንተ ያመናችሁ ሆይ! በአላህና በመልክተኛው ፊት (ነፍሶቻችሁን) አታስቀድሙ፡፡ አላህንም ፍሩ፡፡ አላህ ሰሚ ዐዋቂ ነውና፡፡",
            "verse 49:2": "እናንተ ያመናችሁ ሆይ! ድምጾቻችሁን ከነቢዩ ድምጽ በላይ ከፍ አታድርጉ፡፡ ከፊላችሁም ለከፊሉ እንደሚጮህ በንግግር ለርሱ አትጩሁ፡፡ እናንተ የማታውቁ ስትኾኑ ሥራዎቻችሁ እንዳይበላሹ (ተከልከሉ)፡፡",
            "verse 49:3": "እነዚያ በአላህ መልክተኛ ዘንድ ድምጾቻቸውን ዝቅ የሚያደርጉ እነዚህ እነዚያ አላህ ልቦቻቸውን ለፍርሃት የፈተናቸው ናቸው፡፡ ለእነርሱም ምሕረትና ታላቅ ምንዳ አላቸው፡፡",
            "verse 49:4": "እነዚያ ከክፍሎቹ ውጭ ኾነው የሚጠሩህ አብዛኞቻቸው አያውቁም፡፡",
            "verse 49:5": "ወደእነርሱም እስክትወጣ ድረስ እነርሱ በታገሱ ኖሮ ለእነርሱ በላጭ በኾነ ነበር፡፡ አላህም እጅግ መሓሪ አዛኝ ነው፡፡",
            "verse 49:6": "እላንተ ያመናችሁ ሆይ! ነገረኛ ወሬን ቢያመጣላችሁ በስህተት ላይ ኾናችሁ ሕዝቦችን እንዳትጎዱና በሠራችሁት ነገር ላይ ተጸጸቾች እንዳትኾኑ አረጋግጡ፡፡",
            "verse 49:7": "በውስጣችሁም የአላህ መልክተኛ መኖሩን ዕወቁ፡፡ ከነገሩ በብዙው ቢከተላችሁ ኖሮ በእርግጥ በተቸገራችሁ ነበር፡፡ ግን አላህ አምነትን ወደናንተ አስወደደ፡፡ በልቦቻችሁም ውሰጥ አጌጠው፡፡ ክህደትንና አመጽንም እንቢተኛነትንም ወደናንተ የተጠላ አደረገ፡፡ እነዚያ (እምነትን የወደዱና ክሕደተን የጠሉ) እነርሱ ቅኖቹ ናቸው፡፡",
            "verse 49:8": "ከአላህ በኾነው ችሮታና ጸጋ (ቅኖች ናቸው)፡፡ አላህም ዐዋቂ ጥበበኛ ነው፡፡",
            "verse 49:9": "ከምዕምናንም የኾኑ ሁለት ጭፍሮች ቢጋደሉ በመካከላቸው አስታርቁ፡፡ ከሁለቱ አንደኛይቱም በሌላይቱ ላይ ወሰን ብታልፍ ያችን ወሰን የምታልፈውን ወደ አላህ ትዕዛዝ እስከምትመለስ ድረስ ተጋደሉ፡፡ ብትመለስም በመካከላቸው በትክክል አስታርቁ፡፡ በነገሩ ሁሉ አስተካክሉም፡፡ አላህ አስተካካዮችን ይወዳልና፡፡",
            "verse 49:10": "ምእመናኖች ወንድማመቾች ናቸው፡፡ በሁለት ወንድሞቻችሁም መካከል አስታርቁ፡፡ ይታዘንላችሁም ዘንድ አላህን ፍሩ፡፡",
            "verse 49:11": "እናንተ ያመናችሁ ሆይ! ወንዶች ከወንዶች አይቀልዱ፡፡ ከእነርሱ የበለጡ ሊኾኑ ይከጀላልና፡፡ ሴቶችም ከሴቶች (አይሳለቁ)፡፡ ከእነርሱ የበለጡ ሊኾኑ ይከጀላልና፡፡ ነፍሶቻችሁንም አታነውሩ፡፡ በመጥፎ ስሞችም አትጠራሩ፡፡ ከእምነት በኋላ የማመጽ ስም ከፋ፡፡ ያልተጸጸተም ሰው እነዚያ እነርሱ በዳዮቹ ናቸው፡፡",
            "verse 49:12": "እናንተ ያመናችሁ ሆይ! ከጥርጣሬ ብዙውን ራቁ፤ ከጥርጣሬ ከፊሉ ኃጢአት ነውና፡፡ ነውርንም አትከታተሉ፡፡ ከፊላችሁም ከፊሉን አይማ፡፡ አንደኛችሁ የወንድሙን ስጋ የሞተ ኾኖ ሊበላው ይወዳልን? (መብላቱን) ጠላችሁትም፤ (ሐሜቱንም ጥሉት)፡፡ አላህንም ፍሩ፡፡ አላህ ጸጸትን ተቀባይ አዛኝ ነውና፡፡",
            "verse 49:13": "እናንተ ሰዎች ሆይ! እኛ ከወንድና ከሴት ፈጠርናችሁ፡፡ እንድትተዋወቁም ጎሳዎችና ነገዶች አደረግናችሁ፡፡ አላህ ዘንድ በላጫችሁ በጣም አላህን ፈሪያችሁ ነው፡፡ አላህ ግልጽን ዐዋቂ ውስጥንም ዐዋቂ ነው፡፡",
            "verse 49:14": "የዐረብ ዘላኖች «አምነናል» አሉ፡፡ «አላመናችሁም፤ ግን ሰልመናል በሉ፡፡ «እምነቱም በልቦቻችሁ ውስጥ ገና (ጠልቆ) አልገባም፡፡ አላህንና መልክተኛውንም ብትታዘዙ ከሥራዎቻችሁ ምንንም አያጎድልባችሁም፡፡ አላህ መሓሪ አዛኝ ነውና» በላቸው፡፡",
            "verse 49:15": "(እውነተኛዎቹ) ምእምናን እነዚያ በአላህና በመልእከተኛው ያመኑት ከዚያም ያልተጠራጠሩት በገንዘቦቻቸውና በነፍሶ ቻቸውም በአላህ መንገድ የታገሉት ብቻ ናቸው፡፡ እነዚያ እነሱ እውነተኞቹ ናቸው፡፡",
            "verse 49:16": "«አላህ በሰማያት ውስጥ ያለውንና በምድር ውስጥ ያለውን ሁሉ የሚያውቅ ሲኾን አላህን በሃይማኖታችሁ ታስታውቁ ታላችሁን?» በላቸው፡፡ አላህም በነገሩ ሁሉ ዐዋቂ ነው፡፡",
            "verse 49:17": "በመስለማቸው በአንተ ላይ ይመጻደቃሉ «በስልምናችሁ በኔ ላይ አትመጻደቁ፤ ይልቁንም አላህ ወደ እምነት ስለ መራችሁ ይመጸደቅባችኋል፤ እውነተኞች ብትኾኑ» (መመጻደቅ ለአላህ ነው) በላቸው፡፡",
            "verse 49:18": "አላህ የሰማያትንና የምድርን ሩቅ ምሰጢር ያውቃል፤ አላህም የምትሰሩትን ሁሉ ተመልካች ነው፡፡"
        },
        "Arabic": {
            "verse 49:1": "ٌميِلَع ٌعيِمَس َهَّللا َّنِإ ۚ َهَّللا اوُقَّتاَو ۖ ِهِلوُسَرَو ِهَّللا ِيَدَي َنْيَب اوُمِّدَقُت اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 49:2": "َنوُرُعْشَت اَل ْمُتنَأَو ْمُكُلاَمْعَأ َطَبْحَت نَأ ٍضْعَبِل ْمُكِضْعَب ِرْهَجَك ِلْوَقْلاِب ُهَل اوُرَهْجَت اَلَو ِّيِبَّنلا ِتْوَص َقْوَف ْمُكَتاَوْصَأ اوُعَفْرَت اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 49:3": "ٌميِظَع ٌرْجَأَو ٌةَرِفْغَّم مُهَل ۚ ٰىَوْقَّتلِل ْمُهَبوُلُق ُهَّللا َنَحَتْما َنيِذَّلا َكِئَٰلوُأ ِهَّللا ِلوُسَر َدنِع ْمُهَتاَوْصَأ َنوُّضُغَي َنيِذَّلا َّنِإ",
            "verse 49:4": "َنوُلِقْعَي اَل ْمُهُرَثْكَأ ِتاَرُجُحْلا ِءاَرَو نِم َكَنوُداَنُي َنيِذَّلا َّنِإ",
            "verse 49:5": "ٌميِحَّر ٌروُفَغ ُهَّللاَو ۚ ْمُهَّل اًرْيَخ َناَكَل ْمِهْيَلِإ َجُرْخَت ٰىَّتَح اوُرَبَص ْمُهَّنَأ ْوَلَو",
            "verse 49:6": "َنيِمِداَن ْمُتْلَعَف اَم ٰىَلَع اوُحِبْصُتَف ٍةَلاَهَجِب اًمْوَق اوُبيِصُت نَأ اوُنَّيَبَتَف ٍإَبَنِب ٌقِساَف ْمُكَءاَج نِإ اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 49:7": "َنوُدِشاَّرلا ُمُه َكِئَٰلوُأ ۚ َناَيْصِعْلاَو َقوُسُفْلاَو َرْفُكْلا ُمُكْيَلِإ َهَّرَكَو ْمُكِبوُلُق يِف ُهَنَّيَزَو َناَميِإْلا ُمُكْيَلِإ َبَّبَح َهَّللا َّنِكَٰلَو ْمُّتِنَعَل ِرْمَأْلا َنِّم ٍريِثَك يِف ْمُكُعيِطُي ْوَل ۚ ِهَّللا َلوُسَر ْمُكيِف َّنَأ اوُمَلْعاَو",
            "verse 49:8": "ٌميِكَح ٌميِلَع ُهَّللاَو ۚ ًةَمْعِنَو ِهَّللا َنِّم اًلْضَف",
            "verse 49:9": "َنيِطِسْقُمْلا ُّبِحُي َهَّللا َّنِإ ۖ اوُطِسْقَأَو ِلْدَعْلاِب اَمُهَنْيَب اوُحِلْصَأَف ْتَءاَف نِإَف ۚ ِهَّللا ِرْمَأ ٰىَلِإ َءيِفَت ٰىَّتَح يِغْبَت يِتَّلا اوُلِتاَقَف ٰىَرْخُأْلا ىَلَع اَمُهاَدْحِإ ْتَغَب نِإَف ۖ اَمُهَنْيَب اوُحِلْصَأَف اوُلَتَتْقا َنيِنِمْؤُمْلا َنِم ِناَتَفِئاَط نِإَو",
            "verse 49:10": "(َنوُمَحْرُت ْمُكَّلَعَل َهَّللا اوُقَّتاَو ۚ ْمُكْيَوَخَأ َنْيَب اوُحِلْصَأَف ٌةَوْخِإ َنوُنِمْؤُمْلا اَمَّنِإ",
            "verse 49:11": "(َنوُمِلاَّظلا ُمُه َكِئَٰلوُأَف ْبُتَي ْمَّل نَمَو ۚ ِناَميِإْلا َدْعَب ُقوُسُفْلا ُمْساِلا َسْئِب ۖ ِباَقْلَأْلاِب اوُزَباَنَت اَلَو ْمُكَسُفنَأ اوُزِمْلَت اَلَو ۖ َّنُهْنِّم اًرْيَخ َّنُكَي نَأ ٰىَسَع ٍءاَسِّن نِّم ٌءاَسِن اَلَو ْمُهْنِّم اًرْيَخ اوُنوُكَي نَأ ٰىَسَع ٍمْوَق نِّم ٌمْوَق ْرَخْسَي اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 49:12": "(ٌميِحَّر ٌباَّوَت َهَّللا َّنِإ ۚ َهَّللا اوُقَّتاَو ۚ ُهوُمُتْهِرَكَف اًتْيَم ِهيِخَأ َمْحَل َلُكْأَي نَأ ْمُكُدَحَأ ُّبِحُيَأ ۚ اًضْعَب مُكُضْعَّب بَتْغَي اَلَو اوُسَّسَجَت اَلَو ۖ ٌمْثِإ ِّنَّظلا َضْعَب َّنِإ ِّنَّظلا َنِّم اًريِثَك اوُبِنَتْجا اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 49:13": "(ٌريِبَخ ٌميِلَع َهَّللا َّنِإ ۚ ْمُكاَقْتَأ ِهَّللا َدنِع ْمُكَمَرْكَأ َّنِإ ۚ اوُفَراَعَتِل َلِئاَبَقَو اًبوُعُش ْمُكاَنْلَعَجَو ٰىَثنُأَو ٍرَكَذ نِّم مُكاَنْقَلَخ اَّنِإ ُساَّنلا اَهُّيَأ اَي",
            "verse 49:14": "(ٌميِحَّر ٌروُفَغ َهَّللا َّنِإ ۚ اًئْيَش ْمُكِلاَمْعَأ ْنِّم مُكْتِلَي اَل ُهَلوُسَرَو َهَّللا اوُعيِطُت نِإَو ۖ ْمُكِبوُلُق يِف ُناَميِإْلا ِلُخْدَي اَّمَلَو اَنْمَلْسَأ اوُلوُق نِكَٰلَو اوُنِمْؤُت ْمَّل لُق ۖ اَّنَمآ ُباَرْعَأْلا ِتَلاَق ۞",
            "verse 49:15": "(َنوُقِداَّصلا ُمُه َكِئَٰلوُأ ۚ ِهَّللا ِليِبَس يِف ْمِهِسُفنَأَو ْمِهِلاَوْمَأِب اوُدَهاَجَو اوُباَتْرَي ْمَل َّمُث ِهِلوُسَرَو ِهَّللاِب اوُنَمآ َنيِذَّلا َنوُنِمْؤُمْلا اَمَّنِإ",
            "verse 49:16": "(ٌميِلَع ٍءْيَش ِّلُكِب ُهَّللاَو ۚ ِضْرَأْلا يِف اَمَو ِتاَواَمَّسلا يِف اَم ُمَلْعَي ُهَّللاَو ْمُكِنيِدِب َهَّللا َنوُمِّلَعُتَأ ْلُق",
            "verse 49:17": "(َنيِقِداَص ْمُتنُك نِإ ِناَميِإْلِل ْمُكاَدَه ْنَأ ْمُكْيَلَع ُّنُمَي ُهَّللا ِلَب ۖ مُكَماَلْسِإ َّيَلَع اوُّنُمَت اَّل لُق ۖ اوُمَلْسَأ ْنَأ َكْيَلَع َنوُّنُمَي",
            "verse 49:18": "(َنوُلَمْعَت اَمِب ٌريِصَب ُهَّللاَو ۚ ِضْرَأْلاَو ِتاَواَمَّسلا َبْيَغ ُمَلْعَي َهَّللا َّنِإ"
        },
        "Azerbaijani": {
            "verse 49:1": "Ey iman gətirənlər! Heç bir şeydə Allahı və Onun Elçisini qabaqlamayın. Allahdan qorxun! Həqiqətən, Allah Eşidəndir, Biləndir.",
            "verse 49:2": "Ey iman gətirənlər! Səsinizi Peyğəmbərin səsindən yüksəyə qaldırmayın və bir-birinizə müraciət etdiyiniz kimi ona da uca səslə müraciət etməyin. Yoxsa, özünüz də hiss etmədən əməlləriniz hədər gedər.",
            "verse 49:3": "Həqiqətən, Allahın Elçisi yanında səsini endirənlər o şəxslərdir ki, Allah onların qəlbini təqva üçün sınağa çəkmişdir. Onları bağışlanma və böyük mükafat gözləyir.",
            "verse 49:4": "Şübhəsiz ki, səni otaqların arxasından səsləyənlərin əksəriyyəti nə etdiklərini anlamırlar.",
            "verse 49:5": "Sən onların qarşılarına çıxanadək səbir etsəydilər, əlbəttə, bu, onlar üçün daha yaxşı olardı. Allah Bağışlayandır, Rəhmlidir.",
            "verse 49:6": "Ey iman gətirənlər! Əgər bir fasiq sizə bir xəbər gətirsə, onu araşdırın. Yoxsa bilmədən bir qövmə pislik edər, sonra da bunun peşmançılığını çəkərsiniz.",
            "verse 49:7": "Bilin ki, Allahın Elçisi aranızdadır. Əgər o, bir çox işlərdə sizə güzəştə getsəydi, çətinliyə düşərdiniz. Lakin Allah sizə imanı sevdirmiş, onu qəlbinizə gözəl göstərmiş, sizdə küfrə, günaha və asi olmağa qarşı nifrət oyatmışdır. Doğru yolda olanlar da bunlardır.",
            "verse 49:8": "Bunlar Allahın lütfü və neməti sayəsindədir. Allah Biləndir, Müdrikdir.",
            "verse 49:9": "Əgər möminlərdən iki dəstə bir-biri ilə vuruşsa, onları barışdırın. Əgər onlardan biri digərinə qarşı təcavüz etsə, təcavüzkar dəstə ilə, o, Allahın əmrini yerinə yetirməyə qayıdanadək, vuruşun. Əgər o qayıtsa, hər iki dəstəni ədalətlə barışdırın və insaflı olun. Sözsüz ki, Allah insaflıları sevir.",
            "verse 49:10": "Möminlər, həqiqətən də qardaşdırlar. Elə isə qardaşlarınızı barışdırın və Allahdan qorxun ki, sizə rəhm edilsin.",
            "verse 49:11": "Ey iman gətirənlər! Bir camaat digərini məsxərəyə qoymasın. Ola bilər ki, bunlar onlardan daha yaxşı olsunlar. Qadınlar da qadınları lağa qoymasınlar. Ola bilər ki, bunlar onlardan daha yaxşı olsunlar. Bir-birinizə tənə vurmayın və bir-birinizi pis ləqəblərlə çağırmayın. İman gətirdikdən sonra fasiq adlanmaq necə də pisdir. Məhz tövbə etməyənlər zalımlardır.",
            "verse 49:12": "Ey iman gətirənlər! Zənnə çox qapılmayın. Çünki zənn edilənlərin bir qismi günahdır. Bir-birinizi güdməyin, bir-birinizin qeybətini qırmayın. Sizdən biriniz ölmüş qardaşının ətini yemək istəyərmi? Siz ki, bundan iyrənirsiniz. Allahdan qorxun! Həqiqətən, Allah tövbələri qəbul edəndir, Rəhmlidir.",
            "verse 49:13": "Ey insanlar! Biz sizi kişi və qadından yaratdıq. Sonra bir-birinizi tanıyasınız deyə, sizi xalqlara və qəbilələrə ayırdıq. Şübhəsiz ki, Allah yanında ən hörmətli olanınız Ondan ən çox qorxanınızdır. Həqiqətən, Allah Biləndir, Xəbərdardır.",
            "verse 49:14": "Bədəvilər: “Biz iman gətirdik!”– dedilər. De: “Siz qəlbən iman gətirmədiniz! Ancaq: “Biz müsəlman olduq!”– deyin. İman sizin qəlblərinizə hələ daxil olmamışdır. Əgər Allaha və Onun Elçisinə itaət etsəniz, O sizin əməllərinizdən heç bir şey əskiltməz. Şübhəsiz ki, Allah Bağışlayandır, Rəhmlidir!”",
            "verse 49:15": "Möminlər ancaq Allaha və Onun Elçisinə iman gətirən, sonra heç bir şəkk-şübhəyə düşməyən, Allah yolunda malları və canları ilə cihad edənlərdir! İmanlarında sadiq olanlar da məhz onlardır.",
            "verse 49:16": "De: “Siz dininizi Allahamı öyrədirsiniz?” Halbuki Allah göylərdə olanları da, yerdə olanları da bilir. Allah hər şeyi bilir.",
            "verse 49:17": "Onlar müsəlman olduqlarına görə sənə minnət qoyurlar. De: “Müsəlman olmusunuz deyə mənə minnət qoymayın! Əgər doğru danışanlarsınızsa, bilin ki, əslində Allah sizi imana gətirməklə sizə mərhəmət göstərmişdir!”",
            "verse 49:18": "Şübhəsiz ki, Allah göylərin də, yerin də qeybini bilir. Allah sizin nə etdiklərinizi görür."
        },
        "Bengali": {
            "verse 49:1": "মুমিনগণ! তোমরা আল্লাহ ও রসূলের সামনে অগ্রণী হয়ো না এবং আল্লাহকে ভয় কর। নিশ্চয় আল্লাহ সবকিছু শুনেন ও জানেন।",
            "verse 49:2": "মুমিনগণ! তোমরা নবীর কন্ঠস্বরের উপর তোমাদের কন্ঠস্বর উঁচু করো না এবং তোমরা একে অপরের সাথে যেরূপ উঁচুস্বরে কথা বল, তাঁর সাথে সেরূপ উঁচুস্বরে কথা বলো না। এতে তোমাদের কর্ম নিস্ফল হয়ে যাবে এবং তোমরা টেরও পাবে না।",
            "verse 49:3": "যারা আল্লাহর রসূলের সামনে নিজেদের কন্ঠস্বর নীচু করে, আল্লাহ তাদের অন্তরকে শিষ্টাচারের জন্যে শোধিত করেছেন। তাদের জন্যে রয়েছে ক্ষমা ও মহাপুরস্কার।",
            "verse 49:4": "যারা প্রাচীরের আড়াল থেকে আপনাকে উচুস্বরে ডাকে, তাদের অধিকাংশই অবুঝ।",
            "verse 49:5": "যদি তারা আপনার বের হয়ে তাদের কাছে আসা পর্যন্ত সবর করত, তবে তা-ই তাদের জন্যে মঙ্গলজনক হত। আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
            "verse 49:6": "মুমিনগণ! যদি কোন পাপাচারী ব্যক্তি তোমাদের কাছে কোন সংবাদ আনয়ন করে, তবে তোমরা পরীক্ষা করে দেখবে, যাতে অজ্ঞতাবশতঃ তোমরা কোন সম্প্রদায়ের ক্ষতিসাধনে প্রবৃত্ত না হও এবং পরে নিজেদের কৃতকর্মের জন্যে অনুতপ্ত না হও।",
            "verse 49:7": "তোমরা জেনে রাখ তোমাদের মধ্যে আল্লাহর রসূল রয়েছেন। তিনি যদি অনেক বিষয়ে তোমাদের আবদার মেনে নেন, তবে তোমরাই কষ্ট পাবে। কিন্তু আল্লাহ তোমাদের অন্তরে ঈমানের মহব্বত সৃষ্টি করে দিয়েছেন এবং তা হৃদয়গ্রাহী করে দিয়েছেন। পক্ষান্তরে কুফর, পাপাচার ও নাফরমানীর প্রতি ঘৃণা সৃষ্টি করে দিয়েছেন। তারাই সৎপথ অবলম্বনকারী।",
            "verse 49:8": "এটা আল্লাহর কৃপা ও নিয়ামতঃ আল্লাহ সর্বজ্ঞ প্রজ্ঞাময়।",
            "verse 49:9": "যদি মুমিনদের দুই দল যুদ্ধে লিপ্ত হয়ে পড়ে, তবে তোমরা তাদের মধ্যে মীমাংসা করে দিবে। অতঃপর যদি তাদের একদল অপর দলের উপর চড়াও হয়, তবে তোমরা আক্রমণকারী দলের বিরুদ্ধে যুদ্ধ করবে; যে পর্যন্ত না তারা আল্লাহর নির্দেশের দিকে ফিরে আসে। যদি ফিরে আসে, তবে তোমরা তাদের মধ্যে ন্যায়ানুগ পন্থায় মীমাংসা করে দিবে এবং ইনছাফ করবে। নিশ্চয় আল্লাহ ইনছাফকারীদেরকে পছন্দ করেন।",
            "verse 49:10": "মুমিনরা তো পরস্পর ভাই-ভাই। অতএব, তোমরা তোমাদের দুই ভাইয়ের মধ্যে মীমাংসা করবে এবং আল্লাহকে ভয় করবে-যাতে তোমরা অনুগ্রহপ্রাপ্ত হও।",
            "verse 49:11": "মুমিনগণ, কেউ যেন অপর কাউকে উপহাস না করে। কেননা, সে উপহাসকারী অপেক্ষা উত্তম হতে পারে এবং কোন নারী অপর নারীকেও যেন উপহাস না করে। কেননা, সে উপহাসকারিণী অপেক্ষা শ্রেষ্ঠ হতে পারে। তোমরা একে অপরের প্রতি দোষারোপ করো না এবং একে অপরকে মন্দ নামে ডেকো না। কেউ বিশ্বাস স্থাপন করলে তাদের মন্দ নামে ডাকা গোনাহ। যারা এহেন কাজ থেকে তওবা না করে তারাই যালেম।",
            "verse 49:12": "মুমিনগণ, তোমরা অনেক ধারণা থেকে বেঁচে থাক। নিশ্চয় কতক ধারণা গোনাহ। এবং গোপনীয় বিষয় সন্ধান করো না। তোমাদের কেউ যেন কারও পশ্চাতে নিন্দা না করে। তোমাদের কেউ কি তারা মৃত ভ্রাতার মাংস ভক্ষণ করা পছন্দ করবে? বস্তুতঃ তোমরা তো একে ঘৃণাই কর। আল্লাহকে ভয় কর। নিশ্চয় আল্লাহ তওবা কবুলকারী, পরম দয়ালু।",
            "verse 49:13": "হে মানব, আমি তোমাদেরকে এক পুরুষ ও এক নারী থেকে সৃষ্টি করেছি এবং তোমাদেরকে বিভিন্ন জাতি ও গোত্রে বিভক্ত করেছি, যাতে তোমরা পরস্পরে পরিচিতি হও। নিশ্চয় আল্লাহর কাছে সে-ই সর্বাধিক সম্ভ্রান্ত যে সর্বাধিক পরহেযগার। নিশ্চয় আল্লাহ সর্বজ্ঞ, সবকিছুর খবর রাখেন।",
            "verse 49:14": "মরুবাসীরা বলেঃ আমরা বিশ্বাস স্থাপন করেছি। বলুনঃ তোমরা বিশ্বাস স্থাপন করনি; বরং বল, আমরা বশ্যতা স্বীকার করেছি। এখনও তোমাদের অন্তরে বিশ্বাস জন্মেনি। যদি তোমরা আল্লাহ ও তাঁর রসূলের আনুগত্য কর, তবে তোমাদের কর্ম বিন্দুমাত্রও নিস্ফল করা হবে না। নিশ্চয়, আল্লাহ ক্ষমাশীল, পরম মেহেরবান।",
            "verse 49:15": "তারাই মুমিন, যারা আল্লাহ ও তাঁর রসূলের প্রতি ঈমান আনার পর সন্দেহ পোষণ করে না এবং আল্লাহর পথে প্রাণ ও ধন-সম্পদ দ্বারা জেহাদ করে। তারাই সত্যনিষ্ঠ।",
            "verse 49:16": "বলুনঃ তোমরা কি তোমাদের ধর্ম পরায়ণতা সম্পর্কে আল্লাহকে অবহিত করছ? অথচ আল্লাহ জানেন যা কিছু আছে ভূমন্ডলে এবং যা কিছু আছে নভোমন্ডলে। আল্লাহ সর্ববিষয়ে সম্যক জ্ঞাত।",
            "verse 49:17": "তারা মুসলমান হয়ে আপনাকে ধন্য করেছে মনে করে। বলুন, তোমরা মুসলমান হয়ে আমাকে ধন্য করেছ মনে করো না। বরং আল্লাহ ঈমানের পথে পরিচালিত করে তোমাদেরকে ধন্য করেছেন, যদি তোমরা সত্যনিষ্ঠ হয়ে থাক।",
            "verse 49:18": "আল্লাহ নভোমন্ডল ও ভূমন্ডলের অদৃশ্য বিষয় জানেন, তোমরা যা কর আল্লাহ তা দেখেন।"
        },
        "Berber Amazigh": {
            "verse 49:1": "A wid iumnen! Ur zeggwiret zdat Öebbi akked Umazan iS. Ëezzbet i Öebbi. Öebbi, s tidep, Issel, d Amusnaw.",
            "verse 49:2": "A wid iumnen! Ur zzuhriyet tu$ac nnwen, sennig ta$wect n Nnbi. Ur zaââvet $uôes, akken tepzaââvam garawen, mulac ad mêun igiten nnwen, kunwi ur tfaqem.",
            "verse 49:3": "Ih, wid issrusun ûut n ta$wect nnsen, ar Umazan n Öebbi, d wid iwumi Issefsi Öebbi ulawen nnsen, ar uêezzeb. Ad asen ippunefk ssmaê akked warraz abarar.",
            "verse 49:4": "Ih, tegwti n wid ik n issawlen, deffir texxamin, ur pmeyyizen.",
            "verse 49:5": "Lemmer ûbiôen ard teff$ev $uôsen, ppif i nitni. Öebbi Ipsemmiê, Ipêunu.",
            "verse 49:6": "A wid iumnen! Aballa$ ma ibbwi yawen d asali, ppuêeqqeqet, mulac a pvuôôem agdud, war tamusni, a ppu$alem tnedmem deg wayen txedmem.",
            "verse 49:7": "Cfut illa garawen Umazan n Öebbi. Ma issemêes awen deg waîas n lumuô, a pjafem. Maca, Öebbi Issaâzez awen liman, Imelleê it deg ulawen nnwen, Isseôéeg awen tijehli, dd$el, lmaâûegga. Widak d wid ipwanhan.",
            "verse 49:8": "D lfevl s$uô Öebbi, d l$it. Öebbi Iéôa, d Bab n ûûwab.",
            "verse 49:9": "Ma nnu$ent snat n îayfat n lmumnin, êuddet pent. Ma tebw$ev yiwet degsent, $ef tayev, nna$et tin ibwe$ven alamma tevfeô lameô n Öebbi. Ma tevfeô it, ssemûalêet pent, s lmizan. Wezznet. Öebbi Iêemmel wid iwezznen.",
            "verse 49:10": "Lmumnin d atmaten kan i illan. Ssemûalêet atmaten nnwen, êezzbet i Öebbi, amar fellawen aêunu.",
            "verse 49:11": "A wid iumnen! £uôwat ad imaâlek ugdud $ef wayev, ahat d widen i ten yifen. Ne$ tilawin $ef tiyav, ahat d tiden i tent yifen. Ur pqeôôidet iman nnwen, ur pmirgamet s tselleqwbin. Dir it isem n dd$el, anda illa liman. Wid ur nutub ara, d widak ay d imednas.",
            "verse 49:12": "A wid iumnen! Janbet aîas n nnwaya. Ih, nnwaya, tikwal, d abekkav. Ur ppemâassat ara. Ur kkatet wa deg wa. Day ib$u yiwen, degwen, ad içç aksum n gmas lmegget? A t tagwim. Ëezzbet i Öebbi. Ih, Öebbi Issuruf, Ipêunu.",
            "verse 49:13": "A yimdanen! Ni$ Nxelq ikwen si ddker akked nnta. Nerra kwen d igduden, d laâôac, a ppemyussanem. Ihi, ukyis nnwen amxallef, ar Öebbi, d win degwen ipêezziben sennig wiyav. Ih, Öebbi Iéôa, Ippuxebbeô.",
            "verse 49:14": "Nnan uâôaben n ucluê: \"numen\". Ini: \"ur tuminem\". Maca init ed: \"nunez\"; ur ikcim ara liman ar wulawen nnwen. Ma tôuvam Öebbi akked Umazan iS, ur awen Isôuêu acemma seg igiten nnwen. Öebbi, s tidep, Ipsemmiê, Ipêunu.",
            "verse 49:15": "Lmumnin d wid kan iumnen s Öebbi akked Umazan iS, d$a, ur pcukun. Pna$en s wayla nnsen akked yiman nnsen, deg ubrid n Öebbi. D widak ay d imawlan n tidep.",
            "verse 49:16": "Ini: \"day ad aS temlem i Öebbi, ddin nnwen\"? Öebbi Iéôa i illan deg igenwan, i illan di tmurt. Öebbi Issen yal cci.",
            "verse 49:17": "Rran ak annuz nnsen, d tajmilt. Ini: \"ur iyi telli tejmilt deg annuz nnwen. Xaîi, d Öebbi ikwen I$aten mi kwen Inha ar liman, ma d imawlan n tidep ay tellam\".",
            "verse 49:18": "Ih, Öebbi Issen tabavnit n tmurt akked igenwan. Öebbi Ipwali ayen txeddmem."
        },
        "Bosnian": {
            "verse 49:1": "O vjernici, ne odlučujte se ni za što dok za to ne upitate Allaha i Poslanika Njegova, i bojte se Allaha! Allah, zaista, sve čuje i sve zna.",
            "verse 49:2": "O vjernici, ne dižite glasove svoje iznad Vjerovjesnikova glasa i ne razgovarajte s njim glasno, kao što glasno jedan s drugim razgovarate, da ne bi bila poništena vaša djela, a da vi i ne primijetite.",
            "verse 49:3": "One koji utišaju glasove svoje pred Allahovim Poslanikom – a to su oni čija je srca Allah prekalio u čestitosti – čeka oprost i nagrada velika.",
            "verse 49:4": "Većina onih koji te dozivaju ispred soba nije dovoljno pametna.",
            "verse 49:5": "A da su se oni strpjeli dok im ti sam iziđeš, bilo bi im bolje; a Allah prašta i samilostan je.",
            "verse 49:6": "O vjernici, ako vam nekakav nepošten čovjek donese kakvu vijest, dobro je provjerite, da u neznanju nekome zlo ne učinite, pa da se zbog onoga što ste učinili pokajete.",
            "verse 49:7": "I znajte da je među vama Allahov Poslanik; kad bi vas u mnogo čemu poslušao, doista biste nastradali; ali Allah je nekima od vas pravo vjerovanje omilio, i u srcima vašim ga lijepim prikazao, a nezahvalnost i raskalašenost i neposlušnost vam omrazio. Takvi su na Pravome putu",
            "verse 49:8": "dobrotom i blagodati Allahovom. – A Allah sve zna i mudar je.",
            "verse 49:9": "Ako se dvije skupine vjernika sukobe, izmirite ih; a ako jedna od njih ipak učini nasilje drugoj, onda se borite protiv one koja je učinila nasilje sve dok se Allahovim propisima ne prikloni. Pa ako se prikloni, onda ih nepristrasno izmirite i budite pravedni; Allah, zaista, pravedne voli.",
            "verse 49:10": "Vjernici su samo braća, zato pomirite vaša dva brata i bojte se Allaha, da bi vam se milost ukazala.",
            "verse 49:11": "O vjernici, neka se muškarci jedni drugima ne rugaju, možda su onī bolji od njih, a ni žene drugim ženama, možda su onē bolje od njih. I ne kudite jedni druge i ne zovite jedni druge ružnim nadimcima! O, kako je ružno da se vjernici spominju podrugljivim nadimcima! A oni koji se ne pokaju – sami sebi čine nepravdu.",
            "verse 49:12": "O vjernici, klonite se mnogih sumnjičenja, nekā sumnjičenja su, zaista, grijeh. I ne uhodite jedni druge i ne ogovarajte jedni druge! Zar bi nekome od vas bilo drago da jede meso umrloga brata svoga – a vama je to odvratno – zato se bojte Allaha; Allah, zaista, prima pokajanje i samilostan je.",
            "verse 49:13": "O ljudi, Mi vas od jednog čovjeka i jedne žene stvaramo i na narode i plemena vas dijelimo da biste se upoznali. Najugledniji kod Allaha je onaj koji Ga se najviše boji, Allah, uistinu, sve zna i nije Mu skriveno ništa.",
            "verse 49:14": "Neki beduini govore: \"Mi vjerujemo!\" Reci: \"Vi ne vjerujete, ali recite: 'Mi se pokoravamo!', jer u srca vaša prava vjera još nije ušla. A ako Allaha i Njegova Poslanika budete slušali, On vam nimalo neće umanjiti nagradu za djela vaša.\" – Allah, uistinu, prašta i samilostan je.",
            "verse 49:15": "Pravi vjernici su samo oni koji u Allaha i Poslanika Njegova vjeruju, i poslije više ne sumnjaju, i bore se na Allahovom putu imecima svojim i životima svojim. Oni su iskreni!",
            "verse 49:16": "Reci: \"Zar vi da obavještavate Allaha o vjerovanju svome, kad Allah zna sve što je na nebesima i na Zemlji! Allah sve zna.\"",
            "verse 49:17": "Oni ti prebacuju što su primili islam. Reci: \"Ne prebacujte mi što ste islam primili; naprotiv, Allah je vama milost podario time što vas je u pravu vjeru uputio, ako iskreno govorite.",
            "verse 49:18": "Allah, sigurno, zna tajne nebesa i Zemlje i Allah dobro vidi ono što radite.\""
        },
        "Bulgarian": {
            "verse 49:1": "О, вярващи, не предварвайте Аллах и Неговия Пратеник, и бойте се от Аллах. Аллах е всечуващ, всезнаещ.",
            "verse 49:2": "О, вярващи, не надигайте глас над гласа на Пророка и не му говорете високо, както говорите помежду си, за да не пропаднат делата ви, без да усетите!",
            "verse 49:3": "Онези, които снишават глас пред Пратеника на Аллах, те са онези, чиито сърца Аллах е изпитал за богобоязънта. За тях има опрощение и велика награда.",
            "verse 49:4": "Онези, които те призовават иззад стаите - повечето от тях не проумяват.",
            "verse 49:5": "А ако бяха изтърпели, докато им се покажеш, щеше да е най-доброто за тях. Аллах е опрощаващ, милосърден.",
            "verse 49:6": "О, вярващи, ако нечестивец ви донесе вест, проучете я, за да не засегнете някои хора от неведение, та за онова, което сте извършили, да съжалявате!",
            "verse 49:7": "И знайте, че сред вас е Пратеника на Аллах! Ако той се вслушваше във вас за много дела, щяхте да пострадате. Но Аллах вдъхна у вас любов към вярата и я разкраси в сърцата ви, и пробуди у вас омраза към неверието, нечестивостта и неподчинението. Тези са въ",
            "verse 49:8": "Това е щедрост и благодат от Аллах. Аллах е всезнаещ, премъдър.",
            "verse 49:9": "И ако две групи от вярващите се сбият, помирете ги! Но ако едната от тях престъпи спрямо другата, сражавайте се против онази, която е престъпила, докато се върне към повелята на Аллах! А щом се върне, помирете ги справедливо и постъпете безпристрастно! Ал",
            "verse 49:10": "Вярващите са братя, затова помирявайте своите братя и бойте се от Аллах, за да бъдете помилвани!",
            "verse 49:11": "О, вярващи, едни мъже от вас да не се присмиват на други! Може да са по-добри от тях. Нито жени - на жени... Може да са по-добри от тях. И не се хулете, и не се назовавайте с оскърбителни прякори! Колко лошо е името нечестивост подир вярата! А които не с",
            "verse 49:12": "О, вярващи, много странете от подозрението! Понякога подозрението е грях. И не се дебнете, и не злословете един за друг! Нима на някого от вас ще се хареса да яде плътта на мъртвия си брат? Вие се отвращавате от това. И бойте се от Аллах! Аллах е приемащ",
            "verse 49:13": "О, хора, Ние ви сътворихме от един мъж и една жена, и ви сторихме народи и племена, за да се опознавате. Най-достоен измежду вас при Аллах е най-богобоязливият. Аллах е всезнаещ, сведущ.",
            "verse 49:14": "Бедуините рекоха: “Ние повярвахме.” Кажи: “Не сте повярвали, ала кажете: “Отдадохме се на Аллах!”, защото вярата не е влязла още в сърцата ви. И ако се покорите на Аллах и на Неговия Пратеник, Той не ще отнеме нищо от делата ви. Аллах е опрощаващ, милосър",
            "verse 49:15": "Вярващи са именно онези, които вярват в Аллах и в Неговия Пратеник, после не се усъмняват и се борят чрез своите имоти и души по пътя на Аллах. Те са искрените.",
            "verse 49:16": "Кажи: “Нима Аллах известявате вие за вашата религия, след като Аллах знае всичко на небесата и всичко на земята. Аллах всяко нещо знае.”",
            "verse 49:17": "Смятат, че теб облагодетелстват, приемайки Исляма. Кажи [о, Мухаммад]: “Не мен облагодетелствате, приемайки Исляма, а Аллах ви облагодетелства, че ви напъти за вярата, ако сте искрени.”",
            "verse 49:18": "Аллах знае неведомото на небесата и на земята. Аллах съзира вашите дела."
        },
        "Chinese": {
            "verse 49:1": "信道的人们啊！你们在真主和使者的面前不要先做任何一件事，你们应当敬畏真主；真主确是全聪的，确是全知的。",
            "verse 49:2": "信道的人们啊！不要使你们的声音高过先知的声音，不要对他高声说话，犹如你们彼此间高声说话那样，以免你们的善功变为无效，而你们是不知不觉的。",
            "verse 49:3": "在使者的面前低声说话的人们，真主确已为敬畏而试验他们的心，他们将蒙赦宥和重大的报酬。",
            "verse 49:4": "在寝室后面喊叫你的人们，大半是不明理的。",
            "verse 49:5": "假若他们忍耐，直到你出去会他们，那对于他们是更好的。真主是至赦的，是至慈的。",
            "verse 49:6": "信道的人们啊！如果一个恶人报告你们一个消息，你们应当弄清楚，以免你们无知地伤害他人，到头来悔恨自己的行为。",
            "verse 49:7": "你们应当知道，真主的使者在你们之间，假若他对于许多事情都顺从你们，你们必陷于苦难。但真主使你们热爱正信，并在你们的心中修饰它；他使你们觉得迷信、罪恶、放荡是可恶的；这等人，确是循规蹈矩的。",
            "verse 49:8": "这是由于真主所降的恩惠和福泽。真主是全知的，是至睿。",
            "verse 49:9": "如果两伙信士相斗，你们应当居间调停。如果这伙压迫那伙，你们应当讨伐压迫的这伙，直到他们归顺真主的命令。如果他们归顺，你们应当秉公调停，主持公道；真主确是喜爱公道者的。",
            "verse 49:10": "信士们皆为教胞，故你们应当排解教胞间的纷争，你们应当敬畏真主，以便你们蒙主的怜恤。",
            "verse 49:11": "信道的人们啊！你们中的男子，不要互相嘲笑；被嘲笑者，或许胜于嘲笑者。你们中的女子，也不要互相嘲笑；被嘲笑者，或许胜于嘲笑者。你们不要互相诽谤，不要以诨名相称；信道后再以诨名相称，这称呼真恶劣！未悔罪者，是不义的。",
            "verse 49:12": "信道的人们啊！你们应当远离许多猜疑；有些猜疑，确是罪过。你们不要互相侦探，不要互相背毁，难道你们中有人喜欢吃他的已死的教胞的肉吗？你们是厌恶那种行为的。你们应当敬畏真主，真主确是至赦的，确是至慈的。",
            "verse 49:13": "众人啊！我确已从一男一女创造你们，我使你们成为许多民族和宗族，以便你们互相认识。在真主看来，你们中最尊贵者，是你们中最敬畏者。真主确是全知的，确是彻知的。",
            "verse 49:14": "游牧人们曾说：我们已信道了。你说：你们没有信道，虽然你们可以说：我们已归顺了'，但正信还没有入你们的心。如果你们服从真主和使者，他不减少你们的善功一丝毫。真主确是至赦的，确是至慈的。",
            "verse 49:15": "信士，只是确信真主和使者，然后没有怀疑，能以自己的财产和生命为主道而奋斗的人；这等人，确是诚实的。",
            "verse 49:16": "你说：难道你们以你们的宗教通知真主吗？真主是知道天地间的一切的，真主是全知万物的。",
            "verse 49:17": "他们以自己信奉伊斯兰，示惠于你，你说：你们不要以你们的信奉伊斯兰示惠于我；不然，真主以引导你们于正信示惠于你们，如果你们是说实话的。",
            "verse 49:18": "真主确是知道天地的幽玄的，真主是明察你们的行为的。"
        },
        "Danish": {
            "verse 49:1": "O, gij die gelooft, weest niet voorbarig bij Allah en Zijn boodschapper, maar vreest Allah. Voorwaar Hij is Alhorend, Alwetend",
            "verse 49:2": "O gij gelovigen, verheft uw stem niet boven de stem van de profeet en spreekt niet hardop tot hem, zoals gij hardop tot elkander spreekt, opdat uw werken niet vruchteloos mogen worden zonder dat gij het bemerkt",
            "verse 49:3": "Waarlijk, zij die hun stem verzachten in het bijzijn van de boodschapper van Allah, zijn degenen wier hart Allah tot rechtvaardigheid heeft gezuiverd. Voor hen is er vergiffenis en een grote beloning",
            "verse 49:4": "Zij, die van buiten de huizen uit naar u schreeuwen - de meesten hunner hebben geen verstand",
            "verse 49:5": "Als zij geduld tonen totdat gij tot hen komt, zou het beter voor hen zijn. Maar Allah is Vergevensgezind, Genadevol",
            "verse 49:6": "O gij gelovigen, indien een slecht persoon u nieuws brengt, onderzoekt het nauwkeurig opdat gij sommige mensen niet in onwetendheid schaadt en naderhand spijt krijgt van hetgeen gij hebt gedaan",
            "verse 49:7": "En weet, dat de boodsehapper van Allah onder u is; als hij in verschillende opzichten aan uw wensen gehoor zou geven zoudt gij zeker in moeilijkheden zijn geraakt, maar Allah heeft in uw hart het geloof dierbaar en schoon gemaakt, en ongeloof, buitensporigheid en ongehoorzaamheid afkeurenswaardig. Zo zijn zij, die het rechte pad volgen",
            "verse 49:8": "Door de genade en gunst van Allah. Allah is Alwetend, Alwijs",
            "verse 49:9": "Indien twee partijen van gelovigen beginnen te vechten treft dan een schikking onder hen, maar indien één hunner tegen de andere in overtreding is, bestrijdt dan de overtredende partij totdat zij tot de verordening van Allah terugkeert. En indien zij terugkomt, sluit dan een rechtvaardige vrede en behandelt hen billijk. Voorwaar, Allah heeft de rechtvaardigen lief",
            "verse 49:10": "De gelovigen zijn voorzeker broeders. Bewaart daarom vrede onder uw broeders en weest godvruchtig opdat u barmhartigheid moge worden betoond",
            "verse 49:11": "O, gij die gelooft! Laat een volk het andere volk dat waarschijnlijk beter is dan zij, niet bespotten, noch vrouwen andere vrouwen, die misschien beter zijn dan zij. En belastert elkander niet, noch noemt elkaar bij scheldnamen. Kwaad is (het geven van) een slechte naam na de aanvaarding van het geloof, en zij die geen berouw tonen zijn de onrechtvaardigen",
            "verse 49:12": "O, gij die gelooft! Vermijdt in het algemeen verdenking want achterdoeht is een zonde. En spionneert niet, noch belastert elkander. Lust iemand onder u het vlees van zijn dode broeder? Gij verafschuwt het zekerlijk. Vreest Allah voorzeker, Allah is Berouwaanvaardend, Genadevol",
            "verse 49:13": "O, mensdom! Wij hebben u uit man en vrouw geschapen en Wij hebben u tot volkeren en stammen gemaakt, opdat gij elkander moogt kennen. Voorzeker, de godvruchtigste onder u is de eerwaardigste bij Allah. Voorwaar, Allah is Alwetend, Alkennend",
            "verse 49:14": "De bewoners der woestijn zeggen: Wij geloven. Zeg: Gij gelooft nog niet, maar zegt liever: Wij hebben ons onderworpen want het geloof is uw hart nog niet binnengedrongen. Maar indien gij Allah en Zijn boodschapper gehoorzaamt, zal Hij u van uw goede daden niets afnemen.  Voorzeker, Allah is de Vergevensgezinde, de Genadevolle",
            "verse 49:15": "De ware gelovigen zijn slechts degenen, die in Allah en Zijn boodschapper geloven en daarna niet twijfelen, doch met hun bezittingen en persoon voor de zaak van Allah strijden. Zij zijn de waarachtigen",
            "verse 49:16": "Zeg: Wilt gij Allah uw geloof doen weten, terwijl Hij weet wat in de hemelen en op aarde is; waarlijk Allah heeft kennis van alle dingen",
            "verse 49:17": "Zij achten het een gunst voor u dat zij de Islam hebben omhelsd. Zeg: Acht het aannemen van de Islam geen gunst voor mij. Neen, Allah heeft u een gunst bewezen doordat Hij u tot het geloof heeft geleid als gij waarachtig zijt",
            "verse 49:18": "Voorwaar, Allah kent de geheimen der hemelen en der aarde. Waarlijk Allah ziet al hetgeen gij doet"
        },
        "Dutch": {
            "verse 49:1": "O jullie die geloven, plaatst julliezelf niet vóór Allah en Zijn Boodschapper, maar vreest Allah. Voorwaar, Allah is Alhorend, Alwetend.",
            "verse 49:2": "O jullie die geloven, verheft jullie stemmen niet boven de stem van de Profeet en spreekt niet luid tegen hem, zoals sommigen van jullie luid tegen elkaar spreken, anders zullen jullie daden vruchteloos worden, terwijl jullie het niet beseffen.",
            "verse 49:3": "Voorwaar, degenen die hun stemmen verzachten in de aanwezigheid van de Boodschapper van Allah: zij zijn degenen wier harten Allah heeft beproeft op Taqwa. Voor hen is er vergeving en een geweldige beloning.",
            "verse 49:4": "Voorwaar, degenen die naar jou (O Moehammad) roepen van buiten de kamers (van jou): de meesten van hen begrijpen (de onbeleefdheid) ervan niet.",
            "verse 49:5": "Als zij geduld hadden tot jij naar buiten kwam om hen te ontmoeten, dan zou dat beter voor hen zijn. En Allah is Vergevensgezind, Meest Barmhartig.",
            "verse 49:6": "O jullie die geloven, als een verdorvene met een bericht komt, onderzoekt het dan nauwkeurig, anders treffen jullie uit onwetendheid een volk met een ramp, waarna jullie spijt zouden krijgen van wat jullie deden.",
            "verse 49:7": "En weet dat onder jullie zich de Boodschapper van Allah bevindt. Als hij jullie (adviezen) zou volgen in vele aangelegenheden, dan zouden jullie zeker in moeilijkheden verkeren. Maar Allah heeft jullie doen houden van het geloof en Hij heeft het mooi gemaakt in jullie harten en Hij heeft jullie een afkeer doen hebben van ongeloof, zware zonden en opstandigheid. Zij zijn degenen die het rechte Pad volgen.",
            "verse 49:8": "Als een gunst van Allah en een genieting. En Allah is Alwetend, Alwijs.",
            "verse 49:9": "En als twee partijen van gelovigen met elkaar slaags raken, sticht dan vrede tussen hen. Als dan de ene partij de andere onrecht aandoet, bevecht dan degenen die onrecht plegen, tot zij terugkeren naar het bevel van Allah. Als zij dan terugkeren, sticht dan vrede tussen hen met rechtvaardigheid en weest onpartijdig. Voorwaar, Allah houdt van de onpartijdigen.",
            "verse 49:10": "Voorwaar, de gelovigen zijn elkaars broeders, sticht daarom vrede tussen jouw broeders. En vreest Allah. Hopelijk zullen jullie begenadigd worden.",
            "verse 49:11": "O jullie die geloven, laat een volk niet een ander volk beledigen, het kan zijn dat zij (die beledigd worden) beter zijn dan hen; en laat sommige vrouwen geen andere vrouwen beledigen, het kan zijn dat zij beter zijn dan hen. En hoont elkaar niet, en belastert elkaar niet met bijnamen. De slechtste naam is de verdorven (naam), na het geloof (ontvangen te hebben). En wie geen berouw toont: zij zijn de onrechtplegers.",
            "verse 49:12": "O jullie die geloven, vermijdt veel van de kwade vermoedens. Voorwaar, een deel van de kwade vermoedens zijn zonden. En bespioneert elkaar niet en spreekt geen kwaad over elkaar in elkaars afwezigheid. Zou iemand van jullie het vlees van zijn dode broeder willen eten? Jullie zouden het zeker haten. En vreest Allah. Voorwaar, Allah is Berouwaanvaardend, Meest Barmhartig.",
            "verse 49:13": "O mensheid, Wij hebben jullie geschapen uit een man en een vrouw en Wij hebben jullie tot volken en stammen gemaakt, opdat jullie elkaar leren kennen. Voorwaar, de meest edele van jullie is bij Allah degene die het meest (Allah) vreest. Voorwaar, Allah is van alles op de hoogte, Alwetend.",
            "verse 49:14": "De bedoeïenen zeggen: \"Wij geloven.\" Zeg (tegen hen O Moehammad): \"Jullie geloven (nog) niet,\" maar zeg (dat zij zeggen): \"Wij hebben ons overgegeven,\" want het geloof is jullie harten nog niet binnengegaan. Maar als jullie Allah en Zijn Boodschapper gehoorzamen, dan vermindert Hij niets (van de beloning) van jullie daden. Voorwaar, Allah is Vergevensgezind, Meest Barmhartig.",
            "verse 49:15": "Voorwaar, de gelovigen zijn slechts degenen die in Allah en Zijn Boodschapper geloven, die vervolgens niet twijfelen en die met hun bezittingen en hun levens strijden op de Weg van Allah. Zij zijn de waarachtigen.",
            "verse 49:16": "Zeg: \"Zouden jullie Allah willen vertellen over (de waarachtigheid) van jullie geloof? Terwijl Hij kent wat zich in de hemelen en op de aarde bevindt? En Allah is Alwetend over alle zaken.",
            "verse 49:17": "Zij menen jou een dienst te bewijzen door Moslim te worden. Zeg: \"Bewijst mij geen dienst door jullie (toetreden tot) de Islam. Juist Allah heeft jullie begenadigd, doordat Hij jullie naar het geloof heeft geleid, als jullie waarachtig zijn.\"",
            "verse 49:18": "Voorwaar, Allah kent het onwaarneembare van de hemelen en de aarde. En Allah is Alziend over wat jullie doen."
        },
        "English": {
            "verse 49:1": "O you who have believed, do not put [yourselves] before Allah and His Messenger but fear Allah. Indeed, Allah is Hearing and Knowing.",
            "verse 49:2": "O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not.",
            "verse 49:3": "Indeed, those who lower their voices before the Messenger of Allah - they are the ones whose hearts Allah has tested for righteousness. For them is forgiveness and great reward.",
            "verse 49:4": "Indeed, those who call you, [O Muhammad], from behind the chambers - most of them do not use reason.",
            "verse 49:5": "And if they had been patient until you [could] come out to them, it would have been better for them. But Allah is Forgiving and Merciful.",
            "verse 49:6": "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful.",
            "verse 49:7": "And know that among you is the Messenger of Allah. If he were to obey you in much of the matter, you would be in difficulty, but Allah has endeared to you the faith and has made it pleasing in your hearts and has made hateful to you disbelief, defiance and disobedience. Those are the [rightly] guided.",
            "verse 49:8": "[It is] as bounty from Allah and favor. And Allah is Knowing and Wise.",
            "verse 49:9": "And if two factions among the believers should fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allah. And if it returns, then make settlement between them in justice and act justly. Indeed, Allah loves those who act justly.",
            "verse 49:10": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.",
            "verse 49:11": "O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers.",
            "verse 49:12": "O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful.",
            "verse 49:13": "O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted.",
            "verse 49:14": "The bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allah and His Messenger, He will not deprive you from your deeds of anything. Indeed, Allah is Forgiving and Merciful.\"",
            "verse 49:15": "The believers are only the ones who have believed in Allah and His Messenger and then doubt not but strive with their properties and their lives in the cause of Allah. It is those who are the truthful.",
            "verse 49:16": "Say, \"Would you acquaint Allah with your religion while Allah knows whatever is in the heavens and whatever is on the earth, and Allah is Knowing of all things?\"",
            "verse 49:17": "They consider it a favor to you that they have accepted Islam. Say, \"Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith, if you should be truthful.\"",
            "verse 49:18": "Indeed, Allah knows the unseen [aspects] of the heavens and the earth. And Allah is Seeing of what you do."
        },
        "Filipino": {
            "verse 49:1": "O kayong sumasampalataya! Huwag ninyong gawin ang inyong sarili na manguna sa harapan ni Allah at sa Kanyang Sugo, datapuwa’t pangambahan ninyo si Allah. Katotohanang si Allah ang Ganap na Nakakarinig at Ganap na Nakakabatid sa lahat ng bagay",
            "verse 49:2": "O kayong sumasampalataya! Huwag ninyong itaas ang inyong tinig nang higit sa tinig ng Propeta, at huwag din namang mangusap sa kanya ng malakas na katulad ng inyong pag-uusap sa isa’t isa, baka ang inyong mga gawain ay mawalan ng saysay habang ito ay hindi ninyo napag-aakala",
            "verse 49:3": "Katotohanan, ang mga nagbababa ng kanilang tinig sa harapan ng Tagapagbalita ni Allah, sila yaong ang mga puso ay nasubok na ni Allah sa kataimtiman at kabanalan. Sasakanila ang Kapatawaran at saganang Gantimpala",
            "verse 49:4": "Katotohanan, sila na tumatawag sa iyo (O Muhammad) sa likod ng mga nagigitnang silid, ang karamihan sa kanila ay kapos sa pang-unawa",
            "verse 49:5": "Kung mayroon lamang silang pagtitiyaga na maghintay hanggang sa sila ay iyong pakiharapan, ito ay higit na mainam sa kanila. At si Allah ay Malimit na Pagpapatawad, ang Pinakamaawain",
            "verse 49:6": "O kayong sumasampalataya! Kung ang isang mapaghimagsik at makasalanang tao ay dumatal sa inyo na may hatid na anumang balita, inyong tiyakin ang katotohanan, baka kayo ay makapinsala sa inyong kapwa nang hindi ninyo sinasadya, at sa bandang huli ay matigib kayo sa pagsisisi sa inyong nagawa",
            "verse 49:7": "At inyong maalaman na sa lipon ninyo ay naroroon ang Tagapagbalita ni Allah. Kung kayo ay kanyang susundin sa maraming mga bagay- bagay (alalaong baga, sa inyong mga kuru-kuro at hangarin), katiyakang kayo ay malalagay sa kaguluhan. Datapuwa’t si Allah ang nagtanim ng pananalig sa inyo, at ginawa Niya ito na maganda sa inyong puso, at ginawa Niya na inyong kamuhian ang kawalan ng pananalig, ang kabuktutan at paghihimagsik at hindi pagsunod (kay Allah at sa Kanyang Tagapagbalita). Sila sa katotohanan ang mga tumatahak sa kabutihan",
            "verse 49:8": "Isang biyaya at gantimpala mula kay Allah, at si Allah ay Tigib ng Kaalaman at Puspos ng Karunungan",
            "verse 49:9": "At kung ang dalawang pangkat sa lipon ng mga sumasampalataya ay humantong sa isang tunggalian, kung gayon, payapain ninyo sila sa isa’t isa, datapuwa’t kung ang isa sa kanila ay lumampas sa hangganan ng pagmamalabis laban sa isa, kung gayon, inyong labanan ang nagmamalabis hanggang sa sila ay makasunod sa ipinag-uutos ni Allah. Subali’t kung sila ay sumunod, kung gayon, kayo ay makipag-unawaan sa kanila ng may katarungan at maging pantay sa katarungan, sapagkat katotohanang si Allah ay nagmamahal sa kanila na makatarungan",
            "verse 49:10": "Katotohanan, ang mga sumasampalataya ay wala ng iba maliban na isang pagkakapatiran (sa Pananampalatayang Islam), kaya’t makipagpayapaan at makipag-unawaan sa pagitan ng inyong nagtutunggaliang mga kapatid, at pangambahan ninyo si Allah upang kayo ay magkamit ng Habag",
            "verse 49:11": "O kayong sumasampalataya! Huwag hayaan ang isang pangkat sa inyong kalalakihan ay mangutya sa ibang pangkat. Maaaring ang huli ay higit na mainam kaysa sa una at huwag din namang hayaan na ang ilan sa inyong kababaihan ay mangutya sa ibang kababaihan, maaaring ang huli ay higit na mainam kaysa sa una. Gayundin naman, huwag ninyong siraan ang bawat isa, at gayundin, huwag ninyong tawagin ang bawat isa sa nakakasakit na mga palayaw. Tunay namang masama na inyong hiyain ang isang kapatid matapos na siya ay magkaroon ng Pananampalataya (alalaong baga, ang tawagin ang inyong Muslim na kapatid na naging isang matapat na mananampalataya ng: “o makasalanan, o o buktot”, atbp.). At kung sinuman ang hindi magsisi, katotohanang sila ang Zalimun (mga gumagawa ng kamalian, buktot, buhong, atbp)",
            "verse 49:12": "o kayong sumasampalataya! Inyong iwasan ang maraming pagdududa, katiyakang ang ilang pagdududa (sa ilang katatayuan) ay mga kasalanan. At huwag kayong manubok, gayundin huwag kayong magpamalas ng panlalait sa bawat isa sa talikuran. Mayroon bang isa sa inyo ang ibig na kumain ng laman ng patay niyang kapatid? Tunay ngang kasusuklaman ninyo ito (kaya’t kamuhian ninyo ang panlalait sa talikuran), datapuwa’t inyong pangambahan si Allah, katotohanang si Allah ang Tanging Isa na tumatanggap ng pagsisisi, ang Pinakamaawain",
            "verse 49:13": "o sangkatauhan! Aming nilikha kayo mula sa isang pares ng lalaki at babae, at Aming ginawa kayo sa maraming bansa [pamayanan] at mga tribo upang mangakilala ninyo ang isa’t isa (hindi upang kasuklaman ninyo ang isa’t isa). Katotohanan, ang pinakamarangal sa inyo sa paningin ni Allah ay (yaong sumasampalataya) na may At-Taqwa (siya na pinakamatuwid sa kabutihan, isa sa Muttaqun, alalaong baga, mga matimtiman at mabuting tao na labis na nangangamba kay Allah at umiiwas sa lahat ng mga kasalanan at masasamang gawa na Kanyang ipinagbawal at nagmamahal kay Allah ng higit at nagsasagawa ng lahat ng uri ng kabutihan na Kanyang ipinag-utos). Katotohanang si Allah ay Tigib ng Kaalaman at Lubos na Nakakabatid ng lahat ng bagay",
            "verse 49:14": "Ang mga Bedouin (mga Arabong nananahan sa disyerto) ay nagsasabi: “Kami ay sumasampalataya.” Ipagbadya: “Kayo ay hindi sumasampalataya, bagkus ay nagsasabi lamang” ng: “Kami ay nagsuko ng aming kalooban kay Allah (sa Islam)”, sapagkat hindi pa pumasok ang pananampalataya sa inyong puso. Datapuwa’t kung inyong susundin si Allah at ang Kanyang Tagapagbalita, hindi Niya mamaliitin ang inyong mga gawa at babawasan ang inyong gantimpala. Katotohanang si Allah ay Malimit na Nagpapatawad, ang Pinakamaawain",
            "verse 49:15": "Ang mga sumasampalataya ay sila lamang na nananalig kay Allah at sa Kanyang Tagapagbalita, at hindi nagkaroon ng anumang pag-aalinlangan sa pasimula pa, bagkus ay nagsikhay na kasama ang kanilang mga ari-arian at kanilang buhay tungo sa Kapakanan ni Allah. Sila nga! Sila ang matatapat",
            "verse 49:16": "Ipagbadya: “Ano? Ipaaalam ba ninyo kay Allah ang tungkol sa inyong relihiyon?” Samantalang si Allah ang nakakabatid ng lahat ng nasa kalangitan at kalupaan. Si Allah ang may Ganap na Kaalaman sa lahat ng bagay",
            "verse 49:17": "Sila ay nagtuturing na isang kagandahang loob (mula sa kanila) tungo sa iyo (o Muhammad) na sila ay yumakap sa Islam. Iyong ipagbadya: “Huwag ninyong ituring ang inyong Islam bilang isang kagandahang loob (ninyo) sa akin.” Hindi, datapuwa’t si Allah ang nagkaloob ng kagandahang loob sa inyo, at Kanyang ginabayan kayo sa Pananalig upang kayo ay maging matuwid at matapat",
            "verse 49:18": "Katotohanang si Allah ang nakakabatid ng mga nalilingid sa kalangitan at kalupaan, at si Allah ang Ganap na Nakakamasid ng lahat ninyong ginagawa"
        },
        "French": {
            "verse 49:1": "O vous qui avez cru! Ne devancez pas Allah et Son messager. Et craignez Allah. Allah est Audient et Omniscient.",
            "verse 49:2": "O vous qui avez cru! N'élevez pas vos voix au-dessus de la voix du Prophète, et ne haussez pas le ton en lui parlant, comme vous le haussez les uns avec les autres, sinon vos œuvres deviendraient vaines sans que vous vous en rendiez compte.",
            "verse 49:3": "Ceux qui auprès du Messager d'Allah baissent leurs voix sont ceux dont Allah a éprouvé les cœurs pour la piété. Ils auront un pardon et une énorme récompense.",
            "verse 49:4": "Ceux qui t'appellent à haute voix de derrière les appartements, la plupart d'entre eux ne raisonnent pas.",
            "verse 49:5": "Et s'ils patientaient jusqu'à ce que tu sortes à eux ce serait certes mieux pour eux. Allah cependant, est Pardonneur et Miséricordieux.",
            "verse 49:6": "O vous qui avez cru! Si un pervers vous apporte une nouvelle, voyez bien clair [de crainte] que par inadvertance vous ne portiez atteinte à des gens et que vous ne regrettiez par la suite ce que vous avez fait.",
            "verse 49:7": "Et sachez que le Messager d'Allah est parmi vous. S'il vous obéissait dans maintes affaires, vous seriez en difficultés. Mais Allah vous a fait aimer la foi et l'a embellie dans vos cœurs et vous a fait détester la mécréance, la perversité et la désobéissance. Ceux-là sont les bien dirigés,",
            "verse 49:8": "c'est là en effet une grâce d'Allah et un bienfait. Allah est Omniscient et Sage.",
            "verse 49:9": "Et si deux groupes de croyants se combattent, faites la conciliation entre eux. Si l'un d'eux se rebelle contre l'autre, combattez le groupe qui se rebelle, jusqu'à ce qu'il se conforme à l'ordre d'Allah. Puis, s'il s'y conforme, réconciliez-les avec justice et soyez équitables car Allah aime les équitables.",
            "verse 49:10": "Les croyants ne sont que des frères. Etablissez la concorde entre vos frères, et craignez Allah, afin qu'on vous fasse miséricorde.",
            "verse 49:11": "O vous qui avez cru! Qu'un groupe ne se raille pas d'un autre groupe: ceux-ci sont peut-être meilleurs qu'eux. Et que des femmes ne se raillent pas d'autres femmes: celles-ci sont peut-être meilleures qu'elles. Ne vous dénigrez pas et ne vous lancez pas mutuellement des sobriquets (injurieux). Quel vilain mot que «perversion» lorsqu'on a déjà la foi. Et quiconque ne se repent pas... Ceux-là sont les injustes.",
            "verse 49:12": "O vous qui avez cru! Evitez de trop conjecturer [sur autrui] car une partie des conjectures est péché. Et n'espionnez pas; et ne médisez pas les uns des autres. L'un de vous aimerait-il manger la chair de son frère mort? (Non!) vous en aurez horreur. Et craignez Allah. Car Allah est Grand Accueillant au repentir, Très Miséricordieux.",
            "verse 49:13": "O hommes! Nous vous avons créés d'un mâle et d'une femelle, et Nous avons fait de vous des nations et des tribus, pour que vous vous entre-connaissiez. Le plus noble d'entre vous, auprès d'Allah, est le plus pieux. Allah est certes Omniscient et Grand Connaisseur.",
            "verse 49:14": "Les Bédouins ont dit: «Nous avons la foi». Dis: «Vous n'avez pas encore la foi. Dites plutôt: Nous nous sommes simplement soumis, car la foi n'a pas encore pénétré dans vos cœurs. Et si vous obéissez à Allah et à Son messager, Il ne vous fera rien perdre de vos œuvres». Allah est Pardonneur et Miséricordieux.",
            "verse 49:15": "Les vrais croyants sont seulement ceux qui croient en Allah et en Son messager, qui par la suite ne doutent point et qui luttent avec leurs biens et leurs personnes dans le chemin d'Allah. Ceux-là sont les véridiques.",
            "verse 49:16": "Dis: «Est-ce vous qui apprendrez à Allah votre religion, alors qu'Allah sait tout ce qui est dans les cieux et sur la terre?» Et Allah est Omniscient.",
            "verse 49:17": "Ils te rappellent leur conversion à l'Islam comme si c'était une faveur de leur part. Dis: «Ne me rappelez pas votre conversion à l'Islam comme une faveur. C'est tout au contraire une faveur dont Allah vous a comblés en vous dirigeant vers la foi, si toutefois vous êtes véridiques».",
            "verse 49:18": "Allah connaît l'Inconnaissable des cieux et de la terre et Allah est Clairvoyant sur ce que vous faites."
        },
        "Fulah": {
            "verse 49:1": "Ko onon yo ɓen gomɗimɓe ! wata on adito yeeso Allah e Nulaaɗo Makko on. Hulee Allah. Pellet, Allah ko Nanoowo, Yi’oowo",
            "verse 49:2": "Ko onon yo ɓen gomɗimɓe ! wata on towu sowtooji mon e hoore sowto Annabaajo on, wata on ewnor mo kadi konngol, wano no yoga mon ewnorta yoga, sakko golle mon ɗen bonata, hara on so’aa-anndude",
            "verse 49:3": "Pellet, ɓen joltinooɓe sowtooji maɓɓe ɗin ka Nulaaɗo Allah on, ko ɓen woni ɓe Alla jarabii ɓerɗe mun ɗen gomɗal. Hino woodani ɓe haforanal e njoɓdi mawndi",
            "verse 49:4": "Pellet, ɓen ɓe no noddire ka ɓaawo cuuɗi, ko ɓuri ɗuuɗude e maɓɓe, wanaa haqqilooɓe",
            "verse 49:5": "Sinno ɓe muññino haa yaltaa e maɓɓe, ko ɗum ɓuraynoo moƴƴannde ɓe. Allah ko Haforoowo, Hinnotooɗo",
            "verse 49:6": "Ko onon yo ɓen gomɗimɓe ! Si faasiqiijo ardanii on e kumpital, tefee fii wata on heɓor e yimɓe sabu majjeede, wonton ninsuɓe e kon ko waɗuɗon",
            "verse 49:7": "Anndee wonnde Nulaaɗo Allah on hino hakkunde mon. Si o tewtino on e ko ɗuuɗi e fiyakuuji, on tampayno. Kono Allah yiɗini on gomɗinal, O cuɗini ngal e ɓerɗe mon; O añini on keeferaaku, e faasiqaaku e geddi. Ko ɓen woni feewuɓe ɓen",
            "verse 49:8": "ɗum ko ɓural immorde ka Allah e neema. Allah ko Annduɗo, Ñeeñuɗo",
            "verse 49:9": "Si feddeeji ɗiɗi e gomɗimɓe ɓen haɓii, moƴƴintinee hakkunde maɓɓe. Si fedde goo bewii e hoore ndeya, ko haɓugol wonnde e bewude nden, haa nde ruttoo e yamiroore Allah nden. Si nde ruttike, moƴƴintiniree hakkunde maɓɓe nunɗal. Nunɗee, tawde pellet, Allah no yiɗi nunɗooɓe ɓen",
            "verse 49:10": "Anndee gomɗimɓe ɓen ko jeyduɓe. Haray moƴƴinee hakkunde jeydal mon ngal, hulon Allah, belajo’o on yurminte",
            "verse 49:11": "Ko onon yo ɓen gomɗimɓe ! Wata yimɓe jalnor yimɓe : hino gasa hara ɓen (jalaaɓe) hino ɓuri ɓe moƴƴude. Wanaa rewɓe woni ko jalnorta rewɓe : hino gasa hara ɓen no ɓuri ɓe moƴƴude. Wata on aybidnir ko`e-mon, wata on bugondir jammooje (bonɗe). Innde faasiqaaku nden bonii ɓaawo nde gomɗinal nden. Kala mo tuubaali, ko ɓen woni tooñuɓe ɓen",
            "verse 49:12": "Ko onon yo ɓen gomɗimɓe ! Woɗɗitee e ko ɗuuɗi e sikke. Pellet, yoga e sikke ko bakkaatu. Wata on wiɗondir, wata yoga mon ño’u yoga. Hara gooto e mo’on yiɗay ñaamugol teewu musiɗɗo mun maayɗo? Hiɗon añi ɗum. Hulee Allah. Pellet, Allah ko Jaɓoowo tuubuubuyee, Hinnotooɗo",
            "verse 49:13": "Ko onon yo yimɓe ! Men tagiriii on immorde e gorel e deyel, Men waɗiri on leƴƴi e gori, fii yo on anndindir. Pellet, ɓurɓe teddude e mon ɓen ka Allah, ko ɓurɓe gomɗude ɓen e mon. Pellet, Allah ko Annduɗo, Humpitiiɗo",
            "verse 49:14": "Yimɓe ladde ɓen wi`i: \"Men gomɗinii\". Maaku: \"On gomɗinaali taho. Wi’ee kan : Men silmii. Gomɗinal ngal naataali taho ka ɓerɗe mon. Si on ɗoftike Allah e Nulaaɗo Makko on, O ɗuytantaa on huunde e golle mon ɗen\". Pellet, Allah ko Haforoowo, Hinnotooɗo",
            "verse 49:15": "Gomɗimɓe (tigi) ɓen, ko ɓen gomɗimɓe Allah e Nulaaɗo Makko on, refti ɓe sikkitaaki, ɓe tiiɗnori kadi jawle e pittaali maɓɓe ɗin fii laawol Allah ngol. Ko ɓen woni goonguɓe ɓen",
            "verse 49:16": "Maaku: \"Kere on anndinay Allah diina mon kan, hara non Allah no anndi kala ko woni kammuuli e ka leydi?\" Allah ko Annduɗo kala huunde",
            "verse 49:17": "Hiɓe waj Ma fii ɓe silmii. Maaku: \"Wata on wajitam silmugol mon. Si ko woni, ko Allah wajitata on fii O fewnirii on e gomɗinal, si wonii ko on goonguɓe",
            "verse 49:18": "Pellet, Allah no anndi wirniiɗi kammuuli ɗin e leydi ndin. Allah ko Reenuɗo ko golloton kon"
        },
        "German": {
            "verse 49:1": "O die ihr glaubt, kommt nicht Allah und Seinem Gesandten zuvor und fürchtet Allah. Gewiß, Allah ist Allhörend und Allwissend.",
            "verse 49:2": "O die ihr glaubt, erhebt nicht eure Stimmen über die Stimme des Propheten, und sprecht nicht so laut zu ihm, wie ihr laut zueinander sprecht, auf daß (nicht) eure Werke hinfällig werden, ohne daß ihr merkt.",
            "verse 49:3": "Gewiß, diejenigen, die ihre Stimmen bei Allahs Gesandtem mäßigen, das sind diejenigen, deren Herzen Allah auf die Gottesfurcht geprüft hat. Für sie wird es Vergebung und großartigen Lohn geben.",
            "verse 49:4": "Gewiß, diejenigen, die dich hinter den (Wänden der) Gemächer rufen, die meisten von ihnen haben keinen Verstand.",
            "verse 49:5": "Wenn sie sich gedulden würden, bis du zu ihnen herauskommst, wäre es wahrlich besser für sie. Und Allah ist Allvergebend und Barmherzig.",
            "verse 49:6": "O die ihr glaubt, wenn ein Frevler zu euch mit einer Kunde kommt, dann schafft Klarheit, damit ihr (nicht einige) Leute in Unwissenheit (mit einer Anschuldigung) trefft und dann über das, was ihr getan habt, Reue empfinden werdet.",
            "verse 49:7": "Und wißt, daß Allahs Gesandter unter euch ist. Wenn er euch in vielen Angelegenheiten gehorchte, würdet ihr wahrlich in Bedrängnis kommen. Aber Allah hat euch den Glauben lieb gemacht und in euren Herzen ausgeschmückt, und Er hat euch den Unglauben, den Frevel und den Ungehorsam verabscheuen lassen. Das sind diejenigen, die besonnen handeln.",
            "verse 49:8": "Dies als Huld und Gunst von Allah. Und Allah ist Allwissend und Allweise.",
            "verse 49:9": "Und wenn zwei Gruppen von den Gläubigen miteinander kämpfen, so stiftet Frieden zwischen ihnen. Wenn die eine von ihnen gegen die andere widerrechtlich vorgeht, dann kämpft gegen diejenige, die widerrechtlich vorgeht, bis sie zu Allahs Befehl zurückkehrt. Wenn sie zurückkehrt, dann stiftet Frieden zwischen ihnen nach Gerechtigkeit und handelt dabei gerecht. Allah liebt ja die Gerechten.",
            "verse 49:10": "Die Gläubigen sind doch Brüder. So stiftet Frieden zwischen euren beiden Brüdern und fürchtet Allah, auf daß ihr Erbarmen finden möget.",
            "verse 49:11": "O die ihr glaubt, die einen sollen nicht über die anderen spotten, vielleicht sind eben diese besser als sie. Auch sollen nicht Frauen über andere Frauen (spotten), vielleicht sind eben diese besser als sie. Und beleidigt euch nicht gegenseitig durch Gesten und bewerft euch nicht gegenseitig mit (häßlichen) Beinamen. Wie schlimm ist die Bezeichnung \"Frevel\" nach (der Bezeichnung) \"Glaube\"! Und wer nicht bereut, das sind die Ungerechten.",
            "verse 49:12": "O die ihr glaubt, meidet viel von den Mutmaßungen; gewiß, manche Mutmaßung ist Sünde. Und sucht nicht (andere) auszukundschaften und führt nicht üble Nachrede übereinander. Möchte denn einer von euch gern das Fleisch seines Bruders, wenn er tot sei, essen? Es wäre euch doch zuwider. Fürchtet Allah. Gewiß, Allah ist Reue-Annehmend und Barmherzig.",
            "verse 49:13": "O ihr Menschen, Wir haben euch ja von einem männlichen und einem weiblichen Wesen erschaffen, und Wir haben euch zu Völkern und Stämmen gemacht, damit ihr einander kennenlernt. Gewiß, der Geehrteste von euch bei Allah ist der Gottesfürchtigste von euch. Gewiß, Allah ist Allwissend und Allkundig.",
            "verse 49:14": "Die Wüstenaraber sagen: \"Wir glauben.\" Sag: Ihr glaubt nicht (wirklich), sondern sagt: ,Wir sind Muslime geworden', denn der Glaube ist noch nicht in eure Herzen eingezogen. Wenn ihr aber Allah und Seinem Gesandten gehorcht, verringert Er euch nichts von euren Werken. Gewiß, Allah ist Allvergebend und Barmherzig.",
            "verse 49:15": "Die (wahren) Gläubigen sind ja diejenigen, die an Allah und Seinen Gesandten glauben und hierauf nicht zweifeln und sich mit ihrem Besitz und mit ihrer eigenen Person auf Allahs Weg abmühen. Das sind die Wahrhaftigen.",
            "verse 49:16": "Sag: Wollt ihr Allah über eure Religion belehren, wo Allah weiß, was in den Himmeln und was auf der Erde ist? Und Allah weiß über alles Bescheid.",
            "verse 49:17": "Sie halten es dir als Wohltat vor, daß sie Muslime geworden sind. Sag: Haltet mir nicht eure (Annahme des) Islams als Wohltat vor. Nein! Vielmehr hält Allah euch die Wohltat vor, daß Er euch zum Glauben geleitet hat, wenn ihr wahrhaftig seid.",
            "verse 49:18": "Gewiß, Allah kennt das Verborgene der Himmel und der Erde. Und Allah sieht wohl, was ihr tut."
        },
        "Hausa": {
            "verse 49:1": "Yã ku waɗanda suka yi ĩmãni! Kada ku gabãta (da kõme) gaba ga Allah da ManzonSa. Kuma ku yi ɗã'ã ga Allah da taƙawa. Lalle Allah Mai ji ne, Masani.",
            "verse 49:2": "Yã kũ waɗanda suka yi ĩmani! Kada ku ɗaukaka saututtukanku bisa sautin Annabi, kuma kada ku bayyana sauti gare shi a magana, kamar bayyanãwar sãshenku ga sãshe, dõmin kada ayyukanku su ɓãci, alhãli kuwa kũ ba ku sani ba.",
            "verse 49:3": "Lalle waɗanda ke runtsẽwar saututtukansu a wurin Manzon Allah waɗannan ne waɗanda Allah Yã, jarrabi zukãtansu ga taƙawa. Sunã da wata irin gãfara da ijãra mai girma.",
            "verse 49:4": "Lalle waɗanda ke kiranka daga bãyan ɗakuna, mafi Yawansu bã su aiki da hankali.",
            "verse 49:5": "Kuma dã lalle sũ, sun yi haƙuri har ka fita zuwa gare su, haƙĩƙa, dã yã kasance mafi alhẽri gare su, kuma Allah Mai gãfara ne, Mai jin ƙai.",
            "verse 49:6": "Yã kũ waɗanda suka yi ĩmãni! Idan fãsiƙi Yã zo muku da wani babban lãbãri, to, ku nẽmi bayãni, dõmin kada ku cũci waɗansu mutãne a cikin jãhilci, sabõda haka ku wãyi gari a kan abin da kuka aikata kunã mãsu nadãma.",
            "verse 49:7": "Kuma ku sani (cẽwa) lalle ne, a cikinku akwai Manzon Allah. Dã Yana bin ku ga (hãlãye) mãsu Yawa na al'amarin, dã kun auku a cikin zunubi, kuma amma Allah Yã sõyar da ĩmãni a gare ku, kuma Yã ƙawãta shi a cikin zukãtanku kuma Yã ƙyãmantar da kãfirci da fãsicci da sãɓo zuwa gare ku. Waɗannan (da suka lazimci sifõfin nan) su ne shiryayyu.",
            "verse 49:8": "Bisa ga falala daga Allah da ni'ima. Kuma Allah Masani ne, Mai hikima.",
            "verse 49:9": "Kuma idan jama'a biyu ta mũminai suka yi yãki, to, kuyi sulhu, a tsakãninsu. Sai idan ɗayansu ta yi zãlunci a kan gudar, to, sai ku yãƙi wadda ke yin zãlunci har ta kõma, zuwa ga umurnin Allah. To, idan ta kõma, sai ku yi sulhu a tsakãninsu da ãdalci kuma ku daidaita. Lalle Allah na son mãsu daidaitãwa.",
            "verse 49:10": "Mũminai 'yan'uwan jũna kawai ne, sabõda haka ku yi sulhu a tsakãnin 'yan'uwanku biyu, kuma ku bi Allah da taƙawa tsammãninku, a yi muku rahama.",
            "verse 49:11": "\"Yã ku waɗanda suka yi ĩmãni! Kada waɗansu mutãne su yi izgili game da waɗansu mutãne, mai yiwuwa ne (abin yi wa izgilin) su kasance mafifita daga gare su (mãsu izgilin), kuma waɗansu mãtã kada su yi izgili game da waɗansu mãtã mai yiwuwa ne su kasancc mafĩfĩta daga gare su. Kuma kada ku aibanta kanku, kuma kada ku jẽfi jũna da miyãgun sunãye na laƙabõbĩ. Tir da sũna na fãsicci a bãyãn ĩmãni. Kuma wanda bai tũba ba, to, waɗannan sũ ne azzãlumai.\"",
            "verse 49:12": "Yã kũ waɗanda suka yi ĩmãni! Ku nĩsanci abu mai yãwa na zato. Lalle sãshen zato laifi ne. Kuma kada ku yi rahõto, kuma kada sãshenku yã yi gulmar sãshe. Shin, ɗayanku nã son yã ci naman ɗan'uwansa yanã matacce? To, kun ƙĩ shi (cin nãman). Kuma ku bi Allah da taƙawa. Lalle Allah Mai karɓar tũba ne, Mai jin ƙai.",
            "verse 49:13": "Yã kũ mutãne! Lalle ne Mũ, Mun halitta ku daga namiji da mace, kuma Muka sanya ku dangõgi da kabĩlõli, dõmin ku san jũna. Lalle mafĩfĩcinku daraja a wurin Allah, (shĩ ne) wanda yake mafĩfĩcinku a taƙawa. Lalle nẽ Allah Masani ne, Mai ƙididdigẽwa.",
            "verse 49:14": "¡auyãwa suka ce: \"Mun yi ĩmãni.\" Ka ce: \"Ba ku yi ĩmãni ba, amma dai ku ce, 'Mun mĩƙawuya, ĩmani bai gama shiga a cikinzukãtanku ba. Kuma idan kun yi ɗã'a ga Allah da ManzonSa, to, bã zai rage muku kõme daga ayyukanku ba. Lalle Allah Mai gãfara ne, Mai jin ƙai.\"",
            "verse 49:15": "Mũminan gaskiya kawai, sũ ne waɗanda suka yi ĩmãni da Allah da ManzonSa, sa'an nan ba su yi shakka ba, kuma suka yi jihãdi da dũkiyarsu da kuma rãyukansu, cikin tafarkin Allah. Waɗannan sũ ne mãsu gaskiya.",
            "verse 49:16": "Ka ce: \"Kuna sanar da Allah ne game da addininku, alhãli kuwa Allah Yã san abin da ke cikin sammai da abin da ke cikin ƙasa, kuma Allah Masani ne ga dukan kõme?\"",
            "verse 49:17": "Suna yin gõri a kanka wai sun musulunta. Ka ce: \"Kada ku yi gõrin kun musulunta a kaina. Ã'a, Allah ne ke yi muku gõri dõmin Ya shiryar da ku ga ĩmãni, idan kun kasance mãsu gaskiya.\"",
            "verse 49:18": "\"Lalle Allah yanã sanin gaibin sammai da ¡asa, kuma Allah Mai gani ne ga abin da kuke aikatãwa.\""
        },
        "Hindi": {
            "verse 49:1": "ऐ ईमानदारों ख़ुदा और उसके रसूल के सामने किसी बात में आगे न बढ़ जाया करो और ख़ुदा से डरते रहो बेशक ख़ुदा बड़ा सुनने वाला वाक़िफ़कार है",
            "verse 49:2": "ऐ ईमानदारों (बोलने में) अपनी आवाज़े पैग़म्बर की आवाज़ से ऊँची न किया करो और जिस तरह तुम आपस में एक दूसरे से ज़ोर (ज़ोर) से बोला करते हो उनके रूबरू ज़ोर से न बोला करो (ऐसा न हो कि) तुम्हारा किया कराया सब अकारत हो जाए और तुमको ख़बर भी न हो",
            "verse 49:3": "बेशक जो लोग रसूले ख़ुदा के सामने अपनी आवाज़ें धीमी कर लिया करते हैं यही लोग हैं जिनके दिलों को ख़ुदा ने परहेज़गारी के लिए जाँच लिया है उनके लिए (आख़ेरत में) बख़्शिस और बड़ा अज्र है",
            "verse 49:4": "(ऐ रसूल) जो लोग तुमको हुजरों के बाहर से आवाज़ देते हैं उनमें के अक्सर बे अक्ल हैं",
            "verse 49:5": "और अगर ये लोग इतना ताम्मुल करते कि तुम ख़ुद निकल कर उनके पास आ जाते (तब बात करते) तो ये उनके लिए बेहतर था और ख़ुदा तो बड़ा बख्शने वाला मेहरबान है",
            "verse 49:6": "ऐ ईमानदारों अगर कोई बदकिरदार तुम्हारे पास कोई ख़बर लेकर आए तो ख़ूब तहक़ीक़ कर लिया करो (ऐसा न हो) कि तुम किसी क़ौम को नादानी से नुक़सान पहुँचाओ फिर अपने किए पर नादिम हो",
            "verse 49:7": "और जान रखो कि तुम में ख़ुदा के पैग़म्बर (मौजूद) हैं बहुत सी बातें ऐसी हैं कि अगर रसूल उनमें तुम्हारा कहा मान लिया करें तो (उलटे) तुम ही मुश्किल में पड़ जाओ लेकिन ख़ुदा ने तुम्हें ईमान की मोहब्बत दे दी है और उसको तुम्हारे दिलों में उमदा कर दिखाया है और कुफ़्र और बदकारी और नाफ़रमानी से तुमको बेज़ार कर दिया है यही लोग ख़ुदा के फ़ज़ल व एहसान से राहे हिदायत पर हैं",
            "verse 49:8": "और ख़ुदा तो बड़ा वाक़िफ़कार और हिकमत वाला है",
            "verse 49:9": "और अगर मोमिनीन में से दो फिरक़े आपस में लड़ पड़े तो उन दोनों में सुलह करा दो फिर अगर उनमें से एक (फ़रीक़) दूसरे पर ज्यादती करे तो जो (फिरक़ा) ज्यादती करे तुम (भी) उससे लड़ो यहाँ तक वह ख़ुदा के हुक्म की तरफ रूझू करे फिर जब रूजू करे तो फरीकैन में मसावात के साथ सुलह करा दो और इन्साफ़ से काम लो बेशक ख़ुदा इन्साफ़ करने वालों को दोस्त रखता है",
            "verse 49:10": "मोमिनीन तो आपस में बस भाई भाई हैं तो अपने दो भाईयों में मेल जोल करा दिया करो और ख़ुदा से डरते रहो ताकि तुम पर रहम किया जाए",
            "verse 49:11": "ऐ ईमानदारों (तुम किसी क़ौम का) कोई मर्द ( दूसरी क़ौम के मर्दों की हँसी न उड़ाये मुमकिन है कि वह लोग (ख़ुदा के नज़दीक) उनसे अच्छे हों और न औरते औरतों से (तमसख़ुर करें) क्या अजब है कि वह उनसे अच्छी हों और तुम आपस में एक दूसरे को मिलने न दो न एक दूसरे का बुरा नाम धरो ईमान लाने के बाद बदकारी (का) नाम ही बुरा है और जो लोग बाज़ न आएँ तो ऐसे ही लोग ज़ालिम हैं",
            "verse 49:12": "ऐ ईमानदारों बहुत से गुमान (बद) से बचे रहो क्यों कि बाज़ बदगुमानी गुनाह हैं और आपस में एक दूसरे के हाल की टोह में न रहा करो और न तुममें से एक दूसरे की ग़ीबत करे क्या तुममें से कोई इस बात को पसन्द करेगा कि अपने मरे हुए भाई का गोश्त खाए तो तुम उससे (ज़रूर) नफरत करोगे और ख़ुदा से डरो, बेशक ख़ुदा बड़ा तौबा क़ुबूल करने वाला मेहरबान है",
            "verse 49:13": "लोगों हमने तो तुम सबको एक मर्द और एक औरत से पैदा किया और हम ही ने तुम्हारे कबीले और बिरादरियाँ बनायीं ताकि एक दूसरे की शिनाख्त करे इसमें शक़ नहीं कि ख़ुदा के नज़दीक तुम सबमें बड़ा इज्ज़तदार वही है जो बड़ा परहेज़गार हो बेशक ख़ुदा बड़ा वाक़िफ़कार ख़बरदार है",
            "verse 49:14": "अरब के देहाती कहते हैं कि हम ईमान लाए (ऐ रसूल) तुम कह दो कि तुम ईमान नहीं लाए बल्कि (यूँ) कह दो कि इस्लाम लाए हालॉकि ईमान का अभी तक तुम्हारे दिल में गुज़र हुआ ही नहीं और अगर तुम ख़ुदा की और उसके रसूल की फरमाबरदारी करोगे तो ख़ुदा तुम्हारे आमाल में से कुछ कम नहीं करेगा - बेशक ख़ुदा बड़ा बख्शने वाला मेहरबान है",
            "verse 49:15": "(सच्चे मोमिन) तो बस वही हैं जो ख़ुदा और उसके रसूल पर ईमान लाए फिर उन्होंने उसमें किसी तरह का शक़ शुबह न किया और अपने माल से और अपनी जानों से ख़ुदा की राह में जेहाद किया यही लोग (दावाए ईमान में) सच्चे हैं",
            "verse 49:16": "(ऐ रसूल इनसे) पूछो तो कि क्या तुम ख़ुदा को अपनी दीदारी जताते हो और ख़ुदा तो जो कुछ आसमानों मे है और जो कुछ ज़मीन में है (ग़रज़ सब कुछ) जानता है और ख़ुदा हर चीज़ से ख़बरदार है",
            "verse 49:17": "(ऐ रसूल) तुम पर ये लोग (इसलाम लाने का) एहसान जताते हैं तुम (साफ़) कह दो कि तुम अपने इसलाम का मुझ पर एहसान न जताओ (बल्कि) अगर तुम (दावाए ईमान में) सच्चे हो तो समझो कि, ख़ुदा ने तुम पर एहसान किया कि उसने तुमको ईमान का रास्ता दिखाया",
            "verse 49:18": "बेशक ख़ुदा तो सारे आसमानों और ज़मीन की छिपी हुई बातों को जानता है और जो तुम करते हो ख़ुदा उसे देख रहा है"
        },
        "Indonesian": {
            "verse 49:1": "Hai orang-orang yang beriman, janganlah kamu mendahului Allah dan Rasulnya dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui.",
            "verse 49:2": "Hai orang-orang yang beriman, janganlah kamu meninggikan suaramu melebihi suara Nabi, dan janganlah kamu berkata kepadanya dengan suara yang keras, sebagaimana kerasnya suara sebagian kamu terhadap sebagian yang lain, supaya tidak hapus (pahala) amalanmu, sedangkan kamu tidak menyadari.",
            "verse 49:3": "Sesungguhnya orang yang merendahkan suaranya di sisi Rasulullah mereka itulah orang-orang yang telah diuji hati mereka oleh Allah untuk bertakwa. Bagi mereka ampunan dan pahala yang besar.",
            "verse 49:4": "Sesungguhnya orang-orang yang memanggil kamu dari luar kamar(mu) kebanyakan mereka tidak mengerti.",
            "verse 49:5": "Dan kalau sekiranya mereka bersabar sampai kamu keluar menemui mereka sesungguhnya itu lebih baik bagi mereka, dan Allah Maha Pengampun lagi Maha Penyayang.",
            "verse 49:6": "Hai orang-orang yang beriman, jika datang kepadamu orang fasik membawa suatu berita, maka periksalah dengan teliti agar kamu tidak menimpakan suatu musibah kepada suatu kaum tanpa mengetahui keadaannya yang menyebabkan kamu menyesal atas perbuatanmu itu.",
            "verse 49:7": "Dan ketahuilah olehmu bahwa di kalanganmu ada Rasulullah. Kalau ia menuruti kemauanmu dalam beberapa urusan benar-benarlah kamu mendapat kesusahan, tetapi Allah menjadikan kamu \"cinta\" kepada keimanan dan menjadikan keimanan itu indah di dalam hatimu serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan. Mereka itulah orang-orang yang mengikuti jalan yang lurus,",
            "verse 49:8": "sebagai karunia dan nikmat dari Allah. Dan Allah Maha Mengetahui lagi Maha Bijaksana.",
            "verse 49:9": "Dan kalau ada dua golongan dari mereka yang beriman itu berperang hendaklah kamu damaikan antara keduanya! Tapi kalau yang satu melanggar perjanjian terhadap yang lain, hendaklah yang melanggar perjanjian itu kamu perangi sampai surut kembali pada perintah Allah. Kalau dia telah surut, damaikanlah antara keduanya menurut keadilan, dan hendaklah kamu berlaku adil; sesungguhnya Allah mencintai orang-orang yang berlaku adil.",
            "verse 49:10": "Orang-orang beriman itu sesungguhnya bersaudara. Sebab itu damaikanlah (perbaikilah hubungan) antara kedua saudaramu itu dan takutlah terhadap Allah, supaya kamu mendapat rahmat.",
            "verse 49:11": "Hai orang-orang yang beriman, janganlah sekumpulan orang laki-laki merendahkan kumpulan yang lain, boleh jadi yang ditertawakan itu lebih baik dari mereka. Dan jangan pula sekumpulan perempuan merendahkan kumpulan lainnya, boleh jadi yang direndahkan itu lebih baik. Dan janganlah suka mencela dirimu sendiri dan jangan memanggil dengan gelaran yang mengandung ejekan. Seburuk-buruk panggilan adalah (panggilan) yang buruk sesudah iman dan barangsiapa yang tidak bertobat, maka mereka itulah orang-orang yang zalim.",
            "verse 49:12": "Hai orang-orang yang beriman, jauhilah kebanyakan purba-sangka (kecurigaan), karena sebagian dari purba-sangka itu dosa. Dan janganlah mencari-cari keburukan orang dan janganlah menggunjingkan satu sama lain. Adakah seorang diantara kamu yang suka memakan daging saudaranya yang sudah mati? Maka tentulah kamu merasa jijik kepadanya. Dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Penerima Taubat lagi Maha Penyayang.",
            "verse 49:13": "Hai manusia, sesungguhnya Kami menciptakan kamu dari seorang laki-laki dan seorang perempuan dan menjadikan kamu berbangsa-bangsa dan bersuku-suku supaya kamu saling kenal-mengenal. Sesungguhnya orang yang paling mulia diantara kamu disisi Allah ialah orang yang paling takwa diantara kamu. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.",
            "verse 49:14": "Orang-orang Arab Badui itu berkata: \"Kami telah beriman\". Katakanlah: \"Kamu belum beriman, tapi katakanlah 'kami telah tunduk', karena iman itu belum masuk ke dalam hatimu; dan jika kamu taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikitpun pahala amalanmu; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang\".",
            "verse 49:15": "Sesungguhnya orang-orang yang beriman itu hanyalah orang-orang yang percaya (beriman) kepada Allah dan Rasul-Nya, kemudian mereka tidak ragu-ragu dan mereka berjuang (berjihad) dengan harta dan jiwa mereka pada jalan Allah. Mereka itulah orang-orang yang benar.",
            "verse 49:16": "Katakanlah: \"Apakah kamu akan memberitahukan kepada Allah tentang agamamu, padahal Allah mengetahui apa yang di langit dan apa yang di bumi dan Allah Maha Mengetahui segala sesuatu?\"",
            "verse 49:17": "Mereka merasa telah memberi nikmat kepadamu dengan keislaman mereka. Katakanlah: \"Janganlah kamu merasa telah memberi nikmat kepadaku dengan keislamanmu, sebenarnya Allah, Dialah yang melimpahkan nikmat kepadamu dengan menunjuki kamu kepada keimanan jika kamu adalah orang-orang yang benar\".",
            "verse 49:18": "Sesungguhnya Allah mengetahui apa yang ghaib di langit dan bumi. Dan Allah Maha Melihat apa yang kamu kerjakan."
        },
        "Italian": {
            "verse 49:1": "O credenti, non anticipate Allah e il Suo Messaggero e temete Allah! Allah è audiente, sapiente.",
            "verse 49:2": "O credenti, non alzate la vostra voce al di sopra di quella del Profeta, e non alzate con lui la voce come l'alzate quando parlate tra voi, ché rischiereste di rendere vane le opere vostre a vostra insaputa.",
            "verse 49:3": "Coloro che abbassano la voce davanti all'Inviato di Allah, sono quelli cui Allah ha disposto il cuore al timore [di Lui]. Avranno il perdono e ricompensa immensa.",
            "verse 49:4": "Quanto a coloro che ti chiamano dall'esterno delle tue stanze intime... la maggior parte di loro non comprendono nulla.",
            "verse 49:5": "Se avessero atteso con pazienza finché tu non esca loro incontro, sarebbe stato meglio per loro.",
            "verse 49:6": "O credenti, se un malvagio vi reca una notizia, verificatela, affinché non portiate, per disinformazione, pregiudizio a qualcuno e abbiate poi a pentirvi di quel che avrete fatto.",
            "verse 49:7": "E sappiate che il Messaggero di Allah è tra voi. Se in molte questioni accondiscendesse ai vostri [desideri], voi sareste in gravi difficoltà; ma Allah vi ha fatto amare la fede e l'ha resa bella ai vostri cuori, così come vi ha fatto detestare la miscredenza, la malvagità e la disobbedienza. Essi sono i ben diretti;",
            "verse 49:8": "[questa] è la grazia di Allah e il Suo favore. Allah è sapiente, saggio.",
            "verse 49:9": "Se due gruppi di credenti combattono tra loro, riconciliateli. Se poi [ancora] uno di loro commettesse degli eccessi, combattete quello che eccede, finché non si pieghi all'Ordine di Allah. Quando si sarà piegato, ristabilite, con giustizia, la concordia tra di loro e siate equi, poiché Allah ama coloro che giudicano con equità.",
            "verse 49:10": "In verità i credenti sono fratelli: ristabilite la concordia tra i vostri fratelli e temete Allah. Forse vi sarà usata misericordia.",
            "verse 49:11": "O credenti, non scherniscano alcuni di voi gli altri, ché forse questi sono migliori di loro. E le donne non scherniscano altre donne, ché forse queste sono migliori di loro. Non diffamatevi a vicenda e non datevi nomignoli. Com'è infame l'accusa di iniquità rivolta a chi è credente ! Coloro che non si pentono sono gli iniqui.",
            "verse 49:12": "O credenti, evitate di far troppe illazioni, ché una parte dell'illazione è peccato. Non vi spiate e non sparlate gli uni degli altri. Qualcuno di voi mangerebbe la carne del suo fratello morto? Ne avreste anzi orrore! Temete Allah! Allah sempre accetta il pentimento, è misericordioso.",
            "verse 49:13": "O uomini, vi abbiamo creato da un maschio e una femmina e abbiamo fatto di voi popoli e tribù, affinché vi conosceste a vicenda. Presso Allah, il più nobile di voi è colui che più Lo teme. In verità Allah è sapiente, ben informato.",
            "verse 49:14": "I Beduini hanno detto: “Crediamo”. Di': “Voi non credete. Dite piuttosto ci sottomettiamo\", poiché la fede non è ancora penetrata nei vostri cuori. Se obbedirete ad Allah e al Suo Inviato, Egli non trascurerà nessuna delle vostre [buone] azioni. In verità Allah è perdonatore, misericordioso”.",
            "verse 49:15": "I veri credenti sono coloro che credono in Allah e nel Suo Inviato senza mai dubitarne e che lottano con i loro beni e le loro persone per la causa di Allah: essi sono i sinceri.",
            "verse 49:16": "Di': “Sareste forse voi ad istruire Allah sulla vostra religione, mentre Allah conosce ciò che è nei cieli e sulla terra?”. Allah conosce tutte le cose.",
            "verse 49:17": "Vantano questa sottomissione, come fosse un favore da parte loro. Di': “Non rinfacciatemi il vostro Islàm come se fosse un favore. È piuttosto Allah Che vi ricorda il Suo favore di avervi guidati verso la fede, [che otterrete] se siete sinceri.",
            "verse 49:18": "Allah conosce l'invisibile dei cieli e della terra e Allah ben osserva quel che fate”."
        },
        "Japanese": {
            "verse 49:1": "信仰する者よ，あなたがたはアッラーとその使徒を差し置いて勝手な振舞いをしてはならない。アッラーを畏れなさい。本当にアッラーは全聴にして全知であられる。",
            "verse 49:2": "信仰する者よ，あなたがたの声を預言者の声よりも高く上げてはならない。またあなたがたが互いに声高に話す時のように，かれに大声で（話して）はならない。あなたがたの気付かない中に，自分の行いを虚しくしないために。",
            "verse 49:3": "本当にアッラーの使徒の前でその声を低くする者は，アッラーがその心の敬虔さを試みられた者である。かれらには，赦しと偉大な報奨があろう。",
            "verse 49:4": "本当に部屋の外から大声であなたを呼ぶ者の多くは，思慮分別のない者である。",
            "verse 49:5": "もしかれらが，あなたの出て来るのを待つならば，それはかれらのためにも良い。本当にアッラーは寛容にして慈悲深くあられる。",
            "verse 49:6": "信仰する者よ，もし邪な者が情報をあなたがたに(湾?)したならば，慎重に検討しなさい。これはあなたがたが，気付かない中に人びとに危害を及ぼし，その行ったことを後悔することにならないためである。",
            "verse 49:7": "あなたがたの間にアッラーの使徒がいることを知れ。かれがもし多くの事柄に就いてあなたがたに従ったならば，あなたがたはきっと不幸に陥ったことであろう。だがアッラーは，あなたがたに信仰を好ましいものとなされ，またあなたがたの心を，それに相応しくして，あなたがたに不信心と邪悪と反逆を嫌うようになされた。これは正しく導かれた者である。",
            "verse 49:8": "それもアッラーからの御恵みであり，恩恵である。アッラーは全知にして英明であられる。",
            "verse 49:9": "もしも信者が2つに分れて争えば，両者の間を調停しなさい。もしかれらの一方が他方に対して，（一方的に）無法なことをするならば，無法者がアッラーの命令に立ち返るまで戦いなさい。だがかれらが立ちかえったならば，正義と公平を旨としてかれらの間を調停しなさい。本当にアッラーは公正な者を愛される。",
            "verse 49:10": "信者たちは兄弟である。だからあなたがたは兄弟の間の融和を図り，アッラーを畏れなさい。必ずあなたがたは慈悲にあずかるのである。",
            "verse 49:11": "信仰する者よ，或る者たちに外の者たちを嘲笑させてはならない。それら（嘲笑された方）がかれらよりも優れているかも知れない。女たちにも外の女たちを（嘲笑させては）ならない。その女たちがかの女たちよりも，優れているかも知れない。そして互いに中傷してはならない。また綽名で，罵り合ってはならない。信仰に入った後は，悪を暗示するような呼名はよくない。それでも止めない者は不義の徒である。",
            "verse 49:12": "信仰する者よ，邪推の多くを祓え。本当に邪推は，時には罪である。無用の詮索をしたりまた互いに陰日してはならない。死んだ兄弟の肉を，食べるのを誰が好もうか。あなたがたはそれを忌み嫌うではないか。アッラーを畏れなさい。本当にアッラーは度々赦される方，慈悲深い方であられる。",
            "verse 49:13": "人びとよ，われは一人の男と一人の女からあなたがたを創り，種族と部族に分けた。これはあなたがたを，互いに知り合うようにさせるためである。アッラーの御許で最も貴い者は，あなたがたの中最も主を畏れる者である。本当にアッラーは，全知にして凡ゆることに通暁なされる。",
            "verse 49:14": "砂漠のアラブたちは，「わたしたちは信仰します。」と言う。言ってやるがいい。「あなたがたは信じてはいない。ただ『わたしたちは入信しました』と言っているだけで，信仰はまだあなたがたの心の中に入ってはいない。もしあなたがたが，アッラーとその使徒に従うなら，かれはその行いに就いて，少しも（報奨を）軽減されることはない。本当にアッラーは寛容にして慈悲深くあられる。",
            "verse 49:15": "本当に信者とは，一途にアッラーとその使徒を信じる者たちで，疑いを持つことなく，アッラーの道のために，財産と生命とを捧げて奮闘努力する者である。これらの者こそ真の信者である。」",
            "verse 49:16": "言ってやるがいい。「あなたがたは自分の宗教を，アッラーに教えようとでも（思うのか）。アッラーは天地にある凡てのものを知っておられる。本当にアッラーは凡てのことを熟知しておられる。」",
            "verse 49:17": "かれらは，自分がイスラームに帰依して，あなたに対する恩を施したように思っている。言ってやるがいい。「あなたがたの帰依は，わたしヘの恵みとはならない。もしあなたがたが真実（帰依した）なら，アッラーは，あなたがたを信仰に導くことを，あなたがたへの恵みとなされるのである。」",
            "verse 49:18": "本当にアッラーは，天と地の奥義を知っておられる。アッラーは，あなたがたの所行をよく洞察なされる方である。"
        },
        "Jawa": {
            "verse 49:1": "Para mukmin kabeh, sira aja lancang pangucap lan panggawe tanpa oleh idzining Allah lan Rasule. Sira padha bektia ing Allah Allah, satemene Allah iku miyarsa tur nguningani samu barang",
            "verse 49:2": "Para mukmin kabeh, sira aja padha nyerokake suwara ngungkuli suwarane nabi (Muhammad). Lan manawa matur aja padha seru - seru nganti kaua serune anggonira caturan karo kancamu. Mangkono iku nguatiri bok menawa sirna lakunira kang becik tur kowe ora krasa",
            "verse 49:3": "Sarupane wong kang nglirihake suarane ana ngarsane Rasul atine dicoba dening ALlah supaya atine bekti. Wong mangkono mau oleh pangapurane dosane lan bakal tompo ganjaran gedhe",
            "verse 49:4": "Satemene wong kang wani - wani ngundang marang sira saka jaban kamar, iku kang akeh wong ora genep akale",
            "verse 49:5": "Upamane wong mau sareh (sabar) ngenteni anggomu metu nemoni wong mau, luwih becik. Hewa dene Allah iku kersa ngapura tur Maha Asih",
            "verse 49:6": "Para mukmin kabeh, manawa sira katekan wong hala, nyaritakake apa - apa iku sira titi priksa kang terang temen lan gorohake. Marga iku nguwatiri, bok menawa kowe banjur kebacut ngukum wong kang satmene ora luput banjur dadekake gela marang tumindakmu",
            "verse 49:7": "Sira padha weruha ing kene ana utusane Allah, menawa sira manut miturut marang Rasul ing prakara akeh mesthi ora duraka. Nanging Allah remen yen sira percaya ing Allah. Allah becikake kepercayaan mau ana ing atinira. Lan ora remen yen sira kafir lan hala tandangmu lan duraka (wong kang bekti) mau aran wong kang pinter lan begja",
            "verse 49:8": "Hiya iku asih kanugrahane Allah lan peparinge kabungahan Allah iku nguningani samu barang tur wicaksana",
            "verse 49:9": "Manawa ana wong mukmin rong golongan padha perang padha rukunna, menawa kang siji saka salah sijine rong golongan mau tumindak nganiaya marang golongan liyane iku sira perangi, nganti manut ing pirukun ngestokake parentahing Allah. Manawa wis manut banjur sira rukunna kelawan adil, satemene Allah remen wong kang padha adil",
            "verse 49:10": "Satemene pra mukmin padha dadi sedulur. Mulane padha ngrukunna sedulurmu loro kang padha pasulayan lan bektia Allah supaya oleh asihe",
            "verse 49:11": "Para mukmin kabeh, aja padha geguyu (ngina) antarane wong lanang padha wong lanang. Awit kena uga kang digeguyu luwih becik tinimbang kang geguyu. Wong wadon aja uga geguyu marang padha wong wadon awit kang digeguyu kena uga luwih becik. Lan aja padha nacat marang wong liya, awit wong kang dicacat mau banjur males nacat, lan aja padha juluki hala marang wong. Wong iku sawise pracaya Allah cacat banget yen nganti dirangkepi jeneng ala. Sing sapa ora gelem tobat (anggone nrajang larangane) tete[ wong nganiaya awake dhewe]",
            "verse 49:12": "Para mukmin kabeh, padha ngedhohona panyana elek marang wong, awit sawenehing panyana iku ana kang dadi dosa. Lan aja sok nyebarake wadining wong lan aja ngrasani hala marang padha kancanira. Apa hiya sira iku dhemen mangan daginge sedulure kang wis mati? Bareng kelako mesthi ora doyan. Lan padha bektia ing Allah. Satemene Allah iku narima tobate manungsa tur Maha Asih",
            "verse 49:13": "Para manungsa kabeh, Ingsun wis gawe sira wijine saka wong lanang lan wadon, lan Ingsun dadekake pirang - pirang bangsa lan golongan supaya padha tepung (kenal) siji lan sijine. Dene mungguhe Allah sira iku kang aji dhewe, hendi kang banget bektine ing Allah. Satemene Allah iku nguningani samu barang tur wicaksana",
            "verse 49:14": "Wong padesan Arab padha ngucap, \"Aku wis percaya (Mukmin)\". Sira dawuha, \"Kowe durung iman\", nanging ngucapa, \"Aku iki wong Islam\". Iman durung mlebu ing atimu. Dene yen kowe manut miturut ing Allh lan Rasul ora bakal suda sethithik - thithika ganjarane lakumu kang becik. Satemene Allah kpareng ngapura dosa tur Maha Asih",
            "verse 49:15": "Kang tetep aran wong mukmin iku sarupane wong kang padha percaya ing Allah lan Rasule. Atine ora pisan - pisan mamang lan ketara anggone tenanan anggone ngistokake dhawuh ngetohake nyawane lan bandhane kanggo ragad nindakake dhawuh Allah (sabilillah) hiya iku wong kang temen imane",
            "verse 49:16": "(Muhammad) Dhawuha, \"Apa kowe ngaturake agamamu kang kok sungkemi ing Allah. ALlah ikunginingani samu barang isining bumi lan langit. Lan marang sakabehane barang Allah nguningani",
            "verse 49:17": "Wong (ing pedesan) mau padha ngaturake dheweke iku padha potang kabecikan anggone Islam marang sira (Muhammad) sira dhawuha, \"Kowe aja padha rumasa pitang kabecikan kalawan anggonmu Islam, nanging Allah, iku paring pitulung marang kowe padha diparingi pituduh kapercayan (Iman) manawa sira temen",
            "verse 49:18": "Satemene Allah iku nguningani kang samar - samar ana ing bumi lan langit. Allah iku mirsani kabeh barang kang padha kok lakoni"
        },
        "Kazakh": {
            "verse 49:1": "Ей, иманға келгендер! Аллаһтың және Оның елшісінің алдын орамаңдар. Аллаһтан Оның жазасынан қорқып, сақтаныңдар. Ақиқатында Аллаһ бәрін Естуші, бәрін Білуші",
            "verse 49:2": "Ей, иманға келгендер! Дауыстарыңды Пайғамбардың дауысынан жоғарыкөтермеңдер және оған бір-біріңе дауыстарыңды көтеріп сөйлейтіндей дауыстап сөйлемеңдер, әйтпесе амалдарың өздерің сезбеген күйде зая болып кетеді",
            "verse 49:3": "Аллаһ елшісінің алдында дауыстарын бәсеңдететіндер міне, солар, Аллаһ жүректерін тақуалық үшін Раббысының жаза­сынан қорқып, сақтануларына сынаққа алғандар. Оларға кешірім әрі ұлы сый бар",
            "verse 49:4": "Ей, Мұхаммед! Ақиқатында, сені бөлмелердің сыртынан айқайлап шақыратындардың көбі ақылдарын істетпейді",
            "verse 49:5": "Ал, егер олар сен шыққанға дейін сабыр етсе, бұл өздері үшін қайырлы болар еді. Аллаһ өте Кешірімді , ерекше Мейірімді",
            "verse 49:6": "Ей, иманға келгендер! Егер сендерге бір бұзық бойсұнбаушы қандай да бір хабар әкелсе, білместікпен адамдарды айыптап тиісіп , істегендеріңе өкініп қалмауларың үшін анықтап алыңдар",
            "verse 49:7": "Әрі біліңдер, сендердің араларыңда Аллаһтың Елшісі бар. Егер де ол сендерге көп істе бағынатын болса, өздерің қиналып қалатын едіңдер. Бірақ, Аллаһ сендерге иман­ды сүйікті етті және оны жүректеріңде көркем етті, әрі сендерге күпірлікті имансыздықты , бұзықтықты үлкен және кіші күнәларды және бойсұнбауды жек көрсетті. Міне, бұлар тура жолмен жүрушілер",
            "verse 49:8": "Аллаһтың кеңшілігі және игілігі арқасында. Аллаһ бәрін Білуші , аса Дана",
            "verse 49:9": "Егер имандылардан екі топ бір-бірімен соғысса, олардың арасын жарастырыңдар. Егер де біреуі екіншісіне қарсы шектен шықса, онда шектен шыққанымен, олардың Аллаһтың әміріне қайтқанына дейін соғысыңдар. Ал егер қайтса, олардың арасын әділдікпен түзетіңдер және бір жағына тартпаңдар. Ақиқатында, Аллаһ әділдік етушілерді жақсы көреді",
            "verse 49:10": "Ақиқатында, имандылар бауырлар аға-інілер . Сондықтан екі бауырдың арасын түзетіңдер. Әрі өздеріңе мейірім етілуі үшін Аллаһтан Оның тыйымдарынан қорқып, сақтаныңдар",
            "verse 49:11": "Ей, иманға келгендер! Бір топ бір адамдар басқа бір топты адамдарды келемеж етпесін, адамдар бір-бірінің үстінен күлмесін ,бәлкім олар бұлардан қайырлы шығар. Сондай-ақ әйелдер де басқа бір әйелдерді келемеж етпесін , бәлкім олар да бұлардан қайырлы шығар. Әрі өздеріңді-өздерің кемсітпеңдер және жаман лақап аттармен бір-біріңнің намыстарыңа тимеңдер. Иманға келгеннен кейін бұзық ат тағу өте жаман! Ал кім істеген күнәсіне шынайы өкініп, Аллаһқа бойсұнуға қайтпаса тәубеге келмесе , міне, солар әділетсіздер",
            "verse 49:12": "Ей, иманға келгендер! Дәлелсіз жорамал ойлардың көбінен аулақ болыңдар, өйткені жалаң ойлардың күмәнның кейбірі күнә. Сондай-ақ бір-біріңді аңдымаңдар, әрі бірің өзгелеріңнің сыртынан ғайбаттамасын ол естіген кезде жақтырмайтын сөз айтпасын . Сендерден біреу өлген бауырының етін жеуді ұната ма? Әрине, сендер оны жек көресіңдер. Әрі Аллаһтан Оның жазасынан қорқып, сақтаныңдар! Ақиқатында, Аллаһ тәубені Қабыл етуші , ерекше Мейірімді",
            "verse 49:13": "Ей, адамдар! Негізінде, Біз сендерді бір ер және бір әйелден жараттық, әрі сендерді бір-бірлеріңді танып, білулерің үшін халықтар мен рулар етіп жасадық. Анығында, Аллаһтың алдындағы сендердің ең құрметтілерің тақуаларың Оған бойсұнып, жазасынан қорқып, сақтанатындарың . Ақиқатында Аллаһ бәрін Білуші, бәрінен Хабардар",
            "verse 49:14": "Бәдәуилер: «Біз иманға келдік сендік »,- деді. Айт: «Сендер иманға келмедіңдер жетпедіңдер . Алайда: «Бойсұндық», деп айтыңдар. Ал иман сендердің жүректеріңе әлі кірмеді. Егер Аллаһқа және Оның елшісіне бойсұнсаңдар, Ол сендердің амалдарыңнан ешнәрсені кемітпейді. Ақиқатында Аллаһ өте Кешірімді , ерекше Мейірімді», деп",
            "verse 49:15": "Имандылар мүміндер олар Аллаһқа және Оның елшісіне сеніп, одан кейін күмәнданбағандар, әрі мал-дәулеттері және жандарымен Аллаһтың жолында күрескендер. Міне, осылар нағыз шын сөзділер",
            "verse 49:16": "Ей, Мұхаммед! Айт: «Аллаһ аспандар мен жердегі нәрселерді біліп тұрғанда, сендер Аллаһқа өздеріңнің діндерің жайлы білдірмекшісіңдер ме? Аллаһ барлық нәрсені Білуші», деп",
            "verse 49:17": "Ей, Мұхаммед! Олар бойсұнғандықтарын исламды қабылдағандарын саған міндетсінеді. Айт: «Бойсұнғандықтарыңды мұсылман болғандарыңды маған міндетсінбеңдер. Анығында, егер шын сөзді болсаңдар, сендерді Аллаһ иманға алып келумен өздеріңе игілік етуде», деп",
            "verse 49:18": "Ақиқатында, Аллаһ аспандардың және жердің құпиясын біледі. Аллаһ сендердің не істеп жатқандарыңды толық Көруші"
        },
        "Korean": {
            "verse 49:1": "믿는 사람들이여 하나님과 그 분의 선지자 앞에서 자신을 앞세 우지 말고 하나님을 두려워 하라 실로 하나님은 모든 것을 들으시 고 아시니라믿는 사람들이여 하나님과 그 분의 선지자 앞에서 자신을 앞세 우지 말고 하나님을 두려워 하라 실로 하나님은 모든 것을 들으시 고 아시니라",
            "verse 49:2": "믿는 사람들이여 예언자의 목 소리보다 너희의 목소리가 높아서 는 아니 되나니 그분과 대화할 때는 소리를 높여 서는 아니되매 너희가 알지 못하여 너희 행위가 헛 되지 아니 하도록 함이라믿는 사람들이여 예언자의 목 소리보다 너희의 목소리가 높아서 는 아니 되나니 그분과 대화할 때는 소리를 높여 서는 아니되매 너희가 알지 못하여 너희 행위가 헛 되지 아니 하도록 함이라",
            "verse 49:3": "하나님의 선지자 앞에서 목소 리를 낮추는 자들은 하나님께서 그들의 경건함을 시험한 자들이라 실로 그들에게는 관용과 큰 보상 이 있노라하나님의 선지자 앞에서 목소 리를 낮추는 자들은 하나님께서 그들의 경건함을 시험한 자들이라 실로 그들에게는 관용과 큰 보상 이 있노라",
            "verse 49:4": "안방 됫편에서 그대를 소리 쳐 부르는 자 그들 대다수는 알 지 못하는 자들이라안방 됫편에서 그대를 소리 쳐 부르는 자 그들 대다수는 알 지 못하는 자들이라",
            "verse 49:5": "그대가 나올 때까지 인내하며기다리는 것이 그들에게 더 좋은 것이리라 실로 하나님은 관용과 자비로 충만하시니라그대가 나올 때까지 인내하며기다리는 것이 그들에게 더 좋은 것이리라 실로 하나님은 관용과 자비로 충만하시니라",
            "verse 49:6": "믿는 사람들이여 사학한 자가너희에게 소식을 전할 때는 그 소식을 확인하라 이는 너희가 사실 을 알지 못하여 백성에게 해악을 끼치지 아니하고 너희가 후희하지않도록 함이라믿는 사람들이여 사학한 자가너희에게 소식을 전할 때는 그 소식을 확인하라 이는 너희가 사실 을 알지 못하여 백성에게 해악을 끼치지 아니하고 너희가 후희하지않도록 함이라",
            "verse 49:7": "그리고 너희 가운데 선지자가함께 하고 있음을 알라 그가 어떤많은 일들에 너희의 뜻을 따랐다 면 실로 너희는 곤경에 빠졌으리 라 그러나 하나님은 너희로 하여 금 믿음을 더 사랑케 하고 너희 심중을 더 아름답게 하사 너희로 하여금 불신과 죄악과 거역함을 증오하도록 하셨으니 실로 그것이옳은 길을 걷는 자들이라그리고 너희 가운데 선지자가함께 하고 있음을 알라 그가 어떤많은 일들에 너희의 뜻을 따랐다 면 실로 너희는 곤경에 빠졌으리 라 그러나 하나님은 너희로 하여 금 믿음을 더 사랑케 하고 너희 심중을 더 아름답게 하사 너희로 하여금 불신과 죄악과 거역함을 증오하도록 하셨으니 실로 그것이옳은 길을 걷는 자들이라",
            "verse 49:8": "실로 이것은 하나님의 은혜와은총이니 실로 하나님은 아심과 지혜로 충만하심이라실로 이것은 하나님의 은혜와은총이니 실로 하나님은 아심과 지혜로 충만하심이라",
            "verse 49:9": "믿음을 가진 신도들이 두 무 리로 분리되어 싸운다면 그들 사 이를 화해시키되 그들 증의 한 무리가 다른 무리에 대하여 죄악을 범한다면 너희 모두는 그들이 하 나님의 명령에 동의할 때까지 죄 악을 범한 무리와 싸우라 그러나 그들이 동의한다면 정의와 공평으로써 그들을 화해시키라 실로 하 나님은 의로운 자들만을 사랑하시니라믿음을 가진 신도들이 두 무 리로 분리되어 싸운다면 그들 사 이를 화해시키되 그들 증의 한 무리가 다른 무리에 대하여 죄악을 범한다면 너희 모두는 그들이 하 나님의 명령에 동의할 때까지 죄 악을 범한 무리와 싸우라 그러나 그들이 동의한다면 정의와 공평으로써 그들을 화해시키라 실로 하 나님은 의로운 자들만을 사랑하시니라",
            "verse 49:10": "믿는 자들은 한 xC제라 그러므로 싸우는 너희 두 형제들 사 이를 화해시키며 하나님을 두려워 하라 그리하면 너희가 은혜를 받 으리라믿는 자들은 한 xC2제라 그러므로 싸우는 너희 두 형제들 사 이를 화해시키며 하나님을 두려워 하라 그리하면 너희가 은혜를 받 으리라",
            "verse 49:11": "믿는 사람들이여 사람이 다 른 사람을 비웃지 않도록 하라 후 자가 전자보다 훌륭할 수도 있노 라 여성이 다른 여성을 비웃지 않 도록 하라 후자가 전자보다 훌륭 할 수도 있노라 서로가 서로에게 중상하는 것과 저속한 변명도 아 니 되니라 믿음을 가진 후의 저속 한 이름은 사악한 것이며 회개하 지 아니 한 자 실로 죄인이라믿는 사람들이여 사람이 다 른 사람을 비웃지 않도록 하라 후 자가 전자보다 훌륭할 수도 있노 라 여성이 다른 여성을 비웃지 않 도록 하라 후자가 전자보다 훌륭 할 수도 있노라 서로가 서로에게 중상하는 것과 저속한 변명도 아 니 되니라 믿음을 가진 후의 저속 한 이름은 사악한 것이며 회개하 지 아니 한 자 실로 죄인이라",
            "verse 49:12": "믿는 사람들이여 가능한 의 심을 피하라 어떤 일에 있어서의 의심은 하나의 죄악이라 그리고 서로가 서로를 감시하지 말며 서 로가 서로를 험담하지 말라 너희 중에 죽은 형제의 살을 먹고자 하 는자 아무도 없노라 실로 너희는 그것을 증오하리라 하나님을 두려 워 하라 실로 하나님은 관용과 자 비로 충만하시니라믿는 사람들이여 가능한 의 심을 피하라 어떤 일에 있어서의 의심은 하나의 죄악이라 그리고 서로가 서로를 감시하지 말며 서 로가 서로를 험담하지 말라 너희 중에 죽은 형제의 살을 먹고자 하 는자 아무도 없노라 실로 너희는 그것을 증오하리라 하나님을 두려 워 하라 실로 하나님은 관용과 자 비로 충만하시니라",
            "verse 49:13": "사람들이여 하나님이 너희를창조하사 남성과 여성을 두고 종 족과 부족을 두었으되 서로가 서 로를 알도록 하였노라 하나님 앞 에서 가장 크게 영광을 받을 자는 가장 의로운 자로 하나님은 모든 것을 아시며 관찰하시는 분이시라사람들이여 하나님이 너희를창조하사 남성과 여성을 두고 종 족과 부족을 두었으되 서로가 서 로를 알도록 하였노라 하나님 앞 에서 가장 크게 영광을 받을 자는 가장 의로운 자로 하나님은 모든 것을 아시며 관찰하시는 분이시라",
            "verse 49:14": "사막의 유목민들이 저희는믿나이다 라고 말하도다 일러가로 되 너희는 믿지 아니하고 귀의하 였습니다 라고 말할 뿐이라 저희 심중에 아직 믿음이 이르지 아니 하였노라 만일 너희가 하나님과 그분의 선지자를 믿는다면 그분께 서는 너희 행위에 대한 보상을 조 금도 감소하지 아니 하시니라 실 로 하나님은 관용과 자비로 충만 하심이라사막의 유목민들이 저희는믿나이다 라고 말하도다 일러가로 되 너희는 믿지 아니하고 귀의하 였습니다 라고 말할 뿐이라 저희 심중에 아직 믿음이 이르지 아니 하였노라 만일 너희가 하나님과 그분의 선지자를 믿는다면 그분께 서는 너희 행위에 대한 보상을 조 금도 감소하지 아니 하시니라 실 로 하나님은 관용과 자비로 충만 하심이라",
            "verse 49:15": "믿는 신앙인이란 하나님과 선지자를 믿되 의심하지 아니하고 하나님의 사업을 위해 그들의 재 산과 생명으로 성전하는 자들이 바로 믿는 신앙인들이라믿는 신앙인이란 하나님과 선지자를 믿되 의심하지 아니하고 하나님의 사업을 위해 그들의 재 산과 생명으로 성전하는 자들이 바로 믿는 신앙인들이라",
            "verse 49:16": "일러가로되 너희가 하나님께너희의 종교를 일러 주겠다는 것 이뇨 그러나 하나님은 하늘과 대 지위에 있는 모든 것을 아시나니 실로 하나님은 모든 것을 아심으 로 충만하시니라일러가로되 너희가 하나님께너희의 종교를 일러 주겠다는 것 이뇨 그러나 하나님은 하늘과 대 지위에 있는 모든 것을 아시나니 실로 하나님은 모든 것을 아심으 로 충만하시니라",
            "verse 49:17": "그들이 무슬림 됨이 그대에 게 은혜를 베푼 것으로 생각하나 일러가로되 너희가 무슬림 됨이 나에게 은혜된 것이라 생각지 말 라 하나님께서 너희에게 은혜를 베푸사 너희를 믿음으로 인도하셨 나니 너희는 진실되고 성실해야 하니라그들이 무슬림 됨이 그대에 게 은혜를 베푼 것으로 생각하나 일러가로되 너희가 무슬림 됨이 나에게 은혜된 것이라 생각지 말 라 하나님께서 너희에게 은혜를 베푸사 너희를 믿음으로 인도하셨 나니 너희는 진실되고 성실해야 하니라",
            "verse 49:18": "실로 하나님은 하늘과 대지 의 모든 비밀을 알고 계시며 너희 가 행하는 모든 것을 지켜보고 계 시니라실로 하나님은 하늘과 대지 의 모든 비밀을 알고 계시며 너희 가 행하는 모든 것을 지켜보고 계 시니라"
        },
        "Kurdish": {
            "verse 49:1": "Gelî ên bawerî anîne! hûn pêþiya Xuda û pexemberê wî nekevin û hûn xwe ji Xuda biparêzin-bitirsin. Bêguman Xuda sehkirê zana yeئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه پێشی خواو پێغه‌مبه‌ری خوا مه‌که‌ون له‌بڕیار و پێشنیاردا له‌خوا بترسن و پارێزکاربن، چونکه‌به‌ڕاستی خوا بیسه‌ره به‌گوفتار‌تان، زانایه به‌نیازو نهێنیه‌کانتان.",
            "verse 49:2": "Gelî ên bawerî anîne! hûn dengê xwe bi ser dengê pêxember de bilind nekin û hûn çewa bi hev re bi deng mijûl dibin pê re bi deng mijûl nebin ku bêyî haya we jê hebe kirinên we biþewiteئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌، ده‌نگتان به‌سه‌ر ده‌نگی پێغه‌مبه‌ر (صلى الله عليه وسلم) به‌رز مه‌که‌نه‌وه‌له‌کاتی گفتو گۆدا، قسه‌بێ په‌رده‌مه‌که‌ن له‌خزمه‌تیدا، نه‌وه‌کو کرده‌وه‌کانتان پووچ بێته‌وه و هه‌ستیشی پێ نه‌که‌ن.",
            "verse 49:3": "Bêguman ên ku dengê xwe li cem pêxemberê Xuda kêm dikin, ewên han in ên ku Xuda dilên wan ji xweparêziyê re sihêtî kiriye; ji wan re bexþîn û xelatek mezin heyeبه‌ڕاستی ئه‌وانه‌ی که‌ده‌نگیان هێواش ده‌که‌نه‌وه‌له‌خزمه‌ت پێغه‌مبه‌ری خوادا، ئه‌وانه‌ئه‌و که‌سانه‌ن که‌خوای گه‌وره‌دڵه‌کانیانی زاخاو داوه‌بۆ ته‌قواو خواناسین، ئه‌وانه‌لێ خۆشبوون و پاداشتی گه‌وره‌و گرانبه‌ها بۆیان ئاماده‌یه.",
            "verse 49:4": "Bêguman ewên ku ji piþt xaniyan ve gazî te dikin pirrî wan hiþ tê nabin- xwe ranagirinبه‌ڕاستی ئه‌وانه‌ی له‌ده‌ره‌وه‌ی ژووره‌کان بانگت ده‌که‌ن، ئه‌وانه‌زۆربه‌یان نه‌فامن و ژیری وه‌رناگرن (چونکه‌ره‌وشتی کۆمه‌ڵایه‌تی دروستیان له‌و بواره‌دا ڕه‌چاو نه‌کردووه‌).5. وَڵوْ ڕَنَّهُمْ ێَبَرُوا حَتَّى تَخْرُجَ إِڵیْهِمْ ڵكَانَ خَیْرًا لَّهُمْ وَاللَّهُ غَفُورٌ ڕَّحِیمٌ: خۆ ئه‌گه‌ر ئه‌وانه‌خۆگربوونایه‌، تا ده‌چویته ده‌ره‌وه‌بۆ لایان، ئه‌وه‌چاکتر و ڕه‌واتر بوو بۆیان خوا لێخۆشبوو میهره‌بانه‌، (ده‌کرێت ئه‌م چوار ئایه‌ته ڕێنموویی بێت بۆ سه‌رجه‌م ئیمانداران، تا ڕێزی پێشه‌واکانیان بگرن).",
            "verse 49:5": "Bêguman eger wan hewî bikirna heya ku tu derdiketî ba wan wê ji wan re çêtir bûna. Xuda bexþendekarê dilovan eخۆ ئه‌گه‌ر ئه‌وانه‌خۆگربوونایه‌، تا ده‌چویته ده‌ره‌وه‌بۆ لایان، ئه‌وه‌چاکتر و ڕه‌واتر بوو بۆیان خوا لێخۆشبوو میهره‌بانه‌، (ده‌کرێت ئه‌م چوار ئایه‌ته ڕێنموویی بێت بۆ سه‌رجه‌م ئیمانداران، تا ڕێزی پێشه‌واکانیان بگرن).",
            "verse 49:6": "Gelî ên bawerî anîne! eger yekî fasiq (ji rêya rast derketî) ji we re xeberekî anî, vêca hûn baþ lê bikolin ji bo ku hûn bi nezanî belakî bi serê komelekî de neynin, vêca hûnê poþman bibinئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناون ئه‌گه‌ر که‌سێکی متمانه‌پێ نه‌کراو هه‌واڵێکی گرنگی بۆ هێنان، خێرا بڕوای پێ مه‌که‌ن، به‌ڵکو سه‌رنج بده‌ن، لێی بکۆڵنه‌وه تا بۆتان ڕوون ده‌بێته‌وه‌، نه‌وه‌کو ئازارو ناخۆشی و گیروگرفت بۆ خه‌ڵکی دروست بکه‌ن به‌نه‌زانی، جا دوای په‌شیمان ببنه‌وه‌له‌و کاره‌ی که‌پێی هه‌ستاون.",
            "verse 49:7": "Hûn baþ bizanbin ku pêxemberê Xuda di nava we de ye. Eger wî di pirrî karan de peyrewtiya we bikirna hûnê biketina tengasiyan de. Lê bele Xuda baweriyê bi we xweþ kiriye û wê di dilên we de xemilandiye û kufrê û fisqê (derketina ji rêya rast) û bêfermaniyê bi we nexweþ kiriye. Ên rêya rast dîtine her evên han inئێوه دڵنیابن و بزانن که‌پێغه‌مبه‌ری خوا له‌ناوتاندایه (پرس و ڕای پێ بکه‌ن) زۆر شت هه‌یه ئه‌گه‌ر ئه‌و، به‌ڕای ئێوه‌ی بکردایه تووشی گیروگرفت و ناخۆشی ده‌بوون... به‌ڵام خوا ئیمان و باوه‌ڕی له‌لا خۆشه‌ویست کردوون و له‌دڵ و ده‌رونتاندا ڕازاندویه‌تیه‌وه... له‌و له‌یشه‌وه کوفرو بێ باوه‌ڕی وگوناهوو یاخی بوون له‌فه‌رمانی خوای لا تاڵ و ناشیرین کردوون، ئا ئه‌وانه‌هه‌ر خۆیان ڕێگه‌ی ژیری و سه‌رفرازیان گرتۆته‌به‌ر.",
            "verse 49:8": "Rûmet û qenciyek ji Xuda ye. Xuda zanatê hîkmetdar eئه‌مه‌ش خۆی ڕێزو به‌خششێکی تایبه‌تی و نازو نیعمه‌تێکه له‌لایه‌ن خواوه‌پێیان دراوه‌، خوایش زاناو داناو کاربه‌جێیه.",
            "verse 49:9": "Eger ji bawermendan du desta li hev xist-þer kirin, êdî hûn di naca wan de aþtî bikin. Vêca eger yekî ji wan li a din tadê kir êdî hûn bi (dest) a ku tadê dike re þer bikin heya ku ew bal fermana Xuda ve vedigere. Vêca eger vegeriya êdî hûn bi dadî (edaletê) di nava wan de aþtî bikin û bi rastiyê tevbigerin. Bêguman Xuda ji ehlê dad û rastiyê hiz dikeئه‌گه‌ر دوو ده‌سته‌، یان دوو تاقم له‌موسوڵمانان بوو به‌شه‌ڕیان، ئه‌وه‌ده‌ستبه‌جێ هه‌وڵ بده‌ن ڕێکیان بخه‌ن و ئاشتیان بکه‌نه‌وه‌، خۆ ئه‌گه‌ر لایه‌کیان هه‌ر ده‌ستدرێژی ده‌کرده‌سه‌ر لاکه‌ی تر، ئه‌وا ئێوه به‌گژ ئه‌وه‌یاندا بچن که‌سته‌م و ده‌ستدرێژی ده‌کات،، هه‌تا ده‌گه‌ڕێته‌وه بۆ فه‌رمانی خوا... جا گه‌ر لایه‌نه سه‌رکه‌شه‌که‌بۆ فه‌رمانی خوا سه‌ری دانه‌واند، ئه‌وه‌ئێوه ناوبژیوانێکی دادگه‌رانه‌له‌نێوانیاندا بکه‌ن و دادپه‌روه‌ری ئه‌نجام بده‌ن، چونکه‌به‌ڕاستی خوا ئه‌وانه‌ی خۆش ده‌وێت که‌دادپه‌روه‌ری ئه‌نجام ده‌ده‌ن.",
            "verse 49:10": "Bêguman bewermend her biran e, vêca hûn di nava birayên xwe de aþtî bikin û xwe ji Xuda biparêzîn hêvi heye ku hûn bêne dilovanî kirinله‌ڕاستیدا هه‌ر ئیمانداران برای یه‌کن، که‌واته‌هه‌رکاتێک له‌نێوان دوو براتاندا ناکۆکی په‌یدا بوو، ئێوه نێوانیان چاک بکه‌ن و ئاشتیان بكه‌نه‌وه‌، هه‌میشه له‌خوا بترسن و پارێزکار بن، بۆ ئه‌وه‌ی ڕه‌حمتان پێ بکرێت.",
            "verse 49:11": "Gelî ên bawerî anîne! bira zilam bi zilama tinaza nekin dibe ku ew ji wan çêtir bin; û bira pîrek jî bi pîreka (tinaza nekin) dibe ku ew ji wan çêtir bin. Hûn hev û din þermezar nekin û bi navê nexweþ gazî hev nekin. piþtî baweriyê navê nexweþ bi hev ve danîn çi pîs e. Kî poþman nebevenegere, edî sitemkar her ewên han inئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه! هیچ که‌س و هیچ هۆزێک گاڵته به‌که‌س و هۆزێکی تر نه‌کات و زه‌لیلی نه‌کات، چونکه‌له‌وانه‌یه ئه‌وان چاکتر بن له‌مان، ژنانیش به‌گاڵته به‌یه‌ک نه‌که‌ن و یه‌کتر زه‌لیل نه‌که‌ن، چونکه‌له‌وانه‌یه ئه‌مان له‌وان چاکتر بن... سووکایه‌تی به‌خۆتان مه‌که‌ن و یه‌کتری عه‌یبدار مه‌که‌ن (چونکه‌سووکایه‌تی به‌یه‌کتر سووکایه‌تی یه به‌خۆتان) هه‌روه‌ها ناوو ناتۆره‌ی ناشیرین بۆ یه‌کتر دامه‌تاشن، ئای که‌چه‌ند ناشیرینه ناوو ناتۆره‌ی خراپ له‌دوای باوه‌ڕهێنان و موسڵمان بوون، ئه‌وه‌ش ته‌وبه‌ی نه‌کردبێت و په‌شیمان نه‌بووبێته‌ووه له‌گوناهه‌کانی، جا ئه‌و جۆره که‌سانه‌هه‌ر سته‌مکارن.",
            "verse 49:12": "Gelî ên bawerî anîne! hûn xwe ji pirr bedgumaniyê dûr bikin. Lewra bêguman hinek bedgumanî guneh in. Hûn li pey hev û din gotina negerin casûsî û sixûriya nekin û paþpenî hev û din nepeyivin. Ma yek ji we hiz dike ku goþtê birayê xwe bi mirîtî bixwe?; tevî ku hûn jê bîzê xwe tînin. Hûn xwe ji Xuda biparêzin-bitirsin. Bêguman Xuda poþmaniya dipejirîne dilovan eئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، خۆتان زۆر بپارێزن له‌گومانی خراپ، له‌ڕاستیدا هه‌ندێ له‌و گومانانه گوناهو تاوانن (بۆیه حه‌ق وایه له‌هه‌موو گومانێک خۆپارێزبین) به‌شوێن که‌مو کووڕیی و عه‌یب و عاری یه‌کتردا مه‌گه‌ڕێن و سیخوڕی مه‌که‌ن و له‌پاش مله‌باسی یه‌کتری به‌خراپ مه‌به‌ن، ئایا که‌ستان خۆشی دێت له‌وه‌ی گۆشتی برای خۆی به‌مردوویی بخوات؟! دیاره کاری واتان زۆر پێ سه‌خت و ناخۆشه‌، ده‌ی که‌واته‌له‌خوا بترسن و پارێزگار بن، چونکه‌به‌ڕاستی خوا گه‌ڕانه‌وه‌ی خه‌ڵکی وه‌رده‌گرێت و میهره‌بانه بۆتان.",
            "verse 49:13": "Gelî morivan! bêguman me we ji zilam û pîrekî aferandiye û me ji bo ku hûn hevûdin nas bikin we kiriye gel û êl. Bêguman li cem Xuda baþtirê we xweparêztirê we ye. Bêguman Xuda zana ye haydar eئه‌ی خه‌ڵکینه بێگومان ئێمه هه‌مووتانمان له‌نێرو مێیه‌ک دروستکردووه (که‌باوکه‌ئاده‌م و دایکه حه‌وایه‌) و کردوومانن به‌چه‌نده‌ها گه‌ل و تیره و هۆزی جۆربه‌جۆر، تا یه‌کتر بناسن و په‌یوه‌ندیتان خۆش بێت به‌یه‌که‌وه... به‌ڕاستی به‌ڕێزترینتان لای خوا ئه‌و که‌سانه‌تان که‌زۆرتر له‌خواترسه‌و فه‌رمانبه‌رداری خوایه‌، بێگومان خوا زاناو ئاگایه به‌هه‌مووان.",
            "verse 49:14": "Erebê çolê gotin ku: \"Me bawerî aniye.\" Tu bêje ku: \"We bawerî neaniye lê belê bêjin: \"Em musilman bûne.\" Hê bawerî neketiye dilên we. Eger hûn peyrewtiye Xuda û pêxemberê wî bikin, tu tiþt ji kirinên we kêm nake. Bêguman Xuda bexþendekarê dilovan eهه‌ندێک له‌بیابان نشینه عه‌ره‌به‌کان وتیان: باوه‌ڕمان هێناو و موسڵمانین، پێیان بڵێ: نه‌خێر، باوه‌ڕتان نه‌هێناوه‌، به‌ڵام بڵێن: به‌ناچاری موسوڵمان بووین، هێشتا باوه‌ڕ نه‌چۆته ناو دڵه‌کانتانه‌وه و تیایدا جێگیر نه‌بووه (چاوه‌ڕێ ده‌کرێت که‌باوه‌ڕ بهێنن)، خۆ ئه‌گه‌ر به‌ڕاستی ئێوه گوێڕایه‌ڵی فه‌رمانی خواو پێغه‌مبه‌ری خوا بن، ئه‌وه‌خوای گه‌وره‌له‌پاداشتی چاکه‌کانتان هیچ که‌م ناکاته‌وه‌، چونکه‌به‌ڕاستی خوا لێخۆشبوو میهره‌بانه.",
            "verse 49:15": "Bêguman bawermend tenê ew in ku bi Xuda û pêxemberê wî bawerî anîne paþê neketine dudiliyê û bi malên xwe û canên xwe di rêya Xuda de cîhadê kirine. Rastgo her evên han inبێگومان ئیماندارانی ڕاست ئه‌وانه‌ن که‌باوه‌ڕیان به‌خواو پێغه‌مبه‌ری خوا هێناوه و پاشان نه‌که‌وتوونه‌ته‌هیچ گومان و دوودڵیه‌که‌وه‌، به‌خۆیان و سه‌رو ماڵیشیانه‌وه تێکۆشاون له‌پێناوی ئاینی خوادا، ته‌نها ئا ئه‌وانه‌ڕاستن.",
            "verse 49:16": "Tu bêje ku: \"Ma hûn Xuda bi dînên xwe haydar dikin? Tevî ku Xuda bi tiþtê di asîmana û tiþtê di zemîn de dizane. Xuda zanayê bi her toþtî yeئه‌ی محمد (صلى الله عليه وسلم) بڵێ: ئایا ئێوه خوای گه‌وره‌له‌ئاینی خۆتان ئاگادار ده‌که‌ن و پێی ڕاده‌گه‌یه‌نن، له حاڵێکدا خوا زانایه به‌هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه‌، خوا به‌هه‌موو شتێک زاناو ئاگاداره‌؟!",
            "verse 49:17": "Ew musilmaniya xwe li ser te dikin qencî. Tu beje ku: \"Hûn musilmantiya xwe qet li ser min nekin qencî. Ne, eger hûn bera rastgo ne, Xuda li ser we qencî kiriye ku we bal baweriyê ve rêberî kiriyeئه‌وانه‌منه‌ت ده‌که‌ن به‌سه‌ر تۆدا که‌گوایه موسڵمان بوون، پێیان بڵێ: منه‌ت مه‌که‌ن به‌سه‌رمدا له‌سه‌ر موسڵمان بوونه‌که‌تان، به‌ڵکو خوا منه‌ت ده‌کات به‌سه‌ر ئێوه‌دا که‌هیدایه‌تی داون بۆ ئیمان و باوه‌ڕ ئه‌گه‌ر ئێوه ڕاستگۆن.",
            "verse 49:18": "Bêguman Xuda veþariyê asîmana û zemîn dizane. Xuda, tiþtê hûn dikin baþ dibîneبێگومان خوا نهێنی و شاراوه‌کانی ئاسمان و زه‌وی ده‌زانێت، هه‌روه‌ها خوای گه‌وره‌بینایه به‌هه‌موو ئه‌و کرده‌وانه‌ی که‌ئه‌نجانی ده‌ده‌ن."
        },
        "Kyrgyz": {
            "verse 49:1": "О,ыйман келтиргендер! Аллаһтын жана пайгамбарынын алдында (бир иш же сөз менен) жулунбагыла! Жана Аллаһтан корккула! Чынында, Аллаһ Угуучу, Билүүчү",
            "verse 49:2": "О,ыйман келтирген пенделер! Добушуңарды пайгамбардын добушунан бийик көтөрбөгүлө! Билбестиктен улам (сооптуу) ишиңер «күйүп кетпеши» үчүн, бири-бириңерге кыйкырып сүйлөгөндөй ага (пайгамбарга) кыйкырып сүйлөбөгүлө",
            "verse 49:3": "Чынында, Аллаһтын элчисинин алдында добушун төмөндөткөн адамдар гана, Аллаһ алардын жүрөктөрүн такыбалык үчүн сынаган (жана сыноодон өткөн) кишилер. Аларга (Аллаһ тарабынан) кечирим жана улук сооп бар",
            "verse 49:4": "(О, Мухаммад), чынында, сага бөлмөлөрдүн артынан кыйкырган кишилердин көпчүлүгү акылын иштетпеген адамдар",
            "verse 49:5": "Эгер алар, сен чыкканга чейин сабыр кылып турушканда өздөрүнө жакшы болмок. (Бирок), Аллаһ - Кечирүүчү, Боорукер",
            "verse 49:6": "О,ыйман келтирген пенделер! Эгер силерге бир күнөөлүү адам (кандайдыр) кабар алып келсе, наадандык менен (ал жамандаган) коомду кайгы-капага салбашыңар үчүн жана жасаган ишиңерге бушайман болуп калбашыңар үчүн жакшылап (чын-төгүнүн) териштиргиле",
            "verse 49:7": "Жана билип алгыла, силердин араңарда Аллаһтын элчиси бар! Эгер ал көпчүлүк иштерде силерге моюн сунса, кыйналып каласыңар!! Бирок Аллаһ силерге ыйманды жакшы көргөзүп, аны менен жүрөгүңөрдү кооздоп койду жана силерге каапырчыкты, күнөөнү, (Өзүнө) каршы чыгууну жаман көргөздү. Ушул (сыпаттагы) адамдар гана, Туура Жолдогу кишилер",
            "verse 49:8": "Аллаһ тарабынан (берилген) пазилет жана нээмат (ушул). Аллаһ - Билерман, Даанышман",
            "verse 49:9": "Эгерде момундардан эки тайпасы өз ара согушуп калса, экөөнүн арасын оңдогула! Эгерде экөөсүнөн бири экинчисине зулум кылса, силер зулум кылганына каршы, Аллаһтын буйругуна кайтканга чейин согушкула! Эгер (тооба кылып, Аллаһтын өкүмүнө) кайтса, экөөсүнүн арасын адилеттик менен оңдоп (жараштырып) койгула! Жана (колуңардан келишинче) адилет кылгыла! Чынында, Аллаһ адил адамдарды сүйөт",
            "verse 49:10": "Чынында, (бардык) момундар — бир туугандар! Бир тууганыңардын арасын оңдогула! Жана Аллаһтан корккула! Ажеп эмес, ырайымына арзысаңар",
            "verse 49:11": "О, ыйман келтирген пенделер! Эч бир эл башка элди мазактабасын! Алар (мазакталгандар) булардан жакшыраак болуп калуусу толук мүмкүн. Жана эч бир аялдар башка аялдарды шылдыңдабасын, алар булардан жакшыраак болуп калышы мүмүкүн. Өзүңөрдү-өзүңөр (жаман) ылакаптар менен мыскылдабагыла! Ыймандын артынан бузук ысым (менен аталуу) кандай жаман! Ал эми, кимде-ким тооба кылбаса, алар — заалымдар",
            "verse 49:12": "О,ыйман келтиргендер! Күмөнчүл болуудан сактангыла! Чынында, кээ бир күмөндөр күнөө.! Жана бири-бириңерди аңдыбагыла жана бири-бириңерди кыйбат кылбагыла! Силерден бириңер өз бир тууганынын этин жегенди жактырабы?!” Жактырбайсыңарго! Аллаһтан корккула! Чынында, Аллаһ тообаларды Кабылдоочу, Боорукер",
            "verse 49:13": "О, адамдар! Биз силерди бир эркек жана бир аялдан (Адам-Ата менен Хаваа-Энеден) жаратып, өз ара таанышып-билишиңер үчүн улуттарга, урууларга (бөлүп) койдук. Аллаһтын назарында силердин эң улугуңар — такыбалуураак болгонуңар. Аллаһ чынында, Билүүчү, Кабардар",
            "verse 49:14": "Бедуиндер: «Биз ыймандуубуз»-дешет. Айткын: «Ыймандуу эмессиңер, бирок «Исламга кирдик»-дегиле. Ыйман силердин жүрөгүңөргө толук жете элек»!. Жана эгер Аллаһка жана Анын элчисине моюн сунсаңар, Ал силердин амалыңардан эч нерсени кемитпейт. Чынында, Аллаһ -Кечиримдүү, Ырайымдуу",
            "verse 49:15": "Албетте, Аллаһка жана Анын элчисине ыйман келтирип, андан (өз ыйманынан) шек санабаган жана Аллаһтын жолунда малдары, жандары менен жихад кылган адамдар гана (ыйманында) чынчыл кишилер",
            "verse 49:16": "(О, Мухаммад, акылысыз адамдарга) айткын: «Аллаһка диниңерди билдирип койоюн дедиңерби? Аллаһ асмандардагы жана жердеги (бардык) нерселерди (ошонун арасында силердин жүрөгүңөрдөгү ой-максатыңарды да) билет. Жана Аллаһ - бардык нерселерди Билүүчү»",
            "verse 49:17": "Алар сага өздөрүнүн мусулман болгондуктарын милдет (колко) кылышат. Айткын: «Исламга киргениңерди колко кылбагыла! Тескерисинче, Аллаһ силерди Туура Жолго баштаганын колко кылат, эгер (ыйманыңарда) чынчыл болсоңор»",
            "verse 49:18": "Чынында, Аллаһ асмандардагы жана Жердеги кайыптарды билет. Аллаһ силер жасаган иштерди Көрүүчү"
        },
        "Malay": {
            "verse 49:1": "Wahai orang-orang yang beriman! Janganlah kamu memandai-mandai (melakukan sesuatu perkara) sebelum (mendapat hukum atau kebenaran) Allah dan RasulNya; dan bertaqwalah kamu kepada Allah; sesungguhnya Allah Maha Mendengar, lagi Maha Mengetahui.",
            "verse 49:2": "Wahai orang-orang yang beriman! Janganlah kamu mengangkat suara kamu melebihi suara Nabi, dan janganlah kamu menyaringkan suara (dengan lantang) semasa bercakap dengannya sebagaimana setengah kamu menyaringkan suaranya semasa bercakap dengan setengahnya yang lain. (Larangan yang demikian) supaya amal-amal kamu tidak hapus pahalanya, sedang kamu tidak menyedarinya.",
            "verse 49:3": "Sesungguhnya orang-orang yang merendahkan suaranya semasa mereka berada di sisi Rasulullah (s.a.w), - merekalah orang-orang yang telah dibersihkan Allah hati mereka untuk bertaqwa; mereka beroleh keampunan dan pahala yang besar.",
            "verse 49:4": "Sesungguhnya orang-orang yang memanggilmu dari luar bilik-bilik (tempat ahlimu, wahai Muhammad), kebanyakan mereka tidak mengerti (adab dan tata tertib).",
            "verse 49:5": "Dan kalaulah mereka bersabar menunggu sehingga engkau keluar menemui mereka, tentulah cara yang demikian lebih baik bagi mereka; dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani.",
            "verse 49:6": "Wahai orang-orang yang beriman! Jika datang kepada kamu seorang fasik membawa sesuatu berita, maka selidikilah (untuk menentukan) kebenarannya, supaya kamu tidak menimpakan sesuatu kaum dengan perkara yang tidak diingini - dengan sebab kejahilan kamu (mengenainya) - sehingga menjadikan kamu menyesali apa yang kamu telah lakukan.",
            "verse 49:7": "Dan ketahuilah! Bahawasanya dalam kalangan kamu ada Rasulullah (maka janganlah kemahuan atau pendapat kamu mendahului pentadbirannya); kalaulah ia menurut kehendak kamu dalam kebanyakan perkara, tentulah kamu akan mengalami kesukaran; akan tetapi (Rasulullah tidak menurut melainkan perkara yang diwahyukan kepadanya, dan kamu wahai orang-orang yang beriman hendaklah bersyukur kerana) Allah menjadikan iman suatu perkara yang kamu cintai serta di perhiaskannya dalam hati kamu, dan menjadikan kekufuran dan perbuatan fasik serta perbuatan derhaka itu: perkara-perkara yang kamu benci; mereka yang bersifat demikian ialah orang-orang yang tetap menurut jalan yang lurus; -",
            "verse 49:8": "(Mereka dijadikan berkeadaan demikian) sebagai limpah kurnia dan nikmat pemberian dari Allah; dan (ingatlah), Allah Maha Mengetahui, lagi Maha Bijaksana.",
            "verse 49:9": "Dan jika dua puak dari orang-orang yang beriman berperang, maka damaikanlah di antara keduanya; jika salah satunya berlaku zalim terhadap yang lain, maka lawanlah puak yang zalim itu sehingga ia kembali mematuhi perintah Allah; jika ia kembali patuh maka damaikanlah di antara keduanya dengan adil (menurut hukum Allah), serta berlaku adillah kamu (dalam segala perkara); sesungguhnya Allah mengasihi orang-orang yang berlaku adil.",
            "verse 49:10": "Sebenarnya orang-orang yang beriman itu adalah bersaudara, maka damaikanlah di antara dua saudara kamu (yang bertelingkah) itu; dan bertaqwalah kepada Allah supaya kamu beroleh rahmat.",
            "verse 49:11": "Wahai orang-orang yang beriman! Janganlah sesuatu puak (dari kaum lelaki) mencemuh dan merendah-rendahkan puak lelaki yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka; dan janganlah pula sesuatu puak dari kaum perempuan mencemuh dan merendah-rendahkan puak perempuan yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka; dan janganlah setengah kamu menyatakan keaiban setengahnya yang lain; dan janganlah pula kamu panggil-memanggil antara satu dengan yang lain dengan gelaran yang buruk. (Larangan-larangan yang tersebut menyebabkan orang yang melakukannya menjadi fasik, maka) amatlah buruknya sebutan nama fasik (kepada seseorang) sesudah ia beriman. Dan (ingatlah), sesiapa yang tidak bertaubat (daripada perbuatan fasiknya) maka merekalah orang-orang yang zalim.",
            "verse 49:12": "Wahai orang-orang yang beriman! Jauhilah kebanyakan dari sangkaan (supaya kamu tidak menyangka sangkaan yang dilarang) kerana sesungguhnya sebahagian dari sangkaan itu adalah dosa; dan janganlah kamu mengintip atau mencari-cari kesalahan dan keaiban orang; dan janganlah setengah kamu mengumpat setengahnya yang lain. Adakah seseorang dari kamu suka memakan daging saudaranya yang telah mati? (Jika demikian keadaan mengumpat) maka sudah tentu kamu jijik kepadanya. (Oleh itu, patuhilah larangan-larangan yang tersebut) dan bertaqwalah kamu kepada Allah; sesungguhnya Allah Penerima taubat, lagi Maha mengasihani.",
            "verse 49:13": "Wahai umat manusia! Sesungguhnya Kami telah menciptakan kamu dari lelaki dan perempuan, dan Kami telah menjadikan kamu berbagai bangsa dan bersuku puak, supaya kamu berkenal-kenalan (dan beramah mesra antara satu dengan yang lain). Sesungguhnya semulia-mulia kamu di sisi Allah ialah orang yang lebih taqwanya di antara kamu, (bukan yang lebih keturunan atau bangsanya). Sesungguhnya Allah Maha Mengetahui, lagi Maha Mendalam PengetahuanNya (akan keadaan dan amalan kamu).",
            "verse 49:14": "Orang-orang \" A'raab\" berkata: \" Kami telah beriman\". Katakanlah (wahai Muhammad): \"Kamu belum beriman, (janganlah berkata demikian), tetapi sementara iman belum lagi meresap masuk ke dalam hati kamu berkatalah sahaja: ` kami telah Islam '. Dan (ingatlah), jika kamu taat kepada Allah RasulNya (zahir dan batin), Allah tidak akan mengurangkan sedikitpun dari pahala amal-amal kamu, kerana sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani\".",
            "verse 49:15": "Sesungguhnya orang-orang yang sebenar-benarnya beriman hanyalah orang-orang yang percaya kepada Allah dan RasulNya, kemudian mereka (terus percaya dengan) tidak ragu-ragu lagi, serta mereka berjuang dengan harta benda dan jiwa mereka pada jalan Allah; mereka itulah orang-orang yang benar (pengakuan imannya).",
            "verse 49:16": "Katakanlah (kepada orang-orang \"A'raab\" itu wahai Muhammad): \"Patutkah kamu hendak memberitahu kepada Allah tentang ugama kamu (dengan berkata: ` kami telah beriman ')? Padahal Allah mengetahui segala yang ada di langit dan yang ada di bumi, dan Allah Maha Mengetahui akan tiap-tiap sesuatu\".",
            "verse 49:17": "Mereka mengira dirinya berbudi kepadamu (wahai Muhammad) dengan sebab mereka telah Islam (tidak melawan dan tidak menentang). Katakanlah (kepada mereka): \"Janganlah kamu mengira keislaman kamu itu sebagai budi kepadaku, bahkan (kalaulah sah dakwaan kamu itu sekalipun maka) Allah jualah yang berhak membangkit-bangkitkan budiNya kepada kamu, kerana Dia lah yang memimpin kamu kepada iman (yang kamu dakwakan itu), kalau betul kamu orang-orang yang benar (pengakuan imannya).",
            "verse 49:18": "\"Sesungguhnya Allah mengetahui segala rahsia langit dan bumi, dan Allah Maha Melihat akan segala yang kamu kerjakan\"."
        },
        "Malayalam": {
            "verse 49:1": "സത്യവിശ്വാസികളേ, നിങ്ങള്‍ അല്ലാഹുവിന്‍റെയും അവന്‍റെ റസൂലിന്‍റെയും മുമ്പില്‍ (യാതൊന്നും) മുങ്കടന്നു പ്രവര്‍ത്തിക്കരുത്‌. അല്ലാഹുവിനെ നിങ്ങള്‍ സൂക്ഷിക്കുക. തീര്‍ച്ചയായും അല്ലാഹു കേള്‍ക്കുന്നവനും അറിയുന്നവനുമാകുന്നു.",
            "verse 49:2": "സത്യവിശ്വാസികളേ, നിങ്ങളുടെ ശബ്ദങ്ങള്‍ പ്രവാചകന്‍റെ ശബ്ദത്തിന് മീതെ ഉയര്‍ത്തരുത്‌. അദ്ദേഹത്തോട് സംസാരിക്കുമ്പോള്‍ നിങ്ങള്‍ അന്യോന്യം ഒച്ചയിടുന്നത് പോലെ ഒച്ചയിടുകയും ചെയ്യരുത്‌. നിങ്ങളറിയാതെ തന്നെ നിങ്ങളുടെ കര്‍മ്മങ്ങള്‍ നിഷ്ഫലമായി പോകാതിരിക്കാന്‍ വേണ്ടി.",
            "verse 49:3": "തീര്‍ച്ചയായും തങ്ങളുടെ ശബ്ദങ്ങള്‍ അല്ലാഹുവിന്‍റെ റസൂലിന്‍റെ അടുത്ത് താഴ്ത്തുന്നവരാരോ അവരുടെ ഹൃദയങ്ങളാകുന്നു അല്ലാഹു ധപനിഷ്ഠയ്ക്കായി പരീക്ഷിച്ചെടുത്തിട്ടുള്ളത്‌. അവര്‍ക്കാകുന്നു പാപമോചനവും മഹത്തായ പ്രതിഫലവുമുള്ളത്‌.",
            "verse 49:4": "(നീ താമസിക്കുന്ന) അറകള്‍ക്കു പുറത്തു നിന്ന് നിന്നെ വിളിക്കുന്നവരാരോ അവരില്‍ അധികപേരും ചിന്തിച്ചു മനസ്സിലാക്കുന്നില്ല.",
            "verse 49:5": "നീ അവരുടെ അടുത്തേക്കു പുറപ്പെട്ട് ചെല്ലുന്നത് വരെ അവര്‍ ക്ഷമിച്ചിരുന്നെങ്കില്‍ അതായിരുന്നു അവര്‍ക്ക് കൂടുതല്‍ നല്ലത്‌. അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 49:6": "സത്യവിശ്വാസികളേ, ഒരു അധര്‍മ്മകാരി വല്ല വാര്‍ത്തയും കൊണ്ട് നിങ്ങളുടെ അടുത്ത് വന്നാല്‍ നിങ്ങളതിനെപ്പറ്റി വ്യക്തമായി അന്വേഷിച്ചറിയണം. അറിയാതെ ഏതെങ്കിലും ഒരു ജനതയ്ക്ക് നിങ്ങള്‍ ആപത്തുവരുത്തുകയും, എന്നിട്ട് ആ ചെയ്തതിന്‍റെ പേരില്‍ നിങ്ങള്‍ ഖേദക്കാരായിത്തീരുകയും ചെയ്യാതിരിക്കാന്‍ വേണ്ടി.",
            "verse 49:7": "അല്ലാഹുവിന്‍റെ റസൂലാണ് നിങ്ങള്‍ക്കിടയിലുള്ളതെന്ന് നിങ്ങള്‍ മനസ്സിലാക്കണം. പല കാര്യങ്ങളിലും അദ്ദേഹം നിങ്ങളെ അനുസരിച്ചിരുന്നെങ്കില്‍ നിങ്ങള്‍ വിഷമിച്ച് പോകുമായിരുന്നു. എങ്കിലും അല്ലാഹു നിങ്ങള്‍ക്ക് സത്യവിശ്വാസത്തെ പ്രിയങ്കരമാക്കിത്തീര്‍ക്കുകയും, നിങ്ങളുടെ ഹൃദയങ്ങളില്‍ അത് അലംകൃതമായി തോന്നിക്കുകയും ചെയ്തിരിക്കുന്നു. അവിശ്വാസവും അധര്‍മ്മവും അനുസരണക്കേടും നിങ്ങള്‍ക്കവന്‍ അനിഷ്ടകരമാക്കുകയും ചെയ്തിരിക്കുന്നു. അങ്ങനെയുള്ളവരാകുന്നു നേര്‍മാര്‍ഗം സ്വീകരിച്ചവര്‍.",
            "verse 49:8": "അല്ലാഹുവിങ്കല്‍ നിന്നുള്ള ഒരു ഔദാര്യവും അനുഗ്രഹവുമാകുന്നു അത്‌. അല്ലാഹു സര്‍വ്വജ്ഞനും യുക്തിമാനുമാകുന്നു.",
            "verse 49:9": "സത്യവിശ്വാസികളില്‍ നിന്നുള്ള രണ്ടു വിഭാഗങ്ങള്‍ പരസ്പരം പോരടിച്ചാല്‍ നിങ്ങള്‍ അവര്‍ക്കിടയില്‍ രഞ്ജിപ്പുണ്ടാക്കണം. എന്നിട്ടു രണ്ടില്‍ ഒരു വിഭാഗം മറുവിഭാഗത്തിനെതിരില്‍ അതിക്രമം കാണിച്ചാല്‍ അതിക്രമം കാണിക്കുന്ന വിഭാഗത്തോട് അവര്‍ അല്ലാഹുവിന്‍റെ കല്‍പനയിലേക്ക് മടങ്ങിവരുന്നതു വരെ നിങ്ങള്‍ സമരം നടത്തണം. അങ്ങനെ ആ വിഭാഗം മടങ്ങിവരികയാണെങ്കില്‍ നീതിപൂര്‍വ്വം ആ രണ്ടു വിഭാഗങ്ങള്‍ക്കിടയില്‍ രഞ്ജിപ്പുണ്ടാക്കുകയും നിങ്ങള്‍ നീതി പാലിക്കുകയും ചെയ്യുക. തീര്‍ച്ചയായും അല്ലാഹു നീതി പാലിക്കുന്നവരെ ഇഷ്ടപ്പെടുന്നു.",
            "verse 49:10": "സത്യവിശ്വാസികള്‍ (പരസ്പരം) സഹോദരങ്ങള്‍ തന്നെയാകുന്നു. അതിനാല്‍ നിങ്ങളുടെ രണ്ടു സഹോദരങ്ങള്‍ക്കിടയില്‍ നിങ്ങള്‍ രഞ്ജിപ്പുണ്ടാക്കുക. നിങ്ങള്‍ അല്ലാഹുവെ സൂക്ഷിക്കുകയും ചെയ്യുക. നിങ്ങള്‍ക്ക് കാരുണ്യം ലഭിച്ചേക്കാം.",
            "verse 49:11": "സത്യവിശ്വാസികളേ, ഒരു ജനവിഭാഗം മറ്റൊരു ജനവിഭാഗത്തെ പരിഹസിക്കരുത്‌. ഇവര്‍ (പരിഹസിക്കപ്പെടുന്നവര്‍) അവരെക്കാള്‍ നല്ലവരായിരുന്നേക്കാം. ഒരു വിഭാഗം സ്ത്രീകള്‍ മറ്റൊരു വിഭാഗം സ്ത്രീകളെയും പരിഹസിക്കരുത്‌. ഇവര്‍ (പരിഹസിക്കപ്പെടുന്ന സ്ത്രീകള്‍) മറ്റവരെക്കാള്‍ നല്ലവരായിരുന്നേക്കാം. നിങ്ങള്‍ അന്യോന്യം കുത്തുവാക്ക് പറയരുത്‌. നിങ്ങള്‍ പരിഹാസപേരുകള്‍ വിളിച്ച് പരസ്പരം അപമാനിക്കുകയും ചെയ്യരുത്‌. സത്യവിശ്വാസം കൈക്കൊണ്ടതിനു ശേഷം അധാര്‍മ്മികമായ പേര് (വിളിക്കുന്നത്‌) എത്ര ചീത്ത! വല്ലവനും പശ്ചാത്തപിക്കാത്ത പക്ഷം അത്തരക്കാര്‍ തന്നെയാകുന്നു അക്രമികള്‍.",
            "verse 49:12": "സത്യവിശ്വാസികളേ, ഊഹത്തില്‍ മിക്കതും നിങ്ങള്‍ വെടിയുക. തീര്‍ച്ചയായും ഊഹത്തില്‍ ചിലത് കുറ്റമാകുന്നു. നിങ്ങള്‍ ചാരവൃത്തി നടത്തുകയും അരുത്‌. നിങ്ങളില്‍ ചിലര്‍ ചിലരെപ്പറ്റി അവരുടെ അഭാവത്തില്‍ ദുഷിച്ചുപറയുകയും അരുത്‌. തന്‍റെ സഹോദരന്‍ മരിച്ചുകിടക്കുമ്പോള്‍ അവന്‍റെ മാംസം ഭക്ഷിക്കുവാന്‍ നിങ്ങളാരെങ്കിലും ഇഷ്ടപ്പെടുമോ? എന്നാല്‍ അത് (ശവം തിന്നുന്നത്‌) നിങ്ങള്‍ വെറുക്കുകയാണു ചെയ്യുന്നത്‌. അല്ലാഹുവെ നിങ്ങള്‍ സൂക്ഷിക്കുക. തീര്‍ച്ചയായും അല്ലാഹു പശ്ചാത്താപം സ്വീകരിക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 49:13": "ഹേ; മനുഷ്യരേ, തീര്‍ച്ചയായും നിങ്ങളെ നാം ഒരു ആണില്‍ നിന്നും ഒരു പെണ്ണില്‍ നിന്നുമായി സൃഷ്ടിച്ചിരിക്കുന്നു. നിങ്ങള്‍ അന്യോന്യം അറിയേണ്ടതിന് നിങ്ങളെ നാം വിവിധ സമുദായങ്ങളും ഗോത്രങ്ങളും ആക്കുകയും ചെയ്തിരിക്കുന്നു. തീര്‍ച്ചയായും അല്ലാഹുവിന്‍റെ അടുത്ത് നിങ്ങളില്‍ ഏറ്റവും ആദരണീയന്‍ നിങ്ങളില്‍ ഏറ്റവും ധര്‍മ്മനിഷ്ഠ പാലിക്കുന്നവനാകുന്നു. തീര്‍ച്ചയായും അല്ലാഹു സര്‍വ്വജ്ഞനും സൂക്ഷ്മജ്ഞാനിയുമാകുന്നു.",
            "verse 49:14": "ഗ്രാമീണ അറബികള്‍ പറയുന്നു; ഞങ്ങള്‍ വിശ്വസിച്ചിരിക്കുന്നു എന്ന്‌. നീ പറയുക: നിങ്ങള്‍ വിശ്വസിച്ചിട്ടില്ല. എന്നാല്‍ ഞങ്ങള്‍ കീഴിപെട്ടിരിക്കുന്നു. എന്ന് നിങ്ങള്‍ പറഞ്ഞു കൊള്ളുക. വിശ്വാസം നിങ്ങളുടെ ഹൃദയങ്ങളില്‍ പ്രവേശിച്ചുകഴിഞ്ഞിട്ടില്ല. അല്ലാഹുവെയും അവന്‍റെ ദൂതനെയും നിങ്ങള്‍ അനുസരിക്കുന്ന പക്ഷം നിങ്ങള്‍ക്കു നിങ്ങളുടെ കര്‍മ്മഫലങ്ങളില്‍ നിന്ന് യാതൊന്നും അവന്‍ കുറവ് വരുത്തുകയില്ല. തീര്‍ച്ചയായും അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 49:15": "അല്ലാഹുവിലും അവന്‍റെ ദൂതനിലും വിശ്വസിക്കുകയും പിന്നീട് സംശയിക്കാതിരിക്കുകയും, തങ്ങളുടെ സ്വത്തുക്കളും ശരീരങ്ങളും കൊണ്ട് അല്ലാഹുവിന്‍റെ മാര്‍ഗത്തില്‍ സമരം നടത്തുകയും ചെയ്തവരാരോ അവര്‍ മാത്രമാകുന്നു സത്യവിശ്വാസികള്‍. അവര്‍ തന്നെയാകുന്നു സത്യവാന്‍മാര്‍.",
            "verse 49:16": "നീ പറയുക: നിങ്ങളുടെ മതത്തെപ്പറ്റി നിങ്ങള്‍ അല്ലാഹുവെ പഠിപ്പിക്കുകയാണോ? അല്ലാഹുവാകട്ടെ ആകാശങ്ങളിലുള്ളതും ഭൂമിയിലുള്ളതും അറിയുന്നു. അല്ലാഹു ഏത് കാര്യത്തെപറ്റിയും അറിയുന്നവനാകുന്നു.",
            "verse 49:17": "അവര്‍ ഇസ്ലാം മതം സ്വീകരിച്ചു എന്നത് അവര്‍ നിന്നോട് കാണിച്ച ദാക്ഷിണ്യമായി അവര്‍ എടുത്തുപറയുന്നു. നീ പറയുക: നിങ്ങള്‍ ഇസ്ലാം സ്വീകരിച്ചതിനെ എന്നോട് കാണിച്ച ദാക്ഷിണ്യമായി എടുത്ത് പറയരുത്‌. പ്രത്യുത, സത്യവിശ്വാസത്തിലേക്ക് നിങ്ങള്‍ക്ക് മാര്‍ഗദര്‍ശനം നല്‍കി എന്നത് അല്ലാഹു നിങ്ങളോട് ദാക്ഷിണ്യം കാണിക്കുന്നതാകുന്നു. നിങ്ങള്‍ സത്യവാന്‍മാരാണെങ്കില്‍ (ഇത് നിങ്ങള്‍ അംഗീകരിക്കുക)",
            "verse 49:18": "തീര്‍ച്ചയായും അല്ലാഹു ആകാശങ്ങളിലെയും ഭൂമിയിലെയും അദൃശ്യകാര്യം അറിയുന്നു. നിങ്ങള്‍ പ്രവര്‍ത്തിക്കുന്നത് കണ്ടറിയുന്നവനുമാകുന്നു അല്ലാഹു."
        },
        "Norwegian": {
            "verse 49:1": "Dere som tror, vær ikke frempå overfor Gud og Hans sendebud! Frykt Gud: Gud hører, og vet.",
            "verse 49:2": "Dere som tror, hev ikke deres stemmer over profetens stemme, og vær ikke høylytt i deres tale til ham, som dere er høylytte dere imellom, så at ikke deres gjerninger blir til fånyttes uten at dere aner det.",
            "verse 49:3": "De som senker sine stemmer i Guds sendebuds nærvær, disse er det hvis hjerter Gud har prøvet i gudsfrykt. De har i vente tilgivelse og stor lønn.",
            "verse 49:4": "De som står og roper på deg mens du er i dine gemakker, de fleste av dem forstår ingenting.",
            "verse 49:5": "Om de hadde tålmodighet til du kom ut, ville det være bedre for dem. Men Gud er tilgivende, nåderik.",
            "verse 49:6": "Dere som tror, om en ugudelig kommer til dere med et rykte, så bring på det rene, så dere ikke rammer folk i uvitenhet og så angrer på det dere har gjort!",
            "verse 49:7": "Vit at Guds sendebud er blant dere. Om han i mange saker skulle høre på dere, ville dere få ubehageligheter. Men Gud har gjort troen kjær for dere, og gjort den vakker i deres hjerter, og gitt dere motvilje mot vantro, synd og ulydighet. Disse er de rettsindige,",
            "verse 49:8": "ved godhet og nåde fra Gud. Gud vet, er vis.",
            "verse 49:9": "Om to grupper av de troende kommer i strid, skal dere ordne opp mellom dem. Om en av dem så gjør overgrep mot den andre, så bekjemp den som gjør overgrep til den føyer seg etter Guds bud. Om den føyer seg, så skal dere ordne forholdet mellom dem med rettferd, og la rimelighet råde. Gud liker de rimelige.",
            "verse 49:10": "De troende er jo brødre, så ordne opp mellom deres to brødre, og frykt Gud, så dere må finne nåde.",
            "verse 49:11": "Dere som tror, ingen må spotte andre, kanskje er de bedre enn dem, og ingen kvinner andre kvinner, kanskje er de bedre enn dem. Tal ikke ondt om hverandre, og belast ikke hverandre med klengenavn. Et slikt ondt navn er «synder», etter at troen er antatt. De som ikke snur om, de handler sannelig ondt.",
            "verse 49:12": "Dere som tror, unngå å gjøre for mange formodninger. Noen formodninger er synd. Spioner ikke, og baktal ikke hverandre. Ville vel noen like å spise kjøttet av sin døde bror som en åtselsfugl? Dere ville avsky det! Så frykt Gud! Gud viser miskunn, er nåderik.",
            "verse 49:13": "Dere mennesker, Vi har skapt dere som mann og kvinne og gjort dere til folk og stammer, slik at dere må kjenne hverandre. Den mest ansette av dere i Guds øyne er den mest gudfryktige. Gud vet, er vel underrettet.",
            "verse 49:14": "Beduinene sier: «Vi tror.» Si: «Dere tror ikke, men si heller: ’Vi har antatt islam,’ for troen er ennå ikke gått inn i deres hjerter. Hvis dere adlyder Gud og Hans sendebud, vil Han ikke beskjære deres gjerninger det minste. Gud er tilgivende, nåderik.»",
            "verse 49:15": "Troende er kun de som tror på Gud og Hans sendebud og så ikke tviler, men satser liv og eiendom for Guds sak. Disse er de oppriktige.",
            "verse 49:16": "Si: «Skulle vel dere belære Gud om hva deres religion er, Gud, som kjenner alt i himlene og på jord? Gud vet om alle ting!»",
            "verse 49:17": "De ser det som en gunst mot deg at de har antatt islam! Si: «Se det ikke som en gunst mot meg at dere har antatt islam. Nei, det er Gud som viser dere gunst ved at Han ledet dere til troen, hvis dere snakker sant.»",
            "verse 49:18": "Gud kjenner himlenes og jordens mysterier. Gud er observant for det dere gjør."
        },
        "Pashto": {
            "verse 49:1": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو د الله او د هغه د رسول په مخكې مه وړاندې كېږئ، او له الله نه ووېرېږئ، بېشكه الله ښه اورېدونكى، ښه پوه دى",
            "verse 49:2": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو خپل اوازونه د نبي د اواز له پاسه مه پورته كوئ، او مه ده ته په اوچت اواز خبره كوئ، لكه ستاسو د ځینو له ځینو نورو سره د اواز اوچتولو په شان۔، له دې وجې چې ستاسو عملونه به برباد شي او تاسو به پوه نه وئ",
            "verse 49:3": "بېشكه هغه كسان چې د الله د رسول په وړاندې خپل اوازونه ټیټوي؛ دغه هغه كسان دي چې الله د دوى زړونه د تقویٰ (او پرهېزګارۍ) لپاره ازمایلي دي۔، د دوى لپاره بخښنه او ډېر لوى اجر دى",
            "verse 49:4": "بېشكه هغه كسان چې تا ته له حجرو نه د باندې چغې وهي، د دوى اكثره عقل نه لري",
            "verse 49:5": "او كه یقینًا دوى صبر كړى وى، تر دې چې ته دوى ته راوتلى وى (نو) یقینًا دا به د دوى لپاره ډېره غوره و۔: او الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 49:6": "اى هغو كسانو چې ایمان يې راوړى دى! كه تاسو ته كوم فاسق (بدكار كس) خبر راوړي، نو تاسو ښه تحقیق كوئ، په دې چې تاسو به یو قوم ته په ناخبري سره تكلیف ورسوئ، بیا به تاسو په خپلو كړو باندې پښېمانه شئ",
            "verse 49:7": "او تاسو پوه شئ چې یقینًا په تاسو كې د الله رسول موجود دى، كه هغه په ډېرو كارونو كې ستاسو پیروي كړې وى (نو) تاسو به په مشقت كې غورځېدلي وى او لېكن الله تاسو ته ایمان محبوب وګرځاوه او هغه يې ستاسو په زړونو كې ښايسته كړ او تاسو ته يې كفر او فسق او نافرماني كول ناخوښه وګرځول۔، هم دغه كسان په نېغه لار دي",
            "verse 49:8": "د الله له جانبه د فضل او نعمت په وجه۔ او الله ښه پوه، ښه حكمت والا دى",
            "verse 49:9": "او كه په مومنانو كې دوه ډلې په خپل مینځ كې جنګ شروع كړي، نو تاسو د دغو دواړو په مینځ كې سوله (روغه) وكړئ، نو كه په دغو دواړو كې یوې په بلې باندې زیاتى (او ظلم) وكړ، نو تاسو له هغې ډلې سره وجنګېږئ، چې زیاتى كوي، تر دې چې هغه د الله حكم ته راوګرځي، نو كه هغه (له ظلم نه) راوګرځېدله، نو تاسو د دواړو په مينځ كې په انصاف سره سوله وكړئ او تاسو انصاف كوئ، بېشكه الله انصاف كوونكي خوښوي",
            "verse 49:10": "بېشكه هم دا خبره ده چې مومنان خو سره وروڼه دي، نو تاسو د خپلو دواړو وروڼو په مينځ كې سوله كوئ او له الله نه ووېرېږئ، د دې لپاره چې په تاسو رحم وكړى شي",
            "verse 49:11": "اى هغو كسانو چې ایمان يې راوړى دى! هېڅ قوم دې په بل قوم پورې مسخرې نه كوي، كېدى شي چې هغوى له ده نه ډېر غوره وي، او نه (دې) ښځې په نورو ښځو پورې (مسخرې كوي)، كېدى شي چې هغوى له دوى نه ډېرې غوره وي۔ او تاسو د خپلو ځانونو عیب جويي مه كوئ او یو بل په بدو لقبونو (او نومونو) سره مه بلئ۔، له ایمان راوړو نه بعد د فسق نامه بده ده او چا چې توبه ونه وېستله، نو هم دغه كسان ظالمان دي",
            "verse 49:12": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو له ډېرو (بدو) ګمانونو نه ځان وساتئ، بېشكه ځینې ګمانونه ګناه ده۔ او پټ عیبونه مه لټوئ او ستاسو ځینې دې د ځینو نورو غیبت نه كوي، ایا په تاسو كې یو كس دا خوښوي چې د خپل ورور غوښه وخوري، په دې حال كې چې هغه مړى وي، نو تاسو دغه (خوراك) بدګڼئ او له الله نه ووېرېږئ، بېشكه الله ښه توبه قبلوونكى، بې حده رحم كوونكى دى",
            "verse 49:13": "اى خلقو! بېشكه مونږ تاسو له يوه سړي او له یوې ښځې پیدا كړي یئ او مونږ تاسو څانګې او قبیلې ګرځولي یئ، د دې لپاره چې تاسو یو بل سره وپېژنئ، بېشكه د الله په نیز په تاسو كې ډېر عزتمن، ستاسو زیات پرهېزګار دى۔، بېشكه الله ښه پوه، ښه خبردار دى",
            "verse 49:14": "بانډېسیانو (صحرايي خلقو) وویل: مونږ ایمان راوړى دى، ته (دوى ته) ووایه: تاسو ایمان نه دى راوړى۔ او لېكن تاسو ووايئ چې مونږ اسلام راوړى دى۔ او ایمان لا تر اوسه ستاسو په زړونو كې نه دى ننوتى۔ او كه تاسو د الله او د هغه د رسول اطاعت وكړئ، نو هغه (الله) به ستاسو له عملونو نه هېڅ شى كم نه كړي، بېشكه الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 49:15": "بېشكه مومنان خو هغه كسان دي چې په الله او د هغه په رسول يې ایمان راوړى دى، بیا يې شك نه دى كړى او د الله په لاره كې يې په خپلو مالونو او خپلو ځانونو سره جهاد كړى دى، هم دغه كسان رښتیني دي",
            "verse 49:16": "ته (دوى ته) ووایه: ایا تاسو پر خپل دین باندې الله خبروئ، حال دا چې الله پوهېږي په هر هغه څه چې په اسمانونو كې دي او په هر هغه څه چې په ځمكه كې دي، او الله په هر شي باندې ښه پوه دى",
            "verse 49:17": "دوى په تا د دې احسان كوي چې اسلام يې راوړى دى، ته (ورته)، ووایه: تاسو په ما باندې د خپل اسلام راوړلو احسان مه كوي، بلكې الله پر تاسو باندې احسان كوي دا چې تاسو ته يې د ایمان راوړلو هدایت وكړ۔، كه تاسو رښتیني يئ",
            "verse 49:18": "بېشكه الله د اسمانونو او ځمكې په غیبو پوهېږي او الله هغه څه لره چې تاسو يې كوئ، ښه ليدونكى دى"
        },
        "Persian": {
            "verse 49:1": "اى كسانى كه ايمان آورده‌ايد، بر خدا و پيامبر او پيشى مگيريد و از خدا بترسيد، زيرا خدا شنوا و داناست.",
            "verse 49:2": "اى كسانى كه ايمان آورده‌ايد، صداى خود را از صداى پيامبر بلندتر مكنيد و همچنان كه با يكديگر بلند سخن مى‌گوييد با او به آواز بلند سخن مگوييد، كه اعمالتان ناچيز شود و آگاه نشويد.",
            "verse 49:3": "كسانى كه در نزد پيامبر خدا صدايشان را پايين مى‌آورند همانهايند كه خدا دلهايشان را به تقوى آزموده است. آنها راست آمرزش و مزد بسيار.",
            "verse 49:4": "آنهايى كه از آن سوى حجره‌ها ندايت مى‌دهند بيشتر بى‌خردانند.",
            "verse 49:5": "اگر صبر مى‌كردند تا تو خود بيرون مى‌آمدى و نزد آنها مى‌رفتى برايشان بهتر مى‌بود، و خدا آمرزنده مهربان است.",
            "verse 49:6": "اى كسانى كه ايمان آورده‌ايد، اگر فاسقى برايتان خبرى آورد تحقيق كنيد، مباد از روى نادانى به مردمى آسيب برسانيد، آنگاه از كارى كه كرده‌ايد پشيمان شويد.",
            "verse 49:7": "و بدانيد كه پيامبر خدا در ميان شماست. اگر در بسيارى از امور از شما فرمان ببرد به رنج مى‌افتيد. ولى خدا ايمان را محبوب شما ساخت و آن را در دلتان بياراست و كفر و فسق و عصيان را در نظرتان مكروه گردانيد. اينان خود راه‌يافتگانند.",
            "verse 49:8": "بخشش و نعمتى است از جانب خدا، و خدا دانا و حكيم است.",
            "verse 49:9": "و اگر دو گروه از مؤمنان با يكديگر به جنگ برخاستند، ميانشان آشتى افكنيد. و اگر يك گروه بر ديگرى تعدى كرد، با آن كه تعدى كرده است بجنگيد تا به فرمان خدا باز گردد. پس اگر بازگشت، ميانشان صلحى عادلانه برقرار كنيد و عدالت ورزيد كه خدا عادلان را دوست دارد.",
            "verse 49:10": "هر آينه مؤمنان برادرانند. ميان برادرانتان آشتى بيفكنيد و از خدا بترسيد، باشد كه بر شما رحمت آرد.",
            "verse 49:11": "اى كسانى كه ايمان آورده‌ايد، مباد كه گروهى از مردان گروه ديگر را مسخره كند، شايد آن مسخره‌شدگان بهتر از آنها باشند. و مباد كه گروهى از زنان گروه ديگر را مسخره كند، شايد آن مسخره‌شدگان بهتر از آنها باشند. و از هم عيبجويى مكنيد و يكديگر را به القاب زشت مخوانيد. بد است عنوان فسق پس از ايمان‌آوردن. و كسانى كه توبه نمى‌كنند خود ستمكارانند.",
            "verse 49:12": "اى كسانى كه ايمان آورده‌ايد، از گمان فراوان بپرهيزيد. زيرا پاره‌اى از گمانها در حد گناه است. و در كارهاى پنهانى يكديگر جست و جو مكنيد. و از يكديگر غيبت مكنيد. آيا هيچ يك از شما دوست دارد كه گوشت برادر مرده خود را بخورد؟ پس آن را ناخوش خواهيد داشت. و از خدا بترسيد، زيرا خدا توبه‌پذير و مهربان است.",
            "verse 49:13": "اى مردم، ما شما را از نرى و ماده‌اى بيافريديم. و شما را جماعتها و قبيله‌ها كرديم تا يكديگر را بشناسيد. هر آينه گرامى‌ترين شما نزد خدا، پرهيزگارترين شماست. خدا دانا و كاردان است.",
            "verse 49:14": "اعراب باديه‌نشين گفتند: ايمان آورديم. بگو: ايمان نياورده‌ايد، بگوييد كه تسليم شده‌ايم، و هنوز ايمان در دلهايتان داخل نشده است. و اگر خدا و پيامبرش را اطاعت كنيد از ثواب اعمال شما كاسته نمى‌شود، زيرا خدا آمرزنده و مهربان است.",
            "verse 49:15": "مؤمنان كسانى هستند كه به خدا و پيامبر او ايمان آورده‌اند و ديگر شك نكرده‌اند، و با مال و جان خويش در راه خدا جهاد كرده‌اند. اينان راستگويانند.",
            "verse 49:16": "بگو: آيا مى‌خواهيد خدا را از ديندارى خويش آگاه كنيد؟ حال آنكه خدا از هر چه در آسمانها و هر چه در زمين است آگاه است و او به هر چيزى عالم است.",
            "verse 49:17": "از اينكه اسلام آورده‌اند بر تو منت مى‌گذارند. بگو: به خاطر اسلامتان بر من منت مگذاريد، بلكه خدا بدان سبب كه شما را به ايمان راه نموده است بر شما منت مى‌نهد، اگر راست مى‌گوييد.",
            "verse 49:18": "هر آينه خدا نهان آسمانها و زمين را مى‌داند و به هر كارى كه مى‌كنيد بيناست."
        },
        "Polish": {
            "verse 49:1": "O wy, którzy wierzycie! Nie wysuwajcie się naprzód przed Bogiem i Jego Posłańcem i bójcie się Boga! Zaprawdę, Bóg jest słyszący, widzący!",
            "verse 49:2": "O wy, którzy wierzycie! Nie podnoście waszych głosów ponad głos Proroka! I nie zwracajcie się do niego głosem podniesionym - jak to czynicie między sobą - aby nie stały się daremne wasze uczynki, kiedy nie jesteście świadomi.",
            "verse 49:3": "Zaprawdę, ci, którzy zniżają głos w obecności Posłańca Boga - to są ci, których serca doświadczył Bóg dla bogobojności. Dla nich będzie przebaczenie i nagroda ogromna.",
            "verse 49:4": "Zaprawdę, ci, którzy ciebie wzywają z tyłu komnat, przeważnie tego nie rozumieją.",
            "verse 49:5": "A jeśliby oni byli cierpliwi, aż ty do nich wyjdziesz, to byłoby lepiej dla nich. A Bóg jest przebaczający, litościwy!",
            "verse 49:6": "O wy, którzy wierzycie! Jeśli przyjdzie do was jakiś zły człowiek z wieścią, to starajcie się rozeznać, żebyście nie urazili ludzi nieświadomie i abyście potem nie żałowali tego, co uczyniliście.",
            "verse 49:7": "I wiedzcie, że Posłaniec Boga jest pośród was. Jeśliby on posłuchał was w wielu sprawach, to z pewnością ponieślibyście szkodę. Lecz Bóg dał wam pokochać wiarę i On ozdobił ją w waszych sercach, a uczynił dla was nienawistną niewiarę, zepsucie i nieposłuszeństwo. Tacy - oni idą drogą prawości.",
            "verse 49:8": "To jest łaska Boga i dobrodziejstwo. Bóg jest wszechwiedzący, mądry!",
            "verse 49:9": "Jeśli dwie partie spośród wiernych zwalczają się, to ustanówcie między nimi pokój. A jeśli jedna z nich będzie nadal występować przeciw drugiej, to zwalczajcie tę, która się buntuje, aż zwróci się ku rozkazowi Boga. A jeśli się podda, to ustanówcie między nimi pokój według sprawiedliwości i postępujcie bezstronnie! Zaprawdę, Bóg miłuje ludzi, którzy postępują według słuszności.",
            "verse 49:10": "Wierni są przecież braćmi! Ustanawiajcie więc pokój między waszymi dwoma braćmi i bójcie się Boga! Być może, wy dostąpicie miłosierdzia.",
            "verse 49:11": "O wy, którzy wierzycie! Niech jedni ludzie nie szydzą z drugich; być może, tamci są lepsi od nich. Ani też kobiety - z kobiet; być może, tamte są lepsze od nich. I nie zniesławiajcie siebie samych; i nie obrzucajcie się wyzwiskami. Jakże złe jest słowo \"zepsucie\" - po przyjęciu wiary! A ten, kto się nie nawróci - to ci - oni są niesprawiedliwi.",
            "verse 49:12": "O wy, którzy wierzycie! Unikajcie wielce podejrzeń. Zaprawdę, niektóre podejrzenia są grzechem! Nie szpiegujcie się wzajemnie! Nie obmawiajcie jedni drugich w ich nieobecności! Czy chciałby któryś z was jeść ciało swego brata, kiedy on umarł? Przecież czulibyście wstręt do tego. Bójcie się Boga! Zaprawdę, Bóg jest przebaczający, litościwy!",
            "verse 49:13": "O ludzie! Oto stworzyliśmy was z mężczyzny i kobiety i uczyniliśmy was ludami i plemionami, abyście się wzajemnie znali. Zaprawdę, najbardziej szlachetny spośród was, w obliczu Boga, to najbardziej bogobojny spośród was! Zaprawdę, Bóg jest wszechwiedzący, dobrze świadomy!",
            "verse 49:14": "Powiedzieli Beduini: \"My wierzymy!\" Powiedz: \"Wy nie wierzycie; lecz raczej powiedzcie: 'My poddaliśmy się całkowicie!', - bo wiara nie weszła jeszcze w wasze serca.\" A jeśli wy będziecie posłuszni Bogu i Jego Posłańcowi, to On w niczym nie umniejszy waszych uczynków. Zaprawdę, Bóg jest przebaczający, litościwy!",
            "verse 49:15": "Wiernymi są tylko ci, którzy uwierzyli w Boga i Jego Posłańca - potem nie mieli wątpliwości - i walczyli swoimi majątkami i swoimi osobami na drodze Boga. Tacy - oni są prawdomówni!",
            "verse 49:16": "Powiedz: \"Czyż będziecie pouczać Boga o waszej religii, skoro Bóg wie, co jest w niebiosach i co jest na ziemi? I Bóg o każdej rzeczy jest wszechwiedzący?!\"",
            "verse 49:17": "Oni przedstawiają jako łaskawość dla ciebie to, iż przyjęli islam. Powiedz: \"Nie przedstawiajcie waszego islamu jako łaskawości dla mnie. Przeciwnie, to Bóg obdarzył was łaską, że poprowadził was drogą prostą ku wierze - jeśli wy jesteście prawdomówni!\"",
            "verse 49:18": "Zaprawdę, Bóg zna to, co skryte w niebiosach i na ziemi! I Bóg widzi jasno to, co wy czynicie!"
        },
        "Portuguese": {
            "verse 49:1": "Ó fiéis, não vos antecipeis a Deus e ao Seu Mensageiro, e temei a Deus, porque Deus é Oniouvinte, Sapientíssimo.",
            "verse 49:2": "Ó fiéis, não altereis as vossas vozes acima da voz do Profeta, nem lhe faleis em voz alta, como fazeis entre vós, para nãotornardes sem efeito as vossas obras, involuntariamente.",
            "verse 49:3": "Sabei que os que baixam as suas vozes na presença do Mensageiro de Deus, são aqueles cujos corações Deus testou paraa piedade; obterão o perdão e uma magnífica recompensa.",
            "verse 49:4": "Em verdade, a maioria daqueles que gritam (o teu nome), do lado de fora dos (teus) aposentos, é insensata.",
            "verse 49:5": "Mas, se aguardassem pacientemente, até que tu saísses ao seu encontro, seria muito melhor para eles. Deus é Ingulgente, Misericordiosíssimo.",
            "verse 49:6": "Ó fiéis, quando um ímpio vos trouxer uma notícia, examinai-a prudentemente, para não prejudicardes ninguém, porignorância, e não vos arrependerdes depois.",
            "verse 49:7": "E sabei que o Mensageiro de Deus está entre vós e que se ele vos obedecesse em muitos assuntos, cairíeis em desgraça. Porém, Deus vos inspirou o amor pela fé e adornou com ela vossos corações e vos fez repudiar a incredulidade, aimpiedade e a rebeldia. Tais são os sensatos.",
            "verse 49:8": "Isso, pela graça e favor de Deus; e Deus é Prudente, Sapientíssimo.",
            "verse 49:9": "E quando dois grupos de fiéis combaterem entre si, reconciliai-os, então. E se um grupo provocar outro, combatei oprovocador, até que se cumpram os desígnios de Deus. Se porém, se cumprirem (os desígnios), então reconciliai-oseqüitativamente e sede equânimes, porque Deus aprecia os equânimes.",
            "verse 49:10": "Sabe que os fiéis são irmãos uns dos outros; reconciliai, pois, os vossos irmãos, e temei a Deus, para vos mostrarmisericórdia.",
            "verse 49:11": "Ó fiéis, que nenhum povo zombe do outro; é possível que (os escarnecidos) sejam melhores do que eles (osescarnecedores). Que tampouco nenhuma mulher zombe de outra, porque é possível que esta seja melhor do que aquela. Nãovos difameis, nem vos motejeis com apelidos mutuamente. Muito vil é o nome que detona maldade (para ser usado poralguém), depois de Ter recebido a fé! E aqueles que não se arrependem serão os iníquos.",
            "verse 49:12": "Ó fiéis, evitai tanto quanto possível a suspeita, porque algumas suspeitas implicam em pecado. Não vos espreiteis, nemvos calunieis mutuamente. Quem de vós seria capaz de comer a carne do seu irmão morto? Tal atitude vos causa repulsa! Temei a Deus, porque Ele é Remissório, Misericordiosíssimo.",
            "verse 49:13": "Ó humanos, em verdade, Nós vos criamos de macho e fêmea e vos dividimos em povos e tribos, para reconhecerdes unsaos outros. Sabei que o mais honrado, dentre vós, ante Deus, é o mais temente. Sabei que Deus é Sapientíssimo e está beminteirado.",
            "verse 49:14": "Os beduínos dizem: Cremos! Dize-lhes: Qual! Ainda não credes; deveis dizer: Tornamo-nos muçulmanos, pois que a féainda não penetrou vossos corações. Porém, se obedecerdes a Deus e ao Seu Mensageiro, em nada serão diminuídas asvossas obras, porque Deus é Indulgente, Misericordiosíssimo.",
            "verse 49:15": "Somente são fiéis aqueles que crêem em Deus e em Seu Mensageiro e não duvidam, mas sacrificam os seus bens e assuas pessoas pela causa de Deus. Estes são os verazes!",
            "verse 49:16": "Dize-lhes: Pretendeis, acaso, ensinar a Deus a vossa religião, quando Deus bem conhece tudo quanto existe nos céus e naterra? Sabei que Deus é Onisciente.",
            "verse 49:17": "Dizem que te fizeram um favor por se terem tornado muçulmanos. Dize-lhes: não considereis a vossa conversão um favorpara mim; outrossim, é a Deus que deveis o mérito de vos Ter encaminhado à fé, se sois verazes.",
            "verse 49:18": "Sabei que Deus conhece o mistério dos céus e da terra, e Deus bem vê tudo o quanto fazeis!"
        },
        "Punjabi": {
            "verse 49:1": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੂਸੀਂ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲਾਂ ਤੋਂ ਅੱਗੇ ਨਾ ਵਧੋ, ਅੱਲਾਹ ਤੋਂ ਡਰੋ ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਸੁਣਨ ਵਾਲਾ ਅਤੇ ਜਾਣਨ ਵਾਲਾ ਹੈ।",
            "verse 49:2": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਸੀਂ ਆਪਣੀਆਂ ਅਵਾਜ਼ਾਂ ਰਸੂਲ ਦੀਆਂ ਅਵਾਜ਼ਾਂ ਤੋਂ ਉੱਚੀਆਂ ਨਾ ਕਰੋ ਅਤੇ ਨਾ ਹੀ ਉਨ੍ਹਾਂ ਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਅਵਾਜ਼ ਮਾਰ ਕੇ ਸੱਦੋ, ਜਿਸ ਤਰ੍ਹਾਂ ਤੁਸੀਂ ਆਪਿਸ ਵਿਚ ਇੱਕ ਦੂਜੇ ਨੂੰ ਬੁਲਾਉਂਦੇ ਹੋ। ਕਿਤੇ ਅਜਿਹਾ ਨੇ ਹੋਵੇ ਕਿ ਤੁਹਾਡੇ ਕਰਮ ਨਸ਼ਟ ਹੋ ਜਾਣ ਅਤੇ ਤੁਹਾਨੂੰ ਇਸ ਦੀ ਖ਼ਬਰ ਵੀ ਨਾ ਹੋਂਵੇ। ਅਤੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋਂ, ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਸਭ ਕੁਝ ਸੁਣਨ ਵਾਲਾ ਅਤੇ ਦੇਖਣ ਵਾਲਾ ਹੈ।",
            "verse 49:3": "ਜਿਹੜੇ ਲੋਕ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਦੇ ਅੱਗੇ ਆਪਣੀਆਂ ਅਵਾਜ਼ਾਂ ਨੀਵੀਂਆਂ ਰੱਖਦੇ ਹਨ, ਇਹ ਉਹ ਲੋਕ ਹਨ ਜਿਨ੍ਹਾਂ ਦੇ ਦਿਲ ਤਕਵਾ (ਪ੍ਰਹੇਜ਼ਗਾਰੀ) ਲਈ ਪਰਖ ਲਏ ਹਨ। ਉਨ੍ਹਾਂ ਲਈ ਮੁਆਫ਼ੀ ਹੈ ਅਤੇ ਵੱਡਾ ਪੁੰਨ ਹੈ।",
            "verse 49:4": "ਜਿਹੜੇ ਲੋਕ ਤੁਹਾਨੂੰ ਨਹੀਂ ਰੱਖਦੇ।",
            "verse 49:5": "ਅਤੇ ਜੇਕਰ ਉਹ ਧੀਰਜ ਰੱਖਦੇ, ਇੱਥੋਂ ਤੱਕ ਕਿ ਜਦੋਂ ਤੁਸੀਂ ਖ਼ੁਦ ਉਨ੍ਹਾਂ ਦੇ ਸਾਹਮਣੇ ਉਨ੍ਹਾਂ ਦੇ ਕੋਲ ਆਉਂਦੇ ਤਾਂ ਇਹ ਉਨ੍ਹਾਂ ਲਈ ਵਧੀਆ ਹੁੰਦਾ। ਅਤੇ ਅੱਲਾਹ ਮੁਆਫ਼ੀ ਦੇਣ ਵਾਲਾ ਰਹਿਮਤ ਵਾਲਾ ਹੈ।",
            "verse 49:6": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਜੇਕਰ ਕੋਈ ਇਨਕਾਰੀ ਤੁਹਾਡੇ ਕੋਲ ਕੋਈ ਖ਼ਬਰ ਲੈ ਕੇ ਆਵੇ ਤਾਂ ਤੁਸੀਂ ਉਸ ਨੂੰ ਚੰਗੀ ਤਰ੍ਹਾਂ ਜਾਂਚ ਲਿਆ ਕਰੋ। ਕਿਤੇ ਅਜਿਹਾ ਨਾ ਹੋਵੇ ਕਿ ਤੁਸੀਂ ਅਗਿਆਨਤਾ ਵੱਸ ਕਿਸੇ ਸਮੂਹ ਦਾ ਨੁਕਸਾਨ ਕਰ ਦੇਵੋਂ। ਫਿਰ ਤੁਹਾਨੂੰ ਆਪਣੇ ਕੀਤੇ ਤੇ ਪਛਤਾਉਣਾ ਪਵੇ।",
            "verse 49:7": "ਅਤੇ ਜਾਣ ਲਵੋਂ ਕਿ ਤੁਹਾਡੇ ਵਿਚਕਾਰ ਅੱਲਾਹ ਦਾ ਰਸੂਲ ਹੈ। ਜੇਕਰ ਉਹ ਬਹੁਤ ਸਾਰੇ ਮਾਮਲਿਆਂ ਵਿਚ ਤੁਹਾਡੀ ਗੱਲ ਮੰਨ ਲਵੇ ਤਾਂ ਤੂਸੀਂ ਬੜੀ ਮੁਸ਼ਕਲ ਵਿਚ ਫਸ ਜਾਵੋ। ਪਰੰਤੂ ਅੱਲਾਹ ਨੇ ਤੁਹਾਡੇ ਲਈ ਈਮਾਨ ਨੂੰ ਪਿਆਰਾ ਬਣਾ ਦਿੱਤਾ ਅਤੇ ਤੁਹਾਡੇ ਦਿਲਾਂ ਵਿਚ ਉਸ ਦਾ ਪ੍ਰੇਮ ਪਾ ਦਿੱਤਾ। ਅਤੇ ਅੱਲਾਹ ਦੀ ਅਵੱਗਿਆ, ਅਧਰਮ ਅਤੇ ਪਾਪ ਨੂੰ ਤੁਹਾਡੇ ਲਈ ਨਾ-ਪਸੰਦ ਬਣਾ ਦਿੱਤਾ।",
            "verse 49:8": "ਅਜਿਹੇ ਲੋਕ ਹੀ ਅੱਲਾਹ ਦੀ ਕਿਰਪਾ ਅਤੇ ਰਹਿਮਤ ਨਾਲ ਚੰਗੇ ਰਾਹ ਤੇ ਹਨ ਅਤੇ ਅੱਲਾਹ ਜਾਣਨ ਵਾਲਾ ਬਿਬੇਕ ਵਾਲਾ ਹੈ।",
            "verse 49:9": "ਅਤੇ ਜੇਕਰ ਈਮਾਨ ਵਾਲਿਆਂ ਦੇ ਦੋ ਸਮੂਹ ਆਪਿਸ ਵਿਚ ਲੜ ਪੈਣ ਤਾਂ ਉਨ੍ਹਾਂ ਵਿਚ ਸਮਝੌਤਾ ਕਰਵਾਉ। ਫਿਰ ਜੇਕਰ ਉਨ੍ਹਾਂ ਵਿੱਚੋਂ ਇੱਕ ਸਮੂਹ ਦੂਜੇ ਸਮੂਹ ਤੇ ਜ਼ੁਲਮ ਕਰੇ ਤਾਂ ਤੁਸੀਂ ਉਸ ਸਮੂਹ ਨਾਲ ਲੜੋਂ ਜਿਹੜਾ ਜ਼ੁਲਮ ਕਰਦਾ ਹੈ, ਇੱਥੋਂ ਤੱਕ ਕਿ ਉਹ ਅੱਲਾਹ ਦੇ ਹੁਕਮ ਵੱਲ ਵਾਪਿਸ ਆ ਜਾਣ। ਫਿਰ ਜਦੋਂ ਉਹ ਵਾਪਿਸ ਆਉਣ ਤਾਂ ਉਨ੍ਹਾਂ ਦੇ ਵਿਚਕਾਰ ਨਿਆਇ ਦੇ ਸਹਿਤ ਸਮਝੌਤਾ ਕਰਵਾਉ ਅਤੇ ਇਨਸਾਫ਼ ਕਰੋਂ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਇਨਸਾਫ਼ ਕਰਨ ਵਾਲਿਆਂ ਨੂੰ ਪਸੰਦ ਕਰਦਾ ਹੈ।",
            "verse 49:10": "ਈਮਾਨ ਵਾਲੇ ਸਾਰੇ ਭਰਾ ਹਨ, ਸੋ ਆਪਣੇ ਭਰਾਵਾਂ ਦੇ ਵਿਚਕਾਰ ਮੇਲ-ਮਿਲਾਪ ਕਰਵਾਉ ਅਤੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋਂ ਤਾਂ ਕਿ ਤੁਹਾਡੇ ਉੱਪਰ ਰਹਿਮਤ ਕੀਤੀ ਜਾਵੇ।",
            "verse 49:11": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਨਾ ਆਦਮੀ ਦੂਸਰੇ ਆਦਮੀਆਂ ਦਾ ਮਜ਼ਾਕ ਉਡਾਉਣ ਹੋ ਸਕਦਾ ਹੈ ਕਿ ਉਹ ਉਨ੍ਹਾਂ ਤੋਂ ਉੱਤਮ ਹੋਂਵੇ। ਅਤੇ ਨਾ ਔਰਤਾਂ ਦੂਸਰੀਆਂ ਔਰਤਾਂ ਦਾ ਮਜ਼ਾਕ ਉਡਾਉਣ ਹੋ ਸਕਦਾ ਹੈ ਕਿ ਉਹ ਉਨ੍ਹਾਂ ਤੋਂ ਉੱਤਮ ਹੌਣ। ਅਤੇ ਨਾ ਇੱਕ ਦੂਸਰੇ ਤੇ ਵਿਅੰਗ ਕਸਿਆ ਕਰੋਂ ਅਤੇ ਨਾ ਇੱਕ ਦੂਜੇ ਨੂੰ ਮਾੜੇ ਉਪ ਨਾਵਾਂ ਨਾਲ ਬੁਲਾਵੇਂ। ਈਮਾਨ ਲਿਆਉਣ ਤੋਂ ਬਾਅਦ ਪਾਪ ਦਾ ਨਾਮ ਦੇਣਾ ਮਾੜਾ ਹੈ ਅਤੇ ਜਿਹੜਾ ਇਸ ਤੋਂ’ ਨਾ ਰੁੱਕੇ ਉਹ ਲੋਕ ਜ਼ਾਲਿਮ ਹਨ।",
            "verse 49:12": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਬਹੁਤ ਸਾਰੇ ਅੰਦਾਜ਼ਿਆਂ ਤੋਂ ਬਚੋ ਕਿਉਂਕਿ ਕੁਝ ਅੰਦਾਜ਼ੇ ਪਾਪ ਹੁੰਦੇ ਹਨ ਅਤੇ (ਇੱਕ ਦੂਜੇ ਦੀ) ਟੋਹ ਵਿਚ ਨਾ ਲੱਗੇ ਰਿਹਾ ਕਰੋਂ। ਅਤੇ ਤੁਹਾਡੇ ਵਿਜ਼ੋਂ ਕੋਈ ਕਿਸੇ ਦੀ ਪਿੱਠ ਪਿੱਛੇ ਜ਼ੁਗਲੀ ਨਾ ਕਰੇ। ਕੀ ਤੁਹਾਡੇ ਵਿਜ਼ੋਂ ਕੋਈ ਇਸ ਗੱਲ ਨੂੰ ਪਸੰਦ ਕਰੇਗਾ ਕਿ ਉਹ ਆਪਣੇ ਮਰੇ ਹੋਏ ਭਰਾ ਦਾ ਮਾਸ ਖਾਵੇ, ਇਸ ਨੂੰ ਤੁਸੀਂ ਖੁਦ ਮਾੜਾ ਸਮਝਦੇ ਹੋ। ਅਤੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋਂ ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਰਹਿਮਤ ਕਰਨ ਵਾਲਾ ਹੈ।",
            "verse 49:13": "ਹੈ ਲੋਕੋ! ਅਸੀਂ ਤੁਹਾਨੂੰ ਇੱਕ ਆਦਮੀ’ ਅਤੇ ਇੱਕ ਔਰਤ ਤੋਂ ਪੈਦਾ ਕੀਤਾ ਅਤੇ ਤੁਹਾਨੂੰ ਜਾਤੀਆਂ ਅਤੇ ਪਰਿਵਾਰਾਂ ਵਿਚ ਵੰਡ ਦਿੱਤਾ ਤਾਂ ਕਿ ਤੁਸੀਂ ਇੱਕ ਦੂਸਰੇ ਨੂੰ ਪਛਾਣੋ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਦੇ ਨੇੜੇ ਤੁਹਾਡੇ ਵਿਚੋ’ ਜ਼ਿਆਦਾ ਇੱਜ਼ਤ ਵਾਲਾ ਉਹ ਹੈ ਜਿਹੜਾ ਸਭ ਤੋਂ ਜ਼ਿਆਦਾ (ਜੀਵਨ ਵਿੱਚ) ਸੰਜਮ ਰੱਖਦਾ ਹੈ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਜਾਣਨ ਵਾਲਾ ਅਤੇ ਖ਼ਬਰ ਰੱਖਣ ਵਾਲਾ ਹੈ।",
            "verse 49:14": "ਅਰਬ ਆਖਦੇ ਹਨ, ਕਿ ਅਸੀਂ ਈਮਾਨ ਲਿਆਏ। ਆਖੋ, ਕਿ ਤੁਸੀਂ ਈਮਾਨ ਨਹੀ’ ਲਿਆਏ। ਸਗੋ’`ਇਸ ਤਰ੍ਹਾਂ ਆਖੋ, ਕਿ ਅਸੀਂ ਇਸਲਾਮ ਨੂੰ ਸਵੀਕਾਰ ਕੀਤਾ। ਅਜੇ ਤੱਕ ਈਮਾਨ ਤੁਹਾਡੇ ਦਿਲਾਂ ਵਿਚ ਦਾਖ਼ਲ ਨਹੀਂ ਹੋਇਆ। ਅਤੇ ਜੇਕਰ ਤੁਸੀਂ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲਾਂ ਦੀ ਆਗਿਆ ਦਾ ਪਾਲਣ ਕਰੋਂ ਤਾਂ ਅੱਲਾਹ ਤੁਹਾਡੇ ਕਰਮਾਂ ਵਿਚ ਕੋਈ ਕਮੀ ਨਹੀਂ ਕਰੇਗਾ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਰਹਿਮਤ ਵਾਲਾ ਹੈ।",
            "verse 49:15": "ਮੌਮਿਨ ਤਾਂ ਸਿਰਫ਼ ਉਹ ਹਨ ਜਿਹੜੇ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲਾਂ ਤੇ ਈਮਾਨ ਲਿਆਉਣ। ਫਿਰ ਉਨ੍ਹਾਂ ਨੇ ਸ਼ੱਕ ਨਾ ਕੀਤਾ ਅਤੇ ਆਪਣੀ ਜਾਇਦਾਦ ਅਤੇ ਪ੍ਰਾਣਾਂ ਦੇ ਸਹਿਤ ਅੱਲਾਹ ਦੇ ਰਾਹ ਵਿਚ ਜਿਹਾਦ ਕੀਤਾ, ਇਹ ਸੱਚੇ ਲੋਕ ਹਨ।",
            "verse 49:16": "ਆਖੋਂ, ਕੀ ਤੁਸੀਂ ਅੱਲਾਹ ਨੂੰ ਆਪਣੇ ਦੀਨ ਨਾਲ ਸੂਚਿਤ ਕਰ ਰਹੇ ਹੋ, ਜਦੋਂ ਕਿ ਅੱਲਾਹ ਜਾਣਦਾ ਹੈ ਜੋ ਕੁਝ ਆਕਾਸ਼ਾਂ ਵਿਚ ਅਤੇ ਧਰਤੀ ਵਿਚ ਹੈ। ਅੱਲਾਹ ਸਭ ਕੁਝ ਜਾਨਣ ਵਾਲਾ ਹੈ।",
            "verse 49:17": "ਇਹ ਲੋਕ ਤੁਹਾਡੇ ਤੇ ਅਹਿਸਾਨ ਕਰਦੇ ਹਨ ਕਿ ਉਨ੍ਹਾਂ ਨੇ ਇਸਲਾਮ ਸਵੀਕਾਰ ਕੀਤਾ ਹੈ। ਆਖੋ, ਕਿ ਆਪਣੇ ਇਸਲਾਮ ਦਾ ਅਹਿਸਾਨ ਮੇਰੇ ਤੇ ਨਾ ਕਰੋ। ਸਗੋਂ ਅੱਲਾਹ ਨੇ ਤੁਹਾਡੇ ਤੇ ਉਪਕਾਰ ਕੀਤਾ ਹੈ, ਕਿ ਉਸ ਨੇ ਤੁਹਾਨੂੰ ਈਮਾਨ ਦਾ ਰਾਹ ਦਿਖਾਇਆ ਹੈ। ਜੇ ਤੁਸੀਂ ਸੱਚੇ ਹੋ।",
            "verse 49:18": "ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਧਰਤੀ ਅਤੇ ਆਕਾਸ਼ਾਂ ਦੀਆਂ ਗੁੱਝੀਆਂ ਗੱਲਾਂ ਨੂੰ ਜਾਣਦਾ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਉਹ ਦੇਖਦਾ ਹੈ ਜਿਹੜਾ ਕੁਝ ਤੁਸੀਂ ਕਰਦੇ ਹੋ।"
        },
        "Roman english": {
            "verse 49:1": "Yaa ayyuhal lazeena aamanoo la tuqaddimoo baina yada yil laahi wa Rasoolihee wattaqul laah; innal laaha samee`un `Aleem",
            "verse 49:2": "Yaa ayyuhal lazeena aamanoo laa tarfa`ooo aswaatakum fawqa sawtin Nabiyi wa laa tajharoo lahoo bilqawli kajahri ba`dikum liba `din an tahbata a `maalukum wa antum laa tash`uroon",
            "verse 49:3": "Innal lazeena yaghud doona aswaatahum `inda Rasoolil laahi ulaaa`ikal lazeenam tah anal laahu quloobahum littaqwaa; lahum maghfiratunw waajrun `azeem",
            "verse 49:4": "Innal lazeena yunaadoo naka minw waraaa`il hujuraati aksaruhum laa ya`qiloon",
            "verse 49:5": "Wa law annahum sabaroo hatta takhruja ilaihim lakaana khairal lahum; wallaahu Ghafoorur Raheem",
            "verse 49:6": "Yaaa ayyuhal lazeena aamanoo in jaaa`akum faasqum binaba in fatabaiyanooo an tuseeboo qawmam bijahalatin fatusbihoo `alaa maa fa`altum naadimeen",
            "verse 49:7": "Wa`lamooo anna feekum Rasoolal laah; law yutee`ukum fee kaseerim minal amrila`anittum wa laakinnal laaha habbaba ilaikumul eemaana wa zaiyanahoo fee quloobikum wa karraha ilaikumul kufra walfusooqa wal`isyaan; ulaaaika humur raashidoon",
            "verse 49:8": "Fadlam minal laahi wa ni`mah; wallaahu `Aleemun Hakeem",
            "verse 49:9": "Wa in taaa`ifataani minal mu`mineenaq tataloo faaslihoo bainahumaa fa-im baghat ih daahumaa `alal ukhraa faqaatilul latee tabhee hattaa tafeee`a ilaaa amril laah; fa-in faaa`t fa aslihoo bainahumaa bil`adli wa aqsitoo innal laaha yuhibbul muqsiteen",
            "verse 49:10": "Innamal mu`minoona ikhwatun fa aslihoo baina akhawaykum wattaqul laaha la`allakum tuhamoon",
            "verse 49:11": "Yaaa ayyuhal lazeena aamanoo laa yaskhar qawmum min qawmin `asaaa anyyakoonoo khairam minhum wa laa nisaaa`um min nisaaa`in `Asaaa ay yakunna khairam minhunna wa laa talmizooo bil alqaab; bi`sal ismul fusooqu ba`dal eemaan; wa mal-lam yatub fa-ulaaa`ika humuz zaalimoon",
            "verse 49:12": "Yaaa ayyuhal lazeena aamanuj taniboo kaseeram minaz zanni inna ba`daz zanniismunw wa laa tajassasoo wa la yaghtab ba`dukum ba`daa; a yuhibbu ahadukum any yaakula lahma akheehi maitan fakarih tumooh; wattaqul laa; innal laaha tawwaabur Raheem",
            "verse 49:13": "Yaaa ayyuhan naasu innaa khalaqnaakum min zakarinw wa unsaa wa ja`alnaakum shu`oobanw wa qabaaa`ila lita`aarafoo inna akramakum `indal laahi atqaakum innal laaha `Aleemun khabeer",
            "verse 49:14": "Qaalatil-A `raabu aamannaa qul lam tu`minoo wa laakin qoolooo aslamnaa wa lamma yadkhulil eemaanu fee quloobikum wa in tutee`ul laaha wa Rasoolahoo laa yalitkum min a`maalikum shai`aa; innal laaha Ghafoorur Raheem",
            "verse 49:15": "Innamal muu`minoonal lazeena aamanoo billaahi wa Rasoolihee summa lam yartaaboo wa jaahadoo biamwaalihim wa anfusihim fee sabeelil laah; ulaaaika humus saadiqoon",
            "verse 49:16": "Qul atu`allimoonal laaha bideenikum wallaahu ya`lamu maa fis samaawaati wa maa fil ard; wallaahu bikulli shai`in `Aleem",
            "verse 49:17": "Yamunnoona `alaika an aslamoo qul laa tamunnoo `alaiya Islaamakum balillaahu yamunnu `alaikum an hadaakum lil eemaani in kuntum saadiqeen",
            "verse 49:18": "Innal laaha ya`lamu ghaibas samaawaati wal ard; wallaahu baseerum bimaa ta`maloon"
        },
        "Russian": {
            "verse 49:1": "О вы, кто верует! (В решениях и действиях своих) Себя перед Аллахом и посланником Его ни в чем не выставляйте, Страшитесь (разгневить) Его, - Он, истинно, все слышит и все знает!",
            "verse 49:2": "О вы, кто верует! Не возвышайте голос свой Над голосом Господнего пророка И громким голосом речь не ведите с ним, Как вы порою обращаетесь друг к другу, Чтобы поступки ваши тщетными не стали, А вы к тому ж не ведали об этом.",
            "verse 49:3": "Ведь те, кто пред посланником Аллаха голос понижает, Суть те, сердца которых испытал на благочестие Аллах, - Их ждет прощение и щедрая награда.",
            "verse 49:4": "А те, кто громко из покоев тебя кличет, - Они же, в большинстве своем, Любого разуменья лишены.",
            "verse 49:5": "И если б им терпения хватило подождать, Пока ты сам к ним выйдешь, Для них бы это было лучше, - Аллах ведь всепрощающ, милосерд!",
            "verse 49:6": "О вы, кто верует! Коль человек злонравный с вестью к вам придет, То постарайтесь истинность сей вести уточнить, Чтоб по неведению своему Зла не причинить (невинным) людям, А после не раскаиваться в том, что сделал.",
            "verse 49:7": "И знайте, что средь вас - посланник от Аллаха, И если бы в делах мирских Он часто следовал советам вашим, Вы б претерпели много бед. Но вдохновил на веру вас Аллах, Что красотой своею озарила ваше сердце. Он сделал ненавистными для вас Неверие, злонравие и непокорство; Вот таковы - идущие прямым путем",
            "verse 49:8": "По милости и щедрости Аллаха, - Исполнен знания и мудрости Аллах!",
            "verse 49:9": "А коль средь тех, кто верует, Одни вступили в спор с другими, Вы примирите их. Но если же один из них несправедлив к другому, Боритесь с ним, пока не обратится он к велению Аллаха. Когда же обратится он, Мирите честно их и беспристрастно, - Аллаху любы те, кто беспристрастен.",
            "verse 49:10": "Ведь те, кто верует, - в едином братстве, А потому - мирите ваших братьев, Страшитесь гнева Господа, и этим Вы обретете милосердие Его.",
            "verse 49:11": "О вы, кто верует! Одним мужчинам непристойно Высмеивать других мужчин: Быть может, те, другие, лучше первых. И женщинам высмеивать других - грешно: Быть может, те, другие, лучше первых. (В глазах других) друг друга не порочьте, Обидных прозвищ не давайте, - Ведь, истинно, порочить (своих братьев) После того, как веру обрели вы, Злонравно и грешно пред Богом. И тот, кто этого не прекратит, Действительно злонравен.",
            "verse 49:12": "О вы, кто верует! (С особым тщанием) Себя от подозрительности берегите, - Бывают случаи, в которых она становится грехом; И не подсматривайте друг за другом, И за спиной друг друга не злословьте. Захочет кто-нибудь из вас есть мясо умершего брата? Вам омерзительно бы это было! А потому страшитесь (гнева) Господа, - Ведь обращающ Он и милосерден!",
            "verse 49:13": "О люди! Мы сотворили вас от (пары): мужа и жены. И создали из вас (семейные) роды и (разные) народы, Чтоб вы могли друг друга знать. Ведь пред Аллахом самый чтимый - тот, Кто праведней из всех вас станет. Поистине, Аллах всезнающ и ведает о всем и вся!",
            "verse 49:14": "А бедуины говорят: \"Уверовали мы\". Скажи им: \"Нет в вас веры. Вам лучше говорить: \"Смирились мы\", - Ведь в ваше сердце вера не вошла. Но если станете послушны вы Аллаху и посланнику Его, Ни в чем награды за деянья ваши Он не умалИт\", - Поистине, Аллах всемилостив и всепрощающ!",
            "verse 49:15": "И верующие - только те, Которые в Аллаха и посланника Его Уверовали (всей душой и сердцем) И вслед сомнениями не терзались, А отдавали средства все и душу, Сражаясь на Его пути. И лишь такие - искренни (и на словах, и в деле).",
            "verse 49:16": "Скажи: \"Ужель вы станете Аллаху сообщать о вашей вере? Ведь знает Он о всем, что суще и в небесах, и на земле, - Аллах о всякой вещи знающ!\"",
            "verse 49:17": "Они вменяют милостью тебе, Что приняли они ислам. Скажи: \"Вы свой ислам как милость мне не представляйте. Аллах Своею милостью почтил вас, Указывая путь вам к вере, Коль вы, поистине, правдивы\".",
            "verse 49:18": "Аллаху, истинно, известно все, Что в небесах и на земле сокрыто. Он видит все, что делаете вы!"
        },
        "Sindhi": {
            "verse 49:1": "اي ايمان وارؤ الله ۽ سندس پيغمبر جي آڏو اڳرائي نه ڪريو ۽ الله کان ڊڄو، بيشڪ الله ٻڌندڙ ڄاڻندڙ آھي.",
            "verse 49:2": "اي ايمان وارؤ پنھنجا آواز پيغمبر جي آواز کان مٿي نه ڪريو ۽ جيئن اوھان جو ھڪ ٻئي سان وڏي سڏ ڳالھائڻ آھي (تئين) ساڻس ڳالھ ڏاڍيان نه ڳالھايو جو متان اوھان جا عمل چٽ ٿي وڃن ۽ اوھين نه پروڙيندا ھجو.",
            "verse 49:3": "بيشڪ جيڪي پنھنجن آوازن کي الله جي پيغمبر جي آڏو جھڪو ڪندا آھن اِھي اُھي آھن جن جي دلين کي الله پرھيزگاريءَ لاءِ آزمايو آھي، اُنھن لاءِ بخشش ۽ وڏو اجر آھي.",
            "verse 49:4": "بيشڪ جيڪي حُجرن جي ٻاھران توکي سڏيندا آھن تن مان گھڻا بي سمجھ آھن.",
            "verse 49:5": "جيڪڏھن اُھي تنھنجي ڏانھُن نڪرڻ تائين صبر ڪن ھا ته اُنھن لاءِ ڀَلو ھُجي ھا، ۽ الله بخشڻھار مھربان آھي.",
            "verse 49:6": "اي ايمان وارؤ جيڪڏھن ڪو بدڪار ڪا خبر اوھان وٽ آڻي ته جاچ ڪريو جو (متان) ڪنھن قوم کي بي خبريءَ سان نقصان پھچايو پوءِ جيڪي اوھان ڪري چڪؤ تنھن تي پشيمان ٿيو.",
            "verse 49:7": "۽ ڄاڻو ته اوھان ۾ الله جو پيغمبر آھي، جيڪڏھن گھڻن ڪمن ۾ ھو اوھان جو چيو مڃيندو ته اوھين ڏکيا ٿيندؤ پر الله اوھان وٽ ايمان کي پيارو ڪرايو ۽ اوھان جي دلين ۾ ان کي چڱو ڪري ڏيکاريائين ۽ اوھان وٽ ڪفر ۽ بي ديني ۽ گناھ کي ناپسند ڪرايائين، اھي سڌي رستي وارا آھن.",
            "verse 49:8": "الله جي فضل ۽ احسان سان، ۽ الله ڄاڻندڙ حڪمت وارو آھي.",
            "verse 49:9": "۽ جيڪڏھن مؤمنن جون ٻه ٽوليون پاڻ ۾ وڙھن ته سندن وچ ۾ صُلح ڪريو، پوءِ جيڪڏھن انھن مان ھڪڙي ٻي تي زيادتي ڪري ته جيڪا زيادتي ٿي ڪري تنھن سان وڙھو جيسين تائين الله جي حُڪم ڏانھن موٽي اچي، پوءِ جيڪڏھن موٽي آئي ته سندن وچ ۾ انصاف سان صُلح ڪريو ۽ انصاف سان ھلو، ڇوته الله انصاف وارن کي پيارو رکندو آھي.",
            "verse 49:10": "مؤمن ته سڀ ڀائر آھن تنھنڪري پنھنجي ٻنھي ڀائرن جي وچ ۾ صلح ڪريو، ۽ الله کان ڊڄو ته مانَ اوھان تي ٻاجھ ڪئي وڃي.",
            "verse 49:11": "اي ايمان وارؤ ڪا ٽولي ڪنھن ٽولي تي ٺـٺولي نه ڪري جو متان اُھي اُنھن کان ڀلا ھجن ۽ نه زالون ٻـين زالن سان (ٺـٺوليون ڪن) جو متان اُھي اُنھن کان ڀَليون ھجن، ۽ نڪي پاڻ ۾ (ھڪ ٻئي کي) عيب لايو ۽ نڪي ھڪ ٻئي کي بڇڙن لقبن سان سڏيو، (جو) ايمان آڻڻ کانپوءِ بي دينيءَ جو نالو (پوڻ) خراب آھي، ۽ جن توبه نه ڪئي سي ئي ظالم آھن.",
            "verse 49:12": "اي ايمان وارؤ گھڻو ڪري گمان کان بچو، بيشڪ ڪي گمان گناھ آھن ۽ نڪي جاسوسي ڪريو ۽ نڪو ڪو اوھان مان ھڪ ٻئي جي گلا ڪري، ڀلا اوھان مان ڪو ھڪڙو پنھنجي مُئي ڀاءُ جو گوشت کائڻ پسند ڪندو آھي ڇا جنھن کان نفرت ڪندا آھيو، ۽ الله کان ڊڄو، بيشڪ الله توبه قبول ڪندڙ مھربان آھي.",
            "verse 49:13": "اي ماڻھؤ بيشڪ اسان اوھان کي ھڪ مڙس ۽ ھڪ زال مان پيدا ڪيو ۽ اوھان کي ذاتيون ۽ پاڙا ڪيوسون ته ھڪ ٻئي کي سڃاڻو، بيشڪ اوھان مان تمام عزت وارو الله وٽ اُھو آھي جيڪو اوھان مان ڏاڍو پرھيزگار آھي، بيشڪ الله ڄاڻندڙ خبر رکندڙ آھي.",
            "verse 49:14": "جھنگلي چوندا آھن ته ايمان اندو اٿون، (اي پيغمبر کين) چؤ ته (حقيقت ڪري) ايمان نه آندو اٿو پر (ايئن) چؤ ته اسين مُسلمان ٿيا آھيون ۽ اڃا اوھان جي دلين ۾ ايمان گھڙيو (ئي) نه آھي، ۽ جيڪڏھن الله ۽ سندس پيغمبر جو چيو مڃيندؤ ته اوھان جي عملن مان اوھان کي ڪجھ (به) نه گھٽائيندو، بيشڪ الله بخشڻھار مھربان آھي.",
            "verse 49:15": "مؤمن رڳو اُھي آھن جن الله ۽ سندس پيغمبر تي ايمان آندو وري (ڪو) شڪ نه ڪيائون ۽ الله جي واٽ ۾ پنھنجن مالن ۽ پنھنجن جُسن سان جھاد ڪيائون، اھي ئي سچا آھن.",
            "verse 49:16": "(اي پيغمبر کين) چؤ ته پنھنجو دين الله کي ڄاڻائيندا آھيو ڇا؟ ۽ جيڪي آسمانن ۾ آھي ۽ جيڪي زمين ۾ آھي سو سڀ الله ڄاڻندو آھي، ۽ الله سڀڪنھن شيءَ کي ڄاڻندڙ آھي.",
            "verse 49:17": "(اي پيغمبر) اسلام آڻڻ جو توتي احسان رکندا آھن، چوينِ ته مون تي پنھنجي اسلام (آڻڻ) جو احسان نه رکو، بلڪ اوھان تي الله احسان رکندو آھي جو اوھان کي ايمان جي ھدايت ڪيائين جيڪڏھن سچا آھيو.",
            "verse 49:18": "بيشڪ الله آسمانن ۽ زمين جو ڳجھ ڄاڻندو آھي، ۽ جيڪي ڪندا آھيو سو الله ڏسندڙ آھي."
        },
        "Sinhalese": {
            "verse 49:1": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලා අල්ලාහ් හා ඔහුගේ දූතයාණන් ඉදිරියේ අබිබවා නොයනු. තවද නුඹලා අල්ලාහ්ට බිය බැතිමත් වනු. නියත වශයෙන්ම අල්ලාහ් සර්ව ශ්‍රාවකය; සර්ව ඥානීය.",
            "verse 49:2": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලාගේ හඬ නබිවරයාගේ හඬට වඩා උස් නොකරනු. නුඹලා ඇතැමෙකු ඇතැමෙකුට සැරෙන් කතා කරනවාක් මෙන් ඔහුට හඬා නගා සැරෙන් කතා නොකරනු. එවිට නුඹලා නොදැනුවත්වම නුඹලාගේ ක්‍රියාවන් නිෂ්ඵල වී යනු ඇත.",
            "verse 49:3": "නියත වශයෙන්ම අල්ලාහ්ගේ දූතයාණන් අබියස ඔවුන්ගේ හඬ පහත් කරන්නන් වනාහි තම හදවත් බිය බැතිමත්භාවය සඳහා පරීක්ෂාවට ලක් කළවුන් ඔවුහුමය. ඔවුනට සමාව හා මහත් වූ ප්‍රතිඵල ඇත.",
            "verse 49:4": "නියත වශයෙන්ම කුටි වලට පිටින් සිට නුඹ ව අමතන්නන් වනාහි ඔවුන්ගෙන් බහුතරයක් දෙනා වටහා නොගන්නා අය වෙති.",
            "verse 49:5": "තවද නුඹ ඔවුන් වෙත (නිවසින්) බැහැර ව පැමිණෙන තෙක් නියත වශයෙන්ම ඔවුන් ඉවසා සිටියේ නම් එය ඔවුනට යහපත් වන්නට තිබුණි. තවද අල්ලාහ් අති ක්ෂමාශීලීය; මහාකරුණාන්විතය.",
            "verse 49:6": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලා වෙත දුෂ්ඨයෙකු යම් පුවතක් ගෙන ආවේ නම්, නුඹලා නොදැනුවත් ව පිරිසකට හානියක් සිදු කර පසු ව නුඹලා සිදු කළ දෑ ගැන පසුතැවිලිවන්නන් බවට පත් නොවනු පිණිස, නුඹලා (එය) පැහැදිලි කර ගනු.",
            "verse 49:7": "තවද නියත වශයෙන්ම නුඹලා අතර අල්ලාහ්ගේ දූතයාණන් සිටින බව දැන ගනු. කරුණු බොහෝමයක ඔහු නුඹලාට අවනත වූයේ නම් නුඹලා පීඩාවට ගොදුරු වනු ඇත. එනමුත් නුඹලා වෙත අල්ලාහ් දේව විශ්වාසය පිළිබඳ කැමැත්ත ඇති කළේය. තවද එය නුඹලාගේ හදවත් තුළ අලංකාරවත් කළේය. තවද නුඹලා වෙත දේව ප්‍රතික්ෂේපය, පාපකම හා පිටුපෑම ඔහු පිළිකුල් කෙරෙව්වේය. යහමග සිටින්නෝ ඔවුහුමය.",
            "verse 49:8": "(එය) අල්ලාහ්ගෙන් වූ අනුග්‍රහයක් හා ආශිර්වාදයක් වශයෙනි. තවද අල්ලාහ් සර්ව ඥානීය; මහා ප්‍රඥාවන්තය.",
            "verse 49:9": "දේවත්වය විශ්වාසව කරන්නන් අතරින් දෙපිරිසක් සටන් ඇරඹුවේ නම්, ඒ දෙක අතර නුඹ සමාදානය ඇති කරනු. ඒ දෙපිරිසෙන් එකක් අනෙකා මත සීමාව ඉක්මවා කටයුතු කළේ නම් අල්ලාහ්ගේ නියෝගය වෙත නැඹුරු වන තෙක් සීමාව ඉක්මවා ගියවුන්ට එරෙහිව නුඹලා සටන් කරනු. නමුත් එය නැඹුරු වූයේ නම් ඒ දෙපිරිස අතර සාධාරණ ලෙසින් සමථය කරනු. තවද නුඹලා යුක්ති ගරුක ව කටයුතු කරනු. නියත වශයෙන්ම අල්ලාහ් යුක්තිගරුක ව කටයුතු කරන්නන්ව ප්රිය කරයි.",
            "verse 49:10": "නියත වශයෙන්ම දේවත්වය විශ්වාස කරන්නෝ සහෝදරයෝය. එහෙයින් නුඹලාගේ (විවාද කරන) සහෝදරයින් අතර සමථය කරනු. තවද නුඹලා කරුණාව ලැබිය හැකි වනු පිණිස අල්ලාහ්ට බිය බැතිමත් වනු.",
            "verse 49:11": "අහෝ දේවත්වය විශ්වාස කළවුනි! පිරිසක් තවත් පිරිසකට සමච්චල් නොකළ යුතුය. ඔවුන් මොවුනට වඩා යහපත් විය හැක. එමෙන්ම කාන්තාවෝ තවත් කාන්තාවන්ට සමච්චල් නොකළ යුතුය. ඔවුන් මොවුනට වඩා යහපත් විය හැක. තවද නුඹලා අතර දොස් නොකියනු. තවද පටබැඳි නම් වලින් නුඹලා එකිනෙකා ආමන්ත්‍රණය නොකරනු. දේව විශ්වාසයෙන් පසු ව එවන් පාපතර නාමයන් (පවසා ඇමතීම) නපුරුය. තවද කවරෙකු පාප සමාව අයැද නොසිටියේද එවිට ඔවුහුමය අපරාධකරුවෝ.",
            "verse 49:12": "අහෝ දේවත්වය විශ්වාස කළවුනි! බොහෝ අනුමානයන්ගෙන් නුඹලා වැළකී සිටිනු. නියත වශයෙන්ම ඇතැම් අනුමාන පාපතරය. තවද නුඹලා ඔත්තු නොබලනු. තවද නුඹලාගෙන් ඇතැමෙක් ඇතැමෙකු ගැන කේලාම් නොකිව යුතුය. නුඹලා අතරින් කිසිවෙකු හෝ මිය ගිය තම සහෝදරයාගේ මාංශ අනුභව කිරීමට ප්රිය කරන්නේ ද? නුඹලා එය පිළිකුල් කරන්නෙහුය. තවද නුඹලා අල්ලාහ්ට බිය බැතිමත් වනු. නියත වශයෙන්ම අල්ලාහ් පශ්චාත්තාපය පිළිගන්නාය; මහා කරුණාන්විතය.",
            "verse 49:13": "අහෝ මිනිසුනි! නියත වශයෙන්ම අපි පිරිමියකුගෙන් හා කාන්තාවකගෙන් නුඹලා ව මවා ඇත්තෙමු. තවද නුඹලා එකිනෙකා හඳුනා ගනු පිණිස ඔහු නුඹලා විවධ ජනවාර්ගිකයින් හා ගෝත්‍රිකයින් බවට නුඹලාව අපි පත් කළෙමු. නියත වශයෙන්ම අල්ලාහ් අබියස නුඹලාගෙන් වඩාත් උතුම් වනුයේ නුඹලා අතරින් වඩාත් බියබැතිමත් වූවන්ය. නියත වශයෙන්ම අල්ලාහ් සර්ව ඥානීය; මහා අභිඥානවන්තය.",
            "verse 49:14": "“අපි විශ්වාස කළෙමු” යැයි ගැමි අරාබිවරුන් පැවසුවෝය. “නුඹලා විශ්වාස නොකළේමය. නමුත් අපි අවනත වූයෙමු යැයි නුඹලා පවසනු. නුඹලාගේ සිත් තුළට දේව විශ්වාසය ඇතුළු වූයේ නැත. තවද නුඹලා අල්ලාහ්ට හා ඔහුගේ දූතයාණන්ට අවනත වන්නෙහු නම් නුඹලාගේ ක්‍රියාවන්ගෙන් කිසිවක් ඔහු අඩු නොකරනු ඇත. නියත වශයෙන්ම අල්ලාහ් අති ක්ෂමාශීලීය; මහාකරුණාන්විතය.”",
            "verse 49:15": "නියත වශයෙන්ම දේවත්වය විශ්වාස කරන්නන් වනුයේ අල්ලාහ් හා ඔහුගේ දූතයාණන් ගැන විශ්වාස කොට පසු ව (ඒ ගැන) සැක නොකර තම ධනය හා තම ජීවිත අල්ලාහ්ගේ මාර්ගයේ කැප කළවුන් වෙති. ඔවුහුමය සත්‍යවාදීහු.",
            "verse 49:16": "“නුඹලාගේ දහම නුඹලා අල්ලාහ්ට උගන්වන්නෙහු දැ”යි (නබිවරය!) නුඹ විමසනු. තවද අල්ලාහ් අහස්හි ඇති දෑ හා මහපොළොවේ ඇති දෑ දනී. තවද අල්ලාහ් සියලු දෑ පිළිබඳ ව සර්වඥය.",
            "verse 49:17": "(නබිවරය!) ඔවුන් ඉස්ලාමය වැළඳ ගැනීම නුඹ වෙත කරන උපකාරයක් ලෙස ඔවුහු සලකති. නමුත්. “නුඹලා නුඹලාගේ ඉස්ලාමය මා වෙත කරන උපකාරයක් ලෙස නොසලකනු. නමුත් නුඹලා සත්‍යවාදීන් නම් දේව විශ්වාසය වෙත නුඹලාට අල්ලාහ් මග පෙන්වීමෙන් ඔහු නුඹලා වෙත උපකාර කර ඇතැ”යි නුඹ පවසනු.",
            "verse 49:18": "නියත වශයෙන්ම අල්ලාහ් අහස්හි හා මහපොළොවේ අදෘශ්යමාන දෑ පිළිබඳ ව දනී. තවද නුඹලා සිදු කරන දෑ පිළිබඳ ව අල්ලාහ් සර්ව නිරීක්ෂකය."
        },
        "Somali": {
            "verse 49:1": "Kuwa xaqarumeeyow ha ku dagdagina Eebe iyo Rasuulkiisa hortiisa (waxayan fasixin), Eebana ka dhawrsada ileen wax walba wuu maqli wuuna ogyahaye.",
            "verse 49:2": "Kuwa xaqa rumeeyow ha ka koryeelina codkiinna codka Nabiga, hana kula jahrina (qaylina) hadal sida qaarkiin qaar ugula jahro (qaylyo) si aan camalkiinnu u burin idinkoon agayn.",
            "verse 49:3": "kuwa codkooda hoos u dhiga Rasuulka agtiisa kuwaasi waa kuwo Eebe imtixaanay quluubtooda dhawrsasho darteed, waxayna mudanyihiin dambi dhaaf iyo ajri wayn.",
            "verse 49:4": "kuwa kaaga dhawaaqi qolalka gadaashooda badankoodu wax ma kasayaan.",
            "verse 49:5": "Hadday samraan intaad uga soo bixi yaa u khayr badnaan lahayda, Eebana waa dambi dhaafe naxariista,",
            "verse 49:6": "Kuwa xaqa rumeeyow hadduu idiinla yimaaddo faasiq war, hubsada, si aydaan dad u dhibin ogaansho la'aan, markaasna aad shallaydaan waxaad fasheen.",
            "verse 49:7": "Ogaadana in Rasuulkii Eebe idin dhexjoogo, hadduu idinku addeeco waxyaala hadanna aad dhibboonaysaan, wuxuuse Eebe idinla jeclaaday limaan, una qurxiyay quluubtiinna, wuxuuna idinla nacay gaalnimo, faasiqnimo iyo caasinnimo, kuwaasina waa kuwa hanuunsan.",
            "verse 49:8": "Waa fadliga (siinta) Eebe iyo naxriistiisa, Eebana wax walba waa ogyahay, waana falsame.",
            "verse 49:9": "Hadday Laba qolo oo mu'miniinta ah dagaallamaan heshiisiiya dhexdooda, hadday midu ku xadgudubto tan kale la dirira tan xadgudubtay intay amarka Eebe uga noqoto (xaqa aqoonsato), Hadday u noqotana si caddaalad ah u wanaajiya dhexdooda una garsoora, Eebe wuxuu jecelahay kuwa garsooree.",
            "verse 49:10": "Mu'miniintu waa uun walaala, ee wanaajiya walaalihiin dhexdooda, Eebana ka dhawrsada, waxaad u dhawdihiin inuu idiin naxariistee.",
            "verse 49:11": "Kuwa xaqa rumeeyow yuuna yasin Ragna Rag (kale) waxay u dhawdahay inuu ka khayr badanyahaye, Haweenna yayna haween yasin waxay u dhawyihiin inay ka khayr badanyihiine, hana ceebeynina Naftiinna, hana isugu dhawaaqina naanays xun, waxaa xun magaca faasiqinimada iimaan kadib, Ciddaan tawbad keeninna waa daalimiin.",
            "verse 49:12": "Kuwa xaqa rumeeyow ka dhawrsada wax badan oo mala ah, maxaa yeelay malaha qaarkiis waa dambi, hana is jaasuusina, qaarkiinna qaar yuusan xamanin, miyuu jecelyahay midkiinna inuu cuno Hilibka walaalkiis oo mayd ah, waad necebtihiin arrintaa, Eebana ka dhawrsada waa tooba aqbale naxariistee.",
            "verse 49:13": "Dadow waxaan idinka abuuray lab iyo dhaddig, waxaana idinka yeellay shucuub iyo qabiilooyin si aad isu aqoonsataan, Ruuxase ugu sharaf badan Eebe agtiisa waa ka idiinku dhawrsasho badan, Eebana wax walba waa ogyahay,",
            "verse 49:14": "Waxay dheheen ree baadiyihii carbeed waan rumaynay (xaqa), waxaad ku dhahdaa maydaan rumaynin, laakiin dhaha waan hoggansannay, Iimaankuna wali Quluubtiinna ma galin, haddaadse adeecdaan Eebe iyo Rasuulkiisa kama nusqaamiyo camalkiinna waxba, Eebana waa dambi dhaafe naxariista.",
            "verse 49:15": "Kuwa mu'miniinta ah waa kuwa uun rumeeyay Eebe iyo Rasuulkiisa oon shakiyin, kuna Jahada Xoolahooda iyo naftooda jidka Eebe dartiis, kuwaasi waa kuwa runlowga ah.",
            "verse 49:16": "Waxaad dhahdaa ma Eebbaad usheegaysaan diintiinna isagoo og waxa Samaawaadka iyo Dhulkaba ku sugan, Eebana wax walba waa ogyahay.",
            "verse 49:17": "Waxau kugu mannaysan inay Islaameen, waxaad dhahdaa haygu mannaysanina Islaamkiinna Eebaa manna idinku leh inuu idinku hanuuniyay Iimaanka haddaad run sheegeysaan.",
            "verse 49:18": "Eebe waa ogyahay waxa Samaawaadka ku maqan iyo dhulkaba, Eebana waa arkaa waxaad camal falaysaan."
        },
        "Spanish": {
            "verse 49:1": "Vosotros que creéis! No os adelantéis a Allah y a Su mensajero y temed a Allah, Él es Quien oye y Quien sabe.",
            "verse 49:2": "Vosotros que creéis! No subáis la voz por encima de la del Profeta ni le habléis a voces como hacéis entre vosotros, no vaya a ser que vuestras obras se malogren sin daros cuenta.",
            "verse 49:3": "Los que bajan la voz en presencia del Mensajero de Allah, son ésos a los que Allah les ha abierto el corazón a Su temor.Tendrán perdón y una enorme recompensa.",
            "verse 49:4": "Esos que te llaman desde la parte de atrás de las habitaciones privadas en su mayoría no razonan.",
            "verse 49:5": "Más les valdría esperar pacientemente a que salieras ante ellos. Y Allah es Perdonador y Compasivo.",
            "verse 49:6": "Vosotros que creéis! Si alguien, que no es digno de confianza, os llega con una noticia, aseguraos antes; no vaya a ser que, por ignorancia, causéis daño a alguien y tengáis luego que arrepentiros de lo que hicisteis.",
            "verse 49:7": "Y sabed que entre vosotros está el Mensajero de Allah y que si os obedeciera en muchos asuntos ya habríais caído en la perdición. Pero Allah os ha hecho amar la creencia, haciéndola hermosa en vuestros corazones, y ha hecho que detestéis la incredulidad, la perversión y la desobediencia.Esos son los rectamente guiados.",
            "verse 49:8": "Favor de Allah y merced. Y Allah es Conocedor y Sabio.",
            "verse 49:9": "Y si dos bandos de creyentes luchan entre sí, reconciliadlos, pero si uno de ellos abusa del otro, combatid al que haya abusado hasta que vuelva a la orden de Allah; y si lo hace, arreglad las cosas entre ellos con justicia y siendo equitativos. Es cierto que Allah ama a los equitativos.",
            "verse 49:10": "Los creyentes son, en realidad, hermanos; reconciliad pues a vuestros hermanos y temed a Allah para que se os pueda dar misericordia.",
            "verse 49:11": "Vosotros que creéis! Que no se burlen unos hombres de otros porque pudiera ser que éstos fueran mejores que ellos. Ni unas mujeres de otras, porque pudiera ser que éstas fueran mejores que ellas.Y no os difaméis unos a otros ni os insultéis con apodos.Malo es dar un nombre de perversión después de ser creyente.Y quien no se vuelva en arrepentimiento... Esos son los injustos.",
            "verse 49:12": "Vosotros que creéis! Abandonad muchas de las suposiciones.Es cierto que algunas de ellas son delito. Y no os espiéis unos a otros ni habléis mal de otros cuando no estén presentes.Acaso le gustaría a uno de vosotros comer la carne de su hermano muerto? Os resultaría horrible.Y temed a Allah pues realmente Allah acepta a quien se vuelve a Él y es Compasivo.",
            "verse 49:13": "Hombres! Os hemos creado a partir de un varón y de una hembra y os hemos hecho pueblos y tribus distintos para que os reconocierais unos a otros.Y en verdad que el más noble de vosotros ante Allah es el que más Le teme.Allah es Conocedor y está perfectamente informado.",
            "verse 49:14": "Dicen los beduinos: Creemos. Di: No creéis. Decid más bien: Nos hemos sometido pero aún no ha entrado en vuestros corazones la creencia. Pero si obedecéis a Allah y a Su mensajero, no menoscabará nada de vuestras acciones; es cierto que Allah es Perdonador, Compasivo.",
            "verse 49:15": "Los creyentes son aquellos que, habiendo creído en Allah y en Su mensajero, no dudan después; y luchan con sus bienes y sus personas en el camino de Allah.Esos son los veraces.",
            "verse 49:16": "Di: Es que pretendéis enseñarle a Allah cómo debéis adorarlo, cuando Allah sabe lo que hay en los cielos y en la tierra y cuando Allah es Conocedor de cada cosa?",
            "verse 49:17": "Te echan en cara haber entrado en Islam.Di: No me echéis en cara vuestro Islam, sino que por el contrario es Allah Quien os ha favorecido a vosotros al haberos guiado a la creencia, si sois sinceros.",
            "verse 49:18": "Es verdad que Allah conoce lo desconocido de los cielos y la tierra. Y Allah ve lo que hacéis."
        },
        "Swahili": {
            "verse 49:1": "Enyi mlio amini! Msitangulie mbele ya Mwenyezi Mungu na Mtume wake, na mcheni Mwenyezi Mungu. Hakika Mwenyezi Mungu ni Mwenye kusikia, Mwenye kujua.",
            "verse 49:2": "Enyi mlio amini! Msinyanyue sauti zenu kuliko sauti ya Nabii, wala msiseme naye kwa kelele kama mnavyo semezana nyinyi kwa nyinyi, visije vitendo vyenu vikaharibika, na hali hamtambui.",
            "verse 49:3": "Kwa hakika wanao teremsha sauti zao mbele ya Mtume wa Mwenyezi Mungu, hao ndio Mwenyezi Mungu amezisafisha nyoyo zao kwa uchamngu. Hao watakuwa na maghfira na ujira mkubwa.",
            "verse 49:4": "Hakika hao wanao kuita nawe uko nyuma ya vyumba, wengi wao hawana akili.",
            "verse 49:5": "Na lau wao wangeli ngojea mpaka uwatokee ingeli kuwa kheri kwao. Na Mwenyezi Mungu ni Mwenye maghfira, Mwenye kurehemu.",
            "verse 49:6": "Enyi mlio amini! Akikujieni mpotovu na khabari yoyote, ichunguzeni, msije mkawasibu watu kwa kuto jua, na mkawa tena wenye kujuta kwa mliyo yatenda.",
            "verse 49:7": "Na jueni kuwa Mtume wa Mwenyezi Mungu yuko nanyi. Lau angeli kut'iini katika mambo mengi, bila ya shaka mngeli taabika. Lakini Mwenyezi Mungu amekupendezeeni Imani, na akaipamba katika nyoyo zenu, na amekufanyeni muuchukie ukafiri, na upotovu, na uasi. Hao ndio walio ongoka,",
            "verse 49:8": "Kwa fadhila za Mwenyezi Mungu na neema zake. Na Mwenyezi Mungu ni Mwenye kujua, Mwenye hikima.",
            "verse 49:9": "Na ikiwa makundi mawili katika Waumini yanapigana, basi yapatanisheni. Na likiwa moja la hao linamdhulumu mwenzie, basi lipigeni linalo dhulumu mpaka lirejee kwenye amri ya Mwenyezi Mungu. Na likirudi basi yapatanisheni kwa uadilifu. Na hukumuni kwa haki. Hakika Mwenyezi Mungu anawapenda wanao hukumu kwa haki.",
            "verse 49:10": "Hakika Waumini ni ndugu, basi patanisheni baina ya ndugu zenu, na mcheni Mwenyezi Mungu ili mrehemewe.",
            "verse 49:11": "Enyi mlio amini! Wanaume wasiwadharau wanaume wenzao, wala wanawake wasiwadharau wanawake wenzao. Huenda hao wakawa bora kuliko wao. Wala msivunjiane hishima, wala msiitane kwa majina ya kejeli. Ni uovu kutumia jina baya baada ya kwisha amini. Na wasio tubu, hao ndio wenye kudhulumu.",
            "verse 49:12": "Enyi mlio amini! Jiepusheni na dhana nyingi, kwani baadhi ya dhana ni dhambi. Wala msipelelezane, wala msisengenyane nyinyi kwa nyinyi. Je! Yupo katika nyinyi anaye penda kuila nyama ya nduguye aliye kufa? Mnalichukia hilo! Na mcheni Mwenyezi Mungu. Hakika Mwenyezi Mungu ni Mwenye kupokea toba, Mwenye kurehemu.",
            "verse 49:13": "Enyi watu! Hakika Sisi tumekuumbeni kutokana na mwanamume na mwanamke. Na tumekujaalieni kuwa ni mataifa na makabila ili mjuane. Hakika aliye mtukufu zaidi kati yenu kwa Mwenyezi Mungu ni huyo aliye mchamngu zaidi katika nyinyi. Hakika Mwenyezi Mungu ni Mwenye kujua, Mwenye khabari.",
            "verse 49:14": "Mabedui wamesema: Tumeamini. Sema: Hamjaamini, lakini semeni: Tumesilimu. Kwani Imani haijaingia katika nyoyo zenu. Na mkimt'ii Mwenyezi Mungu na Mtume wake, hatakupunguzieni chochote katika vitendo vyenu. Hakika Mwenyezi Mungu ni Mwenye kusamehe, Mwenye kurehemu.",
            "verse 49:15": "Hakika Waumini ni wale walio muamini Mwenyezi Mungu na Mtume wake tena wasitie shaka kabisa, na wakapigana Jihadi katika Njia ya Mwenyezi Mungu kwa mali yao na nafsi zao. Hao ndio wakweli.",
            "verse 49:16": "Sema: Ati ndio mnamfundisha Mwenyezi Mungu Dini yenu, na hali Mwenyezi Mungu anayajua ya katika mbingu na ardhi, na Mwenyezi Mungu anajua kila kitu?",
            "verse 49:17": "Wanakusimbulia kuwa wamesilimu! Sema: Msinisimbulie kwa kusilimu kwenu. Bali Mwenyezi Mungu ndiye aliye kufanyieni hisani kwa kukuongoeni kwenye Imani, ikiwa nyinyi ni wakweli.",
            "verse 49:18": "Hakika Mwenyezi Mungu anajua siri za mbingu na ardhi. Na Mwenyezi Mungu anayaona myatendayo."
        },
        "Swedish": {
            "verse 49:1": "TROENDE! Pocka inte på uppmärksamhet för egen del, när ni står inför Gud och Hans Sändebud, men frukta Gud! Gud hör allt, vet allt!",
            "verse 49:2": "Troende! Dränk inte med era röster Profetens ord och höj inte rösten när ni talar till honom, som ni gör sinsemellan; annars kan det [goda] ni gör gå om intet utan att ni förstår [vad som sker]!",
            "verse 49:3": "De som sänker rösten i Sändebudets närvaro är de vars hjärtan Gud har gjort redo för gudsfruktan; för dem finns förlåtelse och en rik belöning.",
            "verse 49:4": "De flesta av dem som högljutt kallar på dig, när du [Muhammad] befinner dig i de inre rummen, är människor som inte tänker sig för.",
            "verse 49:5": "Det vore bäst för dem om de gav sig till tåls tills du kommer ut till dem, men Gud är ständigt förlåtande, barmhärtig.",
            "verse 49:6": "TROENDE! Om en människa som inte åtnjuter stadgat rykte [för tillförlitlighet] kommer till er med en upplysning, försök då reda ut [vad som är sanning], så att ni inte utan att inse det tillfogar [andra] skada och sedan måste ångra vad ni gjort.",
            "verse 49:7": "Och tänk på att det är Guds Sändebud ni har mitt ibland er; om han var gång ni lägger fram ett problem lyssnade till era [åsikter], kunde det vålla er svårigheter. Men Gud har gjort tron dyrbar för er och visat era hjärtan dess skönhet och Han har ingjutit i er avsky mot förnekandet av sanningen och mot all synd och olydnad. De [som beskrivs på detta sätt] är de som följer den raka vägen",
            "verse 49:8": "tack vare Guds nåd och Hans godhet; Gud är allvetande, vis.",
            "verse 49:9": "Om två grupper av troende skulle råka i delo med varandra, försök då mäkla fred mellan dem, men om den ena [gruppen] grovt kränker den andras rätt, ingrip då mot de skyldiga tills de fogar sig efter Guds bud; och, om de fogar sig, medla då mellan dem båda med rättvisa och opartiskhet. Gud älskar de opartiska.",
            "verse 49:10": "De troende är bröder. Försona därför två bröder [som är oense] och frukta Gud - kanske skall ni erfara barmhärtighet.",
            "verse 49:11": "TROENDE! Män skall inte göra narr av andra män - det kan hända att de som de gör narr av är bättre än de själva. Och kvinnor skall inte göra narr av andra kvinnor - det kan hända att de som de gör narr av är bättre än de själva. Och förtala inte varandra och ge inte varandra skamliga öknamn; det är gement, troende emellan, att använda öknamn som leder tanken till synd och lastbarhet, och de som [beter sig så och] inte ångrar det gör sig skyldiga till en svår orätt.",
            "verse 49:12": "Troende! Undvik i möjligaste mån att göra lösa antaganden [och förmoda det ena och det andra om varandra]; det kan ligga synd i sådana antaganden. Och spionera inte på varandra och tala inte illa om andra bakom deras rygg. [Eller] skulle någon av er vilja äta sin döde broders kött? Nej, den [tanken] skulle ni finna vämjelig! Och frukta Gud! I Sin barmhärtighet går Gud den ångerfulle till mötes!",
            "verse 49:13": "Människor! Vi har skapat er av en man och en kvinna, och Vi har samlat er i folk och stammar för att ni skall lära känna varandra. Inför Gud är den av er den bäste vars gudsfruktan är djupast. Gud vet allt, är underrättad om allt.",
            "verse 49:14": "ÖKENARABERNA säger: ”Vi har blivit troende.” Svara [dem, Muhammad]: ”[Ännu] än ni inte troende – säg hellre: 'Vi har underkastat oss Guds vilja'! Ännu har inte [sann] tro vunnit insteg i era hjärtan. Men om ni [med ärligt uppsåt] lyder Gud och Hans Sändebud skall Han inte låta er gå miste om någon del av [lönen för] era handlingar; Gud är ständigt förlåtande, barmhärtig.”",
            "verse 49:15": "Inga andra än de som tror på Gud och Hans Sändebud och som inte vacklar i tron och de som kämpar för Guds sak med sina ägodelar och med livet som insats är [verkliga] troende; det är de som är uppriktiga [i sin bekännelse av tron].",
            "verse 49:16": "Säg: \"Vill ni underrätta Gud om [beskaffenheten av] er tro, fastän det är Gud som känner allt det som himlarna rymmer och det som jorden bär? Gud har vetskap om allt!\"",
            "verse 49:17": "De [tror att de] har gett dig något [Muhammad] när de underkastade sig Guds vilja. Säg: \"Er underkastelse under Guds vilja är inte en gåva till mig; nej, det är en Guds välgärning mot er att Han har velat leda er till tron - om er bekännelse är sann.\"",
            "verse 49:18": "Gud känner himlarnas och jordens dolda verklighet - och Gud ser allt vad ni gör."
        },
        "Tajik": {
            "verse 49:1": "Эй касоне, ки имон овардаед, бар Худову паёмбари Ӯ пешдастӣ макунед ва аз Худо битарсед, зеро Худо шунавову доност!",
            "verse 49:2": "Эй касоне, ки имон овардаед, садои худро аз садои паёмбар баландтар накунед ва ҳамчунон, ки бо якдигар баланд сухан мегӯед, бо ӯ ба овози баланд сухан нагӯед, ки амалҳоятон ночиз шавад ва шумо огоҳ нашавед.",
            "verse 49:3": "Касоне, ки дар назди паёмбари Худо садояшонро поин меоваранд, ҳамонҳоянд, ки Худо дилҳояшонро ба такво озмуда аст. Онҳоро бахшоишу музди бисёр аст.",
            "verse 49:4": "Онҳое, ки аз он сӯи ҳуҷраҳо туро нидо медиҳанд, бештар бехирадонанд.",
            "verse 49:5": "Агар сабр, мекарданд, то ту худ берун меомадӣ ва назди онҳо мерафтӣ, барояшон беҳтар мебуд ва Худо бахшояндаи меҳрубон аст!",
            "verse 49:6": "Эй касоне, ки имон овардаед, агар фосиқе бароятон хабаре овард, таҳқиқ кунед, мабод аз рӯи нодонӣ ба мардуме осеб (ранҷ) бирасонед, он гоҳ, аз коре, ки кардаед, пушаймон шавед.",
            "verse 49:7": "Ва бидонед, ки паёмбари Худо дар миёни шумост. Агар дар бисёре аз корҳо аз шумо фармон бибарад, ба ранҷ меафтед. Вале Худо имонро маҳбуби шумо сохт ва онро дар дилатон биорост ва куфру фисқу нофармониро дар назаратон бад гардонид. Инҳо худ роҳёфтагонанд.",
            "verse 49:8": "Бахшишу неъматест аз ҷониби Худо ва Худо донову ҳаким аст!",
            "verse 49:9": "Ва агар ду гурӯҳ аз мӯъминон бо якдигар ба чанг бархостанд, миёнашон оштӣ андозед. Ва агар як гурӯҳ бар дигаре даст дарозӣ кард, бо он ки даст дарозӣ кардааст, биҷангед, то ба фармони Худо бозгардад. Пас агар бозгашт, миёнашон сулҳе одилона барқарор кунед ва адолат кунед, ки Худо одилонро дӯст дорад,",
            "verse 49:10": "Ҳар оина (Албатта) мӯъминон бародаронанд. Миёни бародаронатон оштӣ андозед ва аз Худо битарсед, шояд, ки бар шумо раҳмат орад.",
            "verse 49:11": "Эй касоне, ки имон овардаед, мабод, ки гурӯҳе аз мардон гурӯҳи дигарро масхара кунад, шояд он масхарашудагон беҳтар аз онҳо бошанд. Ва мабод, ки гурӯҳе аз занон гурӯҳи дигарро масхара кунад, шояд он масхарашудагон беҳтар аз онҳо бошанд. Ва аз ҳам айбчӯй макунед ва якдигарро ба лақабҳои зишт махонед. Бад аст унвони фисқ пас аз имон овардан. Ва касоне, ки тавба намекунанд, худ ситамкоронанд.",
            "verse 49:12": "Эй касоне, ки имон овардаед, аз бисёре аз гумонҳо бипарҳезед. Зеро баъзе аз гумонҳо дар ҳадди гуноҳ аст. Ва дар корҳои пинҳонии якдигар ҷосусӣ макунед. Ва аз якдигар ғайбат макунед. Оё ҳеҷ як аз шумо дӯст дорад, ки гӯшти бародари мурдаи худро бихӯрад? Пас онро нохуш хоҳед дошт. Ва аз Худо битарсед, зеро Худо тавбапазиру меҳрубон аст!",
            "verse 49:13": "Эй мардум, мо шуморо аз як марду як зан биёфаридем. Ва шуморо ҷамоъатҳо ва қабилаҳо кардем, то якдигарро бишиносед. Албатта гиромитарини шумо назди Худо парҳезгортарини шумост. Худо донову кордон аст!",
            "verse 49:14": "Аъроби бодиянишин гуфтанд: «Имон овардем!» Бигӯ: «Имон наёва. рдаед. Бигӯед, ки таслим шудаем ва ҳанӯз имон дар дилҳоятон дохил нашудааст. Ва агар Худову паёмбарашро итоъат кунед, аз савоби амалҳои шумо кам карда намешавад, зеро Худо бахшояндаву меҳрубон аст».",
            "verse 49:15": "Мӯьминон касоне ҳастанд, ки ба Худову паёмбари Ӯ имон овардаанд ва дигар шак накардаанд ва бо молу ҷони худ дар роҳи Худо ҷиҳод кардаанд. Инҳо ростгӯёнанд.",
            "verse 49:16": "Бигӯ: «Оё мехоҳед Худоро аз диндории худ огоҳ кунед? Ҳол он ки Худо аз ҳар чӣ дар осмонҳову ҳар чӣ дар замин аст, огоҳ аст ва Ӯ ба ҳар чизе олим аст!»",
            "verse 49:17": "Аз ин ки ислом овардаанд, бар ту миннат мекунанд. Бигӯ: «Ба хотири исломатон бар ман миннат мекунед, балки Худо ба он сабаб, ки шуморо ба имон роҳ намудааст, бар шумо миннат мениҳад, агар рост мегӯед!»",
            "verse 49:18": "Албатта Худо ниҳони осмонҳову заминро медонад ва ба ҳар коре, ки мекунед, биност!"
        },
        "Tamil": {
            "verse 49:1": "முஃமின்களே! அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும் முன்னர் (பேசவதற்கு) நீங்கள் முந்தாதீர்கள்; அல்லாஹ்விடம் பயபக்தியுடன் இருங்கள்; நிச்சயமாக அல்லாஹ் (யாவற்றையும்) செவியுறுபவன்; நன்கறிபவன்.",
            "verse 49:2": "முஃமினகளே! நீங்கள் நபியின் சப்தத்திற்கு மேலே, உங்கள் சப்தங்களை உயர்த்தாதீர்கள்; மேலும், உங்களுக்குள் ஒருவர் மற்றொருவருடன் இரைந்து பேசவதைப் போல், அவரிடம் நீங்கள் இரைந்து போசாதீர்கள், (இவற்றால்) நீங்கள் அறிந்து கொள்ள முடியாத நிலையில் உங்கள் அமல்கள் அழிந்து போகும்.",
            "verse 49:3": "நிச்சயமாக, எவர்கள் அல்லாஹ்வுடைய தூதரின் முன்பு, தங்களுடைய சப்தங்களைத் தாழ்த்திக் கொள்கிறார்களோ அ(த்தகைய)வர்களின் இதயங்களை அல்லாஹ் பயபக்திக்காகச் சோதனை செய்கிறான் - அவர்களுக்கு மன்னிப்பும், மகத்தான் கூலியும் உண்டு.",
            "verse 49:4": "(நபியே!) நிச்சயமாக, எவர்கள் (உம்) அறைகளுக்கு வெளியே இருந்து உம்மை இரைந்து அழைக்கிறார்களோ, அவர்களில் பெரும்பாலோர் விளங்கிக் கொள்ளாதவர்களே!",
            "verse 49:5": "நீர் அவர்களிடம் வெளிப்பட்டு வரும் வரையில், அவர்கள் பொறுத்திருந்தார்களானால், அது அவர்களுக்கு நலமாக இருக்கும்; (எனினும்) அல்லாஹ் மிக மன்னப்பவன்; மிக்க கிருபையுடையவன்.",
            "verse 49:6": "முஃமின்களே! ஃபாஸிக் (தீயவன்) எவனும் உங்களிடம் ஒரு செய்தியைக் கொண்டு வந்தால், அதைத் தீர்க்க விசாரித்துக் கொள்ளுங்கள்; (இல்லையேல்) அறியாமையினால் (குற்ற மற்ற) ஒரு சமூகத்தாருக்கு நீங்கள் தீங்கு செய்து விடலாம்; பின்னர் நீங்கள் செய்தவை பற்றி நீங்களே கைசேதப் படுபவர்களாக (கவலைப்படுபவர்களாக) ஆவீர்கள்.",
            "verse 49:7": "அறிந்துகொள்ளுங்கள்; நிச்சயமாக உங்களிடையே அல்லாஹ்வின் தூதர் இருக்கிறார்; அநேக காரியங்களில் அவர் உங்களுக்கு வழிப்பட்டால், திடமாக நீங்கள் தாம் கஷ்டத்திற்குள்ளாவீர்கள், எனினும் அல்லாஹ் ஈமானை (நம்பிக்கையை) உங்களுக்குப் பிரியமுடையதாக்கி உங்கள் இதயங்களிலும் அதனை அழகாக்கியும் வைத்தான் - அன்றியும் குஃப்ரையும் (நிராகரிப்பையும்) பாவத்தையும், மாறுபாடு செய்வதையும் உங்களுக்கு வெறுப்பாகவும் ஆக்கினான்; இத்தகையவர்கள் தாம் நேர்வழியில் நடப்பவர்கள்.",
            "verse 49:8": "(இது) அல்லாஹ்விடமிருந்துள்ள அனுக்கிரமும், அருள்கொடையினாலுமேயாகும், மேலும் அல்லாஹ் நன்கறிந்தவன்; ஞானம் மிக்கோன்.",
            "verse 49:9": "முஃமின்களில் இருசாரார் தங்களுக்குள் சண்டை செய்து கொண்டால், அவ்விருசாராருக்கிடையில் சமாதானம் உண்டாக்குங்கள். பின்னர் அவர்களில் ஒரு சாரார் மற்றவர் மீது அக்கிரமம் செய்தால், அக்கிரமம் செய்வோர் அல்லாஹ்வுடைய கட்டளையின் பால் திரும்பும் வரையில், (அவர்களுடன்) போர் செய்யுங்கள்; அவ்வாறு, அவர்கள் (அல்லாஹ்வின் பால்) திரும்பி விட்டால் நியாயமாக அவ்விரு சாராரிடையே சமாதானம் உண்டாக்குங்கள். (இதில்) நீங்கள் நீதியுடன் நடந்து கொள்ளுங்கள். நிச்சயமாக அல்லாஹ் நீதியாளர்களை நேசிக்கிறான்.",
            "verse 49:10": "நிச்சயமாக முஃமின்கள் (யாவரும்) சகோரர்களே ஆகவே, உங்கள் இரு சகோதரர்களுக்கிடையில் நீங்கள் சமாதானம் உண்டாக்குங்கள்; இன்னும் உங்கள் மீது கிருபை செய்யப்படும் பொருட்டு, நீங்கள் அல்லாஹ்வை அஞ்சங்கள்.",
            "verse 49:11": "முஃமின்களே! ஒரு சமூகத்தார் பிறியதொரு சமூகத்தாரைப் பரிகாசம் செய்ய வேண்டாம். ஏனெனில் (பரிகசிக்கப்படுவோர்), அவர்களைவிட மேலானவர்களாக இருக்கலாம்; (அவ்வாறே) எந்தப் பெண்களும், மற்றெந்தப் பெண்களையும் (பரிகாசம் செய்ய வேண்டாம்) - ஏனெனில் இவர்கள் அவர்களை விட மேலானவர்களாக இருக்கலாம்; இன்னும், உங்களில் ஒருவருக்கொருவர் பழித்துக் கொள்ளாதீர்கள், இன்னும் (உங்களில்) ஒருவரையொருவர் (தீய) பட்டப்பெயர்களால் அழைக்காதீர்கள்; ஈமான் கொண்டபின் (அவ்வாறு தீய) பட்டப் பெயர் சூட்டுவது மிகக் கெட்டதாகும்; எவர்கள் (இவற்றிலிருந்து) மீளவில்லையோ, அத்தகையவர்கள் அநியாயக்காரர்கள் ஆவார்கள்.",
            "verse 49:12": "முஃமின்களே! (சந்தேகமான) பல எண்ணங்களிலிருந்து விலகிக் கொள்ளுங்கள்; ஏனெனில் நிச்சயமாக எண்ணங்களில் சில பாவங்களாக இருக்கும்; (பிறர் குறைகளை) நீங்கள் துருவித் துருவி ஆராய்ந்து கொண்டிராதீர்கள்; அன்றியும், உங்களில் சிலர் சிலலைப் பற்றிப் புறம் பேசவேண்டாம், உங்களில் எவராவது தம்முடைய இறந்த சகோதரனின் மாமிசத்தைப் புசிக்க விரும்புவாரா? (இல்லை!) அதனை நீங்கள் வெறுப்பீர்கள். இன்னும், நீங்கள் அல்லாஹ்வை அஞ்சங்கள். நிச்சயமாக பாவத்திலிருந்து மீள்வதை அல்லாஹ் ஏற்றுக் கொள்பவன்; மிக்க கிருபை செய்பவன்.",
            "verse 49:13": "மனிதர்களே! நிச்சயமாக நாம் உங்களை ஓர் ஆண், ஒரு பெண்ணிலிருந்தே படைத்தோம்; நீங்கள் ஒருவரை ஒருவர் அறிந்து கொள்ளும் பொருட்டு. பின்னர், உங்களைக் கிளைகளாகவும், கோத்திரங்களாகவும் ஆக்கினோம்; (ஆகவே) உங்களில் எவர் மிகவும் பயபக்தியுடையவராக இருக்கின்றாரோ, அவர்தாம் அல்லாஹ்விடத்தில், நிச்சயமாக மிக்க கண்ணியமானவர். நிச்சயமாக அல்லாஹ் நன்கறிபவன், (யாவற்றையும் சூழந்து) தெரிந்தவன்.",
            "verse 49:14": "\"நாங்களும் ஈமான் கொண்டோம்\" என்று (நபியே! உம்மிடம்) நாட்டுப் புறத்து அரபிகள் கூறுகிறார்கள், \"நீங்கள் ஈமான் கொள்ளவில்லை. எனினும் 'நாங்கள் வழிபட்டோம்' (இஸ்லாத்தைத் தழுவினோம்) என்று (வேண்டுமானால்) கூறுங்கள் (என நபியே! அவர்களிடம்) கூறுவீராக. \"ஏனெனில் உங்களுடைய இதயங்களில் (உண்மையான) ஈமான் நுழையவில்லை மேலும், நீங்கள் அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும் வழிப்பட்டு நடப்பீர்களாயின் அவன் உங்களுடைய நற்செய்கைகளில், எதையும் உங்களுக்குக் குறைக்க மாட்டான்\" நிச்சயமாக அல்லாஹ் மிக மன்னிப்பவன்; மிக்க கிருபையுடையவன்.",
            "verse 49:15": "நிச்சயமாக, (உண்மையான) முஃமின்கள் யார் என்றால், அவர்கள் அல்லாஹ்வின் மீதும், அவனுடைய தூதர் மீதும், ஈமான் கொண்டு, பின்னர் (அது பற்றி அவர்கள் எத்தகைய) சந்தேகமும் கொள்ளாது, தம் செல்வங்களைக் கொண்டும், தம் உயிர்களைக் கொண்டும் அல்லாஹ்வின் பாதையில் தியாகம் செய்வார்கள் - இத்தகையவர்கள் தாம் உண்மையாளர்கள்.",
            "verse 49:16": "\"நீங்கள் உங்கள் மார்க்க (வழிபாடுகள்) பற்றி அல்லாஹ்வுக்கு அறிவிக்(க விரும்பு)கறீர்களோ? அல்லாஹ்வோ வானங்களிலுள்ளவற்றையும், பூமியிலுள்ளவற்றையும் நன்கு அறிகிறான் - அன்றியும், அல்லாஹ் எல்லாப் பொருள்களையும் நன்கறிகிறவன்\" என்று (நபியே!) நீர் கூறும்.",
            "verse 49:17": "அவர்கள் இஸ்லாம் மார்க்கத்தைத் தழுவியதால், உமக்கு உபகாரம் செய்து விட்டதாகக் கருதுகிறார்கள்; \"நீங்கள் இஸ்லாம் மார்க்கத்தைத் தழுவியதால் எனக்கு உபகாரம் செய்து விட்டதாகக் கருதாதீர்கள்; எனினும், நீங்கள் உண்மையாளர்களாக இருப்பின் ஈமானின் நேர் வழியில் உங்களைச் சேர்த்ததனால் அல்லாஹ் தான் உங்கள் மீது உபகாரம் செய்திருக்கிறான்\" என்று (நபியே!) நீர் கூறுவீராக.",
            "verse 49:18": "\"நிச்சயமாக அல்லாஹ் வானங்களிலும், பூமியிலுமுள்ள மறைவானவற்றை (யெல்லாம்) நன்கறிகிறான்; அன்றியும் அல்லாஹ் நீங்கள் செய்பவற்றை பார்த்துக் கொண்டிருக்கின்றான்."
        },
        "Tatar": {
            "verse 49:1": "Ий мөэминнәр! Дин эшләрендә Аллаһудан вә Аның рәсүленнән узып үз белдегегез белән сүз сөйләмәгез, вә Аллаһудан куркыгыз, Аңа гөнаһлы булудан сакланыгыз! Бит Аллаһ ишетүче вә белүчедер.",
            "verse 49:2": "Ий мөэминнәр, тавышларыгызны пәйгамбәр тавышыннан артык күтәрмәгез, вә бер-берегезгә кычкырып сөйләгәнегез кеби пәйгамбәргә кычкырып сөйләмәгез, гамәлләрегезнең юкка чыгу ихтималы булганы өчен, әмма үзегез юкка чыкканны сизмәссез.",
            "verse 49:3": "Аллаһ расүле янында тавышларын түбән кылучы мөэминнәрнең күңелен Аллаһ тәкъвалык өчен сынады, аларга гафу ителү вә олугъ әҗер бардыр.",
            "verse 49:4": "Дөреслектә сиңа хөҗрәләреңнең артыннан кычкырып дәшүчеләр дә бар, алар үзләренә файдалы булган эшне аңламыйлар.",
            "verse 49:5": "Әгәр сабыр иткән булсалар син алар катына чыкканча әлбәттә, алар өчен яхшырак булыр иде. Әлбәттә, Аллаһ аларның әдәпсезлек кылганнарын ярлыкаучы вә рәхимледер.",
            "verse 49:6": "Ий мөэминнәр, әгәр бер фәсыйк сезгә бер хәбәрне китерсә, ул хәбәрне тикшерегез, сездән бер кавемгә зарар ирешмәсен өчен ул хәбәрне белмәү сәбәпле, әгәр тикшермичә эш кылсагыз кылган эшләрегезгә үкенүчеләр булып әверелерсез.",
            "verse 49:7": "Белегез, ий мөэминнәр, сезнең эчегездә Аллаһ расүле бар, аңа итагать итегез, әгәр дә күп эшләрдә пәйгамбәр сезгә итагать итсә иде, әлбәттә, гөнаһка төшәр идегез, ләкин Аллаһ сезгә иманны сөйдерде вә ул иманны сезнең күңелегездә күркәм кылды, дәхи сезгә кәферне, бозыклыкны һәм гөнаһларны яман күрсәтте, бу кешеләр туры юлга күнелүчеләрдер.",
            "verse 49:8": "Аллаһуның юмартлыгы вә нигъмәте белән, Аллаһ иманыгызны белүче вә хикмәт белән эш кылучыдыр.",
            "verse 49:9": "Әгәр мөэминнәрдән ике төркем сугышсалар, араларын төзәтегез, ягъни һәр икесен Коръән белән гамәл кылырга чакырыгыз, әгәр бу ике төркемнең берсе Коръәнгә килүдән баш тартса, Коръән хөкеменнән баш тарткан төркем белән сугышыгыз, аларны үтерегез, хәтта Аллаһуның Коръәндәге хөкеменә кайткангача, әгәр ул төркем Коръән хөкеменә кайтса, бу ике төркемнең арасыны килештерегез, гаделлек белән вә турылык кылыгыз, тәхкыйк Аллаһ турылык кылучыларны сөядер.",
            "verse 49:10": "Мөэминнәр дин буенча, әлбәттә, бер-берсенә кардәшләрдер. Кардәшләрегезнең арасын килештерегез, тезелегез, Аллаһудан куркыгыз, мөэминнәр арасына фетнә дошманлык салудан сакланыгыз, шаять Аллаһудан рәхмәт ителерсез.",
            "verse 49:11": "Ий мөэминнәр, бер кавем икенче бер кавемне кимсетмәсен, ул кимсетелгән кавемнең кимсетүче кавемнән яхшырак булуы ихтималдыр, шулай ук хатыннар икенче хатыннарны кимсетмәсеннәр, кимсетелгән хатын кимсетүче хатыннан яхшырак булуы ихтималдыр, вә дин кардәшләрегезне ґәебләп кимсетмәгез, вә бер-берегезгә яман кушым исемнәр илә дәшмәгез, мөэмин булганнан соң, фасыйк исеме ни яман исемдер. Бу эшне эшләүчеләр тәүбә итеп төзәлмәсәләр, алар залимнәрдер.",
            "verse 49:12": "Ий мөэминнәр, күп гөманнан сакланыгыз тәхкыйк бәгъзе гөманда гөнаһ бардыр. Вә кешеләрнең гаепләрен тикшермәгез, кеше ґәебен эзләмәгез вә бәгъзегез бәгъзегезне гайбәт кылмасын! Әйә сезнең берәрегез үлгән кардәшенең итен ашауны сөярме? Сез, әлбәттә, аны мәкъруһ күрдегез, ґәйбәт сөйләүне дә шулай мәкъруһ күрегез! Аллаһудан куркыгыз, ґәйбәт эшләреннән тәүбә итегез! Шиксез Аллаһ тәүбә итеп төзәлгән кешеләрне гафу итүче вә рәхимледер.",
            "verse 49:13": "Ий кешеләр, Без сезләрне ир вә хатын итеп халык кылдык, вә сездән тармаклар вә кабиләләр кылдык бер-берегезне әҗерәтеп танымаклыгыгыз өчен, тәхкыйк сезнең Аллаһ хозурында хөрмәтлерәгегез Аллаһудан куркып гөнаһлардан сакланучырагыздыр, Аллаһ белүче вә һәр эшегездән хәбәрдар.",
            "verse 49:14": "Күчеп йөрүче бәдәвий ґәрәбләре әйттеләр: \"Иман китердек\", – дип син әйт: \"Сез иман китермәдегез ләкин мөселманнардан куркып, яки мөселманнардан файдаланып көн күрү өчен тыштан гына Ислам динен кабул иттек\", – дип әйтегез! Әле күңелегезгә иман әсәре кергәне юк, иман китерергә ниятегез дә юк, имансыз гына мөселман булып йөрергә теләгәнсез, ягыш мөселманнар белән гамәл кылып аларны алдарга теләгәнсез. Әгәр чынлап иман китереп ихлас күңел белән Аллаһуга вә Аның расүленә итагать итсәгез, әлеге мөселманнар белән бергә кылган гамәлләрегезгә һич кимчелек ирешмәс, сәвабы, әлбәттә, югалмас иде. Тәхкыйк Аллаһ ярлыкаучы вә рәхмәт итүчедер\".",
            "verse 49:15": "Менә шушы сыйфатларда булган кешеләр генә хак иманлы кешеләр, алар чын күңелдән Аллаһуга вә Аның расүленә ныклап иман китерделәр, моннан соң иман китерүләренә һич шикләнмәделәр һәм иманга зарар бирә торган эшне кылмадылар, вә алар маллары вә җаннары белән Аллаһ юлында сугыш кылдылар, сугыш булмаганда Ислам файдасына тырыштылар, әнә шул кешеләр, иман китердек мөэмин вә мөселман булдык дигән сүзләрендә дөрес сөйләүчеләр, чын иманлылардыр.",
            "verse 49:16": "Әйт аларга: \"Динегезне Аллаһуга өйрәтерсезме? Иман китермәгәнегез хәлдә иман китердек, дип, Аллаһуны алдамакчы буласызмы? Бит Аллаһ җирдәге вә күкләрдәге серләрне беләдер, Аллаһ һәрнәрсәне белүчедер.",
            "verse 49:17": "Бәдәвий ґәрәбләре мөселман булулары белән сиңа миннәт итәрләр, ягъни мөселман булуларын пәйгамбәр файдасына дип уйларлар, син аларга әйт: \"Мөселман булуыгыз белән миңа миннәт итмәгез, бәлки Аллаһ сезгә миннәт итәр, сезне иманга күндергәне өчен, әгәр иманыгызда ышанычлы кешеләрдән булсагыз\", – дип. Чөнки бу аятьләрдән соң алар иман китерделәр.",
            "verse 49:18": "Аллаһ җирдәге вә күкләрдәге яшерен нәрсәләрне, шиксез, беләдер, Аллаһ сезнең эшләгән эшләрегезне күрүчедер."
        },
        "Telugu": {
            "verse 49:1": "ఓ విశ్వాసులారా! మీరు అల్లాహ్ మరియు ఆయన ప్రవక్త అనుమతికి ముందే నిర్ణయాలకు దిగకండి. అల్లాహ్ యందు భయభక్తులు కలిగి ఉండండి. నిశ్చయంగా, అల్లాహ్ అంతా వినేవాడు, సర్వజ్ఞుడు",
            "verse 49:2": "ఓ విశ్వాసులారా! మీ కంఠస్వరాలను, ప్రవక్త కంఠస్వరాని కంటే పెంచకండి మరియు మీరు పరస్పరం ఒకరితో నొకరు విచ్చలవిడిగా మాట్లాడుకునే విధంగా అతనితో మాట్లాడకండి, దాని వల్ల మీకు తెలియకుండానే, మీ కర్మలు వ్యర్థం కావచ్చు",
            "verse 49:3": "నిశ్చయంగా, ఎవరైతే అల్లాహ్ యొక్క సందేశహరుని సన్నిధిలో తమ కంఠస్వరాలను తగ్గిస్తారో, అలాంటి వారి హృదయాలను అల్లాహ్ భయభక్తుల కొరకు పరీక్షించి ఉన్నాడు. వారికి క్షమాపణ మరియు గొప్ప ప్రతిఫలం ఉంటాయి",
            "verse 49:4": "(ఓ ప్రవక్తా!) నిశ్చయంగా, ఎవరైతే, నిన్ను గృహాల బయట నుండి బిగ్గరగా (అరుస్తూ) పిలుస్తారో, వారిలో చాలా మంది బుద్ధిహీనులే",
            "verse 49:5": "మరియు ఒకవేళ వారు నీవు బయటకు వచ్చే వరకు ఓపిక పట్టి వుంటే, అది వారికే మేలై ఉండేది. మరియు అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత",
            "verse 49:6": "ఓ విశ్వాసులారా! ఎవడైనా ఒక అవిధేయుడు (ఫాసిఖ్), మీ వద్దకు ఏదైనా వార్త తెస్తే, మీరు - మీకు తెలియకుండానే జనులకు నష్టం కలిగించి, మీరు చేసిన దానికి పశ్చాత్తాప పడవలసిన స్థితి రాకముందే - నిజానిజాలను విచారించి తెలుసుకోండి",
            "verse 49:7": "మరియు మీ మధ్య అల్లాహ్ యొక్క సందేశహరుడు ఉన్నాడనే విషయాన్ని బాగా గుర్తుంచుకోండి. ఒకవేళ అతన చాలా విషయాలలో మీ మాటనే వింటే మీరే ఆపదలో పడవచ్చు. కానీ అల్లాహ్ మీకు విశ్వాసం పట్ల ప్రేమ కలిగించాడు మరియు దానిని మీ హృదయాలకు ఆకర్షణీయమైనదిగా చేశాడు. మరియు సత్యతిరస్కారాన్ని, అవిధేయతను మరియు దుర్నడతను (ఆజ్ఞోల్లంఘనను) మీకు అసహ్యకరమైనదిగా చేశాడు. అలాంటి వారే సరైన మార్గదర్శకత్వం పొందినవారు",
            "verse 49:8": "అది అల్లాహ్ తరఫు నుండి వారికి లభించిన అనుగ్రహం మరియు ఉపకారం. మరియు అల్లాహ్ సర్వజ్ఞుడు, మహా వివేకవంతుడు",
            "verse 49:9": "మరియు ఒకవేళ విశ్వాసులలోని రెండు వర్గాల వారు పరస్పరం కలహించుకుంటే, వారిద్దరి మధ్య సంధి చేయించండి. కాని ఒకవేళ, వారిలోని ఒక వర్గం వారు రెండవ వర్గం వారిపై దౌర్జన్యం చేస్తే, దౌర్జన్యం చేసిన వారు, అల్లాహ్ ఆజ్ఞ వైపునకు మరలే వరకు, వారికి వ్యతిరేకంగా పోరాడండి. తరువాత వారు మరలి వస్తే, వారి మధ్య న్యాయంగా సంధి చేయించండి మరియు నిష్పక్షపాతంగా వ్యవహరించండి. నిశ్చయంగా, అల్లాహ్ నిష్పక్షపాతంగా వ్యవహరించే వారిని ప్రేమిస్తాడు",
            "verse 49:10": "వాస్తవానికి విశ్వాసులు పరస్పరం సహోదరులు, కావున మీ సహోదరుల మధ్య సంధి చేయించండి. మరియు మీరు కరుణించ బడాలంటే అల్లాహ్ యందు భయభక్తులు కలిగి ఉండండి",
            "verse 49:11": "ఓ విశ్వాసులారా! మీలో ఎవరూ (పురుషులు) ఇతరులెవరినీ ఎగతాళి చేయరాదు. బహుశా వారే (ఎగతాళి చేయబడే వారే) వీరి కంటే శ్రేష్ఠులు కావచ్చు! అదే విధంగా స్త్రీలు కూడా ఇతర స్త్రీలను ఎగతాళి చేయరాదు. బహశా వారే (ఎగతాళి చేయబడే స్త్రీలే) వీరి కంటే శ్రేష్ఠురాండ్రు కావచ్చు! మీరు పరస్పరం ఎత్తి పొడుచుకోకండి మరియు చెడ్డ పేర్లతో పిలుచుకోకండి. విశ్వసించిన తర్వాత ఒకనిని చెడ్డ పేరుతో పిలవటం ఎంతో నీచమైన విషయం మరియు (ఇలా చేసిన పిదప) పశ్చాత్తాప పడకుంటే, అలాంటి వారు చాలా దుర్మార్గులు",
            "verse 49:12": "ఓ విశ్వాసులారా! అతిగా అనుమానించడం నుండి దూరంగా ఉండండి, ఎందుకంటే కొన్ని అనుమానాలే నిశ్చయంగా పాపాలు. మరియు మీరు మీ పరస్పర రహస్యాలను తెలుసుకోవటానికి ప్రయత్నించకండి మరియు చాడీలు చెప్పుకోకండి. మీలో ఎవడైనా చచ్చిన తన సోదరుని మాంసం తినడానికి ఇష్టపడతాడా? మీరు దానిని అసహ్యించుకుంటారు కదా! అల్లాహ్ పట్ల భయభక్తులు కలిగి ఉండండి. నిశ్చయంగా, అల్లాహ్ పశ్చాత్తాపాన్ని అంగీకరించేవాడు, అపార కరుణా ప్రదాత",
            "verse 49:13": "ఓ మానవులారా! నిశ్చయంగా మేము మిమ్మల్ని ఒక పురుషుడు మరియు ఒక స్త్రీ నుండి పుట్టించాము. మరియు మీరు ఒకరి నొకరు గుర్తించుకోవటానికి మిమ్మల్ని జాతులుగా మరియు తెగలుగా చేశాము. నిశ్చయంగా, మీలో ఎక్కువ దైవభీతి గలవాడే, అల్లాహ్ దగ్గర ఎక్కువ గౌరవం గలవాడు. నిశ్చయంగా, అల్లాహ్ సర్వజ్ఞుడు, సర్వం తెలిసినవాడు",
            "verse 49:14": "ఎడారి వాసులు (బద్దూలు): మేము విశ్వసించాము.\" అని అంటారు. (ఓ ముహమ్మద్!) వారితో ఇలా అను: మీరు ఇంకా విశ్వసించలేదు కావున: `మేము విధేయులం (ముస్లింలం) అయ్యాము.` అని అనండి. ఎందుకంటే విశ్వాసం (ఈమాన్) మీ హృదయాలలోకి ఇంకా ప్రవేశించలేదు. ఒకవేళ మీరు అల్లాహ్ యొక్క మరియు ఆయన ప్రవక్త యొక్క ఆజ్ఞాపాలన చేస్తే, ఆయన మీ కర్మలను ఏ మాత్రం వృథా కానివ్వడు. నిశ్చయంగా, అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత",
            "verse 49:15": "వాస్తవానికి, ఎవరైతే అల్లాహ్ మరియు ఆయన ప్రవక్తను విశ్వసించి, ఆ తరువాత ఏ అనుమానానికి లోను కాకుండా, అల్లాహ్ మార్గంలో, తమ సిరిసంపదలతో మరియు ప్రాణాలతో పోరాడుతారో! అలాంటి వారు, వారే! సత్యవంతులు",
            "verse 49:16": "వారితో ఇలా అను: ఏమిటి? మీరు అల్లాహ్ కు మీ ధర్మస్వీకారం గురించి తెలియజేస్తున్నారా? ఆకాశాలలో మరియు భూమిలో ఉన్నదంతా అల్లాహ్ కు బాగా తెలుసు. మరియు అల్లాహ్ కు ప్రతి విషయం గురించి బాగా తెలుసు",
            "verse 49:17": "(ఓ ముహమ్మద్!) వారు ఇస్లాంను స్వీకరించి, నీకు ఉపకారం చేసినట్లు వ్యవహరిస్తున్నారు. వారితో ఇలా అను: మీరు ఇస్లాంను స్వీకరించి నాకు ఎలాంటి ఉపకారం చేయలేదు! వాస్తవానికి, మీరు సత్యవంతులే అయితే! మీకు విశ్వాసం వైపునకు మార్గదర్శకత్వం చేసి, అల్లాహ్ యే మీకు ఉపకారం చేశాడని తెలుసుకోండి",
            "verse 49:18": "నిశ్చయంగా, అల్లాహ్! ఆకాశాలలో మరియు భూమిలోనున్న అగోచర విషయాలన్నింటినీ ఎరుగును. మరియు మీరు చేసేదంతా అల్లాహ్ చూస్తున్నాడు"
        },
        "Thai": {
            "verse 49:1": "โอ้ศรัทธาชนทั้งหลาย ! พวกเจ้าอย่าได้ล้ำหน้า (ในการกระทำใด ๆ) เมื่ออยู่ต่อหน้าอัลลอฮฺ และร่อซูลของพระองค์ พวกเจ้าจงยำเกรงอัลลอฮฺเถิด แท้จริงอัลลอฮฺนั้นเป็นผู้ทรงได้ยิน ผู้ทรงรอบรู้",
            "verse 49:2": "โอ้ศรัทธาชนทั้งหลาย! พวกเจ้าอย่าได้ยกเสียงของพวกเจ้าเหนือเสียงของอัลนะบี และอย่าพูดเสียงดังกับเขา (มุฮัมมัด) เยี่ยงการพูดเสียงดังของบางคนของพวกเจ้ากับอีกบางคน เพราะ (เกรงว่า) การงานต่าง ๆ ของพวกเจ้าจะสูญเสียไป โดยที่พวกเจ้าไม่รู้สึกตัว",
            "verse 49:3": "แท้จริงบรรดาผู้ที่ลดเสียงของพวกเขา ณ ที่ร่อซูลุลลอฮฺนั้น ชนเหล่านั้น คือบรรดาผู้ที่อัลลอฮฺทรงทดสอบจิตใจของพวกเขาเพื่อความยำเกรง สำหรับพวกเขาจะได้รับการอภัยโทษและรางวัลอันใหญ่หลวง",
            "verse 49:4": "แท้จริงบรรดาผู้ส่งเสียงเรียกเจ้าทางเบื้องหลังห้องหับเหล่านั้น ส่วนใหญ่ของพวกเขาไม่ใช้สติปัญญา",
            "verse 49:5": "และหากว่าพวกเขาอดทนไว้จนกว่าเจ้าจะออกมาหาพวกเขาแล้ว แน่นอนมันย่อมเป็นการดีสำหรับพวกเขา และอัลลอฮ.เป็นผู้ทรงอภัยโทษ ผู้ทรงเมตตาเสมอ",
            "verse 49:6": "โอ้ศรัทธาชนทั้งหลาย ! หากคนชั่วนำข่าวใดๆ มาแจ้งแก่พวกเจ้า พวกเจ้าก็จงสอบสวนให้แน่ชัด หาไม่แล้วพวกเจ้าก็จะก่อเคราะห์กรรมแก่พวกหนึ่งโดยไม่รู้ตัว แล้วพวกเจ้าจะกลายเป็นผู้เสียใจในสิ่งที่พวกเจ้าได้กระทำไป",
            "verse 49:7": "และพวกเจ้าพึงรู้เถิดว่า ในหมู่พวกเจ้านั้นมีร่อซูลของอัลลอฮฺอยู่ หากเขา(มุฮัมมัด) เชื่อฟังพวกเจ้าในส่วนใหญ่ของกิจการแล้ว แน่นอนพวกเจ้าก็จะลำบากกัน แต่อัลลอฮฺทรงให้การศรัทธาเป็นที่รักแก่พวกเจ้า และทรงให้การปฏิเสธศรัทธา และความชั่วช้าและการฝ่าฝืนเป็นที่น่าเกลียดชังแก่พวกเจ้า ชนเหล่านั้นคือพวกที่ดำเนินอยู่ในแนวทางที่ถูกต้อง",
            "verse 49:8": "มันเป็นคุณธรรมและความโปรดปรานจากอัลลอฮฺ และอัลลอฮฺนั้นเป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
            "verse 49:9": "และหากมีสองฝ่ายจากบรรดาผู้ศรัทธาทะเลาะวิวาทกัน พวกเจ้าก็จงไกล่เกลี่ยระหว่างทั้งสองฝ่าย หากฝ่ายหนึ่งในสองฝ่ายนั้นละเมิดอีกฝ่ายหนึ่ง พวกเจ้าก็จงปรามฝ่ายที่ละเมิดจนกว่าฝ่ายนั้นจะกลับสู่พระบัญชาของอัลลอฮฺ ฉะนั้นหากฝ่ายนั้นกลับ (สู่พระบัญชาของอัลลอฮฺ) แล้ว พวกเจ้าก็จงประนีประนอมระหว่างทั้งสองฝ่ายด้วยความยุติธรรม และพวกเจ้าจงให้ความเที่ยงธรรม(แก่ทั้งสองฝ่าย) เถิด แท้จริงอัลลอฮฺทรงรักใคร่บรรดาผู้ให้ความเที่ยงธรรม",
            "verse 49:10": "แท้จริงบรรดาผู้ศรัทธานั้นเป็นพี่น้องกัน ดังนั้นพวกเจ้าจงไกล่เกลี่ยประนีประนอมกันระหว่างพี่น้องทั้งสองฝ่ายของพวกเจ้า และจงยำเกรงอัลลอฮฺเถิด หวังว่าพวกเจ้าจะได้รับความเมตตา",
            "verse 49:11": "โอ้ศรัทธาชนทั้งหลาย! ชนกลุ่มหนึ่งอย่าได้เยาะเย้ยชนอีกกลุ่มหนึ่ง บางทีชนกลุ่มที่ถูกเยาะเย้ยนั้นจะดีกว่าชนกลุ่มที่เยาะเย้ย และสตรีกลุ่มหนึ่งอย่าได้เยาะเย้ยจะดีกว่ากลุ่มที่เยาะเย้ย และพวกเจ้าอย่าได้ตำหนิตัว ของพวกเจ้าเอง และอย่าได้เรียกกันด้วยฉายาที่ไม่ชอบ ช่างเลวทรามจริง ๆ ที่บรรดาผู้ศรัทธาจะเรียกกันว่าเป็นผู้ฝ่าฝืน ภายหลังจากที่ได้มีการศรัทธากันแล้ว และผู้ใดไม่สำนึกผิด ชนเหล่านั้นคือบรรดาผู้อธรรม",
            "verse 49:12": "โอ้ศรัทธาชนทั้งหลาย! พวกเจ้าจงปลีกตัวให้พ้นจากส่วนใหญ่ของการสงสัย แท้จริงการสงสัยบางอย่างนั้นเป็นบาป และพวกเจ้าอย่าสอดแนม และบางคนในหมู่พวกเจ้าอย่านินทาซึ่งกันและกัน คนหนึ่งในหมู่พวกเจ้านั้นชอบที่จะกินเนื้อพี่น้องของเขาที่ตายไปแล้วกระนั้นหรือ? พวกเจ้าย่อมเกลียดมัน และจงยำเกรงอัลลอฮฺเถิด แท้จริงอัลลอฮฺนั้นเป็นผู้ทรงอภัยโทษ ผู้ทรงเมตตาเสมอ",
            "verse 49:13": "โอ้มนุษยชาติทั้งหลาย แท้จริงเราได้สร้างพวกเจ้าจากเพศชาย และเพศหญิง และเราได้ให้พวกเจ้าแยกเป็นเผ่า และตระกูลเพื่อจะได้รู้จักกัน แท้จริงผู้ที่มีเกียรติยิ่งในหมู่พวกเจ้า ณ ที่อัลลอฮ.นั้น คือผู้ที่มีความยำเกรงยิ่งในหมู่พวกเจ้า แท้จริงอัลลอฮ.นั้นเป็นผู้ทรงรอบรู้อย่างละเอียดถี่ถ้วน",
            "verse 49:14": "อาหรับชาวชนบทกล่าวว่า เราศรัทธาแล้ว จงกล่าวเถิดมุฮัมมัดว่า พวกท่านยังมิได้ศรัทธา แต่จงกล่าวเถิดว่า เราเข้ารับอิสลามแล้ว เพราะการศรัทธายังมิได้เข้าสู่หัวใจของพวกท่าน และถ้าหากพวกท่านเชื่อฟังปฏิบัติตามอัลลอฮฺและร่อซูลของพระองค์แล้ว พระองค์จะไม่ทำให้การงานของพวกท่านด้อยลงแต่ประการใด แท้จริงอัลลอฮฺเป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
            "verse 49:15": "แท้จริงศรัทธาชนที่แท้จริงนั้น คือ บรรดาผู้ศรัทธาต่ออัลลอฮ. และร่อซูลของพระองค์ แล้วพวกเขาไม่สงสัยเคลือบแคลงใจ แต่พวกเขาได้เสียสละต่อสู้ดิ้นรนด้วยทรัพย์สมบัติของพวกเขา และชีวิตของพวกเขาไปในหนทางของอัลลอฮ. ชนเหล่านั้นแหละคือบรรดาผู้สัตย์จริง",
            "verse 49:16": "จงกล่าวเถิดมุฮัมมัดว่า พวกท่านจะบอกอัลลอฮฺเกี่ยวกับศาสนาของพวกท่านกระนั้นหรือ? อัลลอฮฺนั้นทรงรอบรู้สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และแผ่นดิน และอัลลอฮฺนั้นทรงรอบรู้ทุกสิ่งทุกอย่าง",
            "verse 49:17": "พวกเขาถือเป็นบุญคุณแก่เจ้าว่าพวกเขาได้รับอิสลามแล้ว จงกล่าวเถิดมุฮัมมัดว่าพวกท่านอย่าถือเอาการเป็นอิสลามของพวกท่านมาเป็นบุญคุณแก่ฉันเลย แต่ทว่าอัลลอฮ.ทรงประทานบุญคุณแก่พวกท่านต่างหาก โดยชี้นำพวกท่านสู่การศรัทธา หากพวกท่านเป็นผู้สัตย์จริง",
            "verse 49:18": "แท้จริงอัลลอฮฺทรงรอบรู้สิ่งเร้นลับในชั้นฟ้าทั้งหลายและแผ่นดิน และอัลลอฮฺทรงเห็นสิ่งที่พวกเจ้ากระทำ"
        },
        "Turkish": {
            "verse 49:1": "Ey inananlar! Allah'tan ve Peygamberinden öne geçmeyin; Allah'tan sakının, doğrusu Allah işitir ve bilir.",
            "verse 49:2": "Ey inananlar! Seslerinizi, Peygamberin sesini bastıracak şekilde yükseltmeyin. Farkına varmadan, işlediklerinizin boşa gitmemesi için, Peygambere birbirinize bağırdığınız gibi yüksek sesle bağırmayın.",
            "verse 49:3": "Seslerini Peygamberin yanında kısan kimseler, Allah'ın gönüllerini takva ile sınadığı kimselerdir. Onlara mağfiret ve büyük ecir vardır.",
            "verse 49:4": "Sana odaların ötesinden seslenenlerin çoğu akletmeyen kimselerdir.",
            "verse 49:5": "Eğer onlar, sen yanlarına çıkıncaya kadar sabretselerdi şüphesiz onlar için daha iyi olurdu. Allah bağışlayandır, merhamet edendir.",
            "verse 49:6": "Ey inananlar! Eğer yoldan çıkmışın biri size bir haber getirirse, onun iç yüzünü araştırın, yoksa bilmeden bir millete fenalık edersiniz de sonra ettiğinize pişman olursunuz.",
            "verse 49:7": "Bilin ki, içinizde Allah'ın Peygamberi bulunmaktadır. Eğer o, bir çok işlerde size uymuş olsaydı şüphesiz kötü duruma düşerdiniz; ama Allah size imanı sevdirmiş, onu gönüllerinize güzel göstermiş; inkarcılığı, yoldan çıkmayı ve baş kaldırmayı size iğrenç göstermiştir. İşte böyle olanlar, Allah katından bir lütuf ve nimet sayesinde doğru yolda bulunanlardır. Allah bilendir, Hakim'dir.",
            "verse 49:8": "Bilin ki, içinizde Allah'ın Peygamberi bulunmaktadır. Eğer o, bir çok işlerde size uymuş olsaydı şüphesiz kötü duruma düşerdiniz; ama Allah size imanı sevdirmiş, onu gönüllerinize güzel göstermiş; inkarcılığı, yoldan çıkmayı ve baş kaldırmayı size iğrenç göstermiştir. İşte böyle olanlar, Allah katından bir lütuf ve nimet sayesinde doğru yolda bulunanlardır. Allah bilendir, Hakim'dir.",
            "verse 49:9": "Eğer müminlerden iki topluluk birbirleriyle savaşırlarsa aralarını düzeltiniz; eğer biri diğeri üzerine saldırırsa, saldıranlarla Allah'ın buyruğuna dönmelerine kadar savaşınız; eğer dönerlerse aralarını adaletle bulunuz, adil davranınız, şüphesiz Allah adil davrananları sever.",
            "verse 49:10": "Şüphesiz müminler birbiri ile kardeştirler; öyle ise dargın olan kardeşlerinizin arasını düzeltin; Allah'tan sakının ki size acısın.",
            "verse 49:11": "Ey inananlar! Bir topluluk bir diğerini alaya almasın, belki de onlar kendilerinden daha iyidirler. Kadınlar da başka kadınları alaya almasınlar, belki onlar kendilerinden daha iyidirler. Kendi kendinizi ayıplamayın; birbirinizi kötü lakaplarla çağırmayın; inandıktan sonra yoldan çıkmış olmak ne kötü bir addır. Tevbe etmeyenler, işte onlar zalimlerdir.",
            "verse 49:12": "Ey inananlar! Zannın çoğundan sakının, zira zannın bir kısmı günahtır. Birbirinizin suçunu araştırmayın; kimse kimseyi çekiştirmesin; hangi biriniz ölü kardeşinin etini yemekten hoşlanır? Ondan tiksinirsiniz; Allah'tan sakının, şüphesiz Allah tevbeleri daima kabul edendir, acıyandır.",
            "verse 49:13": "Ey insanlar! Doğrusu Biz sizleri bir erkekle bir dişiden yarattık. Sizi milletler ve kabileler haline koyduk ki birbirinizi kolayca tanıyasınız. Şüphesiz, Allah katında en değerliniz, O'na karşı gelmekten en çok sakınanızdır. Allah bilendir, haberdardır.",
            "verse 49:14": "Bedeviler: \"İnandık\" dediler, de ki: \"İnanmadınız ama İslam olduk deyin; inanç henüz gönüllerinize yerleşmedi; eğer Allah'a ve Peygamberine itaat ederseniz, işlediklerinizden bir şey eksilmez; doğrusu Allah, bağışlar, merhamet eder.\"",
            "verse 49:15": "\"İnananlar, ancak Allah'a ve peygamberine inanmış, sonra şüpheye düşmemiş; Allah uğrunda mallarıyla, canlarıyla cihat etmiş olanlardır. İşte onlar doğru olanlardır.\"",
            "verse 49:16": "De ki: \"Dininizi Allah'a mı öğretiyorsunuz? Oysa Allah göklerde olanları da yerde olanları da bilir, Allah her şeyi bilendir.\"",
            "verse 49:17": "Müslüman oldular diye seni minnet altında bırakmak isterler; de ki: \"Müslüman olmanızla beni minnet altında tutmayın, hayır; eğer doğru kimselerseniz, sizi imana eriştirmekle Allah sizi minnet altında bırakır.\"",
            "verse 49:18": "Doğrusu Allah, göklerin ve yerin gaybını bilir. Allah, yaptıklarınızı görendir."
        },
        "Urdu": {
            "verse 49:1": "مومنو! (کسی بات کے جواب میں) خدا اور اس کے رسول سے پہلے نہ بول اٹھا کرو اور خدا سے ڈرتے رہو۔ بےشک خدا سنتا جانتا ہے",
            "verse 49:2": "اے اہل ایمان! اپنی آوازیں پیغمبر کی آواز سے اونچی نہ کرو اور جس طرح آپس میں ایک دوسرے سے زور سے بولتے ہو (اس طرح) ان کے روبرو زور سے نہ بولا کرو (ایسا نہ ہو) کہ تمہارے اعمال ضائع ہوجائیں اور تم کو خبر بھی نہ ہو",
            "verse 49:3": "جو لوگ پیغمبر خدا کے سامنے دبی آواز سے بولتے ہیں خدا نے ان کے دل تقویٰ کے لئے آزما لئے ہیں۔ ان کے لئے بخشش اور اجر عظیم ہے",
            "verse 49:4": "جو لوگ تم کو حجروں کے باہر سے آواز دیتے ہیں ان میں اکثر بےعقل ہیں",
            "verse 49:5": "اور اگر وہ صبر کئے رہتے یہاں تک کہ تم خود نکل کر ان کے پاس آتے تو یہ ان کے لئے بہتر تھا۔ اور خدا تو بخشنے والا مہربان ہے",
            "verse 49:6": "مومنو! اگر کوئی بدکردار تمہارے پاس کوئی خبر لے کر آئے تو خوب تحقیق کرلیا کرو (مبادا) کہ کسی قوم کو نادانی سے نقصان پہنچا دو۔ پھر تم کو اپنے کئے پر نادم ہونا پڑے",
            "verse 49:7": "اور جان رکھو کہ تم میں خدا کے پیغمبرﷺ ہیں۔ اگر بہت سی باتوں میں وہ تمہارا کہا مان لیا کریں تو تم مشکل میں پڑ جاؤ لیکن خدا نے تم کو ایمان عزیز بنا دیا اور اس کو تمہارے دلوں میں سجا دیا اور کفر اور گناہ اور نافرمانی سے تم کو بیزار کردیا۔ یہی لوگ راہ ہدایت پر ہیں",
            "verse 49:8": "(یعنی) خدا کے فضل اور احسان سے۔ اور خدا جاننے والا (اور) حکمت والا ہے",
            "verse 49:9": "اور اگر مومنوں میں سے کوئی دو فریق آپس میں لڑ پڑیں تو ان میں صلح کرا دو۔ اور اگر ایک فریق دوسرے پر زیادتی کرے تو زیادتی کرنے والے سے لڑو یہاں تک کہ وہ خدا کے حکم کی طرف رجوع لائے۔ پس جب وہ رجوع لائے تو وہ دونوں فریق میں مساوات کے ساتھ صلح کرا دو اور انصاف سے کام لو۔ کہ خدا انصاف کرنے والوں کو پسند کرتا ہے",
            "verse 49:10": "مومن تو آپس میں بھائی بھائی ہیں۔ تو اپنے دو بھائیوں میں صلح کرادیا کرو۔ اور خدا سے ڈرتے رہو تاکہ تم پر رحمت کی جائے",
            "verse 49:11": "مومنو! کوئی قوم کسی قوم سے تمسخر نہ کرے ممکن ہے کہ وہ لوگ ان سے بہتر ہوں اور نہ عورتیں عورتوں سے (تمسخر کریں) ممکن ہے کہ وہ ان سے اچھی ہوں۔ اور اپنے (مومن بھائی) کو عیب نہ لگاؤ اور نہ ایک دوسرے کا برا نام رکھو۔ ایمان لانے کے بعد برا نام (رکھنا) گناہ ہے۔ اور جو توبہ نہ کریں وہ ظالم ہیں",
            "verse 49:12": "اے اہل ایمان! بہت گمان کرنے سے احتراز کرو کہ بعض گمان گناہ ہیں۔ اور ایک دوسرے کے حال کا تجسس نہ کیا کرو اور نہ کوئی کسی کی غیبت کرے۔ کیا تم میں سے کوئی اس بات کو پسند کرے گا کہ اپنے مرے ہوئے بھائی کا گوشت کھائے؟ اس سے تو تم ضرور نفرت کرو گے۔ (تو غیبت نہ کرو) اور خدا کا ڈر رکھو بےشک خدا توبہ قبول کرنے والا مہربان ہے",
            "verse 49:13": "لوگو! ہم نے تم کو ایک مرد اور ایک عورت سے پیدا کیا اور تمہاری قومیں اور قبیلے بنائے۔ تاکہ ایک دوسرے کو شناخت کرو۔ اور خدا کے نزدیک تم میں زیادہ عزت والا وہ ہے جو زیادہ پرہیزگار ہے۔ بےشک خدا سب کچھ جاننے والا (اور) سب سے خبردار ہے",
            "verse 49:14": "دیہاتی کہتے ہیں کہ ہم ایمان لے آئے۔ کہہ دو کہ تم ایمان نہیں لائے (بلکہ یوں) کہو کہ ہم اسلام لائے ہیں اور ایمان تو ہنوز تمہارے دلوں میں داخل ہی نہیں ہوا۔ اور تم خدا اور اس کے رسول کی فرمانبرداری کرو گے تو خدا تمہارے اعمال سے کچھ کم نہیں کرے گا۔ بےشک خدا بخشنے والا مہربان ہے",
            "verse 49:15": "مومن تو وہ ہیں جو خدا اور اس کے رسول پر ایمان لائے پھر شک میں نہ پڑے اور خدا کی راہ میں مال اور جان سے لڑے۔ یہی لوگ (ایمان کے) سچے ہیں",
            "verse 49:16": "ان سے کہو کیا تم خدا کو اپنی دینداری جتلاتے ہو۔ اور خدا تو آسمانوں اور زمین کی سب چیزوں سے واقف ہے۔ اور خدا ہر شے کو جانتا ہے",
            "verse 49:17": "یہ لوگ تم پر احسان رکھتے ہیں کہ مسلمان ہوگئے ہیں۔ کہہ دو کہ اپنے مسلمان ہونے کا مجھ پر احسان نہ رکھو۔ بلکہ خدا تم پر احسان رکھتا ہے کہ اس نے تمہیں ایمان کا رستہ دکھایا بشرطیکہ تم سچے (مسلمان) ہو",
            "verse 49:18": "بےشک خدا آسمانوں اور زمین کی پوشیدہ باتوں کو جانتا ہے اور جو کچھ تم کرتے ہو اسے دیکھتا ہے"
        },
        "Uyghur": {
            "verse 49:1": "ئى مۆمىنلەر! سىلەر اﷲ نىڭ ۋە اﷲ نىڭ پەيغەمبىرىنىڭ ئالدىدا (ھېچقانداق بىر ئىشنى ۋە سۆزنى) ئالدى بىلەن قىلماڭلار، اﷲ تىن قورقۇڭلار، اﷲ ھەقىقەتەن (سۆزۈڭلارنى) ئاڭلاپ تۇرغۇچىدۇر، (نىيىتىڭلارنى ۋە ئەھۋالىڭلارنى) بىلىپ تۇرغۇچىدۇر",
            "verse 49:2": "ئى مۆمىنلەر! (رەسۇلۇللاھقا سۆز قىلغان چېغىڭلاردا) ئاۋازىڭلارنى پەيغەمبەرنىڭ ئاۋازىدىن يۇقىرى قىلماڭلار، سىلەر بىر - بىرىڭلار بىلەن (توۋلاپ) يۇقىرى ئاۋازدا سۆزلەشكەندەك، پەيغەمبەرگە (توۋلاپ) يۇقىرى ئاۋازدا سۆز قىلماڭلار، (ئۇنداق قىلساڭلار) ئۆزلىرىڭلار تۇيماستىن، (قىلغان ياخشى) ئەمەللىرىڭلار بىكار بولۇپ كېتىدۇ",
            "verse 49:3": "شۈبھىسىزكى، رەسۇلۇللاھنىڭ يېنىدا پەس ئاۋازدا گەپ قىلغانلارنىڭ دىللىرىنى اﷲ تەقۋا ئۈچۈن سىنىغان، ئۇلار مەغپىرەتكە ۋە كاتتا ساۋابقا (يەنى جەننەتكە) ئېرىشىدۇ",
            "verse 49:4": "شۈبھىسىزكى، سېنى ھۇجرىلار (يەنى پاك ئاياللىرىڭنىڭ تۇرالغۇ جايلىرى) ئارقىسىدىن توۋلايدىغانلارنىڭ تولىسى ئەقىلسىز كىشىلەردۇر",
            "verse 49:5": "سەن ئۇلارنىڭ ئالدىغا چىققىنىڭغا قەدەر ئۇلار سەۋر قىلىپ تۇرۇشسا، ئۇلار ئۈچۈن ئەلۋەتتە ياخشى بولاتتى، اﷲ ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر",
            "verse 49:6": "ئى مۆمىنلەر! ئەگەر سىلەرگە بىر پاسىق ئادەم بىرەر خەۋەر ئېلىپ كەلسە، (ئىشنىڭ ھەقىقىتىنى) بىلمەستىن بىرەر قەۋمنى رەنجىتىپ قويۇپ، قىلمىشىڭلارغا پۇشايمان قىلىپ قالماسلىقىڭلار ئۈچۈن، (ئۇ خەۋەرنى) ئېنىقلاپ كۆرۈڭلار",
            "verse 49:7": "بىلىڭلاركى، ئىچىڭلاردا رەسۇلۇللاھ (يەنى اﷲ نىڭ پەيغەمبىرى) بار، ئەگەر ئۇ نۇرغۇن ئىشلاردا سىلەرگە ئىتائەت قىلىدىغان بولسا، چوقۇم قىيىن ئەھۋالدا قالاتتىڭلار، لېكىن اﷲ سىلەرگە ئىماننى قىزغىن سۆيگۈزدى ۋە ئۇنى دىلىڭلاردا كۆركەم قىلدى، سىلەرگە پىسقىنى، كۇفرىنى ۋە گۇناھنى يامان كۆرسەتتى، ئەنە شۇلار اﷲ نىڭ پەزلى ۋە نېمىتى بىلەن توغرا يولدا بولغۇچىلاردۇر. اﷲ ھەممىنى بىلگۈچىدۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 49:8": "بىلىڭلاركى، ئىچىڭلاردا رەسۇلۇللاھ (يەنى اﷲ نىڭ پەيغەمبىرى) بار، ئەگەر ئۇ نۇرغۇن ئىشلاردا سىلەرگە ئىتائەت قىلىدىغان بولسا، چوقۇم قىيىن ئەھۋالدا قالاتتىڭلار، لېكىن اﷲ سىلەرگە ئىماننى قىزغىن سۆيگۈزدى ۋە ئۇنى دىلىڭلاردا كۆركەم قىلدى، سىلەرگە پىسقىنى، كۇفرىنى ۋە گۇناھنى يامان كۆرسەتتى، ئەنە شۇلار اﷲ نىڭ پەزلى ۋە نېمىتى بىلەن توغرا يولدا بولغۇچىلاردۇر. اﷲ ھەممىنى بىلگۈچىدۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 49:9": "ئەگەر مۆمىنلەردىن ئىككى گۇرۇھ ئۇرۇشۇپ قالسا، ئۇلارنىڭ ئارىسىنى تۈزەپ قويۇڭلار، ئەگەر ئۇلارنىڭ بىرى ئىككىنچىسىگە تاجاۋۇز قىلسا، تاجاۋۇز قىلغۇچى تاكى اﷲ نىڭ ھۆكمىگە قايتقانغا قەدەر (يەنى تاجاۋۇزىنى توختاتقانغا قەدەر) ئۇنىڭ بىلەن ئۇرۇشۇڭلار، ئەگەر ئۇلار (اﷲ نىڭ ئەمرىگە) قايتسا، ئۇلارنىڭ ئارىسىنى (ھېچبىر تەرەپكە يان باسماستىن) ئادىللىق بىلەن تۈزەپ قويۇڭلار، (ھەممە ئىشتا) ئادىل بولۇڭلار، اﷲ ھەقىقەتەن ئادىللارنى دوست تۇتىدۇ",
            "verse 49:10": "مۆمىنلەر ھەقىقەتەن (دىندا) قېرىنداشلاردۇر، (ئۇرۇشۇپ قالسا) قېرىنداشلىرىڭلارنىڭ ئارىسىنى تۈزەڭلار، رەھمەتكە ئېرىشىشىڭلار ئۈچۈن، اﷲ تىن قورقۇڭلار",
            "verse 49:11": "ئى مۆمىنلەر! بىر قەۋم يەنە بىر قەۋمنى (يەنى بىر جامائە يەنە بىر جامائەنى، بىر ئادەم يەنە بىر ئادەمنى) مەسخىرە قىلمىسۇن، مەسخىرە قىلىنغان قەۋم (اﷲ نىڭ نەزىرىدە) مەسخىرە قىلغۇچى قەۋمدىن ياخشىراق بولۇشى مۇمكىن، سىلەرنىڭ ئاراڭلاردىكى ئاياللارمۇ ئۆزئارا مەسخىرە قىلىشمىسۇن، مەسخىرە قىلىنغۇچى ئاياللار (اﷲ نىڭ دەرگاھىدا) مەسخىرە قىلغۇچى ئاياللاردىن ياخشىراق بولۇشى مۈمكىن، بىر - بىرىڭلارنى ئەيىبلىمەڭلار، بىر - بىرىڭلارنى يامان لەقەم بىلەن چاقىرماڭلار، ئىماندىن كېيىن پىسقى بىلەن ئاتاش (يەنى مۆمىننى پاسىق) دەپ ئاتاش نېمىدېگەن يامان! (مۇنداق نەھيى قىلىنغان ئىشلاردىن) تەۋبە قىلمىغانلار زالىملاردۇر",
            "verse 49:12": "ئى مۆمىنلەر! نۇرغۇن گۇمانلاردىن ساقلىنىڭلار (يەنى ئائىلىدىكىلىرىڭلارغا ۋە كىشىلەرگە گۇمانخورلۇق قىلماڭلار)، بەزى گۇمانلار ھەقىقەتەن گۇناھتۇر، (مۆمىنلەرنىڭ ئەيىبىنى) ئىزدىمەڭلار، بىر - بىرىڭلارنىڭ غەيۋىتىنى قىلماڭلار، سىلەرنىڭ بىرىڭلار ئۆلگەن قېرىندىشىڭلارنىڭ گۆشىنى يېيىشنى ياقتۇرامسىلەر؟ ئۇنى ياقتۇرمايسىلەر اﷲ تىن قورقۇڭلار اﷲ (تەۋبەقىلغۇچىلارنىڭ قىلغان) تەۋبىسىنى بەكمۇ قۇبۇل قىلغۇچىدۇر، (ئۇلارغا) ناھايىتى مېھرىباندۇر",
            "verse 49:13": "ئى ئىنسانلار! سىلەرنى بىز ھەقىقەتەن بىر ئەر، بىر ئايالدىن، (ئادەم بىلەن ھەۋۋادىن ئىبارەت) بىر ئاتا بىر ئانىدىن ياراتتۇق ئۆز ئارا تونۇشۇشۇڭلار ئۈچۈن سىلەرنى نۇرغۇن مىللەت ۋە ئۇرۇق قىلدۇق، ھەقىقەتەن ئەڭ تەقۋادار بولغانلىرىڭلار اﷲ نىڭ دەرگاھىدا ئەڭ ھۆرمەتلىك ھېسابلىنىسىلەر (يەنى كىشىلەرنىڭ بىر - بىرىدىن ئارتۇق بولۇشى نەسەب بىلەن ئەمەس، تەقۋادارلىق بىلەن بولىدۇ)، اﷲ ھەقىقەتەن ھەممىنى بىلگۈچىدۇر، ھەممىدىن خەۋەرداردۇر",
            "verse 49:14": "ئەئرابىلار: «ئىمان ئېيتتۇق» دەيدۇ، (ئۇلارغا) ئېيتقىنكى، «(تېخى) ئىمان ئېيتمىدىڭلار ۋە لېكىن سىلەر بويسۇندۇق دەڭلار، ئىمان تېخى دىلىڭلارغا كىرمىدى، ئەگەر سىلەر اﷲ قا ۋە ئۇنىڭ پەيغەمبىرىگە ئىتائەت قىلساڭلار، اﷲ سىلەرنىڭ ئەمەلىڭلاردىن ھېچ نەرسىنى كېمەيتىۋەتمەيدۇ، اﷲ ھەقىقەتەن (مۆمىنلەرگە) ناھايىتى مەغپىرەت قىلغۇچىدۇر، (ئۇلارغا) ناھايىتى مېھرىباندۇر",
            "verse 49:15": "شۈبھىسىزكى، (ھەقىقي) مۆمىنلەر اﷲ قا ۋە ئۇنىڭ پەيغەمبىرىگە ئىمان كەلتۈرگەن، ئاندىن (ئىمانىدا) شەك كەلتۈرمىگەن، ماللىرى بىلەن، جانلىرى بىلەن اﷲ نىڭ يولىدا جىھاد قىلغانلاردۇر، ئەنە شۇلار (ئىمان دەۋاسىدا) راستچىللاردۇر»",
            "verse 49:16": "(ئى مۇھەممەد!) ئېيتقىنكى، «اﷲ قا دىنىڭلارنى (يەنى دىنىڭلارنى دىلىڭلارنىڭ تەستىق قىلغانلىقىنى) خەۋەر قىلامسىلەر؟ ھالبۇكى، اﷲ ئاسمانلاردىكىنى ۋە زېمىندىكىنى بىلىپ تۇرىدۇ، اﷲ ھەممە نەرسىنى بىلگۈچىدۇر»",
            "verse 49:17": "ئۇلار ساڭا مۇسۇلمان بولغانلىقىنى مىننەت قىلىدۇ، (ئۇلارغا) «سىلەر ماڭا مۇسۇلمان بولغانلىقىڭلارنى مىننەت قىلماڭلار، بەلكى اﷲ سىلەرنى ئىمانغا ھىدايەت قىلغانلىقىنى مىننەت قىلىدۇ، ئەگەر سىلەر راست (مۆمىن) بولساڭلار» دېگىن",
            "verse 49:18": "اﷲ ھەقىقەتەن ئاسمانلاردىكى ۋە زېمىندىكى غەيىبنى بىلىپ تۇرىدۇ، اﷲ سىلەرنىڭ قىلىۋاتقان ئىشىڭلارنى كۆرۈپ تۇرغۇچىدۇر"
        },
        "Uzbek": {
            "verse 49:1": "Эй иймон келтирганлар! Аллоҳдан ва Унинг Расулдан олдин шошилманглар. Ва Аллоҳга тақво қилинглар. Албатта Аллоҳ эшитувчи ва билувчи зотдир.",
            "verse 49:2": "Эй иймон келтирганлар! Овозингизни Пайғамбар овозидан юқори кўтарманг ва унга бир-бирингиз ила сўзлашгандек дағал сўз айтманг, ўзингиз сезмаган ҳолда амалларингиз ҳабата бўлиб қолмасин.",
            "verse 49:3": "Албатта, Расулуллоҳнинг ҳузурида овозларини пастлатганлар, ана ўшалар Аллоҳ қалбларини тақвога имтиҳон қилган зотлардир. Уларга мағфират ва улкан ажр бор.",
            "verse 49:4": "Албатта, сени ҳужралар ортидан чақираётганларнинг кўплари ақл ишлатмаслар.",
            "verse 49:5": "Агар уларнинг ҳузурига чиққунингча сабр қилсалар, ўзлари учун яхши бўларди. Аллоҳ мағфират қилувчи ва раҳимлидир.",
            "verse 49:6": "Эй иймон келтирганлар! Агар фосиқ хабар келтирса, аниқлаб кўринглар, бир қавмга билмасдан мусибат етказиб қўйиб, қилганингизга надомат чекувчи бўлманглар.",
            "verse 49:7": "Ва билингларки, албатта, ичларингизда Расулуллоҳ бордир. Агар У ишлардан кўпида сизга итоат қилса, албатта, қийинчиликка дучор бўлардингиз. Лекин, Аллоҳ сизларга иймонни маҳбуб қилди ва уни қалбларингизда зийнатлади ва сизларга куфрни, фисқни ва исённи ёмон кўрсатди. Ана ўшалар тўғриликда юрувчиларидир.",
            "verse 49:8": "Бу Аллоҳ томонидан фазл ва неъматдир. Аллоҳ билувчи ва ҳикматли зотдир.",
            "verse 49:9": "Агар мўминлардан икки тоифа урушиб кетсалар, бас, ўрталарини ислоҳ қилинг. Агар улардан бири иккинчисига тажовуз қилса, сиз тажовуз қилганига қарши, то у Аллоҳнинг амрига қайтгунича урушинг, агар қайтса, бас, ўрталарини адолат билан ислоҳ қилинг. Одил бўлинг, албатта, Аллоҳ адолат қилгувчиларни суядир.",
            "verse 49:10": "Албатта, мўминлар биродардирлар, бас, икки биродарингиз ўртасини ислоҳ қилинг, Аллоҳга тақво қилинг, шоядки, раҳм қилинсангиз.",
            "verse 49:11": "Эй иймон келтирганлар! Бир қавм бошқасини масхара қилмасин, эҳтимол улар булардан яхшироқдир. Ва аёллар ҳам бошқа аёлларни (масхара қилмасин), эҳтимол улар булардан яхшироқдир. Ва ўзингизни ўзингиз мазах қилманг, бир-бирингизга лақаб қўйманг. Иймондан кейин фосиқлик исми нақадар ёмон! Ва ким тавба қилмаса, бас, ана ўшалар ўзлари золимлардир.",
            "verse 49:12": "Эй иймон келтирганлар! Кўп гумонлардан четда бўлинглар, чунки баъзи гумонлар гуноҳдир. Жосуслик қилманглар. Баъзиларингиз баъзиларингизни ғийбат қилманглар. Сизлардан бирорталарингиз ўзининг ўлган биродарининг гўштини ейишни яхши кўрадими? Ҳа, ёмон кўрасизлар. Аллоҳдан қўрқинглар! Албатта, Аллоҳ тавбани кўп қабул қилувчи ва раҳмлидир.",
            "verse 49:13": "Эй одамлар! Биз сизларни бир эркак ва аёлдан яратдик ва сизларни ўзаро танишишингиз учун халқлар ва қабилалар қилиб қўйдик. Албатта, Аллоҳнинг ҳузурида энг ҳурматлигингиз энг тақводорингиздир. Албатта, Аллоҳ билувчи ва хабардор зотдир.",
            "verse 49:14": "Аъробийлар, иймон келтирдик, дедилар. Сен: «Иймон келтирганингиз йўқ, лекин бўйинсундик денглар, ҳали иймон қалбларингизга киргани йўқ ва агар Аллоҳга ва Унинг Расулига итоат қилсангиз, амалларингиздан ҳеч нарса камимас. Албатта, Аллоҳ кечирувчи ва раҳмли зотдир», деб айт.",
            "verse 49:15": "Албатта, ҳақиқий мўминлар Аллоҳга ва Унинг Расулига иймон келтирган, сўнгра шубҳа қилмаган ва Аллоҳнинг йўлидан моллари ва жонлари ила жиҳод қилганлардир. Ана ўшалар, ўшаларгина (иймонида) содиқлардир.",
            "verse 49:16": "Сен: «Аллоҳга динингизни билдирмоқчимисиз? Ва ҳолбуки, Аллоҳ осмонлару ердаги нарсани билувчи зотдир. Аллоҳ ҳар бир нарсани билувчидир», деб айт.",
            "verse 49:17": "Сенга мусулмон бўлганларини миннат қилурлар. Сен: «Менга Исломингизни миннат қилманг. Балки агар содиқ бўлсангиз, Аллоҳ сизни иймонга ҳидоят қилганини миннат қилур», деб айт.",
            "verse 49:18": "Албатта, Аллоҳ осмонлару ернинг ғайбини билувчи зотдир. Ва Аллоҳ қилаётган ишларингизни кўрувчи зотдир."
        },
        "Vietnamese": {
            "verse 49:1": "Hỡi những người có đức tin! Các ngươi chớ qua mặt Allah và Sứ Giả của Ngài. Các ngươi hãy kính sợ Allah. Quả thật, Allah là Đấng Hằng Nghe, Đấng Hằng Biết.",
            "verse 49:2": "Hỡi những người có đức tin! Các ngươi đừng cao giọng của các ngươi hơn giọng nói của Nabi (Muhammad) và cũng đừng lớn tiếng với Y trong lời nói giống như các ngươi thường nói lớn tiếng với nhau, kẻo việc làm của các ngươi sẽ trở nên vô nghĩa trong khi các ngươi không nhận ra.",
            "verse 49:3": "Thật vậy, những người hạ giọng của mình trước Sứ Giả của Allah chính là những người mà trái tim của họ đã được Allah rèn luyện cho ngay chính. Họ sẽ được tha thứ và sẽ được một phần thưởng vĩ đại.",
            "verse 49:4": "Quả thật, những người (lớn tiếng) gọi Ngươi (hỡi Thiên Sứ) từ bên ngoài nội phòng thì phần đông là những kẻ thiếu suy nghĩ.",
            "verse 49:5": "Nếu họ (chịu khó) kiên nhẫn (chờ đợi một chút) cho đến khi Ngươi bước ra ngoài để tiếp họ thì điều đó tốt hơn cho họ. Tuy nhiên, Allah là Đấng Tha Thứ, Đấng Nhân Từ.",
            "verse 49:6": "Hỡi những người có đức tin! Nếu có một kẻ gây rối mang đến một tin nào đó cho các ngươi thì các ngươi hãy kiểm tra thật kỹ càng (sự thật về nguồn tin), kẻo các ngươi có thể làm hại một nhóm người vì sự thiếu hiểu biết để rồi sau đó các ngươi trở nên hối hận về điều các ngươi đã làm.",
            "verse 49:7": "Các ngươi (hỡi những người có đức tin) hãy biết rằng Sứ Giả của Allah đang sống cùng với các ngươi. Nếu Y làm theo (ý kiến của) các ngươi về nhiều vấn đề thì chắc chắn các ngươi sẽ gặp khó khăn. Tuy nhiên, Allah làm cho các ngươi thấm nhuần đức tin và làm cho nó trở nên đẹp đẽ trong trái tim của các ngươi, đồng thời Ngài làm cho việc vô đức tin, gây rối và bất tuân trở nên đáng ghét đối với các ngươi. Đó là những người được hướng dẫn đúng đường.",
            "verse 49:8": "(Việc trái tim của các ngươi yêu thích điều tốt và ghét điều xấu là) hồng phúc và thiên ân từ nơi Allah. Quả thật, Allah là Đấng Hằng Biết, Đấng Chí Minh.",
            "verse 49:9": "Nếu trong số những người có đức tin có hai nhóm giao chiến với nhau thì các ngươi hãy giải hòa giữa đôi bên. Nhưng nếu nhóm này đàn áp nhóm kia thì các ngươi hãy chiến đấu chống lại nhóm đàn áp cho đến khi họ chịu quay về với Mệnh Lệnh của Allah. Và nếu họ đã chịu quay về thì các ngươi hãy giải hòa giữa đôi bên một cách công bằng và vô tư. Quả thật, Allah yêu thương những người hành động công bằng, vô tư.",
            "verse 49:10": "Quả thật chỉ những người có đức tin mới là anh em của nhau. Vì vậy, các ngươi hãy giải hòa giữa hai người anh em của mình. Các ngươi hãy sợ Allah mong rằng các ngươi được thương xót.",
            "verse 49:11": "Hỡi những người có đức tin! Nhóm người này chớ nên cười nhạo nhóm người kia bởi biết đâu nhóm người kia tốt hơn nhóm người này. Và nhóm phụ nữ này chớ nên cười nhạo nhóm phụ nữ kia bởi biết đâu nhóm phụ nữ kia tốt hơn nhóm phụ nữ này. Các ngươi đừng xúc phạm nhau và đừng gọi nhau bằng những biệt danh (mục đích nhạo báng và chế giễu). (Quả thật,) việc bêu tên xấu của một người sau khi y đã có đức tin là một hành động bất tuân (Allah). Và ai không sám hối thì đó là những kẻ làm điều sai quấy.",
            "verse 49:12": "Hỡi những người có đức tin! Các ngươi hãy tránh nhiều giả định (tiêu cực). Thật vậy, một số giả định là tội lỗi. Các ngươi đừng dọ thám cũng như đừng nói xấu lẫn nhau. Lẽ nào ai đó trong các ngươi thích ăn thịt của người anh em của mình đã chết? Vì vậy, các ngươi hãy ghét việc làm đó. Các ngươi hãy sợ Allah. Quả thật, Allah là Đấng chấp nhận sự ăn năn sám hối, Đấng Nhân Từ.",
            "verse 49:13": "Hỡi nhân loại! TA (Allah) đã tạo hóa các ngươi từ một người nam và một người nữ và làm cho các ngươi thành các quốc gia và những bộ lạc để các ngươi nhận biết lẫn nhau. Quả thật, người vinh dự và cao quý nhất ở nơi Allah là người có Taqwa (sự ngay chính, ngoan đạo và sợ Allah) nhất trong các ngươi. Quả thật, Allah là Đấng Hằng Biết, Đấng Thông Toàn.",
            "verse 49:14": "Những người Ả-rập vùng sa mạc nói: “Chúng tôi đã có đức tin.” Ngươi (Thiên Sứ Muhammad) hãy nói với họ: “Các người chưa có đức tin, các người hãy nói là chúng tôi đã quy thuận Islam bởi đức tin chưa thấm vào trái tim của các người. Tuy nhiên, nếu các người vâng lệnh Allah và Sứ Giả của Ngài thì Ngài sẽ không giảm bớt bất cứ điều gì (từ ân phước của) việc làm của các người. Quả thật, Allah là Đấng Tha Thứ, Đấng Nhân Từ.”",
            "verse 49:15": "Những người có đức tin đích thực chính là những người tin nơi Allah và Sứ Giả của Ngài rồi không hoài nghi bất cứ điều gì; họ chiến đấu cho con đường chính nghĩa của Allah bằng tài sản lẫn sinh mạng của họ. Họ là những người chân thật.",
            "verse 49:16": "Ngươi (Thiên Sứ Muhammad) hãy nói (với những người Ả-rập vùng sa mạc): “Chẳng lẽ các người muốn dạy Allah về tôn giáo của các người trong lúc Allah biết rõ mọi vật trong các tầng trời và mọi vật trên trái đất ư? Quả thật, Allah biết tất cả mọi thứ!”",
            "verse 49:17": "(Những người Ả-rập vùng sa mạc này) coi việc họ theo Islam là một ân huệ dành cho Ngươi (Hỡi Thiên Sứ Muhammad). Ngươi hãy nói với họ: “Các người đừng coi Islam của các người là một ân huệ dành cho Ta, mà chính Allah đã ban ân cho các người trong việc Ngài đã hướng dẫn các người đến với đức tin, nếu các người chân thật (trong việc đi theo Islam).”",
            "verse 49:18": "Quả thật, Allah biết điều vô hình của các tầng trời và trái đất. Và Allah nhìn thấy tất cả những gì các ngươi làm."
        },
        "Yoruba": {
            "verse 49:1": "Eyin ti e gbagbo ni ododo, eyin ko gbodo gbawaju mo Allahu ati Ojise Re lowo. Ki e si beru Allahu. Dajudaju Allahu ni Olugbo, Onimo",
            "verse 49:2": "Eyin ti e gbagbo ni ododo, e ma se gbe ohun yin ga bori ohun Anabi (sollalahu alayhi wa sallam). Ki e si ma se fi ohun ariwo ba a soro gege bi apa kan yin se n fi ohun ariwo ba apa kan soro nitori ki awon ise yin ma baa baje, eyin ko si nii fura",
            "verse 49:3": "Dajudaju awon t’o n re ohun won nile lodo Ojise Allahu, awon wonyen ni awon ti Allahu ti gbidanwo okan won fun iberu (Re). Aforijin ati esan nla wa fun won",
            "verse 49:4": "Dajudaju awon t’o n pe o lati eyin awon yara, opolopo won ni ko se laakaye",
            "verse 49:5": "Ti o ba je pe dajudaju won se suuru titi o maa fi jade si won ni, iba dara julo fun won. Allahu si ni Alaforijin, Asake-orun",
            "verse 49:6": "Eyin ti e gbagbo ni ododo, ti obileje kan ba mu iro kan wa ba yin, e se pelepele lati mo ododo (nipa oro naa) nitori ki e ma baa se awon eniyan kan ni suta pelu aimo. Leyin naa, ki e ma baa di alabaamo lori ohun ti e se",
            "verse 49:7": "Ki e si mo pe dajudaju Ojise Allahu wa laarin yin. Ti o ba je pe o n tele yin nibi opolopo ninu oro (t’o n sele) ni, dajudaju eyin iba ti ko o sinu idaamu. Sugbon Allahu je ki e nifee si igbagbo ododo. O se e ni oso sinu okan yin. O si je ki e korira aigbagbo, iwa buruku ati iyapa ase. Awon wonyen ni awon olumona",
            "verse 49:8": "(Eyi je) oore ajulo ati idera lati odo Allahu. Allahu si ni Onimo, Ologbon",
            "verse 49:9": "Ti igun meji ninu awon onigbagbo ododo ba n ba ara won ja, e se atunse laaarin awon mejeeji. Ti okan ninu awon mejeeji ba si koja enu-ala lori ikeji, e ba eyi ti o koja enu-ala ja titi o fi maa seri pada sibi ase Allahu. Ti o ba si seri pada, e se atunse laaarin awon mejeeji pelu deede. Ki e si se eto. Dajudaju Allahu feran awon oluse-eto",
            "verse 49:10": "Omo iya (esin) ni awon onigbagbo ododo. Nitori naa, e satunse laaarin awon omo iya yin mejeeji. Ki e si beru Allahu nitori ki A le ke yin",
            "verse 49:11": "Eyin ti e gbagbo ni ododo, awon eniyan kan ko gbodo fi awon eniyan kan se yeye. O le je pe awon (ti won so di oniyeye) dara ju awon (t’o n se yeye). Awon obinrin kan (ko si gbodo fi) awon obinrin kan (se yeye). O le je pe awon (ti won so di oniyeye) dara ju awon (t’o n se yeye). E ma se bura yin. E ma pe’ra yin loriki buruku leyin igbagbo ododo. Enikeni ti ko ba ronu piwada, awon wonyen ni awon alabosi",
            "verse 49:12": "Eyin ti e gbagbo ni ododo, e jinna si opolopo aroso. Dajudaju apa kan aroso ni ese. E ma se topinpin ara yin. Ki apa kan yin ma se soro apa kan leyin. Se okan ninu yin nifee si lati je eran-ara omo iya re t’o ti ku ni? E si korira re. E beru Allahu. Dajudaju Allahu ni Olugba-ironupiwada, Asake-orun",
            "verse 49:13": "Eyin eniyan, dajudaju Awa seda yin lati ara okunrin ati obinrin. A si se yin ni orile-ede orile-ede ati iran-iran nitori ki e le dara yin mo. Dajudaju alapon-onle julo ninu yin lodo Allahu ni eni t’o beru (Re) julo. Dajudaju Allahu ni Onimo, Alamotan",
            "verse 49:14": "Awon Larubawa oko so pe: \"A gbagbo ni ododo.\" So pe: \"Eyin ko gbagbo ni ododo.\" Sugbon e so pe: \"A gba ’Islam.\" niwon igba ti igbagbo ododo ko ti i wo’nu okan yin. Ti e ba tele (ase) Allahu ati Ojise Re, (Allahu) ko nii din kini kan ku fun yin ninu (esan) awon ise yin. Dajudaju Allahu ni Alaforijin, Asake-orun",
            "verse 49:15": "Awon onigbagbo ododo ni awon t’o gbagbo ninu Allahu ati Ojise Re, leyin naa ti won ko seyemeji, ti won si fi dukia won ati emi won jagun fun esin Allahu. Awon wonyen, awon ni olododo",
            "verse 49:16": "So pe: \"Se e maa ko Allahu ni esin yin ni?\" Allahu si mo ohunkohun t’o wa ninu awon sanmo ati ohunkohun t’o wa ninu ile. Allahu si ni Onimo nipa gbogbo nnkan",
            "verse 49:17": "Won n seregun lori re pe won gba ’Islam. So pe: \"E ma fi ’Islam yin seregun lori mi.” Bee ni! Allahu l’O maa seregun lori yin pe O fi yin mona sibi igbagbo ododo ti e ba je olododo",
            "verse 49:18": "Dajudaju Allahu mo ikoko awon sanmo ati ile. Ati pe Allahu ni Oluriran nipa ohun ti e n se nise"
        }
    }
}