{
    "id": 52,
    "name_simple": "At-Tur",
    "revelation_place": "makkah",
    "revelation_order": 76,
    "bismillah_pre": true,
    "verses_count": 49,
    "short_text": "It is derived from the very first cord 'Wat Tur-i.'",
    "text": [
        "\n",
        "It is derived from the very first cord \"Wat Tur-i.\"",
        "\n",
        "Period of Revelation",
        "\n",
        "From the internal evidence of the subject matter it appears that this Surah too was revealed in the same stage of the Holy Prophet's life at Makkah in which the Surah Adh-Dhariyat was revealed. While going through it one can clearly feel that during the period of its revelation the Holy Prophet (peace and blessings of Allah be upon him) was being showered with objections and accusations but there is no evidence yet to show that severe persecution of the Muslims had started.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "The subject matter of its first section (vv. 1-28) is the Hereafter. As arguments for its possibility, necessity and occurrence had already been given in Surah Adh-Dhariyat, these have not been repeated here. However, swearing an oath by some realities and signs which testify to the Hereafter, it has been stated most emphatically that it will surely come to pass, and none has the power to prevent its occurrence. Then, it has been stated as to what will be the fate of those who deny it when it actually occurs, and how will those who believe in it and adopt the way of piety and righteousness accordingly, be blessed by Allah.",
        "\n",
        "Then, in the second section (vv. 29-49) the Quraish chiefs' attitude towards the message of the Holy Prophet (peace and blessings of Allah he upon him) has been criticized. They called him a sorcerer, a madman, or a poet, and would thus mislead the common people against him so that they should not pay any serious attention to the message he preached. They looked upon him as a calamity that had suddenly descended on them and would openly wish that he met with a disaster so that they were rid of him. They accused him of fabricating the Qur'an by himself and of presenting it in the name of Allah, and this was, God forbid, a fraud that he was practicing. They would often taunt him, saying that God could not have appointed an ordinary man like him to the office of Prophethood. They expressed great disgust at his invitation and message and would avoid him as if he was asking them for a reward for it. They would sit and take counsels together to devise schemes in order to put an end to\r\nhis mission. And while they did all this they never realized what creeds of ignorance they were involved in and how selflessly and sincerely was Muhammad (peace and blessings of Allah be upon him) exerting himself to deliver them from their error. While criticizing them for this attitude and conduct, Allah has put them certain questions, one after the other, each of which is either an answer to some objection of theirs, or a criticism of some error. Then, it has been said that it would absolutely be of no avail to show them a miracle in order to convince them of his Prophethood, for they were such stubborn people as would misinterpret anything they were shown only to avoid affirming the faith.",
        "\n",
        "In the beginning of this section as well as in its end, the Holy Prophet (peace and blessings of Allah be upon him) has been given the instruction that he should persistently continue giving his invitation and preaching his message in spite of the accusations and objections of his opponents and enemies, and should endure their resistance patiently till Allah's judgment comes to pass. Besides, he has been consoled, as if to say \"Your Lord has not left you alone to face your enemies, after raising you as a Prophet, but He is constantly watching over you. Therefore, endure every hardship patiently till the Hour of His judgment comes, and seek through praising and glorifying your Lord the power that is required for exerting in the cause of Allah under such conditions.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Mount of Sinai, where the Torah was revealed to Moses. It takes its name from “the mount” (ṭūr) mentioned in verse 1. The surah which addresses many of the arguments put to the Prophet by the disbelievers of Mecca (verse 29 .). The bliss that will be enjoyed by the believers is contrasted to the torments of Hell, and the Prophet is urged to bide his time, to continue to deliver his message, and to wait with confidence for God’s judgement. God swears by, among other things, Mount Sinai, that the Day of Judgement is inevitable.The surah is also known as: Mount Tur, The Mountain.",
    "name_translation": "The Mount",
    "name_complex": "At-Tûr",
    "surah_name_ar": "الطور",
    "verses": {
        "Albanian": {
            "verse 52:1": "Pasha malin e Turit (Sinajit),",
            "verse 52:2": "dhe Librin e shkruar në rreshta,",
            "verse 52:3": "të zhvilluar në lëkurë,",
            "verse 52:4": "dhe Tempullin plot haxhinj,",
            "verse 52:5": "dhe kupës së ngritur (të qiellit),",
            "verse 52:6": "dhe detit të mbushur,",
            "verse 52:7": "me të vërtetë, dënimi i Zotit tënd, do të ndodhë,",
            "verse 52:8": "dhe askush nuk mund ta pengojë,",
            "verse 52:9": "atë Ditë kur qielli do të lëkundet fuqishëm,",
            "verse 52:10": "e malet të lëkunden me të madhe nga vendi!",
            "verse 52:11": "Atë Ditë, mjerë për ata që kanë përgënjeshtruar,",
            "verse 52:12": "që, të zhytur në gënjeshtra, argëtoheshin!",
            "verse 52:13": "Atë Ditë, kur me forcë do të hidhen në zjarrin e xhehennemit.",
            "verse 52:14": "(U thuhet atyre): “Ky është zjarri që e keni përgënjeshtruar,",
            "verse 52:15": "pra, a është kjo magji, apo ju nuk shihni?",
            "verse 52:16": "Përcëllohuni në të; e, duroni apo mos duroni, njësoj është për ju, - ky është ndëshkimi juaj vetëm për atë që keni bërë”.",
            "verse 52:17": "Me të vërtetë, ata që kanë besuar do të gjenden në kopshtet e xhennetit dhe lumturi,",
            "verse 52:18": "duke u kënaqur me atë që u ka dhënë Zoti i tyre, i ka ruajtur ata Zoti i tyre prej dënimit të skëterrës.",
            "verse 52:19": "(Atyre u thuhet): “Hani e pni me kënaqësi, për atë që keni punuar!”",
            "verse 52:20": "Të mbështetur në divane (kanape) të renditura, do t’i martojmë ata me hyrie, sysh të bukur.",
            "verse 52:21": "E, ata që kanë besuar dhe u shkojnë pas pasardhësit e tyre në besim, do t’ju bashkojmë pasardhësit e tyre dhe nuk do t’ju pakësojmë asgjë nga veprat e tyre – çdo njeri është peng (përgjegjës) për atë që ka punuar –",
            "verse 52:22": "dhe do t’ju zgjërojmë dhuntitë atyre me pemë dhe mish që ju ka ënda;",
            "verse 52:23": "në të (xhennet) ia zgjasin njëri-tjetrit gotat e mbushura, aty nuk do të ketë biseda të kota, as mëkate, -",
            "verse 52:24": "e, do të sillen rreth tyre shërbyes (gilmanët) djelmosha të ngjashëm me margaritarin e ruajtur,",
            "verse 52:25": "dhe njëri-tjetrit i drejtohen duke e pyetur,",
            "verse 52:26": "e do të thonë: “Ne, më parë – në familjet tona jemi frikësuar (nga dënimi),",
            "verse 52:27": "e, Perëndia na ka dhuruar mëshirë dhe na ka ruajtur nga dënimi i rëndë (i frumës helmuese).",
            "verse 52:28": "Ne, më parë (në jetën tokësore) e kemi adhuruar Atë, Ai, me të vërtetë, është bamirës dhe mëshirues”.",
            "verse 52:29": "Andaj, këshillo ti (o Muhammed), se ti, me dhuntinë (profetninë) e Zotit tënd, nuk je as fallxhi as i çmendur.",
            "verse 52:30": "Ose të thonë ata: “(Ai – Muhammedi është) vjershtar, të presim derisa ta zhdukë vdekja”.",
            "verse 52:31": "Thuaju (atyre): “Pritni, se, me të vërtetë, edhe unë jam nga ata që presin!”",
            "verse 52:32": "A mos u vie atyre kjo nga mendja e tyre, apo ata janë popull kryeneç (që e kanë kaluar kufirin)?",
            "verse 52:33": "Apo thonë: “Ai e ka trilluar atë (Kur’anin)”. – Jo, por ata nuk besojnë;",
            "verse 52:34": "andaj, le ta sjellin ata një fjalim të ngjashëm me të, nëse thonë të vërtetën!",
            "verse 52:35": "A mos vallë, ata janë krijuar pa Krijues, apo mos janë ata krijues të vetvetes?!",
            "verse 52:36": "A mos vallë ata kanë krijuar qiejt dhe Tokën?! Jo, por ata nuk duan të besojnë.",
            "verse 52:37": "Vallë, a mos në ta është thesari i Zotit tënd, ose, vallë ata sundojnë?",
            "verse 52:38": "Vallë, a mos kanë shkallë (me të cilat ngjiten lart) e përgjojnë?! E, le të sjell (ai) përgjuesi i tyre argument të qartë!",
            "verse 52:39": "Apo, për Te janë vajzat, e për ju djemtë?!",
            "verse 52:40": "Vallë a mos kërkon ti prej tyre shpërblim, e që ata të jenë të ngarkuar me këtë?!",
            "verse 52:41": "Ose, a mos tek ata është sekreti, e ata e përshkruajnë?!",
            "verse 52:42": "Apo dëshirojnë ngatërresë, e vetëm mohuesit do të jenë të ngatërruar?",
            "verse 52:43": "Ose ata kanë zot (tjetër) pos Perëndisë? Perëndia është i Lartësuar mbi atë çka i përshkruajnë Atij!",
            "verse 52:44": "Dhe, sikur të shihni se po bie një copë nga qielli, do të thoshin: “Retë e grumbulluara!”",
            "verse 52:45": "E, lëri ata, derisa të mos takohen me Ditën në të cilën do të shkatërrohen.",
            "verse 52:46": "Ditën në të cilën, dinakëritë e tyre nu do t’u bëjnë dobi asgjë dhe kur ata nuk do t’i ndihmojë askush.",
            "verse 52:47": "E, me të vërtetë, për zullumqarët ka edhe dënim tjetër pos këtij; por (këtë) shumica e tyre nuk e dijnë.",
            "verse 52:48": "E, ti duro për Vendimin e Zotit tënd! Me të vërtetë, ti je nën mbrojtjen Tonë; dhe lavdëroje duke e falenderuar Zotin tënd kur të ngritesh,",
            "verse 52:49": "dhe, madhëroje Ate edhe natën edhe pas perëndimit të yjeve!"
        },
        "Amharic": {
            "verse 52:1": "በጡር (ጋራ) እምላለሁ፡፡",
            "verse 52:2": "በተጻፈው መጽሐፍም፡፡",
            "verse 52:3": "በተዘረጋ ብራና ላይ፤ (በተጻፈው)፡፡",
            "verse 52:4": "በደመቀው ቤትም፡፡",
            "verse 52:5": "ከፍ በተደረገው ጣራም፡፡",
            "verse 52:6": "በተመላው ባሕርም እምላለሁ፡፡",
            "verse 52:7": "የጌታህ ቅጣት በእርግጥ ወዳቂ ነው፤ (የማይቀር ነው)፡፡",
            "verse 52:8": "ለእርሱ ምንም ገፍታሪ የለውም፡፡",
            "verse 52:9": "ሰማይ ብርቱ መዞርን በምትዞርበት ቀን (ይኾናል)፡፡",
            "verse 52:10": "ተራራዎችም መኼድን በሚኼዱበት (ቀን)፡፡",
            "verse 52:11": "ለአስተባባዮችም ያን ጊዜ ወዮላቸው፡፡",
            "verse 52:12": "ለእነዚያ እነርሱ በውሸት ውስጥ የሚጫወቱ ለኾኑት፡፡",
            "verse 52:13": "ወደ ገሀነም እሳት በኀይል መግገፍተርን በሚግገፈተሩበት ቀን፡፡",
            "verse 52:14": "ይህቺ ያቺ በእርሷ ታስተባብሉባት የነበራችሁት እሳት ናት፡፡",
            "verse 52:15": "ይህ (ፊት ትሉ እንደነበራችሁት) ድግምት ነውን? ወይስ እናንተ አታዩምን?",
            "verse 52:16": "ግቧት ታገሱም ወይም አትታገሡ በእናንተ ላይ እኩል ነው፡፡ የምትምመነዱት ትሠሩት የነበራችሁትን (ፍዳ) ብቻ ነው (ይባላሉ)፡፡",
            "verse 52:17": "አላህን ፈሪዎቹ በእርግጥ በገነቶችና በጸጋ ውስጥ ናቸው፡፡",
            "verse 52:18": "ጌታቸው በሰጣቸው ጸጋ ተደሳቾች ኾነው (በገነት ውስጥ ናቸው)፡፡ የገሀነምንም ስቃይ ጌታቸው ጠበቃቸው፡፡",
            "verse 52:19": "«ትሠሩት በነበራችሁት ምክንያት ተደሳቾች ኾናችሁ ብሉ፤ ጠጡም፤» (ይባላሉ)፡፡",
            "verse 52:20": "በተደረደሩ አልጋዎች ላይ ተደጋፊዎች ኾነው (በገነት ይኖራሉ)፡፡ ዓይናማዎች በኾኑ ነጫጭ ሴቶችም እናጠናዳቸዋለን፡፡",
            "verse 52:21": "እነዚያም ያመኑትና ዝርያቸውም በእምነት የተከተለቻቸው ዝርያቸውን በእነርሱ እናስጠጋለን፡፡ ከሥራቸውም ምንም አናጎድልባቸውም፡፡ ሰው ሁሉ በሠራው ሥራ ተያዢ ነው፡፡",
            "verse 52:22": "ከሚሹትም ሁሉ እሸትንና ስጋን እንጨምርላቸዋለን፡፡",
            "verse 52:23": "በውስጧ መጠጥን ይሰጣጣሉ፡፡ በውስጧ ውድቅ ንግግርና መውወንጀልም የለም፡፡",
            "verse 52:24": "ለነርሱም የኾኑ ወጣቶች ልክ የተሸፈነ ሉል መስለው በእነርሱ ላይ (ለማሳለፍ) ይዘዋወራሉ፡፡",
            "verse 52:25": "የሚጠያየቁ ኾነውም ከፊላቸው በከፊሉ ላይ ይዞራል፡፡",
            "verse 52:26": "«እኛ ፊት በቤተሰቦቻችን ውስጥ (ከቅጣት) ፈሪዎች ነበርን» ይላሉ፡፡",
            "verse 52:27": "«አላህም በእኛ ላይ ለገሰ፡፡ የመርዛም እሳት ቅጣትንም ጠበቀን፡፡",
            "verse 52:28": "«እኛ ከዚህ በፊት እንለምነው ነበርን፡፡ እነሆ እርሱ በጎ ዋይ አዛኝ ነውና» (ይላሉ)፡፡",
            "verse 52:29": "(ሰዎችን) አስታውስም፡፡ አንተም በጌታህ ጸጋ ምክንያት ጠንቋይም ዕብድም አይደለህም፡፡",
            "verse 52:30": "ይልቁንም የሞትን አደጋ በእርሱ የምንጠባበቅበት የኾነ ባለ ቅኔ ነው ይላሉን?",
            "verse 52:31": "«ተጠባበቁ፤ እኔም ከእናንተ ጋር ከሚጠባበቁት ነኝ» በላቸው፡፡",
            "verse 52:32": "አእምሮዎቻቸው በዚህ ያዟቸዋልን? አይደለም በእውነቱ እነርሱ ወሰን አላፊዎች ሕዝቦች ናቸው፡፡",
            "verse 52:33": "ወይም «ቀጠፈው ይላሉን?» አይደለም፤ በእውነቱ አያምኑም፡፡",
            "verse 52:34": "እውነተኞችም ቢኾኑ መሰሉ የኾነን ንግግር ያምጡ፡፡",
            "verse 52:35": "ወይስ ያለ አንዳች (ፈጣሪ) ተፈጠሩን? ወይስ እነርሱ ፈጣሪዎች ናቸውን?",
            "verse 52:36": "ወይስ ሰማያትንና ምድርን ፈጠሩን? አይደለም አያረጋግጡም፡፡",
            "verse 52:37": "ወይስ የጌታህ ግምጃ ቤቶች እነርሱ ዘንድ ናቸውን? ወይስ እነርሱ አሸናፊዎች ናቸውን?",
            "verse 52:38": "ወይስ ለእነርሱ በእርሱ ላይ (ከሰማይ) የሚያዳምጡበት መሰላል አላቸውን? አድማጫቸውም (ሰማሁ ቢል) ግልጽን አስረጅ ያምጣ፡፡",
            "verse 52:39": "ወይስ ለእርሱ ሴቶች ልጆች አሉትን? ለእናንተም ወንዶች ልጆች አሏችሁን?",
            "verse 52:40": "ወይስ ዋጋን ትጠይቃቸዋለህን? ስለዚህ እነርሱ ከዕዳው የተከበዱ ናቸውን?",
            "verse 52:41": "ወይስ ሩቁ ምስጢር እነርሱ ዘንድ ነውን? ስለዚህ እነርሱ ይጽፋሉን?",
            "verse 52:42": "ወይስ ተንኮልን (ባንተ) ይሻሉን? እነዚያም የካዱት እነርሱ በተንኮል ተሸናፊዎች ናቸው፡፡",
            "verse 52:43": "ወይስ ለእነርሱ ከአላህ ሌላ አምላክ አላቸውን? አላህ ከሚያጋሩት ሁሉ ጠራ፡፡",
            "verse 52:44": "ከሰማይም ቁራጭን (በእነርሱ ላይ) ወዳቂ ኾኖ ቢያዩ ኖሮ «ይህ የተደራረበ ደመና ነው» ይሉ ነበር፡፡",
            "verse 52:45": "ያንንም በእርሱ የሚግገደሉበትን ቀናቸውን እስከሚገናኙ ድረስ ተዋቸው፡፡",
            "verse 52:46": "ተንኮላቸው ከእነርሱ ምንንም የማይጠቅማቸውንና እነርሱም የማይርረዱበትን ቀን (እስከ ሚገናኙ ተዋቸው)፡፡",
            "verse 52:47": "ለእነዚያ ለበደሉትም ከዚህ ሌላ ቅርብ ቅጣት አልላቸው፡፡ ግን አብዛኛዎቻቸው አያውቁም፡፡",
            "verse 52:48": "ለጌታህ ፍርድም ታገሥ፡፡ አንተ በጥበቃችን ውስጥ ነህና፡፡ ጌታህንም በምትነሳ ጊዜ ከማመስገን ጋር አወድሰው፡፡",
            "verse 52:49": "ከሌሊቱም አወድሰው፡፡ በከዋክብት መዳበቂያ ጊዜም (ንጋት ላይ አወድሰው)፡፡"
        },
        "Arabic": {
            "verse 52:1": "ِروُّطلاَو",
            "verse 52:2": "ٍروُطْسَّم ٍباَتِكَو",
            "verse 52:3": "ٍروُشنَّم ٍّقَر يِف",
            "verse 52:4": "ِروُمْعَمْلا ِتْيَبْلاَو",
            "verse 52:5": "ِعوُفْرَمْلا ِفْقَّسلاَو",
            "verse 52:6": "ِروُجْسَمْلا ِرْحَبْلاَو",
            "verse 52:7": "ٌعِقاَوَل َكِّبَر َباَذَع َّنِإ",
            "verse 52:8": "ٍعِفاَد نِم ُهَل اَّم",
            "verse 52:9": "اًرْوَم ُءاَمَّسلا ُروُمَت َمْوَي",
            "verse 52:10": "(اًرْيَس ُلاَبِجْلا ُريِسَتَو",
            "verse 52:11": "(َنيِبِّذَكُمْلِّل ٍذِئَمْوَي ٌلْيَوَف",
            "verse 52:12": "(َنوُبَعْلَي ٍضْوَخ يِف ْمُه َنيِذَّلا",
            "verse 52:13": "(اًّعَد َمَّنَهَج ِراَن ٰىَلِإ َنوُّعَدُي َمْوَي",
            "verse 52:14": "(َنوُبِّذَكُت اَهِب مُتنُك يِتَّلا ُراَّنلا ِهِذَٰه",
            "verse 52:15": "(َنوُرِصْبُت اَل ْمُتنَأ ْمَأ اَذَٰه ٌرْحِسَفَأ",
            "verse 52:16": "(َنوُلَمْعَت ْمُتنُك اَم َنْوَزْجُت اَمَّنِإ ۖ ْمُكْيَلَع ٌءاَوَس اوُرِبْصَت اَل ْوَأ اوُرِبْصاَف اَهْوَلْصا",
            "verse 52:17": "(ٍميِعَنَو ٍتاَّنَج يِف َنيِقَّتُمْلا َّنِإ",
            "verse 52:18": "(ِميِحَجْلا َباَذَع ْمُهُّبَر ْمُهاَقَوَو ْمُهُّبَر ْمُهاَتآ اَمِب َنيِهِكاَف",
            "verse 52:19": "(َنوُلَمْعَت ْمُتنُك اَمِب اًئيِنَه اوُبَرْشاَو اوُلُك",
            "verse 52:20": "(ٍنيِع ٍروُحِب مُهاَنْجَّوَزَو ۖ ٍةَفوُفْصَّم ٍرُرُس ٰىَلَع َنيِئِكَّتُم",
            "verse 52:21": "(ٌنيِهَر َبَسَك اَمِب ٍئِرْما ُّلُك ۚ ٍءْيَش نِّم مِهِلَمَع ْنِّم مُهاَنْتَلَأ اَمَو ْمُهَتَّيِّرُذ ْمِهِب اَنْقَحْلَأ ٍناَميِإِب مُهُتَّيِّرُذ ْمُهْتَعَبَّتاَو اوُنَمآ َنيِذَّلاَو",
            "verse 52:22": "(َنوُهَتْشَي اَّمِّم ٍمْحَلَو ٍةَهِكاَفِب مُهاَنْدَدْمَأَو",
            "verse 52:23": "(ٌميِثْأَت اَلَو اَهيِف ٌوْغَل اَّل اًسْأَك اَهيِف َنوُعَزاَنَتَي",
            "verse 52:24": "(ٌنوُنْكَّم ٌؤُلْؤُل ْمُهَّنَأَك ْمُهَّل ٌناَمْلِغ ْمِهْيَلَع ُفوُطَيَو ۞",
            "verse 52:25": "(َنوُلَءاَسَتَي ٍضْعَب ٰىَلَع ْمُهُضْعَب َلَبْقَأَو",
            "verse 52:26": "(َنيِقِفْشُم اَنِلْهَأ يِف ُلْبَق اَّنُك اَّنِإ اوُلاَق",
            "verse 52:27": "(ِموُمَّسلا َباَذَع اَناَقَوَو اَنْيَلَع ُهَّللا َّنَمَف",
            "verse 52:28": "(ُميِحَّرلا ُّرَبْلا َوُه ُهَّنِإ ۖ ُهوُعْدَن ُلْبَق نِم اَّنُك اَّنِإ",
            "verse 52:29": "(ٍنوُنْجَم اَلَو ٍنِهاَكِب َكِّبَر ِتَمْعِنِب َتنَأ اَمَف ْرِّكَذَف",
            "verse 52:30": "(ِنوُنَمْلا َبْيَر ِهِب ُصَّبَرَتَّن ٌرِعاَش َنوُلوُقَي ْمَأ",
            "verse 52:31": "(َنيِصِّبَرَتُمْلا َنِّم مُكَعَم يِّنِإَف اوُصَّبَرَت ْلُق",
            "verse 52:32": "(َنوُغاَط ٌمْوَق ْمُه ْمَأ ۚ اَذَٰهِب مُهُماَلْحَأ ْمُهُرُمْأَت ْمَأ",
            "verse 52:33": "(َنوُنِمْؤُي اَّل لَب ۚ ُهَلَّوَقَت َنوُلوُقَي ْمَأ",
            "verse 52:34": "(َنيِقِداَص اوُناَك نِإ ِهِلْثِّم ٍثيِدَحِب اوُتْأَيْلَف",
            "verse 52:35": "(َنوُقِلاَخْلا ُمُه ْمَأ ٍءْيَش ِرْيَغ ْنِم اوُقِلُخ ْمَأ",
            "verse 52:36": "(َنوُنِقوُي اَّل لَب ۚ َضْرَأْلاَو ِتاَواَمَّسلا اوُقَلَخ ْمَأ",
            "verse 52:37": "(َنوُرِطْيَصُمْلا ُمُه ْمَأ َكِّبَر ُنِئاَزَخ ْمُهَدنِع ْمَأ",
            "verse 52:38": "(ٍنيِبُّم ٍناَطْلُسِب مُهُعِمَتْسُم ِتْأَيْلَف ۖ ِهيِف َنوُعِمَتْسَي ٌمَّلُس ْمُهَل ْمَأ",
            "verse 52:39": "(َنوُنَبْلا ُمُكَلَو ُتاَنَبْلا ُهَل ْمَأ",
            "verse 52:40": "(َنوُلَقْثُّم ٍمَرْغَّم نِّم مُهَف اًرْجَأ ْمُهُلَأْسَت ْمَأ",
            "verse 52:41": "(َنوُبُتْكَي ْمُهَف ُبْيَغْلا ُمُهَدنِع ْمَأ",
            "verse 52:42": "(َنوُديِكَمْلا ُمُه اوُرَفَك َنيِذَّلاَف ۖ اًدْيَك َنوُديِرُي ْمَأ",
            "verse 52:43": "(َنوُكِرْشُي اَّمَع ِهَّللا َناَحْبُس ۚ ِهَّللا ُرْيَغ ٌهَٰلِإ ْمُهَل ْمَأ",
            "verse 52:44": "(ٌموُكْرَّم ٌباَحَس اوُلوُقَي اًطِقاَس ِءاَمَّسلا َنِّم اًفْسِك اْوَرَي نِإَو",
            "verse 52:45": "(َنوُقَعْصُي ِهيِف يِذَّلا ُمُهَمْوَي اوُقاَلُي ٰىَّتَح ْمُهْرَذَف",
            "verse 52:46": "(َنوُرَصنُي ْمُه اَلَو اًئْيَش ْمُهُدْيَك ْمُهْنَع يِنْغُي اَل َمْوَي",
            "verse 52:47": "(َنوُمَلْعَي اَل ْمُهَرَثْكَأ َّنِكَٰلَو َكِلَٰذ َنوُد اًباَذَع اوُمَلَظ َنيِذَّلِل َّنِإَو",
            "verse 52:48": "(ُموُقَت َنيِح َكِّبَر ِدْمَحِب ْحِّبَسَو ۖ اَنِنُيْعَأِب َكَّنِإَف َكِّبَر ِمْكُحِل ْرِبْصاَو",
            "verse 52:49": "(ِموُجُّنلا َراَبْدِإَو ُهْحِّبَسَف ِلْيَّللا َنِمَو"
        },
        "Azerbaijani": {
            "verse 52:1": "And olsun dağa!",
            "verse 52:2": "And olsun yazılmış Kitaba –",
            "verse 52:3": "nazik dəri üzərində olan Kitaba!",
            "verse 52:4": "And olsun Beytulməmura!",
            "verse 52:5": "And olsun yüksək tavana!",
            "verse 52:6": "And olsun alovlanan dənizə!",
            "verse 52:7": "Rəbbinin əzabı hökmən vaqe olacaqdır.",
            "verse 52:8": "Heç nə onun qarşısını ala bilməz.",
            "verse 52:9": "O gün göy şiddətlə sarsılacaq,",
            "verse 52:10": "dağlar da hərəkətə gələcəkdir.",
            "verse 52:11": "O gün vay halına haqqı yalan sayanların!",
            "verse 52:12": "O kəslər ki, yalan bataqlığında əylənirlər.",
            "verse 52:13": "O gün onlar amansızcasına sürüdülərək Cəhənnəm oduna atılacaqlar.",
            "verse 52:14": "Onlara deyiləcək: “Bu sizin yalan saydığınız Cəhənnəm odudur!",
            "verse 52:15": "Bəlkə bu da sehrdir, siz görmürsünüz?",
            "verse 52:16": "Yanın orada! Dözsəniz də, dözməsəniz də sizin üçün eynidir. Sizə ancaq etdiyiniz əməllərin cəzası verilir”.",
            "verse 52:17": "Şübhəsiz ki, müttəqilər Cənnət bağlarında və nemət içində yaşayacaqlar.",
            "verse 52:18": "Rəbbinin onlara bəxş etdiyinə sevinəcəklər. Rəbbi onları Cəhənnəm əzabından xilas etmişdir.",
            "verse 52:19": "Onlara deyiləcək: “Xeyirxah əməllərinizin əvəzi olaraq nuşcanlıqla yeyin, için!”",
            "verse 52:20": "Onlar səflərlə salınmış mütəkkələrə dirsəklənəcəklər. Biz onları iri qaragözlü hurilərlə evləndirəcəyik.",
            "verse 52:21": "Möminlərin imanda onların arxasınca gedən nəsillərini də Cənnətdə özlərinə qovuşduracağıq. Onların əməllərindən heç bir şey əskiltməyəcəyik. Hər kəs qazandığının girovudur.",
            "verse 52:22": "Onlara istədikləri meyvədən və ətdən bol-bol verəcəyik.",
            "verse 52:23": "Onlar orada bir-birinə şərab dolu badə uzadacaqlar. Bu şərab onları nə boşboğazlığa, nə də günaha təhrik etməz.",
            "verse 52:24": "Onların ətrafında xidmətlərinə verilmiş, qorunub saxlanılan mirvari kimi yeniyetmə oğlanlar dolanacaqlar.",
            "verse 52:25": "Onlar bir-birinə üz tutub soruşacaqlar.",
            "verse 52:26": "Onlar deyəcəklər: “Biz əvvəllər ailəmiz içində olarkən Allahdan qorxurduq.",
            "verse 52:27": "Allah da bizə mərhəmət göstərdi və bizi qızmar yel əzabından qorudu.",
            "verse 52:28": "Biz əvvəllər Ona dua edirdik. Həqiqətən, O, yaxşılıq edəndir, Rəhmlidir!”",
            "verse 52:29": "Onlara xatırlat! Sən öz Rəbbinin neməti sayəsində nə kahinsən, nə də dəli!",
            "verse 52:30": "Yoxsa onlar: “O bir şairdir. Biz onun ölümünü gözləyirik!”– deyirlər.",
            "verse 52:31": "De: “Gözləyin, mən də sizinlə birlikdə gözləyənlərdənəm!”",
            "verse 52:32": "Yoxsa onların ağılları bunu onlara əmr edir? Yaxud onlar azğın adamlardır?",
            "verse 52:33": "Yoxsa onlar: “Bunu özündən uydurdun!”– deyirlər. Xeyr, onlar iman gətirmirlər.",
            "verse 52:34": "Əgər doğru söyləyirlərsə, qoy ona (Qurana) bənzər bir kəlam gətirsinlər.",
            "verse 52:35": "Bəlkə onlar öz-özünə yaranıblar? Yaxud onlar yaradanlardır?",
            "verse 52:36": "Yoxsa onlar göyləri və yeri yaradıblar? Xeyr, onlar qətiyyən inanmırlar.",
            "verse 52:37": "Yoxsa sənin Rəbbinin xəzinələri onlardadır? Yaxud onlar hökm sahibidirlər?",
            "verse 52:38": "Yoxsa onların, üstünə çıxıb mələklərin söhbətlərini dinlədikləri bir nərdivanı vardır? Onda qoy onların mələkləri dinləyənləri anlaşıqlı bir dəlil gətirsinlər!",
            "verse 52:39": "Yoxsa qızlar Onun, oğlanlar isə sizindir?",
            "verse 52:40": "Yoxsa sən onlardan bir mükafat istəyirsən və onlar da borclu qaldıqlarına görə ağır yük altındadırlar?",
            "verse 52:41": "Yoxsa onlar qeybi bilir və onu yazırlar?",
            "verse 52:42": "Yoxsa bir hiylə qurmaq istəyirlər? Amma kafirlər özləri o hiylənin qurbanı olacaqlar.",
            "verse 52:43": "Yoxsa onların Allahdan başqa bir məbudu var? Allah onların qoşduqları şəriklərdən uzaqdır.",
            "verse 52:44": "Əgər onlar göy parçalarının düşdüyünü görsələr: “Bulud topasıdır!”– deyərlər.",
            "verse 52:45": "Sən onları sarsılacaqları günə qovuşana qədər tərk et!",
            "verse 52:46": "O gün hiylələri onlara heç bir fayda verməyəcək və onlara kömək göstərilməyəcəkdir.",
            "verse 52:47": "Həqiqətən, zalımlar üçün bundan başqa əzab da hazırlanmışdır. Lakin onların çoxu bunu bilmir.",
            "verse 52:48": "Sən öz Rəbbinin hökmünə səbir et! Həqiqətən, sən Bizim Gözlərimiz önündəsən. Yuxudan qalxdıqda Rəbbini həmd ilə zikr et!",
            "verse 52:49": "Gecənin bir vaxtında, bir də ulduzlar batandan sonra Onun şəninə təriflər de!"
        },
        "Bengali": {
            "verse 52:1": "কসম তূরপর্বতের,",
            "verse 52:2": "এবং লিখিত কিতাবের,",
            "verse 52:3": "প্রশস্ত পত্রে,",
            "verse 52:4": "কসম বায়তুল-মামুর তথা আবাদ গৃহের,",
            "verse 52:5": "এবং সমুন্নত ছাদের,",
            "verse 52:6": "এবং উত্তাল সমুদ্রের,",
            "verse 52:7": "আপনার পালনকর্তার শাস্তি অবশ্যম্ভাবী,",
            "verse 52:8": "তা কেউ প্রতিরোধ করতে পারবে না।",
            "verse 52:9": "সেদিন আকাশ প্রকম্পিত হবে প্রবলভাবে।",
            "verse 52:10": "এবং পর্বতমালা হবে চলমান,",
            "verse 52:11": "সেদিন মিথ্যারোপকারীদের দুর্ভোগ হবে,",
            "verse 52:12": "যারা ক্রীড়াচ্ছলে মিছেমিছি কথা বানায়।",
            "verse 52:13": "সেদিন তোমাদেরকে জাহান্নামের অগ্নির দিকে ধাক্কা মেরে মেরে নিয়ে যাওয়া হবে।",
            "verse 52:14": "এবং বলা হবেঃ এই সেই অগ্নি, যাকে তোমরা মিথ্যা বলতে,",
            "verse 52:15": "এটা কি জাদু, না তোমরা চোখে দেখছ না?",
            "verse 52:16": "এতে প্রবেশ কর অতঃপর তোমরা সবর কর অথবা না কর, উভয়ই তোমাদের জন্য সমান। তোমরা যা করতে তোমাদেরকে কেবল তারই প্রতিফল দেয়া হবে।",
            "verse 52:17": "নিশ্চয় খোদাভীরুরা থাকবে জান্নাতে ও নেয়ামতে।",
            "verse 52:18": "তারা উপভোগ করবে যা তাদের পালনকর্তা তাদের দেবেন এবং তিনি জাহান্নামের আযাব থেকে তাদেরকে রক্ষা করবেন।",
            "verse 52:19": "তাদেরকে বলা হবেঃ তোমরা যা করতে তার প্রতিফলস্বরূপ তোমরা তৃপ্ত হয়ে পানাহার কর।",
            "verse 52:20": "তারা শ্রেণীবদ্ধ সিংহাসনে হেলান দিয়ে বসবে। আমি তাদেরকে আয়তলোচনা হুরদের সাথে বিবাহবন্ধনে আবদ্ধ করে দেব।",
            "verse 52:21": "যারা ঈমানদার এবং যাদের সন্তানরা ঈমানে তাদের অনুগামী, আমি তাদেরকে তাদের পিতৃপুরুষদের সাথে মিলিত করে দেব এবং তাদের আমল বিন্দুমাত্রও হ্রাস করব না। প্রত্যেক ব্যক্তি নিজ কৃত কর্মের জন্য দায়ী।",
            "verse 52:22": "আমি তাদেরকে দেব ফল-মূল এবং মাংস যা তারা চাইবে।",
            "verse 52:23": "সেখানে তারা একে অপরকে পানপাত্র দেবে; যাতে অসার বকাবকি নেই এবং পাপকর্মও নেই।",
            "verse 52:24": "সুরক্ষিত মোতিসদৃশ কিশোররা তাদের সেবায় ঘুরাফেরা করবে।",
            "verse 52:25": "তারা একে অপরের দিকে মুখ করে জিজ্ঞাসাবাদ করবে।",
            "verse 52:26": "তারা বলবেঃ আমরা ইতিপূর্বে নিজেদের বাসগৃহে ভীত-কম্পিত ছিলাম।",
            "verse 52:27": "অতঃপর আল্লাহ আমাদের প্রতি অনুগ্রহ করেছেন এবং আমাদেরকে আগুনের শাস্তি থেকে রক্ষা করেছেন।",
            "verse 52:28": "আমরা পূর্বেও আল্লাহকে ডাকতাম। তিনি সৌজন্যশীল, পরম দয়ালু।",
            "verse 52:29": "অতএব, আপনি উপদেশ দান করুন। আপনার পালনকর্তার কৃপায় আপনি অতীন্দ্রিয়বাদী নন এবং উম্মাদও নন।",
            "verse 52:30": "তারা কি বলতে চায়ঃ সে একজন কবি আমরা তার মৃত্যু-দুর্ঘটনার প্রতীক্ষা করছি।",
            "verse 52:31": "বলুনঃ তোমরা প্রতীক্ষা কর, আমিও তোমাদের সাথে প্রতীক্ষারত আছি।",
            "verse 52:32": "তাদের বুদ্ধি কি এ বিষয়ে তাদেরকে আদেশ করে, না তারা সীমালংঘনকারী সম্প্রদায়?",
            "verse 52:33": "না তারা বলেঃ এই কোরআন সে নিজে রচনা করেছে? বরং তারা অবিশ্বাসী।",
            "verse 52:34": "যদি তারা সত্যবাদী হয়ে থাকে, তবেএর অনুরূপ কোন রচনা উপস্থিত করুক।",
            "verse 52:35": "তারা কি আপনা-আপনিই সৃজিত হয়ে গেছে, না তারা নিজেরাই স্রষ্টা?",
            "verse 52:36": "না তারা নভোমন্ডল ও ভূমন্ডল সৃষ্টি করেছে? বরং তারা বিশ্বাস করে না।",
            "verse 52:37": "তাদের কাছে কি আপনার পালনকর্তার ভান্ডার রয়েছে, না তারাই সবকিছুর তত্ত্বাবধায়ক?",
            "verse 52:38": "না তাদের কোন সিঁড়ি আছে, যাতে আরোহণ করে তারা শ্রবণ করে? থাকলে তাদের শ্রোতা সুস্পষ্ট প্রমাণ উপস্থিত করুক।",
            "verse 52:39": "না তার কন্যা-সন্তান আছে আর তোমাদের আছে পুত্রসন্তান?",
            "verse 52:40": "না আপনি তাদের কাছে পারিশ্রমিক চান যে, তাদের উপর জরিমানার বোঝা চেপে বসে?",
            "verse 52:41": "না তাদের কাছে অদৃশ্য বিষয়ের জ্ঞান আছে যে, তারাই তা লিপিবদ্ধ করে?",
            "verse 52:42": "না তারা চক্রান্ত করতে চায়? অতএব যারা কাফের, তারই চক্রান্তের শিকার হবে।",
            "verse 52:43": "না তাদের আল্লাহ তা’আলা ব্যতীত কোন উপাস্য আছে? তারা যাকে শরীক করে, আল্লাহ তা’আলা তা থেকে পবিত্র।",
            "verse 52:44": "তারা যদি আকাশের কোন খন্ডকে পতিত হতে দেখে, তবে বলে এটা তো পুঞ্জীভুত মেঘ।",
            "verse 52:45": "তাদেরকে ছেড়ে দিন সেদিন পর্যন্ত, যেদিন তাদের উপর বজ্রাঘাত পতিত হবে।",
            "verse 52:46": "সেদিন তাদের চক্রান্ত তাদের কোন উপকারে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
            "verse 52:47": "গোনাহগারদের জন্যে এছাড়া আরও শাস্তি রয়েছে, কিন্তু তাদের অধিকাংশই তা জানে না।",
            "verse 52:48": "আপনি আপনার পালনকর্তার নির্দেশের অপেক্ষায় সবর করুন। আপনি আমার দৃষ্টির সামনে আছেন এবং আপনি আপনার পালনকর্তꦣ2494;র সপ্রশংস পবিত্রতা ঘোষণা করুন যখন আপনি গাত্রোত্থান করেন।",
            "verse 52:49": "এবং রাত্রির কিছু অংশে এবং তারকা অস্তমিত হওয়ার সময় তাঁর পবিত্রতা ঘোষণা করুন।"
        },
        "Berber Amazigh": {
            "verse 52:1": "S udrar!",
            "verse 52:2": "S Tezmamt ippujerrden",
            "verse 52:3": "di lka$ev ivelqen!",
            "verse 52:4": "S texxamt iâamôen!",
            "verse 52:5": "S tseddarit aâlayen!",
            "verse 52:6": "S yill icebbwlen!",
            "verse 52:7": "Aâaqeb n Mass ik, s tidep, ad ivôu.",
            "verse 52:8": "Ur isâi ara t sfunngen.",
            "verse 52:9": "Ass ideg ara imbwiwel igenni, d ambwiwel,",
            "verse 52:10": "Ad lêun idurar, d tikli.",
            "verse 52:11": "A ssexv, assen, n wid iskiddiben!",
            "verse 52:12": "Wid inexôen deg uraren.",
            "verse 52:13": "Ass ideg ara pwaveggôen ar tmes n Loahennama, d aveggeô.",
            "verse 52:14": "Apan tmes nni i la tnekôem!",
            "verse 52:15": "D ssêur waya, ne$ d kunwi ur nwala ara?",
            "verse 52:16": "Kecmet ep. Iâuva fellawen, tûebôem, ne$ ur teûbiôem. A ppeppuqeîîim kan $ef wayen txeddmem.",
            "verse 52:17": "Wanag wid ipêezziben, di leonanat, akked zzhu.",
            "verse 52:18": "Feôêen s wayen i sen Ifka Mass nnsen. Isellek iten, Mass nnsen, seg uâaqeb ujajiê.",
            "verse 52:19": "àçet, teswem, di lehna, ilmend n wayen txeddmem!",
            "verse 52:20": "èélen af imîeôêen, d idurra; d tiêuôiyin lâin ukud iten Njewweo.",
            "verse 52:21": "Wid iumnen, u âanden ten, warraw nnsen, ar liman nnsen, a ten Nessemlil akked warraw nnsen. Ur Nessenqas acemma seg igiten nnsen. Yal amdan ad immager ayen ikseb.",
            "verse 52:22": "Ad asen d Nefk izwayen akked uksum seg wayen cedhan.",
            "verse 52:23": "Dinna ad ppemyeppaken lkas, ideg ur illi usîeômel, ne$ ssebba n tuccva.",
            "verse 52:24": "Garasen, ddewiôen ilmeéiyen i nitni, amzun d tiyaqutin mesîuôen.",
            "verse 52:25": "Zzin, kra $er kra, pmesteqsayen.",
            "verse 52:26": "Nnan d: \"ni$ nella, zik, di twacult nne$, nugad.",
            "verse 52:27": "I$at a$ Öebbi, Isellek a$ seg ujajiê n tmes.",
            "verse 52:28": "Ni$ nella, zik, nepnuju $uôeS. Neppa, s tidep, d A$eyyat Ipêunun\".",
            "verse 52:29": "Ihi, ccfu ar keçç, s l$it n Mass ik, ur telliv d agezzan, ne$ d aôehbani.",
            "verse 52:30": "Ne$, ad inin: \"d amedyaz. A naôou asali s akud\".",
            "verse 52:31": "Ini: \"gganit! Nek, yidwen, seg wid ipganin\".",
            "verse 52:32": "Ne$ d tirga nnsen i sen iumôen aya, ne$ nitni d agdud izegren tilas.",
            "verse 52:33": "Ne$ ad inin: \"isnulfa t id\". Xaîi! Ur uminen.",
            "verse 52:34": "Ihi, a d awin ameslay i t icban, ma d tidep ay ssawalen!",
            "verse 52:35": "Ne$ pwaxelqen seg ulac, ne$ d nitni ay d ixellaqen?",
            "verse 52:36": "Ne$ xelqen tamurt akked igenwan? Xaîi, ur pputebbten!",
            "verse 52:37": "Ne$ $uôsen lexzayen n Mass ik, ne$ nitni d imvebbôen?",
            "verse 52:38": "Ne$ sâan sellum ad ssemêessen, segs. Ihi, win islan segsen, a d iawi adabu n ûûeê!",
            "verse 52:39": "Ne$ i Neppa tullas, i kunwi arrac?",
            "verse 52:40": "Ne$ tessutrev asen taqdiât, fellasen d îîlaba ééayen?",
            "verse 52:41": "Ne$ $uôsen tabavnit, d$a la pparun?",
            "verse 52:42": "Ne$ b$an ad andin? D wid ijehlen ara ipwaîîfen.",
            "verse 52:43": "Ne$ sâan ôebbi, ur Nelli d Öebbi? Gedha s Öebbi, seg wayen pcaraken!",
            "verse 52:44": "Lemmer ad walin amur igenni i$li, ad as inin: \"d asigna i izdin\".",
            "verse 52:45": "Ihi, eoo iten, ard mlilen d wass n ssiâqa nnsen,",
            "verse 52:46": "Ass, ideg ur asen d teppawi acemma, tandit nnsen; ur asen illi usettaô.",
            "verse 52:47": "I wid idensen, s tidep, aâaqeb nniven, maca tegwti degsen, ur éôin.",
            "verse 52:48": "Eûbeô i wayen d Iêudd Mass ik, aql ak, s tidep, ger wallen nne£. Sbuccaâ s ccekôan Mass ik, mara d tekkrev.",
            "verse 52:49": "Sbuccaâ iT deg iv, u mara xsin yitran."
        },
        "Bosnian": {
            "verse 52:1": "Tako Mi Gore,",
            "verse 52:2": "i Knjige u retke napisane,",
            "verse 52:3": "na koži razvijenoj,",
            "verse 52:4": "i Hrama poklonika punog,",
            "verse 52:5": "i svoda uzdignutog,",
            "verse 52:6": "i mora napunjenog –",
            "verse 52:7": "kazna Gospodara tvoga sigurno će se dogoditi,",
            "verse 52:8": "niko je neće moći otkloniti",
            "verse 52:9": "na Dan kada se nebo silno uzburka,",
            "verse 52:10": "a planine s mjesta pomaknu!",
            "verse 52:11": "Teško na taj Dan onima koji su poricali,",
            "verse 52:12": "koji su se, ogrezli u laž, zabavljali! –",
            "verse 52:13": "na Dan kada će grubo u vatru džehennemsku biti gurnuti:",
            "verse 52:14": "\"Ovo je vatra koju ste poricali.",
            "verse 52:15": "pa, je li ovo čarolija, ili vi ne vidite?",
            "verse 52:16": "Pržite se u njoj, isto vam je trpjeli ili ne trpjeli – to vam je kazna za ono što ste radili.\"",
            "verse 52:17": "A čestiti će biti u džennetskim baščama i blaženstvu",
            "verse 52:18": "i u onom što im je Gospodar njihov dao će uživati – njih će Gospodar njihov patnje u ognju sačuvati.",
            "verse 52:19": "\"Jedite i pijte i neka vam je prijatno, to je za ono što ste radili!\"",
            "verse 52:20": "Biće naslonjeni na divanima poredanim, a vjenčaćemo ih hurijama džennetskim.",
            "verse 52:21": "Onima koji su vjerovali i za kojima su se djeca njihova u vjerovanju povela priključićemo djecu njihovu, a djela njihova nećemo nimalo umanjiti – svaki čovjek je odgovoran za ono što sâm čini –",
            "verse 52:22": "i još ćemo ih darovati voćem i mesom kakvo budu željeli;",
            "verse 52:23": "jedni drugima će, u njemu, pune čaše dodavati – zbog njih neće biti praznih besjeda i pobuda na grijeh –",
            "verse 52:24": "a služiće ih posluga njihova nalik na biser skriveni,",
            "verse 52:25": "i obraćaće se jedni drugima i jedni druge će pitati:",
            "verse 52:26": "\"Prije smo među svojima strahovali\" – govoriće –",
            "verse 52:27": "\"pa nam je Allah milost darovao i od patnje u ognju nas sačuvao;",
            "verse 52:28": "mi smo Mu se prije klanjali, On je, doista, Dobročinitelj i Milostivi.\"",
            "verse 52:29": "Zato ti opominji, jer ti, milošću Gospodara svoga, nisi ni prorok ni lud.",
            "verse 52:30": "Zar oni da govore: \"On je pjesnik, sačekaćemo da vidimo šta će mu suđeno biti.\"",
            "verse 52:31": "\"Pa čekajte\" – reci ti – \"i ja ću zajedno sa vama čekati!\"",
            "verse 52:32": "Da li im to dolazi od pameti njihove ili su oni inadžije tvrdoglave?",
            "verse 52:33": "Zar oni da govore: \"Izmišlja ga!\" – Ne, nego oni neće da vjeruju;",
            "verse 52:34": "zato neka oni sastave govor sličan Kur'anu, ako istinu govore!",
            "verse 52:35": "Zar su oni bez Stvoritelja stvoreni ili su oni sami sebe stvorili?!",
            "verse 52:36": "Zar su oni nebesa i Zemlju stvorili?! Ne, nego oni neće da vjeruju.",
            "verse 52:37": "Zar je u njih blago Gospodara tvoga, ili, zar oni vladaju?!",
            "verse 52:38": "Zar oni imaju ljestve, pa na njima prisluškuju? Neka onaj među njima koji tvrdi da je nešto čuo donese potvrdu očitu.",
            "verse 52:39": "Zar da su za Njega – kćeri, a za vas da su – sinovi?!",
            "verse 52:40": "Zar ti tražiš od njih nagradu, pa su nametom opterećeni?!",
            "verse 52:41": "Zar je u njih iskonska knjiga, pa oni prepisuju?!",
            "verse 52:42": "Zar oni zamke da postavljaju?! Ta u zamku će se uhvatiti baš oni koji ne vjeruju!",
            "verse 52:43": "Zar oni drugog boga osim Allaha da imaju?! Hvaljen neka je Allah, On je iznad onih koje Mu ravnim smatraju!",
            "verse 52:44": "I kad bi vidjeli da komad neba pada, rekli bi: \"Oblaci nagomilani!\"",
            "verse 52:45": "Zato ih pusti dok se ne suoče sa Danom u kome će pomrijeti,",
            "verse 52:46": "Danom kada im lukavstva njihova nimalo neće koristiti i kada im niko neće pomoći.",
            "verse 52:47": "A za sve nasilnike i druga će kazna prije one biti, ali većina njih ne zna.",
            "verse 52:48": "A ti strpljivo čekaj presudu Gospodara svoga, Mi tebe i vidimo i štitimo; i veličaj i hvali Gospodara svoga kad ustaješ,",
            "verse 52:49": "i noću Ga veličaj i kad se zvijezde gube."
        },
        "Bulgarian": {
            "verse 52:1": "Кълна се в Планината",
            "verse 52:2": "и в Книгата, написана",
            "verse 52:3": "на разгънат свитък,",
            "verse 52:4": "и в посещавания Дом,",
            "verse 52:5": "и във въздигнатия [небесен] свод,",
            "verse 52:6": "и в препълненото море -",
            "verse 52:7": "мъчението на твоя Господ ще настъпи!",
            "verse 52:8": "Никой не ще го отблъсне",
            "verse 52:9": "в Деня, когато небето бурно се завърти",
            "verse 52:10": "и планините силно се разместят.",
            "verse 52:11": "Горко в този Ден за отричащите,",
            "verse 52:12": "които в празнословие се забавляват!",
            "verse 52:13": "В Деня, когато ще бъдат подкарани към огъня на Ада:",
            "verse 52:14": "“Това е Огънят, който взимахте за лъжа.",
            "verse 52:15": "Магия ли е това, или не съзирате?",
            "verse 52:16": "Горете там и да търпите, и да не търпите, все едно е за вас! Ще ви се въздаде само за вашите дела!”",
            "verse 52:17": "Богобоязливите ще са в градини и в блаженство,",
            "verse 52:18": "радостни с онова, което им е дарил техният Господ и ги е предпазил техният Господ от мъчението на Ада.",
            "verse 52:19": "Яжте и пийте със здраве за онова, което сте вършили!",
            "verse 52:20": "Облегнати на подредени престоли... И ще им дадем за съпруги хубавици с големи очи.",
            "verse 52:21": "Към онези, които вярват и тяхното потомство ги последва с вяра - ще присъединим към тях потомството им и не ще отнемем нищо от делата им. Всеки човек ще отговаря за делата си.",
            "verse 52:22": "И ще им дарим в изобилие плодове и месо, каквито пожелаят.",
            "verse 52:23": "Ще си подават там един на друг чаша, от която не ще има нито празнословие, нито подбуда към грях.",
            "verse 52:24": "И ще им прислужват юноши, които сякаш са скрити бисери.",
            "verse 52:25": "И ще се обръщат един към друг, разпитвайки се.",
            "verse 52:26": "Ще рекат: “Бояхме се [от Аллах] и преди, когато бяхме сред своите роднини.",
            "verse 52:27": "Но Аллах ни облагодетелства и ни опази от изгарящото мъчение.",
            "verse 52:28": "Ние Го зовяхме и преди. Той е Владетеля на доброто, Милосърдния.”",
            "verse 52:29": "И поучавай [о, Мухаммад]! Ти не си - по милост от твоя Господ - нито гадател, нито луд.",
            "verse 52:30": "Или казват: “Ти си поет! Изчакваме превратностите на съдбата.”",
            "verse 52:31": "Кажи: “Чакайте! И аз чакам с вас.”",
            "verse 52:32": "Нима умовете им повеляват това, или са престъпващи хора?",
            "verse 52:33": "Или искат да кажат: “Сам си го е съчинил!” Не, те не вярват.",
            "verse 52:34": "Нека донесат слово, подобно на него, ако казват истината!",
            "verse 52:35": "Нима бяха сътворени от нищо, или те са творците?",
            "verse 52:36": "Или те сътвориха небесата и земята? Не, ала не се убеждават.",
            "verse 52:37": "Или при тях са съкровищниците на твоя Господ, или те са властващите?",
            "verse 52:38": "Или имат стълба, от която подслушват? Тогава нека този от тях, който е чул нещо, да донесе явен довод!",
            "verse 52:39": "Или за Него са дъщерите, а за вас - синовете?",
            "verse 52:40": "Или искаш отплата от тях [о, Мухаммад], та са обременени от дълг?",
            "verse 52:41": "Или при тях е неведомото и те записват?",
            "verse 52:42": "Или кроят хитрина? Ала онези, които не вярват, те ще са надхитрените.",
            "verse 52:43": "Или имат друг бог освен Аллах? Пречист е Аллах от онова, с което Го съдружават!",
            "verse 52:44": "И дори да видят отломък, падащ от небето, казват: “Скупчени облаци.”",
            "verse 52:45": "Остави ги, докато срещнат своя Ден, когато ще бъдат поразени от мълнията!",
            "verse 52:46": "Деня, когато нито хитрината им ще ги избави, нито ще им се помогне.",
            "verse 52:47": "А за угнетителите има и друго мъчение освен това, ала повечето от тях не знаят.",
            "verse 52:48": "И бъди търпелив пред повелята на своя Господ! Ти наистина си пред Очите Ни. И прославяй своя Господ с възхвала, когато ставаш!",
            "verse 52:49": "И нощем Го прославяй, и при скриването на звездите!"
        },
        "Chinese": {
            "verse 52:1": "以山岳盟誓，",
            "verse 52:2": "以天经之书",
            "verse 52:3": "写于展开的皮纸者盟誓，",
            "verse 52:4": "以众人朝觐的天房盟誓，",
            "verse 52:5": "以被升起的苍穹盟誓，",
            "verse 52:6": "以汪洋的大海盟誓，",
            "verse 52:7": "你的主的刑罚，确是要实现的，",
            "verse 52:8": "是任何人不能抵抗的。",
            "verse 52:9": "在天体震动，",
            "verse 52:10": "山岳逝去之日，",
            "verse 52:11": "在那日，伤哉否认真理的人们，",
            "verse 52:12": "即以妄言消遣的人们！",
            "verse 52:13": "他们将被投入火狱。",
            "verse 52:14": "这就是你们生前所否认的火刑。",
            "verse 52:15": "这是魔术呢？还是你们看不见呢？",
            "verse 52:16": "你们进火狱去吧！你们忍受其中的刑罚与否，随你们的方便，那对于你们是一样的。你们只受自己行为的报酬。",
            "verse 52:17": "敬畏的人们，必定在乐园和恩泽中，",
            "verse 52:18": "他们因主的赏赐而快乐，他们的主使他们得免于烈火的刑罚。",
            "verse 52:19": "你们因自己的行为而愉快地吃喝吧！",
            "verse 52:20": "他们靠在分列成行的床上，我将以白皙的、美目的女子做他们的伴侣。",
            "verse 52:21": "自己信道，子孙也跟著信道者，我将使他们的子孙与他们同级，我不减少他们的善功一丝毫。每人应对自己的行为负责。",
            "verse 52:22": "我将以他们所嗜好的水果和肉食供给他们，",
            "verse 52:23": "他们在乐园中互递（酒）杯，他们不因而出恶言，也不因而犯罪恶。",
            "verse 52:24": "他们的僮仆轮流著服侍他们，那些僮仆，好象藏在蚌壳里的珍珠一样。",
            "verse 52:25": "于是他们大家走向前来互相谈论。",
            "verse 52:26": "他们将说：以前我们为自己的家属确是战战兢兢的，",
            "verse 52:27": "但真主已施恩于我们，并使我们得免于毒风的刑罚。",
            "verse 52:28": "以前我们的确常常祈祷他，他确是仁爱的，确是至慈的。",
            "verse 52:29": "你应当教诲众人，因为借你的主的恩典，你不是一个占卜者，也不是一个疯人。",
            "verse 52:30": "不然，他们说：他是一个诗人，我们等待他遭逢厄运。",
            "verse 52:31": "你说：你们等待吧！我确是与你们一同等待的。",
            "verse 52:32": "难道他们的理智命令他们说这句话吗？不然，他们是放荡的民众。",
            "verse 52:33": "难道他们说他曾捏造他吗？不然，其实是他们不归信。",
            "verse 52:34": "叫他们作出象这样的文辞来，如果他们是说实话的！",
            "verse 52:35": "是他们从无到有被创造出来呢？还是他们自己就是创造者呢？",
            "verse 52:36": "难道他们曾创造天地吗？不然，是他们不确信真主。",
            "verse 52:37": "是你的主的库藏归他们掌管呢？还是他们是那些库藏的监督呢？",
            "verse 52:38": "难道他们有一架天梯，可以登上去倾听吗？叫他们中的倾听者拿一个明证来吧！",
            "verse 52:39": "难道真主有女儿，你们有儿子吗？",
            "verse 52:40": "难道你向他们索取报酬，故他们为纳税而担负太重？",
            "verse 52:41": "难道他们能知幽玄，故能将它记录下来？",
            "verse 52:42": "难道他们欲用计谋吗？不信道者，将自中其计。",
            "verse 52:43": "难道除真主外，他们还有别的神灵吗？真主是超乎他们所用以配他的。",
            "verse 52:44": "如果他们看见天掉下来一块，他们将说：这是成堆的云彩。",
            "verse 52:45": "你任随他们吧！直到他们遭遇自己被震死的日子。",
            "verse 52:46": "在那日，他们的计谋，对于他们毫无裨益，他们也不受援助。",
            "verse 52:47": "不义的人们，在那日之前，必定要受一种刑罚，但他们大半不知道。",
            "verse 52:48": "你应当忍受你的主的判决，因为你确是在我的眷顾之下的。你起来的时候，应当赞颂你的主；",
            "verse 52:49": "在夜间和在星宿没落之么，你应当赞颂他。"
        },
        "Danish": {
            "verse 52:1": "Bij de Berg",
            "verse 52:2": "En bij het geschreven Boek",
            "verse 52:3": "Op uitgebreide perkament",
            "verse 52:4": "En bij het veelbezochte huis",
            "verse 52:5": "En bij het hoogverheven dak",
            "verse 52:6": "En bij de boordevolle oceaan",
            "verse 52:7": "Voorzeker, de straf van uw Heer zal worden voltrokken",
            "verse 52:8": "Er is niemand die haar kan afwenden",
            "verse 52:9": "De Dag waarop de hemel in beweging zal komen",
            "verse 52:10": "En de bergen zullen vergaan",
            "verse 52:11": "Dan wee op die Dag de loochenaars",
            "verse 52:12": "Die zich in ijdel gesprek vermaken",
            "verse 52:13": "De Dag waarop zij in het Vuur der hel zullen worden geslingerd",
            "verse 52:14": "(Men zal zeggen:) Dit is het Vuur dat gij placht te loochenen",
            "verse 52:15": "Is dit dan toverkunst of ziet gij niet",
            "verse 52:16": "Brandt daarin; en het zal voor u hetzelfde zijn, of gij geduld of ongeduld toont. U is slechts vergolden voor hetgeen gij placht te doen",
            "verse 52:17": "Voorwaar, de godvruchtigen zullen in tuinen en gelukzaligheid zijn",
            "verse 52:18": "Genietende van de gaven, die hun Heer hun heeft geschonken en hun Heer heeft hen voor de marteling van het Vuur behoed",
            "verse 52:19": "Eet en drinkt met genoegen wegens hetgeen gij placht te doen",
            "verse 52:20": "op tronen nedervlijend die in rijen zijn gerangschikt. En Wij zullen hen met schone meisjes verenigen die grote, mooie ogen hebben",
            "verse 52:21": "En met de gelovigen zullen Wij hun nageslacht, dat hun in het geloof volgt, verenigen. En Wij zullen zeker niets aan hun werken afdoen. Elk mens is onderpand voor zijn daden",
            "verse 52:22": "En Wij zullen hun een overvloed van fruit en vlees schenken, volgens hun wensen",
            "verse 52:23": "Daar zullen zij elkander een beker van hand tot hand reiken waarin ijdelheid noch zonde zal zijn",
            "verse 52:24": "En er zullen knapen rondgaan alsof zij welbewaakte paarlen zijn",
            "verse 52:25": "En zij zullen zich vragend tot elkander wenden",
            "verse 52:26": "Zij zullen zeggen: Voorheen vreesden wij ter wille van onze families",
            "verse 52:27": "Maar Allah is ons genadig geweest en heeft ons voor de marteling van de brandende wind behoed",
            "verse 52:28": "Wij plachten voorheen Hem te aanbidden. Voorzeker, Hij is de Goede, de Genadevolle",
            "verse 52:29": "Waarschuw daarom (o, profeet). Bij de gratie van uw Heer zijt gij noch een waarzegger noch een bezetene",
            "verse 52:30": "Zeggen zij: Hij is een dichter en wij wachten of te zijner tijd een ramp over hem komt",
            "verse 52:31": "Zeg: Wacht! Ik wacht ook met u",
            "verse 52:32": "Is het hun verstand, dat hun dit oplegt of zijn zij een opstandig volk",
            "verse 52:33": "Of zeggen zij: Hij heeft het verzonnen? - Neen, zij willen niet geloven",
            "verse 52:34": "Laat hen dan een woord hieraan gelijk naar voren brengen, als zij waarachtig zijn",
            "verse 52:35": "Zijn zij door niets geschapen of zijn zij (hun eigen) schepper",
            "verse 52:36": "Schiepen zij de hemelen en de aarde? Neen, zij willen geen zekerheid hebben",
            "verse 52:37": "Bezitten zij de schatten van uw Heer of zijn zij de bewaarders hiervan",
            "verse 52:38": "Hebben zij een ladder naar de hemel waardoor zij kunnen luisteren? Laat hun luisteraar dan openlijk gezag tonen",
            "verse 52:39": "Heeft Hij (Allah) dochters terwijl gij zonen hebt",
            "verse 52:40": "Vraagt gij loon van hen, zodat zij onder schulden gebukt gaan",
            "verse 52:41": "Bezitten zij het onzichtbare, zodat zij het kunnen neerschrijven",
            "verse 52:42": "Willen zij een plan smeden (tegen u)? Maar de ongelovigen zullen door hun eigen plan worden gevangen",
            "verse 52:43": "Hebben zij een andere God buiten Allah? Allah is verheven boven hetgeen zij met Hem vereenzelvigen",
            "verse 52:44": "En indien zij een stuk van de hemel zien vallen, zullen zij zeggen Opgehoopte wolken",
            "verse 52:45": "Laat hen daarom, totdat zij hun Dag ontmoeten waarop zij in onmacht zullen neervallen",
            "verse 52:46": "De Dag, waarop hun samenzwering hen niets zal baten noch zullen zij worden geholpen",
            "verse 52:47": "En voorwaar, voor de onrechtvaardigen is hiervoor een straf. Maar de meesten hunner beseffen het niet",
            "verse 52:48": "Wacht daarom geduldig op het oordeel van uw Heer. want gij zijt onder Onze ogen en verheerlijk uw Heer wanneer gij opstaat met de lof die Hem toekomt",
            "verse 52:49": "En verheerlijk Hem `s nachts en na het verbleken der sterren"
        },
        "Dutch": {
            "verse 52:1": "Bij de berg (Sinaï).",
            "verse 52:2": "Bij een geschreven Boek.",
            "verse 52:3": "In een opengerold perkament.",
            "verse 52:4": "Bij het veel bezochte Huis (de Ka'bah).",
            "verse 52:5": "En het opgeheven gewelf (de hemel).",
            "verse 52:6": "En de kolkende zee.",
            "verse 52:7": "Voorwaar, de bestraffing van jouw Heer zal zeker plaatsvinden.",
            "verse 52:8": "Niemand kan hem tegenhouden.",
            "verse 52:9": "Op de Dag waarop de hemel heftig beeft.",
            "verse 52:10": "En de bergen zich verplaatsen.",
            "verse 52:11": "Wee op die Dag de loochenaars.",
            "verse 52:12": "Degenen die zich vermaken met ijdelheden.",
            "verse 52:13": "Op die Dag zullen zij met geweld naar de Hel worden geduwd.",
            "verse 52:14": "(En er zal gezegd worden:) \"Dit is de Hel die jullie plachten te loochenen.",
            "verse 52:15": "Is dit dan toverij? Of kunnen jullie niet zien?",
            "verse 52:16": "Gaat haar binnen en weest geduldig of weest ongeduldig; het zal voor jullie niets uitmaken. Voorwaar, jullie worden slechts vergolden naar wat jullie plachten te verrichtten.\"",
            "verse 52:17": "Voorwaar, de Moettaqôen bevinden zich in Tuinen (het Paradijs) en in genietingen.",
            "verse 52:18": "Zich verheugend over wat hun Heer hun heeft gegeven. En hun Heer heeft hen behoed voor de straf van de Hel.",
            "verse 52:19": "(Er wordt gezegd:) \"Eet en drinkt smakelijk wegens wat jullie plachten te verrichten.\"",
            "verse 52:20": "Leunend op rustbanken, tegenover elkaar. En Wij zullen hen huwen met schone maagden.",
            "verse 52:21": "En degenen die geloven en die in het geloof gevolgd worden door hun nakomelingen: Wij voegen hun nakomelingen bij hen en Wij verminderen (de beloning voor) hun daden niet. Ieder mens staat borg voor wat hij verrichtte.",
            "verse 52:22": "En Wij geven hun vruchten en vlees, van welke soort zij wensen.",
            "verse 52:23": "Zij reiken daar elkaar een beker aan waarbij geen onzin en geen zondigheid is.",
            "verse 52:24": "En onder hen gaan jongelingen rond die lijken op welbewaarde parels.",
            "verse 52:25": "Zij zullen zich tot elkaar wenden en elkaar vragen stellen.",
            "verse 52:26": "Zij zeggen: \"Voorwaar, wij waren vroeger temidden van onze verwanten bevreesd (voor Allah).",
            "verse 52:27": "Allah begenadigde ons toen en Hij behoedde ons voor de bestraffing van de verschroeiende wind.",
            "verse 52:28": "Voorwaar, Wij plachten Hem vroeger aan te roepen: voorwaar, Hij is de Weldoener, de Meest Barmhartige.\"",
            "verse 52:29": "Vermaan daarom, jij bent door de Genade van jouw Heer geen waarzegger en geen bezetene.",
            "verse 52:30": "Of zeggen zij: \"Een dichter, wij wachten af of het noodlot hem met ongeluk zal treffen.\"",
            "verse 52:31": "Zeg (O Moehammad): \"Wacht maar af: voorwaar, Ik behoor met jullie tot de afwachtenden.\"",
            "verse 52:32": "Of beveelt hun verstand hun dit, of zijn zij een overtredend volk?",
            "verse 52:33": "Of zeggen zij: \"Hij heeft hem (de Koran) verzonnen\"? Nee, zij geloven niet.",
            "verse 52:34": "Laten zij dan een bericht brengen dat daaraan gelijk is, als zij waarachtigen zijn.",
            "verse 52:35": "Of zijn zij uit niets geschapen, of zijn zij (zelf) de scheppers?",
            "verse 52:36": "Of hebben zij de hemelen en de aarde geschapen? Zelfs zij zijn er niet van overtuigd.",
            "verse 52:37": "Of bevinden zich bij hen de schaften van jouw Heer, of hebben zij de heerschappij?",
            "verse 52:38": "Of beschikken zij over een ladder (die tot in de hemel reikt) waarop zij kunnen afluisteren? Laat dan de afluisteraar onder hen met een duidelijk bewijs komen.",
            "verse 52:39": "Of zijn voor Hem de dochters en voor jullie de zonen?",
            "verse 52:40": "Of vraag jij van hen een beloning, zodat zij belast zijn met een schuld?",
            "verse 52:41": "Of is bij hen het onwaarneembare, zodat zij het kunnen opschrijven?",
            "verse 52:42": "Of willen zij een list beramen? Degenen die niet geloven zijn degenen die in een list versrikt raken.",
            "verse 52:43": "Of hebben zij een andere god dan Allah? Heilig is Allah, boven de deelgenoten die zij (Hem) toekennen.",
            "verse 52:44": "En als zij een stuk uit de hemel (zouden) zien neerstorten, dan zeggen zij: \"Stapelwolken.\"",
            "verse 52:45": "Laat hen maar, totdat zij hun Dag ontmoeten waarop zij door de bliksemslag getroffen zullen worden.",
            "verse 52:46": "Op die Dag zal hun list niets baten, en zij zullen niet worden geholpen.",
            "verse 52:47": "En voorwaar, voor degenen die onrecht pleegden is er daarnaast nog een bestraffing, maar de meesten van hen weten het niet.",
            "verse 52:48": "Wees geduldig met de beschikking van jouw Heer. Voorwaar, jij bent in Onze Ogen. En prijs de Glorie van jouw Heer wanneer jij staat.",
            "verse 52:49": "En in de nacht, prijst Zijn Glorie, en (ook) bij het vervagen van de sterren (in de vroege ochtend)."
        },
        "English": {
            "verse 52:1": "By the mount",
            "verse 52:2": "And [by] a Book inscribed",
            "verse 52:3": "In parchment spread open",
            "verse 52:4": "And [by] the frequented House",
            "verse 52:5": "And [by] the heaven raised high",
            "verse 52:6": "And [by] the sea filled [with fire],",
            "verse 52:7": "Indeed, the punishment of your Lord will occur.",
            "verse 52:8": "Of it there is no preventer.",
            "verse 52:9": "On the Day the heaven will sway with circular motion",
            "verse 52:10": "And the mountains will pass on, departing -",
            "verse 52:11": "Then woe, that Day, to the deniers,",
            "verse 52:12": "Who are in [empty] discourse amusing themselves.",
            "verse 52:13": "The Day they are thrust toward the fire of Hell with a [violent] thrust, [its angels will say],",
            "verse 52:14": "\"This is the Fire which you used to deny.",
            "verse 52:15": "Then is this magic, or do you not see?",
            "verse 52:16": "[Enter to] burn therein; then be patient or impatient - it is all the same for you. You are only being recompensed [for] what you used to do.\"",
            "verse 52:17": "Indeed, the righteous will be in gardens and pleasure,",
            "verse 52:18": "Enjoying what their Lord has given them, and their Lord protected them from the punishment of Hellfire.",
            "verse 52:19": "[They will be told], \"Eat and drink in satisfaction for what you used to do.\"",
            "verse 52:20": "They will be reclining on thrones lined up, and We will marry them to fair women with large, [beautiful] eyes.",
            "verse 52:21": "And those who believed and whose descendants followed them in faith - We will join with them their descendants, and We will not deprive them of anything of their deeds. Every person, for what he earned, is retained.",
            "verse 52:22": "And We will provide them with fruit and meat from whatever they desire.",
            "verse 52:23": "They will exchange with one another a cup [of wine] wherein [results] no ill speech or commission of sin.",
            "verse 52:24": "There will circulate among them [servant] boys [especially] for them, as if they were pearls well-protected.",
            "verse 52:25": "And they will approach one another, inquiring of each other.",
            "verse 52:26": "They will say, \"Indeed, we were previously among our people fearful [of displeasing Allah].",
            "verse 52:27": "So Allah conferred favor upon us and protected us from the punishment of the Scorching Fire.",
            "verse 52:28": "Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful.\"",
            "verse 52:29": "So remind [O Muhammad], for you are not, by the favor of your Lord, a soothsayer or a madman.",
            "verse 52:30": "Or do they say [of you], \"A poet for whom we await a misfortune of time?\"",
            "verse 52:31": "Say, \"Wait, for indeed I am, with you, among the waiters.\"",
            "verse 52:32": "Or do their minds command them to [say] this, or are they a transgressing people?",
            "verse 52:33": "Or do they say, \"He has made it up\"? Rather, they do not believe.",
            "verse 52:34": "Then let them produce a statement like it, if they should be truthful.",
            "verse 52:35": "Or were they created by nothing, or were they the creators [of themselves]?",
            "verse 52:36": "Or did they create the heavens and the earth? Rather, they are not certain.",
            "verse 52:37": "Or have they the depositories [containing the provision] of your Lord? Or are they the controllers [of them]?",
            "verse 52:38": "Or have they a stairway [into the heaven] upon which they listen? Then let their listener produce a clear authority.",
            "verse 52:39": "Or has He daughters while you have sons?",
            "verse 52:40": "Or do you, [O Muhammad], ask of them a payment, so they are by debt burdened down?",
            "verse 52:41": "Or have they [knowledge of] the unseen, so they write [it] down?",
            "verse 52:42": "Or do they intend a plan? But those who disbelieve - they are the object of a plan.",
            "verse 52:43": "Or have they a deity other than Allah? Exalted is Allah above whatever they associate with Him.",
            "verse 52:44": "And if they were to see a fragment from the sky falling, they would say, \"[It is merely] clouds heaped up.\"",
            "verse 52:45": "So leave them until they meet their Day in which they will be struck insensible -",
            "verse 52:46": "The Day their plan will not avail them at all, nor will they be helped.",
            "verse 52:47": "And indeed, for those who have wronged is a punishment before that, but most of them do not know.",
            "verse 52:48": "And be patient, [O Muhammad], for the decision of your Lord, for indeed, you are in Our eyes. And exalt [Allah] with praise of your Lord when you arise.",
            "verse 52:49": "And in a part of the night exalt Him and after [the setting of] the stars."
        },
        "Filipino": {
            "verse 52:1": "Sa pamamagitan ng Bundok (ng kapahayagan)",
            "verse 52:2": "At sa pamamagitan ng isang Aklat na nakatitik",
            "verse 52:3": "Sa kalatas (dahon) nanakalantad",
            "verse 52:4": "Sapamamagitanng Bait-ul-Mamur (angTahanan saibabawngkalangitannalagingdinadalawng mga anghel)",
            "verse 52:5": "At sa pamamagitan ng Kulandong na itinayo ng mataas (alalaong baga ang langit)",
            "verse 52:6": "At sa pamamagitan ng karagatan na umaapaw (o ito ay magiging apoy na sisindihan sa Araw ng Muling Pagkabuhay)",
            "verse 52:7": "Katotohanan, ang kaparusahan ng inyong Panginoon ay walang pagsalang daratal",
            "verse 52:8": "walang sinuman ang makakahadlang dito",
            "verse 52:9": "Sa Araw na ang suson-susong kalangitan ay makakalog sa matinding pagkauga",
            "verse 52:10": "At ang kabundukan ay matitinag sa isang (kagimbal-gimbal) na pagkilos",
            "verse 52:11": "Kaya’t kasawian sa Araw na yaon sa mga nagpapabulaan (sa katotohanan)",
            "verse 52:12": "Na naglalaro ng kasinungalingan (ganap na abala sa kawalan ng pananalig at paggawa ng kasamaan sa mundong ito na siyang mga pagsubok sa sangkatauhan at nagwawalang bahala sa walang hanggang kasasapitan [alalaong baga, kaparusahan sa Apoy ng Impiyerno)",
            "verse 52:13": "Sa Araw na sila ay ihahagis sa kailaliman ng Apoy na hindi masasawata",
            "verse 52:14": "(At sa kanila ay ipagbabadya): “ Ito ang Apoy na inyong itinatwa!”",
            "verse 52:15": "“Ito baga ay isang salamangka, o kayo ay hindi nakakakita? “",
            "verse 52:16": "“Inyong lasapin dito ang init, at kahit na kayo ay matiisin sa ganito o hindi matiisin sa ganito, itong lahat ay magkakatulad. Kayo ay tumanggap lamang ng kabayaran sa inyong mga gawa.”",
            "verse 52:17": "Katotohanan, ang Muttaqun (mga matutuwid at matimtimang tao na lubhang nangangamba kay Allah at umiiwas sa lahat ng kasalanan, at lubhang nagmamahal kay Allah at nagsasagawa ng lahat ng kabutihan at gumaganap sa mga ipinag-uutos ni Allah), ay mapapasa-Halamanan (ng Paraiso) at Sukdol na Kaligayahan",
            "verse 52:18": "Na nagtatamasa ng kasiyahan na ipinagkaloob sa kanila ng kanilang Panginoon; at (sa katunayan) na ang kanilang Panginoon ang nagligtas sa kanila sa kaparusahan ng Naglalagablab na Apoy",
            "verse 52:19": "(At sa kanila ay ipagtuturing): “Kumain kayo at uminom ng may kasiyahan dahilan sa inyong mabubuting gawa.”",
            "verse 52:20": "Sila ay magsisihilig (ng may kaginhawahan) sa mga diban na inayos sa maraming bilang; at Aming ikakasal sila sa mga Houris (magagandang dalaga), na nag-aangkin ng magaganda, mabibilog at maningning na mga mata",
            "verse 52:21": "At sila na sumasampalataya na ang kanilang anak (pamilya) ay sumunod sa kanilang Pananalig, sa kanila ay Aming ipipisan ang kanilang anak (pamilya), at hindi Namin ipagkakait sa kanila (ang bunga) ng kanilang mga gawa. Ang bawat tao (kaluluwa) ay sanla sa bagay na kanyang kinita",
            "verse 52:22": "At ipagkakaloob Namin sa kanila ang bungangkahoy at karne, sa anumang kanilang maibigan",
            "verse 52:23": "dito sila ay magpapalitan sa bawat isa ng kopita (ng alak) na walang bahid ng kahangalan at malinis sa kasalanan (sapagkat pinahihintulutan na rito ang pag-inom [ng alak)",
            "verse 52:24": "At sa paligid nila ay nagsisilbi ang mga matimtimang lalaki (na may angking kabataan at kakisigan), na tila ba mga perlas na napapangalagaan",
            "verse 52:25": "At ang ilan sa kanila ay lalapit sa iba na nagtatanong",
            "verse 52:26": "At nagsasabi: “Noong panahong yaon, kami ay nangangamba sa kapakanan ng aming mga kaanak at kaibigan (sa kaparusahan ni Allah)",
            "verse 52:27": "Datapuwa’t si Allah ay naging mapagbigay sa atin, at Kanyang iniligtas tayo sa kaparusahan ng Naglalagablab na Apoy",
            "verse 52:28": "Katotohanang kami ay nagsisitawag (lamang) sa Kanya (at wala ng iba) noon pa mang una. Katotohanang Siya ang Al-Barr (ang Pinakamabanayad, ang Pinakamabait, ang Pinakamapitagan, ang Pinakamapagbigay), ang Pinakamaawain",
            "verse 52:29": "Kaya’tpagtagubilinanatpangaralanmo(OMuhammad ang sangkatauhan tungkol sa Islam at Kaisahan ni Allah). Sa pamamagitan ng Biyaya ni Allah, ikaw ay hindi isang manghuhula, o isang inaalihan (ng demonyo)",
            "verse 52:30": "o sila baga ay nagsasabi : “(Si Muhammad) ay isang makata! Kami ay naghihintay para sa kaniya ng mga kapinsalaan (sa tangkay) ng panahon!”",
            "verse 52:31": "Ipagbadya mo (o Muhammad) sa kanila: “Magsipaghintay kayo! Ako rin ay naghihintay na kasabay ninyo!”",
            "verse 52:32": "Ang kanila bagang isipan ay nag-uutos ng ganito (alalaong baga, na sila ay magsabi ng kasinungalingan laban sa iyo [O Muhammad]), o sila baga ay mga tao na lumagpas sa lahat ng hangganan (alalaong baga, mula sa pananalig kay Allah tungo sa kawalan ng pananalig)",
            "verse 52:33": "o sila baga ay nagsasabi: “Siya (Muhammad) ay nanghuwad nito (ang Qur’an).” Hindi! Sila ay hindi nananalig",
            "verse 52:34": "Hayaan sila na gumawa ng pagdalit (pagbigkas) na katulad nito (Al Qur’an), kung sila ay nagsasabi ng katotohanan",
            "verse 52:35": "Sila baga’y nilikha mula sa wala? O sila baga sa kanilang sarili ang manlilikha",
            "verse 52:36": "o sila baga ang lumikha ng kalangitan at kalupaan? Hindi, sila ay walang matatag na pananalig",
            "verse 52:37": "O nasa kanila ba ang mga Kayamanan ng iyong Panginoon? o sila ba ang mga pinunong mapaniil na may kapamahalaan na gawin ang kanilang naisin",
            "verse 52:38": "o mayroon ba silang hagdanan na sa pamamagitan nito (ay makakapanhik sila sa kalangitan) upang mapakinggan (ang pag-uusap ng mga anghel)? Kung gayon, hayaaan ang kanilang tagapakinig ay magpakita ng lantad na katibayan",
            "verse 52:39": "o Siya (Allah) ba ay mayroon lamang mga anak (na babae), at kayo ay mayroon mga anak (na lalaki)",
            "verse 52:40": "o ikaw ba (o Muhammad) ay nanghihingi ng gantimpala mula sa kanila (sa pangangaral ng Kaisahan ni Allah at Islam), upang sila ay mabigatan sa pasanin ng pagkakautang",
            "verse 52:41": "o ang kapamahalaan ba ng Al Ghaib (mga nalilingid) ay nasa kanilang kamay at isinusulat nila ito",
            "verse 52:42": "o sila ba ay nagbabalak ng pakana (laban sa iyo, o Muhammad)? Subalit sila na hindi sumasampalataya (sa Kaisahan ni Allah at sa Islam), sila sa kanilang sarili ang makukupot sa ganitong pakana",
            "verse 52:43": "o sila ba ay may iba pang diyos bukod pa kay Allah? Higit na Maluwalhati si Allah sa lahat ng mga bagay na iniaakibat nila bilang katambal (sa Kanya)",
            "verse 52:44": "At kung sila ay makakita ng piraso ng kalangitan na nahuhulog, sila ay magsasabi: “Mga bunton lamang ng ulap na natipon!”",
            "verse 52:45": "Kaya’t hayaan silang mag-isa hanggang sa kanilang makaharap ang Araw na sila ay manggigipuspos (na may pagkalagim)",
            "verse 52:46": "Sa Araw na ang kanilang pakana ay walang buti na maidudulot sa kanila kahit na anuman, gayundinsilaayhindimatutulungan(alalaongbaga, kanilang tatanggapin ang kanilang kaparusahan sa Impiyerno)",
            "verse 52:47": "At katotohanang sa mga gumagawa ng kamalian ay mayroon pang ibang kaparusahan (alalaong baga, ang kaparusahan sa mundong ito at sa kanilang libingan), bago pa rito, datapuwa’t ang karamihan sa kanila ay walang kaalaman",
            "verse 52:48": "Kaya’t ikaw (O Muhammad) ay maghintay ng may pagtitiyaga sa Pasya ng iyong Panginoon sapagkat katotohanang ikaw ay nasa pangangalaga ng Aming mga Mata, at ipagbunyi mo ang mga papuri ng iyong Panginoon kung ikaw ay magbangon mula sa pagkakatulog",
            "verse 52:49": "At sa bahagi ng gabi ay ipagbunyi mo ang mga papuri sa Kanya at sa (oras) nang paglubog ng mga bituin"
        },
        "French": {
            "verse 52:1": "Par At-Tûr!",
            "verse 52:2": "Et par un Livre écrit",
            "verse 52:3": "sur un parchemin déployé!",
            "verse 52:4": "Et par la Maison peuplée!",
            "verse 52:5": "Et par la Voûte élevée!",
            "verse 52:6": "Et par la Mer portée à ébullition! (au Jour dernier)",
            "verse 52:7": "Le châtiment de ton Seigneur aura lieu inévitablement.",
            "verse 52:8": "Nul ne pourra le repousser.",
            "verse 52:9": "Le jour où le ciel sera agité d'un tourbillonnement,",
            "verse 52:10": "et les montagnes se mettront en marche.",
            "verse 52:11": "Ce jour-là, malheur à ceux qui traitent (les signes d'Allah) de mensonges,",
            "verse 52:12": "ceux qui s'ébattent dans des discours frivoles",
            "verse 52:13": "le jour où ils seront brutalement poussés au feu de l'Enfer:",
            "verse 52:14": "Voilà le feu que vous traitiez de mensonge.",
            "verse 52:15": "Est-ce que cela est de la magie? Ou bien ne voyez-vous pas clair?",
            "verse 52:16": "Brûlez dedans! Supportez ou ne supportez pas, ce sera égal pour vous: vous n'êtes rétribués que selon ce que vous faisiez.",
            "verse 52:17": "Les pieux seront dans des Jardins et dans des délices,",
            "verse 52:18": "se réjouissant de ce que leur Seigneur leur aura donné, et leur Seigneur les aura protégés du châtiment de la Fournaise.",
            "verse 52:19": "«En récompense de ce que vous faisiez, mangez et buvez en toute sérénité,",
            "verse 52:20": "accoudés sur des lits bien rangés», et Nous leur ferons épouser des houris aux grands yeux noirs,",
            "verse 52:21": "Ceux qui auront cru et que leurs descendants auront suivis dans la foi, Nous ferons que leurs descendants les rejoignent. Et Nous ne diminuerons en rien le mérite de leurs œuvres, chacun étant tenu responsable de ce qu'il aura acquis.",
            "verse 52:22": "Nous les pourvoirons abondamment des fruits et des viandes qu'ils désireront.",
            "verse 52:23": "Là, ils se passeront les uns les autres une coupe qui ne provoquera ni vanité ni incrimination.",
            "verse 52:24": "Et parmi eux circuleront des garçons à leur service, pareils à des perles bien conservées.",
            "verse 52:25": "Et ils se tourneront les uns vers les autres s'interrogeant;",
            "verse 52:26": "Ils diront: «Nous vivions au milieu des nôtres dans la crainte [d'Allah];",
            "verse 52:27": "Puis Allah nous a favorisés et protégés du châtiment du Samûm.",
            "verse 52:28": "Antérieurement, nous L'invoquions. C'est Lui certes, le Charitable, le Très Miséricordieux».",
            "verse 52:29": "Rappelle donc et par la grâce de ton Seigneur tu n'es ni un devin ni un possédé.",
            "verse 52:30": "Ou bien ils disent: «C'est un poète! Attendons pour lui le coup de la mort».",
            "verse 52:31": "Dis: «Attendez! Je suis avec vous parmi ceux qui attendent».",
            "verse 52:32": "Est-ce leur raison qui leur commande cela? Ou sont-ils des gens outranciers?",
            "verse 52:33": "Ou bien ils disent: «Il l'a inventé lui-même?» Non... mais ils ne croient pas.",
            "verse 52:34": "Eh bien, qu'ils produisent un récit pareil à lui (le Coran), s'ils sont véridiques.",
            "verse 52:35": "Ont-ils été créé à partir de rien ou sont-ils eux les créateurs?",
            "verse 52:36": "Ou ont-ils créé les cieux et la terre? Mais ils n'ont plutôt aucune conviction.",
            "verse 52:37": "Possèdent-ils les trésors de ton Seigneur? Ou sont-ils eux les maîtres souverains?",
            "verse 52:38": "Ont-ils une échelle d'où ils écoutent? Que celui des leurs qui reste à l'écoute apporte une preuve évidente!",
            "verse 52:39": "[Allah] aurait-Il les filles, tandis que vous, les fils?",
            "verse 52:40": "Ou leur demandes-tu un salaire, de sorte qu'ils soient grevés d'une lourde dette?",
            "verse 52:41": "Ou bien détiennent-ils l'Inconnaissable pour le mentionner par écrit?",
            "verse 52:42": "Ou cherchent-ils un stratagème? Mais ce sont ceux qui ont mécru qui sont victimes de leur propre stratagème.",
            "verse 52:43": "Ou ont-ils une autre divinité à part Allah? Qu'Allah soit glorifié et purifié de tout ce qu'ils associent!",
            "verse 52:44": "Et s'ils voient tomber des fragments du ciel, ils disent: «Ce sont des nuages superposés».",
            "verse 52:45": "Laisse-les donc, jusqu'à ce qu'ils rencontrent leur jour où ils seront foudroyés,",
            "verse 52:46": "le jour où leur ruse ne leur servira à rien, où ils ne seront pas secourus.",
            "verse 52:47": "Les injustes auront un châtiment préalable. Mais la plupart d'entre eux ne savent pas.",
            "verse 52:48": "Et supporte patiemment la décision de ton Seigneur. Car en vérité, tu es sous Nos yeux. Et célèbre la gloire de ton Seigneur quand tu te lèves;",
            "verse 52:49": "Glorifie-Le une partie de la nuit et au déclin des étoiles."
        },
        "Fulah": {
            "verse 52:1": "Mi woondirii [Fello] Tuuri ngon",
            "verse 52:2": "E Deftere winndaande nden",
            "verse 52:3": "e ɗeri fontaaɗi",
            "verse 52:4": "E Suudu wuurniraandu ndun",
            "verse 52:5": "E Kippoodi toowundi ndin",
            "verse 52:6": "E maayo heewuno ngon",
            "verse 52:7": "Pellet, lepte Joomi maa ɗen ko yanooje",
            "verse 52:8": "Alaa duñoowo ɗe",
            "verse 52:9": "Ñalnde kammu ngun dillirta dillere",
            "verse 52:10": "pelle ɗen wona e yahugol",
            "verse 52:11": "haray nden ñalnde, bone woodanii fennuɓe ɓen",
            "verse 52:12": "ɓen wonuɓe e jumpugol, hiɓe fija",
            "verse 52:13": "Ñalnde ɓe duñiroytee doole ka Yiite Jahannama duñannde",
            "verse 52:14": "[Ɓe wi`anee] : \"Ko ngee Yiite woni ko fennaynoɗon",
            "verse 52:15": "E ko mbilewu nii? Kaa hara on alaa yi’ude",
            "verse 52:16": "Sumee e magge! Muññiɗon maa on muññaaki, fow no fota e mon. Anndee ko yoɓeteɗon, ko kon ko gollaynoɗon",
            "verse 52:17": "Pellet, gomɗuɓe ɓen hino e Aljannaaji e neemaaji",
            "verse 52:18": "ko ɓe dakimitotooɓe kon ko Joomi maɓɓe okki ɓe, Joomi maɓɓe daɗndi ɓe lepte Jahiimi ɗen",
            "verse 52:19": "[Ɓe wi`anee] : \"Ñaamee yaron, ko newi moɗdeum, sabu kon ko gollaynoɗon",
            "verse 52:20": "hara ko on soɓɓindiiɓe e hoore danɗe weertindiraaɗe\", Men resina ɓe kadi yooɗa e yaaJa giteeɓe",
            "verse 52:21": "Ɓen gomɗimɓe, geyngol maɓɓe ngol kadi jokki ɓe e gomɗinal, Men tawtindinay ɓe e geyngol maɓɓe ngol. Men ɗuytantaa ɓe huunde e golle maɓɓe ɗen; neɗɗo kala ko faggitii kon no tiginaa",
            "verse 52:22": "Men ɓeydani ɓe muuyanteeɗi e tebbeeli kala ko tuuyetee",
            "verse 52:23": "Hiɓe jaaɓondira ton, ñedduɗe ɗe jillaa meere wanaa ko bakkondinta",
            "verse 52:24": "Sukaaɓe no eltanaaɓe hino wanngoo hakkunde maɓɓe, wa’uɓe wa kaŋŋe maraaɗe",
            "verse 52:25": "Yoga maɓɓe fewtita yoga, ɓe lamndondira",
            "verse 52:26": "ɓe wi`a: \"Pellet, men laatino ado [hannde], hulunooɓe [lepte ɗen] hakkunde yimɓe amen",
            "verse 52:27": "Allah moƴƴii e amen, O daɗni men lepte Norngal",
            "verse 52:28": "Men laatino ado [hannde], torotonooɓe Mo. Pellet, ko Kanko woni Moƴƴo, Hinnotooɗo On",
            "verse 52:29": "Anndintin tun, sabu neema Joomi maa on, a wonaa ndureejo wanaa a feetuɗo",
            "verse 52:30": "Kaa ɓe wi`ay wonnde : \"Ko yimoowo ! Men habbitani mo tun jikke maayde",
            "verse 52:31": "Maaku : \"Awa habbitee ! Min kadi miɗo habbitodi e mon",
            "verse 52:32": "Kaa ko haqqille maɓɓe ɗen yamirɓe ɗum? Kaa hara ko ɓe yimɓe bewuɓe tun",
            "verse 52:33": "Kaa ɓe wi`ay wonnde : \"O sincu nde?\" Si ko woni, wanaa ɓe gomɗinooɓe",
            "verse 52:34": "Awa yo ɓe addii yewtere sugu mayre, si wonii ko ɓe goonguɓe",
            "verse 52:35": "Kaa ɓe tagira ɓaawo taguɗo? Kaa ko kamɓe woni taguɓe ɓen",
            "verse 52:36": "Kaa (ko) kamɓe tagi kammuuli ɗin e leydi ndin? Ko woni kon, ɓe yananaaka",
            "verse 52:37": "Kaa ɓe jogiti ngaluuji Joomi maa ɗin? Kaa ko kamɓe woni huɓindiiɓe ɓen",
            "verse 52:38": "Kaa ɓe jogiti ɓargal ngal ɓe jentorta? Awa yo heɗitiiɗo maɓɓe on addu hujja ɓannguɗo",
            "verse 52:39": "Kaa hara ko ɓiɗɓe rewɓe woodanta Mo, onon kan worɓe ɓen",
            "verse 52:40": "Kaa a lamndi ɓe njoɓdi, hara yoɓugol ndi no teddani ɓe",
            "verse 52:41": "Kaa ɓe anndu fii wirniiɗi ɗin, hara hiɓe winnda",
            "verse 52:42": "Kaa ɓe faala fewjoore? Doo ko yedduɓe ɓen, woni fooleteeɓe pewje ɓen",
            "verse 52:43": "Kaa hiɓe mari reweteeɗo ko woori Allah? Senaade woodanii Allah, e kon ko ɓe sirkata",
            "verse 52:44": "Si ɓe yi`ii taƴatine immornde ka kammu no yani, ɓe wi`a: \"Ko duule fawondirɗe",
            "verse 52:45": "Terto ɓe, haa ɓe hawroya e ñalaande maɓɓe nde ɓe leptoytee e mun",
            "verse 52:46": "Ñalnde nde pewje maɓɓe duncanoytaa ɓe hay huunde, ɓe wonaa kadi walloyteeɓe",
            "verse 52:47": "Ko pellet, hino woodani tooñuɓe ɓen, lepte goo ko wanaa ɗen ɗon. Kono ko ɓuri ɗuuɗude kon e maɓɓe, ɓe anndaa",
            "verse 52:48": "Muñño ñaawoore Joomi maa nden. Tawde pellet, hiɗa e ndenka Amen. Seniniraa yettugol Joomi maa, tuma ɓaŋotoɗaa",
            "verse 52:49": "Jemma on kadi, subbunhinanoɗaa Mo e ka mutugol koode"
        },
        "German": {
            "verse 52:1": "Bei dem Berg;",
            "verse 52:2": "und bei einem Buch, das in Zeilen niedergeschrieben ist",
            "verse 52:3": "auf ausgebreiteter Tierhaut;",
            "verse 52:4": "bei dem vielbesuchten (Gottes)haus",
            "verse 52:5": "und bei dem erhöhten Dach",
            "verse 52:6": "und bei dem angefüllten Meer!",
            "verse 52:7": "Die Strafe deines Herrn wird gewiß hereinbrechen.",
            "verse 52:8": "Es gibt niemanden, der sie abwehren könnte.",
            "verse 52:9": "Am Tag, da der Himmel sich heftig hin und her bewegen",
            "verse 52:10": "und die Berge sich in der Tat bewegen werden,",
            "verse 52:11": "wehe an jenem Tag den Leugnern (der Botschaft),",
            "verse 52:12": "die in schweifenden Gesprächen ihr Spiel treiben!",
            "verse 52:13": "Am Tag, da sie gewaltsam zum Feuer der Hölle gestoßen werden:",
            "verse 52:14": "\"Das ist das Feuer, das ihr für Lüge zu erklären pflegtet.",
            "verse 52:15": "Ist dies (nun) etwa Zauberei, oder könnt ihr nicht sehen?",
            "verse 52:16": "Seid ihm ausgesetzt und ertragt es dann standhaft oder nicht, gleich ist es in Bezug auf euch; euch wird nur das vergolten, was ihr zu tun pflegtet.\"",
            "verse 52:17": "Die Gottesfürchtigen aber werden in Gärten und Wonne sein.",
            "verse 52:18": "Sie lassen es sich wohl sein an dem, was ihnen ihr Herr gibt. Und ihr Herr bewahrt sie vor der Strafe des Höllenbrandes.",
            "verse 52:19": "\"Eßt und trinkt als wohlbekömmlich für das, was ihr zu tun pflegtet,",
            "verse 52:20": "indem ihr euch auf (voreinander)gereihten Liegen lehnt.\" Und Wir geben ihnen als Gattinnen Huris mit schönen, großen Augen.",
            "verse 52:21": "Und denjenigen, die glauben und denen ihre Nachkommenschaft im Glauben nachfolgt, lassen Wir ihre Nachkommenschaft sich (ihnen) anschließen. Und Wir verringern ihnen gar nichts von ihren Werken. Jedermann ist an das, was er erworben hat, gebunden.",
            "verse 52:22": "Und Wir versorgen sie reichlich mit Früchten und Fleisch von dem, was sie begehren.",
            "verse 52:23": "Sie greifen darin miteinander nach einem Becher, in dem nichts darin ist, was zu unbedachter Rede verleitet und zu keiner Versündigung.",
            "verse 52:24": "Und unter ihnen gehen Jünglinge umher, die zu ihnen gehören, als wären sie wohlverwahrte Perlen.",
            "verse 52:25": "Und sie wenden sich einander zu und fragen sich gegenseitig.",
            "verse 52:26": "Sie sagen: \"Gewiß, früher waren wir inmitten unserer Angehörigen besorgt.",
            "verse 52:27": "Da erwies Allah uns eine Wohltat und bewahrte uns vor der Strafe des Glutwindes.",
            "verse 52:28": "Gewiß, früher pflegten wir Ihn anzurufen. Gewiß, Er ist ja der Gütige und Barmherzige.\"",
            "verse 52:29": "So ermahne (nur); du bist ja durch die Gunst deines Herrn weder ein Wahrsager noch ein Besessener.",
            "verse 52:30": "Oder sagen sie etwa: \"Ein Dichter, gegen den wir die (Unglücks)fälle der Zeit abwarten\"?",
            "verse 52:31": "Sag: Wartet ab! Gewiß, ich gehöre mit euch zu denjenigen, die abwarten.",
            "verse 52:32": "Oder befiehlt ihnen etwa ihr Verstand dies, oder sind sie (vielmehr) Leute, die das Maß (an Frevel) überschreiten?",
            "verse 52:33": "Oder sagen sie etwa: \"Er hat ihn sich selbst ausgedacht'\"? Nein! Vielmehr glauben sie nicht.",
            "verse 52:34": "So sollen sie doch eine Aussage gleicher Art beibringen, wenn sie wahrhaftig sind.",
            "verse 52:35": "Oder sind sie etwa aus dem Nichts erschaffen worden, oder sind sie (gar) selbst die Schöpfer?",
            "verse 52:36": "Oder haben sie (etwa) die Himmel und die Erde erschaffen? Nein! Vielmehr sind sie nicht überzeugt.",
            "verse 52:37": "Oder besitzen sie (etwa) die Schatzkammern deines Herrn, oder sind sie es, die die Oberherrschaft ausüben?",
            "verse 52:38": "Oder haben sie eine Leiter, mit der sie (den Himmel) abhören (können)? Dann soll doch ihr Abhörer eine deutliche Ermächtigung beibringen.",
            "verse 52:39": "Oder hat Er (für Sich selbst) die Töchter und habt ihr (für euch selbst) die Söhne (bestimmt)?",
            "verse 52:40": "Oder verlangst du (etwa) von ihnen einen Lohn, so daß sie mit Schulden belastet wären?",
            "verse 52:41": "Oder besitzen sie (das Wissen über) das Verborgene, so daß sie (es) aufschreiben (können)?",
            "verse 52:42": "Oder wollen sie eine List anwenden? Aber diejenigen, die ungläubig sind, sind es, die der List erliegen.",
            "verse 52:43": "Oder haben sie einen anderen Gott als Allah? Preis sei Allah! (und Erhaben ist Er) über das, was sie (Ihm) beigesellen.",
            "verse 52:44": "Und wenn sie ein Stück vom Himmel herabfallen sähen, würden sie sagen: \"Aufgeschichtete Wolken.\"",
            "verse 52:45": "Lasse sie nur, bis sie ihrem Tag begegnen, an dem sie wie vom Donnerschlag getroffen zusammenbrechen werden,",
            "verse 52:46": "dem Tag, da ihre List ihnen nichts nützen und ihnen keine Hilfe zuteil werden wird.",
            "verse 52:47": "Gewiß, für diejenigen, die Unrecht tun, wird es eine Strafe außer dieser geben, aber die meisten von ihnen wissen nicht.",
            "verse 52:48": "Sei standhaft gegenüber dem Urteil deines Herrn. Gewiß, du bist ja vor Unseren Augen. Und lobpreise deinen Herrn, wenn du aufstehst,",
            "verse 52:49": "und (in einem Teil) von der Nacht, da preise Ihn, und beim Schwinden der Sterne."
        },
        "Hausa": {
            "verse 52:1": "Inã rantsuwa da ¦ũr (Dũtsen Mũsã).",
            "verse 52:2": "Da wani littãfi rubũtacce.",
            "verse 52:3": "A cikin wata takardar fãta shimfiɗaɗɗa.",
            "verse 52:4": "Da Gidan da aka rãyar da shi (da ibãda).",
            "verse 52:5": "Da rufin nan da aka ɗaukaka.",
            "verse 52:6": "Da tẽkun nan da aka cika (da ruwa).",
            "verse 52:7": "Lalle, azãbar Ubangijinka, haƙĩƙa, mai aukuwa ce.",
            "verse 52:8": "Bã ta da mai tunkuɗẽwa.",
            "verse 52:9": "Rãnar da samã ke yin mõtsi tanã kai kãwo.",
            "verse 52:10": "Kuma duwãtsu nã tafiya sunã shũɗẽwa.",
            "verse 52:11": "To, bone yã tabbata a rãnar nan ga mãsu ƙaryatãwa.",
            "verse 52:12": "Waɗanda suke a cikin kududdufi sunã wãsã.",
            "verse 52:13": "Rãnar da zã a tunkuɗa su zuwa wutar Jahannama, tunkuɗãwa.",
            "verse 52:14": "(A ce musu): \"Wannan ita ce wutar da kuka kasance kunã ƙaryatãwa game da ita.\"",
            "verse 52:15": "\"To, shin wannan sihiri ne kõ kuwa kũ ne bã ku gani?\"",
            "verse 52:16": "\"Ku shigẽ ta. To, ku yi haƙuri ko kuma kada ku yi haƙuri, dai dai ne a kanku, kawai anã yi muku sakamakon abin da kuka kasance kunã aikatãwa.\"",
            "verse 52:17": "Lalle, mãsu taƙawa, sunã a cikin gidãjen Aljanna da wata ni'ima.",
            "verse 52:18": "Sunã mãsu jin dãɗi da abin da Ubangijinsu Ya ba su, kuma Ubangijinsu Ya tsãre musu azãbar Jahĩm.",
            "verse 52:19": "(A ce musu): \"Ku ci, ku sha, da ni'ima, dõmin abin da kuka kasance kunã aikatãwa.\"",
            "verse 52:20": "Sunã kishingiɗe a kan karagu waɗanda ke cikin sahu, kuma Muka aurar da su waɗansu mãtã mãsu farin idãnu, mãsu girmansu.",
            "verse 52:21": "Kuma waɗanda suka yi ĩmãni kuma zũriyarsu suka bĩ su ga ĩmãnin, Mun riskar da zũriyarsu da su, alhãli kuwa bã da Mun rage musu kõme ba daga aikinsu, kõwane mutum jingina ne ga abin da ya sana'anta.",
            "verse 52:22": "Kuma Muka yalwata musu 'ya'yan itãce da nãma irin wanda suke marmari.",
            "verse 52:23": "Sunã mĩƙa wa jũnansu a cikinta hinjãlan giya, wadda bãbu yãsassar magana a cikinta, kuma bãbu jin nauyin zunubi.",
            "verse 52:24": "Kuma waɗansu samãri nã gẽwayãwa a kansu, kamar dai sũ lu'ulu'u ne wanda ke kulle.",
            "verse 52:25": "Waɗansunsu suka fuskanta zuwa ga waɗansu, sunã tambayar jũna.",
            "verse 52:26": "Suka ce: \"Lalle mũ mun kasance a gabãnin wannan (a dũniya) a cikin iyãlanmu munã jin tsõro.\"",
            "verse 52:27": "\"To, Allah Yã yi mana kyautar falala, kuma Yã tsare mana azãbar iskar zãfi.\"",
            "verse 52:28": "\"Lalle mũ mun kasance, a gãbanin haka, munã kiran sa. Lalle Shĩ, Shĩ ne Mai kyautatãwa, Mai rahama.\"",
            "verse 52:29": "To, ka tunãtar kai fa sabõda ni'imar Ubangjinka, bã bõka kake ba, kuma bã mahaukaci ba.",
            "verse 52:30": "Shin zã su ce: \"Mawãƙi ne, munã jiran, masĩfun mutuwa game da shĩ\"?",
            "verse 52:31": "Ka ce: \"Ku yi jira, domin nĩ ma lalle inã a cikin mãsu jira tãre da ku.\"",
            "verse 52:32": "Shin, hankulansu ne ke umarin su da wannan, kõ kuwa sũ wasu mutãne ne mãsu ƙetare haddi?",
            "verse 52:33": "Shin, cẽwa suke yi: \"Shi ne ke ƙãga faɗarsa\"? Ã'a ba su dai yi ĩmãni ba.",
            "verse 52:34": "Sai su zõ da wani lãbãri mai misãlinsa idan sun kasance sũmãsu gaskiya ne.",
            "verse 52:35": "Shin, an halitta su ne bã daga kõme ba, kõ kuwa sũ ne mãsu yin halitta?",
            "verse 52:36": "Shin, sun halitta sammai da ƙasa ne? Ã'a ba su dai yi ĩmãnin yaƙĩni ba.",
            "verse 52:37": "Shin, taskõkin Ubangijinka, sunã a wurinsu ne? Kõ kuwa sũ ne mãsu rinjãya?",
            "verse 52:38": "Shin, sunã da wani tsãni ne wanda suke (hawa sunã) saurãron (lãbãrin samã) a cikinsa? Sai mai saurarõnsu ya zo da wani dalĩli bayyananne.",
            "verse 52:39": "Shin, Yanã da 'ya'ya mãtã ne kuma kũ, kunã da ɗiya maza ne?",
            "verse 52:40": "Shin, kanã tambayar su wata ijãra ne, sabõda haka suka zama mãsu jin nauyin biyan tãrar?",
            "verse 52:41": "Shin, a wurinsu akwai ilmin gaibi, sabõda haka sunã rubũtãwa?",
            "verse 52:42": "Shin, sunã nufin wani kaidi ne? To, waɗanda suka kãfirta sũ ne waɗanda ake yi wa kaidi.",
            "verse 52:43": "Shin, sunã da wani abin bautãwa ne wanda bã Allah ba? Tsarki ya tabbata ga Allah daga abin da suke yi na shirki!",
            "verse 52:44": "Kuma idan sun ga wani ɓaɓɓake daga samã yãnã fãɗuwa, sai su ce wani girgije ne, mai hauhawar jũna.",
            "verse 52:45": "To, ka bar su, sai sun haɗu da yinin nan da za a sũmar da su a cikinsa.",
            "verse 52:46": "Rãnar da kaidinsu bã ya wadãtar masu da kõme, kuma bã a taimakon su.",
            "verse 52:47": "Kuma lalle, waɗannan da suka yi zãluncin, sunã da azãba (a nan dũniya) banda waccan, kuma mafi yawansu ba su sani ba.",
            "verse 52:48": "Sai ka yi hakuri da hukuncin Ubangijinka, lalle kai fa kanã idãnunMu, kuma ka tsarkake Ubangijinka da (tasbĩhi) game da gõde Masa a lõkacin da kake tãshi tsaye (dõmin salla kõ wani abu).",
            "verse 52:49": "Kuma daga dare, sai ka tsarkake Shi (da tasbĩhin) dalõkacin jũyãwar taurãri."
        },
        "Hindi": {
            "verse 52:1": "(कोहे) तूर की क़सम",
            "verse 52:2": "और उसकी किताब (लौहे महफूज़) की",
            "verse 52:3": "जो क़ुशादा औराक़ में लिखी हुई है",
            "verse 52:4": "और बैतुल मामूर की (जो काबा के सामने फरिश्तों का क़िब्ला है)",
            "verse 52:5": "और ऊँची छत (आसमान) की",
            "verse 52:6": "और जोश व ख़रोश वाले समन्दर की",
            "verse 52:7": "कि तुम्हारे परवरदिगार का अज़ाब बेशक वाकेए होकर रहेगा",
            "verse 52:8": "(और) इसका कोई रोकने वाला नहीं",
            "verse 52:9": "जिस दिन आसमान चक्कर खाने लगेगा",
            "verse 52:10": "और पहाड़ उड़ने लगेंगे",
            "verse 52:11": "तो उस दिन झुठलाने वालों की ख़राबी है",
            "verse 52:12": "जो लोग बातिल में पड़े खेल रहे हैं",
            "verse 52:13": "जिस दिन जहन्नुम की आग की तरफ उनको ढकेल ढकेल ले जाएँगे",
            "verse 52:14": "(और उनसे कहा जाएगा) यही वह जहन्नुम है जिसे तुम झुठलाया करते थे",
            "verse 52:15": "तो क्या ये जादू है या तुमको नज़र ही नहीं आता",
            "verse 52:16": "इसी में घुसो फिर सब्र करो या बेसब्री करो (दोनों) तुम्हारे लिए यकसाँ हैं तुम्हें तो बस उन्हीं कामों का बदला मिलेगा जो तुम किया करते थे",
            "verse 52:17": "बेशक परहेज़गार लोग बाग़ों और नेअमतों में होंगे",
            "verse 52:18": "जो (जो नेअमतें) उनके परवरदिगार ने उन्हें दी हैं उनके मज़े ले रहे हैं और उनका परवरदिगार उन्हें दोज़ख़ के अज़ाब से बचाएगा",
            "verse 52:19": "जो जो कारगुज़ारियाँ तुम कर चुके हो उनके सिले में (आराम से) तख्तों पर जो बराबर बिछे हुए हैं",
            "verse 52:20": "तकिए लगाकर ख़ूब मज़े से खाओ पियो और हम बड़ी बड़ी ऑंखों वाली हूर से उनका ब्याह रचाएँगे",
            "verse 52:21": "और जिन लोगों ने ईमान क़ुबूल किया और उनकी औलाद ने भी ईमान में उनका साथ दिया तो हम उनकी औलाद को भी उनके दर्जे पहुँचा देंगे और हम उनकी कारगुज़ारियों में से कुछ भी कम न करेंगे हर शख़्श अपने आमाल के बदले में गिरवी है",
            "verse 52:22": "और जिस क़िस्म के मेवे और गोश्त को उनका जी चाहेगा हम उन्हें बढ़ाकर अता करेंगे",
            "verse 52:23": "वहाँ एक दूसरे से शराब का जाम ले लिया करेंगे जिसमें न कोई बेहूदगी है और न गुनाह",
            "verse 52:24": "(और ख़िदमत के लिए) नौजवान लड़के उनके आस पास चक्कर लगाया करेंगे वह (हुस्न व जमाल में) गोया एहतियात से रखे हुए मोती हैं",
            "verse 52:25": "और एक दूसरे की तरफ रूख़ करके (लुत्फ की) बातें करेंगे",
            "verse 52:26": "(उनमें से कुछ) कहेंगे कि हम इससे पहले अपने घर में (ख़ुदा से बहुत) डरा करते थे",
            "verse 52:27": "तो ख़ुदा ने हम पर बड़ा एहसान किया और हमको (जहन्नुम की) लौ के अज़ाब से बचा लिया",
            "verse 52:28": "इससे क़ब्ल हम उनसे दुआएँ किया करते थे बेशक वह एहसान करने वाला मेहरबान है",
            "verse 52:29": "तो (ऐ रसूल) तुम नसीहत किए जाओ तो तुम अपने परवरदिगार के फज़ल से न काहिन हो और न मजनून किया",
            "verse 52:30": "क्या (तुमको) ये लोग कहते हैं कि (ये) शायर हैं (और) हम तो उसके बारे में ज़माने के हवादिस का इन्तेज़ार कर रहे हैं",
            "verse 52:31": "तुम कह दो कि (अच्छा) तुम भी इन्तेज़ार करो मैं भी इन्तेज़ार करता हूँ",
            "verse 52:32": "क्या उनकी अक्लें उन्हें ये (बातें) बताती हैं या ये लोग हैं ही सरकश",
            "verse 52:33": "क्या ये लोग कहते हैं कि इसने क़ुरान ख़ुद गढ़ लिया है बात ये है कि ये लोग ईमान ही नहीं रखते",
            "verse 52:34": "तो अगर ये लोग सच्चे हैं तो ऐसा ही कलाम बना तो लाएँ",
            "verse 52:35": "क्या ये लोग किसी के (पैदा किये) बग़ैर ही पैदा हो गए हैं या यही लोग (मख़लूक़ात के) पैदा करने वाले हैं",
            "verse 52:36": "या इन्होने ही ने सारे आसमान व ज़मीन पैदा किए हैं (नहीं) बल्कि ये लोग यक़ीन ही नहीं रखते",
            "verse 52:37": "क्या तुम्हारे परवरदिगार के ख़ज़ाने इन्हीं के पास हैं या यही लोग हाकिम हैं",
            "verse 52:38": "या उनके पास कोई सीढ़ी है जिस पर (चढ़ कर आसमान से) सुन आते हैं जो सुन आया करता हो तो वह कोई सरीही दलील पेश करे",
            "verse 52:39": "क्या ख़ुदा के लिए बेटियाँ हैं और तुम लोगों के लिए बेटे",
            "verse 52:40": "या तुम उनसे (तबलीग़े रिसालत की) उजरत माँगते हो कि ये लोग कर्ज़ के बोझ से दबे जाते हैं",
            "verse 52:41": "या इन लोगों के पास ग़ैब (का इल्म) है कि वह लिख लेते हैं",
            "verse 52:42": "या ये लोग कुछ दाँव चलाना चाहते हैं तो जो लोग काफ़िर हैं वह ख़ुद अपने दांव में फँसे हैं",
            "verse 52:43": "या ख़ुदा के सिवा इनका कोई (दूसरा) माबूद है जिन चीज़ों को ये लोग (ख़ुदा का) शरीक बनाते हैं वह उससे पाक और पाक़ीज़ा है",
            "verse 52:44": "और अगर ये लोग आसमान से कोई अज़ाब (अज़ाब का) टुकड़ा गिरते हुए देखें तो बोल उठेंगे ये तो दलदार बादल है",
            "verse 52:45": "तो (ऐ रसूल) तुम इनको इनकी हालत पर छोड़ दो यहाँ तक कि वह जिसमें ये बेहोश हो जाएँगे",
            "verse 52:46": "इनके सामने आ जाए जिस दिन न इनकी मक्कारी ही कुछ काम आएगी और न इनकी मदद ही की जाएगी",
            "verse 52:47": "और इसमें शक़ नहीं कि ज़ालिमों के लिए इसके अलावा और भी अज़ाब है मगर उनमें बहुतेरे नहीं जानते हैं",
            "verse 52:48": "और (ऐ रसूल) तुम अपने परवरदिगार के हुक्म से इन्तेज़ार में सब्र किए रहो तो तुम बिल्कुल हमारी निगेहदाश्त में हो तो जब तुम उठा करो तो अपने परवरदिगार की हम्द की तस्बीह किया करो",
            "verse 52:49": "और कुछ रात को भी और सितारों के ग़ुरूब होने के बाद तस्बीह किया करो"
        },
        "Indonesian": {
            "verse 52:1": "Demi bukit,",
            "verse 52:2": "dan Kitab yang ditulis,",
            "verse 52:3": "pada lembaran yang terbuka,",
            "verse 52:4": "dan demi Baitul Ma'mur,",
            "verse 52:5": "dan atap yang ditinggikan (langit),",
            "verse 52:6": "dan laut yang di dalam tanahnya ada api,",
            "verse 52:7": "sesungguhnya azab Tuhanmu pasti terjadi,",
            "verse 52:8": "tidak seorangpun yang dapat menolaknya,",
            "verse 52:9": "pada hari ketika langit benar-benar bergoncang,",
            "verse 52:10": "dan gunung benar-benar berjalan.",
            "verse 52:11": "Maka kecelakaan yang besarlah di hari itu bagi orang-orang yang mendustakan,",
            "verse 52:12": "(yaitu) orang-orang yang bermain-main dalam kebathilan,",
            "verse 52:13": "pada hari mereka didorong ke neraka Jahannam dengan sekuat-kuatnya.",
            "verse 52:14": "(Dikatakan kepada mereka): \"Inilah neraka yang dahulu kamu selalu mendustakannya\".",
            "verse 52:15": "Maka apakah ini sihir? Ataukah kamu tidak melihat?",
            "verse 52:16": "Masukklah kamu ke dalamnya (rasakanlah panas apinya); maka baik kamu bersabar atau tidak, sama saja bagimu; kamu diberi balasan terhadap apa yang telah kamu kerjakan.",
            "verse 52:17": "Sesungguhnya orang-orang yang bertakwa berada dalam surga dan kenikmatan,",
            "verse 52:18": "mereka bersuka ria dengan apa yang diberikan kepada mereka oleh Tuhan mereka; dan Tuhan mereka memelihara mereka dari azab neraka.",
            "verse 52:19": "(Dikatakan kepada mereka): \"Makan dan minumlah dengan enak sebagai balasan dari apa yang telah kamu kerjakan\",",
            "verse 52:20": "mereka bertelekan di atas dipan-dipan berderetan dan Kami kawinkan mereka dengan bidadari-bidadari yang cantik bermata jeli.",
            "verse 52:21": "Dan orang-oranng yang beriman, dan yang anak cucu mereka mengikuti mereka dalam keimanan, Kami hubungkan anak cucu mereka dengan mereka, dan Kami tiada mengurangi sedikitpun dari pahala amal mereka. Tiap-tiap manusia terikat dengan apa yang dikerjakannya.",
            "verse 52:22": "Dan Kami beri mereka tambahan dengan buah-buahan dan daging dari segala jenis yang mereka ingini.",
            "verse 52:23": "Di dalam surga mereka saling memperebutkan piala (gelas) yang isinya tidak (menimbulkan) kata-kata yang tidak berfaedah dan tiada pula perbuatan dosa.",
            "verse 52:24": "Dan berkeliling di sekitar mereka anak-anak muda untuk (melayani) mereka, seakan-akan mereka itu mutiara yang tersimpan.",
            "verse 52:25": "Dan sebahagian mereka menghadap kepada sebahagian yang lain saling tanya-menanya.",
            "verse 52:26": "Mereka berkata: \"Sesungguhnya kami dahulu, sewaktu berada di tengah-tengah keluarga kami merasa takut (akan diazab)\".",
            "verse 52:27": "Maka Allah memberikan karunia kepada kami dan memelihara kami dari azab neraka.",
            "verse 52:28": "Sesungguhnya kami dahulu menyembah-Nya. Sesungguhnya Dialah yang melimpahkan kebaikan lagi Maha Penyayang.",
            "verse 52:29": "Maka tetaplah memberi peringatan, dan kamu disebabkan nikmat Tuhanmu bukanlah seorang tukang tenung dan bukan pula seorang gila.",
            "verse 52:30": "Bahkan mereka mengatakan: \"Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya\".",
            "verse 52:31": "Katakanlah: \"Tunggulah, maka sesungguhnya akupun termasuk orang yang menunggu (pula) bersama kamu\".",
            "verse 52:32": "Apakah mereka diperintah oleh fikiran-fikiran mereka untuk mengucapkan tuduhan-tuduhan ini ataukah mereka kaum yang melampaui batas?",
            "verse 52:33": "Ataukah mereka mengatakan: \"Dia (Muhammad) membuat-buatnya\". Sebenarnya mereka tidak beriman.",
            "verse 52:34": "Maka hendaklah mereka mendatangkan kalimat yang semisal Al Quran itu jika mereka orang-orang yang benar.",
            "verse 52:35": "Apakah mereka diciptakan tanpa sesuatupun ataukah mereka yang menciptakan (diri mereka sendiri)?",
            "verse 52:36": "Ataukah mereka telah menciptakan langit dan bumi itu?; sebenarnya mereka tidak meyakini (apa yang mereka katakan).",
            "verse 52:37": "Ataukah di sisi mereka ada perbendaharaan Tuhanmu atau merekakah yang berkuasa?",
            "verse 52:38": "Ataukah mereka mempunyai tangga (ke langit) untuk mendengarkan pada tangga itu (hal-hal yang gaib)? Maka hendaklah orang yang mendengarkan di antara mereka mendatangkan suatu keterangan yang nyata.",
            "verse 52:39": "Ataukah untuk Allah anak-anak perempuan dan untuk kamu anak-anak laki-laki?",
            "verse 52:40": "Ataukah kamu meminta upah kepada mereka sehingga mereka dibebani dengan hutang?",
            "verse 52:41": "Apakah ada pada sisi mereka pengetahuan tentang yang gaib lalu mereka menuliskannya?",
            "verse 52:42": "Ataukah mereka hendak melakukan tipu daya? Maka orang-orang yang kafir itu merekalah yang kena tipu daya.",
            "verse 52:43": "Ataukah mereka mempunyai tuhan selain Allah. Maha Suci Allah dari apa yang mereka persekutukan.",
            "verse 52:44": "Jika mereka melihat sebagian dari langit gugur, mereka akan mengatakan: \"Itu adalah awan yang bertindih-tindih\".",
            "verse 52:45": "Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka yang pada hari itu mereka dibinasakan,",
            "verse 52:46": "(yaitu) hari ketika tidak berguna bagi mereka sedikitpun tipu daya mereka dan mereka tidak ditolong.",
            "verse 52:47": "Dan sesungguhnya untuk orang-orang yang zalim ada azab selain daripada itu. Tetapi kebanyakan mereka tidak mengetahui.",
            "verse 52:48": "Dan bersabarlah dalam menunggu ketetapan Tuhanmu, maka sesungguhnya kamu berada dalam penglihatan Kami, dan bertasbihlah dengan memuji Tuhanmu ketika kamu bangun berdiri,",
            "verse 52:49": "dan bertasbihlah kepada-Nya pada beberapa saat di malam hari dan di waktu terbenam bintang-bintang (di waktu fajar)."
        },
        "Italian": {
            "verse 52:1": "Per il Monte,",
            "verse 52:2": "per un Libro scritto",
            "verse 52:3": "su pergamena distesa,",
            "verse 52:4": "per la Casa visitata,",
            "verse 52:5": "per la volta elevata,",
            "verse 52:6": "per il mare ribollente.",
            "verse 52:7": "Il castigo del tuo Signore avverrà inevitabilmente,",
            "verse 52:8": "nessuno potrà impedirlo.",
            "verse 52:9": "Il Giorno in cui il cielo tremante, tremerà",
            "verse 52:10": "e le montagne si metteranno in marcia,",
            "verse 52:11": "guai in quel Giorno, a coloro che tacciano di menzogna,",
            "verse 52:12": "a coloro che si dilettano nella vanità!",
            "verse 52:13": "Il Giorno in cui saranno spinti brutalmente nel fuoco dell'Inferno,",
            "verse 52:14": "[sarà detto loro]: “Ecco il fuoco che tacciavate di menzogna!",
            "verse 52:15": "È magia questa? O siete voi che non vedete?",
            "verse 52:16": "Entrateci! Che lo sopportiate oppure no, sarà per voi la stessa cosa. Sarete compensati solo di quello che avrete fatto”.",
            "verse 52:17": "In verità i timorati saranno nei Giardini, nelle delizie,",
            "verse 52:18": "a godersi quello che il loro Signore avrà dato loro. Il loro Signore li avrà preservati dal castigo della Fornace.",
            "verse 52:19": "[Sarà detto loro]: “Mangiate e bevete in serenità, [ricompensa questa] per quel che avete fatto!”.",
            "verse 52:20": "[Staranno] appoggiati su divani disposti in ranghi e daremo loro in spose le fanciulle dai grandi occhi neri.",
            "verse 52:21": "Coloro che avranno creduto e che saranno stati seguiti nella fede dalla loro progenie, Noi li riuniremo ai loro figli. Non diminuiremo in nulla il merito delle loro azioni, poiché ognuno è pegno di quello che si sarà guadagnato.",
            "verse 52:22": "Provvederemo loro i frutti e le carni che desidereranno.",
            "verse 52:23": "Si scambieranno un calice immune da vanità o peccato.",
            "verse 52:24": "E per servirli circoleranno tra loro giovanetti simili a perle nascoste.",
            "verse 52:25": "Si andranno vicendevolmente incontro, interpellandosi.",
            "verse 52:26": "Diranno: “Vivevamo tra la nostra gente nel timore [di Allah]",
            "verse 52:27": "ma Allah ci ha favorito e ci ha protetti dal castigo del Soffio Infuocato.",
            "verse 52:28": "Già noi Lo invocavamo. Egli è veramente il Caritatevole, il Misericordioso”.",
            "verse 52:29": "Ammonisci dunque, poiché per grazia del tuo Signore non sei né un indovino né un folle.",
            "verse 52:30": "Diranno: “È un poeta, aspettiamo che subisca qualche vicissitudine mortale”.",
            "verse 52:31": "Di': “Aspettate, ché anch'io aspetterò con voi”.",
            "verse 52:32": "È la loro ragione che li induce a ciò, o sono un popolo di superbi?",
            "verse 52:33": "Diranno: “Lo ha inventato lui stesso”. Piuttosto [sono loro che] non vogliono credere.",
            "verse 52:34": "Producano dunque un discorso simile a questo, se sono sinceri.",
            "verse 52:35": "Sono stati forse creati dal nulla oppure sono essi stessi i creatori?",
            "verse 52:36": "O hanno creato i cieli e la terra? In realtà non sono affatto convinti.",
            "verse 52:37": "Hanno presso di loro i tesori del tuo Signore o sono loro i dominatori?",
            "verse 52:38": "Hanno forse una scala per ascoltare? Chi ascolta per conto loro, lo provi irrefutabilmente.",
            "verse 52:39": "[Allah] avrebbe forse figlie e voi figli?",
            "verse 52:40": "Forse chiedi loro un compenso, [tale] che si sentano gravati da un peso insopportabile?",
            "verse 52:41": "Possiedono l'invisibile in modo tale da descriverlo?",
            "verse 52:42": "Vogliono tramare un'insidia? Saranno piuttosto i miscredenti ad essere ingannati.",
            "verse 52:43": "Oppure hanno un altro dio all'infuori di Allah? Gloria a Lui, Egli è ben al di sopra di quanto [Gli] associano.",
            "verse 52:44": "Se vedessero cadere un pezzo di cielo, direbbero: “È un cumulo di nuvole”.",
            "verse 52:45": "Lasciali [stare] dunque, finché non incontreranno quel loro Giorno in cui saranno folgorati,",
            "verse 52:46": "il Giorno in cui la loro astuzia non gioverà loro in alcunché e non saranno aiutati.",
            "verse 52:47": "In verità gli ingiusti saranno puniti già prima di quello. Ma la maggior parte di loro non lo sa.",
            "verse 52:48": "Sopporta con pazienza il decreto del tuo Signore, poiché in verità sei sotto i Nostri occhi. Glorifica e loda il tuo Signore quando ti alzi,",
            "verse 52:49": "e glorificaLo durante la notte e al declinare delle stelle."
        },
        "Japanese": {
            "verse 52:1": "かの（啓示の）山にかけて（誓う）。",
            "verse 52:2": "整然と書き記された啓典にかけて，",
            "verse 52:3": "巻かれていない羊皮紙に，",
            "verse 52:4": "不断に詣でられる聖殿にかけて，",
            "verse 52:5": "高く掲げられた天蓋にかけて，",
            "verse 52:6": "漲り(温?)れる大洋にかけて（誓う）。",
            "verse 52:7": "本当に主の懲罰は必ず下る。",
            "verse 52:8": "それは避け得ない。",
            "verse 52:9": "その日，天は大いにゆらゆらと揺れ，",
            "verse 52:10": "また山々は揺ぎ動くであろう。",
            "verse 52:11": "その日，（真理を）虚偽であるとした者に災いあれ。",
            "verse 52:12": "虚しい事に戯れていた者たちに。",
            "verse 52:13": "かれらが（もの凄い力で）地獄の火の中に突き落されるその日，",
            "verse 52:14": "（こう言われよう。）「これこそは，あなたがたが虚偽であるとしていた地獄の業火である。",
            "verse 52:15": "これでも魔術なのか。それともあなたがたは，見えないのか。",
            "verse 52:16": "あなたがたはそこで焼かれるがいい。あなたがたがそれを耐え忍んでも，忍ばなくても同じこと。あなたがたが行ったことに，報いられるだけである。」",
            "verse 52:17": "主を畏れた者たちは必ず楽園の歓びの中に置り，",
            "verse 52:18": "主がかれらに与えるものに歓喜し，また主が獄火の懲罰からかれらを救われたことを喜ぶ。",
            "verse 52:19": "（かれらには言われよう。）「楽しんで食べ，且つ飲め。これもあなたがたの（善い）行いのためである」。",
            "verse 52:20": "かれらは並べられたソファーに寄りかかり，われは美しい目の乙女たちをかれらの配偶者にするであろう。",
            "verse 52:21": "信仰する者たち，またかれらに従った信心深い子孫の者たち，われは，それらの者を（楽園において）一緒にする。かれらの凡ての行為に対し，少しも（報奨を）軽減しないであろう。誰もがその稼ぎにたいし，報酬を受ける。",
            "verse 52:22": "またわれは果物，肉，その外かれらの望むものを与えよう。",
            "verse 52:23": "かれらはそこで互いに杯を交そう。その時にも虚しい話にふけることなく，乱暴も犯さない。",
            "verse 52:24": "かれらの周には，秘められた真珠のような子供が傅いて巡る。",
            "verse 52:25": "かれらは互いに近寄って，尋ね合い，",
            "verse 52:26": "言っていた。「以前，わたしたちは家族の間にいてもいつも気を遺っていた。",
            "verse 52:27": "だがアッラーは，わたしたちに御恵みを与えられ，熱風の懲罰から御救い下された。",
            "verse 52:28": "以前からわたしたちは，かれに祈っていたのです。本当にかれは恵み厚く，慈悲深き御方であられる」",
            "verse 52:29": "さあ，かれらに訓戒しなさい。主の恩恵によって，あなたは占い師でも気違いでもない。",
            "verse 52:30": "またかれらは，「只の詩人だ。かれの運勢が逆転するのを待とう」と言う。",
            "verse 52:31": "言ってやるがいい。「待っているがいい。わたしもあなたがたと共に待っていよう。」",
            "verse 52:32": "一体かれらの貧しい理解力がこう命じたのか，それともかれらは法外な民なのか。",
            "verse 52:33": "または，「かれ（ムハンマド）がこれを偽作したのである。」と言うのか。いや，かれらは信じてはいないのである。",
            "verse 52:34": "もしかれらの言葉が真実なら，これと同じ御告げをもってこさせるがよい。",
            "verse 52:35": "かれらは無から創られたのではないか。それともかれら自身が創造者なのか。",
            "verse 52:36": "それともかれらが，天と地を創造したのか。いや，かれらにはしっかりした信仰がないのである。",
            "verse 52:37": "それともかれらは，あなたの主の様々な宝物を持っているのか。または（事物の）管理者なのか。",
            "verse 52:38": "それともかれらには梯子があって，それで（天に登り，その秘密を）聞くことが出来るのか。それなら聞いたという者に，明確な証拠を持って来させるがよい。",
            "verse 52:39": "それともあなたがたには息子があって，かれには娘がある（だけ）というのか。",
            "verse 52:40": "それともあなたが，かれらに報酬を求め，それでかれらは負債の重荷を負っているというのか。",
            "verse 52:41": "それとも幽玄界のことがすっかり分っていて，それを書き留めているというのか。",
            "verse 52:42": "それとも（あなたに対して）策を巡らす積もりか。だが背信者たちこそ，策謀にかかるであろう。",
            "verse 52:43": "それともかれらは，アッラー以外に神があるというのか。アッラーに讃えあれ，かれは配するもの（邪神）の上にいと高くおられる。",
            "verse 52:44": "仮令天の一角が（かれらの上に）落ちるのを見ても，かれらは，「積み重なった雲です。」と言うであろう。",
            "verse 52:45": "かれらは，（恐れのために）そこに昏倒する（審判の）日に会うまで，放って置け。",
            "verse 52:46": "その日かれらの策謀は，何の益もなく，結局かれらは助けられないであろう。",
            "verse 52:47": "本当に不義な行いの者には，この外にも懲罰がある。だが，かれらの多くは気付かない。",
            "verse 52:48": "それで主の裁きを耐え忍んで待て。本当にわれはあなたがたを見守っている。そしてあなたが立ち上がる時は，主を讃えなさい。",
            "verse 52:49": "夜中に，また星々が退く時にも，かれを讃えなさい。"
        },
        "Jawa": {
            "verse 52:1": "Demi gunung Thur",
            "verse 52:2": "Demi Kitab Qur’an kang tinulis",
            "verse 52:3": "Ana ing papan kang gumelar",
            "verse 52:4": "Demi \"Baitul Makmur\" (Omah kang dimulyakake)",
            "verse 52:5": "Demi payon kang dhuwur (langit)",
            "verse 52:6": "Demi segara kang banyune agung",
            "verse 52:7": "Siksaning Allah Pangeranira kelakon temenan",
            "verse 52:8": "Siksa mau ora ana kang bisa nulak",
            "verse 52:9": "Kelakone besuk dina qiyamat nalika langit obah lan mubeng",
            "verse 52:10": "Lan gunung - gunung padha mlaku",
            "verse 52:11": "Ing dina iku siksa kang abot dadi patrapane wong kang padha maido (Rasul)",
            "verse 52:12": "Kang padha ketungkul nglakoni barang kang luput",
            "verse 52:13": "Hiya iku nalikane wong kafir padha dijorokake marang neraka jahannam",
            "verse 52:14": "Sarta didhawuhi, iki neraka kang padha sira paido biyen",
            "verse 52:15": "Apa iki sihir, apa pandelengira rusak dadi ora weruh",
            "verse 52:16": "Padha rasakna piye rasane sira bantah panase utawa ora, iku padha wae, kang dipatrapi siksa neraka iku kaluputan kang wis sira lakoni biyen",
            "verse 52:17": "Para wong kang padha bekti ing Allah padha ana suwarga panggonan kapenak",
            "verse 52:18": "Padha enak - enak nampani ganjaran paringe Pangeran sarta direksa ora kecemplung neraka jahannam",
            "verse 52:19": "Padha tampa dhawuh padha mangana lan ngombea, kelawan enak ana suwarga ganjarane penggawe becik kang wis sira lakoni biyen",
            "verse 52:20": "Wong ing suwarga padha linggih sendhen ing kursi kang ditata jejer - jejer, lan padha Ingsun dhawuhake widadari kang mripate blalak - blalak",
            "verse 52:21": "Wong - wong kang percaya ing Allah kang anake ngatur melu manut percaya anak mau Ingsun helokake bapakne, diganjar padha ganjarane Bapa tanpa disuda sethitik - sethitika. Saben manungsa iku gandhenge karo ngamal sing ditindakake",
            "verse 52:22": "Wong ing suwarga padha Ingsun paringi tambahan woh - wohan lan daging kang dipingini",
            "verse 52:23": "Ana ing suwarga dheweke padha rebutan gelas kang isine tanpa agawe mendem lan ora dadi pasulayan apa dene anggone ngombe ora duraka",
            "verse 52:24": "Lan padha ngubengi sacedhake dheweke punakawane kang rupane bagus - bagus kaya mutiara kang isih ana ing congkoke",
            "verse 52:25": "Padha hadhep - hadhepan takon - tinakon karo kancane",
            "verse 52:26": "Pangucape, \"Kala rumiyen kula nalika wonten ing tengah - tengahing keluarga ajrih sanget dhateng siksaning Allah",
            "verse 52:27": "Allah lajeng paring pitulung dhateng kula, dipun reksa biten mlebet neraka",
            "verse 52:28": "Sayektosipun rumiyen kula bektos ing Allah, sayektosipun Allah punika damel sahe tur Maha Asih",
            "verse 52:29": "Sira ditaberi nyurup - nyurupake (nerangake). Sira dudu guru pagorohan lan dudu wong edan, nanging diparingi kabungahan ing Pangeranira",
            "verse 52:30": "Wong mangro tingal malah padha kondha, \"(Muhammad) iku pinter nganggit tembang, Hiya tak entenane horeging jagad kang wecana",
            "verse 52:31": "Dhawuha, \"Hiya padha ngentenana, aku uga ngenteni karo kowe",
            "verse 52:32": "Wong mangro tingal anggone kondha mangkono mau, thukul saka akale kang nasar, utawa saka kebangeten anggone dhemen padu",
            "verse 52:33": "Dheweke (wong mangro tingal) malah padha kandha, \"Dheweke (Muhammad) iku anggone gawe - gawe\". Satemene wong mangro tingal mau ora padha iman",
            "verse 52:34": "Manawa pangucape temen padha gawea Kitab kang madhani al-Quran (terange lan bergase)",
            "verse 52:35": "Ana wong mangro tingal iku padha digawe nanging ora ana kang gawe, utawa dheweke iku gawe awake dhewe",
            "verse 52:36": "Utawa dheweke padha gawe bumi lan langit? Sejatine dheweke ora ngandel (kang kandhakake dhewe)",
            "verse 52:37": "Utawa dheweke mau nyekel gedhong pasimpene Pangeranira utawa dheweke kang kuasa",
            "verse 52:38": "Apa dheweke duwe ondho (nyang langit) kanggo ngrungokake guneme malaikat ana ing andha mau. Yen mangkono, iya wong kang ngrungokake mau nganakna tandha yekti kang cetha",
            "verse 52:39": "Apa nyata Allah peputra putri, lan kowe (kang mangro tingal) padha manak lanang",
            "verse 52:40": "Apa anggonira ngondhangake perintah Ku, kango jaluk pituwas marang dheweke, nganti dheweke padha abot anggone nganakake pituwas",
            "verse 52:41": "Apa dheweke padha kadunungan kaweruh ghoib, weruh samu barang kang samar banjur padha ditulisi (kena dianggo madoni Muhammad)",
            "verse 52:42": "Apa dheweke neja maheka marang Sira, pahekane malah bakal balik marang si kafir kabeh",
            "verse 52:43": "Apa dheweke mau ngaku duwe Pangeran liyane Allah. Allah iku maha suci , adoh banget yen kaya panemune wong mangro tingal",
            "verse 52:44": "Manawa wong kafir mau padha deleng gempalaning langit runtuh, padha ngucap, \"iki mega kang tumpuk - tumpuk",
            "verse 52:45": "Padha tokna wae nganti tekan dina anggone padha mati",
            "verse 52:46": "Yaiku dina kang ora ana gunane pahekane si kafir marang awake sethithik - thithika lan ora ana kang bisa nulungi marang dheweke",
            "verse 52:47": "Lan satemene kanggo wong kang nganiaya ana siksa sak durunge mati. Ananging kang akeh ora padha weruh",
            "verse 52:48": "Lan padha sabara narima pranataning Pangeranira awit sira tansah Ingsun huningani lan sira nyebuta, \"Maha suci\" lan memuji ing Pangeranira nalikane sira ngadeg (arep sholat)",
            "verse 52:49": "Lan ing wayah wengi apadene ing wayah surupe lintang (waktu fajar) sira hiya nyebuta \"Maha Suci\" ing Allah"
        },
        "Kazakh": {
            "verse 52:1": "Турмен ант етемін",
            "verse 52:2": "әрі жазылған Кітаппен",
            "verse 52:3": "жайылған жұқа нәрсеге жұқа теріге, қағазға",
            "verse 52:4": "Әрі Байтул-Маъмурмен (бұл жетінші аспанда тұрғызылған Қағба секілді үй.Оғани күніне жетпіс мың періште кіріп, құлшылық етеді)",
            "verse 52:5": "және биік көтерілген шатырмен",
            "verse 52:6": "және көтерілген теңізбен ант етемін",
            "verse 52:7": "Раббыңның жазасы азабы міндетті түрде түседі",
            "verse 52:8": "оны қайтарушы жоқ",
            "verse 52:9": "Ол күні аспан теңселіп шайқалады",
            "verse 52:10": "ал таулар қозғалып жылжиды",
            "verse 52:11": "Сол күні Аллаһты әрі Оның Елшісін өтірікке шығарушыларға үлкен қасірет болады",
            "verse 52:12": "сондай жалғанға сүңгіп, ермек етіп, ойнап жүргендерге",
            "verse 52:13": "Ол күні олар Жаһаннам отына күштеп итеріледі",
            "verse 52:14": "Оларға : «Міне, осы сендер өтірік санап келген От",
            "verse 52:15": "Ал, осы сиқыр ма екен, әлде сендер көрмей тұрсындар ма",
            "verse 52:16": "Оның ішінде жаныңдар! Енді шыдасаңдар да, не шыдамасаңдар да сендер үшін бірдей. Сендерге істеп өткен амалдарыңның қайтарымы ғана беріледі», делінеді",
            "verse 52:17": "Ақиқатында, тақуалар Аллаһтың жа­засынан қорқып, сақтанушылар Жәннаттағы бақтарда болып, игіліктерге бөленеді",
            "verse 52:18": "олар Раббысының өздеріне бергеніне қуанып, шат-шадыман болады. Әрі олардың Раббысы оларды Жахим азабынан сақтады",
            "verse 52:19": "Оларға: «Істеген амалдарың үшін рахаттанып жендер, ішіңдер!» делінеді",
            "verse 52:20": "Олар қатар тізілген көтеріңкі жайлы орындарда, сүйеніп отырады. Әрі Оларға көздері үлкен де әдемілерді хурларды қосамыз",
            "verse 52:21": "Әрі Біз өздері иманға келген және ұрпақтары да иманмен өздеріне ергендерді ұрпақтарымен қосамыз. Біз олардың амалдарынан еш нәрсені кемітпейміз. Әрбір адам өз жиғанының амалының тұтқыны",
            "verse 52:22": "Әрі, Біз оларға өздері қалаған жемістер мен еттерді ет тағамдарын қосамыз",
            "verse 52:23": "Ол жерде олар сусын толы кеселерді бір-біріне ұзатады, онда бос сөз сөйлеу де, күнә жасау да болмайды",
            "verse 52:24": "Оларға қабығы ашылмаған інжу секілді жасөспірімдер қызмет етеді",
            "verse 52:25": "Әрі олар бір-біріне қарап сұрасады",
            "verse 52:26": "Олар: «Негізінде, біз бұрын үй-ішімізбен болған кезімізде қатты қорқушы едік",
            "verse 52:27": "Аллаһ бізге игілік етті және бізді Самум (ыстық жел) азабынан сақтады",
            "verse 52:28": "Ақиқатында, біз бұрын Одан тілеуші едік. Анығында, Ол әл-Бәрр аса Игі , әр-Рахим ерекше Мейірімді »,- дейді",
            "verse 52:29": "Ей, Мұхаммед! Естеріне сал! СенРаббыңныңигілігі арқасындабақсы-балгер әрі жын қаққан да емессің",
            "verse 52:30": "Не болмаса олар: «Ол ақын. Біз оған заманның өзгеруін күтеміз», дейді",
            "verse 52:31": "Ей, Мұхаммед! Айт: «Күтіңдер, мен де сендермен бірге күтушілерденмін», деп",
            "verse 52:32": "Оларға ақылдары осыны бұйыра ма, әлде олар шектен шыққан адамдар ма",
            "verse 52:33": "Әлде олар: «Ол оны Құранды ойдан шығарды», дей ме? Жоқ, керісінше! Олар сенбейді",
            "verse 52:34": "Егер олар шын сөзді болса, осыған ұқсас Құран секілді хабар келтірсін",
            "verse 52:35": "Немесе олар еш нәрсесіз өздігінен жаратылды ма? әлде олар жаратушылар ма",
            "verse 52:36": "Не олар аспандар мен жерді жаратты ма? Жоқ! Олар нақты айқын сенбейді",
            "verse 52:37": "Немесе Раббыңның қазыналары оларда ма? Не олар басқарушылар ма",
            "verse 52:38": "Әлде олардың көтеріліп тыңдайтын сатылары бар ма? Онда олардың ішінен тыңдағаны анық бір дәлел келтірсін",
            "verse 52:39": "Немесе қыздар Аллаһтікі, ал ұлдар сендердікі ме",
            "verse 52:40": "Ей, Мұхаммед! әлде сен олардан ақы сұрап, содан олар борышқа қалып, соны ауырсынып жатыр ма",
            "verse 52:41": "Не оларда ғайыптың мәліметі бар болып, олар соны жаза ма",
            "verse 52:42": "Әлде олар айла-шарғы жасауды қалай ма? Ол айла-шарғыға сондай күпірлік етушілердің Аллаһқа қарсы шыққандардың өздері ілінеді",
            "verse 52:43": "Әлде олардың Аллаһтан өзге, басқа құдайы бар ма? Аллаһ олардың қосқан серіктерінен пәк",
            "verse 52:44": "Әрі олар егер аспанның бір бөлігінің құлап келе жатқанын көрсе де: «Бұл шоғырланған бұлт», дейді",
            "verse 52:45": "Ей, Мұхаммед! Енді оларды, өздерінің жойылатын қайта тірілу күніне жолыққандарына дейін жайына қалдыр",
            "verse 52:46": "Ол күні Оларға айла-шарғылары ешбір пайда бермейді әрі Оларға ешкім көмектеспейді",
            "verse 52:47": "Анығында, әділетсіздерге оған дейін де азап бар, бірақ олардың көбі білмейді",
            "verse 52:48": "Ей, Мұхаммед! Раббыңның үкімі келгенге дейін сабыр ет. Сөзсіз, сен Біздің көз алдымыздасың қорғауымыздасың . Әрі тұрған кезіңде Раббыңды мақтап, Оны барлық кемшіліктен пәк деп дәріпте",
            "verse 52:49": "Сондай-ақ, түннің бір бөлігінде және жұлдыздар көрінбей қалғанда да Оны барлық кемшіліктен пәк деп дәріпте"
        },
        "Korean": {
            "verse 52:1": "뚜르 산으로 맹세하사뚜르 산으로 맹세하사",
            "verse 52:2": "기록된 성서로 맹세하며기록된 성서로 맹세하며",
            "verse 52:3": "그것은 펼쳐진 양피지에 기록 된 것이라그것은 펼쳐진 양피지에 기록 된 것이라",
            "verse 52:4": "경배하기 위해 방문이 잦은 카으바 신전으로 맹세하며경배하기 위해 방문이 잦은 카으바 신전으로 맹세하며",
            "verse 52:5": "높은 하늘로 맹세하며높은 하늘로 맹세하며",
            "verse 52:6": "만조가 된 바다로 맹세하나니만조가 된 바다로 맹세하나니",
            "verse 52:7": "그대 주님의 벌은 반드시 내 릴 것이라그대 주님의 벌은 반드시 내 릴 것이라",
            "verse 52:8": "어느 누구도 그것을 피할 수 없노라어느 누구도 그것을 피할 수 없노라",
            "verse 52:9": "하늘이 진동하는 날하늘이 진동하는 날",
            "verse 52:10": "그리고 산들이 휘날리는 날그리고 산들이 휘날리는 날",
            "verse 52:11": "그날을 거역한 자들에게 재 앙이 있을 것이라그날을 거역한 자들에게 재 앙이 있을 것이라",
            "verse 52:12": "그들은 허위에 몰두한 자들로그들은 허위에 몰두한 자들로",
            "verse 52:13": "그날에 소리치며 불지윽으로 끌려가니그날에 소리치며 불지윽으로 끌려가니",
            "verse 52:14": "이것이 바로 너희가 거역했 던 불지옥이라 말하여 지더라이것이 바로 너희가 거역했 던 불지옥이라 말하여 지더라",
            "verse 52:15": "이것도 마술이뇨 아니면 너 희가 보지를 못하느뇨이것도 마술이뇨 아니면 너 희가 보지를 못하느뇨",
            "verse 52:16": "그곳으로 들어가 맛보라 너희가 그것을 인내하던 또는 인내 하지 못하던 그것은 너희 행위에 대한 보상이라그곳으로 들어가 맛보라 너희가 그것을 인내하던 또는 인내 하지 못하던 그것은 너희 행위에 대한 보상이라",
            "verse 52:17": "그러나 의로운 자들은 은혜 의 천국으로 들어가그러나 의로운 자들은 은혜 의 천국으로 들어가",
            "verse 52:18": "주님께서 그들에게 베풀 축 복을 만끽하고 또한 그들의 주님 은 불지옥의 응벌로부터 그들을 보호하여 주시노라주님께서 그들에게 베풀 축 복을 만끽하고 또한 그들의 주님 은 불지옥의 응벌로부터 그들을 보호하여 주시노라",
            "verse 52:19": "유익하고 즐거이 먹고 마시 라 너희의 행위에 대한 결과라는 말씀이 있으리라유익하고 즐거이 먹고 마시 라 너희의 행위에 대한 결과라는 말씀이 있으리라",
            "verse 52:20": "그들이 침상에 줄지어 기대 니 하나님은 그들에게 눈이 큰 아름다운 배우자를 앉게 하시더라그들이 침상에 줄지어 기대 니 하나님은 그들에게 눈이 큰 아름다운 배우자를 앉게 하시더라",
            "verse 52:21": "믿음을 가진 자와 그들을 따라 믿음을 가진 후손들이 있나니 하나님은 후손들을 그들과 함께 결합시켜 주리라 또한 하나님은 그들이 행한 것들을 감하지 않을 것이라 모든 인간은 그가 행한 것에 대한 책임이 있노라믿음을 가진 자와 그들을 따라 믿음을 가진 후손들이 있나니 하나님은 후손들을 그들과 함께 결합시켜 주리라 또한 하나님은 그들이 행한 것들을 감하지 않을 것이라 모든 인간은 그가 행한 것에 대한 책임이 있노라",
            "verse 52:22": "하나님은 그들이 원하는 과 실과 육류를 부여하니하나님은 그들이 원하는 과 실과 육류를 부여하니",
            "verse 52:23": "그들은 서로가 서로에게 해 악이 없는 잔을 주고 받을 때그들은 서로가 서로에게 해 악이 없는 잔을 주고 받을 때",
            "verse 52:24": "진주처럼 잘 보관된 소년이 그들 주위를 돌며 시중들도다진주처럼 잘 보관된 소년이 그들 주위를 돌며 시중들도다",
            "verse 52:25": "그들은 서로가 서로에게 다 가서며 안부를 물으매그들은 서로가 서로에게 다 가서며 안부를 물으매",
            "verse 52:26": "실로 저희는 현세에서 우리 백성들로 인하여 두려워 했나이다라고 대답들 하니라실로 저희는 현세에서 우리 백성들로 인하여 두려워 했나이다라고 대답들 하니라",
            "verse 52:27": "그러나 하나님은 우리에게 은혜를 베푸사 작열하는 열풍의 벌로부터 우리를 구하여 주셨노라그러나 하나님은 우리에게 은혜를 베푸사 작열하는 열풍의 벌로부터 우리를 구하여 주셨노라",
            "verse 52:28": "실로 우리는 이전에 하나님 께 구원하였으매 그분은 은헤와 자비로 충만하시니라실로 우리는 이전에 하나님 께 구원하였으매 그분은 은헤와 자비로 충만하시니라",
            "verse 52:29": "그러므로 훈계하라 그대는 주님의 은혜를 받은 자로 점장이도 아니며 미친자도 아니라그러므로 훈계하라 그대는 주님의 은혜를 받은 자로 점장이도 아니며 미친자도 아니라",
            "verse 52:30": "아니면 시인이여 시간이 흐 름에 따라 그에게 어떤 재앙이 내 릴 것이라고 그들이 말하더뇨아니면 시인이여 시간이 흐 름에 따라 그에게 어떤 재앙이 내 릴 것이라고 그들이 말하더뇨",
            "verse 52:31": "일러가로되 너희가 기다리라 나도 역시 너희와 함께 기다리노라일러가로되 너희가 기다리라 나도 역시 너희와 함께 기다리노라",
            "verse 52:32": "그들의 이성이 이것을 종용한단 말이뇨 아니면 그들이 사악 한 백성들이뇨그들의 이성이 이것을 종용한단 말이뇨 아니면 그들이 사악 한 백성들이뇨",
            "verse 52:33": "아니면 그가 그 메세지를 위조하였다 그들이 말하느뇨 그렇 지 않노라 그들이 믿음을 거역할 뿐이라아니면 그가 그 메세지를 위조하였다 그들이 말하느뇨 그렇 지 않노라 그들이 믿음을 거역할 뿐이라",
            "verse 52:34": "그들이 사실이라면 그와 같 은 말씀을 그들로 하여금 이르게 하라그들이 사실이라면 그와 같 은 말씀을 그들로 하여금 이르게 하라",
            "verse 52:35": "그들은 스스로 창조되었느뇨아니면 그들 스스로가 조물주이더뇨그들은 스스로 창조되었느뇨아니면 그들 스스로가 조물주이더뇨",
            "verse 52:36": "아니면 그들이 하늘과 대지 를 창조하였다 하더뇨 그렇지 아 니하니 그들에게는 확고한 믿음이 없을 뿐이라아니면 그들이 하늘과 대지 를 창조하였다 하더뇨 그렇지 아 니하니 그들에게는 확고한 믿음이 없을 뿐이라",
            "verse 52:37": "주님의 보물이 그들에게 있 다 하더뇨 아니면 그들애게 절대 적 권능이 있다고 하더뇨주님의 보물이 그들에게 있 다 하더뇨 아니면 그들애게 절대 적 권능이 있다고 하더뇨",
            "verse 52:38": "아니면 그들이 하늘에 올라 비밀을 들을 사다리라도 가지고 있느뇨 그렇다면 그 비밀을 들었 던 자로 하여금 명백한 증거를 입증하라아니면 그들이 하늘에 올라 비밀을 들을 사다리라도 가지고 있느뇨 그렇다면 그 비밀을 들었 던 자로 하여금 명백한 증거를 입증하라",
            "verse 52:39": "너희는 아들이 있는데 하나 님은 딸들만 있다는 것이뇨너희는 아들이 있는데 하나 님은 딸들만 있다는 것이뇨",
            "verse 52:40": "그대가 그들에게 보상을 요구하여 그들이 부채로 무거운 짐 을 지게 되었단 말이뇨그대가 그들에게 보상을 요구하여 그들이 부채로 무거운 짐 을 지게 되었단 말이뇨",
            "verse 52:41": "아니면 그들에게 보이지 않 는 것이 있어 그것을 기록하고 있느뇨아니면 그들에게 보이지 않 는 것이 있어 그것을 기록하고 있느뇨",
            "verse 52:42": "아니면 그들이 그대에 대하 여 음모를 꾸미느뇨 하나님께 도 전하는 자 스스로 그 음모에 빠지게 되노라아니면 그들이 그대에 대하 여 음모를 꾸미느뇨 하나님께 도 전하는 자 스스로 그 음모에 빠지게 되노라",
            "verse 52:43": "아니면 그들에게는 하나님 아닌 다른 신이 있다 하더뇨 그들이 숭배하는 모든 것 위에 계시는하나님이여 흘로 영광 받으소서아니면 그들에게는 하나님 아닌 다른 신이 있다 하더뇨 그들이 숭배하는 모든 것 위에 계시는하나님이여 흘로 영광 받으소서",
            "verse 52:44": "그들은 그들 위에 떨어지는 하늘의 조각을 보고서도 이것은 구름덩어리라고 그들은 말할 것이라그들은 그들 위에 떨어지는 하늘의 조각을 보고서도 이것은 구름덩어리라고 그들은 말할 것이라",
            "verse 52:45": "그러므로 그들이 공포로 쓰 러지는 그날을 맞이할 때까지 그 들을 버려두라그러므로 그들이 공포로 쓰 러지는 그날을 맞이할 때까지 그 들을 버려두라",
            "verse 52:46": "그날이 되매 그들의 음모는 그들을 유용케 하지 못하고 구원 도 받지 못하노라그날이 되매 그들의 음모는 그들을 유용케 하지 못하고 구원 도 받지 못하노라",
            "verse 52:47": "실로 죄악을 저지른 자들에 게는 그것 외에도 또 다른 벌이 있을 것이라 그러나 그들 대다수 는 알지 못하더라실로 죄악을 저지른 자들에 게는 그것 외에도 또 다른 벌이 있을 것이라 그러나 그들 대다수 는 알지 못하더라",
            "verse 52:48": "그러므로 인내하며 그대 주 님의 심판을 기다리라 실로 그대 는 하나님이 그대를 보호하고 있 노라 그리고 네가 일어설 때 그대주님을 찬미하라그러므로 인내하며 그대 주 님의 심판을 기다리라 실로 그대 는 하나님이 그대를 보호하고 있 노라 그리고 네가 일어설 때 그대주님을 찬미하라",
            "verse 52:49": "밤중에도 그리고 별들이 질 때에도 하나님을 찬미하라밤중에도 그리고 별들이 질 때에도 하나님을 찬미하라"
        },
        "Kurdish": {
            "verse 52:1": "Bi çiyayê Tûrêسوێند به‌کێوی _ طور _ (که‌خوای گه‌وره‌گفتوگۆی له‌گه‌ڵ موسادا له نزیکی ئه‌نجامدا).",
            "verse 52:2": "Û kitêba rêz bi rêz nivsandîسوێند به‌کتێبی نوسراو که (لوح المحفوظه‌).",
            "verse 52:3": "Di pelê raxistî deکه‌له‌لاپه‌ڕه‌ی ته‌نگی گرنگدایه‌",
            "verse 52:4": "Û mala avakirî: سوێند _ به‌که‌عبه‌_ که‌هه‌میشه ئاوه‌دانه به نوێژكه‌ران، وه (ئه‌وانه‌ی بۆ حه‌ج و عه‌مره‌ده‌چن) هه‌روه‌ها (بیت المعمور) شوێنێکه له‌ئاسمانی حه‌وته‌م که‌دیاریکراوه بۆ خواپه‌رستی فریشته‌کان هه‌روه‌ک چۆن که‌عبه پیرۆزه لای ئیمانداران، (له‌فه‌رموده‌یه‌کی ڕاست و دروستدا ئاماژه‌ی بۆ کراوه‌).",
            "verse 52:5": "Û banê bilindkirîهه‌روه‌ها سوێند به‌سه‌قفی به‌رزو بڵند (که‌ئاسمان ده‌گرێته‌وه‌، خوای گه‌وره‌ده‌یه‌وێت سه‌رنجمان ڕاکێشێت بۆ لای).",
            "verse 52:6": "Û deryaya bi agir tijîkirîسوێند به‌ده‌ریای پڕ له‌ئاو یان ده‌ریای داگیرساو (که‌قیامه‌ت داده‌گرسێت و ده‌ته‌قێته‌وه‌).",
            "verse 52:7": "Bêguman ezabê perwerdekarê te wê hey were(په‌روه‌ردگاری مه‌زن سوێند به‌و هه‌موو شتانه‌ده‌خوات، ئینجا ده‌فه‌رموێت): به‌ڕاستی سزاو ئازاری په‌روه‌ردگاری تۆ ئه‌ی محمد (صلی الله علیه وسلم) هه‌ر پێش دێت.",
            "verse 52:8": "Tu kes nikare nehêleکه‌سیش ناتوانێت به‌ری بگرێت و ده‌ستی پێوه بنێت و نه‌هێڵێت.",
            "verse 52:9": "Roja ku asîman bi hejek zor dizivireئه‌و ڕۆژه ئه‌ستێره وهه‌سه‌ره‌کانی ئاسمان هه‌موو به‌یه‌کدا ده‌ده‌ن، (خوای گه‌وره‌تێکیان ده‌دات وهه‌ڵیان ده‌وه‌شێنێت)",
            "verse 52:10": "Û çiya bi meþek dijwar diçeکێوه‌کانیش له‌جێی خۆیان ده‌جوڵێن و ده‌ڕۆن، (وه‌ک خۆری، وه‌ک هه‌ور، زه‌ویان پێ ته‌خت ده‌کرێت).",
            "verse 52:11": "Edî wêrojê xulî li serê ên diderewînin beکه‌واته واوه‌یلا و هاوار بۆ ئه‌وانه‌ی که‌باوه‌ڕیان به‌حه‌ق و ڕاستی نه‌کرد و به‌درۆیان ده‌زانی له‌و ڕۆژه‌دا.",
            "verse 52:12": "Ewên ku di (qeþmeriyan) de noq bûne dileyizinئه‌وانه‌ی که‌رۆچووه و گاڵته ده‌که‌ن به‌ئیسلام و پێغه‌مبه‌ر و قورئان.",
            "verse 52:13": "Roja ku bal agirê dojehê ve bi zorê têne qewirandinرۆژێک دێت به‌توندی پاڵیان پێوه ده‌نرێت بۆ ناو دۆزه‌خ (ده‌نگ له‌سینه‌وه‌یانه‌وه دێت ئه‌وه‌نده‌پاڵه‌که تونده‌).",
            "verse 52:14": "(Ji wan re tê gotin ku:) \"Agirê ku we wî diderewand evê hayeپێیان ده‌وترێت ئه‌مه‌ئه‌و ئاگرو دۆزه‌خه‌یه که‌کاتی خۆی بڕواتان پێی نه‌بوو به‌گاڵته‌تان گرتبوو",
            "verse 52:15": "Vêca ma evê han efsûn e yan hûn nabîninباشه‌، ئه‌مه‌جادووه‌نیشانتان ده‌درێت یان ئێوه ڕاستی نابینن؟!",
            "verse 52:16": "Hûn têkevinê-biþewitin. Êdî we divê hewî bînin yan hewî neynin, ji we re yek e. Lewra bêguman hûn tenê bi tiþtê we dikir têne celat kirinده‌بێت بچنه‌ناوی و سزا بچێژن، جا ئیتر خۆڕاده‌گرن یان خۆڕاناگرن وه‌ک یه‌که بۆتان، بێگومان یان خۆڕاناگرن وه‌ک یه‌که بۆتان، بێگومان تۆڵه‌ی ئه‌و کاروکرده‌وانه‌تان هه‌ر ده‌درێته‌وه که‌ده‌تانکرد.",
            "verse 52:17": "Bêguman xweparêz di bihiþt û xweþiyan de neله‌ولاشه‌وه‌به‌ڕاستی ئه‌وانه‌ی که‌له‌دنیادا خواناس و دینداربوون، له‌باخه‌کانی به‌هه‌شت و ناز و نیعمه‌تدا، ژیانی پڕ له‌به‌ختیاری و کامه‌رانی ده‌به‌نه‌سه‌ر.",
            "verse 52:18": "Ew bi tiþtê perwerdekarê wan daye wan dilþa ne. Perwerdekarê wan, wan ji ezabê dojehê parastiyeزۆر که‌یف خۆش و دڵخۆش و ڕووخۆشن به‌و به‌خششانه‌ی که په‌روه‌ردگاریان پێی به‌خشیون، هه‌ر په‌روه‌ردیگاریشیان له‌سزاو تاڵاوی دۆزه‌خ پاڕاستونی.",
            "verse 52:19": "(Ji wan re tê gotin ku:) \"Hûn ji ber tiþtê we kiriye di noþîcanî bixwin û vexwinپێیان ده‌وترێت بخۆن و بخۆنه‌وه نۆشی گیانتان بێت له‌پاداشتی کرده‌وه‌ی چاک و ڕێک و پێکتاندا",
            "verse 52:20": "Ew li ser textê rêz bi rêz kirî paldayî ne. Me wan bi horiyê çavbelek re kiriye cot-zewicandiyeئه‌و به‌خته‌وه‌رانه‌به‌که‌ماڵی ئیسراحه‌ت) پاڵیان داوه‌ته‌وه‌له‌سه‌ر کورسی و قه‌نه‌فه‌رازاوه‌کان، که‌به‌شێوه‌یه‌کی جوان و ڕێک ڕیز کراون، ئێمه هاوسه‌رانی حۆری چاوگه‌شه‌مان لێ ماره‌کردوون",
            "verse 52:21": "Ewên bawerî anîne û nivþa wan bi bawerî dane pey wan, me nivþa wan bi wan gihandiye. Me tu tiþt ji kirinê wan ji wan re kên nekiriye. Her kes bi keda xwe gerew eجا ئه‌وانه‌ی باوه‌ڕیان هێناوه و نه‌وه‌کانیشیان به‌ئیمان و باوه‌ڕه‌وه شوێنیان که‌وتوون، ئه‌وانه‌له‌به‌هه‌شتدا پێک شاد ده‌که‌ینه‌وه (تا کامه‌رانی و خۆشییان زیاتر بێت)، وه‌نه‌بێت ئه‌وانه‌ی که‌پله‌ی به‌رزیان ده‌ستکه‌وتووه‌دایان به‌زێنین بۆ پله‌ی نزمتر، چونکه‌ئێمه پاداشتی کرده‌وه‌ی که‌س که‌م ناکه‌ینه‌وه (ئه‌گه‌ر زیادی نه‌که‌ین) له‌هه‌مان کاتدا هه‌رکه‌سه‌بارمته‌ی کرده‌وه‌ی خۆیه‌تی",
            "verse 52:22": "Û me, ji tiþtê dilê wan diçê pirr fêkî û goþt da wanبه‌رده‌وام حه‌زیان له‌هه‌ر میوه و گۆشتێک بێت پێشکه‌شیان ده‌که‌ین",
            "verse 52:23": "Ew tê de kasikê meyê dirêjî hevûdin dikin ku tê de ne serxweþî heye û ne jî gunehبه‌دڵ خۆشیه‌وه له‌کاسی تایبه‌تیدا شه‌راب ده‌نۆشن، جار جار بۆ خۆشی له‌یه‌کتری ده‌سێنن، دوور له‌ره‌فتاری ناشیرین و گوناهو تاوانبارکردنی یه‌کتر",
            "verse 52:24": "Ji wan re hin zarû (xulam) hene ku li ber (destê) wan digerin, ew her wekî moriyê parastî neهه‌روه‌ها منداڵانی جوان و ئێسک سووک به‌ده‌وریاندا دێن و خزمه‌تیان ده‌که‌ن ده‌ڵێی مرواری پاک و بێگه‌ردن",
            "verse 52:25": "Hin ji wan li hina zivirîn ji hevdû pirsîn(جا دوای ئه‌و عه‌یش و نۆش و که‌یف و ئاهه‌نگه‌) ڕووده‌که‌نه‌یه‌کترو ده‌سته‌ده‌سته‌له‌یه‌ک نزیک ده‌بنه‌وه‌، پرسیار له‌رابوردوی یه‌کتر ده‌که‌ن (دیاره هه‌رکه‌سه‌له‌و به‌یه‌کگه‌یشتنانه‌دا به‌شێک له‌سه‌رگوزه‌شته‌ی خۆی نیشانی ئیماندارانی هاوه‌ڵ و میوانی ده‌دات، له‌گه‌ڵ ڕوونکردنه‌وه‌ی پێویستدا، که‌به‌ده‌زگای زۆر پێشکه‌وتوو تۆمارکراوه‌)",
            "verse 52:26": "Gotin ku: \"Bêguman em berê di nav maliyên xwe de dilbitirs-dilovîn bûnسه‌ره‌نجام هه‌موو به‌یه‌ک ده‌نگ ده‌ڵێن: به‌ڕاستی (کارێکی چاکمان ده‌کرد سوپاس بۆ خوا) چونکه‌کاتی خۆی که‌له‌ناو ماڵ و خێزانماندا بووین، ترسی لێپرسینه‌وه‌ی ڕۆژی قیامه‌تمان هه‌بوو، هه‌روه‌ها به‌به‌زه‌ییش بووین له‌ناویاندا و مه‌به‌ستمان بوو ئه‌وانیش وه‌ک ئێمه خواناس بن",
            "verse 52:27": "Vêca Xuda bi me qencî kir û me ji ezabê dojehê parastبه‌هۆی ئه‌وه‌وه‌خوای میهره‌بانیش لای ڕه‌حمه‌تی لێ کردینه‌وه و منه‌تباری کردین و له‌سزای دۆزه‌خی پڕئێش پاڕاستینی",
            "verse 52:28": "Bêguman me berê jî wî diheband. Bêguman ew, qencê dilovan her ew eبه‌ڕاستی ئێمه کاتی خۆی هاناو هاوارمان هه‌ر بۆ ئه‌و ده‌بردو ده‌مانپه‌رست، چونکه‌بێگومان هه‌ر ئه‌و زاته‌خوایه‌کی چاکه‌خوازو میهره‌بان و دلۆڤانه‌",
            "verse 52:29": "Vêca tu bi bîr xinê-þîreta bike; êdî tu bi qenciya perwerdekarê xwe ne penhango yî û ne jî dîn îئه‌ی محمد (صلی الله علیه وسلم) ئامۆژگاری ئه‌وخه‌ڵکه بکه‌، چونکه‌به‌هۆی نازو نیعمه‌تی په‌روه‌ردگارته‌وه‌نه‌فاڵچیت، نه‌شێتی",
            "verse 52:30": "Yan qey ew dibêjin ku: \"Ew þair e (helbestvan e). Em li bendê ne êþa mirinê pê de wereخوانه‌ناس و دڵڕه‌قه‌کان ده‌ڵێن: ئه‌مه‌شاعیرێکه و چاوه‌ڕوانی مه‌رگی ده‌که‌ین!!",
            "verse 52:31": "Tu bêje ku: \"Hûn li bendê bin. Vêca bêguman ez jî bi we re ji bendewaran imپێیان بڵێ: چاوه‌ڕێ بن منیش له‌گه‌ڵ ئێوه‌دا چاوه‌ڕێم (بزانین سه‌رئه‌نجام کێ سه‌رده‌که‌وێت، کێ سه‌رفرازه‌؟)",
            "verse 52:32": "Yan qey hiþê wan ên çewt bi vî fermana wan dike yan ew komelekî serkêþ inئایا پیاوه ژیره‌کانیان پێیان ده‌ڵێت: ئه‌و قسه‌ناڕه‌وایانه بکه‌ن، نه‌خێر ئه‌مانه‌هه‌ر خۆیان که‌سانێکی سته‌مکارن؟",
            "verse 52:33": "Yan ew dibêjin ku; \"Wî (Qur´anê) ji ber xwe ve gotiye?\" Ne, ew bawerî nayininیان ده‌ڵێن: ئه‌م قورئانه‌خۆی هه‌ڵیبه‌ستووه‌و دایڕشتووه‌، نه‌خێر ئه‌وانه‌، هه‌ر ئیمان و باوه‌ڕیان نیه (ئه‌گینا چۆن وا ده‌ڵێن).",
            "verse 52:34": "Eger ew bera rastgo ne vêca ka bira ew peyvekî wekî wê bînin(ده‌ی که‌واته‌خۆ ئه‌وانیش قسه‌زان و لێزانن) ده‌با فه‌رمایشتێکی ئاوا وه‌ک ئه‌م قورئانه‌بهێنن ئه‌گه‌ر ڕاست ده‌که‌ن؟!",
            "verse 52:35": "Yan ew, ne ji tiþtekî hatine aferandinê yan ew bi xwe aferandekar inئایا ئه‌وانه‌به‌بێ هیچ شتێک، هیچ هۆیه‌ک، هاتوونه‌ته‌کایه‌وه؟! یان هه‌ر خۆیان دروستکارن؟!",
            "verse 52:36": "Yan qey wan asîmana û zemîn aferandiye? Ne, ew ji dil pê bawerî nayininیان ئه‌و بێ باوه‌ڕانه ئاسمانه‌کان و زه‌ویان دروستکردووه‌؟ نه‌خێر ئه‌وانه‌هه‌ر دڵنیا نابن",
            "verse 52:37": "Yan qey xezîne perwerdekarê te li cem wan in? Yan ew xwedanê serdest inیان ئه‌وه‌یه گه‌نجینه‌ی ڕزق و ڕۆزیه‌کانی په‌روه‌ردگاری تۆیان به‌ده‌سته‌؟! یان ئه‌وه‌یه ده‌سه‌ڵاتیان بێ سنووره‌؟ (تا ئاوا بوێرن له‌خوا یاخی بن؟)",
            "verse 52:38": "Yan qey ji wan re pêplûk hene ku pê (bilind dibin) gohdarî dikin? Vêca bira gohdarê wan delîlek xuya bîneیان ئه‌وانه‌په‌یژه‌یان هه‌یه‌و پیایدا سه‌رده‌که‌ون، تا گوێ له‌نهێنیه‌کانی ئاسمان بگرن؟! ده‌با گوێگره‌کانیان به‌ڵگه‌یه‌کی ئاشکرا په‌یدا بکه‌ن (ئه‌وسا مله‌جه‌ڕی بکه‌ن).",
            "verse 52:39": "Yan qey jê re keç û ji we re kur heneئایا ئه‌وه‌ڕاسته‌که‌کچان، نه‌وه‌ی خوابن و کوڕانیش نه‌وه‌ی ئێوه؟! (به‌مه‌رجێک خۆیان له‌کچان بێزاربوون، به‌ڵام بۆ خوا به‌ره‌وایان بینیوه؟!).",
            "verse 52:40": "Yan qey tu destmuzekî ji wan dixwazî, vêca ku ew ji deyndariyê bargiran bûneیان ئه‌وه‌یه داوای کرێ و پاره‌یان لێ ده‌که‌یت، تا بارێکی گران بده‌ی به‌کۆڵیانداو پێیان هه‌ڵنه‌سوڕێت!!",
            "verse 52:41": "Yan qey (zanîna) penhanî li cem wan e vêca ew dinivsîninیان ئه‌وه‌یه که‌نهێنی و شاراوه‌کان لای ئه‌وانه‌و، ئه‌وان یاداشتی خه‌ڵکی ده‌نووسن، (یان ئه‌وان بڕیاری به‌سه‌رهاته‌کان ده‌ده‌ن)؟!",
            "verse 52:42": "Yan ew dixwazin xax û dafekî bikin? Vêca ên kafir bûne her ew bi xax û daf inیان ئه‌وانه‌ده‌یانه‌وێت پیلان و ته‌ڵه‌یه‌ک ڕێک بخه‌ن (دژی پێغه‌مبه‌ر و ئیمانداران، به‌ڵام خه‌یاڵیان خاوه‌) ئه‌وانه‌ی که‌کافروخوانه‌ناسن هه‌ر خۆیان که‌وتوونه‌ته‌ناو پیلانه‌وه و بون به‌ته‌ڵه‌ی خۆیانه‌وه‌، پیلانه‌کانیان به‌سه‌ر خۆیاندا شکاوه‌ته‌وه‌.",
            "verse 52:43": "Yan qey ji wan re bêyî Xuda Xudakî (dim) heye? Xuda ji tiþtê ew dikin þirîk pak bêrî yeیان ئه‌وانه‌وابیرده‌که‌نه‌وه که‌خوایه‌کی تریان جگه‌له (الله) هه‌یه؟! پاکی و بێگه‌ردی بۆ خوا (له‌بیروباوه‌ڕی چه‌وتیان)، له‌و شتانه‌ی که‌ئه‌وان ده‌یکه‌نه هاوه‌ڵ بۆ خوا.",
            "verse 52:44": "Eger ew bibînin ku ji asîman perçekî dikeve wê bêjin ku: \"Ew ewrekî li ser hev dewisandî yeخۆ ئه‌گه‌ر (له‌ئه‌نجامی لادان و بیروباوه‌ڕی چه‌وتیان و کاری نادروستیان خوای گه‌وره‌سزایه‌کیان بۆ بنێرێت) و پارچه (ئه‌ستێره‌یه‌کیان) تێ بگرێت و ڕوو به‌زه‌وی دابه‌زێت ئه‌و نه‌فامانه‌ده‌ڵێن: هیچ نیه!! په‌ڵه هه‌وره‌و نیشتۆته سه‌ریه‌ک!!",
            "verse 52:45": "Vêca tu dev ji wan berde heya ew rastî roja xwe ya ku ew tê de behîþ bikevin-bimirin, tênوازیان لێ بهێنه هه‌تا به‌و ڕۆژه ده‌گه‌ن که‌تایدا تیاده‌چن و لاڵ و پاڵ ده‌که‌ون",
            "verse 52:46": "Roja ku ne xax û dafê wan bi tiþtî bikêra wan tê û ne jî ew têne yarî kirinئه‌و ڕۆژه ئیتر فێڵ و ته‌ڵه‌که‌یان به‌هیچ جۆرێک فریایان ناکه‌وێت و سه‌رکه‌وتوو سه‌رفراز نابن",
            "verse 52:47": "Û bêguman ji ên sitemkarî kirine re berî vê (rojê) ezabek heye lê belê pirrî wan nizaninبێگومان بۆ ئه‌وانه‌ی که‌سته‌میان کردووه‌سزای تریش هه‌یه بێجگه له‌وه‌ی که‌جار جار بۆیان پێش دێت پێش تیاچوونی یه‌کجاری، به‌ڵام زۆربه‌یان نافامن و نازانن (هه‌ست به‌ده‌ستی قه‌ده‌ر ناکه‌ن له‌رووداوه‌کاندا)",
            "verse 52:48": "Tu ji hukmê perwerdekarê xwe re hewî bike. Êdî bêguman tu li ber çavê me yî, û tu dema rabû yî bi pesn û sipasê perwerdekarê xwe wî (ji her kêmasiyî) pak bêrî bidêreئه‌ی پێغه‌مبه‌ر (چلی الله علیه وسلم) خۆگربه له‌به‌رامبه‌ر به‌جێهێنانی فه‌رمانی په‌روه‌ردگارته‌وه‌، دڵنیابه که‌تۆ له‌ژێر چاودێری ئێمه‌دایت، هه‌روه‌ها ته‌سبیحات و ستایش و سوپاسگوزاری په‌روه‌ردگارت بكه‌کاتێک که‌به‌ره‌به‌یان هه‌ڵده‌سێت",
            "verse 52:49": "Û hinek ji þevê û piþtî çûna sitêrkan wî pak bêrî bidêre-limej keله‌شه‌وگاریشدا هه‌ر بیپه‌رسته و ستایشی بکه‌، هه‌روه‌ها کاتێک ئه‌ستێره‌کان ون ده‌بن له‌چاو دیار نامێنن"
        },
        "Kyrgyz": {
            "verse 52:1": "Тур? тоосуна ант",
            "verse 52:2": "Жана жазылган Китепке? ант",
            "verse 52:3": "Анык-ачык сахипанын (барактын) жүзүнө",
            "verse 52:4": "Жана Абад Үйгө* ант",
            "verse 52:5": "Жана бийик тамга (асманга) ант",
            "verse 52:6": "Жаңы толуп-ташкан деңизге ант",
            "verse 52:7": "(О,Мухаммад) Раббиңдин азабы, албетте болуучу",
            "verse 52:8": "Аны (эч бир) кайтаруучу жок",
            "verse 52:9": "Ал Күндө (Кыяматта) асман катуу титирейт",
            "verse 52:10": "Жана тоолор (мейкиндикте учуп) жүрөт",
            "verse 52:11": "Ал күнү жалганчыларга өлүм болсун",
            "verse 52:12": "Алар (өз жалгандарында) чумкуп ойногон эле",
            "verse 52:13": "Ал күнү алар тозок отуна түртүп киргизилет (анан аларга айтылат)",
            "verse 52:14": "«Силер жалганга чыгарган тозок — ушул",
            "verse 52:15": "Эмне, бул сыйкыр бекен! Же силер көрбөй жатасыңарбы",
            "verse 52:16": "Ага киргиле! Чыдайсыңарбы, чыдабайсыңарбы, силерге баары бир! Силер, аныгында жасаган ишиңердин гана жазасын аласыңар!»",
            "verse 52:17": "Ал эми, (Раббисинен) корккон кишилер Бейиштердин жана нээматтардын ичинде",
            "verse 52:18": "Раббилери берген нээматтардан жыргаган абалда. Жана аларды Раббилери тозок азабынан сактайт",
            "verse 52:19": "(Аларга) «(Сооптуу) иш кылганыңар үчүн (каалаган нерсеңерден) жегиле жана ичкиле, аш болсун!» (деп айтылат)",
            "verse 52:20": "(Алар бейиштеги дарыялардын жээгинде) катар тизилген сөрүлөрдүн! үстүндө жамбаштап жатышат. Биз аларды бакыраң көз «үр» кыздарга үйлөнтүп койобуз",
            "verse 52:21": "Ал эми, ыйман келтирип, урпактары дагы (аларды) ыйман менен ээрчиген адамдарга (Бейиште) урпактарын кошобуз. Бирок, алардын (бабалардын) амалдарынан эч нерсе кемитилбейт. Ар бир адам өз ишинин туткуну",
            "verse 52:22": "Жана Биз аларды (ар түрдүү) мөмөлөр ошондой эле, каалагандай куш эттери менен ырахаттандырабыз",
            "verse 52:23": "Алар анда (Бейиште шарап толтурулган) чөйчөктөрдү бири-бирине сунушат. Ал шарапта(н) алжыгандык да болбойт, күнөө иштер да болбойт",
            "verse 52:24": "Аларды(н кызматында седептин ичине) катылган бермет сыяктуу жаш (сулуу) жигиттер айланчыктап турушат",
            "verse 52:25": "Жана (Бейиштегилер) бири-бирине бет маңдай (отуруп) суроо-жооп менен кайрылышты",
            "verse 52:26": "(Жана мындай) дешти: «Биз илгери (дүйнөдөгү жашообузда) өз элибиздин арасында (Аллаһ Тааладан) коркуучулар элек",
            "verse 52:27": "Анан бизге Аллаһ (Ислам менен) жакшылык кылды. Жана бизди тозок азабынан сактап калды",
            "verse 52:28": "Биз мурда ага (ыклас) дуба кылчу элек. Чынында ал жакшылык кылуучу, Ырайымдуу",
            "verse 52:29": "(О, Мухаммад! Үммөтүңө) эскерткин! Сен Раббиңдин нээматы себептүү бакшы (көзү ачык) да эмессиң, жинди да эмессиң",
            "verse 52:30": "Же болбосо, алар (мушриктер: «Бул) акын. Анын өлүмүн күтө туралы»- дешеби",
            "verse 52:31": "Айткын: «Күтө бергиле. Мен да силерге кошулуп (Аллаһ силерге азаб берүүсүн) күтөмүн»",
            "verse 52:32": "Же болбосо алардын «акылдары» ушуга (Куранды жалганга чыгарууга) буюрабы?! Же алар чектен чыккан элби",
            "verse 52:33": "Же болбосо, «(Мухаммад) аны (Кураанды) оюнан чыгарып сүйлөгөн»-дешеби? Жок! Алар ыйман келтиришпейт",
            "verse 52:34": "Эгер («Кураанды инсан ойлоп чыгарган» деген сөздөрүндө) чынчыл болушса, ага окшогон бир гана сөз алып келишсин",
            "verse 52:35": "Же болбосо, алар эч нерсесиз (жаратуучусу жок эле) жаралып калышканбы? Же өздөрү жаратуучубу",
            "verse 52:36": "Же болбосо, асмандар менен жерди алар жаратышты беле? Жок! Алар ишенбейт",
            "verse 52:37": "Же болбосо, Раббиңдин казына-мүлкү алардын колундабы? Же алар (ошол казына-мүлккө) кожоюнбу",
            "verse 52:38": "Же болбосо, алардын колунда аны менен (асмандагы кайып кабарларды) уга турган шатысы барбы? (Эгер бар болсо) анык далил менен, уккан кишисин алып келишсин",
            "verse 52:39": "Же болбосо, Ага (Аллаһ Таалага) кыз перзенттер, өздөрүнө уул перзенттерби",
            "verse 52:40": "Же болбосо, Сен алардан (дин үйрөткөнүң үчүн) акы сурап жатасыңбы? (Анан) Алар (ошол акыны) төлөөдөн кыйналып калышканбы",
            "verse 52:41": "Же болбосо, алардын алдында кайып (илими) бар бекен жана алар аны жазып алышыптырбы",
            "verse 52:42": "Же болбосо, алар (сага каршы бир) амалкөйлүк ойлоп жатышкандыр! Каапырлардын амалдары өздөрүнө зыян болуп кайтат",
            "verse 52:43": "Же болбосо, алардын Аллаһтан башка кудайлары барбы? (Жок!) Аллаһ алар кошкон ширктен Таза",
            "verse 52:44": "Эгер алар асмандан (өздөрүнүн башына) түшүп келе жаткан (балээнин) бир бөлүгүн көрсө да, (анын балээ экенин ойлоп да койбостон) «бул түрмөктөлгөн булут» дешет",
            "verse 52:45": "(О, Мухаммад!) Сен аларды кыйрап калчу күндөрүнө (Кыяматка) жолукканга чейин жөн кой",
            "verse 52:46": "Ал күнү аларга айлакерликтери пайда бербейт жана аларга жардам да берилбейт",
            "verse 52:47": "Жана заалым (каапыр) болгон адамдарга мындан (тозоктон) башка азаптар! да бар. Бирок алардын көпчүлүгү (муну) билишпейт",
            "verse 52:48": "Эми, Раббиңдин өкүмүнө сабыр кыл! Сен Биздин көз алдыбыздасың. Жана (беш убак намазга) турганда, Раббиңе мактоо жана тасбих айт",
            "verse 52:49": "Түндүн (бир бөлүгүндө) жана да жылдыздар кеткен (таң) мезгилинде дагы Ага тасбих айт"
        },
        "Malay": {
            "verse 52:1": "Demi Gunung Tursina;",
            "verse 52:2": "Dan demi Kitab yang tertulis dengan rapi -",
            "verse 52:3": "Pada lembaran surat yang terbuka;",
            "verse 52:4": "Dan demi \"Al-Baitul Makmur\";",
            "verse 52:5": "Dan demi bumbung yang tinggi;",
            "verse 52:6": "Dan demi laut yang penuh tepu (dengan kepanasan); -",
            "verse 52:7": "Sesungguhnya azab Tuhanmu tetap berlaku; -",
            "verse 52:8": "Tidak ada sesiapapun yang dapat menolaknya; -",
            "verse 52:9": "Pada hari langit (dan segala isinya) bergegar dengan sekuat-kuatnya.",
            "verse 52:10": "Dan gunung-ganang bergerak dari tempatnya dengan cara yang luar biasa.",
            "verse 52:11": "(Apabila berlaku yang demikian), maka kecelakaan dan kebinasaanlah pada hari itu bagi orang-orang yang mendustakan kebenaran;",
            "verse 52:12": "Iaitu orang-orang yang leka bermain-main dalam kesesatan.",
            "verse 52:13": "Pada hari mereka ditolak ke alam neraka Jahannam dengan penolakan yang sekasar-kasarnya,",
            "verse 52:14": "(Dan dikatakan kepada mereka): \"Inilah api neraka yang dahulu kamu mendustakannya.",
            "verse 52:15": "\"Maka adakah ini sihir juga (sebagaimana yang kamu katakan terhadap keterangan Rasul Kami dahulu?), atau kamu tidak nampak (kenyataannya sebagaimana kamu tidak nampak di dunia dahulu akan kebenaran Rasul Kami)?",
            "verse 52:16": "\"Rasalah bakarannya; kemudian sama ada kamu bersabar (menderita azabnya) atau tidak bersabar, sama sahaja (tidak ada faedahnya) kepada kamu, kerana kamu tidak dibalas melainkan dengan apa yang kamu telah kerjakan\".",
            "verse 52:17": "Sesungguhnya orang-orang yang bertaqwa, di tempatkan dalam taman-taman Syurga dan nikmat kesenangan (yang tidak ada taranya).",
            "verse 52:18": "Mereka bersenang lenang dengan apa yang dikurniakan oleh Tuhan mereka, dan mereka dipelihara Tuhan dari azab neraka.",
            "verse 52:19": "(Dan dikatakan kepada mereka): \"Makan dan minumlah kamu makanan dan minuman yang lazat serta baik kesudahannya, dengan sebab apa yang kamu telah kerjakan\".",
            "verse 52:20": "Mereka duduk berbaring di atas pelamin-pelamin yang berderet; dan Kami jadikan kawan teman mereka bidadari-bidadari yang putih melepak, lagi luas cantik matanya.",
            "verse 52:21": "Dan orang-orang yang beriman yang diturut oleh zuriat keturunannya dengan keadaan beriman, Kami hubungkan (himpunkan) zuriat keturunannya itu dengan mereka (di dalam Syurga); dan Kami (dengan itu) tidak mengurangi sedikitpun dari pahala amal-amal mereka; tiap-tiap seorang manusia terikat dengan amal yang dikerjakannya.",
            "verse 52:22": "Dan (penduduk Syurga itu) Kami tambahi mereka (dari semasa ke semasa), dengan buah-buahan dan daging dari berbagai jenis yang mereka ingini.",
            "verse 52:23": "Mereka di dalam Syurga itu (kerana melahirkan kemesraan antara satu dengan yang lain): berebut-rebut mengambil piala yang berisi arak yang tidak menyebabkan timbul (dari peminumnya) perkara yang sia-sia dan tidak pula menyebabkan (peminumnya menanggung) dosa.",
            "verse 52:24": "Dan mereka dilayani oleh anak-anak muda lelaki yang sentiasa beredar di sekitar mereka, (yang cantik parasnya) seolah-olah anak-anak muda itu mutiara yang tersimpan dengan sebaik-baiknya.",
            "verse 52:25": "Dan (dengan berada dalam nikmat itu) mereka berhadap-hadapan satu sama lain sambil bertanya-tanya.",
            "verse 52:26": "Mereka berkata: \"Sesungguhnya kami dahulu, semasa berada dalam kalangan keluarga kami - selalu merasa cemas takut (daripada berlaku derhaka kepada Allah),",
            "verse 52:27": "\"Maka Allah mengurniakan kami (rahmat dan taufiqNya), serta memelihara kami dari azab neraka.",
            "verse 52:28": "\"Sesungguhnya kami dahulu tetap menyembahNya (dan memohon pertolonganNya). Kerana sesungguhnya Dia lah sahaja yang sentiasa melimpahkan ihsanNya, lagi Yang Maha Mengasihani\".",
            "verse 52:29": "Maka hendaklah engkau (wahai Muhammad) tetap tekun memberi peringatan (dengan ajaran-ajaran Al-Quran yang diturunkan kepadamu, dan janganlah dihiraukan golongan yang ingkar), kerana engkau dengan nikmat Tuhanmu (yang dilimpahkanNya kepadamu itu) bukanlah seorang pawang dan bukan pula seorang gila.",
            "verse 52:30": "(Mereka menuduh Nabi Muhammad dengan yang bukan-bukan), bahkan mereka mengatakan: \"(Muhammad) itu seorang penyair yang kami tunggu-tunggu saat kebinasaannya\".",
            "verse 52:31": "Katakanlah (wahai Muhammad): \"Tunggulah kamu (akan apa yang kamu tuduh itu), maka sesungguhnya aku juga dari orang-orang yang menunggu bersama-sama kamu (akan apa yang dijanjikan oleh Allah Taala)\".",
            "verse 52:32": "Adakah mereka disuruh oleh akal fikiran mereka melemparkan tuduhan-tuduhan yang sedemikian itu, atau sememangnya mereka suatu kaum yang melampaui batas (dalam keingkaran dan kedegilannya)?",
            "verse 52:33": "(Bukan sahaja mereka ingkar dan degil) bahkan mereka berkata: \"Dia (Muhammad) telah mereka-reka Al-Quran itu\". (Tuduhan mereka yang demikian tidak berasas) bahkan mereka sengaja tidak mahu beriman!",
            "verse 52:34": "(Kalau tidak) maka hendaklah mereka membuat dan mendatangkan kata-kata (yang fasih dan indah) seperti Al-Quran itu, jika betul mereka orang-orang yang benar dakwaannya.",
            "verse 52:35": "(Mengapa mereka tidak beriman?) Adakah mereka telah tercipta dengan tiada yang menciptanya, atau adakah mereka yang mencipta diri mereka sendiri?",
            "verse 52:36": "Adakah mereka yang mencipta langit dan bumi itu? (Sudah tentu tidak!) Bahkan mereka adalah orang-orang yang tidak meyakini (kebenaran apa yang mereka pernah mengakuinya).",
            "verse 52:37": "Adakah pada tangan mereka perbendaharaan Tuhanmu (sehingga mereka boleh memberi atau menahan sesuatu nikmat atau pangkat), atau merekalah yang berkuasa mentadbirkan segala-galanya?",
            "verse 52:38": "Adakah mereka mempunyai tangga (untuk naik ke langit), yang dengannya mereka dapat mendengar (apa yang diperintahkan dan ditetapkan oleh Allah? Jika ada) maka biarlah orang mereka yang mendengar itu membawa sesuatu bukti yang menyatakan kebenarannya.",
            "verse 52:39": "Adilkah (kamu sediakan) bagi Allah - anak-anak perempuan (yang kamu benci), dan untuk kamu - anak-anak lelaki (yang kamu sukai)?",
            "verse 52:40": "Pernahkah engkau (wahai Muhammad) meminta sebarang bayaran kepada mereka (mengenai ajaran Islam yang engkau sampaikan), lalu mereka merasa berat menanggung bayaran itu (sehingga menjauhkan diri daripada menyahut seruanmu)?",
            "verse 52:41": "Adakah pada sisi mereka (Lauh Mahfuz yang mengandungi) perkara-perkara yang ghaib, lalu mereka menyalin (daripadanya untuk menentang ajaran dan peringatanmu)?",
            "verse 52:42": "(Mereka tidak cukup dengan kata-kata dan tuduhan-tuduhan yang buruk sahaja) bahkan mereka hendak melakukan rancangan jahat (terhadapmu wahai Muhammad; tetapi mereka tidak akan berjaya) kerana orang-orang yang kafir itulah yang akan ditimpa balasan rancangan jahatnya.",
            "verse 52:43": "(Apabila datangnya balasan rancangan jahat itu maka) adakah bagi mereka Tuhan (yang dapat menyelamatkan mereka) selain dari Allah? Maha Suci Allah dari apa yang mereka sekutukan itu.",
            "verse 52:44": "Dan kiranya mereka melihat sepotong besar dari langit gugur (untuk menimpa mereka), mereka akan berkata: \"(Itu adalah) awan yang bertompok - berlapis-lapis!\"",
            "verse 52:45": "(Kalau keingkaran dan kedegilan mereka sampai begitu sekali) maka biarkanlah mereka (wahai Muhammad, dan janganlah dihiraukan) sehingga mereka menemui hari yang padanya mereka akan binasa -",
            "verse 52:46": "(Iaitu) hari segala rancangan jahat dan tipu daya mereka tidak dapat mendatangkan sebarang faedah kepada mereka, dan mereka pula tidak diberikan pertolongan.",
            "verse 52:47": "Sesungguhnya orang-orang yang zalim itu akan beroleh azab seksa selain dari azab yang tersebut, akan tetapi kebanyakan mereka tidak mengetahui (hakikat yang sebenarnya).",
            "verse 52:48": "Dan (dengan yang demikian) bersabarlah (wahai Muhammad) menerima hukum Tuhanmu (memberi tempoh kepada mereka), kerana sesungguhnya engkau tetap terselamat dalam pemuliharaan serta pengawasan Kami; dan bertasbihlah dengan memuji Tuhanmu semasa engkau bangun.",
            "verse 52:49": "Dan juga hendaklah engkau bertasbih kepadaNya pada waktu malam, dan ketika bintang-bintang tenggelam (pada waktu subuh)."
        },
        "Malayalam": {
            "verse 52:1": "ത്വൂര്‍ പര്‍വ്വതം തന്നെയാണ, സത്യം.",
            "verse 52:2": "എഴുതപ്പെട്ട ഗ്രന്ഥം തന്നെയാണ, സത്യം.",
            "verse 52:3": "നിവര്‍ത്തിവെച്ച തുകലില്‍",
            "verse 52:4": "അധിവാസമുള്ള മന്ദിരം തന്നെയാണ, സത്യം.",
            "verse 52:5": "ഉയര്‍ത്തപ്പെട്ട മേല്‍പുര (ആകാശം) തന്നെയാണ, സത്യം.",
            "verse 52:6": "നിറഞ്ഞ സമുദ്രം തന്നെയാണ, സത്യം.",
            "verse 52:7": "തീര്‍ച്ചയായും നിന്‍റെ രക്ഷിതാവിന്‍റെ ശിക്ഷ സംഭവിക്കുന്നത് തന്നെയാകുന്നു.",
            "verse 52:8": "അതു തടുക്കുവാന്‍ ആരും തന്നെയില്ല.",
            "verse 52:9": "ആകാശം ശക്തിയായി പ്രകമ്പനം കൊള്ളുന്ന ദിവസം.",
            "verse 52:10": "പര്‍വ്വതങ്ങള്‍ (അവയുടെ സ്ഥാനങ്ങളില്‍ നിന്ന്‌) നീങ്ങി സഞ്ചരിക്കുകയും ചെയ്യുന്ന ദിവസം.",
            "verse 52:11": "അന്നേ ദിവസം സത്യനിഷേധികള്‍ക്കാകുന്നു നാശം.",
            "verse 52:12": "അതായത് അനാവശ്യകാര്യങ്ങളില്‍ മുഴുകി കളിച്ചുകൊണ്ടിരിക്കുന്നവര്‍ക്ക്‌",
            "verse 52:13": "അവര്‍ നരകാഗ്നിയിലേക്ക് ശക്തിയായി പിടിച്ച് തള്ളപ്പെടുന്ന ദിവസം.",
            "verse 52:14": "(അവരോട് പറയപ്പെടും:) ഇതത്രെ നിങ്ങള്‍ നിഷേധിച്ചു കളഞ്ഞിരുന്ന നരകം.",
            "verse 52:15": "അപ്പോള്‍ ഇത് മായാജാലമാണോ? അതല്ല, നിങ്ങള്‍ കാണുന്നില്ലെന്നുണ്ടോ?",
            "verse 52:16": "നിങ്ങള്‍ അതില്‍ കടന്നു എരിഞ്ഞു കൊള്ളുക. എന്നിട്ട് നിങ്ങളത് സഹിക്കുക. അല്ലെങ്കില്‍ നിങ്ങള്‍ സഹിക്കാതിരിക്കുക. അത് രണ്ടും നിങ്ങള്‍ക്ക് സമമാകുന്നു. നിങ്ങള്‍ പ്രവര്‍ത്തിച്ച് കൊണ്ടിരുന്നതിന് മാത്രമാണ് നിങ്ങള്‍ക്ക് പ്രതിഫലം നല്‍കപ്പെടുന്നത്‌.",
            "verse 52:17": "തീര്‍ച്ചയായും ധര്‍മ്മനിഷ്ഠപാലിക്കുന്നവര്‍ സ്വര്‍ഗത്തോപ്പുകളിലും സുഖാനുഗ്രഹങ്ങളിലുമായിരിക്കും.",
            "verse 52:18": "തങ്ങളുടെ രക്ഷിതാവ് അവര്‍ക്കു നല്‍കിയതില്‍ ആനന്ദം കൊള്ളുന്നവരായിട്ട്‌. ജ്വലിക്കുന്ന നരകത്തിലെ ശിക്ഷയില്‍ നിന്ന് അവരുടെ രക്ഷിതാവ് അവരെ കാത്തുരക്ഷിക്കുകയും ചെയ്യും.",
            "verse 52:19": "(അവരോട് പറയപ്പെടും:) നിങ്ങള്‍ പ്രവര്‍ത്തിച്ചിരുന്നതിന്‍റെ ഫലമായി നിങ്ങള്‍ സുഖമായി തിന്നുകയും കുടിക്കുകയും ചെയ്തു കൊള്ളുക.",
            "verse 52:20": "വരിവരിയായ് ഇട്ട കട്ടിലുകളില്‍ ചാരിയിരിക്കുന്നവരായിരിക്കും അവര്‍. വിടര്‍ന്ന കണ്ണുകളുള്ള വെളുത്ത തരുണികളെ നാം അവര്‍ക്ക് ഇണചേര്‍ത്തു കൊടുക്കുകയും ചെയ്യും.",
            "verse 52:21": "ഏതൊരു കൂട്ടര്‍ വിശ്വസിക്കുകയും അവരുടെ സന്താനങ്ങള്‍ വിശ്വാസത്തില്‍ അവരെ പിന്തുടരുകയും ചെയ്തിരിക്കുന്നുവോ അവരുടെ സന്താനങ്ങളെ നാം അവരോടൊപ്പം ചേര്‍ക്കുന്നതാണ്‌. അവരുടെ കര്‍മ്മഫലത്തില്‍ നിന്ന് യാതൊന്നും നാം അവര്‍ക്കു കുറവു വരുത്തുകയുമില്ല. ഏതൊരു മനുഷ്യനും താന്‍ സമ്പാദിച്ച് വെച്ചതിന് (സ്വന്തം കര്‍മ്മങ്ങള്‍ക്ക്‌) പണയം വെക്കപ്പെട്ടവനാകുന്നു.",
            "verse 52:22": "അവര്‍ കൊതിക്കുന്ന തരത്തിലുള്ള പഴവും മാംസവും നാം അവര്‍ക്ക് അധികമായി നല്‍കുകയും ചെയ്യും.",
            "verse 52:23": "അവിടെ അവര്‍ പാനപാത്രം അന്യോന്യം കൈമാറികൊണ്ടിരിക്കും. അവിടെ അനാവശ്യവാക്കോ, അധാര്‍മ്മിക വൃത്തിയോ ഇല്ല.",
            "verse 52:24": "അവര്‍ക്ക് (പരിചരണത്തിനായി) ചെറുപ്പക്കാര്‍ അവരുടെ അടുത്ത് ചുറ്റിത്തിരിഞ്ഞു കൊണ്ടിരിക്കും. അവര്‍ സൂക്ഷിച്ച് വെക്കപ്പെട്ട മുത്തുകള്‍ പോലെയിരിക്കും",
            "verse 52:25": "പരസ്പരം പലതും ചോദിച്ചു കൊണ്ട് അവരില്‍ ചിലര്‍ ചിലരെ അഭിമുഖീകരിക്കും.",
            "verse 52:26": "അവര്‍ പറയും: തീര്‍ച്ചയായും നാം മുമ്പ് നമ്മുടെ കുടുംബത്തിലായിരിക്കുമ്പോള്‍ ഭയഭക്തിയുള്ളവരായിരുന്നു",
            "verse 52:27": "അതിനാല്‍ അല്ലാഹു നമുക്ക് അനുഗ്രഹം നല്‍കുകയും, രോമകൂപങ്ങളില്‍ തുളച്ചു കയറുന്ന നരകാഗ്നിയുടെ ശിക്ഷയില്‍ നിന്ന് അവന്‍ നമ്മെ കാത്തുരക്ഷിക്കുകയും ചെയ്തു.",
            "verse 52:28": "തീര്‍ച്ചയായും നാം മുമ്പേ അവനോട് പ്രാര്‍ത്ഥിക്കുന്നവരായിരുന്നു. തീര്‍ച്ചയായും അവന്‍ തന്നെയാകുന്നു ഔദാര്യവാനും കരുണാനിധിയും.",
            "verse 52:29": "ആകയാല്‍ നീ ഉല്‍ബോധനം ചെയ്യുക. നിന്‍റെ രക്ഷിതാവിന്‍റെ അനുഗ്രഹത്താല്‍ നീ ഒരു ജ്യോത്സ്യനോ, ഭ്രാന്തനോ അല്ല.",
            "verse 52:30": "അതല്ല, (മുഹമ്മദ്‌) ഒരു കവിയാണ്‌, അവന്ന് കാലവിപത്ത് വരുന്നത് ഞങ്ങള്‍ കാത്തിരിക്കുകയാണ് എന്നാണോ അവര്‍ പറയുന്നത്‌?",
            "verse 52:31": "നീ പറഞ്ഞേക്കുക: നിങ്ങള്‍ കാത്തിരുന്നോളൂ. തീര്‍ച്ചയായും ഞാനും നിങ്ങളോടൊപ്പം കാത്തിരിക്കുന്നവരുടെ കൂട്ടത്തിലാകുന്നു.",
            "verse 52:32": "അതല്ല, അവരുടെ മനസ്സുകള്‍ അവരോട് ഇപ്രകാരം കല്‍പിക്കുകയാണോ? അതല്ല, അവര്‍ ധിക്കാരികളായ ഒരു ജനത തന്നെയാണോ?",
            "verse 52:33": "അതല്ല, അദ്ദേഹം (നബി) അത് കെട്ടിച്ചമച്ചു പറഞ്ഞതാണ് എന്ന് അവര്‍ പറയുകയാണോ? അല്ല, അവര്‍ വിശ്വസിക്കുന്നില്ല.",
            "verse 52:34": "എന്നാല്‍ അവര്‍ സത്യവാന്‍മാരാണെങ്കില്‍ ഇതു പോലുള്ള ഒരു വൃത്താന്തം അവര്‍ കൊണ്ടുവരട്ടെ.",
            "verse 52:35": "അതല്ല, യാതൊരു വസ്തുവില്‍ നിന്നുമല്ലാതെ അവര്‍ സൃഷ്ടിക്കപ്പെട്ടിരിക്കുകയാണോ? അതല്ല, അവര്‍ തന്നെയാണോ സ്രഷ്ടാക്കള്‍?",
            "verse 52:36": "അതല്ല, അവരാണോ ആകാശങ്ങളും ഭൂമിയും സൃഷ്ടിച്ചിരിക്കുന്നത്‌? അല്ല, അവര്‍ ദൃഢമായി വിശ്വസിക്കുന്നില്ല.",
            "verse 52:37": "അതല്ല, അവരുടെ പക്കലാണോ നിന്‍റെ രക്ഷിതാവിന്‍റെ ഖജനാവുകള്‍! അതല്ല, അവരാണോ അധികാരം നടത്തുന്നവര്‍?",
            "verse 52:38": "അതല്ല, അവര്‍ക്ക് (ആകാശത്തു നിന്ന്‌) വിവരങ്ങള്‍ ശ്രദ്ധിച്ചു കേള്‍ക്കാന്‍ വല്ല കോണിയുമുണ്ടോ? എന്നാല്‍ അവരിലെ ശ്രദ്ധിച്ച് കേള്‍ക്കുന്ന ആള്‍ വ്യക്തമായ വല്ല പ്രമാണവും കൊണ്ടുവരട്ടെ.",
            "verse 52:39": "അതല്ല, അവന്നു (അല്ലാഹുവിനു)ള്ളത് പെണ്‍മക്കളും നിങ്ങള്‍ക്കുള്ളത് ആണ്‍മക്കളുമാണോ?",
            "verse 52:40": "അതല്ല, നീ അവരോട് വല്ല പ്രതിഫലവും ചോദിച്ചിട്ട് അവര്‍ കടബാധ്യതയാല്‍ ഭാരം പേറേണ്ടവരായിരിക്കുകയാണോ?",
            "verse 52:41": "അതല്ല, അവര്‍ക്ക് അദൃശ്യജ്ഞാനം കരഗതമാവുകയും, അത് അവര്‍ രേഖപ്പെടുത്തിവെക്കുകയും ചെയ്യുന്നുണ്ടോ?",
            "verse 52:42": "അതല്ല, അവര്‍ വല്ല കുതന്ത്രവും നടത്താന്‍ ഉദ്ദേശിക്കുകയാണോ? എന്നാല്‍ സത്യനിഷേധികളാരോ അവര്‍ തന്നെയാണ് കുതന്ത്രത്തില്‍ അകപ്പെടുന്നവര്‍.",
            "verse 52:43": "അതല്ല, അവര്‍ക്ക് അല്ലാഹുവല്ലാത്ത വല്ല ദൈവവുമുണ്ടോ? അവര്‍ പങ്കുചേര്‍ക്കുന്നതില്‍ നിന്നെല്ലാം അല്ലാഹു എത്രയോ പരിശുദ്ധനായിരിക്കുന്നു.",
            "verse 52:44": "ആകാശത്തുനിന്ന് ഒരു കഷ്ണം വീഴുന്നതായി അവര്‍ കാണുകയാണെങ്കിലും അവര്‍ പറയും: അത് അടുക്കടുക്കായ മേഘമാണെന്ന്‌.",
            "verse 52:45": "അതിനാല്‍ അവര്‍ ബോധരഹിതരായി വീഴ്ത്തപ്പെടുന്ന അവരുടെ ആ ദിവസം അവര്‍ കണ്ടുമുട്ടുന്നത് വരെ നീ അവരെ വിട്ടേക്കുക.",
            "verse 52:46": "അവരുടെ കുതന്ത്രം അവര്‍ക്ക് ഒട്ടും പ്രയോജനം ചെയ്യാത്ത, അവര്‍ക്ക് സഹായം ലഭിക്കാത്ത ഒരു ദിവസം.",
            "verse 52:47": "തീര്‍ച്ചയായും അക്രമം പ്രവര്‍ത്തിച്ചവര്‍ക്ക് അതിനു പുറമെയും ശിക്ഷയുണ്ട്‌. പക്ഷെ അവരില്‍ അധികപേരും മനസ്സിലാക്കുന്നില്ല.",
            "verse 52:48": "നിന്‍റെ രക്ഷിതാവിന്‍റെ തീരുമാനത്തിന് നീ ക്ഷമാപൂര്‍വ്വം കാത്തിരിക്കുക. തീര്‍ച്ചയായും നീ നമ്മുടെ ദൃഷ്ടിയിലാകുന്നു. നീ എഴുന്നേല്‍ക്കുന്ന സമയത്ത് നിന്‍റെ രക്ഷിതാവിനെ സ്തുതിക്കുന്നതോടൊപ്പം അവന്‍റെ പരിശുദ്ധിയെ നീ പ്രകീര്‍ത്തിക്കുകയും ചെയ്യുക.",
            "verse 52:49": "രാത്രിയില്‍ കുറച്ച് സമയവും നക്ഷത്രങ്ങള്‍ പിന്‍വാങ്ങുമ്പോഴും നീ അവന്‍റെ പരിശുദ്ധിയെ പ്രകീര്‍ത്തിക്കുക."
        },
        "Norwegian": {
            "verse 52:1": "Ved berget,",
            "verse 52:2": "og den skrevne skrift",
            "verse 52:3": "på utbredt pergament,",
            "verse 52:4": "ved det besøkte tempel,",
            "verse 52:5": "ved det høyt hvelvede tak,",
            "verse 52:6": "og det brusende hav,",
            "verse 52:7": "Herrens straff vil visselig inntreffe!",
            "verse 52:8": "Ingen kan avverge den!",
            "verse 52:9": "Den dag, når himmelen snurrer rundt,",
            "verse 52:10": "og fjellene beveger seg,",
            "verse 52:11": "ve denne dag over dem som kaller sannhet for løgn,",
            "verse 52:12": "og driver med tomt snakk og lek,",
            "verse 52:13": "den dag, når de støtes i helvetes ild!",
            "verse 52:14": "«Dette er Ilden, som dere fornektet!",
            "verse 52:15": "Er dette trolldom, eller kan dere ikke se?",
            "verse 52:16": "Møt den, og bær med tålmod eller ikke, det er det samme for dere. Dere belønnes bare for det dere har gjort.»",
            "verse 52:17": "De gudfryktige skal være i paradisets haver og lykksalighet,",
            "verse 52:18": "idet de gleder seg over det Herren har gitt dem. Herren har bevart dem for helvetes straff.",
            "verse 52:19": "«Spis og drikk og måtte det bekomme dere vel, for det dere har gjort.»",
            "verse 52:20": "De ligger tilbakelenet på leier, rekkevis, og Vi forener dem parvis med mørkøyde kvinner.",
            "verse 52:21": "De som tror, og hvis etterkommere fulgte dem i troen, dem vil Vi føre sammen med deres etterkommere, og Vi forminsker ikke deres innsats det ringeste. Hver mann står for det han har fortjent!",
            "verse 52:22": "Og Vi forsørger dem rikelig med frukt og kjøtt slik de ønsker,",
            "verse 52:23": "mens der går et beger rundt, som ikke innebærer tomt prat eller synd.",
            "verse 52:24": "Og det er unge gutter som går rundt blant dem og betjener dem, skjønne som skjulte perler.",
            "verse 52:25": "Og de henvender seg til hverandre og samtaler, og sier:",
            "verse 52:26": "«Tidligere var vi blant våre, og gikk i frykt,",
            "verse 52:27": "men Gud var god mot oss, og bevarte oss fra den hete vindens straff.",
            "verse 52:28": "Vi påkalte Ham tidligere. Han er den Rettsindige, den Nåderike.»",
            "verse 52:29": "Så forman! Ved Herrens nåde er du verken en spåmann eller besatt.",
            "verse 52:30": "Eller sier de: «En skald! Vi vil avvente skjebnens trekk for ham.»",
            "verse 52:31": "Si: «Bare vent! Jeg venter sammen med dere.»",
            "verse 52:32": "Kan det være deres drømmer som inngir dem slikt? Eller er de oppsetsige mennesker?",
            "verse 52:33": "Eller de sier: «Det er bare noe han sier frem.»",
            "verse 52:34": "Nei, de tror ikke! La dem bringe en tilsvarende forkynnelse, om de snakker sant.",
            "verse 52:35": "Er de skapt av intet? Eller er de skaperne?",
            "verse 52:36": "Har de skapt himlene og jorden? Nei, de er ikke overbeviste.",
            "verse 52:37": "Eller har de hånd om Herrens skatter? Er det de som bestemmer?",
            "verse 52:38": "Eller har de en stige, hvorfra de kan lytte ved himmelens port? Så la den som lytter komme med et klart bevis!",
            "verse 52:39": "Eller er det slik at Han har døtre, og dere sønner?",
            "verse 52:40": "Har du bedt dem om lønn, så de er trykket av gjeld?",
            "verse 52:41": "Eller har de adgang til det skjulte, så de skriver ned?",
            "verse 52:42": "Søker de en list? De vantro, de blir overlistet!",
            "verse 52:43": "Har de en annen gud enn Gud? Ære være Ham! Han er fjernt fra det de setter ved Hans side!",
            "verse 52:44": "Om de så stykker av himmelen falle ned, ville de si: «Det er haugskyer!»",
            "verse 52:45": "Så la dem være, til de møter deres dag når de blir som slått av lynet,",
            "verse 52:46": "den dag når deres list ikke hjelper dem, og de ikke finner hjelp.",
            "verse 52:47": "De urettferdige har i vente en straff utover dette, men de fleste av dem vet ingenting.",
            "verse 52:48": "Avvent tålmodig Herrens avgjørelse, for du er for Våre øyne, og lovpris Herren når du står opp",
            "verse 52:49": "og ved nattetid, og når stjernene trekker seg tilbake."
        },
        "Pashto": {
            "verse 52:1": "قسم دى په طور غر",
            "verse 52:2": "او په كتاب لیكل شوي",
            "verse 52:3": "په پرانستل شوې پاڼه كې",
            "verse 52:4": "او (قسم دى) په ودان كړى شوي كور",
            "verse 52:5": "او په پورته كړى شوي چت (چې اسمان دى)",
            "verse 52:6": "او په ډك (يا بل) كړى شوي سمندر",
            "verse 52:7": "بېشكه ستا د رب عذاب خامخا نازلېدونكى دى",
            "verse 52:8": "هغه لره هېڅ دفع كوونكى نشته",
            "verse 52:9": "هغه ورځ چې اسمان به خوځېږي، سخت خوځېدل",
            "verse 52:10": "او غرونه به روان شي، سخت روانېدل",
            "verse 52:11": "پس په دغې ورځ كې د تكذیب كوونكو لپاره هلاكت دى",
            "verse 52:12": "هغه كسان چې دوى په بېكاره خبرو (جوړولو) كې لوبې كوي",
            "verse 52:13": "هغه ورځ چې دوى به د دوزخ اور ته ټېل وهلى شي، سخت ټېل وهل",
            "verse 52:14": "دا هغه اور دى چې تاسو به دا دروغ ګاڼه",
            "verse 52:15": "ایا نو دا سحر (جادو) دى، یا يې تاسو نه وینئ",
            "verse 52:16": "ورځئ، ده ته ننوځئ، پس تاسو صبر وكړئ، یا صبر مه كوئ، پر تاسو باندې دغه (دواړه كارونه) برابر دي، بېشكه همدا خبره ده چې تاسو ته د هغو عملونو بدله دركولى شي چې تاسو به كول",
            "verse 52:17": "بېشكه پرهېزګاران به په جنتونو او نعمتونو كې وي",
            "verse 52:18": "چې په هغو (نعمتونو) به خوشالېدونكي وي چې دوى ته خپل رب وركړي دي او خپل رب دوى د دوزخ له عذاب نه بچ ساتلي دي",
            "verse 52:19": "(ورته ویلى به شي:) تاسو خورئ او څښئ په خوند سره، د هغو عملونو په بدل كې چې تاسو به كول",
            "verse 52:20": "په دې حال كې چې په قطار ایښودل شويو تختونو باندې به تكیه كوونكي وي او مونږ به د دوى نكاح د ښايسته غټ سترګو سپينو سرو حورو سره وكړو",
            "verse 52:21": "او هغه كسان چې ایمان يې راوړى دى او د دوى اولاد (هم) په ایمان كې د دوى متابعت كړى وي، (نو) مونږ به په دوى پورې د دوى اولاد هم پیوست كړو او مونږ به دوى ته د دوى له عملونو نه هېڅ شى كم نه كړو، هر سړى به د خپلو كړو په بدل ګرو (ګاڼه) وي",
            "verse 52:22": "او مونږ به دوى ته ور زیاتې كړو، نورې مېوې او هغه غوښې چې د دوى زړه يې غواړي",
            "verse 52:23": "دوى به په دغه (جنت) كې یو له بله (د شرابو) پیالې راكاږي، نه به په دغو كې عبثې خبرې وي او نه ګناهګار كول",
            "verse 52:24": "او د دوى چاپېره به د دوى غلامان ګرځي، ګویا كې دغه (غلامان) پټې ساتل شوې ملغلرې دي",
            "verse 52:25": "او د دوى ځینې به ځینو نورو ته مخ راواړوي، چې یو له بله به پوښتنې كوي",
            "verse 52:26": "دوى به ووايي چې بېشكه مونږ له دې نه مخكې په خپل اهل كې وېرېدونكي وو",
            "verse 52:27": "نو الله پر مونږ احسان وكړ او مونږ يې د تودوخي (ګرمباد) له عذاب نه وساتلو",
            "verse 52:28": "بېشكه مونږ له دې نه مخكې هم دغه (الله) باله، بېشكه هم دى ډېر احسان كوونكى، بې حده رحم كوونكى دى",
            "verse 52:29": "نو ته (خلقو ته) نصیحت كوه، پس ته د خپل رب په نعمت سره نه كاهن يې او نه لېونى",
            "verse 52:30": "ایا دوى وايي چې (دى) شاعر دى، مونږ د ده په حق كې د زمانې د حوادثو انتظار كوو",
            "verse 52:31": "ته (دوى ته) ووایه: تاسو انتظار كوئ، پس بېشكه زه له تاسو سره له انتظار كوونكو ځنې یم",
            "verse 52:32": "ایا دوى ته د دوى عقلونه په دې (كار) حكم كوي، یا دوى سركشه (شرخوښونكى) قوم دى",
            "verse 52:33": "ایا دوى وايي چې دا (قرآن) ده له ځانه جوړ كړى دى (داسې نه ده) بلكې دوى ایمان نه راوړي",
            "verse 52:34": "نو دوى دې د ده په شان خبره راوړي كه دوى رښتیني وي",
            "verse 52:35": "ایا دوى بې له څه شي پیدا كړى شوي دي، یا هم دوى، پخپله پیدا كوونكي دي؟",
            "verse 52:36": "ایا دوى اسمانونه او ځمكه پیدا كړي دي؟ بلكې دوى یقین نه كوي",
            "verse 52:37": "ایا له دوى سره ستا د رب خزانې دي، یا هم دوى واكدران دي",
            "verse 52:38": "ایا د دوى لپاره اندرپایه (پوړۍ) ده چې دوى په هغې باندې (خېژي او) اورېدل كوي، نو د دوى اورېدونكي دې ښكاره دلیل راوړي",
            "verse 52:39": "ایا د هغه (الله) لپاره لوڼه دي او تاسو لپاره زامن دي؟",
            "verse 52:40": "ایا ته له دوى نه څه مزدوري غواړې، پس دوى له تاوانه درانه كړى شوي دي",
            "verse 52:41": "ایا له دوى سره غیب دى (وحي راغلې ده) نو دوى يې لیكي",
            "verse 52:42": "ایا دوى د مكر كولو اراده لري، نو هغه كسان چې كافران شوي دي هم دوى مكر كړى شوي دي",
            "verse 52:43": "ایا د دوى لپاره له الله نه غیر بل معبود شته؟ الله لره پاكي ده له هغه شي نه چې دوى يې ورسره شریكوي",
            "verse 52:44": "او كه دوى یوه ټوټه له اسمانه رالوېدونكې وویني (، نو) وبه وايي (دا) قط په قط كړى شوې ورېځ ده",
            "verse 52:45": "نو ته دوى پرېږده، تر هغه پورې چې دوى له خپلې هغې ورځې سره ملاقات وكړي چې دوى به په هغې كې بې خوده كولى شي",
            "verse 52:46": "هغه ورځ چې له دوى نه به د دوى مكر هېڅ شى (عذاب) لرې نه كړى شي او نه به د دوى مدد كولى شی",
            "verse 52:47": "او بېشكه د هغو كسانو لپاره چې ظلم (شرك) يې كړى دى له دغه (عذاب) نه مخكې عذاب دى او لېكن د دوى زیاتره خلق نه پوهېږي",
            "verse 52:48": "نو ته د خپل رب حكم ته صبر كوه، پس بېشكه ته زمونږ د سترګو په وړاندې يې او ته د خپل رب له ستاينې سره تسبیح وایه كله چې ته پاڅېږې",
            "verse 52:49": "او دشپې په ځینې حصه كې، نو ته د هغه پاكي بیانوه او له ستوریو نه وروسته (د شپې په اخري حصې كې) هم"
        },
        "Persian": {
            "verse 52:1": "قسم به كوه طور،",
            "verse 52:2": "و قسم به كتاب نوشته شده،",
            "verse 52:3": "در صفحه‌اى گشاده،",
            "verse 52:4": "و قسم به بيت المعمور،",
            "verse 52:5": "و قسم به اين سقف برافراشته،",
            "verse 52:6": "و قسم به درياى مالامال،",
            "verse 52:7": "كه عذاب پروردگارت واقع شدنى است.",
            "verse 52:8": "و آن را دفع‌كننده‌اى نيست.",
            "verse 52:9": "روزى كه آسمان سخت بچرخد،",
            "verse 52:10": "و كوه‌ها به شتاب روان شوند،",
            "verse 52:11": "پس در آن روز، واى بر تكذيب‌كنندگان.",
            "verse 52:12": "آنان كه سرگرم كارهاى باطل خويشند.",
            "verse 52:13": "روزى كه آنها را به قهر به جانب جهنم كشند.",
            "verse 52:14": "اين است آن آتشى كه دروغش مى‌انگاشتيد.",
            "verse 52:15": "آيا اين جادوست يا شما نمى‌بينيد؟",
            "verse 52:16": "به آتش درآييد. خواه بر آن صبر كنيد يا صبر نكنيد، تفاوتى نكند. شما را در برابر كارهايى كه مى‌كرده‌ايد، كيفر مى‌دهند.",
            "verse 52:17": "پرهيزگاران در بهشتها و نعمتند.",
            "verse 52:18": "از آنچه پروردگارشان به آنها داده است شادمانند، و خدا آنها را از عذاب جهنم نگه داشته است.",
            "verse 52:19": "به پاداش كارهايى كه كرده‌ايد بخوريد و بياشاميد. گوارايتان باد.",
            "verse 52:20": "بر آن تختهاى كنار هم چيده، تكيه مى‌زنند. حوريان را همسرشان مى‌گردانيم.",
            "verse 52:21": "كسانى كه خود ايمان آوردند و فرزندانشان در ايمان، پيرويشان كردند. فرزندانشان را به آنها ملحق مى‌كنيم و از پاداش عملشان هيچ نمى‌كاهيم كه هر كسى در گرو كار خويشتن است.",
            "verse 52:22": "و پيوسته از هر گونه كه بخواهند، ميوه و گوشت، عطايشان مى‌كنيم.",
            "verse 52:23": "در آنجا جام مى‌دهند و جام مى‌ستانند، كه در آن نه سخن بيهوده باشد و نه ارتكاب گناه.",
            "verse 52:24": "غلامانشان چون مرواريد پنهان در صدف، به گردشان مى‌چرخند.",
            "verse 52:25": "پرسش‌كنان روى به يكديگر مى‌كنند؛",
            "verse 52:26": "مى‌گويند: پيش از اين در ميان كسانمان، تنها ما از خدا مى‌ترسيديم.",
            "verse 52:27": "پس خدا بر ما منت نهاد و ما را از عذاب سموم نگه داشت.",
            "verse 52:28": "ما پيش از اين او را مى‌خوانديم، كه او احسان‌كننده و مهربان است.",
            "verse 52:29": "پندشان ده، كه تو به بركت نعمت پروردگارت نه كاهن هستى و نه مجنون.",
            "verse 52:30": "يا مى‌گويند: شاعرى است و ما براى وى منتظر حوادث روزگاريم.",
            "verse 52:31": "بگو: شما منتظر بمانيد كه من نيز با شما انتظار مى‌كشم.",
            "verse 52:32": "آيا آنان را رؤياهايشان به اين پندارها كشانده يا خود مردمى طاغى هستند.",
            "verse 52:33": "يا مى‌گويند: قرآن را خود ساخته است. نه، آنها ايمان نمى‌آورند.",
            "verse 52:34": "اگر راست مى‌گويند، سخنى مانند آن بياورند.",
            "verse 52:35": "آيا بى‌هيچ خالقى پديد آمده‌اند يا خود خالق خويشند؟",
            "verse 52:36": "يا آسمانها و زمين را خلق كرده‌اند؟ نه، به يقين نرسيده‌اند.",
            "verse 52:37": "يا خزاين پروردگارت نزد آنهاست؟ يا بر چيزى تسلط يافته‌اند،",
            "verse 52:38": "يا نردبامى دارند كه از آن بالا مى‌روند و گوش فرامى‌دهند؟ پس آن كه گوش فراداده حجتى آشكار بياورد.",
            "verse 52:39": "يا خداوند را دختران است و شما را پسران؟",
            "verse 52:40": "يا از آنها مزدى مى‌طلبى و پرداخت غرامت بر آنها دشوار است؟",
            "verse 52:41": "يا علم غيب مى‌دانند و مى‌نويسند؟",
            "verse 52:42": "يا مى‌خواهند حيلتى كنند؟ اما كافران خود به حيلت گرفتارند.",
            "verse 52:43": "يا آنها را خدايى است جز خداى يكتا؟ منزه است خداى يكتا از هر چه شريكش مى‌سازند.",
            "verse 52:44": "اگر بنگرند كه قطعه‌اى از آسمان فرومى‌افتد، مى‌گويند: ابرى است متراكم.",
            "verse 52:45": "پس آنها را واگذار تا روزى را كه در آن به هلاكت مى‌رسند بنگرند؛",
            "verse 52:46": "روزى كه مكرشان هيچ به حالشان سود نكند و كس به ياريشان برنخيزد.",
            "verse 52:47": "براى كسانى كه ستم مى‌كنند، باز هم عذابى است جز اين عذاب، ولى بيشترينشان نمى‌دانند.",
            "verse 52:48": "در برابر فرمان پروردگارت شكيبا باش كه تو تحت نظر مايى. و هنگامى كه برخاستى، به ستايش پرردگارت تسبيح گوى.",
            "verse 52:49": "و تسبيح گوى در پاره‌اى از شب و به هنگام ناپديد شدن ستارگان."
        },
        "Polish": {
            "verse 52:1": "Na Górę!",
            "verse 52:2": "Na Księgę zapisaną",
            "verse 52:3": "Na pergaminie rozwiniętym!",
            "verse 52:4": "Na Dom odwiedzany!",
            "verse 52:5": "Na sklepienie wzniesione!",
            "verse 52:6": "Na morze wzburzone!",
            "verse 52:7": "Zaprawdę, kara twego Pana spadnie niebawem!",
            "verse 52:8": "Nikt jej nie będzie mógł odsunąć",
            "verse 52:9": "W tym Dniu, kiedy niebo zakołysze się mocno",
            "verse 52:10": "I góry poruszą się poruszeniem.",
            "verse 52:11": "Biada, tego Dnia, oskarżającym o kłamstwo,",
            "verse 52:12": "Tym, którzy zagłębiając się w dyskusji, zabawiają się!",
            "verse 52:13": "Tego Dnia oni zostaną pchnięci ku ogniu Gehenny:",
            "verse 52:14": "\"To jest ogień, który uważaliście za kłamstwo!",
            "verse 52:15": "Czyż to są czary? Czy wy nie widzicie?",
            "verse 52:16": "Palcie się więc w nim! Znoście go cierpliwie lub nie znoście go cierpliwie! To dla was wszystko jedno! Wy tylko otrzymujecie zapłatę za to, co czyniliście.\"",
            "verse 52:17": "Zaprawdę, ci, którzy się boją Boga, będą w Ogrodach i szczęśliwości",
            "verse 52:18": "Cieszyć się tym, co dał im ich Pan. Ustrzegł ich Pan od kary ognia piekielnego.",
            "verse 52:19": "\"Jedzcie i pijcie w pokoju za to, co czyniliście,",
            "verse 52:20": "Wypoczywając wyciągnięci na łożach, ustawionych rzędami!\" My damy im za żony hurysy o wielkich oczach.",
            "verse 52:21": "A do tych, którzy uwierzyli i których potomstwo postąpiło za nimi z wiarą - My dołączymy ich potomstwo. I My nie pozbawimy ich niczego z ich dzieł. Każdy człowiek jest zastawem tego, co sobie zarobił.",
            "verse 52:22": "I My zaopatrzymy ich w owoce i mięso takie, jak oni zapragną.",
            "verse 52:23": "Będą oni sobie tam podawać jedni drugim puchary; nie będzie tam ani pustej gadaniny, ani podniecenia do grzechu.",
            "verse 52:24": "I będą krążyć pośród nich młodzieńcy, będący na ich usługach, podobni do ukrytych pereł.",
            "verse 52:25": "Będą się zwracać jedni do drugich; zadając sobie pytania.",
            "verse 52:26": "Będą mówili: \"Byliśmy, wśród naszej rodziny, pełni obawy.",
            "verse 52:27": "Bóg okazał nam dobroć i ustrzegł nas od cierpienia palącego wiatru.",
            "verse 52:28": "My przecież wzywaliśmy Go przedtem. Zaprawdę, On jest Dobry; Litościwy!\"",
            "verse 52:29": "Napominaj więc! Przecież ty nie jesteś, za łaską twego Pana, ani wieszczkiem, ani opętanym.",
            "verse 52:30": "Albo będą mówić: \"Poeta! My zaczekamy niepewności jego losu!\"",
            "verse 52:31": "Powiedz: \"Oczekujcie! Oto ja jestem razem z wami między tymi, którzy oczekują!\"",
            "verse 52:32": "Czy, nakazują im to ich sny, czy też są oni ludem zbuntowanym?",
            "verse 52:33": "Albo będą mówić: \"On to wymyślił! \" Wcale nie! Oni nie wierzą!",
            "verse 52:34": "Niech więc przytoczą podobne do tego opowiadanie, jeśli mówią prawdę!",
            "verse 52:35": "Czy, oni zostali stworzeni z niczego? Czy oni sami są stwórcami?",
            "verse 52:36": "Czy, oni stworzyli niebiosa i ziemię? Ależ nie! Oni nie są przekonani o prawdzie!",
            "verse 52:37": "Czy oni posiadają skarby twego Pana? Czy też są zarządzającymi?",
            "verse 52:38": "Czy oni posiadają drabinę, na której się przysłuchują? Niech więc przyjdzie ten przysłuchujący się spośród nich z jasną władzą!",
            "verse 52:39": "Czy On posiada córki, a wy macie synów?",
            "verse 52:40": "Czy ty prosisz ich o wynagrodzenie, a oni są obciążeni długiem?",
            "verse 52:41": "Czy, oni posiadają to, co skryte, i zapisują?",
            "verse 52:42": "Czy oni pragną podstępu? Lecz ci, którzy nie wierzą, sami wpadną w zasadzkę.",
            "verse 52:43": "Czy, oni mają jakiegoś boga poza Bogiem? Chwała niech będzie Bogu będącemu ponad to, co Jemu przypisują jako współtowarzyszy!",
            "verse 52:44": "A jeśli oni zobaczą płat nieba spadający, powiedzą: \"To są chmury zebrane w kłęby.\"",
            "verse 52:45": "Przeto pozostaw ich, aż oni spotkają ten swój Dzień, kiedy będą rażeni piorunem;",
            "verse 52:46": "Tego Dnia nie pomoże im nic ich podstęp ani też nie będą wspomożeni.",
            "verse 52:47": "I, zaprawdę, tych, którzy byli niesprawiedliwi, czeka jeszcze inna kara! Lecz większość z nich nie wie.",
            "verse 52:48": "Czekaj więc cierpliwie na rozstrzygnięcie twego Pana! Ty przecież jesteś na Naszych oczach. Wysławiaj chwałę twego Pana, kiedy wstajesz!",
            "verse 52:49": "I nocą wysławiaj Go, i przy zachodzie gwiazd!"
        },
        "Portuguese": {
            "verse 52:1": "Pelo monte (Sinai).",
            "verse 52:2": "Pelo Livro escrito,",
            "verse 52:3": "Em um pergaminho desenrolado.",
            "verse 52:4": "Pelo templo freqüentado.",
            "verse 52:5": "Pelo céu elevado.",
            "verse 52:6": "E pelos oceanos transbordantes.",
            "verse 52:7": "Que o castigo do teu Senhor está iminente.",
            "verse 52:8": "Ninguém pode evitá-lo.",
            "verse 52:9": "(Será) o dia em que o firmamento oscilará energicamente.",
            "verse 52:10": "E as montanhas mover-se-ão rapidamente.",
            "verse 52:11": "Ai, nesse dia, dos desmentidores.",
            "verse 52:12": "Que se houverem dado a veleidades.",
            "verse 52:13": "Será o dia em que se verão violentamente impulsionados para o fogo infernal.",
            "verse 52:14": "(Ser-lhes-á dito): Eis aqui o fogo, que negastes!",
            "verse 52:15": "É isto, acaso, magia, ou não vedes ainda?",
            "verse 52:16": "Entrai aí, porque redundará no mesmo, que o suporteis, quer não. Sabei que sempre sereis recompensados pelo quehouverdes feito.",
            "verse 52:17": "Quanto aos tementes (a Deus), viverão em jardins e em felicidade.",
            "verse 52:18": "Gozando daquilo com que o seu Senhor os houver agraciado; e o seu Senhor os preservará do suplício infernal.",
            "verse 52:19": "(Ser-lhes-á dito): Comei e bebei, com proveito, pelo que (de bom) fizestes!",
            "verse 52:20": "Estarão recostados sobre leitos enfileirados e os casarmos com huris, de olhos maravilhosos.",
            "verse 52:21": "E aqueles que creram, bem como as sua proles, que os seguirem na fé, reuni-los-emos às suas famílias, e não osprivaremos de nada, quanto à sua recompensa merecida. Todo o indivíduo será responsável pelos seus atos!",
            "verse 52:22": "E os proveremos de frutas e carnes, bem como do que lhes apetecer.",
            "verse 52:23": "Aí bridarão de uma taça, cuja bebida não os levará à frivolidade, nem os induzirá ao pecado.",
            "verse 52:24": "E serão servidos por mancebos, formosos como se fossem pérolas em suas conchas.",
            "verse 52:25": "E acercar-se-ão em tertúlias.",
            "verse 52:26": "Dirão: Em verdade, antes estávamos temerosos pelos nossos familiares.",
            "verse 52:27": "Portanto, Deus nos agraciou e nos preservou do tormento do vento abrasador.",
            "verse 52:28": "Porque antes O invocávamos, por ser Ele o Beneficente, o Misericordiosíssimo!",
            "verse 52:29": "Predica-lhes, pois, que, mercê do teu Senhor, não és um adivinho, nem um energúmeno.",
            "verse 52:30": "Ou dirão: É um poeta. Aguardamos que lhe chegue a calamidade, (produzida) pelo tempo!",
            "verse 52:31": "Dize-lhes: Aguardai, que eu também sou um dos que aguardam convosco!",
            "verse 52:32": "São, acaso, suas faculdades mentais que os induzem a isso, ou é que são um povo de transgressores?",
            "verse 52:33": "Dirão ainda: Porventura, ele o tem forjado (o Alcorão)? Qual! Não crêem!",
            "verse 52:34": "Que apresentem, pois, uma mensagem semelhante, se estivermos certos.",
            "verse 52:35": "Porventura, não foram eles criados do nada, ou são eles os criadores?",
            "verse 52:36": "Ou criaram, acaso, os céus e a terra? Qual! Não se persuadirão!",
            "verse 52:37": "Possuem, porventura, os tesouros do teu Senhor, ou são eles os dominadores?",
            "verse 52:38": "Ou possuem alguma escada, para escalar o céu, a fim de detectar ali, os segredos? Que os espreitadores apresentem umaautoridade evidente!",
            "verse 52:39": "Ou pertencem a Ele as filhas e a vós os filhos?",
            "verse 52:40": "Ou lhes exiges, porventura, alguma recompensa, e por isso ficam sobrecarregados de dívidas?",
            "verse 52:41": "Ou pensam estar de posse do incognoscível donde copiam o que dizem?",
            "verse 52:42": "Ou (nem suma), intentam conspirar (contra ti)? Qual! Saibam os incrédulos que serão envolvidos na conspiração!",
            "verse 52:43": "Ou, por fim, têm outra divindade, além de Deus? Glorificado seja Deus, de tudo quanto Lhe associam!",
            "verse 52:44": "E se vissem desabar um fragmento do céu, diriam: São nuvens saturadas!",
            "verse 52:45": "Deixa-os, pois, até que se deparem com o seu dia, em que serão fulminados!",
            "verse 52:46": "Dia esse em que de nada lhes servirão as suas conspirações, nem serão socorridos.",
            "verse 52:47": "Em verdade, os iníquos, além desse, sofrerão outros castigos; porém, a maioria o ignora.",
            "verse 52:48": "E tu (ó Mensageiro), aguarda até ao Dia do Juízo do teu Senhor, porque estás ante Nossos olhos. E glorifica os louvoresdo teu Senhor, quando te levantares,",
            "verse 52:49": "E numa parte da noite, e glorifica-O ao retirarem-se as estrelas."
        },
        "Punjabi": {
            "verse 52:1": "ਸਹੂੰ ਹੈ ਤੂਰ ਦੀ।",
            "verse 52:2": "ਅਤੇ ਲਿਖੀ ਹੋਈ ਕਿਤਾਬ ਦੀ।",
            "verse 52:3": "ਖੁੱਲ੍ਹੇ",
            "verse 52:4": "ਅਤੇ [ਅਕਸਰ] ਅਕਸਰ ਘਰ\" ਦੁਆਰਾ",
            "verse 52:5": "ਅਤੇ [ਦੁਆਰਾ] ਅਕਾਸ਼ ਉੱਚਾ ਹੋਇਆ",
            "verse 52:6": "ਅਤੇ ਖੌਲਦੇ ਹੋਏ ਸਮੁੰਦਰ ਦੀ।",
            "verse 52:7": "ਬੇਸ਼ੱਕ ਤੁਹਾਡੇ ਰੱਬ ਵੱਲੋਂ ਆਫ਼ਤ ਆ ਕੇ ਰਹੇਗੀ।",
            "verse 52:8": "ਉਸ ਨੂੰ ਕੋਈ ਟਾਲਣ ਵਾਲਾ ਨਹੀਂ।",
            "verse 52:9": "ਉਸ ਦਿਨ ਅਸਮਾਨ ਡੋਲੇਗਾ।",
            "verse 52:10": "ਅਤੇ ਪਹਾੜ ਤੁਰਨ ਲੱਗਣਗੇ।",
            "verse 52:11": "ਉਸ ਦਿਨ ਝੁਠਲਾਉਣ ਵਾਲਿਆਂ ਲਈ ਵਿਨਾਸ਼ ਹੈ।",
            "verse 52:12": "ਜਿਹੜੇ ਖੇਡ-ਖੇਡ ਵਿਚ ਗੱਲਾਂ ਬਣਾਉਂਦੇ ਹਨ।",
            "verse 52:13": "ਜਿਸ ਦਿਨ ਉਹ ਨਰਕ ਦੀ ਅੱਗ ਵਿਚ ਧੱਕੇ ਜਾਣਗੇ।",
            "verse 52:14": "ਇਹ ਉਹ ਅੱਗ ਹੈ ਜਿਸ ਤੋਂ ਤੁਸੀਂ ਇਨਕਾਰੀ ਸੀ।",
            "verse 52:15": "ਕੀ ਇਹ ਜਾਦੂ ਹੈ ਜਾਂ ਤੁਹਾਨੂੰ ਦਿਖਾਈ ਨਹੀਂ ਦਿੰਦਾ।",
            "verse 52:16": "ਇਸ ਵਿਚ ਦਾਖ਼ਿਲ ਹੋ ਜਾਉ। ਹੁਣ ਤੁਸੀਂ ਧੀਰਜ ਰੱਖੋ ਜਾਂ ਨਾ ਰੱਖੋਂ ਤੁਹਾਡੇ ਲਈ ਬਰਾਬਰ ਹੈ। ਤੁਸੀਂ ਉਹੀ ਫ਼ਲ ਪਾ ਰਹੇ ਹੋ ਜੋ ਤੁਸੀਂ ਕਰਦੇ ਸੀ।",
            "verse 52:17": "ਬੇਸ਼ੱਕ ਸੰਜਮੀ ਲੋਕ ਬਾਗ਼ਾਂ ਅਤੇ ਨਿਅਮਤਾਂ ਵਿਚ ਹੋਣਗੇ।",
            "verse 52:18": "ਉਹ ਉਨ੍ਹਾਂ ਚੀਜ਼ਾਂ ਨਾਲ ਖੁਸ਼ਹਾਲ ਹੋਣਗੇ ਜਿਹੜੀਆਂ ਉਨ੍ਹਾਂ ਦੇ ਰੱਬ ਨੇ ਦਿੱਤੀਆਂ ਹੋਣਗੀਆਂ ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਰੱਬ ਨੇ ਉਨ੍ਹਾਂ ਨੂੰ ਨਰਕ ਦੀ ਸਜ਼ਾ ਤੋਂ ਬਚਾ ਲਿਆ।",
            "verse 52:19": "ਖਾਉ ਪੀਓ ਅਨੰਦ ਦੇ ਨਾਲ ਆਪਣੇ ਕਰਮਾਂ ਬਦਲੇ।",
            "verse 52:20": "ਸਰ੍ਹਾਣੇ ਲਗਾ ਕੇ ਇੱਕ ਸਮਾਨ ਵਿਛੇ ਤਖਤਾਂ ਤੇ। ਅਤੇ ਅਸੀਂ ਮੋਟੀਆਂ-ਮੋਟੀਆਂ ਅੱਖਾਂ ਵਾਲੀਆਂ ਹੂਰਾਂ ਨਾਲ ਉਨ੍ਹਾਂ ਦਾ ਵਿਆਹ ਕਰ ਦੇਵਾਂਗੇ।",
            "verse 52:21": "ਅਤੇ ਜਿਹੜੇ ਲੋਕ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਔਲਾਦ ਵੀ ਉਨ੍ਹਾਂ ਦੇ ਰਾਹ ਤੇ ਈਮਾਨ ਦੇ ਨਾਲ ਚੱਲੀ, ਉਨ੍ਹਾਂ ਦੇ ਨਾਲ ਅਸੀਂ ਉਨ੍ਹਾਂ ਦੀ ਔਲਾਦ ਨੂੰ ਵੀ ਇੱਕਠਾ ਕਰਾਂਗੇ ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਦੇ ਕਰਮਾਂ ਵਿਚੋਂ ਕੋਈ ਚੀਜ਼ ਘੱਟ ਨਹੀਂ ਕਰਾਂਗੇ। ਹਰੇਕ ਬੰਦਾ ਆਪਣੀ ਕਮਾਈ (ਅਮਲਾਂ) ਵਿਚ ਗਹਿਣੇ ਪਿਆ ਹੈ।",
            "verse 52:22": "ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਦੀ ਪਸੰਦ ਦੇ ਫ਼ਲ ਅਤੇ ਮਾਸ ਉਨ੍ਹਾਂ ਨੂੰ ਲਗਾਤਾਰ ਦਿੰਦੇ ਰਹਾਂਗੇ।",
            "verse 52:23": "ਉਨ੍ਹਾਂ ਦੇ ਵਿਚਕਾਰ ਸ਼ਰਾਬ ਦੇ ਪਿਆਲਿਆਂ ਦੀ ਅਦਲਾ ਬਦਲੀ ਹੋ ਰਹੀ ਹੋਵੇਗੀ। ਜਿਹੜੀ ਬੇਹੁਦਗੀ ਅਤੇ ਪਾਪਾਂ ਤੋਂ ਰਹਿਤ ਹੋਵੇਗੀ।",
            "verse 52:24": "ਅਤੇ ਉਨ੍ਹਾਂ ਦੀ ਸੇਵਾ ਵਿਚ ਬੱਚੇ ਦੌੜਦੇ ਫਿਰਦੇ ਹੋਣਗੇ। ਸਮਝੋ ਉਹ ਸੰਭਾਲ ਕੇ ਰੱਖੇ ਮੋਤੀ ਹਨ।",
            "verse 52:25": "ਉਹ ਇੱਕ ਦੂਸਰੇ ਨੂੰ ਸੰਬੋਧਨ ਹੋ ਕੇ ਗੱਲਾਂ ਕਰਨਗੇ।",
            "verse 52:26": "ਉਹ ਕਹਿਣਗੇ ਕਿ ਅਸੀਂ ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਆਪਣੇ ਘਰਾਂ ਵਿਚ ਡਰਦੇ (ਆਪਣੇ ਰੱਬ ਦੀ ਨਿਰਾਜ਼ਗੀ ਤੋਂ) ਰਹਿੰਦੇ ਸੀ।",
            "verse 52:27": "ਤਾਂ ਅੱਲਾਹ ਨੇ ਸਾਡੇ ਤੇ ਕਿਰਪਾ ਕੀਤੀ ਅਤੇ ਸਾਨੂੰ ਝੁਲਸਾ ਦੇਣ ਵਾਲੀ ਸਜ਼ਾ ਤੋਂ ਬਚਾ ਲਿਆ।",
            "verse 52:28": "ਅਸੀਂ ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਉਸ ਨੂੰ ਪੁਕਾਰਦੇ ਸੀ। ਬੇਸ਼ੱਕ ਉਹ ਵਾਅਦਿਆਂ ਨੂੰ ਪੂਰਾ ਕਰਨ ਵਾਲਾ ਰਹਿਮਤ ਵਾਲਾ ਹੈ।",
            "verse 52:29": "ਸੋ ਤੁਸੀਂ ਉਪਦੇਸ਼ ਕਰਦੇ ਰਹੋ। ਆਪਣੇ ਰੱਬ ਦੀ ਕਿਰਪਾ ਨਾਲ ਤੁਸੀਂ ਨਾ ਭਵਿੱਖ ਬਾਣੀਆਂ ਕਰਨ ਵਾਲੇ ਪਾਖੰਡੀ ਹੋ ਅਤੇ ਨਾ ਦਿਵਾਨੇ।",
            "verse 52:30": "ਕੀ ਉਹ ਕਹਿੰਦੇ ਹਨ ਕਿ ਇਹ ਇੱਕ ਕਵੀ ਹੈ, ਅਸੀਂ ਉਹ ਦੇ ਹੱਕ ਵਿਚ ਕਾਲ ਚੱਕਰ ਦੀ ਉਡੀਕ ਕਰ ਰਹੇ ਹਾਂ।",
            "verse 52:31": "ਆਖੋ, ਕਿ ਉਡੀਕ ਕਰੋ ਮੈਂ ਵੀ ਤੁਹਾਡੇ ਨਾਲ ਉਡੀਕ ਕਰਨ ਵਾਲਿਆਂ ਵਿਚ ਹਾਂ।",
            "verse 52:32": "ਕੀ’ ਇਨ੍ਹਾਂ ਦੀ ਬੁੱਧੀ ਇਨ੍ਹਾਂ ਨੂੰ ਇਹ ਨਹੀਂ ਸਿਖਾਉਂਦੀ ਜਾਂ ਇਹ ਬਾਗ਼ੀ ਲੋਕ ਹਨ।",
            "verse 52:33": "ਕੀ ਉਹ ਕਹਿੰਦੇ ਹਨ ਕਿ ਇਹ ਕੁਰਆਨ ਨੂੰ ਖ਼ੁਦ ਬਣਾ ਲਿਆਇਆ ਹੈ। ਸਗੋਂ ਉਹ ਈਮਾਨ ਨਹੀਂ ਲਿਆਉਣਾ ਚਾਹੁੰਦੇ।",
            "verse 52:34": "ਤਾਂ ਉਹ ਇਸ ਵਰਗੀ ਕੋਈ ਬਾਣੀ ਲੈ ਆਉਣ ਜੇਕਰ ਉਹ ਸੱਚੇ ਹਨ।",
            "verse 52:35": "ਕੀ ਉਹ ਕਿਸੇ ਸਿਰਜਣਹਾਰ ਤੋਂ` ਬਿਨ੍ਹਾਂ ਪੈਦਾ ਹੋ ਗਏ ਜਾਂ ਉਹ ਖ਼ੁਦ ਹੀ ਸਿਰਜਣਹਾਰ ਹਨ।",
            "verse 52:36": "ਕੀ ਧਰਤੀ ਅਤੇ ਆਕਾਸ਼ਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਨੇ ਪੈਦਾ ਕੀਤਾ ਹੈ?ਸਗੋਂ ਉਹ ਭਰੋਸਾ ਨਹੀਂ` ਰੱਖਦੇ।",
            "verse 52:37": "ਕੀ ਇਨ੍ਹਾਂ ਦੇ ਕੋਲ ਤੁਹਾਡੇ ਰੱਬ ਦੇ ਖਜ਼ਾਨੇ ਹਨ ਜਾਂ ਇਹ ਕਿ ਪਹਿਰੇਦਾਰ ਹਨ।",
            "verse 52:38": "ਕੀ ਇਨ੍ਹਾਂ ਦੇ ਕੋਲ ਕੋਈ ਪੌੜੀ ਹੈ ਜਿਸ ਤੇ ਚੜ੍ਹ ਕੇ ਉਹ (ਅੰਬਰੋਂ) ਗੱਲਾਂ ਸੁਣਾਉਂਦੇ ਹਨ। ਤਾਂ ਇਨ੍ਹਾਂ ਨੂੰ ਸੁਣਨ ਵਾਲਾ ਕੋਈ ਪ੍ਰਤੱਖ ਦਲੀਲ ਪੇਸ਼ ਕਰੇ।",
            "verse 52:39": "ਕੀ ਅੱਲਾਹ ਦੇ ਲਈ ਬੇਟੀਆਂ ਹਨ ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਬੇਟੇ।",
            "verse 52:40": "ਕੀ ਤੁਸੀਂ ਇਨ੍ਹਾਂ ਤੋਂ ਮਿਹਨਤਾਨਾਂ ਮੰਗਦੇ ਹੋ, ਕੀ’ ਉਨ੍ਹਾਂ ਤੇ ਤਾਵਾਨ (ਬੱਧੀ ਚੱਟੀ) ਦਾ ਭਾਰ ਪੈ ਰਿਹਾ ਹੈ?ਕੀ ਇਨ੍ਹਾਂ ਦੇ ਕੋਲ ਗੁਪਤ (ਗਿਆਨ) ਹੈ, ਕਿ",
            "verse 52:41": "ਜਾਂ ਉਨ੍ਹਾਂ ਕੋਲ [ਅਦਿੱਖ ਦਾ] ਗਿਆਨ ਹੈ, ਇਸ ਲਈ ਉਹ ਇਸਨੂੰ ਲਿਖਦੇ ਹਨ",
            "verse 52:42": "ਕੀ ਉਹ ਕੋਈ ਛਲ ਕਪਟ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹਨ ਤਾਂ ਅਵੱਗਿਆ ਕਰਨ ਵਾਲੇ ਖੁਦ ਹੀ ਉਸ ਧੋਖੇ ਵਿਚ ਫਸੇ ਹੋਣਗੇ।",
            "verse 52:43": "ਕੀ ਅੱਲਾਹ ਤੋਂ ਬਿਨ੍ਹਾਂ ਇਨ੍ਹਾਂ ਵਾ ਕੋਈ ਹੋਰ ਪੂਜਨੀਕ ਹੈ। ਅੱਲਾਹ ਉਨ੍ਹਾਂ ਦੇ ਬਣਾਏ ਸ਼ਰੀਕਾਂ ਤੋਂ ਪਵਿੱਤਰ ਹੈ।",
            "verse 52:44": "ਅਤੇ ਜੇਕਰ ਉਹ ਆਕਾਸ਼ ਵਿਚ ਕੋਈ ਟੁੱਕੜਾ ਟੁੱਟਦਾ ਹੋਇਆ ਦੇਖਣਗੇ",
            "verse 52:45": "(ਤਾਂ ਉਹ ਕਹਿਣਗੇ ਕਿ ਇਹ ਭਾਰਾ ਬੱਦਲ ਹੈ। 45) ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਛੱਡ ਦਿਉ। ਇੱਥੋਂ ਤੱਕ ਕਿ ਆਪਣੇ ਉਸ ਦਿਨ ਦਾ ਸਾਹਮਣਾ ਕਰਨ, ਜਿਸ (ਦਿਨ) ਇਨ੍ਹਾਂ ਦੇ ਹੋਸ਼ ਉੱਡ ਜਾਣਗੇ।",
            "verse 52:46": "ਜਿਸ ਦਿਨ ਇਨ੍ਹਾਂ ਦੇ ਛਲ ਕਪਟ ਇਨ੍ਹਾਂ ਦੇ ਕੋਈ ਕੰਮ ਨਾ ਆਉਣਗੇ ਅਤੇ ਨਾ ਇਨ੍ਹਾਂ ਨੂੰ ਕੋਈ ਸਹਾਇਤਾ ਮਿਲੇਗੀ।",
            "verse 52:47": "ਅਤੇ ਇਨ੍ਹਾਂ ਜ਼ਾਲਿਮਾਂ ਲਈ ਇਸ ਤੋਂ ਸਿਲ੍ਹਾਂ ਵੀ ਸਜ਼ਾ ਹੈ ਪਰੰਤੂ ਇਨ੍ਹਾਂ ਵਿਚੋਂ ਜ਼ਿਆਦਾਤਰ ਨਹੀਂ ਸਮਝਦੇ।",
            "verse 52:48": "ਅਤੇ ਤੁਸੀਂ ਧਰੀਜ ਦੇ ਸਹਿਤ ਆਪਣੇ ਰੱਬ ਦੇ ਫ਼ੈਸਲੇ ਦੀ ਉਡੀਕ ਕਰੋ। ਬੇਸ਼ੱਕ ਤੁਸੀਂ ਸਾਡੀ ਨਜ਼ਰ ਵਿਚ ਹੋ। ਅਤੇ ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਦੀ ਸਿਫ਼ਤ ਸਲਾਹ ਉਸ ਦੀ ਪ੍ਰਸੰਸਾ ਦੇ ਨਾਲ ਕਰੋ (ਉਸ ਵੇਲੇ) ਜਿਸ ਸਮੇਂ ਤੁਸੀਂ ਉਠਦੇ ਹੋ।",
            "verse 52:49": "ਅਤੇ ਰਾਤ ਨੂੰ ਵੀ ਉਸ ਦੀ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰੋ ਅਤੇ ਤਾਰਿਆਂ ਦੇ ਛਿਪਣ ਸਮੇ ਵੀ।"
        },
        "Roman english": {
            "verse 52:1": "Wat-Toor",
            "verse 52:2": "Wa kitaabim mastoor",
            "verse 52:3": "Fee raqqim manshoor",
            "verse 52:4": "Wal baitil ma`moor",
            "verse 52:5": "Wassaqfil marfoo",
            "verse 52:6": "Wal bahril masjoor",
            "verse 52:7": "Inna `azaaba Rabbika lawaaqi",
            "verse 52:8": "Maa lahoo min daafi",
            "verse 52:9": "Yawma tamoorus samaaa`u mawraa",
            "verse 52:10": "Wa taseerul jibaalu sairaa",
            "verse 52:11": "Fawailuny yawma `izil lil mukaazzibeen",
            "verse 52:12": "Allazeena hum fee khawdiny yal`aboon",
            "verse 52:13": "Yawma yuda`-`oona ilaa naari jahannama da`-`aa",
            "verse 52:14": "Haazihin naarul latee kuntum bihaa tukazziboon",
            "verse 52:15": "Afasihrun haazaaaa am antum laa tubsiroon",
            "verse 52:16": "Islawhaa fasbirooo aw laa tasbiroo sawaaa`un `alaikum innamaa tujzawna maa kuntum ta`maloon",
            "verse 52:17": "Innal muttaqeena fee jannaatinw wa na`eem",
            "verse 52:18": "Faakiheena bimaaa aataahum rabbuhum wa waqaahum rabbuhum `azaabal jaheem",
            "verse 52:19": "Kuloo washraboo haneee `am bimaa kuntum ta`maloon",
            "verse 52:20": "Muttaki`eena `alaa sururim masfoofatinw wa zawwaj naahum bihoorin `een",
            "verse 52:21": "Wallazeena aamanoo wattaba`at hum zurriyyatuhum bieemaanin alhaqnaa bihim zurriyyatahum wa maaa alatnaahum min `amalihim min shai`; kullum ri`im bimaa kasaba raheen",
            "verse 52:22": "Wa amdadnaahum bifaa kihatinw wa lahmim mimmaa yashtahoon",
            "verse 52:23": "Yatanaaza`oona feehaa kaasal laa laghwun feehaa wa laa taaseem",
            "verse 52:24": "Wa yatoofu `alaihim ghilmaanul lahum ka annahum lu`lu`um maknoon",
            "verse 52:25": "Wa aqbala ba`duhum `alaa ba`diny yatasaaa`aloon",
            "verse 52:26": "Qaalooo innaa kunnaa qablu feee ahlinaa mushfiqeen",
            "verse 52:27": "Famannnal laahu `alainaa wa waqaanaa `azaabas samoom",
            "verse 52:28": "Innaa kunnaa min qablu nad`oohu innahoo huwal barrur raheem",
            "verse 52:29": "Fazakkir famaaa anta bini`mati rabbika bikaahininw wa laa majnoon",
            "verse 52:30": "Am yaqooloona shaa`irun natarabbasu bihee raibal manoon",
            "verse 52:31": "Qul tarabbasoo fa innee ma`akum minal mutarabbiseen",
            "verse 52:32": "Am taamuruhum ahlaamuhum bihaazaaa am hum qawmun taaghoon",
            "verse 52:33": "Am yaqooloona taqawwalah; bal laa yu`minoon",
            "verse 52:34": "Falyaatoo bihadeesim misliheee in kaanoo saadiqeen",
            "verse 52:35": "Am khuliqoo min ghairi shai`in am humul khaaliqoon",
            "verse 52:36": "Am khalaqus samaawaati wal ard; bal laa yooqinoon",
            "verse 52:37": "Am`indahum khazaaa`inu rabbika am humul musaitiroon",
            "verse 52:38": "Am lahum sullamuny yastami`oona feehi falyaati mustami`uhum bisultaanim mubeen",
            "verse 52:39": "Am lahul banaatu wa lakumul banoon",
            "verse 52:40": "Am tas`aluhum ajran fahum mim maghramim musqaloon",
            "verse 52:41": "Am `indahumul ghaibu fahum yaktuboon",
            "verse 52:42": "Am yureedoona kaidan fallazeena kafaroo humul makeedoon",
            "verse 52:43": "Am lahum ilaahun ghairul laa; subhaanal laahi `ammaa yushrikoon",
            "verse 52:44": "Wa iny yaraw kisfam minas samaaa`i saaqitany yaqooloo sahaabum markoom",
            "verse 52:45": "Fazarhum hatta yulaaqoo yawmahumul lazee feehi yus`aqoon",
            "verse 52:46": "Yawma laa yughnee `anhum kaidumhum shai`anw wa laa hum yunsaroon",
            "verse 52:47": "Wa inna lillazeena zalamoo `azaaban doona zalika wa laakinna aksarahum laa ya`lamoon",
            "verse 52:48": "Wasbir lihukmi rabbika fa innaka bi-a`yuninaa wa sabbih bihamdi rabbika heena taqoom",
            "verse 52:49": "Wa minal laili fasabbihhu wa idbaaran nujoom"
        },
        "Russian": {
            "verse 52:1": "Клянусь Горою (Откровений),",
            "verse 52:2": "Начертанным Законом (Божьим),",
            "verse 52:3": "Развернутым на свитке,",
            "verse 52:4": "И часто посещаемой молельней,",
            "verse 52:5": "И вознесенным пологом (небесным),",
            "verse 52:6": "И океаном, вздутым (до предела), -",
            "verse 52:7": "Поистине, падет на вас Господне наказанье,",
            "verse 52:8": "Никто не отвратит Его.",
            "verse 52:9": "В тот День, Когда в волнение придет небесный свод",
            "verse 52:10": "И разлетятся горы,",
            "verse 52:11": "Проклятием предстанет этот День для тех, Кто ложью нарекал (Господне Слово), -",
            "verse 52:12": "Для тех, кто тешился в ничтожных мелочах.",
            "verse 52:13": "В тот День (Одним толчком) неодолимым Они повергнуты во пламя Ада будут.",
            "verse 52:14": "И скажут им: \"Вот тот Огонь, Который вы упрямо отвергали!",
            "verse 52:15": "Ужель все это (лишь) дурман Иль не (способны) видеть вы?",
            "verse 52:16": "Горите в нем - не все ль равно, Вы вытерпите или нет сей Огнь! Ведь такова награда за поступки ваши\".",
            "verse 52:17": "А праведникам пребывать в Садах услады,",
            "verse 52:18": "Вкушая то, что даровал им Бог, Избавив их от наказанья Адом.",
            "verse 52:19": "Извольте есть и пить во здравие и пользу, В награду за (хорошие) дела.",
            "verse 52:20": "Там они будут возлежать на ложах, что стоят рядами. И там Мы им в напарницы дадим (Дев) целомудренных с лучистыми (очами).",
            "verse 52:21": "И те, кто (в Господа) уверовал И чьи потомства веру прадедов избрали, Приведены в едины семьи будут. И не убавим ни на йоту Мы Награды за деянья ваши, - Всяк человек - заложник своих дел.",
            "verse 52:22": "Мы одарим их из плодов и мяса тем, К чему лежат их устремленья.",
            "verse 52:23": "Там чашами (любви) обмениваться будут Без пустословья лишнего и всяких побуждений ко греху.",
            "verse 52:24": "Со всех сторон благоприятствовать им будут Прекрасны юноши, что чистотой своей Подобны бережно хранимым жемчугам.",
            "verse 52:25": "Они приблизятся с расспросами друг к другу",
            "verse 52:26": "И молвят: \"В себе несли мы прежде страх Об участи своих родных и близких,",
            "verse 52:27": "Но наш Господь был добр к нам, Избавив нас от наказания самумом.",
            "verse 52:28": "Взывали мы к Нему и раньше, (А здесь душой уверилися в том), Что Он, поистине, всемилостив и благ!\"",
            "verse 52:29": "А потому Аллаху вознеси хвалу, - Ведь лишь по милости Его Неодержим и не провидец ты.",
            "verse 52:30": "Иль возгласят они: \"Поэт! Мы подождем, пока ход времени Обрушит на него свой (приговор) недобрый\".",
            "verse 52:31": "Скажи (им): \"Ждите. А с вами вместе подожду и я\".",
            "verse 52:32": "Быть может, неспособность к разуменью Их побуждает ко сему? Иль, может быть, они те люди, Которые дозволенного грани перешли?",
            "verse 52:33": "Иль говорят они: \"Он это (Откровение) измыслил\". Поистине, не веруют они!",
            "verse 52:34": "А если правду говорят они, Так пусть составят свой рассказ. Подобный этому (Писанью).",
            "verse 52:35": "Из ничего сотворены ль они, Иль сами сотворили все,",
            "verse 52:36": "Иль небеса и землю сотворили сами? Поистине, в них твердой веры нет.",
            "verse 52:37": "Иль в их руках сокровища (познания) Аллаха? Иль они сами правят (ход событий на земле)?",
            "verse 52:38": "Быть может, лестница имеется у них, Поднявшись по которой Они подслушать могут (все секреты неба)? Тогда пускай один из них Предъявит ясное свидетельство сему.",
            "verse 52:39": "Иль только дочери у Бога, У вас же - сыновья?",
            "verse 52:40": "Иль ты, (о Мухаммад!), награды ждешь (от них), Они ж - отягчены долгами?",
            "verse 52:41": "Иль в их руках Незримое, О коем они записи ведут?",
            "verse 52:42": "Или они тебе, (о Мухаммад!), ловушки ставят? Но те, кто Господа отверг, Сам попадет в такую же (ловушку).",
            "verse 52:43": "Или у них другое божество, кроме Аллаха - Хвала Аллаху от всего, Что в сотоварищи Ему Они (так дерзко) прочат!",
            "verse 52:44": "И если бы кусочек неба обрушился на их глазах, То и тогда б они сказали: \"Все это - лишь скопленье облаков\".",
            "verse 52:45": "А потому оставь их (до того мгновенья), Пока они свой День не встретят, Когда они от страха онемеют, -",
            "verse 52:46": "Тот День, Когда их хитрости им не помогут И никакой защиты им не ждать.",
            "verse 52:47": "Поистине, для тех, кто зло творит, Есть кара и помимо этой, Но большинство из них не понимает.",
            "verse 52:48": "А потому ты терпеливо жди указа своего Владыки, - Ведь ты всегда в Деснице Нашей. И на заре, и в бдении (дневном),",
            "verse 52:49": "И ночью возноси Ему хвалу, И в час ухода (на покой) всех звезд."
        },
        "Sindhi": {
            "verse 52:1": "(جبل) طُور جو قسم آھي.",
            "verse 52:2": "۽ لکيل ڪتاب جو (قسم) آھي.",
            "verse 52:3": "جو کُليل ورقن ۾ (لکيل) آھي.",
            "verse 52:4": "۽ آباد گھر جو (قسم) آھي.",
            "verse 52:5": "۽ مٿاھينءَ ڇت جو (قسم) آھي.",
            "verse 52:6": "۽ اُڀامندڙ درياءَ جو (قسم) آھي.",
            "verse 52:7": "ته بيشڪ تنھنجي پالڻھار جو عذاب ضرور ٿيڻو آھي.",
            "verse 52:8": "اُن کي ڪوبه ٽارڻ وارو ڪونھي.",
            "verse 52:9": "جنھن ڏينھن آسمان موج ھڻي چُرندو.",
            "verse 52:10": "۽ جبل چڱيءَ طرح ھلندا.",
            "verse 52:11": "تنھن ڏينھن اُنھن ڪوڙ ڀائيندڙن لاءِ خرابي آھي.",
            "verse 52:12": "جيڪي اَجاين ڳالھين ۾ راند ڪندا آھن.",
            "verse 52:13": "جنھن ڏينھن دوزخ جي باھ ڏانھن ڌڪا ڏيئي روانا ڪبا.",
            "verse 52:14": "(تنھن ڏينھن چئبن ته) ھي اُھا باھ آھي جنھن کي ڪُوڙ ڀائندا ھئو.",
            "verse 52:15": "ھيءُ جادو آھي ڇا يا اوھين نه ٿا ڏسو؟",
            "verse 52:16": "ان ۾ گھڙو پوءِ صبر ڪريو يا صبر نه ڪريو، (ته) اوھان لاءِ ھڪ جھڙي (ڳالھ) آھي، جيڪي اوھين ڪندا ھئو رڳو تنھنجو بدلو اوھان کي ڏنو ويندو.",
            "verse 52:17": "بيشڪ پرھيزگار باغن ۽ نعمتن ۾ ھوندا.",
            "verse 52:18": "جيڪا (نعمت) کين سندن پالڻھار ڏني تنھن سان خوش ھوندا، ۽ (اُنھي ڪري به خوش ھوندا جو) سندن پالڻھار کين دوزخ جي عذاب کان بچايو.",
            "verse 52:19": "(چئبن ته) انھي ڪري جو (چڱا) ڪم ڪندا ھئو مزي سان کائو ۽ پيئو.",
            "verse 52:20": "ھڪ ٻئي جي برابر وڇايلن تختن تي ٽيڪ ڏيئي ويٺل ھوندا، ۽ کين وڏين اکين وارين حورن سان پرڻائينداسون.",
            "verse 52:21": "۽ جن ايمان آندو ۽ سندن اولاد ايمان ۾ سندن رستو ھليا تن سان سندن اولاد کي ملائينداسون ۽ کين سندن عملن مان ڪجھ به نه گھٽائينداسون، سڀڪنھن مڙس جيڪي ڪمايو تنھن ۾ (اُھو پاڻ) ڳه ٿيل آھي.",
            "verse 52:22": "۽ انھن کي ميوو ۽ گوشت جنھن (قسم) مان گھرندا (تنھن مان) پيا ڏينداسون.",
            "verse 52:23": "اُتي شراب جا پيالا ھڪ ٻئي کان پيا وٺندا جنھن ۾ نڪي بڪ بڪ ۽ نڪو گناھ ۾ پوڻ ھوندو.",
            "verse 52:24": "۽ وٽن اھڙا نينگر سندن آس پاس (خدمت لاءِ) پيا ايندا ويندا جو ڄڻڪ اُھي ڍڪيل موتي آھن.",
            "verse 52:25": "۽ اُنھن مان ھڪڙا ٻـين ڏانھن پاڻ ۾ پڇا ڪرڻ ڪرڻ لاءِ مُنھن ڪندا.",
            "verse 52:26": "چوندا ته بيشڪ اسين ھن کان اڳ پنھنجي گھر وارن ۾ ڊڄندڙ ھئاسون.",
            "verse 52:27": "پوءِ الله اسان تي احسان ڪيو ۽ اسان کي دوزخ جي عذاب کان بچايائين.",
            "verse 52:28": "بيشڪ اسين ھن کان اڳ کيس سڏيندا ھواسون، بيشڪ اُھوئي اِحسان ڪندڙ مھربان آھي.",
            "verse 52:29": "پوءِ (اي پيغمبر کين) نصيحت ڪر جو تون پنھنجي پالڻھار جي فضل سان نڪي ڀُوپُو آھين ۽ نڪي چريو آھين.",
            "verse 52:30": "بلڪ چوندا آھن ڇا ته شاعر آھي (۽ اسين) سندس حق ۾ زماني جي ڦير گھير اچڻ جا منتظر آھيون.",
            "verse 52:31": "(انھن ڪافرن کي) چؤ ته اوھين به انتظار ڪڍو جو بيشڪ آءٌ به اوھان سان انتظار ڪڍندڙ آھيان.",
            "verse 52:32": "کين سندن عقل اھو ڏس ڏيندا آھن ڇا يا اُھي شرارتي قوم آھي.",
            "verse 52:33": "چوندا آھن ڇا ته ھِن قرآن کي پاڻون بڻايو اٿس، بلڪ ايمان نه ٿا آڻين.",
            "verse 52:34": "پوءِ (کين) جڳائي ته جيڪڏھن سچا آھن ته اُن جھڙو ڪو سخن (بڻائي) آڻين.",
            "verse 52:35": "اھي بي سبب (پاڻھي) پيدا ٿي پيا آھن ڇا يا اُھي (پاڻ) پيدا ڪندڙ آھن؟",
            "verse 52:36": "آسمانن ۽ زمين کي بڻايو اٿن ڇا، بلڪ اُھي يقين نه ٿا آڻين.",
            "verse 52:37": "تنھنجي پالڻھار جا خزانا انھن وٽ آھن ڇا يا اُھي داروغا آھن؟",
            "verse 52:38": "کين ڪا ڏاڪڻ آھي ڇا جنھن تي (چڙھي) ڪن ڏئي ٻڌندا آھن؟ پوءِ جڳائي ته اُنھن مان ٻُڌندڙ ڪو پڌرو دليل آڻي.",
            "verse 52:39": "الله کي ڌيئر آھن ڇا ۽ اوھان کي پُٽ؟",
            "verse 52:40": "اُنھن کان مزوري گھرين ٿو ڇا؟ جو اُھي (اُنھيءَ) چٽيءَ کان ڳوري بار (ھيٺ) ٿيا آھن.",
            "verse 52:41": "اُنھن وٽ ڳُجھ جو علم آھي ڇا جو اُھي لکندا آھن.",
            "verse 52:42": "ڪا بڇڙي رٿ ڪرڻ گھرندا آھن ڇا؟ پوءِ جن ڪُفر ڪيو سي ئي فريب ۾ پيل آھن.",
            "verse 52:43": "انھن لاءِ الله کانسواءِ (ٻيو) ڪو عبادت جو لائق آھي ڇا؟ (ساڻس) جيڪو شريڪ مقرر ڪندا آھن تنھن کان الله پاڪ آھي.",
            "verse 52:44": "۽ جيڪڏھن آسمان مان ڪو ٽڪرو ڪرندڙ ڏسندا ته چوندا ته گھاٽو ڪَڪر آھي.",
            "verse 52:45": "پوءِ (اي پيغمبر) اُنھن کي ايستائين ڇڏي ڏي جيستائين پنھنجو اُھو ڏينھن ڏسن جنھن ۾ بيھوش ڪيو ويندن.",
            "verse 52:46": "جنھن سندن فريب ڪجھ به نه ٽاريندو ۽ نڪي کين مدد ڏبي.",
            "verse 52:47": "۽ بيشڪ ظالمن لاءِ ھن کانسواءِ ٻيو عذاب (به) آھي پر اُنھن مان گھڻا نه ڄاڻندا آھن.",
            "verse 52:48": "۽ (اي پيغمبر) تون پنھنجي پالڻھار جي حُڪم (اچڻ) تائين صبر ڪر ڇوته تون اسان جي نظر ھيٺ آھين ۽ جنھن مھل تون اُٿين (تنھن مھل) پنھنجي پالڻھار جي ساراھ سان پاڪائي بيان ڪر",
            "verse 52:49": "۽ ڪجھ رات جو (به) سندس پاڪائي بيان ڪر ۽ ستارن جي لھڻ کانپوءِ (به)."
        },
        "Sinhalese": {
            "verse 52:1": "තූර් කන්ද මත දිවුරමින්;",
            "verse 52:2": "ලියන ලද ග්‍රන්ථය මත දිවුරමින්;",
            "verse 52:3": "දිගු හරින ලද ලේඛණයෙහි;",
            "verse 52:4": "බයිතුල් මඃමූර් මත දිවුරමින්;",
            "verse 52:5": "ඉහළට ඔසවන ලද වියන මත දිවුරමින්;",
            "verse 52:6": "ගිනි මොළවනු ලබන මුහුද මත දිවුරමින්;",
            "verse 52:7": "නියත වශයෙන්ම නුඹගේ පරමාධිපතිගේ දඬුවම සිදුවන්නක්මය.",
            "verse 52:8": "එය වළක්වන කිසිවෙකු නැත.",
            "verse 52:9": "එදින අහස දරුණු ලෙස කැරකෙමින් පවතී.",
            "verse 52:10": "තවද කඳු දරුණු ලෙස විතැන් මෙවින් පවතී.",
            "verse 52:11": "බොරු කළවුනට එදින විනාශයයි.",
            "verse 52:12": "ඔවුහු වනාහි (පුහු කටයුතු වල) නිරත ව කෙළිලොල් කරමින් සිටින්නෝ වෙති.",
            "verse 52:13": "එදින නිරයේ ගින්න වෙත (දක්කාගෙන යමින්) වැරෙන් තල්ලු කරනු ලැබේ.",
            "verse 52:14": "“නුඹලා බොරු කරමින් සිටි ගින්න මෙයයි”",
            "verse 52:15": "මෙය හූනියමක් ද? එසේ නැතහොත් නුඹලා නොදකින්නෙහු ද?",
            "verse 52:16": "නුඹලා එහි පිවිස දැවෙනු. එවිට නුඹලා ඉවසා විඳ දරා ගත්ත ද නොඉවසුව ද නුඹලාට එක සමානය. නියත වශයෙන්ම නුඹලාට ප්‍රතිඵල පිරිනමනු ලබනුයේ නුඹලා සිදු කරමින් සිටි දෑ සඳහාය.",
            "verse 52:17": "නියත වශයෙන්ම බිය බැතිමතුන් (ස්වර්ග) උයන්හි හා සැප පහසුකම් හි සිටින්නෝය.",
            "verse 52:18": "ඔවුන්ගේ පරමාධිපති ඔවුනට පිරිනැමූ දෑ පිළිබඳ ව සතුටු වන්නන් ලෙස සිටින්නෝය. තවද ඔවුන්ගේ පරමාධිපති නිරයේ දඬුවමින් ඔවුන් ආරක්ෂා කළේය.",
            "verse 52:19": "නුඹලා (මෙලොව) සිදු කරමින් සිටි දෑ හේතුවෙන් සතුටින් අනුභව කරනු. තවද පානය කරනු.(යැයි පවසනු ලැබේ.)",
            "verse 52:20": "පෙළට තබන ලද ඇඳන් මත හාන්සිවෙමින් (සිටිති). තවද අපි ඔවුනට හූරුන් ඊන් (හෙවත් දැකුම් කලු යුවතියන්) සරණපාවා දෙන්නෙමු.",
            "verse 52:21": "තවද කවුරුන් දේවත්වය විශ්වාස කොට ඔවුන්ගේ පරපුර ද විශ්වාසයෙන් යුතු ව ඔවුන්ව අනුගමනය කළවුන් වනාහි ඔවුන්ගේ පරපුර අපි ඔවුන් සමග එක් කරන්නෙමු. තවද ඔවුන්ගේ ක්‍රියාවෙන් අපි ඔවුනට කිසිවක් අඩු නොකරන්නෙමු. සෑම පුද්ගලයකුම ඔහු උපයා ගත් දෑට ඇපයක් ලෙස සිටින්නේය.",
            "verse 52:22": "තවද ඔවුන් ප්රිය කරන දැයින් පලතුරු හා මාංශ අපි ඔවුනට සපයන්නෙමු.",
            "verse 52:23": "ඔවුහු එහි (පැන්) කුසලාන හුවමාරු කර ගනිති. කිසිදු නිෂ්ඵල දැයක් හෝ පාපයට පෙළඹවීමක් හෝ එහි නැත.",
            "verse 52:24": "තවද ඔවුන් වෙනුවෙන් (සේවයේ නිරත) සිටින ළමුන් ඔවුන් වටා යති. නියත වශයෙන්ම ඔවුහු සුරක්ෂා කරන ලද මුතු මෙන් වෙති.",
            "verse 52:25": "ඔවුන්ගෙන් ඇතැමෙක් ඇතැමෙකු වෙතට මුහුණලමින් එකිනෙකා විමසා ගනිති.",
            "verse 52:26": "“මීට පෙර නියත වශයෙන්ම අපි අපගේ පවුල සම්බන්ධයෙන් බියට පත්වන්නන් ලෙස සිටියෙමු” යැයි ඔවුහු පවසති.",
            "verse 52:27": "“එවිට අල්ලාහ් අප වෙත උපකාර කළේය. තවද පිලිස්සෙන ගින්නේ වේදනාවෙන් ඔහු අප මුදවා ගත්තේය.”",
            "verse 52:28": "“නියත වශයෙන්ම අපි පෙර සිටම ඔහුට අයැදිමින් සිටියෙමු. නියත වශයෙන්ම ඔහුමය උපාකාරශීලී; මහා කරුණාවන්ත.”",
            "verse 52:29": "එහෙයින් (නබිවරය!) නුඹ මෙනෙහි කරනු. නුඹේ පරමාධිපතිගේ ආශිර්වාදයෙන් නුඹ ජ්‍යෝතිෂ්‍ය වේදියකු හෝ උම්මත්තකයකු හෝ නොවේ.",
            "verse 52:30": "“එසේ නැතහොත් ඔහු කවියෙකි. කාලයාගේ ඇවෑම (ඔහු විනාශ කරනු ඇතැයි) අපි ඔහු ගැන බලාපොරොත්තු වන්නෙමු” යැයි ඔවුහු පවසන්නෝ ද?",
            "verse 52:31": "“නුඹලා බලාපොරොත්තුවෙන් සිටිනු. එවිට නියත වශයෙන්ම මම ද නුඹලා සමඟ බලාපෙරොත්තු වන්නන් අතරින් වෙමි” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 52:32": "එසේ නැතහොත් ඔවුන්ගේ සිතුවිලි ඔවුනට මේ ගැන නියෝග කරන්නේ ද? එසේ නැතහොත් ඔවුහු සීමාව ඉක්මවා ගිය පිරිසක් ද?",
            "verse 52:33": "එසේ නැතහොත් “මෙය ඔහු ගෙතුවේයැ”යි ඔවුහු පවසන්නෝ ද? එසේ නොව ඔවුහු විශ්වාස නොකරති.",
            "verse 52:34": "ඔවුන් සත්‍යවාදීන් ලෙස සිටියෙහු නම් මේ හා සමාන ප්‍රකාශයක් ඔවුහු ගෙන ආ යුතුය.",
            "verse 52:35": "එසේ නැතහොත් කිසිවක් නොමැති ව ඔවුන් මවනු ලැබුවෝ ද? එසේ නැතහොත් මවන්නෝ ඔවුහු ද?",
            "verse 52:36": "එසේ නැතහොත් ඔවුහු අහස් හා මහපොළොව මැව්වෝද? එසේ නොව ඔවුහු තරයේ විශ්වාස නොකරති.",
            "verse 52:37": "එසේ නැතහොත් ඔවුන් අබියස නුඹගේ පරමාධිපතිගේ භාණ්ඩාගාර තිබේ ද? එසේ නැතහොත් (ඒ මත) ආධිපත්‍යය දරන්නෝ ඔවුහු ද?",
            "verse 52:38": "නැත්නම් ඔවුන්ට ඉණිමගක් තිබී එහි (අහසේ දේව පණිවිඩවලට) ඇහුම්කන් දෙත්ද? එසේ නම් ඔවුන්ගෙන් සවන්දෙන්නා පැහැදිලි සාධකයක් ගෙනෙත්වා!",
            "verse 52:39": "එසේ නැතහොත් (අල්ලාහ් වන) ඔහුට දූවරුන් වී නුඹලාට (පමණක්) පුතුන් වීද?",
            "verse 52:40": "එසේ නැතහොත් නුඹ ඔවුන්ගෙන් යම්කිසි කුලියක් ඉල්ලන්නෙහි ද? ඒ හේතුවෙන් ඔවුහු ණය බර උසුලන්නෝ ද?",
            "verse 52:41": "එසේ නැතහොත් ඔවුන් අබියස අදෘශ්යමාන දෑ (පිළිබඳ ඥානය) තිබී ඔවුහු සටහන් කරන්නෝ ද?",
            "verse 52:42": "එසේ නැතහොත් ඔවුහු කුමන්ත්‍රණයක් (නුඹට එරෙහිව කිරීමට) අදහස් කරන්නෝ ද? දේවත්වය ප්‍රතික්ෂේප කළවුන් වන ඔවුහුමය කුමන්ත්‍රණයේ හසු වී සිටින්නෝ.",
            "verse 52:43": "එසේ නැතහොත් අල්ලාහ්ගෙන් තොර ව (වෙනත්) දෙවිඳෙකු ඔවුනට සිටිත් ද? ඔවුන් ආදේශ තබන දැයින් අල්ලාහ් සුවිශුද්ධය.",
            "verse 52:44": "තවද අහසින් කැබැල්ලක් වැටෙනු ඔවුහු දුටුවා වුවද (ඒවා) ගොඩගැසුනු වලාකුළු සමූහයක් යැයි ඔවුහු පවසති.",
            "verse 52:45": "එහෙයින් එහි ඔවුන් විනාශ කරනු ලබන ඔවුන්ගේ දිනය ඔවුන් හමු වන තෙක් (නබිවරය!) නුඹ ඔවුන් අතහැර දමනු.",
            "verse 52:46": "එදින ඔවුන්ගේ කුමන්ත්‍රණය ඔවුනට කිසිවකින් ප්‍රයෝජනවත් නොවෙයි. තවද ඔවුහු උදව් කරනු නොලබති.",
            "verse 52:47": "තවද නියත වශයෙන්ම අපරාධ කළවුනට ඒ හැර තවත් දඬුවමක් ඇත. නමුත් ඔවුන්ගෙන් බහුතරයක් දෙනා නොදනිති.",
            "verse 52:48": "තවද (නබිවරය!) නුඹගේ පරමාධිපතිගේ නියෝගය උදෙසා ඉවසා සිටිනු. මන්ද නියත වශයෙන්ම නුඹ සිටිනුයේ අපගේ අධීක්ෂණය යටතේය. තවද නුඹ අවදි වන අවස්ථාවේ නුඹගේ පරමාධිපතිගේ ප්‍රශංසා ව තුළින් නුඹ සුවිශුද්ධ කරනු.",
            "verse 52:49": "තවද රාත්‍රියෙහි ද තරු බැස යන අවස්ථාවෙහි ද නුඹ ඔහු සුවිශුද්ධ කරනු."
        },
        "Somali": {
            "verse 52:1": "(Eebe wuxuu ku dhaartay) Dhuurisiina.",
            "verse 52:2": "Iyo Kitaabka la dhigay,",
            "verse 52:3": "Oo ku qoran warqado la fidiyay.",
            "verse 52:4": "Iyo Gurigii cammirraa (Beytulmacmuur).",
            "verse 52:5": "IYo saanqaafka la koryeelay (cirka).",
            "verse 52:6": "Iyo Baddii la kululeeyay.",
            "verse 52:7": "Ee caddibaadda Eebe waa wax dhici (sugan).",
            "verse 52:8": "wax celinna ma jiro.",
            "verse 52:9": "Waxay dhici caddibaaddaas Maalinta Samadu wareegi.",
            "verse 52:10": "Buuruhuna socon.",
            "verse 52:11": "Halaagna waxaa iska leh maalintaas kuwa xaqa beeniyay.",
            "verse 52:12": "Ee ah kuwa tiimbashada xumaanta ku dhex ciyaari.",
            "verse 52:13": "Maalinta Naarta xoog loogu tuurina (waxa lagu dhihi).",
            "verse 52:14": "Waatan Naartii aad beenin jirteen.",
            "verse 52:15": "Ma sixirbaa, mase waxbaydaan arkayn.",
            "verse 52:16": "Gala, ama samra ama ha samrine, waa isugu kiin mid, waxaa uun laydinka abaalmarin waxaad camal falayseen.",
            "verse 52:17": "Kuwa Eebe ka dhawrsaday waxay gali Jannooyin iyo Nicmo.",
            "verse 52:18": "Iyaga oo ku raaxaysan waxa Eebe siiyay, Eebohoodna wuxuu ka dhawray caddibaadda Jaxiiimo.",
            "verse 52:19": "(Waxaana lagu dhihi) cuna oo cabba idinkoo shifaysan camalkiinnii dartiis.",
            "verse 52:20": "Idinkoo ku dangiiga Sariiro la safay, waxaanna (Eebe) u guurin Haween Janno (Xuuralcayn).",
            "verse 52:21": "Kuwa xaqa rumeeyay ee carurtooduna Iimaanka ka raacday waxaannu haleeshiin carruurtooda (Darajada iyo naxariista), camalkoodana waxba kama nusqaaminayno, Ruuxwalbana wuxuu kasbaday yuu u rahmanaan «u xidhnaani».",
            "verse 52:22": "waxaannu u badinnay faakiho iyo Hilib oo ah waxay jecelyihiin.",
            "verse 52:23": "Waxayna isku siin Jannada dhexdeeda (iyagoo sheekeysan) Weel (Macaan) kabuuxo, oon hadal xun iyo dambi midna lahayn.",
            "verse 52:24": "Waxaana u adeegi wiilal aad moodo Jawhar la dhawray.",
            "verse 52:25": "Qaarkood (ehlu-Jannaha) yaa qaarka kale qaabila iyagoo wax is waydiin.",
            "verse 52:26": "Waxayna isu dheheen waxaan ahayn horay Adduunkii kuwo ehelkoodii dhexdiisa ku cabsada.",
            "verse 52:27": "Eebaase nagu mannaystay (dambi dhaaf), wuxuuna naga dhawray caddibaadda Samuumka (Jahannama).",
            "verse 52:28": "Waxaan ahayn horay kuwo barya Eebe, Ilaahayna waa Baarrii naxariista.",
            "verse 52:29": "Ee waani (Nabiyow dadka), nicmada darteed ma tihid wax sheege iyo waalane midnee.",
            "verse 52:30": "Mise waxay dhihi waa gabayaa ee aan la sugno Geerida.",
            "verse 52:31": "Waxaad dhahdaa suga anna waan idin la sugiye.",
            "verse 52:32": "Mise caqligooda (xun) yaa saas faray, ma aha ee waa Qoom xadgudbay.",
            "verse 52:33": "Mise waxaydhihi isagaa abuurtay (Quraanka) waxba ma ayan rumeynin.",
            "verse 52:34": "Ha la yimaadeen hadal la mid ah hadday Run sheegi.",
            "verse 52:35": "Mise waxaa la abuuray abuure la'aan, mise iyagaa abuuray (naftooda).",
            "verse 52:36": "Mise iyagaa Samaawaadka iyo Dhulka abuuray, saas ma aha ee wax ma ayan yaqiininin.",
            "verse 52:37": "Mise agtoodaa khayraadka Eebe yaallaa, Mise iyagaa xisaabin dadka.",
            "verse 52:38": "Mise waxay leeyihiin Sallaan ay wax ku Dhageeystaan, ha la yimaado kooda wax dhaagaystay xujo cad.",
            "verse 52:39": "Mise Eebaa Gabdho u sugnaaday idinkana wiilal.",
            "verse 52:40": "Mise waxaad warsan Nabiyow ujuuro, oo markaas ku cuslaatay.",
            "verse 52:41": "Mise waxa maqanbaa agtooda ah oo ay qoraan.",
            "verse 52:42": "Mise Dhagar Bay Rabaan, kuwa gaaloobay iyagaa dhakran.",
            "verse 52:43": "Mise Ilaah Eebe ka soo hadlay leeyhiin, Eebaa ka fog waxay la wadaajiyeen «Ilaah-nimada».",
            "verse 52:44": "Hadday arkaan goosin ka mid ah Samada oo soo dhacaysa waxay odhan waa Daruuro is dulsaaran (madax adayg dartiis).",
            "verse 52:45": "Ee iskaga tag Nabiyow intay kala kulmaan maalinta dhexdeeda lagu halaagi doono.",
            "verse 52:46": "Maalinta ayan dhagartoodu wax u taraynin wax u gargaarana uusan jirin.",
            "verse 52:47": "Kuwa xad gudbay waxaa u sugnaaday caddibaad ka sokaysa (Qiyaamada), laakiin badankoodu ma oga.",
            "verse 52:48": "Ee ku samir xukunka Eebahaa (Nabiyow) annagaa ku ilaalinaynee, kuna; tasbiixso oo ku mahadi Eebahaa markaad kici.",
            "verse 52:49": "Habeenka qaarkiisna tuko, iyo marka xiddiguhu jeedsadaan."
        },
        "Spanish": {
            "verse 52:1": "Por el Monte!",
            "verse 52:2": "Por un Libro escrito",
            "verse 52:3": "en un pergamino desenrollado!",
            "verse 52:4": "Por la Casa Visitada!",
            "verse 52:5": "Por el techo elevado!",
            "verse 52:6": "Por el mar rebosante!",
            "verse 52:7": "Que el castigo de tu Señor ha de ocurrir",
            "verse 52:8": "y no habrá quien lo pueda impedir",
            "verse 52:9": "El día en que el cielo se agite en sacudidas",
            "verse 52:10": "y las montañas echen a andar.",
            "verse 52:11": "Ay! ese día de los que negaron la verdad.",
            "verse 52:12": "Esos que, confundidos, jugaban.",
            "verse 52:13": "El día que sean empujados al fuego de Yahannam con desprecio:",
            "verse 52:14": "Este es el Fuego cuya realidad negabais.",
            "verse 52:15": "Es magia o es que vosotros no veis?",
            "verse 52:16": "Entrad en él, es igual que tengáis o que no tengáis paciencia.Sólo se os pagará por lo que hicisteis.",
            "verse 52:17": "Los temerosos estarán en jardines y deleite,",
            "verse 52:18": "disfrutando de lo que su Señor les dé.Su Señor los habrá librado del castigo del Yahim.",
            "verse 52:19": "Comed y bebed en perfecto bienestar por lo que hicisteis!",
            "verse 52:20": "Estarán reclinados sobre divanes alineados y los desposaremos con las de ojos hermosísimos.",
            "verse 52:21": "Y a quienes hayan creído y su descendencia los haya seguido en la creencia, los juntaremos con ellos y no habrá ningún menoscabo de sus acciones.Cada hombre es rehén de lo que se forjó.",
            "verse 52:22": "Los colmaremos de frutos y carne de la que apetezcan.",
            "verse 52:23": "Allí, se pasarán unos a otros una copa en la que no habrá ni frivolidad ni maldad.",
            "verse 52:24": "E irán pasando en torno a ellos mancebos como las perlas semiocultas.",
            "verse 52:25": "Y se encontrarán frente a frente haciéndose preguntas.",
            "verse 52:26": "Dirán: Antes, cuando estábamos entre los nuestros, fuimos temerosos.",
            "verse 52:27": "Y Allah nos ha favorecido y nos ha librado del castigo del Simún.",
            "verse 52:28": "Es verdad que antes le rogábamos y que Él es el Bondadoso, el Compasivo.",
            "verse 52:29": "Así pues, llama al recuerdo que, por el favor de tu Señor, tú no eres ni un adivino ni un poseso.",
            "verse 52:30": "O es que acaso dicen? Es un poeta, aguardemos que le llegue su hora.",
            "verse 52:31": "Di: Esperad que yo también esperaré con vosotros.",
            "verse 52:32": "Son sus sueños los que les mandan esto o sólo son gente que se excede?",
            "verse 52:33": "O es que dicen? Se lo ha inventado. Pero no, es que no creen.",
            "verse 52:34": "Que traigan un relato semejante, si es verdad lo que dicen.",
            "verse 52:35": "O es que acaso han sido creados espontáneamente o se han creado a sí mismos?",
            "verse 52:36": "O han creado los cielos y la tierra?Por el contrario; no tienen certeza.",
            "verse 52:37": "O es que son los dueños de los tesoros de tu Señor o poseen la soberanía?",
            "verse 52:38": "O es que tienen una escalera desde la que escuchan?El que de ellos lo haga que traiga una prueba clara.",
            "verse 52:39": "O acaso tiene Él hijas mientras que los hijos son para vosotros?",
            "verse 52:40": "O es que les pides algún pago y tal impuesto los tiene agobiados?",
            "verse 52:41": "O tienen delante el No-Visto y pueden tomar nota?",
            "verse 52:42": "O es que quieren tender una trampa? Porque son los que se niegan a creer los que han caído en una trampa.",
            "verse 52:43": "No será que tienen otro dios que no es Allah?Gloria a Allah por encima de lo que Le asocian!",
            "verse 52:44": "Si vieran un trozo de cielo cayéndose dirían: Es una acumulación de nubes.",
            "verse 52:45": "Déjalos hasta que se encuentren con su día, ése en el que han de caer muertos.",
            "verse 52:46": "El día en que su maquinación no les sirva de nada ni tengan quien los auxilie.",
            "verse 52:47": "Y por cierto que los que fueron injustos tendrán antes que eso un castigo, sin embargo la mayoría de ellos no sabe.",
            "verse 52:48": "Espera con paciencia el juicio de tu Señor porque realmente tu estás bajo Nuestros ojos.Y glorifica a tu Señor con Su alabanza cuando te levantes.",
            "verse 52:49": "Y glorifícalo durante parte de la noche, así como al ocultarse las estrellas."
        },
        "Swahili": {
            "verse 52:1": "Naapa kwa mlima wa T'ur,",
            "verse 52:2": "Na Kitabu kilicho andikwa",
            "verse 52:3": "Katika ngozi iliyo kunjuliwa,",
            "verse 52:4": "Na kwa Nyumba iliyo jengwa,",
            "verse 52:5": "Na kwa dari iliyo nyanyuliwa,",
            "verse 52:6": "Na kwa bahari iliyo jazwa,",
            "verse 52:7": "Hakika adhabu ya Mola wako Mlezi hapana shaka itatokea.",
            "verse 52:8": "Hapana wa kuizuia.",
            "verse 52:9": "Siku zitakapo tikisika mbingu kwa mtikiso,",
            "verse 52:10": "Na milima iwe inakwenda kwa mwendo mkubwa.",
            "verse 52:11": "Basi ole wao siku hiyo hao wanao kadhibisha,",
            "verse 52:12": "Ambao wanacheza katika mambo ya upuuzi.",
            "verse 52:13": "Siku watapo sukumwa kwenye Moto kwa msukumo wa nguvu,",
            "verse 52:14": "(Waambiwe): Huu ndio ule Moto mlio kuwa mkiukanusha!",
            "verse 52:15": "Je! Huu ni uchawi, au hamwoni tu?",
            "verse 52:16": "Uingieni, mkistahamili au msistahamili - ni mamoja kwenu. Hakika mnalipwa kwa mliyo kuwa mkiyatenda.",
            "verse 52:17": "Hakika wachamngu watakuwa katika Mabustani na neema,",
            "verse 52:18": "Wakifurahi kwa yale aliyo wapa Mola wao Mlezi. Na Mola wao Mlezi atawalinda na adhabu ya Motoni.",
            "verse 52:19": "Kuleni na kunyweni kwa raha kabisa kwa sababu ya mliyo kuwa mkiyatenda.",
            "verse 52:20": "Watakuwa wameegemea juu ya viti vya enzi vilivyo pangwa kwa safu. Na tutawaoza mahuru-l-aini.",
            "verse 52:21": "Na walio amini na dhuriya zao wakawafuata kwa Imani tutawakutanisha nao dhuriya zao, na wala hatutawapunja hata kidogo katika vitendo vyao. Kila mtu lazima atapata alicho kichuma.",
            "verse 52:22": "Na tutawapa matunda, na nyama kama watavyo penda.",
            "verse 52:23": "Watapeana humo bilauri zisio na vinywaji vya kuleta maneno ya upuuzi wala dhambi.",
            "verse 52:24": "Iwe wanawapitia watumishi wao kama kwamba ni lulu zilizomo katika chaza.",
            "verse 52:25": "Wataelekeana wakiulizana.",
            "verse 52:26": "Waseme: Tulikuwa zamani pamoja na ahali zetu tukiogopa;",
            "verse 52:27": "Basi Mwenyezi Mungu akatufanyia hisani na akatulinda na adhabu ya upepo wa Moto.",
            "verse 52:28": "Hakika sisi zamani tulikuwa tukimwomba Yeye tu. Hakika Yeye ndiye Mwema Mwenye kurehemu.",
            "verse 52:29": "Basi kumbusha! Kwani wewe, kwa neema ya Mola wako Mlezi, si kuhani wala mwendawazimu.",
            "verse 52:30": "Au wanasema: Huyu ni mtunga mashairi, tunamtarajia kupatilizwa na dahari.",
            "verse 52:31": "Sema: Tarajieni, na mimi pia ni pamoja nanyi katika kutarajia.",
            "verse 52:32": "Au hizo akili zao ndio zinawaamrisha haya, au wao basi ni watu majeuri tu?",
            "verse 52:33": "Au ndio wanasema: Ameitunga hii! Bali basi tu hawaamini!",
            "verse 52:34": "Basi nawalete masimulizi kama haya ikiwa wao wanasema kweli.",
            "verse 52:35": "Au wao wameumbwa pasipo kutokana na kitu chochote, au ni wao ndio waumbaji?",
            "verse 52:36": "Au wao wameziumba mbingu na ardhi? Bali hawana na yakini.",
            "verse 52:37": "Au wanazo khazina za Mola wako Mlezi au wao ndio wenye madaraka?",
            "verse 52:38": "Au wanazo ngazi za kusikilizia? Basi huyo msikilizaji wao na alete hoja ilio wazi!",
            "verse 52:39": "Au Yeye Mwenyezi Mungu ana wasichana, na nyinyi ndio mna wavulana?",
            "verse 52:40": "Au wewe unawaomba ujira, na kwa hivyo ndio wanaelemewa na uzito wa gharama?",
            "verse 52:41": "Au wanayo ilimu ya ghaibu, nao wameandika?",
            "verse 52:42": "Au wanataka kufanya vitimbi tu? Lakini hao walio kufuru ndio watakao tegeka.",
            "verse 52:43": "Au wanae mungu asiye kuwa Mwenyezi Mungu? Subhanallah! Ametaksika Mwenyezi Mungu na hao wanao washirikisha naye.",
            "verse 52:44": "Na hata wange ona pande linatoka mbinguni linaanguka wange sema: Ni mawingu yaliyo bebana.",
            "verse 52:45": "Basi waache mpaka wakutane na siku yao watakapo hilikishwa.",
            "verse 52:46": "Siku ambayo hila zao hazitawafaa hata kidogo, wala wao hawatanusuriwa.",
            "verse 52:47": "Na hakika walio dhulumu watapata adhabu nyengine isiyo kuwa hii, lakini wengi wao hawajui.",
            "verse 52:48": "Na ingojee hukumu ya Mola wako Mlezi. Kwani wewe hakika uko mbele ya macho yetu, na mtakase kwa kumsifu Mola wako Mlezi unapo simama,",
            "verse 52:49": "Na usiku pia mtakase, na zinapo kuchwa nyota."
        },
        "Swedish": {
            "verse 52:1": "VID SINAI berg!",
            "verse 52:2": "Vid [den heliga] Skriften,",
            "verse 52:3": "nedtecknad på öppna ark!",
            "verse 52:4": "Vid Helgedomen, ständigt fylld av besökare!",
            "verse 52:5": "Vid [himlens] höga valv!",
            "verse 52:6": "Vid havet och dånet [av dess bränningar]!",
            "verse 52:7": "DIN Herres straff skall helt visst bli verklighet;",
            "verse 52:8": "ingen kan hindra det!",
            "verse 52:9": "[Det skall bli verklighet] den Dag då himlen skälver i ett häftigt skalv",
            "verse 52:10": "och bergen sätter sig i rörelse.",
            "verse 52:11": "Förlorade denna Dag är de som kallade allt för lögn,",
            "verse 52:12": "de som roade sig med tomt prat [och glömde evigheten];",
            "verse 52:13": "den Dag då de skall störtas ned i helvetets eld och [en röst säger:]",
            "verse 52:14": "\"Detta är Elden som ni förnekade;",
            "verse 52:15": "¤r den en synvilla? Eller är er syn i olag",
            "verse 52:16": "Känn hur dess lågor bränner er! Vare sig ni uthärdar det eller inte, förändrar det ingenting för er; detta är den rätta lönen för era handlingar.\"",
            "verse 52:17": "De gudfruktiga skall [den Dagen] vila lyckliga i lustgårdar,",
            "verse 52:18": "där de gläder sig åt allt det som deras Herre har skänkt dem och över att Han har skonat dem från helvetets straff.",
            "verse 52:19": "[Och änglarna skall uppmana dem:] \"Ät och drick av hjärtans lust; [detta är belöningen] för era handlingar!\"",
            "verse 52:20": "[De sitter] stödda [av kuddar] på högsäten, ordnade i rader [mitt emot varandra]. Och Vi skall ge dem mörkögda, oskuldsfulla unga kvinnor som sällskap.",
            "verse 52:21": "Vi skall låta deras efterkommande som följde dem i tron förena sig med dem utan att förminska något av deras egna förtjänster. Men var och en är ansvarig för sina handlingar.",
            "verse 52:22": "Och Vi skall förse dem med allt vad de önskar av frukt och kött,",
            "verse 52:23": "och där skall de kappas om att tömma en skål [med vin], som varken förleder dem till lättsinnigt tal eller låter syndiga tankar stiga upp inom dem.",
            "verse 52:24": "Och hos dem skall vara ungdomar, som betjänar dem, [av samma rena skönhet] som pärlan i [ostronets] skyddande skal.",
            "verse 52:25": "Och de går fram till varandra och frågar [om det förflutna]",
            "verse 52:26": "och säger: \"Då vi levde bland de våra kände vi [ofta] en stark oro [vid tanken på Guds straff].",
            "verse 52:27": "Men Gud har varit god mot oss som skonat oss från den glödheta vindens plåga;",
            "verse 52:28": "förr bad vi alltid till Honom [och Han hörde vår bön].\" - Han är den Gode, den Barmhärtige.",
            "verse 52:29": "[FORTSÄTT] alltså att påminna [människorna, Muhammad]! Tack vare din Herres nåd är du varken en spåman eller en galning.",
            "verse 52:30": "Kanske säger de: \"Han är [bara] en poet; låt oss vänta och se vad ödet kan ha i beredskap [för honom]!\"",
            "verse 52:31": "Säg: \"Vänta gärna! Jag skall vänta med er!\"",
            "verse 52:32": "Är det deras [berömda] visdom som talar på detta sätt – eller är de alltigenom onda människor?",
            "verse 52:33": "Säger de kanske: 'Han har själv diktat ihop alltsammans?' Nej, de vill [helt enkelt] inte tro!",
            "verse 52:34": "Låt dem då lägga fram en jämförbar text, om de talar sanning!",
            "verse 52:35": "Skapades de kanske av en slump? Eller är de själva skaparna",
            "verse 52:36": "Har de [också] skapat himlarna och jorden? Nej, de är inte säkra på något!",
            "verse 52:37": "Har de din Herres skatter i sina händer? Eller är det de som styr [allt]",
            "verse 52:38": "Eller har de en stege [med vars hjälp de når dit där] de kan lyssna [till himlens hemligheter]? Låt då den som [påstår sig ha] lyssnat, lägga fram klara bevis!",
            "verse 52:39": "Skall Han nöja Sig med döttrar, fastän ni [själva enbart] vill ha söner?",
            "verse 52:40": "Eller begär du en avgift av dem [för att framföra ditt budskap], så att de nu tyngs av skulder",
            "verse 52:41": "Eller har de [sådan kunskap om] den verklighet som är dold för människor att de [kan] skriva ned [vad de vet]?",
            "verse 52:42": "Lägger de försåt för dig [och hoppas se dig fastna i fällan]? Men förnekarna av sanningen fastnar själva i sina fällor!",
            "verse 52:43": "Eller har de en annan gud än Gud? Stor är Gud i Sin härlighet, fjärran från allt som [människor] vill sätta vid Hans sida!",
            "verse 52:44": "OCH OM de skulle se ett stycke av himlen störta ned, skulle de säga: \"Det är ingenting annat än moln som tornar upp sig!\"",
            "verse 52:45": "Låt dem därför vara till dess de får se den Dag vars [fasor] kommer att driva dem från vettet,",
            "verse 52:46": "den Dag då deras list inte skall vara dem till någon nytta och de inte finner hjälp någonstans.",
            "verse 52:47": "De som ständigt begår orätt [skall straffas] redan innan [den Dagen kommer], men de flesta av dem är ovetande [om detta].",
            "verse 52:48": "Ha tålamod [Muhammad] och vänta på din Herres dom - Vi vakar över dig. Och lova och prisa din Herre när du reser dig,",
            "verse 52:49": "och lova och prisa Honom under natten och då stjärnorna bleknar!"
        },
        "Tajik": {
            "verse 52:1": "Қасам ба кӯҳи Тур",
            "verse 52:2": "ва қасам ба китоби навишташуда,",
            "verse 52:3": "дар сафҳае кушода (Қуръон)",
            "verse 52:4": "ва қасам ба байтулмаъмур",
            "verse 52:5": "ва қасам ба ин, сақфи барафрошта (осмон)",
            "verse 52:6": "ва қасам ба дарёи моломол, (пур)",
            "verse 52:7": "ки азоби Парвардигорат воқеъ шуданист.",
            "verse 52:8": "Ва онро дафъкунандае нест.",
            "verse 52:9": "Рӯзе, ки осмон сахт бичархад",
            "verse 52:10": "ва кӯҳҳо ба шитоб равон шаванд,",
            "verse 52:11": "пас дар он рӯз вой бар дурӯғбарорандагон,",
            "verse 52:12": "онон, ки саргарми кордон ботили худанд!",
            "verse 52:13": "Рӯзе, ки онҳоро ба қаҳр ба ҷониби ҷаҳаннам кашанд.",
            "verse 52:14": "Ин аст он оташе, ки дурӯғаш мешумурдед.",
            "verse 52:15": "Оё ин ҷодуст ё шумо намебинед?",
            "verse 52:16": "Ба оташ дароед. Хоҳ бар он сабр кунед ё сабр накунад, фарқе накунад. Шуморо дар баробари корҳое, ки мекардаед, ҷазо медиҳанд.",
            "verse 52:17": "Парҳезгорон дар биҳиштҳо ва неъматанд.",
            "verse 52:18": "Аз он чӣ Парвардигорашон ба онҳо додааст, шодмонанд ва Худо онҳоро аз азоби ҷаҳаннам нигаҳ доштааст.",
            "verse 52:19": "Ба музди корҳое, ки кардаед, бихӯреду биёшомед. Гувороятон бод.",
            "verse 52:20": "Бар он тахтҳои канори ҳам чида такя мезананд. Ҳуриёнро ҳамсарашон мегардонем.",
            "verse 52:21": "Касоне, ки худ имон оварданд ва фарзандонашон дар имон пайравияшон карданд. Фарзандонашонро бо онҳо якҷоя мекунем ва аз музди амалашон ҳеҷ кам намекунем, ки дар касе дар гарави кори худ аст.",
            "verse 52:22": "Ва пайваста аз ҳар гуна, ки бихоҳанд, меваву гӯшт атояшон мекунем.",
            "verse 52:23": "Дар он ҷо ҷоми май диҳанд ва ҷоми май ситонанд, ки дар он на сухани беҳуда бошад ва на гуноҳ кардан.",
            "verse 52:24": "Ғуломонашон чун марвориди пинҳон дар садаф ба гирдашон мечарханд.",
            "verse 52:25": "Пурсишкунон рӯй ба якдигар мекунанд.",
            "verse 52:26": "Мегӯянд: «Пеш аз ин дар миёни касонамон танҳо мо аз Худо метарсидем.",
            "verse 52:27": "Пас Худо бар мо миннат ниҳод ва моро аз азоби самум нигаҳ дошт.",
            "verse 52:28": "Мо пеш аз ин Ӯро (бо дуъову илтиҷо) мехондем, ки Ӯ эҳсонкунандаву меҳрубон аст!»",
            "verse 52:29": "Пандашон деҳ, ки ту ба баракати неъмати Парвардигорат на коҳин (ҷодугар) ҳастиву на маҷнун.",
            "verse 52:30": "Ё мегӯянд: «Шоиресту мо барои вай мунтазири ҳаводиси рӯзгорем». (ки шояд бимирад).",
            "verse 52:31": "Бигӯ: «Шумо мунтазир бимонед, ки ман низ бо шумо интизор мекашам».",
            "verse 52:32": "Оё ононро рӯъёҳояшон (хобҳояшон) ба ин пиндорҳо кашонида ё худ, мардуме саркаш ҳастанд.",
            "verse 52:33": "Ё мегӯянд: «Қуръонро худ сохтааст!» На, онҳо имон намеоваранд!",
            "verse 52:34": "Агар рост мегӯянд, сухане монанди он биёваранд.",
            "verse 52:35": "Оё бе ҳеҷ холиқе офарида шуданд, ё худ холиқи худанд?",
            "verse 52:36": "Ё осмонҳову заминро ҳал кардаанд? На, ба яқин нарасидаанд.",
            "verse 52:37": "Ё хазинаҳои Парвардигорат назди онҳост? Ё бар чизе тасаллут ёфтаанд? (ҳукумат ёфтаанд).",
            "verse 52:38": "Ё нардбоне доранд, ки аз он боло мераванд ва гӯш меандозанд? Пас он касе, ки гӯш андохта бошад, ҳуҷҷате ошкор биёварад.",
            "verse 52:39": "Ё худовандро духтарон асту шуморо писарон.",
            "verse 52:40": "Ё аз онҳо музде металабӣ ва пардохти музд бар онҳо душвор аст?",
            "verse 52:41": "Ё илми ғайб медонанду менависанд?",
            "verse 52:42": "Ё мехоҳанд ҳилае кунанд? Аммо кофирон худ ба ҳила гирифторанд.",
            "verse 52:43": "ё онҳоро худоест ғайри Худои якто? Пок аст Худои якто аз ҳар чӣ шарикаш месозанд.",
            "verse 52:44": "Агар бингаранд, ки қитъае аз осмон фурӯ меафтад, мегӯянд: «Абрест мутароким (қабат-қабат ҷамъшуда)».",
            "verse 52:45": "Пас онҳоро вогузор, то рӯзеро, ки дар оя ба ҳалокат мерасанд, бингаранд,",
            "verse 52:46": "рӯзе, ки макрашон ҳеҷ ба ҳолашон фоидае накунад ва кас ба ёрияшон барнахезад.",
            "verse 52:47": "Барои касоне, ки зулм мекунанд, боз ҳам азобест ғайри ин азоб, вале бештаринашон намедонанд.",
            "verse 52:48": "Дар баробари фармони Парвардигорат босабр бош, ки ту таҳти назари Моӣ! Ва ҳангоме ки бархостӣ, ба ситоиши Парвардигорат тасбеҳ гӯй!",
            "verse 52:49": "Ва тасбҳ гӯй дар қисме аз шаб ва ба ҳангоми нопадид шудани ситорагон,"
        },
        "Tamil": {
            "verse 52:1": "தூர் (மலை) மீது சத்தியமாக!",
            "verse 52:2": "ஏட்டில் எழுதப்பட்ட வேதத்தின் மீது சத்தியமாக!",
            "verse 52:3": "விரித்து வைக்கப்பட்ட,",
            "verse 52:4": "பைத்துல் மஃமூர் மீது சத்தியமாக!",
            "verse 52:5": "உயர்த்தப்பட்ட முகட்டின் மீது சத்தியமாக!",
            "verse 52:6": "பொங்கும் கடலின் மீது சத்தியமாக!",
            "verse 52:7": "நிச்சயமாக உம்முடைய இறைவன் (விதித்திருக்கும்) வேதனை சம்பவிக்கும்.",
            "verse 52:8": "அதனைத் தடுப்பவர் எவருமில்லை.",
            "verse 52:9": "வானம் துடித்துச் சுற்றிக் குமுறும் நாளில்,",
            "verse 52:10": "இன்னும், மலைகள் தூள் துளாகி விடும் போது,",
            "verse 52:11": "(சன்மார்க்கத்தை எதிர்த்து அதைப்) பொய்யாக்கிக் கொண்டிருந்தோருக்கு அந்நாளில் கேடுதான்.",
            "verse 52:12": "எவர்கள் (பொய்யானவற்றில்) மூழ்கி விளையாடிக் கொண்டிருக்கின்றனரோ,",
            "verse 52:13": "அந்நாளில் அவர்கள் நரக நெருப்பின் பால் இழுக்கப்படுவோராக இழுக்கப்படுவர்.",
            "verse 52:14": "அந்நாளில்; (அவர்களுக்குக் கூறப்படும்:) \"நீங்கள் பொய்யாக்கிக் கொண்டிருந்த (நரக) நெருப்பு இதுதான்.",
            "verse 52:15": "\"இது சூனியம் தானா? அல்லது பார்க்க முடியாது (குருடர்களாக) ஆகிவிட்டீர்களா?",
            "verse 52:16": "\"நீங்கள் அதில் நுழையுங்கள், பிறகு நீங்கள் (அதன் வேதனையைச்) சகித்துக் கொள்ளுங்கள்; அல்லது சகித்துக் கொள்ளாதிருங்கள், (இரண்டும்) உங்களுக்குச் சமமே, நிச்சயமாக நீங்கள் செய்து கொண்டிருந்த வற்றிற்காகத்தான் நீங்கள் கூலி கொடுக்கப்படுகிறீர்கள்.\"",
            "verse 52:17": "நிச்சயமாக, பயபக்தியுடையவர்கள் சுவர்க்கச் சோலைகளிலும், (இறையருளில்) இன்புற்றும் இருப்பார்கள்.",
            "verse 52:18": "அவர்களுடைய இறைவன் அவர்களுக்கு அளித்ததை அனுபவித்தவர்களாகயிருப்பார்கள் - அன்றியும், அவர்களுடைய இறைவன் நரக வேதனையிலிருந்து அவர்களைப் பாதுகாத்துக் கொண்டான்.",
            "verse 52:19": "(அவர்களுக்குக் கூறப்படும்:) \"நீங்கள் (நன்மைகளைச்) செய்து கொண்டிருந்ததற்காக, (சுவர்க்கத்தில்) தாராளமாகப் புசியுங்கள், பருகுங்கள்.\"",
            "verse 52:20": "அணி அணியாகப் போடப்பட்ட மஞ்சங்களின் மீது சாய்ந்தவர்களாக அவர்கள் இருப்பார்கள்; மேலும், நாம் அவர்களுக்கு, நீண்ட கண்களையுடைய (ஹூருல் ஈன்களை) மணம் முடித்து வைப்போம்.",
            "verse 52:21": "எவர்கள் ஈமான் கொண்டு, அவர்களுடைய சந்ததியாரும் ஈமானில் அவர்களைப் பின் தொடர்கிறார்களோ, அவர்களுடைய அந்த சந்ததியனரை அவர்களுடன் (சுவனத்தில் ஒன்று) சேர்த்து விடுவோம். (இதனால்) அவர்களுடைய செயல்களில் எந்த ஒன்றையும், நாம் அவர்களுக்குக் குறைத்து விட மாட்டோம் - ஒவ்வொரு மனிதனும் தான் சம்பாதித்த செயல்களுக்குப் பிணையாக இருக்கின்றான்.",
            "verse 52:22": "இன்னும் அவர்கள் விரும்பும் கனிவகைகளையும் இறைச்சியையும், நாம் அவர்களுக்குக் கொடுத்துக் கொண்டிருப்போம்.",
            "verse 52:23": "(அமுதம் நிறைந்த) ஒருவர் கோப்பையை மற்றொருவர் பறித்துக் கொள்வர், ஆனால் அதில் வீணுமில்லை, குற்றமிழைப்பதும் இல்லை.",
            "verse 52:24": "அவர்களுக்கு(ப் பணி விடைக்கு) உள்ள சிறுவர்கள், அவர்களைச் சுற்றிக் கொண்டே இருப்பார்கள், அவர்கள் பதித்த ஆணி முத்துகளைப் போல் (இருப்பார்கள்).",
            "verse 52:25": "அவர்களில் சிலர் சிலரை முன்னோக்கி விசாரித்துக் கொள்வார்கள்.",
            "verse 52:26": "\"இதற்கு முன் (உலகில்) நாம் நம் குடும்பத்தாரிடையே இருந்த போது (வேதனை பற்றி) நிச்சயமாக அஞ்சியவர்களாகவே இருந்தோம்.",
            "verse 52:27": "\"ஆனால் அல்லாஹ் நம்மீது உபகாரம் செய்து கொடிய வேதனையிலிருந்து நம்மை காப்பாற்றினான்.",
            "verse 52:28": "\"நிச்சயமாக நாம் முன்னே (உலகில்) அவனைப் பிரார்த்தித்துக் கொண்டிருந்தோம், நிச்சயமாக அவனே மிக்க நன்மை செய்பவன், பெருங்கிருபையுடையவன்.\"",
            "verse 52:29": "எனவே, (நபியே! நீர் மக்களுக்கு நல்லுபதேசத்தால்) நினைவுறுத்திக் கொண்டிருப்பீராக! உம்முடைய இறைவனின் அருளால், நீர் குறிகாரரும் அல்லர், பைத்தியக்காரருமல்லர்.",
            "verse 52:30": "அல்லது: அவர்கள் (உம்மைப் பற்றி, \"அவர்) புலவர், அவருக்குக் காலத்தின் துன்பத்தைக் கொண்டு நாங்கள் வழி பார்த்து இருக்கிறோம்\" என்று கூறுகிறார்களா?",
            "verse 52:31": "\"நீங்களும் வழி பார்த்திருங்கள் - நிச்சயமாக நானும் உங்களுடன் வழி பார்க்கிறேன்\" என்று (நபியே!) நீர் கூறும்.",
            "verse 52:32": "அல்லது, அவர்களுடைய புத்திகள் தாம் அவர்களை இவ்வா(றெல்லாம் பேசுமா)று ஏவுகின்றனவா? அல்லது அவர்கள் வரம்பு மீறிய சமூகத்தாரா?",
            "verse 52:33": "அல்லது, இ(வ்வேதத்)தை நீர் இட்டுக் கட்டினீர் என்று அவர்கள் கூறுகின்றனரா? அல்ல. அவர்கள் ஈமான் கொள்ள மாட்டார்கள்.",
            "verse 52:34": "ஆகவே, (இவ்வாறெல்லாம் கூறும்) அவர்கள் உண்மையாளர்களாக இருந்தால், இ(வ்வேதத்)தைப் போன்ற ஒரு செய்தியை அவர்கள் கொண்டு வரட்டும்.",
            "verse 52:35": "அல்லது, அவர்கள் எந்தப் பொருளின்றியும் (தாமாகவே) படைக்கப்பட்டனரா? அல்லது அவர்கள் (எதையும்) படைக்கிற (சக்தியுடைய)வர்களா?",
            "verse 52:36": "அல்லது, வானங்களையும் பூமியையும் அவர்கள் படைத்தார்களா? அல்ல. அவர்கள் உறுதி கொள்ளமாட்டார்கள்.",
            "verse 52:37": "அல்லது, அவர்களிடம் உம்முடைய இறைவனின் பொக்கிஷங்கள் இருக்கின்றனவா? அல்லது இவர்கள் தாம் (எல்லாவற்றையும்) அடக்கியாள்பவர்களா?",
            "verse 52:38": "அல்லது, அவர்களுக்கு ஏணி இருந்து அதன் மூலம் (வானத்தின் இரகசியங்களை) கேட்டு வருகின்றார்களா? அவ்வாறாயின், அவர்களில் கேட்டு வந்தவர் செவியேற்றதைத் தெளிவான ஆதாரத்துடன் கொண்டு வரட்டும்.",
            "verse 52:39": "அல்லது, அவனுக்குப் பெண் மக்களும் உங்களுக்கு ஆண் மக்களுமா?",
            "verse 52:40": "அல்லது, நீர் அவர்களிடம் ஏதாவது கூலி கேட்டு, (அதைக் கொடுத்ததினால்) அவர்கள் கடன் பட்டு சுமையேற்றப்பட்டிருக்கின்றார்களா,",
            "verse 52:41": "அல்லது, அவர்களிடம் மறைவான செய்திகளிலிருந்து, அவற்றை அவர்கள் எழுதுகின்றார்களா,",
            "verse 52:42": "அல்லது, அவர்கள் (உமக்கு எதிராக) ஏதாவது சூழ்ச்சி செய்ய நாடுகிறார்களா, அப்படியானால், அந்த காஃபிர்கள் தாம் சூழச்சிக்குள்ளாவார்கள்.",
            "verse 52:43": "அல்லது, அவர்களுக்கு அல்லாஹ் அல்லாமல் (வேறு) நாயன் இருக்கின்றானா, அவர்கள் இணை வைப்பதை விட்டும் அல்லாஹ் மிகத் தூயவன்.",
            "verse 52:44": "வானத்திலிருந்து ஒரு துண்டு விழுவதை அவர்கள் கண்டார்களானால், அதை அடர்த்தியான மேகம் என்று அவர்கள் கூறிவிடுவார்கள்.",
            "verse 52:45": "ஆகவே அச்சத்தால் அவர்கள் உணர்விழக்கும் நாளைச் சந்திக்கும்வரை, அவர்களை விட்டு விடுவீர்களாக.",
            "verse 52:46": "அந்நாளில், அவர்களுடைய சூழ்ச்சிகள் எதுவும் அவர்களுக்குப் பயன் அளிக்காது, அன்றியும் (எவராலும்) அவர்கள் உதவி செய்யப்படவும் மாட்டார்கள்.",
            "verse 52:47": "அன்றியும், அநியாயம் செய்து கொண்டு இருந்தவர்களுக்கு நிச்சயமாக மற்றொரு வேதனையும் (இம்மையில்) உண்டு எனினும் அவர்களில் பெரும்பாலோர் இதை அறிய மாட்டார்கள்.",
            "verse 52:48": "எனவே (நபியே!) உம்முடைய இறைவனின் தீர்ப்புக்காகப் பொறுத்திறுப்பீராக, நிச்சயமாக நீர் நம் கண்காணிப்பில் இருக்கின்றீர்; மேலும் நீங்கள் எழுந்திருக்கும் சமயத்தில் உம் இறைவனின் புகழைக் கூறித் தஸ்பீஹு செய்வீராக,",
            "verse 52:49": "இன்னும், இரவின் ஒரு பாகத்திலும், நட்சத்திரங்கள் அடையும் நேரத்திலும் அவனைத்(துதி செய்து) தஸ்பீஹு செய்வீராக!"
        },
        "Tatar": {
            "verse 52:1": "Тур тавы белән",
            "verse 52:2": "вә язылмыш Коръән яки гамәл дәфтәре белән",
            "verse 52:3": "ул Коръән юка тиредән ясалган тире битләренә язылган.",
            "verse 52:4": "дәхи кешеләр таваф итә торган Кәгъбә яки фәрештәләр таваф итә торган Кәгъбә турысында күктәге бер бина белән",
            "verse 52:5": "вә югары күтәрелгән күк белән",
            "verse 52:6": "дәхи ґәзаб өчен хәзерләнгән ахирәттәге ут диңгезе белән ант итеп әйтәмен.",
            "verse 52:7": "Тәхкыйк Раббыңның ґәзабы вакыйга булучыдыр, ягъни әлбәттә, булачактыр.",
            "verse 52:8": "Бу ґәзабны кире җибәрүче һич юктыр.",
            "verse 52:9": "Аллаһуның ґәзабы вакыйга булыр күк каты әйләнеп каты селкенгән көндә.",
            "verse 52:10": "Вә таулар каты йөргән көндә.",
            "verse 52:11": "Ни үкенеч һәм ачы хәсрәт каты ґәзабтыр ул көндә Коръәнне ялган диючеләргә яки аның белән гамәл кылмаучыларга.",
            "verse 52:12": "Алар хакны инкяр итеп, бозык эшләрне эшләү белән һәм ялган сөйләү белән уйнаучылардыр.",
            "verse 52:13": "Ул көндә куллары-аяклары богауланып җәһәннәмгә өстерәлерләр.",
            "verse 52:14": "Вә аларга әйтелер: \"Бу ут – сез аны ялганга тоткан идегез,",
            "verse 52:15": "сез дөньяда вакытта Коръәнне сихер диядер идегез, бу ут ґәзабы да сихермы? Әллә ут ґәзабын күрмисезме? Бик яхшы күрәсез, ләкин дөньяда хакны күрергә теләмәдегез.",
            "verse 52:16": "Инде керегез ул утка һәм ґәзабын татыгыз! Кирәк – чыдагыз, кирәк – чыдамагыз – сезнең өчен бертигездер ґәзабыгыз җиңеләймәс, сез фәкать кылган явызлыгыгыз өчен җәзаланырсыз\", – дип.",
            "verse 52:17": "Тәхкыйк Аллаһуга вә расүлгә итагать итүче тәкъва мөэминнәр җәннәтләрдә һәм нигъмәтләр эчендәдерләр.",
            "verse 52:18": "Раббиларының биргән нигъмәтләренә шатланган хәлдә, Раббылары саклар аларны җәһәннәм ґәзабыннан.",
            "verse 52:19": "Ашагыз вә эчегез тыныч вә мәшәкатьсез генә тәкъвалык белән кылган гамәлләрегез өчен.",
            "verse 52:20": "Алар тезелеп куелган зиннәтле диваннарда рәхәтләнеп утырырлар. Вә Без аларны ак йөзле, кара зур күзле хур кызларына ир кылырбыз.",
            "verse 52:21": "Иман китереп Ислам динен тотучы хак мөэминнәрнең балалары дин тотуда хак диндә булган аталарына иярделәр – Без аларны аталарына ияртеп җәннәткә кертербез, җәннәттә бергә булырлар, гәрчә дәрәҗәләре аталарыныкыннан түбән булса да, аталарының гамәленнән һичнәрсәне киметмәдек, ягъни аталарын балаларының дәрәҗәсенә төшермәдек бәлки балаларын аталарының дәрәҗәсенә күтәрдек. Һәрбер кеше кылган эше бәрабәрендә җавапка калучыдыр.",
            "verse 52:22": "Янә ул тәкъва мөэминнәргә башка нигъмәтләр өстенә арттырдык җимешләрнең вә итләрнең үзләре теләгәнен.",
            "verse 52:23": "Вә бер-берсенә кәсәләрен бирерләр, ул тәмле суларны эчкәч, кирәкмәгән сүзләрне сөйләү булмас һәм гөнаһлы эшләрне эшләргә теләк тә булмас.",
            "verse 52:24": "Алар тирәсендә энҗе дәнәләре кеби хезмәтче егетләр йөрерләр.",
            "verse 52:25": "Вә ул җәннәт әһелләре бер-берсенә каршы килеп бу бөек дәрәҗәгә нинди сәбәп белән ирештегез, дип сорашырлар.",
            "verse 52:26": "Җавап итеп әйтерләр: \"Без дөньяда әһелебез арасында Аллаһудан куркып гөнаһлардан сакланадыр идек.",
            "verse 52:27": "Аллаһ безгә рәхмәт кылды вә бу дәрәҗәләрне бирде һәм эчке әгъзаларга үткүче ут ґәзабыннан безне саклады.",
            "verse 52:28": "Тәхкыйк без дөньяда Ул – Аллаһуга гыйбадәт кылыр идек һәм ут ґәзабыннан сакла, дип, дога кылыр идек, тәхкыйк Ул – Аллаһ изгелекле һәм дә рәхимледер.",
            "verse 52:29": "Инде син кәферләргә, мөшрикләргә һәм монафикъларга Коръән белән сөйлә, яхшылап төшендер, әлбәттә, син Раббыңның нигъмәте вә рәхмәте сәбәпле Аллаһудан килгән вәхий белән сөйләүче хак пәйгамбәрсең, вәхийдән башка гаептән хәбәр бирүче күрәзәче түгелсең һәм дивана да түгелсең.",
            "verse 52:30": "Әллә әйтәләрме ул пәйгамбәр түгел, шагыйрь, без аның хакында бер вакыйга көтәбез дип. Мөшрикләр: \"Атасы яшьли үлде, Мухәммәд тә яшьли үләр, аннары сәхабәләре таралыр\", – дип көтәләр иде.",
            "verse 52:31": "Әйт аларга: \"Көтегез, ий мөшрикләр, мин дә сезнең белән бергә Аллаһудан сезгә ґәзаб килгәнне көтүчемен\", – дип.",
            "verse 52:32": "Әллә аларны Аллаһуга вә расүлгә каршылык кылырга гакыллары кушамы, әллә алар азган саташкан кавемнәрме?",
            "verse 52:33": "Әллә алар әйтәләрме: \"Коръәнне Мухәммәд үзе уйлап чыгарды\", – дип. Юк бәлки алар хөседлек вә тәкәбберлек илә Коръәнгә ышанмыйлар.",
            "verse 52:34": "Әгәр Мухәммәд Коръәнне үзе уйлап чыгарган дигән сүзләре дөрес булса, Коръән сүзләренә охшаган сүзләрне китерсеннәр, бит алар да Мухәммәд кеби кешеләр, Коръән кеби китап китерсеннәр!",
            "verse 52:35": "Әллә алар һичнәрсәсез халык ителделәрме, ягъни аларны халык кылган Аллаһ юкмы, әллә алар үзләре халык кылучылармы?",
            "verse 52:36": "Әллә җирне вә күкләрне алар халык кылдылармы? Бәлки алар \"Фәкать Аллаһ гына халык кылучы\" дигән сүзгә ышанмыйлар.",
            "verse 52:37": "Әллә Раббыңның рәхмәт хәзинәләре алар кулындамы? Әллә аларда Аллаһуда булган куәт бармы, теләгән бер эшләрен кылалармы?",
            "verse 52:38": "Әллә аларның күккә менә торган баскычлары булып, анда менеп вәхийне тыңлыйлармы, әгәр вәхийне ишеткән булсалар, сүзләрен вә эшләрен дөресли торган Аллаһ сүзләрен китерсеннәр!",
            "verse 52:39": "Әллә Аллаһуга кыз балалар булып, ий мөшрикләр, сезгә ир балалармы?",
            "verse 52:40": "Ий Мухәммәд г-м иманга өндәгән өчен вә Исламны өйрәткән өчен әллә алардан хак сорыйсыңмы һәм алар ул ханны бирүдән авырсыналармы?",
            "verse 52:41": "Әллә аларга пәйгамбәр белмәгән яшертен эшләрне белү белеме бармы, шул белемнәре илә хөкем итәләрме?",
            "verse 52:42": "Әллә алар бер хәйлә белән сине үтерергә телиләрме? Кәферләр хәйлә мәкерләреннән үзләре зарар күрүчеләрдер.",
            "verse 52:43": "Әллә аларның Аллаһудан башка үзләренең Аллалары бармы, Аллаһ ґәзабыннан коткаручы? Мөшрикләр шәрик иткән нәрсәләрдән Аллаһ гаять пакьдер.",
            "verse 52:44": "Әгәр алар үзләрен һәлак итәр өчен күктән килгән бер кисәкне күрсәләр, алар әйтәләр: \"Бергә оешкан болытлар безгә яңгыр алып киләдер\", – дип.",
            "verse 52:45": "Син аларны куй алардан кисел һәлак ителә торган көннәренә юлыкканнарына чаклы.",
            "verse 52:46": "Аларның хәйлә мәкерләре ул көндә һичнәрсәдә аларга файда бирмәс һәм ґәзабтан котылу өчен аларга ярдәмче булмас.",
            "verse 52:47": "Әлбәттә, залимнәргә ут ґәзабыннан башка да ґәзаб бардыр, ләкин кешеләрнең күберәге белмиләр.",
            "verse 52:48": "Дөньяда Раббыңның хөкеменә чыда! Бит син Безнең күз алдыбыздасың аларның сиңа кылган явыз эшләрен күрәбез, һәм Раббыңны мактап тәсбихләр әйтә торган вакытында.",
            "verse 52:49": "Дәхи ахшам, ястү намазларын һәм таң намазын укыгыл!"
        },
        "Telugu": {
            "verse 52:1": "తూర్ పర్వతం సాక్షిగా",
            "verse 52:2": "వ్రాయబడిన గ్రంథం సాక్షిగా",
            "verse 52:3": "విప్పబడిన చర్మపత్రం మీద",
            "verse 52:4": "చిరకాల సందర్శనాలయం సాక్షిగా",
            "verse 52:5": "పైకెత్తబడిన కప్పు (అంతరిక్షం) సాక్షిగా",
            "verse 52:6": "ఉప్పొంగే సముద్రం సాక్షిగా",
            "verse 52:7": "నిశ్చయంగా, నీ ప్రభువు శిక్ష సంభవించ నున్నది",
            "verse 52:8": "దానిని తప్పించేవాడు ఎవ్వడు లేడు",
            "verse 52:9": "ఆకాశాలు భయంకరంగా కంపించే రోజు",
            "verse 52:10": "మరియు పర్వతాలు దారుణంగా చలించినప్పుడు",
            "verse 52:11": "అప్పుడు, ఆ రోజు అసత్యవాదులకు వినాశం ఉంది",
            "verse 52:12": "ఎవరైతే వృథా మాటలలో కాలక్షేపం చేస్తూ ఉంటారో",
            "verse 52:13": "వారు నరకాగ్నిలోకి నెట్టుతూ త్రోయబడే రోజు",
            "verse 52:14": "(వారితో ఇలా అనబడుతుంది): మీరు అసత్యమని నిరాకరిస్తూ వుండిన నరకాగ్ని ఇదే",
            "verse 52:15": "ఏమీ? ఇది మంత్రజాలమా? లేక దీనిని మీరు చూడలేక పోతున్నారా",
            "verse 52:16": "ఇందులో మీరు కాలుతూ ఉండండి. దానికి మీరు సహనం వహించినా, సహనం వహించక పోయినా అంతా మీకు సమానమే! నిశ్చయంగా, మీ కర్మలకు తగిన ప్రతిఫలమే మీకు ఇవ్వబడుతున్నది",
            "verse 52:17": "నిశ్చయంగా, భయభక్తులు గలవారు స్వర్గవనాలలో సుఖసంతోషాలలో ఉంటారు",
            "verse 52:18": "వారి ప్రభువు వారికి ప్రసాదించిన వాటిని హాయిగా అనుభవిస్తూ ఉంటారు. మరియు వారి ప్రభువు వారిని భగభగ మండే నరకాగ్ని శిక్ష నుండి కాపాడాడు",
            "verse 52:19": "(వారితో ఇలా అనబడుతుంది): మీరు చేస్తూ వుండిన కర్మలకు ఫలితంగా హాయిగా తినండి త్రాగండి",
            "verse 52:20": "వారు వరుసగా వేయబడిన ఆసనాల మీద, దిండ్లకు ఆనుకొని కూర్చొని ఉంటారు. మరియు మేము అందమైన పెద్ద పెద్ద కన్నులు గల సుందరీమణులతో వారి వివాహం చేయిస్తాము",
            "verse 52:21": "మరియు ఎవరైతే విశ్వసిస్తారో మరియు వారి సంతానంవారు విశ్వాసంలో వారిని అనుసరిస్తారో! అలాంటి వారిని వారి సంతానంతో (స్వర్గంలో) కలుపుతాము. మరియు వారి కర్మలలో వారికి ఏ మాత్రం నష్టం కలిగించము. ప్రతి వ్యక్తి తాను సంపాదించిన దానికి తాకట్టుగా ఉంటాడు",
            "verse 52:22": "మరియు మేము వారికి, వారు కోరే ఫలాలను మరియు మాంసాన్ని పుష్కలంగా ప్రసాదిస్తాము",
            "verse 52:23": "అందులో (ఆ స్వర్గంలో) వారు ఒకరి కొకరు (మధు) పాత్ర మార్చుకుంటూ ఉంటారు; దాన్ని (త్రాగటం) వల్ల వారు వ్యర్థపు మాటలు మాట్లాడరు మరియు పాపాలు చేయరు",
            "verse 52:24": "మరియు దాచబడిన ముత్యాల వంటి బాలురు, వారి సేవ కొరకు వారి చుట్టు ప్రక్కలలో తిరుగుతూ ఉంటారు",
            "verse 52:25": "మరియు వారు ఒకరి వైపుకొకరు మరలి పరస్పరం (తమ గతించిన జీవితాలను గురించి) మాట్లాడుకుంటూ ఉంటారు",
            "verse 52:26": "వారు ఇలా అంటారు: వాస్తవానికి మనం ఇంతకు పూర్వం మన కుటుంబం వారి మధ్య ఉన్నప్పుడు (అల్లాహ్ శిక్షకు) భయపడుతూ ఉండేవారము",
            "verse 52:27": "కావున నిశ్చయంగా, అల్లాహ్ మన మీద కనికరం చూపాడు మరియు మమ్ము దహించే గాలుల శిక్ష నుండి కాపాడాడు",
            "verse 52:28": "నిశ్చయంగా, మనం ఇంతకు పూర్వం ఆయననే ప్రార్థిస్తూ ఉండేవారము. నిశ్చయంగా, ఆయన మహోపకారి, అపార కరుణా ప్రదాత",
            "verse 52:29": "కావున (ఓ ప్రవక్తా!) నీవు హితోపదేశం చేస్తూ వుండు. నీ ప్రభువు అనుగ్రహం వల్ల నీవు జ్యోతిష్కుడవు కావు మరియు పిచ్చివాడవూ కావు",
            "verse 52:30": "లేదా? వారు: ఇతను ఒక కవి, ఇతని వినాశకాలం కోసం మేము ఎదురు చూస్తున్నాము. అని అంటున్నారా",
            "verse 52:31": "వారితో ఇలా అను: మీరు ఎదురు చూస్తూ ఉండండి, నిశ్చయంగా, నేను కూడా మీతో పాటు ఎదురు చూస్తూ ఉంటాను",
            "verse 52:32": "ఏమీ? వారి బుద్ధులు వారికి ఇవే ఆజ్ఞాపిస్తున్నాయా? లేక వారు తలబిరుసుతనం గల జనులా",
            "verse 52:33": "ఏమీ? వారు: ఇతనే, దీనిని (ఈ సందేశాన్ని) కల్పించుకున్నాడు\" అని అంటున్నారా? అలా కాదు, వారు అసలు విశ్వసించ దలుచుకోలేదు",
            "verse 52:34": "వారు సత్యవంతులే అయితే దీని వంటి ఒక వచనాన్ని (రచించి) తెమ్మను",
            "verse 52:35": "వారు ఏ (సృష్టికర్త) లేకుండానే సృష్టింపబడ్డారా? లేక వారే సృష్టికర్తలా",
            "verse 52:36": "లేక వారు ఆకాశాలను మరియు భూమిని సృష్టించారా? అలా కాదు, అసలు వారికి విశ్వాసం లేదు",
            "verse 52:37": "వారి దగ్గర నీ ప్రభువు కోశాగారాలు ఏవైనా ఉన్నాయా? లేక వారు వాటికి అధికారులా",
            "verse 52:38": "వారి దగ్గర నిచ్చెన ఏదైనా ఉందా? దానితో పైకెక్కి వారు (దేవదూతల మాటలు) వినటానికి? అలా అయితే! వారిలో ఎవడైతే విన్నాడో, అతనిని స్పష్టమైన నిదర్శనాన్ని తెమ్మను",
            "verse 52:39": "ఆయన (అల్లాహ్) కు కూతుళ్ళూ మరియు మీకేమో కుమారులా",
            "verse 52:40": "(ఓ ముహమ్మద్!) నీవు వారితో ఏమైనా ప్రతిఫలం అడుగుతున్నావా? వారు ఋణభారంతో అణిగి పోవటానికి",
            "verse 52:41": "లేక వారి దగ్గర అగోచర విషయపు జ్ఞానముందా? వారు దానిని వ్రాసి పెట్టారా",
            "verse 52:42": "లేక వారేదైనా పన్నాగం పన్నదలచారా? కాని ఎవరైతే సత్యాన్ని తిరస్కరిస్తారో, వారే పన్నాగానికి గురి అవుతారు",
            "verse 52:43": "లేక వారికి అల్లాహ్ గాకుండా మరొక ఆరాధ్య దేవుడు ఉన్నాడా? వారు కల్పించే భాగస్వాములకు అల్లాహ్ అతీతుడు",
            "verse 52:44": "ఒకవేళ వారు ఆకాశపు ఒక తునకను రాలి పడటం చూసినా: ఇవి దట్టమైన మేఘాలు!\" అని అనేవారు",
            "verse 52:45": "కావున వారు తమ (తీర్పు) దినాన్ని దర్శించే వరకు వారిని వదిలి పెట్టు. అప్పుడు వారు భీతితో మూర్ఛపోయి పడి పోతారు",
            "verse 52:46": "ఆరోజు వారి పన్నాగం వారికి ఏ మాత్రం పనికి రాదు. మరియు వారికి ఎలాంటి సహాయం కూడా లభించదు",
            "verse 52:47": "మరియు నిశ్చయంగా, దుర్మార్గానికి పాల్పడిన వారికి, ఇదే గాక మరొక శిక్ష కూడా ఉంది, కాని వారిలో చాలా మందికి అది తెలియదు",
            "verse 52:48": "కావున (ఓ ముహమ్మద్!) నీవు, నీ ప్రభువు ఆజ్ఞ వచ్చే వరకు సహనం వహించు. నిశ్చయంగా, నీవు మా దృష్టిలో ఉన్నావు. మరియు నీవు నిద్ర నుండి లేచినపుడు నీ ప్రభువు పవిత్రతను కొనియాడు, ఆయన స్తోత్రం చెయ్యి",
            "verse 52:49": "మరియు రాత్రి వేళలో కూడా ఆయన పవిత్రతను కొనియాడు మరియు నక్షత్రాలు అస్తమించే వేళలో కూడాను"
        },
        "Thai": {
            "verse 52:1": "ขอสาบานต่อภูเขาอัฏฏูร",
            "verse 52:2": "ขอสาบานต่อคัมภีร์ ที่ถูกจารึกไว้",
            "verse 52:3": "ในม้วนกระดาษหรือหนังที่กางแผ่",
            "verse 52:4": "ขอสาบานต่ออาคารที่ถูกเยือนอย่างสม่ำเสมอ",
            "verse 52:5": "ขอสาบานต่อท้องฟ้าที่อยู่เบื้องสูง",
            "verse 52:6": "ขอสาบานต่อทะเลที่ลุกโชติช่วง (ในวันกิยามะฮ.)",
            "verse 52:7": "แท้จริงการลงโทษของพระเจ้าของเจ้าจะเกิดขึ้นอย่างแน่นอน",
            "verse 52:8": "ไม่มีผู้ใดจะเบี่ยงเบนมันได้",
            "verse 52:9": "วันที่ชั้นฟ้าจะสั่นสะเทือนอย่างชุลมุนวุ่นวาย",
            "verse 52:10": "และเทือกเขาจะปลิวว่อนกระจัดกระจาย",
            "verse 52:11": "ดังนั้นความหายนะในวันนั้นจงประสบแก่บรรดาผู้ปฏิเสธ",
            "verse 52:12": "บรรดาที่พวกเขาอยู่ในการมั่วสุมการละเล่นอย่างไร้สาระ",
            "verse 52:13": "วันที่พวกเขาจะถูกผลักลงนรกญะฮันนัมอย่างผลักใสไล่ส่ง",
            "verse 52:14": "นี่คือไฟนรก ซึ่งพวกเจ้าเคยปฏิเสธมัน",
            "verse 52:15": "นี่คือเล่ห์กลหรือ หรือว่าพวกเจ้ายังมองไม่เห็น?",
            "verse 52:16": "จงเข้าไปเผาไหม้ในนั้น พวกเจ้าจะทนได้หรือทนไม่ได้ก็เท่าเทียมกันสำหรับพวกเจ้า แท้จริงพวกเจ้านั้นจะถูกตอบแทนตามที่พวกเจ้าได้กระทำไว้เท่านั้น",
            "verse 52:17": "แท้จริงบรรดาผู้ยำเกรงนั้นจะได้อยู่ในสวนสวรรค์ และความสุขสำราญ",
            "verse 52:18": "ได้รับความสุขอันล้นพ้นตามที่พระเจ้าของพวกเขาได้ประทานให้แก่พวกเขา และพระเจ้าของพวกเขาจะคุ้มครองพวกเขาให้พ้นจากการลงโทษของเปลวไฟ",
            "verse 52:19": "พวกเจ้าจงกิน จงดื่มอย่างสบายใจตามที่พวกเจ้าได้กระทำไว้",
            "verse 52:20": "นอนเอกเขนกอยู่บนเตียงเรียงชิดติดกัน และเราให้พวกเขามีคู่ครองเป็นหญิงสาวสวยดวงตาโตคม",
            "verse 52:21": "และบรรดาผู้ศรัทธา บรรดาลูกหลานของพวกเขาจะดำเนินตามพวกเขาด้วยการศรัทธา เราจะให้ลูกหลานของพวกเขาอยู่ร่วมกับพวกเขา และเราจะไม่ให้การงานของพวกเขาลดหย่อนลงจากพวกเขาแต่อย่างใดแต่ละคนย่อมได้รับการค้ำประกันในสิ่งที่เขาขวนขวายไว้",
            "verse 52:22": "และเราจะเพิ่มพูนให้แก่พวกเขา ซึ่งผลไม้และเนื้อตามที่พวกเขาต้องการ",
            "verse 52:23": "พวกเขาจะแลกเปลี่ยนถ้วยแก้วกันในสวรรค์ จะไม่มีการพูดจาตลกคะนอง และไม่มีการทำบาป",
            "verse 52:24": "มีเด็กวัยรุ่นของพวกเขาวนเวียนรับใช้พวกเขา เสมือนว่าพวกเขา เช่นไข่มุกถูกปกปิดไว้",
            "verse 52:25": "และบางคนในหมู่พวกเขาจะหันหน้าเข้าหากัน สอบถามซึ่งกันและกัน",
            "verse 52:26": "พวกเขากล่าวว่า แท้จริง แต่ก่อนนี้ (ในโลกดุนยา) พวกเราอยู่กับครอบครัวของเราเป็นผู้มีความวิตกกังวัล",
            "verse 52:27": "ดังนั้นอัลลอฮ.ได้ทรงโปรดปรานแก่เราและได้ทรงปกป้องเราให้พ้นจากการลงโทษแห่งลมร้อน",
            "verse 52:28": "แท้จริง ก่อนหน้านี้เราได้วิงวอนต่อพระองค์ แท้จริงพระองค์นั้นเป็นผู้ทรงเอื้อเฟื้อเผื่อแผ่ผู้ทรงเมตตาเสมอ",
            "verse 52:29": "ดังนั้น จงกล่าวเตือน (พวกเขาเถิด) เนื่องเพราะความโปรดปรานแห่งพระเจ้าของเจ้ามิได้เป็นโหร และมิได้เป็นบ้า",
            "verse 52:30": "หรือพวกเขากล่าวว่า มุฮัมมัดเป็นกวี เราคอยภัยพิบัติที่จะเกิดขึ้นแก่เขา",
            "verse 52:31": "จงกล่าวเถิดมุฮัมมัด พวกท่านจงคอยเถิด แท้จริงฉันก็จะอยู่ในหมู่ผู้คอยร่วมกับพวกท่าน",
            "verse 52:32": "หรือว่าสติปัญญาของพวกเขาใช้พวกเขาให้เชื่อเช่นนั้น หรือว่าพวกเขาเป็นหมู่ชนผู้ฝ่าฝืน",
            "verse 52:33": "หรือพวกเขากล่าวว่า เขาได้เสกสรรปั้นแต่งอัลกุรอานขึ้นเอง เปล่าดอกพวกเขาไม่ศรัทธาต่างหาก",
            "verse 52:34": "ดังนั้น พวกเขาจงนำคำกล่าวเช่นเดียวกันนี้มา หากพวกเขาเป็นผู้สัตย์จริง",
            "verse 52:35": "หรือว่าพวกเขาถูกบังเกิดมาโดยไม่มีผู้ให้บังเกิด หรือว่าพวกเขาเป็นผู้ให้บังเกิดตนเอง",
            "verse 52:36": "หรือว่าพวกเขาเป็นผู้สร้างชั้นฟ้าทั้งหลาย และแผ่นดินนี้ เปล่าเลย เพราะพวกเขาไม่เชื่อมั่นต่างหาก",
            "verse 52:37": "หรือว่าพวกเขามีขุมทรัพย์แห่งพระเจ้าของเจ้า หรือว่าพวกเขาเป็นผู้มีอำนาจจัดการ",
            "verse 52:38": "หรือว่าพวกเขามีบันไดเพื่อพวกเขาจะได้ฟังเรื่องราวต่าง ๆ ในชั้นฟ้า ดังนั้นก็จงให้คนที่ฟังในหมู่พวกเขานำหลักฐานอันชัดแจ้งมา",
            "verse 52:39": "หรือว่าพระองค์ทรงมีบุตรหญิงหลายคน และพวกเจ้ามีบุตรชายหลายคน",
            "verse 52:40": "หรือว่าเจ้าขอค่าจ้างจากพวกเขา ดังนั้นพวกเขา จึงมีภาระหนี้อันหนัก",
            "verse 52:41": "หรือว่าที่พวกเขามีสิ่งเร้นลับ แล้วพวกเขาก็บันทึกไว้",
            "verse 52:42": "หรือว่าพวกเขาต้องการที่จะวางแผนร้าย แต่ว่าบรรดาผู้ปฏิเสธศรัทธานั้น พวกเขาต่างหากที่จะถูกวางแผนร้าย",
            "verse 52:43": "หรือว่าพวกเขามีพระเจ้าอื่นจากอัลลอฮ.จากสิ่งที่พวกเขาตั้งภาคี",
            "verse 52:44": "ครั้นเมื่อพวกเขาเห็นเศษชิ้นหนึ่งร่วงหล่นลงมาจากฟากฟ้า พวกเขาก็กล่าวว่า มันเป็นเพียงก้อนเมฆรวมตัว",
            "verse 52:45": "ดังนั้นจงปล่อยพวกเขาเถิด จนกว่าพวกเขาจะพบกับวันของพวกเขา ซึ่งในวันนั้นพวกเขาจะถูกทำให้เป็นลมหมดสติ",
            "verse 52:46": "วันซึ่งแผนการณ์ร้ายของพวกเขาจะไม่อำนวยประโยชน์อันใดแก่พวกเขา และพวกเขาก็จะไม่ได้รับการช่วยเหลือ",
            "verse 52:47": "และแท้จริงสำหรับบรรดาผู้อธรรมนั้นจะได้รับการลงโทษอื่นจากนั้นอีก แต่ว่าส่วนมากของพวกเขาไม่รู้",
            "verse 52:48": "ดังนั้น จงอดทนต่อพระบัญชาของพระเจ้าของเจ้า เพราะแท้จริง เจ้านั้นอยู่ในเบื้องสายตาของเรา และจงแซ่ซ้องสดุดีด้วยการสรรเสริญพระเจ้าของเจ้าขณะเมื่อเจ้าลุกขึ้นยืน",
            "verse 52:49": "และส่วนหนึ่งของกลางคืน ก็จงแซ่ซ้องสดุดีพระองค์ และเมื่อยามคล้องลับของหมู่ดวงดาว"
        },
        "Turkish": {
            "verse 52:1": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:2": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:3": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:4": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:5": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:6": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:7": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:8": "Tura, yayılmış ince deri üzerine satır satır dizilmiş Kitap'a, mamur bir ev olan Kabe'ye, yükseltilmiş tavan gibi göğe, kaynayacak denize and olsun ki, Rabbinin azabı hiç şüphesiz gelecektir. Onu savacak yoktur.",
            "verse 52:9": "Göğün sarsıldıkça sarsılacağı, dağların yürüdükçe yürüyeceği gün; işte o gün, daldıkları yerde eğlenip oyalanarak kıyameti yalanlayanlara yazık olacak!",
            "verse 52:10": "Göğün sarsıldıkça sarsılacağı, dağların yürüdükçe yürüyeceği gün; işte o gün, daldıkları yerde eğlenip oyalanarak kıyameti yalanlayanlara yazık olacak!",
            "verse 52:11": "Göğün sarsıldıkça sarsılacağı, dağların yürüdükçe yürüyeceği gün; işte o gün, daldıkları yerde eğlenip oyalanarak kıyameti yalanlayanlara yazık olacak!",
            "verse 52:12": "Göğün sarsıldıkça sarsılacağı, dağların yürüdükçe yürüyeceği gün; işte o gün, daldıkları yerde eğlenip oyalanarak kıyameti yalanlayanlara yazık olacak!",
            "verse 52:13": "Cehennem ateşine itildikçe itildikleri gün, onlara: \"İşte yalanlayıp durduğunuz ateş budur;",
            "verse 52:14": "Cehennem ateşine itildikçe itildikleri gün, onlara: \"İşte yalanlayıp durduğunuz ateş budur;",
            "verse 52:15": "Bu bir büyü müdür, yoksa hala görmez misiniz? Girin oraya, sabretseniz de sabretmeseniz de artık birdir; ancak işlediklerinizin karşılığını görüyorsunuz\" denir.",
            "verse 52:16": "Bu bir büyü müdür, yoksa hala görmez misiniz? Girin oraya, sabretseniz de sabretmeseniz de artık birdir; ancak işlediklerinizin karşılığını görüyorsunuz\" denir.",
            "verse 52:17": "Allah'a karşı gelmekten sakınanlar, şüphesiz, cennetlerde ve Rablerinin kendilerine verdikleriyle zevk duyarak nimetler içindedirler. Rableri onları cehennem azabından korumuştur.",
            "verse 52:18": "Allah'a karşı gelmekten sakınanlar, şüphesiz, cennetlerde ve Rablerinin kendilerine verdikleriyle zevk duyarak nimetler içindedirler. Rableri onları cehennem azabından korumuştur.",
            "verse 52:19": "Onlara şöyle denir: \"İşlediklerinizden ötürü, dizi dizi tahtlara yaslanarak afiyetle yiyin için.\" Onlara, ceylan gözlü eşler veririz.",
            "verse 52:20": "Onlara şöyle denir: \"İşlediklerinizden ötürü, dizi dizi tahtlara yaslanarak afiyetle yiyin için.\" Onlara, ceylan gözlü eşler veririz.",
            "verse 52:21": "İnanan, soyları da inançta kendilerine uyan kimselere soylarını da katarız. Onların işlediklerinden hiçbir şey eksiltmeyiz. Herkes kazancına bağlıdır.",
            "verse 52:22": "Cennette olanlara diledikleri meyve ve etten bol bol veririz.",
            "verse 52:23": "Orada kadeh tokuştururlar; fakat bunda ne bir saçmalama, ne de bir günaha girme vardır.",
            "verse 52:24": "Sedefteki inciler gibi olan gençler yanlarında dolaşırlar.",
            "verse 52:25": "Birbirlerine dönüp soruşurlar:",
            "verse 52:26": "\"Doğrusu bundan önce ailemizin yanında bile korku içindeydik; Allah lütfedip bizi kavurucu azabdan korudu; doğrusu bundan önce de O'na yalvarıyorduk; şüphesiz O, iyilik yapandır, acıyandır\" derler.",
            "verse 52:27": "\"Doğrusu bundan önce ailemizin yanında bile korku içindeydik; Allah lütfedip bizi kavurucu azabdan korudu; doğrusu bundan önce de O'na yalvarıyorduk; şüphesiz O, iyilik yapandır, acıyandır\" derler.",
            "verse 52:28": "\"Doğrusu bundan önce ailemizin yanında bile korku içindeydik; Allah lütfedip bizi kavurucu azabdan korudu; doğrusu bundan önce de O'na yalvarıyorduk; şüphesiz O, iyilik yapandır, acıyandır\" derler.",
            "verse 52:29": "Öğüt ver; Rabbinin nimetiyle sen, ne kahinsin ne de delisin.",
            "verse 52:30": "Yoksa senin için şöyle mi derler: \"Şairdir, zamanın onun aleyhine dönmesini gözlüyoruz.\"",
            "verse 52:31": "De ki: \"Gözleyin, doğrusu ben de sizinle beraber gözlemekteyim.\"",
            "verse 52:32": "Bunu onlara akılları mı buyuruyor? Yoksa onlar azgın bir millet midirler?",
            "verse 52:33": "Yahut: \"Onu kendi uydurdu\" diyorlar öyle mi? Hayır, inanmıyorlar.",
            "verse 52:34": "Eğer iddialarında samimi iseler Kuran'ın benzeri bir söz meydana getirsinler.",
            "verse 52:35": "Onlar, yaratan olmaksızın mı yaratıldılar yoksa yaratanlar kendileri midir?",
            "verse 52:36": "Yoksa gökleri ve yeri kendileri mi yarattılar? Hayır, Allah'a kesin olarak inanmıyorlar.",
            "verse 52:37": "Yoksa Rabbinin hazineleri onların yanında mıdır? Yoksa onlar mı işe hakimdirler?",
            "verse 52:38": "Yoksa, üzerine çıkıp vahiy dinledikleri bir merdivenleri mi var? Öyleyse, dinleyenleri açık bir delil getirsin.",
            "verse 52:39": "Demek kızlar Allah'ın, oğullar sizin öyle mi?",
            "verse 52:40": "Yahut sen onlardan bir ücret istiyorsun da onlar ağır bir borç altında mı kalıyorlar?",
            "verse 52:41": "Veya, görülmeyeni bilmek kendilerine aittir de, onlar mı yazıyorlar?",
            "verse 52:42": "Yoksa bir tuzak mı kurmak istiyorlar? Ama o tuzağa yakalanacak olanlar inkar edenlerdir.",
            "verse 52:43": "Yoksa Allah'tan başka bir tanrıları mı vardır? Allah, onların ortak koşmalarından münezzehtir.",
            "verse 52:44": "Gökten azap olarak düşen bir parça görseler: \"Bulut kümesidir\" derler.",
            "verse 52:45": "Çarpılacakları güne erişmelerine kadar onları bırak.",
            "verse 52:46": "O gün, düzenleri kendilerine bir fayda vermez; yardım da görmezler.",
            "verse 52:47": "Zulmedenlere, şüphesiz, bundan başka da azap vardır; fakat onların çoğu bilmezler.",
            "verse 52:48": "Rabbinin hükmü yerine gelinceye kadar sabret; doğrusu sen, Bizim nezaretimiz altındasın; kalkarken Rabbini överek tesbih et;",
            "verse 52:49": "Geceleyin ve yıldızlar kaybolurken de O'nu tesbih et."
        },
        "Urdu": {
            "verse 52:1": "(کوہ) طور کی قسم",
            "verse 52:2": "اور کتاب کی جو لکھی ہوئی ہے",
            "verse 52:3": "کشادہ اوراق میں",
            "verse 52:4": "اور آباد گھر کی",
            "verse 52:5": "اور اونچی چھت کی",
            "verse 52:6": "اور ابلتے ہوئے دریا کی",
            "verse 52:7": "کہ تمہارے پروردگار کا عذاب واقع ہو کر رہے گا",
            "verse 52:8": "(اور) اس کو کوئی روک نہیں سکے گا",
            "verse 52:9": "جس دن آسمان لرزنے لگا کپکپا کر",
            "verse 52:10": "اور پہاڑ اُڑنے لگے اون ہو کر",
            "verse 52:11": "اس دن جھٹلانے والوں کے لئے خرابی ہے",
            "verse 52:12": "جو خوض (باطل) میں پڑے کھیل رہے ہیں",
            "verse 52:13": "جس دن ان کو آتش جہنم کی طرف دھکیل دھکیل کر لے جائیں گے",
            "verse 52:14": "یہی وہ جہنم ہے جس کو تم جھوٹ سمجھتے تھے",
            "verse 52:15": "تو کیا یہ جادو ہے یا تم کو نظر ہی نہیں آتا",
            "verse 52:16": "اس میں داخل ہوجاؤ اور صبر کرو یا نہ کرو تمہارے لئے یکساں ہے۔ جو کام تم کیا کرتے تھے (یہ) انہی کا تم کو بدلہ مل رہا ہے",
            "verse 52:17": "جو پرہیزگار ہیں وہ باغوں اور نعتموں میں ہوں گے",
            "verse 52:18": "جو کچھ ان کے پروردگار نے ان کو بخشا اس (کی وجہ) سے خوشحال۔ اور ان کے پروردگار نے ان کو دوزخ کے عذاب سے بچا لیا",
            "verse 52:19": "اپنے اعمال کے صلے میں مزے سے کھاؤ اور پیو",
            "verse 52:20": "تختوں پر جو برابر برابر بچھے ہوئے ہیں تکیہ لگائے ہوئے اور بڑی بڑی آنکھوں والی حوروں سے ہم ان کا عقد کر دیں گے",
            "verse 52:21": "اور جو لوگ ایمان لائے اور ان کی اولاد بھی (راہ) ایمان میں ان کے پیچھے چلی۔ ہم ان کی اولاد کو بھی ان (کے درجے) تک پہنچا دیں گے اور ان کے اعمال میں سے کچھ کم نہ کریں گے۔ ہر شخص اپنے اعمال میں پھنسا ہوا ہے",
            "verse 52:22": "اور جس طرح کے میوے اور گوشت کو ان کا جی چاہے گا ہم ان کو عطا کریں گے",
            "verse 52:23": "وہاں وہ ایک دوسرے سے جام شراب جھپٹ لیا کریں گے جس (کے پینے) سے نہ ہذیان سرائی ہوگی نہ کوئی گناہ کی بات",
            "verse 52:24": "اور نوجوان خدمت گار (جو ایسے ہوں گے) جیسے چھپائے ہوئے موتی ان کے آس پاس پھریں گے",
            "verse 52:25": "اور ایک دوسرے کی طرف رخ کرکے آپس میں گفتگو کریں گے",
            "verse 52:26": "کہیں گے کہ اس سے پہلے ہم اپنے گھر میں (خدا سے) ڈرتے رہتے تھے",
            "verse 52:27": "تو خدا نے ہم پر احسان فرمایا اور ہمیں لو کے عذاب سے بچا لیا",
            "verse 52:28": "اس سے پہلے ہم اس سے دعائیں کیا کرتے تھے۔ بےشک وہ احسان کرنے والا مہربان ہے",
            "verse 52:29": "تو (اے پیغمبر) تم نصیحت کرتے رہو تم اپنے پروردگار کے فضل سے نہ تو کاہن ہو اور نہ دیوانے",
            "verse 52:30": "کیا کافر کہتے ہیں کہ یہ شاعر ہے (اور) ہم اس کے حق میں زمانے کے حوادث کا انتظار کر رہے ہیں",
            "verse 52:31": "کہہ دو کہ انتظار کئے جاؤ میں بھی تمہارے ساتھ انتظار کرتا ہوں",
            "verse 52:32": "کیا ان کی عقلیں ان کو یہی سکھاتی ہیں۔ بلکہ یہ لوگ ہیں ہی شریر",
            "verse 52:33": "کیا (کفار) کہتے ہیں کہ ان پیغمبر نے قرآن از خود بنا لیا ہے بات یہ ہے کہ یہ (خدا پر) ایمان نہیں رکھتے",
            "verse 52:34": "اگر یہ سچے ہیں تو ایسا کلام بنا تو لائیں",
            "verse 52:35": "کیا یہ کسی کے پیدا کئے بغیر ہی پیدا ہوگئے ہیں۔ یا یہ خود (اپنے تئیں) پیدا کرنے والے ہیں",
            "verse 52:36": "یا انہوں نے آسمانوں اور زمین کو پیدا کیا ہے؟ (نہیں) بلکہ یہ یقین ہی نہیں رکھتے",
            "verse 52:37": "کیا ان کے پاس تمہارے پروردگار کے خزانے ہیں۔ یا یہ (کہیں کے) داروغہ ہیں؟",
            "verse 52:38": "یا ان کے پاس کوئی سیڑھی ہے جس پر (چڑھ کر آسمان سے باتیں) سن آتے ہیں۔ تو جو سن آتا ہے وہ صریح سند دکھائے",
            "verse 52:39": "کیا خدا کی تو بیٹیاں اور تمہارے بیٹے",
            "verse 52:40": "(اے پیغمبر) کیا تم ان سے صلہ مانگتے ہو کہ ان پر تاوان کا بوجھ پڑ رہا ہے",
            "verse 52:41": "یا ان کے پاس غیب (کا علم) ہے کہ وہ اسے لکھ لیتے ہیں",
            "verse 52:42": "کیا یہ کوئی داؤں کرنا چاہتے ہیں تو کافر تو خود داؤں میں آنے والے ہیں",
            "verse 52:43": "کیا خدا کے سوا ان کا کوئی اور معبود ہے؟ خدا ان کے شریک بنانے سے پاک ہے",
            "verse 52:44": "اور اگر یہ آسمان سے (عذاب) کا کوئی ٹکڑا گرتا ہوا دیکھیں تو کہیں کہ یہ گاڑھا بادل ہے",
            "verse 52:45": "پس ان کو چھوڑ دو یہاں تک کہ وہ روز جس میں وہ بےہوش کردیئے جائیں گے، سامنے آجائے",
            "verse 52:46": "جس دن ان کا کوئی داؤں کچھ بھی کام نہ آئے اور نہ ان کو (کہیں سے) مدد ہی ملے",
            "verse 52:47": "اور ظالموں کے لئے اس کے سوا اور عذاب بھی ہے لیکن ان میں کے اکثر نہیں جانتے",
            "verse 52:48": "اور تم اپنے پروردگار کے حکم کے انتظار میں صبر کئے رہو۔ تم تو ہماری آنکھوں کے سامنے ہو اور جب اُٹھا کرو تو اپنے پروردگار کی تعریف کے ساتھ تسبیح کیا کرو",
            "verse 52:49": "اور رات کے بعض اوقات میں بھی اور ستاروں کے غروب ہونے کے بعد بھی اس کی تنزیہ کیا کرو"
        },
        "Uyghur": {
            "verse 52:1": "تۇر تېغى بىلەن قەسەمكى،",
            "verse 52:2": "ئوچۇق قەغەزگە يېزىلغان كىتاب (يەنى قۇرئان) بىلەن قەسەمكى،",
            "verse 52:3": "ئوچۇق قەغەزگە يېزىلغان كىتاب (يەنى قۇرئان) بىلەن قەسەمكى،",
            "verse 52:4": "بەيتۇلمەئمۇر بىلەن قەسەمكى،",
            "verse 52:5": "ئاسمان بىلەن قەسەمكى،",
            "verse 52:6": "(قىيامەت كۈنى) ئوت بولۇپ ياندۇرۇلغان دېڭىز بىلەن قەسەمكى،",
            "verse 52:7": "پەرۋەردىگارىڭنىڭ ئازابى چوقۇم يۈز بەرگۈسىدۇر",
            "verse 52:8": "ئۇنىڭغا ھېچ ئادەم قارشى تۇرالمايدۇ",
            "verse 52:9": "ئۇ كۈندە ئاسمان قاتتىق تەۋرەيدۇ",
            "verse 52:10": "تاغلار قاتتىق سەير قىلىدۇ (يەنى زېمىننىڭ ئۈستىدىن توزۇپ يوقىلىپ كېتىدۇ)",
            "verse 52:11": "ئۇ كۈندە (پەيغەمبەرلەرنى) ئىنكار قىلغانلارغا ۋاي!",
            "verse 52:12": "ئۇلار (دۇنيادا) غەپلەتكە چۆمگەنلەردۇر",
            "verse 52:13": "ئۇ كۈندە ئۇلار دوزاخقا قاتتىق ئىتتىرىلىدۇ",
            "verse 52:14": "(ئۇلارغا) «مانا بۇ سىلەر يالغانغا چىقارغان دوزاختۇر» (دېيىلىدۇ)",
            "verse 52:15": "(ئۇلارغا) «(كۆزلىرىڭلار بىلەن كۆرۈپ تۇرۇۋاتقان بۇ ئازاب) سېھىرمۇ؟ ياكى سىلەر كۆرمەيۋاتامسىلەر",
            "verse 52:16": "دوزاخقا كىرىڭلار، (ئازابقا) مەيلى سەۋر قىلىڭلار، مەيلى سەۋر قىلماڭلار، بەرىبىر سىلەرگە ئوخشاش (چۈنكى سىلەر دوزاختا مەڭگۈ قالىسىلەر)، سىلەر پەقەت قىلمىشىڭلارنىڭ جازاسىنى تارتىسىلەر» (دېيىلىدۇ)",
            "verse 52:17": "تەقۋادارلار ھەقىقەتەن جەننەتلەردە ۋە نېمەت ئىچىدە بولىدۇ",
            "verse 52:18": "ئۇلار پەرۋەردىگارى بەرگەن نەرسىلەر بىلەن ھۇزۇرلىنىدۇ، پەرۋەردىگارى ئۇلارنى دوزاخ ئازابىدىن ساقلايدۇ",
            "verse 52:19": "(ئۇلارغا) «قىلغان ئەمەللىرىڭلارنىڭ (مۇكاپاتى) ئۈچۈن كۆڭۈللۈك يەڭلار ۋە ئىچىڭلار» (دېيىلىدۇ)",
            "verse 52:20": "ئۇلار قاتار تىزىلغان تەختلەر ئۈستىدە يۆلەنگەن ھالدا ئولتۇرىدۇ، شەھلا كۆزلۈك ھۈرلەرنى ئۇلارغا جۈپ قىلىپ بېرىمىز",
            "verse 52:21": "ئۆزلىرى ئىمان ئېيتقان، ئەۋلادلىرىمۇ ئەگىشىپ ئىمان ئېيتقانلارنىڭ ئەۋلادلىرىنى ئۇلار بىلەن تەڭ دەرىجىدە قىلىمىز، ئۇلارنىڭ (ياخشى) ئەمەللىرىدىن قىلچىمۇ كېمەيتىۋەتمەيمىز، ھەر ئادەم ئۆزىنىڭ قىلمىشىغا مەسئۇلدۇر",
            "verse 52:22": "ئۇلار كۆرۈۋاتقان نېمەتنىڭ ئۈستىگە يەنە (ئۇلارنى) كۆڭلى تارتقان مېۋە ۋە كۆڭلى تارتقان گۆش بىلەن تەمىنلەيمىز",
            "verse 52:23": "ئۇلار جەننەتتە ئۆزئارا (مەي قاچىلانغان) جاملارنى تۇتىشىدۇ، (مەي ئىچىش بىلەن) ئۇلاردىن (بۇ دۇنيادىكىدەك) بىھۇدە سۆز ۋە گۇناھ سادىر بولمايدۇ",
            "verse 52:24": "گويا سەدەپنىڭ ئىچىدىكى گۆھەردەك (چىرايلىق) غىلمانلار ئۇلارنى ئايلىنىپ يۈرۈپ (ئۇلارنىڭ) خىزمىتىنى قىلىدۇ",
            "verse 52:25": "ئۇلار (يەنى ئەھلى جەننەت) بىر - بىرىگە قارىشىپ پاراڭ سېلىشىدۇ",
            "verse 52:26": "ئۇلار ئېيتىدۇ: «بىز ھەقىقەتەن (دۇنيادىكى چاغدا) ئائىلىمىزدە (اﷲ نىڭ ئازابىدىن) قورقاتتۇق",
            "verse 52:27": "اﷲ بىزگە مەرھەمەت قىلدى، بىزنى زەھەرلىك ئازابتىن ساقلىدى",
            "verse 52:28": "بىز ھەقىقەتەن ئىلگىرى اﷲ قا ئىبادەت قىلاتتۇق، اﷲ ھەقىقەتەن ئېھسان قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر»",
            "verse 52:29": "(ئى مۇھەممەد! سەن قۇرئان بىلەن قەۋمىڭگە) ۋەز - نەسىھەت قىلغىن، سەن پەرۋەردىگارىڭنىڭ نېمىتى بىلەن كاھىنمۇ ئەمەسسەن ۋە مەجنۇنمۇ ئەمەسسەن",
            "verse 52:30": "ئۇلار ئېيتىدۇ: «ئۇ شائىردۇر، بىز ئۇنىڭ زاماننىڭ ھادىسىلىرىگە (يولۇقۇشىنى) كۈتىمىز». (ئى مۇھەممەد!) ئېيتقىنكى، «سىلەر كۈتۈڭلار، ھەقىقەتەن مەن سىلەر بىلەن بىرگە كۈتكۈچىلەردىنمەن (يەنى سىلەر مېنىڭ ھالاك بولۇشۇمنى كۈتسەڭلار، مەنمۇ سىلەرنىڭ ھالاك بولۇشۇڭلارنى كۈتىمەن)»",
            "verse 52:31": "ئۇلار ئېيتىدۇ: «ئۇ شائىردۇر، بىز ئۇنىڭ زاماننىڭ ھادىسىلىرىگە (يولۇقۇشىنى) كۈتىمىز». (ئى مۇھەممەد!) ئېيتقىنكى، «سىلەر كۈتۈڭلار، ھەقىقەتەن مەن سىلەر بىلەن بىرگە كۈتكۈچىلەردىنمەن (يەنى سىلەر مېنىڭ ھالاك بولۇشۇمنى كۈتسەڭلار، مەنمۇ سىلەرنىڭ ھالاك بولۇشۇڭلارنى كۈتىمەن)»",
            "verse 52:32": "ئۇلارنىڭ ئەقلى ئۇلارنى مۇشۇنداق (سۆز) قىلىشقا بۇيرۇمدۇ؟ ھەرگىز ئۇنداق ئەمەس، ئۇلار (كۇفرىدا) ھەددىدىن ئاشقان قەۋمدۇر",
            "verse 52:33": "ياكى ئۇلار: «(مۇھەممەد قۇرئاننى ئۆزى توقۇدى دېيىشەمدۇ؟ ئۇنداق ئەمەس، ئۇلار (قۇرئانغا) ئىشەنمەيدۇ",
            "verse 52:34": "ئەگەر (مۇھەممەد ئۇنى توقۇدى دېگەن سۆزۈڭلاردا) راستچىل بولساڭلار، (تۈزۈلۈشتە، گۈزەللىكتە، باياندا) قۇرئانغا ئوخشايدىغان بىر سۆزنى كەلتۈرۈپ بېقىڭلار",
            "verse 52:35": "ياكى ئۇلار ياراتقۇچىسىز يارىتىلغانمۇ؟ ياكى ئۇلار ئۆزلىرى ياراتقۇچىمۇ؟",
            "verse 52:36": "ياكى ئۇلار ئاسمانلارنى ۋە زېمىننى ياراتقانمۇ؟ بەلكى ئۇلار (اﷲ نىڭ بىرلىكىگە) ئىشەنمەيدۇ",
            "verse 52:37": "ئۇلارنىڭ يېنىدا پەرۋەردىگارىنىڭ خەزىنىلىرى بارمۇ؟ ياكى ئۇلار (شەيئىلەرنى خالىغانچە تەسەررۇپ قىلىدىغان) (كائىناتنى) بويسۇندۇرغۇچىمۇ؟",
            "verse 52:38": "ياكى ئۇلارنىڭ (ئاسمانغا چىقىپ) سۆز تىڭشايدىغان شوتىسى بارمۇ؟ ئەگەر بولسا، ئۇلارنىڭ سۆز ئاڭلىغۇچىسى ئوچۇق بىر پاكىتىنى كەلتۈرسۇن",
            "verse 52:39": "ياكى اﷲ نىڭ قىزلىرى، سىلەرنىڭ ئوغۇللىرىڭلار بارمۇ؟",
            "verse 52:40": "ياكى سەن ئۇلاردىن (دەۋىتىڭ ئۈچۈن) ھەق سوراپ، شۇ زىياندىن (ئۇلارغا) ئېغىر يۈك ئارتىلىپ قېلىپ (ئىمان ئېيتمامدۇ؟)",
            "verse 52:41": "ياكى ئۇلارنىڭ يېنىدا ئىلمى غەيب بولۇپ (ئۇنىڭدىن غەيب نەرسىلەرنى) يېزىۋالامدۇ؟",
            "verse 52:42": "ياكى ئۇلار ساڭا ھىيلە - مىكىر ئىشلىتەمدۇ؟ كاپىرلارنىڭ ھىيلە - مىكىرلىرى مەغلۇپ بولىدۇ",
            "verse 52:43": "ياكى ئۇلارنىڭ اﷲ تىن باشقا مەبۇدى بارمۇ؟ ئۇلارنىڭ شېرىك كەلتۈرگەن (بۇتلىرىدىن) اﷲ پاكتۇر",
            "verse 52:44": "ئەگەر ئۇلار ئاسماننىڭ بىر پارچىسى چۈشۈپ كەتكەنلىكىنى كۆرسە: «بۇ توپلاشقان بۇلۇتتۇر» دەيدۇ",
            "verse 52:45": "ئۇلارنى ھالاك قىلىدىغان كۈنگىچە تەرك ئەتكىن",
            "verse 52:46": "ئۇ كۈندە ئۇلارنىڭ ھىيلە - مىكرى ھېچ نەرسىگە ئەسقاتمايدۇ، ئۇلارغا ياردەممۇ قىلىنمايدۇ",
            "verse 52:47": "ئۇلار ئۇنىڭدىن (يەنى ئاخىرەتتىكى ئازابتىن) بۇرۇن (دۇنيادىمۇ بىر تۈرلۈك ئازابقا دۇچار بولىدۇ)، لېكىن ئۇلارنىڭ تولىسى (بۇنى) بىلمەيدۇ",
            "verse 52:48": "پەرۋەردىگارىڭنىڭ (ئۇلارغا بولىدىغان ئازابنى تەخىر قىلىش (ھۆكمىگە سەۋر قىلغىن، سەن ھەقىقەتەن بىزنىڭ ھىمايىمىزدىدۇرسەن، (ئۇيقۇدىن) تۇرغان ۋاقتىڭدا پەرۋەردىگارىڭغا تەسبىھ ئېيتقىن، ھەمدى ئېيتقىن",
            "verse 52:49": "كېچىدىمۇ، يۇلتۇزلار پاتقاندىن كېيىنمۇ ئۇنىڭغا تەسبىھ ئېيتقىن"
        },
        "Uzbek": {
            "verse 52:1": "Тур билан қасам.",
            "verse 52:2": "Сатрланган китоб билан қасам.",
            "verse 52:3": "Ёйилган терига.",
            "verse 52:4": "Ва обод уй билан қасам.",
            "verse 52:5": "Ва кўтарилган билан шифт қасам.",
            "verse 52:6": "Ва тўлган денгиз билан қасам.",
            "verse 52:7": "Албатта, Роббинг азоби рўй беражак.",
            "verse 52:8": "Уни ҳеч бир қайтарувчи йўқдир.",
            "verse 52:9": "У кунда осмон ларзага келиб чайқалур.",
            "verse 52:10": "Ва тоғлар сайр этиб юрур.",
            "verse 52:11": "Бас, ўша кунда ёлғонга чиқарувчиларга вайл бўлсин!",
            "verse 52:12": "(Ботилга) шўнғиб ўйнайдиганларга!",
            "verse 52:13": "У кунда жаҳаннам ўтига (куч билан) итарилурлар.",
            "verse 52:14": "Мана бу, сизлар ёлғонга чиқарган ўт бўладир!",
            "verse 52:15": "Бу сеҳрми?! Ёки сизлар кўрмаяпсизларми?!",
            "verse 52:16": "Киринглар унга! Чидайсизларми, чидамайсизларми - барибир. Қилиб юрган амалларингизнинг жазосини олурсизлар, холос.",
            "verse 52:17": "Албатта, тақводорлар жаннатлар ва нозу неъматлар ичидадирлар.",
            "verse 52:18": "Роббилари уларга берган нарсалардан лаззатдадирлар. Роббилари уларни жаҳаннам азобидан сақлар.",
            "verse 52:19": "Енглар, ичинглар, ош бўлсин. (Булар)қилган амалларингиз учундир.",
            "verse 52:20": "Улар қатор тизилган сўриларга ёнбошлаган ҳолдалар. Ва уларни гўзал кўзли ҳурларга уйлаб қўйганмиз.",
            "verse 52:21": "Ўзлари иймон келтириб, зурриётлари уларга иймон билан эргашганларнинг зурриётини уларга қўшдик ва уларнинг амалларидан ҳеч нарсани камайтирмадик. Ҳар бир киши ўз касби гаровидир.",
            "verse 52:22": "Ва Биз уларга хоҳлаган мевалари ва гўштларини муҳайё қилиб қўйдик.",
            "verse 52:23": "Улар унда қадаҳларни бир-бирларига узатурлар. У ерда беҳуда сергаплик ва гуноҳ йўқ.",
            "verse 52:24": "Ва атрофларида худди садафдаги дурдек ғуломлари айланиб, хизматда юришадир.",
            "verse 52:25": "Баъзилари бошқаларидан ўгрилиб сўраша бошладилар.",
            "verse 52:26": "Албатта, биз илгари ўз аҳлимиз даврасида У зотдан қўрқувчилардан эдик.",
            "verse 52:27": "Бас, Аллоҳ бизга марҳамат қилди ва бизни дўзах азобидан сақлади.",
            "verse 52:28": "Албатта, биз илгари Унга дуо қилардик. Албатта, Унинг Ўзи яхшилик қилувчи ва раҳмлидур.",
            "verse 52:29": "Бас, эслатгин: сен Роббинг неъмати ила фолбин ҳам эмассан, мажнун ҳам эмассан.",
            "verse 52:30": "Балки улар: «У шоир, биз унга ўлим етишини кутамиз», дерлар?",
            "verse 52:31": "Сен: «Кутинглар, албатта, мен ҳам сизлар билан бирга кутувчидирман», деб айт.",
            "verse 52:32": "Ё ақллари шунга буюрарми ёки улар туғёнга кетган қавмларми?",
            "verse 52:33": "Балки, у(Қуръон)ни ўзи тўқиди, дерлар? Йўқ, улар иймон келтирмаслар.",
            "verse 52:34": "Агар уларнинг гапи рост бўлса, у(Қуръон)га ўхшаш сўзни келтирсинлар.",
            "verse 52:35": "Балки, улар ҳеч нарсадан ҳеч нарса йўқ ўзлари яралгандирлар?! Ёки улар яратувчиларми?",
            "verse 52:36": "Балки, улар осмонлару ерни яратгандирлар?! Йўқ, улар ишонмаслар.",
            "verse 52:37": "Балки уларнинг ҳузурида Роббингнинг хазиналари бордир?! Ёки улар бошқарувчиларми?",
            "verse 52:38": "Балки уларнинг (хабар) эшитадиган нарвонлари бордир?! Ундоқ бўлса, эшитувчилари равшан ҳужжат келтирсинлар.",
            "verse 52:39": "Ёки У зотга қизлару сизларга ўғилларми?!",
            "verse 52:40": "Ёки сен улардан ҳақ сўраяпсан-у, улар тўловдан қийналаяптиларми?!",
            "verse 52:41": "Балки уларнинг ихтиёрида ғайб (илми) бўлиб, улар ёзиб олаётгандирлар?!",
            "verse 52:42": "Балки ҳийла кўрсатишни хоҳларлар?! Бас, кофирлар ҳийлаларининг жазосини тортурлар.",
            "verse 52:43": "Балки, уларнинг Аллоҳдан бошқа худолари бордир?! Аллоҳ улар келтираётган ширкдан пок бўлди.",
            "verse 52:44": "Агар улар бошларига тушаётган парчани кўрсалар ҳам, тўпланган булут, дерлар.",
            "verse 52:45": "Уларни ҳалокатга учрайдиган кунларига йўлиққунларигача тек қўй.",
            "verse 52:46": "У кунда ҳийлалари уларга ҳеч қандай фойда бермас ва уларга ёрдам ҳам берилмас.",
            "verse 52:47": "Ва, албатта, зулм қилганларга ундан ўзга азоб ҳам бор, лекин кўплари билмаслар.",
            "verse 52:48": "Бас, Роббинг ҳукмига сабр қил. Албатта, сен кўз ўнгимиздасан, ўрингдан турганингда Роббингга тасбиҳ айт!",
            "verse 52:49": "Ва кечаси ҳам. Бас, юлдузлар ботгандан кейин ҳам тасбиҳ айт."
        },
        "Vietnamese": {
            "verse 52:1": "Thề bởi ngọn núi Tur (nơi Allah đã nói chuyện trực tiếp với Musa).",
            "verse 52:2": "Thề bởi Kinh Sách đã được ghi chép.",
            "verse 52:3": "Trên miếng da thuộc được trải ra.",
            "verse 52:4": "Thề bởi Ngôi Đền Ma’mur (ở bên trên bảy tầng trời, nơi mà các Thiên Thần vào thờ phượng Allah).",
            "verse 52:5": "Thề bởi mái (trời) được dựng cao.",
            "verse 52:6": "Thề bởi biển cả dâng trào.",
            "verse 52:7": "Thật vậy, sự trừng phạt của Thượng Đế Ngươi (hỡi Thiên Sứ Muhammad) chắc chắn sẽ xảy ra.",
            "verse 52:8": "Không ai (hay sức mạnh nào) có thể cản được nó.",
            "verse 52:9": "Vào Ngày mà bầu trời sẽ chấn động dữ dội.",
            "verse 52:10": "Những ngọn núi sẽ dịch chuyển khỏi vị trí của nó.",
            "verse 52:11": "Vì vậy, Ngày hôm đó sẽ thật khốn khổ cho những kẻ phủ nhận.",
            "verse 52:12": "Những kẻ mà chúng đùa vui vô bổ.",
            "verse 52:13": "Ngày (đó) chúng sẽ bị đẩy xuống Lửa của Hỏa Ngục một cách thô bạo.",
            "verse 52:14": "(Lúc đó, có tiếng bảo chúng): “Đây chính là Lửa mà các ngươi đã thường hay phủ nhận.”",
            "verse 52:15": "“Đây có phải là trò ảo thuật không hay các ngươi không nhìn thấy?”",
            "verse 52:16": "“Các ngươi cứ chịu thiêu đốt trong đó, cho dù các ngươi có chịu được hay không chịu được thì cũng đành phải chịu, bởi quả thật đó là cái giá cho những gì các ngươi đã làm.”",
            "verse 52:17": "Quả thật, những người ngoan đạo sẽ ở trong các Ngôi Vườn Thiên Đàng và tận hưởng niềm vui.",
            "verse 52:18": "Họ sẽ hạnh phúc với những thứ Thượng Đế của họ ban cấp và với việc Ngài cứu rỗi họ thoát khỏi sự trừng phạt của Hỏa Ngục.",
            "verse 52:19": "(Họ sẽ được bảo): “Hãy ăn và uống thỏa thích bởi những điều các ngươi đã làm!”",
            "verse 52:20": "Họ sẽ tựa mình nằm nghỉ trên những chiếc tràng kỹ được xếp thành hàng và TA (Allah) sẽ kết hôn họ với các nàng Hurun ‘In (tiên nữ có đôi mắt to tuyệt đẹp).",
            "verse 52:21": "Những ai có đức tin và con cháu của họ cùng theo họ trong đức tin sẽ được TA cho đoàn tụ với họ (trong Thiên Đàng). TA sẽ không cắt giảm bất cứ thứ gì (từ phần thưởng) cho việc làm (thiện tốt) của họ. Mỗi con người phải chịu trách nhiệm cho những gì mình đã làm.",
            "verse 52:22": "TA sẽ ban thêm cho họ những loại trái cây và các loại thịt mà họ ưa thích.",
            "verse 52:23": "Trong (Thiên Đàng), họ sẽ trao cho nhau tách uống, và sẽ không có những lời lẽ thô tục và tội lỗi trong đó.",
            "verse 52:24": "Họ sẽ được những thiếu niên xinh đẹp đi vòng quanh phục vụ; (những thiếu niên đó) trông như những viên ngọc trai được cất kỹ.",
            "verse 52:25": "Họ sẽ đến gặp nhau hỏi han, trò chuyện.",
            "verse 52:26": "Họ sẽ nói (với nhau): “Thật vậy, trước đây lúc còn sống với gia đình (trên cõi trần) chúng tôi đã rất sợ (về việc sẽ bị Allah trừng phạt)”.",
            "verse 52:27": "“Nhưng Allah đã ban ân cho chúng tôi và đã cứu chúng tôi khỏi sự trừng phạt của Ngọn Lửa thiêu đốt.”",
            "verse 52:28": "“Quả thật, trước đây chúng tôi đã thường cầu nguyện Ngài. Quả thật, Ngài là Đấng Tử Tế, Đấng Thương Xót.”",
            "verse 52:29": "Vì vậy, Ngươi (hỡi Thiên Sứ Muhammad) hãy (dùng Qur’an) nhắc nhở (mọi người). Quả thật, với ân huệ mà Thượng Đế của Ngươi đã ban cho Ngươi, Ngươi không phải là một tên thầy bói cũng không phải là một kẻ điên.",
            "verse 52:30": "Hoặc chúng (những kẻ phủ nhận) nói: “(Muhammad không phải là Sứ Giả) mà là một nhà thơ, chúng ta cứ đợi xem, sớm muộn gì hắn cũng chết.”",
            "verse 52:31": "Ngươi (hỡi Thiên Sứ Muhammad) hãy nói (với chúng): “Các người hãy đợi, Ta sẽ cùng chờ đợi với các người.”",
            "verse 52:32": "Có phải tâm trí của chúng ra lệnh cho chúng (nói) điều này, hay chúng là đám người vượt quá giới hạn?",
            "verse 52:33": "Hay là chúng cho rằng (Muhammad) đã bịa đặt (Qur’an)? Không, chúng không có đức tin (là do tính tự cao tự đại của chúng mà thôi).",
            "verse 52:34": "(Nếu chúng cho rằng Muhammad bịa đặt), chúng hãy mang đến lời lẽ giống như (Qur’an) xem nào nếu chúng là những kẻ nói thật.",
            "verse 52:35": "Chúng được tạo ra từ cái không là gì hay chúng tự tạo ra bản thân chúng?",
            "verse 52:36": "Hay phải chăng chúng đã tạo ra các tầng trời và trái đất? Không, (chỉ vì) chúng không có một niềm tin vững chắc (nơi Allah mà thôi).",
            "verse 52:37": "Hay phải chăng chúng nắm giữ các kho tàng của Thượng Đế của Ngươi? Hoặc phải chăng chúng là những kẻ toàn quyền kiểm soát (các kho tàng của Ngài)?",
            "verse 52:38": "Hoặc phải chăng chúng có một cái thang (lên trời) để nghe (trực tiếp sự mặc khải của Allah rằng chúng đang ở trên chân lý)? Vậy nên, hãy để kẻ nghe lén của chúng mang ra bằng chứng rõ ràng.",
            "verse 52:39": "Hoặc phải chăng con gái là của Ngài còn con trai là của các ngươi?",
            "verse 52:40": "Hoặc phải chăng Ngươi (Thiên Sứ Muhammad) đã đòi chúng tiền thù lao khiến chúng bị gánh nặng nợ nần (nên không thể tiếp nhận điều Ngươi mang đến cho chúng)?",
            "verse 52:41": "Hoặc phải chăng chúng có kiến thức về điều vô hình nên chúng viết nó xuống?",
            "verse 52:42": "Hoặc phải chăng chúng có mưu đồ (hại Ngươi và tôn giáo của Ngươi – hỡi Thiên Sứ Muhammad)? Nhưng (Ngươi hãy tin chắc nơi Allah rằng) chính những kẻ vô đức tin sẽ là đám người rơi vào mưu đồ của chúng.",
            "verse 52:43": "Hoặc phải chăng chúng có một thượng đế khác ngoài Allah? Quả thật, Allah tối cao và siêu việt vượt hẳn những thứ mà chúng đã gán ghép cho Ngài.",
            "verse 52:44": "Nếu chúng thấy một mảnh vỡ từ trên trời rơi xuống, chúng sẽ nói: “(Đó chỉ là) những đám mây chồng chất lên nhau (rất đỗi bình thường, chẳng có gì nghiêm trọng và to tát cả)!”",
            "verse 52:45": "Vì vậy, Ngươi (Thiên Sứ Muhammad) cứ để mặc chúng cho đến lúc chúng gặp ngày mà chúng sẽ bị trừng phạt.",
            "verse 52:46": "Ngày mà mưu đồ của chúng sẽ không mang lại ích lợi gì cho chúng và chúng sẽ không được ai cứu giúp.",
            "verse 52:47": "Quả thật, ngoài (sự trừng phạt ở Đời Sau), những kẻ làm điều sai quấy còn phải nhận lấy một sự trừng phạt khác (ở cõi trần tục và cõi Barzakh) nhưng hầu hết bọn chúng không biết.",
            "verse 52:48": "Ngươi (hỡi Thiên Sứ Muhammad) hãy kiên nhẫn đợi Quyết Định của Thượng Đế của Ngươi bởi vì quả thật Ngươi luôn ở dưới Mắt của TA. Ngươi hãy tán dương ca ngợi Thượng Đế của Ngươi (bằng lễ nguyện Salah) khi ngủ dậy.",
            "verse 52:49": "Và Ngươi hãy tán dương Ngài (bằng lễ nguyện Salah) vào một phần của đêm và vào (lúc rạng động) khi các vì sao biến mất (bởi ánh sáng của ban ngày)."
        },
        "Yoruba": {
            "verse 52:1": "(Allahu bura pelu) apata Tur",
            "verse 52:2": "(O tun bura pelu) Tira ti won ko sile",
            "verse 52:3": "sinu takada ti won te sile",
            "verse 52:4": "(O tun bura pelu) Ile Abewo naa",
            "verse 52:5": "(O tun bura pelu) aja ti won gbe soke (iyen, sanmo)",
            "verse 52:6": "(O tun bura pelu) agbami odo ina",
            "verse 52:7": "Dajudaju iya Oluwa re maa sele",
            "verse 52:8": "Ko si oludena kan fun un",
            "verse 52:9": "(O maa sele) ni ojo ti sanmo maa mi titi taara",
            "verse 52:10": "Awon apata si maa rin lo taara (bi eruku afedanu)",
            "verse 52:11": "Ni ojo yen, egbe ni fun awon olupe-ododo-niro",
            "verse 52:12": "awon ti won wa ninu isokuso, ti won n sere",
            "verse 52:13": "(Ranti) ojo ti won yoo ti won lo sinu ina Jahanamo ni itikuti",
            "verse 52:14": "Eyi ni Ina naa ti e n pe niro",
            "verse 52:15": "Se idan ni eyi ni tabi e o riran",
            "verse 52:16": "E wo inu re lo. E fara da a tabi e o fara da a, bakan naa ni fun yin. Ohun ti e n se nise ni A oo fi san yin ni esan",
            "verse 52:17": "Dajudaju awon oluberu (Allahu) maa wa ninu awon Ogba ati idera",
            "verse 52:18": "Won yoo maa je igbadun pelu ohun ti Oluwa won fun won. Ati pe (Allahu) yoo so won ninu iya ina Jehim",
            "verse 52:19": "E maa je, e maa mu ni gbedemuke nitori ohun ti e n se nise",
            "verse 52:20": "Won yoo rogboku sori awon ibusun ti won to ni owoowo. A si maa fun won ni awon iyawo eleyinju ege",
            "verse 52:21": "Ati pe awon t’o gbagbo ni ododo, ti awon aromodomo won tun tele won ninu igbagbo ododo, A maa da awon aromodomo won po mo won. A o si nii din kini kan ku ninu ise won. Eni kookan ni oniduuro fun ohun t’o se nise",
            "verse 52:22": "A maa fun won ni alekun eso ati eran ti won nifee si",
            "verse 52:23": "Won yo si maa gba ife oti mu laaarin ara won ninu Ogba Idera. Ko si oro isokuso ati iwa ese ninu Ogba Idera",
            "verse 52:24": "Awon omo-odo won yo si maa lo bo laaarin won. (Won) da bi aluuulu afipamo",
            "verse 52:25": "Apa kan won yoo doju ko apa kan, won yo si maa beere oro lowo ara won",
            "verse 52:26": "Won yoo so pe: \"Dajudaju teletele awa je olupaya laaarin awon eniyan wa",
            "verse 52:27": "Sugbon Allahu saanu wa. O si la wa nibi iya Ina",
            "verse 52:28": "Dajudaju awa maa n pe E teletele. Dajudaju Allahu, Oun ni Oloore, Asake-orun",
            "verse 52:29": "Nitori naa, seranti. Iwo ki i se adabigba tabi were lori idera Oluwa re",
            "verse 52:30": "Tabi won n wi pe: \"Elewi kan ti a n reti iku re ni",
            "verse 52:31": "So pe: \"E maa reti. Dajudaju emi naa wa pelu yin ninu awon olureti",
            "verse 52:32": "Tabi opolo won n pa won lase eyi ni? Tabi ijo alakoyo ni won ni",
            "verse 52:33": "Tabi won n wi pe: \"O da (al-Ƙur’an) hun funra re ni.\" Rara o, won ko gbagbo ni",
            "verse 52:34": "Ki awon naa mu oro kan bi iru re wa ti won ba je olododo",
            "verse 52:35": "Tabi won seda won lai si Aseda? Tabi awon ni won seda ara won ni",
            "verse 52:36": "Tabi awon ni won seda awon sanmo ati ile? Rara o, won ko mamo daju ni",
            "verse 52:37": "Tabi lodo won ni awon apoti oro Oluwa re wa? Tabi awon ni olubori",
            "verse 52:38": "Tabi won ni akaba ti won n fi gboro (ninu sanmo ni)? Ki olugboro won mu eri ponnbele wa",
            "verse 52:39": "Tabi awon omobinrin ni tiRe, awon omokunrin si ni tiyin",
            "verse 52:40": "Tabi o n beere owo-oya kan lodo won, ni gbese fi wo won lorun",
            "verse 52:41": "Tabi imo ikoko wa lodo won, ti won si n ko o sile",
            "verse 52:42": "Tabi won n gbero ete kan ni? Nigba naa, awon t’o sai gbagbo, awon l’o maa f’ori ko ete",
            "verse 52:43": "Tabi won ni olohun kan leyin Allahu ni? Mimo ni fun Allahu tayo nnkan ti won n fi sebo si I",
            "verse 52:44": "Ti won ba si ri apa kan ninu sanmo t’o ya lule, won a wi pe: \"Esujo regede ni (won ko nii gbagbo)",
            "verse 52:45": "Nitori naa, fi won sile titi won yoo fi ba ojo won ti won maa pa won sinu re pade",
            "verse 52:46": "Ojo ti ete won ko nii fi kini kan ro won loro. A o si nii ran won lowo",
            "verse 52:47": "Ati pe dajudaju iya kan n be fun awon t’o sabosi yato si (iya orun) yen, sugbon opolopo won ni ko mo",
            "verse 52:48": "Se suuru fun idajo Oluwa Re, dajudaju iwo wa ni ojuto Wa. Ki o si se afomo pelu idupe fun Oluwa re nigba ti o ba n dide naro (fun irun kiki)",
            "verse 52:49": "Ati ni ale (nigba ti) awon irawo ba kuro nita tan, safomo fun Un"
        }
    }
}