{
    "id": 60,
    "name_simple": "Al-Mumtahanah",
    "revelation_place": "madinah",
    "revelation_order": 91,
    "bismillah_pre": true,
    "verses_count": 13,
    "short_text": "In verse 10 of this Surah it has been enjoined that the women who emigrate to dar al-Islam (the Islamic State) and claim to be Muslims, should be examined hence the title Al-Mumtahinah. The word is pronounced both as mumtahinah and as mumtahanah, the meaning according to the first pronunciation being 'the Surah which examines', and according to the second, 'the woman who is examined.'",
    "text": [
        "\n",
        "In verse 10 of this Surah it has been enjoined that the women who emigrate to dar al-Islam (the Islamic State) and claim to be Muslims, should be examined hence the title Al-Mumtahinah. The word is pronounced both as mumtahinah and as mumtahanah, the meaning according to the first pronunciation being \"the Surah which examines\", and according to the second, \"the woman who is examined.\"",
        "\n",
        "Period of Revelation",
        "\n",
        "The Surah deals with two incidents, the time of the occurrence of which is well known historically. The first relates to Hadrat Hatib bin Abz Balta'a, who, a little before the conquest of Makkah, had sent a secret letter to the Quraish chiefs informing them of the Holy Prophet's intention to attack them. The second relates to the Muslim women, who had started emigrating from Makkah to Madinah, after the conclusion of the Truce of Hudaibiyah, and the problem arose whether they also were to be returned to the disbelievers, like the Muslim men, according to the conditions of the Truce. The mention of these two things absolutely determines that this Surah came down during the interval between the Truce of Hudaibiyah and the Conquest of Makkah. Besides, there is a third thing also that has been mentioned at the end of the Surah to the effect; What should the Holy Prophet (upon whom be Allah's peace) make the women to pledge when they come to take the oath of allegiance before him as\r\nbelievers?About this part also the guess is that this too was sent down some time before the conquest of Makkah, for after this conquest a large number of the Quraish women, like their men, were going to enter Islam simultaneously and had to be administered the oath of allegiance collectively.",
        "\n",
        "Theme and Topics",
        "\n",
        "This Surah has three parts;",
        "\n",
        "The first part consists of vv. 1-9, and the concluding verse 13 also relates to it. In this strong exception has been taken to the act of Hadrat Hatib bin Abi Balta'a in that he had tried to inform the enemy of a very important war secret of the Holy Prophet (upon whom be Allah's peace) only for the sake of safe guarding his family. This would have caused great bloodshed at the conquest of Makkah had it not been made ineffective in time. It would have cost the Muslims many precious lives; many of the Quraish would have been killed, who were to render great services to Islam afterward; the gains which were to accrue from conquering Makkah peacefully would have been lost, and all these serious losses would have resulted only because one of the Muslims had wanted to safeguard his family from the dangers of war. Administering a severe warning at this blunder Allah has taught the believers the lesson that no believer should, under any circumstances and for any motive, have relations\r\nof love and friendship with the disbelievers, who are actively hostile to Islam, and a believer should refrain from everything which might be helpful to them in the conflict between Islam and disbelief. However, there is no harm in dealing kindly and justly with those disbelievers, who may not be practically engaged in hostile activities against Islam and persecution of the Muslims.",
        "\n",
        "The second part consists of vv. 10-11. In this a social problem has been settled, which was agitating the minds at that time. There were many Muslim women in Makkah, whose husbands were pagans, but they were emigrating and reaching Madinah somehow. Likewise, there were many Muslim men in Madinah, whose wives were pagans and had been left behind in Makkah. The question arose whether the marriage bond between them continued to be valid or not. Allah settled this problem for ever, saying that the pagan husband is not lawful for the Muslim women, nor the pagan wife lawful for the Muslim husband. This decision leads to very important legal consequences, which we shall explain in our notes below.",
        "\n",
        "The third section consists of verse 12, in which the Holy Prophet (upon whom be Allah's peace) has been instructed to ask the women who accept Islam to pledge that they would refrain from the major evils that were prevalent among the womenfolk of the pre-Islamic Arab society, and to promise that they would henceforth follow the ways of goodness which the Messenger of Allah may enjoin.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that instituted for lone female Émigrés to Islam the swearing of a scared oath as the test of faith, The Women Tested, establishing publicly that their migration was purely for the sake of God, without worldly motive, so as to vouchsafe to them full protection and rights in the Muslim community. It takes its name from verse 10 concerning “the testing” (imtiḥān) of new female converts to Islam. The surah was revealed between the Treaty of Ḥudaybiyyah and the conquest of Mecca: instructions are given on how to deal with women who leave Mecca and join the Muslims, and the procedure for wives who leave Medina for Mecca (verse 10 .). The Muslims are instructed on the appropriate allocation of their loyalties (verse 1 ., verse 7 . and verse 13) and Abraham is cited for them as an example to learn from (verse 4).The surah is also known as: Examining Her, She Who Is Tested, That Which Examines, The Examiner, The Test of Faith, The Woman Tried, The Woman to be Examined, Women Tested.",
    "name_translation": "The Woman Tested",
    "name_complex": "Al-Mumtahanah",
    "surah_name_ar": "الممتحنة",
    "verses": {
        "Albanian": {
            "verse 60:1": "O besimtarë, mos e konsideroni armikun Tim dhe tuajin për dashamir; ju po shprehni dashuri ndaj tyre, kurse ata, me të vërtetë, kanë mohuar të drejtën që u ka ardhur juve, e dëbuan Profetin dhe juve, vetëm se besonit në Perëndinë, Zotin tuaj (mos i bëni ata dashamirë), në qoftë se jeni (keni dalë) luftëtarë në rrugën Time dhe për kënaqësinë Time. Ju fshehurazi i shfaqni atyre dashuri, por Unë di edhe atë që fshini dhe atë që punoni haptazi. Ai prej jush, i cili armikun e bën dashamir, ai ka devijuar rrugën e drejtë.",
            "verse 60:2": "Nëse bini në duart e tyre, ata do të jenë armiq tuaj dhe do t’i zgjasin duart e tyre dhe gjuhët e tyre me qëllim të keq, dhe dëshirojnë që t’ju bëjnë jobesimtarë.",
            "verse 60:3": "Nuk do t’ju ndihmojnë juve në Ditën e Kijametit, as fëmijët, as farefisi. Ai do t’ju ndanë mes juve; - e, Perëndia, sheh mirë atë që punoni ju.",
            "verse 60:4": "Shembull i mrekullueshëm për ju është Ibrahimi dhe ata që kanë qenë me të, kur i thanë popullit të vet: “Ne jemi larg prej jush dhe prej atyre që i luteni ju, përveç Perëndisë, na nuk u besojmë juve dhe armiqësia e urrejtja midis nesh është e përhershme, përderisa të mos besoni se ekziston një Perëndi i vetëm”; por, përveç fjalës së Ibrahimit (për të mirën e babës së tij): “Unë do të kërkoj falje për ty, por nuk kam kurrfarë mundësie për të shpëtuar ty prej dënimit të Perëndisë”. O Zoti ynë, te Ti mbështetemi dhe Ty të drejtohemi dhe te Ti do të kthehemi.",
            "verse 60:5": "O Zoti ynë, mos lejo që të bijmë në provë të pafeve dh falna neve. O Zoti ynë, me të vërtetë, Ti je i Plotëfuqishëm dhe i Gjithëdijshëm.",
            "verse 60:6": "Me të vërtetë, ky ka qenë shembull i mirë për ju, për ata që shpresojnë në Perëndinë dhe në Ditën e Kijametit. E kush shmanget, me të vërtetë, Perëndia është i pavarur, Ai meriton tërë falenderimin!",
            "verse 60:7": "Ka gjasë që Perëndia do të lidhë (vendosë) dashuri midis jush dhe atyre ndaj të cilëve keni qëndrim armiqësor; Perëndia është i Plotëfuqishëm dhe falës e mëshirues.",
            "verse 60:8": "Perëndia nuk ju ndalon të shprehni mirësinë dhe të jeni të drejtë ndaj atyre, të cilët nuk luftojnë kundër jush për shkak të fesë (suaj) dhe që nuk ju dëbojnë juve prej shtëpive tuaja. Me të vërtetë, Perëndia i don të drejtit.",
            "verse 60:9": "Perëndia u ndalon juve t’i bnëi miq ata që luftojnë kundër jush për shkak të fesë dhe ju dëbojnë nga vatrat tuaja, si dhe kontribuojnë që të jeni të dëbuar; e kushdo që i bën miq ata – të tillët janë zullumqarë.",
            "verse 60:10": "O besimtarë, kur u vijnë juve besimtaret emigrante, provoni (besimin) tek ato, - e Perëndia më së miri e di besimin e tyre. Nëse bindeni se ato janë besimtare, mos i ktheni te pabesimtarët: Ato nuk u lejohen atyre, si dhe as ata nuk janë të lejueshëm për to. Jepni shpenzimet e bëra atyre (jobesimtarëve). Nuk ka pengesë që t’i merrni ju ato për bashkëshorte, pasi t’u jepini dhurata martese. Mos qëndroni në martesë me idhujtare (pagane). Kërkoni atë që keni dhënë (si dhuratë martese), por dhe ata (jobesimtarët) le të kërkojnë atë që kanë dhënë (si dhuratë martese). Ky është gjykimi i Zotit, Ai gjykon në mes jush, e Perëndia di çdo gjë dhe është i Gjithëdijshëm.",
            "verse 60:11": "E, nëse ndonjëra prej grave tuaja kthehet te jobesimtarët si dhe anasjelltas, atëherë plotësoniu atyre shpenzimet e martesës. Dhe druajuni Perëndisë, të cilit i besoni ju!",
            "verse 60:12": "O Pejbamer, kur të vijnë ty besimtaret që të betohen se: nuk do t’i bëjnë shok Perëndisë asgjë, se nuk do të vjedhin, se nuk do të kurvërojnë, se nuk do t’i mbysin fëmijët e tyre dhe se nuk do të vijnë me ndonjë mashtrim (shpifje) të madh në atë që gjendet në mes duarve dhe këmbëve të tyre (mos të bëjnë kopil), dhe që të mos kundërshtojnë ty në atë që është e arsyeshme (në kryerjen e dispozitave të fesë), ti pranoje betimin e tyre dhe lutju Perëndisë për to; me të vërtetë, Perëndia është falës dhe mëshirues.",
            "verse 60:13": "O besimtarë, mos e bëni mik atë popull, në të cilin Perëndia është i zemëruar, ata e kanë humbur shpresën për jetën tjetër, ashtu sikundër jobesimtarët që e kanë humbur tërë shpresën prej të varrosurve (se do të ringjallen)."
        },
        "Amharic": {
            "verse 60:1": "እናንተ ያመናችሁ ሆይ! ጠላቶቼንና ጠላቶቻችሁን ወዳጆች አድርገችሁ አትያዙ፡፡ ከእውነቱ የመጣላችሁን ሃይማኖት በእርግጥ የካዱ ሲኾኑ ውዴታን ወደእነርሱ ታደርሳላችሁ፡፡ መልክተኛውንና እናንተን በአላህ በጌታችሁ ስላመናችሁ (ከመካ) ያወጣሉ፡፡ በመንገዴ ለመታገልና ውዴታዬን ለመፈለግ የወጣችሁ እንደኾናችሁ (ወዳጆች አድርጋችሁ አትያዙዋቸው)፡፡ እኔ የምትደብቁትንና የምትገልጹትን ሁሉ የማውቅ ስኾን ወደእነርሱ በፍቅር ትመሳጠራላችሁ፡፡ ከእናንተም (ይህንን) የሚሠራ ሰው ቀጥተኛውን መንገድ በእርግጥ ተሳሳተ፡፡",
            "verse 60:2": "ቢያሸንፏችሁ ለእናንተ ጠላቶች ይኾናሉ፡፡ እጆቻቸውንና ምላሶቻቸውንም ወደእናንተ በክፉ ይዘረጋሉ፡፡ ብትክዱም ተመኙ፡፡",
            "verse 60:3": "ዘመዶቻችሁም፣ ልጆቻችሁም በትንሣኤ ቀን አይጠቅሟችሁም፤ (አላህ) በመካከላችሁ ይለያል፡፡ አላህም የምትሠሩትን ሁሉ ተመልካች ነው፡፡",
            "verse 60:4": "በኢብራሂምና በእነዚያ ከእርሱ ጋር በነበሩት (ምእምናን) መልካም መከተል አለቻችሁ፡፡ ለሕዝቦቻቸው «እኛ ከእናንተ ከአላህ ሌላ ከምትግገዙትም ንጹሖች ነን፡፡ በእናንተ ካድን፡፡ በአላህ አንድ ብቻ ሲኾን እስከምታምኑ ድረስ በእኛና በእናንተ መካከል ጠብና ጥላቻ ዘወትር ተገለጸ፡፡» ባሉ ጊዜ (መልካም መከተል አለቻችሁ)፡፡ ኢብራሂም ለአባቱ «እኔ ለአንተ ከአላህ (ቅጣት) ምንም የማልጠቅም ስኾን ለአንተ በእርግጥ ምሕረትን እለምንልኻለሁ» ማለቱ ብቻ ሲቀር፡፡ «ጌታችን ሆይ! በአንተ ላይ ተመካን፡፡ ወደ አንተም ተመለስን መመለሻም ወደ አንተ ብቻ ነው፤» (ባለው ተከተሉት)፡፡",
            "verse 60:5": "ጌታችን ሆይ! ለእነዚያ ለካዱት ሰዎች መሞከሪያ አታድርገን፡፡ ለእኛም ምሕረት አድርግልን፡፡ ጌታችን ሆይ! አንተ አሸናፊው ጥበበኛው አንተ ብቻ ነህ፡፡",
            "verse 60:6": "ለእናንተ አላህንና የመጨረሻውን ቀን ለሚፈራ ሰው በእነርሱ መልካም መከተል አልላችሁ፡፡ የሚዞርም ሰው (ራሱን ይጎዳል)፡፡ አላህ ተብቃቂው ምስጉኑ እርሱ ብቻ ነውና፡፡",
            "verse 60:7": "በናንተና በእነዚያ ከእነርሱ ጋር በተጣላችሁት ሰዎች መካከል አላህ መፋቀርን ሊያደርግ ይቻላል፡፡ አላህም ቻይ ነው፡፡ አላህም በጣም አዛኝ ነው፡፡",
            "verse 60:8": "ከእነዚያ በሃይማኖት ካልተጋደሏችሁ ከአገሮቻችሁም ካላወጡዋችሁ (ከሓዲዎች) መልካም ብትውሉላቸውና ወደእነርሱ ብታስተካክሉ አላህ አይከለክላችሁም፡፡ አላህ ትክክለኞችን ይወዳልና፡፡",
            "verse 60:9": "አላህ የሚከለክላችሁ ከእነዚያ በሃይማኖት ከተጋደሉዋችሁ፣ ከቤቶቻችሁም ካወጡዋችሁ፣ እናንተም በማውጣት ላይ ከረዱት (ከሓዲዎች) እንዳትወዳጁዋቸው ብቻ ነው፡፡ ወዳጅ የሚያደርጓቸውም ሰዎች እነዚያ እነርሱ በዳዮቹ ናቸው፡፡",
            "verse 60:10": "እላንተ ያመናችሁ ሆይ! ምእምናት ስደተኞች ኾነው በመጧችሁ ጊዜ (ለሃይማኖት መሰደዳቸውን) ፈትኑዋቸው፡፡ አላህ በእምነታቸው ይበልጥ ዐዋቂ ነው፡፡ አማኞችም መኾናቸውን ብትውቁ ወደ ከሓዲዎቹ አትመልሱዋቸው፡፡ እነርሱ (ሴቶቹ) ለእነርሱ የተፈቀዱ አይደሉምና፡፡ እነርሱም (ወንዶቹ) ለእነርሱ አይፈቀዱምና፡፡ ያወጡትንም ገንዘብ ስጧቸው፡፡ መህራቸውንም በሰጣችኋቸው ጊዜ ብታገቡዋቸው በእናንተ ላይ ኃጢአት የለባችሁም፡፡ የከሓዲዎቹንም ሴቶች የጋብቻ ቃል ኪዳኖች አትያዙ፤ ያወጣችሁትንም ገንዘብ ጠይቁ፡፡ ያወጡትንም ይጠይቁ፡፡ ይህ የአላህ ፍርድ ነው፡፡ በመካከላችሁ ይፈርዳል፡፡ አላህም ዐዋቂ ጥበበኛ ነው፡፡",
            "verse 60:11": "ከሚስቶቻችሁም ወደ ከሓዲዎቹ አንዳቸው ቢያመልጧችሁ ቀጥሎም ብትዘምቱባቸው ለእነዚያ ሚስቶቻቸው ለኼዱባቸው (ሰዎች) ያወጡትን ብጤ ስጧቸው፡፡ ያንንም እናንተ በርሱ ያመናችሁበትን አላህን ፍሩ፡፡",
            "verse 60:12": "አንተ ነቢዩ ሆይ! ምእምናቶቹ በአላህ ምንንም ላያጋሩ፣ ላይሰርቁም ላያመነዝሩም፣ ልጆቻቸውን ላይገድሉም፣ በእጆቻቸውና በእግሮቻቸው መካከልም የሚቀጣጥፉት የኾነን ኃጢኣት ላያመጡ (ላይሠሩ) በበጎም ሥራ ትዕዛዝህን ላይጥሱ ቃል ኪዳን ሊገቡልህ በመጡህ ጊዜ ኪዳን ተጋባቸው፡፡ ለእነርሱም አላህን ምሕረት ለምንላቸው፡፡ አላህ በጣም መሓሪ አዛኝ ነውና፡፡",
            "verse 60:13": "እላንተ ያመናቸሁ ሆይ! አላህ በእነርሱ ላይ የተቆጣባቸውን ሕዝቦች አትወዳጁ፡፡ ከሓዲዎች ከመቃብር ሰዎች ተስፋ እንደቆረጡ ከመጨረሻይቱ ዓለም (ምንዳ) በእርግጥ ተስፋ ቆርጠዋል፡፡"
        },
        "Arabic": {
            "verse 60:1": "ِليِبَّسلا َءاَوَس َّلَض ْدَقَف ْمُكنِم ُهْلَعْفَي نَمَو ۚ ْمُتنَلْعَأ اَمَو ْمُتْيَفْخَأ اَمِب ُمَلْعَأ اَنَأَو ِةَّدَوَمْلاِب مِهْيَلِإ َنوُّرِسُت ۚ يِتاَضْرَم َءاَغِتْباَو يِليِبَس يِف اًداَهِج ْمُتْجَرَخ ْمُتنُك نِإ ْمُكِّبَر ِهَّللاِب اوُنِمْؤُت نَأ ۙ ْمُكاَّيِإَو َلوُسَّرلا َنوُجِرْخُي ِّقَحْلا َنِّم مُكَءاَج اَمِب اوُرَفَك ْدَقَو ِةَّدَوَمْلاِب مِهْيَلِإ َنوُقْلُت َءاَيِلْوَأ ْمُكَّوُدَعَو يِّوُدَع اوُذِخَّتَت اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 60:2": "َنوُرُفْكَت ْوَل اوُّدَوَو ِءوُّسلاِب مُهَتَنِسْلَأَو ْمُهَيِدْيَأ ْمُكْيَلِإ اوُطُسْبَيَو ًءاَدْعَأ ْمُكَل اوُنوُكَي ْمُكوُفَقْثَي نِإ",
            "verse 60:3": "ٌريِصَب َنوُلَمْعَت اَمِب ُهَّللاَو ۚ ْمُكَنْيَب ُلِصْفَي ِةَماَيِقْلا َمْوَي ۚ ْمُكُداَلْوَأ اَلَو ْمُكُماَحْرَأ ْمُكَعَفنَت نَل",
            "verse 60:4": "ُريِصَمْلا َكْيَلِإَو اَنْبَنَأ َكْيَلِإَو اَنْلَّكَوَت َكْيَلَع اَنَّبَّر ۖ ٍءْيَش نِم ِهَّللا َنِم َكَل ُكِلْمَأ اَمَو َكَل َّنَرِفْغَتْسَأَل ِهيِبَأِل َميِهاَرْبِإ َلْوَق اَّلِإ ُهَدْحَو ِهَّللاِب اوُنِمْؤُت ٰىَّتَح اًدَبَأ ُءاَضْغَبْلاَو ُةَواَدَعْلا ُمُكَنْيَبَو اَنَنْيَب اَدَبَو ْمُكِب اَنْرَفَك ِهَّللا ِنوُد نِم َنوُدُبْعَت اَّمِمَو ْمُكنِم ُءآَرُب اَّنِإ ْمِهِمْوَقِل اوُلاَق ْذِإ ُهَعَم َنيِذَّلاَو َميِهاَرْبِإ يِف ٌةَنَسَح ٌةَوْسُأ ْمُكَل ْتَناَك ْدَق",
            "verse 60:5": "ُميِكَحْلا ُزيِزَعْلا َتنَأ َكَّنِإ ۖ اَنَّبَر اَنَل ْرِفْغاَو اوُرَفَك َنيِذَّلِّل ًةَنْتِف اَنْلَعْجَت اَل اَنَّبَر",
            "verse 60:6": "ُديِمَحْلا ُّيِنَغْلا َوُه َهَّللا َّنِإَف َّلَوَتَي نَمَو ۚ َرِخآْلا َمْوَيْلاَو َهَّللا وُجْرَي َناَك نَمِّل ٌةَنَسَح ٌةَوْسُأ ْمِهيِف ْمُكَل َناَك ْدَقَل",
            "verse 60:7": "ٌميِحَّر ٌروُفَغ ُهَّللاَو ۚ ٌريِدَق ُهَّللاَو ۚ ًةَّدَوَّم مُهْنِّم مُتْيَداَع َنيِذَّلا َنْيَبَو ْمُكَنْيَب َلَعْجَي نَأ ُهَّللا ىَسَع ۞",
            "verse 60:8": "َنيِطِسْقُمْلا ُّبِحُي َهَّللا َّنِإ ۚ ْمِهْيَلِإ اوُطِسْقُتَو ْمُهوُّرَبَت نَأ ْمُكِراَيِد نِّم مُكوُجِرْخُي ْمَلَو ِنيِّدلا يِف ْمُكوُلِتاَقُي ْمَل َنيِذَّلا ِنَع ُهَّللا ُمُكاَهْنَي اَّل",
            "verse 60:9": "َنوُمِلاَّظلا ُمُه َكِئَٰلوُأَف ْمُهَّلَوَتَي نَمَو ۚ ْمُهْوَّلَوَت نَأ ْمُكِجاَرْخِإ ٰىَلَع اوُرَهاَظَو ْمُكِراَيِد نِّم مُكوُجَرْخَأَو ِنيِّدلا يِف ْمُكوُلَتاَق َنيِذَّلا ِنَع ُهَّللا ُمُكاَهْنَي اَمَّنِإ",
            "verse 60:10": "(ٌميِكَح ٌميِلَع ُهَّللاَو ۚ ْمُكَنْيَب ُمُكْحَي ۖ ِهَّللا ُمْكُح ْمُكِلَٰذ ۚ اوُقَفنَأ اَم اوُلَأْسَيْلَو ْمُتْقَفنَأ اَم اوُلَأْساَو ِرِفاَوَكْلا ِمَصِعِب اوُكِسْمُت اَلَو ۚ َّنُهَروُجُأ َّنُهوُمُتْيَتآ اَذِإ َّنُهوُحِكنَت نَأ ْمُكْيَلَع َحاَنُج اَلَو ۚ اوُقَفنَأ اَّم مُهوُتآَو ۖ َّنُهَل َنوُّلِحَي ْمُه اَلَو ْمُهَّل ٌّلِح َّنُه اَل ۖ ِراَّفُكْلا ىَلِإ َّنُهوُعِجْرَت اَلَف ٍتاَنِمْؤُم َّنُهوُمُتْمِلَع ْنِإَف ۖ َّنِهِناَميِإِب ُمَلْعَأ ُهَّللا ۖ َّنُهوُنِحَتْماَف ٍتاَرِجاَهُم ُتاَنِمْؤُمْلا ُمُكَءاَج اَذِإ اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 60:11": "(َنوُنِمْؤُم ِهِب مُتنَأ يِذَّلا َهَّللا اوُقَّتاَو ۚ اوُقَفنَأ اَم َلْثِّم مُهُجاَوْزَأ ْتَبَهَذ َنيِذَّلا اوُتآَف ْمُتْبَقاَعَف ِراَّفُكْلا ىَلِإ ْمُكِجاَوْزَأ ْنِّم ٌءْيَش ْمُكَتاَف نِإَو",
            "verse 60:12": "(ٌميِحَّر ٌروُفَغ َهَّللا َّنِإ ۖ َهَّللا َّنُهَل ْرِفْغَتْساَو َّنُهْعِياَبَف ۙ ٍفوُرْعَم يِف َكَنيِصْعَي اَلَو َّنِهِلُجْرَأَو َّنِهيِدْيَأ َنْيَب ُهَنيِرَتْفَي ٍناَتْهُبِب َنيِتْأَي اَلَو َّنُهَداَلْوَأ َنْلُتْقَي اَلَو َنيِنْزَي اَلَو َنْقِرْسَي اَلَو اًئْيَش ِهَّللاِب َنْكِرْشُي اَّل نَأ ٰىَلَع َكَنْعِياَبُي ُتاَنِمْؤُمْلا َكَءاَج اَذِإ ُّيِبَّنلا اَهُّيَأ اَي",
            "verse 60:13": "(ِروُبُقْلا ِباَحْصَأ ْنِم ُراَّفُكْلا َسِئَي اَمَك ِةَرِخآْلا َنِم اوُسِئَي ْدَق ْمِهْيَلَع ُهَّللا َبِضَغ اًمْوَق اْوَّلَوَتَت اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي"
        },
        "Azerbaijani": {
            "verse 60:1": "Ey iman gətirənlər! Mənim düşmənimi də, öz düşməninizi də özünüzə dost tutmayın! Onlar sizə gələn həqiqəti inkar etdikləri halda, siz onlara mehribanlıq göstərib sirrinizi açıb deyirsiniz. Rəbbiniz olan Allaha iman gətirdiyiniz üçün onlar Peyğəmbəri və sizi yurdunuzdan qovub çıxardırlar. Əgər siz Mənim yolumda və Mənim razılığımı qazanmaq uğrunda cihada çıxmısınızsa, onlara gizlində mehribanlıq göstərirsiniz. Mən sizin gizli saxladığınızı da, aşkar etdiyinizi də bilirəm. Sizlərdən kim bunu etsə, doğru yoldan sapmış olar.",
            "verse 60:2": "Əgər onlar sizi ələ keçirsələr, sizə düşmən kəsilər, əlləri və dilləri ilə sizə pislik edər və sizin kafir olmanızı istəyərlər.",
            "verse 60:3": "Nə qohumlarınız, nə də övladlarınız sizə bir fayda verə bilər. Qiyamət günü Allah sizi bir-birinizdən ayıracaqdır. Allah nə etdiklərinizi görür.",
            "verse 60:4": "İbrahim və onunla birlikdə olanlarda sizin üçün gözəl bir nümunə vardır. Onlar öz qövmünə dedilər: “Həqiqətən, biz sizdən və sizin Allahdan başqa tapındığınız şeylərdən uzağıq. Biz sizi inkar edirik. Siz bir olan Allaha iman gətirincəyə qədər bizimlə sizin aranızda daim ədavət və nifrət olacaqdır!” Yalnız İbrahimin öz atasına: “Mən sənin üçün mütləq bağışlanma diləyəcəyəm. Fəqət Allahdan sənə gələn əzabı dəf edə bilmərəm!”– deməsi istisnadır. Onlar dedilər: “Ey Rəbbimiz! Biz yalnız Sənə təvəkkül edir və yalnız Sənə üz tuturuq. Dönüş də yalnız Sənədir.",
            "verse 60:5": "Ey Rəbbimiz! Bizi kafirlər üçün sınaq etmə. Ey Rəbbimiz, bizi bağışla. Həqiqətən, Sən Qüdrətlisən, Müdriksən!”",
            "verse 60:6": "Onlarda sizin üçün – Allaha və Axirət gününə ümid bəsləyənlər üçün gözəl nümunə vardır. Kim üz döndərsə bilsin ki, Allah Zəngindir, Tərifəlayiqdir.",
            "verse 60:7": "Ola bilsin ki, Allah sizinlə ədavət bəslədiyiniz kimsələr arasında dostluq yaratsın. Allah hər şeyə Qadirdir. Allah Bağışlayandır, Rəhmlidir.",
            "verse 60:8": "Allah din uğrunda sizinlə vuruşmayan və sizi öz diyarınızdan qovub çıxartmayan kimsələrə yaxşılıq etmənizi və onlarla insafla davranmanızı sizə qadağan etmir. Şübhəsiz ki, Allah insaflı olanları sevir.",
            "verse 60:9": "Allah sizə ancaq sizinlə din uğrunda vuruşan, sizi diyarınızdan qovub çıxardan və çıxarılmanıza kömək edən kimsələrlə dostluq etmənizi qadağan edir. Onlarla dostluq edənlər zalımlardır.",
            "verse 60:10": "Ey iman gətirənlər! Mömin qadınlar hicrət edib sizin yanınıza gəldikləri zaman onları imtahana çəkin. Allah onların imanını daha yaxşı bilir. Əgər bunların mömin olduqlarını bilsəniz, onları kafirlərə qaytarmayın. Nə bunlar onlara halaldır, nə də onlar bunlara halaldırlar. Kafirlərin bu qadınlara sərf etdikləri mehri özlərinə qaytarın. Həmin qadınların mehrlərini özlərinə verdiyiniz halda onlarla evlənməyinizdə sizə heç bir günah yoxdur. Kafir qadınlarınızı kəbin altında saxlamayın, sərf etdiyiniz mehri tələb edin. Qoy onlar da mömin qadınlara sərf etdikləri mehri sizdən tələb etsinlər. Allahın hökmü budur. O sizin aranızda hökm verir. Allah Biləndir, Müdrikdir.",
            "verse 60:11": "Əgər zövcələrinizdən hər hansı biri sizi qoyub kafirlərin yanına getsə və siz də kafirlərlə vuruşub qalib gəlsəniz, ələ keçirdiyiniz qənimətdən zövcələri çıxıb getmiş kimsələrə onların sərf etdikləri mehr qədər verin. İman gətirdiyiniz Allahdan qorxun!",
            "verse 60:12": "Ey Peyğəmbər! Mömin qadınlar Allaha heç bir şərik qoşmayacaqlarına, oğurluq və zina etməyəcəklərinə, uşaqlarını öldürməyəcəklərinə, əlləri ilə ayaqları arasından olanı yalanla ört-basdır etməyəcəklərinə (ərlərindən olmayan uşaqlarını onlara isnad etməyəcəklərinə) və heç bir yaxşı işdə sənə qarşı çıxmayacaqlarına dair sənə beyət etmək üçün yanına gəldikləri zaman onların beyətini qəbul et və Allahdan onlar üçün bağışlanma dilə. Həqiqətən, Allah Bağışlayandır, Rəhmlidir.",
            "verse 60:13": "Ey iman gətirənlər! Allahın qəzəbinə gəlmiş adamlarla dostluq etməyin. Kafirlər qəbirdəkilərin bir daha diriləcəyinə inanmadıqları kimi, Axirət gününə də ümid etmirlər."
        },
        "Bengali": {
            "verse 60:1": "মুমিনগণ, তোমরা আমার ও তোমাদের শত্রুদেরকে বন্ধরূপে গ্রহণ করো না। তোমরা তো তাদের প্রতি বন্ধুত্বের বার্তা পাঠাও, অথচ তারা যে সত্য তোমাদের কাছে আগমন করেছে, তা অস্বীকার করছে। তারা রসূলকে ও তোমাদেরকে বহিস্কার করে এই অপরাধে যে, তোমরা তোমাদের পালনকর্তার প্রতি বিশ্বাস রাখ। যদি তোমরা আমার সন্তুষ্টিলাভের জন্যে এবং আমার পথে জেহাদ করার জন্যে বের হয়ে থাক, তবে কেন তাদের প্রতি গোপনে বন্ধুত্বের পয়গাম প্রেরণ করছ? তোমরা যা গোপন কর এবং যা প্রকাশ কর, ত আমি খুব জানি। তোমাদের মধ্যে যে এটা করে, সে সরলপথ থেকে বিচ্যুত হয়ে যায়।",
            "verse 60:2": "তোমাদেরকে করতলগত করতে পারলে তারা তোমাদের শত্রু হয়ে যাবে এবং মন্দ উদ্দেশ্যে তোমাদের প্রতি বাহু ও রসনা প্রসারিত করবে এবং চাইবে যে, কোনরূপে তোমরা ও কাফের হয়ে যাও।",
            "verse 60:3": "তোমাদের স্বজন-পরিজন ও সন্তান-সন্ততি কিয়ামতের দিন কোন উপকারে আসবে না। তিনি তোমাদের মধ্যে ফয়সালা করবেন। তোমরা যা কর, আল্লাহ তা দেখেন।",
            "verse 60:4": "তোমাদের জন্যে ইব্রাহীম ও তাঁর সঙ্গীগণের মধ্যে চমৎকার আদর্শ রয়েছে। তারা তাদের সম্প্রদায়কে বলেছিলঃ তোমাদের সাথে এবং তোমরা আল্লাহর পরিবর্তে যার এবাদত কর, তার সাথে আমাদের কোন সম্পর্ক নেই। আমরা তোমাদের মানি না। তোমরা এক আল্লাহর প্রতি বিশ্বাস স্থাপন না করলে তোমাদের মধ্যে ও আমাদের মধ্যে চিরশত্রুতা থাকবে। কিন্তু ইব্রাহীমের উক্তি তাঁর পিতার উদ্দেশে এই আদর্শের ব্যতিক্রম। তিনি বলেছিলেনঃ আমি অবশ্যই তোমার জন্য ক্ষমাপ্রার্থনা করব। তোমার উপকারের জন্যে আল্লাহর কাছে আমার আর কিছু করার নেই। হে আমাদের পালনকর্তা! আমরা তোমারই উপর ভরসা করেছি, তোমারই দিকে মুখ করেছি এবং তোমারই নিকট আমাদের প্রত্যাবর্তন।",
            "verse 60:5": "হে আমাদের পালনকর্তা! তুমি আমাদেরকে কাফেরদের জন্য পরীক্ষার পাত্র করো না। হে আমাদের পালনকর্তা! আমাদের ক্ষমা কর। নিশ্চয় তুমি পরাক্রমশালী, প্রজ্ঞাময়।",
            "verse 60:6": "তোমরা যারা আল্লাহ ও পরকাল প্রত্যাশা কর, তোমাদের জন্য তাদের মধ্যে উত্তম আদর্শ রয়েছে। আর যে মুখ ফিরিয়ে নেয়, তার জানা উচিত যে, আল্লাহ বেপরওয়া, প্রশংসার মালিক।",
            "verse 60:7": "যারা তোমাদের শত্রু আল্লাহ তাদের মধ্যে ও তোমাদের মধ্যে সম্ভবতঃ বন্ধুত্ব সৃষ্টি করে দেবেন। আল্লাহ সবই করতে পারেন এবং আল্লাহ ক্ষমাশীল, করুণাময়।",
            "verse 60:8": "ধর্মের ব্যাপারে যারা তোমাদের বিরুদ্ধে লড়াই করেনি এবং তোমাদেরকে দেশ থেকে বহিস্কৃত করেনি, তাদের প্রতি সদাচরণ ও ইনসাফ করতে আল্লাহ তোমাদেরকে নিষেধ করেন না। নিশ্চয় আল্লাহ ইনসাফকারীদেরকে ভালবাসেন।",
            "verse 60:9": "আল্লাহ কেবল তাদের সাথে বন্ধুত্ব করতে নিষেধ করেন, যারা ধর্মের ব্যাপারে তোমাদের বিরুদ্ধে যুদ্ধ করেছে, তোমাদেরকে দেশ থেকে বহিস্কৃত করেছে এবং বহিস্কারকার্যে সহায়তা করেছে। যারা তাদের সাথে বন্ধুত্ব করে তারাই জালেম।",
            "verse 60:10": "মুমিনগণ, যখন তোমাদের কাছে ঈমানদার নারীরা হিজরত করে আগমন করে, তখন তাদেরকে পরীক্ষা কর। আল্লাহ তাদের ঈমান সম্পর্কে সম্যক অবগত আছেন। যদি তোমরা জান যে, তারা ঈমানদার, তবে আর তাদেরকে কাফেরদের কাছে ফেরত পাঠিও না। এরা কাফেরদের জন্যে হালাল নয় এবং কাফেররা এদের জন্যে হালাল নয়। কাফেররা যা ব্যয় করেছে, তা তাদের দিয়ে দাও। তোমরা, এই নারীদেরকে প্রাপ্য মোহরানা দিয়ে বিবাহ করলে তোমাদের অপরাধ হবে না। তোমরা কাফের নারীদের সাথে দাম্পত্য সম্পর্ক বজায় রেখো না। তোমরা যা ব্যয় করেছ, তা চেয়ে নাও এবং তারাও চেয়ে নিবে যা তারা ব্যয় করেছে। এটা আল্লাহর বিধান; তিনি তোমাদের মধ্যে ফয়সালা করেন। আল্লাহ সর্বজ্ঞ প্রজ্ঞাময়।",
            "verse 60:11": "তোমাদের স্ত্রীদের মধ্যে যদি কেউ হাতছাড়া হয়ে কাফেরদের কাছে থেকে যায়, অতঃপর তোমরা সুযোগ পাও, তখন যাদের স্ত্রী হাতছাড়া হয়ে গেছে, তাদেরকে তাদের ব্যয়কৃত অর্থের সমপরিমাণ অর্থ প্রদান কর এবং আল্লাহকে ভয় কর, যার প্রতি তোমরা বিশ্বাস রাখ।",
            "verse 60:12": "হে নবী, ঈমানদার নারীরা যখন আপনার কাছে এসে আনুগত্যের শপথ করে যে, তারা আল্লাহর সাথে কাউকে শরীক করবে না, চুরি করবে না, ব্যভিচার করবে না, তাদের সন্তানদেরকে হত্যা করবে না, জারজ সন্তানকে স্বামীর ঔরস থেকে আপন গর্ভজাত সন্তান বলে মিথ্যা দাবী করবে না এবং ভাল কাজে আপনার অবাধ্যতা করবে না, তখন তাদের আনুগত্য গ্রহণ করুন এবং তাদের জন্যে আল্লাহর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় আল্লাহ ক্ষমাশীল অত্যন্ত দয়ালু।",
            "verse 60:13": "মুমিনগণ, আল্লাহ যে জাতির প্রতি রুষ্ট, তোমরা তাদের সাথে বন্ধুত্ব করো না। তারা পরকাল সম্পর্কে নিরাশ হয়ে গেছে যেমন কবরস্থ কাফেররা নিরাশ হয়ে গেছে।"
        },
        "Berber Amazigh": {
            "verse 60:1": "A wid iumnen! Ur ddukulet d icenga W akked icenga nnwen. Teram ten d iêbiben, u nitni nekôen ayen id iusan, $uôwen, n tidep. Èèéaân Amazan, ééaân kwen, imi tumnem s Öebbi, Mass nnwen. Ma teff$em a ppenna$em deg ubrid iW, u tepnadim ôôva W, day a ten terrem, s tuffra, d iêbiben? Nek, Ife$ akw akken èôi$, ayen teffrem akked wayen tennam. Win, segwen, ixedmen akka, innetlaf seg ubrid umâin.",
            "verse 60:2": "Ma $elben kwen, ad u$alen d icenga nnwen, a kwen merten s ifassen nnsen akked yilsawen nnsen, ad ssirmen a pjehlem.",
            "verse 60:3": "Ass n tnekra, ur kwen infaâ walag, ne$ tarwa nnwen, d awez$i. Ad Ifrez garawen. Öebbi Ipwali igiten nnwen.",
            "verse 60:4": "Ni$ illa i kunwi umedya ucbiê di Ibôahim akked wid illan yides, mi nnan i ugdud nnsen: \"nemgirred ikwen, kunwi akked wayen teppanzem, war Öebbi. Nenkeô ikwen. Taâdawt akked dd$el, ersen d garane$, i lebda, alamma tumnem s Öebbi Yiwen\". Kkes ed awalen i inna Ibôahim, i baba s: \"ad velbe$ a ppeppusemmêev, xas ur iyi Ikellef Öebbi, fellak, s wacemma\". A Mass nne$! Ppkal nne$ fellaK; nutub iK; $uôeK tu$alin.",
            "verse 60:5": "A Mass nne$ ur a$ Ppara d ahewwel i wid ijehlen. A Mass nne$! Semmeê a$. Ih, Keçç d Uzmir, d Bab n ûûwab.",
            "verse 60:6": "Ni$, i kunwi, amedya nnsen ucbiê, i wid iggunin Öebbi akked wass aneggaru. Ma d win iwexxôen, ihi, Öebbi d Asâay, d Amaâzuz!",
            "verse 60:7": "Ahat Öebbi ad Irr tadukli garawen akked wid, segsen, i illan d icenga nnwen. Öebbi d Uzmir, Öebbi Ipsemmiê, Ipêunu.",
            "verse 60:8": "Ur awen Ikkis ara Öebbi, a pmaânem u tweznem, ar wid ur kwen nepna$ di ddin, ur kwen nessuffu$ seg ixxamen nnwen. Öebbi, s tidep, Iêemmel wid iweznen.",
            "verse 60:9": "I awen Ikkes Öebbi, d tadukli akked wid i kwen ipna$en di ddin, i kwen issuff$en seg ixxamen nnwen, ppaken afus mara kwen ssuff$en. Wid iddan yidsen, widak d imednas.",
            "verse 60:10": "A wid iumnen! Ma usant ed $uôwen tid iumnen, iunagen, jeôôbet pent. Öebbi Iéôa sennig akw liman nnsent. Ma tufam tent d tid iumnen, ur tent pparat ara i ijehliyen. Ur asen êellent, ur asent êellen. Efket asen ayen ûûeôfen. Ulac u$ilif ma tu$em tent, ma tefkam asent tuççit nnsent. Ur pnasabet tijehliyin. Ssutret ayen tûeôôfem, ad ssutren ayen ûûeôfen. Akka ay d aêuddu n Öebbi. Ipêuddu garawen. Öebbi d Amusnaw, d Bab n ûûwab.",
            "verse 60:11": "Ma terwel tmeîîut, si tlawin nnwen, ar ijehliyen, sinna, tâaqbem, efket, ayen ûûeôfen, i wid iwumi ôôuêent tlawin nnsen. Ëezzbet i Öebbi, syiS ay tumnem.",
            "verse 60:12": "A Nnbi! Ma usant ed $uôek tid iumnen, ad ak gallent ur pcarakent i Öebbi acemma, ur ppakwrent, ur zennunt, ur neqqent tarwa nnsent, ur teccvent s ifassen ne$ s ivaôen nnsent, ur k ppâuûunt di lewqama, eôêeb yisent, ssuter i Öebbi ad asent Isemmeê. Öebbi, s tidep, Ipsemmiê, Ipêunu.",
            "verse 60:13": "A wid iumnen! Ur ddukulet akked agdud i$ef Izzâaf Öebbi. Ni$ uysen laxeôt, akken uysen ijehliyen wid illan di tneîlin."
        },
        "Bosnian": {
            "verse 60:1": "O vjernici, ako ste pošli da se na putu Mome borite i da naklonost Moju steknete, s Mojim i svojim neprijateljima ne prijateljujte i ljubav im ne poklanjajte – oni poriču Istinu koja vam dolazi i izgone Poslanika i vas samo zato što u Allaha, Gospodara vašeg, vjerujete. Vi im krišom ljubav poklanjate, a Ja znam i ono što tajite i ono što javno činite. Onaj od vas koji to bude činio s Pravog puta je skrenuo.",
            "verse 60:2": "Ako vas se oni domognu, biće neprijatelji vaši i pružiće prema vama, u zloj namjeri, ruke svoje i jezičine svoje, i jedva će dočekati da postanete nevjernici.",
            "verse 60:3": "Ni rodbina vaša ni djeca vaša neće vam biti od koristi, na Sudnjem danu On će vas razdvojiti; – a Allah dobro vidi ono što radite.",
            "verse 60:4": "Divan uzor za vas je Ibrahim i oni koji su uz njega bili kada su narodu svome rekli: \"Mi s vama nemamo ništa, a ni sa onima kojima se, umjesto Allahu, klanjate; mi vas se odričemo, i neprijateljstvo i mržnja će između nas ostati sve dok ne budete u Allaha, Njega jedinog, vjerovali!\" – ali nisu riječi Ibrahimove ocu svome: \"Ja ću se moliti da ti oprosti, ali te ne mogu od Allaha odbraniti.\" – Gospodaru naš, u Tebe se uzdamo i Tebi se obraćamo i Tebi ćemo se vratiti.",
            "verse 60:5": "Ne dopusti, Gospodaru naš, da nas nevjernicima staviš u iskušenje i oprosti nam, Gospodaru naš! Ti si, zaista, Silni i Mudri.",
            "verse 60:6": "Oni su vama divan uzor – onima koji žele Allaha i onaj svijet. A onaj koji leđa okrene – pa, Allah, zaista, nije ni o kome ovisan i On je jedini hvale dostojan!",
            "verse 60:7": "Allah će sigurno uspostaviti ljubav između vas i onih s kojima ste u zavadi; Allah je svemoćan; Allah mnogo prašta i On je samilostan.",
            "verse 60:8": "Allah vam ne zabranjuje da činite dobro i da budete pravedni prema onima koji ne ratuju protiv vas zbog vjere i koji vas iz zavičaja vašeg ne izgone – Allah, zaista, voli one koji su pravični –",
            "verse 60:9": "ali vam zabranjuje da prijateljujete sa onima koji ratuju protiv vas zbog vjere i koji vas iz zavičaja vašeg izgone i koji pomažu da budete prognani. Oni koji s njima prijateljuju sami sebi čine nepravdu.",
            "verse 60:10": "O vjernici, kada vam vjernice kao muhadžirke dođu, ispitajte ih – a Allah dobro zna kakvo je vjerovanje njihovo – pa ako se uvjerite da su vjernice onda ih ne vraćajte nevjernicima: one njima nisu dopuštene, niti su oni njima dopušteni; a njima podajte ono što su potrošili. Nije vam grijeh da se njima ženite kad im vjenčane darove njihove date. U braku mnogoboškinje ne zadržavajte! Tražite ono što ste potrošili, a neka i oni traže ono što su potrošili! To je Allahov sud, On sudi među vama – a Allah sve zna i mudar je.",
            "verse 60:11": "A ako neka od žena vaših nevjernicima umakne, i ako vi poslije u borbu s njima stupite, onda onima čije su žene umakle – vjenčane darove koje su im dali namirite. I bojte se Allaha, u koga vjerujete!",
            "verse 60:12": "O Vjerovjesniče, kada ti dođu vjernice da ti polože prisegu: da neće Allahu nikoga ravnim smatrati, i da neće krasti, i da neće bludničiti, i da neće djecu svoju ubijati, i da neće muževima tuđu djecu podmetati i da neće ni u čemu što je dobro poslušnost odricati – ti prisegu njihovu prihvati i moli Allaha da im oprosti; Allah, zaista, mnogo prašta, i On je milostiv.",
            "verse 60:13": "O vjernici, ne prijateljujte s ljudima koji su protiv sebe Allahovu srdžbu izazvali; oni su izgubili nadu da će bilo kakvu nagradu na ovome svijetu imati, isto kao što su izgubili nadu nevjernici da će se njihovi umrli živi vratiti."
        },
        "Bulgarian": {
            "verse 60:1": "О, вярващи, не взимайте за ближни Моите врагове и вашите врагове! Вие се отнасяте с обич към тях, а те не повярваха в истината, която дойде при вас. Прогонват Пратеника и вас, защото вярвате в Аллах, вашия Господ. Ако излизате на борба по Моя път и се стр",
            "verse 60:2": "Ако ви надвият, ще ви станат врагове и ще простират със зло към вас ръцете и езиците си. И желаят да сте неверници.",
            "verse 60:3": "Не ще ви помогнат нито вашите роднинства, нито вашите деца в Деня на възкресението. Той ще ви раздели. Аллах е зрящ за вашите дела.",
            "verse 60:4": "Хубав пример за вас са Ибрахим и онези, които бяха заедно с него, когато казаха на своя народ: “Непричастни сме към вас за онова, на което служите вместо на Аллах! Ние ви отхвърляме и ще се прояви вражда и омраза помежду ни, докато не повярвате единствено",
            "verse 60:5": "Господи наш, не ни подлагай на изпитание чрез неверниците и ни опрости! Господи наш, наистина Ти си Всемогъщия, Премъдрия.”",
            "verse 60:6": "Те са хубав пример за вас - за всеки, който се надява на Аллах и на Сетния ден. А който се отвърне - Аллах е Пребогатия, Всеславния.",
            "verse 60:7": "Аллах може да породи обич между вас и онези от тях, с които враждувахте. Аллах е всемогъщ. Аллах е опрощаващ, милосърден.",
            "verse 60:8": "Аллах не ви забранява да се отнасяте с добро и да постъпвате справедливо към онези, които не воюват с вас в религията и не ви прогонват от домовете ви. Аллах обича справедливите.",
            "verse 60:9": "Аллах ви забранява само да се сближавате с онези, които воюват с вас в религията и ви прогонват от домовете ви, и помагат за прогонването ви. А които се сближават с тях - те са угнетителите.",
            "verse 60:10": "О, вярващи, ако дойдат при вас вярващите жени като преселнички, изпитайте ги! Аллах най-добре знае вярата им. И ако узнаете, че са вярващи, не ги връщайте при неверниците! Нито жените са разрешени за тях, нито пък те са разрешени за жените. И дайте на мъж",
            "verse 60:11": "И ако сте изпуснали нещо от [похарченото за] съпругите ви [отишли] при неверниците, и вземете придобивка [в битка], тогава дайте на онези, чиито съпруги са ги напуснали, толкова, колкото те са похарчили, и бойте се от Аллах, в Когото вярвате!",
            "verse 60:12": "О, Пророче, ако дойдат при теб вярващите жени да ти се закълнат, че не ще съдружават нищо с Аллах и не ще крадат, и не ще прелюбодействат, и не ще убиват децата си, и не ще скалъпват лъжа за онова, което е между ръцете и краката им, и че ще те слушат в од",
            "verse 60:13": "О, вярващи, не се сближавайте с хора, на които Аллах се е разгневил! Изгубили са те надежда за отвъдния живот, както и неверниците са изгубили надежда за намиращите се в гробовете."
        },
        "Chinese": {
            "verse 60:1": "信道的人们啊！你们不要以我的敌人和你们的敌人为朋友，而传送消息给他们，以示亲爱。他们不信降临你们的真理，他们为你们信仰真主--你们的主--而将使者和你们驱逐出境。如果你们从故乡迁出，是由於为我而奋斗，是由於寻求我的喜悦，（那么，你们不要以他们为朋友）。你们秘密地传送消息给他们，以示亲爱，其实，我知道你们所隐匿的和你们所显示的。你们中谁做这件事，谁已背离正道。",
            "verse 60:2": "如果他们发现你们，他们就变成你们的敌人，他们杀害你们，辱骂你们，希望你们叛道。",
            "verse 60:3": "你们的亲戚和子孙，对於你们绝无裨益，在复活日，你们将被隔绝。真主是鉴察你们的行为的。",
            "verse 60:4": "易卜拉欣和他的教徒，是你们的好模范。当时，他们曾对自己的宗族说：我们对於你们，和你们舍真主而崇拜的，确是无干的，我们不承认你们。我们彼此间的仇恨，永远存在。直到你们只信仰真主。但易卜拉欣对他父亲所说的话，不可做你们的模范。他曾说：我必定为你求饶，我不能为你抵御真主的一些刑罚。他们曾说：我们的主啊！我们只信托你，我们只依归你，只有你是最後的归宿。",
            "verse 60:5": "我们的主啊！求你不要让不信道的人迫害我们。我们的主啊！求你赦宥我们，你确是万能的，确是至睿的。",
            "verse 60:6": "易卜拉欣和他的教徒，对於你们希望会见真主和末日者，确是好模范。背叛者，无损於真主，因为真主确是无求的，确是可颂的。",
            "verse 60:7": "真主或许在你们和你们所仇视的人之间造化友谊，真主是全能的；真主是至赦的，是至慈的。",
            "verse 60:8": "未曾为你们的宗教而对你们作战，也未曾把你们从故乡驱逐出境者，真主并不禁止你们怜悯他们，公平待遇他们。真主确是喜爱公平者的。",
            "verse 60:9": "他只禁止你们结交曾为你们的宗教而对你们作战，曾把你们从故乡驱逐出境，曾协助别人驱逐你们的人。谁与他们结交，谁是不义者。",
            "verse 60:10": "信道的人们啊！当信女们迁移而来的时候，你们当试验她们。真主是至知她们的信德的--如果你们认为她们确是信女，那末，就不要使她们再归不信道的丈夫。她们对於他们是不合法的，他们对於她们也是不合法的。你们应当把他们所纳的聘礼偿还他们。当你们把她们的聘礼交付给她们的时候，你们娶她们为妻，对於你们是毫无罪过的。你们不要坚持不信道的妻子的婚约，你们当索回你们所纳的聘礼，叫他们也索回他们所纳的聘礼。这是真主的律例，他依此而替你们判决。真主是全知的，是至睿的。",
            "verse 60:11": "如果你们的妻子，有脱离你们而归不信道者的，那末，当你们轮到交聘的时候，你们应当把妻子脱离者所纳的聘礼交付他们。你们当敬畏你们所信仰的真主。",
            "verse 60:12": "先知啊！如果信女们到你面前来与你誓约：她们不以任何物配真主，不偷盗，不通奸，不杀自己的儿女，不以别人的儿子冒充丈夫的儿子，不违背你的合理的命令，那末，你当与她们誓约，你当为她们向真主告饶。真主确是至赦的，确是至慈的。",
            "verse 60:13": "信道的人们啊！你们不要结交真主所谴怒的民众，他们对後世确已绝望，犹如不信道的人对坟里的人绝望一样。"
        },
        "Danish": {
            "verse 60:1": "O gij die gelooft, neemt Mijn vijanden en uw vijanden niet tot vrienden! Biedt gij hun vriendschap aan, hoewel zij de Waarheid die tot u is gekomen hebben verworpen en de boodschapper en uzelf verdrijven, omdat gij in Allah uw Heer gelooft? Indien gij optreedt om voor Mijn zaak te strijden en Mijn welbehagen te zoeken, zoudt gij hun dan in het geheim vriendschap betuigen? En Ik weet het beste wat gij verbergt en wat gij openbaar maakt. En wie van u zo handelt, is zeker van de rechte weg afgedwaald",
            "verse 60:2": "Als zij de overhand over u krijgen zullen zij als vijanden tegenover u handelen, en zij zullen hun handen en tong naar u uitsteken om u kwaad te berokkenen, en zij wensen vurig dat gij ongelovigen zult worden",
            "verse 60:3": "Noch uw familiebanden noch uw kinderen zullen u op de Dag der Opstanding iets baten. Hij zal over u beslissen. En Allah ziet alles wat gij doet",
            "verse 60:4": "Er is een goed voorbeeld voor u in Abraham en degenen die met hem waren toen zij tegen hun volk zeiden: Wij hebben niets uitstaande met u en hetgeen gij buiten Allah aanbidt. Wij verwerpen u en er is tussen u en ons eeuwige vijandschap en haat ontstaan, tenzij gij in Allah, de Enige gelooft. - uitgezonderd het woord van Abraham tot zijn vader: Ik zal zeker om vergiffenis voor u vragen, ik heb niets van Allah ten uwen behoeve. - Onze Heer, in U stellen wij ons vertrouwen en tot U wenden wij ons, en naar U is de terugkeer",
            "verse 60:5": "Onze Heer, maak ons niet tot een voorwerp van beproeving voor de ongelovigen en vergeef ons o, Heer, voorzeker Gij, Gij zijt de Almachtige, de Alwijze",
            "verse 60:6": "Voorzeker, zij zijn een goed voorbeeld voor een ieder onder u die Allah en de Laatste Dag vreest. En wie zich (van de Waarheid) afwendt, - waarlijk, Allah is zich zelf genoeg, Geprezen",
            "verse 60:7": "Het is mogelijk dat Allah liefde zal kweken tussen u en diegene van hen met wie gij in vijandschap verkeert; want Allah is Almachtig en Allah is Vergevensgezind, Genadevol",
            "verse 60:8": "Allah verbiedt u niet, degenen, die niet tegen u om de godsdienst hebben gevochten, noch u uit uw huizen hebben verdreven, goed te doen en rechtvaardig te behandelen; voorzeker, Allah heeft de rechtvaardigen lief",
            "verse 60:9": "Maar Allah verbiedt u vriendschap te betonen aan degenen, die tegen u gevochten hebben om de godsdienst, en die u uit uw huizen hebben verdreven of geholpen hebben u te verdrijven. En wie hun ook vriendschap aanbiedt, dezen zijn de boosdoeners",
            "verse 60:10": "O, gij die gelooft wanneer gelovige vrouwen tot u komen als vluchtelingen, beproeft haar (geloof); Allah kent hun geloof het beste. Als gij dan vindt dat zij gelovig zijn, zendt haar niet terug naar de ongelovigen. Deze vrouwen zijn voor hen niet wettig, noch zijn de ongelovigen wettig voor deze vrouwen. Maar betaalt (aan de echtgenoten) wat zij besteed hebben. En het is geen zonde voor u haar te huwen als gij haar haar huwelijksgift hebt gegeven. En houdt niet vast aan huwelijksbanden met ongelovige vrouwen; maar vraagt om hetgeen gij besteed hebt; en laten zij vragen om hetgeen zij besteed hebben. Dat is het gebod van Allah. Hij spreekt recht over u. En Allah is Alwetend, Alwijs",
            "verse 60:11": "En als enig bezit door uw vrouwen van u overgaat in de handen der ongelovigen geeft dan in het omgekeerde geval aan diegenen, wier vrouwen zijn weggegaan hetzelfde als z. aan hun vrouwen besteed hadden. En vreest Allah in Wie gij gelooft",
            "verse 60:12": "O profeet! Wanneer gelovige vrouwen tot u komen, haar eed van trouw aan u afleggende: dat zij niets met Allah zullen vereenzelvigen, en dat zij noch zullen stelen, noch overspel plegen, noch hun kinderen doden, noch laster die zij moedwillig hebben verzonnen, zullen uiten, noch ongehoorzaam zullen zijn aan u in wat recht is, neem dan haar trouw aan en vraag vergiffenis voor haar van Allah. Waarlijk, Allah is Vergevensgezind, Genadevol",
            "verse 60:13": "O gij die gelooft, bevriendt u niet met een volk op hetwelk Allah vertoornd is; zij wanhopen aan het Hiernamaals zoals de ongelovigen wanhopen aan hen, die in de graven liggen"
        },
        "Dutch": {
            "verse 60:1": "O jullie die geloven, neemt niet Mijn vijanden en jullie vijanden tot vrienden, aan wie jullie genegenheid betonen. Waarlijk, zij geloofden niet in wat tot jullie is gekomen van de Waarheid. Zij hebben de Boodschapper en jullie verdreven, omdat jullie in Allah, jullie Heer, geloven. Als jullie uittrekken, strijdend op Mijn weg, Mijn welbehagen zoekend, (bevriendt hen dan niet). Jullie verheimelijkten jullie genegenheid voor hen, maar Ik weet het beste wat jullie verborgen hielden en wat jullie openbaar maakten. En wie van jullie dit doet: waarlijk, die is afgedwaald van de rechte Weg.",
            "verse 60:2": "Als zij de overhand over jullie krijgen, zullen zij vijanden voor jullie zijn. En zij zullen jullie met het kwaad raken door hun handen en hun tongen, en zij verlangen ernaar dat jullie niet zouden geloven.",
            "verse 60:3": "Jullie bloedverwanten en jullie kinderen zullen jullie niet baten op de Dag der Opstanding. Hij (Allah) maakt een scheiding tussen jullie (en de ongelovigen). En Allah is Alziende over wat jullie doen.",
            "verse 60:4": "Waarlijk, er was voor jullie een goed voorbeeld in Ibrâhîm en degenen die met hem waren, toen zij tot hun volk zeiden: \"Wij zijn niet verantwoordelijk voor jullie en voor wat jullie naast Allah aanbidden. Wij geloven jullie niet en er is tussen ons en jullie vijandschap en haat ontstaan, voor altijd, tot jullie in Allah, de Enige geloven.\" Behalve het woord van Ibrâhîm tegen zijn vader: \"Ik zal zeker voor u vergeving vragen, maar ik heb er voor u bij Allah niets over te zeggen.\" (Zij zeiden:) \"Onze Heer, op U vertrouwen wij en tot U wenden wij ons in berouw en tot U is de terugkeer.",
            "verse 60:5": "Onze Heer, maak ons niet tot een beproeving voor degenen die ongelovig zijn en vergeef ons. Onze Heer, voorwaar, U bent de Almachtige, de Alwijze.\"",
            "verse 60:6": "Voorzeker, er was voor jullie in hen een goed voorbeeld, voor wie op (de beloning van) Allah hoopt en op de Laatste Dag. Maar wie zich afwendt: voorwaar, Allah is de Behoefteloze, de Geprezene.",
            "verse 60:7": "Hopelijk zal Allah tussen jullie en degenen met wie jullie in vijandschap leven genegenheid brengen. En Allah is Almachtig. En Allah is Vergevensgezind, Meest Barmhartig.",
            "verse 60:8": "Allah verbiedt jullie niet om met degenen die jullie niet bestrijden vanwege de godsdienst, en die jullie niet uit jullie woonplaatsen verdrijven, goed en rechtvaardig om te gaan. Voorwaar, Allah houdt van de rechtvaardigen.",
            "verse 60:9": "Allah verbiedt jullie wel degenen te bevrienden die jullie hebben bestreden vanwege de godsdienst, en die jullie hebben verdreven uit jullie woonplaatsen en die (anderen) hebben geholpen om jullie te verdrijven. En wie hen tot vriend neemt: zij zijn degenen die de onrechtplegers zijn.",
            "verse 60:10": "O jullie die geloven, als er gelovige vrouwen, als uitgewekenen, tot jullie gekomen zijn, ondervraagt hen dan. Allah kent hun geloof het beste. Als jullie dan zeker weten dat zij gelovigen zijn, stuurt hen dan niet terug naar de ongelovigen. Zij zijn niet toegestaan voor hen (de ongelovige mannen), en zij (de ongelovige mannen) zijn niet toegestaan voor hen (de gelovige vrouwen). En geeft hun (de ongelovige mannen) wat zij (aan bruidschat) hebben uitgegeven. En er is geen zonde voor jullie als jullie hun hun bruidschat geven om hen te huwen. En houdt niet vast aan de huwelijksbanden met de ongelovige vrouwen. En vraagt terug wat jullie hebben uitgegeven (aan bruidschat aan de ongelovige vrouwen) en laat hen (de ongelovige mannen) vragen om wat zij hebben uitgegeven. Dat is de Wet van Allah, die Hij tussen jullie bepaald heeft. En Allah is Alwetend, Alwijs.",
            "verse 60:11": "En als een van jullie echtgenotes is weggelopen naar de ongelovigen, en jullie (de ongelovigen) vervolgens hebben gestraft, geeft dan (van de oorlogsbuit) aan hen wiens echtgenotes zijn weggelopen, zoveel als zij hebben uitgegeven (aan bruidschat). En vreest Allah, Degene in Wie jullie geloven.",
            "verse 60:12": "O Boodschapper, als de gelovige vrouwen tot jou gekomen zijn om trouw aan jou te zweren, (zwerend) dat zij geen deelgenoot aan Allah toekennen, en niet stelen en geen ontucht plegen en hun kinderen niet vermoorden, en geen leugen verzinnen over wat tussen hun handen en hun voeten is, en dat zij jou niet in het goede ongehoorzaam zijn: aanvaard dan hun trouw en vraag voor hen vergeving aan Allah. Voorwaar, Allah is Vergevensgezind, Meest Barmhartig.",
            "verse 60:13": "O jullie die geloven, neemt geen volk waarop Allah vertoornd is tot vrienden. Waarlijk, zij wanhopen aan het Hiernamaals, zoals de ongelovigen wanhopen aan (de opwekking van) de bewoners van de graven."
        },
        "English": {
            "verse 60:1": "O you who have believed, do not take My enemies and your enemies as allies, extending to them affection while they have disbelieved in what came to you of the truth, having driven out the Prophet and yourselves [only] because you believe in Allah, your Lord. If you have come out for jihad in My cause and seeking means to My approval, [take them not as friends]. You confide to them affection, but I am most knowing of what you have concealed and what you have declared. And whoever does it among you has certainly strayed from the soundness of the way.",
            "verse 60:2": "If they gain dominance over you, they would be to you as enemies and extend against you their hands and their tongues with evil, and they wish you would disbelieve.",
            "verse 60:3": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allah, of what you do, is Seeing.",
            "verse 60:4": "There has already been for you an excellent pattern in Abraham and those with him, when they said to their people, \"Indeed, we are disassociated from you and from whatever you worship other than Allah. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allah alone\" except for the saying of Abraham to his father, \"I will surely ask forgiveness for you, but I have not [power to do] for you anything against Allah. Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.",
            "verse 60:5": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\"",
            "verse 60:6": "There has certainly been for you in them an excellent pattern for anyone whose hope is in Allah and the Last Day. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.",
            "verse 60:7": "Perhaps Allah will put, between you and those to whom you have been enemies among them, affection. And Allah is competent, and Allah is Forgiving and Merciful.",
            "verse 60:8": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly.",
            "verse 60:9": "Allah only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion - [forbids] that you make allies of them. And whoever makes allies of them, then it is those who are the wrongdoers.",
            "verse 60:10": "O you who have believed, when the believing women come to you as emigrants, examine them. Allah is most knowing as to their faith. And if you know them to be believers, then do not return them to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers what they have spent. And there is no blame upon you if you marry them when you have given them their due compensation. And hold not to marriage bonds with disbelieving women, but ask for what you have spent and let them ask for what they have spent. That is the judgement of Allah; He judges between you. And Allah is Knowing and Wise.",
            "verse 60:11": "And if you have lost any of your wives to the disbelievers and you subsequently obtain [something], then give those whose wives have gone the equivalent of what they had spent. And fear Allah, in whom you are believers.",
            "verse 60:12": "O Prophet, when the believing women come to you pledging to you that they will not associate anything with Allah, nor will they steal, nor will they commit unlawful sexual intercourse, nor will they kill their children, nor will they bring forth a slander they have invented between their arms and legs, nor will they disobey you in what is right - then accept their pledge and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful.",
            "verse 60:13": "O you who have believed, do not make allies of a people with whom Allah has become angry. They have despaired of [reward in] the Hereafter just as the disbelievers have despaired of [meeting] the inhabitants of the graves."
        },
        "Filipino": {
            "verse 60:1": "O kayong sumasampalataya! Huwag ninyong ituring ang Aking mga kaaway at inyong mga kaaway, (alalaong baga, mga hindi sumasampalataya at mapagsamba sa diyus- diyosan, atbp.), bilang mga kaibigan (o tagapagsanggalang) at nagpapakita kayo ng inyong pagkagiliw sa kanila, kahima’t sila ay nagsipagtakwil sa katotohanan na ipinadala sa inyo (Kaisahan ni Allah, ang Qur’an, at Propeta Muhammad). (Sa kabalintunaan), sila ay nagtaboy sa Tagapagbalita (Muhammad) at sa inyo (mula sa inyong mga tahanan), sapagkat kayo ay nananampalataya kay Allah na inyong Panginoon! Kung kayo ay naparito na nagsisikap na makamtan ang Aking daan at naghahanap ng Aking Mabuting Kasiyahan, (sila ay huwag ninyong tanggapin bilang inyong mga kaibigan). Kayo ay nakikipag-usap nang lihim sa kanila tungkol sa pag-ibig (at pakikipagkaibigan), samantalang Ako ang nakakabatid ng lahat ninyong ikinukubli at lahat ninyong ipinapahayag. At sinuman sa inyo (na mga Muslim) ang gumawa nito ay katotohanang napaligaw siya (ng malayo) sa tuwid na landas",
            "verse 60:2": "Kung ibig nilang makuha ang mabubuti sa lipon ninyo ay kikilos sila bilanginyongkaaway.At iuunatnilaangkanilangmgakamay at kanilang mga dila ng laban sa inyo tungo sa kasamaan, at sila ay naghahangad na inyong itakwil ang katotohanan",
            "verse 60:3": "Sa Araw ng Paghuhukom, ang inyong mga kamag-anak at inyong mga anak ay walang magiging kapakinabangan sa inyo (laban kay Allah). Siya (Allah) ang hahatol sa pagitan ninyo sapagkat si Allah ay Lubos na Nakakamasid ng lahat ninyong ginagawa",
            "verse 60:4": "Katotohanang mayroon para sa inyo na mabuting halimbawa (upang inyong sundin ) ang makakamtan ninyo kay Abraham at sa kanyang mga kasama, nang sila ay mangusap sa kanilang mga tao: “Kami ay hindi kasangkot sa inyo at sa anupamang inyong sinasamba maliban pa kay Allah, kami ay nagtakwil sa inyo, at dito ay nag-ugat, sa pagitan namin at ninyo, ang lubusang pagkamuhi at pagkagalit, maliban na kayo ay manampalataya kay Allah at sa Kanya lamang”, maliban sa naging pangungusap ni Abraham sa kanyang ama: “Katotohanang aking ipagdarasal kayo tungo sa inyong kapatawaran (mula kay Allah), bagama’t wala akong kapangyarihan (na makakuha ng katiyakan ) para sa inyong kapakanan mula kay Allah. (Sila ay nagsipanalangin:) “Aming Panginoon! sa Inyo (lamang) kami nagtitiwala at sa Inyo (lamang) kami dumudulog sa pagsisisi, at sa Inyo (lamang) ang aming huling hantungan",
            "verse 60:5": "Aming Panginoon! Huwag Ninyong ipahintulot na kami ay maging pagsubok sa mga hindi sumasampalataya, bagkus ay Inyong patawarin kami, aming Panginoon! Katotohanang Kayo, at Kayo lamang ang Pinakamataas sa Kapangyarihan, ang Pinakamaalam.”",
            "verse 60:6": "Katotohanang mayroon sa kanila na isang mabuting halimbawa upang inyong panuntunan, doon sa mga tao na ang pag-asa ay kay Allah at sa Huling Araw. Datapuwa’t kung sinuman ang tumalikod, katotohanang si Allah ay hindi nangangailangan ng anupaman, at sa Kanyang lahat (nauukol) ang pagpupuri",
            "verse 60:7": "Maaaring si Allah ay magkaloob sa inyo ng pagmamahal (at pakikipagkaibigan) sa mga tao na itinuturing ninyo (ngayon) na inyong mga kaaway sapagkat si Allah ang may kapangyarihan (sa lahat ng bagay), at si Allah ang Laging Nagpapatawad, ang Pinakamaawain",
            "verse 60:8": "Hindi kayo pinagbabawalan ni Allah tungkol sa mga tao na hindi lumalaban sa inyong pananampalataya at hindi nagtataboy sa inyo sa inyong tahanan, na sila ay inyong pakitunguhan nang mabuti at makatarungan, sapagkat si Allah ay nagmamahal sa mga taong gumagawa ng may katarungan",
            "verse 60:9": "Si Allah ay nagbabawal lamang sa inyo hinggil sa mga tao na lumalaban sa inyong pananampalataya at nagtataboy sa inyo sa inyong mga tahanan at tumutulong sa iba upang kayo ay mapaalis, si Allah ay nagbabawal sa inyo na kayo ay makitungo sa kanila (sa pakikipaglaban at kaligtasan). At sinuman ang makitungo sa kanila (sa ganitong kalagayan), kung gayon, sila ang Zalimun (mga gumagawa ng kamalian at sumusuway kay Allah)",
            "verse 60:10": "O kayong nagsisisampalataya! Kung may dumarating sa inyo na mga babaeng nagsisilikas, suriin (at bigyang pagsusulit) sila. Si Allah ang tunay na nakakabatid ng kanilang pananampalataya, at kung inyong matiyak na sila ay nananampalataya, sila ay huwag ninyong pabalikin sa mga hindi sumasampalataya. Sila ay hindi naaayon sa batas (na maging asawa) ng mga walang pananampalataya, gayundin naman, hindi naaayon sa batas na ang walang pananampalataya ay maging (asawa) nila. Ngunit bayaran ninyo ang mga hindi sumasampalataya kung anuman ang kanilang ginugol sa kanila bilang dote. At hindi isang kasalanan sa inyo kung nais ninyong mag-asawa sa kanila, kung inyo nang nabayaran ang kanilang dote",
            "verse 60:11": "At kung sinuman sa inyong mga asawa ang umalis sa inyo at tumungo sa mga hindi sumasampalataya, at mayroon kayong kakayahang (makakuha ng babae sa kabilang panig), kung gayon ay inyong bayaran ang mga lalaking iniwan ng babae, sa halaga na kanilang ginugol (sa kanilang dote), at pangambahan ninyo si Allah; Siya na inyong sinasampalatayanan",
            "verse 60:12": "O Propeta! Kung ang mga sumasampalatayang babae ay magsilapit sa iyo upang sila ay manumpa sa iyo ng katapatan (Bai’a o pangako), na sila ay hindi magtatambal ng anupaman sa pagsamba kay Allah, na sila ay hindi magnanakaw, na sila ay hindi gagawa ng pangangalunya (o bawalnapakikipagtalik), nasilaayhindipapatayngkanilang mga anak, na sila ay hindi magsasalita ng paninirang puri, na may paghahangad na gumawa ng kabulaanan (alalaong baga, na sila ay magkaroon ng mga hindi legal na angkin ng kanilang asawa), at sila ay hindi lalabag sa iyo sa anupamang bagay na makatarungan, kung gayon, ay iyong tanggapin ang kanilang katapatan (Bai’a o pangako), at iyong ipagdasal kay Allah ang kapatawaran (ng kanilang mga kasalanan). Katotohanang si Allah ay Lagi nang Nagpapatawad, ang Pinakamaawain",
            "verse 60:13": "O kayong nagsisisampalataya! Huwag kayong makitungo (sa pakikipagkaibigan) sa mga tao na ang Poot ni Allah (alalaong baga, ang mga Hudyo) ay nasa kanila. Katiyakang sila ay nasa kawalan ng pag-asa na makatanggap ng anumang mabuti sa Kabilang Buhay, na katulad din ng mga hindi sumasampalataya na nasa kawalan ng pag-asa hinggil sa mga (nakalibing) sa kanilang puntod (na sila ay hindi ibabangong muli sa Araw ng Muling Pagkabuhay)"
        },
        "French": {
            "verse 60:1": "O vous qui avez cru! Ne prenez pas pour alliés Mon ennemi et le vôtre, leur offrant l'amitié, alors qu'ils ont nié ce qui vous est parvenu de la vérité. Ils expulsent le Messager et vous-mêmes parce que vous croyez en Allah, votre Seigneur. Si vous êtes sortis pour lutter dans Mon chemin et pour rechercher Mon agrément, leur témoignerez-vous secrètement de l'amitié, alors que Je connais parfaitement ce que vous cachez et ce que vous divulguez? Et quiconque d'entre vous le fait s'égare de la droiture du sentier.",
            "verse 60:2": "S'ils vous dominent, ils seront des ennemis pour vous et étendront en mal leurs mains et leurs langues vers vous; et ils aimeraient que vous deveniez mécréants.",
            "verse 60:3": "Ni vos proches parents ni vos enfants ne vous seront d'aucune utilité le Jour de la Résurrection, Il [Allah] décidera entre vous, et Allah est Clairvoyant sur ce que vous faites.",
            "verse 60:4": "Certes, vous avez eu un bel exemple [à suivre] en Abraham et en ceux qui étaient avec lui, quand ils dirent à leur peuple: «Nous vous désavouons, vous et ce que vous adorez en dehors d'Allah. Nous vous renions. Entre vous et nous, l'inimitié et la haine sont à jamais déclarées jusqu'à ce que vous croyiez en Allah, seul». Exception faite de la parole d'Abraham [adressée] à son père: «J'implorerai certes, le pardon [d'Allah] en ta faveur bien que je ne puisse rien pour toi auprès d'Allah». «Seigneur, c'est en Toi que nous mettons notre confiance et à Toi nous revenons [repentants]. Et vers Toi est le Devenir.",
            "verse 60:5": "Seigneur, ne fais pas de nous [un sujet] de tentation pour ceux qui ont mécru; et pardonne-nous, Seigneur, car c'est Toi le Puissant, le Sage».",
            "verse 60:6": "Vous avez certes eu en eux un bel exemple [à suivre], pour celui qui espère en Allah et en le Jour dernier; mais quiconque se détourne... alors Allah Se suffit à Lui-même et est Digne de louange.",
            "verse 60:7": "Il se peut qu'Allah établisse de l'amitié entre vous et ceux d'entre eux dont vous avez été les ennemis. Et Allah est Omnipotent et Allah est Pardonneur et Très Miséricordieux.",
            "verse 60:8": "Allah ne vous défend pas d'être bienfaisants et équitables envers ceux qui ne vous ont pas combattus pour la religion et ne vous ont pas chassés de vos demeures. Car Allah aime les équitables.",
            "verse 60:9": "Allah vous défend seulement de prendre pour alliés ceux qui vous ont combattus pour la religion, chassés de vos demeures et ont aidé à votre expulsion. Et ceux qui les prennent pour alliés sont les injustes.",
            "verse 60:10": "O vous qui avez cru! Quand les croyantes viennent à vous en émigrées, éprouvez-les; Allah connaît mieux leur foi; si vous constatez qu'elles sont croyantes, ne les renvoyez pas aux mécréants. Elles ne sont pas licites [en tant qu'épouses] pour eux, et eux non plus ne sont pas licites [en tant qu'époux] pour elles. Et rendez-leur ce qu'ils ont dépensé (comme mahr). Il ne vous sera fait aucun grief en vous mariant avec elles quand vous leur aurez donné leur mahr. Et ne gardez pas de liens conjugaux avec les mécréantes. Réclamez ce que vous avez dépensé et que (les mécréants) aussi réclament ce qu'ils ont dépensé. Tel est le jugement d'Allah par lequel Il juge entre vous, et Allah est Omniscient et Sage.",
            "verse 60:11": "Et si quelqu'une de vos épouses s'échappe vers les mécréants, et que vous fassiez des représailles, restituez à ceux dont les épouses sont parties autant que ce qu'ils avaient dépensé. Craignez Allah en qui vous croyez.",
            "verse 60:12": "O Prophète! Quand les croyantes viennent te prêter serment d'allégeance, [et en jurent] qu'elles n'associeront rien à Allah, qu'elles ne voleront pas, qu'elles ne se livreront pas à l'adultère, qu'elles ne tueront pas leurs propres enfants, qu'elles ne commettront aucune infamie ni avec leurs mains ni avec leurs pieds et qu'elles ne désobéiront pas en ce qui est convenable, alors reçois leur serment d'allégeance, et implore d'Allah le pardon pour elles. Allah est certes, Pardonneur et Très Miséricordieux.",
            "verse 60:13": "O vous qui avez cru! Ne prenez pas pour alliés des gens contre lesquels Allah est courroucé et qui désespèrent de l'au-delà, tout comme les mécréants désespèrent des gens des tombeaux."
        },
        "Fulah": {
            "verse 60:1": "Eehey mon goonɗinɓe wote njaggire añɓe Mi e añɓe mon heetɓe hoɗon mberlo e mum en gilli te koɓe yedduɓe goongo garɗo o e mon, hoɓe njaltina nelaaɗo e onon sabu tan on ngoonɗanii Alla joomi mon, tawde on njalti sabu jihaadi e laawol Am e ɗaɓjude weluya am, hoɗon cuurtanaɓe kabaruuji juulɓe ngam ɓe mbele mon, Mbeɗa anndi ko cuuɗoton e ko ɓanngiɗon, kala e mon baɗɗo ɗuum o majji laawol peewngol",
            "verse 60:2": "Siɓe peewnatiima e mon ɓe ngOnana mon añɓe ɓe mberta juuɗe maɓɓe e ɗemɗe mum en e mbaadi mbonndi ɓe njiɗiina nde ngonaton heefereeɓe",
            "verse 60:3": "Nafatah on enɗameeje mon wonah ɓiɓɓe mon ñande darnga O seernda hakkunde mon Alla na yi*a ko golloton ko",
            "verse 60:4": "Woodanii on ñeemtinirde moƴƴere e Ibraahiima e ɓeen wonduɓe e mum nde ɓe mbi*i pellet ko min hisɓe e mon e ko ndewaton ko wonah Alla ko, min njeddii on feeñi hakkunde men ngañngu e tikkere haa pooma haa ngoonɗinon Alla gooto O, si wonah konngol Ibraahiima wonande baaba makko pellet ma mi yaafnano ma, mi alanaama hay huunde ka Alla, joomi amen min mbakkaliima e Ma ko e Ma min ndutti e ko e Ma woni wattande",
            "verse 60:5": "joomi amen wota waɗ min fitina wonande ɓeen yedduɓe, yaafa amen joomi amen pellet ko aan woni tedduɗo mbo fooletaake ñeeñɗuɗo",
            "verse 60:6": "Woodaniina mon e maɓɓe ñeemtanirgal moƴƴal wonande oon joortiiɗo e Alla e ñalngu laakara, oon ɗuurniiɗo noon Pellet Alla ko gala jettaaɗo",
            "verse 60:7": "Yaama nde Alla waɗata hakkunde mon e ɓeen ɓe ngañandirɗon gilli, Alla ko kattanɗo Alla ko kafroowo bakkatuuji jurmotooɗo",
            "verse 60:8": "Alla haɗataa mon ɓeen ɓe kaɓaani e mon e diine ɓe njaltinaani mon e galleeji mon nde ɗiggantonɓe nuunɗon faade e maɓɓe pellet Alla ko jiɗɗo nuunɗuɓe",
            "verse 60:9": "Kono Alla haɗata mon ko ɓeen haɓatooɓe mon e diine yaltinooɓe mon galleeji mon ɓe mballandiri e yaltinde mon, nde keetnaton ɓe kala baɗɗo ɓe keeda ko ɓeen ngoni tooñooɓe",
            "verse 60:10": "Eehey mon goonɗinɓe si goonɗinɓe rewɓe ngarii e mon njaribeeɓe Alla na anndi iimaan mum en, si on nganndii koɓe goonɗinɓe wotee ndutteeɓe e heeferɓe ɓe ndaganaaki heeferɓe ɓe heeferɓe ɓe kadi ndaganaaki ɓe, totteeɓe koɓe nafqi ko bakkaat alah e mon nde ndesaton ɓe si on tottii ɓe teŋe maɓɓe wote nanngite piɓle rewɓe heeferɓe naamnee ko nafquɗon kamɓe ne yo ɓe naamna ko ɓe nafqi ko, ko ɗuum woni ñaawoore Alla hakkunde mon Alla ko gannda ñeeñɗuɗo",
            "verse 60:11": "Si huunde faatiima mon e rewɓe mon faade e heefereeɓe leptuɗon ɓe tottee ɓeen ɓe rewɓe mum en njahi fotde koɓe tottirno kulee Alla mbo goonɗin ɗon O",
            "verse 60:12": "Eehey ma annabi si rewɓe juulɓe ngari e ma hoɓe coodandira e ma nde ɓe ndenndintah Alla e hay gooto,ngujjatah, njinatah, mbaratah sukaaɓe mum en,ngaddatah fenaande fepindaande hakkunde juuɗe mum en e koyɗe mum en,ɓe ngoopataa Ma e moƴƴere ndeen de soodandir e mum en, yaafnanoɓe Alla, pellet Alla ko jaafatooɗo jurmotooɗo",
            "verse 60:13": "Eehey mjon goonɗiɓe wote keetne yimɓe ɓe Alla tikkani e dow mum en, ɓe piɓtiima e laakara hono no heeferɓe piɓtari e yimɓe genaale"
        },
        "German": {
            "verse 60:1": "O die ihr glaubt, nehmt nicht Meine Feinde und eure Feinde zu Schutzherren, indem ihr ihnen Zuneigung entgegenbringt, wo sie doch das verleugnen, was von der Wahrheit zu euch gekommen ist, und den Gesandten und euch selbst vertreiben, weil ihr an Allah, euren Herrn, glaubt. (Nehmt sie nicht zu Schutzherren), wenn ihr wirklich ausgezogen seid zum Abmühen auf Meinem Weg und im Trachten nach Meiner Zufriedenheit. (Tut das nicht, indem) ihr ihnen heimlich Zuneigung zeigt, wo Ich doch besser weiß, was ihr verbergt und was ihr offenlegt. Und wer von euch das tut, der ist fürwahr vom rechten Weg abgeirrt.",
            "verse 60:2": "Wenn sie auf euch treffen, sind sie euch feind und strecken gegen euch ihre Hände und ihre Zungen zum Bösen aus. Sie möchten gern, ihr würdet ungläubig.",
            "verse 60:3": "Nicht nützen werden euch eure Blutsverwandten und auch nicht eure Kinder. Am Tag der Auferstehung wird Er (Allah) zwischen euch entscheiden'. Und was ihr tut, sieht Allah wohl.",
            "verse 60:4": "Ihr habt doch ein schönes Vorbild in Ibrahim und denjenigen, die mit ihm waren, als sie zu ihrem Volk sagten: \"Wir sind unschuldig an euch und an dem, dem ihr anstatt Allahs dient. Wir verleugnen euch, und zwischen uns und euch haben sich Feindschaft und Haß auf immer offenkundig gezeigt, bis ihr an Allah allein glaubt.\" (Dies), außer das Wort Ibrahims zu seinem Vater: \"Ich werde ganz gewiß für dich um Vergebung bitten; doch vermag ich für dich vor Allah gar nichts auszurichten. Unser Herr, auf Dich verlassen wir uns, und Dir wenden wir uns reuig zu. Und zu Dir ist der Ausgang.",
            "verse 60:5": "Unser Herr, mache uns nicht zu einer Versuchung für diejenigen, die ungläubig sind. Und vergib uns, unser Herr. Du bist ja der Allmächtige und Allweise.\"",
            "verse 60:6": "Ihr habt ja in ihnen ein schönes Vorbild, und zwar für einen (jeden), der auf Allah und (auf) den Jüngsten Tag hofft. Wer sich jedoch abkehrt, so ist Allah der Unbedürftige und Lobenswürdige.",
            "verse 60:7": "Vielleicht setzt Allah zwischen euch und denjenigen von ihnen, mit denen ihr verfeindet seid, Zuneigung! Und Allah ist Allmächtig. Und Allah ist Allvergebend und Barmherzig.",
            "verse 60:8": "Allah verbietet euch nicht, gegenüber denjenigen, die nicht gegen euch der Religion wegen gekämpft und euch nicht aus euren Wohnstätten vertrieben haben, gütig zu sein und sie gerecht zu behandeln. Gewiß, Allah liebt die Gerechten.",
            "verse 60:9": "Er verbietet euch nur, diejenigen, die gegen euch der Religion wegen gekämpft und euch aus euren Wohnstätten vertrieben und zu eurer Vertreibung Beistand geleistet haben, zu Schutzherren zu nehmen. Diejenigen, die sie zu Schutzherren nehmen, das sind die Ungerechten.",
            "verse 60:10": "O die ihr glaubt, wenn gläubige Frauen als Auswanderer zu euch kommen, dann prüft sie. Allah weiß besser über ihren Glauben Bescheid. Wenn ihr sie dann als gläubig erkennt, dann schickt sie nicht zu den Ungläubigen zurück. Weder sind sie ihnen (zur Ehe) erlaubt, noch sind sie ihnen (diesen Frauen) erlaubt. Und gebt ihnen (jedoch), was sie (früher als Morgengabe) ausgegeben haben. Es ist für euch kein Vergehen, sie zu heiraten, wenn ihr ihnen ihren Lohn gebt. Und haltet nicht an der Ehe mit den ungläubigen Frauen fest, und fordert, was ihr (als Morgengabe) ausgegeben habt, zurück. Auch sie sollen zurückfordern, was sie ausgegeben haben. Das ist Allahs Urteil; Er richtet zwischen euch. Und Allah ist Allwissend und Allweise.",
            "verse 60:11": "Und wenn euch etwas von euren Gattinnen bei den Ungläubigen verlorengeht und ihr dann (in) eine(r) Strafmaßnahme (Beute) macht, dann gebt denjenigen, deren Gattinnen fortgegangen sind, soviel, wie sie (zuvor für sie) ausgegeben haben. Und fürchtet Allah, an Den ihr glaubt.",
            "verse 60:12": "O Prophet, wenn gläubige Frauen zu dir kommen, um dir den Treueid zu leisten, daß sie Allah nichts beigesellen, nicht stehlen, keine Unzucht begehen, ihre Kinder nicht töten, keine Verleumdung vorbringen, die sie vor ihren (eigenen) Händen und Füßen ersinnen, und sich dir nicht widersetzen in dem, was recht ist, dann nimm ihren Treueid an und bitte Allah für sie um Vergebung. Gewiß, Allah ist Allvergebend und Barmherzig.",
            "verse 60:13": "O die ihr glaubt, nehmt nicht Leute zu Schutzherren, denen Allah zürnt. Sie haben ja die Hoffnung auf das Jenseits aufgegeben, so wie die Ungläubigen die Hoffnung (auf Wiederauferstehung) der (Toten) in den Gräbern aufgegeben haben."
        },
        "Hausa": {
            "verse 60:1": "Ya kũ waɗanda suka yi ĩmani! Kada ku riƙi maƙiyĩNa kuma maƙiyinku masõyi, 845. Kuna jẽfa sõyayya zuwa gare su, alhãli kuwa haƙĩƙa sun kãfirta da abin da ya zo muku, na gaskiya, sunã fitar da Manzon Allah tãre da ku (daga gidãjenku) dõmin kun yi ĩmãni da Allah, Ubangijinku, idan kun fito dõmin jihãdi sabõda ɗaukaka kalmaTa da nẽman yardaTa, kunã asirta sõyayya zuwa gare su alhãli kuwa Nĩ ne Mafi sani ga abin da kuka ɓõye da abin da kuka bayyana, kuma duk wanda ya aikata shi daga cikinku, to, lalle ya ɓace daga tsakar hanya.",
            "verse 60:2": "Idan sun kãma ku, zã su kasance maƙiya a gare ku, kuma su shimfiɗa hannuwansu da harsunan gũrin ku kãfirta.",
            "verse 60:3": "Zumuntarku bã zã ta amfãne ku ba, haka kuma ɗiyanku, a Rãnar Kiyãma. (Allah) zai rarrabe tsakãninku, kuma Allah Mai gani ne ga abin da kuke aikatãwa.",
            "verse 60:4": "Lalle abin kõyi mai kyau ya kasance a gare ku game da Ibrãhĩm da waɗanda ke tãre da shi a lõkacin da suka ce wa mutnensu, \"Lalle mũ bãbu ruwanmu daku, kuma da abin da kuke bautãwa, baicin Allah, mun fita batunku, kuma ƙiyayya da jiyẽwa jũna sun bayyana a tsakãninmu, sai kun yi ĩmãni da Allah Shi kaɗai.\" Fãce maganar Ibrãhĩm ga ubansa (da yace), \"Lalle za ni nẽma maka gãfara kuma ban mallaki kõme ba daga Allah sabõda kai.\" \"Yã Ubangijinmu! A gare Ka muka dõgara, kuma gare Ka muka mayar da al' amuranmu, kuma zuwa gare Ka makõma take.\"",
            "verse 60:5": "\"Yã Ubangijinmu! Kada Ka sanya mu fitina ga waɗanda suka kãfirta, kuma Ka yi gãfara gare Mu. Ya Ubangijinmu! Kai ne Mabuwãyi, Mai hikima!",
            "verse 60:6": "Lalle, haƙĩƙa, abin kõyi mai kyau ya kasance a gare ku daga cikinsu, ga wanda ya kasance yanã fãtan (rahamar) Allah da Rãnar Lãhira, kuma wanda ya jũya bãya, to, lalle Allah, Shĩ ne wadãtacce, Gõdadde.",
            "verse 60:7": "Anã tsammãnin Allah Ya sanya, a tsakãninku da tsakãnin waɗanda kuka yi ƙiyayya da su, wata sõyaya daga gare su, kuma Allah Mai ĩkon yi ne, kuma Allah Mai gãfara ne, Mai jin ƙai.",
            "verse 60:8": "Allah bã Ya hana ku, daga waɗanda ba su yãƙe ku ba sabõda addini kuma ba su fitar da ku ba daga gidãjenku, ga ku kyautata musu kuma ku yi musu ãdalci. Lalle Allah Yanã son mãsu ãdalci.",
            "verse 60:9": "Allah Yanã hana ku kawai daga waɗanda suka yãke ku sabõda addini kuma suka fitar da ku daga gidãjenku, kuma suka taimaki jũna ga fitar da ku, karku jiɓince su, kuma wanda ya jiɓince su, to waɗannan sũ ne azzãlumai.",
            "verse 60:10": "Yã kũ waɗanda suka yi ĩmãni! Idan mãtã mũminai suka zo muku, sunã mãsu hijira, to, ku jarraba su. Allah Shĩ ne mafi sani ga ĩmãninsu. To, idan kun san sũ mũminai ne, kada ku mayar da su zuwa ga kãfirai. Sũ mãtan bã su halatta ga aurensu, sũ kuma kãfiran bã su halatta ga auren mãtan. Ku bã su abin da suka ɓatar na dũkiya. Kuma bãbu laifi a kanku ga ku aure su idan kun bã su sadãkõkinsu. Kuma kada ku riƙe auren mãtã kãfirai, kuma ku tambayi abin da kuka ɓatar daga dũkiya, su kuma kãfirai su tambayi abin da suka ɓatar na dũkiya. Wannan hukuncin Allah ne Yanã hukunci a tsakãninku. kuma Allah, Masani ne, Mai hikima",
            "verse 60:11": "Kuma idan wani abu ya kuɓuce muku daga mãtanku zuwa ga kãfirai sa'an nan kuma kuka ɗauki fansa, to, sai ku bai wa waɗanda matansu suka tafi kwatankwacin abin da suka ɓatar na dũkiya. Kuma ku yi biyayya da taƙawa ga Allah wanda kuke mãsu ĩmãni da Shi, Shi Kaɗai.",
            "verse 60:12": "Yã kai Annabi! Idan mãtã mũminai suka zo maka sunã yi maka mubãya'a a kan bã zã su yi shirki da Allah ba ga kõme, kuma bã su yin sãtã, kuma bã su yin zina, kuma bã su kashe, ya'yansu, kuma bã su zuwa da ƙarya da suke ƙirƙirãwa a tsãkanin hannuwansu da ƙafãfunsu kuma bã su sãɓa maka ga wani abu da aka sani na sharĩ'a, to, ka karɓi mubãya'arsu, kuma ka nẽmi Allah Ya gãfarta musu. Lalle Allah Mai gãfara ne, Mai jin ƙai.",
            "verse 60:13": "Yã kũ waɗanda suka yi ĩmãni! Kada ku jiɓinci waɗansu mutãne da Allah Ya yi hushi a kansu. Lalle sun yanke tsammãni daga (rahamar) Lãhira, kamar yadda kãfirai suka yanke tsammãni daga mazõwa kaburbura."
        },
        "Hindi": {
            "verse 60:1": "ऐ ईमानदारों अगर तुम मेरी राह में जेहाद करने और मेरी ख़ुशनूदी की तमन्ना में (घर से) निकलते हो तो मेरे और अपने दुशमनों को दोस्त न बनाओ तुम उनके पास दोस्ती का पैग़ाम भेजते हो और जो दीन हक़ तुम्हारे पास आया है उससे वह लोग इनकार करते हैं वह लोग रसूल को और तुमको इस बात पर (घर से) निकालते हैं कि तुम अपने परवरदिगार ख़ुदा पर ईमान ले आए हो (और) तुम हो कि उनके पास छुप छुप के दोस्ती का पैग़ाम भेजते हो हालॉकि तुम कुछ भी छुपा कर या बिल एलान करते हो मैं उससे ख़ूब वाक़िफ़ हूँ और तुममें से जो शख़्श ऐसा करे तो वह सीधी राह से यक़ीनन भटक गया",
            "verse 60:2": "अगर ये लोग तुम पर क़ाबू पा जाएँ तो तुम्हारे दुश्मन हो जाएँ और ईज़ा के लिए तुम्हारी तरफ अपने हाथ भी बढ़ाएँगे और अपनी ज़बाने भी और चाहते हैं कि काश तुम भी काफिर हो जाओ",
            "verse 60:3": "क़यामत के दिन न तुम्हारे रिश्ते नाते ही कुछ काम आएँगे न तुम्हारी औलाद (उस दिन) तो वही फ़ैसला कर देगा और जो कुछ भी तुम करते हो ख़ुदा उसे देख रहा है",
            "verse 60:4": "(मुसलमानों) तुम्हारे वास्ते तो इबराहीम और उनके साथियों (के क़ौल व फेल का अच्छा नमूना मौजूद है) कि जब उन्होने अपनी क़ौम से कहा कि हम तुमसे और उन (बुतों) से जिन्हें तुम ख़ुदा के सिवा पूजते हो बेज़ार हैं हम तो तुम्हारे (दीन के) मुनकिर हैं और जब तक तुम यकता ख़ुदा पर ईमान न लाओ हमारे तुम्हारे दरमियान खुल्लम खुल्ला अदावत व दुशमनी क़ायम हो गयी मगर (हाँ) इबराहीम ने अपने (मुँह बोले) बाप से ये (अलबत्ता) कहा कि मैं आपके लिए मग़फ़िरत की दुआ ज़रूर करूँगा और ख़ुदा के सामने तो मैं आपके वास्ते कुछ एख्तेयार नहीं रखता ऐ हमारे पालने वाले (ख़ुदा) हमने तुझी पर भरोसा कर लिया है और तेरी ही तरफ हम रूजू करते हैं",
            "verse 60:5": "और तेरी तरफ हमें लौट कर जाना है ऐ हमारे पालने वाले तू हम लोगों को काफ़िरों की आज़माइश (का ज़रिया) न क़रार दे और परवरदिगार तू हमें बख्श दे बेशक तू ग़ालिब (और) हिकमत वाला है",
            "verse 60:6": "(मुसलमानों) उन लोगों के (अफ़आल) का तुम्हारे वास्ते जो ख़ुदा और रोज़े आख़ेरत की उम्मीद रखता हो अच्छा नमूना है और जो (इससे) मुँह मोड़े तो ख़ुदा भी यक़ीनन बेपरवा (और) सज़ावारे हम्द है",
            "verse 60:7": "करीब है कि ख़ुदा तुम्हारे और उनमें से तुम्हारे दुश्मनों के दरमियान दोस्ती पैदा कर दे और ख़ुदा तो क़ादिर है और ख़ुदा बड़ा बख्शने वाला मेहरबान है",
            "verse 60:8": "जो लोग तुमसे तुम्हारे दीन के बारे में नहीं लड़े भिड़े और न तुम्हें घरों से निकाले उन लोगों के साथ एहसान करने और उनके साथ इन्साफ़ से पेश आने से ख़ुदा तुम्हें मना नहीं करता बेशक ख़ुदा इन्साफ़ करने वालों को दोस्त रखता है",
            "verse 60:9": "ख़ुदा तो बस उन लोगों के साथ दोस्ती करने से मना करता है जिन्होने तुमसे दीन के बारे में लड़ाई की और तुमको तुम्हारे घरों से निकाल बाहर किया, और तुम्हारे निकालने में (औरों की) मदद की और जो लोग ऐसों से दोस्ती करेंगे वह लोग ज़ालिम हैं",
            "verse 60:10": "ऐ ईमानदारों जब तुम्हारे पास ईमानदार औरतें वतन छोड़ कर आएँ तो तुम उनको आज़मा लो, ख़ुदा तो उनके ईमान से वाकिफ़ है ही, पस अगर तुम भी उनको ईमानदार समझो तो उन्ही काफ़िरों के पास वापस न फेरो न ये औरतें उनके लिए हलाल हैं और न वह कुफ्फ़ार उन औरतों के लिए हलाल हैं और उन कुफ्फार ने जो कुछ (उन औरतों के मेहर में) ख़र्च किया हो उनको दे दो, और जब उनका महर उन्हें दे दिया करो तो इसका तुम पर कुछ गुनाह नहीं कि तुम उससे निकाह कर लो और काफिर औरतों की आबरू (जो तुम्हारी बीवियाँ हों) अपने कब्ज़े में न रखो (छोड़ दो कि कुफ्फ़ार से जा मिलें) और तुमने जो कुछ (उन पर) ख़र्च किया हो (कुफ्फ़ार से) लो, और उन्होने भी जो कुछ ख़र्च किया हो तुम से माँग लें यही ख़ुदा का हुक्म है जो तुम्हारे दरमियान सादिर करता है और ख़ुदा वाक़िफ़कार हकीम है",
            "verse 60:11": "और अगर तुम्हारी बीवियों में से कोई औरत तुम्हारे हाथ से निकल कर काफिरों के पास चली जाए और (ख़र्च न मिले) और तुम (उन काफ़िरों से लड़ो और लूटो तो (माले ग़नीमत से) जिनकी औरतें चली गयीं हैं उनको इतना दे दो जितना उनका ख़र्च हुआ है) और जिस ख़ुदा पर तुम लोग ईमान लाए हो उससे डरते रहो",
            "verse 60:12": "(ऐ रसूल) जब तुम्हारे पास ईमानदार औरतें तुमसे इस बात पर बैयत करने आएँ कि वह न किसी को ख़ुदा का शरीक बनाएँगी और न चोरी करेंगी और न जेना करेंगी और न अपनी औलाद को मार डालेंगी और न अपने हाथ पाँव के सामने कोई बोहतान (लड़के का शौहर पर) गढ़ के लाएँगी, और न किसी नेक काम में तुम्हारी नाफ़रमानी करेंगी तो तुम उनसे बैयत ले लो और ख़ुदा से उनके मग़फ़िरत की दुआ माँगो बेशक बड़ा ख़ुदा बख्शने वाला मेहरबान है",
            "verse 60:13": "ऐ ईमानदारों जिन लोगों पर ख़ुदा ने अपना ग़ज़ब ढाया उनसे दोस्ती न करो (क्योंकि) जिस तरह काफ़िरों को मुर्दों (के दोबारा ज़िन्दा होने) की उम्मीद नहीं उसी तरह आख़ेरत से भी ये लोग न उम्मीद हैं"
        },
        "Indonesian": {
            "verse 60:1": "Hai orang-orang yang beriman, janganlah kamu mengambil musuh-Ku dan musuhmu menjadi teman-teman setia yang kamu sampaikan kepada mereka (berita-berita Muhammad), karena rasa kasih sayang; padahal sesungguhnya mereka telah ingkar kepada kebenaran yang datang kepadamu, mereka mengusir Rasul dan (mengusir) kamu karena kamu beriman kepada Allah, Tuhanmu. Jika kamu benar-benar keluar untuk berjihad di jalan-Ku dan mencari keridhaan-Ku (janganlah kamu berbuat demikian). Kamu memberitahukan secara rahasia (berita-berita Muhammad) kepada mereka, karena rasa kasih sayang. Aku lebih mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan. Dan barangsiapa di antara kamu yang melakukannya, maka sesungguhnya dia telah tersesat dari jalan yang lurus.",
            "verse 60:2": "Jika mereka menangkap kamu, niscaya mereka bertindak sebagai musuh bagimu dan melepaskan tangan dan lidah mereka kepadamu dengan menyakiti(mu); dan mereka ingin supaya kamu (kembali) kafir.",
            "verse 60:3": "Karib kerabat dan anak-anakmu sekali-sekali tiada bermanfaat bagimu pada Hari Kiamat. Dia akan memisahkan antara kamu. Dan Allah Maha Melihat apa yang kamu kerjakan.",
            "verse 60:4": "Sesungguhnya telah ada suri tauladan yang baik bagimu pada Ibrahim dan orang-orang yang bersama dengan dia; ketika mereka berkata kepada kaum mereka: \"Sesungguhnya kami berlepas diri daripada kamu dari daripada apa yang kamu sembah selain Allah, kami ingkari (kekafiran)mu dan telah nyata antara kami dan kamu permusuhan dan kebencian buat selama-lamanya sampai kamu beriman kepada Allah saja. Kecuali perkataan Ibrahim kepada bapaknya: \"Sesungguhnya aku akan memohonkan ampunan bagi kamu dan aku tiada dapat menolak sesuatupun dari kamu (siksaan) Allah\". (Ibrahim berkata): \"Ya Tuhan kami hanya kepada Engkaulah kami bertawakkal dan hanya kepada Engkaulah kami bertaubat dan hanya kepada Engkaulah kami kembali\".",
            "verse 60:5": "\"Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir. Dan ampunilah kami ya Tuhan kami. Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana\".",
            "verse 60:6": "Sesungguhnya pada mereka itu (Ibrahim dan umatnya) ada teladan yang baik bagimu; (yaitu) bagi orang-orang yang mengharap (pahala) Allah dan (keselamatan pada) Hari Kemudian. Dan barangsiapa yang berpaling, maka sesungguhnya Allah Dialah yang Maha kaya lagi Maha Terpuji.",
            "verse 60:7": "Mudah-mudahan Allah menimbulkan kasih sayang antaramu dengan orang-orang yang kamu musuhi di antara mereka. Dan Allah adalah Maha Kuasa. Dan Allah Maha Pengampun lagi Maha Penyayang.",
            "verse 60:8": "Allah tidak melarang kamu untuk berbuat baik dan berlaku adil terhadap orang-orang yang tiada memerangimu karena agama dan tidak (pula) mengusir kamu dari negerimu. Sesungguhnya Allah menyukai orang-orang yang berlaku adil.",
            "verse 60:9": "Sesungguhnya Allah hanya melarang kamu menjadikan sebagai kawanmu orang-orang yang memerangimu karena agama dan mengusir kamu dari negerimu, dan membantu (orang lain) untuk mengusirmu. Dan barangsiapa menjadikan mereka sebagai kawan, maka mereka itulah orang-orang yang zalim.",
            "verse 60:10": "Hai orang-orang yang beriman, apabila datang berhijrah kepadamu perempuan-perempuan yang beriman, maka hendaklah kamu uji (keimanan) mereka. Allah lebih mengetahui tentang keimanan mereka; maka jika kamu telah mengetahui bahwa mereka (benar-benar) beriman maka janganlah kamu kembalikan mereka kepada (suami-suami mereka) orang-orang kafir. Mereka tiada halal bagi orang-orang kafir itu dan orang-orang kafir itu tiada halal pula bagi mereka. Dan berikanlah kepada (suami suami) mereka, mahar yang telah mereka bayar. Dan tiada dosa atasmu mengawini mereka apabila kamu bayar kepada mereka maharnya. Dan janganlah kamu tetap berpegang pada tali (perkawinan) dengan perempuan-perempuan kafir; dan hendaklah kamu minta mahar yang telah kamu bayar; dan hendaklah mereka meminta mahar yang telah mereka bayar. Demikianlah hukum Allah yang ditetapkan-Nya di antara kamu. Dan Allah Maha Mengetahui lagi Maha Bijaksana.",
            "verse 60:11": "Dan jika seseorang dari isteri-isterimu lari kepada orang-orang kafir, lalu kamu mengalahkan mereka maka bayarkanlah kepada orang-orang yang lari isterinya itu mahar sebanyak yang telah mereka bayar. Dan bertakwalah kepada Allah Yang kepada-Nya kamu beriman.",
            "verse 60:12": "Hai Nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia, bahwa mereka tiada akan menyekutukan Allah, tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anaknya, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dan tidak akan mendurhakaimu dalam urusan yang baik, maka terimalah janji setia mereka dan mohonkanlah ampunan kepada Allah untuk mereka. Sesungguhnya Allah maha Pengampun lagi Maha Penyayang.",
            "verse 60:13": "Hai orang-orang yang beriman, janganlah kamu jadikan penolongmu kaum yang dimurkai Allah. Sesungguhnya mereka telah putus asa terhadap negeri akhirat sebagaimana orang-orang kafir yang telah berada dalam kubur berputus asa."
        },
        "Italian": {
            "verse 60:1": "O credenti, non prendetevi per alleati il Mio nemico e il vostro, dimostrando loro amicizia, mentre essi non hanno creduto alla verità che vi è giunta e hanno scacciato l'Inviato e voi stessi, solo perché credete in Allah vostro Signore. Se siete usciti in combattimento per la Mia causa, bramando il Mio compiacimento, pensate di poter mantenere segreta la vostra relazione con loro, mentre Io conosco meglio [di chiunque altro] quel che celate e quel che palesate? Chi di voi agisse in questo modo si allontanerebbe dalla retta via.",
            "verse 60:2": "Se vi incontrano in qualche luogo, saranno vostri nemici, vi aggrediranno con le loro mani e le loro lingue e si augureranno che diveniate miscredenti.",
            "verse 60:3": "I vostri parenti e i vostri figli non vi saranno utili e nel Giorno della Resurrezione [Allah] deciderà tra di voi; Allah osserva quello che fate.",
            "verse 60:4": "Avete avuto un bell'esempio in Abramo e in coloro che erano con lui, quando dissero alla loro gente: “Noi ci dissociamo da voi e da quel che adorate all'infuori di Allah: vi rinneghiamo. Tra noi e voi è sorta inimicizia e odio [che continueranno] ininterrotti, finché non crederete in Allah, l'Unico”, eccezion fatta per quanto Abramo disse a suo padre : “Implorerò perdono per te, anche se è certo che non ho alcun potere in tuo favore presso Allah!”. - “Signore a Te ci affidiamo, a Te ci volgiamo pentiti e verso di Te è il divenire.",
            "verse 60:5": "Signore, non fare di noi una tentazione per i miscredenti e perdonaci, o Signore! Tu sei l'Eccelso, il Saggio.”",
            "verse 60:6": "Invero avete avuto in loro un bell'esempio, per chi spera in Allah e nell'Ultimo Giorno. Quanto a chi invece volge le spalle, Allah basta a Se stesso ed è il Degno di lode.",
            "verse 60:7": "Forse Allah stabilirà amicizia tra voi e quanti fra di loro considerate nemici. Allah è onnipotente e Allah è perdonatore, misericordioso.",
            "verse 60:8": "Allah non vi proibisce di essere buoni e giusti nei confronti di coloro che non vi hanno combattuto per la vostra religione e che non vi hanno scacciato dalle vostre case, poiché Allah ama coloro che si comportano con equità.",
            "verse 60:9": "Allah vi proibisce soltanto di essere alleati di coloro che vi hanno combattuto per la vostra religione, che vi hanno scacciato dalle vostre case, o che hanno contribuito alla vostra espulsione. Coloro che li prendono per alleati, sono essi gli ingiusti.",
            "verse 60:10": "O voi che credete, quando giungono a voi le credenti che sono emigrate, esaminatele ; Allah ben conosce la loro fede. Se le riconoscerete credenti, non rimandatele ai miscredenti - esse non sono lecite per loro né essi sono loro leciti - e restituite loro ciò che avranno versato. Non vi sarà colpa alcuna se le sposerete versando loro il dono nuziale. Non mantenete legami coniugali con le miscredenti. Rivendicate quello che avete versato ed essi rivendichino quel che hanno versato. Questo è il giudizio di Allah, con il quale giudica fra voi, e Allah è sapiente, saggio.",
            "verse 60:11": "Se qualcuna delle vostre spose fugge verso i miscredenti, quando avete la meglio [su di loro] date a quelli le cui spose sono fuggite, quanto avevano versato. Temete Allah nel Quale credete.",
            "verse 60:12": "O Profeta, quando vengono a te le credenti a stringere il patto, [giurando] che non assoceranno ad Allah alcunché, che non ruberanno, che non fornicheranno, che non uccideranno i loro figli, che non commetteranno infamie con le loro mani o con i loro piedi e che non ti disobbediranno in quel che è reputato conveniente, stringi il patto con loro e implora Allah di perdonarle. Allah è perdonatore, misericordioso.",
            "verse 60:13": "O credenti, non prendetevi per alleati gente contro la quale Allah è adirato e che non hanno la speranza dell'altra vita, come i miscredenti che disperano [di rivedere] la gente delle tombe."
        },
        "Japanese": {
            "verse 60:1": "あなたがた信仰する者よ，われの敵であり，またあなたがたの敵である者を，友としてはならない。あなたがたに与えられた真理を拒否しているにも拘らず，密に好意を寄せるのか。かれらは，あなたがたの主，アッラーを信仰しているという理由で，使徒とあなたがたを追放したのである。あなたがたは，われの喜びを願いながら，われのために聖戦に出かけていながら，（一方で）かれらに好意を寄せるのか。われはあなたがたの隠すことも，現わすことも知っている。あなたがたの中このようなことをする者は，本当に正しい道から迷い去った者である。",
            "verse 60:2": "かれらはもしあなたがたの上手に立てば，あなたがたの敵となり，かれらの手と舌を悪意をもってあなたがたに伸し，あなたがたが不信心になることを望んでいる。",
            "verse 60:3": "復活の日においては，あなたがたの親族もまた子女も，あなたがたには役立たないであろう。かれはあなたがたを裁決なされる。アッラーはあなたがたの行うことを御存知であられる。",
            "verse 60:4": "イブラーヒームやかれと共にいた者たちのことで，あなたがたのため本当に良い模範がある。かれらが自分の人びとに言った時を思い起せ。「本当にわたしたちは，あなたがたとあなたがたがアッラーを差し置いて崇拝するものとは，何の関りもない。あなたがたと絶縁する。わたしたちとあなたがたの間には，あなたがたがアッラーだけを信じるようになるまで，永遠の敵意と憎悪があるばかりである。」イブラーヒームは父親だけにこう言った。「わたしはあなたのために，御赦しを祈りましよう。だがわたしは，あなたのためになるどんな力もアッラーから頂けないでしょう。」（かれは祈った）。「主よ，わたしはあなたに御縋り申し，あなたにだけ悔悟します。わたしたちの行き着く所はあなたの御許ばかりです。",
            "verse 60:5": "主よ，わたしたちを不信心者の試練に陥し入れないで下さい。主よ，わたしたちを御赦し下さい。本当にあなたは，偉力ならびなく英明であられます。」",
            "verse 60:6": "本当に，アッラーと最後の日に望みを託している者にとって，この（物語の）中には良い模範がある。だがもし背き去る者があっても，本当にアッラーは，自足なされる御方讃美されるべき御方であられる。",
            "verse 60:7": "アッラーはあなたがたとあなたがたが（今）敵意を持つ者たちとの間に，あるいは友情を起させることもあろう。本当にアッラーは全能であられ，またアッラーは寛容にして慈悲深くあられる。",
            "verse 60:8": "アッラーは，宗教上のことであなたがたに戦いを仕掛けたり，またあなたがたを家から追放しなかった者たちに親切を尽し，公正に待遇することを禁じられない。本当にアッラーは公正な者を御好みになられる。",
            "verse 60:9": "アッラーは只次のような者を，あなたがたに禁じられる。宗教上のことであなたがたと戦いを交えた者，またあなたがたを家から追放した者，あなたがたを追放するにあたり力を貸した者たちである。かれらに縁故を通じるのを（禁じられる）。誰でもかれらを親密な友とする者は不義を行う者である。",
            "verse 60:10": "あなたがた信仰する者よ，婦人の信者が，あなたがたの許に逃げて来た時は，かの女らを試問しなさい。かの女らの信仰に就いては，アッラーが最もよく知っておられる。もしかの女らが信者であることがあなたがたに分ったならば，不信心者の許に帰してはならない。かの女は，かれら（不信心者）には合法（の妻）ではなく，またかれら（不信心者）も，かの女らにとっては合法（の夫）ではない。しかしかれら（不信心者）が（マハルとして）贈ったものは返してやれ。あなたがたが，かの女らにマハルを与えるならば，かの女を娶っても，あなたがたに罪はない。だが不信心な女との絆を，固持していてはならない。あなたが（マハルとして）贈ったものの返還を（不信心者のかの女の夫から）求めてもよい。またかれら（不信者）が贈ったものについては，その返還の要求を（あなたがたに対して求めさせればよい）。これはアッラーの御裁である。かれはあなたがたの間を（公正に）裁決なされる。本当にアッラーは全知にして英明であられる。",
            "verse 60:11": "あなたがたの妻が，もしあなたがたの許を去り，不信心者の許に走るならば，先方（不信心者の夫）に勝利を納めた暁には，妻に去られた者にその戦利品の中から，マハルとして贈ったものと同額を与えなさい。あなたがたが信奉する，アッラーを畏れなさい。",
            "verse 60:12": "預言者よ，あなたの許へ女の信者がやって来て，あなたに対しこう忠誠を誓うならば，「アッラーの外は何ものも同位に崇めません。盗みをしまん。姦通しません。子女を殺しません。また手や足の間で，捏造した嘘は申しません。また正しいことには，あなたに背きません。」（と誓うならば）かの女たちの誓約を受け入れ，かの女たちのために罪を赦されるようアッラーに祈れ。本当にアッラーは寛容にして慈悲深くあられる。",
            "verse 60:13": "あなたがた信仰する者よ，アッラーの御怒りを被った者に，友情を持ってはならない。かれらは，不信心者が墓場の（埋葬ずみの）仲間に就いて絶望しているのと同じように，来世に就いて絶望しているのである。"
        },
        "Jawa": {
            "verse 60:1": "Para Mukmi! Sira aja padha asih marang sateruningsun lan uga saterunira. (Hiya iku wong kafir) aja nibakake katresnan marang wong kafir mau. Satemene dheweke mau wis maido ing kebeneran (Islam) sarta padha ngusir marang utusane Allah lan ngusir sira (saka Makkah) ,arga sira padha percaya ing Allah Pangeranira. Manawa sira padha metoni perang netepi agamaningsun lan murih kaparengingsun, aja asih marang wong kafir mau, aja medharake wedine Rosul kelawan bisik - bisik marga saka tresna. ingsun nguningani barang kang sira samarake lan hedheng. Sing sapa bisik - bisik mangkono mau kalebu wong kang kesasar saka agama",
            "verse 60:2": "Menawa wong kafir nyekel sira, wusanane dadi musuhmu, tangane tumandang lan cangkeme nyatur ala. Pangarep - arepe sira dadi kafir maneh",
            "verse 60:3": "Para sanakmu lan anakmu kang ngajak duraka marang sira iku ora migunani. Besuk qiyamat Allah misahake sira lan sanakmu mau. Allah iku mirsani samu barang kang padha sira lakonu",
            "verse 60:4": "Sira wis duwe tuntunan becik, hiya iku Ibrahim lan para sahabate padha mituturi marang para ummate (kang isih kafir): \"Aku selak marang kowe lan marang sesembahanmu liyane Allah, aku maido marang kowe, \"Saiki aku lan kowe dadi seteru lan gegethingan selawas - lawase. Kejaba yen kowe banjur percaya ing Allah piyambak\". Nanging Ibrahim matur marang ramane, Panjenengan kula suwunake pangapuraning Allah, awit kula boten saged nguwasani dumateng panjenengan manawi badhe dipun siksa utawi dipun ganjar. Punika namung gumantung karsaning Allah\". \"Pangeran kawula nyumanggaaken punapa sakersa Paduka. Kawula madhep ing Padhuka, wusananipun samukawis punika wangsul ing ngarsa Paduka",
            "verse 60:5": "Pangeran kawula, sampun ngantos kawula dipun kawonaken kaliyan tiyang kafir, mindhak sangsaya dados panasaran tumrapipun kafir punika. Paduka mugi ngapunten dhumateng kawula. Sayektosipun Paduka punika Maha Mulya tur wicaksana",
            "verse 60:6": "Satemene kanggo sira kabeh wis duwe panutan becik (Ibrahim lan sahabate) dadi panutan wong kang bekti ing Allah lan dina akherat. Dene sing sapa mlengos (ora makewuhi) awot Allah iku Maha Sugih lan Pantes ing Ngalembana",
            "verse 60:7": "Mugi Allah marangna padha asih - sinasihan antaranira lan marang wong - wong kang nyateru ing sira antarane dheweke. Allah iku kuwasa, kepareng ngapura tur maha asih",
            "verse 60:8": "Allah ora nglarangi marang sira, gawe becik lan nindakake adil utawa tepa - tepa marang para wong kafir kang ora perang ngelawan sira perkara rebutan agama, lan ora ngusir saka imahira. Satemene Allah iku remen wong kang padha nindakake tepa utawa adil",
            "verse 60:9": "Kang mesthi dilarang dening Allah menawa sira gawe becik utawa asih marang wong kafir kang perang nglawan sira omahira (negaramu) lan bantu (wong liya) kanggo ngusir sira. Sing sapa asih utawa gawe becik marang wong kafir mau iku dheweke nganiaya awake dhewe",
            "verse 60:10": "Para mukmin! Manawa ana wong wadon (ngaku) Islam lunga (hijrah) saka panggonane wong kafir iku sira coba-a kelawan disumpah temen mung neja dhemen agama Islam, Allah nguningani temen lan gorohe anggone ngaku percaya ing Allah. Dene manawa sira ngira yen Islam temenan marga gelem sumpah aja sira balekake marang wong kafir. Para wadon mau ora wenang dadi rabine wong kafir, uga wong kafir hiya ora wenang dadi rabi wong wadon mau. Dene maskawin kang wis dibayar balekna. Manawa sira arep nikah wong wadon mau ora ana alangane yen sira bayar maskawine. Sira aja mengku rabi wong wadon kafir, lan sira nagiha maskawine rabinira kang wis sira bayar (manawa rabinira dadi kafir). Mangkono maneh wong kafir manawa rabine dadi Islam, hiya nagiha maskawine kang wis dibayar. Mangkono hukume Allah aknggo ngadili sira kabeh. Allah iku nguningani tur wicaksana",
            "verse 60:11": "Menawa sira ora bisa nagih maskawine rabinira kang dadikafir kang mangka sira banjur menang perang ngelawan wong kafir mau iku kang rabine lunga dadi kafir mau sira paringana panduman jarahan sapira akehe maskawin kang wis dibayar, sira padha bektia ing Allah kang sira percaya",
            "verse 60:12": "Hai Nabi (Muhammad) manawa sira katekan wong mukmin wadon prasetya ing sira ora bakal mangro tinggal percayane ing Allah, ora bakal ngolong, zina, mateni anake lan ora bakal ngapusi (gawe - gawe) ngaku anak (bocah) kang satemene dudu anake diakokake anak patutan saka lakine marga wedi dipegat jalaran ora ngalihare anak, lan ora nglirwakake panggawe becik kang sira perintahake sira tampanana prasetyane sarta suwuna pangapuraning Allah, satemene Allah kepareng ngapura tur maha asih",
            "verse 60:13": "Para mukmin! Aja padha asih tresna marang wong kang padha dibendoni Allah, awit wong mau padha ora oleh begja ana akherat, padha wong kafir kang wis ana kubur hiya padha ora oleh begja ing akhirat"
        },
        "Kazakh": {
            "verse 60:1": "Ей, иманға келгендер! Менің дұшпаным әрі өздеріңнің дұшпандарыңды имансыздарды өздеріңе дос тұтпаңдар. Олар сендерге ақиқаттан келгенге күпірлік етсе де мойындамаса да , Оларға сүйіспеншілік пейіл білдіресіңдер. Олар Елшіні және сендерді, өздеріңнің Раббың Аллаһқа сенгендерің үшін қуып шығаруда. Егер сендер Менің жолымда күресу үшін және Менің ризалығымды іздеп шықсаңдар жауларымды дос тұтпаңдар . Сендер Оларға сүйіспеншілік пейіл танытып, сыр айтасыңдар. Ал, Мен сендердің нені ашық, нені жасырын істегендеріңді жақсы білемін. Сендерден кім мұны істесе, әлбетте ол тура жолдан адасқан болады",
            "verse 60:2": "Егер олар сендерді кездестірсе, сендерге жау болып, сендерге жамандықпен қолдарын созып, тілдерін тигізеді әрі сендердің күпірлік етушілерден имансыздардан болғандарыңды қалайды",
            "verse 60:3": "Сендерге өздеріңнің туыстарың да, балаларың да Қиямет күні еш пайда бермейді. Қайта тірілу күні Ол араларыңды ажыратады. Аллаһ не істеп жатқандарыңды көріп тұрушы",
            "verse 60:4": "Анығында, сендер үшін Ибраһимде және онымен бірге болғандарда көркем өнеге бар. Олар еліне: «Негізінде біз сендерден де, Аллаһтан өзге табынатындарыңнан да бас тартамыз. Біз сендердің діндеріңді мойындамаймыз. Қашан Аллаһтың жалғыз Өзіне сенгендеріңше, сендер мен біздің арамызда мәңгі дұшпандық әрі өшпенділік орнады», деді. Бірақ Ибраһимнің өз әкесіне: «Мен міндетті түрде сен үшін кешірім тілеймін. Бірақ сен үшін Аллаһтың алдында ешнәрсеге ие бола алмаймын», деген сөзі ғана бұған кірмейді. Олар!: «Раббымыз! Біз Өзіңе жүгініп, саған ісімізді тапсырдық тәуекел еттік және Өзіңе бойсұнуға қайттық тәубе еттік , әрі қайтуымыз Саған",
            "verse 60:5": "Раббымыз! Бізді күпірлік етушілерге имансыздарға сынақ етпе және бізді кешір. Раббымыз! Ақиқатында Сен бәрінен Үстем, аса Данасың»",
            "verse 60:6": "Ақиқатында, сендер үшін, Аллаһқа және Ақирет күніне үміт ететіндер үшін, оларда көркем өнеге болды. Ал, кім теріс бұрылса, әлбетте Аллаһ Бай, Мұқтажсыз , Мақтауға лайық",
            "verse 60:7": "Аллаһтың сендер мен олардың ішінен өздерің жауласып жүргендердің арасында сүйіспеншілік орнатуы мүмкін. Аллаһ бәріне Күші жетуші. Аллаһ өте Кешірімді, ерекше Мейірімді",
            "verse 60:8": "Аллаһ дін тұрғысында сендермен соғыспағандарға және жұрттарыңнан қуып шығармағандарға жақсылық жасауларыңа және оларға әділдік етулеріңе тыйым салмайды. Шын мәнінде Аллаһ әділдік етушілерді жақсы көреді",
            "verse 60:9": "Негізінде, Аллаһ, сендерді тек дін тұрғысында сендермен соғысқандармен, жұрттарыңнан қуып шыққандармен және сендерді қуып шығуға көмектескендермен дос болуларыңа тыйым салады. Ал, кім олармен дос болса, міне, солар әділетсіздер",
            "verse 60:10": "Ей, иманға келгендер! Қашан сендерге иманды әйелдер қоныс аударып келсе, оларды тексеріп көріңдер. Аллаһ олардың имандарын жақсы біледі. Сонда егер олардың иманды әйелдер екенін білсеңдер, оларды кәпірлерге қайтармаңдар. Себебі бұлар иманды әйелдер оларға кәпірлерге рұқсат етілмейді, әрі олар да кәпірлер бұларға иманды әйелдерге рұқсат етілмейді. Оларға кәпірлерге жұмсағандарын беріңдер. Қашан бұларға әйелдерге мәһрлерін сыйларын берсендер, оларды некелеріңе алуларың сендерге күнә емес. кәпір әйелдерді некелеріңде ұстамаңдар. Оларға бергендеріңді сұраңдар, олар да бергендерін сұрасын. Бұл Аллаһтың үкімі. Ол араларыңа үкім етеді. Аллаһ бәрін Білуші, өте Дана",
            "verse 60:11": "Егер кейбір әйелдер мәһрлерімен кәпірлер жаққа өтіп кетсе, үстемдікке жеткен кездеріңде әйелдері кетіп қалғандарға жұмсаған сыйындай мәһріндей өтем беріңдер. Өздерің иманға келіп, сенген Аллаһтан Оның жазасынан қорқып, сақтаныңдар",
            "verse 60:12": "Ей, Пайғамбар! Қашан саған иманға келген әйелдер Аллаһқа ешнәрсені серік етіп қоспауға, ұрлыққылмауға, зина жасамауға, балаларын өлтірмеуге, қол-аяқтарының арасынан бір жала жаппауға бұзық жолмен тапқан баланы күйеуіне телімеуге әрі құпталғанда саған қарсы келмеуге серт беруге келсе, олардың серттерін қабыл ет және олар үшін Аллаһтан кешірім тіле. Ақиқатында, Аллаһ өте Кешірімді, ерекше Мейірімді",
            "verse 60:13": "Ей, иманға келгендер! Аллаһтың ашуына қалған адамдарды дос қамқоршы тұтпаңдар. Негізінде, олар соңғы, мәңгілік өмірден ақиреттен қабірдегі кәпірлердің үміт үзгені секілді үміт үзген"
        },
        "Korean": {
            "verse 60:1": "믿는 자들이여! 그대들이 나의 길에서 나의 기쁨을 간구하며 출전하였다면 나의 적과 그대들의 적을 교우로 두지 말라. 그대들에게 도래한 진리를 그들이 이미 불신하였음에도 그대들은 그들에게 사랑을 드리우노라. 그대들이 그대들의 주님이신 하나님을 믿는다는 이유로 그들은 사도와 그대들을 추방하였노라. 그대들은 사랑을 이유로 그들에게 비밀을 발설하지만 실로 나는 그대들이 숨기는 것과 내보이는 것을 알고 있노라. 그대들 중에 그렇게 하는 자 있다면 실로 그는 올바른 길을 벗어나 방황한 것이라믿는 사람들이여 나의 적과 너희 적을 친구로 하여 너희에게 도래한 진리를 거역하고 하나님을믿는다 하여 선지자와 너희 자신 들을 추방한 그들에게 사랑을 베 풀려 하느뇨 너희가 나의 길에서 성전하고 나의 기쁨을 추구하려 한다면 그들에게 사랑을 베풀지 말라 나는 너희가 숨기는 것과 드러내는 모든 것을 알고 있나니 이렇게 행하는 자 누구든 올바른 길에서 벗어나니라",
            "verse 60:2": "만약 그들이 그대들을 장악한다면 그들은 그대들의 적이 되어 그대들에게 그들의 사악한 손길과 혀를 뻗치고 그대들이 불신하기를 갈망할 것이라그들이 너희 위에 있게 된다 면 그들은 적들처럼 너희에게 대 할 것이며 그들의 손과 그들의 혀로써 너희를 저주할 것이며 너 희가 그 진리를 거역하기를 원할 것이라",
            "verse 60:3": "그대들의 친척들과 자식들은 그대들에게 어떠한 소용도 없을 것이니 심판의 날 그분께서는 그대들 사이를 분리시키실 것이라. 하나님께서는 그대들이 행하는 것을 보고 계시는 분이라부활의 날에는 너희 친척도 너희 자손도 너희에게 유용하지 않나니 하나님께서 너희를 심판 하시매 실로 하나님은 너희가 행하는 모든 것을 지켜보고 계시니라",
            "verse 60:4": "실로 아브라함과 그와 함께 있었던 자들에게는 그대들을 위한 훌륭한 모범이 있노라 ; 그들이 그들의 마을 사람들에게 말하길 “실로 우리는 그대들과 그대들이 숭배하는 하나님 이외의 것들로부터 결백하오. 우리는 그대들을 불신하며 우리와 그대들 사이에는 영원한 적의와 증오가 드러났으니 그대들이 하나님 한분만을 믿을 때까지오”. 그러나 아브라함이 그의 아버지에게 한 말은 예외라 : “진실로 저는 당신을 위해 용서를 빌어줄 것입니다”. “저는 하나님께 관하여 당신을 위한 그 어떤 것도 가지고 있지 않습니다. 저희의 주님, 저희는 당신께 의탁하였고, 당신께 뉘우치며 돌아왔으며, 귀착할 곳은 당신이십니다”여기에 너희를 위한 아브라함과 그와 함께 한 그들의 교훈이 있나니 그들이 백성들에게 이야기한 것이라 우리는 너희와 관계가 없으매 너희가 하나님 외에 숭배 한 것과도 관계가 없노라 또한 우 리와 너희 사이에 일어난 적의와 증오는 너희가 하나님을 홀로 경 배할 때까지 영원토록 관계가 없 노라 그러나 아브라함은 그의 아 버지를 향해 당신을 위하여 제가 용서를 구하겠습니다 당신을 위하 여 하나님께 관용을 기원하는 것 외에는 아무런 힘이 없나이다 라 고 말하고 주여 실로 저희는 당신 께만 의탁하오며 당신에게만 회개 하나니 저희의 목적지는 당신이옵 니다 라고 하더라",
            "verse 60:5": "“저희의 주님, 저희를 불신자들에 대한 시험으로 두지 말아 주시고 저희를 용서하여 주십시오. 저희의 주님, 실로 당신께서는 가장 존엄하시고 가장 현명하신 분입니다”주여 저희가 불신자들을 위한 시험이 되지 않도록 하여 주옵시 고 저희를 용서하여 주옵소서 실 로 당신은 위대하고 현명하신 분 이십니다",
            "verse 60:6": "실로 그들에게는 그대들을 위한 훌륭한 모범이 있으니 하나님과 최후의 날을 염원하는 자들을 위함이라. 그리고 돌아서는 자 있다면 실로 하나님 그분이야말로 스스로 풍족하신 분이며 가장 영광되신 분이라실로 너희를 위한 교훈이 그 들안에 있나니 이는 하나님과 내 세를 원하는 자를 위한 것이며 외 면한 자 있다 하여도 하나님은 충 만하사 모든 찬미를 받으시니라",
            "verse 60:7": "하나님께서 그대들과, 그들 중에 그대들이 적의를 보였던 자들 사이에 사랑을 불어넣으실지도 모르는 일이라. 하나님께서는 능력을 가지신 분이라. 그리고 하나님께서는 너그러이 용서하시는 자애로우신 분이라하나님은 너희와 적의를 품고 있는 그들 사이에 우정을 이르게 할수 있으시니 실로 하나님은 전능하 사 관용과 자비로 충만하시니라",
            "verse 60:8": "하나님께서는, 종교를 이유로 그대들과 싸우지 않았고 그대들의 거주지로부터 그대들을 추방하지 않은 자들에게 그대들이 좋게 대하고 그들에게 공정을 기하는 것을 금하지 않으시노라. 실로 하나님께서는 공정한 자들을 사랑하시노라하나님은 종교를 이유로 너희 에게 대적하지 아니하고 너희를 너희 주거지로부터 추방하지 아니 한 자들에게 친절하고 그들과 공 정하게 거래하는 것을 금지하지 아니하셨나니 실로 하나님은 공평 하게 행하는 자들을 사랑하시니라",
            "verse 60:9": "하나님께서 그대들에게 금한 것은 단지, 종교를 이유로 그대들과 싸웠고 그대들의 거주지로부터 그대들을 추방하였으며 그대들의 추방을 도왔던 자들을 교우로 두는 것이라. 그들을 교우로 두는 자, 저들은 실로 부당한 자들이라하나님은 종교를 이유로 너희 에게 대적하고 너희를 너희 주거 지로부터 추방하며 너희를 추방함 에 협력한 자들과 우정을 맺는 것 만을 금지하셨나니 그들과 우정을 맺는자 누구든지 의롭지 못한 자 들이라",
            "verse 60:10": "믿는 자들이여! 믿는 여성들이 그대들에게 이주하여 왔다면 그녀들을 시험하라. 하나님께서는 그녀들의 믿음을 가장 잘 알고 계시노라. 그리하여 그녀들이 믿는 여성들이라는 것을 알았다면 그대들은 그녀들을 불신자들에게로 돌려보내지 말라. 그녀들은 그들에게 허락된 존재가 아니며 그들도 그녀들에게 허락되지 않노라. 그대들은 그들이 (결혼을 위해) 쓴 재산을 그들에게 되돌려 주라. 그대들이 그녀들에게 그녀들의 지참금을 주었다면 그녀들과 결혼하는 것은 그대들에게 죄가 되지 않노라. 그대들은 불신자 여성들과의 결혼 계약을 붙잡지 말라. 그대들이 (결혼을 위해) 쓴 재산은 (불신자들에게 보상을) 요구하고 그들이 (결혼을 위해) 쓴 재산은 그들이 (믿는 자들에게 보상을) 요구하도록 하라. 이것은 하나님의 판결로서 그분께서 그대들 사이를 판결하시노라. 하나님께서는 지식을 가진 지혜로우신 분이라믿는 사람들이여 믿음을 가 진 여성이 너희에게 을 때 그녀 들을 시험하라 하나님은 그녀들의 믿음을 온전히 알고 계시니라 그 때 너희가 그녀들이 믿는 자들임 을 발견했다면 그녀들을 불신자들 에게로 보내지 말라 또한 이 여성 들은 그들에게 허락되지 아니하며 또한 불신자들은 그녀들에 대한 권리가 없노라 그리고 그녀들에 게 그들이 지불한 것은 주되 너 희가 지참금을 지불하고 그녀들과 결혼할 경우는 죄악이 아니거늘 믿지 않는 여성들과 결혼하지 말 라 그리고 너희가 지불한 것을 요 구하고 그들을 그들이 지불한 것 을 요구하도록 하리니 그것이 하 나님의 판정이라 실로 하나님은 아심과 지혜로 충만하시니라",
            "verse 60:11": "만약 그대들이 불신자들에게로 가버린 배우자들의 일부를 잃었다면 그대들은 (예전에) 전리품을 얻었도다. 그러니 배우자가 떠난 그들에게 그들이 (결혼을 위해) 쓴 재산과 유사한 것을 되돌려 주라. 그리고 그대들은 그대들이 믿는 하나님을 경외하라너희 아내 중에서 너희를 버리고 불신자에게로 갈 때 공격하 여 전리품을 획득한 것이 있다면 아내가 떠나버린 그들에게 그들 이 지참금으로 지불했던 만큼 지 불하되 너희가 믿는 하나님을 두 려워 하라",
            "verse 60:12": "선지자여! 믿는 여성들이 그대에게 이주하여 와서 그대에게 맹세하길 하나님께 그 어떤 대등한 존재도 두지 않을 것이며, 도둑질하지 않고, 지나(불법 성관계)를 범하지 않고, 자신의 자식들을 죽이지 않고, 자신의 팔과 다리 사이에서 지어낸 거짓을 가져오지 않고, 선행에 있어 그대를 불복종하지 않겠다고 한다면 그대는 그녀들의 맹세를 받아들이고 그녀들을 위해 용서를 빌어주라. 실로 하나님께서는 너그러이 용서하시는 자애로우신 분이라선자자여 믿는 여성들이 그 대에게 와 하나님과 어떤 것도 비 유하지 아니하고 훔치지 아니하며 간음하지 아니하고 자식들을 살해 하지 아니하며 스스로 허위를 조 작하여 중상하지 아니하고 그대의 일에 거역하지 아니할 것이니라 말한 그녀들의 맹세를 받아드리 라 그리고 그녀들을 위해 하나님께용서를 구하라 실로 하나님은 관용과 자비로 충만하시니라",
            "verse 60:13": "믿는 자들이여! 하나님의 노여움을 산 무리를 교우로 두지 말라. 그들은, 무덤의 거주자들에 관하여 불신자들이 단념한 것처럼 그렇게 내세에 관하여 이미 단념하였노라믿는 백성들이여 하나님의 노여움을 받는 자들을 친구로 삼 지 말라 그들은 내세에 관하여 실 망하고 있나니 이는 무덤속에 있 는 불신자들이 실망하는 것과 같 으니라"
        },
        "Kurdish": {
            "verse 60:1": "Gelî ên bawerî anîne! hûn neyarê min û neyarê xwe bi dostî negirin. Tevî ku ew bi rastiya ji we re hatiye kafir bûne hûn ji wan hiz dikin. Ji ber we bi Xudayê perwerdekarê xwe bawerî aniye, ew, we û pêxember (ji warên we) dertînin. Eger hûn ji bo cîhada di rêya min de û xwestina qayilbûna min derketine (êdî hûn wan dost negirin). Hûn bi dizî ji wan hiz dikin tevî ku ez tiþtê hûn vediþêrin û tiþtê hûn eþkere dikin tev dizanim. Kî ji we vî bike êdî bi rastî wî rêya rast þaþ kiriyeئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه دوژمنانی من و دوژمنانی خۆتان مه‌که‌نه دۆستی گیانی به‌گیانی، له‌کاتێکدا خۆشه‌ویستی و سۆزی خۆتانیان بۆ ده‌رده‌برن، به‌ڕاستی ئه‌وان بێ باوه‌ڕیش بوون به‌وه‌ی له لایه‌ن خواوه بۆتان هاتووه‌، ئه‌وانه پێغه‌مبه‌رو ئێوه‌ش ده‌رده‌که‌ن له مه‌ککه‌، له‌به‌ر ئه‌وه‌ی که باوه‌ڕ ده‌هێنن به‌خوای په‌روه‌ردگارتان، (ئه‌مه‌م به‌گوێ بکه‌ن) ئه‌گه‌ر ئێوه ده‌رچوون بۆ تێکۆشان له پێناوی من و به‌ده‌ستهێنانی ڕه‌زامه‌ندی مندا، به‌نهێنی خۆشه‌ویستی خۆتانیان پێده‌گه‌یه‌نن، له‌کاتێکدا من ئاگادارم به‌وه‌ی شاردوتانه‌ته‌و و به‌وه‌ش که ئاشکراتان کردووه‌، جا هه‌ر که‌س له ئێوه کاری وابکات ئه‌وه به‌ڕاستی ڕێبازی ڕاستی ون کردووه‌.",
            "verse 60:2": "Eger ew bi ser we kevin ewê ji we re bibin neyar û wê destên xwe û zimanên xwe bi xerabî dirêjî we bikin û ew hiz dikin ku xwezî hûn jî kafir bibûnaهه‌ر کاتێك خوانه‌ناسان ده‌سه‌ڵاتیان هه‌بێت و ئێوه‌یان ده‌ست بکه‌وێت، ئه‌وه ده‌بنه دوژمنتان و ده‌ست و زمانیان به‌خراپه درێژ ده‌که‌ن بۆتان (به‌هه‌رچی بۆیان بکرێت) ئه‌وانه پێیان خۆش بووه و ئاواتیان خواستووه که ئێوه له ئایینه‌که‌تان هه‌ڵگه‌ڕێنه‌وه‌.",
            "verse 60:3": "Ne mervatiyên we û ne jî zarûyên we qet bikêra we nayên. Roja qiyametê wê navbera we ji hev biqetîne. Xuda, tiþtê hûn dikin baþ dibîneخزمان و ڕۆڵه‌کانتان هه‌رگیز فریاتان ناکه‌ون، چونکه له ڕۆژی قیامه‌تدا له یه‌کتان جیاده‌کاته‌وه‌، به‌ڕاستی خوا بینایه به‌و کارو کرده‌وه‌ی که ده‌یکه‌ن.",
            "verse 60:4": "Bi rastî ji we re di Îbrahîm û ên pê re de nimûnekî rind heye. (Di bîr bînin) dema ji komela xwe re gotin ku: \"Bêguman em ji tiþtê hûn bêyî Xuda dihebînin bêrî ne. Em ji we bawer nakin û di navbera me û we de neyartî û xeþma hertimî xuya yekta bawerî bînin.\" Tenê gotina Îbrahîm ji bavê xwe re (ne tê de; ku gotê:) \"2Sond be ezê ji te re bexþînê bixwazim û li hember Xuda ji te re tu tiþt di destê min de nîne.\" Perwerdekarê me! me her xwe sipartiye te û em her bal te ve vegeriyane û veger her bal te ve yeئه‌ی ئیمانداران، به‌ڕاستی له ئیبراهیم و ئه‌وانه‌ی که له‌گه‌ڵیدا بوون نموونه‌یه‌کی چاکتان خراوه‌ته به‌رچاو، کاتێك که به قه‌ومه‌که‌ی خۆیانیان وت: دوای ساڵه‌ها بانگه‌واز، ئێمه به‌رین له ئێوه و له‌و شتانه‌ش که له‌جیاتی خوا ده‌یپه‌رستن، ئێمه باوه‌ڕمان به‌و د‌ین و ئاینه‌ی ئێوه نیه‌، ئیتر دوژمنایه‌تی و ڕقه‌به‌رایه‌تی له‌نێوانماندا به‌رپا بووه تا ئه‌و کاته‌ی که باوه‌ڕ به خوای تاك و ته‌نها ده‌هێنن، جگه له‌و به‌ڵێنه‌ی ئیبراهیم دای به باوکی و وتی: بێگومان داوای لێخۆشبوونت بۆ ده‌که‌م، ده‌سه‌ڵاتی خوایشم نیه ئه‌گه‌ر کاره‌ساتێكت به‌سه‌ر بهێنێت، ئینجا وتی: په‌روه‌ردگارا، هه‌ر پشتمان به تۆ به‌ستووه و هه‌ر بۆ لای تۆش گه‌ڕاوینه‌ته‌وه‌، سه‌ره‌‌نجامیش هه‌ر بۆ لای تۆیه‌.",
            "verse 60:5": "Perwerdekarê me tu me ji ên kafir bûne re neke sihêtî û tu ji me re bibexþîne perwerdekarê me! Bêguman tu, serkeftiyê hîkmetdar her tu yîپه‌روه‌ردگارا مه‌مانکه به‌مایه‌ی گومڕایی بۆ ئه‌وانی بێ باوه‌ڕ بوون، لێشما خۆش ببه په‌روه‌ردگارمان، به‌ڕاستی هه‌ر تۆ خوایه‌کی باڵاده‌ست و دانایت.",
            "verse 60:6": "Sond be, ji we re di wan de nimûnekî rind heye ji ê ku hêviya Xuda û roja dawîn dike re. Kî rû bizivrîne êdî bêguman Xuda, dewlemendê hêjayê pesn her ew eسوێند به خوا به‌ڕاستی له سه‌رگوزه‌شته و ژیانی ئیبراهیم و ئه‌واندا نموونه و پێشه‌نگێگی چاک هه‌یه بۆ ئه‌وه‌ی چاویان لێ بکه‌ن، بۆ ئه‌و که‌سه‌ی که ئاوات و ئومێدی ڕه‌زامه‌ندی خوایه‌و له ڕۆژی دوایی ده‌ترسێت و حسابی بۆ ده‌کات، جا ئه‌وه‌ش که پشت هه‌ڵده‌کات و شوێن ڕێبازی ئه‌وان ناکه‌وێت ئه‌وه بابزانێت خۆی زه‌ره‌ر ده‌کات چونکه خوا هه‌ر خۆی بێنیازه و شایسته‌ی هه‌موو جۆره سوپاسێکه‌.",
            "verse 60:7": "Dibe ku Xuda di nava we û ên we neyartiya wan dikir de hizkirinekî çêke. Xuda baþ dikare. Xuda bexþendekar e dilovan eنزیکه خوا خۆشه‌ویستی و سۆز به‌رپا بکات له نێوان ئێوه و ئه‌وانه‌دا که دوژمنایه‌تیتان له‌گه‌ڵ کردن له‌وان و هه‌ندێکیان باوه‌ڕ بهێنن، هه‌میشه خوا به ده‌سه‌ڵاته‌، هه‌ر ئه‌و خوایه‌ش لێخۆشبوو میهره‌بانه چاوپۆشی له ڕابوردوو ده‌کات.",
            "verse 60:8": "Xuda we ji ên ku di dîn de bi we re þer nekirine û we ji warên we dernexistine para nade ku hûn bi wan qencî bikin û bi wan re bi dad û rastî tevbigerin. Lewra bêguman Xuda ji ehlê dad û rastiyê hiz dikeدڵنیاش بن که خوا قه‌ده‌غه‌ی ئه‌وه‌تان لێ ناکات که چاك ڕه‌فتاری و دادپه‌روه‌ری بکه‌ن له‌گه‌ڵ ئه‌و که‌سانه‌دا جه‌نگیان دژ نه‌کردون و دژایه‌تی ئاینیان نه‌کردون و له شوێنه‌وارتان ده‌ریان نه‌کردون، چونکه به‌ڕاستی خوا دادپه‌روه‌رانی خۆش ده‌وێت.",
            "verse 60:9": "Bêguman Xuda we tenê ji ên ku di dîn de bi we re þer kirine û we ji warên we deranîne û li ser derxistina we piþtvaniya hev kirine, para dide ku hûn wan dost bigrin. Kî wan dost bigre, êdî sitemkar her ewên han inبه‌ڕاستی خوا ته‌نها قه‌ده‌غه‌ی ئه‌وه‌تان لێ ده‌کات که پشتیوانیی بکه‌ن له‌وانه‌ی که جه‌نگیان به‌رپا کرد دژی ئاین و ده‌ریان کردن له شوێنه‌واری خۆتان و پشتیوانی ئه‌وانیان کرد ڕۆڵیان هه‌بوو له ده‌رکردنتاندا، ئه‌وه‌ش پشتیوانیان لێ بکات و خۆشی بوێن، جا ئائه‌وانه هه‌ر سته‌مکارن.",
            "verse 60:10": "Gelî ên bawerî anîne! gava jinên bawermend bi koþberî hatin bal we, vêca hûn wan sihêtî bikin. Xuda baweriya wan çêtir dizane. Vêca eger we wan (jinan) bawermend zanî, êdî hûn wan bal kafiran ve nezivrînin. Ne ew (jin) ji wan re durust in û ne jî ew (kafir) ji wan (jinan) re durust in. Hûn tiþtê wan (kafiran) daye bidin wan. Tu guneh li ser we nîne ku hûn mehr bikin gava hûn destmuza (mehra) wan bidin wan. Hûn bi dawa jinên (xwe yên) kafir negirin û tiþtê we daye bixwazin û bira ew jî tiþtê dane bixwazin. Hukmê Xuda evê han e. Xuda di navbera we de hukim dike. Xuda zana ye hîkmetdar eئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه کاتێک ئافره‌ته ئیمانداره‌کان کۆچ ده‌که‌ن و دێن بۆ لاتان تاقیان بکه‌نه‌وه‌و به‌وردیی پرسیاریان لێ بکه‌ن سه‌باره‌ت به‌کۆچ و هۆی هاتنه‌که‌یان، خوا ئاگاداره به ئیمانه‌که‌یان، جا ئه‌گه‌ر زانیتان باوه‌ڕدارن، ئه‌وه مه‌یانگێڕنه‌وه بۆ لای مێرده بێ باوه‌ڕه‌کانیان، نه ئه‌م ئافره‌ته حه‌ڵاڵی ئه‌و بێ باوه‌ڕانه‌ن، نه‌ئه‌و بێ باوه‌ڕا‌نه‌ش حه‌ڵاڵن بۆ ئه‌م ئافره‌ته ئیماندارانه، ئه‌و ماره‌ییه‌ی مێرده کافره‌کانیان خه‌رجیان کردووه بۆیان بگێڕنه‌وه‌، ئیتر هیچ ڕه‌خنه‌یه‌کیش له‌سه‌رتان نیه ئه‌و ئافرته ماره بکه‌ن کاتێك ماره‌ییان بده‌نێ، ئافره‌تانی کافرمه‌هێڵنه‌وه لای خۆتان، واته ماره‌یان مه‌که‌ن، ئێوه‌ش ئه‌ی ئیمانداران ئه‌گه‌ر مه‌سره‌فێکتان کردووه له ئافره‌تێکی کافردا داوای بکه‌نه‌وه‌، ئه‌وانیش ئه‌گه‌ر مه‌سره‌فێکیان کردووه له ئافره‌تێکی ئیمانداردا با داوای بکه‌نه‌وه‌، ئائه‌وه حو‌کم و فه‌رمانی خوایه‌، که خۆی فه‌رمانڕه‌وایی ده‌کات له نێوانتاندا، خوای گه‌وره‌ش هه‌میشه زانا و دانایه‌.",
            "verse 60:11": "Eger tiþtekî ji jinên we ji dest we çû bal kafiran vêca hûn bi ser ketin, êdî hûn biqasî tiþtê dane bidin ên ku pîrekên wan ji dest wan çûne. Hûn xwe ji Xudayê ku hûn pê bawermend in biparêzin-bitirsinخۆ ئه‌گه‌ر یه‌کێك یان هه‌ندێك له هاوسه‌رانتان گه‌ڕانه‌وه بۆ ناو کافران، له‌وه‌ودوا جه‌نگ له نێوان ئێوه و کافراندا به‌رپابوو و سه‌رکه‌وتن به‌سه‌ریاندا، ئێوه له ده‌ستکه‌وتی ئه‌و جه‌نگه زه‌ره‌ری ئه‌و ئیماندارانه ببژێرن که خێزانه‌کانیان ڕۆشتوون، له‌و خوایه بترسن که ئێوه هه‌میشه بڕوادارن پێی.",
            "verse 60:12": "Pêxember! gava jinên bawermend hatin bal te ku bi te re bey´et kin ku: Bi Xuda re tu tiþtî nekin û zarûyên xwe nekujin û di nav pêþî û lingên xwe de derewa bi hev nexim neynin û di karê qenc de bêfermaniya te nekin, êdî tu jî bi wan re bey´et bike, û ji Xuda, ji wan re bexþînê bixwaze. Lewra bêguman Xuda bexþendekar e dilovan eئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) کاتێک ئافره‌تانی ئیماندار هاتن بۆ لات و په‌یمانیان پێدایت که‌: هیچ جۆره هاوه‌ڵێك بۆ خوا بڕیار نه‌ده‌ن، دزی نه‌که‌ن، زینا نه‌که‌ن، ڕۆڵه‌کانی خۆیان نه‌کوژن، هیچ جۆره بوختانێک نه‌که‌ن له‌نێوان ده‌ست و پێی خۆیاندا (واته دووره په‌رێزبن له هه‌موو جۆره خیانه‌تێک) و فه‌رمانبه‌ردارت بن له هه‌موو چاکه‌یه‌کداو یاخی نه‌بن لێت، جا ئه‌وه تۆ په‌یمانیان له‌گه‌ڵ ببه‌ستن و له خوا داوای لێخۆشبوونیان بۆ بکه‌، چونکه به‌ڕاستی خوا لێخۆشبوو میهره‌بانه‌.",
            "verse 60:13": "Gelî ên bawerî anîne! hûn komelekî ku Xuda li wan hêrs bûye dost negirin. Bi rastî ew ji axretê bêhêvî bûne çewa ku kafir ji ehlê goran bêhêvî bûneئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه پشت مه‌به‌ستن به‌که‌سانێك خوا خه‌شمی لێگرتوون و دۆستایه‌تیان مه‌که‌ن، بێگومان ئه‌وانه نائومێد و بێ هیوا بوون له پاداشتی قیامه‌ت، هه‌روه‌کو کافران، نا‌ئومێد بوون له گه‌ڕانه‌ی نیشته‌جێکانی گۆڕستان."
        },
        "Kyrgyz": {
            "verse 60:1": "О,ыйман келтирген пенделер! Менин жана өзүңөрдүн душманыңарды дос тутпагыла! Силер аларга достук (катын) жиберип жатасыңар. Алар силерге келген Акыйкатка каапыр болушкан! Силерди жана пайгамбарды Аллаһка — Раббиңерге ыйман келтиргениңер үчүн гана (Маккадан айдап) чыгарышууда! Эгер силер Менин ыраазычылыгымды гана үмүт кылып, Менин Жолумда гана жихад кылуу үчүн чыккан болсоңор (аларды дос тутпагыла!) Силер болсо, жашыруун достошуп жатасыңар! Мен силердин ичиңерге катканыңарды да, ашкере кылганыңарды да эң жакшы билемин! Силерден ким муну жасаса, ал Түз Жолдон адашыптыр",
            "verse 60:2": "Алар“ эгерде силерди(н зыяныңарга бир мүмкүнчүлүк) таап калса эле, ошол замат душман болуп, колдору менен тилдерин силерге жамандык менен агытышат жана каапыр болушуңарды самап турушат",
            "verse 60:3": "Тууган-уругуңар менен бала-чакаңар Кыяматта силерге пайда жеткире албайт!, (Аллаһ) араңарды бөлүп койот. Аллаһ эмне иш жасаганыңарды Көрүүчү",
            "verse 60:4": "Силер үчүн Ибрахимде жана аны менен бирге болгон (ыймандуу) адамдард(ын жашоосунд)а өрнөк бар: Бир кезде алар (каапыр) элдерине «Биздин силерге жана силер сыйынган Аллаһтан башка кудайларга тиешебиз жок. биз силерге каапыр болдук! Эми, биз менен силердин араңарда, качан жеке-жалгыз Аллаһка ыйман келтиргениңерге чейин түгөнгүс душманчылык жана жек көрүү жаралды!» деп айтышкан. Бирок, Ибрахимдин атасына карата: «Мен сизге (Аллаһтан) кечирим сурай-мын. Сизге Аллаһ тарабынан (келе турган азаптан) эч нерсени кайтарууга кудуретим жетпейт»-деген сөзүн (өрнөк кылбагыла)”. О, Раббибиз! Биз Сага тобокел кылдык, Өзүңө кайттык жана кайтып баруу — Өзүңө гана",
            "verse 60:5": "О, Раббибиз! Бизди каапырларга фитна (көз каранды) кылбагай элең! жана күнөөлөрүбүздү кечиргей элең! О, Раббибиз! Аныгында Сен Кудуреттүү, Даанышмансың",
            "verse 60:6": "Аларда силер — Аллаһтан жана Акырет Күндөн үмүт кылгандар үчүн эң сонун үлгүлөр бар. Ким (үлгү алуудан) жүз бурса, (билип койгула:) Аллаһ Беймуктаж, Даңазалуу Зат! (Жогорку аяттарда мушриктер менен кандай позицияда болуу керектиги үйрөтүлдү. Бирок, качан алардын ашынган душмандыгы ашкере болмоюнча, алардын ыйманга келишинен үмүт үзбөгөн абзел. Себеби)",
            "verse 60:7": "Аллаһ алардын (Макка мушриктеринин) ичиндеги силер душмандашкан адамдар менен араңарда достук жаратып койсо ажеп эмес. Аллаһ (буга) Кудуреттүү! Аллаһ — Кечиримдүү, Мээримдүү",
            "verse 60:8": "Силер менен дин себептүү согушпаган жана силерди мекениңерден чыгарбаган адамдарга жакшылык жана адилет кылуудан Аллаһ силерди кайтарбайт. Аллаһ адилеттүүлөрдү сүйөт",
            "verse 60:9": "Силерге каршы дин себептүү согушуп, мекениңерден чыгарган жана чыгарууга жардам берген адамдарды дос тутуудан Аллаһ силерди кайтарат. Ким аларды дос туткан болсо, алар анык заалымдар",
            "verse 60:10": "О, ыйман келтиргендер! Эгер силерге ыймандуу аялдар хижрат кылып келсе, аларды сынагыла. Аллаһ алардын ыйманын эң жакшы билет. Эгер алардын ыймандуу экенин аныктасаңар, каапырларга кайтарып жибербегиле. (Себеби,) алар мушриктерге адал эмес, мушриктер аларга адал эмес.! Жана (эгер үйлөнсөңөр) аларга (мушрик күйөөлөрү) берген өлчөмдөгү махырды бергиле. Качан (ушул) махырды төлөсөңөр, аларга үйлөнүүдө силерге күнөө жок. Жана каапыр болуп (Мединадан Маккага кетип) калган аялдардын билегинен да кармабагыла?! Кийин алардан берген махырыңарды сурап алгыла, алар (силер үйлөнгөн мухажир аялдардын Маккада калган мушрик күйөөлөрү) дагы (ал аялдарга) берген махырын силерден сурап алышсын. Аллаһтын өкүмү — ушул. Ал силердин араңарда өкүм кылат. Аллаһ Билүүчү, Даанышман",
            "verse 60:11": "Эгерде, силердин аялдардан кимдир бирөөсү каапырлар тарапка өтүп (бир мушрикке тийип) кетсе, (жана анын мушрик күйөөсү силерге махырды кайрып бербесе) анан силер (согушта мушриктерди) жеңип алсаңар, аялы кетип калган кишилерге (олжодон) махыры барабарынча бөлүп бергиле. Жана өзүңөр ыйман келтирген Аллаһтан корккула",
            "verse 60:12": "О, пайгамбар! Эгер сага ыймандуу аялдар келип, Аллаһка эч нерсени шерик кылбоого, уурулук, зынаа кылбоого, (кыз төрөлгөн) балдарын өлтүрбөөгө, бирөөдөн бала арттырып эрине таңуулабоого жана жакшы (сооп) иштерге буюрганыңда сага каяша айтпоого ант беришсе!, алардан антын кабыл ал жана алардын күнөөлөрүнө Аллаһтан кечирим сура. Аллаһ Кечиримдүү, Ырайымдуу",
            "verse 60:13": "О, ыйман келтирген пенделер! Аллаһтын каарына жолуккан (мушрик) коом менен дос болбогула! Каапырлар мүрзөдөгү адамдардан (алардын кайра тирилүүсүнөн) үмүт үзгөнү сыяктуу, алар (мушриктер) дагы Акыреттен үмүт үзүшкөн"
        },
        "Malay": {
            "verse 60:1": "Wahai orang-orang yang beriman! Janganlah kamu mengambil musuhKu dan musuh kamu menjadi teman rapat, dengan cara kamu sampaikan kepada mereka (berita-berita rahsia orang-orang mukmin) dengan sebab hubungan baik dan kasih mesra yang ada di antara kamu dengan mereka, sedang mereka telah kufur ingkar terhadap kebenaran (Islam) yang sampai kepada kamu; mereka pula telah mengeluarkan Rasulullah (s.a.w) dan juga mengeluarkan kamu (dari Tanah Suci Makkah) disebabkan kamu beriman kepada Allah Tuhan kamu. (Janganlah kamu berbuat demikian) jika betul kamu keluar untuk berjihad pada jalanKu dan untuk mencari keredaanKu. (Tidak ada sebarang faedahnya) kamu mengadakan hubungan kasih mesra dengan mereka secara rahsia, sedang Aku amat mengetahui akan apa yang kamu rahsiakan dan apa yang kamu zahirkan. Dan (ingatlah), sesiapa di antara kamu yang melakukan perkara yang demikian, maka sesungguhnya telah sesatlah ia dari jalan yang betul.",
            "verse 60:2": "Jika mereka dapat menguasai kamu, nescaya mereka menjadi musuh yang membahayakan kamu, dan mereka akan membebaskan tangan mereka dan lidah mereka terhadap kamu dengan kejahatan, serta mereka suka kalaulah kamu juga menjadi kafir (seperti mereka).",
            "verse 60:3": "Kaum kerabat kamu dan anak-anak kamu (yang tidak menurut kamu beriman) tidak sekali-kali akan mendatangkan sebarang faedah kepada kamu pada hari kiamat; Allah akan memisahkan di antara kamu semua (pada hari itu). Dan (ingatlah), Allah Maha Melihat segala yang kamu kerjakan.",
            "verse 60:4": "Sesungguhnya adalah bagi kamu pada bawaan Nabi Ibrahim (a.s) dan pengikut-pengikutnya - contoh ikutan yang baik, semasa mereka berkata kepada kaumnya (yang kufur ingkar): \"Sesungguhnya kami berlepas diri daripada kamu dan daripada apa yang kamu sembah yang lain dari Allah; kami kufur ingkarkan (segala penyembahan) kamu dan (dengan ini) nyatalah perasaan permusuhan dan kebencian di antara kami dengan kamu selama-lamanya, sehingga kamu menyembah Allah semata-mata\", tetapi janganlah dicontohi perkataan Nabi Ibrahim kepada bapanya (katanya): \"Aku akan memohon kepada Tuhanku mengampun dosamu, dan aku tidak berkuasa menahan (azab seksa) dari Allah sedikit juapun daripada menimpamu\". (Berdoalah wahai orang-orang yang beriman sebagaimana Nabi Ibrahim dan pengikut-pengikutnya berdoa ketika mereka memusuhi kaumnya yang kafir, dengan berkata): \"Wahai Tuhan kami! Kepada Engkaulah sahaja kami berserah diri, dan kepada Engkaulah kami rujuk bertaubat, serta kepada Engkaulah jua tempat kembali!",
            "verse 60:5": "\"Wahai Tuhan kami! Janganlah Engkau jadikan pendirian dan keyakinan kami terpesong kerana penindasan orang-orang kafir, dan ampunkanlah dosa kami wahai Tuhan kami; sesungguhnya Engkaulah sahaja Yang Maha Kuasa, lagi Maha Bijaksana\".",
            "verse 60:6": "Demi sesungguhnya! Adalah bagi kamu pada bawaan Nabi Ibrahim dan pengikut-pengikutnya itu contoh ikutan yang baik, iaitu bagi orang yang sentiasa mengharapkan keredaan Allah dan (balasan baik) hari akhirat. Dan sesiapa yang berpaling daripada mencontohi mereka, (maka padahnya akan menimpa dirinya sendiri), kerana sesungguhnya Allah Dia lah Yang Maha Kaya, lagi Maha Terpuji.",
            "verse 60:7": "Semoga Allah akan mengadakan perasaan kasih sayang antara kamu dengan orang-orang yang kamu musuhi dari kerabat kamu itu (dengan jalan menjadikan mereka insaf dan memeluk Islam). Dan (ingatlah), Allah Maha Kuasa (atas tiap-tiap sesuatu), dan Allah Maha pengampun, lagi Maha Mengasihani.",
            "verse 60:8": "Allah tidak melarang kamu daripada berbuat baik dan berlaku adil kepada orang-orang yang tidak memerangi kamu kerana ugama (kamu), dan tidak mengeluarkan kamu dari kampung halaman kamu; sesungguhnya Allah mengasihi orang-orang yang berlaku adil.",
            "verse 60:9": "Sesungguhnya Allah hanyalah melarang kamu daripada menjadikan teman rapat orang-orang yang memerangi kamu kerana ugama (kamu), dan mengeluarkan kamu dari kampung halaman kamu, serta membantu (orang lain) untuk mengusir kamu. Dan (ingatlah), sesiapa yang menjadikan mereka teman rapat, maka mereka itulah orang-orang yang zalim.",
            "verse 60:10": "Wahai orang-orang yang beriman! Apabila orang-orang perempuan yang mengaku beriman datang berhijrah kepada kamu, maka ujilah (iman) mereka: Allah lebih mengetahui akan iman mereka: dengan yang demikian, sekiranya kamu mengetahui bahawa mereka beriman, maka janganlah kamu mengembalikan mereka kepada orang-orang yang kafir. Mereka tidak halal bagi orang-orang kafir itu (sebagai isteri), dan orang-orang kafir itu pula tidak halal bagi mereka (sebagai suami). Dan berilah kepada suami-suami (yang kafir) itu apa yang mereka telah belanjakan. Dan tidaklah menjadi salah kamu berkahwin dengan mereka (perempuan-perempuan yang berhijrah itu) apabila kamu memberi kepada mereka maskahwinnya. Dan janganlah kamu (wahai orang-orang Islam) tetap berpegang kepada akad perkahwinan kamu dengan perempuan-perempuan yang (kekal dalam keadaan) kafir, dan mintalah balik maskahwin yang kamu telah berikan, dan biarkanlah mereka (suami-suami yang kafir itu) meminta balik apa yang mereka telah belanjakan. Demikianlah hukum Allah; Ia hukumkan di antara kamu (dengan adil). Dan (ingatlah), Allah Maha Mengetahui, lagi Maha Bijaksana.",
            "verse 60:11": "Dan sekiranya kamu tidak dapat menerima balik sesuatu dari maskahwin isteri-isteri kamu (yang menjadi murtad serta) melarikan diri ke pihak orang-orang kafir, kemudian kamu menyerang puak yang kafir itu serta mendapat harta rampasan maka berikanlah kepada orang-orang (Islam) yang lari isterinya itu ganti maskahwinnya sebanyak yang mereka telah bayar. Dan bertaqwalah kamu kepada Allah yang kamu beriman kepadaNya.",
            "verse 60:12": "Wahai Nabi! Apabila orang-orang perempuan yang beriman datang kepadamu untuk memberi pengakuan taat setia, bahawa mereka tidak akan melakukan syirik kepada Allah dengan sesuatu pun, dan mereka tidak akan mencuri, dan mereka tidak akan berzina, dan mereka tidak akan membunuh anak-anaknya, dan mereka tidak akan melakukan sesuatu perkara dusta yang mereka ada-adakan dari kemahuan hati mereka, dan mereka tidak akan menderhaka kepadamu dalam sesuatu perkara yang baik, - maka terimalah pengakuan taat setia mereka dan pohonkanlah kepada Allah mengampuni dosa mereka; sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani.",
            "verse 60:13": "Wahai orang-orang yang beriman! Janganlah kamu jadikan teman rapat mana-mana kaum yang dimurkai Allah, mereka telah berputus asa daripada mendapat kebaikan akhirat, sebagaimana berputus asanya orang-orang kafir yang ada di dalam kubur."
        },
        "Malayalam": {
            "verse 60:1": "ഹേ; സത്യവിശ്വാസികളേ, എന്‍റെ ശത്രുവും നിങ്ങളുടെ ശത്രുവും ആയിട്ടുള്ളവരോട് സ്നേഹബന്ധം സ്ഥാപിച്ച് കൊണ്ട് നിങ്ങള്‍ അവരെ മിത്രങ്ങളാക്കി വെക്കരുത്‌. നിങ്ങള്‍ക്കു വന്നുകിട്ടിയിട്ടുള്ള സത്യത്തില്‍ അവര്‍ അവിശ്വസിച്ചിരിക്കുകയാണ്‌. നിങ്ങള്‍ നിങ്ങളുടെ രക്ഷിതാവായ അല്ലാഹുവില്‍ വിശ്വസിക്കുന്നതിനാല്‍ റസൂലിനെയും നിങ്ങളെയും അവര്‍ നാട്ടില്‍ നിന്നു പുറത്താക്കുന്നു. എന്‍റെ മാര്‍ഗത്തില്‍ സമരം ചെയ്യുവാനും എന്‍റെ പ്രീതിതേടുവാനും നിങ്ങള്‍ പുറപ്പെട്ടിരിക്കുകയാണെങ്കില്‍ (നിങ്ങള്‍ അപ്രകാരം മൈത്രീ ബന്ധം സ്ഥാപിക്കരുത്‌.) നിങ്ങള്‍ അവരുമായി രഹസ്യമായി സ്നേഹബന്ധം സ്ഥാപിക്കുന്നു. നിങ്ങള്‍ രഹസ്യമാക്കിയതും പരസ്യമാക്കിയതും ഞാന്‍ നല്ലവണ്ണം അറിയുന്നവനാണ്‌. നിങ്ങളില്‍ നിന്ന് വല്ലവനും അപ്രകാരം പ്രവര്‍ത്തിക്കുന്ന പക്ഷം അവന്‍ നേര്‍മാര്‍ഗത്തില്‍ നിന്ന് പിഴച്ചു പോയിരിക്കുന്നു.",
            "verse 60:2": "അവര്‍ നിങ്ങളെ കണ്ടുമുട്ടുന്ന പക്ഷം അവര്‍ നിങ്ങള്‍ക്ക് ശത്രുക്കളായിരിക്കും. നിങ്ങളുടെ നേര്‍ക്ക് ദുഷ്ടതയും കൊണ്ട് അവരുടെ കൈകളും നാവുകളും അവര്‍ നീട്ടുകയും നിങ്ങള്‍ അവിശ്വസിച്ചിരുന്നെങ്കില്‍ എന്ന് അവര്‍ ആഗ്രഹിക്കുകയും ചെയ്യും.",
            "verse 60:3": "ഉയിര്‍ത്തെഴുന്നേല്‍പിന്‍റെ നാളില്‍ നിങ്ങളുടെ രക്ത ബന്ധങ്ങളോ നിങ്ങളുടെ സന്താനങ്ങളോ നിങ്ങള്‍ക്ക് പ്രയോജനപ്പെടുകയില്ല തന്നെ. അല്ലാഹു നിങ്ങളെ തമ്മില്‍ വേര്‍പിരിക്കും. അല്ലാഹു നിങ്ങള്‍ പ്രവര്‍ത്തിക്കുന്നത് കണ്ടറിയുന്നവനാകുന്നു.",
            "verse 60:4": "നിങ്ങള്‍ക്ക് ഇബ്രാഹീമിലും അദ്ദേഹത്തിന്‍റെ കൂടെയുള്ളവരിലും ഉത്തമമായ ഒരു മാതൃക ഉണ്ടായിട്ടുണ്ട്‌. അവര്‍ തങ്ങളുടെ ജനതയോട് ഇപ്രകാരം പറഞ്ഞ സന്ദര്‍ഭം: നിങ്ങളുമായും അല്ലാഹുവിന് പുറമെ നിങ്ങള്‍ ആരാധിക്കുന്നവയുമായുള്ള ബന്ധത്തില്‍ നിന്നു തീര്‍ച്ചയായും ഞങ്ങള്‍ ഒഴിവായവരാകുന്നു. നിങ്ങളില്‍ ഞങ്ങള്‍ അവിശ്വസിച്ചിരിക്കുന്നു. നിങ്ങള്‍ അല്ലാഹുവില്‍ മാത്രം വിശ്വസിക്കുന്നത് വരെ എന്നെന്നേക്കുമായി ഞങ്ങളും നിങ്ങളും തമ്മില്‍ ശത്രുതയും വിദ്വേഷവും പ്രകടമാവുകയും ചെയ്തിരിക്കുന്നു. തീര്‍ച്ചയായും ഞാന്‍ താങ്കള്‍ക്ക് വേണ്ടി പാപമോചനം തേടാം, താങ്കള്‍ക്ക് വേണ്ടി അല്ലാഹുവിങ്കല്‍ നിന്ന് യാതൊന്നും എനിക്ക് അധീനപ്പെടുത്താനാവില്ല എന്ന് ഇബ്രാഹീം തന്‍റെ പിതാവിനോട് പറഞ്ഞ വാക്കൊഴികെ. (അവര്‍ ഇപ്രകാരം പ്രാര്‍ത്ഥിച്ചിരുന്നു:) ഞങ്ങളുടെ രക്ഷിതാവേ, നിന്‍റെ മേല്‍ ഞങ്ങള്‍ ഭരമേല്‍പിക്കുകയും, നിങ്കലേക്ക് ഞങ്ങള്‍ മടങ്ങുകയും ചെയ്തിരിക്കുന്നു. നിങ്കലേക്ക് തന്നെയാണ് തിരിച്ചുവരവ്‌.",
            "verse 60:5": "ഞങ്ങളുടെ രക്ഷിതാവേ, ഞങ്ങളെ സത്യനിഷേധികളുടെ പരീക്ഷണത്തിന് ഇരയാക്കരുതേ. ഞങ്ങളുടെ രക്ഷിതാവേ, ഞങ്ങള്‍ക്ക് നീ പൊറുത്തുതരികയും ചെയ്യേണമേ. തീര്‍ച്ചയായും നീ തന്നെയാണ് പ്രതാപിയും യുക്തിമാനും",
            "verse 60:6": "തീര്‍ച്ചയായും നിങ്ങള്‍ക്ക് -അല്ലാഹുവെയും അന്ത്യദിനത്തെയും പ്രതീക്ഷിക്കുന്നവര്‍ക്ക് -അവരില്‍ ഉത്തമ മാതൃകയുണ്ടായിട്ടുണ്ട്‌. ആരെങ്കിലും തിരിഞ്ഞുകളയുന്ന പക്ഷം തീര്‍ച്ചയായും അല്ലാഹു തന്നെയാകുന്നു പരാശ്രയമുക്തനും സ്തുത്യര്‍ഹനുമായിട്ടുള്ളവന്‍.",
            "verse 60:7": "നിങ്ങള്‍ക്കും അവരില്‍ നിന്ന് നിങ്ങള്‍ ശത്രുത പുലര്‍ത്തിയവര്‍ക്കുമിടയില്‍ അല്ലാഹു സ്നേഹബന്ധമുണ്ടാക്കിയേക്കാം. അല്ലാഹു കഴിവുള്ളവനാണ്‌. അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 60:8": "മതകാര്യത്തില്‍ നിങ്ങളോട് യുദ്ധം ചെയ്യാതിരിക്കുകയും, നിങ്ങളുടെ വീടുകളില്‍ നിന്ന് നിങ്ങളെ പുറത്താക്കാതിരിക്കുകയും ചെയ്യുന്നവരെ സംബന്ധിച്ചിടത്തോളം നിങ്ങളവര്‍ക്ക് നന്‍മ ചെയ്യുന്നതും നിങ്ങളവരോട് നീതി കാണിക്കുന്നതും അല്ലാഹു നിങ്ങളോട് നിരോധിക്കുന്നില്ല. തീര്‍ച്ചയായും അല്ലാഹു നീതി പാലിക്കുന്നവരെ ഇഷ്ടപ്പെടുന്നു.",
            "verse 60:9": "മതകാര്യത്തില്‍ നിങ്ങളോട് യുദ്ധം ചെയ്യുകയും നിങ്ങളുടെ വീടുകളില്‍ നിന്ന് നിങ്ങളെ പുറത്താക്കുകയും നിങ്ങളെ പുറത്താക്കുന്നതില്‍ പരസ്പരം സഹകരിക്കുകയും ചെയ്തവരെ സംബന്ധിച്ചുമാത്രമാണ് -അവരോട് മൈത്രികാണിക്കുന്നത് - അല്ലാഹു നിരോധിക്കുന്നത്‌. വല്ലവരും അവരോട് മൈത്രീ ബന്ധം പുലര്‍ത്തുന്ന പക്ഷം അവര്‍ തന്നെയാകുന്നു അക്രമകാരികള്‍.",
            "verse 60:10": "സത്യവിശ്വാസികളേ, വിശ്വാസിനികളായ സ്ത്രീകള്‍ അഭയാര്‍ത്ഥികളായി കൊണ്ട് നിങ്ങളുടെ അടുത്ത് വന്നാല്‍ നിങ്ങള്‍ അവരെ പരീക്ഷിച്ച് നോക്കണം. അവരുടെ വിശ്വാസത്തെ പറ്റി അല്ലാഹു ഏറ്റവും അറിയുന്നവനാണ്‌. എന്നിട്ട് അവര്‍ വിശ്വാസിനികളാണെന്ന് അറിഞ്ഞ് കഴിഞ്ഞാല്‍ അവരെ നിങ്ങള്‍ സത്യനിഷേധികളുടെ അടുത്തേക്ക് മടക്കി അയക്കരുത്‌. ആ സ്ത്രീകള്‍ അവര്‍ക്ക് അനുവദനീയമല്ല. അവര്‍ക്ക് അവര്‍ ചെലവഴിച്ചത് നിങ്ങള്‍ നല്‍കുകയും വേണം. ആ സ്ത്രീകള്‍ക്ക് അവരുടെ പ്രതിഫലങ്ങള്‍ നിങ്ങള്‍ കൊടുത്താല്‍ അവരെ നിങ്ങള്‍ വിവാഹം കഴിക്കുന്നതിന് നിങ്ങള്‍ക്ക് വിരോധമില്ല. അവിശ്വാസിനികളുമായുള്ള ബന്ധം നിങ്ങള്‍ മുറുകെപിടിച്ചു കൊണ്ടിരിക്കുകയും ചെയ്യരുത്‌. നിങ്ങള്‍ ചെലവഴിച്ചതെന്തോ, അത് നിങ്ങള്‍ ചോദിച്ചു കൊള്ളുക. അവര്‍ ചെലവഴിച്ചതെന്തോ അത് അവരും ചോദിച്ച് കൊള്ളട്ടെ. അതാണ് അല്ലാഹുവിന്‍റെ വിധി. അവന്‍ നിങ്ങള്‍ക്കിടയില്‍ വിധികല്‍പിക്കുന്നു. അല്ലാഹു സര്‍വ്വജ്ഞനും യുക്തിമാനുമാകുന്നു.",
            "verse 60:11": "നിങ്ങളുടെ ഭാര്യമാരില്‍ നിന്ന് വല്ലവരും അവിശ്വാസികളുടെ കൂട്ടത്തിലേക്ക് (പോയിട്ട് നിങ്ങള്‍ക്ക്‌) നഷ്ടപ്പെടുകയും എന്നിട്ട് നിങ്ങള്‍ അനന്തര നടപടിയെടുക്കുകയും ചെയ്യുകയാണെങ്കില്‍ ആരുടെ ഭാര്യമാരാണോ നഷ്ടപ്പെട്ട് പോയത്‌, അവര്‍ക്ക് അവര്‍ ചെലവഴിച്ച തുക (മഹ്ര്) പോലുള്ളത് നിങ്ങള്‍ നല്‍കുക. ഏതൊരു അല്ലാഹുവില്‍ നിങ്ങള്‍ വിശ്വസിക്കുന്നുവോ അവനെ നിങ്ങള്‍ സൂക്ഷിക്കുകയും ചെയ്യുക.",
            "verse 60:12": "ഓ; നബീ, അല്ലാഹുവോട് യാതൊന്നിനെയും പങ്കുചേര്‍ക്കുകയില്ലെന്നും, മോഷ്ടിക്കുകയില്ലെന്നും, വ്യഭിചരിക്കുകയില്ലെന്നും, തങ്ങളുടെ മക്കളെ കൊന്നുകളയുകയില്ലെന്നും, തങ്ങളുടെ കൈകാലുകള്‍ക്കിടയില്‍ വ്യാജവാദം കെട്ടിച്ചമച്ചു കൊണ്ടുവരികയില്ലെന്നും, യാതൊരു നല്ലകാര്യത്തിലും നിന്നോട് അനുസരണക്കേട് കാണിക്കുകയില്ലെന്നും നിന്നോട് പ്രതിജ്ഞ ചെയ്തുകൊണ്ട് സത്യവിശ്വാസിനികള്‍ നിന്‍റെ അടുത്ത് വന്നാല്‍ നീ അവരുടെ പ്രതിജ്ഞ സ്വീകരിക്കുകയും, അവര്‍ക്കു വേണ്ടി പാപമോചനം തേടുകയും ചെയ്യുക. തീര്‍ച്ചയായും അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 60:13": "സത്യവിശ്വാസികളേ, അല്ലാഹു കോപിച്ചിട്ടുള്ള ഒരു ജനതയോട് നിങ്ങള്‍ മൈത്രിയില്‍ ഏര്‍പെടരുത്‌. ഖബ്‌റുകളിലുള്ളവരെ സംബന്ധിച്ച് അവിശ്വാസികള്‍ നിരാശപ്പെട്ടത് പോലെ പരലോകത്തെപ്പറ്റി അവര്‍ നിരാശപ്പെട്ടുകഴിഞ്ഞിരിക്കുന്നു."
        },
        "Norwegian": {
            "verse 60:1": "Slutt dere ikke til Mine og deres fiender, idet dere tilbyr dem sympati, skjønt de fornekter det som er blitt dere til del av sannhet, og har fordrevet Sendebudet og dere fordi dere tror på Gud, deres Herre, om dere er dratt ut for å kjempe for Min sak og å søke Mitt velbehag. Dere betror dem hemmelig sympati, men Jeg vet hva dere skjuler og hva dere bærer åpent frem. Den av dere som gjør dette, er kommet bort fra den strake vei.",
            "verse 60:2": "Hvis de kommer over dere, er de deres fiender og retter sine hender og tungens tale mot dere for å gjøre dere vondt, og ønsker at dere skal falle fra.",
            "verse 60:3": "Verken blodsbånd eller barn skal være til nytte for dere på oppstandelsens dag. Han vil skille mellom dere. Gud er observant for det dere gjør.",
            "verse 60:4": "I Abraham og de som var med ham, har dere et vakkert eksempel, da de sa til sitt folk: «Vi er ferdige med dere og det dere tilber utenom Gud! Vi tar avstand fra dere, og mellom dere og oss er oppstått fiendskap og hat for alltid, inntil dere måtte tro på Gud alene.» Dog sa Abraham til sin far: «Jeg skal visselig be om tilgivelse for deg, men jeg har ikke makt til å utrette noe som helst for deg overfor Gud,» Herre, vi forlater oss på Deg, og til Deg vender vi oss i bot. Til Deg er reisens mål!",
            "verse 60:5": "Herre gjør oss ikke til anstøt for de vantro, men tilgi oss, Herre! Du er den Mektige, Vise.",
            "verse 60:6": "Det er et vakkert eksempel for dere i dem, for alle som setter sitt håp til Gud og dommens dag. Men om noen vender seg bort, så er Gud den Selvtilstrekkelige, den Lovpriste.",
            "verse 60:7": "Det kan hende at Gud skaper sympati mellom dere og dem dere levde i fiendskap med. Gud evner alt! Gud er tilgivende og nåderik.",
            "verse 60:8": "Gud forbyr dere ikke å vise respekt og rimelighet mot dem som ikke bekjemper dere for religionens sak, og ikke drev dere bort fra deres hjem. Gud liker dem som viser rimelighet.",
            "verse 60:9": "Gud forbyr dere bare at dere slutter dere til dem som bekjempet dere for religionens sak, og drev dere bort fra deres hjem eller hjalp til ved utdrivingen. De som sluttet seg til disse, de er urettferdige.",
            "verse 60:10": "Dere som tror, når det kommer til dere troende kvinner som utvandrere, så sett dem på prøve. Gud kjenner best til deres tro. Hvis dere så vet at de er troende, så send dem ikke tilbake til de vantro. De er ikke tillatt for dem, og de vantro er ikke tillatt for disse. Men gi de vantro det de har lagt ut ved giftermål. Dere rammes ikke av skyld om dere gifter dere med dem, så fremt dere gir dem det de har krav på. Men hold ikke fast ved båndene til vantro kvinner. Krev det dere har lagt ut, og la dem kreve det de har lagt ut. Dette er Guds avgjørelse. Han treffer avgjørelse mellom dere. Gud vet, er vis.",
            "verse 60:11": "Og hvis noen av deres hustruer kommer bort fra dere og til de vantro, så stå sammen om følgen, og gi dem hvis hustruer er blitt borte, tilsvarende det de har lagt ut. Og frykt Gud, Ham som dere tror på.",
            "verse 60:12": "Du profet! Når troende kvinner kommer til deg og gir deg troskapsed, at de ikke skal sette noen ved Guds side, ikke stjele, ikke begå utroskap, ikke drepe sine barn, og ikke fare med bakvaskelser som de har grepet ut av luften, og ikke vise deg ulydighet i det som er godt og rett, så ta imot deres troskapsed og be Gud om tilgivelse for dem. Gud er tilgivende, nåderik.",
            "verse 60:13": "Dere som tror, slutt dere ikke til folk som er under Guds vrede, som har avskrevet det kommende liv, slik de vantro har avskrevet dem som er i gravene!"
        },
        "Pashto": {
            "verse 60:1": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو زما دښمنان او خپل دښمنان دوستان مه نیسئ، چې تاسو دوى ته مینه وروړاندې كوئ، حال دا چې دوى په هغه حق باندې كافران شوي دي چې تاسو ته راغلى دى، دوى رسول او تاسو په دې سبب (له خپل وطنه) وباسي چې تاسو په خپل رب الله باندې ایمان راوړى دى۔؛ كه چېرې یئ تاسو چې زما په لاره كې د جهاد لپاره او زما د رضامندۍ د غوښتلو لپاره راوتلي یئ۔، تاسو دوى ته په پټه سره (پېغام د) دوستي لېږئ، حال دا چې زه په هغه څه ښه عالم یم چې تاسو يې پټوئ او په هغه څه چې تاسو يې څرګندوئ او په تاسو كې چې هر څوك دغه (كار) وكړي، نو یقینًا هغه له نېغې لارې نه بې لارې شو",
            "verse 60:2": "كه چېرې دوى په تاسو برى ومومي (، نو) تاسو لپاره به دښمنان شي او تاسو ته به در اوږده كړي خپل لاسونه او خپلې ژبې په بدۍ سره او دوى خوښوي چې تاسو كافران شئ",
            "verse 60:3": "تاسو ته به له سره نفع در ونه رسوي ستاسو خپلویانې او نه ستاسو اولاد۔، د قیامت په ورځ به هغه (الله) ستاسو په مینځ كې فیصله كوي۔ او الله هغو كارونو لره چې تاسو يې كوئ؛ ښه لیدونكى دى",
            "verse 60:4": "یقینًا تاسو لپاره یوه ښكلې طریقه په ابراهیم او په هغو كسانو كې ده چې له هغه سره ملګري وو كله چې هغوى خپل قوم ته وویل: بېشكه مونږ له تاسو نه او له هغو څیزونو نه چې تاسو يې له الله نه غیر عبادت كوئ، سخت بېزاره (او جدا) یو، مونږ پر تاسو باندې منكران شوي یو۔ او زمونږ په مینځ كې او ستاسو په منیځ كې عداوت (دښمني) او بغض د تل لپاره څرګند (او واقع) شوى دى۔، تر هغه پورې چې تاسو په الله باندې ایمان راوړئ چې ايكي يواځې دى۔ خو خپل پلار ته د ابراهیم د دې (استغفار له) خبرې نه غیر چې: ’’زه به تا لپاره خامخا ضرور استغفار غواړم‘‘، او زه تا لپاره د الله په مقابله كې د هېڅ شي اختیار نه لرم ۔، اى زمونږه ربه! خاص په تا باندې مونږ توكل كړى دى او خاص تا ته مو رجوع كړې ده او خاص تا ته بېرته درتګ دى",
            "verse 60:5": "اى زمونږه ربه! ته مونږ د كافران شویو خلقو لپاره (ځاى د) فتنې مه ګرځوه۔ او ته مونږ ته مغفرت وكړه اى زمونږ ربه! بېشكه هم دا ته ډېر غالب، ښه حكمت والا يې",
            "verse 60:6": "یقینًا یقینًا تاسو لپاره په دغو كې ډېر ښكلې (قابلِ اقتدا) طریقه ده، د هغه چا لپاره چې د الله او د اخري ورځې امېد لري او هر هغه څوك چې مخ واړوي، نو بېشكه الله، هم دى غني (ډېر بې پروا)، ښه ستايل شوى دى",
            "verse 60:7": "امېد دى چې الله ستاسو په مینځ كې او د هغو كسانو په مینځ كې دوستي پیدا كړي چې تاسو ورسره دښمني كړې ده او الله ښه قادر دى، او الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 60:8": "الله تاسو له هغو كسانو نه نه منع كوي چې له تاسو سره يې په دین كې نه جنګ كړى دى او نه يې تاسو له خپلو كورونو نه وېستلي یئ دا چې تاسو له هغوى سره نېكي وكړئ او له دوى سره انصاف وكړئ۔، بېشكه الله انصاف كوونكي خوښوي",
            "verse 60:9": "بېشكه الله تاسو يواځې له هغو كسانو نه منع كوي چې له تاسو سره يې په دین كې جنګ كړى دى او تاسو يې له خپلو كورونو نه ایستلي یئ او ستاسو په ایستلو كې يې یو له بل سره مدد كړى دى، دا چې تاسو له دوى سره دوستي وكړئ او هر هغه څوك چې له دوى سره دوستي وكړي، نو هم دغه كسان ظالمان دي",
            "verse 60:10": "اى هغو كسانوچې ایمان يې راوړى دى! كله چې تاسو ته مومنې ښځې راشي، چې هجرت كوونكې وي، نو تاسو دوى وازمایئ۔، الله د دوى په ایمان ښه عالم دى۔، نو كه تاسو دوى مومنې وپېژنئ (معلومې كړئ)، نو تاسو دوى كافرانو ته بېرته مه لېږئ، ۔ دوى د هغوى (كافرانو) لپاره حلالې نه دي او نه هغوى د دغو (مومنو ښځو) لپاره حلال دي او تاسو (د دغو مومنو ښځو) دغو (كافرو خاوندانو) ته هغه څه وركړئ چې دوى لګولي دي۔ او پر تاسو باندې په دې كې هېڅ ګناه نشته چې تاسو له دوى سره نكاح وكړئ (خو په دې شرط) كله چې تاسو دوى ته د دوى مهرونه وركړئ۔ او تاسو د كافرو ښځو په عصمتونو منګولې مه لګوئ (په نكاح كې يې مه ساتئ) او تاسو هغه څه وغواړئ چې تاسو (په دغو كافرو ښځو) لګولي دي۔ او دوى (كافر خاوندان) دې هم هغه څه وغواړي چې دوى (په دغو مهاجرو ښځو باندې) لګولي وي۔، دغه د الله حكم دى، الله ستاسو په مینځ كې (په ده سره) فیصله كوي او الله ښه عالم، ښه حكمت والا دى",
            "verse 60:11": "او كه چېرې ستاسو په ښځو كې كومه ښځه ستاسو له لاسه ووځي (او) كافرو ته (لاړه شي) بیا ستاسو وار راشي (غزا وكړئ نو غنیمت واخلئ) نو تاسو هغو كسانو ته چې د هغوى ښځې تللې وي هومره (مال) وركړئ چې هغوى (پر هغو ښځو) لګولى دى او تاسو له هغه الله نه ووېرېږئ چې تاسو په هغه ایمان لرونكي یئ",
            "verse 60:12": "اى نبي! كله چې تا ته مومنې ښځې راشي چې له تا سره په دې خبره بیعت كوي چې له الله سره به هېڅ شى نه شریكوي او غلا به نه كوي او زنا به نه كوي او خپل اولاد به نه وژني او نه به داسې بهتان لګوي چې هغه د خپلو لاسونو او خپلو پښو په وړاندې جوړوي۔ او په معروفو (نېكو چارو) كې به ستا نافرماني نه كوي، نو ته دوى بیعت كړه او د دوى لپاره د الله مغفرت (بخښنه) وغواړه، بېشكه الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 60:13": "اى هغو كسانو چې ایمان يې راوړى دى! له هغه قوم سره دوستي مه كوئ چې الله پر هغوى باندې غضب كړى دى، ۔ یقینًا دوى له اخرته داسې نا امېده شوي دي لكه كفار چې د قبرونو والاو (له راژوندي كېدو) نه نا امېده شوي دي"
        },
        "Persian": {
            "verse 60:1": "اى كسانى كه ايمان آورده‌ايد، دشمن من و دشمن خود را به دوستى اختيار مكنيد. شما با آنان طرح دوستى مى‌افكنيد و حال آنكه ايشان به سخن حقى كه بر شما آمده است ايمان ندارند. و بدان سبب كه به خدا، پروردگار خويش ايمان آورده بوديد، پيامبر و شما را بيرون راندند. اگر براى جهاد در راه من و طلب رضاى من بيرون آمده‌ايد، در نهان با آنها دوستى مكنيد؛ و من به هر چه پنهان مى‌داريد يا آشكار مى‌سازيد آگاهترم. و هر كه چنين كند، از راه راست منحرف گشته است.",
            "verse 60:2": "اگر بر شما دست يابند، دشمنى مى‌كنند و به آزارتان دست و زبان مى‌گشايند و دوست دارند كه شما نيز كافر گرديد.",
            "verse 60:3": "در روز قيامت نه خويشاوندان برايتان سود كنند، نه فرزندانتان. خدا ميانتان جدايى مى‌افكند و اعمالتان را مى‌بيند.",
            "verse 60:4": "ابراهيم و كسانى كه با وى بودند، آنگاه كه به قوم خود گفتند كه ما از شما و از آنچه جز خداى يكتا مى‌پرستيد بيزاريم و شما را كافر مى‌شمريم و ميان ما و شما هميشه دشمنى و كينه‌توزى خواهد بود تا وقتى كه به خداى يكتا ايمان بياوريد، برايتان نيكو مقتدايى بودند. مگر آنگاه كه ابراهيم پدرش را گفت كه براى تو آمرزش مى‌طلبم، زيرا نمى‌توانم عذاب خدا را از تو دفع كنم. اى پروردگار ما، بر تو توكل كرديم و به تو روى آورديم و سرانجام تو هستى.",
            "verse 60:5": "اى پروردگار ما، ما را چنان مكن كه كافران خوار دارندمان. و ما را بيامرز كه تو پيروزمند و حكيمى.",
            "verse 60:6": "آنها، نيكو مقتدايى هستند براى شما: براى كسانى كه به خدا و روز قيامت اميد دارند. و هر كه رويگردان شود، خدا بى‌نياز و ستودنى است.",
            "verse 60:7": "شايد خدا ميان شما و كسانى كه با آنها دشمنى مى‌ورزيد دوستى پديد آورد. خدا قادر است و خدا آمرزنده و مهربان است.",
            "verse 60:8": "خدا شما را از نيكى‌كردن و عدالت‌ورزيدن با آنان كه با شما در دين نجنگيده‌اند و از سرزمينتان بيرون نرانده‌اند، باز نمى‌دارد. خدا كسانى را كه به عدالت رفتار مى‌كنند دوست دارد.",
            "verse 60:9": "جز اين نيست كه خدا از دوستى‌ورزيدن با كسانى كه با شما در دين جنگيده‌اند و از سرزمين خود بيرونتان رانده‌اند يا در بيرون‌راندنتان همدستى كرده‌اند شما را باز دارد. و هر كه با آنها دوستى ورزد از ستمكاران خواهد بود.",
            "verse 60:10": "اى كسانى كه ايمان آورده‌ايد، چون زنان مؤمنى كه مهاجرت كرده‌اند به نزدتان آيند، بيازماييدشان. خدا به ايمانشان داناتر است. پس، اگر دانستيد كه ايمان آورده‌اند، نزد كافران بازشان مگردانيد. زيرا اينان بر مردان كافر حلال نيستند و مردان كافر نيز بر آنها حلال نيستند. و هر چه آن كافران براى اين گونه زنان هزينه كرده‌اند بپردازيد. و اگر آنها را نكاح كنيد و مهرشان را بدهيد مرتكب گناهى نشده‌ايد. و زنان كافر خود را نگه مداريد. و هر چه هزينه كرده‌ايد از مردان كافر بخواهيد و آنها نيز هر چه هزينه كرده‌اند از شما بخواهند. اين حكم خداست. خدا ميان شما حكم مى‌كند و او دانا و حكيم است.",
            "verse 60:11": "و اگر يكى از زنان شما به كفار پيوست و آنگاه به انتقام از كافران برخاستيد، به كسانى كه زنانشان رفته‌اند به ميزان هزينه‌اى كه كرده‌اند بپردازيد و از خدايى كه به او ايمان آورده‌ايد بترسيد.",
            "verse 60:12": "اى پيامبر، اگر زنان مؤمن نزد تو آمدند تا بيعت كنند، بدين شرط كه هيچ كس را با خدا شريك نكنند و دزدى نكنند و زنا نكنند و فرزندان خود را نكشند و فرزندى را كه از آن شوهرشان نيست به دروغ به او نسبت ندهند و در كارهاى نيك نافرمانى تو نكنند، با آنها بيعت كن و برايشان از خدا آمرزش بخواه، كه خدا آمرزنده و مهربان است.",
            "verse 60:13": "اى كسانى كه ايمان آورده‌ايد، با مردمى كه خدا بر آنها خشم گرفته است دوستى مكنيد. اينان از آخرت نوميدند، همچنان كه آن كافرانى كه اينك در گورند از آخرت نوميدند."
        },
        "Polish": {
            "verse 60:1": "O wy, którzy wierzycie! Nie bierzcie sobie za przyjaciół Mojego wroga i waszego wroga! Wy zwracacie się do nich z przyjaźnią, oni zaś nie wierzą w prawdę, która przyszła do was. Wypędzają Posłańca i was samych, ponieważ wy wierzycie w Boga, waszego Pana. Skoro wyszliście walczyć na Mojej drodze i poszukiwać Mojego zadowolenia, to czy będziecie w skrytości okazywać im przyjaźń? Ja wiem najlepiej to, co ukrywacie i co czynicie jawnie. A ktokolwiek z was to czyni, ten już zbłądził z równej drogi.",
            "verse 60:2": "Jeśli oni was spotkają, będą dla was wrogami; wyciągną do was swoje ręce i swoje języki - ze złem. Oni by chcieli, abyście byli niewiernymi.",
            "verse 60:3": "Nie pomogą wam ani wasi bliscy krewni, ani wasze dzieci w Dniu Zmartwychwstania. On rozstrzygnie między wami. A Bóg widzi dobrze, co czynicie!",
            "verse 60:4": "Mieliście już piękny przykład w Abrahamie i tych, którzy byli z nim, kiedy powiedzieli do swego ludu: \"Zaprawdę, my nie mamy nic z wami i z tym, co wy czcicie oprócz Boga! Wyrzekamy się was! Pojawiła się między nami i wami wrogość i zawiść na zawsze, chyba że uwierzycie w Boga Jedynego!\" Wyjątek uczyniwszy dla słów, jakie powiedział Abraham do swojego ojca: \"Z pewnością będę prosił o przebaczenie dla ciebie, choć nie mam władzy niczego uczynić dla ciebie u Boga.\" \"Panie nasz! Zaufaliśmy Tobie i nawróciliśmy się do Ciebie! Do Ciebie zmierza ostateczna wędrówka!",
            "verse 60:5": "Panie nasz! Nie wystawiaj nas na pokuszenie wobec tych, którzy nie wierzą! Przebacz nam, Panie nasz! Zaprawdę, Ty jesteś Potężny, Mądry!\"",
            "verse 60:6": "Mieliście w nich piękny przykład dla tego, kto spodziewa się spotkać Boga i kto się spodziewa Dnia Ostatniego. A ten, kto się odwróci... zaprawdę, Bóg jest Bogaty, Godny Chwały!",
            "verse 60:7": "Być może, Bóg ustanowi między wami i tymi spośród was, dla których jesteście wrogami - przyjaźń. Bóg jest wszechmocny! Bóg jest przebaczający, litościwy!",
            "verse 60:8": "Bóg nie zabrania wam, abyście byli dobrzy i sprawiedliwi względem tych, którzy was nie zwalczali z powodu religii ani nie wypędzali was z waszych domostw. Zaprawdę, Bóg miłuje ludzi sprawiedliwych!",
            "verse 60:9": "Bóg zabrania wam tylko, abyście sobie brali za przyjaciół tych, którzy was zwalczali z powodu religii i którzy was wypędzali z waszych domostw, i którzy pomagali przy wypędzaniu was. Ci, którzy ich biorą za przyjaciół, są ludźmi niesprawiedliwymi.",
            "verse 60:10": "O wy, którzy wierzycie! Kiedy przyjdą do was kobiety wierzące, które razem wywędrowały, to wybadajcie je. - Bóg zna najlepiej ich wiarę! - Jeśli uznacie je za wierzące, to nie odsyłajcie ich do niewiernych: one nie są już im dozwolone ani oni nie są dozwoleni dla nich. Dajcie im to, co oni wydali! Nie będziecie mieli grzechu, jeśli je poślubicie, kiedy dacie im ich wynagrodzenie. I nie zatrzymujcie przez węzły małżeńskie kobiet niewierzących! Żądajcie od nich tego, co wydaliście, i niech oni żądają, co wydali. Takie jest dla was postanowienie Boga! On rozsądza między wami. Bóg jest wszechwiedzący, mądry!",
            "verse 60:11": "A jeśli któraś z waszych żon odeszła od was do niewiernych, a potem wy chcecie się odpłacić, to dajcie tym, od których żony odeszły, tyleż, ile oni wydali. I bójcie się Boga, w którego wierzycie!",
            "verse 60:12": "O proroku! A kiedy przyjdą do ciebie kobiety wierzące złożyć ci przysięgę wierności: iż nie będą dodawać Bogu żadnych współtowarzyszy, iż nie będą kraść, iż nie będą popełniać cudzołóstwa, iż nie będą zabijać swoich dzieci, iż nie będą przychodzić z oszczerstwem, zmyślając je między swoimi rękami i nogami, ani też nie będą się buntowały przeciwko tobie w tym, co jest uznane - to przyjmij ich przysięgę i proś Boga o przebaczenie dla nich! Zaprawdę, Bóg jest przebaczający, mądry!",
            "verse 60:13": "O wy, którzy wierzycie! Nie bierzcie sobie za przyjaciół ludzi, na których Bóg jest zagniewany. Oni zwątpili w życie ostateczne, tak jak niewierni zwątpili w mieszkańców mogił."
        },
        "Portuguese": {
            "verse 60:1": "Ó fiéis, não tomeis por confidentes os Meus e os vossos inimigos, demonstrando-lhes afeto, posto que renegam tudoquanto vos chegou da verdade, e expulsam (de Makka) tanto o Mensageiro, como vós mesmos, porque credes em Deus, vosso Senhor! Quando sairdes para combater pela Minha causa, procurando a Minha complacência (não os tomeis porconfidentes), confiando-lhes as vossas intimidades, porque Eu, melhor do que ninguém, sei tudo quanto ocultais, e tudoquanto manifestais. Em verdade, quem de vós assim proceder, desviar-se-á da verdadeira senda.",
            "verse 60:2": "Se lograssem tirar o melhor de vós, mostrar-se-iam vossos inimigos, estenderiam as mãos e as línguas contra vós, desejando fazer-vos rejeitar a fé.",
            "verse 60:3": "De nada vos valerão os vossos parentes ou os vossos filhos, no Dia da Ressurreição. Ele vos separará; sabei que Deusbem vê tudo quanto fazeis.",
            "verse 60:4": "Tivestes um excelente exemplo em Abraão e naqueles que o seguiram, quando disseram ao seu povo: Em verdade, nãosomos responsáveis por vossos atos e por tudo quando adorais, em lugar de Deus, Renegamos-vos e iniciar-se-á inimizade eum ódio duradouros entre nós e vós, a menos que creiais unicamente em Deus! Todavia, as palavras de Abraão para o pai: -Implorai o perdão para ti, embora nada venha a obter de Deus em teu favor - foram uma exceção. (Dizei, ó crentes): ÓSenhor nosso, a Ti nos encomendamos e a Ti nos voltamos contritos, porque para Ti será o retorno;",
            "verse 60:5": "Ó Senhor nosso, não faças de nós um escarmento para os incrédulos e perdoa-nos, ó Senhor nosso, porque és o Poderoso, o Prudentíssimo.",
            "verse 60:6": "Tivestes neles um excelente exemplo, de quem confia em Deus e no Dia do Juízo Final. Mas, quem desdenhar, que fiquesabendo que Deus é, por Si, o Opulento, o Laudabilíssimo!",
            "verse 60:7": "É possível que Deus restabeleça a cordialidade entre vós e os vossos inimigos, porque Deus é Poderoso, e porque Deus éIndulgente, Misericordiosíssimo.",
            "verse 60:8": "Deus nada vos proíbe, quanto àquelas que não nos combateram pela causa da religião e não vos expulsaram dos vossoslares, nem que lideis com eles com gentileza e eqüidade, porque Deus aprecia os eqüitativos.",
            "verse 60:9": "Deus vos proíbe tão-somente entrar em privacidade com aqueles que vos combateram na religião, vos expulsaram devossos lares ou que cooperaram na vossa expulsão. Em verdade, aqueles que entrarem em privacidade com eles serãoiníquos.",
            "verse 60:10": "Ó fiéis, quando se vos apresentarem as fugitivas fiéis, examinai-as, muito embora Deus conheça a sua fé melhor do queninguém; porém, se as julgardes fiéis, não as restituais aos incrédulos, porquanto elas não lhes cabem por direito, nem eles aelas; porém, restituí o que eles gastaram (com os seus dotes). Não sereis recriminados se as desposardes, contanto que asdoteis; porém, não vos apegueis à tutela das incrédulas, mas exigi a restituição do que gastastes no seu dote; e que (osincrédulos), por sua vez, exijam o que gastaram. Tal é o Juízo de Deus, com que vos julga, porque Deus é Sapiente, Prudentíssimo.",
            "verse 60:11": "E se alguma de vossas esposas fugir para os incrédulos, e depois tiverdes acesso (a uma mulher deles), restituí àquelescujas esposas houverem fugido o equivalente ao que haviam gasto (com os seus dotes). E temei a Deus, em Quem credes.",
            "verse 60:12": "Ó Profeta, quando as fiéis se apresentarem a ti, jurando-te fidelidade, afirmando-te que não atribuirão parceiros a Deus, não roubarão, não fornicarão, não serão filicidas, não se apresentarão com calúnias que forjarem intencionalmente, nem tedesobedecerão em causa justa, aceita, então, o seu compromisso e implora, para elas, o perdão de Deus, porque Deus éIndulgente, Misericordiosíssimo.",
            "verse 60:13": "Ó fiéis, não tenhais vínculos com o povo que Deus abominou, por ter-se tornado cético quanto à outra vida, como osincrédulos se tornaram céticos quanto aos donos das sepulturas."
        },
        "Punjabi": {
            "verse 60:1": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਸੀਂ’ ਮੇਰੇ ਦੁਸ਼ਮਨਾਂ ਅਤੇ ਆਪਣੇ ਦੁਸ਼ਮਨਾ ਨੂੰ ਮਿੱਤਰ ਨਾ ਬਣਾਉ। ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨਾਲ ਮਿੱਤਰਤਾ ਪ੍ਰਗਟ ਕਰਦੇ ਹੋ ਜਦੋਂ’ ਕਿ ਉਨ੍ਹਾਂ ਨੇ ਉਸਨੂੰ ਝੁਠਲਾਇਆ, ਜਿਹੜਾ ਤੁਹਾਡੇ ਕੋਲ ਆਇਆ ਹੈ। ਉਹ ਰਸੂਲ ਨੂੰ ਅਤੇ ਤੁਹਾਨੂੰ ਇਸ ਕਾਰਨ ਦੇਸ਼-ਨਿਕਾਲਾ ਦਿੰਦੇ ਹਨ ਕਿ ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਅੱਲਾਹ ਤੇ ਈਮਾਨ ਲਿਆਏ, ਜੇਕਰ ਤੁਸੀਂ ਮੇਰੇ ਰਾਹ ਵਿਚ ਜਿਹਾਦ ਕਰਨ ਅਤੇ ਮੇਰੀ ਖੁਸ਼ੀ ਚਾਹੁਣ ਲਈ ਨਿਕਲੇ ਹੋ। ਤੁਸੀਂ ਲੂਕ ਕੇ ਉਨ੍ਹਾਂ ਨੂੰ ਦੋਸਤੀ ਦਾ ਪੈਗਾਮ ਭੇਜਦੇ ਹੋ। ਅਤੇ ਮੈਂ ਜਾਣਦਾ ਹਾਂ ਜੋ ਕੁਝ ਤੁਸੀਂ ਛੁਪਾਉਂਦੇ ਹੋ ਅਤੇ ਜੋ ਕੁਝ ਤੁਸੀਂ ਪ੍ਰਗਟ ਕਰਦੇ ਰੋ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਤੁਹਾਡੇ ਵਿਚੋਂ ਅਜਿਹਾ ਕਰੇਗਾ ਉਹ ਚੰਗੇ ਰਾਹ ਤੋਂ ਭਟਕ ਗਿਆ।",
            "verse 60:2": "ਜੇਕਰ ਉਹ ਤੁਹਾਡੇ ਉੱਤੇ ਕਾਬੂ ਪਾ ਜਾਣ ਤਾਂ ਉਹ ਤੁਹਾਡੇ ਦੁਸ਼ਮਣ ਬਣ ਜਾਣਗੇ। ਅਤੇ ਉਹ ਆਪਣੇ ਹੱਥਾਂ ਅਤੇ ਆਪਣੀ ਜੁਬਾਨ ਦੇ ਨਾਲ ਤੁਹਾਨੂੰ ਦੁੱਖ ਪਹੁੰਚਾਉਣਗੇ। ਅਤੇ ਚਾਹੁੰਣਗੇ ਕਿ ਤੁਸੀਂ ਵੀ ਕਿਸੇ ਤਰ੍ਹਾਂ ਅਵੱਗਿਆਕਾਰੀ ਹੋ ਜਾਓ।",
            "verse 60:3": "ਤੁਹਾਡੇ ਸਕੇ ਸੰਬੰਧੀ ਅਤੇ ਤੁਹਾਡੀ ਔਲਾਦ ਕਿਆਮਤ ਦੇ ਦਿਨ ਤੁਹਾਡੇ ਕੰਮ ਨਹੀਂ ਆਉਣਗੇ। ਉਹ ਤੁਹਾਡੇ ਵਿਚ ਫ਼ੈਸਲਾ ਕਰੇਗਾ। ਅੱਲਾਹ ਦੇਖਣ ਵਾਲਾ ਹੈ ਜੋ ਕੁਝ ਤੁਸੀਂ ਕਰਦੇ ਹੋ।",
            "verse 60:4": "ਤੁਹਾਡੇ ਲਈ ਇਬਰਾਹੀਮ ਅਤੇ ਉਸ ਦੇ ਸਾਥੀਆਂ ਵਿਚੋਂ ਉੱਤਮ ਅਦਰਸ਼ ਹੈ, ਜਦੋਂ ਉਸਨੇ ਆਪਣੀ ਕੌਮ ਨੂੰ ਕਿਹਾ, ਕਿ ਅਸੀਂ ਤੁਹਾਡੇ ਤੋਂ ਅਲੱਗ ਹਾਂ ਅਤੇ ਉਨ੍ਹਾਂ ਚੀਜ਼ਾਂ ਤੋਂ ਵੀ ਜਿਸ ਦੀ ਤੁਸੀਂ ਅੱਲਾਹ ਤੋਂ ਬਿਨ੍ਹਾਂ ਇਬਾਦਤ ਕਰਦੇ ਹੋ। ਅਸੀਂ ਤੁਹਾਡੇ ਅਵੱਗਿਆਕਾਰੀ ਹਾਂ ਅਤੇ ਸਾਡੇ ਅਤੇ ਤੁਹਾਡੇ ਵਿਚ ਹਮੇਸ਼ਾਂ ਲਈ ਦੁਸ਼ਮਣੀ ਅਤੇ ਖੁੱਲ੍ਹੀ ਵਿਰੋਧਤਾ ਹੋ ਗਈ ਹੈ, ਇਥੋਂ ਤੱਕ ਕਿ ਤੁਸੀਂ ਸਿਰਫ਼ ਇੱਕ ਅੱਲਾਹ ਤੇ ਈਮਾਨ ਲਿਆਉ। ਪਰੰਤੂ ਇਬਰਾਹੀਮ ਦਾ ਆਪਣੇ ਪਿਤਾ ਨੂੰ ਇਹ ਕਹਿਣਾ ਕਿ ਮੈਂ ਆਪਣੇ ਲਈ ਖਿਖ੍ਹਾਂ ਜਾਚਨਾਂ ਕਰਾਂਗਾ, ਅਤੇ ਮੈਂ ਆਪ ਲਈ ਅੱਲਾਹ ਦੇ ਸਾਹਮਣੇ ਕਿਸੇ ਗੱਲ ਦਾ ਕੋਈ ਅਧਿਕਾਰ ਨਹੀਂ ਰੱਖਦਾ। ਹੇ ਸਾਡੇ ਪਾਲਣਹਾਰ! ਅਸੀਂ ਤੇਰੇ ਉੱਤੇ ਭਰੋਸਾ ਕੀਤਾ ਅਤੇ ਅਸੀਂ ਤੇਰੇ ਵੱਲ ਵਾਪਿਸ ਮੁੜੇ ਅਤੇ ਤੇਰੇ ਵੱਲ ਹੀ ਵਾਪਿਸ ਮੁੜਨਾ ਹੈ।",
            "verse 60:5": "ਹੈ ਸਾਡੇ ਪਾਲਣਹਾਰ ! ਸਾਨੂੰ ਅਵੱਗਿਆਕਾਰੀਆਂ ਲਈ ਇਮਤਿਹਾਨ ਨਾਂ ਬਣਾ ਅਤੇ ਹੇ ਸਾਡੇ ਪਾਲਣਹਾਰ! ਸਾਨੂੰ ਮੁਆਫ਼ੀ ਬਖਸ਼। ਬੇਸ਼ੱਕ ਤੂੰ ਸ਼ਕਤੀਸ਼ਾਲੀ ਅਤੇ ਬਿਬੇਕ ਵਾਲਾ ਹੈ।",
            "verse 60:6": "ਬੇਸ਼ੱਕ ਤੁਹਾਡੇ ਲਈ ਉਨ੍ਹਾਂ ਦੇ ਅੰਦਰ ਉਸ ਬੰਦੇ ਲਈ ਉੱਤਮ ਅਦਰਸ਼ ਹੈ ਜਿਹੜਾ ਅੱਲਾਹ ਅਤੇ ਪ੍ਰਲੋਕ ਦੇ ਦਿਨ ਦਾ ਉਮੀਦਵਾਰ ਹੋਵੇ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਮੂੰਹ ਮੋੜੇਗਾ ਤਾਂ ਅੱਲਾਹ ਬੇਪਰਵਾਹ ਅਤੇ ਪ੍ਰਸੰਸਾ ਵਾਲਾ ਹੈ।",
            "verse 60:7": "ਉਮੀਦ ਹੈ ਕਿ ਅੱਲਾਹ ਤੁਹਾਡੇ ਅਤੇ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਦੇ ਰਾਹੀਂ ਮਿੱਤਰਤਾ ਪੈਦਾ ਕਰ ਦੇਵੇ ਜਿਨ੍ਹਾਂ ਨਾਲ ਤੁਸੀਂ ਦੁਸ਼ਮਣੀ ਕੀਤੀ ਅਤੇ ਅੱਲਾਹ ਸਾਰਾ ਕੁਝ ਕਰ ਸਕਦਾ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਕਿਰਪਾਸ਼ੀਲ ਹੈ।",
            "verse 60:8": "ਅੱਲਾਹ ਤੁਹਾਨੂੰ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਤੋਂ ਨਹੀਂ ਰੋਕਦਾ ਜਿਲ੍ਹਾਂ ਨੇ ਦੀਨ ਦੇ ਮਾਮਲੇ ਵਿਚ ਤੁਹਾਡੇ ਨਾਲ ਯੁੱਧ ਨਹੀਂ ਕੀਤਾ। ਅਤੇ ਤੁਹਾਨੂੰ ਤੁਹਾਡੇ ਘਰਾਂ ਵਿਚੋਂ ਨਹੀਂ ਕੱਢਿਆ ਕਿ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨਾਲ ਨੇਕੀ ਕਰੋ ਅਤੇ ਉਨ੍ਹਾਂ ਨਾਲ ਇਨਸਾਫ਼ ਕਰੋਂ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਇਨਸਾਫ ਕਰਨ ਵਾਲਿਆਂ ਨੂੰ ਪਸੰਦ ਕਰਦਾ ਹੈ।",
            "verse 60:9": "ਅੱਲਾਹ ਸਿਰਫ਼ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਤੋਂ ਤੁਹਾਨੂੰ ਰੋਕਦਾ ਹੈ ਜਿਹੜੇ ਦੀਨ ਦੇ ਮਾਮਲੇ ਵਿਚ ਤੁਹਾਡੇ ਨਾਲ ਲੜੇ ਅਤੇ ਤੁਹਾਨੂੰ ਤੁਹਾਡੇ ਘਰਾਂ ਵਿੱਚੋਂ ਕੱਢਿਆ ਅਤੇ ਤੁਹਾਨੂੰ ਕੱਢਣ ਲਈ (ਹੋਰਾਂ ਦੀ) ਮਵਦ ਕੀਤੀ। ਕਿ (ਹੁਣ) ਤੁਸੀਂ ਇਨ੍ਹਾਂ ਨਾਲ ਮਿੱਤਰਤਾ ਕਰੋ। ਅਤੇ ਜਿਹੜੇ ਉਨ੍ਹਾਂ ਨਾਲ ਮਿੱਤਰਤਾ ਕਰਨ ਤਾਂ ਉਹ ਹੀ ਅੱਤਿਆਚਾਰੀ ਲੋਕ ਹਨ।",
            "verse 60:10": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਜਦੋਂ ਤੁਹਾਡੇ ਕੋਲ ਮੁਸਲਮਾਨ ਔਰਤਾਂ ਹਿਜਰਤ (ਪ੍ਰਵਾਸ) ਕਰਕੇ ਆਉਣ ਤਾਂ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਪਰਖ ਲਵੋ। ਅੱਲਾਹ ਉਨ੍ਹਾਂ ਦੇ ਈਮਾਨ ਨੂੰ ਚੰਗੀ ਤਰ੍ਹਾਂ ਜਾਣਦਾ ਹੈ। ਤਾਂ ਜੇਕਰ ਤੁਸੀਂ ਇਹ ਜਾਣ ਲਵੋ, ਕਿ ਉਹ ਮੌਮਿਨ (ਸ਼ਰਧਾਵਾਨ) ਹਨ ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਅਵੱਗਿਆਕਾਰੀਆਂ ਵੱਲ ਵਾਪਿਸ ਨਾਂ ਭੇਜੋ। ਨਾ ਉਹ ਔਰਤਾਂ ਉਨ੍ਹਾਂ (ਅਵੱਗਿਆਕਾਰੀਆਂ) ਲਈ` ਜਾਇਜ਼ ਹਨ ਅਤੇ ਨਾ ਹੀ ਉਹ ਇਨ੍ਹਾਂ ਔਰਤਾਂ ਲਈ ਜਾਇਜ਼ ਹਨ ਅਤੇ ਅਵੱਗਿਆਕਾਰੀਆਂ ਪਤੀਆਂ ਨੇ ਜੋ ਕੁਝ ਖਰਚ ਕੀਤਾ ਉਹ ਉਨ੍ਹਾਂ ਨੂੰ ਅਦਾ ਕਰ ਦਿਓ। ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਕੋਈ ਪਾਪ ਨਹੀਂ ਜੇਕਰ ਤੁਸੀ’ ਉਨ੍ਹਾਂ ਨਾਲ ਨਿਕਾਹ ਕਰ ਲਉਂ। ਜਦੋਂਕਿ ਤੁਸੀਂ’ ਉਨ੍ਹਾਂ ਦਾ ਮਹਿਰ ਉਨ੍ਹਾਂ ਨੂੰ ਅਦਾ ਕਰ ਦਿਓ ਅਤੇ ਤੁਸੀਂ ਅਵੱਗਿਆਕਾਰੀ ਔਰਤਾਂ ਨੂੰ ਆਪਣੇ ਨਿਕਾਹ ਵਿਚ ਨਾ ਰੋਕ ਕੇ ਰੱਖੋ ਅਤੇ ਜੋ ਕੁਝ ਤੁਸੀਂ ਖਰਚ ਕੀਤਾ ਹੈ ਉਸ ਨੂੰ ਮੰਗ ਲਉ ਅਤੇ",
            "verse 60:11": "ਜਿਹੜਾ ਕੁਝ ਅਵੱਗਿਆਕਾਰੀਆਂ ਨੇ ਖਰਚ ਕੀਤਾ ਹੈ ਉਹ ਤੁਹਾਡੇ ਤੋਂ ਮੰਗ ਲੈਣ। ਇਹ ਅੱਲਾਹ ਦਾ ਹੁਕਮ ਹੈ ਉਹ ਤੁਹਾਡੇ ਵਿਚ ਫੈਸਲਾ ਕਰਦਾ ਹੈ ਅਤੇ ਅੱਲਾਹ ਜਾਨਣ ਵਾਲਾ ਬਿਬੇਕ ਵਾਲਾ ਹੈ। ਜੇਕਰ ਤੁਹਾਡੀਆਂ ਪਤਨੀਆਂ ਦੇ ਮਹਿਰ ਵਿਚੋਂ ਕੁਝ ਪਤਨੀਆਂ ਗਈਆਂ ਹਨ, ਉਨ੍ਹਾਂ ਨੂੰ ਅਦਾ ਕਰ ਦੇਵੇਂ ਜੋ ਕੁਝ ਉਨ੍ਹਾਂ ਨੇ ਖਰਚ ਕੀਤਾ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋ ਜਿਸ ਤੇ ਤੁਸੀਂ ਈਮਾਨ ਲਿਆਏ ਹੋ।",
            "verse 60:12": "ਹੇ ਪੈਗੰਬਰ! ਜਦੋਂ ਤੁਹਾਡੇ ਕੋਲ ਮੋਮਿਨ ਔਰਤਾਂ ਇਸ ਗੱਲ ਤੇ ਅਹਿਦ (ਪ੍ਰਣ) ਕਰਨ ਲਈ ਆਉਣ ਕਿ ਉਹ ਅੱਲਾਹ ਦੇ ਬਰਾਬਰ ਕਿਸੇ ਨੂੰ ਸ਼ਰੀਕ ਨਾ ਮੰਨਣਗੀਆਂ ਅਤੇ ਉਹ ਚੋਰੀ ਨਾ ਕਰਨਗੀਆਂ। ਅਤੇ ਉਹ ਵਿਭਚਾਰ ਨਹੀਂ ਕਰਨਗੀਆਂ। ਅਤੇ ਉਹ ਆਪਣੀ ਔਲਾਦ ਦੀ ਹੱਤਿਆ ਨਹੀਂ ਕਰਨਗੀਆਂ ਅਤੇ ਨਾ ਉਹ ਆਪਣੇ ਹੱਥਾਂ ਅਤੇ ਪੈਰਾ ਨਾਲ ਹੁੱਜਤਾਂ ਘੜਣਗੀਆਂ। ਅਤੇ ਨਾ ਉਹ ਕਿਸੇ ਚੰਗੇ ਕੰਮਾਂ ਵਿਚ ਤੁਹਾਡੀ ਅਵੱਗਿਆ ਕਰਨਗੀਆਂ ਤਾਂ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਤੋਂ ਪ੍ਰਣ ਲੈ ਲਵੋ। ਅਤੇ ਉਨ੍ਹਾਂ ਲਈ ਅੱਲਾਹ ਤੋਂ ਮੁਆਫੀ ਦੀ ਪ੍ਰਾਥਨਾ ਕਰੋਂ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਮਿਹਰਬਾਨ ਹੈ।",
            "verse 60:13": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਨੂੰ ਮਿੱਤਰ ਨਾ ਬਣਾਉ ਜਿਨ੍ਹਾਂ ਉੱਤੇ ਅੱਲਾਹ ਦਾ ਗੁੱਸਾ ਪ੍ਰਗਟ ਹੋਇਆ ਹੈ। `ਉਹ ਪ੍ਰਲੋਕ ਤੋਂ ਇਉਂ ਨਿਰਾਸ਼ ਹੋ ਗਏ ਜਿਵੇਂ ਕਬਰਾਂ ਵਿਚ ਪਏ ਹੋਏ ਅਵੱਗਿਆਕਾਰੀ ਨਿਰਾਸ਼ ਹਨ।"
        },
        "Roman english": {
            "verse 60:1": "Yaa ayyuhal lazeena aamanoo laa tattakhizoo `aduwwee wa `aduwaakum awliyaaa`a tulqoona ilaihim bilmawaddati wa qad kafaroo bima jaaa`akum minal haqq, yukhrijoonar Rasoola wa iyyaakum an tu`minoo billaahi rabbikum in kuntum kharajtum jihaadan fee sabeelee wabtighaaa`a mardaatee; tusirroona ilaihim bilma waddati wa ana a`alamu bimaaa akhfaitum wa maaa a`lantum; wa many yaf`alhu minkum faqad dalla sawaaa`as sabeel",
            "verse 60:2": "Iny yasqafookum yakoonoo lakum a`daaa`anw wa yabsutooo ilaikum aydiyahum wa alsinatahum bissooo`i wa waddoo law takfuroon",
            "verse 60:3": "Lan tanfa`akum arhaamukum wa laaa awlaadukum; yawmal qiyaamati yafsilu bainakum; wallaahu bimaa ta`maloon baseer",
            "verse 60:4": "Qad kaanat lakum uswatun basanatun feee Ibraaheema wallazeena ma`ahoo iz qaaloo liqawmihim innaa bura`aaa`u minkum wa mimmaa ta`budoona min doonil laahi kafarnaa bikum wa badaa bainanaa wa bainakumul `adaawatu wal baghdaaa`u abadan hattaa tu`minoo billaahi wahdahooo illaa qawla Ibraheema li abeehi la astaghfiranna laka wa maaa amliku laka minal laahi min shai; rabbanaa `alaika tawakkalnaa wa ilaika anabnaa wa ilaikal maseer",
            "verse 60:5": "Rabbana laa taj`alnaa fitnatal lillazeena kafaroo waghfir lanaa rabbanaa innaka antal azeezul hakeem",
            "verse 60:6": "Laqad kaana lakum feehim uswatunhasanatul liman kaana yarjul laaha wal yawmal aakhir; wa many yatawalla fa innal laaha huwal ghaniyyul hameed",
            "verse 60:7": "Asal laahu any yaj`ala bainakum wa bainal lazeena `aadaitum minhum mawaddah; wallahu qadeer; wallahu ghafoorur raheem",
            "verse 60:8": "Laa yanhaakumul laahu `anil lazeena lam yuqaatilookum fid deeni wa lam yukhrijookum min diyaarikum an tabarroohum wa tuqsitooo ilaihim; innal laaha yuhibbul muqsiteen",
            "verse 60:9": "Innamaa yanhaakumul laahu `anil lazeena qaatalookum fid deeni wa akhrajookum min diyaarikum wa zaaharoo `alaa ikhraajikum an tawallawhum; wa many yatawallahum faulaaa`ika humuz zaalimoon",
            "verse 60:10": "Yaa ayyuhal lazeena aamanoo izaa jaaa`akumul mu`minaatu muhaajiraatin famtah inoohunna Allaahu a`lamu bieemaanihinna fa in `alimtumoohunna mu`minaatin falaa tarji`oohunna ilal kuffaar; laa hunna hillul lahum wa laa hum uahilloona lahunna wa aatoohum maa anfaqoo wa laa junaaha `alaikum an tankihoohunna izaaa aataitumoohunna ujoorahunn; wa laa tumsikoo bi `isamil kawaafiri was`aloo maaa anfaqtum walyas`aloo maaa anfaqoo zaalikum hukmul laahi yahkumu bainakum wallaahu `aleemun hakeem",
            "verse 60:11": "Wa in faatakum shai`um min azwaajikum ilal kuffaari fa`aaqabtum fa aatul lazeena zahabat azwaajuhum misla maaa anfaqoo; wattaqul laahal lazeee antum bihee mu`minoon",
            "verse 60:12": "Yaaa ayyuhan nabbiyyu izaa jaaa`akal mu`minaau yubaai naka `alaaa allaa yushrikna billaahi shai `anw wa laa yasriqna wa laa yazneena wa laa yaqtulna awlaadahunna wa laa yaateena bibuhtaaniny yaftaree nahoo baina aydeehinna wa arjulihinna wa laa ya`seenaka fee ma`roofin fabaayi`hunna wastaghfir lahunnal laaha innnal laaha ghafoorur raheem",
            "verse 60:13": "Yaaa ayyuhal lazeena amanoo laa tatawallaw qawman ghadibal laahu `alaihim qad ya`isoo minal aakhirati kamaa ya`isal kuffaaru min as haabil quboor"
        },
        "Russian": {
            "verse 60:1": "О вы, кто верует! Ни Моего, ни вашего врага Себе в друзья вы не берите, Являя им свою любовь, В то время как они Ту истину, что к вам приходит, отвергают. И гонят (с вашей же земли) посланника и вас За то, что веруете вы в Аллаха, вашего Владыку. И если вы пришли сражаться на Моем пути И тем снискать Мое благоволенье, Вы тайную любовь к ним не храните, - Ведь знаю Я о всем сполна, Что делаете вы сокрыто или явно. А тот, кто поступает так, С пути прямого отклонился.",
            "verse 60:2": "Но если им удастся вами завладеть, Врагами вашими себя они проявят, Направив руки и язык свой вам во зло, - Они хотят, чтобы неверными вы стали;",
            "verse 60:3": "Ни ваши родственники и ни ваши дети В День Воскресения вам не помогут. Рассудит между вами Он, - Ведь зрит Аллах во все, что делаете вы.",
            "verse 60:4": "Поистине, для вас прекрасный есть пример В (пророке) Ибрахиме и в тех, кто следовал за ним, Когда народу своему они сказали: \"Мы покидаем вас и то, Чему вы молитесь, опричь Аллаха. Мы отвергаем вас (и вашу веру); Вражда и ненависть навечно (Стеною) лягут между нами, Пока в Единого Аллаха не уверуете вы\". Но (вам не могут быть примером) Слова, что Ибрахим отцу сказал: \"Поистине, я о твоем прощении молиться буду, Но не владею я ничем перед Аллахом для тебя. О наш Господь! Мы лишь Тебе себя вверяем И с покаянием к Тебе идем; К Тебе лежит и наше возвращенье.",
            "verse 60:5": "О наш Господь! Не делай нас Ты испытанием для тех, Кто (Истину Твою) не принял, И нам прощение пошли, - Ведь мудр и всесилен Ты!\"",
            "verse 60:6": "Поистине, для вас в них дан пример прекрасный,- Для тех из вас, кто лик свой повернул к Аллаху, (Уверовав) в Последний День; Но если отвратится кто, - Аллах, поистине, богат и достохвален!",
            "verse 60:7": "Аллах, быть может, между вами И теми, кто сейчас враждует против вас, Любовь (и дружбу) утвердит, - Поистине, Аллах всесилен, Он - милостив и всепрощающ!",
            "verse 60:8": "Аллах запрета не дает Вам доброту и справедливость проявлять К тем людям, кто за вашу веру с вами не сражался, Не изгонял из дома вас, - Поистине, Он любит справедливых!",
            "verse 60:9": "Аллах дает запрет в друзья брать тех, Которые сражались против веры, И гнали вас из ваших очагов, И помогали вашему изгнанью. И те, кто примет их в друзья, Перед Аллахом нечестивы (будут).",
            "verse 60:10": "О вы, кто верует! Когда к вам беженки (из Мекки) верные придут, Вы испытать на веру их должны, - Аллах их веру знает. Когда узнаете, что веруют они, Не возвращайте их к неверным, - Ведь для неверного супруга Она законною женой не может стать, (Как равно) и неверный Не может быть законным мужем ей. Но им верните все издержки. Вам нет греха на них жениться, Коль вы предбрачный дар дадите им. Но не держите вы неверных жен И требуйте назад свои издержки, И пусть неверные мужья Востребуют от вас, что издержали На жен, которые от них ушли. Таков для вас наказ Аллаха. Он все рассудит между вами, - Ведь преисполнен знания и мудрости Аллах!",
            "verse 60:11": "И коль какая-то из ваших жен От вас к неверному ушла, Вы ж в прибавление себе (другую взяли), Платите тем, от коих жены к вам ушли, Вы равное тому, что эти люди издержали, И страх имейте пред Аллахом, В Которого уверовали вы!",
            "verse 60:12": "О пророк! Когда к тебе, на верность присягая, Придут те женщины, что веруют (в Аллаха), Клянясь, что в равные Ему Не будут измышлять других богов, Не будут красть, блудить не будут, Не будут убивать своих детей, Искусной ложью покрывать не будут Все злодеянья рук своих и ног, Противиться тебе во всем, Что добродетельно, не будут, - Тогда прими присягу их И испроси для них прощенья у Аллаха, - Поистине, всемилостив и всепрощающ Он!",
            "verse 60:13": "О вы, кто верует! С людьми, на коих - гнев Аллаха, не дружите. Ведь в жизни будущей отчаялись они, Как те неверные, Которые сейчас в отчаянии пребывают об обитателях могил."
        },
        "Sindhi": {
            "verse 60:1": "اي ايمان وارؤ منھنجي دشمنن ۽ پنھنجي دشمنن کي دوست (ڪري) نه وٺو اُنھن ڏانھن دوستي جي ڪري پيغام موڪليو ٿا حالانڪ جيڪو اوھان وٽ سچو دين آيو آھي تنھن جا اُھي مُنڪر ٿي چڪا آھن پيغمبر کي ۽ اوھان کي (پنھنجي وطن مان) ھن ڪري ڪڍين ٿا پنھنجي پالڻھار الله تي ايمان آندو اَٿو جيڪڏھن (خاص) منھنجيءَ واٽ ۾ جھاد ڪرڻ لاءِ ۽ منھنجي رضامندي حاصل ڪرڻ لاءِ نڪتا آھيو انھن ڏانھن دوستي جي ڪري ڳُجھو پيغام ٿا موڪليو، حالانڪ جيڪي ڳجھو ڪريو ٿا ۽ جيڪي پڌرو ڪريو ٿا سو آءٌ چڱي طرح ڄاڻندو آھيان، ۽ اوھان مان جيڪو ائين ڪندو سو بيشڪ سِڌو رستو ڀُلو.",
            "verse 60:2": "جيڪڏھن (ڪافر) اوھان کي لھندا ته اوھان جا پڪا ويري ھوندا ۽ اوھان ڏانھن پنھنجا ھٿ ۽ پنھنجيون زبانون ايذاءَ لاءِ ڊگھيون ڪندا ۽ گھُرندا ته جيڪر (ڪنھن طرح اوھين به) ڪافر ٿيو.",
            "verse 60:3": "ڪڏھن نه اوھان کي اوھان جا مائٽ ۽ نڪي اوھان جو اولاد قيامت جي ڏينھن ڪو فائدو ڏيندو، ۽ اوھان جي وچ ۾ (الله) فيصلو ڪندو، ۽ جيڪي (اوھين) ڪندا آھيو سو الله ڏسندڙ آھي.",
            "verse 60:4": "بيشڪ ابراھيم ۽ جيڪي ساڻس ھوا تن جي طريقي ۾ اوھان لاءِ چڱي پيروي آھي، جڏھن پنھنجي قوم کي چيائون ته بيشڪ اسين اوھان کان ۽ جن کي الله کانسواءِ پوڄيندا آھيو تن کان بيزار آھيون، اوھان جا مُنڪر ٿي چڪاسون ۽ اسان جي ۽ اوھان جي وچ ۾ ھميشه دشمني ۽ وير پڌرو ٿي چڪو جيستائين ھڪ الله تي ايمان (نه) آڻيندؤ (ابراھيم جي پيروي چڱي آھي) سواءِ ھن (ڳالھ) جي ته ابراھيم جو پنھنجي پيءُ کي چوڻ ته تولاءِ ضرور بخشش گھرندس ۽ الله کان تولاءِ ڪجھ (ڪري) نه ٿو سگھان، (ابراھيم ۽ سندس ساٿين چيو ته) اي اسان جا پالڻھار توتي ڀروسو ڪيوسون ۽ توڏانھن موٽياسون ۽ تو ڏانھن (ئي) موٽڻ آھي.",
            "verse 60:5": "اي اسان جا پالڻھار اسان کي ڪافرن جو زيردست نه ڪر ۽ اي اسان جا پالڻھار اسان کي بخش، ڇوته تون ئي غالب حڪمت وارو آھين.",
            "verse 60:6": "بيشڪ انھيءَ (مٿينءَ) جماعت ۾ چڱي پيروي اوھان مان انھيءَ لاءِ آھي جيڪو الله (جي لقاءَ) ۽ قيامت جي ڏينھن (جي اچڻ) جي اميد رکندو ھجي، ۽ جيڪو منھن موڙيندو ته بيشڪ الله سڀ کان بي پرواھ ساراھيل آھي.",
            "verse 60:7": "ويجھو آھي ته الله اوھان جي ۽ انھن جي وچ ۾ دوستي پيدا ڪري جن سان انھن منجھان دشمني رکي اٿوَ، ۽ الله سگھارو آھي، ۽ الله بخشڻھار آھي.",
            "verse 60:8": "الله اوھان کي انھن (سان ڳنڍڻ) کان نٿو جھلي جن اوھان سان دين (جي ڳالھ) ۾ نه جنگ ڪئي آھي ۽ نڪي اوھان جي گھرن مان اوھان کي (ٻاھر) ڪڍيو آھي (۽ ھن ڳالھ کان به نٿو جھلي) ته ساڻن احسان ڪريو ۽ سندن حق ۾ انصاف ڪريو، بيشڪ الله انصاف ڪرڻ وارن کي دوست رکندو آھي.",
            "verse 60:9": "الله اوھان کي رڳو انھن (سان ڳنڍڻ) کان جھلي ٿو جن اوھان سان دين بابت ويڙھ ڪئي ۽ اوھان کي اوھان جي گھرن مان ڪڍيو آھي ۽ اوھان جي ڪڍڻ ۾ (ٻـين جي) مدد ڪئي آھي (ھن کان منع ڪري ٿو) ته ساڻن دوستي رکو، ۽ جيڪي ساڻن دوستي رکندا سي ئي ظالم آھن.",
            "verse 60:10": "اي ايمان وارؤ جڏھن اوھان وٽ مؤمنياڻيون وطن ڇڏي اچن تڏھن کين جانچيو، الله انھن جي ايمان کي چڱو ڄاڻندڙ آھي، پوءِ جيڪڏھن کين مؤمنياڻيون ڄاڻو ته انھن کي ڪافرن ڏانھن موٽائي نه موڪليو، نڪي اُھي (مُسلمان زالون) اُنھن (جي مڙسن ڪافرن) کي حلال آھن ۽ نڪي اُھي (ڪافر مڙس) انھن (مسلمان زالن) کي حلال آھن، ۽ جيڪي (ڪابين بابت) خرچ ڪيائون سو اُنھن مڙسن کي ڏيو، ۽ جڏھن کين سندن ڪابين ڏيو ته انھن جي نڪاح ڪرڻ ۾ اوھان تي (ڪو) گناھ نه آھي، ۽ پاڻ وٽ نه جھليو ڪافرياڻين جي لاڳاپن کي (به) ۽ جيڪي اوھان (پنھنجين زالن تي ڪابين) خرچ ڪيو سو جڳائي ته انھن کان گھرو ۽ جيڪي انھن (ڪافرن) پنھنجين زالن تي خرچ ڪيو سو ڀلي ته اُھي (اوھان کان) گھرن، اھو الله جو حُڪم آھي، جو اوھان جي وچ ۾ فيصلو ٿو ڪري، ۽ الله ڄاڻندڙ حڪمت وارو آھي.",
            "verse 60:11": "۽ جيڪڏھن اوھان جي زالن مان ڪا ڪافرن ڏانھن (مُرتد ٿي) وئي ھجي پوءِ (ڪافرن کي) ايذايو ته جن جون زالون ويئون ھجن تن کي (اُن مال مان) اوترو ڏيو جيترو انھن (ڪابين ۾) خرچ ڪيو ھو، ۽ انھيءَ الله کان ڊڄو جو جنھن تي اوھين ويساھ رکندڙ آھيو.",
            "verse 60:12": "اي پيغمبر جڏھن تو وٽ مؤمن زالون اچن ھن (شرط) تي ته توسان بيعت ڪن ته ڪنھن کي الله سان شريڪ مُقرّر نه ڪنديون ۽ نڪي چوري ڪنديون ۽ نڪي زنا ڪنديون ۽ نڪي پنھنجي اولاد کي ڪُھنديون ۽ نڪي اھڙي ڪوڙي تھمت آڻينديون جنھن کي پنھنجن ھٿن ۽ پنھنجن پيرن سان ٺاھيو ھجين ۽ نڪي ڪنھن چڱي ڪم ۾ تنھنجي نافرماني ڪنديون تڏھن سندن بيعت قبول ڪر ۽ انھن لاءِ الله کان بخشش گھر، ڇوته الله بخشڻھار مھربان آھي.",
            "verse 60:13": "اي ايمان وارؤ اوھين انھيءَ قوم سان دوستي نه رکو جنھن تي الله ڏمريو آھي بيشڪ اُھي آخرت (جي ثواب) کان (اھڙو) نا اُميد ٿيا آھن جھڙوڪ ڪافر قبرن وارن کان نا اُميد ٿيا آھن."
        },
        "Sinhalese": {
            "verse 60:1": "අහෝ දේවත්වය විශ්වාස කළවුනි! මාගේ සතුරා හා නුඹලාගේ සතුරා වන ඔවුන් වෙත නුඹලා ආදරය දක්වමින් මිතුරන් ලෙස නොගනු. තවද සත්‍යයෙන් යුතු ව නුඹලා වෙත පැමිණි දෑ ඔවුහු ප්‍රතික්ෂේප කළෝය. නුඹලාගේ පරමාධිපති වූ අල්ලාහ් ව නුඹලා විශ්වාස කිරීම හේතුවෙන් රසූල්වරයා හා නුඹලා ව ඔවුහු පිටුවහල් කරති. මාගේ මාර්ගයේ කැපවෙමින් ද මාගේ තෘප්තිය බලාපොරොත්තුවෙන් ද නුඹලා පිටත් වූයෙහු නම් ආදරය පෙන්වමින් නුඹලා ඔවුන් වෙත රහසින් සම්බන්ධකම් පාන්නෙහුය. නුඹලා සැඟ වූ දෑ ද නුඹලා හෙළි කළ දෑ ද මා මැනවින් දනිමි. තවද නුඹලා අතරින් කවරෙකු එය සිදු කරන්නේ ද සැබැවින්ම ඔහු ඍජු මාර්ගයෙන් නොමග ගියේය.",
            "verse 60:2": "ඔවුන් නුඹලාව ජයගත්තේ නම් නුඹලාට ඔවුහු සතුරන් වී නපුරකම් කරමින් තම අත් හා තම දිවවල් නුඹලා වෙත දිගු කරනු ඇත. තවද නුඹලා ප්‍රතික්ෂේප කරනු ඇතැයි ඔවුහු අපේක්ෂා කරති.",
            "verse 60:3": "මළවුන් කෙරෙන් නැගිටුවනු ලබන දිනයේ නුඹලාගේ ඥාතීන් හෝ නුඹලාගේ දරුවන් හෝ නුඹලාට ප්‍රයෝජනවත් නොවන්නේමය. (එදින) ඔහු නුඹලා අතර විනිශ්චය කරයි. තවද අල්ලාහ් නුඹලා සිදු කරන දෑ පිළිබඳ ව සර්ව නිරීක්ෂකය.",
            "verse 60:4": "ඉබ්රාහීම් හා ඔහු සමග වූවන් තුළ අලංකාර ආදර්ශයන් සැබැවින්ම නුඹලාට විය. ඔවුහු ඔවුන්ගේ ජනතාවට ‘නියත වශයෙන්ම අපි නුඹලාගෙන් ද අල්ලාහ් හැර දමා නුඹලා නැමදුම් කරන දැයින් ද අපි ඉවත් වූවන් වෙමු. අපි නුඹලා ප්‍රතික්ෂේප කළෙමු. අල්ලාහ් වන ඔහු ව පමණක් නුඹලා විශ්වාස කරන තෙක් අප අතර හා නුඹලා අතර සතුරුකම හා ක්රෝධය ඉස්මතු වී ඇත.’ නමුත් ‘මම ඔබ වෙනුවෙන් සමාව අයැදිමි. අල්ලාහ්ගෙන් කිසිවක් (ලබා දීම) මා සතු නැත’ යැයි ඉබ්රාහීම් තම පියාණන්ට කළ ප්‍රකාශය හැර. (අනිකුත් කරුණුවල ආදර්ශයක් ඇත්තේය. තවද ඉබ්රාහීම්) “අපගේ පරමාධිපතියාණනි! ඔබ වෙත අපි (සියල්ල) භාර කළෙමු. තවද ඔබ වෙතම අපි යොමු වූයෙමු. තවද නැවත යොමු වන ස්ථානය ද ඇත්තේ ඔබ වෙතය;",
            "verse 60:5": "“අපගේ පරමාධිපතියාණනි! ප්‍රතික්ෂේප කළවුනට පරීක්ෂණයක් ලෙස අප පත් නොකරනු මැනව! තවද අපට සමාව දෙනු මැනව! අපගේ පරමාධිපතියාණනි! නියත වශයෙන්ම නුඹ සර්ව බලධාරීය; මහා ප්‍රඥාවන්තය.",
            "verse 60:6": "අල්ලාහ් හා මතු ලොව අපේක්ෂා කරන අයට අලංකාර ආදර්ශයක් සැබැවින්ම ඔවුන් තුළ නුඹලාට විය. තවද කවරෙකු පිටුපාන්නේ ද එවිට නියත වශයෙන්ම අල්ලාහ් වන ඔහු අවශ්යතාවන්ගෙන් තොරය; ප්‍රශංසාලාභීය.",
            "verse 60:7": "නුඹලා අතර හා නුඹලා සමග සතුරුකම ඇති කර ගත්තවුන් අතර සෙනෙහස ඇති කරවීමට අල්ලාහ්ට පුළුවන. තවද අල්ලාහ් සර්ව ශක්තිය ඇත්තාය. තවද අල්ලාහ් අතික්ෂමාශීලීය; මහා කරුණාන්විතය.",
            "verse 60:8": "දහම සම්බන්ධව නුඹලා සමග සටන් නොවැදුනු, තවද නුඹලාගේ නිවෙස් වලින් නුඹලා ව පිටුවහල් නොකළ අය සමග යහ අයුරින් කටයුතු කිරීමටත් ඔවුන් වෙත සාධාරණීය අයුරින් කටයුතු කිරීමටත් අල්ලාහ් නුඹලා නොවැළැක්වීය. යුක්තිගරුක ව කටුයුතු කරන්නන් ව නියත වශයෙන්ම අල්ලාහ් ප්‍රිය කරයි.",
            "verse 60:9": "නියත වශයෙන්ම අල්ලාහ් නුඹලාව වළක්වනුයේ දහම සම්බන්ධව නුඹලා සමග සටන් වැද නුඹලාගේ නිවෙස් වලින් නුඹලා පිටුවහල් කොට නුඹලා ව පිටුවහල් කිරීමට උරදුන් අය සමඟ නුඹලා මිතුරුකම් පෑමය. තවද කවරෙකු ඔවුන් මිතුරන් ලෙස ගන්නේ ද ඔවුහුමය අපරාධකරුවෝ.",
            "verse 60:10": "අහෝ දේවත්වය විශ්වාස කළවුනි! දේවත්වය විශ්වාස කරන කාන්තාවන් (උපන් දේශයෙන්) නික්මවූවන් ලෙස නුඹලා වෙත පැමිණියේ නම් නුඹලා ඔවුන්(ගේ විශ්වාසය) පරීක්ෂා කර බලනු. ඔවුන්ගේ විශ්වාසය පිළිබඳ මැනවින් දන්නා අල්ලාහ්ය. ඔවුන් දේවත්වය විශ්වාස කරන කාන්තාවන් බව නුඹලා හඳුනා ගත්තේ නම් එවිට දේවත්වය ප්‍රතික්ෂේප කරන්නන් වෙත නුඹලා ඔවුන් හරවා නොයවනු. මොවුන් ඔවුනට අනුමත නොවේ. තවද ඔවුහු මොවුනට අනුමත නොවෙති. ඔවුන් වියදම් කළ දෑ ඔවුනට නුඹලා ගෙවනු. මොවුන්ට හිමි විවාහ ත්යාග මුදල නුඹලා මොවුනට පිරිනැමූ විට නුඹලා මොවුන් විවාහ කර ගැනීම නුඹලා කෙරෙහි වරදක් නැත. තවද දේවත්වය ප්‍රතික්ෂේප කරන කාන්තාවන් සමග වූ විවාහ බන්ධනය පවත්වාගෙන නොයනු. නුඹලා ඔවුනට (මහර් වශයෙන්) වියදම් කළ දෑ නුඹලා නැවත ඉල්ලා ගනු. (දේවත්වය ප්‍රතික්ෂේප කරන්නන් වන) ඔවුහු ද ඔවුන් වියදම් කළ දෑ ඉල්ලා ගනිත්වා! එය අල්ලාහ්ගේ තීන්දුවයි. ඔහු නුඹලා අතර තීන්දු දෙයි. තවද අල්ලාහ් සර්ව ඥානීය; මහා ප්‍රඥාවන්තය.",
            "verse 60:11": "තවද, නුඹලාගේ බිරියන් අතරින් කිසිවෙක් (ආගමෙන් ඉවත්ව) නුඹලා හැර දමා දේවත්වය ප්‍රතික්ෂේප කරන්නන් වෙත ගියේ නම් පසුව (යුද්ධයකදී) නුඹලා ජය ගත්තෙහු නම් (නුඹලාගේ) බිරියන් හැර දමා ගිය ඔවුනට ඔවුන් වියදම් කළ හා සමාන දෙයක් ලබා දෙනු. තවද නුඹලා කවර අයකු විශ්වාස කරන්නන් ලෙස සිටින්නනෝ ද එවන් අල්ලාහ්ට බිය බැතිමත් වනු.",
            "verse 60:12": "අහෝ නබිවරය! දේවත්වය විශ්වාස කරන කාන්තාවෝ නුඹට ප්‍රතිඥා දෙන්නට නුඹ වෙත පැමිණ, ඔවුන් අල්ලාහ්ට කිසිවක් ආදේශ නොකරන බවටත්, ඔවුන් සොරකම් නොකරන බවටත්, ඔවුන් කාම අපචාරයේ නිරත නොවන බවටත්, ඔවුන් තම දරුවන් ඝාතනය නොකරන බවටත්, ඔවුන් අතර ගෙතූ කිසිදු අවලාදයක් ඔවුන් නොගෙනන බවටත්, යහපත් කටයුතු වලදී ඔවුන් නුඹට පිටු නොපාන බවටත් ප්‍රතිඥා දුන් විට එය පිළිගනු. තවද නුඹ ඔවුන් වෙනුවෙන් අල්ලාහ්ගෙන් සමාව ඉල්ලනු. නියත වශයෙන්ම අල්ලාහ් අතික්ෂමාශීලීය; මහා කරුණාන්විතය.",
            "verse 60:13": "අහෝ දේවත්වය විශ්වාස කළවුනි! අල්ලාහ් කවුරුන් වෙත කෝප වූයේද එවන් පිරිසක් නුඹලා මිතුරන් කර නොගනු. දේවත්වය ප්‍රතික්ෂේප කරන්නෝ මිනී වළවල් තුළ සිටින්නන් (නැවත නැගිටුවීම) පිළිබඳ බලාපොරොත්තු සුන් කර ගත්තාක් මෙන් මොවුන් (මතුලොව) පිළිබඳ බලාපොරොත්තු සුන් කර ගෙන ඇත."
        },
        "Somali": {
            "verse 60:1": "Kuwa xaqa rumeeyow ha ka dhiganina colka Eebe iyo Colkiina (Gaalada) sokeeye aad jacayl u gudbinaysaan, iyagoo ka gaaloobay xaqa idiin yimid, oo haddana bixiya Rasuulka iyo Muuminiinta inaad Eebe rumeeyseen darteed Jidka Ilaahayna ku dagaallanteen raalli ahaanshaha Eebe idinkoo rabo, kuwaas ood u qarisaan jacayl, Ilaahayna waa ogyahay waxaad qarinaysaan iyo waxaad muujinaysaanba, Ruuxii saas yeelana Jidka xaqa ah wuu ka dhumay.",
            "verse 60:2": "hadday idin helaan (Gaaladu) waxay idiin noqon Col gacmaha iyo Carabkana xumaanbay idiinku taagi waxayna jecel yihiin inaad gaalowdaan.",
            "verse 60:3": "Qaraabada iyo Caruurtu waxba idiin ma taraan Maalinta qiyaame waana laydin kala kaxayn, Ilaahayna waa arkaa waxaad Camal falaysaan.",
            "verse 60:4": "Kuwa xaqa rumeeyey waa inay ku daydaan Nabi Ibraahim iyo kuwii la jiray waa kuwii iska bari yeelay Gaaladii Qoonkoodii ahayd (ay isla noolayeen) iyo waxay Caabudayeen ee Eebe ka soo hadhay oy Colnimo u muujiyeen ilaa ay Eebe kaliya ka rumeeyaan, laakiin Nabi Ibraahim wuxuu u dambi dhaaf weydiiyey Aabihiis, isagoon waxba u hanankarin (intaan laga reebin Arrintaas). Eebe yeynnu talo saaran, isagaan u toobad keenaynaa, isagaana loo noqon (Aakhiro).",
            "verse 60:5": "Eebow hannagu fidnaynin kuwa Gaaloobay, noona dambi dhaaf illeen waxaad tahay adkaade (Casiis) Falsan.",
            "verse 60:6": "Haku daydo dadkaas dayasho wanaagsan ruuxii dooni Ilaahay Maalinta Aakhiro, ciddiise ka jeedsata xaqa Eebe waa ka kaaftoon yahay waana ammaananyahay.",
            "verse 60:7": "Wuxuu Eebe u dhawyahay inuu yeelo jacayl Mu'miniinta iyo kuway la colloobeen ee Gaalada Qureesheed ah dhexdooda, maxaa yeelay Eebe wax walba waa karaa waana dambi dhaaf badane naxariis badane ah.",
            "verse 60:8": "Eebe kama reebayo kuwa xaqa rumeeyey inay u samo iyo Caddaalad falaan kuwa aan Diinta kula dagaallamin Guryahoodana ka bixinin, maxaa yeelay Eebe waa jecel yahay kuwa Caadiliinta ah (Garsoor).",
            "verse 60:9": "Eebe wuxuu ka reebi kuwa xaqa rumeeyey inay ka sokeeye yeeshaan oo xidhiidhiyaan kuwa Diinta kula dagaallamay ee Guryahoodii ka bixiyey gacanna ku siiyey in guryaha laga bixiyo, dadkii kuwaas cokeeye ka dhigtaa wa kuwa daalimiin ah.",
            "verse 60:10": "Kuwa xaqa rumeeyow hadday idiin yimaaddaan Haween Mu'miniin ah oo Gaalada ka soo Hijrooday (ka soo tegay) Imtixaana (inay ka dhabtahay iyo in kale) Eebaa og Iimaankooda, haddaad ogaataan inay xaqa (dhabnimo) u rumeeyeen waa inaydaan Gaalada u celinin, maxaa yeelay Xalaal isuma aha Meherkiina ha u celiyeen Gaalada, inaad isguursataanna waxba kuma jiro haddaad Meher siinaysaan, Haweenka Gaalooba Nikaax isuguma kiin xirna ee ha haysanina, weydiista waxaad Meher u bixiseen Gaaladuna ha weydiisato waxay Meher u bixiyeen, xaaladaasina waa xukunka Eebe uu dhexdiina xukumay, Ilaahayna waa ogyahay (waxa la Camal falo) waana Falsame.",
            "verse 60:11": "Hadday u tagaan kuwa Haweenkiina ka mid ah Gaalada (Gaaloobaan) markaas ka dib la qaniimaysto hala siiyo kuwii Haweenkoodu tageen waxay ku masruufeen oo kale, Ilaaha aad rumaysantihiinna ka dhawrsada.",
            "verse 60:12": "Nabiyow hadday kuu yimaaddaan haween xaqa rumeeyey si ay kuugula ballantamaan inay Eebe kaliya caabudaan, waxna xadin, sinaysanna, Caruurtoodana dilin, been abuurna ayan la imaan, wax wanaag ah oo la farayna ayan Nabiga ku caasiyin la ballantan una dambi dhaaf weydii Eebe waa dambi dhaafe naxariiste ahe.",
            "verse 60:13": "Kuwa xaqa rumeeyow haka sokeeye dhiganina kuwa Eebe u carooday oo aakhirana ka quustay (waa Gaaloodhane) sida Gaaladu uga quusatay kuwii dhintay."
        },
        "Spanish": {
            "verse 60:1": "Vosotros que creéis! No toméis por amigos aliados a los que son enemigos Míos y vuestros -les dais muestras de afecto cuando ellos se han negado a creer en la verdad que os ha llegado y han expulsado al Mensajero y os han expulsado a vosotros porque creíais en Allah vuestro Señor- si habéis salido a luchar en Mi camino buscando Mi beneplácito. Les confiáis secretos por amistad; pero Yo sé lo que escondéis y lo que mostráis. El que de vosotros lo haga, se habrá extraviado del camino llano.",
            "verse 60:2": "Si os alcanzan, serán vuestros enemigos y alargarán hacia vosotros sus manos para haceros mal. Querrían que dejarais de creer.",
            "verse 60:3": "Ni vuestra consanguinidad ni vuestros hijos os servirán el Día del Levantamiento. Cada uno de vosotros tendrá el juicio que le corresponda. Allah ve lo que hacéis.",
            "verse 60:4": "En Ibrahim y en los que con él estaban tenéis un hermoso ejemplo, cuando le dijeron a su gente: No respondemos de vosotros y de lo que adoráis fuera de Allah, sino que renegamos de vosotros.La enemistad y el odio habrán surgido entre nosotros para siempre a menos que creáis en Allah y en nadie más.Sin embargo lbrahim le dijo a su padre: Pediré perdón por ti, pero no puedo hacer nada en tu favor ante Allah.Señor nuestro! A Ti nos confiamos, a Ti nos volvemos y a Ti hemos de retornar.",
            "verse 60:5": "Señor nuestro! No pongas a prueba a los que se niegan a creer dándoles poder sobre nosotros y perdónanos Señor.Realmente Tú eres el Poderoso, el Sabio.",
            "verse 60:6": "En ellos tenéis un hermoso ejemplo para quien tenga esperanza en Allah y en el Último Día.Pero el que se desentienda...Allah es Rico, en Sí mismo alabado.",
            "verse 60:7": "Puede ser que Allah ponga afecto entre vosotros y los que de ellos hayáis tenido como enemigos.Allah es Poderoso y Allah es Perdonador y Compasivo.",
            "verse 60:8": "Allah no os prohibe que tratéis bien y con justicia a los que no os hayan combatido a causa de vuestra creencia ni os hayan hecho abandonar vuestros hogares. Es cierto que Allah ama a los equitativos.",
            "verse 60:9": "Allah sólo os prohibe que toméis por amigos aliados a los que os hayan combatido a causa de vuestra creencia, os hayan hecho abandonar vuestros hogares o hayan colaborado en vuestra expulsión.Quien los tome como amigos...Esos son los injustos.",
            "verse 60:10": "Vosotros que creéis! Cuando vengan a vosotros las creyentes después de haber emigrado, comprobad su situación; Allah conoce su creencia, de manera que si verificáis que son creyentes no las devolváis a los incrédulos.Ellas no son lícitas para ellos ni ellos lo son para ellas.Dadles a ellos lo que gastaron y no hay impedimento en que os caséis con ellas, siempre que les hagáis entrega de una dote.No mantengáis los lazos conyugales con las no creyentes. Pedid lo que hayáis gastado y que ellos pidan lo que hayan gastado. Este es el juicio que Allah decide entre vosotros. Allah es Conocedor y Sabio.",
            "verse 60:11": "Y si alguna de vuestras esposas huye hacia los incrédulos y conseguís algún botín, dadles a aquéllos cuyas esposas se marcharon algo similar a lo que gastaron (en sus dotes).Y temed a Allah en Quien creéis.",
            "verse 60:12": "Profeta! Cuando vengan a ti las creyentes para jurarte fidelidad en los términos de no asociar nada a Allah, no robar, no cometer adulterio, no matar a sus hijos, no inventar ninguna falsedad sobre su situación y no desobedecerte en nada de lo reconocido como bueno, acéptales el juramento y pide perdón por ellas.Es cierto que Allah es Perdonador, Compasivo.",
            "verse 60:13": "Vosotros que creéis! No toméis por amigos aliados a gente con la que Allah se ha enojado.Ellos han desesperado de la Última Vida al igual que los incrédulos no esperan nada con respecto a los que están en las tumbas."
        },
        "Swahili": {
            "verse 60:1": "Enyi mlio amini! Msiwafanye adui zangu na adui zenu kuwa marafiki mkiwapa mapenzi, na hali wao wamekwisha ikataa haki iliyo kujieni, wakamfukuza Mtume na nyinyi kwa sababu mnamuamini Mwenyezi Mungu, Mola Mlezi wenu. Mnapotoka kwa ajili ya Jihadi katika Njia yangu na kutafuta radhi yangu, mnafanya urafiki nao kwa siri, na Mimi nayajua mnayo yaficha na mnayo dhihirisha. Na mwenye kufanya hayo kati yenu basi ameipotea njia ya sawa.",
            "verse 60:2": "Wakikuwezeni wanakuwa maadui zenu, na wanakukunjulieni mikono yao na ndimi zao kwa uovu. Na wanapenda muwe makafiri.",
            "verse 60:3": "Hawatakufaeni jamaa zenu, wala watoto wenu Siku ya Kiyama. Mwenyezi Mungu atapambanua baina yenu, na Mwenyezi Mungu anayaona mnayo yatenda.",
            "verse 60:4": "Hakika nyinyi mna mfano mzuri kwenu kwa Ibrahim na wale walio kuwa pamoja naye, walipo waambia watu wao: Hakika sisi tumejitenga nanyi na hayo mnayo yaabudu badala ya Mwenyezi Mungu. Tunakukataeni; na umekwisha dhihiri uadui na chuki baina yetu na nyinyi mpaka mtakapo muamini Mwenyezi Mungu peke yake. Isipo kuwa kauli ya Ibrahim kumwambia baba yake: Hakika nitakuombea msamaha, wala similiki chochote kwa ajili yako mbele ya Mwenyezi Mungu. Mola wetu Mlezi! Juu yako tumetegemea, na kwako tumeelekea, na kwako ndio marejeo.",
            "verse 60:5": "Mola wetu Mlezi! Usitufanyie mtihani kwa walio kufuru. Na tusamehe, Mola wetu Mlezi. Hakika Wewe ndiye Mwenye nguvu, Mwenye hikima.",
            "verse 60:6": "Kwa yakini umekuwa mfano mzuri kwenu katika mwendo wao, kwa anaye mtarajia Mwenyezi Mungu na Siku ya Mwisho. Na mwenye kugeuka basi hakika Mwnyezi Mungu ni Mwenye kujitosha, Msifiwa.",
            "verse 60:7": "Asaa Mwenyezi Mungu akatia mapenzi baina yenu na hao maadui zenu, na Mwenyezi Mungu ni Mweza, na Mwenyezi Mungu ni Mwenye kusamehe, Mwenye kurehemu.",
            "verse 60:8": "Mwenyezi Mungu hakukatazini kuwafanyia wema na uadilifu wale ambao hawakukupigeni vita, wala hawakukutoeni makwenu. Hakika Mwenyezi Mungu huwapenda wafanyao uadilifu.",
            "verse 60:9": "Hakika Mwenyezi Mungu anakukatazeni kufanya urafiki na wale walio kupigeni vita, na wakakutoeni makwenu, na wakasaidia katika kufukuzwa kwenu. Na wanao wafanya hao marafiki basi hao ndio madhaalimu.",
            "verse 60:10": "Enyi mlio amini! Wakikujilieni wanawake Waumini walio hama, basi wafanyieni mtihani - Mwenyezi Mungu ndiye Mwenye kujua zaidi Imani yao. Mkiwa mnawajua kuwa ni Waumini basi msiwarudishe kwa makafiri. Wanawake hao si halali kwa hao makafiri, wala hao makafiri hawahalalikii wanawake Waumini. Na wapeni hao wanaume mahari walio toa. Wala hapana makosa kwenu kuwaoa mkiwapa mahari yao. Wala msiwaweke wanawake makafiri katika kifungo cha ndoa zenu. Na takeni mlicho kitoa, na wao watake walicho kitoa. Hiyo ndiyo hukumu ya Mwenyezi Mungu anayo kuhukumuni. Na Mwenyezi Mungu ni Mwenye kujua, Mwenye hikima.",
            "verse 60:11": "Na akitoroka yeyote katika wake zenu kwenda kwa makafiri, tena ikatokea mkapata ngawira, basi wapeni walio kimbiwa na wake zao kiasi cha mahari waliyo yatoa. Na mcheni Mwenyezi Mungu ambaye mnamuamini.",
            "verse 60:12": "Ewe Nabii! Watakapo kujia wanawake Waumini wanakuahidi ya kwamba hawatamshirikisha Mwenyezi Mungu na chochote, wala hawataiba, wala hawatazini, wala hawatawauwa watoto wao, wala hawataleta uzushi wanao uzua tu wenyewe baina ya mikono yao na miguu yao, wala hawatakuasi katika jambo jema, basi peana nao ahadi, na uwatakie maghfira kwa Mwenyezi Mungu. Hakika Mwenyezi Mungu ni Mwingi maghfira, Mwenye kurehemu.",
            "verse 60:13": "Enyi mlio amini! Msiwafanye rafiki zenu watu ambao Mwenyezi Mungu amewakasirikia. Hao wamekwisha kata tamaa ya Akhera, kama makafiri walivyo wakatia tamaa watu wa makaburini."
        },
        "Swedish": {
            "verse 60:1": "TROENDE! Tag inte Mina fiender - de är också era fiender - till bundsförvanter som ni skänker vänskap och tillgivenhet, [människor som] har avvisat den sanning som ni har fått del av, och som har jagat bort Sändebudet och er [själva från era hem] på grund av er tro på Gud, er Herre! Om ni har valt att kämpa för Min sak och strävar efter [att vinna] Mitt välbehag, [tag dem då inte till vänner] som ni i hemlighet visar tillgivenhet. Jag har full kännedom om det som ni vill dölja liksom om det som ni gör öppet. De bland er som handlar så har avvikit från den raka vägen.",
            "verse 60:2": "Om de fick ta befälet över er skulle de öppet visa er sin fiendskap och lyfta sina händer mot er och låta sina tungor löpa i onda avsikter; ja, de skulle vilja att [också] ni förnekade sanningen.",
            "verse 60:3": "Varken era anförvanter eller era söner skall vara er till hjälp på Uppståndelsens dag, då [Gud] skall döma mellan er. Gud ser vad ni gör.",
            "verse 60:4": "Ett gott föredöme har ni i Abraham och de som följde honom, när de sade till sina landsmän: \"Vi är inte ansvariga för er och för det som ni dyrkar i Guds ställe och vi tar avstånd från er. Fiendskap och hat skall råda mellan oss och er ända till dess ni tror på den Ende Guden.\" [Men tag] inte [exempel av] Abraham när han sade till sin fader: \"Jag lovar att be [Gud] ge dig Sin förlåtelse; men jag kan inte av Gud utverka någon [lindring i ditt straff].\" [Abraham och de som följde honom bad:] \"Herre! Till Dig sätter vi vår lit, till Dig vänder vi oss i ånger [över våra synder] och Du är målet för vår färd!",
            "verse 60:5": "Herre! Gör oss inte till [Ditt redskap när] Du vill sätta förnekarna av sanningen på prov! Och Herre! Förlåt oss [våra synder]! Du är den Allsmäktige, den Vise!\"",
            "verse 60:6": "I dem har ni ett gott föredöme, [ett föredöme] för den som ser fram mot [mötet med] Gud och den Yttersta dagen med hopp [och fruktan]. Och den som vänder ryggen [åt Gud bör tänka på att] Gud är Den som är Sig själv nog, Den som allt lov och pris tillkommer.",
            "verse 60:7": "Kanske skall Gud i Sin allmakt låta vänskap uppstå mellan er och dem som ni nu ser som era fiender; Gud är ständigt förlåtande, barmhärtig.",
            "verse 60:8": "Gud förbjuder er inte att visa godhet mot dem som inte bekämpar er på grund av [er] tro och inte driver ut er ur era hem, och [Han förbjuder er inte] att bemöta dem med rättvisa och opartiskhet - Gud älskar de opartiska.",
            "verse 60:9": "Det är inga andra än de som bekämpar er på grund av [er] tro och som vill driva bort er från era hem eller hjälper [dem som vill] driva bort er, vilkas skydd och vänskap Gud förbjuder er att söka. De som söker deras vänskap och skydd har begått orätt mot sig själva!",
            "verse 60:10": "TROENDE! När troende kvinnor som har utvandrat kommer till er, förhör dem! Ingen utom Gud känner deras tro, men om ni har övertygat er om att de är troende, sänd då inte tillbaka dem till förnekarna av sanningen; deras män har inte [längre] rätt att leva med dem och de har inte rätt att leva med sina män. Men ge tillbaka till männen vad [brudgåvan] har kostat dem. Och ni begår ingen synd om ni sedan tar dem till hustrur efter att ha gett dem deras brudgåva. Håll inte fast vid det äktenskapliga bandet med kvinnor som förnekar sanningen; begär att få tillbaka det som ni har gett [dem som brudgåva], och låt dem [vars hustrur går över till er] begära tillbaka det som de har gett ut [för sina hustrur]. Detta är Guds dom; Han dömer [rättvist] mellan er [och de icke-troende]. Gud är allvetande, vis.",
            "verse 60:11": "Och om [ni lider en förlust genom att] hustrun till någon av de troende lämnar honom och återgår till förnekarna och ni kan göra en motsvarande vinst, ge då den vars hustru övergett honom motvärdet till vad han gett [henne i brudgåva] och frukta Gud, som ni tror på!",
            "verse 60:12": "Profet! När troende kvinnor kommer till dig för att avlägga trohetsed - [och lovar] att inte sätta något, vad det än är, vid Guds sida, att inte stjäla, att inte begå äktenskapsbrott, att inte döda sina egna barn, att inte sprida förtal som de själva diktat upp och att aldrig vägra dig lydnad i det som är rätt och rimligt - tag då emot deras trohetsed och be Gud förlåta dem deras synder; Gud är ständigt förlåtande, barmhärtig.",
            "verse 60:13": "TROENDE! Sök inte vänskap och skydd hos dem som har drabbats av Guds vrede! De hoppas inte på det eviga livet, liksom de som [helt] förnekar sanningen inte hoppas [få återse] dem som [de har följt till graven]."
        },
        "Tajik": {
            "verse 60:1": "Эй касоне, ки имон овардаед, душмани Ману душмани худро ба дӯстӣ ихтиёр накунед. Шумо бо онон пайғоми дӯстӣ меафканед ва ҳол он ки онҳо ба сухани ҳаққе, ки бар шумо омададст, имон надоранд. Ва ба он сабаб, ки ба Худо — Парвардигори худ имон оварда будед, паёмбар ва шуморо берун ронданд. Агар барои ҷиҳод дар роҳи Ман ва талаби ризои Ман берун омадаед, дар ниҳон бо онҳо дӯстӣ накунед ва Ман ба ҳар чӣ пинҳон медоред ё ошкор месозед, огоҳтарам. Ва ҳар кӣ чунин кунад, аз роҳи рост гумроҳ гаштааст.",
            "verse 60:2": "Агар бар шумо даст ёбанд, душманӣ мекунанд ва ба озоратон дасту зйбон мекушоянд ва дӯст доранд ки шумо низ кофир гардед.",
            "verse 60:3": "Дар рӯзи қиёмат на хешовандон бароятои нафъ кунанд, на фарзандонатон. Худо миёнатон ҷудои меандозад ва амалҳоятонро мебинад.",
            "verse 60:4": "Иброҳим ва касоне, ки бо вай буданд, он гоҳ ки ба қавми худ гуфтанд, ки мо аз шумо ва аз он чӣ ҷуз Худои якто мепарастед, безорем ва шуморо кофир мешуморем ва миёни мову шумо ҳамеша душманиву бадбинӣ хоҳад буд, то вақте ки ба Худои якто имон биёваред, бароятон некӯ муқтадое (пешвое) буданд. Магар он гоҳ ки Иброҳим падарашро гуфт, ки барои ту бахшоиш металабам, зеро наметавонам азоби Худоро аз ту дафъ кунам. Эй Парвардигори мо, бар Ту таваккал кардем ва ба Ту рӯй овардем ва ба сӯи туст бозгашт!",
            "verse 60:5": "Эй Парвардигори мо, моро чунон макун, ки кофирон хор дорандамон. Ва моро бибахшо, ки Ту ғолибу ҳакимӣ!",
            "verse 60:6": "Онҳо некӯ муқтадое (пешвое) ҳастанд барои шумо — барои касоне, ки ба Худову рӯзи қиёмат умед доранд. Ва ҳар кӣ рӯйгардон шавад. Худо беэҳтиёҷу соҳиби шукр аст!",
            "verse 60:7": "Шояд Худо миёни шумову касоне, ки бо онҳо душманӣ мекунед, дӯстӣ падид оварад. Худо қодир аст ва Худо бахшояндаву меҳрубон аст.",
            "verse 60:8": "Худо шуморо аз некӣ кардан ва адолат намудан бо онон, ки бо шумо дар дин наҷангидаанд ва аз сарзаминатон берун нарондаанд, бознамедорад. Худо касонеро, ки ба адолат рафтор. мекунанд, дӯст дорад.",
            "verse 60:9": "Фақат Худо аз дӯстӣ кардан бо касоне, ки бо шумо дар дин ҷангидаанд ва аз сарзамини худ берунатон рондаанд ё дар берун ронданатон ҳамдастӣ кардаанд, шуморо манъ мекунад. Ва ҳар кӣ бо онҳо дӯстӣ кунад, аз ситамкорон хоҳад буд.",
            "verse 60:10": "Эй касоне, ки имон овардаед, чун занони мӯъмине, ки муҳоҷират (тарки Ватан) кардаанд, ба наздатон оянд, онҳоро бисанҷед. Худо ба имонашон донотар аст. Пас агар донистед, ки имон овардаанд, назди кофирон бозашон нагардонед. Зеро инҳо бар мардони кофир ҳалол нестанд ва мардони кофир низ бар онҳо ҳалол нестанд. Ва ҳар чӣ он кофирон барои ин гуна занон нафақа кардаанд, бипардозед. Ва агар онҳоро никоҳ кунед ва маҳрашонро бидиҳед, гуноҳе накардаед. Ва занони кофири худро нигоҳ надоред. Ва ҳар чӣ нафақа кардаед, аз мардони кофир бихоҳед ва онҳо низ ҳар чӣ хазина (нафақа) кардаанд, аз шумо бихоҳанд. Ин ҳукми Худост. Худо миёни шумо ҳукм мекунад, ва Ӯ донову ҳаким аст!",
            "verse 60:11": "Ва агар яке аз занони шумо ба кофирон пайваст ва он гоҳ ба интиқом аз кофирон бархостед, ба касоне, ки занонашон рафтаанд, ба миқдори нафақае, ки кардаанд, бипардозед ва аз Худое, ки ба Ӯ имон овардаед, битарсед!",
            "verse 60:12": "Эй паёмбар, агар занони мӯъмин назди ту омаданд, то баъат (аҳду паймон) кунанд, ба ин шарт, ки ҳеҷ касро бо Худо шарик накунанд ва дуздӣ накунанд ва зино накунанд ва фарзандони худро накушанд ва фарзандеро, ки аз они шавҳарашон нест, ба дурӯғ ба ӯ нисбат надиҳанд ва дар корҳои нек нофармонии ту накунанд, бо онҳо байъат кун ва барояшон аз Худо бахшоиш бихоҳ, ки Худо бахшояндаву меҳрубон аст!",
            "verse 60:13": "Эй каооне, ки имон овардаед, бо мардуме, ки Худо бар онҳо хашм гирифтааст, дӯстӣ макунед. Инҳо аз охират ноумеданд, ҳамчунон ки он кофироне, ки инак дар гӯранд, аз охират ноумеданд."
        },
        "Tamil": {
            "verse 60:1": "ஈமான் கொண்டவர்களே! எனக்கு விரோதியாகவும், உங்களுக்கு விரோதியாகவும் இருப்பவர்களைப் பிரியத்தின் காரணத்தால் இரகசியச் செய்திகளை எடுத்துக்காட்டும் உற்ற நண்பர்களாக்கிக் கொள்ளாதீர்கள்; (ஏனெனில்) உங்களிடம் வந்துள்ள சத்திய (வேத)த்தை அவர்கள் நிராகரிக்கிறார்கள், நீங்கள் உங்கள் இறைவனான அல்லாஹ்வின் மீது ஈமான் கொண்டதற்காக, இத்தூதரையும், உங்களையும் வெளியேற்றுகிறார்கள், என் பாதையில் போரிடுவதற்காகவும், என் பொருத்தத்தை நாடியும் நீங்கள் புறப்பட்டிருந்தால் (அவர்களை நண்பர்களாக்கிக் கொள்ளாதீர்; கள், அப்போது) நீங்கள் பிரியத்தால் அவர்களிடத்தில் இரகசியத்தை வெளிப்படுத்தி விடுகிறீர்கள், ஆனால், நீங்கள் மறைத்துவைப்பதையும், நீங்கள் வெளிப்படுத்துவதையும் நான் நன்கு அறிந்தவன். மேலும், உங்களிலிருந்தும் எவர் இதைச் செய்கிறாரோ அவர் நேர்வழியை திட்டமாக தவற விட்டுவிட்டார்.",
            "verse 60:2": "அவர்களுக்கு உங்கள் மீது வாய்ப்பு கிடைத்தால், அவர்கள் உங்களுக்கு விரோதிகளாகித் தம் கைகளையும், தம் நாவுகளையும் உங்களுக்குத் தீங்கிழைப்பதற்காக உங்கள்பால் நீட்டுவார்கள், தவிர, நீங்களும் காஃபிர்களாக வேண்டும் என்று பிரியப்படுவார்கள்.",
            "verse 60:3": "உங்கள் உறவினரும், உங்கள் மக்களும் கியாம நாளில் உங்களுக்கு எப்பயனும் அளிக்க மாட்டார்கள்; (அந்நாளில் அல்லாஹ்) உங்களிடையே தீர்ப்பளிப்பான், அன்றியும் நீங்கள் செய்பவற்றை அல்லாஹ் உற்று நோக்கியவனாகவே இருக்கின்றான்.",
            "verse 60:4": "இப்றாஹீமிடமும், அவரோடு இருந்தவர்களிடமும், நிச்சயமாக உங்களுக்கு ஓர் அழகிய முன்மாதிரி இருக்கிறது, தம் சமூகத்தாரிடம் அவர்கள், \"உங்களை விட்டும், இன்னும் அல்லாஹ்வையன்றி நீங்கள் வணங்குகிறவற்றைவிட்டும், நாங்கள் நிச்சயமாக நீங்கிக் கொண்டோம்; உங்களையும் நாங்கள் நிராகரித்து விட்டோம், அன்றியும் ஏகனான அல்லாஹ் ஒருவன் மீதே நீங்கள் நம்பிக்கை கொள்ளும் வரை, நமக்கும் உங்களுக்குமிடையில் பகைமையும், வெறுப்பும் நிரந்தரமாக ஏற்பட்டு விட்டன\" என்றார்கள். ஆனால் இப்றாஹீம் தம் தந்தையை நோக்கி, \"அல்லாஹ்விடத்தில் உங்களுக்காக (அவனுடைய வேதனையிலிருந்து) எதையும் தடுக்க எனக்குச் சக்தி கிடையாது, ஆயினும் உங்களுக்காக நான் அவனிடத்தில் நிச்சயமாக மன்னிப்புத் தேடுவேன்\" எனக் கூறியதைத் தவிர (மற்ற எல்லாவற்றிலும் முன் மாதிரியிருக்கிறது, அன்றியும், அவர் கூறினார்); \"எங்கள் இறைவா! உன்னையே முற்றிலும் சார்ந்திருக்கிறோம்; (எதற்கும்) நாங்கள் உன்னையே நோக்ககிறோம் மேலும், உன்னிடமே எங்கள் மீளுதலும் இருக்கிறது,\"",
            "verse 60:5": "\"எங்கள் இறைவா! காஃபிர்களுக்கு, எங்களைச் சோதனை(ப் பொருள்) ஆக ஆக்கிவிடாதே! எங்கள் இறைவா! எங்களுக்கு மன்னிப்பும் அருள்வாயாக! நிச்சயமாக நீ (யாவரையும்) மிகைத்தவன் ஞானம் மிக்கவன்\" (என்றும் வேண்டினார்).",
            "verse 60:6": "உங்களில் எவர் அல்லாஹ்வையும் இறுதி நாளையும், நம்புகிறார்களோ. அவர்களுக்கு திடமாக இவர்களில் ஓர் அழகிய முன்மாதிரியிருக்கிறது, ஆனால், எவர் (இந்நம்பிக்கையிலிருந்து) பின் வாங்குகிறாரோ, (அது அவருக்கு இழப்புதான், ஏனெனில், எவரிடமிருந்தும்) அல்லாஹ் நிச்சயமாக எந்தத் தேவையுமில்லாதவன், புகழ் மிக்கவன்.",
            "verse 60:7": "உங்களுக்கும், அவர்களில் நின்றும் நீங்கள் விரோதித்திருக்கின்றீர்களே அவர்களுக்குமிடையே அல்லாஹ் பிரியத்தை உண்டாக்கி விடக்கூடும், மேலும், அல்லாஹ் பேராற்றலுடையவன்; அல்லாஹ் மிகவும் மன்னிப்வன்; மிக்க கிருபையுடையவன்.",
            "verse 60:8": "மார்க்க (விஷய)த்தில் உங்களிடம் போரிடாமலும், உங்கள் இல்லங்களிலிருந்து உங்களை வெளியேற்றாமலும் இருந்தார்களே அவர்களுக்கு நீங்கள் நன்மை செய்வதையும், அவர்களுக்கு நீங்கள் நீதி செய்வதையும் அல்லாஹ் விலக்க வில்லை - நிச்சயமாக அல்லாஹ் நீதி செய்பவர்களை நேசிக்கிறான்.",
            "verse 60:9": "நிச்சயமாக அல்லாஹ் உங்களை விலக்குவதெல்லாம் மார்க்க விஷயத்தில் உங்களிடம் போர் செய்து உங்களை உங்கள் இல்லங்களை விட்டும் வெளியேற்றி, நீங்கள் வெளியேற்றப்படுவதற்கு உதவியும் செய்தார்களே, அத்தகையவர்களை நீங்கள் நேசர்களாக ஆக்கிக் கொள்வதைத் தான் - எனவே, எவர்கள் அவர்களை நேசர்களாக்கிக் கொள்கிறார்களோ அவர்கள்தாம் அநியாயம் செய்பவர்கள்.",
            "verse 60:10": "ஈமான் கொண்டவர்களே! முஃமினான பெண்கள் ஹிஜ்ரத் செய்து (நாடு துறந்தவர்களாக) உங்களிடம் வந்தால், அவர்களை நீங்கள் பரிசோதித்துக் கொள்ளுங்கள், அல்லாஹ் அவர்கள் ஈமானை நன்கறிந்தவன், எனவே அவர்கள் முஃமினான (பெண்கள்) என நீங்கள் அறிந்தால், காஃபிர்களிடம் அவர்களைத் திருப்பியனுப்பி விடாதீர்கள், ஏனெனில், அந்த பெண்கள் அந்த ஆண்களுக்கு அனுமதிக்கப்பட்டவர்களில்லை. அந்த ஆண்கள் இந்தப் பெண்களுக்கு அனுமதிக்கப்பட்டவர்களில்லை. (ஆனால், இப் பெண்களுக்காக) அவர்கள் செலவு செய்திருந்ததை அவர்களுக்குக் கொடுத்து விடுங்கள், அன்றியும் நீங்கள் அப்பெண்களுக்குரிய மஹரை கொடுத்து அவர்களை விவாகம் செய்து கொள்வது உங்கள் மீது குற்றமில்லை, மேலும் நிராகரித்துக் கொண்டிருக்கும் பெண்களின் விவாக பந்தத்தை நீங்கள் பற்றிப்பிடித்துக் கொள்ள வேண்டாம், அன்றியும், நீங்கள் செலவு செய்திருந்ததை (அவர்கள் போய்ச் சேருவோரிடம்) கேளுங்கள், (அவ்வாறே ஈமான் கொண்டு உங்களிடம் வந்து விட்டோருக்காகத்) தாங்கள் செலவு செய்ததை அவர்கள் (உங்களிடம்) கேட்கலாம் - இதுவே அல்லாஹ்வுடைய கட்டளையாகும், உங்களிடையே அவன் (இவ்வாறே) தீர்ப்பு வழங்குகிறான் - மேலும், அல்லாஹ் நன்கறிந்தவன்; ஞானம் மிக்கவன்.",
            "verse 60:11": "மேலும் உங்கள் மனைவியரிலிருந்து எவரேனும் உங்களைவிட்டுத் தப்பி, காஃபிர்களிடம் சென்ற பின்னர், நீங்கள் போர்ப்பொருள்களை அடைந்தால், எவர்கள் மனைவியர் சென்று விட்டனரோ, அவர்களுக்கு அவர்கள் செலவு செய்தது போன்றதை நீங்கள் கொடுங்கள், அன்றியும், நீங்கள் எவன் மீது நம்பிக்கை கொண்டு முஃமின்களாக இருக்கிறீர்களோ அந்த அல்லாஹ்வுக்கு அஞ்சி நடந்து கொள்ளுங்கள்.",
            "verse 60:12": "நபியே! முஃமினான பெண்கள் உங்களிடம் வந்து, அல்லாஹ்வுக்கு எப்பொருளையும் இணைவைப்பதில்லையென்றும், திருடுவதில்லை என்றும், விபச்சாரம் செய்வதில்லை என்றும், தங்கள் பிள்ளைகளை கொல்வதில்லை என்றும், தங்கள் கைகளுக்கும், தங்கள் கால்களுக்கும் இடையில் எதனை அவர்கள் கற்பனை செய்கிறார்களோ, அத்தகைய அவதூறை இட்டுக்கட்டிக் கொண்டு வருவதில்லை என்றும், மேலும் நன்மையான (காரியத்)தில் உமக்கு மாறு செய்வதில்லையென்றும், அவர்கள் உம்மிடம் பைஅத்து - வாக்குறுதி செய்தால் அவர்களுடைய வாக்குறுதியை ஏற்றுக் கொள்வீராக, மேலும் அவர்களுக்காக அல்லாஹ்விடம் மன்னிப்புத் தேடுவீராக, நிச்சயமாக அல்லாஹ் மிகவும் மன்னிப்பவன், மிக்க கிருபையுடையவன்.",
            "verse 60:13": "ஈமான் கொண்டவர்களே! அல்லாஹ் எவர்கள் மீது கோபம் கொண்டிருக்கிறானோ, அந்தச் சமூகத்தாருடன் நேசம் சொள்ளாதீர்கள், ஏனெனில் மண்ணறை வாசிகளைப் பற்றி (எழுப்பப்பட மாட்டார்கள் என்று) நிராகரிப்போர் நம்பிக்கை இழந்தது போல், மறுமையைப் பற்றி, நிச்சயமாக இவர்களும் நம்பிக்கை இழந்து விட்டனர்."
        },
        "Tatar": {
            "verse 60:1": "Ий мөэминнәр, Минем дошманым вә сезнең дошманыгыз булган кәферләрне дус тотмагыз, ул кәферләрне яшерен дус тотсагыз вә дуслык сәбәбле пәйгамбәрнең эшеннән аларга хәбәр җибәрәсез, (Мухәммәд г-м Мәккәне алырга хәзерләнә башлагач, Хатыйб исемле монафикъ, пәйгамбәрнең ґәскәр белән Мәккәгә барачагын белдереп Сара исемле хатын артыннан Мәккә кәферләренә хат язып җибәрде. Аллаһу тәгалә Хатыйбның эшен пәйгамбәргә белдерде. Пәйгамбәрнең әмере белән берничә сахабә Сараның артыннан барып хатны алып кайттылар. Хатыйб исә гозер күрсәтеп маташты, Ґүмәр разыйяллаһу ґәнһү кылычы белән Хатыйбның башын кисәргә теләгән иде, ләкин пәйгамбәр рөхсәт бирмәде, бәлки Аллаһу гафу итәр дип). Тәхкыйк ул Мәккә кәферләре сезгә Раббыгыздан килгән хак булган Коръәнне инкяр иттеләр, расүлне вә сезне Мәккәдән чыгардылар, фәкать Аллаһуга иман китергәнегез өчен, әгәр сез Минем юлыма җиһад өчен һәм ризалыгымны эстәп чыксагыз, кәферләргә яшерен дуслык кыласыз. Мин сезнең яшергән нәрсәгезне дә һәм әшкәрә кылган эшләрегезне дә белүчерәкмен. Сездән берәрегез яшерен кәферләргә дус булса, яки мөселманнарның серен кәферләргә ирештерсә, дөреслектә ул кеше туры юлдан адашты, ягъни имансыз калды.",
            "verse 60:2": "Әгәр ул кәферләр куәт тапсалар, сезне җиңсәләр, сезгә дошман булырлар, сезне үтерергә кулларын сузарлар вә мәсхәрә кылу өчен сезгә телләрен озайтырлар һәм сезнең кәфер булуыгызны сөярләр. Ягъни сез аларга дус булырга тырышсагыз да алар сезгә чын күңелдән дус булмаслар.",
            "verse 60:3": "Әгәр кәферләргә дус булсагыз, кыямәт көнне Аллаһ ґәзабыннан котылырга якын кардәшләрегез һәм балаларыгыз файда бирмәс. Аллаһ кыямәт көнне сезнең белән кәферләр арасын аерыр, монафикълар кәферләр ягында булырлар. Бит Аллаһ сезнең кылган эшләрегезне күрүчедер.",
            "verse 60:4": "Тәхкыйк сезгә яхшы үрнәк булды Ибраһим пәйгамбәрдә вә аңа ияргән мөэминнәрдә. Алар үзләренең кавемнәренә әйттеләр: \"Тәхкыйк без сездән һәм Аллаһудан башка сез гыйбадәт кыла торган сынымнарыгыздан бизүчебез вә без сезнең батыл динегезне инкяр иттек, вә безнең илә сезнең арада мәңгегә дошманлык һәм ачу заһир булды, хәтта Аллаһуның Үзенә генә иман китергәнегезгәчә. Мәгәр Ибраһимнең атасына әйткән сүзенә иярергә түгел, ул атасына әйтте: \"Әлбәттә, синең өчен Аллаһудан гафу сорармын, әгәр кәфер булсаң, Аллаһ ґәзабыннан сине коткарырга һичнәрсәгә кадир түгелмен\", – дип. Ий Раббыбыз, без сиңа тәвәккәл кылдык һәм тәүбә вә итагать белми Сиңа кайттык вә ахырда кайтмак Синең хозурыңадыр.",
            "verse 60:5": "Ий Раббыбыз, безләрне кәферләр кулына фетнә кылма, ягъни алар кулында мазлум булудан безне сакла вә безне ярлыка, ий Раббыбыз! Тәхкыйк Син куәтле, һәр эштә өстенсең вә хикмәт белән эш кылучысың.",
            "verse 60:6": "Тәхкыйк Ибраһимдә вә аңа ияргән мөэминнәрдә иярергә тиешле булган яхшы үрнәк вә туры юл бардыр Аллаһуның рәхмәтен вә ахирәтнең матур тормышын өмет иткән кешегә. Бер кеше пәйгамбәрләр юлы булган Коръәннән йөз чөерсә, Коръән юлын ташлап башка юлга китсә, тәхкыйк Ул – Аллаһ бай, һичкемгә ихтыяҗы юк вә һәр эштә мактаулыдыр.",
            "verse 60:7": "Ихтимал, Аллаһ мөшрикләрдән дошман булган якын кардәшләрегез белән сезнең арагызда дуслыкны булдырыр. Ягъни Мәккә мөшрикләре иман китереп мөселман булырлар да, сезгә яңадан кардәш вә дус булырлар. Шулай булдылар да, Мәккә фәтех ителгәч, күп мөшрикләр иман китереп мөселман булдылар. Аллаһ кадирдер, бу эшкә көче җитәдер, һәм Аллаһ ярлыкаучы вә рәхимле.",
            "verse 60:8": "Аллаһ сезне тыймыйдыр ислам диненә каршы сезнең белән сугыш кылмаган вә сезне йортларыгыздан куып чыгармаган кавемнәр белән яхшы мөгамәләдә булудан һәм аларга гаделлек кылудан. Тәхкыйк Аллаһ гадел кешеләрне сөядер.",
            "verse 60:9": "Аллаһ, әлбәттә, сезне тыядыр ислам диненә каршы сезнең белән сугышкан вә сезне йортыгыздан куалап чыгарган һәм кәферләргә дус булып сезне йортыгыздан чыгарырга ярдәм иткән монафикъларга дус булудан. Кәферләргә һәм монафикъларга дус булган мөселманнар алар залимнәрдер.",
            "verse 60:10": "Ий мөэминнәр, әгәр сезгә Мәккәдән мөэминә хатыннар күчеп килсәләр, аларны сынап карагыз! Аллаһ аларның иманнарын нинди икәнен беләдер, әгәр ул хатыннарны хак мөэминнәр дип тапсагыз, аларны мөшрикләргә кайтарып бирмәгез, чөнки алар мөшрик булган ирләренә хәләл түгелләр һәм ул мөшрикләр ислам динен кабул иткән хатыннарына хәләл түгелләр. Мөселман булган хатыннарның мөшрик ирләренә бу хатыннарга биргән мөһерләрен үзләренә бирегез, ирләренә мәһерләрен биргәннән соң бу хатыннарны мәһер биреп никахлансагыз, сезгә гөнаһ юктыр. Үзегез ислам динен кабул иткәндә хатыныгыз кабул итмәсә, яки мөселман булганнан соң динне ташлап мөртәт булса, ул имансыз хатыныгызны никахыгызда тотмагыз, аерыгыз, әгәр ул хатыныгызга бер кәфер өйләнсә, әгәр хатыныгызга мәһәрне биргән булсагыз, хатыныгызга өйләнгән кәфердән биргән мәһәрне сорап алыгыз, һәм кәфер булган ирен ташлап ислам динен кабул иткән хатынга никахлансагыз, кәфер булган ире биргән мәһерен сездән сорасын, ягъни бирегез! Аллаһуның хөкеме сезгә әнә шундыйдыр, Аллаһ арагызда гаделлек белән хөкем итәр. Аллаһ белүче һәм гадел хөкем итүчедер.",
            "verse 60:11": "Әгәр сезнең хатыннарыгыздан бер хатын исламны ташлап кәферләр арасына китсә, ул кәферләр бу хатынның мөселман иреннән алган мәһерен шул мөселман иргә кайтарып бирмәсәләр, ул кәферләр белән сугышып табыш малын алгач, хатыннары кәферләр арасына киткән мөселман ирләргә шул киткән хатыннарына биргән мәһәр хәтле табыш малыннан бирегез! Вә үзегез иман китерегез, Аллаһудан куркыгыз!",
            "verse 60:12": "Ий пәйгамбәр г-м әгәр мөэминә хатыннар сиңа килеп Аллаһуга һичкемне, һичнәрсәне тиңдәш кылмаска вә урламаска, вә зина кылмаска, вә балаларны үтермәскә, вә ирләреннән булмаган баланы: \"Бу бала синнән булды\", – дип ирләренә куллары белән аяклары арасына ифтира кылмаска һәм дә шәригать эшләрендә сиңа каршылык кылмаска вәгъдә бирсәләр, ґәһедләрен, антларын кабул ит һәм алар өчен Аллаһудан ярлыкау сора! Бит – Аллаһ ярлыкаучы вә рәхимле.",
            "verse 60:13": "Ий мөэминнәр, Аллаһ аларга ачуланган кавем белән дуслашмагыз ягъни динсезләр, яһүдләр, насаралар, монафикълар, исерекләр, зиначылар, һәм бидеґәтчеләр кеби кешеләргә дус булмагыз, алар белән аралашып бергә яшәмәгез! Тәхкыйк ул кешеләр ахирәттән өметсез булдылар, кәферләр кабердән чыгарга өметсез булганнары кеби. Димәк аларга дус булган мөселманнарга да Аллаһ ачуланадыр."
        },
        "Telugu": {
            "verse 60:1": "ఓ విశ్వాసులారా! నాకు శత్రువులైన వారిని మరియు మీకు కూడా శత్రువులైన వారిని - వారి మీద ప్రేమ చూపిస్తూ - వారిని మీ స్నేహితులుగా చేసుకోకండి. మరియు వాస్తవానికి వారు మీ వద్దకు వచ్చిన సత్యాన్ని తిరస్కరించారు. మీ ప్రభువైన అల్లాహ్ ను మీరు విశ్వసించినందుకు, వారు ప్రవక్తను మరియు మిమ్మల్ని (మీ నగరం నుండి) వెడలగొట్టారు! ఒకవేళ మీరు నా ప్రసన్నత కోరి నా మార్గంలో ధర్మయుద్ధం కొరకు వెళితే (ఈ సత్యతిరస్కారులను మీ స్నేహితులుగా చేసుకోకండి). వారి పట్ల వాత్సల్యం చూపుతూ మీరు వారికి రహస్యంగా సందేశం పంపుతారా! మీరు దాచేది మరియు వెలిబుచ్చేది, నాకు బాగా తెలుసు. మరియు మీలో ఎవడైతే ఇలా చేస్తాడో, అతడు వాస్తవంగా, ఋజుమార్గం నుండి తప్పిపోయినవాడే",
            "verse 60:2": "ఒకవేళ వారు మీ మీద ప్రాబల్యం వహిస్తే, వారు మీకు విరోధులవుతారు. మరియు కీడుతో మీ వైపుకు తమ చేతులను మరియు తమ నాలుకలను చాపుతారు. మరియు మీరు కూడా సత్యతిరస్కారులై పోవాలని కోరుతారు",
            "verse 60:3": "మీ బంధువులు గానీ, మీ సంతానం గానీ మీకు ఏ విధంగానూ పనికిరారు. ఆయన పునరుత్థాన దినమున మీ మధ్య తీర్పు చేస్తాడు. మరియు అల్లాహ్ మీరు చేసేదంతా చూస్తున్నాడు",
            "verse 60:4": "వాస్తవానికి ఇబ్రాహీమ్ మరియు అతనితో ఉన్న వారిలో మీ కొరకు ఒక మంచి ఆదర్శం ఉంది. వారు తమ జాతి వారితో ఇలా అన్నప్పుడు: నిశ్చయంగా, అల్లాహ్ ను వదలి మీరు ఆరాధించే వాటితో మరియు మీతో, మాకు ఎలాంటి సంబంధం లేదు. మేము మిమ్మల్ని త్యజించాము మరియు మీరు అద్వితీయుడైన అల్లాహ్ ను విశ్వసించనంత వరకు, మాకూ మీకూ మధ్య విరోధం మరియు ద్వేషం ఉంటుంది.\" ఇక ఇబ్రాహీమ్ తన తండ్రితో: నేను తప్పక నిన్ను క్షమించమని (నా ప్రభువును) వేడుకుంటాను. ఇది తప్ప, నీ కొరకు అల్లాహ్ నుండి మరేమీ పొందే అధికారం నాకు లేదు.\" అని మాత్రమే అనగలిగాడు. (అల్లాహ్ తో ఇలా ప్రార్థించాడు): ఓ నా ప్రభూ! మేము నిన్నే నమ్ముకున్నాము మరియు నీ వైపునకే పశ్చాత్తాపంతో మరలుతున్నాము మరియు నీ వైపుకే మా గమ్యస్థానముంది",
            "verse 60:5": "ఓ మా ప్రభూ! మమ్మల్ని సత్యతిరస్కారుల కొరకు పరీక్షా సాధనంగా చేయకు మరియు ఓ మా ప్రభూ! మమ్మల్ని క్షమించు. నిశ్చయంగా కేవలం, నీవే సర్వశక్తిమంతుడవు, మహా వివేచనాపరుడవు",
            "verse 60:6": "వాస్తవాంగా! మీకు - అల్లాహ్ ను మరియు అంతిమ దినాన్ని అపేక్షించేవారికి - వారిలో ఒక మంచి ఆదర్శం ఉంది. మరియు ఎవడైనా దీని నుండి మరలిపోతే! నిశ్చయంగా, అల్లాహ్ నిరపేక్షాపరుడు, సర్వస్తోత్రాలకు అర్హుడు (అని తెలుసుకోవాలి)",
            "verse 60:7": "బహుశా, అల్లాహ్ మీ మధ్య మరియు మీకు విరోధులైన వారి మధ్య ప్రేమ కలిగించవచ్చు. మరియు అల్లాహ్ (ప్రతిదీ చేయగల) సమర్ధుడు. మరియు అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత",
            "verse 60:8": "ఎవరైతే ధర్మవిషయంలో మీతో యుద్ధం చేయరో మరియు మిమ్మల్ని మీ గృహాల నుండి వెళ్ళగొట్టరో! వారి పట్ల మీరు సత్ప్రవర్తనతో మరియు న్యాయంతో వ్యవహరించటాన్ని అల్లాహ్ నిషేధించలేదు. నిశ్చయంగా, అల్లాహ్ న్యాయవర్తనులను ప్రేమిస్తాడు",
            "verse 60:9": "కాని, వాస్తవానికి ఎవరైతే, ధర్మ విషయంలో మీతో యుద్ధం చేస్తారో మరియు మిమ్మల్ని మీ ఇండ్ల నుండి వెళ్ళగొడ్తారో మరియు మిమ్మల్ని వెళ్ళగొట్టటంలో పరస్పరం సహకరించుకుంటారో; వారితో స్నేహం చేయటాన్ని అల్లాహ్ మీ కొరకు నిషేధిస్తున్నాడు. మరియు ఎవరైతే వారితో స్నేహం చేస్తారో, అలాంటి వారు, వారే! దుర్మార్గులు",
            "verse 60:10": "ఓ విశ్వాసులారా! విశ్వసించిన స్త్రీలు, మీ వద్దకు వలస వచ్చినపుడు, వారిని పరీక్షించండి. అల్లాహ్ కు వారి విశ్వాసం గురించి బాగా తెలుసు. వారు వాస్తవంగా విశ్వసించిన వారని మీకు తెలిసినప్పుడు, వారిని సత్యతిరస్కారుల వద్దకు తిరిగి పంపకండి. (ఎందుకంటే) ఆ స్త్రీలు వారికి (సత్యతిరస్కారులకు) ధర్మసమ్మతమైన (భార్యలు) కారు మరియు వారు కూడా ఆ స్త్రీలకు ధర్మసమ్మతమైన (భర్తలు) కారు. కాని, వారు (సత్యతిరస్కారులు), వారికిచ్చిన (మహ్ర్) మీరు వారికి చెల్లించండి మరియు వారికి వారి మహ్ర్ ఇచ్చిన తరువాత, ఆ స్త్రీలను వివాహమాడితే మీకు ఎలాంటి దోషం లేదు. మరియు మీరు కూడా సత్యతిరస్కారులైన స్త్రీలను మీ వివాహబంధంలో ఉంచుకోకండి. (అవిశ్వాసులుగా ఉండి పోదలచిన) మీ భార్యల నుండి మీరు ఇచ్చిన మహర్ అడిగి తీసుకోండి. (అలాగే అవిశ్వాసులను, విశ్వాసులైన తమ) భార్యల నుండి మహ్ర్ అడిగి తీసుకోనివ్వండి. ఇది అల్లాహ్ తీర్మానం. ఆయన ఈ విధంగా మీ మధ్య తీర్పు చేస్తున్నాడు. మరియు అల్లాహ్ సర్వజ్ఞుడు, మహా వివేచనాపరుడు",
            "verse 60:11": "మరియు ఒకవేళ మీ (విశ్వాసుల) భార్యలలో ఒకామె, మిమ్మల్ని విడిచి సత్యతిరస్కారుల వద్దకు వెళ్ళిపోతే! (ఆ సత్యతిరస్కారులు, మీరు ఆ స్త్రీలకు చెల్లించిన మహ్ర్ మీకు వాపసు ఇవ్వడానికి నిరాకరిస్తే)! ఆ తరువాత మీకు వారితో ప్రతీకారం తీర్చుకునే అవకాశం దొరికితే (మీరు వారిపై యుద్ధం చేసి విజయం పొందితే)! దాని (విజయ ధనం) నుండి, ఎవరి భార్యలైతే సత్యతిరస్కారుల వద్దకు పోయారో వారికి - వారు (తమ భార్యలకు) ఇచ్చిన దానికి (మహ్ర్ కు) సమానంగా - చెల్లించండి. మరియు మీరు విశ్వసించిన అల్లాహ్ యందు, భయభక్తులు కలిగి ఉండండి",
            "verse 60:12": "ఓ ప్రవక్తా! విశ్వసించిన స్త్రీలు ప్రమాణం (బైఅత్) చేయటానికి నీ వద్దకు వచ్చి, తాము ఎవరినీ అల్లాహ్ కు సాటి కల్పించము అని మరియు దొంగతనం చేయము అని మరియు వ్యభిచారం చేయము అని మరియు తమ సంతానాన్ని హత్య చేయము అని మరియు తమ చేతుల మద్య మరియు తమ కాళ్ళ మధ్య నిందారోపణ కల్పించము అని మరియు ధర్మసమ్మతమైన విషయాలలో నీకు అవిధేయత చూపము అని, ప్రమాణం చేస్తే, వారి నుండి ప్రమాణం (బైఅత్) తీసుకో మరియు వారిని క్షమించమని అల్లాహ్ ను ప్రార్థించు. నిశ్చయంగా, అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత",
            "verse 60:13": "ఓ విశ్వాసులారా! అల్లాహ్ ఆగ్రహానికి గురి అయిన జాతి వారిని స్నేహితులుగా చేసుకోకండి. వాస్తవానికి గోరీలలో ఉన్న సత్యతిరస్కారులు, నిరాశ చెందినట్లు వారు కూడా పరలోక జీవితం పట్ల నిరాశ చెంది ఉన్నారు"
        },
        "Thai": {
            "verse 60:1": "โอ้บรรดาผู้ศรัทธาเอ๋ย พวกเจ้าอย่าได้คบศัตรูของข้าและศัตรูของพวกเจ้าเป็นมิตรโดยให้ความรักใคร่แก่พวกเขา และทั้ง ๆ ที่พวกเขาปฏิเสธศรัทธาต่อสิ่งที่มีมายังพวกเจ้าคือสัจธรรม พวกเขาขับไล่ร่อซูลและโดยเฉพาะพวกเจ้า เนื่องเพราะพวกเจ้าศรัทธาต่ออัลลอฮฺพระเจ้าของพวกเจ้า หากพวกเจ้าได้เคยออกไปต่อสู้ในแนวทางของข้า และแสวงหาความโปรดปรานของข้า (ดังนั้นพวกเจ้าอย่าได้คบพวกปฏิเสธศรัทธาเป็นมิตรอื่นของข้า) โดยซ่อนความรักใคร่แก่พวกเขาอย่างลับ ๆ และข้ารู้ดียิ่งในสิ่งที่พวกเจ้าปิดบัง และสิ่งที่พวกเจ้าเปิดเผย และผู้ใดในหมู่พวกเจ้ากระทำเช่นนั้นแน่นอนเขาได้หลงจากทางอันเที่ยงธรรม",
            "verse 60:2": "หากพวกเขามีสถานะดีกว่าพวกเจ้า พวกเขาก็จะแสดงตัวเป็นศัตรูกับพวกเจ้าและจะยื่นมือของพวกเขาไปยังพวกเจ้า (ทำร้าย) และลิ้นของพวกเขาจะกล่าวร้ายสาปแช่งและพวกเขาใคร่ที่จะให้พวกเจ้าเป็นพวกปฏิเสธศรัทธา",
            "verse 60:3": "ความสัมพันธ์ทางเครือญาติของพวกเจ้าและลูกหลานของพวกเจ้า จะไม่อำนวยประโยชน์อื่นใดแก่พวกเจ้าในวันกิยามะฮฺ พระองค์จะทรงตัดสินระหว่างพวกเจ้า และอัลลอฮฺทรงสอดส่องในสิ่งที่พวกเจ้ากระทำ",
            "verse 60:4": "แน่นอนได้มีแบบอย่างอันดีงามสำหรับพวกเจ้าแล้วใน (ตัว) อิบรอฮีม และบรรดา (มุอฺมิน) ผู้ที่อยู่ร่วมกับเขา เมื่อพวกเขากล่าวแก่หมู่ชนของพวกเขาว่า แท้จริงพวกเราขอปลีกตัวจากพวกท่านและสิ่งที่พวกท่านเคารพบูชาอื่นจากอัลลอฮฺ เราขอปฏิเสธศรัทธาต่อ (ศาสนาของ) พวกท่าน และการเป็นศัตรูและการเกลียดชังระหว่างพวกเรากับพวกท่านได้ปรากฎขึ้นแล้ว (และจะคงอยู่) ตลอดไปจนกว่าพวกท่านจะศรัทธาต่ออัลลอฮฺองค์เดียว นอกจากคำกล่าวของอิบรอฮีมแก่บิดาของเขา (ที่ว่า) แน่นอนฉันจะขออภัยโทษให้แก่ท่านทั้งๆ ที่ฉันไม่มีอำนาจอันใดจะช่วยท่าน (ให้พ้นจากการลงโทษ) จากอัลลอฮฺได้ ข้าแต่พระเจ้าของเราแด่พระองค์ท่านเราขอมอบหมายและยังพระองค์ท่านเท่านั้น เราขอลุแก่โทษ และยังพระองค์ท่านเท่านั้นคือการกลับไป",
            "verse 60:5": "ข้าแต่พระเจ้าของเรา ขอพระองค์ทรงอย่าให้เราเป็นที่ทดสอบของบรรดาผู้ปฏิเสธศรัทธา ขอพระองค์ทรงโปรดอภัยให้แก่เรา ข้าแต่พระเจ้าของเรา แท้จริงพระองค์ท่านเป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
            "verse 60:6": "โดยแน่นอน ได้มีแบบอย่างอันดีงามในพวกเขาสำหรับพวกเจ้าแล้ว แก่ผู้ที่หวังใน (การตอบแทนของ)อัลลอฮฺและวันสุดท้ายและผู้ใดผินหลังให้ (การศรัทธา) ดังนั้น แท้จริงอัลลอฮฺ คือ ผู้ทรงพอเพียงผู้ทรงได้รับการสรรเสริญ",
            "verse 60:7": "บางทีอัลลอฮฺจะทรงทำให้เกิดความรักใคร่ระหว่างพวกเจ้ากับบรรดาผู้ที่พวกเจ้าถือเป็นศัตรูในหมู่พวกเขา และอัลลอฮฺเป็นผู้ทรงอานุภาพ และอัลลอฮฺเป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
            "verse 60:8": "อัลลอฮฺมิได้ทรงห้ามพวกเจ้าเกี่ยวกับบรรดาผู้ที่มิได้ต่อต้านพวกเจ้าในเรื่องศาสนาและพวกเขามิได้ขับไล่พวกเจ้าออกจากบ้านเรือนของพวกเจ้าในการที่พวกเจ้าจะทำความดีแก่พวกเขา และให้ความยุติธรรมแก่พวกเขา แท้จริงอัลลอฮฺทรงรักผู้มีความยุติธรรม",
            "verse 60:9": "แต่ว่าอัลลอฮทรงห้ามพวกเจ้าเกี่ยวกับบรรดาผู้ที่ต่อต้านพวกเจ้าในเรื่องศาสนาและขับไล่พวกเจ้าออกจากบ้านเรือนของพวกเจ้า และช่วยเหลือให้ขับไล่พวกเจ้าในการที่พวกเจ้าจะผูกมิตรกับพวกเขาและผู้ใดผูกมิตรกับพวกเขา ชนเหล่านั้นพวกเขาเป็นผู้อธรรม",
            "verse 60:10": "โอ้บรรดาผู้ศรัทธาเอ๋ย เมื่อบรรดาหญิงผู้ศรัทธาเป็นผู้ลี้ภัยมาหาพวกเจ้า ก็จงสอบสวนพวกนาง อัลลอฮฺทรงรู้ดียิ่งในการศรัทธาของพวกนาง ครั้นเมื่อพวกเจ้ารู้ว่าพวกนางเป็นผู้ศรัทธา ก็อย่าได้ส่งพวกนางกลับไปยังพวกปฏิเสธศรัทธา พวกนางมิได้เป็นที่อนุมัติแก่พวกเขา และพวกเขาก็มิได้เป็นที่อนุมัติแก่พวกนาง และจงจ่ายคืนให้พวกเขา (สามีเดิมที่เป็นกาเฟร) สิ่งที่พวกเขาได้จ่ายไป (มะฮัร) และไม่เป็นบาปอันใดแก่พวกเจ้าที่จะแต่งงานกับพวกนาง เมื่อพวกเจ้าได้ให้แก่พวกนางซึ่งของหมั้นของพวกนาง และอย่าหน่วงเหนี่ยวพันธะการแต่งงานของบรรดาหญิงผู้ปฏิเสธศรัทธา และจงขอคืนสิ่งที่พวกเจ้าได้ใช้จ่ายไป และให้พวกเขาขอคืนสิ่งที่พวกเขาได้ใช้จ่ายไป นั่นคือข้อตัดสินของอัลลอฮฺ พระองค์ทรงตัดสินในระหว่างพวกเจ้า และอัลลอฮฺเป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
            "verse 60:11": "และถ้าคนใดในบรรดาภริยาของพวกเจ้าหนีออกไปสู่พวกปฏิเสธศรัทธาแล้ว ครั้นเมื่อพวกเจ้าสามารถแก้แค้นริบทรัพย์มาได้ ก็จงจ่ายคืนให้แก่บรรดาผู้ที่บรรดาภริยาของพวกเขาหนีไปเท่ากับจำนวนที่พวกเขาได้จ่ายไป และจงยำเกรงอัลลอฮฺ ผู้ซึ่งพวกเจ้าเป็นผู้ศรัทธาต่อพระองค์เถิด",
            "verse 60:12": "โอ้ นะบีเอ๋ย เมื่อบรรดาหญิงผู้ศรัทธาได้มาหาเจ้าโดยพวกนางเพื่อให้ปฏิญาณแก่เจ้าพวกนางจะไม่ตั้งภาคีใด ๆ ต่ออัลลอฮฺ และจะไม่ขโมย และจะไม่ทำชู้ และจะไม่ฆ่าลูก ๆ ของพวกนาง และจะไม่นำมาซึ่งการใส่ร้ายโดยการเสกสรรลูกหลง พ่อให้เป็นลูกของเขา และจะไม่ขัดขืนคำสั่งของเจ้าในเรื่องดีงาม ดังนั้นจงรับการปฏิญาณของพวกนาง และจงขอต่ออัลลอฮฺให้ทรงอภัยแก่พวกนาง แท้จริงอัลลอฮฺเป็นผู้ทรงอภัยผู้ทรงเมตตาเสมอ",
            "verse 60:13": "โอ้บรรดาผู้ศรัทธาเอ๋ย พวกเจ้าอย่าได้คบกับหมู่ชนที่อัลลอฮฺทรงกริ้วต่อพวกเขาไว้เป็นมิตรสหาย แน่นอนพวกเขาหมดหวังต่อวันปรโลกแล้วเสมือนกับที่พวกปฏิเสธศรัทธาหมดหวังต่อ (การฟื้นคืนชีพของ) ชาวกุบูร"
        },
        "Turkish": {
            "verse 60:1": "Ey inananlar! Benim de düşmanım, sizin de düşmanınız olanları dost edinmeyin. Onlar, size gelen gerçeği inkar etmişken, onlara sevgi gösteriyorsunuz; oysa onlar, Rabbiniz olan Allah'a inandığınızdan ötürü sizi ve Peygamberi yurdunuzdan çıkarıyorlar. Eğer sizler Benim yolumda savaşmak ve rızamı kazanmak için çıkmışsanız onlara nasıl sevgi gösterirsiniz? Ben, sizin gizlediğinizi de, açığa vurduğunuzu da bilirim. İçinizden onlara sevgi gösteren kimse, şüphesiz doğru yoldan sapmıştır.",
            "verse 60:2": "Eğer sizi elegeçirirlerse sizin onlara gösterdiğiniz sevgiyi göstermezler, size düşman olurlar, ellerini ve dillerini fenalık etmek için uzatırlar, keşke inkar etseniz isterler.",
            "verse 60:3": "Yakınlarınız ve çocuklarınız size kıyamet gününde bir fayda veremezler. Allah onlarla sizi ayırır. Allah işlediklerinizi görendir.",
            "verse 60:4": "İbrahim ve onunla beraber olanlarda, sizin için uyulacak güzel bir örnek vardır. Onlar milletlerine şöyle demişlerdi: \"Biz sizden ve Allah'tan başka taptıklarınızdan uzağız; sizin dininizi inkar ediyoruz; bizimle sizin aranızda yalnız Allah'a inanmanıza kadar ebedi düşmanlık ve öfke başgöstermiştir.\" -Yalnız, İbrahim'in, babasına: \"And olsun ki, senin için mağfiret dileyeceğim, fakat sana Allah'tan gelecek herhangi bir şeyi savmaya gücüm yetmez\" sözü bu örneğin dışındadır- \"Rabbimiz! Sana güvendik, Sana yöneldik; dönüş Sanadır.\"",
            "verse 60:5": "\"Rabbimiz! Bizi, inkar edenlerle deneme; bizi bağışla, doğrusu Sen, güçlü olan, Hakim olansın.\"",
            "verse 60:6": "And olsun ki, sizlerden, Allah'ı ve ahiret gününü uman kimse için, bunlarda güzel örnekler vardır. Kim yüz çevirirse kendi aleyhine olur, doğrusu Allah müstağnidir, övülmeğe layıktır.",
            "verse 60:7": "Allah'ın sizinle, düşmanlık gösterdiğiniz kimseler arasında bir sevgi yaratması umulur; Allah Kadir'dir, Allah bağışlayandır, acıyandır.",
            "verse 60:8": "Allah, din uğrunda sizinle savaşmayan, sizi yurdunuzdan çıkarmayan kimselere iyilik yapmanızı ve onlara karşı adil davranmanızı yasak kılmaz; doğrusu Allah adil olanları sever.",
            "verse 60:9": "Allah, ancak sizinle din uğrunda savaşanları, sizi yurtlarınızdan çıkaranları ve çıkarılmanıza yardım edenleri dost edinmenizi yasak eder; kim onları dost edinirse, işte onlar zalimdir.",
            "verse 60:10": "Ey inananlar! İnanmış kadınlar hicret ederek size gelirlerse onları deneyin, hicretlerinin sebebini inceleyin. Allah onların imanlarını çok iyi bilir. Onların mümin kadınlar olduklarını öğrenirseniz, inkarcılara geri çevirmeyin. Bu kadınlar, o inkarcılara helal değildir Onlar da bunlara helal olmazlar. İnkarcıların bu kadınlara verdikleri mehirleri iade edin: Bu kadınların mehirlerini kendilerine verdiğiniz zaman, onlarla evlenmenizde bir engel yoktur. İnkarcı kadınları nikahınızda tutmayın; onlara verdiğiniz mehri isteyin; inkarcı erkekler de hicret eden mümin kadınlara verdikleri mehirleri istesinler. Allah'ın hükmü budur; aranızda O hükmeder. Allah bilendir, Hakim'dir.",
            "verse 60:11": "Ey mümin erkekler! Eğer inkar eden (kafir olan) eşlerinize sarfettiklerinizden inkarcılara bir şey geçecek olursa ganimetten, eşleri giden mümin erkeklere sarfettikleri miktar kadarını verin. İnandığınız Allah'a karşı gelmekten sakının.",
            "verse 60:12": "Ey Peygamber! İnanmış kadınlar, Allah'a hiçbir ortak koşmamak, hırsızlık yapmamak, zina etmemek, çocuklarını öldürmemek, başkasının çocuğunu sahiplenerek kocasına isnadda bulunmamak ve uygun olanı işlemekte sana karşı gelmemek şartıyla sana beyat etmek üzere geldikleri zaman, onları kabul et; onlara Allah'tan bağışlanma dile; doğrusu Allah, bağışlayandır, acıyandır.",
            "verse 60:13": "Ey inananlar! Allah'ın gazabına uğramış milleti dost edinmeyin; inkarcıların kabirde bulunan kimselerden umutlarını kestikleri gibi, onlar da, ahiretten umutlarını kesmişlerdir."
        },
        "Urdu": {
            "verse 60:1": "مومنو! اگر تم میری راہ میں لڑنے اور میری خوشنودی طلب کرنے کے لئے (مکے سے) نکلے ہو تو میرے اور اپنے دشمنوں کو دوست نہ بناؤ۔ تم تو ان کو دوستی کے پیغام بھیجتے ہو اور وہ (دین) حق سے جو تمہارے پاس آیا ہے منکر ہیں۔ اور اس باعث سے کہ تم اپنے پروردگار خدا تعالیٰ پر ایمان لائے ہو پیغمبر کو اور تم کو جلاوطن کرتے ہیں۔ تم ان کی طرف پوشیدہ پوشیدہ دوستی کے پیغام بھیجتے ہو۔ اور جو کچھ تم مخفی طور پر اور جو علیٰ الاعلان کرتے ہو وہ مجھے معلوم ہے۔ اور جو کوئی تم میں سے ایسا کرے گا وہ سیدھے راستے سے بھٹک گیا",
            "verse 60:2": "اگر یہ کافر تم پر قدرت پالیں تو تمہارے دشمن ہوجائیں اور ایذا کے لئے تم پر ہاتھ (بھی) چلائیں اور زبانیں (بھی) اور چاہتے ہیں کہ تم کسی طرح کافر ہوجاؤ",
            "verse 60:3": "قیامت کے دن نہ تمہارے رشتے ناتے کام آئیں گے اور نہ اولاد۔ اس روز وہی تم میں فیصلہ کرے گا۔ اور جو کچھ تم کرتے ہو خدا اس کو دیکھتا ہے",
            "verse 60:4": "تمہیں ابراہیم اور ان کے رفقاء کی نیک چال چلنی (ضرور) ہے۔ جب انہوں نے اپنی قوم کے لوگوں سے کہا کہ ہم تم سے اور ان (بتوں) سے جن کو تم خدا کے سوا پوجتے ہو بےتعلق ہیں (اور) تمہارے (معبودوں کے کبھی) قائل نہیں (ہوسکتے) اور جب تک تم خدائے واحد اور ایمان نہ لاؤ ہم میں تم میں ہمیشہ کھلم کھلا عداوت اور دشمنی رہے گی۔ ہاں ابراہیمؑ نے اپنے باپ سے یہ (ضرور) کہا کہ میں آپ کے لئے مغفرت مانگوں گا اور خدا کے سامنے آپ کے بارے میں کسی چیز کا کچھ اختیار نہیں رکھتا۔ اے ہمارے پروردگار تجھ ہی پر ہمارا بھروسہ ہے اور تیری ہی طرف ہم رجوع کرتے ہیں اور تیرے ہی حضور میں (ہمیں) لوٹ کر آنا ہے",
            "verse 60:5": "اے ہمارے پروردگار ہم کو کافروں کے ہاتھ سے عذاب نہ دلانا اور اے پروردگار ہمارے ہمیں معاف فرما۔ بےشک تو غالب حکمت والا ہے",
            "verse 60:6": "تم (مسلمانوں) کو یعنی جو کوئی خدا (کے سامنے جانے) اور روز آخرت (کے آنے) کی امید رکھتا ہو اسے ان لوگوں کی نیک چال چلنی (ضرور) ہے۔ اور روگردانی کرے تو خدا بھی بےپرواہ اور سزاوار حمد (وثنا) ہے",
            "verse 60:7": "عجب نہیں کہ خدا تم میں اور ان لوگوں میں جن سے تم دشمنی رکھتے ہو دوستی پیدا کردے۔ اور خدا قادر ہے اور خدا بخشنے والا مہربان ہے",
            "verse 60:8": "جن لوگوں نے تم سے دین کے بارے میں جنگ نہیں کی اور نہ تم کو تمہارے گھروں سے نکالا ان کے ساتھ بھلائی اور انصاف کا سلوک کرنے سے خدا تم کو منع نہیں کرتا۔ خدا تو انصاف کرنے والوں کو دوست رکھتا ہے",
            "verse 60:9": "خدا ان ہی لوگوں کے ساتھ تم کو دوستی کرنے سے منع کرتا ہے جنہوں نے تم سے دین کے بارے میں لڑائی کی اور تم کو تمہارے گھروں سے نکالا اور تمہارے نکالنے میں اوروں کی مدد کی۔ تو جو لوگ ایسوں سے دوستی کریں گے وہی ظالم ہیں",
            "verse 60:10": "مومنو! جب تمہارے پاس مومن عورتیں وطن چھوڑ کر آئیں تو ان کی آزمائش کرلو۔ (اور) خدا تو ان کے ایمان کو خوب جانتا ہے۔ سو اگر تم کو معلوم ہو کہ مومن ہیں تو ان کو کفار کے پاس واپس نہ بھیجو۔ کہ نہ یہ ان کو حلال ہیں اور نہ وہ ان کو جائز۔ اور جو کچھ انہوں نے (ان پر) خرچ کیا ہو وہ ان کو دے دو۔ اور تم پر کچھ گناہ نہیں کہ ان عورتوں کو مہر دے کر ان سے نکاح کرلو اور کافر عورتوں کی ناموس کو قبضے میں نہ رکھو (یعنی کفار کو واپس دے دو) اور جو کچھ تم نے ان پر خرچ کیا ہو تم ان سے طلب کرلو اور جو کچھ انہوں نے (اپنی عورتوں پر) خرچ کیا ہو وہ تم سے طلب کرلیں۔ یہ خدا کا حکم ہے جو تم میں فیصلہ کئے دیتا ہے اور خدا جاننے والا حکمت والا ہے",
            "verse 60:11": "اور اگر تمہاری عورتوں میں سے کوئی عورت تمہارے ہاتھ سے نکل کر کافروں کے پاس چلی جائے (اور اس کا مہر وصول نہ ہوا ہو) پھر تم ان سے جنگ کرو (اور ان سے تم کو غنیمت ہاتھ لگے) تو جن کی عورتیں چلی گئی ہیں ان کو (اس مال میں سے) اتنا دے دو جتنا انہوں نے خرچ کیا تھا اور خدا سے جس پر تم ایمان لائے ہو ڈرو",
            "verse 60:12": "اے پیغمبر! جب تمہارے پاس مومن عورتیں اس بات پر بیعت کرنے کو آئیں کہ خدا کے ساتھ نہ شرک کریں گی نہ چوری کریں گی نہ بدکاری کریں گی نہ اپنی اولاد کو قتل کریں گی نہ اپنے ہاتھ پاؤں میں کوئی بہتان باندھ لائیں گی اور نہ نیک کاموں میں تمہاری نافرمانی کریں گی تو ان سے بیعت لے لو اور ان کے لئے خدا سے بخشش مانگو۔ بےشک خدا بخشنے والا مہربان ہے",
            "verse 60:13": "مومنو! ان لوگوں سے جن پر خدا غصے ہوا ہے دوستی نہ کرو (کیونکہ) جس طرح کافروں کو مردوں (کے جی اُٹھنے) کی امید نہیں اسی طرح ان لوگوں کو بھی آخرت (کے آنے) کی امید نہیں"
        },
        "Uyghur": {
            "verse 60:1": "ئى مۆمىنلەر، مېنىڭ دۈشمىنىمنى ۋە سىلەرنىڭ دۈشمىنىڭلارنى دوست تۇتماڭلار، ئۇلار سىلەرگە كەلگەن ھەقىقەتنى (يەنى ئىسلامنى، قۇرئاننى) ئىنكار قىلغان تۇرسا، ئۇلارغا دوستلۇق يەتكۈزىسىلەر، ئۇلار پەرۋەردىگارىڭلار اﷲ قا ئىمان ئېيتقىنىڭلار ئۈچۈن پەيغەمبەرنى ۋە سىلەرنى يۇرتۇڭلاردىن ھەيدەپ چىقاردى، ئەگەر سىلەر مېنىڭ يولۇمدا جىھاد قىلىپ ۋە رازىلىقىمنى تىلەپ چىققان بولساڭلار (ئۇ چاغدا مېنىڭ دۈشمىنىمنى ۋە سىلەرنىڭ دۈشمىنىڭلارنى دوست تۇتماڭلار)، سىلەر ئۇلارغا يوشۇرۇن دوستلۇق يەتكۈزىسىلەر، مەن سىلەر يوشۇرغان ۋە ئاشكارىلىغان نەرسىلەرنى بىلىپ تۇرىمەن، كىمكى شۇنداق قىلىدىكەن (يەنى ئۇلارنى دوست تۇتۇپ، ئۇلارغا پەيغەمبەرنىڭ خەۋەرلىرىنى يەتكۈزىدىكەن)، ئۇ ھەقىقەتەن توغرا يولدىن ئازغان بولىدۇ",
            "verse 60:2": "ئەگەر ئۇلار سىلەرنى يەڭسە سىلەرگە دۈشمەن بولىدۇ، سىلەرگە زىيانكەشلىك قىلىدۇ، سىلەرنى تىللايدۇ، سىلەرنىڭ مۇرتەد بولۇشۇڭلارنى ئارزۇ قىلىدۇ",
            "verse 60:3": "قىيامەت كۈنى سىلەرنىڭ تۇغقانلىرىڭلار ۋە ئەۋلادلىرىڭلار سىلەرگە ھېچ پايدا يەتكۈزەلمەيدۇ، اﷲ ئاراڭلارنى ئايرىۋېتىدۇ (يەنى سىلەر جەننەتتە بولساڭلار، ئۇلار كۇففارلارنىڭ قاتارىدا دوزاختا بولىدۇ)، اﷲ سىلەرنىڭ قىلىۋاتقان ئىشىڭلارنى كۆرۈپ تۇرغۇچىدۇر",
            "verse 60:4": "ئىبراھىم ۋە ئۇنىڭ بىللە بولغان (مۆمىنلەر) سىلەرگە ھەقىقەتەن ئوبدان نەمۇنىدۇر، ئۆز ۋاقتىدا ئۇلار قەۋمىگە: «ھەقىقەتەن بىز سىلەردىن ۋە سىلەر اﷲ نى قويۇپ ئىبادەت قىلىۋاتقان بۇتلىرىڭلاردىن ئادا - جۇدامىز، بىزنىڭ ئارىمىزدىكى ئاداۋەت ۋە ئۆچمەنلىك تاكى سىلەر يالغۇز بىر اﷲ قا ئىمان ئېيتقىنىڭلارغا قەدەر ئەبەدىي ساقلىنىپ قالىدۇ» دېدى. پەقەت ئىبراھىمنىڭ ئاتىسىغا ئېيتقان «ئەلۋەتتە ساڭا مەغپىرەت تىلەيمەن، اﷲ نىڭ ئازابىدىن ھېچ نەرسىنى سەندىن دەپئى قىلالمايمەن» دېگەن سۆزىنى سىلەرنىڭ نەمۇنە قىلىشىڭلارغا بولمايدۇ. (ئىبراھىم ۋە ئۇنىڭ بىلەن بىللە بولغان مۆمىنلەر ئېيتتى) «پەرۋەردىگارىمىز ساڭا تەۋەككۈل قىلدۇق، ساڭا قايتتۇق، ئاخىر قايتىدىغان جاي سېنىڭ دەرگاھىڭدۇر",
            "verse 60:5": "پەرۋەردىگارىمىز! كاپىرلارنى بىزگە زىيانكەشلىك قىلىش ئىمكانىيىتىگە ئىگە قىلمىغىن (ئۇلار بىزگە مۇسەللەت بولۇپ، بىزنى كۆتۈرگىلى بولمايدىغان ئازاب بىلەن دىنىمىزدىن چىقارمىسۇن)، پەرۋەردىگارىمىز، بىزگە مەغپىرەت قىلغىن، سەن ھەقىقەتەن غالىبسەن، ھېكمەت بىلەن ئىش قىلغۇچىسەن»",
            "verse 60:6": "(ئى مۇھەممەدنىڭ ئۈممىتى!) ئىبراھىم ۋە ئۇنىڭغا ئەگەشكەن مۆمىنلەر سىلەرگە، اﷲ نى ۋە ئاخىرەت كۈنىنى ئۈمىد قىلىدىغانلارغا ياخشى نەمۇنىدۇر، كىمكى (ئىمانىدىن) يۈز ئۆرۈيدىكەن، (بىلسۇنكى) اﷲ (ئۇنىڭدىن ۋە ئۇنداقلاردىن) بىھاجەتتۇر، (اﷲ) مەدھىيىگە لايىقتۇر",
            "verse 60:7": "بەلكىم اﷲ سىلەر بىلەن سىلەر ئۆچ كۆرۈدىغان ئادەملەر ئارىسىدا دوستلۇق پەيدا قىلىدۇ، اﷲ ھەر نەرسىگە قادىردۇر، اﷲ ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر",
            "verse 60:8": "(كۇففارلاردىن) سىلەر بىلەن ئۇرۇش قىلمىغان ۋە سىلەرنى يۇرتۇڭلاردىن ھەيدەپ چىقارمىغانلارغا كەلسەك، اﷲ ئۇلارغا ياخشىلىق قىلىشىڭلاردىن، ئۇلارغا ئادىل بولۇشۇڭلاردىن سىلەرنى توسمايدۇ، شۈبھىسىزكى، اﷲ ئادىللارنى دوست تۇتىدۇ",
            "verse 60:9": "اﷲ دىن ئۈچۈن سىلەر بىلەن ئۇرۇشقان، سىلەرنى يۇرتۇڭلاردىن ھەيدەپ چىقارغان ۋە سىلەرنى ھەيدەپ چىقىرىشقا ياردەملەشكەنلەرنى دوست تۇتۇشۇڭلاردىن سىلەرنى توسىدۇ، كىمكى ئۇلارنى دوست تۇتىدىكەن، ئۇلار زالىملاردۇر",
            "verse 60:10": "ئى مۆمىنلەر! سىلەرگە مۆمىن ئاياللار ھىجرەت قىلىپ كەلسە، ئۇلارنى سىناپ كۆرۈڭلار، ئۇلارنىڭ ئىمانىنى اﷲ ئوبدان بىلىدۇ، ئەگەر ئۇلارنى (سىنىغاندىن كېيىن ھەقىقىي) مۆمىنە دەپ تونۇساڭلار، ئۇلارنى كاپىرلارغا قايتۇرۇپ بەرمەڭلار، ئۇلار كاپىرلارغا ھالال ئەمەس، كاپىرلارمۇ ئۇلارغا ھالال ئەمەس، كاپىر ئەرلىرىنىڭ ئۇلارغا بەرگەن مەھرىنى قايتۇرۇپ بېرىڭلار، ئۇلارنىڭ مەھرىلىرىنى بېرىپ نىكاھىڭلارغا ئالساڭلار سىلەرگە ھېچ گۇناھ بولمايدۇ، كاپىر ئاياللارنى ئەمرىڭلاردا ساقلىماڭلار، ئۇلارغا بەرگەن مەھرىڭلارنى تەلەپ قىلىڭلار، كاپىرلارمۇ (ھىجرەت قىلىپ كەلگەن مۆمىن ئاياللىرىغا بەرگەن) مەھرىلىرىنى تەلەپ قىلسۇن، اﷲ نىڭ ھۆكمى ئەنە شۇ. اﷲ ئاراڭلاردا ھۆكۈم چىقىرىدۇ، اﷲ ھەممىنى بىلگۈچىدۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 60:11": "ئەگەر سىلەرنىڭ بەزى ئاياللىرىڭلار كاپىرلارغا كىرىپ كەتسە، (كاپىرلار بىلەن) ئۇرۇشۇپ غەنىمەت ئالغان ۋاقتىڭلاردا، ئاياللىرى كاپىرلارغا كىرىپ كەتكەن كىشىلەرگە (غەنىمەتتىن) ئۇلارنىڭ بەرگەن مەھرىنىڭ مىقدارىنى بېرىڭلار (يەنى مۇسۇلمانلاردىن بىرىنىڭ ئايالى كۇففارلار تەرەپكە قېچىپ كەتسە، سىلەر كۇففارلار بىلەن ئۇرۇشۇپ ئالغان غەنىمەت مالدىن مەزكۇر ئايالنىڭ ئېرىگە مەھرى مىقدارى مال بېرىڭلار)، سىلەر ئۆزۈڭلار ئىشەنگەن اﷲ تىن قورقۇڭلار",
            "verse 60:12": "ئى پەيغەمبەر! مۆمىن ئاياللار ساڭا كېلىپ، اﷲ قا ھېچ نەرسىنى شېرىك كەلتۈرمەسلىككە، ئوغرىلىق قىلماسلىققا، زىنا قىلماسلىققا، بالىلىرىنى (جاھىلىيەت دەۋرىدىكىدەك قىز بالىلىرىنى نومۇستىن ياكى كەمبەغەللىكتىن قورقۇپ) ئۆلتۈرمەسلىككە، باشقىلارنىڭ بالىسىنى يالغاندىن ئەرلىرىنىڭ بالىسى قىلىۋالماسلىققا، سەن بۇيرۇغان ياخشى ئىشلاردىن باش تارتماسلىققا بەيئەت قىلسا (يۇقىرىقى شەرتلەر ئاساسىدا) ئۇلارغا بەيئەت قىلغىن، ئۇلار ئۈچۈن اﷲ تىن مەغپىرەت تىلىگىن، اﷲ ھەقىقەتەن ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر",
            "verse 60:13": "ئى مۆمىنلەر! اﷲ غەزەپ قىلغان قەۋمنى دوست تۇتماڭلار، ئۇلار ئاخىرەتنىڭ (ساۋابىدىن) قەبرىلىرىدە ياتقان كۇففارلار ئۈمىدىنى ئۈزگەندەك ھەقىقەتەن ئۈمىدىنى ئۈزدى"
        },
        "Uzbek": {
            "verse 60:1": "Эй иймон келтирганлар! Агар Менинг йўлимда жиҳод қилиб ва розилигимни сўраб чиққан бўлсангиз, Менинг душманларимни ва ўзингизнинг душманларингизни дўст тутманглар. Сизлар уларга дўстлик қиласизлар, улар бўлса сизларга келган ҳаққа куфр келтирарлар. Роббингиз бўлмиш Аллоҳга иймон келтирганингиз учун Пайғамбарни ва сизни ҳайдаб чиқарарлар. Сиз уларга дўстлик қилиб сир айтасиз. Ҳолбуки, Мен нимани махфий тутганингизнию нимани ошкор қилганингизни жуда яхши билурман. Ораларингизда ким ўша ишни қилса, тўғри йўлдан адашган бўладир.",
            "verse 60:2": "Агар улар сиздан устун келсалар, сизга душман бўларлар ва сизларга қўлларию тилларини ёмонликла чўзар лар. Ва сизларнинг кофир бўлишларингизни хоҳларлар.",
            "verse 60:3": "Қариндошларингиз ва фарзандларингиз сизга ҳеч манфаат бера олмаслар. Қиёмат куни У зот ораларингизни бўлур. Аллоҳ нима қилаётганингизни кўриб тургувчидир.",
            "verse 60:4": "Ҳақиқатда, сизларга Иброҳим ва у билан бирга бўлганларда яхши ўрнак бор. Улар, биз сиздан ва сиз ибодат қилаётган нарсадан безормиз, сизга куфр келтирдик, энди токи ягона Аллоҳга иймон келтирмагунларингизча орамизда доимий адоват ва кучли нафрат пайдо бўлди, дедилар. Магар Иброҳимнинг отасига қарата, албатта сен учун истиғфор айтаман, сендан Аллоҳ(азоби)дан бирор нарса қайтаришга молик эмасман, деган сўзи мустасно. Эй Роббимиз, фақат Сенга таваккал қилдик, фақат Сенгагина қайтдик ва қайтиб борадиган жой ҳам фақат Сенгинадир.",
            "verse 60:5": "Эй Роббимиз, бизни кофирларга фитна қилиб қўймагин ва бизни кечиргин. Эй Роббимиз, албатта, Сен, Ўзинг азизу ҳакимсан.",
            "verse 60:6": "Албатта, кимнинг Аллоҳдан ва қиёмат кунидан умиди бўлса, шулар учун уларда яхши ўрнак бор эди. Лекин ким юз ўгирса, Аллоҳ беҳожат, мақталган зотдир.",
            "verse 60:7": "Шоядки, Аллоҳ сизлар билан улар ичидаги душманларингиз ўртасида дўстлик пайдо қилса, Аллоҳ қодирдир. Аллоҳ кечирувчи ва раҳмдилдир.",
            "verse 60:8": "Аллоҳ сизларни диний уруш қилмаган ва диёрларингиздан чиқармаганларга яхшилик ва адолатли муомала қилишдан сизларни қайтармас. Албатта, Аллоҳ адолат қилувчиларни яхши кўрадир.",
            "verse 60:9": "Албатта Аллоҳ сизларни диний уруш қилганлар, диёрингиздан чиқарганлар ва чиқарилишингизга ёрдам берганларга дўстлик қилишдан қайтарур. Уларни дўст тутганлар, ана ўшалар, золимлардир.",
            "verse 60:10": "Эй, иймон келтирганлар! Агар сизларга мўминалар ҳижрат қилиб келсалар, уларни имтиҳон қилиб кўринглар. Аллоҳ уларнинг иймонини билгувчидир. Бас, мўминаликларини билсангиз, уларни кофирларга қайтариб юборманг. Бу (аёл)лар уларга ҳалол эмас ва улар ҳам буларга ҳалол бўлмаслар. Ва у(кофир)ларга нафақа қилган нарсаларини (қайтариб) беринглар. Ва у(аёл)ларни никоҳлаб олсангиз, агар маҳрларини берсангиз, сизларга гуноҳ бўлмас. Кофир хотинларингизни никоҳларингизда ушлаб турманглар. Нафақа қилган нарсаларингизни сўранглар, улар ҳам нафақа қилган нарсаларини сўрасинлар. Бу сизларга Аллоҳнинг ҳукмидир. Орангизда ҳукм қиладир. Аллоҳ билгувчи ва ҳикматлидир.",
            "verse 60:11": "Агар аёлларингиздан бирортаси кофирларга ўтиб кетса, урушда туширилган ўлжадан хотини кетиб қолганга, у нафақа қилган миқдорни берингиз. Ўзингиз иймон келтирган Аллоҳдан қўрқинг.",
            "verse 60:12": "Эй Набий! Агар мўминалар сенга Аллоҳга ҳеч нарсани ширк келтирмаслик, ўғрилик қилмаслик, зино қилмаслик, болаларини ўлдирмаслик, қўллари ва оёқлари орасидан бўҳтон тўқиб келтирмаслик ва сенга яхшилик ишда исён қилмасликка байъат қилиб келсалар, уларнинг байъатини қабул қил. Ва Аллоҳдан уларнинг гуноҳини кечишни сўра. Албатта, Аллоҳ гуноҳларни кечирувчи ва меҳрибондир.",
            "verse 60:13": "Эй иймон келтирганлар! Аллоҳнинг ғазабига учраган қавмни дўст тутманглар. Кофирлар қабр эгаларидан умид узганларидек, улар ҳам охиратдан умид узганлар."
        },
        "Vietnamese": {
            "verse 60:1": "Này hỡi những người có đức tin! Các ngươi chớ lấy kẻ thù của TA và của các ngươi làm đồng minh. Các ngươi mở rộng tình cảm với chúng trong khi chúng vô đức tin nơi những gì đã đến với các ngươi từ Sự Thật. Chúng đã đánh đuổi Sứ Giả (Muhammad) và các ngươi chỉ vì các ngươi có đức tin nơi Allah, Thượng Đế của các ngươi. Nếu các ngươi ra đi để chiến đấu vì con đường Chính Nghĩa của TA và để tìm sự hài lòng nơi TA (thì chớ lấy chúng làm đồng minh). Các ngươi đã âm thầm mở rộng tình cảm với chúng và TA biết rõ những gì các ngươi giấu giếm và những gì các ngươi công khai. Và ai trong các ngươi làm điều đó thì chắc chắn đã lạc rất xa khỏi con đường (Chính Đạo).",
            "verse 60:2": "Nếu chúng giành được vị thế trên các ngươi, chúng sẽ coi các ngươi là kẻ thù, chúng sẽ hãm hại các ngươi bằng bàn tay và chiếc lưỡi của chúng và chúng mong các ngươi trở thành vô đức tin (giống như chúng).",
            "verse 60:3": "Người thân và con cái của các ngươi sẽ không bao giờ giúp ích được gì cho các ngươi. Vào Ngày Phán Xét Cuối Cùng, Ngài sẽ phân định giữa các ngươi. Quả thật, Allah thấy rõ những gì các ngươi làm.",
            "verse 60:4": "Thực sự đã có một tấm gương tốt cho các ngươi ở nơi Ibrahim và những ai theo Y khi họ nói với người dân của mình: “Quả thật, chúng tôi không dính dáng với các người cũng như những gì mà các người tôn thờ ngoài Allah. Chúng tôi phủ nhận các người. Giữa chúng tôi và các người sẽ có mối hiềm thù mãi mãi cho tới khi các người có đức tin nơi một mình Allah.” Ngoại trừ lời nói mà Ibrahim đã thưa với cha của Y: “Con chắc chắn sẽ cầu xin Allah tha thứ cho cha, nhưng con không có (quyền năng làm) cho cha bất cứ điều gì chống lại Allah. Lạy Thượng Đế của bầy tôi, bầy tôi xin phó thác cho Ngài và bầy tôi xin quay về sám hối với Ngài và Ngài là đích đến của bầy tôi”.",
            "verse 60:5": "“Lạy Thượng Đế của bầy tôi, xin Ngài đừng làm cho bầy tôi thành đối tượng hành hạ cho những kẻ vô đức tin, và xin Ngài tha thứ cho bầy tôi. Quả thật, Ngài là Đấng Chí Tôn, Đấng Thông Thái.”",
            "verse 60:6": "Quả thật, ở nơi họ có một tấm gương tốt cho các ngươi đối với bất kỳ ai hy vọng (điều tốt đẹp) nơi Allah và Ngày Sau. Và bất cứ ai quay lưng đi thì quả thật, Allah là Đấng Miễn Cần, Đấng Đáng Được Ca Tụng.",
            "verse 60:7": "Có lẽ Allah sẽ đặt tình cảm giữa các ngươi và những người mà các ngươi đã từng là kẻ thù của họ. Allah là Đấng Toàn Năng trên tất cả mọi thứ, và Allah là Đấng Tha Thứ, Đấng Nhân Từ.",
            "verse 60:8": "Allah không cấm các ngươi đối xử tử tế và công bằng với những người không chống lại các ngươi vì tôn giáo cũng như không trục xuất các ngươi khỏi nhà cửa của các ngươi. Quả thật, Allah yêu thương những người công bằng chính trực.",
            "verse 60:9": "Quả thật, Allah chỉ cấm các ngươi giao hảo với những kẻ chống lại các ngươi vì tôn giáo và trục xuất các ngươi khỏi nhà cửa của các ngươi cũng như những ai tiếp tay trong việc trục xuất các ngươi để làm đồng minh của chúng. Và bất cứ ai làm đồng minh của chúng thì đó là những kẻ làm điều sai quấy.",
            "verse 60:10": "Hỡi những người có đức tin! Khi những phụ nữ có đức tin chạy đến tị nạn với các ngươi thì các ngươi hãy kiểm tra họ. Allah biết rõ về đức tin của họ. Nếu các ngươi đã biết rõ họ là những người có đức tin thì các ngươi chớ giao trả họ lại cho những kẻ vô đức tin. Họ không còn là những người (vợ) hợp pháp của chúng và chúng cũng không là những (người chồng) hợp pháp của họ, nhưng các ngươi hãy trao cho chúng những gì mà chúng đã chi ra (cho người vợ của chúng). Các ngươi không có tội nếu các ngươi kết hôn với họ khi các ngươi trao tặng họ tiền cưới bắt buộc. Các ngươi chớ ràng buộc hôn nhân với những người phụ nữ vô đức tin, các ngươi có quyền đòi lại tiền cưới mà các ngươi chi ra, ngược lại, hãy để chúng đòi lại những gì mà chúng đã chi ra. Đó là luật của Allah, Ngài dùng nó để phân xử giữa các ngươi, và Allah là Đấng Toàn Tri, Đấng Thông Thái.",
            "verse 60:11": "Nếu người vợ nào của các ngươi bỏ các ngươi để đến với những kẻ vô đức tin và sau đó các ngươi có được cơ hội tương xứng (khi có những người phụ nữ của chúng bỏ chúng chạy đến với các ngươi) thì các ngươi hãy trao trả cho những người mà vợ của chúng đã rời bỏ chúng một khoản tiền tương đương với tiền cưới mà chúng đã chi ra. Các ngươi hãy kính sợ Allah, Đấng mà các ngươi có đức tin nơi Ngài.",
            "verse 60:12": "Này hỡi Nabi! Khi những người phụ nữ có đức tin đến gặp ngươi, cam kết với Ngươi rằng họ sẽ không Shirk với Allah bất kỳ thứ gì, họ sẽ không trộm cắp, không Zina, không giết con cái của mình, không vu khống người khác, không đặt điều dối trá giữa tay và chân của họ (rằng đứa con ngoại tình là của chồng), và sẽ không bất tuân Ngươi về bất cứ điều thiện tốt nào, Ngươi hãy chấp nhận lời cam kết của họ và cầu xin Allah tha thứ cho họ. Quả thật, Allah là Đấng Tha Thứ, Đấng Nhân Từ.",
            "verse 60:13": "Hỡi những người có đức tin! Các ngươi chớ là đồng minh của nhóm người mà Allah đã giận dữ đối với họ. Quả thật, họ đã tuyệt vọng về Đời Sau giống như những kẻ vô đức tin đang tuyệt vọng trong mộ (của họ)."
        },
        "Yoruba": {
            "verse 60:1": "Eyin ti e gbagbo ni ododo, e ma se mu ota Mi ati ota yin ni ore ti e oo maa fi ife han si. Won kuku ti sai gbagbo ninu ohun ti o de ba yin ninu ododo. Won yo Ojise ati eyin naa kuro ninu ilu nitori pe, e gbagbo ninu Allahu, Oluwa yin. Ti eyin ba jade fun ogun nitori esin Mi ati nitori wiwa iyonu Mi, (se) eyin yoo tun maa ni ife koro si won ni! Emi si nimo julo nipa ohun ti e fi pamo ati ohun ti e fi han. Enikeni ti o ba se bee ninu yin, dajudaju o ti sina kuro loju ona taara",
            "verse 60:2": "Ti owo won ba ba yin, won maa di ota fun yin. Won yo si fi owo won ati ahon won nawo aburu si yin. Won si maa fe ki o je pe e di alaigbagbo",
            "verse 60:3": "Awon ebi yin ati awon omo yin ko le se yin ni anfaani; ni Ojo Ajinde ni Allahu maa sepinya laaarin yin. Allahu si ni Oluriran nipa ohun ti e n se nise",
            "verse 60:4": "Dajudaju awokose rere ti wa fun yin ni ara (Anabi) ’Ibrohim ati awon t’o wa pelu re. Nigba ti won so fun ijo won pe: \"Dajudaju awa yowo-yose kuro ninu oro yin ati ohun ti e n josin fun leyin Allahu. A tako yin. Ota ati ikorira si ti han laaarin wa titi laelae ayafi igba ti e ba to gbagbo ninu Allahu nikan soso. - Afi oro ti (Anabi) ’Ibrohim so fun baba re pe: \"Dajudaju mo maa toro aforijin fun o, emi ko si ni ikapa kini kan fun o lodo Allahu. - Oluwa wa, Iwo l’a gbarale. Odo Re l’a seri pada si (nipa ironupiwada). Odo Re si ni abo eda",
            "verse 60:5": "Oluwa wa, ma se wa ni adanwo fun awon t’o sai gbagbo. Forijin wa, Oluwa wa. Dajudaju Iwo ni Alagbara, Ologbon",
            "verse 60:6": "Dajudaju awokose rere ti wa fun yin ni ara won fun eni t’o n reti (esan) Allahu ati Ojo Ikeyin. Enikeni ti o ba peyin da, dajudaju Allahu, Oun ni Oloro, Eleyin",
            "verse 60:7": "O le je pe Allahu yoo fi ife si aarin eyin ati awon ti e mu ni ota ninu won (iyen, nigba ti won ba di musulumi). Allahu ni Alagbara. Allahu si ni Alaforijin, Asake-orun",
            "verse 60:8": "Allahu ko ko fun yin nipa awon ti ko gbe ogun ti yin nipa esin, ti won ko si le yin jade kuro ninu ilu yin, pe ki e se daadaa si won, ki e si se deede si won. Dajudaju Allahu feran awon oluse-deede",
            "verse 60:9": "Ohun ti Allahu ko fun yin nipa awon t’o gbogun ti yin ninu esin, ti won si le yin jade kuro ninu ilu yin, ti won tun se iranlowo (fun awon ota yin) lati le yin jade, ni pe (O ko fun yin) lati mu won ni ore. Enikeni ti o ba mu won ni ore, awon wonyen, awon ni alabosi",
            "verse 60:10": "Eyin ti e gbagbo ni ododo, nigba ti awon onigbagbo ododo lobinrin ba wa ba yin, ti won gbe ilu awon alaigbagbo ju sile fun aabo esin won, e bi won ni ibeere. Allahu nimo julo nipa igbagbo won. Nitori naa, ti e ba mo won si onigbagbo ododo, e ma se da won pada si odo awon alaigbagbo. Awon onigbagbo ododo lobinrin ko letoo si won. Awon alaigbagbo lokunrin ko si letoo si won. E fun (awon alaigbagbo lokunrin) ni owo ti won na (ni owo-ori obinrin naa). Ko si si ese fun eyin naa pe ki e fe won nigba ti e ba ti fun (awon obinrin wonyi) ni owo-ori won. E ma se fi owo-ori awon obinrin yin ti won je alaigbagbo mu won mole (gege bi iyawo yin lai je pe won gba ’Islam pelu yin). E beere ohun ti e na (ni owo-ori won lowo alaigbagbo lokunrin ti won sa lo ba). Ki awon (alaigbagbo lokunrin naa) beere ohun ti awon naa na (ni owo-ori won lowo eyin ti onigbagbo ododo lobinrin sa wa ba). Iyen ni idajo Allahu. O si n dajo laaarin yin. Allahu si ni Onimo, Ologbon",
            "verse 60:11": "Ti kini kan lati odo awon iyawo yin ba bo mo yin lowo si odo awon alaigbagbo, ti e si kore ogun, e fun awon ti iyawo won sa lo ni iru odiwon ohun ti won na (ni owo-ori). Ki e si beru Allahu, Eni ti eyin ni igbagbo ododo ninu Re",
            "verse 60:12": "Iwo Anabi, nigba ti awon onigbagbo ododo lobinrin ba wa ba o, ti won n se adehun fun o pe awon ko nii fi kini kan sebo si Allahu, awon ko nii jale, awon ko nii se sina, awon ko nii pa omo won, awon ko nii mu adapa iro wa, adapa iro ti won n mu wa laaarin owo won ati ese won (iyen ni gbigbe oyun oloyun fun oko won), awon ko si nii yapa re nibi nnkan daadaa, nigba naa ba won se adehun, ki o si ba won toro aforijin lodo Allahu. Dajudaju Allahu ni Alaforijin, Asake-orun",
            "verse 60:13": "Eyin ti e gbagbo ni ododo, e ma se mu ijo kan ti Allahu ti binu si ni ore. Dajudaju won ti soreti nu nipa orun, gege bi awon alaigbagbo t’o wa ninu saree (se soreti nu nipa ike)"
        }
    }
}