{
    "id": 61,
    "name_simple": "As-Saf",
    "revelation_place": "madinah",
    "revelation_order": 109,
    "bismillah_pre": true,
    "verses_count": 14,
    "short_text": "The Surah derives its name from the sentence yuqatiluna fi sabil-i- hlsaff-an of verse 4; thereby implying that it is a Surah in which the word saff occurred.",
    "text": [
        "\n",
        "The Surah derives its name from the sentence yuqatiluna fi sabil-i- hlsaff-an of verse 4; thereby implying that it is a Surah in which the word saff occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "It could not be known from any reliable tradition, but a study of its subject-matter shows that this Surah probably was sent down in the period closely following the Battle of Uhud, for by reading between the lines perceives a clear description of the conditions that prevailed in that period.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to exhort the Muslims to adopt sincerity in Faith and to struggle with their lives in the cause of Allah. It is addressed to the Muslims with weak faith as well as those who had entered Islam with a false profession of the Faith and also those who were sincere in their profession. Some verses are addressed to the first two groups, some only to the hypocrites, and some only to the sincere Muslims. The style itself shows where one particular group has been addressed and where the other.",
        "\n",
        "At the outset the believers have been warned to the effect; \"Allah indeed hates those people who say one thing and do another, and He indeed loves. those who fight in the cause of the Truth, standing like a solid structure, against the enemies of Allah.\"'",
        "\n",
        "In vv. 5-7 the people of the Holy Prophet's community have been warned that their attitude towards their Messenger and their Religion should not be like the attitude that the Israelites had adopted towards the Prophets Moses and Jesus (peace be upon them). In spite of acknowledging the Prophet Moses as a Messenger of God they continued to malign him as long as he lived, and in spite of witnessing clear signs from the Prophet Jesus they denied him without any hesitation. Consequently, the Israelites became perverse, incapable of benefiting from divine guidance. This is certainly not an enviable state which another nation should imitate.",
        "\n",
        "Then, in vv. 8-9 a proclamation has been made with the challenge:\"The Jews and the Christians, and the hypocrites, who are conspiring with them, may try however hard they may to extinguish this Light of Allah, it will shine forth and spread in the world in all its fullness, and the Religion brought by the true Messenger of Allah shall prevail over every other religion however hateful it may be to the pagans and polytheists.",
        "\n",
        "In vv. 10-13, the believers have been told that the way to success both here and in the Hereafter is only one: that they should believe in Allah and His Messenger sincerely and should exert their utmost in Allah's Way with their selves and their wealth. As a reward for this they will earn immunity from Allah's punishment, forgiveness of their sins and the eternal Paradise in the Hereafter, and will be blessed with Allah's good pleasure, succor and victory in the world.",
        "\n",
        "In conclusion, the believers have been exhorted to' the effect that just as the disciples of the Prophet Jesus had helped him in the cause of Allah, so should they also become \"helpers of Allah\", so that they too are blessed with the same kind of good pleasure and approval of Allah as had been the believers before them against the disbelievers.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that declares God’s love of all those believers who maintain the solid Ranks or lines of unreachable communal unity in selflessly and fearlessly defending God’s cause against aggression. It takes its name from verse 4, in whicn the word “ranks” (ṣa) occurs. The surah encouraging the believers to stick together in support of God’s cause and criticizes those who broke their word (verse 3) and those who argued against the faith (verse 7 .). Moses and Jesus are cited as examples of prophets whose communities were divided: the rebellious were left to stray and the faithful granted success (verse 5 . and verse 14). The rewards of those who strive in God’s cause are described in some detail (verse 11 .).The surah is also known as: Formations, Solid Lines, The Battle Array, The Solid Ranks.",
    "name_translation": "Ranks",
    "name_complex": "As-Saff",
    "surah_name_ar": "الصف",
    "verses": {
        "Albanian": {
            "verse 61:1": "Perëndinë e falenderon çka gjendet në qiej dhe çka gjendet në Tokë. Ai është i Plotëfuqishëm dhe i Gjithëdijshëm.",
            "verse 61:2": "O besimtarë, përse flisni atë që nuk e punoni?",
            "verse 61:3": "Është neveri e madhe te Perëndia të thoni atë që nuk e punoni!",
            "verse 61:4": "Me të vërtetë, Perëndia i don ata që luftojnë në rrugën e Tij, të radhitur si një godinë e lidhur fortë.",
            "verse 61:5": "Kur Musai i tha popullit të vet: “O populli im, përse po më mundoni, kur mirë e dini se unë jam profeti i Perëndisë te ju!” E, pasi ata u shmangën – Perëndia u shmangu zemrat e tyre; - e Perëndia, nuk e shpie në rrugë të drejtë atë popull që është zhytur në mëkate.",
            "verse 61:6": "E kur Isai, i biri i Merjemës, ka thënë: “O bijtë e Israelit, unë u jam profet i Perëndisë te ju, për t’ju vërtetuar Teuratin e shpallur para meje dhe për t’ju sjellë lajmin e gëzueshëm për profetin, emrin e të cilit është Ahmed, që do të vijë pas meje; dhe kur ai u solli atyre argumente të qarta, ata thanë: “Kjo është magji e qartë!”",
            "verse 61:7": "E, kush është më zullumqarë se ai që shpif gënjeshtra kundër Zotit, duke u thirrur në fé të vërtetë? – E Perëndia nuk e shpie në rrugë të drejtë popullin zullumqarë (që bën padrejtësi).",
            "verse 61:8": "Ata dëshirojnë të fikin dritën e Perëndisë, me gojën e tyre, e Perëndia – e përsos dritën e Vet, edhe, nëse e urrejnë mohuesit.",
            "verse 61:9": "Perëndia është Ai, që ka dërguar Profetin e Vet me udhëzim për rrugën e drejtë dhe fenë e vërtetë, për ta ngritur më lartë se të gjitha fetë, edhe nëse e urrejnë paganët.",
            "verse 61:10": "O besimtarë, a doni t’ju orientojë në një tregti, e cila ju shpëton nga vuajtja e dhembshme:",
            "verse 61:11": "Besoni në Perëndinë dhe në Profetin e Tij, dhe luftoni në rrugën e Perëndisë me pasurinë dhe trupin tuaj. – Kjo është më mirë për ju, - nëse e dini.",
            "verse 61:12": "Ai do t’ju falë gabimet tuaja dhe do t’ju shpie në kopshte, nëpër të cilat rrjedhin lumenjt, dhe në pallate – të mrekullueshme – në xhennetin e Adnit, - e ky është sukses i madh, -",
            "verse 61:13": "E tjetrën (dhunti) që e doni ju: Ndihma e Perëndisë dhe fitorja e afërt! Andaj, sihariqoji besimtarët!",
            "verse 61:14": "O besimtarë, bëhuni ndihmësit e besimit të Perëndisë, ashtu siç u ka thënë Isai, i biri i Merjemës, nxënësve (apostujve të tij): “Kush janë ndihmësit e mi te Perëndia? Apostujt, u përgjegjën: “Ne jemi ndihmësit e Perëndisë!” – Dhe, kanë besuar një grup nga bijtë e Israelit, e një grup tjetër kanë mohuar; - andaj Ne i kemi forcuar (ndihmuar) besimtarët kundër armikut të tyre dhe ata u bënë fitues."
        },
        "Amharic": {
            "verse 61:1": "በሰማያት ውስጥ ያለው በምድርም ውስጥ ያለው ሁሉ ለአላህ አሞገሠ፡፡ እርሱም አሸናፊው ጥበበኛው ነው፡፡",
            "verse 61:2": "እላንተ ያመናችሁ ሆይ! የማትሠሩትን ነገር ለምን ትናገራላችሁ?",
            "verse 61:3": "የማትሠሩን ነገር መናገራችሁ አላህ ዘንድ መጠላቱ ተለቀ፡፡",
            "verse 61:4": "አላህ እነዚያን እነርሱ ልክ እንደ ተናሰ ግንብ የተሰለፉ ኾነው በመንገዱ (በሃይማኖቱ) የሚጋደሉትን ይወዳል፡፡",
            "verse 61:5": "ሙሳም ለሕዝቦቹ «ሕዝቦቼ ሆይ! እኔ ወደእናንተ የአላህ መልክተኛ መኾኔን በእርግጥ የምታውቁ ስትኾኑ ለምን ታሰቃዩኛላችሁ?» ባለ ጊዜ (አስታውስ፡፡ ከእውነት) በተዘነበሉም ጊዜ አላህ ልቦቻቸውን አዘነበላቸው፡፡ አላህም አመጸኞችን ሕዝቦች አያቀናም፡፡",
            "verse 61:6": "የመርየም ልጅ ዒሳም፡- «የእስራኤል ልጆች ሆይ! እኔ ከተውራት በፊቴ ያለውን የማረጋግጥና ከእኔ በኋላ በሚመጣው መልክተኛ ስሙ አሕመድ በኾነው የማበስር ስኾን ወደእናንተ (የተላክሁ) የአላህ መልክተኛ ነኝ» ባለ ጊዜ (አስታውስ)፡፡ በግልጽ ተዓምራቶች በመጣቸውም ጊዜ «ይህ ግልጽ ድግምት ነው» አሉ፡፡",
            "verse 61:7": "እርሱ ወደ ኢስላም የሚጥጠራ ሲኾን በአላህ ላይ ውሸትን ከቀጣጠፈ ሰውም ይበልጥ በደለኛ ማን ነው? አላህም በዳዮችን ሕዝቦች አይመራም፡፡",
            "verse 61:8": "የአላህን ብርሃን በአፎቻቸው ሊያጠፉ ይሻሉ፡፡ አላህም ከሓዲዎቹ ቢጠሉም እንኳ ብርሃኑን ገላጭ ነው፡፡",
            "verse 61:9": "እርሱ ያ አጋሪዎቹ ቢጠሉም መልክተኛውን በመምሪያ (መጽሐፍ) በእውነተኛው ሃይማኖትም (በኢስላም) ከሃይማኖት ሁሉ በላይ ይፋ ሊያደርገው የላከ ነው፡፡",
            "verse 61:10": "«እናንተ ያመናችሁ ሆይ! ከአሳማሚ ቅጣት የምታድናችሁ የኾነችን ንግድ ላመላክታችሁን?» (በላቸው)፡፡",
            "verse 61:11": "(እርሷም) በአላህና በመልክተኛው ታምናላችሁ፣ በአላህ መንገድም በገንዘቦቻችሁ በነፍሶቻችሁም ትታገላላችሁ፣ ይህ የምታውቁ ብትኾኑ ለእናንተ የተሻለ ነው፡፡",
            "verse 61:12": "ኃጢኣቶቻችሁን ለእናንተ ይምራል፡፡ ከሥሮቻቸው ወንዞች የሚፈሱባቸውንም ገነቶች ያገባችኋል፡፡ በመኖሪያ ገነቶችም በሚያማምሩ ቤቶች ውስጥ (ያስቀምጣችኋል)፡፡ ይህ ታላቅ ዕድል ነው፡፡",
            "verse 61:13": "ሌላይቱንም የምትወዷትን (ጸጋ ይሰጣችኋለ)፡፡ ከአላህ የኾነ እርዳታና ቅርብ የኾነ የአገር መክፈት ነው፡፡ ምእምናንንም አብስር፡፡",
            "verse 61:14": "እናንተ ያመናችሁ ሆይ! የመርየም ልጅ ዒሳ ለሐዋርያቶቹ «ወደ አላህ ረዳቴ ማነው?» እንዳለ ሐወርያቶቹም «እኛ የአላህ ረዳቶች ነን» እንዳሉት የአላህ ረዳቶች ኹኑ፡፡ ከእስራኤልም ልጆች አንደኛዋ ጭፍራ አመነች፡፡ ሌላይቱም ጭፍራ ካደች፡፡ እነዚያን ያመኑትንም በጠላታቸው ላይ አበረታናቸው፤ አሸናፊዎችም ኾኑ፡፡"
        },
        "Arabic": {
            "verse 61:1": "ُميِكَحْلا ُزيِزَعْلا َوُهَو ۖ ِضْرَأْلا يِف اَمَو ِتاَواَمَّسلا يِف اَم ِهَّلِل َحَّبَس",
            "verse 61:2": "َنوُلَعْفَت اَل اَم َنوُلوُقَت َمِل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 61:3": "َنوُلَعْفَت اَل اَم اوُلوُقَت نَأ ِهَّللا َدنِع اًتْقَم َرُبَك",
            "verse 61:4": "ٌصوُصْرَّم ٌناَيْنُب مُهَّنَأَك اًّفَص ِهِليِبَس يِف َنوُلِتاَقُي َنيِذَّلا ُّبِحُي َهَّللا َّنِإ",
            "verse 61:5": "َنيِقِساَفْلا َمْوَقْلا يِدْهَي اَل ُهَّللاَو ۚ ْمُهَبوُلُق ُهَّللا َغاَزَأ اوُغاَز اَّمَلَف ۖ ْمُكْيَلِإ ِهَّللا ُلوُسَر يِّنَأ َنوُمَلْعَّت دَقَو يِنَنوُذْؤُت َمِل ِمْوَق اَي ِهِمْوَقِل ٰىَسوُم َلاَق ْذِإَو",
            "verse 61:6": "ٌنيِبُّم ٌرْحِس اَذَٰه اوُلاَق ِتاَنِّيَبْلاِب مُهَءاَج اَّمَلَف ۖ ُدَمْحَأ ُهُمْسا يِدْعَب نِم يِتْأَي ٍلوُسَرِب اًرِّشَبُمَو ِةاَرْوَّتلا َنِم َّيَدَي َنْيَب اَمِّل اًقِّدَصُّم مُكْيَلِإ ِهَّللا ُلوُسَر يِّنِإ َليِئاَرْسِإ يِنَب اَي َمَيْرَم ُنْبا ىَسيِع َلاَق ْذِإَو",
            "verse 61:7": "َنيِمِلاَّظلا َمْوَقْلا يِدْهَي اَل ُهَّللاَو ۚ ِماَلْسِإْلا ىَلِإ ٰىَعْدُي َوُهَو َبِذَكْلا ِهَّللا ىَلَع ٰىَرَتْفا ِنَّمِم ُمَلْظَأ ْنَمَو",
            "verse 61:8": "َنوُرِفاَكْلا َهِرَك ْوَلَو ِهِروُن ُّمِتُم ُهَّللاَو ْمِهِهاَوْفَأِب ِهَّللا َروُن اوُئِفْطُيِل َنوُديِرُي",
            "verse 61:9": "َنوُكِرْشُمْلا َهِرَك ْوَلَو ِهِّلُك ِنيِّدلا ىَلَع ُهَرِهْظُيِل ِّقَحْلا ِنيِدَو ٰىَدُهْلاِب ُهَلوُسَر َلَسْرَأ يِذَّلا َوُه",
            "verse 61:10": "(ٍميِلَأ ٍباَذَع ْنِّم مُكيِجنُت ٍةَراَجِت ٰىَلَع ْمُكُّلُدَأ ْلَه اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 61:11": "(َنوُمَلْعَت ْمُتنُك نِإ ْمُكَّل ٌرْيَخ ْمُكِلَٰذ ۚ ْمُكِسُفنَأَو ْمُكِلاَوْمَأِب ِهَّللا ِليِبَس يِف َنوُدِهاَجُتَو ِهِلوُسَرَو ِهَّللاِب َنوُنِمْؤُت",
            "verse 61:12": "(ُميِظَعْلا ُزْوَفْلا َكِلَٰذ ۚ ٍنْدَع ِتاَّنَج يِف ًةَبِّيَط َنِكاَسَمَو ُراَهْنَأْلا اَهِتْحَت نِم يِرْجَت ٍتاَّنَج ْمُكْلِخْدُيَو ْمُكَبوُنُذ ْمُكَل ْرِفْغَي",
            "verse 61:13": "(َنيِنِمْؤُمْلا ِرِّشَبَو ۗ ٌبيِرَق ٌحْتَفَو ِهَّللا َنِّم ٌرْصَن ۖ اَهَنوُّبِحُت ٰىَرْخُأَو",
            "verse 61:14": "(َنيِرِهاَظ اوُحَبْصَأَف ْمِهِّوُدَع ٰىَلَع اوُنَمآ َنيِذَّلا اَنْدَّيَأَف ۖ ٌةَفِئاَّط تَرَفَكَو َليِئاَرْسِإ يِنَب نِّم ٌةَفِئاَّط تَنَمآَف ۖ ِهَّللا ُراَصنَأ ُنْحَن َنوُّيِراَوَحْلا َلاَق ۖ ِهَّللا ىَلِإ يِراَصنَأ ْنَم َنيِّيِراَوَحْلِل َمَيْرَم ُنْبا ىَسيِع َلاَق اَمَك ِهَّللا َراَصنَأ اوُنوُك اوُنَمآ َنيِذَّلا اَهُّيَأ اَي"
        },
        "Azerbaijani": {
            "verse 61:1": "Göylərdə və yerdə olanların hamısı Allahın şəninə təriflər deyir. O, Qüdrətlidir, Müdrikdir.",
            "verse 61:2": "Ey iman gətirənlər! Nə üçün siz etməyəcəyiniz şeyləri danışırsınız?",
            "verse 61:3": "Etməyəcəyiniz şeylərdən danışmağınız Allah tərəfindən böyük nifrətlə qarşılanır.",
            "verse 61:4": "Şübhəsiz ki, Allah möhkəm bir divar kimi səf-səf düzülüb Onun yolunda vuruşanları sevir.",
            "verse 61:5": "Bir zaman Musa öz qövmünə demişdi: “Ey qövmüm! Nə üçün mənə əziyyət verirsiniz? Axı siz bilirsiniz ki, mən Allahın sizə göndərdiyi elçisiyəm!” Onlar doğru yoldan sapdıqda, Allah da onların qəlbini sapdırdı. Allah fasiqləri doğru yola yönəltməz.",
            "verse 61:6": "Bir zaman Məryəm oğlu İsa demişdi: “Ey İsrail oğulları! Həqiqətən, mən Allahın sizə göndərdiyi, məndən əvvəl nazil edilmiş Tövratı təsdiqləyən və məndən sonra gələcək Əhməd adlı peyğəmbərlə sizi müjdələyən bir elçisiyəm!” Allahın elçisi onlara açıq-aydın dəlillər gətirdikdə onlar: “Bu, aşkar bir sehrdir!”– dedilər.",
            "verse 61:7": "İslama dəvət edildiyi halda, Allaha qarşı yalan uydurandan daha zalım kim ola bilər? Allah zalım adamları doğru yola yönəltməz.",
            "verse 61:8": "Onlar Allahın nurunu öz ağızlarından çıxanlarla söndürmək istəyirlər. Halbuki kafirlərin xoşuna gəlməsə də, Allah Öz nurunu tamamlayacaqdır.",
            "verse 61:9": "Müşriklərin xoşuna gəlməsə də, İslam dinini bütün dinlərdən üstün etmək məqsədilə Öz Elçisini hidayət və haqq dinlə göndərən Odur.",
            "verse 61:10": "Ey iman gətirənlər! Sizi ağrılı-acılı əzabdan xilas edəcək bir ticarəti sizə bildirimmi?",
            "verse 61:11": "Allaha və Onun Elçisinə iman gətirin, Allah yolunda malınız və canınızla cihad edin. Bilsəniz, bu sizin üçün nə qədər xeyirlidir.",
            "verse 61:12": "Bu təqdirdə O sizin günahlarınızı bağışlayar və sizi ağacları altından çaylar axan Cənnət bağlarına və Ədn bağlarındakı gözəl məskənlərə daxil edər. Bu, böyük müvəffəqiyyətdir.",
            "verse 61:13": "Sevdiyiniz başqa şey də vardır: Allah tərəfindən kömək və yaxın qələbə. Möminləri bununla müjdələ.",
            "verse 61:14": "Ey iman gətirənlər! Allahın köməkçiləri olun. Necə ki, Məryəm oğlu İsa həvarilərə: “Allah yolunda kimlər mənə köməkçi olacaq?”– demiş, həvarilər də: “Bizik Allahın köməkçiləri!”– demişdilər. İsrail oğullarından bir zümrə iman gətirdi, digər bir zümrə isə kafir oldu. Biz də iman gətirənləri düşmənlərinə qarşı qüvvətləndirdik və onlar üstün gəldilər."
        },
        "Bengali": {
            "verse 61:1": "নভোমন্ডলে ও ভূমন্ডলে যা কিছু আছে, সবই আল্লাহর পবিত্রতা ঘোষণা করে। তিনি পরাক্রান্ত প্রজ্ঞাবান।",
            "verse 61:2": "মুমিনগণ! তোমরা যা কর না, তা কেন বল?",
            "verse 61:3": "তোমরা যা কর না, তা বলা আল্লাহর কাছে খুবই অসন্তোষজনক।",
            "verse 61:4": "আল্লাহ তাদেরকে ভালবাসেন, যারা তাঁর পথে সারিবদ্ধভাবে লড়াই করে, যেন তারা সীসাগালানো প্রাচীর।",
            "verse 61:5": "স্মরণ কর, যখন মূসা (আঃ) তাঁর সম্প্রদায়কে বললঃ হে আমার সম্প্রদায়, তোমরা কেন আমাকে কষ্ট দাও, অথচ তোমরা জান যে, আমি তোমাদের কাছে আল্লাহর রসূল। অতঃপর তারা যখন বক্রতা অবলম্বন করল, তখন আল্লাহ তাদের অন্তরকে বক্র করে দিলেন। আল্লাহ পাপাচারী সম্প্রদায়কে পথপ্রদর্শন করেন না।",
            "verse 61:6": "স্মরণ কর, যখন মরিয়ম-তনয় ঈসা (আঃ) বললঃ হে বনী ইসরাইল! আমি তোমাদের কাছে আল্লাহর প্রেরিত রসূল, আমার পূর্ববর্তী তওরাতের আমি সত্যায়নকারী এবং আমি এমন একজন রসূলের সুসংবাদদাতা, যিনি আমার পরে আগমন করবেন। তাঁর নাম আহমদ। অতঃপর যখন সে স্পষ্ট প্রমাণাদি নিয়ে আগমন করল, তখন তারা বললঃ এ তো এক প্রকাশ্য যাদু।",
            "verse 61:7": "যে ব্যক্তি ইসলামের দিকে আহুত হয়েও আল্লাহ সম্পর্কে মিথ্যা বলে; তার চাইতে অধিক যালেম আর কে? আল্লাহ যালেম সম্প্রদায়কে পথ প্রদর্শন করেন না।",
            "verse 61:8": "তারা মুখের ফুঁৎকারে আল্লাহর আলো নিভিয়ে দিতে চায়। আল্লাহ তাঁর আলোকে পূর্ণরূপে বিকশিত করবেন যদিও কাফেররা তা অপছন্দ করে।",
            "verse 61:9": "তিনি তাঁর রসূলকে পথ নির্দেশ ও সত্যধর্ম নিয়ে প্রেরণ করেছেন, যাতে একে সবধর্মের উপর প্রবল করে দেন যদিও মুশরিকরা তা অপছন্দ করে।",
            "verse 61:10": "মুমিনগণ, আমি কি তোমাদেরকে এমন এক বানিজ্যের সন্ধান দিব, যা তোমাদেরকে যন্ত্রণাদায়ক শাস্তি থেকে মুক্তি দেবে?",
            "verse 61:11": "তা এই যে, তোমরা আল্লাহ ও তাঁর রসূলের প্রতি বিশ্বাস স্থাপন করবে এবং আল্লাহর পথে নিজেদের ধন-সম্পদ ও জীবনপণ করে জেহাদ করবে। এটাই তোমাদের জন্যে উত্তম; যদি তোমরা বোঝ।",
            "verse 61:12": "তিনি তোমাদের পাপরাশি ক্ষমা করবেন এবং এমন জান্নাতে দাখিল করবেন, যার পাদদেশে নদী প্রবাহিত এবং বসবাসের জান্নাতে উত্তম বাসগৃহে। এটা মহাসাফল্য।",
            "verse 61:13": "এবং আরও একটি অনুগ্রহ দিবেন, যা তোমরা পছন্দ কর। আল্লাহর পক্ষ থেকে সাহায্য এবং আসন্ন বিজয়। মুমিনদেরকে এর সুসংবাদ দান করুন।",
            "verse 61:14": "মুমিনগণ, তোমরা আল্লাহর সাহায্যকারী হয়ে যাও, যেমন ঈসা ইবনে-মরিয়ম তার শিষ্যবর্গকে বলেছিল, আল্লাহর পথে কে আমার সাহায্যকারী হবে? শিষ্যবর্গ বলেছিলঃ আমরা আল্লাহর পথে সাহায্যকারী। অতঃপর বনী-ইসরাঈলের একদল বিশ্বাস স্থাপন করল এবং একদল কাফের হয়ে গেল। যারা বিশ্বাস স্থাপন করেছিল, আমি তাদেরকে তাদের শত্রুদের মোকাবেলায় শক্তি যোগালাম, ফলে তারা বিজয়ী হল।"
        },
        "Berber Amazigh": {
            "verse 61:1": "Sbuccuâen Öebbi, kra illan deg igenwan, akked kra illan di tmurt. Neppa d Uzmir, d Bab n ûûwab.",
            "verse 61:2": "A wid iumnen! Acimi id teqqaôem ayen ur txeddmem?",
            "verse 61:3": "D lâaô meqqwôen, ar Öebbi, ma teqqaôem ayen ur txeddmem.",
            "verse 61:4": "Ih, Öebbi Iêemmel wid ipna$en deg ubrid iS, d ûûef, nitni, amzun d lebni, iéevêen.",
            "verse 61:5": "Mi inna Musa i ugdud is: \"a yagdud iw! Acimi la yi teîîuôum, u ni$ teéôam nek d amazan n Öebbi $uôwen\"? Mi ff$en i ubrid, Öebbi Issuffe$ i ubrid ulawen nnsen. Öebbi ur Inehhu ara agdud iballa$en.",
            "verse 61:6": "Mi inna Âisa, mmi s n Meryem: \"A yAt Isôail! Nek d amazan n Öebbi $uôwen, ad tebbte$ ayen iyi d izwaren n Tuôa. U a kwen beccôe$ s Umazan ara d iasen, deffir i, ism is Aêmed\". Mi ten id iusa s ubeggen, nnan: \"wagi d ssêur n ûûeê\".",
            "verse 61:7": "Anwa idensen sennig win id igren tikerkas af Öebbi, u neppa ipwanced ar wannuz? Öebbi ur Inehhu agdud imednas.",
            "verse 61:8": "B$an ad ssexsin tafat n Öebbi, s imawen nnsen. Öebbi ad Itim tafat iS, di nneqwma ijehliyen.",
            "verse 61:9": "D Neppa id Iuznen Amazan iS, s nnhaya, d ddin n tidep, iwakken a t issifrir f ddin meôôa, di nneqwma ijehliyen.",
            "verse 61:10": "A wid iumnen! Ma d awen Mle$ ssuq ara kwen isellken seg uâaqeb aqeôêan?",
            "verse 61:11": "Amnet s Öebbi akked Umazan iS. Nna$et deg ubrid n Öebbi s wayla nnwen, u s yiman nnwen; ppif akka i kunwi, lemmer tessinem.",
            "verse 61:12": "Ad awen Isemmeê ibekkaven nnwen; a kwen Issekcem ar leonanat degsen isaffen ppazzalen, tinezdu$in igerzen, di leonanat n Âaden; d wagi ay d rrbeê ameqwôaêan.",
            "verse 61:13": "Ayen têemmlem nniven: afus s$uô Öebbi akked l$elb aqôib. Ssefôeê lmumnin.",
            "verse 61:14": "A wid iumnen! Illit d iwiziwen n Öebbi, akken inna Âisa, mmi s n Meryem, i inmahalen is: \"anwi ay d iwiziwen iw ar Öebbi\"? Nnan d inmahalen: \"nekwni d iwiziwen n Öebbi\". Tumen terbaât, tejhel terbaât, n At Isôail. Nefka afus i wid iumnen, mgal icenga nnsen, d$a rebêen."
        },
        "Bosnian": {
            "verse 61:1": "Allaha hvali ono što je na nebesima i ono što je na Zemlji, On je Silni i Mudri!",
            "verse 61:2": "O vjernici, zašto jedno govorite, a drugo radite?",
            "verse 61:3": "O, kako je Allahu mrsko kada govorite riječi koje djela ne prate!",
            "verse 61:4": "Allah voli one koji se na Njegovu putu bore u redovima kao da su bedem čvrsti.",
            "verse 61:5": "Kada Musa reče narodu svome: \"O narode moj, zašto me mučite, a dobro znate da sam ja Allahov poslanik vama!\" – i kad oni skrenuše u stranu, Allah učini da i srca njihova u stranu skrenu – a Allah neće ukazati na Pravi put narodu koji je ogrezao u grijehu.",
            "verse 61:6": "A kada Isa, sin Merjemin, reče: \"O sinovi Israilovi, ja sam vam Allahov poslanik da vam potvrdim prije mene objavljeni Tevrat i da vam donesem radosnu vijest o poslaniku čije je ime Ahmed, koji će poslije mene doći\" – i kad im je on donio jasne dokaze, oni rekoše: \"Ovo je prava vradžbina!\"",
            "verse 61:7": "A ima li nepravednijeg od onoga koji o Allahu laži iznosi dok se u pravu vjeru poziva? – A Allah neće ukazati na Pravi put narodu koji nepravdu čini.",
            "verse 61:8": "Oni žele utrnuti Allahovo svjetlo ustima svojim, a Allah će učiniti da svjetla Njegova uvijek bude, makar krivo bilo nevjernicima.",
            "verse 61:9": "On po Poslaniku Svome šalje uputstvo i vjeru istinitu da bi je uzdigao iznad svih vjera, makar ne bilo pravo mnogobošcima.",
            "verse 61:10": "O vjernici, hoćete li da vam ukažem na trgovinu, ona će vas spasiti patnje nesnosne:",
            "verse 61:11": "u Allaha i Poslanika Njegova vjerujte i imecima svojim i životima svojim na Allahovu putu se borite – to vam je, da znate, bolje –",
            "verse 61:12": "On će vam grijehe vaše oprostiti i u džennetske bašče vas, kroz koje će rijeke teći, uvesti, i u divne dvorove u edenskim vrtovima; to će biti uspjeh veliki,",
            "verse 61:13": "a daće vam i drugu blagodat koju jedva čekate: Allahovu pomoć i skoru pobjedu! Zato obraduj radosnom viješću vjernike!",
            "verse 61:14": "O vjernici, pomozite Allahovu vjeru, kao što su učenici rekli: \"Mi ćemo pomoći Allahovu vjeru!\" – kad ih je Isa, sin Merjemin, upitao: \"Hoćete li me pomoći Allaha radi?\" I neki od sinova Israilovih su povjerovali, a drugi nisu, pa smo Mi one koji su povjerovali – protiv neprijatelja njihova pomogli, i oni su pobijedili."
        },
        "Bulgarian": {
            "verse 61:1": "Всичко на небесата и всичко на земята прославя Аллах. Той е Всемогъщия, Премъдрия.",
            "verse 61:2": "О, вярващи, защо говорите онова, което не вършите?",
            "verse 61:3": "Най-омразно пред Аллах е да говорите онова, което не вършите.",
            "verse 61:4": "Аллах обича онези, които се сражават по Неговия път в редица, сякаш са здрава крепост.",
            "verse 61:5": "И рече Муса на своя народ: “О, народе мой, защо ме огорчавате, след като вече узнахте, че аз съм пратеник на Аллах при вас?” И когато се отклониха, Аллах отклони сърцата им. Аллах не напътва нечестивите хора.",
            "verse 61:6": "И рече Иса, синът на Мариам: “О, синове на Исраил, аз съм пратеник на Аллах при вас, да потвърдя Тората преди мен и да благовестя за пратеник, който ще дойде след мен. Името му е Ахмад.” А когато [Мухаммад] им донесе ясните знаци, рекоха: “Това е явна маг",
            "verse 61:7": "И кой е по-голям угнетител от онзи, който измисля лъжа за Аллах, когато го зоват към Исляма? Аллах не напътва хората-угнетители.",
            "verse 61:8": "Те искат да угасят светлината на Аллах с уста. Но Аллах ще стори да засияе в пълнота Неговата светлина, дори неверниците да възненавиждат това.",
            "verse 61:9": "Той е, Който изпрати Своя Пратеник с напътствието и с правата религия, за да я издигне над всички религии, дори съдружаващите да възненавиждат това.",
            "verse 61:10": "О, вярващи, да ви посоча ли търговия, която ще ви спаси от болезнено мъчение?",
            "verse 61:11": "Да вярвате в Аллах и в Неговия Пратеник, и да се борите по пътя на Аллах чрез своите имоти и души. Това е най-доброто за вас, ако знаете.",
            "verse 61:12": "Тогава Той ще ви опрости греховете и ще ви въведе в Градините, сред които реки текат, и в хубави жилища в Градините на Адн. Това е великото спасение.",
            "verse 61:13": "И друго, което обичате - помощ от Аллах и близка победа. И възрадвай вярващите!",
            "verse 61:14": "О, вярващи, бъдете помощници [по пътя] на Аллах, както Иса, синът на Мариам, рече на учениците си: “Кои са моите помощници [по пътя] на Аллах?” Учениците рекоха: “Ние сме помощниците [по пътя] на Аллах.” И част от синовете на Исраил повярва, а друга не по"
        },
        "Chinese": {
            "verse 61:1": "凡在天地间的，都赞颂真主超绝万物，他是万能的，是至睿的。",
            "verse 61:2": "信道的人们啊！你们为什麽说你们所不做的事呢？",
            "verse 61:3": "你们说你们所不做的，这在真主看来，是很可恨的。",
            "verse 61:4": "真主的确喜爱那等人；他们为他而列阵作战，好像坚实的墙壁一样。",
            "verse 61:5": "当时，穆萨曾对他的宗族说：我的宗族啊！你们既知道我是真主派来教化你们的使者，你们为什麽诽谤我呢？当他们背离正道的时候，真主使他们的心背离真理；真主是不引导悖逆的民众的。",
            "verse 61:6": "当时，麦尔彦之子尔撒曾说：以色列的後裔啊！我确是真主派来教化你们的使者，他派我来证实在我之前的《讨拉特》，并且以在我之後诞生的使者，名叫艾哈默德的，向你们报喜。当他已昭示他们许多明证的时候，他们说：这是明显的魔术。",
            "verse 61:7": "别人劝他入伊斯兰，他却假借真主的名义而造谣；这样的人，谁比他还不义呢？真主不引导不义的民众的。",
            "verse 61:8": "他们想吹灭真主的光明，但真主要完成他的光明，即使不信道的人不愿意。",
            "verse 61:9": "他曾以正道和真教的使命委托他的使者，以便他使真教胜过一切宗教，即使以物配主的人不愿意。",
            "verse 61:10": "信道的人们啊！我将指示你们一种生意，它能拯救你们脱离痛苦的刑罚，好吗？",
            "verse 61:11": "你们信仰真主和使者，你们以自己的财产和生命，为真主而奋斗，那对於你们是更好的，如果你们知道。",
            "verse 61:12": "他将赦宥你们的罪过，并且使你们入下临诸河的乐园和常住的乐园中的许多优美的住宅，那确是伟大的成功。",
            "verse 61:13": "他将赏赐你们另一种为你们所爱好的恩典--从真主降下的援助，和临近的胜利。你向信士们报喜吧。",
            "verse 61:14": "信道的人们啊！你们应当做协助真主的人，犹如麦尔彦之子尔撒对他的门徒所说的：谁是与我共同协助真主的？那些门徒说：我们是协助真主的。以色列的後裔中，有一派人已经信道，有一派人并不信道。我扶助信道的人们对抗他们的敌人，故他们变成优胜的。"
        },
        "Danish": {
            "verse 61:1": "Wat zich ook in de hemelen en op de aarde bevindt, verheerlijkt Allah; Hij is de Almachtige, de Alwijze",
            "verse 61:2": "O gij die gelooft, waarom zegt gij hetgeen gij niet doet",
            "verse 61:3": "Het is afkeurenswaardig bij Allah dat gij zegt hetgeen gij niet doet",
            "verse 61:4": "Voorzeker, Allah heeft diegenen lief die terwille van Hem strijden in geordende gelederen, alsof zij een hechte muur vormen",
            "verse 61:5": "En toen Mozes tegen zijn volk zeide: O mijn volk, waarom ergert gij mij, wetende dat ik Allah`s boodschapper voor u ben? En toen zij afdwaalden deed Allah hun hart zich afwenden, want Allah leidt het opstandige volk niet",
            "verse 61:6": "En toen Jezus, zoon van Maria, zeide: O kinderen van Israël, Ik ben Allah`s boodschapper voor u, datgene bevestigend wat vóór mij in de Torah was, en een blijde tijding gevende van een boodschapper die na mij komen zal, zijn naam zal Ahmad zijn. En als hij tot hen komen zal met duidelijke bewijzen zullen zij zeggen: Dit is louter bedrog",
            "verse 61:7": "Wie is onrechtvaardiger dan hij die leugen over Allah verzint, terwijl hij opgeroepen wordt tot de Islam? Allah leidt het onrechtvaardige volk niet",
            "verse 61:8": "Zij wensen Allah`s licht door hun mond te doven, maar Allah zal Zijn licht vervolmaken, hoewel de ongelovigen er afkerig van zijn",
            "verse 61:9": "Hij is het Die Zijn boodschapper heeft gezonden met leiding en de godsdienst der Waarheid, opdat hij deze moge doen zegevieren over alle andere godsdiensten, al zijn de afgodendienaren er afkerig van",
            "verse 61:10": "O gij die gelooft, zal ik u inlichten over een handel die u zal redden van een pijnlijke straf",
            "verse 61:11": "Dat gij in Allah en Zijn boodschapper gelooft en voor de zaak van Allah met uw bezit en uw persoon strijdt. Dat is beter voor u als gij het weet",
            "verse 61:12": "Hij zal u uw zonden vergeven en u in tuinen leiden waar doorheen rivieren stromen en tot reine woningen toelaten in tuinen der Eeuwigheid. Dat is de grote zegepraal",
            "verse 61:13": "En nog meer waarnaar gij verlangt: hulp van Allah en een spoedige overwinning. En geef blijde tijding aan de gelovigen",
            "verse 61:14": "O, gij die gelooft, weest Allah`s helpers, zoals toen Jezus, zoon van Maria, tot zijn discipelen zeide: Wie zijn mijn helpers terwille van Allah? De discipelen antwoordden: Wij zijn Allah`s helpers! Toen geloofde een gedeelte van de kinderen Israëls, terwijl een ander deel niet geloofde maar Wij hielpen de gelovigen tegen hun vijand en zij werden overwinnaars"
        },
        "Dutch": {
            "verse 61:1": "Wat er in de hemelen en op de aarde is prijst de Glorie van Allah. En Hij is de Almachtige, de Alwijze.",
            "verse 61:2": "O jullie die geloven, waarom zeggen jullie wat jullie niet doen?",
            "verse 61:3": "Groot is de woede bij Allah dat jullie zeggen wat jullie niet doen.",
            "verse 61:4": "Voorwaar, Allah houdt van degenen die in slagorde strijden op Zijn Weg, alsof zij een hecht gevoegd bouwwerk zijn.",
            "verse 61:5": "En (gedenkt) toen Môesa tot zijn volk zei: \"O mijn volk, waarom kwetsen jullie mij terwijl jullie waarlijk weten dat ik voor jullie de Boodschapper van Allah ben?\" Toen zij dwaling verkozen liet Allah hun harten dwalen. En Allah leidt het zwaar zondige volk niet.",
            "verse 61:6": "En (gedenkt) toen 'Îsa, de zoon van Maryam, zei: \"O Kinderen van Israël, voorwaar, ik ben voor jullie de Boodschapper van Allah, ter bevestiging van wat er vóór mij is van de Taurât en als verkondiger van een verheugende tijding over een Boodschapper die na mij komt, zijn naam is Ahmad. Toen hij dan met de duidelijke bewijzen tot hen kwam, zeiden zei: \"Dit is duidelijk toverij.\"",
            "verse 61:7": "En wie is zondiger dan degene die een leugen over Allah verzonnen heeft, terwijl hij tot de Islam opgeroepen wordt? En Allah leidt het onrechtplegende volk niet.",
            "verse 61:8": "Zij willen het Licht van Allah doven met hun monden, maar Allah vervolmaakt Zijn Licht, ook al haten de ongelovigen het.",
            "verse 61:9": "Hij is Degene Die Zijn Boodschapper heeft gezonden met de Leiding en de ware godsdienst (de Islam) om deze laten zegevieren over alle (vormen van) godsdienst, ook al haten de veelgodenaanbidders het.",
            "verse 61:10": "O jullie die geloven, zal ik jullie een handel tonen die jullie van een pijnlijke bestraffing redden kan?",
            "verse 61:11": "(Het is) het geloof in Allah en Zijn Boodschapper geloven en jullie op de Weg van Allah strijden met jullie bezittingen en jullie zielen. Dat is beter voor jullie, als jullie het wisten!",
            "verse 61:12": "Hij vergeeft jullie zonden en doet jullie Tuinen (het Paradijs) binnengaan waar de rivieren onder door stromen. En (Hij schenkt) een goede woonplaats in de Tuin van 'Adn. Dat is de geweldige overwinning.",
            "verse 61:13": "En (Hij schenkt) nog iets waar jullie van houden: hulp van Allah en een nabije overwinning. En verkondig de gelovigen een verteugende tijding.",
            "verse 61:14": "O jullie die geloven, weest helpers van (de godsdienst van) Allah, zoals 'Îsa, de zoon van Maryam, tot de metgezellen zei: \"Wie zijn mijn helpers voor (de oproep) tot Allah?\" De metgezellen zeiden: \"Wij zijn de helpers van Allah.\" Waarop een deel van de Kinderen van Israël geloofde en een ander deel niet geloofde. Vervolgens versterkten Wij degenen die geloofden tegen hun vijanden zodat zij zegevierders werden."
        },
        "English": {
            "verse 61:1": "Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise.",
            "verse 61:2": "O you who have believed, why do you say what you do not do?",
            "verse 61:3": "Great is hatred in the sight of Allah that you say what you do not do.",
            "verse 61:4": "Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly.",
            "verse 61:5": "And [mention, O Muhammad], when Moses said to his people, \"O my people, why do you harm me while you certainly know that I am the messenger of Allah to you?\" And when they deviated, Allah caused their hearts to deviate. And Allah does not guide the defiantly disobedient people.",
            "verse 61:6": "And [mention] when Jesus, the son of Mary, said, \"O children of Israel, indeed I am the messenger of Allah to you confirming what came before me of the Torah and bringing good tidings of a messenger to come after me, whose name is Ahmad.\" But when he came to them with clear evidences, they said, \"This is obvious magic.\"",
            "verse 61:7": "And who is more unjust than one who invents about Allah untruth while he is being invited to Islam. And Allah does not guide the wrongdoing people.",
            "verse 61:8": "They want to extinguish the light of Allah with their mouths, but Allah will perfect His light, although the disbelievers dislike it.",
            "verse 61:9": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it.",
            "verse 61:10": "O you who have believed, shall I guide you to a transaction that will save you from a painful punishment?",
            "verse 61:11": "[It is that] you believe in Allah and His Messenger and strive in the cause of Allah with your wealth and your lives. That is best for you, if you should know.",
            "verse 61:12": "He will forgive for you your sins and admit you to gardens beneath which rivers flow and pleasant dwellings in gardens of perpetual residence. That is the great attainment.",
            "verse 61:13": "And [you will obtain] another [favor] that you love - victory from Allah and an imminent conquest; and give good tidings to the believers.",
            "verse 61:14": "O you who have believed, be supporters of Allah, as when Jesus, the son of Mary, said to the disciples, \"Who are my supporters for Allah?\" The disciples said, \"We are supporters of Allah.\" And a faction of the Children of Israel believed and a faction disbelieved. So We supported those who believed against their enemy, and they became dominant."
        },
        "Filipino": {
            "verse 61:1": "Kahit anupamang nasa kalangitan at kalupaan, bayaan sila na ipagbunyi ang mga pagpupuri at pagluwalhati kay Allah, sapagkat Siya lamang ang Pinakamataas sa Kapangyarihan, ang Pinakamaalam",
            "verse 61:2": "o kayong mga nananampalataya! Bakit kayo nagsasalita (ng mga bagay) na hindi ninyo tinutupad (ginagawa)",
            "verse 61:3": "Tunay ngang kasuklam-suklam sa paningin ni Allah na kayo ay nagsasalita (ng mga bagay) na hindi ninyo tinutupad (ginagawa)",
            "verse 61:4": "Katotohanang si Allah ay nagmamahal sa mga tao na nakikipaglaban dahil sa Kanyang Kapakanan, (sa mga hanay) na sama-sama sa digmaan, na tila bang sila ay mga matitibay na moog na nasesementuhan",
            "verse 61:5": "At (alalahanin), nang si Moises ay nagbadya sa kanyang pamayanan: “o aking pamayanan! Bakit kayo ay hindi tumatalima sa akin, bagama’t nababatid ninyo ng may katiyakan na ako ay Tagapagbalita ni Allah na ipinadala sa inyo?” Kaya’t nang sila ay napaligaw sa kamalian, ay hinayaan ni Allah na ang kanilang puso ay mapaligaw (sa Kanyang landas) sapagkat si Allah ay hindi namamatnubay sa Fasiqun (mga naghihimagsik sa pagsuway)",
            "verse 61:6": "At (alalahanin) nang si Hesus, ang anak ni Maria, ay nagbadya: “o Angkan ng Israel! Ako ay isang Tagapagbalita ni Allah na ipinadala sa inyo, na nagpapatotoo sa Torah (mga Batas) na ipinadala (sa inyo) nang una pa sa akin, at nagbibigay sa inyo ng masayang balita ng isang Tagapagbalita na susunod sa akin, ang pangalang itatawag sa kanya ay Ahmad (alalaong baga, ang ibang pangalan ni Propeta Muhammad at ang literal na kahulugan nito [Ahmad] ay “siya na nagpupuri kay Allah ng higit pa sa iba”). Datapuwa’t nang siya (Ahmad) ay pumaroon sa kanila na may mga Maliwanag na Katibayan, sila ay nagsipagsabi: “Ito ay isang maliwanag na salamangka!”",
            "verse 61:7": "Sino baga kaya ang higit na gumagawa ng malaking kamalian maliban sa kanya na kumakatha ng kabulaanan laban kay Allah, samantalang siya ay inaanyayahan sa Islam? At si Allah ay hindi namamatnubay sa Zalimun (mga mapagsamba sa diyus-diyosan at mapaggawa ng kamalian)",
            "verse 61:8": "Ang kanilang hangarin ay apulahin ang Liwanag ni Allah (alalaong baga, ang Pananampalatayang Islam, ang Qur’an, at Propeta Muhammad), sa (pamamagitan ng pag-ihip) ng kanilang bibig. Datapuwa’t si Allah ang magtatapos (ng kapahayagan) ng Kanyang liwanag, kahit na ang mga hindi sumasampalataya ay magsitutol (dito)",
            "verse 61:9": "Siya (Allah) ang nagsugo ng kanyang Tagapagbalita (Muhammad) ng may Patnubay at ng Relihiyon ng Katotohanan (Kaisahan ni Allah sa Islam), upang kanyang maipagbadya ito ng higit sa lahat ng mga relihiyon, kahit na nga ang Mushrikun (mga pagano, mapagsamba sa diyus-diyosan, walang pananalig sa Kaisahan ni Allah at Kanyang Tagapagbalitang si Muhammad) ay sumalansang (dito)",
            "verse 61:10": "O kayong mga nananampalataya! Kayo ba ay aking gagabayan sa isang mabuting kalakal na makakapagligtas sa inyo sa kasakit-sakit na kaparusahan",
            "verse 61:11": "Na kayo ay 878 magsisampalataya kay Allah at sa Kanyang Tagapagbalita (Muhammad), at kayo ay magsipagsikhay na mabuti (sa inyong kaya) tungo sa Kapakanan ni Allah, sa pamamagitan ng inyong mga ari-arian at inyong buhay. Ito ay higit na mabuti sa inyo, kung inyo lamang nalalaman",
            "verse 61:12": "(Kung inyong gawin), Siya ay magpapatawad sa inyo ng inyong mga kasalanan at Kanyang tatanggapin kayo sa Hardin na sa ilalim nito ay may mga batis na nagsisidaloy at sa magagandang Bahay ng Halamanan ng walang hanggan (Paraiso), ito ay katotohanang Pinakasukdol na Tagumpay (na inyong makakamit)",
            "verse 61:13": "At gayundin (ay magkakaloob Siya) ng iba pang (pabuya) na inyong inaasam, - tulong na mula kay Allah at dagliang tagumpay. Kaya’t ipamahagi ang magandangbalita(o Muhammad) samgasumasampalataya",
            "verse 61:14": "O kayong nananampalataya! Kayo ba ay makakatulong niAllah? Nakatuladnangsinabini Hesus, anganakni Maria, sa kanyang mga disipulo: “Sino ang aking makakatulong (sa mga gawain) sa (Kapakanan) ni Allah? At ang mga disipulo ay sumagot: “Kami ang makakatulong ni Allah!” At ang isang bahagi ng Angkan ng Israel ay sumampalataya, at ang isang bahagi ay nagsitalikod. Subalit binigyan Namin ng kapangyarihan ang mga sumasampalataya laban sa kanilang mga kaaway, at sila ang mga nagsipagtagumpay. Biyernes"
        },
        "French": {
            "verse 61:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifient Allah, et Il est le Puissant, le Sage.",
            "verse 61:2": "O vous qui avez cru! Pourquoi dites-vous ce que vous ne faites pas?",
            "verse 61:3": "C'est une grande abomination auprès d'Allah que de dire ce que vous ne faites pas.",
            "verse 61:4": "Allah aime ceux qui combattent dans Son chemin en rang serré pareils à un édifice renforcé.",
            "verse 61:5": "Et quand Moïse dit à son peuple: «O mon peuple! Pourquoi me maltraitez-vous alors que vous savez que je suis vraiment le Messager d'Allah [envoyé] à vous?» Puis quand ils dévièrent, Allah fit dévier leurs cœurs, car Allah ne guide pas les gens pervers.",
            "verse 61:6": "Et quand Jésus fils de Marie dit: «O Enfants d'Israël, je suis vraiment le Messager d'Allah [envoyé] à vous, confirmateur de ce qui, dans la Thora, est antérieur à moi, et annonciateur d'un Messager à venir après moi, dont le nom sera «Ahmad». Puis quand celui-ci vint à eux avec des preuves évidentes, ils dirent: «C'est là une magie manifeste».",
            "verse 61:7": "Et qui est plus injuste que celui qui invente un mensonge contre Allah, alors qu'il est appelé à l'Islam? Et Allah ne guide pas les gens injustes.",
            "verse 61:8": "Ils veulent éteindre de leurs bouches la lumière d'Allah, alors qu'Allah parachèvera Sa lumière en dépit de l'aversion des mécréants.",
            "verse 61:9": "C'est Lui qui a envoyé Son messager avec la guidée et la Religion de Vérité, pour la placer au-dessus de toute autre religion, en dépit de l'aversion des associateurs.",
            "verse 61:10": "O vous qui avez cru! vous indiquerai-je un commerce qui vous sauvera d'un châtiment douloureux?",
            "verse 61:11": "Vous croyez en Allah et en Son messager et vous combattez avec vos biens et vos personnes dans le chemin d'Allah, et cela vous est bien meilleur, si vous saviez!",
            "verse 61:12": "Il vous pardonnera vos péchés et vous fera entrer dans des Jardins sous lesquels coulent les ruisseaux, et dans des demeures agréables dans les jardins d'Eden. Voilà l'énorme succès",
            "verse 61:13": "et Il vous accordera d'autres choses encore que vous aimez bien: un secours [venant] d'Allah et une victoire prochaine. Et annonce la bonne nouvelle aux croyants.",
            "verse 61:14": "O vous qui avez cru! Soyez les alliés d'Allah, à l'instar de ce que Jésus fils de Marie a dit aux apôtres: «Qui sont mes alliés (pour la cause) d'Allah?» - Les apôtres dirent: «Nous sommes les alliés d'Allah». Un groupe des Enfants d'Israël crut, tandis qu'un groupe nia. Nous aidâmes donc ceux qui crurent contre leur ennemi, et ils triomphèrent."
        },
        "Fulah": {
            "verse 61:1": "Kala ko woni ka kammuuli e ka leydi seninii Allah. Ko Kanko woni Fooluɗo, Ñeeño On",
            "verse 61:2": "Eehey mon goonɗinɓe ko waɗi hoɗon kaala ko on mbaɗatah",
            "verse 61:3": "Mawni tikkere ka Alla nde kaalaton ko on gollatah",
            "verse 61:4": "Pellet Alla na yiɗi ɓeen haɓateeɓe e laawol Alla hoɓe ngoni saffeeji hono maadi potndaandi",
            "verse 61:5": "Tumo nde o maakani yimɓe makko, yimɓe am holko taki hoɗon lora mi te hoɗon nganndi komi nelaaɗo Alla faade e mon, ndeɓe ooñi Alla ooñi ɓerɗe maɓɓe Alla feewnatah yimɓe faasiqeeɓe",
            "verse 61:6": "E nde Iisa ɓiy Maryama maaki eehey mon banii Israa*iil komi nelaaɗo Alla tigi faade e mon goonɗinɗo ko woni ko e hakkunde juuɗe am Tawreet e beltinoowo nelaaɗo garoowo caggal hombo wiyee Ahmadu, nde o anndani ɓe hujjaaji laaɓɗi ɓe mbi*i ɗum ko mbilewu ɓanngungu",
            "verse 61:7": "Alah ɓurɗa tooñde oon pepandiiɗo e dow Alla te hombo noddee e islaam, Alla feewnatah tooñooɓe",
            "verse 61:8": "Hoɓe faala ñifrude annoore Alla nde kunduɗe maɓɓe, Alla ko timminoowo annoore makko nde haysi heefereeɓe ngañii",
            "verse 61:9": "Ko Kanko woni Nulirɗo Nulaaɗo Makko on peewal e diina goonga, fii yo o ɓamtu ka e hoore kala diina, hay si sirkooɓe ɓen añii [ɗum]",
            "verse 61:10": "Eehey mon goonɗinɓe mbele mi tinndintah on njulaagu ndaɗnatngu on e lepte muusɗe",
            "verse 61:11": "Ngoonɗinon Alla e nelaaɗo Makko mbaɗiron jihaadi e laawol makko jawdi mon e pittaali mon ko ɗuum ɓuri on moƴƴande si on ngonii annduɓe",
            "verse 61:12": "Alla hafrana on bakkatuuji mon, O naatna on aljannaaji ɗi caatli ndogata ley mum e koɗorɗe belɗe ka aljanna Adan ko ɗuum woni malal manngal. @Corrected",
            "verse 61:13": "E goɗɗo mbo njiɗɗon ballal ummaade e Alla e uddital ɓadingal weltin juulɓe ɓe",
            "verse 61:14": "Eehey mon goonɗinɓe ngonee wallooɓe Alla hono no Iisa Ibnu Mariya maaki suɓaaɓe mum hombo wallata mi faade e Alla suɓaaɓe mum mbii ko mjinen ngoni wallooɓe Alla, heen fedde e Banii Isra*eel goonɗini wonnde nde yeddi Min cemmbini goonɗinnde nde e dow añɓe mum en ɓe ngonti foolɓe"
        },
        "German": {
            "verse 61:1": "Allah preist (alles), was in den Himmeln und was auf der Erde ist. Und Er ist der Allmächtige und Allweise.",
            "verse 61:2": "O die ihr glaubt, warum sagt ihr, was ihr nicht tut?",
            "verse 61:3": "Welch schwerwiegende Abscheu erregt es bei Allah, daß ihr sagt, was ihr nicht tut.",
            "verse 61:4": "Gewiß, Allah liebt diejenigen, die auf Seinem Weg kämpfen in Reihe, als wären sie ein zusammengefügter Bau.",
            "verse 61:5": "Und als Musa zu seinem Volk sagte: \"O mein Volk, warum fügt ihr mir Leid zu, wo ihr doch sicher wißt, daß ich Allahs Gesandter an euch bin?\" Als sie nun abschweiften, ließ Allah ihre Herzen abschweifen. Und Allah leitet das Volk der Frevler nicht recht.",
            "verse 61:6": "Und als 'Isa, der Sohn Maryams, sagte: \"O Kinder Isra'ils, gewiß, ich bin Allahs Gesandter an euch, das bestätigend, was von der Tora vor mir (offenbart) war, und einen Gesandten verkündend, der nach mir kommen wird: sein Name ist Ahmad'.\" Als er nun mit den klaren Beweisen zu ihnen kam, sagten sie: \"Das ist deutliche Zauberei.\"",
            "verse 61:7": "Und wer ist ungerechter, als wer gegen Allah Lügen ersinnt, während er zum Islam aufgerufen wird? Und Allah leitet das Volk der Ungerechten nicht recht.",
            "verse 61:8": "Sie wollen gern Allahs Licht mit ihren Mündern auslöschen. Aber Allah wird Sein Licht vollenden, auch wenn es den Ungläubigen zuwider ist.",
            "verse 61:9": "Er ist es, Der Seinen Gesandten mit der Rechtleitung und der Religion der Wahrheit gesandt hat, um ihr die Oberhand über alle Religion zu geben, auch wenn es den Götzendienern zuwider ist.",
            "verse 61:10": "O die ihr glaubt, soll ich euch auf einen Handel hinweisen, der euch vor schmerzhafter Strafe rettet?",
            "verse 61:11": "Ihr sollt an Allah und Seinen Gesandten glauben und euch auf Allahs Weg mit eurem Besitz und mit eurer eigenen Person abmühen; das ist besser für euch, wenn ihr nur wißt -,",
            "verse 61:12": "dann wird Er euch eure Sünden vergeben und euch eingehen lassen in Gärten, durcheilt von Bächen, und in angenehme Wohnungen in den Gärten Edens. Das ist der großartige Erfolg.",
            "verse 61:13": "Und (noch) eine andere (Huld), die ihr liebt (, wird euch gewährt): Hilfe von Allah und ein naher Sieg. Und (so) verkünde (diese) frohe Botschaft den Gläubigen.",
            "verse 61:14": "O die ihr glaubt, seid Allahs Helfer, so wie 'Isa, der Sohn Maryams, zu den Jüngern sagte: \"Wer sind meine Helfer (auf dem Weg) zu Allah (hin)?\" Die Jünger sagten: \"Wir sind Allahs Helfer.\" So glaubte ein Teil von den Kindern Isra'ils, während ein (anderer) Teil ungläubig war. Da stärkten Wir diejenigen, die glaubten, gegen ihre Feinde, und so bekamen sie die Oberhand."
        },
        "Hausa": {
            "verse 61:1": "Abin da ke cikin sammai da abin da ke cikin ƙasã ya yi tasbihi ga Allah alhãli kuwa, Shi ne Mabuwayi, Mai hikima.",
            "verse 61:2": "Ya kũ waɗanda suka yi ĩmani! Don me kuke faɗin abin dã ba ku aikatãwa?",
            "verse 61:3": "Ya girma ga zama abin ƙyãma awurin Allah, ku faɗi abin da bã ku aikatãwa.",
            "verse 61:4": "Lalle Allah Yanã son waɗanda ke yin yãƙi dõmin ɗaukaka KalmarSa, a cikin safu kamar sũ gini ne mai ɗamfarar jũna.",
            "verse 61:5": "Kuma a lõkacin da Mũsã ya ce wa mutãnensa: \"Yã mutãnena! sabõda me kuke cũtar da ni, alhãli kuwa lalle kun sani cẽwa lalle nĩ Manzon Al1ah ne zuwa gare ku?\" To, a lõkacin da suka karkace, Allah Ya karkatar da zukãtansu. Kuma Allah bã Ya shiryar da mutãne fasiƙai.",
            "verse 61:6": "Kuma a lõkacin da Ĩsã ɗan Maryayama ya ce: \"Yã BanĩIsrã'ĩla! Lalle nĩ Manzon Allah ne zuwa gare ku, mai gaskata abin da ke gaba gare ni na Attaura, kuma mai bãyar da bushãra da wani Manzo da ke zuwa a bãyãna, SũnasaAhmad (Mashãyabo).\" To, a lõkacin da ya jẽ musu da hujjõji, suka ce: \"Wannan sihiri ne, bayyananne.\"",
            "verse 61:7": "Kuma wãne ne mafi zãlunci daga wanda ya ƙirƙira ƙarya ya Jingina ta ga Allah, alhãli kuwa shĩ, anã kiran sa zuwa ga Musulunci? Kuma Allah bã Ya shiryar da mutãne azzãlumai.",
            "verse 61:8": "Sunã nufin su bice hasken Allah da bãkunansu alhãli kuwa Allah Mai kammala haskenSa ne, kuma kõ da kãfirai sun ƙi.",
            "verse 61:9": "Shi ne wanda Ya aiko ManzonSa da shiriya da addĩnin gakiya, dõmin Ya ɗaukaka shi a kan wani addĩni dukansa kuma kõ dã mushirikai sun ƙi.",
            "verse 61:10": "Yã kũ waɗanda suka yi ĩmãni! Shin, in nũna muku wani fatauci wanda zai tsarshe ku daga wata azãba mai raɗaɗi?",
            "verse 61:11": "Ku yi ĩmani da Allah da ManzonSa, kuma ku yi jihãdi ga ɗaukaka kalmar Allah game da dũkiyõyinku da rãyukanku. Wannan shĩ ne alhẽri a gare ku idan kun kasance kuna da sani.",
            "verse 61:12": "Sai Allah Ya gãfarta muku zunubbanku, kuma Ya shigar da ku gidãjen Aljanna, ƙoramu na gudãna daga ƙarƙashinsu, da waɗansu ɗãkuna mãsu dãɗi a cikin gidãjen Aljannar zama. Wannan shĩ ne babban rabo, mai girma.",
            "verse 61:13": "Da wata (falala) da yake kunã son ta; taimako daga Allah da cin nasara wanda yake kusa. Kuma ka yi bushãra ga mũminai.",
            "verse 61:14": "Yã kũ waɗanda suka yi ĩmani! Ku kasance mataimakan Allah kamar abin da Ĩsã ɗanMaryama ya ce ga Hawãriyãwa, \"Waɗanne ne mataimakãna zuwa ga (aikin) Allah?\" Sai wata ƙungiya daga Banĩ Isrã'ĩla ta yi ĩmãni, kuma wata ƙungiya ta kãfirta. Sai muka ƙarfafa waɗanda suka yi ĩmãni a kan maƙiyansu, sabõda haka suka wãyi gari marinjãya."
        },
        "Hindi": {
            "verse 61:1": "जो चीज़े आसमानों में है और जो चीज़े ज़मीन में हैं (सब) ख़ुदा की तस्बीह करती हैं और वह ग़ालिब हिकमत वाला है",
            "verse 61:2": "ऐ ईमानदारों तुम ऐसी बातें क्यों कहा करते हो जो किया नहीं करते",
            "verse 61:3": "ख़ुदा के नज़दीक ये ग़ज़ब की बात है कि तुम ऐसी बात कहो जो करो नहीं",
            "verse 61:4": "ख़ुदा तो उन लोगों से उलफ़त रखता है जो उसकी राह में इस तरह परा बाँध के लड़ते हैं कि गोया वह सीसा पिलाई हुई दीवारें हैं",
            "verse 61:5": "और जब मूसा ने अपनी क़ौम से कहा कि भाइयों तुम मुझे क्यों अज़ीयत देते हो हालॉकि तुम तो जानते हो कि मैं तुम्हारे पास ख़ुदा का (भेजा हुआ) रसूल हूँ तो जब वह टेढ़े हुए तो ख़ुदा ने भी उनके दिलों को टेढ़ा ही रहने दिया और ख़ुदा बदकार लोगों को मंज़िले मक़सूद तक नहीं पहुँचाया करता",
            "verse 61:6": "और (याद करो) जब मरियम के बेटे ईसा ने कहा ऐ बनी इसराइल मैं तुम्हारे पास ख़ुदा का भेजा हुआ (आया) हूँ (और जो किताब तौरेत मेरे सामने मौजूद है उसकी तसदीक़ करता हूँ और एक पैग़म्बर जिनका नाम अहमद होगा (और) मेरे बाद आएँगे उनकी ख़ुशख़बरी सुनाता हूँ जो जब वह (पैग़म्बर अहमद) उनके पास वाज़ेए व रौशन मौजिज़े लेकर आया तो कहने लगे ये तो खुला हुआ जादू है",
            "verse 61:7": "और जो शख़्श इस्लाम की तरफ बुलाया जाए (और) वह कुबूल के बदले उलटा ख़ुदा पर झूठ (तूफान) जोड़े उससे बढ़ कर ज़ालिम और कौन होगा और ख़ुदा ज़ालिम लोगों को मंज़िले मक़सूद तक नहीं पहुँचाया करता",
            "verse 61:8": "ये लोग अपने मुँह से (फूँक मारकर) ख़ुदा के नूर को बुझाना चाहते हैं हालॉकि ख़ुदा अपने नूर को पूरा करके रहेगा अगरचे कुफ्फ़ार बुरा ही (क्यों न) मानें",
            "verse 61:9": "वह वही है जिसने अपने रसूल को हिदायत और सच्चे दीन के साथ भेजा ताकि उसे और तमाम दीनों पर ग़ालिब करे अगरचे मुशरेकीन बुरा ही (क्यों न) माने",
            "verse 61:10": "ऐ ईमानदारों क्या मैं नहीं ऐसी तिजारत बता दूँ जो तुमको (आख़ेरत के) दर्दनाक अज़ाब से निजात दे",
            "verse 61:11": "(वह ये है कि) ख़ुदा और उसके रसूल पर ईमान लाओ और अपने माल व जान से ख़ुदा की राह में जेहाद करो अगर तुम समझो तो यही तुम्हारे हक़ में बेहतर है",
            "verse 61:12": "(ऐसा करोगे) तो वह भी इसके ऐवज़ में तुम्हारे गुनाह बख्श देगा और तुम्हें उन बाग़ों में दाख़िल करेगा जिनके नीचे नहरें जारी हैं और पाकीजा मकानात में (जगह देगा) जो जावेदानी बेहिश्त में हैं यही तो बड़ी कामयाबी है",
            "verse 61:13": "और एक चीज़ जिसके तुम दिल दादा हो (यानि तुमको) ख़ुदा की तरफ से मदद (मिलेगी और अनक़रीब फतेह (होगी) और (ऐ रसूल) मोमिनीन को ख़ुशख़बरी (इसकी) दे दो",
            "verse 61:14": "ऐ ईमानदारों ख़ुदा के मददगार बन जाओ जिस तरह मरियम के बेटे ईसा ने हवारियों से कहा था कि (भला) ख़ुदा की तरफ (बुलाने में) मेरे मददगार कौन लोग हैं तो हवारीन बोल उठे थे कि हम ख़ुदा के अनसार हैं तो बनी इसराईल में से एक गिरोह (उन पर) ईमान लाया और एक गिरोह काफिर रहा, तो जो लोग ईमान लाए हमने उनको उनके दुशमनों के मुक़ाबले में मदद दी तो आख़िर वही ग़ालिब रहे"
        },
        "Indonesian": {
            "verse 61:1": "Telah bertasbih kepada Allah apa saja yang ada di langit dan apa saja yang ada di bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
            "verse 61:2": "Wahai orang-orang yang beriman, kenapakah kamu mengatakan sesuatu yang tidak kamu kerjakan?",
            "verse 61:3": "Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tidak kamu kerjakan.",
            "verse 61:4": "Sesungguhnya Allah menyukai orang yang berperang dijalan-Nya dalam barisan yang teratur seakan-akan mereka seperti suatu bangunan yang tersusun kokoh.",
            "verse 61:5": "Dan (ingatlah) ketika Musa berkata kepada kaumnya: \"Hai kaumku, mengapa kamu menyakitiku, sedangkan kamu mengetahui bahwa sesungguhnya aku adalah utusan Allah kepadamu?\" Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tidak memberi petunjuk kepada kaum yang fasik.",
            "verse 61:6": "Dan (ingatlah) ketika Isa ibnu Maryam berkata: \"Hai Bani Israil, sesungguhnya aku adalah utusan Allah kepadamu, membenarkan kitab sebelumku, yaitu Taurat, dan memberi khabar gembira dengan (datangnya) seorang Rasul yang akan datang sesudahku, yang namanya Ahmad (Muhammad)\". Maka tatkala rasul itu datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka berkata: \"Ini adalah sihir yang nyata\".",
            "verse 61:7": "Dan siapakah yang lebih zalim daripada orang yang mengada-adakan dusta terhadap Allah sedang dia diajak kepada Islam? Dan Allah tidak memberi petunjuk kepada orang-orang zalim.",
            "verse 61:8": "Mereka ingin memadamkan cahaya Allah dengan mulut (tipu daya) mereka, tetapi Allah (justru) menyempurnakan cahaya-Nya, walau orang-orang kafir membencinya\".",
            "verse 61:9": "Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar agar Dia memenangkannya di atas segala agama-agama meskipun orang musyrik membenci.",
            "verse 61:10": "Hai orang-orang yang beriman, sukakah kamu aku tunjukkan suatu perniagaan yang dapat menyelamatkanmu dari azab yang pedih?",
            "verse 61:11": "(yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagimu, jika kamu mengetahui.",
            "verse 61:12": "Niscaya Allah akan mengampuni dosa-dosamu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai; dan (memasukkan kamu) ke tempat tinggal yang baik di dalam jannah 'Adn. Itulah keberuntungan yang besar.",
            "verse 61:13": "Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya). Dan sampaikanlah berita gembira kepada orang-orang yang beriman.",
            "verse 61:14": "Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah sebagaimana Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: \"Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?\" Pengikut-pengikut yang setia itu berkata: \"Kamilah penolong-penolong agama Allah\", lalu segolongan dari Bani Israil beriman dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang."
        },
        "Italian": {
            "verse 61:1": "Glorifica Allah ciò che è nei cieli e sulla terra. Egli è l'Eccelso, il Saggio.",
            "verse 61:2": "O credenti, perché dite quel che non fate?",
            "verse 61:3": "Presso Allah è grandemente odioso che diciate quel che non fate.",
            "verse 61:4": "In verità Allah ama coloro che combattono per la Sua causa in ranghi serrati come fossero un solido edificio.",
            "verse 61:5": "[Ricorda] quando Mosè disse al suo popolo: “O popolo mio, perché mi tormentate nonostante sappiate che sono veramente il Messaggero di Allah a voi [inviato]?”. Quando poi deviarono, Allah fece deviare i loro cuori.bAllah non guida la gente malvagia.",
            "verse 61:6": "E quando Gesù figlio di Maria disse: “O Figli di Israele, io sono veramente un Messaggero di Allah a voi [inviato], per confermare la Torâh che mi ha preceduto, e per annunciarvi un Messaggero che verrà dopo di me, il cui nome sarà Ahmad”. Ma quando questi giunse loro con le prove incontestabili, dissero: “Questa è magia evidente”.",
            "verse 61:7": "Chi è più iniquo di colui che inventa menzogne contro Allah, nonostante venga chiamato all'Islàm? Allah non guida gli ingiusti.",
            "verse 61:8": "Vogliono spegnere la luce di Allah con le loro bocche, ma Allah completerà la Sua luce a dispetto dei miscredenti.",
            "verse 61:9": "Egli è Colui Che ha inviato il Suo Messaggero con la Guida e la Religione della verità, affinché essa prevalga su ogni religione a dispetto degli associatori.",
            "verse 61:10": "O voi che credete, [volete che] vi indichi una transazione che vi salverà da un doloroso castigo?",
            "verse 61:11": "Credete in Allah e nel Suo Inviato e lottate con i vostri beni e le vostre persone sulla Via di Allah. Ciò è meglio per voi, se lo sapeste.",
            "verse 61:12": "[Allah] perdonerà i vostri peccati e vi farà entrare nei Giardini dove scorrono i ruscelli e nelle piacevoli dimore dei Giardini di Eden. Ecco il più grande successo!",
            "verse 61:13": "E [vi darà] un'altra cosa che avete desiderato: l'aiuto di Allah e una rapida vittoria. Danne [o Muhammad] la lieta novella ai credenti.",
            "verse 61:14": "O credenti, siate gli ausiliari di Allah, così come Gesù figlio di Maria chiedeva agli apostoli: “Chi sono i miei ausiliari [nella causa di] Allah?”. Risposero gli apostoli: “Noi siamo gli ausiliari di Allah”. Una parte dei Figli di Israele credette, mentre un'altra parte non credette. Aiutammo coloro che credettero contro il loro nemico ed essi prevalsero."
        },
        "Japanese": {
            "verse 61:1": "天にあり地にある凡ての有は，アッラーを讃える。本当にかれは偉力ならびなく英明であられる。",
            "verse 61:2": "信仰する者よ，あなたがたはどうして（自ら）行わないことを口にするのか。",
            "verse 61:3": "あなたがたが行わないことを口にするのは，アッラーが最も憎まれるところである。",
            "verse 61:4": "本当にアッラーの御好みになられる者は，堅田な建造物のように，戦列を組んでかれの道のために戦う者たちである。",
            "verse 61:5": "ムーサーがかれの人びとに言った時を思い起せ。「人びとよ，どうしてあなたがたはわたしを苦しめるのか。わたしが，あなたがたに（遣わされた）アッラーの使徒であることを，知っているではないか。」それでかれらが常規を踏みはずした時，アッラーはかれらの心を曲げられた。本当にアッラーは，（アッラーの）掟に背く者を御導きになられない。",
            "verse 61:6": "マルヤムの子イーサーが，こう言った時を思い起せ。「イスラエルの子孫たちよ，本当にわたしは，あなたがたに（遣わされた）アッラーの使徒で，わたしより以前に，（下されている）律法を確証し，またわたしの後に来る使徒の吉報を与える。その名前は，アハマドである。」だがかれが明証をもって現れた時，かれらは，「これは明らかに魔術である。」と言った。",
            "verse 61:7": "イスラームに招かれていながら，アッラーに就いて虚偽を捏造する者以上に悪を行う者があろうか。アッラーは不義を行う民を御導きになられない。",
            "verse 61:8": "かれらはアッラーの御光を，口先で消そうと望んでいる。だがアッラーは例え不信心者たちが忌み嫌おうとも御自分の光（イスラーム）を現わした。",
            "verse 61:9": "かれこそは，導きと真実の宗教を持たせて，御自分の使徒を遺わされた方で，例え多神教徒たちが忌み嫌おうとも，それ（イスラーム）を凡ての宗教の上に高く掲げさせられる。",
            "verse 61:10": "あなたがた信仰する者よ，われは痛苦の懲罰から救われる一つの取引を，あなたがたに示そう。",
            "verse 61:11": "それはあなたがたがアッラーとその使徒を信じ，あなたがたの財産と生命をもってアッラーの道に奮闘努力することである。もし分るならば，それはあなたがたのために最も善い。",
            "verse 61:12": "かれはあなたがたの様々な罪は赦して，川が（木々の）下を流れる楽園に入らせ，アドン（エデン）の楽園における美しい邸宅に住まわせる。それは至福の成就である。",
            "verse 61:13": "またあなたがたが好む，外（の恩恵）を与えられる。アッラーの御助けと，速かな勝利である。だからこの吉報を信者たちに伝えなさい。",
            "verse 61:14": "信仰する者よ，あなたがたはアッラーの助力者になれ。マルヤムの子イーサーが，その弟子たちに次のように言った。「アッラーの（道の）ために，誰がわたしの助力者であるのか。」弟子たちは（答えて），「わたしたちがアッラーの助力者です。」と言った。そのさいイスラエルの子孫たちの一団は信仰し，一団は背を向けた。それでわれは，信仰した者たちを助けて，かれらの敵に立ち向かわせた。こうしてかれらは勝利者となったのである。"
        },
        "Jawa": {
            "verse 61:1": "Isine langit lan bumi padha nyebut maha suci ing Allah, Allah iku Maha Mulya tur wicaksana",
            "verse 61:2": "Para mukmin! Ya gene sira padha kandha ngelakoni kabecikan kang satemene ora sira lakoni",
            "verse 61:3": "Gedhe-gedhening siksa ana ngarsaning allah iku manawa sira kandha ngelakoni kabecikan kang satemene ora sira lakoni",
            "verse 61:4": "Satemene Allah remen marang wong Islam kang padha mangsah perang nglakoni dhalaning Allah, tataning barisan sapsapan kaya pager bata kang santosa",
            "verse 61:5": "(Muhammad) , nyeritakna nalikane Musa pitutur marang ummate, \" Para ummatku, ya gene kowe padha nglarakake atiku gene kowe padha nglarakake atiku ing mangka kowe wis padha weruh yen aku iki utusane Allah marang kowe?\" Bareng para ummat mau padha puguh nyimpang saka ing bener, Allah ora kersa nuduhake wong kang padha duraka",
            "verse 61:6": "Lan nyaritakna nalika Isa anake Maryam biyen mituturi mangkene, \" Para turune Israil, Aku iki utusane Allah marang kowe netepake yen Kitab Taurat kang ana ngarepku lan kitabe para nabi kang kuna - kuna iku temen kabeh bener. Sarta aku memeca ing tembe bakal ana utusane Allah kang jumeneng sapungkurku kang namane Ahmad ( Muhammad) \" . Bareng jumeneng kanthi tandha yekti pirang - pirang, wong Bani Israil padha kondha, \" Tandha yekti iki cetha sihir",
            "verse 61:7": "Ora ana wong kang nganiaya marang awake dhewe tinimbang wong kang gawe - gawe celathu goroh ngarani marang Allah kang ora patut, kang mangka wong mau wis tampa dhawuh, dipurih ngelakoni Agama Islam, Allah ora kersa paring pituduh bener marang wong kafir",
            "verse 61:8": "Karepe wong kafir mau kudu mateni cahyaning Allah sarana pangucape, nanging Allah nyampurnakake cahyane, sanadyan wong kafir padha gething",
            "verse 61:9": "Allah iku ngutus Rasule nyiarake pituduh bener ( agama Islam) dikersakake ngundhangake, supaya ngalahake agama liyane kabeh, sanadiyan wong mangro tingal padha ora dhemen",
            "verse 61:10": "Para mukmin! Apa sira ( gelem) Ingsun tuduhake dagangan kang nyelametake ing sira saka siksa kang ngelarani",
            "verse 61:11": "Hiya iku sira kudu padha percaya ing Allah lan utusane, lan kudu mangsah perang ing dalane Allah kelawan wadol bandha lan nyawa. Weruha kang mangkono iku becik banget tumrap ing sira menawa dilakoni",
            "verse 61:12": "Allah ngapura sakabehe kaluputanira, lan nglebokake sira ana ing suwarga kang ana bengawane mili ana ing sangisare kekayon, lan ana omah kang luwih dening indhah rerenggane dhumunung ana sajeroning suwarga ’ Adn kang mangkono aran kebegjan gedhe",
            "verse 61:13": "Lan ana maneh bakal paparinge Allah kang sira dhemeni, hiya iku pitulunge Allah lan kemenangan kang cedhak ( wektune) . Iku sira wartakna anggawa bebungah marang para mukmin",
            "verse 61:14": "Para mukmin! sira padha dadiya wong biyantu marang agamane Allah. Kayadene Isa putra Maryam dhawuh marang sahabate kang setiya, \" Sapa kang keduga biyantu marang aku ( kanggo) ngedekake agama Allah?\" Para pendherek kang setiya ( sahabat Hawariyun) padha matur, \" Kula tamtu sami biyantu dhateng agamaning Allah\" . Ing kono sagolongan Bani Israil ana kang percaya lan ana kang maido. Dene wong sing percaya padha Ingsun sentosakake wusana menang perange ngalahake saterune"
        },
        "Kazakh": {
            "verse 61:1": "Аспандардағылар мен жердегілер Аллаһты барлық кемшіліктен пәк деп дәріптейді. Ол өте Үстем, аса Дана",
            "verse 61:2": "Ей, иманға келгендер! Өздерің істемейтін істерінді не үшін айтасыңдар",
            "verse 61:3": "Өздерің істемейтін нәрсені айтуларың Аллаһтың алдында өте жеккөрінішті",
            "verse 61:4": "Анығында, Аллаһ Өзінің жолында арасы тығызқаланған қамалдай сап түзеп соғысатындарды жақсы көреді",
            "verse 61:5": "Кезінде Мұса еліне: «Ей, елім! Аллаһтың елшісі екенімді біле тұра не үшін маған жәбір бересіңдер?» деп айтты. Олар хақтан ауытқыған кезде, Аллаһ олардың жүректерін жолдан бұрды. Аллаһ бұзық бойсұнбаушы елді тура жолға салмайды",
            "verse 61:6": "Әрі кезінде Мәриям ұлы Иса: «Ей, Исраил ұрпақтары! Шын мәнінде, мен сен­дерге өзімнен алдын келген Тәураттағыны растаушы және менен кейін келетін Ахмад есімді Елші жөнінде сүйінші хабар жеткізуші ретінде жіберілген Аллаһтың елшісімін», -деген еді. Ол Оларға анық дәлелдермен келген кезде, олар: «Бұл анық сиқыр», деді",
            "verse 61:7": "Исламға шақырыла тұра Аллаһ жайында өтірікті құрастырғаннан өткен әділетсіз кім бар? Аллаһ әділетсіз адамдарды тура жолға салмайды",
            "verse 61:8": "Олар Аллаһтың нұрын ауыздарымен ауызекі сөздерімен өшіруді қалайды. Алайда кәпірлер жеккөрсе де, Аллаһ Өз нұрын соңына жеткізеді",
            "verse 61:9": "Ол, Өз елшісін тура жолды ұстануға басшылықпен Құранмен және ақиқат дінімен Исламмен , оны барлық діндерден үстем ету үшін жіберген, мүшріктер Аллаһқа серік қосушылар мұны жек көрсе де",
            "verse 61:10": "Ей, иманға келгендер! Сендерге өздеріңдіжантүршігерлік азаптан құтқаратын бір «сауданы» көрсетейін бе",
            "verse 61:11": "Аллаһқа және Оның елшісіне сеніңдер, Аллаһтың жолында малдарыңмен әрі жандарыңмен күресіндер. Білсеңдер, сендер үшін осы қайырлы",
            "verse 61:12": "Сонда Ол күнәларыңды кешіріп, сендерді астынан өзендер ағатын Жәннаттағы бақтарға және ’Адн жәннатындағы көркем жайларға кіргізеді. Міне, осы ұлы табыс",
            "verse 61:13": "Әрі өздерің жақсы көретін басқа да нәрселер: Аллаһтан жәрдем және жақын бір жеңіс бар. Ей, Мұхаммед! Имандыларды осы хабармен сүйіншіле",
            "verse 61:14": "Ей, иманға келгендер! Мәриям ұлы Исаның хауарилерге: «Менің Аллаһ жолындағы жәрдемшілерім кім?» дегенінде, хауарилердің: «Біз Аллаһтың жәрдемшілеріміз», -дегендеріндей Аллаһтың Оның дінінің жәрдемшілері болыңдар. Сонда, Исраил ұрпақтарының бір бөлігі иманға келді, ал бір бөлігі күпірлік келтірді қарсы шықты . Біз иманға келгендерге дұшпандарына қарсы қолдау көрсеттік, сөйтіп олар үстем болды"
        },
        "Korean": {
            "verse 61:1": "하늘에 있는 것과 대지에 있는 것이 하나님의 완벽함을 찬양하도다. 그분께서는 가장 존엄하시고 가장 현명하신 분이라하늘과 대지에 있는 모든 것들로 하여금 하나님을 찬미하도록하랴 실로 하나님은 권능과 지혜 로 충만하시니라",
            "verse 61:2": "믿는 자들이여! 왜 그대들은 행하지 않는 일을 말하는가믿는 사람들이여 너희가 행하지 아니하면서 입으로만 말하느뇨",
            "verse 61:3": "그대들이 행하지 않는 일을 말함은 하나님께 있어 매우 증오스러운 것이라너희가 말하고 행하지 아니한것이 하나님께서는 가장 증오스러운 것이라",
            "verse 61:4": "실로 하나님께서는 그분의 길에서 대열을 지어 전투에 참전하는 자들을 사랑하시니 그들은 마치 견고한 건축물과도 같더라실로 하나님은 하나님의 명분을 위하여 대열에 서서 견고한 건물처럼 자리를 지키며 성전에 임 하는 자들을 사랑하시니라",
            "verse 61:5": "모세가 그의 사람들에게 말하니 “나의 사람들이여! 내가 그대들에게 보내진 하나님의 사도라는 것을 알면서도 왜 그대들은 나에게 해를 끼치는가?” 그리하여 그들이 엇나갔을 때 하나님께서는 그들의 마음을 어긋나게 하셨노라. 하나님께서는 거역하는 사람들을 인도하지 않으시노라모세가 백성들이여 너희는 왜나를 해치려 하느뇨 내가 너희에 게 보내어진 하나님의 선지자임을너희는 알지 않느뇨 라고 그의 백성에게 말하였으나 그들은 외면하였나니 하나님께서 그들의 마음을벗어나게 하였도다 실로 하나님은사악한 백성들을 인도하지 아니 하시니라",
            "verse 61:6": "마리아의 아들 예수가 말하니 “이스라엘의 자손들이여! 나는 그대들에게 보내진 하나님의 사도로서 나 이전의 타우라(토라)를 확증하노라. 그리고 기쁜 소식을 전하니 나 이후에 아흐마드`라는 이름의 사도가 올 것이라” 그러나 그가 분명한 증거를 가지고 그들에게 도래했을 때, 그들이 말하길 “이것은 확실한 주술이라”마리아의 아들 예수가 이스 라엘 자손들이여 실로 나는 너희 에게 보내어진 선지자로써 내 앞 에 온 구약과 내 후에 올 아흐맏 이란 이름을 가진 한 선지자의 복음을 확증하노라 그러나 그가 분명한 예증으로 그들에게 임하 였을 때 이것은 분명한 마술이라 하였더라",
            "verse 61:7": "이슬람으로 초대를 받으면서도 하나님에 관해 거짓을 지어내는 자, 그보다 더 부당한 자가 누구인가. 하나님께서는 부당한 무리를 인도하지 않으시노라이슬람에 초대받았음에도 불 구하고 하나님을 거역하며 거짓하는 자보다 더 사악한 자 누구이뇨실로 하나님은 사악한 백성들을 사랑하지 않으시니라",
            "verse 61:8": "그들은 자신들의 입으로써 하나님의 빛을 끄려 하나, 불신자들이 싫어할지언정 하나님께서는 그분의 빛을 완전히 하시는 분이라그들은 그들의 입으로 하나님의 빛을 끄려하고 불신자들이 그 것을 혐오하려 하여도 하나님은 그분의 빛을 완성케 하시니라",
            "verse 61:9": "인도와 진리의 종교와 함께 당신의 사도를 보내시어, 우상숭배자들이 싫어할지언정 그 모든 종교 위에 그것(이슬람)이 드러나도록 하시는 분이 그분이시라복음과 진리의 종교를 선지자를 통하여 보내시고 그것이 다른 모든 종교 위에 두신 분이 하나님이시라 그러나 불신자들은 그것을싫어하더라",
            "verse 61:10": "믿는 자들이여! 내가 그대들에게, 고통스런 벌로부터 그대들을 구해줄 거래 행위를 안내해 주려 하노라믿는 사람들이여 상업을 가르켜 주리라 그것이 고통스러운 응벌로부터 너희를 구하리라",
            "verse 61:11": "(그것은) 그대들이 하나님과 그분의 사도를 믿고, 그대들의 재산과 생명으로써 하나님의 길에서 분투하는 것이라. 그대들이 알고 있다면, 그것이 그대들에게 더 좋은 것이라그것은 너희가 하나님과 그분의 선지자를 믿으며 하나님 사 업을 위해 너희 재산과 너희 생명으로 성전하는 것으로 너희가 알 고 있다면 그것이 너희를 위한 복이라",
            "verse 61:12": "(그리하면) 그분께서 그대들을 위해 그대들의 죄를 용서해 주실 것이고, 그대들을 아래로부터 강이 흐르는 천국에 들게 하실 것이며, 영원의 천국 속에 있는 안락한 거주지에 들게 하실 것이라. 이것이야말로 위대한 성공이라하나님께서 너희의 과오를 용서하사 강물이 흐르는 에덴의 천국 안에 있는 아름다운 거주지 로 인도하시나니 그것이 위대한 숭리라",
            "verse 61:13": "그대들이 사랑하는 또 다른 것들, 하나님으로부터의 도움과 가까운 승리(도 주어질 것이라). 그대는 믿는 자들에게 기쁜 소식을 전하라너희가 좋아하는 다른 축복들도 있나니 하나님의 원조와 신속한 승리라 그러므로 믿음을 가진 자 들에게 기쁜 소식을 전하라",
            "verse 61:14": "믿는 자들이여! 마리아의 아들 예수가 제자들에게 “하나님을 위해서 나를 도와줄 자들은 누구인가?” 라고 말하고 제자들이 “우리들이야말로 하나님을 위해 돕는 자들입니다” 라고 말했던 것처럼 그렇게 그대들은 하나님을 위해 돕는 자들이 되어라. 그리하여 이스라엘 자손들 중의 한 무리는 믿었고 (다른) 한 무리는 불신하였노라. 이에 나는 믿는 자들을 그들의 적에 대항하여 도와주었으니 그들은 압도하는 자들이 되었노라믿는 사람들이여 하나님의 길에서 돕는 자가 되라 마리아의 아들 예수가 그의 제자들에게 하나님의 길에서 누가 나를 돕겠 느뇨 라고 했을 때 저희가 하나님 의 길에서 돕는 자가 되겠습니다 라고 제자들은 대답했노라 그리하 여 이스라엘 자손의 무리는 믿음 을 가졌고 다른 무리는 불신하였 더라 그래서 하나님은 그들의 적에대항하여 믿음을 가진 자들을 도왔으니 그들이 승리자가 되었노라"
        },
        "Kurdish": {
            "verse 61:1": "Tiþtê di asîmanan û tiþtê di zemîn de Xuda (ji her kêmasiyî) pak dêrandine. Serkeftiyê hîkmetdar her ew eهه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه به‌پاکی و بێگه‌ردی یادی خوایان کردووه‌، هه‌ر ئه‌ویش باڵاده‌ست و دانایه‌.",
            "verse 61:2": "Gelî ên bawerî anîne! hûn çima tiþtê nakin dibêjinئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه بۆچی شتێک ده‌ڵێن و ئه‌نجامی ناده‌ن؟ بۆچی گوفتارتان دژی کردارتانه‌؟",
            "verse 61:3": "Tiþtê hûn nekin bêjin li cem Xuda hêrsekî pirr mezin radikeخه‌شم و ڕقێکی گه‌وره‌یه لای خوا ئه‌وه‌ی که ده‌یڵێن و نایکه‌ن.",
            "verse 61:4": "Bêguman Xuda ji ên ku di rêya wî de qor bi qor þer dikin ku ew her wekî avahiyekî biheve zeliqandî ne hiz dikeبه‌ڕاستی خوا ئه‌و که‌سانه‌ی خۆس ده‌وێت که ده‌جه‌نگن له‌پێناو ڕێبازی خوادا به‌یه‌ك ڕیزو یه‌ك پارچه و یه‌ك دڵ، چونکه هه‌روه‌ك کۆشکێکی به‌رزی قایمی داڕێژراون به قوڕقوشم.",
            "verse 61:5": "(Di bîr bîne) dema Mûsa ji gelê xwe re got: \"Gelê min! hûn çima min diêþînin tevî ku hûn baþ dizanin ku ez pêxemberê Xuda me bal we ve (hatime þandin?).\" Vêca çi gava ew (ji rastiyê) fetilîn Xuda jî dilên wan fetiland. Xuda, komelekî ji rêderketî nade ser rêya rastبیریان نخه‌ره‌وه‌، کاتێك که موسا به قه‌ومه‌که‌ی وت: ئه‌ی قه‌وم و هۆزم ئێوه بۆچی ئازاری ڕۆح و دڵم ده‌ده‌ن، له کاتێکدا بێگومان ده‌زانن که من پێغه‌مبه‌ر و ڕه‌وانه‌کراوی خوام بۆتان، جا کاتێك ئه‌وان گوێیان بۆ ڕاستی نه‌گرت و له‌حه‌ق لایاندا، خوایش دڵه‌کانیانی له‌خشته بردو مۆری پێدا نا، چونکه خوا ڕێنموویی قه‌وم و هۆزی تاوانکارو تاوانبارو له‌سنوور ده‌رچوو ناکات.",
            "verse 61:6": "Û (di bîr bîne) dema Îsa kurê Meryemê got: \"Gelî zariyê Îsraîl! bêguman ez pêxemberê Xuda me bal we ve (hatime þandin) ku rastdêrê Tewrata berî xwe me û mizgînvanim bi pêxemberekî ku navê wî Ehmed e, wê piþtî min were.\" Vêca çi gava ew bi nîþanên xuya hat, gotin ku: \"Evê han efsûneke diyar eبیریان بخه‌ره‌وه‌، کاتێك عیسای کوری مه‌ریه‌م به‌نه‌وه‌ی ئیسرائیلی وت: منیش به‌ڕاستی پێغه‌مبه‌ری خوام بۆ سه‌ر ئێوه‌، ڕاستی ته‌وراتیش ده‌سه‌لمێنم که‌له پێش مندا هاتووه‌، هه‌روه‌ها مژده‌ده‌ریشم به‌پێغه‌مبه‌رێك که دوای من دێت و ناوی - ئه‌حمه‌د - ه‌، که‌چی کاتێك به به‌ڵگه و نیشانه‌ی تێر و ته‌واوو موعجیزه‌ی ئاشکراوه پێی ڕاگه‌یاندن، وتیان: ئه‌مه جادوویه‌کی ئاشکرایه‌.",
            "verse 61:7": "Ji kesê derewa nebûyî davê ser Xuda tevî ku ew bal Îslamê ve tê vexwendinê sitemkartir kî heye? Xuda, komela sitemkaran nade ser rêya rastجا کێ له‌و که‌سه سته‌مکارتره که درۆی بۆ خوا هه‌ڵبه‌ستووه‌، له‌کاتێکدا ئه‌و بانگ ده‌کرێت بۆ لای ئیسلام و موسڵمان بوون، خوایش هیدایه‌ت و ڕێنموویی قه‌ومی سته‌مکار ناکات.",
            "verse 61:8": "Ew dixwazin ku ronahiya Xuda bi devên xwe bitefînin. Lê her çend bi kafiran nexweþ be jî wê Xuda ronahiya xwe bitevayî bibe serîئه‌وانه ده‌یانه‌وێت به‌فوو، به‌قه‌ڵه‌ی ده‌م، نووری خوا بکوژێننه‌وه‌!! (خه‌یاڵیان خاوه‌) خوا نووری خۆی، ئاینی خۆی، ته‌واو ده‌کات و ده‌یچه‌سپێنێت هه‌رجه‌نده کافرو بێ بڕواکان پێی سه‌غڵه‌ت بن و پێیان ناخۆش بێت.",
            "verse 61:9": "Ew e ê ku pêxemberê xwe bi rêberî û dînê rastîn þandiye ji bo ku wî her çend bi pûtperestan nexweþ be jî bi ser hemû dînan bixeهه‌ر ئه‌و خوایه پێغه‌مبه‌ره‌که‌ی خۆی ڕه‌وانه کردووه هاوڕێ له‌گه‌ڵ هیدایه‌ت و ڕێنموویی و ئاینی حه‌ق و ڕاستیدا، تا سه‌ری بخات به‌سه‌ر هه‌موو ئاین و به‌رنامه‌کاندا، هه‌رجه‌نده موشریك و هاوه‌ڵگه‌ڕان پێیان ناخۆش بێت.",
            "verse 61:10": "Gelî ên bawerî anîne! ma ez danûsitanek ku we ji ezabekî bi jan xelas bike nîþanî we bidimئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، ده‌ستنیشانی بازرگانیه‌کتان بۆ بکه‌م، که له سزایه‌کی به ئێش ڕزگارتان بکات؟!",
            "verse 61:11": "Hûnê bi Xuda û pêxemberê wî bawerî bînin û hûnê bi malên xwe û bi canên xwe di rêya Xuda de cîhadê bikin. Eger hûn bizanbin evê han ji we re çêtir eسه‌ره‌تا باوه‌ڕهێنانتانه به خواو پێغه‌مبه‌ره‌که‌ی، ئینجا هه‌وڵ و تێکۆشانتانه له‌ڕێگه‌ی خوادا به به‌خشینی ماڵ و سامانتان، وه به‌خشینی خۆتان (واته‌: ماندووکردنی جه‌سته و بیروهۆشتان، تا به‌خت کردنیان له‌پێناوی خوادا) بێگومان ئه‌و کاره‌تان چاکتر و به‌فڕتره بۆتان ئه‌گه‌ر بزانن و تێبگه‌ن.",
            "verse 61:12": "Wê gunehên we ji we re bibexþîne û wê we têxe hin bihiþtên ku çem ji binê wan diherikin û hin ciyên xweþ di bihiþtê Ednê (ciyê xweþ û þên) de. Rizgariya herî mezin eva hayeئه‌وسا خوا له گوناهو هه‌ڵه‌کانتان خۆش ده‌بێت و ده‌تانخاته باخه‌کانی به‌هه‌شته‌وه له چه‌نده‌ها ڕوبار به‌ژێر دره‌خته‌کانیدا تێ ده‌په‌ڕێت و جاریه‌، هه‌روه‌ها کۆشک و ته‌لاری خۆش و ڕازاوه و پاك و خاوێن له باخه‌کانی به‌هه‌شتی عه‌دندا، به‌ڕاستی ئا ئه‌وه‌یه سه‌رکه‌وتن و سه‌رفرازی و ده‌ستکه‌وتی گه‌وره و بێسنوور.",
            "verse 61:13": "Yeka din jî ku hûn jê hiz dikin: yariyek ji Xuda û pîroziyek nêz. Tu mizgîn bide bawermendanجا شتێکی تریش هه‌یه که حه‌زی لێ ده‌که‌ن، ئه‌ویش به‌خشینی سه‌رکه‌وتنه له‌لایه‌ن خواوه و کردنه‌وه‌ی وڵاتان و دڵه‌کانه، ئه‌و مژده‌یه‌ش بده به ئیمانداران (له هه‌موو سه‌رده‌مێک، گه‌ر ئیمانداران لێ ببڕێن بۆ ئاینی خوای مه‌زن).",
            "verse 61:14": "Gelî ên bawerî anîne! hûn bibin alîkarê Xuda. Çewa ku Îsa kurê Meryemê ji þagirtan re got ku: \"Bi alî Xuda ve kî alîkarê min e?\" Þagirtan got: \"Em alîkarê Xuda ne.\" Vêca ji zariyê Îsraîl destekî bawerî anî û destekî jî kafir bûn. Vêca me ên bawerî anîn li ser neyarên wan zeximand êdî ew bi ser ketinئه‌ی ئه‌و که‌سانه‌ی که ئیمان و باوه‌ڕتان هێنه‌وه ببنه پشتیوانی به‌رنامه و دینی خوا ببینه لایه‌نگری په‌روه‌ردگار، هه‌روه‌کو عیسای کوڕی مه‌ریه‌م به حه‌واریه‌کانی هاوه‌ڵی وت: کێ پشتیوان و یارو یاوه‌رمه بۆ ڕێبازی خوا، حه‌واری و هاوه‌ڵه‌کانی وتیان: ئێمه ئاماده‌ین ببینه پشتیوان و لایه‌نگیری خوا، ئه‌وسا ئیتر خه‌ڵکی بوون به دوو ده‌سته‌وه‌، ده‌سته‌یه‌ک له نه‌وه‌ی ئیسرائیل باوه‌ڕی هێناو شوین به‌رنامه‌ی خوا که‌وت، ده‌سته‌یه‌کیش ڕێبازی کوفری گرته‌به‌ر، جا ئێمه‌ش پشتیوانیمان له ئیمانداران کردو به‌و هۆیه‌وه سه‌رکه‌وتنمان به‌سه‌ر دوژمنه‌کانیاندا پێبه‌خسین و زاڵ بوون."
        },
        "Kyrgyz": {
            "verse 61:1": "Аллаһка асмандардагы жана жердеги бардык нерселер тасбих айтты. Ал — Кудуреттүү, Даанышман",
            "verse 61:2": "О,момундар! Эмне үчүн жасабаган ишиңерди сүйлөйсүңөр",
            "verse 61:3": "Жасабаган ишиңерди сүйлөө Аллаһтын алдында чоң күнөө",
            "verse 61:4": "Аллаһ Өзүнүн Жолунда тегиз курулган үйлөр сыяктуу сап-сап болуп согушкан пенделерин сүйөт",
            "verse 61:5": "(О, Мухаммад!) эстегин, бир кезде Муса өзүнүн коомуна «О, коомум! Эмнеге мени ирээнжитип жатасыңар? Мен Аллаһтын силерге жиберилген пайгамбары экенимди билесиңерго!» деди. Анан качан гана алар (акыйкаттан) бурулуп кеткенде, Аллаһ дагы алардын жүрөгүн (акыйкатты кабыл алуудан) буруп койду. Аллаһ бузуку коомду Туура Жолго баштабайт",
            "verse 61:6": "Эстегин, (бир кезде) Марямдын уулу Ыйса (мындай) деди: «О, Исрайил урпактары! Мен силерге Аллаһдан жиберилген пайгамбар боломун. (Мен) өзүмдөн мурдагы Тооратты(н өкүмдөрүн) тастыктаймын жана менден кийин келе турган, ысымы «Ахмад» болгон пайгамбар жөнүндө (алдын ала) сүйүнчү кабар айтамын»!. Анан качан ал (Мухаммад) аларга анык далилдерди алып келгенде (ыйман келтирүүнүн ордуна) «бул анык сыйкырго!» дешти",
            "verse 61:7": "Исламга чакырылганда Аллаһка жалаа жапкан адамдан заалымыраак ким бар?! Аллаһ заалым адамдарды Туура Жолго баштабайт",
            "verse 61:8": "Аллаһтын Нурун ооздору менен (үйлөп) өчүрүүнү каалашат! Бирок, каапырлар жаман көргөнү менен Аллаһ Өзүнүн Нурун толук (бүт ааламга) жеткирет",
            "verse 61:9": "Ал Өзүнүн пайгамбарын Туура Жол жана Акыйкат Дин менен — ал динди бардык диндерден үстөм кылуу үчүн — жиберди?. Эгер мушриктер жаман көрсө да",
            "verse 61:10": "О, ыйман келтиргендер! Мен силерди жан ооруткан азаптан сактап калчу «соодага» баштайынбы",
            "verse 61:11": "(Ал соода төмөндөгүчө:) Аллаһка жана Анын пайгамбарына ыйман келтиресиңер, Аллаһтын Жолунда малыңар жана жаныңар менен жихад кыласыңар. Ушул силер үчүн жакшы (соода) эгер билсеңер",
            "verse 61:12": "(Ошондо Аллаһ) силердин күнөөңөрдү кечирип, түбүнөн дарыялар аккан бейиштерге жана Адн (түбөлүктүүлүк) бейиштериндеги пакиза жашоо жайларына киргизет. Бул — Улуу Жеңиш",
            "verse 61:13": "Дагы силер жакшы көргөн нерсени (да Аллаһ силерге белек кылат. Ал —) Аллаһтын жардамы жана жакында келе турган жеңиш! (О, Мухаммад! Сен ушул жеңишти) ыймандууларга сүйүнчүлө",
            "verse 61:14": "О, ыйман келтирген пенделер! Аллаһтын (дининин) жардамчылары болгула! Ушул сыяктуу Марямдын уулу Ыйса дагы шакирттерине «Аллаһ Жолунда ким мага жардамчы болот?» дегенде, шакирттери «Биз — Аллаһтын жардамчылары!» дешкен. Анан, Исрайил урпактарынан бир тайпасы (Ыйсанын динине) ыйман келтирип, дагы бир тайпалар каапыр болушту. Биз ыйман келтиргендерди душмандарынан кубаттуу кылдык эле, натыйжада алар жеңип чыгышты"
        },
        "Malay": {
            "verse 61:1": "Segala yang ada di langit dan yang ada di bumi, tetap mengucap tasbih kepada Allah; dan Dia lah Yang Maha Kuasa, lagi Maha Bijaksana.",
            "verse 61:2": "Wahai orang-orang yang beriman! Mengapa kamu memperkatakan apa yang kamu tidak melakukannya!",
            "verse 61:3": "Amat besar kebenciannya di sisi Allah - kamu memperkatakan sesuatu yang kamu tidak melakukannya.",
            "verse 61:4": "Sesungguhnya Allah mengasihi orang-orang yang berperang untuk membela ugamaNya, dalam barisan yang teratur rapi, seolah-olah mereka sebuah bangunan yang tersusun kukuh.",
            "verse 61:5": "Dan (ingatlah peristiwa) ketika Nabi Musa berkata kepada kaumnya: \" Wahai kaumku! Mengapa kamu menyakiti daku, sedang kamu mengetahui bahawa sesungguhnya aku ini Pesuruh Allah kepada kamu?\" Maka ketika mereka menyeleweng (dari kebenaran yang mereka sedia mengetahuinya), Allah selewengkan hati mereka (dari mendapat hidayah petunjuk); dan sememangnya Allah tidak memberi hidayah petunjuk kepada kaum yang fasik - derhaka.",
            "verse 61:6": "Dan (ingatlah juga peristiwa) ketika Nabi Isa ibni Maryam berkata: \"Wahai Bani Israil, sesungguhnya aku ini Pesuruh Allah kepada kamu, mengesahkan kebenaran Kitab yang diturunkan sebelumku, iaitu Kitab Taurat, dan memberikan berita gembira dengan kedatangan seorang Rasul yang akan datang kemudian daripadaku - bernama: Ahmad\". Maka ketika ia datang kepada mereka membawa keterangan-keterangan yang jelas nyata, mereka berkata: \"Ini ialah sihir yang jelas nyata!\"",
            "verse 61:7": "Dan tidak ada yang lebih zalim daripada orang yang mengada-adakan perkara dusta terhadap Allah, sedang ia diajak kepada memeluk Islam; dan (ingatlah), Allah tidak memberi hidayah petunjuk kepada orang-orang yang zalim.",
            "verse 61:8": "Mereka sentiasa berusaha hendak memadamkan cahaya Allah (ugama Islam) dengan mulut mereka, sedang Allah tetap menyempurnakan cahayaNya, sekalipun orang-orang kafir tidak suka (akan yang demikian).",
            "verse 61:9": "Dia lah yang telah mengutus RasulNya (Muhammad s.a.w) dengan membawa hidayah petunjuk dan ugama yang benar (ugama Islam), supaya Ia memenangkannya dan meninggikannya atas segala ugama yang lain, walaupun orang-orang musyrik tidak menyukainya.",
            "verse 61:10": "Wahai orang-orang yang beriman! Mahukah Aku tunjukkan sesuatu perniagaan yang boleh menyelamatkan kamu dari azab seksa yang tidak terperi sakitnya?",
            "verse 61:11": "Iaitu, kamu beriman kepada Allah dan rasulNya, serta kamu berjuang membela dan menegakkan ugama Allah dengan harta benda dan diri kamu; yang demikian itulah yang lebih baik bagi kamu, jika kamu hendak mengetahui (hakikat yang sebenarnya).",
            "verse 61:12": "(Dengan itu) Allah akan mengampunkan dosa-dosa kamu, dan memasukkan kamu ke dalam taman-taman yang mengalir di bawahnya beberapa sungai, serta ditempatkan kamu di tempat-tempat tinggal yang baik dalam Syurga \" Adn \". Itulah kemenangan yang besar.",
            "verse 61:13": "Dan ada lagi limpah kurnia yang kamu sukai, iaitu pertolongan dari Allah dan kemenangan yang cepat (masa berlakunya). Dan sampaikanlah berita yang mengembirakan itu kepada orang-orang yang beriman.",
            "verse 61:14": "Wahai orang-orang yang beriman! Jadikanlah diri kamu pembela-pembela (ugama) Allah sebagaimana (keadaan penyokong-penyokong) Nabi Isa ibni Maryam (ketika ia) berkata kepada penyokong-penyokongnya itu: \"Siapakah penolong-penolongku (dalam perjalananku) kepada Allah (dengan menegakkan ugamaNya)?\" Mereka menjawab: \"Kamilah pembela-pembela (ugama) Allah!\" (Setelah Nabi Isa tidak berada di antara mereka) maka sepuak dari kaum Bani Israil beriman, dan sepuak lagi (tetap) kafir. Lalu Kami berikan pertolongan kepada orang-orang yang beriman untuk mengalahkan musuhnya, maka menjadilah mereka orang-orang yang menang."
        },
        "Malayalam": {
            "verse 61:1": "ആകാശങ്ങളിലുള്ളതും ഭൂമിയിലുള്ളതും അല്ലാഹുവിന്‍റെ മഹത്വം പ്രകീര്‍ത്തിച്ചിരിക്കുന്നു. അവനാകുന്നു പ്രതാപിയും യുക്തിമാനും.",
            "verse 61:2": "സത്യവിശ്വാസികളേ, നിങ്ങള്‍ ചെയ്യാത്തതെന്തിന് നിങ്ങള്‍ പറയുന്നു?",
            "verse 61:3": "നിങ്ങള്‍ ചെയ്യാത്തത് നിങ്ങള്‍ പറയുക എന്നുള്ളത് അല്ലാഹുവിങ്കല്‍ വലിയ ക്രോധത്തിന് കാരണമായിരിക്കുന്നു.",
            "verse 61:4": "(കല്ലുകള്‍) സുദൃഢമായി സംയോജിപ്പിച്ച ഒരു മതില്‍ പോലെ അണിചേര്‍ന്നുകൊണ്ട് തന്‍റെ മാര്‍ഗത്തില്‍ യുദ്ധം ചെയ്യുന്നവരെ തീര്‍ച്ചയായും അല്ലാഹു ഇഷ്ടപ്പെടുന്നു.",
            "verse 61:5": "മൂസാ തന്‍റെ ജനതയോട് ഇപ്രകാരം പറഞ്ഞ സന്ദര്‍ഭം (ശ്രദ്ധേയമാകുന്നു:) എന്‍റെ ജനങ്ങളേ, നിങ്ങള്‍ എന്തിനാണ് എന്നെ ഉപദ്രവിക്കുന്നത്‌? ഞാന്‍ നിങ്ങളിലേക്കുള്ള അല്ലാഹുവിന്‍റെ ദൂതനാണെന്ന് നിങ്ങള്‍ക്കറിയാമല്ലോ. അങ്ങനെ അവര്‍ തെറ്റിയപ്പോള്‍ അല്ലാഹു അവരുടെ ഹൃദയങ്ങളെ തെറ്റിച്ചുകളഞ്ഞു. അല്ലാഹു ദുര്‍മാര്‍ഗികളായ ജനങ്ങളെ നേര്‍വഴിയിലാക്കുകയില്ല.",
            "verse 61:6": "മര്‍യമിന്‍റെ മകന്‍ ഈസാ പറഞ്ഞ സന്ദര്‍ഭവും (ശ്രദ്ധേയമാകുന്നു:) ഇസ്രായീല്‍ സന്തതികളേ, എനിക്കു മുമ്പുള്ള തൌറാത്തിനെ സത്യപ്പെടുത്തുന്നവനായിക്കൊണ്ടും, എനിക്ക് ശേഷം വരുന്ന അഹ്മദ് എന്നുപേരുള്ള ഒരു ദൂതനെപ്പറ്റി സന്തോഷവാര്‍ത്ത അറിയിക്കുന്നവനായിക്കൊണ്ടും നിങ്ങളിലേക്ക് അല്ലാഹുവിന്‍റെ ദൂതനായി നിയോഗിക്കപ്പെട്ടവനാകുന്നു ഞാന്‍. അങ്ങനെ അദ്ദേഹം വ്യക്തമായ തെളിവുകളും കൊണ്ട് അവരുടെ അടുത്ത് ചെന്നപ്പോള്‍ അവര്‍ പറഞ്ഞു: ഇത് വ്യക്തമായ ജാലവിദ്യയാകുന്നു.",
            "verse 61:7": "താന്‍ ഇസ്ലാമിലേക്ക് ക്ഷണിക്കപ്പെടുമ്പോള്‍ അല്ലാഹുവിന്‍റെ പേരില്‍ കള്ളം കെട്ടിച്ചമച്ചവനേക്കാള്‍ വലിയ അക്രമി ആരുണ്ട്‌? അല്ലാഹു അക്രമികളായ ജനങ്ങളെ നേര്‍വഴിയിലാക്കുകയില്ല.",
            "verse 61:8": "അവര്‍ അവരുടെ വായ്കൊണ്ട് അല്ലാഹുവിന്‍റെ പ്രകാശം കെടുത്തിക്കളയാനാണ് ഉദ്ദേശിക്കുന്നത്‌. സത്യനിഷേധികള്‍ക്ക് അനിഷ്ടകരമായാലും അല്ലാഹു അവന്‍റെ പ്രകാശം പൂര്‍ത്തിയാക്കുന്നവനാകുന്നു.",
            "verse 61:9": "സന്‍മാര്‍ഗവും സത്യമതവും കൊണ്ട് -എല്ലാ മതങ്ങള്‍ക്കും മീതെ അതിനെ തെളിയിച്ചു കാണിക്കുവാന്‍ വേണ്ടി-തന്‍റെ ദൂതനെ നിയോഗിച്ചവനാകുന്നു അവന്‍. ബഹുദൈവാരാധകര്‍ക്ക് (അത്‌) അനിഷ്ടകരമായാലും ശരി.",
            "verse 61:10": "സത്യവിശ്വാസികളേ, വേദനാജനകമായ ശിക്ഷയില്‍ നിന്ന് നിങ്ങളെ രക്ഷിക്കുന്ന ഒരു കച്ചവടത്തെപ്പറ്റി ഞാന്‍ നിങ്ങള്‍ക്ക് അറിയിച്ച് തരട്ടെയോ?",
            "verse 61:11": "നിങ്ങള്‍ അല്ലാഹുവിലും അവന്‍റെ ദൂതനിലും വിശ്വസിക്കണം.അല്ലാഹുവിന്‍റെ മാര്‍ഗത്തില്‍ നിങ്ങളുടെ സ്വത്തുക്കള്‍ കൊണ്ടും ശരീരങ്ങള്‍ കൊണ്ടും നിങ്ങള്‍ സമരം ചെയ്യുകയും വേണം. അതാണ് നിങ്ങള്‍ക്ക് ഗുണകരമായിട്ടുള്ളത്‌. നിങ്ങള്‍ അറിവുള്ളവരാണെങ്കില്‍.",
            "verse 61:12": "എങ്കില്‍ അവന്‍ നിങ്ങള്‍ക്ക് നിങ്ങളുടെ പാപങ്ങള്‍ പൊറുത്തുതരികയും താഴ്ഭാഗത്ത്കൂടി അരുവികള്‍ ഒഴുകുന്ന സ്വര്‍ഗത്തോപ്പുകളിലും, സ്ഥിരവാസത്തിനുള്ള സ്വര്‍ഗത്തോപ്പുകളിലെ വിശിഷ്ടമായ വസതികളിലും അവന്‍ നിങ്ങളെ പ്രവേശിപ്പിക്കുകയും ചെയ്യുന്നതാണ്‌. അതത്രെ മഹത്തായ ഭാഗ്യം.",
            "verse 61:13": "നിങ്ങള്‍ ഇഷ്ടപ്പെടുന്ന മറ്റൊരു കാര്യവും (അവന്‍ നല്‍കുന്നതാണ്‌.) അതെ, അല്ലാഹുവിങ്കല്‍ നിന്നുള്ള സഹായവും ആസന്നമായ വിജയവും. (നബിയേ,) സത്യവിശ്വാസികള്‍ക്ക് നീ സന്തോഷവാര്‍ത്ത അറിയിക്കുക.",
            "verse 61:14": "സത്യവിശ്വാസികളേ, നിങ്ങള്‍ അല്ലാഹുവിന്‍റെ സഹായികളായിരിക്കുക. മര്‍യമിന്‍റെ മകന്‍ ഈസാ അല്ലാഹുവിങ്കലേക്കുള്ള മാര്‍ഗത്തില്‍ എന്‍റെ സഹായികളായി ആരുണ്ട് എന്ന് ഹവാരികളോട് ചോദിച്ചതു പോലെ. ഹവാരികള്‍ പറഞ്ഞു: ഞങ്ങള്‍ അല്ലാഹുവിന്‍റെ സഹായികളാകുന്നു. അപ്പോള്‍ ഇസ്രായീല്‍ സന്തതികളില്‍ പെട്ട ഒരു വിഭാഗം വിശ്വസിക്കുകയും മറ്റൊരു വിഭാഗം അവിശ്വസിക്കുകയും ചെയ്തു. എന്നിട്ട് വിശ്വസിച്ചവര്‍ക്ക് അവരുടെ ശത്രുവിനെതിരില്‍ നാം പിന്‍ബലം നല്‍കുകയും അങ്ങനെ അവന്‍ മികവുറ്റവരായിത്തീരുകയും ചെയ്തു."
        },
        "Norwegian": {
            "verse 61:1": "Alt som er i himlene og på jord, priser Gud! Han er den Mektige, den Vise.",
            "verse 61:2": "Dere som tror, hvorfor sier dere det dere ikke gjør?",
            "verse 61:3": "Det er til stor avsky for Gud at dere sier det dere ikke gjør!",
            "verse 61:4": "Gud holder av dem som kjemper for Hans sak på rad og rekke, som var de en kompakt mur.",
            "verse 61:5": "En gang sa Moses til sitt folk: «Mitt folk, hvorfor plager dere meg, skjønt dere vet at jeg er Guds sendebud til dere?» Og da de kom på avveie, lot Gud deres hjerter komme på avveie. Gud leder ikke et syndefullt folk.",
            "verse 61:6": "En gang sa Jesus, Marias sønn: «Israels barn, jeg er Guds sendebud til dere, for å stadfeste loven som foreligger før meg, og bebude et sendebud som kommer etter meg, hvis navn er Ahmad.» Og da han kom til dem med klare bevis, sa de: «Dette er skjær trolldom.»",
            "verse 61:7": "Og hvem gjør større urett enn den som dikter opp løgn mot Gud, når han kalles til å gi seg Gud i vold? Gud leder ikke et urettferdig folk.",
            "verse 61:8": "De ønsker å blåse ut Guds lys, men Gud fullbyrder Sitt lys, selv om de vantro misliker det.",
            "verse 61:9": "Han er det, som har sendt Sitt sendebud med ledelse og sannhets religion, så Han kan la den vinne frem overfor all religion, selv om avgudsdyrkerne misliker det.",
            "verse 61:10": "Dere som tror, skal Jeg henvise dere til en handel, som kan redde dere fra en smertelig straff?",
            "verse 61:11": "Dere skal tro på Gud og Hans sendebud, og satse liv og eiendom for Guds sak. Dette er et gode for dere, om dere bare visste!",
            "verse 61:12": "Han vil forlate dere deres synder, og føre dere inn i paradisets haver, hvor bekker sildrer, og i herlige boliger i Edens haver. Dette er den store seier.",
            "verse 61:13": "Og annet, som dere har kjært, hjelp fra Gud og snarlig seier. Forkynn de troende det glade budskap!",
            "verse 61:14": "Dere som tror, vær Guds hjelpesmenn, slik som Jesus, Marias sønn, sa til disiplene: «Hvem vil bli mine hjelpesmenn hen til Gud?» Disiplene sa: «Vi er Guds hjelpesmenn!» Og en gruppe av Israels barn trodde, og en gruppe fornektet. Så støttet Vi dem som trodde mot deres fiende, og de tok seieren!"
        },
        "Pashto": {
            "verse 61:1": "د الله پاكي بیانوي هر هغه څه چې په اسمانونو كې دي او هر هغه څه چې په ځمكه كې دي او هم دى ښه غالب، ډېر حكمت والا دى",
            "verse 61:2": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو هغه (خبره) ولې وایئ چې نه يې كوئ!",
            "verse 61:3": "دا (خبره) د الله په نیز د غضب په لحاظ لویه ده چې تاسو هغه (خبره) ووایئ چې نه يې كوئ",
            "verse 61:4": "بېشكه الله هغه كسان خوښوي چې د هغه په لاره كې صف تړلي جنګېږي، ګویاكې دوى په قلعي سره په یو بل پورې ټینګ كړى شوى (ښه محكم) عمارت دي",
            "verse 61:5": "او (یاد كړه) هغه وخت چې موسٰی خپل قوم ته وویل: اى زما قومه! تاسو ما ته ولې ضرر رارسوئ، حال دا چې تاسو پوهېږئ چې یقینًا زه تاسو ته د الله رسول یم۔، نو كله چې دوى (د الله له حكم نه) كاږه شول، نوالله د دوى زړونه كاږه كړل۔ او الله نافرمانه قوم ته هدایت نه كوي",
            "verse 61:6": "او (یاده كړه) هغه وخت چې د مریمې زوى عیسٰی وویل: اى بني اسرائیلو! بېشكه زه تاسو ته د الله رسول یم، چې د هغه څه تصدیق كوونكى یم چې له ما نه مخكې تېر شوى دى، چې تورات دى او د داسې رسول زېرى دركوونكى یم چې له ما نه وروسته به راځي، چې د هغه نوم احمد دى۔، نو كله چې دوى ته دغه (رسول) له ښكاره معجزو سره راغى (نو) دوى وویل: دا ښكاره جادو دى",
            "verse 61:7": "او له هغه چا نه لوى ظالم څوك دى چې په الله پورې له ځانه دروغ تړي، حال دا چې هغه اسلام ته بللى شي۔ او الله ظالم قوم ته هدایت نه كوي",
            "verse 61:8": "دوى غواړي چې په خپلو خولو سره د الله رڼا مړه كړي۔ او الله د خپلې رڼا پوره كوونكى دى۔ اګر كه كافران (دا كار) بد ګڼي",
            "verse 61:9": "دغه (الله) هغه ذات دى چې خپل رسول يې په هدایت او حق دین سره لېږلى دى، د دې لپاره چې دغه (الله) دغه (حق دین) ته په نورو ټولو دینونو باندې غلبه وركړي۔، اګر كه مشركان دغه (كار) بد ګڼي",
            "verse 61:10": "اى هغو كسانو چې ایمان يې راوړى دى! ایا زه تاسو ته داسې تجارت (سوداګري) وښیم چې تاسو ته به له ډېر دردونكي عذاب نه نجات دركوي",
            "verse 61:11": "تاسو په الله او د هغه په رسول ایمان لرئ او د الله په لاره كې په خپلو مالونو او خپلو ځانونو سره جهاد كوئ۔، دا تاسو لپاره ډېر غوره دي۔ كه تاسو پوهېږئ",
            "verse 61:12": "هغه به تاسو ته ستاسو ګناهونه وبخښي او تاسو به داسې جنتونو ته داخل كړي چې د هغو له لاندې ولې بهېږي او د تل اوسېدنې په جنتونو كې په ډېرو پاكېزه استوګنو كې (به مو داخل كړي) ۔، دغه ډېره لویه كامیابي ده",
            "verse 61:13": "او بل (نعمت) چې تاسو يې خوښوئ، د الله له جانبه مرسته او نژدې برى دى او ته مومنانو ته زېرى وركړه",
            "verse 61:14": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو د الله مدد كوونكي شئ، لكه چې د مریمې زوى عیسٰی حواریانو (خپلو ملګرو) ته ویلي وو: د الله طرف ته زما مدد كوونكي څوك دي؟ حواریانو وویل: مونږ د الله مدد كوونكي یو، نو په بني اسرائیلو كې یوې ډلې ایمان راوړو او بله ډله كافره شوه، نو مونږ هغو كسانو ته د خپل دښمن په خلاف قوت وركړو چې ایمان يې راوړى و، نو دوى غالبه شول"
        },
        "Persian": {
            "verse 61:1": "خدا را تسبيح گويند هر چه در آسمانها و در زمين است، و اوست پيروزمند و حكيم.",
            "verse 61:2": "اى كسانى كه ايمان آورده‌ايد، چرا سخنانى مى‌گوييد كه به كارشان نمى‌بنديد؟",
            "verse 61:3": "خداوند سخت به خشم مى‌آيد كه چيزى بگوييد و به جاى نياوريد.",
            "verse 61:4": "خدا دوست دارد كسانى را كه در راه او در صفى، همانند ديوارى كه اجزايش را با سُرب به هم پيوند داده باشند، مى‌جنگند.",
            "verse 61:5": "و موسى به قوم خود گفت: اى قوم من، چرا مرا مى‌آزاريد، حال آنكه مى‌دانيد كه من پيامبر خدا بر شما هستم؟ چون از حق رويگردان شدند خدا نيز دلهاشان را از حق بگردانيد. و خدا مردم نافرمان را هدايت نمى‌كند.",
            "verse 61:6": "و عيسى‌بن‌مريم گفت: اى بنى اسرائيل، من پيامبر خدا بر شما هستم. توراتى را كه پيش از من بوده است تصديق مى‌كنم، و به پيامبرى كه بعد از من مى‌آيد و نامش احمد است، بشارتتان مى‌دهم. چون آن پيامبر با آيات روشن خود آمد، گفتند: اين جادويى است آشكار.",
            "verse 61:7": "كيست ستمكارتر از آن كس كه به خدا دروغ مى‌بندد، در حالى كه او را به اسلام دعوت مى‌كنند؟ و خدا ستمكاران را هدايت نمى‌كند.",
            "verse 61:8": "مى‌خواهند نور خدا را به دهانهايشان خاموش كنند ولى خدا كامل‌كننده نور خويش است، اگر چه كافران را ناخوش آيد.",
            "verse 61:9": "اوست آن خدايى كه پيامبر خود را همراه با هدايت و دين راستين بفرستاد تا او را بر همه اديان پيروز گرداند، هر چند مشركان را ناخوش آيد.",
            "verse 61:10": "اى كسانى كه ايمان آورده‌ايد، آيا شما را به تجارتى كه از عذاب دردآور رهاييتان دهد راه بنمايم؟",
            "verse 61:11": "به خدا و پيامبرش ايمان بياوريد، و در راه خدا با مال و جان خويش جهاد كنيد. و اين براى شما بهتر است، اگر دانا باشيد.",
            "verse 61:12": "گناهان شما را مى‌آمرزد و به بهشتهايى كه درونش نهرها جارى است و نيز خانه هايى خوش و پاكيزه در بهشتهاى جاويد داخل مى‌كند، و اين پيروزى بزرگى است.",
            "verse 61:13": "و نعمتى ديگر كه دوستش داريد: نُصرتى است از جانب خداوند و فتحى نزديك، و مؤمنان را بشارت ده.",
            "verse 61:14": "اى كسانى كه ايمان آورده‌ايد، ياوران خدا باشيد، همچنان كه عيسى بن مريم به حواريان گفت: چه كسانى ياوران من در راه خدايند؟ حواريان گفتند: ما ياوران خدا هستيم. پس گروهى از بنى‌اسرائيل ايمان آوردند و گروهى كافر شدند. ما كسانى را كه ايمان آورده بودند بر ضد دشمنانشان مدد كرديم تا پيروز شدند."
        },
        "Polish": {
            "verse 61:1": "Wysławia Boga to, co jest w niebiosach, i to, co jest na ziemi. On jest Potężny, Mądry!",
            "verse 61:2": "O wy, którzy wierzycie! Dlaczego mówicie to, czego nie czynicie?",
            "verse 61:3": "Bardzo nienawistne jest Bogu, iż mówicie to, czego nie czynicie.",
            "verse 61:4": "Zaprawdę, Bóg miłuje tych, którzy walczą na Jego drodze w zwartych szeregach, jak gdyby byli budowlą solidną.",
            "verse 61:5": "Oto powiedział Mojżesz do swego ludu: \"O ludu mój! Dlaczego wy mnie obrażacie? Przecież wiecie, że Bóg posłał mnie do was.\" A kiedy oni się odsunęli, Bóg odsunął ich serca. Bóg nie prowadzi drogą prostą ludzi szerzących zepsucie!",
            "verse 61:6": "Oto powiedział Jezus, syn Marii: \"O synowie Izraela! Jestem wysłany od Boga do was, aby potwierdzić prawdziwość tego, co przede mną było zesłane w Torze, i zwiastować Posłańca, który przyjdzie po mnie, a którego imię - Ahmad!\" Lecz kiedy on przyszedł z jasnymi dowodami, oni powiedzieli: \"To są czary oczywiste!\"",
            "verse 61:7": "A kto jest bardziej niesprawiedliwy aniżeli ten, kto mówi kłamstwo przeciw Bogu, kiedy jest wzywany do islamu? Bóg nie prowadzi drogą prostą ludzi niesprawiedliwych.",
            "verse 61:8": "Oni chcą zagasić światło Boga swoimi ustami; lecz Bóg dopełni Swoje światło, chociaż by to było nienawistne dla niewiernych.",
            "verse 61:9": "On jest Tym, który wysłał Swojego Posłańca z drogą prostą i religią prawdy, aby ją wznieść ponad wszelką religię, chociażby to było nienawistne dla bałwochwalców.",
            "verse 61:10": "O wy, którzy wierzycie! Czyż mogę ukazać wam handel, który by was wybawił od kary bolesnej?",
            "verse 61:11": "Będziecie wierzyć w Boga i Jego Posłańca! Będziecie walczyć na drodze Boga waszym majątkiem i waszymi duszami! To będzie lepsze dla was - o, gdybyście tylko mogli to wiedzieć!",
            "verse 61:12": "Wtedy On przebaczy wam wasze grzechy i wprowadzi was do Ogrodów, gdzie w dole płyną strumyki, i do mieszkań przyjemnych w Ogrodach Edenu. To jest osiągnięcie ogromne!",
            "verse 61:13": "I da wam inne rzeczy, które wy kochacie, pomoc od Boga i bliskie zwycięstwo. Zwiastuj radosną nowinę wiernym!",
            "verse 61:14": "O wy, którzy wierzycie! Bądźcie pomocnikami Boga, jak powiedział Jezus, syn Marii, do apostołów: \"Którzy będą moimi pomocnikami w dążeniu do Boga?\" Apostołowie powiedzieli: \"My jesteśmy pomocnikami Boga!\" I uwierzyła pewna część synów Izraela, a część pozostała niewierna. Wtedy umocniliśmy tych, którzy uwierzyli, przeciwko ich nieprzyjaciołom; i oni stali się zwycięzcami."
        },
        "Portuguese": {
            "verse 61:1": "Tudo quanto existe nos céus e na terra glorifica Deus, porque Ele é o Poderoso, o Prudentíssimo.",
            "verse 61:2": "Ó fiéis, por que dizeis o que não fazeis?",
            "verse 61:3": "É enormemente odioso, perante Deus, dizerdes o que não fazeis.",
            "verse 61:4": "Em verdade, Deus aprecia aqueles que combatem, em fileiras, por Sua causa, como se fossem uma sólida muralha.",
            "verse 61:5": "Recorda-te (ó Mensageiro) de quando Moisés disse ao seu povo: Ó povo meu, porque me injuriais, quando sabeis que souo mensageiro de Deus, enviado a vós? Porém, quando se desviaram, Deus desviou os seus corações, porque Deus nãoencaminha os depravados.",
            "verse 61:6": "E de quando Jesus, filho de Maria, disse: Ó israelitas, em verdade, sou o mensageiro de Deus, enviado a vós, corroborante de tudo quanto a Tora antecipou no tocante às predições, e alvissareiro de um Mensageiro que virá depois demim, cujo nome será Ahmad! Entretanto, quando lhes foram apresentadas as evidências, disseram: Isto é pura magia!",
            "verse 61:7": "Haverá alguém mais iníquo do que quem forja mentiras acerca de Deus, apesar de ter sido convocado ao Islam? Sabei queDeus não encaminha os iníquos.",
            "verse 61:8": "Pretendem extinguir a Luz de Deus com as suas (infames) bocas; porém, Deus completará a (revelação de) Sua Luz, embora isso desgoste os incrédulos.",
            "verse 61:9": "Foi Ele Quem enviou o Seu Mensageiro, com a orientação e com a verdadeira religião, para fazê-las prevalecer sobretoda a religião, ainda que isso desgoste os idólatras.",
            "verse 61:10": "Ó fiéis, quereis que vos indique uma troca que vos livre de um castigo doloroso?",
            "verse 61:11": "É que creiais em Deus e em Seu Mensageiro, e que sacrifiqueis os vossos bens e pessoas pela Sua causa. Isso é omelhor, para vós, se quereis saber.",
            "verse 61:12": "Ele vos perdoará os pecados e vos introduzirá em jardins, abaixo dos quais correm os rios, bem como nas prazerosasmoradas do Jardim do Éden. Tal é o magnífico benefício.",
            "verse 61:13": "E, ademais, conceder-vos-á outra coisa que anelais, ou seja: o socorro de Deus e o triunfo imediato. (Ó Mensageiro), anuncia aos crentes boas novas!",
            "verse 61:14": "Ó fiéis, sede os auxiliadores de Deus, como disse Jesus, filho de Maria, aos discípulos: Quem são os meus auxiliadores, na causa de Deus? Responderam: Nós somos os auxiliadores de Deus! Acreditou, então, uma parte dos israelitas, e outradesacreditou; então, socorremos os fiéis contra seus inimigos, e eles saíram vitoriosos."
        },
        "Punjabi": {
            "verse 61:1": "ਹਰੇਕ ਚੀਜ਼ ਜਿਹੜੀ ਅਸਮਾਨਾਂ ਅਤੇ ਧਰਤੀ ਵਿਚ ਹੈ, ਅੱਲਾਹ ਦੀ ਹੀ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰਦੀ ਹੈ। ਅਤੇ ਉਹ ਤਾਕਤਵਰ ਅਤੇ ਹਿਕਮਤ ਹੈ।",
            "verse 61:2": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ, ਤੁਸੀਂ ਅਜਿਹੀ ਗੱਲ ਕਿਉਂ ਆਖਦੇ ਹੋ, ਜਿਹੜੀ ਤੁਸੀਂ ਕਰਦੇ ਨਹੀਂ।",
            "verse 61:3": "ਅੱਲਾਹ ਦੇ ਨਜ਼ਦੀਕ ਇਹ ਗੱਲ ਬਹੁਤ ਨਾ-ਖੁਸ਼ੀ ਦੀ ਹੈ। ਕਿ ਤੁਸੀਂ ਅਜਿਹੀ ਗੱਲ ਕਹੋਂ, ਜਿਹੜੀ ਤੁਸੀਂ ਕਰਦੇ ਨਹੀਂ।",
            "verse 61:4": "ਅੱਲਾਹ ਤਾਂ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਨੂੰ ਪਸੰਦ ਕਰਦਾ ਹੈ। ਜਿਹੜੇ ਉਸ ਦੇ ਰਾਹ ਵਿਚ (ਇਸ ਤਰਾਂ) ਕਤਾਰਾਂ ਬੰਨ੍ਹ ਕੇ ਰਲ ਮਿਲ ਕੇ ਯੁੱਧ ਕਰਦੇ ਹਨ, ਜਿਵੇਂ ਸੀਸੇ (ਇੱਕ ਪ੍ਰਕਾਰ ਦੀ ਧਾਤੂ) ਦੀ ਢਲੀ ਹੋਈ ਕੰਧ ਹੋਣ।",
            "verse 61:5": "ਅਤੇ ਜਦੋਂ ਮੂਸਾ ਨੇ ਆਪਣੀ ਕੌਮ ਨੂੰ ਆਖਿਆ ਕਿ ਹੇ ਮੇਰੀ ਕੌਮ! ਤੁਸੀਂ ਲੋਕ ਮੈਨੂੰ ਕਿਉਂ ਪ੍ਰੇਸ਼ਾਨ ਕਰਦੇ ਹੋ, ਹਾਲਾਂਕਿ ਤੁਸੀਂ ਜਾਣਦੇ ਹੋ ਕਿ ਮੈਂ ਤੁਹਾਡੇ ਵੱਲ ਅੱਲਾਹ ਦਾ ਭੇਜਿਆ ਹੋਇਆ ਰਸੂਲ ਹਾਂ। ਸੋ ਜਦੋਂ ਉਹ ਫਿਰ ਗਏ, ਤਾਂ ਅੱਲਾਹ ਨੇ ਉਨ੍ਹਾਂ ਦੇ ਦਿਲਾਂ ਨੂੰ ਵੀ ਫੇਰ ਦਿੱਤਾ। ਅਤੇ ਅੱਲਾਹ ਅਵੱਗਿਆਕਾਰੀ ਲੋਕਾਂ ਨੂੰ ਮਾਰਗ ਦਰਸ਼ਨ ਨਹੀਂ ਬਖ਼ਸ਼ਦਾ।",
            "verse 61:6": "ਅਤੇ ਜਦੋਂ ਮਰੀਅਮ ਤੇ ਬੇਟੇ ਈਸਾ ਨੇ ਆਖਿਆ ਕਿ ਹੇ ਇਸਰਾਇਲ ਦੀ ਔਲਾਦ ਮੈਂ ਤੁਹਾਡੇ ਵੱਲ ਅੱਲਾਹ ਦਾ ਭੇਜਿਆ ਹੋਇਆ ਰਸੂਲ ਹਾਂ, ਪੁਸ਼ਟੀ ਕਰਨ ਵਾਲਾ ਹਾਂ ਉਸ ਤੌਰੇਤ ਦੀ ਜਿਹੜੀ ਮੇਰੇ ਤੋਂ ਪਹਿਲਾਂ ਤੋਂ ਮੌਜੂਦ ਹੈ। ਅਤੇ ਖ਼ੁਸ਼ਖ਼ਬਰੀ ਦੇਣ ਵਾਲਾ ਹਾਂ, ਇੱਕ ਰਸੂਲ ਦੀ ਜਿਹੜਾ ਮੇਰੇ ਤੋਂ ਬਾਅਦ ਆਏਗਾ। ਉਸ ਦਾ ਨਾਮ ਅਹਿਮਦ ਹੋਵੇਗਾ। ਫਿਰ ਜਦੋਂ ਉਹ ਉਨ੍ਹਾਂ ਦੇ ਕੋਲ ਖੁੱਲ੍ਹੀਆਂ ਨਿਸ਼ਾਨੀਆਂ ਲੈ ਕੇ ਆਏਗਾ, ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਇਹ ਤਾਂ ਪ੍ਰਤੱਖ ਜਾਦੂ ਹੈ।",
            "verse 61:7": "ਅਤੇ ਉਸ ਤੋਂ ਵੱਧ ਤੇ ਜ਼ਾਲਿਮ ਕੌਣ ਹੋਵੇਗਾ ਜਿਹੜਾ ਅੱਲਾਹ ਤੇ ਝੂਠ ਮੜ੍ਹੋ। ਹਾਲਾਂਕਿ ਉਹ ਇਸਲਾਮ ਵੱਲ ਬੁਲਾਇਆ ਜਾ ਰਿਹਾ ਹੋਵੇ। ਅਤੇ ਅੱਲਾਹ ਜ਼ਾਲਿਮ ਲੋਕਾਂ ਨੂੰ ਮਾਰਗ ਦਰਸ਼ਨ ਪ੍ਰਦਾਨ ਨਹੀਂ ਕਰਦਾ।",
            "verse 61:8": "ਉਹ ਚਾਹੁੰਦੇ ਹਨ, ਕਿ ਉਹ ਅੱਲਾਹ ਦੇ ਪ੍ਰਕਾਸ਼ ਨੂੰ ਆਪਣੇ ਮੂੰਹ ਨਾਲ (ਫੂਕ ਮਾਰ ਕੇ) ਬੁਝਾ ਦੇਣ, ਜਦੋਂ ਕਿ ਅੱਲਾਹ ਆਪਣੇ ਪ੍ਰਕਾਸ਼ ਨੂੰ ਪੂਰਾ ਕਰਕੇ ਰਹੇਗਾ। ਚਾਹੇ ਅਵੱਗਿਆਕਾਰੀਆ ਨੂੰ ਇਹ ਗਿੰਨ੍ਹਾ ਹੀ ਨਾ ਪਸੰਦ ਕਿਉਂ ਨਾ ਹੋਵੇ।",
            "verse 61:9": "ਉਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਆਪਣੇ ਰਸੂਲ ਨੂੰ ਮਾਰਗ ਦਰਸ਼ਨ ਅਤੇ ਸੱਚੇ ਦੀਨ ਦੇ ਸਹਿਤ ਭੇਜਿਆ। ਤਾਂ ਕਿ ਉਹ ਉਸ ਨੂੰ ਸਾਰੇ ਧਰਮਾਂ ਤੇ ਭਾਰੀ ਕਰ ਦੇਵੇ, ਭਾਵੇ ਇਹ ਸ਼ਿਰਕ ਕਰਨ ਵਾਲਿਆਂ ਨੂੰ ਕਿਨ੍ਹਾ ਹੀ ਨਾ ਪਸੰਦ ਕਿਉਂ ਨਾ ਹੋਵੇ।",
            "verse 61:10": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਕੀ ਮੈਂ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਵਾਪਾਰ ਦੱਸਾਂ, ਜਿਹੜਾ ਤੁਹਾਨੂੰ ਇੱਕ ਦਰਦਨਾਕ ਸਜ਼ਾ ਤੋਂ ਬ਼ਚਾ ਲਵੇ।",
            "verse 61:11": "ਤੁਸੀਂ ਅੱਲਾਹ ਅਤੇ ਰਸੂਲ ਤੇ ਈਮਾਨ ਲਿਆਉ। ਅਤੇ ਅੱਲਾਹ ਦੇ ਰਾਹ ਵਿਚ ਆਪਣੀ ਜਾਇਦਾਦ ਅਤੇ ਆਪਣੀ ਜਾਨ ਦੇ ਸਹਿਤ ਯੁੱਧ ਕਰੋ। ਇਹ ਤੁਹਾਡੇ ਲਈ ਬਿਹਤਰ ਹੈ। ਜੇਕਰ ਤੁਸੀਂ ਸਮਝੋਂ।",
            "verse 61:12": "ਅੱਲਾਹ ਤੁਹਾਡੇ ਪਾਪਾਂ ਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇਵੇਗਾ ਅਤੇ ਤੁਹਾਨੂੰ ਅਜਿਹੇ ਬਾਗ਼ਾਂ ਵਿਚ ਦਾਖ਼ਿਲ ਕਰੇਗਾ, ਜਿਨ੍ਹਾਂ ਦੇ ਥੱਲੇ ਨਹਿਰਾਂ ਵਗਦੀਆਂ ਹੋਣਗੀਆਂ। ਅਤੇ ਵਧੀਆ ਬਸੇਰਿਆਂ ਵਿਚ, ਜਿਹੜੇ (ਤੁਹਾਡੇ) ਹਮੇਸ਼ਾ ਰਹਿਣ ਲਈ ਜੰਨਤ ਵਿਚ ਤਿਆਰ ਹਨ। ਇਹ ਵੱਡੀ ਸਫ਼ਲਤਾ ਹੈ।",
            "verse 61:13": "ਅਤੇ ਇੱਕ ਹੋਰ ਚੀਜ਼ ਵੀ ਜਿਸ ਦੀ ਤੁਸੀਂ ਇੱਛਾ ਰਖਦੇ ਹੋ, ਅੱਲਾਹ ਦੀ ਮਦਦ ਅਤੇ ਜਲਦੀ ਪ੍ਰਾਪਤ ਹੋਣ ਵਾਲੀ ਜਿੱਤ ਅਤੇ ਮੋਮਿਨਾਂ ਨੂੰ ਸ਼ੁਸ਼ਖਬਰੀ ਦੇ ਦੇਵੋ।",
            "verse 61:14": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਸੀਂ ਅੱਲਾਹ ਦੇ ਸਹਾਇਕ ਬਣੋ। ਜਿਵੇਂ ਕਿ ਮਰੀਅਮ ਦੇ ਪੁੱਤਰ ਈਸਾ ਨੇ ਆਪਣੇ ਸਾਥੀਆਂ ਨੂੰ ਆਖਿਆ ਕਿ ਕਿਹੜਾ ਅੱਲਾਹ ਲਈ ਮੇਰਾ ਸਾਥੀ ਬਣਦਾ ਹੈ। ਸਾਥੀਆਂ ਨੇ ਆਖਿਆ ਕਿ ਅਸੀਂ ਹਾਂ ਅੱਲਾਹ ਦੇ ਸਹਾਇਕ। ਤਾਂ ਇਸਰਾਈਲ ਦੀ ਔਲਾਦ ਵਿਚੋਂ ਕੁਝ ਲੋਕ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਕੁਝ ਲੋਕਾਂ ਨੇ ਅਵੱਗਿਆ ਕੀਤੀ। ਫਿਰ ਅਸੀਂ ਈਮਾਨ ਲਿਆਉਣ ਵਾਲਿਆਂ ਦੀ ਉਨ੍ਹਾਂ ਦੇ ਦੁਸ਼ਮਨਾ ਦੇ ਮੁਕਾਬਲੇ ਉਨ੍ਹਾਂ ਦੀ ਮਦਦ ਕੀਤੀ। ਸੋ ਉਹ ਜੇਤੂ ਹੋ ਗਏ।"
        },
        "Roman english": {
            "verse 61:1": "Sabbaha lillaahi maa fisamaawaati wa maa fil ardi wa huwal `Azeezul Hakeem",
            "verse 61:2": "Yaa ayyuhal lazeena aamanoo lima taqooloona maa laa taf`aloon",
            "verse 61:3": "Kabura maqtan `indal laahi an taqooloo maa laa taf`aloon",
            "verse 61:4": "Innal laaha yuhibbul lazeena yuqaatiloona fee sabeelihee saffan kaannahum bunyaanum marsoos",
            "verse 61:5": "Wa iz qaala Moosa liqawmihee yaa qawmi lima tu`zoonanee wa qat ta`lamoona annee Rasoolul laahi ilaikum falammaa zaaghooo azaaghal laahu quloobahum; wallaahu laa yahdil qawmal faasiqeen",
            "verse 61:6": "Wa iz qaala `Eesab-nu-Mayama yaa Banee Israaa`eela innee Rasoolul laahi ilaikum musaddiqal limaa baina yadayya minat Tawraati wa mubashshiram bi Rasooliny yaatee mim ba`dis muhooo Ahmad; falammaa jaaa`ahum bil baiyinaati qaaloo haazaa sihrum mubeen",
            "verse 61:7": "Wa man azlamu mimma nif taraa `alal laahil kaziba wa huwa yad`aaa ilal Islaam; wallaahu laa yahdil qawmaz zaalimeen",
            "verse 61:8": "Yureedoona liyutfi`oo nooral laahi bi afwaahimim wallaahu mutimmu noorihee wa law karihal kaafiroon",
            "verse 61:9": "Huwal lazee arsala Rasoolahoo bilhudaa wa deenil haqqi liyuzhirahoo `alad deeni kullihee wa law karihal mushrikoon",
            "verse 61:10": "Yaaa ayyuhal lazeena aammano hal adullukum `alaa tijaaratin tunjeekum min `azaabin aleem",
            "verse 61:11": "Tu`minoona billaahi wa Rasoolihee wa tujaahidoona fee sabeelil laahi bi amwaalikum wa anfusikum; zaalikum khairul lakum in kuntum ta`lamoon",
            "verse 61:12": "Yaghfir lakum zunoobakum wa yudkhilkum Jannaatin tajree min tahtihal anhaaru wa masaakina taiyibatan fee Jannaati `Ad; zaalikal fawzul `Azeem",
            "verse 61:13": "Wa ukhraa tuhibboonahaa nasrum minal laahi wa fat hun qaree; wa bashshiril mu `mineen",
            "verse 61:14": "Yaaa ayyuhal lazeena aamaanoo koonooo ansaaral laahi kamaa qaala `Eesab-nu-Maryama lil Hawaariyyeena man ansaareee ilal laah; qaalal Hawaariyyoona nahnu ansaa rul laahi fa aamanat taaa`ifatum mim Bannee Israaa`eela wa kafarat taaa`ifatun fa ayyadnal lazeena aammanoo `alaa `aduwwihim fa asbahoo zaahireen"
        },
        "Russian": {
            "verse 61:1": "Все в небесах и на земле Хвалу и славу воздает Аллаху, Кто мудрости и мощи преисполнен!",
            "verse 61:2": "О вы, кто верует! Зачем вам говорить о том, Чего не делаете вы?",
            "verse 61:3": "Аллаху крайне ненавистны те, Кто говорит о том, Чего не совершает.",
            "verse 61:4": "Поистине, любовь Аллаха с теми, Кто на пути Его сражается единым рядом, Сплоченным в прочное строенье.",
            "verse 61:5": "И (вспомните), как Муса народу своему сказал: \"Зачем обидно оскорбляете меня, Когда вы знаете, Что я, поистине, посланник от Аллаха к вам?\" И вот когда они от Истины Господней уклонились, Аллах сердца их уклонил от верного пути, - Поистине, Аллах не направляет Надменных грешников по верному пути.",
            "verse 61:6": "И (вспомните), как Иса, сын Марйам, сказал: \"Сыны Исраиля! Я к вам посланник от Аллаха, Чтоб истину Закона - (Торы) - утвердить, Ниспосланного вам до моего прихода, И сообщить вам благостную Весть, Что вслед за мной придет посланник, Имя которому - Ахмад\". И вот когда он им знаменья ясные представил, Они сказали: \"Сие есть, несомненно, колдовство!\"",
            "verse 61:7": "И есть ли нечестивее того, Кто ложь возводит на Аллаха, Когда его зовут к исламу? Поистине, по верному пути Аллах неправедных не направляет.",
            "verse 61:8": "Они хотели б Свет Господень Своими (лживыми) устами погасить. Но завершит Свой Свет Аллах, Хотя неверным это ненавистно.",
            "verse 61:9": "Он - Тот, Кто Своего посланника послал И с ним - (вам) руководство (в жизни), Религию, (что Свет Господней) Истины (несет), Чтобы явить ее превыше прочей (веры), Хоть многобожникам и ненавистно это.",
            "verse 61:10": "О вы, кто верует! Не предложить ли вам обменный торг, Который от тяжелой кары вас избавит?",
            "verse 61:11": "Вам - веровать в Аллаха и посланника Его И, на пути Его сражаясь, Отдать все средства и всю душу. Сие есть лучшее для вас. О, если бы вы только знали!",
            "verse 61:12": "А Он простит вам ваши прегрешенья, В Сады введет, реками омовенны, В прекрасные дворцы садов Эдема. И в этом - высшее признание (Аллаха).",
            "verse 61:13": "А также то, что вам так мило, - Господня помощь и скорейшая победа. Ты эту благостную Весть всем верующим возвести.",
            "verse 61:14": "О вы, кто верует! Станьте помощниками (мне) на промысле Аллаха, - Как Иса, сын Марйам, сказал апостолам своим: \"Кто будет мне помощником в Господнем деле?\" Апостолы сказали: \"Помощники в деле Аллаха - мы!\" И вот тогда Часть сыновей Исраиля уверовали (в Бога), Другие же - в неверии осталась. Мы дали верующим силу над врагами, И стали победители они."
        },
        "Sindhi": {
            "verse 61:1": "جيڪي آسمانن ۾ آھي ۽ جيڪي زمين ۾ آھي سو (سڀ) الله جي پاڪائي بيان ڪندو آھي، ۽ اُھو غالب حِڪمت وارو آھي.",
            "verse 61:2": "اي ايمان وارؤ جيڪي نه ڪندا آھيو سو ڇو چوندا آھيو.",
            "verse 61:3": "الله وٽ اھا (ڳالھ) ڏاڍي ناپسند آھي جو اُھا (ڳالھ) چئو جا نٿا ڪريو.",
            "verse 61:4": "بيشڪ الله انھن کي دوست رکندو آھي جي سندس واٽ ۾ (اھڙي) صف ٻڌي وڙھندا آھن (جو) ڄڻڪ اُھي ھڪڙي سِيھي پلٽيل ڀِت آھن.",
            "verse 61:5": "۽ (ياد ڪر) جڏھن مُوسىٰ پنھنجي قوم کي چيو ته اي منھنجي قوم مون کي ڇو ايذائيندا آھيو ۽ حالانڪ (اوھين) ڄاڻندا آھيو ته آءٌ اوھان ڏانھن الله جو موڪيل آھيان، پوءِ جنھن مھل ڏنگائي ڪيائون ته الله سندن دلين کي ڏنگو ڪيو، ۽ الله بدڪار قوم کي سڌو رستو نه ڏيکاريندو آھي.",
            "verse 61:6": "۽ (اُھو وقت ياد ڪر) جڏھن عيسىٰ پُٽ مريم جي چيو ته اي بني اسرائيلو بيشڪ آءٌ اوھان ڏانھن الله جو موڪليل آھيان جيڪو توريت منھنجي اڳيان آھي تنھنجو سچو ڪندڙ آھيان ۽ ھڪ اھڙي پيغمبر جي خوشخبري ڏيندڙ آھيان جو مُون کانپوءِ ايندو جنھن جو نالو احمد ھوندو، پوءِ جنھن مھل اُھو چِٽن مُعجزن سان وٽن آيو چيائون ته ھي پڌرو جادو آھي.",
            "verse 61:7": "۽ اُن کان وڌيڪ ظالم ڪير آھي جنھن الله تي ڪوڙ ٻَڌو حالانڪ ان کي اِسلام ڏانھن سڏيو ويندو آھي، ۽ الله ظالمن جي قوم کي سِڌو رستو نه ڏيکاريندو آھي.",
            "verse 61:8": "(اُھي ڪافر) گھرندا آھن ته الله جي نُور کي پنھنجي واتن سان وِسائين، حالانڪ الله پنھنجي نُور کي پوري ڪرڻ وارو آھي توڻيڪ ڪافر مٺيان ڀانئين.",
            "verse 61:9": "(الله) اُھو آھي جنھن پنھنجي پيغمبر کي ھدايت ۽ سچي دين سان موڪليو ته اُن کي سڀني دينن تي غالب ڪري توڻيڪ مشرڪ بڇان ڀانئين.",
            "verse 61:10": "اي ايمان وارؤ اوھان کي انھيءَ سوداگريءَ جو ڏس نه ڏيان ڇا جو اوھان کي ڏکوئيندڙ عذاب کان بچائي؟",
            "verse 61:11": "(ته) الله ۽ سندس پيغمبر تي ايمان آڻيو ۽ پنھنجن مالن ۽ پنھنجن جندن سان الله جي واٽ ۾ لڙائي ڪريو، جيڪڏھن ڄاڻندا آھيو ته اُھو اوھان لاءِ ڀلو آھي.",
            "verse 61:12": "اوھان جا گناھ اوھان کي بخشيندو ۽ اوھان کي (اھڙن) باغن ۾ داخل ڪندو جن جي ھيٺان واھيون وھنديون آھن ۽ سُٺين جاين ھميشه (رھڻ) وارن بھشتن ۾، اھا وڏي مراد ماڻڻ آھي.",
            "verse 61:13": "۽ ٻي (نعمت به ڏيندو) جنھن کي دوست رکندا آھيو، الله جي طرف کان مدد ۽ فتح ويجھي، ۽ مؤمنن کي خوشخبري ڏي.",
            "verse 61:14": "اي ايمان وارؤ الله جي دين جا مددگار ھجو جھري طرح عيسىٰ پٽ مريم جي پنھنجي خاص يارن کي چيو ته الله جي دين ۾ منھنجا مددگار ڪير آھن؟ انھن خاص يارن چيو ته اسين الله (جي دين) جا مددگار آھيون پوءِ بني اسرائيلن مان ھڪ ٽولي ايمان آندو ۽ ٻئي ٽوليءَ انڪار ڪيو، پوءِ ايمان وارن کي سندن دشمنن تي غلبو ڏنوسون پوءِ غالب ٿيا."
        },
        "Sinhalese": {
            "verse 61:1": "අහස්හි ඇති දෑ හා මහපොළොවෙහි ඇති දෑ අල්ලාහ් ව සුවිශුද්ධ කරයි. තවද ඔහු සර්ව බලධාරී ය; මහා ප්‍රඥාවන්ත ය.",
            "verse 61:2": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලා සිදු නොකරන දෙයක් නුඹලා පවසනුයේ ඇයි?",
            "verse 61:3": "නුඹලා සිදු නොකරන දෙයක් ගැන පැවසීම අල්ලාහ් අබියස කෝපයෙන් ඉමහත් විය.",
            "verse 61:4": "ශක්තිමක් ලෙස ඉඳි කරන ලද ගොඩනැගිල්ලක් සේ පෙළ ගැසී ඔහුගේ මාර්ගයේ සටන් කරන්නන් නියත වශයෙන්ම අල්ලාහ් ප්‍රිය කරයි.",
            "verse 61:5": "තවද “අහෝ මාගේ ජනයිනි! නියත වශයෙන්ම මම නුඹලා වෙත පැමිණි අල්ලාහ්ගේ දූතයා බව නුඹලා දැන දැනම නුඹලා මට හිංසා කරනුයේ ඇයි දැ”යි මූසා ඔහුගේ ජනයාගෙන් විමසූ අවස්ථාව සිහිපත් කරනු. එහෙයින් ඔවුන් (සත්‍ය මාර්ගයෙන්) ඉවත්ව ගිය කල්හි, අල්ලාහ් ඔවුන්ගේ හදවත් ද (සත්‍ය මාර්ගයෙන්) ඉවත්ව යන්නට සැලසුවේය. තවද අල්ලාහ් දුෂ්ඨ ජනයාට මග නොපෙන්වයි.",
            "verse 61:6": "තවද “ඉස්රාඊල් දරුවනි! මා ඉදිරියේ ඇති තව්රාතය තහවුරු කරන්නෙකු ලෙසින් ද මගෙන් පසු ව පැමිණෙන තම නාමය අහ්මද් නමැති (මුහම්මද් නම්) දූතයෙකු ගැන ශුභාරංචි දන්වන්නෙකු ලෙසින් ද මම නුඹලා වෙත පැමිණ ඇති අල්ලාහ්ගේ දූතයෙකු වෙමි” යැයි, මර්යම්ගේ පුත් ඊසා පැවසූ අවස්ථා ව සිහියට නගනු. නමුත් ඔවුන් වෙත පැහැදිලි සාධක සමග ඔහු පැමිණි කල්හි මෙය පැහැදිලි හූනියමකි යැයි ඔවුහු පැවසූහ.",
            "verse 61:7": "තවද ඉස්ලාමය වෙත ඇරයුම් කරනු ලබමින් සිටිය දී අල්ලාහ් වෙත බොරු ගොතන්නාට වඩා මහා අපරාධකරු කවරෙකු ද? තවද අල්ලාහ් අපරාධකාරී ජනයාට මග පෙන්වන්නේ නැත.",
            "verse 61:8": "අල්ලාහ්ගේ ආලෝකය ඔවුන් ඔවුන්ගේ මුඛවල් වලින් (පිඹ) නිවා දැමීමට අපේක්ෂා කරති. තවද දේවත්වය ප්‍රතික්ෂේප කරන්නන් පිළිකුල් කළ ද අල්ලාහ් තම අලෝකය පූර්ණවත් කරන්නාය.",
            "verse 61:9": "දේව ආදේශකයින් පිළිකුල් කළ ද යහමග හා සත්‍යය දහම සමග එය සියලු දහම් වලට වඩා ප්‍රකට කරනු පිණිස තම දූතයාණන් (මුහම්මද්) එවා සිටියේ ඔහුය.",
            "verse 61:10": "අහෝ දේවත්වය විශ්වාස කළවුනි! වේදනීය දඬුවමකින් නුඹලා ව ආරක්ෂා කරන ව්යාපාරයක් මම නුඹලාට පෙන්වා දෙන්න ද?",
            "verse 61:11": "(එය) නුඹලා අල්ලාහ් හා ඔහුගේ දූතයාණන් ව විශ්වාස කිරීමය. නුඹලාගේ ධනය හා නුඹලාගේ ජීවිත අල්ලාහ්ගේ මාර්ගයෙහි කැප කිරීමය. නුඹලා දැන සිටින්නෙහු නම් එය නුඹලාට ශ්‍රේෂ්ඨය.",
            "verse 61:12": "නුඹලාගේ පාපයන් වලට ඔහු නුඹලාට සමාව දෙයි. තවද ඔහු නුඹලා (ස්වර්ග) උයන් වලට ඇතුළත් කරයි. ඒවාට යටින් ගංගාවෝ ගලා බසිති. (අද්න් නම්) සදා ස්වර්ග උයන්හි යහපත් වාසස්ථාන ඇත. එයයි අතිමහත් ජයග්‍රහණය.",
            "verse 61:13": "තවද නුඹලා එහි ප්‍රිය කරන තවත් දෑ ද ඇත. (එය) අල්ලාහ්ගෙන් වූ උපකාරයකි. තවද සමීප ජයග්‍රහණයක් ඇත. තවද නුඹ දේවත්වය විශ්වාස කරන්නන්හට ශුභාරංචි දන්වනු.",
            "verse 61:14": "අහෝ දේවත්වය විශ්වාස කළවුනි! මර්යම්ගේ පුත් ඊසා (තම) ගෝලයින්ගෙන් “අල්ලාහ් වෙනුවෙන් මට උදව් කරන්නෝ කවුරුන් දැ?” යි විමසූ කල්හි “අපි අල්ලාහ්ගේ උදව්කරුවෝ වෙමු” යැයි ගෝලයෝ පැවසූහ. එලෙස නුඹලා ද අල්ලාහ්ගේ උදව්කරුවන් වනු. ඉස්රාඊල් දරුවන්ගෙන් පිරිසක් විශ්වාස කළ අතර තවත් පිරිසක් ප්‍රතික්ෂේප කළෝය. එවිට අපි විශ්වාස කළවුන් ව ඔවුන්ගේ සතුරන්ට එරෙහි ව අපි ශක්තිමත් කළෙමු. පසුව ඔවුහු ජයග්‍රාහකයින් බවට පත් වූවෝය."
        },
        "Somali": {
            "verse 61:1": "Waxaa Ilaahay nasaha (weyneeya) waxa Cirka iyo Dhulka ku sugan, Eebana waa adkaade falsan.",
            "verse 61:2": "dadka xaqa rumeeyayow maxaad u sheegaysaan wax aydaan falaynin.",
            "verse 61:3": "Waxaa Cadho weyn Eebe agtiisa ku ah inaad sheegtaan wax aydaan falaynin.",
            "verse 61:4": "Eebe wuxuu jecel yahay kuwa ku dagaallama Jidkiisa (Jihaadka) iyagoo af ah oo aad mooddo dhismo laysku dhejiyey (midnimadooda).",
            "verse 61:5": "Xusuusta markii (Nabi) Muuse ku yidhi dadkiisii maxaad ii dhibaysaan idinkoo og inaan Rasuul Eebe idiin ahay, markay xaqii ka iisheen yaa Eebana sii iilay qalbigooda, Ilaahayna ma hanuuniyo kuwa faasiqiinta ah.",
            "verse 61:6": "xusuusta marka (nabi) Ciise ibnu Maryama ku yidhi Banii Israa'iil waxaan ahay Rasuul Eebe idiin soo diray oo rumayn Kitaabkii Tawraad ee horreeyey, kuna bishaarayn Rasuul gadaashayda imaan oo Magaciisuna yahay «Axmed», markuu xuja cad ula yimidna waxay dheheen kani waa sixir cad.",
            "verse 61:7": "yaa ka dulmi badan ruux ku been abuurtay Ilaahay isagoo loogu yeedhi Islaamka, Eebe ma hanuuniyo dadka daalimiinta ah.",
            "verse 61:8": "Waxay doonayaan (Gaaladu) inay Nuurka (xaqa) Eebe ku bakhtiiyaan Afkooda Eebena wuu taam yeeli nuurkiisa haba naceen Gaaladuye.",
            "verse 61:9": "Eebe waa kan diray Rasuulkiisa isagoo hanuun wada iyo Diin xaq ah si uu (Eebe) Diimaha oo dhan uga sare mariyo haba naceen Mushrikiintuye (Gaaladu).",
            "verse 61:10": "Kuwa xaqa rumeeyow ma idin tusiyaa ganacsi idinka koriya Cadaab daran.",
            "verse 61:11": "Waxaad rumaynaysaa Ilaahay iyo Rasuulkiisa waxaadna ku dagaalamaysaan Jidkiisa xaqa ah Xoolihiina iyo Naftiina idinkoo u huri, saasaana idiin khayr roon haddaad tihiin kuwo wax og.",
            "verse 61:12": "Markaas Eebe dambigiinuu dhaafi wuxuuna idin gelin Jannooyin ay dhex socdaan Webiyaal iyo Guryo wanaagsan oo ku dhexyaalla Jannada Cadnin (nagaanshaha), taasina waa liibaan weyn.",
            "verse 61:13": "Arrin kale ood jeceshihiinna (wuu idiin siin) waa gargaarka Eebe iyo fatxi (guul) dhaw, kuwa xaqa rumeeyeyna u bishaaree.",
            "verse 61:14": "dadka xaqa rumeeyow noqda gargaarayaasha Eebe sidii kuwii Nabi Ciise ibnu Maryama Saaxiibadiis ahaa (Xawaariyintii) ee uu ku yidhi yaa Eebe iila gargaara, markaas ay dheheen annagaa ah gargaarayaashii Eebe, ka dib ay xaqa rumaysay koox Banii Israa'iil ka mid ah, kooxna ay ka gaalawday; Eebena ayiday (xoojiyey) kuwii xaqa rumeeyey (kana adkaadeen Cadawgoodii) oo iyagu ka muuqdeen (ka taliyeen) dhulkii."
        },
        "Spanish": {
            "verse 61:1": "A Allah glorifican todos los que están en los cielos y en la tierra y Él es el Poderoso, el Sabio.",
            "verse 61:2": "Vosotros que creéis! Por qué decís lo que no hacéis?",
            "verse 61:3": "Es grave ante Allah que digáis lo que no hacéis.",
            "verse 61:4": "Es verdad que Allah ama a los que combaten en Su camino en filas, como si fueran un sólido edificio.",
            "verse 61:5": "Y cuando Musa le dijo a su gente: Gente mía! Por qué me perjudicáis si sabéis que yo soy el mensajero de Allah para vosotros? Y cuando se apartaron, Allah apartó sus corazones. Allah no guía a la gente descarriada.",
            "verse 61:6": "Y cuando dijo Isa, hijo de Maryam: Hijos de Israel! Yo soy el mensajero de Allah para vosotros, para confirmar la Torá que había antes de mí y para anunciar a un mensajero que ha de venir después de mí cuyo nombre es Ahmad.Pero cuando fue a ellos con las pruebas evidentes, dijeron: Esto es pura magia.",
            "verse 61:7": "Pero quién es más injusto que quien inventa mentiras sobre Allah habiendo sido llamado al Islam?Allah no guía a la gente injusta.",
            "verse 61:8": "Quieren apagar la luz de Allah con lo que sale de sus bocas, pero Allah siempre hace culminar Su luz por mucho que les pese a los incrédulos.",
            "verse 61:9": "Él es Quien ha enviado a Su mensajero con la guía y la verdadera práctica de Adoración para hacerla prevalecer sobre todas las demás, por mucho que les pese a los asociadores.",
            "verse 61:10": "Vosotros que creéis! Queréis que os diga un negocio que os salvará de un doloroso castigo?",
            "verse 61:11": "Que creáis en Allah y en Su mensajero y que luchéis en el camino de Allah con vuestros bienes y personas.Eso es lo mejor para vosotros, si queréis saberlo.",
            "verse 61:12": "Él os perdonará vuestras faltas y os hará entrar en jardines por cuyo suelo corren los ríos y en buenas estancias en los jardines de Adn.Y ese es el gran triunfo.",
            "verse 61:13": "Y otra ganancia que amáis: Una ayuda de Allah y una próxima victoria. Anuncia buenas nuevas a los creyentes.",
            "verse 61:14": "Vosotros que creéis! Sed auxiliares de Allah; tal y como dijo Isa, el hijo de Maryam, a los discípulos: Quién me ayudará en favor de Allah?Y dijeron los discípulos: Nosotros somos los auxiliares de Allah. Hubo una parte de los hijos de Israel que creyó, pero otros descreyeron.Dimos apoyo a los que habían creído contra sus enemigos y fueron los vencedores.(aL-YUMUA)En el nombre de Allah, el Misericordioso, el Compasivo."
        },
        "Swahili": {
            "verse 61:1": "Vinamtakasa Mwenyezi Mungu viliomo katika mbingu na katika ardhi. Na Yeye ni Mwenye nguvu, Mwenye hikima.",
            "verse 61:2": "Enyi mlio amini! Kwa nini mnasema msiyo yatenda?",
            "verse 61:3": "Yanachukiza vikubwa mno kwa Mwenyezi Mungu kuwa mnasema msiyo yatenda.",
            "verse 61:4": "Kwa hakika Mwenyezi Mungu anawapenda wanao pigana katika Njia yake kwa safu kama jengo lilio kamatana.",
            "verse 61:5": "Na Musa alipo waambia watu wake: Enyi watu wangu! Kwa nini mnaniudhi, nanyi mnajua kuwa hakika mimi ni Mtume wa Mwenyezi Mungu niliye tumwa kwenu? Walipo potoka, Mwenyezi Mungu aliziachia nyoyo zao zipotoke. Na Mwenyezi Mungu hawaongoi watu wapotovu.",
            "verse 61:6": "Na Isa bin Mariamu alipo sema: Enyi Wana wa Israili! Hakika mimi ni Mtume wa Mwenyezi Mungu kwenu, ninaye thibitisha yaliyo kuwa kabla yangu katika Taurati, na mwenye kubashiria kuja Mtume atakaye kuja baada yangu; jina lake ni Ahmad! Lakini alipo waletea hoja zilizo wazi, walisema: Huu ni uchawi ulio dhaahiri!",
            "verse 61:7": "Na ni nani mwenye kudhulumu zaidi kuliko yule anaye mzulia Mwenyezi Mungu uwongo, naye anaitwa kwenye Uislamu? Na Mwenyezi Mungu hawaongoi watu madhaalimu.",
            "verse 61:8": "Wanataka kuizima nuru ya Mwenyezi Mungu kwa vinywa vyao. Na Mwenyezi Mungu atakamilisha nuru yake ijapo kuwa makafiri watachukia.",
            "verse 61:9": "Yeye ndiye aliye mtuma Mtume wake kwa uwongofu na Dini ya haki ili ipate kuzishinda dini zote, ijapo kuwa washirikina watachukia.",
            "verse 61:10": "Enyi mlio amini! Nikuonyesheni biashara itakayo kuokoeni na adhabu iliyo chungu?",
            "verse 61:11": "Muaminini Mwenyezi Mungu na Mtume wake, na piganeni Jihadi katika Njia ya Mwenyezi Mungu kwa mali yenu na nafsi zenu. Haya ni bora kwenu, ikiwa nyinyi mnajua.",
            "verse 61:12": "Atakusameheni dhambi zenu, na atakutieni katika Mabustani yapitiwayo na mito kati yake, na maskani nzuri nzuri katika Bustani za milele. Huko ndio kufuzu kukubwa.",
            "verse 61:13": "Na kinginecho mkipendacho, nacho ni nusura itokayo kwa Mwenyezi Mungu, na ushindi ulio karibu! Na wabashirieni Waumini!",
            "verse 61:14": "Enyi mlio amini! Kuweni wasaidizi wa Mwenyezi Mungu, kama alivyo sema Isa bin Mariamu kuwaambia wanafunzi wake: Nani wasaidizi wangu kwa Mwenyezi Mungu? Wakasema wanafunzi: Sisi ni wasaidizi wa Mwenyezi Mungu! Basi taifa moja la Wana wa Israili liliamini, na taifa jingine lilikufuru. Basi tukawaunga mkono walio amini dhidi ya maadui zao, wakawa wenye kushinda."
        },
        "Swedish": {
            "verse 61:1": "ALLT det som himlarna rymmer och det som jorden bär prisar Gud; Han är den Allsmäktige, den Vise.",
            "verse 61:2": "TROENDE! Varför säger ni ett och gör ett annat?",
            "verse 61:3": "Det är djupt förhatligt för Gud att era ord inte överensstämmer med era handlingar!",
            "verse 61:4": "Gud älskar dem som kämpar för Hans sak i slutna led [så att de tillsammans bildar] liksom en stark och solid byggnad.",
            "verse 61:5": "[Minns] Moses, som talade till sitt folk och sade: \"Varför orsakar ni mig sorg och bekymmer, fastän ni vet att jag är sänd till er av Gud?\" Men när de [ändå] vek av [från den raka vägen], stämplade Gud deras hjärtan med avvikelsens stämpel; Gud leder inte dem som förhärdar sig i trots.",
            "verse 61:6": "Och [minns] Jesus, Marias son, som sade: \"Israeliter! Jag är sänd till er av Gud för att bekräfta vad som ännu består av Tora och för att förkunna för er det glada budskapet att ett sändebud skall komma efter mig vars namn skall vara Ahmad.\" Men när han kom till dem med klara tecken och vittnesbörd, sade de: \"Detta är uppenbart vältalighet som bländar och förhäxar!\"",
            "verse 61:7": "Vem är mer orättfärdig än den som, när han får kallelsen att underkasta sig Guds vilja, finner på lögner om Gud? Gud vägleder inte dem som begår [sådan] orätt.",
            "verse 61:8": "De vill släcka ut Guds ljus med sina ord, men Gud skall låta Sitt ljus lysa med full styrka, hur förhatligt detta än måste vara för förnekarna av sanningen.",
            "verse 61:9": "Det är Han som har sänt Sitt Sändebud med vägledningen och [för att förkunna] den sanna tron som skall föras till seger över all [annan form av] gudstro, hur förhatligt detta än kan vara för dem som sätter medhjälpare vid Guds sida.",
            "verse 61:10": "TROENDE! Skall Jag berätta för er om en byteshandel som kommer att rädda er från ett svårt lidande?",
            "verse 61:11": "[Den består för er del i att] ni tror på Gud och Hans Sändebud och strävar och kämpar för Guds sak med er egendom och ert liv som insats; detta är för er det bästa - om ni bara visste Ã‰!",
            "verse 61:12": "[I gengäld] skall Han förlåta era synder och föra er till lustgårdar, vattnade av bäckar, och de bästa boningar i [detta] Edens paradis; detta är den stora, den lysande segern.",
            "verse 61:13": "Och därtill något som ligger er om hjärtat: Guds hjälp och en förestående seger. - Tillkännage detta för de troende!",
            "verse 61:14": "TROENDE! Bli Guds medhjälpare! Liksom Jesus, Marias son, sade till de vitklädda: \"Vem vill bli min medhjälpare [i arbetet] för Guds sak?\" och de svarade: \"Vi vill vara Guds medhjälpare!\". Bland Israels barn kom några att tro [på Jesus och hans budskap] medan andra förnekade [honom]. Men Vi stödde dem som trodde på honom mot deras fiender, och de [troende] avgick med segern."
        },
        "Tajik": {
            "verse 61:1": "Худоро тасбеҳ гӯянд ҳар чӣ дар осмошҳову дар замин аст ва Ӯст пирӯзманду ҳаким!",
            "verse 61:2": "Эй касоне, ки имон овардаед, чаро суханоне мегӯед, ки иҷро намекунед?",
            "verse 61:3": "Худованд сахт ба хашм меояд, ки чизе бигӯеду ба ҷой наёваред.",
            "verse 61:4": "Худо дӯст дорад касонеро, ки дар роҳи Ӯ саф кашида монанди деворе, ки хиштҳояшонро ба ҳам пайванд дода бошанд, меҷанганд.",
            "verse 61:5": "Ва Мӯсо ба қавми худ гуфт: «Эй қавми ман, чаро маро меозоред, ҳол он ки медонед, ки ман паёмбари Худо бар шумо ҳастам?» Чун аз ҳақ рӯйгардон шуданд, Худо низ дилҳошонро аз ҳақ бигардонид. Ва Худо мардуми нофармонро ҳидоят намекунад.",
            "verse 61:6": "Ва Исо бинни Марям гуфт: «Эй банӣ-Исроил, ман паёмбари Худо бар шумо ҳастам. Тавротеро, ки пеш аз ман будааст, тасдиқ мекунам ва ба паёмбаре, ки баъд аз ман меояд ва номаш Аҳмад аст, хушхабаратон медиҳам». Чун он паёмбар бо мӯъҷизаҳои равшан омад, гуфтанд: Ин ҷодуест ошкор!»",
            "verse 61:7": "Кист золимтар аз он кас, ки ба Худо дурӯғ мебандад, дар ҳоле ки ӯро ба ислом даъйат мекунанд? Ва Худо ситамкоронро ҳидоят намекунад.",
            "verse 61:8": "Мехоҳанд нури Худоро ба даҳонҳояшон хомӯш кунанд, вале Худо комилкунандаи нури худ аст, агарчи кофиронро нохуш ояд.",
            "verse 61:9": "Ӯст он Худое, ки паёмбари Худро ҳамроҳ бо ҳидоят ва дини ростин бифиристод, то ӯро бар ҳамаи динҳо ғолиб гардонад, дарчанд мушриконро нохуш ояд.",
            "verse 61:10": "Эй касоне, ки имон овардаед, оё шуморо ба тиҷорате, ки аз азоби дардовар раҳоиятон диҳад, роҳ нишон диҳам?",
            "verse 61:11": "Ба Худову паёмбараш имон биёваред ва дар роҳи Худо бо молу ҷони худ ҷиҳод кунед. Ва ин барои шумо беҳтар аст, агар доно бошед.",
            "verse 61:12": "Гуноҳони шуморо мебахшояд ва ба биҳиштҳое, ки дарунаш наҳрҳо ҷорист ва низ хонаҳое хушу покиза дар биҳиштҳои ҷовид дохил мекунад ва ин пирӯзии бузургест.",
            "verse 61:13": "Ва неъмате дигар, ки дӯсташ доред: нусратест (ёриест) аз ҷониби Худованд ва пирӯзии наздик мӯъминонро хабари хуш деҳ.",
            "verse 61:14": "Эй касоне, ки имон овардаед, ёварони Худо бошед, ҳамчунон ки Исо бинни Марям ба ҳавориён (ёварон) гуфт: «Чӣ касоне ёварони ман дар роҳи Худоянд?» Ҳавориён гуфтанд: «Мо ёварони Худо ҳастем». Пас гурӯҳе аз банӣ-Исроил имон оварданд ва гурӯҳе кофир шуданд. Мо касонеро, ки имон оварда буданд, бар зидди душманонашон мадад кардем, то ғолиб шуданд."
        },
        "Tamil": {
            "verse 61:1": "வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் அல்லாஹ்வை தஸ்பீஹு (துதி) செய்து கொண்டிருக்கின்றன அவன் யாவரையும் மிகைத்தவன், ஞானம் மிக்கவன்.",
            "verse 61:2": "ஈமான் கொண்டவர்களே! நீங்கள் செய்யாததை ஏன் சொல்கிறீர்கள்?",
            "verse 61:3": "நீங்கள் செய்யாததை நீங்கள் கூறுவது அல்லாஹ்விடம் பெரிதும் வெறுப்புடையதாக இருக்கிறது.",
            "verse 61:4": "எவர்கள் ஈயத்தால் வார்க்கப்பட்ட கெட்டியான கட்டடத்தைப் போல் அணியில் நின்று, அல்லாஹ்வுடைய பாதையை போரிடுகிறார்களோ, அவர்களை நிச்சயமாக (அல்லாஹ்) நேசிக்கின்றான்.",
            "verse 61:5": "மேலும், மூஸா தம் சமூகத்தாரிடம்; \"என் சமூகத்தாரே! நிச்சயமாக நான், உங்களிடம் அனுப்பப்பட்ட அல்லாஹ்வின் தூதன் என்பதை நீங்கள் திடமாக அறிந்து கொண்டே, ஏன் என்னை துன்புறுத்துகிறீர்கள்?\" என்று கூறிய வேளையை (நபியே! நீர் நினைவு கூர்வீராக); ஆகவே ஆவர்கள் (நேர்வழியிலிருந்து) சருகிய பொழுது, அல்லாஹ் அவர்களுடைய இருதயங்களை (நேர்வழியிலிருந்து) சருகச் செய்தான். அன்றியும் - ஃபாஸிக்குகளான - பாவம் செய்வோரான சமூகத்தாரை அல்லாஹ் நேர்வழியில் செலுத்தமாட்டான்.",
            "verse 61:6": "மேலும், மர்யமின் குமாரர் ஈஸா, \"இஸ்ராயீல் மக்களே! எனக்கு முன்னுள்ள தவ்ராத்தை மெய்ப்பிப்பவனாகவும்; எனக்குப் பின்னர் வரவிருக்கும் 'அஹமது' என்னும் பெயருடைய தூதரைப் பற்றி நன்மாராயம் கூறுபவனாகவும் இருக்கும் நிலையில் அல்லாஹ்வின் தூதனாக உங்களிடம் வந்துள்ளேன்\" என்று கூறிய வேளையை (நபியே! நீர் நினைவு கூர்வீராக!) எனினும், அவர்களிடம் தெளிவான அத்தாட்சிகளை அவர் கொண்டு வந்த போது, அவர்கள் \"இது தெளிவான சூனியமாகும்\" என்று கூறினார்கள்.",
            "verse 61:7": "மேலும், எவன் இஸ்லாத்தின் பால் அழைக்கப்பட்ட நிலையில், அல்லாஹ்வின் மீது பொய்யை இட்டுக் கட்டுகிறானோ அவனைவிட அநியாயக்காரன் யார்? அன்றியும், அநியாயக்கார சமூகத்தாரை அல்லாஹ் நேர்வழியில் செலுத்த மாட்டான்.",
            "verse 61:8": "அவர்கள் அல்லாஹ்வின் ஒளியைத் தம் வாய்களைக் கொண்டு (ஊதி) அணைத்து விட நாடுகின்றனர், ஆனால் காஃபிர்கள் வெறுத்த போதிலும், அல்லாஹ் தன் ஒளியைப் பூரணமாக்கியே வைப்பான்.",
            "verse 61:9": "(இணை வைத்து வணங்கும்) முஷ்ரிக்குகள் வெறுத்த போதிலும், மற்ற எல்லா மார்க்கங்களையும் மிகைக்கும் பொருட்டு, அவனே தன் தூதரை நேர்வழியுடனும், சத்திய மார்க்கத்துடனும் அனுப்பினான்.",
            "verse 61:10": "ஈமான் கொண்டவர்களே! நோவினை செய்யும் வேதனையிலிருந்து உங்களை ஈடேற்றவல்ல ஒரு வியாபாரத்தை நான் உங்களுக்கு அறிவிக்கட்டுமா?",
            "verse 61:11": "(அது) நீங்கள் அல்லாஹ்வின் மீதும் அவன் தூதர் மீதும் ஈமான் கொண்டு, உங்கள் பொருள்களையும், உங்கள் உயிர்களையும் கொண்டு அல்லாஹ்வின் பதையில் ஜிஹாது (அறப்போர்) செய்வதாகும்; நீங்கள் அறிபவர்களா இருப்பின், இதுவே உங்களுக்கு மிக மேலான நன்மையுடையதாகும்.",
            "verse 61:12": "அவன் உங்களுக்கு உங்கள் பாவங்களை மன்னிப்பான், சுவனபதிகளில் உங்களை பிரவேசிக்கச் செய்வான்; அவற்றின் கீழே ஆறுகள் ஓடிக்கொண்டிருக்கும், அன்றியும், நிலையான அத்னு என்னும் சுவர்க்கச் சோலைகளின் மணம் பொருந்திய இருப்பிடங்களும் (உங்களுக்கு) உண்டு; இதுவே மகத்தான பாக்கியமாகும்.",
            "verse 61:13": "அன்றியும் நீங்கள் நேசிக்கும் வேறொன்றும் உண்டு, (அதுதான்) அல்லாஹ்விடமிருந்து உதவியும், நெருங்கி வரும் வெற்றியுமாகும், எனவே ஈமான் கொண்டவர்களுக்கு (இதைக் கொண்டு) நன்மாராயம் கூறுவீராக!",
            "verse 61:14": "ஈமான் கொண்டவர்களே! மர்யமின் குமாரர் ஈஸா (தம்) சீடர்களை நோக்கி, \"அல்லாஹ்வுக்காக எனக்கு உதவி செய்வோர் யார்?\" எனக் கேட்க, சீடர்கள், \"நாங்கள் அல்லாஹ்வின் உதவியாளர்களாக இருக்கின்றோம்\" என்று கூறியதுபோல், நீங்கள் அல்லாஹ்வின் உதவியாளர்களாக ஆகிவிடுங்கள் - எனினும், இஸ்ராயீல் மக்களில் ஒரு கூட்டம் ஈமான் கொண்டது, பிறிதொரு கூட்டமோ நிராகரித்தது, ஆகவே ஈமான் கொண்டவர்களுக்கு, அவர்களுடைய பகைவர்களுக்கு எதிராக உதவி அளித்தோம் - அதனால் அவர்கள் வெற்றியாளராய் ஆகிவிட்டார்கள்."
        },
        "Tatar": {
            "verse 61:1": "Җирдәге вә күкләрдәге һәр нәрсә Аллаһу тәгаләне: \"Һәр кимчелектән пакь дип, мактап тәсбих әйтә. Ул – Аллаһ һәрнәрсәдән өстен һәм гаделлек белән хөкем итүчедер.",
            "verse 61:2": "Ий мөэминнәр эшләмәгән вә эшләмәячәк эшләрне ник эшләгән булып сөйлисез? (Мөселманнар арасында: \"Әгәр Аллаһ хозурында нинди гамәл яхшы икәнен белсәк, шуны кылыр идек вә шул юлда җаннарыбызны һәм малларыбызны җәлләмәс идек\", – диючеләр бар. Ләкин үзләре сораган яхшы эшләр күренеп калса, ул эштән качалар.)",
            "verse 61:3": "Эшләмәгән эшләрегезне эшләгән булып сөйләүләрегез, Аллаһ хозурында зур гөнаһ, бик яман эштер.",
            "verse 61:4": "Бит Аллаһ коры сөйләнүчеләрне түгел, бәлки кургашыннан коеп куйган койма кеби бер сафта таза торып, Аллаһ юлында ислам өчен сугышкан, көрәшкән һәм тырышкан кешеләрне сөядер.",
            "verse 61:5": "Муса пәйгамбәр кавеменә әйтте: \"Ий кавемем, мине ни өчен рәнҗетәсез, бит тәхкыйк минем сезгә Аллаһудан җибәрелгән пәйгамбәр икәнлегемне беләсез. Алар пәйгамбәр күрсәткән туры юлдан авышкач, Аллаһ аларның күңелләрен хактан авыштырды, батыл вә бозык эшләргә чумдылар. Аллаһ фәсыйкларны туры юлга күндермидер.",
            "verse 61:6": "Дәхи Мәрьям угълы – Гыйса пәйгамбәр әйтте: \"Ий Ягькуб балалары, тәхкыйк мин Аллаһудан сезгә җибәрелгән пәйгамбәрмен, миннән элек иңдерелгән Тәүратны тәсдыйк иткәнем һәм миннән соң килә торган пәйгамбәр белән сөенеч биргәнем хәлдә – аның исеме Әхмәд (Мухәммәд). Гыйса пәйгамбәр аларга аятьләр вә могъҗизалар белән килде исә, бу ачык сихер диделәр.",
            "verse 61:7": "Пәйгамбәр тарафыннан Ислам диненә чакырылып та Аллаһуга ялганны ифтира кылучы кеше хәтле залим кеше булырмы? Әлбәттә, бу кешедән дә залимрак кеше булмас. Аллаһ залимнәрне туры юлга һич тә күндермәс.",
            "verse 61:8": "Кәферләр Коръәнне вә пәйгамбәрне төрлечә яманлап Аллаһ кабызып куйган һидәят яктылыгын авызлары белән сүндермәкче булалар, Аллаһ Үзенең һидәят яктылыгын һәм Ислам динен өйрәтүче Коръәнне кыямәткә хәтле яшәтер, гәрчә кәферләр Аллаһуның бу эшен сөймәсәләр дә, хәтта ачуларыннан корсаклары шартлый торган булса да.",
            "verse 61:9": "Аллаһ Үзенең расүле Мухәммәд г-мне һидәятне өйрәтүче вә күрсәтүче Коръән белән һәм дә хак булган Ислам дине белән җибәрде, ул китергән Ислам дине хаклыгы белән барча диннәрдән өстен булсын өчен, мөшрикләр ислам диненең өстен булганын сөймәсәләр дә.",
            "verse 61:10": "Ий мөэминнәр, мин сезне үзегезне рәнҗеткүче ґәзабтан сатып алу сәүдәсенә чакырыйммы, аның юлын күрсәтимме?",
            "verse 61:11": "Аллаһуга вә Аның рәсүленә иман китерерсез һәм Аллаһ юлында ислам динен куәтләр өчен кәферләр белән сугыш кылырсыз, малыгыз вә тәнегез, җаныгыз белән. Менә бу эш сезнең өчен бик файдалыдыр, әгәр белсәгез!",
            "verse 61:12": "Сезнең гөнаһларыгызны ярлыкар һәм асларыннан елгалар ага торган бакчаларга кертер, дәхи Ґәден җәннәтләренең яхшы урыннарына кертер. Бу җәннәтләргә керү бик зур уңыштыр.",
            "verse 61:13": "Ул җәннәтләрдән башка дөньяда сезгә Аллаһудан сез сөя торган ярдәм булыр һәм сезнең җиңүегез белән шәһәрләр Ислам диненә керер. Хак мөэминнәрне бу нигъмәтләр белән шатландыр!",
            "verse 61:14": "Ий мөэминнәр, Аллаһ дине Исламга ярдәм бирүчеләр булыгыз, Мәрьям угълы Гыйса үзенә ияргән хәварийунга әйткән кеби: \"Аллаһ дине исламны таратырга куәтләргә миңа кем ярдәм бирә? Ихласлы хәварийуннәр Аллаһ диненә без ярдәм бирүчеләрбез\", – диделәр. Исраил балаларыннан бер таифә иман китереп мөселман булдылар, вә бер таифә иман китермәделәр, кәфер булып калдылар. Иман китергән таифәгә куәт вә ярдәм бирдек, дошманнарын җиңеп өстен булырга, һәм алар өскә чыгып Ислам динен тарату белән дөньяга фаш булдылар."
        },
        "Telugu": {
            "verse 61:1": "ఆకాశాలలోనున్న సమస్తమూ మరియు భూమిలోనున్న సమస్తమూ, అల్లాహ్ పవిత్రతను కొనియాడుతూ ఉంటాయి. మరియు ఆయనే సర్వశక్తిమంతుడు, మహా వివేకవంతుడు",
            "verse 61:2": "ఓ విశ్వాసులారా! మీరు చేయని దానిని ఎందుకు పలుకుతున్నారు",
            "verse 61:3": "మీరు చేయని దానిని పలకటం అల్లాహ్ దృష్టిలో చాలా అసహ్యకరమైన విషయం",
            "verse 61:4": "నిశ్చయంగా, అల్లాహ్! తన మార్గంలో దృఢమైన కట్టడం వలే బారులు తీరి పోరాడే వారిని ప్రేమిస్తాడు",
            "verse 61:5": "మరియు మూసా తన జాతివారితో ఇలా అన్న విషయం (జ్ఞాపకం చేసుకోండి): ఓ నా జాతి ప్రజలారా! వాస్తవానికి, నేను మీ వద్దకు పంపబడిన అల్లాహ్ యొక్క సందేశహరుడనని రూఢిగా తెలిసి కూడా, మీరు నన్ను ఎందుకు బాధిస్తున్నారు?\" అయినా వారు వక్రమార్గం అవలంబించినందుకు, అల్లాహ్ వారి హృదయాలను వక్రమార్గంలో పడవేశాడు. మరియు అల్లాహ్ దుర్జనులకు (ఫాసిఖీన్ లకు) సన్మార్గం చూపడు",
            "verse 61:6": "మరియు మర్యమ్ కుమారుడు ఈసా (తన జాతి వారితో) ఇలా అన్నది (జ్ఞాపకం చేసుకోండి): ఓ ఇస్రాయీల్ సంతతి వారలారా! నిశ్చయంగా, నేను మీ వద్దకు పంపబడిన అల్లాహ్ యొక్క సందేశహరుణ్ణి, నాకు పూర్వం, వచ్చి ఉన్న తౌరాత్ గ్రంథాన్ని ధృవపరుస్తున్నాను. మరియు నా తరువాత అహ్మద్ అనే సందేశహరుడు రాబోతున్నాడు, అనే శుభవార్తను ఇస్తున్నాను.\" తరువాత అతను (అహ్మద్) వారి వద్దకు, స్పష్టమైన సూచనలు తీసుకొని వచ్చినపుడు వారు ఇలా అన్నారు: ఇది కేవలం స్పష్టమైన మంత్రజాలమే",
            "verse 61:7": "తనను ఇస్లామ్ వైపునకు పిలిచినప్పుడు, అల్లాహ్ మీద అపనిందలు మోపే వాని కంటే పరమ దుర్మార్గుడు ఎవడు? మరియు అల్లాహ్ దుర్మార్గులైన ప్రజలకు మార్గదర్శకత్వం చేయడు",
            "verse 61:8": "వారు అల్లాహ్ జ్యోతిని (ఇస్లాంను) తమ నోటితో ఊది, ఆర్పి వేయాలనుకుంటున్నారు. కాని సత్యతిరస్కారులకు ఎంత అసహ్యకరమైనా! అల్లాహ్ తన జ్యోతిని వ్యాపింపజేయాలని నిర్ణయించుకున్నాడు",
            "verse 61:9": "ఆయనే, తన ప్రవక్తకు మార్గదర్శకత్వాన్ని మరియు సత్యధర్మాన్ని ఇచ్చి పంపి, దానిని సకల ధర్మాలపై ఆధిక్యత వహించే ధర్మంగా చేశాడు - అది బహుదైవారాధకులకు ఎంత అసహ్యకరమైనా",
            "verse 61:10": "ఓ విశ్వాసులారా! మిమ్మల్ని బాధాకరమైన శిక్ష నుండి కాపాడే వ్యాపారాన్ని మీకు సూచించాలా",
            "verse 61:11": "(అది), మీరు అల్లాహ్ ను మరియు ఆయన ప్రవక్తను విశ్వసించడం మరియు అల్లాహ్ మార్గంలో మీ సంపదలను మరియు మీ ప్రాణాలను వినియోగించి పోరాడటం. మీరు తెలుసుకుంటే! ఇదే మీకు ఎంతో మేలైనది",
            "verse 61:12": "(ఇలా చేస్తే) ఆయన మీ పాపాలను క్షమిస్తాడు మరియు మిమ్మల్ని క్రింద సెలయేళ్ళు ప్రవహించే స్వర్గవనాలలో ప్రవేశింపజేస్తాడు. మరియు శాశ్వతమైన స్వర్గవనాలలో మంచి గృహాలను ప్రసాదిస్తాడు. అదే ఆ గొప్ప విజయం",
            "verse 61:13": "మరియు మీకు ప్రీతికరమైన, మరొక (అనుగ్రహం) కూడా ఉంది! (అది) అల్లాహ్ సహాయం మరియు శీఘ్ర విజయం. మరియు ఈ శుభవార్తను విశ్వాసులకు తెలుపు",
            "verse 61:14": "ఓ విశ్వాసులారా! మర్యమ్ కుమారుడు ఈసా తన శిష్యులకు (హవారియ్యూన్ లకు) ఉపదేశించిన విధంగా, మీరు కూడా అల్లాహ్ కు సహాయకులుగా ఉండండి. (ఆయన వారితో ఇలా అన్నాడు): అల్లాహ్ మార్గంలో నాకు తోడ్పడేవారు ఎవరు?\" ఆ శిష్యులు ఇలా జవాబిచ్చారు: మేము అల్లాహ్ (మార్గంలో) తోడ్పడే వారము!\" అప్పుడు ఇస్రాయీల్ సంతతి వారిలో ఒక వర్గం వారు విశ్వసించారు, మరొక వర్గం వారు తిరస్కరించారు. తరువాత మేము విశ్వసించిన వారికి, వారి శత్రువులకు వ్యతిరేకంగా సహాయం చేశాము, కావున వారు ఆధిక్యతను పొందారు"
        },
        "Thai": {
            "verse 61:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและสิ่งที่อยู่ในแผ่นดินต่างแซ่ซ้อง สดุดีแด่อัลลอฮฺ และพระองค์ เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
            "verse 61:2": "โอ้บรรดาผู้ศรัทธาเอ๋ย ทำไมพวกเจ้าจึงกล้าพูดในสิ่งที่พวกเจ้าไม่ปฏิบัติ",
            "verse 61:3": "เป็นที่น่าเกลียดยิ่งที่อัลลอฮฺ การที่พวกเจ้าพูดในสิ่งที่พวกเจ้าไม่ปฏิบัติ",
            "verse 61:4": "แท้จริง อัลลอฮฺทรงรักบรรดาผู้ที่ต่อสู้ในทางของพระองค์เป็นแถวเดียวกัน ประหนึ่งพวกเขาเป็นอาคารที่ยึดมั่นแข็งแรง",
            "verse 61:5": "และจงรำลึกเมื่อมูซาได้กล่าวแก่หมู่ชนของเขาว่า โอ้หมู่ชนของฉันเอ๋ย ทำไมพวกท่านจึงทำร้ายฉัน และแน่นอนพวกท่านรู้แล้วมิใช่ หรือว่าแท้จริงฉันเป็นร่อซูลของอัลลอฮฺมายังพวกท่าน ดังนั้นเมื่อพวกเขาหันเหไป (จากแนวทาง ที่เที่ยงตรง) อัลลอฮฺก็ทรงทำให้หัวใจของพวกเขาหันเหออกไป และอัลลอฮฺนั้นจะไม่ชี้แนะ ทางที่ถูกต้องแก่หมู่ชนผู้ฝ่าฝืน",
            "verse 61:6": "และจงรำลึก เมื่ออีซา อิบนฺ มัรยัม ได้กล่าวว่า โอ้วงศ์วานของอิสรออีลเอ๋ย แท้จริงฉันเป็นร่อซูลของอัลลอฮฺมายังพวกท่าน เป็นผู้ยืนยันสิ่งที่มีอยู่ในเตารอฮฺก่อนหน้าฉันและเป็นผู้แจ้งข่าวดีถึงร่อซูลคนหนึ่งผู้จะมาภายหลังฉัน ชื่อของเขาคือ อะหมัด ครั้นเมื่อเขา (อะหมัด) ได้มายังพวกเขาพร้อมด้วยหลักฐานอันชัดแจ้งแล้ว พวกเขากล่าวว่านี่คือมายากลแท้ ๆ",
            "verse 61:7": "และผู้ใดเล่าจะอธรรมยิ่งกว่าผู้กล่าวเท็จต่ออัลลอฮฺ ด้วยปากของพวกเขาขณะที่เขาถูกเชิญชวนสู่อิสลาม และอัลลอฮฺนั้นจะไม่ชี้แนะทางที่ถูกต้องแก่หมู่ชนผู้อธรรม",
            "verse 61:8": "พวกเขาปรารถนาที่จะดับรัศมีของอัลลอฮฺด้วยปากของพวกเขา แต่อัลลอฮฺเป็นผู้ทำให้รัศมีของพระองค์สมบูรณ์ แม้ว่าพวกปฏิเสธศรัทธาจะเกลียดชังก็ตาม",
            "verse 61:9": "พระองค์คือผู้ทรงส่งร่อซูลของพระองค์ด้วยการชี้นำทางและศาสนาแห่งสัจธรรมเพื่อพระองค์จะทรงให้ศาสนาอิสลามอยู่เหนือศาสนาทั้งมวล ถึงแม้พวกตั้งภาคีจะเกลียดชังก็ตาม",
            "verse 61:10": "โอ้บรรดาผู้ศรัทธาเอ๋ย ข้าจะชี้แนะแนวทางแก่พวกเจ้าไหมเล่า ถึงการค้าที่จะช่วยพวกเจ้าให้พ้นจากการลงโทษอันเจ็บปวด",
            "verse 61:11": "นั้นคือพวกเจ้าต้องศรัทธาต่ออัลลอฮฺและร่อซูลของพระองค์ และต่อสู้ดิ้นรนในทางอัลลอฮฺ ด้วยทรัพย์สินของพวกเจ้าและชีวิตของพวกเจ้า นั่นเป็นการดียิ่งสำหรับพวกเจ้าหากพวกเจ้ารู้",
            "verse 61:12": "พระองค์จะทรงอภัยให้แก่พวกเจ้า ซึ่งการทำบาปของพวกเจ้า และจะทรงให้พวกเจ้าเข้าในสวนสวรรค์หลากหลาย มีลำน้ำหลายสายไหลผ่าน ณ เบื้องล่างของสวนสวรรค์ และที่พำนักอันบรมสุขในสวนสวรรค์หลากหลายอันสถาพร นั่นคือชัยชนะอันใหญ่หลวง",
            "verse 61:13": "และสิ่งอื่น ๆ อีกที่พวกเจ้ารักชอบมันการช่วยเหลือจากอัลลอฮฺและการพิชิตอันใกล้นี้และจงแจ้งข่าวดีแด่บรรดาผู้ศรัทธาเถิด",
            "verse 61:14": "โอ้บรรดาผู้ศรัทธาเอ๋ย ! จงเป็นผู้ช่วยเหลือในทางของอัลลอฮฺ ดังเช่น อีซา อิบนฺมัรยัมได้กล่าวแก่บรรดาสาวกว่า ผู้ใดจะเป็นผู้ช่วยเหลือฉันไปยังอัลลอฮฺบ้าง? บรรดาสาวกได้กล่าวว่า พวกเราเป็นผู้ช่วยเหลือในทางของอัลลอฮฺ ดังนั้นกลุ่มหนึ่งจากวงศ์วารของอิสรออีลได้ศรัทธา และอีกกลุ่มหนึ่งได้ปฏิเสธศรัทธา แต่เราได้ช่วยเสริมสร้างกำลังแก่บรรดาผู้ศรัทธาให้เหนือกว่าศัตรูของพวกเขา แล้วพวกเขาก็กลายเป็นผู้มีชัยชนะ"
        },
        "Turkish": {
            "verse 61:1": "Göklerde olanlar da yerde olanlar da Allah'ı tesbih ederler. O, güçlüdür, Hakim'dir.",
            "verse 61:2": "Ey inananlar! Yapmayacağınız şeyi niçin söylersiniz?",
            "verse 61:3": "Yapmayacağınız şeyi söylemeniz, Allah katında büyük gazaba sebep olur.",
            "verse 61:4": "Doğrusu Allah, kendi uğrunda, kenetlenmiş bir duvar gibi, saf halinde çarpışanları sever.",
            "verse 61:5": "Musa milletine: \"Ey milletim! Beni niçin incitirsiniz? Oysa, benim size gönderilmiş Allah'ın bir peygamberi olduğumu biliyorsunuz\" demişti. Ama onlar yoldan sapınca, Allah da onların kalblerini saptırmıştı. Allah, yoldan çıkan milleti doğru yola eriştirmez.",
            "verse 61:6": "Meryem oğlu İsa: \"Ey İsrailoğulları! Doğrusu ben, benden önce gelmiş olan Tevrat'ı doğrulayan, benden sonra gelecek ve adı Ahmet olacak bir peygamberi müjdeleyen, Allah'ın size gönderilmiş bir peygamberiyim\" demişti. Ama o elçi, kendilerine belgelerle geldiği zaman: \"Bu, apaçık bir sihirdir\" demişlerdi.",
            "verse 61:7": "Müslüman olmağa çağırılmışken gelmeyip Allah'a karşı yalan uydurandan daha zalim kimdir? Allah, zalim olan milleti doğru yola eriştirmez.",
            "verse 61:8": "Ağızlarıyla Allah'ın nurunu söndürmek isterler. İnkarcılar ne kadar istemeseler de, Allah nurunu, dinini tamamlayacaktır.",
            "verse 61:9": "Ortak koşanlar istemese de, dinini bütün dinlerden üstün kılmak için, Peygamberini, doğruluk rehberi Kuran ve gerçek dinle gönderen O'dur.",
            "verse 61:10": "Ey inananlar! Sizi can yakıcı bir azabdan kurtaracak, kazançlı bir yolu size göstereyim mi?",
            "verse 61:11": "Allah'a ve Peygamberine inanırsınız; Allah yolunda canlarınızla, mallarınızla cihat edersiniz; bilseniz, bu sizin için en iyi yoldur.",
            "verse 61:12": "Böyle yaparsanız, Allah günahlarınızı size bağışlar, sizi, içlerinden ırmaklar akan cennetlere, Adn cennetlerinde hoş yerlere koyar. Büyük kurtuluş budur.",
            "verse 61:13": "Bundan başka, sevdiğiniz bir şey daha: Allah katından bir yardım ve yakın bir zafer vardır. İnananlara müjde ver.",
            "verse 61:14": "Ey inananlar! Allah'ın dininin yardımcıları olun. Nitekim, Meryem oğlu İsa, Havarilere: \"Allah'a giden yolda yardımcılarım kimlerdir?\" deyince, Havariler: \"Allah'ın dininin yardımcıları biziz\" demişlerdi. İsrailoğullarının bir takımı böylece inanmış, bir takımı da inkar etmişti; ama Biz, inananları düşmanlarına karşı destekledik de üstün geldiler."
        },
        "Urdu": {
            "verse 61:1": "جو چیز آسمانوں میں ہے اور زمین میں ہے سب خدا کی تنزیہ کرتی ہے اور وہ غالب حکمت والا ہے",
            "verse 61:2": "مومنو! تم ایسی باتیں کیوں کہا کرتے ہو جو کیا نہیں کرتے",
            "verse 61:3": "خدا اس بات سے سخت بیزار ہے کہ ایسی بات کہو جو کرو نہیں",
            "verse 61:4": "جو لوگ خدا کی راہ میں (ایسے طور پر) پرے جما کر لڑتے کہ گویا سیسہ پلائی دیوار ہیں وہ بےشک محبوب کردگار ہیں",
            "verse 61:5": "اور وہ وقت یاد کرنے کے لائق ہے جب موسیٰ نے اپنی قوم سے کہا کہ اے قوم! تم مجھے کیوں ایذا دیتے ہو حالانکہ تم جانتے ہو کہ میں تمہارے پاس خدا کا بھیجا ہوا آیا ہوں۔ تو جب ان لوگوں نے کج روی کی خدا نے بھی ان کے دل ٹیڑھے کردیئے۔ اور خدا نافرمانوں کو ہدایت نہیں دیتا",
            "verse 61:6": "اور (وہ وقت بھی یاد کرو) جب مریمؑ کے بیٹے عیسیٰ نے کہا کے اے بنی اسرائیل میں تمہارے پاس خدا کا بھیجا ہوا آیا ہوں (اور) جو (کتاب) مجھ سے پہلے آچکی ہے (یعنی) تورات اس کی تصدیق کرتا ہوں اور ایک پیغمبر جو میرے بعد آئیں گے جن کا نام احمدﷺ ہوگا ان کی بشارت سناتا ہوں۔ (پھر) جب وہ ان لوگوں کے پاس کھلی نشانیاں لے کر آئے تو کہنے لگے کہ یہ تو صریح جادو ہے",
            "verse 61:7": "اور اس سے ظالم کون کہ بلایا تو جائے اسلام کی طرف اور وہ خدا پر جھوٹ بہتان باندھے۔ اور خدا ظالم لوگوں کو ہدایت نہیں دیا کرتا",
            "verse 61:8": "یہ چاہتے ہیں کہ خدا کے (چراغ) کی روشنی کو منہ سے (پھونک مار کر) بجھا دیں۔ حالانکہ خدا اپنی روشنی کو پورا کرکے رہے گا خواہ کافر ناخوش ہی ہوں",
            "verse 61:9": "وہی تو ہے جس نے اپنے پیغمبر کو ہدایت اور دین حق دے کر بھیجا تاکہ اسے اور سب دینوں پر غالب کرے خواہ مشرکوں کو برا ہی لگے",
            "verse 61:10": "مومنو! میں تم کو ایسی تجارت بتاؤں جو تمہیں عذاب الیم سے مخلصی دے",
            "verse 61:11": "(وہ یہ کہ) خدا پر اور اس کے رسولﷺ پر ایمان لاؤ اور خدا کی راہ میں اپنے مال اور جان سے جہاد کرو۔ اگر سمجھو تو یہ تمہارے حق میں بہتر ہے",
            "verse 61:12": "وہ تمہارے گناہ بخش دے گا اور تم کو باغہائے جنت میں جن میں نہریں بہہ رہیں ہیں اور پاکیزہ مکانات میں جو بہشت ہائے جاودانی میں (تیار) ہیں داخل کرے گا۔ یہ بڑی کامیابی ہے",
            "verse 61:13": "اور ایک اور چیز جس کو تم بہت چاہتے ہو (یعنی تمہیں) خدا کی طرف سے مدد (نصیب ہوگی) اور فتح عنقریب ہوگی اور مومنوں کو (اس کی) خوشخبری سنا دو",
            "verse 61:14": "مومنو! خدا کے مددگار بن جاؤ جیسے عیسیٰ ابن مریم نے حواریوں سے کہا کہ بھلا کون ہیں جو خدا کی طرف (بلانے میں) میرے مددگار ہوں۔ حواریوں نے کہا کہ ہم خدا کے مددگار ہیں۔ تو بنی اسرائیل میں سے ایک گروہ تو ایمان لے آیا اور ایک گروہ کافر رہا۔ آخر الامر ہم نے ایمان لانے والوں کو ان کے دشمنوں کے مقابلے میں مدد دی اور وہ غالب ہوگئے"
        },
        "Uyghur": {
            "verse 61:1": "ئاسمانلاردىكى نەرسىلەر (يەنى پەرىشتىلەر) ۋە زېمىندىكى نەرسىلەر (يەنى ئىنسانلار، ئۆسۈملۈكلەر، جانسىز شەيئىلەر) اﷲ قا تەسبىھ ئېيتتى، اﷲ غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 61:2": "ئى مۆمىنلەر! سىلەر نېمە ئۈچۈن قىلمايدىغان ئىشنى قىلىمىز دەيسىلەر؟ (يەنى ئەمەلدە سىلەر قىلمايدىغان ياخشى ئىشلارنى نېمە ئۈچۈن ئاغزىڭلاردا قىلىمىز دەيسىلەر؟)",
            "verse 61:3": "سىلەرنىڭ قىلمايدىغان ئىشنى (قىلىمىز) دېيىشىڭلار اﷲ نىڭ دەرگاھىدا ئەڭ ئۆچ (كۆرۈلىدىغان نەرسىدۇر)",
            "verse 61:4": "شۈبھىسىزكى، اﷲ ئۆزىنىڭ يولىدا مۇستەھكەم بىنادەك سەپ بولۇپ جىھاد قىلغانلارنى (يەنى ئۇرۇش مەيدانىدا دۈشمەنلەرگە ئۇچراشقان چاغدا مەۋقەسىدە ساباتلىق تۇرۇپ غازات قىلغانلارنى) دوست تۇتىدۇ",
            "verse 61:5": "ئۆز ۋاقتىدا مۇسا قەۋمىگە: «ئى قەۋمىم! مېنىڭ اﷲ نىڭ سىلەرگە ئەۋەتكەن پەيغەمبەر ئىكەنلىكىمنى بىلىپ تۇرۇپ سىلەر ماڭا نېمىشقا ئازار بېرىسىلەر؟» دېدى، ئۇلار (ھەقتىن) بۇرۇلۇپ كەتكەندىن كېيىن، اﷲ ئۇلارنىڭ دىللىرىنى ھىدايەتتىن بۇرىۋەتتى، اﷲ پاسىق قەۋمنى ھىدايەت قىلمايدۇ",
            "verse 61:6": "ئۆز ۋاقتىدا مەريەمنىڭ ئوغلى ئىسا: «ئى ئىسرائىل ئەۋلادى! مەن سىلەرگە ھەقىقەتەن اﷲ ئەۋەتكەن، مەندىن بۇرۇن كەلگەن تەۋراتنى تەستىق قىلغۇچى، مەندىن كېيىن كېلىدىغان ئەھمەد ئىسىملىك پەيغەمبەر بىلەن خۇش خەۋەر بەرگۈچى پەيغەمبەرمەن» دېدى. ئىسا ئۇلارغا روشەن مۆجىزىلەرنى ئېلىپ كەلگەن چاغدا، ئۇلار: «بۇ ئوپئوچۇق سېھىردۇر» دېدى",
            "verse 61:7": "ئىسلامغا دەۋەت قىلىنىۋېتىپ، اﷲ قا يالغاننى (يەنى اﷲ نىڭ شېرىكى بار، بالىسى بار دېگەندەك سۆزلەرنى) چاپلىغان كىشىدىنمۇ زالىم كىشى بارمۇ؟ اﷲ زالىم (يەنى كاپىر) قەۋمنى ھىدايەت قىلمايدۇ",
            "verse 61:8": "ئۇلار اﷲ نىڭ نۇرىنى (يەنى اﷲ نىڭ دىنىنى ۋە نۇرلۇق شەرىئىتىنى) ئېغىزلىرى بىلەن ئۆچۈرۈۋەتمەكچى بولىدۇ، كاپىرلار يامان كۆرگەن تەقدىردىمۇ، اﷲ ئۆزىنىڭ نۇرىنى مۇكەممەل قىلغۇچىدۇر (يەنى ئۆزىنىڭ دىنىنى ئاشكارىلىغۇچىدۇر",
            "verse 61:9": "مۇشرىكلار يامان كۆرگەن تەقدىردىمۇ، اﷲ ھەق دىننى بارلىق دىنلار ئۈستىدىن غالىب قىلىش ئۈچۈن پەيغەمبىرىنى ھىدايەت بىلەن ۋە ھەق دىن بىلەن ئەۋەتتى",
            "verse 61:10": "ئى مۆمىنلەر! سىلەرگە سىلەرنى قاتتىق ئازابتىن قۇتۇلدۇرىدىغان بىر تىجارەتنى كۆرسىتىپ قويايمۇ؟",
            "verse 61:11": "اﷲ قا ۋە ئۇنىڭ پەيغەمبىرىگە (چىن) ئىمان ئېيتقايسىلەر، اﷲ نىڭ يولىدا مېلىڭلار بىلەن، جېنىڭلار بىلەن جىھاد قىلغايسىلەر، ئەگەر بىلسەڭلار، سىلەر ئۈچۈن بۇ ياخشىدۇر",
            "verse 61:12": "(شۇنداق قىلساڭلار) اﷲ سىلەرنىڭ گۇناھلىرىڭلارنى مەغپىرەت قىلىدۇ، سىلەرنى ئاستىدىن ئۆستەڭلەر ئېقىپ تۇرىدىغان جەننەتلەرگە كىرگۈزىدۇ، دائىمىي تۇرالغۇ بولغان جەننەتلەردىكى گۈزەل سارايلاردا (تۇرغۇزىدۇ)، بۇ چوڭ مۇۋەپپەقىيەتتۇر",
            "verse 61:13": "سىلەرگە (مەرھەمەت قىلىنىدىغان) سىلەر ياخشى كۆرۈدىغان ئىككىنچى بىر نېمەت اﷲ تىن كېلىدىغان نۇسرەت ۋە يېقىن غەلىبە (يەنى مەككىنىڭ پەتھى قىلىنىشى) دۇر، (ئى مۇھەممەد!) مۆمىنلەرگە (بۇ روشەن مەرھەمەت بىلەن) خۇش خەۋەر بەرگىن",
            "verse 61:14": "ئى مۆمىنلەر! ھەۋارىيۇنلار (يەنى ئىسا ئەلەيھىسسالامغا دەسلەپتە ئىمان ئېيتقان مۆمىن قەۋم) دەك اﷲ نىڭ ياردەمچىلىرى بۇلۇڭلار، مەريەمنىڭ ئوغلى ئىسا ھەۋارىيۇنلارغا: «(اﷲ نىڭ دەۋىتىنى تەبلىغ قىلىشتا) اﷲ قا كىملەر ياردەمچىلىرىم بولىدۇ؟» دېدى، ھەۋارىيۇنلار: «بىز اﷲ نىڭ ياردەمچىلىرىمىز» دېدى، ئىسرائىل ئەۋلادىدىن بىر تائىپە ئىمان ئېيتتى، يەنە بىر تائىپە كاپىر بولدى، مۆمىنلەرگە ئۇلارنىڭ ئۆز دۈشمەنلىرىگە قارشى تۇرۇشىدا يار - يۆلەكتە بولدۇق، شۇنىڭ بىلەن مۆمىنلەر غالىب بولدى"
        },
        "Uzbek": {
            "verse 61:1": "Осмонлару ердаги барча нарсалар Аллоҳга тасбиҳ айтадир. У зот ғолиб ва ҳикмат эгасидир.",
            "verse 61:2": "Эй иймон келтирганлар! Нима учун қилмаган нарсангизни гапирасиз.",
            "verse 61:3": "Қилмаган нарсангизни гапиришингиз Аллоҳнинг наздида қаттиқ ёмон кўрилгандир.",
            "verse 61:4": "Албатта, Аллоҳ Ўз йўлида худди жипс бинодек бўлиб, сафда туриб уруш қиладиганларни яхши кўрадир.",
            "verse 61:5": "Мусо ўз қавмига: «Эй қавмим, Аллоҳнинг Расули эканимни билиб туриб, яна нима учун менга озор берасиз», деганини эсла. Улар (ҳақдан) бурилган эдилар Аллоҳ уларнинг қалбини буриб қўйди. Аллоҳ фосиқ қавмларни ҳидоят қилмас.",
            "verse 61:6": "Ийсо ибн Мариям: «Эй Бани Исроил, албатта, мен ўзимдан олдин келган Тавротни тасдиқловчи ва мендан кейин келувчи Аҳмад исмли Расулнинг башоратини берувчи, Аллоҳ сизларга юборган Пайғамбарман», деганини эсла. (Аҳмад) уларга ҳақ билан келган вақтда эса, бу очиқ-ойдин сеҳрдир, дедилар.",
            "verse 61:7": "Исломга даъват қилиниб турганда Аллоҳга нисбатан ёлғон тўқиган кимсадан ҳам золимроқ киши борми? Ҳолбуки. Аллоҳ золимларни ҳидоятга солмас.",
            "verse 61:8": "Оғизлари билан Аллоҳнинг нурини ўчирмоқчи бўлурлар. Ҳолбуки, Аллоҳ, кофирлар ёқтирмаса ҳам, Ўз нурини тугал этгувчидир.",
            "verse 61:9": "У зот, Ўз Расулини ҳидоят ва ҳақ дин билан барча динлардан устун қилиш учун юборган зотдир. Гарчи мушриклар ёқтирмасалар ҳам.",
            "verse 61:10": "Эй иймон келтирганлар! Сизларни аламли азобдан нажот топтирувчи тижоратга далолат қилайми?",
            "verse 61:11": "Аллоҳга ва Унинг Расулига иймон келтирасизлар ҳамда Унинг йўлида молингиз ва жонингиз билан жиҳод қиласизлар. Шундоқ қилмоқларингиз, агар билсангизлар, ўзларингиз учун яхшидир.",
            "verse 61:12": "Ана шунда, У зот гуноҳларингизни кечирур ва сизларни адн жаннатидаги остидан анҳорлар оқиб турган боғларга ва яхши масканларга киритур. Бу улуғ ютуқдир.",
            "verse 61:13": "Ва сизлар яхши кўрадиган бошқаси ҳам бор. Аллоҳдан ёрдам ва яқин зафар. Ва мўминларга башорат бер.",
            "verse 61:14": "Эй иймон келтирганлар! Аллоҳнинг ёрдамчилари бўлинг! Худди Ийсо ибн Марям ҳаворийларга: «Ким Аллоҳ учун менинг ёрдамчим» деганида, ҳаворийлар: «Биз Аллоҳнинг ёрдамчиларимиз», деганларидек. Бас, Бани Исроилдан бир тоифа иймон келтирди ва бир тоифа кофир бўлди. Бас, Биз иймон келтирганларни душманлари устидан қўллаб-қувватладик. Ва улар ғолиб бўлдилар."
        },
        "Vietnamese": {
            "verse 61:1": "Vạn vật trong các tầng trời và vạn vật trên trái đất đều tán dương tôn cao Allah bởi Ngài là Đấng Chí Tôn, Đấng Thông Thái.",
            "verse 61:2": "Hỡi những người có đức tin! Tại sao các ngươi nói những điều các ngươi không làm?",
            "verse 61:3": "Điều đáng ghét nhất đối với Allah là việc các ngươi nói những điều các ngươi không làm.",
            "verse 61:4": "Thật vậy, Allah yêu thương những người chiến đấu vì con đường Chính Nghĩa của Ngài như thể họ là một cấu trúc (duy nhất) liên kết vững chắc.",
            "verse 61:5": "(Ngươi – Thiên Sứ Muhammad, hãy nhớ lại) khi Musa nói với người dân của mình: “Hỡi người dân của Ta, tại sao các người làm hại Ta trong khi các người biết rõ Ta đích thực là Sứ Giả của Allah được phái đến cho các người?”. Vì vậy, khi chúng chệch hướng, Allah đã khiến trái tim của chúng lầm lạc. Quả thật, Allah không hướng dẫn đám người dấy loạn và bất tuân.",
            "verse 61:6": "(Ngươi – Thiên Sứ Muhammad, hãy nhớ lại) khi Ysa, con trai của Maryam, nói: “Hỡi con cháu Israel! Ta đích thực là Sứ Giả của Allah được phái đến với các người xác nhận những điều đã đến trước Ta trong Kinh Tawrah đồng thời mang tin tốt lành về một Sứ Giả của Allah sẽ đến sau Ta, tên Ahmad”. Tuy nhiên, khi Y (Muhammad) đến gặp chúng với những bằng chứng rõ ràng thì chúng nói: “Đây rõ ràng là một trò ma thuật.”",
            "verse 61:7": "Và ai bất công hơn một kẻ bịa ra điều không đúng sự thật về Allah trong khi y được mời gọi đến với Islam. Quả thật, Allah không hướng dẫn đám người làm điều sai quấy.",
            "verse 61:8": "Chúng muốn dập tắt Ánh Sáng của Allah bằng miệng của chúng nhưng Allah sẽ hoàn thiện Ánh Sáng của Ngài, mặc dù những kẻ vô đức tin không thích điều đó.",
            "verse 61:9": "Chính Ngài là Đấng đã cử phái Sứ Giả của Ngài mang nguồn Chỉ Đạo và tôn giáo chân lý để hiển thị nó trên các tôn giáo mặc dù những kẻ đa thần không thích điều đó.",
            "verse 61:10": "Hỡi những người có đức tin! (Các ngươi có muốn) TA chỉ cho các ngươi một cuộc giao dịch làm ăn giúp các ngươi thoát khỏi sự trừng phạt đau đớn không?",
            "verse 61:11": "(Đó là) các ngươi tin nơi Allah và Sứ Giả của Ngài đồng thời chiến đấu cho con đường Chính Nghĩa của Allah bằng tài sản và sinh mạng của các ngươi. Điều đó tốt nhất cho các ngươi nếu các ngươi biết.",
            "verse 61:12": "Ngài sẽ tha thứ cho tội lỗi của các ngươi và thu nhận các ngươi vào những ngôi vườn bên dưới có các dòng sông chảy, và những chỗ ở tốt lành bên trong những Ngôi Vườn Vĩnh Cữu. Đó là một thành tựu vĩ đại.",
            "verse 61:13": "Và (các ngươi sẽ có được) một (ân huệ) khác mà các ngươi yêu thích - đó là sự giúp đỡ của Allah và một cuộc thắng lợi gần kề (chinh phục được Makkah). Vì vậy, Ngươi (hỡi Thiên Sứ Muhammad) hãy báo tin mừng cho những người có đức tin.",
            "verse 61:14": "Hỡi những người có đức tin! Các ngươi hãy là những người ủng hộ (con đường chính nghĩa của) Allah giống như khi Ysa con trai của Maryam, nói với các môn đồ (của mình): “Ai là người ủng hộ Ta (trên con đường) đến với Allah?” Các môn đồ nói: “Chúng tôi là những người ủng hộ (con đường Chính Nghĩa của) Allah.” Tuy nhiên, một thành phần của con cháu Israel có đức tin và một thành phần khác thì lại vô đức tin. Vì vậy, TA đã ủng hộ những người có đức tin chống lại kẻ thù của họ, và họ đã giành chiến thắng."
        },
        "Yoruba": {
            "verse 61:1": "Ohunkohun t’o wa ninu awon sanmo ati ohunkohun t’o wa ninu ile n safomo fun Allahu. Oun si ni Alagbara, Ologbon",
            "verse 61:2": "Eyin ti e gbagbo ni ododo, nitori ki ni e se n so ohun ti e o nii se nise",
            "verse 61:3": "O je ohun ibinu t’o tobi ni odo Allahu pe ki e so ohun ti e o nii se",
            "verse 61:4": "Dajudaju Allahu feran awon t’o n jagun fun esin Re (ti won to ni) owoowo bi eni pe ogiri ile ti won le po mora won ni won",
            "verse 61:5": "(Ranti) nigba ti (Anabi) Musa so fun ijo re pe: \"Eyin ijo mi, nitori ki ni e oo se fi inira kan mi. E si kuku mo pe dajudaju Ojise Allahu ni emi je si yin.\" Nigba ti won si ye (kuro nibi ododo), Allahu ye okan won. Allahu ko si nii fi ona mo ijo obileje",
            "verse 61:6": "(Ranti) nigba ti ‘Isa omo Moryam so pe: \"Eyin omo ’Isro’il, dajudaju emi ni Ojise Allahu si yin. Mo n fi ohun t’o je ododo rinle nipa eyi t’o siwaju mi ninu Taorah. Mo si n mu iro-idunnu wa nipa Ojise kan t’o n bo leyin mi. Oruko re ni ’Ahmod.\" Nigba ti o ba si wa ba won pelu awon eri t’o yanju, won a wi pe: \"Idan ponnbele ni eyi",
            "verse 61:7": "Ta si ni o sabosi t’o tayo eni ti o da adapa iro mo Allahu, ti won si n pe e sinu ’Islam! Allahu ko si nii fi ona mo ijo alabosi",
            "verse 61:8": "Won n gbero lati fi (oro) enu won pa imole Allahu. Allahu yo si mu imole Re tan kari, awon alaigbagbo ibaa korira re",
            "verse 61:9": "(Allahu) Oun ni Eni ti O fi imona ati esin ododo (’Islam) ran Ojise Re nitori ki O le fi bori esin (miiran), gbogbo re patapata, awon osebo ibaa korira re",
            "verse 61:10": "Eyin ti e gbagbo ni ododo, se ki Ng toka yin si okowo kan ti o maa gba yin la ninu iya eleta-elero",
            "verse 61:11": "E gbagbo ninu Allahu ati Ojise Re, e jagun soju ona (esin) Allahu pelu awon dukia yin ati emi yin. Iyen loore julo fun yin ti e ba mo",
            "verse 61:12": "(Allahu) maa fori ese yin jin yin. O si maa mu yin wo inu awon Ogba Idera, ti awon odo n san ni isale re ati awon ibugbe t’o dara ninu awon Ogba Idera gbere. Iyen ni erenje nla",
            "verse 61:13": "Ati nnkan miiran ti e tun nifee si; (iyen,) aranse lati odo Allahu ati isegun t’o sunmo. Ki o si fun awon onigbagbo ododo ni iro idunnu",
            "verse 61:14": "Eyin ti e gbagbo ni ododo, e je alaranse fun esin Allahu gege bi (Anabi) ‘Isa omo Moryam se so fun awon omoleyin re pe: \"Ta ni o maa se iranlowo fun mi nipa esin Allahu?\" Awon omoleyin re so pe: \"Awa ni alaranse fun esin Allahu.\" Igun kan ninu awon omo ’Isro’il gba a gbo ni ododo nigba naa, igun kan si sai gbagbo ninu re. A si fun awon t’o gbagbo lagbara lori awon ota won; won si di olubori"
        }
    }
}