{
    "id": 62,
    "name_simple": "Al-Jumu'ah",
    "revelation_place": "madinah",
    "revelation_order": 110,
    "bismillah_pre": true,
    "verses_count": 11,
    "short_text": "It is derived from the sentence idha nudiya-lis-salat-imin-yaum-il- Jumu'ati of verse 9. Although in this Surah injunctions about the Friday congregational Prayer also have been given, yet 'Jumu'ah' is not the title of its subject-matter as a whole, but this name too, like the names of other Surahs, is only a symbolic title.",
    "text": [
        "\n",
        "It is derived from the sentence idha nudiya-lis-salat-imin-yaum-il- Jumu'ati of verse 9. Although in this Surah injunctions about the Friday congregational Prayer also have been given, yet \"Jumu'ah \" is not the title of its subject-matter as a whole, but this name too, like the names of other Surahs, is only a symbolic title.",
        "\n",
        "Period of Revelation",
        "\n",
        "The period of the revelation of the first section (vv. 1-8) is A. H. 7, and probably it was sent down, on the occasion of the conquest of Khaiber or soon after it. Bukhari, Muslim, Tirmidhi, Nasa'i and Ibn Jarir have related on the authority of Hadrat Abu Hurairah that he and other Companions were sitting in the Holy Prophet's assembly when these verses were revealed. About Abu Hurairah it is confirmed historically that he entered Islam after the truce of Hudaibiyah and before the conquest of Khaiber, and Khaiber was conquered, according to Ibn Hisham, in Muharram, and, according to Ibn Sa\\`d, in Jamadi al-Awwal, A.H. 7. Thus presumably Allah might have sent down these verses, addressing the Jews, when their last stronghold had fallen to the Muslims, or these might have been revealed when, seeing the fate of Khaiber, all the Jewish settlements of northern Hijaz had surrendered to the Islamic government.",
        "\n",
        "The second section (vv. 9-11) was sent down shortly after the emigration, for the Holy Prophet (upon whom be Allah's peace) had established the Friday congregational Prayer on the 5th day after his arrival at Madinah. The incident that has been referred to in the last verse of this section must have occurred at a time when the people had not yet received full training in the etiquette of religious congregations.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "As we have explained above, the two sections of this Surah were sent down in two different periods. That is why their themes as well as their audiences are different. Although there is a kind of harmony between them on account of which they have been put together in one Surah, yet we should understand their themes separately before we consider the question of their harmony.",
        "\n",
        "The first section was sent down at a time when all Jewish efforts to obstruct the message of Islam during the past six years had failed. First. in Madinah as many as three of their powerful tribes had done whatever they could to frustrate the mission of the Holy Prophet, with the result that one of the tribes was completely exterminated and the other two were exiled. Then by intrigue and conspiracy they brought many of the Arab tribes together to advance on Madinah, but in the Battle of the Trench they were all repulsed. After this, Khaiber had become their stronghold, where a large number of the Jews expelled from Madinah also had taken refuge. At the time these verses were revealed, that too was taken without any extraordinary effort, and the Jews at their own request agreed to live there as tenants of the Muslims. After this final defeat the Jewish power in Arabia came to an end. Then, Wad-il-Qura, Fadak, Taima', Tabuk, all surrendered one after the other, so much so that all\r\nArabian Jews became subdued to the same Islam which they were not prepared to tolerate before. This was the occasion when Allah Almighty once again addressed them in this Surah, and probably this was the last and final address that was directed to them in the Qur'an. In this they have been reminded of three things:",
        "\n",
        "\n\n\"You refused to believe in this Messenger only because he was born among a people whom you contemptuously call the \"gentiles.\" You were under the false delusion that the Messenger must necessarily belong to your own community. You seemed to have been convinced that anyone who claimed to be a prophet from outside your community, must be an impostor, for this office had been reserved for your race, and a messenger could never be raised among the \"gentiles.\" But among the same gentiles Allah has raised a Messenger who is reciting His Book in front of your very eyes, is purifying souls, and showing the Right Way to the people whose misdeeds are well known to you. This is Allah's bounty, which He may bestow on anyone He may please. You have no monopoly over it so that He may bestow it over whomever you may please and may withhold it from whomever you may desire it to be withheld\".\n\n\n\"You had been made bearers of the Torah, but you did not understand your responsibility for it nor discharged it as you should have. You are like the donkey which is loaded with books, and which does not know what burden it is bearing. Rather you are worse than the donkey, for the donkey is devoid of sense, but you are intelligent. You not only shirk your responsibility of being bearers of Allah's revelations deliberately, Yet, you are under the delusion that you are Allah's favorites and the blessing of apostleship has been reserved for you alone. More than that, you seem to entertain the notion that whether you fulfill the demands of Allah's message or not, Allah In any case is bound not to make any other than you the bearer of His message.\"\n\n\n\"If you really were Allah's favorites and you were sure of having a p!ace of honor and high rank reserved with Him, you would not have feared death so much as to prefer a life of disgrace to death. It is only because of this fear of death that you have suffered humiliation after humiliation during the past few years. Your this condition is by itself a proof that you are fully conscious of your misdeeds, and your conscience is aware that if you die with these misdeeds, you will meet with a greater disgrace before Allah in the Hereafter than in this world.\"\n\n",
        "\n",
        "This is the subject-matter of the first section. The second section that was sent down many years later, was appended to this Surah because in it Allah has bestowed Friday on the Muslims as against the Sabbath of the Jews, and Allah wanted to warn the Muslims not to treat their Friday as the Jews had treated their Sabbath. This section was sent down on an occasion when a trade caravan arrived in Madinah right at the time of the Friday congregational service and hearing its din and drum the audience, except for 12 men, left the Prophet's Mosque and rushed out to the caravan, although the Holy Prophet (upon whom be Allah's peace) at that time was delivering the Sermon. Thereupon it was enjoined that after the call is sounded for the Friday Prayer all trade and business and other occupations become forbidden. The believers should then suspend every kind of transaction and hasten to the remembrance of Allah. However, when the Prayer is over, they have the right to disperse in the\r\nland to resume their normal occupations. This section could be made an independent Surah in view of the commandments that it contains about the congregational service on Friday, and could also be included in some other Surah, but, instead, it has been included here particularly in the verses in which the Jews have been warned of the causes of their evil end. Its wisdom in our opinion is the same as we have explained above.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that enjoins the believers to proceed at once to the ritual Prayer of the Friday congregation and to quit all commercial transacting as soon as they hear the call to the Prayer. It takes its name after “Friday” (jumuʿah) prayer mentioned in verse 9. The surah instruction to the believers to observe the Friday prayer promptly and reliably when called and reminds the Muslims of God’s grace in granting them a prophet and the chance to grow spiritually (verse 2 .). Those who do not act in accordance with the knowledge they have been given are criticized (verse 5 .).The surah is also known as: The Assembly (Friday) Prayer, The Congregation, The Day of Congregation, The Friday Congregation.",
    "name_translation": "Friday",
    "name_complex": "Al-Jumu‘ah",
    "surah_name_ar": "الجمعة",
    "verses": {
        "Albanian": {
            "verse 62:1": "Çka ka në qiej dhe çka ka në Tokë e falenderojnë Perëndinë, Sunduesin absolut, të pastër (prej të gjitha të metave), të Plotëfuqishëm dhe të Gjithëdijshëm.",
            "verse 62:2": "Perëndia është Ai, që ju ka dërguar të pa arsimuarve një Profet nga mesi i tyre, që ua ka lexuar ajetet e Kur’anit dhe i ka pastruar (nga gjendjet e gabuara), ua ka mësuar Librin (Kur’anin) dhe urtinë (dijeninë e thellë), meqë, ata më parë, në të vërtetë, kanë qenë në humbje të plotë,",
            "verse 62:3": "edhe të tjerëve nga ata, të cilët ende nuk u janë bashkuar – Ai (Perëndia), është i Plotëfuqishëm dhe i Gjithëdijshëm.",
            "verse 62:4": "Kjo është dhuntia e Perëndisë, të cilën Ai ia jep kujt të dojë, e dhuntia e Perëndisë është e madhe.",
            "verse 62:5": "Shembulli i atyr që janë obliguar me Teurat e pastaj nuk e kanë zbatuar, i shembëllen gomarit që i bartë librat (por pa dobi). E, sa të këqinj janë ata, të cilët i mohojnë argumentet e Perëndisë! E, Perëndia, nuk e orienton në rrugën e drejtë atë popull që është dhunues (zullumqar).",
            "verse 62:6": "Thuaj: “O Hebrenj (Çifutë), nëse ju pohoni se jeni të vetmit njerëz të dashur të Perëndisë, atëhrë dëshiroie vdekjen, nëse jeni të sinqertë”.",
            "verse 62:7": "Ata kurrë nuk e dëshirojnë vdekjen për shkak të veprave që kanë punuar; e Perëndia i njeh mirë zullumqarët.",
            "verse 62:8": "Thuaj: “Vdekjes së cilës po i ikni ju, ajo do t’ju arrijë. Pastaj, ju do të ktheheni tek Ai, që i di gjërat e dukshme dhe të padukshme, dhe Ai do t’u informojë juve për atë që keni punuar”.",
            "verse 62:9": "O besimtarë, kur të thirreni për lutje ditën e premte, nxitoni për ta përmendur Perëndinë (namazi i xhumasë) dhe pezulloni shitblerjen; kjo është më mirë për ju, nëse e dini!",
            "verse 62:10": "E kur të përfundojë namazi, atëherë shpërndahuni nëpër tokë dhe kërkoni nga begatitë e Perëndisë dhe përmendeni shumë Perëndinë, për të arritur shpëtimin.",
            "verse 62:11": "Mirëpo, kur ata shohin ndonjë tregti ose lojë, shkojnë tek ajo e të lënë ty të qëndrosh (vetëm). Thuaj: “Ajo që është te Perëndia – është më e mirë nga ahengu e nga tregtia”. – E Perëndia është furnizuesi më i mirë."
        },
        "Amharic": {
            "verse 62:1": "በሰማያት ያለው በምድርም ያለው ሁሉ ለአላህ ንጉሥ፣ ቅዱስ፣ አሸናፊ፣ ጥበበኛ ለኾነው ያሞግሳል፡፡",
            "verse 62:2": "እርሱ ያ በመሃይሞቹ ውስጥ አንቀጾቹን (ቁርኣንን) በእነርሱ ላይ የሚያነብላቸው፣ (ከማጋራት) የሚያጠራቸውም፣ መጽሐፍንና ጥበብን የሚያስተምራቸውም የኾነን መልክተኛ (ሙሐመድን) ከእነርሱው ውስጥ የላከ ነው፡፡ እነርሱም ከእርሱ በፊት በግልጽ ስሕተት ውስጥ ነበሩ፡፡",
            "verse 62:3": "ከነሱም ሌሎች ገና ያልተጠጉዋቸው በኾኑት ላይ (የላከው ነው)፡፡ እርሱም አሸናፊው ጥበበኛው ነው፡፡",
            "verse 62:4": "ይህ የአላህ ችሮታ ነው፡፡ ለሚሻው ሰው ይሰጠዋል፡፡ አላህም የታላቅ ችሮታ ባለቤት ነው፡፡",
            "verse 62:5": "የእነዚያ ተውራትን የተጫኑትና ከዚያም ያልተሸከሟት (ያልሠሩባት) ሰዎች ምሳሌ መጽሐፎችን እንደሚሸከም አህያ ብጤ ነው፡፡ የእነዚያ በአላህ አንቀጾች ያስተባበሉት ሕዝቦች ምሳሌ ከፋ፡፡ አላህም በዳዮችን ሕዝቦች አይመራም፡፡",
            "verse 62:6": "«እናንተ አይሁዳውያን የኾናችሁ ሆይ! ከሰው ሁሉ በስተቀር እናንተ ብቻ ለአላህ ወዳጆች ነን ብትሉ እውነተኞች እንደኾናችሁ ሞትን ተመኙ» በላቸው፡፡",
            "verse 62:7": "እጆቻቸውም ባስቀደሙት ኃጢአት ምክንያት በፍጹም አይመኙትም፡፡ አላህም በዳዮቹን ዐዋቂ ነው፡፡",
            "verse 62:8": "«ያ ከእርሱ የምትሸሹት ሞት እርሱ በእርግጥ አግኛችሁ ነው፡፡ ከዚያም ሩቁንና ቅርቡን ዐዋቂ ወደ ኾነው ጌታ ትመለሳላችሁ፡፡ ትሠሩትም የነበራችሁትን ሁሉ ይነግራችኋል» በላቸው፡፡",
            "verse 62:9": "እናንተ ያመናችሁ ሆይ! በዐርብ ቀን ለስግደት ጥሪ በተደረገ ጊዜ ወደ አላህ ማውሳት ኺዱ፡፡ መሸጥንም ተዉ፡፡ ይህ የምታውቁ ብትኾኑ ለእናንተ በጣም የተሻለ ነወ፡፡",
            "verse 62:10": "ሶለቲቱም በተፈጸመች ጊዜ በምድር ላይ ተበተኑ፡፡ ከአላህም ችሮታ ፈልጉ፡፡ አላህንም በብዙ አውሱ፡፡ ልትድኑ ይከጀላልና፡፡",
            "verse 62:11": "ንግድን ወይም ዛዛታን ባዩ ጊዜም ቆመህ የተዉህ ሲኾኑ ወደእርሷ ይበተናሉ፡፡ አላህ ዘንድ ያለው ዋጋ ከዛዛታም ከንግድም በላጭ ነው፡፡ «አላህም ከሰጪዎቹ ሁሉ ይበልጥ ሲሳይን ሰጭ ነው» በላቸው፡፡"
        },
        "Arabic": {
            "verse 62:1": "ِميِكَحْلا ِزيِزَعْلا ِسوُّدُقْلا ِكِلَمْلا ِضْرَأْلا يِف اَمَو ِتاَواَمَّسلا يِف اَم ِهَّلِل ُحِّبَسُي",
            "verse 62:2": "ٍنيِبُّم ٍلاَلَض يِفَل ُلْبَق نِم اوُناَك نِإَو َةَمْكِحْلاَو َباَتِكْلا ُمُهُمِّلَعُيَو ْمِهيِّكَزُيَو ِهِتاَيآ ْمِهْيَلَع وُلْتَي ْمُهْنِّم اًلوُسَر َنيِّيِّمُأْلا يِف َثَعَب يِذَّلا َوُه",
            "verse 62:3": "ُميِكَحْلا ُزيِزَعْلا َوُهَو ۚ ْمِهِب اوُقَحْلَي اَّمَل ْمُهْنِم َنيِرَخآَو",
            "verse 62:4": "ِميِظَعْلا ِلْضَفْلا وُذ ُهَّللاَو ۚ ُءاَشَي نَم ِهيِتْؤُي ِهَّللا ُلْضَف َكِلَٰذ",
            "verse 62:5": "َنيِمِلاَّظلا َمْوَقْلا يِدْهَي اَل ُهَّللاَو ۚ ِهَّللا ِتاَيآِب اوُبَّذَك َنيِذَّلا ِمْوَقْلا ُلَثَم َسْئِب ۚ اًراَفْسَأ ُلِمْحَي ِراَمِحْلا ِلَثَمَك اَهوُلِمْحَي ْمَل َّمُث َةاَرْوَّتلا اوُلِّمُح َنيِذَّلا ُلَثَم",
            "verse 62:6": "َنيِقِداَص ْمُتنُك نِإ َتْوَمْلا اُوَّنَمَتَف ِساَّنلا ِنوُد نِم ِهَّلِل ُءاَيِلْوَأ ْمُكَّنَأ ْمُتْمَعَز نِإ اوُداَه َنيِذَّلا اَهُّيَأ اَي ْلُق",
            "verse 62:7": "َنيِمِلاَّظلاِب ٌميِلَع ُهَّللاَو ۚ ْمِهيِدْيَأ ْتَمَّدَق اَمِب اًدَبَأ ُهَنْوَّنَمَتَي اَلَو",
            "verse 62:8": "َنوُلَمْعَت ْمُتنُك اَمِب مُكُئِّبَنُيَف ِةَداَهَّشلاَو ِبْيَغْلا ِمِلاَع ٰىَلِإ َنوُّدَرُت َّمُث ۖ ْمُكيِقاَلُم ُهَّنِإَف ُهْنِم َنوُّرِفَت يِذَّلا َتْوَمْلا َّنِإ ْلُق",
            "verse 62:9": "َنوُمَلْعَت ْمُتنُك نِإ ْمُكَّل ٌرْيَخ ْمُكِلَٰذ ۚ َعْيَبْلا اوُرَذَو ِهَّللا ِرْكِذ ٰىَلِإ اْوَعْساَف ِةَعُمُجْلا ِمْوَي نِم ِةاَلَّصلِل َيِدوُن اَذِإ اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 62:10": "(َنوُحِلْفُت ْمُكَّلَعَّل اًريِثَك َهَّللا اوُرُكْذاَو ِهَّللا ِلْضَف نِم اوُغَتْباَو ِضْرَأْلا يِف اوُرِشَتناَف ُةاَلَّصلا ِتَيِضُق اَذِإَف",
            "verse 62:11": "(َنيِقِزاَّرلا ُرْيَخ ُهَّللاَو ۚ ِةَراَجِّتلا َنِمَو ِوْهَّللا َنِّم ٌرْيَخ ِهَّللا َدنِع اَم ْلُق ۚ اًمِئاَق َكوُكَرَتَو اَهْيَلِإ اوُّضَفنا اًوْهَل ْوَأ ًةَراَجِت اْوَأَر اَذِإَو"
        },
        "Azerbaijani": {
            "verse 62:1": "Göylərdə və yerdə olanların hamısı Hökmran, Müqəddəs, Qüdrətli, Müdrik Allahın şəninə təriflər deyir.",
            "verse 62:2": "Savadsızlara özlərindən elçi göndərən Odur. Elçi onlara Allahın ayələrini oxuyar, onları pis əməllərdən təmizləyər, onlara Kitabı və Hikməti öyrədər. Halbuki onlar əvvəllər açıq-aydın azğınlıq içində idilər.",
            "verse 62:3": "Allah səni hələ müsəlmanlara qoşulmamış başqalarına da elçi göndərmişdir. O, Qüdrətlidir, Müdrikdir.",
            "verse 62:4": "Bu, Allahın lütfüdür, onu istədiyinə verir. Allah böyük lütf sahibidir.",
            "verse 62:5": "Onlara Tövrata əməl etmək tapşırıldıqdan sonra ona əməl etməyənlər belində çoxlu kitab daşıyan, amma onlardan faydalana bilməyən uzunqulağa bənzəyirlər. Allahın ayələrini yalan sayan adamların məsəli necə də pisdir. Allah zalım adamları doğru yola yönəltməz.",
            "verse 62:6": "De: “Ey yəhudilər! Əgər insanlar arasında ancaq özünüzün Allahın dostları olduğunuzu iddia edirsinizsə və doğru danışanlarsınızsa, onda özünüzə ölüm diləyin!”",
            "verse 62:7": "Lakin onlar öz əlləri ilə törətdikləri əməllərə görə ölümü əsla diləməzlər. Allah zalımları tanıyır.",
            "verse 62:8": "De: “Qaçdığınız ölüm sizi mütləq haqlayacaqdır. Sonra siz qeybi və aşkarı Bilənin hüzuruna qaytarılacaqsınız. O da sizə nə etdiklərinizi xəbər verəcəkdir”.",
            "verse 62:9": "Ey iman gətirənlər! Cümə günü namaza çağırılanda Allahı yad etməyə tələsin və ticarəti dayandırın. Bilsəniz, bu sizin üçün nə qədər xeyirlidir!",
            "verse 62:10": "Namaz başa çatdıqdan sonra yer üzünə dağılıb Allahın lütfünü axtarın və Allahı çox zikr edin ki, bəlkə nicat tapasınız.",
            "verse 62:11": "Onlar ticarət və ya əyləncə gördükləri zaman dağılışıb ona tərəf qaçdılar və səni minbərdə ayaq üstə olduğun halda tərk etdilər. De: “Allah yanında qazanacağınız savab əyləncədən də, ticarətdən də xeyirlidir. Allah ən yaxşı ruzi verəndir”."
        },
        "Bengali": {
            "verse 62:1": "রাজ্যাধিপতি, পবিত্র, পরাক্রমশালী ও প্রজ্ঞাময় আল্লাহর পবিত্রতা ঘোষণা করে, যা কিছু আছে নভোমন্ডলে ও যা কিছু আছে ভূমন্ডলে।",
            "verse 62:2": "তিনিই নিরক্ষরদের মধ্য থেকে একজন রসূল প্রেরণ করেছেন, যিনি তাদের কাছে পাঠ করেন তার আয়াতসমূহ, তাদেরকে পবিত্র করেন এবং শিক্ষা দেন কিতাব ও হিকমত। ইতিপূর্বে তারা ছিল ঘোর পথভ্রষ্টতায় লিপ্ত।",
            "verse 62:3": "এই রসূল প্রেরিত হয়েছেন অন্য আরও লোকদের জন্যে, যারা এখনও তাদের সাথে মিলিত হয়নি। তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
            "verse 62:4": "এটা আল্লাহর কৃপা, যাকে ইচ্ছা তিনি তা দান করেন। আল্লাহ মহাকৃপাশীল।",
            "verse 62:5": "যাদেরকে তওরাত দেয়া হয়েছিল, অতঃপর তারা তার অনুসরণ করেনি, তাদের দৃষ্টান্ত সেই গাধা, যে পুস্তক বহন করে, যারা আল্লাহর আয়াতসমূহকে মিথ্যা বলে, তাদের দৃষ্টান্ত কত নিকৃষ্ট। আল্লাহ জালেম সম্প্রদায়কে পথ প্রদর্শন করেন না।",
            "verse 62:6": "বলুন হে ইহুদীগণ, যদি তোমরা দাবী কর যে, তোমরাই আল্লাহর বন্ধু-অন্য কোন মানব নয়, তবে তোমরা মৃত্যু কামনা কর যদি তোমরা সত্যবাদী হও।",
            "verse 62:7": "তারা নিজেদের কৃতকর্মের কারণে কখনও মৃত্যু কামনা করবে না। আল্লাহ জালেমদের সম্পর্কে সম্যক অবগত আছেন।",
            "verse 62:8": "বলুন, তোমরা যে মৃত্যু থেকে পলায়নপর, সেই মৃত্যু অবশ্যই তোমাদের মুখামুখি হবে, অতঃপর তোমরা অদৃশ্য, দৃশ্যের জ্ঞানী আল্লাহর কাছে উপস্থিত হবে। তিনি তোমাদেরকে জানিয়ে দিবেন সেসব কর্ম, যা তোমরা করতে।",
            "verse 62:9": "মুমিনগণ, জুমআর দিনে যখন নামাযের আযান দেয়া হয়, তখন তোমরা আল্লাহর স্মরণের পানে ত্বরা কর এবং বেচাকেনা বন্ধ কর। এটা তোমাদের জন্যে উত্তম যদি তোমরা বুঝ।",
            "verse 62:10": "অতঃপর নামায সমাপ্ত হলে তোমরা পৃথিবীতে ছড়িয়ে পড় এবং আল্লাহর অনুগ্রহ তালাশ কর ও আল্লাহকে অধিক স্মরণ কর, যাতে তোমরা সফলকাম হও।",
            "verse 62:11": "তারা যখন কোন ব্যবসায়ের সুযোগ অথবা ক্রীড়াকৌতুক দেখে তখন আপনাকে দাঁড়ানো অবস্থায় রেখে তারা সেদিকে ছুটে যায়। বলুনঃ আল্লাহর কাছে যা আছে, তা ক্রীড়াকৌতুক ও ব্যবসায় অপেক্ষা উৎকৃষ্ট। আল্লাহ সর্বোত্তম রিযিকদাতা।"
        },
        "Berber Amazigh": {
            "verse 62:1": "Sbuccuâen Öebbi, kra illan deg igenwan, u kra illan di tmurt. Agellid, Ssid, Uzmir, Bab n ûûwab.",
            "verse 62:2": "D Neppa id Iuznen i wid ur ne$ôi, Amazan segsen, iqqaô asen issekniyen iS. Izizdig iten, isselmad asen Tazmamt akked ûûwab, xas llan, zik, di ttelfan n ûûeê.",
            "verse 62:3": "U i wid nniven, mara awven $uôsen. Neppa, d Uzmir, d Bab n ûûwab.",
            "verse 62:4": "D wagi ay d lfevl n Öebbi. Ippak it i win Ib$a. Öebbi, d bab n lfevl ameqwôahan.",
            "verse 62:5": "Am wid iwumi ippukelfen s Tuôa, ur p ssawven. Cuban a$yul ibubben tizmamin. I icmet umedya n ugdud inekôen issekniyen n Öebbi! Öebbi ur Inehhu ara agdud imednas.",
            "verse 62:6": "Ini: \"a yudayen, ma t$ilem d kunwi ay d iêbiben n Öebbi, war imdanen, ssutret tameppant, ma tessawalem tidep\"!",
            "verse 62:7": "Ur p ssuturen ara, d awez$i, ilmend igiten nnsen. Öebbi Issen imednas.",
            "verse 62:8": "Ini: \"tameppant iwumi tregwlem, a kwen id temmager, war ccekk. Sinna, a kwen awin ar Win Iéôan ayen iffren akked wayen ur neffir. Ad awen Imel ayen txeddmem\".",
            "verse 62:9": "A wid iumnen! Ma ssawlen d i téallit, ass unejmuâ, $iwlet ar usmekti n Öebbi, êebset ttjaôa. Ppif akka i kunwi, lemmer tessinem.",
            "verse 62:10": "Mi tfukk téallit, mfaôaqet di tmurt, nadit lfevl n Öebbi, mmektit ed aîas Öebbi, amar a prebêem.",
            "verse 62:11": "Mi walan ssuq, ne$ anecôeê, ad azlen $uôes, a k ooen tbeddev. Ini: \"ayen illan ar Öebbi yif anecôeê akked ssuq. Öebbi Yif akw iôeééaqen\"."
        },
        "Bosnian": {
            "verse 62:1": "Ono što je na nebesima i ono što je na Zemlji hvali Allaha, Vladara, Svetoga, Silnoga, Mudroga!",
            "verse 62:2": "On je neukima poslao Poslanika, jednog između njih, da im ajete Njegove kazuje i da ih očisti i da ih Knjizi i mudrosti nauči, jer su prije bili u očitoj zabludi,",
            "verse 62:3": "i drugima koji im se još nisu priključili – On je Silni i Mudri.",
            "verse 62:4": "To je Allahova milost koju On daje onome kome hoće – a u Allaha je milost velika.",
            "verse 62:5": "Oni kojima je naređeno da prema Tevratu postupaju, pa ne postupaju, slični su magarcu koji knjige nosi. O kako su loši oni koji poriču Allahove ajete! – A Allah neće ukazati na Pravi put narodu koji neće da vjeruje.",
            "verse 62:6": "Reci: \"O Jevreji, ako tvrdite da ste vi od ljudi jedini Allahovi miljenici, onda smrt poželite, ako istinu govorite.\"",
            "verse 62:7": "A zbog onoga što ruke njihove čine neće je nikad poželjeti, Allah dobro zna nevjernike.",
            "verse 62:8": "Reci: \"Smrt od koje bježite zaista će vas stići. Zatim ćete Onome koji poznaje i nevidljivi i vidljivi svijet vraćeni biti i On će vas o onome što ste radili obavijestiti.\"",
            "verse 62:9": "O vjernici, kada se u petak na molitvu pozove, kupoprodaju ostavite i pođite molitvu obaviti; to vam je bolje, neka znate!",
            "verse 62:10": "A kad se molitva obavi, onda se po zemlji raziđite i Allahovu blagodat tražite i Allaha mnogo spominjite, da biste postigli što želite.",
            "verse 62:11": "Ali kad oni kakvu robu trgovačku ili veselje ugledaju, pohrle mu i tebe ostave sama da stojiš. Reci: \"Ono što je u Allaha bolje je i od veselja i od trgovine.\" – A Allah najbolju opskrbu daje."
        },
        "Bulgarian": {
            "verse 62:1": "Всичко на небесата и всичко на земята прославя Аллах - Владетеля, Пресветия, Всемогъщия, Премъдрия.",
            "verse 62:2": "Той е, Който проводи при неграмотните [араби] Пратеник измежду тях да им чете Неговите знамения и да ги пречисти, и да ги учи на Книгата и на мъдростта, а преди бяха в явна заблуда.",
            "verse 62:3": "И при други освен тях, които още не са ги последвали... Той е Всемогъщия, Премъдрия.",
            "verse 62:4": "Това е благодатта на Аллах. Дарява я Той комуто пожелае. Аллах е Владетелят на великата благодат.",
            "verse 62:5": "Онези, които бяха натоварени с Тората, а после не понесоха товара, приличат на магаре, носещо книги. Колко лош е примерът на хората, които взимат за лъжа знаменията на Аллах! Аллах не напътва хората-угнетители.",
            "verse 62:6": "Кажи: “О, юдеи, щом твърдите, че вие сте ближните на Аллах без другите хора, възжелайте смъртта, ако говорите истината!”",
            "verse 62:7": "Ала не ще я възжелаят никога заради онова, което със своите ръце са сторили отпреди. Аллах знае угнетителите.",
            "verse 62:8": "Кажи: “Смъртта, от която бягате, непременно ще ви срещне. После ще бъдете върнати при Знаещия неведомото и явното, и Той ще ви извести какво сте вършили.”",
            "verse 62:9": "О, вярващи, щом се призове за молитвата в петъчния ден, устремете се към споменаването на Аллах и оставете търговията! Това е най-доброто за вас, ако знаете.",
            "verse 62:10": "И щом молитвата завърши, разпръснете се по земята и търсете благодат от Аллах, и често споменавайте Аллах, за да сполучите!",
            "verse 62:11": "И щом видяха търговия или забавление, разотидоха се натам и те оставиха да стоиш. Кажи [о, Мухаммад]: “Това, което е при Аллах, е по-добро от забавлението и от търговията. Аллах е Най-добрият от даряващите препитание.”"
        },
        "Chinese": {
            "verse 62:1": "凡在天地间的，都赞颂真主　　至洁的、万能的、至睿的君主，超绝万物的君主。",
            "verse 62:2": "他在文盲中派遣一个同族的使者，去对他们宣读他的迹象，并培养他们，教授他们天经和智慧，尽管以前他们确是在明显的迷误中；",
            "verse 62:3": "并教化还没有赶上他们的其他人。真主是万能的，是至睿的。",
            "verse 62:4": "这是真主的恩典，他把它赏赐他所欲赏赐的人们，真主是有宏恩的。",
            "verse 62:5": "奉命遵守《讨拉特》而不遵守者，譬如驮经的驴子。否认真主的迹象的民众的譬喻，真恶劣！真主是不引导不义的民众的。",
            "verse 62:6": "你说：信奉犹太教的人们啊！如果你们自称是真主的选民，而排斥众人，那你们就希望早死吧，如果你们是诚实者。",
            "verse 62:7": "他们因为曾经犯过罪，所以永远不希望早死。真主是全知不义者的。",
            "verse 62:8": "你说：你们所逃避的死亡，必定与你们会面，然後你们将被送到全知幽明的主那　里，他将把你们的行为告诉你们。",
            "verse 62:9": "信道的人们啊！当聚礼日召人礼拜的时候，你们应当赶快去记念真主，放下买卖，那对於你们是更好的，如果你们知道。",
            "verse 62:10": "当礼拜完毕的时候，你们当散布在地方上，寻求真主的恩惠，你们应当多多地记念真主，以便你们成功。",
            "verse 62:11": "当他们看见生意或游戏的时候，他们离散了，他们让你独自站著。你说：在真主那里的，比游戏和生意还好，真主是最善的供给者。"
        },
        "Danish": {
            "verse 62:1": "Alles wat zich in de hemelen en op aarde bevindt verheerlijkt Allah, de Koning, de Heilige, de Almachtige, de Alwijze",
            "verse 62:2": "Hij is het Die onder de ongeletterden een boodschapper heeft verwekt die Zijn tekenen onder hen verkondigt en hen zuivert en hun het Boek en de wijsheid onderwijst, ofschoon zij voorheen in openbare dwaling verkeerden",
            "verse 62:3": "En ook anderen die dezen (gelovigen) nog niet hebben ontmoet. Hij is de Almachtige, de Alwijze",
            "verse 62:4": "Dat is Allah`s genade, Hij schenkt haar aan wie Hij wil; en Allah is de Heer van grote genade",
            "verse 62:5": "Degenen die belast zijn met de Torah en deze niet naleven, zijn als een ezel die boeken draagt. Slecht is de staat van het volk dat de tekenen van Allah verwerpt. En Allah leidt het onrechtvaardige volk niet",
            "verse 62:6": "Zeg: O gij Joden als gij denkt dat gij met uitsluiting van andere mensen de vrienden van Allah zijt, wenst dan de dood als gij de waarheid spreekt",
            "verse 62:7": "Maar zij zullen deze nooit wensen vanwege hetgeen hun handen hebben uitgevoerd. En Allah kent de onrechtvaardigen goed",
            "verse 62:8": "Zeg: De dood waarvoor gij vlucht zal u zeker treffen. Dan zult gij tot de Kenner van het onzichtbare en zichtbare teruggebracht worden, en Hij zal u inlichten over hetgeen gij placht te doen",
            "verse 62:9": "O, gij die gelooft! Wanneer op Vrijdag de oproep tot het gebed is uitgezonden, haast u dan Allah gedachtig te zijn en verlaat de handel. Dit is beter voor u indien gij het weet",
            "verse 62:10": "En als het gebed geëindigd is, verspreidt u dan over het land en zoekt naar Allah`s genade, en gedenkt Allah vaak, opdat gij moogt slagen",
            "verse 62:11": "Maar indien zji koopwaar of enig vermaak zien, gaan zij er haastig heen en laten u staan. Zeg: Hetgeen bij Allah is, is beter dan vermaak en handel, en Allah is de beste Onderhouder"
        },
        "Dutch": {
            "verse 62:1": "Wat er in de hemelen en op de aarde is prijst de Glorie van Allah de Heerser, de Heilige, de Almachtige, de Alwijze.",
            "verse 62:2": "Hij is Degene Die bij de ongeletterden een Boodschapper uit hun midden zond, die hun Zijn Verzen voordroeg, en die hen reinigde, en die hun het Boek en de Wijsheid onderwees, terwijl zij daarvoor in duidelijke dwaling verkeerden.",
            "verse 62:3": "En (Allah zond hem) aan anderen onder hen die zich nog niet bij hem hebben gevoegd. En Hij is de Almachtige, de Alwijze.",
            "verse 62:4": "Dat is de gunst van Allah die Hij geeft aan wie Hij wil. En Allah is de Bezitter van de Geweldige Gunst.",
            "verse 62:5": "De gelijkenis van degenen aan wie de Taurât is opgedragen en zich er vervolgens niet aan houden, is als de gelijkenis van een ezel die boeken draagt. Slecht is de gelijkenis van het volk dat de Verzen van Allah loochent. En Allah leidt het onrechtplegende volk niet.",
            "verse 62:6": "Zeg: \"O jullie die Jood zijn, als jullie veronderstelden dat jullie de vrienden van Allah waren, met uitsluiting van de (andere) mensen: wenst dan de dood, als jullie waarachtig zijn!\"",
            "verse 62:7": "Maar zij zullen die nooit wensen wegens dat wat hun handen vooruit hebben gezonden. En Allah is Alwetend over de onrechtplegers.",
            "verse 62:8": "Zeg: \"Voorwaar, de dood die jullie trachten te voorkomen zal jullie zeker vinden, daarna zullen jullie worden teruggevoerd naar de Kenner van het onwaarneembare en het waarneembare en Hij zal jullie dan mededelen wat jullie plachten te doen.\"",
            "verse 62:9": "O jullie die geloven, wanneer jullie tot het vrijdaggebed worden geroepen, haast jullie dan naar het gedenken van Allah en laat de handel achter. Dat is beter voor jullie, als jullie het wisten!",
            "verse 62:10": "En wanneer de shalât is beëindigd, verspreidt jullie dan op de aarde en zoekt de gunst van Allah, en gedenkt Allah veelvuldig. Hopelijk zullen jullie welslagen.",
            "verse 62:11": "En als zij handel of vermaak zien, dan lopen zij daarheen en laten jou staan (in de shalât). Zeg: \"Wat zich bij Allah bevindt is beter dan het vermaak en dan de handel. En Allah is de Beste der Voorzieners.\""
        },
        "English": {
            "verse 62:1": "Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise.",
            "verse 62:2": "It is He who has sent among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom - although they were before in clear error -",
            "verse 62:3": "And [to] others of them who have not yet joined them. And He is the Exalted in Might, the Wise.",
            "verse 62:4": "That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty.",
            "verse 62:5": "The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people.",
            "verse 62:6": "Say, \"O you who are Jews, if you claim that you are allies of Allah, excluding the [other] people, then wish for death, if you should be truthful.\"",
            "verse 62:7": "But they will not wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers.",
            "verse 62:8": "Say, \"Indeed, the death from which you flee - indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.\"",
            "verse 62:9": "O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew.",
            "verse 62:10": "And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah, and remember Allah often that you may succeed.",
            "verse 62:11": "But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\""
        },
        "Filipino": {
            "verse 62:1": "Maging anupaman ang nasa kalangitan at kalupaan ay lumuluwalhati kay Allah, - ang Hari (ng lahat ng bagay), ang Banal, ang Puspos ng Kapangyarihan, ang Tigib ng Karunungan",
            "verse 62:2": "Siya (Allah) ang nagsugo sa mga hindi nakapag-aral ng isang Tagapagbalita (Muhammad) mula sa kanilang lipon, upang kanyang dalitin sa kanila ang Kanyang mga Talata, upang sila ay maging dalisay (sa kawalan ng pananalig at pagsamba sa mga diyus-diyosan) at sila ay mapatnubayan ng Aklat ng Karunungan (ang Qur’an, mga Batas Islamiko, Sunnah-mga salitain ni Propeta Muhammad). Katotohanang sila nang panahong sinauna ay nasa lantad na kamalian",
            "verse 62:3": "At Kanyang isinugo rin siya (si Propeta Muhammad) sa mga iba pang (Muslim) na hindi pa sumasama sa kanila (datapuwa’t sila ay darating) . At Siya ang Pinakamakapangyarihan, ang Pinakamaalam",
            "verse 62:4": "Ito ang Biyaya ni Allah na Kanyang ipinagkakaloob sa sinumang Kanyang maibigan. At si Allah ang Naghahawak ng walang Maliw na Biyaya",
            "verse 62:5": "Ang nakakatulad nila na pinagkatiwalaan ng (mga tungkulin) ng Torah (mga Batas, alalaong baga, ang sumunod sa pag-uutos nito at magsagawa nito), ngunit hindi naglaon ay nabigo sa ganitong mga tungkulin, ay katulad ng asno na nagpapasan ng malaking dalahin 880 ng mga aklat (ngunit walang nauunawaan sa mga ito). Kasamaan ang nakakawangki ng mga tao na nagtatatwa ng Ayat (mga kapahayagan, katibayan, aral, talata, atbp.) ni Allah, at si Allah ay hindi namamatnubay sa Zalimun (mga gumagawa ng kamalian, mapagsamba sa diyus-diyosan, walang pananalig sa Kaisahan ni Allah, sa Kanyang mga Tagapagbalita, sa Kanyang mga Aklat, atbp)",
            "verse 62:6": "Ipagbadya (O Muhammad): “O kayong mga Hudyo! Kung kayo ay nagkukunwari bilang mga kaibigan ni Allah, na nagbubukod sa (lahat) ng sangkatauhan, kung gayon ay magnais kayo ng kamatayan kung kayo ay nagsasabi ng katotohanan.”",
            "verse 62:7": "Datapuwa’t hindi sila magnanais nito (kamatayan), dahilan sa (mga gawa) ng kanilang kamay kung saan sila inihantong noong una! At si Allah ang lubos na nakakabatid sa Zalimun (mga mapaggawa ng kasalanan, mapagsamba sa diyus-diyosan, walang pananalig kay Allah, atbp)",
            "verse 62:8": "Ipagbadya (sa kanila): “Katotohanan, ang kamatayan na inyong tinatakasan ay walang pagsalang daratal sa inyo, at kung magkagayon, kayo ay muling ibabalik (kay Allah), ang Lubos na Nakakaalam ng lahat ng mga nalilingid at nakalantad, at Siya ang magsasabi sa inyo kung ano ang inyong ginawa.”",
            "verse 62:9": "o kayong mga nagsisisampalataya (mga Muslim): Kung ang panawagan sa pagdarasal sa araw ng Biyernes (Al-Jumuah) ay ipinagbadya sa inyo, magmadali na may pagsusumamo sa pag-aala-ala kay Allah (pangaral sa pananampalataya at panalangin), at talikdan ninyo ang kalakal at iba pang bagay, ito ay higit na mainam sa inyo kung inyo lamang nababatid",
            "verse 62:10": "At kung ang pagdarasal (Jumuah) ay natapos na, kayo ay malaya na magsipangalat sa kalupaan at magsihanap ng Kanyang mga Biyaya (sa pamamagitan ng pagtatrabaho), at lagi ninyong alalahanin si Allah upang kayo ay magsipagtagumpay",
            "verse 62:11": "Datapuwa’t kung sila ay nakakakita ng mga paninda na mura at mga paglilibang (tunog ng tambol, atbp.), sila ay dagliang pumupunta roon, at ikaw (o Muhammad) ay iniiwan nila na nakatayo (habang ikaw ay nagpapaala-ala sa pangangaral). Ipahayag: “Higit na mabuti ang nasa kay Allah kaysa sa anumang paglilibang at murang paninda!” At si Allah ang Pinakamahusay sa mga nagkakaloob"
        },
        "French": {
            "verse 62:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifient Allah, le Souverain, le Pur, le Puissant, le Sage.",
            "verse 62:2": "C'est Lui qui a envoyé à des gens sans Livre (les Arabes) un Messager des leurs qui leur récite Ses versets, les purifie et leur enseigne le Livre et la Sagesse, bien qu'ils étaient auparavant dans un égarement évident,",
            "verse 62:3": "ainsi qu'à d'autres parmi ceux qui ne les ont pas encore rejoints. C'est Lui le Puissant, le Sage.",
            "verse 62:4": "Telle est la grâce d'Allah qu'Il donne à qui Il veut. Et Allah est le Détenteur de l'énorme grâce.",
            "verse 62:5": "Ceux qui ont été chargés de la Thora mais qui ne l'ont pas appliquée sont pareils à l'âne qui porte des livres. Quel mauvais exemple que celui de ceux qui traitent de mensonges les versets d'Allah et Allah ne guide pas les gens injustes.",
            "verse 62:6": "Dis: «O vous qui pratiquez le judaïsme! Si vous prétendez être les bien-aimés d'Allah à l'exclusion des autres, souhaitez, donc la mort, si vous êtes véridiques».",
            "verse 62:7": "Or, ils ne la souhaiteront jamais, à cause de ce que leurs mains ont préparé. Allah cependant connaît bien les injustes.",
            "verse 62:8": "Dis: «La mort que vous fuyez va certes vous rencontrer. Ensuite vous serez ramenés à Celui qui connaît parfaitement le monde Invisible et le monde visible et qui vous informera alors de ce que vous faisiez».",
            "verse 62:9": "O vous qui avez cru! Quand on appelle à la Salât du jour du Vendredi, accourez à l'invocation d'Allah et laissez tout négoce. Cela est bien meilleur pour vous, si vous saviez!",
            "verse 62:10": "Puis quand la Salât est achevée, dispersez-vous sur terre et recherchez [quelque effet] de la grâce d'Allah, et invoquez beaucoup Allah afin que vous réussissiez.",
            "verse 62:11": "Quand ils entrevoient quelque commerce ou quelque divertissement, ils s'y dispersent et te laissent debout. Dis: «Ce qui est auprès d'Allah est bien meilleur que le divertissement et le commerce, et Allah est le Meilleur des pourvoyeurs»."
        },
        "Fulah": {
            "verse 62:1": "Kala ko woni ka kammuuli e ka leydi hino seninnde Allah, Laamɗo, Seniiɗo, Fooluɗo, Ñeeño On",
            "verse 62:2": "Ko kanko nuli e humammbinneeɓe ɓen Nulaaɗo jeyaaɗo e maɓɓe, himo janngana ɓe Aayeeje Makko ɗen, o laɓɓina ɓe, o anndina ɓe Deftere nden e Sunna on, hay si tawiino ko adii ɗum, ɓe laatino e majjere ɓanngude",
            "verse 62:3": "(O nuli mo) kadi e woɗɓe goo e maɓɓe, ɓe hawrondiraali e ɓen taho. Ko Kanko woni Fooluɗo, Ñeeño On",
            "verse 62:4": "Ɗum ko ɓural Allah, Himo okka ngal mo O muuyani. Allah ko Jom ɓural mawnngal",
            "verse 62:5": "Misal ronndinaaɓe Tawreeta ɓen refti ɓe golliraali nde, no wa’i wa mbabba ronndii mba defte. Misal yimɓe fennooɓe Aayeeje Alla ɗen bonii. Allah fewnataa yimɓe tooñooɓe ɓen",
            "verse 62:6": "Maaku: \"Ko onon yo Huudiŋkooɓe ! Si on aaƴike wonnde ko on yiɗaaɓe Allah ko wanaa yimɓe heddiiɓe ɓen, haray yelee maayde, si tawii ko on goonguɓe",
            "verse 62:7": "Ɓe yelotaako nde muk, sabu ko juuɗe maɓɓe ɗen ardini kon. Allah ko annduɗo tooñooɓe ɓen",
            "verse 62:8": "Maaku: \"Ndee maayde nde dogoton, pellet, ko nde hawraynde e mon. Refti rutteɗon ka On annduɗo wirniiɗi e feeñuɗi, O humpita on ko gollaynoɗon kon",
            "verse 62:9": "Ko onon yo gomɗimɓe ! Si juulde nden noddinanaama ñalnde Juma, yaccee e jantagol Allah, acciton ngeyngu. Ko ɗum ɓuri moƴƴannde on, si tawno ko on annduɓe",
            "verse 62:10": "Si julde nden gasii, haray saakitee ka leydi, ɗaɓɓon ɓural Allah ngal [woni arsike], janntoron innde Allah ko ɗuuɗi, belajo’o on maloyte",
            "verse 62:11": "Si ɓe yi`ii ngeyngu maa fijindaaru, ɓe hammira ton, ɓe acce hiɗa darii. Maaku: \"Ko ko woni ka Allah kon ɓuri moƴƴude beleeɗe e njulaaku. Ko Allah ɓuri Moƴƴude e arsikooɓe ɓen"
        },
        "German": {
            "verse 62:1": "Allah preist (alles), was in den Himmeln und was auf der Erde ist, (Ihn), den König, den Heiligen, den Allmächtigen und Allweisen.",
            "verse 62:2": "Er ist es, Der unter den Schriftunkundigen einen Gesandten von ihnen hat erstehen lassen, der ihnen Seine Zeichen verliest, sie läutert und sie das Buch und die Weisheit lehrt, obgleich sie sich ja zuvor in deutlichem Irrtum befanden -,",
            "verse 62:3": "und andere vor ihnen, die sich ihnen noch nicht angeschlossen haben. Und Er ist der Allmächtige und Allweise.",
            "verse 62:4": "Das ist Allahs Huld, die Er gewährt, wem Er will. Und Allah besitzt große Huld.",
            "verse 62:5": "Das Gleichnis derjenigen, denen die Tora auferlegt wurde, die sie aber hierauf doch nicht getragen haben, ist das eines Esels, der Bücher trägt. Schlimm ist das Gleichnis der Leute, die Allahs Zeichen für Lüge erklären. Und Allah leitet das ungerechte Volk nicht recht.",
            "verse 62:6": "Sag: O die ihr dem Judentum angehört, wenn ihr behauptet, daß ihr Allahs Schützlinge unter Ausschluß der (anderen) Menschen seid, dann wünscht (euch doch) den Tod, wenn ihr wahrhaftig seid.",
            "verse 62:7": "Aber sie wünschen sich ihn niemals wegen dessen, was ihre Hände vorausgeschickt haben. Und Allah weiß über die Ungerechten Bescheid.",
            "verse 62:8": "Sag: Gewiß, der Tod, vor dem ihr flieht -, gewiß, er wird euch begegnen. Hierauf werdet ihr zu dem Kenner des Verborgenen und des Offenbaren zurückgebracht, und dann wird Er euch kundtun, was ihr zu tun pflegtet.",
            "verse 62:9": "O die ihr glaubt, wenn zum Gebet gerufen wird am Freitag, dann eilt zu Allahs Gedenken und laßt das Kaufgeschäft. Das ist besser für euch, wenn ihr wißt.",
            "verse 62:10": "Wenn das Gebet beendet ist, dann breitet euch im Land aus und trachtet nach etwas von Allahs Huld. Und gedenkt Allahs viel, auf daß es euch wohl ergehen möge!",
            "verse 62:11": "Und wenn sie einen Handel oder eine Zerstreuung sehen, laufen sie dorthin auseinander und lassen dich stehen. Sag: Was bei Allah ist, ist besser als Zerstreuung und als Handel. Und Allah ist der beste Versorger."
        },
        "Hausa": {
            "verse 62:1": "Abin da yake a cikin sammai da abin da yake a cikin kasã sunã tasbĩhi ga Allah, Mamallaki, Mai tsarki' Mabuwãyi, Mai hikima.",
            "verse 62:2": "Shĩ ne wanda Ya aika, a cikin mabiya al'ãdu, wani Manzo daga gare su yanã karanta ãyõyinSa a kansu, kuma yanã tsarkake su, kuma yanã sanar da su littafin da hikimarsa kõ da yake sun kasance daga gabãninsa lalle sunã a cikin ɓata bayyanãnna.",
            "verse 62:3": "Da waɗansu mutãne daga gare su, ba su i da riskuwa da sũ ba, alhãli kuwa shĩ ne Mabuwãyi, Mai hikima.",
            "verse 62:4": "Waccan wata falalar Allah ce Yanã bãyar da ita ga wanda Yake so. Kuma Allah ne Ma'abũcin dukan falala mai girma.",
            "verse 62:5": "Misãlin waɗanda aka ɗõra wa ɗaukar Attaura sa'an nan ba su ɗauke ta ba, kamar misãlin jãki ne Yanã ɗaukar littattafai. Tir da misãlin mutãnen nan da suka ƙaryatã game da ãyõyin Allah! Kuma Allah bã Yã shiryar da mutãnẽ azzãlumai.",
            "verse 62:6": "Ka ce: \"Yã kũ waɗandasuka tũba (Yahũdu)! Idan kun riya cẽwa kũ ne zãɓaɓɓun Allah bã sauran mutanẽ ba, sai ku yi gũrin mutuwa idan kun kasance mãsu gaskiya.\"",
            "verse 62:7": "Kuma bã zã su yi gũrinta ba har abadã sabõda abin da hannãyen su suka gabãtar. Kuma Allah ne masani ga azzãlumai",
            "verse 62:8": "Ka ce \"Lalle mutuwar nan da kuke gudũ daga gareta, to, lalle ita mai haɗuwa da ku ce sa'an nan kuma anã mayar da kũ zuwa ga masanin fake da bayyane, dõmin Ya bãku lãbãri game da abin da kuka kasance kunã aikatãwa.\"",
            "verse 62:9": "Yã kũ waɗanda suka yi ĩmãni! Idan anyi kirã zuwã ga salla a rãnar Jumu'a, sai ku yi aiki zuwa ga ambaton Allah, kuma ku bar ciniki. Wancan ɗinku ne mafi alhẽri a gare ku idan kun kasance kunã sani.",
            "verse 62:10": "Sa'an nan idan an ƙarẽ salla, Sai ku wãtsu a cikin ƙasã kuma ku nẽma daga falalar Allah, kuma ku ambaci sũnan Allah da yawa ɗammãninku, ku sãmi babban rabo.",
            "verse 62:11": "Kuma idan suka ga wani fatauci kõ kuma wani wasan shagala, sai su yi rũgũguwar fita zuwa gare su, kuma su bar ka kanã tsaye. Ka ce: \"Abin da yake a wurin Allah ne mafi alhẽri daga fataucin, alhãli kuwa Allah ne Mafi alhẽrinmãsu arzũtãwa.\""
        },
        "Hindi": {
            "verse 62:1": "जो चीज़ आसमानों में है और जो चीज़ ज़मीन में है (सब) ख़ुदा की तस्बीह करती हैं जो (हक़ीक़ी) बादशाह पाक ज़ात ग़ालिब हिकमत वाला है",
            "verse 62:2": "वही तो जिसने जाहिलों में उन्हीं में का एक रसूल (मोहम्मद) भेजा जो उनके सामने उसकी आयतें पढ़ते और उनको पाक करते और उनको किताब और अक्ल की बातें सिखाते हैं अगरचे इसके पहले तो ये लोग सरीही गुमराही में (पड़े हुए) थे",
            "verse 62:3": "और उनमें से उन लोगों की तरफ़ (भेजा) जो अभी तक उनसे मुलहिक़ नहीं हुए और वह तो ग़ालिब हिकमत वाला है",
            "verse 62:4": "ख़ुदा का फज़ल है जिसको चाहता है अता फरमाता है और ख़ुदा तो बड़े फज़ल (व करम) का मालिक है",
            "verse 62:5": "जिन लोगों (के सरों) पर तौरेत लदवायी गयी है उन्होने उस (के बार) को न उठाया उनकी मिसाल गधे की सी है जिस पर बड़ी बड़ी किताबें लदी हों जिन लोगों ने ख़ुदा की आयतों को झुठलाया उनकी भी क्या बुरी मिसाल है और ख़ुदा ज़ालिम लोगों को मंज़िल मकसूद तक नहीं पहुँचाया करता",
            "verse 62:6": "(ऐ रसूल) तुम कह दो कि ऐ यहूदियों अगर तुम ये ख्याल करते हो कि तुम ही ख़ुदा के दोस्त हो और लोग नहीं तो अगर तुम (अपने दावे में) सच्चे हो तो मौत की तमन्ना करो",
            "verse 62:7": "और ये लोग उन आमाल के सबब जो ये पहले कर चुके हैं कभी उसकी आरज़ू न करेंगे और ख़ुदा तो ज़ालिमों को जानता है",
            "verse 62:8": "(ऐ रसूल) तुम कह दो कि मौत जिससे तुम लोग भागते हो वह तो ज़रूर तुम्हारे सामने आएगी फिर तुम पोशीदा और ज़ाहिर के जानने वाले (ख़ुदा) की तरफ लौटा दिए जाओगे फिर जो कुछ भी तुम करते थे वह तुम्हें बता देगा",
            "verse 62:9": "ऐ ईमानदारों जब जुमा का दिन नमाज़ (जुमा) के लिए अज़ान दी जाए तो ख़ुदा की याद (नमाज़) की तरफ दौड़ पड़ो और (ख़रीद) व फरोख्त छोड़ दो अगर तुम समझते हो तो यही तुम्हारे हक़ में बेहतर है",
            "verse 62:10": "फिर जब नमाज़ हो चुके तो ज़मीन में (जहाँ चाहो) जाओ और ख़ुदा के फज़ल (अपनी रोज़ी) की तलाश करो और ख़ुदा को बहुत याद करते रहो ताकि तुम दिली मुरादें पाओ",
            "verse 62:11": "और (उनकी हालत तो ये है कि) जब ये लोग सौदा बिकता या तमाशा होता देखें तो उसकी तरफ टूट पड़े और तुमको खड़ा हुआ छोड़ दें (ऐ रसूल) तुम कह दो कि जो चीज़ ख़ुदा के यहाँ है वह तमाशे और सौदे से कहीं बेहतर है और ख़ुदा सबसे बेहतर रिज्क़ देने वाला है"
        },
        "Indonesian": {
            "verse 62:1": "Senantiasa bertasbih kepada Allah apa yang ada di langit dan apa yang ada di bumi. Raja, Yang Maha Suci, Yang Maha Perkasa lagi Maha Bijaksana.",
            "verse 62:2": "Dialah yang mengutus kepada kaum yang buta huruf seorang Rasul di antara mereka, yang membacakan ayat-ayat-Nya kepada mereka, mensucikan mereka dan mengajarkan mereka Kitab dan Hikmah (As Sunnah). Dan sesungguhnya mereka sebelumnya benar-benar dalam kesesatan yang nyata,",
            "verse 62:3": "dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
            "verse 62:4": "Demikianlah karunia Allah, diberikan-Nya kepada siapa yang dikehendaki-Nya; dan Allah mempunyai karunia yang besar.",
            "verse 62:5": "Perumpamaan orang-orang yang dipikulkan kepadanya Taurat, kemudian mereka tiada memikulnya adalah seperti keledai yang membawa kitab-kitab yang tebal. Amatlah buruknya perumpamaan kaum yang mendustakan ayat-ayat Allah itu. Dan Allah tiada memberi petunjuk kepada kaum yang zalim.",
            "verse 62:6": "Katakanlah: \"Hai orang-orang yang menganut agama Yahudi, jika kamu mendakwakan bahwa sesungguhnya kamu sajalah kekasih Allah bukan manusia-manusia yang lain, maka harapkanlah kematianmu, jika kamu adalah orang-orang yang benar\".",
            "verse 62:7": "Mereka tiada akan mengharapkan kematian itu selama-lamanya disebabkan kejahatan yang telah mereka perbuat dengan tangan mereka sendiri. Dan Allah Maha Mengetahui akan orang-orang yang zalim.",
            "verse 62:8": "Katakanlah: \"Sesungguhnya kematian yang kamu lari daripadanya, maka sesungguhnya kematian itu akan menemui kamu, kemudian kamu akan dikembalikan kepada (Allah), yang mengetahui yang ghaib dan yang nyata, lalu Dia beritakan kepadamu apa yang telah kamu kerjakan\".",
            "verse 62:9": "Hai orang-orang beriman, apabila diseru untuk menunaikan shalat Jum'at, maka bersegeralah kamu kepada mengingat Allah dan tinggalkanlah jual beli. Yang demikian itu lebih baik bagimu jika kamu mengetahui.",
            "verse 62:10": "Apabila telah ditunaikan shalat, maka bertebaranlah kamu di muka bumi; dan carilah karunia Allah dan ingatlah Allah banyak-banyak supaya kamu beruntung.",
            "verse 62:11": "Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhotbah). Katakanlah: \"Apa yang di sisi Allah lebih baik daripada permainan dan perniagaan\", dan Allah Sebaik-baik Pemberi rezeki."
        },
        "Italian": {
            "verse 62:1": "Glorifica Allah ciò che è nei cieli e sulla terra, il Re, il Santo, l'Eccelso, il Saggio.",
            "verse 62:2": "Egli è Colui Che ha inviato tra gli illetterati un Messaggero della loro gente, che recita i Suoi versetti, li purifica e insegna loro il Libro e la Saggezza, anche se in precedenza erano in errore evidente,",
            "verse 62:3": "e ad altri che ancora non li hanno raggiunti [nella fede]. Egli è l' Eccelso, il Saggio.",
            "verse 62:4": "Questa è la Grazia di Allah, Egli la concede a chi vuole. Allah è il Detentore della Grazia immensa.",
            "verse 62:5": "Coloro cui fu affidata la Torâh e che non la osservarono, assomigliano all'asino che porta i libri. Quanto è detestabile la similitudine di coloro che tacciano di menzogna i segni di Allah: Allah non guida gli ingiusti.",
            "verse 62:6": "Di': “O voi che praticate il giudaismo, se pretendete di essere gli alleati di Allah, ad esclusione degli altri uomini, auguratevi la morte, se siete veritieri”.",
            "verse 62:7": "Giammai se la augureranno, a causa di quel che hanno commesso le loro mani. Allah ben conosce gli empi.",
            "verse 62:8": "Di' [loro, o Muhammad]: “Invero, la morte che fuggite vi verrà incontro, quindi sarete ricondotti a Colui Che conosce l'invisibile e il palese, e vi informerà a proposito di quel che avrete fatto”.",
            "verse 62:9": "O credenti, quando viene fatto l'annuncio per l'orazione del Venerdì, accorrete al ricordo di Allah e lasciate ogni traffico. Ciò è meglio per voi, se lo sapeste.",
            "verse 62:10": "Quando poi l'orazione è conclusa, spargetevi sulla terra in cerca della grazia di Allah, e molto ricordate Allah, affinché possiate avere successo.",
            "verse 62:11": "Quando vedono un commercio o un divertimento, si precipitano e ti lasciano ritto. Di': “Quel che è presso Allah, è migliore del divertimento e del commercio e Allah è il Migliore dei sostentatori”."
        },
        "Japanese": {
            "verse 62:1": "天にあり地にある凡てのものは，アッラーを讃える。（かれは）至高の王者，神聖にして偉力ならびなく英明であられる。",
            "verse 62:2": "かれこそは文盲の者の間に，かれらの中から使徒を遺わし，印を読み聞かせてかれらを清め，啓典と英知を教えられた方である。本当にかれらは，以前は明らかに邪道にあった。",
            "verse 62:3": "まだ来ていない（預盲者以降の）人びとにも教えを授けられる。かれは偉力ならびなく英明であられる。",
            "verse 62:4": "これがアッラーの恩恵である。かれの御心に適う者にこれを与える。アッラーは偉大な恩恵の主であられる。",
            "verse 62:5": "律法（守護）の責任を負わされて，その後それを果たさない者を譬えれば，書物を運ぶロバのようなものである。アッラーの印を嘘であるとする者も同様で，哀れむべきである。本当にアッラーは悪い行いの者を御導きになられない。",
            "verse 62:6": "言ってやるがいい。「ユダヤ教を信奉する者よ，あなたがたがもし外の人びと以上に，アッラーの御気に入りであると言いはり，それがあくまでも真実であると確心するならば（天国に入れるはずだから今すぐ）死を請い願いなさい。」",
            "verse 62:7": "だがかれらは，その手で今まで犯した（行いの）ため，決して死を請い願わないであろう。本当にアッラーは不義を行う者を熟知なされる。",
            "verse 62:8": "言ってやるがいい。「あなたがたが逃れようとする死は，必ずあなたがたを襲うのである。それから幽玄界と現象界を知っておられる御方に送り返され，かれはあなたがたに自分の所業を告げ知らせる。」",
            "verse 62:9": "あなたがた信仰する者よ，合同礼拝の日の礼拝の呼びかけが唱えられたならば，アッラーを念じることに急ぎ，商売から離れなさい。もしあなたがたが分っているならば，それがあなたがたのために最も善い。",
            "verse 62:10": "礼拝が終ったならば，あなたがたは方々に散り，アッラーの恩恵を求めて，アッラーを讃えて多く唱念しなさい。必ずあなたがたは栄えるであろう。",
            "verse 62:11": "しかしかれらは，うまい儲けや遊びごとを見かけると，（礼拝のために）立ち上っているあなたを等閑にして，そちらに駆け出す始末。言ってやるがいい。「アッラーの御許（の恩恵）は，遊戯や取引よりも優る。アッラーは，最善の給与者であられる」。"
        },
        "Jawa": {
            "verse 62:1": "Hisen - hisening langit lan bumi padha nyebut Maha Suci ing Allah, panguasa kang Maha Suci, Kang Maha Mulya tur Wicaksana",
            "verse 62:2": "ALlah iku kang ngutus (Rosul Muhammad) marang wong kang ora bisa maca saka golongane (wong arab banjur dhawuhake ayating Allah marang dheweke, lan ngresikake atine saka mangro tingal, sarta mulang al-Quran kang isi hikmahe Allah, sanadyan sadurunge padha tetela kesasar)",
            "verse 62:3": "Lan nerangake uga marang para ummat liyane kang ora menangi zamane ummat mau. Allah iku Maha Mulya tur Wicaksana",
            "verse 62:4": "Kang mangkono iku sih kanugrahane Allah dadi parenge kersane. Allah iku kagungan kanugrahan agung",
            "verse 62:5": "Sarupane wong kang wis didhawuhi ngistokake Taurat wusana banjur ora gelem (banjur nerusake manut marang nabi Muhamad SAW). Iku upamanane kaya Himar (jalaran cilik bodho) gawa kitab - kitab gedhe. Hala temen sarupane wong kang padha maido ayating Allah, Allah ora kersa paring pituduh bener marang wong kafir",
            "verse 62:6": "(Muhammad) dhawuha, \"Para wong kang nyungkemi agama Yahudi manawa kowe padha ngaku dadi kekasihing Allah dhewe ora ana maneh manungsa liyane, manawa temen mangkono, mara padha nyuwuna mati ing Allah",
            "verse 62:7": "Salawase wong Yahudi mau ora ngarep - arep mati marga rumangsa ngelakoni kafir. Allah nguningani marang wong kang padha kafir",
            "verse 62:8": "(Muhammad) Dhawuha, \"Pati kang bok singkiri iku cepet utawa suwe mesthi keleksanan ing awakmu. Kowe banjur dibalekake marang ngarsane pangeran kang nguningani barang kang samar -samar lan barang kang kasat mata. ing kono Pangeran banjur beberake samu barang kang wis padha kok lakoni",
            "verse 62:9": "Para mukmin! Manawa sira padha diundahng sholat dina jum’at inggal padha mangkata (menyang masjid) eling marang ALlah, ninggal adol-tuku, mangkono uga luwih becik tumrap sira, manawa wis weruh lakonono",
            "verse 62:10": "Manawa sholat jum’at wis rampung padha sumebara ana bumi, golek pangupa jiwa murih oleh rizki peparinge Allah lan akeha eling marang ALlah supaya padha begja",
            "verse 62:11": "Manawa dheweke (wong Islam) padha weruh dagangan lan dolanan banjur padha bubar (anggone sholat jum’at) marani dagangan mau. sira ditinggal ngadek. Dhawuha, \"ganjaran ana ing ngarsane Allah luwih becik tinimbang dolanan lan dagangan. Allah iku becik - beike kang aweh rizki"
        },
        "Kazakh": {
            "verse 62:1": "Аспандардағы және жердегілер барлық нәрсенің шын Билеушісі, өте пәк, бәрінен Үстем, әрі өте Дана Аллаһты барлық кемшіліктен пәк деп дәріптейді",
            "verse 62:2": "Ол сауатсыздарға өздерінің арасынан Елші жіберді. Ол оларға Оның аяттарын оқиды, оларды тазартады және оларға Кітап пен даналықты үйретеді, олар бұрын анық адасуда болса да",
            "verse 62:3": "Әрі оларға әлі қосылмаған басқаларға да. Ол бәрінен Үстем, өте Дана",
            "verse 62:4": "Міне, осы Аллаһтың кеңшілігі, Ол оны Өзі қалағанға береді. Аллаһ ұлы кеңшілік Иесі",
            "verse 62:5": "Өздеріне Тәурат міндеттеліп, кейін оны алып жүрмегендердің орындамағандардың мысалы кітаптар артылған есек сияқты. Аллаһтың аят-белгілерін өтірік санаған адамдардың мысалы қандай жаман! Аллаһ әділетсіз адамдарды тура жолға салмайды",
            "verse 62:6": "Ей, Мұхаммед! Айт: «Ей, иудейлікті ұстанушылар! Егер өздеріңді адамдардың ішінде өзгелерден Аллаһқа жақынбыз деп ойласаңдар өздеріңе өлімді тілеңдерші, егер шын сөзді болсаңдар», деп",
            "verse 62:7": "Олар өз қолдарымен бұрын істегені күнәлары себепті ешқашан оны тілемейді. Аллаһ әділетсіздерді жақсы Білуші",
            "verse 62:8": "Ей, Мұхаммед!! Айт: «Ақиқатында өздерің қашатын өлім, күмәнсіз, сендерге кездеседі. Содан кейін сендер құпия мен айқын нәрсені Білушіге қайтарыласыңдар да, Ол сендерге не істегендеріңнің хабарын береді», деп",
            "verse 62:9": "Ей, иманға келгендер! Қашан жұма күнгі намазға шақырса азан айтылса , Аллаһты еске алуға ұмтылыңдар да сауда-саттықты қойыңдар. Білсеңдер, бұл сендер үшін қайырлы",
            "verse 62:10": "Ал, намаз аяқталғанда, жер бетіне баратын жерлеріңе тарқалыңдар да Аллаһтың кеңшілігін іздеңдер әрі мұраттарыңа жетулерің үшін Аллаһты көп еске алыңдар",
            "verse 62:11": "Олар сауданы не бір бос нәрсені көрген кезде, сол жаққа бет алды да, сені тұрған күйіңде қалдырып кетті. Ей, Мұхаммед! Айт: «Аллаһтағы сый- бос нәрседен де, саудадан да қайырлы. Аллаһ ризық берушілердің ең қайырлысы», деп"
        },
        "Korean": {
            "verse 62:1": "하늘에 있는 것과 대지에 있는 것이, 제왕이시며 성스러우시며 가장 존엄하시고 가장 현명하신 하나님의 완벽함을 찬양하노라하늘과 대지에 있는 모든 것 이 하나님을 찬미하나니 그분은 왕이시요 성스러우시며 위대하시 고 지혜로우시니라",
            "verse 62:2": "문맹들(아랍인)에게 그들 출신의 사도를 보내신 분이 그분이시니, 그(사도)가 그들에게 그분의 징표를 낭송하고 그들을 깨끗이 하며 그들에게 성서와 지혜를 가르치더라. 진실로 그들은 이전에 분명한 방황 속에 있었노라하나님이 그들 백성중 무학자인 무함마드를 한 선지자로 보내 어 그로 하여금 하나님의 말씀을 낭송하고 그들을 청결케 하며 그 성서와 지혜를 가르치도록 하였 나니 실로 이전의 그들은 방황하 고 있었노라",
            "verse 62:3": "(사도는) 아직 그들에게 다다르지 않은, 그들 출신의 다른 이들(에게도 보내진 것이라). 그분께서는 가장 존엄하시고 가장 현명하신 분이라아직 이르지 아니한 그밖의 백성에게도 유익하게 하셨나니 실로 하나님은 권능과 지혜로 충 만하심이라",
            "verse 62:4": "이는 하나님께서 원하시는 자에게 주시는 그분의 은혜라. 하나님께서는 위대한 은혜의 소유자시라그것이 하나님의 은혜라 그분 은 그분이 원하는 자에게 은혜를 베푸시나니 하나님은 위대한 은혜 의 주님이시라",
            "verse 62:5": "토라가 짊어지워진 이후 그것(토라)을 짊어지지 않은 자들의 예는 장서를 짊어지는 당나귀의 예와 같노라. 하나님의 징표를 부인하는 무리의 예는 얼마나 사악한 것인가. 하나님께서는 부당한 무리를 인도하지 않으시노라구약의 율법을 받아 그것을 지키지 아니한 그들을 비유하사 책들을 짊어지고 다니는 당나귀와같다 하였거늘 사악함은 하나님의말씀을 거역한 자들과 같니라 실 로 하나님은 사악한 백성들을 인 도하지 아니 하시니라",
            "verse 62:6": "그대(무함마드)는 말하라 : 유대인들이여! 만약 그대들이 타인을 제외한 그대들만이 하나님의 동료라는 헛된 확신을 가졌다면, 그대들이 진실된 자들이라면, 죽음을 소망해 보라`일러가로되 유대인들이여 너 희가 주장하듯 너희가 다른 백성 위에 하나님의 총애를 받는 자라 면 너희가 진실이라 할 때 죽음 을 기원해 보라",
            "verse 62:7": "그들은 그들 손이 내놓은 것(죄)으로 인하여 결코 그것(죽음)을 소망하지 않을 것이라. 하나님께서는 부당한 자들을 알고 계시노라그러나 그들은 이전에 그들의손들이 저지른 행위로 말미암아 죽음을 기원하지 못하니라 실로 하나님은 사악한 자들을 알고 계 시니라",
            "verse 62:8": "그대(무함마드)는 말하라 : 실로 그대들이 도망치려 하는 죽음, 실로 그것은 그대들을 맞닥뜨릴 것이라. 그런 후 그대들은 보이지 않는 것과 보이는 것을 아시는 분께로 되돌아가게 되니 그분께서 그대들이 행하던 것을 그대들에게 알려주실 것이라`일러가로되 너희가 피하려 한죽음이 실로 너희를 덮치니라 그 때 너희는 보이지 않는 것과 보이는 모든 것을 알고 계시는 분께 보내어지매 그분은 너희에게 너희가 행하였던 모든 사실을 말하여 주시리라",
            "verse 62:9": "믿는 자들이여! 금요일에 예배를 위한 부름이 울릴 때면 어서 하나님을 떠올리는 곳(마스지드)으로 가되 상거래는 그만두라. 그대들이 알고 있다면 그것이 그대들에게 더 좋은 것이라믿는 사람들이여 금요일 예배의 아잔이 들릴 때면 서둘러 하 나님을 염원하고 거래를 중단두라 너희가 알고 있다면 그것이 너희 를 위해 복이 되리라",
            "verse 62:10": "그리하여 예배가 종료되었을 때 그대들은 대지로 흩어져 하나님의 은혜를 간구하라. 그리고 하나님을 많이 떠올리라, 그대들이 성공하게 될 것이라예배가 끝났을 때 대지에 분산하여 하나님의 은혜를 구하고 하나님을 염원하라 그리하면 너 희가 번성하리라",
            "verse 62:11": "그들은 장사나 오락을 보았을 때 그쪽으로 떨어져 나가며 그대(무함마드)를 서 있는 채로 남겨놓았노라. 그대는 말하라 : 하나님께서 가지고 계신 것들이 오락보다 그리고 장사보다 더 좋은 것이라. 하나님께서는 양식을 제공하는 자들 중에서 으뜸이신 분이라`그러나 거래와 어떤 오락을 보면 그대를 두고서 떠나는 자들 이 있나니 일러가로되 하나님의 축복이 어떤 오락이나 거래보다 나은 것이라 하여라 실로 하나님 은 가장 훌륭한 양식의 수여자이 시니라"
        },
        "Kurdish": {
            "verse 62:1": "Tiþte di asîmana û tiþtê di zemîn de Xudayê þehînþahê pak pîrozê serkeftiyê hîkmetdar pak bêrî didêrinهه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه ته‌سبیحات و ستایشی خوا ده‌که‌ن.. ئه‌و خوایه‌ی که پاشایه و شاهی شاهانه‌، پاك و بێگه‌ردو پوخته‌، باڵاده‌ست و دانه‌یه‌..",
            "verse 62:2": "Ew e ê ku di nav nezanan de pêxemberek ji wan rakir-þand ku ayetên wî li ser wan dixweyne û wan pak dike û wan hînê kitêbê û hîkmetê dike; her çend ew berê di þaþiyek xuya de bûnهه‌ر ئه‌و زاته‌یه له‌ناو خه‌ڵکێکی نه‌خوێنده‌واردا پێغه‌مبه‌رێکی له خۆیان ڕه‌وانه کرد، ئایه‌ته‌کانی قورئانه‌که‌ی ئه‌ویان به‌سه‌ردا ده‌خوێنێته‌وه و دڵ و ده‌روون و ڕواڵه‌ت و ئاشکرا و نادیاریان پوخته ده‌کات، فێری قورئان و دانایی و شه‌ریعه‌تیان ده‌کات، به‌ڕاستی ئه‌وانه پێشتر له‌گوامڕایی و سه‌رلێشێواویه‌کی ئاشکرادا گیریان خواردبوو.",
            "verse 62:3": "Ji wan ên dinê re jî ku hê negihîþtine wan. Serkeftiyê hîkmetdar her ew eله‌ئاینده‌دا خه‌ڵکی تریش دێن (موسڵمان ده‌بن له گه‌ل و میلله‌تان) په‌یوه‌ست ده‌بن به‌مانه‌وه‌، بێگومان ئه‌و زاته باڵاده‌ست و دانا و کار دروسته‌.",
            "verse 62:4": "Evê han qenciya Xuda ye, ê bixwaze dide wî. Xuda xwey qenciyek mezin eئه‌وه ڕێزو به‌هره‌یه‌کی خواییه ده‌یبه‌خشێت به‌و که‌سه‌ی که خوا خۆی ئاره‌زووی بکات و شایسته بێت، خوایش خاوه‌نی به‌خشش و به‌هره‌ی گه‌وره و بێسنووره‌.",
            "verse 62:5": "Mînaka ên ku Tewrat li wan hatiye bar kirin paþê wan nikarbû wê hilgirin wek mînaka kerê ku barê kitêba hildigre ye. Mînaka ên ku ayetê Xuda derewandine çi nerind e! Xuda komela sitemkaran nade ser rêya rastوێنه‌ی ئه‌وانه‌ی که ته‌وراتیان درا به‌سه‌ردا تا په‌یڕه‌وی بکه‌ن، پاشان هه‌ڵیان نه‌گرت و په‌یڕه‌ویان نه‌کرد، وه‌ك: گوێدرێژێك وایه که باره کتێبێکی هه‌ڵگرتبێت، ئای که چه‌نده ناشیرینه وێنه‌و نموونه‌ی ئه‌وانه‌ی که ئایه‌ته‌کانی خوایان به‌درۆ زانیووه و بڕوایان پێی نه‌بوو، بێگومان خوا هیدایه‌ت و ڕێنموویی سته‌مکاران ناکات.",
            "verse 62:6": "Tu bêje: \"Gelî ên bûne cihû! eger hûn guman dikin ku hûn bêyî mirovan bera dostê Xuda ne, nexwe hûn eger rastgo ne de ka mirinê bixwazinئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) پێیان بڵێ: ئه‌ی ئه‌وانه‌ی له‌سه‌ر دینی جووله‌که‌ن، ئه‌گه‌ر ئێوه بڕواتان وایه‌، که به‌ڕاستی ئێوه دۆست و لایه‌نگری خوان، جگه له خه‌ڵکی تر، که‌واته داوای مردن بکه‌ن و ئاواتی مه‌رگ بخوازن، (تا له ژیانی پڕ مه‌ینه‌تی دنیا ڕزگارتان ببێت و به به‌هه‌شت و دیداری په‌روه‌ردگار شاد ببن)!",
            "verse 62:7": "Ew, bi sedem tiþtê ku destên wan pêþ xistiye tu car wê naxwazin. Xuda, bi sitemkaran baþ zana yeکه‌چی ئه‌وانه هه‌رگیزاو هه‌رگیز ئاواتی وا ناخوازن و مردن داوا ناکه‌ن، چونکه خۆیان ده‌زانن چیان ده‌ست پێشکه‌ری کردووه‌، خوایش زانایه به کارو کرده‌وه‌ی سته‌مکاران.",
            "verse 62:8": "Tu bêje ku: \"Bêguman mirina ku hûn jê direvin, vêca bêguman ewê rastî we were, paþê hûnê bal (Xudayê) zanayê bi penhan û peyda ve bêne vegerandin vêca wê we bi tiþtê we kiriye haydar bikeپێیان بڵێ ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم): به‌ڕاستی ئه‌و مردنه‌ی که ڕاده‌که‌ن له ده‌ستی هه‌ر یه‌خه‌تان پێ ده‌گرێت، له‌وه‌ودوایش ده‌گه‌رێنرێنه‌وه بۆ لای که‌سێك که زانایه به‌نهێنی و ئاشکرا، ئه‌وسا ئاگادارتان ده‌کات به‌وه‌ی که ده‌تانکرد.",
            "verse 62:9": "Gelî ên bawerî anîne! gava roja înê ji bo limêjê hat gazî kirin, êdî hûn herin bal zikrê (þîretê) Xuda û hûn dev ji danûsitanê berdin. Eger hûn bizanbin evê han ji we re çêtir eئه‌ی ئه‌وانه‌ی باوڕتان هێناوه کاتێ که بانگ درا بۆ نوێژ له ڕۆژی هه‌ینیدا، ئێوه به په‌له بچن به‌ده‌م یادی خواوه و واز له کڕین و فرۆشتن بهێنن، چونکه ئه‌و کاره‌تان چاکتره بۆتان ئه‌گه‌ر بزانن و تێبگه‌ن.",
            "verse 62:10": "Vêca gava limêj hat pêk anîn, êdî hûn li rûyê zemîn belav bibin û ji qenciya Xuda bixwazin-bigerin û pirr Xuda di bîr bînin hêvî heye ku hûn xelas bibinجا کاتێك نوێژ ته‌واو بوو، ئه‌وه بڵاو ببنه‌وه به‌زه‌ویدا و به‌ته‌مای به‌خششی خوا هه‌وڵ و کۆشش بدن، یادی خوا زۆر بکه‌ن له هه‌موو چالاکیه‌کانی ژیاندا با ناوی ئه‌و زاته له‌سه‌ر زارو له‌ناو دڵتاندا بێت، بۆ ئه‌وه‌ی سه‌رفرازیی هه‌میشه‌یی به‌ده‌ست بهێنن.",
            "verse 62:11": "Gava ew danûsitanek yan leystikek bibînin ew belav dibin-diçin balê û te li piya dihêlin . Tu bêje ku: \"Tiþtê li cem Xuda ye ji leystik û danûsitanê çêtir e. Xuda çêtirê rozîdana ye(پاشان خوا گله‌یی له‌زۆربه‌ی ئیمانداران ده‌کات، ئه‌وانه‌ی که قافڵه‌ی بازرگانیان بینی ده‌وری پێغه‌مبه‌ر (صلی الله علیه وسلم) یان چۆڵ کرد:) کاتێك بازرگانیه‌ك، یان یاری و گه‌مه‌یه‌ك ببینن، ئه‌وه ده‌جن به‌ده‌میوه تۆیش به‌جێ دێڵن له‌کاتێکدا تۆ وه‌ستاوی به‌پێوه وتار ده‌خوێنیته‌وه‌، پێیان بڵێ: ئه‌و پاداشت و به‌شه‌ی که‌لای خوایه بۆ ئیمانداران، چاکتره له‌و یاری و گه‌مه و بازرگانیه‌، خوایش چاکترین ڕۆزی به‌خشه به سه‌رجه‌م خه‌ڵکی."
        },
        "Kyrgyz": {
            "verse 62:1": "Аллаһка асмандардагы жана Жердеги бардык нерселер тасбих айтат. Ал — Падыша, Таза-Пакиза, Кудуреттүү жана Даанышман",
            "verse 62:2": "Алуммий адамдар” арасына өздөрүнүн ичинен (тандап алган) пайгамбарды жиберди. Ошол (Пайгамбар) аларга Аллаһтын аяттарын тилават кылат, аларды (ширк жана башка күнөөлөрдөн) тазартат жана Китеп менен Сүннөттү таалим берет. Алар мындан мурда анык адашууда болушкан",
            "verse 62:3": "Жана (Аллаһ ал пайгамбарды) али аларга кошулбаган башка элдерге? да жиберди. Ал — Кудуреттүү, Даанышман",
            "verse 62:4": "Бул Аллаһтын каалаган пенделерине бере турган пазилети. Аллаһ улуу пазилет Ээси",
            "verse 62:5": "Тооратты (колдорунда) көтөргөнү менен, кийин аны(н өкүм-буйруктарын иш жүзүнө аткара) көтөрбөгөн адамдар, үстүнө көп китеп көтөргөн эшек сыяктуу. Аллаһтын аяттарын жалганга чыгарган коомдун тамсили кандай жаман! Аллаһ заалым коомду Туура Жолго баштабайт",
            "verse 62:6": "(О,Мухаммад!) Айткын: «Эй, яхудийлер! Эгер силер «Бардык адамдар эмес, мына биз гана Аллаһтын сүйгөн пенделерибиз» деп ойлосоңор, анда өлүмдү тилегиле, эгер чынчыл болсоңор»",
            "verse 62:7": "(Жок,) алар жасаган (көп күнөө) иштери себептүү эч качан өлүмдү сагынышпайт. Аллаһ заалымдарды Билүүчү",
            "verse 62:8": "Айт: «силер качып (коркуп) жүргөн өлүмгө албетте жолугасыңар. Кийин, көмүскөнү да, көрүнгөндү да Билүүчүгө кайтарыласыңар. Ал силерге жасаган ишиңердин кабарын билдирет",
            "verse 62:9": "О,ыйман келтирген пенделер! Эгер Жума күнү (Жума намазына чакырып) азан айтылчу болсо, тезинен Аллаһты эскерүүгө (мечиттерге) шашылгыла жана сооданы (намаз бүткөнгө чейин) токтоткула. Бул өзүңөр үчүн жакшы, эгер билсеңер",
            "verse 62:10": "Ал эми, намаз бүткөндө Аллаһтын ырыскыларын издеп, жер бетине жайылгыла жана Аллаһты көп эстегиле. (Ошондо) жеңишке (Бейишке) жетээрсиңер",
            "verse 62:11": "Алар (кээ бир мусулмандар) сооданы жана оюн-тамашаны көргөндө ошого чуркап кетишти. Сени болсо, (мечиттин минбарында) турганың бойдон калтырышты. Сен айткын: «Аллаһтын алдындагы сооп соодадан жана оюн-тамашадан жакшы. Аллаһ эң жакшы ырыскы берүүчү"
        },
        "Malay": {
            "verse 62:1": "Segala yang ada di langit dan yang ada di bumi sentiasa mengucap tasbih kepada Allah Yang Menguasai (sekalian alam), Yang Maha Suci, Yang Maha Kuasa, lagi Maha Bijaksana.",
            "verse 62:2": "Dia lah yang telah mengutuskan dalam kalangan orang-orang (Arab) yang Ummiyyin, seorang Rasul (Nabi Muhammad s.a.w) dari bangsa mereka sendiri, yang membacakan kepada mereka ayat-ayat Allah (yang membuktikan keesaan Allah dan kekuasaanNya), dan membersihkan mereka (dari iktiqad yang sesat), serta mengajarkan mereka Kitab Allah (Al-Quran) dan Hikmah (pengetahuan yang mendalam mengenai hukum-hukum syarak). Dan sesungguhnya mereka sebelum (kedatangan Nabi Muhammad) itu adalah dalam kesesatan yang nyata.",
            "verse 62:3": "Dan juga (telah mengutuskan Nabi Muhammad kepada) orang-orang yang lain dari mereka, yang masih belum (datang lagi dan tetap akan datang) menghubungi mereka; dan (ingatlah), Allah jualah Yang Maha Kuasa, lagi Maha Bijaksana.",
            "verse 62:4": "(Pengutusan Nabi Muhammad s.a.w, kepada umat manusia seluruhnya) itu (yang menjadi rahmat) adalah limpah kurnia Allah, diberikanNya kepada sesiapa yang dikehendakiNya; dan sememangnya Allah mempunyai limpah kurnia yang besar.",
            "verse 62:5": "(Sifat-sifat Nabi Muhammad itu telahpun diterangkan dalam Kitab Taurat tetapi orang-orang Yahudi tidak juga mempercayainya, maka) bandingan orang-orang (Yahudi) yang ditanggungjawab dan ditugaskan (mengetahui dan melaksanakan hukum) Kitab Taurat, kemudian mereka tidak menyempurnakan tanggungjawab dan tugas itu, samalah seperti keldai yang memikul bendela Kitab-kitab besar (sedang ia tidak mengetahui kandungannya). Buruk sungguh bandingan kaum yang mendustakan ayat-ayat keterangan Allah; dan (ingatlah), Allah tidak memberi hidayah petunjuk kepada kaum yang zalim.",
            "verse 62:6": "Katakanlah (wahai Muhammad): \"Wahai orang-orang yang berugama Yahudi, kalau kamu anggap bahawa kamulah sahaja orang-orang yang dikasihi Allah tidak termasuk umat-umat manusia yang lain, maka bercita-citalah hendakkan mati (dengan meminta kepada Allah supaya kamu dimatikan sekarang juga), jika betul kamu orang-orang yang benar!\"",
            "verse 62:7": "Dan (sudah tentu) mereka tidak akan bercita-cita hendakkan mati itu selama-lamanya, dengan sebab dosa-dosa yang mereka telah lakukan; dan Allah sentiasa mengetahui akan orang-orang yang zalim itu.",
            "verse 62:8": "Katakanlah (wahai Muhammad): \"Sebenarnya maut yang kamu melarikan diri daripadanya itu, tetaplah ia akan menemui kamu; kemudian kamu akan dikembalikan kepada Allah yang mengetahui segala yang ghaib dan yang nyata, lalu Ia memberitahu kepada kamu apa yang kamu telah lakukan (serta membalasnya)\".",
            "verse 62:9": "Wahai orang-orang yang beriman! Apabila diserukan azan (bang) untuk mengerjakan sembahyang pada hari Jumaat, maka segeralah kamu pergi (ke masjid) untuk mengingati Allah (dengan mengerjakan sembahyang jumaat) dan tinggalkanlah berjual-beli (pada saat itu); yang demikian adalah baik bagi kamu, jika kamu mengetahui (hakikat yang sebenarnya),",
            "verse 62:10": "Kemudian setelah selesai sembahyang, maka bertebaranlah kamu di muka bumi (untuk menjalankan urusan masing-masing), dan carilah apa yang kamu hajati dari limpah kurnia Allah, serta ingatlah akan Allah banyak-banyak (dalam segala keadaan), supaya kamu berjaya (di dunia dan di akhirat).",
            "verse 62:11": "Dan apabila mereka mengetahui kedatangan barang-barang dagangan (yang baharu tiba) atau (mendengar) sesuatu hiburan, mereka bersurai (lalu pergi) kepadanya dengan meninggalkan engkau berdiri (di atas mimbar - berkhutbah). Katakanlah (wahai Muhammad:\" Pahala - balasan) yang ada di sisi Allah, lebih baik dari hiburan dan barang-barang dagangan itu; dan Allah sebaik-baik pemberi rezeki."
        },
        "Malayalam": {
            "verse 62:1": "രാജാവും പരമപരിശുദ്ധനും പ്രതാപശാലിയും യുക്തിമാനുമായ അല്ലാഹുവെ ആകാശങ്ങളിലുള്ളതും ഭൂമിയിലുള്ളതുമെല്ലാം പ്രകീര്‍ത്തിച്ചു കൊണ്ടിരിക്കുന്നു.",
            "verse 62:2": "അക്ഷരജ്ഞാനമില്ലാത്തവര്‍ക്കിടയില്‍, തന്‍റെ ദൃഷ്ടാന്തങ്ങള്‍ അവര്‍ക്ക് വായിച്ചുകേള്‍പിക്കുകയും അവരെ സംസ്കരിക്കുകയും അവര്‍ക്ക് വേദഗ്രന്ഥവും തത്വജ്ഞാനവും പഠിപ്പിക്കുകയും ചെയ്യാന്‍ അവരില്‍ നിന്നുതന്നെയുള്ള ഒരു ദൂതനെ നിയോഗിച്ചവനാകുന്നു അവന്‍. തീര്‍ച്ചയായും അവര്‍ മുമ്പ് വ്യക്തമായ വഴികേടിലായിരുന്നു.",
            "verse 62:3": "അവരില്‍പെട്ട ഇനിയും അവരോടൊപ്പം വന്നുചേര്‍ന്നിട്ടില്ലാത്ത മറ്റുള്ളവരിലേക്കും (അദ്ദേഹത്തെ നിയോഗിച്ചിരിക്കുന്നു.) അവനാകുന്നു പ്രതാപിയും യുക്തിമാനും.",
            "verse 62:4": "അത് അല്ലാഹുവിന്‍റെ അനുഗ്രഹമാകുന്നു. അവന്‍ ഉദ്ദേശിക്കുന്നവര്‍ക്ക് അവന്‍ അത് നല്‍കുന്നു. അല്ലാഹു മഹത്തായ പ്രതിഫലം നല്‍കുന്നവനത്രെ.",
            "verse 62:5": "തൌറാത്ത് സ്വീകരിക്കാന്‍ ചുമതല ഏല്‍പിക്കപ്പെടുകയും, എന്നിട്ട് അത് ഏറ്റെടുക്കാതിരിക്കുകയും ചെയ്തവരുടെ (യഹൂദരുടെ) ഉദാഹരണം ഗ്രന്ഥങ്ങള്‍ ചുമക്കുന്ന കഴുതയുടേത് പോലെയാകുന്നു. അല്ലാഹുവിന്‍റെ ദൃഷ്ടാന്തങ്ങള്‍ നിഷേധിച്ചു കളഞ്ഞ ജനങ്ങളുടെ ഉപമ എത്രയോ ചീത്ത! അക്രമികളായ ജനങ്ങളെ അല്ലാഹു സന്‍മാര്‍ഗത്തിലാക്കുകയില്ല.",
            "verse 62:6": "(നബിയേ,) പറയുക: തീര്‍ച്ചയായും യഹൂദികളായുള്ളവരേ, മറ്റു മനുഷ്യരെ കൂടാതെ നിങ്ങള്‍ മാത്രം അല്ലാഹുവിന്‍റെ മിത്രങ്ങളാണെന്ന് നിങ്ങള്‍ വാദിക്കുകയാണെങ്കില്‍ നിങ്ങള്‍ മരണം കൊതിക്കുക. നിങ്ങള്‍ സത്യവാന്‍മാരാണെങ്കില്‍.",
            "verse 62:7": "എന്നാല്‍ അവരുടെ കൈകള്‍ മുന്‍കൂട്ടി ചെയ്തുവെച്ചതിന്‍റെ ഫലമായി അവര്‍ ഒരിക്കലും അത് കൊതിക്കുകയില്ല. അല്ലാഹു അക്രമകാരികളെപ്പറ്റി അറിവുള്ളവനാകുന്നു.",
            "verse 62:8": "(നബിയേ,) പറയുക: തീര്‍ച്ചയായും ഏതൊരു മരണത്തില്‍ നിന്ന് നിങ്ങള്‍ ഓടി അകലുന്നുവോ അത് തീര്‍ച്ചയായും നിങ്ങളുമായി കണ്ടുമുട്ടുന്നതാണ്‌. പിന്നീട് അദൃശ്യവും, ദൃശ്യവും അറിയുന്നവന്‍റെ അടുക്കലേക്ക് നിങ്ങള്‍ മടക്കപ്പെടുകയും ചെയ്യും. അപ്പോള്‍ നിങ്ങള്‍ പ്രവര്‍ത്തിച്ചുകൊണ്ടിരിക്കുന്നതിനെ പറ്റി അവന്‍ നിങ്ങളെ വിവരമറിയിക്കുന്നതാണ്‌.",
            "verse 62:9": "സത്യവിശ്വാസികളേ, വെള്ളിയാഴ്ച നമസ്കാരത്തിന് വിളിക്കപ്പെട്ടാല്‍ അല്ലാഹുവെ പറ്റിയുള്ള സ്മരണയിലേക്ക് നിങ്ങള്‍ വേഗത്തില്‍ വരികയും, വ്യാപാരം ഒഴിവാക്കുകയും ചെയ്യുക. അതാണ് നിങ്ങള്‍ക്ക് ഉത്തമം; നിങ്ങള്‍ കാര്യം മനസ്സിലാക്കുന്നുവെങ്കില്‍.",
            "verse 62:10": "അങ്ങനെ നമസ്കാരം നിര്‍വഹിക്കപ്പെട്ടു കഴിഞ്ഞാല്‍ നിങ്ങള്‍ ഭൂമിയില്‍ വ്യാപിച്ചു കൊള്ളുകയും, അല്ലാഹുവിന്‍റെ അനുഗ്രഹത്തില്‍ നിന്ന് തേടിക്കൊള്ളുകയും ചെയ്യുക. നിങ്ങള്‍ അല്ലാഹുവെ ധാരാളമായി ഓര്‍ക്കുകയും ചെയ്യുക. നിങ്ങള്‍ വിജയം പ്രാപിച്ചേക്കാം.",
            "verse 62:11": "അവര്‍ ഒരു കച്ചവടമോ വിനോദമോ കണ്ടാല്‍ അവയുടെ അടുത്തേക്ക് പിരിഞ്ഞ് പോകുകയും നിന്നനില്‍പില്‍ നിന്നെ വിട്ടേക്കുകയും ചെയ്യുന്നതാണ്‌. നീ പറയുക: അല്ലാഹുവിന്‍റെ അടുക്കലുള്ളത് വിനോദത്തെക്കാളും കച്ചവടത്തെക്കാളും ഉത്തമമാകുന്നു. അല്ലാഹു ഉപജീവനം നല്‍കുന്നവരില്‍ ഏറ്റവും ഉത്തമനാകുന്നു."
        },
        "Norwegian": {
            "verse 62:1": "Alt som er i himmel og på jord, priser Gud, Kongen, den Hellige, den Mektige, den Vise.",
            "verse 62:2": "Han er det som lot fremstå blant folkene et sendebud fra deres egne rekker, for å fremlese Hans ord for dem, og for å rense dem, og lære dem skriften og visdommen. Men tidligere var de klart på villspor.",
            "verse 62:3": "Og for andre som ennå ikke har sluttet seg til dem. Han er den Mektige, den Vise.",
            "verse 62:4": "Det er en Guds gave. Han gir den til hvem Han vil. Gud er full av godhet!",
            "verse 62:5": "Det er med dem som ble pålagt loven og så ikke kunne bære den, som med et esel som bærer bøker. Det står ille til med folk som fornekter Guds ord! Gud leder ikke urettferdige folk.",
            "verse 62:6": "Si: «Dere som er jøder, om dere påstår at dere er Guds venner fremfor andre mennesker, så ønsk dere da døden, om dere snakker sant!»",
            "verse 62:7": "Men den vil de aldri ønske seg, på grunn av de gjerninger de har sendt i forveien. Gud kjenner de urettferdige.",
            "verse 62:8": "Si: «Sannelig, døden, som dere flykter fra, den vil møte dere! Så føres dere tilbake til Ham, som kjenner det skjulte og det åpenbare, og så vil Han fortelle dere hva dere bedrev.»",
            "verse 62:9": "Dere som tror, når det kalles til samlingsdagens bønn, så skynd dere hen til Guds ihukommelse, og la handel ligge. Dette er et gode for dere, om dere bare visste!",
            "verse 62:10": "Når så bønnen er slutt, så spre dere omkring i landet og søk av Guds gaver. Kom Gud jevnlig i hu, så det må gå dere godt.",
            "verse 62:11": "Men når de får øye på handelsvarer eller adspredelse under bønnen, så løper de dit og lar deg stå. Si: «Det som finnes hos Gud er bedre enn fornøyelser og handel! Gud er den beste forsørger.»"
        },
        "Pashto": {
            "verse 62:1": "د الله لپاره پاكي بیانوي هر هغه څه چې په اسمانونو كې دي او هر هغه څه چې په ځمكه كې دي، (د هغه الله چې) بادشاه دى، ډېر پاك دى، ښه غالب دى، ډېر حكمت والا دى",
            "verse 62:2": "دغه (الله) همغه ذات دى چې امیانو ته يې له همدوى ځنې یو رسول لېږلى دى، چې دوى ته د هغه (الله) ایتونه تلاوت كوي او د دوى تزكیه كوي او دوى ته كتاب او حكمت (سنت) ښیي او بېشكه شان دا دى چې دوى له ده نه مخكې یقینًا په ښكاره ګمراهۍ كې وو",
            "verse 62:3": "او له دوى څخه نورو ته (هم) چې لا تر اوسه دوى هغو (پخوانیو) ته نه دي رسېدلي او هم دى ښه غالب، ډېر حكمت والا دى",
            "verse 62:4": "دغه د الله فضل دى چې دا هغه چا ته وركوي چې يې وغواړي او الله د ډېر لوى فضل والا دى",
            "verse 62:5": "د هغو كسانو حال چې په هغوى باندې تورات وربار كړى شوى و (د تورات مكلف كړى شوي وو)، بیا دوى هغه پورته نه كړ؛ د هغه خره د حال په شان دى چې كتابونه يې په شا كړي وي، د هغو كسانو بد مثال (حال) دى چې د الله د ایتونو تكذیب كوي او الله ظالم قوم ته هدایت نه كوي",
            "verse 62:6": "ته (دوى ته) ووایه: اى هغو كسانو چې یهودیان شوي دي! كه تاسو دا (غلطه) عقیده لرئ چې یقینًا تاسو له نورو خلقو نه غیر د الله دوستان یئ، نو تاسو د مرګ ارزو وكړئ، كه چېرې تاسو رښتيني یئ",
            "verse 62:7": "او دوى به د دغه (مرګ) ارزو هیڅكله هم ونه كړي، په سبب د هغو (كارونو) چې د دوى لاسونو مخكې لېږلي دي۔ او الله په ظالمانو باندې ښه پوه دى",
            "verse 62:8": "ته (دوى ته) ووایه: بېشكه هغه مرګ چې تاسو له هغه نه تښتئ، پس یقینًا هغه له تاسو سره ملاقات كوونكى دى، بیا به تاسو د غیبو او ښكاره و عالم ذات ته بوتلى شئ، نو هغه به تاسو په هغو عملونو خبر كړي چې تاسو به كول",
            "verse 62:9": "اى هغو كسانو چې ایمان يې راوړى دى! كله چې د جمعې د ورځې د لمانځه لپاره اذان وویلى شي، نو تاسو د الله ذكر ته منډې وهئ او اخيستل خرڅول پرېږدئ۔، دا تاسو لپاره ډېر غوره دي كه تاسو پوهېږئ",
            "verse 62:10": "نو كله چې لمونځ ادا كړى شي، نو تاسو په ځمكه كې خواره شئ او د الله له فضل څخه (څه) ولټوئ او تاسو الله ډېر زیات یادوئ، د دې لپاره چې تاسو كامیاب شئ",
            "verse 62:11": "او كله چې دوى تجارت (سوداګري)، یا تماشه ولیدله (نو) دوى هغې ته خواره شول او ته يې ولاړ پرېښودلې۔، ته (دوى ته) ووایه: هغه څه چې له الله سره دي له دغې تماشې نه او له دغې سوداګرۍ نه ډېر غوره دي۔ او الله تر ټولو ښه رزق وركوونكى دى"
        },
        "Persian": {
            "verse 62:1": "خدا را تسبيح مى‌گويند هر چه در آسمانها و هر چه در زمين است، آن فرمانرواى پاك از عيب را، آن پيروزمند حكيم را.",
            "verse 62:2": "اوست خدايى كه به ميان مردمى بى‌كتاب پيامبرى از خودشان مبعوث داشت تا آياتش را بر آنها بخواند و آنها را پاكيزه سازد و كتاب و حكمتشان بياموزد. اگر چه پيش از آن در گمراهى آشكار بودند،",
            "verse 62:3": "و بر گروهى ديگر از ايشان كه هنوز به آنها نپيوسته‌اند. و اوست پيروزمند و حكيم.",
            "verse 62:4": "اين بخشايش خداست كه به هر كه خواهد ارزانيش دارد و خدا را بخشايشى بزرگ است.",
            "verse 62:5": "مثَل كسانى كه تورات به آنها داده شده و بدان عمل نمى‌كنند مثَل آن خر است كه كتابهايى را حمل مى‌كند. بد مثَلى است مثَل مردمى كه آيات خدا را دروغ مى‌شمرده‌اند. و خدا ستمكاران را هدايت نمى‌كند.",
            "verse 62:6": "بگو: اى قوم يهود، هرگاه مى‌پنداريد كه شما دوستان خدا هستيد، نه مردم ديگر، پس تمناى مرگ كنيد اگر راست مى‌گوييد.",
            "verse 62:7": "و آنان به سبب اعمالى كه پيش از اين مرتكب شده‌اند، هرگز تمناى مرگ نخواهند كرد. و خدا به ستمكاران داناست.",
            "verse 62:8": "بگو: آن مرگى كه از آن مى‌گريزيد شما را درخواهد يافت و سپس نزد آن داناى نهان و آشكارا برگردانده مى‌شويد تا به كارهايى كه كرده‌ايد آگاهتان سازد.",
            "verse 62:9": "اى كسانى كه ايمان آورده‌ايد، چون نداى نماز روز جمعه دردهند، به نماز بشتابيد و داد و ستد را رها كنيد. اگر دانا باشيد، اين كار برايتان بهتر است.",
            "verse 62:10": "و چون نماز پايان يافت، در زمين پراكنده شويد و رزق خدا را طلب كنيد و فراوانش ياد كنيد. باشد كه رستگار شويد.",
            "verse 62:11": "و چون تجارتى يا بازيچه‌اى بينند پراكنده مى‌شوند و به جانب آن مى‌روند و تو را همچنان ايستاده رها مى‌كنند. بگو: آنچه در نزد خداست از بازيچه و تجارت بهتر است. و خدا بهترين روزى‌دهندگان است."
        },
        "Polish": {
            "verse 62:1": "Głosi chwałę Boga to, co jest w niebiosach, i to, co jest na ziemi - Króla, Przenajświętszego, Potężnego, Mądrego!",
            "verse 62:2": "To On posłał do ludzi prostych Posłańca wywodzącego się spośród nich, który głosi im Jego znaki, oczyszcza ich i uczy ich Księgi i mądrości;. oni bowiem byli przedtem w błędzie oczywistym.",
            "verse 62:3": "I do innych spośród nich, którzy się jeszcze do nich nie przyłączyli. On jest Potężny, Mądry!",
            "verse 62:4": "To jest łaska Boga! On ją daje temu, komu chce. On jest władcą łaski ogromnej.",
            "verse 62:5": "Ci, którym dano nieść Torę - a oni jej nie ponieśli - są podobni do osła, który niesie księgi. Jakże zły jest przykład tych ludzi, którzy za kłamstwo uznali znaki Boga! A Bóg nie prowadzi drogą prostą ludzi niesprawiedliwych!",
            "verse 62:6": "Powiedz: \"O wy, którzy wyznajecie judaizm! Jeśli twierdzicie, że jesteście bliscy Bogu, z wyłączeniem innych ludzi, to życzcie sobie śmierci, jeśli jesteście prawdomówni!\"",
            "verse 62:7": "Lecz oni nigdy nie będą jej sobie życzyli z powodu tego, co przygotowały pierwej ich ręce. Bóg zna dobrze ludzi niesprawiedliwych.",
            "verse 62:8": "Powiedz: \"Zaprawdę, śmierć, od której uciekacie, z pewnością was spotka! Potem zostaniecie sprowadzeni do Tego, który zna, co skryte i jawne. On obwieści wam to, co czyniliście.\"",
            "verse 62:9": "O wy, którzy wierzycie! Kiedy zostanie ogłoszone wezwanie do modlitwy - w Dniu Zgromadzenia śpieszcie gorliwie wspominać Boga i pozostawcie wszelki handel! To będzie dla was lepsze, o, gdybyście mogli to wiedzieć!",
            "verse 62:10": "A kiedy modlitwa zostanie zakończona, to rozejdźcie się po kraju i poszukujcie łaski Boga, i często wspominajcie Boga! Być może, będziecie szczęśliwi!",
            "verse 62:11": "Lecz kiedy oni dojrzą jakiś handel lub zabawę, to śpieszą na oślep ku nim i pozostawiają ciebie stojącego. Powiedz: \"To, co jest u Boga, jest lepsze od zabawy i handlu! Bóg jest najlepszy z tych, którzy dają zaopatrzenie!\""
        },
        "Portuguese": {
            "verse 62:1": "Tudo quanto existe nos céus e na terra glorifica Deus, o Soberano, o Augusto, o Poderoso, o Prudentíssimo.",
            "verse 62:2": "Ele foi Quem escolheu, entre os iletrados, um Mensageiro da sua estirpe, para ditar-lhes os Seus versículos, consagrá-lose ensinar-lhes o Livro e a sabedoria, porque antes estavam em evidente erro.",
            "verse 62:3": "E ensinar aos outros que o sucederão, porque Ele é o Poderoso, o Prudentíssimo.",
            "verse 62:4": "Tal é a graça de Deus, que a concede a quem Lhe apraz, porque é Agraciante por excelência.",
            "verse 62:5": "O exemplo daqueles que estão encarregados da Tora, e não a observam, é semelhante ao do asno que carrega grandeslivros. Que péssimo é o exemplo daqueles que desmentem os versículos de Deus! Deus não encaminha o povo dos iníquos.",
            "verse 62:6": "Dize-lhes: Ó judeus, se pretendeis ser os favorecidos de Deus, em detrimento dos demais humanos, desejai, então, amorte, se estais certos!",
            "verse 62:7": "Porém, jamais a desejarão, por causa do que cometeram as suas mão; e Deus bem conhece os iníquos!",
            "verse 62:8": "Dize-lhes: Sabei que a morte, da qual fugis, sem dúvida vos surpreenderá; logo retornareis ao Conhecedor do cognoscívele do incognoscível, e Ele vos inteirará de tudo quanto tiverdes feito!",
            "verse 62:9": "Ó fiéis, quando fordes convocados, para a Oração da Sexta-feira, recorrei à recordação de Deus e abandonai os vossosnegócios; isso será preferível, se quereis saber.",
            "verse 62:10": "Porém, uma vez observada a oração, dispersai-vos pela terra e procurai as graças de Deus, e mencionai muito Deus, para que prospereis.",
            "verse 62:11": "Porém, se quando se depararem com o comércio ou com a diversão, se dispersarem, correndo para ele e te deixarem asós, dize-lhes: O que está relacionado com Deus é preferível à diversão e ao comércio, porque Deus é o melhor dosprovedores."
        },
        "Punjabi": {
            "verse 62:1": "ਹਰ ਚੀਜ਼ ਜਿਹੜੀ ਆਕਾਸ਼ਾਂ ਅਤੇ ਧਰਤੀ ਤੇ ਹੈ, ਅੱਲਾਹ ਦੀ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰ ਰਹੀ ਹੈ। ਜਿਹੜਾ ਪਾਤਸ਼ਾਹ ਹੈ, ਪਵਿੱਤਰ ਹੈ, ਸ਼ਕਤੀਸ਼ਾਲੀ ਹੈ ਅਤੇ ਬਿਬੇਕ ਸ਼ੀਲ ਹੈ।",
            "verse 62:2": "ਉਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਅਣਪੜ੍ਹਾਂ ਦੇ ਅੰਦਰ ਇੱਕ ਰਸੂਲ ਉਨ੍ਹਾਂ ਵਿਚੋਂ ਹੀ ਪੈਦਾ ਕੀਤਾ। ਉਹ ਉਨ੍ਹਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੀਆਂ ਆਇਤਾਂ ਪੜ੍ਹ ਕੇ ਸੁਣਾਉਂਦਾ ਹੈ। ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਪਵਿੱਤਰ ਕਰਦਾ ਹੈ। ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਕਿਤਾਬ ਅਤੇ ਸਮਝਦਾਰੀ ਦੀਆਂ ਗੱਲਾਂ ਦੀ ਸਿਖਿਆ ਚਿੰਦਾ ਹੈ। ਅਤੇ ਉਹ ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਪ੍ਰਤੱਖ ਕੁਰਾਹੇ ਪਏ ਹੋਏ ਸਨ।",
            "verse 62:3": "ਅਤੇ ਦੂਜਿਆਂ ਲਈ ਵੀ ਉਨ੍ਹਾਂ ਵਿਚੋਂ ਜਿਹੜੇ ਅਜੇ ਜੇ ਉਨ੍ਹਾਂ ਵਿਚ ਸ਼ਾਮਿਲ ਨਹੀਂ’ ਹੋਏ। ਅਤੇ ਉਹ ਸ਼ਕਤੀਸ਼ਾਲੀ ਅਤੇ ਤਤਵੇਤਾ ਹੈ।",
            "verse 62:4": "ਇਹ ਅੱਲਾਹ ਦੀ ਕਿਰਪਾ ਹੈ ਕਿ ਉਹ ਜਿਸ ਨੂੰ ਚਾਹੁੰਦਾ ਹੈ ਦਿੰਦਾ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਵੱਡੇ ਫਜ਼ਲਾਂ ਦਾ ਮਾਲਕ ਹੈ।",
            "verse 62:5": "ਗਿਆ ਫਿਰ ਉਨ੍ਹਾਂ ਨੇ ਉਨ੍ਹਾਂ ਨੂੰ ਨਾ ਜ਼ੁੱਕਿਆ, ਭਾਵ ਉਸ ਦੀ ਸਿੱਖਿਆ ਨੂੰ ਨਾ ਸਮਝਿਆ। ਉਨ੍ਹਾਂ ਦੀ ਮਿਸਾਲ ਉਸ ਗਧੇ ਵਰਗੀ ਹੈ, ਜਿਨ੍ਹਾਂ ਨੇ ਕਿਤਾਬਾਂ ਦਾ ਭਾਰ ਤਾਂ ਚੁੱਕਿਆ ਹੈ, (ਪਰ) ਅੱਲਾਹ ਦੀਆਂ ਆਇਤਾਂ ਨੂੰ ਝੁਠਲਾਇਆ। ਇਹ ਕਿਹੋ ਜਿਹੀ ਮਾੜੀ ਮਿਸਾਲ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਜ਼ਾਲਿਮ ਲੋਕਾਂ ਨੂੰ ਮਾਰਗ ਦਰਸ਼ਨ ਪ੍ਰਦਾਨ ਨਹੀਂ ਕਰਦਾ।",
            "verse 62:6": "ਆਖੋ ਕਿ ਹੇ ਯਹੂਦੀਓ! ਇਹ ਤੁਹਾਡਾ ਵਹਿਮ ਹੈ ਕਿ ਤੁਸੀਂ ਦੂਜਿਆਂ ਦੀ ਤੁਲਨਾ ਵਿਚ ਅੱਲਾਹ ਦੇ ਪਿਆਰੇ ਹੋ। ਤਾਂ ਤੁਸੀਂ ਜੇਕਰ ਸੱਚੇ ਹੋ ਤਾਂ ਸੰਤ ਦੀ ਕਾਮਨਾ ਕਰੋਂ।",
            "verse 62:7": "ਅਤੇ ਉਹ ਕਦੇ ਮੌਤ ਦੀ ਕਾਮਨਾ ਨਾ ਕਰਨਗੇ। ਉਨ੍ਹਾਂ ਕਰਮਾਂ ਲਈ ਜਿਨ੍ਹਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੇ ਹੱਥ ਅੱਗੇ ਭੇਜ ਚੁੱਕੇ ਹਨ। ਅਤੇ ਅੱਲਾਹ ਜ਼ਾਲਿਮਾਂ ਨੂੰ ਭਲੀ ਭਾਂਤ ਜਾਣਦਾ ਹੈ।",
            "verse 62:8": "ਆਖੋ, ਜਿਸ ਮੌਤ ਤੋਂ ਤੁਸੀਂ ਭਜਦੇ ਹੋ ਉਹ ਤੁਹਾਨੂੰ ਆ ਕੇ ਰਹੇਗੀ। ਫਿਰ ਤੁਸੀਂ ਗੁੱਝੀਆਂ ਅਤੇ ਪ੍ਰਗਟ ਦੇ ਜਾਣਨ ਵਾਲੇ ਦੇ ਕੋਲ ਲੈ ਜਾਏ ਜਾਵੋਗੇ। ਫਿਰ ਉਹ ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਵੇਗਾ ਜਿਹੜਾ ਕੁਝ ਤੁਸੀਂ ਕਰਦੇ ਰਹੇ ਹੋ।",
            "verse 62:9": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਜਦੋਂ ਜੁਮੇ ਦੇ ਦਿਨ ਦੀ ਨਮਾਜ਼ ਲਈ ਪੁਕਾਰੇ ਜਾਵੇਂ, ਤਾਂ ਅੱਲਾਹ ਦੀ ਯਾਦ ਵੱਲ ਚੱਲ ਪਵੋਂ। ਖ਼ਰੀਦਣਾ ਅਤੇ ਵੇਚਨਾ ਛੱਡ ਦੇਵੋ। ਇਹ ਤੁਹਾਡੇ ਲਈ ਬਿਹਤਰ ਹੈ ਜੇਕਰ ਤੂਸੀ’ ਸਮਝੋਂ।",
            "verse 62:10": "ਫਿਰ ਜਦੋਂ ਨਮਾਜ਼ ਪੂਰੀ ਹੋ ਜਾਵੇ, ਤਾਂ ਧਰਤੀ ਤੇ ਫੈਲ ਜਾਵੋ (ਆਪਣਾ ਰਾਹ ਫੜ੍ਹ ਲਵੋ)। ਅੱਲਾਹ ਦੀ ਕਿਰਪਾ ਤਲਾਸ਼ ਕਰੋ। ਅਤੇ ਅੱਲਾਹ ਨੂੰ ਵਧੇਰੇ ਯਾਦ ਕਰੋ। ਤਾਂ ਕਿ ਤੁਸੀਂ ਸਫ਼ਲਤਾ ਪ੍ਰਾਪਤ ਕਰੋ।",
            "verse 62:11": "ਅਤੇ ਜਦੋਂ ਉਹ ਕੋਈ ਵਾਪਾਰ ਜਾਂ ਖੇਲ ਤਮਾਸ਼ਾ ਦੇਖਦੇ ਹਨ, ਤਾਂ ਉਸ ਵੱਲ ਦੌੜ ਪੈਂਦੇ ਹਨ ਅਤੇ ਤੁਹਾਨੂੰ ਖੜ੍ਹੇ-ਖੜੌਤੇ ਛੱਡ ਦਿੰਦੇ ਹਨ। ਆਖੋ, ਕਿ ਜਿਹੜਾ ਅੱਲਾਹ ਦੇ ਕੋਲ ਹੈ, ਉਹ ਖੇਡ ਤਮਾਸ਼ਿਆਂ ਅਤੇ ਵਪਾਰ ਤੌਂ ਬਿਹਤਰ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਸਭ ਤੋਂ ਚੰਗਾ ਰਿਜ਼ਕ ਦੇਣ ਵਾਲਾ ਹੈ।"
        },
        "Roman english": {
            "verse 62:1": "Yusabbihu lilaahi maa fis samaawaati wa maa fil ardil Malikil Quddoosil `Azeezil Hakeem",
            "verse 62:2": "Huwal lazee ba`asa fil ummiyyeena Rasoolam min hum yatloo `alaihim aayaatihee wa yuzakkeehim wa yu`allimuhumul Kitaaba wal Hikmata wa in kaano min qablu lafee dalaalim mubeen",
            "verse 62:3": "Wa aakhareena minhum lammaa yalhaqoo bihim wa huwal `azeezul hakeem",
            "verse 62:4": "Zaalika fadlul laahi yu`teehi many-yashaaa; wallaahu zul fadil `azeem",
            "verse 62:5": "Masalul lazeena hum milut tawraata summa lam yahmiloonhaa kamasalil himaari yah milu asfaaraa; bi`sa masalul qawmil lazeena kaazzaboo bi aayaatil laah; wallaahu laa yahdil qawmazzaalimeen",
            "verse 62:6": "Qul yaaa ayyuhal lazeena haadoo in za`amtum annakum awliyaaa`u lilaahi min doonin naasi fatamannawul mawta in kuntum saadiqeen",
            "verse 62:7": "Wa laa yatamannaw nahooo abadam bimaa qaddamat aydeehim; wallaahu `aleemum bix zaalimeen",
            "verse 62:8": "Qul innal mawtal lazee tafirroona minhu fa innahoo mulaaqeekum summa turaddoona ilaa `Aalimil Ghaibi wash shahaadati fa yunabbi`ukum bimaa kuntum ta`maloon",
            "verse 62:9": "Yaaa ayyuhal lazeena aamanoo izaa noodiya lis-Salaati miny yawmil Jumu`ati fas`aw ilaa zikril laahi wa zarul bai`; zaalikum khayrul lakum in kuntum ta`lamoon",
            "verse 62:10": "Fa-izaa qudiyatis Salaatu fantashiroo fil ardi wabtaghoo min fadlil laahi wazkurul laaha kaseeral la`allakum tuflihoon",
            "verse 62:11": "Wa izaa ra`aw tijaaratan aw lahwanin faddooo ilaihaa wa tarakooka qaaa`imaa; qul maa `indal laahi khairum minal lahwi wa minat tijaarah; wallaahu khayrur raaziqeen"
        },
        "Russian": {
            "verse 62:1": "Все в небесах и на земле Хвалу и славу воздает Аллаху - (Верховному) Царю, Святому, Мудрейшему и Мощному (над всем)!",
            "verse 62:2": "Он средь невежд избрал посланника для них, Кто им Его знамения толкует, Чтобы очистить их и обучить Священному Письму и мудрости (Господней), - (Хотя еще совсем недавно) Они, поистине, (в земных) грехах блуждали.",
            "verse 62:3": "А равно и для тех, Кто к ним пока не примыкает. Ведь Он могущества и мудрости исполнен!",
            "verse 62:4": "Вот такова Господня милость, И Он дарует ее всем, кому сочтет. Ведь Он - Владыка милости великой.",
            "verse 62:5": "Ослу, что тащит груз тяжелых книг, (Но смысл того, что в них, не понимает), Подобны те, кому было доверено нести (Святую) Тору, - Они ж пренебрегли ее Заветом. И мерзости подобны те, Которые сочли за ложь знамения Аллаха. Неправедных не поведет Аллах по верному пути.",
            "verse 62:6": "Скажи: \"О вы, кто предались иудаизму! Коль вы считаете, что вы близки к Аллаху, Как избранные из других людей, Так пожелайте себе скорой смерти, (Которая приблизит вас к Нему), Если правдивы вы (в своих словах)\".",
            "verse 62:7": "Но никогда они ее не пожелают Из-за тех дел, что предварили им Их собственные руки, - Аллах ведь знает тех, кто зло творит.",
            "verse 62:8": "Скажи: \"Смерть, от которой вы бежите, (Со временем) настигнет вас, И вас вернут к Тому, Кто знает Все, что сокрыто и что явно; И обо всем, что совершили вы, Он вам напомнит (в этот День).",
            "verse 62:9": "О вы, кто верует! Когда вас позовут к молитве дня собранья, Спешите к поминанию Аллаха. Оставьте все торговые дела, - Для вас так будет лучше. О, если бы вы только знали!",
            "verse 62:10": "Когда ж молитва завершится, Вы в поисках даров Господних Идите по земле, куда угодно вам, И часто славьте имя Бога, - Чтобы могли успех вы обрести и радость в жизни\". (Совету ж твоему не следуют они).",
            "verse 62:11": "Едва увидев торг иль легкую забаву, Они тотчас бросаются туда, Тебя оставив (проповедь читать), стоящим одиноко. Скажи: \"То, что Аллахом уготовано для вас, Дороже всех забав и тОргов. И лучше всех Он Свой удел распределяет!"
        },
        "Sindhi": {
            "verse 62:1": "جيڪي آسمانن ۾ آھي ۽ جيڪي زمين ۾ آھي سو (سڀ) الله جي پاڪائي بيان ڪندو آھي (جو) بادشاھ تمام پاڪ (ذات) غالب حڪمت وارو آھي.",
            "verse 62:2": "(الله) اُھو آھي جنھن اڻ پڙھيلن ۾ انھن (جي قوم) مان ھڪ پيغمبر پيدا ڪيو جو وٽن سندس آيتون پڙھندو آھي ۽ کين پاڪ ڪندو آھي ۽ کين ڪتاب ۽ دانائي سيکاريندو آھي، ۽ بيشڪ اِھي (ھن کان) اڳ پڌري گمراھي ۾ ھوا.",
            "verse 62:3": "۽ انھن مان ٻـين لاءِ به جي اڃا انھن (مسلمانن) سان نه مليا آھن، ۽ اُھو غالب حڪمت وارو آھي.",
            "verse 62:4": "اِھو الله جو فضل آھي انھن کي ڏيندو آھي جنھن کي وڻندو اٿس، ۽ الله وڏي فضل وارو آھي.",
            "verse 62:5": "جن (ماڻھن) کي توريت کڻايو ويو پوءِ اُھو نه کنيائون تن جو مثال (انھيءَ) گڏھ جي مثال وانگر آھي جو (گھڻا) ڪتاب کڻي، جن الله جي آيتن کي ڪوڙ ٿي ڀانيو تنھن قوم جو مثال بڇڙو آھي، ۽ الله ظالم ماڻھن کي سڌو رستو نه ڏيکاريندو آھي.",
            "verse 62:6": "(اي پيغمبر) چؤ ته اي يھوديو جيڪڏھن ڀائيندا آھيو ته ٻـين (سڀني) ماڻھن کانسواءِ رڳو اوھين الله جا دوست آھيو ته جيڪڏھن (انھي ڳالھ ۾) سچا آھيو ته موت گھرو.",
            "verse 62:7": "۽ جيڪي سندن ھٿن اڳي موڪليو آھي تنھنجي ڪري اُھو ڪڏھن نه گھرندا، ۽ الله ظالمن کي ڄاڻندڙ آھي.",
            "verse 62:8": "(اي پيغمبر) چؤ ته بيشڪ اُھو موت جنھن کان ڀڄندا آھيو سو ته ضرور اوھان کي پھچڻ وارو آھي وري (اوھين) ڳجھ ڄاڻندڙ ڏانھن موٽايا ويندؤ پوءِ جيڪي (اوھين دُنيا ۾) ڪندا ھئو تنھن جي اوھان کي سُڌ ڏيندو.",
            "verse 62:9": "اي ايمان وارؤ جڏھن جُمعي جي ڏينھن نماز لاءِ بانگ ڏني وڃي تڏھن الله جي ياد ڪرڻ ڏانھن ڊُڙو ۽ واپار ڇڏيو، جيڪڏھن ڄاڻندا آھيو ته اھو اوھان لاءِ ڀلو آھي.",
            "verse 62:10": "پوءِ جڏھن نماز پوري ڪئي وڃي ته زمين تي کنڊري وڃو ۽ الله جي فضل جي طلب ڪريو ۽ الله کي گھڻو ياد ڪريو ته مانَ اوھين ڇٽو.",
            "verse 62:11": "۽ (اُھي مسلمان) جڏھن ڪو سودو (ھلندو) يا ڪو تماشو ڏسن ٿا (ته) اُن ڏانھن کنڊري وڃن ٿا ۽ توکي (خطبي ۾) بيٺل ڇڏين ٿا، (انھن کي) چؤ ته جيڪي الله وٽ آھي سو تماشي ۽ واپار کان (وڌيڪ) ڀَلو آھي، ۽ الله (سڀني) روزي ڏيندڙن کان ڀَلو آھي."
        },
        "Sinhalese": {
            "verse 62:1": "අහස්හි ඇති දෑ හා මහපොළොවෙහි ඇති දෑ අල්ලාහ්ට සුවිශුද්ධ කරයි. (ඔහු) රජුය. පාරිශුද්ධය. සර්ව බලධාරීය. මහා ප්‍රඥාවන්තය.",
            "verse 62:2": "ඔහු වනාහි ලිවීමට හෝ කියවීමට නොහැකි අය අතරට ඔහුගේ වදන් ඔවුනට පාරායනය කර පෙන්වන, තවද ඔවුන් පිවිතුරු කරන, එමෙන්ම ධර්ම ග්‍රන්ථය හා ප්‍රඥාව උගන්වන ධර්ම දූතයකු එවීය. මීට පෙර ඔවුහු පැහැදිලි මුළාවක සිටියෝ ය.",
            "verse 62:3": "තවද ඔවුන් සමග මෙතෙක් එකතු නොවූ, ඔවුන් අතර වන පසුගාමීන් අතරට ද (එවීය.) තවද ඔහු සර්ව බලධාරීය; මහා ප්‍රඥාවන්තය.",
            "verse 62:4": "එය අල්ලාහ්ගේ භාග්යයකි. ඔහු අභිමත කරන අයට එය පිරිනමයි. තවද අල්ලාහ් අතිමහත් වූ භාග්යය සම්පන්නය.",
            "verse 62:5": "තව්රාතය උසුලන්නට සලස්වනු ලැබ, පසු ව එය නොඉසිලූ අයට උපමාව පොත් පොදියක් උසුලන බූරුවාගේ උපමාව වැනිය. අල්ලාහ්ගේ වදන් බොරු කළ ජනයාගේ උපමා ව නපුරු විය. තවද අල්ලාහ් අපරාධකාරී ජනයාට මග පෙන්වන්නේ නැත.",
            "verse 62:6": "“අහෝ යුදෙව් වූවනි! සෙසු ජනයාට වඩා නියත වශයෙන්ම නුඹලා අල්ලාහ්ගේ සුමිතුරන් යැයි තරයේ විශ්වාස කළෙහු නම් එසේම නුඹලා සත්‍යවාදීන් ලෙස සිටියෙහු නම් නුඹලා මරණයට ආශා කරනු” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 62:7": "ඔවුන්ගේ අත් ඉදිරිපත් කළ දෑ හේතුවෙන් ඔවුහු එය (මරණය) කිසිවිටෙක ආශා නොකරති. තවද අල්ලාහ් අපරාධකරුවන් පිළිබඳ ව සර්ව ඥානීය.",
            "verse 62:8": "“නියත වශයෙන්ම නුඹලා එයින් පලා යන මරණය වනාහි සැබැවින්ම එය නුඹලා ව හමුවනු ඇත. පසු ව අදෘශ්‍ය දෑ හා දෘශ්යමාන දෑ පිළිබඳ සර්වඥයාණන් වෙත නුඹලා නැවත යොමු කරනු ලබන්නෙහුය. එවිට නුඹලා සිදු කරමින් සිටි දෑ පිළිබඳ ව ඔහු නුඹලාට දන්වනු ඇත.",
            "verse 62:9": "අහෝ දේවත්වය විශ්වාස කළවුනි! ජුමුආ (සිකුරාදා) දින සලාතය සඳහා ඇරයුම් කරනු ලැබූ විට අල්ලාහ් මෙනෙහි කිරීම සඳහා යුහුසුලු ව යනු. තවද ව්‍යාපාරය නුඹලා අත හැර දමනු. නුඹලා දැන සිටියෙහු නම් එය නුඹලාට යහපත්ය.",
            "verse 62:10": "සලාතය ඉටු කිරීම අවසන් කරනු ලැබූ විට නුඹලා මහපොළොවේ විසිර ගොස් අල්ලාහ්ගේ භාග්යය සොයනු. තවද නුඹලා ජය ලැබිය හැකි වනු පිණිස අල්ලාහ් ව අධික ලෙස මෙනෙහි කරනු.",
            "verse 62:11": "එහෙත්, ඔවුහු යම් වෙළඳාමක් හෝ යම් විනෝදයක් දුටු විට, නුඹ ව සිටගත් තත්ත්වයේම අත හැර දමා ඒ වෙත ඔවුහු යති. අල්ලාහ් අබියස ඇති දෑ විනෝදයට හා වෙළඳාමට වඩා ශ්‍රේෂ්ඨය. තවද අල්ලාහ් පෝෂකයින්ගෙන් වඩාත් ශ්‍රේෂ්ඨය."
        },
        "Somali": {
            "verse 62:1": "Waxaa Eebe nasihi (weynayn) waxa samooyinka iyo Dhulka ku sugan, Ilaahay waa xaakin Xumaan ka daahirane ah aadkade falsame ah.",
            "verse 62:2": "Eebe waa kan u soo bixiyey kuwaan wax aqoon Rasuul ka mid ah oo ku akhriya korkooda Aayaadkiisa «quraankana» bara iyo Sunnada (Nabiga) waxayna horey u ahaayeen kuwo haadi cad ku sugan.",
            "verse 62:3": "(Waxaa kale oo Eebe Nabigu u diray) kuwo kale oon weli la kulmin kuwaas, Eebena waa Adkaade falsame ah.",
            "verse 62:4": "Arrintaasuna (Islaamka iyo Nabiga la soo diray) waa deeq Ilaah, wuxuuna siin ruuxuu doono Eebana waa deeq iyo fadli weyne.",
            "verse 62:5": "Kuwii la faray inay Kitaabka Tawreed (ilaaliyaan) kuna Camal falaan (qaa Yuhuudda) haddana an ku camal falin, waxay la mid yihiin Dameerxambaarsan Kutub badan, waxaana xun masalka kuwaas beeniyey Aayadaha Eebe, Ilaahayna ma hanuuniyo kuwo daalimiin ah.",
            "verse 62:6": "Waxaad dhahdaa (Nabiga) kuwa Yuhuuda ahow haddaad sheegateen inaad tihiin Awliyo Eebe dadka kale ka sokow, geeri jeelaada haddaad run sheegaysaan.",
            "verse 62:7": "Geerina ma jeelaanayaan weligood waxay hormarsadeen (oo gaf ah) dartiis, Eebana waa ogyahay kuwa daalimiinta ah.",
            "verse 62:8": "Waxaad ku dhahdaa geerida aad ka cararaysaan way idinla kulmi, markaasaa laydiin eelin Ilaah og waxa maqan iyo wax joogaba, markaasuu idinka warrami (idinka jaasin) waxaad camal falayseen.",
            "verse 62:9": "Kuwa xaqa rumeeyow marka laysugu yeedho Salaadda Maalinta Jimcaha ah aada xusidda Eebe, wax gadashadana ka taga, saasa idiin khayr roon haddaad tihiin kuwo wax og.",
            "verse 62:10": "Markase Salaadda la dhammeeyo Dhulka ku kala faafa, dalbana (doona) khayrka Eebe, Ilaahayna xusa in badan waxaad u dhawdihiin inaad liibaantaan.",
            "verse 62:11": "Markay arkaan tijaaro (Ganacsi) ama Ciyaar (wax lagu shuqloomo) way aadaan, waxayna kaa tagaan Nabiyow adoo taagan (Khudbo akhrin) waxaad dhahdaa waxa Eebe agtiisa ah yaa ka khayr badan Ciyaar iyo Ganacsiba, Ilaahay waa kan ugu khayr badan inta wax arsaaqda."
        },
        "Spanish": {
            "verse 62:1": "Todo lo que hay en el cielo y en la tierra glorifica a Allah, el Rey, el Purísimo, el Poderoso, el Sabio.",
            "verse 62:2": "Él es Quien ha hecho surgir para los iletrados un Mensajero que es uno de ellos; y que les recita Sus signos, los purifica y les enseña el Libro y la sabiduría, cuando antes estaban en un claro extravío.",
            "verse 62:3": "Y para otros que aún no han venido.Él es el Poderoso, el Sabio.",
            "verse 62:4": "Ese es el favor de Allah que Él da a quien quiere.Allah es Dueño del Favor inmenso.",
            "verse 62:5": "Aquellos a quienes les fue encomendada la Torá y no actuaron conforme a ella, se parecen a un asno que lleva una carga de libros. Qué mala es la semejanza de la gente que negó los signos de Allah.Allah no guía a la gente injusta.",
            "verse 62:6": "Di: Vosotros que practicáis el judaísmo! Si pretendéis que sois los amigos exclusivos de Allah frente al resto de los hombres, pedid la muerte si es verdad lo que decís.",
            "verse 62:7": "Pero jamás la desearán por lo que muestran sus manos.Allah conoce a los injustos.",
            "verse 62:8": "Di: Tened por seguro que la muerte, de la que huís, os encontrará y luego regresaréis al Conocedor del No-Visto y de lo Aparente que os hará saber lo que hayáis hecho.",
            "verse 62:9": "Vosotros que creéis! Cuando se llame a la oración del Viernes, acudid con prontitud al recuerdo de Allah y dejad toda compraventa; eso es mejor para vosotros si sabéis.",
            "verse 62:10": "Pero una vez concluida la Oración, id y repartíos por la tierra y buscad el favor de Allah. Y recordad mucho a Allah para que podáis tener éxito.",
            "verse 62:11": "Y cuando ven un negocio o alguna distracción corren hacia ello y te dejan plantado. Di: Lo que hay junto a Allah es mejor que la diversión y el negocio.Y Allah es el mejor de los que proveen."
        },
        "Swahili": {
            "verse 62:1": "Viliomo mbinguni na viliomo katika ardhi vinamtakasa Mwenyezi Mungu, Mfalme, Mtakatifu, Mwenye nguvu, Mwenye hikima.",
            "verse 62:2": "Yeye ndiye aliye mpeleka Mtume kwenye watu wasio jua kusoma, awasomee Aya zake na awatakase, na awafunze Kitabu na hikima, ijapo kuwa kabla ya haya walikuwa katika upotofu ulio dhaahiri.",
            "verse 62:3": "Na kwa wengine ambao bado hawajaungana nao. Na Yeye ndiye Mwenye nguvu, Mwenye hikima.",
            "verse 62:4": "Hiyo ni fadhila ya Mwenyezi Mungu anayo mpa amtakaye. Na Mwenyezi Mungu ni Mwenye fadhila kubwa.",
            "verse 62:5": "Mfano wa walio bebeshwa Taurati kisha wasiibebe, ni mfano wa punda anaye beba vitabu vikubwa vikubwa. Mfano muovu mno wa watu walio kadhibisha Ishara za Mwenyezi Mungu, na Mwenyezi Mungu hawaongoi watu madhaalimu.",
            "verse 62:6": "Sema: Enyi mlio Mayahudi! Ikiwa nyinyi mnadai kuwa ni vipenzi vya Mwenyezi Mungu pasipo kuwa watu wengine, basi yatamanini mauti, ikiwa mnasema kweli.",
            "verse 62:7": "Wala hawatayatamani kabisa, kwa sababu ya iliyo kwisha yatanguliza mikono yao. Na Mwenyezi Mungu anawajua walio dhulumu.",
            "verse 62:8": "Sema: Hayo mauti mnayo yakimbia, bila ya shaka yatakukuteni. Kisha mtarudishwa kwa Mwenye kuyajua yaliyo fichikana na yanayo onekana. Hapo atakwambieni mliyo kuwa mkiyatenda.",
            "verse 62:9": "Enyi mlio amini! Ikiadhiniwa Sala siku ya Ijumaa, nendeni upesi kwenye dhikri ya Mwenyezi Mungu, na wacheni biashara. Hayo ni bora kwenu, lau kama mnajua.",
            "verse 62:10": "Na itakapo kwisha Sala, tawanyikeni katika nchi mtafute fadhila za Mwenyezi Mungu, na mkumbukeni Mwenyezi Mungu kwa wingi ili mpate kufanikiwa.",
            "verse 62:11": "Na wanapo iona biashara au pumbao wanayakimbilia hayo na wakakuacha umesimama. Sema: Yaliyoko kwa Mwenyezi Mungu ni bora kuliko pumbao na biashara. Na Mwenyezi Mungu ni Mbora wa watoa riziki."
        },
        "Swedish": {
            "verse 62:1": "ALLT det som himlarna rymmer och det som jorden bär prisar Gud, Konungen, den Helige, den Allsmäktige, den Vise.",
            "verse 62:2": "Det är Han som har sänt ett Sändebud till de olärda ur deras egna led för att framföra Hans budskap till dem och [lära] dem renhet och undervisa dem i Skriften och [profeternas] visdom - de hade förut helt uppenbart gått vilse -",
            "verse 62:3": "och till andra [folk], som ännu inte kommit i beröring med dem - Han är den Allsmäktige, den Vise.",
            "verse 62:4": "Sådan är Guds nåd, och Han skänker den till den Han vill. Guds nåd är en outsinlig källa.",
            "verse 62:5": "DE som anförtroddes Tora och som därefter inte förmådde bära denna [börda], kan liknas vid åsnan som bär en last av heliga böcker. Ett folk som påstår att Guds budskap är lögn visar upp sin mest motbjudande sida; Gud vägleder inte dem som oupphörligt begår orätt.",
            "verse 62:6": "Säg: \"Ni, bekännare av den judiska tron! Om ni som ni påstår är Guds enda vänner bland människorna, borde ni önska er döden - om ni talar sanning!\"",
            "verse 62:7": "Men de kommer aldrig att önska sig döden på grund av det som deras händer har sänt före dem [till Domen]; och Gud känner de orättfärdiga.",
            "verse 62:8": "Säg: \"Döden, som ni vill fly från, skall infinna sig till det möte [som är utsatt] för er och då skall ni föras åter till Honom som känner allt det som är dolt för människor och det som de kan bevittna, och då skall Han låta er veta vad era handlingar [var värda].\"",
            "verse 62:9": "TROENDE! När böneutroparen kallar till fredagsbönen, lämna då handel och köpenskap och skynda er dit där Guds namn åkallas; detta är för er det bästa - om ni [bara] visste!",
            "verse 62:10": "Och när bönen är slut skall var och en gå tillbaka till sitt för att söka det som Gud i Sin godhet [beviljar honom]. Och ha alltid Gud i tankarna, för att det skall gå er väl i händer.",
            "verse 62:11": "[Men om] människorna blir varse [ett tillfälle att göra] en vinst eller [att få en stunds] förlustelse, bryter de upp [från bönen] och lämnar dig [Muhammad] stående [i predikstolen]. [Varna dem och] säg: \"Det som [väntar er] hos Gud är bättre än ytlig förströelse eller [ett tillfälle att göra] en vinst; ingen sörjer bättre [för de sina] än Gud!\""
        },
        "Tajik": {
            "verse 62:1": "Худоро тасбеҳ гуянд ҳар чӣ дар осмонҳову ҳар чӣ дар замин аст, он фармонравои пок аз айбро, он ғолиби ҳакимро!",
            "verse 62:2": "Ӯст Худое, ки ба миёни мардуме бесавод паёмбаре аз худашон фиристод, то оёташро бар онҳо бихонад ва онҳоро покиза созад ва китобу ҳикматашон биёмузад. Агарчи пеш аз он дар гумроҳии ошкор буданд,",
            "verse 62:3": "Ва бар гурӯҳе дигар аз онҳо, ки ҳанӯз ба онҳо напайвастаанд. Ва Ӯст Ғолибу ҳаким!",
            "verse 62:4": "Ин бахшоиши Худост, ки ба ҳар кӣ хоҳад, медиҳад ва Худоро бахшоише бузург аст.",
            "verse 62:5": "Мисоли касоне, ки Таврот ба онҳо дода шуда ва ба он амал намекунанд, мисли он хар аст, ки китобҳоеро мебардорад. Бад мисолест мисолм мардуме, ки оёти Худоро дурӯғ мешумурдаанд. Ва Худо золимонро ҳидоят намекунад.",
            "verse 62:6": "Бигӯ: «Эй қавми яҳуд, ҳар гоҳ мепипдоред, ки шумо дӯстони Худо ҳастед, на мардуми дигар, пас орзуи марг кунед, агар рост мегӯед!»",
            "verse 62:7": "Ва онон ба сабаби амалҳое, ки пеш аз ин кардаанд, ҳаргиз орзуи марг нахоҳанд кард. Ба Худо ба ситамкорон доност!",
            "verse 62:8": "Бигӯ: «Он марге, ки аз он мегурезед, шуморо дархоҳад ёфт ва сипас назди он донои ниҳону ошкоро баргардонда мешавед, то ба корҳое, ки кардаед, огоҳатон созад».",
            "verse 62:9": "Эй касоне, ки имон овардаед, чун азони намози рӯзи ҷумъа дода шавад, ба намоз бишитобед ва доду гирифтро тарк кунед,. Агар доно бошед, ин кор бароятон беҳтар аст.",
            "verse 62:10": "Ва чун намоз поён ёфт, дар замин пароканда шавед ва ризқи Худоро талаб кунед ва бисёр ёдаш кунед, бошад, ки наҷот ёбед!",
            "verse 62:11": "Ва чун тиҷорате ё бозичае бинанд, пароканда мешаванд ва ба ҷониби он мераванд ва туро ҳанчунон истода раҳо мекунанд. Бигӯ: «Он чӣ дар назди Худост, аз бозичаву тиҷорат беҳтар аст». Ва Худо беҳтарини рӯзидиҳандагон аст!"
        },
        "Tamil": {
            "verse 62:1": "வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் அல்லாஹ்வைத் தஸ்பீஹு (துதி) செய்துகொண்டிருக்கின்றன, (அவன்தான்) மெய்யான பேரரசன்; பரிசுத்தமானவன், யாவரையும் மிகைத்தவன், ஞானம் மிக்கவன்.",
            "verse 62:2": "அவன்தான், எழுத்தறிவில்லா மக்களிடம் அவனுடைய வசனங்களை ஓதிக்காட்டி, அவர்களைப் பரிசுத்தமாக்கி, அவர்களுக்கு வேதத்தையும், ஞானத்தையும் கற்பிக்கும் படியான தூதரை அவர்களிலிருந்தே அனுப்பி வைத்தான், அவர்களோ, அதற்கு முன்னர் பகிரங்கமான வழிகேட்டிலேயே இருந்தனர்.",
            "verse 62:3": "(இவர்களுக்காகவும்), இவர்களுடன் சேராத (பிற்காலத்த)வர்களுக்காகவும், (தூதராக அனுப்பி வைத்தான்) அவன் (யாவரையும்) மிகைத்தவன், ஞானம் மிக்கவன்.",
            "verse 62:4": "அதுவே அல்லாஹ்வின் அருளாகும், தான் விரும்பியவர்களுக்கு அதை அவனளிக்கிறான், மேலும் அல்லாஹ் மகத்தான அருளுடையவன்.",
            "verse 62:5": "எவர்கள் தவ்றாத் (வேதம்) சுமத்தப்பெற்று பின்னர் அதன்படி நடக்கவில்லையோ, அவர்களுக்கு உதாரணமாவது ஏடுகளைச் சுமக்கும் கழுதையின் உதாரணத்திற்கு ஒப்பாகும், எச்சமூகத்தார் அல்லாஹ்வின் வசனங்களைப் பொய்ப்பிக்கிறார்களோ அவர்களின் உதாரணம் மிகக் கெட்டதாகும் - அல்லாஹ் அநியாயக்கார சமூகத்தாரை நேர்வழியில் செலுத்தமாட்டான்.",
            "verse 62:6": "(நபியே!) நீர் கூறுவீராக: யஹூதிகளே! மற்ற மனிதர்களைவிட நீங்கள் தாம் அல்லாஹ்வுக்குப் பிரியமானவர்கள் என்று எண்ணுவீர்களானால், மேலும் (அவ்வெண்ணத்தில்) நீங்கள் உண்மையாளராக இருப்பின், நீங்கள் மரணத்தை விரும்புங்கள்.\"",
            "verse 62:7": "ஆனால், அவர்களுடைய கைகள் முற்படுத்தி வைத்த (பாவத்)தின் காரணத்தால், அவர்கள் அதை (மரணத்தை) ஒருக்காலும் விரும்ப மாட்டார்கள். மேலும், அல்லாஹ் அநியாயக்காரர்களை நன்கறிந்தவன்.",
            "verse 62:8": "\"நீங்கள் எதை விட்டும் விரண்டு ஓடுகிறீர்களோ, அந்த மரணம் நிச்சயமாக உங்களை சந்திக்கும், பிறகு, மறைவானதையும் பகிரங்கமானதையும் நன்கறிந்தவனிடம் நீங்கள் கொண்டு மீட்டப்படுவீர்கள் - அப்பால், அவன் நீங்கள் செய்து கொண்டிருந்தவை பற்றி உங்களுக்கு அறிவிப்பான்\" (என்று) (நபியே!) நீர் கூறுவீராக.",
            "verse 62:9": "ஈமான் கொண்டவர்களே! ஜுமுஆ உடைய நாளில் தொழுகைக்காக நீங்கள் அழைக்கப்பட்டால், வியாபாரத்தை விட்டுவிட்டு, அல்லாஹ்வைத் தியானிக்க (பள்ளிக்கு) விரைந்து செல்லுங்கள் - நீங்கள் அறிபவர்களாக இருப்பின் இதுவே உங்களுக்கு மிக மேலான நன்மையுடையதாகும்.",
            "verse 62:10": "பின்னர், (ஜுமுஆ) தொழுகை நிறைவேற்றப்பட்டு விட்டதும், (பள்ளியிலிருந்து வெளிப்பட்டு) பூமியில் பரவிச் சென்று அல்லாஹ்வுடைய அருளைத் தேடிக் கொள்ளுங்கள், அன்றியும், நீங்கள் வெற்றியடையும் பொருட்டு, அல்லாஹ்வை அதிகமதிகம் தியானம் செய்யுங்கள்.",
            "verse 62:11": "இன்னும், (நபியே!) அவர்களில் (சிலர்) ஒரு வியாபாரத்தையோ, அல்லது ஒரு வேடிக்கையையோ, கண்டால், அதன்பால் அவர்கள் சென்று விடுகின்றனர். மேலும், நின்ற வண்ணமே உம்மை விட்டுவிடுகின்றனர், \"அல்லாஹ்விடத்தில் இருப்பது, வேடிக்கையை விடவும் வியாபாரத்தை விடவும் மிகவும் மேலானதாகும், மேலும் அல்லாஹ் உணவளிப்பவர்களில் மிகவும் மேலானவன்\" என்று (நபியே!) நீர் கூறுவீராக."
        },
        "Tatar": {
            "verse 62:1": "Җирдәге вә күкләрдәге һәр нәрсә: \"Аллаһ һәр кимчелектән пакь\", – дип мактап тәсбих әйтәдер.",
            "verse 62:2": "Ул – Аллаһ кимчелектән ниһаять пакь, патша, көчле вә хөкем итүчедер. Ул – Аллаһ укый-яза белми торган кавем эченнән үзләре кеби укый-яза белмәгән кешене Мухәммәдне дөньяның барча кешеләренә расүл итеп җибәрде, ул расүл кешеләргә Аллаһ аятьләрен укыйдыр вә аларны бозык игътикадлардан пакьлидер һәм аларга Коръәнне, шәригать хөкемнәрен өйрәтәдер, алар башта ачык адашуда булсалар да.",
            "verse 62:3": "Дәхи ирешмәгән-күрмәгән, ягъни кыямәткә чаклы яши торган бөтен дөнья кешеләренә Мухәммәд г-мне пәйгамбәр итеп җибәрде. Ул – Аллаһ көчле вә хөкем итүче.",
            "verse 62:4": "Кешеләрне ислам диненә кертү, Аллаһуның юмартлыгыдыр, аны теләгән кешесенә бирер. Аллаһ олугъ юмартлык ияседер.",
            "verse 62:5": "Тәүрат китабы бирелеп аның белән гамәл кылу бурычы йөкләтелеп тә соңра аның белән гамәл кылмаучы яһүдләрнең мисалы, китап күтәргән ишәк кебидер. Ишәккә нинди файда бар китап күтәреп йөрүдә? Яһүдләр Тәүратны укыйлар, әмма хөкемнәре белән гамәл кылмыйлар, коры укуда аларга нинди файда? Шулай ук мөселманбыз дигәннәребезнең күберәге, Коръән укыйлар, әмма хөкемнәре белән гамәл кылмыйлар һәм Коръән күрсәткән юлдан бармыйлар. Боларның да китап күтәргән ишәктән нинди аермалары бар? Аллаһуның аятьләрен ялганга тотучы һәм Коръән белән гамәл кылмаучы кешеләрнең мисалы нинди яман мисалдыр. Аллаһ, Коръән белән гамәл кылмаучы залимнәрне туры юлга күндермәс.",
            "verse 62:6": "Коръәнне кабул итмәүче яһүдләргә әйт: \"Ий яһүдләр! Бөтен дөнья кешеләреннән башка без генә Аллаһ дуслары дигән сүзегезне дөресләргә теләсәгез, Аллаһудан үлемне сорагыз, без генә Аллаһ дуслары дигән сүзләрегез дөрес булса!",
            "verse 62:7": "Алар Аллаһудан үлемне мәңге сорамаслар, Аллаһуга каршы кылган кабахәт эшләре сәбәпле. Аллаһ залимнәрнең бозык эшләрен беләдер.",
            "verse 62:8": "Аларга әйт: \"Сез аңардан куркып качкан үлем сезне каршы алучыдыр, соңра әшкәрәне вә яшеренне белүче Аллаһуга кайтарылырсыз, Ул кылган эшләрегездән сезгә хәбәр бирер.",
            "verse 62:9": "Ий мөэминнәр, әгәр җомга көн җомга намазына азан әйтелсә, эшләрегезне вә сәүдәләрегезне куеп намаз укырга, вәгазь тыңларга ашыгып барыгыз. Бу эш сезнең өчен хәерледер, әгәр бу эшнең файдасын белсәгез! Ләкин мөселманнар җыелып намаз укыла торган җайда, бидеґәт гамәлләр булмаска, Коръәннән вәгазь сөйләнергә һәм Коръән хөкемнәре йөртелергә тиешледер.",
            "verse 62:10": "Әгәр җомга укылган җайда вәгазь сөйләнеп, намаз укылып тәмам булса, эшләрегезгә, сәүдәләрегезгә таралыгыз җир өстенә, вә Аллаһуның юмартлыгыннан дөнья вә ахирәт кирәк нәрсәләрегезне таләп итеп кәсеп итегез һәм Аллаһуны даим зекер итегез, шаять Аллаһ ґәзабыннан котылып мәңгелек бәхеткә ирешерсез!",
            "verse 62:11": "Мәсҗидкә җыелган мөселманнар, әгәр сәүдәне күрсәләр яки мал белән кайткан кәрванчыларның барабан суккан тавышларын ишетсәләр, сине менбәрдә аяк өстендә калдырып мәсҗидтән ябырылып чыгып китәләр. (Мәдинәдә каты ачлык иде, җомга көн Мәдинәгә Шамнан кайткан карван мал, ризык белән килеп керде, һәм кәрванчылар барабан суктылар. Мәсҗидтәге мөселманнар ризыктан буш калудан куркып, җомганы ташлап кәрванга каршы бардылар.) Бу аять аларны вә аларга охшаган кешеләрне шелтә кылыр өчен иңде. Ий Мухәммәд г-м, аларга әйт: \"Барабан тавышына вә сәүдә малына караганда Аллаһу хозурында булган нигъмәтләр яхшырак. Бит Аллаһ ризыкландыручыларның хәерлесе. Ягъни намазны һәм Коръән вәгазен тыңлап Ислам тәрбиясен алуны, дөнья малына алыштырмагыз!\""
        },
        "Telugu": {
            "verse 62:1": "ఆకాశాలలో నున్నవి మరియు భూమిలో నున్నవి, సమస్తమూ విశ్వసార్వభౌముడు, పరమ పవిత్రుడు, సర్వశక్తిమంతుడు, మహా వివేకవంతుడు అయన అల్లాహ్ పవిత్రతను కొనియాడుతూ ఉంటాయి",
            "verse 62:2": "ఆయనే ఆ నిరక్ష్యరాస్యులైన వారిలో నుండి ఒక సందేశహరుణ్ణి లేపాడు. అతను వారికి ఆయన సూచనలను (ఆయాత్ లను) చదివి వినిపిస్తున్నాడు మరియు వారిని సంస్కరిస్తున్నాడు మరియు వారికి గ్రంథాన్ని మరియు వివేకాన్ని బోధిస్తున్నాడు. మరియు వాస్తవానికి వారు, అంతకు పూర్వం స్పష్టమైన మార్గభ్రష్టత్వంలో పడి ఉండేవారు",
            "verse 62:3": "మరియు ఇంకా వారిలో చేరని ఇతరులకు కూడా (బోధించటానికి). మరియు ఆయన సర్వశక్తిమంతుడు, మహా వివేకవంతుడు",
            "verse 62:4": "ఇది అల్లాహ్ అనుగ్రహం, ఆయన దానిని తాను కోరిన వారికి ప్రసాదిస్తాడు. మరియు అల్లాహ్ అనుగ్రహశాలి, సర్వోత్తముడు",
            "verse 62:5": "తౌరాత్ బాధ్యత (భారం) మోపబడిన తరువాత దానిపై అమలు చేయలేక పోయిన వారి పోలిక, పుస్తకాల భారాన్ని మోసే ఆ గాడిద వలే ఉంది. (వారు ఆ భారాన్ని భరించారే గానీ, దానిని అర్థం చేసుకోలేక పోయారు). అల్లాహ్ సూచన (ఆయాత్) లను తిరస్కరించిన వారి దృష్టాంతము ఎంత చెడ్డది. మరియు అల్లాహ్ దుర్మార్గులకు మార్గదర్శకత్వం చేయడు",
            "verse 62:6": "వారితో ఇలా అను: ఓ యూదులారా! నిశ్చయంగా, ఇతర ప్రజల కంటే మీరు మాత్రమే అల్లాహ్ కు ప్రియమైన వారు (స్నేహితులు) అనే భావం మీకుంటే, మీ (వాదంలో) మీరు సత్యవంతులే అయితే మీరు చావును కోరండి",
            "verse 62:7": "కాని వారు తాము చేసి పంపుకున్న కర్మల (ఫలితాల)కు భయపడి దానిని ఏ మాత్రం కోరుకోరు! మరియు అల్లాహ్ కు దుర్మార్గులను గురించి బాగా తెలుసు",
            "verse 62:8": "వారితో ఇలా అను: వాస్తవానికి ఏ చావు నుండి అయితే మీరు పారిపోతున్నారో! నిశ్చయంగా, అదే మిమ్మల్ని పట్టుకుంటుంది. ఆ తరువాత మీరు, అగోచర మరియు గోచర విషయాలు తెలిసిన ఆయన (అల్లాహ్) వైపునకు మరలింపబడతారు, అప్పుడు ఆయన మీరు చేస్తూ ఉండిన కర్మలను మీకు తెలుపుతాడు",
            "verse 62:9": "ఓ విశ్వాసులారా! శుక్రవారం (జుముఅహ్) రోజు నమాజ్ కొరకు పిలుపు ఇవ్వబడినప్పుడు, మీరు మీ వ్యాపారాలను విడిచి అల్లాహ్ స్మరణ వైపునకు పరుగెత్తండి. మీరు తెలుసుకోగలిగితే అది మీకు ఎంతో ఉత్తమమమైనది",
            "verse 62:10": "ఇక నమాజ్ పూర్తి అయిన తరువాత భూమిలో వ్యాపించండి మరియు అల్లాహ్ అనుగ్రహాన్ని అన్వేషించండి మరియు మీరు సాఫల్యం పొందాలంటే అల్లాహ్ ను అత్యధికంగా స్మరిస్తూ ఉండండి",
            "verse 62:11": "మరియు (ఓ ముహమ్మద్!) వారు వ్యాపారాన్ని గానీ లేదా వినోద క్రీడను గానీ చూసినప్పుడు, నిన్ను నిలబడివున్న స్థితిలోనే వదలిపెట్టి, దాని చుట్టు గుమిగూడుతారు. వారితో ఇలా అను: వినోద క్రీడల కంటే మరియు వ్యాపారం కంటే, అల్లాహ్ వద్ద ఉన్నదే ఎంతో ఉత్తమమైనది. మరియు అల్లాహ్ యే జీవనోపాధి ప్రసాదించటంలో అత్యుత్తముడు"
        },
        "Thai": {
            "verse 62:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และสิ่งที่อยู่ในแผ่นดินต่างแซ่ซ้องสดุดีแด่อัลลอฮฺ ผู้ทรงอภิสิทธิ์ ผู้ทรงบริสุทธิ์ ผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
            "verse 62:2": "พระองค์ทรงเป็นผู้แต่งตั้งร่อซูลขึ้นคนหนึ่งในหมู่ผู้ไม่รู้จักหนังสือจากพวกเขาเองเพื่อสาธยายอายาตต่าง ๆ ของพระองค์แก่พวกเขา และทรงทำให้พวกเขาผุดผ่อง และทรงสอนคัมภีร์และความสุขุมคัมภีร์ภาพแก่พวกเขา และแม้ว่าแต่ก่อนนี้พวกเขาอยู่ในการหลงผิดอย่างชัดแจ้งก็ตาม",
            "verse 62:3": "และกลุ่มชนอื่น ๆ ในกลุ่มพวกเขาที่จะติดตามมาภายหลังจากพวกเขา และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
            "verse 62:4": "นั่นคือความโปรดปรานของอัลลอฮฺทรงประทานความโปรดปรานนั้นแก่ผู้ที่พระองค์ทรงประสงค์ และอัลลอฮฺนั้นเป็นผู้มีบุญคุณอันใหญ่หลวง",
            "verse 62:5": "อุปมาบรรดาผู้ที่ได้รับคัมภีร์เตารอฮฺแล้วพวกเขามิได้ปฎิบัติตามที่พวกเขาได้รับมอบประหนึ่งเช่นกับลาที่แบกหนังสือจำนวนหนึ่ง (บนหลังของมัน) อุปมาหมู่ชนที่ปฏิเสธต่อสัญญาณต่าง ๆ ของอัลลอฮฺมันช่างชั่วช้าจริง ๆและอัลลอฮฺจะไม่ชี้แนะทางแก่หมู่ชนผู้อธรรม",
            "verse 62:6": "จงกล่าวเถิดมุฮัมมัด โอ้บรรดายิวเอ๋ย หากพวกท่านอ้างว่าพวกท่านเป็นมิตรของอัลลอฮฺอื่นจากมนุษย์ทั้งหลายแล้วไซร์ ดังนั้นพวกท่านก็จงมุ่งหวังความตายกันเถิด หากพวกท่านเป็นผู้สัตย์จริง",
            "verse 62:7": "แต่ว่าพวกเขาจะไม่มุ่งหวังมันเป็นอันขาด เนื่องด้วยสิ่งที่มือของพวกเขาได้ประกอบ (กรรมชั่ว) ไว้ก่อน และอัลลอฮฺทรงรอบรู้พวกอธรรมทั้งหลาย",
            "verse 62:8": "จงกล่าวเถิดมุฮัมมัด แท้จริงความตายที่พวกท่านหนีจากมันไปนั้น มันจะมาพบกับพวกท่าน แล้วพวกท่านจะถูกนำกลับไปยังพระผู้ทรงรอบรู้สิ่งเร้นลับและสิ่งเปิดเผย แล้วพระองค์จะทรงแจ้งแก่พวกท่านตามที่พวกท่านได้ประกอบกรรมไว้",
            "verse 62:9": "โอ้บรรดาผู้ศรัทธาเอ๋ย เมื่อได้มีเสียงร้องเรียก (อะซาน) เพื่อทำละหมาดในวันศุกร์ก็จงรีบเร่งไปสู่การรำลึกถึงอัลลอฮฺ และจงละทิ้งการค้าขายเสีย นั่นเป็นการดีสำหรับพวกเจ้าหากพวกเจ้ารู้",
            "verse 62:10": "ต่อเมื่อการละหมาดได้สิ้นสุดลงแล้ว ก็จงแยกย้ายกันไปตามแผ่นดิน และจงแสวงหาความโปรดปรานของอัลลอฮฺและจงรำลึกถึงอัลลอฮฺให้มาก ๆ เพื่อว่าพวกเจ้าจะได้รับชัยชนะ",
            "verse 62:11": "และเมื่อพวกเขาได้เห็นการค้าและการละเล่นพวกเขาก็กรูกันไปที่นั้น และปล่อยเจ้าให้ยืนอยู่คนเดียว จงกล่าวเถิดมุฮัมมัดสิ่งที่มีอยู่ ณ อัลลอฮฺนั้นดีกว่าการละเล่น และการค้าและอัลลอฮฺนั้นทรงเป็นเลิศ ยิ่งในหมู่ผู้ประทานปัจจัยยังชีพ"
        },
        "Turkish": {
            "verse 62:1": "Göklerde olanlar ve yerde bulunanlar, hükümran, çok kutsal, güçlü ve Hakim olan Allah'ı tesbih ederler.",
            "verse 62:2": "Kitapsız (okuma-yazma bilmeyen) kimseler arasından, kendilerine ayetlerini okuyan, onları arıtan, onlara Kitabı ve hikmeti öğreten bir Peygamber gönderen O'dur. Onlar, daha önce, şüphesiz apaçık bir sapıklık içinde idiler.",
            "verse 62:3": "Onlardan başkalarına da -ki henüz onlara katılmamışlardır- Kitap ve hikmeti öğretmek üzere, Peygamberi gönderen Allah'tır. O, güçlüdür, Hakim'dir.",
            "verse 62:4": "Bu, Allah'ın dilediğine verdiği lütfüdür. Allah, büyük lütuf sahibidir.",
            "verse 62:5": "Kendilerine Tevrat öğretildiği halde, onun gereğini yapmayanların durumu, sırtına kitap yüklenmiş merkebin durumu gibidir. Allah'ın ayetlerini yalanlayan kimselerin durumu ne kötüdür! Allah zalimleri doğru yola eriştirmez.",
            "verse 62:6": "De ki: \"Ey Yahudiler! Bütün insanlar bir yana, yalnız kendinizin Allah'ın dostları olduğunuzu iddia ediyorsanız ve bunda samimi iseniz, ölümü dilesenize!\"",
            "verse 62:7": "Yaptıklarından ötürü, ölümü asla dileyemezler. Allah, zalimleri bilendir.",
            "verse 62:8": "De ki: \"Doğrusu kendisinden kaçtığınız ölüm mutlaka karşınıza çıkacaktır; sonra; görüleni de görülmeyeni de bilen Allah'a döndürüleceksiniz, O size işlediklerinizi haber verecektir.\"",
            "verse 62:9": "Ey inananlar! Cuma günü namaz için ezan okunduğu zaman Allah'ı anmaya koşun; alım satımı bırakın; bilseniz, bu sizin için daha iyidir.",
            "verse 62:10": "Namaz bitince yeryüzüne yayılın; Allah'ın lütfundan rızık isteyin; Allah'ı çok anın ki saadete erişesiniz.",
            "verse 62:11": "Onlar bir kazanç veya bir eğlence gördüklerinde, seni ayakta bırakarak oraya yöneldiler. De ki: \"Allah katında olan, eğlenceden de kazançtan da hayırlıdır. Allah, rızık verenlerin en iyisidir.\""
        },
        "Urdu": {
            "verse 62:1": "جو چیز آسمانوں میں ہے اور جو چیز زمین میں ہے سب خدا کی تسبیح کرتی ہے جو بادشاہ حقیقی پاک ذات زبردست حکمت والا ہے",
            "verse 62:2": "وہی تو ہے جس نے ان پڑھوں میں ان ہی میں سے (محمدﷺ) کو پیغمبر (بنا کر) بھیجا جو ان کے سامنے اس کی آیتیں پڑھتے اور ان کو پاک کرتے اور (خدا کی) کتاب اور دانائی سکھاتے ہیں۔ اور اس ے پہلے تو یہ لوگ صریح گمراہی میں تھے",
            "verse 62:3": "اور ان میں سے اور لوگوں کی طرف بھی (ان کو بھیجا ہے) جو ابھی ان (مسلمانوں سے) نہیں ملے۔ اور وہ غالب حکمت والا ہے",
            "verse 62:4": "یہ خدا کا فضل ہے جسے چاہتا ہے عطا کرتا ہے۔ اور خدا بڑے فضل کا مالک ہے",
            "verse 62:5": "جن لوگوں (کے سر) پر تورات لدوائی گئی پھر انہوں نے اس (کے بار تعمیل) کو نہ اٹھایا ان کی مثال گدھے کی سی ہے جن پر بڑی بڑی کتابیں لدی ہوں۔ جو لوگ خدا کی آیتوں کی تکذیب کرتے ہیں ان کی مثال بری ہے۔ اور خدا ظالم لوگوں کو ہدایت نہیں دیتا",
            "verse 62:6": "کہہ دو کہ اے یہود اگر تم کو دعویٰ ہو کہ تم ہی خدا کے دوست ہو اور لوگ نہیں تو اگر تم سچے ہو تو (ذرا) موت کی آرزو تو کرو",
            "verse 62:7": "اور یہ ان (اعمال) کے سبب جو کرچکے ہیں ہرگز اس کی آرزو نہیں کریں گے۔ اور خدا ظالموں سے خوب واقف ہے",
            "verse 62:8": "کہہ دو کہ موت جس سے تم گریز کرتے ہو وہ تو تمہارے سامنے آ کر رہے گی۔ پھر تم پوشیدہ اور ظاہر کے جاننے والے (خدا) کی طرف لوٹائے جاؤ گے پھر جو کچھ تم کرتے رہے ہو وہ سب تمہیں بتائے گا",
            "verse 62:9": "مومنو! جب جمعے کے دن نماز کے لئے اذان دی جائے تو خدا کی یاد (یعنی نماز) کے لئے جلدی کرو اور (خریدو) فروخت ترک کردو۔ اگر سمجھو تو یہ تمہارے حق میں بہتر ہے",
            "verse 62:10": "پھر جب نماز ہوچکے تو اپنی اپنی راہ لو اور خدا کا فضل تلاش کرو اور خدا کو بہت بہت یاد کرتے رہو تاکہ نجات پاؤ",
            "verse 62:11": "اور جب یہ لوگ سودا بکتا یا تماشا ہوتا دیکھتے ہیں تو ادھر بھاگ جاتے ہیں اور تمہیں (کھڑے کا) کھڑا چھوڑ جاتے ہیں۔ کہہ دو کہ جو چیز خدا کے ہاں ہے وہ تماشے اور سودے سے کہیں بہتر ہے اور خدا سب سے بہتر رزق دینے والا ہے"
        },
        "Uyghur": {
            "verse 62:1": "اﷲ قا ئاسمانلاردىكى ۋە زېمىندىكى نەرسىلەر تەسبىھ ئېيتىدۇ. اﷲ پادىشاھى (مۇتلەقتۇر)، (ھەممە نۇقسانلاردىن) پاكتۇر، غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 62:2": "اﷲ ئۈممىلەرگە (يەنى يېزىشنى ۋە ئوقۇشنى ئۇقمايدىغان ئەرەبلەرگە) ئۇلارنىڭ ئىچىدىن بىر پەيغەمبەرنى (يەنى مۇھەممەد ئەلەيھىسسالامنى) ئەۋەتتى، ئۇ (يەنى پەيغەمبەر) ئۇلارغا قۇرئان ئايەتلىرىنى ئوقۇپ بېرىدۇ، ئۇلارنى (گۇناھلاردىن) پاك قىلىدۇ، ئۇلارغا كىتابنى (يەنى قۇرئاننى) ۋە ھېكمەتنى (يەنى يەنى پەيغەمبەرنىڭ سۈننىتىنى) ئۆگىتىدۇ، گەرچە ئۇلار ئىلگىرى ئوچۇق گۇمراھلىقتا بولسىمۇ",
            "verse 62:3": "ھەمدە (پەيغەمبەرنى) تېخى ئۇلارنىڭ زامانىدا بولمىغان (كېيىن كېلىدىغان) ئىككىنچى بىر قەۋمگە (يەنى قىيامەتكىچە كېلىدىغان مۇسۇلمانلارغا) ئەۋەتتى (يەنى پەيغەمبەر ئەلەيھىسسالامنىڭ پەيغەمبەرلىكى زامانداشلىرىغىلا ئەمەس، بەلكى قىيامەتكىچە كېلىدىغان كىشىلەرگىمۇ ئومۇمىيدۇر)، اﷲ غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 62:4": "مانا بۇ اﷲ نىڭ پەزلىدۇركى، ئۇنى خالىغان ئادەمگە بېرىدۇ، اﷲ ئۇلۇغ پەزل ئىگىسىدۇر",
            "verse 62:5": "تەۋراتنى كۆتۈرۈشكە (يەنى ئەمەل قىلىشقا) تەكلىپ قىلىنغان، ئاندىن ئۇنى كۆتۈرمىگەنلەر (يەنى تەۋرات بېرىلگەن ۋە ئۇنىڭغا ئەمەل قىلىشقا تەكلىپ بولسىمۇ، ئۇنىڭغا ئەمەل قىلمىغان ۋە ھىدايەتتىن پايدىلانمىغان يەھۇدىيلار) خۇددى كىتاب يۈكلەنگەن ئېشەككە ئوخشايدۇ (يەنى پايدىلىق چوڭ - چوڭ كىتابلارنى ئۈستىگە ئارتىۋالغان، چارچاشتىن باشقا، ئۇلاردىن ھېچقانداق پايدىلىنالمايدىغان ئېشەككە ئوخشايدۇ)، اﷲ نىڭ ئايەتلىرىنى ئىنكار قىلغان قەۋمنىڭ مىسالى نېمىدېگەن يامان! اﷲ زالىم قەۋمنى ھىدايەت قىلمايدۇ",
            "verse 62:6": "(ئى مۇھەممەد!) ئېيتقىنكى، «ئى يەھۇدىيلار! ئەگەر سىلەر باشقىلارنى ئەمەس، پەقەت ئۆزۈڭلارنىلا اﷲ نىڭ دوستلىرى دەپ دەۋا قىلىدىغان بولساڭلار، (ئاخىرەتنىڭ راھىتىگە تېزرەك يېتىش ئۈچۈن) ئۆلۈمنى ئارزۇ قىلىپ بېقىڭلار، ئەگەر (بۇ دەۋايىڭلاردا) راستچىل بولساڭلار»",
            "verse 62:7": "ئۇلار قىلغان گۇناھلىرى تۈپەيلىدىن، ئۆلۈمنى ھەرگىز ئارزۇ قىلمايدۇ، اﷲ زالىملارنى بىلگۈچىدۇر",
            "verse 62:8": "(ئى مۇھەممەد!) «سىلەر قاچىدىغان ئۆلۈم چوقۇم سىلەرگە يولۇقىدۇ، ئاندىن سىلەر غەيبنى ۋە ئاشكارىنى بىلگۈچى (اﷲ) نىڭ دەرگاھىغا قايتۇرىسىلەر، اﷲ سىلەرگە قىلمىشىڭلارنى ئېيتىپ بېرىدۇ» دېگىن",
            "verse 62:9": "ئى مۆمىنلەر جۈمە كۈنى جۈمە نامىزىغا ئەزان ئېيتىلسا، اﷲ نى ياد ئېتىشكە (يەنى جۈمە خۇتبىسىنى ئاڭلاشقا ۋە جۈمە نامىزىنى ئادا قىلىشقا) ئالدىراپ بېرىڭلار، ئېلىم - سېتىمنى قويۇپ تۇرۇڭلار، ئەگەر بىلسەڭلار بۇ سىلەر ئۈچۈن ياخشىدۇر",
            "verse 62:10": "ناماز ئوقۇلۇپ بولغاندا (يەنى نامازدىن فارىغ بولغىنىڭلاردىن كېيىن) زېمىنغا تارىلىپ (يەنى ئۆز مەشغۇلاتىڭلار بىلەن بولۇپ)، اﷲ نىڭ پەزلىدىن تەلەپ قىلىڭلار، مەقسىتىڭلارغا ئېرىشىش ئۈچۈن اﷲ نى كۆپ ياد ئېتىڭلار",
            "verse 62:11": "(ئى مۇھەممەد!) ئۇلار بىرەر تىجارەتنى ياكى تاماشانى كۆرسە، سېنى ئۆرە تۇرۇپ (خۇتبە ئوقۇۋاتقان) پېتىڭ تاشلاپ، ئۇنىڭغا (يەنى تىجارەتكە) يۈگۈرىدۇ، (ئى مۇھەممەد! ئۇلارغا) ئېيتقىنكى، اﷲ نىڭ دەرگاھىدىكى نەرسە (يەنى ساۋاب ۋە نېمەت) تاماشادىن ۋە تىجارەتتىن ياخشىدۇر، اﷲ رىزىق بەرگۈچىلەرنىڭ ئەڭ ياخشىسىدۇر"
        },
        "Uzbek": {
            "verse 62:1": "Осмонлару ердаги барча нарсалар Хожа, Бенуқсон, Азиз, Ҳаким Аллоҳга тасбиҳ айтадир.",
            "verse 62:2": "У зот саводсизлар ичидан, гарчи улар бундан аввал очиқ залолатда бўлсалар ҳам, уларга оятларини ўқиб берадиган ва уларни поклайдиган ҳамда китобни ва ҳикматни ўргатадиган Пайғамбарни юборди.",
            "verse 62:3": "Ва ҳозирча уларга қўшилмаган бошқаларга ҳам. Ва У зот ғолиб ва ҳикмат эгасидир.",
            "verse 62:4": "Бу Аллоҳнинг фазлидир (ва уни) хоҳлаган кишисига берадир. Аллоҳ улуғ фазл эгасидир.",
            "verse 62:5": "Устларига Таврот юклатилган, сўнгра уни кўтармаганлар мисоли устига китоб юкланган эшакка ўхшарлар. Аллоҳнинг оятларини ёлғонга чиқарган қавмнинг мисоли қандоқ ҳам ёмон. Аллоҳ золим қавмларни ҳидоят қилмас.",
            "verse 62:6": "Сен: «Эй яҳудийлар, албатта сиз, бошқалардан фарқли ўлароқ, Аллоҳнинг авлиёларимиз, деб даъво қиладиган бўлсангиз, бас, ўлимни орзу қилинг, агар ростгўй бўлсангиз», деб айт.",
            "verse 62:7": "Улар қўллари қилган(гуноҳ)лари туфайли ҳеч қачон, у(ўлим)ни орзу қилмаслар. Аллоҳ золимларни билувчидир.",
            "verse 62:8": "Сен: «Албатта, сиз ундан қочаётган ўлим, таъкид шулки, сизга барибир йўлиқувчидир. Сўнгра махфий ва ошкор нарсаларни Билувчининг ҳузурига қайтарилурсизлар. Бас, У сизга нима қилиб юрганингизнинг хабарини берадир.",
            "verse 62:9": "Эй иймон келтирганлар! Жума куни намозга нидо қилинганда, Аллоҳнинг зикрига шошилинг ва савдони қўйинг. Агар билсангиз, бу ўзингиз учун яхшидир.",
            "verse 62:10": "Бас, намоз тугагандан сўнг ер юзи бўйлаб тарқалинг ва Аллоҳнинг фазлидан талаб қилинг ва Аллоҳни кўп эсланг, шоядки ютуққа эришсангиз.",
            "verse 62:11": "Ва улар тижорат ёки ўйин-кулгу кўрганларида, унга томон ёпирилдилар ва сени тик ҳолда тарк этдилар. Сен: «Аллоҳнинг ҳузуридаги нарса ўйин-кулгудан ва тижоратдан яхшидир. Ва Аллоҳ энг яхши ризқ берувчидир», деб айт."
        },
        "Vietnamese": {
            "verse 62:1": "Vạn vật trong các tầng trời và vạn vật trên trái đất đều tán dương tôn cao Allah, Đấng Chúa Thượng, Đấng Linh Thiêng, Đấng Chí Tôn, Đấng Thông Thái.",
            "verse 62:2": "Chính Ngài là Đấng đã dựng lên trong đám dân mù chữ (Ả-rập tại Makkah) một vị Sứ Giả xuất thân từ họ để đọc cho họ nghe các lời mặc khải của Ngài, thanh tẩy họ và dạy họ Kinh Sách cũng như sự khôn ngoan – mặc dù trước đó họ thực sự đã lầm lạc.",
            "verse 62:3": "Và (Ngài phái Y đến với) những người khác trong số họ chưa tham gia cùng với họ. Quả thật, Ngài là Đấng Chí Tôn, Đấng Thông Thái.",
            "verse 62:4": "Đó là hồng phúc của Allah mà Ngài ban cho ai Ngài muốn. Và Allah là chủ nhân của hồng phúc vĩ đại.",
            "verse 62:5": "Hình ảnh của những người được giao cho Kinh Tawrah nhưng rồi không thi hành theo nó giống như hình ảnh của một con lừa chở trên lưng nó hằng đống sách. Thật khốn khổ và tồi tệ cho đám người phủ nhận các Lời Mặc Khải của Allah; và Allah không hướng dẫn đám người làm điều sai quấy.",
            "verse 62:6": "Ngươi (Thiên Sứ Muhammad) hãy nói: “Hỡi những người Do Thái! Nếu các ngươi tuyên bố rằng chỉ có các ngươi là những vị Wali của Allah chứ không bao gồm những ai khác trong thiên hạ thì các ngươi hãy cầu mong được chết nếu các ngươi thành thật.”",
            "verse 62:7": "Nhưng chúng sẽ không bao giờ dám cầu mong điều đó vì những gì bàn tay của chúng đã gởi đi trước. Quả thật, Allah biết rõ những kẻ làm điều sai quấy.",
            "verse 62:8": "Ngươi (Thiên Sứ Muhammad) hãy nói (với những người Do Thái đó): “Quả thật, cái chết mà các ngươi chạy trốn khỏi nó chắc chắn sẽ gặp các ngươi. Sau đó, các ngươi sẽ được đưa trả về cho Đấng biết điều vô hình và hữu hình, và Ngài sẽ cho các ngươi biết về những gì các ngươi đã từng làm (trên trần thế).”",
            "verse 62:9": "Hỡi những người có đức tin! Khi được mời gọi đến lễ nguyện Salah Jumu’ah (vào ngày thứ sáu) thì các ngươi hãy nhanh chân tiến đến với việc tụng niệm Allah và hãy tạm gác lại việc mua bán. Điều đó tốt cho các ngươi nếu các ngươi biết.",
            "verse 62:10": "Và khi cuộc lễ nguyện Salah đã được kết thúc, các ngươi hãy phân tán khắp nơi trên trái đất và tìm kiếm bổng lộc của Allah, và các ngươi hãy nhớ đến Allah thật nhiều mong rằng các ngươi có thể thành đạt.",
            "verse 62:11": "(Một số tín đồ Muslim), khi nhìn thấy một cuộc giao dịch mua bán hoặc một cuộc vui chơi nào thì họ liền lao đến đó và bỏ mặc Ngươi (Thiên Sứ Muhammad) đứng trơ (trên bục giảng). Ngươi hãy nói với họ: “Những gì ở nơi Allah tốt đẹp hơn cuộc vui chơi và việc mua bán. Quả thật, Allah là Đấng ban phát bổng lộc tốt nhất.”"
        },
        "Yoruba": {
            "verse 62:1": "Ohunkohun t’o wa ninu awon sanmo ati ohunkohun to wa ninu ile n se afomo fun Allahu, Oba eda, Eni-Mimo julo, Alagbara, Ologbon",
            "verse 62:2": "Oun ni Eni ti O gbe dide laaarin awon alaimoonkomoonka (alainitira) Ojise kan lara won. O n ke awon ayah Re fun won. O n fo won mo (ninu ese). O si n ko won ni Tira ati ogbon ijinle (iyen, sunnah), bi o tile je pe teletele won ti wa ninu isina ponnbele",
            "verse 62:3": "(Ise jije re tun wa fun) awon miiran ti won maa wa ninu awon (omoleyin re), amo ti won ko ti i rin kan won. (Allahu) Oun ni Alagbara, Ologbon",
            "verse 62:4": "Iyen ni oore ajulo Allahu. O n fun eni ti O ba fe. Allahu si ni Oloore-ajulo nla",
            "verse 62:5": "Apejuwe ijo ti A fun ni Taorah, leyin naa ti won ko tele e, o da bi apejuwe ketekete ti o ru eru awon tira. Aburu ni apejuwe awon t’o pe awon ayah Allahu niro. Allahu ko si nii fi ona mo ijo alabosi",
            "verse 62:6": "So pe: \"Eyin yehudi, ti e ba lero pe dajudaju eyin ni ore Allahu dipo awon eniyan (yooku), e toro iku nigba naa ti e ba je olododo",
            "verse 62:7": "Won ko nii toro re laelae nitori ohun ti owo won ti ti siwaju. Allahu si ni Onimo nipa awon alabosi",
            "verse 62:8": "So pe: \"Dajudaju iku ti e n sa fun, dajudaju o maa pade yin. Leyin naa, won yoo da yin pada si odo Onimo-ikoko ati gbangba. O si maa fun yin ni iro ohun ti e n se nise",
            "verse 62:9": "Eyin ti e gbagbo ni ododo, nigba ti won ba pe irun ni ojo Jum‘ah, e yara lo sibi iranti Allahu, ki e si pa kata-kara ti. Iyen loore julo fun yin ti e ba mo",
            "verse 62:10": "Nigba ti won ba si pari irun, e tuka si ori ile, ki e si maa wa ninu oore Allahu. E ranti Allahu ni opolopo nitori ki e le jere",
            "verse 62:11": "Nigba ti won ba ri oja kan tabi iranu kan, won yoo da lo sibe. Won yo si fi o sile lori iduro. So pe: \"Nnkan ti o wa ni odo Allahu l’oore ju iranu ati oja lo. Allahu si l’oore julo ninu awon olupese"
        }
    }
}