{
    "id": 63,
    "name_simple": "Al-Munafiqun",
    "revelation_place": "madinah",
    "revelation_order": 104,
    "bismillah_pre": true,
    "verses_count": 11,
    "short_text": "The Surah takes its name from the sentence Idha jaa kal-munafiquna of verse 1. This is the name of the Surah as well as the title of its subject matter, for in it a review has been made of the conduct and attitude of the hypocrites themselves.",
    "text": [
        "The Surah takes its name from the sentence Idha jaa kal-munafiquna of verse 1. This is the name of the Surah as well as the title of its subject matter, for in it a review has been made of the conduct and attitude of the hypocrites themselves.",
        "Period of Revelation",
        "As we shall explain below this Surah was sent down either during the Holy Prophet's return journey from his campaign against Bani al- Mustaliq, or immediately after his arrival back at Madinah, and we have established by argument and research in the Introduction to Surah An-Nur that the campaign against Bani al-Mustaliq had taken place in Sha'ban A. H. 6:Thus, the date of the revelation of this Surah is determined precisely.",
        "Historical Background",
        "Before we mention the particular incident about which this Surah was sent down, it is necessary to have a look at the history of the hypocrites of Madinah, for the incident that occurred on this occasion was not a chance happening but had a whole series of events behind it, which ultimately led up to it.",
        "Before the Holy Prophet's emigration to Madinah the tribes of the Aus and the Khazraj, fed up with their mutual rivalries and civil wars, had almost agreed on the leadership of one man and were making preparations to crown him their king. This was Abdullah bin Ubayy bin Salul, the chief of the Khazraj. Muhammad bin Ishaq has stated that among the people of Khazraj his authority was never contested and never had the Aus and the Khazraj rallied to one man before this. (Ibn Hisham, vol. II, p. 234)",
        "Such were the conditions when the voice of Islam reached Madinah and the influential people of both the tribes started becoming Muslims. When before the Emigration, the invitation was being extended to the Holy Prophet (upon whom be Allah'> peace) to come to Madinah, Hadhrat Abbas bin Ubadah bin Nadlah Ansari wanted to defer this invitation for the reason that Abdullah bin Ubayy also might join in the declaration of allegiance and invitation to the Holy Prophet, so that Madinah might become the center of Islam by common consent. But the delegation that arrived in Makkah to declare their allegiance did not give any importance to the proposal of Abbas bin Ubadah, and all its members, who included 75 men from both the tribes, became ready to invite the Holy Prophet in the face of every danger.(lbn Hisham, vol. II, P. 89). We have given the details of this event in the Introduction to Surah Al-Anfal.",
        "Then, when the Holy Prophet arrived in Madinah, Islam had so deeply penetrated every house of the Ansar that Abdullah bin Ubayy became helpless and did not see any other way to save his leadership than to become a Muslim himself. So, he entered Islam along with many of his followers from among the chiefs and leaders of both the tribes although their hearts were burning with rage from within. Ibn Ubayy in particular was filled with grief, for the Holy Prophet (upon whom be Allah's peace) had deprived him of his kingship. For several years his hypocritical faith and grief of being deprived of his kingdom manifested itself in different ways. On the one hand, when on Fridays the Holy Prophet (upon whom be Allah's peace) took his seat to deliver the Sermon, Abdullah bin Ubayy would stand up and say \"O people, the Messenger of Allah is present among you, by whom Allah has honored you; therefore, you should support him and listen to what he says and obey him.\" (Ibn Hisham, vol. III, p. 111). On the other, his hypocrisy was being exposed day by day and the true Muslims were realizing that he and his followers bore great malice against Islam, the Holy Prophet, and the Muslims.",
        "Once when the Holy Prophet was passing on the way Abdullah bin Ubayy spoke to him in harsh words. When the Holy Prophet complained of it to Hadrat Sa'd bin Ubadah; he said:\"O Messenger of Allah, don't be hard on him, for when Allah sent you to us we were making a diadem to crown him, and, by God, he thinks that you have robbed him of his kingdom.\" (Ibn Hisham vol: II, pp. 237-238).",
        "After the Battle of Badr when the Holy Prophet (upon whom be Allah's peace) invaded the Jewish tribe of Bani Qainuqa on their breaking the agreement and unprovoked revolt, this man stood up in support of them, and holding the Holy Prophet by his armor, said:\"These 700 fighters have been helping and protecting me against every enemy; would you cut them down in one morning? By God, I will not leave you until you pardon my clients.\" (Ibn Hisham, vol. III, pp. 5l- 52).",
        "On the occasion of the Battle of Uhud this man committed open treachery and withdrew from the battlefield with 300 of his companions. One should note that at this critical moment when he so acted, the Quraish had marched upon Madinah with 3,000 troops and the Holy Prophet had marched out with only 1,000 men to resist them. Of these 1,000 this hypocrite broke away with 300 men and the Holy Prophet was left with only 700 men to meet 3,000 troops of the enemy in the field.",
        "After this incident the common Muslims of Madinah came to realize fully that he was certainly a hypocrite and his those Companions also were found who were his associates in hypocrisy. That is why when on the very first Friday, after the Battle of Uhud, this man stood up as usual to make a speech before the Holy Prophet's Sermon, the people pulled at his garment, saying \"Sit down you are not worthy to say such things.\" That was the first occasion in Madinah when this man was publicly disgraced. Thereupon he was so filled with rage that he left the mosque jumping over the heads of the people. At the door of the Mosque some of the Ansar said to him, \"What are you doing?Go back and ask the Holy Prophet (upon whom be Allah's peace) to pray for your forgiveness.\" He retorted \"I do not, want him to pray for my forgiveness.\" (Ibn Hisham, vol. III, p. 111).",
        "Then in A. H. 4 the Battle of Bani an-Nadir took place. On this occasion he and his companions supported the enemies of Islam even more openly. On the one side, the Holy Prophet (upon whom be Allah's peace) and his devoted Companions were preparing for war against their enemy, the Jews, and on the other, these hypocrites were secretly sending messages to the Jews to the effect: \"Stand firm we are with you: if you are attacked, we will help you, and if you are driven out, we too will go out with you.\" The secret of this intrigue was exposed by Allah Himself, as has been explained in Surah Al-Hashr: 11-17 above.",
        "But in spite of being so exposed the reason why the Holy Prophet (upon whom be Allah's peace) was still treating him kindly was that he had a large band of the hypocrites behind him. Many of the chiefs of both the Aus and the Khazraj were his supporters. At least a third of the population of Madinah consisted of his companions, as became manifest on the occasion of the Battle of Uhud. Under such conditions it was not prudent to wage a war with these internal enemies combined with the external enemies. On this very account, in spite of being fully aware of their hypocrisy the Holy Prophet continued to deal with them according to their apparent profession of faith for a long time. On the other hand, these people too neither possessed the power nor the courage to fight the believers openly as disbelievers, or to join hands with an invader and face them in the battlefield. Apparently, they were a strong hand but inwardly they had the weakness which Allah has vividly portrayed in Surah Al-Hashr: 12-14. Therefore; they thought their well being lay only in posing as Muslims. They came to the mosque, offered the prayers gave away the zakat, and would make tall oral claims to the faith, which the true Muslims never felt the need to do. They would offer a thousand justifications for each of their hypocritical acts by which they would try to deceive their compatriots, the Ansar, into believing that they were with them. By these designs they were not only saving themselves from the disadvantages which could naturally accrue if they separated themselves from the Ansar brotherhood, but also taking advantage of the opportunities to make mischief which were available to them as members of the Muslim brotherhood.",
        "These were the causes which enabled Abdullah bin Ubayy and like minded hypocrites to get an opportunity to accompany the Holy Prophet (upon whom be Allah's peace) in his campaign against the Bani al-Mustaliq, and they simultaneously engineered two great mischiefs which could shatter the Muslim unity to pieces. However, by virtue of the wonderful training in discipline that the Muslim; had received through the pure teaching of the Quran and the companionship of the Holy Prophet (upon whom be peace) both mischiefs were stopped in time, and the hypocrites themselves were disgraced instead. One of these was the mischief that has been mentioned in Surah An-Nur above, and the other which has been mentioned in this Surah.",
        "This incident has been related by Bukhari, Muslim, Ahmad, Nasai, Tirmidhi, Baihaqi, Tabari, Ibn Marduyah, Abdur Razzaq, lbn Jarir Tabari, Ibn Sa'd and Muhammad bin Ishaq through many reliable channels. In some traditions the expedition in which it took place has not been named, and in others it has been connected with the Battle of Tabuk. But the authorities on the battles fought by the Holy Prophet and history are agreed that this incident took place on the occasion of the campaign against the Bani al- Mustaliq. The following seems to he the real story when all the traditions are read together.",
        "When after crushing down the power of Bani al- Mustaliq the Islamic army had made a halt in the settlement at the well of al Muraisi. Suddenly a dispute arose between two men on taking water from the well; One of them was Jehjah bin Masud Ghifari, a servant of Hadrat Umar appointed to lead his horse. The other was Sinan bin Wabar al-Juhani, whose tribe was an ally of a clan of the Khazraj. Harsh words between them led to fighting and Jehjah kicked Sinan, which the Ansar, on account of their ancient Yamanite tradition, took as a great insult and disgrace. At this Sinan called out the men of Ansar and Jehjah the Emigrants for help. Hearing about the quarrel Ibn Ubayy started inciting and calling the men of the Aus and the Khazraj to come out and help their ally. From the other side some Emigrants also came out. The dispute might have led to a fight between the Ansar and the Muhajirin themselves at the very place where they had just fought an enemy tribe jointly and crushing it had halted in its own territory. But hearing the noise the Holy Prophet (upon whom be peace) emerged and said:\"what is this call of paganism? What have you to do with such a call? Leave it, it is a dirty thing.\" Thereupon the leading men of the two sides met and settled the dispute; Sinan pardoned Jehjah and peace was restored.",
        "After this, every person whose heart was disaffected came to Abdullah bin Ubayy and they all said to him, \"Until now we had our hopes attached to you and you were protecting us, but now it seems you have become a helper of these paupers against us. Ibn Ubayy was already enraged: These words made him burst out, thus: \"This is what you have done to yourselves. You have given these people shelter in your country, and have divided your property among them. So much so that they have now become our rivals. Nothing so fits us and the paupers of Quraish(or the Companions of Muhammad) as the ancient saying 'Feed your dog to fatten it and it will devour you.' If you hold back your property from them, they would go elsewhere. By God, when we return to Madinah, the honorable ones will drive out from it the mean ones.\"",
        "Zaid bin Arqam, a young boy, also happened to be present in the assembly at that time. He heard this and mentioned it before his uncle, and his uncle who was one of the Ansar chiefs went to the Holy Prophet (upon whom be peace) and told him the whole story. The Holy Prophet called Zaid and asked him what had happened and he repeated every word of what he had heard. The Holy Prophet said, \"Zaid, you are perhaps displeased with Ibn Ubayy; you might have been mistaken in the hearing; you. might have imagined Ibn Ubayy said this.\" But Zaid was sure and firm. He said, \"No, I swear by God I have heard him say this and that.\" Thereupon the Holy Prophet called Ibn Ubayy, and he came and swore that he had not said any such thing. The people of the Ansar also said \"Sir, a boy says this: he might have been mistaken in what he heard lbn Ubayy is a venerable old man and our chief. Do not believe what a boy says against him.\" The elderly people of the tribe reproved Zaid also, who became depressed and held his peace. But the Holy Prophet knew Zaid as well as Abdullah bin Ubayy. Therefore, he fully understood what had actually happened.",
        "When Hadrat Umar came to know of this, he came to the Holy Prophet and said:\"Please allow me to put this hypocrite to the sword. Or, if you do not think it is fit to give me the permission you may tell Muadh bin Jabal, or Abbad bin Bishr, or Sad bin Mu'adh, or Muhammad bin Maslamah from among the Ansar, to go and kill him.\"But the Holy Prophet said: \"No, the people will say Muhammad kills his own Companions.\" After this he ordered the people to set off immediately, although it was at a time when the Holy Prophet was not accustomed to travel. The forced march continued for 30 hours at a stretch so that the people became exhausted. Then he halted, and as soon as they touched the ground they fell asleep. This he did to distract their minds from what had happened at the well of al-Muraisi. On the way, Hadrat Usaid bin Hudair, an Ansar chief, met the Holy Prophet, and said:\"O Messenger of Allah, today you ordered the people to set off at a time which was disagreeable for traveling, a thing you have never done before.\"The Holy Prophet replied: \"Have you. not heard of what your friend said?\" When he asked who he meant, the Holy Prophet replied: Abdullah bin Ubayy. He asked what he had said. The Holy Prophet answered: \"He has asserted that when he returns to Madinah the honorable ones will drive out from it the mean ones. He answered: \"By God, O Messenger of Allah, you are the honorable one and he is the mean one; you will drive him out whenever you want to.\"",
        "By and by the news spread among the Ansar soldiers and it enraged them against Ibn Ubayy. The people advised him to go to the Holy Prophet (upon whom be Allah's peace) and request for his forgiveness, but he retorted: \"You asked me to believe in him, and I believed in him; you asked me to pay the zakat on my property, and I paid the zakat too; now the only thing left is that I should bow down to Muhammad.\"This further enraged the believing Ansar and everyone' started reproaching and cursing him roughly. When the caravan was about to enter Madinah, Abdullah, the son of Abdullah bin Ubayy, stood before his father with a drawn-out sword and said: \"You had said that when you reached Madinah, the honorable ones would drive out the mean ones. Now, you will know who is honorable you or Allah and His Messenger. By God, you cannot enter Madinah until the Messenger of Allah (upon whom be Allah's peace) permits you to enter.\" At this Ibn Ubayy cried out: \"O people of Khazraj, look, my own son is preventing me from entering Madinah.\" The people conveyed this news to the Holy Prophet, and he said: \"Tell Abdullah to let his father come home.\"Abdullah said, \"If this is the Holy Prophet's order, then you may enter.\"Thereupon the Holy Prophet said to Hadrat Umar: \"Now what do you think, Umar? Had you killed him on the day when you asked my permission to kill him, many people would have trembled with rage. Today if I order them to kill him, they will kill him immediately.\"Hadrat Umar replied \"By God, I realize there was greater wisdom behind what the Apostle of Allah said than what I said.\"'",
        "These were the circumstances under which this Surah was sent down most probably after the Holy Prophet's return to Madinah."
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that declares that God bears witness that the false profession of faith by The Hypocrites is uttered only as a screen to hide their duplicity. It takes its name from its main topic, “the hypocrites” (munāfiqūn). The surah warns the believers about the treachery of the hypocrites and describes their behaviour in some detail. A specific occasion on which the hypocrites tried to stop anyone donating money to believers is described (verse 7 .) and God calls on the Muslims to compensate for this by giving more of their own funds to the needy (verse 9 .).",
    "name_translation": "The Hypocrites",
    "name_complex": "Al-Munâfiqûn",
    "surah_name_ar": "المنافقون",
    "verses": {
        "Albanian": {
            "verse 63:1": "Kur të vijnë te ti hipokritët, ata thonë: “Ne dëshmojmë, se ti, me të vërtetë, je i dërguari i Perëndisë!” – E Perëndia e di, se ti, me siguri, je i dërguari i Tij, por Perëndia dëshmon edhe se hipokritët janë gënjeshtarë të qartë.",
            "verse 63:2": "Ata betimet e tyre i kanë bërë maskë, andaj i kanë penguar (njerëzit) prej rrugës së Perëndisë. – Me të vërtetë, është shëmtim, atë që kanë punuar!",
            "verse 63:3": "Kjo është ngase kanë besuar, pastaj kanë mohuar, e u vulosën zemrat e tyre, prandaj ata nuk kuptojnë.",
            "verse 63:4": "Kur i shikon ata, figura e tyre të mahnitë; e nëse flasin, dëgjon fjalët e tyre, - mirëpo, ata u gjasojnë trungjeve të mbështetura dhe mendojnë se çdo fjalë është kundër tyre. Ata janë armiq të vërtetë, andaj ruajuni prej tyre! – Perëndia i vraftë, si po shmangen prej së vërtetës?!",
            "verse 63:5": "E kur ju thuhet atyre: “Ejani, se i dërguari i Perëndisë do të lutet për t’ju falë”, - ata tundin kokat e tyre dhe i sheh ata që pengojnë, e që janë mendjemëdhenj.",
            "verse 63:6": "Njësoj është – u lute për faljen e tyre apo nuk u lute, Perëndia kurrsesi nuk i falë. Perëndia, me të vërtetë, nuk e udhëzon popullin ngatërrestar.",
            "verse 63:7": "Ata thonë: “Mos u jepni kurrgjë atyre që janë te Profeti i Perëndisë, përderisa të largohen (prej tij)!” Por, Perëndisë i takojnë thesarët në qiej dhe në Tokë, por hipokritët nuk kuptojnë.",
            "verse 63:8": "Ata thonë: “Nëse kthehemi në Medinë, padyshim të fuqishmit do t’i dëbojnë të dobëtit nga ajo (Medina)!” Por, fuqia është e Perëndisë dhe e Profetit të Tij dhe e besimtarëve, mirëpo – hipokritët nuk e dijnë (këtë).",
            "verse 63:9": "O besimtarë, mos t’ju habisin pasuria juaj dhe fëmijët tuaj nga të përmendurit Perëndinë. E ata që bëjnë këtë, do të humbin.",
            "verse 63:10": "Jepni ju prej atyre dhuntive, që u kam dhënë Unë juve, para se t’ju vijë vdekja ndonjërit, e ai të thotë: “O Zoti im, sikur të më kishe lënë edhe një kohë të shkurtër në jetë, do të kisha dhënë lëmoshën dhe do të bëhesha ndër të mirët!”",
            "verse 63:11": "Perëndia nuk i jep afat askujt, kur t’i vijë momenti i vdekjes; e Perëndia di mirë atë që punoni ju."
        },
        "Amharic": {
            "verse 63:1": "መናፍቃን በመጡህ ጊዜ «አንተ የአላህ መልክተኛ መኾንህን በእርግጥ (ምለን) እንመሰክራለን» ይላሉ፡፡ አላህም አንተ በእርግጥ መልክተኛው መኾንህን ያውቃል፡፡ አላህም መናፍቃን (ከልብ እንመሰክራለን በማለታቸው) ውሸታሞች መኾናቸውን ይመሰክራል፡፡",
            "verse 63:2": "መሓሎቻቸውን ጋሻ አድርገው ያዙ፡፡ ከአላህም መንገድ ከለከሉ፡፡ እነርሱ ይሠሩት የነበሩት ነገር ከፋ፡፡",
            "verse 63:3": "ይህ እነርሱ (በምላስ) ያመኑ ከዚያም (በልብ) የካዱ በመኾናቸው ነው፡፡ በልቦቻቸውም ላይ ታተመባቸው፤ ስለዚህ እነርሱ አያውቁም፡፡",
            "verse 63:4": "ባየሃቸውም ጊዜ አካሎቻቸው (ግዙፍነታቸው) ያስደንቁሃል፡፡ ቢናገሩም ለንግግራቸው ታዳምጣለህ፤ (ከዕውቀት ባዶ በመኾን)፡፡ እነርሱ ልክ በግድግዳ የተጠጉ ግንዶችን ይመስላሉ፡፡ ጩኸትን ሁሉ በእነርሱ ላይ ነው ብለው ያስባሉ፡፡ እነርሱ ጠላቶች ናቸውና ተጠንቀቃቸው፡፡ አላህ ይጋደላቸው፤ (ከእምነት) እንዴት ይመለሳሉ!",
            "verse 63:5": "ለእነሱም ፡- «ኑ የአላህ መልክተኛ ለእናንተ ምሕረትን ይለምንላችኋል፤» በተባሉ ጊዜ ራሶቻቸውን ያዞራሉ፡፡ እነርሱም ትዕቢተኞች ኾነው ሲሸሹ ታያቸዋለህ፡፡",
            "verse 63:6": "ምሕረትን ብትለምንላቸው ወይም ምሕረትን ባትለምንላቸው በእነርሱ ላይ እኩል ነው፡፡ አላህ ለእነርሱ በፍጹም አይምርም፡፡ አላህ አመጸኞችን ሕዝቦች አየመራምና፡፡",
            "verse 63:7": "እነርሱ እነዚያ ፡- «አላህ መልክተኛ ዘንድ ላሉት ሰዎች እስከሚበታተኑ ድረስ አትቀልቡ» የሚሉ ናቸው፡፡ የሰማያትና የምድር ድልቦችም የአላህ ናቸው፡፡ ግን መናፍቃን አያውቁም፡፡",
            "verse 63:8": "«ወደ መዲና ብንመለስ አሸናፊው ወራዳውን በእርግጥ ከእርሷ ያወጣል» ይላሉ፡፡ አሸናፊነትም ለአላህ፣ ለመልክተኛውና ለምእምናን ነው፡፡ ግን መናፍቃን አያውቁም፡፡",
            "verse 63:9": "እናንተ ያመናችሁ ሆይ! ገንዘቦቻችሁና ልጆቻችሁ አላህን ከማስታወስ አያታሉዋችሁ፡፡ ይህንንም የሚሠሩ ሰዎች እነዚያ እነርሱ ከሳሪዎች ናቸው፡፡",
            "verse 63:10": "አንዳችሁንም ሞት ሳይመጣውና ጌታዬ ሆይ! እንድመጸውትና ከደጋጐቹም ሰዎች እንድኾን ወደ ጥቂት ጊዜ ብታቆየኝ ኖሮ እመኛለሁ ከማለቱ በፊት ከሰጠናችሁ ሲሳይ ለግሱ፡፡",
            "verse 63:11": "ማንኛይቱም ነፍስ የሞት ጊዜዋ በመጣበት ጊዜ አላህ በፍጹም አያቆያትም፡፡ አላህም በምትሠሩት ሁሉ ውስጠ ዐዋቂ ነው፡፡"
        },
        "Arabic": {
            "verse 63:1": "َنوُبِذاَكَل َنيِقِفاَنُمْلا َّنِإ ُدَهْشَي ُهَّللاَو ُهُلوُسَرَل َكَّنِإ ُمَلْعَي ُهَّللاَو ۗ ِهَّللا ُلوُسَرَل َكَّنِإ ُدَهْشَن اوُلاَق َنوُقِفاَنُمْلا َكَءاَج اَذِإ",
            "verse 63:2": "َنوُلَمْعَي اوُناَك اَم َءاَس ْمُهَّنِإ ۚ ِهَّللا ِليِبَس نَع اوُّدَصَف ًةَّنُج ْمُهَناَمْيَأ اوُذَخَّتا",
            "verse 63:3": "َنوُهَقْفَي اَل ْمُهَف ْمِهِبوُلُق ٰىَلَع َعِبُطَف اوُرَفَك َّمُث اوُنَمآ ْمُهَّنَأِب َكِلَٰذ",
            "verse 63:4": "َنوُكَفْؤُي ٰىَّنَأ ۖ ُهَّللا ُمُهَلَتاَق ۚ ْمُهْرَذْحاَف ُّوُدَعْلا ُمُه ۚ ْمِهْيَلَع ٍةَحْيَص َّلُك َنوُبَسْحَي ۖ ٌةَدَّنَسُّم ٌبُشُخ ْمُهَّنَأَك ۖ ْمِهِلْوَقِل ْعَمْسَت اوُلوُقَي نِإَو ۖ ْمُهُماَسْجَأ َكُبِجْعُت ْمُهَتْيَأَر اَذِإَو ۞",
            "verse 63:5": "َنوُرِبْكَتْسُّم مُهَو َنوُّدُصَي ْمُهَتْيَأَرَو ْمُهَسوُءُر اْوَّوَل ِهَّللا ُلوُسَر ْمُكَل ْرِفْغَتْسَي اْوَلاَعَت ْمُهَل َليِق اَذِإَو",
            "verse 63:6": "َنيِقِساَفْلا َمْوَقْلا يِدْهَي اَل َهَّللا َّنِإ ۚ ْمُهَل ُهَّللا َرِفْغَي نَل ْمُهَل ْرِفْغَتْسَت ْمَل ْمَأ ْمُهَل َتْرَفْغَتْسَأ ْمِهْيَلَع ٌءاَوَس",
            "verse 63:7": "َنوُهَقْفَي اَل َنيِقِفاَنُمْلا َّنِكَٰلَو ِضْرَأْلاَو ِتاَواَمَّسلا ُنِئاَزَخ ِهَّلِلَو ۗ اوُّضَفنَي ٰىَّتَح ِهَّللا ِلوُسَر َدنِع ْنَم ٰىَلَع اوُقِفنُت اَل َنوُلوُقَي َنيِذَّلا ُمُه",
            "verse 63:8": "َنوُمَلْعَي اَل َنيِقِفاَنُمْلا َّنِكَٰلَو َنيِنِمْؤُمْلِلَو ِهِلوُسَرِلَو ُةَّزِعْلا ِهَّلِلَو ۚ َّلَذَأْلا اَهْنِم ُّزَعَأْلا َّنَجِرْخُيَل ِةَنيِدَمْلا ىَلِإ اَنْعَجَّر نِئَل َنوُلوُقَي",
            "verse 63:9": "َنوُرِساَخْلا ُمُه َكِئَٰلوُأَف َكِلَٰذ ْلَعْفَي نَمَو ۚ ِهَّللا ِرْكِذ نَع ْمُكُداَلْوَأ اَلَو ْمُكُلاَوْمَأ ْمُكِهْلُت اَل اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 63:10": "(َنيِحِلاَّصلا َنِّم نُكَأَو َقَّدَّصَأَف ٍبيِرَق ٍلَجَأ ٰىَلِإ يِنَتْرَّخَأ اَلْوَل ِّبَر َلوُقَيَف ُتْوَمْلا ُمُكَدَحَأ َيِتْأَي نَأ ِلْبَق نِّم مُكاَنْقَزَر اَّم نِم اوُقِفنَأَو",
            "verse 63:11": "(َنوُلَمْعَت اَمِب ٌريِبَخ ُهَّللاَو ۚ اَهُلَجَأ َءاَج اَذِإ اًسْفَن ُهَّللا َرِّخَؤُي نَلَو"
        },
        "Azerbaijani": {
            "verse 63:1": "Münafiqlər sənin yanına gəldikləri zaman: “Biz şəhadət veririk ki, sən Allahın Elçisisən!”– deyirlər. Allah da bilir ki, sən Onun Elçisisən. Allah şahiddir ki, münafiqlər əsl yalançıdırlar.",
            "verse 63:2": "Onlar andlarını sipər edib insanları Allah yolundan döndərdilər. Həqiqətən, onların törətdikləri əməllər necə də pisdir!",
            "verse 63:3": "Bu ona görədir ki, onlar iman gətirdikdən sonra kafir oldular. Sonra da onların qəlbinə möhür vuruldu. Artıq onlar anlamırlar.",
            "verse 63:4": "Sən onlara baxdıqda bədən quruluşları xoşuna gəlir, danışanda onların dediklərinə qulaq asırsan. Halbuki, onlar divara söykədilmiş dirəklər kimidirlər. Onlar hər bir səs-küyün özlərinə qarşı olduğunu sanırlar. Onlar düşməndirlər. Sən onlardan çəkin! Allah onları məhv etsin, necə də haqdan döndərilirlər!",
            "verse 63:5": "Onlara: “Gəlin Allahın Elçisi sizin üçün bağışlanma diləsin!”– deyildiyi zaman başlarını yelləyir və sən onların özlərini dartaraq üz döndərdiklərini görürsən.",
            "verse 63:6": "Sən onlar üçün bağışlanma diləsən də, diləməsən də, fərqi yoxdur. Allah onları bağışlamayacaqdır. Şübhəsiz ki, Allah fasiq adamları doğru yola yönəltməz.",
            "verse 63:7": "Məhz onlar: “Allahın Elçisi yanında olanlara bir şey verməyin ki, dağılıb getsinlər!”– deyirlər. Halbuki göylərin və yerin xəzinələri Allahındır, lakin münafiqlər anlamırlar.",
            "verse 63:8": "Onlar: “Əgər biz Mədinəyə qayıtsaq, ən qüdrətlilər (münafiqlər) ən alçaqları (müsəlmanları) mütləq oradan çıxardacaqlar!”– deyirlər. Halbuki qüdrət yalnız Allaha, Onun Elçisinə və möminlərə məxsusdur, lakin bunu münafiqlər bilmirlər.",
            "verse 63:9": "Ey iman gətirənlər! Nə mallarınız, nə də övladlarınız sizi Allahın zikrindən yayındırmasın! Bunu edənlər ziyana uğrayanlardır.",
            "verse 63:10": "Sizlərdən birinə ölüm gəlib: “Ey Rəbbim! Mənə bir az möhlət ver ki, sədəqə verib əməlisalehlərdən olum!”– deməmişdən əvvəl sizə verdiyim ruzidən xərcləyin.",
            "verse 63:11": "Allah əcəli çatmışlara əsla möhlət verməz. Allah sizin nələr etdiyinizdən xəbərdardır."
        },
        "Bengali": {
            "verse 63:1": "মুনাফিকরা আপনার কাছে এসে বলেঃ আমরা সাক্ষ্য দিচ্ছি যে আপনি নিশ্চয়ই আল্লাহর রসূল। আল্লাহ জানেন যে, আপনি অবশ্যই আল্লাহর রসূল এবং আল্লাহ সাক্ষ্য দিচ্ছেন যে, মুনাফিকরা অবশ্যই মিথ্যাবাদী।",
            "verse 63:2": "তারা তাদের শপথসমূহকে ঢালরূপে ব্যবহার করে। অতঃপর তারা আল্লাহর পথে বাধা সৃষ্টি করে। তারা যা করছে, তা খুবই মন্দ।",
            "verse 63:3": "এটা এজন্য যে, তারা বিশ্বাস করার পর পুনরায় কাফের হয়েছে। ফলে তাদের অন্তরে মোহর মেরে দেয়া হয়েছে। অতএব তারা বুঝে না।",
            "verse 63:4": "আপনি যখন তাদেরকে দেখেন, তখন তাদের দেহাবয়ব আপনার কাছে প্রীতিকর মনে হয়। আর যদি তারা কথা বলে, তবে আপনি তাদের কথা শুনেন। তারা প্রাচীরে ঠেকানো কাঠসদৃশ্য। প্রত্যেক শোরগোলকে তারা নিজেদের বিরুদ্ধে মনে করে। তারাই শত্রু, অতএব তাদের সম্পর্কে সতর্ক হোন। ধ্বংস করুন আল্লাহ তাদেরকে। তারা কোথায় বিভ্রান্ত হচ্ছে ?",
            "verse 63:5": "যখন তাদেরকে বলা হয়ঃ তোমরা এস, আল্লাহর রসূল তোমাদের জন্য ক্ষমাপ্রার্থনা করবেন, তখন তারা মাথা ঘুরিয়ে নেয় এবং আপনি তাদেরকে দেখেন যে, তারা অহংকার করে মুখ ফিরিয়ে নেয়।",
            "verse 63:6": "আপনি তাদের জন্যে ক্ষমাপ্রার্থনা করুন অথবা না করুন, উভয়ই সমান। আল্লাহ কখনও তাদেরকে ক্ষমা করবেন না। আল্লাহ পাপাচারী সম্প্রদায়কে পথপ্রদর্শন করেন না।",
            "verse 63:7": "তারাই বলেঃ আল্লাহর রাসূলের সাহচর্যে যারা আছে তাদের জন্যে ব্যয় করো না। পরিণামে তারা আপনা-আপনি সরে যাবে। ভূ ও নভোমন্ডলের ধন-ভান্ডার আল্লাহরই কিন্তু মুনাফিকরা তা বোঝে না।",
            "verse 63:8": "তারাই বলেঃ আমরা যদি মদীনায় প্রত্যাবর্তন করি তবে সেখান থেকে সবল অবশ্যই দুর্বলকে বহিস্কৃত করবে। শক্তি তো আল্লাহ তাঁর রসূল ও মুমিনদেরই কিন্তু মুনাফিকরা তা জানে না।",
            "verse 63:9": "মুমিনগণ! তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি যেন তোমাদেরকে আল্লাহর স্মরণ থেকে গাফেল না করে। যারা এ কারণে গাফেল হয়, তারাই তো ক্ষতিগ্রস্ত।",
            "verse 63:10": "আমি তোমাদেরকে যা দিয়েছি, তা থেকে মৃত্যু আসার আগেই ব্যয় কর। অন্যথায় সে বলবেঃ হে আমার পালনকর্তা, আমাকে আরও কিছুকাল অবকাশ দিলে না কেন? তাহলে আমি সদকা করতাম এবং সৎকর্মীদের অন্তর্ভুক্ত হতাম।",
            "verse 63:11": "প্রত্যেক ব্যক্তির নির্ধারিত সময় যখন উপস্থিত হবে, তখন আল্লাহ কাউকে অবকাশ দেবেন না। তোমরা যা কর, আল্লাহ সে বিষয়ে খবর রাখেন।"
        },
        "Berber Amazigh": {
            "verse 63:1": "Ma usan d $uôek ixabiten, ad ak inin: \"a ncehhed ar keçç, war ccekk, d Amazan n Öebbi\". Öebbi Iéôa ar keçç, war ccekk, d Amazan iS. Öebbi ad Icehhed ar, s tidep, ixabiten d ikeddaben.",
            "verse 63:2": "Ëesben tagallit nnsen d laânaya, d$a ssefôa$en abrid n Öebbi. Ihi, a yicmet wayen xeddmen!",
            "verse 63:3": "Akka, acku llan umnen, sinna, jehlen. Ppusel$en wulawen nnsen, d$a nitni ur mêiûen.",
            "verse 63:4": "Mi ten twalav, a k taâoeb tiddi nnsen. Ma mmeslayen, tessemêasev i wawal nnsen. Amzun nitni d is$aôen i isenden, $ilen yal ti$ôi fellasen. Acengu, d nitni; êader iman ik segsen. A ten Ine$ Öebbi! Acêal wexxôen!",
            "verse 63:5": "Ma nnan asen: \"yyaw, ad issuter Umazan n Öebbi a ppeppusemmêem\", ad bernen iqweôôa nnsen, a ten twaliv wexxôen s tem$weô.",
            "verse 63:6": "Iâuva fellasen tessutrev, ne$ ur tessutrev ad ppusemmêen. Ur sen Ipsemmiê Öebbi, d awez$i. Öebbi, s tidep, ur Inehhu agdud iballa$en.",
            "verse 63:7": "Nitni i iqqaôen: \"ur pseddiqet, i wid iddan akked Umazan n Öebbi, alamma mmebruzzâen\". N Öebbi igerrujen igenwan akked tmurt, maca ixabiten ur mêiûen.",
            "verse 63:8": "Qqaôen: \"ma nu$al ar Lmadina, war ccekk, uzmir ad issuffe$, segs, uôhif\". Tazmert, n Öebbi akked Umazan iS, akked lmumnin, maca, ixabiten ur éôin.",
            "verse 63:9": "A wid iumnen! £uôwat a kwen ssbaâden, af usmekti n Öebbi, wayla nnwen akked tarwa nnwen! Wid igan akka, ihi, widak d imexsuôen.",
            "verse 63:10": "Ssedqet seg wayen i wen Nefka, uqbel a d tas tmeppant ar yiwen degwen, ad yini: \"a Mass iw! Lemmer ad iyi Teswexxôev ar lajel aqôib, ad seddqe$, ad ili$ seg wid imaânen\".",
            "verse 63:11": "Ur Irennu Öebbi di laâmeô, d awez$i, ma iusa d lajel is. Öebbi Ippuxebbeô $ef wayen txeddmem."
        },
        "Bosnian": {
            "verse 63:1": "Kad ti licemjeri dolaze, oni govore: \"Mi tvrdimo da si ti, zaista, Allahov poslanik!\" – I Allah zna da si ti, zaista, Njegov poslanik, a Allah tvrdi i da su licemjeri pravi lašci.",
            "verse 63:2": "Oni se iza zakletvi svojih zaklanjaju, pa od Allahova puta odvraćaju. Ružno je, doista, kako postupaju!",
            "verse 63:3": "To je zato što su vjernici bili, pa nevjernici postali, i onda su im srca zapečaćena, pa ne shvaćaju.",
            "verse 63:4": "Kad ih pogledaš, njihov izgled te ushićuje; a kad progovore, ti slušaš riječi njihove, međutim, oni su kao šuplji naslonjeni balvani, i misle da je svaki povik protiv njih. Oni su pravi neprijatelji, pa ih se pričuvaj! Allah ih ubio, kuda se odmeću?!",
            "verse 63:5": "A kad im se rekne: \"Dođite, Allahov Poslanik će moliti da vam se oprosti\" – oni glavama svojim tresu i vidiš ih kako nadmeno odbijaju.",
            "verse 63:6": "Isto im je – molio ti oprosta za njih ili ne molio, Allah im, zaista, neće oprostiti, Allah, doista, narodu nevjerničkom neće na Pravi put ukazati.",
            "verse 63:7": "Oni govore: \"Ne udjeljujte ništa onima koji su uz Allahova Poslanika, da bi ga napustili!\" A blaga nebesa i Zemlje su Allahova, ali licemjeri neće da shvate.",
            "verse 63:8": "Oni govore: \"Ako se vratimo u Medinu, sigurno će jači istjerati iz nje slabijeg!\" A snaga je u Allaha i Poslanika Njegova i u vjernīkā, ali licemjeri neće da znaju.",
            "verse 63:9": "O vjernici, neka vas imanja vaša i djeca vaša ne zabave od sjećanja na Allaha. A oni koji to učine, biće izgubljeni.",
            "verse 63:10": "I od onoga čime vas Mi opskrbljujemo udjeljujte prije nego nekom od vas smrt dođe, pa da onda rekne: \"Gospodaru moj, da me još samo kratko vrijeme zadržiš, pa da milostinju udjeljujem i da dobar budem!\"",
            "verse 63:11": "Allah, sigurno, neće ostaviti u životu nikoga kome smrtni čas njegov dođe; a Allah dobro zna ono što vi radite."
        },
        "Bulgarian": {
            "verse 63:1": "Когато идват при теб, лицемерите казват: “Свидетели сме, че ти си Пратеника на Аллах.” Аллах знае, че ти си Неговият Пратеник. Аллах е свидетел, че лицемерите са лъжци.",
            "verse 63:2": "Те превръщат клетвите си в прикритие и възпират от пътя на Аллах. Лоши са делата им!",
            "verse 63:3": "Така е, защото повярваха, после станаха неверници, затова бяха запечатани сърцата им, та не разбират.",
            "verse 63:4": "И като ги гледаш, видът им ти харесва, и като говорят, вслушваш се в думите им. Те са като подпрени дървета. Смятат, че всеки вик е против тях. Те са врагът. Пази се от тях! Да ги порази Аллах, как така се подлъгват!",
            "verse 63:5": "И когато им се каже: “Елате Пратеника на Аллах да моли за вас опрощение!”, те извръщат глави и ги виждаш как надменно се отказват.",
            "verse 63:6": "Все едно е дали ще молиш опрощение за тях, или не ще молиш. Аллах не ще им опрости. Аллах не напътва нечестивите хора.",
            "verse 63:7": "Те са, които казват: “Не харчете за онези, които са при Пратеника на Аллах, за да се разотидат!” Но на Аллах принадлежат съкровищниците на небесата и на земята. Ала лицемерите не проумяват.",
            "verse 63:8": "Казват: “Щом се върнем в ал-Медина, по-могъщият там непременно ще пропъди по-слабия.” А могъществото принадлежи на Аллах и на Неговия Пратеник, и на вярващите. Ала лицемерите не разбират.",
            "verse 63:9": "О, вярващи, да не ви отвличат от споменаването на Аллах нито вашите имоти, нито вашите деца! А които сторват това, те са губещите.",
            "verse 63:10": "И раздавайте от онова, което ви дарихме за препитание, преди да е дошла при някого от вас смъртта и той да каже: “Господи, да би ми дал малко време, щях да раздавам милостиня и да бъда от праведните!”",
            "verse 63:11": "Но Аллах на никого не ще даде отсрочка, щом му дойде времето. Сведущ е Аллах за вашите дела."
        },
        "Chinese": {
            "verse 63:1": "当伪信者来见你的时候，他们说：我们作证，你确是真主的使者。真主知道你确是他的使者，真主作证，伪信的人们确是说谎的。",
            "verse 63:2": "他们以自己的盟誓为护符，妨碍主道。他们的行为真恶劣！",
            "verse 63:3": "这是因为他们口称信道，心实不信，他们的心就封闭了，故他们不是明理的。",
            "verse 63:4": "当你看见他们的时候，他们的体格，将使你赞叹。如果他们说话，你就静听他们的言辞，他们好像木偶样，他们以为一切呐喊，都是对他们而发的。他们确是敌人，故你当谨防他们。愿真主诛灭他们！他们是如何悖谬的呢！",
            "verse 63:5": "有人对他们说：你们来道歉吧，使者将为你们求饯。他们却掉头不顾，你看他们妄自尊大，不肯道歉。",
            "verse 63:6": "你为他们求饯与否，这在他们，是一样的。真主绝不赦宥他们，真主必定不引导悖逆的民众。",
            "verse 63:7": "他们说：你们不要供给使者左右的人，以便他们离散。天地的库藏，只是真主，伪信的人们却不明理。",
            "verse 63:8": "他们说：如果我们返回麦地那，尊荣者必将卑贱者驱逐出城。尊荣只是真主和使者以及信士们的，而伪信的人们却不知道！",
            "verse 63:9": "信道的人们啊！你们的财产和子女，不要使你们忽略了记念真主。谁那样做，谁是亏折的。",
            "verse 63:10": "在死亡降临之前，你们当分舍我赐予你们的，否则，将来人人说：我的主啊！你为何不让我延迟到一个临近的定期，以便我有所施舍，而成为善人呢？",
            "verse 63:11": "但寿限一到，真主绝不让任何人延迟，真主是彻知你们的行为的。"
        },
        "Danish": {
            "verse 63:1": "Wanneer de huichelaars tot u komen, zeggen zij: Wij getuigen dat gij inderdaad de boodschapper van Allah zijt. Allah weet dat gij Zijn boodschapper zijt, en Allah getuigt dat de huichelaars inderdaad leugenaars zijn",
            "verse 63:2": "Zij hebben hun eden tot een schild gemaakt; zo leiden zij mensen van Allah`s weg af. Hetgeen zij doen is zeker slecht",
            "verse 63:3": "Dat is omdat zij het geloof omhelsden en daarna verwierpen. Derhalve is een zegel op hun hart gedrukt en zij begrijpen niet (meer)",
            "verse 63:4": "En wanneer gij hen ziet, behaagt hun uterlijk u en indien zij spreken luistert gij naar hen. Zij lijken op aangeklede stukken hout. Zij denken dat ieder gerucht tegen hen is. Zij zijn (uw) vijanden, neemt u daarom voor hen in acht. Allah`s vloek zij over hen! Hoe ver zijn zij afgewend (van de Waarheid)",
            "verse 63:5": "En wanneer er tot hen wordt gezegd: Komt, de boodschapper van Allah zal voor u om vergiffenis vragen, dan wenden zij hun hoofd af en gij ziet hen zich hoogmoedig terugtrekken",
            "verse 63:6": "Het is hetzelfde of gij wel of niet voor hen om vergiffenis vraagt, Allah zal hen stellig niet vergeven. Voorzeker, Allah leidt het opstandige volk niet",
            "verse 63:7": "Zij zijn het die zeggen, Besteedt niets voor degenen die met de boodschapper van Allah zijn zodat deze weglopen- terwijl aan Allah de schatten der hemelen en der aarde behoren; doch de huichelaars begrijpen dit niet",
            "verse 63:8": "Zij zeggen: Als wij naar Madinah terugkeren zal de aanzienlijkste er zeker de minste uitdrijven; maar eer behoort aan Allah, Zijn boodschapper en de gelovigen; de huichelaars echter weten het niet",
            "verse 63:9": "O, gij die gelooft, laat uw rijkdommen en uw kinderen u niet afleiden van de gedachtenis aan Allah. En wie dat doet behoort tot de verliezers",
            "verse 63:10": "En besteedt uit datgene waarvan Wij u voorzien hebben voordat de dood één uwer overvalt en deze zegt: Mijn Heer! Waarom hebt Gij mij niet voor een wijle uitstel verleend, opdat ik aalmoezen zou kunnen geven en tot de rechtvaardigen behoren",
            "verse 63:11": "En Allah geeft niemand uitstel wanneer zijn tijd is gekomen; en Allah is volkomen op de hoogte van hetgeen gij doet"
        },
        "Dutch": {
            "verse 63:1": "Wanneer de huichelaars tot jou komen, dan zeggen zij: \"Wij getuigen dat jij zeker de Boodschapper van Allah bent.\" En Allah weet dat jij zeker Zijn Boodschapper bent en Allah getuigt dat de huichelaars zeker leugenaars zijn.",
            "verse 63:2": "Zij hebben hun eden tot een schild gemaakt en zij houden af van de Weg van Allah. Voorwaar, slecht is het wat zij plachten te doen.",
            "verse 63:3": "Dat is omdat zij geloofden en daarna ongelovig werden, waarna hun harten verzegeld werden, zodat zij niet begrijpen.",
            "verse 63:4": "En wanneer jij hen ziet, wekken hun lichamen (hun uiterlijk vertoon) jouw verwondering op; en wanneer zij spreken, dan luister jij naar hun woorden. Zij zijn als balken die gestut worden. Zij denken dat elke schreeuw tot hen gericht is. Zij zijn de vijanden, kijk daarom uit voor hen. Allah vervloekt hen. Hoe kunnen zij misleid worden?",
            "verse 63:5": "En als tot hen gezegd wordt: \"Komt, dan zal de Boodschapper van Allah vergeving voor jullie vragen,\" dan buigen zij hun hoofden en zie jij hen (de verkondiging) tegenhouden, terwijl zij hoogmoedig zijn.",
            "verse 63:6": "Het is voor hen hetzelfde of jij voor hen vergeving vraagt, of dat jij geen vergeving voor hen vraagt: Allah zal hen nooit vergeven. Voorwaar, Allah leidt het zwaar zondige volk niet.",
            "verse 63:7": "Zij zijn degenen die zeggen: \"Geeft geen bijdragen aan hen die met de Boodschapper van Allah zijn, zodat zij weglopen (van de Profeet.)\" Aan Allah behoren de schatten van de hemelen en de aarde, maar de huichelaars begrijpen het niet",
            "verse 63:8": "Zij zeggen: \"Als wij naar Medinah terugkeren, dan zal het sterke zeker het zwakke daaruit verdrijven.\" En alle macht behoort aan Allah en aan Zijn Boodschapper en aan de gelovigen, maar de huichelaars weten het niet.",
            "verse 63:9": "O jullie die geloven, laat jullie bezittingen en jullie kinderen jullie niet afleiden van het gedenken van Allah. En wie dat doen: zij zijn degenen die de verliezers zijn.",
            "verse 63:10": "En geeft bijdragen van waar Wij jullie mee voorzien hebben, voordat de dood tot een van jullie komt, en deze dan zal zeggen: \"Mijn Heer, Had U mij maar een korte tijd uitstel gegeven, dan zou ik uitgeven aan liefdadigheid en tot de rechtschapenen behoren.\"",
            "verse 63:11": "Maar Allah geeft geen ziel ooit uitstel als haar tijd is gekomen. En Allah is Alwetend over wat jullie doen."
        },
        "English": {
            "verse 63:1": "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars.",
            "verse 63:2": "They have taken their oaths as a cover, so they averted [people] from the way of Allah. Indeed, it was evil that they were doing.",
            "verse 63:3": "That is because they believed, and then they disbelieved; so their hearts were sealed over, and they do not understand.",
            "verse 63:4": "And when you see them, their forms please you, and if they speak, you listen to their speech. [They are] as if they were pieces of wood propped up - they think that every shout is against them. They are the enemy, so beware of them. May Allah destroy them; how are they deluded?",
            "verse 63:5": "And when it is said to them, \"Come, the Messenger of Allah will ask forgiveness for you,\" they turn their heads aside and you see them evading while they are arrogant.",
            "verse 63:6": "It is all the same for them whether you ask forgiveness for them or do not ask forgiveness for them; never will Allah forgive them. Indeed, Allah does not guide the defiantly disobedient people.",
            "verse 63:7": "They are the ones who say, \"Do not spend on those who are with the Messenger of Allah until they disband.\" And to Allah belongs the depositories of the heavens and the earth, but the hypocrites do not understand.",
            "verse 63:8": "They say, \"If we return to al-Madinah, the more honored [for power] will surely expel therefrom the more humble.\" And to Allah belongs [all] honor, and to His Messenger, and to the believers, but the hypocrites do not know.",
            "verse 63:9": "O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers.",
            "verse 63:10": "And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, \"My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.\"",
            "verse 63:11": "But never will Allah delay a soul when its time has come. And Allah is Acquainted with what you do."
        },
        "Filipino": {
            "verse 63:1": "Kung ang mga mapagkunwari ay nagsisilapit sa iyo (O Muhammad), sila ay nagsasabi: “Kami ay nagpapatotoo na tunay ngang ikaw ay Tagapagbalita ni Allah.” Katotohanang si Allah ang nakakaalam na ikaw ay tunay Niyang Tagapagbalita, at si Allah ang nagpapatotoo na ang mga mapagkunwari ay katotohanang mga sinungaling",
            "verse 63:2": "Kanilang ginawa ang kanilang mga panunumpa (pangako) bilang isang pangubli (ng kanilang mga pagkukunwari); kaya’t kanilang hinahadlangan (ang mga tao) tungo sa Landas ni Allah. Katotohanan, ang kanilang mga gawa ay kasamaan",
            "verse 63:3": "Ito’y sa dahilang sila ay nagsisampalataya, at 882 muli ay nagtakwil sa pananampalataya, kaya’t ang kanilang puso ay natakpan, at sa gayon sila ay hindi nakakaunawa",
            "verse 63:4": "Kung pagmamasdan mo sila, ang kanilang panglabas na katawanaynakakaakitsaiyo, atkungsilaaynagsisipangusap, ikaw ay nakikinig sa kanilang mga salita. Sila ay mga walang halaga na tulad ng kahoy (na walang laman sa loob) na (hindi makakatayo sa kanilang sarili). Sila ay nag-aakala na ang bawat panambitan ay laban sa kanila. Sila ay mga kaaway, kaya’t magsipag-ingat sa kanila. Ang kaparusahan (at poot) ni Allah ay mapapasakanila. Paano sila nagtatwa (o napaligaw) sa katotohanan",
            "verse 63:5": "At kung ipinangungusap sa kanila: “Halina kayo, upang ang Tagapagbalita ni Allah ay manalangin tungo sa inyong kapatawaran mula kay Allah”, ay kanilang ibinabaling ang kanilang ulo at inyong mapagmamasdan sila na tumatalikod na ang kanilang mukha ay tigib ng pagmamataas",
            "verse 63:6": "Ito ay magkatulad sa kanila kahit na sila ay iyong ipagdasal (o Muhammad) tungo sa kanilang kapatawaran o hindi ka humingi sa kanilang kapatawaran. Katotohanang si Allah ay hindi namamatnubay sa mga tao na Fasiqun (mapaghimagsik at palasuway kay Allah)",
            "verse 63:7": "Sila ang mga nagsasabi: “Huwag kayong gumugol ng anuman sa mga tao na kapanalig ng Tagapagbalita ni Allah, hanggang sa siya ay iwanan nila.” At si Allah ang nag- aangkin ng mga kayamanan ng kalangitan at kalupaan, datapuwa’t ang mga mapagkunwari ay hindi nakakaunawa",
            "verse 63:8": "Sila na (mga mapagkunwari) ay nagsasabi: “Kung kami ay babalik sa Al-Madinah, katotohanan, ang higit na kapita- pitagan (Abdullah Bin Ubaiy Bin Salul), ang pinuno ng mga mapagkunwari sa Al-Madinah ay makapagpapaalis sa mababa (alalaong baga, ang Tagapagbalita ni Allah). Datapuwa’t ang karangalan ay nalalaan kay Allah at sa Kanyang Tagapagbalita at sa mga sumasampalataya, subalit ang mga mapagkunwari ay hindi nakakabatid",
            "verse 63:9": "O kayong nagsisisampalataya! Huwag ninyong hayaan na ang inyong mga kayamanan at ang inyong mga anak ay makahadlang sa inyo upang alalahaning lagi si Allah. At kung sinuman ang gumawa ng gayon, sila ang mga talunan",
            "verse 63:10": "At gumugol kayo ng halaga (sa kawanggawa) mula sa mga biyaya na Aming ipinagkaloob sa inyo, bago sumapit ang kamatayan sa sinuman sa inyo at siya ay magsabi: “o aking Panginoon! Kung ako ay bibigyan lamang Ninyo ng kaunting panahon na makabalik (sa buhay sa mundong ito), kung gayon, ako ay magkakaloob ng Sadaqa (alalaong baga, ng Zakah,- katungkulang kawanggawa), mula sa aking kayamanan, at nang ako ay maging isa sa mga mapaggawa ng kabutihan (alalaong baga, ang makapagsagawa ng Hajj, - Pilgrimahe sa Makkah)",
            "verse 63:11": "Datapuwa’t walang sinumang kaluluwa ang pagkakalooban ni Allah ng palugit kung ang itinakdang panahon (kamatayan) ay sumapit na sa kanya. At si Allah ang Lubos na Nakakaalam ng lahat ninyong ginagawa"
        },
        "French": {
            "verse 63:1": "Quand les hypocrites viennent à toi, ils disent: «Nous attestons que tu es certes le Messager d'Allah» Allah sait que tu es vraiment Son messager; et Allah atteste que les hypocrites sont assurément des menteurs.",
            "verse 63:2": "Ils prennent leurs serments pour bouclier et obstruent le chemin d'Allah. Quelles mauvaises choses que ce qu'ils faisaient!",
            "verse 63:3": "C'est parce qu'en vérité ils ont cru, puis rejeté la foi. Leurs cœurs donc, ont été scellés, de sorte qu'ils ne comprennent rien.",
            "verse 63:4": "Et quand tu les vois, leurs corps t'émerveillent; et s'ils parlent tu écoutes leur parole. Ils sont comme des bûches appuyées (contre des murs) et ils pensent que chaque cri est dirigé contre eux. L'ennemi c'est eux. Prends y garde. Qu'Allah les extermine! Comme les voilà détournés (du droit chemin).",
            "verse 63:5": "Et quand on leur dit: «Venez que le Messager d'Allah implore le pardon pour vous», ils détournent leurs têtes, et tu les vois se détourner tandis qu'ils s'enflent d'orgueil.",
            "verse 63:6": "C'est égal, pour eux, que tu implores le pardon pour eux ou que tu ne le fasses pas: Allah ne leur pardonnera jamais, car Allah ne guide pas les gens pervers.",
            "verse 63:7": "Ce sont eux qui disent: «Ne dépensez point pour ceux qui sont auprès du Messager d'Allah, afin qu'ils se dispersent». Et c'est à Allah qu'appartiennent les trésors des cieux et de la terre, mais les hypocrites ne comprennent pas.",
            "verse 63:8": "Ils disent: «Si nous retournons à Médine, le plus puissant en fera assurément sortir le plus humble». Or c'est à Allah qu'est la puissance ainsi qu'à Son messager et aux croyants. Mais les hypocrites ne le savent pas.",
            "verse 63:9": "O vous qui avez cru! Que ni vos biens ni vos enfants ne vous distraient du rappel d'Allah. Et quiconque fait cela... alors ceux-là seront les perdants.",
            "verse 63:10": "Et dépensez de ce que Nous vous avons octroyé avant que la mort ne vienne à l'un de vous et qu'il dise alors: «Seigneur! si seulement Tu m'accordais un court délai: je ferais l'aumône et serais parmi les gens de bien».",
            "verse 63:11": "Allah cependant n'accorde jamais de délai à une âme dont le terme est arrivé. Et Allah est Parfaitement Connaisseur de ce que vous faites."
        },
        "Fulah": {
            "verse 63:1": "Si naafiqiiɓe ɓen arii e maa, ɓe wi`a: \"Meɗen seedii wonnde ko a Nulaaɗo Allah\". Allah no anndi wonnde pellet, ko a Nulaaɗo Makko; Allah no seedii wonnde pellet, naafiqiiɓe ɓen ko fenooɓe",
            "verse 63:2": "Ɓe jogitorri goondooje maɓɓe ɗen heedo, ɓe sakkii laawol Allah ngol. Pellet, fii ko ɓe gollaynoo kon bonii",
            "verse 63:3": "Ɗum non ko tawde ɓe gomɗinii, refti ɓe yeddi, ɓerɗe maɓɓe ɗen notaa e mun; kamɓe on ɓe faamataa",
            "verse 63:4": "Si a yi`ii ɓe, ɓalli maɓɓe welete; si ɓe wowlii, a heɗoto konnguɗi maɓɓe ɗin. Hiɓe wa’i wa pecce ɓaaraaɗe, hiɓe sikka kala eewnaango ko e hoore maɓɓe. Ko ɓen tigi woni añɓe ɓen, reenoɓe. Allah huɗii ɓe ! Ko honno ɓe yiiltiratool (e goonga)",
            "verse 63:5": "Si ɓe wi`anaama: \"Aree Nulaaɗo Allah on insinanoo on\", ɓe hayla ko`e maɓɓe ɗen, yi`aa hiɓe ɗuurnoo hara ko ɓe townitiiɓe",
            "verse 63:6": "Hino fota e maɓɓe, foti a insinani ɓe maa hara a insinanaaki ɓe: Allah yaafotaako ɓe fes, pellet, Allah fewnataa yimɓe faasiqiiɓe ɓen",
            "verse 63:7": "Ko ɓeen woni wi*ooɓe wote nafqee wonɓe e sera Nelaaɗà haa ɓe ceerta na woodani Alla moftirɗi kammuuli e leydi kono tan naafiqeeɓe ɓe paamatah",
            "verse 63:8": "Hoɓe wi*a si en ruttiima Madiina ma ɓurɓe teddude yaltin ɓurɓe hoyde ɓe, woodanii Alla teddungal e nelaaɗo makko e goonɗinɓe ɓe, kono tan naafige en nganndah",
            "verse 63:9": "Eehey mon goonɗinɓe woto sokli mon jawle mon e ɓiɓɓe mon gaa e innude Alla kala baɗɗo ɗuum ko ɓeen ngoni pertuɓe ɓe",
            "verse 63:10": "Nafqe ko Alla arsakini on ko, ko adii nde maayde arata e gooto e mon o wiya joom am A leelnantaa kam haa e happu ɓadiiɗo mi sakkoro mi wona e moƴƴuɓe",
            "verse 63:11": "Alla neemnantah hay fittaandu wooturu si happu manndu arii Alla na humpatii ko golloton ko"
        },
        "German": {
            "verse 63:1": "Wenn die Heuchler zu dir kommen, sagen sie: \"Wir bezeugen, daß du wahrlich Allahs Gesandter bist\". Allah weiß, daß du fürwahr Sein Gesandter bist; doch Allah bezeugt, daß die Heuchler wahrlich lügen.",
            "verse 63:2": "Sie haben sich ihre Eide zu einem Schutzschirm genommen und halten so von Allahs Weg ab. Gewiß, wie böse ist, was sie zu tun pflegen.",
            "verse 63:3": "Dies, weil sie (zuerst) gläubig gewesen, hierauf aber ungläubig geworden sind. Da wurden ihre Herzen versiegelt; so verstehen sie nicht.",
            "verse 63:4": "Und wenn du sie siehst, gefällt dir ihr Äußeres, und wenn sie reden, hörst du ihren Worten zu. Sie sind wie angelehnte Hölzer. Sie meinen, jeder Schrei sei gegen sie. Sie sind die (wahren) Feinde; so sieh dich vor ihnen vor. Allah bekämpfe sie! Wie sie sich (doch) abwendig machen lassen!",
            "verse 63:5": "Und wenn zu ihnen gesagt wird: \"Kommt her, damit Allahs Gesandter für euch um Vergebung bittet\", drehen sie ihre Köpfe zur Seite, und du siehst sie sich hochmütig abwenden.",
            "verse 63:6": "Gleich ist es in Bezug auf sie, ob du für sie um Vergebung bittest oder nicht bittest; Allah wird ihnen nicht vergeben. Gewiß, Allah leitet das Volk der Frevler nicht recht.",
            "verse 63:7": "Sie sind es, die sagen: \"Gebt nicht aus für diejenigen, die bei Allahs Gesandtem sind, bis sie (von ihm weg) auseinander (und davon)laufen.\" Doch Allah gehören die Schatzkammern der Himmel und der Erde. Aber die Heuchler verstehen nicht.",
            "verse 63:8": "Sie sagen: \"Wenn wir nach al-Madina zurückkehren, so wird ganz gewiß der Mächtigere den Niedrigeren aus ihr vertreiben.\" Doch Allah gehört die Macht, und auch Seinem Gesandten und den Gläubigen. Aber die Heuchler wissen nicht.",
            "verse 63:9": "O die ihr glaubt, nicht ablenken sollen euch euer Besitz und eure Kinder von Allahs Gedenken. Diejenigen, die dies tun, das sind die Verlierer.",
            "verse 63:10": "Und gebt aus von dem, womit Wir euch versorgt haben, bevor zu einem von euch der Tod kommt und er dann sagt: \"Mein Herr, würdest Du mich doch auf eine kurze Frist zurückstellen! Dann würde ich Almosen geben und zu den Rechtschaffenen gehören.\"",
            "verse 63:11": "Allah wird aber keine Seele zurückstellen, wenn ihre Frist kommt. Und Allah ist Kundig dessen, was ihr tut."
        },
        "Hausa": {
            "verse 63:1": "Idan munãfukai suka jẽ maka suka ce: \"Munẽ shaidar lalle kai haƙĩƙa Manzon Allah ne,\" Kuma Allah Yanã sane da lalle Kai, haƙĩƙa ManzonSa ne, kuma Allah Yanã shaida lalle munafukan haƙĩƙa, maƙaryata ne.",
            "verse 63:2": "Sun riƙi rantsuwõwinsu garkuwa, sai suka taushe daga tafarkin Allah. Lalle sũ abin da suka kasance sunã aikatãwa ya mũnana.",
            "verse 63:3": "Wancan, dõmin lalle sũ, sun yi ĩmãni, sa'an nan kuma suka kãfirta, sai aka yunƙe a kan zukãtansu. Sabõda sũ, bã su fahimta.",
            "verse 63:4": "Kuma idan kã gan su, sai jikunansu su bã ka sha'awa kuma idan sun faɗa, zã ka saurãra ga maganarsu. Kamar dai sũ ƙyami ne wanda aka jingine. Sunã zaton kõwace tsãwa a kansu take. Sũ ne maƙiyan, sai ka yi saunarsu. Allah Yã la'ane su. Yãya ake karkatar da su?",
            "verse 63:5": "Kuma idan aka ce musu \"Ku zo Manzon Allah ya nẽma maku gãfara,\" Sai su gyãɗa kãwunansu, kuma ka gan su sunã kangẽwa, alhãli kuwa sunã mãsu girman kai.",
            "verse 63:6": "Daidai ne a kansu, kã nẽma musu gãfara kõ ba ka nẽmamusu ba. faufau Allah bã zai gãfarta musu ba. Lalle Allah, bã zai shiryar da mutãne fãsiƙai ba.",
            "verse 63:7": "Sũ ne waɗanda ke cẽwa \"Kada ku ciyar a kan wanda ke wurin Manzon Allah har su wãtse,\" alhali kuwa taskõkin sammai da ƙasa ga Allah suke kuma amma munãfukai bã su fahimta.",
            "verse 63:8": "Sunã cẽwa \"Lalle ne idan mun kõma zuwa Madĩnar, haƙĩƙa mafi rinjaya zai fitar da mafi ƙasƙanta daga gare ta, alhãli kuwa rinjãyar ga Allah take kuma da ManzonSa, kuma da mũminai, kuma amma munãfikai ba su sani ba.\"",
            "verse 63:9": "Ya ku waɗanda suka yi ĩmãni! Kada dũkiyõyinku da ɗiyanku su shagaltar da ku daga ambaton Allah. Kuma wanda ya yi haka, to, waɗannan sũ ne mãsu hasãra.",
            "verse 63:10": "Kuma ku ciyar daga abin da Muka azurta ku daga gãbanin mutuwa ta je wa ɗayanku har ya ce: \"Yã Ubangijina! Don me ba Ka yi mini jinkiri ba zuwa ga wani ajali makusanci dõmin in gaskata kuma in kasance daga sãlihai?\"",
            "verse 63:11": "Kuma Allah bã zai jinkirta wa wani rai ba idan ajalinsa ya je. Kuma Allah Masani ne ga abin da suke aikatãwa."
        },
        "Hindi": {
            "verse 63:1": "(ऐ रसूल) जब तुम्हारे पास मुनाफेक़ीन आते हैं तो कहते हैं कि हम तो इक़रार करते हैं कि आप यक़नीन ख़ुदा के रसूल हैं और ख़ुदा भी जानता है तुम यक़ीनी उसके रसूल हो मगर ख़ुदा ज़ाहिर किए देता है कि ये लोग अपने (एतक़ाद के लिहाज़ से) ज़रूर झूठे हैं",
            "verse 63:2": "इन लोगों ने अपनी क़समों को सिपर बना रखा है तो (इसी के ज़रिए से) लोगों को ख़ुदा की राह से रोकते हैं बेशक ये लोग जो काम करते हैं बुरे हैं",
            "verse 63:3": "इस सबब से कि (ज़ाहिर में) ईमान लाए फिर काफ़िर हो गए, तो उनके दिलों पर (गोया) मोहर लगा दी गयी है तो अब ये समझते ही नहीं",
            "verse 63:4": "और जब तुम उनको देखोगे तो तनासुबे आज़ा की वजह से उनका क़द व क़ामत तुम्हें बहुत अच्छा मालूम होगा और गुफ्तगू करेंगे तो ऐसी कि तुम तवज्जो से सुनो (मगर अक्ल से ख़ाली) गोया दीवारों से लगायी हुयीं बेकार लकड़ियाँ हैं हर चीख़ की आवाज़ को समझते हैं कि उन्हीं पर आ पड़ी ये लोग तुम्हारे दुश्मन हैं तुम उनसे बचे रहो ख़ुदा इन्हें मार डाले ये कहाँ बहके फिरते हैं",
            "verse 63:5": "और जब उनसे कहा जाता है कि आओ रसूलअल्लाह तुम्हारे वास्ते मग़फेरत की दुआ करें तो वह लोग अपने सर फेर लेते हैं और तुम उनको देखोगे कि तकब्बुर करते हुए मुँह फेर लेते हैं",
            "verse 63:6": "तो तुम उनकी मग़फेरत की दुआ माँगो या न माँगो उनके हक़ में बराबर है (क्यों कि) ख़ुदा तो उन्हें हरगिज़ बख्शेगा नहीं ख़ुदा तो हरगिज़ बदकारों को मंज़िले मक़सूद तक नहीं पहुँचाया करता",
            "verse 63:7": "ये वही लोग तो हैं जो (अन्सार से) कहते हैं कि जो (मुहाजिरीन) रसूले ख़ुदा के पास रहते हैं उन पर ख़र्च न करो यहाँ तक कि ये लोग ख़ुद तितर बितर हो जाएँ हालॉकि सारे आसमान और ज़मीन के ख़ज़ाने ख़ुदा ही के पास हैं मगर मुनाफेक़ीन नहीं समझते",
            "verse 63:8": "ये लोग तो कहते हैं कि अगर हम लौट कर मदीने पहुँचे तो इज्ज़दार लोग (ख़ुद) ज़लील (रसूल) को ज़रूर निकाल बाहर कर देंगे हालॉकि इज्ज़त तो ख़ास ख़ुदा और उसके रसूल और मोमिनीन के लिए है मगर मुनाफेक़ीन नहीं जानते",
            "verse 63:9": "ऐ ईमानदारों तुम्हारे माल और तुम्हारी औलाद तुमको ख़ुदा की याद से ग़ाफिल न करे और जो ऐसा करेगा तो वही लोग घाटे में रहेंगे",
            "verse 63:10": "और हमने जो कुछ तुम्हें दिया है उसमें से क़ब्ल इसके (ख़ुदा की राह में) ख़र्च कर डालो कि तुममें से किसी की मौत आ जाए तो (इसकी नौबत न आए कि) कहने लगे कि परवरदिगार तूने मुझे थोड़ी सी मोहलत और क्यों न दी ताकि ख़ैरात करता और नेकीकारों से हो जाता",
            "verse 63:11": "और जब किसी की मौत आ जाती है तो ख़ुदा उसको हरगिज़ मोहलत नहीं देता और जो कुछ तुम करते हो ख़ुदा उससे ख़बरदार है"
        },
        "Indonesian": {
            "verse 63:1": "Apabila orang-orang munafik datang kepadamu, mereka berkata: \"Kami mengakui, bahwa sesungguhnya kamu benar-benar Rasul Allah\". Dan Allah mengetahui bahwa sesungguhnya kamu benar-benar Rasul-Nya; dan Allah mengetahui bahwa sesungguhnya orang-orang munafik itu benar-benar orang pendusta.",
            "verse 63:2": "Mereka itu menjadikan sumpah mereka sebagai perisai, lalu mereka menghalangi (manusia) dari jalan Allah. Sesungguhnya amat buruklah apa yang telah mereka kerjakan.",
            "verse 63:3": "Yang demikian itu adalah karena bahwa sesungguhnya mereka telah beriman, kemudian menjadi kafir (lagi) lalu hati mereka dikunci mati; karena itu mereka tidak dapat mengerti.",
            "verse 63:4": "Dan apabila kamu melihat mereka, tubuh-tubuh mereka menjadikan kamu kagum. Dan jika mereka berkata kamu mendengarkan perkataan mereka. Mereka adalah seakan-akan kayu yang tersandar. Mereka mengira bahwa tiap-tiap teriakan yang keras ditujukan kepada mereka. Mereka itulah musuh (yang sebenarnya) maka waspadalah terhadap mereka; semoga Allah membinasakan mereka. Bagaimanakah mereka sampai dipalingkan (dari kebenaran)?",
            "verse 63:5": "Dan apabila dikatakan kepada mereka: Marilah (beriman), agar Rasulullah memintakan ampunan bagimu, mereka membuang muka mereka dan kamu lihat mereka berpaling sedang mereka menyombongkan diri.",
            "verse 63:6": "Sama saja bagi mereka, kamu mintakan ampunan atau tidak kamu mintakan ampunan bagi mereka. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang fasik.",
            "verse 63:7": "Mereka orang-orang yang mengatakan (kepada orang-orang Anshar): \"Janganlah kamu memberikan perbelanjaan kepada orang-orang (Muhajirin) yang ada disisi Rasulullah supaya mereka bubar (meninggalkan Rasulullah)\". Padahal kepunyaan Allah-lah perbendaharaan langit dan bumi, tetapi orang-orang munafik itu tidak memahami.",
            "verse 63:8": "Mereka berkata: \"Sesungguhnya jika kita telah kembali ke Madinah, benar-benar orang yang kuat akan mengusir orang-orang yang lemah dari padanya\". Padahal kekuatan itu hanyalah bagi Allah, bagi Rasul-Nya dan bagi orang-orang mukmin, tetapi orang-orang munafik itu tiada mengetahui.",
            "verse 63:9": "Hai orang-orang beriman, janganlah hartamu dan anak-anakmu melalaikan kamu dari mengingat Allah. Barangsiapa yang berbuat demikian maka mereka itulah orang-orang yang merugi.",
            "verse 63:10": "Dan belanjakanlah sebagian dari apa yang telah Kami berikan kepadamu sebelum datang kematian kepada salah seorang di antara kamu; lalu ia berkata: \"Ya Rabb-ku, mengapa Engkau tidak menangguhkan (kematian)ku sampai waktu yang dekat, yang menyebabkan aku dapat bersedekah dan aku termasuk orang-orang yang saleh?\"",
            "verse 63:11": "Dan Allah sekali-kali tidak akan menangguhkan (kematian) seseorang apabila telah datang waktu kematiannya. Dan Allah Maha Mengenal apa yang kamu kerjakan."
        },
        "Italian": {
            "verse 63:1": "Quando vengono a te, gli ipocriti dicono: “Attestiamo che sei veramente il Messaggero di Allah”, ma Allah attesta che tu sei il Suo Messaggero e attesta Allah, che gli ipocriti sono bugiardi.",
            "verse 63:2": "Si fanno scudo dei loro giuramenti e hanno allontanato altri dalla via di Allah. Quant'è perverso quello che fanno!",
            "verse 63:3": "E questo perché prima credettero, poi divennero increduli. Sul loro cuore fu quindi posto un suggello, affinché non capissero.",
            "verse 63:4": "Quando li vedi, sei ammirato dalla loro prestanza; se parlano, ascolti le loro parole. Sono come tronchi appoggiati. Credono che ogni grido sia contro di loro. Sono essi il nemico. Stai in guardia. Li annienti Allah! Quanto si sono traviati!",
            "verse 63:5": "E quando si dice loro: “Venite, il Messaggero di Allah implorerà il perdono per voi”, voltano la testa e li vedi allontanarsi pieni di superbia.",
            "verse 63:6": "Per loro è la stessa cosa, che tu implori perdono per loro o che non lo implori: Allah non li perdonerà mai. In verità Allah non guida gli empi.",
            "verse 63:7": "Essi sono coloro che dicono: “Non date nulla a coloro che seguono il Messaggero di Allah, affinché si disperdano”. Appartengono ad Allah i tesori dei cieli e della terra, ma gli ipocriti non lo capiscono.",
            "verse 63:8": "Dicono: “Se ritorniamo a Medina, il più potente scaccerà il più debole”. La potenza appartiene ad Allah, al Suo Messaggero e ai credenti, ma gli ipocriti non lo sanno.",
            "verse 63:9": "O credenti, non vi distraggano dal ricordo di Allah i vostri beni e i vostri figli. Quelli che faranno ciò saranno i perdenti.",
            "verse 63:10": "Siate generosi di quello che Noi vi abbiamo concesso, prima che giunga a uno di voi la morte ed egli dica: “Signore, se Tu mi dessi una breve dilazione, farei l'elemosina e sarei fra i devoti”.",
            "verse 63:11": "Ma Allah non concede dilazioni a nessuno che sia giunto al termine. Allah è ben informato a proposito di quello che fate."
        },
        "Japanese": {
            "verse 63:1": "偽信者たちがあなたの許にやって来ると，「わたしたちはあなたが，本当にアッラーの使徒であることを証言する。」と言う。アッラーは，あなたが確かに使徒であることを知っておられる。またアッラーは，偽信者たちが真に嘘言の徒であることを証言なされる。",
            "verse 63:2": "かれらはその誓いを（悪行のための）隠れ場として，アッラーの道から（人びとを）妨げている。本当にかれらの行うことは，憎むべきである。",
            "verse 63:3": "それは，かれらが一度信仰して，それから不信心になったためで，かれらの心は封じられ，そのためかれらは理解しない。",
            "verse 63:4": "あなたがかれらを見る時，かれらの（立派な）風体に感心するであろう。かれらが語れば，あなたはその雄弁な言葉に魅せられる。だがかれらは，（何の知識もなく何を言っても分らない）壁に寄りかかっているただの材木のようなものである。かれらはどの叫びも，自分たちのことをいっていると考えている。かれらは敵である。用心しなさい。アッラーよかれらを滅ぼして下さい。何とかれらは（真理から）逸れたことよ。",
            "verse 63:5": "かれらに向かって，「来なさい。アッラーの使徒が，あなたがたのために御赦しを祈るであろう。」と言うと，あなたはかれらが顔を背けて，微慢に背を向けて去るのを見よう。",
            "verse 63:6": "あなたがかれらのために御赦しを祈っても，また祈らなくても，かれらにとって同じである。アッラーは，決してかれらを御赦しになられない。本当にアッラーは，（アッラーの）掟に背く者を御導きになられない。",
            "verse 63:7": "かれらはこう言うのである。「アッラーの使徒と一緒の者に，施しをしてはいけません。かれらは結局解散されるのです。」本当に天と地の宝庫はアッラーの有である。だが，偽信者たちはそれを理解しない。",
            "verse 63:8": "かれらは，「わたしたちがアル・マディーナに帰れば，そこの高貴な者が卑しい者たちを必ずそこから追うでしょう。」と言う。凡そ栄誉は，アッラーと使徒，そしてその信者たちにある。だが偽信者たちには，これが分らない。",
            "verse 63:9": "信仰する者よ，あなたがたの富や子女にかまけて，アッラーを念じることを疎かにしてはならない。そうする者（アッラーを念わない者）は，自らを損う者である。",
            "verse 63:10": "死があなたがたを理う前に，われが与えたものから施しなさい。かれは，「主よ，何故あなたは暫くの間の猶予を与えられないのですか。そうすればわたしは喜捨〔サダカ〕をして，善い行いの者になりますのに。」と言う。",
            "verse 63:11": "定められた時がやって来た時，アッラーは誰にも猶予を与えられない。アッラーは，あなたがたの行うことに通暁なされる。"
        },
        "Jawa": {
            "verse 63:1": "(Muhammad) manawa wong lamis padha sowan marang sira lan matur, \"Kula sami nekseni panjenengan punika temen utusane Allah\". Allah Nyekseni yen kandhane wong lamis mau satemene goroh. Allah nguningani yen sira temen utusane Allah",
            "verse 63:2": "Wong lamis mau wani sumpah dianggo ngaling - ngalingi (bandha lan nyawane). Tumuli dheweke ngalang - ngalangi (manungsa) ana ing dalaning ALlah (Islam) wong lamis mau ala temen kang padha dilakoni",
            "verse 63:3": "Anggone hala mau marga padha percya ing Allah, nanging banjur padha balik dadi kafir, wusana atine dikancing ora bisa kalebon iman, dadi padha ora ngerti",
            "verse 63:4": "Manawa sira deleng wong lamis mau gumun dening awake becik - becik. Manawa krungun caturane gumun dening patitis tetembungane, prasasat balok sumendhe ing pager tembok. Wong lamis mau saking wedine, sadhenga suwara dikira bakal bebayani awake. Wong lamis mau sabenere asteru sira padha prayitna. Allah bakal nyirnakake wong lamis mau. Anggumunake nganti dheweke diplencengake (saka kebeneran)",
            "verse 63:5": "Manawa wong lamis mau padha ditimbali, \"Ayo padha mrenea (iman) suoaya Rosulullah bakal nyuwunake pangapuraning Allah marang kowe\". Wong lamis mau padha gedhek wae, sira deleng padha malengos atine gumedhe",
            "verse 63:6": "Wong lamis mau sanadiyan sira suwunake pangapura utawa ora padha wae. Allah ora kersa ngapura marang dheweke. Satemene Allah ora kersa nuduhake dalan ener marang wong kafir",
            "verse 63:7": "Hiya iku wong kang padha ngucap (marang wong Anshor) mangkene, \"Aja padha weweh marang wong kang dadi kancane Rosulullah (Muhajirin) kajaba yen wis pisah\". Gudhang pasimpenan ing langit lan bumi iku kagungane Allah. Nanging para wong lamis padha ora ngerti",
            "verse 63:8": "Wong lamis mau pahdha uga kondha, \"Manawa aku gelem bali marang Madinah, mesthi wong sing kuwat bakal ngusir wong sing ringkih\". Weruha, kamulyan lan kemenangan iku kagungane Allah lan utusane apa dene wong Mukmin. Nanging mangkini iku wong lamis padha ora weruh",
            "verse 63:9": "Para mukmin! Anggonira ngopeni bandhanira utawa anakira aja nganthi ngalahake anggonira eling ing Allah, sing sapa nglakoni mangkono mau tetep wong kapitunan",
            "verse 63:10": "Lan padha wewehana barang kang wis Ingsun paringake marang sira mumpung durung mati. Yen nganti tekan mangsane mati sira mesthi munjuk, \"Pangeran kula! Kula punika panjenengan srantosaken sakedhap kemawon kawula badhe mewehaken bondha kawula, saha badhe dados tiyang sahe",
            "verse 63:11": "Allah ora kersa nyarantekake wong kang wis tekan wawangene patine. Allah iku waspada marang samu barang kang sira lakoni"
        },
        "Kazakh": {
            "verse 63:1": "Ей, Мұхаммед! Мұнафиқтар саған кел­ген кезде: «Сенің Аллаһтың елшісі екеніңе куәлік береміз», дейді. Аллаһ, әлбетте, сен Оның елшісі екеніңді біледі. Әрі Аллаһ, мұнафиқтардың анық өтірікші екеніне куәлік береді",
            "verse 63:2": "Олар анттарын қалқан етіп алып, өзгелерді Аллаһтың жолынан қайтарды. Шын мәнінде, олардың істеп жатқандары өте жаман",
            "verse 63:3": "Бұл, олардың алдын иманға келіп, кейін күпірлік етулері имансыздыққа қайтулары себепті. Сөйтіп олардың жүректері мөрленді, енді олар түсінбейді",
            "verse 63:4": "Ей, Мұхаммед! Оларды көрген кезіңде, олардың сырт келбеттері сені қайран қалдырады. Олар сөйлегенде, сөздерін тыңдайсың. Олар бейне бір сүйеп қойылған бөренелер тәрізді. Олар кез келген айқайды өздеріне айтылды деп есептейді. Олар жау, олардан сақтан. Аллаһ оларды жойсын, олар шындықтан қайда бет бұрып барады",
            "verse 63:5": "Қашан Оларға: «Келіңдер, Аллаһтың елшісі сендер үшін кешірім тілейді», делінсе, олар бастарын шайқайды. Әрі сен олардың өздерін жоғары санап, менменси теріс бұрылғанын көресің",
            "verse 63:6": "Олар үшін кешірім тілесең де, кешірім тілемесең де оларға бәрібір. Аллаһ оларды кешірмейді. Негізінде, Аллаһ бұзық бойсұнбаушы адамдарды тура жолға салмайды",
            "verse 63:7": "«Аллаһтың елшісінің жанындағыларға ешнәрсе бермеңдер, олар тарап кетсін», дейтіндер солар. Аспандардың және жердің қазыналары Аллаһта. Алайда мұнафиқтар түсінбейді",
            "verse 63:8": "Олар: «Біз Мәдинаға қайтып барсақ, әлбетте, үстем ол жерден нашарды қуып шығарады», -дейді. Ақиқатында, үстемдік Аллаһта әрі Оның елшісінде және иманға келгендерде. Бірақ мұнафиқтар білмейді",
            "verse 63:9": "Ей, иманға келгендер! Дүние-мүліктерің мен балаларың сендерді Аллаһты еске алудан алаңдатып, бұрып қоймасын. Кім бұлай жасаса, міне, солар зиян шегушілер",
            "verse 63:10": "Сендерден біріңе өлім жетіп: «Йа, Раббы! Маған жақын бір мерзімге дейін мұрсат берсең, сонда мен садақа беріп әрі түзулерден болар едім», деп айтуынан бұрын, Біз сендерге ризық етіп берген нәрселерден зекет, садақа беріңдер",
            "verse 63:11": "Біреудің белгіленген уақыты келген кезде, Аллаһ оған мұрсат бермейді. Әрі Аллаһ сендердің не істеп жатқандарыңнан Хабардар"
        },
        "Korean": {
            "verse 63:1": "위선자들이 그대(무함마드)에게 왔을 때 그들은 “우리는 실로 그대가 하나님의 사도임을 증언합니다” 라고 말하나 하나님께서는 실로 그대가 그분의 사도임을 알고 계시며 하나님께서는 실로 위선자들이 거짓말하는 자들임을 증언하시노라위선자들이 그대에게 이르러저희는 그대가 하나님의 선지자임을 증언하도다 라고 말하나 실로 하나님께서는 그대가 그분의 선지자임을 알고 계시며 또한 하나님 은 위선자들이 거짓하고 있는 것 도 목격하고 계시니라",
            "verse 63:2": "그들은 자신의 맹세를 방패로 삼아 (사람들이) 하나님의 길로 들어섬을 가로막더라. 실로 그들이 행하던 일이란 참으로 악하도다그들은 그들의 맹세로 가림한후 하나님의 길에서 사람들을 벗 어나게 하매 실로 그들이 행하는 것에 사악함이 있을 것이라",
            "verse 63:3": "그러함은 그들이 믿은 후에 불신하였기 때문이라. 그리하여 그들의 마음이 봉해졌으니 그들은 이해하지 못하더라그것은 그들이 믿음을 가진 후 불신하였기 때문으로 그들의 마음이 봉하여지매 그들은 이해하지 못하노라",
            "verse 63:4": "(그대가 그들을 볼 때면 그대는 그들의 외관을 마음에 들어할 것이며, 그들이 말을 할 때면 그대는 그들의 말을 경청할 것이라. 그들은 마치 )벽에( 맞대어진 나무둥치와 같노라. 그들은 모든 외침이 그들에게 불리한 것이라 생각하더라. 그들은 적이니 그대(무함마드)는 그들에 유의하라. 하나님께서 그들을 파멸시키기를. 그들은 어떻게 돌아선단 말인가그대가 그들을 볼 때 그들의 외형이 그대를 놀라게 할 것이며 그들이 말할 때면 그대는 그들의 화술에 기를 기울일 것이라 그러 나 그들은 벽에 기대어진 재목과 같아 그들의 모든 외침이 그들에 게 거역하고 있다고 생각하노라 그들은 적이라 그러므로 그들을 주의하라 하나님의 저주가 그들에게 있을 것이라 그들은 얼마나 진리에서 벗어나 유혹되어 있느뇨",
            "verse 63:5": "누군가가 그들에게 “이리로 오시오. 하나님의 사도가 그대들을 위해 용서를 빌어 줄 것이오” 라고 말할 때면 그들은 그들의 머리를 돌릴 것이며, 그대는 그들이 거만해 하며 돌아서는 것을 볼 것이라하나님의 선지자께로 오라 그분께서 너희의 죄즐 사하여 달라 고 기도하실 때 그들은 얼굴을 돌리나니 그대는 그들이 크게 오만 하며 외면하는 것을 보리라",
            "verse 63:6": "그대가 그들을 위해 용서를 빌어 주든, 그들을 위해 용서를 빌어 주지 않든 그들에게는 동일하니 하나님께서는 그들을 용서해 주지 않으실 것이라. 실로 하나님께서는 거역하는 무리를 인도하지 않으시노라그대가 그들의 죄를 사하여 달라 기도하든 아니하든 그들에게는 똑같은 것으로 하나님은 그들 을 용서하지 아니할 것이니 실로 하나님은 사악한 백성들을 인도하지 아니하시노라",
            "verse 63:7": "“하나님의 사도와 함께 있는 자들이 떨어져 나갈 때까지 그들에게 희사하지 마시오” 라고 말하는 자들이 그들이라. 하늘과 대지의 보물 창고가 하나님의 소유이나 위선자들은 이해하지 못하노라하나님의 선지자와 함께 있는자들이 분산할 때까지 그들에게 자선을 베풀지 말라고 말하는 자 들이 바로 그들이라 하늘과 대지 의 보물이 하나님께 있으나 위선 자들은 이해하지 못하노라",
            "verse 63:8": "그들이 말하길 : “만일 우리가 메디나로 돌아간다면 맹세컨대 더 명예로운 자가 더 허약한 자를 그곳에서 쫓아낼 것이라”. 명예는 하나님의 소유이자 그분의 사도의 것이며 믿는 자들의 것이라. 그러나 위선자들은 알지 못하더라그들은 우리가 메디나로 돌아가 더 강한 자가 더 천한 자를 추방하리라고 말하더라 권능은 하 나님과 그분의 선지자와 믿는 자 들에게 있나니 위선자들은 모르고있노라",
            "verse 63:9": "믿는 자들이여! 그대들의 재산과 그대들의 자식들이 하나님을 떠올림에 방해가 되지 않도록 하라. 그렇게 하는 자, 저들은 실로 손실자들이라믿는 사람들이여 너희 재물과너희 자손들로 인하여 너희가 하 나님을 염원함에 벗어나서는 아니되나니 그렇게 하는 자 누구든 손실자들이라",
            "verse 63:10": "그대들 중 누군가에게 죽음이 찾아 오기 전에 그대들은 내가 그대들에게 베푼 양식으로 희사하라. 그 때 그가 말할 것이니 “저의 주님. 저를 가까운 기한까지만 늦추어 주신다면 저는 진실로 자선을 베풀고 선량한 자들 중의 하나가 될 것입니다”그러므로 죽음이 너희에게 이르기 전에 하나님이 베푼 일용 할 양식으로 자선을 베풀라 그렇 지 아니하면 주여 잠시 저를 유예하여 주소서 제가 자선을 베풀어 의로운 자 중에 있겠나이다 라고 말하게 되리라",
            "verse 63:11": "그러나 하나님께서는 영혼의 기한이 도래하였을 때 결코 그것(영혼)을 늦추지 않으시노라. 하나님께서는 그대들이 행하는 일에 밝으신 분이라그러나 하나님은 결정한 때가 이르면 어느 누구도 유예하지 아니하시거늘 하나님은 너희가 행하는 모든 것을 아시고 계시니라"
        },
        "Kurdish": {
            "verse 63:1": "Gava ên durû tên bal te dibêjin: \"Em danasî didin ku bi rastî tu pêxemberê Xuda yî.\" Xuda baþ dizane ku tu pêxemberê wî yî. Xuda danasî dide ku bêguman ên gurû her derewkar inئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) کاتێك ناپاك و دووڕووه‌کان دێن بۆ لات و ده‌ڵێن: ئێمه شایه‌تی ده‌ده‌ین که تۆ پێغه‌مبه‌ری خوایت!! له‌حاڵێکدا که خوا خۆی چاك ده‌زانێت که تۆ پێغه‌مبه‌ر و فرستاده‌ی ئه‌ویت، له هه‌مان کاتدا، خوا شایه‌تی ده‌دا که ئه‌و ناپاك و دووڕووانه درۆزنن.",
            "verse 63:2": "Wan baweriya xwe ji xwe re kir mertal vêca wan pêþî li rêya Xuda girt. Bêguman ew, çi pîs e tiþtê dikirinئه‌وانه سوێندی درۆیان کردووه به قه‌ڵغانی خۆیان و به‌و هۆیه‌وه به‌ربه‌ستی خه‌ڵکیان کردووه له ڕێبازی خوا، به‌ڕاستی ئه‌وه‌ی ئه‌وان ده‌یانکرد، کارێکی زۆر ناپه‌سه‌ندو نابه‌جێ بوو.",
            "verse 63:3": "Evê han ji ber ku bi rastî wan bawerî anî paþê kafir bûn, vêca li ser dilên wan hate mohr kirin; êdî ew tênagihênئه‌و حاڵه‌ته‌شیان بۆیه تێدا دروست بووه چونکه سه‌ره‌تا باوه‌ڕیان هێنا؛ له‌وه‌ودوا حه‌قیان پۆشی و کافر بوونه‌وه‌، به‌هۆی ئه‌وه‌وه مۆر نرا به‌سه‌ر دڵیاندا (بۆیه تێگه‌یشتن و بیروبۆچوونیان شێواوه و) له ڕاستیه‌کان تێ ناگه‌ن.",
            "verse 63:4": "Gava tu wan dibînî, bejn û bala wan te dixe sosretê, û eger ewbipeyivin tu li gotina wan gohdarî dikî. Ew her wekî hiþke darê sipartî ne. Ew her qerînî bi ser xwe ve guman dikin. Neyar her ew in, êdî tu xwe ji wan bigre- biparêze. Xuda wan bikuje!, ew bi ku ve têne zivirandinکاتێك ده‌یانبینیت سیما و له‌ش و لاریان سه‌رسامت ده‌کات، کاتێکیش دێنه قسه (ئه‌وه‌نده ده‌م بازو قسه‌زانن) ئه‌وه گوێ ده‌گرێت بۆ قسه‌یان، ده‌ڵێی داری وشکی به‌دیواردا هه‌ڵپه‌سێردراون، ئه‌وه‌نده له ترس و بیمدا ده‌ژین، هه‌ر هاوارو و بانگێك بکرێت، هه‌ر باسێك بێته پێشه‌وه‌، وه‌ده‌زانن دژی ئه‌وانه‌، ئا ئه‌وانه هه‌ر دوژمنن، که‌وابوو خۆتیان لێ بپارێزه‌، وریایان به‌، خوا بیانکوژێت و له‌ناویان به‌رێت، ئاخر بۆچی واده‌که‌ن، به‌ره‌و کوێ لادران (بۆچی باوه‌ڕی دامه‌زراو ناهێنن و له ڕێبازی ڕاست لاده‌ده‌ن).",
            "verse 63:5": "Û gava ji wan re tê gotin ku: \"Werin ku pêxemberê Xuda ji we re bexþînê bixwaze\" , ew serê xwe hey dihejînin û tu wan dibînî ku ew bu quretî li ba dikevinxwe ji para didinکاتێك پێیان بوترێت وه‌رن پێغه‌مبه‌ری خوا، داوای لێخۆشبوونتا بۆ ده‌کات، سه‌ر باده‌ده‌ن و لووت به‌رزی ده‌که‌ن، ده‌یانبینیت ڕوو وه‌رده‌گێڕن و به‌رهه‌ڵستی ده‌که‌ن، له‌کاتێکدا ئه‌وانه خۆیان لا گه‌وره ده‌بێت و خۆ به‌زلزانن.",
            "verse 63:6": "Çi tu ji wan re bexþînê nexwazî li ba wan yek e. Xuda ji wan re qet nabexþîne. Lewra bêguman Xuda komela jirêderketiyan nade ser rêya rastچونیه‌که بۆیان داوای لێخۆشبوونیان بۆ بکه‌یت یان نه‌یکه‌یت، هه‌رگیز خوا لێیان خۆش نابێت، چونکه به‌ڕاستی خوا ڕێنموویی قه‌ومی تاوانبارو له‌سنوور ده‌رچوو نادات.",
            "verse 63:7": "Ew in ên ku dibêjin: \"Hûn tiþtekî nedin ên li cem pêxemberê Xuda ne heya ew ji hev belav dibin.\" Xiznê asîmana û zemîn her ê Xuda ne, lê belê ên durû tênagihênئه‌وانه که‌سانێکن ده‌ڵێن به خه‌ڵکی: ماڵ و سامان مه‌به‌خشن به‌و که‌سانه‌ی که له ده‌وری پێغه‌مبه‌ری خوادان، تا بڵاوه‌ی لێ بکه‌ن!! (مه‌به‌ستیان هه‌ژارانی کۆچبه‌رانه‌، ئه‌ی نازانن) هه‌رچی گه‌نجیه‌نه‌کان هه‌یه له ئاسمانه‌کان و زه‌ویدا هه‌ر خوا خاوه‌نیانه‌، به‌ڵام دووڕوه‌کان ئه‌م ڕاستیه تێناگه‌ن و له نهێنیه‌کان سه‌رده‌رناکه‌ن.",
            "verse 63:8": "Ew dibêjin ku: \"Sond be, egr em bal Medînê ve vegerin wê ê bêrûmet, jê derîne.\" Rûmet (û serkeftin) her a Xuda û pêxemberê wî û bawermendan e, lê belê ên durû nizaninئه‌و دووڕووانه ده‌ڵێن: سوێند به خوا ئه‌گه‌ر گه‌ڕاینه‌وه بۆ مه‌دینه (دیاره که به‌و حاڵه‌شه‌وه به‌شداری غه‌زایان کردووه‌، به ناچاری، یان بۆ ته‌ماع و ئاشووب نانه‌وه‌) ده‌بێت ئه‌وه‌ی که ده‌سه‌ڵاتدارو به‌ڕێز و پیاوماقووڵه‌، ئه‌وه ده‌ر بکات له شار که بێ ڕێزو بێ ده‌سه‌ڵاته‌، ئه دووڕووانه نازانن که‌: عیززه‌ت و ده‌سه‌ڵات و پایه‌داری هه‌ر شایسته‌ی خواو پێغه‌مبه‌ره‌که‌ی و ئیماندارانه‌.",
            "verse 63:9": "Gelî ên bawerî anîne! ne malên we û ne zarûyên we bira we ji bîranîna Xuda para nehêle. Kî vî bike êdî ên ziyankar her ewên han inئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، هه‌وڵ بده‌ن نه ماڵ و سامانتان، نه ڕۆڵه‌کانتان، نه‌بنه هۆی ئه‌وه‌ی که له‌یادی خواو به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و که‌مته‌رخه‌می و بێ ئاگاتان بکه‌ن، جا هه‌رکه‌س له یادی خوا که‌م ته‌رخه‌می بکات، ئا ئه‌وانه هه‌ر خۆیان خه‌ساره‌تمه‌ندو زه‌ره‌رمه‌ندن.",
            "verse 63:10": "Û hûn ji tiþtê me rozî daye we bidin berî ku mirin ji we yekî re were vêca bêje: \"Perwerdekare min! çima te min heya demek nêz nehiþt êdî ku ez sedeqa bidim û bibim ji qencanله‌و ماڵ و سامان و زانستی و هێزو ده‌سه‌ڵاته‌ی که پێمان به‌خشیوون، ئێوه‌ش لێی ببه‌خشن و ده‌ستی به‌سه‌ردا مه‌گرن و قۆرخی مه‌که‌ن؛ پێش ئه‌وه‌ی که مردن یه‌خه به‌یه‌کێکتان بگرێت و بڵێت: په‌روه‌ردگارا، خۆزگه ما‌وه‌یه‌کی که‌می تر مۆڵه‌تت بدامایه تا خێرو چاکه‌م بکردایه و ماڵ و سامانم ببه‌خشیایه و بچوومایه‌ته ڕیزی چاکانه‌وه‌...",
            "verse 63:11": "Gava danê wî were, Xuda qet tu kesî para nade. Xuda bi tiþtê hûn dikin kûrzana yeجا ئه‌و داخوازیه به‌جێ نیه‌، چونکه ڕۆژی هه‌رکه‌سێك ته‌واو بوو، کاتی مه‌رگی هه‌ر که‌سێك هات، هه‌رگیز خوا دوای ناخات و مۆڵه‌تی بۆ تازه ناکاته‌وه‌، خوایش زۆر ئاگایه به هه‌موو ئه‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن."
        },
        "Kyrgyz": {
            "verse 63:1": "(О, Мухаммад!) Эгер сага мунафыктар келсе «биз күбөлүк беребиз: сен Аллаһтын элчисисиң» дешет. Аллаһ билет, сен Өзүнүн элчиси экениңди. Аллаһ мунафыктардын анык жалганчылыгына күбөлүк берет",
            "verse 63:2": "Алар анттарын калканыч кылып (өздөрүнө кошуп башка адамдарды да) Аллаһтын Жолунан тосушкан. Алардын иштери кандай жаман",
            "verse 63:3": "Мунун себеби, алар (оозунда) ыймандуу, (жүрөгүндө) каапыр болгону. Натыйжада жүрөктөрүнө мөөр басылып, (жакшылык менен жамандыкты) ажырата албай турган болуп калышты",
            "verse 63:4": "Эгер аларга карасаң келбеттери сени кызыктырат. Эгер (жалганды кооздоп) сүйлөсө аларды угасың. Алар (дубалга) жөлөп коюлган (жансыз) жыгач сыяктуу. (Ар дайым далбасада жашаганы себептүү) ар бир добушту өздөрүнүн зыянына деп ойлошот. Алар — душмандар, абайла алардан! Аллаһ кыйраткырлар, (чындыктан бурулуп) кайда бара жатышат",
            "verse 63:5": "Аларга «(Тооба кылып) келгиле, Аллаһтын элчиси силердин күнөөңөрдү кечиришин Аллаһдан сурайт» деп айтылганда, моюн толгоп кетишкен жана сен аларды текеберлик менен (адамдарды акыйкаттан) тосконун көрдүң",
            "verse 63:6": "Сеналар үчүн (Аллаһтан) кечирим сурасаң да же сурабасаң да — айырмасы жок: Аллаһ эч качан кечирбейт! Аллаһ бузуку коомду Туура Жолго баштабайт",
            "verse 63:7": "Алар (өз кишилерине) «Аллаһтын элчисинин айланасындагы адамдарга ихсан-көмөк көргөзбөгүлө, (ажеп эмес, Мухаммаддын айланасынан) тарап кетишсе» дешет. Асмандар менен жердин казыналары Аллаһтын колунда го! Бирок, мунафыктар муну түшүнбөйт",
            "verse 63:8": "Алар (дагы) «Эгер Мединага кайтсак, улук адамдар селсаяктарды (шаардан) айдап чыгат» дешкен!. Улуулук Аллаһка, Анын элчисине жана ыйман келтиргендерге таандык. Бирок, мунафыктар муну билишпейт",
            "verse 63:9": "О,ыйман келтиргендер! Мал-дүйнөңөр менен бала-чакаңар силерди Аллаһты эскерүүдөн (ибадаттардан) алаксытып койбосун! Ким ушундай кылса, алар — зыян тарткандар",
            "verse 63:10": "Качан гана силерден бирөөңөргө өлүм (сааты) келгенде «О, Раббим! Эгер мени бир аз мөөнөткө (жанымды албай) койо турсаң, садака кылып, жакшы адамдардан болоор элем!» деп (чыйпылыктап) калаардан мурда силерге Аллаһ берген ырыскылардан садака кылып калгыла",
            "verse 63:11": "Ажалы жетип калса, Аллаһ эч бир жанга мөөнөт бербейт! Аллаһ силердин бардык ишиңерден Кабардар"
        },
        "Malay": {
            "verse 63:1": "Apabila orang-orang munafik datang kepadamu (wahai Muhammad), mereka berkata: \"Kami mengakui bahawa sesungguhnya engkau - sebenar-benarnya Rasul Allah\". Dan Allah sememangnya mengetahui bahawa engkau ialah RasulNya, serta Allah menyaksikan bahawa sesungguhnya pengakuan mereka adalah dusta.",
            "verse 63:2": "Mereka menjadikan sumpahnya (atau akuannya) sebagai perisai (untuk menyelamatkan dirinya dan harta bendanya daripada dibunuh atau dirampas), lalu mereka menghalang (dirinya dan orang lain) dari menurut jalan Allah. Sesungguhnya amatlah buruk apa yang mereka telah kerjakan.",
            "verse 63:3": "(Perbuatan buruk) yang demikian kerana mereka mengaku beriman (di hadapan orang-orang Islam) kemudian mereka tetap kafir sesama sendiri, maka dengan sebab itu dimeteraikan atas hati mereka; lalu mereka tidak dapat memahami (yang mana benar dan yang mana salah).",
            "verse 63:4": "Dan apabila engkau melihat mereka, engkau tertarik hati kepada tubuh badan mereka (dan kelalukannya); dan apabila mereka berkata-kata, engkaujuga (tertarik hati) mendengar tutur katanya (kerana manis dan fasih. Dalam pada itu) mereka adalah seperti batang-batang kayu yang tersandar (tidak terpakai kerana tidak ada padanya kekuatan yang dikehendaki). Mereka (kerana merasai bersalah, sentiasa dalam keadaan cemas sehingga) menyangka tiap-tiap jeritan (atau riuh rendah yang mereka dengar) adalah untuk membahayakan mereka. Mereka itulah musuh yang sebenar-benarnya maka berjaga-jagalah engkau terhadap mereka. Semoga Allah membinasa dan menyingkirkan mereka dari rahmatNya. (Pelik sungguh!) Bagaimana mereka dipalingkan (oleh hawa nafsunya - dari kebenaran)?",
            "verse 63:5": "Dan apabila dikatakan kepada mereka: \" Marilah (bertaubat) supaya Rasulullah meminta ampun (kepada Allah) untuk kamu\", mereka (enggan sambil) menggeleng-gelengkan kepalanya; dan engkau melihat mereka berpaling (dari bertaubat) serta mereka berlaku sombong angkuh.",
            "verse 63:6": "(Tidak ada faedahnya) kepada mereka, sama ada engkau meminta ampun untuk mereka atau engkau tidak meminta ampun, Allah tidak sekali-kali akan mengampunkan mereka. Sesungguhnya Allah tidak memberi hidayah petunjuk kepada kaum yang fasik.",
            "verse 63:7": "Merekalah yang mengatakan (kepada orang-orang Islam di Madinah yang menolong Rasulullah dan orang-orang Muhajirin): \"Janganlah kamu membelanjakan harta kamu kepada orang-orang yang ada bersama-sama Rasulullah supaya mereka bersurai (meninggalkannya)\". Padahal bagi Allah jualah perbendaharaan langit dan bumi, (tiada sesiapapun yang dapat memberi atau menyekat sebarang pemberian melainkan dengan kehendakNya); akan tetapi orang-orang yang munafik itu tidak memahami (hakikat yang sebenarnya).",
            "verse 63:8": "Mereka berkata lagi: \" Demi sesungguhnya! Jika kita kembali ke Madinah (dari medan perang), sudah tentu orang-orang yang mulia lagi kuat (pihak kita) akan mengusir keluar dari Madinah orang-orang yang hina lagi lemah (pihak Islam)\". Padahal bagi Allah jualah kemuliaan dan kekuatan itu dan bagi RasulNya serta bagi orang-orang yang beriman; akan tetapi golongan yang munafik itu tidak mengetahui (hakikat yang sebenarnya).",
            "verse 63:9": "Wahai orang-orang yang beriman! Janganlah kamu dilalaikan oleh (urusan) harta benda kamu dan anak-pinak kamu daripada mengingati Allah (dengan menjalankan perintahNya). Dan (ingatlah), sesiapa yang melakukan demikian, maka mereka itulah orang-orang yang rugi.",
            "verse 63:10": "Dan belanjakanlah (dermakanlah) sebahagian dari rezeki yang Kami berikan kepada kamu sebelum seseorang dari kamu sampai ajal maut kepadanya, (kalau tidak) maka ia (pada saat itu) akan merayu dengan katanya: \" Wahai Tuhanku! Alangkah baiknya kalau Engkau lambatkan kedatangan ajal matiku - ke suatu masa yang sedikit sahaja lagi, supaya aku dapat bersedekah dan dapat pula aku menjadi dari orang-orang yang soleh \".",
            "verse 63:11": "Dan (ingatlah), Allah tidak sekali-kali akan melambatkan kematian seseorang (atau sesuatu yang bernyawa) apabila sampai ajalnya; dan Allah Amat Mendalam PengetahuanNya mengenai segala yang kamu kerjakan."
        },
        "Malayalam": {
            "verse 63:1": "കപട വിശ്വാസികള്‍ നിന്‍റെ അടുത്ത് വന്നാല്‍ അവര്‍ പറയും: തീര്‍ച്ചയായും താങ്കള്‍ അല്ലാഹുവിന്‍റെ ദൂതനാണെന്ന് ഞങ്ങള്‍ സാക്ഷ്യം വഹിക്കുന്നു. അല്ലാഹുവിന്നറിയാം തീര്‍ച്ചയായും നീ അവന്‍റെ ദൂതനാണെന്ന്‌. തീര്‍ച്ചയായും മുനാഫിഖുകള്‍ (കപടന്‍മാര്‍) കള്ളം പറയുന്നവരാണ് എന്ന് അല്ലാഹു സാക്ഷ്യം വഹിക്കുന്നു.",
            "verse 63:2": "അവര്‍ അവരുടെ ശപഥങ്ങളെ ഒരു പരിചയാക്കിയിരിക്കയാണ്‌. അങ്ങനെ അവര്‍ അല്ലാഹുവിന്‍റെ മാര്‍ഗത്തില്‍ നിന്ന് (ജനങ്ങളെ) തടഞ്ഞിരിക്കുന്നു. തീര്‍ച്ചയായും അവര്‍ പ്രവര്‍ത്തിക്കുന്നത് എത്രയോ ചീത്ത തന്നെ.",
            "verse 63:3": "അത്‌, അവര്‍ ആദ്യം വിശ്വസിക്കുകയും പിന്നീട് അവിശ്വസിക്കുകയും ചെയ്തതിന്‍റെ ഫലമത്രെ. അങ്ങനെ അവരുടെ ഹൃദയങ്ങളിന്‍മേല്‍ മുദ്രവെക്കപ്പെട്ടിരിക്കുന്നു. അതിനാല്‍ അവര്‍ (കാര്യം) ഗ്രഹിക്കുകയില്ല.",
            "verse 63:4": "നീ അവരെ കാണുകയാണെങ്കില്‍ അവരുടെ ശരീരങ്ങള്‍ നിന്നെ അത്ഭുതപ്പെടുത്തും. അവര്‍ സംസാരിക്കുന്ന പക്ഷം നീ അവരുടെ വാക്ക് കേട്ടിരുന്നു പോകും. അവര്‍ ചാരിവെച്ച മരത്തടികള്‍ പോലെയാകുന്നു. എല്ലാ ഒച്ചയും തങ്ങള്‍ക്കെതിരാണെന്ന് അവര്‍ വിചാരിക്കും. അവരാകുന്നു ശത്രു. അവരെ സൂക്ഷിച്ചു കൊള്ളുക. അല്ലാഹു അവരെ നശിപ്പിക്കട്ടെ. എങ്ങനെയാണവര്‍ വഴിതെറ്റിക്കപ്പെടുന്നത്‌?",
            "verse 63:5": "നിങ്ങള്‍ വരൂ. അല്ലാഹുവിന്‍റെ ദൂതന്‍ നിങ്ങള്‍ക്ക് വേണ്ടി പാപമോചനത്തിന് പ്രാര്‍ത്ഥിച്ചുകൊള്ളും എന്ന് അവരോട് പറയപ്പെട്ടാല്‍ അവര്‍ അവരുടെ തല തിരിച്ചുകളയും. അവര്‍ അഹങ്കാരം നടിച്ചു കൊണ്ട് തിരിഞ്ഞുപോകുന്നതായി നിനക്ക് കാണുകയും ചെയ്യാം.",
            "verse 63:6": "നീ അവര്‍ക്ക് വേണ്ടി പാപമോചനത്തിന് പ്രാര്‍ത്ഥിച്ചാലും പ്രാര്‍ത്ഥിച്ചിട്ടില്ലെങ്കിലും അവരെ സംബന്ധിച്ചിടത്തോളം സമമാകുന്നു. അല്ലാഹു ഒരിക്കലും അവര്‍ക്കു പൊറുത്തുകൊടുക്കുകയില്ല. തീര്‍ച്ചയായും അല്ലാഹു ദുര്‍മാര്‍ഗികളായ ജനങ്ങളെ നേര്‍വഴിയിലാക്കുകയില്ല.",
            "verse 63:7": "അല്ലാഹുവിന്‍റെ ദൂതന്‍റെ അടുക്കലുള്ളവര്‍ക്ക് വേണ്ടി, അവര്‍ (അവിടെ നിന്ന്‌) പിരിഞ്ഞു പോകുന്നത് വരെ നിങ്ങള്‍ ഒന്നും ചെലവ് ചെയ്യരുത് എന്ന് പറയുന്നവരാകുന്നു അവര്‍. അല്ലാഹുവിന്‍റെതാകുന്നു ആകാശങ്ങളിലെയും ഭൂമിയിലെയും ഖജനാവുകള്‍. പക്ഷെ കപടന്‍മാര്‍ കാര്യം ഗ്രഹിക്കുന്നില്ല.",
            "verse 63:8": "അവര്‍ പറയുന്നു; ഞങ്ങള്‍ മദീനയിലേക്ക് മടങ്ങിച്ചെന്നാല്‍ കൂടുതല്‍ പ്രതാപമുള്ളവര്‍ നിന്ദ്യരായുള്ളവരെ പുറത്താക്കുക തന്നെ ചെയ്യുമെന്ന്‌. അല്ലാഹുവിനും അവന്‍റെ ദൂതന്നും സത്യവിശ്വാസികള്‍ക്കുമാകുന്നു പ്രതാപം. പക്ഷെ, കപടവിശ്വാസികള്‍ (കാര്യം) മനസ്സിലാക്കുന്നില്ല.",
            "verse 63:9": "സത്യവിശ്വാസികളേ, നിങ്ങളുടെ സ്വത്തുക്കളും സന്താനങ്ങളും അല്ലാഹുവെപ്പറ്റിയുള്ള സ്മരണയില്‍ നിന്ന് നിങ്ങളുടെ ശ്രദ്ധതിരിച്ചുവിടാതിരിക്കട്ടെ. ആര്‍ അങ്ങനെ ചെയ്യുന്നുവോ അവര്‍ തന്നെയാണ് നഷ്ടക്കാര്‍.",
            "verse 63:10": "നിങ്ങളില്‍ ഓരോരുത്തര്‍ക്കും മരണം വരുന്നതിനു മുമ്പായി നിങ്ങള്‍ക്ക് നാം നല്‍കിയതില്‍ നിന്ന് നിങ്ങള്‍ ചെലവഴിക്കുകയും ചെയ്യുക. അന്നേരത്ത് അവന്‍ ഇപ്രകാരം പറഞ്ഞേക്കും. എന്‍റെ രക്ഷിതാവേ, അടുത്ത ഒരു അവധിവരെ നീ എനിക്ക് എന്താണ് നീട്ടിത്തരാത്തത്‌? എങ്കില്‍ ഞാന്‍ ദാനം നല്‍കുകയും, സജ്ജനങ്ങളുടെ കൂട്ടത്തിലാവുകയും ചെയ്യുന്നതാണ്‌.",
            "verse 63:11": "ഒരാള്‍ക്കും അയാളുടെ അവധി വന്നെത്തിയാല്‍ അല്ലാഹു നീട്ടികൊടുക്കുകയേ ഇല്ല. അല്ലാഹു നിങ്ങള്‍ പ്രവര്‍ത്തിക്കുന്നതിനെപ്പറ്റി സൂക്ഷ്മമായി അറിയുന്നവനാകുന്നു."
        },
        "Norwegian": {
            "verse 63:1": "Når hyklerne kommer til deg, sier de: «Vi vitner at du er visselig Guds sendebud.» Gud vet at du er Hans sendebud, og Gud vitner at hyklerne visselig er løgnere.",
            "verse 63:2": "De tar sine eder som dekke, og så legger de hindringer på Guds vei. Ille er det de har gjort.",
            "verse 63:3": "Dette fordi de trodde, og så ble vantro. Så ble deres hjerter forseglet, så de intet forstår.",
            "verse 63:4": "Men når du ser dem, behager deres fremtoning deg, og om de taler, lytter du til deres tale, der de står stive som stokker, og tror at hvert utrop gjelder dem. De er fienden, så pass opp for dem. Måtte Gud gjøre det av med dem! Hvor forvridde de er!",
            "verse 63:5": "Og når det sies til dem: «Kom hit, så vil Guds sendebud be om tilgivelse for dere,» så snur de hodet til siden, og du ser at de avslår i hovmod.",
            "verse 63:6": "Det er likegyldig for dem om du ber om tilgivelse for dem eller ikke. Gud gir dem ikke tilgivelse, Gud leder ikke syndefulle mennesker.",
            "verse 63:7": "Disse er det som sier: «Gi ingen økonomisk støtte til dem som er sammen med Guds sendebud, så sprer de seg.» Dog, Guds er himlenes og jordens skatter, men hyklerne forstår intet.",
            "verse 63:8": "De sier: «Om vi vender tilbake til Medina, så vil nok den mektigere der drive ut den svakere.» Men makten tilhører Gud og Hans sendebud, og de troende, men hyklerne vet det ikke.",
            "verse 63:9": "Dere som tror, la ikke deres rikdom og barn avlede dere fra Guds ihukommen. De som gjør det, de er tapere.",
            "verse 63:10": "Gi av det Vi har gitt dere, før døden kommer til en av dere, og han sier: «Herre, om Du kunne gi meg en liten frist, så jeg kunne gi gode gaver, og bli av de rettferdige!»",
            "verse 63:11": "Men Gud gir ingen utsettelse når hans tid er kommen! Og Gud er vel underrettet om det dere gjør."
        },
        "Pashto": {
            "verse 63:1": "(اى نبي!) كله چې تا ته منافقان راشي (نو) دوى وايي: مونږ شاهدي وركوو چې بېشكه ته یقینًا د الله رسول يې او الله پوهېږي چې ته بېشكه (او) یقینًا د هغه رسول يې۔ او الله شاهدي وركوي چې بېشكه منافقان یقینًا دروغ ویونكي دي",
            "verse 63:2": "دوى خپل قسمونه ډال ګرځولي دي، نو دوى د الله له لارې نه منع شول، بېشكه دوى چې دي، بد دى هغه كار چې دوى يې كوي",
            "verse 63:3": "دا ځكه چې یقینًا دوى ایمان راوړ، بیا كافر شول، نو د دوى په زړونو باندې مهر ولګول شو، پس (اوس نو) دوى نه پوهېږي",
            "verse 63:4": "او كله چې ته دوى ووینې (نو) تا د دوى جسمونه (تنې) په تعجب كې اچوي۔ او كه دوى خبرې كوي، (نو) ته د دوى خبرو ته غوږ ږدې، حال دا چې ګویاكې دوى ودرول شوي وچ لرګي دي۔، هر اوچت غږ دخپل ځان په خلاف ګني۔، هم دوى دښمنان دي، لهذا ته له دوى نه محتاط اوسه۔، الله دې دوى هلاك كړي، څرنګه دوى ګرځولى شي",
            "verse 63:5": "او كله چې دوى ته وویل شي: تاسو راشئ چې د الله رسول ستاسو لپاره مغفرت وغواړي (نو) دوى خپل سرونه تاو كړي۔ او ته دوى وینې چې اعراض كوي، په داسې حال كې چې تكبر كوونكي وي",
            "verse 63:6": "د دوى لپاره یو شان ده كه ته د دوى لپاره مغفرت (بخښنه) وغواړي، یا ته دوى لپاره مغفرت ونه غواړې، الله به دوى هېڅ كله هم ونه بخښي، بېشكه الله نافرمان قوم ته هدایت نه كوي",
            "verse 63:7": "هم دوى هغه كسان دي چې وايي: تاسو په هغو كسانو باندې مال مه لګوئ چې له رسول الله سره دي، تر دې چې دوى خواره شي۔ او خاص د الله لپاره د اسمانونو او ځمكې خزانې دي او لېكن منافقان نه پوهېږي",
            "verse 63:8": "دوى وايي چې قسم دى كه مونږ مدینې ته بېرته وګرځو (نو) تر ټولو عزتمن (خلق) به له دغې (مدینې) نه تر ټولو ذلیله (خلق) خامخا ضرور وباسي او عزت (خو) خاص د الله لپاره دى او د هغه د رسول لپاره دى او د مومنانو لپاره دى او لېكن منافقان پوهه نه لري",
            "verse 63:9": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو دې د الله له ذكر نه نه خپل مالونه غافله كړي او نه خپل اولادونه۔ او هغه څوك چې دا كار وكړي، نو همدغه زیانكاران (تاوانیان) دي",
            "verse 63:10": "او تاسو له هغه (مال) نه چې مونږ تاسو ته دركړى دى څه انفاق كوئ، مخكې له دې نه چې په تاسو كې یو كس ته مرګ راشي، بیا دا ووايي: اى زما ربه! ته ما تر نژدې مودې پورې ولې نه وروسته كوې، پس چې زه خیرات (صدقه) وكړم او له صالحانو (نېكانو) ځنې شم",
            "verse 63:11": "او الله هېڅ یو نفس نه وروسته كوي كله چې د هغه اجل (نېټه) راشي۔ او الله په هغو عملونو ښه خبردا دى چې تاسو يې كوئ"
        },
        "Persian": {
            "verse 63:1": "چون منافقان نزد تو آيند، گويند: شهادت مى‌دهيم كه تو پيامبر خدا هستى. خدا مى‌داند كه تو پيامبرش هستى و خدا شهادت مى‌دهد كه منافقان دروغگويند.",
            "verse 63:2": "از سوگندهاى خود سپرى ساختند و از راه خدا بازداشتند و به حقيقت، آنچه مى‌كنند ناپسند است.",
            "verse 63:3": "اين بدان سبب است كه ايمان آوردند، سپس كافر شدند. خدا نيز بر دلهاشان مُهر نهاد و آنان درنمى‌يابند.",
            "verse 63:4": "چون آنها را ببينى تو را از ظاهرشان خوش مى‌آيد، و چون سخن بگويند به سخنشان گوش مى‌دهى. گويى چوبهايى هستند به ديوار تكيه داده. هر آوازى را بر زيان خود مى‌پندارند. ايشان دشمنانند. از آنها حذر كن. خدايشان بكشد. به كجا منحرف مى‌شوند؟",
            "verse 63:5": "چون به آنها گفته شود كه بياييد تا پيامبر خدا برايتان آمرزش بخواهد، سرمى‌پيچند. مى‌بينى كه اعراض و گردنكشى مى‌كنند.",
            "verse 63:6": "تفاوتى نكند، چه برايشان آمرزش بخواهى چه آمرزش نخواهى. خدايشان نخواهد آمرزيد. و خدا مردم نافرمان را هدايت نمى‌كند.",
            "verse 63:7": "اينان همانهايند كه مى‌گويند: بر آنها كه گرد پيامبر خدايند، چيزى مدهيد تا از گردش پراكنده شوند. و حال آنكه خزاين آسمانها و زمين از آنِ خداست ولى منافقان نمى‌فهمند.",
            "verse 63:8": "مى‌گويند: چون به مدينه بازگرديم، صاحبان عزت، ذليلان را از آنجا بيرون خواهند كرد. عزت از آنِ خدا و پيامبرش و مؤمنان است. ولى منافقان نمى‌دانند.",
            "verse 63:9": "اى كسانى كه ايمان آورده‌ايد، اموال و اولادتان شما را از ذكر خدا به خود مشغول ندارد، كه هر كه چنين كند زيانكار است.",
            "verse 63:10": "از آنچه روزيتان داده‌ايم در راه خدا انفاق كنيد، پيش از آنكه يكى از شما را مرگ فرا رسد و بگويد: اى پروردگار من، چرا مرگ مرا اندكى به تأخير نينداختى تا صدقه دهم و از شايستگان باشم؟",
            "verse 63:11": "چون كسى اَجلش فرا رسد، خدا مرگ او را به تأخير نمى‌افكند. و خدا به كارهايى كه مى‌كنيد آگاه است."
        },
        "Polish": {
            "verse 63:1": "Kiedy przychodzą do ciebie obłudnicy, mówią: \"Zaświadczamy, że ty jesteś Posłańcem Boga!\" Bóg wie, że ty jesteś Posłańcem Jego i Bóg świadczy, że obłudnicy są kłamcami.",
            "verse 63:2": "Oni wzięli sobie swoje przysięgi jako puklerz i odsunęli się od drogi Boga. Zaprawdę, złe jest to, co oni uczynili!",
            "verse 63:3": "Albowiem oni uwierzyli, a potem stali się niewiernymi. Pieczęć została nałożona na ich serca i oni nie pojmują.",
            "verse 63:4": "Kiedy na nich patrzysz, podobają ci się ich postacie; a kiedy mówią, to słuchasz ich słów, a oni są jakby słupami podpartymi. Oni uważają, że każdy krzyk jest przeciw nim. Oni są nieprzyjaciółmi, przeto wystrzegaj się ich! Niech ich Bóg zwalczy! Jakże oni zostali oszukani!",
            "verse 63:5": "A kiedy się im mówi: \"Przychodźcie! Posłaniec Boga będzie prosił o przebaczenie dla was.\" - oni odwracają głowy i widzisz, jak się odsuwają, nadęci pychą.",
            "verse 63:6": "Wszystko jedno, czy będziesz prosił dla nich o przebaczenie, czy też nie będziesz o nie prosił - nie przebaczy im Bóg. Bóg nie prowadzi drogą prostą ludzi szerzących zepsucie.",
            "verse 63:7": "Oni są tymi, którzy mówią: \"Nie rozdawajcie nic tym, którzy są przy Posłańcu Boga, aby oni od niego odeszli. \" Do Boga należą skarby niebios i ziemi, lecz obłudnicy nic nie pojmują.",
            "verse 63:8": "Oni mówią: \"Jeśli powrócimy do Medyny, to z pewnością silniejszy wypędzi stamtąd słabszego!\" Potęga należy do Boga, do Jego Posłańca i wiernych. Lecz obłudnicy tego nie wiedzą.",
            "verse 63:9": "O wy, którzy wierzycie! Niech wasze majątki i wasze dzieci nie odrywają was od wspomnienia Boga! A ci, którzy to czynią, poniosą stratę.",
            "verse 63:10": "Rozdawajcie z tego, w co was zaopatrzyliśmy, zanim przyjdzie śmierć do któregoś z was. Wtedy on powie: \"Panie mój! Gdybyś mi dał trochę czasu, żebym mógł dawać jałmużnę i być sprawiedliwy!\"",
            "verse 63:11": "Ale Bóg nie da zwłoki żadnej duszy, kiedy nadejdzie jej termin. Bóg jest w pełni świadomy tego, co wy czynicie!"
        },
        "Portuguese": {
            "verse 63:1": "Quando os hipócritas se apresentam a ti, dizem: Reconhecemos que tu és o Mensageiro de Deus. Porém, Deus bem sabeque tu és o Seu Mensageiro e atesta que os hipócritas são mentirosos.",
            "verse 63:2": "Fazem dos seus juramentos uma coberta (para as suas más ações), e desencaminham-se da senda de Deus. Que péssimo éo que fazem!",
            "verse 63:3": "Isso porque creram e depois renegaram; consequentemente, foram sigilados os seus corações e por isso são insensatos.",
            "verse 63:4": "E quando os vês, os seus aspectos te agradam; e quando falam escuta-lhes as palavras. Todavia, são como madeiraencostada; pensam que qualquer grito é contra eles. São os inimigos; cuida-te, pois, deles. Que Deus os maldiga! Como sedesencaminham!",
            "verse 63:5": "Porém, quando lhes é dito: Vinde, que o Mensageiro de Deus implorará, para vós, o perdão!, meneiam a cabeça e os vêsafastarem-se, ensoberbecidos.",
            "verse 63:6": "Tanto se lhes dá que implores ou não o perdão para eles; Deus jamais os perdoará, porque Deus não encaminha osdepravados.",
            "verse 63:7": "São aqueles que dizem: Nada dispendais, com os que acompanham o Mensageiro de Deus, até que se dispersem. Ostesouros dos céus e da terra pertencem a Deus, embora os hipócritas continuem a ser insensatos.",
            "verse 63:8": "Dizem: Em verdade, se voltássemos para Madina, o mais poderoso expulsaria dela o mais fraco. Porém, a potestade sópertence a Deus, ao Seu Mensageiro e aos fiéis, ainda que os hipócritas o ignorem.",
            "verse 63:9": "Ó fiéis, que os vossos bens e os vossos filhos não vos alheiem da recordação de Deus, porque aqueles que tal fizerem, serão desventurados.",
            "verse 63:10": "Fazei caridade de tudo com que vos agraciamos, antes que a morte surpreenda qualquer um de vós, e este diga: Ó Senhormeu, porque não me toleras até um término próximo, para que eu possa fazer caridade e ser um dos virtuosos?",
            "verse 63:11": "Porém, Deus jamais adiará a hora de qualquer alma, quando ela chegar, porque Deus está bem inteirado de tudo quantofazeis."
        },
        "Punjabi": {
            "verse 63:1": "ਜਦੋਂ ਮੁਨਾਫ਼ਿਕ ਲੋਕ ਤੁਹਾਡੇ ਕੋਲ ਆਉਂਦੇ ਹਨ ਤਾਂ ਉਹ ਆਖਦੇ ਹਨ, ਅਸੀਂ ਗਵਾਹੀ ਦਿੰਦੇ ਹਾਂ ਕਿ ਤੁਸੀਂ ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਹੋ ਅਤੇ ਅੱਲਾਹ ਜਾਣਦਾ ਹੈ, ਕਿ ਬੇਸ਼ੱਕ ਤੁਸੀਂ ਉਸ ਦੇ ਰਸੂਲ ਹੋ ਅਤੇ ਅੱਲਾਹ ਗਵਾਹੀ ਦਿੰਦਾ ਹੈ ਕਿ ਇਹ ਮੁਨਾਫ਼ਿਕ ਝੁਠੇ ਹਨ।",
            "verse 63:2": "ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੀਆਂ ਸਹੁੰਆਂ ਨੂੰ ਢਾਲ ਬਣਾ ਰਖਿਆ ਹੈ। ਫਿਰ ਉਹ ਅੱਲਾਹ ਦੇ ਰਾਹ ਤੋਂ ਰੋਕਦੇ ਹਨ। ਬੇਸ਼ੱਕ ਬੇਹੱਦ ਮਾੜਾ ਹੈ ਜਿਹੜਾ ਉਹ ਕਰ ਰਹੇ ਹਨ।",
            "verse 63:3": "ਇਹ ਇਸ ਲਈ ਹੈ ਕਿ ਉਹ ਈਮਾਨ ਲਿਆਏ, ਫਿਰ (ਉਨ੍ਹਾਂ ਨੇ) ਅਵੱਗਿਆ ਕੀਤੀ ਫਿਰ ਉਨ੍ਹਾਂ ਦੇ ਦਿਲਾਂ ਤੇ ਮੁਹਰ ਲਗਾ ਦਿੱਤੀ ਗਈ। ਸੋ ਉਹ ਨਹੀਂ ਸਮਝਦੇ।",
            "verse 63:4": "ਅਤੇ ਜਦੋਂ’ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਦੇਖੋਂ ਤਾਂ ਉਨ੍ਹਾਂ ਦੇ ਸਰੀਰ ਤੁਹਾਨੂੰ ਚੰਗੇ ਲੱਗਦੇ ਹਨ। ਅਤੇ ਜੇਕਰ ਉਹ ਗੱਲ ਕਰਦੇ ਹਨ, ਤਾਂ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਦੀ ਗੱਲ ਸੁਣਦੇ ਹੋ। ਸਮਝੋ (ਉਨ੍ਹਾਂ ਦੀਆਂ ਗੱਲਾਂ, ਭਾਸ਼ਣ ਇਸ ਤਰਾਂ ਹਨ) ਜਿਵੇਂ ਲੱਕੜਾਂ ਹਨ, ਜਿਹੜੀਆਂ ਕੰਧ ਨਾਲ ਖੜ੍ਹੀਆਂ ਹੋਣ। ਉਹ ਹਰੇਕ ਉਚੀ ਅਵਾਜ਼ ਨੂੰ (ਤੋਂ ਡਰਦੇ) ਆਪਣੇ ਵਿਰੁੱਧ ਸਮਝਦੇ ਹਨ। ਇਹ ਲੋਕ ਤੁਹਾਡੇ ਵੈਰੀ ਹਨ। ਸੋ ਇਨ੍ਹਾਂ ਤੋਂ ਬਚੋ। ਅੱਲਾਹ ਉਨ੍ਹਾਂ ਨੂੰ ਨਸ਼ਟ ਕਰੇ, ਉਹ ਕਿਥੇ ਭਟਕਦੇ ਫਿਰਦੇ ਹਨ।",
            "verse 63:5": "ਅਤੇ ਜਦੋਂ ਉਨ੍ਹਾਂ ਨੂੰ ਆਖਿਆ ਜਾਂਦਾ ਹੈ ਕਿ ਆਉ। ਅੱਲਾਹ ਦਾ ਰਸੂਲ ਤੁਹਾਡੇ ਲਈ ਮੁਆਫ਼ੀ ਦੀ ਬੇਨਤੀ ਕਰੇ, ਤਾਂ ਉਹ ਆਪਣਾ ਸਿਰ ਹਿਲਾ ਦਿੰਦੇ ਹਨ। ਅਤੇ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਦੇਖੋਗੇ ਕਿ ਉਹ ਹੰਕਾਰ ਦੇ ਨਾਲ ਮੂੰਹ ਮੋੜ ਲੈਂਦੇ ਹਨ।",
            "verse 63:6": "ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਲਈ ਮੁਆਫ਼ੀ ਦੀ ਬੇਨਤੀ ਕਰੋ ਜਾਂ ਨਾ ਕਰੋ, _ ਉਨ੍ਹਾਂ ਲਈ ਇੱਕ ਬਰਾਬਰ ਹੈ। ਅੱਲਾਹ ਕਦੇ ਵੀ ਉਨ੍ਹਾਂ ਨੂੰ ਮੁਆਫ਼ ਨਹੀਂ ਕਰੇਗਾ। ਅੱਲਾਹ ਅਵੱਗਿਆਕਾਰੀ ਲੋਕਾਂ ਨੂੰ ਨਸੀਹਤ ਪ੍ਰਦਾਨ ਨਹੀਂ ਕਰਦਾ।",
            "verse 63:7": "ਇਹ ਹੀ ਹਨ ਜਿਹੜੇ ਆਖਦੇ ਹਨ ਕਿ ਜੋ ਲੋਕ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਦੇ ਨੇੜੇ ਹਨ ਉਨ੍ਹਾਂ ਤੇ ਖਰਚ ਨਾ ਕਰੋ, ਇਥੋਂ ਤੱਕ ਕਿ ਇਹ ਤਿੱਤਰ-ਸ਼ਿੱਤਰ (ਵੱਖ-ਵੱਖ) ਨਾ ਹੋ ਜਾਣ। ਆਕਾਸ਼ਾਂ ਅਤੇ ਧਰਤੀ ਦੇ ਖਜਾਨੇ ਅੱਲਾਹ ਦੇ ਹੀ ਹਨ। ਪਰ ਮੁਨਾਫ਼ਿਕ ਲੋਕ ਨਹੀਂ ਸਮਝਦੇ।",
            "verse 63:8": "ਉਹ ਆਖਦੇ ਹਨ ਕਿ ਜੇਕਰ ਅਸੀਂ ਮਦੀਨੇ ਵਾਪਿਸ ਪਰਤ ਆਈਏ ਤਾਂ ਇੱਜ਼ਤ ਵਾਲੇ ਉਥੋਂ ਬੇ-ਇੱਜ਼ਤਾਂ ਨੂੰ ਕੱਢ ਦੇਣਗੇ। ਹਾਲਾਂਕਿ ਇੱਜ਼ਤ ਅੱਲਾਹ ਲਈ ਹੀ ਹੈ, ਅਤੇ ਉਸ ਦੇ ਰਸੂਲ ਅਤੇ ਮੋਮਿਨਾਂ ਲਈ ਹੈ। ਪਰ ਧੋਖੇਬਾਜ (ਮੁਲਾਫ਼ਿਕ) ਨਹੀਂ ਸਮਝਦੇ।",
            "verse 63:9": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਹਾਡੀ ਜਾਇਦਾਦ ਅਤੇ ਤੁਹਾਡੀ ਔਲਾਦ ਤੁਹਾਨੂੰ ਅੱਲਾਹ ਦੇ ਯਾਦ ਤੋਂ ਵਾਝਿਆਂ ਨਾ ਕਰ ਦੇਵੇ। ਅਤੇ ਜਿਹੜੇ ਅਜਿਹਾ ਕਰਨਗੇ ਤਾਂ ਉਹ ਘਾਟੇ ਵਿਚ ਪੈਣ ਵਾਲੇ ਲੋਕ ਹਨ।",
            "verse 63:10": "ਅਤੇ ਅਸੀਂ ਜਿਹੜਾ ਕੁਝ ਤੁਹਾਨੂੰ ਦਿੱਤਾ ਉਸ ਵਿਚੋਂ ਖਰਚ ਕਰੋ। ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਕਿ ਤੁਹਾਡੇ ਵਿਚੋਂ ਕਿਸੇ ਦੀ ਮੌਤ ਆ ਜਾਵੇ। ਫਿਰ ਉਹ ਆਖਣਗੇ ਕਿ ਹੇ ਸਾਡੇ ਪਾਲਣਹਾਰ! ਤੁਸੀਂ ਮੈਨੂੰ ਕੁਝ ਹੋਰ ਮੌਕਾ ਕਿਉਂ ਨਾ ਦਿੱਤਾ। ਤਾਂ ਕਿ ਮੈਂ ਦਾਨ ਕਰਦਾ ਅਤੇ ਭਲੇ ਲੋਕਾਂ ਵਿਚ ਸ਼ਾਮਿਲ ਹੋ ਜਾਂਦਾ।",
            "verse 63:11": "ਅਤੇ ਅੱਲਾਹ ਕਦੇ ਵੀ ਕਿਸੇ ਪ੍ਰਾਣੀ ਨੂੰ ਜਦੋਂ ਉਸ ਦਾ ਸਮਾਂ ਪੂਰਾ ਹੋਂ ਜਾਵੇ, ਮੌਕਾ ਨਹੀਂ ਦਿੰਦਾ। ਅੱਲਾਹ ਜਾਣਦਾ ਹੈ, ਜੋ ਤੁਸੀਂ ਕਰਦੇ ਹੋ।"
        },
        "Roman english": {
            "verse 63:1": "Izaa jaaa`akal munaafiqoona qaaloo nashhadu innaka la rasoolul laah; wallaahu ya`lamu innaka la rasooluhoo wallaahu yashhadu innal munaafiqeena lakaaziboon",
            "verse 63:2": "Ittakhazoo aymaanahum junnatan fasaddoo `an sabeelil laah; innahum saaa`a maa kaanoo ya`maloon",
            "verse 63:3": "Zaalika bi annahum aamanoo summa kafaroo fatubi`a `alaa quloobihim fahum laa yafqahoon",
            "verse 63:4": "Wa izaa ra aytahum tu`jibuka ajsaamuhum wa iny yaqooloo tasma` liqawlihim kaannahum khushubum musannadah; yahsaboona kulla saihatin `alaihim; humul `aduwwu fahzarhum; qaatalahumul laahu annaa yu`fakoon",
            "verse 63:5": "Wa izaa qeela lahum ta`aalaw yastaghfir lakum rasoolul laahi lawwaw ru`oo sahum wa ra aytahum yasuddoona wa hum mustakbiroon",
            "verse 63:6": "Sawaaa`un `alaihim as taghfarta lahum am lam tastaghfir lahum lany yaghfiral laahu lahum; innal laaha laa yahdil qawmal faasiqeen",
            "verse 63:7": "Humul lazeena yaqooloona laa tunfiqoo `alaa man inda Rasoolil laahi hatta yanfaddoo; wa lillaahi khazaaa` inus samaawaati wal ardi wa laakinnal munaafiqeena la yafqahoon",
            "verse 63:8": "Yaqooloona la`ir raja`naaa ilal madeenati la yukhrijanal a`azzu minhal azall; wa lillaahil `izzatu wa li Rasoolihee wa lilmu`mineena wa laakinnal munaafiqeena laa ya`lamoon",
            "verse 63:9": "Yaaa ayyuhal lazeena aamanoo la tulhikum amwaalukum wa laa awlaadukum `anzikril laah; wa mai-yaf`al zaalika fa-ulaaa`ika humul khaasiroon",
            "verse 63:10": "Wa anifqoo mim maa razaqnaakum min qabli any-yaatiya ahadakumul mawtu fa yaqoola rabbi law laaa akhkhartaneee ilaaa ajalin qareebin fa assaddaqa wa akum minassaaliheen",
            "verse 63:11": "Wa lany yu `akhkhiral laahu nafsan izaa jaaa`a ajaluhaa; wallaahu khabeerum bimaa ta`maloon"
        },
        "Russian": {
            "verse 63:1": "Когда к тебе приходят лицемеры, То говорят они: \"Свидетельствуем мы, что ты - посланник от Аллаха\". Да, ведает Аллах, что ты - действительно Его посланник. И Он свидетельствует то, Что лицемеры, истинно, лжецы!",
            "verse 63:2": "И свои клятвы обратили они в щит, (За коим лицемерие и ложь надежно схоронились), Тем самым совращая и других с пути Аллаха, - Поистине, деяния их скверны.",
            "verse 63:3": "И это потому, Что поначалу предались они (Аллаху). Потом же (от Аллаха) отреклись. Тогда печать легла на их сердца, И ничего они сейчас не разумеют.",
            "verse 63:4": "Когда ты видишь их, Тебя их вид прельщает, И, когда речь они ведут, С охотою внимаешь их словам, - Они подобны приставным столбам,",
            "verse 63:5": "Когда им говорят: \"Придите! Посланник Бога возмолИт прощения за вас\", Воротят головы они, и видишь ты, С какой надменностью они уходят.",
            "verse 63:6": "Им все равно - Возмолишь ты об их прощении иль нет. Аллах им не простит, - Ведь возгордившимся неверным Он не укажет праведной стези.",
            "verse 63:7": "Они - все те, кто говорит: \"Не тратьте ничего на тех, Кто у посланника Аллаха. Тогда рассеются они (и город наш покинут)\". Но лишь Аллах сокровищами неба и земли владеет, А лицемеры этого не понимают.",
            "verse 63:8": "И говорят они: \"Коль мы вернемся в город, То те, кто больше чтим, Изгонят из него невежд\". Но лишь Аллах, Его посланник И те, кто верует в Него, Владеют (славой и) почетом, А лицемеры этого не понимают.",
            "verse 63:9": "О вы, кто верует! Пусть ваше состояние и дети Не отвлекают вас от поминания Аллаха, - Ведь тот, кто поступает так, Поистине, несет убыток.",
            "verse 63:10": "Из благ, что Мы вам даровали, Благотворите до того, как смерть настигнет вас, И не придется вам сказать: \"Владыка мой, коль Ты мне дашь короткую отсрочку, Я буду в милостыни щедр и праведным (приду к Тебе)\".",
            "verse 63:11": "Но ни одной душе Господь не даст отсрочки, Когда придет назначенный черед. Он знает все, что делаете вы! (Их совесть нечиста), И каждый вскрик им кажется враждебным. Они - враги, и опасайся их, - Так пусть падет проклятие Аллаха! О, как обмануты они (в своих надеждах)!"
        },
        "Sindhi": {
            "verse 63:1": "جڏھن منافق تو وٽ ايندا آھن (ته) چوندا آھن ته شاھدي ڏيون ٿا ته بيشڪ تون الله جو پيغمبر آھين، ۽ الله ڄاڻندو آھي ته بيشڪ تون سندس پيغمبر آھين، ۽ الله شاھدي ٿو ڏئي ته بيشڪ (اُھي) منافق ڪوڙا آھن.",
            "verse 63:2": "پنھنجن قَسمن کي ڍال (ڪري) ورتو اٿن پوءِ الله جي واٽ کان جھلن ٿا، بيشڪ اُھي جيڪي ڪندا آھن سو بڇڙو آھي.",
            "verse 63:3": "اھو ھن ڪري آھي جو اُنھن ايمان آندو وري انڪار ڪيائون پوءِ انھن جي دلين تي مُھر ھنئي وئي تنھنڪري اُھي نه سمجھندا آھن.",
            "verse 63:4": "۽ (اي پيغمبر تون) جڏھن کين ڏسندو آھين (تڏھن) سندن جُسا توکي وڻندا آھن، ۽ جيڪڏھن ڳالھائيندا آھن ته اُنھن جي ڳالھ ڪَن ڏئي ٻڌندو آھين، ڄڻڪ اُھي اُڀيون ڀِت سان ڪاٺيون رکيل آھن، سڀڪنھن آواز کي پاڻ تي ڀو ڀائيندا آھن، اُھي ويري آھن تنھنڪري کائن حِذ رک، الله کين ھلاڪ ڪري، ڪيڏانھن ڦيرايا ٿا وڃن.",
            "verse 63:5": "۽ جڏھن کين چئبو آھي ته اچو ته الله جو پيغمبر اوھان لاءِ بخشش گھري تڏھن پنھنجا مٿا موڙيندا آھن ۽ انھن کي ڏسندو آھين ته وڏائي ڪندڙ ٿي جھلجن ٿا.",
            "verse 63:6": "تون انھن لاءِ بخشش گھرين يا انھن لاءِ بخشش نه گھرين ته انھن لاءِ ھڪ جھڙي (ڳالھ) آھي، انھن کي الله ڪڏھن نه بخشيندو، بيشڪ الله بي دينن جي قوم کي سِڌو رستو نه ڏيکاريندو آھي.",
            "verse 63:7": "اھي اھڙا آھن جو (ھڪ ٻئي کي) چوندا آھن ته جيڪي (مھاجر) الله جي پيغمبر وٽ آھن تن تي خرچ نه ڪريو تان جو ڇڏي وڃن، ۽ (ھيءَ نه ڄاڻندا آھن ته) آسمانن ۽ زمين جا خزانا خاص الله جا آھن پر (ان ڳالھ کي) مُنافق نه سمجھندا آھن.",
            "verse 63:8": "چوندا آھن ته جيڪڏھن (اسين) مديني ۾ موٽي پُتاسون ته وڌيڪ عِزّت وارو تمام بي عزتي کي اُتان ضرور ڪڍي ڇڏيندو، ۽ عِزّت الله کي ۽ سندس پيغمبر کي ۽ مؤمنن کي آھي پر (اھا ڳالھ) منافق نه ڄاڻندا آھن.",
            "verse 63:9": "اي ايمان وارؤ اوھان کي نڪي اوھان جا مال ۽ نڪي اوھان جا اولاد الله جي ياد ڪرڻ کان ويسلو ڪري، ۽ جيڪي ائين ڪندا سي ئي ڇيئي وارا آھن.",
            "verse 63:10": "۽ جيڪي اوھان کي روزي ڏني اٿون تنھن منجھان اُنھي کان اڳ خرچ ڪريو جو اوھان مان ڪنھن ھڪڙي کي موت پھچي پوءِ چوڻ لڳي ته اي منھنجا پالڻھار جيڪر مون کي ھڪ ٿوري مُدت تائيم مُھلت ڏين ھا ته خيرات ڪريان ھا ۽ صالحن مان ٿيان ھا.",
            "verse 63:11": "۽ جڏھن ڪنھن جيءَ جو اجل ايندو آھي (تڏھن) اُن کي الله ڪڏھن مُھلت نه ڏيندو آھي، ۽ جيڪي ڪندا آھيو تنھنجي الله خبر رکندڙ آھي."
        },
        "Sinhalese": {
            "verse 63:1": "කුහකයෝ නුඹ වෙත පැමිණි විට “නියත වශයෙන්ම නුඹ අල්ලාහ්ගේ දූතයාණන් යැයි අපි සාක්ෂි දරන්නෙමු” යැයි ඔවුහු පවසති. තවද නියත වශයෙන්ම නුඹ ඔහුගේ ගැත්තා බව අල්ලාහ් දනී. තවද නියත වශයෙන්ම කුහකයෝ බොරුකාරයින් බව අල්ලාහ් සාක්ෂි දරයි.",
            "verse 63:2": "ඔවුන්ගේ දිවුරීම් ඔවුන් පලිහක් ලෙස ගෙන අල්ලාහ්ගේ මාර්ගයෙන් (ජනයා) අවහිර කළෝය. නියත වශයෙන්ම ඔවුන් සිදු කරමින් සිටි දෑ නපුරු විය.",
            "verse 63:3": "එය නියත වශයෙන්ම ඔවුන් විශ්වාස කොට පසු ව ප්‍රතික්ෂේප කළ හේතුවෙනි. එවිට ඔවුන්ගේ හදවත් මත මුද්රා තබනු ලැබීය. එහෙයින් ඔවුහු වටහා නොගනු ඇත.",
            "verse 63:4": "තවද නුඹ ඔවුන් දුටු විට ඔවුන්ගේ ශරීර(හැඩරුව) නුඹව විශ්මයට පත් කරනු ඇත. තවද ඔවුන් (යමක්) පවසන්නේ නම් ඔවුන්ගේ ප්‍රකාශයට නුඹ සවන් දෙනු ඇත. නියත වශයෙන්ම ඔවුන් හේත්තු කර තැබු ලී කොටක් මෙනි. සෑම හඬක්ම තමන්ට එරෙහි වූවක් යැයි ඔවුහු සිතති. ඔවුහුමය සතුරෝ. එහෙයින් නුඹ ඔවුන්ගෙන් ප්‍රවේශම් වනු. අල්ලාහ් ඔවුන් විනාශ කරත්වා! ඔවුන් (සත්‍යයෙන්) වෙනතකට යොමු කරනු ලබනුයේ කෙසේ ද?",
            "verse 63:5": "තවද “නුඹලා එනු. අල්ලාහ්ගේ දූතයාණන් නුඹලා වෙනුවෙන් සමාව අයැදිනු ඇතැයි” ඔවුනට කියනු ලැබූ විට ඔවුහු ඔවුන්ගේ හිස් හරවා ගනිති. ඔවුන් උඩඟු වූවන් ලෙස සිටිමින් (අල්ලාහ්ගේ මාර්ගයෙන්) ඔවුන් අවහිර කිරීම නුඹ දකිනු ඇත.",
            "verse 63:6": "නුඹ ඔවුන් වෙනුවෙන් සමාව අයැද සිටිය ද ඔවුන් වෙනුවෙන් නුඹ සමාව නොඇයද සිටිය ද ඔවුන් වෙත එක සමානය. අල්ලාහ් ඔවුනට සමාව නොදෙන්නේමය. නියත වශයෙන්ම අල්ලාහ් පාපතර ජනයාට මග නොපෙන්වයි.",
            "verse 63:7": "ඔවුන් වනාහි ‘අල්ලාහ්ගේ දූතයාණන් අබියස සිටින්නන් කෙරෙහි ඔවුන් වෙන් ව යන තුරු නුඹලා වියදම් නොකරනු’ යැයි (අන් අයට) පවසන්නෝ වෙති. අහස් හා මහපොළොවෙහි සම්පත් අල්ලාහ් සතුය. එනමුත් කුහකයින් වටහා නොගනිති.",
            "verse 63:8": "“අප මදීනාව වෙත හැරී ආවේ නම් උසස් අය පහත් අය ව එයින් පිටුවහල් කරනු ඇතැ”යි ඔවුහු පවසති. සියලු ගෞරවයන් අල්ලාහ් සතුය. තවද ඔහුගේ දූතයාණන් හා දේවත්වය විශ්වාස කරන්නන් සතුය. නමුත් කුහකයින් අවබෝධ කර නොගනිති.",
            "verse 63:9": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලාගේ වස්තුව හෝ නුඹලාගේ දරුවන් අල්ලාහ් මෙනෙහි කිරීමෙන් නුඹලා වෙනතකට යොමු නොකරත්වා! කවරෙකු එය සිදු කරන්නේ ද එවිට ඔවුහුමය අලාභවන්තයෝ.",
            "verse 63:10": "තවද නුඹලා අතරින් කෙනෙකුට මරණය පැමිණීමට පෙර අපි නුඹලාට පෝෂණය කළ දැයින් නුඹලා වියදම් කරනු. “මාගේ පරමාධිපතියාණනි! මද කලකට ඔබ මා ප්‍රමාද කළ යුතු නොවේ ද? එවිට මම පරිත්යාග කරමි. තවද දැහැමියන් අතරින් කෙනෙකු වෙමි” යැයි ඔහු පවසයි.",
            "verse 63:11": "තවද අවසන් කාලය පැමිණි විට කිසිදු ආත්මයක් අල්ලාහ් ප්‍රමාද නොකරන්නේමය. තවද අල්ලාහ් නුඹලා සිදු කරන දෑ පිළිබඳ ව අභිඥානවන්තය."
        },
        "Somali": {
            "verse 63:1": "Markay kuu timaadaan (Nabiyow) munaafiqiintu waxay dhihi waxaan marag ka nahay inaad tahay Rasuul Eebe, Ilaahayna waa ogyahay inaad tahay, rasuulkiisii Eebana wuxuu marag ka yahay inay Munaafiqiintu beenaalayaal yihiin (xaqa niyada).",
            "verse 63:2": "Dhaartooda (beenta ah) yey ka dhigteen gaashaan, dadkane waxay ka iileen Jidkii Eebe, waxay samayna aad buu u xunyahay.",
            "verse 63:3": "Saas waxaa ugu wacan inay (xaga muuqda) rumeeyeen haddana (hoosta) ka gaaloobeen, Quluubtoodana waa la daabacay (la daboolay) wax xaq ahna ma kasayaan.",
            "verse 63:4": "Haddaad aragto Munaafiqiinta waad la yaabi Jidhkooda, muuqooda, hadday hadlaanna waad dhagaysan hadalkooda, waxaadse moodaa dogobyo la tiirtiiriyey, qayladii yeedhabana way ka cabsadaan, waa Col kuwaasi, Eebena ha lacnado ee xagee loo duufsan.",
            "verse 63:5": "Marka lagu dhaho Munaafiqiinta kaalaya ha idiin dambi dhaaf weydiiye Rasuulka Eebe waxay ruxaan Madaxa (diico darteed) waxaad aragtaa iyagoo jeedsan oo iskibrin.",
            "verse 63:6": "Waa isku mid haddaad u dambi dhaaf weydiisid (Nabiyow) iyo haddii kale, marnaba Eebe u dambi dhaafi mahayo, maxaa yeelay Eebe ma hanuuniyo dad Faasiqiin ah.",
            "verse 63:7": "Waa kuwa dhihi (Munaafiqiintu) ha quudinina kuwa Rasuulka la jooga intay ka kala tagaan, Eebaa iska leh khasnadaha Samaawaatka iyo Dhulka, haseyeeshee Munaafiqiintu ma fahansana.",
            "verse 63:8": "Munaafiqiintu waa kuwa dhihi haddaan Madiino u noqonno waa in kuwa tabarta lihi ka bixiyaan Magaalada kuwa dullaysan, tabar iyo Sharaf Eebaa iska leh Rasuulkiisa iyo Mu'miniinta, haseyeeshee Munaafiqiintu ma oga.",
            "verse 63:9": "Kuwa xaqa rumeeyow yaanay idin ka shuqlinin Xoolihiinnu iyo Caruurtiinnu xuska Eebe (daacaddiisa) Ciddii saas fashaana waa mid khasaartay.",
            "verse 63:10": "Bixiyana wax ka mid ah waxa Eebe idinku arsuqay geerida horteeda oo markaas uu yiraahdo (ruuxaan wax baxsan) Eebow maad muddo dhow dib ii dhigtid oon sadaqaysto kuwa suubanna aan ka mid noqdee.",
            "verse 63:11": "Naf malageed galayna Eebe dib uma dhigo, Ilaahayna waa ogyahay waxaad Camal falaysaan."
        },
        "Spanish": {
            "verse 63:1": "Cuando vienen a ti los hipócritas, dicen: Atestiguamos que tú eres el Mensajero de Allah. Allah sabe que tú eres Su mensajero y Allah atestigua que los hipócritas son mentirosos.",
            "verse 63:2": "Toman sus juramentos como tapadera y desvían del camino de Allah. Qué malo es lo que hacen!",
            "verse 63:3": "Eso es porque han renegado después de haber creído y sus corazones han sido sellados, de manera que no entienden.",
            "verse 63:4": "Cuando los ves, te gusta su aspecto y si hablan, sus palabras captan tu atención. Son como maderos que no sostienen nada. Creen que cualquier grito va dirigido contra ellos.Ellos son el enemigo, tened cuidado. Mátelos Allah! Cómo mienten!",
            "verse 63:5": "Y cuando se les dice: Venid para que el Mensajero pida perdón por vosotros, vuelven la cabeza y los ves que se apartan con soberbia.",
            "verse 63:6": "Es igual que pidas perdón por ellos o que no, Allah no los va a perdonar.Es cierto que Allah no guía a la gente descarriada.",
            "verse 63:7": "Ellos son los que dicen: No gastéis en favor de los que están con el Mensajero hasta que no se separen de él.A Allah pertenecen los tesoros de los cielos y de la tierra, sin embargo los hipócritas no comprenden.",
            "verse 63:8": "Dicen: Si regresamos a Medina, los más poderosos expulsarán a los más débiles.De Allah es el poder y de Su mensajero y de los creyentes, pero los hipócritas no saben.",
            "verse 63:9": "Vosotros que creéis! Que ni vuestras riquezas ni vuestros hijos os distraigan del recuerdo de Allah.Y quien lo haga...Esos son los perdedores.",
            "verse 63:10": "Gastad de la provisión que os damos antes de que le llegue la muerte a cualquiera de vosotros y diga: Señor mío! Si me dieras un poco más de plazo, podría dar con generosidad y ser de los rectos.",
            "verse 63:11": "Pero Allah no va a dar ningún plazo a nadie cuando le llegue su fin. Allah conoce perfectamente lo que hacéis."
        },
        "Swahili": {
            "verse 63:1": "Wanapo kujia wanaafiki husema: Tunashuhudia ya kuwa wewe ni Mtume wa Mwenyezi Mungu. Na Mwenyezi Mungu anajua kuwa wewe ni Mtume wa Mwenyezi Mungu, na Mwenyezi Mungu anashuhudia ya kuwa hakika wanaafiki ni waongo.",
            "verse 63:2": "Wamevifanya viapo vyao ni kinga, na wao wakajizuia kuifuata Njia ya Mwenyezi Mungu. Hakika ni mabaya kabisa waliyo kuwa wakiyafanya.",
            "verse 63:3": "Hayo ni kwa sababu ya kuwa waliamini, kisha wakakufuru; kwa hivyo umepigwa muhuri juu ya nyoyo zao. Kwa hivyo hawafahamu lolote.",
            "verse 63:4": "Na unapo waona, miili yao inakupendeza, na wakisema, unasikiliza usemi wao. Lakini wao ni kama magogo yaliyo egemezwa. Wao hudhania kila ukelele unao pigwa ni kwa ajili yao. Hao ni maadui; tahadhari nao. Mwenyezi Mungu awaangamizilie mbali! Vipi wanapotoka na haki?",
            "verse 63:5": "Na wanapo ambiwa: Njooni ili Mtume wa Mwenyezi Mungu akuombeeni maghfira, huvigeuza vichwa vyao, na unawaona wanageuka nao wamejaa kiburi.",
            "verse 63:6": "Sawa sawa kwao, ukiwatakia maghfira au hukuwatakia maghfira, Mwenyezi Mungu hatawaghufiria. Hakika Mwenyezi Mungu hawaongoi watu wapotovu.",
            "verse 63:7": "Hao ndio wanao sema: Msitoe mali kwa ajili ya walioko kwa Mtume wa Mwenyezi Mungu, ili waondokelee mbali! Na Mwenyezi Mungu ndiye Mwenye khazina za mbingu na ardhi, lakini wanaafiki hawafahamu.",
            "verse 63:8": "Wanasema: Tukirejea Madina mwenye utukufu zaidi bila ya shaka atamfukuza aliye mnyonge. Na Mwenyezi Mungu ndiye Mwenye utukufu - Yeye, na Mtume wake, na Waumini. Lakini wanaafiki hawajui.",
            "verse 63:9": "Enyi mlio amini! Yasikusahaulisheni mali yenu, wala watoto wenu, kumkumbuka Mwenyezi Mungu. Na wenye kufanya hayo ndio walio khasiri.",
            "verse 63:10": "Na toeni katika tulicho kupeni kabla hayajamfikia mmoja wenu mauti, tena hapo akasema: Mola wangu Mlezi! Huniakhirishi muda kidogo nipate kutoa sadaka, na niwe katika watu wema?",
            "verse 63:11": "Wala Mwenyezi Mungu hataiakhirisha nafsi yoyote inapo fika ajali yake; na Mwenyezi Mungu anazo khabari za mnayo yatenda."
        },
        "Swedish": {
            "verse 63:1": "NÄR HYCKLARNA kommer till dig säger de: \"Vi vittnar att du är Guds Sändebud!\" Men Gud vet att du är Hans Sändebud, och Gud vittnar att hycklarna ljuger.",
            "verse 63:2": "De svär sina eder för att skydda sig och på så sätt leder de [andra] bort från Guds väg; det de gör är ont,",
            "verse 63:3": "därför att de utåt bekänner tron men förnekar den [i hjärtat] - och då förseglas deras hjärtan så att sanningen inte kan nå dem.",
            "verse 63:4": "När du ser dem kan du få ett gott intryck av deras yttre och du lyssnar på dem när de talar. [I själva verket är de lika andefattiga] som uppstöttade trästockar, och [i sin rädsla och osäkerhet] tror de att varje rop [från mängden] är ett hot mot dem. De är dina fiender, [Muhammad]; - var därför på din vakt mot dem. Guds förbannelse över dem! Hur förvirrade är inte deras begrepp!",
            "verse 63:5": "När de uppmanas: \"Kom [och låt] Guds Sändebud be att Han förlåter er!\" vänder de bort huvudet och du ser dem dra sig undan, fulla av högmod.",
            "verse 63:6": "Vad dem beträffar är det likgiltigt om du ber om förlåtelse för dem eller inte - Gud kommer inte att förlåta dem. Gud vägleder inte dem som förhärdats i synd och trots.",
            "verse 63:7": "Det är de som säger [till andra]: \"Ge ingenting till dem som sluter upp kring Guds Sändebud; då ger de sig nog av härifrån!\" - Men himlarnas och jordens skatter tillhör Gud, fastän hycklarna inte förstår det.",
            "verse 63:8": "De säger [också]: \"Om vi kommer tillbaka till staden [från detta fälttåg], skall de som har makten helt säkert driva bort dessa föraktliga stackare härifrån!\" - Men [den verkliga] makten ligger hos Gud - och Hans Sändebud och de troende - och det vet inte hycklarna.",
            "verse 63:9": "TROENDE! Låt inte [omsorgen om] era ägodelar och [bekymren för] era barn få er att glömma att åkalla Guds namn; de som gör detta är förlorarna.",
            "verse 63:10": "Och ge av det som Vi har skänkt er för er försörjning innan ni känner döden närma sig och ni säger: \"Herre! Ge mig bara ett kort uppskov; då skall jag ge åt de behövande och leva som en rättskaffens människa!\"",
            "verse 63:11": "Men Gud beviljar inte uppskov åt den vars tid har löpt ut, och Gud har full kännedom om vad ni gör."
        },
        "Tajik": {
            "verse 63:1": "Чун мунофиқон назди ту оянд, гӯянд: «Шаҳодат (гувоҳӣ) медиҳем, ки ту паёмбари Худо ҳастӣ». Худо медонад, ки ту паёмбараш ҳастӣ ва Худо шоҳидӣ медиҳад, ки мунофиқон дурӯғгӯянд.",
            "verse 63:2": "Аз савгандҳои худ сипаре сохтанд ва аз роҳи Худо боздоштанд ва ба ҳақиқат он чӣ мекунанд, нописанд аст.",
            "verse 63:3": "Ин ба он сабаб аст, ки имон оварданд, сипас кофир шуданд. Худо низ бар дилҳошон мӯҳр ниҳод ва онон дарнамеёбанд.",
            "verse 63:4": "Чун онҳоро бубинӣ, туро аз зоҳирашон хуш меояд ва чун сухан бигӯянд, ба суханашон гӯш медиҳӣ. Гӯё ки чӯбҳое ҳастанд ба девор такя дода. Ҳар овозеро ба зиёни худ мепиндоранд. Онҳо душманонанд. Аз онҳо ҳазар кун. Худояшон бикушад. Ба куҷо каҷрав мешаванд?",
            "verse 63:5": "Чун ба онҳо гуфта шавад, ки биёед, то паёмбари Худо бароятон бахшоиш бихоҳад, сар мепечанд. Мебинӣ, ки рӯйгардониву такаббурӣ мекунанд.",
            "verse 63:6": "Тафовуте накунад, чӣ барояшон бахшоиш бихоҳӣ, чӣ бахшоиш нахоҳӣ. Худояшон нахоҳад бахшид. Ва Худо мардуми нофармонро ҳидоят намекунад!",
            "verse 63:7": "Инҳо ҳамонҳоянд, ки мегӯянд: «Бар онҳо, ки гирди паёмбари Худоянд, чизе надиҳед, то аз гирдаш пароканда шаванд». Ва ҳол, он ки хазинаҳои осмонҳову замин аз они Худост, вале мунофиқон намефаҳманд!",
            "verse 63:8": "Мегӯянд: «Чун ба Мадина, бозгардем, соҳибони иззат хору залилҳоро аз он ҷо берун хоҳанд кард». Иззат аз они Худову паёмбараш ва мӯъминон аст. Вале мунофиқон намедонанд.",
            "verse 63:9": "Эй касоне, ки имон овардаед, молҳову авлодатон шуморо аз зикри Худо, ба худ машғул надорад, ки ҳар кӣ чунин кунад, зиёнкор аст.",
            "verse 63:10": "Аз он чӣ рӯзиятон додаем, дар роҳи Худо садақа кунед, пеш аз он ки яке' аз шуморо марг фаро расад ва бигӯяд; «Эй Парвардигори ман, чаро марги маро андаке ба дертар наяндохтӣ, то садақа диҳам ва аз шоистагон бошам?»",
            "verse 63:11": "Чун касе аҷалаш фаро расад, Худо марги ӯро ба таъхир (дертар) намегузорад, Ва Худо ба корҳое, ки мекунед, огоҳ аст!"
        },
        "Tamil": {
            "verse 63:1": "\"(நபியே!) முனாஃபிக்குகள் (நயவஞ்சகர்கள்) உம்மிடம் வந்து, \"நிச்சயமாக, நீர் அல்லாஹ்வின் தூதராக இருக்கின்றீர்\" என்று நாங்கள் சாட்சி சொல்கிறோம்\" என்று கூறுகின்றனர். மேலும், அல்லாஹ், \"நிச்சயமாக நீர் அவனுடைய தூதராக இருக்கின்றீர்\" என்பதை நன்கு அறிவான். ஆனால், அல்லாஹ், நிச்சயமாக முனாஃபிக்குகள் (வஞ்சகமாகப்) பொய்யுரைப்பவர்கள்\" என்பதாகச் சாட்சி சொல்கிறான்.",
            "verse 63:2": "இவர்கள் தங்களுடைய (பொய்ச்)சத்தியங்களைக் கேடயமாக வைத்துக் கொண்டு அல்லாஹ்வின் பாதையிலிருந்து (மக்களைத்) தடுத்தும் வருகின்றனர், நிச்சயமாக இவர்கள் செய்து கொண்டிருப்பது மிகவும் கெட்டது.",
            "verse 63:3": "இது நிச்சயமாக இவர்கள் ஈமான் கொண்டு பின் காஃபிர் ஆகி விட்டதனாலேயாகும், ஆகவே இவர்களின் இதயங்கள் மீது முத்திரையிடப்பட்டு விட்டது, எனவே, அவர்கள் விளங்கிக் கொள்ள மாட்டார்கள்.",
            "verse 63:4": "இவர்களை நீர் பார்த்தால், இவர்களுடைய உடல் (அமைப்பு)கள் உம்மை ஆச்சரியப்படுத்தும்; அன்றியும் இவர்கள் பேசினால், இவர்களுடைய பேச்சை நீர் (கவனித்துக்) கேட்பீர்; எனினும் இவர்கள் (நேர்மையானவர்கள் அல்லர், சுவரில்) சாய்த்து வைக்கப்பட்ட மரங்கள் போன்று இருக்கின்றனர், ஒவ்வொரு சப்தமும் தங்களுக்கு எதிரானது என்று எண்ணுகிறார்கள், இவர்கள்தாம் (உம்) பகைவர்கள், ஆகவே இவர்களிடம் நீர் எச்சரிக்கையாக இருப்பீராக, அல்லாஹ் இவர்களை அழித்து விடுவான், இவர்கள் (சத்தியத்திலிருந்து) எங்கு செல்கின்றனர்?",
            "verse 63:5": "இன்னும், \"வாருங்கள்; அல்லாஹ்வின் தூதர் உங்களுக்காக (இறைவனிடம்) பாவமன்னிப்புத் தேடுவார் என்று இவர்களிடம் கூறப்பட்டால், இவர்கள் தங்கள் தலைகளைச் சாய்த்துக் கொண்டு, பெருமை கொண்டவர்களாகத் திருப்பிச் செல்வதை நீர் காண்பீர்.",
            "verse 63:6": "அவர்களுக்காக நீர் பாவமன்னிப்புக் கோரினாலும் அல்லது பாவமன்னிப்புக் கோராவிட்டாலும் அவர்களுக்குச் சமமேயாகும், அல்லாஹ் அவர்களுக்குப் பாவமன்னிப்பளிக்க மாட்டான் - பாவம் செய்யும் சமூகத்தாரை நிச்சயமாக அல்லாஹ் நேர்வழியில் செலுத்த மாட்டான்.",
            "verse 63:7": "இவர்கள் தாம், அல்லாஹ்வின் தூதருடன் இருப்பவர்கள், (அவரை விட்டுப்) பிரிந்து செல்லும் வரை அவர்களுக்காக நீங்கள் செலவு செய்யாதீர்கள்\" என்று கூறியவர்கள், வானங்களிலும், பூமியிலுமுள்ள பொக்கிஷங்கள் அல்லாஹ்வுக்கே சொந்தமானவை, ஆனால் இந்நயவஞ்சகர்கள் (அதை) உணர்ந்து கொள்ளமாட்டார்கள்.",
            "verse 63:8": "நாங்கள் அல்மதீனாவுக்குத் திரும்புவோமானால், கண்ணியமானவர்கள் தாழ்ந்தவர்களை அதிலிருந்து நிச்சயமாக வெளியேற்றிவிடுவார்கள்\" என்று அவர்கள் கூறுகின்றனர், ஆனால் கண்ணியம் அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும், முஃமின்களுக்குமே உரியது, எனினும், இந்நயவஞ்சர்கள் (அதை) அறிந்து கொள்ளமாட்டார்கள்.",
            "verse 63:9": "ஈமான் கொண்டவர்களே! உங்கள் செல்வமும், உங்களுடைய மக்களும், அல்லாஹ்வின் நினைப்பை விட்டும் உங்களைப் பராமுகமாக்கிவிட வேண்டாம் - எவர் இவ்வாறு செய்கிறாரோ நிச்சயமாக அவர்கள்தாம் நஷ்டமடைந்தவர்கள்.",
            "verse 63:10": "உங்களில் ஒருவருக்கு மரணம் வருமுன்னரே, நாம் உங்களுக்கு அளித்த பொருளிலிருந்து, தான தர்மம் செய்து கொள்ளுங்கள், (அவ்வாறு செய்யாது மரணிக்கும் சமயம்); \"என் இறைவனே! என் தவணையை எனக்கு சிறிது பிற்படுத்தக் கூடாதா? அப்படியாயின் நானும் தான தர்மம் செய்து ஸாலிஹான (நல்ல)வர்களில் ஒருவனாக ஆகிவிடுவேனே\" என்று கூறுவான்.",
            "verse 63:11": "ஆனால், அல்லாஹ், எந்த ஆத்மாவுக்கும் அதன் தவணை வந்துவிட்டால் (அதனைப்) பிற்படுத்த மாட்டான் - நீங்கள் செய்பவற்றை அல்லாஹ் நன்கு தெரிந்தே இருக்கின்றான்."
        },
        "Tatar": {
            "verse 63:1": "Ий Мухәммәд г-м, әгәр монафикълар сиңа килсәләр әйтәләр: \"Без гуаһлык бирәбез тәхкыйк син Аллаһуның расүлесең\", – дип. Аллаһ беләдер тәхкыйк син Аның расүлесең, әлбәттә, монафикълар ялганчылар, дип Аллаһ гуаһлык бирәдер.",
            "verse 63:2": "Үзләрен үтерелүдән коткару өчен ялган гуаһларын үзләренә калкан-пәрдә иттеләр һәм кешеләрне Аллаһ юлында сугышудан һәм Коръән белән гамәл кылудан тыйдылар. Аларның кылган эшләре нинди ямандыр.",
            "verse 63:3": "Аларның бу эше иман китергәннән соң Коръән белән гамәл кылудан баш тартып кәфер булганнары өчендер, аларның күңелләренә көферлек, иманны кабул итмәүлек беркетелде, инде алар Коръән белән гамәл кылмаган кешенең иманы юклыгын аңламаслар.",
            "verse 63:4": "Әгәр син аларны күрсәң, аларның тышкы сурәтләре сине ґәҗәбләндерер, ягъни тышкы күренешләре мөселманга охшар. Әгәр сөйләсәләр, син аларның сүзләрен тыңларсың, гүя сөяп куйган коры агач кебиләрдер – сүзләрендә дәлил һәм хаклык булмас, алар һәр ишетелгән тавышны үзләренең зарарына дип уйларлар, ягъни үзләренең бозыклык кылганлыкларыннан кайчан ґәзаб килер икән, дип куркып кына яшиләр. Алар Исламга һәм мөселманнарга дошманнардыр, шуның өчен алардан саклан! Аллаһуның каһәре суксын аларны, хакны ташлап кайда бармакчы булалар!",
            "verse 63:5": "Әгәр аларга Исламга вә пәйгамбәргә хак ышану белән килегез, Аллаһуның расүле сезнең өчен Аллаһудан гафу сорасын диелсә, алар башларын читкә боралар, вә син аларны күрерсең Аллаһудан гафу сораудан баш тарталар, һәм алар тәкәбберләнүчеләрдер.",
            "verse 63:6": "Алар өчен бертигездер, кирәк алар өчен Аллаһудан ярлыкауны сора, кирәк – сорама, әлбәттә, Аллаһ аларны һич та ярлыкамас. Тәхкыйк Аллаһ монафикъ булган фәсыйкларны туры юлга күндермәс.",
            "verse 63:7": "Ул монафикълар ансарларга әйтерләр: \"Мүхаҗирләргә ярдәм итмәгез, малыгызны бирмәгез пәйгамбәр янында булганнарга хәтта таралып киткәннәренә чаклы\", – дип. Җирдә вә күкләрдә булган байлык Аллаһу тәгаләнекедер, ләкин монафикълар һичнәрсә уйламаслар.",
            "verse 63:8": "Ул монафикълар әйтерләр: \"Әгәр Мәдинәга кайтсак, әлбәттә, дәрәҗәдә өстенрәк кеше түбәнрәк кешене Мәдинәдән чыгарачак\" – дип. Ягъни бер сугыштан соң монафикъларның башлыгы, әгәр Мәдинәгә кайтсак, әлбәттә, Мухәммәдне вә аңа ияргәннәрне шәһәрдән чыгарачакбыз, диде. Бит куәт һәм өстенлек Аллаһудадыр вә Аллаһудан Аның рәсүленәдер һәм мөэминнәргәдер, ләкин монафикълар ул хакта һичнәрсә белмиләр.",
            "verse 63:9": "Ий мөэминнәр, сезне малларыгыз һәм балаларыгыз Аллаһ зекереннән алдамасын, намаздан туктатмасын һәм Коръән белән гамәл кылудан гафил итмәсен. Әгәр бу эшне берәү кылса, ягъни малына вә балаларына алданып иманына, диненә кимчелек китерсә, андый кешеләр ахирәттә ґәзабта, булып хәсрәтләнүчеләрдер.",
            "verse 63:10": "Без сезгә биргән малдан мохтаҗларга һәм Аллаһ юлына бирегез сездән берегезгә үлем килмәс борын, үлем килгәч, ул кеше әйтер: \"Ий Раббым, минем үлемемне аз гына вакытка кичектерсәңче, садакалар бирер идем һәм башка изгелекләрне эшләп яхшы кешеләрдән булыр идем\", – дип.",
            "verse 63:11": "Аллаһ сезнең һичберегездән әҗәлне кичектермәс, әгәр аның әҗәле килсә. Аллаһ сезнең барча эшләрегездән хәбәрдардыр."
        },
        "Telugu": {
            "verse 63:1": "(ఓ ప్రవక్తా!) ఈ కపట విశ్వాసులు (మునాఫిఖూన్) నీ వద్దకు వచ్చినపుడు, ఇలా అంటారు: నీవు అల్లాహ్ యొక్క సందేశహరుడవని మేము సాక్ష్యమిస్తున్నాము.\" మరియు నిశ్చయంగా, నీవు ఆయన సందేశహరుడవని అల్లాహ్ కు తెలుసు మరియు ఈ కపట విశ్వాసులు, నిశ్చయంగా అసత్యవాదులని అల్లాహ్ సాక్ష్యమిస్తున్నాడు",
            "verse 63:2": "వారు తమ ప్రమాణాలను ఢాలుగా చేసుకున్నారు. ఆ విధంగా వారు (ఇతరులను) అల్లాహ్ మార్గం నుండి నిరోధిస్తున్నారు. నిశ్చయంగా, వారు చేస్తున్న చేష్టలు ఎంతో నీచమైనవి",
            "verse 63:3": "ఇది నిశ్చయంగా, వారు విశ్వసించిన తరువాత సత్యతిరస్కారులవటం మూలంగానే జరిగింది కావున వారి హృదయాల మీద ముద్ర వేయబడి ఉంది. కనుక వారు ఏమీ అర్థం చేసుకోలేరు",
            "verse 63:4": "మరియు నీవు గనక వారిని చూస్తే! వారి రూపాలు నీకు ఎంతో అద్భుతమైనవిగా కనిపిస్తాయి. మరియు వారు మాట్లాడినప్పుడు, నీవు వారి మాటలను వింటూ ఉండిపోతావు. నిశ్చయంగా, వారు గోడకు ఆనించబడిన మొద్దువలే ఉన్నారు. వారు ప్రతి అరుపును తమకు వ్యతిరేకమైనదిగానే భావిస్తారు. వారు శత్రువులు, కావున వారి పట్ల జాగ్రత్తగా ఉండు. అల్లాహ్ వారిని నాశనం చేయుగాక! వారెంత పెడమార్గంలో పడి వున్నారు",
            "verse 63:5": "మరియు వారితో: రండి, అల్లాహ్ ప్రవక్త మీ క్షమాపణ కొరకు (అల్లాహ్ ను) ప్రార్థిస్తాడు.\" అని అన్నప్పుడు, వారు తమ తలలు త్రిప్పుకోవటాన్ని మరియు దురహంకారంతో మరలి పోవటాన్ని నీవు చూస్తావు",
            "verse 63:6": "(ఓ ప్రవక్తా!) నీవు వారి కొరకు క్షమాపణ కోరినా లేక క్షమాపణ కోరకపోయినా వారి విషయంలో రెండూ సమానమే! (ఎందుకంటే) అల్లాహ్ వారిని ఎంత మాత్రం క్షమించడు. నిశ్చయంగా, అల్లాహ్ అవిధేయులకు మార్గదర్శకత్వం చేయడు",
            "verse 63:7": "వారే (కపట విశ్వాసులే) ఇలా అంటూ ఉండేవారు: అల్లాహ్ సందేశహరుని వద్దనున్న వారిపై మీరు ఖర్చు చేయకుండా ఉంటే! చివరకు వారే చెల్లాచెదురై పోతారు.\" వాస్తవానికి ఆకాశాలలో మరియు భూమిలోనున్న సమస్త కోశాగారాలు అల్లాహ్ కే చెందినవి. కాని ఈ కపట విశ్వాసులు అది గ్రహించలేరు",
            "verse 63:8": "వారు (కపట విశ్వాసులు) ఇంకా ఇలా అంటున్నారు: మనం మదీనా నగరానికి తిరిగి వెళ్ళిన తరువాత, నిశ్చయంగా గౌరవనీయులమైన (మనం), అక్కడ వున్న తుచ్ఛమైన వారిని తప్పక వెడలగొడదాం.\" మరియు గౌరవమనేది అల్లాహ్ కు, ఆయన సందేశహరునికి మరియు విశ్వాసులకు మాత్రమే చెందినది, కాని ఈ కపట విశ్వాసులకు అది తెలియదు",
            "verse 63:9": "ఓ విశ్వాసులారా! మీ సంపదలు, మీ సంతానం మిమ్మల్ని అల్లాహ్ స్మరణ నుండి నిర్లక్ష్యంలో పడవేయరాదు సుమా! ఎవరైతే ఇలా నిర్లక్ష్యంలో పడతారో అలాంటి వారే నష్టపడేవారు",
            "verse 63:10": "మరియు మీలో ఎవరికైనా మరణ సమయం సమీపించి: ఓ నా ప్రభూ! నీవు నాకు మరి కొంత వ్యవధి ఎందుకివ్వలేదు! నేను దానధర్మాలు చేసి, సత్పురుషులలో చేరి పోయేవాడిని కదా?\" అని పలికే స్థితి రాకముందే, మేము మీకు ప్రసాదించిన జీవనోపాధి నుండి ఖర్చు చేయండి",
            "verse 63:11": "కాని ఒక వ్యక్తికి (మరణ) సమయం ఆసన్నమైనప్పుడు అల్లాహ్ అతనికి ఏ మాత్రం వ్యవధినివ్వడు. మరియు మీరు చేస్తున్నదంతా అల్లాహ్ బాగా ఎరుగును"
        },
        "Thai": {
            "verse 63:1": "เมื่อพวกสับปลับ (มุนาฟินกูน) มาหาเจ้า พวกเขากล่าวว่า เราขอปฏิญาณว่า แท้จริงท่านเป็นร่อซูลของอัลลอฮฺแต่อัลลอฮฺทรงรู้ดียิ่งว่า แท้จริงเจ้านั้นเป็นร่อซูลของพระองค์อย่างแน่นอน และอัลลอฮฺทรงเป็นพยานว่า แท้จริงพวกมุนาฟิกีนนั้นเป็นผู้กล่าวเท็จอย่างแน่นอน",
            "verse 63:2": "พวกเขาได้ถือเอาการสาบานของพวกเขาเป็นโล่ห์แล้วก็กีดกันจากทางของอัลลอฮฺ แท้จริง สิ่งที่พวกเขาได้กระทำไปนั้นช่างชั่วช้าจริง ๆ",
            "verse 63:3": "นั่นเป็นเพราะพวกเขาศรัทธาแล้วก็ปฏิเสธศรัทธา ดังนั้นจึงถูกผนึกบนหัวใจของพวกเขาแล้วพวกเขาก็ไม่เข้าใจ",
            "verse 63:4": "และเมื่อเจ้าได้เห็นพวกเขาแล้วร่างกายของพวกเขาจะเป็นที่พึงพอใจแก่เจ้า และหากพวกเขาพูด เจ้าก็จะฟังคำพูดของพวกเขา ประหนึ่งว่าพวกเขาเป็นท่อนไม้ที่ถูกยันไว้ พวกเขาคิดว่าทุก ๆ เสียงร้องนั้นเป็นปฏิปักษ์ต่อพวกเขา พวกเขาคือศัตรู ดังนั้นจงระวังพวกเขา ขออัลลอฮฺทรงให้ความอัปยศแก่พวกเขา ทำไมเล่าพวกเขาจึงหันเหออกไปทางอื่น",
            "verse 63:5": "และเมื่อได้มีเสียงกล่าวแก่พวกเขาว่า จงมาเถิดร่อซูลของอัลลอฮฺ จงขออภัยโทษให้แก่พวกท่าน พวกเขาก็หันศีรษะของพวกเขาไปอีกทางหนึ่ง และเจ้าเห็นพวกเขาผินหลังออกไปทั้ง ๆ ที่พวกเขาเป็นผู้หยิ่งผยอง",
            "verse 63:6": "มีผลเท่ากันแก่พวกเขาที่เจ้าจะขออภัยโทษให้แก่พวกเขาหรือไม่ขออภัยโทษแก่พวกเขาก็ตาม อัลลอฮฺจะไม่ทรงอภัยโทษให้แก่พวกเขา แท้จริงอัลลอฮฺจะไม่ทรงชี้แนะทางแก่หมู่ชนผู้ฝ่าฝืน",
            "verse 63:7": "พวกเขาคือผู้ที่กล่าวว่า อย่าบริจาคให้แก่ผู้ที่อยู่กับร่อซูลของอัลลอฮฺ เพื่อพวกเขาจะได้แยกย้ายออกไป แต่ขุมคลังแห่งชั้นฟ้าทั้งหลายและแผ่นดินนั้นเป็นของอัลลอฮฺ แต่ว่าพวกมุนาฟิกีนไม่เข้าใจ",
            "verse 63:8": "พวกเขากล่าวว่า ถ้าเรากลับไปยังนครมะดีนะฮฺ พวกที่มีเกียรติกว่าจะขับไล่พวกที่ต่ำต้อยออกจากนครมะดีนะฮฺส่วนอำนาจนั้นเป็นของอัลลอฮฺ และร่อซูลของพระองค์และบรรดาผู้ศรัทธา แต่ว่าพวกมุนาฟิกีนนั้นหารู้ไม่",
            "verse 63:9": "โอ้บรรดาผู้ศรัทธาเอ๋ย อย่าให้ทรัพย์สินของพวกเจ้าและลูกหลานของพวกเจ้าหันเหพวกเจ้าจากการรำลึกถึงอัลลอฮฺ และผู้ใดกระทำเช่นนั้น ชนเหล่านั้นคือพวกที่ขาดทุน",
            "verse 63:10": "และจงบริจาคจากสิ่งที่เราได้ให้ปัจจัยยังชีพแก่พวกเจ้าก่อนที่ความตายจะเกิดขึ้นแก่ผู้ใดในหมู่พวกเจ้า แล้วเขาก็จะกล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ มาตรว่าพระองค์ท่านทรงผ่อนผันให้แก่ข้าพระองค์อีกชั่วเวลาเพียงเล็กน้อยเพื่อที่ข้าพระองค์จะได้บริจาคและข้าพระองค์ก็จะอยู่ในหมู่คนดีทั้งหลาย (ผู้ทรงคุณธรรม)",
            "verse 63:11": "แต่อัลลอฮฺจะไม่ทรงผ่อนผันให้แก่ชีวิตใด เมื่อกำหนดของมันได้มาถึงแล้ว และอัลลอฮฺนั้นทรงรู้ดียิ่งในสิ่งที่พวกเจ้ากระทำ"
        },
        "Turkish": {
            "verse 63:1": "İkiyüzlüler sana gelince: \"Senin şüphesiz Allah'ın Peygamberi olduğuna şehadet ederiz\" derler. Allah, senin kendisinin peygamberi olduğunu bilir; bunun yanında Allah, ikiyüzlülerin yalancı olduklarını da bilir.",
            "verse 63:2": "Onlar, yeminlerini kalkan edinerek Allah'ın yolundan alıkoyarlar. İşledikleri işler gerçekten ne kötüdür!",
            "verse 63:3": "Bu, önce inanıp sonra inkar etmiş olmalarındandır. Bu yüzden kalbleri mühürlenmiştir; artık anlamazlar.",
            "verse 63:4": "Onlara baktığın zaman cüsseleri hoşuna gider; konuşurlarsa sözlerini dinlersin; tıpkı, sıralanmış kof kütük gibidirler; her çığlığı kendi aleyhlerine sayarlar; onlar düşmandır, onlardan çekin; Allah canlarını alsın, nasıl da aldatılıp döndürülüyorlar.",
            "verse 63:5": "Onlara: \"Gelin de Allah'ın Peygamberi sizin için mağfiret dilesin\" dendiği zaman, başlarını çevirirler; büyüklük taslayarak yüz çevirdiklerini görürsün.",
            "verse 63:6": "Onlar için, bağışlanma dilesen de dilemesen de birdir; Allah onları bağışlamayacaktır. Doğrusu Allah, yoldan çıkmış milleti doğru yola eriştirmez.",
            "verse 63:7": "Bunlar: \"Allah'ın Peygamberinin yanında bulunanlara bir şey vermeyin de dağılıp gitsinler\" diyen kimselerdir. Oysa göklerin ve yerin hazineleri Allah'ındır, ama ikiyüzlüler bu gerçeği anlamazlar.",
            "verse 63:8": "\"Eğer bu savaşdan Medine'ye dönersek, şerefli kimseler alçakları and olsun ki, oradan çıkaracaktır\" diyorlardı. Oysa, şeref Allah'ın, Peygamberinin ve inananlarındır, ama ikiyüzlüler bu gerçeği bilmezler.",
            "verse 63:9": "Ey inananlar! Sizi, mallarınız ve çocuklarınız Allah'ı anmaktan alıkoymasın; böyle olanlar hüsrana uğrayanlardır.",
            "verse 63:10": "Birine ölüm gelip de: \"Rabbim! Beni yakın bir süreye kadar ertelesen de, sadaka versem, iyilerden olsam\" diyeceği zaman gelmezden önce, size verdiğimiz rızıklardan sarfedin.",
            "verse 63:11": "Bir canın eceli gelip çatınca, Allah onu asla geri bırakmaz; Allah, işlediklerinizden haberdardır."
        },
        "Urdu": {
            "verse 63:1": "(اے محمدﷺ) جب منافق لوگ تمہارے پاس آتے ہیں تو (از راہ نفاق) کہتے ہیں کہ ہم اقرار کرتے ہیں کہ آپ بےشک خدا کے پیغمبر ہیں اور خدا جانتا ہے کہ درحقیقت تم اس کے پیغمبر ہو لیکن خدا ظاہر کئے دیتا ہے کہ منافق (دل سے اعتقاد نہ رکھنے کے لحاظ سے) جھوٹے ہیں",
            "verse 63:2": "انہوں نے اپنی قسموں کو ڈھال بنا رکھا ہے اور ان کے ذریعے سے (لوگوں کو) راہ خدا سے روک رہے ہیں۔ کچھ شک نہیں کہ جو کام یہ کرتے ہیں برے ہیں",
            "verse 63:3": "یہ اس لئے کہ یہ (پہلے تو) ایمان لائے پھر کافر ہوگئے تو ان کے دلوں پر مہر لگادی گئی۔ سو اب یہ سمجھتے ہی نہیں",
            "verse 63:4": "اور جب تم ان (کے تناسب اعضا) کو دیکھتے ہو تو ان کے جسم تمہیں (کیا ہی) اچھے معلوم ہوتے ہیں۔ اور جب وہ گفتگو کرتے ہیں تو تم ان کی تقریر کو توجہ سے سنتے ہو (مگر فہم وادراک سے خالی) گویا لکڑیاں ہیں جو دیواروں سے لگائی گئی ہیں۔ (بزدل ایسے کہ) ہر زور کی آواز کو سمجھیں (کہ) ان پر بلا آئی۔ یہ (تمہارے) دشمن ہیں ان سے بےخوف نہ رہنا۔ خدا ان کو ہلاک کرے۔ یہ کہاں بہکے پھرتے ہیں",
            "verse 63:5": "اور جب ان سے کہا جائے کہ آؤ رسول خدا تمہارے لئے مغفرت مانگیں تو سر ہلا دیتے ہیں اور تم ان کو دیکھو کہ تکبر کرتے ہوئے منہ پھیر لیتے ہیں",
            "verse 63:6": "تم ان کے لئے مغفرت مانگو یا نہ مانگو ان کے حق میں برابر ہے۔ خدا ان کو ہرگز نہ بخشے گا۔ بےشک خدا نافرمانوں کو ہدایت نہیں دیا کرتا",
            "verse 63:7": "یہی ہیں جو کہتے ہیں کہ جو لوگ رسول خدا کے پاس (رہتے) ہیں ان پر (کچھ) خرچ نہ کرو۔ یہاں تک کہ یہ (خود بخود) بھاگ جائیں۔ حالانکہ آسمانوں اور زمین کے خزانے خدا ہی کہ ہیں لیکن منافق نہیں سمجھتے",
            "verse 63:8": "کہتے ہیں کہ اگر ہم لوٹ کر مدینے پہنچے تو عزت والے ذلیل لوگوں کو وہاں سے نکال باہر کریں گے۔ حالانکہ عزت خدا کی ہے اور اس کے رسول کی اور مومنوں کی لیکن منافق نہیں جانتے",
            "verse 63:9": "مومنو! تمہارا مال اور اولاد تم کو خدا کی یاد سے غافل نہ کردے۔ اور جو ایسا کرے گا تو وہ لوگ خسارہ اٹھانے والے ہیں",
            "verse 63:10": "اور جو (مال) ہم نے تم کو دیا ہے اس میں سے اس (وقت) سے پیشتر خرچ کرلو کہ تم میں سے کسی کی موت آجائے تو (اس وقت) کہنے لگے کہ اے میرے پروردگار تو نے مجھے تھوڑی سی اور مہلت کیوں نہ دی تاکہ میں خیرات کرلیتا اور نیک لوگوں میں داخل ہوجاتا",
            "verse 63:11": "اور جب کسی کی موت آجاتی ہے تو خدا اس کو ہرگز مہلت نہیں دیتا اور جو کچھ تم کرتے ہو خدا اس سے خبردار ہے"
        },
        "Uyghur": {
            "verse 63:1": "مۇناپىقلار سېنىڭ ئالدىڭغا كەلگەن چاغدا: «گۇۋاھلىق بېرىمىزكى سەن ھەقىقەتەن اﷲ نىڭ پەيغەمبىرىدۇرسەن» دەيدۇ، سېنىڭ ھەقىقەتەن اﷲ نىڭ پەيغەمبىرى ئىكەنلىكىڭنى اﷲ بىلىدۇ، اﷲ گۇۋاھلىق بېرىدۇكى، مۇناپىقلار چوقۇم يالغانچىلاردۇر",
            "verse 63:2": "ئۇلار ئۆزلىرىنىڭ يالغان قەسەملىرىنى قالقان قىلىۋالدى، (كىشىلەرنى) اﷲ نىڭ يولىدىن (يەنى اﷲ نىڭ دىنىدىن) توستى، ئۇلارنىڭ قىلمىشى نېمىدېگەن يامان!",
            "verse 63:3": "بۇ شۇنىڭ ئۈچۈندۇركى، ئۇلار (ئېغىزلىرىدا) ئىشىنىپ، ئاندىن (دىللىرىدا) ئىنكار قىلدى، ئۇلارنىڭ دىللىرى پېچەتلەندى (يەنى دىللىرىغا ھىدايەت يېتىپ بارالمايدۇ)، ئۇلار (ئىماننى) چۈشەنمەيدۇ",
            "verse 63:4": "ئۇلارغا قارايدىغان بولساڭ، بەدەن قۇرۇلۇشى (سالاپەتلىكى) سېنى ھەيران قالدۇرىدۇ، ئەگەر ئۇلار سۆزلىسە، (سۆزىنىڭ پاساھەتلىكىدىن) سۆزىگە قۇلاق سالىسەن، (ئىلىمسىز، ئەقىلسىز، پاراسەتسىزلىكتە) گويا ئۇلار تامغا يۆلەپ قويۇلغان (چىرىپ قالغان) ياغاچلاردۇر، ئۇلار (قورقۇنچتىن) ھەرقانداق ئاۋازنى ئۆزلىرىگە قارىتىلغان دەپ گۇمانلىنىدۇ، ئۇلار (ساڭا ۋە مۆمىنلەرگە) دۈشمەندۇر، ئۇلاردىن ھەزەر ئەيلىگىن، اﷲ ئۇلارنى ھالاك قىلسۇن! ئۇلار قانداقمۇ (ھىدايەتتىن گۇمراھلىققا) بۇرۇلۇپ كېتىدۇ!",
            "verse 63:5": "ئۇلارغا ئۆزرە ئېيتىپ: «كېلىڭلار، رەسۇلۇللاھ سىلەرگە مەغپىرەت تىلەيدۇ» دېيىلسە، (مەسخىرە قىلىش يۈزىسىدىن) باشلىرىنى سىلكىيدۇ، ئۇلارنىڭ تەكەببۇرلۇق قىلغان ھالدا (دەۋەت قىلىنغان نەرسىدىن) يۈز ئۆرۈگەنلىكىنى كۆرۈسەن",
            "verse 63:6": "ئۇلارغا (مەيلى) مەغپىرەت تەلەپ قىلغىن، (مەيلى) مەغپىرەت تەلەپ قىلمىغىن، بەرىبىر ئوخشاش، اﷲ ئۇلارغا ھەرگىز مەغپىرەت قىلمايدۇ، شۈبھىسىزكى پاسىق قەۋمنى اﷲ ھىدايەت قىلمايدۇ",
            "verse 63:7": "ئۇلار: «رەسۇلۇللاھ نىڭ يېنىدىكى كىشىلەرنى تەمىنلىمەڭلار، ئۇلار تاراپ كەتسۇن» دەيدۇ، ئاسمانلارنىڭ ۋە زېمىننىڭ خەزىنىلىرى اﷲ نىڭ ئىلكىدىدۇر. ۋە لېكىن مۇناپىقلار (اﷲ نىڭ ھېكمىتىنى) چۈشەنمەيدۇ",
            "verse 63:8": "ئۇلار (يەنى مۇناپىقلار): «مەدىنىگە قايتساق، ئەڭ ئەزىز ئادەم (يەنى ئابدۇللاھ ئىبن ئۇبەي ۋە مۇناپىقلارنىڭ ئۆزلىرىنى دېمەكچى) ئەڭ خار ئادەمنى (يەنى رەسۇلۇللاھنى، مۆمىنلەرنى دېمەكچى) مەدىنىدىن چىقىرىۋېتىدۇ» دېيىشىدۇ. غەلىبە اﷲ قا، اﷲ نىڭ پەيغەمبىرىگە ۋە مۆمىنلەرگە مەنسۇپ، لېكىن مۇناپىقلار (غەلىبىنىڭ اﷲ نىڭ دۈشمەنلىرىگە ئەمەس، دوستلىرىغا مەنسۇپ ئىكەنلىكىنى) بىلمەيدۇ",
            "verse 63:9": "ئى مۆمىنلەر! ماللىرىڭلار ۋە بالىلىرىڭلار سىلەرنى اﷲ نىڭ زىكرىدىن (يەنى اﷲ نىڭ تائەت - ئىبادىتىدىن) غەپلەتتە قالدۇرمىسۇن، كىملەركى شۇنداق قىلىدىكەن، ئۇلار زىيان تارتقۇچىلاردۇر",
            "verse 63:10": "بېرىڭلارغا ئۆلۈم كېلىپ: «پەرۋەردىگارىم! نېمىشقا مېنى (يەنى ئەجىلىمنى) بىر ئاز كېچىكتۈرمىدىڭ، سەدىقە قىلىپ ياخشىلاردىن بولار ئىدىم» دېيىشتىن بۇرۇن، ئۆزۈڭلارغا رىزىق قىلىپ بېرىلگەن نەرسىلەرنى سەدىقە قىلىڭلار",
            "verse 63:11": "اﷲ ھېچ ئادەمنى ئەجىلى كەلگەندە ھەرگىز كېچىكتۈرمەيدۇ، اﷲ قىلىۋاتقان ئىشىڭلاردىن تولۇق خەۋەرداردۇر"
        },
        "Uzbek": {
            "verse 63:1": "Мунофиқлар ҳузурингга келганларида, гувоҳлик берамизки, сен, албатта, Аллоҳнинг Расулисан, дерлар. Ҳолбуки, Аллоҳ албатта сен Унинг Расули эканингни биладир. Ва Аллоҳ гувоҳли берурки, албатта, мунофиқлар ёлғончидирлар.",
            "verse 63:2": "Улар қасамларини қалқон қилиб олдилар ва (одамларни) Аллоҳнинг йўлидан бурдилар. Бас, албатта, уларнинг қилган ишлари ёмон бўлди!",
            "verse 63:3": "Бунга сабаб шуки, улар иймон келтирдилар, сўнг кофир бўлдилар, бас, қалбларига муҳр босилди. Энди улар фаҳмламаслар.",
            "verse 63:4": "Ва агар уларни кўрсанг, жисмлари сени ажаблантирур ва агар гапирсалар, гапларига қулоқ осурсан. Улар худди суяб қуйилган ходага ўхшарлар. Ҳар қичқириқни зиддиларига ҳисоблайдилар. Улар душмандирлар. Улардан ҳазир бўл. Аллоҳ уларга уруш очсин, ҳақдан қандоқ ўгирилурлар.",
            "verse 63:5": "Ва агар уларга: «Келинглар, Аллоҳнинг Расули сизларга истиғфор айтадир», дейилса, улар бошларини чайқарлар. Ва уларни мутакаббирлик ҳолида юз ўгираётганларини кўрарсан.",
            "verse 63:6": "Уларга истиғфор айтасанми ёки айтмайсанми-улар учун бари бир. Аллоҳ уларни ҳеч мағфират қилмас. Зеро, Аллоҳ фосиқ қавмларни ҳидоятга бошламас.",
            "verse 63:7": "Улар, Расулуллоҳнинг ҳузуридагиларга нафақа берманглар, токи тарқаб кетсинлар, дерлар. Ҳолбуки, осмонлару ернинг хазиналари Аллоҳникидир. Ва лекин мунофиқлар тушунмаслар.",
            "verse 63:8": "Улар, агар Мадинага қайтиб борсак, албатта азиз хорни ундан чиқарур, дерлар. Ҳолбуки, азизлик Аллоҳга, Унинг Расулига ва мўминларига хосдир. Лекин мунофиқлар билмаслар.",
            "verse 63:9": "Эй иймон келтирганлар. Молларингиз ва болаларингиз сизни Аллоҳнинг зикридан чалғитмасин. Ким шундай қилса, бас, ана ўшалар ютқазувчилардир.",
            "verse 63:10": "Ва бирингизга ўлим келиб: «Эй Роббим, агар менинг ўлимимни яқин муддатга орқага сурсанг, бас, садақа қилиб солиҳлардан бўлсам», демасдан аввал Биз сизларга ризқ қилиб берган нарсалардан нафақа қилинг.",
            "verse 63:11": "Аллоҳ ажали келган жонни ҳеч-ҳеч орқага сурмас. Зеро, Аллоҳ нима қилаётганингиздан хабардордир."
        },
        "Vietnamese": {
            "verse 63:1": "Khi những kẻ giả tạo đức tin đến gặp Ngươi (Thiên Sứ Muhammad), chúng nói: “Chúng tôi xác nhận Người đích thực là Sứ Giả của Allah.” Allah biết rõ Ngươi đích thực là Sứ Giả của Ngài (chứ không cần sự xác nhận của chúng), và Allah xác nhận những kẻ giả tạo đức tin chính là những tên nói dối.",
            "verse 63:2": "Chúng đã lấy lời thề của mình làm vỏ bọc để chúng (dễ dàng) ngăn cản (mọi người) khỏi con đường của Allah. Thật vậy, những điều chúng làm quả là xấu xa và tội lỗi.",
            "verse 63:3": "Đó là bởi vì chúng đã có đức tin, sau đó chúng lại vô đức tin. Vì vậy, trái tim của chúng bị bịt kín nên chúng không hiểu gì cả.",
            "verse 63:4": "Khi ngươi (hỡi người nhìn) thấy chúng, hình thức và vẻ bề ngoài của chúng làm ngươi hài lòng, và khi chúng nói chuyện thu hút ngươi lắng nghe. Chúng như thể là những miếng gỗ dùng để chống đỡ. Chúng nghĩ rằng mọi tiếng la hét đều chống lại chúng. Chúng là kẻ thù (thực sự của Ngươi – Thiên Sứ Muhammad), vì vậy Ngươi hãy cảnh giác chúng. Allah sẽ tiêu diệt chúng. Sao chúng lại như thế?",
            "verse 63:5": "Khi chúng được bảo “Hãy đến đây, Sứ Giả của Allah sẽ cầu xin Ngài tha thứ tội lỗi cho các ngươi” thì chúng quay đầu sang một bên. Ngươi (Thiên Sứ Muhammad) sẽ thấy chúng bỏ đi một cách kiêu ngạo.",
            "verse 63:6": "Tất cả đều giống nhau đối với chúng cho dù Ngươi cầu xin Allah tha thứ cho chúng hay không cầu xin tha thứ cho chúng; Allah sẽ không bao giờ tha thứ cho chúng. Thật vậy, Allah không hướng dẫn đám người dấy loạn, bất tuân.",
            "verse 63:7": "Chúng là những kẻ nói “Chớ chi tiêu cho những người theo Sứ Giả của Allah cho đến khi họ giải tán”. Tuy nhiên, những kẻ giả tạo đức tin không hiểu rằng các kho chứa (bổng lộc) trong các tầng trời và trái đất đều là của Allah.",
            "verse 63:8": "Chúng nói: “Nếu chúng tôi quay trở về Madinah, người quyền thế nhất (ám chỉ ‘Abdullah bin Ubai) sẽ đuổi kẻ hèn nhất (ám chỉ Thiên Sứ Muhammad) ra khỏi đó”. Nhưng những kẻ giả tạo đức tin không biết rằng danh dự và quyền thế đều thuộc về Allah và Sứ Giả của Ngài cũng như những người có đức tin.",
            "verse 63:9": "Hỡi những người có đức tin! Các ngươi chớ để cho tài sản và con cái của các ngươi làm cho các ngươi xao lãng việc tưởng nhớ Allah. Những ai làm thế thì đó là những kẻ thua thiệt.",
            "verse 63:10": "Các ngươi hãy chi tiêu (vào con đường chính nghĩa của TA - Allah) từ tài sản mà TA ban cấp cho các ngươi trước khi cái chết đến với mỗi người các ngươi. Bằng không mỗi người các ngươi sẽ nói (trong nuối tiếc muộn màng): “Lạy Thượng Đế của bề tôi! Nếu Ngài trì hoãn cho bề tôi sống thêm một thời gian ngắn nữa thì bề tôi sẽ làm từ thiện và sẽ là một người ngoan đạo.”",
            "verse 63:11": "Nhưng Allah sẽ không bao giờ trì hoãn cho một linh hồn nào một khi thời gian của nó đã hết. Và Allah là Đấng Thông Toàn về những gì các ngươi làm."
        },
        "Yoruba": {
            "verse 63:1": "Nigba ti awon sobe-selu musulumi ba wa si odo re, won a wi pe: “A n jerii pe dajudaju iwo, Ojise Allahu ni o.” Allahu si mo pe dajudaju iwo, Ojise Re ni o. Allahu si n jerii pe dajudaju awon sobe-selu musulumi, opuro ni won",
            "verse 63:2": "Won fi awon ibura won se aabo (fun emi ara won), won si seri awon eniyan kuro loju ona (esin) Allahu; dajudaju ohun ti won n se nise buru",
            "verse 63:3": "(Won se) iyen nitori pe won gbagbo, leyin naa won sai gbagbo. Nitori naa, A ti fi edidi di okan won; won ko si nii gbo agboye",
            "verse 63:4": "Nigba ti o ba ri won, irisi won yoo jo o loju. Ti won ba n soro, iwo yoo teti gbo oro won. Won si da bi igi ti won gbe ti ogiri. Won si n lero pe gbogbo igbe (ibosi) n be lori won (nipa isobe-selu won). Ota ni won. Nitori naa, sora fun won. Allahu ti sebi le won. Bawo ni won se n seri won kuro nibi ododo",
            "verse 63:5": "Ati pe nigba ti won ba so fun won pe: “E wa ki Ojise ba yin toro aforijin.” Won a gbunri. O si maa ri won ti won yoo maa gbunri lo, ti won yoo maa segberaga",
            "verse 63:6": "Bakan naa ni fun won; yala o ba won toro aforijin tabi o o ba won toro aforijin. Allahu ko nii forijin won. Dajudaju Allahu ko nii fi ona mo ijo obileje",
            "verse 63:7": "Awon ni awon t’o n wi pe: “Eyin ko gbodo na owo fun awon t’o wa lodo Ojise Allahu titi won yoo fi fonka. Ti Allahu si ni awon apoti-oro sanmo ati ile, sugbon awon sobe-selu musulumi ko nii gbo agboye",
            "verse 63:8": "Won n wi pe: “Dajudaju ti a ba pada de sinu ilu Modinah, nse ni awon alagbara (ilu) yoo yo awon eni yepere jade kuro ninu ilu.\" Agbara si n je ti Allahu, ati ti Ojise Re ati awon onigbagbo ododo, sugbon awon sobe-selu musulumi ko mo",
            "verse 63:9": "Eyin ti e gbagbo ni ododo, e ma se je ki awon dukia yin ati awon omo yin ko airoju ba yin nibi iranti Allahu. Enikeni ti o ba ko sinu (airoju) yen, awon wonyen, awon ni eni ofo",
            "verse 63:10": "E na ninu ohun ti A pese fun yin siwaju ki iku to de ba eni kan yin, ki o wa wi pe: \"Oluwa mi, ki o si je pe O lo mi lara si i titi di igba kan to sunmo, emi iba si le maa tore, emi iba si wa lara awon eni rere",
            "verse 63:11": "Allahu ko si nii lo emi kan lara nigba ti ojo iku re ba de. Allahu si ni Alamotan nipa ohun ti e n se nise"
        }
    }
}