{
    "id": 64,
    "name_simple": "At-Taghabun",
    "revelation_place": "madinah",
    "revelation_order": 108,
    "bismillah_pre": true,
    "verses_count": 18,
    "short_text": "The Surah takes its name from the sentence Dhalika yaum-ut taghabun of verse 9, thereby implying that it is the Surah in which the word at taghabun has occurred.",
    "text": [
        "\n",
        "The Surah takes its name from the sentence Dhalika yaum-ut taghabun of verse 9, thereby implying that it is the Surah in which the word at taghabun has occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "Muqatil and Kalbi say that it was partly revealed at Makkah and partly at Madinah. Hadrat Abdullah bin Abbas and Ata bin Yasar say that vv. 1-13 were revealed at Makkah and vv. 14-18 at Madinah. But the majority of commentators regard the whole of the surah as a Madinan Revelation. Although there is no internal evidence to help determine its exact period of revelation, yet a study of its subject matter shows that it might probably have been sent down at an early stage at Madinah. That is why it partly resembles the Makkah surahs and partly the Madinan Surahs.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of this surah is invitation to the Faith and obedience (to Allah) and the teaching of good morals. The sequence followed is that the first four verses are addressed to all men; verses 5-10 to those men, who do not believe in the invitation of the Qur'an; and verses 11-18 to those who accept and believe in this invitation.",
        "\n",
        "In the verses addressed to all men, they have been made aware in a few brief sentences of the four fundamental truths:",
        "\n",
        "First, that the universe in which they live is not Godless, but its Creator, Master and Ruler is an All Powerful God, and everything in it testifies to His being most Perfect and absolutely faultless.",
        "\n",
        "Second, that the universe is not without purpose and wisdom, but its Creator has created it with truth no one should be under the delusion that it is a mock show, which began without a purpose and will come to an end without a purpose.",
        "\n",
        "Third, that the excellent form that God has created you with and the choice that He has given you to choose between belief and unbelief is not a useless and meaningless activity so that it may be of no consequence whether you choose belief or unbelief. In fact, God is watching as to how you exercise your choice.",
        "\n",
        "Fourth, that you have not been created irresponsible and un-answerable. You have to return ultimately to your Creator, and have to meet the Being who is aware of everything in the universe, from Whom nothing is hidden, to Whom even the innermost thoughts of the minds are known.",
        "\n",
        "After stating these four fundamental truths about the Universe and Man, the address turns to the people who adopted the way of unbelief, and their attention is drawn to a phenomenon which has persisted throughout human history, namely that nation after nation has arisen and ultimately gone to its doom. Man by his intellect and reason has been explaining this phenomenon in a thousand ways, but Allah tells the real truth and declares that the fundamental causes of the destruction of the nations were only two:",
        "\n",
        "First, that they refused to believe in the Messengers whom He sent for their guidance, with the result that Allah too left them to themselves, and they invented their own philosophies of life and went on groping their way from one error to another.",
        "\n",
        "Second, that they also, rejected the doctrine of Hereafter, and thought this worldly life to be an end in itself, and that there was no life hereafter when they would have to render an account of their deeds before God. This corrupted their whole attitude towards life, and their impure morals and character so polluted the world that eventually the scourge of God itself had to descend and eliminate them from the scene.",
        "\n",
        "After stating these two instructive truths of human history, the deniers of the message of Truth have been admonished to wake up and believe in Allah, His Messenger and the Light of Guidance that Allah has sent in the form of the Qur'an if they want to avoid the fate met by the former peoples. Besides, they have been warned that the Day shall eventually come when all the former and the latter generations will be collected at one place and the fraud and embezzlement committed by each will be exposed before all mankind. Then the fate of each man will be decided finally on the basis as to who had adopted the path of the Faith and righteousness and who had followed the way of disbelief and denial of the Truth. The first group shalt deserve eternal Paradise and the second shall be doomed to everlasting Hell.",
        "\n",
        "Then, addressing those who adopt the way of the Faith, a few important instructions have been given:",
        "\n",
        "First, that whatever affliction befalls a person in the world, it befalls him by Allah's leave. Whoever in this state of affliction remains steadfast to the Faith, Allah blesses his heart with guidance; otherwise although the affliction of the one who in confusion or bewilderment turns away from the path of the Faith, cannot be averted except by Allah's leave, yet he becomes involved in another, the greatest affliction of all, namely that his heart is deprived of the guidance of Allah.",
        "\n",
        "Secondly, that the believer is not required to affirm the faith with the tongue only, but after the affirmation of the Faith he should practically obey Allah and His Messenger. If he turns away from obedience he would himself be responsible for his loss, for the Holy Messenger of Allah (upon whom be His peace) has become absolved from the responsibility after having delivered the message of Truth.",
        "\n",
        "Thirdly, that the believer should place his trust in Allah alone and not in his own power or some other power of the world.",
        "\n",
        "Fourthly, that the worldly goods and children are a great trial and temptation for the believer, for it is their love which generally distracts man from the path of faith and obedience. Therefore, the believers have to beware some of their children, and wives lest they become robbers for them on the Way of God directly or indirectly; and they should spend their wealth for the sake of God so that their self remains safe against the temptations of Satan.",
        "\n",
        "Fifthly, that every man is responsible only to the extent of his power and ability. Allah does not demand that man should exert himself beyond his power and ability. However, the believer should try his best to live in fear of God as far as possible, and should see that he does not transgress the bounds set by Allah in his speech, conduct and dealings through his own negligence.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that calls the Day of Judgement the day of Dispossession. For those who abandon faith and choose to disbelieve shall lose Paradise and be thrown into Hellfire, cheated forever from felicity by their own souls and their leaders. Those who believe, however, shall gain Paradise against all the attempts of the unbelievers to distract them in the world from faith and goodness, guided away from Hellfire by God and His messengers. It takes its name from “they day of dispossession” (yawm al-taghābun) mentioned in verse 9. The surah opens with a description of God’s power, wisdom, and knowledge (verse 1 .). The disbelievers are reminded of the end of those who disbelieved before them (verse 5 .), and their denial of the Resurrection is strongly refuted (verse 7). The believers are urged to be wary but forgiving of the enemies they may have within their own families (verse 14 .) and warned to remain steadfast and to spend in God’s cause (verse 8 . and verse 16 .).The surah is also known as: Cheating, Common Loss and Gain, Exposition, Haggling, Mutual Fraud, Mutual Neglect, Profit and Loss, The Day of Mutual Loss and Gain, The Mutual Loss and Gain.",
    "name_translation": "Dispossession",
    "name_complex": "At-Taghâbun",
    "surah_name_ar": "التغابن",
    "verses": {
        "Albanian": {
            "verse 64:1": "Perëndinë e falenderon çka gjendet në qiej dhe çka gjendet në Tokë. Atij i takon pushteti i vërtetë, dhe Atij i takon falenderimi. Ai është i pushtetshëm për çdo gjë!",
            "verse 64:2": "Ai ju ka krijuar juve, e (ndonjëri) prej jush është mohues, e (disa) prej jush janë besimtarë: Çdo gjë që punoni ju, Perëndia e sheh mirë.",
            "verse 64:3": "Ai ka krijuar qiejt dhe Tokën në mënyrë të mrekullueshme, dhe Ai ju ka dhënë juve formën, dhe figurat tuaja i bënë të bukura dhe të gjithë do të ktheheni te Ai.",
            "verse 64:4": "Ai i di të gjitha gjërat që gjenden në qiej dhe në Tokë. Ai di fshehtësitë tuaja dhe ato që i bëni haptazi; Perëndia i di të gjitha ç’keni në zemrat tuaja.",
            "verse 64:5": "A nuk ju kanë arritur lajmet e atyre që më parë nuk kanë besuar, dhe e kanë shijuar dënimin e veprimeve të tyre. Për ta ka dënim të dhembshëm –",
            "verse 64:6": "ngase kur profetët e tyre vinin me dokumente të qarta, ata thoshin: “A njeriu (si ne) do të na tregojë rrugën?” Dhe nuk besuan, e u kthyen (prej këshillave); e Perëndisë nuk i nevojitet asgjë, Ai është i pavarur dhe i lavdishëm!",
            "verse 64:7": "Mohuesit kujtojnë se kurrsesi nuk do të ngjallen; thuaju atyre: “Po, për Zotin tim, me siguri do të ngjalleni dhe pastaj do të informoheni se ç’keni punuar!” – E, kjo për Perëndinë, është lehtë.",
            "verse 64:8": "Besoni në Perëndinë dhe në të Dërguarin e Tij dhe në dritën (Kur’anin) që ju kemi sjellë. Perëndia, di mirë çdo gjë që punoni ju.",
            "verse 64:9": "Atë Ditë, kur Ai (Perëndia) do t’ju tubojë juve në Ditën e Kijametit, ajo është Dita e mashtrimit (ku shihen veprat e gabuara). Ai që beson në Zotin dhe punon vepra të ira, Perëndia ia falë mëkatet atij dhe do ta shpie në kopshtije, nëpër të cilët rrjedhin lumenjt, e ku do të qëndrojnë përherë, gjithmonë. Ai do të jetë sukses i madh!",
            "verse 64:10": "E ata që nuk kanë besuar dhe i kanë mohuar dokumentet Tona – do të jenë banorë të zjarrit, në të do të qëndrojnë përherë. E sa mbarim i tmerrshëm ësthë ai!",
            "verse 64:11": "Nuk ngjan kurrfarë fatkeqësie pa lejen e Perëndisë, e ai që i beson Perëndisë, ia udhëzon (në rrugë të drejtë) zemrën e tij. Perëndia di mirë çdo gjë.",
            "verse 64:12": "Përuluni Perëndisë dhe Profetit të Tij; e nëse shmangeni ju, Profeti Ynë ka të vetmen detyrë që t’ju shpjegojë qartë.",
            "verse 64:13": "Perëndia është i vetmi Zot dhe vetëm te Perëndia le të mbështeten besimtarët.",
            "verse 64:14": "O besimtarë, me të vërtetë, edhe prej grave tuaja edhe prej fëmijëv tuaj keni armiqë, andaj ruajuni prej tyre! E nëse ju nuk ua shihin për të madhe (gabimet) dhe i harmonizoni marrëdhëniet dhe ua falni, (është mirësi), - e Perëndia, me të vërtetë, është falës dhe mëshirues.",
            "verse 64:15": "Pasuria juaj dhe fëmijët tuaj janë vetëm provë për ju, e te Perëndia shpërblimi është i madh;",
            "verse 64:16": "andaj druajuni Perëndisë sa të mundeni, dhe dëgjoni, dhe përuluni dhe shpenzoni (prej pasurisë suaj) për të mirën tuaj. E ata që ruhen nga lakmia e madhe, janë fitues.",
            "verse 64:17": "Nëse i jepni hua të bukur Perëndisë, Ai ua kthen shumëfish atë dhe ua falë (gabimet). – Perëndia është falënderues dhe nuk nxiton në dënime.",
            "verse 64:18": "Ai është njohës i gjërave të dukshme dhe të padukshme, (Ai është) i Plotëfuqishëm dhe i Gjithëdijshëm."
        },
        "Amharic": {
            "verse 64:1": "በሰማያት ውስጥ ያለው በምድርም ውስጥ ያለው ሁሉ ለአላህ ያሞግሳል፡፡ ንግሥናው የእርሱ ብቻ ነው፡፡ ምስጋናም ለእርሱ ነው፡፡ እርሱም በነገሩ ሁሉ ላይ ቻይ ነው፡፡",
            "verse 64:2": "እርሱ ያ የፈጠራችሁ ነው፡፡ ከእናንተም ከሓዲ አልለ፡፡ ከእናንተም አማኝ አልለ፡፡ አላህም በምትሠሩት ሁሉ ተመልካች ነው፡፡",
            "verse 64:3": "ሰማያትንና ምድርን በእውነት ፈጠረ፡፡ ቀረጻችሁም ቅርጻችሁንም አሳመረ፡፡ መመለሻችሁም ወደእርሱ ነው፡፡",
            "verse 64:4": "በሰማያትና በምድር ውስጥ ያለውን ሁሉ ያውቃል፡፡ የምትደብቁትንም የምትገልጡትንም ያውቃል፡፡ አላህም በልቦች ውስጥ ያለውን ሁሉ ዐዋቂ ነው፡፡",
            "verse 64:5": "የእነዚያ ከአሁን በፊት የካዱትና የክሕደታቸውን ቅጣት ቅመሱ የተባሉት ሕዝቦች ወሬ አልመጣላችሁምን? ለእነሱም አሳማሚ ቅጣት አልላቸው፡፡",
            "verse 64:6": "ይህ (ቅጣት) እርሱ መልክተኞቻቸው በአስረጂዎች ይመጡባቸው ስለ ነበሩ «ሰዎችም ይመሩናልን?» ስላሉና ስለካዱ (ከእምነት) ስለ ዞሩም ነው፡፡ አላህም (ከእነሱ እምነት) ተብቃቃ፡፡ አላህም ተብቃቂ ምስጉን ነው፡፡",
            "verse 64:7": "እነዚያ የካዱትን በፍጹም የማይቀሰሱ መኾናቸውን አሰቡ፡፡ «አይደለም በጌታዬ እምላለሁ፡፡ በእርግጥ ትቀሰቀሳላችሁ፡፡ ከዚያም በሠራችሁት ሁሉ ትነገራላችሁ፡፡ ይህም በአላህ ላይ ቀላል ነው፡፡» በላቸው፡፡",
            "verse 64:8": "በአላህና በመልክተኛውም፡፡ በዚያም ባወረድነው ብርሃን እመኑ፡፡ «አላህም በምትሠሩት ሁሉ ውስጠ ዐዋቂ ነው» (በላቸው)፡፡",
            "verse 64:9": "ለመሰብሰቢያ ቀን የሚሰበስብባችሁን ቀን (አስታውሱ)፤ ይህ የመጎዳዳት (መግለጫ) ቀን ነው፡፡ በአላህም የሚያምን ሰው መልካምንም የሚሠራ ከርሱ ኃጢአቶቹን ይሰርይለታል፤ (ይፍቅለታል)፤ ከሥሮቻቸውም ወንዞች የሚፈሱባቸውን ገነቶች በውስጣቸው ዘለዓለም ዘውታሪዎች ሲኾኑ ያገባዋል፤ ይህ ታላቅ ማግኘት ነው፡፡",
            "verse 64:10": "እነዚያም የካዱና በአንቀጾቻችን ያስተባበሉ እነዚያ በውስጡ ዘውታሪዎች ሲኾኑ የእሳት ጓዶች ናቸው፤ መመለሻቸውም ከፋ!",
            "verse 64:11": "ከመከራም (ማንንም) አይነካም በአላህ ፈቃድ ቢኾን እንጅ፤ በአላህም የሚያምን ሰው ልቡን (ለትዕግስት) ይመራዋል፤ አላህም ነገሩን ሁሉ ዐዋቂ ነው፡፡",
            "verse 64:12": "አላህንም ተገዙ፤ መልክተኛውንም ታዘዙ፤ ብትዞሩም (መልክተኛውን አትጎዱም)፤ በመልክተኛውም ላይ ያለበት ግልጽ ማድረስ ብቻ ነው፡፡",
            "verse 64:13": "አላህ ከርሱ በቀር አምላክ የለም፤ በአላህም ላይ አማኞቹ ይመኩ፡፡",
            "verse 64:14": "እላንተ ያመናችሁ ሆይ! ከሚስቶቻችሁና ከልጆቻችሁ (ከአላህ መንገድ በማስተጓጎል) ለናንተ ጠላቶች የኾኑ አልሉ፤ ስለዚህ ተጠንቀቋቸው፤ ይቅርታ ብታደርጉ ብታልፏቸውም ብተምሩዋቸውም አላህ በጣም መሓሪ አዛኝ ነው፡፡",
            "verse 64:15": "ገንዘቦቻችሁና ልጆቻችሁ ለናንተ መፈተኛ ብቻ ናቸው፤ አላህም እርሱ ዘንድ ታላቅ ምንዳ አልለ፡፡",
            "verse 64:16": "አላህንም የቻላችሁትን የክል ፍሩት፤ ትዕዛዙን ስሙም፤ ታዘዙም፤ ለግሱም፤ ለነፍሶቻችሁ መልካምን (ይሰጣችኋልና)፤ የነፍሱንም ንፍገት የሚጠበቅ ሰው እነዚያ እነሱ ፍላጎታቸውን የሚያገኙ ናቸው፡፡",
            "verse 64:17": "ለአላህ መልካም ብድርን ብታበድሩ (ምንዳውን) ለናንተ ይደራርበዋል፤ ለናንተም ይምራል፤ አላህም አመስጋኝ ታጋሽ ነው፡፡",
            "verse 64:18": "ሩቁን ምስጢር ግልጹንም ሁሉ ዐዋቂው አሸናፊው ጥበበኛው ነው፡፡"
        },
        "Arabic": {
            "verse 64:1": "ٌريِدَق ٍءْيَش ِّلُك ٰىَلَع َوُهَو ۖ ُدْمَحْلا ُهَلَو ُكْلُمْلا ُهَل ۖ ِضْرَأْلا يِف اَمَو ِتاَواَمَّسلا يِف اَم ِهَّلِل ُحِّبَسُي",
            "verse 64:2": "ٌريِصَب َنوُلَمْعَت اَمِب ُهَّللاَو ۚ ٌنِمْؤُّم مُكنِمَو ٌرِفاَك ْمُكنِمَف ْمُكَقَلَخ يِذَّلا َوُه",
            "verse 64:3": "ُريِصَمْلا ِهْيَلِإَو ۖ ْمُكَرَوُص َنَسْحَأَف ْمُكَرَّوَصَو ِّقَحْلاِب َضْرَأْلاَو ِتاَواَمَّسلا َقَلَخ",
            "verse 64:4": "ِروُدُّصلا ِتاَذِب ٌميِلَع ُهَّللاَو ۚ َنوُنِلْعُت اَمَو َنوُّرِسُت اَم ُمَلْعَيَو ِضْرَأْلاَو ِتاَواَمَّسلا يِف اَم ُمَلْعَي",
            "verse 64:5": "ٌميِلَأ ٌباَذَع ْمُهَلَو ْمِهِرْمَأ َلاَبَو اوُقاَذَف ُلْبَق نِم اوُرَفَك َنيِذَّلا ُأَبَن ْمُكِتْأَي ْمَلَأ",
            "verse 64:6": "ٌديِمَح ٌّيِنَغ ُهَّللاَو ۚ ُهَّللا ىَنْغَتْساَّو ۚ اوَّلَوَتَو اوُرَفَكَف اَنَنوُدْهَي ٌرَشَبَأ اوُلاَقَف ِتاَنِّيَبْلاِب مُهُلُسُر ْمِهيِتْأَّت تَناَك ُهَّنَأِب َكِلَٰذ",
            "verse 64:7": "ٌريِسَي ِهَّللا ىَلَع َكِلَٰذَو ۚ ْمُتْلِمَع اَمِب َّنُؤَّبَنُتَل َّمُث َّنُثَعْبُتَل يِّبَرَو ٰىَلَب ْلُق ۚ اوُثَعْبُي نَّل نَأ اوُرَفَك َنيِذَّلا َمَعَز",
            "verse 64:8": "ٌريِبَخ َنوُلَمْعَت اَمِب ُهَّللاَو ۚ اَنْلَزنَأ يِذَّلا ِروُّنلاَو ِهِلوُسَرَو ِهَّللاِب اوُنِمآَف",
            "verse 64:9": "ُميِظَعْلا ُزْوَفْلا َكِلَٰذ ۚ اًدَبَأ اَهيِف َنيِدِلاَخ ُراَهْنَأْلا اَهِتْحَت نِم يِرْجَت ٍتاَّنَج ُهْلِخْدُيَو ِهِتاَئِّيَس ُهْنَع ْرِّفَكُي اًحِلاَص ْلَمْعَيَو ِهَّللاِب نِمْؤُي نَمَو ۗ ِنُباَغَّتلا ُمْوَي َكِلَٰذ ۖ ِعْمَجْلا ِمْوَيِل ْمُكُعَمْجَي َمْوَي",
            "verse 64:10": "(ُريِصَمْلا َسْئِبَو ۖ اَهيِف َنيِدِلاَخ ِراَّنلا ُباَحْصَأ َكِئَٰلوُأ اَنِتاَيآِب اوُبَّذَكَو اوُرَفَك َنيِذَّلاَو",
            "verse 64:11": "(ٌميِلَع ٍءْيَش ِّلُكِب ُهَّللاَو ۚ ُهَبْلَق ِدْهَي ِهَّللاِب نِمْؤُي نَمَو ۗ ِهَّللا ِنْذِإِب اَّلِإ ٍةَبيِصُّم نِم َباَصَأ اَم",
            "verse 64:12": "(ُنيِبُمْلا ُغاَلَبْلا اَنِلوُسَر ٰىَلَع اَمَّنِإَف ْمُتْيَّلَوَت نِإَف ۚ َلوُسَّرلا اوُعيِطَأَو َهَّللا اوُعيِطَأَو",
            "verse 64:13": "(َنوُنِمْؤُمْلا ِلَّكَوَتَيْلَف ِهَّللا ىَلَعَو ۚ َوُه اَّلِإ َهَٰلِإ اَل ُهَّللا",
            "verse 64:14": "(ٌميِحَّر ٌروُفَغ َهَّللا َّنِإَف اوُرِفْغَتَو اوُحَفْصَتَو اوُفْعَت نِإَو ۚ ْمُهوُرَذْحاَف ْمُكَّل اًّوُدَع ْمُكِداَلْوَأَو ْمُكِجاَوْزَأ ْنِم َّنِإ اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 64:15": "(ٌميِظَع ٌرْجَأ ُهَدنِع ُهَّللاَو ۚ ٌةَنْتِف ْمُكُداَلْوَأَو ْمُكُلاَوْمَأ اَمَّنِإ",
            "verse 64:16": "(َنوُحِلْفُمْلا ُمُه َكِئَٰلوُأَف ِهِسْفَن َّحُش َقوُي نَمَو ۗ ْمُكِسُفنَأِّل اًرْيَخ اوُقِفنَأَو اوُعيِطَأَو اوُعَمْساَو ْمُتْعَطَتْسا اَم َهَّللا اوُقَّتاَف",
            "verse 64:17": "(ٌميِلَح ٌروُكَش ُهَّللاَو ۚ ْمُكَل ْرِفْغَيَو ْمُكَل ُهْفِعاَضُي اًنَسَح اًضْرَق َهَّللا اوُضِرْقُت نِإ",
            "verse 64:18": "(ُميِكَحْلا ُزيِزَعْلا ِةَداَهَّشلاَو ِبْيَغْلا ُمِلاَع"
        },
        "Azerbaijani": {
            "verse 64:1": "Göylərdə və yerdə olanların hamısı Allahın şəninə təriflər deyir. Hökm Onundur, həmd Ona məxsusdur. O, hər şeyə qadirdir.",
            "verse 64:2": "Sizi yaradan Odur. Kiminiz kafir, kiminiz də mömindir. Allah nə etdiklərinizi görür.",
            "verse 64:3": "O, göyləri və yeri ədalətlə yaratdı, sizə surət verib onları gözəl şəklə saldı. Dönüş də Onadır.",
            "verse 64:4": "O, göylərdə və yerdə olanları bilir. Sizin gizlində və aşkarda nə etdiyinizi də bilir. Allah kökslərdə olanlardan agahdır.",
            "verse 64:5": "Daha öncə kafir olmuş və öz əməllərinin cəzasını dadmış kimsələrin xəbəri sizə gəlib çatmadımı? Onlar üçün acılı-ağrılı bir əzab hazırlanmışdır.",
            "verse 64:6": "Bu ona görədir ki, elçiləri onlara aydın dəlillər gətirirdi, onlar isə: “Məgər bizə bir insanmı doğru yol göstərəcək?”– deyirdilər. Onlar küfr edir və üz döndərirdilər. Allahın onlara ehtiyacı yoxdur. Allah Zəngindir, Tərifəlayiqdir.",
            "verse 64:7": "Kafir olanlar heç vaxt dirildilməyəcəklərini iddia edirlər. De: “Xeyr, Rəbbimə and olsun ki, siz mütləq dirildiləcəksiniz. Sonra isə etdiyiniz əməllər sizə xəbər veriləcəkdir. Bu, Allah üçün çox asandır!”",
            "verse 64:8": "Elə isə Allaha, Onun Elçisinə və nazil etdiyimiz Nura (Qurana) iman gətirin! Allah nə etdiklərinizdən xəbərdardır.",
            "verse 64:9": "O gün Allah sizi Toplanma gününə cəm edəcək. Həmin gün qarşılıqlı aldanma günüdür. Hər kəs Allaha iman gətirib yaxşı işlər görsə, Allah onun günahlarını bağışlayar və onu ağacları altından çaylar axan Cənnət bağlarına daxil edər. Onlar orada əbədi qalacaqlar. Bu, böyük müvəffəqiyyətdir.",
            "verse 64:10": "Kafir olub ayələrimizi yalan sayanlara gəldikdə isə, onlar Cəhənnəm sakinləridir. Onlar orada əbədi qalacaqlar. Ora necə də pis dönüş yeridir!",
            "verse 64:11": "Allahın izni olmadan heç kəsə bir müsibət üz verməz. Hər kəs Allaha iman gətirsə, Allah onun qəlbini haqqa yönəldər. Allah hər şeyi bilir.",
            "verse 64:12": "Allaha və Onun Elçisinə itaət edin! Əgər üz çevirsəniz, bilin ki, Elçimizin öhdəsinə düşən yalnız açıq bir təbliğdir.",
            "verse 64:13": "Allah! Ondan başqa heç bir məbud yoxdur. Qoy möminlər yalnız Allaha təvəkkül etsinlər.",
            "verse 64:14": "Ey iman gətirənlər! Şübhəsiz ki, zövcələrinizdən və övladınızdan sizə düşmən olanlar da vardır. Onlardan özünüzü qoruyun! Lakin onları əfv etsəniz, günahlarından keçsəniz və bağışlasanız, bilin ki, Allah Bağışlayandır, Rəhmlidir.",
            "verse 64:15": "Həqiqətən, var-dövlətiniz və övladlarınız ancaq bir sınaqdır. Böyük mükafat isə Allah yanındadır.",
            "verse 64:16": "Nə qədər bacarırsınızsa Allahdan qorxun. Peyğəmbərə qulaq asıb itaət edin və malınızdan öz xeyriniz üçün xərcləyin. Nəfsinin tamahından qorunanlar nicat tapanlardır.",
            "verse 64:17": "Əgər Allaha gözəl bir borc versəniz (malınızı Onun yolunda xərcləsəniz), O bunu sizin üçün qat-qat artırar və sizi bağışlayar. Allah şükürün əvəzini verəndir, Həlimdir.",
            "verse 64:18": "Allah qeybi də, aşkarı da Biləndir, Qüdrətlidir, Müdrikdir."
        },
        "Bengali": {
            "verse 64:1": "নভোমন্ডল ও ভূমন্ডলে যা কিছু আছে, সবই আল্লাহর পবিত্রতা ঘোষণা করে। রাজত্ব তাঁরই এবং প্রশংসা তাঁরই। তিনি সর্ববিষয়ে সর্বশক্তিমান।",
            "verse 64:2": "তিনিই তোমাদেরকে সৃষ্টি করেছেন, অতঃপর তোমাদের মধ্যে কেউ কাফের এবং কেউ মুমিন। তোমরা যা কর, আল্লাহ তা দেখেন।",
            "verse 64:3": "তিনি নভোমন্ডল ও ভূমন্ডলকে যথাযথভাবে সৃষ্টি করেছেন এবং তোমাদেরকে আকৃতি দান করেছেন, অতঃপর সুন্দর করেছেন তোমাদের আকৃতি। তাঁরই কাছে প্রত্যাবর্তন।",
            "verse 64:4": "নভোমন্ডল ও ভূমন্ডলে যা আছে, তিনি তা জানেন। তিনি আরও জানেন তোমরা যা গোপনে কর এবং যা প্রকাশ্যে কর। আল্লাহ অন্তরের বিষয়াদি সম্পর্কে সম্যক জ্ঞাত।",
            "verse 64:5": "তোমাদের পুর্বে যারা কাফের ছিল, তাদের বৃত্তান্ত কি তোমাদের কাছে পৌছেনি? তারা তাদের কর্মের শাস্তি আস্বাদন করেছে, এবং তাদের জন্যে রয়েছে যন্ত্রণাদায়ক শাস্তি।",
            "verse 64:6": "এটা এ কারণে যে, তাদের কাছে তাদের রসূলগণ প্রকাশ্য নিদর্শনাবলীসহ আগমন করলে তারা বলতঃ মানুষই কি আমাদেরকে পথপ্রদর্শন করবে? অতঃপর তারা কাফের হয়ে গেল এবং মুখ ফিরিয়ে নিল। এতে আল্লাহর কিছু আসে যায় না। আল্লাহ অমুখাপেক্ষী প্রশংসিত।",
            "verse 64:7": "কাফেররা দাবী করে যে, তারা কখনও পুনরুত্থিত হবে না। বলুন, অবশ্যই হবে, আমার পালনকর্তার কসম, তোমরা নিশ্চয় পুরুত্থিত হবে। অতঃপর তোমাদেরকে অবহিত করা হবে যা তোমরা করতে। এটা আল্লাহর পক্ষে সহজ।",
            "verse 64:8": "অতএব তোমরা আল্লাহ তাঁর রসূল এবং অবতীর্ন নূরের প্রতি বিশ্বাস স্থাপন কর। তোমরা যা কর, সে বিষয়ে আল্লাহ সম্যক অবগত।",
            "verse 64:9": "সেদিন অর্থাৎ, সমাবেশের দিন আল্লাহ তোমাদেরকে সমবেত করবেন। এ দিন হার-জিতের দিন। যে ব্যক্তি আল্লাহর প্রতি বিশ্বাস স্থাপন করে এবং সৎকর্ম সম্পাদন করে, আল্লাহ তার পাপসমূহ মোচন করবেন এবং তাকে জান্নাতে দাখিল করবেন। যার তলদেশে নির্ঝরিনীসমূহ প্রবাহিত হবে, তারা তথায় চিরকাল বসবাস করবে। এটাই মহাসাফল্য।",
            "verse 64:10": "আর যারা কাফের এবং আমার আয়াতসমূহকে মিথ্যা বলে, তারাই জাহান্নামের অধিবাসী, তারা তথায় অনন্তকাল থাকবে। কতই না মন্দ প্রত্যাবর্তনস্থল এটা।",
            "verse 64:11": "আল্লাহর নির্দেশ ব্যতিরেকে কোন বিপদ আসে না এবং যে আল্লাহর প্রতি বিশ্বাস করে, তিনি তার অন্তরকে সৎপথ প্রদর্শন করেন। আল্লাহ সর্ববিষয়ে সম্যক পরিজ্ঞাত।",
            "verse 64:12": "তোমরা আল্লাহর আনুগত্য কর এবং রসূলুল্লাহর আনুগত্য কর। যদি তোমরা মুখ ফিরিয়ে নাও, তবে আমার রসূলের দায়িত্ব কেবল খোলাখুলি পৌছে দেয়া।",
            "verse 64:13": "আল্লাহ তিনি ব্যতীত কোন মাবুদ নেই। অতএব মুমিনগণ আল্লাহর উপর ভরসা করুক।",
            "verse 64:14": "হে মুমিনগণ, তোমাদের কোন কোন স্ত্রী ও সন্তান-সন্ততি তোমাদের দুশমন। অতএব তাদের ব্যাপারে সতর্ক থাক। যদি মার্জনা কর, উপেক্ষা কর, এবং ক্ষমা কর, তবে আল্লাহ ক্ষমাশীল, করুনাময়।",
            "verse 64:15": "তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি তো কেবল পরীক্ষাস্বরূপ। আর আল্লাহর কাছে রয়েছে মহাপুরস্কার।",
            "verse 64:16": "অতএব তোমরা যথাসাধ্য আল্লাহকে ভয় কর, শুন, আনুগত্য কর এবং ব্যয় কর। এটা তোমাদের জন্যে কল্যাণকর। যারা মনের কার্পন্য থেকে মুক্ত, তারাই সফলকাম।",
            "verse 64:17": "যদি তোমরা আল্লাহকে উত্তম ঋণ দান কর, তিনি তোমাদের জন্যে তা দ্বিগুণ করে দেবেন এবং তোমাদেরকে ক্ষমা করবেন। আল্লাহ গুণগ্রাহী, সহনশীল।",
            "verse 64:18": "তিনি দৃশ্য ও অদৃশ্যের জ্ঞানী, পরাক্রান্ত, প্রজ্ঞাময়।"
        },
        "Berber Amazigh": {
            "verse 64:1": "I illan deg igenwan, i illan di tmurt, sbuccuâen Öebbi. IneS tagelda; ineS wannuz; Neppa Izmer i yal cci.",
            "verse 64:2": "Neppa ikwen Ixelqen; segwen ajehli, segwen lmumen. Öebbi Ipwali ayen txeddmem.",
            "verse 64:3": "Ixleq tamurt akked igenwan, s tidep. Imsel ikwen, Iûeggem amsal nnwen. £uôeS tu$alin.",
            "verse 64:4": "Iéôa i illan di tmurt akked igenwan. Iéôa ayen teffrem akked wayen tennam. Öebbi Iéôa i illan deg idmaren.",
            "verse 64:5": "Ma iusa kwen id usali n wid illan, zik, d ijehliyen? Jeôben lwexda n tikli nnsen. Fellasen, aâaqeb aqeôêan.",
            "verse 64:6": "Ayagi, imi sen ppasen imazanen nnsen s ubeggen. Nnan: \"aâni d amdan ara $ inhun\"? D$a jehlen, xedâan. Ur Iclaâ Öebbi. Öebbi d Asâay, d Amaâzuz.",
            "verse 64:7": "Pputebten ijehliyen ar, d awez$i, ur d pnekkaren. Ini: \"xaîi! S Mass iw, ard a d tekkrem, sinna ard a ppepwaxebbôem $ef wayen txeddmem\"! Ayagi, i Öebbi, d ushil.",
            "verse 64:8": "Ihi, amnet s Öebbi akked Umazan iS, akked tafat id Nessers. Öebbi Ippuxebbeô $ef wayen txeddmem.",
            "verse 64:9": "Ass ideg ara kwen Issemlil, i wass ujemmel, ass nni, d ass um$uôôu. Win iumnen s Öebbi, ixeddmen ayen ilhan, ad as Ikkes tucmitin is, a t Issekcem ar leonanat, ddawat sen isaffen ppazzalen, degsen ad iwekkeô i lebda. D wagi ay d rrbeê ameqwôaêan.",
            "verse 64:10": "Wid ijehlen u inekôen issekniyen nne£, widak d at tmes, degs ad wekkôen. A taggara icemten!",
            "verse 64:11": "Ur d teppas twa$it, siwa ma Irad Öebbi. Win iumnen s Öebbi, ad Inhu ul is. Öebbi Iéôa yal cci.",
            "verse 64:12": "A$et awal i Öebbi, a$et awal i Umazan! Ma twexxôem, i iwatan kan, i Umazan nne£, siwa anabi ipbegginen.",
            "verse 64:13": "Öebbi, ur illi ôebbi siwa Neppa. £ef Öebbi ara ppeklen lmumnin.",
            "verse 64:14": "A wid iumnen! S tidep, kra n tlawin nnwen akked tarwa nnwen, d icenga nnwen. Ëadret iman nnwen segsen! Ma tsemmêem, teppum, tsemmêem, Öebbi, s tidep, Ipsemmiê, Ipêunu.",
            "verse 64:15": "Ayla nnwen akked dderya nnwen, d ahewwel kan, wanag, ar Öebbi, illa warraz ameqwôahan.",
            "verse 64:16": "Ëezzbet i Öebbi ayen iwumi tzemrem. Ëesset, ôavit, seddqet! Yif it i iman nnwen. Wid ikksen ccêa i iman nnsen, widak d imerbaê.",
            "verse 64:17": "Ma tôevlem i Öebbi aôeîîal igerzen, ad awen d Irr sin imuren, ad awen Isemmeê. Öebbi Iceffu, Iêellem.",
            "verse 64:18": "Amusnaw n wayen iffren akked wayen ivehôen, Uzmir, Bab n ûûwab."
        },
        "Bosnian": {
            "verse 64:1": "Ono što je na nebesima i ono što je na Zemlji hvali Allaha, Njemu – vlast i Njemu – pohvala; On sve može!",
            "verse 64:2": "On vas stvara, pa ste ili nevjernici ili vjernici. Sve što vi radite Allah dobro vidi.",
            "verse 64:3": "On je nebesa i Zemlju mudro stvorio, i On vam obličje daje, i likove vaše čini lijepim, i Njemu će se sve vratiti.",
            "verse 64:4": "On zna šta na nebesima i na Zemlji postoji i zna šta krijete i šta pokazujete; Allah zna svačije misli.",
            "verse 64:5": "Zar do vas nije doprla vijest o onima koji još davno nisu vjerovali, pa su kobnost postupka svoga iskusili – a još ih i patnja nesnosna čeka –",
            "verse 64:6": "zato što su govorili kada su im poslanici njihovi jasne dokaze donosili: \"Zar da nas ljudi upućuju?\" I nisu vjerovali i glave su okretali; a Allahu niko nije potreban, Allah nije ni o kome ovisan, On je jedini hvale dostojan!",
            "verse 64:7": "Nevjernici tvrde da neće biti oživljeni. Reci: \"Hoćete, Gospodara mi moga, sigurno ćete biti oživljeni, pa o onome što ste radili, doista, biti obaviješteni!\" – a to je Allahu lahko –",
            "verse 64:8": "zato vjerujte u Allaha i Poslanika Njegova i u svjetlo koje objavljujemo, Allah dobro zna ono što vi radite.",
            "verse 64:9": "A onoga dana kada vas On na onome svijetu sakupi, to će biti dan kada će vam biti jasno da ste sami sebe obmanuli. I On će preći preko hrđavih postupaka onoga ko je u Allaha vjerovao i dobra djela činio, i uvešće ga u džennetske bašče kroz koje će rijeke teći; u njima će vječno i zauvijek boraviti. To će uspjeh veliki biti!",
            "verse 64:10": "A oni koji nisu vjerovali i koji su ajete Naše poricali – biće stanovnici u vatri; u njoj će vječno ostati, a to će užasna sudbina biti!",
            "verse 64:11": "Nikakva nevolja se bez Allahove volje ne dogodi, a On će srce onoga koji u Allaha vjeruje uputiti – Allah sve dobro zna.",
            "verse 64:12": "I pokoravajte se Allahu i Poslaniku Njegovu; a ako leđa okrenete, pa – Poslanik Naš je jedino dužan da jasno objavljuje.",
            "verse 64:13": "Samo je Allah Bog! I neka se vjernici samo u Allaha pouzdaju!",
            "verse 64:14": "O vjernici, i među ženama vašim i djecom vašom, doista, imate neprijatelja, pa ih se pričuvajte! A ako preko toga pređete i opravdanje prihvatite i oprostite, pa – i Allah prašta i samilostan je.",
            "verse 64:15": "Imanja vaša i djeca vaša su samo iskušenje, a u Allaha je nagrada velika;",
            "verse 64:16": "zato se Allaha bojte koliko god možete, i slušajte i pokoravajte se i milostinju udjeljujte – za svoje dobro. A oni koji budu sačuvani gramzljivosti, biće tî koji će uspjeti.",
            "verse 64:17": "Ako Allahu drage volje zajam date, On će vam ga mnogostruko vratiti i oprostiće vam, jer Allah je blagodaran i blag.",
            "verse 64:18": "Poznavalac je nevidljivog i vidljivog svijeta, Silni i Mudri."
        },
        "Bulgarian": {
            "verse 64:1": "Всичко на небесата и всичко на земята прославя Аллах. Негова е властта и Негова е възхвалата. Той над всяко нещо има сила.",
            "verse 64:2": "Той е, Който ви сътвори. Някои от вас са неверници, а други - вярващи. Аллах е зрящ за вашите дела.",
            "verse 64:3": "Той сътвори небесата и земята с мъдрост, и ви придаде образ, и направи образа ви превъзходен, и към Него е завръщането.",
            "verse 64:4": "Той знае всичко на небесата и на земята. И знае какво спотайвате и какво разкривате. Аллах знае съкровеното в сърцата.",
            "verse 64:5": "Не стигна ли до вас вестта за онези, които не повярваха преди и вкусиха пагубността на своето дело? За тях има болезнено мъчение.",
            "verse 64:6": "Така е, техните пратеници им донасяха ясните знаци, а те казваха: “Нима хора ще ни напътват?” И не повярваха, и се отвърнаха. Но Аллах не се нуждае от тях. Аллах е пребогат, всеславен.",
            "verse 64:7": "Неверниците твърдят, че не ще бъдат възкресени. Кажи: “Не, кълна се в моя Господ, ще бъдете възкресени, после ще бъдете известени за вашите дела. За Аллах това е лесно.”",
            "verse 64:8": "Вярвайте в Аллах и в Неговия Пратеник, и в Светлината, която низпослахме! Сведущ е Аллах за вашите дела.",
            "verse 64:9": "Когато Той ви събере за Деня на събирането, това е Денят, в който ще се разкрие заблудата. От онези, които вярват в Аллах и вършат праведни дела, Той ще отмахне прегрешенията и ще ги въведе в Градините, сред които реки текат. Там ще пребивават вечно. Това",
            "verse 64:10": "А които не вярват и взимат за лъжа Нашите знамения, те са обитателите на Огъня, там ще пребивават вечно. И колко лоша е тази участ!",
            "verse 64:11": "Никоя беда не идва без позволението на Аллах. А който вярва в Аллах, Той напътва сърцето му. Аллах всяко нещо знае.",
            "verse 64:12": "И се покорявайте на Аллах, и се покорявайте на Пратеника! А ако се отвърнете, за Пратеника Ни е дълг само ясното послание.",
            "verse 64:13": "Аллах! Няма друг Бог освен Него! Затова на Аллах да се уповават вярващите!",
            "verse 64:14": "О, вярващи, сред вашите съпруги и деца имате и врагове - пазете се от тях! А ако се въздържите и извините, и простите - Аллах е опрощаващ, милосърден.",
            "verse 64:15": "Вашите имоти и деца са изпитание. А при Аллах има велика награда.",
            "verse 64:16": "Затова бойте се от Аллах, колкото ви е по силите, и слушайте, и се покорявайте, и раздавайте за свое добро! А който се предпази от скъперничеството на своята душа - тези са сполучилите.",
            "verse 64:17": "Ако заемете хубав заем на Аллах, Той ще ви го умножи. И ще ви опрости. Аллах е признателен, всеблаг -",
            "verse 64:18": "Знаещия и неведомото, и явното, Всемогъщия, Премъдрия."
        },
        "Chinese": {
            "verse 64:1": "凡在天地间的，都赞颂真主超绝万物。国权只归他所有，赞颂只归他享受，他对於万事是全能的。",
            "verse 64:2": "他曾创造你们，但你们中有不信道的，有信道的；真主是鉴察你们的行为的。",
            "verse 64:3": "他曾本著真理创造天地，他曾以形像赋予你们，而使你们的 形像优美，他是唯一的归宿。",
            "verse 64:4": "他知道天地万物，他知道你们所隐匿的和你们所表现的，真主是全知心事的。",
            "verse 64:5": "以前不信道的人们的消息，难道没有达到你们吗？那等人，曾尝试他们的事情的恶果，他们将受痛苦的刑罚。",
            "verse 64:6": "这是因为他们族中的使者显示他们许多明证，他们却说：难道凡人也能引道我们？故他们不信道而违背之。真主曾表示无求於他们的信仰，真主是无求的，是可颂的。",
            "verse 64:7": "不信道的人们，妄言他们绝不复活，你说：不然！以我的主盟誓，你们必定复活，然後你们必定获得关於你们的行为的报告，这对於真主是容易的。",
            "verse 64:8": "故你们当信仰真主和使者，和他所降示的光明。真主是彻知你们的行为的。",
            "verse 64:9": "在那日，他将在聚会日集合你们；那是相欺之日。信仰真主，而且行善的人，他将解除他的罪恶，而且使他入下临诸河的乐园，而永居其中，那确是伟大的成功。",
            "verse 64:10": "不信道，而且否认我的迹象的人们，是火狱的居民，他们将永居其中。那归宿真恶劣！",
            "verse 64:11": "凡灾难的发生，无一不是依真主的判决的。谁信真主，他将引导谁的心，真主是全知万物的。",
            "verse 64:12": "你们当服从真主，当服从使者。如果你们违背命令，那末，我的使者，只负明白通知的责任。",
            "verse 64:13": "真主，除他外，绝无应受崇拜的，教信士们只信托真主。",
            "verse 64:14": "信道的人们啊！你们的妻子儿女，有一部份确是你们的敌人，故你们当谨防他们。如果你们恕饶他们，原谅他们，赦宥他们，（真主就赦宥你们），因为真主确是至赦的，确是至慈的。",
            "verse 64:15": "你们的财产和子嗣，只是一种考验，真主那里有重大的报酬。",
            "verse 64:16": "你们当量力地敬畏真主，你们当听从他的教训和命令，你们当施舍，那是有益於你们自己的。能戒除自身的贪吝者，确是成功的。",
            "verse 64:17": "如果你们以善债借给真主，他将加倍偿还你们，而且赦宥你们。真主是善报的，是至容的。",
            "verse 64:18": "他是全知幽明的，是万能的，是至睿的。"
        },
        "Danish": {
            "verse 64:1": "Wat er ook in de hemelen en op aarde is, verheerlijkt Allah; Hem is het Koninkrijk en de Lof, want Hij heeft macht over alle dingen",
            "verse 64:2": "Hij is het Die u geschapen heeft; maar sommigen uwer zijn ongelovig en sommigen uwer zijn gelovig; en Allah ziet hoe gij handelt",
            "verse 64:3": "Hij schiep de hemelen en de aarde in waarheid, en Hij heeft u gevormd en een schone gedaante gegeven, en tot Hem is aller terugkeer",
            "verse 64:4": "Hij weet wat in de hemelen en op aarde is, Hij weet wat gij verbergt en wat gij openbaar maakt; en Allah weet alles wat in het innerlijk is",
            "verse 64:5": "Heeft het verhaal u niet bereikt van degenen die vroeger ongelovig waren? Zo ondergingen zij het kwade gevolg van hun gedrag, en hen wacht een pijnlijke straf",
            "verse 64:6": "Deze (gingen onder) omdat hun boodschappers met duidelijke bewijzen tot hen kwamen, maar zij zeiden: Zullen stervelingen ons leiden? Daarom verwierpen zij (de Waarheid) en wendden zich af, Allah toonde Zijn zelfgenoegzaamheid, want AIlah is Zichzelf-genoeg, Geprezen",
            "verse 64:7": "De ongelovigen denken dat zij niet zullen worden opgewekt. Zeg: Ja, bij mijn Heer, gij zult zeker herrijzen; dan zult gij worden onderricht omtrent hetgeen gij deedt. En dat is gemakkelijk voor Allah",
            "verse 64:8": "Gelooft daarom in Allah en Zijn boodschapper, en in het Licht dat Wij nedergezonden hebben. En Allah is op de hoogte van hetgeen gij doet",
            "verse 64:9": "Wanneer Hij u voor de Dag der Verzameling zal bijeenroepen, zal dit de tijd voor onthulling der gebreken zijn. En hij die gelooft in Allah en recht doet, - hem zal Hij zuiveren van zijn fouten en Hij zal hun tot tuinen toegang geven waardoor rivieren stromen, om daarin voor eeuwig te vertoeven. Dat is de grote zegepraal",
            "verse 64:10": "Maar wie Onze tekenen verwerpen en loochenen, zullen de bewoners van het Vuur zijn, daarin zullen zij vertoeven, en dat is een slechte bestemming",
            "verse 64:11": "Er gebeurt geen ongeluk zonder toelating van Allah. En wie in Allah gelooft, - Hij leidt zijn hart. - En Allah heeft kennis van alle dingen",
            "verse 64:12": "Gehoorzaamt dus aan Allah en gehoorzaamt de boodschapper. Maar indien gij u afwendt dan berust op Onze boodschapper alleen, de boodschap duidelijk over te brengen",
            "verse 64:13": "Allah! Er is geen God dan Hij; laat de gelovigen daarom in Allah hun vertrouwen stellen",
            "verse 64:14": "O, gij gelovigen, er zijn onder uw echtgenoten en kinderen die uw vijanden zijn, neemt u dus voor hen in acht. En indien gij verontschuldigt en door de vingers ziet en vergeeft; dan is Allah Vergevensgezind, Genadevol",
            "verse 64:15": "Uw rijkdommen en uw kinderen zijn slechts een beproeving; doch bij Allah is er een grote beloning",
            "verse 64:16": "Weest godvruchtig naar vermogen, luistert, gehoorzaamt en geeft weg, dat is beter voor u. En degenen die voor eigen vrekkigheid zijn behoed zullen slagen",
            "verse 64:17": "Indien gij een goede lening met Allah sluit, zal Hij deze voor u vermenigvuldigen en Hij zal u vergeven; want Allah is Waarderend, Verdraagzaam",
            "verse 64:18": "De Kenner van het onzienlijke en het zienlijke, de Almachtige, de Alwijze"
        },
        "Dutch": {
            "verse 64:1": "Wat er in de hemelen en op de aarde is prijst de Glorie van Allah. Aan Hem behoort de heerschappij en aan Hem behoort de lofprijzing. En Hij is Almachtig over alle zaken.",
            "verse 64:2": "Hij is Degene Die jullie geschapen heeft, en onder jullie zijn er ongelovigen en onder jullie zijn gelovigen. En Allah is Alziende over wat jullie doen.",
            "verse 64:3": "Hij heeft de hemelen en de aarde in Waarheid geschapen en Hij heeft jullie gevormd en jullie vorm nauwkeurig gemaakt. En tot Hem is de terugkeer.",
            "verse 64:4": "Hij kent wat er in de hemelen en op de aarde is en Hij kent wat jullie verbergen en wat jullie openlijk doen. En Allah is Alwetend over wat zich in de harten bevindt.",
            "verse 64:5": "Is het bericht over degenen die vroeger ongelovig waren niet tot jullie gekomen? Die toen het kwaad van hun wandaden geproefd hebben? En voor hen is er een pijnlijke bestraffing.",
            "verse 64:6": "Dat is omdat zij zeiden, toen hun Boodschappers met de duidelijke bewijzen tot hen kwamen: \"Zullen mènsen ons leiden?\" Waarop zij ongelovig werden en zich afwendden. Maar Allah heeft (hun geloof) niet nodig en Allah is Behoefteloos, Geprezen.",
            "verse 64:7": "Degenen die ongelovig zijn veronderstellen dat zij niet opgewekt zullen worden. Zeg: \"Welzeker, bij mijn Heer! Jullie zullen zeker opgewekt worden en vervolgens zullen jullie op de hoogte gebracht worden van wat jullie bedreven hebben. En dat is voor Allah gemakkelijk.",
            "verse 64:8": "Gelooft daarom in Allah en Zijn Boodschapper en het Licht (de Koran) dat Wij hebben neergezonden. En Allah is Alwetend over wat jullie doen.",
            "verse 64:9": "(Gedenkt) de Dag waarop Hij jullie zal bijeenbrengen voor de Dag van de samenkomst. Dat is de Dag van de oplichterij. En wie dan in Allah gelooft en goede daden verricht: Hij (Allah) zal zijn zonden uitwissen en hem Tuinen (het Paradijs) doen binnengaan waar de rivieren onder door stromen. Zij zijn daarin voor altijd eeuwig levenden, dat is de geweldige overwinning.",
            "verse 64:10": "Maar degenen die ongelovig waren en Onze Verzen loochenden: zij zijn degenen die de bewoners van de Hel zijn, zij zijn daarin eeuwig levenden. En slecht is de plaats van terugkeer!",
            "verse 64:11": "Er is niemand die een ramp overkomt, of deze gebeurt met het verlof van Allah. En wie in Allah gelooft: Hij zal diens hart leiden. En Allah is Alwetend over alle zaken.",
            "verse 64:12": "En gehoorzaamt Allah en gehoorzaamt de Boodschapper. Als jullie je afwenden, dan is aan Onze Boodschapper slechts de duidelijke verkondiging.",
            "verse 64:13": "Allah! Er is geen god dan Hij. En laat daarom de gelovigen op Allah vertrouwen.",
            "verse 64:14": "O jullie die geloven, voorwaar, er zijn er onder jullie vrouwen en jullie kinderen die vijanden voor jullie zijn. Kijk daarom voor hen uit. En als jullie kwijtschelden en het niet aanrekenen en vergeven, dan is Allah waarlijk Vergevensgezind en Meest Barmhartig.",
            "verse 64:15": "Voorwaar, jullie bezittingen en jullie kinderen zijn slechts een beproeving. En bij Allah is een geweldige beloning.",
            "verse 64:16": "Vreest daarom Allah volgens jullie vermogen; en luistert en gehoorzaamt; en geeft bijdragen, het is beter voor jullie zelf. En wie wordt behoed voor zijn eigen gierigheid: zij zijn degenen die de welslagenden zijn.",
            "verse 64:17": "Als jullie Allah een goede lening geven, dan zal Hij die voor jullie vermenigvuldigen en jullie vergeven. En Allah is Waarderend, Zachtmoedig.",
            "verse 64:18": "De Kenner van het onwaarneembare en het waarneembare, de Almachtige, de Alwijze."
        },
        "English": {
            "verse 64:1": "Whatever is in the heavens and whatever is on the earth is exalting Allah. To Him belongs dominion, and to Him belongs [all] praise, and He is over all things competent.",
            "verse 64:2": "It is He who created you, and among you is the disbeliever, and among you is the believer. And Allah, of what you do, is Seeing.",
            "verse 64:3": "He created the heavens and earth in truth and formed you and perfected your forms; and to Him is the [final] destination.",
            "verse 64:4": "He knows what is within the heavens and earth and knows what you conceal and what you declare. And Allah is Knowing of that within the breasts.",
            "verse 64:5": "Has there not come to you the news of those who disbelieved before? So they tasted the bad consequence of their affair, and they will have a painful punishment.",
            "verse 64:6": "That is because their messengers used to come to them with clear evidences, but they said, \"Shall human beings guide us?\" and disbelieved and turned away. And Allah dispensed [with them]; and Allah is Free of need and Praiseworthy.",
            "verse 64:7": "Those who disbelieve have claimed that they will never be resurrected. Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\"",
            "verse 64:8": "So believe in Allah and His Messenger and the Qur'an which We have sent down. And Allah is Acquainted with what you do.",
            "verse 64:9": "The Day He will assemble you for the Day of Assembly - that is the Day of Deprivation. And whoever believes in Allah and does righteousness - He will remove from him his misdeeds and admit him to gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.",
            "verse 64:10": "But the ones who disbelieved and denied Our verses - those are the companions of the Fire, abiding eternally therein; and wretched is the destination.",
            "verse 64:11": "No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things.",
            "verse 64:12": "And obey Allah and obey the Messenger; but if you turn away - then upon Our Messenger is only [the duty of] clear notification.",
            "verse 64:13": "Allah - there is no deity except Him. And upon Allah let the believers rely.",
            "verse 64:14": "O you who have believed, indeed, among your wives and your children are enemies to you, so beware of them. But if you pardon and overlook and forgive - then indeed, Allah is Forgiving and Merciful.",
            "verse 64:15": "Your wealth and your children are but a trial, and Allah has with Him a great reward.",
            "verse 64:16": "So fear Allah as much as you are able and listen and obey and spend [in the way of Allah]; it is better for your selves. And whoever is protected from the stinginess of his soul - it is those who will be the successful.",
            "verse 64:17": "If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is Most Appreciative and Forbearing.",
            "verse 64:18": "Knower of the unseen and the witnessed, the Exalted in Might, the Wise."
        },
        "Filipino": {
            "verse 64:1": "Ang anupamang nasa kalangitan at kalupaan ay nagpapahayag ng mga pagpupuri at kaluwalhatian ni Allah. Sa Kanya ang Paghahari at Siya ang nag-aangkin ng lahat ng mga papuri at pasasalamat, at Siya ay may kapangyarihan sa lahat ng bagay",
            "verse 64:2": "Siya (Allah) ang lumikha sa inyo, at sa lipon ninyo ay may mga hindi sumasampalataya, at ang iba sa inyo ay nananampalataya. At si Allah ang Lubos na Nakakamasid ng lahat ninyong ginagawa",
            "verse 64:3": "Nilikha Niya ang kalangitan at kalupaan ng may katotohanan, at Kanyang binigyan kayo ng anyo at ginawa Niya na maganda ang inyong hubog, at sa Kanya ang huling pagbabalik",
            "verse 64:4": "Talastas Niya kung ano ang nasa kalangitan at kalupaan, at batid Niya kung ano ang inyong inililihim at inilalantad. Katotohanang si Allah ang Lubos na Nakakaalam ng lahat ng mga (lihim) ng puso (ng mga tao)",
            "verse 64:5": "Hindi baga nakarating sa inyo ang balita ng mga tao ng nagdaang kahapon na nagtakwil sa pananampalataya? Kaya’t kanilang nalasap ang masamang bunga ng kanilang kawalan ng pananalig, at sasakanila ang kasakit-sakit na kaparusahan",
            "verse 64:6": "Ito’y sa dahilang ipinadala sa kanila ang kanilang mga Tagapagbalita na may Maliliwanag na Katibayan (mga Tanda), datapuwa’t sila ay nagsabi: “Isang tao baga (lamang) ang mamamatnubay sa amin?” Kaya’t itinakwil nila ang pahayag at nagsitalikod (sa Katotohanan), at si Allah ay hindi nangangailangan (sa kanila). At si Allah ay Masagana (Walang Pangangailangan), ang Karapat- dapat sa lahat ng pagpupuri",
            "verse 64:7": "Ang mga hindi sumasampalataya ay nagkukunwari na sila ay hindi ibabangong muli (sa pagsusulit). Ipagbadya (o Muhammad): “Tunay nga, sa pamamagitan ng aking Panginoon, walang pagsala na kayo ay ibabangong muli, at sa inyo ay ipapahayag (ang katotohanan at kabayaran) ng lahat ninyong ginawa, at ito ay lubhang magaan kay Allah”",
            "verse 64:8": "Samakatuwid, magsisampalataya kayo kay Allah at sa kanyang Tagapagbalita (Muhammad), at sa Liwanag (ang Qur’an) na Aming ipinanaog. At si Allah ang Lubos na Nakakaalam ng lahat ninyong ginagawa",
            "verse 64:9": "(At alalahanin) ang Araw na Kanyang ihahanay kayong (lahat) sa Araw ng Pagtitipon, - ito ang Araw ng Pagkalugi at Pakinabang sa isa’t isa (alalaong baga, ito ay pagkalugi sa mga hindi sumasampalataya sapagkat sila ay papasok sa Apoy ng Impiyerno,atpakinabangsamgasumasampalatayasapagkat sila ay papasok sa Paraiso). At sinuman ang sumampalataya kay Allah at nagsisigawa ng katuwiran at kabutihan ay ipapatawad Niya sa kanila ang kanilang mga kasalanan, at Kanyang tatanggapin sila sa Halamanan na sa ilalim nito ay may mga ilog na nagsisidaloy (Paraiso), upang manahan dito magpakailanman, ito ang Tugatog ng Tagumpay",
            "verse 64:10": "Datapuwa’t sila na nagtatakwil ng pananampalataya (alalaong baga, sa Kaisahan ni Allah) at nagtuturing sa Aming Ayat (mga katibayan, kapahayagan, aral, talata, atbp.) na walang katotohanan, sila ang magsisipanirahan sa 886 Apoy, upang manahan dito magpakailanman. At tunay na napakasama ang gayong hantungan",
            "verse 64:11": "walang anumang uri ng kapinsalaan ang may pangyayari malibang pahintulutan ni Allah (alalaong baga, ang pagpapasya at maka-diyos na pag-uutos), at kung sinuman ang sumasampalataya kay Allah, Siya ang mamamatnubay sa kanilang puso (sa tunay na Pananampalataya ng may katiyakan, alalaong baga, ang anumang sumapit sa kanya ay naisulat na ni Allah para sa kanya), at si Allah ang nakakabatid ng lahat ng bagay",
            "verse 64:12": "Kaya’t sundin ninyo si Allah at sundin ang Kanyang Tagapagbalita (Muhammad), datapuwa’t kung kayo ay magsitalikod, ang tungkulin lamang ng Aming Tagapagbalita ay upang ihatid lamang sa inyo (ang Mensahe) na lantad at maliwanag",
            "verse 64:13": "Si Allah! La ilaha ill Allah (Wala ng iba pang Diyos na karapat-dapat pag-ukulan ng pagsamba maliban kay Allah), at kay Allah (lamang), kaya’t hayaan ang mga sumasampalataya ay magtiwala sa Kanya",
            "verse 64:14": "O kayong nagsisisampalataya! Katotohanang sa lipon ng inyong mga asawa at inyong mga anak ay mayroong mga kaaway sa inyo (alalaong baga, maaari na may pumigil sa inyo sa pagsunod kay Allah), kaya’t inyong pag-ingatan sila! Subalit kung sila ay inyong patawarin at hayaan, at pagtakpan ang kanilang (mga kamalian), kung gayon, katotohanang si Allah ay Lagi nang Nagpapatawad, ang Pinakamaawain",
            "verse 64:15": "Ang inyong kayamanan at inyong mga anak ay isa lamang pagsubok, subalit kay Allah, nasa Kanya ang Pinakadakilang gantimpala (Paraiso)",
            "verse 64:16": "Kaya’t panatilihin ninyo ang inyong tungkulin kay Allah (at pangambahan Siya) sa pinakamabuti na inyong magagawa; makinig at sumunod; at gumugol sa kawanggawa tungo sa kapakanan ng inyong sariling kaluluwa. At sinuman ang iligtas ng kanyang sariling kaluluwa sa pagkagahaman, kung gayon, sila ang magkakamit ng kasaganaan",
            "verse 64:17": "Kung kayo ay magpapautang kay Allah ng isang magandang pautang (alalaong baga, ang gumugol sa Kapakanan ni Allah), ay tutumbasan Niya ito ng dalawang ulit (sa inyong kapakinabangan), at Kanyang pagkakalooban kayo ng kapatawaran. At si Allah ay Tigib ng Pagpapasalamat, ang Mapagparaya",
            "verse 64:18": "Ang Lubos na Nakakabatid ng lahat ng mga nakalingid at nakalantad, ang Pinakamataas sa Kapangyarihan, ang Puspos ng Karunungan"
        },
        "French": {
            "verse 64:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifient Allah. A Lui la royauté et à Lui les louanges. Et Il est Omnipotent.",
            "verse 64:2": "C'est Lui qui vous a créés. Parmi vous [il y a] mécréant et croyant. Allah observe parfaitement ce que vous faites.",
            "verse 64:3": "Il a créé les cieux et la terre en toute vérité et vous a donné votre forme et quelle belle forme Il vous a donnée! Et vers Lui est le devenir.",
            "verse 64:4": "Il sait ce qui est dans les cieux et la terre, et Il sait ce que vous cachez ainsi que ce que vous divulguez. Et Allah connaît bien le contenu des poitrines.",
            "verse 64:5": "Ne vous est-elle pas parvenue, la nouvelle de ceux qui auparavant ont mécru et qui ont goûté la conséquence néfaste de leur acte; ils auront en outre un châtiment douloureux.",
            "verse 64:6": "Il en est ainsi parce que leurs messagers leur venaient avec des preuves évidentes, et qu'ils ont dit: «Sont-ce des hommes qui nous guideront?» Ils mécrurent alors et se détournèrent et Allah Se passa [d'eux] et Allah Se suffit à Lui-même et Il est Digne de louange.",
            "verse 64:7": "Ceux qui ont mécru prétendent qu'ils ne seront point ressuscités. Dis: «Mais si! Par mon Seigneur! Vous serez très certainement ressuscités; puis vous serez certes informés de ce que vous faisiez. Et cela est facile pour Allah».",
            "verse 64:8": "Croyez en Allah donc et en Son messager, ainsi qu'en la Lumière [le Coran] que Nous avons fait descendre. Et Allah est Parfaitement Connaisseur de ce que vous faites.",
            "verse 64:9": "Le jour où Il vous réunira pour le jour du Rassemblement, ce sera le jour de la grande perte. Et celui qui croit en Allah et accomplit les bonnes œuvres, Il lui effacera ses mauvaises actions et le fera entrer dans des Jardins sous lesquels coulent les ruisseaux où ils demeureront éternellement. Voilà l'énorme succès!",
            "verse 64:10": "Et ceux qui ont mécru et traité de mensonges Nos versets, ceux-là sont les gens du Feu où ils demeureront éternellement. Et quelle mauvaise destination!",
            "verse 64:11": "Nul malheur n'atteint [l'homme] que par la permission d'Allah. Et quiconque croit en Allah, [Allah] guide son cœur. Allah est Omniscient.",
            "verse 64:12": "Obéissez à Allah et obéissez au Messager et si vous vous détournez... il n'incombe à Notre messager que de transmettre en clair (son message).",
            "verse 64:13": "Allah nulle autre divinité que Lui! Et c'est à Allah que les croyants [doivent] s'en remettre.",
            "verse 64:14": "O vous qui avez cru, vous avez de vos épouses et de vos enfants un ennemi [une tentation]. Prenez-y garde donc. Mais si vous [les] excusez, passez sur [leurs] fautes et [leur] pardonnez, sachez qu'Allah est Pardonneur, Très Miséricordieux.",
            "verse 64:15": "Vos biens et vos enfants ne sont qu'une tentation, alors qu'auprès d'Allah est une énorme récompense.",
            "verse 64:16": "Craignez Allah, donc autant que vous pouvez, écoutez, obéissez et faites largesses. Ce sera un bien pour vous. Et quiconque a été protégé contre sa propre avidité... ceux-là sont ceux qui réussissent.",
            "verse 64:17": "Si vous faites à Allah un prêt sincère, Il le multipliera pour vous et vous pardonnera. Allah cependant est très Reconnaissant et Indulgent.",
            "verse 64:18": "Il est le Connaisseur du monde Invisible et visible, et Il est le Puissant, le Sage."
        },
        "Fulah": {
            "verse 64:1": "Ina subhinanoo Alla kala ko woni e kammuuli e ka leydi, na woodani Mbo laamu na woodani Mbo jettooje ko O kattanɗo kala huunde",
            "verse 64:2": "Ko kanko tagi on ina e mon keefeero ina e mon goonɗinɗo Alla na yi*a ko golloton ko",
            "verse 64:3": "O tagrii kammuuli e leydi goongo O mbaadini on O moƴƴini mbaadiili mon ko e Makko woni battane mon",
            "verse 64:4": "Hombo anndi ko woni e kammuuli e leydi hombo anndi ko wirnaton e ko ɓannginton Alla na anndi ko woni e ɓerɗe",
            "verse 64:5": "Mbela araani e mon kabaruuji ɓeen yedduɓe ko adi,ɓe meeɗi lepte fiyakuuji mum en woodaniiɓe lepte muusɗe",
            "verse 64:6": "Woni sabu ɗeen lepte noon ko nelaaɓe mum en na ngaddanatnoo ɓe dallillaaji ɓannguɗi ɓe wi*a ee ko ɓanndiyankooɓe peewnata min,ɓe njeddi, Alla yondanii,Alla ko galo jettaaɗo",
            "verse 64:7": "Heefereɓe ɓe aaƴiima ɓe ummintaake,maaku oho kay ma on ummine mi woondarii joom am ma on ummine,refti ma on kumpite ko golluuɗon, ɗuum na newanii Alla",
            "verse 64:8": "Goonɗinee Alla e nelaaɗo makko e annoore nde O tellini pellet Alla ko kumpatiiɗo ko golloton ko",
            "verse 64:9": "ñande O renndi mon ñalngu denndingol oon woni ñalngu basandiral, ka goonɗinɗo Alla o golli ko lobbi o momtone boneeji mum, O naatna mbo aljanaaji ɗi caatli ndogata les majji ɓe caasa toon haa pooma, ko ɗuum woni malal manngal. @Corrected",
            "verse 64:10": "Ko ɓeen yedduɓe penni aayeeje amen ngoni yimɓe yiite saasooɓe e henge, nge bonii battane",
            "verse 64:11": "Musiiba heɓatah hay gooto si wonah e sakkitoore Alla, kala goonɗinɗo Alla O feewna ɓernde makko, Alla na anndi kala huunde",
            "verse 64:12": "Ɗoftee Alla, ɗoftoɗon Nulaaɗo on, rentoɗon ! Si on huccitii, anndee pellet, ko fawii Nulaaɗo Amen on tun, ko yottingol ɓanngina",
            "verse 64:13": "Allaahu alah deweteeɗo e goongo si wonah Kanko, ko e dow makko goonɗinɓe mbakkilato",
            "verse 64:14": "Eehey mon goonɗinɓe pellet ina e yogo e suddiiɓe mon e ɓiɓɓe mon ko añɓe mon ndeenteeɓe, si on njaafiima on njarliima pellet Alla ko jaafatooɗo jurmotooɗo",
            "verse 64:15": "Anndee pellet, jawle mon ɗen e ɓiɗɓe mon ɓen ko fitina ina ka Alla njoɓdi mawndi",
            "verse 64:16": "Kulee Alla ko kattanɗon nanee ɗoftaɗon nafqe ko ɗuum ɓuri moƴƴande pittaali mon, oon deenaaɗo fittaandu makko e ɗawre, ko ɓeen ngoni malaaɓe ɓe",
            "verse 64:17": "Si on ñamlii Alla ñamaande moƴƴere O sowana ɗum en nde, O yaafoɓe Alla ko jettoowo ko muñɗo",
            "verse 64:18": "Annduɗo wirniiɗi e feeñuɗi, Mawɗo, ñeeñɗuɗo"
        },
        "German": {
            "verse 64:1": "Allah preist (alles), was in den Himmeln und (alles) was auf der Erde ist. Ihm gehört die Herrschaft, und Ihm gehört (alles) Lob, und Er hat zu allem die Macht.",
            "verse 64:2": "Er ist es, Der euch erschaffen hat. So gibt es unter euch Ungläubige und gibt es unter euch Gläubige, und was ihr tut, sieht Allah wohl.",
            "verse 64:3": "Er hat die Himmel und die Erde in Wahrheit erschaffen und euch gestaltet, und da(bei) eure Gestalten schön gemacht. Und zu Ihm ist der Ausgang.",
            "verse 64:4": "Er weiß, was in den Himmeln und auf der Erde ist, und Er weiß, was ihr geheimhaltet und was ihr offenlegt. Und Allah weiß über das Innerste der Brüste Bescheid.",
            "verse 64:5": "Ist zu euch nicht die Kunde von denjenigen gekommen, die zuvor ungläubig waren und dann die schlimmen Folgen ihres Verhaltens kosteten? Und für sie wird es schmerzhafte Strafe geben.",
            "verse 64:6": "Dies, weil ihre Gesandten immer wieder zu ihnen mit den klaren Beweisen kamen, sie aber sagten: \"Sollen (etwa) menschliche Wesen uns rechtleiten?\" So wurden sie ungläubig und kehrten sich ab. Doch Allah bedurfte (ihrer) nicht, und Allah ist Unbedürftig und Lobenswürdig.",
            "verse 64:7": "Diejenigen, die ungläubig sind, behaupten, daß sie nicht auferweckt werden. Sag: Aber ja doch, bei meinem Herrn, ihr werdet ganz gewiß auferweckt werden; hierauf wird euch ganz gewiß das Kundgetan, was ihr getan habt. Und dies ist Allah ein leichtes.",
            "verse 64:8": "Darum glaubt an Allah und Seinen Gesandten und das Licht, das Wir hinabgesandt haben. Und Allah ist dessen, was ihr tut, Kundig.",
            "verse 64:9": "Am Tag, da Er euch zum Tag der Versammlung versammeln wird. Das ist der Tag der Übervorteilung'. Wer an Allah glaubt und rechtschaffen handelt, dem tilgt Er seine bösen Taten, und den wird Er in Gärten eingehen lassen, durcheilt von Bächen, ewig und auf immer darin zu bleiben; das ist der großartige Erfolg.",
            "verse 64:10": "Und diejenigen, die ungläubig sind und Unsere Zeichen für Lüge erklären, das sind Insassen des (Höllen)feuers, ewig darin zu bleiben - ein schlimmer Ausgang!",
            "verse 64:11": "Kein Unglück trifft (jemanden), außer mit Allahs Erlaubnis. Und wer an Allah glaubt, dessen Herz leitet Er recht. Und Allah weiß über alles Bescheid.",
            "verse 64:12": "Und gehorcht Allah und gehorcht dem Gesandten. Wenn ihr euch jedoch abkehrt, so obliegt Unserem Gesandten nur die deutliche Übermittlung (der Botschaft).",
            "verse 64:13": "Allah - es gibt keinen Gott außer Ihm. Und auf Allah sollen sich die Gläubigen verlassen.",
            "verse 64:14": "O die ihr glaubt, unter euren Gattinnen und euren Kindern gibt es welche, die euch feind sind; so seht euch vor ihnen vor. Wenn ihr aber verzeiht, nachsichtig seid und vergebt - gewiß, so ist Allah Allvergebend und Barmherzig.",
            "verse 64:15": "Euer Besitz und eure Kinder sind nur eine Versuchung; Allah aber - bei Ihm gibt es großartigen Lohn.",
            "verse 64:16": "Daher fürchtet Allah, soweit ihr könnt. Und hört zu und gehorcht und gebt Gutes für euch selbst aus'. Und diejenigen, die vor ihrer eigenen Habsucht bewahrt bleiben, das sind diejenigen, denen es wohl ergeht.",
            "verse 64:17": "Wenn ihr Allah ein gutes Darlehen gebt, wird Er es euch vervielfachen und euch vergeben. Und Allah ist stets zu Dank bereit und Nachsichtig.",
            "verse 64:18": "(Er ist) der Kenner des Verborgenen und des Offenbaren, der Allmächtige und Allweise."
        },
        "Hausa": {
            "verse 64:1": "Abin da yake a cikin sammai da wanda yake a cikin ƙasã sunã tasbĩhi ga Allah. Gare Shi mulki yake, kuma gare Shi gõdiya take. Kuma Shi, a kan kõme, Mai ikon yi ne.",
            "verse 64:2": "Shĩ ne wanda Ya halitta ku. Sa'an nan daga gare ku akwai kãfiri kuma daga gare ku akwai mũmini. Kuma Allah Mai gani ne ga abin da kuke aikatãwa.",
            "verse 64:3": "Ya halitta sammai da ƙasã da abin da yake hakkinSa. Kuma Ya sũranta ku, sa'an nan Ya kyautata sũrõrinku. Kuma zuwa gare Shi makõma take.",
            "verse 64:4": "Yanã sanin abin da ke a cikin sammai da ƙasã. Kuma Yanã sanin abin da kuke bõyẽwa da abin da kuke bayyanãwa. Kuma Allah Masani ne ga abin da ke cikin ƙirãza.",
            "verse 64:5": "Shin, babban lãbãri bai je muku ba na waɗanda suka kãfirta daga gabãni, sai suka ɗanɗani uƙũbar al'amarinsu kuma sunã da wata azãba mai raɗaɗi?",
            "verse 64:6": "Wancan sabõda lalle su Manzanninsu sun kasance sunã jẽ musu da hujjõji bayyanannu, sai suka ce: \"Ashe, wasu mutane za su shiryar da mũ?\" Sai suka kãfirta kuma suka jũya bãya, kuma Allah Ya wadãtu (daga gare su). Kuma Allah wadãtacce ne, Gõdadde.",
            "verse 64:7": "Waɗanda suka kãfirta sun riya cẽwa bã zã a tãyar da su ba. Ka ce: \"Ni, inã rantsuwa da Ubangijĩna. Lalle zã a tãyar da ku haƙĩƙatan, sa'an nan kuma lalle anã bã ku lãbãri game da abin da kuka aikata. Kuma wannan ga Allah mai sauƙi ne.\"",
            "verse 64:8": "Sabõda haka ku yi ĩmani da Allah da ManzonSa da hasken nan da Muka saukar. Kuma Allah, ga abin da kuke aikatãwa, Mai labartawa ne.",
            "verse 64:9": "A rãnar da Yake tattara ku dõmin rãnar tãruwa. Wancan ne rãnar kãmunga. Kuma wanda ya yi ĩmãni da Allah, kuma ya aikata aikin ƙwarai, zai kankare masa mũnãnan ayyukansa, kuma Yashigar da shi gidãjen Aljanna, ƙoramu na gudãna daga ƙarƙashinsu, sunã madawwama a cikinsu har abada. Wannan ne babban rabo mai girma.",
            "verse 64:10": "Kuma waɗanda suka kãfirta, kuma suka ƙaryata game da ayõyinMu, waɗannan sũne'yan wuta, sunã madawwama a cikinta. Kuma tir da makõma, ita.",
            "verse 64:11": "Wata masĩfa bã zã ta sãmu ba fãce da iznin Allah. Kuma wanda ya yi ĩmãni da Allah, Allah zai shiryar da zuciyarsa. Kuma Allah, ga dukan kõme, Masani ne.",
            "verse 64:12": "Kuma ku yi ɗã'a ga Allah, kuma ku yi ɗã'a ga Manzo. Sa'an nan idan kun jũya bãya, to, abin sani kawai, akwai iyarwa bayyananna a kan ManzonMu.",
            "verse 64:13": "Allah bãbu wani abin bauta wa fãce Shi. Kuma ga Allah, sai mũminai su dõgara.",
            "verse 64:14": "Yã kũ waɗanda suka yi ĩmani! Lalle ne daga mãtanku da ɗiyanku akwai wani maƙiyi a gare ku, sai ku yi saunarsu. Kuma idan kuka yãfe, kuma kuka kau da kai, kuma kuka gãfarta, to, lalle Allah Mai gãfara ne, Mai jin ƙai.",
            "verse 64:15": "Dũkiyõyinku da ɗiyanku fitina ɗai ne. Kuma Allah, a wurinSa akwai wani sakamako mai girma.",
            "verse 64:16": "Sai ku bi Allah da taƙawa gwargwadon abin da kuka sãmi ĩko. Kuma ku saurãra kuma ku yi ɗã'ã, kuma ku ciyar, ya fi zama alhẽri gare ku. Kuma wandaya sãɓã wa rõwar ransa, to, waɗannan sũ ne mãsu babban rabo.",
            "verse 64:17": "Idan kun bai wa Allah rance, rance mai kyau, (Allah) zai ninka shi a gare ku kuma Ya gãfarta muku. Kuma Allah Mai yawan gõdiya ne, Mai haƙuri.",
            "verse 64:18": "Shĩ ne Masanin fake da bayyane, Mabuwayi, Mai hikima."
        },
        "Hindi": {
            "verse 64:1": "जो चीज़ आसमानों में है और जो चीज़ ज़मीन में है (सब) ख़ुदा ही की तस्बीह करती है उसी की बादशाहत है और तारीफ़ उसी के लिए सज़ावार है और वही हर चीज़ पर कादिर है",
            "verse 64:2": "वही तो है जिसने तुम लोगों को पैदा किया कोई तुममें काफ़िर है और कोई मोमिन और जो कुछ तुम करते हो ख़ुदा उसको देख रहा है",
            "verse 64:3": "उसी ने सारे आसमान व ज़मीन को हिकमत व मसलेहत से पैदा किया और उसी ने तुम्हारी सूरतें बनायीं तो सबसे अच्छी सूरतें बनायीं और उसी की तरफ लौटकर जाना हैं",
            "verse 64:4": "जो कुछ सारे आसमान व ज़मीन में है वह (सब) जानता है और जो कुछ तुम छुपा कर या खुल्लम खुल्ला करते हो उससे (भी) वाकिफ़ है और ख़ुदा तो दिल के भेद तक से आगाह है",
            "verse 64:5": "क्या तुम्हें उनकी ख़बर नहीं पहुँची जिन्होंने (तुम से) पहले कुफ़्र किया तो उन्होने अपने काम की सज़ा का (दुनिया में) मज़ा चखा और (आख़िरत में तो) उनके लिए दर्दनाक अज़ाब है",
            "verse 64:6": "ये इस वजह से कि उनके पास पैग़म्बर वाज़ेए व रौशन मौजिज़े लेकर आ चुके थे तो कहने लगे कि क्या आदमी हमारे हादी बनेंगें ग़रज़ ये लोग काफ़िर हो बैठे और मुँह फेर बैठे और ख़ुदा ने भी (उनकी) परवाह न की और ख़ुदा तो बे परवा सज़ावारे हम्द है",
            "verse 64:7": "काफ़िरों का ख्याल ये है कि ये लोग दोबारा न उठाए जाएँगे (ऐ रसूल) तुम कह दो वहाँ अपने परवरदिगार की क़सम तुम ज़रूर उठाए जाओगे फिर जो जो काम तुम करते रहे वह तुम्हें बता देगा और ये तो ख़ुदा पर आसान है",
            "verse 64:8": "तो तुम ख़ुदा और उसके रसूल पर उसी नूर पर ईमान लाओ जिसको हमने नाज़िल किया है और जो कुछ तुम करते हो ख़ुदा उससे ख़बरदार है",
            "verse 64:9": "जब वह क़यामत के दिन तुम सबको जमा करेगा फिर यही हार जीत का दिन होगा और जो शख़्श ख़ुदा पर ईमान लाए और अच्छा काम करे वह उससे उसकी बुराइयाँ दूर कर देगा और उसको (बेहिश्त में) उन बाग़ों में दाख़िल करेगा जिनके नीचे नहरें जारी हैं वह उनमें अबादुल आबाद हमेशा रहेगा, यही तो बड़ी कामयाबी है",
            "verse 64:10": "और जो लोग काफ़िर हैं और हमारी आयतों को झुठलाते रहे यही लोग जहन्नुमी हैं कि हमेशा उसी में रहेंगे और वह क्या बुरा ठिकाना है",
            "verse 64:11": "जब कोई मुसीबत आती है तो ख़ुदा के इज़न से और जो शख़्श ख़ुदा पर ईमान लाता है तो ख़ुदा उसके कल्ब की हिदायत करता है और ख़ुदा हर चीज़ से ख़ूब आगाह है",
            "verse 64:12": "और ख़ुदा की इताअत करो और रसूल की इताअत करो फिर अगर तुमने मुँह फेरा तो हमारे रसूल पर सिर्फ पैग़ाम का वाज़ेए करके पहुँचा देना फर्ज़ है",
            "verse 64:13": "ख़ुदा (वह है कि) उसके सिवा कोई माबूद नहीं और मोमिनो को ख़ुदा ही पर भरोसा करना चाहिए",
            "verse 64:14": "ऐ ईमानदारों तुम्हारी बीवियों और तुम्हारी औलाद में से बाज़ तुम्हारे दुशमन हैं तो तुम उनसे बचे रहो और अगर तुम माफ कर दो दरगुज़र करो और बख्श दो तो ख़ुदा बड़ा बख्शने वाला मेहरबान है",
            "verse 64:15": "तुम्हारे माल और तुम्हारी औलादे बस आज़माइश है और ख़ुदा के यहाँ तो बड़ा अज्र (मौजूद) है",
            "verse 64:16": "तो जहाँ तक तुम से हो सके ख़ुदा से डरते रहो और (उसके एहकाम) सुनो और मानों और अपनी बेहतरी के वास्ते (उसकी राह में) ख़र्च करो और जो शख़्श अपने नफ्स की हिरस से बचा लिया गया तो ऐसे ही लोग मुरादें पाने वाले हैं",
            "verse 64:17": "अगर तुम ख़ुदा को कर्जे हसना दोगे तो वह उसको तुम्हारे वास्ते दूना कर देगा और तुमको बख्श देगा और ख़ुदा तो बड़ा क़द्रदान व बुर्दबार है",
            "verse 64:18": "पोशीदा और ज़ाहिर का जानने वाला ग़ालिब हिकमत वाला है"
        },
        "Indonesian": {
            "verse 64:1": "Bertasbih kepada Allah apa yang ada di langit dan apa yang ada di bumi; hanya Allah lah yang mempunyai semua kerajaan dan semua pujian, dan Dia Maha Kuasa atas segala sesuatu.",
            "verse 64:2": "Dialah yang menciptakan kamu maka di antara kamu ada yang kafir dan di antaramu ada yang mukmin. Dan Allah Maha Melihat apa yang kamu kerjakan.",
            "verse 64:3": "Dia menciptakan langit dan bumi dengan haq. Dia membentuk rupamu dan dibaguskan-Nya rupamu itu dan hanya kepada Allah-lah kembali(mu).",
            "verse 64:4": "Dia mengetahui apa yang ada di langit dan di bumi dan mengetahui apa yang kamu rahasiakan dan yang kamu nyatakan. Dan Allah Maha Mengetahui segala isi hati.",
            "verse 64:5": "Apakah belum datang kepadamu (hai orang-orang kafir) berita orang-orang kafir terdahulu. Maka mereka telah merasakan akibat yang buruk dari perbuatan mereka dan mereka memperoleh azab yang pedih.",
            "verse 64:6": "Yang demikian itu adalah karena sesungguhnya telah datang kepada mereka Rasul-Rasul mereka membawa keterangan-keterangan lalu mereka berkata: \"Apakah manusia yang akan memberi petunjuk kepada kami?\" lalu mereka ingkar dan berpaling; dan Allah tidak memerlukan (mereka). Dan Allah Maha Kaya lagi Maha Terpuji.",
            "verse 64:7": "Orang-orang yang kafir mengatakan bahwa mereka sekali-kali tidak akan dibangkitkan. Katakanlah: \"Memang, demi Tuhanku, benar-benar kamu akan dibangkitkan, kemudian akan diberitakan kepadamu apa yang telah kamu kerjakan\". Yang demikian itu adalah mudah bagi Allah.",
            "verse 64:8": "Maka berimanlah kamu kepada Allah dan Rasul-Nya dan kepada cahaya (Al-Quran) yang telah Kami turunkan. Dan Allah Maha Mengetahui apa yang kamu kerjakan.",
            "verse 64:9": "(Ingatlah) hari (dimana) Allah mengumpulkan kamu pada hari pengumpulan, itulah hari dinampakkan kesalahan-kesalahan. Dan barangsiapa yang beriman kepada Allah dan beramal saleh, niscaya Allah akan menutupi kesalahan-kesalahannya dan memasukkannya ke dalam jannah yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah keberuntungan yang besar.",
            "verse 64:10": "Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itulah penghuni-penghuni neraka, mereka kekal di dalamnya. Dan itulah seburuk-buruk tempat kembali.",
            "verse 64:11": "Tidak ada suatu musibah pun yang menimpa seseorang kecuali dengan ijin Allah; dan barangsiapa yang beriman kepada Allah niscaya Dia akan memberi petunjuk kepada hatinya. Dan Allah Maha Mengetahui segala sesuatu.",
            "verse 64:12": "Dan taatlah kepada Allah dan taatlah kepada Rasul-Nya, jika kamu berpaling sesungguhnya kewajiban Rasul Kami hanyalah menyampaikan (amanat Allah) dengan terang.",
            "verse 64:13": "(Dialah) Allah tidak ada Tuhan selain Dia. Dan hendaklah orang-orang mukmin bertawakkal kepada Allah saja.",
            "verse 64:14": "Hai orang-orang mukmin, sesungguhnya di antara isteri-isterimu dan anak-anakmu ada yang menjadi musuh bagimu maka berhati-hatilah kamu terhadap mereka dan jika kamu memaafkan dan tidak memarahi serta mengampuni (mereka) maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
            "verse 64:15": "Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah-lah pahala yang besar.",
            "verse 64:16": "Maka bertakwalah kamu kepada Allah menurut kesanggupanmu dan dengarlah serta taatlah dan nafkahkanlah nafkah yang baik untuk dirimu. Dan barangsiapa yang dipelihara dari kekikiran dirinya, maka mereka itulah orang-orang yang beruntung.",
            "verse 64:17": "Jika kamu meminjamkan kepada Allah pinjaman yang baik, niscaya Allah melipat gandakan balasannya kepadamu dan mengampuni kamu. Dan Allah Maha Pembalas Jasa lagi Maha Penyantun.",
            "verse 64:18": "Yang mengetahui yang ghaib dan yang nyata. Yang Maha Perkasa lagi Maha Bijaksana."
        },
        "Italian": {
            "verse 64:1": "Glorifica Allah ciò che è nei cieli e sulla terra, Sua la Sovranità, Sua la Lode. Egli è onnipotente.",
            "verse 64:2": "Egli è Colui Che vi ha creati. Fra di voi vi è chi non crede e chi crede e Allah osserva quello che fate.",
            "verse 64:3": "Egli ha creato i cieli e la terra in tutta verità, e vi ha plasmati in una forma armoniosa. Verso di Lui è il divenire.",
            "verse 64:4": "Egli conosce quel che è nei cieli e sulla terra e conosce quello che celate e quello che palesate. Allah ben conosce quello che c'è nei petti.",
            "verse 64:5": "Non vi è giunta notizia di coloro che furono miscredenti in passato? Gustarono le conseguenze della loro condotta e avranno doloroso castigo.",
            "verse 64:6": "E ciò in quanto vennero ad essi con le prove i loro messaggeri, ma dissero: “Sarà un uomo a guidarci?”. Non credettero e voltarono le spalle, ma Allah non ha bisogno [di loro]. Allah basta a Se Stesso ed è il Degno di lode.",
            "verse 64:7": "Coloro che non credono affermano che non saranno affatto resuscitati. Di': “Invece sì, per il mio Signore: sarete resuscitati, quindi sarete informati di quel che avrete fatto. Ciò è facile per Allah”.",
            "verse 64:8": "Credete dunque in Allah e nel Suo Messaggero e nella Luce che abbiamo fatta scendere. Allah è ben informato a proposito di quello che fate.",
            "verse 64:9": "Il Giorno in cui sarete riuniti per il Giorno del Raduno, sarà il Giorno del reciproco inganno. A chi avrà creduto in Allah e avrà compiuto il bene, Egli cancellerà i peccati e lo introdurrà nei Giardini dove scorrono i ruscelli, in cui rimarrà in perpetuo e per sempre. Ecco l'immenso successo.",
            "verse 64:10": "Coloro invece che non credono e tacciano di menzogna i Nostri segni, saranno i compagni del Fuoco in cui rimarranno in perpetuo. Qual tristo avvenire!",
            "verse 64:11": "Nessuna sventura colpisce [l'uomo] senza il permesso di Allah. Allah guida il cuore di chi crede in Lui. Allah è l'Onnisciente.",
            "verse 64:12": "Obbedite dunque ad Allah e obbedite al Messaggero. Se poi volgerete le spalle, [sappiate che] al Nostro Messaggero [incombe] solo la trasmissione esplicita.",
            "verse 64:13": "Allah, non v'è dio all'infuori di Lui! Confidino dunque in Allah i credenti.",
            "verse 64:14": "O voi che credete, nelle vostre spose e nei vostri figli c'è [talvolta] un nemico per voi. State in guardia. Se dimenticherete, lascerete cadere e perdonerete; in verità Allah è perdonatore, misericordioso.",
            "verse 64:15": "I vostri beni e i vostri figli non sono altro che tentazione, mentre presso Allah c'è ricompensa immensa.",
            "verse 64:16": "Temete Allah per quello che potete, ascoltate, obbedite e siate generosi: ciò è un bene per voi stessi. Coloro che si saranno preservati dalla loro stessa avidità saranno quelli che prospereranno.",
            "verse 64:17": "Se fate ad Allah un prestito bello, Egli ve lo raddoppierà e vi perdonerà. Allah è riconoscente, magnanimo,",
            "verse 64:18": "Conoscitore dell'invisibile e del palese, l'Eccelso, il Saggio."
        },
        "Japanese": {
            "verse 64:1": "天にあり地にある凡てのものは，アッラーを讃える。大権はかれの有であり，讃美もまたかれに属する。本当にかれは凡てのことに全能であられる。",
            "verse 64:2": "かれこそは，あなたがたを創られた方である。だがあなたがたの或る者は不信心者でまた，或る者は信者である。本当にアッラーは，あなたがたの行うことを御存知であられる。",
            "verse 64:3": "（かれは）真理によって天と地を創造なされ，あなたがたを形作って美しい姿になされた。またかれの御許に帰り所はあるのである。",
            "verse 64:4": "（かれは）天と地における凡てのものを知り，あなたがたの隠すものも，現わすものまでも知っておられる。またアッラーは，胸の中に抱くことを熟知なされる。",
            "verse 64:5": "昔の，信仰を拒否した者たちの消息が，あなたがたに達しなかったのか。かれらは悪行の結果を味わい，また痛ましい懲罰を受けた。",
            "verse 64:6": "それは使徒たちが，様々な明証をもってかれらのもとに来たのにも拘らず，「人間が，わたしたちを導けようか。」と言ったためである。それでかれらは信じょうとせず背き去った。だがアッラーは，何も求められない。アッラーは，満ち足られる御方讃美されるべき御方であられる。",
            "verse 64:7": "不信心な者は，甦りなどはないと主張する。言ってやるがいい。「そうではない。主に誓っていう。あなたがたは必ず甦るのである。それからあなたがたの行なったことが，必ず告げ知らされる。それはアッラーにおいては容易なことである。",
            "verse 64:8": "だからアッラーとその使徒，そしてわれが下した光明を信じなさい。本当にアッラーはあなたがたの行ったことに通暁なされる。",
            "verse 64:9": "かれがあなたがたを召集なされる集合の日は騙し合いの日である。誰でも，アッラーを信じて，善行に動しんだ者からは，様々な邪悪，不運を払われ川が下を流れる楽園にかれらを入らせ，永遠にその中に住まわせる。これは大いなる勝利（至福）である。",
            "verse 64:10": "だが信仰を拒否して，わが印を虚偽であるとした者は業火の住人で，その中に永遠に住む。何と悪い帰り所であることよ。",
            "verse 64:11": "どんな災厄も，アッラーの御許しなく起きることはない。誰でもアッラーを信仰する者は，その心を導かれよう。本当にアッラーは，凡てのことに通暁なされる。",
            "verse 64:12": "それでアッラーに従え。また使徒に従え。仮令あなたがたが背き去っても，わが使徒の務めは，只明確に（啓示を）宣べ伝えることである。",
            "verse 64:13": "アッラー，かれの外に神はないのである。それで信者はアッラーに全幅の信頼を寄せなさい。",
            "verse 64:14": "信仰する者よ，あなたがたの妻や子女の中にも，あなたがたに対する敵がいる。だからかれらに用心しなさい。だがもしあなたがたがかれらを赦し，大目にみ，かばうならば（それもよい）。本当にアッラーは，度々御赦し下される御方，慈悲深い御方であられる。",
            "verse 64:15": "あなたがたの富や子女は，一つの試みに過ぎない。アッラー，かれの御許に（だけ）偉大な報奨はある。",
            "verse 64:16": "だから心を尽してアッラーを畏れ，聞きそして従い，また（施しのために）使え，あなたがた自身のために善いであろう。また自分の貪欲に用心する者，かれらは繁栄を成就する者である。",
            "verse 64:17": "あなたがたがもしアッラーに善い貸付をするならば，かれはあなたがたのためにそれを倍加なされ，あなたがたを御赦し下されよう。本当にアッラーは感謝にあつく大度におわします。",
            "verse 64:18": "また幽玄界も現象界をも知っておられ，偉力ならびなく英明であられる。"
        },
        "Jawa": {
            "verse 64:1": "Sekabehane isining langit lan bumi padha nyebut Maha Suci Ing Allah, Allah iku kagungan keraton lan kagungan sakabehing puji. Allah iku nguwasani samu barang",
            "verse 64:2": "Alah iku kang gawe awakira, ana kang pinesthi kafir lan ana uga kang mukmin. Allah iku mirsani samu barang kang padha sira lakoni",
            "verse 64:3": "Allah gawe langit - langit lan bumi kelawan nyata, lan mangun sarta becikakke rupanira, ing tembe barang - barang iku bali marang Allah",
            "verse 64:4": "Allah nguningani isining langit lan bumi, lan nguningani barang kang padha sira umpetake lan sira edheng, Allah iku nguningani sakerenteking ati",
            "verse 64:5": "(Para wong kafir) apa sira dhurung padha weruh ceritane para wong kafir sadurungmu, rekasane padha ngrasakake patrapan anggone padha kafir uga padha dipatrapi siksa kang nglarani",
            "verse 64:6": "Anggone mangkono marga wong kafir mau didhawuhi dening para Rasule kanthi tandha yekti pirang - pirang. Wangsulane, \"Apa manungsa bisa nuduhake dalan bener marang aku?\" wong mau banjur padha kafir lan mlengos. Allah tetela ora butuh marang pracayane si kafir. Allah ora butuh marang sapa - sapa, tur panthes hing ngalembana",
            "verse 64:7": "Panemune wong kafir ig tembe ora bakal ditangekake saka pati. (Muhammad) dhawuha, \"Ora mangkono. Demi Pangeranku, besuk dina QIyamat kowe mesthi ditangekake saka pati, banjur dijelentrehi samu barang kang wis padha sira lakoni. Kang mangkono mau mungguhe Allah barang kang gampang wae",
            "verse 64:8": "Mulane padha percaya ing Allah lan utusane, lan percaya marang al-Quran yaiku pepadha kang wis Ingsun dhawuhake. Allah waspada marang samu barang kang padha sira lakoni",
            "verse 64:9": "(Muhammad) Nyaritakna dina Qiyamat. Nalikane Allah ngalumpukake sira kabeh ana dina pakumpulan, hiya iku dina kapitunan. Ing kono sing sapa percaya ing Allah sarta nglakoni panggawe beci, Allah muwung sakabehe lakune wong mau kang hala, sarta dilebokake ing suwarga kang ana bengawane mili ana sangisore kekayon. Ana ing kono langgeng salawase, kang makono mau aran kabegjan gedhe",
            "verse 64:10": "Dene para wong kafir kang padha maido al-Quran ayatingsun iku padha ana ing neraka langgeng ana kono. Ala temen kawusanan kang mangkono iku",
            "verse 64:11": "Sadhengah kasangsaran kang kelakon, ora ana kang tanpa idzining Allah. Dene sing sapa percaya ing Allah, Allah nuduhake atine wong mau marang dalan bener, Allah iku nguningani samu barang",
            "verse 64:12": "Sira padha ngabektia ing Allah, dene yen sira malengos ora nurut, wajibe utusaningsun mung ajak - ajak ngundhangake dhawuh kang cetha",
            "verse 64:13": "Ora ana sesembahan kelawan bener kejaba mung Allah, para wong mukmin padha nyumanggakake samu barang ing Allah",
            "verse 64:14": "Para mukmin! Para rabinira lan anak - anak ira iku ana kang dadi saterunira. Mulane sira kudu padha prayitna. Dene yen sira muwung lan ngapura tanpa srengen luwih becik. Satemene Allah iku kepareng ngapura tur Maha Asih",
            "verse 64:15": "Sakekhe bandhanira lan anak - anakira iku kabeh ora liwat mung dadi godha, (mulane aja padha tinggal ngabekti ing Allah). Allah bakal maringi ganjaran gedhe marang sira",
            "verse 64:16": "Ing sabisa - bisa sira padha bektia ing Allah, padha ngrungokna lan nampanana dhawuhing lan parentahe Allah, lan padha weweha dhumunung ngabekti ing Allah iku becik banget tumrap awakira. Sing sapa ngingkiri budi lumuh gawe becik, iku tetep wong begja",
            "verse 64:17": "Manawa sira potang beciking Allah, Allah bakal males becik marang sira tikel matikel lan ngapura marang sira. Allah ora ngilangake kabecikaning kawula lan Maha welas",
            "verse 64:18": "Nguningani barang kang samar - samar lan kang kasat mata, kang maha mulya tur wicaksana"
        },
        "Kazakh": {
            "verse 64:1": "Аспандардағылар және жердегілер Аллаһты барлық кемшіліктен пәк деп дәріптейді. Билік Онікі әрі мақтау да Оған арналады. Ол барлық нәрсені Жасай алушы",
            "verse 64:2": "Сендерді жаратқан Сол Аллаһ . Сендердің араларыңда кәпір де бар, әрі сендердің араларыңда иманды да мүмін де бар. Аллаһ не істеп жатқандарыңды Көруші",
            "verse 64:3": "Ол аспандарды және жерді ақиқатпен жаратты және сендерге түр-тұлға беріп, тұлғаларыңды көркем етті. Әрі қайту да Оған",
            "verse 64:4": "Ол аспандар мен жердегі нәрселерді біледі әрі Ол сендердің жасырғандарың мен жариялағандарыңды да біледі. Аллаһ кеуделердегіні жүректердегіні жақсы Білуші",
            "verse 64:5": "Сендерге бұрыннан сондай күпірлік еткендердің иманды теріске шығарушылардың хабары келмеді ме? Олар істерінің жазасын татты. Әрі оларға күйзелтуші азап бар",
            "verse 64:6": "Бұл, оларға елшілері анық дәлелдермен келген кезде олардың: «Бізді адам тура жолға салады ма?» деп, күпірлік еткендіктері қарсы келгендіктері және теріс бұрылғандықтары себепті. Аллаһ Оларға мұқтаж емес. Аллаһ Бай, Мұқтажсыз, мақтауға лайық",
            "verse 64:7": "Күпірлік етушілер ақиретке сенбегендер ешқашан тірілтілмейміз деп есептеді. Ей, Мұхаммед! Айт: «Олай емес, Раббыммен ант етемін! әлбетте, қайта тірілтілесіңдер, содан кейін сендерге не істегендеріңнің хабары беріледі. Бұл Аллаһқа оңай»,- деп",
            "verse 64:8": "Аллаһқа, Оның елшісіне және Біз түсірген Нұрға Құранға сеніңдер. Аллаһ не істеп жатқандарыңнан Хабардар",
            "verse 64:9": "Сол күні Ол сендерді Жинау Қиямет күні үшін жинайды. Бұл Тағабун (Бірін бірі алдаудың белгілі болатын, бірі пайда тауып,бірі ұтылатын) күні. Кім Аллаһқа сенсе және ізгі амал жасаса, Ол оның жамандықтарын кешіреді және оны астынан өзендер ағып жататын Жәннаттағы бақтарға кіргізеді. Олар онда мәңгі қалады. Міне, осы ұлы жетістік",
            "verse 64:10": "Ал, сондай күпірлік етіп қарсы келіп және Біздің аят-белгілерімізді өтірік санағандар, олар Отта болатындар. Олар онда мәңгі қалады. Ол баратын орын неткен жаман",
            "verse 64:11": "Кез келген қиындық тек Аллаһтың рұқсатымен ғана болады. Кім Аллаһқа сенсе, Ол оның жүрегін тура жолға бұрады. Аллаһ барлық нәрсені жақсы Білуші",
            "verse 64:12": "Аллаһқа бойсұныңдар және Елшіге бағыныңдар. Егер теріс бұрылсаңдар, Елшімізге анық жеткізу ғана жүктелген",
            "verse 64:13": "Аллаһ, Одан басқа ешбір құдай жоқ. Сондықтан имандылар Аллаһқажүгініп, істерін Оған тапсырсын тәуекел етсін",
            "verse 64:14": "Ей, иманға келгендер! Негізінде жұбайларыңның және балаларыңның ішінде сендерге жау болатындар бар, олардан абай болыңдар. Егер жазаламай, кең пейілдік танытсаңдар және кешірсеңдер, ақиқатында, Аллаһ өте Кешірімді, ерекше Мейірімді",
            "verse 64:15": "Анығында, сендердің мал-дәулеттерің және балаларың бір сынақ. Ал, Аллаһта ұлы сый бар",
            "verse 64:16": "Шама-шарықтарың жеткенше Аллаһ­тан Оның жазасынан қорқып, сақтаныңдар! Тыңдаңдар, бойсұныңдар және өздерің үшін қайырлы нәрседен зекет, садақадан беріңдер. Кім өзінің сараңдығынан сақталса, міне, солар мұратына жететіндер",
            "verse 64:17": "Егер Аллаһқа көркем қарыз берсеңдер, Ол оны сендерге еселеп арттырып қайтарады және сендерді кешіреді. Әрі Аллаһ алғысқа бөлеуші, өте Ұстамды, Жұмсақ",
            "verse 64:18": "құпия мен айқын нәрсені Білуші бәрінен Үстем, аса Дана"
        },
        "Korean": {
            "verse 64:1": "하늘에 있는 것과 대지에 있는 것이 하나님의 완벽함을 찬양하노라. 그분께 주권이 있으며 그분께 영광이 있노라. 그리고 그분께서는 모든 것이 가능한 분이시라하늘과 대지에 있는 것이 하나님의 영광을 찬미하나니 왕국와찬미는 그분의 것이로다 실로 그 분은 모든 일에 전지전능하심이라",
            "verse 64:2": "그대들을 창조하신 분이 그분이시니 그대들 중에는 불신자가 있고 그대들 중에는 믿는 자가 있더라. 하나님께서는 그대들이 행하는 것을 보고 계시는 분이라너희를 창조하신 분도 그분이시거늘 그러나 너희중의 무리는 불신자요 다른 무리는 믿는 자들 이라 실로 하나님은 너희가 행하 는 모든 것을 지켜보고 계시니라",
            "verse 64:3": "그분께서는 하늘과 대지를 진리에 걸맞게 창조하셨으며 그대들에게 형상을 부여하심에 그대들의 형상을 훌륭히 하셨노라. 그리고 귀착할 곳은 그분이라그분께서 하늘과 대지를 진리로 창조하시고 너희의 형상을 만 드사 가장 아름다운 형상으로 빚 으셨으니 최후의 목적지는 그분이시라",
            "verse 64:4": "그분께서는 하늘과 대지에 있는 것을 알고 계시며 그대들이 비밀로 하는 것과 내보이는 것을 알고 계시노라. 그리고 하나님께서는 심중에 있는 것도 알고 계시는 분이라그분은 하늘과 대지에 있는 모든 것을 아시며 또한 너희가 숨기는 것과 드러내는 모든 것도 아시나니 하나님은 심중에 있는 모 든 것을 알고 계시니라",
            "verse 64:5": "이전에 불신하던 자들의 소식이 그대들에게 전해지지 않았는가? 그들은 자신들의 참담한 결말을 맛보았노라. 그리고 그들에게는 고통스런 벌이 있을 것이라이전에 믿음을 불신했던 자들이 그들의 행위로 말미암아 사악 함을 맛보고 고통스러운 응벌이 그들에게 있었던 그들의 이야기가너희에게 이르지 아니 했느뇨",
            "verse 64:6": "그러함은 그들의 사도들이 그들에게 분명한 증거를 가져왔음에도 “한낱 인간이 우리를 인도한다 말인가?” 라고 말하며 불신하고 돌아섰기 때문이라. 하나님께서는 그 무엇도 필요치 아니하시노라. 하나님께서는 풍족하신 분이며 영광되신 분이라그것은 분명한 예증으로 선지자들이 그들에게 이르렀을 때 인 간이 우리를 인도한단 말이뇨 라 고 그들은 말하면서 불신하고 외 면하였기 때문이라 하나님은 풍성함과 영광으로 충만하시니라",
            "verse 64:7": "불신한 자들은 자신들이 결코 부활하지 않을 것이라는 헛된 확신을 가지더라. 그대(무함마드)는 말하라 : 그렇지 않노라. 나의 주님께 맹세코, 진실로 그대들은 부활할 것이며 그런 후 그대들이 행하던 일을 통보 받을 것이니 그것은 하나님에게 쉬운 일이라`믿음을 부정한 자들은 부활이없다고 주장하나 일러가로되 그렇지 아니하며 주님에 의하여 부활 되어 너희가 행한 모든것에 관해 질문을 받게 되니라 그렇게 함이 하나님께는 쉬운 일이라",
            "verse 64:8": "그러니 그대들은 하나님과 그분의 사도와 내가 내린 빛을 믿으라. 하나님께서는 그대들이 행하는 일에 밝으신 분이라그러므로 하나님과 그분의 선지자와 하나님이 계시한 빛을 믿 으라 하나님은 너희가 행하는 모 든 것을 알고 계시니라",
            "verse 64:9": "그날 그분께서는 집합의 날을 위해 그대들을 모으실 것이니 그 날은 득실의 날이라. 하나님을 믿고 선행을 실천하는 자가 있다면 그분께서는 그의 악행을 용서해 주실 것이며 그를 천국에 들게 하실 것이니 그 아래로부터는 강이 흐르며 그들은 그 안에서 영원히 머물 것이라. 이것이야말로 위대한 성공이라군집하는 어느 날을 위하여 하나님이 너희를 집합시키는 그날은 너희 가운데 잃은 자와 얻은 자가 있게 되는 날로 하나님을 믿어 의로움을 행한 자를 위해 그분은 그들의 과오를 거두어 주사 강물이 흐르는 천국으로 그들이 들어가는 것을 허락하여 영생케 하니 그것이 승리라",
            "verse 64:10": "그러나 불신하며 나의 징표를 부인하는 자, 저들은 불지옥의 거주자들로서 그 안에서 머물 것이라. 얼마나 사악한 귀착지인가그러나 믿음을 불신하고 하나님의 예증들을 거역한 자들은 불지옥의 거주자가 되어 그곳에서영주하리니 사악한 운명이라",
            "verse 64:11": "그 어떤 시련도 하나님의 허락 없이는 일어나지 않노라. 하나님을 믿는 자가 있다면 그분께서는 그의 마음을 인도하실 것이라. 하나님께서는 그 모든 것을 알고 계신 분이라하나님의 허락없이 어떤 재앙도 있을 수 없나니 하나님은 그분을 믿는자의 마음을 인도하실 것이라 실로 하나님은 모든 것을 아심으로 충만하시니라",
            "verse 64:12": "그대들은 하나님을 따르고 사도를 따르라. 만약 그대들이 돌아선다면 나의 사도의 임무는 오직 명백하게 메시지를 전달하는 것 뿐이라그러므로 하나님께 복종하고선지자께 순종하라 너희가 외면한 다 하여도 하나님의 선지자는 분 명한 메세지를 전하는 것 뿐이라",
            "verse 64:13": "하나님 그분 이외에는 경배 받을 존재가 없노라. 믿는 자들은 오직 하나님께만 의탁하도록 하라하나님 외에는 신이 없나니 믿는 신도들이여 그분께만 의탁해 야 하니라",
            "verse 64:14": "믿는 자들이여! 실로 그대들의 배우자들과 자손들의 일부는 그대들의 적이니 그들을 유의하라. 만약 그대들이 관용과 아량을 베풀고 용서하여 준다면 실로 하나님께서는 너그러이 용서하시는 자애로우신 분이라믿는 사람들이여 너희 아내 와 자손 중에도 너희 적이 있거늘 그들도 조심하라 그러나 너희가 사랑을 베풀어 용서하고 관용을 베푼다면 하나님은 관용과 자비로 충만하시니라",
            "verse 64:15": "그대들의 재산과 자식들은 시험일 뿐이라. 위대한 보상은 하나님 그분께 있노라너희 재산과 너희 자손은 하나의 시험이나 하나님 안에 있는 것은 가장 위대한 보상이라",
            "verse 64:16": "그러니 그대들은 능력껏 하나님을 두려워하고 듣고 따르며 그대들 자신을 위해 좋은 것으로써 희사하라. 자아의 각박함으로부터 벗어난 자, 그러한 자들이야말로 성공한 자들이라그러므로 최선을 다하여 하 나님을 두려워하고 귀를 기울이 며 순종하고 자선을 베풀라 그것 이 너희 스스로를 위한 복이 되며 스스로의 탐욕에서 벗어나는 자만 이 번성함을 누리니라",
            "verse 64:17": "그대들이 돌려받지 않을 빚을 하나님께 내준다면 그분께서는 그것을 배가시켜 주실 것이며 그대들을 용서해 주실 것이라. 하나님께서는 가장 풍성히 보답하시는 분이며 관대히 용인하시는 분이라너희가 하나님을 위하여 좋 은 것으로 자선을 베푼다면 그분 은 그것을 너희에게 두배로 하여 주시며 너희에게 관용을 베풀어 주시나니 실로 하나님은 은혜로 보답하시며 자비로운 분이시라",
            "verse 64:18": "보이지 않는 것과 보이는 것을 알고 계시는 분이시며, 가장 존엄하시고 가장 현명하신 분이시라숨겨진 것과 드러나 있는 모든 것을 아시는 권능과 지혜로 충 만한 분이시라"
        },
        "Kurdish": {
            "verse 64:1": "Tiþtê di asimana û tiþtê di zemîn de her Xuda pak bêrî didêrin. Mulk ê wî ye. Pesn û sipas her jê re ne. Ew bi her tiþtî dikareهه‌رچی له ئاسمانه‌کان و هه‌رچی له زه‌ویدا هه‌یه یادی خوا به‌پاکی و بێگه‌ردی ده‌که‌ن، ده‌سه‌ڵات هه‌ر بۆ ئه‌وه و هه‌ر بۆ ئه‌ویش سوپاس، هه‌ر ئه‌ویش ده‌سه‌ڵاتداره به‌سه‌ر هه‌موو شتێکدا.",
            "verse 64:2": "Ew e ê ku we aferandiye; vêca hin ji we kafir in û hin ji we jî bawermend in. Xuda, tiþtê hûn dikin baþ dibîneئه‌وزاته ئه‌وه‌یه ئێوه‌ی دروست کردووه‌، جا هه‌تانه بێ باوه‌ڕه‌و هه‌تانه باوه‌ڕدا، خوایش بینایه به‌هه‌موو ئه‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن.",
            "verse 64:3": "Asîmana û zemîn bi rastitê aferandiye, û sikûm û rûçik bi we daye vêca sikûm û rûçikên we xweþik çêkiriye. Veger her bal wî ve yeئه‌و خوایه له‌سه‌ر بنچینه‌ی حه‌ق و ڕاستی ئاسمانه‌کان و زه‌وی دروست کردووه‌، وێنه‌ی ڕووخساری ئێوه‌شی کێشاوه به‌جوانترین شێوه‌، گه‌رانه‌وه‌و سه‌رئه‌نجامیش هه‌ر بۆ لای ئه‌وه‌.",
            "verse 64:4": "Tiþtê di asîmana û zemîn de dizane û tiþtê hûn vediþêrin û tiþtê hûn diyar dikin jî dizane. Xuda zanayê bi veþariyê di singan de yeهه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه و ده‌گوزه‌رێت، خوا ئاگاو زانایه پێی، هه‌روه‌ها ده‌زانێت چی په‌نهان ده‌که‌ن و چی ئاشکرا ده‌که‌ن، هه‌میشه ئه‌و خوایه زانایه به هه‌رچی له پێچ و په‌نای سینه‌کاندا حه‌شاردراوه‌.",
            "verse 64:5": "Ma xebera ên berê kafir bûne ji we re nehat ku wan sezayê karê xwe tam kirin. Ji wan re ezabekî bi jan jî heyeئایا هه‌واڵی ئه‌وانه‌تان پێ نه‌گه‌یشتووه که پێشتر بێ بڕوا بوون، چۆن سزاو ئازاری کارو کرده‌وه‌کانیان چه‌شت له دنیادا، له قیامه‌تیشدا سزای به‌ئێش و ئازار بۆتان ئاماده‌یه (چونکه تاوانی بێ باوه‌ڕی زۆر گه‌وره‌یه و سه‌رچاوه‌یه بۆ هه‌موو گوناهـ و تاوانێک).",
            "verse 64:6": "Evê han ji ber ku bi rastî pêxemberên wan bi nîþanên xuya ji wan re hatin vêca wan got ku: \"Ma wê mirovekî me bide ser rêya rast?\" Vêca ew kafir bûn û rû zivirandin. Xuda (ji wan) bêhewce bû-tu paxevê bi wan nekir. Xuda devlemendê bêhewce hêjayê pesn eئه‌وه‌ش بۆیه پێشهات چونکه پێغه‌مبه‌ران به‌جۆره‌ها به‌ڵگه‌و موعجیزه‌، په‌یامی خوایان پێڕاگه‌یاندن که‌چی وتیان: ئه‌مانه به‌شه‌رن وه‌کو ئێمه‌، چۆن ده‌بنه پێغه‌مبه‌رو چاوساغمان؟ به‌و بیانووه ڕێبازی بێ باوه‌ڕیان هه‌ڵبژاردو پشتیان هه‌ڵکرد، خوایش پێویستی به‌ئیمانی ئه‌وان نیه چونکه خوا خۆی ده‌وڵه‌مه‌نده‌و بێنیازه و شایسته‌ی سوپاسه‌.",
            "verse 64:7": "Ewên kafir bûne, guman kirin ku wê tu car (ji goran) neyên rakirin. Tu bêje ku: \"Belê çewa (hûnê neyên rakirin); Bi perwerdekarê xwe kim hûnê her bêne rakirin paþê hûnê bi kirinê xwe bêne haydar kirin. Evê han li ser Xuda pirr hêsan eئه‌وانه‌ی بێ باوه‌ڕ بوون به بۆچوونی خۆیان وتیان: هه‌رگیز زیندوو ناکرێنه‌وه‌، پێیان بڵێ: وا نیه‌، سوێند به په‌روه‌ردگارم، به‌ڕاستی هه‌ر زیندوو ده‌کرێنه‌وه‌، پاشان ئاگادار ده‌کرێن له هه‌موو ئه‌و کارو کرده‌وانه‌ی که ئه‌نجامتان ده‌دا، ئه‌وه‌ش بۆ خوا زۆر ئاسان و ساده‌یه‌.",
            "verse 64:8": "Nexwe hûn bi Xuda û pêxemberê wî û ronahiya ku daxistiye bawerî bînin. Xuda bi tiþtê hûn dikin kûrzana yeکه‌واته تا زووه باوه‌ڕ بهێنن به‌خواو به پێغه‌مبه‌ره‌که‌ی و به‌و نوور و ڕۆشناییه‌ی که ناردوومانه‌ته خواره‌وه (که قورئانه‌)، دڵنیاش بن که خوا ئاگایه به هه‌موو ئه‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن.",
            "verse 64:9": "Roja ku wê we ji bo roja civîne (roja qiyametê) bicivîne; ew (roja) han roja kar û ziyanê ye. Kî bi Xuda bawerî bîne û karê qenc bike, ewê nepakiyên wî jê bibe û wê wî têxe bihiþtên ku çem ji bînê wan diherikin, wê hertimî hertim tê de bimînin. Rizgariya mezin eva hayeڕۆژێک دێت خوا هه‌مووانتان کۆده‌کاته‌وه‌، بۆ ڕۆژی کۆبوونه‌وه‌که‌، ئه‌وه ڕۆژی زیان باریه‌، جا ئه‌وه‌ی ئیمان و باوه‌ر بهێنێت به خواو کرده‌وه‌ی چاکیش ئه‌نجام بدات، ئه‌وه خوا چاوپۆشی ده‌کات له گوناهو هه‌ڵه‌کانی و ده‌یخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نده‌ها ڕوبار به‌ژێر دره‌خته‌کانیدا ده‌ڕوات، هاوڕێ له‌گه‌ڵ ژیانی نه‌بڕاوه‌دا بۆ هه‌میشه‌و هه‌تا هه‌تایی، ئه‌وه‌یه سه‌رکه‌وتن و سه‌رفرازی گه‌وره‌و بێسنوور.",
            "verse 64:10": "Ewên kafir bûne û ayetên me derewandine ehlê agir her ewên han in, wê hertimî tê de bimînin. Çi þûnvegerek ne rind eئه‌وانه‌ش که بێ باوه‌ڕ بوون و ئایه‌ت و فه‌رمانه‌کانی ئێمه‌یان به‌درۆزانی، ئا ئه‌وانه نیشته‌جێی ناو ئاگرن و ژیانی نه‌بڕاوه تیایدا ده‌بنه سه‌ر، ئای که سه‌رئه‌نجامێکی زۆر ناخۆش و ناله‌باره‌.",
            "verse 64:11": "Her musîbeta çêbibe hey bi destûra Xuda ye. Kî bi Xuda bawerî bîne wê ew dilê wî bal rastiyê ve rêberî bike.Xuda zanayê bi her tiþtî yeبه‌فه‌رمانی خوا نه‌بێت هیچ خۆشی و ناخۆشیه‌ك پێش نه‌هاتووه‌، جا ئه‌وه‌ی باوه‌ڕی ته‌واو بهێنێت، خوا دڵی ڕێنموویی ده‌کات بۆ لای خۆی، (هه‌ر بارودۆخێکی به‌سه‌ردا بێت، له خۆشی و ناخۆشی به‌تاقیکردنه‌وه‌ی ده‌زانێت) خوای گه‌وره‌ش هه‌میشه به‌هه‌موو شتێک زانایه‌.",
            "verse 64:12": "Hûn peyrewtiya Xuda û peyrewtiya pêxember bikin. Vêca eger hûn rû bizivrînin êdî bêguman li ser pêxemberê me tenê daxuyandinek aþîkar heyeفه‌رمانبه‌رداریی خوا بکه‌ن و فه‌رمانبه‌رداریی پێغه‌مبه‌ریش (صلی الله علیه وسلم) بکه‌ن، جا ئه‌گه‌ر پشت هه‌ڵکه‌ن و گوێڕایه‌ڵ نه‌بن ئه‌وه خۆتان زه‌ره‌ر ده‌که‌ن، ئه‌گینا ته‌نها گه‌یاندنی ڕوون و ئاشکرایی په‌یـامه‌که‌ی، ئه‌رکی سه‌رشانی پێغه‌مبه‌ره‌که‌مانه‌.",
            "verse 64:13": "Xuda,ji wî pêve tu Xuda nînin. Êdî bira bawermend her xwe bispêrin Xuda-الله‌- خوایه‌که جگه له خوایه‌کی تر نیه که دروستکار بێت و خاوه‌نی فه‌رمان بێت، ده‌با ئه‌وانه‌ی ئیماندارن هه‌ر پشت به‌و خوایه ببه‌ستن و داوای یارمه‌تی هه‌ر له‌و بکه‌ن.",
            "verse 64:14": "Gelî ên bawerî anîne! bêguman hin ji jinên we û zarûkên we ji we re neyar in; vêca hûn xwe ji wan biparêzin. Eger hûn lêbiborin û xweþ bibînin û bibexþînin, êdî bêguman Xuda bexþendekar e dilovan eئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌.. هه‌ندێك له هاوسه‌رانتان یان هه‌ندێک له ڕۆڵه‌و نه‌وه‌کانتان دوژمنتانن.. جا ئێوه‌ش وریابن و خۆتان بپارێزن لێیان، جا ئه‌گه‌ر چاوپۆشی له هه‌ڵه‌یان بکه‌ن و واز له ئازاردانیان بهێنن و لێیان ببورن، ئه‌وه چاك بزانن که خوا لێخۆسبووه و میهره‌بانه‌.",
            "verse 64:15": "Bêguman malên we û zarûyên we ji we re her sihêtî ne. Xuda li balê xelatekî mezin heyeدڵنیابن که ماڵ و سامان و ڕۆڵه و نه‌وه‌کانتان بۆ تاقی کردنه‌وه‌تانن، (ئه‌گه‌ر له‌و بوارانه‌دا سه‌رکه‌وتن به‌ده‌ست بهێنن)، خوای میهره‌بان پاداشتی گه‌وره‌و و زۆری له لایه بۆ خۆگرو لێبورده‌کان.",
            "verse 64:16": "Vêca hûn biqasî dikarin xwe ji Xuda biparêzin-bitirsin û guhdarî bikin û peyrewtî bikin û ji xwe re qencî bikin. Kî ji çikûsî û timatiya xwe bê parastin êdî ên rizgarbûyî her ewên han inکه‌وابوو هه‌تا ده‌توانن به‌ته‌قواو خواناس بن، گوێڕایه‌ڵ و فه‌رمانبه‌ردار بن، خێرو چاکه‌ش بکه‌ن، ئه‌وانه هه‌مووی بۆ خۆتان چاکه‌، جا ئه‌وه‌ی خۆی بپارێزێت له ڕه‌زیلی و ڕژدی نه‌فسی خۆی، ئا ئه‌وانه هه‌ر خۆیان سه‌رفرازن.",
            "verse 64:17": "Eger hûn deynekî rind bi deyndarî bidin Xuda ewê wî ji we re pirrtir bike û ji we re bibexþîne. Xuda sipaskar e mulayim eئه‌گه‌ر قه‌رز بده‌ن به خوا، به‌شێوه‌کی چاك (مه‌به‌ست به‌خشینی ماڵ و سامانه له پێناوه خوادا) ئه‌وه خوا چه‌ند به‌رابه‌ری ده‌کات بۆتان، هه‌روه‌ها لێتان خۆش ده‌بێت خوایش سوپاسگوزاره (له‌سه‌ر به‌خشن که هه‌ر به‌خششی خۆیه‌تی) و خۆڕاگره (مۆڵه‌تی ڕه‌زیله‌کانیش ده‌دات تا کاتی خۆی).",
            "verse 64:18": "Zanayê bi penhan û peyda ye serkeftiyê hîkmetdar eئه‌و زاته ئاگاداری نهێنی و ئاشکرایه‌، خوایه‌کی باڵاده‌ست و دانایه‌."
        },
        "Kyrgyz": {
            "verse 64:1": "Аллаһты(н Атын) асмандардагы жана Жердеги бардык (жандуу-жансыз) нерселер аруулашат. Мүлк Аныкы, мактоо Өзүнө гана таандык! Ал - бардык нерсеге Кудуреттүү",
            "verse 64:2": "(О,инсандар!) Ал силерди жараткан. Силердин араңарда каапыр да бар, ыймандуу да бар. Аллаһ бардык ишиңерди Көрүүчү",
            "verse 64:3": "Аласмандар менен жерди акыйкат менен жаратты, силерге эң сонун келбет берди жана көрүнүшүңөрдү көрктүү кылды. Кайтып баруу — Өзүнө",
            "verse 64:4": "Аласмандардагы жана жердеги бардык нерсени билет жана силердин сырыңарды да сыртыңарды да билет. Аллаһ жүрөктөрдө катылган нерселерди да Билүүчү",
            "verse 64:5": "(О,мушриктер!) силерге мурдагы каапыр жамааттардын кабары келбеди беле? Алар өз кылмыштарынын жазасын тартышкан”. Жана аларга (Кыяматта) катуу азап бар",
            "verse 64:6": "Мунун себеби, аларга пайгамбарлары анык далилдерди алып келгенде «бизди адам перзенти Туура Жолго баштайт бекен?» деп, каапыр болуп, жүз буруп кетишти!. Аллаһ аларга муктаж эмес. Аллаһ — Беймуктаж, Макталган",
            "verse 64:7": "Каапырлар «биз эч качан кайра тирилбейбиз» деп ойлошту. Айткын: «жок, андай эмес! Раббиме ант ичип айтамын: силер шексиз (Аллаһтын кудурети менен) кайра тирилесиңер жана албетте, силерге жасаган ишиңердин кабары берилет. Бул Аллаһ үчүн жеңил",
            "verse 64:8": "Эми, (эсиңерге келип) Аллаһка, Анын пайгамбарына жана биз түшүргөн Нурга (Кураанга) ыйман келтиргиле! Аллаһ бардык ишиңерден Кабардар",
            "verse 64:9": "(Аллаһ) силерди чогулуш күнүнө чогулткан (Кыямат) күндү (эстегиле). Ал — Тагаабун Күнү?! Ким Аллаһка ыйман келтирип, жакшы амалдарды кылган болсо, (Аллаһ) анын күнөөлөрүн кечирип, астынан дарыялар аккан бейиштерге киргизет. Алар анда түбөлүк калышат. Бул — Улуу жетишендик",
            "verse 64:10": "Ал эми, каапыр болуп, Биздин аяттарыбызды жалган дегендер тозок ээлери болуп, анда түбөлүк калышат. Кандай жаман акыбет",
            "verse 64:11": "(Пенделерге) жеткен ар бир балээ Аллаһтын гана уруксаты менен болот. Ким Аллаһка ыйман келтирсе, анын жүрөгүн Туура Жолго багыттап койот. Аллаһ бардыгын Билүүчү",
            "verse 64:12": "Аллаһка моюн сунгула, пайгамбарга моюн сунгула! Эгер моюн сунбасаңар (өзүңөргө зыян.) Биздин элчибиздин милдети (акыйкатты) анык жеткирип коюудан гана турат",
            "verse 64:13": "(Ал —) Аллаһ! Бир Өзүнөн башка сыйынууга татыктуу кудай жок! Ыймандуулар Аллаһка гана тобокел кылышсын",
            "verse 64:14": "О, ыйман келтирген пенделер! (Кээ бир учурда) силерге аялдарыңар менен перзенттериңердин арасынан (Аллаһ Жолунан тосуучу) душмандар чыгат. Алардан абайлагыла! Эгер аларды кечирип, айкөлдүк кылсаңар (билип алгыла) Аллаһ -Кечиримдүү, Ырайымдуу",
            "verse 64:15": "Чынында, мал-дүйнөңөр менен бала-чакаңар силерге сыноо. Аллаһтын алдында улуу сооптор бар",
            "verse 64:16": "Аллаһтан алыңар жеткенче такыба кылгыла жана (пайгамбардын өкүм-насааттарын) угуп, моюн сунгула. Жана (Аллаһ Жолунда) садака кылгыла. (Бул ишиңер) өзүңөргө жакшы. Ким напсинин ачкөздүгүнөн сактана алган болсо, дал ошолор жеңишке жеткендер",
            "verse 64:17": "Эгер Аллаһка жакшынакай карыз берсеңер!, силерге бир нече эсе? көбөйтүп кайтарат жана (буга кошумча иретинде) күнөөңөрдү да кечирет. Аллаһ - (жакшылыктарга) Шүгүр кылуучу. жана (пейили) Жумшак",
            "verse 64:18": "(Аллаһ) кайыпты да, ашкерени да Билүүчү, Кудуреттүү, Даанышман"
        },
        "Malay": {
            "verse 64:1": "Segala yang ada di langit dan yang ada di bumi sentiasa mengucap tasbih kepada Allah; bagiNyalah kuasa pemerintahan, dan bagiNyalah segala pujian; dan Ia Maha Kuasa atas tiap-tiap sesuatu.",
            "verse 64:2": "Dia lah yang mengaturkan kejadian kamu; maka ada sebahagian dari kamu yang kafir dan ada sebahagian dari kamu yang beriman; dan Allah Maha Melihat akan segala yang kamu kerjakan (serta membalas masing-masing).",
            "verse 64:3": "Ia menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat, dan Ia menentukan bentuk rupa kamu serta memperelokkan rupa kamu; dan kepadaNyalah tempat kembali.",
            "verse 64:4": "Ia mengetahui segala yang ada di langit dan di bumi; dan Ia mengetahui segala yang kamu rahsiakan serta yang kamu zahirkan; dan Allah sentiasa Mengetahui segala (isi hati) yang terkandung di dalam dada;",
            "verse 64:5": "Bukankah telah sampai kepada kamu berita orang-orang kafir yang telah lalu? Lalu mereka merasai kesan yang buruk dari perbuatan kufur mereka; dan mereka (pada hari akhirat kelak) beroleh azab seksa yang tidak terperi sakitnya.",
            "verse 64:6": "(Balasan) yang demikian itu, kerana sesungguhnya mereka pernah didatangi Rasul-rasul (yang diutus kepada) mereka dengan membawa keterangan-keterangan yang jelas nyata, maka mereka berkata:\" Patutkah manusia (yang seperti kami - menjadi Rasul untuk) memberi petunjuk kepada kami?\" Lalu mereka kufur ingkar serta berpaling (dari kebenaran); dan Allah pun menyatakan tidak berhajatNya (kepada iman dan ketaatan mereka lalu membinasakan mereka); dan Allah sememangnya Maha Kaya, lagi tetap Terpuji.",
            "verse 64:7": "(Di antara sebab-sebab kufur) orang-orang yang kafir (ialah kerana mereka) mengatakan bahawa mereka tidak sekali-kali akan di bangkitkan (sesudah mati). Katakanlah: \"Bahkan, demi Tuhanku, kamu akan dibangkitkan, kemudian kamu akan diberitahu tentang segala yang kamu telah kerjakan. Dan yang demikian itu adalah mudah bagi Allah melaksanakannya.",
            "verse 64:8": "Oleh itu, berimanlah kamu kepada Allah dan kepada rasulNya serta kepada penerangan cahaya Al-Quran - yang Kami turunkan. Dan (ingatlah), Allah Amat Mendalam PengetahuanNya akan segala yang kamu kerjakan.",
            "verse 64:9": "(Ingatkanlah) masa Allah menghimpunkan kamu pada hari perhimpunan (untuk menerima balasan), - itulah hari masing-masing nampak kerugiannya. Dan (ingatlah), sesiapa yang beriman kepada Allah serta mengerjakan amal soleh, nescaya Allah mengampunkan dosa-dosanya dan memasukkannya ke dalam Syurga yang mengalir di bawahnya beberapa sungai, mereka kekal di dalamnya selama-lamanya; yang demikian itulah kemenangan yang besar.",
            "verse 64:10": "Dan orang-orang yang kafir serta mendustakan ayat-ayat keterangan Kami, merekalah ahli neraka, kekalah mereka di dalamnya; dan itulah seburuk-buruk tempat kembali.",
            "verse 64:11": "Tidak ada kesusahan (atau bala bencana) yang menimpa (seseorang) melainkan dengan izin Allah; dan sesiapa yang beriman kepada Allah, Allah akan memimpin hatinya (untuk menerima apa yang telah berlaku itu dengan tenang dan sabar); dan (ingatlah), Allah Maha Mengetahui akan tiap-tiap sesuatu.",
            "verse 64:12": "Dan taatlah kamu kepada Allah serta taatlah kepada Rasulullah; maka kalau kamu berpaling (enggan taat, kamulah yang akan menderita balasannya yang buruk), kerana sesungguhnya kewajipan Rasul Kami hanyalah menyampaikan (perintah-perintah) dengan jelas nyata.",
            "verse 64:13": "Allah, tiada Tuhan melainkan Dia; dan dengan yang demikian, kepada Allah jualah orang-orang yang beriman wajib berserah diri.",
            "verse 64:14": "Wahai orang-orang yang beriman! Sesungguhnya ada di antara isteri-isteri kamu dan anak-anak kamu yang menjadi musuh bagi kamu; oleh itu awaslah serta berjaga-jagalah kamu terhadap mereka. Dan kalau kamu memaafkan dan tidak marahkan (mereka) serta mengampunkan kesalahan mereka (maka Allah akan berbuat demikian kepada kamu), kerana sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani.",
            "verse 64:15": "Sesungguhnya harta benda kamu dan anak-anak kamu itu hanyalah menjadi ujian, dan di sisi Allah jualah pahala yang besar.",
            "verse 64:16": "Oleh itu bertaqwalah kamu kepada Allah sedaya supaya kamu; dan dengarlah (akan pengajaran-pengajaranNya) serta taatlah (akan perintah-perintahNya); dan belanjakanlah harta kamu (serta buatlah) kebajikan untuk diri kamu. Dan (ingatlah), sesiapa yang menjaga serta memelihara dirinya daripada dipengaruhi oleh tabiat bakhilnya, maka merekalah orang-orang yang berjaya.",
            "verse 64:17": "Dan kalau kamu memberi pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas), nescaya Allah akan melipat gandakan balasanNya kepada kamu serta mengampunkan dosa-dosa kamu; dan Allah amat memberi penghargaan dan balasan kepada golongan yang berbuat baik, lagi Maha Penyabar (untuk memberi peluang kepada golongan yang bersalah supaya bertaubat).",
            "verse 64:18": "Dia lah yang mengetahui segala yang ghaib dan yang nyata, (dan Dia lah jua) yang Maha Kuasa, lagi Maha Bijaksana."
        },
        "Malayalam": {
            "verse 64:1": "ആകാശങ്ങളിലുള്ളതും ഭൂമിയിലുള്ളതും അല്ലാഹുവെ പ്രകീര്‍ത്തിക്കുന്നു. അവന്നാണ് ആധിപത്യം. അവന്നാണ് സ്തുതി. അവന്‍ ഏതുകാര്യത്തിനും കഴിവുള്ളവനാകുന്നു.",
            "verse 64:2": "അവനാണ് നിങ്ങളെ സൃഷ്ടിച്ചവന്‍. എന്നിട്ട് നിങ്ങളുടെ കൂട്ടത്തില്‍ സത്യനിഷേധിയുണ്ട്‌. നിങ്ങളുടെ കൂട്ടത്തില്‍ വിശ്വാസിയുമുണ്ട്‌. അല്ലാഹു നിങ്ങള്‍ പ്രവര്‍ത്തിക്കുന്നതിനെ പറ്റി കണ്ടറിയുന്നവനാകുന്നു.",
            "verse 64:3": "ആകാശങ്ങളും, ഭൂമിയും അവന്‍ മുറപ്രകാരം സൃഷ്ടിച്ചിരിക്കുന്നു. നിങ്ങള്‍ക്കവന്‍ രൂപം നല്‍കുകയും, നിങ്ങളുടെ രൂപങ്ങള്‍ അവന്‍ നന്നാക്കുകയും ചെയ്തിരിക്കുന്നു. അവങ്കലേക്കാകുന്നു തിരിച്ചുപോക്ക്‌.",
            "verse 64:4": "ആകാശങ്ങളിലുള്ളതും ഭൂമിയിലുള്ളതും അവന്‍ അറിയുന്നു. നിങ്ങള്‍ രഹസ്യമാക്കുന്നതും പരസ്യമാക്കുന്നതും അവന്‍ അറിയുന്നു. അല്ലാഹു ഹൃദയങ്ങളിലുള്ളത് അറിയുന്നവനാകുന്നു.",
            "verse 64:5": "മുമ്പ് അവിശ്വസിച്ചവരുടെ വൃത്താന്തം നിങ്ങള്‍ക്കു വന്നുകിട്ടിയിട്ടില്ലേ? അങ്ങനെ അവരുടെ നിലപാടിന്‍റെ ഭവിഷ്യത്ത് അവര്‍ അനുഭവിച്ചു. അവര്‍ക്കു (പരലോകത്ത്‌) വേദനയേറിയ ശിക്ഷയുമുണ്ട്‌.",
            "verse 64:6": "അതെന്തുകൊണ്ടെന്നാല്‍ അവരിലേക്കുള്ള ദൂതന്‍മാര്‍ വ്യക്തമായ തെളിവുകളും കൊണ്ട് അവരുടെ അടുക്കല്‍ ചെല്ലാറുണ്ടായിരുന്നു. അപ്പോള്‍ അവര്‍ പറഞ്ഞു: ഒരു മനുഷ്യന്‍ നമുക്ക് മാര്‍ഗദര്‍ശനം നല്‍കുകയോ? അങ്ങനെ അവര്‍ അവിശ്വസിക്കുകയും പിന്തിരിഞ്ഞു കളയുകയും ചെയ്തു. അല്ലാഹു സ്വയം പര്യാപ്തനായിരിക്കുന്നു. അല്ലാഹു പരാശ്രയമുക്തനും സ്തുത്യര്‍ഹനുമാകുന്നു.",
            "verse 64:7": "തങ്ങള്‍ ഉയിര്‍ത്തെഴുന്നേല്‍പിക്കപ്പെടുകയില്ലെന്ന് ആ അവിശ്വാസികള്‍ ജല്‍പിച്ചു.(നബിയേ,)പറയുക: അതെ; എന്‍റെ രക്ഷിതാവിനെ തന്നെയാണ, നിങ്ങള്‍ ഉയിര്‍ത്തെഴുന്നേല്‍പിക്കപ്പെടും. പിന്നീട് നിങ്ങള്‍ പ്രവര്‍ത്തിച്ചതിനെപ്പറ്റി നിങ്ങള്‍ക്ക് വിവരമറിയിക്കപ്പെടുകയും ചെയ്യും. അത് അല്ലാഹുവെ സംബന്ധിച്ചിടത്തോളം എളുപ്പമുള്ളതാകുന്നു.",
            "verse 64:8": "അതിനാല്‍ നിങ്ങള്‍ അല്ലാഹുവിലും അവന്‍റെ ദൂതനിലും നാം അവതരിപ്പിച്ച പ്രകാശത്തിലും വിശ്വസിച്ചുകൊള്ളുക. അല്ലാഹു നിങ്ങള്‍ പ്രവര്‍ത്തിക്കുന്നതിനെപ്പറ്റി സൂക്ഷ്മമായി അറിയുന്നവനാണ്‌.",
            "verse 64:9": "ആ സമ്മേളനദിനത്തിന് നിങ്ങളെ അവന്‍ ഒരുമിച്ചുകൂട്ടുന്ന ദിവസം (ശ്രദ്ധേയമാകുന്നു.) അതാണ് നഷ്ടം വെളിപ്പെടുന്ന ദിവസം. ആര്‍ അല്ലാഹുവില്‍ വിശ്വസിക്കുകയും സല്‍കര്‍മ്മം പ്രവര്‍ത്തിക്കുകയും ചെയ്യുന്നുവോ അവന്‍റെ പാപങ്ങള്‍ അല്ലാഹു മായ്ച്ചുകളയുകയും താഴ്ഭാഗത്തു കൂടി അരുവികള്‍ ഒഴുകുന്ന സ്വര്‍ഗത്തോപ്പുകളില്‍ അവനെ പ്രവേശിപ്പിക്കുകയും ചെയ്യുന്നതാണ്‌. അതില്‍ (സ്വര്‍ഗത്തില്‍) അവര്‍ നിത്യവാസികളായിരിക്കും. അതത്രെ മഹത്തായ ഭാഗ്യം.",
            "verse 64:10": "അവിശ്വസിക്കുകയും നമ്മുടെ ദൃഷ്ടാന്തങ്ങള്‍ നിഷേധിച്ചു തള്ളുകയും ചെയ്തവരാകട്ടെ അവരാണ് നരകാവകാശികള്‍. അവരതില്‍ നിത്യവാസികളായിരിക്കും. (അവര്‍) ചെന്നെത്തുന്ന ആ സ്ഥലം വളരെ ചീത്ത തന്നെ.",
            "verse 64:11": "അല്ലാഹുവിന്‍റെ അനുമതി പ്രകാരമല്ലാതെ യാതൊരു വിപത്തും ബാധിച്ചിട്ടില്ല. വല്ലവനും അല്ലാഹുവില്‍ വിശ്വസിക്കുന്ന പക്ഷം അവന്‍റെ ഹൃദയത്തെ അവന്‍ നേര്‍വഴിയിലാക്കുന്നതാണ്‌. അല്ലാഹു ഏതു കാര്യത്തെപ്പറ്റിയും അറിവുള്ളവനാകുന്നു.",
            "verse 64:12": "അല്ലാഹുവെ നിങ്ങള്‍ അനുസരിക്കുക. റസൂലിനെയും നിങ്ങള്‍ അനുസരിക്കുക. ഇനി നിങ്ങള്‍ പിന്തിരിയുന്ന പക്ഷം നമ്മുടെ റസൂലിന്‍റെ ബാധ്യത വ്യക്തമായ പ്രബോധനം മാത്രമാകുന്നു.",
            "verse 64:13": "അല്ലാഹു- അവനല്ലാതെ യാതൊരു ദൈവവുമില്ല. അല്ലാഹുവിന്‍റെ മേലായിരിക്കട്ടെ സത്യവിശ്വാസികള്‍ ഭരമേല്‍പിക്കുന്നത്‌.",
            "verse 64:14": "സത്യവിശ്വാസികളേ, തീര്‍ച്ചയായും നിങ്ങളുടെ ഭാര്യമാരിലും നിങ്ങളുടെ മക്കളിലും നിങ്ങള്‍ക്ക് ശത്രുവുണ്ട്‌. അതിനാല്‍ അവരെ നിങ്ങള്‍ സൂക്ഷിച്ചു കൊള്ളുക. നിങ്ങള്‍ മാപ്പുനല്‍കുകയും, വിട്ടുവീഴ്ച കാണിക്കുകയും പൊറുത്തുകൊടുക്കുകയും ചെയ്യുന്ന പക്ഷം തീര്‍ച്ചയായും അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 64:15": "നിങ്ങളുടെ സ്വത്തുക്കളും നിങ്ങളുടെ സന്താനങ്ങളും ഒരു പരീക്ഷണം മാത്രമാകുന്നു. അല്ലാഹുവിങ്കലാകുന്നു മഹത്തായ പ്രതിഫലമുള്ളത്‌.",
            "verse 64:16": "അതിനാല്‍ നിങ്ങള്‍ക്ക് സാധ്യമായ വിധം അല്ലാഹുവെ നിങ്ങള്‍ സൂക്ഷിക്കുക. നിങ്ങള്‍ കേള്‍ക്കുകയും അനുസരിക്കുകയും നിങ്ങള്‍ക്കു തന്നെ ഗുണകരമായ നിലയില്‍ ചെലവഴിക്കുകയും ചെയ്യുക. ആര്‍ മനസ്സിന്‍റെ പിശുക്കില്‍ നിന്ന് കാത്തുരക്ഷിക്കപ്പെടുന്നുവോ അവര്‍ തന്നെയാകുന്നു വിജയം പ്രാപിച്ചവര്‍.",
            "verse 64:17": "നിങ്ങള്‍ അല്ലാഹുവിന് ഉത്തമമായ കടം കൊടുക്കുന്ന പക്ഷം അവനത് നിങ്ങള്‍ക്ക് ഇരട്ടിയാക്കിത്തരികയും നിങ്ങള്‍ക്ക് പൊറുത്തുതരികയും ചെയ്യുന്നതാണ്‌. അല്ലാഹു ഏറ്റവും അധികം നന്ദിയുള്ളവനും സഹനശീലനുമാകുന്നു.",
            "verse 64:18": "അദൃശ്യവും ദൃശ്യവും അറിയുന്നവനും പ്രതാപിയും യുക്തിമാനുമാകുന്നു അവന്‍."
        },
        "Norwegian": {
            "verse 64:1": "Alt som er i himlene og på jorden, priser Gud! Hans er herredømmet og prisen. Han evner alt!",
            "verse 64:2": "Han er det som skapte dere, og noen er vantro, andre troende. Gud er observant for det dere gjør.",
            "verse 64:3": "Han skapte himlene og jorden på alvor, og Han formet dere, og formet dere vel. Til Ham går ferden.",
            "verse 64:4": "Han vet hva som finnes i himlene og på jord! Han vet hva dere skjuler og hva dere bærer åpent frem. Gud kjenner til det som bor i hjertene.",
            "verse 64:5": "Du har vel hørt om dem som var vantro i forgangne tider, og fikk smake følgene av sin adferd og har en smertelig straff i vente?",
            "verse 64:6": "Dette fordi deres sendebud kom til dem med klar beskjed, og så sa de: «Skal alminnelige mennesker lede oss?» Og de fornektet og vendte seg bort. Men Gud er uavhengig. Gud er selvtilstrekkelig, all pris verdig!",
            "verse 64:7": "De som er vantro, påstår at de aldri skal gjenoppvekkes. Si: «Jo, så sannelig, ved Herren! Dere skal gjenoppvekkes! Og så vil dere bli fortalt hva dere bedrev. Dette er lett for Gud.»",
            "verse 64:8": "Så tro på Gud og Hans sendebud, og lyset som vi har nedsendt! Gud er vel underrettet om hva dere gjør.",
            "verse 64:9": "Den dag Han samler dere til samlingens dag! Dette er desillusjoneringens dag. Den som tror på Gud og lever rettskaffent, hans misgjerninger vil Han stryke ut, og føre ham inn i paradisets haver, hvor bekker sildrer, for der å være og bli for alltid. Dette er den store seier!",
            "verse 64:10": "Men de som er vantro og fornekter Vårt ord, disse er Ildens folk, og der skal de være og bli. En sørgelig skjebne!",
            "verse 64:11": "Ingen hjemsøkelse rammer uten Guds tillatelse. Om noen tror på Gud, så leder Han hans hjerte. Gud kjenner til alle ting.",
            "verse 64:12": "Så adlyd Gud og adlyd Sendebudet. Men om dere vender dere bort, så påligger det Vårt sendebud kun å gi et klart budskap.",
            "verse 64:13": "Gud! Det er ingen gud unntatt Ham! På Gud skal de troende forlate seg!",
            "verse 64:14": "Dere som tror, blant deres hustruer og barn finnes fiender for dere. Så pass på overfor dem. Men om dere unnskylder, viser overbærenhet, og tilgir, så er Gud tilgivende, nåderik.",
            "verse 64:15": "Deres rikdom og deres barn er bare en prøvelse. Men hos Gud finnes stor lønn.",
            "verse 64:16": "Vis gudsfrykt så langt dere kan, og hør og adlyd, og gi gode gaver til deres egen fordel! De som bevares mot sin egen gjerrighet, disse vil det gå godt!",
            "verse 64:17": "Om dere gir Gud et godt lån, vil Han gi dere mangedobbelt igjen og tilgivelse. Gud er full av anerkjennelse, mild,",
            "verse 64:18": "kjenner av det skjulte og det åpenbare, den Mektige, den Vise."
        },
        "Pashto": {
            "verse 64:1": "د الله پاكي بیانوي هر هغه څه چې په اسمانونوكې دي او هر هغه څه چې په ځمكه كې دي، خاص د هغه لپاره بادشاهي ده او خاص د هغه لپاره ټول د كمال صفتونه دي او هغه په هر شي باندې ښه قادر دى",
            "verse 64:2": "هم دغه (الله) هغه ذات دى چې تاسو يې پیدا كړي یئ، نو په تاسو كې ځینې كافر دي او ځینې په تاسو كې مومن دي۔ او الله هغو كارونو لره چې تاسو يې كوئ ښه ليدونكى دى",
            "verse 64:3": "ده اسمانونه او ځمكه په حقه سره پیدا كړي دي او ستاسو صورتونه يې جوړ كړل، پس ستاسو صورتونه يې ډېر ښكلي كړي دي او خاص ده ته بېرته ورتګ دى",
            "verse 64:4": "دى پوهېږي په هر هغه څه چې په اسمانونو اوځمكه كې دي او پوهېږي په هغه څه چې تاسو يې پټوئ او په هغه څه چې تاسويې څرګندوئ۔ او الله د سینو په (پټو) خبرو هم ښه عالم دى",
            "verse 64:5": "ایا تاسو ته د هغو خلقو خبر نه دى راغلى چې له دې نه مخكې كافران شوي وو، نو هغوى د خپل عمل سزا وڅكله او د هغوى لپاره ډېر دردوونكى عذاب دى",
            "verse 64:6": "دا په دې سبب چې بېشكه شان دا دى چې دوى ته به د دوى رسولان له ښكاره معجزو سره راتلل، نو دوى به ویل چې ایا مونږ ته به بشر (انسانان) لاره ښیي، نو دوى كافر شول او مخ يې وګرځاوه او الله استغنا وكړه او الله ډېر بې پروا، ښه ستايل شوى دى",
            "verse 64:7": "كافران شوي كسان (دا غلطه) عقیده ساتي چې دوى به له سره بیا راژوندي نه كړى شي۔، ته (دوى ته) ووایه: ولې نه! زما په خپل رب قسم دى چې تاسو به خامخا ضرور بیا راژوندي كړى شئ، بیا به تاسو ته خامخا ضرور د خپلو كړو عملونو خبر دركولى شي او دا (كارونه) الله ته ډېر اسان دي",
            "verse 64:8": "نو تاسو په الله او د هغه په رسول او په هغې رڼا (قرآن) باندې ایمان راوړئ چې مونږ نازله كړې ده او الله په هغو كارونو چې تاسو يې كوئ؛ ښه خبردار دى",
            "verse 64:9": "(یاده كړه) هغه ورځ چې تاسو به دى (الله) د جمع كېدلو ورځې ته راجمع كړي۔، دغه د تاوان د ښكاره كېدو ورځ ده او هغه څوك چې په الله ایمان راوړي او نېك عمل وكړي (، نو) هغه به له هغه نه د هغه ګناهونه لرې كړي او داسې جنتونو ته به يې داخل كړي چې د هغو له لاندې ولې بهېږي، چې دوى به په هغو كې تل ترتله وي۔، دغه ډېره لویه كامیابي ده",
            "verse 64:10": "او هغه كسان چې كافران شوي دي او زمونږ د ایتونو تكذیب يې كړى دى دغه كسان د اور والا دي، چې په ده كې به همېشه وي او هغه د ورتلو بد ځاى دى۔",
            "verse 64:11": "هېڅ یو مصیبت نه رسېږي مګر د الله په حكم سره او هغه څوك چې په الله ایمان راوړي (، نو) هغه به د ده زړه ته هدایت وكړي او الله په هر شي باندې ښه عالم دى",
            "verse 64:12": "او تاسو د الله اطاعت وكړئ او د رسول اطاعت وكړئ، نو كه تاسو وګرځېدئ، نو یقینًا زمونږ د رسول په ذمه خو يواځې ښكاره پېغام رسونه ده",
            "verse 64:13": "الله (چې دى) نشته هېڅ لايق د عبادت مګر هم دى دى او لازم ده چې مومنان خاص په الله باندې توكل وكړي",
            "verse 64:14": "اى هغو كسانو چې ایمان يې راوړى دى! بېشكه ستاسو په ښځو او اولادونو كې ځينې ستاسو دښمنان دي، نو تاسو له دوى نه محتاط اوسئ او كه چېرې تاسو معافي وكړئ او تېر شئ او بخښنه وكړئ، نو بېشكه چې الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 64:15": "بېشكه هم دا خبره ده چې ستاسو مالونه او ستاسو اولادونه ازموینه (او فتنه) ده او الله (چې دى) له هغه سره ډېر لوى اجر دى",
            "verse 64:16": "نو تاسو له الله نه ووېرېږئ څومره چې تاسو كولى شئ او واورئ او اطاعت وكړئ او انفاق كوئ۔، (دا به) ستاسو د ځانونو لپاره خیر وي۔ او هغه څوك چې د خپل نفس له د بخیلۍ نه وساتل شو، نو هم دغه خلق كامیاب دي",
            "verse 64:17": "كه چېرې تاسو الله ته قرض وركړئ، ښه قرض، (نو) دى به دغه (قرض) تاسو لپاره دوه چنده كړي او تاسو ته به بخښنه وكړي او الله ښه قدردان، ښه تحمل والا دى",
            "verse 64:18": "د غیبو او ښكاره و عالم دى، ښه غالب، ښه حكمت والا دى"
        },
        "Persian": {
            "verse 64:1": "خدا را تسبيح مى‌گويند هر چه در آسمانها و هر چه در زمين است. فرمانروايى از آنِ اوست و حمد سزاوار اوست و او بر هر چيزى تواناست.",
            "verse 64:2": "اوست كه شما را بيافريد. بعضى از شما كافر، و بعضى مؤمنند. و كارهايى را كه مى‌كنيد مى‌بينيد.",
            "verse 64:3": "آسمانها و زمين را به حق بيافريد و شما را تصوير كرد و نيكو تصوير كرد. و سرانجام همه به سوى اوست.",
            "verse 64:4": "هر چه را در آسمانها و زمين است مى‌داند و به آنچه پنهان مى‌داريد يا آشكار مى‌سازيد آگاه است، و خدا به هر چه در دلها مى‌گذرد عالم است.",
            "verse 64:5": "آيا شما را خبر كسانى كه از اين پيش كافر شده بودند نرسيده است؟ عقوبت عملشان را چشيدند و ايشان راست عذابى دردآور.",
            "verse 64:6": "اين به كيفر آن بود كه پيامبرانشان با دليلهاى روشن بر آنان مبعوث شدند. و آنها گفتند: آيا آدميان ما را هدايت مى‌كنند؟ پس انكار كردند و رويگردان گشتند و خدا بى‌نياز است، كه توانگر و در خور ستايش است.",
            "verse 64:7": "كافران پنداشتند كه آنها را زنده نمى‌كنند. بگو: آرى، به پروردگارم سوگند كه شما را زنده مى‌كنند تا به كارهايى كه كرده‌ايد آگاه سازند. و اين بر خدا آسان است.",
            "verse 64:8": "پس به خدا و پيامبرش و اين نور كه نازل كرده‌ايم ايمان بياوريد. و خدا به كارهايى كه مى‌كنيد آگاه است.",
            "verse 64:9": "روزى كه همه شما را در محشر گرد آورد، آن روز روز مغبونى است. و هر كه به خدا ايمان بياورد و كار شايسته كند، گناهانش را مى‌ريزد و به بهشتهايى كه در آن نهرها جارى است داخل كند. آنجا جاودانه خواهند بود. اين كاميابى بزرگى است.",
            "verse 64:10": "و آنان كه كفر ورزيدند و آيات ما را تكذيب كردند اهل آتشند. در آن جاودانه‌اند و جهنم بد سرانجامى است.",
            "verse 64:11": "هيچ مصيبتى جز به فرمان خدا به كسى نمى‌رسد. و هر كه به خدا ايمان بياورد، خدا قلبش را هدايت مى‌كند. و خدا به هر چيزى داناست.",
            "verse 64:12": "خدا را اطاعت كنيد، و پيامبر را اطاعت كنيد. پس اگر شما اعراض كنيد، بر فرستاده ما وظيفه‌اى جز رسانيدن پيام آشكار نيست.",
            "verse 64:13": "خداى يكتاست كه هيچ خدايى جز او نيست. مؤمنان البته بر خداى يكتا توكل كنند.",
            "verse 64:14": "اى كسانى كه ايمان آورده‌ايد، بعضى از زنان و فرزندانتان دشمن شما هستند. از آنها حذر كنيد. و اگر عفو كنيد و چشم بپوشيد و گناهشان پوشيده داريد، خدا آمرزنده و مهربان است.",
            "verse 64:15": "جز اين نيست كه اموال و اولاد شما آزمايشى هستند. و حال آنكه مزد فراوان نزد خداست.",
            "verse 64:16": "تا توانيد از خدا بترسيد و گوش فرا داريد و اطاعت كنيد و به سود خود از مالتان انفاق كنيد. و آنان كه از حرص نفس خويش در امان مانده‌اند رستگارند.",
            "verse 64:17": "اگر به خدا قرض‌الحسنه دهيد برايتان دو برابرش خواهد كرد. و شما را مى‌آمرزد كه او شكرپذيرنده و بردبار است.",
            "verse 64:18": "داناى نهان و آشكار است، پيروزمند و حكيم است."
        },
        "Polish": {
            "verse 64:1": "Wysławia Boga to, co jest w niebiosach, i to, co jest na ziemi. Do Niego należy królestwo i do Niego należy chwała! On nad każdą rzeczą jest wszechwładny!",
            "verse 64:2": "On jest Tym, który was stworzył: a wśród was jeden jest niewierzący, a inny jest wierzący. Bóg widzi dobrze to, co wy czynicie!",
            "verse 64:3": "On stworzył niebiosa i ziemię w całej prawdzie. On was ukształtował i pięknie uformował wasze postacie. I do Niego zmierza wędrowanie.",
            "verse 64:4": "On wie, co jest w niebiosach i na ziemi. On wie, co ukrywacie i co głosicie jawnie. Bóg zna to, co kryją wasze piersi.",
            "verse 64:5": "Czy doszła do was wieść o tych, którzy nie uwierzyli dawniej i zakosztowali szkodliwości swojego postępowania? Dla nich kara będzie bolesna.",
            "verse 64:6": "Albowiem kiedy przyszli do nich ich posłańcy z jasnymi dowodami, oni powiedzieli: \"Czyż ludzie mogą nas prowadzić drogą prostą?\" I nie uwierzyli, i odwrócili się. Bóg ich nie potrzebuje. Bóg jest bogaty, godny chwały!",
            "verse 64:7": "Ci, którzy nie wierzą, twierdzą, że nie będą wskrzeszeni. Powiedz: \"Ależ tak! Na mojego Pana! Z pewnością zostaniecie wskrzeszeni! Następnie zostaniecie powiadomieni, z całą pewnością, o tym, co czyniliście! A to dla Boga jest łatwe.\"",
            "verse 64:8": "Wierzcie w Boga i w Jego Posłańca; i w światło, które zesłaliśmy! Bóg jest w pełni świadomy tego, co czynicie!",
            "verse 64:9": "Ten Dzień, kiedy On was zgromadzi na Dzień Zgromadzenia, będzie Dniem wzajemnego oszukiwania. I temu, kto wierzy w Boga i pełni dobre uczynki - On odpuści jego złe czyny i wprowadzi go do Ogrodów, gdzie w dole płyną strumyki. Tacy pozostaną tam, nieśmiertelni, na zawsze. To jest osiągnięcie ogromne!",
            "verse 64:10": "A ci, którzy nie uwierzyli i za kłamstwo uznali Nasze znaki - będą mieszkańcami ognia. Oni tam będą przebywać na wieki. Jakże złe to miejsce przybycia!",
            "verse 64:11": "Nikogo nie dosięgnie żadne nieszczęście, jak tylko za zezwoleniem Boga. Bóg pokieruje sercem każdego, kto w Niego wierzy. Bóg o każdej rzeczy jest wszechwiedzący!",
            "verse 64:12": "Słuchajcie Boga i słuchajcie Jego Posłańca! A jeśli się odwrócicie - to wiedzcie, że na Naszym Posłańcu ciąży jedynie przekazanie jasnego obwieszczenia.",
            "verse 64:13": "Bóg! Nie ma boga, jak tylko On! Bogu niech zaufają wszyscy wierni!",
            "verse 64:14": "O wy, którzy wierzycie! Zaprawdę, wśród waszych żon i waszych dzieci są wasi wrogowie! Przeto strzeżcie się ich! A jeśli; pobłażając, odpuścicie i wybaczycie - to, zaprawdę, Bóg jest przebaczający, litościwy!",
            "verse 64:15": "Wasze bogactwo i wasze dzieci są tylko pokuszeniem, podczas gdy u Boga jest nagroda ogromna.",
            "verse 64:16": "Przeto bójcie się Boga, jeśli jesteście do tego zdolni! Rozdawajcie dla dobra waszych dusz! A ci, którzy się ustrzegą skąpstwa swojej duszy - będą szczęśliwi.",
            "verse 64:17": "Jeśli dacie Bogu piękną pożyczkę, to On odda ją wam w dwójnasób i wam przebaczy.",
            "verse 64:18": "On zna skryte i jawne. On jest Potężny, Mądry!"
        },
        "Portuguese": {
            "verse 64:1": "Tudo quanto existe nos céus e na terra glorifica Deus; Seu é o reino e Seus são os louvores, porque é Onipotente.",
            "verse 64:2": "Ele foi Quem vos criou; e entre vós há incrédulos, assim como há fiéis, contudo, Deus bem vê tudo quanto fazeis.",
            "verse 64:3": "Em verdade, criou os céus e a terra e vos configurou com a melhor forma, e a Ele retornareis.",
            "verse 64:4": "Ele conhece tudo quanto existe nos céus e na terra, assim como também conhece tudo quanto ocultais e tudo quantomanifestais, porque Deus é Sabedor das intimidades dos corações.",
            "verse 64:5": "Acaso, não vos chegou a notícia dos incrédulos que vos precederam? Sofreram as conseqüências da sua conduta e, ademais, sofrerão um doloroso castigo.",
            "verse 64:6": "Isto porque, quando os seus mensageiros lhes apresentaram as evidências, disseram: Acaso, os humanos hão deencaminhar-nos? E renegaram (a Mensagem), recusando-a; porém, Deus pode prescindir deles, porque Deus é por Si, Opulento, Laudabilíssimo.",
            "verse 64:7": "Os incrédulos crêem que jamais serão ressuscitados. Dize-lhes: Sim, por meu Senhor que, sem dúvida, sereisressuscitados; logo sereis inteirados de tudo quanto tiverdes feito, porque isso é fácil para Deus.",
            "verse 64:8": "Crede, pois, em Deus, em Seu Mensageiro e na Luz que vos temos revelado, porque Deus está bem inteirado de tudoquanto fazeis.",
            "verse 64:9": "Quando fordes congregados para o Dia da Assembléia, este será o dia das defraudações recíprocas. Porém, aquele quecrer em Deus e praticar o bem, será absolvido das suas faltas, e introduzido em jardins, abaixo dos quais correm os rios, onde morará eternamente. Tal é o magnífico benefício!",
            "verse 64:10": "Por outra, aqueles que renegarem e desmentirem os Nossos versículos, serão condenados ao inferno, onde morarãoeternamente. E que funesto destino!",
            "verse 64:11": "Jamais acontecerá calamidade alguma, senão com a ordem de Deus. Mas, a quem crer em Deus, Ele lhe iluminará ocoração, porque Deus é Onisciente.",
            "verse 64:12": "Obedecei, pois, a Deus e obedecei ao Mensageiro! Mas, se recusardes, sabei que ao Nosso Mensageiro somenteincumbe a proclamação lúcida da mensagem.",
            "verse 64:13": "Deus! Não há mais divindade além d'Ele! Que a Deus se encomendem, pois, os crentes!",
            "verse 64:14": "Ó fiéis, em verdade, tendes adversários entre as vossas mulheres e os vossos filhos. Precavei-vos, pois, deles. Porém, se os tolerardes, perdoarde-los e os indultardes, sabei que certamente Deus é Indulgente, Misericordiosíssimo.",
            "verse 64:15": "Em verdade os vossos bens e os vossos filhos são uma mera tentação. Mas sabei que Deus vos reserva uma magníficarecompensa.",
            "verse 64:16": "Temei, pois, a Deus, tanto quanto possais, Escutai-O, obedecei-Lhe e fazei caridade, que isso será preferível para vós! Aqueles que se preservarem da avareza serão os bem-aventurados.",
            "verse 64:17": "Se emprestardes a Deus espontaneamente, Ele vo-lo multiplicará o vos perdoará, porque Deus é Retribuidor, Tolerante,",
            "verse 64:18": "Conhecedor do cognoscível e do incognoscível, o Poderoso, o Prudentíssimo."
        },
        "Punjabi": {
            "verse 64:1": "ਹਰ ਚੀਜ਼ ਜਿਹੜੀ ਆਕਾਸ਼ਾਂ ਅਤੇ ਧਰਤੀ ਵਿਚ ਹੈ, ਅੱਲਾਹ ਦੀ ਹੀ ਸਿਫਤ ਸਲਾਹ ਕਰ ਰਹੀ ਹੈ। ਉਸ ਦੀ ਹੀ ਪਾਤਸ਼ਾਹੀ ਹੈ ਅਤੇ ਉਸ ਦੀ ਹੀ ਪ੍ਰਸੰਸਾ ਹੈ। ਉਹ ਹਰ ਚੀਜ਼ ਦੀ ਸਮਰੱਥਾ ਰੱਖਦਾ ਹੈ।",
            "verse 64:2": "ਉਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਤੁਹਾਨੂੰ ਪੈਦਾ ਕੀਤਾ ਹੈ। ਫਿਰ ਤੁਹਾਡੇ ਵਿਚੋਂ ਹੀ ਕੋਈ ਅਵੱਗਿਆਕਾਰੀ ਹੈ ਅਤੇ ਕੋਈ ਸ਼ਰਧਾਵਾਨ। ਅੱਲਾਹ ਦੇਖ ਰਿਹਾ ਹੈ ਜੋ ਕੁਝ ਤੁਸੀਂ ਕਰਦੇ ਹੋ।",
            "verse 64:3": "ਉਸ ਨੇ ਆਕਾਸ਼ਾਂ ਅਤੇ ਧਰਤੀ ਨੂੰ ਠੀਕ ਢੰਗ ਨਾਲ ਪੈਦਾ ਕੀਤਾ ਅਤੇ ਉਸ ਨੇ ਤੁਹਾਡਾ ਰੂਪ ਬਣਾਇਆ ਤੇ ਰੂਪ ਵੀ ਬੇਹੱਦ ਸੋਹਣਾ ਬਣਾਇਆ। ਅਤੇ ਉਸ ਵੱਲ ਹੀ (ਤੁਸੀਂ) ਵਾਪਿਸ ਮੁੜਨਾ ਹੈ।",
            "verse 64:4": "ਉਹ ਜਾਣਦਾ ਹੈ ਜਿਹੜਾ ਕੁਝ ਧਰਤੀ ਅਤੇ ਅੰਬਰਾਂ ਵਿਚ ਹੈ। ਅਤੇ ਉਹ ਤੁਹਾਡੀਆ ਗੁੱਝੀਆਂ ਅਤੇ ਪ੍ਰਗਟ ਨੂੰ ਵੀ ਜਾਣਦਾ ਹੈ। ਅੱਲਾਹ ਦਿਲਾਂ ਤੱਕ ਦੀਆਂ ਗੱਲਾਂ ਜਾਣਨਵਾਲਾ (ਅੰਤਰਜਾਮੀ) ਹੈ।",
            "verse 64:5": "ਕੀ ਤੁਹਾਨੂੰ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਦੀ ਖ਼ਬਰ ਨਹੀਂ’ ਪੁੱਜੀ, ਜਿਨ੍ਹਾਂ ਨੇ ਇਸ ਤੋਂ ਪਹਿਲਾਂ ਅਵੱਗਿਆ ਕੀਤੀ ਸੀ। ਫਿਰ ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਕੀਤੇ ਦਾ ਸਵਾਦ ਚੱਖਿਆ। ਉਨ੍ਹਾਂ ਲਈ ਦਰਦਨਾਕ ਸਜ਼ਾ ਹੈ।",
            "verse 64:6": "ਇਹ ਇਸ ਲਈ ਕਿ ਉਨ੍ਹਾਂ ਦੇ ਕੌਲ ਉਨ੍ਹਾਂ ਦੇ ਰਸੂਲ ਸਪੱਸ਼ਟ ਪ੍ਰਮਾਣਾ ਦੇ ਨਾਲ ਆਏ। ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਕੀ ਸਾਡੀ ਅਗਵਾਈ ਮਨੁੱਖ ਕਰਨਗੇ?ਸੋ ਉਨ੍ਹਾਂ ਨੇ (ਮੰਨਣ ਤੋਂ) ਇਨਕਾਰ ਕਰ ਦਿੱਤਾ ਅਤੇ ਮੂੰਹ ਮੋੜ ਲਿਆ। ਅਤੇ ਅੱਲਾਹ ਉਨ੍ਹਾਂ ਤੋਂ ਬੇਪ੍ਰਵਾਹ ਹੋ ਗਿਆ। ਅੱਲਾਹ ਬੇਪ੍ਰਵਾਹ ਹੈ ਅਤੇ ਪ੍ਰਸੰਸਾ ਵਾਲਾ ਹੈ।",
            "verse 64:7": "ਅਵੱਗਿਆ ਕਰਨ ਵਾਲਿਆਂ ਨੇ ਦਾਅਵਾ ਕੀਤਾ ਕਿ ਉਹ ਕਦੇ ਵੀ ਮੂੜ ਨਹੀਂ ਉਠਾਏ ਜਾਣਗੇ। ਆਖੋ, ਕਿ ਹਾਂ, ਮੇਰੇ ਪਾਲਣਹਾਰ ਦੀ ਸੌਹ, ਤੁਸੀਂ ਜ਼ਰੂਰ ਉਠਾਏ ਜਾਵੇਂਗੇ। ਫਿਰ ਤੁਹਾਨੂੰ ਦੱਸਿਆ ਜਾਵੇਗਾ ਜਿਹੜਾ ਕੁਝ ਤੁਸੀਂ ਕੀਤਾ। ਅਤੇ ਇਹ ਅੱਲਾਹ ਲਈ ਬਹੁਤ ਸੌਖਾ ਹੈ।",
            "verse 64:8": "ਸੋ ਅੱਲਾਹ, ਉਸ ਦੇ ਰਸੂਲ ਅਤੇ ਉਸ ਦੇ ਨੂਰ ਉੱਤੇ ਈਮਾਨ ਲਿਆਉ। ਜਿਹੜਾ ਉਸ ਨੇ ਉਤਾਰਿਆ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਜਾਣਦਾ ਹੈ ਜਿਹੜਾ ਕੁਝ ਤੁਸੀਂ ਕਰਦੇ ਹੋ।",
            "verse 64:9": "ਜਿਸ ਦਿਨ ਉਹ ਤੁਹਾਨੂੰ ਸਾਰਿਆਂ ਨੂੰ ਕਿਆਮਤ ਦੇ ਦਿਨ ਇੱਕਠਾ ਕਰੇਗਾ, ਇਹ ਹੀ ਦਿਨ ਜਿੱਤ-ਹਾਰ ਦਾ ਹੋਵੇਗਾ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੇ ਈਮਾਨ ਲਿਆਇਆ ਹੋਵੇਗਾ ਅਤੇ ਉਸ ਨੇ ਚੰਗੇ ਕਰਮ ਕੀਤੇ ਹੋਣਗੇ। ਅੱਲਾਹ ਉਸ ਦੇ ਪਾਪ ਉਸ ਤੋਂ ਦੂਰ ਕਰ ਦੇਵੇਗਾ। ਅਤੇ ਉਸ ਨੂੰ ਅਜਿਹੇ ਬਾਗ਼ਾਂ ਵਿਚ ਦਾਖ਼ਿਲ ਕਰੇਗਾ, ਜਿਨ੍ਹਾਂ ਦੇ ਥੱਲੇ ਨਹਿਰਾਂ ਵਗਦੀਆਂ ਹੋਣਗੀਆਂ ਅਤੇ ਉਹ ਉਸ ਵਿਚ ਹਮੇਸ਼ਾ ਰਹਿਣਗੇ। ਇਹ ਹੈ ਵੱਡੀ ਸਫ਼ਲਤਾ।",
            "verse 64:10": "ਅਤੇ ਜਿਨ੍ਹਾ ਲੋਕਾਂ ਨੇ ਅਵੱਗਿਆ ਕੀਤੀ ਅਤੇ ਸਾਡੀਆਂ ਆਇਤਾਂ ਨੂੰ ਝੁਠਲਾਇਆ, ਉਹ ਲੋਕ ਅੱਗ (ਵਿਚ ਸੜਨ) ਵਾਲੇ ਹਨ। ਉਸ ਵਿਚ ਉਹ ਹਮੇਸ਼ਾ ਰਹਿਣਗੇ। ਇਹ ਬੁਰਾ ਟਿਕਾਣਾ ਹੈ।",
            "verse 64:11": "ਜਿਹੜੀ ਵੀ ਬਿਪਤਾ ਆਉਂਦੀ ਹੈ, (ਉਹ) ਅੱਲਾਹ ਦੇ ਹੁਕਮ ਨਾਲ ਹੀ ਆਉਂਦੀ ਹੈ। ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੇ ਈਮਾਨ ਰੱਖਦਾ ਹੈ, ਅੱਲਾਹ ਉਸ ਦੇ ਦਿਲ ਨੂੰ ਰਾਹ ਦਿਖਾਉਂਦਾ ਹੈ। ਅੱਲਾਹ ਹਰ ਚੀਜ਼ ਨੂੰ ਜਾਣਨ ਵਾਲਾ ਹੈ।",
            "verse 64:12": "ਅਤੇ ਤੁਸੀਂ ਅੱਲਾਹ ਅਤੇ ਰਸੂਲ ਦਾ ਹੁਕਮ ਮੰਨੋ। ਫਿਰ ਜੇਕਰ ਤੁਸੀਂ ਮੂੰਹ ਮੌੜੌਗੇ ਤਾਂ ਸਾਡੇ ਰਸੂਲ ਦੇ (ਜ਼ਿੰਮੇ) ਸਿਰਫ਼ (ਸੁਨੇਹਾ) ਪਹੁੰਚਾ ਦੇਣਾ ਹੈ।",
            "verse 64:13": "ਅੱਲਾਹ (ਜੋ ਬੰਦਗੀ ਦੇ ਯੋਗ ਹੈ) ਉਸ ਤੋਂ ਬਿਨਾ ਕੋਈ ਪੂਜਣਯੋਗ ਨਹੀਂ ਅਤੇ ਈਮਾਨ ਵਾਲਿਆਂ ਨੂੰ ਅੱਲਾਹ ਤੇ ਹੀ ਭਰੋਸਾ ਰੱਖਣਾ ਚਾਹੀਦਾ ਹੈ।",
            "verse 64:14": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਹਾਡੀਆਂ ਪਤਨੀਆਂ ਤੇ ਤੁਹਾਡੀਆਂ ਔਲਾਦਾਂ ਵਿਚੋਂ ਕੁਝ ਤੁਹਾਡੇ ਵੈਰੀ ਹਨ। ਸੋ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਤੋਂ ਸਾਵਧਾਨ ਰਹੋ। ਅਤੇ ਜੇਕਰ ਤੁਸੀਂ ਮੁਆਫ਼ ਕਰ ਦੇਵੋ ਅਤੇ ਦਰ ਗੁਜ਼ਰ ਕਰ ਦਿਓ, ਤਾਂ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਅਤੇ ਰਹਿਮ ਕਰਨ ਵਾਲਾ ਹੈ।",
            "verse 64:15": "ਤੁਹਾਡੀ ਜਇਦਾਦ ਅਤੇ ਤੁਹਾਡੀ ਔਲਾਦ ਇਮਾਤਿਹਾਨ ਦੀ ਵਸਤੂ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਦੇ ਕੋਲ ਬਹੁਤ ਵੱਡਾ ਬਦਲਾ ਹੈ।",
            "verse 64:16": "ਸੋ ਤੁਸੀਂ ਜਿਥੋਂ ਤੱਕ ਹੋ ਸਕੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋਂ। ਸੁਣੋਂ, ਮੰਨੋ ਅਤੇ ਖਰਚ ਕਰੋ। ਇਹ ਤੁਹਾਡੇ ਲਈ ਬਿਹਤਰ ਹੈ ਅਤੇ ਜਿਹੜਾ ਸੰਦਾ ਦਿਲ ਦੀ ਤੰਗੀ (ਕੰਜੂਸੀ? ਤੋਂ ਬਚਿਆ ਰਿਹਾ, ਤਾਂ ਅਜਿਹੇ ਲੋਕ ਸਫ਼ਲਤਾ ਪਾਉਣ ਵਾਲੇ ਹਨ।)",
            "verse 64:17": "ਜੇਕਰ ਤੁਸੀਂ ਅੱਲਾਹ ਨੂੰ ਚੰਗਾ ਕਰਜ਼ਾ (ਨਿਸ਼ਕਾਮ ਸੇਵਾ) ਦੇਵੋਗੇ ਤਾਂ ਉਹ ਉਸ ਨੂੰ ਤੁਹਾਡੇ ਲਈ ਕਈ ਗੁਣਾ ਵਧਾ ਦੇਵੇਗਾ। ਅਤੇ ਤੁਹਾਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇਵੇਗਾ। ਅੱਲਾਹ ਕਦਰਦਾਨ ਅਤੇ ਸਹਿਣਸ਼ੀਲ ਹੈ।",
            "verse 64:18": "ਪ੍ਰਗਟ ਅਤੇ ਗੁੱਝੀਆਂ ਨੂੰ ਜਾਣਨ ਵਾਲਾ ਹੈ। ਤਾਕਤਵਰ ਅਤੇ ਹਿਕਮਤ ਹੈ।"
        },
        "Roman english": {
            "verse 64:1": "Yusabbihu lillaahi maa fis samaawaati wa maa fil ardi lahul mulku wa lahul hamd, wa Huwa `alaa kulli shai `in Qadeer",
            "verse 64:2": "Huwal lazee khalaqakum faminkum kaafirunw wa min kum mu`min ; wallaahu bimaa ta`maloona Baseer",
            "verse 64:3": "Khalaqas samaawaati wal arda bilhaqqi wa sawwarakum fa ahsana suwarakum wa ilaihil maseer",
            "verse 64:4": "Ya`lamu maa fis samaawaati wal ardi wa ya`lamu maa tusirroona wa maa tu`linoon; wallaahu `Aleemum bizaatis sudoor",
            "verse 64:5": "Alam yaatikum naba`ul lazeena kafaroo min qablu fazaaqoo wabaala amrihim wa lahum `azaabun aleem",
            "verse 64:6": "Zaalika bi annahoo kaanat taateehim Rusuluhum bilbaiyinaati faqaaloo a basharuny yahdoonanaa fakafaroo wa tawallaw; wastaghnal laah; wallaahu ghaniyyun hameed",
            "verse 64:7": "Za`amal lazeena kafarooo al-lany yub`asoo; qul balaa wa rabbee latub`asunna summa latunabba`unna bimaa `amiltum; wa zaalika `alal laahi yaseer",
            "verse 64:8": "Fa-aaminoo billaahi wa rasoolihee wannooril lazeee anzalnaa; wallaahu bima ta`maloona khabeer",
            "verse 64:9": "Ywma yajma`ukum li yawmil jam`i zaalika yawmut taghaabun; wa many-yumim billaahi wa ya`mal saalihany yukaffir `anhu sayyi aatihee wa yudkhilhu jannaatin tajree min tahtihal anhaaru khaalideena feehaaa abadaa; zaalikal fawzul `azeem",
            "verse 64:10": "Wallazeena kafaroo wa kazzaboo bi aayaaatinaaa ulaaa`ika ashaabun naari khaalideena feehaa bi`sal maseer",
            "verse 64:11": "Maaa asaaba mim musee batin illaa bi-iznil laah; wa many yu`mim billaahi yahdi qalbah; wallaahu bikulli shai;in Aleem",
            "verse 64:12": "Wa atee`ul laaha wa atee`ur Rasool; fa in tawallaitum fa innamaa `alaa Rasoolinal balaaghul mubeen",
            "verse 64:13": "Allaahu laaa ilaaha illaa Hoo; wa `alal laahi falyata wakkalil mu`minoon",
            "verse 64:14": "Yaaa ayyuhal lazeena aamanooo inna min azwaaji kum wa awlaadikum `aduwwal lakum fahzaroohum; wa in ta`foo wa tasfahoo wa taghfiroo fa innal laaha ghafoorur Raheem",
            "verse 64:15": "Innamaa amwaalukum wa awlaadukum fitnah; wallaahu `indahooo ajrun `azeem",
            "verse 64:16": "Fattaqul laaha mastat`tum wasma`oo wa atee`oo waanfiqoo khairal li anfusikum; wa many-yooqa shuha nafsihee fa-ulaaa`ika humul muflihoon",
            "verse 64:17": "In tuqridul laaha qardan hasanany yudd`ifhu lakum wa yaghfir lakum; wallaahu Shakoorun Haleem",
            "verse 64:18": "Aalimul-Ghaibi wash-shahaadatil `Azeezul Hakeem"
        },
        "Russian": {
            "verse 64:1": "Все в небесах и на земле Аллаху воздает хвалу и славу! Ему принадлежит господство (над мирами), Ему - хвала, и мощь Его - над всем!",
            "verse 64:2": "Он - Тот, Кто создал вас. Средь вас есть те, которые не веруют (в Него), Но есть и верные (Аллаху); Ведь видит Он все то, что делаете вы.",
            "verse 64:3": "Он небеса и землю в должном виде сотворил, Дал форму вам и виды ей прекрасные построил, К Нему лежит и ваше возвращенье.",
            "verse 64:4": "Он знает все, что в небесах и на земле, И знает, что у вас сокрыто или явно. Поистине, Ему известно все, Что вы в сердцах своих храните.",
            "verse 64:5": "Неужто не пришел к вам сказ о тех, Которые отвергли веру в прошлом? Они вкусили зло своих деяний (на земле), Теперь их ждет жестокая расплата (и на небе).",
            "verse 64:6": "Все потому, что с ясными знаменьями (от Нас) Посланники к ним Наши приходили, Но молвили они: \"Ужель на верный путь Нас будут направлять простые люди, (как и мы)?\" И потому, в неверие облекшись, отвернулись. В них же Аллаху не было нужды. Свободен Он от всяких нужд и преисполнен славы.",
            "verse 64:7": "И утверждают те, кто не уверовал (в Аллаха), Что никогда воскрешены они не будут. Скажи: \"Да, я клянусь моим Владыкой, Вы будете воскрешены!\" Потом вам сообщат о всех деяньях ваших, И это не составит Господу труда.",
            "verse 64:8": "А потому уверуйте в Аллаха и посланника Его И в Свет, что Мы вам ниспослали, - Аллах ведь сведущ в том, что делаете вы.",
            "verse 64:9": "В тот День, Когда Он соберет вас всех Для Дня Великого Собранья, - То будет День взаимных поражений и наград, И с тех, которые уверовали (в Бога) и добрые дела творили, Он снимет все грехи И их введет в Сады, реками омовенны, И вечно пребывать им там, - Такою будет высшая награда.",
            "verse 64:10": "Но тем, кто не уверовал (в Аллаха) И ложью объявил знамения Его, Быть обитателями О'гня И в нем, поистине, навечно пребывать. И будет мерзким это место упокоя.",
            "verse 64:11": "И ни одна беда (вас) не постигнет Иначе, как с соизволения Аллаха; И сердце каждого, кто верует в Него, Направит Он на верный путь, - Аллах о всякой вещи знающ!",
            "verse 64:12": "Так повинуйтесь же Аллаху и слушайте посланника Его! А если отвернетесь - что ж! Ведь на него возложено лишь ясно и открыто (Посланье Наше) передать.",
            "verse 64:13": "Аллах! Нет божества, кроме Него, И лишь Ему все верные должны вверяться.",
            "verse 64:14": "О вы, кто верует! Поистине, средь ваших жен и средь детей Вы недругов найдете. Вы будьте с ними осторожны, Но если вы их извините, Не замечая (их уловки), Простите им (проступки их), - Так ведь Аллах, поистине, прощающ, милосерд!",
            "verse 64:15": "Все ваше достояние и дети - Лишь испытание для вас. А у Аллаха - величайшая награда.",
            "verse 64:16": "А потому страшитесь Его гнева, Послушны будьте и расходуйте на подать. И кто себя от скупости души освободит, - Тому (сопутствовать) удача будет и успех.",
            "verse 64:17": "И если вы дадите щедрый займ Аллаху, Воздаст Он вам вдвойне и ниспошлет прощенье, - Аллах ведь безгранично благодарен, Воздержан (в наказании Своем), -",
            "verse 64:18": "Тот, Кто знает, что сокрыто и что явно, И преисполнен мудрости и мощи!"
        },
        "Sindhi": {
            "verse 64:1": "جيڪي آسمانن ۾ آھي ۽ جيڪي زمين ۾ آھي سو (سڀ) الله جي پاڪائي بيان ڪندو آھي، سندس ئي بادشاھي آھي ۽ سنديس ئي ساراھ آھي، ۽ اُھو سڀڪنھن شيءِ تي وس وارو آھي.",
            "verse 64:2": "(الله) اھو آھي جنھن اوھان کي پيدا ڪيو پوءِ اوھان مان ڪو ڪافر ۽ اوھان مان ڪو مؤمن آھي، ۽ جيڪي ڪندا آھيو سو الله ڏسندڙ آھي.",
            "verse 64:3": "آسمانن ۽ زمين کي پوريءَ رِٿ سان بڻايائين ۽ اوھانکي صُورت ڏنائين پوءِ اوھان جون صُورتون تمام چڱيون بڻايائين ۽ ڏانھس موٽڻ آھي.",
            "verse 64:4": "جيڪي آسمانن ۽ زمين ۾ آھي سو (اُھو) ڄاڻندو آھي ۽ جيڪي لڪائيندا آھيو ۽ جيڪي پڌرو ڪندا آھيو سو (به) ڄاڻندو آھي، ۽ الله سينن جو ڳجھ ڄاڻندڙ آھي.",
            "verse 64:5": "(ھن کان) اڳ جيڪي ڪافر ھئا تن جي اوھان وٽ خبر نه آئي آھي ڇا؟ پوءِ پنھنجي ڪئي جي سزا چکيائون ۽ اُنھن لاءِ ڏکوئيندڙ عذاب آھي.",
            "verse 64:6": "اِھو (عذاب) ھِن ڪري آھي جو سندن پيغمبر (چِٽن) مُعجزن سان وٽن ايندا ھئا ته چوندا ھوا ته اسان کي (اسان جھڙا) ماڻھو (سڌو) رستو ڏيکاريندا ڇا، پوءِ انڪار ڪيائون ۽ منھن ڦيرايائون ۽ الله (به) بي پرواھي ڪئي، ۽ الله بي پرواھ ساراھيل آھي.",
            "verse 64:7": "ڪافر ڀائيندا آھن ته (قبرن مان) کين ڪڏھن نه اُٿاربو، (کين) چؤ ته ھائو! منھنجي پالڻھار جو قسم ته (اوھين) ضرور اُٿاربؤ وري جيڪي ڪندا ھئو تنھن جي اوھان کي ضرور سُڌ ڏبي، ۽ اھو (ڪم) الله کي آسان آھي.",
            "verse 64:8": "تنھنڪري الله ۽ سندس پيغمبر تي ايمان آڻيو ۽ اُنھيءَ نُور (قرآن) تي به جيڪو نازل ڪيوسون، ۽ جيڪي ڪندا آھيو تنھن جي الله خبر رکندڙ آھي.",
            "verse 64:9": "جنھن مھل اوھان کي قيامت جي ڏينھن ۾ گڏ ڪندو اُھو ڏينھن ھارجڻ ۽ کٽجڻ جو آھي، ۽ جيڪو الله تي ايمان آڻيندو ۽ چڱا ڪم ڪندو تنھن کان سندس مدايون الله ميٽيندو ۽ اھڙن باغن ۾ داخل ڪندو جن جي ھيٺان واھيون وھنديون آھن اُتي سدائين رھندا، اُھا وڏي مراد ماڻڻ آھي.",
            "verse 64:10": "۽ جن ڪُفر ڪيو ۽ اسان جي آيتن کي ڪوڙو ڄاتو اھي دوزخي آھن اُن ۾ سدائين رھندا، ۽ (اُھو) ھنڌ بڇڙو آھي.",
            "verse 64:11": "الله جي حُڪم کانسواءِ ڪابه مصيبت نه پھچندي آھي، ۽ جيڪو الله تي ايمان آڻيندو تنھن جي دل کي (اُھو) ھدايت ڪندو، ۽ الله ھر شيءَ کي ڄاڻندڙ آھي.",
            "verse 64:12": "۽ الله جو چيو مڃيو ۽ پيغمبر جو چيو مڃيو، پوءِ جيڪڏھن مُنھن موڙيندؤ ته اسان جي پيغمبر تي رڳو پڌرو پيغام پھچائڻ آھي.",
            "verse 64:13": "الله (اُھو آھي جو) اُن کانسواءِ (ٻيو) ڪو عبادت جو لائق نه آھي، ۽ مؤمنن کي جڳائي ته الله تي (ئي) ڀروسو ڪن.",
            "verse 64:14": "اي ايمان وارؤ بيشڪ ڪي اوھان جون زالون ۽ ڪي اوھان جو اولاد اوھان جو دشمن آھي تنھنڪري انھن کان حذر ڪريو، ۽ جيڪڏھن معافي ڪريو ۽ ٽارو ڪريو ۽ بخشيو ته بيشڪ الله (به) بخشڻھار مھربان آھي.",
            "verse 64:15": "اوھان جا مال ۽ اوھان جو اولاد رڳو پرک آھن، ۽ الله ئي وٽ وڏو اجر آھي.",
            "verse 64:16": "تنھنڪري جيترو ٿي سگھيوَ اوترو الله کان ڊڄو ۽ (الله جو حُڪم) ٻڌو ۽ چيو مڃيو ۽ خرچ ڪريو ته اوھان جي جِندن لاءِ چڱو آھي، ۽ جيڪي پنھنجي نفس جي حرص کان بچايا ويا سي ئي ڇُٽڻ وارا آھن.",
            "verse 64:17": "جيڪڏھن الله کي چڱيءَ طرح قرض ڏيندؤ ته (الله) اوھان کي اُھو (قرض) ٻيڻون (ورائي ڏيندو) ۽ اوھان کي بخشيندو، ۽ الله قدردان بردبار آھي.",
            "verse 64:18": "ڳجھ ۽ ظاھر جو ڄاڻندڙ غالب حڪمت وارو آھي."
        },
        "Sinhalese": {
            "verse 64:1": "අහස්හි ඇති දෑ හා මහපොළොවෙහි ඇති දෑ අල්ලාහ්ට සුවිශුද්ධ කරයි. සියලු ආධිපත්‍යය ඔහු සතුය. තවද සියලු ප්‍රශංසා ඔහු සතුය. තවද ඔහු සියලු දෑ කෙරෙහි ශක්තිවන්තය.",
            "verse 64:2": "ඔහු වනාහි නුඹලා මැව්වේය. තවද නුඹලා අතරින් දේවත්වය ප්‍රතික්ෂේප කරන අය ද නුඹලා අතරින් දේවත්වය විශ්වාස කරන අය ද සිටිති. තවද අල්ලාහ් නුඹලා සිදු කරන දෑ පිළිබඳ සර්ව නිරීක්ෂකය.",
            "verse 64:3": "ඔහු අහස් හා මහපොළොව සත්‍යයෙන් යුතු ව මැව්වේය. තවද ඔහු නුඹලා හැඩගන්වා නුඹලාගේ හැඩරුව ඔහු අලංකාර කළේය. තවද නැවත යොමු වීමේ ස්ථානය ඔහු වෙතය.",
            "verse 64:4": "අහස් හි හා මහපොළොවෙහි ඇති දෑ ඔහු දනී. තවද නුඹලා සඟවන දෑ ද නුඹලා හෙළි කරන දෑ ද ඔහු දනී. තවද අල්ලාහ් හදවත් සතු දෑ පිළිබඳ ව සර්වඥානීය.",
            "verse 64:5": "මීට පෙර ප්‍රතික්ෂේප කළවුන්ගේ පුවත නුඹලා වෙත නොපැමිණියේ ද? එවිට ඔවුන්ගේ විෂයයෙහි විපාකය ඔවුහු භුක්ති වින්දෝය. තවද ඔවුනට වේදනීය දඬුවමක් ද ඇත.",
            "verse 64:6": "එය ඔවුන්ගේ දූතවරුන් පැහැදිලි සාධක සමග ඔවුන් වෙත පැමිණි විට “අපට මග පෙන්වනුයේ මිනිසෙකු දැ”යි පවසා ප්‍රතික්ෂේප කොට පිටුපා ගිය බැවිණි. තවද අල්ලාහ් නොසලකා හැරියේය. තවද අල්ලාහ් අවශ්යතාවන්ගෙන් තොරය; ප්‍රසංශාලාභීය.",
            "verse 64:7": "තමන් (මළවුන් කෙරෙන්) අවදි කරනු නොලබන්නෝම යැයි ප්‍රතික්ෂේප කළවුන් තරයේම සිතුවෝය. “එසේ නොව මාගේ පරමාධිපති මත දිවුරමින් නියත වශයෙන්ම නුඹලා අවදි කරනු ලබනු ඇත. පසු ව නුඹලා සිදු කළ දෑ පිළිබඳ ව නුඹලාට දන්වනු ලබනු ඇත” යැයි (නබිවරය!) නුඹ පවසනු. තවද එය අල්ලාහ් වෙත පහසුය.",
            "verse 64:8": "එහෙයින් නුඹලා අල්ලාහ් හා ඔහුගේ දූතයාණන් පිළිබඳ ව ද අපි පහළ කළ ආලෝකය පිළිබඳ ව ද විශ්වාස කරනු. තවද අල්ලාහ් නුඹලා සිදු කරන දෑ පිළිබඳ ව අභිඥානවන්තය.",
            "verse 64:9": "එදින ඔහු එක් රැස් කරන දිනය සඳහා නුඹලා ව එක් රැස් කරනු ඇත. එය පාඩු ලබන දිනයයි. තවද කවරෙකු අල්ලාහ් ව විශ්වාස කර යහකම් කරන්නේ ද ඔහුගේ පාපයන් ඔහුගෙන් ඔහු ඉවත් කරයි. තවද ඒවාට පහළින් ගංගාවෝ ගලා බස්නා (ස්වර්ග) උයන් වලට ඔහු ඔහු ව ඇතුළත් කරයි. එහි ඔවුන් නිරන්තරයෙන්ම සාදතනිකයින් වෙති. එය අතිමහත් වූ ජයග්‍රහණයයි.",
            "verse 64:10": "තවද අපගේ වදන් බොරු කොට ප්‍රතික්ෂේප කළවුන් වනාහි ඔවුහු (නිරා) ගින්නේ වාසීහුය. එහි ඔවුන් සදාතනිකයින්ය. නැවත යොමු වන ස්ථානය නපුරු විය.",
            "verse 64:11": "අල්ලාහ්ගේ අනුමැතියෙන් තොර ව කිසිදු ආපදාවක් සිදු නොවේ. තවද කවරෙකු අල්ලාහ් ව විශ්වාස කරන්නේ ද ඔහුගේ හදවතට ඔහු(අල්ලාහ්) මග පෙන්වයි. තවද අල්ලාහ් සියලු දෑ පිළිබඳ ව සර්වඥය.",
            "verse 64:12": "තවද නුඹලා අල්ලාහ්ට අවනත වනු. එමෙන්ම රසූල්වරයාට ද අවනත වනු. නමුත් නුඹලා පිටුපෑවෙහු නම් එවිට (දැන ගනු!) නියත වශයෙන්ම අපගේ ධර්ම දූතයාණන් වෙත පැවරෙනුයේ පැහැදිලි ව ප්‍රචාරය කිරීම පමණය.",
            "verse 64:13": "අල්ලාහ් වනාහි ඔහු හැර වෙනත් දෙවිඳෙකු නැත. තවද විශ්වාසවන්තයෝ අල්ලාහ් වෙතම (සියල්ල) භාර කරත්වා.",
            "verse 64:14": "අහෝ දේවත්වය විශ්වාස කළවුනි! නියත වශයෙන්ම නුඹලාගේ බිරියන්ගෙන් ද නුඹලාගේ දරුවන්ගෙන් ද නුඹලාට සතුරන් වෙති. එහෙයින් නුඹලා ඔවුන්ගෙන් ප්‍රවේශම් වනු. තවද නුඹලා නොසලකා හැර ගණන් නොගෙන සමාව දුන්නෙහු නම් එවිට නියත වශයෙන්ම අල්ලාහ් අති ක්ෂමාශීලීය; මහා කරුණාන්විතය.",
            "verse 64:15": "නියත වශයෙන්ම නුඹලාගේ ධනය ද නුඹලාගේ දරුවන් ද පරීක්ෂණයකි. තවද අල්ලාහ් වන ඔහු අබියස මහත් වූ කුලියක් ඇත.",
            "verse 64:16": "එහෙයින් නුඹලාට හැකි පමණින් අල්ලාහ්ට බිය බැතිමත් වනු. තවද නුඹලා සවන් දෙනු. තවද නුඹලා අවනත වනු. තවද නුඹලා වියදම් කරනු. එය නුඹලාට යහපතකි. තවද කවරෙකු තම මසුරුකමින් ආරක්ෂා කරනු ලබන්නේ ද එවිට ඔවුහුමය ජයග්රාහකයෝ.",
            "verse 64:17": "නුඹලා අල්ලාහ්ට අලංකාර ණයක් දුන්නෙහු නම් ඔහු එය නුඹලාට ගුණ කර දෙයි. තවද නුඹලාට සමාව දෙයි. තවද අල්ලාහ් ගුණ ගරුකය; ඉවසිලිවන්තය.",
            "verse 64:18": "(ඔහු) අදෘශ්‍යමාන දෑ හා දෘශ්‍යමාන දෑ පිළිබඳ ව සර්ව ඥානීය. සර්ව බලධාරීය. මහා ප්‍රඥාවන්තය."
        },
        "Somali": {
            "verse 64:1": "Waxaa Eebe nasaha (weyneeya) waxa Samaawaatka (Cirka) iyo Dhulka ku sugan awood iyo mahadbana Eebaa iska leh, wax walbana isagaa kara.",
            "verse 64:2": "Eebe waa kan idin anbuuray qaarkiinna gaaluu noqday, qaarkiinna Mu'miniin, Eebana waxaad Camal falaysan waa arkaa.",
            "verse 64:3": "Samaawaatka (Cirka) iyo Dhulkaba wuxuu Eebe u abuuray si xaq ah, wuuna idin sawiray Eebe, dadoow suuraddiinana wuu wanaagjiyey, isagaana loo noqon (Ahkhiro).",
            "verse 64:4": "Wuxuu ogyahay waxa samaawaatka (Cirka) iyo Dhulka ku sugan, wuxuuna ogyahay waxaad qarinaysaan iyo waxaad muujinaysaan, Eebana waa ogyahay waxa laabta (Qalbiga) ku jira.",
            "verse 64:5": "Miyuuna idin soo gaarin warkii kuwii gaaloobay ee horreeyey, waxay dhadhamiyeen xumaantii camalkoodii, waxaana u sugnaaday caddibaad daran.",
            "verse 64:6": "Arrintaas waxaa ugu wacan in Rasuullo ula yimaadeen xujooyin ayna dheheen (Gaaladii) ma dadbaa na hanuunin ayna gaaloobeen oo jeedsadeen, iskana deeqtoonaysiiyeen (weynaysiiyeen) Eebe, Eebana waa midka hodanka ah lana mahadiyo.",
            "verse 64:7": "Waxay sheegeen kuwii gaaloobay inaan la soo bixinaynin, waxaad dhahdaa saas ma aha, Eebaa wuxuu ku dhaartay in la idin soo bixin laydinkana warrami waxaad camal fasheen, taasina waa u fududahay Eebe.",
            "verse 64:8": "Ee rumeeya Eebe iyo Rasuulkiisa iyo nuurka Eebe soo dejiyey (Quraanka) Eebana waxaad camal falaysaan waa ogyahay.",
            "verse 64:9": "Maalinta qiyaamada ee Ilaahay idin soo kulmin waa maalin kado, ruuxiise Ilaah rumeeya camal wanaagsanna fala Eebe xumaantiisa (dambigiisa) wuu asturi, wuxuuna galin Janooyin ay dhex dureeraan Wabiyaal way kuna waaraan waligood, taasina waa liibaan weyn.",
            "verse 64:10": "kuwa gaaloobayse beeniyeyna Aayaadka Eebe waa kuwa Ahlu Naar ah waxayna ku waari dhexdeeda, meel loo ahaadana iyadaa u xun.",
            "verse 64:11": "Wixii Musiiba ah (dhib ah) oo dhaca waa idinka Eebe, ruuxiise Eebe rumeeya waxaa hanuuni (oo xasili) qalbigiisa, Eebana wax walba waa ogyahay.",
            "verse 64:12": "Eebe adeeca Rasuulkiisana adeeca, haddaadse jeedsataan (xaqa diidaan) waxaa Rasuulka saaran uun inuu si cad wax u gaargiiyo.",
            "verse 64:13": "Eebe mooyee Ilaah kale ma jiro, isaga uunna ha tala saarteen Mu'miniintu.",
            "verse 64:14": "Kuwa xaqa rumeeyow Haweenkiinna iyo Caruurtiina waxaa ka mid ah kuwo Col idiin ah ee ka digtoonaada, haddaadse iska cafidaan saamaxdaanna Eebe waa dambi dhaafe naxariiste ah.",
            "verse 64:15": "Xoolihiinnu iyo Caruurtiinnu waa uun fidno (ibtilo) Eebe agtiisaase ajir weyn (ku sugan yahay).",
            "verse 64:16": "Eebe ka dhawrsada intaad kartaan, maqla oo adeecana (weyneeya), waxna baxsada, ruuxii laga dhawro bakhaylnimada naftiisa waa liibaanay.",
            "verse 64:17": "haddaad Eebe amaah fiican amaahsataan (wax sadaqaysataan) Eebe waa idiin laab laabi, dambigiinana wuu dhaafi, Eebana waa kan la mahadiyo ee ee dusha san.",
            "verse 64:18": "waxa maqan iyo waxa joogaba Eebe wa ogyahay waana adkaade Falsan."
        },
        "Spanish": {
            "verse 64:1": "A Allah glorifica todo cuanto hay en los cielos y en la tierra. Suya es la soberanía y Suyas son las alabanzas.Él es Poderoso sobre todas las cosas.",
            "verse 64:2": "Él es Quien os ha creado. Y entre vosotros unos son incrédulos y otros creyentes. Allah ve lo que hacéis.",
            "verse 64:3": "Creó los cielos y la tierra con la verdad, os dio forma e hizo que fuera la mejor. A Él se ha de retornar.",
            "verse 64:4": "Conoce lo que hay en los cielos y en la tierra y sabe lo que guardáis en secreto y lo que mostráis.Allah sabe lo que encierran los pechos.",
            "verse 64:5": "No os han llegado las noticias de los anteriores a vosotros? Se negaron a creer y gustaron las consecuencias de su acción. Tendrán un doloroso castigo.",
            "verse 64:6": "Eso es porque habiéndoles llegado sus mensajeros con las pruebas claras dijeron: Es que nos van a guiar simples humanos? Y se negaron a creer y se desentendieron; y Allah prescindió de ellos.Allah es Rico, en Sí mismo alabado.",
            "verse 64:7": "Los que se niegan a creer pretenden que no van a ser devueltos a la vida. Di: Por el contrario. Por tu Señor! que seréis levantados y luego se os hará saber lo que hicisteis.Eso es simple para Allah.",
            "verse 64:8": "Creed pues en Allah y en Su mensajero y en la luz que ha hecho descender.Allah está perfectamente informado de lo que hacéis.",
            "verse 64:9": "El día en que os reúna con motivo del Día de la Reunión, ése será el Día del Desengaño. Quien haya creído en Allah y haya actuado con rectitud, le cubriremos sus maldades y lo haremos entrar en jardines por cuyo suelo corren los ríos. En ellos serán inmortales para siempre. Ese es el gran triunfo.",
            "verse 64:10": "Y los que se hayan negado a creer y hayan tachado de mentira Nuestros signos, ésos son los compañeros del Fuego donde serán inmortales. Qué mal lugar de destino!",
            "verse 64:11": "Nada de lo que sobreviene es sin permiso de Allah.El que crea en Allah, habrá guiado su corazón.Allah es Conocedor de cada cosa.",
            "verse 64:12": "Obedeced a Allah y obedeced al Mensajero.Y si dais la espalda... Ciertamente a Nuestro mensajero sólo le incumbe transmitir con claridad.",
            "verse 64:13": "Allah, no hay dios sino Él; en Allah se abandonan los creyentes.",
            "verse 64:14": "Vosotros que creéis! Es cierto que entre vuestras esposas e hijos hay enemigos para vosotros, guardaos de ellos.Pero si sois indulgentes, pasáis por alto y perdonáis... Es verdad que Allah es Perdonador y Compasivo.",
            "verse 64:15": "Realmente vuestras riquezas e hijos no son sino una prueba, pero Allah tiene a Su lado una enorme recompensa.",
            "verse 64:16": "Así pues temed a Allah cuanto podáis, escuchad, obedeced y dad con sinceridad, que será para vosotros mismos.Aquel que está libre de su propia avaricia... Esos son los que tendrán éxito.",
            "verse 64:17": "Si le hacéis un hermoso préstamo a Allah, Él os lo devolverá doblado y os perdonará. Allah es Agradecido, Benévolo.",
            "verse 64:18": "El Conocedor del No-Visto y de lo Aparente, el Poderoso, el Sabio."
        },
        "Swahili": {
            "verse 64:1": "Kinamtakasa Mwenyezi Mungu kila kilichomo katika mbingu na katika ardhi. Ufalme ni wake, na sifa njema ni zake. Na Yeye ni Mwenye uweza juu ya kila kitu.",
            "verse 64:2": "Yeye ndiye aliye kuumbeni. Miongoni mwenu yupo aliye kafiri, na yupo aliye Muumini. Na Mwenyezi Mungu anayaona mnayo yatenda.",
            "verse 64:3": "Ameziumba mbingu na ardhi kwa haki, na akakupeni sura, na akazifanya nzuri sura zenu. Na marudio ni kwake.",
            "verse 64:4": "Anajua viliomo katika mbingu na ardhi, na anajua mnayo yaficha na mnayo yatangaza. Na Mwenyezi Mungu ni Mjuzi wa yaliomo vifuani.",
            "verse 64:5": "Kwani haikukujieni khabari ya walio kufuru kabla, wakaonja matokeo mabaya ya mambo yao? Na wao wana adhabu iliyo chungu.",
            "verse 64:6": "Hayo ni kwa kuwa walikuwa wakiwajia Mitume wao kwa hoja zilizo wazi, nao wakasema: Hivyo binaadamu ndio atuongoe? Basi wakakufuru, na wakageuka upande. Mwenyezi Mungu akawa hana haja nao. Na Mwenyezi Mungu ni Mkwasi, si mhitaji, naye ni Msifiwa.",
            "verse 64:7": "Walio kufuru wanadai kuwa hawatafufuliwa. Sema: Kwani? Naapa kwa Mola wangu Mlezi! Hapana shaka mtafufuliwa, na kisha hapana shaka mtaambiwa mliyo yatenda. Na hayo ni mepesi kwa Mwenyezi Mungu.",
            "verse 64:8": "Basi muaminini Mwenyezi Mungu na Mtume wake, na Nuru tuliyo iteremsha. Na Mwenyezi Mungu anazo khabari za mnayo yatenda.",
            "verse 64:9": "Siku atakayo kukusanyeni kwa ajili ya Siku ya Mkusanyiko; hiyo ni siku ya kupunjana. Na anaye muamini Mwenyezi Mungu na akatenda mema, atamfutia maovu yake, na atamuingiza katika Mabustani yenye kupitiwa kati yake na mito, watadumu humo milele. Huko ndiko kufuzu kukubwa.",
            "verse 64:10": "Na walio kufuru na wakakadhibisha Ishara zetu, hao ni watu wa Motoni, watadumu humo milele. Na hayo ndiyo marudio mabaya.",
            "verse 64:11": "Haufiki msiba wowote ila kwa idhini ya Mwenyezi Mungu. Na mwenye kumuamini Mwenyezi Mungu huuongoa moyo wake. Na Mwenyezi Mungu ni Mjuzi wa kila kitu.",
            "verse 64:12": "Na mt'iini Mwenyezi Mungu, na mt'iini Mtume. Mkigeuka, basi hakika juu ya Mtume wetu ni kufikisha (Ujumbe wake) kwa uwazi tu.",
            "verse 64:13": "Mwenyezi Mungu, hapana mungu isipo kuwa Yeye. Na juu ya Mwenyezi Mungu nawategemee Waumini.",
            "verse 64:14": "Enyi mlio amini! Hakika miongoni mwa wake zenu na watoto wenu wamo maadui zenu. Basi tahadharini nao. Na mkisamehe, na mkapuuza, na mkaghufiria basi hakika Mwenyezi Mungu ni Mwingi wa maghfira, Mwenye kurehemu.",
            "verse 64:15": "Hakika mali yenu na watoto wenu ni jaribio. Na kwa Mwenyezi Mungu upo ujira mkubwa.",
            "verse 64:16": "Basi mcheni Mwenyezi Mungu kama mwezavyo, na sikieni, na t'iini, na toeni, itakuwa kheri kwa nafsi zenu. Na mwenye kuepushwa na uchoyo wa nafsi yake, basi hao ndio walio fanikiwa.",
            "verse 64:17": "Mkimkopesha Mwenyezi Mungu mkopo mzuri, atakuzidishieni mardufu, na atakusameheni. Na Mwenyezi Mungu ni Mwingi wa shukra, Mpole.",
            "verse 64:18": "Mwenye kujua siri na dhaahiri, Mwenye nguvu, Mwenye hikima."
        },
        "Swedish": {
            "verse 64:1": "ALLT det som himlarna rymmer och det som jorden bär prisar Gud; herraväldet är Hans och allt lov och pris tillkommer Honom och Han har makt över allt.",
            "verse 64:2": "Det är Han som har skapat er; bland er finns den som [tvivlar och] förnekar sanningen och den som tror. Och Gud ser vad ni gör.",
            "verse 64:3": "Han har skapat himlarna och jorden i enlighet med en plan och ett syfte; Han har format er [och gett er] den bästa skapnad och Han är målet för er färd.",
            "verse 64:4": "Han känner allt som finns i himlarna och på jorden och Han vet vad ni håller hemligt och vad ni öppet visar; ja, Gud är Den som vet vad som rör sig i människans innersta.",
            "verse 64:5": "HAR NI inte hört berättas om dem som i gångna tider förnekade sanningen? De fick smaka de bittra frukterna av sina handlingar och [i nästa liv väntar dem] ett svårt lidande;",
            "verse 64:6": "så är det därför att de, när sändebuden kom till dem med klara bevis, svarade: \"Är det då människor som skall vägleda oss?\" - och så förnekade de sanningen och vände ryggen till. Men Gud behöver dem inte - Gud är Sig själv nog; allt lov och pris tillkommer Honom.",
            "verse 64:7": "De som förnekar sanningen påstår att de inte skall uppväckas från de döda. Säg: \"Vid min Herre och Gud! Helt visst skall ni återuppväckas och då skall ni få veta vad era handlingar [var värda]. Detta är lätt för Gud.\"",
            "verse 64:8": "Tro därför på Gud och Hans Sändebud och på det ljus som Vi har uppenbarat [för er]; Gud är väl underrättad om vad ni gör.",
            "verse 64:9": "Den Dag då Han kallar er till den stora Samlingen, kommer de förmodade vinnarna och förlorarna att byta plats. För dem som trodde på Honom och levde ett rättskaffens liv skall Gud utplåna deras dåliga handlingar och låta dem stiga in i lustgårdar, vattnade av bäckar, där de skall förbli till evig tid - detta är den stora, den lysande segern.",
            "verse 64:10": "Men de som framhärdade i att förneka sanningen och påstod att Våra budskap är lögn har Elden till arvedel och där skall de förbli till evig tid - i sanning ett eländigt slut!",
            "verse 64:11": "INGEN olycka drabbar [er] utan Guds tillåtelse. Gud ger hjärtat hos den som tror på Honom dess vägledning. - Gud har kunskap om allt.",
            "verse 64:12": "Lyd Gud och lyd Sändebudet! Om ni vänder honom ryggen [skall ni veta att] det bara åligger Vårt Sändebud att klart framföra det budskap [som anförtrotts åt honom].",
            "verse 64:13": "Gud - det finns ingen annan gud än Han; låt därför de troende sätta all sin lit till Gud!",
            "verse 64:14": "TROENDE! Bland era hustrur och era barn kan finnas [de som är] era fiender; var därför på er vakt mot dem! Men om ni har överseende, förlåter och glömmer [de felsteg som de begår, skall Gud visa att] Han är ständigt förlåtande, barmhärtig.",
            "verse 64:15": "Era ägodelar och era barn är inte annat än [medel med vilka] Han prövar er; hos Gud väntar en rik belöning.",
            "verse 64:16": "Frukta därför Gud efter måttet av er förmåga; lyssna till och lyd [Hans ord]. Och ge åt andra för er själs bästa; det skall gå dem väl i händer som värjer sig för girighetens [frestelser].",
            "verse 64:17": "Om ni ger Gud ett lån av goda gärningar, skall Han betala tillbaka det med mångdubbla värdet och förlåta era synder; Gud erkänner [Sina tjänares] förtjänster och Han har överseende [med deras brister].",
            "verse 64:18": "Han känner allt det som är dolt för människor och det som de bevittnar - Han, den Allsmäktige, den Vise."
        },
        "Tajik": {
            "verse 64:1": "Худоро тасбеҳ мегӯянд ҳар чӣ дар осмонҳову ҳар чӣ дар замин аст. Фармонравоӣ аз они Ӯст ва шукр сазовори Ӯст ва Ӯ бар ҳар чизе тавоност!",
            "verse 64:2": "Ӯст, ки шуморо биёфарид. Баъзе аз шумо кофир ва баъзе мӯъминанд. Ва корҳое, ки мекунед, мебинад!",
            "verse 64:3": "Осмонҳову заминро ба ҳақ биёфарид ва шуморо сурат баст ва некӯ сурат баст. Ва бозгашти ҳама ба сӯи Ӯст!",
            "verse 64:4": "Ҳар чиро дар осмонҳову замин аст, медонад ва ба он чӣ пинҳон медоред, ё ошкор месозед, огоҳ аст. Ва Худо ба ҳар чӣ дар дилҳо мегузарад, доно аст!",
            "verse 64:5": "Оё шуморо хабари касоне, ки аз ин пеш кофир шуда буданд, нарасидааст? Уқубати амалашонро чашиданд ва онҳорост азобе дардовар.",
            "verse 64:6": "Ин ба ҷазои он буд, ки паёмбаронашон бо далелҳои равшан бар онон фиристода шуданд, Ва онҳо гуфтанд: «Оё одамиён моро ҳидоят мекунанд?» Пас кофир шуданд ва рӯйгардон гаштанд ва Худо беҳоҷат асту тавонгар ва сазовори ситоиш аст.",
            "verse 64:7": "Кофирон пиндоштанд, ки онҳоро зинда намекунанд. Бигӯ: «Оре, ба Парвардигорам савганд, ки шуморо зинда мекунанд, то ба корҳое, ки кардаед, огоҳ, созанд. Ва ин бар Худо осон аст».",
            "verse 64:8": "Пас ба Худову паёмбараш ва ин нур, ки нозил кардаем, имон биёваред. Ва Худо ба корҳое, ки мекунед, огоҳ аст!",
            "verse 64:9": "Рӯзе, ки ҳамаи шуморо дар маҳшар ҷамъ оварад, он рӯз рӯзи зиён аст. Ва ҳар ки ба Худо имон биёварад ва кори шоиста кунад, гуноҳонашро мерезад ва ба биҳиштҳое, ки дар он наҳрҳо ҷорист, дохил кунад. Он ҷо ҷовидона хоҳанд буд. Ин комёбии бузургест!",
            "verse 64:10": "Ва онон, ки кофир шуданд ва оёти Моро дурӯғ бароварданд, аҳли оташанд. Дар он ҷовидонаанд ва ҷаҳаннам бад бозгаштест!",
            "verse 64:11": "Ҳеҷ мусибате бе фармони Худо ба касе намерасад, Ва ҳар кӣ ба Худо имон биёварад, Худо қалбашро ҳидоят мекунад,. Ва Худо ба ҳар чизе доност!",
            "verse 64:12": "Худоро итоъат кунед ва паёмбарро итоъат кунед. Пас агар шумо рӯй гардонед, бар фиристодаи Мо вазифае ғайри расонидани паёми ошкор нест.",
            "verse 64:13": "Худо яктост, ки ҳеҷ худое ғайри Ӯ нест. Мӯъминон, албатта, бар Худои якто таваккал кунанд.",
            "verse 64:14": "Эй касоне, ки имон овардаед, баъзе аз занону фарзандонатон душмани шумо ҳастанд. Аз онҳо ҳазар кунед, Ва агар афв кунед ва чашм бипӯшеду гуноҳашон пӯшида доред, Худо бахшояндаву меҳрубон аст!",
            "verse 64:15": "Ҷуз ин нест, ки амволу авлоди шумо озмоише ҳастанд. Ва ҳол он ки музди фаровон назди Худост.",
            "verse 64:16": "То тавонед, аз Худо битарсед ва гӯш андозед ва итоъат кунед ва ба нафъи худ аз молатон хайр кунед. Ва онон, ки аз ҳирси нафси худ дар амон мондаанд, наҷот ёфтагонанд.",
            "verse 64:17": "Агар ба Худо қарзулҳасана садақа дар роҳи Худо диҳед, бароятон ду 'баробараш хоҳад кард. Ва шуморо мебахшояд, ки Ӯ шукркунандаву бурдбор аст.",
            "verse 64:18": "Донои ниҳону ошкор аст, ғолибу ҳаким аст!"
        },
        "Tamil": {
            "verse 64:1": "வானங்களில் உள்ளவையும், பூமியில் உள்ளவையும் அல்லாஹ்வைத் தஸ்பீஹு (துதி) செய்கின்றன, அவனுக்கே ஆட்சி உரியது, இன்னும் புகழனைத்தும் அவனுக்குரியதே, அன்றியும் எல்லாப் பொருட்கள் மீதும் அவன் பேராற்றலுடையவன்.",
            "verse 64:2": "(மானிடர்களே!) அவனே உங்களைப் படைத்தவன், உங்களில் காஃபிரும் உண்டு, முஃமினும் உண்டு - இன்னும் நீங்கள் செய்பவற்றை அல்லாஹ் நோக்கிவாறே இருக்கின்றான்.",
            "verse 64:3": "வானங்களையும், பூமியையும் அவன் சத்தியத்துடன் (தக்க முறையில்) படைத்துள்ளான், அன்றியும் உங்களை உருவாக்கி, உங்கள் உருவங்களையும் அழகாக்கினான்; அவனிடம் தாம் (யாவருக்கும்) மீளுதல் இருக்கிறது.",
            "verse 64:4": "வானங்களிலும், பூமியிலும் உள்ளவற்றை அவன் அறிகிறான், நீங்கள் இரசியமாக்கி வைப்பதையும், பகிரங்கமாக்கி வைப்பதையும் அவன் அறிகிறான்; மேலும், இருதயங்களிலுள்ளவற்றை யெல்லாம் அல்லாஹ் அறிகிறான்.",
            "verse 64:5": "இதற்கு முன் நிராகரித்துக் கொண்டிருந்தவர்களின் செய்தி உங்களுக்கு வரவில்லையா? பின்னர், அவர்கள் தங்கள் (தீய) காரியத்தின் பலனை அனுபவித்தனர் - அன்றியும், அவர்களுக்கு (மறுமையில்) நோவினை செய்யும் வேதனையுமுண்டு.",
            "verse 64:6": "இதற்குக் காரணம், நிச்சயமாக அவர்களுக்கு, அவர்களுடைய தூதர்கள் தெளிவான அத்தாட்சிகளுடன் வந்து கொண்டுதாமிருந்தனர், ஆனால் அப்போது அவர்களோ, (நம் போன்ற) ஒரு மனிதரா நமக்கு நேர்வழி காட்டுவார்?\" என்று கூறி (அவர்களைப் பின்பற்றுவதை) நிராகரித்துப் பின் வாங்கிக் கொண்டார்கள், அல்லாஹ்வோ அவர்களிலிருந்து எந்தத் தேவையுமற்றவன், அன்றியும் அல்லாஹ் (எவரிடமிருந்தும்) தேவையற்றவன்; புகழ் மிக்கவன்.",
            "verse 64:7": "(மரித்த பின்னர்) அவர்கள் எழுப்பப்படவே மாட்டார்கள் என்று நிராரிப்பவர்கள் எண்ணிக் கொண்டனர்; \"அப்படியல்ல! என்னுடைய இறைவன் மீது சத்தியமாக, நீங்கள் நிச்சயமாக எழுப்பப்படுவீர்கள்! பிறகு நீங்கள் செய்து கொண்டிருந்தவை பற்றி நிச்சயமாக அறிவிக்கப்படுவீர்கள் - மேலும் அது அல்லாஹ்வுக்கு மிகவும் எளிதேயாகும்\" என்று (நபியே!) நீர் கூறுவீராக.",
            "verse 64:8": "ஆகவே, நீங்கள் அல்லாஹ்வின் மீதும், அவன் தூதர் மீதும், நாம்இறக்கி வைத்த (வேதமாகிய) ஒளியின் மீதும் ஈமான் கொள்ளுங்கள் - அல்லாஹ் நீங்கள் செய்பவற்றை நன்கு தெரிந்தே இருக்கின்றான்.",
            "verse 64:9": "ஒன்று திரட்டும் (மறுமை) நாளுக்காக அவன் உங்களை ஒன்று திரட்டும் நாள் அதுவே, (தீயோரை) நஷ்டப்படுத்தும் நாளாகும், ஆனால், எவர் அல்லாஹ்வின் மீது ஈமான் கொண்டு, ஸாலிஹான - நல்ல - அமல்களைச் செய்கிறாரோ, அவருடைய பாவங்களை அவரை விட்டும் நீக்கி, ஆறுகள் அவற்றின் கீழே ஓடிக் கொண்டிருக்கும் சுவர்க்கச் சோலைகளிலும் அவன் அவரை பிரவேசிக்கச் செய்வான்; அவற்றில் என்றென்றும் இருப்பார்கள் - இது மகத்தான பாக்கியமாகும்.",
            "verse 64:10": "அன்றியும், எவர்கள் நிராகரித்து, நம்முடைய வசனங்களைப் பொய்யாக்குகிறார்களோ அவர்கள் நரகவாசிகளே, அதில் அவர்கள் என்றென்றும் தங்கியிருப்பார்கள்; அது மிகவும் கெட்ட சேருமிடமாகும்.",
            "verse 64:11": "நிகழும் நிகழ்ச்சியெல்லாம் அல்லாஹ்வின் அனுமதி கொண்டேயல்லாமல் (வேறு) இல்லை, மேலும், எவர் அல்லாஹ்வின் மீது ஈமான் கொள்கிறாரோ, அவருடைய இருதயத்தை அவன் நேர்வழியில் செலுத்துகிறான் - அல்லாஹ் ஒவ்வொரு பொருளையும் நன்கறிந்தவன்.",
            "verse 64:12": "ஆகவே, நீங்கள், அல்லாஹ்வுக்கு வழிபடுங்கள்; (அவனுடைய) இத்தூதருக்கும் வழிபடுங்கள், இதை நீங்கள் புறக்கணித்துப் பின்வாங்கினீர்களானால் (உங்களுக்கே இழப்பாகும்) - நம் தூதர் மீதுள்ள கடமை, தெளிவாக எடுத்துரைப்பதுதான்.",
            "verse 64:13": "அல்லாஹ் -அவனைத் தவிர்த்து வேறு நாயன் இல்லை, மேலும் முஃமின்கள் அல்லாஹ்வின் மீதே முற்றிலும் நம்பிக்கை கொண்டு சார்ந்திருப்பார்களாக.",
            "verse 64:14": "ஈமான் கொண்டவர்களே! நிச்சயமாக உங்கள் மனைவியரிலும், உங்கள் மக்களிலும் உங்களுக்கு விரோதிகள் இருக்கின்றனர், எனவே அவர்களைப் பற்றி நீங்கள் எச்சரிக்கையாக இருங்கள்; அதையும் (அவர்களின் குற்றங் குறைகளை) மன்னித்தும், அவற்றைப் பொருட்படுத்தாமலும், சகித்துக் கொண்டும் இருப்பீர்களாயின் - நிச்சயமாக அல்லாஹ் மிகவும் மன்னிப்பவன். மிக்க கிருபையுடையவன்.",
            "verse 64:15": "உங்கள் பொருள்களும் உங்கள் மக்களும் (உங்களுக்குச்) சோதனைதான், ஆனால் அல்லாஹ் - அவனிடம் தான் மகத்தான (நற்) கூலியிருக்கிறது.",
            "verse 64:16": "ஆகவே, உங்களால் இயன்ற வரை அல்லாஹ்வுக்கு அஞ்சி நடந்து கொள்ளுங்கள்; (அவன் போதனைகளைச்) செவிதாழ்த்திக் கேளுங்கள்; அவனுக்கு வழிபடுங்கள்; (அவன் பாதையில்) செலவு செய்யுங்கள்; (இது) உங்களுக்கே மேலான நன்மையாக இருக்கும்; அன்றியும்; எவர்கள் உலோபத்தனத்திலிருந்து காக்கப்படுகிறார்களோ, அவர்கள் தாம் வெற்றி பெற்றவர்கள்.",
            "verse 64:17": "நீங்கள் அல்லாஹ்வுக்கு அழகிய கடனாகக் கடன் கொடுத்தால், அதை அவன் உங்களுக்காக இரட்டிப்பாக்குவான், அன்றியும் அவன் உங்களை மன்னிப்பான் - அல்லாஹ்வோ நன்றியை ஏற்பவன், சகிப்பவன்.",
            "verse 64:18": "மறைவானவற்றையும், பகிரங்கமானவற்றையும் அறிபவன்; (யாவரையும்) மிகைத்தவன்; ஞானம் மிக்கவன்."
        },
        "Tatar": {
            "verse 64:1": "Җир вә күкләрдә булган һәрнәрсә Аллаһ кимчелекләрдән пакь, дип, Аны мактап тәсбих әйтәдер, ике дөньяга да патшалык Аңа хастыр, хакыйкый мактау Аңадыр вә Аның һәр нәрсәгә көче җитәдер.",
            "verse 64:2": "Ул – Аллаһ сезне халык кылды, Сезләрдән кәферләр бар вә Сезләрдән мөэминнәр бар, Аллаһ сезнең кылган эшләрегезне күрүчедер.",
            "verse 64:3": "Җирне вә күкләрне хаклык белән төзеде, вә сезнең сурәтләрегезне төзеде, сурәтләрегезне вә рәвешләрегезне ни күркәм кылды, вә Ул – Аллаһугадыр кайтачак урын.",
            "verse 64:4": "Ул җирдәге вә күкләрдәге яшерен нәрсәләрне беләдер, вә сезнең ачык кылган эшләрегезне һәм яшерен кылган эшләрегезне дә барын да беләдер. Аллаһ күкрәкләрдә булган уй-фикерләрне беләдер.",
            "verse 64:5": "Моннан элек булган кәферләрнең хәбәре сезгә килмәдеме, үзләренең көферлекләренең имгәген татыдылар, вә аларгадыр ахирәттә рәнҗеткүче ґәзаб.",
            "verse 64:6": "Аларга дөньяда һәм ахирәттә ґәзаб тиешле булды менә бу сәбәпле, тәхкыйк аларга пәйгамбәрләре төрле могҗизалар һәм Исламның хаклыгына ачык дәлилләр белән килә иделәр, алар әйттеләр: \"Әйә безне туры юлга кешеме күндерер?\" Ягъни пәйгамбәрләрнең фәрештәдән булуын теләделәр. Алар шуның өчен пәйгамбәрләрне инкяр иттеләр вә хакны кабул итүдән баш тарттылар, Аллаһ моңсыздыр аларның ышануларына һич ихтыяҗы юктыр. Аллаһ бай вә һәр эшендә мактаулы.",
            "verse 64:7": "Кәферләр үзләренчә \"үлгәннән соң терелү булмый\" дигән сүзләрен дөресләп маташалар. Син аларга әйт: \"Бәлки, әлбәттә, терелерсез, Раббымның исеме илә ант итеп әйтәмен, әлбәттә, терелеп каберләрегездән кубарылып чыгачаксыз, соңра кылган эшләрегездән үзегезгә хәбәр бирелмеш булырсыз. Бу эш Аллаһуга бик җиңелдер.",
            "verse 64:8": "Кубарылу хак булгач, Аллаһуга вә Аның рәсүленә һәм Без иңдергән гакыл нуры булган Коръәнгә ышаныгыз! Аллаһ сезнең кылган эшләрегездән хәбәрдардыр.",
            "verse 64:9": "Аллаһ сезне бер көнне җыяр, кыямәт көнендә җыеп хисаб алу өчен, бу хисаб өчен җыелган көн, чын алдану көнедер, ягъни ул көндә һәркем дөньяга алданганлыгын белер: мөшрикләрнең, монафикъларның, сихерчеләрнең, багучыларның, риячыларның, бидеґәтчеләрнең, даими хәрам ашаган, хәрам эчкән кешеләрнең, хаксыз кешеләрне рәнҗеткән залимнәрнең һәм башка бозык эшләрне эшләүчеләрнең кылган гамәлләре юкка чыккан булыр. Берәү бу эшләрдән сакланган хәлдә яки тәүбә итеп төзәлгән хәлдә Аллаһуга иман китереп яхшы эшләрне, изге гамәлләрне кылса, Аллаһ ул кешенең яман эшләрен җуяр, бетерер һәм аларны асларыннан елгалар ага торган бакчаларга кертер, алар анда мәңге калырлар. Шундый бакчага мәңгегә керү – олугъ уңышка ирешүдер.",
            "verse 64:10": "Иманны инкяр итеп аятьләребезне ялганга тоткан кешеләр – алар ут әһелләредер анда мәңге калучылардыр, ул ут ни яман урындыр.",
            "verse 64:11": "Кайгы бәла-каза ирешмәде, мәгәр Аллаһуның теләге белән генә иреште. Берәү итагать иткән хәлдә Аллаһуга иман китерсә, Аллаһ ул кешенең күңелен хаклыкка күндерер. Аллаһ һәрнәрсәне белүче.",
            "verse 64:12": "Аллаһуга итагать итегез, вә расүлгә итагать итегез, аларның боерыкларын җиренә җиткереп үтәгез, әгәр карышсагыз, итагать итүдән баш тартсагыз, бит расүлебезнең бурычы фәкать сезгә Безнең хөкемнәребезне ирештермәк, ачык итеп аңлатмактыр.",
            "verse 64:13": "Аллаһудан башка һич Илаһә юк, мәгәр Ул – Үзе генә, мөэминнәр Аллаһуга тәвәккәл итсеннәр!",
            "verse 64:14": "Ий мөэминнәр, тәхкыйк сезнең хатыннарыгыздан һәм балаларыгыздан бардыр сезгә дошман булганнары, алардан сакланыгыз, гафил булмагыз! Әгәр аларны гафу итсәгез һәм аларны шелтә кылуны куеп хата эшләрен кичерсәгез, әлбәттә, Аллаһ ярлыкаучы һәм рәхимле.",
            "verse 64:15": "Сезнең малларыгыз һәм балаларыгыз, сезнең өчен фәкать фетнә. Әмма Аллаһ юлында булганнарга Аллаһ хозурында олугъ әҗерләр бар.",
            "verse 64:16": "Аллаһудан куркыгыз, Аңа гөнаһлы булудан сакланыгыз көчегез җиткән чаклы, ягъни Аллаһ тыйган гөнаһлы эшләрдән тыелырга көчегез җитә торып тыелмыйча һәм кушкан сәваблы эшләрне көчегез җитә торып эшләмичә гөнаһлы булмагыз, Аллаһуның сүзен ишетегез һәм итагать итегез, һәм малларыгыздан садакалар бирегез – бу эшләр үзегез өчен файдалыдыр. Бер кеше дөнья малына нәфесенең комсызлыгыннан сакланса – андый кешеләр ґәзабтан котылып өстенлек табучылардыр.",
            "verse 64:17": "Аллаһуга бурычка кергән кеби, гөнаһлардан Аллаһ ризалыгы өчен сакланыгыз һәм сәваблы эшләрне Аллаһ ризалыгы өчен генә кылсагыз, Аллаһ әҗерләрен ике өлеш арттырып бирер һәм сезне ярлыкар. Аллаһ яхшылыкка яхшылык бирүче вә юаш.",
            "verse 64:18": "Яшерен эшләрне вә әшкәрә булган эшләрне белүчедер, куәтле, һәр эштә өстен вә хөкем итүчедер."
        },
        "Telugu": {
            "verse 64:1": "ఆకాశాలలో నున్న సమస్తమూ మరియు భూమిలో నున్న సమస్తమూ, అల్లాహ్ పవిత్రతను కొనియాడుతుంటాయి. విశ్వసామ్రాజ్యాధిపత్యం ఆయనదే మరియు సర్వస్తోత్రాలు ఆయనకే. మరియు ఆయనే ప్రతిదీ చేయగల సమర్ధుడు",
            "verse 64:2": "ఆయనే మిమ్మల్ని సృష్టించాడు. మీలో కొందరు సత్యతిరస్కారులున్నారు మరియు మీలో కొందరు విశ్వాసులున్నారు మరియు మీరు చేసేదంతా అల్లాహ్ చూస్తున్నాడు",
            "verse 64:3": "ఆయన ఆకాశాలను మరియు భూమిని సత్యంతో సృష్టించాడు మరియు మిమ్మల్ని ఉత్తమ రూపంలో రూపొందించాడు. మరియు మీ గమ్యస్థానం ఆయన వైపునకే ఉంది",
            "verse 64:4": "ఆకాశాలలో మరియు భూమిలో ఉన్నదంతా ఆయనకు తెలుసు. మరియు మీరు దాచేది మరియు వెలిబుచ్చేది అంతా ఆయకు బాగా తెలుసు. మరియు అల్లాహ్ కు హృదయాలలో దాగి ఉన్నదంతా తెలుసు",
            "verse 64:5": "ఇంతకు పూర్వం, సత్యాన్ని తిరస్కరించి, తమ కర్మల దుష్ఫలితాన్ని చవి చూసిన వారి వృత్తాంతం మీకు అందలేదా? మరియు వారికి (పరలోకంలో) బాధాకరమైన శిక్ష ఉంటుంది",
            "verse 64:6": "దీనికి కారణమేమిటంటే, వాస్తవానికి వారి వద్దకు వారి ప్రవక్తలు, స్పష్టమైన సూచనలు తీసుకొని వచ్చినప్పటికీ, వారు: ఏమీ? మాకు మానవులు మార్గదర్శకత్వం చేస్తారా?\" అని పలుకుతూ సత్యాన్ని తిరస్కరించి మరలి పోయారు. మరియు అల్లాహ్ కూడా వారిని నిర్లక్ష్యం చేశాడు. మరియు అల్లాహ్ స్వయం సమృద్ధుడు, సర్వస్తోత్రాలకు అర్హుడు",
            "verse 64:7": "సత్యాన్ని తిరస్కరించిన వారు (చనిపోయిన తరువాత) మరల సజీవులుగా లేపబడమని భావిస్తున్నారు. వారితో ఇలా అను: అది కాదు, నా ప్రభువు సాక్షిగా! మీరు తప్పకుండా లేపబడతారు. తరువాత మీరు (ప్రపంచంలో) చేసిందంతా మీకు తెలుపబడుతుంది. మరియు ఇది అల్లాహ్ కు ఎంతో సులభం",
            "verse 64:8": "కావున మీరు అల్లాహ్ ను మరియు ఆయన ప్రవక్తను మరియు మేము అవతరింపజేసిన జ్యోతిని (ఈ ఖుర్ఆన్ ను) విశ్వసించండి. మరియు మీరు చేసేదంతా అల్లాహ్ బాగా ఎరుగును",
            "verse 64:9": "(జ్ఞాపకముంచుకోండి) సమావేశపు రోజున ఆయన మీ అందరిని సమావేశపరుస్తాడు. అదే లాభనష్టాల దినం. మరియు ఎవడైతే అల్లాహ్ ను విశ్వసించి, సత్కార్యాలు చేస్తాడో, అలాంటి వాని పాపాలను ఆయన తొలగిస్తాడు. మరియు అతనిని క్రింద సెలయేళ్ళు ప్రవహించే స్వర్గవనాలలో ప్రవేశింపజేస్తాడు, వారందులో శాశ్వతంగా కలకాలం ఉంటారు. అదే గొప్ప విజయం",
            "verse 64:10": "మరియు ఎవరైతే సత్యాన్ని తిరస్కరిస్తారో మరియు మా సూచన (ఆయాత్) లను అబద్ధాలని నిరాకరిస్తారో, అలాంటి వారు నరకవాసులవుతారు. అందు వారు శాశ్వతంగా ఉంటారు. మరియు అది ఎంత చెడ్డ గమ్యస్థానం",
            "verse 64:11": "ఏ ఆపద కూడా, అల్లాహ్ అనుమతి లేనిదే సంభవించదు. మరియు ఎవడైతే అల్లాహ్ ను విశ్వసిస్తాడో, అల్లాహ్ అతని హృదయానికి మార్గదర్శకత్వం చేస్తాడు. మరియు అల్లాహ్ కు ప్రతి విషయం గురించి బాగా తెలుసు",
            "verse 64:12": "మీరు అల్లాహ్ కు విధేయులై ఉండండి మరియు సందేశహరుణ్ణి అనుసరించండి. ఒకవేళ మీరు మరలిపోతే, (తెలుసుకోండి) వాస్తవానికి మా సందేశహరుని బాధ్యత కేవలం (మా సందేశాన్ని) మీకు స్పష్టంగా అందజేయటం మాత్రమే",
            "verse 64:13": "అల్లాహ్! ఆయన తప్ప, మరొక ఆరాధ్యుడు లేడు! మరియు విశ్వాసులు కేవలం అల్లాహ్ మీదే నమ్మకం ఉంచుకోవాలి",
            "verse 64:14": "ఓ విశ్వాసులారా! నిశ్చయంగా, మీ సహవాసులు (అజ్వాజ్) మరియు మీ సంతానంలో మీ శత్రువులుండవచ్చు! కావున మీరు వారి పట్ల జాగ్రత్త వహించండి. కాని ఒకవేళ మీరు వారి అపరాధాన్ని మన్నించి వారిని ఉపేక్షించి వారిని క్షమించితే! నిశ్చయంగా, అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత (అని తెలుసుకోండి)",
            "verse 64:15": "నిశ్చయంగా, మీ సంపదలు మరియు మీ సంతానం మీ కొరకు ఒక పరీక్ష మరియు అల్లాహ్! ఆయన దగ్గర గొప్ప ప్రతిఫలం (స్వర్గం) ఉంది",
            "verse 64:16": "కావున మీరు మీ శక్తి మేరకు అల్లాహ్ యందు భయభక్తులు కలిగి ఉండి, (ఆయన సూచనలను విని), ఆయనకు విధేయులై ఉండండి మరియు (మీ ధనం నుండి) దానం చేస్తే! అది మీ సొంత మేలుకే. మరియు ఎవరైతే తమ హృదయ లోభత్వం నుండి రక్షణ పొందుతారో, అలాంటి వారే సాఫల్యం పొందేవారు",
            "verse 64:17": "ఒకవేళ మీరు అల్లాహ్ కు అప్పుగా మంచి అప్పు ఇస్తే, ఆయన దానిని ఎన్నో రెట్లు పెంచి తిరిగి మీకు ప్రసాదిస్తాడు మరియు మిమ్మల్ని క్షమిస్తాడు. వాస్తవానికి అల్లాహ్ కృతజ్ఞతలను ఆమోదించేవాడు, సహనశీలుడు",
            "verse 64:18": "ఆయన అగోచర మరియు గోచర విషయాలన్నీ బాగా తెలిసినవాడు, అపార శక్తిసంపన్నుడు, మహా వివేకవంతుడు"
        },
        "Thai": {
            "verse 64:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และสิ่งที่อยู่ในแผ่นดินต่างแซ่ซ้องสดุดีแด่อัลลอฮฺ อำนาจเด็ดขาดเป็นของพระองค์ มวลการสรรเสริญเป็นของพระองค์ และพระองค์เป็นผู้ทรงอานุภาพเหนือทุกสิ่งอย่าง",
            "verse 64:2": "พระองค์คือผู้ทรงสร้างพวกเจ้า ดังนั้นในหมู่พวกเจ้ามีผู้ปฏิเสธศรัทธา และในหมู่พวกเจ้ามีผู้ศรัทธา และอัลลอฮฺทรงรู้เห็นในสิ่งที่พวกเจ้ากระทำ",
            "verse 64:3": "พระองค์ทรงสร้างชั้นฟ้าทั้งหลายและแผ่นดินด้วยความจริง และทรงทำให้พวกเจ้าเป็นรูปร่างและทรงทำให้รูปร่างของพวกเจ้าสวยงามยิ่ง และยังพระองค์เท่านั้นคือทางกลับ",
            "verse 64:4": "พระองค์ทรงรอบรู้สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและแผ่นดิน และทรงรอบรู้สิ่งที่พวกเจ้าปกปิดและสิ่งที่พวกเจ้าเปิดเผย และอัลลอฮฺทรงรอบรู้สิ่งที่อยู่ในทรวงอก",
            "verse 64:5": "ข่าวคราวของบรรดาผู้ปฏิเสธศรัทธาในอดีต มิได้มีมายังพวกเจ้าดอกหรือ? พวกเขาได้ลิ้มรสการลงโทษแห่งกิจกรรมของพวกเขา (ในโลกดุนยา) และการลงโทษอันเจ็บปวดจะได้แก่พวกเขา (ในโลกอาคิเราะฮฺ)",
            "verse 64:6": "นั่นเป็นเพราะว่าบรรดาร่อซูลของพวกเขาได้มายังพวกเขาพร้อมด้วยหลักฐานอันชัดแจ้งแต่พวกเขาได้กล่าวว่าสามัญชนเช่นนี้นะหรือจะชี้แนะทางให้แก่เรา พวกเขาได้ปฏิเสธศรัทธา และผินหลังให้แต่อัลลอฮฺทรงพอเพียง(จากการศรัทธาของพวกเขา) เพราะอัลลอฮฺเป็นผู้ทรงมั่งมีอย่างเหลือหลายเป็นผู้ทรงได้รับการสรรเสริญ",
            "verse 64:7": "บรรดาผู้ปฏิเสธศรัทธากล่าวอ้างว่าพวกเขาจะไม่ถูกให้ฟื้นคืนชีพขึ้นมาอีกจงกล่าวเถิดมุฮัมมัดหาเป็นเช่นนั้นไม่ !ขอสาบานต่อพระเจ้าของข้าพระองค์ พวกท่านจะถูกให้ฟื้นคืนชีพขึ้นมาอีกอย่างแน่นอน แล้วพวกท่านจะได้รับแจ้งตามที่พวกท่านได้ประกอบกรรมไว้ และนั่นเป็นการง่ายดายสำหรับอัลลอฮฺ",
            "verse 64:8": "ดังนั้นจงศรัทธาต่ออัลลอฮฺและร่อซูลของพระองค์ และแสงสว่าง (อัลกุรอาน) ซึ่งในสิ่งที่พวกเจ้ากระทำ",
            "verse 64:9": "วันที่พระองค์จะทรงรวบรวมพวกเจ้า เพื่อวันแห่งการชุมนุม นั่นคือวันแห่งชัยชนะ (สำหรับมุอฺมินา) และขาดทุน(สำหรับกาฟิร) ส่วนผู้ได้ศรัทธาต่ออัลลอฮฺ และกระทำความดี พระองค์จะทรงลบล้างความชั่วทั้งหลายของเขาออกไปจากเขา และจะทรงให้เขาเข้าสวนสวรรค์หลากหลาย ณ เบื้องล่างของสวนสวรรค์นั้นมีลำน้ำหลายสายไหลผ่านพวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดการ นั่นคือความสำเร็จอันยิ่งใหญ่",
            "verse 64:10": "ส่วนบรรดาผู้ปฏิเสธศรัทธา และปฏิเสธต่อสัญญาณต่าง ๆ ของเขา ชนเหล่านั้นคือชาวนรก พวกเขาเป็นผู้พำนักอยู่ในนั้นและมันเป็นทางกลับที่ชั่วช้ายิ่ง",
            "verse 64:11": "ไม่มีทุกข์ภัยอันใดเกิดขึ้น เว้นแต่ด้วยอนุมัติของอัลลอฮฺ และผู้ใดศรัทธาต่ออัลลอฮฺพระองค์จะทรงเปิดหัวใจของเขา (สู่แนวทางที่ถูกต้อง) และอัลลอฮฺเป็นผู้ทรงรอบรู้ทุกสิ่งอย่าง",
            "verse 64:12": "และจงเชื่อฟังปฏิบัติตามอัลลอฮฺและจงเชื่อฟังปฏิบัติตามอัลร่อซูล หากพวกเจ้าผินหลังกลับ (ไม่เชื่อฟัง) ดังนั้นหน้าที่ของร่อซูลของเราก็คือการเผยแผ่อันชัดแจ้ง",
            "verse 64:13": "อัลลอฮฺ ไม่มีพระเจ้าอื่นใดนอกจากพระองค์ ดังนั้นบรรดาผู้ศรัทธาทั้งหลายจงมอบหมายไว้วางใจต่ออัลลอฮฺเถิด",
            "verse 64:14": "โอ้บรรดาผู้ศรัทธาเอ๋ย แท้จริงในหมู่คู่ครองของพวกเจ้าและลูกหลานของพวกเจ้านั้นมีบางคนเป็นศัตรูแก่พวกเจ้าฉะนั้นจงระวังต่อพวกเขา แต่ถ้าพวกเจ้าอภัยและยกโทษ (แก่พวกเขา) แท้จริงอัลลอฮฺนั้นเป็นผู้ทรงอภัย ผู้เมตตาเสมอ",
            "verse 64:15": "แท้จริงทรัพย์สมบัติของพวกเจ้า และลูกหลานของพวกเจ้านั้นเป็นเครื่องทดสอบและอัลลอฮฺนั้น ณ ที่พระองค์มีรางวัลอันยิ่งใหญ่",
            "verse 64:16": "ดังนั้นจงยำเกรงอัลลอฮฺเถิด เท่าที่พวกเจ้ามีความสามารถ และจงเชื่อฟังและปฏิบัติตามและบริจาคเถิดเพราะเป็นการดียิ่งสำหรับตัวของพวกเจ้า และผู้ใดถูกปกป้องให้พ้นจากความตระหนี่แห่งจิตใจของเขา ชนเหล่านั้นพวกเขาเป็นผู้ประสบความสำเร็จ",
            "verse 64:17": "หากพวกเจ้าให้อัลลอฮฺยืมอย่างดีเยี่ยมแล้ว พระองค์ก็จะทรงทวีการยืมให้แก่พวกเจ้า และจะทรงอภัยให้แก่พวกเจ้า และอัลลอฮฺนั้นเป็นผู้ทรงตอบแทนแก่ผู้กระทำความดีทรงผ่อนผันการลงโทษ",
            "verse 64:18": "ผู้ทรงรอบรู้สิ่งเร้นลับ และสิ่งที่เปิดเผย ผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ"
        },
        "Turkish": {
            "verse 64:1": "Göklerde olanlar ve yerde bulunanlar Allah'ı tesbih ederler. Hükümranlık O'nundur, Övülmek O'na mahsustur. O herşeye Kadir'dir.",
            "verse 64:2": "Sizi yaratan O'dur; kiminiz inkarcı kiminiz mümindir. Allah yaptıklarınızı gören'dir.",
            "verse 64:3": "Gökleri ve yeri gerektiği gibi yaratmıştır. Size şekil vermiş ve şeklinizi güzel yapmıştır. Dönüş O'nadır.",
            "verse 64:4": "Göklerde ve yerde olanları bilir; gizlediklerinizi de açığa vurduklarınızı da bilir; Allah, kalblerde olanı da bilendir.",
            "verse 64:5": "Daha önce inkar edip de, inkarlarının karşılığını tadan kimselerin haberi size gelmedi mi? Onlara, can yakıcı azap vardır.",
            "verse 64:6": "Bu, kendilerine peygamberleri belgelerle geldiğinde: \"Bizi doğru yola bir insan mı eriştirecek?\" diyerek inkar edip gerçeğe yüz çevirmelerinden ötürüdür. Allah hiçbir şeye muhtaç olmadığını ortaya koymuştur. Allah müstağnidir, övülmeğe layık olandır.",
            "verse 64:7": "İnkar edenler, tekrar dirilmeyeceklerini ileri sürerler. De ki: \"Evet; Rabbime and olsun ki, şüphesiz diriltileceksiniz ve sonra, yaptıklarınız size bildirilecektir. Bu, Allah'a kolaydır.\"",
            "verse 64:8": "Öyleyse Allah'a, Peygamberine ve indirdiğimiz nura, Kuran'a inanın; Allah işlediklerinizden haberdardır.",
            "verse 64:9": "Toplanma günü için, sizi bir araya getirdiği zaman, işte o, kimin aldandığının ortaya çıkacağı gündür; Allah'a kim inanmış ve yararlı iş işlemişse, Allah onun kötülüklerini örter, onu içinde temelli ve sonsuz kalacağı, içlerinden ırmaklar akan cennetlere koyar; büyük kurtuluş işte budur.",
            "verse 64:10": "İnkar edip, ayetlerimizi yalanlayanlar, işte onlar da ateşliklerdir, orada temellidirler. Ne kötü bir dönüştür!",
            "verse 64:11": "Başa gelen hiçbir musibet Allah'ın izni olmaksızın olamaz; Allah'a kim inanırsa onun gönlünü doğruya yöneltir. Allah herşeyi bilendir.",
            "verse 64:12": "Allah'a itaat edin; eğer bundan yüz çevirirseniz bilin ki Peygamberimize düşen apaçık tebliğdir.",
            "verse 64:13": "Allah vardır, O'ndan başka tanrı yoktur. İnananlar yalnız Allah 'a güvensinler.",
            "verse 64:14": "Ey inananlar! Eşleriniz ve çocuklarınızdan size düşmanlık edenler olur, onlardan sakının; ama, siz affeder, suçlarını örter ve bağışlarsanız bilin ki Allah da bağışlar ve acır.",
            "verse 64:15": "Doğrusu mallarınız ve çocuklarınız bir imtihandır. Büyük ecir ise Allah katındadır.",
            "verse 64:16": "Allah'a karşı gelmekten gücünüzün yettiği kadar sakının, buyruklarını dinleyin, itaat edin; kendinizin iyiliğine olarak mallarınızdan sarfedin; nefsinin tamahkarlığından korunan kimseler, işte onlar saadete erenlerdir.",
            "verse 64:17": "Eğer Allah'a güzel bir ödünç takdiminde bulunursanız, onu sizin için kat kat yapar ve sizi bağışlar; Allah, şükrün karşılığını verendir; Halim'dir.",
            "verse 64:18": "Görüleni görülmeyeni bilendir, güçlüdür. Hakim'dir."
        },
        "Urdu": {
            "verse 64:1": "جو چیز آسمانوں میں ہے اور جو چیز زمین میں ہے (سب) خدا کی تسبیح کرتی ہے۔ اسی کی سچی بادشاہی ہے اور اسی کی تعریف (لامتناہی) ہے اور وہ ہر چیز پر قادر ہے",
            "verse 64:2": "وہی تو ہے جس نے تم کو پیدا کیا پھر کوئی تم میں کافر ہے اور کوئی مومن۔ اور جو کچھ تم کرتے ہو خدا اس کو دیکھتا ہے",
            "verse 64:3": "اسی نے آسمانوں اور زمین کو مبنی برحکمت پیدا کیا اور اسی نے تمہاری صورتیں بنائیں اور صورتیں بھی پاکیزہ بنائیں۔ اور اسی کی طرف (تمہیں) لوٹ کر جانا ہے",
            "verse 64:4": "جو کچھ آسمانوں اور زمین میں ہے وہ سب جانتا ہے اور جو کچھ تم چھپا کر کرتے ہو اور جو کھلم کھلا کرتے ہو اس سے بھی آگاہ ہے۔ اور خدا دل کے بھیدوں سے واقف ہے",
            "verse 64:5": "کیا تم کو ان لوگوں کے حال کی خبر نہیں پہنچی جو پہلے کافر ہوئے تھے تو انہوں نے اپنے کاموں کی سزا کا مزہ چکھ لیا اور (ابھی) دکھ دینے والا عذاب (اور) ہونا ہے",
            "verse 64:6": "یہ اس لئے کہ ان کے پاس پیغمبر کھلی نشانیاں لے کر آئے تو یہ کہتے کہ کیا آدمی ہمارے ہادی بنتے ہیں؟ تو انہوں نے (ان کو) نہ مانا اور منہ پھیر لیا اور خدا نے بھی بےپروائی کی۔ اور خدا بےپروا (اور) سزاوار حمد (وثنا) ہے",
            "verse 64:7": "جو لوگ کافر ہیں ان کا اعتقاد ہے کہ وہ (دوبارہ) ہرگز نہیں اٹھائے جائیں گے۔ کہہ دو کہ ہاں ہاں میرے پروردگار کی قسم تم ضرور اٹھائے جاؤ گے پھر جو کام تم کرتے رہے ہو وہ تمہیں بتائے جائیں گے اور یہ (بات) خدا کو آسان ہے",
            "verse 64:8": "تو خدا پر اور اس کے رسول پر اور نور (قرآن) پر جو ہم نے نازل فرمایا ہے ایمان لاؤ۔ اور خدا تمہارے سب اعمال سے خبردار ہے",
            "verse 64:9": "جس دن وہ تم کو اکھٹا ہونے (یعنی قیامت) کے دن اکھٹا کرے گا وہ نقصان اٹھانے کا دن ہے۔ اور جو شخص خدا پر ایمان لائے اور نیک عمل کرے وہ اس سے اس کی برائیاں دور کردے گا اور باغہائے بہشت میں جن کے نیچے نہریں بہہ رہی ہیں داخل کرے گا۔ ہمیشہ ان میں رہیں گے۔ یہ بڑی کامیابی ہے",
            "verse 64:10": "اور جنہوں نے کفر کیا اور ہماری آیتوں کو جھٹلایا وہی اہل ذوزخ ہیں۔ ہمیشہ اس میں رہیں گے۔ اور وہ بری جگہ ہے",
            "verse 64:11": "کوئی مصیبت نازل نہیں ہوتی مگر خدا کے حکم سے۔ اور جو شخص خدا پر ایمان لاتا ہے وہ اس کے دل کو ہدایت دیتا ہے۔ اور خدا ہر چیز سے باخبر ہے",
            "verse 64:12": "اور خدا کی اطاعت کرو اور اس کے رسول کی اطاعت کرو۔ اگر تم منہ پھیر لو گے تو ہمارے پیغمبر کے ذمے تو صرف پیغام کا کھول کھول کر پہنچا دینا ہے",
            "verse 64:13": "خدا (جو معبود برحق ہے اس) کے سوا کوئی عبادت کے لائق نہیں تو مومنوں کو چاہیئے کہ خدا ہی پر بھروسا رکھیں",
            "verse 64:14": "مومنو! تمہاری عورتیں اور اولاد میں سے بعض تمہارے دشمن (بھی) ہیں سو ان سے بچتے رہو۔ اور اگر معاف کردو اور درگزر کرو اور بخش دو تو خدا بھی بخشنے والا مہربان ہے",
            "verse 64:15": "تمہارا مال اور تمہاری اولاد تو آزمائش ہے۔ اور خدا کے ہاں بڑا اجر ہے",
            "verse 64:16": "سو جہاں تک ہوسکے خدا سے ڈرو اور (اس کے احکام کو) سنو اور (اس کے) فرمانبردار رہو اور (اس کی راہ میں) خرچ کرو (یہ) تمہارے حق میں بہتر ہے۔ اور جو شخص طبعیت کے بخل سے بچایا گیا تو ایسے ہی لوگ راہ پانے والے ہیں",
            "verse 64:17": "اگر تم خدا کو (اخلاص اور نیت) نیک (سے) قرض دو گے تو وہ تم کو اس کا دوچند دے گا اور تمہارے گناہ بھی معاف کردے گا۔ اور خدا قدر شناس اور بردبار ہے",
            "verse 64:18": "پوشیدہ اور ظاہر کا جاننے والا غالب اور حکمت والا ہے"
        },
        "Uyghur": {
            "verse 64:1": "ئاسمانلاردىكى ۋە زېمىندىكى نەرسىلەر اﷲ قا تەسبىھ ئېيتىدۇ، پادىشاھلىق اﷲ قا مەنسۇپتۇر، جىمى ھەمدۇسانا اﷲ قا خاستۇر، اﷲ ھەر نەرسىگە قادىردۇر",
            "verse 64:2": "اﷲ سىلەرنى خەلق ئەتتى، ئاراڭلاردا مۆمىنلەرمۇ بار، كاپىرلارمۇ بار، اﷲ سىلەرنىڭ قىلىۋاتقان ئىشىڭلارنى كۆرۈپ تۇرغۇچىدۇر",
            "verse 64:3": "اﷲ ئاسمانلارنى ۋە زېمىننى ھەق ياراتتى، سىلەرنى سۈرەتكە كىرگۈزدى، سۈرىتىڭلارنى چىرايلىق قىلدى، ئاخىر قايتىدىغان جاي ئۇنىڭ دەرگاھىدۇر",
            "verse 64:4": "اﷲ ئاسمانلاردىكى ۋە زېمىندىكى نەرسىلەرنى بىلىپ تۇرىدۇ، اﷲ (نىيەتلىرىڭلاردىن، ئەمەللىرىڭلاردىن) يوشۇرغانلىرىڭلارنى ۋە ئاشكارىلىغانلىرىڭلارنى بىلىپ تۇرىدۇ، اﷲ دىللاردىكى سىرلارنى بىلگۈچىدۇر",
            "verse 64:5": "سىلەرگە ئىلگىرى كاپىر بولۇپ ئەمەللىرىنىڭ ۋابالىنى تېتىغانلارنىڭ خەۋىرى كەلمىدىمۇ؟ ئۇلار (ئاخىرەتتە) قاتتىق ئازابقا دۇچار بولىدۇ",
            "verse 64:6": "بۇ شۇنىڭ ئۈچۈندۇركى، ئۇلارغا پەيغەمبەرلىرى روشەن مۆجىزىلەر بىلەن كەلگەن ئىدى، ئۇلار: «ئىنسان بىزنى ھىدايەت قىلالامدۇ؟» دېدى. (پەيغەمبەرنى) ئىنكار قىلدى، (ئىماندىن) يۈز ئۆرۈدى. اﷲ (ئۇلارنىڭ ئىمانىغا) موھتاج ئەمەستۇر، اﷲ مەخلۇقاتتىن بىھاجەتتۇر، مەدھىيىگە لايىقتۇر",
            "verse 64:7": "كاپىرلار ھەرگىز تىرىلدۈرۈلمەيمىز دەپ گۇمان قىلىشتى، ئېيتقىنكى: «ھەرگىز ئۇنداق ئەمەس، پەرۋەردىگارىم بىلەن قەسەمكى، سىلەر چوقۇم تىرىلدۈرىسىلەر، ئاندىن سىلەرگە قىلمىشىڭلاردىن خەۋەر بېرىلىدۇ، بۇ اﷲ قا ئاساندۇر»",
            "verse 64:8": "اﷲ قا، اﷲ نىڭ پەيغەمبىرىگە ۋە بىز نازىل قىلغان نۇرغا (يەنى قۇرئانغا) ئىمان ئېيتىڭلار، اﷲ قىلىۋاتقان ئىشىڭلاردىن تولۇق خەۋەرداردۇر",
            "verse 64:9": "ئۇ كۈندە اﷲ سىلەرنى قىيامەت ئۈچۈن توپلايدۇ، ئۇ زىيان تارتىدىغان كۈندۇر (يەنى ئۇ كۈندە ئىماننى تەرك ئەتكەنلىكى بىلەن كاپىرنىڭ زىيان تارتقانلىقى، ياخشى ئەمەللەرنى دېگەندەك قىلالمىغانلىقى بىلەن مۆمىننىڭ زىيان تارتقانلىقى ئاشكارا بولىدۇ). كىمكى اﷲ قا ئىمان ئېيتىپ ياخشى ئىش قىلىدىكەن، اﷲ ئۇنىڭ يامان ئىشلىرىنى يوققا چىقىرىدۇ، ئۇنى ئاستىدىن ئۆستەڭلەر ئېقىپ تۇرىدىغان جەننەتلەرگە كىرگۈزىدۇ، ئۇلار ئۇ جەننەتلەردە مەڭگۈ قالىدۇ، بۇ كاتتا مۇۋەپپەقىيەتتۇر",
            "verse 64:10": "اﷲ نىڭ (بىرلىكىنى ۋە قۇدرىتىنى) ئىنكار قىلغانلار، ئايەتلىرىمىزنى يالغانغا چىقارغانلار ئەھلى دوزاخ بولۇپ، ئۇلار دوزاختا مەڭگۈ قالىدۇ، ئۇ نېمىدېگەن يامان جاي!",
            "verse 64:11": "كىشىگە يەتكەن ھەر قانداق مۇسىبەت پەقەت اﷲ نىڭ ئىزنى (يەنى قازاسى) بىلەنلا (يېتىدۇ)، كىمكى اﷲ قا (يەنى ھەر قانداق مۇسىبەت اﷲ نىڭ قازاسى بىلەن يېتىدۇ دېگەن سۆزگە) ئىشىنىدىكەن، اﷲ ئۇنىڭ قەلبىنى (سەۋرگە) يېتەكلەيدۇ، اﷲ ھەر نەرسىنى بىلگۈچىدۇر",
            "verse 64:12": "اﷲ قا ئىتائەت قىلىڭلار، پەيغەمبەرگە ئىتائەت قىلىڭلار، ئەگەر (پەيغەمبەرنىڭ دەۋىتىدىن) يۈز ئۆرۈسەڭلار (پەيغەمبەرگە زىيان يوق، ئۆزۈڭلارغا زىيان)، پەيغەمبىرىمىزنىڭ ۋەزىپىسى پەقەت (دەۋەتنى) روشەن تەبلىغ قىلىشتۇر",
            "verse 64:13": "اﷲ تىن باشقا ھېچ مەبۇد (بەرھەق) يوقتۇر، مۆمىنلەر اﷲ قا تەۋەككۈل قىلسۇن",
            "verse 64:14": "ئى مۆمىنلەر! سىلەرنىڭ ئاياللىرڭلاردىن، بالىلىرىڭلاردىن سىلەرگە دۈشمەن بولىدىغانلىرىمۇ بار، ئۇلاردىن ئېھتىيات قىلىڭلار، ئەگەر (ئۇلارنى) ئەپۇ قىلساڭلار، كەچۈرسەڭلار، مەغپىرەت قىلساڭلار (اﷲ سىلەرنىمۇ مەغپىرەت قىلىدۇ). اﷲ ھەقىقەتەن ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر",
            "verse 64:15": "سىلەرنىڭ ماللىرىڭلار، بالىلىرىڭلار (سىلەرگە اﷲ تەرىپىدىن) بىر تۈرلۈك سىناقتۇر، اﷲ نىڭ دەرگاھىدا كاتتا ساۋاب بار",
            "verse 64:16": "تاقىتىڭلارنىڭ يېتىشىچە اﷲ قا تەقۋادارلىق قىلىڭلار، (ۋەزىنى) ئاڭلاڭلار، (ئەمرىگە) ئىتائەت قىلىڭلار، (اﷲ نىڭ يولىدا ماللىرىڭلارنى) سەرپ قىلىڭلار، (بۇ) ئۆزۈڭلار ئۈچۈن پايدىلىقتۇر، كىمكى نەپسىنىڭ بېخىللىقىدىن ساقلىنىدىكەن، ئۇ مەقسىتىگە ئېرىشكۈچىدۇر",
            "verse 64:17": "اﷲ قا قەرزىي ھەسەنە بەرسەڭلار (يەنى مەمنۇنىيەت بىلەن سەدىقە بەرسەڭلار) اﷲ سىلەرگە ئۇنىڭ (ساۋابىنى) ھەسسىلەپ بېرىدۇ، سىلەرگە مەغپىرەت قىلىدۇ، اﷲ ئاز ياخشىلىققا كۆپ ساۋاب بەرگۈچىدۇر، ھەلىمدۇر (يەنى بەندىلىرىنى ئازابلاشقا ئالدىراپ كەتمەيدۇ)",
            "verse 64:18": "(اﷲ) غەيبنى ۋە ئاشكارىنى بىلگۈچىدۇر، غالىبتۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر"
        },
        "Uzbek": {
            "verse 64:1": "Осмонлардаги нарсалар ва ердаги нарсалар Аллоҳга тасбиҳ айтурлар. Мулк Унга хосдир, мақтов ҳам Унга хосдир ва У барча нарсага қодирдир.",
            "verse 64:2": "У сизларни яратган зотдир. Бас, баъзиларингиз кофир ва баъзиларингиз мўминдир. Аллоҳ нима қилаётганингизни кўриб турувчидир.",
            "verse 64:3": "У осмонлару ерни ҳақ билан яратди. Ва қиёфангизни чиройли сувратда қилди. Ва қайтиб бориш Унинг Ўзигадир.",
            "verse 64:4": "У осмонлару ердаги нарсаларни биладир. Сизлар сир тутаётган нарсани ҳам ва эълон қилаётган нарсани ҳам биладир. Аллоҳ кўкракдаги нарсаларни ҳам билувчидир.",
            "verse 64:5": "Сизларга олдин кофир бўлганларнинг хабари келмадими? Бас, улар ўз ишларининг азобини татидилар ва уларга аламли азоблар бор.",
            "verse 64:6": "Бунинг боиси шундаки, уларга Пайғамбарлари ойдин далиллар билан келардилар, улар бўлса, бизни башар ҳидоятга бошлайдими, деб куфрга кетардилар ва (ҳақдан) юз ўгирардилар. Ва Аллоҳ беҳожат бўлди. Аллоҳ беҳожат ва мақталгандир.",
            "verse 64:7": "Кофирлар ҳеч қайта тирилмасликларини даъво қилдилар. Сен: «Ундоқ эмас, Роббим билан қасамки, албатта қайта тирилтирилурсизлар, сўнгра қилган ишларингиздан хабардор қилинурсизлар. Бу иш Аллоҳ учун осондир», деб айт.",
            "verse 64:8": "Бас, Аллоҳга, Унинг Расулига ва Биз туширган нурга иймон келтиринглар. Аллоҳ нима қилаётганингиздан хабардордир.",
            "verse 64:9": "У сизларни «Жамлаш куни»га тўплайдиган кунни эсланг. У кун «тағобун» кунидир. Ким Аллоҳга иймон келтирса ва солиҳ амаллар қилса, унинг гуноҳларини кечирур ва остидан анҳорлар оқиб турган жаннатларга киритур. Унда абадул-абад қолурлар. Бу улкан ютуқдир.",
            "verse 64:10": "Куфр келтириб, Бизнинг оятларимизни ёлғонга чиқарганлар, ана ўшалар, оташ эгаларидир. Унда абадий қолурлар. Қандоқ ҳам ёмон жой у!",
            "verse 64:11": "Сизга Аллоҳнинг изнисиз ҳеч бир мусибат етмас. Ким Аллоҳга иймон келтирса, У зот унинг қалбини ҳидоятга солур. Аллоҳ ҳар бир нарсани билувчидир.",
            "verse 64:12": "Аллоҳга итоат қилинг ва ҳамда Расулга итоат қилинг. Агар юз ўгириб кетсангиз, бас, Бизнинг Расулимизга очиқ-ойдин етказиш, холос.",
            "verse 64:13": "Аллоҳ, Ундан ўзга ибодатга сазовор зот йўқ. Бас, мўминлар Аллоҳнинг Ўзигагина таваккал қилсинлар.",
            "verse 64:14": "Эй иймон келтирганлар! Албатта, жуфтларингиздан ва болаларингиздан сизга душман бор, бас, улардан ҳазир бўлинг. Ва агар афв этсангиз, кўнгилга олмасангиз ва айбларини кечирсангиз, бас, албатта, Аллоҳ кечирувчи ва раҳмдил зотдир.",
            "verse 64:15": "Албатта, мол-мулкларингиз ва фарзандларингиз синовдан бошқа нарса эмас. Ва Аллоҳнинг ҳузурида улуғ ажр бор.",
            "verse 64:16": "Аллоҳга қўлингиздан келганича тақво қилинг ва (амрини) тингланг ва итоат қилинг ва инфоқ қилинг - ўзингизга яхши бўлади. Ва кимки нафсининг қизғанчиқлигидан сақланса, ана ўшалар нажот топувчилардир.",
            "verse 64:17": "Агар Аллоҳга яхши қарз берсангиз, У сизга кўпайтириб берур ва сизни кечирур. Аллоҳ шакур ва ҳалимдир.",
            "verse 64:18": "У ғойиб ва ошкорни билувчи, азиз ва ҳаким зотдир."
        },
        "Vietnamese": {
            "verse 64:1": "Vạn vật trong các tầng trời và vạn vật dưới đất đều tán dương tôn cao Allah, Quyền thống trị đều thuộc về một mình Ngài, mọi lời ca tụng và khen ngợi đều là thuộc về Ngài, và Ngài là Đấng Toàn Năng trên tất cả mọi thứ.",
            "verse 64:2": "Chính Ngài là Đấng đã tạo hóa các ngươi (hỡi nhân loại) nhưng trong các ngươi có người không tin và có người tin tưởng vào điều đó. Và Allah thấy rõ những gì các ngươi làm.",
            "verse 64:3": "Ngài đã tạo ra trời đất vì chân lý và Ngài đã tạo hình thể của các ngươi và làm cho hình thể của các ngươi đẹp nhất. Và (rồi đây) các ngươi sẽ quay về trình diện Ngài.",
            "verse 64:4": "Ngài biết rõ những gì trong trời đất và biết những gì các ngươi che giấu cũng như những gì các ngươi bộc lộ. Quả thật, Allah biết rõ những gì trong lòng (của mọi người).",
            "verse 64:5": "(Hỡi những kẻ đa thần!) Lẽ nào thông tin của những kẻ vô đức tin thời trước các ngươi chưa đến với các ngươi sao? Những kẻ đó đã nếm trải hậu quả tồi tệ từ những công việc của chúng và chúng sẽ phải chịu một sự trừng phạt đau đớn (ở Đời Sau).",
            "verse 64:6": "Đó là bởi vì các Sứ Giả của chúng đã từng đến gặp chúng với những bằng chứng rõ ràng, nhưng chúng nói: “Liệu một người phàm tục có thể hướng dẫn chúng ta ư?” Vậy là chúng đã không tin và quay đi. Và Allah không cần đến chúng bởi Allah là Đấng Miễn Cần, Đấng Đáng Được Ca Ngợi.",
            "verse 64:7": "Những kẻ vô đức tin tuyên bố rằng chúng sẽ không được dựng sống trở lại. Ngươi (Thiên Sứ Muhammad) hãy nói với chúng: “Không như các ngươi khẳng định, Ta thề bởi Thượng Đế của Ta, chắc chắc các ngươi sẽ được dựng sống trở lại. Rồi các ngươi sẽ được Ngài cho biết về những điều mà các ngươi đã làm. Và điều đó đối với Allah thật dễ dàng.”",
            "verse 64:8": "Vì vậy, các ngươi hãy tin Allah và Sứ Giả của Ngài, và hãy tin vào Ánh Sáng (Qur’an) mà TA đã ban xuống. Quả thật, Allah thông toàn về mọi thứ các ngươi làm.",
            "verse 64:9": "Ngày mà Ngài sẽ triệu tập tất cả loài người cho một Ngày Đại Hội. Đó là Ngày của người thắng kẻ thua. Bất cứ ai có đức tin nơi Allah và hành thiện, Ngài sẽ xóa những điều tội lỗi khỏi y và y sẽ được thu nhận vào các Ngôi Vườn Thiên Đàng bên dưới có các dòng sông chảy, nơi họ sẽ sống mãi mãi. Đó là một thành tựu vĩ đại.",
            "verse 64:10": "Ngược lại, những ai vô đức tin và phủ nhận các Lời Mặc Khải của TA, đó sẽ là những người bạn của Hỏa Ngục, chúng sẽ sống trong đó đời đời kiếp kiếp. Và đó là một đích đến vô cùng tồi tệ.",
            "verse 64:11": "Không một tai họa nào xảy ra mà không do phép của Allah. Ai có đức tin nơi Allah, Ngài sẽ hướng dẫn trái tim của y. Quả thật, Allah là Đấng biết tất cả mọi thứ.",
            "verse 64:12": "Các ngươi hãy tuân lệnh Allah và tuân lệnh Sứ Giả (của Ngài). Nhưng nếu các ngươi quay đi thì (các ngươi hãy biết rằng) quả thật Sứ Giả của TA chỉ là một người truyền đạt lại một cách rõ ràng và công khai mà thôi.",
            "verse 64:13": "Allah là Thượng Đế duy nhất, không có Thượng Đế đích thực nào khác ngoài Ngài. Vì vậy, những người có đức tin hãy phó thác cho Allah.",
            "verse 64:14": "Hỡi những người có đức tin! Quả thật, trong số người vợ và con cái của các ngươi có người là kẻ thù của các ngươi. Do đó, các ngươi hãy cảnh giác và coi chừng chúng. Nhưng nếu các ngươi lượng thứ bỏ qua và tha thứ cho chúng thì quả thật, Allah là Đấng Tha Thứ, Đấng Nhân từ.",
            "verse 64:15": "Thật ra, tài sản và con cái của các ngươi chỉ là một sự thử thách (mà Allah muốn thử thách các ngươi). Và (các ngươi hãy biết rằng) ở nơi Allah có một phần thưởng vô cùng vĩ đại.",
            "verse 64:16": "Vì vậy, các ngươi hãy kính sợ Allah (nhiều nhất có thể) theo khả năng của các ngươi, các ngươi hãy nghe và vâng lệnh, và các ngươi hãy chi tiêu (theo cách của Allah), nó tốt hơn cho bản thân của các ngươi. Những ai giữ bản thân mình khỏi sự keo kiệt, ích kỷ thì sẽ là những người thành đạt.",
            "verse 64:17": "Nếu các ngươi cho Allah mượn một món nợ tốt, Ngài sẽ gia tăng nó lên gấp bội cho các ngươi và Ngài sẽ tha thứ tội lỗi cho các ngươi bởi vì Allah là Đấng Ghi Công, Đấng Chịu Đựng.",
            "verse 64:18": "Ngài là Đấng biết điều vô hình và hữu hình, Đấng Chí Tôn, Đấng Thông Thái."
        },
        "Yoruba": {
            "verse 64:1": "Ohunkohun t’o wa ninu awon sanmo ati ohunkohun t’o wa ninu ile n se afomo fun Allahu. TiRe ni ijoba. TiRe si ni ope. Oun si ni Alagbara lori gbogbo nnkan",
            "verse 64:2": "Oun ni Eni ti O seda yin. Alaigbagbo wa ninu yin. Onigbagbo ododo si wa ninu yin. Allahu si ni Oluriran nipa ohun ti e n se",
            "verse 64:3": "O seda awon sanmo ati ile pelu ododo. O ya aworan yin. O si se awon aworan yin daradara. Odo Re si ni abo eda",
            "verse 64:4": "O mo ohunkohun t’o wa ninu awon sanmo ati ile. O si mo ohun ti e n fi pamo ati ohun ti e n safi han re. Allahu si ni Onimo nipa ohun t’o wa ninu igba-aya eda",
            "verse 64:5": "Se iro awon t’o sai gbagbo ni isaaju ko ti i de ba yin ni? Nitori naa, won to iya oran won wo. Iya eleta-elero si wa fun won",
            "verse 64:6": "Iyen nitori pe dajudaju awon Ojise won n wa ba won pelu awon eri t’o yanju. Won si wi pe: \"Se abara l’o maa fi ona mo wa?\" Nitori naa, won sai gbagbo. Won si peyin da (si ododo). Allahu si roro lai si awon. Ati pe Allahu ni Oloro, Olope",
            "verse 64:7": "Awon t’o sai gbagbo lero pe A o nii gbe won dide. So pe: \"Bee ko, mo fi Oluwa mi bura, dajudaju Won yoo gbe yin dide. Leyin naa, Won yoo fun yin ni iro ohun ti e se nise. Iyen si je irorun fun Allahu",
            "verse 64:8": "Nitori naa, e gbagbo ninu Allahu ati Ojise Re ati imole ti A sokale. Allahu si ni Alamotan nipa ohun ti e n se",
            "verse 64:9": "Ni ojo ti (Allahu) yoo ko yin jo fun ojo akojo. Iyen ni ojo ere ati adanu. Enikeni ti o ba gba Allahu gbo ni ododo, ti o si se ise rere, (Allahu) yoo pa awon asise re re fun un. O si maa mu un wo inu Ogba Idera, ti awon odo n san ni isale re. Olusegbere ni won ninu re titi laelae. Iyen si ni erenje nla",
            "verse 64:10": "Awon t’o si sai gbagbo, ti won tun pe awon ayah Wa niro, awon wonyen ni ero inu Ina. Olusegbere ni won ninu re. Ikangun naa si buru",
            "verse 64:11": "Adanwo kan ko le sele ayafi pelu iyonda Allahu. Enikeni ti o ba gba Allahu gbo, Allahu maa fi okan re mona. Allahu si ni Onimo nipa gbogbo nnkan",
            "verse 64:12": "Ki e tele ti Allahu. Ki e si tele ti Ojise. Ti e ba gbunri, ise-jije ponnbele lojuse Ojise Wa",
            "verse 64:13": "Allahu, ko si olohun ti ijosin to si afi Oun. Allahu si ni ki awon onigbagbo ododo gbarale",
            "verse 64:14": "Eyin ti e gbagbo ni ododo, dajudaju ota wa fun yin ninu awon iyawo yin ati awon omo yin. Nitori naa, e sora fun won. Ti e ba samojukuro, ti e safojufo, ti e si saforijin (fun won), dajudaju Allahu ni Alaforijin, Asake-orun",
            "verse 64:15": "Ifooro ni awon dukia yin ati awon omo yin. Allahu si ni esan nla wa ni odo Re",
            "verse 64:16": "Nitori naa, e beru Allahu bi e ba se lagbara mo. E gbo oro (Allahu), e tele e, ki e si nawo (fun esin Re) loore julo fun emi yin. Enikeni ti A ba so nibi ahun ati okanjua inu emi re, awon wonyen, awon ni olujere",
            "verse 64:17": "Ti e ba ya Allahu ni dukia t’o dara, O maa sadipele re fun yin. O si maa forijin yin. Allahu si ni Olumoore, Alafarada",
            "verse 64:18": "Onimo-ikoko ati gbangba, Alagbara, Ologbon"
        }
    }
}