{
    "id": 65,
    "name_simple": "At-Talaq",
    "revelation_place": "madinah",
    "revelation_order": 99,
    "bismillah_pre": true,
    "verses_count": 12,
    "short_text": "At-Talaq is not only the name of this Surah but also the title of its subject matter, for it contains commandments about Talaq (divorce) itself. Hadrat `Abdullah bin Mas`ud has described it as Surah an-Nisa al-qusra also, i.e. the shorter Surah an-Nisa.",
    "text": [
        "\n",
        "At-Talaq is not only the name of this Surah but also the title of its subject matter, for it contains commandments about Talaq (divorce) itself. Hadrat \\`Abdullah bin Mas\\`ud has described it as Surah an-Nisa al-qusra also, i.e. the shorter Surah an-Nisa.",
        "\n",
        "Period of Revelation",
        "\n",
        "Hadrat Abdullah bin Masud has Pointed out, and the internal evidence of the subject matter of the Surah confirms the same, that it must have been sent down after those verses of surah Al-Baqarah in which commandments concerning divorce were given for the first time. Although it is difficult to determine precisely what is its exact date of revelation, yet the traditions in any case indicate that when the people started making errors in understanding the commandments of Surah Al-Baqarah, and practically also they began to commit mistakes, Allah sent down these instructions for their correction.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In order to understand the commandments of this Surah, it would be useful to refresh one's memory about the instructions which have been given in the Qur'an concerning divorce and the waiting period (Iddat) above.",
        "\n",
        "\"Divorce may be pronounced twice; then the wife may either be kept back in fairness or allowed to separate in fairness.\" (Al Baqarah 229)",
        "\n",
        "\"And the divorced women (after the pronouncement of the divorce) must wait for three monthly courses... and their husbands are fully entitled to take them back (as their wives) during this waiting period, if they desire reconciliation.\" (Al Baqarah 228)",
        "\n",
        "\"Then, if the husband divorces his wife (for the third time), she shall not remain lawful for him after this divorce, unless she marries another husband...\" (Al Baqarah 230)",
        "\n",
        "\"When you marry the believing women, and then divorce them before you have touched them, they do not have to fulfill a waiting period, the completion of which you may demand of them.\" (Al-Ahzab 49)",
        "\n",
        "\"And if those of you who die, leave wives behind, the women should abstain (from marriage) for four months and ten days.\" (Al Baqarah 234)",
        "\n",
        "The rules prescribed in these verses were as follows:",
        "\n",
        "\n\nA man can pronounce at the most three divorces on his wife.\n\n\nIn case the husband has pronounced one or two divorces he is entitled to keep the woman back as wife within the waiting period and if after the expiry of the waiting period the two desire to re-marry, they can re- marry there is no condition of legalization (tahlil). But if the husband has pronounced three divorces, he forfeits his right to keep her as his wife within the waiting. period, and they cannot re-marry unless the woman re-marries another husband and he subsequently divorces her of his own free will.\n\n\nThe waiting period of the woman, who menstruates and marriage with whom has been consummated, is that she should pass three monthly courses. The waiting period in case of one or two divorces is that the woman is still the legal wife of the husband and he can keep her back as his wife within the waiting period. But if the husband has pronounced three divorces, this waiting period cannot be taken advantage of for the purpose of reconciliation, but it is only meant to restrain the woman from re-marrying another person before it comes to an end.\n\n\nThere is no waiting. period for the woman, marriage with whom has not been consummated, and who is divorced even before she is touched. She can re-marry, if she likes, immediately after the divorce.\n\n\nThe waiting period of the woman whose husband dies, is four months and ten days.\n\n",
        "\n",
        "Here, one should understand well that Surah At-Talaq was not sent down to annul any of these rules or amend it, but it was sent down for two purposes;",
        "\n",
        "First, that the man who has been given the right to pronounce divorce should be taught such judicious methods of using this right as do not lead to separation, as far as possible however, if separation does take place, it should only be in case all possibilities of mutual reconciliation have been exhausted. For in the Divine Law provision for divorce has been made only as an unavoidable necessity; otherwise Allah does not approve that the marriage relationship that has been established between a man and a woman should ever break. The Holy Prophet (upon whom be Allah's peace) has said \"Allah has not made lawful anything more hateful in His sight than divorce.\" (Abu Daud). And: \"Of all the things permitted by the Law, the most hateful in the sight of Allah is the divorce, (Abu Daud)",
        "\n",
        "The second object was to complement this section of the family law of Islam by supplying answers to the questions that had remained after the revelation of the commandments in Surah Al-Baqarah. So, answers have been supplied to the following questions:What would be the waiting period of the women, marriage with whom has been consummated and who no longer menstruate, or those who have not yet menstruated, in case they are divorced? What would be the waiting period of the woman, who is pregnant, or the woman whose husband dies, if she is divorced?And what arrangements would be made for the maintenance and lodging of the different categories of divorced women, and for the fosterage of the child whose parents have separated on account of a divorce?",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that issues the lawful procedures by which one may Divorce and that calls for fair parting between believers if marriage is to end, in accordance with what is right and within God’s prescribed limits, while promising ease and deliverance for the truly God-fearing who undergo this trauma. It takes its name from verse 1 . concerning “divorce” (ṭalāq). The surah strongly urges people to observe God’s regulations and guidance. To reinforce this they are reminded of the fate of earlier disobedient peoples and the rewards of the obedient. God’s power and knowledge are emphasized at the end (verse 12).",
    "name_translation": "Divorce",
    "name_complex": "At-Talâq",
    "surah_name_ar": "الطلاق",
    "verses": {
        "Albanian": {
            "verse 65:1": "O profet! Kur t’i lëshoni gratë, lëshoni në kohën e tyre të caktuar (Id-detit) dhe llogaritni kohën e pritjes dhe durajuni Perëndisë, Zotit tuaj. Mos i dëboni ato prej shtëpive të tyre, - por edhe ato mos të dalin, - përveç nëse haptazi kanë bërë ndonjë vepër të keqe. Këto janë dispozitat e Perëndisë; e ai që nuk i zbaton dispozitat e Perëndisë, ai vetvetes i ka bërë dëm. Ti nuk e di, se pas kësaj, Perëndia mund të sjellë ndonjë vepër (rast për pajtim).",
            "verse 65:2": "Dhe, deri sa të arrijë afati i caktuar, ju mbani ato në mënyrë të arsyeshme, ose ndahuni me to në mënyrë të pëlqyeshme dhe merrni dy dëshmitarë të drejtë prej jush dhe zbatoni dëshminë (e plotë) për Zotin e Madhërueshëm! Kjo është këshillë për ata që i besojnë Perëndisë dhe Ditës së Kijametit, e kush i dron Perëndisë, Ai i bënë rrugëdalje atij,",
            "verse 65:3": "dhe e furnizon atë prej nga nuk e pret; kushdo që mbështetet te Perëndia, Ai i mjafton atij. Perëndia, me të vërtetë, i zbaton deri në fund punët e Tij; Perëndia, për çdo gjë ka caktuar afatin.",
            "verse 65:4": "E ato gra tuaja, të cilat kanë humbur shpresën për ciklin e tyre (të grave), nëse dyshoni (për këtë): koha e tyre e pritjes është tre muaj, si dhe tek ato që nuk kanë pasur ciklin mujor të femrave. Kurse, tek ato që janë shtatzënë, afati i tyre (i pritjes) është deri në lindjen e fëmijës. E, kush i druan Perëndisë, Ai ia lehtëson çështjen atij.",
            "verse 65:5": "Ja, këto janë dispozitat e Perëndisë që u ka shpallur juve, e ai që i druan Perëndisë, Ai (Perëndia) ia shlyen atij veprat e këqia dhe ia rritë atij shpërblimin.",
            "verse 65:6": "Leni ato të banojnë aty ku banoni edhe ju, sipas mundësive tuaja, dhe mos ju bëni vështirësi atyre, për t’i detyruar (që të dalin). Nëse janë shtatzënë furnizoni deri sa të lindin. Nëse fëmija furnizohet me gjiun e nënës, paguajuni atyre (nënave) shpërblimin dhe merruni vesh me të mirë. E, nëse ekzistojnë vështirësi, atëherë le ta ushqejë me gji tjetra.",
            "verse 65:7": "Le të shpenzojë pasaniku sipas pasurisë që ka, por ai që ekonomikisht ka mungesa, le të shpenzojë nga e dhëna e Perëndisë; Perëndia nuk e ngarkon askë (më tepër) se sa i ka dhënë. Perëndia, me siguri, pas vështirësisë – sjell lehtësi.",
            "verse 65:8": "Shumë vendbanime u janë larguar urdhërave të Zotit të vet dhe profetëve të Tij; Ne, do të kërkojmë prej tyre llogari precize dhe do t’i dënojmë me dënim të ashpër.",
            "verse 65:9": "Ata e kanë shijuar dënimin e veprave të tyre, dhe fundi i tyre ka qenë shkatërrim.",
            "verse 65:10": "Perëndia ka përgatitë për ta dënim të rëndë, prandaj druajuni Perëndisë (mos e kundërshtoni), o njerëz mentarë, ju që keni besuar. Perëndia, madje, ju ka dërguar udhërrëfyesin,",
            "verse 65:11": "një Profet, i cili ju shpjegon argumentet e qarta, për t’i nxjerrë ata që besojnë dhe punojnë vepra të mira, nga errësira në dritë. E, ai që beson Perëndinë dhe punon vepër të mirë, Ai (Zoti), do ta shpie atë në kopshtet e xhennetit, nëpër të cilët rrjedhin lumenjt dhe do të qëndrojnë aty përgjithmonë, për jetë e mot. E, Perëndia, i jep atij furnizim të mrekullueshëm.",
            "verse 65:12": "Perëndia është Ai, i cili ka krijuar shtatë qiej dhe aq pjesë të tokës; në to zbatohen urdhërat e Tij, për ta ditur ju, që Perëndia është i Plotëfuqishëm dhe se, me të vërtetë, dijenia e Perëndisë i ka përfshirë të gjitha!"
        },
        "Amharic": {
            "verse 65:1": "አንተ ነቢዩ ሆይ! ሴቶችን መፍታት ባሰባችሁ ጊዜ፤ ለዒዳቸው ፍቱዋቸው፡፡ ዒዳንም ቁጠሩ፡፡ አላህንም ጌታችሁን ፍሩ፡፡ ግልጽ የኾነችን ጠያፍ ካልሠሩ በስተቀር ከቤቶቻቸው አታውጡዋቸው፤ አይውጡም፡፡ ይህችም የአላህ ሕግጋት ናት፡፡ የአላህንም ሕግጋት የተላለፈ ሰው በእርግጥ ነፍሱን በደለ፡፡ ከዚህ (ፍች) በኋላ አላህ (የመማለስ) ነገርን ምናልባት ያመጣ እንደኾነ አታውቅም፡፡",
            "verse 65:2": "ጊዜያቸውንም ለመዳረስ በተቃረቡ ጊዜ በመልካም ያዙዋቸው፡፡ ወይም በመልካም ተለያዩዋቸው፡፡ ከእናንተም ውስጥ ሁለት የትክክለኛነት ባለቤቶችን አስመስክሩ፡፡ ምስክርነትንም ለአላህ አስተካክሉ፡፡ ይህ በአላህና በመጨረሻው ቀን የሚያምን የኾነ ሰው ሁሉ በእርሱ ይገሰጽበታል፡፡ አላህንም የሚፈራ ሰው ለእርሱ መውጫን ያደርግለታል፡፡",
            "verse 65:3": "ከማያስበውም በኩል ሲሳየን ይሰጠዋል፡፡ በአላህም ላይ የሚጠጋ ሰው እርሱ በቂው ነው፡፡ አላህ ፈቃዱን አድራሽ ነው፡፡ አላህ ለነገሩ ሁሉ የተወሰነ ጊዜን በእርግጥ አድርጓል፡፡",
            "verse 65:4": "እኒያም ከሴቶቻቸው ከአደፍ ያቋረጡት (በዒዳቸው ሕግ) ብትጠራጠሩ ዒዳቸው ሦስት ወር ነው፡፡ እኒያም ገና አደፍን ያላዩት (ዒዳቸው እንደዚሁ ነው)፡፡ የእርግዝና ባለቤቶችም ጊዜያቸው እርጉዛቸውን መውለድ ነው፡፡ አላህንም የሚፈራ ሰው ከነገሩ ሁሉ ለርሱ መግራትን ያደርግለታል፡፡",
            "verse 65:5": "ይህ የአላህ ፍርድ ነው፡፡ ወደእናንተ አወረደው፡፡ አላህንም የሚፈራ ሰው ኀጢኣቶቹን ከእርሱ ይሰርይለታል፡፡ ምንዳንም ለእርሱ ያተልቅለታል፡፡",
            "verse 65:6": "ከችሎታችሁ ከተቀመጣችሁበት ስፍራ አስቀምጧቸው፡፡ በእነርሱም ላይ ልታጣብቡ አትጉዷቸው፡፡ የእርግዝና ባለቤቶችም ቢኾኑ እርጉዛቸውን እስኪወልዱ ድረስ በእነርሱ ላይ ቀልቡ፡፡ ለእናንተም (ልጆቻችሁን) ቢያጠቡላችሁ ምንዳዎቻቸውን ስጧቸው፡፡ በመካከላችሁም በመልካም ነገር ተመካከሩ፡፡ ብትቸጋገሩም ለእርሱ ሌላ (ሴት) ታጠባለታለች፡፡",
            "verse 65:7": "የችሎታ ባለቤት ከችሎታው ይቀልብ፡፡ በእርሱም ላይ ሲሳዩ የተጠበበበት ሰው አላህ ከሰጠው ይቀልብ አላህ ነፍስን የሰጣትን እንጅ አያስገድድም፡፡ አላህ ከችግር በኋላ ምቾትን በእርግጥ ያደርጋል፡፡",
            "verse 65:8": "ከከተማም ከጌታዋ ትዕዛዝ ከመልክተኞቹም ያመጸች፣ ብርቱንም ቁጥጥር የተቆጣጠርናት፣ መጥፎንም ቅጣት የቀጣናት ብዙ ናት፡፡",
            "verse 65:9": "የነገርዋንም ቅጣት ቀመሰች፡፡ የነገርዋም መጨረሻ ከሳራ ኾነ፡፡",
            "verse 65:10": "አላህ ለእነርሱ ብርቱን ቅጣት አዘጋጀ፡፡ እናንተም የአእምሮ ባለቤቶች ሆይ! አላህን ፍሩ፡፡ እነዚያ ያመኑ (ሆይ)! አላህ ወደናንተ ግሳጼን በእርግጥ አወረደ፡፡ መልክተኛን (ላከ)፡፡",
            "verse 65:11": "እነዚያን ያመኑትንና መልካሞችን የሠሩትን ከጨለማዎች ወደ ብርሃን ያወጣ ዘንድ የአላህን አንቀጾች ገላጮች ሲኾኑ በእናንተ ላይ የሚያነብላችሁን (ላከ)፡፡ በአላህም አንቀጾች የሚያምን፣ መልካምን ሥራ የሚሠራም ከሥሮቻቸው ወንዞች የሚፈስሱባቸውን ገነቶች በውስጣቸው ዘለዓለም ዘውታሪዎች ሲኾኑ ያገባዋል፡፡ አላህ ለእርሱ ሲሳይን በእርግጥ አሳመረ፡፡",
            "verse 65:12": "አላህ ያ ሰባትን ሰማያት የፈጠረ ነው፡፡ ከምድርም መሰላቸውን (ፈጥሮአል)፤ በመካከላቸው ትእዛዙ ይወርዳል፡፡ አላህ በነገሩ ሁሉ ላይ ቻይ መኾኑን አላህም በነገሩ ሁሉ በዕውቀት ያካበበ መኾኑን በዕውቀት ያካበበ መኾኑን ታወቁ ዘንድ (ይህንን አሳወቃችሁ)፡፡"
        },
        "Arabic": {
            "verse 65:1": "اًرْمَأ َكِلَٰذ َدْعَب ُثِدْحُي َهَّللا َّلَعَل يِرْدَت اَل ۚ ُهَسْفَن َمَلَظ ْدَقَف ِهَّللا َدوُدُح َّدَعَتَي نَمَو ۚ ِهَّللا ُدوُدُح َكْلِتَو ۚ ٍةَنِّيَبُّم ٍةَشِحاَفِب َنيِتْأَي نَأ اَّلِإ َنْجُرْخَي اَلَو َّنِهِتوُيُب نِم َّنُهوُجِرْخُت اَل ۖ ْمُكَّبَر َهَّللا اوُقَّتاَو ۖ َةَّدِعْلا اوُصْحَأَو َّنِهِتَّدِعِل َّنُهوُقِّلَطَف َءاَسِّنلا ُمُتْقَّلَط اَذِإ ُّيِبَّنلا اَهُّيَأ اَي",
            "verse 65:2": "اًجَرْخَم ُهَّل لَعْجَي َهَّللا ِقَّتَي نَمَو ۚ ِرِخآْلا ِمْوَيْلاَو ِهَّللاِب ُنِمْؤُي َناَك نَم ِهِب ُظَعوُي ْمُكِلَٰذ ۚ ِهَّلِل َةَداَهَّشلا اوُميِقَأَو ْمُكنِّم ٍلْدَع ْيَوَذ اوُدِهْشَأَو ٍفوُرْعَمِب َّنُهوُقِراَف ْوَأ ٍفوُرْعَمِب َّنُهوُكِسْمَأَف َّنُهَلَجَأ َنْغَلَب اَذِإَف",
            "verse 65:3": "اًرْدَق ٍءْيَش ِّلُكِل ُهَّللا َلَعَج ْدَق ۚ ِهِرْمَأ ُغِلاَب َهَّللا َّنِإ ۚ ُهُبْسَح َوُهَف ِهَّللا ىَلَع ْلَّكَوَتَي نَمَو ۚ ُبِسَتْحَي اَل ُثْيَح ْنِم ُهْقُزْرَيَو",
            "verse 65:4": "اًرْسُي ِهِرْمَأ ْنِم ُهَّل لَعْجَي َهَّللا ِقَّتَي نَمَو ۚ َّنُهَلْمَح َنْعَضَي نَأ َّنُهُلَجَأ ِلاَمْحَأْلا ُتاَلوُأَو ۚ َنْضِحَي ْمَل يِئاَّللاَو ٍرُهْشَأ ُةَثاَلَث َّنُهُتَّدِعَف ْمُتْبَتْرا ِنِإ ْمُكِئاَسِّن نِم ِضيِحَمْلا َنِم َنْسِئَي يِئاَّللاَو",
            "verse 65:5": "اًرْجَأ ُهَل ْمِظْعُيَو ِهِتاَئِّيَس ُهْنَع ْرِّفَكُي َهَّللا ِقَّتَي نَمَو ۚ ْمُكْيَلِإ ُهَلَزنَأ ِهَّللا ُرْمَأ َكِلَٰذ",
            "verse 65:6": "ٰىَرْخُأ ُهَل ُعِضْرُتَسَف ْمُتْرَساَعَت نِإَو ۖ ٍفوُرْعَمِب مُكَنْيَب اوُرِمَتْأَو ۖ َّنُهَروُجُأ َّنُهوُتآَف ْمُكَل َنْعَضْرَأ ْنِإَف ۚ َّنُهَلْمَح َنْعَضَي ٰىَّتَح َّنِهْيَلَع اوُقِفنَأَف ٍلْمَح ِتاَلوُأ َّنُك نِإَو ۚ َّنِهْيَلَع اوُقِّيَضُتِل َّنُهوُّراَضُت اَلَو ْمُكِدْجُو نِّم مُتنَكَس ُثْيَح ْنِم َّنُهوُنِكْسَأ",
            "verse 65:7": "اًرْسُي ٍرْسُع َدْعَب ُهَّللا ُلَعْجَيَس ۚ اَهاَتآ اَم اَّلِإ اًسْفَن ُهَّللا ُفِّلَكُي اَل ۚ ُهَّللا ُهاَتآ اَّمِم ْقِفنُيْلَف ُهُقْزِر ِهْيَلَع َرِدُق نَمَو ۖ ِهِتَعَس نِّم ٍةَعَس وُذ ْقِفنُيِل",
            "verse 65:8": "اًرْكُّن اًباَذَع اَهاَنْبَّذَعَو اًديِدَش اًباَسِح اَهاَنْبَساَحَف ِهِلُسُرَو اَهِّبَر ِرْمَأ ْنَع ْتَتَع ٍةَيْرَق نِّم نِّيَأَكَو",
            "verse 65:9": "اًرْسُخ اَهِرْمَأ ُةَبِقاَع َناَكَو اَهِرْمَأ َلاَبَو ْتَقاَذَف",
            "verse 65:10": "(اًرْكِذ ْمُكْيَلِإ ُهَّللا َلَزنَأ ْدَق ۚ اوُنَمآ َنيِذَّلا ِباَبْلَأْلا يِلوُأ اَي َهَّللا اوُقَّتاَف ۖ اًديِدَش اًباَذَع ْمُهَل ُهَّللا َّدَعَأ",
            "verse 65:11": "(اًقْزِر ُهَل ُهَّللا َنَسْحَأ ْدَق ۖ اًدَبَأ اَهيِف َنيِدِلاَخ ُراَهْنَأْلا اَهِتْحَت نِم يِرْجَت ٍتاَّنَج ُهْلِخْدُي اًحِلاَص ْلَمْعَيَو ِهَّللاِب نِمْؤُي نَمَو ۚ ِروُّنلا ىَلِإ ِتاَمُلُّظلا َنِم ِتاَحِلاَّصلا اوُلِمَعَو اوُنَمآ َنيِذَّلا َجِرْخُيِّل ٍتاَنِّيَبُم ِهَّللا ِتاَيآ ْمُكْيَلَع وُلْتَي اًلوُسَّر",
            "verse 65:12": "(اًمْلِع ٍءْيَش ِّلُكِب َطاَحَأ ْدَق َهَّللا َّنَأَو ٌريِدَق ٍءْيَش ِّلُك ٰىَلَع َهَّللا َّنَأ اوُمَلْعَتِل َّنُهَنْيَب ُرْمَأْلا ُلَّزَنَتَي َّنُهَلْثِم ِضْرَأْلا َنِمَو ٍتاَواَمَس َعْبَس َقَلَخ يِذَّلا ُهَّللا"
        },
        "Azerbaijani": {
            "verse 65:1": "Ey Peyğəmbər! Qadınları boşadığınız zaman onları gözləmə müddətlərində boşayın, gözləmə müddətini hesablayın və Rəbbiniz olan Allahdan qorxun. Onları, açıq-aşkar zinakarlıq etmələri istisna olmaqla, öz evlərinizdən qovub çıxartmayın və onlar özləri də çıxmasınlar. Bu, Allahın hüdudlarıdır. Allahın qoyduğu hüdudları aşan kimsə özünə zülm etmiş olar. Sən bilmirsən, ola bilsin ki, Allah bundan sonra başqa bir hökm versin.",
            "verse 65:2": "Gözləmə vaxtı bitdikdə onları şəriətə müvafiq olaraq saxlayın və yaxud onlardan müvafiq qaydada ayrılın. Aranızdan iki ədalətli şahid çağırın və Allah üçün şahidlik edin. Allaha və Axirət gününə iman gətirənlərə verilən nəsihət budur. Allahdan qorxana, Allah çıxış yolu göstərər",
            "verse 65:3": "və ona təsəvvürünə gətirmədiyi bir yerdən ruzi bəxş edər. Kim Allaha təvəkkül etsə, Allah ona kifayət edər. Allah Öz əmrini yerinə yetirəndir. Allah hər şey üçün bir ölçü qoymuşdur.",
            "verse 65:4": "Heyzdən kəsilmiş yaşlı qadınlarınızın iddəsi barəsində şübhəniz varsa, onların, eləcə də hələ heyz görməmiş qızların gözləmə müddəti üç aydır. Hamilə qadınların gözləmə müddəti isə onlar hamiləlikdən azad olana qədərdir. Kim Allahdan qorxarsa, Allah onun işini asanlaşdırar.",
            "verse 65:5": "Bu, Allahın sizə nazil etdiyi əmridir. Kim Allahdan qorxarsa, Allah onun günahlarından keçər və onun mükafatını artırar.",
            "verse 65:6": "Onlara gözləmə müddətləri başa çatanadək imkanınız daxilində öz yaşadığınız yerdə qalmağa yer verin. Sıxışdırmaq məqsədilə onlara zərər yetirməyin. Əgər onlar hamilədirlərsə, hamiləlikdən azad olana qədər onlara malınızdan xərcləyin. Sizin üçün uşaq əmizdirirlərsə, onların haqqını verin. Öz aranızda xoşluqla razılığa gəlin. Bir-birinizi çətinliyə salsanız, uşağı əmizdirməyi başqa bir qadına həvalə edin.",
            "verse 65:7": "Var-dövlət sahibi öz varına görə xərcləsin. İmkanı az olan isə Allahın ona verdiyindən xərcləsin. Allah heç kəsin üzərinə Özünün ona verdiyi nemətdən artıq yük qoymaz. Allah hər bir çətinlikdən sonra asanlıq verir.",
            "verse 65:8": "Neçə-neçə məmləkətlər öz Rəbbinin və Onun elçilərinin əmrinə asi oldu. Biz də onlarla sərt haqq-hesab çəkib onları dəhşətli əzablara düçar etdik.",
            "verse 65:9": "Onlar əməllərinin cəzasını daddılar və aqibətləri ziyana uğramaq oldu.",
            "verse 65:10": "Allah onlar üçün şiddətli əzab hazırladı. Ey iman gətirmiş ağıl sahibləri, Allahdan qorxun! Allah sizə Zikr nazil etmiş,",
            "verse 65:11": "və iman gətirib yaxşı işlər görənləri zülmətlərdən nura çıxartmaq üçün Allahın aydın ayələrini sizə oxuyan bir elçi göndərmişdir. Hər kəs Allaha iman gətirib saleh əməl işləsə, Allah onu içində əbədi qalacağı, ağacları altından çaylar axan Cənnət bağlarına daxil edər. Allah ona gözəl ruzi nəsib etmişdir.",
            "verse 65:12": "Yeddi göyü və yerdən də bir o qədərini yaradan Allahdır. Vəhy onların arasında ona görə nazil olur ki, Allahın hər şeyə qadir olduğunu və Allahın hər şeyi elmi ilə əhatə etdiyini biləsiniz."
        },
        "Bengali": {
            "verse 65:1": "হে নবী, তোমরা যখন স্ত্রীদেরকে তালাক দিতে চাও, তখন তাদেরকে তালাক দিয়ো ইদ্দতের প্রতি লক্ষ্য রেখে এবং ইদ্দত গণনা করো। তোমরা তোমাদের পালনকর্তা আল্লাহকে ভয় করো। তাদেরকে তাদের গৃহ থেকে বহিস্কার করো না এবং তারাও যেন বের না হয় যদি না তারা কোন সুস্পষ্ট নির্লজ্জ কাজে লিপ্ত হয়। এগুলো আল্লাহর নির্ধারিত সীমা। যে ব্যক্তি আল্লাহর সীমালংঘন করে, সে নিজেরই অনিষ্ট করে। সে জানে না, হয়তো আল্লাহ এই তালাকের পর কোন নতুন উপায় করে দেবেন।",
            "verse 65:2": "অতঃপর তারা যখন তাদের ইদ্দতকালে পৌঁছে, তখন তাদেরকে যথোপযুক্ত পন্থায় রেখে দেবে অথবা যথোপযুক্ত পন্থায় ছেড়ে দেবে এবং তোমাদের মধ্য থেকে দু’জন নির্ভরযোগ্য লোককে সাক্ষী রাখবে। তোমরা আল্লাহর উদ্দেশ্যে সাক্ষ্য দিবে। এতদ্দ্বারা যে ব্যক্তি আল্লাহ ও পরকালে বিশ্বাস করে, তাকে উপদেশ দেয়া হচ্ছে। আর যে আল্লাহকে ভয় করে, আল্লাহ তার জন্যে নিস্কৃতির পথ করে দেবেন।",
            "verse 65:3": "এবং তাকে তার ধারণাতীত জায়গা থেকে রিযিক দেবেন। যে ব্যক্তি আল্লাহর উপর ভরসা করে তার জন্যে তিনিই যথেষ্ট। আল্লাহ তার কাজ পূর্ণ করবেন। আল্লাহ সবকিছুর জন্যে একটি পরিমাণ স্থির করে রেখেছেন।",
            "verse 65:4": "তোমাদের স্ত্রীদের মধ্যে যাদের ঋতুবর্তী হওয়ার আশা নেই, তাদের ব্যাপারে সন্দেহ হলে তাদের ইদ্দত হবে তিন মাস। আর যারা এখনও ঋতুর বয়সে পৌঁছেনি, তাদেরও অনুরূপ ইদ্দতকাল হবে। গর্ভবর্তী নারীদের ইদ্দতকাল সন্তানপ্রসব পর্যন্ত। যে আল্লাহকে ভয় করে, আল্লাহ তার কাজ সহজ করে দেন।",
            "verse 65:5": "এটা আল্লাহর নির্দেশ, যা তিনি তোমাদের প্রতি নাযিল করেছেন। যে আল্লাহকে ভয় করে, আল্লাহ তার পাপ মোচন করেন এবং তাকে মহাপুরস্কার দেন।",
            "verse 65:6": "তোমরা তোমাদের সামর্থ?2437;নুযায়ী যেরূপ গৃহে বাস কর, তাদেরকেও বসবাসের জন্যে সেরূপ গৃহ দাও। তাদেরকে কষ্ট দিয়ে সংকটাপন্ন করো না। যদি তারা গর্ভবতী হয়, তবে সন্তানপ্রসব পর্যন্ত তাদের ব্যয়ভার বহন করবে। যদি তারা তোমাদের সন্তানদেরকে স্তন্যদান করে, তবে তাদেরকে প্রাপ্য পারিশ্রমিক দেবে এবং এ সম্পর্কে পরস্পর সংযতভাবে পরামর্শ করবে। তোমরা যদি পরস্পর জেদ কর, তবে অন্য নারী স্তন্যদান করবে।",
            "verse 65:7": "বিত্তশালী ব্যক্তি তার বিত্ত অনুযায়ী ব্যয় করবে। যে ব্যক্তি সীমিত পরিমাণে রিযিকপ্রাপ্ত, সে আল্লাহ যা দিয়েছেন, তা থেকে ব্যয় করবে। আল্লাহ যাকে যা দিয়েছেন, তদপেক্ষা বেশী ব্যয় করার আদেশ কাউকে করেন না। আল্লাহ কষ্টের পর সুখ দেবেন।",
            "verse 65:8": "অনেক জনপদ তাদের পালনকর্তা ও তাঁর রসূলগণের আদেশ অমান্য করেছিল, অতঃপর আমি তাদেরকে কঠোর হিসাবে ধৃত করেছিলাম এবং তাদেরকে ভীষণ শাস্তি দিয়েছিলাম।",
            "verse 65:9": "অতঃপর তাদের কর্মের শাস্তি আস্বাদন করল এবং তাদের কর্মের পরিণাম ক্ষতিই ছিল।",
            "verse 65:10": "আল্লাহ তাদের জন্যে যন্ত্রণাদায়ক শাস্তি প্রস্তত রেখেছেন অতএব, হে বুদ্ধিমানগণ, যারা ঈমান এনেছ, তোমরা আল্লাহকে ভয় কর। আল্লাহ তোমাদের প্রতি উপদেশ নাযিল করেছেন।",
            "verse 65:11": "একজন রসূল, যিনি তোমাদের কাছে আল্লাহর সুস্পষ্ট আয়াতসমূহ পাঠ করেন, যাতে বিশ্বাসী ও সৎকর্মপরায়ণদের অন্ধকার থেকে আলোতে আনয়ন করেন। যে আল্লাহর প্রতি বিশ্বাস স্থাপন করে ও সৎকর্ম সম্পাদন করে, তিনি তাকে দাখিল করবেন জান্নাতে, যার তলদেশে নদী প্রবাহিত, তথায় তারা চিরকাল থাকবে। আল্লাহ তাকে উত্তম রিযিক দেবেন।",
            "verse 65:12": "আল্লাহ সপ্তাকাশ সৃষ্টি করেছেন এবং পৃথিবীও সেই পরিমাণে, এসবের মধ্যে তাঁর আদেশ অবতীর্ণ হয়, যাতে তোমরা জানতে পার যে, আল্লাহ সর্বশক্তিমান এবং সবকিছু তাঁর গোচরীভূত।"
        },
        "Berber Amazigh": {
            "verse 65:1": "A Nnbi! Mara tebrum i tlawin, brut asent mara tâaddi tallit n tarda nnsent. Ëesbet tallit. Ëezzbet i Öebbi, Mass nnwen. Ur tent ssuffu$et si texxamin nnsent, ur d teff$ent, siwa ma, s tidep, ccvent. D tigi ay d tilisa n Öebbi. Win izegren tilisa n Öebbi, ni$ idens imanis. Ur teéôiv ara, ahat Öebbi a d Iazen lameô, ssyen $eô da.",
            "verse 65:2": "Mi ssawvent lajel nnsent, âacôet pent s lewqama, ne$ mfaôaqet yidsent, s lewqama. Awit ed sin inagan iêeqqiyen segwen, a d cehhden zdat Öebbi. Ataya wayen u$uô ppunedôen, wid iumnen s Öebbi akked wass aneggaru. Win ipêezziben i Öebbi, ad as Ildi tibbura,",
            "verse 65:3": "a t I$it s wanda ur iêtim. Win iîîfen di Öebbi, a t Iqennaâ. Ih, Öebbi Issâadday lameô iS. Ni$ Öebbi Iwzen yal cci.",
            "verse 65:4": "I tigad, n tlawin nnwen, i iuysen tarda, ma illa ccekk, tallit ugani nnsent: krav wagguren. Akken i tid ur nebdi tarda. Tid ibbwin tadist, tallit nnsent ar tinnufra nnsent. Win ipêezziben i Öebbi, s lameô iS, ad as Istiser.",
            "verse 65:5": "D wagi ay d lameô n Öebbi i wen d Issers. Win ipêezziben i Öebbi, ad as Ikkes tucmitin is, ad Issali arraz is.",
            "verse 65:6": "Ad asent tefkem tanezdu$t anda tzed$em, akken tewâam. Ur tent îîuôôut s tririt nnsent ar lêeôs. Ma llant s tadist, ûeôôfet fellasent, alamma d tinnufra nnsent. Ma ssuîvent tarwa nnwen, efket asent taqdiât nnsent; mwafaqet s tiéeî. Ma temnamarem, a ppessuîîev tmeîîut nniven.",
            "verse 65:7": "Bu udrim ad iûeôôef segs. Win ixuû ôôeéq ad iûeôôef seg wayen i s Ifka Öebbi. Ur Ipkellif Öebbi taôwiêt, siwa ar ayen i s Ifka. Öebbi ad Issuffe$ laâtab ar tafat.",
            "verse 65:8": "Acêal n temdinin i inuqmen lameô n Mass nnsent akked imazanen iS! Nêuseb itent leêsab uqsiê. Nâaqeb itent s uâaqeb issexven.",
            "verse 65:9": "Jeôôbent lwexda igiten nnsent. D lexsaôa ay d iooa lameô nnsent.",
            "verse 65:10": "Öebbi Ihegga yasen aâaqeb uqsiê. Ëezzbet i Öebbi a yuâqilen iumnen! Ni$ Öebbi Issers awen d asmekti;",
            "verse 65:11": "Amazan i wen immalen issekniyen n Öebbi iberrzen, iwakken ad Issuffe$, si tillas ar tafat, wid iumnen, ixeddmen ayen ilhan. Wid iumnen s Öebbi, ixeddmen ayen ilhan, a ten Issekcem ar leonanat, ddawat sen isaffen ppazzalen, degsen ad wekkôen i lebda. Ni$ Öebbi Igerrez asen ôôeéq.",
            "verse 65:12": "Öebbi i Ixelqen ûa igenwan, akked tmurt am nitni. Lameô iprusu garasen, iwakken a ppeéôem ar Öebbi Izmer i yal cci, u Öebbi Izzi i yal cci s tmusni."
        },
        "Bosnian": {
            "verse 65:1": "O Vjerovjesniče, kada htjednete žene pustiti, vi ih u vrijeme kada su čiste pustite, a onda vrijeme koje treba proći brojte i Allaha, Gospodara svoga, bojte se. Ne tjerajte ih iz stanova njihovih, a ni one neka ne izlaze, osim ako očito sramno djelo učine. To su Allahovi propisi. Onaj koji Allahove propise krši – sâm sebi nepravdu čini. Ti ne znaš, Allah može poslije toga priliku pružiti.",
            "verse 65:2": "I dok traje vrijeme određeno za čekanje, vi ih ili na lijep način zadržite ili se velikodušno od njih konačno rastavite i kao svjedoke dvojicu vaših pravednih ljudi uzmite, i svjedočenje Allaha radi obavite! To je savjet za onoga koji u Allaha i u onaj svijet vjeruje – a onome koji se Allaha boji, On će izlaz naći",
            "verse 65:3": "i opskrbiće ga odakle se i ne nada; onome koji se u Allaha uzda, On mu je dosta. Allah će, zaista, ispuniti ono što je odlučio; Allah je svemu već rok odredio.",
            "verse 65:4": "A one žene vaše koje su nadu u mjesečno pranje izgubile i one koje ga nisu ni dobile, one trebaju čekati tri mjeseca, ako niste znali. Trudne žene čekaju sve dok ne rode. – A onome ko se Allaha boji, On će sve što mu treba učiniti dostupnim.",
            "verse 65:5": "To su, eto, Allahovi propisi, koje vam On objavljuje. A onome ko se bude Allaha bojao – On će preko ružnih postupaka njegovih preći i još mu veliku nagradu dati.",
            "verse 65:6": "Njih ostavite da stanuju tamo gdje i vi stanujete, prema svojim mogućnostima, i ne činite im teškoće zato da biste ih stijesnili. Ako su trudne, dajte im izdržavanje sve dok se ne porode, a ako vam djecu doje, onda im dajte zasluženu nagradu sporazumjevši se međusobno na lijep način. A ako nastanu razmirice, neka mu onda druga doji dijete.",
            "verse 65:7": "Neka imućan prema bogatstvu svome troši, a onaj koji je u oskudici – prema tome koliko mu je Allah dao, jer Allah nikoga ne zadužuje više nego što mu je dao; Allah će, sigurno, poslije tegobe, last dati.",
            "verse 65:8": "A koliko se sela i gradova oglušilo o naređenje Gospodara njihova i poslanīkā Njegovih; Mi ćemo od njih zatražiti da nam potanko račun polože i užasnom kaznom ćemo ih kazniti;",
            "verse 65:9": "oni će pogubnost postupaka svojih iskusiti i propast će njihov kraj biti.",
            "verse 65:10": "Allah je za njih neizdržljivu patnju pripremio, zato se bojte Allaha, o vi koji ste razumom obdareni, vi koji vjerujete! Allah vam je već poslao slavu,",
            "verse 65:11": "Poslanika, koji vam Allahove ajete jasne kazuje, da bi iz tmina na svjetlo izveo one koji vjeruju i dobra djela čine. A onoga koji bude u Allaha vjerovao i dobro činio – uvešće u džennetske bašče, kroz koje će rijeke teći, i vječno i zauvijek će u njima ostati, divnu će mu opskrbu Allah davati.",
            "verse 65:12": "Allah je sedam nebesa i isto toliko zemalja stvorio; Njegovo naređenje na sve se njih odnosi, a nek znate da je Allah kadar sve i da Allah znanjem Svojim sve obuhvaća!"
        },
        "Bulgarian": {
            "verse 65:1": "О, Пророче, ако се развеждате с жените, развеждайте се с тях в срока, затова и пресмятайте срока, и бойте се от Аллах, вашия Господ! Не ги пропъждайте от домовете им, а и те да не излизат, освен ако са сторили явна скверност. Това са границите на Аллах. А който престъпва границите на Аллах, той угнетява себе си. Откъде да знаеш, Аллах може да породи след това и нещо ново.",
            "verse 65:2": "И когато жените изпълнят своя срок, задръжте ги с добро или ги напуснете с добро! И вземете за свидетели двама справедливи мъже измежду вас! И свидетелствайте в името на Аллах! Това е наставление за онзи, който вярва в Аллах и в Сетния ден. За онзи, който се бои от Аллах, Той ще стори изход,",
            "verse 65:3": "и ще му даде препитание оттам, откъдето не е предполагал. И който се уповава на Аллах, Той му е достатъчен. Аллах осъществява Своята повеля. Аллах направи мярка за всяко нещо.",
            "verse 65:4": "А за онези от жените ви, които изгубят надежда за месечното кръвотечение, ако се съмнявате, срокът им е три месеца, [също] и за онези, които все още нямат кръвотечение. А за бременните срокът е, докато родят. За онзи, който се бои от Аллах, Той ще облекчи",
            "verse 65:5": "Това е повелята на Аллах. Низпосла я Той на вас. От онзи, който се бои от Аллах, Той ще отмахне лошите му постъпки и ще увеличи неговата награда.",
            "verse 65:6": "И ги настанявайте [жените в развод], където и вие живеете, според своите възможности, и не им навреждайте, за да ги притесните! А ако са бременни, харчете за тях, докато родят! А ако кърмят децата ви, дайте им тяхната отплата и се разберете с добро! А ако",
            "verse 65:7": "Заможният да даде [за жената и детето] според своите възможности! И комуто препитанието е ограничено, да даде от онова, което Аллах му е дарил! Аллах възлага на всяка душа само според онова, което й е дал. Аллах ще стори облекчение след трудността.",
            "verse 65:8": "И колко селища се възпротивиха на повелята на своя Господ и на Неговите пратеници, и затова им подирихме строга сметка, и ги мъчихме с ужасно мъчение!",
            "verse 65:9": "И вкусиха те пагубността на своето дело. И последицата на делото им бе загуба.",
            "verse 65:10": "Аллах приготви за тях сурово мъчение. Затова се бойте от Аллах, о, разумни хора, които вярвате! Аллах ви низпосла напомняне -",
            "verse 65:11": "[чрез] Пратеник, който ви чете знаменията на Аллах - разясняващи, за да изведе от тъмнините към светлината онези, които вярват и вършат праведни дела. Онези, които вярват в Аллах и вършат праведни дела, Той ще ги въведе в Градините, сред които реки текат",
            "verse 65:12": "Аллах е, Който сътвори седем небеса, и от земята - също толкова. Повелята се спусна сред тях, за да узнаете, че Аллах за всяко нещо има сила и че Аллах обгражда със знание всяко нещо."
        },
        "Chinese": {
            "verse 65:1": "先知啊！当你们休妻的时候，你们当在她们的待婚期之前休她们，你们当计待婚期，当敬畏真主－－－你们的主。你们不要把她们从她们的房里驱逐出门， 她们也不得自己出门，除非她们做了明显的丑事。这是真主的法度，谁超越真主的法度，谁确是不义者。你们不知道，此后，真主或许创造一件事情。",
            "verse 65:2": "当她们满期的时候，你们当善意地挽留她们，或善意地离别她们。你们当以你们的两个公正人为见证，你们当为真主而作证。这是用来教训信仰真主和末日者的。谁敬畏真主，他将为谁辟一条出路。",
            "verse 65:3": "而且从他料想不到的地方供给他。谁信托真主，他将使谁满足。真主确是能达到自己的目的的，真主确已使万物各有定数。",
            "verse 65:4": "你们的妇女中对月经已绝望的，如果你们怀疑，就以三个月为她们的待婚期，还没有月经的，也是这样的；怀孕的，以分娩为满期。谁敬畏真主，他将使谁顺利。",
            "verse 65:5": "这是真主所降示你们的法令，谁敬畏真主，他将免除谁的罪恶，而且赏赐他重大的报酬。",
            "verse 65:6": "你们当依自己的能力而使她们住在你们所住的地方，你们不要妨害她们，而使她们烦闷。如果她们有孕，你们就应当供给她们，直到她们分娩。如果她们为你们哺乳，你们应当报酬她们，并且应当依正义而相商。如果你们的意见不合，就让别的妇人为他哺乳。",
            "verse 65:7": "教富裕的人用他的富裕的财产去供给， 教窘迫的人用真主所赏赐他的去供给。真主只依他所赋予人的能力而加以责成。在窘迫之后，真主将给宽裕。",
            "verse 65:8": "有许多城市的居民，曾违抗他们的主和众使者的命令，我将严格地审训他们，严厉的惩罚他们。",
            "verse 65:9": "他们将尝试他们行为的恶果，他们的行为的结局是亏折的。",
            "verse 65:10": "真主已为他们预备了严厉的刑罚。信道的有理智的人们啊！你们当敬畏真主。真主确已降示你们一种教训，",
            "verse 65:11": "并且派遣一位使者，对你们宣读真主的许多明显的迹象，以便他使信道而且行善的人们，脱离重重黑暗，走入光明。谁信道而且行善，真主将使谁入下临诸河的乐园，而永居其中。真主必定赏赐他们优美的给养。",
            "verse 65:12": "真主创造了七层天，和同样层数的大地，天命通过七层天而下降，以便你们知道，真主对于万事是全能的，真主是周知万物的。"
        },
        "Danish": {
            "verse 65:1": "O, profeet, indien gij van de vrouwen scheidt, scheidt dan van haar voor de vastgestelde periode en berekent de periode, en vreest Allah uw Heer. Verdrijft haar niet uit haar vertrekken, noch behoeven zij uit zichzelf weg te gaan (vóór de bepaalde termijn) tenzij zij zich openlijk onbetamelijk gedragen. Dit zijn Allah`s vastgestelde grenzen; en wie de door Allah bepaalde grenzen overschrijdt doet zeker zijn eigen ziel onrecht aan. Gij weet niet; misschien zal Allah daarna iets beters teweegbrengen",
            "verse 65:2": "Als zij dan haar termijn bereikt hebben, neemt haar op een vriendelijke manier terug, of scheidt van haar op een behoorlijke wijze en roept twee rechtvaardigen vanuit uw midden tot getuigen en laat dit een ware getuigenis zijn voor Allah. Dit is een vermaning voor hem die in Allah en de laatste Dag gelooft. En voor hem die Allah vreest, zal Hij een uitweg bereiden",
            "verse 65:3": "En Hij zal hem onderhouden vanwaar gij het niet verwacht. En voor hem, die zijn vertrouwen in Allah stelt, is Allah toereikend. Voorwaar, Allah volbrengt Zijn voornemen, Hij heeft voor alles een maatstaf bepaald",
            "verse 65:4": "En indien gij twijfelt aangaande diegenen uwer vrouwen, die geen menstruatie meer verwachten, haar (wacht) periode is drie maanden, hetzelfde geldt ook voor degenen die haar menstruatie nog niet hebben gehad. En de wachtperiode voor de zwangeren duurt tot zij verlost zijn. En degenen die Allah vrezen, zal Hij van het nodige voorzien door Zijn gebod",
            "verse 65:5": "Dat is het bevel van Allah dat Hij u heeft geopenbaard. En wie Allah vreest, van hem zal Hij zijn fouten wegnemen en zijn loon zal vergroot worden",
            "verse 65:6": "Herbergt haar (van wie gij scheidt) in de huizen waar gij vertoeft, overeenkomstig uw middelen; en doet haar geen kwaad om het haar moeilijk te maken. En als zij zwanger zijn, onderhoudt haar tot zij verlost zijn. En als zij haar kind voor u zogen geeft haar vergoeding en beraadslaagt tezamen in vriendelijkheid; maar als gij het lastig voor elkander maakt laat dan een andere vrouw het kind zogen",
            "verse 65:7": "Laat hij die overvloed heeft geven uit zijn overvloed. En laat hij wiens middelen beperkt zijn, geven overeenkomstig hetgeen Allah hem heeft gegeven. Allah belast geen ziel boven hetgeen Hij haar heeft gegeven. Allah zal weldra verlichting verlenen na ongemak",
            "verse 65:8": "Hoe vele steden kwamen niet in opstand tegen het gebod van hun Heer en van Zijn boodschappers! Wij riepen ze dan tot een strenge verantwoording en kastijdden haar met strenge kastijding",
            "verse 65:9": "Zo ondervonden zij het kwade gevolg van hun gedrag en het einde (hiervan) was de ondergang",
            "verse 65:10": "Allah heeft hun een strenge straf bereid; vreest daarom Allah, o gij mensen van verstand, die gelooft! Allah heeft inderdaad een vermaning tot u nedergezonden",
            "verse 65:11": "Een boodschapper, die aan u de duidelijke woorden van Allah voordraagt, opdat hij degenen die geloven en goede daden verrichten uit de duisternis in het licht moge brengen; en wie in Allah gelooft en goed doet, hem zal Hij in tuinen toelaten waar doorheen rivieren stromen om daarin voor eeuwig te vertoeven. Allah heeft hem inderdaad een voortreffelijk onderhoud geschonken",
            "verse 65:12": "Allah is Hij Die de zeven hemelen schiep, en van de aarde desgelijks. Het gebod daalt in hun midden neder, opdat gij moogt weten dat Allah macht heeft over alle dingen, en dat Allah alle dingen in zijn kennis omvat"
        },
        "Dutch": {
            "verse 65:1": "O Profeet als jullie van de vrouwen scheiden, scheidt dan van hen met inachtneming van hun perioden, en berekent de perioden (precies) en vreest Allah, jullie Heer. Verwijdert hen niet uit hun huizen en zij mogen (deze) niet verlaten, behalve wanneer zij duidelijk zedeloosheden begaan. Dat zijn de Wetten van Allah en wie de Wetten van Allah overschrijdt, die heeft waarlijk zichzelf onrecht aangedaan. Jij weet niet of Allah misschien daarna een nieuwe omstandigheid zal doen ontstaan.",
            "verse 65:2": "Wanneer zij dan hun termijn bereikt hebben, behoudt hen dan volgens de voorschriften of scheidt van hen volgens de voorschriften, en neemt twee rechtvaardige personen als getuigen. En weest oprecht in de getuigenis voor Allah. Dat is waartoe jullie gemaand worden, (voor) wie gelooft in Allah en in de Laatste Dag. En wie Allah vreest die zal Hij een oplossing geven.",
            "verse 65:3": "En Hij voorziet hem van waar hij het niet verwacht, en (voor) wie op Allah vertrouwt, is Hij voldoende. Voorwaar, Allah voert Zijn zaak uit. Waarlijk, Allah heeft voor alle zaken een maatgeving bepaald.",
            "verse 65:4": "En voor hen die (gezien hun leeftijd) onzeker zijn omtrent de menstruatie van jullie vrouwen; als jullie (mannen) twijfelen is hun wachttijd drie maanden. En (dit geldt ook voor) hen die nog geen menstruatie hebben. Voor hen die zwanger zijn geldt de wachttijd totdat zij hebben gebaard wat zij dragen. En wie Allah vreest, voor hem zal Hij zijn zaak makkelijk maken.",
            "verse 65:5": "Dat is het bevel van Allah, dat Hij aan jullie neerzendt. En wie Allah vreest, voor hem zal Hij zijn zonden uitwissen en hem een geweldige beloning geven.",
            "verse 65:6": "Laat hen (gedurende de wachttijd) wonen zoals jullie zelf wonen, naar jullie vermogens, en kwelt hen niet om hen in het nauw te drijven. En als zij zwanger zijn, voorziet hun dan tot zij gebaard hebben wat zij dragen. En als zij (de kinderen) voor jullie zogen, geeft hun dan hun vergoeding en pleegt onderling overleg op een redelijke wijze. En als jullie moeilijkheden ondervinden, laat dan een andere (vrouw het kind) voor hem zogen.",
            "verse 65:7": "Laat de welvarende besteden volgens zijn welvaart; en degene wiens voorzieningen beperkt zijn, laat hem besteden van wat Allah hem heeft gegeven. Allah belast geen ziel dan volgens wat Hij haar heeft gegeven. Allah zal na moeilijkheden gemak schenken.",
            "verse 65:8": "En hoeveel steden zijn er niet in opstand gekomen tegen het bevel van hun Heer en Zijn Boodschappers, waarop Wij met hen afrekenden met een harde afrekening. En Wij hebben hen met een verschrikkelijke bestraffing bestraft.",
            "verse 65:9": "Zij proefden toen het kwaad van hun wandaden, en het einde van hun zaak was een verlies.",
            "verse 65:10": "Allah heeft voor hen een harde bestraffing bereid. Vreest daarom Allah, O bezitters van verstand die geloven! Waarlijk, Allah heeft tot jullie een Vermaning gezonden.",
            "verse 65:11": "Een Boodschapper die voor jullie de verduidelijkende Verzen van Allah voordraagt, om degenen die geloven en goede daden verrichten uit de duisternissen naar het licht te voeren. En wie in Allah gelooft en goede daden verricht: Hij zal hem Tuinen (het Paradijs) doen binnengaan waar de rivieren onder door stromen. Zij zijn daarin eeuwig levenden, voor altijd. Allah heeft hem waarlijk een goede voorziening gegeven.",
            "verse 65:12": "Allah is Degene Die de zeven hemelen heeft geschapen en zo ook de aarde. De beschikking daalt tussen hen (hemel en aarde) neer, opdat jullie weten dat Allah de Almachtige over alle zaken is en dat Allah alle zaken in kennis omvat."
        },
        "English": {
            "verse 65:1": "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period, and fear Allah, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allah. And whoever transgresses the limits of Allah has certainly wronged himself. You know not; perhaps Allah will bring about after that a [different] matter.",
            "verse 65:2": "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allah. That is instructed to whoever should believe in Allah and the Last day. And whoever fears Allah - He will make for him a way out",
            "verse 65:3": "And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.",
            "verse 65:4": "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease.",
            "verse 65:5": "That is the command of Allah, which He has sent down to you; and whoever fears Allah - He will remove for him his misdeeds and make great for him his reward.",
            "verse 65:6": "Lodge them [in a section] of where you dwell out of your means and do not harm them in order to oppress them. And if they should be pregnant, then spend on them until they give birth. And if they breastfeed for you, then give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for the father another woman.",
            "verse 65:7": "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease.",
            "verse 65:8": "And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.",
            "verse 65:9": "And it tasted the bad consequence of its affair, and the outcome of its affair was loss.",
            "verse 65:10": "Allah has prepared for them a severe punishment; so fear Allah, O you of understanding who have believed. Allah has sent down to you the Qur'an.",
            "verse 65:11": "[He sent] a Messenger [Muhammad] reciting to you the distinct verses of Allah that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allah and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allah will have perfected for him a provision.",
            "verse 65:12": "It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge."
        },
        "Filipino": {
            "verse 65:1": "O Propeta! Kung kayo ay magdidiborsyo ng mga babae, inyong diborsyuhin sila sa kanilang Iddah (natatakdaang panahon), at inyong bilangin ng buong katumpakan ang kanilang Iddah (natatakdaang panahon), at inyong pangambahan (o mga Muslim) si Allah na inyong Panginoon, at sila ay huwag ninyong itaboy sa kani-kanilang tahanan, at huwag din naman na hayaang sila ay umalis, maliban na lamang kung sila ay nagkakasala ng lantad na kalaswaan (bawal na pakikipagtalik). At ito ang mga hangganan na itinakda ni Allah at sinuman ang lumabag sa mga hangganan ni Allah ay katotohanang nagpahamak ng kanyang sariling kaluluwa. Kayo (na nagdiborsyo ng kanyang asawa) ay hindi nakakabatid na maaaring si Allah, makaraan ito, ay magkaloob ng bagong bagay na mangyayari (alalaong baga, ang ibalik siyang muli [asawa] sa inyo kung ito ang una at pangalawang pagdidiborsyo",
            "verse 65:2": "Kaya’t kung naganap na nila ang kanilang natatakdaang panahon, mangyaring muli na sila ay inyong tanggapin o maghiwalay kayo sa makatarungang paraan at kumuha kayo ng dalawang saksi mula sa inyo (mga Muslim) na makatarungan, at inyong itampok ang katibayan sa harap ni Allah. Ito ang mga tagubilin na ibinigay sa kanya na sumasampalataya kay Allah at sa Huling Araw. At sinuman ang mangamba kay Allah at panatilihin ang kanyang tungkulin sa Kanya, Siya ang magbibigay sa kanya ng lunas sa lahat ng mga kahirapan",
            "verse 65:3": "At ipagkakaloob Niya (ito) sa kanya mula (sa panggagalingan) na hindi niya napag-aakala. At kung sinuman ang magkaloob ng kanyang pagtitiwala kay Allah ay sapat na si Allah para sa kanya. Katotohanang si Allah ay walang pagsalang makapagpapatupad ng Kanyang naisin. Katotohanang sa lahat ng bagay, si Allah ay nagtakda ng ganap at tumpak na sukat",
            "verse 65:4": "At sa inyong mga kababaihan na lumagpas na sa panahon ng kanilang buwanang dalaw, ang Iddah (natatakdaang panahon) para sa kanila, kung kayo ay may alinlangan (tungkol sa kanilang panahon), ay tatlong buwan, at sa mga wala pang buwanang dalaw (alalaong baga, bata pa o matanda na), ang kanilang Iddah (natatakdaang panahon) ay gayon din naman, malibang ang sanhi ay kamatayan. At sa mga may dinadalang buhay sa kanilang sinapupunan (kahit na sila ay diborsyada na o patay na ang kanilang asawa), ang kanilang Iddah (natatakdaang panahon), ay hanggang sila ay makapagluwal ng kanilang dinadala. At sa mga may pangangamba kay Allah (at nagpapanatili ng kanyang tungkulin sa Kanya), ay gagawin Niya na magaan sa kanila ang daan",
            "verse 65:5": "Ito ang Pag-uutos ni Allah na Kanyang ipinanaog sa inyo, at sinuman ang may pagkatakot kay Allah (at nagpapanatili ng kanyang tungkulin sa Kanya) ay lulunasan Niya ang kanyang mga karamdaman at suliranin (mga kasalanan) at pag-iibayuhin Niya ang kanyang gantimpala",
            "verse 65:6": "Hayaan ang mga nadiborsyong babae ay manahan kung saan kayo tumitira, ng ayon sa inyong kakayahan, at sila ay huwag ninyong pakitunguhan sa masamang paraan, upang sila ay mapilitan na umalis. At kung sila ay may dinadalang buhay sa kanilang sinapupunan, kung gayon, kayo ay gumugol ng inyong yaman sa kanila hanggang sila ay makapagluwal ng kanilang dinadala, at kung sila ay nagpapasuso ng inyong supling ay inyong bigyan sila ng kabayaran at kayo ay magpaalalahanan (at magpayo) sa isa’t isa kung ano ang makatarungan at makatuwiran, datapuwa’t kung kayo ay malagay sa kahirapan, hayaan ang ibang babae ang magpasuso para sa kanya (sa kapakanan ng ama ng bata)",
            "verse 65:7": "Hayaan ang lalaki na may kakayahan ay gumugol ng ayon sa kanyang kakayahan, at ang lalaki na ang pinagkukunan (ng kabuhayan) ay sapat-sapat lamang, hayaang gumugol siya ng ayon sa anumang ipinagkaloob sa kanya ni Allah. Si Allah ay hindi magbibigay ng pasakit (o dalahin) sa isang tao ng higit sa ipinagkaloob Niya sa kanya. At pagkatapos ng kahirapan, si Allah ang magkakaloob sa kanya ng kaginhawahan",
            "verse 65:8": "At gaano karami sa sangkatauhan ang lantarang sumasalansang sa Pag-uutos ng kanyang Panginoon at ng Kanyang mga Tagapagbalita, at Aming tinawag sila sa matinding pagsusulit (alalaong baga, kaparusahan sa mundong ito). At ipapataw Namin sa kanila ang isang kalagim-lagim na kaparusahan (sa Impiyerno sa Kabilang Buhay)",
            "verse 65:9": "At kanilang nalasap ang masamang kinasapitan ng kanilang mga gawa (kawalan ng pananalig) at ang kinahinatnan ng kanilang kawalan ng pananalig ay pagkalugi (kapinsalaan sa buhay na ito at walang hanggang kapahamakan sa Kabilang Buhay)",
            "verse 65:10": "Si Allah ang naghanda para sa kanila ng isang kasakit-sakit na kaparusahan (sa Kabilang Buhay). Kaya’t inyong pangambahan si Allah at panatilihin ang inyong tungkulin sa Kanya, O mga tao na may pang-unawa at nagsisampalataya! Sapagka’t si Allah ay katotohanang nagpapanaog sa inyo ng isang Paala-ala (ang Qur’an)",
            "verse 65:11": "(At nagparating din sa inyo) ng isang Tagapagbalita (Muhammad), na nagpapaala- ala at dumadalit sa mga Talata ni Allah (ang Qur’an), na nagtataglay ng malilinaw na paliwanag upang kanyang maakay ang mga sumasampalataya at nagsisigawa ng katuwiran mula sa kailaliman ng kadiliman (ng pagsamba sa mga diyus-diyosan at kawalan ng pananalig) sa kaliwanagan (Kaisahan ni Allah at Tunay na Pananampalataya). At sa mga nananampalataya kay Allah at nagsisigawa ng kabutihan ay Kanyang tatanggapin sila sa mga Hardin na sa ilalim nito ay may mga ilog na nagsisidaloy (Paraiso) upang manahan dito magpakailanman. Katotohanang si Allah ang nagkaloob sa kanila ng katangi-tanging kabuhayan",
            "verse 65:12": "Si Allah ang lumikha ng pitong kalangitan at ng kalupaan sa gayong ding bilang (pito). Ang Kanyang pag- uutos ay bumababa sa pagitan nila (ng langit at lupa), upang inyong maalaman na si Allah ang may kapangyarihan sa lahat ng bagay at si Allah ang Nakakaalam ng lahat ng bagay sa (Kanyang karunungan)"
        },
        "French": {
            "verse 65:1": "O Prophète! Quand vous répudiez les femmes, répudiez-les conformément à leur période d'attente prescrite; et comptez la période; et craignez Allah votre Seigneur. Ne les faites pas sortir de leurs maisons, et qu'elles n'en sortent pas, à moins qu'elles n'aient commis une turpitude prouvée. Telles sont les lois d'Allah. Quiconque cependant transgresse les lois d'Allah, se fait du tort à lui-même. Tu ne sais pas si d'ici là Allah ne suscitera pas quelque chose de nouveau!",
            "verse 65:2": "Puis quand elles atteignent le terme prescrit, retenez-les de façon convenable, ou séparez-vous d'elles de façon convenable; et prenez deux hommes intègres parmi vous comme témoins. Et acquittez-vous du témoignage envers Allah. Voilà ce à quoi est exhorté celui qui croit en Allah et au Jour dernier. Et quiconque craint Allah, Il Lui donnera une issue favorable,",
            "verse 65:3": "et lui accordera Ses dons par [des moyens] sur lesquels il ne comptait pas. Et quiconque place sa confiance en Allah, Il [Allah] lui suffit. Allah atteint ce qu'Il Se propose, et Allah a assigné une mesure à chaque chose.",
            "verse 65:4": "Si vous avez des doutes à propos (de la période d'attente) de vos femmes qui n'espèrent plus avoir de règles, leur délai est de trois mois. De même pour celles qui n'ont pas encore de règles. Et quant à celles qui sont enceintes, leur période d'attente se terminera à leur accouchement. Quiconque craint Allah cependant, Il lui facilite les choses.",
            "verse 65:5": "Tel est le commandement d'Allah qu'Il a fait descendre vers vous. Quiconque craint Allah cependant, Il lui efface ses fautes et lui accorde une grosse récompense.",
            "verse 65:6": "Et faites que ces femmes habitent où vous habitez, et suivant vos moyens. Et ne cherchez pas à leur nuire en les contraignant à vivre à l'étroit. Et si elles sont enceintes, pourvoyez à leurs besoins jusqu'à ce qu'elles aient accouché. Puis, si elles allaitent [l'enfant né] de vous, donnez-leur leurs salaires. Et concertez vous [à ce sujet] de façon convenable. Et si vous rencontrez des difficultés réciproques, alors, une autre allaitera pour lui.",
            "verse 65:7": "Que celui qui est aisé dépense de sa fortune; et que celui dont les biens sont restreints dépense selon ce qu'Allah lui a accordé. Allah n'impose à personne que selon ce qu'Il lui a donné, et Allah fera succéder l'aisance à la gêne.",
            "verse 65:8": "Que de cités ont refusé avec insolence le commandement de leur Seigneur et de Ses messagers! Nous leur en demandâmes compte avec sévérité, et les châtiâmes d'un châtiment inouï.",
            "verse 65:9": "Elles goûtèrent donc la conséquence de leur comportement. Et le résultat final de leurs actions fut [leur] perdition.",
            "verse 65:10": "Allah a préparé pour eux un dur châtiment. Craignez Allah donc, ô vous qui êtes doués d'intelligence, vous qui avez la foi. Certes, Allah a fait descendre vers vous un rappel,",
            "verse 65:11": "un Messager qui vous récite les versets d'Allah comme preuves claires, afin de faire sortir ceux qui croient et accomplissent les bonnes œuvres des ténèbres à la lumière. Et quiconque croit en Allah et fait le bien, Il le fait entrer aux Jardins sous lesquels coulent les ruisseaux, pour y demeurer éternellement. Allah lui a fait une belle attribution.",
            "verse 65:12": "Allah qui a créé sept cieux et autant de terres. Entre eux [Son] commandement descend, afin que vous sachiez qu'Allah est en vérité Omnipotent et qu'Allah a embrassé toute chose de [Son] savoir."
        },
        "Fulah": {
            "verse 65:1": "Eehey ma annabi si on ceerii suddiiɓe ceereeɓe e edda mum en tonnge edda o, kulee Alla joomi mon wotee njaltineeɓe e cuuɗi mum en wotoɓe njaltu si wonah ɓe mbaɗ pankare peeñɗe ko ɗiin ngoni keeri Alla kala jawtuɗo keerol Alla o tooñi hoore makko, a anndah yaama de Alla waɗata caggal ɗuum fiyaaku",
            "verse 65:2": "Si ɓe yottinii edda mum en nanngireeɓe no moƴƴi wollo ceerdonɓe no moƴƴi,ceednon seedeeji ɗiɗi ummaade e mon ndarnee seedanfaagal fii Alla ko ɗuum woni ko waajete wonande oon goonɗinɗo Alla e ñalnde sakkatiinde kala deentiiɗo Alla,Alla waɗana mbo yaltirde",
            "verse 65:3": "O arsikina mbo to o sikkaana, kala bakkaliiɗo e Alla yonii mbo, pellet yamiroore Alla nde ko yottotoonde, Alla waɗanii kala huunde fotde mum",
            "verse 65:4": "ɓeen suddiiɓe mon fiɓtiiɓe fiilayru si on cikkatiima edda mum en ko lebbi tati e ɓeen ɓe piilataako edda mum en ko lebbi tati, debadeedi en noon edda maɓɓe gasata ko nde ɓe njibini, kala kulɗo Alla O waɗana mbo newaare e fiyaaku makko",
            "verse 65:5": "ɗuum ko ñaawoore Alla O tellaniinde e mon, kala kulɗo Alla O hafrana mbo bakkatuuji makko, O mawninana mbo njoɓdi",
            "verse 65:6": "Koɗneeɓe ɗo koɗɗon fotde kattane mon wotee loreeɓe ngam ɓittinandeɓe, nafqeeɓe haa ɓe keɓto tawde koɓe korinoo ɓe, si wonii ɓe muyninanii on njonnee ɓe njoɓdi mum en njandire moƴƴere hakkunde mon, si on cattiraama yo goɗɗo muynin mbo",
            "verse 65:7": "Yo nafqu gala e ngalu makko he, oon paaɗaaɗo noon yo nafqu e ko Alla totti mbo ko,Alla fawatah hay fittaandu si wonah ko tottindu ko, ma Alla waɗ caggal satteende newuya",
            "verse 65:8": "Heewii saare saliinde yamiroore joom mum e nelaaɓo mum, min kaasbii nde haasbo sattungo Min leptinnde lepte bonɗe",
            "verse 65:9": "Nde meeɗi lepte golle mayre laati batte fiyaaku mayre ko perte",
            "verse 65:10": "Alla heblaniɓe lepte cattuɗe kulee Alla onon joman en hakkillaaji ɓeen goonɗinɓe, Alla tellinii e mum en ko siftinta",
            "verse 65:11": "Nelaaɗo taratooɗo e mon aayeeje ɓannguɗe ngam O yaltina ɓeen goonɗin ɓe golluɓe golle lobbe ummaade e niwre faade e annoore, kala goonɗinɗo Alla golli ko moƴƴi O naatna mbo aljannaaji ɗi caatli ilata les majji ɓe nduumo toon, ko goongo Alla moƴƴinanii mbo arsuka. @Corrected",
            "verse 65:12": "Alla tagɗo kammuuli jeeɗiɗi e leydi yeru majji, yamiroore Alla na tello hakkunde majji ngam nganndon wonde Alla ko kattanɗo kala huunde Alla fiiltariima kala huunde e ganndal"
        },
        "German": {
            "verse 65:1": "O Prophet, wenn ihr euch von Frauen scheidet, dann scheidet euch von ihnen auf ihre Wartezeit hin, und berechnet die Wartezeit. Und fürchtet Allah, euren Herrn. Weist sie nicht aus ihren Häusern aus; sie sollen auch nicht selbst ausziehen, außer, sie begehen etwas klar Abscheuliches. Dies sind Allahs Grenzen",
            "verse 65:2": "Wer aber Allahs Grenzen übertritt, der fügt sich ja selbst Unrecht zu. Du weißt nicht, vielleicht führt Allah danach eine neue Lage herbei. Wenn sie dann ihre Frist erreichen, so behaltet sie in rechtlicher Weise oder trennt euch von ihnen in rechtlicher Weise. Und nehmt zwei gerechte Personen von euch zu Zeugen, und legt das Zeugnis (in Aufrichtigkeit) um Allahs willen ab. Damit wird ermahnt, wer an Allah und den Jüngsten Tag glaubt. Und wer Allah fürchtet, dem schafft Er einen Ausweg",
            "verse 65:3": "und gewährt ihm Versorgung, von wo (aus) er damit nicht rechnet. Und wer sich auf Allah verläßt, dem ist Er seine Genüge. Allah wird gewiß (die Durchführung) seine(r) Angelegenheit erreichen. Allah legt ja für alles ein Maß fest.",
            "verse 65:4": "Und diejenigen von euren Frauen, die keine Monatsblutung mehr erwarten, wenn ihr im Zweifel seid, so ist ihre Wartezeit drei Monate; und ebenso derjenigen, die (noch) keine Monatsblutung haben. Diejenigen, die schwanger sind - ihre Frist ist (erreicht), wenn sie mit dem niederkommen, was sie (in ihren Leibern) tragen. Und wer Allah fürchtet, dem schafft Er in seiner Angelegenheit Erleichterung.",
            "verse 65:5": "Das ist Allahs Anordnung, die Er zu euch (als Offenbarung) herabgesandt hat. Und wer Allah fürchtet, dem tilgt Er seine bösen Taten und dem gewährt Er großartigen Lohn.",
            "verse 65:6": "Laßt sie dort wohnen, wo ihr (selbst) wohnt, von dem, was ihr euch leisten könnt. Und fügt ihnen keinen Schaden zu, um sie in die Enge zu treiben. Und wenn sie schwanger sind, dann gebt für sie (das Nötige) aus, bis sie mit dem niederkommen, was sie (in ihren Leibern) tragen. Wenn sie für euch (das Kind) stillen, dann gebt ihnen ihren Lohn, und beratet untereinander (darüber) in rechtlicher Weise. Wenn ihr aber einander Schwierigkeiten bereitet, dann wird (das Kind) für ihn eine andere stillen.",
            "verse 65:7": "Der Wohlhabende soll entsprechend seinem Wohlstand (die Aufwendungen) ausgeben. Und wem seine Versorgung bemessen (zugeteilt) wurde, der soll (eben) von dem ausgeben, was Allah ihm gegeben hat. Allah erlegt keiner Seele mehr auf als das, was Er ihr gegeben hat. Allah wird nach Schwierigkeit Erleichterung schaffen.",
            "verse 65:8": "Und wieviele Städte lehnten sich gegen den Befehl ihres Herrn und Seiner Gesandten auf, worauf Wir sie einer strengen Abrechnung unterzogen und mit entsetzlicher Strafe straften.",
            "verse 65:9": "Da kosteten sie die schlimmen Folgen ihres Verhaltens, und das Ende ihres Verhaltens war (nur) Verlust.",
            "verse 65:10": "Allah hat für sie strenge Strafe bereitet. So fürchtet Allah, o die ihr Verstand besitzt und die ihr glaubt. Allah hat ja zu euch eine Ermahnung (als Offenbarung) herabgesandt,",
            "verse 65:11": "einen Gesandten, der euch Allahs Zeichen verliest, die alles klar machen, um diejenigen, die glauben und rechtschaffene Werke tun, aus den Finsternissen ins Licht hinauszubringen. Und wer an Allah glaubt und rechtschaffen handelt, den wird Er in Gärten eingehen lassen, durcheilt von Bächen, ewig und auf immer darin zu bleiben. Allah hat ihm (damit) ja eine schöne Versorgung gewährt.",
            "verse 65:12": "Allah ist es, Der sieben Himmel erschaffen hat, und von der Erde gleich (viel). Der Befehl (Allahs) kommt wahrhaftig zwischen ihnen herab, damit ihr wißt, daß Allah zu allem die Macht hat und daß Allah ja alles mit Seinem Wissen umfaßt."
        },
        "Hausa": {
            "verse 65:1": "Ya kai Annabi! Idan kun saki mãtã, sai ku sake su ga iddarsu, kuma ku ƙididdige iddar. Kuma ku bi Allah Ubangijinku da taƙawa. Kada ku fitar da su daga gidãjensu, kuma kada su fita fãce idan sunã zuwa da wata alfãshã bayyananna. Kuma waɗancan iyakõkin Allah ne. Kuma wanda ya ƙẽtare iyãkõkin Allah, to, lalle ya zãlunci kansa. Ba ka sani ba ɗammãnin Allah zai fitar da wani al'amari a bãyan haka.",
            "verse 65:2": "Sa'an nan idan sun isa ga ajalinsu (na idda) sai ku riƙe su da abin da aka sani kõ ku rabu da su da abin da aka sani kuma ku shaidar da mãsu adalci biyu daga gare ku. Kuma ku tsayar da shaidar dõmin Allah. Wancan ɗinku anã yin wa'azi da shi ga wanda ya kasance yanã yin ĩmãni da Allah da Rãnar Lãhira. Kuma wanda ya bi Allah da taƙawa, Allah zai sanya masa mafita.",
            "verse 65:3": "Kuma Ya arzũta shi daga inda bã ya zato. Kuma wanda ya dõgara ga Allah, to, Allah ne Ma'ishinsa. Lalle Allah Mai iyar da umurninSa ne. Haƙĩƙa Allah Ya sanyama'auni ga dukan kõme.",
            "verse 65:4": "Kuma waɗanda suka yanke ɗammãni daga haila daga mãtanku, idan kun yi shakka, to, iddarsu watã uku ce da waɗanda ba su yi haila ba. Kuma ma'abũta cikinna ajalinsu, (shi ne) cewa su haifi cikinnansu. Kuma wanda ya bi Allah da taƙawa, (Allah) zai sanya masa wani sauƙi daga al'amarinsa.",
            "verse 65:5": "Wancan umurnin Allah ne, Ya saukar da shi zuwa gare ku. Kuma wanda ya bi Allah da taƙawa, Allah zai kankare masa mũnãnan ayyukansa, kuma Ya girmama masa sãkamako.",
            "verse 65:6": "Ku zaunar da su daga inda kuka zaunar daga gwargwadon sãmunku. Kuma kada ku cũce su dõmin ku ƙuntata a kansu. Kuma idan sun kasance ma'abũta ciki, sai ku ciyar da su har su haifi cikinsu. Sa'an nan idan sun shãyar da mãma sabõda ku, sai ku bã su tsãdõdinsu. Kuma ku yi shãwara a tsakãninku bisa abin da aka sani. Kuma idan kun nũna talauci to wata mace zã ta shãyar da mãma sabõda shi (mijin).",
            "verse 65:7": "Sai mawadãci ya ciyar daga wadãtarsa kuma wanda aka ƙuntata masa arzikinsa, to, sai ya ciyar daga abin da Allah Ya bã shi. Allah bã Ya kallafa wa wani rai fãce abin da Ya bã shi. Allah zai sanya sauƙi a bãyan tsanani.",
            "verse 65:8": "Kuma da yawa daga alƙarya wadda ta yi tsaurin kai daga barin umurnin Ubangijinta da ManzanninSa, sai Muka yi mata hisãbi, hisãbi mai tsanani, kuma Muka, azabtar da ita azãba abar ƙyãma.",
            "verse 65:9": "Sa'an nan ta ɗanɗana masĩfar al'amarinta. kuma ƙarshen al'amarinta ya kasance hasãra,",
            "verse 65:10": "Allah Ya yi musu tattalin wata azãba mai tsanani. Sabõda haka ku bi Allah da taƙawa, yã ma'abũta hankula, waɗanda suka yi ĩmãni! Haƙĩƙa Allah Ya saukar da wata tunãtarwa zuwa gare ku.",
            "verse 65:11": "Manzo, yanã karãtun ãyõyin Allah bayyananu a kanku dõmin Ya fitar da waɗanda suka yi ĩmãni kuma suka aikata ayyukan ƙwarai daga duffai zuwa ga haske. Kuma wanda ya yi ĩmãni da Allah ya aikata aikin ƙwarai Allah zai shigar da shi gidãjen Aljanna ƙoramu nã gudãna daga ƙarƙashnsu sunã mãsu dawwama a cikinsu har abada. Haƙĩƙa Allah Yã kyautata masa arziki.",
            "verse 65:12": "Allah, wanda Ya halitta bakwai ɗin sammai kuma daga ƙasã kwatankwacinsu, umuruinSa yanã ta sauka a tsakaninsu dõmin ku san lalle Allah Mai ĩkon yi ne akan dukan kõme, kuma lalle Allah, haƙĩƙa Ya kẽwaye ga dukan kõme da sani."
        },
        "Hindi": {
            "verse 65:1": "ऐ रसूल (मुसलमानों से कह दो) जब तुम अपनी बीवियों को तलाक़ दो तो उनकी इद्दत (पाकी) के वक्त तलाक़ दो और इद्दा का शुमार रखो और अपने परवरदिगार ख़ुदा से डरो और (इद्दे के अन्दर) उनके घर से उन्हें न निकालो और वह ख़ुद भी घर से न निकलें मगर जब वह कोई सरीही बेहयाई का काम कर बैठें (तो निकाल देने में मुज़ायका नहीं) और ये ख़ुदा की (मुक़र्रर की हुई) हदें हैं और जो ख़ुदा की हदों से तजाउज़ करेगा तो उसने अपने ऊपर आप ज़ुल्म किया तो तू नहीं जानता यायद ख़ुदा उसके बाद कोई बात पैदा करे (जिससे मर्द पछताए और मेल हो जाए)",
            "verse 65:2": "तो जब ये अपना इद्दा पूरा करने के करीब पहुँचे तो या तुम उन्हें उनवाने शाइस्ता से रोक लो या अच्छी तरह रूख़सत ही कर दो और (तलाक़ के वक्त) अपने लोगों में से दो आदिलों को गवाह क़रार दे लो और गवाहों तुम ख़ुदा के वास्ते ठीक ठीक गवाही देना इन बातों से उस शख़्श को नसीहत की जाती है जो ख़ुदा और रोजे अाख़ेरत पर ईमान रखता हो और जो ख़ुदा से डरेगा तो ख़ुदा उसके लिए नजात की सूरत निकाल देगा",
            "verse 65:3": "और उसको ऐसी जगह से रिज़क़ देगा जहाँ से वहम भी न हो और जिसने ख़ुदा पर भरोसा किया तो वह उसके लिए काफी है बेशक ख़ुदा अपने काम को पूरा करके रहता है ख़ुदा ने हर चीज़ का एक अन्दाज़ा मुक़र्रर कर रखा है",
            "verse 65:4": "और जो औरतें हैज़ से मायूस हो चुकी अगर तुम को उनके इद्दे में शक़ होवे तो उनका इद्दा तीन महीने है और (अला हाज़ल क़यास) वह औरतें जिनको हैज़ हुआ ही नहीं और हामेला औरतों का इद्दा उनका बच्चा जनना है और जो ख़ुदा से डरता है ख़ुदा उसके काम मे सहूलित पैदा करेगा",
            "verse 65:5": "ये ख़ुदा का हुक्म है जो ख़ुदा ने तुम पर नाज़िल किया है और जो ख़ुदा डरता रहेगा तो वह उसके गुनाह उससे दूर कर देगा और उसे बड़ा दरजा देगा",
            "verse 65:6": "मुतलक़ा औरतों को (इद्दे तक) अपने मक़दूर मुताबिक दे रखो जहाँ तुम ख़ुद रहते हो और उनको तंग करने के लिए उनको तकलीफ न पहुँचाओ और अगर वह हामेला हो तो बच्चा जनने तक उनका खर्च देते रहो फिर (जनने के बाद) अगर वह बच्चे को तुम्हारी ख़ातिर दूध पिलाए तो उन्हें उनकी (मुनासिब) उजरत दे दो और बाहम सलाहियत से दस्तूर के मुताबिक बात चीत करो और अगर तुम बाहम कश म कश करो तो बच्चे को उसके (बाप की) ख़ातिर से कोई और औरत दूध पिला देगी",
            "verse 65:7": "गुन्जाइश वाले को अपनी गुन्जाइश के मुताबिक़ ख़र्च करना चाहिए और जिसकी रोज़ी तंग हो वह जितना ख़ुदा ने उसे दिया है उसमें से खर्च करे ख़ुदा ने जिसको जितना दिया है बस उसी के मुताबिक़ तकलीफ़ दिया करता है ख़ुदा अनकरीब ही तंगी के बाद फ़राख़ी अता करेगा",
            "verse 65:8": "और बहुत सी बस्तियों (वाले) ने अपने परवरदिगार और उसके रसूलों के हुक्म से सरकशी की तो हमने उनका बड़ी सख्ती से हिसाब लिया और उन्हें बुरे अज़ाब की सज़ा दी",
            "verse 65:9": "तो उन्होने अपने काम की सज़ा का मज़ा चख लिया और उनके काम का अन्जाम घाटा ही था",
            "verse 65:10": "ख़ुदा ने उनके लिए सख्त अज़ाब तैयार कर रखा है तो ऐ अक्लमन्दों जो ईमान ला चुके हो ख़ुदा से डरते रहो ख़ुदा ने तुम्हारे पास (अपनी) याद क़ुरान और अपना रसूल भेज दिया है",
            "verse 65:11": "जो तुम्हारे सामने वाज़ेए आयतें पढ़ता है ताकि जो लोग ईमान लाए और अच्छे अच्छे काम करते रहे उनको (कुफ़्र की) तारिक़ियों से ईमान की रौशनी की तरफ़ निकाल लाए और जो ख़ुदा पर ईमान लाए और अच्छे अच्छे काम करे तो ख़ुदा उसको (बेहिश्त के) उन बाग़ों में दाखिल करेगा जिनके नीचे नहरें जारी हैं और वह उसमें अबादुल आबाद तक रहेंगे ख़ुदा ने उनको अच्छी अच्छी रोज़ी दी है",
            "verse 65:12": "ख़ुदा ही तो है जिसने सात आसमान पैदा किए और उन्हीं के बराबर ज़मीन को भी उनमें ख़ुदा का हुक्म नाज़िल होता रहता है - ताकि तुम लोग जान लो कि ख़ुदा हर चीज़ पर कादिर है और बेशक ख़ुदा अपने इल्म से हर चीज़ पर हावी है"
        },
        "Indonesian": {
            "verse 65:1": "Hai Nabi, apabila kamu menceraikan isteri-isterimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) iddahnya (yang wajar) dan hitunglah waktu iddah itu serta bertakwalah kepada Allah Tuhanmu. Janganlah kamu keluarkan mereka dari rumah mereka dan janganlah mereka (diizinkan) ke luar kecuali mereka mengerjakan perbuatan keji yang terang. Itulah hukum-hukum Allah dan barangsiapa yang melanggar hukum-hukum Allah, maka sesungguhnya dia telah berbuat zalim terhadap dirinya sendiri. Kamu tidak mengetahui barangkali Allah mengadakan sesudah itu sesuatu hal yang baru.",
            "verse 65:2": "Apabila mereka telah mendekati akhir iddahnya, maka rujukilah mereka dengan baik atau lepaskanlah mereka dengan baik dan persaksikanlah dengan dua orang saksi yang adil di antara kamu dan hendaklah kamu tegakkan kesaksian itu karena Allah. Demikianlah diberi pengajaran dengan itu orang yang beriman kepada Allah dan hari akhirat. Barangsiapa bertakwa kepada Allah niscaya Dia akan mengadakan baginya jalan keluar.",
            "verse 65:3": "Dan memberinya rezeki dari arah yang tiada disangka-sangkanya. Dan barangsiapa yang bertawakkal kepada Allah niscaya Allah akan mencukupkan (keperluan)nya. Sesungguhnya Allah melaksanakan urusan yang (dikehendaki)Nya. Sesungguhnya Allah telah mengadakan ketentuan bagi tiap-tiap sesuatu.",
            "verse 65:4": "Dan perempuan-perempuan yang tidak haid lagi (monopause) di antara perempuan-perempuanmu jika kamu ragu-ragu (tentang masa iddahnya), maka masa iddah mereka adalah tiga bulan; dan begitu (pula) perempuan-perempuan yang tidak haid. Dan perempuan-perempuan yang hamil, waktu iddah mereka itu ialah sampai mereka melahirkan kandungannya. Dan barang -siapa yang bertakwa kepada Allah, niscaya Allah menjadikan baginya kemudahan dalam urusannya.",
            "verse 65:5": "Itulah perintah Allah yang diturunkan-Nya kepada kamu, dan barangsiapa yang bertakwa kepada Allah, niscaya Dia akan menghapus kesalahan-kesalahannya dan akan melipat gandakan pahala baginya.",
            "verse 65:6": "Tempatkanlah mereka (para isteri) di mana kamu bertempat tinggal menurut kemampuanmu dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka. Dan jika mereka (isteri-isteri yang sudah ditalaq) itu sedang hamil, maka berikanlah kepada mereka nafkahnya hingga mereka bersalin, kemudian jika mereka menyusukan (anak-anak)mu untukmu maka berikanlah kepada mereka upahnya, dan musyawarahkanlah di antara kamu (segala sesuatu) dengan baik; dan jika kamu menemui kesulitan maka perempuan lain boleh menyusukan (anak itu) untuknya.",
            "verse 65:7": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya. Dan orang yang disempitkan rezekinya hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya. Allah tidak memikulkan beban kepada seseorang melainkan sekedar apa yang Allah berikan kepadanya. Allah kelak akan memberikan kelapangan sesudah kesempitan.",
            "verse 65:8": "Dan berapalah banyaknya (penduduk) negeri yang mendurhakai perintah Tuhan mereka dan Rasul-rasul-Nya, maka Kami hisab penduduk negeri itu dengan hisab yang keras, dan Kami azab mereka dengan azab yang mengerikan.",
            "verse 65:9": "Maka mereka merasakan akibat yang buruk dari perbuatannya, dan adalah akibat perbuatan mereka kerugian yang besar.",
            "verse 65:10": "Allah menyediakan bagi mereka azab yang keras, maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal; (yaitu) orang-orang yang beriman. Sesungguhnya Allah telah menurunkan peringatan kepadamu,",
            "verse 65:11": "(Dan mengutus) seorang Rasul yang membacakan kepadamu ayat-ayat Allah yang menerangkan (bermacam-macam hukum) supaya Dia mengeluarkan orang-orang yang beriman dan beramal saleh dari kegelapan kepada cahaya. Dan barangsiapa beriman kepada Allah dan mengerjakan amal yang saleh niscaya Allah akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Sesungguhnya Allah memberikan rezeki yang baik kepadanya.",
            "verse 65:12": "Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi. Perintah Allah berlaku padanya, agar kamu mengetahui bahwasanya Allah Maha Kuasa atas segala sesuatu, dan sesungguhnya Allah ilmu-Nya benar-benar meliputi segala sesuatu."
        },
        "Italian": {
            "verse 65:1": "O Profeta, quando ripudiate le vostre donne, ripudiatele allo scadere del termine prescritto e contate bene il termine. Temete Allah vostro Signore e non scacciatele dalle loro case, ed esse non se ne vadano, a meno che non abbiano commesso una provata indecenza. Ecco i termini di Allah. Chi oltrepassa i termini di Allah, danneggia se stesso. Tu non sai: forse in questo periodo Allah farà succedere qualcosa.",
            "verse 65:2": "Quando poi siano giunte al loro termine, trattenetele convenientemente o separatevi da esse convenientemente. Richiedete la testimonianza di due dei vostri uomini retti, che testimonino davanti ad Allah. Ecco a che cosa è esortato chi crede in Allah e nell'Ultimo Giorno. A chi teme Allah, Egli apre una via d'uscita,",
            "verse 65:3": "e gli concede provvidenze da dove non ne attendeva. Allah basta a chi confida in Lui. In verità Allah realizza i Suoi intenti. Allah ha stabilito una misura per ogni cosa.",
            "verse 65:4": "Se avete qualche dubbio a proposito di quelle delle vostre donne che non sperano più nel mestruo, il loro termine sia di tre lunazioni. Lo stesso valga per quelle che non hanno ancora il mestruo. Quelle che sono incinte avranno per termine il parto stesso. A chi teme Allah, Egli facilita i suoi intenti.",
            "verse 65:5": "Questo è l'Ordine che Allah ha fatto scendere su di voi. A chi teme Allah, Egli cancella i peccati e aumenta la sua ricompensa.",
            "verse 65:6": "Fatele abitare dove voi stessi abitate, secondo i vostri mezzi.",
            "verse 65:7": "L'agiato spenda della sua agiatezza, colui che ha scarse risorse spenda di quello che Allah gli ha concesso. Allah non impone a nessuno se non in misura di ciò che Egli ha concesso. Allah farà seguire il benessere al disagio.",
            "verse 65:8": "Quante città si mostrarono orgogliose di fronte all'ordine del loro Signore e dei Suoi messaggeri! Le costringemmo ad un rendiconto rigoroso, e le castigammo di un orribile castigo.",
            "verse 65:9": "Gustarono le conseguenze della loro condotta e l'esito della loro condotta fu la dannazione.",
            "verse 65:10": "Allah ha preparato loro un severo castigo. Temete dunque Allah, o dotati d'intelletto, voi che avete la fede. Invero Allah ha fatto scendere su di voi un Monito,",
            "verse 65:11": "un Messaggero che vi recita i versetti espliciti di Allah, per trarre dalle tenebre alla luce coloro che credono e compiono il bene. Chi crede in Allah e compie il bene, Egli lo farà entrare nei Giardini in cui scorrono i ruscelli, dove rimarrà in perpetuo. A costui Allah ha concesso buona provvidenza.",
            "verse 65:12": "Allah è Colui Che ha creato sette cieli e altrettante terre. Scende il Suo Ordine tra di loro, affinché sappiate che in verità Allah è onnipotente e che Allah abbraccia nella Sua Scienza ogni cosa."
        },
        "Japanese": {
            "verse 65:1": "預言者よ，あなたがたが妻と離婚する時は，定められた期限に離別しその期間を（正確に）計算しなさい。あなたがたの主アッラーを畏れなさい。かの女らに明白な不貞がない限り，（期限満了以前に）家から追い出してはならない。また（かの女らを）出て行かせてはならない。これらはアッラーの掟である。アッラーの掟に背く者は，確かに自分の魂を損う者である。あなたは知らないが，アッラーはこの後で，新しい事態を引き起こされるかも知れない。",
            "verse 65:2": "その期限が満了した時は，立派に留めるか，または立派に別れなさい。そしてあなたがたの中から公正な2人の証人を立て，アッラーに向い証言させなさい。これは，アッラーと最後の日を信じる者に与えられた訓戒である。またアッラーを畏れる者には，かれは（解決の）出ロを備えられる。",
            "verse 65:3": "かれが考えつかないところから，恵みを与えられる。アッラーを信頼する者には，かれは万全であられる。本当にアッラーは，必ず御意を完遂なされる。アッラーは凡てのことに，一定の期限を定められる。",
            "verse 65:4": "あなたがたの妻の中，月経の望みの無い者に就いてもし疑いを抱くならば，（命じられた）定めの期間は3ヶ月である。（まだ）月経の無い者に就いても（同様である）。妊娠している者の場合，その期間はかの女が重荷をおろすまでである。本当にアッラーを畏れる者には，かれは事を容易になされる。",
            "verse 65:5": "これはアッラーが，あなたがたに下された命令である。アッラーを畏れる者には，かれはその諸悪を払われ，かれに対する報奨を増大されるであろう。",
            "verse 65:6": "かの女たちを，あなたがたの暮している所であなたがたの力に応じて住まわせなさい。かの女らを窮屈にして，困らせてはならない。もし妊娠しているならば，出産するまでの費用を，かの女たちに与えなさい。もしかの女たちがあなたがたのため（子）に授乳する場合は，その報酬を与え，あなたがたの間で，正しく相談しなさい。あなたがた（夫婦）がもし話がまとまらなければ，外の女が授乳してもよい。",
            "verse 65:7": "裕福な者には，その裕福さに応じて支払わせなさい。また資力の乏しい者には，アッラーがかれに与えたものの中から支払わせなさい。アッラーは，誰にもかれが与えられた以上のものを課されない。アッラーは，困難の後に安易を授けられる。",
            "verse 65:8": "どんなに多くの町が，主とかれの使徒たちの命令に背いたことであろう。それでわれは厳しく清算し，みせしめの懲罰でかれらを罰した。",
            "verse 65:9": "こうしてかれらは，その行いの悪い結果を味わい，最後には結局滅亡した。",
            "verse 65:10": "アッラーはかれらのために，厳しい懲罰を準備なされる。だから信仰し，思慮ある人びとよ，アッラーを畏れなさい。アッラーは，確にあなたがたに教訓を下され，",
            "verse 65:11": "使徒を遣わした。かれがアッラーの印をあなたがたに読誦し，明白に解明するのは，信仰して善行をなす者を，暗黒の深みから光明の中に導き出すためである。凡そアッラーを信仰して善行に勤しむ者は，下に川が流れる楽園に入らされ，永遠にその中に住むのであろ。本当にアッラーは，かれらのために善い御恵みを下される。",
            "verse 65:12": "アッラーこそは，7層の天と同様に（7層の）大地を，創造なされた方である。（アッラーの）御命令はそれらの間から下って来る。それで，本当にアッラーは，凡てのことに全能であり，またアッラーの御知識が，凡ての事物を確かに包囲なされることを，あなたに分からせるためである。"
        },
        "Jawa": {
            "verse 65:1": "Hai Nabi (Muhammad) manawa sira arep megat wong wadon rabinira, pegaten nalikane suci (ora haidh), supaya banjur tumindak ’iddahe (watese kena rabi maneh). Iddah mau cathetana sing terang. Sira bektia ing Allah Pangeranira. Qadon kang sira pegat sadurunge entek ’iddahe aja sira tundhung saka omahe, Si wadon mau banjur ngelakoni hala kang ina banjur ditundhung. Kang mangkono iku pranataning Allah. Dene sing sapa nerak pranataning Allah, tetep wong nganiaya awake dhewe. Sira mangsa weruha bok menawa sawise pegatan Allah nganakake sebab liya",
            "verse 65:2": "Dene yen wis cedhak wewangen ’iddah sarta talake durung entek tur tanpa pamancal, sira kena mengku wong wadon mau kelawan becik, utawa nglestarekake pegate kelawan becik lan haneksekna marang kanca nira wong loro kang adil, manawa sira dadi saksi neksenana sumurup ngistokake parentahing Allah aja karana apa - apa. Pitutur iku tumrap marang wong kang pracaya ing Allah lan ngandel bakal anane dina qiyamatl Sing sapa bekti ing ALlah, Allah paring luar wong mau saka kasusahan (paring dalan gampang)",
            "verse 65:3": "Lan paring rizki kang tanpa dikira - kira marang wong mau, sing sapa pasrah ing Allah, Allah paring cukup. Satemene sabarang kersane Allah mesthi kelakon. Allah nemtokake samu barang ana wawatesane",
            "verse 65:4": "Sarupane wong wadon kancanira kang wus ilang pangarep - arepe anggarap sari, manawa sira semang - semang lan iddahe telung sasi, mangkono uga (tumrap) kang ora tau anggarap sari. Dene tumrape wong wadon kang ngandhek wawangeing mangsane yaiku yen wis nglahirake kandhutane, lan sing sapa tuhu - tuhu ing (wajibe maring) Allah, Panjenengane bakal paring gampang sabarang prakarane",
            "verse 65:5": "Mangkono iku parintahing Allah didhawuhake marang sira, sing sapa bekti ing Allah, Allah muwung sakabehane halane wong mau, lan anggedhekake ganjarane wong mau",
            "verse 65:6": "Wong wadon kang wis sira pegat mau enggonanan ing omah dhuwekira murwat karo kasugihanira, lan aja sira gawe pituna mundhak ngerupekake dheweke. Dene yen wong wadon mau ngandhek, nafkahana nganti salahira kandhungane. lan yen dheweke nusoni anak ira, wenehana pituwase. Lan padha tutur - tinuturana antaranira nglakoni kabecikan. Manawa sira ora sarujuk bayi sira hiyakna ing wong wadon liya",
            "verse 65:7": "Supaya wong sugih mragadana samurwate sugihe, dene sing sapa rizkine mung cumpen mragadana samurwate paparinge Allah marang wong iku. Allah ora meksa marang wong kajaba mung samurwate peperainge Allah marang wong mau. Allah bakal paring gampang sawise ngelakoni kangelan",
            "verse 65:8": "Pira wae akehe wong padesan kang padha duraka ora ngistokake parintahing Allah Pangerane lan parentahe utusaning Allah, wusana Ingsun timbang abot lan padha Ingsun patrapi siksa neraka kang gegirisi",
            "verse 65:9": "Banjur padha ngrasakake patrapaning keluputane dadi wekasane kapitunan",
            "verse 65:10": "Allah ngancam siksa kang abot marang wong mau mulane sira padha bektia ing Allah, he para kang duwe akal",
            "verse 65:11": "Para mukmin, Allah wis andhawuhake pitutur (al-Quran) lan ngutus Rasul kang ngundhangake ayate Allah kang cetha marang sira, kanggo ngetokake para wong kang mukmin (angestu) lan kang padha ngelakoni panggawe becik saka pepeteng (bodho) marang pepadhang (kaweruh) sing sapa percaya ing Allah lan ngelakoni panggawe becik Allah bakal nglebokake wong mau marang suwarga kang ana bengawane mili ana ing kono padha langgeng. Allah paring rizki becik marang wong mau",
            "verse 65:12": "Allah kang gawe langit pitu lan bumi sapadhane iku kattetepake Allah bakal tansah tumurun ing antarane (bumi lan langit) supaya sira padha weruha yen Allah iku temen ngelmu (Ne) anglimputi samu barang"
        },
        "Kazakh": {
            "verse 65:1": "Ей, Пайғамбар! Қашан әйелдерді талақ етсеңдер, оларды белгіленген иддаларында бекітілген күту мерзімінде талақ етіңдер және идданы күту мерзімін есептеңдер. Әрі өздеріңнің Раббың -Аллаһтан Оның тыйымдарынан қорқып, сақтаныңдар! Ашық жиіркенішті іс істемесе оларды үйлерден шығарып жібермеңдер және олар өздері де шықпасын. Міне, осы Аллаһтың белгілеген шектері. Кім Аллаһтың шектерінен тыйымдарынан аттаса, шын мәнінде, өзіне өзі әділетсіздік етеді. Сен білмейсің, мүмкін Аллаһ осыдан кейін басқа жағдай пайда етер",
            "verse 65:2": "Ал қашан олардың мерзімдері жетсе, оларды құпталған бойынша қалдырыңдар немесе олармен құпталған бойынша ажырасыңдар әрі араларыңнан әділ болған екі ер адамды куә етіңдер және куәлікті Аллаһ үшін орындаңдар. Аллаһқа және Ақирет күніне сенгенге осымен насихат етіледі. Кім Аллаһтан Оның тыйғандарынан қорқып сақтанса, Ол оған шығатын жол жасайды",
            "verse 65:3": "Әрі Ол оған оның өзі ойламаған жақтан ризық береді. Ал, кім Аллаһқа жүгініп, Оған ісін тапсырса тәуекел етсе , Ол оған жеткілікті. Ақиқатында Аллаһ ісін соңына жеткізуші. Аллаһ әрбір нәрсеге өлшем белгілеген",
            "verse 65:4": "әйелдеріңнен етеккірден күдер үзгендерінен, егер күмәндансаңдар, олардың иддасы үш ай және етеккірі жоқтардың да. Ал жүкті әйелдердің иддасы құрсақтарындағыны босанғандарына дейін. Кім Аллаһтан Оның жазасынан қорқып, сақтанса, Ол оған ісін жеңілдетеді",
            "verse 65:5": "Бұл Аллаһтың сендерге түсірген бұйрығы. Кім Аллаһтан Оның тыйғанынан қорқып, сақтанса, Ол оның жамандықтарын кешіреді және оған берілетін сыйын ұлғайтады",
            "verse 65:6": "Өздерің тұратын жерден оларға шамаларыңа қарай тұрақ беріңдер. Әрі оларға қысым көрсету үшін олар өздері кетсін деп зиян жасамаңдар. Ал, егер олар жүкті болса, құрсақтарындағыны босанғандарына дейін оларға қаражат жұмсаңдар. Егер олар сендер үшін босанғаннан кейін балаларыңды емізетін болса, оларға ақыларын беріңдер және өзара құпталғанға сай кеңесіңдер. Ал егер келісе алмасаңдар, онда ол үшін баланы басқа әйел емізеді",
            "verse 65:7": "Жағдайы жеткілікті адам өзінде бардан жұмсасын. Ал, ризық-несібесі шектеулі адам, өзіне Аллаһтың бергенінен жұмсасын. Аллаһ ешбір жанға, Өзі оған бергенінен артық жүктемейді. Аллаһ қиыншылықтан кейін жеңілдік жасайды",
            "verse 65:8": "Қаншама елді мекендер Раббысының әміріне және Оның елшілеріне қарсы шықты. Сонда Біз оларды қатаң есеппен есепке тарттық әрі оларды ауыр азапқа душар еттік",
            "verse 65:9": "Олар істерінің жазасын татты және олардың істерінің соңы зиян шегу болды",
            "verse 65:10": "Аллаһ оларға қатты азап дайындады. Ей, ақыл иелері иманға келгендер, Аллаһтан Оның жазасынан қорқып, сақтаныңдар, Аллаһ сендерге Еске салушыны Құранды түсірді",
            "verse 65:11": "сендерге Аллаһтың анық аяттарын оқитын Елшіні жіберді иманға келіп және ізгі амал жасағандарды қараңғылықтардан жарыққа шығару үшін. Кім Аллаһқа сенсе және ізгі амал жасаса, Ол оны астынан өзендерағып жататын, олар онда мәңгі қалатын Жәннаттағы бақтарға кіргізеді. Шын мәнінде, Аллаһ оның үлесін көркем етті",
            "verse 65:12": "Аллаһ жеті аспанды әрі жерден де сондай жаратқан. Оның бұйрығы олардың аспандар мен жердің арасында түседі, Аллаһтың әрбір нәрсені Жасай алушы екенін әрі Аллаһтың барлық нәрсені біліммен қамтығанын білулерің үшін"
        },
        "Korean": {
            "verse 65:1": "선지자여! 그대들이 아내들과 이혼하고자 할 때는 그녀들의 숙려 기간을 고려하여 이혼하고 숙려 기간을 계산하라. 그대들 주님을 두려워하라. 그녀들이 확실히 추악한 일을 범하지 않은 이상 그대들은 그녀들의 집에서 그녀들을 쫓아내지 말며 그녀들도 (집에서) 나가지 않노라. 이것은 하나님의 경계이니 하나님의 경계를 넘는 자는 진실로 자신을 부당히 다룬 것이라. 그대는 모르니, 하나님께서 그 후에 어떠한 일을 만드실 수도 있노라선지자여 너희가 여성과 이 혼 하고자 할 경우 정하여진 기간 을 두고 이혼하되 그 정하여진 기간을 헤아릴 것이며 너희 주님 을 두려워 할 것이라 그녀들을 가 정으로부터 내보지말며 그녀들 스 스로 나가서도 아니되나니 이는 그녀들이 간음하지 않도록 함이라 이것들이 하나님의 법이거늘 누구 든 이 법을 벗어난 자는 자기 스스로를 욕되게 한 자라 그후 하나님 께서 다시 재결합하게 하려 하시 는 지를 너희는 모르기 때문이라",
            "verse 65:2": "그리하여 그녀들이 자신의 기간에 도달하였다면 그대들은 합당한 방식으로 그녀들을 간직하거나 합당한 방식으로 그녀들과 헤어지라. 그리고 그대들 중 두 명의 공정한 사람을 증인으로 세우고 하나님을 위한 증언을 실시하라. 이를 통하여 하나님과 최후의 날을 믿는 자는 가르침을 얻을 것이라. 하나님을 두려워하는 자가 있다면 그분께서는 그를 위해 출구를 마련해 주실 것이라그녀들이 정하여진 기간을 채 웠을 때 정당히 재결합을 하던지 아니면 정당히 혜어지되 너희 중 에 건전한 두명의 남자 증인을 불러 하나님을 위해 증언하라 그 러함이 하나님과 내세를 믿는 자 에게 주어진 교훈이라 하나님을 두려워 한 자를 위해 하나님은 항 상 하나의 길을 준비하시니라",
            "verse 65:3": "그리고 그분께서는 그가 예상치 못한 곳에서 그에게 양식을 베푸실 것이라. 하나님께 의탁하는 자, 그는 그분만으로 충분하도다. 실로 하나님께서는 그분의 일을 이루시는 분이라. 실로 하나님께서는 모든 것에 알맞은 양을 두셨도다그분은 생각지 아니했던 일용할 양식을 주시니라 하나님께 의 탁하는 자 누구든 하나님으로써 충분하니라 실로 하나님은 그분의 목적을 온전히 달성하시나니 하나 님은 모든 것에 일정한 한계를 두 셨노라",
            "verse 65:4": "그대들의 아내들 중 생리에 관해 단념한 여성은, 그대들이 의심이 든다면, 그녀의 숙려 기간은 삼개월이며 생리를 하지 않는 여성도 마찬가지라. 그리고 임신한 여성은 태아를 낳을 때까지가 그녀의 기간이라. 하나님을 두려워하는 자가 있다면 그분께서는 그를 위해 그의 일에 평이함을 두실 것이라생리 기간이 끝나버린 여성이라도 너희가 의심할 경우는 그녀 들을 위해 정해진 기간은 석달이 며 생리에 이르지 아니한 여성도 마찬가지라 또한 임신한 여성의 기간은 출산할 때까지로 하나님을 두려워 한자 하나님은 그의 일을 편하게 하여 주시니라",
            "verse 65:5": "이것이 하나님께서 그대들에게 내리신 명령이라. 하나님을 두려워하는 자가 있다면 그분께서는 그의 악행을 용서해 주실 것이며 그를 위하여 보상을 크게 해 주실 것이라그것이 하나님께서 너희에게 계시한 명령이라 하나님을 두려워 하는 자 하나님은 그의 잘못을 거 두어 주시고 그에게 큰 보상을 주 시니라",
            "verse 65:6": "가진 역량껏 그대들이 거주하고 있는 곳에서 그녀들이 머물게 하라. 그녀들을 해침으로써 그녀들에게 압박을 가하지 말라. 만약 그녀들이 임신한 여성이라면 출산할 때까지 그녀들을 부양하라. 그리하여 그녀들이 그대들을 위해 젖을 물렸다면 그대들은 그녀들에게 보상을 주되 그대들 간에 합당한 방식으로 서로 협의하라. 만약 그대들 사이에 마찰이 있다면 그를 위해 다른 여성이 젖을 물릴 것이라너희 생활 수단에 따라 너희 가 사는 것처럼 이혼될 여성도 살 게 하라 그리고 그녀들을 해치지 말라 너희가 그녀들을 곤경에 빠 뜨리게 하지 않도록 하기위해서라 그녀들이 임신중이라면 출산을 할 때까지 비용을 지불할 것이며 그 녀들이 젖을 먹인다면 그녀들에게 보상을 지불하고 서로가 의무를 다하도록 할 것이며 그렇게 할 수 없을 경우 유모로 하여금 젖을 먹이도록 하라",
            "verse 65:7": "풍족한 자는 그의 풍족함으로 부양하고, 양식이 한정된 자는 하나님께서 그에게 주신 것으로 부양토록 하라. 하나님께서는 영혼에게 오직 주신 만큼만 짐 지우시노라. 하나님께서는 어려움 후에 평이함을 두실 것이라능력에 따라 지불하되 그의 능력이 한정된 자는 하나님께서 그에게 베풀 것 중에서 지불하도 록 하라 하나님은 그분께서 베푸 신 것 이상의 무거운 짐을 어느 누구에게도 부과하지 아니 하시니 하나님은 고난을 쉬움으로 거두어 주시니라",
            "verse 65:8": "수많은 마을이 그들 주님과 그분의 사도들의 명령에 교만해 하였고 이에 나는 그들을 심판함에 가혹히 심판하였고 그들을 벌함에 매섭게 벌하였도다얼마나 많은 백성들이 주님의 명령과 선지자에게 거역하였더뇨 그래서 하나님은 그들을 엄격한 계산으로 가혹한 응벌을 내리시니라",
            "verse 65:9": "그리하여 그들은 자신의 참담한 결말을 맛보았으며 그들 일의 최후는 손실이었도다그리하여 그들은 그들 행위의 사악한 결과를 맛보았으며 그들 행위의 결과는 멸망이었노라",
            "verse 65:10": "하나님께서는 그들을 위해 혹독한 벌을 준비하셨노라. 그러니 슬기를 지닌 믿는 자들이여, 하나님을 경외하라. 실로 하나님께서는 그대들에게 메시지를 내리셨노라하나님은 그들을 위하여 가 혹한 응벌을 준비하셨나니 하나님 을 두려워 하라 믿음으로 이해하 는 사람들이여 하나님에서 너희에게 교훈을 계시하였노라",
            "verse 65:11": "(하나님께서는) 그대들에게 하나님의 분명한 징표를 낭송하는 사도(를 보내셨노라). 이는 그가 (하나님과 사도를) 믿고 선행을 실천하는 자들을 암흑에서 광명으로 꺼내기 위함이라. 하나님을 믿고 선행을 실천하는 자가 있다면 그분께서는 그를 천국에 들게 하실 것이니 그 아래로부터는 강이 흐르며 그들은 그 안에서 영원히 머물 것이라. 실로 하나님께서는 그를 위해 양식을 훌륭히 하셨도다그는 하나님의 분명한 말씀을 낭송할 한 선지자로 믿음으로 선을 행하는 자를 암흑에서 광명 으로 인도하리라 하나님을 믿고 선을 행하는 자 하나님은 그로 하여 강물이 흐르는 천국으로 들게 하여 그곳에서 영생케 하리라 하 나님은 그를 위해 가장 훌륭한 보상을 베푸시노라",
            "verse 65:12": "일곱 개의 하늘을 창조하시고 지구로부터 그와 유사한 것을 창조하신 분이 하나님이시라. (하나님의) 명령이 그(하늘과 지구) 사이에 내려오니, 실로 하나님께서는 모든 것이 가능한 분이시며 실로 하나님께서는 모든 것을 지식으로 아우르고 계심을 그대들이 알도록 하기 위함이라하나님께서 철천을 창조하 사 대지도 그와 같이 창조하신 분이시라 그 사이를 통하여 그분의 계시가 계속되었나니 하나님은 모든 일에 전지전능하시고 모든 것 이 그분의 지혜안에 있다는 것을 너희가 알도록 함이라"
        },
        "Kurdish": {
            "verse 65:1": "Pêxember! gava we jina berda, vêca hûn wan di danê (paqijiya) wan de berdin û hûn wî danî bijmêrin. Hûn xwe ji Xudayê perwerdekarê xwe biparêzin-bitirsin. Hûn wan ji xaniyên wan dernexin û bira ew jî dernekevin ji pêþtirê ku nepakîkî aþîkar bikin. Evê han tixûbê Xuda ne. Kî ji tixûbê Xuda bibore êdî bi rastî wî li xwe tadê kiriye. Tu nizanî dibe ku Xuda piþtî vî kareki nû çê bike (rewþekî nû bi ber we xe)ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) (به ئوممه‌تت ڕابگه‌یه‌نه‌) کاتێك ژنانتان ته‌ڵاق ده‌ده‌ن له‌تاتی دیاری کراویاندا ته‌ڵاقیان بده‌ن (که بریتیه له‌و کاته‌ی که ئافره‌ت له عاده‌ی مانگانه پاك بۆته‌وه‌)، حسابی ئه‌وکاته‌ش به وردی ڕابگرن، له په‌روه‌ردگاریشتان بترسن و ماوه‌که‌یان بۆ درێژ مه‌که‌نه‌وه (ئه‌گه‌ر له‌و کاته دیاریکراوانه‌دا یه‌کجار ته‌ڵاقتان دان، ئه‌وه با ئه‌و ئافره‌ته له ماڵه‌که‌ی خۆیدا بمینێته‌وه و) ده‌ریان مه‌که‌ن له‌ماڵه‌کانی خۆیاندا، ئافره‌ته‌کانیش با له ماڵ ده‌رنه‌چن، مه‌گه‌ر کارێکی ناشیرین و ناڕه‌وای ئاشکرا ئه‌نجام بده‌ن، (ئه‌وکاته با له ماڵ نه‌مێنن و بچن بۆ ماڵی مه‌حره‌مێکیان)، ئا ئه‌وه‌یه سنووری خوا له باره‌ی ته‌ڵاقه‌وه‌، ئه‌وه‌ی له سنووری خوا بترازێت ئه‌وه سته‌م له خۆی ده‌کات، ئه‌ی ئیماندار: تۆ نازانیت له‌وانه‌یه دوای ئه‌و (تێکچوون و ساردییه‌) خوای گه‌وره بارودۆخێك پێش بهێنێت (که ئاشت ببنه‌وه و ڕێك بکه‌ونه‌وه و بۆیه نابێت له ماڵ ده‌رچن).",
            "verse 65:2": "Vêca gava ew (jin) gihîþtin danê (berdana) xwe, êdî hûn ji wan ya bi qencî bigrin yan jî hûn wan bi qencî biqetînin û hûn ji xwe du danasê dadmend (adil) amade kin. Hûn ji bo Xuda danasiyê rast kin. Evê han ê ku bi Xuda û roja dawîn bawerî tîne pê tê þîret kirin. Kî xwe ji Xuda biparêze-jê bitirse wê jê re rêya derketinê çêkeکاتێك گه‌یشتنه ماوه‌ی دیاریکراوی خۆیان (دوای یه‌ك، یان ئه‌و دوو ته‌ڵاقه که خواردو‌یانه‌)، ئینجا یان بیانهێڵنه‌وه لای خۆتان هاوڕێ له‌گاڵ ڕه‌فتارو هه‌ڵسوکه‌وتی چاکدا، یاخود وازیان لێبهێنن و لێیان جیاببنه‌وه (له سێهه‌م جاردا که ته‌ڵاقتان خوارد) به‌شێوه‌یه‌کی جوان که مافیان پارێزراو بێت، له کاتی جیابوونه‌وه‌ی یه‌کجاریدا با دوو شایه‌تی دادپه‌روه‌رو خواناس له خۆتان له نێواندا هه‌بێت و ئاماده‌ی شایه‌تی ببن و بیپارێزن بۆ خواو له‌به‌ر خوا، به‌وه‌ی که‌باسکرا ئامۆژگاری ده‌کرێت ئه‌و که‌سه‌ی باوه‌ڕ به خواو ڕۆژی دوایی ده‌هێنیت، جا ئه‌وه‌ی له خوا بترسێت و پارێزکار بێت، ئه‌وه خوا ده‌رووی لێ ده‌کاته‌وه‌...",
            "verse 65:3": "Û wê ji deverekî ku ew guman nake rozî bidê. Kî xwe bispêre Xuda, êdî ew besî wî ye. Bêguman Xuda fermana xwe radigihîne (tiþtê bixwaze pêk tîne). Bi rastî Xuda, ji her tiþtî re pîvanek (qasekîdanê dawî lêhatine) çêkiriyeله شوێنێکه‌وه ڕزق و ڕۆزی پێ ده‌به‌خشێت که حسابی بۆ نه‌کردبێت و خۆی پێی نازانێت، جا ئه‌وه‌ی پشت به خوا ببه‌ستێت، ئه‌و زاته‌ی به‌سه‌، بۆ ئه‌وه‌ی یاریده‌ده‌ری بێت، چونکه به‌ڕاستی خوا کارو فه‌رمانی خۆی به ئه‌نجام ده‌گه‌یه‌نێت، بێگومان خوا بۆ هه‌موو شتێک نه‌خشه‌یه‌کی دیاریکراوی بڕیارداوه (که ده‌بێت په‌یڕه‌وی بکرێت).",
            "verse 65:4": "Ew (pîre jin) ên ku ji kirasa bêhêvî bûne (êdî nakevin heyza) -eger hûn dudilî bibin- êdî danê (mayîna) wan sê meh e; û ên ku (biçûk in) neketine kirasa de jî (danê mayina wan sê meh e; jin) ên bardar (bi hemle) jî danê wan (ev e) ku barê xwe deynin. Kî, xwe ji Xuda biparêze-bitirse, wê ji karê wî jê re hêsanî çêkeئه‌و ئافره‌تانه‌ی که نائومێد بوون له عاده‌تی مانگانه له هاوسه‌ره‌کانتان، ئه‌گه‌ر که‌وتنه گوناهه‌وه که ئاخۆ عاده‌تی مانگانه‌یان مابێت یان نا، ئه‌وه سێ مانگ چاوه‌ڕێ بکه‌ن، هه‌روه‌ها ئه‌وانه‌ش که به‌هۆی که‌م ته‌مه‌نیوه هێشتا نه‌که‌وتونه‌ته عاده‌وه‌، ئه‌وانیش سێ مانگ چاوه‌ڕێ بکه‌ن، ئه‌و ئافره‌تانه‌ش که سکیان هه‌یه ماوه‌که‌یان ئه‌وه‌نده‌یه تا سکه‌که‌یان داده‌نێن، جا ئه‌وه‌ی که له خوا بترسێت و پارێزکار بێت، ئه‌وه خوا کاری بۆ ئاسان ده‌کات.",
            "verse 65:5": "Evê han fermana Xuda ye ku bal we ve daxistiye. Kî xwe ji Xuda biparêze- bitirse wê nepakiyên wî jê bibe û wê xelata wî jê re mezin bidêreئا ئه‌وه فه‌رمان و سنووری خوایه که ناردوویه‌تییه خواره‌وه بۆتان، ئه‌وه‌ی له خوا بترسێت و پارێزکار بێت، خوا گوناهه‌کانی ده‌سڕێته‌وه و چاوپۆشی لێ ده‌کات و پاداشته‌که‌ی بۆ گه‌وره‌و بێ سنوور ده‌کات.",
            "verse 65:6": "Hûn li kuder bimînin hûn wan (jinên berdayî) jî li wê der bi qasî maldariya xwe bihêlin, û hûn ji bo ku li ser wan tengasî çêkin, ziyanê nedin wan. Eger ew (jin) bardar bin, êdî hûn heya ew barê xwe deynin (rozî) bidin. Vêca eger ew (zarûyên we) ji we re bimêjînin, êdî hûn destmuza wan bidin wan, û hûn bi qencî dinav xwe de lihev bikin. Eger ji we re zor hat, êdî wê yeka din wî bimêjîneئه‌و ئافره‌تانه‌ی که ته‌ڵاقێک یان دووانیان ماوه‌، به‌گوێره‌ی تواناتان جێگه و ڕێگه‌یان بۆ دا‌بین بکه‌ن له‌لای خۆتان، نه‌که‌ن ئازاریان بده‌ن و ته‌نگه‌تاویان بکه‌ن و زۆریان بۆ بهێنن، خۆ ئه‌گه‌ر سکیان هه‌بوو، (ئه‌گه‌ر سێ ته‌ڵاقه‌ش درابوون) هه‌ر به‌خێوان بکه‌ن و مه‌سره‌فیان بکێشن هه‌تا سکه‌که‌یان داده‌نێن، خۆ ئه‌گه‌ر هاتوو منداڵه‌که‌یان به‌شیر گۆشکردو به‌خێویان کرد ئه‌وه حه‌قی خۆیان بده‌نێ، ده‌کرێت به‌شێوه‌یه‌کی جوان و چاك ڕاوێژ له‌ناویه‌کدا بکه‌ن بۆ به‌خێو کردنی منداڵه‌که‌، خۆ ئه‌گه‌ر پێك نه‌هاتن و ناکۆك بوون، ئه‌وه ده‌کرێت ئافره‌تێکی تر منداڵه‌که‌ی بۆ به‌خێو بکات و شیری پێ بدات.",
            "verse 65:7": "Bira ê xwedan firehî (maldar) ji firehiya xwe bide. Kî jî roziya wî jê re teng hatiye kirin, êdî bira ew ji tiþtê Xuda dayê bide. Xuda, her kesî bi qasî tiþtê dayê berpirsyar digre. Wê Xuda, piþtî dengasiyê firehî çêbikeجا ئه‌وه‌ی ده‌وڵه‌مه‌نده با به‌گوێره‌ی ده‌وڵه‌مه‌ندیه‌که‌ی به‌خشنده‌بێت، ئه‌وه‌یش که که‌م ده‌سته‌و هه‌ژاره‌، با له‌وه ببه‌خشێت که خوا پێی به‌خشیووه‌، چونکه خوا به گوێره‌ی دارایی هه‌ر که‌سێک داوی به‌خشین ده‌کات، دڵنیاس بن که خوا دوای ته‌نگانه هه‌رزانی ده‌هێنێت، دوای ناخۆشی خۆشی ده‌هێنێت.",
            "verse 65:8": "Çiqas ji bajaran ku ji fermana perwerdekarê xwe û pêxemberên wî serkêþî kirin vêca me wan bi pirsek zor dijwar berpirsyar girt û me wanbi ezabekî nedîtî da ezabêله سه‌ده‌کانی پێشوودا چه‌نداها شارو شارۆچکه یاخی بوون له فه‌رمانی په‌روه‌ردگاریان و فرستاده‌کانی، ئێمه زۆر به‌توندیی حسابمان بۆ کردن و سزایه‌کی توندو پڕئێشمان بۆ پێشهێنان.",
            "verse 65:9": "Vêca wan celata karê xwe tam kir û paþiya karê wan bû ziyanئیتر گیرۆده‌ی به‌ڵای خۆیان بوون و ئه‌و سزایه‌یان چه‌شت که خۆیان ده‌ست پێشکه‌ریان بۆ کردبوو، سه‌رئه‌نجامی کارو کرده‌وه‌ی خه‌ڵکی ئه‌و شوێنانه‌ش زیانێکی گه‌وره بوو. (ئه‌ویش ئه‌مه‌یه که‌)...",
            "verse 65:10": "Xuda, ji wan re ezabeki zor dijwar amade kiriye. Nexwe hûn xwe ji Xuda biparêzin-bitirsin - gelî xwedan hiþên ku we bawerî aniye! - Bi rastî Xuda bal we ve Qur´anekî (ku tev pend û þîret e) daxistiyeله قیامه‌تیشدا خوا سزای به‌ئێش له‌ناو دۆزه‌خدا بۆ ئاماده‌کردوون، ده‌ی کاواته ئه‌ی ڕۆشنبیره‌کان، ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌؛ له خوا بترسن پارێزکار بن دڵنیابن خوای گه‌وره قورئانی بۆ ئێوه دابه‌زاندووه‌...",
            "verse 65:11": "Pêxemberekî ku ayetên Xuda eþkere li ser we dixweyne ji bo ku ew, ên bawerî anîne û karên qenc kirine ji tarîtiyan bal ronahiyê ve derîne. Kî bi Xuda bawerî bîne û karê qenc bike, wê wî têxe hin bihiþtên ku çem ji binê wan diherikin, wê hertimî hertim tê de bin. Bi rastî Xuda, jê re roziyê rind çêkiriyeهه‌روه‌ها پێغه‌مبه‌رێك که ئایه‌ته ڕوونه‌کانی خواتان به‌سه‌ردا ده‌خوێنێته‌وه‌، تا ئه‌وانه‌ی که باوه‌ڕیان هێناوه و کرده‌وه چاکه‌کانیان ئه‌نجام داوه له تاریکیه‌کان ده‌ریان بهێنێت و ڕزگاریان بکات و بیانخاته ناو نوورو ڕوناکیه‌وه‌، جا ئه‌وه‌ی باوه‌ڕ بهێنێت به خواو کرده‌وه‌ی چاك ئه‌نجام بدات، ئه‌وه ده‌یخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نده‌ها ڕوبار به ژێر دره‌خت و به‌رده‌م کۆشکه‌کانیدا ده‌ڕوات و له‌وێ ژیانی هه‌میشه‌یی و هه‌تاهه‌تایی ده‌بنه سه‌ر، بێگومان خوا ڕزق و ڕۆزی چاك و پاك و فره‌و فراوانی بۆ ئاماده کردوون.",
            "verse 65:12": "Xuda ye ê ku heft asîmana û biqasî wan zemîn aferandiye. Kar û ferman di nava wan de hin bi hin dadikeve ji bo hûn bizanbin ku bêguman Xuda bi her tiþti dikare û bêguman Xuda bi zanînê hawîdor li her tiþtî girtiyeخوا ئه‌و زاته‌یه که حه‌وت چین ئاسمانی دروست کردووه و فه‌رمانی خوا له نێوانیاندا داده‌به‌زێت، هه‌روه‌ها به‌وینه‌ی ئه‌وان فه‌رمانی خوا بۆ زه‌ویش داده‌به‌زێت و جێ به جێ ده‌کرێت، بۆ ئه‌وه‌ی بزانن که به‌ڕاست خوا ده‌سه‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌، بێگومان خوا به زانستی و زانیاری خۆی گه‌مارۆی هه‌موو شتێکی داوه‌."
        },
        "Kyrgyz": {
            "verse 65:1": "О, Пайгамбар! Эгер аялдарга талак берчү болсоңор, «идда» мөөнөттөрүндө талак бергиле?. Анан идда мөөнөтүн эсептегиле жана Раббиңер — Аллаһтан корккула! Анык бузук иш (зынаа) кылбаса, аларды үйүнөн чыгарып койбогула жана алар да чыгып кетишпесин! Булар — Аллаһтын чектөөлөрү. Ким Аллаһ белгилеген чектен чыгып кетсе, өзүнө зулум кылган болот. Сен билбейсиң, Аллаһ ушундан (өкүмдөрдү сактагандан) кийин (эрди-катын үчүн бир пайдалуу) ишти болтурса ажеп эмес",
            "verse 65:2": "Эгер аялдар (идда) мөөнөтүн бүтүрсө, же жакшылык менен алып калгыла же жакшылык менен ажырашкыла. (Жарашсаңар да, ажырашсаңар да) өзүңөрдөн эки адилеттүү адамды күбө кылгыла. (О, күбө болгондор!) силер Аллаһ үчүн (түз-туура) күбөлүк бергиле! Мунуңар Аллаһка жана Акырет Күнүнө ыйман келтирген адамдарга үлгү болоор иш. Ким Аллаһтан такыба кылса, анын жолун ачып койот",
            "verse 65:3": "— жана ойлобогон тараптан ырыскы таап берет. (Ошентип,) ким Аллаһка тобокел кылса, Өзү жетиштүү. Аллаһ Өз ишин аягына чыгарат. Аллаһ ар бир нерсеге ченем-өлчөм белгилеп койгон",
            "verse 65:4": "Ал эми, (талагы берилген) аялдарыңардын арасында этек кир келбей калгандары (карыя жаштагылары) болсо жана («булардын идда мөөнөтү кандай болот?» деп) шектенсеңер, алардын иддасы - үч ай. Эми, (балакатка жетпеген же бир оору себептүү) тап-такыр этек кири келбеген аялдар болсо, (булардын иддасын да үч ай деп эсептейсиңер). Боюна бүтүп калган аялдардын идда мөөнөтү — төрөгөнгө чейин. Ким Аллаһтан такыба кылса, анын ишин жеңилдетип койот",
            "verse 65:5": "Силерге Аллаһ түшүргөн буйрук — ушул. Ким Аллаһтан корксо, анын күнөөлөрүн өчүрөт жана сообун көбөйтөт",
            "verse 65:6": "Аларга! мүмкүн болушунча өзүңөр жашаган үйлөрдөн орун бергиле. Аларга кысым көргөзүү менен зыян жеткирбегиле. Эгер алардын боюна бүткөн болсо, боюндагысын төрөгөнгө чейин (бардык муктаждыгын) камсыздагыла. Эгерде силер үчүн (балаңарды) эмизип берсе, акысын төлөп бергиле! жана (сүт акысынын баасын) өз ара, жакшылык менен келишип алгыла. Эгер (келише албай) кыйналсаңар, ал (күйөө) үчүн (баласын) башка аял эмизип берет",
            "verse 65:7": "Байадам байлыгынан (кеңири) камкордук кылсын. Кимдин ырыскысы ченелген болсо, Аллаһ берген нерселерден (колунан келишинче) камкордук кылсын. Аллаһ эч кимди Өзү бергенден ашыкчасына мажбурлабайт. Аллаһ тез арада кыйынчылыктын артынан жеңилдик берет",
            "verse 65:8": "(Мурунку заманда) нечендеген айыл-шаар (элдери) Раббисинин жана Анын пайгамбарларынын буйругунан баш тартышты. Анан Биз алар менен катуу эсептешип, жагымсыз азаптарга салдык",
            "verse 65:9": "Алар кылмыштарынын жазасын татышты. Кылмыштарынын акыбети зыян тартуу (өлүм) болду",
            "verse 65:10": "Аллаһ (Акыретте дагы) аларга катуу азапты даярдап койгон. Эми, Аллаһтан корккула, оо, ыйман келтирген акылдуулар! Аллаһ силерге (Туура Жолго багыттоочу) эскермени жиберди",
            "verse 65:11": "(Ал эскерме — Аллаһтын) элчиси. Ал силерге Аллаһтын анык аяттарын окуп берет, ыйман келтирип, жакшы амал кылгандарды караңгылыктардан Нурга чыгаруу үчүн. Ким Аллаһка ыйман келтирип, жакшы амал кылган болсо, аны түбүнөн дарыялар аккан жана анда түбөлүк калуучу бейиштерге киргизет. Аллаһ ага эң сонун ырыскыны (Бейишти) берди",
            "verse 65:12": "Аллаһ жети кабат асмандарды жана жерден да ошончосун жаратты. Алардын (асман-жердин) арасына (Анын) буйруктар(ы), Аллаһ ар нерсеге кудуреттүү экенин жана Аллаһ ар нерсени илими менен камтып алганын билишиңер үчүн түшүп турат"
        },
        "Malay": {
            "verse 65:1": "Wahai Nabi! Apabila kamu - (engkau dan umatmu) - hendak menceraikan isteri-isteri (kamu), maka ceraikanlah mereka pada masa mereka dapat memulakan idahnya, dan hitunglah masa idah itu (dengan betul), serta bertaqwalah kepada Allah, Tuhan kamu. Janganlah kamu mengeluarkan mereka dari rumah-rumah kediamannya (sehingga selesai idahnya), dan janganlah pula (dibenarkan) mereka keluar (dari situ), kecuali (jika) mereka melakukan perbuatan keji yang nyata. Dan itulah aturan-aturan hukum Allah (maka janganlah kamu melanggarnya); dan sesiapa yang melanggar aturan-aturan hukum Allah maka sesungguhnya ia telah berlaku zalim kepada dirinya. (Patuhilah hukum-hukum itu, kerana) engkau tidak mengetahui boleh jadi Allah akan mengadakan, sesudah itu, sesuatu perkara (yang lain).",
            "verse 65:2": "Kemudian, apabila mereka (hampir) habis tempoh idahnya, maka bolehlah kamu pegang mereka (rujuk) dengan cara yang baik, atau lepaskan mereka dengan cara yang baik; dan adakanlah dua orang saksi yang adil di antara kamu (semasa kamu merujukkan atau melepaskannya); dan hendaklah kamu (yang menjadi saksi) menyempurnakan persaksian itu kerana Allah semata-mata. Dengan hukum-hukum yang tersebut diberi peringatan dan pengajaran kepada sesiapa yang beriman kepada Allah dan hari akhirat; dan sesiapa yang bertaqwa kepada Allah (dengan mengerjakan suruhanNya dan meninggalkan laranganNya), nescaya Allah akan mengadakan baginya jalan keluar (dari segala perkara yang menyusahkannya),",
            "verse 65:3": "Serta memberinya rezeki dari jalan yang tidak terlintas di hatinya. Dan (Ingatlah), sesiapa berserah diri bulat-bulat kepada Allah, maka Allah cukuplah baginya (untuk menolong dan menyelamatkannya). Sesungguhnya Allah tetap melakukan segala perkara yang dikehendakiNya. Allah telahpun menentukan kadar dan masa bagi berlakunya tiap-tiap sesuatu.",
            "verse 65:4": "Dan perempuan-perempuan dari kalangan kamu yang putus asa dari kedatangan haid, jika kamu menaruh syak (terhadap tempoh idah mereka) maka idahnya ialah tiga bulan; dan (demikian) juga idah perempuan-perempuan yang tidak berhaid. Dan perempuan-perempuan mengandung, tempoh idahnya ialah hingga mereka melahirkan anak yang dikandungnya. Dan (ingatlah), sesiapa yang bertaqwa kepada Allah, nescaya Allah memudahkan baginya segala urusannya.",
            "verse 65:5": "Peraturan-peraturan yang demikian adalah hukum-hukum Allah yang diturunkan dan diterangkanNya kepada kamu; dan (ingatlah), sesiapa yang bertaqwa kepada Allah, nescaya Allah menghapuskan kesalahan-kesalahannya, dan akan membesarkan pahala balasannya.",
            "verse 65:6": "Tempatkanlah isteri-isteri (yang menjalani idahnya) itu di tempat kediaman kamu sesuai dengan kemampuan kamu; dan janganlah kamu adakan sesuatu yang menyakiti mereka (di tempat tinggal itu) dengan tujuan hendak menyusahkan kedudukan mereka (supaya mereka keluar meninggalkan tempat itu). Dan jika mereka berkeadaan sedang mengandung, maka berikanlah kepada mereka nafkahnya sehingga mereka melahirkan anak yang dikandungnya; kemudian jika mereka menyusukan anak untuk kamu, maka berikanlah kepada mereka upahnya; dan berundinglah di antara kamu (dalam hal menyusunya) dengan cara yang baik. Dan (sebaliknya) jika kamu (dari kedua pihak) mengalami kesulitan, maka bolehlah perempuan lain menyusukannya.",
            "verse 65:7": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya; dan sesiapa yang di sempitkan rezekinya, maka hendaklah ia memberi nafkah dari apa yang diberikan Allah kepadanya (sekadar yang mampu); Allah tidak memberati seseorang melainkan (sekadar kemampuan) yang diberikan Allah kepadanya. (Orang-orang yang dalam kesempitan hendaklah ingat bahawa) Allah akan memberikan kesenangan sesudah berlakunya kesusahan.",
            "verse 65:8": "Dan bukan sedikit negeri-negeri yang penduduknya menderhaka terhadap perintah Tuhan mereka dan Rasul-rasulNya, maka Kami hitung amal mereka satu persatu dengan hitungan yang keras rapi, serta Kami seksakan mereka dengan azab yang tidak pernah dikenal dahsyatnya.",
            "verse 65:9": "Lalu mereka merasai kesan yang buruk dari perbuatan derhakanya, dan menjadilah akibat perbuatan mereka satu kerugian yang besar.",
            "verse 65:10": "Allah menyediakan bagi mereka azab seksa yang seberat-beratnya. Maka bertaqwalah kepada Allah kepada wahai orang yang berakal sempurna dari kalangan orang yang beriman. Sesungguhnya Allah telah menurunkan kepada kamu peringatan -",
            "verse 65:11": "(Dengan mengutuskan) seorang Rasul (Nabi Muhammad s.a.w) yang membacakan kepada kamu ayat-ayat Allah yang menerangkan kebenaran, supaya Allah mengeluarkan orang-orang (yang sedia diketahuiNya akan) beriman dan beramal soleh - dari gelap-gelita (kesesatan) kepada cahaya (hidayah petunjuk). Dan (ingatlah), sesiapa yang beriman kepada Allah dan beramal soleh, akan dimasukkan oleh Allah ke dalam Syurga yang mengalir di bawahnya beberapa sungai; kekalah mereka di dalamnya selama-lamanya. Sesungguhnya Allah (dengan yang demikian) telah mengurniakan kepadanya sebaik-baik pemberian.",
            "verse 65:12": "Allah yang menciptakan tujuh petala langit dan (Ia menciptakan) bumi seperti itu; perintah Allah berlaku terus menerus di antara alam langit dan bumi. (Berlakunya yang demikian) supaya kamu mengetahui bahawa sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu, dan bahawa sesungguhnya Allah tetap meliputi ilmuNya akan tiap-tiap sesuatu."
        },
        "Malayalam": {
            "verse 65:1": "നബിയേ, നിങ്ങള്‍ (വിശ്വാസികള്‍) സ്ത്രീകളെ വിവാഹമോചനം ചെയ്യുകയാണെങ്കില്‍ അവരെ നിങ്ങള്‍ അവരുടെ ഇദ്ദഃ കാലത്തിന് (കണക്കാക്കി) വിവാഹമോചനം ചെയ്യുകയും ഇദ്ദഃ കാലം നിങ്ങള്‍ എണ്ണികണക്കാക്കുകയും ചെയ്യുക. നിങ്ങളുടെ രക്ഷിതാവായ അല്ലാഹുവെ നിങ്ങള്‍ സൂക്ഷിക്കുകയും ചെയ്യുക. അവരുടെ വീടുകളില്‍ നിന്ന് അവരെ നിങ്ങള്‍ പുറത്താക്കരുത്‌. അവര്‍ പുറത്തു പോകുകയും ചെയ്യരുത്‌. പ്രത്യക്ഷമായ വല്ല നീചവൃത്തിയും അവര്‍ ചെയ്യുകയാണെങ്കിലല്ലാതെ. അവ അല്ലാഹുവിന്‍റെ നിയമപരിധികളാകാകുന്നു. അല്ലാഹുവിന്‍റെ നിയമപരിധികളെ വല്ലവനും അതിലംഘിക്കുന്ന പക്ഷം, അവന്‍ അവനോട് തന്നെ അന്യായം ചെയ്തിരിക്കുന്നു. അതിന് ശേഷം അല്ലാഹു പുതുതായി വല്ലകാര്യവും കൊണ്ടു വന്നേക്കുമോ എന്ന് നിനക്ക് അറിയില്ല.",
            "verse 65:2": "അങ്ങനെ അവര്‍ (വിവാഹമുക്തകള്‍) അവരുടെ അവധിയില്‍ എത്തുമ്പോള്‍ നിങ്ങള്‍ ന്യായമായ നിലയില്‍ അവരെ പിടിച്ച് നിര്‍ത്തുകയോ, ന്യായമായ നിലയില്‍ അവരുമായി വേര്‍പിരിയുകയോ ചെയ്യുക. നിങ്ങളില്‍ നിന്നുള്ള രണ്ടു നീതിമാന്‍മാരെ നിങ്ങള്‍ സാക്ഷി നിര്‍ത്തുകയും അല്ലാഹുവിന് വേണ്ടി സാക്ഷ്യം നേരാംവണ്ണം നിലനിര്‍ത്തുകയും ചെയ്യുക. അല്ലാഹുവിലും അന്ത്യദിനത്തിലും വിശ്വസിച്ചു കൊണ്ടിരിക്കുന്നവര്‍ക്ക് ഉപദേശം നല്‍കപ്പെടുന്നതത്രെ അത്‌. അല്ലാഹുവെ വല്ലവനും സൂക്ഷിക്കുന്ന പക്ഷം അല്ലാഹു അവന്നൊരു പോംവഴി ഉണ്ടാക്കികൊടുക്കുകയും,",
            "verse 65:3": "അവന്‍ കണക്കാക്കാത്ത വിധത്തില്‍ അവന്ന് ഉപജീവനം നല്‍കുകയും ചെയ്യുന്നതാണ്‌. വല്ലവനും അല്ലാഹുവില്‍ ഭരമേല്‍പിക്കുന്ന പക്ഷം അവന്ന് അല്ലാഹു തന്നെ മതിയാകുന്നതാണ്‌. തീര്‍ച്ചയായും അല്ലാഹു തന്‍റെ കാര്യം പ്രാപിക്കുന്നവനാകുന്നു. ഓരോ കാര്യത്തിനും അല്ലാഹു ഒരു ക്രമം ഏര്‍പെടുത്തിയിട്ടുണ്ട്‌.",
            "verse 65:4": "നിങ്ങളുടെ സ്ത്രീകളില്‍ നിന്നും ആര്‍ത്തവത്തെ സംബന്ധിച്ച് നിരാശപ്പെട്ടിട്ടുള്ളവരെ സംബന്ധിച്ചിടത്തോളം നിങ്ങള്‍ അവരുടെ ഇദ്ദഃ യുടെ കാര്യത്തില്‍ സംശയത്തിലാണെങ്കില്‍ അത് മൂന്ന് മാസമാകുന്നു. ആര്‍ത്തവമുണ്ടായിട്ടില്ലാത്തവരുടേതും അങ്ങനെ തന്നെ. ഗര്‍ഭവതികളായ സ്ത്രീകളാകട്ടെ അവരുടെ അവധി അവര്‍ തങ്ങളുടെ ഗര്‍ഭം പ്രസവിക്കലാകുന്നു. വല്ലവനും അല്ലാഹുവെ സൂക്ഷിക്കുന്ന പക്ഷം അവന്ന് അവന്‍റെ കാര്യത്തില്‍ അല്ലാഹു എളുപ്പമുണ്ടാക്കി കൊടുക്കുന്നതാണ്‌.",
            "verse 65:5": "അത് അല്ലാഹുവിന്‍റെ കല്‍പനയാകുന്നു. അവനത് നിങ്ങള്‍ക്ക് അവതരിപ്പിച്ചു തന്നിരിക്കുന്നു. വല്ലവനും അല്ലാഹുവെ സൂക്ഷിക്കുന്ന പക്ഷം അവന്‍റെ തിന്‍മകളെ അവന്‍ മായ്ച്ചുകളയുകയും അവന്നുള്ള പ്രതിഫലം അവന്‍ വലുതാക്കി കൊടുക്കുകയും ചെയ്യുന്നതാണ്‌.",
            "verse 65:6": "നിങ്ങളുടെ കഴിവില്‍ പെട്ട, നിങ്ങള്‍ താമസിക്കുന്ന സ്ഥലത്ത് നിങ്ങള്‍ അവരെ താമസിപ്പിക്കണം. അവര്‍ക്കു ഞെരുക്കമുണ്ടാക്കാന്‍ വേണ്ടി നിങ്ങള്‍ അവരെ ദ്രോഹിക്കരുത്‌. അവര്‍ ഗര്‍ഭിണികളാണെങ്കില്‍ അവര്‍ പ്രസവിക്കുന്നത് വരെ നിങ്ങള്‍ അവര്‍ക്കു ചെലവുകൊടുക്കുകയും ചെയ്യുക. ഇനി അവര്‍ നിങ്ങള്‍ക്കു വേണ്ടി (കുഞ്ഞിന്‌) മുലകൊടുക്കുന്ന പക്ഷം അവര്‍ക്കു നിങ്ങള്‍ അവരുടെ പ്രതിഫലം കൊടുക്കുക. നിങ്ങള്‍ തമ്മില്‍ മര്യാദപ്രകാരം കൂടിയാലോചിക്കുകയും ചെയ്യുക. ഇനി നിങ്ങള്‍ ഇരു വിഭാഗത്തിനും ഞെരുക്കമാവുകയാണെങ്കില്‍ അയാള്‍ക്കു വേണ്ടി മറ്റൊരു സ്ത്രീ മുലകൊടുത്തു കൊള്ളട്ടെ.",
            "verse 65:7": "കഴിവുള്ളവന്‍ തന്‍റെ കഴിവില്‍ നിന്ന് ചെലവിനു കൊടുക്കട്ടെ. വല്ലവന്നും തന്‍റെ ഉപജീവനം ഇടുങ്ങിയതായാല്‍ അല്ലാഹു അവന്നു കൊടുത്തതില്‍ നിന്ന് അവന്‍ ചെലവിന് കൊടുക്കട്ടെ. ഒരാളോടും അല്ലാഹു അയാള്‍ക്ക് കൊടുത്തതല്ലാതെ (നല്‍കാന്‍) നിര്‍ബന്ധിക്കുകയില്ല. അല്ലാഹു ഞെരുക്കത്തിനു ശേഷം സൌകര്യം ഏര്‍പെടുത്തികൊടുക്കുന്നതാണ്‌.",
            "verse 65:8": "എത്രയെത്ര രാജ്യക്കാര്‍ അവരുടെ രക്ഷിതാവിന്‍റെയും അവന്‍റെ ദൂതന്‍മാരുടെയും കല്‍പന വിട്ട് ധിക്കാരം പ്രവര്‍ത്തിച്ചിട്ടുണ്ട്‌. അതിനാല്‍ നാം അവരോട് കര്‍ക്കശമായ നിലയില്‍ കണക്കു ചോദിക്കുകയും അവരെ നാം ഹീനമായ വിധത്തില്‍ ശിക്ഷിക്കുകയും ചെയ്തു.",
            "verse 65:9": "അങ്ങനെ അവര്‍ അവരുടെ നിലപാടിന്‍റെ ദുഷ്ഫലം ആസ്വദിച്ചു. അവരുടെ നിലപാടിന്‍റെ പര്യവസാനം നഷ്ടം തന്നെയായിരുന്നു.",
            "verse 65:10": "അല്ലാഹു അവര്‍ക്കു കഠിനമായ ശിക്ഷ ഒരുക്കിവെച്ചിരിക്കുന്നു. അതിനാല്‍ സത്യവിശ്വാസികളായ ബുദ്ധിമാന്‍മാരേ, നിങ്ങള്‍ അല്ലാഹുവെ സൂക്ഷിക്കുക. തീര്‍ച്ചയായും അല്ലാഹു നിങ്ങള്‍ക്ക് ഒരു ഉല്‍ബോധകനെ",
            "verse 65:11": "അഥവാ അല്ലാഹുവിന്‍റെ വ്യക്തമായ ദൃഷ്ടാന്തങ്ങള്‍ നിങ്ങള്‍ക്ക് ഓതികേള്‍പിച്ചു തരുന്ന ഒരു ദൂതനെ നിങ്ങളുടെ അടുത്തേക്കിറക്കിത്തന്നിരിക്കുന്നു; വിശ്വസിക്കുകയും സല്‍കര്‍മ്മങ്ങള്‍ പ്രവര്‍ത്തിക്കുകയും ചെയ്തവരെ അന്ധകാരങ്ങളില്‍ നിന്ന് പ്രകാശത്തിലേക്ക് ആനയിക്കുവാന്‍ വേണ്ടി. വല്ലവനും അല്ലാഹുവില്‍ വിശ്വസിക്കുകയും സല്‍കര്‍മ്മം പ്രവര്‍ത്തിക്കുകയും ചെയ്യുന്ന പക്ഷം താഴ്ഭാഗത്തു കൂടി അരുവികള്‍ ഒഴുകുന്ന സ്വര്‍ഗത്തോപ്പുകളില്‍ അവനെ പ്രവേശിപ്പിക്കുന്നതാണ്‌. അവര്‍ അതില്‍ നിത്യവാസികളായിരിക്കും. അങ്ങനെയുള്ളവന്ന് അല്ലാഹു ഉപജീവനം മെച്ചപ്പെടുത്തിയിരിക്കുന്നു.",
            "verse 65:12": "അല്ലാഹുവാകുന്നു ഏഴ് ആകാശങ്ങളും ഭൂമിയില്‍ നിന്ന് അവയ്ക്ക് തുല്യമായതും സൃഷ്ടിച്ചവന്‍. അവയ്ക്കിടയില്‍ (അവന്‍റെ) കല്‍പന ഇറങ്ങുന്നു. അല്ലാഹു ഏത് കാര്യത്തിനും കഴിവുള്ളവനാകുന്നു എന്നും ഏതു വസ്തുവെയും ചൂഴ്ന്ന് അറിയുന്നവനായിരിക്കുന്നു എന്നും നിങ്ങള്‍ മനസ്സിലാക്കുവാന്‍ വേണ്ടി."
        },
        "Norwegian": {
            "verse 65:1": "Du profet, når dere skiller dere fra hustruer, så gjør dette under hensyntagen til deres ventetid. Beregn ventetiden, og frykt Gud, deres Herre. Send dem ikke bort fra sine hjem, de skal ikke dra med mindre de er skyldig i klar umoral! Dette er grenser som Gud har satt! Den som overskrider Guds grenser, gjør en urett som rammer ham selv. Du vet ikke, kanskje Gud etter dette vil bringe noe nytt.",
            "verse 65:2": "Når de så har nådd sin termin, så behold dem på skikkelig vis, eller skill dere fra dem på skikkelig vis. To redelige menn blant dere skal være vitner, og bære vitnemålet overfor Gud. Ved dette formanes den som tror på Gud og dommens dag. Den som frykter Gud, vil Han finne en utvei for, og Han vil gi ham Sine gaver fra et hold han ikke regner med.",
            "verse 65:3": "Om noen forlater seg på Gud, er Han nok for ham. Gud oppnår det Han vil. Gud har gitt alle ting sitt mål.",
            "verse 65:4": "For dem av deres hustruer som har avskrevet menstruasjonen, om dere er i tvil, så er ventetiden tre måneder, og også for dem som ennå ikke har menstruert. For dem som er svangre, er deres frist fødselen. Den som frykter Gud, vil Han gjøre det lett for etter sin ordning.",
            "verse 65:5": "Dette er Guds bud, som Han har åpenbart for dere. For den som frykter Gud, vil Han utslette hans misgjerninger og gjøre hans lønn stor.",
            "verse 65:6": "La dem bo i ventetiden som dere bor, etter deres utkomme, og plag dem ikke for å gjøre det vanskelig for dem. Hvis de er svangre, så gi dem bidrag til fødselen. Hvis de ammer deres barn, så gi dem deres lønn og snakk sammen på skikkelig vis. Hvis dere har vanskeligheter, så skal en annen amme for ham.",
            "verse 65:7": "Den velstående skal betale av sin velstand. Den som har begrensede kår, skal betale av det Gud har gitt ham. Gud forlanger ikke mer av noen enn Han har gitt ham. Gud lar vanskeligheter følges av lettelser.",
            "verse 65:8": "Hvor mang en by som satte seg ut over Guds og Hans sendebuds bud, har Vi gitt en hard avregning og straffet med en fryktelig straff!",
            "verse 65:9": "Så de fikk smake sin onde adferds følger, og slutten på det hele ble undergang.",
            "verse 65:10": "Gud har gjort klar for dem en hard straff. Så frykt Gud, dere som har forstand!",
            "verse 65:11": "Dere som tror, Gud har sendt ned til dere en påminnelse, et sendebud, som fremleser for dere Guds ord, de klargjørende, for å føre dem som tror og lever rettskaffent, fra mørke til lys. Den som tror og lever rettskaffent, vil Han føre inn i paradisets haver, hvor bekker sildrer, og hvor de skal være og bli for alltid. Gud gir ham en prektig omsorg.",
            "verse 65:12": "Gud er det som skapte syv himler, og jorden likeledes! Ordet stiger ned mellom dem, så dere må vite at Gud evner alt, og at Gud omfatter alle ting i visdom!"
        },
        "Pashto": {
            "verse 65:1": "اى نبي! (دوى ته ووایه) كله چې تاسو (خپلې) ښځې طلاقول غواړئ، نو دوى په خپل (مناسب) وخت د عدت كې طلاقې كړئ او عدت وشمېرئ او له خپل رب الله نه ووېرېږئ۔ (او) تاسو دغه (خپلې ښځې) د دوى له كورونو نه مه وباسئ او دوى دې (پخپله) هم نه وځي مګر په دې حال كې چې دوى ښكاره بې حیايي وكړي۔ او دغه د الله حدونه دي او هر څوك چې د الله له حدونو نه تېر شي، نو یقینًا ده په خپل ځان ظلم وكړ، (اى طلاق وركوونكیه!) ته نه پوهېږي، كېدى شي چې الله له دغه نه وروسته كوم (ښه) كار پیدا كړي",
            "verse 65:2": "نو كله چې دغه (ښځې) خپلې نېټې ته رسېږي، نو (یا) خو تاسو دوى په نېكه طریقه (په رجوع كولو سره په خپل نكاح كې) وساتئ، یا په نېكه طریقه له دوى نه جدا شئ۔ او په تاسو كې دوه عدل والا كسان (په دې كار) ګواهان ونیسئ او تاسو (اى ګواهانو) ګواهي د الله لپاره ادا كړئ۔، دا (حكم چې دى) په ده سره هغه چا ته نصیحت كاوه شي چې په الله او د اخرت په ورځ ایمان لري او هغه څوك چې له الله نه ووېرېږي، (نو) هغه به د ده لپاره د وتلو څه ځاى پیدا كړي",
            "verse 65:3": "او ده ته به له هغه ځایه رزق وركړي چې دى به ګمان هم نه كوي۔ او هغه څوك چې په الله باندې توكل وكړي، نو همدى د ده لپاره بس (او كافی) دى، بېشكه الله خپل كار ته رسېدونكى دى۔، یقینًا الله د هر شي لپاره یوه اندازه مقرر كړې ده",
            "verse 65:4": "او هغه ښځې چې ستاسو په ښځو كې د حیض له راتلو نه ناامېده شوي دي۔ كه چېرې تاسو شك وكړئ۔، نو د دوى عدت درې میاشتې دى او هغه (جینكۍ) چې لا حايضه شوې نه وي۔ او امېدوارې (حامله) ښځې (چې دي) د دوى عدت دا دى چې حمل (بچى) وزېږوي۔ او هغه څوك چې له الله نه ووېرېږي، هغه به د ده لپاره په كار كې ډېره اساني پیدا كړي",
            "verse 65:5": "دغه د الله حكم دى، چې تاسو ته يې دغه نازل كړى دى۔ او هغه څوك چې له الله نه ووېرېږي، هغه به له ده نه د ده ګناهونه لرې كړي او د ده لپاره به اجر ډېر لوى كړي",
            "verse 65:6": "تاسو دغه ښځې (په عدت كې) د خپل طاقت سره سم د هغه ځاى په څه حصه كې اوسوئ چې تاسو (په كې) اوسېږئ۔ او تاسو دوى ته ضرر مه رسوئ، د دې لپاره چې تاسو په دوى باندې تنګسیا راولئ۔ او كه چېرې دغه (ښځې) امېدوارې (حامله) وي، بیا نو تاسو په دوى باندې خرچه كوئ تر هغه پورې چې دوى خپل حمل وزېږوي۔، نو كه دوى ستاسو (اولاد) لپاره تى وركړي، نو تاسو دوى ته د دوى مزدوري وركړئ او تاسو په خپل مینځ كې په ښې طریقې سره یو له بله سره مشوره كوئ۔ او كه تاسو یو له بل سره سختي وكړئ، نو ده (اولاد) ته به عنقریب بله ښځه تى وركړي",
            "verse 65:7": "د فراخۍ والا دې له خپلې فراخۍ نه خرچه وكړي او هغه څوك چې په هغه باندې خپل رزق تنګ كړى شوى وي، نو هغه دې له هغه (مال) نه څه خرچ كړي چې الله ده ته وركړى دى۔، الله هېڅ یونفس نه مكلف كوي مګر هومره چې ده ته يې وركړى دى۔، ژر ده چې الله به له تنګۍ نه پس اساني راولي",
            "verse 65:8": "او ډېر كلي وو چې د خپل رب او د هغه د رسولانو له حكم نه يې سركشي كړې وه، نو مونږ له هغوى سره حساب وكړ، ډېر سخت حساب كول۔ او مونږ هغوى ته عذاب وركړ ډېر ناكاره عذاب وركول",
            "verse 65:9": "نو هغوى د خپل كار سزا وڅكله او د دوى د كار انجام زیان (او تاوان) شو",
            "verse 65:10": "الله د دوى لپاره ډېر سخت عذاب تیار كړى دى۔، نو تاسو له الله نه ووېرېږئ اى د خالصو عقلونو خاوندانو، هغه كسان چې ایمان يې راوړى دى، یقینًا الله تاسو ته ذكر (قرآن) نازل كړى دى",
            "verse 65:11": "(او) رسول (يې رالېږلى دى) چې تاسو ته د الله ایتونه لولي، چې ښه څرګندوونكي دي، د دې لپاره چې دغه (الله) هغو كسانو لره چې ایمان يې راوړى دى او نېك عملونه يې كړي دي، له تیارو نه رڼا ته وباسي۔ او هغه څوك چې په الله ایمان راوړي او نېك عمل وكړي (نو) دى به دغه كس داسې جنتونو ته داخل كړي چې د هغو له لاندې ولې بهېږي، چې دوى به په هغو كې تل ترتله وي۔، یقینًا الله د ده لپاره رزق ډېر ښه كړى دى",
            "verse 65:12": "الله هغه ذات دى چې اوه اسمانونه يې پیدا كړي دي او له ځمكې نه هم د دغو په مثل۔، (د الله) امر د دوى په مینځ كې نازلېږي، د دې لپاره چې تاسو پوه شي چې یقینًا الله په هر شي باندې ښه قادر دى او دا چې یقینًا الله د علم په لحاظ هر شى راګېر كړى دى"
        },
        "Persian": {
            "verse 65:1": "اى پيامبر، اگر زنان را طلاق مى‌دهيد به وقت عده طلاقشان دهيد. و شمار عده را نگه داريد. و از خداى يكتا پروردگارتان بترسيد. و آنان را از خانه‌هايشان بيرون مكنيد. و از خانه بيرون نروند مگر آنكه به آشكارا مرتكب كارى زشت شوند. اينها احكام خداوند است، و هر كه از آن تجاوز كند به خود ستم كرده است. تو چه دانى، شايد خدا از اين پس امرى تازه پديد آورد.",
            "verse 65:2": "و چون به پايان مدت رسيدند، يا به وجهى نيكو نگاهشان داريد يا به وجهى نيكو از آنها جدا شويد و دو تن عادل از خودتان را به شهادت گيريد. و براى خدا شهادت را به راستى ادا كنيد. هر كه را به خدا و روز قيامت ايمان دارد، اينچنين اندرز مى‌دهند. و هر كه از خدا بترسد، براى او راهى براى بيرون‌شدن قرار خواهد داد،",
            "verse 65:3": "و از جايى كه گمانش را ندارد روزى‌اش مى‌دهد. و هر كه بر خدا توكل كند، خدا او را كافى است. خدا كار خود را به اجرا مى‌رساند و هر چيز را اندازه‌اى قرار داده است.",
            "verse 65:4": "اگر در ترديد هستيد، از ميان زنانتان آنهايى كه از حيض مأيوس شده‌اند و آنهايى كه هنوز حيض نشده‌اند عِدّه‌شان سه ماه است. و عِدّه زنان آبستن همان وضع حمل است. و هر كه از خدا بترسد، خدا كارش را آسان خواهد كرد.",
            "verse 65:5": "اين فرمان خداست كه بر شما نازل كرده است. و هر كه از خدا بترسد، گناهانش را از او مى‌زدايد و او را پاداشى بزرگ مى‌دهد.",
            "verse 65:6": "هر جا كه خود سكونت گزينيد آنها را نيز به قدر توانايى خود مسكن دهيد. و تا بر آنها تنگ گيريد ميازاريدشان. و اگر آبستن بودند، نفقه‌شان را بدهيد تا وضع حمل كنند. و اگر فرزند شما را شير مى‌دهند، مزدشان را بدهيد و به وجهى نيكو با يكديگر توافق كنيد. و اگر به توافق نرسيديد، از زنى ديگر بخواهيد كه كودك را شير دهد.",
            "verse 65:7": "هر مالدارى از مال خود نفقه دهد، و كسى كه تنگدست باشد، از هر چه خدا به او داده است نفقه دهد. خدا هيچ كسى را مگر به آن اندازه كه به او داده است مكلف نمى‌سازد، و زودا كه خدا پس از سختى آسانى پيش آورد.",
            "verse 65:8": "چه بسا مردم قريه‌اى كه از فرمان پرردگارشان و پيامبرانش سرباز زدند. آنگاه ما سخت از آنها حساب كشيديم و به عذابى سهمناك عذابشان كرديم.",
            "verse 65:9": "پس عقوبت عمل خود را چشيدند. عاقبت كارشان زيانكارى بود.",
            "verse 65:10": "خداوند برايشان عذابى سخت آماده كرد. پس اى خردمندانى كه ايمان آورده‌ايد، از خدا بترسيد. خدا بر شما قرآن را نازل كرده است.",
            "verse 65:11": "و پيامبرى كه آيات روشن خدا را برايتان مى‌خواند تا كسانى را كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند از تاريكى به روشنايى آورد. و هر كه را به خدا ايمان آورد و كار شايسته كند به بهشتهايى در آورد كه در آن نهرها جارى است، همواره در آنجا بمانند و خدا روزيشان را كرامند گرداند.",
            "verse 65:12": "خداست آن كه هفت آسمان و همانند آنها زمين بيافريد. فرمان او ميان آسمانها و زمين جارى است تا بدانيد كه خدا بر هر چيز قادر است و به علم بر همه چيز احاطه دارد."
        },
        "Polish": {
            "verse 65:1": "O Proroku! Kiedy odprawiacie swoje żony, to odprawiajcie je w właściwym dla nich terminie. Przestrzegajcie tego terminu i bójcie się Boga, waszego Pana! Nie wypędzajcie ich z domów i niech wcale nie wychodzą, chyba że dopuściły się jawnej bezecności. Takie są granice Boga! A ten, kto przekracza granice Boga, ten czyni niesprawiedliwość sobie samemu. Ty nie wiesz: Być może, Bóg spowoduje, że zajdzie coś nowego.",
            "verse 65:2": "A kiedy nadejdzie ich termin, to albo zatrzymajcie je w sposób godny, albo rozstańcie się z nimi w sposób godny. I wezwijcie świadków, dwóch sprawiedliwych spośród was, i ustanówcie świadectwo wobec Boga. Przez to napominany jest ten, kto wierzy w Boga i w Dzień Ostatni. A temu, kto się boi Boga, On przygotuje jakieś wyjście;",
            "verse 65:3": "I da mu zaopatrzenie stąd, skąd on się nawet nie spodziewa. A temu, kto ufa Bogu, On sam wystarczy! Oto Bóg powoduje spełnienie swojego rozkazu! Bóg ustanowił miarę dla każdej rzeczy.",
            "verse 65:4": "A te spośród waszych żon, które już zwątpiły w okres miesięczny - jeśli macie wątpliwości - niech czekają trzy miesiące; podobnie te, które jeszcze się nie rozwinęły. Kobiety brzemienne zaś niech czekają, aż złożą swoje brzemię. Temu, kto się boi Boga, On przyniesie ułatwienie.",
            "verse 65:5": "Taki jest rozkaz Boga, który wam zesłał. A kto się boi Boga, temu On odpuści złe uczynki i powiększy jego nagrodę.",
            "verse 65:6": "Dajcie im mieszkanie, tam gdzie wy mieszkacie, stosownie do waszych środków! Nie wyrządzajcie im przykrości i nie stawiajcie ich w trudnej sytuacji! A jeśli są brzemienne, to łóżcie na ich utrzymanie, aż złożą swoje brzemię! A jeśli one karmią wasze dziecko, dawajcie im za to wynagrodzenie i porozumiewajcie się ze sobą godnie! A jeśli napotykacie jakieś trudności, to niech karmi je inna!",
            "verse 65:7": "Niech ten, który żyje w dostatku, wydaje według swojego dostatku! Niech ten, któremu zostało wymierzone, wydaje według tego, co dał mu Bóg! Bóg nie obciąża żadnej duszy niczym innym, niż tym, co jej dał. Bóg da wam po przeciwnościach ukojenie.",
            "verse 65:8": "Ileż to miast zachowało się dumnie wobec rozkazu Boga i Jego posłańców! I My policzyliśmy się z nimi rachunkiem surowym; ukaraliśmy je karą straszną.",
            "verse 65:9": "I one zakosztowały złych skutków swego postępowania, a w ostatecznym wyniku ponieśli stratę.",
            "verse 65:10": "Przygotował dla nich Bóg karę straszną. Bójcie się więc Boga, o wy, obdarzeni umysłem, którzy uwierzyliście! Bóg zesłał wam napomnienie,",
            "verse 65:11": "Posłańca, który recytuje wam jasne znaki Boga, aby wyprowadzić z ciemności do światła tych, którzy wierzą, którzy pełnią dobre dzieła. Kto wierzy w Boga i czyni dobro, tego On wprowadzi do Ogrodów, gdzie w dole płyną strumyki; oni będą tam przebywać nieśmiertelni na zawsze. Bóg dał jemu piękny udział.",
            "verse 65:12": "To jest Bóg, który stworzył siedem niebios i ziemi tyleż. Jego rozkaz dociera do nich, abyście wiedzieli, że Bóg jest nad każdą rzeczą wszechwładny i że obejmuje każdą rzecz Swoją wiedzą."
        },
        "Portuguese": {
            "verse 65:1": "Ó Profeta, quando vos divorciardes das vossas mulheres, divorciai-vos delas em seus períodos prescritos e contaiexatamente tais períodos e temei a Deus, vosso Senhor. Não as expulseis dos seus lares, nem elas deverão sair, a não serque tenham cometido obscenidade comprovada. Tais são as leis de Deus; e quem profanar as leis de Deus, condenar-se-á. Tu o ignoras, mas é possível que Deus, depois disto, modifique a situação para melhor.",
            "verse 65:2": "Todavia, quando tiverem cumprido o seu término prefixado, tomai-as em termos eqüitativos ou separai-vos delas, emtermos eqüitativos. (Em ambos os casos) fazei-o ante testemunhas eqüitativas, dentre vós, e justificai o testemunho anteDeus, com o qual se exorta quem crê em Deus e no Dia do Juízo Final. Mas, a quem temer a Deus, Ele lhe apontará umasaída.",
            "verse 65:3": "E o agraciará, de onde menos esperar. Quanto àquele que se encomendar a Deus, saiba que Ele será Suficiente, porqueDeus cumpre o que promete. Certamente Deus predestinou uma proporção para cada coisa.",
            "verse 65:4": "Quanto àquelas, das vossas mulheres, que tiverem chegado à menopausa, se tiverdes dúvida quanto a isso, o seu períodoprescrito será de três meses; o mesmo se diga, com respeito àquelas que ainda não tiverem chegado a tal condição; e, quantoàs grávidas, o seu período estará terminado quando derem à luz. Mas, a quem temer a Deus, Ele lhe aplainará o assunto.",
            "verse 65:5": "Tal é o mandamento que Deus vos revelou. E quem temer a Deus, (saiba que) Ele lhe absolverá os pecados e lheaumentará a recompensa.",
            "verse 65:6": "Instalai-as (as divorciadas) onde habitais, segundo os vossos recursos, e não as molesteis, para criar-lhes dificuldades. Se estiverem grávidas, mantende-as, até que tenham dado à luz. Se amamentam os vossos filhos, pagai-lhes a suarecompensa e consultai-vos cordialmente. Porém, se encontrardes constrangimento nisso, que os amamente outra mulher.",
            "verse 65:7": "Que o abastado retribua isso, segundo as suas posses; quanto àquele, cujos recursos forem parcos, que retribua comaquilo com que Deus lhe agraciou. Deus não impõe a ninguém obrigação superior ao que lhe concedeu; Deus trocará adificuldade pela facilidade.",
            "verse 65:8": "Quantas cidades descartaram a autoridade do seu Senhor e dos Seus mensageiros! Saldamo-lhes as contas rigorosamente elhes infligimos um castigo exemplar.",
            "verse 65:9": "Sofreram, então, a dura conseqüência da sua conduta, e o resultado da sua conduta foi a perdição.",
            "verse 65:10": "Deus lhes preparou um severo castigo. Temei, pois, a Deus, ó fiéis sensatos, pois Deus vos enviou uma Mensagem.",
            "verse 65:11": "Por um Mensageiro, que vos recita os lúcidos versículos de Deus, para tirar os que crêem e praticam o bem, das trevas, para os levar à luz. E os que crêem em Deus e praticam o bem, Ele os introduzirá em jardins, abaixo dos quais correm osrios, onde morarão eternamente. Deus lhes reservou uma excelente provisão.",
            "verse 65:12": "Deus foi Quem criou sete firmamentos e outro tanto de terras; e Seus desígnios se cumprem, entre eles, para que saibaisque Deus é Onipotente e que Deus tudo abrange, com a Sua onisciência."
        },
        "Punjabi": {
            "verse 65:1": "ਹੇ ਰਸੂਲ! ਜਦੋਂ ਤੁਸੀਂ ਲੋਕ ਔਰਤਾਂ ਨੂੰ ਤਲਾਕ ਦੇਵੋਂ ਤਾਂ ਉਨ੍ਹਾਂ ਦੀ ਇੱਦਤ (ਸਮਾਂ) ਤੇ ਤਲਾਕ ਦੇਵੋ ਅਤੇ ਇੱਦਤ ਨੂੰ ਗਿਣਦੇ ਰਹੋ ਅਤੇ ਅੱਲਾਹ ਤੋਂ ਡਰੋ ਜਿਹੜਾ ਤੁਹਾਡਾ ਰੱਬ ਹੈ। ਉਨ੍ਹਾਂ ਔਰਤਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੇ ਘਰਾਂ ਤੋਂ ਨਾ ਕੱਢੋ ਅਤੇ ਨਾ ਉਹ ਖੁਦ ਨਿਕਲਣ। ਜੇਕਰ ਉਹ ਪ੍ਰਤੱਖ ਅਸ਼ਲੀਲ ਕੰਮ ਕਰ ਬੈਠਣ (ਤਾਂ ਕੱਢਣ ਵਿਚ ਕੋਈ ਹਰਜ਼ ਨਹੀਂ)। ਇਹ ਅੱਲਾਹ ਦੀਆਂ (ਤੈਅ ਕੀਤੀਆਂ) ਹੱਦਾਂ ਹਨ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਦੀਆਂ ਹੱਦਾਂ ਦਾ ਉਲੰਘਣ ਕਰੇਗਾ, ਤਾਂ (ਸਮਝੋ? ਉਸ ਨੇ ਆਪਣੇ ਆਪ ਤੇ ਜ਼ੁਲਮ ਕੀਤਾ। ਤੁਸੀ’ ਨਹੀਂ ਜਾਣਦੇ, ਹੋ ਸਕਦਾ ਅੱਲਾਹ ਇਸ ਤਲਾਕ ਤੋਂ ਬਾਅਦ ਕੋਈ (ਮੇਲ-ਜੋਲ ਦੀ) ਨਵੀਂ ਹਾਲਤ ਪੈਦਾ ਕਰ ਦੇਵੇ।",
            "verse 65:2": "ਫਿਰ ਜਦੋਂ ਉਹ ਆਪਣੇ ਮਿਥੇ ਸਮੋ ਤੇ ਪੁੱਜ ਜਾਣ ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਜਾਂ ਤਾ ਮਰਿਯਾਦਾ ਅਨੁਸਾਰ ਰੱਖ ਲਵੋ ਜਾਂ ਮਰਿਯਾਦਾ ਅਨੁਸਾਰ ਉਨ੍ਹਾਂ ਨੂੰ ਛੱਡ ਦੇਵੋ। ਅਤੇ ਆਪਣੇ ਵਿਚੋਂ ਦੋ ਭਰੋਸੇ ਯੋਗ ਗਵਾਹ ਬਣਾ ਲਵੋ ਅਤੇ ਅੱਲਾਹ ਲਈ ਠੀਕ ਠਾਕ ਗਵਾਹੀ ਦੇਵੋ। ਇਹ ਉਸ ਬੰਦੇ ਨੂੰ ਉਪਦੇਸ਼ ਦਿੱਤਾ ਜਾਂਦਾ ਹੈ। ਜਿਹੜਾ ਅੱਲਾਹ ਤੇ ਅਤੇ ਪ੍ਰਲੋਕ ਦੇ ਦਿਨ ਤੇ ਇਮਾਨ ਰੱਖਦਾ ਹੋਵੇ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੋਂ ਡਰੇਗਾ, ਅੱਲਾਹ ਉਸ ਲਈ ਰਾਹ ਪੈਦਾ ਕਰੇਗਾ।",
            "verse 65:3": "ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਉਸ ਥਾਂ ਤੋਂ ਰਿਜ਼ਕ ਦੇਵੇਗਾ ਜਿਥੋਂ ਉਸ ਨੇ ਕਲਪਣਾ ਵੀ ਨਹੀਂ ਕੀਤੀ ਹੋਣੀ ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੇ ਭਰੋਸਾ ਕਰੇਗਾ ਤਾਂ ਅੱਲਾਹ ਉਸ ਲਈ ਕਾਫ਼ੀ ਹੈ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਆਪਣਾ ਕੰਮ ਪੂਰਾ ਕਰਕੇ ਰਹਿੰਦਾ ਹੈ। ਅੱਲਾਹ ਨੇ ਹਰ ਚੀਜ਼ ਲਈ ਇੱਕ ਪੈਮਾਨਾ ਨਿਰਧਾਰਿਤ ਕਰ ਰੱਖਿਆ ਹੈ।",
            "verse 65:4": "ਅਤੇ ਤੁਹਾਡੀਆਂ ਔਰਤਾਂ ਵਿਚੋਂ ਜਿਹੜੀਆਂ ਮਾਹਾਵਾਰੀ ਤੋਂ ਨਾ-ਉਮੀਦ ਹੋਂ ਚੁੱਕੀਆਂ ਹਨ। ਜੇਕਰ ਤੁਹਾਨੂੰ (ਉਨ੍ਹਾਂ ਦੀ ਇੱਦਤ ਤੇ) ਸ਼ੱਕ ਹੋਵੇ, ਤਾਂ ਉਨ੍ਹਾਂ ਦੀ ਇੱਦਤ ਤਿੰਨ ਮਹੀਨੇ ਹੈ। ਇਸ ਤਰਾਂ ਉਨ੍ਹਾਂ ਦੀ ਇੱਦਤ (ਵੀ ਤਿਨ ਮਹੀਨੇ ਹੈ) ਜਿਨ੍ਹਾਂ ਨੂੰ ਮਾਹਾਵਾਰੀ ਨਹੀਂ ਆਉਣ ਲੱਗੀ। ਗਰਭਵਤੀ ਔਰਤਾਂ ਦੀ ਇੱਦਤ ਦੀ ਸੀਮਾ ਬੱਚੇ ਦੇ ਜਨਮ ਲੈਣ ਤੱਕ ਹੈ। ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੋਂ ਡਰੇਗਾ ਅੱਲਾਹ ਉਸ ਲਈ ਉਸ ਦੇ ਕੰਮ ਵਿਚ ਆਸਾਨੀ ਪੈਦਾ ਕਰ ਦੇਵੇਗਾ।",
            "verse 65:5": "ਇਹ ਅੱਲਾਹ ਦਾ ਹੁਕਮ ਹੈ, ਜਿਹੜਾ ਉਸ ਨੇ ਤੁਹਾਡੇ ਵੱਲ ਉਤਾਰਿਆ ਹੈ। ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਤੋਂ ਡਰੇਗਾ, ਅੱਲਾਹ ਉਸਦੇ ਪਾਪਾਂ ਨੂੰ ਉਸ ਤੋਂ ਦੂਰ ਕਰ ਦੇਵੇਗਾ ਅਤੇ ਉਸ ਨੂੰ ਵੱਡਾ ਫ਼ਲ ਦੇਵੇਗਾ।",
            "verse 65:6": "ਤੁਸੀਂ ਉਨ੍ਹਾਂ (ਤਲਾਕ ਸੁਦਾ)? ਔਰਤਾਂ ਨੂੰ ਆਪਣੀ ਸਮਰੱਥਾ ਦੇ ਅਨੁਸਾਰ (ਇੱਦਤ ਦੇ ਦਿਨਾਂ ਵਿਚ) ਰਹਿਣ ਦਾ ਘਰ ਦੇਵੋ, ਜਿਥੇ ਤੂਸੀਂ’ ਰਹਿੰਦੇ ਹੋ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਤੰਗ ਕਰਨ ਲਈ ਉਨ੍ਹਾਂ ਨੂੰ ਦੁੱਖ ਨਾ ਪਹੁੰਚਾਉਂ। ਜੇਕਰ ਉਹ ਗਰਭ ਅਵੱਸਥਾ ਵਿਚ ਹੋਣ ਤਾਂ ਉਨ੍ਹਾਂ ਲਈ ਬੱਚਾ ਜੰਮਣ ਤੱਕ ਖਰਚ ਕਰੋਂ। ਫਿਰ ਜੇਕਰ ਉਹ ਤੁਹਾਡੇ ਕਹਿਣ ਤੇ ਬੱਚੇ ਨੂੰ ਦੁੱਧ ਪਿਲਾਉਣ ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੀ ਮਜਦੂਰੀ ਦੇਵੋ। ਅਤੇ ਤੁਸੀਂ ਆਪਿਸ ਵਿਚ ਇੱਕ ਦੂਜੇ (ਬੱਚੇ ਬਾਰੇ) ਨੂੰ ਨੇਕੀ ਸਿਖਾਉ ਅਤੇ ਜੇਕਰ ਤੁਸੀਂ ਆਪਿਸ ਵਿਚ ਜਿੱਦ ਕਰੋ ਤਾਂ ਪਿਤਾ ਦੇ ਕਹਿਣ ਤੇ (ਬੱਚੇ) ਨੂੰ ਕੋਈ ਹੋਰ ਔਰਤ ਦੁੱਧ ਪਿਲਾਵੇਗੀ।",
            "verse 65:7": "ਚਾਹੀਦਾ ਹੈ ਕਿ ਸਮਰੱਥਾ ਵਾਲਾ ਆਪਣੀ ਸਮਰੱਥਾ ਦੇ ਅਨੁਸਾਰ ਖਰਚ ਕਰੇ ਅਤੇ ਜਿਸ ਦੀ ਆਮਦਨ ਘੱਟ ਹੋਵੇ ਉਸ ਨੂੰ ਚਾਹੀਦਾ ਹੈ ਕਿ ਅੱਲਾਹ ਨੇ ਜਿਨ੍ਹਾਂ ਉਸ ਨੂੰ ਪ੍ਰਦਾਨ ਕੀਤਾ ਹੈ। ਉਹ ਉਸ ਵਿਚੋਂ ਖਰਚ ਕਰਨ। ਅੱਲਾਹ ਕਿਸੇ ਤੇ ਬੋਝ ਨਹੀਂ ਪਾਉਂਦਾ, ਪਰ ਉਸ ਮੁਤਾਬਿਕ ਜਿਨ੍ਹਾਂ ਉਸਨੂੰ ਬਖਸ਼ਿਆ ਹੈ। ਅੱਲਾਹ ਮੁਸੀਬਤ ਤੋਂ ਬਾਅਦ ਜਲਦੀ ਹੀ ਸੌਖ ਹੈਦਾ ਕਰ ਦੇਵੇਗਾ ਹੈ।",
            "verse 65:8": "ਅਤੇ ਬਹੁਤ ਸਾਰੀਆਂ ਬਸਤੀਆਂ ਹਨ ਜਿਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਰੱਬ ਦੇ ਹੁਕਮ ਤੋਂ ਮੂੰਹ ਮੌੜਿਆ। ਸੋ ਅਸੀਂ ਉਨ੍ਹਾਂ ਦਾ ਸਸ਼ਤ ਹਿਸਾਬ ਕੀਤਾ ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਭਿਆਨਕ ਦੰਡ ਦਿੱਤਾ।",
            "verse 65:9": "ਸੋ ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਕੀਤੇ ਦਾ ਸਵਾਦ ਲਿਆ ਅਤੇ ਉਨ੍ਹਾਂ ਦਾ ਅੰਤ ਘਾਟੇ ਵਿਚ ਹੋਇਆ।",
            "verse 65:10": "ਅੱਲਾਹ ਨੇ ਉਨ੍ਹਾਂ ਲਈ ਇੱਕ ਦਰਦਨਾਕ ਸਜ਼ਾ ਤਿਆਰ ਕਰ ਰੱਖੀ ਹੈ। ਸੋ ਅੱਲਾਹ ਤੋਂ ਡਰੋ। ਹੇ ਬੁੱਧੀ ਵਾਲਿਉ! ਜਿਹੜੇ ਕਿ ਈਮਾਨ ਲਿਆਏ ਹੋ। ਅੱਲਾਹ ਨੇ ਤੁਹਾੜੇ ਵੱਲ ਇੱਕ ਉਪਦੇਸ਼ ਉਤਾਰਿਆ ਹੈ।",
            "verse 65:11": "ਇੱਕ ਰਸੂਲ ਜਿਹੜਾ ਤੁਹਾਨੂੰ ਅੱਲਾਹ ਦੀਆਂ ਸਪੱਸ਼ਟ ਆਇਤਾਂ ਪੜ੍ਹ ਕੇ ਸੁਣਾਉਂਦਾ ਹੈ, ਤਾਂ ਕਿ ਉਨ੍ਹਾਂ ਲੋਕਾਂ ਨੂੰ ਹਨ੍ਹੇਰਿਆਂ ਵਿਚੋਂ ਪ੍ਰਕਾਸ਼ ਵੱਲ ਕੱਢੇ ਜਿਹੜੇ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਭਲੇ ਕਰਮ ਕੀਤੇ। ਉਸ ਨੂੰ ਉਹ ਅਜਿਹੇ ਬਾਗ਼ਾਂ ਵਿਚ ਦਾਖ਼ਿਲ ਕਰੇਗਾ, ਜਿਨ੍ਹਾਂ ਦੇ ਥੱਲੇ ਨਹਿਰਾਂ ਵਗਦੀਆਂ ਹੌਣਗੀਆਂ। ਉਹ ਉਸ ਵਿਚ ਹਮੇਸ਼ਾ ਰਹਿਣਗੇ। ਅੱਲਾਹ ਨੇ ਉਸ ਨੂੰ ਬਹੁਤ ਚੰਗਾ ਰਿਜ਼ਕ ਦਿੱਤਾ।",
            "verse 65:12": "ਅੱਲਾਹ ਹੀ ਹੈ ਜਿਸਨੇ ਸੱਤ ਅਸਮਾਨ ਬਣਾਏ ਅਤੇ ਉਨ੍ਹਾਂ ਵਾਂਗ ਧਰਤੀ ਵੀ। ਉਨ੍ਹਾਂ ਵਿਚ ਅੱਲਾਹ ਦੇ ਹੁਕਮ ਉਤਰਦੇ ਹਨ, ਤਾਂ ਕਿ ਤੁਸੀਂ ਸਮਝੋਂ ਕਿ ਅੱਲਾਹ ਹਰ ਚੀਜ਼ ਦੀ ਸਮਰੱਥਾ ਰੱਖਦਾ ਹੈ। ਅਤੇ ਅੱਲਾਹ ਨੇ ਆਪਣੇ ਗਿਆਨ ਨਾਲ ਹਰ ਚੀਜ਼ ਨੂੰ ਆਪਣੇ ਘੇਰੇ ਵਿਚ ਲਿਆ ਹੋਇਆ ਹੈ।"
        },
        "Roman english": {
            "verse 65:1": "Yaaa ayyuhan nabiyyu izaa tallaqtummun nisaaa`a fatalliqoohunna li`iddatihinna wa ahsul`iddata; wattaqul laaha rabbakum laa tukhri joohunna mim bu-yootihinna wa laa yakhrujna illaaa any yaateema bifaahishatim mubaiyinah; wa tilka hudoodul laah; wa many yata`adda hudoodal laahi faqad zalama nafsha; laa tadree la`allal laaha yuhdisu ba`dazaalika amraa",
            "verse 65:2": "Fa izaa balaghna ajalahunna fa amsikoohunna bima`roofin aw faariqoohunna bima`roofinw wa ashhidoo zawai `adlim minkum wa aqeemush shahaadata lillaah; zaalikum yoo`azu bihee man kaana yu`minu billaahi wal yawmil aakhir; wa many yattaqil laaha yaj`al lahoo makhrajaa",
            "verse 65:3": "Wa yarzuqhu min haisu laa yahtasib; wa many yatawakkal `alal laahi fahuwa husbuh; innal laaha baalighu amrih; qad ja`alal laahu likulli shai`in qadraa",
            "verse 65:4": "Wallaaa`ee ya`isna minal maheedi min nisaaa `ikum inir tabtum fa`iddatuhunna salaasatu ashhurinw wallaaa`ee lam yahidn; wa ulaatul ahmaali ajaluhunna any yada`na hamlahun; wa many yattaqil laaha yaj`al lahoo min armrihee yusraa",
            "verse 65:5": "Zaalika amrul laahi anzalahoo ilaikum; wa many yattaqil laaha yukaffir `anhu saiyi aatihee wa yu`zim lahoo ajraa",
            "verse 65:6": "Askinoohunna min haisu sakantum minw wujdikum wa laa tudaaarroohunna litudaiyiqoo `alaihinn; wa in kunna ulaati hamlin fa anfiqoo `alihinna hattaa yada`na hamlahunn; fain arda`na lakum fa aatoo hunna ujoorahunna waatamiroo bainakum bima`roofinw wa in ta`aasartum fasaturdi`u lahooo ukhraa",
            "verse 65:7": "Liyuntiq zoo sa`atim min sa`atihee wa man qudira `alaihi riquhoo falyunfiq mimmaaa aataahul laah; laa yukalliful laahu nafsan illaa maaa aataahaa; sa yaj`alul laahu ba`da`usriny yusraa",
            "verse 65:8": "Wa ka ayyim min qaryatin `atat `an amri Rabbihaa wa Rusulihee fahaasabnaahaa hisaaban shadeedanw wa `azzabnaahaa `azaaban nukraa",
            "verse 65:9": "Fazaaqat wabbala amrihaa wa kaana `aaqibatu amrihaa khusraa",
            "verse 65:10": "A`addal laahu lahum `azaaban shadeedan fattaqul laaha yaaa ulil albaab, allazeena aammanoo; qad anzalal laahu ilaikum zikraa",
            "verse 65:11": "Rasoolany yatloo `alaikum aayaatil laahi mubaiyinaatil liyukhrijal lazeena aamanoo wa `amilus saalihaati minaz zulumaati ilan noor; wa many yu`mim billaahi wa ya;mal saalihany yudkhilhu jannaatin tajree min tahtihal anhaaru khaalideena feehaa abadan qad ahsanal laahu lahoo rizqqq",
            "verse 65:12": "Allaahul lazee khalaq Sab`a Samaawaatinw wa minal ardi mislahunna yatanazzalul amru bainahunna lita`lamooo annal laaha `alaa kulli shai`in Qadeerunw wa annal laaha qad ahaata bikulli shai`in ilmaa"
        },
        "Russian": {
            "verse 65:1": "О пророк! Когда даете вы развод своим супругам, То разводитесь в срок, для них определенный, И срок отсчитывайте верно. Страшитесь разгневить Аллаха, вашего Владыку! И из домов, принадлежащих им, не изгоняйте их, И сами не должны они свой дом покинуть, Коль явный блуд они не совершили. Вот те границы, что Аллах установил. И каждый, кто нарушит их, Зло причинит своей душе, И вы не знаете - ведь волею Аллаха Перемениться может все.",
            "verse 65:2": "Когда же истечет назначенный им срок, Верните их с достоинством обратно Или с достоинством расстаньтесь с ними И призовите двух свидетелей из вас, (Известных) справедливостью своею. И установят пусть свидетельство свое Они (как будто) пред Аллахом. Сие есть предписание для тех, Кто верует в Аллаха и Последний День. Кто гнева Господа страшится, Тому Господь устроит Свой исход",
            "verse 65:3": "И даст ему потребное (для жизни), Откуда он не ведает совсем. И кто на Господа свои молитвы возлагает, Тому не надо никого, кроме Него, - Ведь Он один вершит все назначенья. Поистине, Он меру должную всему установил.",
            "verse 65:4": "Для женщин, у которых по годам уж завершен их рЕгул, Но если все ж у вас сомненья есть, Срок (ожидания развода) - три месяца, Как равно и для тех, у коих еще не было регула. Тех женщин, кто во чреве жизнь несет, Вам нужно ждать, пока они не сложат ношу. Но облегчит все тяготы Господь Тем, кто страшится Его гнева.",
            "verse 65:5": "Сие есть повеление Аллаха, Которое для вас Он ниспослал, И тем, кто гнева Господа страшится, Награду увеличит Он и снимет все грехи.",
            "verse 65:6": "И пусть (за время прохождения иддата) Живут они в условиях таких же, как и вы, Согласно вашему достатку. Им утеснений в доме не чините. А коль несут они во чреве жизнь, Расходуйте на них, Пока они своей не сложат ноши. И коль они выкармливают ваше чадо, Выплачивайте им вознагражденье. И меж собой с достоинством ведите разговор, Но если затруднитесь (в этом разговоре), То пусть другая женщина вскормИт дитя.",
            "verse 65:7": "И пусть богатый человек Согласно своему достатку тратит. А тот, чья доля сочтена, Пусть тратит из того, чем одарил Его Аллах. Ведь не возложит Он на душу груз, Что больше, чем Он ей назначил; За каждой тяготой пошлет Он облегченье.",
            "verse 65:8": "Ведь сколько поселений (на земле) От повелений Господа надменно отреклись, Ослушались посланников Его! Расчетом сильным Мы их рассчитали И предали их тяжким наказаньям (на земле).",
            "verse 65:9": "Тогда они сполна вкусили от плодов своих поступков, И их концом была (всеобщая) погибель.",
            "verse 65:10": "Аллах для них суровую расплату уготовил, А потому страшитесь Его гнева Все, кто уверовал (в Него), И те, кто обладает разуменьем, - Аллах, поистине, послал напоминанье вам -",
            "verse 65:11": "Посланника, который вам знамения Господни Толкует ясным языком, Чтобы из мрака к свету повести Благотворящих и уверовавших (в Истину Его). Введет Он их в Сады, реками омовенны, И вечно пребывать им там, - Поистине, Аллах для них Прекраснейшую долю уготовил.",
            "verse 65:12": "Аллах есть Тот, Кто создал семь небес и столько же земель. Меж ними повеления Его нисходят, Чтоб знали вы всю силу Его мощи И всеобъемлющий охват Его познанья!"
        },
        "Sindhi": {
            "verse 65:1": "اي پيغمبر (پنھنجي اُمت کي چؤ ته اوھين) جڏھن زالن کي طلاق ڏيڻ جو ارادو ڪريو تڏھن کين عِدت (جي شروع) ۾ طلاق ڏيو ۽ عِدَّت ڳڻيو، ۽ پنھنجي پالڻھار الله کان ڊڄو، کين سندن گھرن مان (عِدّت جي مُدّت ۾) پڌري بي حيائي جي ڪرڻ کانسواءِ نه ڪڍو ۽ (جڳائي ته) اُھي (پاڻ به) نه نڪرن، اھي الله جون (مُقرّر ڪيل) حدون آھن، ۽ جيڪو الله جون حدون (لتاڙي) لنگھندو تنھن بيشڪ پنھنجي جيءُ تي ظلم ڪيو، ڪوبه نه ڄاڻندو آھي ته اُن (طلاق ڏيڻ) کانپوءِ (متان) الله ڪو ٻيو رستو پيدا ڪري.",
            "verse 65:2": "پوءِ جڏھن (طلاق واريون) پنھنجي مُدّت کي پھچن تڏھن چڱي طرح سان کين رکو يا چڱي طرح سان کين ڇڏي ڏيو ۽ پاڻ مان ٻه معتبر شاھد ڪريو ۽ الله لڳ شاھدي پوري ڏيو، انھيءَ (حُڪم) سان انھيءَ کي نصيحت ڏجي ٿي جيڪو الله ۽ قيامت جي ڏينھن کي مڃيندو ھجي ۽ جيڪو الله کان ڊڄندو تنھن جي نڪرڻ جي (الله) ڪا واھ ڪندو.",
            "verse 65:3": "۽ کيس اُتاھون روزي ڏيندو جتان گمان ئي نه ھوندس، ۽ جيڪو الله تي ڀروسو ڪندو تنھن کي الله ڪافي آھي، بيشڪ الله پنھنجي ڪم کي پورو ڪندڙ آھي، بيشڪ الله سڀڪنھن شيءِ جو اندازو ڪيو آھي.",
            "verse 65:4": "۽ اوھان جي (طلاق ڏنل) زالن مان جيڪي حيض کان نااُميد ٿيون ھجن (تن جي عِدّت بابت) جيڪڏھن شڪ ۾ پيا آھيو ته انھن جي عِدّت ٽي مھينا آھي ۽ جيڪي اڃا حيض واريون نه ٿيون آھن (تن جي به)، ۽ پيٽ وارين زالن جي عِدّت اِھا آھي جو ٻار ڄڻين، ۽ جيڪو الله کان ڊڄندو تنھن لاءِ الله سندس ڪم ۾ آساني ڪندو.",
            "verse 65:5": "اھو الله جو حُڪم آھي جو اوھان ڏانھن ڏانھن نازل ڪيائين، ۽ جيڪو الله کان ڊڄندو تنھن جون مدايون الله کانئن ميٽيندو ۽ ان کي اجر وڌيڪ ڏيندو.",
            "verse 65:6": "جتي پنھنجي وس آھر (اوھين) ٽڪندا آھيو تتي انھن کي (عدت جا ڏينھن) ٽڪايو ۽ کين ھن لاءِ نه ايذايو ته انھن کي تنگ ڪريو، ۽ جيڪڏھن پيٽ سان ھجن ته جيسين پنھنجو ٻار ڄڻين (تيسين) کين خرچ ڏيو، پوءِ جيڪڏھن اوھان جي حُڪم موجب (اُھي ٻار کي) کير پيارين ته کين سندن مزوري ڏيو، ۽ ھلي چليءَ موجب پاڻ ۾ صلاح ڪريو، ۽ جيڪڏھن پاڻ ۾ سختي ڪريو ته اُن کي ٻي (ڪا) کير پياري.",
            "verse 65:7": "جڳائي ته وس وارو پنھنجي وس آھي خرچ ڪري، ۽ جنھن تي روزي تنگ ڪئي ويئي آھي تنھن کي جڳائي ته جيڪي الله کيس ڏنو آھي تنھن مان خرچ ڪري، ڪنھن کي الله تڪليف نه ڏيندو آھي پر (اوتري قدر) جيتري قدر کيس الله ڏنو آھي، سگھوئي الله ڏکيائيءَ کانپوءِ سکيائي ظاھر ڪندو.",
            "verse 65:8": "۽ (اھڙا) گھڻائي ڳوٺ (ھوا) جن پنھنجي پالڻھار جي حُڪم ۽ سندس پيغمبرن (جي حڪم) کان نافرماني ڪئي پوءِ سخت عذاب سان انھن کي پڪڙيوسون ۽ سخت عذاب سان کين عذاب ڪيوسون.",
            "verse 65:9": "پوءِ انھن (ڳوٺ وارن) پنھنجي ڪم جي سزا چکي ۽ انھن جي ڪم جي پڇاڙي خراب ٿي.",
            "verse 65:10": "انھن لاءِ الله سخت عذاب تيار ڪيو آھي تنھنڪري اي عقل وارا مؤمنؤ الله کان ڊڄو، بيشڪ الله اوھان ڏانھن ھڪ نصيحت موڪلي آھي.",
            "verse 65:11": "جو رسول آھي جو اوھان تي الله جون پڌريون آيتون (ھن لاءِ) پڙھندو آھي ته جن ايمان آندو ۽ چڱا ڪم ڪيا تن کي اونداھين کان سوجھري ڏانھن ڪڍي، ۽ جيڪو الله تي ايمان آڻيندو ۽ چڱا ڪم ڪندو تنھن کي اھڙن باغن ۾ داخل ڪندو جن جي ھيٺان واھيون وھنديون آھن اُتي ھميشه رھندا، بيشڪ اُن جي روزي چڱي طرح ٺاھي آھي.",
            "verse 65:12": "الله اُھو آھي جنھن ستن آسمانن کي بڻايو ۽ اوتريون زمينون به، اُنھن جي وچ ۾ اُن جو حُڪم نازل ٿيندو آھي ته ڄاڻو ته الله سڀڪنھن شيءَ تي وس وارو آھي ۽ ته الله عِلم سان سڀڪنھن شيءِ کي وڪوڙيو آھي."
        },
        "Sinhalese": {
            "verse 65:1": "අහෝ නබිවරය! නුඹලා බිරියන් දික්කසාද කරන විට ඔවුන්ගේ ඉද්දා ව (පොරොත්තු කාලය) ගණන් කිරීමට පහසු වන අයුරින් නුඹලා ඔවුන් දික්කසාද කරනු. තවද ඉද්දා කාලය ගණනය කරනු. තවද නුඹලාගේ පරමාධිපති වූ අල්ලාහ්ට බිය බැතිමත් වනු. පැහැදිලි දුරාචාරයක් සමග ඔවුන් පැමිණියා නම් මිස ඔවුන්ගේ නිවෙස් වලින් නුඹලා ඔවුන් පිටුවහල් නොකරනු. එමෙන්ම ඔවුන් ද පිටවිය නොයුතුය. තවද එය අල්ලාහ්ගේ සීමාවන්ය. තවද කවරෙකු අල්ලාහ්ගේ සීමාවන් ඉක්මවා යන්නේ ද එවිට සැබැවින්ම ඔහු ඔහුටම අපරාධ කර ගත්තේය. මින් පසු ව යම් කරුණක් අල්ලාහ් ඇති කරන්නට පුළුවණ යන වග නුඹ නොදන්නෙහිය.",
            "verse 65:2": "(දික්කසාදයට පත්) ඔවුන්ගේ නියමිත (ඉද්දා) කාල සීමාවට ඔවුන් ළඟා වූ විට නුඹලා යහපත් අයුරින් ඔවුන්ව (භාර්යාවන් ලෙස) රඳවා ගනු. එසේ නැතහොත් නුඹලා යහපත් අයුරින් ඔවුන්ගෙන් වෙන් වනු. තවද නුඹලා අතරින් යුක්තිගරුක දෙදෙනෙකු සාක්ෂියට පත් කර ගනු. අල්ලාහ් වෙනුවෙන් එම සාක්ෂිය නුඹලා ඉටු කරනු. අල්ලාහ් හා පරමාන්ත දිනය විශ්වාස කරමින් සිටින්නාට මෙමගින් උපදෙස් දෙනු ලබනුයේ එලෙසයි. තවද කවරෙකු අල්ලාහ්ට බිය බැතිමත් වන්නේ ද ඔහු ඔහුට බැහැර වීමේ මගක් ඇති කරයි.",
            "verse 65:3": "තවද ඔහු නොසිතූ අයුරින් ඔහු(අල්ලාහ්) ඔහුට පෝෂණය කරයි. තවද කවරෙකු අල්ලාහ් වෙත (සියල්ල) භාර කරන්නේ ද එවිට ඔහු ඔහුට ප්‍රමාණවත්ය. නියත වශයෙන්ම අල්ලාහ් ඔහුගේ කාර්යය සිදු කරන්නාය. සෑම දෙයකටම නියමිත ප්‍රමාණයක් අල්ලාහ් ඇති කළේය.",
            "verse 65:4": "තවද නුඹලාගේ බිරියන් අතරින් ඔසප් වීමේ තත්ත්වය ගැන බලාපොරොත්තු සුන් කර ගත්තවුන් වනාහි නුඹලා ඔවුන් ගැන සැක කළෙහු නම් ඔවුන්ගේ ඉද්දා කාලය මාස තුනකි. තවද ඔසප් තත්ත්වයට පත් නොවූ කාන්තාවන්ට ද (එලෙසමය.) ගර්භණී මාතාවන් වනාහි ඔවුන්ගේ (ඉද්දා) කාල සීමාව ඔවුන්ගේ ගැබිනි තත්ත්වය බහා ලීමයි. තවද කවරෙකු අල්ලාහ්ට බිය වන්නේ ද ඔහුගේ කාර්යය ඔහුට ඔහු පහසු කර දෙනු ඇත.",
            "verse 65:5": "එය අල්ලාහ්ගේ නියෝගයයි. ඔහු එය නුඹලා වෙත පහළ කළේය. තවද කවරෙකු අල්ලාහ්ට බිය බැතිමත් වන්නේ ද ඔහු ඔහුගේ පාපයන් ඔහුගෙන් ඉවත් කරයි. තවද ඔහුට කුලිය මහත් සේ පිරිනමයි.",
            "verse 65:6": "නුඹලාගේ (ආර්ථික) පැවැත්ම අනුව නුඹලා වාසය කළ අයුරින්ම (ඉද්දා කාලය තුළ) ඔවුන් ව ද නුඹලා වාසය කරවනු. තවද නුඹලා ඔවුන් කෙරෙහි පීඩනය ඇති කරනු පිණිස නුඹලා ඔවුනට හිංසා නොකරනු. ඔවුන් ගර්භණී මව්වරුන් ලෙස සිටියේ නම් ඔවුන්ගේ ගැබ් (ගෙන ඇති දරුවා) ප්‍රසූත කරන තෙක් ඔවුන් වෙත නුඹලා වියදම් කරනු. නුඹලා වෙනුවෙන් (නුඹලාගේ දරුවන්ට) ඔවුන් කිරි පොවන්නේ නම් එවිට ඔවුන්ගේ කුලී නුඹලා ඔවුනට පිරිනමනු. නුඹලා අතර (එය) යහපත් අයුරින් කළමනා කරණය කරනු. නුඹලා එකිනෙකා අපහසු තත්ත්වයකට පත් වූයෙහු නම් දරුවාට වෙනත් අයෙකු කිරි දෙත්වා.",
            "verse 65:7": "වත්කම් ඇත්තෝ තම වත්කම අනුව වියදම් කරත්වා! තවද කවුරුන් වෙත තම පෝෂණ සම්පත් සීමා කරනු ලැබුවේ ද එවිට අල්ලාහ් ඔහුට කවර දෙයක් පිරිනමා ඇත්තේ ද එයින් ඔහු වියදම් කරත්වා! අල්ලාහ් ලබා දී ඇති දැයට වඩා වැඩියෙන් (දෙන මෙන්) කිසිවෙකුට හෝ බල කරන්නේ නැත. දුෂ්කරත්වයෙන් පසු ව අල්ලාහ් පහසු ව ඇති කරයි.",
            "verse 65:8": "තම පරමාධිපතිගේ නියෝගයට හා ඔහුගේ දූතයාණන්ට පිටුපෑ ගම්මාන කොපමණක් වී ද? එවිට අපි දැඩි විනිශ්චයකින් එය විනිශ්චය කළෙමු. තවද දරුණු දඬුවමකින් අපි එයට දඬුවම් කළෙමු.",
            "verse 65:9": "එවිට එය එහි විෂයෙහි විපාකය භුක්ති වින්දේය. තවද එහි විෂයෙහි අවසානය පරාජයක් විය.",
            "verse 65:10": "අල්ලාහ් ඔවුනට දැඩි දඬුවමක් සූදානම් කර ඇත. එහෙයින් දේවත්වය විශ්වාස කළ ප්‍රබුද්ධිමත් ජනයිනි! නුඹලා අල්ලාහ්ට බිය බැතිමත් වනු. සැබැවින්ම අල්ලාහ් නුඹලා වෙත මෙනෙහි කිරීමක් පහළ කර ඇත.",
            "verse 65:11": "විශ්වාස කොට යහකම් කළවුන් අන්ධකාරයන්ගෙන් ආලෝකය වෙත බැහැර කරනු පිණිස අල්ලාහ්ගේ වදන් නුඹලා වෙත පාරායනය කරන රසූල්වරයකු ද (පහළ කළේය.) කවරෙකු අල්ලාහ් ව විශ්වාස කොට යහකම් කරන්නේ ද ඔහු ව ඒවාට පහළින් ගංගාවෝ ගලා බස්නා උයන් වලට ඔහු ඇතුළත් කරනු ඇත. (ඔවුන්) එහි සදහටම සදාතනිකයින් වෙති. අල්ලාහ් ඔහුට පෝෂණ සම්පත් අලංකාරවත් කළේය.",
            "verse 65:12": "අහස් හතක් හා මහපොළොවෙන් ඒවාට සමාන දෑ ද මැව්වේ අල්ලාහ්ය. නියත වශයෙන්ම අල්ලාහ් සියලු දෑ කෙරෙහි ශක්තිය ඇත්තා බවත් සියලු දෑ පිළිබඳ ව දැනුමෙන් ඔහු සර්ව ප්‍රකාරයෙන් වටලාගෙන සිටින බවත් නුඹලා දැන ගනු පිණිස ඒවා අතරට (ඔහුගේ) නියෝගය පහළ වනු ඇත."
        },
        "Somali": {
            "verse 65:1": "Nabiyow haddaad haweenka furaysaan Cidada ku fura (daahir aan la taaban) Cidadana tiriya, Eebana ka dhawrsada, hana ka bixinina Guryahooda (ay joogeen markay la furayey) iyana yeyna ka bixin (yeyan ka tagin) inay xumaan cad la yimaadaan mooyee, taasi waa xuduudii Eebe, ruuxii ka tallaba xuduuda Eebena naftiisuu dulmiyey, ma ogidin, wuxuu Eebe u dhawyahay inuu ka dib xaal keeno, (jacayl isku noqosho).",
            "verse 65:2": "Markay Cidada dhamaadkeeda (ku dhawaadaan) si fiican u haysta, ama si fiican u faaruqa, dad caadiliina oo idin ka mid ahna marag uga dhiga, maragana ha u guteen Eebe dartiis, xaalkaasi waa wacdi ruuxii rumayn Eebe iyo Maalintii dambaysay «yiaamada» ruuxii Eebe ka dhawrsadana wuxuu u furi faraj.",
            "verse 65:3": "Wuxuuna ka irsaaqi meel uusan ka filanayn, ruuxii Eebe tala saartana waa ku filan yahay, Eebana amarkiisu waa fuli, (waxna kama fakado) wax walbana Eebe wuxuu u yeelay waqti sugan (oo go'an).",
            "verse 65:4": "Haweenkiinna Caadada ka quustay haddaad shakidaan Cidadoodu waa seddex bilood, kuwaan Caada lahayn waa sidaas oo kale, Haweenka uurka leh cidadoodu waa inay umulaan (dhalaan), ruuxii Eeb ka dhawrsadana wuxuu u fududayn amarkiisa.",
            "verse 65:5": "Kaasi waa amarkii Eebe uu idiin soo dejiyey, ruuxii Eebe ka dhawrsadana xumaantiisuu asturaa ajirkiisana wuu weyneeyaa.",
            "verse 65:6": "dejiya Haweenkaas (cidada ku jira) meelahaad dagan tihiin eed heli kartaan, hana dhibina si aad u ciriiridaan, hadday uur leeyihiinna nafaqeeya (masruufa) intay ka umuulaan (kadhalaan), hadday ilmaha nuujiyaanna siiya ujuuro, wanaagna is fara, haddii laysku qabto nuujintana mid kale ayaa nuujin.",
            "verse 65:7": "Haka nafaqeeyo (masruufo) midka awood xoola leh awooddiisa, kan wax yarna haka nafaqeeyo waxa Eebe siiyey (ee uu karo), Eebana kuma mashaqeeyo naf wuxuusan siinin, Eebana wuxuu yeeli cidhiidhi dabadiis fudayd (faraj).",
            "verse 65:8": "Maxay badan tahay Magaalo Caasiday amarka Eebe iyo Rusushiisa, markaas Eebe xisaabay xisaab daran caddibaad adagna caddibay.",
            "verse 65:9": "oo dhadhamisay Cidhibtii xaalkaa xumaantiisa, cidhibteediina ku dambaysay khasaare.",
            "verse 65:10": "Eebe wuxuu u darbay kuwaas Caddibaad daran, ee Eebe ka dhawrsada kuwa Caqliga lahaw rumeeyeyowna, Ilaahay wuxuu idiin soo dejiyey Quraane.",
            "verse 65:11": "Rasuulna wuu idiin soo diray kassoo idiin akhriya Aayaadka Eebe ee cad cad si uu kuwa Mu'miniinta ah camal wanaagsanna falay uga bixiyo mugdiga Nuurkana ugu bixiyo mugdiga Nuurkana ugu bixiyo, ruuxii Eebe rumeeya camal wanaagsanna fala wuxuu gelin Jannooyin ay dureerayso dhexdeeda Wabiyaal wayna ku waari waligood, Eebe waa wanaajiyey kuwaas risqigooda.",
            "verse 65:12": "Eebe waa kan abuuray Todobo Samo Dhulkana kala mid dhigay, amarka Eebena wuxuu ku soo degaa dhexdooda, si aad u ogaataan in Eebe wax walba karo wax walbana koobay."
        },
        "Spanish": {
            "verse 65:1": "Profeta! Cuando divorciéis a las mujeres, hacedlo de manera que estén en disposición de empezar su período de espera.Guardad el período de espera y temed a Allah, vuestro Señor.No las hagáis salir de sus casas ni tampoco salgan ellas, a menos que hayan cometido una indecencia evidente.Estos son los límites de Allah; quien traspase los límites de Allah, habrá sido injusto consigo mismo. Tú no sabes si Allah dispondrá otra cosa después.",
            "verse 65:2": "Y cuando hayan alcanzado su periodo de espera, o bien os quedáis con ellas como es debido u os separáis de ellas como es debido. Y haced que dos de vosotros, que sean rectos, sean testigos. Cumplid el testimonio por Allah.A eso se exhorta a quien crea en Allah y en el Último Día.Y quien teme a Allah, Él le da una salida.",
            "verse 65:3": "Y le provee desde donde no lo espera. Quien se abandone en Allah, Él le bastará.Es cierto que la orden de Allah llega hasta donde Él quiere.Allah le ha dado a cada cosa un término y una medida.",
            "verse 65:4": "Y aquellas de vuestras mujeres que hayan llegado a la menopausia, si dudáis de su período de espera, éste son tres meses; así como para la que aún no haya tenido la menstruación.Y las que estén embarazadas, su período de espera será hasta que den a luz.Quien teme a Allah, Él le dará facilidad en lo suyo.",
            "verse 65:5": "Ese es Su mandato, el que Allah ha hecho descender para vosotros. Y quien tema a Allah, Él le cubrirá sus maldades y le aumentará su recompensa.",
            "verse 65:6": "Alojadlas donde os alojáis, según vuestros medios, pero no las perjudiquéis haciéndoles pasar estrechez.Y si estuvieran embarazadas ocuparos de su manutención hasta que den a luz. Y si dan de mamar a vuestros hijos, dadles la remuneración que corresponda y llegad a un acuerdo entre vosotros como es debido.Y si tenéis dificultades, que amamante a su hijo otra.",
            "verse 65:7": "Quien posea con holgura, que gaste de acuerdo a su holgura; y a quien se le haya dado una provisión restringida, que gaste de acuerdo a lo que Allah le haya dado.Allah no le impone a nadie sino en la medida de lo que le da.Allah da facilidad después de la dificultad.",
            "verse 65:8": "A cuántas ciudades que desobedecieron la orden de su Señor y la de Sus mensajeros, las hicimos rendir cuentas con dureza y las castigamos con un terrible castigo.",
            "verse 65:9": "Gustaron las malas consecuencias de su actitud y su fin fue la perdición.",
            "verse 65:10": "Allah les ha preparado un fuerte castigo. Así pues, temed a Allah, vosotros que sabéis reconocer lo esencial, vosotros que creéis. Allah ha hecho descender para vosotros un recuerdo.",
            "verse 65:11": "Un Mensajero que os lee los signos de Allah clarificados, para sacar a los que creen y practican las acciones de bien de la tinieblas a la luz.A quien crea en Allah y obre con rectitud le haremos entrar en jardines por cuyo suelo corren los ríos en los que será inmortal para siempre.Allah le habrá hecho buena la provisión.",
            "verse 65:12": "Allah es Quien ha creado los siete cielos y otro tanto de tierra.La orden desciende a través de ellos para que sepáis que Allah tiene poder sobre todas las cosas y que el conocimiento de Allah todo lo abarca."
        },
        "Swahili": {
            "verse 65:1": "Ewe Nabii! Mtakapo wapa talaka wanawake, basi wapeni talaka katika wakati wa eda zao. Na fanyeni hisabu ya eda. Na mcheni Mwenyezi Mungu, Mola wenu Mlezi. Msiwatoe katika nyumba zao, wala wasitoke wenyewe, ila wakifanya jambo la uchafu ulio wazi. Hiyo ndiyo mipaka ya Mwenyezi Mungu, msiikiuke. Na mwenye kuikiuka mipaka ya Mwenyezi Mungu, basi amejidhulumu nafsi yake. Hujui; labda Mwenyezi Mungu ataleta jambo jengine baada ya haya.",
            "verse 65:2": "Basi wanapo fikia muda wao, ima warejeeni muwaweke kwa wema, au farikianeni nao kwa wema. Na mshuhudishe mashahidi wawili waadilifu miongoni mwenu. Na simamisheni ushahidi kwa ajili ya Mwenyezi Mungu. Hivyo ndivyo anavyo agizwa anaye muamini Mwenyezi Mungu na Siku ya Mwisho. Na anaye mcha Mwenyezi Mungu humtengezea njia ya kutokea.",
            "verse 65:3": "Na humruzuku kwa jiha asiyo tazamia. Na anaye mtegemea Mwenyezi Mungu Yeye humtosha. Hakika Mwenyezi Mungu anatimiza amri yake. Mwenyezi Mungu kajaalia kila kitu na kipimo chake.",
            "verse 65:4": "Na wale walio sita hedhi miongoni mwa wanawake wenu, ikiwa mnayo shaka, basi muda wa eda yao ni miezi mitatu, pamoja na ambao hawapati hedhi. Na wenye mimba eda yao mpaka watakapo zaa. Na anaye mcha Mwenyezi Mungu, Mwenyezi Mungu humfanyia mambo yake kuwa mepesi.",
            "verse 65:5": "Hiyo ni amri ya Mwenyezi Mungu amekuteremshieni. Na anaye mcha Mwenyezi Mungu atamfutia maovu yake, na atampa ujira mkubwa.",
            "verse 65:6": "Wawekeni humo humo mnamo kaa nyinyi kwa kadiri ya pato lenu, wala msiwaletee madhara kwa kuwadhiki. Na wakiwa wana mimba, wagharimieni mpaka wajifungue. Na wakikunyonyesheeni, basi wapeni ujira wao, na shaurianeni kwa wema. Na mkiona uzito kati yenu, basi amnyonyeshee mwanamke mwengine.",
            "verse 65:7": "Mwenye wasaa atoe kadiri ya wasaa wake, na mwenye dhiki atoe katika alicho mpa Mwenyezi Mungu. Mwenyezi Mungu hamkalifishi mtu ila kwa kadiri ya alicho mpa. Mwenyezi Mungu atajaalia baada ya dhiki faraji.",
            "verse 65:8": "Na miji mingapi iliyo vunja amri ya Mola wake Mlezi na Mitume wake, basi tuliihisabia hisabu ngumu na tukaiadhibu kwa adhabu kali.",
            "verse 65:9": "Basi ikauonja ubaya wa mambo yake; na mwisho wa mambo yao ilikuwa khasara.",
            "verse 65:10": "Mwenyezi Mungu aliwaandalia adhabu kali. Basi mcheni Mwenyezi Mungu, enyi wenye akili, mlio amini! Hakika Mwenyezi Mungu amekuteremshieni Ukumbusho,",
            "verse 65:11": "Mtume anaye kusomeeni Aya za Mwenyezi Mungu zinazo bainisha, ili kuwatoa walio amini na wakatenda mema kutoka gizani kuwapeleka kwenye nuru. Na mwenye kumuamini Mwenyezi Mungu, na akatenda mema, atamwingiza katika Bustani zipitazo mito kati yake, wadumu humo milele. Mwenyezi Mungu amekwisha mpa riziki nzuri.",
            "verse 65:12": "Mwenyezi Mungu ni yule ambaye ameziumba mbingu saba, na ardhi kwa mfano wa hizo. Amri zake zinashuka baina yao, ili mjue kwamba Mwenyezi Mungu ni Mwenye uweza juu ya kila kitu, na kwamba Mwenyezi Mungu amekizunguka kila kitu kukijua vilivyo kwa ilimu yake."
        },
        "Swedish": {
            "verse 65:1": "PROFET! När någon av er har för avsikt att skilja sig från sin hustru, skall han [iaktta] den föreskrivna väntetiden och beräkna denna tid [med all noggrannhet]. Och frukta Gud, er Herre! Mannen får inte tvinga [hustrun] att lämna hemmet och hon skall inte heller [självmant] lämna det annat än om hon gjort sig skyldig till en grovt oanständig [eller annan förkastlig] handling. Dessa är de regler som Gud [har föreskrivit], och den som överträder dessa av Gud [givna] regler har begått orätt mot sig själv; det är nämligen möjligt - om det kan du ingenting veta - att Gud efter det [som varit] låter ett nytt läge uppstå.",
            "verse 65:2": "[När någon av er skilt sig från sin hustru] och hennes väntetid närmar sig sitt slut, skall han antingen hålla henne kvar eller också låta henne gå, allt i hedersamma former. Och tag två rättsinniga människor ur er krets till vittnen, och avge själva vittnesmål inför Gud! Denna maning riktas till alla som tror på Gud och den Yttersta dagen. Gud visar var och en som fruktar Honom en utväg ur [alla svårigheter]",
            "verse 65:3": "och sörjer för honom på ett sätt som han inte kan förutse; och den som litar till Gud behöver inget annat [stöd]. Gud når alltid Sitt syfte [och] Gud har fastställt ett mått för allt.",
            "verse 65:4": "Om ni tvekar om [vad som gäller] dem av era kvinnor, vilkas månadsblödningar helt har upphört, är deras väntetid tre månader, och samma tid gäller dem vars blödningar har uteblivit. Och de som är havande skall invänta barnets födelse. Och för var och en som fruktar Honom gör Gud uppgiften lätt;",
            "verse 65:5": "detta är vad Gud befaller er genom Sin uppenbarelse. Och för den som fruktar Honom skall Gud utplåna hans dåliga handlingar och öka hans belöning.",
            "verse 65:6": "Låt [den hustru som inväntar skilsmässa] leva under samma villkor som ni själva inom ramen för era möjligheter, och gör inte livet svårt för henne med inskränkningar [av olika slag]. Om hon är havande, sörj då för hennes uppehälle tills barnet har fötts, och ge henne skälig ersättning om hon ammar ert [barn]; och samråd med henne i godo [om barnets bästa] på brukligt sätt. Men uppstår svårigheter, anställ då någon som ammar [barnet] åt er.",
            "verse 65:7": "Den förmögne skall sörja [för det som nu har sagts] med sin rikedom, och den som lever under knappa förhållanden skall avstå [vad han kan] av det som Gud har gett honom för hans försörjning. Gud fordrar inte av någon mer än vad Han har låtit honom förfoga över. Efter svårigheterna skall Gud skänka er lättnad.",
            "verse 65:8": "HUR många folk, som i övermod satte sig upp emot Guds och Hans sändebuds befallningar, har Vi inte avkrävt sträng räkenskap och låtit dem utstå svåra straff.",
            "verse 65:9": "Och de måste smaka de bittra frukterna av sina handlingar och resultatet var [deras] slutliga undergång och förintelse;",
            "verse 65:10": "och Gud har i beredskap för dem ett strängt straff [i det kommande livet]. Frukta därför Gud, ni som tror och har förstånd! Gud har sänt er en påminnelse,",
            "verse 65:11": "ett Sändebud som framför till er Guds klara budskap för att leda dem som tror och lever rättskaffens ut ur mörkret till ljuset. Och Gud skall föra dem som tror på Honom och lever rättskaffens till lustgårdar, vattnade av bäckar, där de skall förbli till evig tid; ja, Gud har sörjt för dem på bästa sätt!",
            "verse 65:12": "GUD ÄR Den som har skapat sju himlar och lika många jordar och genom dem alla strömmar [oupphörligt] Hans vilja. Detta för att ni skall veta att Gud har allt i Sin makt och att Gud omfattar allt med Sin kunskap."
        },
        "Tajik": {
            "verse 65:1": "Эй паёмбар, агар занонро талоқ медиҳед, ба вақти идда талоқашон диҳед. Ва шумори иддаро нигаҳ доред. Ва аз Худои якто—Парвардигорагош битарсед. Ва ононро аз хонаҳояшон берун накунед. Ва аз хона берун нараванд, магар он ки ба ошкоро коре зишт кунанд. Инҳо аҳкоми Худованд аст ва ҳар кӣ аз он таҷовуз кунад, ба худ ситам кардааст. Ту чӣ донӣ, шояд Худо аз ин пас амре тоза падид оварад.",
            "verse 65:2": "Ва чун ба поёни муддат расиданд ё ба ваҷҳе некӯ нигоҳашон доред ё ба ваҷҳе некӯ аз онҳо ҷудо шавед ва ду тан одил аз худатонро ба гувоҳӣ гиред. Ва барои Худо гувоҳиро ба ростӣ адо кунед. Ҳар киро ба Худову рӯзи қиёмат имон дорад, инчунин панд медиҳанд. Ва ҳар кӣ аз Худо битарсад, барои ӯ роҳе барои берун шудаи қарор хоҳад дод",
            "verse 65:3": "ва аз ҷое, ки гумонашро надорад, рӯзиаш медиҳад. Ва ҳар кӣ бар Худо таваккал кунад, Худо ӯро кофист. Худо кори худро ба иҷро мерасонад ва ҳар чизро андозае қарор додааст.",
            "verse 65:4": "Агар дар шубҳа ҳастед, аз миёни занонатон аз онҳое, ки аз ҳайз маъюс шудаанд ва онҳое, ки ҳанӯз ҳайз нашудаанд, иддаашон се моҳ аст. Ва иддаи занони ҳомила ҳамон вазъи ҳамл (таваллуд) аст. Ва ҳар кӣ аз Худо битарсад, Худо корашро осон хоҳад кард.",
            "verse 65:5": "Ин фармони Худост, ки бар шумо нозил кардааст. Ва ҳар кӣ аз Худо битарсад, гуноҳонашро аз ӯ дур мекунад ва ӯро музде бузург медиҳад.",
            "verse 65:6": "Ҳар ҷо, ки худ сукунат кунед, онҳоро низ ба қадри тавонии худ маскан диҳед. Ва то бар онҳо танг гиред, маёзоредашон. Ва агар ҳомила буданд, нафақаашонро 'бидиҳед, то вазъи ҳамд кунанд. Ва агар фарзанди шуморо шир медиҳанд, муздашонро бидиҳед ва ба ваҷҳе некӯ бо якдигар маслиҳат кунед. Ва агар мувофиқат накардед, аз зане дигар бихоҳед, ки кӯдакро шир диҳад.",
            "verse 65:7": "Ҳар молдоре аз моли худ нафақа дихаҳд ва касе, ки тангдаст бошад, аз ҳар чӣ Худо ба ӯ додааст, нафақа диҳад. Худо ҳеҷ касро ғайри он андоза, ки ба ӯ додааст, вазифадор намесозад ва ба зуди Худо пас аз сахтӣ осонӣ пеш орад.",
            "verse 65:8": "Чӣ басо мардуми деҳае, ки аз фармони Парвардигорашон ва паёмбаронаш бар боззаданд. Он гоҳ Мо сахт аз онҳо ҳисоб гирифтем ва ба азобе сангин азобашон кардем.",
            "verse 65:9": "Пас уқубати амали худро чашиданд. Оқибати корашон зиёнкорӣ буд.",
            "verse 65:10": "Худованд барояшон азобе сахт омода кард. Пас, эй хирадмандоне, ки имон овардаед, аз Худо битарсед. Худо бар шумо Қуръонро нозил кардааст.",
            "verse 65:11": "Ва паёмбаре, ки оёти равшани Худоро бароятон мехонад, то касонеро, ки имон овардаанд ва корҳои шоиста кардаанд, аз торикӣ ба рушноӣ оварад, Ва ҳар киро ба Худо имон оварад ва кори шоиста кунад, ба биҳиштҳое дароварад, ки дар он наҳрҳо ҷорист, ҳамеша дар он ҷо бимонанд ва Худо рӯзияшонро бепоён гардонад.",
            "verse 65:12": "Худост, он ки ҳафт осмону монанди онҳо замин биёфарид. Фармони Ӯ миёни осмонҳову замин ҷорист, то бидонед, ки Худо ба ҳар чиз қодир аст ва ба илм бар ҳама чиз иҳота дорад."
        },
        "Tamil": {
            "verse 65:1": "நபியே! நீங்கள் பெண்களைத் 'தலாக்' சொல்வீர்களானால் அவர்களின் 'இத்தா'வைக் கணக்கிட ஏற்ற வகையில் (மாதவிடாய் அல்லாத காலங்களில்) தலாக் கூறுங்கள். உங்கள் இறைவனாகிய அல்லாஹ்வை அஞ்சிக் கொள்ளுங்கள், தவிர, (அப்பெண்கள்) பகிரங்கமான மானக்கேடான (காரியத்)தைச் செய்தாலன்றி அவர்களை அவர்களின் வீடுகளிலிருந்து நீங்கள் வெறியேற்றாதீர்கள்; அவர்களும் வெளியேறலாகாது, இவை அல்லாஹ் (விதிக்கும்) வரம்புகள் எவர் அல்லாஹ்வின் வரம்புகளை மீறுகிறாரோ, அவர் திடமாகத் தமக்குத் தாமே அநியாயம் செய்து கொள்கிறார்: (ஏனெனில், கூடி வாழ்வதற்காக) இதன் பின்னரும் அல்லாஹ் ஏதாவது ஒரு வழியை உண்டாக்கலாம் என்பதை அறியமாட்டீர்.",
            "verse 65:2": "ஆகவே, அவர்கள் தங்கள் (இத்தாவின்) தவணையை நெருங்கினால், அப்பொழுது முறைப்படி (மனைவியராக) அவர்களை நிறுத்தி வைத்துக் கொள்ளுங்கள்; அல்லது முறைப்படி அவர்களைப் பிரித்து (விட்டு) விடுங்கள், அன்றியும், உங்களில் நியாயமுடைய இருவரைச் சாட்சியாக வைத்துக் கொள்ளுங்கள், மேலும், சாட்சியத்தை அல்லாஹ்வுக்காக (நேர்மையாக) நிலைப்படுத்துங்கள்; அல்லாஹ்வையும், மறுமை நாளையும் விசுவாசம் கொண்டிருப்போருக்கு இந்த நற்போதனை செய்யப்படுகிறது - தவிர, எவர் அல்லாஹ்வுக்கு அஞ்சி நடக்கின்றாரோ, அவருக்கு அவன் (தக்க ஒரு) வழியை உண்டாக்குவான்.",
            "verse 65:3": "அ(த்தகைய)வருக்கு, அவர் எண்ணியிராத புறத்திலிருந்து, அவன் உணவு (வசதி)களை அளிக்கிறான், மேலும், எவர், அல்லாஹ்வின் மீது நம்பிக்கை கொண்டு அவனை முற்றிலும் சார்ந்திருக்கிறாரோ, அவருக்கு அவன் போதுமானவன், நிச்சயமாக அல்லாஹ் தன் காரியத்தை நிறைவாக்குபவன் - திண்ணமாக அல்லாஹ் ஒவ்வொரு பொருளுக்கும் ஓர் அளவை உண்டாக்கி வைத்திருக்கின்றான்.",
            "verse 65:4": "மேலும், உங்கள் பெண்களில், எவரும் மாதவிடாயின் நம்பிக்கையிழந்து (அவர்களுடைய இத்தாவை கணக்கிடுவது பற்றி) நீங்கள் சந்தேகப்பட்டால், அப்பெண்களுக்கும், மாதவிடாயே ஏற்படாப் பெண்களுக்கும், 'இத்தா'(வின் தவணை) மூன்று மாதங்களாகவும், தவிர கர்ப்பமுடைய பெண்களுக்கு அவர்களுடைய ('இத்தா'வின்) தவணை அவர்கள் பிரசவிக்கும் வரையாகும், மேலும், எவர் அல்லாஹ்வுக்கு அஞ்சி நடக்கிறாரோ அவருடைய காரியத்தை அவன் எளிதாக்குகிறான்.",
            "verse 65:5": "இதுவே அல்லாஹ்வின் கட்டளையாகும் - இதை அவன் உங்களுக்கு இறக்கியருளினான். எவர் அல்லாஹ்வுக்கு அஞ்சி நடந்து கொள்ளுகிறாரோ, அவரை அவருடைய பாவங்களை விட்டும் நீக்கி, அவருக்கு (நற்) கூலியையும் மகத்தானதாக்குகின்றான்.",
            "verse 65:6": "உங்கள் சக்திக்கேற்ப நீங்கள் குடியிருக்கும் இடத்தில் ('இத்தா'விலிருக்கும்) பெண்களை நீங்கள் குடியிருக்கச் செய்யுங்கள், அவர்களுக்கு நெருக்கடியுண்டாக்குவதற்காக அவர்களுக்குத் தொல்லை கொடுக்காதீர்கள், அவர்கள் கர்ப்பமுடையவர்களாக இருந்தால், அவர்கள் பிரசவிக்கும் வரை, அவர்களுக்காகச் செலவு செய்யுங்கள்; அன்றியும் அவர்கள் உங்களுக்காக (உங்கள் குழந்தைகளுக்குப்) பாலூட்டினால், அதற்கான கூலியை அவர்களுக்குக் கொடுத்து விடுங்கள். (இதைப் பற்றி) உங்களுக்குள் நேர்மையாகப் பேசி முடிவு செய்து கொள்ளுங்கள், ஆனால் (இது பற்றி) உங்களுக்குள் சிரமம் ஏற்பட்டால் (அக்குழந்தைக்கு) மற்றொருத்தி பால் கொடுக்கலாம்.",
            "verse 65:7": "தக்க வசதியுடையவர்கள், தம் வசதிக்கேற்ப (இவ்விஷயத்தில்) செலவு செய்து கொள்ளவும், ஆனால், எவர் மீது அவருடைய உணவு (வசதி) நெருக்கடியாக்கப் பட்டுள்ளதோ, அவர் தமக்கு அல்லாஹ் கொடுத்ததிலிருந்து செலவு செய்து கொள்ளவும், எந்த ஆத்மாவையும் அல்லாஹ் அதற்குக் கொடுத்திருப்பதேயல்லாமல் (மிகையாக செலவு செய்யும் படி) சிரமப்படுத்த மாட்டான், கஷ்டத்திற்குப் பின்னர், அல்லாஹ் அதி சீக்கரத்தில் இலகுவை (சுகத்தை) உண்டாக்கியருள்வான்.",
            "verse 65:8": "எத்தனையோ ஊர்கள் தம் இறைவனுடையவும் அவனுடைய தூதர்களுடையவும் கட்டளைக்கு மாறு செய்தனர், ஆதலால், நாம் வெகு கடுமையாக அவற்றைக் கணக்குக் கேட்டு, அவர்களைக் கொடிய வேதனையாகவும் வேதனை செய்தோம்.",
            "verse 65:9": "இவ்வாறு அவை தம் செயலுக்குரிய தண்டனையை அனுபவித்துக் கொண்டன, அன்றியும், அவர்களுடைய செயல்களின் முடிவும் நஷ்டமாகவே ஆயிற்று.",
            "verse 65:10": "அல்லாஹ் (அவர்களுக்குக்) கடினமான வேதனையை (மறுமையில்) சித்தம் செய்திருக்கின்றான், ஆகவே, ஈமான் கொண்டுள்ள அறிவுடையோரே! அல்லாஹ்வை நீங்கள் அஞ்சி நடந்து கொள்ளுங்கள் - திட்டமாக அல்லாஹ் உங்களுக்கு நினைவுறுத்தும் இவ்வுபதேசத்தை இறக்கி வைத்திருக்கின்றான்.",
            "verse 65:11": "அன்றியும், ஒரு தூதரையும் அவன் (அனுப்பி வைத்தான்); அவர் அல்லாஹ்வுடைய தெளிவான வசனங்களை உங்களுக்கு ஓதிக் காண்பிக்கிறார், ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்பவர்களை இருள்களிலிருந்து, ஒளியின் பக்கம் கொண்டு வருவதற்காக, மேலும் எவர் அல்லாஹ்வின் மீது ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல் செய்கின்றாரோ அவரை அல்லாஹ் சுவனச் சோலைகளில் பிரவேசிக்கச் செய்கிறான் - அவற்றின் கீழே ஆறுகள் ஓடிக் கொண்டிருக்கின்றன. அவற்றில் அவர்கள் என்றென்றும் இருப்பார்கள், அல்லாஹ் அவர்களுக்குத் திடமாக உணவை அழகாக்கினான்.",
            "verse 65:12": "அல்லாஹ் தான் ஏழு வானங்களையும் இன்னும் பூமியிலிருந்து அவற்றைப் போலவும் படைத்தான், நிச்சமயாக அல்லாஹ் எல்லாப் பொருட்கள் மீதும் சக்தியுடையவன் என்பதையும், மேலும் நிச்சயமாக அல்லாஹ் தன் ஞானத்தால் எல்லாப் பொருளையும் சூழ்ந்தறிகிறான் என்பதையும் நீங்கள் அறிந்து கொள்வதற்காக, அவற்றின் (வானங்கள், பூமியின்) இடையே அவன் கட்டளையிறங்கிக் கொண்டேயிருக்கிறது."
        },
        "Tatar": {
            "verse 65:1": "Ий пәйгамбәр һәм аның өммәте, әгәр хатыннарыгызны талак кылыр булсагыз, күремнәре беткәч, пакь хәлләрендә якынлык кылмыйча талак кылыгыз вә күрем көннәрен һәм талак гыйддәтен атагыз, талак гыйддәте пакь вакытларында талак ителеп өч күремне уздырып пакьләнгән вакытларына чаклыдыр. Күрем күргән вакытларында һәм балага йөкле булсалар, талак кылу дөрес булмыйдыр. Раббыгыз булган Аллаһудан куркыгыз, Аның хөкемнәрен бозмагыз! Талак кылгач хатыныгызны торган өйләреннән чыгармагыз, өч күремне уздырып пакьләнгәннәренә чаклы вә ул хатыннар үз ихтыярлары илә дә чыкмасыннар, мәгәр ачык бозык эшне кылсалар, урлау вә зина кылу кеби эшләрне кылсалар – ул вакытта өйләреннән чыгарырбыз! Бу хөкемнәр Аллаһуның чикләредер. Берәү Аллаһуның чигеннән чыгып эш кылса, тәхкыйк ул үзенә золым кылды. Ий талак кылучы ир, белмәссең, шаять Аллаһ талактан соң синең файдаңа эш кылыр, ягъни арагызга мәхәббәт салыр да яңадан тора башларсыз. \"Талак кылганнан соң теләгегез булса яңадан кушылып торырга шәригатьтә юл булганы өчен, талак кылган хатыннарыгызны гыйддәтләре үтмичә өегездән чыгармагыз, һәм бердән өч талак белән талак кылмагыз!\"",
            "verse 65:2": "Әгәр талак кылган хатыннарыгызның гыйддәтләре тулса, яңадан кушылып торырга теләсәгез яхшылык белән торыгыз, әгәр торырга теләмәсәгез яхшылык белән аерыгыз мәһәрләрен һәм башка тиешле әйберләрен биреп, вә үзегезнең арагыздан ике гадел мөселман кеше, хатыныгызны талак кылуыгызга яки яңадан кушылып торуыгызга гуаһ булсыннар! Ий гуаһ булган кешеләр, гуаһлык эшегезне дөреслек белән Аллаһ ризалыгы өчен үтәгез! Бу хөкемнәр сезгәдер, ул хөкемнәр Аллаһуга вә кыямәт көненә иман китергән кешеләр Аллаһ тарафыннан вәгазь кылыналар. Берәү Аллаһуга гөнаһлы булудан сакланса, ул кешегә Аллаһ дөньяда һәм ахирәттә хәсрәтле булудан котылу юлын ачар.",
            "verse 65:3": "Дәхи ул кешене Аллаһ уйламаган җирдән ризыкландырыр. Бер кеше үзен вә барча эшен Аллаһуга тапшырса, аның хаҗәтләрен үтәргә Аллаһ җитәдер. Тәхкыйк Аллаһ Үзенең эшләрен җиренә җиткерүче, әлбәттә, Аллаһ һәрнәрсәгә чик үлчәү куйды.",
            "verse 65:4": "Хатыннарыгыздан картлык сәбәпле күремнән туктаган хатыннар һәм күрем күрми торган бик яшь хатыннар талак ителсәләр, гыйддәтләре хакында шикләнсәгез, аларның гыйддәтләре өч айдыр, вә йөкле хатыннарның гыйддәтләре балаларын тудырганчыдыр. Вә берәү Аллаһудан курыкса, хатын корсагындагы баласын яшермәсә, Аллаһ аның һәр эшендә җиңеллек бирер.",
            "verse 65:5": "Болар Аллаһуның хөкемнәредер, аларны сезнең өчен иңдерде. Берәү Аллаһудан курыкса, Аның хөкемнәрен бозудан сакланса, ул кешенең гөнаһларын каплар һәм әҗерен олугъ кылыр.",
            "verse 65:6": "Ул талак кылган хатыннарыгызны үзегез торган өйләрегезнең берендә тотыгыз вә көчегез җиткәнчә тәрбияләгез, вә аларга зарар тидермәгез өйдән чыгып китәргә мәҗбүр итәр өчен. Әгәр ул талак ителгән хатыннар йөкле булсалар, аларны ашатыгыз, киендерегез, балаларын тудырганнарына чаклы. Әгәр тудырган балаларын сезнең өчен имезсәләр, имезгәннәре өчен хакын түләгез, вә үзара шәригатькә муафыйк киңәшләрне кабул итегез. Әгәр ир баласын имезгән өчен талак кылган хатынына хакын түләргә авырсынса яки хатын баласын имезергә авырсынса, ул вакытта баланы икенче бер ят хатын имезер.",
            "verse 65:7": "Иркен тормышлы бай кеше талак кылган хатынына яки бала имезүчегә иркенрәк итеп бирсен үзенең байлыгыннан, әмма түбән тормышлы ярлы булса, Аллаһ биргәннән көче җиткән хәтле бирсен. Бит Аллаһ һичкемне бирергә көчләми, мәгәр Үзе биргән хәтле генә көчләр. Ярлы вә авыр тормыштан соң Аллаһ тиздән дөньяда яки ахирәттә тормышны бай иркен кылыр.",
            "verse 65:8": "Күпме шәһәр кешеләре Раббыларының әмереннән вә рәсүлләрнең әмереннән баш тарттылар, Без аларны хисаб кылдык каты хисаб белән, вә аларны ґәзаб кылдык куркынычлы ут ґәзабы белән.",
            "verse 65:9": "Алар татыдылар Аллаһуга каршы булган эшләренең имгәген, вә аларның эшләренең ахыры ґәзаб, хәсрәт булды.",
            "verse 65:10": "Аллаһ аларга каты ґәзаб хәзерләде. Аллаһудан куркыгыз, гөнаһлардан сакланыгыз, ий гакыл ияләре! Иман китергән кешеләр, тәхкыйк Аллаһ сезгә иңдерде сезне уятучы вә туры юлны күрсәтүче Коръәнне.",
            "verse 65:11": "Сезне һидәяткә чакыручы расүлне күндерде, ул расүл сезгә укыйдыр Аллаһуның ачык бәян ителгән аятьләрен, Коръәнгә ышанып аның юлы белән изге гамәлләр кылган кешеләрне динсезлек җәһаләт караңгылыгыннан иман вә мәгърифәт яктылыгына чыгармак өчен. Берәү Аллаһуга иман китереп яхшы эшләр эшләсә, изге гамәлләр кылса, Аллаһ ул кешене асларыннан елгалар ага торган җәннәтләргә кертер, алар анда мәңге калырлар. Тәхкыйк Аллаһ җәннәт әһелләренә ризыкны күркәм кылды.",
            "verse 65:12": "Ул – Аллаһ күкне җиде кат итеп халык кылды һәм җирне дә күк кеби җиде кат итеп халык кылды. Аллаһ хөкеме җир илә күк арасында йөрер, тәхкыйк Аллаһуның һәрнәрсәгә көче җиткәнлеген кешеләр белсеннәр өчен һәм сезнең белүегегез өчен вә тәхкыйк Аллаһуның һәрнәрсәне белем белән әйләндереп алганлыгын белүегегез өчен."
        },
        "Telugu": {
            "verse 65:1": "ఓ ప్రవక్తా! మీరు స్త్రీలకు విడాకులు (తలాఖ్) ఇచ్చేటప్పుడు వారికి, వారి నిర్ణీత గడువు (ఇద్దత్) తో విడాకులివ్వండి. మరియు ఆ గడువును ఖచ్చితంగా లెక్కపెట్టండి. మరియు మీ ప్రభువైన అల్లాహ్ పట్ల భయభక్తులు కలిగి ఉండండి. వారు బహిరంగంగా అశ్లీల చేష్టలకు పాల్పడితే తప్ప, మీరు వారిని వారి ఇండ్ల నుండి వెడల గొట్టకండి మరియు వారు కూడా స్వయంగా వెళ్ళి పోకూడదు. మరియు ఇవి అల్లాహ్ నిర్ణయించిన హద్దులు. మరియు ఎవడైతే అల్లాహ్ (నిర్ణయించిన) హద్దులను అతిక్రమిస్తాడో వాస్తవానికి వాడు తనకు తానే అన్యాయం చేసుకున్నట్లు. నీకు తెలియదు, బహుశా! దాని తరువాత అల్లాహ్ ఏదైనా క్రొత్త మార్గం చూపించవచ్చు",
            "verse 65:2": "ఇక వారి నిర్ణీత గడువు ముగిసినప్పుడు, వారిని ధర్మప్రకారంగా (వివాహబంధంలో) ఉంచుకోండి, లేదా ధర్మప్రకారంగా వారిని విడచి పెట్టండి. మరియు మీలో న్యాయవంతులైన ఇద్దరు వ్యక్తులను సాక్షులుగా పెట్టుకోండి. మరియు అల్లాహ్ కొరకు సాక్ష్యం సరిగ్గా ఇవ్వండి. అల్లాహ్ ను మరియు అంతిమ దినమును విశ్వసించే ప్రతి వ్యక్తి కొరకు, ఈ విధమైన ఉపదేశమివ్వబడుతోంది. మరియు అల్లాహ్ యందు భయభక్తులు గలవానికి, ఆయన ముక్తిమార్గం చూపుతాడు",
            "verse 65:3": "మరియు ఆయన, అతనికి అతడు ఊహించని దిక్కు నుండి జీనవోపాధిని ప్రసాదిస్తాడు. మరియు అల్లాహ్ మీద నమ్మకం ఉంచుకున్న వానికి ఆయనే చాలు. నిశ్చయంగా, అల్లాహ్ తన పని పూర్తి చేసి తీరుతాడు. వాస్తవానికి, అల్లాహ్ ప్రతిదానికి దాని విధి (ఖద్ర్) నిర్ణయించి ఉన్నాడు",
            "verse 65:4": "మరియు మీ స్త్రీలు ఋతుస్రావపు వయస్సు గడిచి పోయినవారైతే లేక మీకు దానిని గురించి ఎలాంటి అనుమానం ఉంటే; లేక వారి ఋతుస్రావం ఇంకా ప్రారంభం కాని వారైతే, అలాంటి వారి గడువు మూడు మాసాలు. మరియు గర్భవతులైన స్త్రీల గడువు వారి కాన్పు అయ్యే వరకు. మరియు అల్లాహ్ పట్ల భయభక్తులు గలవానికి ఆయన, అతని వ్యవహారంలో సౌలభ్యం కలిగిస్తాడు",
            "verse 65:5": "ఇది అల్లాహ్ ఆజ్ఞ, ఆయన దానిని మీపై అవతరింపజేశాడు. మరియు ఎవడైతే అల్లాహ్ పట్ల భయభక్తులు కలిగి ఉంటాడో, ఆయన అతని పాపాలను తొలగిస్తాడు. మరియు అతని ప్రతిఫలాన్ని అధికం చేస్తాడు",
            "verse 65:6": "(నిర్ణీత గడువు కాలంలో) మీ శక్తి మేరకు, మీరు నివసించే చోటనే, వారిని కూడా నివసించనివ్వండి. మరియు వారిని ఇబ్బందులకు గురి చేయడానికి వారిని బాధించకండి. మరియు వారు గర్భవతులైతే, వారు ప్రసవించే వరకు వారి మీద ఖర్చు పెట్టండి. ఒకవేళ వారు మీ బిడ్డకు పాలుపడుతున్నట్లైతే, వారికి వారి ప్రతిఫలం ఇవ్వండి. దాని కొరకు మీరు ధర్మసమ్మతంగా మీ మధ్య సంప్రదింపులు చేసుకోండి. ఒకవేళ మీకు దాని (పాలిచ్చే) విషయంలో ఇబ్బందులు కలిగితే, (తండ్రి) మరొక స్త్రీతో (బిడ్డకు) పాలిప్పించవచ్చు",
            "verse 65:7": "సంపన్నుడైన వ్యక్తి తన ఆర్థిక స్తోమత ప్రకారం ఖర్చు పెట్టాలి. మరియు తక్కువ జీవనోపాధి గల వ్యక్తి అల్లాహ్ తనకు ప్రసాదించిన విధంగా ఖర్చుపెట్టాలి. అల్లాహ్ ఏ వ్యక్తిపై కూడా అతనికి ప్రసాదించిన దాని కంటే మించిన భారం వేయడు. అల్లాహ్ కష్టం తరువాత సుఖం కూడా కలిగిస్తాడు",
            "verse 65:8": "మరియు ఎన్నో నగరవాసులు, తమ ప్రభువు మరియు ఆయన ప్రవక్తల ఆజ్ఞలను తిరస్కరించారు. అప్పుడు మేము వాటి ప్రజల నుండి కఠినంగా లెక్క తీసుకున్నాము. మరియు వారికి తీవ్రమైన శిక్షను సిద్ధ పరిచాము",
            "verse 65:9": "కావున వారు తమ వ్యవహారాల దుష్టఫలితాన్ని రుచి చూశారు. మరియు వారి వ్యవహారాల పర్యవసానం నష్టమే",
            "verse 65:10": "అల్లాహ్ వారి కొరకు కఠినమైన శిక్షను సిద్ధపరచి ఉంచాడు. కావున విశ్వాసులైన బుద్ధమంతులారా! అల్లాహ్ పట్ల భయభక్తులు కలిగి ఉండండి. వాస్తవానికి అల్లాహ్ మీ వద్దకు హితబోధను (ఖుర్ఆన్ ను) అవతరింపజేశాడు",
            "verse 65:11": "ఒక ప్రవక్తను కూడా! అతను మీకు స్పష్టమైన అల్లాహ్ సూచనలను (ఆయాత్ లను) వినిపిస్తున్నాడు. అది, విశ్వసించి సత్కార్యాలు చేసేవారిని అంధకారాల నుండి వెలుగులోనికి తీసుకురావటానికి. మరియు అల్లాహ్ ను విశ్వసించి సత్కార్యాలు చేసేవారిని, ఆయన క్రింద సెలయేళ్ళు ప్రవహించే స్వర్గవనాలలో ప్రవేశింపజేస్తాడు. అక్కడ వారు శాశ్వతంగా కలకాలం ఉంటారు. వాస్తవానికి అల్లాహ్ అలాంటి వ్యక్తి కొరకు ఉత్తమ జీవనోపాధిని ప్రసాదించాడు",
            "verse 65:12": "అల్లాహ్ యే సప్తాకాశాలను మరియు వాటిని పోలిన భూమండలాన్ని సృష్టించి, వాటి మధ్య ఆయన తన ఆదేశాలను అవతరింపజేస్తూ వుంటాడు. నిశ్చయంగా, అల్లాహ్ ప్రతిదీ చేయగల సమర్ధుడు మరియు వాస్తవానికి అల్లాహ్ తన జ్ఞానంతో ప్రతిదానిని పరివేష్టించి వున్నాడని మీరు తెలుసుకోవటానికి"
        },
        "Thai": {
            "verse 65:1": "โอ้นะบีเอ๋ย เมื่อพวกเจ้าอย่าภริยาก็จงหย่าพวกนางตามกำหนด (อิดดะฮฺ) ของพวกนางและจงนับกำหนดอิดดะฮฺให้ครบ พวกเจ้าจงยำเกรงอัลลอฮฺ พระเจ้าของพวกเจ้าเถิดอย่าขับไล่พวกนางออกจากบ้านของพวกนาง และพวกนางก็อย่าออกจากบ้านเว้นแต่พวกนางจะกระทำลามกอย่างชัดแจ้ง และเหล่านี้คือข้อกำหนดของอัลลอฮฺ และผู้ใดละเมิดข้อกำหนดของอัลลอฮฺ แน่นอนเขาก็ได้อธรรมแก่ตัวของเขาเอง เจ้าไม่รู้ดอกว่าบางทีอัลลอฮฺจะทรงปรับปรุงกิจการ (ของเขา) หลังจากนั้น",
            "verse 65:2": "ต่อเมื่อพวกนางได้อยู่จนครบกำหนดของพวกนางแล้ว ก็จงยับยั้งพวกนางให้อยู่โดยดี หรือให้พวกนางจากไปโดยดี และจงให้มีพยานสองคนเป็นผู้เที่ยงธรรมในหมู่พวกเจ้า และจงให้การเป็นพยานนั้นเป็นไปเพื่ออัลลอฮฺ ดังกล่าวมานั้นผู้ที่ศรัทธาต่ออัลลอฮฺและวันอาคิเราะฮฺจะถูกตักเตือนให้ถือปฏิบัติและผู้ใดยำเกรงอัลลอฮฺ พระองค์ก็จะทรงหาทางออกให้แก่เขา",
            "verse 65:3": "และจะทรงประทานปัจจัยยังชีพแก่เขาจากที่ที่เขามิได้คาดคิด และผู้ใดมอบหมายแด่อัลลอฮฺ พระองค์ก็จะทรงเป็นผู้พอเพียงแก่เขา แท้จริงอัลลอฮฺเป็นผู้ทรงบรรลุในกิจการของพระองค์โดยแน่นอนสำหรับทุกสิ่งอย่างนั้นอัลลอฮฺทรงกำหนดกฎสภาวะไว้แล้ว",
            "verse 65:4": "ส่วนบรรดาผู้หญิงในหมู่ภริยาของพวกเจ้าที่หมดหวังในการมีระดู หากพวกเจ้ายังสงสัย (ในเรื่องอิดดะฮฺของนาง) ดังนั้นพึงรู้เถิดว่าอิดดะฮิของพวกนางคือสามเดือน และบรรดาผู้หญิงที่มิได้มีระดูก็เช่นกัน ส่วนบรรดาผู้ทีครรภ์กำหนดของพวกนางก็คือพวกนางจะคลอดทารกที่อยู่ครรภ์ของพวกนาง และผู้ใดยำเกรงต่ออัลลอฮฺ พระองค์จะทรงทำให้กิจการของเขาสะดวกง่ายดายแก่เขา",
            "verse 65:5": "นั่นคือพระบัญชาของอัลลอฮฺซึ่งพระองค์ได้ทรงประทานพระบัญชานั้นแก่พวกเจ้าและผู้ใดยำเกรงอัลลอฮฺ พระองค์จะทรงลบล้างความชั่วทั้งหลายของเขาออกไปจากเขาและจะทรงเพิ่มรางวัลให้มากขึ้นแก่เขา",
            "verse 65:6": "จงให้พวกนางพำนักอยู่ ณ ที่พวกเจ้า และอย่าทำอันตรายพวกนางเพื่อให้เกิดการคับแค้นแก่พวกนาง และหากพวกนางตั้งครรภ์ก็จงเลี้ยงดูพวกนาง จนกว่าพวกนางจะคลอดทารกที่อยู่ในครรภ์ของพวกนาง ครั้นเมื่อพวกนางได้ให้นมแก่ทารกของพวกเจ้า ก็จงให้พวกนางซึ่งค่าตอบแทนของพวกนาง และจงปรึกษาหารือระหว่างพวกเจ้าด้วยกันโดยดี และเมื่อพวกเจ้าตกลงกันไม่ได้ ก็จงให้หญิงอื่นให้นมแก่เด็กนั้น",
            "verse 65:7": "ควรให้ผู้มีฐานะร่ำรวยจ่ายตามฐานะของเขา ส่วนผู้ที่การยังชีพของเขาเป็นที่คับแค้นแก่เขาก็ให้เขาจ่ายตามที่อัลลอฮฺทรงประทานมาให้แก่เขา อัลลอฮฺมิได้ทรงให้เป็นที่ลำบากแก่ชีวิตใด เว้นแต่ตามที่พระองค์ทรงประทานมาแก่ชีวิตนั้น หลังจากความยากลำบาก อัลลอฮฺจะทรงทำให้เกิดความสะดวกสบาย",
            "verse 65:8": "มีชาวเมืองกี่มากน้อยแล้วที่ฝ่าฝืนพระบัญชาของพระเจ้าของพวกเขา และบรรดาร่อซูลของพระองค์เราได้ชำระพวกเขาด้วยการชำระอย่างเข้มงวด และเราได้ลงโทษพวกเขาด้วยการลงโทษอย่างหนัก",
            "verse 65:9": "ดังนั้นพวกเขาจึงได้ลิ้มรสผลร้ายแห่งกิจกรรมของพวกเขา และบั้นปลาย แห่งกิจกรรมของพวกเขา คือการขาดทุนความหายนะ",
            "verse 65:10": "อัลลอฮฺทรงเตรียมการลงโทษอย่างหนักไว้สำหรับพวกเขาแล้ว ดังนั้นจงยำเกรงอัลลอฮฺเถิด โอ้บรรดาผู้มีสติปัญญาที่ศรัทธาเอ๋ย เพราะแน่นอนอัลลอฮฺได้ทรงประทานข้อเตือนสติ (อัลกุรอาน) ลงมาให้แก่พวกเจ้าแล้ว",
            "verse 65:11": "(และ) ร่อซูลท่านหนึ่ง (มุฮัมมัด) มาสาธยายอายาตต่าง ๆ อันชัดแจ้งของอัลลอฮฺแก่พวกเจ้าเพื่อจะได้นำบรรดาผู้ศรัทธาและกระทำความดีทั้งหลายออกจากความมืดทึบทั้งมวลสู่แสงสว่าง ส่วนผู้ใดศรัทธาต่ออัลลอฮฺและกระทำความดี พระองค์จะทรงให้เขาเข้าสวนสวรรค์หลากหลาย ณ เบื้องล่างสวนสวรรค์นั้นมีลำน้ำหลายสายไหลผ่าน พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล แน่นอนได้ทรงจัดปัจจัยยังชีพอย่างดีเลิศไว้ให้แก่เขาแล้ว",
            "verse 65:12": "อัลลอฮฺผู้ทรงสร้างชั้นฟ้าทั้งเจ็ด และทรงสร้างแผ่นดินก็เยี่ยงนั้น พระบัญชาจะบงมาท่ามกลางมันทั้งหลาย (ชั้นฟ้าและแผ่นดิน) เพื่อพวกเจ้าจะได้รู้ว่า แท้จริงอัลลอฮฺนั้นเป็นผู้ทรงอานุภาพเหนือทุกสิ่งอย่าง และแท้จริงอัลลอฮฺนั้นทรงห้อมล้อมทุกสิ่งอย่างไว้ด้วยความรอบรู้ (ของพระองค์)"
        },
        "Turkish": {
            "verse 65:1": "Ey Peygamber! Kadınları boşayacağınızda, onları, iddetlerini gözeterek boşayın ve iddeti sayın; Rabbiniz olan Allah'tan sakının; onları, apaçık bir hayasızlık yapmaları hali bir yana evlerinden çıkarmayın, onlar da çıkmasınlar. Bunlar, Allah'ın sınırlarıdır. Allah'ın sınırlarını kim aşarsa, şüphesiz, kendine yazık etmiş olur. Bilmezsin, olur ki, Allah bunun ardından bir hal meydana getirir.",
            "verse 65:2": "Kadınların iddet süreleri biteceğinde, onları ya uygun bir şekilde alıkoyun, ya da onlardan ayrılın; içinizden de iki adil şahit getirin; şahidliği Allah için yapın; işte bu, Allah'a ve ahiret gününe inanan kimseye verilen öğüttür. Allah, kendisine karşı gelmekten sakınan kimseye kurtuluş yolu sağlar, ona beklemediği yerden rızık verir. Allah'a güvenen kimseye O yeter. Allah, buyruğunu yerine getirendir. Allah her şey için bir ölçü var etmiştir.",
            "verse 65:3": "Kadınların iddet süreleri biteceğinde, onları ya uygun bir şekilde alıkoyun, ya da onlardan ayrılın; içinizden de iki adil şahit getirin; şahidliği Allah için yapın; işte bu, Allah'a ve ahiret gününe inanan kimseye verilen öğüttür. Allah, kendisine karşı gelmekten sakınan kimseye kurtuluş yolu sağlar, ona beklemediği yerden rızık verir. Allah'a güvenen kimseye O yeter. Allah, buyruğunu yerine getirendir. Allah her şey için bir ölçü var etmiştir.",
            "verse 65:4": "Kadınlarınızdan ay hali görmekten kesilenler ile henüz ay hali görmemiş olanların iddetleri hususunda şüpheye düşerseniz, bilin ki, onların iddet beklemesi üç aydır; gebe olanların iddeti, doğurmaları ile tamamlanır. Allah, buyruğuna karşı gelmekten sakınan kimseye işinde kolaylık verir.",
            "verse 65:5": "Bu, Allah'ın size indirmiş olduğu buyruğudur. Kim Allah'ın buyruğuna karşı gelmekten sakınırsa, O, onun kötülüklerini örter, ecrini büyültür.",
            "verse 65:6": "Boşadığınız, fakat iddeti dolmamış kadınları gücünüz nispetinde, kendi oturduğunuz yerde oturtun. Onları sıkıntıya sokmak için zarar vermeye kalkışmayın. Eğer hamile iseler, doğurmalarına kadar nafakalarını verin. Çocuğu sizin için emzirirlerse, onlara ücretlerini ödeyin; aranızda uygun bir şekilde anlaşın; eğer güçlükle karşılaşırsanız çocuğu başka bir kadın emzirebilir.",
            "verse 65:7": "Varlıklı olan kimse, nafakayı varlığına göre versin; rızkı ancak kendisine yetecek kadar verilmiş olan kimse, Allah'ın kendisine verdiğinden versin; Allah kimseye, verdiği rızkı aşan bir yük yüklemez. Allah, güçlükten sonra kolaylık verir.",
            "verse 65:8": "Rablerinin ve O'nun peygamberlerinin buyruğundan çıkan nice kasabalar halkını Biz, çetin bir hesaba çekmiş, onları, görülmedik bir azaba uğratmışızdır.",
            "verse 65:9": "Onlar, işlerinin karşılığını tattılar; işlerinin sonu hüsran oldu.",
            "verse 65:10": "Allah onlara çetin bir azap hazırlamıştır. Ey inanmış olan akıl sahipleri! Allah'tan sakının; Allah size Kuran'ı indirmiştir.",
            "verse 65:11": "İnanıp yararlı işler işleyenleri karanlıklardan aydınlığa çıkarmak üzere, size Allah'ın apaçık ayetlerini okuyan bir Peygamber göndermiştir. Kim Allah'a inanır ve yararlı iş işlerse, Allah onu, içinde temelli ve sonsuz kalınacak, içlerinden ırmaklarakan cennetlere koyar. Allah ona gerçekten güzel rızık vermiştir.",
            "verse 65:12": "Yedi göğü ve yerden de bir o kadarını yaratan Allah'tır, Allah'ın herşeye Kadir olduğunu ve Allah'ın ilminin herşeyi kuşattığını bilmeniz için Allah'ın buyruğu bunlar arasında iner durur."
        },
        "Urdu": {
            "verse 65:1": "اے پیغمبر (مسلمانوں سے کہہ دو کہ) جب تم عورتوں کو طلاق دینے لگو تو عدت کے شروع میں طلاق دو اور عدت کا شمار رکھو۔ اور خدا سے جو تمہارا پروردگار ہے ڈرو۔ (نہ تو تم ہی) ان کو (ایام عدت میں) ان کے گھروں سے نکالو اور نہ وہ (خود ہی) نکلیں۔ ہاں اگر وہ صریح بےحیائی کریں (تو نکال دینا چاہیئے) اور یہ خدا کی حدیں ہیں۔ جو خدا کی حدوں سے تجاوز کرے گا وہ اپنے آپ پر ظلم کرے گا۔ (اے طلاق دینے والے) تجھے کیا معلوم شاید خدا اس کے بعد کوئی (رجعت کی) سبیل پیدا کردے",
            "verse 65:2": "پھر جب وہ اپنی میعاد (یعنی انقضائے عدت) کے قریب پہنچ جائیں تو یا تو ان کو اچھی طرح (زوجیت میں) رہنے دو یا اچھی طرح سے علیحدہ کردو اور اپنے میں سے دو منصف مردوں کو گواہ کرلو اور (گواہ ہو!) خدا کے لئے درست گواہی دینا۔ ان باتوں سے اس شخص کو نصیحت کی جاتی ہے جو خدا پر اور روز آخرت پر ایمان رکھتا ہے۔ اور جو کوئی خدا سے ڈرے گا وہ اس کے لئے (رنج ومحن سے) مخلصی (کی صورت) پیدا کرے گا",
            "verse 65:3": "اور اس کو ایسی جگہ سے رزق دے گا جہاں سے (وہم و) گمان بھی نہ ہو۔ اور جو خدا پر بھروسہ رکھے گا تو وہ اس کو کفایت کرے گا۔ خدا اپنے کام کو (جو وہ کرنا چاہتا ہے) پورا کردیتا ہے۔ خدا نے ہر چیز کا اندازہ مقرر کر رکھا ہے",
            "verse 65:4": "اور تمہاری (مطلقہ) عورتیں جو حیض سے ناامید ہوچکی ہوں اگر تم کو (ان کی عدت کے بارے میں) شبہ ہو تو ان کی عدت تین مہینے ہے اور جن کو ابھی حیض نہیں آنے لگا (ان کی عدت بھی یہی ہے) اور حمل والی عورتوں کی عدت وضع حمل (یعنی بچّہ جننے) تک ہے۔ اور جو خدا سے ڈرے گا خدا اس کے کام میں سہولت پیدا کردے گا",
            "verse 65:5": "یہ خدا کے حکم ہیں جو خدا نے تم پر نازل کئے ہیں۔ اور جو خدا سے ڈرے گا وہ اس سے اس کے گناہ دور کر دے گا اور اسے اجر عظیم بخشے گا",
            "verse 65:6": "عورتوں کو (ایام عدت میں) اپنے مقدور کے مطابق وہیں رکھو جہاں خود رہتے ہو اور ان کو تنگ کرنے کے لئے تکلیف نہ دو اور اگر حمل سے ہوں تو بچّہ جننے تک ان کا خرچ دیتے رہو۔ پھر اگر وہ بچّے کو تمہارے کہنے سے دودھ پلائیں تو ان کو ان کی اجرت دو۔ اور (بچّے کے بارے میں) پسندیدہ طریق سے مواقفت رکھو۔ اور اگر باہم ضد (اور نااتفاقی) کرو گے تو (بچّے کو) اس کے (باپ کے) کہنے سے کوئی اور عورت دودھ پلائے گی",
            "verse 65:7": "صاحب وسعت کو اپنی وسعت کے مطابق خرچ کرنا چاہیئے۔ اور جس کے رزق میں تنگی ہو وہ جتنا خدا نے اس کو دیا ہے اس کے موافق خرچ کرے۔ خدا کسی کو تکلیف نہیں دیتا مگر اسی کے مطابق جو اس کو دیا ہے۔ اور خدا عنقریب تنگی کے بعد کشائش بخشے گا",
            "verse 65:8": "اور بہت سی بستیوں (کے رہنے والوں) نے اپنے پروردگار اور اس کے پیغمبروں کے احکام سے سرکشی کی تو ہم نے ان کو سخت حساب میں پکڑ لیا اور ان پر (ایسا) عذاب نازل کیا جو نہ دیکھا تھا نہ سنا",
            "verse 65:9": "سو انہوں نے اپنے کاموں کی سزا کا مزہ چکھ لیا اور ان کا انجام نقصان ہی تو تھا",
            "verse 65:10": "خدا نے ان کے لئے سخت عذاب تیار کر رکھا ہے۔ تو اے ارباب دانش جو ایمان لائے ہو خدا سے ڈرو۔ خدا نے تمہارے پاس نصیحت (کی کتاب) بھیجی ہے",
            "verse 65:11": "(اور اپنے) پیغمبر (بھی بھیجے ہیں) جو تمہارے سامنے خدا کی واضح المطالب آیتیں پڑھتے ہیں تاکہ جو لوگ ایمان لائے اور عمل نیک کرتے رہے ہیں ان کو اندھیرے سے نکال کر روشنی میں لے آئیں اور جو شخص ایمان لائے گا اور عمل نیک کرے گا ان کو باغہائے بہشت میں داخل کرے گا جن کے نیچے نہریں بہہ رہیں ہیں ابد الاآباد ان میں رہیں گے۔ خدا نے ان کو خوب رزق دیا ہے",
            "verse 65:12": "خدا ہی تو ہے جس نے سات آسمان پیدا کئے اور ایسی ہی زمینیں۔ ان میں (خدا کے) حکم اُترتے رہتے ہیں تاکہ تم لوگ جان لو کہ خدا چیز پر قادر ہے۔ اور یہ کہ خدا اپنے علم سے ہر چیز پر احاطہ کئے ہوئے ہے"
        },
        "Uyghur": {
            "verse 65:1": "ئى پەيغەمبەر! (ئۈممىتىڭگە ئېيتقىنكى) سىلەر ئاياللارنى تالاق قىلساڭلار، ئۇلارنىڭ ئىددىتىگە (لايىق پەيتتە يەنى پاكلىق ھالىتىدە) تالاق قىلىڭلار. (نەسەب ئارىلىشىپ كەتمەسلىكى ئۈچۈن) ئىددەتنى ساناڭلار، پەرۋەردىگارىڭلاردىن قورقۇڭلار، (ئۇلارنىڭ ئىددىتى توشمىغۇچە) ئۇلارنى ئۆيلىرىدىن چىقىرىۋەتمەڭلار، ئۇلارمۇ (ئۆيىدىن) چىقمىسۇن، ئۇلار پەقەت ئوچۇق پاھىشە قىلسىلا ئاندىن (ھەدنى ئىجرا قىلىش ئۈچۈن) چىقىدۇ، ئەنە شۇ اﷲ نىڭ قانۇنىدۇر، كىمكى اﷲ نىڭ قانۇنىدىن ھالقىپ كېتىدىكەن، ئۇ ئۆزىگە زۇلۇم قىلغان بولىدۇ، سەن بىلمەيسەنكى، اﷲ شۇنىڭدىن كېيىن (يەنى تالاقتىن كېيىن) بىرەر ئىشنى مەيدانغا كەلتۈرۈشى مۇمكىن",
            "verse 65:2": "ئۇلارنىڭ ئىددىتى توشقان چاغدا، ئۇلار بىلەن چىرايلىقچە يېنىشىڭلار ياكى ئۇلار بىلەن چىرايلىقچە ئۈزلىشىپ كېتىڭلار، (يېنىشقان، ئاجراشقان چېغىڭلاردا) ئاراڭلاردىن ئىككى ئادىل گۇۋاھچىنى گۇۋاھ قىلىڭلار، خۇدالىق ئۈچۈن (توغرا) گۇۋاھ بولۇڭلار، بۇنىڭ بىلەن (يەنى بۇ ھۆكۈم بىلەن) اﷲ قا ۋە ئاخىرەت كۈنىگە ئىمان ئېيتقان كىشىگە ۋەز - نەسىھەت قىلىنىدۇ، كىمكى اﷲ تىن قورقىدىكەن، اﷲ ئۇنىڭغا چىقىش يولى بېرىدۇ",
            "verse 65:3": "اﷲ ئۇنىڭغا ئويلىمىغان يەردىن رىزىق بېرىدۇ، كىمكى اﷲ قا تەۋەككۈل قىلسا، اﷲ ئۇنىڭغا كۇپايە قىلىدۇ، اﷲ ھەقىقەتەن مەقسىتىگە يېتەلەيدۇ، اﷲ ھەقىقەتەن ھەر بىر نەرسە ئۈچۈن مۇئەييەن مىقدار، مۇئەييەن ۋاقىت بەلگىلىدى",
            "verse 65:4": "ئاياللىرىڭلارنىڭ ئىچىدىكى ھەيزدىن ئۈمىدىنى ئۈزگەنلەردىن (يەنى يېشى چوڭ بولغانلىقتىن ھەيز كۆرمەيدىغانلارنىڭ ئىددىتىنىڭ قانچىلىك بولىدىغانلىقىدىن) شۈبھىدە بولساڭلار، ئۇلارنىڭ ئىددىتى ئۈچ ئايدۇر، (كىچىكلىكتىن) ھەيز كۆرمىگەنلەرنىڭ ئىددىتى ھەم ئۈچ ئايدۇر، ھامىلىدار ئاياللارنىڭ ئىددىتى (مەيلى قويۇۋېتىلگەن بولسۇن، مەيلى ئېرى ئۆلۈپ كەتكەن بولسۇن) بوشىنىش بىلەنلا تۈگەيدۇ، كىمكى اﷲ تىن قورقىدىكەن، اﷲ ئۇنىڭ ئىشىنى ئاسانلاشتۇرۇپ بېرىدۇ",
            "verse 65:5": "ئەنە شۇ اﷲ نىڭ سىلەرگە نازىل قىلغان ھۆكمىدۇر، كىمكى اﷲ تىن قورقىدىكەن، اﷲ ئۇنىڭ گۇناھلىرىنى يوققا چىقىرىدۇ، ئۇنىڭغا كاتتا ساۋاب بېرىدۇ",
            "verse 65:6": "ئۇلارنى (يەنى قويۇۋېتىلگەن ئاياللىرىڭلارنى) قۇدرىتىڭلارنىڭ يېتىشىچە ئۆزۈڭلار ئولتۇرۇۋاتقان جايىڭلارنىڭ بىر قىسمىدا ئولتۇرغۇزۇڭلار، ئۇلارنى تەڭلىكتە قالدۇرۇش ئۈچۈن زىيان يەتكۈزمەڭلار (يەنى ئۇلارنى چىقىپ كېتىشكە مەجبۇرلاش ئۈچۈن تۇرالغۇ جەھەتتىن، نەپىقە جەھەتتىن قىسماڭلار)، ئەگەر ئۇلار ھامىلىدار بولسا، بوشانغانغا قەدەر ئۇلارنى تەمىنلەڭلار، ئەگەر ئۇلار سىلەر ئۈچۈن (بالىلىرىڭلارنى) ئېمىتىپ بەرسە، ئۇلارنىڭ (ئېمىتىش) ھەققىنى بېرىڭلار، ھەققانىي ئاساستا ئۆزئارا مەسلىھەتلىشىڭلار، ئەگەر پىكىردە كېلىشەلمىسەڭلار، ئۇنى (يەنى بالىنى) باشقا بىر ئايال ئېمىتسۇن",
            "verse 65:7": "باي ئادەم (ئايالىنى ۋە بالىسىنى) ئۆزىنىڭ بايلىقىغا يارىشا تەمىنلىسۇن، رىزقى تار قىلىنغان ئادەم اﷲ نىڭ ئۇنىڭغا بەرگىنىگە يارىشا تەمىنلىسۇن (يەنى ھەر ئادەم ئۆزىنىڭ ئىقتىسادىي ئەھۋالىغا يارىشا خىراجەت قىلسۇن). اﷲ ئىنساننى پەقەت تاقىتى يېتىدىغان ئىشقىلا تەكلىپ قىلىدۇ (يەنى پېقىر ئادەمنى باينى تەكلىپ قىلغان ئىشقا تەكلىپ قىلمايدۇ)، اﷲ قىيىنچىلىقتىن كېيىن ئاسانلىقنى بېرىدۇ (يەنى پېقىرلىقتىن كېيىن بايلىقنى بېرىدۇ)",
            "verse 65:8": "نۇرغۇن شەھەرنىڭ ئاھالىلىرى پەرۋەردىگارىنىڭ ۋە ئۇنىڭ پەيغەمبىرىنىڭ ئەمرىدىن باش تارتتى، ئۇلاردىن قاتتىق ھېساب ئالدۇق ۋە ئۇلارنى قاتتىق جازالىدۇق",
            "verse 65:9": "ئۇلار قىلمىشلىرىنىڭ ۋابالىنى تېتىدى، ئۇلارنىڭ قىلمىشلىرىنىڭ ئاقىۋىتى زىيان تارتىشتىن ئىبارەت بولدى",
            "verse 65:10": "اﷲ ئۇلارغا (ئاخىرەتتە) قاتتىق ئازاب تەييارلىدى، ئى ئىمان ئېيتقان ئەقىل ئىگىلىرى! اﷲ تىن قورقۇڭلار، اﷲ سىلەرگە قۇرئاننى نازىل قىلدى",
            "verse 65:11": "ئىمان ئېيتقان ۋە ياخشى ئەمەللەرنى قىلغانلارنى قاراڭغۇلۇقتىن نۇرغا چىقىرىش ئۈچۈن سىلەرگە اﷲ نىڭ روشەن ئايەتلىرىنى تىلاۋەت قىلىپ بېرىدىغان پەيغەمبەرنى ئەۋەتتى، كىمكى اﷲ قا ئىمان ئېيتىدىكەن ۋە ياخشى ئەمەل قىلىدىكەن، (اﷲ) ئۇنى ئاستىدىن ئۆستەڭلەر ئېقىپ تۇرىدىغان جەننەتلەرگە كىرگۈزىدۇ، ئۇلار جەننەتلەردە مەڭگۈ قالىدۇ، اﷲ ئۇلارغا ئېسىل رىزىق (يەنى جەننەتتىكى رىزىق ۋە نېمەتلەرنى) بېرىدۇ",
            "verse 65:12": "اﷲ يەتتە ئاسماننى ياراتتى، زېمىننىمۇ ئاسمانلارغا ئوخشاش (يەنى يەتتە قىلىپ) ياراتتى، اﷲ نىڭ ئەمرى ئۇلارنىڭ ئارىسىدا جارى بولۇپ تۇرىدۇ، (سىلەرگە بۇنى بىلدۈرۈشۈم) اﷲ نىڭ ھەممىگە قادىر ئىكەنلىكىنى ۋە اﷲ نىڭ ھەممە نەرسىنى تولۇق بىلىدىغانلىقىنى بىلىشىڭلار ئۈچۈندۇر"
        },
        "Uzbek": {
            "verse 65:1": "Эй Набий! Агар аёлларни талоқ қиладиган бўлсангиз, иддалари учун қилинг ва иддани ҳисобланг ва Алоҳга тақво қилинг. Уларни уйларидан чиқарманглар ва ўзлари ҳам чиқмасинлар, илло, очиқ-ойдин фоҳиша иш қилган бўлсалар (чиқарилурлар). Ва ана шу нарсалар Аллоҳнинг чегараларидир. Ким Аллоҳнинг чегарасидан чиқса, ҳақиқатда ўзи ўзига зулм қилибди. Сен билмайссан, шоядки Аллоҳ ундан кейин бирор ишни пайдо қилса.",
            "verse 65:2": "Бас, улар муддатларига етсалар, яхшилик билан ушланглар, ёки яхшилик билан ажралинглар ва сиздан икки адолатли кишини гувоҳ қилинглар. Ва гувоҳликни Аллоҳ учун қилинглар. Бу ишингиздан кимнинг Аллоҳга ва қиёмат кунига иймони бўлса, ваъзланади. Ким Аллоҳга тақво қилса, У зот унинг йўлини очиб қўюр.",
            "verse 65:3": "Ва унга ўзи ўйламаган тарафдан ризқ берур. Ким Аллоҳга таваккал қилса, бас, унга У зотнинг Ўзи кифоядир. Албатта, Аллоҳ Ўз ишини етказувчидир. Ҳақиқатда, Аллоҳ ҳар бир нарсага ўлчов қилиб қўйган.",
            "verse 65:4": "Аёлларингиздан ҳайздан ноумид бўлганларининг иддаси, агар шубҳангиз бўлса, уч ойдир. Ҳайз кўрмаганлариники ҳам. Ҳомиладорларнинг иддаси ҳомилаларини қўймоқликдир. Ким Аллоҳга тақво қилса, У зот унинг ишида осонлик қилиб берадир.",
            "verse 65:5": "Булар Аллоҳнинг сизга туширган амридир. Ким Аллоҳга тақво қилса, унинг гуноҳларини кечирур ва ажрини кўпайтириб берур.",
            "verse 65:6": "У(аёл)ларга имконингиз борича ўзингиз яшаб турган жойдан жой беринг. Уларга сиқиштириш мақсадида зарар етказманг. Агар ҳомиладор бўлсалар, то ҳомилаларини қўйгунларича уларга нафақа беринглар. Агар сизга (фарзандни) эмизиб берсалар, ҳақларини беринглар, ўзаро яхшилик билан маслаҳат қилинглар. Агар қийинчиликка учрасангиз, у(эр)га (фарзандини) бошқа аёл эмизиб берур.",
            "verse 65:7": "Ризқи кенг кенглигидан нафақа қилсин. Кимнинг ризқи тор бўлса, унга Аллоҳ берганидан нафақа қилсин. Аллоҳ ҳар бир нафсни Ўзи берганидан ортиқчага таклиф қилмас. Аллоҳ қийинчиликдан сўнг тезда осонликни берадир.",
            "verse 65:8": "Кўпгина қишлоқлар ўз Роббисин амрига саркашлик қилди. Бас, Биз уларни шиддатли ҳисобга олдик ва қаттиқ азоб ила азобладик.",
            "verse 65:9": "Бас, улар ўз ишларининг ёмонлигини тотиб кўрдилар ва ишларининг оқибати ютқизиқ бўлди.",
            "verse 65:10": "Аллоҳ уларга қаттиқ азобни тайёрлаб қўйди. Бас, Аллоҳга тақво қилинг, эй иймон келтирган ақл эгалари. Ҳақиқатда, Аллоҳ сизларга зикрни туширди.",
            "verse 65:11": "Пайғабарники, у иймон келтириб ва яхши амалларни қилганларни зулматлардан нурга чиқариш учун, сизларга Аллоҳнинг равшан оятларини тиловат қилиб берур. Ва ким Аллоҳга иймон келтирса ва яхши амалларни қилса, У зот уни дарахтлари остидан анҳорлар оқиб турган жаннатларга киритур. У ерда абадул-абад қолурлар. Ҳақиқатда, Аллоҳ унинг ризқини яхши қилгандир.",
            "verse 65:12": "Аллоҳ етти осмонни ва улар мислидек ерни яратган зотдир. Уларнинг орасидан У зотнинг амри тушадир. Аллоҳ ҳар бир нарсага қодир эканини ва, албатта, Аллоҳ ҳар бир нарсани Ўз илми ила ўраб олганини билишингиз учун."
        },
        "Vietnamese": {
            "verse 65:1": "Hỡi Nabi, khi nào Ngươi và ai đó trong cộng đồng tín đồ của Ngươi muốn ly dị vợ thì các ngươi hãy ly dị họ dựa vào ‘Iddah (thời hạn ấn định) của họ, các ngươi hãy tính cho đúng ‘Iddah. Các ngươi hãy kính sợ Allah, Thượng Đế của các ngươi. Các ngươi không được đuổi họ ra khỏi nhà của họ cũng như bản thân họ không được rời khỏi nhà (trong thời gian đó) trừ phi họ phạm tội Zina rõ ràng. Đó là những giới hạn của Allah, ai vượt quá giới hạn của Allah thì quả thật y đã tự làm hại bản thân mình. Ngươi (hỡi người ly dị) không biết rằng có thể sau này Allah sẽ cho một điều kiện mới nào đó (để hòa giải đôi bên).",
            "verse 65:2": "Khi họ gần chấm dứt thời hạn ấn định của mình, các ngươi hãy giữ họ lại một cách tử tế hoặc ly hôn họ một cách đàng hoàng. Các ngươi hãy mời hai người công bằng trong các ngươi đến làm chứng và hãy vì Allah mà thiết lập chứng cớ rõ ràng. Đó là điều khuyên răn cho bất cứ ai có đức tin nơi Allah và Ngày Sau. Ai kính sợ Allah, Ngài sẽ tạo cho y một lối thoát.",
            "verse 65:3": "Và Ngài sẽ ban bổng lộc cho y theo cách mà y không thể ngờ tới. Và ai phó thác cho Allah thì Ngài đủ giúp y (trong tất cả mọi sự việc). Quả thật, Allah sẽ hoàn thành mục đích của Ngài, và quả thật, Allah đã đặt cho tất cả mọi thứ một mức lượng (theo qui định).",
            "verse 65:4": "Những người không còn mong đợi kinh nguyệt trong số những người vợ của các ngươi, nếu các ngươi nghi ngờ thì ‘Iddah của họ là ba tháng, kể cả những người không có kinh nguyệt. Riêng đối với những người vợ đang mang thai thì ‘Iddah của họ sẽ kéo dài cho đến khi họ sinh con. Ai kính sợ Allah, Ngài sẽ làm cho vấn đề của y trở nên dễ dàng.",
            "verse 65:5": "Đó là mệnh lệnh của Allah, Ngài đã ban nó xuống cho các ngươi. Ai kính sợ Allah, Ngài sẽ xóa bỏ các tội lỗi cho y và sẽ làm phần thưởng thêm to lớn dành cho y.",
            "verse 65:6": "Các ngươi (hỡi những người chồng) hãy để (những người vợ của các ngươi) ở nơi nào mà các ngươi ở tùy theo điều kiện của các ngươi; các ngươi không được gây khó khăn cho họ nhằm ép bức họ. Nếu họ mang thai, các ngươi hãy chu cấp cho họ đến khi họ sinh con. Nếu họ giúp các ngươi cho con bú, các ngươi hãy trả tiền công cho họ và các ngươi hãy trao đổi ý kiến lẫn nhau một cách biết điều và hợp lý, nhưng nếu các ngươi gặp khó khăn (trong việc cho con bú) thì hãy tìm người phụ nữ khác (giúp người chồng) cho con bú.",
            "verse 65:7": "Người dư dả sẽ chi tiêu theo điều kiện dư dả của mình, còn người ít điều kiện thì chi tiêu theo những gì mà Allah ban cấp cho y. Allah không bắt bất cứ linh hồn nào phải nặng gánh mà hãy tùy theo những gì Ngài đã ban cho. (Hãy biết rằng) sau khó khăn, Allah sẽ làm cho dễ dàng.",
            "verse 65:8": "Biết bao thị trấn đã xấc xược với mệnh lệnh của Thượng Đế và các Sứ Giả của Ngài nên TA thanh toán các thị trấn đó bằng một cuộc thanh toán dữ dội, và TA đã trừng phạt chúng bằng một sự trừng phạt khủng khiếp.",
            "verse 65:9": "Các thị trấn đó đã nếm trải hậu quả tồi tệ do tình trạng xấc xược của chúng. Và kết cục cho tình trạng của chúng là sự mất mát thua thiệt.",
            "verse 65:10": "Allah đã chuẩn bị cho chúng một sự trừng phạt nghiêm khắc. Vì vậy, các ngươi hãy kính sợ Allah hỡi những người hiểu biết, những người có đức tin. Quả thật, Allah đã ban xuống cho các ngươi Lời Nhắc Nhở (Qur’an).",
            "verse 65:11": "(Muhammad), một vị Sứ Giả (của Allah) đọc lại cho các ngươi những Lời Mặc Khải của Allah một cách rõ ràng để đưa những người có đức tin và hành thiện từ nơi tăm tối ra ánh sáng. Người nào có đức tin nơi Allah và hành thiện thì sẽ được Ngài thu nhận vào các Ngôi Vườn Thiên Đàng bên dưới có các dòng sông chảy và sẽ sống trong đó mãi mãi. Chắc chắn, Allah sẽ cung cấp cho y bổng lộc tốt nhất.",
            "verse 65:12": "Allah là Đấng đã tạo ra bảy tầng trời và (bảy) trái đất giống như chúng. Mệnh lệnh (của Ngài) truyền xuống giữa chúng để các ngươi biết rằng Allah toàn năng trên tất cả mọi thứ và rằng Allah bao trùm toàn bộ mọi thứ bằng kiến thức của Ngài."
        },
        "Yoruba": {
            "verse 65:1": "Iwo Anabi, nigba ti e ba fe ko awon obinrin sile, e ko won sile pelu sise onka ojo opo fun ikosile won. Ki e si so onka ojo opo. Ki e beru Allahu, Oluwa yin. E ma se mu won jade kuro ninu ile won, awon naa ko si gbodo jade afi ti won ba lo se ibaje t’o foju han. Iwonyen si ni awon enu-ala ti Allahu gbekale. Enikeni ti o ba tayo awon enu-ala ti Allahu gbekale, o kuku ti sabosi si emi ara re. Iwo ko si mo boya Allahu maa mu oro titun sele leyin iyen",
            "verse 65:2": "Nigba ti won ba fe pari onka ojo opo won, e mu won modo ni ona t’o dara tabi ki e ko won sile ni ona t’o dara. E fi awon onideede meji ninu yin jerii si i. Ki e si gbe ijerii naa duro ni titori ti Allahu. Iyen ni A n fi se waasi fun enikeni ti o ba ni igbagbo ododo ninu Allahu ati Ojo Ikeyin. Enikeni ti o ba n beru Allahu, O maa fun un ni ona abayo (ninu isoro)",
            "verse 65:3": "O si maa pese fun un ni aye ti ko ti rokan. Ati pe enikeni ti o ba gbekele Allahu, O maa to o. Dajudaju Allahu yoo mu oro Re de opin. Dajudaju Allahu ti ko odiwon akoko fun gbogbo nnkan",
            "verse 65:4": "Awon obinrin t’o ti soreti nu nipa nnkan osu sise ninu awon obinrin yin, ti e ba seyemeji, onka ojo ikosile won ni osu meta. (Bee naa ni fun) awon ti ko ti i maa se nnkan osu. Awon oloyun, ipari onka ojo opo ikosile tiwon ni pe ki won bi oyun inu won. Enikeni ti o ba n beru Allahu, O maa se oro re ni irorun",
            "verse 65:5": "Iyen ni ase Allahu, ti O sokale fun yin. Enikeni ti o ba n beru Allahu, O maa pa awon asise re re. O si maa je ki esan re tobi",
            "verse 65:6": "E fun won ni ibugbe ninu ibugbe yin bi aye se gba yin mo. E ma se ni won lara lati ko ifunpinpin ba won. Ti won ba je oloyun, e nawo le won lori titi won yoo fi bi oyun inu won. Ti won ba n fun omo yin ni oyan mu, e fun won ni owo-oya won. E damoran laaarin ara yin ni ona t’o dara. Ti oro ko ba si rogbo laaarin ara yin, ki elomiiran ba oko (fun omo) ni oyan mu",
            "verse 65:7": "Ki oloro na ninu oro re. Eni ti A si diwon arisiki re fun (niwonba), ki o na ninu ohun ti Allahu fun un. Allahu ko labo emi kan lorun ayafi nnkan ti O fun un. Allahu yo si mu irorun wa leyin inira",
            "verse 65:8": "Meloo meloo ninu awon ilu ti won yapa ase Oluwa Re ati awon Ojise Re. A si maa siro ise won ni isiro lile. Ati pe A maa je won niya t’o buru gan-an",
            "verse 65:9": "Nitori naa, won to iya oran won wo. Ikangun oro won si je ofo",
            "verse 65:10": "Allahu ti pese iya lile sile de won. Nitori naa, e beru Allahu, eyin onilaakaye ti e gbagbo ni ododo. Allahu kuku ti so iranti kale fun yin",
            "verse 65:11": "Ojise kan ti o maa ke awon ayah Allahu t’o yanju fun yin nitori ki o le mu awon t’o gbagbo ni ododo, ti won tun se awon ise rere, kuro ninu awon okunkun lo sinu imole. Enikeni ti o ba gba Allahu gbo ni ododo, ti o si n se ise rere, O maa mu un wo inu awon Ogba Idera, ti awon odo n san ni isale re. Olusegbere ni won ninu re titi laelae. Dajudaju Allahu ti se arisiki t’o dara julo fun un",
            "verse 65:12": "Allahu ni Eni ti O seda awon sanmo meje ati ile ni (onka) iru re. Ase n sokale laaarin won nitori ki e le mo pe dajudaju Allahu ni Alagbara lori gbogbo nnkan. Ati pe dajudaju Allahu fi imo rogba yi gbogbo nnkan ka"
        }
    }
}