{
    "id": 66,
    "name_simple": "At-Tahrim",
    "revelation_place": "madinah",
    "revelation_order": 107,
    "bismillah_pre": true,
    "verses_count": 12,
    "short_text": "The Surah derived its name from the words lima tuharrimu of the very first verse. This too is not a title of its subject matter, but the name implies that it is the Surah in which the incident of tahrim (prohibition, forbiddance) has been mentioned.",
    "text": [
        "\n",
        "The Surah derived its name from the words lima tuharrimu of the very first verse. This too is not a title of its subject matter, but the name implies that it is the Surah in which the incident of tahrim (prohibition, forbiddance) has been mentioned.",
        "\n",
        "Period of Revelation",
        "\n",
        "In connection with the incident of tahrim referred to in this Surah, the traditions of the Hadith mention two ladies who were among the wives of the Holy Prophet (upon whom be peace) at that time Hadrat Safiyyah and Hadrat Mariyah Qibtiyyah. The former (i. e. Hadrat Safiyyah) was taken to wife by the Holy Prophet after the conquest of Khaiber, and Khaiber was conquered, as has been unanimously reported, in A. H. 7. The other lady, Hadrat Mariyah, had been presented to the Holy Prophet by Muqawqis, the ruler of Egypt, in A. H. 7 and she had borne him his son, Ibrahim, in Dhil-Hijjah, A. H. 8.These historical events almost precisely determine that this Surah was sent down some time during A.H. 7 or A. H 8.",
        "\n",
        "Theme and Topics",
        "\n",
        "This is a very important Surah in which light has been thrown on some questions of grave significance with reference to some incidents concerning the wives of the Holy Prophet (upon whom be Allah's peace).",
        "\n",
        "First, that the powers to prescribe the bounds of the lawful and the unlawful, the permissible and the forbidden, are entirely and absolutely in the hand of Allah and nothing has been delegated even to the Prophet of Allah himself, not to speak of any other man. The Prophet as such can declare something lawful or unlawful only if he receives an inspiration from Allah to do so whether that inspiration is embodied in the Qur'an, or imparted to, him secretly. However, even the Prophet is not authorized to declare anything made permissible by Allah unlawful by himself, much less to say of another man.",
        "\n",
        "Second, that in any society the position of a Prophet is very delicate. A minor incident experienced by an ordinary man in his life may not be of any consequence, but it assumes the status of law when experienced by a Prophet. That is why the lives of the Prophets have been kept under close supervision by Allah so that none of their acts, not even a most trivial one, may deviate from Divine Will. Whenever such an act has emanated from a Prophet, it was rectified and rectified immediately so that the Islamic law and its principles should reach the people in their absolute purity not only through the Divine Book but also through the excellent example of the Prophet, and they should include nothing which may be in disagreement with Divine Will,",
        "\n",
        "Thirdly, and this automatically follows from the above mentioned point, that when the Holy Prophet (upon whom be peace) was checked on a minor thing, which was not only corrected but also recorded, it gives us complete satisfaction that whatever actions and commands and instructions we now find in the pure life of the Holy Prophet concerning which there is nothing on record in the nature of criticism or correction from Allah, they are wholly based on truth, are in complete conformity with Divine Will and we can draw guidance from them with full confidence and peace of mind.",
        "\n",
        "The fourth thing that we learn from this discourse is that about the Holy Messenger himself, whose reverence and respect Allah Himself has enjoined as a necessary part of the Faith of His servants, it has been stated in this Surah that once during his sacred life he made a thing declared lawful by Allah unlawful for himself only to please his wives; then Allah has severely reproved for their errors those very wives of the Holy Prophet, whom He Himself has declared as mothers of the faithful and worthy of the highest esteem and honor by them. Then, this criticism of the Prophet and the administration of the warning to the wives also has not been made secretly but included in the Book, which the entire Ummah has to read and recite for ever. Obviously, neither the intention of making mention of it in the Book of Allah was, nor it could be, that Allah wanted to degrade His Messenger and the mothers of the faithful in the eyes of the believers; and this also is obvious that\r\nno Muslim has lost respect for them, in his heart after reading this Surah of the Qur'an. Now, there cannot be any other reason of mentioning this thing in the Qur'an than that Allah wants to acquaint the believers with the correct manner of reverence for their great personalities. The Prophet is a Prophet, not God, that he may commit no error. Respect of the Prophet has not been enjoined because he is infallible, but because he is a perfect representative of Divine Will, and Allah has not permitted any of his errors to pass by unnoticed. This gives us the satisfaction that the noble pattern of life left by the Prophet wholly and fully represents the will of Allah. Likewise, the Companions of the holy wives of the Prophet, were human, not angels or super men. They could commit mistakes. Whatever ranks they achieved became possible only because the guidance given by Allah and the training imparted by Allah's Messenger had moulded them into the finest models. Whatever esteem and\r\nreverence they deserve is on this very basis and not on the presumption that they were infallible. For this reason, whenever in the sacred lifetime of the Prophet (upon him be peace) the Companions or holy wives happened to commit an error due to human weakness, they were checked. Some of their errors were corrected by the Holy Prophet, as has been mentioned at many places in the Hadith ; some other errors were mentioned in the Qur'an and Allah Himself corrected them so that the Muslims might not form any exaggerated notion of the respect and reverence of their elders and great men, which might raise them from humanity to the position of gods and goddesses. If one studies the Quran carefully, one will see instances of this one after the other. In Surah Al-Imran, in connection with the Battle of Uhud, the Companions have been addressed and told:",
        "\n",
        "\"Allah did fulfill His promise (of help) to you : in the initial stage of the battle, it was you who were killing them by Allah's leave until you lost heart and disputed about your duty and disobeyed your leader, when Allah showed you what (the spoils) you coveted for there were among you sortie who hankered after the life of this world, and others: who cherished the life after death. Then Allah caused your retreat before the disbelievers in order to test you, but the fact is that even then Allah pardoned you, for Allah is very gracious to the believers.\" (v. 152).",
        "\n",
        "In surah An-Nur, in connection with the Slander against Hadrat Aisha, the Companions were told,",
        "\n",
        "\"When you heard of it, why did not the believing men and the believing women have a good opinion of themselves, and why did they not say: this is a manifest slander?......Were it not for Allah's grace and mercy towards you in this world and in the Hereafter, a painful scourge would have visited you because of the slander. (Just consider) when you passed this lie on from one tongue to the other and uttered with your mouths that of which you had no knowledge. You took it as a trifling matter whereas it was a grave offense in the sight of Allah. Why did you not, as soon as you heard of it, say 'It is not proper for us to utter such a thing? Glory be to Allah! This is a great slander'.\"Allah admonishes you that in future you should never repeat anything like this, if you are true believers.\" (vv. 12-17).",
        "\n",
        "In surah Al-Ahzab, the holy wives have been addressed thus: \"O Prophet, say to your wives If you seek the world and its adornments, come, I shall give you of these and send you off in a good way. But if you seek Allah and His Messenger and the abode of the Hereafter, you should rest assured that Allah has prepared a great reward for those of you, who do good.\" (vv. 28-29).",
        "\n",
        "In Surah Jumu'ah about the Companions it was said:",
        "\n",
        "\"And when they saw some merchandise and amusement they broke off to it and left you (O Prophet) standing (in the course of the Sermon). Say to them : that which is with Allah is far better than amusement and merchandise, and Allah is the best of all providers.\" (v. 11).",
        "\n",
        "In Surah Al-Mumtahinah, Hadrat Hatib bin Abi Balta'ah, a Companion who had fought at Badr, was severely taken to task because he had sent secret information to the disbelieving Quraish about the Holy Prophet's invasion before the conquest of Makkah.",
        "\n",
        "All these instances are found in the Qur'an itself, in the same Qur'an in which Allah Himself has paid tribute to the Companions and the holy wives for their great merits, and granted them the certificate of His good pleasure, saying: \"Allah became well pleased with them and they with Allah.\" It was this same moderate and balanced teaching of the reverence and esteem of the great men, which saved the Muslims from falling into the pit of man worship in which the Jews and the Christians fell, and it is a result of the same that in the books that the eminent followers of the Sunnah have compiled on the subjects of the Hadith, Commentary of the Qur'an and History, not only have the excellences and great merits of the Companions and holy wives and other illustrious men been mentioned, but also no hesitance has been shown in mentioning the incidents relating to their weaknesses, errors and mistakes, whereas those scholars were more appreciative of the merits and\r\nexcellences of the great men and understood the bounds and limits of reverence better than those who claim to be the upholders of reverence for the elders today.",
        "\n",
        "The fifth thing that has been explicitly mentioned in this Surah is that Allah's Religion is absolutely fair and just. It has for every person just that of which he becomes worthy on the basis of his faith and works. No relationship or connection even with the most righteous person can be beneficial for him in any way and no relationship or connection with the most evil and wicked person can be harmful for him in any way. In this connection three kinds of women have been cited as examples before the holy wives in particular. One example is of the wives of the Prophets Noah and Lot, who, if they had believed and cooperated with their illustrious husbands, would have occupied the same rank and position in the Muslim community. which is enjoyed by the wives of the Holy Prophet Muhammad (upon whom be Allah's peace and blessings). But since they were disbelievers, their being the wives of the Prophets did not help them and they fell into Hell. The second example is of the wife of\r\nPharaoh, who in spite of being the wife of a staunch enemy of God believed and chose a path of action separate from that followed by the Pharaoh's people, and her being the wife of a staunch disbeliever did not cause her any harm, and Allah made her worthy of Paradise. The third example is of Hadrat Maryam (Mary) (peace be upon her), who attained to the high rank because she submitted to the severe test to which Allah had decided to put her. Apart from Mary no other chaste and righteous girl in the world ever has been put to such a hard test that in spite of being unmarried, she might have been made pregnant miraculously by Allah's command and informed what service her Lord willed to take from her. When Hadrat Maryam accepted this decision, and agreed to bear, like a true believer, everything that she inevitably had to bear in order to fulfill Allah's will, then did Allah exalt her to the noble rank of Sayyidatu an-nisa' fil- Jannah : \"Leader of the women in Paradise\"\r\n(Musnad Ahmad).",
        "\n",
        "Besides, another truth that we learn from this Surah is that the Holy Prophet (upon whom be peace) did not receive from Allah only that knowledge which is included and recorded in the Qur'an, but he was given information about other things also by revelation, which has not been recorded in the Qur'an. Its clear proof is verse 3 of this Surah. In it we are told that the Holy Prophet (upon whom be peace) confided a secret to one of his wives, and she told it to another. Allah informed the Holy Prophet of this secret. Then, when the Holy Prophet warned his particular wife on the mistake of disclosure and she said:\"Who has informed you of this mistake of mine7\" he replied: \"I have been informed of it by Him Who knows everything and is All Aware.\" Now, the question is where in the Qur'an is the verse in which Allah has said \"O Prophet, the secret that you had confided to one of your wives, has been disclosed by her to another person, or to so and so?If there is no such verse in the\r\nQur'an, and obviously there is none, this is an express proof of the fact that revelation descended on the Holy Prophet besides the Qur'an as well. This refutes the claim of the deniers of Hadith, who allege that nothing was sent down to the Holy Prophet (upon whom be peace) apart from the Qur'an.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with admonishing the Prophet against The Forbidding or prohibition of something he once imposed on himself for the purpose of not oending his wives, though God had made it lawful for him. Named after the phrase “why do you forbid” (li mā tuḥrimu) in verse 1. It mentions two of the Prophet’s wives, namely Ḥafṣah and ʿĀyishah, for an incident when a confidence was betrayed (verse 3 .) and urges all believers to submit themselves to God and to guard themselves and their families against Hellfire (verse 6). The surah closes by giving examples of believing and disbelieving women (verse 10 .).The surah is also known as: Holding (something) to be Forbidden, The Prohibition.",
    "name_translation": "The Forbidding",
    "name_complex": "At-Tahrîm",
    "surah_name_ar": "التحريم",
    "verses": {
        "Albanian": {
            "verse 66:1": "O Pejgamber! Përse po ia ndalon vetes atë që ta ka lejuar Perëndia ty, në kërkimin e kënaqësisë së grave tuaja. E, perëndia është falës dhe mëshirues.",
            "verse 66:2": "Perëndia ju ka bërë të mundshme që të liroheni nga betimet tuaja; Perëndia është Zoti juaj; Ai është i Plotëdijshëm dhe i Gjithëdijshëm.",
            "verse 66:3": "Kur Pejgamberi ia shfaqi një fjalë të fshehtë njërës prej grave të tij; e ajo pastaj e shpalli këtë fjalë, - e Perëndia ia zbuloi këtë Pejgamberit – ai një pjesë të këtij zbulimi e tregoi, kurse pjesën tjetër e heshti. Kur Pejgamberi e informoi atë (gruan) për këtë fshehtësi, ajo e pyeti: “E kush të ka treguar ty për këtë (se nuk e paskam ruajtur bisedën e fshehtë)?” Ai i tha: Ma tregoi ai që di gjithçka dhe të cilit çdo gjë i është e njohur.",
            "verse 66:4": "Nëse ju të dyja pendoheni te Perëndia, se zemrat tuaja kanë anuar (Perëndia ju falë). Nëse ju të dyja bashkoheni kundër tij (kurrgjë nuk mund të arrini), se, me të vërtetë, Perëndia është mbrojtësi i tij, dhe Xhebraili dhe besimtarët e mirë; e pastaj edhe gjithë engjëjt janë përkrahësit e tij.",
            "verse 66:5": "Në qoftë se ju lëshon ai juve, Zoti i tij mund t’ia zëvendësojë ato – atij, me gra më të mira se ju: muslimane dhe besimtare, përulëse, penduese, lutëse (shumë) agjëruese, të veja dhe vasha.",
            "verse 66:6": "O ju që besoni! Ruani veten dhe familjet tuaja nga zjarri, karburante (lëndë djegëse) të të cilit janë njerëzit dhe gurët, dhe të cilin e mbikëqyrin engjëjt e fuqishëm dhe të ashpër, të cilët nuk u kundërshtojnë urdhërave të Perëndisë dhe të cilët punojnë për atë që urdhërohen.",
            "verse 66:7": "O ju që nuk keni besuar! Mos u arsyetoni sot, sepse, me të vërtetë, dënoheni vetëm për veprat që keni bërë.",
            "verse 66:8": "O ju që kei besuar! Pendohuni sinqerisht te Perëndia, se Zoti juaj mund t’ua shlyejë gabimet tuaja e t’ju shpiejë në kopshte, nëpër të cilët rrjedhin lumenjt, në Ditën në të cilën Perëndia nuk do ta turpërojë Profetin dhe ata që bashkë me të kanë besuar; drita e tyre ecë para tyre dhe në të djathtë të tyre. Ata thonë: “O Zoti ynë, plotësona dritën tonë dhe falna neve, sepse, Ti, me të vërtetë, je i Plotëfuqishëm.",
            "verse 66:9": "O Profet! Luftoji të pafetë dhe hipokritët dhe bëhu i ashpër ndaj tyre! Vendbanimi i tyre do të jetë skëterra. E, sa i shëmtuar është ai vendbanim!",
            "verse 66:10": "Perëndia jep shembull, për ata që nuk besojnë, - gruan e Nuhut dhe gruan e Lutit: ato kanë qenë të martuara për dy njerëz nga njerëzit Tonë të ndershëm, por ato ndaj tyre kanë qenë mashtruese (hipokrite) – dhe ata dy nuk do të mund t’u ndihmojnë atyre dyjave – te Perëndia (për t’i shpëtuar nga dënimi), e do t’u thuhet atyre: “Hyni ju të dyja në zjarr, me ata (të gjithë) që po hyjnë!”",
            "verse 66:11": "E, Perëndia jep shembull për ata që besojnë – gruan e Faraonit, kur ajo tha: “O Zoti im, ndërtoma mua një banesë te Ti në xhennet, dhe më shpëto nga Faraoni dhe veprat e tij, dhe më shpëto nga populli zullumqar!”",
            "verse 66:12": "dhe, (shembullin) e merjemës, të bijës së Imranit, e cila e ka ruajtur virgjinitetin e saj, e Ne kemi frymëzuar në te, prej Shpirtit Tonë. Ajo u besonte fjalëve të Zotit të saj dhe librave të Tij, dhe ajo ishte nga personat që luteshin shumë."
        },
        "Amharic": {
            "verse 66:1": "አንተ ነቢዩ ሆይ! አላህ ለአንተ የፈቀደልህን ነገር ሚስቶችህን ማስወደድን የምትፈልግ ስትኾን (ባንተ ላይ) ለምን እርም ታደርጋለህ? አላህም እጅግ መሓሪ አዛኝ ነው፡፡",
            "verse 66:2": "አላህ ለእናንተ የመሓሎቻችሁን መፍቻ ደነገገላችሁ፡፡ አላህም ረዳታችሁ ነው፡፡ እርሱም ዐዋቂው ጥበበኛው ነው፡፡",
            "verse 66:3": "ነቢዩ ከሚስቶቹ ወደ አንዷ ወሬን በመሰጠረ ጊዜ (አስታውስ)፡፡ እርሱንም በነገረችና አላህ እርሱን (ማውራትዋን) ባሳወቀው ጊዜ ከፊሉን አስታወቀ፡፡ ከፊሉንም ተወ፡፡ በእርሱም ባወራት ጊዜ «ይህን ማን ነገረህ?» አለች፡፡ «ዐዋቂው ውስጠ ዐዋቂው ነገረኝ» አላት፤",
            "verse 66:4": "ወደ አላህ ብትመለሱ ልቦቻችሁ በእርግጥ ተዘንብለዋልና (ትስማማላችሁ)፡፡ በእርሱም ላይ ብትረዳዱ አላህ እርሱ ረዳቱ ነው፡፡ ጂብሪልም ከምእምናንም መልካሙ ከዚህም በኋላ መላእክቱ ረዳቶቹ ናቸው፡፡",
            "verse 66:5": "(መላችሁንም) ቢፈታችሁ ከእናንተ የበለጡ ሚስቶችን ሙስሊሞች፣ አማኞች፣ ታዛዦች፣ ተጸጻቾች፣ (ለአላህ) ተገዢዎች፣ ጾመኛዎች ፈቶች፣ ደናግልም የኾኑትን ጌታው ሊለውጠው ይከጀላል፡፡",
            "verse 66:6": "እናንተ ያመናችሁ ሆይ! ነፍሶቻችሁንና ቤተሰቦቻችሁን መቀጣጠያዋ ሰዎችና ደንጋዮች ከኾነች እሳት ጠብቁ፡፡ በእርሷ ላይ ጨካኞች፣ ኀይለኞች የኾኑ መላእክት አልሉ፡፡ አላህን ያዘዛቸውን ነገር (በመጣስ) አያምጹም፡፡ የሚታዘዙትንም ሁሉ ይሠራሉ፡፡",
            "verse 66:7": "እላንተ የካዳችሁ ሆይ! ዛሬ አታመካኙ፡፡ የምትመነዱት ያንን ትሠሩት የነበራችሁትን ብቻ ነው (ይባላሉ)፡፡",
            "verse 66:8": "እናንተ ያመናችሁ ሆይ! ንጹሕ የኾነችን ጸጸት በመጸጸት ወደ አላህ ተመለሱ፡፡ ጌታችሁ ከእናንተ ኀጢኣቶቻችሁን ሊሰርይላችሁ ከሥሮቻቸው ወንዞች የሚፈሱባቸውንም ገነቶች ሊያስገባችሁ ይከጀላልና፡፡ አላህ ነቢዩን፣ እነዚያንም ከእርሱ ጋር ያመኑትን በማያሳፍርበት ቀን ብርሃናቸው በፊቶቻቸውና በቀኞቻቸው የሚሮጥ ሲኾን «ጌታችን ሆይ! ብርሃናችንን ሙላልን፣ ለእኛ ምሕረትም አድርግልን፣ አንተ በነገሩ ሁሉ ላይ ቻይ ነህና» ይላሉ፡፡",
            "verse 66:9": "አንተ ነቢዩ ሆይ! ከሓዲዎችንና መናፍቃንን ታገል፡፡ በእነርሱም ላይ በርታ፡፡ መኖሪያቸውም ገሀነም ናት፡፡ ምን ትከፋም መመለሻ!",
            "verse 66:10": "አላህ ለእነዚያ ለካዱት ሰዎች የኑሕን ሴትና የሉጥን ሴት ምሳሌ አደረገ፡፡ ከባሮቻችን ከኾኑ ሁለት መልካም ባሪያዎች ሥር ነበሩ፡፡ ከዱዋቸውም፡፡ ከአላህም (ቅጣት ኑሕና ሉጥ) ከሚስቶቻቸው ምንም አልገፈተሩላቸውም፡፡ ከገቢዎቹም ጋር «እሳትን ግቡ» ተባሉ፡፡",
            "verse 66:11": "ለእነዚያ ለአመኑትም የፈርኦንን ሴት አላህ ምሳሌ አደረገ፡፡ «ጌታዬ ሆይ! አንተ ዘንድ በገነት ውስጥ ለእኔ ቤትን ገንባልኝ፡፡ ከፈርዖንና ከሥራውም አድነኝ፡፡ ከበደለኞቹ ሕዝቦችም አድነኝ» ባለች ጊዜ፡፡",
            "verse 66:12": "የዒምራንን ልጅ መርየምንም ያችን ብልቷን የጠበቀችውን (ምሳሌ አደረገ)፡፡ በእርሱም ውስጥ ከመንፈሳችን ነፍፋን፡፡ በጌታዋ ቃላትና በመጻሕፍቱም አረጋገጠች፡፡ ከታዛዦቹም ነበረች፡፡"
        },
        "Arabic": {
            "verse 66:1": "ٌميِحَّر ٌروُفَغ ُهَّللاَو ۚ َكِجاَوْزَأ َتاَضْرَم يِغَتْبَت ۖ َكَل ُهَّللا َّلَحَأ اَم ُمِّرَحُت َمِل ُّيِبَّنلا اَهُّيَأ اَي",
            "verse 66:2": "ُميِكَحْلا ُميِلَعْلا َوُهَو ۖ ْمُكاَلْوَم ُهَّللاَو ۚ ْمُكِناَمْيَأ َةَّلِحَت ْمُكَل ُهَّللا َضَرَف ْدَق",
            "verse 66:3": "ُريِبَخْلا ُميِلَعْلا َيِنَأَّبَن َلاَق ۖ اَذَٰه َكَأَبنَأ ْنَم ْتَلاَق ِهِب اَهَأَّبَن اَّمَلَف ۖ ٍضْعَب نَع َضَرْعَأَو ُهَضْعَب َفَّرَع ِهْيَلَع ُهَّللا ُهَرَهْظَأَو ِهِب ْتَأَّبَن اَّمَلَف اًثيِدَح ِهِجاَوْزَأ ِضْعَب ٰىَلِإ ُّيِبَّنلا َّرَسَأ ْذِإَو",
            "verse 66:4": "ٌريِهَظ َكِلَٰذ َدْعَب ُةَكِئاَلَمْلاَو ۖ َنيِنِمْؤُمْلا ُحِلاَصَو ُليِرْبِجَو ُهاَلْوَم َوُه َهَّللا َّنِإَف ِهْيَلَع اَرَهاَظَت نِإَو ۖ اَمُكُبوُلُق ْتَغَص ْدَقَف ِهَّللا ىَلِإ اَبوُتَت نِإ",
            "verse 66:5": "اًراَكْبَأَو ٍتاَبِّيَث ٍتاَحِئاَس ٍتاَدِباَع ٍتاَبِئاَت ٍتاَتِناَق ٍتاَنِمْؤُّم ٍتاَمِلْسُم َّنُكنِّم اًرْيَخ اًجاَوْزَأ ُهَلِدْبُي نَأ َّنُكَقَّلَط نِإ ُهُّبَر ٰىَسَع",
            "verse 66:6": "َنوُرَمْؤُي اَم َنوُلَعْفَيَو ْمُهَرَمَأ اَم َهَّللا َنوُصْعَي اَّل ٌداَدِش ٌظاَلِغ ٌةَكِئاَلَم اَهْيَلَع ُةَراَجِحْلاَو ُساَّنلا اَهُدوُقَو اًراَن ْمُكيِلْهَأَو ْمُكَسُفنَأ اوُق اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 66:7": "َنوُلَمْعَت ْمُتنُك اَم َنْوَزْجُت اَمَّنِإ ۖ َمْوَيْلا اوُرِذَتْعَت اَل اوُرَفَك َنيِذَّلا اَهُّيَأ اَي",
            "verse 66:8": "ٌريِدَق ٍءْيَش ِّلُك ٰىَلَع َكَّنِإ ۖ اَنَل ْرِفْغاَو اَنَروُن اَنَل ْمِمْتَأ اَنَّبَر َنوُلوُقَي ْمِهِناَمْيَأِبَو ْمِهيِدْيَأ َنْيَب ٰىَعْسَي ْمُهُروُن ۖ ُهَعَم اوُنَمآ َنيِذَّلاَو َّيِبَّنلا ُهَّللا يِزْخُي اَل َمْوَي ُراَهْنَأْلا اَهِتْحَت نِم يِرْجَت ٍتاَّنَج ْمُكَلِخْدُيَو ْمُكِتاَئِّيَس ْمُكنَع َرِّفَكُي نَأ ْمُكُّبَر ٰىَسَع اًحوُصَّن ًةَبْوَت ِهَّللا ىَلِإ اوُبوُت اوُنَمآ َنيِذَّلا اَهُّيَأ اَي",
            "verse 66:9": "ُريِصَمْلا َسْئِبَو ۖ ُمَّنَهَج ْمُهاَوْأَمَو ۚ ْمِهْيَلَع ْظُلْغاَو َنيِقِفاَنُمْلاَو َراَّفُكْلا ِدِهاَج ُّيِبَّنلا اَهُّيَأ اَي",
            "verse 66:10": "(َنيِلِخاَّدلا َعَم َراَّنلا اَلُخْدا َليِقَو اًئْيَش ِهَّللا َنِم اَمُهْنَع اَيِنْغُي ْمَلَف اَمُهاَتَناَخَف ِنْيَحِلاَص اَنِداَبِع ْنِم ِنْيَدْبَع َتْحَت اَتَناَك ۖ ٍطوُل َتَأَرْماَو ٍحوُن َتَأَرْما اوُرَفَك َنيِذَّلِّل اًلَثَم ُهَّللا َبَرَض",
            "verse 66:11": "(َنيِمِلاَّظلا ِمْوَقْلا َنِم يِنِّجَنَو ِهِلَمَعَو َنْوَعْرِف نِم يِنِّجَنَو ِةَّنَجْلا يِف اًتْيَب َكَدنِع يِل ِنْبا ِّبَر ْتَلاَق ْذِإ َنْوَعْرِف َتَأَرْما اوُنَمآ َنيِذَّلِّل اًلَثَم ُهَّللا َبَرَضَو",
            "verse 66:12": "(َنيِتِناَقْلا َنِم ْتَناَكَو ِهِبُتُكَو اَهِّبَر ِتاَمِلَكِب ْتَقَّدَصَو اَنِحوُّر نِم ِهيِف اَنْخَفَنَف اَهَجْرَف ْتَنَصْحَأ يِتَّلا َناَرْمِع َتَنْبا َمَيْرَمَو"
        },
        "Azerbaijani": {
            "verse 66:1": "Ey Peyğəmbər! Zövcələrini razı salmağa çalışaraq Allahın sənə halal etdiyi şeyi nə üçün özünə qadağan edirsən? Allah Bağışlayandır, Rəhmlidir.",
            "verse 66:2": "Allah, andlarınızdan kəffarə verməklə azad olmağı sizdən ötrü qanuniləşdirmişdir. Allah sizin himayədarınızdır. O, Biləndir, Müdrikdir.",
            "verse 66:3": "Bir zaman Peyğəmbər öz zövcələrindən birinə sirr verdi. O da bunu onun digər zövcəsinə xəbər verdikdə və Allah da bunu Peyğəmbərə aşkar etdikdə o, bunun bir qismini sirr verdiyi zövcəsinə bildirdi, digər qismindən isə vaz keçdi. Peyğəmbər bunu ona bildirdikdə zövcəsi dedi: “Bunu sənə kim xəbər verdi?” O dedi: “Bunu mənə hər şeyi Bilən, Xəbərdar olan Allah xəbər verdi!”",
            "verse 66:4": "Əgər ikiniz də Allaha tövbə etsəniz, yaxşı olar. Çünki hər ikinizin qəlbi günaha meyl etmişdir. Əgər Peyğəmbərə qarşı bir-birinizə dəstək versəniz, bilin ki, Allah, Cəbrail və əməlisaleh möminlər onun dostu və yardımçısıdır. Bunlardan başqa mələklər də onun yardımçılarıdır.",
            "verse 66:5": "Əgər o sizi boşasa, Rəbbi sizin əvəzinizə ona sizdən daha yaxşı zövcələr – müsəlman, mömin, itaətkar, tövbə edən, ibadət edən, oruc tutan dul qadınlar və bakirə qızlar verə bilər.",
            "verse 66:6": "Ey iman gətirənlər! Özünüzü və ailənizi yanacağı insanlar və daşlar olan oddan qoruyun! Onun başı üstündə Allahın onlara verdiyi əmrlərə heç vaxt asi olmayan, özlərinə buyurulanları yerinə yetirən amansız və güclü mələklər vardır.",
            "verse 66:7": "Ey kafir olanlar! Bu gün üzr diləməyin. Siz ancaq etdiyiniz əməllərin cəzasını çəkəcəksiniz!",
            "verse 66:8": "Ey iman gətirənlər! Allaha səmimi olaraq tövbə edin. Ola bilsin ki, Rəbbiniz günahlarınızdan keçsin və sizi, Allah o Peyğəmbəri və onunla birlikdə iman gətirənləri utandırmayacağı gündə, ağacları altından çaylar axan Cənnət bağlarına daxil etsin. Onların nuru önlərindən və sağ tərəflərindən ətrafa yayılacaqdır. Onlar deyəcəklər: “Ey Rəbbimiz! Nurumuzu bizim üçün tamamla və bizi bağışla. Həqiqətən, Sən hər şeyə qadirsən!”",
            "verse 66:9": "Ey Peyğəmbər! Kafirlərə və münafiqlərə qarşı vuruş! Onlarla sərt davran! Onların sığınacağı yer Cəhənnəmdir. Ora necə də pis dönüş yeridir!",
            "verse 66:10": "Allah kafirlərə Nuhun arvadı ilə Lutun arvadını misal çəkdi. Onlar Bizim əməlisaleh qullarımızdan iki qulun nikahı altında idilər. Onlar ərlərinə xəyanət etdilər və bunlar onları Allahdan heç cür xilas edə bilmədilər. Onlara: “Girənlərlə birgə ikiniz də oda girin!”– deyildi.",
            "verse 66:11": "Allah iman gətirənlərə isə Fironun zövcəsini misal çəkdi. O zaman o: “Ey Rəbbim! Mənə Öz yanında – Cənnətdə bir ev tik. Məni Firondan və onun əməlindən xilas et. Məni zalım adamlardan qurtar!”– demişdi.",
            "verse 66:12": "Həmçinin ismətini qoruyan İmran qızı Məryəmi də misal çəkdi. Biz ona paltarının yaxasından Öz ruhumuzdan üfürdük. O, Rəbbinin Sözlərini və Onun Kitablarını təsdiq etdi və itaət edənlərdən oldu."
        },
        "Bengali": {
            "verse 66:1": "হে নবী, আল্লাহ আপনার জন্যে যা হালাল করছেন, আপনি আপনার স্ত্রীদেরকে খুশী করার জন্যে তা নিজের জন্যে হারাম করেছেন কেন? আল্লাহ ক্ষমাশীল, দয়াময়।",
            "verse 66:2": "আল্লাহ তোমাদের জন্যে কসম থেকে অব্যহতি লাভের উপায় নির্ধারণ করে দিয়েছেন। আল্লাহ তোমাদের মালিক। তিনি সর্বজ্ঞ, প্রজ্ঞাময়।",
            "verse 66:3": "যখন নবী তাঁর একজন স্ত্রীর কাছে একটি কথা গোপনে বললেন, অতঃপর স্ত্রী যখন তা বলে দিল এবং আল্লাহ নবীকে তা জানিয়ে দিলেন, তখন নবী সে বিষয়ে স্ত্রীকে কিছু বললেন এবং কিছু বললেন না। নবী যখন তা স্ত্রীকে বললেন, তখন স্ত্রী বললেনঃ কে আপনাকে এ সম্পর্কে অবহিত করল? নবী বললেন,ঃ যিনি সর্বজ্ঞ, ওয়াকিফহাল, তিনি আমাকে অবহিত করেছেন।",
            "verse 66:4": "তোমাদের অন্তর অন্যায়ের দিকে ঝুঁকে পড়েছে বলে যদি তোমরা উভয়ে তওবা কর, তবে ভাল কথা। আর যদি নবীর বিরুদ্ধে একে অপরকে সাহায্য কর, তবে জেনে রেখ আল্লাহ জিবরাঈল এবং সৎকর্মপরায়ণ মুমিনগণ তাঁর সহায়। উপরন্তুত ফেরেশতাগণও তাঁর সাহায্যকারী।",
            "verse 66:5": "যদি নবী তোমাদের সকলকে পরিত্যাগ করেন, তবে সম্ভবতঃ তাঁর পালনকর্তা তাঁকে পরিবর্তে দিবেন তোমাদের চাইতে উত্তম স্ত্রী, যারা হবে আজ্ঞাবহ, ঈমানদার, নামাযী তওবাকারিণী, এবাদতকারিণী, রোযাদার, অকুমারী ও কুমারী।",
            "verse 66:6": "মুমিনগণ, তোমরা নিজেদেরকে এবং তোমাদের পরিবার-পরিজনকে সেই অগ্নি থেকে রক্ষা কর, যার ইন্ধন হবে মানুষ ও প্রস্তর, যাতে নিয়োজিত আছে পাষাণ হৃদয়, কঠোরস্বভাব ফেরেশতাগণ। তারা আল্লাহ তা’আলা যা আদেশ করেন, তা অমান্য করে না এবং যা করতে আদেশ করা হয়, তাই করে।",
            "verse 66:7": "হে কাফের সম্প্রদায়, তোমরা আজ ওযর পেশ করো না। তোমাদেরকে তারই প্রতিফল দেয়া হবে, যা তোমরা করতে।",
            "verse 66:8": "মুমিনগণ! তোমরা আল্লাহ তা’আলার কাছে তওবা কর-আন্তরিক তওবা। আশা করা যায়, তোমাদের পালনকর্তা তোমাদের মন্দ কর্মসমূহ মোচন করে দেবেন এবং তোমাদেরকে দাখিল করবেন জান্নাতে, যার তলদেশে নদী প্রবাহিত। সেদিন আল্লাহ নবী এবং তাঁর বিশ্বাসী সহচরদেরকে অপদস্থ করবেন না। তাদের নূর তাদের সামনে ও ডানদিকে ছুটোছুটি করবে। তারা বলবেঃ হে আমাদের পালনকর্তা, আমাদের নূরকে পূর্ণ করে দিন এবং আমাদেরকে ক্ষমা করুন। নিশ্চয় আপনি সবকিছুর উপর সর্ব শক্তিমান।",
            "verse 66:9": "হে নবী! কাফের ও মুনাফিকদের বিরুদ্ধে জেহাদ করুন এবং তাদের প্রতি কঠোর হোন। তাদের ঠিকানা জাহান্নাম। সেটা কতই না নিকৃষ্ট স্থান।",
            "verse 66:10": "আল্লাহ তা’আলা কাফেরদের জন্যে নূহ-পত্নী ও লূত-পত্নীর দৃষ্টান্ত বর্ণনা করেছেন। তারা ছিল আমার দুই ধর্মপরায়ণ বান্দার গৃহে। অতঃপর তারা তাদের সাথে বিশ্বাসঘাতকতা করল। ফলে নূহ ও লূত তাদেরকে আল্লাহ তা’আলার কবল থেকে রক্ষা করতে পারল না এবং তাদেরকে বলা হলঃ জাহান্নামীদের সাথে জাহান্নামে চলে যাও।",
            "verse 66:11": "আল্লাহ তা’আলা মুমিনদের জন্যে ফেরাউন-পত্নীর দৃষ্টান্ত বর্ণনা করেছেন। সে বললঃ হে আমার পালনকর্তা! আপনার সন্নিকটে জান্নাতে আমার জন্যে একটি গৃহ নির্মাণ করুন, আমাকে ফেরাউন ও তার দুস্কর্ম থেকে উদ্ধার করুন এবং আমাকে যালেম সম্প্রদায় থেকে মুক্তি দিন।",
            "verse 66:12": "আর দৃষ্টান্ত বর্ণনা করেছেন এমরান-তনয়া মরিয়মের, যে তার সতীত্ব বজায় রেখেছিল। অতঃপর আমি তার মধ্যে আমার পক্ষ থেকে জীবন ফুঁকে দিয়েছিলাম এবং সে তার পালনকর্তার বানী ও কিতাবকে সত্যে পরিণত করেছিল। সে ছিল বিনয় প্রকাশকারীনীদের একজন।"
        },
        "Berber Amazigh": {
            "verse 66:1": "A Nnbi! Ay$eô tgedlev ayen i k Iêell Öebbi? Tqennâav tilawin ik. Öebbi Ipsemmiê, Ipêunu.",
            "verse 66:2": "Öebbi Iêeppem fellawen a pêentem. Öebbi d Bab nnwen. Neppa d Amusnaw, d Bab n ûûwab.",
            "verse 66:3": "Mi inna Nnbi sser, i yiwet si tlawin is, u temla, Öebbi Issken it i neppa. Ixebbeô s wumur, iffer amur, segs. Mi p iaâlem s waya, tenna: \"wi k imlan aya\"? Inna: \"Imla yi t Win Issnen, Ippuxebbôen\".",
            "verse 66:4": "Ma tutubemt Öebbi, ihi knan wulawen n kwent. Ma tedduklemt as, ihi, d Öebbi ay d Bab is, u, deffir waya, ad ilin di talalt is: Jebrayen, ûûam n lmumnin, u lmalayek ad fkent afud.",
            "verse 66:5": "Ma ibra yakwent, Izmer Öebbi ad as d Inûef s tlawin i kwent yifen, timvuâin, tid iumnen, ipéallan, iutuben, iâabden, ippuéumen, tid ijeôben tissulya, ne$ tiâazriyin.",
            "verse 66:6": "A wid iumnen! Ëadret iman nnwen akked twacult nnwen, si tmes, is$aôen is d imdanen akked id$a$en! Fellas lmalayek tuohidin, tuqsiêin, ur nepwexxiô i wayen i sent Iumeô Öebbi, i ixedmen i sent ipwamôen.",
            "verse 66:7": "A wid ijehlen, ulay$eô teste$fôem assa! A ppeppuqeîîim kan $ef wayen txeddmem.",
            "verse 66:8": "A wid iumnen! Utubet Öebbi, ppuba n ûûeê! Ahat Mass nnwen ad awen Ikkes tucmitin nnwen, u a kwen Issekcem ar Loennet, ddaw as isaffen ppazzalen. Assen, Öebbi ur Isdullu Nnbi akked wid iumnen yides. Tafat nnsen teppeddu zdat sen, u yeffus nnsen. Ad qqaôen: \"a Mass nne$! Tim ane$ tafat nne$, Semmeê ane$; ih, Keçç, Tzemrev i yal cci\".",
            "verse 66:9": "A Nnbi! Nna$ ijehliyen akked ixabiten! Iqsiê $uôsen! Axxam nnsen d Loahennama, d tu$alin tucmip.",
            "verse 66:10": "Ifka d Öebbi amedya i wid ijehlen: tameîîut n Nuê akked tmeîîut n Luî. Llant ger ifassen n sin imdanen, seg wid imaânen n imdanen nne$. £uüôôent pen. Ur zmiren a tent sselken s wacemma, seg ufus n Öebbi. Ancad: \"kecmemt ar tmes akked wid ikecmen\"!",
            "verse 66:11": "Ifka d Öebbi amedya i wid iumnen, tameîîut n Ferâun, mi tenna: \"a Mass iw! Ebnu yi, $uôeK, taxxamt di Loennet, Sellek iyi si Ferâun akked igiten is, Sellek iyi si lqum imednas\"!",
            "verse 66:12": "U Meryem ult Âimôan i izazdgen tuzzuft is. Nenfes $uôes si ôôuê nne£, tepputebbet $ef wawalen akked tezmamin n Mass is. Neppat seg wid ipéallan."
        },
        "Bosnian": {
            "verse 66:1": "O Vjerovjesniče, zašto sebi uskraćuješ ono što ti je Allah dozvolio – u nastojanju da žene svoje zadovoljiš? A Allah prašta i samilostan je.",
            "verse 66:2": "Allah vam je propisao kako da svoje zakletve iskupite; Allah je vaš Gospodar; On sve zna i mudar je.",
            "verse 66:3": "Kada je Vjerovjesnik jednoj od svojih žena jednu tajnu povjerio pa je ona odala – a Allah je to njemu otkrio – on joj je bio jedan dio kazao, a ostalo prešutio. I kad je on s tim nju upoznao, ona je upitala: \"A ko ti je to kazao?\" – on je rekao: \"Kazao mi je Onaj koji sve zna i kome ništa nije skriveno.\"",
            "verse 66:4": "Ako vas dvije učinite pokajanje Allahu, pa – vi ste bile učinile ono zbog čega ste se trebale pokajati. A ako se protiv njega udružite, pa – Allah je zaštitnik njegov, i Džibril, i čestiti vjernici; najposlije, i svi meleki će mu na pomoći biti.",
            "verse 66:5": "Ako vas on pusti, Gospodar njegov će mu dati umjesto vas boljih žena od vas; odanih Allahu, vjernica, poslušnih Allahu, pokajnica, koje se Allaha boje, koje poste, udovica i djevojaka.",
            "verse 66:6": "O vi koji vjerujete, sebe i porodice svoje čuvajte od vatre čije će gorivo ljudi i kamenje biti, i o kojoj će se meleki strogi i snažni brinuti, koji se onome što im Allah zapovjedi neće opirati, i koji će ono što im se naredi izvršiti.",
            "verse 66:7": "O vi koji niste vjerovali, danas se ne pravdajte, kažnjavate se samo za ono što ste zaslužili.",
            "verse 66:8": "O vi koji vjerujete, učinite pokajanje Allahu iskreno, da bi Gospodar vaš preko ružnih postupaka vaših prešao i da bi vas u džennetske bašče, kroz koje će rijeke teći, uveo, na Dan u kojem Allah neće osramotiti Vjerovjesnika i one koji su zajedno sa njim vjerovali; svjetlo njihovo će ići ispred njih i s njihove desne strane. \"Gospodaru naš\" – govoriće oni – \"učini potpunim svjetlo naše i oprosti nam jer Ti, doista, sve možeš.\"",
            "verse 66:9": "O Vjerovjesniče, bori se protiv nevjernika i licemjera i budi strog prema njima! Njihovo prebivalište biće Džehennem, a užasno je to boravište!",
            "verse 66:10": "Allah navodi kao pouku onima koji ne vjeruju ženu Nuhovu i ženu Lutovu: bile su udate za dva čestita roba Naša, ali su prema njima licemjerne bile – i njih dvojica im neće ništa moći kod Allaha pomoći, i reći će se: \"Ulazite vas dvije u vatru, sa onima koji ulaze!\"",
            "verse 66:11": "A onima koji vjeruju – Allah kao pouku navodi ženu faraonovu, kad je rekla: \"Gospodaru moj, sagradi mi kod Sebe kuću u Džennetu i spasi me od faraona i mučenja njegova, i izbavi me od naroda nepravednog!\"",
            "verse 66:12": "i Merjemu, kćer Imranovu, koja je nevinost svoju sačuvala, a Mi smo udahnuli u nju život i ona je u riječi Gospodara svoga i knjige Njegove vjerovala i od onih koji provode vrijeme u molitvi bila."
        },
        "Bulgarian": {
            "verse 66:1": "О, Пророче, защо си възбраняваш онова, което Аллах ти е разрешил, стремейки се да угодиш на своите съпруги. Но Аллах е опрощаващ, милосърден.",
            "verse 66:2": "Аллах вече наложи изкупление при отмятане от вашите клетви. Аллах е вашият Покровител. Той е Всезнаещия, Премъдрия.",
            "verse 66:3": "Пророка тайно довери на една от своите съпруги новина. А когато тя я съобщи [на Аиша] и Аллах му разкри това, той сподели [с нея] част и избягна друга. И щом й го съобщи, тя рече: “Кой ти го съобщи?” Рече: “Съобщи ми го Всезнаещия, Сведущия.”",
            "verse 66:4": "И двете се покайте пред Аллах, защото сърцата ви са се подвели. Но ако си помагате срещу него, то Аллах е неговият Покровител, и Джибрил, и праведните вярващи, и ангелите освен това са [му] помощници.",
            "verse 66:5": "Ако той се разведе с вас, неговият Господ може да му дари в замяна съпруги, по-добри от вас, отдадени на Аллах, вярващи, покорни, разкайващи се, служещи [на Аллах], говеещи, омъжвани преди и девици.",
            "verse 66:6": "О, вярващи, пазете себе си и вашите семейства от Огъня, горивото на който са хората и камъните! Пазят го строги и сурови ангели, които не се противят на Аллах в Неговата повеля към тях и вършат, каквото им се повели.",
            "verse 66:7": "О, неверници, не се оправдавайте Днес! Ще ви се въздаде само за онова, което сте вършили.",
            "verse 66:8": "О, вярващи, покайте се пред Аллах с искрено покаяние и вашият Господ ще отмахне от вас прегрешенията, и ще ви въздаде в Градините, сред които реки текат - в Деня, в който Аллах не ще посрами Пророка и вярващите заедно с него. Светлината им ще се устремяв",
            "verse 66:9": "О, Пророче, бори се с неверниците и лицемерите, и бъди твърд с тях! Мястото им е Адът. И колко лоша е тази участ!",
            "verse 66:10": "Даде Аллах пример на неверниците с жената на Нух и жената на Лут. Те бяха омъжени за двама Наши праведни раби, но им измениха [във вярата] и с нищо не ги избавиха от Аллах [мъжете им], и бе речено: “Влезте в Огъня с влизащите!”",
            "verse 66:11": "И даде Аллах пример на вярващите с жената на Фараона, която рече: “Господи мой, построй ми при Теб дом в Градината и спаси ме от Фараона и от неговите дела, и спаси ме от хората-угнетители!”",
            "verse 66:12": "И с Мариам, дъщерята на Имран, която пазеше целомъдрието си, и вдъхнахме в нея от Своя дух. И повярва тя в Словата на своя Господ, и в Неговите писания, и бе от набожните."
        },
        "Chinese": {
            "verse 66:1": "先知啊！真主准许你享受的，你为什么加以禁戒，以便向你的妻子们讨好呢？真主是至赦的，是至慈的。",
            "verse 66:2": "真主确已为你们规定赎誓制，真主是你们的保佑者。他是全知的，是至睿的。",
            "verse 66:3": "当时，先知把一句话秘密地告欣他的一个妻子，她即转告了别人，而真主使先知知道他的秘密已被泄漏的时候，他使她认识一部分，而隐匿一部分。当他既以泄漏告诉她的时候，她说：谁报告你这件事的？他说：是全知的、彻知的主告诉我的。",
            "verse 66:4": "如果你们俩向真主悔罪，（那末，你们俩的悔罪是应当的），因为你们俩的心确已偏向了。如果你们俩一致对付他，那末，真主碓是他的保佑者，吉卜利里和行善的信士，也是他的保护者。此外，众天神是他的扶助者。",
            "verse 66:5": "如果他休了你们，他的主或许将以胜过你们的妻子补偿他，她们是顺主的，是信道，是服从的，是悔罪的，是拜主的，是持斋的，是再醮的和初婚的。",
            "verse 66:6": "信道的人们啊！你们当为自身和家属而预防那以人和石为燃料的火刑，主持火刑的，是许多残忍而严厉的天神，他们不违抗真主的命令，他们执行自己所奉的训令。",
            "verse 66:7": "不信道的人们啊！今日，你们不要托辞，你们只受自己行为的报酬。",
            "verse 66:8": "信道的人们啊！你们当向真主诚意悔罪，你们的主或许免除你们的罪恶，并且使你们入下临诸河的乐园。在那日，真主不凌辱先知，和与他一起信道的人们。他们的光明，将在他们的前面和右边奔驰，他们将说：我们的主啊！求你完成给我们的光明，求你赦宥我们。你对於万事是全能的。",
            "verse 66:9": "先知啊！你当与不信道的人们和伪信的人们奋斗，你当以严厉的态度对待他们。他们的归宿是火狱，那归宿真恶劣！",
            "verse 66:10": "真主以努哈的妻子和鲁特的妻子，为不信道的人们的殷鉴，她们俩曾在我的两个行善的仆人之下，而她们俩不忠於自己的丈夫，她们俩的丈夫，未能为她们俩抵御真主的一点刑罚。或者将说：你们俩与众人同入火狱吧！",
            "verse 66:11": "真主以法老的妻子，为信道的人们的模范。当时，她曾说：我的主啊！求你在你那里，为我建筑一所房子在乐园里。求你拯救我脱离法老，和他的罪行。求你拯救我脱离不义的民众。",
            "verse 66:12": "真主又以仪姆兰的女儿麦尔彦为信道的人们的模范，她曾保守贞操，但我以我的精神吹入她的身内，她信她的主的言辞和天经，她是一个服从的人。"
        },
        "Danish": {
            "verse 66:1": "O profeet, waarom verbiedt gij u hetgeen Allah voor u wettig heeft gemaakt? Zoekt gij het behagen uwer vrouwen? En Allah is Vergevensgezind, Genadevol",
            "verse 66:2": "Allah heeft de annulatie van uw eden voor u verplichtend gesteld en Allah is uw Beschermer en Hij is Alwetend, Alwijs",
            "verse 66:3": "Toen de profeet een woord aan een zijner vrouwen toevertrouwde en zij het daarna ruchtbaar maakte (aan een andere), deelde Allah hem dit mede. Hij maakte een deel er van bekend en verzweeg een deel ervan. En toen hij het haar vertelde, zeide zij: Wie gaf u hiervan kennis?  Hij zeide: De Alwetende, de van alles op de hoogte, heeft mij er bericht van gegeven",
            "verse 66:4": "Als gij beide (vrouwen) u tot Allah wendt en uw hart is reeds hiertoe geneigd (dan is het wel) - Maar indien gij samenspant tegen hem (de profeet), dan is Allah zeker zijn Beschermer, bovendien zijn Gabriël, de rechtvaardigen onder de gelovigen en de engelen zijn helpers",
            "verse 66:5": "Indien hij van u scheidt, is het mogelijk dat zijn Heer hem betere vrouwen dan u zal geven, die Moslim zijn en onderdanig, gelovig, gehoorzaam, berouwvol, vroom, gewend te vasten, weduwen of maagden",
            "verse 66:6": "O gij die gelooft, redt u zelf en uw gezinnen van het Vuur, welks brandstof mensen en stenen zijn, waarover engelen zijn, hard en streng, die Allah niet ongehoorzaam zijn in hetgeen Hij hun beveelt, en volvoeren wat hun wordt geboden",
            "verse 66:7": "O, gij ongelovigen, verontschuldigt u vandaag niet! U zal slechts vergolden worden voor hetgeen gij placht te doen",
            "verse 66:8": "O gij gelovigen, wendt u tot Allah in oprecht berouw. Het kan zijn dat uw Heer uw fouten van u zal verwijderen en u in tuinen toelaten waar doorheen rivieren stromen, op de Dag waarop Allah de profeet alsmede de gelovigen niet zal vernederen. Hun licht zal vóór hen en van hun rechter handen uitgaan. Zij zullen zeggen: Onze Heer, volmaak ons licht voor ons en vergeef ons; want Gij hebt macht over alle dingen",
            "verse 66:9": "O profeet, strijd tegen de ongelovigen en de huichelaars en wees streng tegen hen. Hun woning is de hel en dit is een kwade bestemming",
            "verse 66:10": "Allah vergelijkt de ongelovigen met de vrouw van Noach en met die van Lot. Zij behoorden aan twee Onzer rechtvaardige dienaren maar zij waren hun ontrouw. Daarom baatten haar echtgenoten haar niet tegen Allah, en er werd tot hen gezegd: Gaat het Vuur in tezamen met degenen die er binnengaan",
            "verse 66:11": "En Allah vergelijkt de gelovigen met de vrouw van Pharao toen zij zeide: Mijn Heer! bouw voor mij een huis bij U in het Paradijs, verlos mij van Pharao en zijn daden en verlos mij van het onrechtvaardige volk",
            "verse 66:12": "En met Maria, de dochter van Imraan, die haar kuisheid bewaarde; Toen ademden Wij haar Onze geest in - zij geloofde in het Woord van haar Heer en Zijn Boeken en behoorde tot de gehoorzamen"
        },
        "Dutch": {
            "verse 66:1": "O Profeet, waarom verbied iets wat Allah jou heeft toegestaan, om het welbehagen van jouw vrouwen te verkrijgen? En Allah is Vergevensgezind en Meest Barmhartig.",
            "verse 66:2": "Allah heeft jullie waarlijk verplicht om jullie eden toegestaan te maken. En Allah is jullie Meester. En Hij is de Alwetende, de Alwijze.",
            "verse 66:3": "En (gedenkt) toen de Boodschapper in het geheim een gebeurtenis aan één van zijn vrouwen toevertrouwde. En toen zij dit vertelde en Allah dit aan hem openbaar maakte, maakte hij er een gedeelte van bekend en liet een er gedeelte van onbesproken. Toen hij het haar vertelde, zei zij: \"Wie heeft jou dit verteld?\" Hij zei: \"De Kenner, de Alwetende, heeft mij op de hoogte gebracht.\"",
            "verse 66:4": "Als jullie beiden (Hafsah en Â'isjah) Allah berouw tonen (is dat beter voor jullie), dan neigen jullie harten waarlijk (naar het goede). Maar als jullie elkaar bijstaan tegen hem (de Boodschapper), dan is Allah waarlijk jouw Helper, en Djibrîl en de rechtschapen gelovigen en daarnaast de Engelen zullen helpers zijn.",
            "verse 66:5": "Het kan zijn dat wanneer hij van jullie (zijn echtgenotes) scheidt, dat zijn Heer aan hem betere echtgenotes in de plaats van jullie zal geven, die zich overgeven, die gelovend, gehoorzamend, berouwvol, aanbiddend en vastend zijn, die eerder getrouwd zijn geweest, of maagd zijn.",
            "verse 66:6": "O jullie die geloven, behoedt julliezelf en jullie gezinsleden voor de Hel, die als brandstof mensen en stenen heeft, waarover strenge en hard optredende Engelen zijn aangesteld, die Allah niet ongehoorzaam zijn in wat Hij hun beveelt, en die uitvoeren wat hun is bevolen.",
            "verse 66:7": "O jullie die ongelovig zijn, verontschuldigt jullie op die Dag niet: jullie worden slechts vergolden naar wat jullie hebben gedaan.",
            "verse 66:8": "O jullie die geloven, toont Allah oprecht berouw, hopelijk zal jullie Heer jullie zonden uitwissen en jullie Tuinen (het Paradijs) doen binnengaan waar de rivieren onder door stromen op de Dag waarop Allah de Profeet en degenen die met hem geloven niet zal vernederen. Hun licht straalt vóór hen en rechts van hen. Zij zeggen: \"Onze Heer, vervolmaak voor ons ons licht en vergeef ons: voorwaar, U bent Almachtig over alle zaken.\"",
            "verse 66:9": "O Profeet, bestrijd de ongelovigen en de huichelaars en treed hard tegen hen op. Hun bestemming is de Hel, en dat is de slechtste plaats van bestemming.",
            "verse 66:10": "Allah heeft degenen die niet geloven de vrouw van Nôeh en de vrouw van Lôeth als een voorbeeld gegeven. Zij waren onder de hoede van twee rechtschapenen van onder Onze dienaren, maar zij verraadden hen, toen baatten zij (Nôeh en Lôeth) hun in niets tegen Allah. En er werd tot hen (de beide vrouwen) gezegd: \"Treedt de hel binnen, tezamen met de binnentreders.\"",
            "verse 66:11": "En de gelovigen heeft Allah de vrouw van Fir'aun als voorbeeld gegeven, toen zij zei: \"Mijn Heer, bouw voor mij een huis aan Uw Zijde in het Paradijs, en red mij van Fir'aun en zijn deden en red mij van het onrechtvaardige volk.\"",
            "verse 66:12": "En (het voorbeeld van) Maryam, de dochter van Imrân, die haar eerbaarheid bewaard had, waarop Wij in haar van Onze geest bliezen en zij getuigde van de Waarheid van de Woorden van haar Heer en Zijn Schriften en zij behoorde tot de gehoorzamen."
        },
        "English": {
            "verse 66:1": "O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.",
            "verse 66:2": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.",
            "verse 66:3": "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\"",
            "verse 66:4": "If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.",
            "verse 66:5": "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.",
            "verse 66:6": "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.",
            "verse 66:7": "O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do.",
            "verse 66:8": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"",
            "verse 66:9": "O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.",
            "verse 66:10": "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\"",
            "verse 66:11": "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"",
            "verse 66:12": "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient."
        },
        "Filipino": {
            "verse 66:1": "o Propeta! Bakit mo ipinagbabawal (sa iyong sarili) ang ipinagkaloob sa iyo ni Allah na Kanyang pinahihintulutan, na ikaw ay naghahangad na maging maligaya ang iyong mga asawa? At si Allah ay Lagi nang Nagpapatawad, ang Pinakamaawain",
            "verse 66:2": "Si Allah ang nagtadhana sa inyo (o mga kalalakihan) na pawalang bisa ang inyong panata (pangako). At si Allah ang inyong Maula (Tagapagtanggol, Panginoon, atbp.), at Siya ang may Lubos na Karunungan, ang Pinakamaalam",
            "verse 66:3": "At (alalahanin) nang ang Propeta ay nagsiwalat ng bagay na dapat ingatan (at ilihim) sa isa sa kanyang mga asawa (si Hafsa), at ipinagtapat din naman (ng kanyang asawa sa iba pa, kay Aisha), at ginawa ni Allah na kanya itong mapag-alaman, at hinayaan niyang mapag-alaman 892 (ng kanyang asawa) ang bahagi nito at hindi niya isiniwalat ang ibang bahagi. At nang kanyang ipagtapat (sa kanyang asawang si Hafsa) ang mga ito, siya (Hafsa) ay nagsabi: “ Sino ang nagpahayag sa iyo ng mga ito? Siya (ang Propeta) ay nagsabi: “Siya (Allah) na Puspos ng Karunungan, ang Ganap na Nakakaalam, ang nagpahayag sa akin.”",
            "verse 66:4": "At kung kayong dalawa (na mga asawa ng Propeta, si Aisha at Hafsa) ay dumulog sa pagsisisi kay Allah (ito ay higit na mainam sa inyo), sapagkat ang inyong puso ay katotohanang nagnanais (na tutulan ang naiibigan ng Propeta), datapuwa’t kung kayo ay magtulungan sa isa’t-isa ng laban sa kanya (Muhammad), kung gayon, katotohanang si Allah ang kanyang Maula (Tagapagtanggol, Panginoon, Tagapangalaga, atbp.), at si Gabriel, at ang mga matutuwid sa lipon ng nananampalataya, at bukod pa rito, ang mga anghel ang kanyang kawaksi",
            "verse 66:5": "Maaaring mangyari na kung kayong (lahat) ay diborsiyuhin niya, ang kanyang Panginoon ay magkakaloob sa kanya sa halip ninyo, ng mga asawa na higit na mainam sa inyo, mga Muslim (na sumusuko kay Allah), na nananampalataya at matimtiman, na mapagsisi, na sumasamba ng buong kababaan at lumilikas (sa ibang lugar) tungo (sa Kapakanan ni Allah), at nag-aayuno maging balo man o dalaga",
            "verse 66:6": "o kayong nagsisisampalataya! Iadya ninyo ang inyong sarili at inyong mga kaanak sa Apoy (ng Impiyerno) na ang panggatong ay mga tao at bato, na rito ay nakatalaga ang mga anghel na malupit at mahigpit na hindi sumusuway sa pagsunod sa anumang pag-uutos na kanilang tinatanggap mula kay Allah, bagkus ay gumagawa ng ayon sa anumang sa kanila ay ipinag-uutos",
            "verse 66:7": "(At sa Kabilang Buhay ay ipagtuturing): “o kayong hindi nananampalataya (sa Kaisahan ni Allah at sa Islam)! Huwag kayong gumawa ng mga dahilan (ng pag-iwas) sa Araw na ito! Kayo ay binayaran lamang bilang kapalit ng inyong mga ginawa!”",
            "verse 66:8": "o kayong nagsisisampalataya! Magsibaling kayo kay Allah ng may matapat na pagsisisi! At umasam na ang inyong Panginoon ay magpapatawad sa inyo ng inyong kasalanan at Kanyang tatanggapin kayo sa Halamanan na sa ilalim nito ay may mga ilog na nagsisidaloy (Paraiso), sa Araw na si Allah ay hindi magpapahintulot na ang Propeta (Muhammad) ay hamakin, gayundin ang mga nananalig sa kanya. Ang kanilang Liwanag ay magsisitakbo sa kanilang harapan na kasama (ang kanilang Talaan, ang mga aklat ng gawa) sa kanilang kanang kamay, sila ay magsasabi: “Aming Panginoon! Inyong ganapin ang (aming) Liwanag sa amin (at huwag Ninyo itong patdin hanggang kami ay hindi nakakalampas sa Sirat [isang madulas na Tulay sa ibabaw ng Impiyerno] na ligtas) at ipagkaloob Ninyo sa amin ang Kapatawaran. Katotohanang Kayo ang may kapangyarihan sa lahat ng bagay",
            "verse 66:9": "o Propeta(Muhammad)! Magsumikapkangmaigilaban sa mga hindi sumasampalataya at sa mga mapagkunwari, at maging matatag laban sa kanila. Ang kanilang pananahanan ay Impiyerno. Katotohanang pagkasama-sama ng gayong hantungan",
            "verse 66:10": "Si Allah ay nagturing ng isang halimbawa sa mga hindi sumasampalataya, ang asawa ni Noe at asawa ni Lut. Sila ay kapwa nasa pagtangkilik ng Aming matutuwid na Tagapaglingkod, datapuwa’t sila ay hindi tapat sa kanilang asawa (sa dahilang tinututulan nila ang kanilang pagtuturo), kaya’t sila (Noe at Lut) ay walang napakinabang (sa kanilang ginawa sa harapan ni Allah), at sila (asawa ni Noe at Lut) ay pinagsabihan: “Magsipasok (kayo) sa Apoy na kasama nila na nagsisipasok.”",
            "verse 66:11": "At si Allah ay nagturing ng isang halimmbawa sa mga sumasampalataya, ang asawa ni Paraon, nang siya ay manikluhod: “Aking Panginoon! Inyong ipagtayo ako ng isang Tahanan sa Halamanan na malapit sa Inyo at ako ay Inyong iligtas kay Paraon at sa kanyang gawa, at Inyong iligtas ako sa mga tao na Zalimun (mga mapaggawa ng kasamaan, mapagsamba sa mga diyus-diyosan, walang pananalig kay Allah)",
            "verse 66:12": "At si Maria, na anak na babae ni Imran na nangangalaga sa kanyang kalinisan (sa kapurihan); at Aming hiningahan (ang manggas ng kanyang damit) sa pamamagitan ng Aming ruh (alalaong baga, si Gabriel), at siya ay nagpatotoo sa katotohanan ng mga Salita ng kanyang Panginoon (alalaong baga, ang pagsampalataya sa Salita ni Allah: “Mangyari nga!”, ito si Hesus na anak ni Maria, bilang isang Tagapagbalita ni Allah), at gayundin (ang pagsampalataya) sa kanyang mga Kasulatan, siya ay isa sa mga Qanitin (matimtimang tagapaglingkod)"
        },
        "French": {
            "verse 66:1": "O Prophète! Pourquoi, en recherchant l'agrément de tes femmes, t'interdis-tu ce qu'Allah t'a rendu licite? Et Allah est Pardonneur, Très Miséricordieux.",
            "verse 66:2": "Allah vous a prescrit certes, de vous libérer de vos serments. Allah est votre Maître; et c'est Lui l'Omniscient, le Sage.",
            "verse 66:3": "Lorsque le Prophète confia un secret à l'une de ses épouses et qu'elle l'eut divulgué et qu'Allah l'en eut informé, celui-ci en fit connaître une partie et passa sur une partie. Puis, quand il l'en eut informée elle dit: «Qui t'en a donné nouvelle?» Il dit: «C'est l'Omniscient, le Parfaitement Connaisseur qui m'en a avisé».",
            "verse 66:4": "Si vous vous repentez à Allah c'est que vos cœurs ont fléchi. Mais si vous vous soutenez l'une l'autre contre le Prophète, alors ses alliés seront Allah, Gabriel et les vertueux d'entre les croyants, et les Anges sont par surcroît [son] soutien.",
            "verse 66:5": "S'Il vous répudie, il se peut que son Seigneur lui donne en échange des épouses meilleures que vous, musulmanes, croyantes, obéissantes, repentantes, adoratrices, jeûneuses, déjà mariées ou vierges.",
            "verse 66:6": "O vous qui avez cru! Préservez vos personnes et vos familles, d'un Feu dont le combustible sera les gens et les pierres, surveillé par des Anges rudes, durs, ne désobéissant jamais à Allah en ce qu'Il leur commande, et faisant strictement ce qu'on leur ordonne.",
            "verse 66:7": "O vous qui avez mécru! Ne vous excusez pas aujourd'hui. Vous ne serez rétribués que selon ce que vous œuvriez.",
            "verse 66:8": "O vous qui avez cru! Repentez-vous à Allah d'un repentir sincère. Il se peut que votre Seigneur vous efface vos fautes et qu'Il vous fasse entrer dans des Jardins sous lesquels coulent les ruisseaux, le jour où Allah épargnera l'ignominie au Prophète et à ceux qui croient avec lui. Leur lumière courra devant eux et à leur droite; ils diront: «Seigneur, parfais-nous notre lumière et pardonne-nous. Car Tu es Omnipotent».",
            "verse 66:9": "O Prophète! Mène la lutte contre les mécréants et les hypocrites et sois rude à leur égard. Leur refuge sera l'Enfer, et quelle mauvaise destination!",
            "verse 66:10": "Allah a cité en parabole pour ceux qui ont mécru la femme de Noé et la femme de Lot. Elles étaient sous l'autorité de deux vertueux de Nos serviteurs. Toutes deux les trahirent et ils ne furent d'aucune aide pour [ces deux femmes] vis-à-vis d'Allah. Et il [leur] fut dit: «Entrez au Feu toutes les deux, avec ceux qui y entrent»,",
            "verse 66:11": "et Allah a cité en parabole pour ceux qui croient, la femme de Pharaon, quand elle dit «Seigneur, construis-moi auprès de Toi une maison dans le Paradis, et sauve-moi de Pharaon et de son œuvre; et sauve-moi des gens injustes».",
            "verse 66:12": "De même, Marie, la fille d''Imran qui avait préservé sa virginité; Nous y insufflâmes alors de Notre Esprit. Elle avait déclaré véridiques les paroles de son Seigneur ainsi que Ses Livres: elle fut parmi les dévoués."
        },
        "Fulah": {
            "verse 66:1": "Eehey ma annabi ko taki ana harmina ko Alla dagnan ma sabu ɗaɓɓude welnaade suddiiɓe ma, Alla ko jaafatooɗo jurmotooɗo",
            "verse 66:2": "Alla farlii e mon dagtinde goondooje mon Alla ko keedo mon ko kanko woni ganndo Ñeeñƴudo",
            "verse 66:3": "Tuma nde annabi deeyi faade e yogo e suddiiɓe makko yeewtere, nde o habri yeewtere nde, Alla feññinani mbo O anndini yogo e yeewtere he, O falii heen yogo, nde O habri mbo ɗum o wi*i hombo habru ma ɗum O maaki habrii kam Gannda Kumpatiiɗo",
            "verse 66:4": "Si on tuubi faade e Alla sabu ɓerɗe mon ɗe ooñinooma si on wallandirii e dow makko, ko Alla woni ballo makko e jIbriil e goonɗinɓe moƴƴuɓe e Malayka en caggal ɗum koɗi ballooji",
            "verse 66:5": "Yaama de joom makko si O ceeriiɓe nde O wostantoo mbo ɓurɓe mon moƴƴude juulɓe goonɗinɓe ɗoftiiɓe tuubooɓe rewooɓe Alla hoorooɓe Seemedɓe e boomi",
            "verse 66:6": "Eehey mon goonɗinɓe ndeene ko*e mon e koreeji mon e yiite docate mannge ko yimɓe e kaaƴe ina e dow henge malaykaaji tekkuɗi cattuɗi ɗi ngoopatah ko Alla yamariɗi te hoɗi ngolla ko Alla yamiriɗi",
            "verse 66:7": "Eehey mon heeferɓe wote ngantinee hannde njoɓeteɗon tan koko ngollatna ɗon",
            "verse 66:8": "Eehey mon goonɗinɓe tuubee faade e Alla tuubgol laaɓngol yaama joomi mon hafrana on bonɗi mon O naatna mon aljannaaji na ila ley majji caatli, ñande Alla hoynatah annabi e ɓeen goonɗinɓe wondude e mum, annoore mum en na yaha yeesa mum en e ñaama mum en hoɓe mbiya joomi amen timminan amen annoore amen yaafa min pellet ko a kattanɗo kala huunde. @Corrected",
            "verse 66:9": "Ko an yo Annabiijo, haɓ e heeferɓe ɓen e naafiqiiɓe ɓen, saɗtinanaa ɓe; weerde maɓɓe nden ko Jahannama, nge bonii ruttorde",
            "verse 66:10": "Alla fiyani misal wonande ɓeen yedduɓe soknaaja Nuuhu e luutu ɓe ngoniina e les jiyaaɓe amen ɗiɗo moƴƴuɓe ɓe njanfiiɓe ɗuum nafaaniɓe ka Alla hay huunde,ɓe wi*e naatee yiite wondude e naatɓe ɓe",
            "verse 66:11": "Alla fiyani misal goonɗinɓe ɓe debbo fir*awna nde o wiino joom am mahanam ka Ma suudu ka aljanna ndaɗndaa mi e fir*awna e golle mum, daɗndam e yimɓe tooñooɓe",
            "verse 66:12": "E Maryama ɓiy imraana oon reeni hoore makko e jina Min ngutti heen ruuhu amen o goonɗini konngi joomiiko e defte Makko o tawa e ɗoftiiɓe ɓe"
        },
        "German": {
            "verse 66:1": "O Prophet, warum verbietest du, was Allah dir erlaubt hat, indem du da nach trachtest, die Zufriedenheit deiner Gattinnen zu erlangen? Und Allah ist Allvergebend und Barmherzig.",
            "verse 66:2": "Allah hat ja für euch festgelegt, womit eure Eide zu lösen sind. Und Allah ist euer Schutzherr, und Er ist der Allwissende und Allweise.",
            "verse 66:3": "Als der Prophet einer seiner Gattinnen eine Mitteilung im geheimen anvertraute. Als sie sie dann kundtat und Allah es ihm offen darlegte, gab er (ihr) einen Teil davon bekannt und überging einen (anderen) Teil. Als er es ihr nun kundtat, sagte sie: \"Wer hat dir das mitgeteilt?\" Er sagte: \"Kundgetan hat (es) mir der Allwissende und Allkundige.\"",
            "verse 66:4": "Wenn ihr beide euch in Reue zu Allah umkehrt - so werden eure Herzen sich ja (der Aufrichtigkeit) zuneigen - ... Und wenn ihr einander gegen ihn beisteht, so ist Allah sein Schutzherr; und Gibril, die Rechtschaffenen von den Gläubigen, und die Engel werden darüber hinaus (ihm) Beistand sein.",
            "verse 66:5": "Vielleicht wird sein Herr ihm, wenn er sich von euch (allen) scheidet, zum Tausch (andere) Gattinnen geben, (die) besser (sind) als ihr: muslimische, gläubige, demütig ergebene, in Reue umkehrende, (Allah) dienende und umherziehende, früher verheiratete oder Jungfrauen.",
            "verse 66:6": "O die ihr glaubt, bewahrt euch selbst und eure Angehörigen vor einem Feuer, dessen Brennstoff Menschen und Steine sind, über das hartherzige, strenge Engel (gesetzt) sind, die sich Allah nicht widersetzen in dem, was Er ihnen befiehlt, sondern tun, was ihnen befohlen wird.",
            "verse 66:7": "O die ihr ungläubig seid, entschuldigt euch heute nicht. Euch wird nur das vergolten, was ihr zu tun pflegtet.",
            "verse 66:8": "O die ihr glaubt, kehrt zu Allah um in aufrichtiger Reue; vielleicht wird euer Herr euch eure bösen Taten tilgen und euch in Gärten eingehen lassen, durcheilt von Bächen, am Tag, da Allah den Propheten und diejenigen, die mit ihm geglaubt haben, nicht in Schande stürzen wird. Ihr Licht eilt ihnen voraus und (ebenso) zu ihrer Rechten. Sie werden sagen: \"Unser Herr, vollende für uns unser Licht und vergib uns. Gewiß, Du hast zu allem die Macht.\"",
            "verse 66:9": "O Prophet, mühe dich gegen die Ungläubigen und die Heuchler ab und sei hart gegen sie. Ihr Zufluchtsort wird die Hölle sein - ein schlimmer Ausgang!",
            "verse 66:10": "Allah hat als Gleichnis für diejenigen, die ungläubig sind, dasjenige von Nuhs Frau und Luts Frau geprägt. Sie beide unterstanden zwei rechtschaffenen (Dienern) von Unseren Dienern, doch handelten sie verräterisch an ihnen, und so haben ihnen diese vor Allah nichts genützt. Und es wurde gesagt: \"Geht beide ins (Höllen)feuer ein mit denjenigen, die hineingehen.\"",
            "verse 66:11": "Und Allah hat als Gleichnis für diejenigen, die glauben, dasjenige von Fir'auns Frau geprägt. Als sie sagte: \"Mein Herr, baue mir bei Dir ein Haus im (Paradies)garten, und errette mich von Fir'aun und seinem Werk, und errette mich von dem Volk der Ungerechten.\"",
            "verse 66:12": "Und (auch von) Maryam, 'Imrans Tochter, die ihre Scham unter Schutz stellte, worauf Wir in sie von Unserem Geist einhauchten. Und sie hielt die Worte ihres Herrn und Seine Bücher für wahr und gehörte zu den (Allah) demütig Ergebenen."
        },
        "Hausa": {
            "verse 66:1": "Yã kai Annabi! Don me kake haramta abin da Allah Ya halatta maka, kanã nẽman yardar mãtanka, alhãli kuwa Allah Mai gãfara ne, Mai jin ƙai.",
            "verse 66:2": "Haƙĩƙa Allah ya faralta muku warware rantsuwõyinku, kuma Allah ne Mataimakinku kuma shĩ ne Masani, Mai hikima.",
            "verse 66:3": "Kuma a sã'ilin da Annabi ya asirta wani lãbãri zuwa ga sãshen mãtansa, to, a lõkacin da ta bã da lãbari da shi. Kuma Allah Ya bayyana shi a gare shi, ya sanar da sãshensa kuma ya kau da kai daga wani sãshe. To, a lõkacin da ya bã ta lãbãri da shi, ta ce: \"Wãne ne ya gaya maka wannan?\" Ya ce: \"Masani, Mai labartãwa, Ya gaya mini.\"",
            "verse 66:4": "Idan kũ biyu kuka tũba zuwa ga Allah, to, haƙĩƙa zukãtanku sun karkata. Kuma idan kun taimaki jũna a kansa to, lalle Allah Shĩ ne Mataimakinsa, da Jibrĩlu da sãlihan mũminai. Kuma malã'iku a bãyan wancan, mataimaka ne.",
            "verse 66:5": "Mai yiwuwa ne Ubangijinsa, idan ya sake ku, Ya musanya masa waɗansu mãtan aure mafiya alhẽri daga gare ku, Musulmai mũminai mãsu tawãli'u, mãsu tũba, mãsu ibãda, mãsu, azumi, zawarõri da 'yammãta.",
            "verse 66:6": "Yã kũ waɗanda suka yi ĩmãni! Ku kãre wa kanku (da iyãlinku wata wuta makãmashinta mutãne da duwãtsu ne. A kanta akwai waɗansu malã'iku mãsu kauri, mãsu ƙarfi. Bã su sãɓã wa Allah ga abin da Ya umurce su, kuma sunã aikata abin da ake umunin su.",
            "verse 66:7": "Yã kũ waɗanda suka kãfirta! Kada ku kãwo wani uzuri a yau. Anã yi muku sakamakon abin da kuka kasance kunã aikatãwa kawai ne.",
            "verse 66:8": "Yã kũ waɗanda suka yi ĩmãni! Ku kõma zuwa ga Allah kõmawar gaskiya. Mai yiwuwa Ubangjinku Ya kankare muku miyãgun ayyukanku kuma Ya shigar da ku a gidãjen Aljanna, ƙoramu na gudãna daga ƙarƙashinsu a rãnar da Allah bã Ya kunyatar da Annabi da wadanda suka yi ĩmãni tãre da shi. Haskensu yanã tafiya a gaba gare su da jihõhin dãmansu, sunã cẽwa, \"Yã Ubangijiumu! Ka cika mana haskenmu, kuma Ka yi mana gãfara. Lalle Kai, a kan dukkan kõme, Yã kai Mai ikon yi ne.\"",
            "verse 66:9": "Yã kai Annabi! Ka yãki kãfirai da munãfwkai. Kuma ka tsananta a kansu. Kuma matattararsu Jahannama ce, kuma tir da makoma, ita.",
            "verse 66:10": "Allah Ya buga wani misãli dõmin waɗanda suka kãfirta: mãtar Nũhu da mãtar Lũɗu, sun kasance a ƙarƙashin wasu bãyi biyu daga bãyinMu sãlihai, saisuka yaudare su, sabõda haka ba su wadãtar musu da kõme daga Allah ba. Kuma aka ce: \"Ku shiga, kũ biyu, wutã tãre da mãsu shiga.\"",
            "verse 66:11": "Kuma Allah Ya buga wani misãli dõmin waɗanda suka yi ĩmãni; matar Fir'auna, sa'ad da ta ce \"Ya Ubangiji! Ka gina mini wani gida a wurinKa a cikin Aljanna. Kuma Ka tsĩrar da ni daga Fir'auna da aikinsa. Kuma Ka tsĩrar da ni daga mutãnen nan azzãlumai.\"",
            "verse 66:12": "Da Maryama ɗiyar Imrãna wadda ta tsare farjinta, sai Muka hũra a cikinsa daga rũhinMu. Kuma ta gaskata game da ãyõyin Ubangijinta da LittattafanSa alhãli kuwa ta kasance daga mãsu tawãli'u."
        },
        "Hindi": {
            "verse 66:1": "ऐ रसूल जो चीज़ ख़ुदा ने तुम्हारे लिए हलाल की है तुम उससे अपनी बीवियों की ख़ुशनूदी के लिए क्यों किनारा कशी करो और ख़ुदा तो बड़ा बख्शने वाला मेहरबान है",
            "verse 66:2": "ख़ुदा ने तुम लोगों के लिए क़समों को तोड़ डालने का कफ्फ़ार मुक़र्रर कर दिया है और ख़ुदा ही तुम्हारा कारसाज़ है और वही वाक़िफ़कार हिकमत वाला है",
            "verse 66:3": "और जब पैग़म्बर ने अपनी बाज़ बीवी (हफ़सा) से चुपके से कोई बात कही फिर जब उसने (बावजूद मुमानियत) उस बात की (आयशा को) ख़बर दे दी और ख़ुदा ने इस अम्र को रसूल पर ज़ाहिर कर दिया तो रसूल ने (आयशा को) बाज़ बात (किस्सा मारिया) जता दी और बाज़ बात (किस्साए यहद) टाल दी ग़रज़ जब रसूल ने इस वाक़िये (हफ़सा के अफ़शाए राज़) कि उस (आयशा) को ख़बर दी तो हैरत से बोल उठीं आपको इस बात (अफ़शाए राज़) की किसने ख़बर दी रसूल ने कहा मुझे बड़े वाक़िफ़कार ख़बरदार (ख़ुदा) ने बता दिया",
            "verse 66:4": "(तो ऐ हफ़सा व आयशा) अगर तुम दोनों (इस हरकत से) तौबा करो तो ख़ैर क्योंकि तुम दोनों के दिल टेढ़े हैं और अगर तुम दोनों रसूल की मुख़ालेफ़त में एक दूसरे की अयानत करती रहोगी तो कुछ परवा नहीं (क्यों कि) ख़ुदा और जिबरील और तमाम ईमानदारों में नेक शख़्श उनके मददगार हैं और उनके अलावा कुल फरिश्ते मददगार हैं",
            "verse 66:5": "अगर रसूल तुम लोगों को तलाक़ दे दे तो अनक़रीब ही उनका परवरदिगार तुम्हारे बदले उनको तुमसे अच्छी बीवियाँ अता करे जो फ़रमाबरदार ईमानदार ख़ुदा रसूल की मुतीय (गुनाहों से) तौबा करने वालियाँ इबादत गुज़ार रोज़ा रखने वालियाँ ब्याही हुई",
            "verse 66:6": "और बिन ब्याही कुंवारियाँ हो ऐ ईमानदारों अपने आपको और अपने लड़के बालों को (जहन्नुम की) आग से बचाओ जिसके इंधन आदमी और पत्थर होंगे उन पर वह तन्दख़ू सख्त मिजाज़ फ़रिश्ते (मुक़र्रर) हैं कि ख़ुदा जिस बात का हुक्म देता है उसकी नाफरमानी नहीं करते और जो हुक्म उन्हें मिलता है उसे बजा लाते हैं",
            "verse 66:7": "(जब कुफ्फ़ार दोज़ख़ के सामने आएँगे तो कहा जाएगा) काफ़िरों आज बहाने न ढूँढो जो कुछ तुम करते थे तुम्हें उसकी सज़ा दी जाएगी",
            "verse 66:8": "ऐ ईमानदारों ख़ुदा की बारगाह में साफ़ ख़ालिस दिल से तौबा करो तो (उसकी वजह से) उम्मीद है कि तुम्हारा परवरदिगार तुमसे तुम्हारे गुनाह दूर कर दे और तुमको (बेहिश्त के) उन बाग़ों में दाखिल करे जिनके नीचे नहरें जारी हैं उस दिन जब ख़ुदा रसूल को और उन लोगों को जो उनके साथ ईमान लाए हैं रूसवा नहीं करेगा (बल्कि) उनका नूर उनके आगे आगे और उनके दाहिने तरफ़ (रौशनी करता) चल रहा होगा और ये लोग ये दुआ करते होंगे परवरदिगार हमारे लिए हमारा नूर पूरा कर और हमें बख्य दे बेशक तू हर चीज़ पर कादिर है",
            "verse 66:9": "ऐ रसूल काफ़िरों और मुनाफ़िकों से जेहाद करो और उन पर सख्ती करो और उनका ठिकाना जहन्नुम है और वह क्या बुरा ठिकाना है",
            "verse 66:10": "ख़ुदा ने काफिरों (की इबरत) के वास्ते नूह की बीवी (वाएला) और लूत की बीवी (वाहेला) की मसल बयान की है कि ये दोनो हमारे बन्दों के तसर्रुफ़ थीं तो दोनों ने अपने शौहरों से दगा की तो उनके शौहर ख़ुदा के मुक़ाबले में उनके कुछ भी काम न आए और उनको हुक्म दिया गया कि और जाने वालों के साथ जहन्नुम में तुम दोनों भी दाखिल हो जाओ",
            "verse 66:11": "और ख़ुदा ने मोमिनीन (की तसल्ली) के लिए फिरऔन की बीवी (आसिया) की मिसाल बयान फ़रमायी है कि जब उसने दुआ की परवरदिगार मेरे लिए अपने यहाँ बेहिश्त में एक घर बना और मुझे फिरऔन और उसकी कारस्तानी से नजात दे और मुझे ज़ालिम लोगो (के हाथ) से छुटकारा अता फ़रमा",
            "verse 66:12": "और (दूसरी मिसाल) इमरान की बेटी मरियम जिसने अपनी शर्मगाह को महफूज़ रखा तो हमने उसमें रूह फूंक दी और उसने अपने परवरदिगार की बातों और उसकी किताबों की तस्दीक़ की और फरमाबरदारों में थी"
        },
        "Indonesian": {
            "verse 66:1": "Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu; kamu mencari kesenangan hati isteri-isterimu? Dan Allah Maha Pengampun lagi Maha Penyayang",
            "verse 66:2": "Sesungguhnya Allah telah mewajibkan kepadamu sekalian membebaskan diri dari sumpahmu dan Allah adalah Pelindungmu dan Dia Maha Mengetahui lagi Maha Bijaksana.",
            "verse 66:3": "Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang isterinya (Hafsah) suatu peristiwa. Maka tatkala (Hafsah) menceritakan peristiwa itu (kepada Aisyah) dan Allah memberitahukan hal itu (pembicaraan Hafsah dan Aisyah) kepada Muhammad lalu Muhammad memberitahukan sebagian (yang diberitakan Allah kepadanya) dan menyembunyikan sebagian yang lain (kepada Hafsah). Maka tatkala (Muhammad) memberitahukan pembicaraan (antara Hafsah dan Aisyah) lalu (Hafsah) bertanya: \"Siapakah yang telah memberitahukan hal ini kepadamu?\" Nabi menjawab: \"Telah diberitahukan kepadaku oleh Allah yang Maha Mengetahui lagi Maha Mengenal\".",
            "verse 66:4": "Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan); dan jika kamu berdua bantu-membantu menyusahkan Nabi, maka sesungguhnya Allah adalah Pelindungnya dan (begitu pula) Jibril dan orang-orang mukmin yang baik; dan selain dari itu malaikat-malaikat adalah penolongnya pula.",
            "verse 66:5": "Jika Nabi menceraikan kamu, boleh jadi Tuhannya akan memberi ganti kepadanya dengan isteri yang lebih baik daripada kamu, yang patuh, yang beriman, yang taat, yang bertaubat, yang mengerjakan ibadat, yang berpuasa, yang janda dan yang perawan.",
            "verse 66:6": "Hai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, keras, dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.",
            "verse 66:7": "Hai orang-orang kafir, janganlah kamu mengemukakan uzur pada hari ini. Sesungguhnya kamu hanya diberi balasan menurut apa yang kamu kerjakan.",
            "verse 66:8": "Hai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubatan nasuhaa (taubat yang semurni-murninya). Mudah-mudahan Rabbmu akan menutupi kesalahan-kesalahanmu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai, pada hari ketika Allah tidak menghinakan Nabi dan orang-orang mukmin yang bersama dia; sedang cahaya mereka memancar di hadapan dan di sebelah kanan mereka, sambil mereka mengatakan: \"Ya Rabb kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; Sesungguhnya Engkau Maha Kuasa atas segala sesuatu\".",
            "verse 66:9": "Hai Nabi, perangilah orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka. Tempat mereka adalah jahannam dan itu adalah seburuk-buruknya tempat kembali.",
            "verse 66:10": "Allah membuat isteri Nuh dan isteri Luth sebagai perumpamaan bagi orang-orang kafir. Keduanya berada di bawah pengawasan dua orang hamba yang saleh di antara hamba-hamba Kami; lalu kedua isteri itu berkhianat kepada suaminya (masing-masing), maka suaminya itu tiada dapat membantu mereka sedikitpun dari (siksa) Allah; dan dikatakan (kepada keduanya): \"Masuklah ke dalam jahannam bersama orang-orang yang masuk (jahannam)\".",
            "verse 66:11": "Dan Allah membuat isteri Fir'aun perumpamaan bagi orang-orang yang beriman, ketika ia berkata: \"Ya Rabbku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam firdaus, dan selamatkanlah aku dari Fir'aun dan perbuatannya, dan selamatkanlah aku dari kaum yang zhalim.",
            "verse 66:12": "dan (ingatlah) Maryam binti Imran yang memelihara kehormatannya, maka Kami tiupkan ke dalam rahimnya sebagian dari ruh (ciptaan) Kami, dan dia membenarkan kalimat Rabbnya dan Kitab-Kitab-Nya, dan dia adalah termasuk orang-orang yang taat."
        },
        "Italian": {
            "verse 66:1": "O Profeta, perché, cercando di compiacere le tue spose, ti interdici quello che Allah ti ha permesso ? Allah è perdonatore, misericordioso.",
            "verse 66:2": "Eppure Allah vi ha prescritto un modo per sciogliere i vostri giuramenti. Allah è il vostro Padrone, Egli è il Sapiente, il Saggio.",
            "verse 66:3": "Quando il Profeta confidò un segreto ad una delle sue spose, e questa lo andò a riferire [ad un'altra], Allah lo informò [ed egli] ne confermò una parte tenendone nascosta un'altra. Quando le chiese conto della sua indiscrezione, ella disse: “Chi te ne ha dato notizia?”. Rispose: “Il Sapiente, il Ben informato me ne ha dato notizia”.",
            "verse 66:4": "Se entrambe ritornerete ad Allah, è segno che i vostri cuori si sono pentiti; se invece vi sosterrete a vicenda contro il Profeta, [sappiate] allora che il suo Padrone è Allah e che Gabriele e i devoti tra i credenti e gli angeli saranno il suo sostegno.",
            "verse 66:5": "Se vi ripudiasse, certamente il suo Signore vi sostituirebbe con delle spose migliori di voi, sottomesse ad Allah, credenti, devote, penitenti, adoranti, osservanti il digiuno, già sposate [in precedenza] o vergini.",
            "verse 66:6": "O credenti, preservate voi stessi e le vostre famiglie, da un fuoco il cui combustibile saranno uomini e pietre e sul quale vegliano angeli formidabili, severi, che non disobbediscono a ciò che Allah comanda loro e che eseguono quello che viene loro ordinato.",
            "verse 66:7": "O credenti, non chiedete scusa oggi, sarete compensati solo per quel che avrete fatto.",
            "verse 66:8": "O credenti, pentitevi davanti ad Allah d'un pentimento sincero. Forse il vostro Signore cancellerà i vostri peccati e vi introdurrà nei Giardini in cui scorrono i ruscelli, nel Giorno in cui non imporrà umiliazione alcuna al Profeta e a coloro che avranno creduto insieme con lui. La loro luce correrà innanzi a loro e sulla loro destra ed essi diranno: “Signore, completa la nostra luce e perdonaci. In verità tu sei l'Onnipotente”.",
            "verse 66:9": "O Profeta, combatti i miscredenti e gli ipocriti e sii severo nei loro confronti. Il loro asilo sarà l'Inferno, qual triste rifugio!",
            "verse 66:10": "Allah ha proposto ai miscredenti l'esempio della moglie di Noè e della moglie di Lot. Entrambe sottostavano a due dei Nostri servi, uomini giusti. Entrambe li tradirono, ed essi non poterono in alcun modo porle al riparo da Allah. Fu detto loro: “Entrate entrambe nel Fuoco, insieme con coloro che vi entrano”.",
            "verse 66:11": "Allah ha proposto ai credenti l'esempio della moglie di Faraone, quando invocò: “Signore, costruiscimi vicino a Te una casa nel Giardino. Salvami da Faraone e dalle sue opere sue. Salvami dagli ingiusti”.",
            "verse 66:12": "E Maria, figlia di Imrân, che conservò la sua verginità; insufflammo in lei del Nostro Spirito. Attestò la veridicità delle Parole del suo Signore e dei Suoi Libri e fu una delle devote."
        },
        "Japanese": {
            "verse 66:1": "預言者よ，アッラーがあなたのために合法とされていることを（アッラーの御好意を求めるためではなく）只あなたの妻たちの御機嫌をとる目的だけで何故自ら禁止するのか。本当にアッラーは寛容にして慈悲深くあられる。",
            "verse 66:2": "（人びとよ）アッラーは，あなたがたのために誓いを解消するよう既に御達しがあった。アッラーはあなたがたの守護者であり，全知にして英明であられる。",
            "verse 66:3": "預言者が妻の一人（ハフサ）にある秘密を打ち明けた時，かの女（ハフサ）はそれを（アーイシャに）口外したので，アッラーはそのこと（秘密を漏したこと）をかれに知らせた。かれはその一部分を（ハフサに）話し，一部分は伏せて置いた。それでかれが，かの女（ハフサ）にそれを告げると，かの女は，「誰があなたにそれを告げましたか。」と言った。かれは（答えて）言った。「何もかも御存知の御方が，わたしに告げられました。」",
            "verse 66:4": "もし梅悟してアッラーに帰るならば，あなたがた2人の心は，善いほうに傾く。もし共謀してかれに反抗するならば，アッラーはかれの守護者であられ，またジブリールや，正しい信者たち，更に天使たちも皆（かれの）支持者である。",
            "verse 66:5": "かれが，もしあなたがたを離婚したならば，かれはあなたがたに優る妻たちを，代りにかれに授けられるであろう。アッラーに服従，帰依し，信心深く誠実で，悔悟して（不断に主に）返り，（謙虚に）礼拝を捧げ，進んで事に当たり斎戒する者で，既婚者もあり処女もあろう。",
            "verse 66:6": "あなたがた信仰する者よ，人間と石を燃料とする火獄からあなたがた自身とあなたがたの家族を守れ。そこには厳格で痛烈な天使たちが（任命されて）いて，かれらはアッラーの命じられたことに違犯せず，言い付けられたことを実行する。",
            "verse 66:7": "（かれらは言われるであろう。）あなたがた不信心の者よ，今日は，弁解してはならない。あなたがたは，只あなたがたが行ったことに対して報いられるだけである。",
            "verse 66:8": "あなたがた信仰する者よ，謙虚に悔悟してアッラーに帰れ。恐らく主は，あなたがたの様々な悪を払い，川が下を流れる楽園に入らせるであろう。その日アッラーは，預言者やかれに従って信じる者たちを，辱しめはしない。かれらの光は，その前方または右方だ閃こう。かれらは（祈って）言うであろう。「主よ，わたしたちのために，光を完全になされ，わたしたちを御赦し下さい。あなたは凡てのことに全能であられます。」",
            "verse 66:9": "預言者よ，不信者と偽信者にたいし，奮闘努力しなさい。またかれらに対し強硬であれ。かれらの住まいは地獄である。何と悪い帰り所であることよ。",
            "verse 66:10": "アッラーは不信者のために実例を示される。ヌーフの妻，そしてルートの妻である。かれら両人は，2人の正しいわがしもべの許にいた。かの女たちは，かれら（夫）にたいして不誠実で，アッラーの御許で何ら得るところはなかった。そして「あなたがた2人は（外の）入る者と一緒に火獄に入れ。」と告げられた。",
            "verse 66:11": "またアッラーは，信仰する者のために例を示される。フィルアウンの妻である。かの女がこう言った時を思い起しなさい。「主よ，楽園の中のあなたの御側に，わたしのため家を御建て下さい。そしてフィルアウンとその行いから，わたしを救い，不義を行う者から，わたしを御救い下さい。」",
            "verse 66:12": "またわれは自分の貞節を守ったイムラーンの娘マルヤム（の体内）に，わが霊を吹き込んだ。かの女は，主の御言葉とその啓典を実証する，敬炭な（しもべの）一人であった。"
        },
        "Jawa": {
            "verse 66:1": "O, Nabi! yagene sira anglarangi barang kang wis diwenangke dening Allah marang sira mung murih leganing atine para rabinira wae, Allah iku kepareng ngapura tur maha asih",
            "verse 66:2": "Allah wis nindakake udare supatanira (sumpah nglarang ngombe madu kanggo nyenengake garwa - garwane nabi sarana bayar kaffarah yaiku merdekakake kawula) Allah iku Pangayomira, Allah iku nguningani tur wicaksana",
            "verse 66:3": "Lan nalika Nabi kelawan sideman aweh warta marang saweneh garwane (Hafsah) ananging bareng (Hafsah) amartakake kadadeyan mau (marang aisyah) sarta Allah paring weruh perkara iku marang panjenengane (nabi Muhammad) panjenengane paring weruh prakara mau (antarane Hafsah lan Aisyah) dheweke (Hafsah) matur, \"Sinten ingkang amartosaken prakawis punika dhateng panjenengan?\" Pangandikane (Nabi), \"Ingkang Maha Wikan Ingkang Waspada kang martani aku",
            "verse 66:4": "Manawa sira sakaro (Hafsah lan Aisyah) padha taubat marang Allah, lan sayekti atinira wis tumiyung (mrono) lan manawa sira sakaro saiyeg bantu binantu lumawan panjenengane (Muhammad) sayekti Allah iku Pangayome, awit Allah lan Jibril apadenen para Mukmin kang becik padha nulungi Rasulullah sawise iku, para Malaikat uga padha nulungi",
            "verse 66:5": "Upama kelakon panjenengane (Muhammad) megat ing sira kabeh, bakal aparing leliru garwa kang luwih becik ngungkuli sira (yaiku) wong wadon Islam, percaya ing Allah, sumungkem/mituhu, ahli mratobat, bekti, dhemen poso, rondho tuwin prawan",
            "verse 66:6": "Para mukmin! sira jagaa awakira lan para warganira aja nganti kecemplung ing neraka, kang urub - urube manungsa lan watu, kang jaga para Malaikat gedhe dhuwur gagah prakosa, ora tau nglirwakake parentahe Allah padha ngelakoni sabarang dhawuhing Allah",
            "verse 66:7": "Para kafir: Ing dina qiyamat iku sira aja nganggo madoni mratelakake sebab - sebab anggonira padha ngelakoni duraka, anane sira disiksa, mung wewalese pihala kang wis padha sira lakoni",
            "verse 66:8": "Para mukmin! Padha tobata ing Allah kang temen. Allah muga ngapuraha lan muwunga halanira, muga nglebokna sira ing suwarga kang ana bengawane mili ana ngisore kekayon, (kelakone kang mangkono mahu besuk dina Qiyamat) ing kono Allah ora ngasoorake Nabi (Muhammad) lan para kancane kang mukmin cahyane padha mencorong madhangi ing ngarepe lan ing kono tangane padha munjuk ing Allah. Dhuh Pangeran! Paduka mugi nyampurnakna cahya kawula lan mugi ngapura dhumateng kawula, Paduka punika nguwasani samu kawis",
            "verse 66:9": "He nabi, sira peranga nglawan para wong kafir lan para wong lamis. Kabeh padha sira sentosanana. Besuk ana akherat wong kafir mau padha ana neraka Jahannam. Hala temen kawusanan kang mangkono iku",
            "verse 66:10": "Allah anggelar upama tumrap wong kang padha kafir kang dianggo upama rabine Nuh lan Luth. Wong wadon loro mau padha dadi rabine kawulaningsun wong loro, padha wong becik. Nanging wong wadon loro mau padha cidra marang lakine. Nuh lan Luth padha ora bisa ngayomi sethithika marang rabine, nyuwunake wurung siksaning Allah. Wong wadon loro mau padha tampa dhawuh, \"Sira padha mlebua ing neraka, awor wong kang padha malebu ing neraka",
            "verse 66:11": "Lan maneh Allah anggelar upama, tumrap wong kang padha percaya ing Allah. Kang dianggo upama rabine Fir’aun nalika dipilara munjuk ing Allah, \"Dhuh Pangeran kawula! Paduka mugi andamelan griya kawula wonten suwarga, kawula mugi panjenengan paringi wilujeng, kalis saking Fir’aun saha pihawonipun. Saha mugi Paduka paringi wilujeng saking pihawonipun para tiyang ingkang nganiaya",
            "verse 66:12": "Lan kang dianggo upama maneh Maryam anake Imron kang temen - temen rumeksa aksuciane mulane Ingsun aniyup dheweke kelawan ruh Ingsun sarta dheweke ambenerake marang sabdane Pangerane lan kitab - kitabe, tuwin dheweke dadi golongane para kang padha mituhu"
        },
        "Kazakh": {
            "verse 66:1": "Ей, Пайғамбар! Әйелдеріңнің ризалығын қалап, неге Аллаһтың өзіңе рұқсат еткеніне тыйым саласың. Ал, Аллаһ өте Кешірімді, ерекше Мейірімді",
            "verse 66:2": "Аллаһ сендерге анттарыңнан азат болудың жолын бекітті. Аллаһ сендердің Қамқоршыларың. Ол бәрін Білуші, аса Дана",
            "verse 66:3": "Кезінде Пайғамбар әйелдерінің біреуіне бір сөзді құпиялап айтқан еді. Ал, ол әйелі сырды басқағахабарлағанда, сонда Аллаһ мұны оған елшіге білдірді. Ол Пайғамбар оның кейбірін әйеліне айтты және кей бөлігін бүгіп қалды. Ол оны оған хабарлаған кезде, әйелі «Мұны саған кім хабарлады?» деді. Ол: «Маған бәрін Білуші, әрбір нәрседен Хабардар хабарлады», деді",
            "verse 66:4": "Екеуің істеген күнәләріңе шына­йы өкініп, Аллаһқа бойсұнуға қайтсаңдар тәубе етсеңдер , өйткені сендердің жүректерің ауытқыды. Ал, егер оған қарсы бір-біріңе болыссаңдар, ақиқатында, Аллаһ оның Қамқоршысы әрі Жәбірейіл мен иманға келгендердің ізгілері оның досы. Ал, одан кейін періштелер де оған көмектесуші",
            "verse 66:5": "Егер ол сендерді талақ етсе, Раббысы оған әлбетте сендерден жақсы мұсылман, иманды, бағынушы, істеген күнәларына шынайы өкініп, Аллаһқа бойсұнуға қайтушы тәубе етуші , құлшылық жасаушы, ораза ұстаушы, тұрмыста болған жесір не күйеуден қайтқан және тұрмыс құрмағандарды ауыстырып береді",
            "verse 66:6": "Ей, иманға келгендер! Өздеріңді және үй іштеріңді отыны адамдар мен тастардан болған Оттан сақтаңдар. Оның басында қатал, ызғарлы, Аллаһтың бұйрықтарына қарсы келмейтін әрі өздеріне бұйырылғанды орындайтын періштелер бар",
            "verse 66:7": "Ей, сондай күпірлік еткендер иманды теріске шығарғандар ! Бүгін ақталып, уәж айтпай-ақ қойыңдар. Сендерге тек, істеген амалдарыңның қайтарымы ғана беріледі",
            "verse 66:8": "Ей, иманға келгендер! Аллаһқа шын ықыласпен, істеген күнәләріңе шынайы өкініп, Оғанбойсұнуға қайтыңдар тәубе етіңдер , әлбетте сендердің Раббың жамандықтарыңды кешіреді әрі Пайғамбарды және онымен бірге иманға келгендерді қорламайтын күні Аллаһ сендерді астынан өзендер ағып жататын Жәннаттағы бақтарға кіргізеді. Олардың нұрлары алдарында және оң жақтарында жүреді. Олар: «Раббымыз! Бізге нұрымыздытолықтыр және бізді кешір, сөзсіз Сен барлық нәрсені жасай алушысың», дейді",
            "verse 66:9": "Ей, Пайғамбар! Кәпірлермен және мұнафиқтармен күрес және Оларға қатаң бол. Олардың орындары Жаһаннам (Тозақ) . Ол баратын орын неткен жаман",
            "verse 66:10": "Аллаһ Нұхтың әйелі мен Лұттың әйелін күпірлік етушілердің имансыздардың мысалы етіп келтірді. Ол екеуі Біздің құлдарымыздан екі ізгі құлдың некесінде еді. Ол екеуі оларға қиянат жасады. Алайда, ол екеуіне Аллаһтың алдында еш нәрсе пайда бермеді және: «Екеуің кірушілермен бірге Отқа тозаққа кіріңдер», делінді",
            "verse 66:11": "Ал, иманға келгендердің мысал-үлгісі етіп, Аллаһ Фиръаунның әйелін келтірді. Кезінде ол: «Раббым! Маған Өзіңнің құзырыңнан Жәннатта бір үй тұрғыз және мені Фиръаун мен оның істерінен құтқар әрі мені әділетсіз адамдардан құтқар», деген еді",
            "verse 66:12": "Сондай-ақ әйелдік пәктігін қорғаған ’Имранның қызы Мэриямды да. Біз оған Өз иелігіміздегі рухымыздан үрледік. Ол Раббысының сөздеріне және Кітаптарына сенді әрі Раббысына берілушілерден болды"
        },
        "Korean": {
            "verse 66:1": "선지자여! 그대를 위해 하나님께서 허락하신 것을 어찌하여 금하는 것인가, 그대 아내들의 기쁨을 간구하는 것인가? 하나님께서는 너그러이 용서하시는 자애로우신 분이라예언자여 하나님께서 그대에게 허용한 것을 스스로 금기하느 뇨 그대는 그대 아내들의 기쁨을 구하고 있으며 하나님은 관용과 자비로 충만하시니라",
            "verse 66:2": "하나님께서는 이미 그대들을 위해 맹세의 해약법을 지정하셨도다. 하나님께서는 그대들의 가호자이시며 그분께서는 모든 것을 알고 계시는 가장 현명하신 분이라하나님은 너희를 위하여 너희의 속죄를 명령하셨나니 하나님 이 너희의 보호자이시라 실로 그 분은 아심과 지혜로 충만하시니라",
            "verse 66:3": "선지자는 자신의 일부 아내에게 어떤 이야기를 비밀로 하였고 그녀는 그것(비밀)을 (타인에게) 알렸노라. 하나님께서는 그(선지자)에게 그것(누설 행위)을 보여 주셨고 그(선지자)는 그것의 일부를 (그녀가) 알도록 하였고 일부는 놓아두었노라. 그리하여 그(선지자)가 그녀에게 그것(누설 행위)를 알려 주었을 때 그녀가 말하길 “누가 당신께 이것을 알려 주었습니까?” 그가 말하길 “모든 것을 아시고 모든 것에 밝으신 분께서 나에게 알려 주셨노라”선지자께서 그분의 한 아내에게 한가지 기밀을 이야기 했을 때그녀는 그것을 타인에게 알렸으매하나님께서 그로 하여금 그것을 알도록 하자 그가 일부를 확인하 고 일부는 거절하고서 그것에 대 해 아내에게 말했을 때 아내는 누가 이 사실을 알려주셨습니까 라 고 물으매 아시며 지켜보시는 하 나님이 내게 알려 주었도다 라고 대답하였더라",
            "verse 66:4": "만약 그대 둘(하프싸와 아이샤)이 하나님께 뉘우친다면 그대 둘의 마음은 이미 기울어졌도다. 만약 그대 둘이 그(선지자)에 대항하여 서로를 돕는다면 하나님 그분이야말로 그의 가호자이시며 가브리엘과 선량한 신앙인들도 마찬가지라. 뿐만 아니라 천사들도 (그의) 조력자라만일 너희 둘이 하나님께 회 개하면 너희에게 복이 될 것이라 또한 너희 마음도 이미 그렇게 기 울었노라 너희 서로가 그분께 거 역한다 하여도 하나님과 가브리엘 천사와 믿음으로 의로운 자들이 그분을 도울 것이며 천사들도 더 욱 그러하리라",
            "verse 66:5": "만약 그가 그대들과 이혼한다면 그의 주님께서는 그를 위해 그대들보다 더 훌륭한 배우자들 - (하나님께) 순종하는 여성들, 믿는 여성들, (하나님께) 부단히 복종하는 여성들, 뉘우치는 여성들, 경배하는 여성들, 단식하는 여성들, 남편을 잃은 여성들과 결혼하지 않은 여성들 - 로 대체시켜 주실 지도 모를 일이라그가 너희와 이혼한다 하여 도 주님께서는 너희보다 더 나은 부인들로 너희 자리를 대체하여 주시니 그녀들은 보다 순종하고 믿음에 충실하며 헌신하고 회개하 며 겹손하고 믿음을 위해 이주하 며 단식하는 기혼의 여성이거나 미혼 여성들이라",
            "verse 66:6": "믿는 자들이여! 불지옥로부터 그대들 자신과 가족들을 구하라. 그곳의 땔감은 인간과 돌이며 그 위에는 모질고 혹독한 천사들이 있노라. 그들은 하나님과 그분께서 그들에게 내린 명령을 거스르지 않으며, 그들은 명령 받은 대로 행하노라믿는 사람들이여 인간과 돌들이 연료가 되어 타고 있는 불로 부터 너희 자신과 너희 가족을 구 하라 그 위에 천사가 있어 하나 님께서 명령한 대로 거역하지 아 니하고 명령받은 대로 엄하게 행 할 뿐이라",
            "verse 66:7": "불신하는 자들이여! 오늘은 변명하지 말라. 그대들은 단지 그대들이 행하던 일에 응벌을 받는 것 뿐이라불신자들이여 이날에 변명치 말라 너희는 너희가 행한 것에 따 라 벌을 받을 뿐이라",
            "verse 66:8": "믿는 자들이여! 하나님께 진실로 뉘우치라, 그대들 주님께서 그대들을 위해 그대들의 악행을 용서해 주시고 그대들을 아래로부터 강이 흐르는 천국에 들게 하실지도 모를 일이라. 그날 하나님께서는 선지자와 그와 함께 믿었던 자들에게 (불지옥의) 치욕을 주지 않으실 것이라. 그들의 앞쪽과 오른쪽에는 그들의 빛이 펼쳐질 것이라. 그들이 말할 것이니 : “저희의 주님, 저희를 위하여 저희의 빛을 완전히 하여 주시고 저희를 용서하여 주십시오. 실로 당신께서는 모든 것이 가능한 분이십니다”믿는 사람들이여 하나님께 진 실되게 회개하라 주님께서 너희 의 과오를 거두어 주사 너희로 하 여금 강물이 흐르는 천국으로 들 게 하시니라 하나님께서 선지자와 그와 더불어 믿는 자들을 부끄럽 지 않게 하실 그날 그들의 광명이 그들의 앞과 오른쪽에서 빛날 것 이라 그들은 주여 광명으로 완전 케 하여 주시고 저희를 보호하여 주소서 당신은 모든 일에 전지전 능 하시옵니다 라고 그들이 말하 리라",
            "verse 66:9": "선지자여! 불신자들과 위선자들을 상대로 분투하고 그들에게 엄격하라. 그들의 거주지는 지옥이니 얼마나 사악한 귀착지인가선지자여 불신자들과 위선자 들에 대항하여 성전하되 그들에 대하여 엄격하라 그들의 거주지 는 지옥의 사악한 말로이니라",
            "verse 66:10": "하나님께서는 불신하는 자들의 예로 노아의 아내와 롯의 아내를 드시노라. 그들(아내들)은 나의 종복들 중 선량했던 두 종복 밑에 있었으나 그들을 배신하였노라. 그렇기에 그들(남편들)은 하나님께 관하여 그들(아내들)에게 그 어떤 보탬도 주지 못하였노라. 그리고 목소리가 들리니 그대들(아내들)은 (지옥으로) 들어갈 자들과 함께 불지옥으로 들어가라`하나님께서 불신자들을 비유하사 노아의 아내와 롯의 아내를 비유하셨나니 그들 둘은 하나님 의 의로운 종들 밑에 있었으나 그 둘은 그들의 남편들을 배반하였으 매 그들의 행위로 말미암아 하나 님으로부터 아무 것도 얻지 못한 채 너희는 다른 사람들이 들어가 는 지옥으로 함께 들어가라는 말 밖엔 얻은 것이 없었노라",
            "verse 66:11": "하나님께서는 믿는 자들의 예로 파라오의 아내를 드시노라. 그녀가 말하길 : “저의 주님. 천국에서 저를 위해 당신 근처에 집을 지어 주십시오. 그리고 파라오와 그의 행위로부터 저를 구해 주시고 부당한 무리로부터 저를 구해 주십시오”하나님께서 믿는 사람들을 위해 파라오의 아내를 비유하셨 나니 보라 그녀가 말하였노라 주 여 저를 위하여 당신 가까이 천국안에 궁궐을 지어 주소서 그리고 파라오와 그의 행위로부터 저를 구하여 주시고 사악한 자들로부터저를 구하여 주소서",
            "verse 66:12": "이므란의 딸 마리아도 마찬가지니, 그녀가 자신의 순결을 지켰기에 나는 내가 창조한 영혼(가브리엘 천사)으로부터 그 안에 숨을 불었노라. 그녀는 자신의 주님의 말씀과 그분의 성서들을 믿었으며 부단히 복종하는 자들 중의 하나였노라순결을 지킨 이므란의 딸 마리아가 있었노라 그래서 하나님은 그녀의 몸에 그분의 영혼을 불어 넣었더니 그녀는 주님의 말씀 과 계시의 진리를 증언하고 순종 하는 자 중에 있었노라"
        },
        "Kurdish": {
            "verse 66:1": "Pêxember! tu çima tiþtê Xuda ji te re rewa dêraye tu ji bûna qayilbûna jinên xwe nerewa didêrî? Xuda bexþendekar e dilovan eئه‌ی پێغه‌مبه‌ر تۆ بۆچی شتێک له خۆت حه‌رام ده‌که‌یت که خوا بۆی حه‌ڵاڵ کردویت، ده‌ته‌وێت به‌و کاره هاوسه‌ره‌کانت ڕازی بکه‌یت؟! له‌کاتێکدا هه‌ر خوا لێخۆشبوو میهره‌بانه‌.",
            "verse 66:2": "Bi rastî Xuda, ji we re vekirina sondên we (bi dana bergîdana) daxuyandiye. Xuda yar û yawerê we ye. Zanayê hikmetdar her ew eبه‌ڕاستی خوا هه‌ڵوه‌شاندنه‌وه‌ی سوێده‌کانتانی بۆ بڕیارداون (به‌وه‌ی که‌فاره‌تی بده‌ن)، ئه‌و خوایه گه‌وره‌تانه و پشتیوان و یارمه‌تی ده‌رتانه‌، هه‌ر ئه‌ویش زاتێکی زاناو دانایه‌.",
            "verse 66:3": "Dema pêxamber ji hin jinên xwe re gotinek bi dizî got; vêca çi gava wê wî (razî ji jinên din re) got, û Xuda jî haya wî pê xist, wî hinekî wî (razî) nasî û ji hinekî wî jî rû zivirand. Vêca çi gava wî wê pê (bi belavkirina razê wî) haydar kir (jina wî) gotê: \"Kî te bi vî haydar kir?\" Got: \"(Xudayê) zanayê haydar min pê haydar kirکاتێك پێغه‌مبه‌ر (صلی الله علیه وسلم) قسه‌یه‌کی نهێنی لای هه‌ندێك له خێزانه‌کانی درکان (که ئه‌ویش دایکه حفصه بوو)، جا کاتێک ئه‌ویش باسه‌که‌ی گه‌یانده دایکه عائیشه خوایش پێغه‌مبه‌ری ئاگادارکرد له ڕازو نیازیان و باسی هه‌ندیك له ڕازه‌که‌ی کردو باسی هه‌ندێکی نه‌کرد، (پێغه‌مبه‌ر (صلی الله علیه وسلم) گله‌یی له دایکه حفصه کرد، ده‌رباره‌ی درکاندنی نهێنیکه‌) دایکه حفصه پرسی: کێ ئه‌م هه‌واڵه‌ی پێگه‌یاندیت؟ پێغه‌مبه‌ر (صلی الله علیه وسلم) وتی: خوای زاناو ئاگا منی ئاگادار کرد، (ئه‌م چه‌ند ئایه‌ته ده‌رباره‌ی ڕووداوێکی تایبه‌تیه له ژیانی پێغه‌مبه‌ر (صلی الله علیه وسلم) که له‌کتێبه‌کانی سیره‌دا باس کراوه‌).",
            "verse 66:4": "(Hûn herdû jinên pêxember ku we gotinê wî yê bi dizî belav kiriye) eger hûn bal Xuda ve poþman bibin-vegerin êdî bi rastî dilê we (ji rastiyê) xor bûye-ziviriye û eger hûn li serê piþtvaniya hevdû bikin, êdî bêguman yar û yawerê wî her Xuda û Cebraîl û qencê bawermendan e. Piþtî vî feriþte jî piþtvan in(بۆیه خوا گه‌وره پێیان ده‌فه‌رموێت:) ئه‌گه‌ر هه‌ردووکتان داوای ته‌وبه و په‌شیمانی بکه‌ن و بگه‌ڕێنه‌وه بۆ لای خوا، ئه‌وه باشه‌، چونکه دڵه‌کانتان له‌خشته چوو بوو و ترازا بوو، خۆ ئه‌گه‌ر پشتی یه‌کتر بگرن دژ به پێغه‌مبه‌ر (صلی الله علیه وسلم)، ئه‌وه چاک بزانن که خوا خۆی یاریده‌ده‌رێتی و هه‌روه‌ها جوبره‌ئیل و ئیمانداره چاکه‌کان، فریشته‌کانیش له‌وه‌ودوا پشتیوانن بۆی.",
            "verse 66:5": "Eger ew we berde, dibe perwerdekarê wî di þûna we de hin jinên ji we çêtir bidê ku musilmanê bawermendê ji dil pê girtiyê tobedarê perestvanê rojîdarê (yan koçberê) jinebî û keç binئه‌گه‌ر پیغه‌مبه‌ر (صلی الله علیه وسلم) ته‌ڵاقتان بدات، ئه‌وه نزیکه خوا هاوسه‌رانی چاکتر له ئێوه‌ی پی ببه‌خشتێت، موسڵمان و باوه‌ڕدار، ملکه‌چی په‌روه‌ردگار، زوو له هه‌ڵه په‌شیمان، خواپه‌رست و دیندار، ڕۆژووه‌وان، یان بیرو هۆشیان له‌کاردایه و سه‌رنجی دروست کراوانی خوا ده‌ده‌ن، هه‌روه‌ها ئه‌و ئافره‌تانه هه‌یانه بێوه‌ن و هه‌یانه کچن...",
            "verse 66:6": "Gelî ên bawerî anîne! hûn xwe û maliyên xwe ji agirê ku þewata wî mirov û kevir in biparêzin. Li serê hin feriþtê sirt û dijwar hene ku tiþtê Xuda ji wan re ferman bike ew bêemriya wî nakin û tiþtê têne ferman kirin dikinئه‌ی ئه‌و کاسانه‌ی که باوه‌ڕتان هێناوه خۆتان و که‌سوکارتان بپارێزن له ئاگرێك که سووته‌مه‌نیه‌که‌ی خه‌ڵکی و به‌رده‌، سه‌رپه‌رشتیاری ئه‌و دۆزه‌خ و ئاگره‌، جۆره فریشته‌یه‌کن که زۆر دڵڕه‌ق و توندو تیژن، نافه‌رمانی خوا ناکه‌ن له هیچ شتێکدا که فه‌رمانیان پێ بدات و هه‌رچی فه‌رمانێکیان پێ بدرێت ئه‌نجامی ده‌ده‌ن.",
            "verse 66:7": "Gelî en kafir bûne! hûn îro doza lêborînê nekin. Lewra bêguman hûn, her bi tiþtê we kiriye têne celat kirinئه‌ی ئه‌وانه‌ی که بی باوه‌ڕ بوون ئه‌مڕۆ هیچ پاکانه‌یه‌ک مه‌که‌ن، چونکه ئێوه به‌ڕاستی ته‌نها پاداشتی ئه‌و کارو کرده‌وانه‌تان ده‌درێته‌وه که ئه‌نجامتان ده‌دا.",
            "verse 66:8": "Gelî ên bawerî anîne! hûn bi poþmaniyek vebirrî bal Xuda ve poþman bibin-vegerin. Dibe ku perwerdekarê we nepakiyên we ji we bibe û we têxe hin bihiþtên ku çem ji binê wan diherikin; di roja ku wê Xuda, pêxember û ên pê re bawerî anîne riswa neke. Ronahiya wan li pêþiya wan û li rastê wan rohnî dike; ew dibêjin ku: \"Perwerdekarê me! tu ronahiya me ji me re bi tevayî pêk bîne û tu ji me re bibexþîne. Bêguman tu bi her tiþtî dikarî.\"þئه‌ی ئه‌و که‌سانه‌ی که باوه‌ڕتان هێناوه‌، ئێوه به ته‌وبه‌و په‌شیمانیه‌کی په‌خت و دڵسۆزانه‌وه ڕوو بکه‌نه‌وه خوا، نزیکه په‌روه‌ردگارتان له هه‌ڵه و گوناهه‌کانتان خۆش ببێت و بتانخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نداها و ڕوبار به‌ژێر دره‌خت و کۆشکه‌کانیدا ده‌ڕوات، ڕۆژێك دێت که خوا پێغه‌مبه‌ر و ئه‌وانه‌ی له خزمه‌تیدا خه‌جاڵه‌ت و شه‌رمه‌زار ناکات، نوورو ڕوناکیان ده‌دره‌وشێته‌وه‌و دێت و ده‌چێت له به‌رده‌م و لای ڕاستیانه‌وه و ده‌ڵێن: په‌روه‌ردگارا ئه‌م نوورو ڕوناکیه‌مان بۆ زیاد بکه‌و لێمان خۆش ببه‌، چونکه به‌ڕاستی تۆ ده‌سه‌ڵاتت به‌سه‌ر هه‌موو شتێکدا هه‌یه‌.",
            "verse 66:9": "Pêxember! tu bi kafir û durûyan re cîhadê bike û li ser wan sirtî nîþan de. Hewyegeha wan dojeh e. Çi þûnvegerek ne rind eئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) کۆشش بکه و بجه‌نگه دژی کافر و دووڕوه‌کان و توندو تیژبه له‌سه‌ریان، ئه‌وانه شوێنیان دۆزه‌خه‌، ئای که سه‌رنجامێکی خواپه‌.",
            "verse 66:10": "Xuda, ji ên kafir bûne re pîreka Nûh û pîreka Lût mînak da ku ew herdû di binê du bende yên qenc ji bendeyên me de bûn, vêca wan (du jina) bi her du (bendeyên me re) dexesî kir, êdî li hember Xuda tu tiþt bikêra wan nehat, û hat gotin ku: \"Hûn jî tevlî ketiyan têkevin agirخوا نموونه‌ی هێناوه‌ته‌وه به ژنی نوح و لوط بۆ ئه‌وانه‌ی که بێ باوه‌ڕ بوون، که ئه‌و دوو ئافره‌ته هاوسه‌ری دوو به‌نده‌ی چاك و پاکی ئێمه بوون، که‌چی خیانه‌تیان لێ کردن (باوه‌ڕیان پێیان نه‌بوو، غه‌یبه‌تیان ده‌کردن، گاڵته‌یان پێده‌کردن...)، ئیتر ئه‌و پێغه‌مبه‌رانه فریای هاوسه‌ره‌کانیان نه‌که‌وتن، له قیامه‌تدا به‌و ژنانه ده‌وترێت: بچنه ناو ئاگری دۆزه‌خه‌وه له‌گه‌ڵ ئه‌وانه‌دا که ده‌چنه ناوی.",
            "verse 66:11": "Û Xuda, ji ên bawerî anîne re pîreka Fîr´ewn mînak da; dema ku got: \"Perwerdekarê min! tu ji min re li cem xwe xanîkî di bihiþtê de ava ke û min ji Fîr´ewn û karê wî xelas ke û min ji komela sitemkaran rizgar bikeهه‌روه‌ها خوا نموونه‌ی هێناوه‌ته‌وه به هاوسه‌ره‌که‌ی فیرعه‌ون بۆ ئه‌وانه‌ی که باوه‌ڕیان هێناوه‌، کاتێك وتی: په‌روه‌ردگارا له‌لای خۆت له به‌هه‌شتدا ماڵێکم بۆ دروست بکه (تا به‌رده‌وام به‌دیدارت شاد ببم) و له ده‌ست فیرعه‌ون و کاروکرده‌وه‌ی ڕزگارم بکه و له‌ده‌ست ئه‌م قه‌ومه سته‌مکاره‌ش ده‌ربازم بکه‌.",
            "verse 66:12": "Û Meryam keça Îmran (minak da) a ku dawa xwe parast, vêca me ji canê xwe tê pîf kir û wê peyvê perwerdekarê xwe û kitêbên wî rast dêrand û bû ji ên bi dil perestvan inهه‌روه‌ها نموونه‌ی هێناوه‌ته‌وه به مه‌ریه‌می کچی عیمرانیش که داوێنی خۆی به‌پاکی ڕاگرت، ئێمه‌ش له‌و ڕۆحه‌ی که به‌ده‌ستمانه‌، فوومان پێداکرد، ئه‌ویش باوه‌ڕی ته‌واوی هه‌بوو به گوفتارو فه‌رمانه‌کانی په‌روه‌ردگاری و هه‌میشه و به‌رده‌وام ملکه‌چ و فه‌رمانبه‌ردارو خواناس و نزاکار بوو."
        },
        "Kyrgyz": {
            "verse 66:1": "О, пайгамбар! Эмне үчүн аялдарыңдын көңүлү үчүн Аллаһ сага адал кылган нерселерди (өзүңө) арам кылып жатасыӊ?! Аллаһ Кечиримдүү, Боорукер",
            "verse 66:2": "Аллаһ силерге антыңардан кайтуунун жолун үйрөткөн?. Силердин кожоюнуңар — Аллаһ. Ал — Билүүчү, Даанышман",
            "verse 66:3": "Бир кезде пайгамбар аялдарынан кээ бирине сырын ачты (жана «эч кимге айтпа» деди) Ал эми (аялы) аны ашкерелеп жибергенде муну Аллаһ (пайгамбарына) билдирди. (Пайгамбар Аллаһ билдирген нерселерден) кээ бирин (сыр ачкан аялына) айтты, кээ бирин айтпады. Ага айтканда ал: «муну сизге ким билдирди?!» деди. Айткын: «Билүүчү, Кабардар (Аллаһ) билдирди!»",
            "verse 66:4": "(О, пайгамбардын эки аялы!) эгер силер Аллаһка тооба кылсаңар жүрөгүңөрдү (пайгамбар сүйгөн нерсени сүйүүгө, ага жакпаган нерсени жек көрүүгө) муютат. Ал эми, ага каршы чыксаңар, (билип алгыла) анын (ишенген) Кожосу — Аллаһ! Андан кийин анын жардамчылары Жебирейил, ыйманы таза момундар жана периштелер",
            "verse 66:5": "Эгер пайгамбар силердин талагыңарды берип жиберсе, Аллаһ ага силерден жакшыраак, мусулман, ыймандуу, моюн сунган, тооба кылуучу, ибадатчыл жана орозо кармоочу кыз-жубандарды алмаштырып бериши мүмкүн",
            "verse 66:6": "О,ыйман келтирген пенделер! Өзүңөрдү жана үй-бүлөңөрдү тозоктон коргоп калгыла! Анын отундары адамдардан жана таштардан, үстүндө болсо, Аллаһ буюрган ишке эч качан каршы чыкпаган, буюрулган нерсени дароо аткара турган орой жана күчтүү периштелер турат",
            "verse 66:7": "Эй,каапырлар! Бул (Кыямат) күнү кечирим сурабай эле койгула, өзүңөр жасаган кылмышка жараша жазаңарды аласыңар",
            "verse 66:8": "О,ыйман келтиргендер! Аллаһка чын жүрөктөн тооба кылгыла! Раббиңер күнөөңөрдү өчүрүп, түбүнөн дарыялар агып турган бейиштерге киргизсе ажеп эмес. Ал (Кыямат) күндө Аллаһ (эч качан) пайгамбар жана аны менен бирге болгондорду шерменде кылбайт! Алардын (Аллаһ берген) нурлары оң тарабында жана алдында (жарытып) агылганда алар (дуба кылып:) «О, Раббибиз! Нурубузду кемитпегей элең! Күнөөлөрүбүздү кечиргей элең! Сен ар нерсеге кудуреттүүсүң!» дешет",
            "verse 66:9": "О, пайгамбар! Каапырлар менен мунафыктарга каршы жихад кыл жана чечкиндүү бол! Алардын бараар жери — тозок! Кандай жаман акыбет",
            "verse 66:10": "Аллаһ каапырлар(дын акыбети кандай бүтүшүн билгизүү) үчүн Нухтун аялы менен Луттун аялын мисал келтирди. Экөө тең Биздин салих пенделерибиздин (никесинин) астында болчу. Экөөсү(нүн аялы) аларга кыянат кылышты. Анан, эки пайгамбар тең Аллаһ тарабынан (азап болуп келген) нерседен эки аялды куткара албай калышты. Жана (эки аялдын бири сууга чөгүп, экинчисин жер жутуп өлгөндө, аларга) «киргендер менен бирге тозокко киргиле!» деп айтылды",
            "verse 66:11": "Аллаһ ыймандуулар үчүн Фираундун аялын (үлгү катары) мисал келтирди. Бир кезде ал (дуба кылып): «О, Раббим! Мага Өзүңдүн алдыңда — Бейиште бир үй тургузуп бер жана мени Фираун менен анын амалынан куткар! Мени заалым адамдардан сакта!» деди",
            "verse 66:12": "(Жана Аллаһ) Имрандын кызы Марямды дагы (мисал-үлгү кылды). Ал абийирин сактаган кыз болчу. Кийин Биз ага (Жебрейил периштени жиберип) Өз Рухубуздан үйлөдүк! Ал Раббисинин Сөзүн жана Китебин тастыктады жана моюн сунуучулардан болду"
        },
        "Malay": {
            "verse 66:1": "Wahai Nabi! Mengapa engkau haramkan (dengan bersumpah menyekat dirimu daripada menikmati) apa yang dihalalkan oleh Allah bagimu, (kerana) engkau hendak mencari keredaan isteri-isterimu? (Dalam pada itu, Allah ampunkan kesilapanmu itu) dan Allah sememangnya Maha Pengampun, lagi Maha Mengasihani.",
            "verse 66:2": "Sesungguhnya Allah telah menetapkan bagi kamu (wahai Nabi dan umatmu, untuk) melepaskan diri dari sumpah kamu (dengan membayar denda - kaffarah); dan Allah ialah Pelindung yang mentadbirkan keadaan kamu, dan Ia Maha Mengetahui, lagi Maha Bijaksana.",
            "verse 66:3": "Dan (ingatlah), ketika Nabi memberitahu suatu perkara secara rahsia kepada salah seorang dari isteri-isterinya. Kemudian apabila isterinya itu menceritakan rahsia yang tersebut (kepada seorang madunya), dan Allah menyatakan pembukaan rahsia itu kepada Nabi, (maka Nabi pun menegur isterinya itu) lalu menerangkan kepadanya sebahagian (dari rahsia yang telah dibukanya) dan tidak menerangkan yang sebahagian lagi (supaya isterinya itu tidak banyak malunya). Setelah Nabi menyatakan hal itu kepada isterinya, isterinya bertanya: \"Siapakah yang memberi tahu hal ini kepada tuan? \" Nabi menjawab: \"Aku diberitahu oleh Allah Yang Maha Mengetahui, lagi Amat Mendalam PengetahuanNya (tentang segala perkara yang nyata dan yang tersembunyi) \".",
            "verse 66:4": "Jika kamu berdua bertaubat kepada Allah (wahai isteri-isteri Nabi, maka itulah yang sewajibnya), kerana sesungguhnya hati kamu berdua telah cenderung (kepada perkara yang menyusahkan Nabi); dan jika kamu berdua saling membantu untuk (melakukan sesuatu yang) menyusahkannya, (maka yang demikian itu tidak akan berjaya) kerana sesungguhnya Allah adalah Pembelanya; dan selain dari itu Jibril serta orang-orang yang soleh dari kalangan orang-orang yang beriman dan malaikat-malaikat - juga menjadi penolongnya.",
            "verse 66:5": "Boleh jadi, jika Nabi menceraikan kamu, Tuhannya akan menggantikan baginya isteri-isteri yang lebih baik daripada kamu, - yang menurut perintah, yang ikhlas imannya, yang taat, yang bertaubat, yang tetap beribadat, yang berpuasa, - (meliputi) yang janda dan yang anak dara.",
            "verse 66:6": "Wahai orang-orang yang beriman! Peliharalah diri kamu dan keluarga kamu dari neraka yang bahan-bahan bakarannya: manusia dan batu (berhala); neraka itu dijaga dan dikawal oleh malaikat-malaikat yang keras kasar (layanannya); mereka tidak menderhaka kepada Allah dalam segala yang diperintahkanNya kepada mereka, dan mereka pula tetap melakukan segala yang diperintahkan.",
            "verse 66:7": "Malaikat itu akan berkata kepada orang-orang yang dimasukkan ke dalam neraka): \"Hai orang-orang yang kufur ingkar! Janganlah kamu menyatakan uzur (dengan meminta ampun) pada hari ini, (kerana masanya telah terlambat). Kamu hanyalah dibalas dengan balasan apa yang kamu telah kerjakan\".",
            "verse 66:8": "Wahai orang-orang yang beriman! Bertaubatlah kamu kepada Allah dengan \" Taubat Nasuha\", mudah-mudahan Tuhan kamu akan menghapuskan kesalahan-kesalahan kamu dan memasukkan kamu ke dalam Syurga yang mengalir di bawahnya beberapa sungai, pada hari Allah tidak akan menghinakan Nabi dan orang-orang yang beriman bersama-sama dengannya; cahaya (iman dan amal soleh) mereka, bergerak cepat di hadapan mereka dan di sebelah kanan mereka (semasa mereka berjalan); mereka berkata (ketika orang-orang munafik meraba-raba dalam gelap-gelita): \"Wahai Tuhan kami! Sempurnakanlah bagi kami cahaya kami, dan limpahkanlah keampunan kepada kami; sesungguhnya Engkau Maha Kuasa atas tiap-tiap sesuatu\".",
            "verse 66:9": "Wahai Nabi! Berjihadlah (menentang) orang-orang kafir dan orang-orang munafik, serta bertindak keras terhadap mereka. Dan (sebenarnya) tempat mereka ialah neraka Jahannam, dan itulah seburuk-buruk tempat kembali.",
            "verse 66:10": "Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada manfaatnya) bagi orang-orang kafir (berhubung rapat dengan orang-orang mukmin selagi mereka tidak beriman dengan sebenar-benarnya), iaitu: perihal isteri Nabi Nuh dan isteri Nabi Lut; mereka berdua berada di bawah jagaan dua orang hamba yang soleh dari hamba-hamba Kami (yang sewajibnya mereka berdua taati); dalam pada itu mereka berlaku khianat kepada suami masing-masing; maka kedua-dua suami mereka (yang berpangkat Nabi itu) tidak dapat memberikan sebarang pertolongan kepada mereka dari (azab) Allah, dan (sebaliknya) dikatakan kepada mereka berdua (pada hari pembalasan): \"Masuklah kamu berdua ke dalam neraka bersama-sama orang-orang yang masuk (ke situ)\".",
            "verse 66:11": "Dan Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada mudaratnya) kepada orang-orang mukmin (berhubung rapat dengan orang-orang kafir kalau tidak terjejas keadaan imannya), iaitu: perihal isteri Firaun, ketika ia berkata: \"Wahai Tuhanku! Binalah untukku sebuah rumah di sisiMu dalam Syurga, dan selamatkanlah daku dari Firaun dan perbuatannya (yang kufur dan buas), serta selamatkanlah daku dari kaum yang zalim\";",
            "verse 66:12": "Dan juga (satu misal perbandingan lagi, iaitu): Maryam binti Imran (ibu Nabi Isa seorang perempuan) yang telah memelihara kehormatan dan kesuciannya (dari disentuh oleh lelaki; tetapi oleh sebab Kami telah takdirkan dia mendapat anak) maka Kami perintahkan Jibril meniup masuk ke dalam kandungan tubuhnya dari roh (ciptaan) Kami; dan (sekalipun Maryam itu hidup di antara kaum kafir) ia mengakui kebenaran Kalimah-kalimah Tuhannya serta Kitab-kitabNya; dan ia menjadi dari orang-orang yang tetap taat."
        },
        "Malayalam": {
            "verse 66:1": "ഓ; നബീ, നീയെന്തിനാണ് നിന്‍റെ ഭാര്യമാരുടെ പ്രീതിതേടിക്കൊണ്ട്‌, അല്ലാഹു അനുവദിച്ചു തന്നത് നിഷിദ്ധമാക്കുന്നത്‌? അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു.",
            "verse 66:2": "നിങ്ങളുടെ ശപഥങ്ങള്‍ക്കുള്ള പരിഹാരം അല്ലാഹു നിങ്ങള്‍ക്ക് നിയമമാക്കിത്തന്നിരിക്കുന്നു. അല്ലാഹു നിങ്ങളുടെ യജമാനനാകുന്നു. അവനത്രെ സര്‍വ്വജ്ഞനും യുക്തിമാനും.",
            "verse 66:3": "നബി അദ്ദേഹത്തിന്‍റെ ഭാര്യമാരില്‍ ഒരാളോട് ഒരു വര്‍ത്തമാനം രഹസ്യമായി പറഞ്ഞ സന്ദര്‍ഭം (ശ്രദ്ധേയമാകുന്നു.) എന്നിട്ട് ആ ഭാര്യ അത് (മറ്റൊരാളെ) അറിയിക്കുകയും, നബിക്ക് അല്ലാഹു അത് വെളിപ്പെടുത്തി കൊടുക്കുകയും ചെയ്തപ്പോള്‍ അതിന്‍റെ ചില ഭാഗം അദ്ദേഹം (ആ ഭാര്യയ്ക്ക്‌) അറിയിച്ചുകൊടുക്കുകയും ചില ഭാഗം വിട്ടുകളയുകയും ചെയ്തു. അങ്ങനെ അവളോട് (ആ ഭാര്യയോട്‌) അദ്ദേഹം അതിനെ പറ്റി വിവരം അറിയിച്ചപ്പോള്‍ അവള്‍ പറഞ്ഞു: താങ്കള്‍ക്ക് ആരാണ് ഈ വിവരം അറിയിച്ചു തന്നത് ? നബി (സ) പറഞ്ഞു: സര്‍വ്വജ്ഞനും സൂക്ഷ്മജ്ഞാനിയുമായിട്ടുള്ളവനാണ് എനിക്ക് വിവരമറിയിച്ചു തന്നത്‌.",
            "verse 66:4": "നിങ്ങള്‍ രണ്ടു പേരും അല്ലാഹുവിങ്കലേക്ക് പശ്ചാത്തപിച്ചു മടങ്ങുന്നുവെങ്കില്‍ (അങ്ങനെ ചെയ്യുക.) കാരണം നിങ്ങളുടെ രണ്ടുപേരുടെയും ഹൃദയങ്ങള്‍ (തിന്‍മയിലേക്ക്‌) ചാഞ്ഞുപോയിരിക്കുന്നു. ഇനി നിങ്ങള്‍ ഇരുവരും അദ്ദേഹത്തിനെതിരില്‍ (റസൂലിനെതിരില്‍) പരസ്പരം സഹകരിക്കുന്ന പക്ഷം തീര്‍ച്ചയായും അല്ലാഹുവാകുന്നു അദ്ദേഹത്തിന്‍റെ യജമാനന്‍. ജിബ്‌രീലും സദ്‌വൃത്തരായ സത്യവിശ്വാസികളും അതിനു പുറമെ മലക്കുകളും അദ്ദേഹത്തിന് സഹായികളായിരിക്കുന്നതാണ്‌.",
            "verse 66:5": "(പ്രവാചകപത്നിമാരേ,) നിങ്ങളെ അദ്ദേഹം വിവാഹമോചനം ചെയ്യുന്ന പക്ഷം, നിങ്ങളെക്കാള്‍ നല്ലവരായ ഭാര്യമാരെ അദ്ദേഹത്തിന് അദ്ദേഹത്തിന്‍റെ രക്ഷിതാവ് പകരം നല്‍കിയേക്കാം. മുസ്ലിംകളും സത്യവിശ്വാസിനികളും ഭയഭക്തിയുള്ളവരും പശ്ചാത്താപമുള്ളവരും ആരാധനാനിരതരും വ്രതമനുഷ്ഠിക്കുന്നവരും വിധവകളും കന്യകകളുമായിട്ടുള്ള സ്ത്രീകളെ.",
            "verse 66:6": "സത്യവിശ്വാസികളേ, സ്വദേഹങ്ങളെയും നിങ്ങളുടെ ബന്ധുക്കളെയും മനുഷ്യരും കല്ലുകളും ഇന്ധനമായിട്ടുള്ള നരകാഗ്നിയില്‍ നിന്ന് നിങ്ങള്‍ കാത്തുരക്ഷിക്കുക. അതിന്‍റെ മേല്‍നോട്ടത്തിന് പരുഷസ്വഭാവമുള്ളവരും അതിശക്തന്‍മാരുമായ മലക്കുകളുണ്ടായിരിക്കും. അല്ലാഹു അവരോട് കല്‍പിച്ചകാര്യത്തില്‍ അവനോടവര്‍ അനുസരണക്കേട് കാണിക്കുകയില്ല. അവരോട് കല്‍പിക്കപ്പെടുന്നത് എന്തും അവര്‍ പ്രവര്‍ത്തിക്കുകയും ചെയ്യും.",
            "verse 66:7": "സത്യനിഷേധികളേ, നിങ്ങള്‍ ഇന്ന് ഒഴികഴിവ് പറയേണ്ട. നിങ്ങള്‍ ചെയ്തുകൊണ്ടിരുന്നതിനു മാത്രമാണ് നിങ്ങള്‍ക്ക് പ്രതിഫലം നല്‍കപ്പെടുന്നത്‌.",
            "verse 66:8": "സത്യവിശ്വാസികളേ, നിങ്ങള്‍ അല്ലാഹുവിങ്കലേക്ക് നിഷ്കളങ്കമായ പശ്ചാത്താപം കൈക്കൊണ്ട് മടങ്ങുക. നിങ്ങളുടെ രക്ഷിതാവ് നിങ്ങളുടെ പാപങ്ങള്‍ മായ്ച്ചുകളയുകയും താഴ്ഭാഗത്തു കൂടി അരുവികള്‍ ഒഴുകുന്ന സ്വര്‍ഗത്തോപ്പുകളില്‍ നിങ്ങളെ പ്രവേശിപ്പിക്കുകയും ചെയ്തേക്കാം. അല്ലാഹു പ്രവാചകനെയും അദ്ദേഹത്തോടൊപ്പം വിശ്വസിച്ചവരെയും അപമാനിക്കാത്ത ദിവസത്തില്‍. അവരുടെ പ്രകാശം അവരുടെ മുന്നിലൂടെയും വലതുവശങ്ങളിലൂടെയും സഞ്ചരിക്കും. അവര്‍ പറയും: ഞങ്ങളുടെ രക്ഷിതാവേ, ഞങ്ങളുടെ പ്രകാശം ഞങ്ങള്‍ക്കു നീ പൂര്‍ത്തീകരിച്ച് തരികയും, ഞങ്ങള്‍ക്കു നീ പൊറുത്തുതരികയും ചെയ്യേണമേ. തീര്‍ച്ചയായും നീ ഏതു കാര്യത്തിനും കഴിവുള്ളവനാകുന്നു.",
            "verse 66:9": "ഓ; നബീ, സത്യനിഷേധികളോടും കപടവിശ്വാസികളോടും നീ സമരം ചെയ്യുകയും അവരോട് പരുഷമായി പെരുമാറുകയും ചെയ്യുക. അവരുടെ സങ്കേതം നരകമാകുന്നു. എത്തിച്ചേരാനുള്ള ആ സ്ഥലം എത്രയോ ചീത്ത!",
            "verse 66:10": "സത്യനിഷേധികള്‍ക്ക് ഉദാഹരണമായി നൂഹിന്‍റെ ഭാര്യയെയും, ലൂത്വിന്‍റെ ഭാര്യയെയും അല്ലാഹു ഇതാ എടുത്തുകാണിച്ചിരിക്കുന്നു. അവര്‍ രണ്ടുപേരും നമ്മുടെ ദാസന്‍മാരില്‍ പെട്ട സദ്‌വൃത്തരായ രണ്ട് ദാസന്‍മാരുടെ കീഴിലായിരുന്നു. എന്നിട്ട് അവരെ രണ്ടുപേരെയും ഇവര്‍ വഞ്ചിച്ചു കളഞ്ഞു. അപ്പോള്‍ അല്ലാഹുവിന്‍റെ ശിക്ഷയില്‍ നിന്ന് യാതൊന്നും അവര്‍ രണ്ടുപേരും ഇവര്‍ക്ക് ഒഴിവാക്കികൊടുത്തില്ല. നിങ്ങള്‍ രണ്ടുപേരും നരകത്തില്‍ കടക്കുന്നവരോടൊപ്പം കടന്നുകൊള്ളുക എന്ന് പറയപ്പെടുകയും ചെയ്തു.",
            "verse 66:11": "സത്യവിശ്വാസികള്‍ക്ക് ഒരു ഉപമയായി അല്ലാഹു ഫിര്‍ഔന്‍റെ ഭാര്യയെ എടുത്തുകാണിച്ചിരിക്കുന്നു. അവള്‍ പറഞ്ഞ സന്ദര്‍ഭം: എന്‍റെ രക്ഷിതാവേ, എനിക്ക് നീ നിന്‍റെ അടുക്കല്‍ സ്വര്‍ഗത്തില്‍ ഒരു ഭവനം ഉണ്ടാക്കിത്തരികയും, ഫിര്‍ഔനില്‍ നിന്നും അവന്‍റെ പ്രവര്‍ത്തനത്തില്‍ നിന്നും എന്നെ നീ രക്ഷിക്കേണമേ. അക്രമികളായ ജനങ്ങളില്‍ നിന്നും എന്നെ നീ രക്ഷിക്കുകയും ചെയ്യേണമേ.",
            "verse 66:12": "തന്‍റെ ഗുഹ്യസ്ഥാനം കാത്തുസൂക്ഷിച്ച ഇംറാന്‍റെ മകളായ മര്‍യമിനെയും (ഉപമയായി എടുത്ത് കാണിച്ചിരിക്കുന്നു.) അപ്പോള്‍ നമ്മുടെ ആത്മചൈതന്യത്തില്‍ നിന്നു നാം അതില്‍ ഊതുകയുണ്ടായി. തന്‍റെ രക്ഷിതാവിന്‍റെ വചനങ്ങളിലും ഗ്രന്ഥങ്ങളിലും അവള്‍ വിശ്വസിക്കുകയും അവള്‍ ഭയഭക്തിയുള്ളവരുടെ കൂട്ടത്തിലാവുകയും ചെയ്തു."
        },
        "Norwegian": {
            "verse 66:1": "Du profet, hvorfor forbyr du det Gud har tillatt deg idet du søker å tekkes dine hustruer? Gud er tilgivende, nåderik.",
            "verse 66:2": "Gud har foreskrevet dere løsningsmåten fra deres eder. Gud har omsorg for dere. Han er den Allvitende, den Vise.",
            "verse 66:3": "Da profeten betrodde en av sine hustruer en sak, og hun fortalte det videre og dette avslørte Gud for ham, så hadde han fortalt noe av det og holdt noe tilbake. Når han så forela dette for henne, sa hun: «Hvem har fortalt deg dette?» Og han svarte: «Den Vise, den Innsiktsfulle har fortalt meg.»",
            "verse 66:4": "Om dere to vender dere botferdige til Gud! For deres hjerter var på avveie. Men om dere hjelper hverandre mot Ham, så tar Gud seg av hans sak, og Gabriel, og den rettskafne blant de troende, og hertil yter englene hjelp!",
            "verse 66:5": "Kanskje vil Herren, om han skiller seg fra dere, gi ham i bytte hustruer som er bedre enn dere, Gud-hengivne, troende, ydmyke, botferdige, fromme, asketiske, som har vært gifte før, eller jomfruer.",
            "verse 66:6": "Dere som tror, pass dere selv og deres familier for Ilden, hvis brensel er mennesker og steiner! Strenge og harde engler forestår dem som ikke er ulydige mot Gud i det Han befaler dem, og gjør det de er pålagt.",
            "verse 66:7": "«Dere vantro! Kom ikke med unnskyldninger denne dag! Dere belønnes bare for det dere har gjort.»",
            "verse 66:8": "Dere som tror, vend dere mot Gud i oppriktig bot! Kanskje Herren vil stryke ut deres misgjerninger, og føre dere inn i paradisets haver, hvor bekker sildrer. På den dag vil Gud ikke gjøre skam på profeten og dem som tror sammen med ham. Deres lys strømmer foran dem og på deres høyre side, og de sier: «Herre, la vårt lys fullbyrdes for oss, og tilgi oss! Du evner alt.»",
            "verse 66:9": "Du profet, strid mot de vantro og hyklerne, og vær hard mot dem! Deres herberge blir helvete. En sørgelig skjebne!",
            "verse 66:10": "Gud har gjort en lignelse for den vantro om Noas hustru, og Lots hustru. De var under to av Våre rettferdige tjenere, men de svek dem. Så kunne de ikke hjelpe dem det ringeste overfor Gud, og det ble sagt til dem: «Gå inn i Ilden sammen med dem som går dit.»",
            "verse 66:11": "Gud har gjort lignelsen for de troende om Faraos hustru, da hun sa: «Herre, bygg meg et hus hos Deg i paradiset, og fri meg fra Farao og alt hans verk, og frels meg fra et folk av urettferdige.»",
            "verse 66:12": "Og Maria, Imrans datter, som bevarte sitt legemes kyskhet, og Vi blåste inn i det av Vår ånd, og hun bekreftet Herrens ord og skrifter. Hun var av de ydmyke."
        },
        "Pashto": {
            "verse 66:1": "اى نبي! ته ولې هغه شى حراموې (بندوې) چې الله تا ته حلال كړى دى؟ ته د خپلو ښځو خوشحالول (او راضی كول) غواړې۔ او الله ډېر بخښونكى، بې حده رحم كوونكى دى",
            "verse 66:2": "یقینًا الله تاسو لپاره ستاسو د قسمونو حلالوالى مقرر كړى دى۔ او الله ستا مددګار دى، او هم دى ښه پوه، ښه حكمت والا دى",
            "verse 66:3": "او (یاد كړه) هغه وخت چې نبي په خپلو ښځو كې كومې ته په راز كې یوه خبره وویله۔، نو كله چې هغې په دې سره (بلې ته) خبر وركړ۔ او الله ده ته دغه (خبره) ښكاره كړه (نو) ده ځینې خبره وښودله او له ځینې نه يې اعراض وكړ۔، نو كله چې ده هغه (ښځه) په دې خبره كړه (نو) هغې وویل: ته په دې باندې چا خبر كړې؟ ده وویل: ما ته ډېر پوه (او) ښه خبردار ذات خبر راكړ",
            "verse 66:4": "كه چېرې تاسو دواړه الله ته توبه وباسئ، نو یقینًا ستاسو د دواړو زړونه مايله شوي دي او كه د ده (نبي) په خلاف تاسو یوه له بلې سره مدد وكړئ، نو بېشكه چې الله، همغه د ده مددګار دى۔ او جبریل او صالح مومنان او ملايك له دې نه پس مددګاران دي",
            "verse 66:5": "كه دى تاسو ته طلاق دركړي (، نو) امېد دى چې د ده رب به ده ته په بدل كې له تاسو نه ډېرې غوره ښځې وركړي، چې مسلمانانې، مومنانې، اطاعت ګزارې، توبه اېستونكې، عبادت كوونكې، روژه نیوونكې، (هجرت كوونكې) څښتن لیدلې او پېغلې به وي",
            "verse 66:6": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو خپل ځانونه او خپل اهل له داسې اور نه بچ وساتئ چې د هغه خشاك خلق او كاڼي دي، په ده باندې ډېر سخت خویه، قوتناك ملايك مقرر دي، چې دوى په هغه څه كې د الله نافرمانۍ نه كوي چې دوى ته يې حكم كړى وي۔ او دوى هغه څه كوي چې دوى ته يې حكم كولى شي",
            "verse 66:7": "اى هغو كسانو چې كافران شوي دي! تاسو نن ورځ عذرونه مه وړاندې كوئ۔، بېشكه همدا خبره ده چې تاسو ته به د هغه څه بدله دركولى شي چې تاسو به كول",
            "verse 66:8": "اى هغو كسانو چې ایمان يې راوړى دى! تاسو الله ته توبه وباسئ خالصه رښتینې توبه۔، امېد دى چې ستاسو رب به له تاسو نه ستاسو ګناهونه ورژوي او تاسو به داسې جنتونو ته داخل كړي چې د هغو له لاندې ولې بهېږي۔، په هغه ورځ كې چې الله به نبي او هغه كسان چې له ده سره يې ایمان راوړى دى رسوا نه كړي۔، د دوى رڼا به د دوى په وړاندې او د دوى په ښي اړخ منډې وهي۔، دوى به وايي: اى زمونږه ربه! ته مونږ ته زمونږ رڼا پوره كړه او مونږ وبخښه۔، بېشكه ته په هر شي باندې ښه قادر يې",
            "verse 66:9": "اى نبي! ته له كافرانو او منافقانو سره جهاد كوه او په دوى باندې سختي كوه۔ او د دوى استوګنه جهنم دى او هغه د ورتلو بد ځاى دى",
            "verse 66:10": "الله د هغو كسانو لپاره مثال بیانوي چې كافران شوي دي: د نوح ښځه او د لوط ښځه، دا دواړه زمونږ په بنده ګانو كې ددوه نېكو بنده ګانو لاندې وې، نو دغو دواړو (ښځو) له هغو سره خیانت وكړ، نو هغوى د الله په مقابله كې د دوى هېڅ په كار رانغلل۔ او دغو دواړو (ښځو) ته وویل شول چې تاسو اور ته له ننوتونكو سره ننوځئ",
            "verse 66:11": "او الله د ایمان راوړونكو لپاره یو بل مثال بیانوي: د فرعون ښځه ده، كله چې هغې وویل: اى زما ربه! ته ما ته زما لپاره خپلې خوا كې په جنت كې یو كور جوړ كړه او ته ما له فرعون او د هغه له عمل نه خلاصه كړه او ته ما ته له ظالم قوم نه نجات راكړه",
            "verse 66:12": "او د عمران لور مریم ده، هغه چې د خپل شرم ځاى حفاظت يې كړى و، پس مونږ له خپل روح نه په ده كې پوكى وواهه او دې د خپل رب د كلمو (خبرو) او د هغه د كتابونو تصدیق كړى و او دا له حكم منونكو ځنې وه"
        },
        "Persian": {
            "verse 66:1": "اى پيامبر، چرا چيزى را كه خدا بر تو حلال كرده است، به خاطر خشنودساختن زنانت بر خود حرام مى‌كنى؟ و خدا آمرزنده و مهربان است.",
            "verse 66:2": "خدا براى شما گشودن سوگندهايتان را مقرر داشته است. خداست ياور شما، و اوست دانا و حكيم.",
            "verse 66:3": "آنگاه كه پيامبر با يكى از زنان خود رازى در ميان نهاد، چون آن زن آن راز با ديگرى باز گفت، خدا پيامبر را از آن آگاه ساخت و او پاره‌اى از آن راز را بر آن زن آشكار كرد و از افشاى پاره‌اى ديگر سرباز آد. چون او را از آن خبر داد، گفت: چه كسى تو را از اين ماجرا آگاه كرده است؟ گفت: آن خداى داناى آگاه به من خبر داده است.",
            "verse 66:4": "اگر شما دو زن توبه كنيد بهتر است، زيرا دلهايتان از حق باز گشته است. و اگر براى آزارش همدست شويد، خدا ياور اوست و نيز جبرئيل و مؤمنان شايسته و فرشتگان از آن پس ياور او خواهند بود.",
            "verse 66:5": "شايد اگر شما را طلاق گويد پروردگارش به جاى شما زنانى بهتر از شمايش بدهد. زنانى مسلمان، مؤمن، فرمانبردار، توبه‌كننده، اهل عبادت و روزه‌گرفتن، خواه شوهركرده، خواه باكره.",
            "verse 66:6": "اى كسانى كه ايمان آورده‌ايد، خود و خانواده خود را از آتشى كه هيزم آن مردم و سنگها هستند نگه داريد. فرشتگانى درشت‌گفتار و سختگير بر آن آتش موكّلند. هر چه خدا بگويد نافرمانى نمى‌كنند و همان مى‌كنند كه به آن مأمور شده‌اند.",
            "verse 66:7": "اى كافران، در آن روز پوزش مخواهيد. جز اين نيست كه برابر كارى كه كرده‌ايد كيفر داده شويد.",
            "verse 66:8": "اى كسانى كه ايمان آورده‌ايد، به درگاه خدا توبه كنيد؛ توبه‌اى از روى اخلاص. باشد كه پروردگارتان گناهانتان را محو كند و شما را به بهشتهايى داخل كند كه در آن نهرها جارى است. در آن روز، خدا پيامبر و كسانى را كه با او ايمان آورده‌اند فرو نگذارد، و نورشان پيشاپيش و سمت راستشان در حركت باشد. مى‌گويند: اى پروردگار ما، نور ما را براى ما به كمال رسان و ما را بيامرز، كه تو بر هر كارى توانا هستى.",
            "verse 66:9": "اى پيامبر، با كفار و منافقان جهاد كن و بر آنها سخت بگير. جايگاهشان جهنم است كه بد سرانجامى است.",
            "verse 66:10": "خدا براى كافران مثَل زن نوح و زن لوط را مى‌آورد كه هر دو در نكاح دو تن از بندگان صالح ما بودند و به آن دو خيانت ورزيدند. و آنها نتوانستند از زنان خود دفع عذاب كنند و گفته شد: با ديگران به آتش درآييد.",
            "verse 66:11": "و خدا براى كسانى كه ايمان آورده‌اند، آن فرعون را مثَل مى‌زند آنگاه كه گفت: اى پروردگار من، براى من در بهشت نزد خود خانه‌اى بنا كن و مرا از فرعون و عملش نجات ده و مرا از مردم ستمكاره برهان.",
            "verse 66:12": "و مريم دختر عمران را كه شرمگاه خويش را از زنا نگه داشت و ما از روح خود در آن دميديم. و او كلمات پروردگار خود و كتابهايش را تصديق كرد و او از فرمانبرداران بود."
        },
        "Polish": {
            "verse 66:1": "O Proroku! Dlaczego zakazujesz sobie tego, co pozwolił ci Bóg, chcąc przypodobać się twoim żonom? Bóg jest przebaczający, litościwy!",
            "verse 66:2": "Bóg nałożył na was obowiązek zwolnienia się z takich przysiąg. Bóg jest waszym opiekunem! On jest Wszechwiedzący, Mądry!",
            "verse 66:3": "Oto Prorok powierzył w tajemnicy jednej ze swoich żon pewną historię. A kiedy ona ją rozgłosiła i Bóg ujawnił to jemu, wówczas on częściowo dał jej to poznać, a częściowo przemilczał. A kiedy Prorok jej o tym mówił, rzekła: \"Któż ci to obwieścił?\" Powiedział: \"Obwieścił mi Wszechwiedzący, Świadomy.\"",
            "verse 66:4": "Jeśli wy obydwie nawrócicie się do Boga... przecież już skłoniły się wasze serca. Ale jeśli będziecie się wzajemnie wspomagać przeciwko Prorokowi - to, zaprawdę, Bóg jest jego Opiekunem, a Gabriel i sprawiedliwi między wiernymi, a także aniołowie są jego wspomożycielami!",
            "verse 66:5": "Być może, jego Pan - jeśli on was odprawi - da mu w zamian żony lepsze od was, całkowicie poddane Bogu, wierzące, gorliwe w modlitwie, okazujące skruchę, pobożne, przestrzegające postu, czy to zamężne, czy dziewice.",
            "verse 66:6": "O wy, którzy wierzycie! Strzeżcie się sami i wasze rodziny od ognia; którego strawą będą ludzie i kamienie! Wokół niego będą aniołowie, ogromni, straszni; oni nie buntują się przeciw rozkazowi Boga, lecz wypełniają to, co jest im nakazane.",
            "verse 66:7": "O wy, którzy nie wierzycie! Nie usprawiedliwiajcie się dzisiaj! Zostanie wam zapłacone tylko za to, co czyniliście.",
            "verse 66:8": "O wy, którzy wierzycie! Nawracajcie się do Boga ze szczerą skruchą! Być może, wasz Pan odpuści wam złe czyny i wprowadzi was do Ogrodów, gdzie w dole płyną strumyki - tego Dnia, kiedy Bóg nie okryje hańbą ani Proroka, ani tych, którzy z nim uwierzyli; światło ich pójdzie przed nimi i po ich prawicy. Oni będą mówili: \"Panie nasz! Uczyń doskonałym dla nas nasze światło i przebacz nam! Zaprawdę, Ty jesteś nad każdą rzeczą wszechwładny!\"",
            "verse 66:9": "O Proroku! Zwalczaj niewiernych i obłudników i bądź względem nich surowy! Ich miejscem schronienia będzie Gehenna. A jakże nieszczęsne to miejsce przybycia!",
            "verse 66:10": "Bóg dał przypowieść tym, którzy nie uwierzyli: o żonie Noego i żonie Lota. Obie one były pod władzą Naszych dwóch sług, spośród Naszych sług sprawiedliwych, lecz one zdradziły ich. I oni nic nie mogli dla nich uczynić wobec Boga. I powiedziano im: \"Wejdźcie do ognia obie wraz z tymi, którzy tam wchodzą!\"",
            "verse 66:11": "I Bóg dał jako przykład tym, którzy uwierzyli, żonę Faraona. Oto ona powiedziała: \"Panie mój! Zbuduj dla mnie u Siebie dom w Ogrodzie! Wybaw mnie od Faraona i od jego dzieła! I wybaw mnie od ludzi niesprawiedliwych!\"",
            "verse 66:12": "I Marię, córkę Imrana, która zachowała dziewictwo; tak więc tchnęliśmy w nią nieco z Naszego Ducha. I ona potwierdziła słowa swego Pana i Jego Ksiąg, i była wśród pokornych."
        },
        "Portuguese": {
            "verse 66:1": "Ó profeta, por que te absténs daquilo que Deus te concedeu, procurando, com isso, agradar as tuas esposas, quando sabesque Deus é Indulgente, Misericordiosíssimo?",
            "verse 66:2": "Deus vos permitiu a expiação dos vossos juramentos, porque é vosso Protetor e é o Sapiente, o Prudentíssimo.",
            "verse 66:3": "Quando o Profeta confidenciou um segredo a uma das suas esposas (Hafsa), ela o revelou (a outra), e Deus informou-odisso; ele, então, confirmou uma parte disso, escondendo a outra. Mais, quando ele contou, ela perguntou: Quem te anunciouisso? Disse: Anunciou-mo o Onisciente, o Sapientíssimo.",
            "verse 66:4": "Se vós, ambas, voltardes arrependidas a Deus, os vossos corações inclinar-se-ão para isso; porém, se confabulardescontra ele, sabei que Deus é o seu Protetor, bem como Gabriel, os virtuosos, dentre os fiéis e os anjos serão os (seus) socorredores.",
            "verse 66:5": "Se ele se divorciar de vós, pode ser que o seu Senhor lhe conceda esposas muçulmanas preferíveis a vós, fiéis, devotas, arrependidas, adoradoras, jejuadoras, anteriormente casadas ou donzelas.",
            "verse 66:6": "Ó fiéis, precavei-vos, juntamente com as vossas famílias, do fogo, cujo alimento serão os homens e as pedras, o qual é guardado por anjos inflexíveis e severos, que jamais desobedecem às ordens que recebem de Deus, mas executam tudo quanto lhes é imposto.",
            "verse 66:7": "Ó incrédulos, não apresenteis escusas hoje, porque só sereis recompensados pelo que houverdes feito!",
            "verse 66:8": "Ó fiéis, voltai, sinceramente arrependidos, a Deus; é possível que o vosso Senhor absolva as vossas faltas e vos introduza em jardins, abaixo dos quais correm os rios, no dia em que Deus não aviltará o Profeta e aqueles que com ele crerem. Uma luz fulgurará diante deles e, com a sua crença, dirão: Ó Senhor nosso, completa-nos a nossa luz e perdoa-nos, porque Tu és Onipotente!",
            "verse 66:9": "Ó Profeta, combate com denodo os incrédulos e os hipócritas, e sê inflexível para com eles, pois a sua morada será o inferno. E que funesto destino!",
            "verse 66:10": "Deus exemplifica, assim, aos incrédulos, com as mulheres de Noé e a de Lot: ambas achavam-se submetidas a dois dos Nossos servos virtuosos; porém, ambas os atraiçoaram e ninguém pôde defendê-las de Deus. Ser-lhes-á dito: Entrai no fogo, juntamente com os que ali entrarem!",
            "verse 66:11": "E Deus dá, como exemplo aos fiéis, o da mulher do Faraó, a qual disse: Ó Senhor meu, constrói-me, junto a Ti, uma morada no Paraíso, e livra-me do Faraó e das suas ações, e salva-me dos iníquos!",
            "verse 66:12": "E com Maria, filha de Imran, que conservou o seu pudor, e a qual alentamos com o Nosso Espírito, por te acreditado nas palavras do seu Senhor e nos Seus Livros, e por se Ter contado entre os consagrados."
        },
        "Punjabi": {
            "verse 66:1": "ਹੇ ਪੈਗ਼ੰਬਰ! ਤੁਸੀ’ ਕਿਉਂ ਉਸ ਚੀਜ਼ ਨੂੰ ਹਰਾਮ ਕਰਦੇ ਹੋ, ਜਿਹੜੀ ਅੱਲਾਹ ਨੇ ਤੁਹਾਡੇ ਲਈ ਜਾਇਜ਼ ਕੀਤੀ ਹੈ। (ਉਹ ਵੀ) ਆਪਣੀਆਂ ਪਤਨੀਆਂ ਦੀ ਪ੍ਰਸੰਨਤਾ ਪ੍ਰਾਪਤ ਕਰਨ ਲਈ। ਅਤੇ ਅੱਲਾਹ ਵੱਡਾ ਮੁਆਫ਼ੀ ਦੇਣ ਵਾਲਾ ਅਤੇ ਰਹਿਮਤ ਕਰਨ ਵਾਲਾ ਹੈ।",
            "verse 66:2": "ਅੱਲਾਹ ਨੇ ਤੁਹਾਡੇ ਲੋਕਾਂ ਲਈ ਤੁਹਾਡੀਆਂ ਸੌਹਾਂ ਦਾ ਖੋਲਣਾ ਨਿਯਤ ਕਰ ਦਿੱਤਾ ਅਤੇ ਅੱਲਾਹ ਤੁਹਾਡਾ ਕਾਰਸਾਜ਼ ਹੈ। ਅਤੇ ਉਹ ਜਾਣਨ ਵਾਲਾ ਅਤੇ ਹਿਕਮਤ ਵਾਲਾ ਹੈ।",
            "verse 66:3": "ਅਤੇ ਜਦੋਂ ਰਸੂਲ ਨੇ ਆਪਣੀ ਕਿਸੇ ਪਤਨੀ ਨੂੰ ਇੱਕ ਭੇਦ ਦੀ ਗੱਲ ਹੌਲੀ ਜਿਹੀ ਕਹੀ ਤਾਂ ਉਸ ਨੇ ਉਸ ਨੂੰ (ਭੇਦ) ਦੱਸ ਦਿੱਤਾ ਅਤੇ ਅੱਲਾਹ ਨੇ ਪੈਗੰਬਰ ਨੂੰ ਉਸ ਤੋਂ ਜਾਣੂ ਕਰਾ ਦਿੱਤਾ, ਤਾਂ ਪੈਗੰਬਰ ਨੇ ਕੁਝ (ਪਤਨੀ ਨਾਲ ਕੀਤੀਆਂ) ਗੱਲਾਂ ਦੱਸੀਆਂ ਅਤੇ ਕੁਝ ਨਾ ਦੱਸੀਆਂ। ਫਿਰ ਜਦੋਂ ਪੈਗ਼ੰਬਰ ਨੇ ਉਸ ਨੂੰ ਇਹ ਗੱਲ ਦੱਸੀ ਉਸ ਨੇ ਕਿਹਾ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਦੀ ਖ਼ਬਰ ਕਿਸ ਨੇ ਦਿੱਤੀ ਹੈ। ਪੈਗ਼ੰਬਰ ਨੇ ਕਿਹਾ, ਕਿ ਮੈਨੂੰ ਜਾਣਨ ਵਾਲੇ ਤੇ ਬਾ-ਖ਼ਬਰ ਰੱਬ ਨੇ ਦੱਸਿਆ ਹੈ।",
            "verse 66:4": "ਜੇਕਰ ਤੁਸੀਂ ਦੋਵੇ ਅੱਲਾਹ ਵੱਲ ਪਰਤੋਂ’ ਤਾਂ (ਵਧੀਆਂ ਹੈ ਕਿਉਂਕਿ) ਤੁਹਾਡੇ ਦਿਲ ਝੁਕੇ ਹੋਏ ਹਨ ਅਤੇ ਜੇਕਰ ਤੁਸੀਂ ਦੋਵੇਂ ਨਬੀ (ਦੀ ਮੁਸ਼ਕਲ) ਦੇ ਵਿਰੁੱਧ ਕਾਰਵਾਈਆਂ ਕਰੋਗੀਆਂ ਤਾਂ ਉਸ ਦਾ ਦੋਸਤ ਅੱਲਾਹ ਹੈ। ਜਿਬਰਾਈਲ, ਸਦਾਚਾਰੀ ਈਮਾਨ ਵਾਲੇ ਅਤੇ ਇਨ੍ਹਾਂ ਤੋਂ ਸ਼ਿਨਾ ਫਰਿਸ਼ਤੇ ਵੀ ਉਸ ਦੇ ਸਾਥੀ ਹਨ।",
            "verse 66:5": "ਜੇਕਰ ਪੈਗ਼ੰਬਰ ਤੁਹਾਨੂੰ ਸਾਰੀਆਂ ਨੂੰ ਤਲਾਕ ਦੇ ਦੇਣ ਤਾਂ ਉਸ ਦਾ ਰੱਬ ਤੁਹਾਡੇ ਬਦਲੇ ਤੁਹਾਡੇ ਤੋਂ ਬਿਹਤਰ ਪਤਨੀਆਂ ਦੇ ਦੇਵੇਗਾ। ਆਗਿਆਕਾਰੀ, ਸ਼ਰਧਾਵਾਨ, ਤੌਬਾ ਕਰਨ ਵਾਲੀਆਂ, ਇਬਾਦਤ ਕਰਨ",
            "verse 66:6": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਆਪਣੇ ਆਪ ਨੂੰ ਅਤੇ ਆਪਣੇ ਘਰ ਵਾਲਿਆਂ ਨੂੰ ਉਸ ਅੱਗ ਤੋਂ ਬਚਾਉ। ਜਿਸ ਦਾ ਬਾਲਣ ਮਨੁੱਖ ਅਤੇ ਪੱਥਰ ਹੋਣਗੇ। ਉਸ ਤੇ ਸਖ਼ਤ ਸੁਭਾਅ ਦੇ ਬਲਵਾਨ ਫ਼ਰਿਸ਼ਤੇ ਨਿਯੁਕਤ ਹਨ। ਅੱਲਾਹ ਉਨ੍ਹਾਂ ਨੂੰ ਜਿਹੜਾ ਹੁਕਮ ਦੇਵੇ, ਉਹ ਉਸ ਦੀ ਉਲੰਘਣਾ ਨਹੀ ਕਰਦੇ ਹਨ। ਅਤੇ ਉਹ ਉਹ ਹੀ ਕਰਦੇ ਹਨ, ਜਿਸ ਦਾ ਉਨ੍ਹਾਂ ਨੂੰ ਹੁਕਮ ਮਿਲਦਾ ਹੈ।",
            "verse 66:7": "ਹੇ ਇਨਕਾਰੀਓ! ਅੱਜ ਬਹਾਨੇ ਨਾ ਬਣਾਓ। ਤੁਸੀਂ ਉਹੀ ਬਦਲਾ ਪਾ ਰਹੇ ਹੋ ਜਿਹੜਾ ਤੁਸੀਂ ਕਰਦੇ ਸੀ।",
            "verse 66:8": "ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਅੱਲਾਹ ਦੇ ਸਾਹਮਣੇ ਸੱਚੀ ਤੌਬਾ ਕਰੋ। ਉਮੀਦ ਹੈ ਤੁਹਾਡਾ ਰੱਬ ਤੁਹਾਡੇ ਪਾਪ ਮੁਆਫ਼ ਕਰ ਦੇਵੇ ਅਤੇ ਤੁਹਾਨੂੰ ਅਜਿਹੇ ਬਾਗ਼ਾਂ ਵਿਚ ਦਾਖਿਲ ਕਰੇ, ਜਿਨ੍ਹਾਂ ਦੇ ਥੱਲੇ ਨਹਿਰਾਂ ਵਗਦੀਆਂ ਹੋਣਗੀਆਂ। ਜਿਸ ਦਿਨ ਅੱਲਾਹ, ਪੈਗੰਬਰ ਨੂੰ ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਨਾਲ ਈਮਾਨ ਲਿਆਉਣ ਵਾਲਿਆਂ ਨੂੰ ਅਪਮਾਣਿਤ ਨਹੀਂ ਕਰੇਗਾ। ਉਨ੍ਹਾਂ ਦਾ ਪ੍ਰਕਾਸ਼ ਉਨ੍ਹਾਂ ਦੇ ਅੱਗੇ ਅਤੇ ਸੱਜੇ- ਖੱਬੇ ਦੌੜ ਰਿਹਾ ਹੋਵੇਗਾ, ਉਹ ਆਖ ਰਹੇ ਹੋਣਗੇ ਕਿ ਹੇ ਸਾਡੇ ਪਾਲਣਹਾਰ! ਸਾਡੇ ਲਈ ਸਾਡੇ ਪ੍ਰਕਾਸ਼ ਨੂੰ ਪੂਰਨ ਕਰ ਦੇਵੋ ਅਤੇ ਸਾਨੂੰ ਮੁਆਫ਼ ਕਰ ਦਿਉ। ਬੇਸ਼ੱਕ ਤੂੰ ਹਰ ਚੀਜ਼ ਦੀ ਸਮਰੱਥਾ ਰਖਦਾਂ ਹੈ।",
            "verse 66:9": "ਹੇ ਪੈਗੰਬਰ! ਅਵੱਗਿਆਕਾਰੀਆਂ ਅਤੇ ਧੋਖੇਬਾਜ਼ਾਂ ਨਾਲ ਯੁੱਧ ਕਰੋ। ਅਤੇ ਉਨ੍ਹਾਂ ਤੇ ਸਖ਼ਤੀ ਕਰੋਂ। ਉਨ੍ਹਾਂ ਦਾ ਟਿਕਾਣਾ ਨਰਕ ਹੈ ਅਤੇ ਇਹ ਬੁਰਾ ਟਿਕਾਣਾ ਹੈ।",
            "verse 66:10": "ਅੱਲਾਹ, ਅਵੱਗਿਆਕਾਰੀਆਂ ਲਈ ਨੂਹ ਦੀ ਪਤਨੀ ਦੀ ਅਤੇ ਲੂਤ ਦੀ ਪਤਨੀ ਦੀ ਮਿਸਾਲ ਬਿਆਨ ਕਰਦਾ ਹੈ। ਦੋਵੇ ਸਾਡੇ ਬੰਦਿਆਂ ਵਿਚੋਂ ਨੇਕ ਬੰਦਿਆਂ ਦੀਆਂ ਪਤਨੀਆਂ ਸਨ। ਫਿਰ ਉਨ੍ਹਾਂ ਨੇ ਉਨ੍ਹਾਂ ਦੇ ਨਾਲ ਧੋਖਾ ਕੀਤਾ, ਤਾਂ ਉਹ ਦੋਵੇ ਅੱਲਾਹ ਦੇ ਮੁਕਾਬਲੇ ਵਿਚ ਉਨ੍ਹਾਂ ਦੇ ਕੁਝ ਕੰਮ ਨਾ ਆ ਸਕੇ। ਅਤੇ ਦੋਵਾਂ ਨੂੰ ਆਖ ਦਿੱਤਾ ਗਿਆ ਕਿ ਅੱਗ ਵਿਚ ਦਾਖ਼ਿਲ ਹੋ ਜਾਵੋ। ਦਾਖਿਲ ਹੋਣ ਵਾਲਿਆਂ ਦੇ ਨਾਲ।",
            "verse 66:11": "ਅਤੇ ਅੱਲਾਹ ਈਮਾਨ ਵਾਲਿਆਂ ਲਈ ਫਿਰਔਨ ਦੀ ਪਤਨੀ ਦੀ ਮਿਸਾਲ ਬਿਆਨ ਕਰਦਾ ਹੈ। ਜਦੋਂ ਉਸ ਨੇ ਆਖਿਆ ਕਿ ਹੇ ਮੇਰੇ ਪਾਲਣਹਾਰ! ਮੇਰੇ ਲਈ ਆਪਣੇ ਕੋਲ ਜੰਨਤ ਵਿਚ ਇੱਕ ਘਰ ਬਣਾ ਦੇ। ਅਤੇ ਮੈਨੂੰ ਫਿਰਔਨ ਅਤੇ ਉਸ ਦੇ ਕਰਮਾ ਤੋਂ ਬਚਾ। ਅਤੇ ਮੈਨੂੰ ਅੱਤਿਆਚਾਰੀ ਕੌਮ ਤੋਂ ਛੁਟਕਾਰਾ ਦਿਵਾ।",
            "verse 66:12": "ਅਤੇ ਇਮਾਰਾਨ ਦੀ ਬੇਟੀ ਮਰੀਅਮ ਜਿਸ ਨੇ ਆਪਣੀ ਇੱਜ਼ਤ ਦੀ ਰਖਿਆ ਕੀਤੀ, ਫਿਰ ਅਸੀ ਉਸ ਵਿਚ ਆਪਣੀ ਆਤਮਾ ਫੂਕ ਦਿੱਤੀ ਅਤੇ ਉਸ ਨੇ ਆਪਣੇ ਰੱਬ ਦੀ ਬਾਣੀ ਦੀ ਅਤੇ ਉਸ ਦੀਆਂ ਕਿਤਾਬਾਂ ਦੀ ਪੁਸ਼ਟੀ ਕੀਤੀ ਅਤੇ ਉਹ ਆਗਿਆਕਾਰੀਆਂ ਵਿਚੋਂ ਸੀ।"
        },
        "Roman english": {
            "verse 66:1": "Yaaa ayyuhan nabiyyu lima tuharrimu maaa ahallal laahu laka tabtaghee mardaata azwaajik; wallaahu ghafoorur raheem",
            "verse 66:2": "Qad faradal laahu lakum tahillata aymaanikum; wallaahu mawlaakum wa huwal`aleemul hakeem",
            "verse 66:3": "Wa iz asarran nabiyyu ilaa ba`di azwaajihee hadeesan falammaa nabba at bihee wa azharahul laahu `alaihi `arrafa ba`dahoo wa a`rada `am ba`din falammaa nabba ahaa bihee qaalat man amba aka haaza qaala nabba aniyal `aleemul khabeer",
            "verse 66:4": "In tatoobaaa ilal laahi faqad saghat quloobukumaa wa in tazaaharaa `alihi fa innal laaha huwa mawlaahu wa jibreelu wa saalihul mu`mineen; walma laaa`ikatu ba`dazaalika zaheer",
            "verse 66:5": "Asaa rabbuhooo in tallaqakunna anyyubdilahooo azwaajan khairam mnkunna muslimaatim mu`minaatin qaanitaatin taaa`ibaatin `aabidaatin saaa`ihaatin saiyibaatinw wa abkaaraa",
            "verse 66:6": "Yaaa ayyuhal lazeena samanoo qooo anfusakum wa ahleekum naaranw waqoodu han naasu wal hijaaratu `alaihaa malaaa`ikatun ghilaazun shidaadul laa ya`soonal laaha maa amarahum wa yaf`aloona maa yu`maroon",
            "verse 66:7": "Yaaa ayyuhal lazeena kafaroo la ta`tazinul yawma innamaa tujzawna maa kuntum ta`maloon",
            "verse 66:8": "Yaaa ayyuhal lazeena aammano toobooo ilal laahi tawbatan nasoohan `asaa rabbukum any-yukaffira `ankum sayyi aatikum wa yudkhilakum jannaatin tajree min tahtihal anhaaru yawma laa yukhzil laahun nabiyya wallazeena aamanoo ma`ahoo nooruhum yas`aa baina aydeehim wa bi aymaanihim yaqooloona rabbanaaa atmim lanaa nooranaa waghfir lana innaka `alaa kulli shai`in qadeer",
            "verse 66:9": "yaaa ayyuuhan nabiyyu jaahidil kuffaara walmunaa-fiqeena waghluz `alaihim; wa maawaahum jahannamu wa bi`sal maseer",
            "verse 66:10": "Darabal laahu masalal lillazeena kafarum ra ata Noobinw wamra ata Loot, kaanataa tahta `abdaini min `ibaadinaa saalihaini fakhaanataahumaa falam yughniyaa `anhumaa minal laahi shai anw-wa qeelad khulan naara ma`ad Daakhileen",
            "verse 66:11": "Wa darabal laahu masa lal-lillazeena aamanumra ata Fir`awn; iz qaalat rabbibni lee `indaka baitan fil jannati wa najjinee min Fir`awna wa `amalihii wa najjinee minal qawmiz zaalimeen",
            "verse 66:12": "Wa Maryamab nata `Imraanal lateee ahsanat farjahaa fanafakhnaa feehi mir roobinaa wa saddaqat bikali maati Rabbihaa wa Kutubihee wakaanat minal qaaniteen"
        },
        "Russian": {
            "verse 66:1": "О пророк! Зачем ты запрещаешь себе то, Что разрешил тебе Господь, Ища расположенья жен своих? Господь ведь милостив и всепрощающ!",
            "verse 66:2": "Господь для вас позволил клятвы расторгать, Он - Покровитель ваш, Всеведущий и мудрый.",
            "verse 66:3": "Когда одной из жен своих Пророк поверил тайну, Она передала ее другой. Аллах ему об этом сообщил. (Пророк) часть (сказанного) подтвердил, А часть - отверг. И вот когда сказал он ей об этом, Она спросила: \"Кто сообщил тебе?\" Ответил он: \"Сказал мне Тот, Кто ведает и знает обо всем\".",
            "verse 66:4": "И если обе вы к Аллаху в раскаянии обратитесь - А ведь уже склонились к этому ваши сердца, - (Он вам, поистине, простит). Но если вы, потворствуя друг другу, Против (пророка Моего) пойдете, То, истинно, Аллах - его защитник, И Джибраил, и каждый справедливый из принявших веру, И даже ангелы потом придут ему на помощь.",
            "verse 66:5": "А коль пророк вам даст развод, Возможно, что Господь Взамен вас лучших жен ему пошлет, Которые Аллаху предалИсь в раскаянии должном, Живут в смирении и благочестье И совершают Хадж, посты блюдут, - Будь то девицы или вдовы.",
            "verse 66:6": "О вы, кто верует! Уберегите и себя, и семьи ваши от Огня, Для коего растопкой будут люди и каменья, Над коим ангелы - суровы, непреклонны - Не нарушают то, что повелел Аллах, И исполняют все, что Он прикажет.",
            "verse 66:7": "(И будут говорить они): \"О вы, неверные! Сегодня вы не извиняйтесь,- Вам ныне воздается лишь за то, Чем вы грешили в жизни ближней\".",
            "verse 66:8": "О вы, кто верует! Вы обратитесь в искреннем раскаянье к Аллаху! Быть может, ваш Господь Очистит вас от дел греховных, Введет в Сады, реками омовенны, - В тот День, Когда Аллах посланника и тех, которые уверовали с ним, (Не оскорбит) и не унизит. Пред ними и по праву сторону от них Струиться будет (чистый) Свет. И будут говорить они: \"Господь наш! Сделай совершенным Свет для нас и ниспошли прощенье, - Ведь Ты всесилен над всея!\"",
            "verse 66:9": "О пророк! Веди суровую борьбу Ты с лицемерами и с теми, кто не верует (в Аллаха), И против них непримиримым будь. Жилищем им предстанет Ад - Приют зловещий для неверных.",
            "verse 66:10": "Аллах в пример приводит для не верующих (в Бога) Жену пророка Нуха и жену пророка Лута. Ведь они обе были за рабами из праведных Господних слуг И обе стали вероломны, И перед Господом ничто их не спасло, И было велено: \"Войдите обе в Огнь вместе с остальными!\"",
            "verse 66:11": "И предлагает праведным Аллах в пример Жену (египетского) Фараона. И молвила она: \"О мой Господь! Ты водрузи в Своем Раю мне дом, Избавь меня от Фараона и его деяний, Спаси меня от нечестивых\".",
            "verse 66:12": "(А также) и Марйам, Имрана дочь, Что сохранила девственную плоть. И Мы от духа Нашего в нее вдохнули. И истиной сочла она Слова Господни и Его Писанье И стала из благочестивых."
        },
        "Sindhi": {
            "verse 66:1": "اي پيغمبر جنھن شيءِ کي الله تولاءِ حلال ڪيو آھي سا ڇو ٿو حرام ڪرين؟ پنھنجين زالن جو راضپو گھرين ٿو، ۽ الله بخشڻھار مھربان آھي.",
            "verse 66:2": "بيشڪ الله اوھان لاءِ اوھان جي قسمن جو کولڻ درست ڪيو آھي، ۽ الله اوھان جو سائين آھي، ۽ اُھو ڄاڻندڙ حِڪمت وارو آھي.",
            "verse 66:3": "۽ (ياد ڪر) جڏھن پيغمبر پنھنجين زالن مان ڪنھن ھڪڙي کي ڪا ڳالھ ڳجھي چئي، پوءِ جڏھن اُن (ڳالھ) کي اُن (بي بيءَ) پڌرو ڪيو ۽ الله پيغمبر کي اُن (ڳجھي ڳالھ جي پڌري ڪرڻ) تي واقف ڪيو (تڏھن) پيغمبر ڪُجھ اُھا (ڳالھ بي بيءَ کي) ڄاڻائي ڪجھ چوڻ کان ٽارو ڪيائين، پوءِ جڏھن اُن (بي بيءَ) کي ڳجھيءَ ڳالھ (جي پڌري ڪرڻ) کان واقف ڪيائين (تڏھن) اُن (بي بي) چيو ته اھا توکي ڪنھن ڄاڻائي، (پيغمبر) فرمايو ته مون کي (الله) ڄاڻندڙ خبر رکندڙ خبر ڏني.",
            "verse 66:4": "(اي پيغمبر جون زالون) جيڪڏھن اوھين ٻئي الله وٽ توبه ڪنديون ته بيشڪ اوھان جي دلين لاڙو ڪيو آھي، ۽ جيڪڏھن پيغمبر (جي ايذائڻ تي ٻئي گڏجي ڏاڍ ڪنديون ته بيشڪ الله سندس ڀرجھلو آھي ۽ جبرئيل ۽ سُڌريل مؤمن (به)، ۽ ھن کانپوءِ ملائڪ (به) مددگار آھن.",
            "verse 66:5": "جيڪڏھن پيغمبر اوھان کي طلاق ڏيندو ته اميد آھي ته سندس پالڻھار اوھان کان چڱيون زالون فرمانبردار مؤمنياڻيون نماز پڙھڻ واريون توبه ڪرڻ واريون عبادت ڪرڻ واريون رنيلان ۽ ڪنواريون (ٻيون) ان کي عوض ۾ ڏيندو.",
            "verse 66:6": "اي ايمان وارؤ پاڻ کي پنھنجي گھر جي ڀاتين کي انھيءَ باھ کان بچايو جنھن جو ٻارڻ ماڻھو ۽ پھڻ ھوندا جنھن (باھ) تي سخت طبع زبردست ملائڪ (مُقرر) آھن جيڪي (الله) کين فرمايو آھي تنھن ۾ الله جي نافرماني نه ڪندا آھن ۽ جيڪي کين حُڪم ڪبو آھي سو ڪندا آھن.",
            "verse 66:7": "(ان ڏينھن چئبو ته) اي ڪافرؤ اڄ بھانو (پيش) نه ڪريو، جيڪي ڪندا ھئو رڳو تَنھنجي اوھان کي سزا ڏجي ٿي.",
            "verse 66:8": "اي ايمان وارؤ الله وٽ توبه ڪريو سچي توبه، اوھان جي پالڻھار ۾ اميد آھي ته اوھان جون مدايون اوھان کان ميٽيندو ۽ اوھان کي (اھڙن) باغن ۾ داخل ڪندو جن جي ھيٺان واھيون وھنديون آھن جنھن ڏينھن جو الله پيغمبر کي ۽ جن ساڻس ايمان آندو آھي تن کي خوار نه ڪندو، سندن (ايماني) نُور سندن اڳيان ۽ سندن سڄن پاسن ۾ ڊوڙندو چوندا (ته) اي اسان جا پالڻھار اسان لاءِ اسان جو نُور ڀرپور ڪر ۽ اسان کي بخش، بيشڪ تون سڀڪنھن شيءَ تي وس وارو آھين.",
            "verse 66:9": "اي پيغمبر ڪافرن ۽ منافقن سان لڙائي ڪر ۽ مٿن سختي ڪر، ۽ سندن جاءِ دوزخ آھي، ۽ اُھو ھنڌ بڇڙو آھي.",
            "verse 66:10": "الله نُوح جي زال ۽ لُوط جي زال جو ھڪ مثال ڪافرن لاءِ بيان ڪري ٿو، (اُھي) اسان جي ٻن صالحن ٻانھن (جي نڪاح) ھيٺ ھيون پوءِ اُنھن زالن ٻنھي سان خيانت ڪئي ۽ پوءِ اُھي ٻئي (پنھنجين) زالن کان الله جو عذاب ڪجھ به ٽاري نه سگھيا (انھن کي) چئبو ته باھ ۾ گھڙندڙن سان گڏ گھڙو.",
            "verse 66:11": "۽ الله مؤمنن لاءِ فرعون جي زال جو ھڪ مثال بيان ڪري ٿو، جڏھن چيائين ته اي منھنجا پالڻھار پاڻ وٽ بھشت ۾ مون لاءِ ڪو گھر ٺاھ ۽ فرعون ۽ سندس ڪم کان مون کي بچاءِ ۽ ظالمن جي ٽوليءَ کان (پڻ) مون کي بچاءِ.",
            "verse 66:12": "۽ مَرۡيم ڌِيءُ عِمۡران جي جنھن پنھنجي اُگھڙ کي بچايو پوءِ اُن (جي رحم) ۾ پنھنجو رُوح ڦوڪيوسون ۽ پنھنجي پالڻھار جي حُڪمن ۽ سندس ڪتابن کي سچ ڄاتو ھوائين ۽ فرمانبردارن مان ھُئي."
        },
        "Sinhalese": {
            "verse 66:1": "අහෝ නබිවරය! නුඹ නුඹගේ බිරියන්ගේ තෘප්තිය සොයමින් නුඹට අල්ලාහ් අනුමත කළ දෑ නුඹ තහනම් කර ගනුයේ ඇයි? තවද අල්ලාහ් අති ක්ෂමාශීලීය; මහා කරුණාන්විතය.",
            "verse 66:2": "නුඹලාගේ දිවුරුම් වලින් මිදීමේ ක්රමයක් අල්ලාහ් නුඹලාට නියම කළේය. තවද අල්ලාහ් නුඹලාගේ ආරක්ෂකය. තවද ඔහු සර්ව ඥානී ය; මහා ප්‍රඥාවන්ත ය.",
            "verse 66:3": "නබිවරයා ඔහුගේ බිරියන්ගෙන් ඇතැමෙකුට කතාවක් රහසින් කියූ අවස්ථාවේ එක් බිරියකු (අන් අය වෙත) එය දන්වා සිටි කල්හි (මෙසේ රහස හෙළිදරව් වීම) අල්ලාහ් එය නබිවරයා වෙත හෙළි කළේය. ඉන් කොටසක් නබිවරයා ඇයට දන්වා සිට කොටසක් නොසලකා හැරියේය. ඔහු එය ඇයට දන්වා සිටි කල්හි “මෙය ඔබට දන්වා සිටියේ කවුදැයි” ඇය ඇසුවාය. “අභිඥානවන්තවූ සර්ව ඥානියාණෝ මට දැනුම් දුන්නේය”යැයි ඔහු පැවසීය.",
            "verse 66:4": "(නබිවරයාගේ භාර්යාවන් වන) නුඹලා දෙදෙනාම අල්ලාහ් වෙත පශ්චාත්තාප වූවා නම් (මැනවි!) හේතුව නුඹලා දෙදෙනාගේ හදවත් සැබැවින්ම විතැන් වී ඇත. ඔහුට එරෙහි ව නුඹලා දෙදෙනා එකිනෙකාට උර දුන්නෙහු නම් එවිට (දැනගනු!) නියත වශයෙන්ම අල්ලාහ් වන ඔහු ඔහුගේ භාරකරුය. ඉන් පසු ව ජිබ්රීල් ද දේව විශ්වාසවන්තයින්ගෙන් දැහැමියා ද මලක්වරු ද උර දෙන්නන්ය.",
            "verse 66:5": "ඔහු නුඹලා ව දික්කසාද කළේ නම් නුඹලාට වඩා යහපත් අවනත වන, විශ්වාස කරන, යටහත් වන, පාප ක්ෂමාවෙහි නිරත වන, නැමදුම් කරන, උපවාසයේ නිරත වන, වැන්දඹුවන් හා කන්යාවියන් බිරියන් වශයෙන් ඔහුගේ පරමාධිපති ඔහුට වෙනස් කර දෙන්නට පුළුවණ.",
            "verse 66:6": "අහෝ දේවත්වය විශ්වාස කළවුනි! නුඹලා හා නුඹලාගේ පවුල (නිරා) ගින්නෙන් ආරක්ෂා කර ගනු. එහි ඉන්ධන මිනිසුන් හා ගල්ය. එහි දරුණු කුරිරු මලක්වරුන් වෙති. අල්ලාහ් ඔවුනට අණ කරන දෑ සම්බන්ධයෙන් ඔවුහු ඔවුහු පිටු නොපාති. තවද ඔවුනට අණ කරනු ලබන දෑ ඔවුහු (එලෙසම) ඉටු කරති.",
            "verse 66:7": "අහෝ දේවත්වය ප්‍රතික්ෂේප කළවුනි! අද දින නුඹලා නිදහසට කරුණු නොදක්වනු. නියත වශයෙන්ම නුඹලාට ප්‍රතිඵල වශයෙන් පිරිනමනු ලබනුයේ නුඹලා සිදු කරමින් සිටි දෑය.",
            "verse 66:8": "අහෝ දේවත්වය විශ්වාස කළවුනි! අල්ලාහ් වෙත අවංක පශ්චාත්තාපයකින් පශ්චාත්තාප වී යොමු වනු. නුඹලාගේ පරමාධිපති නුඹලාගේ පාපයන් නුඹලාගෙන් පහ කොට ඒවාට පහළින් ගංගාවෝ ගලා බස්නා (ස්වර්ග) උයන් වලට නුඹලා ව ඇතුළත් කරන්නට පුළුවණ. එදින නබිවරයාට හා ඔහු සමග වූ විශ්වාස කළවුනට අල්ලාහ් අවමන් නොකරයි. ඔවුන්ගේ ආලෝකය ඔවුන් ඉදිරිපසින් ද ඔවුන්ගේ දකුණුපසින් ද දිව යයි. “අපගේ පරමාධිපතියාණනි! අපගේ ආලෝකය අපට පූර්ණවත් කර දෙනු මැනව! තවද අපහට සමාව දෙනු මැනව! නියත වශයෙන්ම නුඹ සියලු දෑ කෙරෙහි ශක්තිය ඇත්තාය.” යැයි ඔවුන් පවසනු ඇත.",
            "verse 66:9": "අහෝ නබිවරය! දේවත්වය ප්‍රතික්ෂේප කරන්නන් හා කුහකයින් සමග නුඹ අරගල කරනු. තවද ඔවුනට එරෙහි ව දැඩි ව කටයුතු කරනු. තවද ඔවුන්ගේ නවාතැන නිරයයි. තවද යොමු වන ස්ථානය නපුරු විය.",
            "verse 66:10": "නූහ්ගේ බිරිය හා ලූත්ගේ බිරිය ප්‍රතික්ෂේප කළවුන් සඳහා උපමාවක් ලෙස අල්ලාහ් ඉදිරිපත් කළේය. ඔවුන් දෙදෙනා අපගේ දැහැමි ගැත්තන් අතරින් ගැත්තන් දෙදෙනෙකු යටතේ වූහ. නමුත් ඔවුන් දෙදෙනා මොවුන් (සැමියන්) දෙදෙනා ට ද්‍රෝහි වූවෝය. එවිට අල්ලාහ්ගෙන් වූ කිසිවකින් ඔවුන් දෙදෙනා වෙනුවෙන් කිසිදු සෙතක් සැලසිය නොහැකි විය. තවද නුඹලා පිවිසෙන්නන් සමග නිරයට පිවිසෙනු යැයි කියනු ලැබීය.",
            "verse 66:11": "තවද විශ්වාස කළවුන් සදහා උපමාවක් ලෙස අල්ලාහ් ෆිර්අවුන්ගේ බිරිය ඉදිරිපත් කළේය. “මාගේ පරමාධිපතියාණනි! නුඹ අබියස (ස්වර්ග) උයනේ නිවසක් මා වෙනුවෙන් ඉදි කර දෙනු මැනව! තවද ෆිර්අවුන්ගෙන් ද ඔහුගේ (නපුරු) ක්‍රියාවෙන් ද මා මුදවා ගනු මැනව! තවද අපරාධකාරී ජනයාගෙන් මා මුදවා ගනු මැනව!” යැයි ඇය පවසා සිටියාය.",
            "verse 66:12": "තවද තම පතිවත සුරක්ෂා කර ගත් ඉම්රාන්ගේ දියණිය වූ මර්යම් (ගේ උපමාව ද ගෙන හැර දක්වීය.) අපගේ ආත්මයෙන් ඒ වෙත අපි පිඹුවෙමු. තවද ඇයගේ පරමාධිපතිගේ වදන් හා ඔහුගේ ග්‍රන්ථ ඇය තහවුරු කළාය. තවද ඇය අවනතක වන්නන් අතරින් වූවාය."
        },
        "Somali": {
            "verse 66:1": "Nibiyow maxaad u xarrimi wax Eebe kuu xalaaleeyey si aad u raalli geliso Haweenkaaga, Eebe waa dambi dhaafe naxariista ah.",
            "verse 66:2": "Eebe waa idiin caddeeyey waxa dhaartiinnu ku xalaaloobi, Eebena waa gargaarihiinna, waana wax walba oge falsan.",
            "verse 66:3": "Ma xusuusan Waqtigii Nabigu ku qarsaday Haweenkiisa Qaarkood hadal, markaas ay ka warrantay xaalkii, Eebana uu Nabiga u daahiriyey, markaas Nabigu uu ogeysiiyey qaarkiis (haweenaydii) qaarna uu ka dhaafay, markuu u warramay ay tiri yaa kuu sheegay xaalkan kuna yiri: waxaa ii warramay Eebaha wax walba oge ah ee yaqaana.",
            "verse 66:4": "Haddaad Eebe u noqotaan inkastoo qalbigiinnu iishay (Eebe wuu idiin dhaafi) haddaadse isu kaalmaysataan Nabiga (dhibkiisa) waxaa u gargaari Eebe, Jibriil iyo kuwa suuban ee Mu'miniinta ah Malaa'igta (kalana) markaas ka dib yey xoojin.",
            "verse 66:5": "Wuxuu Eebe u dhawyahay in Nabigu hadduu idin furo (Haweenka Nabiga qaarkood) idiinkuna beddelo kuwa idinka khayr roon oo ah Muslimiin, Mu'miniin ah adeeca Eebe, Toobad keena, Eeba caabuda, Soomana kuwa horay loo guursaday iyo kuwo aan hadda ka hor la guursanba leh.",
            "verse 66:6": "Kuwa xaqa rumeeyow ka dhawra Naftiina iyo ehelkiinna naar lagu shido dad iyo dhagax ay kana (shaqeeyaan) malaa'ig adag oo daran oon Eebe ku caasiyeyn wuxuu faro, falana wixii la amru.",
            "verse 66:7": "Kuwa Gaaloobow ha cudur daaranina maanta (Qiyaamada) waxaa laydinka abaal marin uun waxaad camal fali jirteen.",
            "verse 66:8": "Kuwa xaqa rumeeyow u toobad keena Eebe toobad san, wuxuu Eebe u dhawyahay inuu asturo xumaantiina, idin geliyana Jannooyin ay dureerayso dhexdooda Wabiyaal, Maalinta uusan Eebe hoojinayn Nabiga iyo kuwa la jooga, nuurkooduna wuxuu socon hortooda iyo midigtooda iyagoo dhihi Eebow noo tam yeel Nuurkanaga noona dambi dhaaf'adaa wax walba karee.",
            "verse 66:9": "Nabiyow la jihaad gaalada iyo Munaafiqiinta kuna adkow, hoygooduna waa Jahannamo meel loo ahaadana iyadaa u xune.",
            "verse 66:10": "Eebe wuxuu tusaale uga dhigay kuwa Gaaloobay Haweenaydii Nabi Nuux iyo Nabi Luudh, waxa qabay Laba Addoon oo Eebe oo suusuuban, markaasay khiyaameen Nabiyadaas waxbana ugama ayan tarin Eebe agtiis waxaana loo dhihi Labadaas haweenay la gala naarta kuwa gelaya.",
            "verse 66:11": "Waxaa kale oo Eebe Tusaale uga dhigay kuwa rumeeyey Haweenaydii Fircoon markay tidhi Eebbow Guri agtaada iiga dhis jannada dhexdeeda, igana nabad geli Fircoon iyo Camalkiisa, igana nabad geli dadkaas daaliminta ah.",
            "verse 66:12": "Maryama bintu cimraanna xusuusta ee isdhawrtay, markaas malagu jeebka ka afuufay, rumaysayna Sharciga Eebe iyo Kutubtiisaba, kana mid noqotay kuwa Eebe adeeca."
        },
        "Spanish": {
            "verse 66:1": "Profeta! Por qué te prohíbes lo que Allah ha hecho lícito para ti, buscando el agrado de tus esposas, cuando Allah es Perdonador y Compasivo?",
            "verse 66:2": "Allah os ha prescrito cómo debéis compensar los juramentos.Allah es vuestro Dueño y Él es el Conocedor, el Sabio.",
            "verse 66:3": "Y cuando el Profeta confió un secreto a una de su esposas y ella lo contó. Allah hizo que se enterara de ello y él después refirió una parte y omitió otra. Cuando se lo hizo saber a ella, ésta dijo: Quién te lo ha dado a conocer? Dijo: Me lo ha dado a conocer el Omnisciente, Aquel al que nada se le oculta.",
            "verse 66:4": "Si ambas os volvéis a Allah en arrepentimiento, ya que vuestros corazones se habían torcido... Pero si os confabuláis contra él... Allah es su defensor y Yibril y los creyentes justos. Y además de ello lo asisten los ángeles.",
            "verse 66:5": "Puede que si las divorciara, su Señor le diera a cambio esposas mejores que ellas. Musulmanas, creyentes, obedientes, de fácil arrepentimiento, adoradoras fervientes y ayunantes, ya hubieran estado casadas antes o fueran vírgenes.",
            "verse 66:6": "Vosotros que creéis! Guardaos a vosotros mismos y a vuestra gente de un fuego cuyo combustible serán los hombres y las piedras. Sobre él habrá ángeles duros y violentos que no desobedecerán a Allah en lo que les ordene, sino que harán lo que se les ordene.",
            "verse 66:7": "Vosotros que os negáis a creer! No os excuséis hoy, no se os pagará sino por lo que hicisteis.",
            "verse 66:8": "Vosotros que creéis! Volveos a Allah sinceramente para que vuestro Señor cubra vuestras maldades y os haga entrar en jardines por cuyo suelo corren los ríos.El día en que Allah no humillará ni al Profeta ni a los que hayan creído con él.Su propia luz correrá delante de ellos y a su derecha. Dirán: Señor nuestro! Colma nuestra luz y perdónanos, realmente Tú tienes poder sobre todas las cosas.",
            "verse 66:9": "Profeta! Lucha contra los que se niegan a creer y contra los hipócritas y sé duro con ellos.Su refugio es Yahannam. Qué mal lugar de destino!",
            "verse 66:10": "Allah les pone un ejemplo a los que se niegan a creer: La mujer de Nuh y la mujer de Lut, ambas estuvieron bajo dos de nuestros siervos justos y ambas los traicionaron.Pero no les sirvió de nada ante Allah y se dijo: Entrad en el Fuego en compañía de los que han de entrar.",
            "verse 66:11": "Y Allah les pone un ejemplo a los que creen: La mujer de Firaún cuando dijo: Señor mío! Haz para mí una casa, junto a Ti, en el Jardín, y sálvame de Firaún y de sus actos; y sálvame de la gente injusta.",
            "verse 66:12": "Y Maryam, la hija de Imrán, la que guardó su vientre, e insuflamos en él parte de Nuestro espíritu.Y la que creyó en la verdad de las palabras de su Señor y en Su libro y fue de las obedientes."
        },
        "Swahili": {
            "verse 66:1": "Ewe Nabii! Kwa nini unaharimisha alicho kuhalilishia Mwenyezi Mungu? Unatafuta kuwaridhi wake zako. Na Mwenyezi Mungu ni Mwenye kusamehe, Mwenye kurehemu.",
            "verse 66:2": "Hakika Mwenyezi Mungu kakupeni Sharia ya kufungua viapo vyenu, na Mwenyezi Mungu ni Mola wenu. Na Yeye ni Mwenye kujua, Mwenye hikima.",
            "verse 66:3": "Na Nabii alipo mwambia mmoja wa wake zake jambo la siri. Basi alipo litangaza yule mke, na Mwenyezi Mungu akamdhihirishia Mtume, alimjuvya sehemu na akaacha sehemu nyengine. Alipo mwambia hayo, huyo mke akasema: Nani aliye kwambia haya? Mtume akasema: Kaniambia Mjuzi Mwenye khabari zote!",
            "verse 66:4": "Kama nyinyi wawili hamkutubia kwa Mwenyezi Mungu, basi nyoyo zenu zimekwisha elekea huko. Na mkisaidiana dhidi yake (Mtume), basi hakika Mwenyezi Mungu ndiye kipenzi chake, na Jibrili, na Waumini wema, na zaidi ya hayo Malaika pia watasaidia.",
            "verse 66:5": "Asaa Mola wake Mlezi, akikupeni talaka, akampa wake wengine badala yenu nyinyi, walio bora kuliko nyinyi, wanynyekevu, Waumini, wat'awa, walio tubu, wenye kushika ibada, wafanyao kheri, wajane na wanawari.",
            "verse 66:6": "Enyi mlio amini! Jilindeni nafsi zenu na ahali zenu na Moto ambao kuni zake ni watu na mawe. Wanausimamia Malaika wakali, wenye nguvu, hawamuasi Mwenyezi Mungu kwa anayo waamrisha, na wanatenda wanayo amrishwa.",
            "verse 66:7": "Enyi mlio kufuru! Msilete udhuru leo. Hakika mnalipwa mliyo kuwa mkiyatenda.",
            "verse 66:8": "Enyi mlio amini! Tubuni kwa Mwenyezi Mungu toba iliyo ya kweli! Asaa Mola wenu Mlezi akakufutieni maovu yenu na akakuingizeni katika Pepo zipitazo mito kati yake, siku ambayo Mwenyezi Mungu hatamdhalilisha Nabii na walio amini pamoja naye. Nuru yao inakwenda mbele yao na pande zao za kulia, na huku wanasema: Mola wetu Mlezi! Tutimilizie nuru yetu, na utughufirie! Hakika Wewe ni Mwenye uweza juu ya kila kitu.",
            "verse 66:9": "Ewe Nabii! Pambana na makafiri na wanaafiki, na kuwa mgumu kwao! Na makaazi yao ni Jahannamu. Na hayo ni marejeo mabaya.",
            "verse 66:10": "Mwenyezi Mungu amewapigia mfano walio kufuru: mke wa Nuhu na mke wa Lut'i. Walikuwa chini ya waja wetu wema wawili miongoni mwa waja wetu. Lakini wakawakhuni waume zao, nao wasiwafae kitu. Na ikasemwa: Ingieni Motoni pamoja na wanao ingia!",
            "verse 66:11": "Na Mwenyezi Mungu amewapigia mfano walio amini - mkewe Firauni, alipo sema: Mola wangu Mlezi! Nijengee kwako nyumba Peponi, na uniokoe na Firauni na vitendo vyake, na uniokoe na watu madhaalimu.",
            "verse 66:12": "Na Mariamu binti wa Imrani, aliye linda ubikira wake, na tukampulizia humo kutoka roho yetu, na akayasadiki maneno ya Mola wake Mlezi na Vitabu vyake, na alikuwa miongoni mwa wat'iifu."
        },
        "Swedish": {
            "verse 66:1": "PROFET! Varför pålägger du [dig själv] - i en önskan att vara dina hustrur till lags - förbud mot det som Gud har förklarat tillåtet för dig? Gud är ständigt förlåtande, barmhärtig.",
            "verse 66:2": "Gud har tillåtit er att frångå eder [vars innehåll strider mot lag och rätt] och att plikta för detta. Gud är er Beskyddare och Han är den Allvetande, den Allvise.",
            "verse 66:3": "Det hände att Profeten i förtroende berättade något för en av sina hustrur och hon förde det vidare; när Gud lät honom veta detta nämnde han något om det [till andra] men undanhöll [en del]. Då han sade det till henne frågade hon: \"Vem har låtit dig veta det?\" - och han svarade: \"Han som vet allt, är underrättad om allt, har låtit mig veta det.\"",
            "verse 66:4": "[Det är bäst för er båda] att ni vänder åter till Gud i ånger över [ert handlingssätt], eftersom era hjärtan har avvikit [från pliktens väg]! Om ni gör gemensam sak mot honom [bör ni veta att] Gud är hans Beskyddare och att därför också Gabriel och de främsta bland de troende och [alla] änglar står vid hans sida.",
            "verse 66:5": "Om [Profeten] skulle förskjuta er skänker honom kanske hans Herre bättre hustrur än ni - kvinnor som underkastar sig Guds vilja, sanna troende, ödmjuka inför Gud, som ångrar [sina synder] och troget tillber sin Herre, och som ständigt går [Guds ärenden] - förut gifta eller ungmör.",
            "verse 66:6": "TROENDE! För er egen skull och för deras som står er nära bör ni frukta den Eld som har människor och stenar till bränsle, och som mäktiga och stränga änglar [vakar över, änglar] som aldrig brister i lydnad för Gud, vad Han än befaller dem, och som utför allt som åläggs dem.",
            "verse 66:7": "\"Urskulda er inte denna Dag, ni envisa förnekare av sanningen! Ni skall lönas enbart för det som ni gjorde [i livet].\"",
            "verse 66:8": "Troende! Vänd er i uppriktig ånger [över era synder] till Gud! Kanske skall er Herre ur er [bok] utplåna era dåliga handlingar och föra er till lustgårdar, vattnade av bäckar, den Dag då Gud inte låter skam komma vid Profeten och dem som följde honom i tron - ljuset [av deras tro och deras goda handlingar] skall lysa framför dem och till höger om dem [och] de ber: \"Herre, låt vårt ljus lysa allt klarare och förlåt oss våra synder! Du har allt i Din makt!\"",
            "verse 66:9": "PROFET! Kämpa outtröttligt mot förnekarna av sanningen och mot hycklarna och visa dig omutligt sträng mot dem; Elden är deras slutliga hemvist - detta eländiga mål!",
            "verse 66:10": "Gud har utpekat Noas hustru och Lots hustru som varnande exempel för dem som framhärdar i att förneka sanningen; deras män var två av Våra rättfärdiga tjänare och de svek dem. Men [männen] kunde inte skydda dem mot Guds [straff] och [på Domens dag] skall de få höra dessa ord: \"Gå in i Elden med de [övriga fördömda]!\"",
            "verse 66:11": "Och som ett [efterföljansvärt] exempel för de troende har Gud framhållit Faraos hustru, som bad: \"Herre! Bygg en boning åt mig i paradiset i Din närhet och skydda mig mot Farao och allt [det onda] han har gjort och skydda mig mot alla dem som ständigt begår orätt!\"",
            "verse 66:12": "Ännu ett exempel har de i Maria, `Imrans dotter; Hon bevarade sin oskuld och Vi andades in i [hennes kropp] något av Vår ande. Hon trodde på sin Herres ord och på Hans uppenbarelser och hon var en av dem som ödmjukt böjer sig under Hans vilja."
        },
        "Tajik": {
            "verse 66:1": "Эй паёмбар, чаро чизеро, ки Худо бар ту ҳалол кардааст, ба хотири хушнуд сохтани занонат бар худ ҳаром мекунӣ? Ва Худо бахшояндаву меҳрубон аст!",
            "verse 66:2": "Худо барои шумо кушодани савганд ҳоятонро муқаррар дошта аст. Худост ёвари шумо ва Ӯст донову ҳаким!",
            "verse 66:3": "Он гоҳ ки паёмбар бо яке аз занони худ розе дар миён ниҳод, чун он зан он роз бо дигаре бозгуфт. Худо паёмбарро аз он огоҳ сохт ва ӯ баъзе аз он розро бар он зан ошкор, кард ва аз ифшон баъзеи дигар рӯй тофт. Чун ӯро аз он хабар дод, гуфт: «Чӣ касе туро аз ин моҷаро огоҳ кардааст?» Гуфт: «Он Худои донои огоҳ ба ман хабар додааст».",
            "verse 66:4": "Агар шумо ду зан тавба кунед, беҳтар аст, зеро дилҳоятон аз ҳақ бозгаштааст. Ва агар барои озораш ҳамдаст шавед, Худо ёвари ӯст ва низ Ҷабраил ва мӯъминони шоиставу фаришгагон аз он пас ёвари ӯ хоҳанд буд,",
            "verse 66:5": "Шояд агар шуморо талоқ гӯяд, Парвардигораш ба ҷои шумо заноне, беҳтар аз шумояш бидиҳад. Заноне мусалмон, мӯъмин, фармонбардор, тавбакунанда, ибодаткунанда рӯзагиранда, хоҳ шавҳар карда, хоҳ бокира.",
            "verse 66:6": "Эй касоне, ки имон овардаед, худ ва хонаводаи худро аз оташе, ки ҳезуми он мардум ва сангҳо ҳастанд, нигаҳ доред. Фариштагоне дуруштгуфтору сахтгир бар он оташ муваккаланд (вазифадор). Ҳар чӣ Худо бигӯяд, нофармонӣ намекунанд ва ҳамон мекунанд, ки ба он амр шудаанд.",
            "verse 66:7": "Эй кофирон, дар он рӯз узр махоҳед. Фақат баробари коре, ки кардаед, ҷазо дода шавед.",
            "verse 66:8": "Эй касоне, ки имон овардаед, ба даргоҳи Худо тавба кунед, тавбае аз рӯи ихлос. Бошад, ки Парвардигоратон гуноҳонатонро маҳв (дур) кунад ва шуморо ба биҳиштҳое дохил кунад, ки дар он наҳрҳо ҷорист. Дар он рӯз Худо паёмбар ва касонеро, ки бо ӯ имон овардаанд, хору зор накунад ва нурашон пешопеш ва самти росташон дар ҳаракат бошад. Мегӯянд: «Эй Парвардигори мо, нури моро барои мо ба камол расон ва моро бибахшой, ки Ту бар ҳар коре тавоно ҳастӣ!»",
            "verse 66:9": "Эй паёмбар, ба кофирону мунофиқон: чиҳод кун ва бар онҳо сахт бигир. Ҷойгоҳашон ҷаҳаннаад аст, ки бад ҷои бозгашт аст!",
            "verse 66:10": "Худо барои кофирон мисоли зани Нӯҳу зани Лутро меоварад, ки ҳар ду дар никоҳи ду тан аз бандагони солеҳи Мо буданд ва ба он ду хиёнат карданд, Ва онҳо натавонистанд аз занони худ дафъи азоб кунанд ва гуфта шуд: «Бо дигарон ба оташ дароед!»",
            "verse 66:11": "Ва Худо барои касоне, ки имон овардаанд, зани Фиръавнро мисол меорад, он гоҳ ки гуфт: «Эй Парвардигори ман, барои ман дар биҳишт назди Худ хонае бино кун ва маро аз Фиръавн ва амалаш наҷот деҳ ва маро аз мардуми золим бираҳон!»",
            "verse 66:12": "Ва Марям духтари Имронро, ки шармгоҳи худро аз зино нигаҳ дошт ва Мо аз рӯҳи Худ дар он дамидем. Ва ӯ калимоти Парвардигори худ ва китобҳояшро тасдиқ кард ва ӯ аз фармонбардорон буд."
        },
        "Tamil": {
            "verse 66:1": "நபியே! உம் மனைவியரின் திருப்தியை நாடி, அல்லாஹ் உமக்கு அனுமதித்துள்ளதை ஏன் விலக்கிக் கொண்டீர்? மேலும் அல்லாஹ் மிகவும் மன்னிப்பவன், மிக்க கிருபையுடையவன்.",
            "verse 66:2": "அல்லாஹ் உங்களுடைய சத்தியங்களை (சில போது தக்க பரிகாரங்களுடன்) முறித்து விடுவதை உங்களுக்கு ஏற்படுத்தியிருக்கிறான், மேலும் அல்லாஹ் உங்கள் எஜமானன். மேலும், அவன் நன்கறிந்தவன்; ஞானம் மிக்கவன்.",
            "verse 66:3": "மேலும், நபி தம் மனைவியர் ஒருவரிடம் ஒரு செய்தியை இரகசியமாக ஆக்கிவைத்த போது அவர் (மற்றொருவருக்கு) அதை அறிவித்ததும், அ(வ்விஷயத்)தை அல்லாஹ் அவருக்கு வெளியாக்கி வைத்தான், அவர் அதில் சிலதை தெரிவித்ததும், சிலதை(த் தெரிவிக்காது) புறக்கணித்தும் இருந்தார், (இவ்வாறு) அவர் அதைத் தெரிவித்த போது \"உங்களுக்கு இதைத் தெரிவித்தவர் யார்?\" என்று அப்பெண் கேட்டார். அதற்கு அவர் \"(யாவற்றையும்) நன்கறிந்தோனும் உணர்ந்தோனும் (ஆகிய அல்லாஹ்) என்குத் தெரிவித்தான்\" என்று (பதில்) கூறினார்.",
            "verse 66:4": "நீங்கள் இருவரும் - இதற்காக அல்லாஹ்விடம் தவ்பா செய்வீர்களாயின் (அது உங்களுக்கு நலமாகும்) ஏனெனில் நிச்சயமாக உங்களிருவரின் இதயங்களும் (இவ்விஷயத்தில் கோணிச்) சாய்ந்து விட்டன - தவிர, நீங்கள் இருவரும் அவருக்கெதிராய் ஒருவருக்கொருவர் உதவி செய்து கொண்டால், நிச்சயமாக அல்லாஹ் - அவருடைய எஜமானன் (அவருக்கு உதவுவான், அன்றியும்) ஜிப்ரயீலும், ஸாலிஹான முஃமின்களும் (உதவுவார்கள்.) அதன் பின் மலக்குகளும் (அவருக்கு) உதவியாளராக இருப்பார்கள்.",
            "verse 66:5": "அவர் உங்களை 'தலாக்' சொல்லி விட்டால், உங்களை விடச் சிறந்த - முஸ்லிம்களான, முஃமினான, (இறைவனுக்கு) வழிபட்டு நடப்பவர்களான, தவ்பா செய்பவர்களான, வணங்குபவர்களான, நோன்பு நோற்பவர்களான - கன்னிமை கழிந்தவர், இன்னும் கன்னிப் பெண்டிர் - இத்தகையவரை அவருடைய இறைவன் அவருக்கு (உங்களுக்குப்) பகரமாக, மனைவியராய் கொடுக்கப் போதுமானவன்.",
            "verse 66:6": "முஃமின்களே! உங்களையும், உங்கள் குடும்பத்தாரையும் (நரக) நெருப்பை விட்டுக் காப்பாற்றிக் கொள்ளுங்கள்; அதன் எரிபொருள் மனிதர்களும், கல்லுமேயாகும்; அதில் கடுமையான பலசாலிகளான மலக்குகள் (காவல்) இருக்கின்றனர், அல்லாஹ் அவர்களை ஏவி எதிலும் அவர்கள் மாறு செய்ய மாட்டார்கள், தாங்கள் ஏவப்பட்டபடியே அவர்கள் செய்து வருவார்கள்.",
            "verse 66:7": "(அன்று காஃபிர்களிடம்) நிராகரித்தோரே! இன்று நீங்கள் எந்தப்புகழும் கூறாதீர்கள், நீங்கள் கூலி கொடுக்கப்படுவதெல்லாம் நீங்கள் செய்து கொண்டிருந்ததற்குத்தான்.",
            "verse 66:8": "ஈமான் கொண்டவர்களே! கலப்பற்ற (மனதோடு) அல்லாஹ்விடம் தவ்பா செய்து, பாவமன்னிப்புப் பெறுங்கள்; உங்கள் இறைவன் உங்கள் பாவங்களை உங்களை விட்டுப் போக்கி உங்களைச் சுவனச் சோலைகளில் பிரவேசிக்கச் செய்வான், அவற்றின் கீழே ஆறகள் (சதா) ஓடிக் கொண்டே இருக்கும்; (தன்) நபியையும் அவருடன் ஈமான் கொண்டார்களே அவர்களையும் அந்நாளில் அல்லாஹ் இழிவுபடுத்தமாட்டான்; (அன்று ஈடேற்றம் பெற்ற) அவர்களுடைய பிரகாசம் (ஒளி) அவர்களுக்கு முன்னும் அவர்களுடைய வலப்புறத்திலும் விரைந்து கொண்டிருக்கும், அவர்கள் \"எங்கள் இறைவா! எங்களுக்கு, எங்களுடைய பிரகாசத்தை நீ முழுமையாக்கி வைப்பாயாக! எங்களுக்கு மன்னிப்பும் அருள்வாயாக! நிச்சயமாக நீ எல்லாப் பொருட்கள் மீதும் பேராற்றலுடையவன்\" என்று கூறி(ப் பிரார்த்தனை செய்து) கொண்டு இருப்பார்கள்.",
            "verse 66:9": "நபியே! காஃபிர்களுடனும், முனாஃபிக்குகளுடனும் நீர் போரிட்டு, அவர்களிடம் கண்டிப்புடன் இருப்பீராக! அன்றியும் அவர்கள் ஒதுங்குமிடம் நரகமேயாகும், அது மிகவும் கெட்ட சேருமிடம் ஆகும்.",
            "verse 66:10": "நிராகரிப்பவர்களுக்கு, நூஹுடைய மனைவியையும் லூத்துடைய மனைவியையும் அல்லாஹ் உதாரணமாக்கி வைக்கிறான,; இவ்விருவரும் ஸாலிஹான நம் நல்லடியார்களில், இரு நல்லடியார்களின் மனiவிகளாகவே இருந்தனர், எனினும் இவ்விருவரும் தம் கணவர்களை மோசம் செய்தனர், எனவே, அவ்விருவரும் (தம் மனைவியரான) அவ்விருவரைவிட்டும் அல்லாஹ்விலிருந்து (வேதனையைத்) தடுக்க இயலவில்லை, இன்னும், \"நீங்களிருவரும் (நரக) நெருப்பில் நுழைபவர்களுடனே நுழையுங்கள்\" என்று (இவ்விருவருக்கும்) கூறப்பட்டது.",
            "verse 66:11": "மேலும், ஈமான் கொண்டவர்களுக்கு ஃபிர்அவ்னின் மனைவியை அல்லாஹ் உதாரணமாக கூறுகிறான். அவர் \"இறைவா! எனக்காக உன்னிடத்தில், சுவர்க்கத்தில் ஒரு வீட்டைக் கட்டித் தருவாயாக! இன்னும் ஃபிர்அவ்னை விட்டும், அவன் செயல்களை விட்டும் என்னை காப்பாற்றுவாயாக! இன்னும் அநியாயக்கார சமூகத்தாரிடமிருந்தும் என்னைக் காப்பாற்றுவாயாக\" என்று (பிரார்த்தித்துக்) கூறினார்.",
            "verse 66:12": "மேலும், இம்ரானின் புதல்வியான மர்யமையும் (அல்லாஹ் உதாரணமாக்கினான்) அவர் தம் கற்பைக் காத்துக் கொண்டார், நாம் (அவரில்) நம் ரூஹிலிருந்து (ஆத்மாவிலிருந்து) ஊதினோம். மேலும், அவர் தம் இறைவனின் வார்த்தைகளையும், அவனுடைய வேதங்களையும் மெய்ப்பித்தார் - (ஏற்றுக் கொண்டார்); இன்னும், அவர் (அல்லாஹ்வை வணங்கி) வழிபட்டவர்களில் ஒருவராகவும் இருந்தார்."
        },
        "Tatar": {
            "verse 66:1": "Ий пәйгамбәр ни өчен Аллаһ сиңа хәләл кылган нәрсәне үзеңә хәрам кыласың хатыннарыңның ризасын эстәп? Аллаһ ярлыкаучы вә рәхимледер. (Мухәммәд г-мнең хатыннарыннан Хәфсә үзенең нәүбәте көнне Мухәммәд г-мнән рөхсәт алып, ата-аналарының хәлен белергә китте. Бу көнне Мухәммәд г-м җариясе Мэрияне чакырып аның белән бергә булды. Хәфсә кайткач бу хәлне белеп, мине шул хәйлә өчен җибәргәнсең икән, дип елады. Мухәммәд г-м Хәфсәнең күңелен табу өчен: \"Мин Мэрияне үземә хәрам кылдым, ләкин моны хатыннарымнан һичкемгә сөйләмә\", – диде. Соңра Хәфсә шатлыгыннан бу эшне Гаишәгә сөйләде, Гаишә расүл хозурына килде, Мухәммәд г-м Гаишәгә дә: \"Мин Мэрияне үземә хәрам кылдым\", – диде. Шул хакта аятьләр инде.)",
            "verse 66:2": "Тәхкыйк Аллаһ сезгә өйрәтте кәффарәт түләп антыгыздан чыгуны. Чөнки Мухәммәд г-м Мәрияне үземә хәрам кылдым дип ант итеп әйткән иде. Аллаһ сезнең ярдәмчегездер вә Ул һәрнәрсәне белүче һәм гадел хөкем итүчедер.",
            "verse 66:3": "Расүл г-м бәгъзе хатыннарына яшерен сер итеп әйтте, ягъни Хәфсәгә Мэрияне үзенә хәрам кылганлыгын һәм үзеннән соң Әбү Бәкер халифә булачагын, аннан соң Ґүмәр халифә булачагын сөйләде, һәм бу сүзне һичкемгә сөйләмә, диде. Әмма Хәфсә Мэрия хакындагы серне һәм Әбү Бәкер хакындагы серне Гаишәгә сөйләде. Хәфсә бу серләрне Гаишәгә белдергәч, Аллаһ Хәфсәнең бу серләрне Гаишәгә белдергәнен Мухәммәд г-мгә белдерде, Мухәммәд, г-м Хәфсәнең бу серләрне Гаишәгә сөйләгәнлеген бәгъзесен үзенә әйтте, бәгъзесен әйтмәде. Ягъни ий Хәфсә! Мәрияне үземә хәрам кылганлыгымны ни өчен Гаишәгә сөйләдең, диде, әмма Әбү Бәкер Ґүмәр хакындагы серне кузгатмады, нигә сөйләдең димәде. Мухәммәд г-м Хәфсәгә бу серләрне ник сөйләдең дигәч, Хәфсә: \"Минем бу серләрне Гаишәгә сөйләгәнлегемне сиңа кем белдерде\", – диде. Мухәммәд г-м, һәрнәрсәне белүче вә һәрнәрсәдән хәбәрдар булган Аллаһ белдерде диде.",
            "verse 66:4": "Ий Хәфсә илә Гаишә, әгәр Аллаһуга тәүбә итсәгез, әлбәттә, тәүбә итәрлек эшегез булды, сезнең күңелегез үзегезгә ваҗеб булган эштән авышты. Әгәр сез расүл зарарына ярдәмләшсәгез, тәхкыйк Аллаһ ул расүл г-мнең хуҗасы вә ярдәмчеседер, вә Җәбраил фәрештә аның ярдәмчеседер, вә мөэминнәрнең яхшылары аның ярдәмчеләредер һәм болардан башка фәрештәләр аңа ярдәмчеләрдер.",
            "verse 66:5": "Әгәр расүл г-м сезне талак кылса, Раббысының аңа яхшырак хатыннарга алыштырмаклыгы өметледер, алар: чын мөслимәләр вә Аллаһуга, Аның һәр сүзенә ышанучы хак мөэминәләр, Аллаһуга вә расүлгә чын итагать итүчеләр, вә гөнаһтан тәүбә итүчеләр, вә Аллаһуга гына гыйбадәт кылучылар, вә рузә тотучылар вә расүлгә итагать өчен һиҗерәт итүчеләр шул сыйфатта булган хатыннар ирдә булган тол хатыннардыр һәм ирдә булмаган кызлардыр. Аллаһ теләсә сезне әнә шундый хатыннарга алыштырыр, димәк.",
            "verse 66:6": "Ий мөэминнәр үзегезне һәм өй җәмәгатегезне җәһәннәм утыннан саклагыз, ягъни үзегез шәригать хөкемнәрен дөрес үтәп җәмәгатьләрегезгә шәригать хөкемнәрен дөрес өйрәтегез, ул утның утыны – кешеләр һәм ташлардыр. Ул җәһәннәмгә билгеләнгән ґәзаб фәрештәләре бар, алар җәһәннәм әһеленә каты сүзле, каты куллы ґәзаб кылуда бик куәтлеләрдер, алар үзләренә булган боерыкларда Аллаһуга һич хилафлык кылмаслар, Аллаһудан нинди боерык булса – шуны эшләрләр.",
            "verse 66:7": "Ий Коръән белән гамәл кылмыйча кәфер булган кешеләр, бүген инде гозер күрсәтмәгез ґәзабтан котылырга сезгә гозер юк, сез фәкать имансыз, динсез булуыгызның тиешле җәзасын аласыз.",
            "verse 66:8": "Ий мөэминнәр, Аллаһуга тәүбә итегез чын ихлас тәүбә белән, ягъни кылган гөнаһларның һәммәсе өчен үкенеп Аллаһудан гафу сорау белән, Коръән күрсәткән юлга кереп динне ныклап тоту белән һәм тәүбәне һичкайчан бозмау белән тәүбә итегез! Чын тәүбә белән тәүбә итсәгез, Раббыгызның сездән яманлыкларыгызны капламаклыгы һәм асларыннан елгалар ага торган җәннәтләргә кертмәклеге өметледер, шул көндә Аллаһ пәйгамбәрне вә иман китереп пәйгамбәр белән бергә булганнарны рисвай кылмас, аларның нурлары алларыннан вә уңнарыннан йөрер. Алар әйтерләр: \"Ий Раббыбыз, безгә нурыбызны тутырып бир һәм гөнаһларыбызны ярлыкагыл, тәхкыйк Син һәрнәрсәгә кадирсең!\"",
            "verse 66:9": "Ий пәйгамбәр! Кәферләр вә монафикълар белән сугыш кыл, вә аларга катылык күрсәт! Аларның тора торган урыннары җәһәннәмдер, ул җәһәннәм ни яман урындыр.",
            "verse 66:10": "Аллаһ мисал итеп зекер итте хакны инкяр итүче кәферләргә Нух пәйгамбәрнең хатынын вә Лут пәйгамбәрнең хатынын. Бу ике хатын Безнең ике изге колларыбызның кул астында иделәр, бу ике хатын үзләренең ирләре булган пәйгамбәрләргә хыянәт иттеләр, ирләренә зарар итәргә теләделәр. Бу ике хатыннан ирләре булган бу ике пәйгамбәр Аллаһ ґәзабыннан һичнәрсәне җибәрә алмадылар, ягъни пәйгамбәр булсалар да, хыянәтче хатыннарын Аллаһ ґәзабыннан коткара алмадылар. Вә аларга утка керүчеләр белән бергә утка керегез дип әйтелде. (Үзеңнең Аллаһ разый булырлык чын иманың, хак динең булмаса, Аллаһ дусларыннан сиңа һич файда булмас.)",
            "verse 66:11": "Янә Аллаһ мисал итеп зекер итте хакны кабул итүче мөэминнәргә Фиргаун хатыны Асиянең кыйссасын. Асия әйтте: \"Ий Раббым минем өчен Үзеңнең хозурыңда җәннәттә бер өй бина кылгыл, вә мине Фиргауннән вә аның ґәзабыннан коткар һәм Фиргауннең залим булган кавеменнән мине коткар\", – дип. (Асия Фиргауннән яшереп Аллаһуга гыйбадәт кылыр иде, Фиргаун Асиянең ислам динендә икәнен белгәч, Аллаһны ташла миннән башка сиңа Аллаһ юк, дип кулларын вә аякларын тактага кадаклап ґәзаблый башлады. Шул вакытта Аллаһ Асиягә җәннәттәге урынын күрсәтте, Асия Фиргауннең ґәзабын сизмичә рәхәтләнеп җан тәслим кылды.)",
            "verse 66:12": "Дәхи Аллаһ мөэминнәргә Гыймран кызы Мәрьямне зекер итте, ул Мәрьям ирләрдән үзен саклады, һәм ул Мәрьямгә өрдек Үзебез халык иткән рухыбыздан, вә ул Раббысының сүзләрен раслады, кабул итте, дәхи Аллаһуның китапларын раслады һәм ул Аллаһуга итагать итүчеләрдән даими гыйбадәт белән мәшгуль булучылардан булды."
        },
        "Telugu": {
            "verse 66:1": "ఓ ప్రవక్తా! అల్లాహ్ నీకు ధర్మసమ్మతం చేసిన దానిని నీవు ఎందుకు నిషేధించుకుంటున్నావు? నీవు నీ భార్యల ప్రసన్నతను కోరుతున్నావా? మరియు అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత",
            "verse 66:2": "వాస్తవానికి అల్లాహ్ మీ ప్రమాణాల పరిహార పద్ధతి మీకు నిర్దేశించాడు. మరియు అల్లాహ్ యే మీ యజమాని. మరియు ఆయన సర్వజ్ఞుడు, మహా వివేకవంతుడు",
            "verse 66:3": "మరియు (జ్ఞాపకం చేసుకోండి) ప్రవక్త తన భార్యలలో ఒకామెకు రహస్యంగా ఒక విషయం చెప్పగా ఆమె దానిని (ఆ రహస్యాన్ని) మరొకామెకు చెప్పింది. మరియు అల్లాహ్ అతనికి (ప్రవక్తకు) ఆ విషయాన్ని తెలియజేశాడు. (వాస్తవానికి) అతను (ప్రవక్త) ఆ విషయాన్ని (మొదటి) ఆమెకు కొంత తెలిపి, మరికొంత తెలుపలేదు. ఇక అతను (ప్రవక్త, మొదటి) ఆమెకు దానిని (రహస్యం బయట పడిన సంగతిని) తెలిపినప్పుడు, ఆమె (ఆశ్చర్యపోతూ) అతనితో ఇలా అడిగింది: ఇది నీకు ఎవరు తెలిపారు?\" అతను జవాబిచ్చాడు: నాకు ఈ విషయం ఆ సర్వజ్ఞుడు, ఆ సర్వం తెలిసినవాడు తెలిపాడు",
            "verse 66:4": "(ఆ ఇద్దరు స్త్రీలతో ఇలా అనబడింది): ఒకవేళ మీరిద్దరూ అల్లాహ్ వైపునకు పశ్చాత్తాపంతో మరలితే (అది మీ మేలుకే) వాస్తవానికి మీ ఇద్దరి హృదయాలు (ఋజుమార్గం నుండి) తొలగిపోయాయి. ఒకవేళ మీరిద్దరు ప్రవక్తకు విరోధంగా పోతే! నిశ్చయంగా, అల్లాహ్ అతని సంరక్షకుడు మరియు జిబ్రీల్ మరియు సత్పురుషులైన విశ్వాసులు అతని (సహాయకులు). మరియు దేవదూతలందరు కూడా అతని సహాయకులని (తెలుసుకోండి)",
            "verse 66:5": "ఒకవేళ అతను (ముహమ్మద్!) మీ అందరికీ విడాకులిస్తే! అల్లాహ్, మీకు బదులుగా, మీకంటే మంచి భార్యలను, అతనికి (ప్రవక్తకు) ప్రసాదించగలడు! వారు మంచి ముస్లింలు, విశ్వాసులు, భక్తిపరులు, పశ్చాత్తాప పడేవారు, (అల్లాహ్ ను) ఆరాధించేవారు, వలస పోయే (ఉపవాసాలు చేసే) వారు అయిన, విధవలు లేదా కన్యలు అయి ఉంటారు",
            "verse 66:6": "ఓ విశ్వాసులారా! మీరు మిమ్మల్ని మరియు మీ కుటుంబం వారిని, మానవులు మరియు రాళ్ళు ఇంధనం కాబోయే నరకాగ్ని నుండి కాపాడుకోండి! దానిపై ఎంతో బలిష్ఠులూ, కఠినులూ అయిన దేవదూతలు నియమింపబడి ఉంటారు. వారు అల్లాహ్ ఇచ్చిన ఆజ్ఞను ఉల్లంఘించరు మరియు వారికిచ్చిన ఆజ్ఞలనే నెరవేరుస్తూ ఉంటారు",
            "verse 66:7": "ఓ సత్యతిరస్కారులారా! ఈ రోజు మీరు సాకులు చెప్పకండి. నిశ్చయంగా, మీరు చేస్తూ ఉండిన కర్మలకు, తగిన ప్రతిఫలమే మీకు ఇవ్వబడుతోంది",
            "verse 66:8": "ఓ విశ్వాసులారా! మీరు అల్లాహ్ వైపునకు మనః పూర్వకమైన పశ్చాత్తాపంతో, క్షమాపణ కొరకు మరలితే! మీ ప్రభువు మీ పాపాలను తొలగించి, మిమ్మల్ని క్రింద సెలయేళ్ళు ప్రవహించే స్వర్గవనాలలో ప్రవేశింపజేస్తాడు; ఆ రోజు అల్లాహ్ తన ప్రవక్తను మరియు అతనితో పాటు విశ్వసించిన వారిని అవమానం పాలు చేయడు. వారి కాంతి, వారి ముందు మరియు వారి కుడి వైపు నుండి ప్రసరిస్తూ ఉంటుంది. వారి ఇలా ప్రార్థిస్తారు: ఓ మా ప్రభూ! మా కాంతిని మా కొరకు పరిపూర్ణం చేయి మరియు మమ్మల్ని క్షమించు. నిశ్చయంగా, నీవే ప్రతిదీ చేయగల సమర్ధుడవు",
            "verse 66:9": "ఓ ప్రవక్తా! నీవు సత్యతిరస్కారులతో మరియు కపట విశ్వాసులతో ధర్మయుద్ధం చెయ్యి మరియు వారి విషయంలో కఠినంగా వ్యవహరించు. మరియు వారి ఆశ్రయం నరకమే! అది అతి చెడ్డ గమ్యస్థానం",
            "verse 66:10": "సత్యతిరస్కారుల విషయంలో అల్లాహ్ నూహ్ భార్య మరియు లూత్ భార్యల ఉదాహరణలను ఇచ్చాడు. ఆ ఇద్దరు స్త్రీలు మా సత్పురుషులైన మా ఇద్దరు దాసుల (వివాహ) బంధంలో ఉండిరి. కాని ఆ ఇద్దరు స్త్రీలు వారిద్దరిని మోసగించారు. కావున వారిద్దరు, ఆ ఇద్దరు స్త్రీల విషయంలో అల్లాహ్ ముందు (పరలోకంలో) ఏ విధంగాను సహాయపడలేరు. మరియు (తీర్పు దినమున) వారితో: నరకాగ్నిలో ప్రవేశించే వారితో సహా, మీరిద్దరు స్త్రీలు కూడా ప్రవేశించండి!\" అని చెప్పబడుతుంది",
            "verse 66:11": "మరియు అల్లాహ్, విశ్వసించినవారిలో ఫిర్ఔన్ భార్యను ఉదాహరణగా పేర్కొన్నాడు. ఆమె ఇలా అన్న విషయం (జ్ఞాపకం చేసుకోండి): ఓ నా ప్రభూ! నా కొరకు నీ వద్ద స్వర్గంలో ఒక గృహాన్ని నిర్మించు! మరియు నన్ను, ఫిర్ఔన్ మరియు అతన చేష్టల నుండి కాపాడు మరియు నన్ను ఈ దుర్మార్గ జాతివారి నుండి కాపాడు",
            "verse 66:12": "మరియు ఇమ్రాన్ కుమార్తె మర్యమ్ ను (కూడా ఉదాహరణగా పేర్కొన్నాడు) ఆమె తన శీలాన్ని కాపాడు కున్నది. మరియు మేము ఆమెలోకి మా (తరఫు నుండి) జీవం (ఆత్మ) ఊదాము. మరియు ఆమె తన ప్రభువు సమాచారాలను మరియు ఆయన గ్రంథాలను, సత్యాలని ధృవపరిచింది మరియు ఆమె భక్తిపరులలో చేరిపోయింది"
        },
        "Thai": {
            "verse 66:1": "โอ้นะบีเอ๋ย ทำไมเจ้าจึงห้ามสิ่งที่อัลลอฮฺได้ทรงอนุมัติแก่เจ้า เพื่อแสวงหาความพึงพอใจบรรดาภริยาของเจ้าเล่า ? และอัลลอฮฺนั้นเป็นผู้ทรงอภัย ผู้ทรงเมตตา",
            "verse 66:2": "แน่นอนอัลลอฮฺได้ทรงกำหนดแก่พวกเจ้าแล้วในการแก้คำสาบานของพวกเจ้าและอัลลอฮฺเป็นผู้ทรงคุ้มครองพวกเจ้า และพระองค์เป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
            "verse 66:3": "และจงรำลึกขณะที่ท่านนะบีได้บอกความลับเรื่องหนึ่งแก่ภริยาบางคนของเขา ครั้นเมื่อนางได้บอกเล่าเรื่องนี้ (แก่คนอื่น) และอัลลอฮฺได้ทรงแจ้งเรื่องนี้แก่เขา (ท่านนะบี) เขาก็ได้แจ้งบางส่วนของเรื่องนี้ และไม่แจ้งบางส่วน ครั้นเมื่อเขา (ท่านนะบี) ได้แจ้งเรื่องนี้แก่นาง นางได้กล่าวว่า ใครบอกเล่าเรื่องนี้แก่ท่าน ? เขา (ท่านนะบี) กล่าวว่าพระผู้ทรงรอบรู้ พระผู้ทรงตระหนักยิ่ง ทรงแจ้งแก่ฉัน",
            "verse 66:4": "หากเจ้าทั้งสองกลับเนื้อกลับตัวขออภัยโทษต่อัลลอฮฺ (ก็จะเป็นการดีแก่เจ้าทั้งสอง) เพราะแน่นอนหัวใจของเจ้าทั้งสองก็โอนอ่อนอยู่แล้ว แต่หากเจ้าทั้งสองร่วมกันต่อต้านเขา (ท่านนะบี) แท้จริงอัลลอฮฺ พระองค์เป็นผู้ทรงคุ้มครองเขา อีกทั้งญิบรีล และบรรดาผู้ศรัทธาที่ดี ๆ และนอกจากนั้น มะลาอิกะฮฺก็ยังเป็นผู้ช่วยเหลือสนับสนุนอีกด้วย",
            "verse 66:5": "หากเขาหย่าพวกนาง บางทีพระเจ้าของเขาจะทรงเปลี่ยนแปลงให้แก่เขามีภริยาที่ดีกว่าพวกนาง เป็นหญิงที่นอบน้อมถ่อมตน เป็นหญิงผู้ศรัทธา เป็นหญิงผู้ภักดี เป็นหญิงผู้ขอลุแก่โทษ เป็นหญิงผู้มั่นต่อการอิบาดะฮฺ เป็นหญิงผู้มั่นต่อการถือศิลอด เป็นหญิงที่เป็นหม้าย และที่เป็นหญิงสาว",
            "verse 66:6": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงคุ้มครองตัวของพวกเจ้าและครอบครัวของพวกเจ้าให้พ้นจากไฟนรก เพราะเชื้อเพลิงของมันคือมนุษย์ และก้อนหิน มีมะลาอิกะฮฺผู้แข็งกร้าวหาญคอยเฝ้ารักษามันอยู่ พวกเขาจะไม่ฝ่าฝืนอัลลอฮฺในสิ่งที่พระองค์ทรงบัญชาแก่พวกเขา และพวกเขาจะปฏิบัติตามที่ถูกบัญชา",
            "verse 66:7": "โอ้บรรดาผู้ปฏิเสธศรัทธาเอ๋ย วันนี้พวกเจ้าอย่าได้แก้ตัวเลย แต่ว่าพวกเจ้าจะถูกตอบแทนตามที่พวกเจ้าได้กระทำไว้",
            "verse 66:8": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงขอลุแก่โทษแด่อัลลอฮฺด้วยการลุแก่โทษอย่างจริงจังเถิดบางทีพระเจ้าของพวกเจ้าจะลบล้างความผิดของพวกเจ้าออกจากพวกเจ้า และจะทรงให้พวกเจ้าเข้าสวนสวรรค์หลากหลาย ณ เบื้องล่างสวนสวรรค์นั้นมีลำน้ำหลายสายไหลผ่าน วันที่อัลลอฮฺจะไม่ทรงทำให้นะบี และบรรดาผู้ศรัทธาร่วมกับเขาต้องอัปยศแสงสว่างของพวกเขาจะส่องจ้าไปเบื้องหน้าของพวกเขาและทางเบื้องขวาของพวกเขา พวกเขาจะกล่าวว่าข้าแต่พระเจ้าของเรา ขอพระองค์ได้ทรงโปรดทำให้แสงสว่างของเราอยู่กับเราตลอดไปและทรงยกโทษให้แก่เราแท้จริงพระองค์ท่านเป็นผู้ทรงอานุภาพเหนือทุกสิ่ง",
            "verse 66:9": "โอ้นะบีเอ๋ย จงต่อสู้กับพวกปฏิเสธศรัทธาและพวกมุนาฟิกีน และจงแข็งกร้าวกับพวกเขา เพราะที่พำนักของพวกเขาคือนรก และมันเป็นทางกลับที่ชั่วช้ายิ่ง",
            "verse 66:10": "อัลลอฮฺทรงยกอุทาหรณ์แก่บรรดาผู้ปฏิเสธศรัทธาถึงภริยาของนูหฺ และภริยาของลู๊ฏ นางทั้งสองอยู่ภายใต้การปกครองของบ่าวที่ดีทั้งสองในหมู่ปวงบ่าวของเรา แต่นางทั้งสองได้ทรยศต่อเขาทั้งสองให้พ้นจากการลงโทษาของอัลลอฮฺแต่ประการใด จึงมีเสียงกล่าวขึ้นว่า เจ้าทั้งสองจงเข้าไปในไฟนรกพร้อมกับบรรดาผู้ที่เข้าไปในมัน",
            "verse 66:11": "และอัลลอฮฺทรงยกอุทาหรณ์แก่บรรดาผู้ศรัทธาถึงภริยาของฟิรเอานฺเมื่อนางได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ ขอพระองค์ทรงโปรดสร้างบ้านหลังหนึ่งให้แก่ข้าพระองค์ ณ ที่พระองค์ท่านในสวนสวรรค์และทรงโปรดช่วยข้าพระองค์ให้พ้นจากฟิรเอานฺ และการกระทำของเขา และทรงโปรดช่วยข้าพระองค์ให้พ้นจากหมู่ชนผู้อธรรม",
            "verse 66:12": "และมัรยัมบุตรีของอิมรอน ผู้ซึ่งรักษาพรหมจารีของนาง แล้วเราได้เป่าวิญญาณของเราเข้าไปในนาง และนางได้ศรัทธาต่อบัญญัติต่าง ๆ แห่งพระเจ้าของนาง และ (ได้ศรัทธาต่อ) คัมภีร์ต่าง ๆ ของพระองค์ และนางจึงอยู่ในหมู่ผู้นอบน้อมภักดีทั้งหลาย"
        },
        "Turkish": {
            "verse 66:1": "Eşlerinin rızasını gözeterek, Allah'ın sana helal kıldığı şeyi niçin kendine yasak ediyorsun? Allah bağışlayandır, acıyandır.",
            "verse 66:2": "Allah şüphesiz size, yeminlerinizi keffaretle geri almanızı meşru kılmıştır. Allah sizin dostunuzdur. O, bilendir, Hakim'dir.",
            "verse 66:3": "Peygamber, eşlerinden birine gizlice bir söz söylemişti. O, bunu Peygamberin diğer bir eşine haber verince, Allah da Peygambere durumu bildirmiş, o da bir kısmını yüzüne vurmuş bir kısmını yüzüne vurmaktan geri durmuştu. Eşine, gizlice söylediği şeyibaşkasına nakletmiş olduğunu bildirince, eşi: \"Bunu sana kim haber verdi?\" demiş, o da: \"Bana, herşeyi bilen ve herşeyden haberdar olan Allah haber verdi\" demişti.",
            "verse 66:4": "Ey Peygamber'in eşleri! Eğer ikiniz de Allah'a tevbe ederseniz, kaymış olan kalpleriniz düzelmiş olur. Eğer eşinizin aleyhinde yardımlaşarak bir şey yapmağa kalkarsanız, bilin ki Allah onun dostu, bundan başka Cebrail, iyi müminler ve melekler de yardımcısıdır.",
            "verse 66:5": "Ey Peygamber'in eşleri! Eğer o sizi boşarsa, Rabbi ona; sizden daha iyi olan, kendini Allah'a veren, inanan, boyun eğen, tevbe eden, kulluk eden, oruç tutan, dul ve bakire eşler verebilir.",
            "verse 66:6": "Ey inananlar! Kendinizi ve çoluk çocuğunuzu cehennem ateşinden koruyun; onun yakıtı, insanlar ve taşlardır; görevlileri, Allah'ın kendilerine verdiği emirlere baş kaldırmayan, kendilerine buyrulanları yerine getiren pek haşin meleklerdir.",
            "verse 66:7": "\"Ey inkar edenler! Bugün özür beyan etmeyin, ancak işlediklerinizin karşılığını görmektesiniz\" denir.",
            "verse 66:8": "Ey inananlar! Yürekten tevbe ederek Allah'a dönün ki, Rabbiniz kötülüklerinizi örtsün, sizi, içlerinden ırmaklar akan cennetlere koysun. Allah'ın Peygamberini ve onunla beraber olan müminleri utandırmayacağı o gün, ışıkları önlerinde ve defterleri sağlarından verilmiş olarak yürürler ve: \"Rabbimiz! Işığımızı tamamla, bizi bağışla, doğrusu Sen herşeye Kadir'sin\" derler.",
            "verse 66:9": "Ey Peygamber! İnkarcılarla ve ikiyüzlülerle savaş; onlara karşı sert davran. Onların varacakları yer cehennemdir, ne kötü dönüştür!...",
            "verse 66:10": "Allah, inkar edenlere, Nuh'un karısıyla Lut'un karısını misal gösterir: Onlar, kullarımızdan iki iyi kulun nikahı altında iken onlara karşı hainlik edip inkarlarını gizlemişlerdi de iki peygamber Allah'tan gelen azabı onlardan savamamışlardı. O iki kadına: \"Cehenneme girenlerle beraber siz de girin\" dendi.",
            "verse 66:11": "Allah, inanlara Firavun'un karısını misal gösterir: O: \"Rabbim! Katından bana cennette bir ev yap; beni Firavun'dan ve onun işlediklerinden kurtar; beni zalim milletten kurtar\" demişti.",
            "verse 66:12": "Mahrem yerini korumuş olan İmran kızı Meryem de bir misaldir. Ona ruhumuzdan üflemiştik; Rabbinin sözlerini ve kitablarını tasdik etmişti; o, Bize gönülden itaat edenlerdendi."
        },
        "Urdu": {
            "verse 66:1": "اے پیغمبر جو چیز خدا نے تمہارے لئے جائز کی ہے تم اس سے کنارہ کشی کیوں کرتے ہو؟ (کیا اس سے) اپنی بیویوں کی خوشنودی چاہتے ہو؟ اور خدا بخشنے والا مہربان ہے",
            "verse 66:2": "خدا نے تم لوگوں کے لئے تمہاری قسموں کا کفارہ مقرر کردیا ہے۔ اور خدا ہی تمہارا کارساز ہے۔ اور وہ دانا (اور) حکمت والا ہے",
            "verse 66:3": "اور (یاد کرو) جب پیغمبر نے اپنی ایک بی بی سے ایک بھید کی بات کہی تو (اس نے دوسری کو بتا دی) ۔ جب اس نے اس کو افشاء کیا اور خدا نے اس (حال) سے پیغمبر کو آگاہ کردیا تو پیغمبر نے ان (بی بی کو وہ بات) کچھ تو بتائی اور کچھ نہ بتائی۔ تو جب وہ ان کو جتائی تو پوچھنے لگیں کہ آپ کو کس نے بتایا؟ انہوں نے کہا کہ مجھے اس نے بتایا ہے جو جاننے والا خبردار ہے",
            "verse 66:4": "اگر تم دونوں خدا کے آگے توبہ کرو (تو بہتر ہے کیونکہ) تمہارے دل کج ہوگئے ہیں۔ اور اگر پیغمبر (کی ایذا) پر باہم اعانت کرو گی تو خدا اور جبریل اور نیک کردار مسلمان ان کے حامی (اور دوستدار) ہیں۔ اور ان کے علاوہ (اور) فرشتے بھی مددگار ہیں",
            "verse 66:5": "اگر پیغمبر تم کو طلاق دے دیں تو عجب نہیں کہ ان کا پروردگار تمہارے بدلے ان کو تم سے بہتر بیبیاں دے دے۔ مسلمان، صاحب ایمان فرمانبردار توبہ کرنے والیاں عبادت گذار روزہ رکھنے والیاں بن شوہر اور کنواریاں",
            "verse 66:6": "مومنو! اپنے آپ کو اور اپنے اہل عیال کو آتش (جہنم) سے بچاؤ جس کا ایندھن آدمی اور پتھر ہیں اور جس پر تند خو اور سخت مزاج فرشتے (مقرر) ہیں جو ارشاد خدا ان کو فرماتا ہے اس کی نافرمانی نہیں کرتے اور جو حکم ان کو ملتا ہے اسے بجا لاتے ہیں",
            "verse 66:7": "کافرو! آج بہانے مت بناؤ۔ جو عمل تم کیا کرتے ہو ان ہی کا تم کو بدلہ دیا جائے گا",
            "verse 66:8": "مومنو! خدا کے آگے صاف دل سے توبہ کرو۔ امید ہے کہ وہ تمہارے گناہ تم سے دور کر دے گا اور تم کو باغہائے بہشت میں جن کے نیچے نہریں بہہ رہی ہیں داخل کرے گا۔ اس دن پیغمبر کو اور ان لوگوں کو جو ان کے ساتھ ایمان لائے ہیں رسوا نہیں کرے گا (بلکہ) ان کا نور ایمان ان کے آگے اور داہنی طرف (روشنی کرتا ہوا) چل رہا ہوگا۔ اور وہ خدا سے التجا کریں گے کہ اے پروردگار ہمارا نور ہمارے لئے پورا کر اور ہمیں معاف کرنا۔ بےشک خدا ہر چیز پر قادر ہے",
            "verse 66:9": "اے پیغمبر! کافروں اور منافقوں سے لڑو اور ان پر سختی کرو۔ ان کا ٹھکانا دوزخ ہے۔ اور وہ بہت بری جگہ ہے",
            "verse 66:10": "خدا نے کافروں کے لئے نوحؑ کی بیوی اور لوطؑ کی بیوی کی مثال بیان فرمائی ہے۔ دونوں ہمارے دو نیک بندوں کے گھر میں تھیں اور دونوں نے ان کی خیانت کی تو وہ خدا کے مقابلے میں اور ان عورتوں کے کچھ بھی کام نہ آئے اور ان کو حکم دیا گیا کہ اور داخل ہونے والوں کے ساتھ تم بھی دوزخ میں داخل ہو جاؤ",
            "verse 66:11": "اور مومنوں کے لئے (ایک) مثال (تو) فرعون کی بیوی کی بیان فرمائی کہ اس نے خدا سے التجا کی کہ اے میرے پروردگار میرے لئے بہشت میں اپنے پاس ایک گھر بنا اور مجھے فرعون اور اس کے اعمال (زشت مآل) سے نجات بخش اور ظالم لوگوں کے ہاتھ سے مجھ کو مخلصی عطا فرما",
            "verse 66:12": "اور (دوسری) عمران کی بیٹی مریمؑ کی جنہوں نے اپنی شرمگاہ کو محفوظ رکھا تو ہم نے اس میں اپنی روح پھونک دی اور اپنے پروردگار کے کلام اور اس کی کتابوں کو برحق سمجھتی تھیں اور فرمانبرداروں میں سے تھیں"
        },
        "Uyghur": {
            "verse 66:1": "ئى پەيغەمبەر! نېمە ئۈچۈن اﷲ ساڭا ھالال قىلغان نەرسىنى ئاياللىرىڭنىڭ رازىلىقىنى تىلەش يۈزىسىدىن ھارام قىلىسەن، اﷲ ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر",
            "verse 66:2": "اﷲ سىلەرگە (كەففارەت) بىلەن قەسىمىڭلاردىن چىقىشنى بەلگىلىدى، اﷲ سىلەرنىڭ ئىگەڭلاردۇر، اﷲ ھەر نەرسىنى بىلگۈچىدۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 66:3": "ئۆز ۋاقتىدا پەيغەمبەر ئاياللىرىدىن بىرىگە (يەنى ھەفسەگە) بىر سۆزنى يوشۇرۇن ئېيتقان ئىدى، ئۇ (يەنى ھەفسە) ئۇنى (ئائىشەگە) ئېيتىپ قويغان، اﷲ بولسا سىرنىڭ ئاشكارىلانغانلىقىنى (پەيغەمبەرگە) بىلدۈرگەن چاغدا، ئۇ (يەنى پەيغەمبەر) ئۇنىڭغا (ھەفسەگە) ئۇ (يەنى ھەفسە) ئاشكارىلاپ قويغان سۆزلەرنىڭ بەزىسىنى ئېيتتى (يەنى يۈزىگە سالدى). بەزىسىنى ئېيتمىدى (يەنى يۈزىگە سالمىدى). پەيغەمبەر ئۇنىڭغا سىرنى ئاشكارىلاپ قويغانلىقىنى ئېيتقان چاغدا، ئۇ (يەنى ھەفسە): «بۇنى ساڭا كىم خەۋەر قىلدى؟» دېدى، پەيغەمبەر: «ماڭا (بۇنى) ھەممىنى بىلىپ تۇرغۇچى، ھەممىدىن تولۇق خەۋەردار اﷲ خەۋەر قىلدى» دېدى",
            "verse 66:4": "ئەگەر (ئائىشە، ھەفسە) ئىككىڭلار اﷲ قا تەۋبە قىلساڭلار (ئۆزۈڭلار ئۈچۈن ياخشىدۇر). سىلەرنىڭ دىلىڭلار (رەسۇلۇللاھ قا ئىخلاس قىلىشتىن) بۇرۇلۇپ كەتتى، ئەگەر سىلەر (رەسۇلۇ اﷲ خوپ كۆرمەيدىغان ئىش ئۈستىدە) ئۇنىڭغا تاقابىل تۇرساڭلار، ئۇ چاغدا اﷲ ئۇنىڭ مەدەتكارىدۇ، ئۇلاردىن باشقا پەرىشتىلەرمۇ (ئۇنىڭغا) يۆلەنچۈكتۇر",
            "verse 66:5": "ئەگەر ئۇ سىلەرنى قويۇۋەتسە، پەرۋەردىگارى سىلەرنىڭ ئورنۇڭلارغا، سىلەردىن ياخشى، (اﷲ نىڭ ۋە پەيغەمبەرنىڭ ئەمرىگە) بويسۇنغۇچى، (اﷲ قا ۋە پەيغەمبەرگە) ئىمان ئېيتقۇچى، ئىتائەت قىلغۇچى، گۇناھلاردىن تۆۋبە قىلغۇچى، ئىبادەت قىلغۇچى، روزا تۇتقۇچى چوكانلارنى ۋە قىزلارنى ئۇنىڭغا بېرىشى مۇمكىن",
            "verse 66:6": "ئى مۆمىنلەر! ئۆزۈڭلارنى ۋە بالا - چاقاڭلارنى ئىنسان ۋە تاشلار يېقىلغۇ بولىدىغان، رەھىم قىلمايدىغان قاتتىق قول پەرىشتىلەر مۇئەككەل بولغان دوزاختىن ساقلاڭلار، ئۇ پەرىشتىلەر اﷲ نىڭ بۇيرۇقىدىن چىقمايدۇ، نېمىگە بۇيرۇلسا شۇنى ئىجرا قىلىدۇ",
            "verse 66:7": "ئى كاپىرلار! بۈگۈن ئۆزرە ئېيتماڭلار، سىلەر پەقەت قىلمىشىڭلارنىڭ جازاسىنى تارتىسىلەر",
            "verse 66:8": "ئى مۆمىنلەر اﷲ قا سەمىمىي تەۋبە قىلىڭلار، ئۈمىدكى، پەرۋەردىگارىڭلار سىلەرنىڭ گۇناھىڭلارنى يوققا چىقىرىدۇ، سىلەرنى ئاستىدىن ئۆستەڭلەر ئېقىپ تۇرىدىغان جەننەتلەرگە كىرگۈزىدۇ، ئۇ كۈندە (يەنى قىيامەت كۈنىدە) اﷲ پەيغەمبەرنى ۋە ئۇنىڭ بىلەن بىللە بولغان مۆمىنلەرنى رەسۋا قىلمايدۇ، ئۇلارنىڭ نۇرى ئۇلارنىڭ ئالدىدا ۋە ئوڭ تەرىپىدە يۈرىدۇ، ئۇلار: «ئى پەرۋەردىگارىمىز! بىزگە نۇرىمىزنى مۇكەممەللەشتۈرۈپ بەرگىن، بىزگە مەغپىرەت قىلغىن، سەن بولساڭ ھەقىقەتەن ھەر نەرسىگە قادىرسەن» دەيدۇ",
            "verse 66:9": "ئى پەيغەمبەر! سەن كۇففارلار بىلەن ۋە مۇناپىقلار بىلەن كۈرەش قىلغىن، ئۇلارغا قاتتىق مۇئامىلە قىلغىن، ئۇلارنىڭ جايى جەھەننەمدۇر، جەھەننەم نېمىدېگەن يامان جاي!",
            "verse 66:10": "اﷲ كۇففارلارغا (ئۇلارنىڭ مۆمىنلەر بىلەن تۇغقانچىلىقىنىڭ پايدا بەرمەسلىكىدە) نۇھنىڭ ئايالىنى ۋە لۇتنىڭ ئايالىنى مىسال قىلىپ كۆرسەتتى، ئۇلار بولسا بىزنىڭ بەندىلىرىمىزدىن ئىككى ياخشى بەندىمىزنىڭ ئەمرىدە ئىدى، ئۇلارنىڭ ئىككىلىسى ئەرلىرىگە (ئىمان ئېيتماسلىق بىلەن) خىيانەت قىلدى، ئۇلارنىڭ ئەرلىرى (يەنى نۇھ بىلەن لۇت) (پەيغەمبەر تۇرۇقلۇق) ئۇلاردىن اﷲ نىڭ ئازابىدىن ھېچ نەرسىنى دەپئى قىلالمىدى. (ئۇ ئىككىسىگە) «دوزاخقا كىرگۈچىلەر بىلەن بىللە كىرىڭلار» دېيىلدى",
            "verse 66:11": "اﷲ ئىمان ئېيتقانلارغا پىرئەۋننىڭ ئايالىنى مىسال قىلىپ كۆرسەتتى، ئۆز ۋاقتىدا ئۇ: «ئى پەرۋەردىگارىم! دەرگاھىڭدا ماڭا جەننەتتىن بىر ئۆي بىنا قىلغىن، مېنى پىرئەۋندىن ۋە ئۇنىڭ يامان ئەمەلىدىن قۇتۇلدۇرغىن، مېنى زالىم قەۋمدىن قۇتۇلدۇرغىن» دېدى",
            "verse 66:12": "ھەمدە ئىمراننىڭ قىزى مەريەمنى مىسال قىلىپ كۆرسەتتى، ئۇ نومۇسىنى ساقلىدى، ئۇنىڭغا بىزنىڭ تەرىپىمىزدىن بولغان روھنى پۈۋلىدۇق (دەم ئۇنىڭ ئىچىگە كىرىپ، ئىساغا ھامىلىدار بولدى)، ئۇ پەرۋەردىگارىنىڭ سۆزلىرىنى ۋە (نازىل قىلغان) كىتابلىرىنى تەستىق قىلدى ۋە اﷲ قا ئىتائەت قىلغۇچىلاردىن بولدى"
        },
        "Uzbek": {
            "verse 66:1": "Эй Набий! Нима учун хотинларинг розилигини тилаб, Аллоҳ сенга ҳалол қилган нарсани ҳаром қиласан! Аллоҳ кечирувчи ва раҳмдилдир.",
            "verse 66:2": "Батаҳҳиқ, Аллоҳ сизларга қасамларингизни бўшатишни шариатга киритди ва Аллоҳ сизнинг хожангиздир ва У ўта билувчи ва ўта ҳикматлидир.",
            "verse 66:3": "Набий хотинларидан баъзисига сир гап айтган эди. Бас, у(сир)дан хабар берди ва Аллоҳ ишни у(Набий)га билдирди. У баъзисини билдирди ва баъзисини эсламади. Қачон (Набий) ул(аёл)га (иш) ҳақида хабар берганида, у, буни сенга ким хабар қилди? деди. У, менга ҳамма нарсани билувчи ва ҳамма нарсадан хабардор Аллоҳ хабар берди, деди.",
            "verse 66:4": "Агар икковингиз Аллоҳга тавба қилсангиз, батаҳқиқ, қалбларингиз (ҳаққа) моил бўлур. Агар унга қарши чиқсангиз, бас, албатта, Аллоҳ унинг ёрдамчисидир ва Жаброил ҳам, солиҳ мўминлар ҳам. Ундан сўнг фаришталар ҳам унга суянчиқдир.",
            "verse 66:5": "У сизларни талоқ қилса, шоядки, Роббиси сиздан яхшироқ, муслима, мўмина, итоатли, тавбачи, ибодатли, рўзадор жувон ва қизларни ўрнингизга хотин қилиб берса.",
            "verse 66:6": "Эй иймон келтирганлар! Ўзингизни ва аҳли аёлингизни ёқилғиси одамлару тошдан бўлган ўтдан сақланг. Унинг тепасида қўпол, дарғазаб фаришталар бўлиб, улар Аллоҳнинг амрига исён қилмаслар ва нимага буюрилсалар, шуни қилурлар.",
            "verse 66:7": "Эй кофир бўлганлар, бугунги кунда узр айтманглар, сиз ўзингиз қилган ишларнинг жазосини олмоқдасиз, холос.",
            "verse 66:8": "Эй иймон келтирганлар! Аллоҳга холис тавба қилинглар! Шоядки Роббингиз гуноҳларингизни ювса ва сизни дарахтлари остидан анҳорлар оқиб турган жаннатларга киритса. Бир кундаки, унда Аллоҳ Набийни ва у билан бирга бўлган иймон келтирганларни шарманда қилмас. Уларнинг нурлари олдиларида ва ўнг тарафларида юриб борадир. Улар эса, Роббимиз, бизга нуримизни батамом қилиб бер, гуноҳларимизни кечир, албатта, Сен барча нарсага қодирсан, дерлар.",
            "verse 66:9": "Эй Набий! Кофир ва мунофиқларга қарши жиҳод қил ва уларга маҳкам тур. Уларнинг жойи жаҳаннамдир ва у жой қандоқ ҳам ёмон манзил!",
            "verse 66:10": "Аллоҳ куфр келтирганларга Нуҳнинг хотини ва Лутнинг хотинини мисол қилиб келтирди. Улар бандаларимиздан икки солиҳ банданинг тагида эдилар. Бас, уларга хиёнат қилдилар ва (эрлари) улардан Аллоҳнинг азобини қайтара олмадилар ва уларга, дўзахга кирувчилар билан киринглар, дейилди.",
            "verse 66:11": "Аллоҳ иймон келтирганларга Фиръавннинг хотинини мисол қилиб кўрсатди. У: «Роббим, менга Ўз ҳузурингда, жаннатда бир уй бино қилгин. Менга Фиръавндан ва унинг ишидан нажот бергин ва золим қавмлардан нажот бергин, деб айтди.",
            "verse 66:12": "Ва Марям Имрон қизини (мисол келтирди), у фаржини пок сақлаган эди, Биз унга Ўз руҳимиздан пуфладик ва у Роббисининг сўзларини ҳамда китобларини тасдиқ қилди ва итоаткорлардан бўлди."
        },
        "Vietnamese": {
            "verse 66:1": "Hỡi Nabi, tại sao Ngươi lại cấm (chính mình) những gì Allah đã cho phép Ngươi, để làm vừa lòng các bà vợ của Ngươi? Và Allah là Đấng Tha Thứ, Đấng Nhân Từ.",
            "verse 66:2": "Quả thật, Allah đã qui định cho các ngươi (hỡi những người Muslim) cách thức xóa bỏ lời thề của các ngươi. Allah là Đấng bảo hộ của các ngươi, Ngài là Đấng Toàn Tri, Đấng Thông Thái.",
            "verse 66:3": "Và (hãy nhớ lại) khi Nabi tâm sự với một trong những người vợ của mình, người vợ đó đã tiết lộ nó sau đó. Allah đã cho Y biết sự việc đó, Y đã xác nhận một phần và bỏ qua một phần khác. Khi Y nói với nàng ta về điều đó thì nàng ta nói: “Ai đã cho chàng biết điều này?” Y đáp: “Đấng Toàn Tri, Đấng Thông Toàn đã cho Ta biết.”",
            "verse 66:4": "Nếu hai ngươi (‘A-ishah và Hafsah) biết ăn năn sám hối với Allah thì quả thật trái tim của hai ngươi đã chịu thuận, nhưng nếu hai ngươi tiếp tay nhau chống lại (Thiên Sứ Muhammad) thì quả thực Allah là Đấng bảo vệ Y, Đại Thiên Thần Jibril và những người có đức tin cũng vậy; và các vị Thiên Thần khác đều sẽ ủng hộ Y.",
            "verse 66:5": "Nếu (Thiên Sứ Muhammad) ly dị tất cả các ngươi (hỡi những người vợ của Y), Thượng Đế của Y có thể sẽ đổi lại cho Y các bà vợ khác tốt hơn các ngươi. Họ sẽ là những phụ nữ Muslim có đức tin, sùng đạo, năng sám hối, luôn thờ phượng, nhịn chay, đã từng kết hôn hay còn con gái.",
            "verse 66:6": "Hỡi những người có đức tin! Các ngươi hãy bảo vệ bản thân và gia đình khỏi Hỏa Ngục, nơi mà chất đốt của nó là con người và đá, được những vị Thiên Thần lạnh lùng và nghiêm nghị cai quản. Họ không trái lệnh Allah bất cứ điều gì, họ chỉ biết thi hành đúng theo lệnh (của Ngài).",
            "verse 66:7": "Hỡi những kẻ vô đức tin! Các ngươi đừng hòng chạy tội vào Ngày đó. Quả thật các ngươi chắc chắn sẽ được đền đáp (xứng đáng) cho những gì các ngươi đã từng làm.",
            "verse 66:8": "Hỡi những người có đức tin! Các ngươi hãy chân thành sám hối với Allah, hy vọng rằng Thượng Đế của các ngươi sẽ xóa tội cho các ngươi và sẽ thu nhận các ngươi vào các Ngôi Vườn Thiên Đàng bên dưới có các dòng sông chảy vào Ngày mà Allah sẽ không hạ nhục Nabi và những người có đức tin cùng với Y. Ánh sáng của họ sẽ chiếu rọi đằng trước và bên phải của họ, họ sẽ nói: “Lạy Thượng Đế của bầy tôi! Xin Ngài hoàn thiện cho bầy tôi ánh sáng của bầy tôi và xin Ngài tha thứ tội lỗi cho bầy tôi, quả thật, Ngài là Đấng Toàn Năng trên tất cả mọi thứ.”",
            "verse 66:9": "Hỡi Nabi! Ngươi hãy chiến đấu chống lại những kẻ vô đức tin và những kẻ giả tạo đức tin, Ngươi hãy nghiêm khắc với chúng. Quả thật, chỗ ở của chúng sẽ là Hỏa Ngục, một đích đến vô cùng tồi tệ.",
            "verse 66:10": "Allah đưa ra một ví dụ cho những kẻ vô đức tin là vợ của Nuh và vợ của Lut. Cả hai ở dưới quyền của hai Bề Tôi đức hạnh của TA nhưng cả hai đã phản bội họ. Vì vậy, các vị Nabi đó chẳng giúp ích gì được cho cả hai ở nơi Allah và cả hai sẽ được bảo: “Hai ngươi hãy vào Hỏa Ngục cùng với những kẻ đi vào.”",
            "verse 66:11": "Và Allah đưa ra một ví dụ cho những người có đức tin: vợ của Pha-ra-ông, khi nữ cầu nguyện thưa: “Lạy Thượng Đế của bề tôi! Xin Ngài xây cho bề tôi một ngôi nhà gần Ngài nơi Thiên Đàng và xin Ngài cứu bề tôi thoát khỏi Pha-ra-ông và những việc làm của hắn và xin Ngài cứu bề tôi thoát khỏi đám người làm điều sai quấy.”",
            "verse 66:12": "Và (một ví dụ nữa): Maryam, con gái của ‘Imran, Nữ đã giữ sự trong trắng của mình. Vì vậy, TA (Allah) đã cho Ruh (Đại Thiên Thần Jibril) của TA thổi vào (cơ thể của) Nữ và Nữ đã tin sự Thật về Lời phán của Thượng Đế của Nữ, Nữ đã tin vào các Kinh Sách của Ngài và Nữ là một người hết lòng vâng lời (Ngài)."
        },
        "Yoruba": {
            "verse 66:1": "Iwo Anabi, nitori ki ni o se maa so nnkan ti Allahu se ni eto fun o di eewo? Iwo n wa iyonu awon iyawo re. Allahu si ni Alaforijin, Asake-orun",
            "verse 66:2": "Dajudaju Allahu ti se alaye ofin itanran ibura yin fun yin. Allahu ni Oluranlowo yin. Oun si ni Onimo, Ologbon",
            "verse 66:3": "Ranti nigba ti Anabi ba okan ninu awon iyawo re s’oro asiri. Nigba ti (eni t’o ba soro, iyen Hafsoh) si soro naa fun (‘A’isah), Allahu si fi han Anabi (pe elomiiran ti gbo si i). Anabi si so apa kan re (fun Hafsoh pe: \"O ti fi oro Moriyah to ‘A’isah leti.\"). O si fi apa kan sile (iyen, oro nipa ipo arole). Amo nigba ti (Anabi) fi iro naa to o leti, Hafsoh) so pe: \"Ta ni o fun o ni iro eyi?\" (Anabi) so pe: \"Onimo, Alamotan l’O fun mi ni iro naa",
            "verse 66:4": "Ti eyin mejeeji ba ronu piwada si odo Allahu, (O maa gba ironupiwada yin). Sebi okan yin kuku ti te (sibi ki Anabi ma fee Moriyah). Ti e ba si ran ara yin lowo (lati ko ibanuje) ba a, dajudaju Allahu ni Oluranlowo re, ati (molaika) Jibril ati eni rere ninu awon onigbagbo ododo. Leyin iyen, awon molaika ti won je oluranlowo (tun wa fun un)",
            "verse 66:5": "O see se, ti o ba ko yin sile, ki Oluwa re fi awon obinrin kan, ti won loore ju yin lo ropo fun un, (ti won maa je) musulumi, onigbagbo ododo, awon olutele-ase, awon oluronupiwada, olujosin, olugbaawe ni adelebo ati wundia",
            "verse 66:6": "Eyin ti e gbagbo ni ododo, e so emi ara yin ati awon ara ile yin nibi Ina. Eniyan ati okuta ni nnkan ikona re. Awon molaika t’o roro, ti won le ni eso re. Won ko nii yapa ase Allahu nibi ohun ti O ba pa lase fun won. Won si n se ohun ti won ba pa lase fun won",
            "verse 66:7": "Eyin ti e sai gbagbo, e ma se saroye ni ojo oni. Ohun ti e n se nise ni A oo fi san yin ni esan",
            "verse 66:8": "Eyin ti e gbagbo ni ododo, e ronu piwada si odo Allahu ni ironupiwada ododo. O see se pe Oluwa yin maa pa awon asise yin re fun yin. O si maa mu yin wo inu awon Ogba Idera ti awon odo n san ni isale re. Ni ojo ti Allahu ko nii doju ti Anabi ati awon t’o gbagbo ni ododo pelu re. Imole won yoo maa tan ni iwaju won ati ni owo otun won. Won yoo so pe: \"Oluwa wa, pe imole wa fun wa, ki O si forijin wa. Dajudaju Iwo ni Alagbara lori gbogbo nnkan",
            "verse 66:9": "Iwo Anabi, gbogun ti awon alaigbagbo ati awon sobe-selu musulumi. Ki o si le mo won. Ibugbe won si ni ina Jahanamo. Ikangun naa si buru",
            "verse 66:10": "Allahu fi iyawo (Anabi) Nuh ati iyawo (Anabi) Lut se apeere fun awon t’o sai gbagbo. Awon mejeeji wa labe erusin meji rere ninu awon erusin Wa. Awon (obinrin) mejeeji si janba awon oko won. Awon oko won ko si fi kini kan ro won loro lodo Allahu. A o si so fun awon obinrin mejeeji pe: \"E wo inu Ina pelu awon oluwole (sinu Ina)",
            "verse 66:11": "Allahu tun fi iyawo Fir‘aon se apeere fun awon t’o gbagbo. Nigba ti o so pe: \"Oluwa mi, ko ile kan fun mi lodo Re ninu Ogba Idera. La mi lowo Fir‘aon ati ise owo re. Ki O si la mi lowo ijo alabosi",
            "verse 66:12": "Ati Moryam omobinrin ‘Imron, eyi ti o so abe re. A si fe ategun si i lara ninu ategun emi ti A da. O gbagbo lododo ninu awon oro Oluwa re ati awon Tira Re. O si wa ninu awon olutele-ase Allahu"
        }
    }
}