{
    "id": 66,
    "name_simple": "At-Tahrim",
    "revelation_place": "madinah",
    "revelation_order": 107,
    "bismillah_pre": true,
    "verses_count": 12,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah derived its name from the words lima tuharrimu of the very first verse. This too is not a title of its subject matter, but the name implies that it is the Surah in which the incident of tahrim (prohibition, forbiddance) has been mentioned.",
    "text": [
        "\n",
        "The Surah derived its name from the words lima tuharrimu of the very first verse. This too is not a title of its subject matter, but the name implies that it is the Surah in which the incident of tahrim (prohibition, forbiddance) has been mentioned.",
        "\n",
        "Period of Revelation",
        "\n",
        "In connection with the incident of tahrim referred to in this Surah, the traditions of the Hadith mention two ladies who were among the wives of the Holy Prophet (upon whom be peace) at that time Hadrat Safiyyah and Hadrat Mariyah Qibtiyyah. The former (i. e. Hadrat Safiyyah) was taken to wife by the Holy Prophet after the conquest of Khaiber, and Khaiber was conquered, as has been unanimously reported, in A. H. 7. The other lady, Hadrat Mariyah, had been presented to the Holy Prophet by Muqawqis, the ruler of Egypt, in A. H. 7 and she had borne him his son, Ibrahim, in Dhil-Hijjah, A. H. 8.These historical events almost precisely determine that this Surah was sent down some time during A.H. 7 or A. H 8.",
        "\n",
        "Theme and Topics",
        "\n",
        "This is a very important Surah in which light has been thrown on some questions of grave significance with reference to some incidents concerning the wives of the Holy Prophet (upon whom be Allah's peace).",
        "\n",
        "First, that the powers to prescribe the bounds of the lawful and the unlawful, the permissible and the forbidden, are entirely and absolutely in the hand of Allah and nothing has been delegated even to the Prophet of Allah himself, not to speak of any other man. The Prophet as such can declare something lawful or unlawful only if he receives an inspiration from Allah to do so whether that inspiration is embodied in the Qur'an, or imparted to, him secretly. However, even the Prophet is not authorized to declare anything made permissible by Allah unlawful by himself, much less to say of another man.",
        "\n",
        "Second, that in any society the position of a Prophet is very delicate. A minor incident experienced by an ordinary man in his life may not be of any consequence, but it assumes the status of law when experienced by a Prophet. That is why the lives of the Prophets have been kept under close supervision by Allah so that none of their acts, not even a most trivial one, may deviate from Divine Will. Whenever such an act has emanated from a Prophet, it was rectified and rectified immediately so that the Islamic law and its principles should reach the people in their absolute purity not only through the Divine Book but also through the excellent example of the Prophet, and they should include nothing which may be in disagreement with Divine Will,",
        "\n",
        "Thirdly, and this automatically follows from the above mentioned point, that when the Holy Prophet (upon whom be peace) was checked on a minor thing, which was not only corrected but also recorded, it gives us complete satisfaction that whatever actions and commands and instructions we now find in the pure life of the Holy Prophet concerning which there is nothing on record in the nature of criticism or correction from Allah, they are wholly based on truth, are in complete conformity with Divine Will and we can draw guidance from them with full confidence and peace of mind.",
        "\n",
        "The fourth thing that we learn from this discourse is that about the Holy Messenger himself, whose reverence and respect Allah Himself has enjoined as a necessary part of the Faith of His servants, it has been stated in this Surah that once during his sacred life he made a thing declared lawful by Allah unlawful for himself only to please his wives; then Allah has severely reproved for their errors those very wives of the Holy Prophet, whom He Himself has declared as mothers of the faithful and worthy of the highest esteem and honor by them. Then, this criticism of the Prophet and the administration of the warning to the wives also has not been made secretly but included in the Book, which the entire Ummah has to read and recite for ever. Obviously, neither the intention of making mention of it in the Book of Allah was, nor it could be, that Allah wanted to degrade His Messenger and the mothers of the faithful in the eyes of the believers; and this also is obvious that\r\nno Muslim has lost respect for them, in his heart after reading this Surah of the Qur'an. Now, there cannot be any other reason of mentioning this thing in the Qur'an than that Allah wants to acquaint the believers with the correct manner of reverence for their great personalities. The Prophet is a Prophet, not God, that he may commit no error. Respect of the Prophet has not been enjoined because he is infallible, but because he is a perfect representative of Divine Will, and Allah has not permitted any of his errors to pass by unnoticed. This gives us the satisfaction that the noble pattern of life left by the Prophet wholly and fully represents the will of Allah. Likewise, the Companions of the holy wives of the Prophet, were human, not angels or super men. They could commit mistakes. Whatever ranks they achieved became possible only because the guidance given by Allah and the training imparted by Allah's Messenger had moulded them into the finest models. Whatever esteem and\r\nreverence they deserve is on this very basis and not on the presumption that they were infallible. For this reason, whenever in the sacred lifetime of the Prophet (upon him be peace) the Companions or holy wives happened to commit an error due to human weakness, they were checked. Some of their errors were corrected by the Holy Prophet, as has been mentioned at many places in the Hadith ; some other errors were mentioned in the Qur'an and Allah Himself corrected them so that the Muslims might not form any exaggerated notion of the respect and reverence of their elders and great men, which might raise them from humanity to the position of gods and goddesses. If one studies the Quran carefully, one will see instances of this one after the other. In Surah Al-Imran, in connection with the Battle of Uhud, the Companions have been addressed and told:",
        "\n",
        "\"Allah did fulfill His promise (of help) to you : in the initial stage of the battle, it was you who were killing them by Allah's leave until you lost heart and disputed about your duty and disobeyed your leader, when Allah showed you what (the spoils) you coveted for there were among you sortie who hankered after the life of this world, and others: who cherished the life after death. Then Allah caused your retreat before the disbelievers in order to test you, but the fact is that even then Allah pardoned you, for Allah is very gracious to the believers.\" (v. 152).",
        "\n",
        "In surah An-Nur, in connection with the Slander against Hadrat Aisha, the Companions were told,",
        "\n",
        "\"When you heard of it, why did not the believing men and the believing women have a good opinion of themselves, and why did they not say: this is a manifest slander?......Were it not for Allah's grace and mercy towards you in this world and in the Hereafter, a painful scourge would have visited you because of the slander. (Just consider) when you passed this lie on from one tongue to the other and uttered with your mouths that of which you had no knowledge. You took it as a trifling matter whereas it was a grave offense in the sight of Allah. Why did you not, as soon as you heard of it, say 'It is not proper for us to utter such a thing? Glory be to Allah! This is a great slander'.\"Allah admonishes you that in future you should never repeat anything like this, if you are true believers.\" (vv. 12-17).",
        "\n",
        "In surah Al-Ahzab, the holy wives have been addressed thus: \"O Prophet, say to your wives If you seek the world and its adornments, come, I shall give you of these and send you off in a good way. But if you seek Allah and His Messenger and the abode of the Hereafter, you should rest assured that Allah has prepared a great reward for those of you, who do good.\" (vv. 28-29).",
        "\n",
        "In Surah Jumu'ah about the Companions it was said:",
        "\n",
        "\"And when they saw some merchandise and amusement they broke off to it and left you (O Prophet) standing (in the course of the Sermon). Say to them : that which is with Allah is far better than amusement and merchandise, and Allah is the best of all providers.\" (v. 11).",
        "\n",
        "In Surah Al-Mumtahinah, Hadrat Hatib bin Abi Balta'ah, a Companion who had fought at Badr, was severely taken to task because he had sent secret information to the disbelieving Quraish about the Holy Prophet's invasion before the conquest of Makkah.",
        "\n",
        "All these instances are found in the Qur'an itself, in the same Qur'an in which Allah Himself has paid tribute to the Companions and the holy wives for their great merits, and granted them the certificate of His good pleasure, saying: \"Allah became well pleased with them and they with Allah.\" It was this same moderate and balanced teaching of the reverence and esteem of the great men, which saved the Muslims from falling into the pit of man worship in which the Jews and the Christians fell, and it is a result of the same that in the books that the eminent followers of the Sunnah have compiled on the subjects of the Hadith, Commentary of the Qur'an and History, not only have the excellences and great merits of the Companions and holy wives and other illustrious men been mentioned, but also no hesitance has been shown in mentioning the incidents relating to their weaknesses, errors and mistakes, whereas those scholars were more appreciative of the merits and\r\nexcellences of the great men and understood the bounds and limits of reverence better than those who claim to be the upholders of reverence for the elders today.",
        "\n",
        "The fifth thing that has been explicitly mentioned in this Surah is that Allah's Religion is absolutely fair and just. It has for every person just that of which he becomes worthy on the basis of his faith and works. No relationship or connection even with the most righteous person can be beneficial for him in any way and no relationship or connection with the most evil and wicked person can be harmful for him in any way. In this connection three kinds of women have been cited as examples before the holy wives in particular. One example is of the wives of the Prophets Noah and Lot, who, if they had believed and cooperated with their illustrious husbands, would have occupied the same rank and position in the Muslim community. which is enjoyed by the wives of the Holy Prophet Muhammad (upon whom be Allah's peace and blessings). But since they were disbelievers, their being the wives of the Prophets did not help them and they fell into Hell. The second example is of the wife of\r\nPharaoh, who in spite of being the wife of a staunch enemy of God believed and chose a path of action separate from that followed by the Pharaoh's people, and her being the wife of a staunch disbeliever did not cause her any harm, and Allah made her worthy of Paradise. The third example is of Hadrat Maryam (Mary) (peace be upon her), who attained to the high rank because she submitted to the severe test to which Allah had decided to put her. Apart from Mary no other chaste and righteous girl in the world ever has been put to such a hard test that in spite of being unmarried, she might have been made pregnant miraculously by Allah's command and informed what service her Lord willed to take from her. When Hadrat Maryam accepted this decision, and agreed to bear, like a true believer, everything that she inevitably had to bear in order to fulfill Allah's will, then did Allah exalt her to the noble rank of Sayyidatu an-nisa' fil- Jannah : \"Leader of the women in Paradise\"\r\n(Musnad Ahmad).",
        "\n",
        "Besides, another truth that we learn from this Surah is that the Holy Prophet (upon whom be peace) did not receive from Allah only that knowledge which is included and recorded in the Qur'an, but he was given information about other things also by revelation, which has not been recorded in the Qur'an. Its clear proof is verse 3 of this Surah. In it we are told that the Holy Prophet (upon whom be peace) confided a secret to one of his wives, and she told it to another. Allah informed the Holy Prophet of this secret. Then, when the Holy Prophet warned his particular wife on the mistake of disclosure and she said:\"Who has informed you of this mistake of mine7\" he replied: \"I have been informed of it by Him Who knows everything and is All Aware.\" Now, the question is where in the Qur'an is the verse in which Allah has said \"O Prophet, the secret that you had confided to one of your wives, has been disclosed by her to another person, or to so and so?If there is no such verse in the\r\nQur'an, and obviously there is none, this is an express proof of the fact that revelation descended on the Holy Prophet besides the Qur'an as well. This refutes the claim of the deniers of Hadith, who allege that nothing was sent down to the Holy Prophet (upon whom be peace) apart from the Qur'an.",
        "\n"
    ],
    "description": "The surah that opens with admonishing the Prophet against The Forbidding or prohibition of something he once imposed on himself for the purpose of not oending his wives, though God had made it lawful for him. Named after the phrase “why do you forbid” (li mā tuḥrimu) in verse 1. It mentions two of the Prophet’s wives, namely Ḥafṣah and ʿĀyishah, for an incident when a confidence was betrayed (verse 3 .) and urges all believers to submit themselves to God and to guard themselves and their families against Hellfire (verse 6). The surah closes by giving examples of believing and disbelieving women (verse 10 .).The surah is also known as: Holding (something) to be Forbidden, The Prohibition.",
    "name_translation": "THE FORBIDDING",
    "name_complex": "At-Tahrîm",
    "surah_name_ar": "التحريم",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 66:1": "O Pejgamber! Përse po ia ndalon vetes atë që ta ka lejuar Perëndia ty, në kërkimin e kënaqësisë së grave tuaja.",
                            "verse 66:2": "Perëndia ju ka bërë të mundshme që të liroheni nga betimet tuaja; Perëndia është Zoti juaj; Ai është i Plotëdijshëm dhe i Gjithëdijshëm.",
                            "verse 66:3": "Kur Pejgamberi ia shfaqi një fjalë të fshehtë njërës prej grave të tij; e ajo pastaj e shpalli këtë fjalë, - e Perëndia ia zbuloi këtë Pejgamberit – ai një pjesë të këtij zbulimi e tregoi, kurse pjesën tjetër e heshti.",
                            "verse 66:4": "Nëse ju të dyja pendoheni te Perëndia, se zemrat tuaja kanë anuar (Perëndia ju falë).",
                            "verse 66:5": "Në qoftë se ju lëshon ai juve, Zoti i tij mund t’ia zëvendësojë ato – atij, me gra më të mira se ju: muslimane dhe besimtare, përulëse, penduese, lutëse (shumë) agjëruese, të veja dhe vasha.",
                            "verse 66:6": "O ju që besoni! Ruani veten dhe familjet tuaja nga zjarri, karburante (lëndë djegëse) të të cilit janë njerëzit dhe gurët, dhe të cilin e mbikëqyrin engjëjt e fuqishëm dhe të ashpër, të cilët nuk u kundërshtojnë urdhërave të Perëndisë dhe të cilët punojnë për atë që urdhërohen.",
                            "verse 66:7": "O ju që nuk keni besuar! Mos u arsyetoni sot, sepse, me të vërtetë, dënoheni vetëm për veprat që keni bërë.",
                            "verse 66:8": "O ju që kei besuar! Pendohuni sinqerisht te Perëndia, se Zoti juaj mund t’ua shlyejë gabimet tuaja e t’ju shpiejë në kopshte, nëpër të cilët rrjedhin lumenjt, në Ditën në të cilën Perëndia nuk do ta turpërojë Profetin dhe ata që bashkë me të kanë besuar; drita e tyre ecë para tyre dhe në të djathtë të tyre.",
                            "verse 66:9": "O Profet! Luftoji të pafetë dhe hipokritët dhe bëhu i ashpër ndaj tyre! Vendbanimi i tyre do të jetë skëterra.",
                            "verse 66:10": "Perëndia jep shembull, për ata që nuk besojnë, - gruan e Nuhut dhe gruan e Lutit: ato kanë qenë të martuara për dy njerëz nga njerëzit Tonë të ndershëm, por ato ndaj tyre kanë qenë mashtruese (hipokrite) – dhe ata dy nuk do të mund t’u ndihmojnë atyre dyjave – te Perëndia (për t’i shpëtuar nga dënimi), e do t’u thuhet atyre: “Hyni ju të dyja në zjarr, me ata (të gjithë) që po hyjnë!”",
                            "verse 66:11": "E, Perëndia jep shembull për ata që besojnë – gruan e Faraonit, kur ajo tha: “O Zoti im, ndërtoma mua një banesë te Ti në xhennet, dhe më shpëto nga Faraoni dhe veprat e tij, dhe më shpëto nga populli zullumqar!”",
                            "verse 66:12": "dhe, (shembullin) e merjemës, të bijës së Imranit, e cila e ka ruajtur virgjinitetin e saj, e Ne kemi frymëzuar në te, prej Shpirtit Tonë."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Ya Peyğəmbər! Zövcələrinin (səndən) razı qalmasını diləyərək Allahın sənə halal etdiyi şeyi (dünya ləzzətini) niyə özünə haram (qadağan) edirsən? Allah bağışlayandır, rəhm edəndir!",
                            "verse 66:2": "Həqiqətən, Allah (halal bir şeyi özünüzə haram etmək barəsində içdiyiniz) andlarınızı (kəffarə verməklə) geri götürməyi vacib (qanuni) etmişdir.",
                            "verse 66:3": "Bir zaman Peyğəmbər öz zövcələrindən birinə (Həfsəyə) gizli bir söz (bir daha Zeynəb bint Cəhşin, yaxud Mariyeyi-Qibtiyyənin yanına getməyəcəyini) demişdi.",
                            "verse 66:4": "(Ey Həfsə, ey Aişə!) Əgər ikiniz də (bu hərəkətinizə görə) Allaha tövbə etsəniz (çox yaxşı olar).",
                            "verse 66:5": "Əgər o sizi boşasa, ola bilsin ki, Rəbbi sizin əvəzinizə ona sizdən daha yaxşı zövcələr - müsəlman, mö'min, itaətkar, tövbəkar, ibadət edən, oruc tutan dul qadınlar və bakirə qızlar versin!",
                            "verse 66:6": "Ey iman gətirənlər! ?zünüzü və əhli-əyalınızı elə bir oddan qoruyun ki, onun yanacağı insanlar və daşlar (daşdan düzəlmiş bütlər), xidmətçiləri isə Allahın onlara verdiyi əmrlərə asi olamayan, buyurduqlarını yerinə yetirən daş qəlbli (heç kəsə zərrəcə rəhm etməyən) və çox sərt təbiətli mələklərdir (zəbanilərdir).",
                            "verse 66:7": "(Kafirlər cəhənnəm oduna atıldıqları zaman onlara belə deyiləcəkdir: ) \"Ey kafir olanlar! Bu gün heç bir üzrxahlıq etməyin.",
                            "verse 66:8": "Ey iman gətirənlər! Allaha səmimi-qəlbdən (bir daha günaha qayıtmamaq şərtilə) tövbə edin.",
                            "verse 66:9": "Ya Peyğəmbər! Kafirlərə qarşı (qılıncla), münafiqlərə qarşı (sözlə) vuruş.",
                            "verse 66:10": "Allah kafirlərə Nuhun övrəti ilə Lutun övrətini misal çəkdi.",
                            "verse 66:11": "Allah iman gətirənlərə isə Fir'onun zövcəsini (Asiyə bint Məzahimi) misal çəkdi.",
                            "verse 66:12": "(Allah mö'min qadınlara) həmçinin namusunu (ismətini) möhkəm qoruyub saxlamış İmranın qızı Məryəmi də misal çəkdi."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "O Vjerovjesniče, zašto sebi uskraćuješ ono što ti je Allah dozvolio - u nastojanju da žene svoje zadovoljiš? A Allah prašta i samilostan je.",
                            "verse 66:2": "Allah vam je propisao kako da svoje zakletve iskupite; Allah je vaš Gospodar; On sve zna i mudar je.",
                            "verse 66:3": "Kada je Vjerovjesnik jednoj od svojih žena jednu tajnu povjerio",
                            "verse 66:4": "Ako vas dvije učinite pokajanje Allahu, pa - vi ste bile učinile ono zbog čega ste se trebale pokajati.",
                            "verse 66:5": "Ako vas on pusti, Gospodar njegov će mu dati umjesto vas boljih žena od vas; odanih Allahu, vjernica, poslušnih Allahu, pokajnica, koje se Allaha boje, koje poste, udovica i djevojaka.",
                            "verse 66:6": "O vi koji vjerujete, sebe i porodice svoje čuvajte od vatre čije će gorivo ljudi i kamenje biti, i o kojoj će se meleki strogi i snažni brinuti, koji se onome što im Allah zapovjedi neće opirati, i koji će ono š",
                            "verse 66:7": "O vi koji niste vjerovali, danas se ne pravdajte, kažnjavate se samo za ono što ste zaslužili.",
                            "verse 66:8": "O vi koji vjerujete, učinite pokajanje Allahu iskreno, da bi Gospodar vaš preko ružnih postupaka vaših prešao i da bi vas u džennetske bašče, kroz koje će rijeke teći, uveo, na Dan u kojem Allah neće",
                            "verse 66:9": "O Vjerovjesniče, bori se protiv nevjernika i licemjera i budi strog prema njima! Njihovo prebivalište biće Džehennem, a užasno je to boravište!",
                            "verse 66:10": "Allah navodi kao pouku onima koji ne vjeruju ženu Nuhovu i ženu Lutovu: bile su udate za dva čestita roba Naša, ali su prema njima licemjerne bile - i njih dvojica im neće ništa moći kod Allaha pomoći, i reći &",
                            "verse 66:11": "A onima koji vjeruju - Allah kao pouku navodi ženu faraonovu, kad je rekla: \"Gospodaru moj, sagradi mi kod Sebe kuću u Džennetu i spasi me od faraona i mučnja njegova, i izbavi me od naroda nepravednog!\"",
                            "verse 66:12": "Merjemu, kćer Imranovu, koja je nevinost svoju sačuvala, a Mi smo udahnuli u nju život i ona je u riječi Gospodara svoga i knjige Njegove vjerovala i od onih koji provode vrijeme u molitvi bila."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "হে নবী, আল্লাহ আপনার জন্যে যা হালাল করছেন, আপনি আপনার স্ত্রীদেরকে খুশী করার জন্যে তা নিজের জন্যে হারাম করেছেন কেন? আল্লাহ ক্ষমাশীল, দয়াময়।",
                            "verse 66:2": "আল্লাহ তোমাদের জন্যে কসম থেকে অব্যহতি লাভের উপায় নির্ধারণ করে দিয়েছেন। আল্লাহ তোমাদের মালিক। তিনি সর্বজ্ঞ, প্রজ্ঞাময়।",
                            "verse 66:3": "যখন নবী তাঁর একজন স্ত্রীর কাছে একটি কথা গোপনে বললেন, অতঃপর স্ত্রী যখন তা বলে দিল এবং আল্লাহ নবীকে তা জানিয়ে দিলেন, তখন নবী সে বিষয়ে স্ত্রীকে কিছু বললেন এবং কিছু বললেন না। নবী যখন তা স্ত্রীকে বললেন, তখন স্ত্রী বললেনঃ কে আপনাকে এ সম্পর্কে অবহিত করল? নবী বললেন,ঃ যিনি সর্বজ্ঞ, ওয়াকিফহাল, তিনি আমাকে অবহিত করেছেন।",
                            "verse 66:4": "তোমাদের অন্তর অন্যায়ের দিকে ঝুঁকে পড়েছে বলে যদি তোমরা উভয়ে তওবা কর, তবে ভাল কথা। আর যদি নবীর বিরুদ্ধে একে অপরকে সাহায্য কর, তবে জেনে রেখ আল্লাহ জিবরাঈল এবং সৎকর্মপরায়ণ মুমিনগণ তাঁর সহায়। উপরন্তুত ফেরেশতাগণও তাঁর সাহায্যকারী।",
                            "verse 66:5": "যদি নবী তোমাদের সকলকে পরিত্যাগ করেন, তবে সম্ভবতঃ তাঁর পালনকর্তা তাঁকে পরিবর্তে দিবেন তোমাদের চাইতে উত্তম স্ত্রী, যারা হবে আজ্ঞাবহ, ঈমানদার, নামাযী তওবাকারিণী, এবাদতকারিণী, রোযাদার, অকুমারী ও কুমারী।",
                            "verse 66:6": "মুমিনগণ, তোমরা নিজেদেরকে এবং তোমাদের পরিবার-পরিজনকে সেই অগ্নি থেকে রক্ষা কর, যার ইন্ধন হবে মানুষ ও প্রস্তর, যাতে নিয়োজিত আছে পাষাণ হৃদয়, কঠোরস্বভাব ফেরেশতাগণ। তারা আল্লাহ তা’আলা যা আদেশ করেন, তা অমান্য করে না এবং যা করতে আদেশ করা হয়, তাই করে।",
                            "verse 66:7": "হে কাফের সম্প্রদায়, তোমরা আজ ওযর পেশ করো না। তোমাদেরকে তারই প্রতিফল দেয়া হবে, যা তোমরা করতে।",
                            "verse 66:8": "মুমিনগণ! তোমরা আল্লাহ তা’আলার কাছে তওবা কর-আন্তরিক তওবা। আশা করা যায়, তোমাদের পালনকর্তা তোমাদের মন্দ কর্মসমূহ মোচন করে দেবেন এবং তোমাদেরকে দাখিল করবেন জান্নাতে, যার তলদেশে নদী প্রবাহিত। সেদিন আল্লাহ নবী এবং তাঁর বিশ্বাসী সহচরদেরকে অপদস্থ করবেন না। তাদের নূর তাদের সামনে ও ডানদিকে ছুটোছুটি করবে। তারা বলবেঃ হে আমাদের পালনকর্তা, আমাদের নূরকে পূর্ণ করে দিন এবং আমাদেরকে ক্ষমা করুন। নিশ্চয় আপনি সবকিছুর উপর সর্ব শক্তিমান।",
                            "verse 66:9": "হে নবী! কাফের ও মুনাফিকদের বিরুদ্ধে জেহাদ করুন এবং তাদের প্রতি কঠোর হোন। তাদের ঠিকানা জাহান্নাম। সেটা কতই না নিকৃষ্ট স্থান।",
                            "verse 66:10": "আল্লাহ তা’আলা কাফেরদের জন্যে নূহ-পত্নী ও লূত-পত্নীর দৃষ্টান্ত বর্ণনা করেছেন। তারা ছিল আমার দুই ধর্মপরায়ণ বান্দার গৃহে। অতঃপর তারা তাদের সাথে বিশ্বাসঘাতকতা করল। ফলে নূহ ও লূত তাদেরকে আল্লাহ তা’আলার কবল থেকে রক্ষা করতে পারল না এবং তাদেরকে বলা হলঃ জাহান্নামীদের সাথে জাহান্নামে চলে যাও।",
                            "verse 66:11": "আল্লাহ তা’আলা মুমিনদের জন্যে ফেরাউন-পত্নীর দৃষ্টান্ত বর্ণনা করেছেন। সে বললঃ হে আমার পালনকর্তা! আপনার সন্নিকটে জান্নাতে আমার জন্যে একটি গৃহ নির্মাণ করুন, আমাকে ফেরাউন ও তার দুস্কর্ম থেকে উদ্ধার করুন এবং আমাকে যালেম সম্প্রদায় থেকে মুক্তি দিন।",
                            "verse 66:12": "আর দৃষ্টান্ত বর্ণনা করেছেন এমরান-তনয়া মরিয়মের, যে তার সতীত্ব বজায় রেখেছিল। অতঃপর আমি তার মধ্যে আমার পক্ষ থেকে জীবন ফুঁকে দিয়েছিলাম এবং সে তার পালনকর্তার বানী ও কিতাবকে সত্যে পরিণত করেছিল। সে ছিল বিনয় প্রকাশকারীনীদের একজন। দিন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 66:1": "О, Пророче, защо си възбраняваш онова, което Аллах ти е разрешил, стремейки се да угодиш на своите съпруги.",
                            "verse 66:2": "Аллах вече наложи изкупление при отмятане от вашите клетви.",
                            "verse 66:3": "Пророка тайно довери на една от своите съпруги новина.",
                            "verse 66:4": "И двете се покайте пред Аллах, защото сърцата ви са се подвели.",
                            "verse 66:5": "помощници.",
                            "verse 66:6": "Ако той се разведе с вас, неговият Господ може да му дари в замяна съпруги, по-добри от вас, отдадени на Аллах, вярващи, покорни, разкайващи се, служещи [на Аллах], говеещи, омъжвани преди и девици.",
                            "verse 66:7": "О, вярващи, пазете себе си и вашите семейства от Огъня, горивото на който са хората и камъните! Пазят го строги и сурови ангели, които не се противят на Аллах в Неговата повеля към тях и вършат, каквото им се повели.",
                            "verse 66:8": "О, неверници, не се оправдавайте Днес! Ще ви се въздаде само за онова, което сте вършили.",
                            "verse 66:9": "О, вярващи, покайте се пред Аллах с искрено покаяние и вашият Господ ще отмахне от вас прегрешенията, и ще ви въздаде в Градините, сред които реки текат - в Деня, в който Аллах не ще посрами Пророка и вярващите заедно с него.",
                            "verse 66:10": "О, Пророче, бори се с неверниците и лицемерите, и бъди твърд с тях! Мястото им е Адът.",
                            "verse 66:11": "Даде Аллах пример на неверниците с жената на Нух и жената на Лут.",
                            "verse 66:12": "И даде Аллах пример на вярващите с жената на Фараона, която рече: Господи мой, построй ми при Теб дом в Градината и спаси ме от Фараона и от неговите дела, и спаси ме от хората-угнетители!",
                            "verse 66:13": "И с Мариам, дъщерята на Имран, която пазеше целомъдрието си, и вдъхнахме в нея от Своя дух."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "先知啊！真主准許你享受的，你為什麼加以禁戒，以便向你的妻子們討好呢？真主是至赦的，是至慈的。",
                            "verse 66:2": "真主確已為你們規定贖誓制，真主是你們的保祐者。他是全知的，是至睿的。",
                            "verse 66:3": "當時，先知把一句話秘密地告訢他的一個妻子，她即轉告了別人，而真主使先知知道他的秘密已被泄漏的時候，他使她認識一部分，而隱匿一部分。當他既以泄漏告訴她的時候，她說：「誰報告你這件事的？」他說：「是全知的、徹知的主告訴我的。」",
                            "verse 66:4": "如果你們倆向真主悔罪，（那末，你們倆的悔罪是應當的），因為你們倆的心確已偏向了。如果你們倆一致對付他，那末，真主碓是他的保祐者，吉卜利里和行善的信士，也是他的保護者。此外，眾天神是他的扶助者。",
                            "verse 66:5": "如果他休了你們，他的主或許將以勝過你們的妻子補償他，她們是順主的，是信道的，是服從的，是悔罪的，是拜主的，是持齋的，是再醮的和初婚的。",
                            "verse 66:6": "信道的人們啊！你們當為自身和家屬而預防那以人和石為燃料的火刑，主持火刑的，是許多殘忍而嚴厲的天神，他們不違抗真主的命令，他們執行自己所奉的訓令。",
                            "verse 66:7": "不信道的人們啊！今日，你們不要托辭，你們只受自己行為的報酬。",
                            "verse 66:8": "信道的人們啊！你們當向真主誠意悔罪，你們的主或許免除你們的罪惡，並且使你們入下臨諸河的樂園。在那日，真主不凌辱先知，和與他一起信道的人們。他們的光明，將在他們的前面和右邊奔馳，他們將說：「我們的主啊！求你完成給我們的光明，求你赦宥我們。你對於萬事是全能的。」",
                            "verse 66:9": "先知啊！你當與不信道的人們和偽信的人們奮鬥，你當以嚴厲的態度對待他們。他們的歸宿是火獄，那歸宿真惡劣！",
                            "verse 66:10": "真主以努哈的妻子和魯特的妻子，為不信道的人們的殷鑒，她們倆曾在我的兩個行善的僕人之下，而她們倆不忠於自己的丈夫，她們倆的丈夫，未能為她們倆扺禦真主的一點刑罰。或者將說：「你們倆與眾人同入火獄吧！」",
                            "verse 66:11": "真主以法老的妻子，為信道的人們的模範。當時，她曾說：「我的主啊！求你在你那裡，為我建築一所房子在樂園裡。求你拯救我脫離法老，和他的罪行。求你拯救我脫離不義的民眾。」",
                            "verse 66:12": "真主又以儀姆蘭的女兒麥爾彥為信道的人們的模範，她曾保守貞操，但我以我的精神吹入她的身內，她信她的主的言辭和天經，她是一個服從的人。 真主以法老的妻子，為信道的人們的模範。當時，她曾說：「我的主啊！求你在你那裡，為我建築一所房子在樂園裡。求你拯救我脫離法老，和他的罪行。求你拯救我脫離不義的民眾。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Proroku, proč ve snaze uspokojit své ženy zakazuješ to, co Bůh ti dovolil? Vždyť Bůh je odpouštějící, slitovný.",
                            "verse 66:2": "Bůh vám uložil, abyste se vyvázali z přísah svých; Bůh ochráncem je vaším a On vševědoucí je i moudrý.",
                            "verse 66:3": "Hle, prorok svěřil v tajnosti jedné ze svých žen novinku; když však to oznámila jiné a Bůh mu to odkryl, část z toho sdělil a část si ponechal pro sebe.",
                            "verse 66:4": "Jestliže se obě kajícně obrátíte k Bohu.",
                            "verse 66:5": "Jestliže se s vámi rozvede, možná že mu Bůh pak dá v náhradu manželky lepší, než jste vy, odevzdané do vůle Jeho, věřící, pokorně oddané, kajícné, Boha uctívající a slavící, ať již předtím vdané či panny.",
                            "verse 66:6": "Vy, kteří věříte! Střezte sebe i rodiny své před ohněm, jehož palivem budou lidé a kamení.",
                            "verse 66:7": "Vy, kteří jste neuvěřili, nevymlouvejte se dnes! Dostává se vám jen odměny za to, co jste dělali.",
                            "verse 66:8": "Vy, kteří věříte! Obraťte se k Bohu s upřímným pokáním! Snad Pán váš vám vymaže špatné skutky vaše a uvede vás do zahrad, pod nimiž řeky tekou, v den, kdy nezahanbí Bůh ani proroka, ani ty, kdož s ním věřili.",
                            "verse 66:9": "Proroku, bojuj usilovně proti nevěřícím a pokrytcům a buď k nim přísný! Jejich útočištěm bude peklo - jak hnusný je to cíl konečný!",
                            "verse 66:10": "Bůh uvádí těm, kdož neuvěřili, podobenství o ženě Noema a o ženě Lota: obě byly pod mocí Našich dvou služebníků bezúhonných a obě je zradily.",
                            "verse 66:11": "A Bůh uvádí těm, kdož uvěřili, příklad ženy Faraónovy, když zvolala: \"Pane můj, postav pro mne u Sebe v ráji příbytek a zachraň mne před Faraónem a jeho skutky a zachraň mne před lidem nespravedlivým!\"",
                            "verse 66:12": "A uvádí i Marii, dceru ´Imránovu, jež panenství své střežila a do níž jsme vdechli ducha Svého."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "O profeet, waarom verbiedt gij u hetgeen God voor u wettig heeft gemaakt? Zoekt gij het behagen uwer vrouwen? En God is Vergevensgezind, Genadevol.",
                            "verse 66:2": "God heeft de annulatie van uw eden voor u verplichtend gesteld en God is uw Beschermer en Hij is Alwetend, Alwijs.",
                            "verse 66:3": "Toen de profeet een woord aan een zijner vrouwen toevertrouwde en zij het daarna ruchtbaar maakte (aan een andere), deelde God hem dit mede.",
                            "verse 66:4": "Als gij beide (vrouwen) u tot God wendt en uw hart is reeds hiertoe geneigd (dan is het wel) - Maar indien gij samenspant tegen hem (de profeet), dan is God zeker zijn Beschermer, bovendien zijn Gabriël, de rechtvaardigen onder de gelovigen en de engelen zijn helpers.",
                            "verse 66:5": "Indien hij van u scheidt, is het mogelijk dat zijn Heer hem betere vrouwen dan u zal geven, die Moslim zijn en onderdanig, gelovig, gehoorzaam, berouwvol, vroom, gewend te vasten, weduwen of maagden.",
                            "verse 66:6": "O gij die gelooft, redt u zelf en uw gezinnen van het Vuur, welks brandstof mensen en stenen zijn, waarover engelen zijn, hard en streng, die God niet ongehoorzaam zijn in hetgeen Hij hun beveelt, en volvoeren wat hun wordt geboden.",
                            "verse 66:7": "O, gij ongelovigen, verontschuldigt u vandaag niet! U zal slechts vergolden worden voor hetgeen gij placht te doen.",
                            "verse 66:8": "O gij gelovigen, wendt u tot God in oprecht berouw.",
                            "verse 66:9": "O profeet, strijd tegen de ongelovigen en de huichelaars en wees streng tegen hen.",
                            "verse 66:10": "God vergelijkt de ongelovigen met de vrouw van Noach en met die van Lot.",
                            "verse 66:11": "En God vergelijkt de gelovigen met de vrouw van de farao toen zij zeide: \"Mijn Heer! bouw voor mij een huis bij U in het Paradijs, verlos mij van farao en zijn daden en verlos mij van het onrechtvaardige volk.",
                            "verse 66:12": "En met Maria, de dochter van Imraan, die haar kuisheid bewaarde; Toen ademden Wij haar Onze geest in - zij geloofde in het Woord van haar Heer en Zijn Boeken en behoorde tot de gehoorzamen."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 66:1": "O Prophet! Why bannest thou that which Allah hath made lawful for thee, seeking to please thy wives ? And Allah is Forgiving, Merciful.",
                            "verse 66:2": "Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector.",
                            "verse 66:3": "When the Prophet confided a fact unto one of his wives and when she afterward divulged it and Allah apprised him thereof, he made known (to her) part thereof and passed over part.",
                            "verse 66:4": "If ye twain turn unto Allah repentant, (ye have cause to do so) for your hearts desired (the ban); and if ye aid one another against him (Muhammad) then lo! Allah, even He, is his Protecting Friend, and Gabriel and the righteous among the believers; and furthermore the angels are his helpers.",
                            "verse 66:5": "It may happen that his Lord, if he divorce you, will give him in your stead wives better than you, submissive (to Allah), believing, pious, penitent, devout, inclined to fasting, widows and maids.",
                            "verse 66:6": "O ye who believe! Ward off from yourselves and your families a Fire whereof the fuel is men and stones, over which are set angels strong, severe, who resist not Allah in that which He commandeth them, but do that which they are commanded.",
                            "verse 66:7": "(Then it will be said): O ye who disbelieve! Make no excuses for yourselves this day.",
                            "verse 66:8": "O ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him.",
                            "verse 66:9": "O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them.",
                            "verse 66:10": "Allah citeth an example for those who disbelieve: the wife of Noah and the wife of Lot, who were under two of Our righteous slaves yet betrayed them so that they (the husbands) availed them naught against Allah and it was said (unto them): Enter the Fire along with those who enter.",
                            "verse 66:11": "And Allah citeth an example for those who believe: the wife of Pharaoh when she said: My Lord! Build for me a home with thee in the Garden, and deliver me from Pharaoh and his work, and deliver me from evil-doing folk;",
                            "verse 66:12": "And Mary, daughter of ’Imran, whose body was chaste, therefor We breathed therein something of Our Spirit."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 66:1": "O Prophet! Why holdest thou to be forbidden that which God has made lawful to thee? Thou seekest to please thy consorts.",
                            "verse 66:2": "God has already ordained for you, (O men), the dissolution of your oaths (in some cases): and God is your Protector, and He is Full of Knowledge and Wisdom.",
                            "verse 66:3": "When the Prophet disclosed a matter in confidence to one of his consorts, and she then divulged it (to another), and God made it known to him, he confirmed part thereof and repudiated a part.",
                            "verse 66:4": "If ye two turn in repentance to Him, your hearts are indeed so inclined; But if ye back up each other against him, truly God is his Protector, and Gabriel, and (every) righteous one among those who believe,- and furthermore, the angels - will back (him) up.",
                            "verse 66:5": "It may be, if he divorced you (all), that God will give him in exchange consorts better than you,- who submit (their wills), who believe, who are devout, who turn to God in repentance, who worship (in humility), who travel (for Faith) and fast,- previously married or virgins.",
                            "verse 66:6": "O ye who believe! save yourselves and your families from a Fire whose fuel is Men and Stones, over which are (appointed) angels stern (and) severe, who flinch not (from executing) the Commands they receive from God, but do (precisely) what they are commanded.",
                            "verse 66:7": "(They will say), \"O ye Unbelievers! Make no excuses this Day! Ye are being but requited for all that ye did!\"",
                            "verse 66:8": "O ye who believe! Turn to God with sincere repentance: In the hope that your Lord will remove from you your ills and admit you to Gardens beneath which Rivers flow,- the Day that God will not permit to be humiliated the Prophet and those who believe with him.",
                            "verse 66:9": "O Prophet! Strive hard against the Unbelievers and the Hypocrites, and be firm against them.",
                            "verse 66:10": "God sets forth, for an example to the Unbelievers, the wife of Noah and the wife of Lut: they were (respectively) under two of our righteous servants, but they were false to their (husbands), and they profited nothing before God on their account, but were told: \"Enter ye the Fire along with (others) that enter!\"",
                            "verse 66:11": "And God sets forth, as an example to those who believe the wife of Pharaoh: Behold she said: \"O my Lord! Build for me, in nearness to Thee, a mansion in the Garden, and save me from Pharaoh and his doings, and save me from those that do wrong\";",
                            "verse 66:12": "And Mary the daughter of ’Imran, who guarded her chastity; and We breathed into (her body) of Our spirit; and she testified to the truth of the words of her Lord and of His Revelations, and was one of the devout (servants)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 66:1": "It is God who created seven heavens, and of earth their like, between them the Command descending, that you may know that God is powerful over everything and that God encompasses everything in knowledge.",
                            "verse 66:2": "God has ordained for you the absolution of your oaths.",
                            "verse 66:3": "And when the Prophet confided to one of his wives a certain matter; and then, when she told of it, and God disclosed that to him, he made known part of it, and turned aside from part; then, when he told her of it, she said, ’Who told thee this?’ He said, ’I was told of it by the All-knowing, the All-aware.",
                            "verse 66:4": "If you two repent to God, yet your hearts certainly inclined; but if you support one another against him, God is his Protector, and Gabriel, and the righteous among the believers; and, after that, the angels are his supporters.",
                            "verse 66:5": "It is possible that, if he divorces you, his Lord will give him in exchange wives better than you, women who have surrendered, believing, obedient, penitent, devout, given to fasting, who have been married and virgins too.",
                            "verse 66:6": "Believers, guard yourselves and your families against a Fire whose fuel is men and stones, and over which are harsh, terrible angels who disobey not God in what He commands them and do what they are commanded.",
                            "verse 66:7": "’O you unbelievers, do not excuse yourselves today; you are only being recompensed for what you were doing.",
                            "verse 66:8": "Believers, turn to God in sincere repentance; it may be that your Lord will acquit you of your evil deeds, and will admit you into gardens underneath which rivers flow.",
                            "verse 66:9": "O Prophet, struggle with the unbelievers and the hypocrites, and be thou harsh with them; their refuge shall be Gehenna -- an evil homecoming!",
                            "verse 66:10": "God has struck a similitude for the unbelievers -- the wife of Noah, and the wife of Lot; for they were under two of Our righteous servants, but they betrayed them, so they availed them nothing whatsoever against God; so it was said, ’Enter, you two, the Fire with those who enter.",
                            "verse 66:11": "God has struck a similitude for the believers -- the wife of Pharaoh, when she said, ’My Lord, build for me a house in Paradise, in Thy presence, and deliver me from Pharaoh and his work, and do Thou deliver me from the people of the evildoers.",
                            "verse 66:12": "And Mary, Imran’s daughter, who guarded her virginity, so We breathed into her of Our Spirit, and she confirmed the Words of her Lord and His Books, and became one of the obedient."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 66:1": "O PROPHET! Why dost thou, out of a desire to please [one or another of] thy wives, impose [on thyself] a prohibition of something that God has made lawful to thee? But God is much-forgiving, a dispenser of grace:",
                            "verse 66:2": "God has already enjoined upon you [O believers] the breaking and expiation of [such of] your oaths [as may run counter to what is right and just]: for God is your Lord Supreme, and He alone is all-knowing, truly wise.",
                            "verse 66:3": "And lo! [It so happened that] the Prophet told something in confidence to one of his wives; and when she thereupon divulged it, and God made this known to him, he acquainted",
                            "verse 66:4": "with some of it and passed over some of it.",
                            "verse 66:5": "[Say, O Prophet:] \"Would that you two turn unto God in repentance, for the hearts of both of you have swerved [from what is right]! And if you uphold each other against him [who is God’s message-bearer, know that] God Himself is his Protector, and",
                            "verse 66:6": "therefore, Gabriel, and all the righteous among the believers, and all the",
                            "verse 66:7": "angels will come to his aid.",
                            "verse 66:8": "[O wives of the Prophet!] Were he to divorce [any of] you, his Sustainer might well give him in your stead spouses better than you – women who surrender themselves unto God, who truly believe, devoutly obey His will, turn [unto Him] in repentance [whenever they have sinned], worship [Him alone], and go on and on [seeking His goodly acceptance] – be they women previously married or virgins.",
                            "verse 66:9": "O YOU who have attained to faith! Ward off from yourselves and those who are close to you that fire [of the hereafter] whose fuel is human beings and stones:",
                            "verse 66:10": "over it are angelic powers awesome",
                            "verse 66:11": "severe, who do not disobey God in whatever He has commanded them, but",
                            "verse 66:12": "do what they are bidden to do.",
                            "verse 66:13": "",
                            "verse 66:14": "O you who are bent on denying the truth, make no",
                            "verse 66:15": "excuses today: [in the life to come] you shall be but recompensed for what you were doing [in this world].",
                            "verse 66:16": "O you who have attained to faith! Turn unto God in sincere repentance: it may well be that your Sustainer will efface from you your bad deeds, and will admit you into gardens through which running waters flow, on a Day on which God will not shame the Prophet and those who share his faith: their light will spread rapidly before them, and on their right;",
                            "verse 66:17": "they will pray: \"O our Sustainer! Cause this our light to shine for us forever, and forgive us our sins: for, verily, Thou hast the power to will anything!\"",
                            "verse 66:18": "O PROPHET! Strive hard against the deniers of the truth and the hypocrites, and be adamant with them.",
                            "verse 66:19": "For those who are bent on denying the truth God has propounded a parable in [the stories of] Noah’s wife and Lot’s wife: they were wedded to two of Our righteous servants, and each one betrayed her husband; and neither of the two",
                            "verse 66:20": "will be of any avail to these two women before God when they are told [on Judgment Day], \"Enter the fire with all those [other sinners] who enter it!\"",
                            "verse 66:21": "And for those who have attained to faith God has propounded a parable in [the story of] Pharaoh’s wife as she prayed, \"O my Sustainer! Build Thou for me a mansion in the paradise [that is] with Thee, and save me from Pharaoh and his doings, and save me from all evildoing folk!\"",
                            "verse 66:22": "And [We have propounded yet another parable of God-consciousness in the story of] Mary, the daughter of ’Imrān, who guarded her chastity, whereupon We breathed of Our spirit into that [which was in her womb], and who accepted the truth of her Sustainer’s words – and",
                            "verse 66:23": "of His revelations – and was one of the truly devout.",
                            "verse 66:24": "with some of it and passed over some of it”: for once his confidential prediction had been divulged, he saw no point in withholding it any longer from the community; nevertheless, he alluded to it in deliberately vague terms – possibly in order not to give to the succession of Abū Bakr and ‘Umar the appearance of an “apostolic sanction” but to leave it, rather, to a free decision of the community in pursuance of the Qur’anic principle amruhum shūrā baynahum (see 42:38).",
                            "verse 66:25": "sentence has already been passed” in 11:40 applies to her no less than to her son (whose story appears in 11:42-47)."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 66:1": "O Prophet why bannest thou, to please thy wives, that which God hath made lawful unto thee?.",
                            "verse 66:2": "If ye twain repent unto God ye have cause, for your hearts were set upon the ban; and if ye aid each the other against him, verily God, even He, is his Protecting Friend, and Gabriel, and the elect of the faithful; and beyond these, the angels are massed to help him.",
                            "verse 66:3": "It may be, if he divorce you, that his Lord will give him wives in your stead who are better than you, submissive unto God, believing, devout, penitent, inclined unto worship and fasting, widows and virgin maids.",
                            "verse 66:4": "God citeth as an example for those who disbelieve, the wife of Noah and the wife of Lot.",
                            "verse 66:5": "And God citeth as example for those who believe the wife of Pharaoh when she said: “My Lord, build for me a dwelling unto Thee in Paradise, and save me from Pharaoh and his deeds, and save me from the people who transgress”.",
                            "verse 66:6": "And Maryam, daughter of Imran, who kept intact her virginity; and We breathed into her of Our Spirit; and she believed in the Words of her Lord and in His Books, and was one of those who are absorbed in Invocation.",
                            "verse 66:7": "citeth as example) Maryam, daughter of Imran, who kept inviolate her virginity; and We breathed therein of Our Spirit; and she accepted the Words of her Lord and His Books; and she was of those who are absorbed in the orison.",
                            "verse 66:8": "Mary, the daughter of ‘Imran, who kept chaste her womb and We breathed therein of Our Spirit.",
                            "verse 66:9": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 66:10": "The Book of Certainty (1952) •",
                            "verse 66:11": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 66:12": "What is Sufism (1975) •",
                            "verse 66:13": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 66:14": "Muhammad (1983) •",
                            "verse 66:15": "Symbol and Archetype (1991) •",
                            "verse 66:16": "Sufi Poems (2004) •",
                            "verse 66:17": "Mecca (2004) •",
                            "verse 66:18": "Return to the Spirit (2005) •",
                            "verse 66:19": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 66:20": "“Proofs of Islam”(1954).",
                            "verse 66:21": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 66:22": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 66:23": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 66:24": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 66:25": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 66:26": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 66:27": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 66:28": "“The Quranic Origins of Sufism” •",
                            "verse 66:29": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 66:30": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 66:31": "“An Introduction to Islam” •",
                            "verse 66:32": "“The Universality of the Quran” •",
                            "verse 66:33": "Private Talks Books",
                            "verse 66:34": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 66:1": "O Prophet, why do you ban (on your self) something that Allah has made lawful for you, seeking to please your wives? And Allah is Most-Forgiving, Very-Merciful.",
                            "verse 66:2": "Allah has prescribed (the way of) absolution from your oaths.",
                            "verse 66:3": "And (remember) when the Prophet told one of his wives something in secret.",
                            "verse 66:4": "(O two wives of the Prophet,) If both of you repent to Allah, then (your conduct calls for it, because) your hearts have departed from the correct way.",
                            "verse 66:5": "It is hoped that, if he divorces you, Allah will give him in your place wives better than you, submissive to Allah, believing, devout, penitent, steadfast in worship, fasting, previously married and virgins.",
                            "verse 66:6": "O you who believe, save yourselves and your families from a fire, the fuel of which is human beings and stones, appointed on which are angels, stern and severe, who do not disobey Allah in what He orders them, and do whatever they are ordered to do.",
                            "verse 66:7": "O you who disbelieve, do not make excuses today.",
                            "verse 66:8": "O you who believe, turn to Allah with a faithful repentance.",
                            "verse 66:9": "O Prophet, carry out Jihād (struggle) against the disbelievers and the hypocrites, and be harsh with them.",
                            "verse 66:10": "Allah has cited for the disbelievers the example of the wife of NūH and the wife of LūT.",
                            "verse 66:11": "And Allah has cited for the believers the example of the wife of Fir’aun (Pharaoh), when she said, “My Lord, build for me, near You, a house in the Paradise, and deliver me from Fir’aun and his deeds, and deliver me from the unjust people.",
                            "verse 66:12": "And (Allah has also cited the example of) Maryam, daughter of ‘Imrān who guarded her chastity, so We breathed into her Our spirit, and she testified to the truth of the words of her Lord and His books, and she was one of the devout."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 66:1": "O Prophet! Why do you prohibit what God has made lawful for you, seeking to please your wives? And God is Forgiving, Merciful.",
                            "verse 66:2": "Verily God has prescribed for you [when necessary] the absolution of your oaths.",
                            "verse 66:3": "And when the Prophet confided to one of his wives a certain matter; but when she divulged it and God apprised him of it, he announced part of it, and passed over part.",
                            "verse 66:4": "If the two of you repent to God … for your hearts were certainly inclined, and if you support one another against him, then [know that] God, He is indeed his Protector, and Gabriel, and the righteous among the believers, and the angels furthermore, are his supporters.",
                            "verse 66:5": "It may be that, if he divorces you, his Lord will give him in",
                            "verse 66:6": "stead wives better than you — women submissive [to God], believing, obedient, penitent, devout, given to fasting, previously married and virgins.",
                            "verse 66:7": "O you who believe! Guard yourselves and your families against a Fire whose fuel is people and stones, over which stand angels, stern, mighty, who do not disobey God in what He commands them, but do what they are commanded.",
                            "verse 66:8": "‘O you who disbelieve! Do not make any excuses today.",
                            "verse 66:9": "O you who believe! Repent to God with sincere repentance.",
                            "verse 66:10": "O Prophet! Struggle against the disbelievers and the hypocrites, and be stern with them.",
                            "verse 66:11": "an evil journey’s end!",
                            "verse 66:12": "God has struck a similitude for those who disbelieve: the wife of Noah and the wife of Lot.",
                            "verse 66:13": "And God has struck a similitude for those who believe: the wife of Pharaoh when she said, ‘My Lord, build for me a home near You in Paradise, and deliver me from Pharaoh and his work, and deliver me from the evildoing folk’.",
                            "verse 66:14": "And Mary daughter of ‘Imrān, who preserved [the chastity of] her womb, so We breathed into it of Our Spirit, and she confirmed the words of her Lord and His Scriptures, and she was of the obedient."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 66:1": "O (Esteemed) Prophet! Why do you forbid yourself (taking honey) which Allah has made lawful for you? (How well) you seek to please your wives! And Allah is Most Forgiving, Ever-Merciful.",
                            "verse 66:2": "(O believers!) Indeed, Allah has prescribed for you how to dissolve your oaths (by atonement).",
                            "verse 66:3": "And when the Prophet (blessings and peace be upon him) secretly disclosed a matter to one of his wives, but when she mentioned it and Allah made it known to the Prophet (blessings and peace be upon him), then the Prophet reminded her of some part of it and overlooked (to inform) the rest of it.",
                            "verse 66:4": "If you both turn to Allah in repentance, (that is better for you) because the hearts of both of you have inclined (towards the same), but if you help one another in this matter (that may annoy the Holy Prophet [blessings and peace be upon him]).",
                            "verse 66:5": "If he divorces you, then it may well be that your Lord will give him in your place better wives than yourselves (who) will be obedient, true believers, submissive, penitent, worshippers, given to fasting, (some) formerly married and (some) virgins.",
                            "verse 66:6": "O believers! Safeguard yourselves and your families against a Fire whose fuel is men and stones.",
                            "verse 66:7": "O disbelievers! Do not make any excuse Today.",
                            "verse 66:8": "O believers! Turn towards Allah’s presence in perfect and most sincere repentance.",
                            "verse 66:9": "O (Esteemed) Prophet! Strive hard against the disbelievers and the hypocrites (who have initiated militancy, aggression, mischief and intrigues against you) and treat them strictly.",
                            "verse 66:10": "Allah has described for disbelievers the example of Nuh’s (Noah’s) wife (Wahila) and Lut’s (Lot’s) wife (Wa‘ila).",
                            "verse 66:11": "And Allah has given for the believers the example of Pharaoh’s wife (Asiya, the daughter of Mazahim) when she submitted: ‘O my Lord, build a house for me in Paradise in Your presence, and deliver me from Pharaoh and his (evil) conduct, and also rescue me from the wrongdoing people.",
                            "verse 66:12": "And (the second example is given of) Maryam (Mary), the daughter of ‘Imran, who guarded well her chastity and purity."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Profeetta, miksi haluat, ollaksesi vaimoillesi mieliksi, kieltäytyä sellaisesta, minkä Jumala on tehnyt sinulle luvalliseksi? Onhan Jumala anteeksiantava, laupias.",
                            "verse 66:2": "Onhan Jumala antanut määräykset sovitusuhrista, joka valasta vapauttaa ja Jumala on suojelijanne, sillä Hän on kaikkitietävä, viisas.",
                            "verse 66:3": "Kun profeetta salaisuutena ilmoitti jotakin eräälle vaimoistaan, ja kun tämä sitten ilmaisi sen toisille ja Jumala antoi profeetan kaikesta tietää, moitti tämä vaimoansa osasta, mutta vaikeni osasta.",
                            "verse 66:4": "»Jos te kumpikin, (vaimo) käännytte Jumalan puoleen, se on parhaaksenne; ovathan sydämenne Hänestä luopuneet; mutta jos te kumpikin pidätte yhtä puolta häntä (profeettaa) vastaan, niin on totisesti Jumala hänen suojelijansa ja samoin Gabriel sekä hurskaat uskovaiset ja lisäksi enkelit hänen auttajansa.",
                            "verse 66:5": "Voi olla, että jos profeetta teistä eroaa, hänen Herransa antaa sijaanne parempia vaimoja kuin te - kuuliaisia, uskollisia, nöyriä, katuvia, Jumalaa palvelevia, paastojen noudattajia, olivatpa he leskiä tai neitsyitä.",
                            "verse 66:6": "Uskovaiset, varjelkaa itsenne ja perheenne tulelta, joka kuluttaa ihmiset ja kivetkin, jota valvomaan on asetettu enkeleitä, heltymättömiä ja mahtavia; he eivät ole tottelemattomia Jumalan käskyille, vaan tekevät mitä heille on määrätty.",
                            "verse 66:7": "Te, jotka ette usko, älkää keksikö anteeksipyyntöjä tuona päivänä! Te saatte vain tekojenne palkan.",
                            "verse 66:8": "Uskovaiset, kääntykää vilpittömästi katuen Jumalan puoleen! Ehkä Herranne vapahtaa teidät pahuudestanne ja sallii teidän astua puutarhoihin, joita virrat vilvoittavat, sinä päivänä, jolloin Jumala ei saata häpeään Profeettaa eikä niitä, jotka uskovat hänen kanssaan; heidän valonsa välkkyy heidän edessään ja oikealla puolellaan, ja he sanovat: »Herra, viritä valomme täydelliseksi ja suojele meitä armossasi, sillä sinä voit totisesti tehdä kaiken, mitä tahdot!»",
                            "verse 66:9": "Profeetta, taistele sitkeästi epäuskoisia ja tekopyhiä vastaan ja ole ankara heitä kohtaan; heidän olinpaikkansa on oleva helvetti.",
                            "verse 66:10": "Niitä varten, jotka eivät usko, Jumala on asettanut Nooan ja Lootin vaimot esimerkiksi.",
                            "verse 66:11": "Niitä varten, jotka uskovat, Jumala on asettanut esimerkiksi myös faraon vaimon, joka sanoi: »Herra rakenna minulle huone luoksesi paratiisiin, vapahda minut faraosta ja hänen teoistaan ja päästä minut jumalattomista ihmisistä!»",
                            "verse 66:12": "Esikuvaksi tehtiin myös Maria, Imraanin tytär, joka säilytti puhtautensa ja jonka Me täytimme hengellämme."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 66:1": "O Prophète ! Pourquoi interdis-tu ce que Dieu t'a rendu licite, ceci pour obtenir la satisfaction de tes épouses ? Mais Dieu est pardonneur, clément !",
                            "verse 66:2": "Dieu vous a déjà imposé de vous libérer de vos serments, et Dieu est votre Maître ! Il est l'Omniscient, le Sage.",
                            "verse 66:3": "Lorsque le Prophète confia un secret à l'une de ses épouses et que celle-ci le divulgua [à une compagne], Dieu en informa le Prophète qui communiqua à son épouse une partie de ce qu'il venait d'apprendre et tint le reste caché.",
                            "verse 66:4": "[O femmes,] si toutes les deux vous revenez à Dieu, ce sera que vos cœurs se seront adoucis.",
                            "verse 66:5": "Il se peut que son Seigneur, s'il vous répudie, lui donne en échange des épouses meilleures que vous, soumises à Dieu, croyantes, pieuses, repentantes, adorantes, pratiquant le jeûne, qu'elles aient été déjà mariées ou qu'elles soient vierges.",
                            "verse 66:6": "O vous qui croyez ! Préservez vos personnes et vos familles d'un Feu dont les hommes et les pierres sont l'aliment ! Des anges gigantesques et puissants se tiennent autour de ce feu ; ils ne désobéissent en rien à ce que Dieu leur ordonne, et ils font ce qui leur est commandé.",
                            "verse 66:7": "O vous qui avez mécru, ne vous excusez pas aujourd'hui ! Vous ne serez rétribués que pour ce que vous avez fait.",
                            "verse 66:8": "O vous qui croyez, revenez à Dieu avec un repentir sincère ! Votre Seigneur effacera sans doute vos mauvaises actions et Il vous fera entrer dans les Jardins sous lesquels coulent les fleuves, le Jour où Dieu n'humiliera pas le Prophète ni ceux qui auront cru avec lui.",
                            "verse 66:9": "O Prophète ! Combats les mécréants et les hypocrites ; sois dur envers eux.",
                            "verse 66:10": "Dieu a proposé en exemple à ceux qui mécroient la femme de Noé et la femme de Loth.",
                            "verse 66:11": "Et Dieu a proposé en exemple aux croyants la femme de Pharaon lorsqu'elle dit : \" Mon Seigneur ! Construis-moi, auprès de Toi, une maison dans le Paradis, et sauve-moi de Pharaon et de ses agissements ! Sauve-moi des gens iniques ! \" ;",
                            "verse 66:12": "et Marie, fille de Imrân, qui garda un corps vierge en qui Nous insufflâmes de Notre Esprit ; elle reconnut la vérité des paroles de son Seigneur et de Ses Livres."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 66:1": "ô Prophète ! Pourquoi, en recherchant l’agrément de tes femmes, t’interdis-tu ce que Dieu t’a rendu licite ? Et Dieu est Pardonneur, Très Miséricordieux.",
                            "verse 66:2": "Dieu vous a prescrit certes, de vous libérer de vos serments.",
                            "verse 66:3": "Lorsque le Prophète confia un secret à l’une de ses épouses et qu’elle l’eut divulgué et que Dieu l’en eut informé, celui-ci en fit connaître une partie et passa sur une partie.",
                            "verse 66:4": "Si vous vous repentez à Dieu c’est que vos coeurs ont fléchi.",
                            "verse 66:5": "soutien .",
                            "verse 66:6": "S’Ils vous répudie, il se peut que Seigneur lui donne en échange des épouses meilleurs que vous, musulmanes, croyantes, obéissantes, repentantes, adoratrices, jeûneuses, déjà mariées ou vierges .",
                            "verse 66:7": "ô vous qui avez cru ! Préservez vos personnes et vos familles, d’un Feu dont le combustible sera les gens et les pierres, surveillé par des Anges rudes, durs, ne désobéissant jamais à Dieu en ce qu’Il leur commande, et faisant strictement ce qu’on leur ordonne.",
                            "verse 66:8": "ô vous qui avez mécru ! Ne vous excusez pas aujourd’hui Vous ne serez rétribués que selon ce que vous oeuvriez.",
                            "verse 66:9": "ô vous qui avez cru ! Repentez-vous à Dieu d’un repentir sincère.",
                            "verse 66:10": "ô Prophète ! Mène la lutte contre les mécréants et hypocrites et sois rude à leur égard.",
                            "verse 66:11": "Dieu a cité en parabole pour ceux qui ont mécru la femme de Noé et la femme de Lot.",
                            "verse 66:12": "fut dit : «Entrez au Feu toutes les deux, avec ceux qui y entrent»,",
                            "verse 66:13": "et Dieu a cité en parabole pour ceux qui croient, la femme de Pharaon, quand elle dit «Seigneur, construis-moi auprès de Toi une maison dans le Paradis, et sauve-moi de Pharaon et de son oeuvre; et sauve-moi des gens injustes».",
                            "verse 66:14": "De même, Marie, la fille d’Imran qui avait préservé sa virginité; Nous y insufflâmes alors de Notre Esprit."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "O Prophet! warum untersagst du (dir) das, was Allah dir erlaubt hat? Suchst du deinen Frauen zu gefallen? Und Allah ist allverzeihend, barmherzig.",
                            "verse 66:2": "Allah hat in der Tat euch die Lösung eurer Eide erlaubt, und Allah ist euer Beschützer; und Er ist der Allwissende, der Allweise.",
                            "verse 66:3": "Als der Prophet einer seiner Frauen einen Vorfall anvertraute und sie ihn dann ausplauderte und Allah ihm davon Kunde gab, da ließ er (sie) einen Teil davon wissen, und verschwieg einen Teil.",
                            "verse 66:4": "Wenn ihr beide euch reuig Allah zuwendet, so sind eure Herzen bereits (dazu) geneigt.",
                            "verse 66:5": "Vielleicht wird sein Herr ihm, wenn er sich von euch scheidet, an eurer Statt bessere Frauen geben, gottergebene, gläubige, gehorsame, reuige, fromme, fastende - Witwen und Jungfrauen.",
                            "verse 66:6": "O die ihr glaubt, rettet euch und die Euren vor einem Feuer, dessen Brennstoff Menschen und Steine sind, darüber Engel gesetzt sind, streng, gewaltig, die Allah nicht ungehorsam sind in dem, was Er ihnen befiehlt, sondern alles vollbringen, was ihnen geheißen wird.",
                            "verse 66:7": "O die ihr ungläubig seid, bringt heute keine Entschuldigungen vor.",
                            "verse 66:8": "O die ihr glaubt, wendet euch zu Allah in aufrichtiger Reue.",
                            "verse 66:9": "O Prophet! streite wider die Ungläubigen und die Heuchler; und sei streng gegen sie.",
                            "verse 66:10": "Allah legt denen, die ungläubig sind, das Beispiel vor von Noahs Frau und von Lots Frau.",
                            "verse 66:11": "Und Allah legt denen, die glauben, das Beispiel von Pharaos Frau vor, da sie sprach: «Mein Herr! baue mir ein Haus bei Dir im Garten und befreie mich von Pharao und seinem Werk und befreie mich von dem Volk der Frevler!»",
                            "verse 66:12": "Und der Maria, der Tochter Ìmráns, die ihre Keuschheit bewahrte - drum hauchten Wir ihm von Unserem Geist ein -, und sie glaubte an die Worte ihres Herrn und an Seine Schriften und war der Gehorsamen eine."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": ",s jlwy tks pht+ [+kqnk us rqEgkjs fy, gyky dh gS rqe mlls viuh chfo;ksa dh [+kq’kuwnh ds fy, D;ksa fdukjk d’kh djks vkSj [+kqnk rks cM+k c[+’kus okyk esgjcku gS",
                            "verse 66:2": "[+kqnk us rqe yksxksa ds fy, d+leksa dks rksM+ Mkyus dk d¶+Q+kj eqd+jZj dj fn;k gS vkSj [+kqnk gh rqEgkjk dkjlkt+ gS vkSj ogh okfd+Q+dkj fgder okyk gS",
                            "verse 66:3": "vkSj tc iSx+Ecj us viuh ckt+ choh ¼gQ+lk½ ls pqids ls dksbZ ckr dgh fQj tc mlus ¼ckotwn eqekfu;r½ ml ckr dh ¼vk;’kk dks½ [+kcj ns nh vkSj [+kqnk us bl vez dks jlwy ij t+kfgj dj fn;k rks jlwy us ¼vk;’kk dks½ ckt+ ckr ¼fdLlk ekfj;k½ trk nh vkSj ckt+ ckr ¼fdLlk, Ógn½ Vky nh x+jt+ tc jlwy us bl okfd+;s ¼gQ+lk ds vk;’kk, jkt+½ fd ml ¼vk;’kk½ dks [+kcj nh rks gSjr ls cksy mBha vkidks bl ckr ¼vk;’kk, jkt+½ dh fdlus [+kcj nh jlwy us dgk eq>s cM+s okfd+Q+dkj [+kcjnkj ¼[+kqnk½ us crk fn;k",
                            "verse 66:4": "¼rks ,s gQ+lk o vk;’kk½ vxj rqe nksuksa ¼bl gjdr ls½ rkSck djks rks [+kSj D;ksafd rqe nksuksa ds fny Vs<+s gSa vkSj vxj rqe nksuksa jlwy dh eq[+kkysQ+r esa ,d nwljs dh v;kur djrh jgksxh rks dqN ijok ugha ¼D;ksa fd½ [+kqnk vkSj ftcjhy vkSj reke bekunkjksa esa usd Ó[+l muds ennxkj gSa vkSj muds vykok dqy Qfj’rs ennxkj gSa",
                            "verse 66:5": "vxj jlwy rqe yksxksa dks rykd+ ns ns rks vud+jhc gh mudk ijojfnxkj rqEgkjs cnys mudks rqels vPNh chfo;k¡ vrk djs tks Q+jekcjnkj bZekunkj [+kqnk jlwy dh eqrh; ¼xqukgksa ls½ rkSck djus okfy;k¡ bcknr xqt+kj jkst+k j[kus okfy;k¡ C;kgh gq;h",
                            "verse 66:6": "vkSj fcu C;kgh dqaokfj;k¡ gks ,s bZekunkjksa vius vkidks vkSj vius yM+ds ckyksa dks ¼tgUuqe dh½ vkx ls cpkvks ftlds baZ/ku vkneh vkSj iRFkj gksaxs mu ij og rUn[+kw l[+r fetkt+ Q+fj’rs ¼eqd+jZj½ gSa fd [+kqnk ftl ckr dk gqD+e nsrk gS mldh ukQjekuh ugha djrs vkSj tks gqD+e mUgsa feyrk gS mls ctk ykrs gSa",
                            "verse 66:7": "¼tc dq¶+Q+kj nkst+[+k ds lkeus vk,¡xs rks dgk tk,xk½ dkfQ+jksa vkt cgkus u <w¡<ks tks dqN rqe djrs Fks rqEgsa mldh lt+k nh tk,xh",
                            "verse 66:8": ",s bZekunkjksa [+kqnk dh ckjxkg esa lkQ+ [+kkfyl fny ls rkSck djks rks ¼mldh otg ls½ mEehn gS fd rqEgkjk ijojfnxkj rqels rqEgkjs xqukg nwj dj ns vkSj rqedks ¼csfg’r ds½ mu ckx+ksa esa nkf[ky djs ftuds uhps ugjsa tkjh gSa ml fnu tc [+kqnk jlwy dks vkSj mu yksxksa dks tks muds lkFk bZeku yk, gSa :lok ugha djsxk ¼cfYd½ mudk uwj muds vkxs vkxs vkSj muds nkfgus rjQ+ ¼jkS’kuh djrk½ py jgk gksxk vkSj ;s yksx ;s nqvk djrs gksaxs ijojfnxkj gekjs fy, gekjk uwj iwjk dj vkSj geas c[+Ó ns cs’kd rw gj pht+ ij dkfnj gS",
                            "verse 66:9": ",s jlwy dkfQ+jksa vkSj equkfQ+dksa ls tsgkn djks vkSj mu ij l[+rh djks vkSj mudk fBdkuk tgUuqe gS vkSj og D;k cqjk fBdkuk gS",
                            "verse 66:10": "eqd+kcys esa muds dqN Hkh dke u vk, vkSj mudks gqD+e fn;k x;k fd vkSj tkus okyksa ds lkFk tgUuqe esa rqe nksuksa Hkh nkf[ky gks tkvks",
                            "verse 66:11": "vkSj [+kqnk us eksfeuhu ¼dh rlYyh½ ds fy, fQjvkÅu dh choh ¼vkfl;k½ dh felky c;ku Q+jek;h gS fd tc mlus nqvk dh ijojfnxkj esjs fy, vius ;gk¡ csfg’r esa ,d ?kj cuk vkSj eq>s fQjvkÅu vkSj mldh dkjLrkuh ls utkr ns vkSj eq>s t+kfye yksxks ¼ds gkFk½ ls NqVdkjk vrk Q+jek",
                            "verse 66:12": "vkSj ¼nwljh felky½ bejku dh csVh efj;e ftlus viuh ÓeZxkg dks egQwt+ j[kk rks geus mlesa :g Qwad nh vkSj mlus vius ijojfnxkj dh ckrksa vkSj mldh fdrkcksa dh rLnhd+ dh vkSj Qjekcjnkjksa esa Fkh"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Hai Nabi, mengapa kamu mengharamkan apa yang Allah menghalalkannya bagimu; kamu mencari kesenangan hati isteri-isterimu? Dan Allah Maha Pengampun lagi Maha Penyayang.",
                            "verse 66:2": "Sesungguhnya Allah telah mewajibkan kepada kamu sekalian membebaskan diri dari sumpahmu dan Allah adalah Pelindungmu dan Dia Maha Mengetahui lagi Maha Bijaksana.",
                            "verse 66:3": "Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang dari isteri-isterinya (Hafshah) suatu peristiwa.",
                            "verse 66:4": "Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan); dan jika kamu berdua bantu-membantu menyusahkan Nabi, maka sesungguhnya Allah adalah Pelindungnya dan (begitu pula) Jibril dan orang-orang mu’min yang baik; dan selain dari itu malaikat-malaikat adalah penolongnya pula.",
                            "verse 66:5": "Jika Nabi menceraikan kamu, boleh jadi Tuhannya akan memberi ganti kepadanya dengan isteri-isteri yang lebih baik daripada kamu, yang patuh, yang beriman, yang ta’at, yang bertaubat, yang mengerjakan ibadat, yang berpuasa, yang janda dan yang perawan.",
                            "verse 66:6": "Hai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, yang keras, yang tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.",
                            "verse 66:7": "Hai orang-orang kafir, janganlah kamu mengemukakan uzur pada hari ini.",
                            "verse 66:8": "Hai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubat yang semurni-murninya, mudah-mudahan Tuhan kamu akan menghapus kesalahan-kesalahanmu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, pada hari ketika Allah tidak menghinakan Nabi dan orang-orang yang beriman bersama dengan dia; sedang cahaya mereka memancar di hadapan dan di sebelah kanan mereka, sambil mereka mengatakan: \"Ya Tuhan kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; sesungguhnya Engkau Maha Kuasa atas segala sesuatu\".",
                            "verse 66:9": "Hai Nabi, perangilah orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka.",
                            "verse 66:10": "Allah membuat isteri Nuh dan isteri Luth perumpamaan bagi orang-orang kafir.",
                            "verse 66:11": "Dan Allah membuat isteri Fir’aun perumpamaan bagi orang-orang yang beriman, ketika ia berkata: \"Ya Tuhanku, bangunlah untukku sebuah rumah di sisi-Mu dalam surga dan selamatkanlah aku dari Fir’aun dan perbuatannya dan selamatkanlah aku dari kaum yang zalim\",",
                            "verse 66:12": "dan Maryam puteri ’Imran yang memelihara kehormatannya, maka Kami tiupkan ke dalam rahimnya sebagian dari roh (ciptaan) Kami; dan dia membenarkan kalimat-kalimat Tuhannya dan Kitab-kitab-Nya; dan adalah dia termasuk orang-orang yang ta’at."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "O Profeta, perché, cercando di compiacere le tue spose, ti interdici quello che Allah ti ha permesso ? Allah è perdonatore, misericordioso.",
                            "verse 66:2": "Eppure Allah vi ha prescritto un modo per sciogliere i vostri giuramenti .",
                            "verse 66:3": "Quando il Profeta confidò un segreto ad una delle sue spose, e questa lo andò a riferire [ad un altra], Allah lo informò [ed egli] ne confermò una parte tenendone nascosta un'altra .",
                            "verse 66:4": "Se entrambe ritornerete ad Allah, è segno che i vostri cuori si sono pentiti; se invece vi sosterrete a vicenda contro il Profeta,",
                            "verse 66:5": "allora che il suo Padrone è Allah e che Gabriele e i devoti tra i credenti e gli angeli saranno il suo sostegno.",
                            "verse 66:6": "Se vi ripudiasse, certamente il suo Signore vi sostituirebbe con delle spose migliori di voi, sottomesse ad Allah, credenti, devote, penitenti, adoranti, osservanti il digiuno , già sposate [in precedenza] o vergini.",
                            "verse 66:7": "O credenti, preservate voi stessi e le vostre famiglie, da un fuoco il cui combustibile saranno uomini e pietre e sul quale vegliano angeli formidabili, severi, che non disobbediscono a ciò che Allah comanda loro e che eseguono quello che viene loro ordinato.",
                            "verse 66:8": "O credenti, non chiedete scusa oggi, sarete compensati solo per quel che avrete fatto.",
                            "verse 66:9": "O credenti, pentitevi davanti ad Allah d'un pentimento sincero.",
                            "verse 66:10": "O Profeta, combatti i miscredenti e gli ipocriti e sii severo nei loro confronti.",
                            "verse 66:11": "Allah ha proposto ai miscredenti l'esempio della moglie di Noè e della moglie di Lot.",
                            "verse 66:12": "Allah ha proposto ai credenti l'esempio della moglie di Faraone , quando invocò: « Signore, costruiscimi vicino a Te una casa nel Giardino.",
                            "verse 66:13": "E Maria, figlia di 'Imrân, che conservò la sua verginità; insufflammo in lei del Nostro Spirito."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "預言者よ，アッラーがあなたのために合法とされていることを（アッラーの御好意を求めるためではなく）只あなたの妻たちの御機嫌をとる目的だけで何故自ら禁止するのか。本当にアッラーは寛容にして慈悲深くあられる。",
                            "verse 66:2": "（人びとよ）アッラーは，あなたがたのために誓いを解消するよう既に御達しがあった。アッラーはあなたがたの守護者であり，全知にして英明であられる。",
                            "verse 66:3": "預言者が妻の一人（ハフサ）にある秘密を打ち明けた時，かの女（ハフサ）はそれを（アーイシャに）口外したので，アッラーはそのこと（秘密を漏したこと）をかれに知らせた。かれはその一部分を（ハフサに）話し，一部分は伏せて置いた。それでかれが，かの女（ハフサ）にそれを告げると，かの女は，「誰があなたにそれを告げましたか。」と言った。かれは（答えて）言った。「何もかも御存知の御方が，わたしに告げられました。」",
                            "verse 66:4": "もし梅悟してアッラーに帰るならば，あなたがた2人の心は，善いほうに傾く。もし共謀してかれに反抗するならば，アッラーはかれの守護者であられ，またジブリールや，正しい信者たち，更に天使たちも皆（かれの）支持者である。",
                            "verse 66:5": "かれが，もしあなたがたを離婚したならば，かれはあなたがたに優る妻たちを，代りにかれに授けられるであろう。アッラーに服従，帰依し，信心深く誠実で，悔悟して（不断に主に）返り，（謙虚に）礼拝を捧げ，進んで事に当たり斎戒する者で，既婚者もあり処女もあろう。",
                            "verse 66:6": "あなたがた信仰する者よ，人間と石を燃料とする火獄からあなたがた自身とあなたがたの家族を守れ。そこには厳格で痛烈な天使たちが（任命されて）いて，かれらはアッラーの命じられたことに違犯せず，言い付けられたことを実行する。",
                            "verse 66:7": "（かれらは言われるであろう。）あなたがた不信心の者よ，今日は，弁解してはならない。あなたがたは，只あなたがたが行ったことに対して報いられるだけである。",
                            "verse 66:8": "あなたがた信仰する者よ，謙虚に悔悟してアッラーに帰れ。恐らく主は，あなたがたの様々な悪を払い，川が下を流れる楽園に入らせるであろう。その日アッラーは，預言者やかれに従って信じる者たちを，辱しめはしない。かれらの光は，その前方または右方だ閃こう。かれらは（祈って）言うであろう。「主よ，わたしたちのために，光を完全になされ，わたしたちを御赦し下さい。あなたは凡てのことに全能であられます。」",
                            "verse 66:9": "預言者よ，不信者と偽信者にたいし，奮闘努力しなさい。またかれらに対し強硬であれ。かれらの住まいは地獄である。何と悪い帰り所であることよ。",
                            "verse 66:10": "アッラーは不信者のために実例を示される。ヌーフの妻，そしてルートの妻である。かれら両人は，2人の正しいわがしもべの許にいた。かの女たちは，かれら（夫）にたいして不誠実で，アッラーの御許で何ら得るところはなかった。そして「あなたがた2人は（外の）入る者と一緒に火獄に入れ。」と告げられた。",
                            "verse 66:11": "またアッラーは，信仰する者のために例を示される。フィルアウンの妻である。かの女がこう言った時を思い起しなさい。「主よ，楽園の中のあなたの御側に，わたしのため家を御建て下さい。そしてフィルアウンとその行いから，わたしを救い，不義を行う者から，わたしを御救い下さい。」",
                            "verse 66:12": "またわれは自分の貞節を守ったイムラーンの娘マルヤム（の体内）に，わが霊を吹き込んだ。かの女は，主の御言葉とその啓典を実証する，敬炭な（しもべの）一人であった。 またアッラーは，信仰する者のために例を示される。フィルアウンの妻である。かの女がこう言った時を思い起しなさい。「主よ，楽園の中のあなたの御側に，わたしのため家を御建て下さい。そしてフィルアウンとその行いから，わたしを救い，不義を行う者から，わたしを御救い下さい。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "예언자여 하나님께서 그대에게 허용한 것을 스스로 금기하느 뇨 그대는 그대 아내들의 기쁨을 구하고 있으며 하나님은 관용과 자비로 충만하시니라",
                            "verse 66:2": "하나님은 너희를 위하여 너희의 속죄를 명령하셨나니 하나님 이 너희의 보호자이시라 실로 그 분은 아심과 지혜로 충만하시니라",
                            "verse 66:3": "선지자께서 그분의 한 아내에게 한가지 기밀을 이야기 했을 때그녀는 그것을 타인에게 알렸으매하나님께서 그로 하여금 그것을 알도록 하자 그가 일부를 확인하 고 일부는 거절하고서 그것에 대 해 아내에게 말했을 때 아내는 누가 이 사실을 알려주셨습니까 라 고 물으매 아시며 지켜보시는 하 나님이 내게 알려 주었도다 라고 대답하였더라",
                            "verse 66:4": "만일 너희 둘이 하나님께 회 개하면 너희에게 복이 될 것이라 또한 너희 마음도 이미 그렇게 기 울었노라 너희 서로가 그분께 거 역한다 하여도 하나님과 가브리엘 천사와 믿음으로 의로운 자들이 그분을 도울 것이며 천사들도 더 욱 그러하리라",
                            "verse 66:5": "그가 너희와 이혼한다 하여 도 주님께서는 너희보다 더 나은 부인들로 너희 자리를 대체하여 주시니 그녀들은 보다 순종하고 믿음에 충실하며 헌신하고 회개하 며 겹손하고 믿음을 위해 이주하 며 단식하는 기혼의 여성이거나 미혼 여성들이라",
                            "verse 66:6": "믿는 사람들이여 인간과 돌들이 연료가 되어 타고 있는 불로 부터 너희 자신과 너희 가족을 구 하라 그 위에 천사가 있어 하나 님께서 명령한 대로 거역하지 아 니하고 명령받은 대로 엄하게 행 할 뿐이라",
                            "verse 66:7": "불신자들이여 이날에 변명치 말라 너희는 너희가 행한 것에 따 라 벌을 받을 뿐이라",
                            "verse 66:8": "믿는 사람들이여 하나님께 진 실되게 회개하라 주님께서 너희 의 과오를 거두어 주사 너희로 하 여금 강물이 흐르는 천국으로 들 게 하시니라 하나님께서 선지자와 그와 더불어 믿는 자들을 부끄럽 지 않게 하실 그날 그들의 광명이 그들의 앞과 오른쪽에서 빛날 것 이라 그들은 주여 광명으로 완전 케 하여 주시고 저희를 보호하여 주소서 당신은 모든 일에 전지전 능 하시옵니다 라고 그들이 말하 리라",
                            "verse 66:9": "선지자여 불신자들과 위선자 들에 대항하여 성전하되 그들에 대하여 엄격하라 그들의 거주지 는 지옥의 사악한 말로이니라",
                            "verse 66:10": "하나님께서 불신자들을 비유하사 노아의 아내와 롯의 아내를 비유하셨나니 그들 둘은 하나님 의 의로운 종들 밑에 있었으나 그 둘은 그들의 남편들을 배반하였으 매 그들의 행위로 말미암아 하나 님으로부터 아무 것도 얻지 못한 채 너희는 다른 사람들이 들어가 는 지옥으로 함께 들어가라는 말 밖엔 얻은 것이 없었노라",
                            "verse 66:11": "하나님께서 믿는 사람들을 위해 파라오의 아내를 비유하셨 나니 보라 그녀가 말하였노라 주 여 저를 위하여 당신 가까이 천국안에 궁궐을 지어 주소서 그리고 파라오와 그의 행위로부터 저를 구하여 주시고 사악한 자들로부터저를 구하여 주소서",
                            "verse 66:12": "순결을 지킨 이므란의 딸 마리아가 있었노라 그래서 하나님은 그녀의 몸에 그분의 영혼을 불어 넣었더니 그녀는 주님의 말씀 과 계시의 진리를 증언하고 순종 하는 자 중에 있었노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "ئه‌ی پێغه‌مبه‌ر تۆ بۆچی شتێک له خۆت حه‌رام ده‌که‌یت که خوا بۆی حه‌ڵاڵ کردویت، ده‌ته‌وێت به‌و کاره هاوسه‌ره‌کانت ڕازی بکه‌یت؟! له‌کاتێکدا هه‌ر خوا لێخۆشبوو میهره‌بانه‌.",
                            "verse 66:2": "به‌ڕاستی خوا هه‌ڵوه‌شاندنه‌وه‌ی سوێده‌کانتانی بۆ بڕیارداون (به‌وه‌ی که‌فاره‌تی بده‌ن)، ئه‌و خوایه گه‌وره‌تانه و پشتیوان و یارمه‌تی ده‌رتانه‌، هه‌ر ئه‌ویش زاتێکی زاناو دانایه‌.",
                            "verse 66:3": "کاتێك پێغه‌مبه‌ر (صلی الله علیه وسلم) قسه‌یه‌کی نهێنی لای هه‌ندێك له خێزانه‌کانی درکان (که ئه‌ویش دایکه حفصه بوو)، جا کاتێک ئه‌ویش باسه‌که‌ی گه‌یانده دایکه عائیشه خوایش پێغه‌مبه‌ری ئاگادارکرد له ڕازو نیازیان و باسی هه‌ندیك له ڕازه‌که‌ی کردو باسی هه‌ندێکی نه‌کرد، (پێغه‌مبه‌ر (صلی الله علیه وسلم) گله‌یی له دایکه حفصه کرد، ده‌رباره‌ی درکاندنی نهێنیکه‌) دایکه حفصه پرسی: کێ ئه‌م هه‌واڵه‌ی پێگه‌یاندیت؟ پێغه‌مبه‌ر (صلی الله علیه وسلم) وتی: خوای زاناو ئاگا منی ئاگادار کرد، (ئه‌م چه‌ند ئایه‌ته ده‌رباره‌ی ڕووداوێکی تایبه‌تیه له ژیانی پێغه‌مبه‌ر (صلی الله علیه وسلم) که له‌کتێبه‌کانی سیره‌دا باس کراوه‌).",
                            "verse 66:4": "(بۆیه خوا گه‌وره پێیان ده‌فه‌رموێت:) ئه‌گه‌ر هه‌ردووکتان داوای ته‌وبه و په‌شیمانی بکه‌ن و بگه‌ڕێنه‌وه بۆ لای خوا، ئه‌وه باشه‌، چونکه دڵه‌کانتان له‌خشته چوو بوو و ترازا بوو، خۆ ئه‌گه‌ر پشتی یه‌کتر بگرن دژ به پێغه‌مبه‌ر (صلی الله علیه وسلم)، ئه‌وه چاک بزانن که خوا خۆی یاریده‌ده‌رێتی و هه‌روه‌ها جوبره‌ئیل و ئیمانداره چاکه‌کان، فریشته‌کانیش له‌وه‌ودوا پشتیوانن بۆی.",
                            "verse 66:5": "ئه‌گه‌ر پیغه‌مبه‌ر (صلی الله علیه وسلم) ته‌ڵاقتان بدات، ئه‌وه نزیکه خوا هاوسه‌رانی چاکتر له ئێوه‌ی پی ببه‌خشتێت، موسڵمان و باوه‌ڕدار، ملکه‌چی په‌روه‌ردگار، زوو له هه‌ڵه په‌شیمان، خواپه‌رست و دیندار، ڕۆژووه‌وان، یان بیرو هۆشیان له‌کاردایه و سه‌رنجی دروست کراوانی خوا ده‌ده‌ن، هه‌روه‌ها ئه‌و ئافره‌تانه هه‌یانه بێوه‌ن و هه‌یانه کچن.",
                            "verse 66:6": "ئه‌ی ئه‌و کاسانه‌ی که باوه‌ڕتان هێناوه خۆتان و که‌سوکارتان بپارێزن له ئاگرێك که سووته‌مه‌نیه‌که‌ی خه‌ڵکی و به‌رده‌، سه‌رپه‌رشتیاری ئه‌و دۆزه‌خ و ئاگره‌، جۆره فریشته‌یه‌کن که زۆر دڵڕه‌ق و توندو تیژن، نافه‌رمانی خوا ناکه‌ن له هیچ شتێکدا که فه‌رمانیان پێ بدات و هه‌رچی فه‌رمانێکیان پێ بدرێت ئه‌نجامی ده‌ده‌ن.",
                            "verse 66:7": "ئه‌ی ئه‌وانه‌ی که بی باوه‌ڕ بوون ئه‌مڕۆ هیچ پاکانه‌یه‌ک مه‌که‌ن، چونکه ئێوه به‌ڕاستی ته‌نها پاداشتی ئه‌و کارو کرده‌وانه‌تان ده‌درێته‌وه که ئه‌نجامتان ده‌دا.",
                            "verse 66:8": "ئه‌ی ئه‌و که‌سانه‌ی که باوه‌ڕتان هێناوه‌، ئێوه به ته‌وبه‌و په‌شیمانیه‌کی په‌خت و دڵسۆزانه‌وه ڕوو بکه‌نه‌وه خوا، نزیکه په‌روه‌ردگارتان له هه‌ڵه و گوناهه‌کانتان خۆش ببێت و بتانخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نداها و ڕوبار به‌ژێر دره‌خت و کۆشکه‌کانیدا ده‌ڕوات، ڕۆژێك دێت که خوا پێغه‌مبه‌ر و ئه‌وانه‌ی له خزمه‌تیدا خه‌جاڵه‌ت و شه‌رمه‌زار ناکات، نوورو ڕوناکیان ده‌دره‌وشێته‌وه‌و دێت و ده‌چێت له به‌رده‌م و لای ڕاستیانه‌وه و ده‌ڵێن: په‌روه‌ردگارا ئه‌م نوورو ڕوناکیه‌مان بۆ زیاد بکه‌و لێمان خۆش ببه‌، چونکه به‌ڕاستی تۆ ده‌سه‌ڵاتت به‌سه‌ر هه‌موو شتێکدا هه‌یه‌.",
                            "verse 66:9": "ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) کۆشش بکه و بجه‌نگه دژی کافر و دووڕوه‌کان و توندو تیژبه له‌سه‌ریان، ئه‌وانه شوێنیان دۆزه‌خه‌، ئای که سه‌رنجامێکی خواپه‌.",
                            "verse 66:10": "خوا نموونه‌ی هێناوه‌ته‌وه به ژنی نوح و لوط بۆ ئه‌وانه‌ی که بێ باوه‌ڕ بوون، که ئه‌و دوو ئافره‌ته هاوسه‌ری دوو به‌نده‌ی چاك و پاکی ئێمه بوون، که‌چی خیانه‌تیان لێ کردن (باوه‌ڕیان پێیان نه‌بوو، غه‌یبه‌تیان ده‌کردن، گاڵته‌یان پێده‌کردن.",
                            "verse 66:11": "هه‌روه‌ها خوا نموونه‌ی هێناوه‌ته‌وه به هاوسه‌ره‌که‌ی فیرعه‌ون بۆ ئه‌وانه‌ی که باوه‌ڕیان هێناوه‌، کاتێك وتی: په‌روه‌ردگارا له‌لای خۆت له به‌هه‌شتدا ماڵێکم بۆ دروست بکه (تا به‌رده‌وام به‌دیدارت شاد ببم) و له ده‌ست فیرعه‌ون و کاروکرده‌وه‌ی ڕزگارم بکه و له‌ده‌ست ئه‌م قه‌ومه سته‌مکاره‌ش ده‌ربازم بکه‌.",
                            "verse 66:12": "هه‌روه‌ها نموونه‌ی هێناوه‌ته‌وه به مه‌ریه‌می کچی عیمرانیش که داوێنی خۆی به‌پاکی ڕاگرت، ئێمه‌ش له‌و ڕۆحه‌ی که به‌ده‌ستمانه‌، فوومان پێداکرد، ئه‌ویش باوه‌ڕی ته‌واوی هه‌بوو به گوفتارو فه‌رمانه‌کانی په‌روه‌ردگاری و هه‌میشه و به‌رده‌وام ملکه‌چ و فه‌رمانبه‌ردارو خواناس و نزاکار بوو."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Wahai Nabi! Mengapa engkau haramkan (dengan bersumpah menyekat dirimu daripada menikmati) apa yang dihalalkan oleh Allah bagimu, (kerana) engkau hendak mencari keredaan isteri-isterimu? (Dalam pada itu, Allah ampunkan kesilapanmu itu) dan Allah sememangnya Maha Pengampun, lagi Maha Mengasihani.",
                            "verse 66:2": "Sesungguhnya Allah telah menetapkan bagi kamu (wahai Nabi dan umatmu, untuk) melepaskan diri dari sumpah kamu (dengan membayar denda iaitu kaffarah) dan Allah ialah Pelindung yang mentadbirkan keadaan kamu dan Dia Maha Mengetahui, lagi Maha Bijaksana.",
                            "verse 66:3": "Dan (ingatlah), ketika Nabi memberitahu suatu perkara secara rahsia kepada salah seorang dari isteri-isterinya.",
                            "verse 66:4": "Jika kamu berdua bertaubat kepada Allah (wahai isteri-isteri Nabi, maka itulah yang sewajibnya), kerana sesungguhnya hati kamu berdua telah cenderung (kepada perkara yang menyusahkan Nabi) dan jika kamu berdua saling membantu untuk (melakukan sesuatu yang) menyusahkannya, (maka yang demikian itu tidak akan berjaya) kerana sesungguhnya Allah adalah Pembelanya dan selain dari itu Jibril serta orang-orang yang soleh dari kalangan orang-orang yang beriman dan malaikat-malaikat juga menjadi penolongnya.",
                            "verse 66:5": "Boleh jadi, jika Nabi menceraikan kamu, Tuhannya akan menggantikan baginya isteri-isteri yang lebih baik daripada kamu, yang menurut perintah, yang ikhlas imannya, yang taat, yang bertaubat, yang tetap beribadat, yang berpuasa, (meliputi) yang janda dan yang anak dara.",
                            "verse 66:6": "Wahai orang-orang yang beriman! Peliharalah diri kamu dan keluarga kamu dari Neraka yang bahan-bahan bakarannya: Manusia dan batu (berhala); Neraka itu dijaga dan dikawal oleh malaikat-malaikat yang keras kasar (layanannya); mereka tidak menderhaka kepada Allah dalam segala yang diperintahkanNya kepada mereka, dan mereka pula tetap melakukan segala yang diperintahkan.",
                            "verse 66:7": "Malaikat itu akan berkata kepada orang-orang yang dimasukkan ke dalam Neraka): Hai orang-orang yang kufur ingkar! Janganlah kamu menyatakan uzur (dengan meminta ampun) pada hari ini, (kerana masanya telah terlambat).",
                            "verse 66:8": "Wahai orang-orang yang beriman! Bertaubatlah kamu kepada Allah dengan Taubat Nasuha, mudah-mudahan Tuhan kamu akan menghapuskan kesalahan-kesalahan kamu dan memasukkan kamu ke dalam Syurga yang mengalir di bawahnya beberapa sungai, pada hari Allah tidak akan menghinakan Nabi dan orang-orang yang beriman bersama-sama dengannya; cahaya (iman dan amal soleh) mereka, bergerak cepat di hadapan mereka dan di sebelah kanan mereka (semasa mereka berjalan); mereka berkata (ketika orang-orang munafik meraba-raba dalam gelap-gelita): Wahai Tuhan kami! Sempurnakanlah bagi kami cahaya kami dan limpahkanlah keampunan kepada kami; sesungguhnya Engkau Maha Kuasa atas tiap-tiap sesuatu.",
                            "verse 66:9": "Wahai Nabi! Berjihadlah (menentang) orang-orang kafir dan orang-orang munafik, serta bertindak keras terhadap mereka dan (sebenarnya) tempat mereka ialah Neraka Jahannam dan itulah seburuk-buruk tempat kembali.",
                            "verse 66:10": "Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada manfaatnya) bagi orang-orang kafir (berhubung rapat dengan orang-orang mukmin selagi mereka tidak beriman dengan sebenar-benarnya), iaitu: Perihal isteri Nabi Nuh dan isteri Nabi Lut; mereka berdua berada di bawah jagaan dua orang hamba yang soleh dari hamba-hamba Kami (yang sewajibnya mereka berdua taati); dalam pada itu mereka berlaku khianat kepada suami masing-masing; maka kedua-dua suami mereka (yang berpangkat Nabi itu) tidak dapat memberikan sebarang pertolongan kepada mereka dari (azab) Allah dan (sebaliknya) dikatakan kepada mereka berdua (pada hari pembalasan): Masuklah kamu berdua ke dalam Neraka bersama-sama orang-orang yang masuk (ke situ).",
                            "verse 66:11": "Dan Allah mengemukakan satu misal perbandingan (yang menyatakan tidak ada mudaratnya) kepada orang-orang mukmin (berhubung rapat dengan orang-orang kafir kalau tidak terjejas keadaan imannya), iaitu: Perihal isteri Firaun, ketika dia berkata: Wahai Tuhanku! Binalah untukku sebuah rumah di sisiMu dalam Syurga dan selamatkanlah daku dari Firaun dan perbuatannya (yang kufur dan buas), serta selamatkanlah daku dari kaum yang zalim;",
                            "verse 66:12": "Dan juga (satu misal perbandingan lagi, iaitu): Mariam binti Imran (ibu Nabi Isa seorang perempuan) yang telah memelihara kehormatan dan kesuciannya (dari disentuh oleh lelaki; tetapi oleh sebab Kami telah takdirkan dia mendapat anak) maka Kami perintahkan Jibril meniup masuk ke dalam kandungan tubuhnya dari roh (ciptaan) Kami dan (sekalipun Mariam itu hidup di antara kaum kafir) dia mengakui kebenaran Kalimah-kalimah Tuhannya serta Kitab-kitabNya dan dia menjadi dari orang-orang yang tetap taat."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "اى پيامبر! چرا چيزى را كه خدا بر تو حلال كرده بخاطر جلب رضايت همسرانت بر خود حرام مى‏كنى؟! و خداوند آمرزنده و رحيم است",
                            "verse 66:2": "خداوند راه گشودن سوگندهايتان را (در اين گونه موارد) روشن ساخته; و خداوند مولاى شماست و او دانا و حكيم است",
                            "verse 66:3": "(به خاطر بياوريد) هنگامى را كه پيامبر يكى از رازهاى خود را به بعضى از همسرانش گفت، ولى هنگامى كه وى آن را افشا كرد و خداوند پيامبرش را از آن آگاه ساخت، قسمتى از آن را براى او بازگو كرد و از قسمت ديگر خوددارى نمود; هنگامى كه پيامبر همسرش را از آن خبر داد، گفت: ; س‏خ‏للّهچه كسى تو را از اين راز آگاه ساخت؟» فرمود: «خداوند عالم و آگاه مرا باخبر ساخت! س‏ذللّه",
                            "verse 66:4": "اگر شما (همسران پيامبر) از كار خود توبه كنيد (به نفع شماست، زيرا) دلهايتان از حق منحرف گشته; و اگر بر ضد او دست به دست هم دهيد، (كارى از پيش نخواهيد برد) زيرا خداوند ياور اوست و همچنين جبرئيل و مؤمنان صالح، و فرشتگان بعد از آنان پشتيبان اويند",
                            "verse 66:5": "اميد است كه اگر او شما را طلاق دهد، پروردگارش به جاى شما همسرانى بهتر براى او قرار دهد، همسرانى مسلمان، مؤمن، متواضع، توبه كار، عابد، هجرت‏كننده ، زنانى غيرباكره و باكره!",
                            "verse 66:6": "اى كسانى كه ايمان آورده‏ايد خود و خانواده خويش را از آتشى كه هيزم آن انسانها و سنگهاست نگه داريد; آتشى كه فرشتگانى بر آن گمارده شده كه خشن و سختگيرند و هرگز فرمان خدا را مخالفت نمى‏كنند و آنچه را فرمان داده شده‏اند (به طور كامل) اجرا مى‏نمايند!",
                            "verse 66:7": "اى كسانى كه كافر شده‏ايد امروز عذرخواهى نكنيد، چرا كه تنها به اعمالتان جزا داده مى‏شويد!",
                            "verse 66:8": "اى كسانى كه ايمان آورده‏ايد بسوى خدا توبه كنيد، توبه‏اى خالص; اميد است (با اين كار) پروردگارتان گناهانتان را ببخشد و شما را در باغهايى از بهشت كه نهرها از زير درختانش جارى است وارد كند، در آن روزى كه خداوند پيامبر و كسانى را كه با او ايمان آوردند خوار نمى‏كند; اين در حالى است كه نورشان پيشاپيش آنان و از سوى راستشان در حركت است، و مى‏گويند: «پروردگارا! نور ما را كامل كن و ما را ببخش كه تو بر هر چيز توانائى!»",
                            "verse 66:9": "اى پيامبر! با كفار و منافقين پيكار كن و بر آنان سخت بگير! جايگاهشان جهنم است، و بد فرجامى است!",
                            "verse 66:10": "خداوند براى كسانى كه كافر شده‏اند به همسر نوح و همسر لوط مثل زده است، آن دو تحت سرپرستى دو بنده از بندگان صالح ما بودند، ولى به آن دو خيانت كردند و ارتباط با اين دو (پيامبر) سودى به حالشان (در برابر عذاب الهى) نداشت، و به آنها گفته شد: «وارد آتش شويد همراه كسانى كه وارد مى‏شوند!»",
                            "verse 66:11": "و خداوند براى مؤمنان، به همسر فرعون مثل زده است، در آن هنگام كه گفت: «پروردگارا! خانه‏اى براى من نزد خودت در بهشت بساز، و مرا از فرعون و كار او نجات ده و مرا از گروه ستمگران رهايى بخش!»",
                            "verse 66:12": "و همچنين به مريم دختر عمران كه دامان خود را پاك نگه داشت، و ما را از روح خود در آن دميديم; او كلمات پروردگار و كتابهايش را تصديق كرد و از مطيعان فرمان خدا بود!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Ó profeta, por que te absténs daquilo que Deus te concedeu, procurando, com isso, agradar as tuas esposas, quando sabes que Deus é Indulgente, Misericordiosíssimo?",
                            "verse 66:2": "Deus vos permitiu a expiação dos vossos juramentos, porque é vosso Protetor e é o Sapiente, o Prudentíssimo.",
                            "verse 66:3": "Quando o Profeta confidenciou um segredo a uma das suas esposas (Hafsa), ela o revelou (a outra), e Deus informou-o disso; ele, então, confirmou uma parte disso, escondendo a outra.",
                            "verse 66:4": "Se vós, ambas, voltardes arrependidas a Deus, os vossos corações inclinar-se-ão para isso; porém, se confabulardes contra ele, sabei que Deus é o seu Protetor, bem como Gabriel, os virtuosos, dentre os fiéis e os anjos serão os (seus) socorredores.",
                            "verse 66:5": "Se ele se divorciar de vós, pode ser que o seu Senhor lhe conceda esposas muçulmanas preferíveis a vós, fiéis, devotas, arrependidas, adoradoras, jejuadoras, anteriormente casadas ou donzelas.",
                            "verse 66:6": "Ó fiéis, precavei-vos, juntamente com as vossas famílias, do fogo, cujo alimento serão os homens e as pedras, o qual é guardado por anjos inflexíveis e severos, que jamais desobedecem às ordens que recebem de Deus, mas executam tudo quanto lhes é imposto.",
                            "verse 66:7": "Ó incrédulos, não apresenteis escusas hoje, porque só sereis recompensados pelo que houverdes feito!",
                            "verse 66:8": "Ó fiéis, voltai, sinceramente arrependidos, a Deus; é possível que o vosso Senhor absolva as vossas faltas e vos introduza em jardins, abaixo dos quais correm os rios, no dia em que Deus não aviltará o Profeta e aqueles que com ele crerem.",
                            "verse 66:9": "Ó Profeta, combate com denodo os incrédulos e os hipócritas, e sê inflexível para com eles, pois a sua morada será o inferno.",
                            "verse 66:10": "Deus exemplifica, assim, aos incrédulos, com as mulheres de Noé e a de Lot: ambas achavam-se submetidas a dois dos Nossos servos virtuosos; porém, ambas os atraiçoaram e ninguém pôde defendê-las de Deus.",
                            "verse 66:11": "E Deus dá, como exemplo aos fiéis, o da mulher do Faraó, a qual disse: Ó Senhor meu, constrói-me, junto a Ti, uma morada no Paraíso, e livra-me do Faraó e das suas ações, e salva-me dos iníquos!",
                            "verse 66:12": "E com Maria, filha de Imran, que conservou o seu pudor, e a qual alentamos com o Nosso Espírito, por te acreditado nas palavras do seu Senhor e nos Seus Livros, e por se Ter contado entre os consagrados."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 66:1": "O, Profetule! De ce îți oprești tu ceea ce Allah ți-a îngãduit, cãutând mulțumirea soațelor tale? Allah, doarã, este Iertãtor",
                            "verse 66:2": "Îndurãtor[Ghafur, Rahim].",
                            "verse 66:3": "Allah a orânduit pentru voi dezlegarea jurãmintelor voastre iar Allah este Stãpânul vostru.",
                            "verse 66:4": "Înțelept [Al-'Alim, Al-Hakim].",
                            "verse 66:5": "Când Profetul i-a încredințat o tainã uneia dintre soațele lui, iar eaa povestit-o și Allah i-a vestit lui aceasta, atunci el a înștiințat despre o parte și a neglijat o altã parte.",
                            "verse 66:6": "Și de vã veți întoarce, cãindu-vã voi amândouã la Allah, inimile voastre sunt astfel înclinate.",
                            "verse 66:7": "Și dacã va divorța el de voi, s-ar putea ca Domnul lui sã-i dea în locul vostru soațe mai bune decât voi: musulmane, dreptcredincioase, ascul- tãtoare, tânguitoare, adoratoare, postitoare, desfeciorite și fecioa",
                            "verse 66:8": "O, voi cei care credeți! Pãziți-vã pe voi înșivã și familiile voastrede un Foc ale cãrui vreascuri sunt oamenii și pietrele și peste care sunt îngeri neînduplecați și aspr",
                            "verse 66:9": "O, voi necredincioșilor! Nu vã dezvinovãțiți în Ziua aceea, cãci voi veți fi rãsplãtiți dupã cele pe care le-ați sãvârșit!",
                            "verse 66:10": "O, voi cei care credeți! Întoarceți-vã la Allah întru cãințã curatã! Poate cã Domnul vostru vã va șterge faptele voastre cele rele și vã vaface sã intrați",
                            "verse 66:11": "O, Profetule! Luptã împotriva necredincioșilor și a fãțarnicilor șifii neînduplecat cu ei! Sãlașul lor va fi Gheena și ce rea soartã!",
                            "verse 66:12": "Allah le-a dat drept pildã pentru aceia care nu cred pe muierea lui Noe și pe muierea lui Lot, care s-au aflat sub oblãduirea a doi robi evlavioși dintre robii Noștri și care i-au viclenit pe ei , iar ei doi nu le-au p",
                            "verse 66:13": "Și Allah a dat-o drept pildã pentru aceia care cred pe muierea lui Faraon , care a zis: \"Doamne, dureazã-mi mie o casã lângã Tineîn Rai și mântuiește-mã pe mine de Faraon și de fapta sa și mâ",
                            "verse 66:14": "Și [la fel și] pe Maria, fiica lui 'Imran, care a rãmas neprihãnitã și am suflat în ea din Duhul Nostru."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 66:1": "O, Profetule! De ce opreşti ceea ce Dumnezeu ţi-a îngăduit cu soţiile tale? Dumnezeu este Iertător, Milostiv.",
                            "verse 66:2": "Dumnezeu vă cere să vă dezlegaţi de jurămintele voastre.",
                            "verse 66:3": "Când Profetul a încredinţat o taină uneia dintre soţii, iar aceasta a dezvăluit-o altei soţii, Dumnezeu îi dădu de ştire Profetului.",
                            "verse 66:4": "Dacă voi două vă căiţi înaintea lui Dumnezeu, înseamnă că inimile voastre se supun.",
                            "verse 66:5": "Dacă el vă alungă, Domnul său îi poate da în schimb alte soţii mai bune decât voi, supuse lui Dumnezeu, credincioase, pioase, pline de căinţă, slujitoare ale lui Dumnezeu, gata să plece în bejenie, fie dintre cele ce au mai fost măritate, fie fecioare.",
                            "verse 66:6": "O, voi cei ce credeţi! Păziţi-vă pe voi şi pe ai voştri de Focul care se hrăneşte cu oameni şi pietre! Îngeri uriaşi şi aprigi veghează asupra Focului, iar ei nu nesocotesc porunca lui Dumnezeu, ci fac întocmai ce li se porunceşte.",
                            "verse 66:7": "O, cei ce tăgăduiţi! Nu vă dezvinovăţiţi astăzi! Voi veţi fi răsplătiţi doar pentru ceea ce aţi făcut!",
                            "verse 66:8": "O, voi cei ce credeţi! Întoarceţi-vă către Dumnezeu căindu-vă sincer.",
                            "verse 66:9": "O, Profetule! Luptă-te cu tăgăduitorii şi cu făţarnicii! Fii aspru cu ei! Singurul lor adăpost va fi Gheena.",
                            "verse 66:10": "Dumnezeu le-a dat ca pildă tăgăduitorilor pe femeia lui Noe şi pe femeia lui Lot.",
                            "verse 66:11": "Dumnezeu a dat ca pildă credincioşilor pe femeia lui Faraon, când spuse: “Domnul meu! Zideşte-mi, la Tine, o casă în Rai! Mântuieşte-mă de Faraon şi de lucrarea sa! Mântuieşte-mă de poporul nedrept!”",
                            "verse 66:12": "Şi Maria, fiica lui Imran, care şi-a păzit fecioria! Noi am suflat din duhul Nostru asupra ei şi ea a mărturisit drept adevărate spusele şi Cărţile Domnului său."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "О пророк! Зачем ты запрещаешьсебе то,Что разрешил тебе Господь,Ища расположенья жен своих?Господь ведь милостив и всепрощающ!",
                            "verse 66:2": "Господь для вас позволил клятвырасторгать,Он — Покровитель ваш,Всеведущий и мудрый.",
                            "verse 66:3": "Когда одной из жен своихПророк поверил тайну,Она передала ее другой.",
                            "verse 66:4": "И если обе вы к Аллахув раскаянии обратитесь —А ведь уже склонились к этомуваши сердца, —(Он вам, поистине, простит).",
                            "verse 66:5": "А коль пророк вам даст развод,Возможно, что ГосподьВзамен вас лучших жен ему пошлет,Которые Аллаху предали’сьв раскаянии должном,Живут в смирении и благочестьеИ совершают Хадж, посты блюдут, —Будь то девицы или вдовы.",
                            "verse 66:6": "О вы, кто верует!Уберегите и себя, и семьи вашиот Огня,Для коего растопкой будут людии каменья,Над коим ангелы — суровы,непреклонны —Не нарушают то, что повелел Аллах,И исполняют все, что Он прикажет.",
                            "verse 66:7": "(И будут говорить они2252):«О вы, неверные!Сегодня вы не извиняйтесь,—Вам ныне воздается лишь за то,Чем вы грешили в жизни ближней».",
                            "verse 66:8": "О вы, кто верует!Вы обратитесь в искреннемраскаянье к Аллаху!Быть может, ваш ГосподьОчистит вас от дел греховных,Введет в Сады, реками омовенны, —В тот День,Когда Аллах посланника и тех, которыеуверовали с ним,(Не оскорбит) и не унизит.",
                            "verse 66:9": "О пророк! Веди суровую борьбуТы с лицемерами и с теми, ктоне верует (в Аллаха),И против них непримиримым будь.",
                            "verse 66:10": "Аллах в пример приводит дляне верующих (в Бога)Жену пророка Нуха и жену пророкаЛута2252а.",
                            "verse 66:11": "И предлагает праведным Аллахв примерЖену (египетского) Фараона.",
                            "verse 66:12": "(А также) и Марйам, Имрана дочь,Что сохранила девственную плоть."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "¡Profeta! ¿Por qué, para agradar a tus esposas, declaras prohibido lo que Alá ha declarado lícito para ti? Pero Alá es indulgente, misericordioso.",
                            "verse 66:2": "Alá os ha prescrito la anulación de vuestros juramentos.",
                            "verse 66:3": "Y cuando el Profeta dijo un secreto a una de sus esposas.",
                            "verse 66:4": "Si os volvéis ambas, arrepentidas, a Alá, es señal de que vuestros corazones han cedido.",
                            "verse 66:5": "Si él os repudia, quizá su Señor le dé, a cambio, esposas mejores que vosotras, sometidas a É1, creyentes, devotas, arrepentidas, que sirven a Alá, que ayunan, casadas de antes o vírgenes.",
                            "verse 66:6": "¡Creyentes! Guardaos, vosotros y vuestras familias, de un Fuego cuyo combustible lo forman hombres y piedras, y sobre el que habrá ángeles gigantescos, poderosos, que no desobedecen a Alá en lo que les ordena, sino que hacen lo que se les ordena.",
                            "verse 66:7": "¡Infieles! ¡No os disculpéis hoy! Se os retribuirá tan sólo según vuestras obras.",
                            "verse 66:8": "¡Creyentes! ¡Volveos a Alá con sincero arrepentimiento! Quizá vuestro Señor borre vuestras malas obras y os introduzca en jardines por cuyos bajos fluyen arroyos.",
                            "verse 66:9": "¡Profeta! ¡Combate contra los infieles y los hipócritas! ¡Muéstrate duro con ellos! Tendrán la gehena por morada.",
                            "verse 66:10": "Alá pone como ejemplo para los infieles a la mujer de Noé y a la mujer de Lot.",
                            "verse 66:11": "Y Alá pone como ejemplo para los creyentes a la mujer de Faraón.",
                            "verse 66:12": "Y a María, hija de Imran, que conservó su virginidad y en la que infundimos de Nuestro Espíritu."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "நபியே! உம் மனைவியரின் திருப்தியை நாடி, அல்லாஹ் உமக்கு அனுமதித்துள்ளதை ஏன் விலக்கிக் கொண்டீர்? மேலும் அல்லாஹ் மிகவும் மன்னிப்பவன், மிக்க கிருபையுடையவன்.",
                            "verse 66:2": "அல்லாஹ் உங்களுடைய சத்தியங்களை (சில போது தக்க பரிகாரங்களுடன்) முறித்து விடுவதை உங்களுக்கு ஏற்படுத்தியிருக்கிறான், மேலும் அல்லாஹ் உங்கள் எஜமானன்.",
                            "verse 66:3": "மேலும், நபி தம் மனைவியர் ஒருவரிடம் ஒரு செய்தியை இரகசியமாக ஆக்கிவைத்த போது அவர் (மற்றொருவருக்கு) அதை அறிவித்ததும், அ(வ்விஷயத்)தை அல்லாஹ் அவருக்கு வெளியாக்கி வைத்தான், அவர் அதில் சிலதை தெரிவித்ததும், சிலதை(த் தெரிவிக்காது) புறக்கணித்தும் இருந்தார், (இவ்வாறு) அவர் அதைத் தெரிவித்த போது \"உங்களுக்கு இதைத் தெரிவித்தவர் யார்?\" என்று அப்பெண் கேட்டார்.",
                            "verse 66:4": "நீங்கள் இருவரும் - இதற்காக அல்லாஹ்விடம் தவ்பா செய்வீர்களாயின் (அது உங்களுக்கு நலமாகும்) ஏனெனில் நிச்சயமாக உங்களிருவரின் இதயங்களும் (இவ்விஷயத்தில் கோணிச்) சாய்ந்து விட்டன - தவிர, நீங்கள் இருவரும் அவருக்கெதிராய் ஒருவருக்கொருவர் உதவி செய்து கொண்டால், நிச்சயமாக அல்லாஹ் - அவருடைய எஜமானன் (அவருக்கு உதவுவான், அன்றியும்) ஜிப்ரயீலும், ஸாலிஹான முஃமின்களும் (உதவுவார்கள்.",
                            "verse 66:5": "அவர் உங்களை 'தலாக்' சொல்லி விட்டால், உங்களை விடச் சிறந்த - முஸ்லிம்களான, முஃமினான, (இறைவனுக்கு) வழிபட்டு நடப்பவர்களான, தவ்பா செய்பவர்களான, வணங்குபவர்களான, நோன்பு நோற்பவர்களான - கன்னிமை கழிந்தவர், இன்னும் கன்னிப் பெண்டிர் - இத்தகையவரை அவருடைய இறைவன் அவருக்கு (உங்களுக்குப்) பகரமாக, மனைவியராய் கொடுக்கப் போதுமானவன்.",
                            "verse 66:6": "முஃமின்களே! உங்களையும், உங்கள் குடும்பத்தாரையும் (நரக) நெருப்பை விட்டுக் காப்பாற்றிக் கொள்ளுங்கள்; அதன் எரிபொருள் மனிதர்களும், கல்லுமேயாகும்; அதில் கடுமையான பலசாலிகளான மலக்குகள் (காவல்) இருக்கின்றனர், அல்லாஹ் அவர்களை ஏவி எதிலும் அவர்கள் மாறு செய்ய மாட்டார்கள், தாங்கள் ஏவப்பட்டபடியே அவர்கள் செய்து வருவார்கள்.",
                            "verse 66:7": "(அன்று காஃபிர்களிடம்) நிராகரித்தோரே! இன்று நீங்கள் எந்தப்புகழும் கூறாதீர்கள், நீங்கள் கூலி கொடுக்கப்படுவதெல்லாம் நீங்கள் செய்து கொண்டிருந்ததற்குத்தான்.",
                            "verse 66:8": "ஈமான் கொண்டவர்களே! கலப்பற்ற (மனதோடு) அல்லாஹ்விடம் தவ்பா செய்து, பாவமன்னிப்புப் பெறுங்கள்; உங்கள் இறைவன் உங்கள் பாவங்களை உங்களை விட்டுப் போக்கி உங்களைச் சுவனச் சோலைகளில் பிரவேசிக்கச் செய்வான், அவற்றின் கீழே ஆறகள் (சதா) ஓடிக் கொண்டே இருக்கும்; (தன்) நபியையும் அவருடன் ஈமான் கொண்டார்களே அவர்களையும் அந்நாளில் அல்லாஹ் இழிவுபடுத்தமாட்டான்; (அன்று ஈடேற்றம் பெற்ற) அவர்களுடைய பிரகாசம் (ஒளி) அவர்களுக்கு முன்னும் அவர்களுடைய வலப்புறத்திலும் விரைந்து கொண்டிருக்கும், அவர்கள் \"எங்கள் இறைவா! எங்களுக்கு, எங்களுடைய பிரகாசத்தை நீ முழுமையாக்கி வைப்பாயாக! எங்களுக்கு மன்னிப்பும் அருள்வாயாக! நிச்சயமாக நீ எல்லாப் பொருட்கள் மீதும் பேராற்றலுடையவன்\" என்று கூறி(ப் பிரார்த்தனை செய்து) கொண்டு இருப்பார்கள்.",
                            "verse 66:9": "நபியே! காஃபிர்களுடனும், முனாஃபிக்குகளுடனும் நீர் போரிட்டு, அவர்களிடம் கண்டிப்புடன் இருப்பீராக! அன்றியும் அவர்கள் ஒதுங்குமிடம் நரகமேயாகும், அது மிகவும் கெட்ட சேருமிடம் ஆகும்.",
                            "verse 66:10": "நிராகரிப்பவர்களுக்கு, நூஹுடைய மனைவியையும் லூத்துடைய மனைவியையும் அல்லாஹ் உதாரணமாக்கி வைக்கிறான,; இவ்விருவரும் ஸாலிஹான நம் நல்லடியார்களில், இரு நல்லடியார்களின் மனiவிகளாகவே இருந்தனர், எனினும் இவ்விருவரும் தம் கணவர்களை மோசம் செய்தனர், எனவே, அவ்விருவரும் (தம் மனைவியரான) அவ்விருவரைவிட்டும் அல்லாஹ்விலிருந்து (வேதனையைத்) தடுக்க இயலவில்லை, இன்னும், \"நீங்களிருவரும் (நரக) நெருப்பில் நுழைபவர்களுடனே நுழையுங்கள்\" என்று (இவ்விருவருக்கும்) கூறப்பட்டது.",
                            "verse 66:11": "மேலும், ஈமான் கொண்டவர்களுக்கு ஃபிர்அவ்னின் மனைவியை அல்லாஹ் உதாரணமாக கூறுகிறான்.",
                            "verse 66:12": "மேலும், இம்ரானின் புதல்வியான மர்யமையும் (அல்லாஹ் உதாரணமாக்கினான்) அவர் தம் கற்பைக் காத்துக் கொண்டார், நாம் (அவரில்) நம் ரூஹிலிருந்து (ஆத்மாவிலிருந்து) ஊதினோம்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "โอ้นบีเอ๋ย ทำไมเจ้าจึงห้ามสิ่งที่อัลลอฮ์ทรงอนุมัติแก่เจ้า เพื่อแสวงหาความพึงพอใจบรรดาภริยาของเจ้าเล่า? และอัลลอฮ์นั้นเป็นผู้ทรงอภัย ผู้ทรงเมตตา",
                            "verse 66:2": "แน่นอนอัลลอฮ์ได้ทรงกำหนดแก่พวกเจ้าแล้วในการแก้คำสาบานของพวกเจ้า และอัลลอฮ์เป็นผู้ทรงคุ้มครองพวกเจ้า และพระองค์เป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
                            "verse 66:3": "และจงรำลึกขณะที่ท่านนบีได้บอกความลับเรื่องหนึ่งแก่ภริยาบางคนของเขา ครั้นเมื่อนางได้บอกเล่าเรื่องนี้ (แก่คนอื่น) และอัลลอฮ์ได้ทรงแจ้งเรื่องนี้แก่เขา (ท่านนบี) เขาก็ได้แจ้งบางส่วนของเรื่องนี้ และไม่แจ้งบางส่วน ครั้นเมื่อเขา (ท่านนบี) ได้แจ้งเรื่องนี้แก่นาง นางได้กล่าวว่า ใครบอกเล่าเรื่องนี้แก่ท่าน? เขา (ท่านนบี) กล่าวว่า พระผู้ทรงรอบรู้ พระผู้ทรงตระหนักยิ่ง ทรงแจ้งแก่ฉัน",
                            "verse 66:4": "หากเจ้าทั้งสองกลับเนื้อกลับตัวขออภัยโทษต่ออัลลอฮ์ (ก็จะเป็นการดีแก่เจ้าทั้งสอง) เพราะแน่นอนหัวใจของเจ้าทั้งสองก็โอนอ่อนอยู่แล้ว แต่หากเจ้าทั้งสองร่วมกันต่อต้านเขา (ท่านนบี) แท้จริงอัลลอฮ์ พระองค์เป็นผู้ทรงคุ้มครองของเขา อีกทั้งญิบรีลและบรรดาผู้ศรัทธาที่ดี ๆ และนอกจากนั้น มลาอิกะฮ์ก็ยังเป็นผู้ช่วยเหลือสนับสนุนอีกด้วย",
                            "verse 66:5": "หากเขาหย่าพวกนาง บางทีพระเจ้าของเขาจะทรงเปลี่ยนแปลงให้แก่เขามีภริยาที่ดีกว่าพวกนาง เป็นหญิงที่นอบน้อมถ่อมตน เป็นหญิงผู้ศรัทธา เป็นหญิงผู้ภักดี เป็นหญิงผู้ขอลุแก่โทษ เป็นหญิงผู้มั่นต่อการอิบาดะฮ์ เป็นหญิงผู้มั่นต่อการถือศีลอด เป็นหญิงที่เป็นหม้าย และที่เป็นหญิงสาว",
                            "verse 66:6": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงคุ้มครองตัวของพวกเจ้าและครอบครัวของพวกเจ้าให้พ้นจากไฟนรก เพราะเชื้อเพลิงของมันคือมนุษย์และก้อนหิน มีมลาอิกะฮ์ผู้แข็งกร้าวหาญคอยเฝ้ารักษามันอยู่ พวกเขาจะไม่ฝ่าฝืนอัลลอฮ์ในสิ่งที่พระองค์ทรงบัญชาแก่พวกเขา และพวกเขาจะปฏิบัติตามที่ถูกบัญชา",
                            "verse 66:7": "โอ้บรรดาผู้ปฏิเสธศรัทธาเอ๋ย วันนี้พวกเจ้าอย่าได้แก้ตัวเลย แต่ว่าพวกเจ้าจะถูกตอบแทนตามที่พวกเจ้าได้กระทำไว้",
                            "verse 66:8": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงขอลุแก่โทษแด่อัลลอฮ์ด้วยการลุแก่โทษอย่างจริงจังเถิด บางทีพระเจ้าของพวกเจ้าจะลบล้างความผิดของพวกเจ้าออกจากพวกเจ้า และจะทรงให้พวกเจ้าเข้าสวนสวรรค์หลากหลาย ณ เบื้องล่าวสวนสวรรค์นั้นมีลำน้ำหลายสายไหลผ่าน วันที่อัลลอฮ์จะไม่ทรงทำให้นบีและบรรดาผู้ศรัทธาร่วมกับเขาต้องอัปยศ แสงสว่างของพวกเขาจะส่องจ้าไปเบื้องหน้าของพวกเขาและทางเบื้องขวาของพวกเขา พวกเขาจะกล่าวว่า ข้าแต่พระเจ้าของเรา ขอพระองค์ได้ทรงโปรดทำให้แสงสว่างของเราอยู่กับเราตลอดไป และทรงยกโทษให้แก่เรา แท้จริงพระองค์ท่านเป็นผู้ทรงอานุภาพเหนือทุกสิ่ง",
                            "verse 66:9": "โอ้นบีเอ๋ย จงต่อสู้กับพวกปฏิเสธศรัทธาและพวกมุนาฟิกีน และจงแข็งกร้าวกับพวกเขา เพราะที่พำนักของพวกเขาคือนรก และมันเป็นทางกลับที่ชั่วช้ายิ่ง",
                            "verse 66:10": "อัลลอฮ์ทรงยกอุทาหรณ์แก่บรรดาผู้ปฏิเสธศรัทธาถึงภริยาของนูห์ และภริยาของลู้ฏ นางทั้งสองอยู่ภายใต้การปกครองของบ่าวที่ดีทั้งสองในหมู่ปวงบ่าวของเรา แต่นางทั้งสองได้ทรยศต่อเขาทั้งสอง ดังนั้น เขาทั้งสองจึงไม่สามารถช่วยเขาทั้งสองให้พ้นจากการลงโทษของอัลลอฮ์แต่ประการใด จึงมีเสียงกล่าวขึ้นว่า เจ้าทั้งสองจงเข้าไปในไฟนรกพร้อมกับบรรดาผู้ที่เข้าไปในมัน",
                            "verse 66:11": "และอัลลอฮ์ทรงยกอุทาหรณ์แก่บรรดาผู้ศรัทธา ถึงภริยาของของฟิรเอาน์ เมื่อนางได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ ขอพระองค์ทรงโปรดสร้างบ้านหลังหนึ่งให้แก่ข้าพระองค์ ณ ที่พระองค์ท่านในสวนสวรรค์ และทรงโปรดช่วยข้าพระองค์ให้พ้นจากฟิรเอาน์และการกระทำของเขา และทรงโปรดช่วยข้าพระองค์ให้พ้นจากหมู่ชนผู้อธรรม",
                            "verse 66:12": "และมัรยัมบุตรีของอิมรอน ผู้ซึ่งรักษาพรหมจารีของนาง แล้วเราได้เป่าวิญญาณของเราเข้าไปในนาง และนางได้ศรัทธาต่อบัญญัติต่าง ๆ แห่งพระเจ้าของนาง และ (ได้ศรัทธาต่อ) คัมภีร์ต่าง ๆ ของพระองค์ และนางจึงอยู่ในหมู่ผู้นอบน้อม"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Ey Peygamber! Eşlerinin rızasını gözeterek Allah'ın sana helâl kıldığı şeyi niçin kendine haram ediyorsun? Allah çok bağışlayan, çok esirgeyendir.",
                            "verse 66:2": "Allah, (gerektiğinde) yeminlerinizi bozmanızı size meşru kılmıştır.",
                            "verse 66:3": "Peygamber, eşlerinden birine gizlice bir söz söylemişti.",
                            "verse 66:4": "Eğer ikiniz de Allah'a tevbe ederseniz, (yerinde olur).",
                            "verse 66:5": "Eğer o sizi boşarsa Rabbi ona, sizden daha iyi kendini Allah a veren, inanan, sebatla itaat eden, tevbe eden, ibadef eden, oruç tutan, dul ve bâkire eşler verebilir.",
                            "verse 66:6": "Ey inananlar! Kendinizi ve ailenizi, yakıtı insanlar ve taşlar olan ateşten koruyun.",
                            "verse 66:7": "Ey kâfirler! Bugün özür dilemeyin! Siz ancak işlediklerinizin cezasını çekeceksiniz, (denilir).",
                            "verse 66:8": "Ey iman edenler! Samimi bir tevbe ile Allah'a dönün.",
                            "verse 66:9": "Ey Peygamber! Kâfirlere ve münafıklara karşı cihad et, onlara karşı sert davran.",
                            "verse 66:10": "Allah, inkâr edenlere, Nuh'un karısı ile Lût'un karısını misal verdi.",
                            "verse 66:11": "Allah, inananlara da Firavun'un karısını misal gösterdi.",
                            "verse 66:12": "İffetini korumuş olan, İmran kızı Meryem'i de (Allah örnek gösterdi)."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "اے پیغمبر جو چیز خدا نے تمہارے لئے جائز کی ہے تم اس سے کنارہ کشی کیوں کرتے ہو؟ (کیا اس سے) اپنی بیویوں کی خوشنودی چاہتے ہو؟ اور خدا بخشنے والا مہربان ہے",
                            "verse 66:2": "اے نبئ (مکرّم!) آپ خود کو اس چيز (يعني شہد کے نوش کرنے) سے کيوں منع فرماتے ہيں جسے اللہ نے آپ کے لئے حلال فرما رکھا ہے? آپ اپني ازواج کي (اس قدر) دل جوئي فرماتے ہيں، اور اللہ بڑا بخشنے والا نہايت مہربان ہےo",
                            "verse 66:3": "(اے مومنو!) بيشک اللہ نے تمہارے لئے تمہاري قَسموں کا (کفارہ دے کر) کھول ڈالنا مقرر فرما ديا ہے? اور اللہ تمہارا مددگار و کارساز ہے، اور وہ خوب جاننے والا بڑي حکمت والا ہےo",
                            "verse 66:4": "خدا نے تم لوگوں کے لئے تمہاری قسموں کا کفارہ مقرر کردیا ہے۔ اور خدا ہی تمہارا کارساز ہے۔ اور وہ دانا (اور) حکمت والا ہے",
                            "verse 66:5": "اور (یاد کرو) جب پیغمبر نے اپنی ایک بی بی سے ایک بھید کی بات کہی تو (اس نے دوسری کو بتا دی)۔ جب اس نے اس کو افشاء کیا اور خدا نے اس (حال) سے پیغمبر کو آگاہ کردیا تو پیغمبر نے ان (بی بی کو وہ بات) کچھ تو بتائی اور کچھ نہ بتائی۔ تو جب وہ ان کو جتائی تو پوچھنے لگیں کہ آپ کو کس نے بتایا؟ انہوں نے کہا کہ مجھے اس نے بتایا ہے جو جاننے والا خبردار ہے",
                            "verse 66:6": "اور جب نبئ (مکرّم صلي اللہ عليہ وآلہ وسلم) نے اپني ايک زوجہ سے ايک رازدارانہ بات ارشاد فرمائي، پھر جب وہ اُس (بات) کا ذکر کر بيٹھيں اور اللہ نے نبي (صلي اللہ عليہ وآلہ وسلم) پر اسے ظاہر فرما ديا تو نبي (صلي اللہ عليہ وآلہ وسلم) نے انہيں اس کا کچھ حصہ جِتا ديا اور کچھ حصہ (بتانے) سے چشم پوشي فرمائي، پھر جب نبي (صلي اللہ عليہ وآلہ وسلم) نے انہيں اِس کي خبر دے دي (کہ آپ راز اِفشاء کر بيٹھي ہيں) تو وہ بوليں: آپ کو يہ کس نے بتا ديا ہے؟ نبي (صلي اللہ عليہ وآلہ وسلم) نے فرمايا کہ مجھے بڑے علم والے بڑي آگاہي والے (رب) نے بتا ديا ہےo",
                            "verse 66:7": "اگر تم دونوں اللہ کي بارگاہ ميں توبہ کرو (تو تمہارے لئے بہتر ہے) کيونکہ تم دونوں کے دل (ايک ہي بات کي طرف) جھک گئے ہيں، اگر تم دونوں نے اس بات پر ايک دوسرے کي اعانت کي (تو يہ نبي مکرّم صلي اللہ عليہ وآلہ وسلم کے لئے باعثِ رنج ہوسکتا ہے) سو بيشک اللہ ہي اُن کا دوست و مددگار ہے، اور جبريل اور صالح مومنين بھي اور اس کے بعد (سارے) فرشتے بھي (اُن کے) مددگار ہيںo",
                            "verse 66:8": "اگر تم دونوں خدا کے آگے توبہ کرو (تو بہتر ہے کیونکہ) تمہارے دل کج ہوگئے ہیں۔ اور اگر پیغمبر (کی ایذا) پر باہم اعانت کرو گی تو خدا اور جبریل اور نیک کردار مسلمان ان کے حامی (اور دوستدار) ہیں۔ اور ان کے علاوہ (اور) فرشتے بھی مددگار ہیں",
                            "verse 66:9": "اگر پیغمبر تم کو طلاق دے دیں تو عجب نہیں کہ ان کا پروردگار تمہارے بدلے ان کو تم سے بہتر بیبیاں دے دے۔ مسلمان، صاحب ایمان فرمانبردار توبہ کرنے والیاں عبادت گذار روزہ رکھنے والیاں بن شوہر اور کنواریاں",
                            "verse 66:10": "اگر وہ تمہيں طلاق دے ديں تو عجب نہيں کہ اُن کا رب انہيں تم سے بہتر ازواج بدلہ ميں عطا فرما دے (جو) فرمانبردار، ايماندار، اطاعت گزار، توبہ شعار، عبادت گزار، روزہ دار، (بعض) شوہر ديدہ اور (بعض) کنوارياں ہوں گيo",
                            "verse 66:11": "اے ايمان والو! اپنے آپ کو اور اپنے اہل و عيال کو اس آگ سے بچاؤ جس کا ايندھن انسان اور پتھر ہيں، جس پر سخت مزاج طاقتور فرشتے (مقرر) ہيں جو کسي بھي امر ميں جس کا وہ انہيں حکم ديتا ہے ا? کي نافرماني نہيں کرتے اور وہي کام انجام ديتے ہيں جس کا انہيں حکم ديا جاتا ہےo",
                            "verse 66:12": "مومنو! اپنے آپ کو اور اپنے اہل عیال کو آتش (جہنم) سے بچاؤ جس کا ایندھن آدمی اور پتھر ہیں اور جس پر تند خو اور سخت مزاج فرشتے (مقرر) ہیں جو ارشاد خدا ان کو فرماتا ہے اس کی نافرمانی نہیں کرتے اور جو حکم ان کو ملتا ہے اسے بجا لاتے ہیں",
                            "verse 66:13": "کافرو! آج بہانے مت بناؤ۔ جو عمل تم کیا کرتے ہو ان ہی کا تم کو بدلہ دیا جائے گا",
                            "verse 66:14": "اے کافرو! آج کے دن کوئي عذر پيش نہ کرو، بس تمہيں اسي کا بدلہ ديا جائے گا جو کرتے رہے تھےo",
                            "verse 66:15": "اے ايمان والو! تم اللہ کے حضور رجوعِ کامل سے خالص توبہ کر لو، يقين ہے کہ تمہارا رب تم سے تمہاري خطائيں دفع فرما دے گا اور تمہيں بہشتوں ميں داخل فرمائے گا جن کے نيچے سے نہريں رواں ہيں جس دن اللہ (اپنے) نبي (صلي اللہ عليہ وآلہ وسلم) کو اور اُن اہلِ ايمان کو جو اُن کي (ظاہري يا باطني) معيّت ميں ہيں رسوا نہيں کرے گا، اُن کا نور اُن کے آگے اور اُن کے دائيں طرف (روشني ديتا ہوا) تيزي سے چل رہا ہوگا، وہ عرض کرتے ہوں گے: اے ہمارے رب! ہمارا نور ہمارے لئے مکمل فرما دے اور ہماري مغفرت فرما دے، بيشک تو ہر چيز پر بڑا قادر ہےo",
                            "verse 66:16": "مومنو! خدا کے آگے صاف دل سے توبہ کرو۔ امید ہے کہ وہ تمہارے گناہ تم سے دور کر دے گا اور تم کو باغہائے بہشت میں جن کے نیچے نہریں بہہ رہی ہیں داخل کرے گا۔ اس دن پیغمبر کو اور ان لوگوں کو جو ان کے ساتھ ایمان لائے ہیں رسوا نہیں کرے گا (بلکہ) ان کا نور ایمان ان کے آگے اور داہنی طرف (روشنی کرتا ہوا) چل رہا ہوگا۔ اور وہ خدا سے التجا کریں گے کہ اے پروردگار ہمارا نور ہمارے لئے پورا کر اور ہمیں معاف کرنا۔ بیشک خدا ہر چیز پر قادر ہے",
                            "verse 66:17": "اے پیغمبر! کافروں اور منافقوں سے لڑو اور ان پر سختی کرو۔ ان کا ٹھکانا دوزخ ہے۔ اور وہ بہت بری جگہ ہے",
                            "verse 66:18": "اے نبيِ (مکرّم!) آپ کافروں اور منافقوں سے جہاد کيجيے (جنہوں نے آپ کے خلاف جارحيت، فتنہ و فساد اور سازشوں کا آغاز کر رکھا ہے) اور اُن پر سختي فرمائيے، اور ان کا ٹھکانا جہنم ہے، اور وہ کيا ہي برا ٹھکانا ہےo",
                            "verse 66:19": "اللہ نے اُن لوگوں کے لئے جنہوں نے کفر کيا ہے نوح (عليہ السلام) کي عورت (واعلہ) اور لوط (عليہ السلام) کي عورت (واہلہ) کي مثال بيان فرمائي ہے، وہ دونوں ہمارے بندوں ميں سے دو صالح بندوں کے نکاح ميں تھيں، سو دونوں نے اُن سے خيانت کي پس وہ اللہ (کے عذاب) کے سامنے اُن کے کچھ کام نہ آئے اور اُن سے کہہ ديا گيا کہ تم دونوں (عورتيں) داخل ہونے والوں کے ساتھ دوزخ ميں داخل ہو جاؤo",
                            "verse 66:20": "خدا نے کافروں کے لئے نوح کی بیوی اور لوط کی بیوی کی مثال بیان فرمائی ہے۔ دونوں ہمارے دو نیک بندوں کے گھر میں تھیں اور دونوں نے ان کی خیانت کی تو وہ خدا کے مقابلے میں اور ان عورتوں کے کچھ بھی کام نہ آئے اور ان کو حکم دیا گیا کہ اور داخل ہونے والوں کے ساتھ تم بھی دوزخ میں داخل ہو جاؤ",
                            "verse 66:21": "اور مومنوں کے لئے (ایک) مثال (تو) فرعون کی بیوی کی بیان فرمائی کہ اس نے خدا سے التجا کی کہ اے میرے پروردگار میرے لئے بہشت میں اپنے پاس ایک گھر بنا اور مجھے فرعون اور اس کے اعمال (زشت مآل) سے نجات بخش اور ظالم لوگوں کے ہاتھ سے مجھ کو مخلصی عطا فرما",
                            "verse 66:22": "اور اللہ نے اُن لوگوں کے لئے جو ايمان لائے ہيں زوج? فرعون (آسيہ بنت مزاحم) کي مثال بيان فرمائي ہے، جب اس نے عرض کيا: اے ميرے رب! تو ميرے لئے بہشت ميں اپنے پاس ايک گھر بنا دے اور مجھ کو فرعون اور اُس کے عملِ (بد) سے نجات دے دے اور مجھے ظالم قوم سے (بھي) بچا لےo",
                            "verse 66:23": "اور (دوسري مثال) عمران کي بيٹي مريم کي (بيان فرمائي ہے) جس نے اپني عصمت و عفّت کي خوب حفاظت کي تو ہم نے (اس کے) گريبان ميں اپني روح پھونک دي اور اس نے اپنے رب کے فرامين اور اس کي (نازل کردہ) کتابوں کي تصديق کي اور وہ اطاعت گزاروں ميں سے تھيo",
                            "verse 66:24": "اور (دوسری) عمران کی بیٹی مریم کی جنہوں نے اپنی شرمگاہ کو محفوظ رکھا تو ہم نے اس میں اپنی روح پھونک دی اور اپنے پروردگار کے کلام اور اس کی کتابوں کو برحق سمجھتی تھیں اور فرمانبرداروں میں سے تھیں تھيo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 66:1": "Эй Набий! Нима учун хотинларинг розилигини тилаб, Аллоҳ сенга ҳалол қилган нарсани ҳаром қиласан! Аллоҳ кечирувчи ва раҳмдилдир.",
                            "verse 66:2": "Батаҳҳиқ, Аллоҳ сизларга қасамларингизни бўшатишни шариатга киритди ва Аллоҳ сизнинг хожангиздир ва У ўта билувчи ва ўта ҳикматлидир.",
                            "verse 66:3": "Набий хотинларидан баъзисига сир гап айтган эди.",
                            "verse 66:4": "Агар икковингиз Аллоҳга тавба қилсангиз, батаҳқиқ, қалбларингиз (ҳаққа) моил бўлур.",
                            "verse 66:5": "У сизларни талоқ қилса, шоядки, Роббиси сиздан яхшироқ, муслима, мўмина, итоатли, тавбачи, ибодатли, рўзадор жувон ва қизларни ўрнингизга хотин қилиб берса.",
                            "verse 66:6": "Эй иймон келтирганлар! Ўзингизни ва аҳли аёлингизни ёқилғиси одамлару тошдан бўлган ўтдан сақланг.",
                            "verse 66:7": "Эй кофир бўлганлар, бугунги кунда узр айтманглар, сиз ўзингиз қилган ишларнинг жазосини олмоқдасиз, холос.",
                            "verse 66:8": "Эй иймон келтирганлар! Аллоҳга холис тавба қилинглар! Шоядки Роббингиз гуноҳларингизни ювса ва сизни дарахтлари остидан анҳорлар оқиб турган жаннатларга киритса.",
                            "verse 66:9": "Эй Набий! Кофир ва мунофиқларга қарши жиҳод қил ва уларга маҳкам тур.",
                            "verse 66:10": "Аллоҳ куфр келтирганларга Нуҳнинг хотини ва Лутнинг хотинини мисол қилиб келтирди.",
                            "verse 66:11": "Аллоҳ иймон келтирганларга Фиръавннинг хотинини мисол қилиб кўрсатди.",
                            "verse 66:12": "Ва Марям Имрон қизини (мисол келтирди), у фаржини пок сақлаган эди, Биз унга Ўз руҳимиздан пуфладик ва у Роббисининг сўзларини ҳамда китобларини тасдиқ қилди ва итоаткорлардан бўлди."
                        }
                    }
                }
            }
        }
    }
}