{
    "id": 67,
    "name_simple": "Al-Mulk",
    "revelation_place": "makkah",
    "revelation_order": 77,
    "bismillah_pre": true,
    "verses_count": 30,
    "short_text": "The Surah takes its name al-Mulk from the very first sentence.",
    "text": [
        "\n",
        "The Surah takes its name al-Mulk from the very first sentence.",
        "\n",
        "Period of Revelation",
        "\n",
        "It could not be known from any authentic tradition when this Surah was revealed, but the subject matter and the style indicate that it is one of the earliest Surahs to be revealed at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In this surah, on the one hand, the teachings of Islam have been introduced briefly, and, on the other, the people living in heedlessness have been aroused from their slumber in a most effective way. A characteristic of the earliest surahs of the Makkan period is that they present the entire teachings of Islam and the object of the Holy Prophet's mission, not in detail, but briefly, so that they are assimilated by the people easily. Moreover, they are particularly directed to make the people shun heedlessness, to make them think, and to arouse their dormant conscience.",
        "\n",
        "In the first five verses man has been made to realize that the universe in which he lives is a most well organized and fortified Kingdom in which he cannot detect any fault, any weakness or flaw, how ever hard he may try to probe. This Kingdom has been brought from nothing into existence by Allah Almighty Himself and All the powers of controlling, administering and ruling it are also entirely in Allah's hand and His power is infinite. Besides, man has also been told that in this wise system he has not been created without a purpose, but he has been sent here for a test and in this test he can succeed only by his righteous deeds and conduct.",
        "\n",
        "In vv. 6-11, dreadful consequences of disbelief which will appear in the Hereafter have been mentioned, and the people told that Allah, by sending His Prophets, has warned them of these consequences in this very world, as if to say \"Now, if you do not believe in what the Prophets say and correct your attitude and behavior accordingly, in the Hereafter you will yourself have to admit that you really deserved the punishment that was being meted out to you.\"",
        "\n",
        "In vv. 12-15, the truth that has been impressed on the minds is that the Creator cannot be unaware of His creation, as if to say: \"He is aware of each open and hidden secret of yours, even of the innermost ideas of your hearts. Hence, the right basis of morality is that man should avoid evil, fearing the accountability of the unseen God, whether in the world there is a power to take him to task for this or not, and whether in the world there is a possibility of being harmed by such a power or not. Those who adopt such a conduct in the world alone will deserve forgiveness and a rich reward in the Hereafter.\"",
        "\n",
        "In vv. 15-23, making allusions, one after the other to those common truths of daily occurrence, which man does not regard as worthy of much attention, he has been invited to consider them seriously. It has been said: \"Look: the earth on which you move about with full satisfaction and peace of mind, and from which you obtain your sustenance has been subdued for you by Allah; otherwise this earth might at any time start shaking suddenly so as to cause your destruction, or a typhoon might occur, which may annihilate you completely. Look at the birds that fly above you; it is only Allah Who is sustaining them in the air. Look at your own means and resources: if Allah wills to inflict you with a scourge, none can save you from it; and if Allah wills to close the doors of sustenance on you, none can open them for you. These things are there to make you aware of the truth, but you see them like animals, which are unable to draw conclusions from observations, and you do not use your\r\nsight, hearing and minds which Allah has bestowed on you as men; that is why you do not see the right way.\"",
        "\n",
        "In vv. 24-27, it has been said: \"You have ultimately to appear before your God in any case. It is not for the Prophet to tell you the exact time and date of the event. His only duty is to warn you beforehand of its inevitable occurrence. Today you do not listen to him and demand that he should cause the event to occur and appear prematurely before you; but when it does occur, and you see it with your own eyes, you will then be astounded. Then, it will be said to you \"This is the very thing you were calling to be hastened.\"",
        "\n",
        "In vv. 28-29 replies have been given to what the disbelievers of Makkah said against the Holy Prophet (upon whom be peace) and his Companions. They cursed the Holy Prophet and prayed for his and the believers destruction. To this it has been said: \"Whether those who call you to the right way are destroyed, or shown mercy by Allah, how will their fate change your destiny? You should look after yourselves and consider who would save you if you were overtaken by the scourge of God?You regard those who believe in God and put their trust in Him as the misguided. A time will come when it will become evident as to who was misguided in actual truth.",
        "\n",
        "In conclusion, the people have been asked this question and left to ponder over it \"If the water which has come out from the earth at some place in the desert or hill country of Arabia and upon which depends your whole life activity, should sink and vanish underground, who beside Allah can restore to you this life giving water?\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the statement “Blessed is He in whose hands is all sovereignty”. It takes its name from Divine sovereignty (mulk) mentioned in verse 1. The surah challenges the disbelievers with declarations of God’s total power over them, and everything else, in this world and the next. It describes the regret the disbelievers will express on the Day of Resurrection (verse 9 . and verse 27).The surah is also known as: Control, The Dominion, The Kingdom.",
    "name_translation": "Sovereignty",
    "name_complex": "Al-Mulk",
    "surah_name_ar": "الملك",
    "verses": {
        "Albanian": {
            "verse 67:1": "Është i lartësuar Ai, në dorën e të cilit është pushteti dhe Ai është i pushtetshëm për çdo gjë! –",
            "verse 67:2": "Ai i cili ka krijur jetën dhe vdekjen, për t’ju provuar se kush prej jush vepron më mirë; - Ai është i Plotëfuqishëm dhe falës.",
            "verse 67:3": "Ai, i cili, i ka krijuar shtatë qiej njërin mbi tjetrin, - ti nuk vëren në krijesat e Mëshiruesit kurrfarë disharmonie, dhe shiko edhe një ehrë a mos po sheh ndonjë plasaritje,",
            "verse 67:4": "pastaj shiko përsëri shumë herë, shikimi do të kthehet i lodhur dhe i molisuar.",
            "verse 67:5": "Na, juve ua kemi zbukuruar qiellin më të afërm me yje të shkëlqyeshme dhe kemi bërë që (zjarri i tyre) t’i gjuajë djajtë, për të cilët kemi përgatitur dënimin me zjarr.",
            "verse 67:6": "Kurse, për ata që nuk besojnë në Zotin e tyre, dënimi është skëterra; e sa i shëmtuar është ai vendbanim!",
            "verse 67:7": "Kur të hudhen në të, do të dëgjohet psherëtima e tyre, e zjarri do të ndizet furishëm,",
            "verse 67:8": "gati për të eksploduar nga ashpërsia. Kurdo që të hedhet në të ndonjë grup (jobesimtarësh), - rojtarët e skëterrës i pyesin ata: “A nuk u erdhi askush t’ua tërheq vërejtjen juve?”",
            "verse 67:9": "“Po”, përgjigjen ata, gjithsesi na ka ardhur neve përkujtuesi, por ne i kemi mohuar ata dhe kemi thënë: “Perëndia nuk ka shpallur asgjë, ju jeni në humbje të madhe!”",
            "verse 67:10": "Ata (jobesimtarët), thonë: “Sikur të kishim dëgjuar ose menduar, nuk do të gjendeshim midis banorëve të skëterrës!”",
            "verse 67:11": "Dhe, ata e pranuan mëkatin e tyre. Larg qofshin prej mëshirës së Zotit banorët e skëterrës!",
            "verse 67:12": "Me të vërtetë, ata që i frikohen Zotit të tyre edhe atëherë kur nuk i sheh askush, për ta ka falje dhe shpërblim të madh!",
            "verse 67:13": "Flitni ju fshehtas ose haptas, por Ai, me të vërtetë, di çka në zemrat tuaja!",
            "verse 67:14": "E si mos t’i dijë Ai, i cili ka krijuar çdo gjë dhe është i informuar hollësisht.",
            "verse 67:15": "Ai ju ka bërë Tokën të nënshtruar – të shërbyeshme, andaj ecni nëpër viset e saj dhe ushqehuni me atë që ju ka dhënë Ai. Ju (pasi të ringjalleni), do të ktheheni tek Ai.",
            "verse 67:16": "A jeni ju të sigurtë se Ai që është (Sundues) në qiell, nuk do t’ju fusë në tokë, kur ajo fillon të dridhet papritmas?",
            "verse 67:17": "Ose, a jeni të sigurtë se Ai që është (Sundues) në qiell, nuk do t’ju çojë furtunë gurësh? Atëherë do të dini se çfarë është vërejtja Ime!",
            "verse 67:18": "Me të vërtetë, i kanë konsideruar gënjeshtarë ata që kanë qenë përpara këtyre. E sa i ashpër ka qenë dënimi (pezmi) Im!",
            "verse 67:19": "A thua nuk po i shohin ata shpendët mbi kokat e tyre, se si fluturojnë, duke i hapur dhe mbledhur krahët? Askush nuk i mbanë ata, përveç Zotit Mëshirues; Ai, me të vërtetë, sheh çdo gjë.",
            "verse 67:20": "Ose, kush është ai që do të jetë ushtria e juaj, që t’u ndihmojë juve, përveç Mëshiruesit? Jobesimtarët janë vetëm në mashtrim, (s’ka ushtarë për ju).",
            "verse 67:21": "Kush janë ata që ju furnizojnë, në qoftë se Ai (Perëndia) e ndalon furnizimin? – Por, ata janë zhytur në të këqia dhe në arrati (nga e vërteta).",
            "verse 67:22": "Është më mirë ai që shkon rrëshqanas e kokëulur, apo ai që në rrugën e drejtë ecën vertikalisht e ballëlartë?",
            "verse 67:23": "Thuaj: “Ai është që ju ka krijur dhe u ka dhënë të dëgjuarit, të pamurit dhe zemrat (mendjen), kurse ju pak falenderoni!”",
            "verse 67:24": "Thuaj: “Ai ju ka krijuar të shpërndarë nëpër Tokë dhe para Tij do të tuboheni (për llogari)”.",
            "verse 67:25": "E ata thonë: “Kur është ky premtim (caktojeni), nëse thoni të vërtetën?!”",
            "verse 67:26": "Thuaj: “Vetëm Zoti e di (kohën), kurse unë jam vetëm paralajmërues i qartë”.",
            "verse 67:27": "Kur për së afërmi e panë dënimin, u zymtuan fytyrat e atyre që nuk kanë besuar dhe do t’u thuhet: “Qe, kjo është ajo që e keni kërkuar (shpejtimin e dënimit)!”",
            "verse 67:28": "Thuaj: “Ç’menoni ju, në qoftë se Perëndia më shkatërron mua dhe ata që janë me mua, ose na mëshiron; kush është ai që do t’i mbrojë jobesimtarët nga dënimi i padurueshëm?”",
            "verse 67:29": "Thuaj: “Ai është Mëshiruesi, (që na shpëton neve), në Atë besojmë dhe në Atë mbështetemi, e ju sigurisht do ta dini se kush është i humbur plotësisht”.",
            "verse 67:30": "Thuaj: “Çka mendoni, nëse ujërat tuaja ju shterren – kush do t’u sjell juve ujin rrjedhës?”"
        },
        "Amharic": {
            "verse 67:1": "ያ ንግሥና በእጁ የኾነው አምላክ ችሮታው በዛ፡፡ እርሱም በነገሩ ሁሉ ላይ ቻይ ነው፡፡",
            "verse 67:2": "ያ የትኛችሁ ሥራው ይበልጥ ያማረ መኾኑን ሊሞክራችሁ ሞትንና ሕይወትን የፈጠረ ነው፡፡ እርሱም አሸናፊው መሓሪው ነው፡፡",
            "verse 67:3": "ያ ሰባትን ሰማያት የተነባበሩ ኾነው የፈጠረ ነው፡፡ በአልረሕማን አፈጣጠር ውስጥ ምንም መዛነፍን አታይም፡፡ ዓይንህንም መልስ፡፡ «ከስንጥቆች አንዳችን ታያለህን?»",
            "verse 67:4": "ከዚያም ብዙ ጊዜ ዓይንህን መላልስ፡፡ ዓይንህ ተዋርዶ እርሱም የደከመ ኾኖ ወዳንተ ይመለሳል፡፡",
            "verse 67:5": "ቅርቢቱን ሰማይም በእርግጥ በመብራቶች (በከዋክብት) አጌጥናት፡፡ ለሰይጣናትም መቀጥቀጫዎች አደረግናት፡፡ ለእነርሱም (ለሰይጣኖች) የእሳትን ቅጣት አዘጋጀን፡፡",
            "verse 67:6": "ለእነዚያም በጌታቸው ለካዱት የገሀነም ቅጣት አልላቸው፡፡ መመለሻይቱም ከፋች!",
            "verse 67:7": "በውስጧ በተጣሉ ጊዜ፤ እርሷ የምትፈላ ስትኾን ለእርሷ (እንደ አህያ) ማናፋትን ይሰማሉ፡፡",
            "verse 67:8": "ከቁጭትዋ የተነሳ ልትቆራረጥ ትቀርባለች፡፡ በውስጧ ጭፍሮች በተጣሉ ቁጥር ዘበኞችዋ «አስፈራሪ (ነቢይ) አልመጣችሁምን?» በማለት ይጠይቋቸዋል፡፡",
            "verse 67:9": "«አይደለም በእርግጥ አስፈራሪ መጥቶናል፡፡ አስተባበልንም፡፡ አላህም ምንንም አላወረደ እናንተ (አውርዷል ስትሉ) በትልቅ ስህተት ውስጥ እንጅ አይደላችሁም አልን» ይላሉ፡፡",
            "verse 67:10": "«የምንሰማ ወይም የምናስብ በነበርንም ኖሮ በነዳጅ እሳት ጓዶች ውስጥ ባልኾን ነበር» ይላሉ፡፡",
            "verse 67:11": "በኀጢኣታቸውም ያምናሉ ለእሳት ጓዶችም (ከእዝነት) መራቅ ተገባቸው፡፡",
            "verse 67:12": "እነዚያ ጌታቸውን በሩቁ የሚፈሩ ለእነርሱ ምሕረትና ታላቅ ምንዳ አልላቸው፡፡",
            "verse 67:13": "(ሰዎች ሆይ!) ቃላችሁንም መስጥሩ፡፡ ወይም በእርሱ ጩሁ፡፡ እርሱ በልቦች ውስጥ ያለን ሁሉ ዐዋቂ ነው፡፡",
            "verse 67:14": "የፈጠረ አምላክ እርሱ ዕውቀት ረቂቁ፣ ውስጥ ዐዋቂው ሲኾን (ምስጢርን ሁሉ) አያውቅምን?",
            "verse 67:15": "እርሱ ያ ምድርን ለእናንተ የተገራች ያደረገላችሁ ነው፡፡ በጋራዎችዋና በመንገዶችዋም ኺዱ፡፡፡ ከሲሳዩም ብሉ፡፡ (ኋላ) መመለሻውም ወደእርሱ ብቻ ነው፡፡",
            "verse 67:16": "በሰማይ ውስጥ ያለን (ሰራዊት) በእናንተ ምድርን ቢደረባባችሁ ወዲያውም እርሷ የምታረገርግ ብትኾን ትተማመናላችሁን? (አትፈሩምን?)",
            "verse 67:17": "ወይም በሰማይ ውስጥ ያለን በእናንተ ላይ ጠጠርን ያዘለች ነፋስን ቢልክባችሁ ትተማመናላችሁን? (አትፈሩምን?) ማስጠንቀቄም እንዴት እንደኾነ ወደፊት ታውቃላችሁ፡፡",
            "verse 67:18": "እነዚያም ከእነርሱ በፊት የነበሩት በእርግጥ አስተባበሉ፡፡ ጥላቻዬም እንዴት ነበር!",
            "verse 67:19": "ወደ አእዋፍ ከበላያቸው ክንፎቻቸውን ዘርግተው ተንሳፋፊዎች የሚሰበሰቡም ሲኾኑ አላዩምን? ከአልረሕማን በቀር (ባየር ላይ) የሚይዛቸው የለም፡፡ እርሱ በነገሩ ሁሉ ተመልካች ነው፡፡",
            "verse 67:20": "በእውነቱ ያ እርሱ ከአልረሕማን ሌላ የሚረዳችሁ ለእናንተ የኾነ ሰራዊት ማነው? ከሓዲዎች በመታለል ውስጥ እንጅ በሌላ ላይ አይደሉም፡፡",
            "verse 67:21": "ወይም ሲሳዩን ቢይዝባችሁ ያ ሲሳይን የሚሰጣችሁ ማነው? በእውነቱ እነርሱ በሞገድና በመደንበር ውስጥ ችክ አሉ፡፡",
            "verse 67:22": "በፊቱ ላይ ተደፍቶ የሚኼድ ሰው ይበልጥ የቀና ነውን? ወይስ በቀጥተኛ መንገድ ላይ ተስተካክሎ የሚኼድ?",
            "verse 67:23": "«እርሱ ያ የፈጠራችሁ ለእናንተም መስሚያና ማያዎችን፣ ልቦችንም ያደረገላችሁ ነው፡፡ ጥቂትንም አታመስግኑም» በላቸው፡፡",
            "verse 67:24": "«እርሱ ያ በምድር ላይ የበተናቸሁ ነው፡፡ ወደእርሱም ትሰበሰባላችሁ» በላቸው፡፡",
            "verse 67:25": "«እውነተኞችም እንደኾናችሁ ይህ ቀጠሮ መቼ ነው?» ይላሉ፡፡",
            "verse 67:26": "«ዕውቀቱ አላህ ዘንድ ብቻ ነው፡፡ እኔ ግልጽ አስፈራሪ እንጅ ሌላ አይደለሁም» በላቸው፡፡",
            "verse 67:27": "(ቅጣቱን) ቅርብ ኾኖ ባዩትም ጊዜ የእነዚያ የካዱት ሰዎች ፊቶች ይክከፋሉ፡፡ «ይህ ያ በእርሱ ትከራከሩበት የነበራችሁት ነው» ይባላሉም፡፡",
            "verse 67:28": "«አያችሁን? አላህ ቢገድለኝ ከእኔ ጋር ያሉትንም (እንደዚሁ) ወይም (በማቆየት) ቢያዝንልን ከሓዲዎችን ከአሳማሚ ቅጣት የሚያድን ማን ነው?» በላቸው፡፡",
            "verse 67:29": "«እርሱ (እመኑበት የምላችሁ) አልረሕማን ነው፡፡ (እኛ) በእርሱ አመንን፡፡ በርሱም ላይ ተጠጋን፡፡ ወደ ፊትም በግልጽ መሳሳት ውስጥ የኾነው እርሱ ማን አንደ ኾነ በእርግጥ ታውቃላችሁ» በላቸው፡፡",
            "verse 67:30": "«አያችሁን? ውሃችሁ ሠራጊ ቢኾን ፈሳሺን ውሃ የሚያመጣላቸሁ ማን ነው?» በላቸው፡፡ (አላህ የዓለማት ጌታ ያመጣዋል)፡፡"
        },
        "Arabic": {
            "verse 67:1": "ٌريِدَق ٍءْيَش ِّلُك ٰىَلَع َوُهَو ُكْلُمْلا ِهِدَيِب يِذَّلا َكَراَبَت",
            "verse 67:2": "ُروُفَغْلا ُزيِزَعْلا َوُهَو ۚ اًلَمَع ُنَسْحَأ ْمُكُّيَأ ْمُكَوُلْبَيِل َةاَيَحْلاَو َتْوَمْلا َقَلَخ يِذَّلا",
            "verse 67:3": "ٍروُطُف نِم ٰىَرَت ْلَه َرَصَبْلا ِعِجْراَف ۖ ٍتُواَفَت نِم ِنَٰمْحَّرلا ِقْلَخ يِف ٰىَرَت اَّم ۖ اًقاَبِط ٍتاَواَمَس َعْبَس َقَلَخ يِذَّلا",
            "verse 67:4": "ٌريِسَح َوُهَو اًئِساَخ ُرَصَبْلا َكْيَلِإ ْبِلَقنَي ِنْيَتَّرَك َرَصَبْلا ِعِجْرا َّمُث",
            "verse 67:5": "ِريِعَّسلا َباَذَع ْمُهَل اَنْدَتْعَأَو ۖ ِنيِطاَيَّشلِّل اًموُجُر اَهاَنْلَعَجَو َحيِباَصَمِب اَيْنُّدلا َءاَمَّسلا اَّنَّيَز ْدَقَلَو",
            "verse 67:6": "ُريِصَمْلا َسْئِبَو ۖ َمَّنَهَج ُباَذَع ْمِهِّبَرِب اوُرَفَك َنيِذَّلِلَو",
            "verse 67:7": "ُروُفَت َيِهَو اًقيِهَش اَهَل اوُعِمَس اَهيِف اوُقْلُأ اَذِإ",
            "verse 67:8": "ٌريِذَن ْمُكِتْأَي ْمَلَأ اَهُتَنَزَخ ْمُهَلَأَس ٌجْوَف اَهيِف َيِقْلُأ اَمَّلُك ۖ ِظْيَغْلا َنِم ُزَّيَمَت ُداَكَت",
            "verse 67:9": "ٍريِبَك ٍلاَلَض يِف اَّلِإ ْمُتنَأ ْنِإ ٍءْيَش نِم ُهَّللا َلَّزَن اَم اَنْلُقَو اَنْبَّذَكَف ٌريِذَن اَنَءاَج ْدَق ٰىَلَب اوُلاَق",
            "verse 67:10": "(ِريِعَّسلا ِباَحْصَأ يِف اَّنُك اَم ُلِقْعَن ْوَأ ُعَمْسَن اَّنُك ْوَل اوُلاَقَو",
            "verse 67:11": "(ِريِعَّسلا ِباَحْصَأِّل اًقْحُسَف ْمِهِبنَذِب اوُفَرَتْعاَف",
            "verse 67:12": "(ٌريِبَك ٌرْجَأَو ٌةَرِفْغَّم مُهَل ِبْيَغْلاِب مُهَّبَر َنْوَشْخَي َنيِذَّلا َّنِإ",
            "verse 67:13": "(ِروُدُّصلا ِتاَذِب ٌميِلَع ُهَّنِإ ۖ ِهِب اوُرَهْجا ِوَأ ْمُكَلْوَق اوُّرِسَأَو",
            "verse 67:14": "(ُريِبَخْلا ُفيِطَّللا َوُهَو َقَلَخ ْنَم ُمَلْعَي اَلَأ",
            "verse 67:15": "(ُروُشُّنلا ِهْيَلِإَو ۖ ِهِقْزِّر نِم اوُلُكَو اَهِبِكاَنَم يِف اوُشْماَف اًلوُلَذ َضْرَأْلا ُمُكَل َلَعَج يِذَّلا َوُه",
            "verse 67:16": "(ُروُمَت َيِه اَذِإَف َضْرَأْلا ُمُكِب َفِسْخَي نَأ ِءاَمَّسلا يِف نَّم مُتنِمَأَأ",
            "verse 67:17": "(ِريِذَن َفْيَك َنوُمَلْعَتَسَف ۖ اًبِصاَح ْمُكْيَلَع َلِسْرُي نَأ ِءاَمَّسلا يِف نَّم مُتنِمَأ ْمَأ",
            "verse 67:18": "(ِريِكَن َناَك َفْيَكَف ْمِهِلْبَق نِم َنيِذَّلا َبَّذَك ْدَقَلَو",
            "verse 67:19": "(ٌريِصَب ٍءْيَش ِّلُكِب ُهَّنِإ ۚ ُنَٰمْحَّرلا اَّلِإ َّنُهُكِسْمُي اَم ۚ َنْضِبْقَيَو ٍتاَّفاَص ْمُهَقْوَف ِرْيَّطلا ىَلِإ اْوَرَي ْمَلَوَأ",
            "verse 67:20": "(ٍروُرُغ يِف اَّلِإ َنوُرِفاَكْلا ِنِإ ۚ ِنَٰمْحَّرلا ِنوُد نِّم مُكُرُصنَي ْمُكَّل ٌدنُج َوُه يِذَّلا اَذَٰه ْنَّمَأ",
            "verse 67:21": "(ٍروُفُنَو ٍّوُتُع يِف اوُّجَّل لَب ۚ ُهَقْزِر َكَسْمَأ ْنِإ ْمُكُقُزْرَي يِذَّلا اَذَٰه ْنَّمَأ",
            "verse 67:22": "(ٍميِقَتْسُّم ٍطاَرِص ٰىَلَع اًّيِوَس يِشْمَي نَّمَأ ٰىَدْهَأ ِهِهْجَو ٰىَلَع اًّبِكُم يِشْمَي نَمَفَأ",
            "verse 67:23": "(َنوُرُكْشَت اَّم اًليِلَق ۖ َةَدِئْفَأْلاَو َراَصْبَأْلاَو َعْمَّسلا ُمُكَل َلَعَجَو ْمُكَأَشنَأ يِذَّلا َوُه ْلُق",
            "verse 67:24": "(َنوُرَشْحُت ِهْيَلِإَو ِضْرَأْلا يِف ْمُكَأَرَذ يِذَّلا َوُه ْلُق",
            "verse 67:25": "(َنيِقِداَص ْمُتنُك نِإ ُدْعَوْلا اَذَٰه ٰىَتَم َنوُلوُقَيَو",
            "verse 67:26": "(ٌنيِبُّم ٌريِذَن اَنَأ اَمَّنِإَو ِهَّللا َدنِع ُمْلِعْلا اَمَّنِإ ْلُق",
            "verse 67:27": "(َنوُعَّدَت ِهِب مُتنُك يِذَّلا اَذَٰه َليِقَو اوُرَفَك َنيِذَّلا ُهوُجُو ْتَئيِس ًةَفْلُز ُهْوَأَر اَّمَلَف",
            "verse 67:28": "(ٍميِلَأ ٍباَذَع ْنِم َنيِرِفاَكْلا ُريِجُي نَمَف اَنَمِحَر ْوَأ َيِعَّم نَمَو ُهَّللا َيِنَكَلْهَأ ْنِإ ْمُتْيَأَرَأ ْلُق",
            "verse 67:29": "(ٍنيِبُّم ٍلاَلَض يِف َوُه ْنَم َنوُمَلْعَتَسَف ۖ اَنْلَّكَوَت ِهْيَلَعَو ِهِب اَّنَمآ ُنَٰمْحَّرلا َوُه ْلُق",
            "verse 67:30": "(ٍنيِعَّم ٍءاَمِب مُكيِتْأَي نَمَف اًرْوَغ ْمُكُؤاَم َحَبْصَأ ْنِإ ْمُتْيَأَرَأ ْلُق"
        },
        "Azerbaijani": {
            "verse 67:1": "Mülk Əlində Olan Allah nə qədər xeyirxahdır. O hər şeyə qadirdir.",
            "verse 67:2": "Əməl baxımından hansınızın daha yaxşı olduğunuzu sınamaq üçün ölümü və həyatı yaradan Odur. O, Qüdrətlidir, Bağışlayandır.",
            "verse 67:3": "Yeddi göyü təbəqələr şəklində quran Odur. Sən Mərhəmətli Allahın yaratdığında qətiyyən bir uyuşmazlıq tapmazsan. Bir başını qaldırıb göyə diqqət yetir, heç onda bir çat görürsənmi?",
            "verse 67:4": "Sonra göz gəzdirib təkrar bax. Göz zəlil və yorğun halda özünə tərəf dönəcəkdir.",
            "verse 67:5": "Biz sizə yaxın olan göyü ulduzlarla bəzədik və onları şeytanlara atılan alovlar etdik. Biz onlar üçün yandırıb-yaxan od əzabı hazırlamışıq.",
            "verse 67:6": "Rəbbinə qarşı çıxanlar Cəhənnəm əzabına düçar olacaqlar. Ora nə pis dönüş yeridir.",
            "verse 67:7": "Onlar oraya vasil ediləndə onun dəhşətli uğultuyla qaynadığını eşidəcəklər.",
            "verse 67:8": "Cəhənnəm, qəzəbindən az qala parçalansın. Hər dəfə bir dəstə oraya atılarkən Cəhənnəmin gözətçiləri onlardan soruşacaqlar: “Məgər sizə xəbərdarlıq edən bir peyğəmbər gəlməmişdi?”",
            "verse 67:9": "Onlar deyəcəklər: “Əlbəttə, bizə qorxudan bir peyğəmbər gəlmişdi. Amma biz onu yalançı sayıb: “Allah heç bir şey nazil etməyib, siz də ancaq böyük bir azğınlıq içindəsiniz”– demişdik.",
            "verse 67:10": "Onlar deyəcəklər: “Əgər biz dinləsəydik və ya anlasaydıq alov şölələri saçan od sakinlərinin içində olmazdıq!”",
            "verse 67:11": "Onlar öz günahlarını etiraf edəcəklər. Rədd olsun alovlu od sakinləri!",
            "verse 67:12": "Həqiqətən, öz Rəbbindən Onu görmədikləri halda qorxanlar üçün bağışlanma və böyük bir mükafat vardır.",
            "verse 67:13": "Sözünüzü gizli saxlasanız da, onu açıq desəniz də, fərqi yoxdur, Allah kökslərdə olanları bilir.",
            "verse 67:14": "Yaradan Allah Lətif və hər şeydən Xəbərdar olduğu halda, ola bilərmi ki, O, gizlində və aşkarda olanları bilməsin?",
            "verse 67:15": "Yeri sizin ixtiyarınıza verən Odur. Onun hər tərəfində gəzin və Allahın ruzisindən yeyin. Qayıdış da Onadır.",
            "verse 67:16": "Göydə Olanın sizi yerə batırmayacağına əminsinizmi? O zaman yer hərəkətə gəlib titrəyəcəkdir.",
            "verse 67:17": "Ya da ki, göydə Olanın üstünüzə daşlar yağdırmayacağına əminsinizmi? Siz, Mənim xəbərdarlığımın necə nəticələr verdiyini biləcəksiniz.",
            "verse 67:18": "Müşriklərdən əvvəlkilər də bunu yalançı hesab etmişdilər. Görəydin Mənim onları həlak etməyim necə oldu!",
            "verse 67:19": "Məgər onlar başları üzərində dəstə-dəstə pərvazlanıb uçan, hərdən də qanadlarını yığan quşları görmürlərmi? Onları havada ancaq Mərhəmətli Allah saxlayır. Şübhəsiz ki, O, hər şeyi görür.",
            "verse 67:20": "Ya da Mərhəmətli Allahdan başqa sizə kömək edə biləcək qoşununuz varmı? Kafirlər ancaq aldanmaqdadırlar!",
            "verse 67:21": "Ya da O Öz ruzisini kəssə, sizə kim ruzi verə bilər? Xeyr, onlar təkəbbür göstərməkdə və haqdan qaçmaqda davam edirlər.",
            "verse 67:22": "Elə isə üzü üstə sürünərək gedən daha doğru yoldadır, yoxsa düz yolda özü şax gedən?",
            "verse 67:23": "De: “Sizi yaradan, sizə qulaq, göz və ürək verən Odur. Necə də az şükür edirsiniz!”",
            "verse 67:24": "De: “Sizi yer üzünə yayan da Odur. Siz Onun hüzuruna toplanılacaqsınız!”",
            "verse 67:25": "Onlar deyirlər: “Əgər doğru deyirsinizsə, bu vəd nə vaxt olacaq?”",
            "verse 67:26": "De: “Buna aid bilgi yalnız Allah yanındadır. Mən isə ancaq xəbərdar və bəyan edənəm!”",
            "verse 67:27": "Kafirlər əzabın yaxın olduğunu gördükdə üzləri eybəcər görkəm alacaq və onlara: “Sizin durmadan istədiyiniz əzab bax budur!”– deyiləcəkdir.",
            "verse 67:28": "De: “Deyin görüm, əgər Allah məni və mənimlə birlikdə olanları məhv edərsə və ya bizə mərhəmət göstərərsə, bəs siz kafirləri ağrılı-acılı əzabdan kim qurtara bilər?”",
            "verse 67:29": "De: “O, Mərhəmətli Allahdır! Biz Ona iman gətirib, Ona təvəkkül etmişik. Kimin tam azğınlıq içində olduğunu tezliklə biləcəksiniz.",
            "verse 67:30": "De: “Deyin görüm, əgər suyunuz yerin dibinə çöksə, Allahdan başqa kim sizə axar su gətirə bilər?”"
        },
        "Bengali": {
            "verse 67:1": "পূণ্যময় তিনি, যাঁর হাতে রাজত্ব। তিনি সবকিছুর উপর সর্বশক্তিমান।",
            "verse 67:2": "যিনি সৃষ্টি করেছেন মরণ ও জীবন, যাতে তোমাদেরকে পরীক্ষা করেন-কে তোমাদের মধ্যে কর্মে শ্রেষ্ঠ? তিনি পরাক্রমশালী, ক্ষমাময়।",
            "verse 67:3": "তিনি সপ্ত আকাশ স্তরে স্তরে সৃষ্টি করেছেন। তুমি করুণাময় আল্লাহ তা’আলার সৃষ্টিতে কোন তফাত দেখতে পাবে না। আবার দৃষ্টিফেরাও; কোন ফাটল দেখতে পাও কি?",
            "verse 67:4": "অতঃপর তুমি বার বার তাকিয়ে দেখ-তোমার দৃষ্টি ব্যর্থ ও পরিশ্রান্ত হয়ে তোমার দিকে ফিরে আসবে।",
            "verse 67:5": "আমি সর্বনিম্ন আকাশকে প্রদীপমালা দ্বারা সুসজ্জত করেছি; সেগুলোকে শয়তানদের জন্যে ক্ষেপণাস্ত্রবৎ করেছি এবং প্রস্তুত করে রেখেছি তাদের জন্যে জলন্ত অগ্নির শাস্তি।",
            "verse 67:6": "যারা তাদের পালনকর্তাকে অস্বীকার করেছে তাদের জন্যে রয়েছে জাহান্নামের শাস্তি। সেটা কতই না নিকৃষ্ট স্থান।",
            "verse 67:7": "যখন তারা তথায় নিক্ষিপ্ত হবে, তখন তার উৎক্ষিপ্ত গর্জন শুনতে পাবে।",
            "verse 67:8": "ক্রোধে জাহান্নাম যেন ফেটে পড়বে। যখনই তাতে কোন সম্প্রদায় নিক্ষিপ্ত হবে তখন তাদেরকে তার সিপাহীরা জিজ্ঞাসা করবে। তোমাদের কাছে কি কোন সতর্ককারী আগমন করেনি?",
            "verse 67:9": "তারা বলবেঃ হ্যাঁ আমাদের কাছে সতর্ককারী আগমন করেছিল, অতঃপর আমরা মিথ্যারোপ করেছিলাম এবং বলেছিলামঃ আল্লাহ তা’আলা কোন কিছু নাজিল করেননি। তোমরা মহাবিভ্রান্তিতে পড়ে রয়েছ।",
            "verse 67:10": "তারা আরও বলবেঃ যদি আমরা শুনতাম অথবা বুদ্ধি খাটাতাম, তবে আমরা জাহান্নামবাসীদের মধ্যে থাকতাম না।",
            "verse 67:11": "অতঃপর তারা তাদের অপরাধ স্বীকার করবে। জাহান্নামীরা দূর হোক।",
            "verse 67:12": "নিশ্চয় যারা তাদের পালনকর্তাকে না দেখে ভয় করে, তাদের জন্যে রয়েছে ক্ষমা ও মহাপুরস্কার।",
            "verse 67:13": "তোমরা তোমাদের কথা গোপনে বল অথবা প্রকাশ্যে বল, তিনি তো অন্তরের বিষয়াদি সম্পর্কে সম্যক অবগত।",
            "verse 67:14": "যিনি সৃষ্টি করেছেন, তিনি কি করে জানবেন না? তিনি সূক্ষ্নজ্ঞানী, সম্যক জ্ঞাত।",
            "verse 67:15": "তিনি তোমাদের জন্যে পৃথিবীকে সুগম করেছেন, অতএব, তোমরা তার কাঁধে বিচরণ কর এবং তাঁর দেয়া রিযিক আহার কর। তাঁরই কাছে পুনরুজ্জীবন হবে।",
            "verse 67:16": "তোমরা কি ভাবনামুক্ত হয়ে গেছ যে, আকাশে যিনি আছেন তিনি তোমাদেরকে ভূগর্ভে বিলীন করে দেবেন, অতঃপর তা কাঁপতে থাকবে।",
            "verse 67:17": "না তোমরা নিশ্চিন্ত হয়ে গেছ যে, আকাশে যিনি আছেন, তিনি তোমাদের উপর প্রস্তর বৃষ্টি বর্ষণ করবেন, অতঃপর তোমরা জানতে পারবে কেমন ছিল আমার সতর্কবাণী।",
            "verse 67:18": "তাদের পূর্ববর্তীরা মিথ্যারোপ করেছিল, অতঃপর কত কঠোর হয়েছিল আমার অস্বীকৃতি।",
            "verse 67:19": "তারা কি লক্ষ্য করে না, তাদের মাথার উপর উড়ন্ত পক্ষীকুলের প্রতি পাখা বিস্তারকারী ও পাখা সংকোচনকারী? রহমান আল্লাহ-ই তাদেরকে স্থির রাখেন। তিনি সর্ব-বিষয় দেখেন।",
            "verse 67:20": "রহমান আল্লাহ তা’আলা ব্যতীত তোমাদের কোন সৈন্য আছে কি, যে তোমাদেরকে সাহায্য করবে? কাফেররা বিভ্রান্তিতেই পতিত আছে।",
            "verse 67:21": "তিনি যদি রিযিক বন্ধ করে দেন, তবে কে আছে, যে তোমাদেরকে রিযিক দিবে বরং তারা অবাধ্যতা ও বিমুখতায় ডুবে রয়েছে।",
            "verse 67:22": "যে ব্যক্তি উপুড় হয়ে মুখে ভর দিয়ে চলে, সে-ই কি সৎ পথে চলে, না সে ব্যক্তি যে সোজা হয়ে সরলপথে চলে?",
            "verse 67:23": "বলুন, তিনিই তোমাদেরকে সৃষ্টি করেছেন এবং দিয়েছেন কর্ণ, চক্ষু ও অন্তর। তোমরা অল্পই কৃতজ্ঞতা প্রকাশ কর।",
            "verse 67:24": "বলুন, তিনিই তোমাদেরকে পৃথিবীতে বিস্তৃত করেছেন এবং তাঁরই কাছে তোমরা সমবেত হবে।",
            "verse 67:25": "কাফেররা বলেঃ এই প্রতিশ্রুতি কবে হবে, যদি তোমরা সত্যবাদী হও?",
            "verse 67:26": "বলুন, এর জ্ঞান আল্লাহ তা’আলার কাছেই আছে। আমি তো কেবল প্রকাশ্য সতর্ককারী।",
            "verse 67:27": "যখন তারা সেই প্রতিশ্রুতিকে আসন্ন দেখবে তখন কাফেরদের মুখমন্ডল মলিন হয়ে পড়বে এবং বলা হবেঃ এটাই তো তোমরা চাইতে।",
            "verse 67:28": "বলুন, তোমরা কি ভেবে দেখেছ-যদি আল্লাহ তা’আলা আমাকে ও আমার সংগীদেরকে ধ্বংস করেন অথবা আমাদের প্রতি দয়া করেন, তবে কাফেরদেরকে কে যন্ত্রণাদায়ক শাস্তি থেকে রক্ষা করবে?",
            "verse 67:29": "বলুন, তিনি পরম করুণাময়, আমরা তাতে বিশ্বাস রাখি এবং তাঁরই উপর ভরসা করি। সত্ত্বরই তোমরা জানতে পারবে, কে প্রকাশ্য পথ-ভ্রষ্টতায় আছে।",
            "verse 67:30": "বলুন, তোমরা ভেবে দেখেছ কি, যদি তোমাদের পানি ভূগর্ভের গভীরে চলে যায়, তবে কে তোমাদেরকে সরবরাহ করবে পানির স্রোতধারা?"
        },
        "Berber Amazigh": {
            "verse 67:1": "Iôqa Bu tgelda deg ufus iS, u Neppa, Izmer i yal cci;",
            "verse 67:2": "i Ixelqen tameppant, tameddurt, iwakken a kwen Ijeôôeb: anwa degwen ara ixedmen igiten ilhan sennig wiyav. Neppa d Uzmir, Ipsemmiê;",
            "verse 67:3": "i Ixelqen ûa igenwan d idurra. Deg wayen Ixleq Uênin, ur tepwaliv ayen ixuûûen. Ernu sikked ma a pwaliv i$isiyen!",
            "verse 67:4": "Sinna, ger tiî ik berdayen. Iéôi a d iu$al $uôek, iêfa, u inzef.",
            "verse 67:5": "Ni$ Ncebbeê igenni aqôib s teftilin, Nôeooem yisent cwaîen, Nhegga yasen aâaqeb n tmes.",
            "verse 67:6": "I wid inekôen Mass nnsen, aâaqeb n Loahennama. A tu$alin tucmip!",
            "verse 67:7": "Mi pwaveggôen $uôes, ad slen la tesraâriâ, u neppat trekkem.",
            "verse 67:8": "Qôib a ppeftutes seg iûiv. Yal tikelt ara iwaveggeô $uôes urbaâ, a ten steqsin iâssasen is: \"aâni ur kwen id iusi ara uneddaô\"?",
            "verse 67:9": "Ad inin: \"ih, iusa ya$ d uneddaô, nenkeô u nenna: ur illi ay d Issuder Öebbi, aql akwen kan di le$wlav meqqwôen\"!",
            "verse 67:10": "U nnan: \"lemmer nelli nsell ne$ nfehhem, ur nelli seg wat tmes\".",
            "verse 67:11": "Qaôôen s ibekkaven nnsen. Asêaq i at tmes!",
            "verse 67:12": "Wanag, i wid ippagwaden Mass nnsen, di tbavnit, ssmaê akked warraz meqqwôen.",
            "verse 67:13": "Hedôet s sser ne$ âinani, ihi, Neppa Iéôa ayen illan deg idmaren.",
            "verse 67:14": "Day ur Iéôi ara Win Ixelqen, Laîif Ippuxebbôen?",
            "verse 67:15": "Neppa i wen Irran tamurt d tamvuât. Elêut deg ibraêen is, ççet si ôôeéq is. £uôeS tanekra.",
            "verse 67:16": "Ma tepputebtem ar, Win Illan deg igenni, ad Irr tamurt a ppertem yiswen? Appan la teppembwiwil.",
            "verse 67:17": "Ma tepputebtem, ar Win Illan deg igenni, awen d Iazen tabucivant n yid$a$en? D$a, a ppissinem anwa t unabi W.",
            "verse 67:18": "Ni$ nekôen imezwura nnsen. Amek d Zzi$ fellasen!",
            "verse 67:19": "Ahat ur walan ara ifôax, sennig sen, d idurra, afriwen ceôqen, ur côiqen. Siwa Aênin iten Iîfen. Neppa, ih, Issikkid yal cci.",
            "verse 67:20": "Anwa wa ay d aâsekôiw nnwen, ara kwen isellken, war Aênin? Ijehliyen atnan kan di le$ôuô.",
            "verse 67:21": "Anwa wa ara kwen iôeéqen ma Ijmaâ l$it iS? Maca, vellelen deg u$unfu akked leqbaêa.",
            "verse 67:22": "Win iteddun, ibra i uqeôôu, day ipwanha sennig win iteddun, irfed aqeôôu, deg ubrid uwqim?",
            "verse 67:23": "Ini: \"d Neppa ikwen id Ixelqen. Irra yawen timejjin, allen, ulawen. Drus ay tesnemmirem\"!",
            "verse 67:24": "Ini: \"d Neppa ikwen isseftin di tmurt, ar $uôeS ara tepwafesrem\".",
            "verse 67:25": "La qqaôen: \"melmi lemâahda agi, ma d tidep ay tessawalem\"?",
            "verse 67:26": "Ini: \"i Iéôan siwa Öebbi. Nek d aneddaô kan ipbegginen.",
            "verse 67:27": "Mara a t walin iqeôb ed, ad ndellen wudmawen n wid ijehlen. A d inin: \"atan wayen tessuturem\".",
            "verse 67:28": "Ini: \"ma twalam ma In$a ya$ Öebbi, nek d imeddukwal iw, ne$ ma Iêun fella$? Ihi, anwa ara isellken ijehliyen seg uâaqeb aqeôêan\"?",
            "verse 67:29": "Ini: \"Neppa d Aênin, syiS numen, fellaS neppkel. A ppeéôem anwa i illan di ttelfan n ûûeê\".",
            "verse 67:30": "Ini: \"ma twalam, lemmer ad zzren waman nnwen, w ar awen d iawin aman ippazalen\"?"
        },
        "Bosnian": {
            "verse 67:1": "Uzvišen je Onaj u čijoj je ruci vlast – On sve može! –",
            "verse 67:2": "Onaj koji je dao smrt i život da bi iskušao koji od vas će bolje postupati; – On je Silni, Onaj koji prašta,",
            "verse 67:3": "Onaj koji je sedam nebesa jedna iznad drugih stvorio – ti u onome što Milostivi stvara ne vidiš nikakva nesklada, pa ponovo pogledaj vidiš li ikakav nedostatak,",
            "verse 67:4": "zatim ponovo više puta pogledaj, pogled će ti se vratiti klonuo i umoran.",
            "verse 67:5": "Mi smo vama najbliže nebo sjajnim zvijezdama ukrasili i učinili da vatra iz njih pogađa šejtane, za koje smo patnju u ognju pripremili.",
            "verse 67:6": "A za one koji ne vjeruju u Gospodara svoga kazna je Džehennem, užasno je on boravište!",
            "verse 67:7": "Kad budu u nj bačeni, pucketanje njegovo će čuti, i on će ključati,",
            "verse 67:8": "skoro da se od bijesa raspadne. Kad god se koja gomila u nj baci, stražari u njemu će je upitati: \"Zar nije niko dolazio da vas opominje?\"",
            "verse 67:9": "\"Jest, dolazio nam je onaj koji nas je opominjao\" – odgovoriće – \"a mi smo poricali i govorili: 'Allah nije objavio ništa, vi ste u velikoj zabludi!'\"",
            "verse 67:10": "I reći će: \"Da smo slušali ili razmišljali, ne bismo među stanovnicima Džehennema bili!\"",
            "verse 67:11": "I oni će priznati da su bili nevjernici – pa, stanovnici Džehennema ognjenog daleko bili!",
            "verse 67:12": "Onima koji se Gospodara svoga boje i kad ih niko ne vidi – oprost i nagrada velika!",
            "verse 67:13": "Govorili vi tiho ili glasno – pa, On, sigurno, zna svačije misli!",
            "verse 67:14": "A kako i ne bi znao Onaj koji stvara, Onaj koji sve potanko zna, koji je o svemu obaviješten.",
            "verse 67:15": "On vam je Zemlju pogodnom učinio, pa hodajte predjelima njezinim i hranite se onim što On daje, Njemu ćete poslije oživljenja odgovarati.",
            "verse 67:16": "Jeste li sigurni da vas Onaj koji nebesima vlada neće u zemlju utjerati, kad se ona počne iznenada tresti?",
            "verse 67:17": "Ili, jeste li sigurni da Onaj koji nebesima vlada na vas neće vjetar s kamenjem poslati? Tada biste saznali kakva je prijetnja Moja!",
            "verse 67:18": "A poricali su i oni prije njih, pa kakva je samo bila kazna Moja!",
            "verse 67:19": "Zar oni ne vide ptice iznad sebe kako raširenih krila lete, a i skupljaju ih? Samo ih Milostivi drži; On, zaista, sve dobro vidi.",
            "verse 67:20": "Ili, ko je taj koji će biti vojska vaša i vama pomoći, osim Milostivog? – Nevjernici su samo obmanuti.",
            "verse 67:21": "Ili, ko je taj koji će vas nahraniti, ako On hranu Svoju uskrati? – Ali, oni su uporni u bahatosti i u bježanju od istine.",
            "verse 67:22": "Da li je na ispravnijem putu onaj koji se idući spotiče ili onaj koji Pravim putem uspravno ide?",
            "verse 67:23": "Reci: \"On sve stvara i daje vam sluh i vid i pameti, a vi se malo zahvaljujete!\"",
            "verse 67:24": "Reci: \"On vas je po Zemlji razasuo i pred Njim ćete se sakupiti.\"",
            "verse 67:25": "A oni govore: \"Kad će već jednom ta prijetnja, ako istinu govorite?!\"",
            "verse 67:26": "Reci: \"Sam Allah zna! A ja sam dužan samo da javno opominjem.\"",
            "verse 67:27": "Kad je izbliza ugledaju, jad će prekriti lica onih koji nisu vjerovali i biće rečeno: \"Evo, ovo je ono što ste požurivali!\"",
            "verse 67:28": "Reci: \"Kažite vi meni: ako Allah pošalje smrt meni i onima koji su sa mnom, ili ako nam se smiluje, ko će nevjernike od neizdržljive patnje zaštititi?\"",
            "verse 67:29": "Reci: \"On je Milostivi, u Njega vjerujemo i na Njega se oslanjamo, a vi ćete, sigurno, saznati ko je u očitoj zabludi.\"",
            "verse 67:30": "Reci: \"Šta mislite, ako vam vode presuše – ko će vam tekuću vodu dati?\""
        },
        "Bulgarian": {
            "verse 67:1": "Благословен е Онзи, в Чиято Ръка е Владението. Той над всяко нещо има сила.",
            "verse 67:2": "Той е, Който сътвори смъртта и живота, за да ви изпита кой от вас е по-добър в делата. Той е Всемогъщия, Опрощаващия,",
            "verse 67:3": "Който сътвори седем небеса на слоеве. Не ще видиш несъразмерност в творението на Всемилостивия. Пак обърни взор! Нима виждаш пукнатини?",
            "verse 67:4": "После пак обърни взор веднъж и още веднъж. Взорът ще се върне към теб безсилен и морен.",
            "verse 67:5": "И украсихме най-близкото небе със светилници, и ги сторихме да бъдат камъни за сатаните. И приготвихме за тях мъчението на Пламъците.",
            "verse 67:6": "За онези, които не вярват в своя Господ, е мъчението на Ада. И как лоша е тази участ!",
            "verse 67:7": "Когато бъдат хвърлени там, ще чуят неговия рев, както ври,",
            "verse 67:8": "едва не избухва от ярост. Всякога, щом в него бъде хвърлена тълпа, стражите му ги питат: “Не дойде ли при вас предупредител?”",
            "verse 67:9": "Ще казват: “Да, наистина, дойде при нас предупредител, но [го] взехме за лъжец и казахме: “Аллах нищо не е низпослал. Вие сте в голяма заблуда.””",
            "verse 67:10": "И ще кажат: “Ако се бяхме вслушали или размислили, нямаше да сме сред обитателите на Пламъците.”",
            "verse 67:11": "И така ще признаят своя грях. Гибел за обитателите на Пламъците!",
            "verse 67:12": "За онези, които и в уединение се боят от своя Господ, наистина има опрощение и голяма награда.",
            "verse 67:13": "Тайно или открито да изричате думите си, Той знае съкровеното в сърцата.",
            "verse 67:14": "Нима Онзи, Който е сътворил, не знае? Той е Всепроникващия, Сведущия.",
            "verse 67:15": "Той е, Който подчини за вас земята, затова ходете из нейните краища и яжте от Неговото препитание! Към Него е възкресението.",
            "verse 67:16": "Нима имате сигурност, че Онзи, Който е на небето, не ще накара земята да ви погълне? И ето я - тресе се!",
            "verse 67:17": "Или имате сигурност, че Онзи, Който е на небето, не ще изпрати срещу вас ураган от камъни, та да разберете какво е Моето предупреждение?",
            "verse 67:18": "И онези преди тях отричаха. А какво бе Моето наказание!",
            "verse 67:19": "Не виждат ли те птиците над тях, разтварящи и свиващи криле? Държи ги само Всемилостивия. Той съзира всяко нещо.",
            "verse 67:20": "И кое ваше войнство ще ви помогне без Всемилостивия? Неверниците само се мамят.",
            "verse 67:21": "Или кой може препитание да ви даде, ако Той задържи Своето препитание? Ала упорстват в надменността и отдалечаването [от истината].",
            "verse 67:22": "Нима онзи, който върви с наведена глава, е по-напътен от онзи, който върви изправен по правия път?",
            "verse 67:23": "Кажи [о, Мухаммад]: “Той е, Който ви сътвори и създаде за вас слуха и зрението, и сърцата. Колко малко сте признателни!”",
            "verse 67:24": "Кажи: “Той е, Който ви намножи по земята и при Него ще бъдете събрани.”",
            "verse 67:25": "И казват: “Кога [ще се сбъдне] това обещание, ако говорите истината?”",
            "verse 67:26": "Кажи: “Знанието е само при Аллах, а аз съм само явен предупредител.”",
            "verse 67:27": "И когато го видят отблизо, лицата на неверниците ще помръкнат и ще им бъде казано: “Това е, което търсехте.”",
            "verse 67:28": "Кажи: “Виждате ли? Дори Аллах да погуби мен и тези с мен, или да ни пощади, кой ще защити неверниците от болезненото мъчение?”",
            "verse 67:29": "Кажи: “Той е Всемилостивия. Вярваме в Него и на Него се уповаваме. И ще узнаете кой е в явна заблуда.”",
            "verse 67:30": "Кажи: “Виждате ли? Ако водата ви потъне, кой ще ви даде изворна вода?”"
        },
        "Chinese": {
            "verse 67:1": "多福哉拥有主权者！他对於万事是全能的。",
            "verse 67:2": "他曾创造了死生，以便他考验你们谁的作为是最优美的。他是万能的，是至赦的。",
            "verse 67:3": "他创造了七层天，你在至仁主的所造物中，不能看出一点参差。你再看看！你究竟能看出甚么缺陷呢？",
            "verse 67:4": "然后你再看两次，你的眼睛将昏花地、疲倦地转回来！",
            "verse 67:5": "我确已以众星点缀最近的天，并以众星供恶魔们猜测。我已为他们预备火狱的刑罚。",
            "verse 67:6": "不信主的人们将受火狱的刑罚，那归宿真恶劣！",
            "verse 67:7": "当他们被投入火狱的时候，他们将听见沸腾的火狱发出驴鸣般的声音。",
            "verse 67:8": "火狱几乎为愤怒而破碎，每有一群人被投入其中，管火狱的天神们就对他们说：　难道没有任何警告者降临你们吗？",
            "verse 67:9": "他们说：不然！警告者确已降临我们了，但我们否认他们，我们说：真主没有降示甚么，你们只在重大的迷误中。'",
            "verse 67:10": "他们说：假若我们能听从，或能明理，我们必不致沦於火狱的居民之列！",
            "verse 67:11": "他们承认他们的罪过。让火狱的居民远离真主的慈恩！",
            "verse 67:12": "在秘密中畏惧主的人们，将蒙赦宥和重大的报酬。",
            "verse 67:13": "你们可以隐匿你们的言语；也可以把它说出来。他确是全 知心事的。",
            "verse 67:14": "创造者既是玄妙而且彻知的，难道他不知道你们所隐匿的言语吗？",
            "verse 67:15": "他为你们而使大地平稳，你们应当在大地的各方行走，应当吃他的给养，你们复活后，只归於他。",
            "verse 67:16": "难道你们不怕在天上的主使大地在震荡的时候吞咽你们吗？",
            "verse 67:17": "难道你们不怕在天上的主使飞沙走石的暴风摧毁你们吗？你们将知道我的警告是怎样的。",
            "verse 67:18": "在他们之前逝去的人们，确已否认众使者，我的谴责是怎样的？",
            "verse 67:19": "难道他们没有看见在他们的上面展翅和　翼的众鸟吗？只有至仁主维持它们，他确是明察万物的。",
            "verse 67:20": "除了真主援助你们外，还有谁能做你们的援军呢？你们只陷於自欺之中。",
            "verse 67:21": "谁能供给你们呢？如果至仁主扣留他的给养。不然，他们固执著骄傲和勃逆。",
            "verse 67:22": "究竟谁更能获得引导呢？是匍匐而行的人呢？还是在正路上挺身而行的人呢？",
            "verse 67:23": "你说：他是创造你们，并为你们创造耳、目和心的。你们却很少感谢。",
            "verse 67:24": "你说：他是使你们繁殖於大地上的，你们将来要被集合到他那里。",
            "verse 67:25": "他们说：这个警告甚么时候实现呢？如果你们是诚实的人。",
            "verse 67:26": "你说：关於此事的知识，只在主那里，我只是一个坦率的警告者。",
            "verse 67:27": "当他们看见这应许临近的时候，不信的人们的面目将变成黑的！或者将说：这就是你们生前妄言不会实现的事。",
            "verse 67:28": "你说：你们告诉我吧，如果真主毁灭我，和我的同道，或怜悯我们，那末，谁使不信道的人们得免於痛苦的刑罚呢？",
            "verse 67:29": "你说：他是至仁主，我们已信仰他，我们只信赖他。你们将知道谁在明显的迷误中。",
            "verse 67:30": "你说：你们告诉我吧，如果你们的水一旦渗漏了，谁能给你们一条流水呢？"
        },
        "Danish": {
            "verse 67:1": "Gezegend is Hij in Wiens hand het Koninkrijk is en Die macht heeft over alle dingen",
            "verse 67:2": "Die de dood en het leven heeft ingesteld, opdat Hij u moge beproeven wie onder u zich het beste gedraagt; en Hij is de Almachtige, de Vergevensgezinde",
            "verse 67:3": "Hij Die de zeven hemelen opeenvolgend heeft geschapen. Gij kunt geen tekort zien in de schepping van de Barmhartige. Kijk dan nog eens; ziet gij een enkel gebrek",
            "verse 67:4": "Kijk dan weer eens en dan nog eens, uw blik zal vermoeid en verzwakt tot u terugkeren",
            "verse 67:5": "En voorwaar, Wij hebben de naastbije hemel met lampen versierd, Wij hebben hem tot een middel gemaakt om de satans te verdrijven en voor hen hebben Wij de straf van het razende Vuur bereid",
            "verse 67:6": "En voor degenen die niet in hun Heer geloven is de straf der hel (bereid), en dit is een slechte bestemming",
            "verse 67:7": "Wanneer zij er in worden geworpen, zullen zij haar van woede horen zieden",
            "verse 67:8": "Zij zal bijna barsten van woede. Telkens als een groep er in geworpen wordt, zullen de bewakers er van (der hel) hun vragen: Kwam er geen waarschuwer tot u",
            "verse 67:9": "Zij zullen zeggen: Zeker, de waarschuwer kwam tot ons, maar wij verwierpen hem, en zeiden: Allah heeft niets geopenbaard; gij verkeert slechts in grote dwaling",
            "verse 67:10": "En zij zullen zeggen: Indien wij maar geluisterd hadden en ons verstand hadden gebruikt, zouden wij ons niet onder de bewonerg van het laaiende Vuur bevinden",
            "verse 67:11": "Dan zullen zij hun zonden bekennen; maar de bewoners van het Vuur zijn verre (van genade)",
            "verse 67:12": "Waarlijk, degenen die hun Heer in het verborgene vrezen, zullen vergiffenis en een grote beloning ontvangen",
            "verse 67:13": "Hetzij gij uw woorden verbergt of openbaar maakt, Hij weet, wat in (uw) binnenste is",
            "verse 67:14": "Zou Hij Die schiep niet alles weten? Hij is Aldoordringend, Alkennend",
            "verse 67:15": "Hij is het Die de aarde aan u onderworpen heeft; wandelt dus op haar paden en geniet van haar gaven. En tot Hem zal de Opstanding zijn",
            "verse 67:16": "Voelt gij u veilig voor Hem Die in de Hemel is, dat Hij u niet zal doen verzwelgen als de aarde plotseling begint te schudden",
            "verse 67:17": "Voelt gij u veilig voor Hem Die in de Hemel is, dat Hij niet tegen u een orkaan zal zenden? Dan zult gij weten, hoe (mijn) waarschuwing was",
            "verse 67:18": "En voorzeker loochenden zij die vóór u waren ook (de boodschap). Hoe (ernstig) was dan Mijn afkeuring",
            "verse 67:19": "Hebben zij de vogelen niet boven hun (hoofden) gezien, die hun vleugels uitspreiden en in- eenvouwen? Niemand behalve de Barmhartige houdt ze tegen, waarlijk, Hij ziet alle dingen",
            "verse 67:20": "Waar is uw leger dat u buiten Allah om zou kunnen helpen? De ongelovigen zijn omhuld door bedrog",
            "verse 67:21": "Of wie is er die voor u wil zorgen indien Hij Zijn voorziening terughoudt? Neen, zij volharden in opstandigheid en afkerigheid",
            "verse 67:22": "Is hij die gebogen loopt, beter geleid of hij die rechtop het rechte pad bewandelt",
            "verse 67:23": "Zeg: Hij is het, Die u schiep, en u oren, ogen en hart gaf; weinig dank betuigt gij er voor",
            "verse 67:24": "Zeg: Hij is het Die u vermenigvuldigt op aarde en tot Hem zult gij bijeen verzameld worden",
            "verse 67:25": "En zij zeggen: Wanneer zal deze belofte vervuld worden, als gij de waarheid spreekt",
            "verse 67:26": "Zeg: De kennis daarvan ligt alleen bij Allah en ik ben slechts een duideliike waarschuwer",
            "verse 67:27": "Maar als zij de straf van nabij zullen zien, zal het gezicht der ongelovigen zich verduisteren en er zal gezegd worden: Dit is wat gij placht te vragen",
            "verse 67:28": "Zeg: Vertel mij, indien Allah mij en degenen die met mij zijn, zou vernietigen - veeleer zal Hij ons genadig zijn - wie zal de ongelovigen tegen een pijnlijke straf kunnen beschermen",
            "verse 67:29": "Zeg: Hij is de Barmhartige, in Hem geloven wij en in Hem stellen wij ons vertrouwen. En gij zult weldra weten wie in klaarblijkelijke dwaling verkeert",
            "verse 67:30": "Zeg: Vertel mij, indien uw water diep in de aarde wegzakt, wie zal u dan helder stromend water kunnen brengen"
        },
        "Dutch": {
            "verse 67:1": "Gezegend is Degene in Wiens Hand de heerschappij is. En Hij is Almachtig over alle zaken.",
            "verse 67:2": "Degenen Die de dood en het leven heeft geschapen om jullie te beproeven, (en te tonen) wie van jullie de beste daden verricht. En Hij is de Almachtige, de Vergevensgezinde.",
            "verse 67:3": "Degene Die de hemel in lagen heeft geschapen. Jij ziet in de schepping van de Erbarmer geen onevenwichtigheid. Kijk dan nog een keer, zie jij een afwijking?",
            "verse 67:4": "Kijk dan nog eens twee maal, jij zult jouw ogen nederig neerslaan, terwijl zij vermoeid zijn.",
            "verse 67:5": "En voorzeker, Wij hebben de nabije hemel met lampen (sterren) gesierd en Wij maakten die om er de Satans mee te stenigen. En Wij hebben voor hen de bestraffing van Sa'îr (de Hel) bereid.",
            "verse 67:6": "En voor degenen die niet in hun Heer geloven, is er de bestraffing van de Hel. En dat is de slechtste plaats van bestemming!",
            "verse 67:7": "En wanneer zij daarin geworpen worden, dan horen zij een afschrikwekkend gebrul ervan, terwijl zij (de Hel) raast.",
            "verse 67:8": "Haast barst zij van woede. Telkens wanneer een groep erin wordt geworpen, vragen de wakers ervan hen: \"Is er geen waarschuwer tot jullie gekomen?\"",
            "verse 67:9": "Zij zeggen: \"Welzeker, er is waarlijk een waarschuwer tot ons gekomen, maar toen loochenden wij. En wij zeiden: \"Allah heeft niets neergezonden, jullie verkeren slechts in grote dwaling.\"",
            "verse 67:10": "Zij zeiden: \"Als wij (het) konden horen of begrijpen, dan zouden wij niet tot de bewoners van Sa'îr (de Hel) behoren!\"",
            "verse 67:11": "Zij bekennen dan hun zonden. Daarom, ten onder gaan de bewoners van Sa'îr (de Hel)!",
            "verse 67:12": "Voorwaar, voor degenen die hun Heer in het verborgene vrezen, voor hen is er vergeving en een grote beloning.",
            "verse 67:13": "En houdt jullie woorden geheim of maakt ze openbaar: voorwaar, Hij is Alwetend over wat er in de harten is.",
            "verse 67:14": "Zou Hij die schiep geen kennis hebben (over het geschapene)? Hij is de Zachtmoedige, de Alwetende.",
            "verse 67:15": "Hij is Degene Die de aarde voor jullie begaanbaar heeft gemaakt. Wandelt dan over haar zijden en eet van Zijn voorzieningen. En tot Hem is de opwekking.",
            "verse 67:16": "Voelen jullie je er veilig voor dat Hij Die in de hemel is, jullie niet zal doen wegzinken in de aarde? Zij begint al te schudden!",
            "verse 67:17": "Of voelen jullie je er veilig voor dat Hij Die in de hemel is, niet een vulkanische regen over jullie zal zenden? Jullie zullen dan weten hoe (terecht) Mijn waarschuwing was.",
            "verse 67:18": "En voorzeker, degenen die er vóór hen (de Boodschappers) waren loochenden, en hoe (verschrikkelijk) was toen Mijn verafschuwing.",
            "verse 67:19": "En kijken jullie niet naar de vogels boven jullie, hoe zij hun vleugels uitslaan en weer ineenvouwen? Er is niemand die ze tegenhoudt dan de Erbarmer. Voorwaar, Hij is Alziende over alle zaken.",
            "verse 67:20": "Of wie is het die voor jullie als een leger is en die jullie helpt naast de Erbarmer? De ongelovigen verkeren slechts in dwaling,",
            "verse 67:21": "Of wie is het die jullie voorziet als Hij Zijn voorzieningen tegenhoudt? Nee, zij volharden in hoogmoed en afschuw.",
            "verse 67:22": "Is hij dan, die voortkruipt met zijn gezicht over de grond, beter geleid dan hij die rechtop op het rechte Pad loopt?",
            "verse 67:23": "Zeg: \"Hij is Degene Die jullie heeft doen ontstaan en voor jullie het gehoor, het gezichtsvermogen en de harten heeft gemaakt. Weinig is de dankbaarheid die jullie tonen.\"",
            "verse 67:24": "Zeg: \"Hij is Degene Die jullie op de aarde vermenigvuldigd heeft en tot Hem zullen jullie verzameld worden.\"",
            "verse 67:25": "En zij zeggen: \"Wanneer zal deze aanzegging plaatsvinden, als jullie waarachtigen zijn?\"",
            "verse 67:26": "Zeg: \"De kennis daarover is slechts bij Allah en ik ben slechts een duidelijke waarschuwer.\"",
            "verse 67:27": "Wanneer zij dan (de bestraffing) van dichtbij zien, worden de gezichten van degenen die niet geloven bedroefd, en er zal worden gezegd: \"Dit is waar jullie om plachten te vragen.\"",
            "verse 67:28": "Zeg: \"Wat dachten jullie, als Allah mij en wie met mij zijn vernietigt of als Hij ons begenadigt, wie beschermt dan de ongelovigen tegen een pijnlijke bestraffing?\"",
            "verse 67:29": "Zeg: \"Hij is de Erbarmer, Wij geloven in Hem en wij vertrouwen op Hem.\" Jullie zullen weten wie in duidelijke dwaling verkeert.\"",
            "verse 67:30": "Zeg: \"Wat dachten jullie, als jullie water plotseling in de aarde verdwijnt, wie zal jullie dan stromend water brengen?\""
        },
        "English": {
            "verse 67:1": "Blessed is He in whose hand is dominion, and He is over all things competent -",
            "verse 67:2": "[He] who created death and life to test you [as to] which of you is best in deed - and He is the Exalted in Might, the Forgiving -",
            "verse 67:3": "[And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?",
            "verse 67:4": "Then return [your] vision twice again. [Your] vision will return to you humbled while it is fatigued.",
            "verse 67:5": "And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze.",
            "verse 67:6": "And for those who disbelieved in their Lord is the punishment of Hell, and wretched is the destination.",
            "verse 67:7": "When they are thrown into it, they hear from it a [dreadful] inhaling while it boils up.",
            "verse 67:8": "It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\"",
            "verse 67:9": "They will say,\" Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'\"",
            "verse 67:10": "And they will say, \"If only we had been listening or reasoning, we would not be among the companions of the Blaze.\"",
            "verse 67:11": "And they will admit their sin, so [it is] alienation for the companions of the Blaze.",
            "verse 67:12": "Indeed, those who fear their Lord unseen will have forgiveness and great reward.",
            "verse 67:13": "And conceal your speech or publicize it; indeed, He is Knowing of that within the breasts.",
            "verse 67:14": "Does He who created not know, while He is the Subtle, the Acquainted?",
            "verse 67:15": "It is He who made the earth tame for you - so walk among its slopes and eat of His provision - and to Him is the resurrection.",
            "verse 67:16": "Do you feel secure that He who [holds authority] in the heaven would not cause the earth to swallow you and suddenly it would sway?",
            "verse 67:17": "Or do you feel secure that He who [holds authority] in the heaven would not send against you a storm of stones? Then you would know how [severe] was My warning.",
            "verse 67:18": "And already had those before them denied, and how [terrible] was My reproach.",
            "verse 67:19": "Do they not see the birds above them with wings outspread and [sometimes] folded in? None holds them [aloft] except the Most Merciful. Indeed He is, of all things, Seeing.",
            "verse 67:20": "Or who is it that could be an army for you to aid you other than the Most Merciful? The disbelievers are not but in delusion.",
            "verse 67:21": "Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion.",
            "verse 67:22": "Then is one who walks fallen on his face better guided or one who walks erect on a straight path?",
            "verse 67:23": "Say, \"It is He who has produced you and made for you hearing and vision and hearts; little are you grateful.\"",
            "verse 67:24": "Say, \"It is He who has multiplied you throughout the earth, and to Him you will be gathered.\"",
            "verse 67:25": "And they say, \"When is this promise, if you should be truthful?\"",
            "verse 67:26": "Say, \"The knowledge is only with Allah, and I am only a clear warner.\"",
            "verse 67:27": "But when they see it approaching, the faces of those who disbelieve will be distressed, and it will be said, \"This is that for which you used to call.\"",
            "verse 67:28": "Say, [O Muhammad], \"Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?\"",
            "verse 67:29": "Say, \"He is the Most Merciful; we have believed in Him, and upon Him we have relied. And you will [come to] know who it is that is in clear error.\"",
            "verse 67:30": "Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\""
        },
        "Filipino": {
            "verse 67:1": "Luwalhatiin Siya na nag-aangkin ng Paghahari sa kapamahalaan sa Kanyang mga Kamay at Siya ay may kapangyarihan sa lahat ng bagay",
            "verse 67:2": "Siya na lumikha ng kamatayan at buhay upang masubukan Niya kung sino sa inyo ang pinakamabuti sa asal (at pag-uugali), at Siya ang Pinakamataas sa Kapangyarihan, ang Lubos na Mapagpatawad",
            "verse 67:3": "Siya na lumikha ng pitong kalangitan sa magkakasunod na antas. Ikaw ay walang mapagmamalas na kamalian (o pangangailangan ) sa mga Likha ng Diyos na Pinakamapagbigay. Kaya’t muli mong ibaling ang iyong paningin: “Ikaw ba ay nakakamalas ng punit o siwang (kaguluhan)?”",
            "verse 67:4": "Kaya’t muli mong malasin at muli sa ibang araw, ang iyong paningin ay magbabalik sa iyo na mapanglaw at nanghihina at naririmlan",
            "verse 67:5": "At katotohanangginayakan Naminangpinakamababang kalangitan ng mga pananglaw at ginawa Namin ang gayong mga ilaw (bilang) mga pamuksang sandata upang itaboy ang masasama (mga diyablo), Aming inihanda sa kanila ang Kaparusahan ng Naglalagablab na Apoy",
            "verse 67:6": "At sa mga nagtatakwil sa kanilang Panginoon at Tagapagtaguyod (Allah), sasakanila ang Kaparusahan ng Impiyerno at tunay na pagkasama-sama ng gayong patutunguhan",
            "verse 67:7": "At kung sila ay ihulog na rito, ay mapapakinggan nila ang (kalagim- lagim) na pagngangalit nito habang ito ay kumukulo at naglalagablab",
            "verse 67:8": "Na halos sumabog na sa pagkagalit. Sa tuwing may pangkat ng mga tao na inihahagis dito, ang kanyang Tagapagbantay ay nagtatanong: “Hindi baga dumatal sa inyo ang isang Tagapagbabala (at Tagapagpaala-ala)",
            "verse 67:9": "At sila ay magsasabi: “Katotohanan, ang Tagapagbabala ay dumatal sa amin datapuwa’t aming itinakwil siya at nagsabi: Si Allah ay hindi kailanman nagpahayag ng anuman sa amin at ikaw ay walang halaga at nahihibang (sa kamalian).”",
            "verse 67:10": "At sila ay muling magsasabi: “Kung nakinig lamang kami at gumamit ng aming pag-iisip, hindi sana kami magsisitahan sa Naglalagablab na Apoy!”",
            "verse 67:11": "Kaya’t aaminin nila ang kanilang mga kasalanan, datapuwa’t malayo sa kapatawaran (at habag) ang mga nagsisitahan sa Naglalagablab na Apoy",
            "verse 67:12": "Katotohanang sila na may pagkatakot sa kanilang Panginoon (sa kanilang puso, alalaong baga, hindi man nila nakikita Siya at ang Kanyang kaparusahan sa Kabilang Buhay, atbp.), sasakanila ang kapatawaran at malaking gantimpala (Paraiso)",
            "verse 67:13": "At kahit na ilihim mo pa ang iyong salita o ihayag man ito, katotohanang Siya ang may ganap na kaalaman sa nilalaman ng dibdib (ng mga tao)",
            "verse 67:14": "Hindi baga Niya talastas kung ano ang Kanyang nilikha? Siya ang nakakaalam ng anumang hibla ng kahiwagaan at may ganap na pang-unawa (sa lahat ng bagay)",
            "verse 67:15": "Siya (Allah) ang gumawa na ang kalupaan ay inyong maayos (alalaong baga, na maging madali sa inyo ang lumakad, makapamuhay, makapagtanim, atbp.), kaya’t inyong tahakin ang mga landas nito at inyong tamasahin ang mga biyaya na Kanyang ipinagkaloob, at sa Kanya ang Muling Pagkabuhay",
            "verse 67:16": "Hindi ka ba nakadarama ng kapanatagan na Siya na nasa Sangkalangitan ay hindi magpapahintulot na ikaw ay lagumin ng lupa kung ito ay mayanig sa paglindol",
            "verse 67:17": "o hindi ka ba nakadarama ng kapanatagan na Siya na nasa Sangkalangitan ay hindi magpaparating laban sa iyo ng nag-aalimpuyong bagyo? At inyong mapag-alaman kung gaano kasindak-sindak ang Aking babala",
            "verse 67:18": "Katotohanan, ang mga tao na nangauna sa kanila ay nagsipagtakwil (sa Aking babala, alalaong baga, sa mga Tagapagbalita ni Allah). Pagmasdan kung gaano kasakit-sakit ang Aking pagkapoot sa kanila",
            "verse 67:19": "Hindi baga nila napagmamasdan ang mga ibon sa kaitaasan na ibinubuka at itinitiklop ang kanilang pakpak? wala ng iba pang makakapagpanatili nito maliban kay Allah na Pinakamapagbigay. Katotohanang Siya ang Nakakamasid sa lahat ng bagay",
            "verse 67:20": "At sino baga kaya ang makakatulong sa inyo kahit na nga yaon ay isang sandatahang pangkat, maliban kay Allah na Mapagkaloob? Ang mga hindi sumasampalataya ay walang pinanghahawakan maliban sa pag-aakala na walang saysay",
            "verse 67:21": "At sino baga kaya ang makakapagbigay sa inyo ng inyong pangangailangan kung ninais Niya na ipagkait sa inyo ang Kanyang biyaya? Tunay ngang namihasa sila sa kawalan ng kabanalan at sila ay tumatalilis (sa Katotohanan)",
            "verse 67:22": "Siya baga na lumalakad sa kahabaan (ng landas) na ang kaniyang mukha (paningin) ay nangangapa ay mainam na napapatnubayan? o siya kaya na (nakakakita) at lumalakad nang panatag sa Tuwid na Landas (alalaong baga sa paniniwala sa Kaisahan ni Allah)",
            "verse 67:23": "Ipagbadya: “Siya ang lumikha sa inyo (at sumubaybay sa inyong paglaki) at naggawadsainyonginyongpandinigatpaninginatpandama at pang-unawa. Kakarampot lamang ang pasasalamat na inyong isinusukli!”",
            "verse 67:24": "Ipagbadya : “Siya ang nagparami sa inyong bilang (at angkan) dito sa sangkalupaan at sa Kanya ay titipunin kayo ng sama-sama (sa Kabilang Buhay)",
            "verse 67:25": "Sila ay nagsisipag-usisa: “Kailan baga kaya magaganap ang pangakong yaon (alalaong baga, ang Araw ng Pagkabuhay)?, kung ikaw ay nagsasaysay ng katotohanan.”",
            "verse 67:26": "Ipagbadya (o Muhammad): “Ang kapamahalaan (ng takdang oras nito) ay tanging na kay Allah lamang. Ako ay isinugo lamang bilang isang Tagapagpaala-ala sa inyo.”",
            "verse 67:27": "(At sa kalaunan), kung kanilang mahinuha na sasapit na (ang kaparusahan ng Araw ng Muling Pagkabuhay), ang mukha ng mga hindi sumasampalataya ay mangapupuspos ng lumbay (kalungkutan at pighati), at sa kanila ay ipagtuturing : “Ito ang pangako na inyong hinihiling noon!”",
            "verse 67:28": "Ipagbadya (o Muhammad): “Napag-aakala ba ninyo na kung si Allah ay pupuksa sa akin at sa aking mga kasama, o kung Siya ay maggawad ng Kanyang Habag sa atin, sino baga kaya ang makakapagligtas sa mga hindi sumasampalataya sa kasakit-sakit na Kaparusahan?”",
            "verse 67:29": "Ipagbadya: “Siya ang diyos na Pinakamahabagin. Sa Kanya kami ay sumasampalataya at sa Kanya ay aming ipinapaubaya ang aming pagtitiwala. At hindi maglalaon ay inyong mapag-aalaman kung sino sa atin ang nasa lantad na kamalian.”",
            "verse 67:30": "Ipagbadya (o Muhammad): “Napag-aakala ba ninyo na kung ang lahat ng tubig ay masaid sa kalupaan, sino baga kaya ang makakapagbigay sa inyo ng tubig na malinaw na umaagos?”"
        },
        "French": {
            "verse 67:1": "Béni soit celui dans la main de qui est la royauté, et Il est Omnipotent.",
            "verse 67:2": "Celui qui a créé la mort et la vie afin de vous éprouver (et de savoir) qui de vous est le meilleur en œuvre, et c'est Lui le Puissant, le Pardonneur.",
            "verse 67:3": "Celui qui a créé sept cieux superposés sans que tu voies de disproportion en la création du Tout Miséricordieux. Ramène [sur elle] le regard. Y vois-tu une brèche quelconque?",
            "verse 67:4": "Puis, retourne ton regard à deux fois: le regard te reviendra humilié et frustré.",
            "verse 67:5": "Nous avons effectivement embelli le ciel le plus proche avec des lampes [des étoiles] dont Nous avons fait des projectiles pour lapider les diables et Nous leur avons préparé le châtiment de la Fournaise.",
            "verse 67:6": "Ceux qui ont mécru à leur Seigneur auront le châtiment de l'Enfer. Et quelle mauvaise destination!",
            "verse 67:7": "Quand ils y seront jetés, ils lui entendront un gémissement, tandis qu'il bouillonne.",
            "verse 67:8": "Peu s'en faut que, de rage, il n'éclate. Toutes les fois qu'un groupe y est jeté, ses gardiens leur demandent: «Quoi! ne vous est-il pas venu d'avertisseur?»",
            "verse 67:9": "Ils dirent: «Mais si! un avertisseur nous était venu certes, mais nous avons crié au mensonge et avons dit: Allah n'a rien fait descendre: vous n'êtes que dans un grand égarement».",
            "verse 67:10": "Et ils dirent: «Si nous avions écouté ou raisonné, nous ne serions pas parmi les gens de la Fournaise».",
            "verse 67:11": "Ils ont reconnu leur péché. Que les gens de la Fournaise soient anéantis à jamais.",
            "verse 67:12": "Ceux qui redoutent leur Seigneur bien qu'ils ne L'aient jamais vu auront un pardon et une grande récompense.",
            "verse 67:13": "Que vous cachiez votre parole ou la divulguiez Il connaît bien le contenu des poitrines.",
            "verse 67:14": "Ne connaît-Il pas ce qu'Il a créé alors que c'est Lui le Compatissant, le Parfaitement Connaisseur.",
            "verse 67:15": "C'est Lui qui vous a soumis la terre: parcourez donc ses grandes étendues. Mangez de ce qu'Il vous fournit. Vers Lui est la Résurrection.",
            "verse 67:16": "Etes-vous à l'abri que Celui qui est au ciel vous enfouisse en la terre? Et voici qu'elle tremble!",
            "verse 67:17": "Ou êtes-vous à l'abri que Celui qui est au ciel envoie contre vous un ouragan de pierres? Vous saurez ainsi quel fut Mon avertissement.",
            "verse 67:18": "En effet, ceux d'avant eux avaient crié au mensonge. Quelle fut alors Ma réprobation!",
            "verse 67:19": "N'ont-ils pas vu les oiseaux au-dessus d'eux, déployant et repliant leurs ailes tour à tour? Seul le Tout Miséricordieux les soutient. Car Il est sur toute chose, Clairvoyant.",
            "verse 67:20": "Quel est celui qui constituerait pour vous une armée [capable] de vous secourir, en dehors du Tout Miséricordieux? En vérité les mécréants sont dans l'illusion complète.",
            "verse 67:21": "Ou quel est celui qui vous donnera votre subsistance s'Il s'arrête de fournir Son attribution? Mais ils persistent dans leur insolence et dans leur répulsion.",
            "verse 67:22": "Qui est donc mieux guidé? Celui qui marche face contre terre ou celui qui marche redressé sur un chemin droit.",
            "verse 67:23": "Dis: «C'est Lui qui vous a créés et vous a donné l'ouïe, les yeux et les cœurs». Mais vous êtes rarement reconnaissants!",
            "verse 67:24": "Dis: «C'est Lui qui vous a répandus sur la terre, et c'est vers Lui que vous serez rassemblés».",
            "verse 67:25": "Et ils disent: «A quand cette promesse si vous êtes véridiques?»",
            "verse 67:26": "Dis: «Allah seul [en] a la connaissance. Et moi je ne suis qu'un avertisseur clair».",
            "verse 67:27": "Puis, quand ils verront (le châtiment) de près, les visages de ceux qui ont mécru seront affligés. Et il leur sera dit: «Voilà ce que vous réclamiez».",
            "verse 67:28": "Dis: «Que vous en semble? Qu'Allah me fasse périr ainsi que ceux qui sont avec moi ou qu'Il nous fasse miséricorde, qui protégera alors les mécréants d'un châtiment douloureux?»",
            "verse 67:29": "Dis: «C'est Lui, le Tout Miséricordieux. Nous croyons en Lui et c'est en Lui que nous plaçons notre confiance. Vous saurez bientôt qui est dans un égarement évident».",
            "verse 67:30": "Dis: «Que vous en semble? Si votre eau était absorbée au plus profond de la terre, qui donc vous apporterait de l'eau de source?»"
        },
        "Fulah": {
            "verse 67:1": "Mo laamu woni e juuɗe Mun On mawnii, ko Kanko woni hattanɗo kala huunde",
            "verse 67:2": "On tagirɗo maayde e nguurndam, fii ndaarndagol on ko hommbo e mo’on ɓuri moƴƴude golle. Ko Kanko woni Fooluɗo, Haforoowo On",
            "verse 67:3": "On taguɗo kammuuli jeeɗiɗi fawondirɗi. A yi`ataa ɓura-ɓurda e tagu Jom hinaraŋke On. Yiltu ndaarɗe maa ɗen (daaraa). Taw si a yi`ay ceekol",
            "verse 67:4": "Refti ruttaa ndaarɗe ɗen laaɓi ɗiɗi, gite maa ɗen ruttoto e maaɗa hara ko ɗe hoyɗe, taƴiiɗe",
            "verse 67:5": "Gomɗii Men cuɗinirii kammu aduna ngun [koode] pitilli, Men waɗi ɗe fiɗirɗe seytanuuji, Men hebilani ɓe lette Huɓɓunge negn",
            "verse 67:6": "Hino woodani ɓen yedduɓe Joomi mun, lette Jahannama. Nge bonii ruttorde",
            "verse 67:7": "Si ɓe weddaama e nder magge, ɓe naniray nge haacaango, hara hinge fata",
            "verse 67:8": "Hinge eɓɓa fultagol, sabu tikkere nden. Tuma kala nde dental bugaa e magge, ayninaaɓe nge ɓen lamndoo ɓe : \"E hara jertinoowo araano e mo’on",
            "verse 67:9": "Ɓe wi`a: \"Pellet ! Jertinoowo aruno e amen tigi, kono men fenni men wi`i: Allah jippinaali hay e huunde, on wonaali si wanaa e nder majjere mawnde",
            "verse 67:10": "Ɓe wi`ita : \"Si meɗen nanaynoo maa hara meɗen haqqilaynoo, men jeyetanooke e yimɓe Huɓɓunge ngen",
            "verse 67:11": "Ɓe qirritii junuubi maɓɓe ɗin. Halakuyee woodanii jom en Huɓɓaynge ngen",
            "verse 67:12": "Pellet, hulooɓe Joomi mun ɓen ka wirnii, hino woodani ɓen haforaneede e njoɓdi mawndi",
            "verse 67:13": "Suuɗee konnguɗi mon maa ɓanninon ɗum. Kanko On ko O annduɗo ko woni e nder ɓerɗe",
            "verse 67:14": "E hara taguɗo On anndaa? Ko Kanko le woni Newiiɗo, Humpitiiɗo On",
            "verse 67:15": "Ko Kanko waɗani on leydi ndin eltaandi : haray yehee e seraaji mayri, ñaamon e arsike Makko. Ko ka Makko woni ummital ngal",
            "verse 67:16": "E on hooli On wonɗo ka kammu nde O munnataa e mo’on leydi ndin, Tawa yoo hindi dilla? @Corrected",
            "verse 67:17": "Kaa on hooli On wonɗo ka kammu nde O wurtataa e mon henndu bippooru? Aray nde anndon ko honno woni jertinaango Am ngon",
            "verse 67:18": "Sellii adinooɓe ɓen ɗon ɓen fenniino. Taskii ko honno lette Am ɗen wattinirnoo",
            "verse 67:19": "E ɓee yi`aali colli ɗin dow maɓɓe, hiɗi fonta gabitannji ɗi ñobba? [Wonnde] jogitaaki ɗin si wanaa Jom hinaraŋke On. Pellet, ko O reenuɗo kala huunde",
            "verse 67:20": "E ko hommbo woni on konuujo mum wallata on hara wanaa Jom hinaraŋke On? Tigi on, heeferɓe ɓen wonaali si wanaa e nder hodo",
            "verse 67:21": "E ko hommbo woni arsikoowo on, si O jogitike arsike Makko on? Si ko woni, ɓe duumike e ƴaggere e woɗɗitagol",
            "verse 67:22": "Kere ko on yahoowo no hippi yeeso mun ɓuri feewude? Kaa ko on yahoowo no fotondiri e laawol focciingol",
            "verse 67:23": "Maaku: \"Ko Kanko woni ko fuɗɗi on, O waɗani on nanɗe e giiɗe e ɓerɗe\". Kono fanɗii ko yettoton [neema]",
            "verse 67:24": "Maaku: \"Ko Kanko woni saakituɗo on leydi, ko ka Makko kadi woni ko mooɓitoyteɗon",
            "verse 67:25": "Hiɓe wi`a: \"Ko honnde tuma woni ndee fodoore, si tawii ko on goonguɓe",
            "verse 67:26": "Maaku : \"Anndee anndugol [fii Darnagl] ko ka Allah woni. Min on ko Mi jertinoowo [tun] ɓanngina",
            "verse 67:27": "Nde ɓe yi’oyta (lette) ɗen ka ɓadii, geece yedduɓe ɓen suni geece heeferɓe, [ɓe] wi`anee : \"Ko ɗum ɗoo woni ko ɗaɓɓaynoɗon",
            "verse 67:28": "Maaku : \"Yeetee lam, si Allah ƴettitii lam min e wonndiiɓe am maa O yurmaama men, ko hommbo daɗndata heeferɓe ɓen lette muusuɗe",
            "verse 67:29": "Maaku : \"Ko Kanko Jom hinaraŋke On. Men gomɗinii Mo, ko e Makko kadi men fawii. Aray nde anndon ko hommbo woni e majjere ɓanngunde",
            "verse 67:30": "Maaku : \"Yeetee lam, si ndiyam mon ɗam wattinii ɓeeɓuɗam, ko hommbo addanta on ndiyam ilayɗam"
        },
        "German": {
            "verse 67:1": "Segensreich ist Derjenige, in Dessen Hand die Herrschaft ist, und Er hat zu allem die Macht.",
            "verse 67:2": "(Er,) Der den Tod und das Leben erschaffen hat, damit Er euch prüfe, wer von euch die besten Taten begeht. Und Er ist der Allmächtige und Allvergebende.",
            "verse 67:3": "(Er,) Der sieben Himmel in Schichten (übereinander) erschaffen hat. Du kannst in der Schöpfung des Allerbarmers keine Ungesetzmäßigkeit sehen. Wende den Blick zurück: Siehst du irgendwelche Risse?",
            "verse 67:4": "Hierauf wende den Blick wiederholt zurück. Der Blick wird zu dir erfolglos und ermüdet zurückkehren.",
            "verse 67:5": "Wir haben ja den untersten Himmel mit Lampen geschmückt und haben sie zu Wurfgeschossen gegen die Satane gemacht. Und bereitet haben Wir für sie die Strafe der Feuerglut.",
            "verse 67:6": "Und für diejenigen, die ihren Herrn verleugnen, wird es die Strafe der Hölle geben - ein schlimmer Ausgang!",
            "verse 67:7": "Wenn sie hineingeworfen werden, hören sie von ihr stoßweises Aufheulen, während sie brodelt.",
            "verse 67:8": "Beinahe würde sie vor Grimm bersten. Jedesmal, wenn eine Schar hineingeworfen wird, werden ihre Wärter sie fragen: \"Ist zu euch denn kein Warner gekommen?\"",
            "verse 67:9": "Sie werden sagen: \"Ja doch, zu uns kam bereits ein Warner; aber wir haben (ihn) der Lüge bezichtigt und gesagt: , Allah hat nichts offenbart; ihr befindet euch nur in großem Irrtum'.\"",
            "verse 67:10": "Und sie werden sagen: \"Hätten wir nur gehört und begriffen, wären wir (nun) nicht unter den Insassen der Feuerglut.\"",
            "verse 67:11": "So werden sie ihre Sünde bekennen. Weit weg darum mit den Insassen der Feuerglut!",
            "verse 67:12": "Gewiß, diejenigen, die ihren Herrn im Verborgenen fürchten, für sie wird es Vergebung und großen Lohn geben.",
            "verse 67:13": "Haltet eure Worte geheim oder äußert sie laut vernehmbar, gewiß, Er weiß über das Innerste der Brüste Bescheid.",
            "verse 67:14": "Sollte denn Derjenige, Der erschaffen hat, nicht Bescheid wissen'? Und Er ist der Feinfühlige und Allkundige.",
            "verse 67:15": "Er ist es, Der euch die Erde fügsam gemacht hat. So geht auf ihrem Rücken einher und eßt von dem, womit Er (euch) versorgt. Und zu Ihm wird die Auferstehung sein.",
            "verse 67:16": "Glaubt ihr in Sicherheit davor zu sein, daß Wer im Himmel ist, die Erde mit euch versinken läßt, so daß sie sich dann hin und her bewegt?",
            "verse 67:17": "Oder glaubt ihr euch in Sicherheit davor, daß Wer im Himmel ist, gegen euch einen Sturm von Steinchen sendet? Dann werdet ihr (noch) erfahren, wie Meine Warnung ist.",
            "verse 67:18": "Auch diejenigen, die vor ihnen waren, haben bereits (die Gesandten) der Lüge bezichtigt. Wie war da Meine Mißbilligung!",
            "verse 67:19": "Sehen sie denn nicht auf die Vögel über ihnen, wie sie ihre Flügel ausgebreitet halten und einziehen? Nur der Allerbarmer hält sie. Gewiß, Er sieht alles wohl.",
            "verse 67:20": "Oder wer ist denn dieser, der euch eine Heerschar wäre, die euch helfen (sollte) außer dem Allerbarmer? Die Ungläubigen befinden sich nur im Trug.",
            "verse 67:21": "Oder wer ist denn dieser, der euch versorgen (sollte), wenn Er Seine Versorgung zurückhält? Aber nein! Sie fahren weiter in Auflehnung und Abneigung.",
            "verse 67:22": "Ist denn jemand, der, auf sein Gesicht gestürzt, einhergeht, eher rechtgeleitet, oder jemand, der aufrecht auf einem geraden Weg einhergeht?",
            "verse 67:23": "Sag: Er ist es, Der euch hat entstehen lassen und euch Gehör, Augenlicht und Herzen gemacht hat. Wie wenig ihr dankbar seid!",
            "verse 67:24": "Sag: Er ist es, Der euch auf der Erde (an Zahl) hat anwachsen lassen, und zu Ihm werdet ihr versammelt werden.",
            "verse 67:25": "Und sie sagen: \"Wann wird dieses Versprechen eintreten, wenn ihr wahrhaftig seid?\"",
            "verse 67:26": "Sag: Nur Allah weiß (darüber) Bescheid. Und ich bin nur ein deutlicher Warner.",
            "verse 67:27": "Wenn sie es aber nahe (bei sich) sehen, dann werden die Gesichter derjenigen, die ungläubig sind, böse betroffen sein. Und es wird gesagt werden: \"Das ist das, was ihr stets herbeizurufen wünschtet.\"",
            "verse 67:28": "Sag: Was meint ihr, wenn Allah mich und wer mit mir ist, vernichten oder wenn Er Sich unser erbarmen sollte, wer wird dann den Ungläubigen Schutz vor schmerzhafter Strafe gewähren?",
            "verse 67:29": "Sag: Er ist der Allerbarmer. Wir glauben an Ihn, und auf Ihn verlassen wir uns. Ihr werdet (noch) erfahren, wer sich in deutlichem Irrtum befindet.",
            "verse 67:30": "Sag: Was meint ihr, wenn euer Wasser versickert sein sollte, wer sollte euch dann hervorquellendes Wasser bringen?"
        },
        "Hausa": {
            "verse 67:1": "(Allah), Wanda gudãnar da mulki yake ga hannunSa, Ya tsarkaka, kuma Shi Mai ĩko ne a kan kome.",
            "verse 67:2": "Shi ne Wanda Ya halitta mutuwa da rãyuwa domin Ya jarraba ku, Ya nũna wãye daga cikinku ya fi kyãwon aiki, Shi ne Mabuwãyi, Mai gafara.",
            "verse 67:3": "Shi ne wanda Ya halitta sammai bakawi, ɗabaƙõƙi a kan jũna, bã za ka ga goggociya ba a cikin halittar (Allah) Mai rahama. Ka sãke dũbawa, ko za ka ga wata ɓaraka?",
            "verse 67:4": "Sa'an nan ka sake maimaita, dũbãwa, ganinka zai komo maka, gajiyayye, ba da ganin wata naƙasa bã.",
            "verse 67:5": "Kuma lalle Mun ƙawãta samar farko da fitillu, kuma Muka sanya su abin jifa ga shaiɗanu, kuma Muka yi musu tattalin azãbar Sa'ĩr.",
            "verse 67:6": "Kuma waɗanda suka kafirce wa Ubangjinsu na da azãbar Jahannama, tã munana ga zamanta makõmarsu.",
            "verse 67:7": "Idan an jẽfa su a cikinta, sai su ji daga gare ta wata ƙãra, tana tafasa.",
            "verse 67:8": "Tana kusa ta tsãge domin hushi, ko da yaushe aka jẽfa wani ɓangaren jama'a a cikinta, matsaranta na tambayar su da cewa, \"Wani mai gargaɗi bai je muku ba?\"",
            "verse 67:9": "Sai su ce: \"I, lalle wani mai gargaɗi ya je mana, sai muka ƙaryata shi, muka ce, 'Allah bai saukar da kome ba, bã ku cikin kõme sai ɓata babba.'\"",
            "verse 67:10": "Kuma suka ce: \"Dã mun zamo muna saurãre, kõ muna da hankali, dã ba mu kasance a cikin 'yan sa'ĩr ba.\"",
            "verse 67:11": "Wato su yi iƙrãri da laifinsu. Allah Ya la'ani'yan sa'ĩr!",
            "verse 67:12": "Lalle waɗanda ke tsõron Ubangjinsu, a ɓoye, suna da wata gãfara da wani sakamako mai girma.",
            "verse 67:13": "Kuma ku asirta maganarku ko ku bayyana ta, lalle shi, (Allah), Masani ne ga abin da ke cikin ƙirãza.",
            "verse 67:14": "Ashe, wanda Ya yi halitta bã zai iya saninta ba, alhãli kuwa shi Mai tausasãwa ne, kuma Mai labartawa?",
            "verse 67:15": "Shi, (Allah), Yã sanya muku ƙasa hõrarriya, sai ku tafi cikin sãsanninta, kuma ku ci daga arzikinSa, kuma zuwa gare shi ne tãshin yake.",
            "verse 67:16": "Shin kõ kun amince cewa wanda ke cikin sama, bã zai iya shãfe ƙasa tãre da ku ba, sai ga ta tana mai girgiza?",
            "verse 67:17": "Kõ kun amincẽ cewa wanda ke cikin sama bã zai iya sako muku iskar gũguwa ba? To, zã ku san yadda (ãƙibar) gargaɗiNa take.",
            "verse 67:18": "Lalle, waɗanda ke gabansu sun ƙaryata (manzanni). To, yãya (ãƙibar) gargaɗiNa ta kasance?",
            "verse 67:19": "Bã zã su yi dũbi ba zuwa ga tsuntsãye a kansu, mãsu sanwã, kuma suna fiffikãwa, bãbu mai riƙe da su sai (Allah), Mairahama? Lalle shi Mai gani ne ga dukan kõme.",
            "verse 67:20": "Wãne ne wanda zai zame muku mayãƙin da zai taimake ku, wanda bã (Allah) ba, Mai rahama? Kãfirai ba su a cikin kõme fãce rũɗu.",
            "verse 67:21": "Wãne ne wanda zai ciyar da ku, idan (Allah) Ya riƙe arzikinSa? A'aha, sun yi zurfi cikin girman kai da tãshin hankali.",
            "verse 67:22": "Shin, wanda ke tafiya a kife a kan fuskarsa yã fi zama a kan shiryuwa, ko kuwa wanda ke tafiya miƙe a kan hanya madaidaiciya?",
            "verse 67:23": "Ka ce: \"(Allah) Shine Wanda Ya ƙaga halittarku, Ya sanya muku ji da gani da tunãni, amman kaɗan ce ƙwarai godiyarku!\"",
            "verse 67:24": "Kuma kace \"Shi ne Ya halitta ku daga ƙasã, kuma zuwa gareShi ne ake tãshin ku.\"",
            "verse 67:25": "Kuma sunã cewa, \"Yaushe ne wannan alkawarin zai tabbata in dai kun kasance mãsu gaskiya ne kũ?\"",
            "verse 67:26": "Ka ce: \"Ilmin a wurin Allah kawai yake, kuma ni mai gargaɗi kawai ne, mai bayyana (gargaɗin).\"",
            "verse 67:27": "To, lokacin da suka gan ta (azãbar) a kusa, fuskokin waɗanda suka kãfirta suka mũnana, kuma aka ce (musu) wannan shi ne abin da kuka zamo kuna ƙaryatãwa.",
            "verse 67:28": "Ka ce musu \"Idan Allah Ya halaka ni nĩ da wanda ke tãre da ni, ko kuma, Yã yi mana rahama, to, wãne ne zai tserar da kafirai daga wata azãba mai raɗaɗi?\"",
            "verse 67:29": "Ka ce: \"Shĩ ne Mai rahama mun yi ĩmãni da Shi, gare Shi muka dogara, saboda haka zã ku san wanda yake a cikin ɓata bayyananniya.\"",
            "verse 67:30": "Ka ce: \"Ko kun gani, idan ruwanku ya wãyi gari faƙaƙƙe, to, wãne ne zai zo muku da ruwa wani mai ɓuɓɓuga?\""
        },
        "Hindi": {
            "verse 67:1": "जिस (ख़ुदा) के कब्ज़े में (सारे जहाँन की) बादशाहत है वह बड़ी बरकत वाला है और वह हर चीज़ पर कादिर है",
            "verse 67:2": "जिसने मौत और ज़िन्दगी को पैदा किया ताकि तुम्हें आज़माए कि तुममें से काम में सबसे अच्छा कौन है और वह ग़ालिब (और) बड़ा बख्शने वाला है",
            "verse 67:3": "जिसने सात आसमान तले ऊपर बना डाले भला तुझे ख़ुदा की आफ़रिनश में कोई कसर नज़र आती है तो फिर ऑंख उठाकर देख भला तुझे कोई शिग़ाफ़ नज़र आता है",
            "verse 67:4": "फिर दुबारा ऑंख उठा कर देखो तो (हर बार तेरी) नज़र नाकाम और थक कर तेरी तरफ पलट आएगी",
            "verse 67:5": "और हमने नीचे वाले (पहले) आसमान को (तारों के) चिराग़ों से ज़ीनत दी है और हमने उनको शैतानों के मारने का आला बनाया और हमने उनके लिए दहकती हुई आग का अज़ाब तैयार कर रखा है",
            "verse 67:6": "और जो लोग अपने परवरदिगार के मुनकिर हैं उनके लिए जहन्नुम का अज़ाब है और वह (बहुत) बुरा ठिकाना है",
            "verse 67:7": "जब ये लोग इसमें डाले जाएँगे तो उसकी बड़ी चीख़ सुनेंगे और वह जोश मार रही होगी",
            "verse 67:8": "बल्कि गोया मारे जोश के फट पड़ेगी जब उसमें (उनका) कोई गिरोह डाला जाएगा तो उनसे दारोग़ए जहन्नुम पूछेगा क्या तुम्हारे पास कोई डराने वाला पैग़म्बर नहीं आया था",
            "verse 67:9": "वह कहेंगे हॉ हमारे पास डराने वाला तो ज़रूर आया था मगर हमने उसको झुठला दिया और कहा कि ख़ुदा ने तो कुछ नाज़िल ही नहीं किया तुम तो बड़ी (गहरी) गुमराही में (पड़े) हो",
            "verse 67:10": "और (ये भी) कहेंगे कि अगर (उनकी बात) सुनते या समझते तब तो (आज) दोज़ख़ियों में न होते",
            "verse 67:11": "ग़रज़ वह अपने गुनाह का इक़रार कर लेंगे तो दोज़ख़ियों को ख़ुदा की रहमत से दूरी है",
            "verse 67:12": "बेशक जो लोग अपने परवरदिगार से बेदेखे भाले डरते हैं उनके लिए मग़फेरत और बड़ा भारी अज्र है",
            "verse 67:13": "और तुम अपनी बात छिपकर कहो या खुल्लम खुल्ला वह तो दिल के भेदों तक से ख़ूब वाक़िफ़ है",
            "verse 67:14": "भला जिसने पैदा किया वह तो बेख़बर और वह तो बड़ा बारीकबीन वाक़िफ़कार है",
            "verse 67:15": "वही तो है जिसने ज़मीन को तुम्हारे लिए नरम (व हमवार) कर दिया तो उसके अतराफ़ व जवानिब में चलो फिरो और उसकी (दी हुई) रोज़ी खाओ",
            "verse 67:16": "और फिर उसी की तरफ क़ब्र से उठ कर जाना है क्या तुम उस शख़्श से जो आसमान में (हुकूमत करता है) इस बात से बेख़ौफ़ हो कि तुमको ज़मीन में धॅसा दे फिर वह एकबारगी उलट पुलट करने लगे",
            "verse 67:17": "या तुम इस बात से बेख़ौफ हो कि जो आसमान में (सल्तनत करता) है कि तुम पर पत्थर भरी ऑंधी चलाए तो तुम्हें अनक़रीेब ही मालूम हो जाएगा कि मेरा डराना कैसा है",
            "verse 67:18": "और जो लोग उनसे पहले थे उन्होने झुठलाया था तो (देखो) कि मेरी नाख़ुशी कैसी थी",
            "verse 67:19": "क्या उन लोगों ने अपने सरों पर चिड़ियों को उड़ते नहीं देखा जो परों को फैलाए रहती हैं और समेट लेती हैं कि ख़ुदा के सिवा उन्हें कोई रोके नहीं रह सकता बेशक वह हर चीज़ को देख रहा है",
            "verse 67:20": "भला ख़ुदा के सिवा ऐसा कौन है जो तुम्हारी फ़ौज बनकर तुम्हारी मदद करे काफ़िर लोग तो धोखे ही (धोखे) में हैं भला ख़ुदा अगर अपनी (दी हुई) रोज़ी रोक ले तो कौन ऐसा है जो तुम्हें रिज़क़ दे",
            "verse 67:21": "मगर ये कुफ्फ़ार तो सरकशी और नफ़रत (के भँवर) में फँसे हुए हैं भला जो शख़्श औंधे मुँह के बाल चले वह ज्यादा हिदायत याफ्ता होगा",
            "verse 67:22": "या वह शख़्श जो सीधा बराबर राहे रास्त पर चल रहा हो (ऐ रसूल) तुम कह दो कि ख़ुदा तो वही है जिसने तुमको नित नया पैदा किया",
            "verse 67:23": "और तुम्हारे वास्ते कान और ऑंख और दिल बनाए (मगर) तुम तो बहुत कम शुक्र अदा करते हो",
            "verse 67:24": "कह दो कि वही तो है जिसने तुमको ज़मीन में फैला दिया और उसी के सामने जमा किए जाओगे",
            "verse 67:25": "और कुफ्फ़ार कहते हैं कि अगर तुम सच्चे हो तो (आख़िर) ये वायदा कब (पूरा) होगा",
            "verse 67:26": "(ऐ रसूल) तुम कह दो कि (इसका) इल्म तो बस ख़ुदा ही को है और मैं तो सिर्फ साफ़ साफ़ (अज़ाब से) डराने वाला हूँ",
            "verse 67:27": "तो जब ये लोग उसे करीब से देख लेंगे (ख़ौफ के मारे) काफिरों के चेहरे बिगड़ जाएँगे और उनसे कहा जाएगा ये वही है जिसके तुम ख़वास्तग़ार थे",
            "verse 67:28": "(ऐ रसूल) तुम कह दो भला देखो तो कि अगर ख़ुदा मुझको और मेरे साथियों को हलाक कर दे या हम पर रहम फरमाए तो काफ़िरों को दर्दनाक अज़ाब से कौन पनाह देगा",
            "verse 67:29": "तुम कह दो कि वही (ख़ुदा) बड़ा रहम करने वाला है जिस पर हम ईमान लाए हैं और हमने तो उसी पर भरोसा कर लिया है तो अनक़रीब ही तुम्हें मालूम हो जाएगा कि कौन सरीही गुमराही में (पड़ा) है",
            "verse 67:30": "ऐ रसूल तुम कह दो कि भला देखो तो कि अगर तुम्हारा पानी ज़मीन के अन्दर चला जाए कौन ऐसा है जो तुम्हारे लिए पानी का चश्मा बहा लाए"
        },
        "Indonesian": {
            "verse 67:1": "Maha Suci Allah Yang di tangan-Nya-lah segala kerajaan, dan Dia Maha Kuasa atas segala sesuatu,",
            "verse 67:2": "Yang menjadikan mati dan hidup, supaya Dia menguji kamu, siapa di antara kamu yang lebih baik amalnya. Dan Dia Maha Perkasa lagi Maha Pengampun,",
            "verse 67:3": "Yang telah menciptakan tujuh langit berlapis-lapis. Kamu sekali-kali tidak melihat pada ciptaan Tuhan Yang Maha Pemurah sesuatu yang tidak seimbang. Maka lihatlah berulang-ulang, adakah kamu lihat sesuatu yang tidak seimbang?",
            "verse 67:4": "Kemudian pandanglah sekali lagi niscaya penglihatanmu akan kembali kepadamu dengan tidak menemukan sesuatu cacat dan penglihatanmu itupun dalam keadaan payah.",
            "verse 67:5": "Sesungguhnya Kami telah menghiasi langit yang dekat dengan bintang-bintang, dan Kami jadikan bintang-bintang itu alat-alat pelempar syaitan, dan Kami sediakan bagi mereka siksa neraka yang menyala-nyala.",
            "verse 67:6": "Dan orang-orang yang kafir kepada Tuhannya, memperoleh azab Jahannam. Dan itulah seburuk-buruk tempat kembali.",
            "verse 67:7": "Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, sedang neraka itu menggelegak,",
            "verse 67:8": "hampir-hampir (neraka) itu terpecah-pecah lantaran marah. Setiap kali dilemparkan ke dalamnya sekumpulan (orang-orang kafir), penjaga-penjaga (neraka itu) bertanya kepada mereka: \"Apakah belum pernah datang kepada kamu (di dunia) seorang pemberi peringatan?\"",
            "verse 67:9": "Mereka menjawab: \"Benar ada\", sesungguhnya telah datang kepada kami seorang pemberi peringatan, maka kami mendustakan(nya) dan kami katakan: \"Allah tidak menurunkan sesuatupun; kamu tidak lain hanyalah di dalam kesesatan yang besar\".",
            "verse 67:10": "Dan mereka berkata: \"Sekiranya kami mendengarkan atau memikirkan (peringatan itu) niscaya tidaklah kami termasuk penghuni-penghuni neraka yang menyala-nyala\".",
            "verse 67:11": "Mereka mengakui dosa mereka. Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala.",
            "verse 67:12": "Sesungguhnya orang-orang yang takut kepada Tuhannya Yang tidak nampak oleh mereka, mereka akan memperoleh ampunan dan pahala yang besar.",
            "verse 67:13": "Dan rahasiakanlah perkataanmu atau lahirkanlah; sesungguhnya Dia Maha Mengetahui segala isi hati.",
            "verse 67:14": "Apakah Allah Yang menciptakan itu tidak mengetahui (yang kamu lahirkan atau rahasiakan); dan Dia Maha Halus lagi Maha Mengetahui?",
            "verse 67:15": "Dialah Yang menjadikan bumi itu mudah bagi kamu, maka berjalanlah di segala penjurunya dan makanlah sebahagian dari rezeki-Nya. Dan hanya kepada-Nya-lah kamu (kembali setelah) dibangkitkan.",
            "verse 67:16": "Apakah kamu merasa aman terhadap Allah yang (berkuasa) di langit bahwa Dia akan menjungkir balikkan bumi bersama kamu, sehingga dengan tiba-tiba bumi itu bergoncang?,",
            "verse 67:17": "atau apakah kamu merasa aman terhadap Allah yang (berkuasa) di langit bahwa Dia akan mengirimkan badai yang berbatu. Maka kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-Ku?",
            "verse 67:18": "Dan sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasul-Nya). Maka alangkah hebatnya kemurkaan-Ku.",
            "verse 67:19": "Dan apakah mereka tidak memperhatikan burung-burung yang mengembangkan dan mengatupkan sayapnya di atas mereka? Tidak ada yang menahannya (di udara) selain Yang Maha Pemurah. Sesungguhnya Dia Maha Melihat segala sesuatu.",
            "verse 67:20": "Atau siapakah dia yang menjadi tentara bagimu yang akan menolongmu selain daripada Allah Yang Maha Pemurah? Orang-orang kafir itu tidak lain hanyalah dalam (keadaan) tertipu.",
            "verse 67:21": "Atau siapakah dia yang memberi kamu rezeki jika Allah menahan rezeki-Nya? Sebenarnya mereka terus menerus dalam kesombongan dan menjauhkan diri?",
            "verse 67:22": "Maka apakah orang yang berjalan terjungkal di atas mukanya itu lebih banyak mendapatkan petunjuk ataukah orang yang berjalan tegap di atas jalan yang lurus?",
            "verse 67:23": "Katakanlah: \"Dialah Yang menciptakan kamu dan menjadikan bagi kamu pendengaran, penglihatan dan hati\". (Tetapi) amat sedikit kamu bersyukur.",
            "verse 67:24": "Katakanlah: \"Dialah Yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya-lah kamu kelak dikumpulkan\".",
            "verse 67:25": "Dan mereka berkata: \"Kapankah datangnya ancaman itu jika kamu adalah orang-orang yang benar?\"",
            "verse 67:26": "Katakanlah: \"Sesungguhnya ilmu (tentang hari kiamat itu) hanya pada sisi Allah. Dan sesungguhnya aku hanyalah seorang pemberi peringatan yang menjelaskan\".",
            "verse 67:27": "Ketika mereka melihat azab (pada hari kiamat) sudah dekat, muka orang-orang kafir itu menjadi muram. Dan dikatakan (kepada mereka) inilah (azab) yang dahulunya kamu selalu meminta-mintanya.",
            "verse 67:28": "Katakanlah: \"Terangkanlah kepadaku jika Allah mematikan aku dan orang-orang yang bersama dengan aku atau memberi rahmat kepada kami, (maka kami akan masuk surga), tetapi siapakah yang dapat melindungi orang-orang yang kafir dari siksa yang pedih?\"",
            "verse 67:29": "Katakanlah: \"Dialah Allah Yang Maha Penyayang kami beriman kepada-Nya dan kepada-Nya-lah kami bertawakkal. Kelak kamu akan mengetahui siapakah yang berada dalam kesesatan yang nyata\".",
            "verse 67:30": "Katakanlah: \"Terangkanlah kepadaku jika sumber air kamu menjadi kering; maka siapakah yang akan mendatangkan air yang mengalir bagimu?\"."
        },
        "Italian": {
            "verse 67:1": "Benedetto Colui nella Cui mano è la sovranità, Egli è onnipotente;",
            "verse 67:2": "Colui Che ha creato la morte e la vita per mettere alla prova chi di voi meglio opera, Egli è l'Eccelso, il Perdonatore;",
            "verse 67:3": "Colui Che ha creato sette cieli sovrapposti senza che tu veda alcun difetto nella creazione del Compassionevole. Osserva, vedi una qualche fenditura?",
            "verse 67:4": "Osserva ancora due volte: il tuo sguardo ricadrà, stanco e sfinito.",
            "verse 67:5": "Invero abbellimmo di luminarie il cielo più vicino, e ne abbiamo fatto strumenti per lapidare i dèmoni, per i quali abbiamo preparato la Fiamma.",
            "verse 67:6": "Per coloro che non credono nel loro Signore, c'è il castigo dell'Inferno: qual tristo divenire!",
            "verse 67:7": "Quando vi sono precipitati, ne sentono il fragore mentre ribolle:",
            "verse 67:8": "manca poco a che scoppi di rabbia. Ogni volta che un gruppo vi è precipitato, i suoi guardiani chiedono: “Non vi è forse giunto un ammonitore?”.",
            "verse 67:9": "Risponderanno: “Sì, ci era giunto un ammonitore, ma noi lo tacciammo di menzogna e dicemmo: Allah non ha fatto scendere alcunché, voi siete in evidente errore!\"”.",
            "verse 67:10": "E diranno: “Se avessimo ascoltato o compreso, non saremmo tra i compagni della Fiamma”.",
            "verse 67:11": "Riconoscono il loro peccato. Che siano ridotti in polvere i compagni della Fiamma!",
            "verse 67:12": "Coloro che invece temono il loro Signore in ciò che è invisibile, avranno perdono e ricompensa grande.",
            "verse 67:13": "Sia che nascondiate i vostri intenti o li palesiate, Egli ben conosce quello che contengono i petti.",
            "verse 67:14": "Non conoscerebbe ciò che Egli stesso ha creato, quando Egli è il Sottile, il Ben informato?",
            "verse 67:15": "Egli è Colui Che vi ha fatto remissiva la terra: percorretela in lungo e in largo, e mangiate della Sua provvidenza. Verso di Lui è la Resurrezione.",
            "verse 67:16": "Siete forse sicuri che Colui Che sta nel cielo non vi faccia inghiottire dalla terra quando trema?",
            "verse 67:17": "O siete sicuri che Colui Che sta nel cielo non scateni contro di voi un uragano? Conoscerete allora il Mio avvertimento.",
            "verse 67:18": "Invero coloro che li precedettero già tacciarono di menzogna. Quale fu la mia riprovazione!",
            "verse 67:19": "Non hanno visto, sopra di loro, gli uccelli spiegare e ripiegare le ali? Non li sostiene altri che il Compassionevole. In verità Egli osserva ogni cosa.",
            "verse 67:20": "Chi potrebbe costituire un esercito per voi, e [chi potrebbe] soccorrervi all'infuori del Compassionevole? I miscredenti sono in preda all'inganno.",
            "verse 67:21": "Chi provvederà a voi, se Egli tratterrà la Sua provvidenza? No, essi persistono nell'insolenza e nel rifiuto.",
            "verse 67:22": "Colui che cammina con il volto rivolto al suolo è forse meglio guidato di colui che si erge camminando sulla retta via ?",
            "verse 67:23": "Di': “Egli è Colui Che vi ha creati e vi ha dato l'udito, gli occhi e i cuori”. Quanto poco Gli siete riconoscenti!",
            "verse 67:24": "Di': “Egli è Colui Che vi ha sparsi sulla terra e verso di Lui sarete riuniti”.",
            "verse 67:25": "Dicono: “A quando questa promessa? [Ditecelo,] se siete veridici”.",
            "verse 67:26": "Di': “La conoscenza [di ciò] appartiene ad Allah. Io non sono altro che un ammonitore esplicito”.",
            "verse 67:27": "Quando la vedranno da vicino, saranno stravolti i visi dei miscredenti e sarà detto loro: “Ecco ciò che vi ostinavate a chiedere!”.",
            "verse 67:28": "Di': “Cosa credete? Sia che Allah faccia perire me e quelli che sono con me sia che ci usi misericordia, chi potrà proteggere i miscredenti da un doloroso castigo?”.",
            "verse 67:29": "Di': “Egli è il Compassionevole! Crediamo in Lui e in Lui confidiamo. Presto saprete chi è in errore evidente”.",
            "verse 67:30": "Di': “Cosa credete? Se la vostra acqua rientrasse nelle profondità [della terra] chi vi procurerebbe acqua sorgiva?”."
        },
        "Japanese": {
            "verse 67:1": "大権を掌握なされる方に祝福あれ。本当にかれは凡てのことに全能であられる。",
            "verse 67:2": "（かれは）死と生を創られた方である。それは，あなたがたの中誰の行いが優れているのかを試みられるためで，かれは偉力ならびなく寛容であられる。",
            "verse 67:3": "（かれは）一層一層に，7天を創られる御方。慈悲あまねく御方の創造には，少しの不調和もないことを見るであろう。それで改めて観察しなさい。あなたは何か裂け目を見るのか。",
            "verse 67:4": "それで今一度，目を上げて見るがいい。あなたの視線は，（何の欠陥も捜し出せず）只ぼんやりしてもとに戻るだけである。",
            "verse 67:5": "かれは灯明（星）をもって，最下層の天を飾り，悪魔たちに対する磔（流星）となし，またかれらのために烈火の懲罰を準備した。",
            "verse 67:6": "かれらの主を信じない者には，地獄の懲罰がある。何と悪い帰り所であることよ。",
            "verse 67:7": "かれらがその中に投げ込まれる時，それ（地獄）が沸騰するかのように不気味で忌しい音でうなるのをかれらは聞こう。",
            "verse 67:8": "激しい怒りのために破裂するかのようである。一団がその中に投げ込まれる度に，そこの看守はかれらに，「あなたがたに，警告者はやって来なかったのか。」と問う。",
            "verse 67:9": "かれらは言う。「そうです，確かに一人の警告者がわたしたちの許にやって来ました。だがわたしたちは拒否して言った。『アッラーは何（の啓示）も下されない。あなたがたは，大変な過誤の中にいるだけである。』」",
            "verse 67:10": "かれらはなお言う。「わたしたちが聞き，熟考したならば，烈火の住人の中には入らなかったでしょうに。」",
            "verse 67:11": "かれらは自分の様々な罪を認めた。烈火の住人は，（容赦から）遠く離れている。",
            "verse 67:12": "本当に目に見えない主を，畏れる者には，容赦と偉大な報奨があろう。",
            "verse 67:13": "あなたがたが言葉を隠していても，またそれを表わしても，かれは本当に胸の中のものを知っておられる。",
            "verse 67:14": "かれが創造されたものを，知らないであろうか。かれは，深奥を理解し通暁なされる。",
            "verse 67:15": "かれこそは，大地をあなたがたに使い易くなされた方である。それでその諸地域を往来し，かれの糧を食べるがよい。そして復活の時にはかれに召されていく身である。",
            "verse 67:16": "大地が揺れ動く時，天にいます方が，あなたがたをそれに呑み込ませられないであろうと，安心しているのか。",
            "verse 67:17": "またあなたがたは天にいます方が，（砂石の）烈風をあなたがたに送られないであろうと，安心しているのか。やがてあなたがたは，わが警告が如何なるものかを知ろであろう。",
            "verse 67:18": "本当にあなたがた以前の者たちも，（わが警告を）嘘であるとした。それであが不興が如何に（恐ろしいもので）あったか。",
            "verse 67:19": "かれらは上を飛ぶ鳥に就いて考えないのか。翼を広げ，またそれを畳むではないか。慈悲あまねく御方の外，誰がそれらを支えることができよう。本当にかれは，凡てのことを御存知であられる。",
            "verse 67:20": "慈悲あまねく御方を差し置いてあなたがたを助ける軍勢となり得るものは，誰であるのか。不信者は，妄想しているに過ぎない。",
            "verse 67:21": "かれがもし御恵みを止められると，あなたがたに恵みをなし得るものは誰であるのか。いやかれらは高慢と，（真理からの）回避に固執する。",
            "verse 67:22": "顔を伏せて（只頑なに）歩く者と，正しい道の上を規則正しく歩く者と，どちらがよく導かれるのか。",
            "verse 67:23": "言ってやるがいい。「かれこそはあなたがたを創り，あなたがたのために，聴覚，視覚，感情（知力）を与えられた方である。何とあなたがたの感謝の念の薄いことよ。」",
            "verse 67:24": "言ってやるがいい。「かれこそは，あなたがたを地上に分散し繁栄させられた方であり，あなたがたはかれの御許に集められる。」",
            "verse 67:25": "かれら（不信者）は，「もしあなたがたの言葉が真実なら，この契約は何時（果たされるの）であろうか。」と言う。",
            "verse 67:26": "言ってやろがいい。「本当にそれを知るのは，アッラーだけである。わたしは公明な警告者に過ぎない。」",
            "verse 67:27": "かれらが目の辺にそれを見る時，不信者たちの顔は悲しみに曇る。「これがあなたがたの求めていたもの（約束の成就）である。」と告げられる。",
            "verse 67:28": "言ってやるがいい。「あなたがたは考えないのか，もしアッラーが，わたしやわたしと一緒の者を滅ぼされても，また慈悲を与えられても，凡そ不信者を痛烈な懲罰から救うものは誰であろうか。」",
            "verse 67:29": "言ってやるがいい。「かれは慈悲あまねく御方であられ，わたしたちはかれを信仰し，かれに（全てを）托す。やがてあなたがたは，明らかな過誤の中にいる者が誰であるのかを知るであろう。」",
            "verse 67:30": "言ってやるがいい。「あなたがたは考えないのか。もし或る朝，あなたがたの水が地下に沈み去ったならば，涌き出る水を，あなたがたに(■?)せるものは，一体誰であるのか。」"
        },
        "Jawa": {
            "verse 67:1": "Maha suci Allah, Kang karaton iku ana ngastane, Allah iku nguwasani samu barang",
            "verse 67:2": "Kang gawe pati lan urip kanggo nyoba marang sira kabeh endi kang lakune luwih becik. Allah iku Maha Mulya tur keparenga ngapura",
            "verse 67:3": "Kang anitahake langit pitu padha, sira ora andeleng ana bedane ana ing sajerone titahe Ingkang Maha Murah; lan delenga maneh, apa sira bisa weruh ana kang geseh",
            "verse 67:4": "Banjur andelenga maneh mesthi pandelengira hambalik konjem ora bisa nemu cacade gegaweyaning Pangeran",
            "verse 67:5": "Ingsun ngrengga langit dunya (langit kang ngisor dhewe) kelawan lintang pirang - pirang, lintang mau Ingsun anggo balang, hambalangi para syaitan, dene syetan mau padha Ingsun ancam siksa neraka Sa’ir",
            "verse 67:6": "Sarupane wong sing maido Allah Pangerane, padha di patrapi siksa neraka jahannam. Ala temen kawusanan kang mangkono",
            "verse 67:7": "Nalikane wong kafir padha dicemplungake ing neraka panjerite karungu, neraka mau umub mumpal - mumpal",
            "verse 67:8": "Saking muringe neraka, wong kafir meh mrotholi, saben ana wong kafir sagolongan dicemplungake neraka ditakoni (dening Malaikat), \"Apa biyen ora ana juru pepeling sing nekani kowe",
            "verse 67:9": "Pada mangsuli, \"Inggih sampun wonten juru pepenget andhatengi kula, ananging kula sami anggorohaken sarwi wicanten, Allah boten dhawuhaken punapa - punapa sampeyan punika tetela kesasar sanget",
            "verse 67:10": "Wong kafir mau padha ngucap, \"Upama aku biyen ngestokake dhawuh utawa mikir, kaya - kaya ora kecemplung neraka Sa’ir",
            "verse 67:11": "Dadi wong kafir wis padha ngaku dosane (anggone maido para Rosul) mulane wong ing neraka Sa’ir mau padha didohake saka Rahmate Allah",
            "verse 67:12": "Sarupane wong kang padha bekti ing Allah Pangerane ana ing wektu sepi padha oleh pangapurane Allah, lan diparingi ganjaran gedhe",
            "verse 67:13": "Padha kondhoa lirih utawa seru kanggo Allah padha war, awit Allah iku nguningani sakreteking ati",
            "verse 67:14": "Apa Panjenengane kang nitahake iku ora uninga? Lan Panjenengane ingkang anguningani sabarang kang lembut - lembut, ing kang waspada",
            "verse 67:15": "Allah iku kang handadekake bumi iku gampang dianggo mlaku. Sira padha lumaku ana lumahing bumi, lan padha mangana rizkine Allah kang wis dicawisake dening Pangeranira. Ing tembe manungsa padha diadepake ana ngarsane Allah",
            "verse 67:16": "Apa sira nyana yen Allah kang kagungan keraton langit ngersakake sira diuntal bumi? coba delengen bumine arep oreg",
            "verse 67:17": "Apa sira nyana yen Allah kang kagungan kraton langit iku kersa nurunake siksa marang sira? Ing tembe mesthi weruh kaya apa pepeling Ingsun",
            "verse 67:18": "Para umat sadurunge wong kafir iku, mbiyen ugo padha maido marang rasule banjur koyo opo, para umat mau padha ingsun turunai siksa",
            "verse 67:19": "Apa dheweke (wong kafir) ora handeleng manuk kang sedhela ngegarake suwiwi lan ngingkupake, kang rumeksa manuk ora nganti tiba ora ana maneh kejaba mung Allah kang maha murah. Satemene Allah iku mirsani samu barang",
            "verse 67:20": "Apa brahala iki kang dikira dadi kancamu, bakal bisa nulungi bisa murungake siksane Allah, kang bisa nulungi dudu Paneran kang Maha Murah? Panemune si kafir iku tetela kajelomprong",
            "verse 67:21": "Manawa Allah ora kapareng paring rizki, apa brahala bisa weh rizki marang sira? Dheweke malah saya tambah anggone gumedhe lan nasar",
            "verse 67:22": "Wong wuta mlaku tumungkul, iku apa luwih weruh ing dalan bener ngungkuli wong kang ora wuta kang anggone mlaku jejeg",
            "verse 67:23": "(Muhammad) Dhawuha, \"Allah iku kang agawe awak ira sarta maringi pangrungu lan pandeleng apadene pikiran ewadene kang ngunjukake panuwun mung sathitik",
            "verse 67:24": "(Muhammad) Dhawuha, \"Allah kang gawe awak ira sarta paring panggonan ana ing bumi, ing tembe sira padha dikelumpukake marang ngarsane Allah",
            "verse 67:25": "Wong kafir padha matur, \"Menawi pangandika panjenengan punika sayektos benjing punapa kalampahanipun manungsa dipun kalempakaken punika",
            "verse 67:26": "(Muhammad) Dhawuha, \"Dina Qiyamat iku mung Allah piyambak kang priksa mangsane. Aku iki mung ngelengake wae",
            "verse 67:27": "Sawise dikelumpukake, bareng manungsa padha andeleng siksa wis cedhak, wong kafir padha pucet rahine. Banjur padha didhawuhi, \"Siksa iki kang padha sira paido biyen",
            "verse 67:28": "(Muhammad) Dhawuha, \"Apa sira padha mawas menawa Allah bakal nglebur aku sarta kang anyartani aku, malah Panjenengane bakal kagungan welas marang aku, banjur sapa sing bakal ngayomi para kafir saka siksa kang nglarani",
            "verse 67:29": "Sira dhawuha maneh, \"Allah iku Pangeran kang Maha Murah, aku percaya lan nyumanggakake samu barangku ing Allah. Ing tembe bakal padha weruh wong kang kesasar kang terang",
            "verse 67:30": "Sira dhawuha maneh, \"Menawa banyu iki asat kabeh, piye panemumu. Sapa kang nekakake banyu iki marang sira"
        },
        "Kazakh": {
            "verse 67:1": "Билік қолында болған Ол аса Берекелі әрі Ол барлық нәрсені Жасай алушы",
            "verse 67:2": "Ол өлім және өмірді сендердің қайсыларың амал етуде жақсырақ екенін сынау үшін жаратқан. Әрі Ол аса Үстем, өте Кешірімді",
            "verse 67:3": "Жеті аспанды қабат-қабат етіп жаратқан Сол Аллаһ . Әр-Рахманның аса Қайырымдының жаратуында ешбір кемшілік көрмейсің. Қайта көз салшы, қандай да бір сәйкессіздік көре аласың ба",
            "verse 67:4": "Содан кейін де көзіңді қайта сал. Көзің саған қажып, талған күйде қайтады",
            "verse 67:5": "Ақиқатында Біз төменгі аспанды шырақтармен аспан денелерімен безендірдік әрі оларды шайтандарды қайтаратын нәрсе еттік. Әрі Біз оларға шайтандарға Саъир (Тозақтың бір аты. Мағнасы жалынды от) азабын әзірледік",
            "verse 67:6": "Сондай-ақ өздерінің Раббысына, сондай күпірлік еткендерге сенбегендерге Жаһаннам (Тозақ) азабы бар. Ол баратын орын неткен жаман",
            "verse 67:7": "Олар имансыздар онда лақтырылған кезде, оның өкіргенін естиді, әрі ол бұрқылдап қайнап тұрады",
            "verse 67:8": "Ол қатты ашудан жарылып кете жаздайды. Оған бір топ лақтырылған сайын, оның сақшылары олардан: «Сендерге ескертуші келмеген бе еді?» деп сұрайды",
            "verse 67:9": "Олар: «Иә, солай, бізге ескертуші келген еді. Бірақ біз оны өтірікші санап: «Аллаһ еш нәрсе түсірмеген. Сендер бар болғаны үлкен адасудасыңдар», дегенбіз», дейді",
            "verse 67:10": "Әрі олар: «Егер де біз тыңдағанымызда не ақылымызды істеткенде, Саъирға (Тозақтың бір аты. Мағнасы жалынды от) түскендер қатарында болмас едік», дейді",
            "verse 67:11": "Сөйтіп олар күнәсін мойындайды. Саъирға түскендер құрысын",
            "verse 67:12": "Шын мәнінде, өздерінің Раббысынан, Оны көрмей тұрып қорқатындарға кешірім әрі үлкен сый Жәннат бар",
            "verse 67:13": "Сендер сөздеріңді жасырсаңдар да, не оны жарияласаңдар да, әлбетте, Ол көкіректердегіні жүректердегіні Білуші",
            "verse 67:14": "Бәрін Жаратқан білмей ме?! Әрі Ол аса Жұмсақ, Қырағы, әрбір нәрседен Хабардар",
            "verse 67:15": "Ол сендерге жерді көнгіш пайдалануға жеңіл етті. Оның жердің жан-жағында барлық тарабында жүріңдер және Оның Аллаһтың ризық еткенінен жеңдер. Әрі қайта тірілгеннен кейін Оған ораласыңдар",
            "verse 67:16": "Аспандағының Аллаһтың сендерді жерге, теңселіп тұрған кезінде жұттырып жіберуінен қауіпсізсіңдер ме",
            "verse 67:17": "Немесе сендер, аспандағының Аллаһтың өздеріңе тасты дауыл жіберуінен қауіпсізсіңдер ме? Жақында сендер ескертуімнің қалай екенін білесіңдер",
            "verse 67:18": "Ақиқатында, олардан бұрынғылар да өтірікке шығарған еді. Сонда Менің жазалауым қалай болды",
            "verse 67:19": "Олар өздерінің үстінде қанаттарын жаятын және жинайтын кұстарды көрмей ме?! Оларды ауада әр-Рахманнан басқа ешкім ұстап тұра алмайды. Ақиқатында, Ол әрбір нәрсені Көруші",
            "verse 67:20": "Сендердің әр-Рахманнан басқа жәрдем беретін жасақтарың кім олар бар ма ? Шын мәнінде, кәпірлер тек алданышта",
            "verse 67:21": "Егер Ол ризық беруін тоқтатса, сендерге кім ризық береді? Ақиқатында, олар қасарысуда және безулерін жалғастыруда",
            "verse 67:22": "Жүзімен жер сүзіп жүрген тура жолда ма, әлде түзу жолда еңсесін тіктеп жүрген бе",
            "verse 67:23": "Ей, Мұхаммед! Айт: «Ол сендерді жоқтан бар етті және сендерге естуді, көруді және жүректерді берді. Сендер өте аз шүкір етесіңдер Аллаһтың берген игіліктеріне тым аз алғыс білдіресіңдер », деп",
            "verse 67:24": "Айт: «Сендерді жер бетіне таратқан Сол Аллаһ , әрі сендер Оған жиналасыңдар», деп",
            "verse 67:25": "Олар сенбейтіндер : «Егер шын сөзді болсаңдар, бұл уәде қашан келеді ?»- дейді",
            "verse 67:26": "Ей, Мұхаммед!! Айт: «Шын мәнінде ол жайлы білім тек Аллаһта. Ал, мен анық ескертуші ғанамын», деп",
            "verse 67:27": "Ал, оны Есеп күнін жақыннан көрген кезде, күпірлік еткендердің Есеп күнін өтірікке шығарғандардың жүзі түнеріп кетеді. Оларға: «Міне, осы сендердің сұрағандарың!» делінеді",
            "verse 67:28": "Ей, Мұхаммед! Айт: «Айтыңдаршы, егер Аллаһ мені және менімен бірге болғандарды жоқ етсе, немесе бізді мейіріміне бөлесе де, кәпірлерді күйзелтуші азаптан кім қорғайды?!» деп",
            "verse 67:29": "Айт: «Ол әр-Рахман аса Қайырымды , біз Оған сендік әрі Оған жүгініп, ісімізді Оған тапсырдық тәуекел еттік . Сендер жақында кімнің анық адасуда екенін білесіңдер», деп",
            "verse 67:30": "Айт: «Айтыңдаршы, егер суларың жер астына сіңіп кетсе, сендерге ағатын су көзін кім келтіреді?!» деп"
        },
        "Korean": {
            "verse 67:1": "당신의 손에 주권이 있으신 분께 축복이 가득하니 그분께서는 모든 것이 가능한 분이시라왕국을 소유하고 계시는 하 나님께 축복이 있으소서 실로 그 분은 모든 일에 전지전능하심이라",
            "verse 67:2": "그분께서는 죽음과 삶을 창조하셨으니 누가 더 훌륭한 행위를 하는지 그분께서 그대들을 시험하시기 위함이라. 그분께서는 가장 존엄하시고 가장 너그러이 용서하시는 분이라죽음과 생명을 제정하시어 그것으로 너희가 선을 행하는지 시 험하고자 하시니 그분은 권능과 지혜로 충만하심이라",
            "verse 67:3": "그분께서는 일곱 개의 하늘을 층층이 창조하셨도다. 그대는 가장 자비로우신 분의 창조에서 그 어떤 엉성함도 보지 못하노라. 그러니 그대의 시각을 되돌려 보라 : 그대는 그 어떤 균열이라도 볼 수 있는가그분은 칠천을 층으로 하여 차례로 창조하셨노라 너희는 그것이 완전무결하여 무엇하나 결함이없음을 볼 것이니 다시 한번 눈을돌려보라 결함을 볼 수 있겠느뇨",
            "verse 67:4": "그 후 그대의 시각을 거듭하여 되돌려 보라 : 몽롱한 시각이 그대에게 돌아감에 그것은 침침해져 있을 것이라그런 후 다시 한번 눈을 들어보라 피곤하여 있던 눈이 겸손하 고 순종한 시력으로 돌아오리라",
            "verse 67:5": "진실로 나는 횃불들(별들)로써 가장 가까운 하늘을 미려하게 치장하였으며 그것들(별들)을 사탄들의 격퇴물로 두었노라. 그리고 나는 그들(사탄들)을 위해 화염의 벌을 준비하였노라실로 하나님은 가장 낮은 하 늘을 등불로서 장식하였고 그 것으로 사탄을 물리침에 유용하게하였으며 그들을 위해 타오르는 불지옥의 응벌을 준비하셨도다",
            "verse 67:6": "자신의 주님을 불신하는 자들에게는 지옥의 벌이 있으니 얼마나 사악한 귀착지인가주님을 믿지 아니한 자들을 위해서 사악한 응벌이 있나니",
            "verse 67:7": "그들이 그(지옥) 안에 내던져질 때 그들은 그것의 거친 들숨을 들으니 그것은 끓어오르더라그들이 그곳으로 던져질 때 그들은 신음소리 같은 무서운 비 탄의 소리를 들을 것이라",
            "verse 67:8": "그것은 분노로 말미암아 산산조각이 나기 직전이라. 그 안에 한 무더기가 내던져질 때마다 그것의 문지기들이 그들에게 물으니 “너희들에게 경고자가 도래하지 않았던가?”지옥은 분노하여 폭발할 것이니 불신자의 무리가 던져질 때 마다 너희에게 한 경고자가 이르지 아니 했었느뇨 라고 수호자가 질 문할 것이라",
            "verse 67:9": "그들이 말하길 : “그렇습니다. 저희들에게 이미 경고자가 도래하였으나 저희들은 부정하였고, 하나님께서는 그 어떤 것도 내리지 않으셨소. 그대들(사도들)은 오직 커다란 방황 속에 있을 뿐이오` 라고 말하였습니다”실로 저희에게 한 경고자가 도래하였으나 저희가 그를 거역 했습니다 하나님은 아무 것도 계 시하지 아니했습니다 당신들은 크게 방황하고 있을 뿐입니다 라고 말하더라",
            "verse 67:10": "그들이 말하길 : “저희들이 진작 경청하거나 이성을 썼더라면 화염의 거주자들과 함께 있지 않았을 것입니다”더하여 말하길 우리가 귀를기울였다면 또는 숙고 했더라면 우리는 타오르는 불지옥의 동료중에 있지 아니했을 텐데 라고 말하더라",
            "verse 67:11": "그리하여 그들은 자신의 죄를 인정하니 화염의 거주자들은 (자비로부터) 요원할지라그들은 죄악들을 고백하나 타오르는 불지옥의 동료들로부터 용서가 되지 않노라",
            "verse 67:12": "실로 보이지 않음에도 자신의 주님을 두려워하는 자들, 그들에게는 용서와 커다란 보상이 있을 것이라그러나 보이지 아니한 주님을 두려워 한 자들에게는 관용과 큰 보상이 있노라",
            "verse 67:13": "그대들은 소곤거리며 말하거나 소리내어 말해 보라. 실로 그분께서는 심중에 있는 것을 알고 계시는 분이라너희가 숨기어 말하는 것과 드러내어 말하는 것도 하나님은 마음속의 모든 것을 아심으로 충 만하시니라",
            "verse 67:14": "창조하신 그분께서 알지 못하신단 말인가? 그분은 가장 자상하시고 모든 것에 밝으신 분이라그분이 창조한 것을 그분이 모를리 있느뇨 실로 그분은 신비 한 모든 것을 이해하시고 아시는 분이시라",
            "verse 67:15": "그대들을 위해 대지가 순응토록 하신 분이 그분이시니 그대들은 그(대지) 끝자락을 걷고 그분의 양식을 먹으라. 그리고 그분께로 부활이 있을 것이라하나님은 너희를 위해 대지 를 유연하게 하셨나니 곳곳을 다 녀 보라 그리고 그분이 베푼 양식 을 섭취하라 죽은 후에는 그분께 로 귀의하노라",
            "verse 67:16": "하늘에 계신 분께서 그대들과 대지를 한꺼번에 꺼뜨려 버리실 수 있음에 그대들은 안전해 한단 말인가? 보라, 이제 그것(대지)은 요동치고 있노라하늘에 계신 그분께서 대지 를 흔들어 그것이 너희를 삼켜 버 리지는 못하게 할 것이라 안심하 느뇨",
            "verse 67:17": "아니면 하늘에 계신 분께서 그대들 위로 돌비를 보내실 수 있음에 그대들은 안전해 한단 말인가? 그대들은 나의 경고가 어떠한 것인지 곧 알게 될 것이라아니면 하늘에 계신 그분께 서 너희 위에 응벌을 내리지 아니 할 것이라 안심하느뇨 그때 너희 는 나의 응벌이 어떠한 것인가를 알게 되리라",
            "verse 67:18": "진실로 그들 이전의 자들도 부인하였으니 (불신에 대한) 나의 거부가 어떠한 것이었는가실로 그들 이전 백성들이 나의 경고를 거역했을 때 그들 위에 내려진 나의 벌이 얼마나 무서웠 더뇨",
            "verse 67:19": "그들은 그들 위에서 날개를 펼치고 접는 새를 보지 않았던가? 오직 가장 자비로우신 분만이 그것(새)을 붙잡아 주시노라. 실로 그분께서는 모든 것을 보시는 분이라머리 위에서 새들이 날개를 폈다가 접었다 하면서 먹이를 채 려고 덮치는 새들을 보지 못했더 뇨 자비로우신 하나님 외에는 어 느 누구도 그렇게 유지할 수 없나니 실로 그분은 모든 것을 지켜보고 계심이라",
            "verse 67:20": "아니면 이것(우상)이 정녕 가장 자비로우신 분을 대신하여 그대들을 도와줄 그대들의 군대란 말인가? 불신자들은 오직 기만에 빠져 있을 뿐이라자비로우신 하나님 외에 너 희를 도울 주인은 누구이뇨 실로 불신자들은 환상에 빠져 있더라",
            "verse 67:21": "아니면 그분께서 그분의 양식을 보류하실 때 이것(우상)이 정녕 그대들에게 양식을 제공한단 말인가? 그렇지 않노라. 그들은 교만과 혐오 속에서 아집을 부리더라하나님이 양식을 거두신다면너희에게 누가 너희에게 일용할 양식을 주겠느뇨 그런데도 그들은진리에서 벗어나 오만하도다",
            "verse 67:22": "그러니 고꾸라진 채 자신의 얼굴을 대고 걷는 자가 더 인도 받은 자인가 아니면 올곧은 길 위를 반듯하게 걷는 자인가고개 숙여 걷는 자가 낫겠 느뇨 아니면 바른 길을 걷는자의 인도됨이 낫겠느뇨",
            "verse 67:23": "그대(무함마드)는 말하라 : 그대들을 만드시고 그대들을 위해 청각과 시각과 마음을 두신 분이 그분이시라. 그대들의 감사함이 참으로 적도다.`일러가로되 너희를 창조하사성장케 하고 듣는 능력과 보는 능력과 감각의 능력롸 이해의 능력 을 주신 분이 바로 하나님이시라 그러나 너희는 감사하지 않더라",
            "verse 67:24": "그대(무함마드)는 말하라 : 대지에서 그대들을 창조하신 분이 그분이시라. 그리고 그분께로 그대들은 소집될 것이라`일러가로되 대지 위에 너희 를 번성케 하신 분이 하나님이시 거늘 너희 모두가 그분께로 집합 되노라",
            "verse 67:25": "그들이 말하길 : “그대들이 진실을 말하는 자들이라면 이 약속은 언제인가?”그러나 그들은 그대가 진실 을 말하고 있을 때 이 약속이 언 제 실행되느뇨 라고 물으매",
            "verse 67:26": "그대(무함마드)는 말하라 : 그 지식은 오직 하나님께만 있을 뿐이며 나는 오직 명백한 경고자일 뿐이라`일러가로되 그것은 하나님 만이 아시는 것으로 실로 나는 분명한 경고자에 불과하니라",
            "verse 67:27": "그리하여 그들이 그것(약속)을 가까이 보게 될 때 불신하던 자들의 얼굴은 일그러질 것이며, 목소리가 들릴 것이니 이것이 너희들이 재촉하던 것이라`그러나 그들이 그것을 가까 이서 목격할 때면 불신자들의 얼 굴은 슬픔으로 가득찰 것이며 그 것이 너희가 구하던 이행될 약속 이요 라는 말씀이 들려올 것이라",
            "verse 67:28": "그대(무함마드)는 말하라 : 그대들은 생각해 보라 : 하나님께서 나를 그리고 나와 함께 있는 자들을 파멸시키거나 혹은 우리에게 자비를 베푸신대도, 고통스러운 벌로부터 불신자들을 구원해 줄 자는 누구란 말인가? `일러가로되 나와 그리고 나 와 함께 한 자들을 하나님께서 멸망케 하시거나 아니면 우리에게 은혜를 베푼다 하더라도 고통스러운 응벌로부터 불신자들을 누가 구제할 수 있을런지 너희가 생각 해 보았느뇨",
            "verse 67:29": "그대(무함마드)는 말하라 : 그분은 가장 자비로우신 분이라. 우리는 그분을 믿으며 그분께 의탁하였노라. 그러니 그대들은 누가 분명한 방황 속에 있는지 곧 알게 될 것이라`일러가로되 그분은 자비로우신 분으로 우리는 그분만을 믿으 며 그분에게만 의탁하나니 너희는분명히 방황했던 자가 누구인지 알게 되리라",
            "verse 67:30": "그대(무함마드)는 말하라 : 그대들은 생각해 보라 : 만약 그대들의 물이 땅 속으로 스며들어 간다고 했을 때 그대들에게 흐르는 물을 가져올 자는 누구란 말인가?`일러가로되 물이 땅속으로 스며들어 물을 잃게 되었을 때 누가 너희에게 흐르는 물을 공급하 여 주겠느뇨"
        },
        "Kurdish": {
            "verse 67:1": "Ew (Yezdan ê ) ku (serektîya hemî berewan û bûyeran ) di destê wî dane, pîroz e. Û ewa bi xweber jî li ser hemî tiştan bi hêz eگه‌وره‌و موباره‌ك و پیرۆزه‌، ئه‌و زاته‌ی که هه‌موو بوونه‌وه‌رو جیهانی به‌ده‌سته‌، ئه‌و زاته‌ی ده‌سه‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌.",
            "verse 67:2": "Ji bo ku ewa we bi ceribûn e; ka kîjan ji we karekî rindtir dike ewî mirin û jîn afirandî ye. Şixwa ewa bi xweber jî servahatê baxişkar eهه‌ر ئه‌و خۆی مردن و ژیانی به‌دیهێناوه‌، تا تاقیتان بکاته‌وه‌، کێتان کرده‌وه‌ی چاکترو په‌سه‌ندتره‌، هه‌ر ئه‌ویش زاتێکی باڵاده‌سته به‌سه‌ر بێ باوه‌ڕاندا، وه لێخۆشبووه له ئیمانداران.",
            "verse 67:3": "Ewî ezman bi heft ramaxê (wekîhev) afirandî ye (heryekê ji wan di şopa xwe da digere). Tu di afirandîna ( Yezdan ê ) dilovan da qe to alozîyê nabînî. Îdî tu çav bizvirîn e, ka qe tu (di afirandina wan da) tu alozîyekî di bînîهه‌روه‌ها ئه‌و زاته ئاسمانه‌کانی به حه‌وت چین دروست کردووه‌، له نێو به‌دیهێنراوه‌کانی ئه‌و خوای میهره‌بانه‌دا هیچ ناڕێکی و ناته‌واویه‌ك به‌دی ناکه‌یت، ئه‌ی ئینسان: هه‌رچاو بگێڕه‌و سه‌رنج بده بزانه هیچ درزو که‌م و کووڕیه‌ك به‌دی ده‌که‌یت؟!",
            "verse 67:4": "Paşê tu bi car û car çav bizvirîne qe tu (tu alozî nabînî). Ewan çavanê bi bêzarî (ji dîtina kêmaî û alozîyan) bê umîd wê li bal te da bizvirinپاشان هه‌ر سه‌رنج بده‌و چاو بگێره‌و ورد به‌ره‌وه جار له دوای جارو کۆڵ مه‌ده‌، سه‌رسام و ملکه‌چ ده‌بیت، چاوت به نائومێدی ده‌گه‌ڕێته‌وه له‌کاتێکدا که چاوت ماندووه‌و په‌کی که‌وتووه‌.",
            "verse 67:5": "Bi sond ! me ezmanê cihanê bi sitêrkne wekî çiran çilwulok xemilandî ye. Me ewan sitêrkan ji bona Pelîdan xistin e kevir afîtok (sitêrkê rijok e). Me ji bona (Pelîdan ra) şapata doja hilopît amade kirîyeسوێند به‌خوا بێگومان ئێمه ئاسمانی دنیامان کردووه به چراخان (به‌هۆی ئه‌ستێره‌کانه‌وه که به شه‌وگاردا به‌دی ده‌کرێن) و به‌و ئه‌ستێرانه شه‌یتانه‌کان ڕاو ده‌که‌ین، له قیامه‌تیشدا سزاو ئه‌شکه‌نجه‌ی دۆزه‌خمان بۆ ئاماده کردوون.",
            "verse 67:6": "Me ji bona wanê ku filetî ya Xuda yê xwe dikin şapata dojê (amade kirîye). Ewa çiqa sikê êwran eهه‌روه‌ها بۆ ئه‌وانه‌ش که باوه‌ڕیان به په‌روه‌ردگاریان نیه‌، سزاو ئازاری دۆزه‌خ ئاماده‌یه‌، ئای که چاره‌نووس و سه‌رئه‌نجامێکی زۆر ناسۆرو ناخۆشه‌...",
            "verse 67:7": "Gava ewan di nava dojê da têne afîtinê, ewan ji dojê dengê zîqînîyê di behên (tu dibê qey ji hizkirina afîtinê) di hîre û ewa li sed hev da pêt davêj eکاتێك فڕێ ده‌درێنه ناوی ده‌نگێکی ناسازو ناخۆش و لووره‌یه‌ك له دۆزه‌خه‌وه ده‌بیستن، له‌کاتێکدا قوڵپ ده‌دات و ده‌کوڵێت.",
            "verse 67:8": "Nêzîk dibe ku (ewa doja) ji hêrsa ji hev bi çire. Çiqa destek ji wan di nava (dojê da) têne afîtinê, zebanîyê (dojê) ji wan pirs kirîye, « Qe ji bona ew ra hişyarvanekî, ku (hûn ji vê dojê bi dana tirsandinê ) ne hatibû bal we ? »له داخی خوانه‌ناسان خه‌ریکه پارچه پارچه ببێت و لێك ببێته‌وه‌، هه‌ر جارێك ده‌سته‌و تاقمێك فڕێ ده‌درێته ناوی پاسه‌وانی دۆزه‌خ لێیان ده‌پرسێت: باشه‌، ترسێنه‌رێکتان بۆ نه‌هات تا له‌م سه‌رئه‌نجامه ئاگادارتان بکات؟!",
            "verse 67:9": "Ewan (aha pisyar dane û) gotine, « erê ! bi sond, li bal me da hişyarvan hatibûn, lê me ewan dane derew dêrandinê, me ji wan ra (aha) gotibû, « Yezdan qe tu tişt ne hinartîye, hûn hey di wundabûneke mezin danin. »له وه‌ڵامدا به‌که‌ساسیه‌وه ده‌ڵێن: با، به‌ڵێ، له‌ڕاستیدا ترسێنه‌رمان بۆهات، به‌ڵام ئێمه بڕوامان پێنه‌کردن و وتمان: خوا هیچی له‌م باره‌یه‌وه نه‌ناردووه‌، ئێوه ته‌نها له گومڕایی گه‌وره‌دا گیرتان خواردووه‌و هیچی تر!!",
            "verse 67:10": "(aha jî) gotibûne, « Şixwa heke me ji wan (hişyrvanan) bi bihîsta û me (ji gotinê wan) hiş hilda, em ne diketine nava hevrîne (agirê) hilopît. »ئینجا ده‌ڵێن: ئه‌گه‌ر ئێمه گوێمان بگرتایه‌و بیرو هۆشمان به‌کار بهێنایه نه‌ده‌بووینه نیشته‌جێی دۆزه‌خ.",
            "verse 67:11": "Îdî ewan (bi vênevê gotine), « erê ! me (evan gunehê hanênan) kirine. Îdî (tu dest ji wan berde) bi ra hevalê wî (agirê) hilopît bêne hêrandinê, dûr e (dilovanî ya Yezdan bi kebin)ئه‌وسا ئیتر به‌ناچاریی و خه‌جاڵه‌تیه‌وه دان به‌گوناهو تاوانی خۆیاندا ده‌نێن، جا با نیشته‌جێکانی دۆزه‌خ له‌وه‌و لا ترچن.",
            "verse 67:12": "Bi rastî ewanê, ku bi dizîka da ji Xuda yê xwe ditirsin hene ! ji bona wan ra baxişkirin û kiryeke mezin heyeبه‌ڕاستی ئه‌وانه‌ی که له په‌روه‌ردگاریان ده‌ترسن له په‌نهانیدا، بۆ ئه‌وانه لێخۆشبوون و پاداشتی گه‌وره ئاماده‌یه‌..",
            "verse 67:13": "Hûn (gelî merivan !) axiftinan, çi veşêrin û çi eşkerke bikin (yek e). Loma tişta di singa da heye (Yezdan) pur pê dizaneخه‌ڵکینه‌؛ چونیه‌که بۆتان چ به‌نهێنی قسه بکه‌ن یان به‌ئاشکرا، ئه‌و زاته به‌هه‌موو ئه‌و خه‌ته‌ره‌و خه‌یاڵانه‌ی دێن به‌کرۆکی سینه‌کاندا زاناو ئاگایه‌",
            "verse 67:14": "Ewa bi xweber bi hemî tiştê hûr (dizane û ) agahdar e, ça bi tişta (afirandîye)nizaneمه‌گه‌ر خوا نازانێت کێی دروست کردووه‌و چۆنی دروست کردووه‌، له‌کاتێکدا ئه‌و زاته وردکارو به سۆزو ئاگایه‌.",
            "verse 67:15": "Ewê, ku zemîn ji bona we ra melûl kirîye heye ! ewa Yezdan e, îdî hûn di nav milê (zemîn da) bigerin û hûn ji rojîne wî bixun. Hey zivirandin li bal (Yezdan) daneهه‌ر ئه‌و زاته زه‌وی بۆ زه‌لیل و ملکه‌چ کردوون (هه‌رچیتان بوێت له‌سه‌ری دروست ده‌که‌ن، چۆنتان بوێت به‌کاری ده‌هێنن)، بگه‌ڕێن به هه‌موو گۆشه‌و که‌ناریدا، له‌و ڕزق و ڕۆزیه‌ش بخۆن که پێشکه‌شتانی ده‌کات، دڵنیاش بن که سه‌رئه‌نجام گه‌ڕانه‌وه‌تان بۆ لای ئه‌و زاته‌یه‌.",
            "verse 67:16": "Qey hûn ji wanê di ezmana da ewle dibin, ku ewan we di zemîn da nexne xarê? Gava (evan bi vên, ku we di zemîn da bixne xarê) zemîn heman diheje (hûn bixweber di zemîn da diçine xarê)ئایا له‌و زاته ناترسن که له سه‌رووی ئاسمانه‌وه‌یه‌، که به‌ناخی زه‌ویدا بتانباته خواره‌وه‌؟! جا ده‌ستبه‌جێ ئه‌و زه‌وی یه بێته له‌رزه‌...",
            "verse 67:17": "Yajî qeyy hûn ji wanê di zemîn da hene ewle dibin, ku ewan li ser we da bexûrê neşînin? Di nava wê baxûrê da kevirne, ku hûn bi wan bêne kuştinê hebin. Îdî hûnê di nêzîk da bizanin ka hîşyar ya mine bi tirsdanê, çaneیاخود له‌و زاته ناترسن که له سه‌روو ئاسماندایه که بایه‌کی به‌هێز هه‌ڵکاته سه‌رتان و به‌رد بارانتان بکات؟! ئه‌وسا ده‌زانن هه‌ڕه‌شه‌ی من چۆن بووه‌.",
            "verse 67:18": "Bi sond! Ewanê di berya wan da hebûne, hene ! ewan jî (Pêxemberne xwe) dabûne derewdêrandinê, îdî (tu mize bike) ka temtêla wanê,ku (digotin, Xuda) tuneye çaneسوێند به‌خوا بێگومان خه‌ڵکانی تری پێش ئه‌مان بڕوایان به‌پێغه‌مبه‌رانی ئێمه نه‌کرد ئاشکرایه چ به‌ڵایه‌کم به‌سه‌رهێناون و چۆن ته‌مێم کردن.",
            "verse 67:19": "Maqey ewan li bal wan çûkne, ku li ser wan da ref girtine û baskê xwe diweşînin û req dikin, mêze nakin? Ewan (çûkan) di hewa da hey (Yezdan ê) dilovan digire. Loma bi rastî ewa hemî tiştîdibîneئایا سه‌رنجی باڵنده‌یان نه‌داوه به‌سه‌ریانه‌وه پۆل پۆل ده‌فڕن و باڵه‌کانیان لێك ده‌نێن، ئه‌و باڵندانه جگه خوای میهره‌بان که‌س به ئاسمانه‌وه ڕاگیریان ناکات، به‌ڕاستی ئه‌و زاته به هه‌موو شتێك بینایه‌و هیچی لێ ون نابێت و چاودێری هه‌موو دروستکراوانی ده‌کات (فڕۆکه‌و که‌شتی ئاسمانی و.... هتد، هه‌ر ئه‌و زاته به هۆکاره‌کان له ئاسماندا هاتووچۆیان پێده‌کات و ڕایان ده‌گرێت).",
            "verse 67:20": "Qey ji pêştirê (Yezdan ê) dilovan, evan leşkerne wene hanênan wê we (ji şapata Yezdan) biparisînin? Bi rastî file di xapandinêdaninئایا کێیه ئه‌و که‌سه خۆی به سه‌ربازو به‌رگریکه‌ر له ئێوه ده‌زانێت و وا ده‌نوێنێت که ده‌توانێت به‌بێ خوای میهره‌بان سه‌رتان بخات و پایه‌دارتان بکات؟! نه‌خێر، کافران ته‌نها له خه‌ڵه‌تاویدان و هیچی تر؟!",
            "verse 67:21": "Qey heke(Yezdan) rojîna xwe ji we bide girtinê, evanê hanê wê ji we ra rojînan bidin? (Tu kes nikare bide!) lê ewan di înça xwe da tekoşînê dikin û (ji rastîyê) vedicinikinیاخود کێ یه ئه‌وه‌ی که ڕزق و ڕۆزیتان پێده‌به‌خشێت، ئه‌گه‌ر خوا لێتان بگرێته‌وه‌؟! نه‌خێر، به‌و تاقی کردنه‌وه‌یه‌ش بێ باوه‌ڕان هه‌ر له گومڕایی و سه‌رلێشێواوی و دووره په‌رێزی له به‌رنامه‌ی خوا ڕۆچوون!",
            "verse 67:22": "Maqey ewê, ku deverû diçe, ewa li ser rîyaraste yan jî ewê li ser rîyarast diçe hatîye rîyarastجا ئایا ئه‌و که‌سه‌ی که ده‌مه‌و ڕوو که‌وتووه‌و به‌و حاڵه‌وه ده‌ڕوات، چاکتر ڕێگه ده‌زانێت؟ یان ئه‌و که‌سه‌ی که به‌سه‌ر شه‌قامێکی ڕاست و ڕه‌واندا به ڕێك و پێکی ده‌ڕوات به‌ڕێوه‌؟!",
            "verse 67:23": "(Muhemmed! Tu ji bona wan ra aha) bêje: “Ewê hûn afirindine heye! Ewa Yezdan e. Ewî ji bona we ra goh û çav û dil çêkirîye. Hûn çiqa hindik sipasî ya (wî) dikin!“ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم پێیان بڵێ: هه‌ر خوایه‌، که ئێوه‌ی دروستکردووه‌و ده‌زگای بینین و بیستن و تێگه‌یشتنی پێ به‌خشیون، که‌چی که‌متان شوکرانه بژێرو سوپاسگوزارن.",
            "verse 67:24": "(Muhemmed! Tu ji bona wan ra aha jî) bêje: “ewê hûn di zemîn da çandine heye! Ewa (Yezdan e) hûnê li bal wî da bêne civandinê.“هه‌روه‌ها پێیان بڵێ: هه‌ر ئه‌و خوایه‌؛ ئێوه‌ی له خاکی زه‌وی پێگه‌یاندووه‌، گه‌ڕانه‌وه‌و کۆکردنه‌وه‌شتان بۆ لای ئه‌وه‌.",
            "verse 67:25": "Ewan ji te (aha dipirsin) û dibêjin: “heke hûn rastbêjin, ka danê wê (şapatê) kîngeye?“بێ باوه‌ڕان ده‌ڵێن: باشه‌، که‌ی ئه‌م به‌ڵێنه دێته دی، (زیندووکردنه‌وه‌و لێپرسینه‌وه‌) ئه‌گه‌ر ئێوه ڕاستگۆن؟!",
            "verse 67:26": "Tu (pisyara wan aha bide) û bêje: “ zanîna wî danî hey li bal Yezdan e. Ez bi xweber jî hey hişyardarekî xwuyame.“پێیان بڵێ: زانیاری ئه‌و کاته لای خوایه‌، من ته‌نها بێدار که‌ره‌وه‌یه‌کی ئاشکرام.",
            "verse 67:27": "Îdî gava ewan (nabaweran) ewa (aşîta) di nêzîk da dîtine, rûyê wanê bûne file sikbûya (ji wan ra aha) hatîye gotinê: “ewa şapata we dixwest evaye.“کاتێك بینیان ئه‌و به‌ڵێنه خواییه یه‌خه‌یان پێ ده‌گرێت، چڕوچاوی ئه‌وانه‌ی که باوه‌ڕیان نه‌بووه‌، تاڵ و ترش و ناشرین ده‌کرێت، ئه‌وسا پێیان ده‌وترێت ئا ئه‌مه ئه‌و به‌ڵێنه‌یه که‌پێتان ده‌درا.",
            "verse 67:28": "(Muhemmed! Tu ji bona wan ra aha) bêje: “hûn mêze bikin, heke Yezdan min û ewanê bi min ra teşqele bike, yan jî dilovanî ya xwe li me bike (em bi xweber qayîlin loma ewa Xuda yê me ye, lê gelo) îdî kê dikare filan ji şapata dilsoz biparêsîne?“هه‌روه‌ها پێیان بڵێ: باشه‌، ئه‌گه‌ر خوا، من و هه‌موو ئه‌و که‌سانه‌ی که شوێنم که‌وتوون له‌ناو به‌رێت، یان به‌زه‌یی پیاماندا بێته‌وه‌، ئه‌وسا کێ هه‌یه بێ باوه‌ڕان له سزای پڕ ئێشی دۆزه‌خ ڕزگار بکات؟! (ئه‌گه‌ر له‌سه‌ر یاخی بوونیان به‌رده‌وام بن)",
            "verse 67:29": "(Muhemmed! Tu ji bona wan ra aha jî) bêje: “parisvan hey (Yezdan ê) dilovan e, me bi wî bawer kirîyeû me xwe hispartîye wî, îdî hûnê di nêzîk da bizanin ka kîjan di rê wundabûna xûyadane.“هه‌روه‌ها بڵێ: ئێمه خوای میهره‌بانمان هه‌یه‌و باوه‌ڕی پته‌ومان پێیه‌تی و پشت و په‌نامان هه‌ر ئه‌وه‌، جا ئیتر ڕۆژێك دێت که به ڕوونی بۆتان ده‌رده‌که‌وێت کێ له‌گومڕایی ئاشکرادا گیری خواردووه‌و سه‌ری لێ شێواوه‌.",
            "verse 67:30": "Tu (ji wan ra aha jî) bêje: “hûn mêze bikin; heke ava we di (zemîn da) here xarê û bimirçiqe, îdî gelo ji we ra kîjan dikare aveke nexwuyaî bide zayînê bîne?“پێیان بڵێ: هه‌واڵم بده‌نێ باشه ئه‌گه‌ر ئاوه‌که‌تان ڕۆچوو، کێ ده‌توانێت ئاوی سازگارو ڕه‌وانتان بۆ به‌ده‌ست بهێنێت؟! (جگه له خوای میهره‌بان)."
        },
        "Kyrgyz": {
            "verse 67:1": "(Бүткүл ааламдардын) мүлк(ү) Өз Колунда болгон Аллаһ Ыйык! Ал бардык нерсеге Кудуреттүү",
            "verse 67:2": "Алсилердин кимиңер эң мыкты (сооптуу) иш жасай алышыңарды сыноо үчүн өлүм менен өмүрдү жараткан. Жана Ал — Кудуреттүү, Кечиримдүү",
            "verse 67:3": "Ал жети асманды кабат-кабат жараткан. Сен Рахмандын жаратканында эч кандай кемчилдик таба албайсың. Эми дагы бир кара! Кемчилдик көрөөр бекенсиң",
            "verse 67:4": "Анан дагы кайра-кайра үңүл! Көз(үң) сага тунарган, чарчаган бойдон кайта берет",
            "verse 67:5": "Биз дүйнө асманын жылдыз-чырактар менен кооздоп, аларды шайтандар үчүн атылуучу таш кылдык. Жана Биз алар (шайтандар) үчүн (Акыретте) тозок азабын даярдап койдук.”",
            "verse 67:6": "Жана Раббисине каапыр болгон адамдар үчүн тозок азабы бар! Ал эң жаман кайтуу",
            "verse 67:7": "Качан алар анын (тозоктун) ичине ташталганда, коркунучтуу добушун угушат! Ал кайнап турган",
            "verse 67:8": "(Тозок өзүнө ташталган каапырлардан) каардангандан улам жарылып кеткидей болот! Ар качан ага бир жамаат (каапырлар) ташталганда, анын (периште) кароолчулары: «Эмне силерге (ушул тозок жөнүндө) кабар берген пайгамбар келбеди беле?»-деп сурайт",
            "verse 67:9": "Алар айтышат: “Ооба, ырас бизге эскертүүчү-пайгамбар келген. Бирок, биз аны жалганчыга чыгарып: «Аллаһ (силерге) эч нерсе түшүргөн эмес! Силер эң чоң адашуудагы адамсыңар!» дегенбиз”",
            "verse 67:10": "Жана айтышат: «Эгер биз (ошол пайгамбарды) угуп, акылыбызды иштеткенде (бүгүн) тозок «ээлери» болуп калбайт элек!»",
            "verse 67:11": "Ошентип күнөөлөрүн мойнуна алышат. Тозокулар (Аллаһтын ырайымынан) алыс",
            "verse 67:12": "Кайыптагы Раббисинен корккон адамдарга (Аллаһ Таала тарабынан) кечирим жана чоң сыйлык (Бейиш) бар",
            "verse 67:13": "Жана (о, адамдар) силер сөзүңөрдү сыр тутасыңарбы же ашкере кыласыңарбы, Ал көкүрөктөрдү ээлеген нерселерди Билүүчү",
            "verse 67:14": "(Көкүрөктөгү сырларды) Жараткан билбей калат бекен?! Ал Латийф! (жана бардыгынан) Кабардар го",
            "verse 67:15": "Ал силер үчүн жерди моюн сунуучу кылып койду. Эми, анын чар тарабында жүрүп, (Аллаһтын) ырыскыларынан жей бергиле! Кайра тирилип баруу — анын Өзүнө гана",
            "verse 67:16": "<Эй, каапырлар) асмандагы Зат> силерди жерге жуткуруп жиберүүсүнөн (тап-такыр) тынчсыңарбы?! Капысынан ал (жер) чайпалып кетсечи",
            "verse 67:17": "Же болбосо, силер, асмандагы (Аллаһ) үстүңөргө таш учурган катуу шамал жиберишинен амансыңарбы!? Жакында (Менин) эскертүү(м) кандай экенин билип аласыңар",
            "verse 67:18": "Алардан мурунку (каапыр) пенделер дагы (пайгамбарды) жалганчыга чыгарышкан. Анан (Менин) четке кагуу(м) кандай болду",
            "verse 67:19": "Алар төбөсүндөгү канатын (бир) жайып (бир) жыйнап турган кушка карашпайбы?! Аны (ободо ырайымдуу) Рахман гана кармап турат! Ал - ар бир нерсени Көрүүчү",
            "verse 67:20": "(Эй, каапырлар! Ойлонгула:) Силерге Рахмандан башка жардам бере ала турган аскериңер (жардамчыңар) ким экен?! Каапырлар адашуунун гана ичинде",
            "verse 67:21": "Эгер (Аллаһ) Өз ырыскысын токтотуп койсо, силерге ырыскы таап бере ала турган ким?! Жок! (каапырлар дагы эле) катаал-дыгын, (исламды) жек көрүүсүн улантып жатышат",
            "verse 67:22": "Ким Туура Жол табуучураак? Жер карап бара жаткан кишиби же болбосо, Туура Жолдо (башын) түз (тутуп) бара жаткан кишиби",
            "verse 67:23": "Айткын: “Ал силерди жаратып, көз, кулак жана жүрөктөрдү берген. Өтө аз шүгүр кылуудасыңар!”",
            "verse 67:24": "Айткын: «Ал силерди жер бетинде өндүрүп-өстүргөн. Жана (кайра тирилгенде) Өзүнө гана чогултуласыңар»",
            "verse 67:25": "Жана алар: «Эгер чынчыл болсоңор бул (кайра тирилүү жөнүндө) убада (Кыямат) качан?» дешет",
            "verse 67:26": "Айткын: «(Ал жөнүндөгү) илим Аллаһтын гана алдында. А мен болгону, анык эскертүүчү-пайгамбармын»",
            "verse 67:27": "Качан гана аны (тозокту) жакындан көрүшкөндө каапыр болгондордун жүздөрү карарып кетет жана аларга: «ушул силер («качан-качан» деп) шаштырган нерсеңер!»-деп айтылат",
            "verse 67:28": "Айткын: «(Ойлонуп) көрбөйсүңөрбү, эгер мени жана мени менен бирге болгон (ыймандуу) адамдарды Аллаһ (силер тилегендей) өлтүрчү болсо (бизге Акыреттик Бейиш даяр) же (узун өмүр берип) бизге ырайым кылса (Өзүнө сыйынып, шүгүр кылып жашай беребиз. Ал эми, силердин жаныңарды алчу болсо) анда силерди катуу азаптан ким сактап калат",
            "verse 67:29": "Айткын: «Ал — Рахман (Ырайымдуу)! Биз Ага ыйман келтирдик жана тобокел кылдык. А, силер (эй, каапырлар), ким анык адашууда экенин жакында билип аласыңар",
            "verse 67:30": "Айткын: «(Эй, каапырлар) ойлонуп көрбөйсүңөрбү, эгерде силердин сууңар жер астына сиңип кетсе, анда силерге аккан сууну ким келтирип берет"
        },
        "Malay": {
            "verse 67:1": "Maha Berkat (serta Maha Tinggilah kelebihan) Tuhan yang menguasai pemerintahan (dunia dan akhirat); dan memanglah Ia Maha Kuasa atas tiap-tiap sesuatu;",
            "verse 67:2": "Dia lah yang telah mentakdirkan adanya mati dan hidup (kamu) - untuk menguji dan menzahirkan keadaan kamu: siapakah di antara kamu yang lebih baik amalnya; dan Ia Maha Kuasa (membalas amal kamu), lagi Maha Pengampun, (bagi orang-orang yang bertaubat);",
            "verse 67:3": "Dia lah yang telah mengaturkan kejadian tujuh petala langit yang berlapis-lapis; engkau tidak dapat melihat pada ciptaan Allah Yang Maha Pemurah itu sebarang keadaan yang tidak seimbang dan tidak munasabah; (jika engkau ragu-ragu) maka ulangilah pandangan - (mu) - dapatkah engkau melihat sebarang kecacatan?",
            "verse 67:4": "Kemudian ulangilah pandangan (mu) berkali-kali, nescaya pandanganmu itu akan berbalik kepadamu dengan hampa (daripada melihat sebarang kecacatan), sedang ia pula berkeadaan lemah lesu (kerana habis tenaga dengan sia-sia).",
            "verse 67:5": "Dan demi sesungguhnya! Kami telah menghiasi langit yang dekat (pada penglihatan penduduk bumi) dengan bintang-bintang, dan Kami jadikan bintang-bintang itu punca rejaman terhadap Syaitan-syaitan; dan Kami sediakan bagi mereka azab neraka yang menjulang-julang.",
            "verse 67:6": "Dan bagi orang-orang yang kufur ingkar terhadap Tuhan mereka, disediakan azab neraka Jahannam, dan itulah seburuk-buruk tempat kembali.",
            "verse 67:7": "Apabila mereka dicampakkan ke dalamnya, mereka mendengar suara jeritannya meraung-raung, sedang ia menggelegak.",
            "verse 67:8": "Hampir-hampir ia pecah berkecai-kecai kerana kuat marahnya. Tiap-tiap kali dicampakkan ke dalamnya sekumpulan besar (dari orang kafir), bertanyalah penjaga-penjaga neraka itu kepada mereka: \"Tidakkah kamu pernah didatangi seorang Rasul pemberi ingatan dan amaran (di dunia dahulu)?\"",
            "verse 67:9": "Mereka menjawab: \"Ada! Sebenarnya telah datang kepada kami seorang Rasul pemberi ingatan dan amaran, lalu kami dustakan serta kami katakan (kepadanya): Allah tidak menurunkan sesuatupun, kamu (wahai orang yang mendakwa menjadi Rasul) hanyalah berada dalam kesesatan yang besar! \"",
            "verse 67:10": "Dan mereka berkata: \"Kalaulah kami dahulu mendengar dan memahami (sebagai orang yang mencari kebenaran), tentulah kami tidak termasuk dalam kalangan ahli neraka\".",
            "verse 67:11": "Akhirnya mereka mengakui dosa-dosa mereka (sebagai orang-orang yang kufur ingkar), maka tetaplah jauhnya rahmat Allah dari ahli neraka.",
            "verse 67:12": "Sesungguhnya orang-orang yang takut (melanggar hukum) Tuhannya semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, mereka beroleh keampunan dan pahala yang besar.",
            "verse 67:13": "Dan tuturkanlah perkataan kamu dengan perlahan atau dengan nyaring, (sama sahaja keadaannya kepada Allah), kerana sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
            "verse 67:14": "Tidakkah Allah yang menciptakan sekalian makhluk itu mengetahui (segala-galanya)? Sedang Ia Maha Halus urusan PentadbiranNya, lagi Maha Mendalam PengetahuanNya!",
            "verse 67:15": "Dia lah yang menjadikan bumi bagi kamu: mudah digunakan, maka berjalanlah di merata-rata ceruk rantaunya, serta makanlah dari rezeki yang dikurniakan Allah; dan (ingatlah), kepada Allah jualah (tempat kembali kamu sesudah) dibangkitkan hidup semula; (maka hargailah nikmatNya dan takutilah kemurkaanNya).",
            "verse 67:16": "Patutkah kamu merasa aman (tidak takut) kepada Tuhan yang pusat pemerintahanNya di langit itu: menunggang-balikkan bumi menimbus kamu, lalu bergegarlah bumi itu dengan serta-merta (melenyapkan kamu di bawahnya)?",
            "verse 67:17": "Atau patutkah kamu merasa aman (tidak takut) kepada Allah yang pusat pemerintahanNya di langit itu: menghantarkan kepada kamu angin ribut yang menghujani kamu dengan batu; maka dengan itu, kamu akan mengetahui kelak bagaimana buruknya kesan amaranKu?",
            "verse 67:18": "Dan demi sesungguhnya! orang-orang (kafir) yang terdahulu daripada mereka telah mendustakan (rasul-rasulnya lalu mereka dibinasakan); dengan yang demikian, (perhatikanlah) bagaimana buruknya kesan kemurkaanKu.",
            "verse 67:19": "Patutkah mereka menutup mata dan tidak memerhatikan (kekuasaan Allah pada) burung-burung yang terbang di atas mereka, (siapakah yang menjaganya ketika) burung-burung itu mengembang dan menutupkan sayapnya? Tidak ada yang menahannya (daripada jatuh) melainkan (kekuasaan) Allah Yang Maha Pemurah. Sesungguhnya Ia Maha Melihat serta mengetahui akan tiap-tiap sesuatu.",
            "verse 67:20": "Bahkan siapa dia yang menjadi tentera bagi kamu, yang akan menolong kamu selain dari Allah Yang Maha Pemurah? (Sebenarnya) orang-orang yang kafir tidak lain hanyalah berada dalam keadaan terpedaya.",
            "verse 67:21": "Atau siapa dia yang dapat memberi rezeki kepada kamu jika Allah menahan rezekiNya? (Tidak ada sesiapapun), bahkan mereka (yang musyrik itu) kekal terus dalam keadaan sombong angkuh serta melarikan diri (dari kebenaran).",
            "verse 67:22": "Maka adakah orang yang berjalan (melalui jalan yang tidak betul, yang menyebabkan dia selalu jatuh) tersungkur di atas mukanya: boleh mendapat hidayah - atau orang yang berjalan tegak betul, melalui jalan yang lurus rata?",
            "verse 67:23": "Katakanlah (wahai Muhammad): \"Allah yang menciptakan kamu (dari tiada kepada ada), dan mengadakan bagi kamu pendengaran dan penglihatan serta hati (untuk kamu bersyukur, tetapi) amatlah sedikit kamu bersyukur\".",
            "verse 67:24": "Katakanlah lagi: \"Dia lah yang mengembangkan kamu di bumi, dan kepadaNyalah kamu akan dihimpunkan\".",
            "verse 67:25": "Dan mereka (yang ingkar) berkata: \"Bilakah datangnya (hari kiamat) yang dijanjikan itu, jika betul kamu orang-orang yang benar?\"",
            "verse 67:26": "Katakanlah (wahai Muhammad): \"Sesungguhnya ilmu pengetahuan (tentang masa kedatangannya) hanya ada pada sisi Allah, dan sesungguhnya aku hanyalah seorang Rasul pemberi ingatan dan amaran yang terang nyata\".",
            "verse 67:27": "Kemudian apabila (datang kiamat dan) mereka melihat (azab) yang dijanjikan itu secara dekat, muramlah muka orang-orang yang kafir itu, serta dikatakan (kepada mereka): \"Inilah dia yang dahulu kamu kerap kali minta disegerakan kedatangannya!\".",
            "verse 67:28": "Tanyalah (wahai Muhammad, kepada mereka): \"Bagaimana fikiran kamu, jika Allah binasakan daku dan orang-orang yang bersama-sama denganku (sebagaimana yang kamu harap-harapkan), atau Ia memberi rahmat kepada kami (sehingga kami dapat mengalahkan kamu), - maka siapakah yang dapat melindungi orang-orang yang kafir dari azab seksa yang tidak terperi sakitnya?\".",
            "verse 67:29": "Tegaskan (wahai Muhammad, kepada mereka): \"Allah Dia lah Yang Maha Pemurah, yang kami beriman kepadaNya, dan yang kepadaNya kami berserah diri; oleh itu kamu akan mengetahui kelak siapakah yang berada dalam kesesatan yang nyata\".",
            "verse 67:30": "Katakanlah lagi: \"Bagaimana fikiran kamu, sekiranya air kamu hilang lenyap (di telan bumi), maka siapakah (selain Allah) yang dapat mendatangkan kepada kamu air yang sentiasa terpancar mengalir?\"."
        },
        "Malayalam": {
            "verse 67:1": "ആധിപത്യം ഏതൊരുവന്‍റെ കയ്യിലാണോ അവന്‍ അനുഗ്രഹപൂര്‍ണ്ണനായിരിക്കുന്നു. അവന്‍ ഏതു കാര്യത്തിനും കഴിവുള്ളവനാകുന്നു.",
            "verse 67:2": "നിങ്ങളില്‍ ആരാണ് കൂടുതല്‍ നന്നായി പ്രവര്‍ത്തിക്കുന്നവന്‍ എന്ന് പരീക്ഷിക്കുവാന്‍ വേണ്ടി മരണവും ജീവിതവും സൃഷ്ടിച്ചവനാകുന്നു അവന്‍. അവന്‍ പ്രതാപിയും ഏറെ പൊറുക്കുന്നവനുമാകുന്നു.",
            "verse 67:3": "ഏഴു ആകാശങ്ങളെ അടുക്കുകളായി സൃഷ്ടിച്ചവനാകുന്നു അവന്‍. പരമകാരുണികന്‍റെ സൃഷ്ടിപ്പില്‍ യാതൊരു ഏറ്റക്കുറവും നീ കാണുകയില്ല. എന്നാല്‍ നീ ദൃഷ്ടി ഒന്നുകൂടി തിരിച്ചു കൊണ്ട് വരൂ. വല്ല വിടവും നീ കാണുന്നുണ്ടോ?",
            "verse 67:4": "പിന്നീട് രണ്ടു തവണ നീ കണ്ണിനെ തിരിച്ച് കൊണ്ട് വരൂ. നിന്‍റെ അടുത്തേക്ക് ആ കണ്ണ് പരാജയപ്പെട്ട നിലയിലും പരവശമായികൊണ്ടും മടങ്ങി വരും.",
            "verse 67:5": "ഏറ്റവും അടുത്ത ആകാശത്തെ നാം ചില വിളക്കുകള്‍ കൊണ്ട് അലങ്കരിച്ചിരിക്കുന്നു. അവയെ നാം പിശാചുകളെ എറിഞ്ഞോടിക്കാനുള്ളവയുമാക്കിയിരിക്കുന്നു. അവര്‍ക്കു നാം ജ്വലിക്കുന്ന നരകശിക്ഷ ഒരുക്കിവെക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 67:6": "തങ്ങളുടെ രക്ഷിതാവില്‍ അവിശ്വസിച്ചവര്‍ക്കാണ് നരക ശിക്ഷയുള്ളത്‌. തിരിച്ചെത്തുന്ന ആ സ്ഥലം വളരെ ചീത്ത തന്നെ.",
            "verse 67:7": "അവര്‍ അതില്‍ (നരകത്തില്‍) എറിയപ്പെട്ടാല്‍ അതിന്നവര്‍ ഒരു ഗര്‍ജ്ജനം കേള്‍ക്കുന്നതാണ്‌. അത് തിളച്ചു മറിഞ്ഞു കൊണ്ടിരിക്കുകയും ചെയ്യും.",
            "verse 67:8": "കോപം നിമിത്തം അത് പൊട്ടിപ്പിളര്‍ന്ന് പോകുമാറാകും. അതില്‍ (നരകത്തില്‍) ഓരോ സംഘവും എറിയപ്പെടുമ്പോഴൊക്കെ അതിന്‍റെ കാവല്‍ക്കാര്‍ അവരോട് ചോദിക്കും. നിങ്ങളുടെ അടുത്ത് മുന്നറിയിപ്പുകാരന്‍ വന്നിരുന്നില്ലേ?",
            "verse 67:9": "അവര്‍ പറയും: അതെ ഞങ്ങള്‍ക്ക് മുന്നറിയിപ്പുകാരന്‍ വന്നിരുന്നു. അപ്പോള്‍ ഞങ്ങള്‍ നിഷേധിച്ചു തള്ളുകയും അല്ലാഹു യാതൊന്നും ഇറക്കിയിട്ടില്ല. നിങ്ങള്‍ വലിയ വഴികേടില്‍ തന്നെയാകുന്നു എന്ന് ഞങ്ങള്‍ പറയുകയുമാണ് ചെയ്തത്‌.",
            "verse 67:10": "ഞങ്ങള്‍ കേള്‍ക്കുകയോ ചിന്തിക്കുകയോ ചെയ്തിരുന്നെങ്കില്‍ ഞങ്ങള്‍ ജ്വലിക്കുന്ന നരകാഗ്നിയുടെ അവകാശികളുടെ കൂട്ടത്തിലാകുമായിരുന്നില്ല എന്നും അവര്‍ പറയും.",
            "verse 67:11": "അങ്ങനെ അവര്‍ തങ്ങളുടെ കുറ്റം ഏറ്റുപറയും. അപ്പോള്‍ നരകാഗ്നിയുടെ ആള്‍ക്കാര്‍ക്കു ശാപം.",
            "verse 67:12": "തീര്‍ച്ചയായും തങ്ങളുടെ രക്ഷിതാവിനെ അദൃശ്യനിലയില്‍ ഭയപ്പെടുന്നവരാരോ അവര്‍ക്ക് പാപമോചനവും വലിയ പ്രതിഫലവുമുണ്ട്‌.",
            "verse 67:13": "നിങ്ങളുടെ വാക്ക് നിങ്ങള്‍ രഹസ്യമാക്കുക. അല്ലെങ്കില്‍ പരസ്യമാക്കിക്കൊള്ളുക. തീര്‍ച്ചയായും അവന്‍ (അല്ലാഹു) ഹൃദയങ്ങളിലുള്ളത് അറിയുന്നവനാകുന്നു.",
            "verse 67:14": "സൃഷ്ടിച്ചുണ്ടാക്കിയവന്‍ (എല്ലാം) അറിയുകയില്ലേ? അവന്‍ നിഗൂഢരഹസ്യങ്ങള്‍ അറിയുന്നവനും സൂക്ഷ്മജ്ഞാനിയുമാകുന്നു.",
            "verse 67:15": "അവനാകുന്നു നിങ്ങള്‍ക്ക് വേണ്ടി ഭൂമിയെ വിധേയമാക്കി തന്നവന്‍. അതിനാല്‍ അതിന്‍റെ ചുമലുകളിലൂടെ നിങ്ങള്‍ നടക്കുകയും അവന്‍റെ ഉപജീവനത്തില്‍ നിന്ന് ഭക്ഷിക്കുകയും ചെയ്തു കൊള്ളുക. അവങ്കലേക്ക് തന്നെയാണ് ഉയിര്‍ത്തെഴുന്നേല്‍പ്‌.",
            "verse 67:16": "ആകാശത്തുള്ളവന്‍ നിങ്ങളെ ഭൂമിയില്‍ ആഴ്ത്തിക്കളയുന്നതിനെപ്പറ്റി നിങ്ങള്‍ നിര്‍ഭയരായിരിക്കുകയാണോ? അപ്പോള്‍ അത് (ഭൂമി) ഇളകിമറിഞ്ഞു കൊണ്ടിരിക്കും.",
            "verse 67:17": "അതല്ല, ആകാശത്തുള്ളവന്‍ നിങ്ങളുടെ നേരെ ഒരു ചരല്‍ വര്‍ഷം അയക്കുന്നതിനെപ്പറ്റി നിങ്ങള്‍ നിര്‍ഭയരായിരിക്കുകയാണോ? എന്‍റെ താക്കീത് എങ്ങനെയുണ്ടെന്ന് നിങ്ങള്‍ വഴിയെ അറിഞ്ഞു കൊള്ളും.",
            "verse 67:18": "തീര്‍ച്ചയായും അവര്‍ക്ക് മുമ്പുള്ളവരും നിഷേധിച്ചു തള്ളിയിട്ടുണ്ട്‌. അപ്പോള്‍ എന്‍റെ പ്രതിഷേധം എങ്ങനെയായിരുന്നു.",
            "verse 67:19": "അവര്‍ക്കു മുകളില്‍ ചിറക് വിടര്‍ത്തിക്കൊണ്ടും ചിറകു കൂട്ടിപ്പിടിച്ചു കൊണ്ടും പറക്കുന്ന പക്ഷികളുടെ നേര്‍ക്ക് അവര്‍ നോക്കിയില്ലേ? പരമകാരുണികനല്ലാതെ (മറ്റാരും) അവയെ താങ്ങി നിറുത്തുന്നില്ല. തീര്‍ച്ചയായും അവന്‍ എല്ലാകാര്യവും കണ്ടറിയുന്നവനാകുന്നു.",
            "verse 67:20": "അതല്ല പരമകാരുണികന് പുറമെ നിങ്ങളെ സഹായിക്കുവാന്‍ ഒരു പട്ടാളമായിട്ടുള്ളവന്‍ ആരുണ്ട്‌? സത്യനിഷേധികള്‍ വഞ്ചനയില്‍ അകപ്പെട്ടിരിക്കുക മാത്രമാകുന്നു.",
            "verse 67:21": "അതല്ലെങ്കില്‍ അല്ലാഹു തന്‍റെ ഉപജീവനം നിര്‍ത്തിവെച്ചാല്‍ നിങ്ങള്‍ക്ക് ഉപജീവനം നല്‍കുന്നവനായി ആരുണ്ട്‌? എങ്കിലും അവര്‍ ധിക്കാരത്തിലും വെറുപ്പിലും മുഴുകിയിരിക്കയാകുന്നു.",
            "verse 67:22": "അപ്പോള്‍, മുഖം നിലത്തു കുത്തിക്കൊണ്ട് നടക്കുന്നവനാണോ സന്‍മാര്‍ഗം പ്രാപിക്കുന്നവന്‍? അതല്ല നേരെയുള്ള പാതയിലൂടെ ശരിക്ക് നടക്കുന്നവനോ?",
            "verse 67:23": "പറയുക: അവനാണ് നിങ്ങളെ സൃഷ്ടിച്ചുണ്ടാക്കുകയും നിങ്ങള്‍ക്ക് കേള്‍വിയും കാഴ്ചകളും ഹൃദയങ്ങളും ഏര്‍പെടുത്തിത്തരികയും ചെയ്തവന്‍. കുറച്ചു മാത്രമേ നിങ്ങള്‍ നന്ദികാണിക്കുന്നുള്ളൂ.",
            "verse 67:24": "പറയുക: അവനാണ് നിങ്ങളെ ഭൂമിയില്‍ സൃഷ്ടിച്ച് വളര്‍ത്തിയവന്‍. അവങ്കലേക്കാണ് നിങ്ങള്‍ ഒരുമിച്ചുകൂട്ടപ്പെടുന്നത്‌.",
            "verse 67:25": "അവര്‍ പറയുന്നു: എപ്പോഴാണ് ഈ വാഗ്ദാനം (പുലരുന്നത്‌?) നിങ്ങള്‍ സത്യവാന്‍മാരാണെങ്കില്‍ (അതൊന്ന് പറഞ്ഞുതരൂ)",
            "verse 67:26": "പറയുക: ആ അറിവ് അല്ലാഹുവിന്‍റെ പക്കല്‍ മാത്രമാകുന്നു. ഞാന്‍ വ്യക്തമായ താക്കീതുകാരന്‍ മാത്രമാകുന്നു.",
            "verse 67:27": "അത് (താക്കീത് നല്‍കപ്പെട്ട കാര്യം) സമീപസ്ഥമായി അവര്‍ കാണുമ്പോള്‍ സത്യനിഷേധികളുടെ മുഖങ്ങള്‍ക്ക് മ്ലാനത ബാധിക്കുന്നതാണ്‌. നിങ്ങള്‍ ഏതൊന്നിനെപ്പറ്റി വാദിച്ച് കൊണ്ടിരുന്നുവോ അതാകുന്നു ഇത് എന്ന് (അവരോട്‌) പറയപ്പെടുകയും ചെയ്യും.",
            "verse 67:28": "പറയുക: നിങ്ങള്‍ ചിന്തിച്ച് നോക്കിയിട്ടുണ്ടോ? എന്നെയും എന്നോടൊപ്പമുള്ളവരെയും അല്ലാഹു നശിപ്പിക്കുകയോ അല്ലെങ്കില്‍ ഞങ്ങളോടവന്‍ കരുണ കാണിക്കുകയോ ചെയ്താല്‍ വേദനയേറിയ ശിക്ഷയില്‍ നിന്ന് സത്യനിഷേധികളെ രക്ഷിക്കാനാരുണ്ട്‌?",
            "verse 67:29": "പറയുക: അവനാകുന്നു പരമകാരുണികന്‍. അവനില്‍ ഞങ്ങള്‍ വിശ്വസിച്ചിരിക്കുന്നു. അവന്‍റെ മേല്‍ ഞങ്ങള്‍ ഭരമേല്‍പിക്കുകയും ചെയ്തിരിക്കുന്നു. എന്നാല്‍ വഴിയെ നിങ്ങള്‍ക്കറിയാം; ആരാണ് വ്യക്തമായ വഴികേടിലെന്ന്‌.",
            "verse 67:30": "പറയുക: നിങ്ങള്‍ ചിന്തിച്ച് നോക്കിയിട്ടുണ്ടോ? നിങ്ങളുടെ വെള്ളം വറ്റിപ്പോയാല്‍ ആരാണ് നിങ്ങള്‍ക്ക് ഒഴുകുന്ന ഉറവു വെള്ളം കൊണ്ട് വന്നു തരിക?"
        },
        "Norwegian": {
            "verse 67:1": "Velsignelsesrik er Han, i Hans hånd er herredømmet! Han evner alt!",
            "verse 67:2": "Han er det som skapte død og liv for å prøve dere, hvem av dere som er best i gjerninger. Han er den Mektige, den Ettergivende.",
            "verse 67:3": "Han er det som skapte syv himler lagvis. Du ser ikke i den Barmhjertiges skapning noen mangler. Blunk med øynene, ser du vel noen revner?",
            "verse 67:4": "Om du blunker med øynene to ganger, så vender ditt blikk tilbake til deg, svakt og trett.",
            "verse 67:5": "Vi har prydet den nederste himmel med bluss, og gjort dem til kastevåpen mot satanene. For dem har Vi gjort i stand Ildens straff.",
            "verse 67:6": "Dem som fornekter sin Herre, venter helvetes straff.",
            "verse 67:7": "En sørgelig skjebne! Når de kastes inn der, hører de et brøl,",
            "verse 67:8": "idet det koker opp og er nær ved å sprekke av raseri. Hver gang en flokk kastes inn i det, spør dets voktere dem: «Kom det ingen advarer til dere?»",
            "verse 67:9": "Og de svarer: «Jo, det kom en advarer til oss, men vi holdt det for løgn, og sa: ’Gud har ikke åpenbart noe! Dere er helt på villspor.’»",
            "verse 67:10": "Og de tilføyer: «Om vi hadde hørt, eller forstått,",
            "verse 67:11": "ville vi ikke vært Ildens folk.» De erkjenner sin synd. Bort med Ildens folk!",
            "verse 67:12": "De som frykter Herren i det skjulte, dem venter tilgivelse og stor lønn.",
            "verse 67:13": "Om dere holder hemmelig eller gir høylytt til kjenne det dere sier, så vet Han hva som bor i hjertene.",
            "verse 67:14": "Skulle ikke Han kjenne den Han har skapt? Han er den Uutgrunnelige, den Innsiktsfulle.",
            "verse 67:15": "Han er det som gjorde jorden underdanig for dere. Så dra rundt på dens overflate og spis av Hans gaver. Til Ham fører oppstandelsen!",
            "verse 67:16": "Kan dere være sikre på Ham som er i himmelen, at Han ikke lar jorden oppsluke dere, for se, den skjelver?",
            "verse 67:17": "Kan dere være sikre på Ham som er i Himmelen, at Han ikke sender over dere en skur av småstein, så dere får vite hva Min advarsel innebærer?",
            "verse 67:18": "De som levde før dem, kalte også sannhet for løgn, og hvordan var vel Min refselse?",
            "verse 67:19": "Har de ikke sett på fuglene over seg som brer ut sine vinger og slår dem sammen? Intet holder dem oppe, unntatt den Barmhjertige. Han er observant for alle ting.",
            "verse 67:20": "Hvem er det vel som er som en hærskare som hjelper dere, unntatt den Barmhjertige? De vantro er helt på avveie.",
            "verse 67:21": "Hvem er det vel som gir dere livets underhold, om Han holder tilbake sitt underhold? Nei, de turer frem i oppsetsighet og motvilje.",
            "verse 67:22": "Er vel den som går og faller hodekulls, best rettledet, eller den som vandrer raskt på rett vei?",
            "verse 67:23": "Si: «Han er det som har frembrakt dere og gitt dere hørsel, syn og forstand. Hvor lite dere takker!»",
            "verse 67:24": "Si: «Han er det som har spredt dere på jorden. Og til Ham vil dere bli samlet inn.»",
            "verse 67:25": "Så sier de: «Når kommer så denne trussel, om dere snakker sant?»",
            "verse 67:26": "Si: «Kunnskapen beror hos Gud! Jeg er bare en klar advarer.»",
            "verse 67:27": "Når de ser at den er nær, formørkes de vantros ansikter, og det lyder: «Dette er det dere etterlyste.»",
            "verse 67:28": "Si: «Hva synes dere, om Gud utsletter meg og dem som følger meg, eller Han viser oss nåde, hvem skal da beskytte de vantro mot en smertelig straff?»",
            "verse 67:29": "Si: «Han er den Barmhjertige! Vi tror på Ham, og på Ham forlater vi oss. Dere får snart vite hvem det er, som er klart på villstrå.»",
            "verse 67:30": "Si: «Hva ville dere synes om deres vann en morgen var sunket ned i jorden, hvem skal da bringe dere rinnende vann?»"
        },
        "Pashto": {
            "verse 67:1": "ډېر بركت والا دى هغه ذات چې خاص د هغه په لاس كې بادشاهي ده، او هغه په هر شي باندې ښه قادر دى",
            "verse 67:2": "هغه ذات چې مرګ او ژوند يې پیدا كړى دى، د دې لپاره چې تاسو وازمايي چې په تاسو كې د عمل په لحاظ كوم یو ډېر ښه دى۔ او هم دى ښه غالب، ډېر بخښونكى دى",
            "verse 67:3": "هغه (الله) چې اوه اسمانونه يې طبقې طبقې (لاندې باندې) پیدا كړي دي، ته به د رحمٰن په پیداكونه كې هېڅ خلل (او فرق)، ونه وینې۔، پس سترګې بېرته راواړه۔، ایا ته كوم څیرې والى (او چاود) وینې",
            "verse 67:4": "بیا سترګې راواړه دوه ځلې۔، تا ته به سترګې بېرته راوګرځي، چې ذلیله به وي، په دې حال كې چې ستړې ستومانه به وي",
            "verse 67:5": "او یقینًا یقینًا مونږ دا تر ټولو نژدې اسمان په ډېوو (ستوریو) سره ښايسته كړى دى او مونږ دغه (ډېوې، یعنې ستوري) د شیطانانو د وېشتلو لپاره ذریعې جوړې كړې دي او مونږ د دوى لپاره ډېر سوځوونكى عذاب تیار كړى دى",
            "verse 67:6": "او د هغو كسانو لپاره چې په خپل رب باندې كافران شوي دي د جهنم عذاب دى او هغه د ورتلو بد ځاى دى",
            "verse 67:7": "كله چې دوى په ده كې وغورځول شي دوى به د ده (لكه د خر) بد اواز واوري، په داسې حال كې چې دا به خوټكېږي",
            "verse 67:8": "نژدې به وي چې دى له غصې نه ټوټې شي، هر وارې چې په ده كې یوه ډله وغورځول شي (نو) له دوى نه به د دغه (دوزخ) څوكیداران پوښتنه وكړي چې ایا تاسو ته وېروونكى (پېغمبر) نه و راغلى؟",
            "verse 67:9": "دوى به وايي: ولې نه! یقینًا مونږ ته وېروونكى راغلى و، پس مونږ (د هغه) تكذیب وكړ (هغه مو دروغجن وګاڼه) او مونږ وویل چې الله هېڅ شى هم نه دى نازل كړى۔، نه یئ تاسو مګر په ډېره لویه ګمراهۍ كې",
            "verse 67:10": "او دوى به وايي: كه چېرې مونږ اورېدل كولى، یا مو له عقل نه كار اخيستلى (نو) مونږ به (نن) د دوزخ په ملګرو كې نه وى",
            "verse 67:11": "نو دوى د خپلو ګناهونو اقرار وكړ، نو د دوزخ والاو لپاره (د الله له رحمت نه) لرې والى دى",
            "verse 67:12": "بېشكه هغه كسان چې له خپل رب نه په غیبو (نالېدلو) سره وېرېږي، د دوى لپاره مغفرت او ډېر لوى اجر دى",
            "verse 67:13": "او تاسو خپله خبره پټه وكړئ، یا تاسو هغه ښكاره وكړئ، بېشكه هغه (الله) د سینو په پټو خبرو هم ښه عالم دى",
            "verse 67:14": "ایا هغه ذات به نه پوهېږي چې يې (هر څه) پیدا كړي دي (ولې نه!) او هم دى ډېر باریك بین، ښه خبردار دى",
            "verse 67:15": "دى همغه ذات دى چې تاسو لپاره يې ځمكه تابع ګرځولې ده، نو تاسو د دې په اوږو (اطرافو، لارو) كې ګرځئ او د دغه (الله) له رزق نه خورئ او خاص ده ته (ستاسو) بیا ژوندي راپورته كېدل دي",
            "verse 67:16": "ایا تاسو په امن (او بې وېرې) شوي يئ له هغه ذات نه چې په اسمان كې دى، له دې نه چې هغه تاسو په ځمكه كې ښكته ننباسي، بیا دغه (ځمكه) ناڅاپه لړزان شروع كړي",
            "verse 67:17": "ایا تاسو له هغه ذات، نه چې په اسمان كې دى په امن (او بې وېرې) شوي یئ، له دې نه چې پر تاسو باندې د كاڼو باران راخوشې كړي، نو چې تاسو به ژر پوه شئ چې زما وېرول څنګه دي",
            "verse 67:18": "او یقینًا یقینًا هغو كسانو (د خپلو رسولانو) تكذیب كړى و چې له دغو خلقو نه مخكې وو، نو زما انكار او عذاب څنګه وو؟",
            "verse 67:19": "او ایا دوى د خپل (سر) له پاسه مرغانو ته نه دي كتلي، په داسې حال كې چې خپل وزرونه پرانستونكي وي او ټولوي يې، دوى (له پرېوتلو نه) نه راټینګوي مګر رحمن ذات، بېشكه هغه هر شي لره ښه ليدونكى دى",
            "verse 67:20": "ایا څوك دى هغه كس (اى مشركانو!) چې هغه ستاسو لپاره لښكر دى چې له رحمٰن نه غیر به ستاسو مدد وكړي، كافران نه دي مګر په دوكه (او غولېدلو) كې",
            "verse 67:21": "ایا څوك دى هغه ذات چې تاسو ته به روزي دركړي كه چېرې هغه (الله) خپل رزق بند كړي۔ بلكې دوى په سركشۍ او تېښته كې ننوتلي (او پاخه شوي) دي",
            "verse 67:22": "ایا نو هغه څوك چې په خپل مخ باندې نسكور ځي ښه لار موندونكى دى، يا هغه څوك چې په نېغه لار سم برابر روان دى؟",
            "verse 67:23": "ته (دوى ته) ووایه: دغه (الله) هغه ذات دى چې تاسو يې پیدا كړي یئ او تاسو لپاره يې غوږونه او سترګې او زړونه پیدا كړي دي۔ (خو) تاسو ډېر لږ شكر وباسئ",
            "verse 67:24": "ته (دوى ته) ووایه چې دغه (الله) هغه ذات دى چې تاسو يې په ځمكه كې خواره كړي یئ او خاص ده ته به تاسو ورجمع كولى شئ",
            "verse 67:25": "او دوى وايي چې دغه (د قیامت) وعده به كله وي، كه تاسو رښتیني یئ؟",
            "verse 67:26": "ته (دوى ته) ووایه چې بېشكه (د قیامت) علم خو يواځې الله ته دى او بېشكه زه خو يواځې ښكاره وېروونكى یم",
            "verse 67:27": "نو كله چې دوى دغه (عذاب) ډېر نژدې وویني (نو) د هغو كسانو مخونه به بدشكله (او تور) شي چې كافران شوي وو او وبه ویل شي چې دا هغه (عذاب) دى چې تاسو به دا ژر غوښته",
            "verse 67:28": "(اى نبي!) ته (دوى ته) ووایه: تاسو ما ته خبر راكړئ! كه چېرې الله ما او هغه كسان چې زما سره دي، هلاك (او مړه) كړي، یا پر مونږ رحم وكړي، نو څوك دى چې كافران به له ډېر دردونكي عذاب نه بچ كړي؟",
            "verse 67:29": "ته (دوى ته) ووایه: هم دغه (الله) رحمٰن دى، مونږ په ده ایمان راوړى دى او مونږ خاص په ده باندې توكل كړى دى، نو تاسو به ژر پوه شئ چې هغه څوك دى چې په ښكاره ګمراهۍ كې دى",
            "verse 67:30": "ته (دوى ته) ووایه چې تاسو ما ته خبر راكړئ! كه چېرې ستاسو اوبه (په ځمكه كې) ډېرې ښكته لاړې شي۔، نو څوك دى چې تاسو ته به روانې اوبه راولي؟"
        },
        "Persian": {
            "verse 67:1": "بزرگوار و متعالى است خداوندى كه فرمانروايى به دست اوست و او بر هر چيزى تواناست.",
            "verse 67:2": "آن كه مرگ و زندگى را بيافريد، تا بيازمايدتان كه كدام يك از شما به عمل نيكوتر است و اوست پيروزمند و آمرزنده.",
            "verse 67:3": "آن كه هفت آسمان طبقه طبقه را بيافريد. در آفرينش خداى رحمان هيچ خلل و بى‌نظمى نمى‌بينى. پس بار ديگر نظركن، آيا در آسمان شكافى مى‌بينى؟",
            "verse 67:4": "بار ديگر نيز چشم باز كن و بنگر. نگاه تو خسته و درمانده به نزد تو باز خواهد گشت.",
            "verse 67:5": "ما آسمان فرودين را به چراغهايى بياراستيم و آن چراغها را وسيله راندن شياطين گردانيديم و برايشان شكنجه آتش سوزان آماده كرده‌ايم.",
            "verse 67:6": "و براى كسانى كه به پروردگارشان كافر شده‌اند عذاب جهنم باشد و جهنم بد سرانجامى است.",
            "verse 67:7": "چون در جهنم افكنده شوند، به جوش آيد و بانگ زشتش را بشنوند،",
            "verse 67:8": "نزديك است كه از خشم پاره‌پاره شود. و چون فوجى را در آن افكنند، خازنانش گويندشان: آيا شما را بيم‌دهنده‌اى نيامد؟",
            "verse 67:9": "گويند: چرا، بيم‌دهنده آمد ولى تكذيبش كرديم و گفتيم: خدا هيچ چيز نازل نكرده است؛ شما در گمراهى بزرگى هستيد.",
            "verse 67:10": "و مى‌گويند: اگر ما مى‌شنيديم يا تعقل مى‌كرديم، اهل اين آتش سوزنده نمى‌بوديم.",
            "verse 67:11": "پس به گناه خود اعتراف مى‌كنند. اى لعنت باد بر آنها كه اهل آتش سوزنده‌اند.",
            "verse 67:12": "براى كسانى كه ناديده از پروردگارشان مى‌ترسند، آمرزش و مزد فراوان است.",
            "verse 67:13": "چه به راز سخن گوييد و چه آشكارا، او به هر چه در دلها مى‌گذرد داناست.",
            "verse 67:14": "آيا آن كه آفريده نمى‌داند؟ حال آنكه او باريك‌بين و آگاه است.",
            "verse 67:15": "اوست كه زمين را رام شما گردانيد. پس بر روى آن سير كنيد، و از رزق خدا بخوريد. چون از قبر بيرون آييد به سوى او مى‌رويد.",
            "verse 67:16": "آيا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه زمين را به لرزش درآورد و زمين شما را در خود فرو برد؟",
            "verse 67:17": "يا از آن كه در آسمان است ايمن نشسته‌ايد كه ناگاه بادى همراه با سنگريزه بر سر شما فرستد؟ به زودى خواهيد دانست كه بيم‌دادن من چگونه است.",
            "verse 67:18": "هر آينه كسانى كه پيش از آنها بودند، پيامبران را تكذيب كردند. پس عذاب من چگونه بود.",
            "verse 67:19": "آيا پرندگانى را كه بال گشوده يا بال فراهم‌كشيده بر فراز سرشان در پروازند، نديده‌اند؟ آنها را جز خداى رحمان كسى در هوا نگاه نتواند داشت. اوست كه به همه چيز بيناست.",
            "verse 67:20": "آيا آنان كه ياران شمايند توانند در برابر خدا ياريتان كنند؟ كافران در فريبى بيش نيستند.",
            "verse 67:21": "آيا كيست آن كه به شما روزى دهد اگر او روزى خويش باز دارد؟ نه، در سركشى و دورى از حق لجاج مى‌ورزند.",
            "verse 67:22": "آيا آن كس كه نگونسار بر روى افتاده راه مى‌رود، هدايت يافته‌تر است يا آن كه بر پاى ايستاده و بر راه راست مى‌رود؟",
            "verse 67:23": "بگو: اوست كه شما را آفريده است و گوش و چشم و دل داده است. چه اندك سپاس مى‌گزاريد.",
            "verse 67:24": "بگو: اوست كه شما را در زمين آفريد و در قيامت نزد او گرد آورده مى‌شويد.",
            "verse 67:25": "مى‌گويند: اگر راست مى‌گوييد، اين وعده چه وقت فرا مى‌رسد؟",
            "verse 67:26": "بگو: علم آن نزد خداست و من بيم‌دهنده‌اى آشكارم.",
            "verse 67:27": "كافران چون نزديكش بنگرند، چهره‌شان گرفته شود. و به آنها گفته مى‌شود: اين است آنچه باطلش مى‌خوانديد.",
            "verse 67:28": "بگو: گيرم كه خدا مرا و همراهانم را هلاك كند يا بر ما رحمت آورد، چه كسى كافران را از عذاب دردآور مى‌رهاند؟",
            "verse 67:29": "بگو: او خداى رحمان است. به او ايمان آورديم و بر او توكل كرديم. و زودا كه خواهيد دانست چه كسى در گمراهى آشكار است.",
            "verse 67:30": "بگو: اگر آبتان در زمين فرو رود، چه كسى شما را آب روان خواهد داد؟"
        },
        "Polish": {
            "verse 67:1": "Błogosławiony niech będzie Ten, w którego ręku jest królestwo - On jest nad każdą rzeczą wszechwładny! -",
            "verse 67:2": "Który stworzył śmierć i życie, aby was doświadczyć, aby wiedzieć, który z was jest lepszy w działaniu; - On jest Potężny, Przebaczający! -",
            "verse 67:3": "Stworzył siedem niebios, ułożonych warstwami. Nie widzisz w stworzeniu Miłosiernego żadnej dysproporcji. Zwróć więc swoje spojrzenie: czy zobaczysz jakąś skazę?",
            "verse 67:4": "Następnie zwróć swoje spojrzenie jeszcze dwa razy: powróci ono do ciebie upokorzone i utrudzone.",
            "verse 67:5": "My ozdobiliśmy niebo najbliższe lampami i uczyniliśmy je pociskami do rażenia szatanów; i przygotowaliśmy dla nich cierpienie płomienia palącego.",
            "verse 67:6": "A dla tych, którzy nie uwierzyli w swojego Pana - cierpienie Gehenny. Jakże to nieszczęsne miejsce przybycia!",
            "verse 67:7": "Kiedy oni zostaną tam wrzuceni, posłyszą jej ryk, ona się bowiem gotuje",
            "verse 67:8": "I omal nie wybuchnie ze wściekłości. Za każdym razem, gdy wrzucają do niej czeredę, zapytują ich strażnicy Gehenny: \"Czyż nie przychodził do was ostrzegający?\"",
            "verse 67:9": "Oni mówią: \"Tak! Przychodził do nas ostrzegający, lecz my uznaliśmy go za kłamcę i powiedzieliśmy: Bóg nie zesłał niczego; jesteście jedynie w wielkim błędzie\"",
            "verse 67:10": "I jeszcze powiedzieli: \"Gdybyśmy posłuchali albo zrozumieli, to nie bylibyśmy wśród towarzyszy płomienia palącego.\"",
            "verse 67:11": "I oni przyznali się do swojego grzechu. Precz więc, towarzysze płomienia palącego!",
            "verse 67:12": "Zaprawdę, ci, którzy się obawiają swego Pana w tym, co niepoznawalne - będą mieli przebaczenie i wielką nagrodę.",
            "verse 67:13": "Trzymajcie w tajemnicy wasze słowa albo głoście je jawnie; zaprawdę, On wie dobrze, co się kryje w waszych sercach!",
            "verse 67:14": "Czyż nie będzie wiedział Ten, który stworzył? On jest Przenikliwy, Świadomy!",
            "verse 67:15": "On, który uczynił dla was ziemię całkowicie poddaną. Przechadzajcie się więc po jej szlakach i jedzcie z tego, czego wam Bóg udziela; ku Niemu będzie zmartwychwstanie!",
            "verse 67:16": "Czy, jesteście pewni, że Ten, który jest w niebie, nie sprawi, żeby ziemia was pochłonęła, bo przecież ona drży?",
            "verse 67:17": "Czy jesteście pewni, że Ten, który jest w niebie, nie pośle przeciwko wam huraganu kamieni? Wtedy poznacie, jakie jest Moje ostrzeżenie.",
            "verse 67:18": "Zadawali kłam już ci, którzy byli przed nimi. I jakież było Moje oburzenie!",
            "verse 67:19": "Czy oni nie widzieli ponad sobą ptaków, jak składają i rozkładają skrzydła? Nikt ich nie podtrzymuje, tylko Miłosierny. On widzi dobrze każdą rzecz!",
            "verse 67:20": "Gdzie jest taki, który niczym wojsko wesprze was, oprócz Miłosiernego? Niewierni są jedynie w zaślepieniu.",
            "verse 67:21": "Albo gdzie jest ten, kto was zaopatrzy, jeśli On powstrzyma Swoje zaopatrzenie? Tak! Oni uporczywie trwają w dumie i krnąbrności.",
            "verse 67:22": "Czy ten, kto chodzi z twarzą opuszczoną ku ziemi, jest na lepszej drodze, czy ten, który chodzi równo po drodze prostej?",
            "verse 67:23": "Powiedz: \"To On spowodował, że powstaliście, dał wam słuch, wzrok i serca. Jak mało jesteście wdzięczni!\"",
            "verse 67:24": "Powiedz: \"To On rozproszył was po ziemi i do Niego będziecie sprowadzeni.\"",
            "verse 67:25": "Oni powiedzą: \"Kiedy spełni się ta obietnica, jeśli jesteście prawdomówni?\"",
            "verse 67:26": "Powiedz: \"Wiedza jest tylko u Boga! Ja jestem tylko jawnie ostrzegającym.\"",
            "verse 67:27": "Ale kiedy ją zobaczą z bliska, zasępią się twarze tych, którzy nie uwierzyli. Powiedzą im: \"Oto czegoście się domagali!\"",
            "verse 67:28": "Powiedz: \"Jak wam się wydaje? Jeśli zniszczy mnie Bóg, i tych, którzy są ze mną, lub też zmiłuje się nad nami, to kto obroni niewiernych od kary bolesnej?\"",
            "verse 67:29": "Powiedz: \"On jest Miłosierny! Uwierzyliśmy w Niego i zaufaliśmy Mu! Wy zaś niebawem się dowiecie, kto jest w błędzie jawnym.\"",
            "verse 67:30": "Powiedz: \"Jak wam się wydaje? Jeśli rankiem zniknie wam woda w głębi ziemi, to kto wam dostarczy wtedy wody źródlanej?\""
        },
        "Portuguese": {
            "verse 67:1": "Bendito seja Aquele em Cujas mãos está a Soberania, e que é Onipotente;",
            "verse 67:2": "Que criou a vida e a morte, para testar quem de vós melhor se comporta - porque é o Poderoso, o Indulgentíssimo -,",
            "verse 67:3": "Que criou sete céus sobrepostos; tu não acharás imperfeição alguma na criação do Clemente! Volta, pois, a olhar! Vês, acaso, alguma fenda?",
            "verse 67:4": "Novamente, olha e torna a fazê-lo, e o teu olhar voltará a ti, confuso e fatigado.",
            "verse 67:5": "E adornamos o céu aparente com lâmpadas, e lhes destinamos apedrejarem os demônios, e preparamos, para eles o suplício do fogo infernal.",
            "verse 67:6": "Bem como a pena do inferno, para aqueles que negam o seu Senhor. Que funesto destino!",
            "verse 67:7": "Quando nele forem precipitados, ouvi-lo-ão rugir, borbulhante,",
            "verse 67:8": "A ponto de estalar de fúria. Cada vez que um grupo (de réprobos) for precipitado nele, os seus guardiães lhes perguntarão. Acaso, não vos foi enviado nenhum admoestador?",
            "verse 67:9": "Dirão: Sim! Foi-nos enviado um admoestador, porém desmentimo-lo, dizendo: Deus nada revelou! Estais em grave erro!",
            "verse 67:10": "E dirão (mais): Se tivéssemos escutado o meditado, não estaríamos entre os condenados ao tártaro!",
            "verse 67:11": "E confessarão os seus pecados; anátema aos condenados ao tártaro!",
            "verse 67:12": "Em verdade aqueles que temerem intimamente o seu Senhor obterão indulgência e uma grande recompensa.",
            "verse 67:13": "Quer faleis privativa ou publicamente, Ele é Conhecedor das intimidades dos corações.",
            "verse 67:14": "Como não haveria de conhecê-las o Criados, sendo Ele o Onisciente, o Sutilíssimo?",
            "verse 67:15": "Ele foi Quem vos fez a terra manejável. Percorrei-a pois, por todos os seus quadrantes e desfrutai das Suas mercês; a Ele será o retorno!",
            "verse 67:16": "Estais, acaso, seguros de que Aquele que está no céu não vos fará ser tragados pela terra? Ei-la que treme!",
            "verse 67:17": "Ou estais seguros de que Aquele que está no céu não desencadeará um violento furacão sobre vós? Logo sabereis como é a Nossa advertência.",
            "verse 67:18": "Em verdade, os seus antepassados desmentiram os Meus enviados. Porém, que terrível foi a Minha rejeição!",
            "verse 67:19": "Não reparam, acaso, nos pássaros que pairam sobre eles, protraindo e recolhendo as suas asas? Ninguém os mantém no espaço, senão o Clemente, porque é Onividente.",
            "verse 67:20": "Ou então, qual é o exército com que contais para socorrer-vos, em vez do Clemente? Em verdade, os incrédulos estão grandemente iludidos.",
            "verse 67:21": "Ou então, quem será que os sustentará se Ele retiver as Suas mercês? Não obstante, obstinam-se na perfídia e no extravio.",
            "verse 67:22": "Quem está melhor encaminhado: o que anda, vacilante, pela tortuosidade, ou quem anda, altaneiro, pela senda reta?",
            "verse 67:23": "Dize-lhes: Foi Ele Quem vos criou e vos dotou de ouvidos, de vistas e de faculdades. Quão pouco Lhe agradeceis!",
            "verse 67:24": "Dize-lhes (mais): Foi Ele Quem vos multiplicou, na terra, e ante Ele sereis congregados.",
            "verse 67:25": "Porém, perguntaram: Quando se cumprirá tal promessa? Dizei-nos, se estais certos.",
            "verse 67:26": "Responde-lhes: Só Deus o sabe, e eu sou unicamente um admoestador elucidante.",
            "verse 67:27": "Mas, quando o virem (o castigo) de perto, os rostos dos incrédulos se ensombrecerão e lhes será dito: Aqui tendes o que pedíeis!",
            "verse 67:28": "Dize-lhes: Se Deus me fizesse perecer, juntamente com os meus seguidores ou se se apiedasse de nós, quem livraria os incrédulos de um doloroso castigo?",
            "verse 67:29": "Dize-lhes (mais): Ele é o Clemente, no Qual cremos e ao Qual nos encomendamos. Logo sabereis quem está em erro evidente!",
            "verse 67:30": "Dize-lhes (ainda): Que vos parece? Se a vossa água, ao amanhecer, tivesse sido toda absorvida (pela terra), quem faria manar água potável para vós?"
        },
        "Punjabi": {
            "verse 67:1": "ਉਹ ਬੜਾ ਬਰਕਤ ਵਾਲਾ ਹੈ, ਜਿਸ ਦੇ ਹੱਥ ਵਿਚ ਬਾਦਸ਼ਾਹੀ ਹੈ ਅਤੇ ਉਹ ਹਰ ਚੀਜ਼ ਦੇ ਸਮਰੱਥ ਹੈ।",
            "verse 67:2": "ਜਿਸ ਨੇ ਮੋਤ ਅਤੇ ਜੀਵਨ ਨੂੰ ਪੈਦਾ ਕੀਤਾ। ਤਾਂ ਕਿ ਉਹ ਤੁਹਾਨੂੰ ਪਰਖੇ ਕਿ ਤੁਹਾਡੇ ਵਿਚੋਂ ਕੌਣ ਚੰਗੇ ਕੰਮ ਕਰਦਾ ਹੈ। ਉਹ ਸ਼ਕਤੀਸ਼ਾਲੀ ਹੈ, ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਹੈ।",
            "verse 67:3": "ਜਿਸ ਨੇ ਉੱਪਰ ਥੱਲੇ ਸੱਤ ਅਸਮਾਨ ਬਣਾਏ। ਤੁਸੀਂ ਰਹਿਮਾਨ ਦੀ ਸਿਰਜਨਾ ਵਿਚੋਂ ਕੋਈ ਦੋਸ਼ ਨਹੀਂ ਦੇਖੋਗੇ। ਫਿਰ ਨਜ਼ਰ ਲਾ ਕੇ ਵੇਖ ਲਵੋ, ਕਿਤੇ ਤੁਹਾਨੂੰ ਕੋਈ ਵਿਗਾੜ ਦਿਖਾਈ ਦਿੰਦਾ ਹੈ।",
            "verse 67:4": "ਫਿਰ ਬਾਰ ਬਾਰ ਨਜ਼ਰਾਂ ਲਾ ਕੇ ਦੇਖ ਲਵੋ, ਨਜ਼ਰਾਂ ਅਸਫ਼ਲ ਹੋ ਕੇ ਥੱਕ ਕੇ ਤੁਹਾਡੇ ਵੱਲ ਵਾਪਿਸ ਆ ਜਾਣਗੀਆਂ।",
            "verse 67:5": "ਅਤੇ ਅਸੀਂ ਨੇੜੇ ਦੇ ਆਕਾਸ਼ ਨੂੰ ਦੀਵਿਆਂ ਨਾਲ ਸਜਾਇਆ ਹੈ। ਅਤੇ ਅਸੀਂ ਇਨ੍ਹਾਂ ਨੂੰ ਸੈਤਾਨਾਂ ਨੂੰ ਮਾਰਨ ਦਾ ਜ਼ਰੀਆ ਬਣਾਇਆ ਹੈ ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਲਈ ਨਰਕ ਦੀ ਸਜ਼ਾ ਤਿਆਰ ਕਰ ਰੱਖੀ ਹੈ।",
            "verse 67:6": "ਅਤੇ ਜਿਨ੍ਹਾਂ ਲੋਕਾਂ ਨੇ ਆਪਣੇ ਰੱਬ ਨੂੰ ਝੁਠਲਾਇਆ, ਉਨ੍ਹਾਂ ਲਈ ਨਰਕ ਦੀ ਸਜ਼ਾ ਹੈ ਅਤੇ ਇਹ ਬੂਰਾ ਟਿਕਾਣਾ ਹੈ।",
            "verse 67:7": "ਜਦੋਂ ਉਹ ਉਸ ਵਿਚ ਸੁੱਟੇ ਜਾਣਗੇ, ਤਾਂ ਉਹ ਉਸ ਨਰਕ ਦੀਆਂ ਚੀਕਾਂ ਸੁਨਣਗੇ।",
            "verse 67:8": "ਅਤੇ ਉਹ (ਜੋਸ਼ ਨਾਲ) ਉਬਲਦੀ ਹੋਵੇਗੀ ਇਉਂ ਲੱਗੇਗਾ ਜਿਵੇਂ ਉਹ ਗੁੱਸੇ ਨਾਲ ਪਾਟ ਜਾਵੇਗੀ। ਜਦੋਂ ਉਸ ਵਿਚ ਕੋਈ ਗਰੋਹ ਸੁਟਿਆ ਜਾਵੇਗਾ, ਤਾਂ ਨਰਕ ਦੇ ਪਹਿਰੇਦਾਰ ਉਨ੍ਹਾਂ ਨੂੰ ਪੁੱਛਣਗੇ ਕਿ ਕੀ ਤੁਹਾਡੇ ਕੋਲ ਕੋਈ ਡਰਾਉਣ ਵਾਲਾ (ਸਮਝਾਉਣ ਵਾਲਾ) ਨਹੀਂ ਆਇਆ ਸੀ",
            "verse 67:9": "ਉਹ ਆਖਣਗੇ ਕਿ ਹਾਂ, ਸਾਡੇ ਕੋਲ ਡਰਾਉਣ ਵਾਲਾ ਆਇਆ ਸੀ। ਫਿਰ ਅਸੀਂ ਉਸ ਦੀ ਗੱਲ ਮੰਨਣ ਤੋਂ ਇਨਕਾਰ ਕਰ ਦਿੱਤਾ। ਅਤੇ ਅਸੀਂ ਕਿਹਾ ਕਿ ਅੱਲਾਹ ਨੇ ਕੋਈ ਚੀਜ਼ ਨਹੀਂ ਉਤਾਰੀ। ਤੁਸੀਂ ਲੋਕ ਤਾਂ ਭਾਰੀ ਕੁਰਾਹੇ ਪਏ ਹੋਏ ਹੋ।",
            "verse 67:10": "ਅਤੇ ਉਹ ਆਖਣਗੇ ਕਿ ਜੇਕਰ ਅਸੀ ਸੁਣਦੇ ਜਾਂ ਸਮਝਦੇ ਤਾਂ ਅਸੀਂ ਨਰਕ ਵਾਲਿਆਂ ਵਿਚੋਂ’ ਨਾ ਹੁੰਦੇ।",
            "verse 67:11": "ਸੋ ਉਹ ਆਪਣੇ ਪਾਪਾਂ ਨੂੰ ਸਵੀਕਾਰ ਕਰਨਗੇ। ਤਾਂ ਲਾਹਣਤ ਹੋਵੇ ਨਰਕ ਵਾਲਿਆਂ ਤੇ।",
            "verse 67:12": "ਜਿਹੜੇ ਲੋਕ ਬਿਨ੍ਹਾਂ ਦੇਖਿਆਂ ਆਪਣੇ ਰੱਬ ਤੋਂ ਡਰਦੇ ਹਨ, ਉਨ੍ਹਾਂ ਲਈ ਮੁਆਫ਼ੀ ਅਤੇ ਵੱਡਾ ਬਦਲਾ ਹੈ।",
            "verse 67:13": "ਅਤੇ ਤੁਸੀਂ ਆਪਣੀ ਗੱਲ ਮਨ ਵਿਚ ਆਖੋ ਜਾਂ ਮੂੰਹੋਂ ਬੋਲ ਕੇ ਆਖੋਂ, ਉਹ ਦਿਲਾਂ ਦੀਆਂ ਗੱਲਾਂ ਜਾਣਦਾ ਹੈ।",
            "verse 67:14": "ਕੀ ਉਹ ਨਾ ਜਾਣਦਾ ਹੋਵੇਗਾ, ਜਿਸ ਨੇ (ਸਭ ਕੁਝ) ਪੈਦਾ ਕੀਤਾ ਹੈ। ਉਹ ਹਰ ਰਾਜ਼ ਜਾਣਨ ਵਾਲਾ ਅਤੇ (ਹਰ ਤਰ੍ਹਾਂ ਦੀ) ਖ਼ਬਰ ਰੱਖਣ ਵਾਲਾ ਹੈ।",
            "verse 67:15": "ਉਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਧਰਤੀ ਨੂੰ ਤੁਹਾਡੇ ਲਈ ਬਰਾਬਰ ਕਰ ਦਿੱਤਾ ਤਾਂ ਕਿ ਤੁਸੀ ਉਸ ਦੇ ਰਾਹਾਂ ਤੇ ਤੁਰੋ ਅਤੇ ਉਸ (ਅੱਲਾਹ) ਦੇ ਦਿੱਤੇ ਰਿਜ਼ਕ ਵਿਚੋਂ ਖਾਉ ਅਤੇ ਉਸ ਵੱਲ ਹੀ ਵਾਪਿਸ ਮੁੜਨਾ ਹੈ।",
            "verse 67:16": "ਕੀ ਤੁਸੀਂ ਉਸ ਤੋਂ ਬੇ-ਫ਼ਿਕਰੇ ਹੋ ਗਏ ਹੋ। ਜਿਹੜਾਂ ਆਕਾਸ਼ਾਂ ਵਿਚ ਹੈ ਕਿ ਤੁਹਾਨੂੰ ਧਰਤੀ ਵਿਚ ਧੱਸਾ ਦੇਵੇ ਫਿਰ ਉਹ ਕੰਬਣ ਲੱਗੇ।",
            "verse 67:17": "ਕੀ ਤੁਸੀਂ ਉਸ ਤੋਂ’ ਬੇ-ਫਿਕਰੇ ਹੋ ਗਏ ਹੋ ਜਿਹੜਾ ਆਕਾਸ਼ ਵਿਚ ਹੈ, ਕਿ ਉਹ ਤੁਹਾਡੇ ਤੇ ਪੱਥਰਾ ਕਰ ਦੇਣ ਵਾਲੀ ਹਵਾ ਭੇਜ ਦੇਵੇ। ਫਿਰ ਤੁਸੀਂ ਸਮਝ ਲਵੌਗੇ ਕਿ ਮੇਰਾ ਭੈਅ-ਭੀਤ ਕਰਨਾ ਕਿਹੋ ਜਿਹਾ ਹੈ।",
            "verse 67:18": "ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਝੁਠਲਾਇਆ, ਜਿਹੜੇ ਉਨ੍ਹਾਂ ਤੋਂ ਪਹਿਲਾਂ ਸਨ। ਤਾਂ ਕਿਹੋ ਜਿਹੀ ਹੋਈ ਮੇਰੀ ਫਿਟਕਾਰ।",
            "verse 67:19": "ਕੀ ਉਨ੍ਹਾਂ ਪੰਛੀਆਂ ਨੂੰ ਆਪਣੇ ਉੱਤੇ ਖੰਭ ਫੈਲਾਉਂਦੇ ਨਹੀਂ ਦੇਖਿਆ। ਅਤੇ ਉਹ ਉਨ੍ਹਾਂ (ਖੰਭਾਂ) ਨੂੰ ਸਮੇਟ ਵੀ ਲੈਂਦੇ ਹਨ। ਰਹਿਮਾਨ ਤੋਂ ਬਿਨਾ ਕੋਈ ਨਹੀਂ ਜਿਹੜਾ ਉਨ੍ਹਾਂ ਨੂੰ ਥੰਮ ਕੇ ਰੱਖਦਾ ਹੋਵੇ। ਬੇਸ਼ੱਕ ਉਹ ਹਰ ਚੀਜ਼ ਨੂੰ ਦੇਖ ਰਿਹਾ ਹੈ।",
            "verse 67:20": "ਭਲਾ ਕਿਹੜਾ ਹੈ ਜਿਹੜਾ ਤੁਹਾਡੀ ਫੌਜ ਬਣਾ ਕੇ ਰਹਿਮਾਨ ਦੇ ਮੁਕਾਬਲੇ ਤੁਹਾਡੀ ਮਦਦ ਕਰੇ?ਇਨਕਾਰ ਕਰਨ ਵਾਲੇ ਭੁਲੇਖੇ ਵਿਚ ਪਏ ਹੋਏ ਹਨ।",
            "verse 67:21": "ਭਲਾ ਕਿਹੜਾ ਹੈ ਜਿਹੜਾ ਤੁਹਾਨੂੰ ਰਿਜ਼ਕ ਦੇਵੇ, ਜਦੋਂ ਅੱਲਾਹ ਨੇ ਰਿਜ਼ਕ ਨੂੰ ਰੋਕ ਰੱਖਿਆ ਹੋਵੇ। ਸਗੋਂ ਇਹ ਬਗ਼ਾਵਤ ਅਤੇ ਈਰਖਾ ਵਿਚ ਫਸੇ ਪਏ ਹਨ।",
            "verse 67:22": "ਕੀ ਜਿਹੜਾ ਬੰਦਾ ਮੂੰਧੇ-ਮੂੰਹ ਤੁਰ ਰਿਹਾ ਹੈ, ਉਹ ਜ਼ਿਆਦਾ ਸੱਚਾ ਰਾਹ ਪ੍ਰਾਪਤ ਕਰਨ ਵਾਲਾ ਹੈ ਜਾਂ ਉਹ ਬੰਦਾਂ ਜਿਹੜਾ ਇੱਕ ਸਿੱਧੇ ਅਤੇ ਠੀਕ ਰਾਹ ਤੇ ਚੱਲ ਰਿਹਾ ਹੈ।",
            "verse 67:23": "ਆਸਖੋਂ, ਕਿ ਉਹ ਹੀ ਹੈ ਜਿਸ ਨੇ ਤੁਹਾਨੂੰ ਪੈਦਾ ਕੀਤਾ ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਅੱਖਾਂ, ਕੰਨ ਅਤੇ ਦਿਲ ਬਣਾਏ। ਤੁਸੀਂ ਲੋਕ ਬਹੁਤ ਘੱਟ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹੁੰਦੇ ਹੋ।",
            "verse 67:24": "ਆਖੋ, ਕਿ ਉਹ ਹੀ ਹੈ, ਜਿਸ ਨੇ ਤੁਹਾਨੂੰ ਧਰਤੀ ਤੇ ਫੈਲਾਇਆ ਅਤੇ ਤੁਸੀਂ ਉਸੇ ਵੱਲ ਹੀ ਇੱਕਠੇ ਕੀਤੇ ਜਾਵੋਗੇ।",
            "verse 67:25": "ਅਤੇ ਉਹ ਆਖਦੇ ਹਨ ਕਿ ਇਹ ਵਾਅਦਾ ਕਦੋਂ ਪੂਰਾ ਹੋਵੇਗਾ, ਜੇਕਰ ਤੁਸੀਂ ਸੱਚੇ ਹੋ।",
            "verse 67:26": "ਆਖੋ, ਕਿ ਇਹ ਗਿਆਨ ਅੱਲਾਹ ਦੇ ਕੌਲ ਹੈ ਅਤੇ ਮੈਂ ਖੁੱਲ੍ਹੇ ਤੋਰ ਤੇ ਡਰਾਉਣ ਵਾਲਾ ਹਾਂ।",
            "verse 67:27": "ਸੋਂ ਜਦੋਂ ਉਹ ਉਸ ਨੂੰ ਨੇੜੇ ਆਉਂਦਾ ਹੋਇਆ ਦੇਖਣਗੇ ਤਾਂ ਉਨ੍ਹਾਂ ਦੇ ਚਿਹਰੇ ਵਿਗੜ ਜਾਣਗੇ, ਜਿਨ੍ਹਾਂ ਨੇ ਅਵੱਗਿਆ ਕੀਤੀ ਅਤੇ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਇਹ ਹੀ ਹੈ ਉਹ ਚੀਜ਼ ਜਿਹੜੀ ਤੁਸੀਂ ਮੰਗਿਆ ਕਰਦੇ ਸੀ।",
            "verse 67:28": "ਆਖੋ, ਕਿ ਜੇਕਰ ਅੱਲਾਹ ਮੈਨੂੰ ਅਤੇ ਮੇਰੇ ਨਾਲਦਿਆਂ ਨੂੰ ਹਲਾਕ ਕਰ ਦੇ ਕੌਣ ਬਚਾਵੇਗਾ।",
            "verse 67:29": "ਆਖੋ, ਕਿ ਉਹ ਰਹਿਮਾਨ ਹੈ, ਅਸੀਂ ਉਸ ਤੇ ਈਮਾਨ ਲੈ ਆਏ ਅਤੇ ਉਸ ਤੇ ਹੀ ਅਸੀ’ ਭਰੋਸਾ ਕੀਤਾ। ਸੋ ਜਲਦੀ ਹੀ ਤੁਸੀਂ ਜਾਣ ਲਵੋਗੇ ਕਿ ਸਪੱਸ਼ਟ ਕੁਰਾਹੇ ਤੇ ਕੌਣ ਹੈ।",
            "verse 67:30": "ਆਖੋ, ਕਿ ਦੱਸੋ ਜੇਕਰ ਤੁਹਾਡਾ ਪਾਣੀ ਨੀਵਾਂ ਉੱਤਰ ਜਾਵੇ ਤਾਂ ਕਿਹੜਾ ਹੈ ਜਿਹੜਾ ਤੁਹਾਡੇ ਲਈ ਸਾਫ ਪਾਣੀ ਲੈ ਆਵੇ।"
        },
        "Roman english": {
            "verse 67:1": "Tabaarakal lazee biyadihil mulku wa huwa `alaa kulli shai-in qadeer",
            "verse 67:2": "Allazee khalaqal mawta walhayaata liyabluwakum ayyukum ahsanu `amalaa; wa huwal `azeezul ghafoor",
            "verse 67:3": "Allazee khalaqa sab`a samaawaatin tibaaqam maa taraa fee khalqir rahmaani min tafaawutin farji`il basara hal taraa min futoor",
            "verse 67:4": "Summar ji`il basara karrataini yanqalib ilaikal basaru khaasi`anw wa huwa haseer",
            "verse 67:5": "Wa laqad zaiyannas samaaa`ad dunyaa bimasaa beeha wa ja`alnaahaa rujoomal lish shayaateeni wa a`tadnaa lahum `azaabas sa`eer",
            "verse 67:6": "Wa lillazeena kafaroo bi rabbihim `azaabu jahannama wa bi`sal maseer",
            "verse 67:7": "Izaaa ulqoo feehaa sami`oo lahaa shaheeqanw wa hiya tafoor",
            "verse 67:8": "Takaadu tamayyazu minal ghaizi kullamaaa uliqya feehaa fawjun sa alahum khazanatuhaaa alam yaatikum nazeer",
            "verse 67:9": "Qaaloo balaa qad jaaa`anaa nazeerun fakazzabnaa wa qulnaa maa nazzalal laahu min shai in in antum illaa fee dalaalin kabeer",
            "verse 67:10": "Wa qaaloo law kunnaa nasma`u awna`qilu maa kunnaa feee as haabis sa`eer",
            "verse 67:11": "Fa`tarafoo bizambihim fasuhqal li as haabis sa`eer",
            "verse 67:12": "Innal lazeena yakhshawna rabbahum bilghaibi lahum maghfiratunw wa ajrun kabeer",
            "verse 67:13": "Wa asirroo qawlakum awijharoo bihee innahoo `aleemum bizaatis sudoor",
            "verse 67:14": "Alaa ya`lamu man khalaq wa huwal lateeful khabeer",
            "verse 67:15": "Huwal lazee ja`ala lakumul arda zaloolan famshoo fee manaakibihaa wa kuloo mir rizqihee wa ilaihin nushoor",
            "verse 67:16": "A-amintum man fissamaaa`i aiyakhsifa bi kumul arda fa izaa hiya tamoor",
            "verse 67:17": "Am amintum man fissamaaa`i ai yursila `alaikum haasiban fasata`lamoona kaifa nazeer",
            "verse 67:18": "Wa laqad kazzabal lazeena min qablihim fakaifa kaana nakeer",
            "verse 67:19": "Awalam yaraw ilat tairi fawqahum saaaffaatinw wa yaqbidn; maa yumsikuhunna illaar rahmaan; innahoo bikulli shai im baseer",
            "verse 67:20": "Amman haazal lazee huwa jundul lakum yansurukum min doonir rahmaan; inilkaafiroona illaa fee ghuroor",
            "verse 67:21": "Amman haazal lazee yarzuqukum in amsaka rizqah; bal lajjoo fee `utuwwinw wa nufoor",
            "verse 67:22": "Afamai yamshee mukibban `alaa wajhihee ahdaaa ammany yamshee sawiyyan `alaa siratim mustaqeem",
            "verse 67:23": "Qul huwal lazee ansha akum wa ja`ala lakumus sam`a wal absaara wal af`idata qaleelam maa tashkuroon",
            "verse 67:24": "Qul huwal lazee zara akum fil ardi wa ilaihi tuhsharoon",
            "verse 67:25": "Wa yaqooloona mataa haazal wa`du in kuntum saadiqeen",
            "verse 67:26": "Qul innamal `ilmu `indallaahi wa innamaaa ana nazeerum mubeen",
            "verse 67:27": "Falaammaa ra-awhu zulfatan seee`at wujoohul lazeena kafaroo wa qeela haazal lazee kuntum bihee tadda`oon",
            "verse 67:28": "Qul ara`aytum in ahlaka niyal laahu wa mam ma`iya aw rahimanaa famai-yujeerul kaafireena min `azaabin aleem",
            "verse 67:29": "Qul huwar rahmaanu aamannaa bihee wa `alaihi tawakkalnaa fasata`lamoona man huwa fee dalaalim mubeen",
            "verse 67:30": "Qul ara`aytum in asbaha maaa`ukum ghawran famai yaateekum bimaaa`im ma`een"
        },
        "Russian": {
            "verse 67:1": "Благословен будь Тот, В Руке Которого вся власть (над миром), Кто всемогущ над всем и вся!",
            "verse 67:2": "Кто создал смерть и жизнь, Чтоб испытать, Кто праведней из вас в своих деяньях. Велик в могуществе Своем И отдающ во всепрощенье Он!",
            "verse 67:3": "Он - Тот, Кто создал семь небес рядами. В Божественном творенье том Не различить тебе (структурных) нарушений. И снова обрати свой взор - Ты зришь какой-нибудь изъян (в творенье этом)?",
            "verse 67:4": "И вновь свой взор ты обрати: Вернется он униженным и тщетным.",
            "verse 67:5": "Мы небеса ближайшие украсили светильниками (звезд), И Мы их сотворили для того, чтоб дьяволов изгнать, И уготовили для них Мы наказанье - Гореть в пылающем Огне.",
            "verse 67:6": "Для тех, кто не уверовал в Аллаха, - муки Ада, - Поистине, отвратная обитель (для неверных)!",
            "verse 67:7": "Когда в него их будут низвергать, Они услышат рев (зловещий), И возгорится с новой силой пламя,",
            "verse 67:8": "От гнева чуть не задыхаясь. И всякий раз, когда толпа неверных будет низвергнута туда, Воскликнут стражи (Ада): \"Неужто не пришел к вам увещатель?\"",
            "verse 67:9": "Они ответят: \"Да, к нам увещатель приходил, Но мы его отвергли и сказали: \"Аллах не посылает ничего, И вы лишь в заблуждении великом\"\".",
            "verse 67:10": "И говорят они: \"О, если б мы прислушались, О, если б поразмыслили получше, Мы б не были сейчас средь обитателей Огня!\"",
            "verse 67:11": "Тогда они признали все свои грехи, - (Но нет! Раскаяния их Аллах не принял): Прочь, обитатели зловещего Огня, от милости Аллаха!",
            "verse 67:12": "Но тех, кто глубиной души Его страшится, Прощенье ждет и высшая награда.",
            "verse 67:13": "Сокроешь ты свои слова иль молвишь, Секреты всех сердец Он знает.",
            "verse 67:14": "Как может Он не знать того, что Сам же сотворил? Он - Тот, Кто в корень зрит мельчайших таинств, Владеет знанием всего!",
            "verse 67:15": "Он - Тот, Кто сделал землю вам послушной, - Ходите ж по ее раменам, Кормитесь тем, что вам дарует Бог, - К Нему лежит (и ваше) Воскресение (на Суд).",
            "verse 67:16": "И есть ли уверенье в вас, Что Тот, Кто сущ на небесах, Под вашими стопами не разверзнет землю, Что поглотит вас? Так ведь она колеблется уже!",
            "verse 67:17": "И есть ли уверенье в вас, Что Тот, Кто сущ на небесах, На вас не спустит ураган? И вы узнаете тогда, Каким является Мое предупрежденье!",
            "verse 67:18": "Поистине, и те, кто был до них, отвергли (веру), И вот тогда - как страшен был Мой гнев!",
            "verse 67:19": "Ужель они не видят птиц, (которые парят над ними), То крылья распахнув, то вновь сворачивая их? Кто, кроме Милосердного Аллаха, Их удержать способен так? Поистине, всевидящ Он!",
            "verse 67:20": "И кто же тот, кто служит ратью вам И кто способен оказать вам помощь, Помимо Милосердного Аллаха? Поистине, неверные - в глубоком заблужденье!",
            "verse 67:21": "И кто же тот, кто пропитает вас, Если Аллах от вас удержит пищу? Поистине, погрязли в нечестивости они, (Упрямо) отвергая веру.",
            "verse 67:22": "Кто ж лучший проводник - Кто, пресмыкаясь, бьет челом о землю Иль тот, кто шествует по праведной стезе?",
            "verse 67:23": "Скажи: \"Он - Тот, Кто вас взрастил И даровал вам слух, и зрение, и сердце, (Чтоб вы могли и чувствовать, и разуметь), - И все ж как мало благодарны вы\".",
            "verse 67:24": "Скажи: \"Он - Тот, Кто вас рассеял по земле С тем, чтоб в конце пути земного Созвать вас снова у Себя\".",
            "verse 67:25": "И говорят они: \"Коль истину несете вы, Когда ж исполнятся все ваши обещанья?\"",
            "verse 67:26": "Ты им ответь: \"Сие известно только Богу, - Всего лишь увещатель я, Несущий вам открытое и ясное предупрежденье\".",
            "verse 67:27": "Когда ж они узрят его так близко, Покроются их лица мраком, И прозвучит им: \"Это - то, к чему вы так взывали!\"",
            "verse 67:28": "Скажи: \"Вы видите - была б Господня воля Убить меня и тех, кто следует за мной, Иль милостью Своею всех нас одарить, То кто ж неверных защитит от наказания Аллаха?\"",
            "verse 67:29": "Скажи: \"Он - Милосердный (Бог). В Него уверовали мы И возложили на Него свои надежды. И в скором времени познаете и вы, Которые из нас в глубоком заблужденье!\"",
            "verse 67:30": "Скажи: \"Вы видите - коль утренней зарею Уйдут от вас под землю питьевые воды, Кто повелит прозрачному ключу пролиться к вам?\""
        },
        "Sindhi": {
            "verse 67:1": "اُھو (الله) وڏي برڪت وارو آھي جنھن جي ھٿ ۾ (ساري مُلڪ جي) بادشاھي آھي، ۽ اُھو سڀڪنھن شيءِ تي وس وارو آھي.",
            "verse 67:2": "(الله اُھو آھي) جنھن موت ۽ حياتي پيدا ڪئي (انھيءَ لاءِ) ته اوھان کي پرکي ته عمل جي ڪري تمام چڱو اوھان مان ڪير آھي؟ ۽ اُھو غالب بخشڻھار آھي.",
            "verse 67:3": "(الله اُھو آھي) جنھن ستن آسمانن کي طبقا طبقا بڻايو، (اي ڏسندڙ تون الله) ٻاجھاري جي بڻاوت ۾ ڪو فرق نه ڏسندين. پوءِ ورائي (نظر ڪري) ڏس ته (ڪٿي) ڪا ڦوٽ ڏسين ٿو؟",
            "verse 67:4": "پوءِ وري به ٻه ڀيرا ڏس ته (ضرور تنھنجي) نظر تو ڏانھن جھڪي ٿي ٿڪجي موٽندي.",
            "verse 67:5": "۽ بيشڪ دنيا جي آسمان کي (ستارن جي) ڏيئن سان سينگاريو اٿون ۽ اُنھن کي شيطانن جي چُٽڻ لاءَ (به) بڻايوسون ۽ شيطانن لاءِ دوزخ جو عذاب تيار ڪيو اٿون.",
            "verse 67:6": "۽ جن پنھنجي پالڻھار جو انڪار ڪيو تن لاءِ دوزخ جي سزا آھي، ۽ اُھا جاءِ بڇڙي آھي.",
            "verse 67:7": "جڏھن کين دوزخ ۾ اڇليو ويندو (تڏھن) اُن جون (گڏھ جھڙيون) ھينگون ٻڌندا ۽ اُھو پيو اُڀامندو.",
            "verse 67:8": "جو ڪاوڙ کان (ڄڻ ته) اجھو ٿو ڦاٽي. جنھن مھل ڪنھن ٽوليءَ کي اُن ۾ پيو وجھبو (تنھن مھل) دوزخ جا داروغا انھن کان پڇندا ته اوھان وٽ ڪو ڊيڄاريندڙ (پيغمبر) نه آيو ھو ڇا؟",
            "verse 67:9": "چوندا ھائو! بيشڪ اسان وٽ ڊيڄاريندڙ آيو ھو، پر (اُن کي) ڪوڙو ڄاتوسون ۽ چيوسون ته الله ڪا (به) شيءِ نه لاٿي آھي، اوھين ته رڳو وڏيءَ گمراھيءَ ۾ (پيل) آھيو.",
            "verse 67:10": "۽ چوندا ته جيڪڏھن اسين ٻُڌون ھا يا سمجھون ھا ته دوزخين (جي ٽوليءَ) ۾ (ڪڏھن داخل) نه ٿيون ھا.",
            "verse 67:11": "پوءِ پنھنجو ڏوھ (پاڻ) مڃيندا، پوءِ دوزخين تي لعنت ھجي شال.",
            "verse 67:12": "بيشڪ جيڪي پنھنجي پالڻھار کان پرپٺ ڊڄندا آھن تن لاءِ بخشش ۽ وڏو اجر آھي.",
            "verse 67:13": "۽ پنھنجي ڳالھ ڳجھي ڳالھايو يا اُھا پڌري چئو، ته بيشڪ الله سينن جو ڳُجھ ڄاڻندڙ آھي.",
            "verse 67:14": "جنھن پيدا ڪيو سو ڪيئن نه ڄاڻندو؟ ۽ اُھو اونھي نظر وارو خبر رکندڙ آھي.",
            "verse 67:15": "(الله) اُھو آھي جنھن زمين کي اوھان جي لاءِ تابع ڪيو ته ان جي رستن ۾ گھمو ۽ الله جي رزق مان کائو، ۽ (جيئرو ٿي) ڏانھس کڙو ٿيڻو آھي.",
            "verse 67:16": "(اوھين) اُنھيءَ کان بي ڀَوا ٿيا آھيو ڇا ته جيڪو آسمان ۾ آھي سو متان اوھان کي زمين ۾ ڳِھائي ڇڏي پوءِ اُتي جو اُتي زمين ڌڏي؟",
            "verse 67:17": "(اوھين) انھيءَ کان بي ڀَوا ٿيا آھيو ڇا ته جيڪو آسمان ۾ آھي سو متان اوھان تي پھڻ وسائيندڙ واءُ موڪلي، پوءِ سگھو ڄاڻندؤ ته منھنجو ڊيڄارڻ ڪيئن آھي؟",
            "verse 67:18": "۽ بيشڪ جيڪي انھن کان اڳ ھوا تن (به) ڪوڙ ڀانيو پوءِ منھنجي سزا ڪھڙي طرح ھئي.",
            "verse 67:19": "پنھنجي مٿاھون پکين ڏانھن نه ڏٺو اٿن ڇا؟ جي کنڀڙاٽيون ٽيڙي ھلندا آھن ۽ (ڪڏھن ڪڏھن) بند ڪندا آھن، انھن کي ٻاجھاري (الله) کانسواءِ (ٻيو ڪو) به جھلي نه رکندو آھي، بيشڪ اُھو سڀڪنھن شيءِ کي ڏسندڙ آھي.",
            "verse 67:20": "اُھو اوھان جو لشڪر ڪھڙو آھي جو اوھان کي ٻاجھاري (الله) کانسواءِ مدد ڏئي؟ ڪافر رڳو ڀولي ۾ (پيل) آھن.",
            "verse 67:21": "(ڀلا) اُھو ڪير آھي جو جيڪڏھن الله پنھنجو رزق جھلي ته اھو اوھان کي روزي ڏئي؟ بلڪ (ڪافر) سرڪشي ۽ (حق کان) نفرت ۾ اڙجي پيا آھن.",
            "verse 67:22": "ڀلا جيڪو پنھنجي مُنھن ڀر اونڌو ڪريل ھلندو ھجي سو وڌيڪ سڌي رستي وارو آھي يا اُھو جيڪو سڌو سنئون سڌي واٽ تي ھلندو ھجي؟",
            "verse 67:23": "چئو ته (الله) اُھو آھي جنھن اوھان کي پيدا ڪيو ۽ اوھان جا ڪن ۽ اکيون ۽ دليون بڻايائين، (اوھين) ٿورڙو احسان مڃيندا آھيو.",
            "verse 67:24": "چئونَ ته (الله) اُھو آھي جنھن اوھان کي زمين ۾ پکيڙيو ۽ (اوھين) ڏانھس گڏ ڪيا ويندؤ.",
            "verse 67:25": "۽ (ڪافر) چوندا آھن ته اھو انجام ڪڏھن (پورو) ٿيندو جيڪڏھن سچا آھيو؟",
            "verse 67:26": "(اي پيغمبر کين) چؤ ته (اھا) خبر رڳو الله وٽ آھي، ۽ آءٌ رڳو پڌرو ڊيڄاريندڙ آھيان.",
            "verse 67:27": "۽ جنھن مھل ان (انجام) کي ويجھو ٿيل ڏسندا ته ڪافرن جا مُنھن ڪاراٽجي ويندا، ۽ چئبن ته جنھن کي طلبيندا ھئو سو ھيءُ آھي.",
            "verse 67:28": "(اي پيغمبر کين) چؤ ته ڏٺو اٿوَ ڇا ته جيڪڏھن مون کي ۽ جيڪي مون ساڻ آھن تن کي الله ھلاڪ ڪري يا الله اسان تي ٻاجھ ڪري ته (هر صورت ۾) ڪافرن کي ڏکوئيندڙ عذاب کان ڪير ڇڏائيندو؟",
            "verse 67:29": "(اي پيغمبر کين) چؤ ته اُھو ٻاجھارو آھي اُن تي ايمان آندوسون ۽ مٿس ڀروسو ڪيوسون، پوءِ سگھو ئي ڄاڻندؤ ته پڌريءَ گمراھي ۾ ڪير آھي.",
            "verse 67:30": "(اي پيغمبر کين) چؤ ته ڏٺو اٿو ڇا ته جيڪڏھن اوھان جو پاڻي ھيٺ پيھي وڃي ته اوھان وٽ وھندڙ پاڻي ڪير آڻيندو؟"
        },
        "Sinhalese": {
            "verse 67:1": "(සියලු) පාලන බලය කවර අට අතෙහි ඇත්තේද ඔහු භාග්‍ය සම්පන්න විය. තවද ඔහු සියලු දෑ කෙරෙහි බලසම්පන්නය.",
            "verse 67:2": "ඔහු වනාහි මරණය සහ ජීවය මැව්වේ ය. (මන්ද) නුඹලා අතරින් කවරෙකු ක්‍රියාවෙන් වඩාත් දැහැමි දැයි ඔහු නුඹලා ව පරීක්ෂා කරනු පිණිසය. තවද ඔහු සර්ව බලධාරීය; අතික්ෂමාශීලීය.",
            "verse 67:3": "ඔහු වනාහි අහස් සතම (එකිනෙක උඩ පිහිටන සේ) තට්ටු වශයෙන් මැව්වේය. කරුණාවන්තයාගේ මැවීම්හි පරස්පරතාවයන් නුඹ නොදකිනු ඇත. එහෙයින් යම් පැලීමක් නුඹ දකින්නේ දැයි නෙත් යොමු කර බලනු.",
            "verse 67:4": "පසුවද නුඹ දෙවරක් නෙත් යොමු කර බලනු. එම නෙත් නුඹ වෙත එය වෙහෙසට පත් තත්ත්වයේ අවමානයෙන් යුතු ව හැරෙනු ඇත.",
            "verse 67:5": "තවද සැබැවින්ම අපි මෙලොව අහස පහන් මගින් අලංකාරවත් කළෙමු. ඒවා ෂෙයිතානුන් පළවා හරින වස්තූන් බවට අපි පත් කළෙමු. තවද අපි ඔවුනට ඇවිළෙන ගින්නේ දඬුවම ද සූදානම් කර ඇත්තෙමු.",
            "verse 67:6": "එමෙන්ම තම පරමාධිපති ව ප්‍රතික්ෂේප කළවුනට නිරයේ දඬුවම ඇත. තවද (ඔවුහු) යොමු වන ස්ථානය නපුරු විය.",
            "verse 67:7": "ඔවුන් එහි හෙළනු ලැබූ කල්හි එය උතරමින් තිබිය දී ඉන් ඔවුහු දැඩි පිළිකුල් හඬකට සවන් දෙති.",
            "verse 67:8": "එය කෝපයෙන් පිපිරෙන්නාක් මෙනි. එහි පිරිසක් දමනු ලැබූ සෑම විටකම “අවවාද කරන්නෙකු නුඹලා වෙත නොපැමිණියේ දැ?”යි එහි භාරකරුවෝ ඔවුන්ගෙන් විමසති.",
            "verse 67:9": "“එසේය. අප වෙත අනතුරු අඟවන්නෙකු සැබැවින්ම පැමිණියේය. එවිට අපි බොරු යැයි පැවසුවෙමු තවද අල්ලාහ් කිසිදු දෙයක් පහළ කර නැත. නුඹලා මහත් වූ මුළාවේ මිස නැතැයි” අපි කීවෙමුයි ඔවුහු පවසති.",
            "verse 67:10": "තවද අප සවන් දෙමින් හෝ අවබෝධ කර ගනිමින් සිටියෙමු නම් දැවෙන ගින්නේ සහකාරයින්ගෙන් අප නොවන්නෙමුයි ඔවුහු කියති.",
            "verse 67:11": "එවිට ඔවුහු තම වරද පිළිගනිති. එහෙයින් දැවෙන ගින්නේ සහකාරයින්ට ශාපය වේවා!",
            "verse 67:12": "නියත වශයෙන්ම අදෘශ්‍යමානයෙහි තම පරමාධිපතිට බිය වන අය වනාහි ඔවුනට සමාව හා මහත් වූ තිළිණයක් ඇත.",
            "verse 67:13": "තවද නුඹලාගේ ප්‍රකාශයන් රහසිගත ව කියනු. නැතහොත් එය හඬ නගා කියනු. නියත වශයෙන්ම ඔහු හදවත් හි ඇති දෑ පිළිබඳ ව සර්ව ඥානීය.",
            "verse 67:14": "(සියල්ල) මැවූ ඔහු නොදන්නේද? ඔහු සියුම් ඥානීය; අභිඥානවන්ත ය.",
            "verse 67:15": "නුඹලාට මහපොළොව (ගමන් කිරීමට) පහසු අයුරින් සැකසුවේ ඔහුය. එහෙයින් එහි පැතිකඩ වල නුඹලා ගමන් කරනු. තවද ඔහුගේ පෝෂණයෙන් අනුභව කරනු. තවද ඔහු වෙතය නැවත නැගිටුවනු ලබනුයේ.",
            "verse 67:16": "අහසේ සිටින්නා මහපොළොවේ නුඹලාව ගිල් වීම ගැන නුඹලා නිර්භිය ව සිටින්නෙහු ද? එවිට එය කම්පනය වෙමින් පවතී.",
            "verse 67:17": "එසේ නැතහොත් අහසෙහි සිටින්නා ගල් කුණාටුවක් නුඹලා වෙත එවීම ගැන නිර්භිය ව සිටින්නෙහු ද? එවිට මාගේ අනතුරු ඇඟවීම කෙසේ දැයි නුඹලා මතු දැන ගනු ඇත.",
            "verse 67:18": "තවද සැබැවින්ම ඔවුනට පෙර සිටියවුන් බොරු කළෝය. එවිට මාගේ උදහස කෙසේ වී ද?",
            "verse 67:19": "ඔවුනට ඉහළින් පක්ෂීන් තම පියාපත් දිගු හරිමින් හා හකුළුවාලමින් පියාසර කිරීම ඔවුහු නුදුටුවෝද? උන් රඳවා තබනුයේ අපරිමිත දයාන්විතයාණන් මිස අන් කිසිවෙකු නොවෙයි. නියත වශයෙන්ම ඔහු සෑම දෙයක් පිළිබඳ ව සර්ව නිරීක්ෂකය.",
            "verse 67:20": "අපරිමිත දායන්විතයාණන් හැර නුඹලාට උදව් කරන නුඹලා සතු සේනාව කවරෙකු ද? දේවත්වය ප්‍රතික්ෂේප කරන්නෝ මුළාවෙහි මිස නැත.",
            "verse 67:21": "නැතහොත් ඔහුගේ පෝෂණය ඔහු නතර කළේ නම් නුඹලාට පෝෂණය සපයනුයේ කවරෙකු ද? නමුත් ඔවුහු සත්‍යයෙන් දුරස් ව සීමාව ඉක්මවීමෙහි හා (සත්‍යයෙන්) පලා යෑමෙහි එල්බගෙන සිටිති.",
            "verse 67:22": "තම මුහුණ මුණින් අතට වැටී ඇවිදින්නා ද එසේ නැතහොත් කෙළින් ඍජු මාර්ගය මත ඇවිදින්නා ද ඍජු මාර්ගයක සිටිනුයේ?",
            "verse 67:23": "නුඹලා නිර්මාණය කොට නුඹලාට ශ්රවණය ද දෘෂ්ටි ද හදවත් ද ඇති කළේ ඔහුය. නුඹලා ගුණ ගරුක වනුයේ ස්වල්පයකි යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 67:24": "නුඹලා මහපොළොවෙහි විසුරුවා හැරියේ ඔහුය. තවද ඔහු වෙතය නුඹලා එක්රැස් කරනු ලබනුයේ යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 67:25": "තවද නුඹලා සත්‍යවාදීන් ලෙස සිටියෙහු නම් මෙම පොරොන්දුව (ඉටු කරනු ලබනුයේ) කවදා දැ?යි ඔවුහු ප්‍රශ්න කරති.",
            "verse 67:26": "(එයට) නියත වශයෙන්ම (මේ ගැන) දැනුම ඇත්තේ අල්ලාහ් වෙතය. තවද නියත වශයෙන්ම මම පැහැදිලි අනතුරු අඟවන්නෙකු පමණකියි (නබිවරය!) නුඹ පවසනු.",
            "verse 67:27": "එය කිට්ටුවෙන්ම ඔවුන් දකින කල්හි ප්‍රතික්ෂේප කළවුන්ගේ මුහුණු නරක් වී යයි. තවද මෙය නුඹලා (ඉක්මන් කරන්නැයි) වාද කරමින් සිටි දෑ යැයි එවිට ඔවුනට කියනු ලැබේ.",
            "verse 67:28": "(නබිවරය!) මා හා මා සමග සිටින අය අල්ලාහ් විනාශ කළේ නම් හෝ නැතහොත් අප වෙත ඔහු දයාව දැක් වූයේ නම් හෝ වේදනීය දඬුවමින් ප්‍රතික්ෂේපකයින් ගලවා ගන්නේ කවුරුන් දැයි නුඹලා සිතා බැලුවෙහු දැ?යි (ඔවුන්ගෙන්) විමසනු.",
            "verse 67:29": "අපිරිමිත දයාන්විතයා ඔහුය. අපි ඔහු ගැන විශ්වාස කළෙමු. තවද ඔහු වෙතම බලාපොරොත්තු තබන්නෙමු. එහෙයින් කවරෙකු ප්‍රකට නොමගෙහි දැයි නුඹලා මතු දැන ගනු ඇත යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 67:30": "නුඹලාගේ ජලය (මහපොළොව තුළට) කිඳා බැස්සේ නම් ගලා යන දිය දහර නුඹලාට ලබා දෙන්නේ කවුරුන් දැ?යි නුඹලා සිතා බැලුවෙහු දැ?යි (නබිවරය!) නුඹ විමසනු."
        },
        "Somali": {
            "verse 67:1": "Waxaa barako badnaaday (oo weynaaday) Eebaha Xukunku awooddiisa ku jiro ee wax walbana kara.",
            "verse 67:2": "Eebaha abuuray geeri iyo nololba, si uu dadow idiin imtixaamo kiinna Camal fiican, Eebana waa adkaade dambidhaafe ah.",
            "verse 67:3": "Eebe waa midka abuuray Toddobo Samo oo isdul saaran kuna arki maysid abuurka Eebaha Raxmaanka ah kala tagsani, bal daymada celi inaad aragto wax dillaac ah.",
            "verse 67:4": "Haddana celi daymada waxaa kugu soo noqon aragga oo dhiban daallanna.",
            "verse 67:5": "Eebe wuxuu ku quxiyey Samada dhow Nalal (Xiddigaha) wuxuuna ka dhigay Xiddigahaas kuwo lagu gano Shayaadiinta, Wuxuuna Eebe u diyaariyay kuwaas Naarta Saciiro.",
            "verse 67:6": "Kuwa ka gaaloobay Eebahood waxaa u sugnaaday Caddibaadda Jhannamo, meel loo ahaadana iyadaa u xun.",
            "verse 67:7": "Marka Gaalada lagu tuuro Naarta waxay ka maqli Cod xun oo daran iyadoo karaysa.",
            "verse 67:8": "waxay u dhawdahay inay Cadha daraadeed la kala dillaacdo, marka Koox (Gaala ah) lagu ridaba waxaa warsada Malaa'igta Naarta ka shaqeysa iyagoo ku dhihi miyuusan idiin imaanin wax idiin diga.",
            "verse 67:9": "Waxayna ugu jawaabi waa noo yimid wax noo diga waanse beeninay, annagoo leh ma soo dejinin Eebe waxba, idinkuna waxaad ku sugan tihiin baadi weyn.",
            "verse 67:10": "Gaaladii waxay dhaheen haddaan wax maqlaynno ama aan wax kasayno Naarta Saciiro ehelkeeda ma aanaan noqoneen.",
            "verse 67:11": "Waxay kirteen (Gaaladu) dambigoodii waxaana u sugnaatay fogaansho Naarta Saciiro ehelkeeda.",
            "verse 67:12": "Kuwa Eebe ka yaaba iyagoon la arkaynin (Eebe mooyee) waxaa u sugnaaday dambi dhaaf iyo ajri weyn.",
            "verse 67:13": "Ama hadalka hoos dhiga dadow ama kor u qaada Eebe waa ogyahay waxa laabta ku jira.",
            "verse 67:14": "Ma waxaan wax ogeyn Eebaha wax walba abuuray ee wax walba daalacan.",
            "verse 67:15": "Eebe waa kan Dhulka ka dhigay mid laylan ee ku socda Waddooyinkiisa kana Cuna Quudkiisa Eebaana Dadku loo soo kulmin (Qiyaamada).",
            "verse 67:16": "Miyaad ka aamin noqoteen Eebaha Sare inuu Dhulka idin la gooyo, ayna idinla dhaqdhaqaaqdo.",
            "verse 67:17": "Miyaadse ka aamin noqoteen Eebaha Sare inuu Dhagaxyo Naar ah idinku soo daadiyo, waad ogaan doontaan digiinta Eebe Cidhibteeda.",
            "verse 67:18": "Waxaa Eebe beeniyey Gaaladii (reer Makaad) ka horreeyey, sidayse ahayd Ciqaabti Eebe.",
            "verse 67:19": "Miyeyna dadku arkaynin Shimbirka korkooda ah marna baalka fidin marna laabi wax haya oon Eebaha Raxmaan ahayna uusan jirin, Eebana wax walba wuu arkaa.",
            "verse 67:20": "Waa kuma Gargaaraha Eebaha Raxmaan ah ka soo hadhay ee u gaargaari Gaalada, Gaaladu waxay ku sugan yihiin kadsoomid.",
            "verse 67:21": "Waa kuma kan wax quudiya haddii Eebe haysto Risqigiisa, Gaaladu waxay ku Madax adaygeen isla weyni iyo Xaq diidnimo.",
            "verse 67:22": "Midkee wanaagsan Ruux Wajiga k socda iyo mid si toosan oo siman Wadda Toosan ugu socda.",
            "verse 67:23": "Dheh Nabiyow Eebe waa midka Dadkow idin ahaysiiyey, Maqal iyo Arag iyo Caqlina idiin yeelay, wax yar baadse Eebe ku shukridaan.",
            "verse 67:24": "Dheh Eebe waa midka dadkow Dhulka idinku beeray isagaana (Qiyaamada) loo soo kulmin doona Dadka.",
            "verse 67:25": "Waxay dhihi Gaaladu waa goorma Waqtiguu dhici waxa naloogu gooddin haddaad run sheegaysaan.",
            "verse 67:26": "Dheh Eebaa og goortaas, waxaanse ahay Anigu u dige Cad (muuqda).",
            "verse 67:27": "Markaysa Gaaladu Naarta oo u dhow arkaan waxaa xumaan oo doorsoomi Wajiga Gaalada, waxaana lagu dhihi waaka Cadibaaddii aad ddonayseen (dedejisanayseen).",
            "verse 67:28": "Dheh balse ka warrama haddii Eebe aniga (Nabiga) iyo inta ila jirta uu halligo ama u naxariisto yaa Gaalo ka korin Caddibaad daran.",
            "verse 67:29": "Dheh Eebe waa Raxmaan waana rumaynay, waana Tala saaranay, waadse ogaan doontaan (Gaalooy) Cidda Baadi Cad ku sugan.",
            "verse 67:30": "Dheh balse Warrama hadday Biyuhu Dhulka ku gudhaan yaa idin siin Biya durduri (ma jiro Eebe waxaan ahayn)."
        },
        "Spanish": {
            "verse 67:1": "Bendito sea Aquel en cuyas manos está la Soberanía y es Poderoso sobre todas las cosas.",
            "verse 67:2": "Quien creó la muerte y la vida para probaros y ver cuál de vosotros sería mejor en obras. Y es el lrresistible, el Perdonador.",
            "verse 67:3": "El que creó siete cielos, uno sobre el otro.No verás en la creación del Misericordioso ninguna imperfección. Vuelve la vista: Ves algún fallo?",
            "verse 67:4": "Vuelve a mirar una y otra vez, la vista regresará a ti derrotada y exhausta.",
            "verse 67:5": "Hemos adornado el cielo de este mundo con luceros, dispuestos para lapidar a los demonios. Y a ellos les hemos preparado el castigo del Sair.",
            "verse 67:6": "Y los que se niegan a creer en su Señor, tendrán el castigo de Yahannam. Qué mal lugar de destino!",
            "verse 67:7": "Cuando sean arrojados en él le escucharán como un horrible rebuzno y estará hirviendo.",
            "verse 67:8": "A punto de reventar de rabia.Cada vez que algún grupo sea arrojado en él, les preguntarán sus guardianes: Acaso no os llegó uno que os advirtió?",
            "verse 67:9": "Dirán: Sí, nos llegó un advertido, pero negamos la verdad y dijimos: Allah no ha hecho descender nada; no estáis sino en un extravío.",
            "verse 67:10": "Y dirán: Si hubiéramos escuchado o hubiéramos tenido juicio, no estaríamos entre los compañeros del Asir.",
            "verse 67:11": "Y reconocerán sus faltas.Fuera con los compañeros de Sair!",
            "verse 67:12": "Es cierto que los que temen a Allah cuando nadie los ve, tendrán perdón y una gran recompensa.",
            "verse 67:13": "Y tanto si guardáis en secreto lo que decís como si lo divulgáis... Él es Conocedor de lo que encierran los pechos.",
            "verse 67:14": "No habría de tener conocimiento Aquel que ha creado y es el Sutil, al que nada se Le oculta?",
            "verse 67:15": "Él es Quien ha hecho la tierra dócil para vosotros, caminad pues por sus confines y comed de Su provisión.A Él es el retorno.",
            "verse 67:16": "Es que estáis a salvo de que Quien está en el cielo no haga que la tierra se hunda con vosotros en un temblor?",
            "verse 67:17": "O estáis a salvo acaso de que Quien está en el cielo no envíe una pedrisca sobre vosotros? Entonces sabríais cómo es Mi advertencia.",
            "verse 67:18": "Ya habían negado la verdad los que os precedieron. Y cómo fue Mi reprobación.",
            "verse 67:19": "Es que no han visto las aves sobre ellos y cómo mueven sus alas? No las sostiene sino el Misericordioso.Realmente Él todo lo ve.",
            "verse 67:20": "En quién tendréis un soporte que os auxilie, sino en el Misericordioso? Los incrédulos no están seducidos sino por un engaño.",
            "verse 67:21": "Y quién será el que os provea, si Él retiene Su provisión?Sin embargo persisten en la insolencia y en el rechazo.",
            "verse 67:22": "Acaso quien camina cabizbajo y tropezando de frente es como el que camina derecho por un camino recto?",
            "verse 67:23": "Di: Él es Quien os ha creado y os ha dado el oído, la vista y el corazón. Qué poco es lo que agradecéis!",
            "verse 67:24": "Di: Él es Quien os ha repartido por la tierra y para Él seréis reunidos.",
            "verse 67:25": "Y dicen: Cuándo se cumplirá esta promesa si es verdad lo que decís?",
            "verse 67:26": "Di: El conocimiento está junto a Allah; yo sólo soy un advertidor explícito.",
            "verse 67:27": "Cuando la vean próxima, el mal se reflejará en el rostro de los que se negaron a creer y alguien dirá: Esto es lo que estabais pidiendo.",
            "verse 67:28": "Di: Decidme: Y si Allah me destruyera a mí y a los que conmigo están o se apiadara de nosotros? Quién librará a los incrédulos de un doloroso castigo?",
            "verse 67:29": "Di: Él es el Misericordioso, en Él creemos y en Él nos abandonamos.Ya sabréis quién es el que está en un claro extravío.",
            "verse 67:30": "Di: Qué haríais si vuestra agua se quedara en la profundidad de la tierra? Quién podría traeros agua de manantial?"
        },
        "Swahili": {
            "verse 67:1": "AMETUKUKA ambaye mkononi mwake umo Ufalme wote; na Yeye ni Mwenye uweza juu ya kila kitu.",
            "verse 67:2": "Ambaye ameumba mauti na uhai ili kukujaribuni ni nani miongoni mwenu mwenye vitendo vizuri zaidi. Na Yeye ni Mwenye nguvu na Mwenye msamaha.",
            "verse 67:3": "Aliye umba mbingu saba kwa matabaka. Huoni tafauti yoyote katika uumbaji wa Mwingi wa Rehema. Hebu rudisha nadhari! Unaona kosa lolote?",
            "verse 67:4": "Tena rudisha nadhari mara mbili, nadhari yako itakurejea mwenyewe hali ya kuwa imehizika nayo imechoka.",
            "verse 67:5": "Na kwa hakika tumeipamba mbingu ya karibu kwa mataa, na tumeyafanya ili kuwapigia mashetani, na tumewaandalia adhabu ya Moto uwakao kwa nguvu.",
            "verse 67:6": "Na kwa walio mkufuru Mola wao Mlezi ipo adhabu ya Jahannamu. Na ni marejeo maovu yalioje hayo!",
            "verse 67:7": "Watakapo tupwa humo watausikia mngurumo wake na huku inafoka.",
            "verse 67:8": "Inakaribia kupasuka kwa hasira. Kila mara likitupwa kundi humo walinzi wake huwauliza: Kwani hakukujieni mwonyaji?",
            "verse 67:9": "Watasema: Kwani! Ametujia mwonyaji, lakini tulimkadhibisha, na tukasema: Mwenyezi Mungu hakuteremsha chochote. Nyinyi hamumo ila katika upotovu mkubwa!",
            "verse 67:10": "Na watasema: Lau kuwa tungeli sikia, au tungeli kuwa na akili, tusingeli kuwa katika watu wa Motoni!",
            "verse 67:11": "Wakakiri dhambi zao. Basi kuangamia ni kwa watu wa Motoni!",
            "verse 67:12": "Hakika wanao mwogopa Mola wao Mlezi kwa ghaibu, watapata maghfira na ujira mkubwa.",
            "verse 67:13": "Na ficheni kauli zenu, au zitangazeni; hakika Yeye ni Mjuzi wa yaliyomo vifuani.",
            "verse 67:14": "Asijue aliye umba, naye ndiye Mjua siri, Mwenye khabari?",
            "verse 67:15": "Yeye ndiye aliye idhalilisha ardhi kwa faida yenu, basi tembeeni katika pande zake, na kuleni katika riziki zake. Na kwake Yeye ndio kufufuliwa.",
            "verse 67:16": "Mnadhani mko salama kwa alioko juu kuwa hatakudidimizeni kwenye ardhi, na tahamaki hiyo inatikisika!",
            "verse 67:17": "Au mnadhani mko salama kwa alioko juu ya kuwa Yeye hakupelekeeni kimbunga chenye changarawe? Mtajua vipi maonyo yangu?",
            "verse 67:18": "Na bila ya shaka walikwisha kanusha walio kuwa kabla yao; basi kulikuwaje kukasirika kwangu?",
            "verse 67:19": "Kwani hawawaoni ndege walioko juu yao namna wanavyo zikunjua mbawa zao, na kuzikunja? Hawawashikilii ila Mwingi wa rehema. Hakika Yeye ni Mwenye kuona kila kitu.",
            "verse 67:20": "Au ni lipi hilo jeshi lenu la kukunusuruni badala ya Mwingi wa Rehema? Hakika makafiri hawamo ila katika udanganyifu.",
            "verse 67:21": "Au ni nani huyo ambaye atakupeni riziki kama Yeye akizuia riziki yake? Bali wao wanakakamia tu katika jeuri na chuki.",
            "verse 67:22": "Je! Anaye kwenda akisinukia juu ya uso wake ni mwongofu zaidi, au yule anaye kwenda sawasawa katika Njia Iliyo Nyooka?",
            "verse 67:23": "Sema: Yeye ndiye aliye kuumbeni tangu mwanzo, na akakupeni masikio na macho, na nyoyo. Ni kidogo kabisa shukrani zenu.",
            "verse 67:24": "Sema: Yeye ndiye aliye kutawanyeni katika ardhi, na kwake mtakusanywa.",
            "verse 67:25": "Na wanasema: Lini ahadi hii, ikiwa mnasema kweli?",
            "verse 67:26": "Sema: Hakika ujuzi wake uko kwa Mwenyezi Mungu; na hakika mimi ni mwonyaji tu mwenye kubainisha.",
            "verse 67:27": "Lakini watakapo iona karibu, nyuso za walio kufuru zitahuzunishwa, na itasemwa: Hayo ndiyo mliyo kuwa mkiyaomba.",
            "verse 67:28": "Sema: Mwaonaje, ikiwa Mwenyezi Mungu atanihiliki mimi na walio pamoja nami, au akiturehemu, ni nani atakaye walinda makafiri na adhabu chungu?",
            "verse 67:29": "Sema: Yeye ndiye Mwingi wa Rehema; tunamuamini Yeye, na juu yake tunategemea. Mtakuja jua ni nani aliye katika upotovu ulio dhaahiri.",
            "verse 67:30": "Sema: Mwaonaje, yakiwa maji yenu yamedidimia chini, nani atakueleteeni maji yanayo miminika?"
        },
        "Swedish": {
            "verse 67:1": "VÄLSIGNAD Han som har allt herravälde i Sin hand och vars makt övervinner allt!",
            "verse 67:2": "Han som har skapat döden och livet för att sätta er på prov [och låta er visa] vem av er som i sitt handlande är den bäste. Han är den Mäktige, Den som ständigt förlåter.",
            "verse 67:3": "[Det är] Han som har skapat sju himlar som välver sig över varandra. Du kan inte upptäcka någon brist eller ofullkomlighet i den Nåderikes skapelse; men lyft på nytt din blick mot [himlen] - ser du någon spricka",
            "verse 67:4": "Lyft blicken ännu en gång och ännu en gång och den skall vända tillbaka till dig med oförrättat ärende, utmattad [av att spana efter fel].",
            "verse 67:5": "Vi har låtit den nedre himlen lysas upp av stjärnskott [som] prydnad och för att hålla de djävulska krafterna i schack; och för dem har Vi i beredskap en högt flammande Eld.",
            "verse 67:6": "På alla som hädar sin Herre, väntar helvetets lidande - ett eländigt mål!",
            "verse 67:7": "Och när de kastas i detta [helvete] hör de det rossla och ryta, kokande av vrede,",
            "verse 67:8": "ja, nära att sprängas i stycken av ursinne; och varje gång en hop [syndare] störtas ned i det skall vakterna fråga dem: \"Kom ingen till er för att varna er?\"",
            "verse 67:9": "”Jo, det kom en varnare till oss, men vi beskyllde honom för lögn och sade: 'Gud har aldrig uppenbarat något [budskap]. Ni tar miste, [du och de som följer dig].'”",
            "verse 67:10": "Och de skall tillägga: \"Om vi bara hade lyssnat [till honom] eller använt vårt förstånd skulle vi inte höra till dem vars mål är den högt flammande Elden!\"",
            "verse 67:11": "De kommer alltså [till sist] att erkänna sin synd, men de vars mål är den högt flammande Elden är då långt bortom all nåd och förlåtelse.",
            "verse 67:12": "Men förlåtelse och en riklig belöning [väntar] dem som står i bävan inför sin Herre, fastän de inte kan se eller förnimma Honom.",
            "verse 67:13": "VARE SIG ni håller era åsikter hemliga eller öppet tillkännager dem, vet Han vad som rör sig i ert innersta.",
            "verse 67:14": "Skulle inte Han, Skaparen, känna det som Han har skapat, Han, den Outgrundlige som genomskådar allt, som är underrättad om allt?",
            "verse 67:15": "Det är Han som har skapat jorden för att tjäna er; färdas då över dess vidder och livnär er av det som Han skänker er för er försörjning och [tänk på att] ni skall återuppstå för att möta Honom.",
            "verse 67:16": "Kan ni vara säkra på att Han, som är i himlen, inte låter jorden [rämna under er och] uppsluka er? Se hur den [redan] skälver och skakar!",
            "verse 67:17": "Eller kan ni vara säkra på att Han, som är i himlen, inte släpper lös en storm över er, så våldsam att ni förstår [allvaret i] Min varning",
            "verse 67:18": "Före dem levde helt visst andra som förnekade sanningen - och hur [hård] var inte Min dom över dem!",
            "verse 67:19": "Har de aldrig sett på fåglarna över deras [huvuden], hur de under flykten sträcker vingarna och sedan fäller in dem [mot sidorna]? Ingen utom den Nåderike håller dem uppe; Han ser allt.",
            "verse 67:20": "Vem, utom den Nåderike, kan bistå er [med styrkan hos] en armé? De som förnekar sanningen är [offer] för självbedrägeri!",
            "verse 67:21": "Vem kan dra försorg om er om Han skulle hålla tillbaka Sina gåvor? - Men, nej, de framhärdar i sitt högmod och sitt trots!",
            "verse 67:22": "Når den lättare fram som går böjd med sänkt huvud än den som går upprätt på en rak väg",
            "verse 67:23": "SÄG [Muhammad]: \"Det är Han som har skapat er och begåvat er med hörsel, syn och förstånd - men var är er tacksamhet?\"",
            "verse 67:24": "Säg: \"Det är Han som har låtit er uppfylla jorden och till Honom skall ni samlas åter.\"",
            "verse 67:25": "Men de frågar: \"När skall detta löfte infrias, om det ni säger är sanning?\"",
            "verse 67:26": "Säg: \"Gud ensam har kunskap om detta; jag är bara en varnare, [som varnar] klart och entydigt.\"",
            "verse 67:27": "När de som förnekar sanningen [till sist] ser den [yttersta verkligheten] komma dem helt nära, skall fasa och förtvivlan stå målade i deras ansikten, men [änglarna] kommer att säga: \"Detta är vad ni alltid begärde [att få se]!\"",
            "verse 67:28": "SÄG [Profet]: \"Vad tror ni? Vare sig Gud låter mig och mina anhängare gå under eller Han förbarmar Sig över oss, var finns den som kan skydda förnekarna av sanningen mot ett svårt straff [i nästa liv]?\"",
            "verse 67:29": "Säg: \"Han är den Nåderike - vi tror på Honom och till Honom litar vi. Ni kommer [snart] att få veta vem [av oss] som uppenbart har gått vilse.\"",
            "verse 67:30": "Säg: \"Vad tror ni? Om allt ert vatten skulle försvinna i jordens djup, vem skulle då kunna ge er vatten ur rena och klara källor?\""
        },
        "Tajik": {
            "verse 67:1": "Бузургвору бобаракат Худованде, ки фармонравой ба дасти Ӯст ва Ӯ бар ҳар чизе тавоност,",
            "verse 67:2": "он ки маргу зиндагиро биёфарид, то биёзмоядатон, ки кадом як аз шумо ба амал некӯтар аст ва Ӯст ғолибу бахшоянда!",
            "verse 67:3": "Он ки ҳафт осмони табақа-табақаро биёфарид. Дар офариниши Худои раҳмон ҳеҷ халалу беназмӣ намебинӣ. Пес бори дигар назар кун, оё дар осмон шикофе мебинӣ?",
            "verse 67:4": "Бори дигар низ чашм боз кун ва бингар. Нигоҳи ту хаставу дармонда ба назди ту бозхоҳад гашт.",
            "verse 67:5": "Мо осмони дунёро ба чароғҳое биёростем ва он чароғҳоро василаи сангсор кардани шаётин гардонидем ва барояшон азоби оташи сӯзон омода кардаем.",
            "verse 67:6": "Ва барои касоне, ки ба Парвардигорашон кофир шудаанд, азоби ҷаҳаннам бошад ва ҷаҳаннам бад ҷои бозгаштест!",
            "verse 67:7": "Чун дар ҷаҳаннам афканда шаванд, ба ҷӯш ояд ва бонги зишташро бишнаванд.",
            "verse 67:8": "Наздик аст, ки аз хашм пора-пора шавад. Ва чун гурӯҳеро дар он (афкананд, нигаҳбононаш гӯяндашон:",
            "verse 67:9": "«Оё шуморо бимдиҳандае наёмад?» Гӯянд: «Чаро, бимдиҳанда омад, вале ӯро дурӯғ баровардем ва гуфтем; «Худо ҳеҷ чиз нозил накардааст, шумо дар гумроҳии бузурге ҳастед!»",
            "verse 67:10": "Ва мегӯянд: «Агар мо мешунидем ё ақл мекардем, аҳли ин оташи сӯзанда намебудем».",
            "verse 67:11": "Пас ба гуноҳи худ эътироф мекунанд. Эй лаънат бод бар онҳо, ки аҳли оташи сӯзандаанд!",
            "verse 67:12": "Барои касоне, ки нодида аз Парвардигорашон метарсанд бахшоишу музди фаровон аст.",
            "verse 67:13": "Чӣ пинҳон сухан гӯед ва чӣ ошкоро, Ӯ ба ҳар чӣ дар дилҳо мегузарад, доност.",
            "verse 67:14": "Оё он кӣ офарида, намедонад? Ҳол он ки Ӯ борикбину огоҳ аст.",
            "verse 67:15": "Ӯст, ки заминро роми шумо гардонид Пас бар рӯи он сайр кунед, ва аз ризқи Худо бихӯред. Чун аз қабр берун оед, ба сӯи Ӯ меравед.",
            "verse 67:16": "Оё аз он кӣ дар осмон аст, эмин нишастаед, ки ногоҳ заминро ба ларзиш дароварад ва замин шуморо дар худ фурӯ барад?",
            "verse 67:17": "Ё аз он кӣ дар осмон аст, эмин нишастаед, ки ногоҳ боде ҳамроҳ бо сангрез бар сари шумо фиристад? Ба зуди хоҳед донист, ки бим додани Ман чӣ гуна аст.",
            "verse 67:18": "Албатта касоне, ки пеш аз онҳо буданд, паёмбаронро дурӯғ бароварданд. Пас азоби Ман чӣ гуна буд!",
            "verse 67:19": "Оё паррандагонеро, ки бол кушуда ва бол кашида бар болои сарашон дар парвозанд, надидаанд? Онҳоро ҷуз Худои раҳмон касе дар ҳаво нигоҳ натавонад дошт. Ӯст, ки ба ҳама чиз биност!",
            "verse 67:20": "Оё онон, ки ёрони шумоянд, тавонанд дар баробари Худо ёриатон кунанд? Кофирон дар фиребе беш нестанд.",
            "verse 67:21": "Оё кист он кӣ ба шумо рӯзӣ диҳад, агар Ӯ рӯзии худ боздорад? На! дар саркашиву дури аз ҳақ пойдор меистанд.",
            "verse 67:22": "Оё он касе, ки нагунсор (хамшуда) бар рӯй афтода роҳ меравад, ҳидоятёфтатар аст ё он ки бар пой истода ва ба роҳи рост меравад?",
            "verse 67:23": "Бигӯ: «Ӯст, ки шуморо офаридааст ва гӯшу чашму дил додааст. Чӣ андак шукр мегузоред!»",
            "verse 67:24": "Бигӯ: «Ӯст, ки шуморо дар замин офарид ва дар қиёмат назди Ӯ ҷамъ оварда мешавед».",
            "verse 67:25": "Мегӯянд: «Агар рост мегӯед, ин ваъда чӣ вақт фаро мерасад?»",
            "verse 67:26": "Бигӯ: «Илми он назди Худост ва ман бимдиҳандае ошкорам».",
            "verse 67:27": "Кофирон чун аз наздикаш бингаранд, чеҳраашон гирифта шавад, Ва ба онҳо гуфта мешавад: «Ин аст он чӣ ботилаш мехондед!",
            "verse 67:28": "Бигӯ: «Хабар диҳед, ки агар (фаразан) Худо марову ҳамроҳонамро ҳалок кунад ё бар мо раҳмат оварад, чӣ касе кофиронро аз азоби дардовар мераҳонад?»",
            "verse 67:29": "Бигӯ: «Ӯ Худои раҳмон аст. Ба Ӯ имон овардем ва бар Ӯ таваккал кардем. Ва ба зуди, хоҳед донист, чӣ касе дар гумроҳии ошкор аст!»",
            "verse 67:30": "Бигӯ: «Хабар диҳед, агар обатон дар замин фурӯ равад, чӣ касе шуморо оби равон хоҳад дод?»"
        },
        "Tamil": {
            "verse 67:1": "எவனுடைய கையில் ஆட்சி இருக்கின்றதோ அவன் பாக்கியவான்; மேலும், அவன் எல்லாப் பொருட்களின் மீதும் பேராற்றலுடையவன்.",
            "verse 67:2": "உங்களில் எவர் செயல்களால் மிகவும் அழகானவர் என்பதைச் சோதிப்பதற்காக அவன், மரணத்தையும் வாழ்வையும் படைத்தான்; மேலும், அவன் (யாவரையும்) மிகைத்தவன்; மிக மன்னிப்பவன்.",
            "verse 67:3": "அவனே ஏழு வானங்களையும் அடுக்கடுக்காக படைத்தான்; (மனிதனே) அர்ரஹ்மானின் படைப்பில் குறையை நீர் காணமாட்டீர், பின்னும் (ஒரு முறை) பார்வையை மீட்டிப்பார்! (அவ்வானங்களில்) ஏதாவது ஓர் பிளவை காண்கிறாயா?",
            "verse 67:4": "பின்னர் இருமுறை உன் பார்வையை மீட்டிப்பார், உன் பார்வை களைத்து, மழுங்கிச் சிறுமையடைந்து உன்னிடம் திரும்பும்.",
            "verse 67:5": "அன்றியும், திட்டமாக நாமே (பூமிக்குச்) சமீபமாக இருக்கும் வானத்தை (நட்சத்திர) விளக்குகளைக் கொண்டு அலங்கரித்திருக்கின்றோம்; இன்னும், அவற்றை ஷைத்தான்களை (வெருட்டும்) எறி கற்களாகவும் நாம் ஆக்கினோம்; அன்றியும் அவர்களுக்காகக் கொழுந்து விட்டெரியும் (நரக) நெருப்பின் வேதனையைச் சித்தம் செய்திருக்கின்றோம்.",
            "verse 67:6": "இன்னும், எவர்கள் தங்கள் இறைவனை நிராகரிக்கின்றார்களோ, அவர்களுக்கு நரக வேதனை உண்டு; (அது) மிகக் கெட்ட மீளுமிடமாகும்.",
            "verse 67:7": "அதில் அவர்கள் போடப்படுவார்களாயின், அது கொதிக்கும் நிலை (கழுதையின் பெருங்குரலைப் போல்) அருவருப்பான சப்தம் உண்டாவதை அவர்கள் கேட்பார்கள்.",
            "verse 67:8": "அது கோபத்தால் வெடித்து விடவும் நெருங்குகிறது, அதில் ஒவ்வொரு கூட்டமும் போடப்படும் போதெல்லாம், \"அச்சமூட்டி எச்சரிக்கை செய்பவர் உங்களிடம் வரவில்லையா?\" என்று அதன் காவலாளிகள் அவர்களைக் கேட்பார்கள்.",
            "verse 67:9": "அதற்கவர்கள் கூறுவார்கள்; \"ஆம்! அச்சமூட்டி எச்சரிக்கை செய்பவர் திட்டமாக எங்களிடம் வந்தார், ஆனால் நாங்கள் (அவரைப்) பொய்ப்பித்து, 'அல்லாஹ் யாதொன்றையும் இறக்கவில்லை, நீங்கள் பெரும் வழிகேட்டில் அல்லாமல் வேறில்லை\" என்று சொன்னோம்.\"",
            "verse 67:10": "இன்னும் அவர்கள் கூறுவார்கள்; \"நாங்கள் (அவர் போதனையைச்) செவியுற்றோ அல்லது சிந்தித்தோ இருந்திருந்தோமானால் நாங்கள் நரகவாசிகளில் இருந்திருக்க மாட்டோம்.\"",
            "verse 67:11": "(இவ்வாறு) தங்கள் பாவங்களை அவர்கள் ஒப்புக் கொள்வார்கள் - எனவே, இந்நரகவாசிகளுக்குக் கேடுதான்.",
            "verse 67:12": "நிச்சயமாக எவர்கள் தங்கள் இறைவனை(ப் பார்க்காதிருந்தும்) அந்தரங்கத்தில் அவனுக்கு அஞ்சுகிறார்களோ, அவர்களுக்கு மன்னிப்புமுண்டு, பெரிய நற்கூலியும் உண்டு.",
            "verse 67:13": "மேலும், உங்கள் சொல்லை நீங்கள் இரகசியமாக்குங்கள், அல்லது அதை பகிரங்கமாக்குங்கள் - நிச்சயமாக அவன் இதயங்களிலுள்ளவற்றையும் மிக அறிந்தவன்.",
            "verse 67:14": "(அனைத்தையும்) படைத்தவன் அறிய மாட்டானா? அவன் நுணுக்கமாக கவனிப்பவன்; யாவற்; றையும் நன்கு தெறிந்தவன்.",
            "verse 67:15": "அவனே உங்களுக்கு இப்பூமியை (நீங்கள் வாழ்வதற்கு) வசதியாக ஆக்கினான்; ஆகவே, அதன் பல மருங்குகளிலும், நடந்து அவனுடைய உணவிலிருந்து புசியுங்கள்; இன்னும் அவனிடமே (யாவரும்) உயிர்த்தெழவேண்டியிருக்கிறது.",
            "verse 67:16": "வானத்தில் இருப்பவன் உங்களைப் பூமியில் சொறுகிவிடுவான் என்பதை பற்றி நீங்கள் அச்சமற்று இருக்கிறீர்களா? அப்போது (பூமி) அதிர்ந்து நடுங்கும்.",
            "verse 67:17": "அல்லது வானத்திலிருப்பவன் உங்கள் மீது கல்மாரியை அனுப்புவது பற்றி அச்சமற்று இருக்கிறீர்களா? ஆகவே, எனது எச்சரிக்கை (செய்யப்பட்ட வேதனை) எப்படி என்பதை விரைவில் நீங்கள் அறிந்துகொள்வீர்கள்.",
            "verse 67:18": "அன்றியும் அவர்களுக்கு முன் இருந்தார்களே அவர்களும் (நம் வசனங்களை இவ்வாறே) பொய்ப்பித்துக் கொண்டிருந்தனர், என் எச்சரிக்கை எவ்வளவு கடுமையாக இருந்தது?",
            "verse 67:19": "இறக்கைகளை விரித்துக் கொண்டும், சேர்த்துக் கொண்டும், இவர்களுக்கு மேல் (வானில் பறக்கும்) பறவைகளை இவர்கள் பார்க்கவில்லையா? அர்ரஹ்மானைத் தவிர (வேறு யாரும் கீழே விழாது) அவற்றைத் தடுத்துக் கொண்டிருக்கவில்லை - நிச்சயமாக அவன் ஒவ்வொரு பொருளையும் நோட்டமிடுகிபவன்.",
            "verse 67:20": "அன்றியும், அர்ரஹ்மானை தவிர வேறு எவர் உங்களுக்குப் பட்டாளமாக இருந்து கொண்டு உதவி செய்வார்? காஃபிர்கள் ஏமாற்றத்திலன்றி வேறில்லை.",
            "verse 67:21": "அல்லது, தான் உணவளிப்பதை அவன் தடுத்துக் கொண்டால், உங்களுக்கு உணவளிப்பவர் யார்? அப்படியல்ல, ஆனால், இவர்கள் மாறு செய்வதிலும் (சத்தியத்தை) வெறுப்பதிலும் ஆழ்ந்திருக்கின்றனர்.",
            "verse 67:22": "முகம் குப்புற விழுந்து செல்பவன் மிக நேர்வழி அடைந்தவனா? அல்லது நேரான பாதையில் செவ்வையாக நடப்பவ(ன் மிக நேர்வழி அடைந்தவ)னா.",
            "verse 67:23": "(நபியே!) நீர் கூறுவீராக: \"அவனே உங்களைப் படைத்து உங்களுக்குச் செவிப்புலனையும், பார்வைகளையும் இதயங்களையும் அமைத்தான்; (எனினும்) மிகவும் சொற்பமாகவே நீங்கள் நன்றி செலுத்துகிறீர்கள்.\"",
            "verse 67:24": "\"அவனே உங்களைப் பூமியின் (பல பாகங்களிலும்) பரவச் செய்தான், அன்றியும், அவனிடமே நீங்கள் ஒன்று திரட்டப்படுவீர்கள்\" என்று கூறுவீராக.",
            "verse 67:25": "ஆயினும், \"நீங்கள் உண்மையாளர்களாக இருந்தால், வாக்களிக்கப்பட்ட (மறுமையான)து எப்பொழுது (வரும்)?\" என்று (காஃபிர்கள்) கேட்கிறார்கள்.",
            "verse 67:26": "\"இதைப் பற்றி ஞானம் நிச்சயமாக அல்லாஹ்விடமே தான் இருக்கிறது, தவிர, நிச்சயமாக நான் தெளிவாக அச்சமூட்டி எச்சரிக்கை செய்பவன் தான்\" என்று (நபியே!) நீர் கூறும்.",
            "verse 67:27": "எனவே, அது நெருங்கி வருவதை அவர்கள் காணும் போது நிராகரிப்போரின் முகங்கள் (நிறம் பேதலித்துக்) கெட்டுவிடும், இன்னும், \"நீங்கள் எதை வேண்டிக் கொண்டிருந்தீர்களோ, அது இது தான்\" என்று அவர்களுக்குக் கூறப்படும்.",
            "verse 67:28": "கூறுவீராக: அல்லாஹ், என்னையும் என்னுடன் இருப்பவர்களையும் (நீங்கள் ஆசிப்பது போல்) அழித்து விட்டாலும், அல்லது (நாங்கள் நம்புவது போல்) அவன் எங்கள் மீது கிருபை புரிந்தாலும், நோவினை செய்யும் வேதனையை விட்டு, காஃபிர்களைக் காப்பவர் யார் என்பதை கவனித்தீர்களா?",
            "verse 67:29": "(நபியே!) நீர் கூறும்: (எங்களைக் காப்பவன்) அவனே - அர்ரஹ்மான், அவன் மீதே நாங்கள் ஈமாக் கொண்டோம், மேலும் அவனையே முற்றிலும் சார்ந்திருக்கிறோம் - எனவே, வெகு சீக்கிரத்தில் பகிரங்கமான வழி கேட்டிலிருப்பவர் யார் என்பதை நீங்கள் அறிவீர்கள்!\"",
            "verse 67:30": "(நபியே!) நீர் கூறும்: உங்களின் தண்ணீர் பூமியினுள் (உறிஞ்சப்பட்டுப்) போய்விட்டால், அப்பொழுது ஓடும் நீரை உங்களுக்குக் கொண்டு வருபவன் யார்? என்பதை கவனித்தீர்களா? என்று (எனக்கு அறிவியுங்கள்)."
        },
        "Tatar": {
            "verse 67:1": "Аның кулында ике дөньяның патшалыгы булган Аллаһ мүбарәк вә олугъ булды, Ул – Аллаһ һәрнәрсәгә көче җитүчедер.",
            "verse 67:2": "Ул үлемне һәм тереклекне халык кылды, йөкләмәләр йөкләп сезне сынамак өчен, кайсыларыгыз яхшырак гамәлле икәнлеген белмәк өчен, Ул һәрнәрсәдән өстен вә ярлыкаучы.",
            "verse 67:3": "Ул – Аллаһ кат-кат итеп җиде күкне халык кылды. Аллаһ халык кылган нәрсәләрдә үлчәүсезлекне күрмәссең. Күзеңне кайтарып күккә карагыл анда берәр ярыкны, кимчелекне күрерсеңме?",
            "verse 67:4": "Соңра икенче кат күзеңне кайтарып карагыл, әгәр карасаң күзең арып-талып өметсезләнеп кире кайтыр кимчелекне күрмәссең.",
            "verse 67:5": "Тәхкыйк дөнья күген яктыртучы йолдызлар белән зиннәтләдек, вә ул йолдызларны шайтаннарга атылучы кылдык, вә ул шайтаннарга кыздырылган ут ґәзабын хәзерләдек.",
            "verse 67:6": "Дәхи Раббыларына карышып кәфер булган кешеләргә җәһәннәм ґәзабыдыр, ул ут ни ямандыр.",
            "verse 67:7": "Кәферләр ул җәһәннәмгә ташлансалар, анда ишәк тавышы кеби яман тавыш ишетерләр вә ул җәһәннәм кайнар.",
            "verse 67:8": "Ул җәһәннәмгә бер фирка салынса, ул җәһәннәмнең сакчылары: \"Сезгә бу җәһәннәм белән куркытучы пәйгамбәрләр килмәдеме\", – дип сорарлар.",
            "verse 67:9": "Кәферләр әйтерләр: \"Дөреслектә безгә бу җәһәннәм белән куркытучы пәйгамбәрләр килде дә бит, без аларны ялганга тоттык һәм әйттек: \"Аллаһ сезгә һич нәрсә иңдермәде, сүзләрегез ялган, сез каты саташу илә саташкан кешеләрдән башка түгелсез\", – дип.",
            "verse 67:10": "Ул кәферләр янә әйтерләр: \"Әгәр без ул пәйгамбәрләрнең хак сүзләрен тыңлап кабул иткән булсак, яки алар өйрәткән шәригать хөкемнәрен аңлап гамәл кылган булсак, кыздырылган ут әһелләре эчендә булмас идек\", – дип.",
            "verse 67:11": "Эш узгач гөнаһларын таныдылар, без ґәепле диделәр, кыздырылган ут әһелләренә Аллаһуның рәхмәте гаять ерактыр!",
            "verse 67:12": "Тәхкыйк Раббыларының күренмәгән ґәзабыннан күргән кеби куркучы хак мөэминнәр, аларгадыр Аллаһуның ярлыкавы һәм олугъ әҗер.",
            "verse 67:13": "Сүзләрегезне кирәк яшерен сөйләгез, кирәк – аны кычкырып сөйләгез. Тәхкыйк Ул – Аллаһ күкрәкләр эчендә булган уйларны бик яхшы беләдер.",
            "verse 67:14": "Әйә Үзе халык кылган күкрәкләрне вә күңелләрне белмәсме? Вә Ул – Аллаһ һәрнәрсәне белеме илә чорнап алучы вә бик нечкә нәрсәләрдән дә хәбәрдар.",
            "verse 67:15": "Ул – Аллаһ сезгә җирне йөрергә уңай кылды, ул җирнең җилкәсендә йөрегез теләгән җирендә яшәгез вә ул җирнең хәләл ризыкларын ашагыз, вә үлгәннән соң терелеп бармак Аллаһу хозурынадыр.",
            "verse 67:16": "Әйә сез кешеләр тыныч булдыгызмы күктәге фәрештәләрнең сезгә ґәзаб алып килүләреннән җиргә йоттырулары белән, җир сезне астына алганчы хәрәкәтләнер.",
            "verse 67:17": "Әйә сез тыныч булдыгызмы күктәге фәрештәләрнең таш яудыра торган каты җил белән сезне һәлак итүләреннән? Тиздән белерсез Безнең куркытуыбызның хаклыгын!",
            "verse 67:18": "Тәхкыйк бу кәферләрдән элгәреге кәферләр пәйгамбәрләрне ялганга тоттылар, аларга Минем мәкерем, ґәзаб белән тотмаклыгым ничек булды?",
            "verse 67:19": "Әйә алар күрмиләрме, гыйбрәт күзе илә карамыйлармы өсләрендә очып йөргән кошларга, канатларын җәярләр һәм кабыргаларын кысарлар. Ул кошларны һавада тотучы юк, мәгәр Аллаһ Үзе генә тотадыр, Ул – Аллаһ һәр нәрсәне күрүчедер.",
            "verse 67:20": "Аллаһудан башка кая сезгә ярдәм итүче ґәскәр, ошбу сынымнарыгызмы сезгә ярдәм итүче? Кәферләрнең эше һичнәрсә түгел, мәгәр адашып алдану гынадыр.",
            "verse 67:21": "Кая Аллаһудан башка сезләрне кем ризыкландыра, әллә сынымнарыгыз яки патшаларыгыз ризыкландырамы? Әгәр Аллаһ бирә торган ризыгын бирмичә туктатып куйса? Бәлки кәферләр моны белә торып тәкәбберләнеп карышмакта һәм хактан качмакта таза тордылар.",
            "verse 67:22": "Әйә хаклыкны күрмәскә вә Коръән нуры илә файдаланмаска тырышып йөзтүбән аяк астына гына карап йөргән кешеме туры юлга күнелүчерәк, яки Коръән вә сөннәт белән танышып, хак белән батыл арасын аерып туры юлны карап, күреп барган кешеме хак юлга күнелүчерәк?",
            "verse 67:23": "Әйт: \"Ул – Аллаһ сезне юктан бар кылды вә сезгә хак сүзне ишетмәк өчен колак бирде, вә гыйбрәтләрне күрмәк өчен күз бирде, вә фикерләп хак белән батылны аермак өчен күңел бирде, бу нигъмәтләргә караганда сезнең шөкер итүләрегез бик аздыр.",
            "verse 67:24": "Әйт: \"Ул – Аллаһ сезне җирдә яратты, вә Аның хозурына кубарылырсыз\".",
            "verse 67:25": "Кәферләр әйтәләр: \"вәгъдә ителгән кыямәт көне кайчан була, дөрес сөйләүчеләрдән булсагыз, әйтегез?\" – дип.",
            "verse 67:26": "Әйт: \"Шиксез, ул кыямәтнең вакытын Аллаһ кына белер, вә мин фәкать хисаб вә ґәзаб белән куркытучы гынамын.",
            "verse 67:27": "Һәм ґәзабны бик якыннан күргәннәре вакытта, хакны инкяр итүче кәферләрнең йөзләре каралыр, вә аларга әйтелер: \"Бу – шул ґәзабтыр, сез аны ашыгып көтәдер идегез!\"",
            "verse 67:28": "Әйт: \"Ничек уйлыйсыз, әгәр Аллаһ мине һәм минем белән бергә булган мөэминнәрне һәлак итсә, яки рәхмәт итеп безне исән калдырса, хакны инкяр итүче кәферләрне рәнҗеткүче каты ґәзабтан кем коткарыр?\"",
            "verse 67:29": "Әйт: \"Ул – безнең Раббыбыз барча нәрсәгә рәхмәте ирешкүчедер, вә без Аңа иман китердек һәм Аңа тәвәккәл кылдык. Тиздән күрерсез, кем ачык адашып саташуда икәнлеген!\"",
            "verse 67:30": "Әйт: \"Ничек уйлыйсыз, әгәр сезнең суыгыз һич ала алмаслык тирән җир астына киткән булып әверелсә, кем китерер сезгә кайнап агучы чишмә суларын?\""
        },
        "Telugu": {
            "verse 67:1": "ఎవరి చేతిలోనయితే విశ్వసామ్రాజ్యాధిపత్యం ఉందో! ఆయన సర్వశ్రేష్ఠుడు (శుభదాయకుడు) మరియు ఆయన ప్రతిదీ చేయగల సమర్ధుడు",
            "verse 67:2": "ఆయనే! మీలో మంచిపనులు చేసే వారెవరో పరీక్షించటానికి, చావు-బ్రతుకులను సృష్టించాడు. మరియు ఆయన సర్వశక్తిమంతుడు, క్షమాశీలుడు",
            "verse 67:3": "ఆయనే ఒకదానిపై ఒకటి ఏడు ఆకాశాలను సృష్టించాడు. ఆ అనంత కరుణా మయుని సృష్టిలో నీవు ఎలాంటి లోపాన్నీ చూడలేవు. కావాలంటే మరొకసారి చూడు: ఏమీ? నీకేమైనా లోపం కనిపిస్తుందా",
            "verse 67:4": "ఇంకా, మాటిమాటికీ నీ చూపులు త్రిప్పి చూడు. అది (నీ చూపు) విఫలమై అలిసి సొలిసి తిరిగి నీ వైపుకే వస్తుంది",
            "verse 67:5": "మరియు వాస్తవంగా, మేము భూమికి దగ్గరగా ఉన్న ఆకాశాన్ని దీపాలతో అలంకరించాము. మరియు వాటిని, షైతాన్ లను తరిమి కొట్టే సాధనాలుగా చేశాము. మరియు వారి కొరకు (షైతానుల కొరకు) మేము భగభగ మండే అగ్నిజ్వాలల శిక్షను సిద్ధపరచి ఉంచాము",
            "verse 67:6": "మరియు తన ప్రభువును (అల్లాహ్ ను) తిరస్కరించే వారికి నరకశిక్ష ఉంది. అది ఎంత చెడ్డ గమ్యస్థానం",
            "verse 67:7": "వారు అందులోకి విసిరి వేయ బడినప్పుడు వారు దాని (భయంకరమైన) గర్జనను వింటారు. మరియు అది మరిగి పొంగుతూ ఉంటుంది",
            "verse 67:8": "అది దాదాపు ఉద్రేకంగా ప్రేలిపోతూ ఉంటుంది. ప్రతిసారి అందులోకి (పాపుల) గుంపు పడవేయబడి నప్పుడు! దాని కాపలాదారులు వారితో: ఏమీ? మీ వద్దకు ఏ హెచ్చరిక చేసేవాడు రాలేదు?\" అని ప్రశ్నిస్తారు",
            "verse 67:9": "వారంటారు: ఎందుకు రాలేదు! వాస్తవానికి మా వద్దకు హెచ్చరిక చేసేవాడు వచ్చాడు, కాని మేము అతనిని అసత్యుడవని తిరస్కరించాము మరియు అతనితో ఇలా అన్నాము: `అల్లాహ్ దేనినీ (ఏ దివ్యజ్ఞానాన్ని) అవతరింప జేయలేదు; మీరు కేవలం ఘోర మార్గభ్రష్టత్వంలో పడి ఉన్నారు",
            "verse 67:10": "ఇంకా వారు ఇలా అంటారు: ఒకవేళ మేము విని ఉంటే లేదా గ్రహించి ఉంటే, మేము మండే అగ్నిజ్వాలలో పడి వుండే వారితో చేరే వారము కాము కదా",
            "verse 67:11": "అప్పుడు వారే స్వయంగా తమ పాపాన్ని ఒప్పుకుంటారు. కావున భగభగమండే అగ్నిజ్వాలలు దూరమై పోవుగాక",
            "verse 67:12": "నిశ్చయంగా, ఎవరైతే అగోచరుడైన తమ ప్రభువుకు భయపడతారో! వారికి క్షమాపణ మరియు గొప్ప ప్రతిఫలం ఉంటాయి",
            "verse 67:13": "మరియు మీరు మీ మాటలను రహస్యంగా ఉంచినా సరే! లేక వాటిని వెల్లడి చేసినా సరే! నిశ్చయంగా, ఆయనకు హృదయాల స్థితి బాగా తెలుసు",
            "verse 67:14": "ఏమిటీ? పుట్టించిన వాడికే తెలియదా? మరియు ఆయన సూక్ష్మగ్రాహి, సర్వం తెలిసినవాడు",
            "verse 67:15": "భూమిని మీ అధీనంలో ఉంచినవాడు ఆయనే! కావున మీరు దాని దారులలో తిరగండి. మరియు ఆయన ప్రసాదించిన జీవనోపాధిని తినండి, మరియు మీరు ఆయన వైపునకే సజీవులై మరలి పోవలసి ఉంది",
            "verse 67:16": "ఏమీ? మీరు నిర్భయంగా ఉన్నారా? ఆకాశాలలో ఉన్నవాడు, మిమ్మల్ని భూమిలోకి అణగద్రొక్కడని, ఎప్పుడైతే అది తీవ్రకంపనాలకు గురి అవుతుందో",
            "verse 67:17": "లేక ఆకాశాలలో ఉన్నవాడు, మీపైకి రాళ్ళు కురిపించే గాలివాన పంపడని మీరు నిర్భయంగా ఉన్నారా? నా హెచ్చరిక ఎలాంటిదో అప్పుడు మీరు తెలుసుకోగలరు",
            "verse 67:18": "మరియు వాస్తవానికి వారికి పూర్వం గతించిన వారు కూడా (ప్రవక్తలను) తిరస్కరించారు. నా పట్టు (శిక్ష) ఎంత తీవ్రంగా ఉండిందో (చూశారా)",
            "verse 67:19": "ఏమీ? వారు తమ ఎగిరే పక్షులు రెక్కలను ఎలా చాపుతూ ముడుచుకుంటూ, ఎగురుతున్నాయో చూడటం లేదా? ఆ అనంత కరుణామయుడు తప్ప మరెవ్వరూ వాటిని అలా నిలిపి ఉంచలేరు కదా! నిశ్చయంగా ఆయన ప్రతి దానినీ చూస్తున్నాడు",
            "verse 67:20": "ఏమీ? అనంత కరుణామయుడు తప్ప మీకు సేన వలే అడ్డుగా నిలిచి, మీకు సహాయపడ గల వాడెవడైనా ఉన్నాడా? ఈ సత్యతిరస్కారులు కేవలం మోసంలో పడి వున్నారు",
            "verse 67:21": "ఒకవేళ ఆయన మీ జీవనోపాధిని ఆపి వేస్తే, మీకు జీవనోపాధి ఇచ్చేవాడు ఎవడున్నాడు? అయినా వారు తలబిరుసుతనంలో మునిగి (సత్యానికి) దూరమై పోతున్నారు",
            "verse 67:22": "ఏమీ? ఎవడైతే తన ముఖం మీద దేవులాడుతూ నడుస్తాడో, అతడు సరైన మార్గం పొందుతాడా? లేక చక్కగా ఋజుమార్గం మీద నడిచేవాడు పొందుతాడా",
            "verse 67:23": "వారితో ఇలా అను: ఆయనే మిమ్మల్ని సృజించాడు. మరియు ఆయనే మీకు వినికిడినీ, దృష్టినీ మరియు హృదయాలనూ ఇచ్చాడు. (అయినా) మీరు కృతజ్ఞతలు తెలిపేది చాలా తక్కువ",
            "verse 67:24": "(ఇంకా) ఇలా అను: ఆయనే మిమ్మల్ని భూమిలో వ్యాపింపజేశాడు మరియు ఆయన వద్దనే మీరంతా సమావేశ పరచబడతారు",
            "verse 67:25": "మరియు వారు ఇలా అడుగుతున్నారు: మీరు సత్యవంతులే అయితే, ఈ వాగ్దానం ఎప్పుడు నెరవేరనున్నది",
            "verse 67:26": "వారితో ఇలా అను: నిశ్చయంగా, దాని జ్ఞానం కేవలం అల్లాహ్ కే ఉంది. మరియు నేను స్పష్టంగా హెచ్చరిక చేసే వాడిని మాత్రమే",
            "verse 67:27": "తరువాత వారు దానిని సమీపంలో ఉండటం చూసినప్పుడు, సత్యతిరస్కారుల ముఖాలు దుఃఖంతో నిండి నల్లబడిపోతాయి. మరియు వారితో ఇలా అనబడుతుంది: మీరు దేనినయితే అడుగుతూ ఉండేవారో అది (ఆ వాగ్దానం) ఇదే",
            "verse 67:28": "(ఓ ప్రవక్తా!) వారితో ఇలా అను: ఏమీ? మీరు ఆలోచించరా? ఒకవేళ అల్లాహ్ నన్ను మరియు నా తోటి వారిని నాశనం చేయనూ వచ్చు! లేదా మమ్మల్ని కరుణించనూ వచ్చు. కాని సత్యతిరస్కారులను బాధాకరమైన శిక్ష నుండి ఎవడు రక్షించగలడు",
            "verse 67:29": "వారితో ఇంకా ఇలా అను: ఆయనే అనంత కరుణామయుడు, మేము ఆయననే విశ్వసించాము మరియు ఆయననే నమ్ముకున్నాము. ఇక ఎవరు స్పష్టమైన మార్గభ్రష్టత్వంలో పడి ఉన్నారో త్వరలోనే మీరు తెలుసుకోగలరు",
            "verse 67:30": "వారితో ఇలా అను: ఏమీ? మీరు ఆలోచించరా? ఒకవేళ మీ బావులలోని నీరు, భూమిలోనికి ఇంకి పోతే, ప్రవహించే ఈ నీటి ఊటలను మీ కొరకు ఎవడు బయటికి తేగలడు"
        },
        "Thai": {
            "verse 67:1": "ความเจริญสุขจงมีแด่พระผู้ซึ่งอำนาจอยู่ในพระหัตถ์ของพระองค์ และพระองค์คือผู้ทรงอานุภาพเหนือทุกสิ่งทุกอย่าง",
            "verse 67:2": "พระผู้ทรงให้มีความตายและให้มีความเป็น เพื่อจะทดสอบพวกเจ้าว่า ผู้ใดบ้างในหมู่พวกเจ้าที่มีผลงานดียิ่ง และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงให้อภัยเสมอ",
            "verse 67:3": "พระผู้ทรงสร้างชั้นฟ้าทั้งเจ็ดเป็นชั้น ๆ เจ้าจะไม่เห็นแต่อย่างใดในความไม่ได้สัดส่วนในการสร้างของพระผู้ทรงกรุณาปรานี ดังนั้นเจ้าจงหันกลับมามองดูซิ เจ้าเห็นรอยร้าวหรือช่องโหว่บ้างไหม ?",
            "verse 67:4": "แล้วจงหันกลับมามองอีกเป็นครั้งที่สอง สายตานั้นก็จะกลับมายังเจ้าด้วยการยอมจำนนและในสภาพที่ละเหี่ย",
            "verse 67:5": "และโดยแน่นอนเราได้ประดับท้องฟ้าของโลกนี้ด้วยดวงดาวเป็นแสงประทีป และเราได้ทำให้มันเป็นอาวุธไล่ชัยฏอน และเราได้เตรียมการลงโทษด้วยไฟอันร้อนแรงสำหรับพวกมัน",
            "verse 67:6": "และสำหรับบรรดาผู้ปฏิเสธศรัทธาต่อพระเจ้าของพวกเขานั้น คือการลงโทษแห่งนรกญะฮันนัม และมันเป็นทางกลับที่ชั่วช้ายิ่ง",
            "verse 67:7": "เมื่อพวกเขาถูกโยนลงไปในนรกพวกเขาจะได้ยินเสียงของมันครวญครางขณะที่มันกำลังกเดือนพล่าน",
            "verse 67:8": "มันแทบจะระเบิดออกไปเพราะความเคียดแค้น ทุกครั้งที่พวกหนึ่งถูกโยนลงไปในมัน ยามเฝ้านรกจะถามพวกเขาว่า มิได้มีผู้ตักเตือนมายังพวกเจ้าดอกหรือ",
            "verse 67:9": "พวกเขากล่าวว่า มี ได้มีผู้ตักเตือนมายังเรา แต่พวกเราได้ปฏิเสธ และเรากล่าวอีกว่า อัลลอฮฺมิได้ทรงประทานสิ่งใดลงมาพวกท่านต่างหากที่อยู่ในการหลงผิดอย่างมาก",
            "verse 67:10": "และพวกเขากล่าวอีกว่า หากพวกเราฟังและใช้สติปัญญาใคร่ครวญ พวกเราก็จะมิได้มาอยู่เป็นชาวนรกอย่างนี้ดอก",
            "verse 67:11": "พวกเขายอมสารภาพในความผิดของพวกเขา แต่มันห่างไกลไปเสียแล้วสำหรับชาวนรก",
            "verse 67:12": "แท้จริงบรรดาผู้ยำเกรงต่อพระเจ้าของพวกเขาโดยทางลับ สำหรับพวกเขาจะได้รับการอภัยโทษและรางวัลอันใหญ่หลวง",
            "verse 67:13": "และพวกเจ้าจงปิดบังคำพูดของพวกเจ้าหรือเปิดเผยมันก็ตาม แท้จริงพระองค์ทรงรอบรู้สิ่งที่อยู่ในทรวงอก",
            "verse 67:14": "พระผู้ทรงสร้างจะมิทรงรอบรู้ดอกหรือ ? พระองค์คือผู้ทรงรอบรู้อย่างถี่ถ้วนผู้ทรงตระหนักยิ่ง",
            "verse 67:15": "พระองค์คือผู้ทรงทำแผ่นดินนี้ให้ราบเรียบสำหรับพวกเจ้า ดังนั้นจงสัญจรไปตามขอบเขตของมันและจงบริโภคจากปัจจัยยังชีพของพระองค์ และยังพระองค์เท่านั้นการฟื้นคืนชีพ",
            "verse 67:16": "พวกเจ้าจะปลอดภัยละหรือ จากการที่พระองค์ทรงสถิตย์อยู่ ณ ฟากฟ้าจะให้แผ่นดินสูบพวกเจ้าแล้วขณะนั้นมันจะหวั่นไหว",
            "verse 67:17": "หรือว่าพวกเจ้าจะปลอดภัยจากการที่พระผู้ทรงสถิตย์อยู่ ณ ฟากฟ้า จะทรงส่งลมหอบก้อนกรวดให้กระหน่ำมายัง พวกเจ้า แล้วพวกเจ้าจะได้รู้ว่าการตักเตือนของข้าเป็นเช่นใด ?",
            "verse 67:18": "และโดยแน่นอน บรรดา (หมู่ชน) ก่อนหน้าพวกเขาได้ปฏิเสธมาก่อนแล้ว ดังนั้นการปฏิเสธคำเตือนของข้ามีผลเป็นอย่างไร?",
            "verse 67:19": "พวกเขามิได้มองไปดูนกที่ (บิน) อยู่เบื้องบนพวกเขาดอกหรือ? มันกาวปีกและหุบปีก (ของมัน) ไม่มีผู้ใดจะไปดึงมันไว้ได้นอกจากพระผู้ทรงกรุณาปรานี แท้จริงพระองค์ทรงมองเห็นทุกสิ่งอย่าง",
            "verse 67:20": "หรือผู้ใดเล่า ซึ่งเขาเป็นพลพรรคของพวกเจ้าที่จะช่วยเหลือพวกเจ้าอื่นจากพระผู้ทรงกรุณาปรานี? พวกปฏิเสธศรัทธานั้นมิใช่อื่นใดเลยนอกจากในการหลอกลวงเท่านั้น",
            "verse 67:21": "หรือผู้ใดเล่าซึ่งเขาจะให้ปัจจัยยังชีพแก่พวกเจ้า หากพระองค์ทรงระงับปัจจัยยังชีพของพระองค์ไว้ แต่ว่าพวกเจ้าดื้อรั้นอยู่ในความหยิ่งยะโส และห่าไกลจากความจริง",
            "verse 67:22": "ผู้ที่เดินคว่ำคมำบนใบหน้าของเขาจะเป็นผู้ที่อยู่ในแนวทางที่ถูกต้องกว่า หรือว่าผู้ที่เดินตัวตรงอยู่บนแนวทางที่เที่ยงตรง",
            "verse 67:23": "จงกล่าวเถิดมุฮัมมัด พระองค์คือผู้ทรงบังเกิดพวกเจ้าจะขอบคุณ",
            "verse 67:24": "จงกล่าวเถิดมุฮัมมัด พระองค์เป็นผู้ทรงแพร่เผ่าพันธ์ของพวกเจ้าในแผ่นดินและพวกเจ้าจะถูกรวบรวมให้กลับไปหาพระองค์",
            "verse 67:25": "และพวกเขากล่าวว่า เมื่อใดเล่าสัญญานี้จะเกิดขึ้น หากพวกท่านเป็นผู้สัตย์จริง",
            "verse 67:26": "จงกล่าวเถิดมุฮัมมัด ความรู้ในเรื่องนั้นอยู่ที่อัลลอฮฺ ความจริงฉันเป็นเพียงผู้ตักเตือนอันแจ่มแจ้งเท่านั้น",
            "verse 67:27": "ต่อเมื่อพวกเขาเห็นมัน (การลงโทษ) ใกล้เข้ามาแล้ว ใบหน้าของบรรดาผู้ปฏิเสธศรัทธาก็จะหม่นหมอง และจะมีเสียงกล่าวว่า นี่คือสิ่งที่่พวกเจ้าร้องขอ (ในโลกดุนยา)",
            "verse 67:28": "จงกล่าวเถิดมุฮัมมัด พวกท่านจะบอกฉันซิว่า หากอัลลอฮฺจะทรงทำลายฉันและผู้ที่อยู่ร่วมกับฉันหรือจะทรงเมตตาแก่พวกเรา ดังนั้นผู้ใดเล่าจะช่วยพวกปฏิเสธศรัทธาให้พ้นจากการลงโทษอันเจ็บปวด",
            "verse 67:29": "จงกล่าวเถิดมุฮัมมัด พระองค์คือพระผู้ทรงกรุณาปราณี เราศรัทธาต่อพระองค์แล้วเราขอมอบหมายแด่พระองค์แล้วจะได้รู้ว่าใครผู้ใดอยู่ในการหลงผิดอันชัดแจ้ง",
            "verse 67:30": "จงกล่าวเถิดมุฮัมมัด พวกท่านจงบอกฉันซิว่า หากแหล่งน้ำของพวกท่านเหือดแห้งลง ดังนั้นผู้ใดเล่าจะนำน้ำที่ท่วมทันมาให้พวกท่าน"
        },
        "Turkish": {
            "verse 67:1": "Hükümranlık elinde olan Allah yücedir ve O herşeye Kadir'dir.",
            "verse 67:2": "Hanginizin daha iyi iş işlediğini belirtmek için, ölümü ve dirimi (hayatı) yaratan O'dur. O, güçlüdür, bağışlayandır.",
            "verse 67:3": "Gökleri yedi kat üzerine yaratan O'dur. Rahman'ın bu yaratmasında bir düzensizlik bulamazsın. Gözünü bir çevir bak, bir çatlak görebilir misin?",
            "verse 67:4": "Bir aksaklık bulmak için gözünü tekrar tekrar çevir bak; ama göz umduğunu bulamayıp bitkin ve yorgun düşer.",
            "verse 67:5": "And olsun ki, yakın göğü kandillerle donattık, onları şeytanlar için taşlamalar yaptık ve şeytanlara çılgın alev azabını hazırladık.",
            "verse 67:6": "Rablerini inkar eden kimseler için cehennem azabı vardır. Ne kötü bir dönüştür!",
            "verse 67:7": "Oraya atıldıkları zaman, onun kaynarken çıkardığı uğultuyu işitirler.",
            "verse 67:8": "Nerede ise öfkesinden paralanacak! İçine her bir topluluğun atılmasında, bekçileri onlara: \"Size bir uyarıcı gelmemiş miydi?\" diye sorarlar.",
            "verse 67:9": "Onlar: \"Evet; doğrusu bize bir uyarıcı geldi, fakat biz yalanladık ve Allah hiçbir şey indirmemiştir, siz büyük bir sapıklık içindesiniz demiştik\" derler.",
            "verse 67:10": "\"Eğer kulak vermiş veya akletmiş olsaydık, çılgın alevli cehennemlikler içinde olmazdık\" derler.",
            "verse 67:11": "Böylece, günahlarını itiraf ederler. Çılgın alevli cehennemlikler yok olsunlar!",
            "verse 67:12": "Doğrusu, görünmediği halde Rablerinden korkanlara, onlara, bağışlanma ve büyük ecir vardır.",
            "verse 67:13": "Sizler, sözlerinizi gizleseniz de açıklasanız da birdir; O, kalblerde olanı bilir.",
            "verse 67:14": "Yaratan bilmez olur mu? O, Latif'tir, haberdardır.",
            "verse 67:15": "Yeryüzünü, size boyun eğdiren O'dur; öyleyse yerin sırtlarında dolaşın, Allah'ın verdiği rızıktan yiyin; sonunda dönüş O'nadır.",
            "verse 67:16": "Gökte olanın sizi yerin dibine geçirmesinden güvende misiniz? O zaman, yer, sarsıldıkça sarsılır.",
            "verse 67:17": "Gökte olanın başınıza taş yağdırmasından güvende misiniz? Benim uyarmamın nasıl olduğunu yakında bileceksiniz.",
            "verse 67:18": "And olsun ki, bunlardan öncekiler de yalanlamışlardı. Beni inkar etmek nasılmış?",
            "verse 67:19": "Üzerlerinde kanat çırpan dizi dizi kuşları görmezler mi? Onları havada Rahman olan Allah'tan başkası tutmuyor; doğrusu, O, herşeyi görendir.",
            "verse 67:20": "Yahut, Rahman olan Allah'ın dışında size yardımda bulunabilecek taraftarlarınız kimdir? İnkarcılar sadece aldanmaktadırlar.",
            "verse 67:21": "Allah size verdiği rızkı kesiverirse, size rızık verecek başka kim vardır? Hayır; onlar, azgınlık ve nefrette direnmektedirler.",
            "verse 67:22": "Yüzükoyun sürünen mi, yoksa doğru yolda düpedüz yürüyen mi daha doğru yoldadır?",
            "verse 67:23": "De ki: \"Sizi yaratan sizin için kulaklar, gözler ve kalbler var eden O'dur. Ne az şükrediyorsunuz!\"",
            "verse 67:24": "Sizi yerde yaratıp yayan O'dur ve O'nun huzurunda toplanacaksınız.",
            "verse 67:25": "\"Doğru sözlü iseniz bildirin bu azap sözü ne zamandır?\" derler.",
            "verse 67:26": "De ki: \"Onu bilmek ancak Allah'a mahsustur. Ben sadece apaçık bir uyarıcıyım.\"",
            "verse 67:27": "Azabı yaklaşırken gördükleri zaman, inkar edenlerin yüzleri çirkinleşip kararır; onlara: \"Sizin arayıp durduğunuz işte budur\" denir.",
            "verse 67:28": "De ki: \"Allah, beni ve benimle beraber bulunanları isterse yok eder veya isterse merhamet eder; söyleyin, bu takdirde inkarcıları, can yakıcı azabdan kim alıkoyabilir?\"",
            "verse 67:29": "De ki: \"Bizim inandığımız ve kendisine güvendiğimiz, Rahman olan Allah'tır. Kimin apaçık bir sapıklıkta olduğunu yakında bileceksiniz.\"",
            "verse 67:30": "De ki: \"Suyunuz yere batarsa, söyleyin, size kim temiz bir su kaynağı getirebilir?\""
        },
        "Urdu": {
            "verse 67:1": "وہ (خدا) جس کے ہاتھ میں بادشاہی ہے بڑی برکت والا ہے۔ اور وہ ہر چیز پر قادر ہے",
            "verse 67:2": "اسی نے موت اور زندگی کو پیدا کیا تاکہ تمہاری آزمائش کرے کہ تم میں کون اچھے عمل کرتا ہے۔ اور وہ زبردست (اور) بخشنے والا ہے",
            "verse 67:3": "اس نے سات آسمان اوپر تلے بنائے۔ (اے دیکھنے والے) کیا تو (خدا) رحمٰن کی آفرینش میں کچھ نقص دیکھتا ہے؟ ذرا آنکھ اٹھا کر دیکھ بھلا تجھ کو (آسمان میں) کوئی شگاف نظر آتا ہے؟",
            "verse 67:4": "پھر دو بارہ (سہ بارہ) نظر کر، تو نظر (ہر بار) تیرے پاس ناکام اور تھک کر لوٹ آئے گی",
            "verse 67:5": "اور ہم نے قریب کے آسمان کو (تاروں کے) چراغوں سے زینت دی۔ اور ان کو شیطان کے مارنے کا آلہ بنایا اور ان کے لئے دہکتی آگ کا عذاب تیار کر رکھا ہے",
            "verse 67:6": "اور جن لوگوں نے اپنے پروردگار سے انکار کیا ان کے لئے جہنم کا عذاب ہے۔ اور وہ برا ٹھکانہ ہے",
            "verse 67:7": "جب وہ اس میں ڈالے جائیں گے تو اس کا چیخنا چلانا سنیں گے اور وہ جوش مار رہی ہوگی",
            "verse 67:8": "گویا مارے جوش کے پھٹ پڑے گی۔ جب اس میں ان کی کوئی جماعت ڈالی جائے گی تو دوزخ کے داروغہ ان سے پوچھیں گے کہ تمہارے پاس کوئی ہدایت کرنے والا نہیں آیا تھا؟",
            "verse 67:9": "وہ کہیں گے کیوں نہیں ضرور ہدایت کرنے والا آیا تھا لیکن ہم نے اس کو جھٹلا دیا اور کہا کہ خدا نے تو کوئی چیز نازل ہی نہیں کی۔ تم تو بڑی غلطی میں (پڑے ہوئے) ہو",
            "verse 67:10": "اور کہیں گے اگر ہم سنتے یا سمجھتے ہوتے تو دوزخیوں میں نہ ہوتے",
            "verse 67:11": "پس وہ اپنے گناہ کا اقرار کرلیں گے۔ سو دوزخیوں کے لئے (رحمت خدا سے) دور ہی ہے",
            "verse 67:12": "(اور) جو لوگ بن دیکھے اپنے پروردگار سے ڈرتے ہیں ان کے لئے بخشش اور اجر عظیم ہے",
            "verse 67:13": "اور تم (لوگ) بات پوشیدہ کہو یا ظاہر۔ وہ دل کے بھیدوں تک سے واقف ہے",
            "verse 67:14": "بھلا جس نے پیدا کیا وہ بےخبر ہے؟ وہ تو پوشیدہ باتوں کا جاننے والا اور (ہر چیز سے) آگاہ ہے",
            "verse 67:15": "وہی تو ہے جس نے تمہارے لئے زمین کو نرم کیا تو اس کی راہوں میں چلو پھرو اور خدا کا (دیا ہو) رزق کھاؤ اور تم کو اسی کے پاس (قبروں سے) نکل کر جانا ہے",
            "verse 67:16": "کیا تم اس سے جو آسمان میں ہے بےخوف ہو کہ تم کو زمین میں دھنسا دے اور وہ اس وقت حرکت کرنے لگے",
            "verse 67:17": "کیا تم اس سے جو آسمان میں ہے نڈر ہو کہ تم پر کنکر بھری ہوا چھوڑ دے۔ سو تم عنقریب جان لو گے کہ میرا ڈرانا کیسا ہے",
            "verse 67:18": "اور جو لوگ ان سے پہلے تھے انہوں نے بھی جھٹلایا تھا سو (دیکھ لو کہ) میرا کیسا عذاب ہوا",
            "verse 67:19": "کیا انہوں نے اپنے سروں پر اڑتے ہوئے جانوروں کو نہیں دیکھا جو پروں کو پھیلائے رہتے ہیں اور ان کو سکیڑ بھی لیتے ہیں۔ خدا کے سوا انہیں کوئی تھام نہیں سکتا۔ بےشک وہ ہر چیز کو دیکھ رہا ہے",
            "verse 67:20": "بھلا ایسا کون ہے جو تمہاری فوج ہو کر خدا کے سوا تمہاری مدد کرسکے۔ کافر تو دھوکے میں ہیں",
            "verse 67:21": "بھلا اگر وہ اپنا رزق بند کرلے تو کون ہے جو تم کو رزق دے؟ لیکن یہ سرکشی اور نفرت میں پھنسے ہوئے ہیں",
            "verse 67:22": "بھلا جو شخص چلتا ہوا منہ کے بل گر پڑتا ہے وہ سیدھے رستے پر ہے یا وہ جو سیدھے رستے پر برابر چل رہا ہو؟",
            "verse 67:23": "کہو وہ خدا ہی تو ہے جس نے تم کو پیدا کیا۔ اور تمہارے کان اور آنکھیں اور دل بنائے (مگر) تم کم احسان مانتے ہو",
            "verse 67:24": "کہہ دو کہ وہی ہے جس نے تم کو زمین میں پھیلایا اور اسی کے روبرو تم جمع کئے جاؤ گے",
            "verse 67:25": "اور کافر کہتے ہیں کہ اگر تم سچے ہو تو یہ وعید کب (پورا) ہوگا؟",
            "verse 67:26": "کہہ دو اس کا علم خدا ہی کو ہے۔ اور میں تو کھول کھول کر ڈر سنانے دینے والا ہوں",
            "verse 67:27": "سو جب وہ دیکھ لیں گے کہ وہ (وعدہ) قریب آگیا تو کافروں کے منہ برے ہوجائیں گے اور (ان سے) کہا جائے گا کہ یہ وہی ہے جس کے تم خواستگار تھے",
            "verse 67:28": "کہو کہ بھلا دیکھو تو اگر خدا مجھ کو اور میرے ساتھیوں کو ہلاک کردے یا ہم پر مہربانی کرے۔ تو کون ہے کافروں کو دکھ دینے والے عذاب سے پناہ دے؟",
            "verse 67:29": "کہہ دو کہ وہ جو (خدائے) رحمٰن (ہے) ہم اسی پر ایمان لائے اور اسی پر بھروسا رکھتے ہیں۔ تم کو جلد معلوم ہوجائے گا کہ صریح گمراہی میں کون پڑ رہا تھا",
            "verse 67:30": "کہو کہ بھلا دیکھو تو اگر تمہارا پانی (جو تم پیتے ہو اور برتے ہو) خشک ہوجائے تو (خدا کے) سوا کون ہے جو تمہارے لئے شیریں پانی کا چشمہ بہا لائے"
        },
        "Uyghur": {
            "verse 67:1": "(پۈتۈن ئاسمان - زېمىننىڭ) پادىشاھلىقى ئىلكىدە بولغان اﷲ نىڭ بەرىكىتى بۈيۈكتۇر. اﷲ ھەر نەرسىگە قادىردۇر",
            "verse 67:2": "سىلەردىن قايسىڭلارنىڭ ئەمەلى ئەڭ ياخشى ئىكەنلىكىنى سىناش ئۈچۈن، اﷲ ئۆلۈمنى ۋە تىرىكلىكنى ياراتتى، اﷲ غالىبتۇر، (تەۋبە قىلغۇچىنى) ناھايىتى مەغپىرەت قىلغۇچىدۇر",
            "verse 67:3": "اﷲ يەتتە ئاسماننى بىرىنى بىرىنىڭ ئۈستىدە قىلىپ ياراتتى، مېھرىبان اﷲ نىڭ يارىتىشىدا ھېچ نۇقساننى كۆرمەيسەن، سەن (ئاسمانلارغا) تەكرار قاراپ باققىنكى، بىرەر يوچۇقنى كۆرەمسەن",
            "verse 67:4": "ئاندىن سەن يەنە ئىككى قېتىم قارىغىن. كۆزۈڭ (ئاسمانلاردا بىرەر نۇقساننى تېپىشتىن) ئۈمىد ئۈزگەن ۋە تالغان ھالدا قايتىدۇ",
            "verse 67:5": "(بىزگە بارلىق ئاسمانلاردىن) ئەڭ يېقىن ئاسماننى چىراغلار (يەنى يورۇق يۇلتۇزلار) بىلەن بېزىدۇق ۋە ئۇلارنى (پەرىشتىلەرنىڭ سۆزلىرىنى ئوغرىلىقچە تىڭشاشقا ئورۇنغان) شەيتانلارنى ئاتىدىغان نەرسە قىلدۇق (يەنى شەيتانلار يۇلتۇزلاردىن چىققان شولا بىلەن ئېتىلىدۇ)، شەيتانلارغا (ئاخىرەتتە) دوزاخ ئازابىنى تەييارلىدۇق",
            "verse 67:6": "پەرۋەردىگارىنى ئىنكار قىلغانلارمۇ دوزاخ ئازابىغا دۇچار بولىدۇ. دوزاخ نېمىدېگەن يامان جاي!",
            "verse 67:7": "ئۇلار دوزاخقا تاشلانغان چاغدا، قايناپ تۇرغان دوزاخنىڭ (ئېشەك ھاڭرىغاندەك) سەت ئاۋازىنى ئاڭلايدۇ",
            "verse 67:8": "دوزاخ غەزەپتىن پارچىلىنىپ كېتىشكە تاس قالىدۇ. دوزاخقا ھەر قاچان بىر توپ ئادەم تاشلانغان چاغدا، دوزاخقا مۇئەككەل پەرىشتىلەر ئۇلاردىن: «سىلەرگە ئاگاھلاندۇرغۇچى (يەنى پەيغەمبەر) كەلمىگەنمىدى؟» دەپ سورايدۇ",
            "verse 67:9": "ئۇلار: «ئۇنداق ئەمەس، بىزگە ھەقىقەتەن ئاگاھلاندۇرغۇچى كەلگەن، بىز (ئۇنى) ئىنكار قىلدۇق ھەمدە بىز: ‹اﷲ (ھېچ ئادەمگە ۋەھيىدىن) بىرەر نەرسە نازىل قىلىنغىنى يوق، سىلەر پەقەت چوڭقۇر ئازغۇنلۇقتا› دېدۇق» دەيدۇ",
            "verse 67:10": "ئۇلار: «ئەگەر بىز (پەيغەمبەرنىڭ سۆزلىرىنى) ئاڭلىغان، ياكى چۈشەنگەن بولساق، ئەھلى دوزاخ قاتارىدا بولماس ئىدۇق» دەيدۇ",
            "verse 67:11": "ئۇلار گۇناھىنى تونۇيدۇ، ئەھلى دوزاخ اﷲ نىڭ رەھمىتىدىن يىراق بولسۇن!",
            "verse 67:12": "پەرۋەردىگارىدىن كۆرمەي تۇرۇپ قورققانلار مەغپىرەتكە ۋە كاتتا ساۋابقا ئېرىشىدۇ",
            "verse 67:13": "سىلەر سۆزۈڭلارنى مەخپىي قىلىڭلار ياكى ئاشكارا قىلىڭلار (اﷲ ھامان ئۇنى بىلىپ تۇرىدۇ). اﷲ ھەقىقەتەن دىللاردىكى سىرلارنى بىلگۈچىدۇر",
            "verse 67:14": "(مەخلۇقاتنى) ياراتقان زات بىلمەمدۇ؟ ئۇ شەيئىلەرنىڭ نازۇك تەرەپلىرىنى بىلگۈچىدۇر، ھەممىدىن تولۇق خەۋەرداردۇر",
            "verse 67:15": "اﷲ سىلەرگە زېمىننى مېڭىشقا ئاسان قىلدى، زېمىننىڭ ئەتراپىدا مېڭىڭلار. اﷲ نىڭ (بەرگەن) رىزقىدىن يەڭلار، سىلەر تىرىلگەندىن كېيىن اﷲ نىڭ دەرگاھىغا قايتۇرۇلىسىلەر",
            "verse 67:16": "(ئى كۇففارلار!) ئاسماندىكى زاتنىڭ يەر تەۋرىگەن چاغدا سىلەرنى يەرگە يۇتقۇزۇۋېتىشىدىن قورقمامسىلەر؟",
            "verse 67:17": "ياكى ئاسماندىكى زاتنىڭ سىلەرگە تاش ياغدۇرۇشىدىن قورقمامسىلەر؟ (سىلەر ئازابنى كۆرگەن چاغدا) مېنىڭ ئاگاھلاندۇرۇشۇمنىڭ قانداق ئىكەنلىكىنى (يەنى ھەق ئىكەنلىكىنى) بىلىسىلەر",
            "verse 67:18": "ئۇلاردىن ئىلگىرى ئۆتكەنلەر (پەيغەمبەرلىرىنى) يالغانغا چىقاردى، (ئۇلارنى ئازاب چۈشۈرۈش بىلەن) ئەيىبلىگەنلىكىم قانداق ئىكەن؟",
            "verse 67:19": "ئۇلار قاناتلىرىنى يايغان ۋە يىغقان ھالدا ئۈستىدە ئۇچۇپ كېتىۋاتقان قۇشلارغا (ئىبرەت كۆزى بىلەن) قارىمامدۇ؟ (قاناتلىرىنى كەرگەن ۋە يىغقان ھالدا) ئۈستىلىرىدە ئۇچۇۋاتقان قۇشلارنى (قاناتلىرىنى ئاچقان ۋە يىغقان چاغدا يەرگە چۈشۈپ كېتىشتىن) پەقەت اﷲ (قۇدرىتى بىلەن) تۇتۇپ تۇرىدۇ، اﷲ ھەقىقەتەن ھەر نەرسىنى كۆرۈپ تۇرغۇچىدۇر",
            "verse 67:20": "سىلەرگە اﷲ ياردەم بەرگەندىن تاشقىرى، يەنە كىم سىلەرگە ياردەمچى قوشۇن بولالايدۇ، كاپىرلار پەقەت ئالدىنىش ئىچىدىدۇر (يەنى شەيتان ئۇلارنى ئازاب نازىل بولمايدۇ دەپ ئالدايدۇ)",
            "verse 67:21": "ئەگەر اﷲ رىزقىنى تۇتۇپ قالسا، سىلەرگە كىم رىزىق بېرىدۇ، ئۇلار تەكەببۇرلۇقتا، ھەقتىن يىراقلىشىشتا ئەزۋەيلەپ كەتكەندۇر",
            "verse 67:22": "زادى قايسى ئادەم يول تاپالايدۇ؟ بېشىنى ساڭگىلىتىپ ماڭغان ئادەممۇ؟ ياكى قەددىنى رۇس تۇتۇپ تۈز يولدا ماڭغان ئادەممۇ؟",
            "verse 67:23": "(ئى مۇھەممەد! ئۇلارغا) ئېيتقىنكى، «اﷲ سىلەرنى ياراتتى، سىلەر ئۈچۈن قۇلاقنى، كۆزلەرنى، دىللارنى ياراتتى، سىلەر ئاز شۈكۈر قىلسىلەر»",
            "verse 67:24": "ئېيتقىنكى، «اﷲ سىلەرنى يەر يۈزىدە يارىتىپ كۆپەيتتى، (ھېساب بېرىش ئۈچۈن) اﷲ نىڭ دەرگاھىغا توپلىنىسىلەر»",
            "verse 67:25": "ئۇلار: «ئەگەر سىلەر راستچىل بولساڭلار، بۇ ۋەدە قاچان ئىشقا ئاشۇرۇلىدۇ» دەيدۇ",
            "verse 67:26": "(ئى مۇھەممەد! ئۇلارغا) ئېيتقىنكى، «(بۇ ھەقتىكى) ئىلىم (يەنى قىيامەتنىڭ قاچان بولۇشى) اﷲ نىڭ دەرگاھىدىدۇر، مەن پەقەت ئوچۇق ئاگاھلاندۇرغۇچىمەن»",
            "verse 67:27": "ئۇلار ئازابنىڭ ئۆزلىرىگە يېقىنلىقىنى كۆرگەن چاغدا يۈزلىرى قارىداپ كېتىدۇ، ئۇلارغا: «مانا بۇ سىلەر (دۇنيادىكى چېغىڭلاردا) تەلەپ قىلغان نەرسىدۇر» دېيىلىدۇ",
            "verse 67:28": "(ئى مۇھەممەد! سېنىڭ ئۆلۈمىڭنى ئارزۇ قىلىدىغان مۇشرىكلارغا) ئېيتقىنكى، «ئېيتىپ بېقىڭلارچۇ! ئەگەر اﷲ (سىلەر ئارزۇ قىلغاندەك) مېنى ۋە مەن بىلەن بولغان (مۆمىنلەرنى) ھالاك قىلىدىغان بولسا، ياكى (بىزنىڭ ئەجىلىمىزنى تەخىر قىلىپ) بىزگە رەھىم قىلىدىغان بولسا (سىلەرگە نېمە پايدا بار)، كاپىرلارنى قاتتىق ئازابتىن كىم قۇتۇلدۇرىدۇ؟»",
            "verse 67:29": "ئېيتقىنكى، «ئۇ ناھايىتى مېھرىبان اﷲ دۇر، ئۇنىڭغا ئىمان ئېيتتۇق ۋە ئۇنىڭغا تەۋەككۈل قىلدۇق، سىلەر كىمنىڭ روشەن گۇمراھلىقتا ئىكەنلىكىنى كەلگۈسىدە بىلىسىلەر»",
            "verse 67:30": "(ئۇلارغا) «ئېيتىپ بېقىڭلارچۇ؟ (سۈيىڭلار يەر ئاستىغا) سىڭىپ كەتسە، سىلەرگە كىم ئېقىن سۇ كەلتۈرۈپ بېرىدۇ» دېگىن"
        },
        "Uzbek": {
            "verse 67:1": "Қўлида мулк бўлган У зот улуғ, муқаддас бўлди. У барча нарсага қодирдир.",
            "verse 67:2": "У ўлим ва ҳаётини сизларнинг қайсиларингиз амалда яхшироқ эканлигингизни синаш учун яратгандир. У азиз ва ўта мағфиратлидир.",
            "verse 67:3": "У етти осмонни табақама-табақа яратгандир. Роҳманнинг яратганида ҳеч тафовут кўрмассан. Қайта назар сол! Бирор камчилик кўряпсанми?",
            "verse 67:4": "Сўнг такрор-такрор назар сол, назар сенга истаганини топа олмай, ҳорғин- чарчаган ҳолда қайтади.",
            "verse 67:5": "Ва дарҳақиқат Биз яқин осмонни чироқлар билан зийнатлаб қўйдик ва у (чироқ)ларни шайтонларга отиладиган нарса ҳам қилиб қўйдик. Ва у(шайтон)ларга олови қизиб турган жаҳаннамни тайёрлаб қўйдик.",
            "verse 67:6": "Ўз Роббиларига куфр келтирганлар учун жаҳаннам азоби бордур ва у қандай ҳам ёмон қайтадиган жой!",
            "verse 67:7": "Улар жаҳаннамга ташланган чоғларида унинг ҳанграган овозини эшитурлар, у эса қайнаб турган бўладир.",
            "verse 67:8": "У ғазабдан ёрилиб кетай дейдир. Ҳар қачон унга янги гуруҳ ташланганда унинг хизматкорлари: «Сизларга огоҳлантирувчи келмаганмиди?», деб сўрайдир.",
            "verse 67:9": "Улар: «Ҳа, дарҳақиқат бизга огоҳлантирувчи келган эди. Лекин биз (уни) ёлғончига чиқардик ва: «Аллоҳ ҳеч нарса туширгани йўқ, сизлар катта адашувдан бошқа ҳеч нарса эмассизлар», деган эдик», дерлар.",
            "verse 67:10": "Ва улар: «Агар эътибор қулоғи билан эшитганимизда ёки ақлни ишлатганимизда эди, дўзахийлар орасида бўлмаган бўлар эдик», дерлар.",
            "verse 67:11": "Бас, улар ўз гуноҳларини эътироф этдилар. Йўқолсин дўзахийлар!",
            "verse 67:12": "Албатта ўз Роббиларидан ғойибдан қўрқадиганлар учун гуноҳларини кечиш ва улкан ажр-савоблар бордир.",
            "verse 67:13": "Ва сиз сўзингизни сир тутасизми ёки ошкора айтасизми, албатта, У кўнгиллардагини ҳам билгувчи зотдир.",
            "verse 67:14": "Яратган зот Ўзи билмасмиди? Ва У дақиқларгача билувчи ва хабардор зотдир.",
            "verse 67:15": "У сизларга ерни бўйсундириб қўйган зотдир. Бас, унинг турли жойларида юринг ва Унинг ризқидан енг ва қабрдан чиқиб бориш ҳам Унинг ҳузурига бўладир.",
            "verse 67:16": "Осмондаги зот сизларни ерга юттириб юборишидан омонда бўлдингизми? У (ер) эса изтиробда ҳаракатланиб туради.",
            "verse 67:17": "Ёки осмондаги зот сизларга азоб шамолни юборишидан омонда бўлдингизми? Бас, албатта огоҳлантириш қандоқ бўлишини билурсизлар.",
            "verse 67:18": "Ва дарҳақиқат улардан аввалгилари ҳам ёлғонга чиқарган эдилар. Бас инкорим қандай бўлди?!",
            "verse 67:19": "Тепаларида (қаноатларини) ёйиб ва йиғаётган қушни кўрмайдиларми? Уларни Роҳмандан бошқа ушлаб турувчи йўқ. Албатта, У барча нарсани кўрувчидир.",
            "verse 67:20": "Роҳмандан бошқа сизларга ёрдам берадиган аскар ким ўзи? Кофирлар ғурурдан бошқа ҳеч нарсада эмаслар!",
            "verse 67:21": "У Ризқни тортиб қўйса, сизга ризқ берадиган ким ўзи?! Балки улар абадий туғёнда ва ҳақдан нафратда бўлурлар.",
            "verse 67:22": "Юз тубан қоқилиб юраётган киши ҳидоятдами ёки тўғри йўлдан қоматини тик тутиб бораётган кишими?",
            "verse 67:23": "Сен: «У сизларни йўқдан бор қилган ва сизларга эшитиш, кўриш ва ақлни берган зотдир. Жуда ҳам оз шукр қиласизлар-а?!» деб айт.",
            "verse 67:24": "Сен: «У сизларни ер юзида яратган, кўпайтирган зотдир. Ва Унинг ҳузурига тўпланурсизлар», деб айт.",
            "verse 67:25": "Ва улар: «Агар ростгўй бўлсангиз, бу ваъда қачон бўлади?» дерлар.",
            "verse 67:26": "Мен: «Албатта, илм, фақат Аллоҳнинг ҳузуридадир. Ва албатта, мен яққол огоҳлантирувчиман, холос», деб айт.",
            "verse 67:27": "Бас азобни яқиндан кўрганда куфр келтирганларнинг юзлари қораяр. Ва уларга: «Сўраган нарсангиз шу бўлади», дейилур.",
            "verse 67:28": "Сен: «Айтинглар-чи, агар Аллоҳ мени ва мен билан бўлганларни ҳалок қилса ёки раҳм қилса, кофирларни аламли азобдан ким қутқариб қолади?!» деб айт.",
            "verse 67:29": "Сен: «У Роҳмандур, биз Унга иймон келтирдик ва Унга таваккал қилдик. Бас, сизлар тезда ким очиқ-ойдин хатода эканини билурсизлар», деб айт.",
            "verse 67:30": "Сен: «Айтинглар-чи, агар сувларингиз ерга сингиб кетса, сизларга ким осонгина топиладиган сувни келтиради?» деб айт."
        },
        "Vietnamese": {
            "verse 67:1": "Phúc thay Đấng nắm quyền thống trị trong tay, và Ngài là Đấng Toàn Năng trên mọi thứ.",
            "verse 67:2": "Đấng đã tạo ra cái chết và sự sống để thử thách các ngươi (hỡi nhân loại) xem ai là người tốt nhất trong việc làm của mình, và Ngài là Đấng Chí Tôn, Đấng Tha Thứ.",
            "verse 67:3": "Đấng đã tạo ra bảy tầng trời, tầng này bên trên tầng kia; ngươi (hỡi người nhìn) sẽ không thấy bất kỳ sai sót nào trong sự tạo hóa của Đấng Ar-Rahman. Vì vậy, ngươi hãy nhìn lại (quan sát kỹ xem) ngươi có thấy bất kỳ lỗ hổng nào không?",
            "verse 67:4": "Sau đó, ngươi hãy đưa ánh mắt nhìn lại hai lần nữa, ánh mắt của ngươi sẽ trở lại với ngươi mờ đi và mệt mỏi.",
            "verse 67:5": "Thật vậy, TA (Allah) đã làm đẹp tầng trời hạ giới với những chiếc đèn (các vì sao) và làm cho chúng thành những thứ dùng để ném những tên Shaytan, và TA đã chuẩn bị cho chúng hình phạt của ngọn lửa rực cháy.",
            "verse 67:6": "Đối với những kẻ vô đức tin nơi Thượng Đế của chúng là một sự trừng phạt nơi Hỏa Ngục; và đó là điểm đến khốn khổ tột cùng.",
            "verse 67:7": "Khi chúng bị ném vào đó, chúng sẽ nghe thấy tiếng nó gầm rít dữ dội và đáng sợ khi nó sôi lên (giống như nó đang cuồng nộ).",
            "verse 67:8": "Nó gần như muốn nổ tung vì giận dữ. Mỗi khi một nhóm người bị ném vào đó, những vị Cai Ngục hỏi chúng (một cách mỉa mai): “Lẽ nào đã không có một người cảnh báo nào đến gặp các ngươi sao?!”",
            "verse 67:9": "Chúng sẽ đáp: “Vâng, có. Quả thật, đã có một người cảnh báo đến gặp chúng tôi, nhưng chúng tôi đã phủ nhận và nói: Allah đã không ban xuống bất cứ điều gì. Thật ra các người đang trong sự lầm lạc lớn.”",
            "verse 67:10": "Và chúng sẽ nói: “Giá như chúng tôi lắng nghe hoặc chịu suy ngẫm, chúng tôi đã không nằm trong số những người bạn của Hỏa Ngục.”",
            "verse 67:11": "Chúng đã thú nhận tội lỗi của mình. Vì vậy, những người bạn của Hỏa Ngục đã ở quá xa (với sự tha thứ)!",
            "verse 67:12": "Quả thật, những người kính sợ Thượng Đế của họ dù không nhìn thấy Ngài vẫn sẽ được tha thứ và sẽ có được một phần thưởng to lớn.",
            "verse 67:13": "Cho dù các ngươi (hỡi nhân loại) có che giấu hoặc công khai lời nói của các ngươi thì (các ngươi hãy biết rằng) quả thật Ngài biết rõ những điều nằm trong lòng (của các ngươi).",
            "verse 67:14": "Lẽ nào Đấng đã tạo ra không biết trong khi Ngài là Đấng Tinh Tế, Đấng Thông Toàn?",
            "verse 67:15": "Chính Ngài là Đấng đã làm cho trái đất thuận tiện và dễ dàng sử dụng cho các ngươi. Vì vậy, các ngươi hãy đi trên các nẻo đường của nó và hãy ăn từ nguồn bổng lộc của Ngài. Và (các ngươi hãy biết rằng rồi đây) các ngươi sẽ được phục sinh để trở về với Ngài.",
            "verse 67:16": "Phải chăng các ngươi cảm thấy an toàn rằng Đấng ở trên trời sẽ không khiến đất sụp xuống nuốt chửng các ngươi khi nó rung chuyển ư?",
            "verse 67:17": "Hoặc phải chăng các ngươi cảm thấy an toàn rằng Đấng ở trên trời sẽ không giáng xuống một cơn bão đá ư? Rồi đây các ngươi sẽ biết Lời cảnh báo của TA (khủng khiếp) thế nào?",
            "verse 67:18": "Quả thật trước chúng đã có những kẻ phủ nhận. Và những kẻ đó đã chịu sự trừng phạt của TA (khủng khiếp) thế nào?",
            "verse 67:19": "Lẽ nào chúng không nhìn thấy những con chim phía trên chúng với đôi cánh dang rộng và (đôi lúc) gập lại? Không ai có thể giữ chúng (trên không trung) ngoại trừ Đấng Ar-Rahman. Quả thật, Ngài nhìn thấy hết mọi vật.",
            "verse 67:20": "Hoặc ai có thể là một đội quân giúp các ngươi ngoài Đấng Ar-Rahman? Quả thật, những kẻ vô đức tin chỉ sống trong ảo tưởng.",
            "verse 67:21": "Hoặc ai có thể cung cấp bổng lộc cho các ngươi nếu Ngài giữ nguồn bổng lộc của Ngài lại? Không, chúng cứ cố chấp trong sự xấc xược và trốn tránh (sự thật).",
            "verse 67:22": "Vậy thì một kẻ sấp mặt bước đi (không có chiều rộng hay chiều sâu đối với đường nhìn của mình, hầu như không nhìn thấy những gì đang chạm vào mặt mình) được hướng dẫn tốt hơn, hay một người bước đi ngay thẳng (với một đường nhìn rõ ràng về những gì ở phía trước) trên một con đường thẳng?",
            "verse 67:23": "(Hỡi Thiên Sứ Muhammad!) Ngươi hãy nói (với những kẻ đa thần): “Ngài (Allah) là Đấng đã tạo ra các ngươi, ban cho các ngươi thính giác, thị giác và trái tim nhưng các ngươi rất ít biết ơn Ngài.",
            "verse 67:24": "Ngươi hãy nói với chúng: “Chính Ngài đã phân tán các ngươi khắp nơi trên trái đất, và (rồi đây) các ngươi sẽ được tập trung đưa về trình diện Ngài.”",
            "verse 67:25": "(Những kẻ phủ nhận sự Phục Sinh) nói: “Lời hứa này khi nào sẽ xảy ra nếu các ngươi nói thật?”",
            "verse 67:26": "Ngươi hãy nói với chúng: “Quả thật chỉ một mình Allah mới biết rõ điều đó còn Ta chỉ là một người cảnh báo rõ ràng mà thôi.”",
            "verse 67:27": "Nhưng khi chúng thấy nó đến gần, gương mặt của những kẻ vô đức tin trở nên ảm đạm. Và chúng sẽ được bảo: “Đây chính là cái mà các ngươi thường mong đợi”.",
            "verse 67:28": "Ngươi (Thiên Sứ Muhammad) hãy nói với chúng: “Các ngươi có xem xét không, nếu Allah hủy diệt Ta và những ai theo Ta hoặc thương xót Bọn Ta thì ai sẽ cứu những kẻ vô đức tin khỏi sự trừng phạt đau đớn?”",
            "verse 67:29": "Ngươi hãy nói với chúng: “Ngài là Đấng Ar-Rahman, Bọn Ta có đức tin nơi Ngài và phó thác cho Ngài. Rồi đây các ngươi sẽ biết ai là kẻ lầm lạc rõ rệt.”",
            "verse 67:30": "Ngươi hãy bảo chúng: “Các ngươi có nghĩ đến, nếu nguồn nước (mà các ngươi uống) rút xuống (lòng đất) và biến mất thì ai có thể mang nguồn nước trong vắt đến cho các ngươi?”"
        },
        "Yoruba": {
            "verse 67:1": "Ibukun ni fun Eni ti ijoba wa ni Owo Re. Oun si ni Alagbara lori gbogbo nnkan",
            "verse 67:2": "Eni ti O da iku ati isemi nitori ki o le dan yin wo; ewo ninu yin l’o maa se ise rere julo. Oun si ni Alagbara, Alaforijin",
            "verse 67:3": "Eni ti O da awon sanmo meje ni ipele ipele. O o le ri aigunrege kan lara eda Ajoke-aye. Nitori naa, wo o pada, nje o ri oju sisan kan (lara sanmo)",
            "verse 67:4": "Leyin naa, wo o pada ni ee meji, ki oju re pada si odo re pelu iyepere. O si maa kaaare",
            "verse 67:5": "Dajudaju A ti fi (awon irawo t’o n tanmole bi) atupa se sanmo ile aye ni oso. A tun se won ni eta-irawo ti won n ju mo awon esu. A si pese iya Ina t’o n jo fofo sile de won",
            "verse 67:6": "Iya ina Jahanamo si wa fun awon t’o sai gbagbo. Ikangun naa si buru",
            "verse 67:7": "Nigba ti won ba ju won sinu re, won yoo maa gbo kikun re, ti o si maa ru soke",
            "verse 67:8": "Ina maa fee pinra re lati ara ibinu. Igbakigba ti won ba ju ijo kan sinu re, awon eso Ina yoo maa bi won leere pe: \"Nje olukilo kan ko wa ba yin bi",
            "verse 67:9": "Won yoo wi pe: \"Rara, dajudaju olukilo kan ti wa ba wa, sugbon a pe e ni opuro. A si wi pe Allahu ko so nnkan kan kale. Ki ni eyin bi ko se pe e wa ninu isina t’o tobi",
            "verse 67:10": "Won tun wi pe: \"Ti o ba je pe a gboran ni tabi pe a se laakaye ni, awa ko nii wa ninu ero inu Ina jijo",
            "verse 67:11": "Won si jewo ese won. Nitori naa, ijinna si ike Allahu yo wa fun awon ero inu Ina t’o n jo fofo",
            "verse 67:12": "Dajudaju awon t’o n paya Oluwa won ni ikoko, aforijin ati esan t’o tobi n be fun won",
            "verse 67:13": "E wi oro yin ni jeeje tabi e wi i soke, dajudaju Oun ni Onimo nipa ohun t’o wa ninu awon igba-aya eda",
            "verse 67:14": "Se (Allahu) ko mo eni t’O da ni? Oun si ni Alaaanu, Alamotan",
            "verse 67:15": "Oun ni Eni ti O ro ile fun yin. Nitori naa, e rin ni awon agbegbe re kaakiri, ki e si je ninu arisiki Re. Odo Re si ni ajinde eda wa",
            "verse 67:16": "Se e fokanbale si Eni ti O wa ni (oke) sanmo pe ko le je ki ile gbe yin mi? Nigba naa, ile yo si maa mi titi",
            "verse 67:17": "Tabi e fokanbale si Eni ti O wa ni (oke) sanmo pe ko le fi okuta ina ranse si yin ni? Nigba naa, e si maa mo bi ikilo Mi ti ri",
            "verse 67:18": "Awon t’o siwaju won kuku pe ododo niro. Bawo si ni bi Mo se (fi iya) ko (aburu fun won) ti ri",
            "verse 67:19": "Se won ko ri awon eye ti o wa ni oke won, ti (won) n na iye apa (won), ti won si n pa a mora? Kini kan ko mu won duro (sinu ofurufu) afi Ajoke-aye. Dajudaju Oun si ni Oluriran nipa gbogbo nnkan",
            "verse 67:20": "Ta ni eni ti o maa je omo ogun fun yin, ti o maa ran yin lowo leyin Ajoke-aye? (Ninu) ki ni awon alaigbagbo wa bi ko se ninu etan",
            "verse 67:21": "Ta ni eni ti o maa pese fun yin ti O ba da arisiki Re duro? Nse ni won n sori kunkun si i ninu igberaga ati sisa fun ododo",
            "verse 67:22": "Nje eni t’o n rin ni idojubole l’o mona julo ni tabi eni t’o n rin san an loju ona taara",
            "verse 67:23": "So pe: \"Oun ni Eni ti O seda yin. O si se igboro, iriran ati awon okan fun yin. Ope ti e n da si kere pupo",
            "verse 67:24": "So pe: \"Oun ni Eni ti O da yin si ori ile. Odo Re si ni won yoo ko yin jo si",
            "verse 67:25": "Won n wi pe: \"Igba wo ni adehun yii yoo se ti e ba je olododo",
            "verse 67:26": "So pe: \"Odo Allahu nikan ni imo (nipa) re wa. Emi kan je olukilo ponnbele ni",
            "verse 67:27": "Nigba ti won ba ri i t’o sunmo, oju awon t’o sai gbagbo yoo koro wa fun ibanuje. A o si so fun won pe: \"Eyi ni ohun ti e n pe",
            "verse 67:28": "So pe: \" E so fun mi, ti Allahu ba pa emi ati awon t’o wa pelu mi re, tabi ti O ba ke wa (se e le di I lowo ni?) Nitori naa, ta ni o maa gba awon alaigbagbo la ninu iya eleta-elero",
            "verse 67:29": "So pe: \"Oun ni Ajoke-aye. Awa gba A gbo. Oun si la gbarale. Laipe e maa mo ta ni o wa ninu isina ponnbele",
            "verse 67:30": "So pe: \" E so fun mi, ti omi yin ba gbe wa, ta ni eni ti o maa mu omi iseleru wa ba yin"
        }
    }
}