{
    "id": 68,
    "name_simple": "Al-Qalam",
    "revelation_place": "makkah",
    "revelation_order": 2,
    "bismillah_pre": true,
    "verses_count": 52,
    "short_text": "This Surah is called Nun as well as Al-Qalam, the words with which it begins.",
    "text": [
        "\n",
        "This Surah is called Nun as well as Al-Qalam, the words with which it begins.",
        "\n",
        "Period of Revelation",
        "\n",
        "This too is one of the earliest surahs to be revealed at Makkah, but its subject matter shows that it was sent down at the time when opposition to the Holy Prophet (upon whom be peace) had grown very harsh and tyrannical.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "It consists of three themes: Replies to the opponents objections, administration of warning and admonition to them, and exhortation to the Holy Prophet (upon whom be peace) to patience and constancy.",
        "\n",
        "At the outset, the Holy Prophet has been addressed, to the effect: \"The disbelievers call you a madman whereas the Book that you are presenting and the sublime conduct that you practice, are by themselves sufficient to refute their false accusations. Soon they will see as to who was mad and who was sane; therefore, do not at all yield to the din of opposition being kicked up against you, for all this is actually meant to cow you and make you resort to a compromise with them.\"",
        "\n",
        "Then, in order to enlighten the common people the character of a prominent man from among the opponents, whom the people of Makkah fully well recognized, has been presented, without naming him:At that time, the Holy Prophet's pure and sublime conduct was before them, and every discerning eye could also see what sort of character and morals were possessed by the chiefs of Makkah, who were leading the opposition against him.",
        "\n",
        "Then, in vv. 17-33, the parable of the owners of a garden has been presented, who after having been blessed by Allah turned ungrateful to Him, and did not heed the admonition of the best man among them when it was given them. Consequently, they were deprived of the blessing and they realized this, when all they had lay devastated. With this parable the people of Makkah have been warned to the effect:\"With the appointment of the Holy Prophet (upon whom be peace) to Prophethood, you, O people of Makkah, too, have been put to a test similar to the one to which the owners of the garden had been put. If you do not listen to him, you too will be afflicted with a punishment in the world, and the punishment of the Hereafter is far greater.\"",
        "\n",
        "Then, in vv. 34-47 continuously, the disbelievers have been admonished, in which the address sometimes turns to them directly and sometimes they are warned through the Holy Prophet (upon whom be peace). A summary of what has been said in this regard, is this: Well being in the Hereafter inevitably belongs to those who spend their lives in the world in full consciousness of God. It is utterly against reason that the obedient servants should meet in the Hereafter the same fate as the guilty. There is absolutely no basis of the disbelievers misunderstanding that God will treat them in the manner they choose for themselves, whereas they have no guarantee for this. Those who are being called upon to bow before God in the world and they refuse to do so, would be unable to prostrate themselves on the Day of Resurrection even if they wanted to do so, and thus would stand disgraced and condemned. Having denied the Qur'an they cannot escape Divine punishment. The rein they are being\r\ngiven, has deluded them. They think that since they are not being punished in spite of their denial, they must be on the right path, whereas they are following the path of ruin. They have no reasonable ground for opposing the Messenger, for he is a preacher without any vested interest: he is not asking any reward of them for himself, and they cannot either make the claim that they know with certainty that he is not a true Messenger, nor that what he says is false.",
        "\n",
        "In conclusion, the Holy Prophet (upon whom be peace) has been exhorted to the effect:\"Bear with patience the hardships that you may have to face in the way of preaching the Faith till Allah's judgment arrives, and avoid the impatience which caused suffering and affliction to the Prophet Jonah (peace be on him).\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the single discrete Arabic letter Nūn and the oath of the Divine One swearing by the instrument of The Pen, as well as all knowledge that people are able to preserve and communicate thereby. It takes its name from “the pen” (al-qalam) mentioned in verse 1. The surah deals with the accusation that Muhammad was not God’s Messenger but merely mad (verse 2 .). The arrogance of those who assume that, because they have some of the good things in this life, they can reject the Revelation, is rebutted (verse 10 .). Examples are given of those who came to regret their arrogance (verse 17 .). The Prophet is urged to remain steadfast (verse 48 .).",
    "name_translation": "The Pen",
    "name_complex": "Al-Qalam",
    "surah_name_ar": "القلم",
    "verses": {
        "Albanian": {
            "verse 68:1": "Nûn. Pasha pendën dhe në atë që shkruajnë ata,",
            "verse 68:2": "ti, me dhuntinë e Zotit tënd, nuk je i marrë;",
            "verse 68:3": "ti, me të vërtetë, do të jesh përherë i shpërblyer",
            "verse 68:4": "dhe, me të vërtetë, ti je me virtyte të mëdha",
            "verse 68:5": "dhe, ti do të shohësh, por edhe ata (jobesimtarët) do të shohin,",
            "verse 68:6": "kush nga ju është i marrë.",
            "verse 68:7": "Zoti yt e di më së miri për atë që e ka devijuar rrugën e tij dhe Ai i di mirë ata që janë në rrugën e drejtë.",
            "verse 68:8": "Andaj, mos ju përul ti atyre që përgënjeshtrojnë.",
            "verse 68:9": "Ata dëshirojnë që ti të bësh lëshime, e të bëjnë (lëshime) edhe ata,",
            "verse 68:10": "dhe mos ju përul ti atyre që betohen (rrejshëm), e që janë të poshtër,",
            "verse 68:11": "lajkatarit dhe atë që transmeton fjalët për të keq;",
            "verse 68:12": "penguesin e të mirav, e kundërvajtësin e mëkatarin e madh;",
            "verse 68:13": "të ashpërit dhe pos kësaj edhe kopil, -",
            "verse 68:14": "(mos ju përul ti) për shkak se është i pasur dhe ka shumë djemë,",
            "verse 68:15": "i cili kur t’i lexohen ajetet Tona (Kur’ani), thotë: “Këto janë vetëm përralla të (popujve të) lashtë!”",
            "verse 68:16": "Na (së shpejti), do t’ia damkosim hundën atij!",
            "verse 68:17": "Na, do t’i provojmë ata (jobesimtaët), sikundër që i kemi provuar pronarët e kopshtit, të cilët ishin betuar se në mëngjes do t’i marrin frutet;",
            "verse 68:18": "e nuk patën thënë: “Nëse do Zoti!”",
            "verse 68:19": "Dhe, e goditi atë (kopshtin) një fatkeqësi nga Zoti yt, derisa ata flinin",
            "verse 68:20": "dhe ai (kopshti) gëdhiu i shkretëruar.",
            "verse 68:21": "Kurse, në agim, ata, e thirrën njëri-tjetrin:",
            "verse 68:22": "“Nxitoni herët në kopshtin tuaj, nëe doni t’i tuboni frutet!”",
            "verse 68:23": "Dhe at au nisën duke biseduar qetësisht:",
            "verse 68:24": "“Mos të lejojmë që të paraqitet asnjë i vobektë në kopshtin tonë!”",
            "verse 68:25": "Dhe, ata u nisën herët, të bindur se do të mund t’i pengojnë ata (të vobektit),",
            "verse 68:26": "e kur e panë (kopshtin e shkretëruar), ata thanë: “Na, me të vërtetë, qenkemi të humbur;",
            "verse 68:27": "por, jo, jo, - krejt paskemi mbaruar!”",
            "verse 68:28": "Njëri më i arsyeshëm, prej tyre tha: “A nuk ju thashë unë se duhet ta kujtoni Perëndinë!”",
            "verse 68:29": "“Lavdëruar qoftë Zoti ynë!” – thanë. Na, me të vërtetë, paskemi qentë të padrejtë!”",
            "verse 68:30": "Dhe, atëherë filluan ta qortojnë njëri-tjetrin.",
            "verse 68:31": "“Sa keq për ne!” thanë ata – ne, me të vërtetë, paskemi qenë të egërsuar;",
            "verse 68:32": "Zoti ynë mund të na japë edhe më të mirë se këtë; me të vërtetë, ne mbështetemi te Zoti ynë!”",
            "verse 68:33": "I tillë ka qenë dënimi, e dënimi në jetën tjetër është më i madh, nëse e dinë!",
            "verse 68:34": "Për ata që i druajnë Perëndisë, te Perëndia do të ketë kopshte të dhuntisë, -",
            "verse 68:35": "Vallë, a do t’i barazojmë muslimanët me njerëzit e këqinj?! –",
            "verse 68:36": "Çka keni ju, si gjykoni ju?!",
            "verse 68:37": "A keni ju ndonjë libër, në të cilin lexoni",
            "verse 68:38": "se do të keni atë që e zgjedhni ju?",
            "verse 68:39": "Apo, a ka për ju betime të mëdha, që do të vlejnë deri në Ditën e Kijametit, e që do ta keni atë çka e keni caktuar.",
            "verse 68:40": "Pyeti ata – kush është garantues për këtë.",
            "verse 68:41": "Ose, a kanë ata bashkëpunëtorë në këtë. E, le t’i sjellin ata bashkëpunëtorët e tyre, nëse flasin të vërtetën.",
            "verse 68:42": "(Kujtoju) Ditën e vështirë, kur zbulohen të gjitha dhe ata ftohen (thirrën) që të përulen në tokë (në sexhde), e nuk munden (nuk do të kenë fuqi),",
            "verse 68:43": "(ata do të jenë) me sy ulur dhe krejtësisht të poshtëruar, - e, me të vërtetë, kanë qenë të ftuar në përulje (sexhde), derisa qenë gjallë dhe shëndoshë.",
            "verse 68:44": "Prandaj, më lë ti Mua, (Unë) do t’i dënoj ata që e mohojnë këtë Thënie (Kur’anin), Ne ata gradualisht do t’i mashtrojmë (për dënim) në mënyrë të panjohur",
            "verse 68:45": "dhe u japim atyre afat, se, me të vërtetë, mashtrimi Im është i fortë!",
            "verse 68:46": "A po kërkon ti shpërblim nga ata, e ata janë të rënduar nga borxhet?",
            "verse 68:47": "E, a ka tek ata dijeni të fshehtë, e ata po i përshkruajnë ato?",
            "verse 68:48": "Duro ti për gjykimin e Zotit tënd dhe mos u bën si peshkatari (Junusi), kur iu lut Zotit të vet, e ai (Junusi) ishte i hidhëruar,",
            "verse 68:49": "dhe, sikur mos ta arrinte atë mirësi prej Perëndisë, ai do të hudhej në një shkretëtirë e do të ishte i qortuar,",
            "verse 68:50": "por, Zoti i tij e ka zgjedhur dhe e ka bërë atë në grupin e njerëzve të mirë.",
            "verse 68:51": "Pothuajse, me të vërtetë, jobesimtarët duan të të rrëzojnë me shikim kur dëgjojnë Kur’anin, duke thënë: “Ai, në të vërtetë, është i marrë!”",
            "verse 68:52": "E, ai (Kur’ani), është këshillë për tërë botën!"
        },
        "Amharic": {
            "verse 68:1": "ነ.(ኑን)፤ በብርእ እምላለሁ በዚያም (መልአኮች) በሚጽፉት፡፡",
            "verse 68:2": "አንተ በጌታህ ጸጋ የተጎናጸፍክ ስትኾን ዕብድ አይደለህም፡፡",
            "verse 68:3": "ላንተም (ከጌታህ) የማይቋረጥ ዋጋ በእርግጥ አልለህ፡፡",
            "verse 68:4": "አንተም በታላቅ ጠባይ ላይ ነህ፡፡",
            "verse 68:5": "ወደፊትም ታያለህ፤ ያያሉም፡፡",
            "verse 68:6": "ዕብደት በማንኛችሁ እንዳልለ፡፡",
            "verse 68:7": "ጌታህ እርሱ ከመንገዱ የተሳሳተውን ሰው ዐዋቂ ነው፡፡ እርሱም ተመሪዎቹን ዐዋቂ ነው፡፡",
            "verse 68:8": "ለአስተባባዮችም አትታዝዙ፡፡",
            "verse 68:9": "ብትመሳሰላቸውና ቢመሳሰሉህ ተመኙ፡፡",
            "verse 68:10": "ወራዳንም ሁሉ አትታዘዝ፡፡",
            "verse 68:11": "ሰውን አነዋሪንና በማሳበቅ ኼያጅን፡፡",
            "verse 68:12": "ለበጎ ነገር በጣም ከልካይን፣ ወሰን አላፊን፣ ኃጢአተኛን፤",
            "verse 68:13": "ልበ ደረቅን፣ ከዚህ በኋላ ዲቃላን (ሁሉ አትታዘዝ)፡፡",
            "verse 68:14": "የገንዘብና የልጆች ባለቤት በመኾኑ (ያስተባብላል)፡፡",
            "verse 68:15": "በእርሱ ላይ አንቀጾቻችን በሚነበቡ ጊዜ «የመጀመሪያዎቹ ሰዎች ተረቶች ናቸው» ይላል፡፡",
            "verse 68:16": "በአፍንጫው ላይ በእርግጥ (የሚነወርበት) ምልክት እናደርግበታለን፡፡",
            "verse 68:17": "እኛ የአትክልቲቱን ባለቤቶቸ እንደ ሞከርን (የመካን ሰዎች) ሞከርናቸው፡፡ ማልደው (ፍሬዋን) ሊለቅሟት በማሉ ጊዜ፡፡",
            "verse 68:18": "(በመሓላቸው) አያስቀሩምም፡፡",
            "verse 68:19": "እነርሱ የተኙ ኾነውም ሳሉ ከጌታህ የኾነ ዟሪ በእርሷ ላይ ዞረባት፡፡",
            "verse 68:20": "እንደ ሌሊት ጨለማም ኾና አነጋች፤ (ከሰለች)፡፡",
            "verse 68:21": "ያነጉም ኾነው ተጠራሩ፡፡",
            "verse 68:22": "«ቆራጮች እንደ ኾናችሁ በእርሻቸሁ ላይ ማልዱ» በማለት፡፡",
            "verse 68:23": "እነርሱ የሚንሾካሾኩ ኾነው ኼዱም፡፡",
            "verse 68:24": "ዛሬ በእናንተ ላይ ድኻ እንዳይገባት በማለት፡፡",
            "verse 68:25": "(ድኾችን) በመከልከልም ላይ (በሐሳባቸው) ቻዮች ኾነው ማለዱ፡፡",
            "verse 68:26": "(ተቃጥላ) ባዩዋትም ጊዜ «እኛ በእርግጥ ተሳሳቾች ነን» አሉ፡፡",
            "verse 68:27": "«ይልቁንም እኛ የተከለከልን ነን» አሉ፡፡",
            "verse 68:28": "ትክክለኛቸው «ለእናንተ አላህን ለምን አታጠሩም አላልኳችሁምን?» አላቸው፡፡",
            "verse 68:29": "«ጌታችን ጥራት ይገባው፡፡ እኛ በዳዮች ነበርን፤» አሉ፡፡",
            "verse 68:30": "የሚወቃቀሱም ኾነው ከፊሎቻቸው በከፊሉ ላይ መጡ፡፡",
            "verse 68:31": "«ዋ ጥፋታችን! እኛ ድንበር አላፊዎች ነበርን፤» አሉ፡፡",
            "verse 68:32": "«ጌታችን ከእርሷ የተሻለን (አትክልት) ሊለውጠን ይከጀላል፡፡ እኛ ወደ ጌታችን ከጃዮች ነን፤» (አሉ)፡፡",
            "verse 68:33": "ቅጣቱ እንደዚሁ ነው፡፡ የመጨረሻይቱም ዓለም ቅጣት ታላቅ ነው፡፡ የሚያውቁት በኾኑ ኖሮ (በተጠነቀቁ ነበር)፡፡",
            "verse 68:34": "ለጥንቁቆቹ በጌታቸው ዘንድ መጠቀሚያ ገነቶች አሏቸው፡፡",
            "verse 68:35": "ሙስሊሞቹን እንደ ከሓዲዎች እናደርጋለን?",
            "verse 68:36": "ለእናንተ ምን (አስረጅ) አላችሁ? እንዴት ትፈርዳላችሁ፡፡",
            "verse 68:37": "በእውነቱ ለእናንተ በእርሱ የምታጠኑበት መጽሐፍ አላችሁን?",
            "verse 68:38": "በውስጡ ለእናንተ የምትመርጡት አላችሁ (የሚል)",
            "verse 68:39": "ወይስ ለእናንተ የምትፈርዱት አላችሁ በማለት (ቃል ኪዳን የገባንላችሁ) እስከ ትንሣኤ ቀን ደራሽ የኾኑ መሓላዎች ለእናንተ በእኛ ላይ አሏችሁን?",
            "verse 68:40": "በዚህ ማንኛቸው ተያያዥ እንደ ኾነ ጠይቃቸው፡፡",
            "verse 68:41": "ወይስ ለእነርሱ (በፍርዳቸው ተስማሚ) «ተጋሪዎች» አሏቸውን? እውነተኞችም እንደኾኑ «ተጋሪዎቻቸውን» ያምጡ፡፡",
            "verse 68:42": "ባት የሚገለጥበትን (ከሓዲዎች) ወደ መስገድም የሚጥጠሩበትንና የማይችሉበት ቀን (አስታውስ)፡፡",
            "verse 68:43": "ዓይኖቻቸው የፈሩ ውርደት የምትሸፍናቸው ሲኾኑ፤ (ወደ ስግደት የሚጠሩበትን)፤ እነርሱም (በምድረ ዓለም) ደህና ኾነው ሳሉ ወደ ስግደት በእርግጥ ይጠሩ ነበሩ፡፡",
            "verse 68:44": "በዚህም ንግግር ከሚያስተባብሉት ሰዎች ጋር ተዎኝ፡፡ (እነርሱን እኔ እበቃሃለሁ)፡፡ ከማያውቁት ስፍራ አዘናግተን እንይዛቸዋለን፡፡",
            "verse 68:45": "እነርሱንም አዘገያለሁ፡፡ ዘዴዬ ብርቱ ነውና፡፡",
            "verse 68:46": "በእውነቱ ዋጋን ትጠይቃቸዋለህን? ስለዚህ እነርሱ ከዕዳ የተከበዱ ናቸውን?",
            "verse 68:47": "ወይስ እነርሱ ዘንድ የሩቁ ምስጢር ዕውቀት አልለን? ስለዚህ እነርሱ ይጽፋሉን?",
            "verse 68:48": "ለጌታህም ፍርድ ታገሥ፤ (በመበሳጨትና ባለ መታገሥ) እንደ ዓሣው ባለቤትም (እንደ ዮናስ) አትኹን፡፡ እርሱ በጭንቀት የተመላ ኾኖ (ጌታውን) በተጣራ ጊዜ፡፡",
            "verse 68:49": "ከጌታው የኾነ ጸጋ ባላገኘው ኖሮ በምድረ በዳ ተወቃሽ ኾኖ በተጣለ ነበር፡፡",
            "verse 68:50": "ጌታውም (በነቢይነት) መረጠው፡፡ ከደጋጎቹም አደረገው፡፡",
            "verse 68:51": "እነሆ እነዚያም የካዱት ሰዎች ቁርኣኑን በሰሙ ጊዜ በዓይኖቻቸው ሊጥሉህ (ሊያጠፉህ) ይቀርባሉ፡፡ «እርሱም በእርግጥ ዕብድ ነው» ይላሉ፡፡",
            "verse 68:52": "ግን እርሱ (ቁርኣን) ለዓለማት መገሰጫ እንጂ ሌላ አይደለም፡፡"
        },
        "Arabic": {
            "verse 68:1": "َنوُرُطْسَي اَمَو ِمَلَقْلاَو ۚ ن",
            "verse 68:2": "ٍنوُنْجَمِب َكِّبَر ِةَمْعِنِب َتنَأ اَم",
            "verse 68:3": "ٍنوُنْمَم َرْيَغ اًرْجَأَل َكَل َّنِإَو",
            "verse 68:4": "ٍميِظَع ٍقُلُخ ٰىَلَعَل َكَّنِإَو",
            "verse 68:5": "َنوُرِصْبُيَو ُرِصْبُتَسَف",
            "verse 68:6": "ُنوُتْفَمْلا ُمُكِّييَأِب",
            "verse 68:7": "َنيِدَتْهُمْلاِب ُمَلْعَأ َوُهَو ِهِليِبَس نَع َّلَض نَمِب ُمَلْعَأ َوُه َكَّبَر َّنِإ",
            "verse 68:8": "َنيِبِّذَكُمْلا ِعِطُت اَلَف",
            "verse 68:9": "َنوُنِهْدُيَف ُنِهْدُت ْوَل اوُّدَو",
            "verse 68:10": "(ٍنيِهَّم ٍفاَّلَح َّلُك ْعِطُت اَلَو",
            "verse 68:11": "(ٍميِمَنِب ٍءاَّشَّم ٍزاَّمَه",
            "verse 68:12": "(ٍميِثَأ ٍدَتْعُم ِرْيَخْلِّل ٍعاَّنَّم",
            "verse 68:13": "(ٍميِنَز َكِلَٰذ َدْعَب ٍّلُتُع",
            "verse 68:14": "(َنيِنَبَو ٍلاَم اَذ َناَك نَأ",
            "verse 68:15": "(َنيِلَّوَأْلا ُريِطاَسَأ َلاَق اَنُتاَيآ ِهْيَلَع ٰىَلْتُت اَذِإ",
            "verse 68:16": "(ِموُطْرُخْلا ىَلَع ُهُمِسَنَس",
            "verse 68:17": "(َنيِحِبْصُم اَهَّنُمِرْصَيَل اوُمَسْقَأ ْذِإ ِةَّنَجْلا َباَحْصَأ اَنْوَلَب اَمَك ْمُهاَنْوَلَب اَّنِإ",
            "verse 68:18": "(َنوُنْثَتْسَي اَلَو",
            "verse 68:19": "(َنوُمِئاَن ْمُهَو َكِّبَّر نِّم ٌفِئاَط اَهْيَلَع َفاَطَف",
            "verse 68:20": "(ِميِرَّصلاَك ْتَحَبْصَأَف",
            "verse 68:21": "(َنيِحِبْصُم اْوَداَنَتَف",
            "verse 68:22": "(َنيِمِراَص ْمُتنُك نِإ ْمُكِثْرَح ٰىَلَع اوُدْغا ِنَأ",
            "verse 68:23": "(َنوُتَفاَخَتَي ْمُهَو اوُقَلَطناَف",
            "verse 68:24": "(ٌنيِكْسِّم مُكْيَلَع َمْوَيْلا اَهَّنَلُخْدَي اَّل نَأ",
            "verse 68:25": "(َنيِرِداَق ٍدْرَح ٰىَلَع اْوَدَغَو",
            "verse 68:26": "(َنوُّلاَضَل اَّنِإ اوُلاَق اَهْوَأَر اَّمَلَف",
            "verse 68:27": "(َنوُموُرْحَم ُنْحَن ْلَب",
            "verse 68:28": "(َنوُحِّبَسُت اَلْوَل ْمُكَّل لُقَأ ْمَلَأ ْمُهُطَسْوَأ َلاَق",
            "verse 68:29": "(َنيِمِلاَظ اَّنُك اَّنِإ اَنِّبَر َناَحْبُس اوُلاَق",
            "verse 68:30": "(َنوُمَواَلَتَي ٍضْعَب ٰىَلَع ْمُهُضْعَب َلَبْقَأَف",
            "verse 68:31": "(َنيِغاَط اَّنُك اَّنِإ اَنَلْيَو اَي اوُلاَق",
            "verse 68:32": "(َنوُبِغاَر اَنِّبَر ٰىَلِإ اَّنِإ اَهْنِّم اًرْيَخ اَنَلِدْبُي نَأ اَنُّبَر ٰىَسَع",
            "verse 68:33": "(َنوُمَلْعَي اوُناَك ْوَل ۚ ُرَبْكَأ ِةَرِخآْلا ُباَذَعَلَو ۖ ُباَذَعْلا َكِلَٰذَك",
            "verse 68:34": "(ِميِعَّنلا ِتاَّنَج ْمِهِّبَر َدنِع َنيِقَّتُمْلِل َّنِإ",
            "verse 68:35": "(َنيِمِرْجُمْلاَك َنيِمِلْسُمْلا ُلَعْجَنَفَأ",
            "verse 68:36": "(َنوُمُكْحَت َفْيَك ْمُكَل اَم",
            "verse 68:37": "(َنوُسُرْدَت ِهيِف ٌباَتِك ْمُكَل ْمَأ",
            "verse 68:38": "(َنوُرَّيَخَت اَمَل ِهيِف ْمُكَل َّنِإ",
            "verse 68:39": "(َنوُمُكْحَت اَمَل ْمُكَل َّنِإ ۙ ِةَماَيِقْلا ِمْوَي ٰىَلِإ ٌةَغِلاَب اَنْيَلَع ٌناَمْيَأ ْمُكَل ْمَأ",
            "verse 68:40": "(ٌميِعَز َكِلَٰذِب مُهُّيَأ ْمُهْلَس",
            "verse 68:41": "(َنيِقِداَص اوُناَك نِإ ْمِهِئاَكَرُشِب اوُتْأَيْلَف ُءاَكَرُش ْمُهَل ْمَأ",
            "verse 68:42": "(َنوُعيِطَتْسَي اَلَف ِدوُجُّسلا ىَلِإ َنْوَعْدُيَو ٍقاَس نَع ُفَشْكُي َمْوَي",
            "verse 68:43": "(َنوُمِلاَس ْمُهَو ِدوُجُّسلا ىَلِإ َنْوَعْدُي اوُناَك ْدَقَو ۖ ٌةَّلِذ ْمُهُقَهْرَت ْمُهُراَصْبَأ ًةَعِشاَخ",
            "verse 68:44": "(َنوُمَلْعَي اَل ُثْيَح ْنِّم مُهُجِرْدَتْسَنَس ۖ ِثيِدَحْلا اَذَٰهِب ُبِّذَكُي نَمَو يِنْرَذَف",
            "verse 68:45": "(ٌنيِتَم يِدْيَك َّنِإ ۚ ْمُهَل يِلْمُأَو",
            "verse 68:46": "(َنوُلَقْثُّم ٍمَرْغَّم نِّم مُهَف اًرْجَأ ْمُهُلَأْسَت ْمَأ",
            "verse 68:47": "(َنوُبُتْكَي ْمُهَف ُبْيَغْلا ُمُهَدنِع ْمَأ",
            "verse 68:48": "(ٌموُظْكَم َوُهَو ٰىَداَن ْذِإ ِتوُحْلا ِبِحاَصَك نُكَت اَلَو َكِّبَر ِمْكُحِل ْرِبْصاَف",
            "verse 68:49": "(ٌموُمْذَم َوُهَو ِءاَرَعْلاِب َذِبُنَل ِهِّبَّر نِّم ٌةَمْعِن ُهَكَراَدَت نَأ اَلْوَّل",
            "verse 68:50": "(َنيِحِلاَّصلا َنِم ُهَلَعَجَف ُهُّبَر ُهاَبَتْجاَف",
            "verse 68:51": "(ٌنوُنْجَمَل ُهَّنِإ َنوُلوُقَيَو َرْكِّذلا اوُعِمَس اَّمَل ْمِهِراَصْبَأِب َكَنوُقِلْزُيَل اوُرَفَك َنيِذَّلا ُداَكَي نِإَو",
            "verse 68:52": "(َنيِمَلاَعْلِّل ٌرْكِذ اَّلِإ َوُه اَمَو"
        },
        "Azerbaijani": {
            "verse 68:1": "Nun. And olsun qələmə və qələmə alınanlara!",
            "verse 68:2": "Məhz Rəbbinin mərhəmətinə görə sən dəli deyilsən.",
            "verse 68:3": "Şübhəsiz ki, sənin üçün tükənməz bir mükafat hazırlanmışdır.",
            "verse 68:4": "Həqiqətən də, sən böyük əxlaq sahibisən!",
            "verse 68:5": "Sən də görəcəksən, onlar da –",
            "verse 68:6": "hansınızın dəli olduğunu.",
            "verse 68:7": "Şübhəsiz ki, Rəbbin Onun yolundan azanları və haqq yolda olanları daha yaxşı tanıyır.",
            "verse 68:8": "Elə isə haqqı yalan sayanlara güzəştə getmə.",
            "verse 68:9": "Müşriklər istəyirlər ki, sən onlara güzəşt edəsən, onlar da sənə güzəşt etsinlər.",
            "verse 68:10": "İtaət etmə hər tez-tez and içənə, alçağa,",
            "verse 68:11": "qeybət edənə, dedi-qodu yayana,",
            "verse 68:12": "xeyrə mane olana, həddi aşana, günahkara,",
            "verse 68:13": "daş ürəkliyə, bunlardan sonra da başqasının adını mənimsəyən fırıldaqçıya –",
            "verse 68:14": "o adam var-dövlət və oğul-uşaq sahibi olsa belə.",
            "verse 68:15": "Ayələrimiz ona oxunduğu zaman: “Bu, keçmişdəkilərin əsatirlərindəndir!”– deyər.",
            "verse 68:16": "Biz onun burnuna damğa vuracağıq.",
            "verse 68:17": "Həqiqətən, Biz bağ sahiblərini sınağa çəkdiyimiz kimi onları da sınağa çəkdik. O zaman bağ sahibləri səhər açılanda bağda olan meyvələri mütləq dərəcəklərinə and içmişdilər",
            "verse 68:18": "və heç bir istisna da etməmişdilər (“inşallah” deməmişdilər).",
            "verse 68:19": "Onlar yuxuda ikən Rəbbinin əzabı o bağı bürüdü.",
            "verse 68:20": "Bağ yanıb zülmət gecə kimi qapqara oldu.",
            "verse 68:21": "Onlar səhər qalxdıqda bir-birlərini çağırdılar:",
            "verse 68:22": "“Əgər meyvə dərəcəksinizsə, bağınıza erkən gedin!”",
            "verse 68:23": "Onlar bağa yollandılar, yol boyu da bir-birlərinə belə pıçıldayırdılar:",
            "verse 68:24": "“Bu gün oraya – yanınıza heç bir kasıb girməsin!”",
            "verse 68:25": "Onlar bu məqsədlə kasıbları bağa buraxmamağa qadir olacaqlarını zənn edib erkən getdilər.",
            "verse 68:26": "Bağı görəndə isə belə dedilər: “Deyəsən, biz düz gəlməmişik!",
            "verse 68:27": "Xeyr! Biz bu bağın xeyrindən məhrum olmuşuq!”",
            "verse 68:28": "Onların ən insaflısı dedi: “Məgər mən sizə Allahın şəninə təriflər söyləyin deməmişdimmi?”",
            "verse 68:29": "Onlar dedilər: “Rəbbimiz pakdır, müqəddəsdir! Həqiqətən də, biz özümüzə zülm etmişik!”",
            "verse 68:30": "Onlar dönüb bir-birlərini qınamağa başladılar",
            "verse 68:31": "və dedilər: “Vay halımıza! Biz həddi aşanlarıq!",
            "verse 68:32": "Ola bilsin ki, Rəbbimiz bizə bu bağın əvəzinə ondan daha yaxşısını versin. Əlbəttə, biz Rəbbimizə yönəlirik”.",
            "verse 68:33": "Dünyadakı əzab belədir. Axirət əzabı isə daha böyükdür! Kaş biləydilər!",
            "verse 68:34": "Şübhəsiz ki, müttəqilər üçün Rəbbin dərgahında Nəim bağları hazırlanmışdır.",
            "verse 68:35": "Biz heç müsəlmanları günahkarlara tay tutarıqmı?",
            "verse 68:36": "Sizə nə olub, necə hökm verirsiniz?",
            "verse 68:37": "Yoxsa sizin elə bir kitabınız vardır ki, üsyankarla itaətkarın eyni olduğunu ondan oxuyursunuz?",
            "verse 68:38": "Ya da onda bəyəndiyiniz hər bir şeyin sizin olacağı yazılmışdır?",
            "verse 68:39": "Yaxud Bizimlə Qiyamət gününədək əhd bağlamısınız ki, istədiyiniz hər şey sizin olacaqdır?",
            "verse 68:40": "Onlardan soruş ki, kim buna zamin duracaqdır?",
            "verse 68:41": "Yoxsa onların şərikləri vardır? Əgər doğru danışırlarsa, onda qoy şəriklərini gətirsinlər.",
            "verse 68:42": "Ayağın açılacağı və onlar səcdəyə çağırılacaqları, lakin buna qadir ola bilməyəcəkləri gün –",
            "verse 68:43": "onların baxışları yazıq görkəm alacaq, özlərini də zillət bürüyəcəkdir. Hərçənd ki, onlar dünyada ikən sağ-salamat halda səcdə qılmağa dəvət olunurdular.",
            "verse 68:44": "Bu Sözü yalan sayanları Mənim öhdəmə burax. Biz onları tovlayıb bilmədikləri bir yöndən tədricən əzaba sürükləyirik.",
            "verse 68:45": "Hələlik Mən onlara möhlət verirəm. Şübhəsiz ki, Mənim kafirlər üçün qurduğum hiyləm çox güclüdür.",
            "verse 68:46": "Yoxsa sən onlardan bir muzd istəyirsən və onlar da ağır bir borca düşüblər?",
            "verse 68:47": "Yoxsa qeyb onların əlindədir və onlar da ona baxıb istədiklərini yazırlar?",
            "verse 68:48": "Sən öz Rəbbinin hökmünə səbir et və balıq sahibi Yunus kimi olma! O zaman o, qəm-qüssə içində Rəbbinə dua etmişdi.",
            "verse 68:49": "Əgər Rəbbinin mərhəməti ona yetişməsəydi, o, qınanmış halda heç bir bitki bitməyən boş yerə atılacaqdı.",
            "verse 68:50": "Lakin Rəbbi onu seçib əməlisalehlərdən etdi.",
            "verse 68:51": "Həqiqətən, kafirlər Zikri (Quranı) eşitdikləri zaman öz baxışları ilə az qala səni gözə gətirələr. Onlar çarəsizlikdən: “O, dəlidir!”– deyirlər.",
            "verse 68:52": "Halbuki bu Quran aləmlər üçün öyüd-nəsihətdən başqa bir şey deyildir."
        },
        "Bengali": {
            "verse 68:1": "নূন। শপথ কলমের এবং সেই বিষয়ের যা তারা লিপিবদ্ধ করে,",
            "verse 68:2": "আপনার পালনকর্তার অনুগ্রহে আপনি উম্মাদ নন।",
            "verse 68:3": "আপনার জন্যে অবশ্যই রয়েছে অশেষ পুরস্কার।",
            "verse 68:4": "আপনি অবশ্যই মহান চরিত্রের অধিকারী।",
            "verse 68:5": "সত্ত্বরই আপনি দেখে নিবেন এবং তারাও দেখে নিবে।",
            "verse 68:6": "কে তোমাদের মধ্যে বিকারগ্রস্ত।",
            "verse 68:7": "আপনার পালনকর্তা সম্যক জানেন কে তাঁর পথ থেকে বিচ্যুত হয়েছে এবং তিনি জানেন যারা সৎপথ প্রাপ্ত।",
            "verse 68:8": "অতএব, আপনি মিথ্যারোপকারীদের আনুগত্য করবেন না।",
            "verse 68:9": "তারা চায় যদি আপনি নমনীয় হন, তবে তারাও নমনীয় হবে।",
            "verse 68:10": "যে অধিক শপথ করে, যে লাঞ্ছিত, আপনি তার আনুগত্য করবেন না।",
            "verse 68:11": "যে পশ্চাতে নিন্দা করে একের কথা অপরের নিকট লাগিয়ে ফিরে।",
            "verse 68:12": "যে ভাল কাজে বাধা দেয়, সে সীমালংঘন করে, সে পাপিষ্ঠ,",
            "verse 68:13": "কঠোর স্বভাব, তদুপরি কুখ্যাত;",
            "verse 68:14": "এ কারণে যে, সে ধন-সম্পদ ও সন্তান সন্ততির অধিকারী।",
            "verse 68:15": "তার কাছে আমার আয়াত পাঠ করা হলে সে বলে; সেকালের উপকথা।",
            "verse 68:16": "আমি তার নাসিকা দাগিয়ে দিব।",
            "verse 68:17": "আমি তাদেরকে পরীক্ষা করেছি, যেমন পরীক্ষা করেছি উদ্যানওয়ালাদের, যখন তারা শপথ করেছিল যে, সকালে বাগানের ফল আহরণ করবে,",
            "verse 68:18": "ইনশাআল্লাহ না বলে।",
            "verse 68:19": "অতঃপর আপনার পালনকর্তার পক্ষ থেকে বাগানে এক বিপদ এসে পতিত হলো। যখন তারা নিদ্রিত ছিল।",
            "verse 68:20": "ফলে সকাল পর্যন্ত হয়ে গেল ছিন্নবিচ্ছিন্ন তৃণসম।",
            "verse 68:21": "সকালে তারা একে অপরকে ডেকে বলল,",
            "verse 68:22": "তোমরা যদি ফল আহরণ করতে চাও, তবে সকাল সকাল ক্ষেতে চল।",
            "verse 68:23": "অতঃপর তারা চলল ফিসফিস করে কথা বলতে বলতে,",
            "verse 68:24": "অদ্য যেন কোন মিসকীন ব্যক্তি তোমাদের কাছে বাগানে প্রবেশ করতে না পারে।",
            "verse 68:25": "তারা সকালে লাফিয়ে লাফিয়ে সজোরে রওয়ানা হল।",
            "verse 68:26": "অতঃপর যখন তারা বাগান দেখল, তখন বললঃ আমরা তো পথ ভূলে গেছি।",
            "verse 68:27": "বরং আমরা তো কপালপোড়া,",
            "verse 68:28": "তাদের উত্তম ব্যক্তি বললঃ আমি কি তোমাদেরকে বলিনি? এখনও তোমরা আল্লাহ তা’আলার পবিত্রতা বর্ণনা করছো না কেন?",
            "verse 68:29": "তারা বললঃ আমরা আমাদের পালনকর্তার পবিত্রতা ঘোষণা করছি, নিশ্চিতই আমরা সীমালংঘনকারী ছিলাম।",
            "verse 68:30": "অতঃপর তারা একে অপরকে ভৎর্সনা করতে লাগল।",
            "verse 68:31": "তারা বললঃ হায়! দুর্ভোগ আমাদের আমরা ছিলাম সীমাতিক্রমকারী।",
            "verse 68:32": "সম্ভবতঃ আমাদের পালনকর্তা পরিবর্তে এর চাইতে উত্তম বাগান আমাদেরকে দিবেন। আমরা আমাদের পালনকর্তার কাছে আশাবাদী।",
            "verse 68:33": "শাস্তি এভাবেই আসে এবং পরকালের শাস্তি আরও গুরুতর; যদি তারা জানত!",
            "verse 68:34": "মোত্তাকীদের জন্যে তাদের পালনকর্তার কাছে রয়েছে নেয়ামতের জান্নাত।",
            "verse 68:35": "আমি কি আজ্ঞাবহদেরকে অপরাধীদের ন্যায় গণ্য করব?",
            "verse 68:36": "তোমাদের কি হল ? তোমরা কেমন সিদ্ধান্ত দিচ্ছ?",
            "verse 68:37": "তোমাদের কি কোন কিতাব আছে, যা তোমরা পাঠ কর।",
            "verse 68:38": "তাতে তোমরা যা পছন্দ কর, তাই পাও?",
            "verse 68:39": "না তোমরা আমার কাছ থেকেকেয়ামত পর্যন্ত বলবৎ কোন শপথ নিয়েছ যে, তোমরা তাই পাবে যা তোমরা সিদ্ধান্ত করবে?",
            "verse 68:40": "আপনি তাদেরকে জিজ্ঞাসা করুন তাদের কে এ বিষয়ে দায়িত্বশীল?",
            "verse 68:41": "না তাদের কোন শরীক উপাস্য আছে? থাকলে তাদের শরীক উপাস্যদেরকে উপস্থিত করুক যদি তারা সত্যবাদী হয়।",
            "verse 68:42": "গোছা পর্যন্ত পা খোলার দিনের কথা স্মরণ কর, সেদিন তাদেরকে সেজদা করতে আহবান জানানো হবে, অতঃপর তারা সক্ষম হবে না।",
            "verse 68:43": "তাদের দৃষ্টি অবনত থাকবে; তারা লাঞ্ছনাগ্রস্ত হবে, অথচ যখন তারা সুস্থ ও স্বাভাবিক অবস্থায় ছিল, তখন তাদেরকে সেজদা করতে আহবান জানানো হত।",
            "verse 68:44": "অতএব, যারা এই কালামকে মিথ্যা বলে, তাদেরকে আমার হাতে ছেড়ে দিন, আমি এমন ধীরে ধীরে তাদেরকে জাহান্নামের দিকে নিয়ে যাব যে, তারা জানতে পারবে না।",
            "verse 68:45": "আমি তাদেরকে সময় দেই। নিশ্চয় আমার কৌশল মজবুত।",
            "verse 68:46": "আপনি কি তাদের কাছে পারিশ্রমিক চান? ফলে তাদের উপর জরিমানার বোঝা পড়ছে?",
            "verse 68:47": "না তাদের কাছে গায়বের খবর আছে? অতঃপর তারা তা লিপিবদ্ধ করে।",
            "verse 68:48": "আপনি আপনার পালনকর্তার আদেশের অপেক্ষায় সবর করুন এবং মাছওয়ালা ইউনুসের মত হবেন না, যখন সে দুঃখাকুল মনে প্রার্থনা করেছিল।",
            "verse 68:49": "যদি তার পালনকর্তার অনুগ্রহ তাকে সামাল না দিত, তবে সে নিন্দিত অবস্থায় জনশুন্য প্রান্তরে নিক্ষিপ্ত হত।",
            "verse 68:50": "অতঃপর তার পালনকর্তা তাকে মনোনীত করলেন এবং তাকে সৎকর্মীদের অন্তর্ভুক্ত করে নিলেন।",
            "verse 68:51": "কাফেররা যখন কোরআন শুনে, তখন তারা তাদের দৃষ্টি দ্বারা যেন আপনাকে আছাড় দিয়ে ফেলে দিবে এবং তারা বলেঃ সে তো একজন পাগল।",
            "verse 68:52": "অথচ এই কোরআন তো বিশ্বজগতের জন্যে উপদেশ বৈ নয়।"
        },
        "Berber Amazigh": {
            "verse 68:1": "N. S wamru akked wayen pjerriden!",
            "verse 68:2": "Keçç, s l$it n Mass ik, ur telliv d aôehbani!",
            "verse 68:3": "Ih, i keçç arraz ur nepnegzay.",
            "verse 68:4": "Ih, keçç, lxaîeô ik d ûûam.",
            "verse 68:5": "A pwaliv, ad walin",
            "verse 68:6": "anwa degwen ippuhewwlen.",
            "verse 68:7": "D Mass ik, ih, i Izôan sennig wiyav, anwa iff$en abrid iS. D Neppa i Izôan, sennig wiyav, anwi ipwanhan.",
            "verse 68:8": "Ihi, ur ppak awal i inekkaôen.",
            "verse 68:9": "Ssaramen a ppestaâmlev, akken ad staâmlen.",
            "verse 68:10": "Ur ssemêas i yal afuêan ipgallan,",
            "verse 68:11": "aqeôôad ileêêun iplemmim,",
            "verse 68:12": "i igelden lxiô, ippawven, idenben,",
            "verse 68:13": "amjuô, u irna d akluc.",
            "verse 68:14": "Xas $uôes ayla, igwerdan.",
            "verse 68:15": "Ma $ôan as issekniyen nne£, iqqaô: \"d timucuha imezwura\".",
            "verse 68:16": "A t Nweccem deg wanzaren.",
            "verse 68:17": "Ih, Njeôôeb iten akken Njeôôeb at leonan, mi gullen, ar di tûebêit, ad $elten.",
            "verse 68:18": "Ggulen ur êniten.",
            "verse 68:19": "Tezzi yas tbucivant s$uô Mass ik, nitni îîsen.",
            "verse 68:20": "Iu$al amzun d lbuô.",
            "verse 68:21": "Di tûebêit msawalen:",
            "verse 68:22": "\"ekkret zik, ar lexla nnwen, ma a p$elltem\"!",
            "verse 68:23": "Teddun, sbecbucen garasen:",
            "verse 68:24": "\"igellil, assa, ur t ppaooat a p id ikçem\". ö",
            "verse 68:25": "Öuêen ppeklen, zemren.",
            "verse 68:26": "Mi t walan, nnan: \"nekwni d im$eôôqen.",
            "verse 68:27": "Ih, aql a$ nepwaêeôôem\".",
            "verse 68:28": "Inna uêdiq mavi nnsen: \"day ur awen nni$ ara: a lemmer tesbuccuâem\"?",
            "verse 68:29": "Nnan: \"nesbuccaâ Mass nne$. Nella, s tidep, d imednas\".",
            "verse 68:30": "Mqabalen, ppemyuzzamen.",
            "verse 68:31": "Nnan: \"a ssexv nne$, nella d imjuôen!",
            "verse 68:32": "Ahat Mass nne$ ad a$ d I$ôem sennig waya; ih, nekwni, ar Mass nne$, d imectaqen\".",
            "verse 68:33": "Am akka, aqeîîi. Aqeîîi n laxeôt, war ccekk, meqqweô kteô, lemmer éôin!",
            "verse 68:34": "Ih, i wid ipêezziben i Mass nnsen, Loennet n ssuâada.",
            "verse 68:35": "Aâni Nerr imvuâen am ibe$wviyen?",
            "verse 68:36": "Acu ikwen iu$en? Amek tepêuddum?",
            "verse 68:37": "Ne$ tesâam tazmamt ideg tlemdem,",
            "verse 68:38": "degs, i kunwi, s tidep, ayen tesmenyafem?",
            "verse 68:39": "Ne$ $uôwen tuqqna s$uône$, ar ass iqeîîiten, ara kwen id ias wayen têuddem?",
            "verse 68:40": "Steqsi ten ma, $ef waya, $uôsen îîamen,",
            "verse 68:41": "ne$ $uôsen icriken? Ihi, a d awin icriken nnsen, ma d tidep ay ssawalen!",
            "verse 68:42": "Ass ideg ara tepwafveê twa$it, ad asen inin ad knun, ur zmiren.",
            "verse 68:43": "Ad brunt wallen, ddell iwwet iten. Ni$ pwanecden ar lekni, mi llan ûeêêan.",
            "verse 68:44": "Eoo iyI akked wid iskaddben awal agi. Ad asen Ddu$ cwiî, cwiî, seg wanda ur éôin.",
            "verse 68:45": "Ad asen Fke$ lmudda. Ni$ tiêeôci W teéweô.",
            "verse 68:46": "Ne$ tessutrev taqdiât, fellasen d îîlaba ééayen?",
            "verse 68:47": "Ne$ $uôsen tabavnit, d$a la pparun?",
            "verse 68:48": "Eûbeô i ôôay n Mass ik, ur ppili am bu uslem, i d issawlen mi ippuêeyyeô.",
            "verse 68:49": "Lemmer ur t id issukkes l$it n Mass is, a d iu$al ar lxali, d amaâfun.",
            "verse 68:50": "Ifren it Mass is, Irra t seg iâaôviyen.",
            "verse 68:51": "Qôib i k smalen ijehliyen, s wallen nnsen, mi slan i usmekti. La qqaôen: \"ar neppa d aôehbani\".",
            "verse 68:52": "Neppa, d asmekti kan i imavalen."
        },
        "Bosnian": {
            "verse 68:1": "Nūn. Tako Mi kalema i onoga što oni pišu,",
            "verse 68:2": "ti nisi, milošću Gospodara svoga, lud;",
            "verse 68:3": "ti ćeš, sigurno, nagradu neprekidnu dobiti,",
            "verse 68:4": "jer ti si, zaista, najljepše ćudi",
            "verse 68:5": "i ti ćeš vidjeti, a i oni će vidjeti,",
            "verse 68:6": "ko je od vas lud.",
            "verse 68:7": "Gospodar tvoj dobro zna onoga koji je s puta Njegova skrenuo i On dobro zna one koji su na Pravome putu,",
            "verse 68:8": "zato ne slušaj one koji neće da vjeruju,",
            "verse 68:9": "oni bi jedva dočekali da ti popustiš, pa bi i oni popustili,",
            "verse 68:10": "i ne slušaj nijednog krivokletnika, prezrena,",
            "verse 68:11": "klevetnika, onoga koji tuđe riječi prenosi,",
            "verse 68:12": "škrca, nasilnika, velikog grješnika,",
            "verse 68:13": "surova i, osim toga, u tuđe pleme uljeza,",
            "verse 68:14": "samo zato što je bogat i što ima mnogo sinova,",
            "verse 68:15": "koji govori, kad mu se ajeti Naši kazuju: \"To su samo naroda drevnih priče!\"",
            "verse 68:16": "Na nos ćemo Mi njemu biljeg utisnuti!",
            "verse 68:17": "Mi smo ih na kušnju stavili, kao što smo vlasnike jedne bašče na kušnju stavili kad su se zakleli da će je, sigurno, rano izjutra obrati",
            "verse 68:18": "a nisu rekli: \"Ako Bog da!\"",
            "verse 68:19": "I dok su oni spavali, nju od Gospodara tvoga zadesi nesreća",
            "verse 68:20": "i ona osvanu opustošena.",
            "verse 68:21": "A u zoru oni su jedni druge dozivali:",
            "verse 68:22": "\"Poranite u bašču svoju ako je mislite obrati!\"",
            "verse 68:23": "I oni krenuše tiho razgovarajući:",
            "verse 68:24": "\"Neka vam danas u nju nikako nijedan siromah ne ulazi!\"",
            "verse 68:25": "I oni poraniše uvjereni da će moći to provesti,",
            "verse 68:26": "a kad je ugledaše, povikaše: \"Mi smo zalutali;",
            "verse 68:27": "ali ne, ne – svega smo lišeni!\"",
            "verse 68:28": "Ponajbolji između njih reče: \"Nisam li vam ja govorio da je trebalo na Allaha misliti!\"",
            "verse 68:29": "\"Hvaljen neka je Gospodar naš!\" – rekoše – \"mi smo, uistinu, nepravedni bili!\"",
            "verse 68:30": "I onda počeše jedni druge koriti.",
            "verse 68:31": "\"Teško nama!\" – govorili su – \"mi smo, zaista, obijesni bili;",
            "verse 68:32": "Gospodar naš nam može bolju od nje dati, samo od Gospodara našeg mi se nadamo naknadi!\"",
            "verse 68:33": "Eto takva je bila kazna, a na onome je svijetu, nek znaju, kazna još veća!",
            "verse 68:34": "Za one koji se budu bojali Allaha biće, zaista, dženneti uživanja u Gospodara njihova –",
            "verse 68:35": "zar ćemo muslimane sa nevjernicima izjednačiti?!",
            "verse 68:36": "Šta vam je, kako rasuđujete?",
            "verse 68:37": "Imate li vi Knjigu, pa u njoj čitate",
            "verse 68:38": "da ćete imati ono što vi izaberete?",
            "verse 68:39": "Ili, zar smo vam se zakleli zakletvama koje će do Sudnjeg dana vrijediti da ćete ono što vi odredite imati?",
            "verse 68:40": "Upitaj ih ko je od njih jamac za to.",
            "verse 68:41": "Ili, imaju li oni druge jamce? Pa neka jamce svoje dovedu, ako govore istinu.",
            "verse 68:42": "Na Dan kada bude nepodnošljivo i kada budu pozvani da licem na tle padnu pa ne budu mogli,",
            "verse 68:43": "oborenih pogleda i sasvim poniženi biće nevjernici – a bili su pozivani da licem na tle padaju dok su živi i zdravi bili.",
            "verse 68:44": "Zato ostavi Mene i one koji ovaj Govor poriču, Mi ćemo ih postepeno odakle se i ne nadaju patnji približavati",
            "verse 68:45": "i vremena im davati, jer je obmana Moja, zaista, jaka!",
            "verse 68:46": "Tražiš li ti od njih nagradu, pa su nametom opterećeni?",
            "verse 68:47": "Ili je u njih iskonska knjiga, pa prepisuju?",
            "verse 68:48": "Ti strpljivo čekaj presudu Gospodara svoga i ne budi kao Zunnun koji je u ogorčenju zavapio.",
            "verse 68:49": "I da ga nije stigla Allahova milost, na pusto mjesto bi izbačen bio i prijekor bi zaslužio,",
            "verse 68:50": "ali, Gospodar njegov ga je odabrao i učinio ga jednim od onih koji su dobri.",
            "verse 68:51": "Skoro da te nevjernici pogledima svojim obore kad Kur'an slušaju, govoreći: \"On je, uistinu, luda!\"",
            "verse 68:52": "A Kur'an je svijetu cijelome opomena!"
        },
        "Bulgarian": {
            "verse 68:1": "Нун. Кълна се в калема и в онова, което пишат!",
            "verse 68:2": "Ти [о, Мухаммад] - по милостта на твоя Господ - не си луд.",
            "verse 68:3": "За теб има несекваща награда.",
            "verse 68:4": "Ти наистина имаш велик нрав.",
            "verse 68:5": "Ти ще видиш и те ще видят",
            "verse 68:6": "кой от вас е безумният.",
            "verse 68:7": "Най-добре твоят Господ знае кой се е отклонил от Неговия път и най-добре Той знае напътените.",
            "verse 68:8": "И не се покорявай на отричащите!",
            "verse 68:9": "Желаят, ако се смекчиш, и те да се смекчат.",
            "verse 68:10": "И не се покорявай на онзи, който все се кълне и е жалък,",
            "verse 68:11": "клеветник, който разнася сплетни,",
            "verse 68:12": "възпира доброто, престъпва, съгрешава,",
            "verse 68:13": "грубиян и дори извънбрачен син.",
            "verse 68:14": "А тъй като има богатство и синове,",
            "verse 68:15": "когато му бъдат четeни Нашите знамения, казва: “Легенди на предците!”",
            "verse 68:16": "Ще го бележим по носа.",
            "verse 68:17": "Изпитахме ги, както изпитахме и стопаните на градината, когато се заклеха [тайно] да я оберат на сутринта.",
            "verse 68:18": "И да не правят изключение.",
            "verse 68:19": "И я споходи бедствие от твоя Господ, докато спяха.",
            "verse 68:20": "И тя стана като черна нощ.",
            "verse 68:21": "И си викаха един другиму на сутринта:",
            "verse 68:22": "“Тръгнете към своята реколта в зори, ако ще берете!”",
            "verse 68:23": "И се отправиха, шепнейки един на друг:",
            "verse 68:24": "“Днес да не влиза там при вас бедняк!”",
            "verse 68:25": "И тръгнаха в зори с твърдо намерение.",
            "verse 68:26": "И когато я видяха, рекоха: “Наистина сме се заблудили.",
            "verse 68:27": "Не, ние сме лишени.”",
            "verse 68:28": "Най-разумният от тях рече: “Не ви ли казах - защо не прославяте Аллах?”",
            "verse 68:29": "Рекоха: “Слава на нашия Господ! Бяхме угнетители.”",
            "verse 68:30": "И започнаха взаимно да се укоряват.",
            "verse 68:31": "Рекоха: “О, горко ни, наистина сме престъпващи!",
            "verse 68:32": "Дано нашият Господ ни даде в замяна по-добра от нея. Ние нашия Господ умоляваме.”",
            "verse 68:33": "Такова е наказанието. А наказанието в отвъдния живот е по-голямо, ако знаят.",
            "verse 68:34": "Наистина за богобоязливите при техния Господ са Градините на блаженството.",
            "verse 68:35": "Нима отдадените на Аллах ще сторим да са като престъпниците?",
            "verse 68:36": "Какво ви е, така да отсъждате?",
            "verse 68:37": "Или имате книга, от която се учите,",
            "verse 68:38": "и в нея имате, каквото изберете?",
            "verse 68:39": "Или имате обещание от Нас до Деня на възкресението да имате онова, което сами отсъждате?",
            "verse 68:40": "Питай ги кой от тях е поръчител за това?",
            "verse 68:41": "Или имат съдружници? Да доведат своите съдружници - ако говорят истината -",
            "verse 68:42": "в Деня, когато ще се разкрият делата и [тези] ще бъдат приканени да се поклонят, а не ще могат.",
            "verse 68:43": "Свели поглед, ще ги покрие унижение, а бяха приканвани да се покланят, когато бяха здрави.",
            "verse 68:44": "Остави на Мен [о, Мухаммад] взимащите за лъжа тази Вест! Постепенно ще ги въвлечем [в погибел], без да разберат.",
            "verse 68:45": "Ще им дам отсрочка. Моята промисъл е силна.",
            "verse 68:46": "Или търсиш от тях отплата, та са обременени с дълг?",
            "verse 68:47": "Или при тях е неведомото и те го записват?",
            "verse 68:48": "Изтърпи до присъдата на твоя Господ и не бъди като човека в кита, който зовеше, изпълнен със скръб!",
            "verse 68:49": "Ако не бе го достигнала милост от неговия Господ, щеше да е изхвърлен на голия бряг с упрек.",
            "verse 68:50": "Но неговият Господ го пречисти и го стори праведник.",
            "verse 68:51": "И едва не те сразяват с погледи неверниците, когато слушат Напомнянето6, и казват: “Той е луд.”",
            "verse 68:52": "А то не е друго освен напомняне за световете."
        },
        "Chinese": {
            "verse 68:1": "努奈。以笔和他们所写的盟誓，",
            "verse 68:2": "你为主的恩典，你绝不是一个疯人，",
            "verse 68:3": "你必得享受不断的报酬。",
            "verse 68:4": "你确是具备一种伟大的性格的。",
            "verse 68:5": "你将看见，他们也将看见，",
            "verse 68:6": "你们究竟谁是害疯病的。",
            "verse 68:7": "你的主的确知道谁是叛离他的正道的，他的确知道谁是遵循他的正道的。",
            "verse 68:8": "你不要顺从否认真理的人们，",
            "verse 68:9": "他们希望你柔顺，他们也柔顺。",
            "verse 68:10": "你不要顺从每个妄誓的、卑贱的、",
            "verse 68:11": "说谎的、进馋的、",
            "verse 68:12": "吝啬的、过份的、犯罪的、",
            "verse 68:13": "粗鄙而且是私生子的人。",
            "verse 68:14": "那是因为他是有财产和子嗣的。",
            "verse 68:15": "有人对他宣读我的迹象时，他就说：这是古人的故事。",
            "verse 68:16": "我将在他的鼻子上打上烙印。",
            "verse 68:17": "我确已考验他们，犹如考验园圃的主人们一样。当时，他们曾盟誓，他们必定在早晨收获园圃中的果实，",
            "verse 68:18": "并不留一部分给贫民。",
            "verse 68:19": "当他们正在睡觉的时候，从你的主发出的灾难降临那个园圃，",
            "verse 68:20": "一旦之间变成焦土一样。",
            "verse 68:21": "他们曾在早晨彼此相呼：",
            "verse 68:22": "你们当在早晨到园里去，如果你们要想收获。",
            "verse 68:23": "他们走了，途中悄悄地商议说：",
            "verse 68:24": "今天绝不要让一个贫民走进园圃。",
            "verse 68:25": "他们早晨起来以为自己是能遏制的。",
            "verse 68:26": "当他们看见园圃的时候，他们说：我们碓是迷误的，",
            "verse 68:27": "不然，我们是被剥夺的！",
            "verse 68:28": "他们中最优秀的人说：难道我没有对你们说吗？你们怎么不赞颂真主呢？",
            "verse 68:29": "他们说：赞颂我们的主超绝万物！我们确是不义的。",
            "verse 68:30": "於是他们大家走向前来，互相责备起来。",
            "verse 68:31": "他们说：伤哉我们！我们原来确是放荡者。",
            "verse 68:32": "或许我们的主，以一个比这还好的园圃，补偿我们，我们确是恳求我们的主的。",
            "verse 68:33": "刑罚就是那样的。后世的刑罚确是更重大的，假如他们知道。",
            "verse 68:34": "敬畏的人们，在他们的主那里，必将享受恩泽的乐园。",
            "verse 68:35": "难道我使归顺的人像犯罪的人一样吗？",
            "verse 68:36": "你们有甚么理由？你们怎么这样的判断呢！",
            "verse 68:37": "难道有一本可供你们诵习的天经，",
            "verse 68:38": "在那本天经里你们确有自己所选择的。",
            "verse 68:39": "难道我曾与你们缔结过复活日才满期的、坚定的盟约，因而你们确有你们所判断的？",
            "verse 68:40": "你问他们，他们中有谁能保证那件事呢？",
            "verse 68:41": "难道他们有许多配主吗？教他们把那些配主召唤来，如果 他们是诚实的人。",
            "verse 68:42": "在那日，大难将临头，他们将被召去叩头，而他们不能叩头。",
            "verse 68:43": "同时，他们身遭凌辱，不敢仰视。而过去他们健全的时候，曾被召去叩头。",
            "verse 68:44": "你让我惩治否认这训辞的人吧！我将使他们不知不觉地渐趋於毁灭。",
            "verse 68:45": "我优容他们，我的计策确是周密的。",
            "verse 68:46": "你向他们索取报酬，教他们担负太重呢？",
            "verse 68:47": "还是他们能知幽玄，故加以记录呢？",
            "verse 68:48": "故你应当忍受你的主的判决，不要像那个葬身鱼腹的人一样。当时，他拗著怒呼吁他的主；",
            "verse 68:49": "假若从他的主发出的恩典没有达到他，那末，他必受责备地被抛到荒凉的地方。",
            "verse 68:50": "嗣后，他的主拣选了他，并使他入於善人之列。",
            "verse 68:51": "不信道的人们几乎以他们的怒目使你跌倒。当他们听到宣读教诲的时候，他们说：他确是一个疯子。",
            "verse 68:52": "这《古兰经》不是别的，它是对全世界的教诲。"
        },
        "Danish": {
            "verse 68:1": "Noen. Bij de pen, en bij hetgeen zij schrijven",
            "verse 68:2": "Gij zijt, bij de gratie van uw Heer, geen krankzinnige",
            "verse 68:3": "En voorzeker er is een loon voor u dat niet zal ophouden",
            "verse 68:4": "En gij staat zeker op hoog zedelijk peil",
            "verse 68:5": "En gij zult zien en zij (de ongelovigen) zullen ook zien",
            "verse 68:6": "Wie van u bezeten is",
            "verse 68:7": "Zeker, uw Heer weet het beste wie van Zijn weg afdwaalt en Hij kent het beste degenen die de leiding volgen",
            "verse 68:8": "Dus gehoorzaam de loochenaars niet",
            "verse 68:9": "Zij zouden willen dat gij meegaande waart, dan zouden zij ook meegaande kunnen zijn",
            "verse 68:10": "En geef geen gehoor aan een verachtelijke eedaflegger",
            "verse 68:11": "Lasteraar, achterklapper",
            "verse 68:12": "Tegenhouder van het goede, overtreder, zondaar",
            "verse 68:13": "Laatdunkend, bovendien een berucht misdadiger",
            "verse 68:14": "Omdat hij rijkdommen en kinderen bezit",
            "verse 68:15": "Wanneer Onze woorden aan hem worden voorgedragen, zegt hij: Fabelen der oudeu",
            "verse 68:16": "Wij zullen hem op de neus brandmerken",
            "verse 68:17": "Voorwaar, Wij zullen hen (de ongelovigen) op de proef stellen zoals Wij de eigenaars van een tuin beproefden toen zij zwoeren dat zij zeker het fruit daarvan in de vroege morgen zouden plukken",
            "verse 68:18": "En zij maakten geen voorbehoud",
            "verse 68:19": "Toen kwam er van uw Heer een bezoeking over hen, terwijl zij sliepen",
            "verse 68:20": "Waardoor (de tuin) werd als een gemaaid veld",
            "verse 68:21": "Toen riepen zij tot elkander in de morgen",
            "verse 68:22": "Zeggende: Gaat vroeg naar uw veld indien gij het fruit wilt plukken",
            "verse 68:23": "En zij gingen fluisterend met elkander op weg",
            "verse 68:24": "Laat heden geen arme bij u binnen komen",
            "verse 68:25": "En zij gingen vroeg in de morgen uit, (denkende) dat zij de macht hadden om het te verhinderen",
            "verse 68:26": "Maar toen zij de tuin zagen, zeiden zij: Voorwaar, wij zijn verdwaald",
            "verse 68:27": "Neen, wij zijn beroofd",
            "verse 68:28": "De beste onder hen sprak: Zeide ik niet tot u: Waarom looft gij (God) niet",
            "verse 68:29": "Nu riepen zij uit: Glorie zij U, onze Heer! Voorzeker wij waren onrechtvaardig",
            "verse 68:30": "Toen gingen zij elkaar beschuldigen",
            "verse 68:31": "En zeiden: Wee ons, wij waren inderdaad overtreders",
            "verse 68:32": "Het kan zijn dat onze Heer ons een betere tuin dan deze zal geven, wij wenden ons tot onze Heer",
            "verse 68:33": "Zo is de straf (voor dit leven). En voorwaar, de straf van het Hiernamaals zal nog groter zijn, konden zij dit maar begrijpen",
            "verse 68:34": "Inderdaad, voor de rechtvaardigen zijn er verrukkelijke tuinen bij hun Heer",
            "verse 68:35": "Zullen Wij dan degenen die zich onderwerpen even als de schuldigen behandelen",
            "verse 68:36": "Wat is er met u? Hoe oordeelt gij",
            "verse 68:37": "Hebt gij een Boek waarin gij leest",
            "verse 68:38": "Dat gij alles waarnaar gij verlangt zult verkrijgen",
            "verse 68:39": "Of hebt gij enige verdragen met Ons gesloten tot de Dag der Opstanding zodat gij dan alles zult hebben wat gij zult willen",
            "verse 68:40": "Vraag hun, wie van hen daar borg voor is",
            "verse 68:41": "Of hebben zij soms deelgenoten? Laten zij dan deze naar voren brengen als zij de waarheid spreken",
            "verse 68:42": "Op de Dag, waarop men beangstigd wordt, zullen zij geroepen worden te prostreren, maar zij zullen dat niet kunnen doen",
            "verse 68:43": "Hun ogen zullen terneergeslagen zijn en vernedering zal hen overvallen, want zij werden tot het prostraat Sadjdah geroepen toen hun niets ontbrak (en zij deden het niet)",
            "verse 68:44": "Laat Mij en degenen die deze aankondiging loochenen, alleen. Wij zullen hen stap voor stap (de vernietiging) doen naderen, op een wijze die zij niet kennen",
            "verse 68:45": "En Ik geef hun uitstel; want Mijn opzet is sterk",
            "verse 68:46": "Vraagt gij van hen een beloning voor u zelf zodat zij onder schuld gebukt gaan",
            "verse 68:47": "Of hebben zij kennis van het onzienlijke, zodat zij het kunnen opschrijven",
            "verse 68:48": "Wacht geduldig op het gebod van uw Heer en wees niet als de man van de vis toen hij (Allah) aanriep terwijl hij misnoegd was",
            "verse 68:49": "Als een gunst van zijn Heer hem niet had bereikt dan zou hji zeker op een dorre kust geworpen zijn, terwijl hij vernederd werd",
            "verse 68:50": "Maar zijn Heer verkoos hem en maakte hem tot één der goeden",
            "verse 68:51": "En de ongelovigen wanneer zij het vermaan horen willen u met hun blikken gaarne ten val brengen; en zij zeggen: Hij is zeker krankzinnig",
            "verse 68:52": "Neen, het (Boek) is niets dan een vermaning voor de werelden"
        },
        "Dutch": {
            "verse 68:1": "Nôen. Bij de pen en wat zij schrijven.",
            "verse 68:2": "Jij bent dankzij de gunst van jouw Heer geen bezetene.",
            "verse 68:3": "En voorwaar, voor jou is er zeker een beloning zonder onderbreking.",
            "verse 68:4": "En voorwaar, jij beschikt over een hoogstaand karakter.",
            "verse 68:5": "Jullie zullen zien en zij zullen zien.",
            "verse 68:6": "Wie van jullie de (met bezetenheid) beproefde is.",
            "verse 68:7": "Voorwaar, jouw Heer weet het beste wie van Zijn Weg is afgedwaald en Hij kent het beste de rechtgeleiden.",
            "verse 68:8": "Gehoorzaam daarom de loochenaars niet.",
            "verse 68:9": "Zij wensen dat jij toegeeflijk zal worden, dan zullen zij (ook) toegeeflijk worden.",
            "verse 68:10": "En gehoorzaam geen enkele verachtelijke edenzweerder.",
            "verse 68:11": "Een lasteraar die rondloopt met roddelpraat.",
            "verse 68:12": "Een tegenhouder van het goede, buitensporig, zondig.",
            "verse 68:13": "Die daarnaast ook nog een bruut is, en bastaard.",
            "verse 68:14": "(Hij is ongelovig) omdat hij een bezitter van rijkdom en zonen is.",
            "verse 68:15": "Wanneer Onze Verzen aan hem voorgedragen worden, dan zegt hij: \"Fabels van de vroegeren.\"",
            "verse 68:16": "Wij zullen hem brandmerken op zijn snuit.",
            "verse 68:17": "Wij hebben hen beproefd zoals Wij de bezitters van de tuin hebben beproefd, toen zij zwoeren in de morgen van haar (vruchten) te zullen plukken.",
            "verse 68:18": "Maar zij maakten geen voorbehoud.",
            "verse 68:19": "Toen ging er een bezoeking (storm) van jouw Heer in haar rond, terwijl zij sliepen.",
            "verse 68:20": "Zij werd als een verschroeid stoppelveld.",
            "verse 68:21": "Toen riepen zij tot elkaar in de ochtend.",
            "verse 68:22": "\"Gaat deze ochtend naar jullie akkers, als jullie van plan zijn om te oogsten.\"",
            "verse 68:23": "Zo vertrokken zij, terwijl zij naar elkaar fluisterden.",
            "verse 68:24": "(Zij zeiden:) \"Laat er deze dag geen enkele arme bij jullie binnengaan.\"",
            "verse 68:25": "En zij vertrokken die ochtend, vastbesloten om (de armen) te weren.",
            "verse 68:26": "Maar toen zij haar (de tuin) zagen, zeiden zij: \"Voorwaar, wij zijn zeker dwalenden.",
            "verse 68:27": "Wij zijn zelfs beroofd.\"",
            "verse 68:28": "De meest wijze onder hen zei: \"Heb ik jullie niet gezegd dat jullie de Glorie (van Allah) hadden moeten prijzen!\"",
            "verse 68:29": "Zij zeiden: \"Heilig is onze Heer: voorwaar, wij waren onrechtvaardig.\"",
            "verse 68:30": "Toen keerde de ene groep zich tegen de andere, elkaar verwijten makend.",
            "verse 68:31": "Zij zeiden: \"Wee ons! Voorwaar, wij waren buitensporig.",
            "verse 68:32": "Hopelijk zal onze Heer ons een betere (tuin) in de plaats van deze geven: voorwaar, wij hopen vurig (op vergeving) van onze Heer.\"",
            "verse 68:33": "Zo was de bestraffing. En de bestraffing in het Hiernamaals is zeker groter, als zij het zouden weten!",
            "verse 68:34": "Voorwaar, voor de Moettaqôen zijn er bij hun Heer Tuinen van gelukzaligheid (het Paradijs).",
            "verse 68:35": "Zullen Wij hen die zich aan Allah hebben overgegeven net zo behandelen als de misdadigers?",
            "verse 68:36": "Wat is er met jullie? Hoe oordelen jullie?",
            "verse 68:37": "Of hebben jullie een Schrift waar jullie in kunnen studeren?",
            "verse 68:38": "Waar waarlijk voor jullie in is wat jullie kiezen?",
            "verse 68:39": "Of hebben jullie een verdrag met Ons dat tot aan de Dag der Opstanding geldt, dat er waarlijk voor jullie is wat jullie oordelen?",
            "verse 68:40": "Vraag hun wie van hen daarvoor verantwoordelijk is.",
            "verse 68:41": "Of beschikken zij over deelgenoten? Laat zij dan komen met kun deelgenoten, als zij waarachtig zijn.",
            "verse 68:42": "(Gedenkt) de Dag waarop de onderbenen ontbloot zullen worden en zij opgeroepen worden om neer te knielen, terwijl zij daartoe niet in staat zijn.",
            "verse 68:43": "Hun ogen zullen angstig teneergeslagen zijn, vernedering zal hen bedekken. En waarlijk, zij werden opgeroepen om zich neer te knielen, terwijl zij (nog) gezond waren.",
            "verse 68:44": "Laat daarom degene die deze Boodschap loochent aan Mij over. Wij zullen hen langzaam maar zeker vernietigen, op een manier dat zij het niet merken.",
            "verse 68:45": "En ik zal kun uitstel geven. Voorwaar, Mijn plan is sterk.",
            "verse 68:46": "Of vraag jij van hen een beloning, zodat zij met een schuld worden belast?",
            "verse 68:47": "Of is bij hen (kennis) van het onwaarneembare, zodat zij het kunnen opschrijven?",
            "verse 68:48": "Wees daarom geduldig tot het Oordeel van jouw Heer komt, en wees niet als de Profeet Yôenoes, toen hij (tot Allah) riep terwijl hij verbolgen was.",
            "verse 68:49": "Als hem van zijn Heer geen genade bereikt had, dan was hij zeker op een kwade plaats neer gesmeten, met verwijten beladen.",
            "verse 68:50": "Daarna verkoos zijn Heer hem en maakte Hij hem tot één van de rechtschapenen.",
            "verse 68:51": "En bijna zouden degenen die niet geloven jou omwerpen met hun blikken, wanneer zij de Vermaning horen. En zij zeggen: \"Voorwaar, hij is zeker bezeten.\"",
            "verse 68:52": "Terwijl hij (de Koran) niets anders is dan een Vermaning voor de werelden."
        },
        "English": {
            "verse 68:1": "Nun. By the pen and what they inscribe,",
            "verse 68:2": "You are not, [O Muhammad], by the favor of your Lord, a madman.",
            "verse 68:3": "And indeed, for you is a reward uninterrupted.",
            "verse 68:4": "And indeed, you are of a great moral character.",
            "verse 68:5": "So you will see and they will see",
            "verse 68:6": "Which of you is the afflicted [by a devil].",
            "verse 68:7": "Indeed, your Lord is most knowing of who has gone astray from His way, and He is most knowing of the [rightly] guided.",
            "verse 68:8": "Then do not obey the deniers.",
            "verse 68:9": "They wish that you would soften [in your position], so they would soften [toward you].",
            "verse 68:10": "And do not obey every worthless habitual swearer",
            "verse 68:11": "[And] scorner, going about with malicious gossip -",
            "verse 68:12": "A preventer of good, transgressing and sinful,",
            "verse 68:13": "Cruel, moreover, and an illegitimate pretender.",
            "verse 68:14": "Because he is a possessor of wealth and children,",
            "verse 68:15": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"",
            "verse 68:16": "We will brand him upon the snout.",
            "verse 68:17": "Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning",
            "verse 68:18": "Without making exception.",
            "verse 68:19": "So there came upon the garden an affliction from your Lord while they were asleep.",
            "verse 68:20": "And it became as though reaped.",
            "verse 68:21": "And they called one another at morning,",
            "verse 68:22": "[Saying], \"Go early to your crop if you would cut the fruit.\"",
            "verse 68:23": "So they set out, while lowering their voices,",
            "verse 68:24": "[Saying], \"There will surely not enter it today upon you [any] poor person.\"",
            "verse 68:25": "And they went early in determination, [assuming themselves] able.",
            "verse 68:26": "But when they saw it, they said, \"Indeed, we are lost;",
            "verse 68:27": "Rather, we have been deprived.\"",
            "verse 68:28": "The most moderate of them said, \"Did I not say to you, 'Why do you not exalt [Allah]?' \"",
            "verse 68:29": "They said, \"Exalted is our Lord! Indeed, we were wrongdoers.\"",
            "verse 68:30": "Then they approached one another, blaming each other.",
            "verse 68:31": "They said, \"O woe to us; indeed we were transgressors.",
            "verse 68:32": "Perhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous.\"",
            "verse 68:33": "Such is the punishment [of this world]. And the punishment of the Hereafter is greater, if they only knew.",
            "verse 68:34": "Indeed, for the righteous with their Lord are the Gardens of Pleasure.",
            "verse 68:35": "Then will We treat the Muslims like the criminals?",
            "verse 68:36": "What is [the matter] with you? How do you judge?",
            "verse 68:37": "Or do you have a scripture in which you learn",
            "verse 68:38": "That indeed for you is whatever you choose?",
            "verse 68:39": "Or do you have oaths [binding] upon Us, extending until the Day of Resurrection, that indeed for you is whatever you judge?",
            "verse 68:40": "Ask them which of them, for that [claim], is responsible.",
            "verse 68:41": "Or do they have partners? Then let them bring their partners, if they should be truthful.",
            "verse 68:42": "The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able,",
            "verse 68:43": "Their eyes humbled, humiliation will cover them. And they used to be invited to prostration while they were sound.",
            "verse 68:44": "So leave Me, [O Muhammad], with [the matter of] whoever denies the Qur'an. We will progressively lead them [to punishment] from where they do not know.",
            "verse 68:45": "And I will give them time. Indeed, My plan is firm.",
            "verse 68:46": "Or do you ask of them a payment, so they are by debt burdened down?",
            "verse 68:47": "Or have they [knowledge of] the unseen, so they write [it] down?",
            "verse 68:48": "Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed.",
            "verse 68:49": "If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.",
            "verse 68:50": "And his Lord chose him and made him of the righteous.",
            "verse 68:51": "And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, \"Indeed, he is mad.\"",
            "verse 68:52": "But it is not except a reminder to the worlds."
        },
        "Filipino": {
            "verse 68:1": "Nun (titik Na). Sa pamamagitan ng Panulat at sa isinulat (ng mga anghel) sa (Talaan ng mga tao)",
            "verse 68:2": "Ikaw nga (o Muhammad), sa pamamagitan ng biyaya ng iyong Panginoon ay hindi isang baliw",
            "verse 68:3": "Katotohanan na sasaiyo (O Muhammad), ang gantimpala na walang maliw",
            "verse 68:4": "At katotohanang ikaw (o Muhammad) aynag-aangkinngkapuri-puringasalatmataas na pamantayan ng pag-uugali",
            "verse 68:5": "Hindi maglalaon na iyong mapagmamasdan at kanilang mapagmamasdan",
            "verse 68:6": "Kung sino sa inyo ang inaalihan ng pagkabaliw",
            "verse 68:7": "Katotohanan, ang iyong Panginoon ang lubos na nakakaalam kung sino (sa karamihan ng mga tao) ang napaligaw sa Tamang Landas at lubos Niyang talastas kung sino sa inyo ang sumusunod sa Tamang Patnubay",
            "verse 68:8": "Kaya’t huwag mong sundin (O Muhammad) ang mga nagtatatwa (sa Kaisahan ni Allah at nagpapabulaan sa Kanyang mga Talata, sa Kanyang Tagapagbalitang si Muhammad, atbp)",
            "verse 68:9": "Ang kanilang hangarin ay pumayag ka na makipagkasundo sa kanila (sa pananampalataya mula sa iyong kagandahang loob), kaya’t sila (rin) ay makikipagkasundo sa iyo",
            "verse 68:10": "At huwag mong dinggin ang mga tao na nanunumpa ng lubhang marami (sa kasinungalingan), at maipapalagay na walang halaga",
            "verse 68:11": "Na mapangwasak (sa katotohanan) at nagkakalat ng paninirang-puri",
            "verse 68:12": "Na pumipigil sa mga kabutihan at lumalabag (sa utos) sa pagiging palalo, at nababalot ng mga kasalanan",
            "verse 68:13": "Marahas (at malupit), at sa lahat ng mga ito, ay may alinlangan sa pagkapanganak (anak sa labas)",
            "verse 68:14": "(Gayon siya), sapagkat siya ay nagtataglay ng mga kayamanan at maraming anak",
            "verse 68:15": "Na kung ang Aming mga Talata (ng Qur’an) ay ipinaparinig sa kanya, siya ay nagsasabi : “Mga kathang kuwento lamang ng mga tao ng panahong sinauna (lumipas)!”",
            "verse 68:16": "Tatatakan Namin ang kanyang ilong",
            "verse 68:17": "Katotohanang Aming sinubukan sila na katulad rin ng ginawa Naming pagsubok sa mga Tao ng Halamanan, nang sila ay magkaisa na kanilang pipitasin ang mga bunga (ng Halamanan) sa kinaumagahan",
            "verse 68:18": "At sila ay hindi nag- aatubili (kung ito ang Kalooban ni Allah)",
            "verse 68:19": "At dumating (sa halamanan) ang isang pagdalaw ng inyong Panginoon (na may taglay na bagay, ang Apoy) nang kinagabihan at sumunog sa lahat ng palibot habang sila ay natutulog",
            "verse 68:20": "Kaya’t sa kinaumagahan, ang halamanan ay natulad sa nasalantang lugar at maitim, (na ang kanyang bunga ay natipon na)",
            "verse 68:21": "At nang lumiwanag na (ang umaga), sila ay nagtawagan sa isa’t isa",
            "verse 68:22": "Na nagsasabi: “Kayo ay magsiparoon sa inyong bukirin kung nais ninyong anihin ang mga bunga.”",
            "verse 68:23": "Kaya’t sila ay nagsilakad na nagsasalitaan ng lihim sa isa’t-isa sa mahinang tinig (na nagsasabi)",
            "verse 68:24": "Huwag hayaan ang sinumang mahirap na tao na makapasok sa (halamanan) sa araw na ito",
            "verse 68:25": "At sinimulan nila ang umaga na may matibay na hangarin, na nag-aakala na sila ay may kapangyarihan (na hadlangan ang mahirap sa pagkuha ng anuman sa mga bunga nito)",
            "verse 68:26": "Ngunit nang kanilang mamasdan (ang halamanan), sila ay nagsipagsabi: “Katotohanang tayo ay napaligaw sa ating patutunguhan!”",
            "verse 68:27": "(At sila ay nagsabi): “Tunay ngang tayo ay pinagkaitan sa mga bunga (ng ating paghihirap)!”",
            "verse 68:28": "Ang pinakamagaling (makatarungan) sa kanila ay nagsabi: “Hindi ba aking tinuran sa inyo: Bakit hindi ninyo luwalhatiin si Allah?”",
            "verse 68:29": "At sila ay nagbadya: “Luwalhatiin ang ating Panginoon! Katotohanang kami ay naging Zalimun (mga mapaggawa ng kamalian, buktot, tampalasan)!”",
            "verse 68:30": "At sila ay bumaling sa isa’t-isa na nagsasalita ng panunumbat",
            "verse 68:31": "Na nagsasabi: “Kasawian sa atin! Tunay ngang tayo ay mga Taghub (mapaglabag sa kautusan at palasuway, atbp)",
            "verse 68:32": "Tayo ay umasam na mangyaring pahintulutan ng ating Panginoon na tayo ay pagkalooban Niya ng higit na mainam (na halamanan) kaysa rito. Katotohanang kami ay nagbalik- loob sa aming Panginoon (na naghahangad ng mabuti na Siya ay magpapatawad sa aming kasalanan at magbibigay ng gantimpala sa Kabilang Buhay).”",
            "verse 68:33": "At ito ang kaparusahan (sa buhay na ito), datapuwa’t katotohanang higit na matindi ang kaparusahan sa Kabilang Buhay, kung kanila lamang nababatid",
            "verse 68:34": "Katotohanang sa Muttaqun (mga matutuwid at matimtimang tao na may pagkatakot kay Allah at umiiwas sa lahat ng masama at kasalanan na Kanyang ipinagbawal, at nagmamahal sa Kanya ng labis), ay sasakanila ang Hardin ng Kaligayahan (Paraiso) sa harapan ng kanilang Panginoon",
            "verse 68:35": "Ituturing ba Namin na magkatulad ang mga sumasampalataya (mga Muslim) sa mga makasalanan (mapagsamba sa diyus-diyosan, walang pananalig sa Kaisahan ni Allah, atbp)",
            "verse 68:36": "Ano ang nagpapagulo (suliranin) sa inyo? Paano kayo humahatol",
            "verse 68:37": "At mayroon baga kayong Kasulatan na sa pamamagitan nito, kayo ay may mapag-aaralan",
            "verse 68:38": "Na sa pamamagitan nito ay mapapasainyo ang anumang inyong piliin",
            "verse 68:39": "o mayroon ba kayong Kasunduan sa Amin na (inyong) sinumpaan, na makakaabot sa Araw ng Paghuhukom (at magkakaloob) na inyong matatamasa ang anumang inyong hilingin",
            "verse 68:40": "Iyong tanungin sila (o Muhammad) kung alin sa kanila ang makakapanagot dito",
            "verse 68:41": "o mayroon ba silang mga katambal (sa Diyos)? Hayaang dalhin nila ang kanilang mga katambal (sa diyos), kung sila ay nagsasabi ng katotohanan",
            "verse 68:42": "(Alalahanin) ang Araw na ang lulod (alalaong baga, ang pagiging huwad) ay matatambad, at sila ay pag-uutusan na magpatirapa (kay Allah), datapuwa’t (sila na mapagkunwari) ay hindi makakagawa nito",
            "verse 68:43": "Ang kanilang mga mata ay nakatuon sa lupa, at ang pagkaaba ay bumabalot sa kanila, sapagkat napagtanto nila (na sa buhay sa mundong ito), sila ay pinag-utusan na magpatirapa (sa pag-aalay ng panalangin), habang sila ay buo pa (malusog at mainam) at hindi nasasaktan (subalit sila ay hindi sumunod)",
            "verse 68:44": "Kaya’t Ako ay hayaan ninyo na humarap sa kanila na nagpasinungaling sa Kapahayagang ito (ang Qur’an). Sila ay Aming parurusahan ng dahan-dahan sa lahat ng paraan na hindi nila napag-uunawa",
            "verse 68:45": "Ang mahabang pagkakataon (at palugit) ay Aking ipagkakaloob sa kanila. Katotohanan, ang Aking balak ay makapangyarihan",
            "verse 68:46": "o ikaw ba (o Muhammad) ay humingi ng ganting biyaya sa kanila, kaya’t sila ay nasadlak sa mabigat na pagkakautang",
            "verse 68:47": "o nasa kanila bang mga kamay ang susi ng Al-Ghaib (mga nalilingid na bagay), upang ito ay kanilang maisulat",
            "verse 68:48": "Kaya’t maghintay ng may pagtitiyaga sa Pasya ng iyong Panginoon, at huwag matulad sa Kasamahan ng Isda, nang siya ay manikluhod (sa Amin) samantalang siya ay nasa matinding kapighatian. (Tunghayan ang Qur’an)",
            "verse 68:49": "Kung nangyaring ang Biyaya ng kanyang Panginoon ay hindi sumapit sa kanya, katotohanang siya (ay naiwan sa tiyan ng Isda, datapuwa’t Aming pinatawad siya), kaya’t siya ay itinapon sa hantad na dalampasigan habang siya ang dapat sisihin",
            "verse 68:50": "Datapuwa’t pinili siya ng kanyang Panginoon at inihanay siya sa lipon ng mga matutuwid",
            "verse 68:51": "At katotohanan, ang mga hindi sumasampalataya ay halos palagpasin ka ( o mabilis na makaraan) sa pamamagitan ng kanilang namumuhing mga mata kung kanilang napapakinggan ang Paala-ala (ang Babala, ang Qur’an) at sila ay nagsasabi: “Katotohanang siya (Muhammad) ay isang baliw!”",
            "verse 68:52": "Datapuwa’t ito ay wala ng iba, maliban na isang Paala-ala sa lahat ng mga nilalang"
        },
        "French": {
            "verse 68:1": "Nûn. Par la plume et ce qu'ils écrivent!",
            "verse 68:2": "Tu (Muhammad) n'es pas, par la grâce de ton Seigneur, un possédé.",
            "verse 68:3": "Et il y aura pour toi certes, une récompense jamais interrompue.",
            "verse 68:4": "Et tu es certes, d'une moralité éminente.",
            "verse 68:5": "Tu verras et ils verront",
            "verse 68:6": "qui d'entre vous a perdu la raison.",
            "verse 68:7": "C'est ton Seigneur qui connaît mieux ceux qui s'égarent de Son chemin, et Il connaît mieux ceux qui suivent la bonne voie.",
            "verse 68:8": "N'obéis pas à ceux qui crient au mensonge,",
            "verse 68:9": "Ils aimeraient bien que tu transiges avec eux afin qu'ils transigent avec toi.",
            "verse 68:10": "Et n'obéis à aucun grand jureur, méprisable,",
            "verse 68:11": "grand diffamateur, grand colporteur de médisance,",
            "verse 68:12": "grand empêcheur du bien, transgresseur, grand pécheur,",
            "verse 68:13": "au cœur dur, et en plus de cela bâtard.",
            "verse 68:14": "Même s'il est doté de richesses et (de nombreux) enfants.",
            "verse 68:15": "Quand Nos versets lui sont récités, il dit: «Des contes d'anciens».",
            "verse 68:16": "Nous le marquerons sur le museau [nez].",
            "verse 68:17": "Nous les avons éprouvés comme Nous avons éprouvé les propriétaires du verger qui avaient juré d'en faire la récolte au matin,",
            "verse 68:18": "sans dire: «Si Allah le veut».",
            "verse 68:19": "Une calamité de la part de ton Seigneur tomba dessus pendant qu'ils dormaient,",
            "verse 68:20": "et le matin, ce fut comme si tout avait été rasé.",
            "verse 68:21": "Le [lendemain] matin, ils s'appelèrent les uns les autres:",
            "verse 68:22": "«Partez tôt à votre champ si vous voulez le récolter».",
            "verse 68:23": "Ils allèrent donc, tout en parlant entre eux à voix basse:",
            "verse 68:24": "«Ne laissez aucun pauvre y entrer aujourd'hui».",
            "verse 68:25": "Ils partirent de bonne heure décidés à user d'avarice [envers les pauvres], convaincus que cela était en leur pouvoir.",
            "verse 68:26": "Puis, quand ils le virent [le jardin], ils dirent: «vraiment, nous avons perdu notre chemin.",
            "verse 68:27": "Ou plutôt nous sommes frustrés».",
            "verse 68:28": "Le plus juste d'entre eux dit: «Ne vous avais-je pas dit: Si seulement vous avez rendu gloire à Allah!»",
            "verse 68:29": "Ils dirent: «Gloire à notre Seigneur! Oui, nous avons été des injustes».",
            "verse 68:30": "Puis ils s'adressèrent les uns aux autres, se faisant des reproches.",
            "verse 68:31": "Ils dirent: «Malheur à nous! Nous avons été des rebelles.",
            "verse 68:32": "Nous souhaitons que notre Seigneur nous le remplace par quelque chose de meilleur. Nous désirons nous rapprocher de notre Seigneur».",
            "verse 68:33": "Tel fut le châtiment; et le châtiment de l'au-delà est plus grand encore, si seulement ils savaient!",
            "verse 68:34": "Les pieux auront auprès de leur Seigneur les Jardins du délice.",
            "verse 68:35": "Traiterons-Nous les soumis [à Allah] à la manière des criminels?",
            "verse 68:36": "Qu'avez-vous? Comment jugez-vous?",
            "verse 68:37": "Ou bien avez-vous un Livre dans lequel vous apprenez",
            "verse 68:38": "qu'en vérité vous obtiendrez tout ce que vous désirez?",
            "verse 68:39": "Ou bien est-ce que vous avez obtenu de Nous des serments valables jusqu'au Jour de la Résurrection, Nous engageant à vous donner ce que vous décidez?",
            "verse 68:40": "Demande-leur qui d'entre eux en est garant?",
            "verse 68:41": "Ou encore, est-ce qu'ils ont des associés? Eh bien, qu'ils fassent venir leurs associés s'ils sont véridiques!",
            "verse 68:42": "Le jour où ils affronteront les horreurs [du Jugement] et où ils seront appelés à la Prosternation mais ils ne le pourront pas.",
            "verse 68:43": "Leurs regards seront abaissés, et l'avilissement les couvrira. Or, ils étaient appelés à la Prosternation au temps où ils étaient sains et saufs!...",
            "verse 68:44": "Laisse-Moi donc avec quiconque traite de mensonge ce discours; Nous allons les mener graduellement par où ils ne savent pas!",
            "verse 68:45": "Et Je leur accorde un délai, car Mon stratagème est sûr!",
            "verse 68:46": "Ou bien est-ce que tu leur demandes un salaire, les accablant ainsi d'une lourde dette?",
            "verse 68:47": "Ou savent-ils l'Inconnaissable et c'est de là qu'ils écrivent [leurs mensonges]?",
            "verse 68:48": "Endure avec patience la sentence de ton Seigneur, et ne sois pas comme l'homme au Poisson [Jonas] qui appela (Allah) dans sa grande angoisse.",
            "verse 68:49": "Si un bienfait de son Seigneur ne l'avait pas atteint, il aurait été rejeté honni sur une terre déserte,",
            "verse 68:50": "Puis son Seigneur l'élut et le désigna au nombre des gens de bien.",
            "verse 68:51": "Peu s'en faut que ceux qui mécroient ne te transpercent par leurs regards, quand ils entendent le Coran, ils disent: «Il est certes fou!»",
            "verse 68:52": "Et ce n'est qu'un Rappel, adressé aux mondes!"
        },
        "Fulah": {
            "verse 68:1": "Nuun. Mi woondirii karambol e ko ɓe winndirta kon",
            "verse 68:2": "Aan a wonaa, sabu neema Joomi maa on, haangaaɗo",
            "verse 68:3": "Ko pellet, hino woodan-maa njoɓdi ndi taƴondirtaa",
            "verse 68:4": "E ko pellet, hiɗa e jikku mawngu",
            "verse 68:5": "Aray nde tinaa, ɓe yi`a kamɓe kadi",
            "verse 68:6": "ko hommbo e mo’on woni haangaaɗo on",
            "verse 68:7": "Pellet, ko Joomi maa ɓuri anndude majjuɗo on laawol Makko ngol, ko Kanko kadi ɓuri anndude feewuɓe ɓen",
            "verse 68:8": "Wata a tewto fennooɓe ɓen",
            "verse 68:9": "Hiɓe yiɗi si a newantono (ɓe), ɓe newano-(maa)",
            "verse 68:10": "Wata a tewto kadi kala ɗuuɗuɗo woondugol, hoyɗo",
            "verse 68:11": "ɗuuɗuɗo nyo*ugol, ɗuuɗuɗo yaarugol baddi",
            "verse 68:12": "ɗuuɗuɗo haɗugol moƴƴere, jaggitoowo, bakkondinɗo",
            "verse 68:13": "yoora-ɓerndeejo e hoore ɗum, heɓiraaɗo nii",
            "verse 68:14": "fii o wonii jom jawdi e ɓiɗɓe",
            "verse 68:15": "Si Aayeeje Amen ɗen janngaama e [tawnde] makko, o wi`a: \"Ko tinndi adinooɓe",
            "verse 68:16": "Aray nde Men maandina mo e hoore kinal",
            "verse 68:17": "Men jarribor ɓe wano Men jarribornoo jeyɓe ngesa mba : fewndo ɓen woondunoo pellet, ɓe soñay mba subaka ko ɓe dawuɓe",
            "verse 68:18": "ɓe ittintinaali [wiide] :\"Si Allah jaɓii",
            "verse 68:19": "Yiite immori ka Joomi maa ari huuɓiti mba tawi hiɓe ɗaanii",
            "verse 68:20": "mba wa’iti wa jemma ɓaleejo",
            "verse 68:21": "Ɓe noddindiri bimmbi on",
            "verse 68:22": "Kori dawee ka ngesa mon, si tawii ko on soñooɓe",
            "verse 68:23": "Ɓe hucciti hiɓe ɓɗuumbo",
            "verse 68:24": "Wonnde \"Miskiino woo naatataa e mabba hannde",
            "verse 68:25": "Ɓe ndawidi e ɗawugol [waasuɓe ɓen] ko ɓe eɓɓuɓe",
            "verse 68:26": "Nde ɓe yi’unoo mba, ɓe wi`i: \"Pellet, men majjii [laawol ngol]",
            "verse 68:27": "wurin ko men ɗawaaɓe",
            "verse 68:28": "Ɓurɗo ɓe moƴƴude on wi`i: \"Mi wi`anaano on : haanii ko subbunhinoɗon",
            "verse 68:29": "Ɓe wi`i: \"Senaade woodanii Joomi amen ! Pellet, hari ko men tooñuɓe",
            "verse 68:30": "Woɗɓe e maɓɓe fewtiti ɓeya, hiɓe felindira",
            "verse 68:31": "Ɓe wi`i: \"Ee bone amen ! Pellet, hari ko men bewuɓe",
            "verse 68:32": "Hino gasa ka Joomi amen wattitana men ɓuri mban ɗon moƴƴude. Ko ka Joomi amen ko min reerɗube e [yaafeede]",
            "verse 68:33": "Ko non tigi woni lette ɗen; ko lette laakara ɗen non ɓuri manude, sinno hiɓe anndunoo",
            "verse 68:34": "Pellet, hino woodani gomɗuɓe ɓen ka Joomi maɓɓe, Aljannaaji neema",
            "verse 68:35": "Kere Men waɗay jebbiliiɓe ɓen wano bomɓe ɓen",
            "verse 68:36": "Ko heɓi on, si ɗon ñaawira non",
            "verse 68:37": "Kaa hiɗon mari Deftere, nde janngoton e mun",
            "verse 68:38": "Pellet, ko woodani on e mayre, ko ko suɓotoɗon",
            "verse 68:39": "Kaa ko fodooje woodani on e Amen, hoolniiɗe haa Ñalnde Darngal, wonnde pellet, hino woodani on ko ñaawoton kon",
            "verse 68:40": "Lamndii ɓe ko hommbo e maɓɓe fawtaniiɓe ɗum",
            "verse 68:41": "Kaa ko kafidiiɓe woodani ɓe? Awa yo ɓe addu kafidiiɓe maɓɓe ɓen, si tawii ko ɓe goonguɓe",
            "verse 68:42": "Ñalnde belenru ñoroytee, ɓe noddee e sujjugol kono hara ɓe waawataa. @Corrected",
            "verse 68:43": "Hara gite maɓɓe ɗen no heli, koyeera no suddi ɓe. Ko tawde ɓe noddeteno e sujjugol fewndo ka ɓe waawunoo",
            "verse 68:44": "Accidam e kala fennuɗo ndee yewtere; aray nde Men suynira ɓe nokku ka ɓe anndaa",
            "verse 68:45": "Miɗo nennan ɓe. Pellet non, pewje Am ɗen ko tiiɗuɗe",
            "verse 68:46": "Kaa a lamndi ɓe njoɓdi, hara ko yoɓugol ndi teddani ɓe",
            "verse 68:47": "Kaa ɓe anndu fii wirniiɗi ɗin, hara hiɓe winndira [ɗim hujjaaji maɓɓe]",
            "verse 68:48": "Muññor ñaawoore Joomi maa nden, hara a wa’aali wa wonndiiɗo linngii ngii fewndo o noddunoo [Joomi makko] himo sunii",
            "verse 68:49": "Si tawno moƴƴere immorde e Joomi makko hewtitanooki mo, ko pellet, o bugeteno e wulaa hara ko o felniiɗo",
            "verse 68:50": "Joomi makko suɓii mo, O waɗi mo e moƴƴuɓe ɓen",
            "verse 68:51": "Hay yedduɓe ɓen eɓɓiinoo yuwirgol ma gite maɓɓe ɗen, nde ɓe nanunoo Janntoore nden, hiɓe wi`a: \"On ko haangaaɗo",
            "verse 68:52": "Ndee [Alqur’aanaare] wonaali, si wanaa waaju tageefo ngon"
        },
        "German": {
            "verse 68:1": "Nun. Beim Schreibrohr und dem, was sie in Zeilen niederschreiben.",
            "verse 68:2": "Du bist durch die Gunst deines Herrn kein Besessener.",
            "verse 68:3": "Es wird für dich wahrlich Lohn geben, der nicht aufhört.",
            "verse 68:4": "Und du bist wahrlich von großartiger Wesensart.",
            "verse 68:5": "Du wirst sehen, und (auch) sie werden sehen,",
            "verse 68:6": "wer von euch (durch Besessenheit) der Versuchung ausgesetzt ist.",
            "verse 68:7": "Gewiß, dein Herr weiß sehr wohl, wer von Seinem Weg abirrt, und Er kennt sehr wohl die Rechtgeleiteten.",
            "verse 68:8": "So gehorche nicht den Leugnern (der Botschaft).",
            "verse 68:9": "Sie möchten gern, daß du schmeichelst, so daß (auch) sie schmeicheln (können).",
            "verse 68:10": "Und gehorche keinem verächtlichen Schwörer,",
            "verse 68:11": "Stichler und Verbreiter von Verleumdungen,",
            "verse 68:12": "Verweigerer des Guten, der Übertretungen begeht und ein Sünder ist,",
            "verse 68:13": "einem von grobem Benehmen und darüber hinaus einem Eindringling",
            "verse 68:14": "(nur deshalb), weil er Besitz und Söhne hat.",
            "verse 68:15": "Wenn ihm Unsere Zeichen verlesen werden, sagt er: \"(Es sind) Fabeln der Früheren.\"",
            "verse 68:16": "Wir werden ihn mit einem Merkmal auf der Nase zeichnen.",
            "verse 68:17": "Wir haben sie geprüft, wie Wir die Besitzer des Gartens prüften, als sie schworen, sie würden ihn bei Tagesanbruch abpflücken,",
            "verse 68:18": "und nicht(s) ausnahmen'.",
            "verse 68:19": "Da ging darin Verheerendes von deinem Herrn umher, während sie schliefen,",
            "verse 68:20": "und er war dann am Morgen wie abgepflückt.",
            "verse 68:21": "Da riefen sie bei Tagesanbruch einander zu:",
            "verse 68:22": "\"Geht in der Morgenfrühe zu eurer Pflanzung, wenn ihr pflücken wollt.\"",
            "verse 68:23": "Da zogen sie los und flüsterten dabei einander zu:",
            "verse 68:24": "\"In ihn soll heute ja kein Armer zu euch hineingelangen.\"",
            "verse 68:25": "Und sie gingen hin in der Morgenfrühe, zum Verwehren bereit.",
            "verse 68:26": "Als sie ihn aber sahen, sagten sie: \"Wir haben uns fürwahr geirrt.",
            "verse 68:27": "Nein! Vielmehr entbehren wir alles.\"",
            "verse 68:28": "Der Mittlere von ihnen sagte: \"Habe ich nicht zu euch gesagt: Würdet ihr doch Allah preisen!\"",
            "verse 68:29": "Sie sagten: \"Preis sei unserem Herrn! Wir waren gewiß ungerecht.\"",
            "verse 68:30": "Da wandten sie sich einander zu, sich gegenseitig tadelnd.",
            "verse 68:31": "Sie sagten: \"O wehe uns! Wir pflegten ja das Maß (an Frevel) zu überschreiten.",
            "verse 68:32": "Vielleicht wird unser Herr uns zum Tausch dafür einen besseren (Garten) als ihn geben! Gewiß, nach Allah steht unser Begehren.\"",
            "verse 68:33": "So ist die Strafe; aber die Strafe des Jenseits ist wahrlich größer, wenn sie nur wüßten!",
            "verse 68:34": "Gewiß, für die Gottesfürchtigen wird es bei ihrem Herrn die Gärten der Wonne geben.",
            "verse 68:35": "Sollen Wir etwa die Gottergebenen den Übeltätern gleichstellen?",
            "verse 68:36": "Was ist mit euch? Wie urteilt ihr?",
            "verse 68:37": "Oder habt ihr eine Schrift, in der ihr lernt (und sucht);",
            "verse 68:38": "ihr sollt darin wahrlich das haben, was ihr euch auswählt.",
            "verse 68:39": "Oder habt ihr von Uns verbindliche Eide, die bis zum Tag der Auferstehung reichen; ihr bekommt wahrlich das, was ihr urteilt.",
            "verse 68:40": "Frage sie, wer von ihnen dafür Bürge ist.",
            "verse 68:41": "Oder haben sie (etwa) Teilhaber? So sollen sie doch ihre Teilhaber beibringen, wenn sie wahrhaftig sind.",
            "verse 68:42": "Am Tag, da (manch) ein Schenkel entblößt wird und sie aufgerufen werden, sich (anbetend) niederzuwerfen, aber da werden sie es nicht können,",
            "verse 68:43": "während ihre Blicke demütig sind und Erniedrigung sie bedeckt. Dabei waren sie doch bereits aufgefordert worden, sich (anbetend) niederzuwerfen, als sie (noch) heil waren.",
            "verse 68:44": "Lasse Mich (allein) mit denjenigen, die diese Aussage für Lüge erklären; Wir werden sie stufenweise (dem Verderben) näherbringen, von wo sie nicht wissen.",
            "verse 68:45": "Und Ich gewähre ihnen Aufschub. (Aber) gewiß, Meine List ist fest.",
            "verse 68:46": "Oder verlangst du (etwa) von ihnen einen Lohn, so daß sie mit Schulden belastet wären?",
            "verse 68:47": "Oder besitzen sie (das Wissen über) das Verborgene, so daß sie (es) aufschreiben (können)?",
            "verse 68:48": "So sei standhaft in Bezug auf das Urteil deines Herrn'. Und sei nicht wie der Gefährte des (großen) Fisches, als er voller Gram (zu Allah) rief.",
            "verse 68:49": "Wenn ihn nicht eine Gunst von seinem Herrn rechtzeitig erreicht hätte, wäre er wahrlich auf das kahle Land geworfen worden und hätte sich dabei Vorwürfe zugezogen.",
            "verse 68:50": "Da erwählte ihn sein Herr und machte ihn zu einem der Rechtschaffenen.",
            "verse 68:51": "Diejenigen, die ungläubig sind, würden dich, wenn sie die Ermahnung hören, mit ihren Blicken wahrlich beinahe ins Straucheln bringen. Und sie sagen: \"Er ist ja fürwahr besessen.\"",
            "verse 68:52": "Doch es ist nur eine Ermahnung für die Weltenbewohner."
        },
        "Hausa": {
            "verse 68:1": "Ñ. Na rantse da alƙalami da abin da (marubũta) suke rubũtãwa.",
            "verse 68:2": "Kai, sabõda ni'imar Ubangijinka, bã mahaukaci kake ba.",
            "verse 68:3": "Kuma, lalle, haƙĩƙa kanã da lãdar da bã ta yankewa.",
            "verse 68:4": "Kuma, lalle haƙiƙa kana a kan hãlãyen kirki, manya.",
            "verse 68:5": "Don haka, zã ka gani, sũ kuma zã su gani.",
            "verse 68:6": "Ga wanenku haukã take.",
            "verse 68:7": "Lalle Ubangijinka Shi ne Mafi sani ga wanda ya ɓace daga tafarkinSa. Kuma Shi ne Mafi sani ga mãsu shiryuwa.",
            "verse 68:8": "Saboda haka kada ka bi mãsu ƙaryatãwa.",
            "verse 68:9": "Sunã fatar ka sassauta, su kuma sũ sassauta.",
            "verse 68:10": "Kada ka bi dukkan mai yawan rantsuwa, walãkantacce.",
            "verse 68:11": "Mai zunɗe, mai yãwo da gulma.",
            "verse 68:12": "Mai hana alhẽri mai zãlunci, mai zunubi.",
            "verse 68:13": "Mai girman kai, bãyan haka kuma la'ĩmi (bã ya son alhẽri).",
            "verse 68:14": "Sabõda yã kasance mai dũkiya da ɗiya.",
            "verse 68:15": "Idan ana karanta masa ãyõyinMu, sai ya ce: \"Tatsũniyõyin mutãnen farko ne.\"",
            "verse 68:16": "Zã Mu yi masa alãma a kan hanci.",
            "verse 68:17": "Lalle Mun jarrabe su kamar yadda Muka jarrabi mãsu gonar lambu, a lokacin da suka yi rantsuwa, wai lalle zã su girbe amfãninta, suna mãsu asubanci.",
            "verse 68:18": "Kuma (suka yi niyya), bã su kõ tõgẽwa.",
            "verse 68:19": "Wani mai kẽwayãwa daga Ubangijinka ya kẽwayã a kanta, (ya ƙone ta,) alhãli sunã barci.",
            "verse 68:20": "Sai ta wãyi gari (baƙa ƙirin) kamar dare.",
            "verse 68:21": "Sai suka kirãyi jũna, sunã mãsu yin asubanci.",
            "verse 68:22": "Cẽwa ku yi sammakõ ga amfãnin gõnarku, idan kun kasance mãsu girbewa.",
            "verse 68:23": "Sai suka tafi sunã shãwara a ɓõye (sunã cẽwa).",
            "verse 68:24": "\"Lalle kada wani miskĩni ya shigar muku ita a yau!\"",
            "verse 68:25": "Kuma suka yi sammako akan (niyyar) rõwa, matuƙar iyãwarsu.",
            "verse 68:26": "Lõkacin da suka gan ta, sai suka ce: \"Lalle, mun saki hanya (mun ɓace)!\"",
            "verse 68:27": "\"Ba haka ba, mũ dai, an hana mu ne.\"",
            "verse 68:28": "Mafificinsu (hankali) ya ce: \"Ban gaya muku ba, yã kamata ku tsarkake Allah?\"",
            "verse 68:29": "Suka ce: \"Tsarki ya tabbata ga Ubangijinmu! Lalle, mu mun kasance azzãlumai.\"",
            "verse 68:30": "Sai suka fuskanci jũna, sunã zargin kansu.",
            "verse 68:31": "Suka ce: \"Kaitonmu! Lalle, mũ ne muka kasance mãsu ƙẽtare iyãka.\"",
            "verse 68:32": "\"Mai yiwuwa ne Ubangijinmu Ya musanya mana da wani abu da yã fi ta. Lalle, mũ (ba mu yanke ƙauna ba) zuwa ga Ubangijinmu, mãsu kwaɗayi ne.\"",
            "verse 68:33": "Haka dai azãbar take, kuma lalle ne azãbar Lãhira ta fi girma, in da sun kasance zã su iya gãnẽwã.",
            "verse 68:34": "Lalle ne mãsu taƙawa nã da a wurin Ubangijinsu, gidãjen Aljanna na ni'ima.",
            "verse 68:35": "Shin ko zã Mu sanya waɗanda ke bi da ɗa'a kamar mãsu laifi?",
            "verse 68:36": "Me ya sãme ku, yãya kuke yin hukunci (da haka)?",
            "verse 68:37": "Ko kuna da wani littafi, wanda a cikinsa, kuke karantãwa?",
            "verse 68:38": "Cẽwã kunã da, a cikinsa lalle (duk) abin da rãyukanku suka zãɓa?",
            "verse 68:39": "Kõ kunã (riƙe) da wasu rantsuwõyin alkawari a kanMu, har ya zuwa Rãnar ¡iyãma, cẽwa lalle ne kunã da abin da kuke hukuntã wa kanku?",
            "verse 68:40": "Ka tambaye su, wãne, a cikinsu, ke lãmuncewã ga sãmun wannan (hukuncin)?",
            "verse 68:41": "Kõ sunã da abõkan tãrẽwa (ga wannan ra'ayi)? To, sai su kãwo abõkan tãrayyarsu, idan sun kasance mãsu gaskiya.",
            "verse 68:42": "Ranar da zã a kuranye ƙwabri, kuma a kira su zuwa ga yin sujũda, sai bã zã su iyãwa ba.",
            "verse 68:43": "Su fito da idãnu ƙasƙantattu, wulãkanci yana rufe su. Lalle ne a dã sun kasance anã kiran su zuwa, yin sujũdar, alhãli kuwa sunã lãfiya lau, (suka ƙi yi).",
            "verse 68:44": "Sabõda haka ka bar Ni da mai ƙaryata wanna lãbãri (Alƙur'ãni). Zã Mu yi musu istidrãji daga inda ba su sani ba.",
            "verse 68:45": "Ina jinkirtã musu, lalle kaidiNa mai ƙarfi ne.",
            "verse 68:46": "Kõ kana tambayar su wata la'ada ne, sabõda haka sũ, daga wannan tãrar, suke jin an nauyaya musu?",
            "verse 68:47": "Ko kuma sunã da ilmin gaibu ne, wãto sunã yin rubũtun (abin da suke faɗã daga gare shi) ne?",
            "verse 68:48": "Sabõda haka, ka yi haƙuri da hukuncin Ubangijinka, kada ka zama kamar Ma'abũcin kĩfi, alõkacin da ya yi kira, alhãli yana cike da hushi.",
            "verse 68:49": "Ba dõmin ni'ima daga wajen Ubangijinsa tã riske shi ba, lalle ne da an jẽfa shi a cikin wõfintacciyar ƙasa, alhãli yanã abin zargi.",
            "verse 68:50": "Sai Ubangijinsa Ya zãɓe shi, sa'an nan Ya sanya shi a cikin mutãnen kirki.",
            "verse 68:51": "Kuma lalle, ne waɗanda suka kãfirta sunã yin kamar su kãyar da kai sabõ da kallonsu (kallon mãmãki), a lokacin da suke jin karãtun Alƙur'ãni, kuma sunã cẽwa, \"Lalle ne shi mahaukaci ne!\"",
            "verse 68:52": "Shi (Alƙur'ãni) bai kasance ba, fãce abin tunãtarwa ne ga duka dũniya."
        },
        "Hindi": {
            "verse 68:1": "नून क़लम की और उस चीज़ की जो लिखती हैं (उसकी) क़सम है",
            "verse 68:2": "कि तुम अपने परवरदिगार के फ़ज़ल (व करम) से दीवाने नहीं हो",
            "verse 68:3": "और तुम्हारे वास्ते यक़ीनन वह अज्र है जो कभी ख़त्म ही न होगा",
            "verse 68:4": "और बेशक तुम्हारे एख़लाक़ बड़े आला दर्जे के हैं",
            "verse 68:5": "तो अनक़रीब ही तुम भी देखोगे और ये कुफ्फ़ार भी देख लेंगे",
            "verse 68:6": "कि तुममें दीवाना कौन है",
            "verse 68:7": "बेशक तुम्हारा परवरदिगार इनसे ख़ूब वाक़िफ़ है जो उसकी राह से भटके हुए हैं और वही हिदायत याफ्ता लोगों को भी ख़ूब जानता है",
            "verse 68:8": "तो तुम झुठलाने वालों का कहना न मानना",
            "verse 68:9": "वह लोग ये चाहते हैं कि अगर तुम नरमी एख्तेयार करो तो वह भी नरम हो जाएँ",
            "verse 68:10": "और तुम (कहीं) ऐसे के कहने में न आना जो बहुत क़समें खाता ज़लील औक़ात ऐबजू",
            "verse 68:11": "जो आला दर्जे का चुग़लख़ोर माल का बहुत बख़ील",
            "verse 68:12": "हद से बढ़ने वाला गुनेहगार तुन्द मिजाज़",
            "verse 68:13": "और उसके अलावा बदज़ात (हरमज़ादा) भी है",
            "verse 68:14": "चूँकि माल बहुत से बेटे रखता है",
            "verse 68:15": "जब उसके सामने हमारी आयतें पढ़ी जाती हैं तो बोल उठता है कि ये तो अगलों के अफ़साने हैं",
            "verse 68:16": "हम अनक़रीब इसकी नाक पर दाग़ लगाएँगे",
            "verse 68:17": "जिस तरह हमने एक बाग़ वालों का इम्तेहान लिया था उसी तरह उनका इम्तेहान लिया जब उन्होने क़समें खा खाकर कहा कि सुबह होते हम उसका मेवा ज़रूर तोड़ डालेंगे",
            "verse 68:18": "और इन्शाअल्लाह न कहा",
            "verse 68:19": "तो ये लोग पड़े सो ही रहे थे कि तुम्हारे परवरदिगार की तरफ से (रातों रात) एक बला चक्कर लगा गयी",
            "verse 68:20": "तो वह (सारा बाग़ जलकर) ऐसा हो गया जैसे बहुत काली रात",
            "verse 68:21": "फिर ये लोग नूर के तड़के लगे बाहम गुल मचाने",
            "verse 68:22": "कि अगर तुमको फल तोड़ना है तो अपने बाग़ में सवेरे से चलो",
            "verse 68:23": "ग़रज़ वह लोग चले और आपस में चुपके चुपके कहते जाते थे",
            "verse 68:24": "कि आज यहाँ तुम्हारे पास कोई फ़क़ीर न आने पाए",
            "verse 68:25": "तो वह लोग रोक थाम के एहतमाम के साथ फल तोड़ने की ठाने हुए सवेरे ही जा पहुँचे",
            "verse 68:26": "फिर जब उसे (जला हुआ सियाह) देखा तो कहने लगे हम लोग भटक गए",
            "verse 68:27": "(ये हमारा बाग़ नहीं फिर ये सोचकर बोले) बात ये है कि हम लोग बड़े बदनसीब हैं",
            "verse 68:28": "जो उनमें से मुनसिफ़ मिजाज़ था कहने लगा क्यों मैंने तुमसे नहीं कहा था कि तुम लोग (ख़ुदा की) तसबीह क्यों नहीं करते",
            "verse 68:29": "वह बोले हमारा परवरदिगार पाक है बेशक हमीं ही कुसूरवार हैं",
            "verse 68:30": "फिर लगे एक दूसरे के मुँह दर मुँह मलामत करने",
            "verse 68:31": "(आख़िर) सबने इक़रार किया कि हाए अफसोस बेशक हम ही ख़ुद सरकश थे",
            "verse 68:32": "उम्मीद है कि हमारा परवरदिगार हमें इससे बेहतर बाग़ इनायत फ़रमाए हम अपने परवरदिगार की तरफ रूजू करते हैं",
            "verse 68:33": "(देखो) यूँ अज़ाब होता है और आख़ेरत का अज़ाब तो इससे कहीं बढ़ कर है अगर ये लोग समझते हों",
            "verse 68:34": "बेशक परहेज़गार लोग अपने परवरदिगार के यहाँ ऐशो आराम के बाग़ों में होंगे",
            "verse 68:35": "तो क्या हम फरमाबरदारों को नाफ़रमानो के बराबर कर देंगे",
            "verse 68:36": "(हरगिज़ नहीं) तुम्हें क्या हो गया है तुम तुम कैसा हुक्म लगाते हो",
            "verse 68:37": "या तुम्हारे पास कोई ईमानी किताब है जिसमें तुम पढ़ लेते हो",
            "verse 68:38": "कि जो चीज़ पसन्द करोगे तुम को वहाँ ज़रूर मिलेगी",
            "verse 68:39": "या तुमने हमसे क़समें ले रखी हैं जो रोज़े क़यामत तक चली जाएगी कि जो कुछ तुम हुक्म दोगे वही तुम्हारे लिए ज़रूर हाज़िर होगा",
            "verse 68:40": "उनसे पूछो तो कि उनमें इसका कौन ज़िम्मेदार है",
            "verse 68:41": "या (इस बाब में) उनके और लोग भी शरीक हैं तो अगर ये लोग सच्चे हैं तो अपने शरीकों को सामने लाएँ",
            "verse 68:42": "जिस दिन पिंडली खोल दी जाए और (काफ़िर) लोग सजदे के लिए बुलाए जाएँगे तो (सजदा) न कर सकेंगे",
            "verse 68:43": "उनकी ऑंखें झुकी हुई होंगी रूसवाई उन पर छाई होगी और (दुनिया में) ये लोग सजदे के लिए बुलाए जाते और हटटे कटटे तन्दरूस्त थे",
            "verse 68:44": "तो मुझे उस कलाम के झुठलाने वाले से समझ लेने दो हम उनको आहिस्ता आहिस्ता इस तरह पकड़ लेंगे कि उनको ख़बर भी न होगी",
            "verse 68:45": "और मैं उनको मोहलत दिये जाता हूँ बेशक मेरी तदबीर मज़बूत है",
            "verse 68:46": "(ऐ रसूल) क्या तुम उनसे (तबलीग़े रिसालत का) कुछ सिला माँगते हो कि उन पर तावान का बोझ पड़ रहा है",
            "verse 68:47": "या उनके इस ग़ैब (की ख़बर) है कि ये लोग लिख लिया करते हैं",
            "verse 68:48": "तो तुम अपने परवरदिगार के हुक्म के इन्तेज़ार में सब्र करो और मछली (का निवाला होने) वाले (यूनुस) के ऐसे न हो जाओ कि जब वह ग़ुस्से में भरे हुए थे और अपने परवरदिगार को पुकारा",
            "verse 68:49": "अगर तुम्हारे परवरदिगार की मेहरबानी उनकी यावरी न करती तो चटियल मैदान में डाल दिए जाते और उनका बुरा हाल होता",
            "verse 68:50": "तो उनके परवरदिगार ने उनको बरगुज़ीदा करके नेकोकारों से बना दिया",
            "verse 68:51": "और कुफ्फ़ार जब क़ुरान को सुनते हैं तो मालूम होता है कि ये लोग तुम्हें घूर घूर कर (राह रास्त से) ज़रूर फिसला देंगे",
            "verse 68:52": "और कहते हैं कि ये तो सिड़ी हैं और ये (क़ुरान) तो सारे जहाँन की नसीहत है"
        },
        "Indonesian": {
            "verse 68:1": "Nun, demi kalam dan apa yang mereka tulis,",
            "verse 68:2": "berkat nikmat Tuhanmu kamu (Muhammad) sekali-kali bukan orang gila.",
            "verse 68:3": "Dan sesungguhnya bagi kamu benar-benar pahala yang besar yang tidak putus-putusnya.",
            "verse 68:4": "Dan sesungguhnya kamu benar-benar berbudi pekerti yang agung.",
            "verse 68:5": "Maka kelak kamu akan melihat dan mereka (orang-orang kafir)pun akan melihat,",
            "verse 68:6": "siapa di antara kamu yang gila.",
            "verse 68:7": "Sesungguhnya Tuhanmu, Dialah Yang Paling Mengetahui siapa yang sesat dari jalan-Nya; dan Dialah Yang Paling Mengetahui orang-orang yang mendapat petunjuk.",
            "verse 68:8": "Maka janganlah kamu ikuti orang-orang yang mendustakan (ayat-ayat Allah).",
            "verse 68:9": "Maka mereka menginginkan supaya kamu bersikap lunak lalu mereka bersikap lunak (pula kepadamu).",
            "verse 68:10": "Dan janganlah kamu ikuti setiap orang yang banyak bersumpah lagi hina,",
            "verse 68:11": "yang banyak mencela, yang kian ke mari menghambur fitnah,",
            "verse 68:12": "yang banyak menghalangi perbuatan baik, yang melampaui batas lagi banyak dosa,",
            "verse 68:13": "yang kaku kasar, selain dari itu, yang terkenal kejahatannya,",
            "verse 68:14": "karena dia mempunyai (banyak) harta dan anak.",
            "verse 68:15": "Apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: \"(Ini adalah) dongeng-dongengan orang-orang dahulu kala\".",
            "verse 68:16": "Kelak akan Kami beri tanda dia di belalai(nya).",
            "verse 68:17": "Sesungguhnya Kami telah mencobai mereka (musyrikin Mekah) sebagaimana Kami telah mencobai pemilik-pemilik kebun, ketika mereka bersumpah bahwa mereka sungguh-sungguh akanmemetik (hasil)nya di pagi hari,",
            "verse 68:18": "dan mereka tidak menyisihkan (hak fakir miskin),",
            "verse 68:19": "lalu kebun itu diliputi malapetaka (yang datang) dari Tuhanmu ketika mereka sedang tidur,",
            "verse 68:20": "maka jadilah kebun itu hitam seperti malam yang gelap gulita.",
            "verse 68:21": "lalu mereka panggil memanggil di pagi hari:",
            "verse 68:22": "\"Pergilah diwaktu pagi (ini) ke kebunmu jika kamu hendak memetik buahnya\".",
            "verse 68:23": "Maka pergilah mereka saling berbisik-bisik.",
            "verse 68:24": "\"Pada hari ini janganlah ada seorang miskinpun masuk ke dalam kebunmu\".",
            "verse 68:25": "Dan berangkatlah mereka di pagi hari dengan niat menghalangi (orang-orang miskin) padahal mereka (menolongnya).",
            "verse 68:26": "Tatkala mereka melihat kebun itu, mereka berkata: \"Sesungguhnya kita benar-benar orang-orang yang sesat (jalan),",
            "verse 68:27": "bahkan kita dihalangi (dari memperoleh hasilnya)\".",
            "verse 68:28": "Berkatalah seorang yang paling baik pikirannya di antara mereka: \"Bukankah aku telah mengatakan kepadamu, hendaklah kamu bertasbih (kepada Tuhanmu)?\"",
            "verse 68:29": "Mereka mengucapkan: \"Maha Suci Tuhan kami, sesungguhnya kami adalah orang-orang yang zalim\".",
            "verse 68:30": "Lalu sebahagian mereka menghadapi sebahagian yang lain seraya cela mencela.",
            "verse 68:31": "Mereka berkata: \"Aduhai celakalah kita; sesungguhnya kita ini adalah orang-orang yang melampaui batas\".",
            "verse 68:32": "Mudah-mudahan Tuhan kita memberikan ganti kepada kita dengan (kebun) yang lebih baik daripada itu; sesungguhnya kita mengharapkan ampunan dari Tuhan kita.",
            "verse 68:33": "Seperti itulah azab (dunia). Dan sesungguhnya azab akhirat lebih besar jika mereka mengetahui.",
            "verse 68:34": "Sesungguhnya bagi orang-orang yang bertakwa (disediakan) surga-surga yang penuh kenikmatan di sisi Tuhannya.",
            "verse 68:35": "Maka apakah patut Kami menjadikan orang-orang Islam itu sama dengan orang-orang yang berdosa (orang kafir)?",
            "verse 68:36": "Atau adakah kamu (berbuat demikian): bagaimanakah kamu mengambil keputusan?",
            "verse 68:37": "Atau adakah kamu mempunyai sebuah kitab (yang diturunkan Allah) yang kamu membacanya?,",
            "verse 68:38": "bahwa di dalamnya kamu benar-benar boleh memilih apa yang kamu sukai untukmu.",
            "verse 68:39": "Atau apakah kamu memperoleh janji yang diperkuat dengan sumpah dari Kami, yang tetap berlaku sampai hari kiamat; sesungguhnya kamu benar-benar dapat mengambil keputusan (sekehendakmu)?",
            "verse 68:40": "Tanyakanlah kepada mereka: \"Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu?\"",
            "verse 68:41": "Atau apakah mereka mempunyai sekutu-sekutu? Maka hendaklah mereka mendatangkan sekutu-sekutunya jika mereka adalah orang-orang yang benar.",
            "verse 68:42": "Pada hari betis disingkapkan dan mereka dipanggil untuk bersujud; maka mereka tidak kuasa,",
            "verse 68:43": "(dalam keadaan) pandangan mereka tunduk ke bawah, lagi mereka diliputi kehinaan. Dan sesungguhnya mereka dahulu (di dunia) diseru untuk bersujud, dan mereka dalam keadaan sejahtera.",
            "verse 68:44": "Maka serahkanlah (ya Muhammad) kepada-Ku (urusan) orang-orang yang mendustakan perkataan ini (Al Quran). Nanti Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan) dari arah yang tidak mereka ketahui,",
            "verse 68:45": "dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat tangguh.",
            "verse 68:46": "Apakah kamu meminta upah kepada mereka, lalu mereka diberati dengan hutang?",
            "verse 68:47": "Ataukah ada pada mereka ilmu tentang yang ghaib lalu mereka menulis (padanya apa yang mereka tetapkan)?",
            "verse 68:48": "Maka bersabarlah kamu (hai Muhammad) terhadap ketetapan Tuhanmu, dan janganlah kamu seperti orang yang berada dalam (perut) ikan ketika ia berdoa sedang ia dalam keadaan marah (kepada kaumnya).",
            "verse 68:49": "Kalau sekiranya ia tidak segera mendapat nikmat dari Tuhannya, benar-benar ia dicampakkan ke tanah tandus dalam keadaan tercela.",
            "verse 68:50": "Lalu Tuhannya memilihnya dan menjadikannya termasuk orang-orang yang saleh.",
            "verse 68:51": "Dan sesungguhnya orang-orang kafir itu benar-benar hampir menggelincirkan kamu dengan pandangan mereka, tatkala mereka mendengar Al Quran dan mereka berkata: \"Sesungguhnya ia (Muhammad) benar-benar orang yang gila\".",
            "verse 68:52": "Dan Al Quran itu tidak lain hanyalah peringatan bagi seluruh umat."
        },
        "Italian": {
            "verse 68:1": "Nûn. Per il calamo e ciò che scrivono!",
            "verse 68:2": "Per Grazia di Allah tu non sei un folle,",
            "verse 68:3": "e in verità ci sarà per te infinita ricompensa,",
            "verse 68:4": "e in verità di un'immensa grandezza è il tuo carattere.",
            "verse 68:5": "Vedrai, e pure loro vedranno",
            "verse 68:6": "chi di voi ha perso la ragione.",
            "verse 68:7": "Il tuo Signore ben conosce chi si allontana dalla Sua via e ben conosce coloro che seguono la retta via.",
            "verse 68:8": "Non obbedire a coloro che tacciano di menzogna.",
            "verse 68:9": "Vorrebbero che tu fossi accondiscendente e allora sarebbero accondiscendenti anche loro.",
            "verse 68:10": "Non dare ascolto ad alcun miserabile spergiuro,",
            "verse 68:11": "al diffamatore, seminatore di maldicenza,",
            "verse 68:12": "a quel grande nemico del bene, trasgressore, peccatore,",
            "verse 68:13": "arrogante e persino bastardo.",
            "verse 68:14": "[Non dargli ascolto,] anche se possiede ricchezze e progenie.",
            "verse 68:15": "Quando i nostri versetti gli sono recitati, dice: “Favole degli antichi!”.",
            "verse 68:16": "Lo marchieremo sul grugno.",
            "verse 68:17": "Li abbiamo messi alla prova come abbiamo messo alla prova quelli del giardino che avevano giurato di fare il raccolto al mattino,",
            "verse 68:18": "senza formulare riserva.",
            "verse 68:19": "Venne un uragano, proveniente dal tuo Signore, mentre dormivano:",
            "verse 68:20": "e al mattino fu come se [il giardino] fosse stato falciato.",
            "verse 68:21": "L'indomani si chiamarono gli uni con gli altri, di buon mattino:",
            "verse 68:22": "“Andate di buon'ora alla vostra piantagione, se volete raccogliere”.",
            "verse 68:23": "Andarono parlando tra loro a bassa voce:",
            "verse 68:24": "“Che oggi non si presenti a voi un povero!”.",
            "verse 68:25": "Uscirono di buon'ora, in preda all'avarizia, pur avendo i mezzi [per fare l'elemosina].",
            "verse 68:26": "Quando poi videro [quel che era avvenuto], dissero: “Davvero abbiamo sbagliato [strada]!",
            "verse 68:27": "[Ma poi convennero:] Siamo rovinati”.",
            "verse 68:28": "Il più equilibrato tra loro disse: “Non vi avevo forse avvertito di rendere gloria ad Allah?”.",
            "verse 68:29": "Dissero: “Gloria al nostro Signore, invero siamo stati ingiusti”.",
            "verse 68:30": "Si volsero poi gli uni agli altri, biasimandosi a vicenda.",
            "verse 68:31": "Dissero: “Guai a noi, invero siamo stati iniqui.",
            "verse 68:32": "È possibile che il nostro Signore ci compensi di questo con qualcosa di migliore. Noi bramiamo il nostro Signore”.",
            "verse 68:33": "Questo fu il castigo, ma il castigo dell'altra vita è ancora maggiore, se solo lo sapessero!",
            "verse 68:34": "I devoti avranno presso il loro Signore i Giardini della Delizia.",
            "verse 68:35": "Tratteremo i sottomessi come i criminali?",
            "verse 68:36": "Che cosa vi prende? Come giudicate?",
            "verse 68:37": "Avete forse una Scrittura che vi istruisca,",
            "verse 68:38": "e in cui troviate quel che desiderate?",
            "verse 68:39": "Ci siamo forse legati a voi con solenni giuramenti che Ci impegnino fino al Giorno della Resurrezione, a darvi quello che chiederete?",
            "verse 68:40": "Interpellali su chi di loro se ne faccia garante.",
            "verse 68:41": "Oppure, hanno forse degli [dèi] associati? Allora facciano venire i loro associati, se sono sinceri.",
            "verse 68:42": "Il Giorno in cui affronteranno gli orrori, saranno chiamati a prosternarsi, ma non potranno farlo:",
            "verse 68:43": "saranno bassi i loro sguardi e saranno coperti di ignominia. Eppure furono chiamati a prosternarsi quando ancora erano sani e salvi.",
            "verse 68:44": "LasciaMi solo con coloro che tacciano di menzogna questo Discorso. Li condurremo passo passo per vie che non conoscono.",
            "verse 68:45": "Concedo loro una dilazione: in verità il Mio piano è infallibile.",
            "verse 68:46": "Forse chiedi loro un compenso che li gravi di un peso insopportabile?",
            "verse 68:47": "Forse possiedono l'invisibile e lo descrivono?",
            "verse 68:48": "Sopporta dunque con pazienza il Decreto del tuo Signore e non essere come l'uomo della balena, che invocò al colmo dell'angoscia.",
            "verse 68:49": "Se una grazia del tuo Signore non lo avesse toccato, sarebbe stato gettato sulla riva deserta, reietto.",
            "verse 68:50": "Poi il suo Signore lo scelse e ne fece uno dei giusti.",
            "verse 68:51": "Manca poco che i miscredenti ti trapassino con gli sguardi, quando sentono il Monito; dicono: “Davvero è uno posseduto!”.",
            "verse 68:52": "Ma questo [Corano] non è che un Monito per il Creato."
        },
        "Japanese": {
            "verse 68:1": "ヌーン。筆に誓けて，また書いたものにおいて誓う。",
            "verse 68:2": "主の恩恵において，あなたは気違いではない。",
            "verse 68:3": "いや，本当にあなたには，尽きない報奨があろう。",
            "verse 68:4": "本当にあなたは，崇高な徳性を備えている。",
            "verse 68:5": "やがてあなたは見よう，かれらもまた見るであろう。",
            "verse 68:6": "あなたがたの誰が気違いであるかを。",
            "verse 68:7": "本当にあなたの主は，道から迷い去った者を，最もよく知っておられ，また導かれている者を最もよく知り尽される方である。",
            "verse 68:8": "それであなたは（真理を）否認する者に従ってはならない。",
            "verse 68:9": "かれらの願いは，あなたが歩み寄ることで，そうなればかれらも妥協したいのである。",
            "verse 68:10": "あなたは，卑劣な誓いをたてるどんな者にも屈従してはならない。",
            "verse 68:11": "中傷し，悪口を言い歩く者，",
            "verse 68:12": "善事を妨げ，掟に背く罪深い者，",
            "verse 68:13": "乱暴（残虐）な者，その外素性の卑しい者，",
            "verse 68:14": "富と（多くの）子女を持っているために（そうである，これらの者に従ってはならない）。",
            "verse 68:15": "かれにわが印が読唱されると，「それは昔の物語です。」と言う。",
            "verse 68:16": "やがてわれは，鼻の上に焼印を押すであろう。",
            "verse 68:17": "本当にわれは，（果樹）園の持ち主を試みたように，かれらを試みた。かれらが，早朝にそれ（果物）を収穫することを誓った時に，",
            "verse 68:18": "（アッラーの御望みならば）と，条件を付けることをしなかった。",
            "verse 68:19": "それでかれらが眠っている間に，あなたの主からの天罰がそれを襲った。",
            "verse 68:20": "それで朝には，それは摘み取られたようになった。",
            "verse 68:21": "早朝かれらは互いに叫んだ。",
            "verse 68:22": "「もし収穫するのならあなたがたの畑に急ぎましょう。」",
            "verse 68:23": "そこでかれらは低声に囁き合って出かけた。",
            "verse 68:24": "「今日は一人の貧乏人も，あの（果樹園）に入らせてはなりません。」",
            "verse 68:25": "かれらは強く心に決めて，朝早く出て行った。",
            "verse 68:26": "だがかれらがそれを見た時，言った。「わたしたちは，道を間違えている。",
            "verse 68:27": "いや，わたしたちは（収穫物を）奪われた。」",
            "verse 68:28": "かれらの中，すこし穏やかな一人が言った。「あなたがたはどうして（主を）讃えないのかと，わたしが言ったのに。」",
            "verse 68:29": "かれらは，「わたしたちの主を讃える。本当にわたしたちは不義でありました。」と言った。",
            "verse 68:30": "そこでかれらは，互いに責め合い始めた。",
            "verse 68:31": "かれらは言った。「ああ悲しい，わたしたちは本当に横柄でした。",
            "verse 68:32": "主はこれに代る，更に良い（果樹園）を与えられるかもしれない。本当にわたしたちは，（悔悟して）主に嘆願します。」",
            "verse 68:33": "このようなものが，（現世の）懲罰である。だが来世の懲罰は更に大きなものである。もしかれらに分っていたならば。",
            "verse 68:34": "本当にアッラーを畏れる者に対しては，主の御許に喜こびの楽園があろう。",
            "verse 68:35": "われは信心深い者たちを，罪人のように扱うとでもいうのか。",
            "verse 68:36": "あなたがたはどうしたのか。あなたがたはどう判断するのか。",
            "verse 68:37": "それともあなたがたには，学ぶに足りる啓典があるのか。",
            "verse 68:38": "あなたがたが選ぶものは，何でもその啓典の中にあるのか。",
            "verse 68:39": "それともあなたがたは，審判の日まで有効な誓約をわれと結んだのか。あなたがたが思慮分別することは，確かにあなたがたのものになるのか。",
            "verse 68:40": "（ムハンマドよ）かれらに問え。「かれらの誰がそれを保証するのですか。」",
            "verse 68:41": "または，かれらは（主に）配するものがあるのか。かれらが正しいのなら，その配するものを連れて来させなさい。",
            "verse 68:42": "脛が，現わにされる日（を思いなさい）。かれらはサジダするよう求められる。だがかれらには出来ないであろう。",
            "verse 68:43": "かれらは目を伏せ，屈辱を被るであろう。サジダするよう，確かにかれらは呼びかけられていた。その時五体満足なのに（拒否した）。",
            "verse 68:44": "そこでこの御言葉（クルアーン）を虚偽であるとする者をわれに任せよ。われはかれらが気付かない方面から，一歩一々（堕落に）導き，",
            "verse 68:45": "かれらを猶予するであろう。本当にわれの計略は強く確かである。",
            "verse 68:46": "それともあなたがかれらに報酬を求め，それでかれらは負担を課せられたのか。",
            "verse 68:47": "また幽玄界がかれらの手元にあり，それでかれらは（それを）書き下すことが出来るのか。",
            "verse 68:48": "だから忍耐して，あなたの主の命令を待て。魚の友のようであってはならない。苦しさの余り（かれが）叫んだ時（のように）。",
            "verse 68:49": "主からの恩恵がかれに達しなかったならば，かれは罪を負わされ，不面目に不毛の地に捨てられたであろう。",
            "verse 68:50": "このように主は，かれを選び正義の徒の一人となされた。",
            "verse 68:51": "不信心者は警告を聞く時，その（物凄い）目付きで，あなたを凡んど倒れんばかりにする。かれらは言う。「本当にかれは憑かれた者です。」",
            "verse 68:52": "だが，この（クルアーン）こそは，万有のための訓戒に外ならない。"
        },
        "Jawa": {
            "verse 68:1": "Nun, demi qalam (alat tulis) sarta apa kang padha ditulis",
            "verse 68:2": "Kelawan kanugrahane Pangeranira, sira (Muhammad) iku dudu wong owah",
            "verse 68:3": "Satemene sira iku tampa ganjaran kang tanpa kendhat salawase",
            "verse 68:4": "Lan satemene sira iku duwe budi pekerti kang luhur",
            "verse 68:5": "Lan sira bakal weruh, sarta dheweke (iya) bakal weruh",
            "verse 68:6": "Sapa ing antarnira kang kadunungan owah",
            "verse 68:7": "Satemene Pangeranira nguningani wong kang kesasar saka dalaning Allah, lan uga nguningani wong kang padha netepi pituduh bener",
            "verse 68:8": "Mulane sira aja manut wong kang padha maido al-Qur’an",
            "verse 68:9": "Karepe wong kafir sira iku lemesa lan asiha (aja ngaru biru anggone mangro - tingal) wong kafir uga banjur padha lemes lan asih, ora ngelarani marang sira",
            "verse 68:10": "Aja manut wong kang dhemen supata roh pikire ala",
            "verse 68:11": "Tukang nanacat nyeber pangala - ala",
            "verse 68:12": "Menging gawe kebecikan, dhemen nganiaya lan duraka",
            "verse 68:13": "Asor lan ndablek sarta ngaku becik",
            "verse 68:14": "Aja dume wong kang mangkono mahu sugih bondho lan anak",
            "verse 68:15": "Manawa diwacakake Al-Quran ayatingsu, celathu, \"iku gawe - gaweyane para wong kuna",
            "verse 68:16": "Wong mangkono iku, Ingsun dodoki tenger ing irunge (belalai) salawase urip (nalika perang ing Badar Walid bin Mughirah prothol irungipun)",
            "verse 68:17": "Sayekti Ingsun bakal nyoba dhewek koyo anggon Ingsun nyoba wong - wong kang duwe kebon nalikane padha supata tandurane mesthi diunduhi ing wayah bangun esuk (supaya aja dijaluki wong miskin)",
            "verse 68:18": "Supatane tanpa sumendhe ing kersaning Allah",
            "verse 68:19": "Ing kono wong kang duwe tanduran lagi padha turu Pangeranira nurunake geni ngobong tandurane entek dadi awu",
            "verse 68:20": "Bareng wayah bangun esuk, tandurane mau wis rupa ireng kabeh, kaya wengi kang peteng",
            "verse 68:21": "Ing wayah bangun esuk kang duwe tanduran padha ajak - ajak ngunduhi tandurane",
            "verse 68:22": "Mara padha nilikanan tanduranmu manawa kowe arep ngunduhi",
            "verse 68:23": "Banjur padha mangkat sarta padha rembugan sesidheman",
            "verse 68:24": "Awit dina iki palemahan iki aja nganti kalebon wong miskin",
            "verse 68:25": "Ing wayah esuk, wong mau padha mangkat nedya jaga palemahane rumangsa bisa nguasani tandurane",
            "verse 68:26": "Bareng deleng tandurane wis dadi awu banjur padha ngucap, \"Satemene aku kang luput",
            "verse 68:27": "O, malah aku iki pada kelangan",
            "verse 68:28": "Wong mau kang becik celathu mangkene, \"Aku wis kondho menyang kowe, yo gene kowe ora padha maha sucekake (Gusti Allah)",
            "verse 68:29": "Dheweke (sing duwe palemahan) banjur padha ngucap, \"Dhuh Allah Pangeran kawula, Paduka punika Maha Suci kawula sampun ngakeni kalepatan (sami nganiaya)",
            "verse 68:30": "Wong mau siji lan sijine banjur padha tutuh tinutuh",
            "verse 68:31": "Padha ngucap, \"O, cilaka temen aku iki (aku wis rumangsa luput) kapriye yen ora oleh pangapura",
            "verse 68:32": "Allah Pangeranku muga paring ijol kang luwih becik tinimbang tanduranku kang wis kobong dadi awu, muga tobatku iki ditarima ing Pangeranku (Allah banjur nerima tobate)",
            "verse 68:33": "Kang mangkono iku ewoning siksa ing donya, lan sayekti siksa ing akherat luwih gedhe (abot) yen ta dheweke padha weruha (mesthi ora gelem nglakoni dosa)",
            "verse 68:34": "Tumrap sing bekti ing Allah ana ngarsane Pangerane padha oleh ganjaran suwarga Na’im",
            "verse 68:35": "Lan apa ta para wong kang sumarah bakal Ingsun dadekake kaya wong duraka",
            "verse 68:36": "Ya gene sira wong duraka (kafir) padha nganggep padha wae",
            "verse 68:37": "Apa sira duwe wewaton Kitabe Allah kang sira waca",
            "verse 68:38": "Metelakake sira kena ngelakoni sakarep - karepe",
            "verse 68:39": "Apa sira nyekel sesanggemaningsun mawa supata, kukuh ora bisa owah nganti tumeka dina Qiyamat, yen sira temen bakal enthik apa pancasanira",
            "verse 68:40": "Padha takonana, dheweke sapa sing tanggung tumrap prakara iku",
            "verse 68:41": "Apa padha duwe kanca kang tunggal panemu, tanggung panemune bakala kaleksanan, menawa temen mangono mara padha nekakna kancane (kang nanggung mau)",
            "verse 68:42": "Ing dina bakal anane bilai (Qiyamat) gedhe sarta dheweke bakal padha didawuhi sujud nanging ora bisa (merga gegere kaku)",
            "verse 68:43": "Padha konjem tumungkul handeleng mangisor padha rumangsa asor, lan sayekti biyen dheweke padha didhawuhi sujud (sholat) nalika isih padha selamet",
            "verse 68:44": "Mulane togna wae Ingsun sarta sapa - sapa sing padha anggorohake timbalan iki mesthi Ingsun larut kabecikane saka sathithik nganti padha ora krasa",
            "verse 68:45": "Ingsun nyrantekake paniksane wong kafir mau, panglulu mesthi keleksanan",
            "verse 68:46": "Apa sira njaluk pituwas marang dheweke (anggon ira mrathakake dawuh) nganti dheweke nyonggo utang",
            "verse 68:47": "Apa dheweke padha duwe kaweruh barang kang samar - samar (gaib), kang banjur ditulisi",
            "verse 68:48": "Sira mung narimaha nglakoni sakarsane Pangeranira aja kesusu mitrane iwak (kaya Nabi Yunus kang diuntal iwak) kang angaduh aduh nalikane ana sajerone bebaya",
            "verse 68:49": "Yen ta ora ana nugraha saka Pangerane tumeka marang dheweke, mesthi nglumpruk tiba ing lemah kang lagis sarta dadi wong cacad",
            "verse 68:50": "Tumuli dheweke (Nuh) banjur dipilih dening Pangerane didadekake ewone wong becik",
            "verse 68:51": "Satemene para wong kafir bareng krungu wulangane al-Qur’an amasthi padha nalorong sira kelawan pandelenge, pangucape, \"Temen dheweke (Muhammad) iku edan",
            "verse 68:52": "al-Quran iku ora liwat mung wewulang tumrap kabeh bangsa"
        },
        "Kazakh": {
            "verse 68:1": "Нун. Қаламмен және олардың жазып жатқандарымен ант етемін",
            "verse 68:2": "Ей, Мұхаммед! Сен Раббыңның игілігі арқасында жын соққан біреу емессің",
            "verse 68:3": "әрі күдіксіз, саған таусылмайтын сый бар",
            "verse 68:4": "және сен, шын мәнінде, ұлы мінезге иесің",
            "verse 68:5": "Жақында көресің және олар да көреді",
            "verse 68:6": "сендердің қайсы біріңде ессіздік бүлік бар екенін",
            "verse 68:7": "Ақиқатында, Раббың Өз жолынан адасқандарды жақсы біледі. Әрі Ол тура жолдағыларды да жақсы біледі",
            "verse 68:8": "Ей, Мұхаммед! Өтірікке шығарушыларға бағынба",
            "verse 68:9": "Олар сенің көнгіш болғаныңды қалайды, сонда олар да жұмсақтық танытпақшы",
            "verse 68:10": "Әрбір көп ант бергішке, жексұрынға бағынба",
            "verse 68:11": "мін таққышқа, өсек тасығышқа",
            "verse 68:12": "жақсылыққа кедергі болушыға, шектен шығушыға, күнәға батушыға",
            "verse 68:13": "дөрекіге бұған қоса өзін өзгенің баласы атағанға бағынба",
            "verse 68:14": "дәулеті және перзенттері көп болса да",
            "verse 68:15": "Оған аяттарымыз оқылған кезде ол: «Бұрынғылардың ертегілері», деді",
            "verse 68:16": "Таяуда оның тұмсығын таңбалаймыз",
            "verse 68:17": "Ақиқатында, Біз оларды, бақ иелерін сынағанымыздай сынадық. Сол кезде олар таң уақытында оның жемістерін жинап алуға ант етті",
            "verse 68:18": "Алайда олар ескермеді тосын жағдайды есепке алмады",
            "verse 68:19": "Сөйтіп, олар ұйықтап жатқанда, оны бақты Раббың тараптан бір айналушы айналды",
            "verse 68:20": "Сонда, таңға қарай жемістері қиылғандай кейіпке түсті",
            "verse 68:21": "Ал, олар таң сәріде бір-бірін шақырды",
            "verse 68:22": "« Өнім Жинайтын болсаңдар, бақтарыңа ерте барыңдар», деді",
            "verse 68:23": "Сөйтіп олар баққа жол тартып, сыбырласқан күйде",
            "verse 68:24": "«Бүгін оған ешбір кедей кірмесін», деді",
            "verse 68:25": "Олар күштері жететініне сеніп, ертемен оңаша барды",
            "verse 68:26": "Ал, оны көрген сәтте: «Ақиқатында біз адасып кетіппіз",
            "verse 68:27": "жоқ, біз айрылған екенбіз», деді",
            "verse 68:28": "Олардың ішіндегі дұрыстауы: «Сен­дерге: « Аллаһты дәріптеңдер демеп пе едім», деді",
            "verse 68:29": "Олар: «Раббымыз барлық кемшіліктен пәк. Ақиқатында біз әділетсіз болдық», деді",
            "verse 68:30": "Сонда олар бірін-бірі жазғырып",
            "verse 68:31": "«Сорымыз құрысын! Ақиқатында, біз шектен шыққан екенбіз",
            "verse 68:32": "Мүмкін Раббымыз бізге бұның ор­нына одан жақсысын берер. Ақиқатында, біз Раббымыздан үміт етеміз», десті",
            "verse 68:33": "Міне, осындай азап! Күмәнсіз, соңғы, мәңгілік өмір ақирет азабы одан да үлкен. Егер, олар білген болса",
            "verse 68:34": "Шын мәнінде, тақуалар үшін Аллаһтың жазасынан қорқып, сақтанғандарға олардың Раббысында Наъим (Жәннаттың аты. Мағнасы көптеген нығмет, игілік) бақтары бар",
            "verse 68:35": "Біз мұсылмандарды бойсұнушыларды қылмыскерлер сияқты етеміз бе",
            "verse 68:36": "Сендерге не болды, қалай үкім шығарып жатырсыңдар",
            "verse 68:37": "Әлде сендерде өздерің оқитын бір кітап бар ма",
            "verse 68:38": "Онда ол кітапта : «күдіксіз, сендерге таңдағандарың болады» делінген бе",
            "verse 68:39": "Әлде сендер үшін Қиямет күніне дейін жететін: «Шешкендерің орындалады», деген, Біз міндетімізге алған ант бар ма",
            "verse 68:40": "Ей, Мұхаммед! Олардан сұра, қайсылары бұған кепіл болады екен",
            "verse 68:41": "Әлде олардың серіктері бар ма? Егер шын сөзді болса, серіктерін әкелсін",
            "verse 68:42": "Ол күні балтыр ашылғанда, олар сәжде етуге шақырылады, бірақ олардың оған шамалары келмейді",
            "verse 68:43": "Олардың көздері жуасып, өздерін қорлық орап алады. Анығында, олар аман-сау кезінде осы өмірде сәжде жасауға шақырылған болатын",
            "verse 68:44": "Ей, Мұхаммед! Енді осы Сөзді Құранды өтірік санайтындарды Маған қалдыр. Біз оларды, өздері білмейтін жақтан, бірте-бірте ұстаймыз",
            "verse 68:45": "Әрі оларға уақыт беремін. Ақиқатында, Менің айла-тәсілім өте мықты",
            "verse 68:46": "Әлде сен олардан ақиқатқа шақырғаның үшін ақы сұрап, олар борышты болып қиналып жатыр ма",
            "verse 68:47": "Әлде оларда ғайыптан бір нәрсе болып, олар жаза ма",
            "verse 68:48": "Ей, Мұхаммед! Раббыңның үкіміне сабыр ет және балық ішіндегі секілді болма. Сол уақытта ол қайғыға батып, жалбарынды",
            "verse 68:49": "Егер оған Раббысынан бір игілік болмағанда, онда ол ашық жерге жағалауға айыпталған күйде лақтырылар еді",
            "verse 68:50": "Раббысы оны таңдап, ізгілерден етті",
            "verse 68:51": "Ал, күпірлік етушілер Аллаһқа серік қосушылар Еске салуды Құранды тыңдаған сәтте, сені көзбен атып сүріндіруге әзір және: «Ол анық жын соққан», дейді",
            "verse 68:52": "Негізінде, бұл Құран әлемдер үшін еске салудан өзге нәрсе емес"
        },
        "Korean": {
            "verse 68:1": "눈. 펜을 두고 맹세코, 그리고 그들(사람들)이 기록하는 것을 두고 맹세코눈 연필과 그들의 기록에 걸어 맹세하사",
            "verse 68:2": "그대 주님의 은총에 의해 그대(무함마드)는 미친 자가 아니라그대가 미친자가 아닌 것은 주님의 은혜로서",
            "verse 68:3": "진실로 그대에게는 끊이지 않는 보상이 있노라진실로 그대에게는 한없는 보상이 주어지리라",
            "verse 68:4": "그리고 진실로 그대는 고결한 품성을 지녔도다실로 그대는 고상한 성품의 소유자로",
            "verse 68:5": "그러니 그대는 볼 것이며 그들도 볼 것이라머지 않아 그대도 알게 될 것이며 저들도 알게 되리라",
            "verse 68:6": "그대들 중 누가 시험 받고 있는 자인지 (볼 것이라)너희 중에 누가 미친 자이뇨",
            "verse 68:7": "실로 그대의 주님 그분께서는 누가 그분의 길을 벗어나 방황하는지 가장 잘 알고 계신 분이며 그분께서는 누가 인도의 길을 걷는 자들인지 가장 잘 알고 계신 분이라실로 그대 주님은 하나님의 길에서 방황하는 자와 복음을 받 아들이는 자들을 가장 잘 아시는 분이시라",
            "verse 68:8": "그러니 그대는 진리를 부정하는 자들을 따르지 말라그러므로 진리를 거역하는 자들에게 기울이지 말라",
            "verse 68:9": "그들은 그대가 (그들을) 나긋이 대하여 그들도 (그대를) 나긋이 대하길 갈망하더라그들이 순응하는 척 하며 그 대가 순응하기를 그들은 원하고 있노라",
            "verse 68:10": "그리고 그대는 맹세를 남발하는 비천한 어떤 누구도 따르지 말라비열한 그들의 맹세에 귀를 기울지 말라",
            "verse 68:11": "(그는) 험담을 일삼고 뒷소리 하며 돌아다니는 자라그들은 중상모략하는 자들로 비방하고 배회하면서",
            "verse 68:12": "(그는) 집요히 선(善)을 막고 적의적으로 행동하는 죄짓는 자라모든 선행을 방해하고 영역 을 넘어 죄악에 깊이 빠진 자들로",
            "verse 68:13": "뿐만 아니라 (그는) 모습이 흉악하고 태생이 모호한 자라난폭하고 잔인하니 모든 것 이 저주스런 태생이라",
            "verse 68:14": "그는 재산과 자손을 소유했다는 이유로이는 그가 재물과 많은 자손들을 가졌기 때문이뇨",
            "verse 68:15": "그에게 나의 징표가 낭송될 때 그는 “(이것은) 옛날 사람들의 설화” 라고 말하더라하나님의 말씀이 그에게 계 시될 때마다 그것은 옛 선조들은 우화들이라고 말하였더라",
            "verse 68:16": "나는 그의 코 위에 표시를 새길 것이라하나님은 콧등에 낙인을 찍 어 두리라",
            "verse 68:17": "실로 나는 그들을 시험하였으니 마치 정원의 소유자들을 시험한 것과 같노라 : 그들은, 아침을 맞이했을 때 정녕코 그것(열매)을 딸 것이라 맹세하더라아침에 과수원의 과일을 수 확하려 결심했을 때 과수원 사람 들을 시험했듯이 하나님은 그들을 시험하노라",
            "verse 68:18": "그러나 그들은 예외를 두지 않았노라그러나 그들은 은혜를 베풀지 아니 했으니",
            "verse 68:19": "그리하여 그들이 자는 사이 그대 주님으로부터의 재앙이 그것(정원)을 맴돌았노라그들이 잠든 사이에 주님으로부터 그 정원에 재앙이 있었노 라",
            "verse 68:20": "그리하여 그것(정원)은 칠흑의 밤과 같이 되었노라그리하여 그 정원은 검은 불모지가 되어 버렸으니",
            "verse 68:21": "그렇게 그들은 아침을 맞이했을 때 서로가 서로를 부르더라아침이 되매 그들은 서로가 서로에게 소리 지르더라",
            "verse 68:22": "`그대들이 (열매를) 따려 한다면 그대들의 경작지로 아침 일찍 떠나시오`과일을 수확코자 한다면 아 침 일찍 과수원으로 나가라 하니",
            "verse 68:23": "그리하여 그들은 비밀스레 이야기하며 출발하였노라그들은 떠나며 낮은 비밀의 목소리로 속삭이더라",
            "verse 68:24": "`오늘은 어떤 불우한 자도 그대들에게 들어오면 절대로 안 되오`오늘은 가난뱅이가 당신의 과수원에 들어 오지 못하도록 하 라",
            "verse 68:25": "그들은 저지에 관한 굳은 결심을 지닌 채 아침 일찍 떠났노라그리하여 그들은 그렇게 작 정하고 아침 일찍 피하여 떠났 더라",
            "verse 68:26": "그리하여 그들이 그것(정원)을 보았을 때 말하길 “진실로 우리는 길을 잘못 들었노라”그들이 과수원을 보았을 때 우리가 길을 잃었도다 라고 그들 은 말하며",
            "verse 68:27": "“그렇지 않노라. 우리는 제지 받은 자들이라”실로 우리는 크게 빼앗긴 자들이요 라고 하더라",
            "verse 68:28": "그들 중의 가장 바른 자가 말하길 “내가 그대들에게 (하나님을) 찬양해야 한다고 말하지 않았는가?”그들 중에 보다 정직했던 자가 왜 하나님을 찬양하지 아니 했느냐 내가 너희에게 말하지 아니 했더뇨 라고 하매",
            "verse 68:29": "그들이 말하길 “저희의 주님은 완벽하신 분이며 실로 저희는 부당한 자들이었습니다”주님께 영광이 있으소서 실 로 저희가 사악한 자들이었습니다라고 말하노라",
            "verse 68:30": "그들은 서로가 서로를 바라보며 상대를 원망하더라그때 그들은 서로가 서로를 비난하며",
            "verse 68:31": "그들이 말하길 “재앙이도다! 실로 우리는 경계를 넘어선 자들이었습니다”실로 우리가 사악한 자들이 었으니 비참할 뿐이라고 말하고",
            "verse 68:32": "“우리의 주님께서 우리에게 그보다 더 좋은 것으로 대체해 주시길 바랍니다. 실로 우리는 우리의 주님께 소망할 뿐입니다”주님께서 이것보다 더 좋은 것으로 바꾸어 주실 것이요 실로 우리는 그분께 회개하도다 라고 말하더라",
            "verse 68:33": "벌이란 저러하도다. 그러나 그들이 알고 있다면 실로 내세의 벌은 더 크노라그러함이 현세의 벌이라 너 희가 알고 있다면 내세의 응벌은 더욱 크니라",
            "verse 68:34": "실로 하나님을 경외하는 자들은 그들 주님께 가까운 곳에서 기쁨의 천국을 가질 것이라그러나 하나님을 두려워 하 는 자들에게는 은혜의 천국이 있 나니",
            "verse 68:35": "그런데도 내가, 순종하는 자들을 악행을 저지르는 자들과 같이 둔단 말인가하나님이 믿음의 백성들을 죄인의 백성들처럼 대우하려 하시겠느뇨",
            "verse 68:36": "그대들에게 무슨 일이 일어난 것인가? 그대들은 어떻게 판결하는 것인가도대체 너희가 그런 판단을 하는 이유가 무엇이뇨",
            "verse 68:37": "아니면 그것(판결)을 위하여 그대들이 읽는 책이라도 있단 말인가너희가 배울 수 있는 한 성 서가 있었느뇨",
            "verse 68:38": "실로 그대들은 고르는 대로 가질 것이라는 말이 그(책) 안에 있는 것인가너희가 그 안에서 선택할 무엇이 있었느뇨",
            "verse 68:39": "아니면 그대들이 부활의 날까지 지속되는, 내가 책임질 맹세를 가지고 있어 실로 그대들은 판결하는 대로 가진단 말인가심판의 날까지 너희가 원하 는 것이 너희에게 이르리라 하나 님의 성약이라도 받았느뇨",
            "verse 68:40": "그대(무함마드)는 그들에게 그들 중의 누가 그것을 보증할 것인지 물어보라그대여 그들 가운데 누가 그것을 보장할 것인지 그들에게 물어보라",
            "verse 68:41": "아니면 그들에게 (하나님과) 대등한 존재들이 있단 말인가? 그렇다면, 그들이 진실된 자들이라면 그들이 말하는 대등한 존재들을 가져와 보도록 하라그들에게 신과 대등한 무리 의 동료가 있다는 거뇨 그들이 진 실이라면 그들의 무리들을 이르게 하라",
            "verse 68:42": "그날 정강이가 노출되고 그들은 부복할 것을 요구받으나 (그렇게) 하지를 못하더라가혹한 재앙이 있을 그날에 그들은 부복하라 부름을 받으나 그렇게할 수도 없노라",
            "verse 68:43": "그들의 눈은 떨구어질 것이며 굴욕이 그들을 덮칠 것이라. 그들은 이미 (현세의) 안전한 상태에서 부복할 것을 요구받았으나 그들은 미동도 않았노라그들의 눈들은 아래로 처져 있고 굴욕이 그들을 애워싸노라 그들이 건전했을 때 부복하라 부 름을 받았노라",
            "verse 68:44": "그러니 그대(무함마드)는 나와, 이 말씀을 부정하는 자를 놓아 두라. 나는 그들이 알지 못하는 곳에서 그들을 서서히 옥죌 것이라그러므로 이 메세지를 거역 한 자들을 나에게 맡기라 그들이 인식하지 못하는 방향으로부터 점차로 벌을 주리라",
            "verse 68:45": "나는 그들을 보류할 것이니 실로 나의 계략은 강력하노라내가 그들을 일시적으로 유 예하나 실로 나의 계획은 확고하 니라",
            "verse 68:46": "그대(무함마드)가 그들에게 보수라도 요구하는 것인가? 그렇다면 그들은 빚으로 말미암아 허리가 휘게 될 것이라그대가 그들에게 보상을 요 구하여 그들이 부채로 짐을 지고 있느뇨",
            "verse 68:47": "아니면 그들에게, 보이지 않는 영역(에 대한 지식)이라도 있어 그들이 (그것을) 기록하는 것인가보이지 않는 것이 그들곁에 있어 그들이 그것을 기록이라도 할 수 있느뇨",
            "verse 68:48": "그러니 그대(무함마드)는 그대 주님의 판결에 인내하고 물고기의 동료(요나)처럼 되지 말라 : 그는 시름에 잠긴 채 (하나님을) 불렀노라그러므로 인내하라 그때 주 님의 명령이 있을 것이니 노하여 고함을 쳤던 물고기의 무리가 되 지 말라",
            "verse 68:49": "그의 주님의 은총이 그에게 다다르지 않았더라면 실로 그는 비난받으며 벌판에 내던져졌을 것이라주님의 은혜가 그에게 베풀 어지지 아니 했으면 벌거벗은 채 불모의 땅에 버려져 비난을 받고 있었으리라",
            "verse 68:50": "그리하여 그의 주님은 그를 선택하시어 선량한 자들 중의 하나로 두셨노라그러나 주님은 그를 선택하 사 의로운 자 중에 있게 하셨노라",
            "verse 68:51": "불신한 자들은 꾸란을 들었을 때 실로 그들의 눈으로써 그대(무함마드)를 거의 넘어뜨리려 하면서 “그는 진실로 미친 자라” 고 말하더라불신자들이 그 교훈을 들을 때면 그들의 눈으로써 그대를 괴 롭히며 실로 그야말로 미친자라 말하더라",
            "verse 68:52": "그러나 그것(꾸란)은 존재하는 모든 것을 위한 메시지에 다름 아니라그러나 그것은 분명 온 인류를 위한 교훈이라"
        },
        "Kurdish": {
            "verse 68:1": "Nûn. (Arşa van tîpên di serê ferkeran da hatine hey Yezdan dizane) Bi nûn û nivîsdarok û bi nivîsandina, ku (bi nivîsdarokê) tê rêz kirinêسه‌رنجی سه‌ره‌تای سووره‌تی (الشوری) بده‌. سوێند به پێنووس و ئه‌وه‌ی که ده‌ینوسن (ئه‌م سوێند خواردنه نیشانه‌ی نرخی خوێندن و زانستیه لای خوای گه‌وره‌).",
            "verse 68:2": "(Muhemmed!) tu bi qencîneke Xuda yê xwe tepa nakebî(ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم تۆ به‌هۆی نازو نیعمه‌تی په‌روه‌ردگارته‌وه دووریت له شێتی یه‌وه وه‌کو نه‌فامن ده‌ڵێن)",
            "verse 68:3": "Bi rastî ji bona te ra kiryeke bê paşî heyeبێگومان پاداشتێکی نه‌بڕاوه بۆ تۆ ئاماده‌یه‌.",
            "verse 68:4": "Bi rastî tu li ser xûyekî mezinîبه‌ڕاستی تۆ له‌سه‌ر ڕه‌وشت و خوویه‌کی زۆر جوان و په‌سه‌ند و بێ وێنه و مه‌زنیت.",
            "verse 68:5": "Îdî tuyê jî (di nêzîk da) bibînî ewanê jî, bibîninسه‌رئه‌نجام تۆ ده‌بینیت و ده‌زانیت و ئه‌وانیش ده‌بینن و ده‌زانن...",
            "verse 68:6": "Ka kîjan ji we (herdu destan ji rêya rast) darketîye (tepa ketîye)شێتێتی به کامتانه‌وه‌یه‌.",
            "verse 68:7": "Bi rastî Xuda yê te bi xweber ça bi wanê hatine (rîyarast) çêtir dizan e, bi wanê, ku ji rêya wî der- ketine jî çêtir dizan eبه‌ڕاستی په‌روه‌ردگارت خۆی ده‌زانێت، کێ له ڕێبازی ئه‌و لایداوه و گومڕا بووه‌، کێیش ڕێبازی هیدایه‌ت و ئیمانی گرتۆته‌به‌رو ڕاسته له‌گه‌ڵ خوادا.",
            "verse 68:8": "Îdî (Muhemmed!) tu bigotina virekan nek eتۆ هه‌رگیز به‌قسه‌ی ئه‌وانه مه‌که که باوه‌ڕیان به تۆ نیه‌و به‌رنامه‌که‌ی تۆ به‌درۆ ده‌زانن.",
            "verse 68:9": "Ewan hiz kirine, ku tu bi wan ra bi nermayî derbas bikî, îdî ewan jî bi wa ra bi nermayî derbas bikin (carna tu bi gotina wan, carna jî ewan bi gotina te bikin)ئه‌وانه ئاواته‌خوازن که تۆ نه‌رمی بنوێنیت ئینجا ئه‌وانیش نه‌رمی بنوێنن.",
            "verse 68:10": "(Muhemmed!) hemî (kesên) sond xwarin e riswaبه‌قسه‌ی هه‌موو ئه‌وانه مه‌که که زۆر سوێند ده‌خۆن و زۆر سووك و ڕیسوان.",
            "verse 68:11": "Gotegotê bi navok (di nava kesan da) axiftinan digerîn eئه‌وانه‌ی که به‌شوێن عه‌یب و عاردا ده‌گه‌ڕێن و دووزمانی ده‌که‌ن و فیتنه ده‌گێڕن و حه‌زیان له ئاشووبه‌.",
            "verse 68:12": "Nahêle (kes) qencîyan bike, ji tuxûbê xwe borî û gonehkarزۆر دژی خێرو چاکه‌ن و ده‌ستدرێژی ده‌که‌ن و گوناه ئه‌نجام ده‌ده‌ن و پیلان ده‌گێڕن.",
            "verse 68:13": "Ku bi hêrs in ji piştî hêrsê jî bê nişan eله هه‌مان کاتدا ئێسك تاڵ و ڕه‌وشت ناشرین و ناکه‌س به‌چه‌و باوك نادیارن...",
            "verse 68:14": "Ji ber ku bi mal û kur in, tu bi gotina (wan) neke. Loma, ewan ji tuxûbê xwe borîne rast nîninهه‌ریه‌که‌یان به‌وه ده‌نازێت که‌هه‌ندێك ماڵ و سامان و کوڕی هه‌یه‌...",
            "verse 68:15": "Gava berateyên me ji wî ra tê xwundinê (aha) dibêje,\"Evanan çîvanokê berêneکاتێك ئایه‌ته‌کانی ئێمه‌ی به‌سه‌ردا ده‌خوێنرێته‌وه بێباکانه ده‌ڵێت: ئه‌مه داستانی پێشووه‌کانه‌، ئه‌مه به‌سه‌رهاتی دێرینه‌.",
            "verse 68:16": "Di nêzîk da emê li ser pozê wî durufê dayninئێمه سه‌رئه‌نجام لووتی داخ ده‌که‌ین و سه‌ری لووتی ڕه‌ش ده‌که‌ین.",
            "verse 68:17": "Bi rastî me ça hevrîne rêz û baxan ceribandibûn. Kanê wan sond xaribûn, ku ewanê di serê sibehê da (darê bostanê xwe biweşînin)به‌ڕاستی ئێمه ئه‌و خه‌ڵکه‌مان تاقی کرده‌وه هه‌روه‌ك خاوه‌نانی باخه‌که‌مان تاقیکرده‌وه‌، کاتێك سوێندیان خوارد بێگومان به‌یانی ده‌یچنن.",
            "verse 68:18": "Qey ewan tu tişt ji hev venediqetandin (ne digotin: Heke Xuda hez bike)بێ ئه‌وه‌ی بڵێن به‌پشتیوانی خوا، (یان به‌و مه‌به‌سته‌ی هیچی پێوه نه‌هێڵن بۆ هه‌ژاران)...",
            "verse 68:19": "Îdî ewan bi xweber jî hêj razaîbûne li ser wan da aşîtek ji Xuda yê te çerixîئه‌وسا په‌روه‌ردگارت به‌ڵایه‌کی داباراند به‌سه‌ر باخه‌که‌دا له‌کاتێکدا ئه‌وان خه‌وتبوون...",
            "verse 68:20": "Îdî rêz û baxê wan wekî pirêzên zevîyan man eئیتر وه‌ك باخێکی لێهات؛ که هه‌مووی چنرابێته‌وه‌و هیچی پێوه نه‌ما بێت...",
            "verse 68:21": "Ewan di sibehê da qîrdane hevئه‌وسا به‌یانی زوو یه‌کتریان ئاگادار کردو وتیان:...",
            "verse 68:22": "Ku hûnê herin (daran) daweşînin; zû herin hûn dereng man e, gotineبا بچین بۆ سه‌ر باخ و بێستانه‌که‌مان ئه‌گه‌ر بڕیاره بیچنین...",
            "verse 68:23": "Îdî ewan rabûne çûne, di nava hev da bi dizî axiftin eئه‌وسا ده‌رچوون به‌نهێنی و به‌هێواشی ده‌ڕۆیشتن، به چپه قسه‌یان ده‌کرد...",
            "verse 68:24": "Di îro da bila tu xezan (di rêz û baxçe da) neyê bal meده‌یانوت: نابێت ئه‌مڕۆ هه‌ژاران پێمان بزانن و ڕوو بکه‌نه باخه‌که‌مان...",
            "verse 68:25": "Ewan zû çûn. Guman dikirin, ku dişîn qe tu xezanî nexne baxçê xweبه‌یانی زوو بۆی ده‌رچوون، وایان ده‌زانی که توانیویانه هه‌ژاران بێ به‌ش بکه‌ن.",
            "verse 68:26": "Îdî gava ewan çûne (bostanê xwe) dîtine (aha) gotine: \"Bi rastî me rêya rast wuda kirîyeکاتێك گه‌یشتنه باخه وێرانه‌که‌و بینیان وتیان: بێگومان ئێمه ون بووین و ڕێمان هه‌ڵه کردووه‌...",
            "verse 68:27": "Bi rastî em di berê da ji wî (bostanî) hatine bê par kirinêدوای ئه‌وه‌ی دڵنیا بوون ڕێیان هه‌ڵه نه‌کردووه‌، وتیان: نه‌خێر، به‌ڵکو ئێمه به‌ش بڕاو کراوین...",
            "verse 68:28": "Ewê nîvwarê ji wan (ji bona wan ra aha) gotîye: \"Qey min ji bona we ra negot; gotî hûn Xuda yê xwe ji kêmasîyan paqij bikinله هه‌موویان ژیر تر وتی: پێم نه‌وتن که حه‌ق وایه ته‌سبیحات و ستایشی خوا بکه‌ن و سوپاسگوزاری بکه‌ن؟!",
            "verse 68:29": "Ewan jî (aha) gotine; \"Xuda yê me! bi rastî em te ji kemasîyan paqij dikin, loma bi rastî em ji cewrkaran bûneئه‌وسا هه‌موو وتیان: پاکی و بێگه‌ردی بۆ په‌روه‌ردگارمانه‌، به‌ڕاستی ئێمه ناحه‌قیمان کرد.",
            "verse 68:30": "Îdî hinekê ji wan berê xwe dane hinekên wan li hev tilf kirineئه‌وسا ڕویان کرده یه‌کترو ده‌ستیان کرده لۆمه‌کردن و سه‌رزه‌نشت کردنی یه‌کتری و...",
            "verse 68:31": "(Ji hev ra aha) aha gotina, \"Xwalî li me be! bi rastî em ji avarû derketibûnوتیان: هاوار بۆ ئێمه‌، به‌ڕاستی ئێمه پیاو خراپ و له سنوور ده‌رچوو بووین (که‌ی ئه‌و ڕه‌زیلییه ڕاسته‌)!!",
            "verse 68:32": "Dibe ku Xuda yê me di şûna wan da ji wan çêtir bide me. Loma bi rastî em ji Xuda yê xwe hêj ji wan çêtir dixwazinئومێده‌وارین که په‌روه‌ردگارمان له‌م باخه باشترمان پێ ببه‌خشێت (ئێمه ئیتر ته‌مێ بووین، ده‌رس و ئامۆژگاریمان وه‌رگرت) ئیتر ئێمه به‌ڕاستی به‌هیوای ڕه‌زامه‌ندی خوا هه‌وڵ ده‌ده‌ین و به‌هیوای به‌خششی ئه‌وین.",
            "verse 68:33": "Şapat ahane! heke ewan bizanin şapata para da hêj meztir eسزای ئه‌م ژیانه ئاوایه و سزاو ئازاری قیامه‌تیش سه‌ختتره ئه‌گه‌ر خه‌ڵکی بیانزانیایه‌.",
            "verse 68:34": "Bi rastî ji bona Xuda parizan, li bal Xuda yê wan, behişta xarinan heyeبه‌ڕاستی بۆ خواناس و پارێزکاران باخه‌کانی به‌هه‌شتی پڕ له نازو نیعمه‌ت له‌لای په‌روه‌ردگاریان ئاماده‌یه‌.",
            "verse 68:35": "Îdî qe em misilmanan û guneh karan wekî hev digirinئایا ڕه‌وایه پاداشتی موسوڵمانان وه‌ك تاوانبار و تاوانکاران بێت؟!",
            "verse 68:36": "(Gelî filan!) hûn ça berewanî dikin (ewan wekî hev digirin)ئه‌وه چیتانه‌؟ چۆن حوکم و بڕیاری ناڕه‌وای وا ده‌رده‌که‌ن!!",
            "verse 68:37": "Qey ji bona we ra pirtûkek heye! hûn (di wê pirtûkê da) evan biryaran dixûninئایا کتێبێکی ئاسمانیتان بۆ هاتووه‌، تیایدا بخوێنن؟!...",
            "verse 68:38": "Bi rastî hûn çi bibêjin, ji bona we ra di wê pirtûkê da heyeتا هه‌رچی ئێوه بتانه‌وێت به ئاره‌زووی خۆتان هه‌ڵی بژێرن؟!",
            "verse 68:39": "Maqey heya roya qarsê ji bona we ra me sond xwarîye, ku hûn bi çi berewanî bikin, ewa berewanî ya ji bona we ra heyeیان سوێندتان له‌سه‌رمانه که تاڕۆژی قیامه‌ت هه‌ر چیتان بوێت ئه‌وه بێت؟!",
            "verse 68:40": "(Muhemmed! tu ji wan aha) pirs bike, ka ji wan kîjan dibe gerewa vê gotinêپرسیاریان لێ بکه بزانه کامیان زامنی ئه‌و کاره‌یه‌!!",
            "verse 68:41": "Qey Ji bona wan ra (divê axiftinê da) hempayê wan hene? Îdî heke ewan (di doza xwe da) rast in, bila hempayê xwe jî bîninئایا ئه‌مانه شه‌ریك و هاوبه‌شیان هه‌یه له‌م بڕیاره‌دا، کوان؟ ده‌با بیانهێنن ئه‌گه‌ر ڕاست ده‌که‌ن؟",
            "verse 68:42": "Di roya, ku deling ji bazûyan tê hildanê (temtêla wan zor dibe) ewan li bal kunde birinê da têne gazî kirinê, îdî ewan nikarin kunde beherin (loma danê wî borîye)ڕۆژێك دێت په‌رده له‌سه‌ر هه‌موو شتێك لاده‌درێت و لاق ده‌رده‌که‌وێت، خوانه‌ناسان بانگ ده‌کرێن بۆ سوژده بردن، به‌ڵام ناتوانن.",
            "verse 68:43": "Çavê wan ji tirsa ketîye, rûreşîk bi wan digirtîye. Bi sond! Ewan hêj zende bûne, li bal kunde birinê da hatine gazî kirinê (lê kude ne birine)ئه‌وانه‌؛ ئه‌و ڕۆژه چاویان شۆڕه و زه‌لیلی و خه‌جاڵه‌تی به‌ته‌واوی دایان ده‌گرێت، چونکه کاتی خۆی بانگ ده‌کران بۆ نوێژکردن و سوژده بردن، له کاتێکدا له‌وپه‌ڕی ته‌ندروستی و سه‌ربه‌ستیدا بوون (به‌ڵام گاڵته‌یان پێی ده‌هات).",
            "verse 68:44": "Îdî (Muhemmed!) tu ewanê, ku vê (Qur´an ê) didine derewdêrandinê ji min ra bihêle (dest ji wan berde) emê ewn bi pêpelîk di wî cîyî qe ewan pê nizanbin nêzîkê (aşîtê) bikinوازم لێ بهێنه بۆ ئه‌وانه‌ی که بڕوا به‌م گوفتاره ناهێنن، ئێمه ئه‌وانه بۆ سه‌ره‌نجامی ناکامیان به‌ره‌به‌ره کێش ده‌که‌ین، بێ ئه‌وه‌ی به خۆیان بزانن و هه‌ستی پێ بکه‌ن.",
            "verse 68:45": "Ez ji bona wan ra dem didim. Bi rastî defika min (ji bona wan ra ) bi hêz e, (kê bikeve îdî dernakeve)من مۆڵه‌تیان ده‌ده‌م، به‌ڵام هه‌رگیز له سزای ئێمه ڕزگاریان نابێت چونکه بێگومان ده‌سه‌ڵاتمان تۆکمه‌یه‌.",
            "verse 68:46": "Qey (Muhemmed!) tu ji wan kirya (pêxembrî ya xwe) dixwazî, îdî ewan jî, ji deyn dayînê giran bûne (nikarin kirya te bidin)ئه‌ی ئایا تۆ داوای کرێیان لێده‌که‌یت، تا قه‌رزار باری زۆر ببن و نه‌توانن له ژێری ده‌رچن؟!",
            "verse 68:47": "Qey li bal wan (xezîna bi ne xûyan) heye, îdî ewan jî, (ji wan ne xûyan) dinivîsinئه‌ی ئایا ئه‌وانه غه‌یب زانن و له نهێنیه‌کان ئاگادارن تا بۆ خۆیان شت یاداشت بکه‌ن و دژایه‌تی ئیسلام بکه‌ن؟",
            "verse 68:48": "Îdî tu ji bona berewani ya Xuda yê xwe hew bike û tu jî wek hevrîyê masîyê (Yunis) neke. Gava (Yunis) ji kulan tijî bûye (ji Xuda) lava kirîyeئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم تۆ خۆڕاگربه له به‌رامبه‌ر فه‌رمانی په‌روه‌ردگارته‌وه‌، نه‌که‌یت وه‌ك هاوه‌ڵ و خاوه‌نی نه‌هه‌نگه‌که بیت (که یونس پێغه‌مبه‌ره‌) له کاتێکدا که دڵی پڕ بوو له خه‌فه‌ت و په‌ژاره‌یه‌کی زۆره‌وه پاڕایه‌وه‌و لاڵایه‌وه‌...",
            "verse 68:49": "Heke ji Xuda yê wî qencîyek negîhişta wi, wê di çoleke rût da bi rexnî bihata avêtinêئه‌گه‌ر ڕه‌حمه‌ت و به‌خشنده‌یی په‌روه‌ردگاری فریای نه‌که‌وتایه هه‌روا له‌و ده‌شته‌دا به‌بێ ناز ده‌مایه‌وه‌...",
            "verse 68:50": "Îdî (wusa nebû) loma Xuda yê wî (lava ya wî) litê kir. Îdî (Xuda yê wî) ewa xiste ji aştîkaranبه‌ڵام په‌روه‌ردگاری هه‌ڵی بژاردو خستیه ڕیزی چاکانه‌وه (دوای نزاو په‌شیمانی).",
            "verse 68:51": "Ewanê bûne file hane! Gava ewan (xwendina Qur´an ê) dibihîstin, nêzîk dibû, ku ewan te bi çavê xwe welgerînin. Ewan (aha) digotin: \"bi rastî (Muhemmed) tepa dikebe(ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم) به‌ڕاستی ئه‌وانه‌ی که بێ باوه‌ڕ بوون کاتێك که گوێیان له قورئان ده‌بێت نزیکه به چاویان هه‌ڵتدێرن، ده‌ڵێن: ئه‌م پێغه‌مبه‌ره ده‌ستی لێ وه‌شێنراوه‌.",
            "verse 68:52": "Lê (Qur´an) bi xweber jî, ji bona hemû heyan şîretk e (hatîye şandinê)له کاتێکدا قورئان ته‌نها بریتیه له یادخستنه‌وه‌و بێدار خه‌ره‌وه‌ی هه‌موو خه‌ڵکی ئه‌م جیهانه (ئه‌گه‌ر تێفکرن)."
        },
        "Kyrgyz": {
            "verse 68:1": "Нун.” (О, Мухаммад), калемге жана ал жазган нерселерге ант ичип (айтамын)",
            "verse 68:2": "Сен Раббиңдин нээматы (пайгамбарлык) себептүү акылынан адашкан киши эмессиң.”",
            "verse 68:3": "(Пайгамбарчылык түйшүгүн көтөргөнүң үчүн) сага түгөнгүс сыйлыктар бар",
            "verse 68:4": "Жана сен улук ахлактын үстүндөсүң",
            "verse 68:5": "Жакында (Кыямат болуп, чындык ашкереленгенде) көрөсүң, алар да көрүп (билип) алышат —",
            "verse 68:6": "Кимиңер азгырылган экениңерди",
            "verse 68:7": "Сенин Раббиң, Өзүнүн жолунан ким адашып кеткенин жана ким Туура Жол тапканын эң жакшы билет",
            "verse 68:8": "(Динди) жалган дегендерге моюн сунба",
            "verse 68:9": "Сеналар менен макул болсоң, алар да сени менен келишип алууну каалашат",
            "verse 68:10": "Сен моюн суна бербегин: көрүнгөн эле кадырсыз анткорго",
            "verse 68:11": "(Адамдардын арасын бузуу үчүн) ушак таратып жүрүүчү шылдыңчыларга",
            "verse 68:12": "Чектен чыккан, күнөөкөр, жакшылыкка бут тосуучуларга",
            "verse 68:13": "Орой жана андан соң.., атасынын дайыны жок (тексиз) адамдарга",
            "verse 68:14": "Ал бай жана перзенти көп болгондуктан",
            "verse 68:15": "ага биздин аяттарыбыз окулганда: «(бул) байыркылардын жөө-жомоктору го»-деди",
            "verse 68:16": "Биз жакында (Кыяматта) аны тумшугунан тамгалап койобуз",
            "verse 68:17": "Биз аларды бак-бостон ээлерин сынаганыбыз сыяктуу сынадык! Бир кезде (бак ээлери) бакты(н түшүмүн) таңга маал (эч ким тура элек мезгилде) жыйнап алууга ант ичишти",
            "verse 68:18": "Алар (ниеттеринде “Аллаһ кааласа” деген сөздү) эсепке алышпады",
            "verse 68:19": "Анан алар уктап жатканда бактын үстүндө Сенин Раббиң тарабынан (жиберилген) бир айлануучу (от) айланып турду (дагы)",
            "verse 68:20": "(Күйдүрүп, чычаласын чыгарганда) караңгы түн сыяктуу болуп калды",
            "verse 68:21": "Анан таң азанда бири-бирин чакырышты",
            "verse 68:22": "«Эгерде (түшүмүңөрдү) жыйнай турган болсоңор эртерээк барбайсыңарбы»",
            "verse 68:23": "(Бардыгы үйүнөн чыгып) жолго түшүштү шыбырашып",
            "verse 68:24": "«Бүгүн силердин үстүңөргө — бактын ичине бир дагы кедей кирип калбасын»",
            "verse 68:25": "Алар эч кимге билдирбей (ушундай катаал, мээримсиз абалда кембагалдарды түшүмдөн) куржалак калтырууга кудуреттүүбүз деп, эрте таңда бара жатышты",
            "verse 68:26": "Анан.., (кара чычала болуп калган) бакты көрүп: «Биз адашып (башка бакка келип) калыптырбыз»-дешти",
            "verse 68:27": "““Жок! Биз (бактан) куржалак калыптырбыз",
            "verse 68:28": "(Ошондо) алардан адилеттүүрөөк бирөөсү: «Мен силерге «Аллаһты даңазалагыла» (“Аллаһ кааласа” деп айткыла) дебедим беле?» -деди",
            "verse 68:29": "(Дагы) айтышты: «Раббибиз (кемчилдиктүү сыпаттардан) Аруу-Таза! Биз (өзүбүзгө) зулум кылуучулардан болуп калдык!»",
            "verse 68:30": "Анан бири-бирине карап, бири-бирин айыптай баштады",
            "verse 68:31": "Жана (мындай) дешти: «Шорубуз курусун! Биз (чындап) чектен чыгып кетиптирбиз",
            "verse 68:32": "Раббибиз анын ордуна андан жакшыраагын бергей эле! Биз Раббибизге умтулуучубузго!»",
            "verse 68:33": "(Азгырылган адамдарга сыноо дүйнөдөгү) азап ушундай! Ал эми, Акырет азабы (мындан) чоңураак, эгер билишсе",
            "verse 68:34": "Албетте, такыба кишилер үчүн Раббисинин алдында эң мыкты бейиштер бар",
            "verse 68:35": "(Эй, Макка мушриктери!) эмне, биз мусулмандарды (силерге окшогон) күнөөкөрлөр сыяктуу кылат бекенбиз",
            "verse 68:36": "Силерге эмне болгон?! Кандай өкүм чыгарып жатасыңар",
            "verse 68:37": "Же силердин алдыңарда аны сабак кылып окуган (Ыйык) Китеп бар беле",
            "verse 68:38": "(Же) Ал (китептин ичинде) силер үчүн өзүңөр каалаган нерсе (бар бекен)",
            "verse 68:39": "Же болбосо, силер үчүн Биздин мойнубузда Кыямат күнүнө чейин жете турган «Силер каалаган (бардык) нерсе(лер) силер үчүн мүмкүн» деген ант-убада бар бекен",
            "verse 68:40": "(О, Мухаммад), алардан сурачы, кимиси буга кепил боло алат",
            "verse 68:41": "Же алардын (каалоо тилектерин орундатып бере турган Аллаһтан башка) кудайлары барбы?! Эгер чынчыл болушса, (ошол) кудай-ларын алып келишсин",
            "verse 68:42": "(Кыямат) күнү Балтыр ачылып, (бардык элдер) сажда кылууга чакырылганда, алар (мушриктер сажда кылууга) жарабай калышат",
            "verse 68:43": "Көздөрү жерге кадалып, аларды кордук орогон абалда (турушат) Алар (дүйнө жашоосунда) сак-саламат болуп (сажда кылууга жарап) турганда саждага чакырылышкан эле",
            "verse 68:44": "(О, Мухаммад!) Сен бул Сөздү (Кураанды) жалган дегендерди Мага кой! Биз аларды билбеген тарабынан эч билгизбей азапка салабыз",
            "verse 68:45": "Мен аларга мөөнөт беремин. Менин амалкерлигим бекем",
            "verse 68:46": "Же болбосо (о, Мухаммад) сен алардан (өзүңдүн дааватың үчүн) акы сурап, алар болсо төлөөдөн кыйналып жатышабы",
            "verse 68:47": "Же алардын алдында кайып (ааламындагы Тагдыр Китеби) барбы (жана) алар (ошондон окугандарын) жазышабы",
            "verse 68:48": "Эми (о, Мухаммад) сен Раббиңдин өкүмүнө сабыр кыл! Балыктын «ээси» (Юнус пайгамбар) сыяктуу (элиңе сабырсыз) болбо! Бир кезде ал (балыктын ичине) жутулган бойдон (кап-караңгы курсакта отуруп) Раббисине дуба кылган болчу",
            "verse 68:49": "Эгерде ага Раббисинин нээматы (жакшылыгы) жетпегенде, жек көрүлгөн абалда жайдак жерге (кароосуз) таштап коюлмак",
            "verse 68:50": "Анан Раббиси аны (кайрадан пайгамбарчылык үчүн) тандап, салих (жакшы) инсандардан кылды",
            "verse 68:51": "(О, Мухаммад) каапыр болгон адамдар зикирди (Кураанды) уккан мезгилде (ичи өрттөнүп) сени көздөрү менен оодара сала жаздашат жана: «Ал жинди!»-дешет",
            "verse 68:52": "Ал (Кураан) бүт ааламдар үчүн (эң даанышман) насаат-эскермеден башка нерсе эмес"
        },
        "Malay": {
            "verse 68:1": "Nuun. Demi Pena dan apa yang mereka tulis, -",
            "verse 68:2": "Engkau (wahai Muhammad) - dengan sebab nikmat pemberian Tuhanmu - bukanlah seorang gila (sebagaimana yang dituduh oleh kaum musyrik, bahkan engkau adalah seorang yang bijaksana).",
            "verse 68:3": "Dan sesungguhnya engkau tetap beroleh pahala yang amat besar, yang tidak putus-putus, (sebagai balasan bagi menjalankan ajaran Islam);",
            "verse 68:4": "Dan bahawa sesungguhnya engkau mempunyai akhlak yang amat mulia.",
            "verse 68:5": "Maka (tidak lama lagi) engkau akan melihat, dan mereka juga akan melihat, -",
            "verse 68:6": "Siapakah orangnya yang gila di antara kamu semua.",
            "verse 68:7": "Sesungguhnya Tuhanmu, Dia lah jua yang lebih mengetahui akan orang yang sesat dari jalanNya, dan Dia lah jua yang lebih mengetahui akan orang-orang yang mendapat petunjuk.",
            "verse 68:8": "Oleh itu (berpegang teguhlah pada ajaran Islam yang sedang engkau amalkan, dan) janganlah engkau menurut kemahuan orang-orang yang mendustakan (ugama Allah).",
            "verse 68:9": "Mereka suka kalaulah engkau bertolak ansur (menurut kemahuan mereka), supaya mereka juga bertolak ansur berlemah-lembut (pada zahirnya terhadapmu).",
            "verse 68:10": "Dan janganlah engkau (berkisar dari pendirianmu yang benar, dan jangan) menurut kemahuan orang yang selalu bersumpah, lagi yang hina (pendapatnya dan amalannya), -",
            "verse 68:11": "Yang suka mencaci, lagi yang suka menyebarkan fitnah hasutan (untuk memecah belahkan orang ramai), -",
            "verse 68:12": "Yang sering menghalangi amalan-amalan kebajikan, yang melanggar hukum-hukum ugama, lagi yang amat berdosa, -",
            "verse 68:13": "Yang jahat kejam, yang selain itu tidak tentu pula bapanya.",
            "verse 68:14": "Adakah kerana ia seorang hartawan dan ramai anak-pinaknya (maka ia mendustakan ugama Kami)? -",
            "verse 68:15": "Apabila dibacakan kepadanya ayat-ayat keterangan Kami, ia berkata: \" (Ini ialah) cerita-cerita dongeng orang-orang dahulu kala\".",
            "verse 68:16": "(Orang yang bersifat demikian, akan didedahkan kehinaannya) - Kami akan adakan tanda di atas hidungnya (yang berupa belalai itu).",
            "verse 68:17": "Sesungguhnya Kami telah timpakan mereka dengan bala bencana, sebagaimana Kami timpakan tuan-tuan punya kebun (dari kaum yang telah lalu), ketika orang-orang itu bersumpah (bahawa) mereka akan memetik buah-buah kebun itu pada esok pagi; -",
            "verse 68:18": "Serta mereka tidak menyebut pengecualian.",
            "verse 68:19": "Maka kebun itu didatangi serta diliputi oleh bala bencana dari Tuhanmu (pada malam hari), sedang mereka semua tidur.",
            "verse 68:20": "Lalu menjadilah ia sebagai kebun yang telah binasa semua buahnya.",
            "verse 68:21": "Kemudian pada pagi-pagi, mereka panggil memanggil antara satu dengan yang lain -",
            "verse 68:22": "(Setengahnya berkata): \"Pergilah pada pagi-pagi ke kebun kamu, kalau betul kamu mahu memetik buahnya\".",
            "verse 68:23": "Lalu berjalanlah mereka sambil berbisik (katanya):",
            "verse 68:24": "\"Pada hari ini, janganlah hendaknya seorang miskin pun masuk ke kebun itu mendapatkan kamu\".",
            "verse 68:25": "Dan pergilah mereka pada pagi-pagi itu, dengan kepercayaan, (bahawa) mereka berkuasa menghampakan fakir miskin dari hasil kebun itu.",
            "verse 68:26": "Sebaik-baik sahaja mereka melihat kebunnya, mereka berkata: \"Sebenarnya kita sesat jalan, (ini bukanlah kebun kita)\".",
            "verse 68:27": "(Setelah mereka perhati dengan teliti, mereka berkata: \"Tidak! Kita tidak sesat), bahkan kita orang-orang yang dihampakan (dari hasil kebun kita, dengan sebab ingatan buruk kita sendiri)\".",
            "verse 68:28": "Berkatalah orang yang bersikap adil di antara mereka: \"Bukankah aku telah katakan kepada kamu (semasa kamu hendak menghampakan orang-orang fakir miskin dari habuannya): amatlah elok kiranya kamu mengingati Allah (serta membatalkan rancangan kamu yang jahat itu) ?\"",
            "verse 68:29": "Mereka berkata (dengan sesalnya): \"Maha Suci Tuhan Kami! Sesungguhnya kami adalah orang-orang yang berlaku zalim!\"",
            "verse 68:30": "Kemudian setengahnya mengadap yang lain, sambil cela-mencela.",
            "verse 68:31": "Mereka berkata: \"Aduhai celakanya kita! Sesungguhnya kita adalah orang-orang yang melampaui batas.",
            "verse 68:32": "\"Semoga Tuhan kita, (dengan sebab kita bertaubat) menggantikan bagi kita yang lebih baik daripada (kebun yang telah binasa) itu; sesungguhnya, kepada Tuhan kita sahajalah kita berharap\".",
            "verse 68:33": "Demikianlah azab seksa (yang telah ditimpakan kepada golongan yang ingkar di dunia), dan sesungguhnya azab hari akhirat lebih besar lagi; kalaulah mereka orang-orang yang berpengetahuan (tentulah mereka beringat-ingat).",
            "verse 68:34": "Sesungguhnya orang-orang yang bertaqwa, disediakan bagi mereka taman-taman Syurga yang penuh nikmat, di sisi Tuhan mereka.",
            "verse 68:35": "Patutkah Kami (berlaku tidak adil, dengan) menjadikan orang-orang Islam (yang taat), sama seperti orang-orang yang berdosa (yang kufur ingkar)?",
            "verse 68:36": "Apa sudah jadi kepada akal kamu? Bagaimana kamu menetapkan hukum (yang terang-terang salahnya itu)?",
            "verse 68:37": "Adakah kamu mempunyai sesebuah Kitab (dari Allah) yang kamu baca dan pelajari?",
            "verse 68:38": "Bahawa di dalam Kitab itu membolehkan kamu mendapat apa sahaja yang kamu pilih?",
            "verse 68:39": "Atau adakah kamu mendapat akuan-akuan yang ditegaskan dengan sumpah dari Kami, yang tetap hingga hari kiamat, menentukan bahawa kamu dapat mencapai apa yang kamu putuskan?",
            "verse 68:40": "Bertanyalah kepada mereka: \"Siapakah orangnya di antara mereka yang menjamin benarnya hukum: bahawa mereka akan mendapat di akhirat apa yang didapati oleh orang Islam?\"",
            "verse 68:41": "Atau adakah mereka mempunyai sekutu-sekutu (yang sefaham dengan mereka? Kalau ada) maka hendaklah mereka membawanya, jika betul mereka orang-orang yang benar.",
            "verse 68:42": "(Ingatkanlah orang-orang yang tidak beriman) akan masa didedahkan kedahsyatan huru-hara (hari kiamat), dan mereka diseru supaya sujud maka mereka tidak dapat melakukannya, -",
            "verse 68:43": "Sambil pandangan mereka tunduk malu, serta mereka diliputi kehinaan; dan sesungguhnya mereka (di dunia) dahulu telahpun diseru supaya sujud (tetapi mereka enggan) sedang mereka dalam keadaan sihat.",
            "verse 68:44": "Biarkanlah Aku sahaja (wahai Muhammad) dengan orang yang mendustakan keterangan Al-Quran ini, Kami akan menarik mereka sedikit demi sedikit (ke jurang kebinasaan), dari arah yang mereka tidak mengetahuinya.",
            "verse 68:45": "Dan Aku akan melanjutkan tempoh untuk mereka; sesungguhnya rancangan sulitKu (terhadap golongan yang kufur ingkar itu), amatlah kuat kukuh.",
            "verse 68:46": "Pernahkah engkau (wahai Muhammad) meminta sebarang bayaran kepada mereka (mengenai ajaran Islam yang engkau sampaikan), lalu mereka merasa berat menanggung bayaran itu (sehingga menjauhkan diri daripada menyahut seruanmu)?",
            "verse 68:47": "Atau adakah di sisi mereka (Lauh Mahfuz yang mengandungi) perkara-perkara yang ghaib lalu mereka menyalin (daripadanya untuk menentang ajaran dan peringatanmu)?",
            "verse 68:48": "Maka bersabarlah (wahai Muhammad) menerima hukum Tuhanmu (memberi tempoh kepada mereka), dan janganlah engkau bersikap seperti orang yang telah ditelan oleh ikan. (Ingatlah kisahnya) ketika ia berdoa merayu dengan keadaan sesak sebak terkurung dalam perut ikan.",
            "verse 68:49": "Kalaulah ia tidak didatangi nikmat pertolongan dari Tuhannya, nescaya tercampaklah ia ke tanah yang tandus (di tepi pantai) dalam keadaan ia ditempelak (kerana salah silapnya).",
            "verse 68:50": "Selepas itu Tuhannya memilihnya, serta menjadikan dia dari orang-orang yang soleh.",
            "verse 68:51": "Dan sesungguhnya orang-orang yang kafir itu, hampir-hampir menggelincir dan menjatuhkanmu dengan pandangan mereka (yang penuh dengan permusuhan dan kebencian), semasa mereka mendengar Al-Quran sambil berkata: \"Sebenarnya (Muhammad) itu, sungguh-sungguh orang gila\".",
            "verse 68:52": "Padahal Al-Quran itu tidak lain hanyalah peringatan bagi umat manusia seluruhnya."
        },
        "Malayalam": {
            "verse 68:1": "നൂന്‍- പേനയും അവര്‍ എഴുതുന്നതും തന്നെയാണ സത്യം.",
            "verse 68:2": "നിന്‍റെ രക്ഷിതാവിന്‍റെ അനുഗ്രഹം കൊണ്ട് നീ ഒരു ഭ്രാന്തനല്ല.",
            "verse 68:3": "തീര്‍ച്ചയായും നിനക്ക് മുറിഞ്ഞ് പോകാത്ത പ്രതിഫലമുണ്ട്‌.",
            "verse 68:4": "തീര്‍ച്ചയായും നീ മഹത്തായ സ്വഭാവത്തിലാകുന്നു.",
            "verse 68:5": "ആകയാല്‍ വഴിയെ നീ കണ്ടറിയും; അവരും കണ്ടറിയും;",
            "verse 68:6": "നിങ്ങളില്‍ ആരാണ് കുഴപ്പത്തിലകപ്പെട്ടവനെന്ന്‌",
            "verse 68:7": "തീര്‍ച്ചയായും നിന്‍റെ രക്ഷിതാവ് അവന്‍റെ മാര്‍ഗം വിട്ടു പിഴച്ചുപോയവരെപ്പറ്റി നല്ലവണ്ണം അറിയുന്നവനാകുന്നു. സന്‍മാര്‍ഗം പ്രാപിച്ചവരെപ്പറ്റിയും അവന്‍ നല്ലവണ്ണം അറിയുന്നവനാകുന്നു.",
            "verse 68:8": "അതിനാല്‍ സത്യനിഷേധികളെ നീ അനുസരിക്കരുത്‌?",
            "verse 68:9": "നീ വഴങ്ങികൊടുത്തിരുന്നെങ്കില്‍ അവര്‍ക്കും വഴങ്ങിത്തരാമായിരുന്നു എന്നവര്‍ ആഗ്രഹിക്കുന്നു.",
            "verse 68:10": "അധികമായി സത്യം ചെയ്യുന്നവനും, നീചനുമായിട്ടുള്ള യാതൊരാളെയും നീ അനുസരിച്ചു പോകരുത്‌.",
            "verse 68:11": "കുത്തുവാക്ക് പറയുന്നവനും ഏഷണിയുമായി നടക്കുന്നവനുമായ",
            "verse 68:12": "നന്‍മക്ക് തടസ്സം നില്‍ക്കുന്നവനും, അതിക്രമിയും മഹാപാപിയുമായ",
            "verse 68:13": "ക്രൂരനും അതിനു പുറമെ ദുഷ്കീര്‍ത്തി നേടിയവനുമായ",
            "verse 68:14": "അവന്‍ സ്വത്തും സന്താനങ്ങളും ഉള്ളവനായി എന്നതിനാല്‍ (അവന്‍ അത്തരം നിലപാട് സ്വീകരിച്ചു.)",
            "verse 68:15": "നമ്മുടെ ദൃഷ്ടാന്തങ്ങള്‍ അവന്ന് വായിച്ചുകേള്‍പിക്കപ്പെട്ടാല്‍ അവന്‍ പറയും; പൂര്‍വ്വികന്‍മാരുടെ പുരാണകഥകള്‍ എന്ന്‌.",
            "verse 68:16": "വഴിയെ (അവന്‍റെ) തുമ്പിക്കൈ മേല്‍ നാം അവന്ന് അടയാളം വെക്കുന്നതാണ്‌.",
            "verse 68:17": "ആ തോട്ടക്കാരെ നാം പരീക്ഷിച്ചത് പോലെ തീര്‍ച്ചയായും അവരെയും നാം പരീക്ഷിച്ചിരിക്കുകയാണ്‌. പ്രഭാതവേളയില്‍ ആ തോട്ടത്തിലെ പഴങ്ങള്‍ അവര്‍ പറിച്ചെടുക്കുമെന്ന് അവര്‍ സത്യം ചെയ്ത സന്ദര്‍ഭം.",
            "verse 68:18": "അവര്‍ (യാതൊന്നും) ഒഴിവാക്കി പറഞ്ഞിരുന്നില്ല.",
            "verse 68:19": "എന്നിട്ട് അവര്‍ ഉറങ്ങിക്കൊണ്ടിരിക്കെ നിന്‍റെ രക്ഷിതാവിങ്കല്‍ നിന്നുള്ള ഒരു ശിക്ഷ ആ തോട്ടത്തെ ബാധിച്ചു.",
            "verse 68:20": "അങ്ങനെ അത് മുറിച്ചെടുക്കപ്പെട്ടത് പോലെ ആയിത്തീര്‍ന്നു.",
            "verse 68:21": "അങ്ങനെ പ്രഭാതവേളയില്‍ അവര്‍ പരസ്പരം വിളിച്ചുപറഞ്ഞു:",
            "verse 68:22": "നിങ്ങള്‍ പറിച്ചെടുക്കാന്‍ പോകുകയാണെങ്കില്‍ നിങ്ങളുടെ കൃഷിസ്ഥലത്തേക്ക് നിങ്ങള്‍ കാലത്തുതന്നെ പുറപ്പെടുക.",
            "verse 68:23": "അവര്‍ അന്യോന്യം മന്ത്രിച്ചു കൊണ്ടു പോയി.",
            "verse 68:24": "ഇന്ന് ആ തോട്ടത്തില്‍ നിങ്ങളുടെ അടുത്ത് ഒരു സാധുവും കടന്നു വരാന്‍ ഇടയാവരുത് എന്ന്‌.",
            "verse 68:25": "അവര്‍ (സാധുക്കളെ) തടസ്സപ്പെടുത്താന്‍ കഴിവുള്ളവരായിക്കൊണ്ടു തന്നെ കാലത്ത് പുറപ്പെടുകയും ചെയ്തു.",
            "verse 68:26": "അങ്ങനെ അത് (തോട്ടം) കണ്ടപ്പോള്‍ അവര്‍ പറഞ്ഞു: തീര്‍ച്ചയായും നാം പിഴവു പറ്റിയവരാകുന്നു.",
            "verse 68:27": "അല്ല, നാം നഷ്ടം നേരിട്ടവരാകുന്നു.",
            "verse 68:28": "അവരുടെ കൂട്ടത്തില്‍ മദ്ധ്യനിലപാടുകാരനായ ഒരാള്‍ പറഞ്ഞു: ഞാന്‍ നിങ്ങളോട് പറഞ്ഞില്ലേ? എന്താണ് നിങ്ങള്‍ അല്ലാഹുവെ പ്രകീര്‍ത്തിക്കാതിരുന്നത്‌?",
            "verse 68:29": "അവര്‍ പറഞ്ഞു: നമ്മുടെ രക്ഷിതാവ് എത്രയോ പരിശുദ്ധന്‍! തീര്‍ച്ചയായും നാം അക്രമികളായിരിക്കുന്നു.",
            "verse 68:30": "അങ്ങനെ പരസ്പരം കുറ്റപ്പെടുത്തിക്കൊണ്ട് അവരില്‍ ചിലര്‍ ചിലരുടെ നേര്‍ക്ക് തിരിഞ്ഞു.",
            "verse 68:31": "അവര്‍ പറഞ്ഞു: നമ്മുടെ നാശമേ! തീര്‍ച്ചയായും നാം അതിക്രമകാരികളായിരിക്കുന്നു.",
            "verse 68:32": "നമ്മുടെ രക്ഷിതാവ് അതിനെക്കാള്‍ ഉത്തമമായത് നമുക്ക് പകരം തന്നേക്കാം. തീര്‍ച്ചയായും നാം നമ്മുടെ രക്ഷിതാവിങ്കലേക്ക് ആഗ്രഹിച്ചു ചെല്ലുന്നവരാകുന്നു.",
            "verse 68:33": "അപ്രകാരമാകുന്നു ശിക്ഷ. പരലോകശിക്ഷയാവട്ടെ കൂടുതല്‍ ഗൌരവമുള്ളതാകുന്നു. അവര്‍ അറിഞ്ഞിരുന്നെങ്കില്‍!",
            "verse 68:34": "തീര്‍ച്ചയായും സൂക്ഷ്മത പാലിക്കുന്നവര്‍ക്ക് അവരുടെ രക്ഷിതാവിങ്കല്‍ അനുഗ്രഹങ്ങളുടെ സ്വര്‍ഗത്തോപ്പുകളുണ്ട്‌.",
            "verse 68:35": "അപ്പോള്‍ മുസ്ലിംകളെ നാം കുറ്റവാളികളെപോലെ ആക്കുമോ?",
            "verse 68:36": "നിങ്ങള്‍ക്കെന്തു പറ്റി? നിങ്ങള്‍ എങ്ങനെയാണ് വിധികല്‍പിക്കുന്നത്‌?",
            "verse 68:37": "അതല്ല, നിങ്ങള്‍ക്കു വല്ല ഗ്രന്ഥവും കിട്ടിയിട്ട് നിങ്ങളതില്‍ പഠനം നടത്തിക്കൊണ്ടിരിക്കുകയാണോ?",
            "verse 68:38": "നിങ്ങള്‍ (യഥേഷ്ടം) തെരഞ്ഞെടുക്കുന്ന കാര്യങ്ങള്‍ നിങ്ങള്‍ക്ക് അതില്‍ (ആ ഗ്രന്ഥത്തില്‍) വന്നിട്ടുണ്ടോ?",
            "verse 68:39": "അതല്ല, ഉയിര്‍ത്തെഴുന്നേല്‍പിന്‍റെ നാളുവരെ എത്തുന്ന - നിങ്ങള്‍ വിധിക്കുന്നതെല്ലാം നിങ്ങള്‍ക്കായിരിക്കുമെന്നതിനുള്ള-വല്ല കരാറുകളും നിങ്ങളോട് നാം ബാധ്യതയേറ്റതായി ഉണ്ടോ?",
            "verse 68:40": "അവരില്‍ ആരാണ് ആ കാര്യത്തിന് ഉത്തരവാദിത്തം ഏല്‍ക്കാനുള്ളത് എന്ന് അവരോട് ചോദിച്ചു നോക്കുക.",
            "verse 68:41": "അതല്ല, അവര്‍ക്ക് വല്ല പങ്കുകാരുമുണ്ടോ? എങ്കില്‍ അവരുടെ ആ പങ്കുകാരെ അവര്‍ കൊണ്ടുവരട്ടെ. അവര്‍ സത്യവാന്‍മാരാണെങ്കില്‍.",
            "verse 68:42": "കണങ്കാല്‍ വെളിവാക്കപ്പെടുന്ന (ഭയങ്കരമായ) ഒരു ദിവസത്തെ നിങ്ങള്‍ ഓര്‍ക്കുക. സുജൂദ് ചെയ്യാന്‍ (അന്ന്‌) അവര്‍ ക്ഷണിക്കപ്പെടും. അപ്പോള്‍ അവര്‍ക്കതിന് സാധിക്കുകയില്ല.",
            "verse 68:43": "അവരുടെ കണ്ണുകള്‍ കീഴ്പോട്ട് താഴ്ന്നിരിക്കും. നിന്ദ്യത അവരെ ആവരണം ചെയ്യും. അവര്‍ സുരക്ഷിതരായിരുന്ന സമയത്ത് സുജൂദിനായി അവര്‍ ക്ഷണിക്കപ്പെട്ടിരുന്നു.",
            "verse 68:44": "ആകയാല്‍ എന്നെയും ഈ വര്‍ത്തമാനം നിഷേധിച്ചു കളയുന്നവരെയും കുടി വിട്ടേക്കുക. അവര്‍ അറിയാത്ത വിധത്തിലൂടെ നാം അവരെ പടിപടിയായി പിടികൂടിക്കൊള്ളാം.",
            "verse 68:45": "ഞാന്‍ അവര്‍ക്ക് നീട്ടിയിട്ട് കൊടുക്കുകയും ചെയ്യും. തീര്‍ച്ചയായും എന്‍റെ തന്ത്രം ശക്തമാകുന്നു.",
            "verse 68:46": "അതല്ല, നീ അവരോട് വല്ല പ്രതിഫലവും ചോദിച്ചിട്ട് അവര്‍ കടബാധയാല്‍ ഞെരുങ്ങിയിരിക്കുകയാണോ?",
            "verse 68:47": "അതല്ല, അവരുടെ അടുക്കല്‍ അദൃശ്യജ്ഞാനമുണ്ടായിട്ട് അവര്‍ എഴുതി എടുത്തു കൊണ്ടിരിക്കുകയാണോ?",
            "verse 68:48": "അതുകൊണ്ട് നിന്‍റെ രക്ഷിതാവിന്‍റെ വിധി കാത്ത് നീ ക്ഷമിച്ചു കൊള്ളുക. നീ മത്സ്യത്തിന്‍റെ ആളെപ്പോലെ (യൂനുസ് നബിയെപ്പോലെ) ആകരുത്‌. അദ്ദേഹം ദുഃഖനിമഗ്നായികൊണ്ട് വിളിച്ചു പ്രാര്‍ത്ഥിച്ച സന്ദര്‍ഭം.",
            "verse 68:49": "അദ്ദേഹത്തിന്‍റെ രക്ഷിതാവിങ്കല്‍ നിന്നുള്ള അനുഗ്രഹം അദ്ദേഹത്തെ വീണ്ടെടുത്തിട്ടില്ലായിരുന്നെങ്കില്‍ അദ്ദേഹം ആ പാഴ്ഭൂമിയില്‍ ആക്ഷേപാര്‍ഹനായിക്കൊണ്ട് പുറന്തള്ളപ്പെടുമായിരുന്നു.",
            "verse 68:50": "അപ്പോള്‍ അദ്ദേഹത്തിന്‍റെ രക്ഷിതാവ് അദ്ദേഹത്തെ തെരഞ്ഞെടുക്കുകയും എന്നിട്ട് അദ്ദേഹത്തെ സജ്ജനങ്ങളുടെ കൂട്ടത്തിലാക്കുകയും ചെയ്തു.",
            "verse 68:51": "സത്യനിഷേധികള്‍ ഈ ഉല്‍ബോധനം കേള്‍ക്കുമ്പോള്‍ അവരുടെ കണ്ണുകള്‍കൊണ്ട് നോക്കിയിട്ട് നീ ഇടറി വീഴുമാറാക്കുക തന്നെ ചെയ്യും. തീര്‍ച്ചയായും ഇവന്‍ ഒരു ഭ്രാന്തന്‍ തന്നെയാണ് എന്നവര്‍ പറയും.",
            "verse 68:52": "ഇത് ലോകര്‍ക്കുള്ള ഒരു ഉല്‍ബോധനമല്ലാതെ മറ്റൊന്നുമല്ല."
        },
        "Norwegian": {
            "verse 68:1": "Ved pennen, og det man skriver!",
            "verse 68:2": "Du er ikke besatt, takket være Guds nåde.",
            "verse 68:3": "Du har velfortjent lønn i vente.",
            "verse 68:4": "Du har en høy karakter.",
            "verse 68:5": "Du vil se, og de vil se,",
            "verse 68:6": "hvem av dere som er hjemsøkt av fristelse.",
            "verse 68:7": "Herren kjenner best hvem som forviller seg bort fra Hans vei, og Han kjenner best hvem som er på rett vei.",
            "verse 68:8": "Hør ikke etter dem som fornekter!",
            "verse 68:9": "De ønsker at du viser kompromissvilje, så vil de gjøre det samme.",
            "verse 68:10": "Hør ikke etter hver foraktelig storsverger,",
            "verse 68:11": "som baktaler folk og går rundt med rykter,",
            "verse 68:12": "som hindrer det som godt er, som begår overtredelser i synd,",
            "verse 68:13": "rå og påtrengende,",
            "verse 68:14": "fordi han har rikdom og sønner.",
            "verse 68:15": "Når Vårt ord fremleses for ham, sier han: «Fabler fra gamle dager.»",
            "verse 68:16": "Vi skal merke ham på snuten!",
            "verse 68:17": "Vi har satt dem på prøve, som Vi satte haveeierne på prøve, da de bedyret at de visselig skulle høste den om morgenen,",
            "verse 68:18": "uten å gjøre unntagelsen («om Gud vil»).",
            "verse 68:19": "Men en hjemsøkelse fra Herren hjemsøkte den mens de sov,",
            "verse 68:20": "og om morgenen var den som en stubbmark.",
            "verse 68:21": "Om morgenen ropte de til hverandre:",
            "verse 68:22": "«Kom dere tidlig av gårde til deres marker, om dere skal høste.»",
            "verse 68:23": "Så drog de av gårde, idet de hvisket til hverandre.",
            "verse 68:24": "«Ingen fattig stakkar skal i dag komme inn til oss.»",
            "verse 68:25": "De gikk tidlig, bestemte og effektive.",
            "verse 68:26": "Men da de fikk se den, sa de: «Vi må ha gått feil,",
            "verse 68:27": "– nei, vi er blitt plyndret!»",
            "verse 68:28": "Den mest rimelige blant dem sa: «Sa jeg ikke til dere: ’Hvorfor gir dere ikke lovprisning?’»",
            "verse 68:29": "Da sa de: «Ære være Herren! Vi handlet visselig ondt.»",
            "verse 68:30": "Og de vendte seg mot hverandre med gjensidige bebreidelser.",
            "verse 68:31": "De sa: «Ve over oss! Vi var oppsetsige.",
            "verse 68:32": "Kanskje Herren vil gi oss en have som er bedre i bytte for den. Til Herren setter vi vårt håp.»",
            "verse 68:33": "Slik er straffen. Men straffen i det hinsidige er større, om de bare visste.",
            "verse 68:34": "De gudfryktige har i vente hos Herren lykksalighetens haver.",
            "verse 68:35": "Skulle Vi vel gjøre de Gud-hengivne lik synderne?",
            "verse 68:36": "Hva er det i veien med dere? Hvordan er det dere vurderer?",
            "verse 68:37": "Eller har dere en Bok som dere studerer?",
            "verse 68:38": "I den ville dere nok finne det dere ønsker!",
            "verse 68:39": "Eller har dere en edsforpliktelse fra Oss, som gjelder til oppstandelsens dag, så dere får det slik som dere vurderer?",
            "verse 68:40": "Spør dem hvem som innestår for dette!",
            "verse 68:41": "Har de kanskje andre guder? Så la dem bringe sine guder, om de snakker sant.",
            "verse 68:42": "Den dag man binder opp om seg i påvente av at noe skal skje, og de beordres til å falle ned, så kan de ikke.",
            "verse 68:43": "Der de står med nedslagne blikk mens fornedrelsen ligger over dem, for de ble kalt på til å falle ned mens de var friske og sunne.",
            "verse 68:44": "Overlat til Meg dem som fornekter dette budskap! Vi skal la dem gå videre, litt etter litt, uten at de er klar over det.",
            "verse 68:45": "Jeg gir dem frist. Sannelig, Min plan står fast.",
            "verse 68:46": "Forlanger du vel betaling av dem, så de nedtynges av gjeld?",
            "verse 68:47": "Eller har de hånd om det skjulte, så de noterer?",
            "verse 68:48": "Vent i tålmod på Herrens avgjørelse, og vær ikke som mannen i fisken (Jonas), som ropte i desperasjon.",
            "verse 68:49": "Hvis ikke Herrens godhet hadde nådd ham, ville han vært kastet opp på en øde strand, og vært en bebreidet.",
            "verse 68:50": "Men Herren utvalgte ham og gav ham plass blant de rettferdige.",
            "verse 68:51": "Sannelig, de vantro er nær ved å få deg til å miste fotfestet med sine blikk når de hører formaningen, og sier: «Han er sannelig besatt!»",
            "verse 68:52": "Men dette er intet annet enn en formaning for all verden!"
        },
        "Pashto": {
            "verse 68:1": "نون۔، قسم دى په قلم او په هغه څه چې دوى يې لیكي",
            "verse 68:2": "چې ته د خپل رب په نعمت (او فضل) سره هېڅ لېونى نه يې",
            "verse 68:3": "او بېشكه چې خاص تا لره یقینًا داسې اجر دى چې قطع كولى به نشي",
            "verse 68:4": "او بېشكه چې ته یقینًا په ډېرو لویو اخلاقو باندې (فايز) يې",
            "verse 68:5": "پس ژر به ته ووینې (اى نبي!) او دوى به هم وویني",
            "verse 68:6": "چې په تاسو كې كوم یو لېونى دى",
            "verse 68:7": "بېشكه ستا رب په هغه چا ښه پوه دى چې د ده له لارې نه ګمراه شوى دى او هم دى په هدایت موندونكو باندې ښه عالم دى",
            "verse 68:8": "نو ته د تكذیب كوونكو خبره مه منه",
            "verse 68:9": "دوى خوښوي چې كاشكې ته نرم شې، نو دوى به هم نرم شي",
            "verse 68:10": "او ته د هر ډېر سوګند خوړونكي، سپك، خبره مه منه",
            "verse 68:11": "چې ډېر عیب ویونكى، چغلۍ لره ډېر چلوونكى دى",
            "verse 68:12": "خير لره ډېر منع كوونكى، له حده تېرېدونكى، سخت ګناهګار دى",
            "verse 68:13": "ډېر بد خویه دى (او) له دغو (عیبونو) نه پس بد اصله (حرامي هم) دى",
            "verse 68:14": "په دې وجه چې دى د مال او زامنو والا دى",
            "verse 68:15": "كله چې ده ته زمونږ ایتونه ولوستل شي (نو) دى وايي: (دا) د ړومبنو خلقو باطلې قصې دي",
            "verse 68:16": "ژر ده چې مونږ به د ده په خلتم (پوزه) باندې داغ كېږدو",
            "verse 68:17": "بېشكه مونږ دوى وازمایل، لكه چې مونږ د باغ خاوندان ازمایلي وو، كله چې هغوى قسمونه وخوړل چې دوى به خامخا ضرور دغه (د باغ مېوې) پرې كړي، په دې حال كې چې سبا كوونكي به وي",
            "verse 68:18": "او دوى استثنا نه كوله (ان شاء الله يې ونه وایه)",
            "verse 68:19": "نو په دغه (باغ) باندې ستا د رب له جانبه یوه طواف كوونكې بلا راچاپېره شوه، په داسې حال كې چې دوى ویده وو",
            "verse 68:20": "نو دغه (باغ داسې) شو، لكه رېبل شوى فصل",
            "verse 68:21": "نو دوى یو بل ته اواز وكړ، په داسې حال كې چې سبا كوونكي وو",
            "verse 68:22": "داسې چې خپل فصل ته سبا وختي ورشئ كه چېرې تاسو لَو كوونكي یئ",
            "verse 68:23": "نو دوى روان شول، په داسې حال كې چې یو له بل سره يې پټې پټې خبرې كولې",
            "verse 68:24": "(داسې) چې دې (باغ) ته دې پر تاسو باندې نن ورځ بېخي هېڅ مسكین داخل نه شي",
            "verse 68:25": "او دوى د نه وركولو په ارادې سره سهار لاړل، په داسې حال كې چې دوى (په خپل خیال كې) قادر وو",
            "verse 68:26": "نو دوى چې كله هغه (باغ) ولیده، ويې ويل: بېشكه مونږ یقینًا لار وركي یو",
            "verse 68:27": "بلكې مونږ محروم كړى شوي یو",
            "verse 68:28": "د دوى منځني (غوره) كس وویل: ایا ما تاسو ته نه و ویلي! ولې تاسو تسبیح نه وایئ",
            "verse 68:29": "(نو) دوى وویل: پاكي ده زمونږ رب لره، بېشكه مونږ ظالمان وو",
            "verse 68:30": "نو د دوى ځینو ځینو نورو ته مخ واړوه، چې یو بل يې ملامته كول",
            "verse 68:31": "دوى وویل: اى زمونږ هلاكته! یقینًا مونږ سركشان وو",
            "verse 68:32": "امېد دى چې زمونږ رب به مونږ ته له دې (باغ) نه غوره په بدل كې راكړي، بېشكه مونږ خپل رب ته رغبت كوونكي یو",
            "verse 68:33": "همداسې عذاب وي او یقینًا د اخرت عذاب تر ټولو لوى دى، كه چېرې دوى پوهېدلى",
            "verse 68:34": "بېشكه د پرهېزګارو لپاره د خپل رب په نیز د نعمتونو جنتونه دی",
            "verse 68:35": "ايا نو مونږ به مسلمانان د مجرمانو په شان كړو؟",
            "verse 68:36": "په تاسو څه شوي دي؟ تاسو څنګه فیصله كوئ!",
            "verse 68:37": "ایا تاسو سره كتاب دى چې په هغه كې تاسو (دا) لولئ؟",
            "verse 68:38": "چې بېشكه تاسو لپاره په دغه (كتاب) كې هغه څه دي چې تاسو يې خوښوئ",
            "verse 68:39": "ایا تاسو لپاره زمونږ په ذمه څه قسمونه (وعدې) شته چې د قیامت د ورځې پورې رسېدونكي دي چې یقینًا تاسو لپاره به خامخا هغه څه وي چې تاسو يې فیصله كوئ",
            "verse 68:40": "ته له دوى نه پوښتنه وكړه چې په دوى كې كوم یو د دغه كار ضامن دى؟",
            "verse 68:41": "ایا د دوى لپاره شریكان شته دى، نو دوى دې خپل (دغه) شریكان راولي، كه چېرې دوى رښتیني وي",
            "verse 68:42": "او (یاده كړه) هغه ورځ چې پنډۍ به بربنډه كړى شي او دوى به سجدې كولو ته راوبلل شي، نو دوى به توان ونه لري",
            "verse 68:43": "په داسې حال كې چې د دوى سترګې به ذلیله (او ټیټې) وي، دوى به ذلت راګېر كړي وي او یقینًا دوى به سجدې كولو ته رابللى شول، په داسې حال كې چې روغ رمټ به وو",
            "verse 68:44": "نو ته ما او هغه څوك پرېږده چې د دغه حدیث (قرآن) تكذیب كوي۔، ژر به مونږ دوى په استدراج كې واچوو (ورو به يې ورو راونيسو) له هغه ځایه چې دوى به نه پوهېږي",
            "verse 68:45": "او زه دوى ته مهلت وركوم۔، بېشكه زما حیله (چل) مضبوط (او محكم) دى",
            "verse 68:46": "ایا ته له دوى نه مزدوري غواړې، نو دوى له (دغه) تاوانه، درانه كړى شوي دي",
            "verse 68:47": "ایا له دوى سره علم غیب دى، نو چې دوى يې لیكي",
            "verse 68:48": "نو ته د خپل رب حكم ته صبر كوه او د كب (مهي) والا (يونس) په شان مه كېږه، كله چې ده اواز وكړ، په داسې حال كې چې له غم نه ډك و",
            "verse 68:49": "كه چېرې داسې نه وى چې ده ته د خپل رب مهرباني ورسېدله (نو) دى به خامخا په سپېره میدان كې غورځول شوى و، په داسې حال كې چې دى به مذموم (ملامت كړى شوى) و",
            "verse 68:50": "نو دى خپل رب غوره كړ، پس دى يې له صالحانو څخه وګرځاوه",
            "verse 68:51": "او بېشكه شان دا دى چې كافران شوي خلق نژدې وو چې تا په خپلو سترګو سره خامخا وښیوي، كله چې دوى ذكر (قرآن) واورېده او دوى وايي چې بېشكه دى خامخا لېونى دى",
            "verse 68:52": "حال دا چې دغه (قرآن) نه دى مګر د عالمونو لپاره نصیحت"
        },
        "Persian": {
            "verse 68:1": "نون، سوگند به قلم و آنچه مى‌نويسند.",
            "verse 68:2": "كه تو، به فضل پروردگارت، ديوانه نيستى.",
            "verse 68:3": "و تو راست پاداشى پايان‌ناپذير.",
            "verse 68:4": "و تو راست خُلقى عظيم.",
            "verse 68:5": "زودا كه تو ببينى و آنها نيز ببينند،",
            "verse 68:6": "كه ديوانگى در كدام يك از شماست.",
            "verse 68:7": "هر آينه پروردگار تو بهتر مى‌داند چه كسى از طريق او گمراه گشته، كه او به ره‌يافتگان داناتر است.",
            "verse 68:8": "پس، از تكذيب كنندگان، اطاعت مكن.",
            "verse 68:9": "دوست دارند كه نرمى كنى تا نرمى كنند.",
            "verse 68:10": "از هر فرومايه‌اى كه بسيار سوگند مى‌خورد، پيروى مكن:",
            "verse 68:11": "عيبجويى كه براى سخن‌چينى اينجا و آنجا مى‌رود،",
            "verse 68:12": "بازدارنده از خير، متجاوز گناهكار،",
            "verse 68:13": "خشن‌مردى، ناشناخته نسب،",
            "verse 68:14": "بدان جهت كه صاحب مال و فرزند است،",
            "verse 68:15": "چون آيات ما بر او خوانده شود، گويد: اساطير پيشينيان است.",
            "verse 68:16": "زودا كه بر بينى‌اش داغ گذاريم.",
            "verse 68:17": "ما آنها را آزموديم، چنان كه صاحبان آن بستانها را آزموديم. آنگاه كه قسم خوردند كه فردا بامداد ميوه‌ها را خواهند چيد.",
            "verse 68:18": "و ان شاء اللّه نگفتند.",
            "verse 68:19": "پس شب‌هنگام كه به خواب بودند آفتى از آسمان آمد،",
            "verse 68:20": "و بستانها سياه شد.",
            "verse 68:21": "و سحرگاهان يكديگر را ندا دادند:",
            "verse 68:22": "اگر مى‌خواهيد ميوه بچينيد، بامدادان به كشتزار خود برويد.",
            "verse 68:23": "به راه افتادند و آهسته مى‌گفتند:",
            "verse 68:24": "كه امروز نبايد بينوايى به بستان شما درآيد.",
            "verse 68:25": "صبحگاهان بدين آهنگ كه مى‌توانند بينوا را منع كنند بيرون شدند.",
            "verse 68:26": "چون بستانهاى خود را ديدند گفتند: راه را گم كرده‌ايم.",
            "verse 68:27": "نه، ما از حاصل محروم شده‌ايم.",
            "verse 68:28": "نيكمردشان گفت: شما را نگفتم؛ چرا خدا را تسبيح نمى‌گوييد؟",
            "verse 68:29": "گفتند: منزه است پروردگار ما، ما ستمكار بوديم.",
            "verse 68:30": "پس زبان به ملامت يكديگر گشودند.",
            "verse 68:31": "گفتند: واى بر ما، ما مردمى سركش بوده‌ايم،",
            "verse 68:32": "باشد كه پروردگار ما در عوض، چيزى بهتر از آن ما را ارزانى دارد. ما به پروردگار خود روى آورده‌ايم.",
            "verse 68:33": "اينچنين است عذاب. و اگر بدانند، عذاب آخرت بزرگ‌تر است.",
            "verse 68:34": "براى پرهيزگاران در نزد پروردگارشان بستانهايى است پرنعمت.",
            "verse 68:35": "آيا با تسليم‌شدگان چون مجرمان رفتار مى‌كنيم؟",
            "verse 68:36": "شما را چه مى‌شود؟ چسان داورى مى‌كنيد؟",
            "verse 68:37": "آيا شما را كتابى است كه از آن مى‌خوانيد؟",
            "verse 68:38": "و هر چه اختيار كنيد در آن هست؟",
            "verse 68:39": "يا با ما پيمانى كه به روز قيامت كشد بسته‌ايد؛ كه به هر چه حكم كنيد حق شما باشد؟",
            "verse 68:40": "از ايشان بپرس كدام يكشان ضامن چنين پيمانى است؟",
            "verse 68:41": "يا آنها را بتانى است؟ اگر راست مى‌گويند بتان خود را بياورند.",
            "verse 68:42": "روزى كه آن واقعه عظيم پديدار شود و آنها را به سجود فرا خوانند، ولى نتوانند.",
            "verse 68:43": "وحشت در چشمانشان پيداست، ذلت بر آنها چيره شده است. پيش از اين نيز آنها را در عين تندرستى به سجده فراخوانده بودند.",
            "verse 68:44": "پس مرا با آنها كه اين سخن را تكذيب مى‌كنند واگذار تا اندك‌اندك، چنان كه درنيابند، فروگيريمشان.",
            "verse 68:45": "و به آنها مهلت دهم. هر آينه مكر من مكرى استوار است.",
            "verse 68:46": "يا از آنان مزدى طلبيده‌اى و اكنون از اداى آن در رنجند؟",
            "verse 68:47": "يا علم غيب مى‌دانند و آنهايند كه مى‌نويسند؟",
            "verse 68:48": "در برابر فرمان پروردگارت صابر باش و چون صاحب ماهى مباش كه با دلى پراندوه ندا در داد.",
            "verse 68:49": "اگر نعمت پروردگارش نبود، در عين بد حالى به صحرايى بى‌آب و گياه مى‌افتاد.",
            "verse 68:50": "پس پروردگارش او را برگزيد و در زمره صالحانش آورد.",
            "verse 68:51": "و كافران چون قرآن را شنيدند نزديك بود كه تو را با چشمان خود به سر درآورند و مى‌گويند كه او ديوانه است،",
            "verse 68:52": "و حال آنكه قرآن براى جهانيان جز اندرزى نيست."
        },
        "Polish": {
            "verse 68:1": "Nun. Na pióro i na to, co oni zapisują!",
            "verse 68:2": "Ty nie jesteś, z łaski twego Pana, człowiekiem opętanym!",
            "verse 68:3": "Zaprawdę, dla ciebie będzie z pewnością nagroda należyta!",
            "verse 68:4": "Zaprawdę, ty jesteś obdarzony wspaniałym charakterem!",
            "verse 68:5": "Zobaczysz niebawem, i oni zobaczą,",
            "verse 68:6": "Który z was jest doświadczony.",
            "verse 68:7": "Zaprawdę, twój Pan wie najlepiej, kto zbłądził z Jego drogi; i On zna najlepiej tych, którzy idą drogą prostą.",
            "verse 68:8": "Nie słuchaj więc tych, którzy obwiniają o kłamstwo!",
            "verse 68:9": "Oni by chcieli, żebyś był łagodny, to i oni byliby łagodni.",
            "verse 68:10": "Nie słuchaj więc: żadnego skorego do przysięgi, nędznego;",
            "verse 68:11": "Potwarcy, szerzącego kalumnie;",
            "verse 68:12": "Tego, który przeszkadza dobru; napastnika, grzesznika;",
            "verse 68:13": "Grubianina, i do tego intruza,",
            "verse 68:14": "Nawet gdy on posiada majątek i synów!",
            "verse 68:15": "Kiedy mu są recytowane Nasze znaki, on mówi: \"To są baśnie dawnych przodków!\"",
            "verse 68:16": "My napiętnujemy go na ryju!",
            "verse 68:17": "Oto doświadczyliśmy ich tak, jak doświadczyliśmy właścicieli ogrodu, kiedy przysięgali, iż z pewnością zbiorą plony rano,",
            "verse 68:18": "A nie uczynili żadnego zastrzeżenia.",
            "verse 68:19": "Wtedy nawiedziło go nieszczęście od twego Pana, podczas gdy oni spali,",
            "verse 68:20": "I rankiem był on całkowicie ścięty.",
            "verse 68:21": "Oni zaś wzywali się wzajemnie rankiem:",
            "verse 68:22": "\"Chodźcież na wasze pole wcześnie, jeśli się zabieracie do ścinania!\"",
            "verse 68:23": "I wyruszyli w drogę, rozmawiając cicho między sobą:",
            "verse 68:24": "\"Żeby żaden biedak nie wszedł tu dziś, wbrew waszej woli.\"",
            "verse 68:25": "I poszli rankiem, zdecydowani co do celu wyznaczonego.",
            "verse 68:26": "Kiedy więc go zobaczyli, powiedzieli: \"Doprawdy zbłądziliśmy!",
            "verse 68:27": "Wcale nie zostaliśmy wszystkiego pozbawieni!\"",
            "verse 68:28": "Najbardziej umiarkowany z nich powiedział: \"Czyż wam nie mówiłem? Dlaczego nie głosicie chwały Boga?\"",
            "verse 68:29": "Powiedzieli: \"Chwała niech będzie naszemu Panu! Zaprawdę, byliśmy niesprawiedliwi!\"",
            "verse 68:30": "Wtedy oni zwrócili się jeden do drugiego, ganiąc się wzajemnie.",
            "verse 68:31": "Mówili: \"Biada nam! Zaprawdę, byliśmy buntownikami!",
            "verse 68:32": "Lecz, być może, nasz Pan da nam w zamian coś lepszego od niego. Zaprawdę, my do naszego Pana kierujemy nasze pragnienia!\"",
            "verse 68:33": "Taka jest kara! Lecz kara życia ostatecznego jest większa. O, gdybyście wiedzieli!",
            "verse 68:34": "Zaprawdę, dla ludzi bogobojnych u Pana są Ogrody Szczęśliwości!",
            "verse 68:35": "Czyż My potraktujemy tych, którzy poddali się całkowicie, tak jak grzeszników?",
            "verse 68:36": "Cóż z wami? Jak sądzicie?",
            "verse 68:37": "Czy nie macie Księgi, w której znajdujecie pouczenie?",
            "verse 68:38": "Zaprawdę, w niej jest dla was to, co z pewnością wybierzecie!",
            "verse 68:39": "I czy nie macie Naszej przysięgi sięgającej aż do Dnia Zmartwychwstania? Zaprawdę, wasze będzie to, co wy sami osądzicie!",
            "verse 68:40": "Zapytaj ich, który z nich to zagwarantuje?!",
            "verse 68:41": "Albo czy oni mają współtowarzyszy? Wtedy niech przyprowadzą swoich współtowarzyszy - jeśli są prawdomówni -",
            "verse 68:42": "W Dniu, kiedy odsłonią się nogi i kiedy wezwani do oddania pokłonów nie będą mogli tego uczynić;",
            "verse 68:43": "Będą mieli opuszczone spojrzenia i okryje ich poniżenie, ponieważ byli wzywani do oddania pokłonów, kiedy jeszcze byli zdrowi i cali.",
            "verse 68:44": "Pozostaw Mnie więc z tymi, którzy za kłamstwo uznali to opowiadanie! My poprowadzimy ich stopniowo tak, iż oni wcale nie będą wiedzieli.",
            "verse 68:45": "I Ja dam im zwłokę, lecz Mój podstęp jest niezachwiany.",
            "verse 68:46": "Czy ty ich zapytasz o wynagrodzenie, skoro sami są obciążeni długiem?",
            "verse 68:47": "Albo czy mają ukrytą wiedzę i czy ją zapisują?",
            "verse 68:48": "Czekaj więc cierpliwie na rozstrzygnięcie twego Pana i nie bądź jak \"człowiek ryby\", wtedy gdy krzyczał, kiedy był udręczony.",
            "verse 68:49": "Gdyby nie dosięgła go dobroć jego Pana, to zostałby wyrzucony na pustkowiu jako człowiek wzgardzony.",
            "verse 68:50": "Ale wybrał go jego Pan i umieścił między sprawiedliwymi.",
            "verse 68:51": "Zaprawdę, ci, którzy nie wierzą, gotowi są wywrócić cię swoimi spojrzeniami; kiedy słyszą napomnienie, mówią: \"Zaprawdę, on jest opętany!\"",
            "verse 68:52": "Lecz to nie co innego, jak tylko przypomnienie dla światów!"
        },
        "Portuguese": {
            "verse 68:1": "Nun, Pelo cálamo e pelo que com ele escrevem,",
            "verse 68:2": "Que tu (ó Mensageiro) não és, pela graça do teu Senhor, um energúmeno!",
            "verse 68:3": "Em verdade, ser-te-á reservada uma infalível recompensa.",
            "verse 68:4": "Porque és de nobilíssimo caráter.",
            "verse 68:5": "Logo verás e eles também verão,",
            "verse 68:6": "Quem, dentre vós, é o aflito!",
            "verse 68:7": "Em verdade, teu Senhor é o mais conhecedor de quem se desvia da Sua senda, assim como é o mais conhecedor dos encaminhados.",
            "verse 68:8": "Não dês, pois, ouvidos aos desmentidores,",
            "verse 68:9": "Porque anseiam para que sejas flexível, para o serem também.",
            "verse 68:10": "E jamais escutes a algum perjuro desprezível,",
            "verse 68:11": "Detrator, mexeriqueiro,",
            "verse 68:12": "Tacanho, transgressor, pecador,",
            "verse 68:13": "Grosseiro e, ademais, intruso.",
            "verse 68:14": "Ainda que possua bens e (numerosos) filhos,",
            "verse 68:15": "Aquele que, quando lhe são recitados os Nossos versículos, diz: São fábulas dos primitivos,",
            "verse 68:16": "Marcá-lo-emos no nariz!",
            "verse 68:17": "Por certo que os provaremos (o povo de Makka) como provamos os donos do pomar, ao decidirem colher os seus frutos ao amanhecer,",
            "verse 68:18": "Sem a invocação (do nome de Deus).",
            "verse 68:19": "Porém, enquanto dormiam, sobreveio-lhes uma centelha do teu Senhor.",
            "verse 68:20": "E, ao amanhecer, estava (o pomar) como se houvesse sido ceifado.",
            "verse 68:21": "E, pela manhã, confabularam mutuamente:",
            "verse 68:22": "Ide aos vossos campos, se quereis colher!",
            "verse 68:23": "Foram, pois, sussurrando:",
            "verse 68:24": "Que não entre hoje (em vosso pomar) nenhum necessitado.",
            "verse 68:25": "E iniciaram a manhã com uma (injusta) resolução.",
            "verse 68:26": "Mas, quando o viram daquele jeito, disseram: Em verdade, estamos perdidos!",
            "verse 68:27": "Em verdade, estamos privados de tudo!",
            "verse 68:28": "E o mais sensato deles disse: Não vos havia dito? Por que não glorificastes (Deus)?",
            "verse 68:29": "Responderam: Glorificado seja o nosso Senhor! Em verdade, fomos iníquos!",
            "verse 68:30": "E começaram a reprovar-se mutuamente.",
            "verse 68:31": "Disseram: Ai de nós, que temos sido transgressores!",
            "verse 68:32": "É possível que o nosso Senhor nos conceda outro (pomar) melhor do que esta, pois voltamo-nos ao nosso Senhor.",
            "verse 68:33": "Tal foi o castigo (desde mundo): mas o castigo da outra vida será ainda maior. Se o soubessem!",
            "verse 68:34": "Em verdade, para os tementes, haverá jardins do prazer, ao lado do seu Senhor.",
            "verse 68:35": "Porventura, consideramos os muçulmanos, tal como os pecadores?",
            "verse 68:36": "O que há convosco? Como julgais assim?",
            "verse 68:37": "Ou, acaso, tendes algum livro em que aprendeis,",
            "verse 68:38": "A conseguir o que preferis?",
            "verse 68:39": "Ou possuís, acaso, a Nossa promessa formal, até ao Dia da Ressurreição, de conseguirdes tudo o que desejardes?",
            "verse 68:40": "Pergunta-lhes qual deles está disposto a assegurar isto?",
            "verse 68:41": "Ou têm, acaso, parceiros (junto a Mim)? Que os apresentem, pois, se estiverem certos!",
            "verse 68:42": "No dia em que a perna fica nua, em que forem convocados à prostração e não o conseguirem.",
            "verse 68:43": "Seus olhares serão de humilhação, cobertos de ignomínia, porque foram convidados à prostração, enquanto podiam cumpri-la (e se recusaram).",
            "verse 68:44": "Deixe-Me, pois, a sós com os que desmentem esta Mensagem. Logo os aproximaremos do castigo, gradualmente, de onde menos esperam.",
            "verse 68:45": "E os tolerarei, porque o Meu plano é firme.",
            "verse 68:46": "Acaso lhes exiges recompensa e por isso lhes pesa o débito?",
            "verse 68:47": "Ou estão de posse do incognoscível, e podem descrevê-lo?",
            "verse 68:48": "Persevera, pois (ó Mensageiro), até ao juízo do teu Senhor, e não sejas como aquele que foi engolido pela baleia (Jonas), quando, angustiado, (Nos) invocou.",
            "verse 68:49": "Se não o tivesse alcançado a graça do seu Senhor, certamente teria sido arrojado sobre a orla desértica, em desgraça.",
            "verse 68:50": "Porém, o Senhor o elegeu e o contou entre os virtuosos.",
            "verse 68:51": "Se pudessem, os incrédulos far-te-iam vacilar, com os seus olhares (de rancor), ao ouvirem a Mensagem. E dizem: Em verdade, é um energúmeno!",
            "verse 68:52": "E este (Alcorão) não é mais do que uma mensagem para todo o universo."
        },
        "Punjabi": {
            "verse 68:1": "ਨੂਨ, ਕਲਮ ਦੀ ਅਤੇ ਜਿਹੜੇ (ਕਲਮਾਂ ਵਾਲੇ) ਲਿਖਦੇ ਹਨ, ਉਸ ਦੀ ਸੰਹੁ।",
            "verse 68:2": "ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਦੀ ਕਿਰਪਾ ਨਾਲ ਦੀਵਾਨੇ ਨਹੀਂ ਹੋ।",
            "verse 68:3": "ਅਤੇ ਬੇਸ਼ੱਕ ਤੁਹਾਡੇ ਲਈ ਬਦਲਾ ਹੈ ਕਦੇ ਨਾ ਮੁੱਕਣ ਵਾਲਾ।",
            "verse 68:4": "ਅਤੇ ਬੇਸ਼ੱਕ ਤੁਸੀਂ ਇੱਕ ਉੱਚੇ ਇਖ਼ਲਾਕ ਤੇ ਹੋ।",
            "verse 68:5": "ਸੋ ਬਹੁਤ ਛੇਤੀ ਹੀ ਤੁਸੀਂ ਦੇਖੋਗੇ ਅਤੇ ਉਹ ਵੀ ਦੇਖਣਗੇ।",
            "verse 68:6": "ਕਿ ਤੁਹਾਡੇ ਵਿਚੋਂ ਕਿਸ ਨੂੰ ਝੱਲਪੁਣਾ (ਦੀਵਾਨਾਪਣ) ਹੈ",
            "verse 68:7": "ਤੁਹਾਡਾ ਰੱਬ ਹੀ ਚੰਗੀ ਤਰਾਂ ਜਾਣਦਾ ਹੈ, ਜਿਹੜਾ ਉਸ ਦੇ ਰਾਹ ਤੋਂ ਭਟਕਿਆ ਹੋਇਆ ਹੈ ਅਤੇ ਉਹ ਰਾਹ ਤੇ ਚੱਲਣ ਵਾਲਿਆਂ ਨੂੰ ਵੀ ਚੰਗੀ ਤਰਾਂ ਜਾਣਦਾ ਹੈ।",
            "verse 68:8": "ਸੋ ਤੁਸੀਂ ਇਨ੍ਹਾਂ ਝੁਠਲਾਉਣ ਵਾਲਿਆਂ ਦਾ ਕਿਹਾ ਨਾ ਮੰਨੋਂ।",
            "verse 68:9": "ਉਹ ਚਾਹੁੰਦੇ ਹਨ ਕਿ ਤੁਸੀਂ ਨਰਮ ਪੈ ਜਾਵੋ, ਤਾਂ ਉਹ ਵੀ ਨਰਮ ਪੈ ਜਾਣਗੇ।",
            "verse 68:10": "ਅਤੇ ਤੁਸੀਂ ਅਜਿਹੇ ਬੰਦੇ ਦਾ ਕਹਿਣਾ ਨਾ ਮੰਨੋ, ਜਿਹੜਾ ਬਹੁਤਾ ਸਹੁੰਆਂ ਖਾਣ ਵਾਲਾ ਹੋਵੇ",
            "verse 68:11": "ਅਤੇ ਸ਼ੇਕਦਰਾ ਹੋਵੇ, ਵਿਅੰਗ ਕਰਨ ਵਾਲਾ ਹੋਵੇ, ਜ਼ੁਗਲੀਆਂ ਕਰਦਾ ਫਿਰਦਾ ਹੋਵੇ।",
            "verse 68:12": "ਚੰਗੇ ਕੰਮਾਂ ਤੋਂ ਰੋਕਣ ਵਾਲਾ ਹੋਵੇ, ਹੱਦਾਂ ਦਾ ਉਲਘੰਣ ਕਰਨ ਵਾਲਾ ਹੋਵੇ, ਬੇਈਮਾਨੀ ਕਰਨ ਵਾਲਾ ਹੋਵੇ।",
            "verse 68:13": "ਪੱਥਰ ਦਿਲ ਹੋਵੇ ਅਤੇ ਇਸ ਤੋਂ ਵੱਧ ਕੇ ਬਦ ਜ਼ਾਤ ਹੋਵੇ।",
            "verse 68:14": "ਇਸ ਲਈ ਕਿ ਉਹ ਦੌਲਤ ਅਤੇ ਔਲਾਦ ਵਾਲਾ ਹੈ।",
            "verse 68:15": "ਜਦੋਂ ਉਸ ਨੂੰ ਸਾਡੀਆਂ ਆਇਤਾਂ ਪੜ੍ਹ ਕੇ ਸੁਣਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ, ਤਾਂ ਉਹ ਆਖਦਾ ਹੈ ਕਿ ਇਹ ਪਹਿਲਾਂ ਹੋ ਚੁੱਕਿਆਂ ਦੀਆਂ ਪ੍ਰਮਾਣਾਂ ਤੋਂ ਰਹਿਤ ਗੱਲਾਂ ਹਨ।",
            "verse 68:16": "ਜਲਦੀ ਹੀ ਅਸੀਂ ਉਸ ਦੇ ਨੱਕ ਨੂੰ ਦਾਗੀ ਕਰਾਂਗੇ।",
            "verse 68:17": "ਅਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਇਮਤਿਹਾਨ ਵਿਚ ਪਾਇਆ, ਜਿਸ ਤਰਾਂ ਅਸੀਂ ਸ਼ਾਗ ਵਾਲਿਆਂ ਨੂੰ ਇਮਤਿਹਾਨ ਵਿਚ ਪਾਇਆ ਸੀ। ਜਦੋਂ’ ਉਨ੍ਹਾਂ ਨੇ ਸਹੁੰ ਖਾਧੀ ਸੀ ਕਿ ਉਹ ਸਵੇਰੇ ਸ਼ਾਮ ਜ਼ਰੂਰ ਉਸ ਦਾ ਫ਼ਲ ਤੋੜ ਲੈਣਗੇ।",
            "verse 68:18": "ਉਨ੍ਹਾਂ ਨੇ ਇੰਨਸ਼ਾਂ ਅੱਲਾਹ (ਅੱਲਾਹ ਨੇ ਚਾਹਿਆ) ਨਹੀ ਕਿਹਾ।",
            "verse 68:19": "ਸੋ ਉਸ ਬਾਗ਼ ਤੇ ਤੇਰੇ ਰੱਬ ਵੱਲੋਂ ਇੱਕ ਫਿਰਨ ਵਾਲਾ ਫਿਰ ਗਿਆ ਅਤੇ ਉਹ ਸੌ ਰਹੇ ਸੀ।",
            "verse 68:20": "ਸੋ ਉਹ ਇਉਂ ਹੋ ਗਿਆ ਜਿਵੇਂ ਕੱਟੀ ਹੋਈ ਫ਼ਸਲ।",
            "verse 68:21": "ਸੋ ਸਵੇਰੇ ਉਨ੍ਹਾਂ ਨੇ ਇੱਕ ਦੂਜੇ ਨੂੰ ਪੁਕਾਰਿਆ।",
            "verse 68:22": "ਕਿ ਸਵੇਰੇ ਆਪਣੇ ਖੇਤ ਚੱਲੋਂ, ਜੇਕਰ ਤੁਸੀਂ ਫ਼ਲ ਤੋੜਨਾ ਹੈ।",
            "verse 68:23": "ਫਿਰ ਉਹ ਚੱਲ ਪਏ ਅਤੇ ਹੌਲੀ ਹੌਲੀ ਕਹਿ ਰਹੇ ਸਨ।",
            "verse 68:24": "ਕਿ ਅੱਜ ਕੋਈ ਕੰਗਾਲ ਤੁਹਾਡੇ ਕੋਲ ਬਾਗ਼ ਵਿਚ ਨਾ ਆ ਸਕੇ।",
            "verse 68:25": "ਅਤੇ ਉਹ ਆਪਣੇ ਆਪ ਨੂੰ ਸਮਰੱਥ ਸਮਝ ਕੇ ਤੂਰੇ। (ਜਿਵੇਂ ਖੇਤੀ ਤੇ ਪੂਰਨ ਅਧਿਕਾਰ ਰੱਖਦੇ ਹੋਣ)",
            "verse 68:26": "ਫਿਰ ਜਦੋਂ ਬਾਗ਼ ਨੂੰ (ਉਜੜਿਆ) ਦੇਖਿਆ ਤਾਂ ਆਖਣ ਲੱਗੇ ਕਿ ਅਸੀਂ ਰਾਹ ਭੁੱਲ ਗਏ।",
            "verse 68:27": "ਸਗੋਂ ਅਸੀਂ ਵਾਂਝੇ ਗਏ।",
            "verse 68:28": "ਉਨ੍ਹਾਂ ਵਿਚੋਂ ਜਿਹੜਾ ਬਿਹਤਰ ਬੰਦਾ ਸੀ, ਉਸ ਨੇ ਆਖਿਆ ਕਿ ਮੈਂ’ ਤੁਹਾਨੂੰ ਕਿਹਾ ਨਹੀਂ ਸੀ ਕਿ ਤੁਸੀ ਲੋਕ ਸਿਫ਼ਤ ਸਲਾਹ ਕਿਉਂ ਨਹੀਂ ਕਰਦੇ।",
            "verse 68:29": "ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਸਾਡਾ ਰੱਬ ਪਵਿੱਤਰ ਹੈ। ਬੇਸ਼ੱਕ ਅਸੀਂ ਜ਼ਾਲਿਮ ਸੀ।",
            "verse 68:30": "ਫਿਰ ਉਹ ਆਪਿਸ ਵਿਚ ਇੱਕ ਦੂਜੇ ਤੇ ਦੌਸ਼ ਲਾਉਣ ਲੱਗੇ।",
            "verse 68:31": "ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਸਾਨੂੰ ਅਫਸੋਸ ਹੈ, ਬੇਸ਼ੱਕ ਅਸੀਂ ਹੱਦਾਂ ਦਾ ਉਲੰਘਣ ਕਰਨ ਵਾਲੇ ਸੀ।",
            "verse 68:32": "ਉਮੀਦ ਹੈ ਕਿ ਸਾਡਾ ਰੱਬ ਸਾਨੂੰ ਇਸ ਤੋਂ ਵੀ ਵਧੀਆ ਬਾਗ਼ ਇਸ ਦੇ ਬਦਲੇ ਵਿਚ ਦੇ ਦੇਵੇ। ਅਸੀਂ ਉਸ ਵੱਲ ਹੀ ਮੁੜਦੇ ਹਾਂ।",
            "verse 68:33": "ਆਫ਼ਤ ਇਸ ਤਰਾਂ ਹੀ ਆਉਂਦੀ ਹੈ ਅਤੇ ਪ੍ਰਲੋਕ ਦੀ ਸਜ਼ਾ ਇਸ ਤੋਂ ਵੀ ਵੱਡੀ ਹੈ। ਕਾਸ਼! ਇਹ ਲੋਕ ਜਾਣਵੇ।",
            "verse 68:34": "ਬੇਸ਼ੱਕ ਡਰਨ ਵਾਲਿਆਂ ਲਈ ਉਨ੍ਹਾਂ ਦੇ ਰੱਬ ਦੇ ਕੋਲ ਨਿਅਮਤਾਂ ਦੇ ਬਾਗ਼ ਹਨ।",
            "verse 68:35": "ਕੀ ਅਸੀਂ ਆਗਿਆਕਾਰੀਆਂ ਨੂੰ ਅਵੱਗਿਆਕਾਰੀਆਂ ਦੇ ਬਰਾਬਰ ਕਰ ਦੇਵਾਂਗੇ",
            "verse 68:36": "ਤੁਹਾਨੂੰ ਕੀ ਹੋਇਆ ਤੁਸੀਂ ਕਿਹੋ ਜਿਹਾ ਫ਼ੈਸਲਾ ਕਰਦੇ ਹੋ।",
            "verse 68:37": "ਕੀ ਤੁਹਾਡੇ ਕੋਲ ਕੋਈ ਕਿਤਾਬ ਹੈ। ਜਿਸ ਵਿਚੋਂ ਤੁਸੀਂ ਪੜ੍ਹਦੇ ਹੋ।",
            "verse 68:38": "ਇਸ ਵਿਚ ਤੁਹਾਡੇ ਲਈ ਉਹ ਹੈ, ਜਿਸ ਨੂੰ ਤੁਸੀਂ ਪਸੰਦ ਕਰਦੇ ਹੋ।",
            "verse 68:39": "ਕੀ ਰਹਿਣਗੀਆਂ, ਕਿ ਤੁਹਾਡੇ ਲਈ ਉਹੀ ਕੁਝ ਹੈ। ਜਿਹੜਾ ਤੁਸੀਂ ਚਾਹੋਗੇ।",
            "verse 68:40": "ਇਨ੍ਹਾਂ ਨੂੰ ਪੁੱਛੋ ਕਿ ਇਨ੍ਹਾਂ ਵਿਚੋ ਉਸ ਦਾ ਜ਼ਿੰਮੇਦਾਰ ਕੌਣ ਹੈ।",
            "verse 68:41": "ਕੀ ਉਨ੍ਹਾਂ ਲਈ ਕੁਝ ਹੋਰ ਵੀ ਸ਼ਰੀਕ (ਭਾਈਵਾਲ) ਹਨ, ਤਾਂ ਉਹ ਆਪਣੇ ਸ਼ਰੀਕਾਂ ਨੂੰ ਲਿਆਉਣ, ਜੇਕਰ ਉਹ ਸੱਚੇ ਹੋਣ।",
            "verse 68:42": "ਜਿਸ ਦਿਨ ਅਸਲੀਅਤ ਤੋਂ ਪਰਦਾ ਜ਼ੁੱਕਿਆ ਜਾਵੇਗਾ। ਅਤੇ ਲੋਕ ਸਿਜਦੇ ਲਈ ਸੱਦੇ ਜਾਣਗੇ। ਤਾਂ ਉਹ ਸਿਜਦਾ ਨਾ ਕਰ ਸਕਣਗੇ।",
            "verse 68:43": "ਉਨ੍ਹਾਂ ਦੀਆਂ ਨਜ਼ਰਾਂ ਝੂਕੀਆਂ ਹੋਣਗੀਆਂ। ਉਨ੍ਹਾਂ ਤੇ ਅਨਾਦਰ ਛਾਇਆ ਹੋਵੇਗਾ। ਅਤੇ ਉਹ ਸਿਜਦਾ ਲਈ ਸੱਦੇ ਜਾਂਦੇ ਸੀ। ਉਹ ਰਿਸ਼ਟ ਪੂਸ਼ਟ ਸਨ।",
            "verse 68:44": "ਸੋ ਮੈਨੂੰ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਛੱਡੋ, ਜਿਹੜੇ ਇਸ ਬਾਣੀ ਨੂੰ ਝੁਠਲਾਉਂਦੇ ਹਨ, ਅਸੀਂ’ ਉਨ੍ਹਾਂ ਨੂੰ ਹੌਲੀ ਹੌਲੀ ਉਥੋਂ ਲਿਆ ਰਹੇ ਹਾਂ, ਜਿਥੋਂ ਉਹ ਨਹੀਂ ਜਾਣਦੇ।",
            "verse 68:45": "ਅਤੇ ਮੈਂ ਉਨ੍ਹਾਂ ਨੂੰ ਮੌਕਾ ਦੇ ਰਿਹਾ ਹਾਂ, ਬੇਸ਼ੱਕ ਮੇਰੀ ਪਕੜ ਬਹੁਤ ਮਜ਼ਸ਼ੂਤ ਹੈ।",
            "verse 68:46": "ਕੀ ਤੁਸੀਂ’ ਇਨ੍ਹਾਂ ਤੋਂ ਕੁਝ ਸੇਵਾ ਫ਼ਲ (ਮਿਹਨਤਾਨਾ? ਮੰਗਦੇ ਹੋ। ਕਿ ਉਹ ਚੱਟੀ (ਤਾਵਾਨ) ਦੇ ਭਾਰ ਥੱਲੇ ਦੱਬੇ ਜਾ ਰਹੇ ਹਨ।",
            "verse 68:47": "ਜਾਂ ਉਨ੍ਹਾਂ ਦੇ ਕੋਲ ਗਾਇਬ ਦੀ ਜਾਣਕਾਰੀ ਹੈ, ਜੋ ਉਹ ਲਿਖ ਰਹੇ ਹਨ",
            "verse 68:48": "ਸੋ ਆਪਣੇ ਰੱਬ ਦੇ ਫ਼ੈਸਲੇ ਤੱਕ ਹੌਸਲਾ ਰੱਖੋਂ ਅਤੇ ਮੱਛੀ (ਦੀ ਬੁਰਕੀ ਬਨਣ) ਵਾਲੇ (ਯੂਨਸ) ਦੀ ਤਰ੍ਹਾਂ ਨਾ ਬਣ ਜਾਉ, ਜਦੋਂ ਉਸ ਨੇ ਪੁਕਾਰਿਆ ਤਾਂ ਉਹ ਦੁੱਖ ਨਾਲ ਭਰਿਆ ਹੋਇਆ ਸੀ।",
            "verse 68:49": "ਜੇਕਰ ਉਸ ਦੇ ਰੱਬ ਦੀ ਕਿਰਪਾ ਉਸ ਦੇ ਨਾਲ ਨਾ ਹੁੰਦੀ ਤਾਂ ਉਹ ਬੇਕਦਰਾ ਹੋ ਕੇ ਰੜੇ ਮੈਦਾਨ ਵਿਚ ਸੁੱਟ ਦਿੱਤਾ ਜਾਂਦਾ।",
            "verse 68:50": "ਫਿਰ ਉਸ ਦੇ ਰੱਬ ਨੇ ਉਸ ਨੂੰ ਸਨਮਾਨਿਤ ਕੀਤਾ। ਸੋ ਉਸ ਨੂੰ ਸਦਾਚਾਰੀਆਂ ਵਿਚ ਸ਼ਾਮਿਲ ਕਰ ਦਿੱਤਾ ਗਿਆ।",
            "verse 68:51": "ਅਤੇ ਇਹ ਅਵੱਗਿਆਕਾਰੀ ਲੋਕ ਜਦੋਂ ਉਪਦੇਸ਼ ਨੂੰ ਸੁਣਦੇ ਹਨ, ਤਾਂ ਇਸ ਤਰਾਂ ਤੁਹਾਨੂੰ ਦੇਖਦੇ ਹਨ, ਜਿਵੇ ਸਮਝੋ ਆਪਣੀ ਨਜ਼ਰ ਨਾਲ ਤੁਹਾਨੂੰ ਬਹਿਕਾ ਦੇਣਗੇ ਅਤੇ ਆਖਦੇ ਹਨ ਕਿ ਇਹ ਜ਼ਰੂਰ ਦੀਵਾਨਾ ਹੈ।",
            "verse 68:52": "ਅਤੇ ਉਹ ਸੰਸਾਰ ਵਾਲਿਆਂ ਲਈ ਸਿਰਫ਼ ਇੱਕ ਉਪਦੇਸ਼ ਹੈ।"
        },
        "Roman english": {
            "verse 68:1": "Noon; walqalami wa maa yasturoon",
            "verse 68:2": "Maa anta bini`mati Rabbika bimajnoon",
            "verse 68:3": "Wa inna laka la ajran ghaira mamnoon",
            "verse 68:4": "Wa innaka la`alaa khuluqin `azeem",
            "verse 68:5": "Fasatubsiru wa yubsiroon",
            "verse 68:6": "Bi ayyikumul maftoon",
            "verse 68:7": "Innaa Rabbaka Huwa a`lamu biman dalla `an sabeelihee wa Huwa a`lamu bilmuhtadeen",
            "verse 68:8": "Falaa tuti`il mukazzibeen",
            "verse 68:9": "Waddoo law tudhinu fa-yudhinoon",
            "verse 68:10": "Wa laa tuti` kulla hallaa fim maheen",
            "verse 68:11": "Hammaazim mash shaaa`im binameem",
            "verse 68:12": "Mannaa`il lilkhairi mu`tadin aseem",
            "verse 68:13": "Utullim ba`da zaalika zaneem",
            "verse 68:14": "An kaana zaa maalinw-wa baneen",
            "verse 68:15": "Izaa tutlaa `alaihi aayaatunaa qaala asaateerul awwaleen",
            "verse 68:16": "Sanasimuhoo `alal khurtoom",
            "verse 68:17": "Innaa balawnaahum kamaa balawnaaa As-haabal jannati iz `aqsamoo la-yasri munnahaa musbiheen",
            "verse 68:18": "Wa laa yastasnoon",
            "verse 68:19": "Fataafa `alaihaa taaa`i fum mir rabbika wa hum naaa`imoon",
            "verse 68:20": "Fa asbahat kassareem",
            "verse 68:21": "Fatanaadaw musbiheen",
            "verse 68:22": "Anighdoo `alaa harsikum in kuntum saarimeen",
            "verse 68:23": "Fantalaqoo wa hum yatakhaafatoon",
            "verse 68:24": "Al laa yadkhulannahal yawma `alaikum miskeen",
            "verse 68:25": "Wa ghadaw `alaa hardin qaadireen",
            "verse 68:26": "Falammaa ra awhaa qaalooo innaa ladaaalloon",
            "verse 68:27": "Bal nahnu mahroomoon",
            "verse 68:28": "Qaala awsatuhum alam aqul lakum law laa tusabbihoon",
            "verse 68:29": "Qaaloo subhaana rabbinaaa innaa kunnaa zaalimeen",
            "verse 68:30": "Fa aqbala ba`duhum `alaa ba`diny yatalaawamoon",
            "verse 68:31": "Qaaloo yaa wailanaaa innaa kunnaa taagheen",
            "verse 68:32": "Asaa rabbunaaa any yubdilanaa khairam minhaaa innaaa ilaa rabbinaa raaghiboon",
            "verse 68:33": "Kazaalikal azaab, wa la`azaabul aakhirati akbar; law kaanoo ya`lamoon",
            "verse 68:34": "Inna lilmuttaqeena `inda rabbihim jannaatin na`eem",
            "verse 68:35": "Afanaj`alul muslimeena kalmujrimeen",
            "verse 68:36": "Maa lakum kaifa tahhkumoon",
            "verse 68:37": "Am lakum kitaabun feehi tadrusoon",
            "verse 68:38": "Inna lakum feehi lamaa takhaiyaroon",
            "verse 68:39": "Am lakum aymaanun `alainaa baalighatun ilaa yawmil qiyaamati inna lakum lamaa tahkumoon",
            "verse 68:40": "Salhum ayyuhum bizaa lika za`eem",
            "verse 68:41": "Am lahum shurakaaa`u falyaatoo bishurakaaa `ihim in kaanoo saadiqeen",
            "verse 68:42": "Yawma yukshafu `am saaqinw wa yud`awna ilas sujoodi falaa yastatee`oon",
            "verse 68:43": "Khaashi`atan absaaruhum tarhaquhum zillatunw wa qad kaanoo yud`awna ilassujoodi wa hum saalimoon",
            "verse 68:44": "Fazarnee wa many yukazzibu bihaazal hadeesi sanastad rijuhum min haisu laa ya`lamoon",
            "verse 68:45": "Wa umlee lahum; inna kaidee mateen",
            "verse 68:46": "Am tas`aluhum ajran fahum mim maghramim musqaloon",
            "verse 68:47": "Am `indahumul ghaibu fahum yaktuboon",
            "verse 68:48": "Fasbir lihkmi rabbika wa laa takun kasaahibil boot; iz naadaa wa huwa makzoom",
            "verse 68:49": "Law laaa an tadaara kahoo ni`matum mir rabbihee lanubiza bil`araaa`i wa huwa mazmoom",
            "verse 68:50": "Fajtabaahu rabbuhoo faja`alahoo minas saaliheen",
            "verse 68:51": "Wa iny-yakaadul lazeena kafaroo la-yuzliqoonaka biabsaarihim lammaa saml`uz-Zikra wa yaqooloona innahoo lamajnoon",
            "verse 68:52": "Wa maa huwa illaa zikrul lil`aalameen"
        },
        "Russian": {
            "verse 68:1": "Нун. Клянусь пером и тем, что они пишут!",
            "verse 68:2": "По милости Владыки твоего Ты, (Мухаммад), неодержим",
            "verse 68:3": "И для тебя назначены дары, Поистине, неистощимы",
            "verse 68:4": "И нрав возвышенный тебе (дарован).",
            "verse 68:5": "Увидишь ты, Увидят и они -",
            "verse 68:6": "Которые из вас поражены безумьем.",
            "verse 68:7": "Поистине, Господь твой знает лучше, Которые из вас сошли с Его пути, И лучше знает тех, кто следует Его дорогой.",
            "verse 68:8": "А потому ты не прислушивайся к тем, Кто ложью нарекает (Откровения святые).",
            "verse 68:9": "Они хотят, чтоб ты был более уступчив, - Тогда бы и они с тобою были мягче.",
            "verse 68:10": "Не следуй всякому презренному любителю поклясться,",
            "verse 68:11": "Клеветнику, носителю злословья,",
            "verse 68:12": "Погрязшему в грехах и злодеяньях И отвлекающему от благого,",
            "verse 68:13": "Жестокому, безродному к тому ж,",
            "verse 68:14": "Будь у него большое достоянье и (много) сыновей.",
            "verse 68:15": "Когда ему Послание от Нас читают, Он отвечает: \"Это сказы первых!\"",
            "verse 68:16": "Наложим Мы узду на его нос!",
            "verse 68:17": "Мы точно так же испытали их, Как испытали Мы владельцев сада, Когда они, (забыв про оговорку), поклялись, Что поутру плоды все срежут,",
            "verse 68:18": "Не сделав в этом оговорки (На часть плодов, что бедным надлежит отдать).",
            "verse 68:19": "Когда же были в сон они погружены, На сад со всех сторон от Бога твоего обрушилась погибель.",
            "verse 68:20": "Наутро сад весь черным стал, как будто был он срезан.",
            "verse 68:21": "А поутру, созвав друг друга, (Братья) говорили:",
            "verse 68:22": "Коль урожай собрать хотите, Вы ранним утром в сад должны пойти.",
            "verse 68:23": "И вот отправились они, Переговариваясь потихоньку:",
            "verse 68:24": "Пусть ни один бедняк (презренный) В наш сад сегодня не войдет.",
            "verse 68:25": "И шли они с решеньем (твердым) (Свой замысел) осуществить.",
            "verse 68:26": "Едва завидев сад, (В отчаянье) воскликнули они: \"Поистине, сошли мы с верного пути!",
            "verse 68:27": "Теперь и мы уж лишены (Плодов всех нашего труда)\".",
            "verse 68:28": "И тут один из них, кто был разумнее других, Сказал: \"Ужель я вам не говорил, Что славить вы должны Аллаха?\"",
            "verse 68:29": "Да будет славен наш Господь! - они сказали. - Поистине, неправыми мы были!",
            "verse 68:30": "И стали упрекать они друг друга,",
            "verse 68:31": "Говоря: \"О, горе нам! Мы были нарушителями (Божьей воли).",
            "verse 68:32": "Быть может, наш Господь Нам сад в замену даст еще прекрасней, - Ведь мы к Нему пришли (в раскаянии добром)!\"",
            "verse 68:33": "Вот наказание (в сей жизни), В другой же жизни - наказание еще страшней. О, если б они только знали!",
            "verse 68:34": "Поистине, Сады услады ждут людей, Кто гнева Божьего страшится.",
            "verse 68:35": "Ужель Мы равно отнесемся И к мусульманам, и к неверным?",
            "verse 68:36": "Что с вами? И на чем вы строите свои сужденья?",
            "verse 68:37": "Ужель у вас имеется какая-либо книга, Что учит вас (сужденьям этим),",
            "verse 68:38": "И в ней для вас, поистине, все то, Что пожелаете избрать себе (на случай)?",
            "verse 68:39": "Ужель вы заключили договор, Скрепленный Нашей клятвой, Что вплоть до Воскресения (на Суд) Решение всех дел, поистине, останется за вами?",
            "verse 68:40": "Спроси же их: которые из них Готовы послужить порукой в этом?",
            "verse 68:41": "Иль есть у них другие божества? Так пусть они представят их, Если они в словах своих правдивы.",
            "verse 68:42": "В тот День, Когда откроются (все) нЕдуги (земли, Что люди возвели себе в угоду), И призовут их (Господу в молитве) поклониться, А этого они не смогут сделать,",
            "verse 68:43": "Потупленными будут взоры их, Позор их (с головы до ног) покроет. А ведь к (молитвенным) поклонам И раньше призывали их, И пребывали в (полном) здравии они - (И все же отказались).",
            "verse 68:44": "А потому Меня оставьте с глазу на глаз с теми, Кто эту (Книгу) ложью нарекает. Подвергнем Мы их наказаниям с таких сторон, О коих нет у них малейших представлений.",
            "verse 68:45": "Я дам отсрочку им, Но замысел мой тверд и неминуем.",
            "verse 68:46": "Иль ты награды ждешь от них, - Они ж отягчены долгами?",
            "verse 68:47": "Иль в их руках Незримое лежит, О коем они могут записи вести?",
            "verse 68:48": "А потому ты терпеливо жди указа твоего Владыки И человеку в рыбе не уподобляйся, Когда в страданиях он к Господу воззвал.",
            "verse 68:49": "Ведь если б на него не снизошло Великодушие его Владыки, Он был бы на пустынный берег выброшен с позором.",
            "verse 68:50": "Тогда его Господь избрал его И праведником ввел (в назначенное братство).",
            "verse 68:51": "Неверные же взорами своими, Заслышав чтение послания сего, Тебя стараются сбить с толку И говорят: \"Он явно одержим!\"",
            "verse 68:52": "Сие, поистине, не что иное, Как Напоминание мирам!"
        },
        "Sindhi": {
            "verse 68:1": "نٓ قَلَم جو قسم آھي ۽ اُن جو به جيڪي لکندا آھن.",
            "verse 68:2": "ته تون پنھنجي پالڻھار جي فضل سان ڪو چريو نه آھين.",
            "verse 68:3": "۽ بيشڪ تولاءِ اڻ کٽ ثواب آھي.",
            "verse 68:4": "۽ بيشڪ تون وڏي خُلق تي آھين.",
            "verse 68:5": "پوءِ سگھوئي ڏسندين ۽ اُھي (به) ڏسندا.",
            "verse 68:6": "ته اوھان مان ڪير چريو آھي.",
            "verse 68:7": "بيشڪ تنھنجو پالڻھار ئي انھيءَ کي تمام چڱي طرح ڄاڻندڙ آھي جيڪو سندس واٽ کان گمراھ ٿيو، ۽ اھو سنئين واٽ ويندڙن کي به تمام چڱي طرح ڄاڻندڙ آھي.",
            "verse 68:8": "تنھنڪري ڪوڙ ڀائيندڙن جو چيو نه مڃ.",
            "verse 68:9": "اُھي گھرندا آھن ته جيڪڏھن نرمي ڪرين ته اُھي به نرمي ڪن.",
            "verse 68:10": "۽ تون سڀڪنھن وڏي قسميءَ خوار جو چيو نه مڃ.",
            "verse 68:11": "(جو) گھڻو عيب لائيندڙ چغلي ھڻندڙ گھمندڙ.",
            "verse 68:12": "خير کان جھليندڙ حد کان لنگھيل گنھگار.",
            "verse 68:13": "بدعادتو اِن سڀنيءَ کانپوءِ (حرامي (به) ھجي.",
            "verse 68:14": "انھي ڪري جو مال ۽ اولاد وارو آھي.",
            "verse 68:15": "جڏھن وٽس اسان جون آيتون پڙھجن (تڏھن) چوي ته اڳين جون آکاڻيون آھن.",
            "verse 68:16": "سگھوئي کيس سونڍ تي داغ ڏينداسون.",
            "verse 68:17": "بيشڪ اسان ھنن کي (اھڙي طرح) آزمايو جھڙي طرح باغ وارن کي آزمايو ھوسون، جڏھن قسم کنيائون ته سويرو (ئي) اُن پوک کي ضرور لُڻندا (سين).",
            "verse 68:18": "۽ اِنشاءَالله نه چيائون.",
            "verse 68:19": "پوءِ تنھنجي پالڻھار (جي پار) کان اُن (باغ) تي ھڪ (اھڙي) بلا پلٽي ۽ اُھي (اڃا) سمھيل ئي ھوا.",
            "verse 68:20": "جو (اُھو) ناڙ وانگر ٿي پيو.",
            "verse 68:21": "پوءِ سويرو ھڪ ٻئي کي سڏڻ لڳا.",
            "verse 68:22": "جيڪڏھن اوھين لاباري ڪرڻ وارا آھيو ته پوءِ پنھنجي پوک تي سويرو ھلو.",
            "verse 68:23": "پوءِ اُھي ھليا ۽ ھڪ ٻئي کي ھوريان چوڻ لڳا.",
            "verse 68:24": "ته (جئن) ھن (پوک) ۾ اڄ اوھان وٽ ڪو مسڪين اندر اچي نه سگھي.",
            "verse 68:25": "۽ (پنھنجي گمان ۾) بخل (جي نيت) تي سگھارا ٿي سويرو پھتا.",
            "verse 68:26": "پوءِ جنھن مھل اُن (پوک) کي ڏٺائون (ته) چيائون ته بيشڪ اسين رستو ڀليل آھيون.",
            "verse 68:27": "(نه نه!) بلڪ اسين بي نصيب (ٿيل) آھيون.",
            "verse 68:28": "سندن چڱي (مڙس) چيو ته اوھان کي نه چيو ھومِ ڇا ته الله جي پاڪائي ڇونه ٿا بيان ڪريو؟",
            "verse 68:29": "چيائون ته (اسين) پنھنجي پالڻھار جي پاڪائي بيان ڪريون ٿا ۽ بيشڪ (انھي نيت ڪري) ظالم ھواسون.",
            "verse 68:30": "پوءِ ھڪ ٻئي کي ملامت ڪندڙ ٿي ھڪڙن ٻـين ڏانھن مھاڙ ڪئي.",
            "verse 68:31": "چوڻ لڳا ته ويل اسان لاءِ بيشڪ اسين حد کان لنگھندڙ ھواسون.",
            "verse 68:32": "مانَ اسان جو پالڻھار اسان کي ھن کان ڀلو (ٻيو باغ) بدلو ڏئي بيشڪ اسين پنھنجي پالڻھار ڏانھن اُميد رکندڙ آھيون.",
            "verse 68:33": "ائين ئي آفت (پوڻي) آھي، ۽ بيشڪ آخرت جو عذاب تمام وڏو آھي، ارمان! جيڪڏھن سمجھن ھا.",
            "verse 68:34": "بيشڪ پرھيزگارن لاءِ سندن پالڻھار وٽ نعمت جا باغ آھن.",
            "verse 68:35": "مسلمانن کي گنھگارن جھڙو ڪنداسون ڇا؟",
            "verse 68:36": "اوھان کي ڇا ٿيو آھي؟ ڪھڙو ٺھراءُ ٿا ڪيو؟",
            "verse 68:37": "اوھان وٽ ڪو ڪتاب آھي ڇا جنھن ۾ (ھيءَ ڳالھ) پڙھندا آھيو.",
            "verse 68:38": "ته بيشڪ جيڪي اوھين پسند ڪندا آھيو سو آخرت ۾ اوھان لاءِ ھوندو.",
            "verse 68:39": "اوھان جا اسان جي ذمي (ھن ڳالھ جا) ڪي پڪا انجام ٿيل آھن ڇا جو اُنھن جو قيامت تائين حُڪم ھلندو ته بيشڪ جيڪو ٺھراءُ ڪريو ٿا سو اوھان لاءِ آھي.",
            "verse 68:40": "(اي پيغمبر) مشرڪن کان پڇ ته انھن مان ڪير ھن (ڳالھ) جو ذمي وار آھي.",
            "verse 68:41": "انھن (مشرڪن) کي (ھن ڳالھ ۾) ڪي شريڪ آھن ڇا؟ جيڪڏھن سچا آھن ته جڳائين ته پنھنجي شريڪن کي (مدد لاءِ) آڻين.",
            "verse 68:42": "جنھن ڏينھن پنّي جي تجلّي ٿيندي ۽ اُنھن کي سجدي ڏانھن سڏبو پوءِ نه ڪري سگھندا.",
            "verse 68:43": "انھن جون اکيون جھڪيون ھونديون. (۽) کين خواري وٺي ويندي، ۽ بيشڪ اُنھن کي سجدي ڏانھن سڏبو ھو حالانڪ اُھي چڱا ڀلا (به) ھوا.",
            "verse 68:44": "پوءِ (اي پيغمبر) مون کي ۽ انھيءَ کي جو ھن (قرآن جي) ڳالھ کي ڪوڙ ڀائيندو آھي ڇڏي ڏي، (اسين) انھن کي درجي بدرجي (اُتان دوزخ ۾) ڇڪينداسون جتان اُھي نه ڄاڻندا.",
            "verse 68:45": "انھن کي مُھلت ڏيان ٿو، بيشڪ منھنجي رِٿ پڪي آھي.",
            "verse 68:46": "انھن کان ڪو اجورو گھرندو آھين ڇا جنھنڪري (ان) چٽيءَ کان ڳوري بار آھن.",
            "verse 68:47": "(يا) انھن وٽ ڪو ڳجھ (جو علم) آھي ڇا جو اھي لکندا آھن.",
            "verse 68:48": "پوءِ (تون) پنھنجي پالڻھار جي حُڪم (اچڻ) تائين صبر ڪر ۽ مڇيءَ واري (يونس) وانگر نه ھُج، جڏھن دانھن ڪيائين ۽ اُھو ڏک ۾ ڀرجي ويو ھو.",
            "verse 68:49": "جيڪڏھن کيس سندس پالڻھار جي طرفان رحمت نه پھچي ھا ته ضرور سُڃ ۾ اڇليو وڃي ھا ۽ اُھو بڇڙي حال ھجي ھا.",
            "verse 68:50": "پوءِ سندس پالڻھار کيس نوازيو ۽ صالحن مان ڪيائينس.",
            "verse 68:51": "۽ بيشڪ ڪافر جڏھن قرآن ٻڌندا آھن (تڏھن) توکي پنھنجن (تکين) اکين سان ٿيڙڻ تي آھن ۽ چوندا آھن ته بيشڪ ھي (پيغمبر) چريو آھي.",
            "verse 68:52": "۽ (حقيقت ۾) ھي (قرآن) ته جھانن لاءِ نصيحت آھي."
        },
        "Sinhalese": {
            "verse 68:1": "නූන්, පෑන හා ඔවුන් ලියන දෑ මත දිවුරමින්,",
            "verse 68:2": "නුඹේ පරමාධිපතිගේ පිහිටෙන් නුඹ උන්මත්තකයකු නොවේ.",
            "verse 68:3": "තවද සැබැවින්ම නුඹට නිමක් නොමැති ප්‍රතිඵලයක් ඇත.",
            "verse 68:4": "තවද නියත වශයෙන්ම නුඹ අති උතුම් ගතිගුණ මත සිටින්නෙහිය.",
            "verse 68:5": "නුඹ මතු දකිනු ඇත. තවද ඔවුහුද මතු දකිනු ඇත.",
            "verse 68:6": "නුඹලා අතරින් කවරෙකු උමතුවෙන් පෙළෙන්නේදැයි (මතු දකිනු ඇත).",
            "verse 68:7": "නියත වශයෙන්ම නුඹගේ පරමාධිපති වන ඔහු ඔහුගේ මාර්ගයෙන් මූළා වී ගිය අය පිළිබඳ මැනවින් දන්නාය. තවද යහමග ලද්දවුන් පිළිබඳ ව ද මැනවින් දන්නාය.",
            "verse 68:8": "එහෙයින් නුඹ බොරු කළවුනට අවනත නොවනු.",
            "verse 68:9": "නුඹ නම්‍යශීලී වන්නෙහු නම් එවිට ඔවුහු ද නම්‍යශීලි වන්නට කැමති වෙති.",
            "verse 68:10": "තවද අධික වශයෙන් දිවුරා සිටින නීච සෑම කෙනෙකුටම නුඹ අවනත නොවනු.",
            "verse 68:11": "ඔහු දොස් නගන්නෙකි. කේලාම් කියමින් සැරිසරන්නෙකි.",
            "verse 68:12": "යහපත වළක්වන්නෙකි. සීමාව ඉක්මවා කටයුතු කරන්නෙකි. පාපිෂ්ඨයෙකි.",
            "verse 68:13": "හිතුවක්කාරයෙකි. ඊටත් වඩා ඔහු අවජාතකයෙකි.",
            "verse 68:14": "ඔහු වස්තුව හා දරුවන් සතු ව සිටි කෙනෙකු වූ බැවින්;",
            "verse 68:15": "ඔහු වෙත අපගේ වදන් පරායනය කරනු ලැබූ විට “මෙය පැරැන්නන්ගේ ප්‍රබන්ධ යැයි කියයි.",
            "verse 68:16": "නාසය මත අපි ඔහුට සලකුණු තබන්නෙමු.",
            "verse 68:17": "උයන් වැසියන් අපි පරීක්ෂාවට ලක් කළාක් මෙන්ම නියත වශයෙන්ම අපි (මක්කාවාසීන් වන) මොවුන් ව ද පරීක්ෂාවට ලක් කළෙමු. තමන් උදෑසනම එය (අස්වැනු) නෙළන්නට සපත කර ගත්තෝය.",
            "verse 68:18": "තවද අල්ලාහ් අභිමත කළේ නම් (එනම් ඉන්ශා අල්ලාහ්) යැයි ඔවුන් පැවැසුවේ නැත.",
            "verse 68:19": "ඔවුන් නිදමින් සිටිය දී නුඹගේ පරමාධිපතිගෙන් වූ වැටලීමක් එය වටලා ගත්තේය.",
            "verse 68:20": "එවිට එය (ගිනිබත් වී) අඳුරු රාත්‍රියක් මෙන් විය.",
            "verse 68:21": "ඔවුහු උදෑසන එකිනෙකා අමතන්නන් වූවෝය.",
            "verse 68:22": "නුඹලා නෙළන්නන් වූයෙහු නම් නුඹලාගේ ගොවි බිමට උදෑසන යා යුතු යැයි (අමතන්නන් වූවෝය.)",
            "verse 68:23": "(ඔවුන්) එකිනෙකාට කොඳුරමින් ගමන් ගත්තෝය.",
            "verse 68:24": "එවිට අද දින නුඹලා වෙත කිසිදු දිළිඳෙකු එයට ඇතුළු නොවිය යුතු යැයි (ඔවුන් කොඳුරමින් ගමන් ගත්තෝය).",
            "verse 68:25": "තවද (කිසිවකුට නො දී වැළකීමට) හැකියාව ඇත්තන් ලෙසින් ඔවුහු උදෑසන පිටත් වූවෝය.",
            "verse 68:26": "එවිට ඔවුහු එය දුටු කල්හි නියත වශයෙන්ම අපි මුළා වූවෝ වෙමු යැයි පැවසුවෝය.",
            "verse 68:27": "එසේ නොව අපි අහිමි කරනු ලැබූවෝ වෙමු.",
            "verse 68:28": "නුඹලා (අල්ලාහ්ට) සුවිශුද්ධ කළ යුතු නොවේ දැයි මම නුඹලාට නොකීවෙම් දැ?යි ඔවුන් අතරින් මධ්යස්ථ අයෙකු කීවේය.",
            "verse 68:29": "“අපගේ පරමාධිපති සුවිශුද්ධය. නියත වශයෙන්ම අපි අපරාධකරුවන් වූයෙමු” යැයි ඔවුහු පැවසුවෝය.",
            "verse 68:30": "එවිට ඔවුන්ගෙන් ඇතැමෙකු ඇතැමෙකුට දොස් නගමින් ඉදිරියට ආවෝය.",
            "verse 68:31": "“අහෝ අපගේ විනාශය! නියත වශයෙන්ම අපි සීමාව ඉක්මවා යන්නන් වූයෙමු” යැයි ඔවුහු පැවසුවෝය.",
            "verse 68:32": "“මීට වඩා යහපත් දෙයක් අපගේ පරමාධිපති අපට පෙරළා දෙන්නට පුළුවන. නියත වශයෙන් අපි අපගේ පරමාධිපති වෙත බලාපොරොත්තු තබන්නන් වෙමු.” (යැයි ඔවුහු පැවසුවෝය.)",
            "verse 68:33": "එලෙසය (අපගේ) දඬුවම. තවද මතු ලොවෙහි දඬුවම අති බිහිසුණුය. ඒ ගැන ඔවුහු දැන සිටියාහු නම්.",
            "verse 68:34": "නියත වශයෙන්ම බිය බැතිමතුන්ට සැප පහසුකම් සහිත ස්වර්ග උයන් ඔවුන්ගේ පරමාධිපති අබියස ඇත.",
            "verse 68:35": "එහෙයින් අවනත වූවන් වැරදිකරුවන් මෙන් අපි පත් කරන්නෙමුද?",
            "verse 68:36": "නුඹලාට කුමක්වීද? නුඹලා තීන්දු කරනුයේ කෙසේද?",
            "verse 68:37": "නුඹලා හදාරන පුස්තකයක් නුඹලාට එහි තිබේ ද?",
            "verse 68:38": "නුඹලා තෝරා ගන්නා දෑ එහි නුඹලාට තිබේ (ද?).",
            "verse 68:39": "එසේ නැතහොත් නුඹලා තීන්දු කරන දෑ නියත වශයෙන්ම නුඹලාට සතු යැයි පවසන මළවුන් කෙරෙන් නැගිටුවනු ලබන දින තෙක් පවතින ගිවිසුමක් අප වෙතින් නුඹලාට තිබේද?",
            "verse 68:40": "මෙයට වගකිව යුත්තේ කවරෙකු දැයි (නබිවරය!) නුඹ ඔවුන්ගෙන් විමසනු.",
            "verse 68:41": "එසේ නොමැති නම් ඔවුනට හවුල්කරුවන් සිටිත් ද? එසේ නම් ඔවුහු සත්‍යවාදීන් ලෙස සිටියෙහු නම් ඔවුන්ගේ එම හවුල්කරුවන් ඔවුන් ගෙනෙත්වා!",
            "verse 68:42": "එදින කෙණ්ඩයෙන් නිරාවරණය කරනු ලැබේ. තවද සුජූද් කිරීම සඳහා ඇරයුම් කරනු ලැබේ. එවිට ඔවුහු (ඒ සඳහා) හැකියාව නොදරති.",
            "verse 68:43": "ඔවුන්ගේ බැල්ම පහත හෙළී පවතී. නින්දාව ඔවුන් වෙළා ගනී. ඔවුන් (මෙලොව) නිරෝගිව සිටිය දී සුජූද් කිරීම සඳහා ඇරයුම් කරනු ලබන්නන් වූවෝය. (නමුත් ඔවුහු එය ප්‍රතික්ෂේප කළෝය.)",
            "verse 68:44": "එහෙයින් නුඹ මා හා මෙම ප්‍රකාශය බොරු කළවුන් අතහැර දමනු. ඔවුන් නොදන්නා පරිදි පියවරෙන් පියවර අපි ඔවුන් හසු කර ගන්නෙමු.",
            "verse 68:45": "තවද මම ඔවුනට කාල අවකාශය දෙමි. නියත වශයෙන්ම මාගේ උපාය තිරසාරය.",
            "verse 68:46": "එසේ නැතහොත් ඔවුන්ගෙන් නුඹ යම් කුලියක් ඉල්ලා ඒ හේතුවෙන් ඔවුන් ණය බරින් පෙළෙන්නන් වෙත්ද?",
            "verse 68:47": "එසේ නැතහොත් ඔවුන් වෙත ගුප්ත ඥානය තිබී ඔවුහු එය ලියන්නෝද?",
            "verse 68:48": "එහෙයින් (නබිවරය!) නුඹගේ පරමාධිපතිගේ තීන්දුවට නුඹ ඉවසීමෙන් සිටිනු. තවද නුඹ මත්සයා හා සම්බන්ධ පුද්ගලයා මෙන් නොවනු. ඔහු ශෝකයට පත් කරනු ලැබූවෙකු ලෙසින් (තම පරමාධිපති) ඇමතූ අවස්ථාව සිහියට නගනු.",
            "verse 68:49": "ඔහුගේ පරමාධිපතිගේ පිහිට ඔහුට නොලැබුනේ නම් ඔහු අවමානයට ලක් කරනු ලැබූ තත්ත්වයේ නිසරු වෙරළට විසි කරනු ලබන්නට තිබුණි.",
            "verse 68:50": "නමුත් ඔහුගේ පරමාධිපති ඔහු ව තෝරා ගත්තේය. තවද ඔහු ව දැහැමියන් අතරට පත් කළේය.",
            "verse 68:51": "තවද ප්‍රතික්ෂේප කළවුන් අනුශාසනාවට සවන් දුන් කල්හි ඔවුන්ගේ බැල්මෙන් ඔවුහු නුඹ ව ලිස්සා වට්ටන්නට තැත් කරති. “නියත වශයෙන්ම ඔහු උම්මත්තකයකු යැ”යි ඔවුහු පවසති.",
            "verse 68:52": "එහෙත් මෙය ලෝවැසියන්ට උපදෙසක් මිස නැත."
        },
        "Somali": {
            "verse 68:1": "Eebe wuxuu ku dhaartay Qalinka iyo waxa Malaa'igtu qorayso (Camalka dadka).",
            "verse 68:2": "Ee Nabiyow Nicmada Eebe darteed lama waallid.",
            "verse 68:3": "Waxaana kuu sugnaaday Ajri aan go'ayn.",
            "verse 68:4": "Waxaana kuu sugnaaday dabeeco (fiican) oo weyn.",
            "verse 68:5": "Waad arki doontaa nabiyow Gaaladuna way arki doonaan.",
            "verse 68:6": "kinna waalan (ama la caddibo).",
            "verse 68:7": "Eebe waa ogyahay Cidda ka dhunta Jidkiisa, waana ogyahay Cidda hanuunsan.",
            "verse 68:8": "Ee Nabiyow ha maqlin xaq beeniyayaasha (Warkooda).",
            "verse 68:9": "Waxay jecel yihiin inaad u iilato iyana kuu soo iishaan.",
            "verse 68:10": "Ha maqlin dhaar badane dhammaantiis oo dullaysan.",
            "verse 68:11": "oo Xanlow ah, isku diraa ah.",
            "verse 68:12": "Khayrka iyo Xoolahana reebta, gardarrow iyo dambiile ah.",
            "verse 68:13": "Xumaantana ku madax agad isku dhejisna ah (xumaanlow ah).",
            "verse 68:14": "inuu Xoolo iyo Wiilal uu leeyahay darteed (yuu saas u falay).",
            "verse 68:15": "Marka Quraankannaga lagu akhriyana wuxuu dhahaa waa dadkii hore warkoodii.",
            "verse 68:16": "wuxuuse Eebe ka calaamayn Sanqaroorka.",
            "verse 68:17": "Eebe wuu Imtixaanay Gaaladii (Reer Makaad) sidii loo imtixanay kuwii beerta markay ku dhaarten inay Aroortii goostaan.",
            "verse 68:18": "Iyagoon dhihin haddii Eebe idmo.",
            "verse 68:19": "Waxaase Beertii xagaa Eebe uga yimid Amar iyagoo hurda.",
            "verse 68:20": "Waxayna noqotay wax la shafay oo kale.",
            "verse 68:21": "wayna isu dhawaaqeen Subaxdii.",
            "verse 68:22": "iyagoo leh kallaha oo beerta goosta.",
            "verse 68:23": "wayna tageen iyagoo Codka hoos u dhigi.",
            "verse 68:24": "inaan Beerta maanta Miskiin soo gelin.",
            "verse 68:25": "Wayna kallaheen iyagoo diidan (in Miskiin u soo galo).",
            "verse 68:26": "Markay ay arkeen Beertii siday tahay yey isu dhaheen waan soo dhunnay.",
            "verse 68:27": "haddana way isgarteen waxayna dhaheen ma ehee waa la ina hoojiyey.",
            "verse 68:28": "Markaas kii u fiicnaa yiri: miyaana idin dhihin war Eebe weyneeya.",
            "verse 68:29": "Markaasay dheheen Eebaa weyn, waan xad gudubnay.",
            "verse 68:30": "Markaasaa qaarba qaar ku jeedsaday iyagoo is dagaali.",
            "verse 68:31": "Waxayna dheheen Magacaana ba'ye waan xad gudubnay.",
            "verse 68:32": "Eebe wuxuu u dhow yahay inuu noogu beddelo mid ka fiican isagaan Khayr ka rajaynaynaa eh.",
            "verse 68:33": "Caddibaaddu waa saas Caddibaadda Aakharaase ka weyn haddii ay wax ogyihiin.",
            "verse 68:34": "Kuwa Eebe ka dhowrsada waxay Eeba agtiisa ku leeyihiin «Jannada Naciimada».",
            "verse 68:35": "Ma Muslimiinta yaanu kala mid dhigaynaa Dambiilayaasha.",
            "verse 68:36": "Seed u dhihi kartaan saas.",
            "verse 68:37": "Mise Gaalooy waxaa idiin sugnaaday Kitaab aad akhrisataan.",
            "verse 68:38": "oo Waxaad doontaanba aad ka helaysaan.",
            "verse 68:39": "Mise ballan adag yaad naga qaadeen tan iyo Maalinta Qiyaame oo waxaad rabtaaan aad xukumaysaan.",
            "verse 68:40": "Weydii (Nabiyow) Gaalada Cidda damiinka ugu ah Xaalkaas.",
            "verse 68:41": "mise dad la wadaaga Arrintaas yey leeyihiin, ha keeneen kuwaas hadday run sheegi.",
            "verse 68:42": "Maalinta dhudhunka la faydi doono Gaaladana loogu yeedhi doono inay sujuudaan ma karayaan Sujuud.",
            "verse 68:43": "Indhaha Gaaladu Maalintaas waa dullaysan tahay waxaana ku muuqda Walbahaar iyo qoomamo, waxayna ahaayeen (Adduunka) kuwa loogu yeeray Sujuud iyagoo nabad qaba.",
            "verse 68:44": "Isu kaana daa aniga iyo kuwa beeniyey Quraanka waana sasabi iyagoon ogeyn.",
            "verse 68:45": "Waana sugi tan iyo muddo, Maamulka Eebana waa xoog badan yahay.",
            "verse 68:46": "Nabiyow ma waxaad weydiisatay Gaalada Ujuuro oo markaas Cuslleeyey.",
            "verse 68:47": "Mise waxa maqan yaa aktooda yaal ooy wax ka qori.",
            "verse 68:48": "Ku samir Xukunka Eebe hana noqonin sidii Saaxiibkii Xuudka (Mallayga Yuunus) markuu naadiyey Eebihiis isaga oo walbahaarsan.",
            "verse 68:49": "Haddan naxariista Eebe haleelin waxaa lagu tuuri lahaa Cidlo (bannaan) isagoo la dagaalay.",
            "verse 68:50": "Waxaase doortay Eebihiis wuxuuna ka dhigay kuwa wanaagsan.",
            "verse 68:51": "Waxay u dhow yihiin kuwi gaaloobay inay daymada kugu lagdaan markay maqlaan Qur'aanka waxayna dhihi waa waalan yahay (Nabigu).",
            "verse 68:52": "Quraanka iyo Nabiguna waa uun waanada Caalamka."
        },
        "Spanish": {
            "verse 68:1": "Nun. Por el cálamo y lo que escriben!",
            "verse 68:2": "Que tú, por la gracia de tu Señor, no eres un poseso.",
            "verse 68:3": "Y tendrás por cierto una recompensa que no cesará.",
            "verse 68:4": "Y estás hecho de un carácter magnánimo.",
            "verse 68:5": "Verás y verán",
            "verse 68:6": "quién es el trastornado.",
            "verse 68:7": "En verdad tu Señor sabe mejor quién se extravía de Su camino y conoce mejor a los que están guiados.",
            "verse 68:8": "No obedezcas a los que niegan la verdad.",
            "verse 68:9": "Querrían que te mostraras transigente y así ellos también lo harían.",
            "verse 68:10": "Pero no obedezcas a ningún vil jurador,",
            "verse 68:11": "difamador que extiende la maledicencia,",
            "verse 68:12": "que se niega a dar del bien y es un malvado transgresor,",
            "verse 68:13": "embrutecido y además bastardo;",
            "verse 68:14": "sólo porque tenga riqueza e hijos.",
            "verse 68:15": "Cuando se le recitan Nuestros signos, dice: leyendas de los primitivos.",
            "verse 68:16": "Le marcaremos con fuego en el hocico.",
            "verse 68:17": "Les hemos puesto a prueba como hicimos con los dueños del vergel cuando juraron que recogerían sus frutos de amanecida.",
            "verse 68:18": "Pero no manifestaron ninguna excepción.",
            "verse 68:19": "Y de noche, mientras dormían, un visitante de tu Señor cayó sobre él.",
            "verse 68:20": "Y amaneció como la noche oscura.",
            "verse 68:21": "Y cuando amanecieron se avisaron unos a otros:",
            "verse 68:22": "Id temprano a vuestro sembrado si habéis de recoger la cosecha.",
            "verse 68:23": "Y partieron diciéndose en voz baja:",
            "verse 68:24": "Hoy no entrará a costa nuestra ningún mendigo en él.",
            "verse 68:25": "Y salieron de mañana sintiéndose seguros en su propósito,",
            "verse 68:26": "pero al verlo dijeron: Nos hemos perdido!.",
            "verse 68:27": "Pero no, lo hemos perdido todo.",
            "verse 68:28": "Dijo el más razonable de ellos: No os dije que glorificarais?",
            "verse 68:29": "Dijeron: Gloria a nuestro Señor! Realmente hemos sido injustos.",
            "verse 68:30": "Y comenzaron a hacerse reproches unos a otros.",
            "verse 68:31": "Dijeron: Ay de nosotros! Hemos desobedecido.",
            "verse 68:32": "Quizás nuestro Señor nos dé en su lugar algo mejor; a nuestro Señor suplicamos.",
            "verse 68:33": "Así es el castigo; pero el castigo de la Última Vida es mayor, si supieran.",
            "verse 68:34": "Es cierto que los temerosos tendrán, junto a su Señor, los Jardines del Deleite.",
            "verse 68:35": "Es que vamos a tratar a los sometidos como a los malhechores?",
            "verse 68:36": "Qué os pasa?, cómo juzgáis?",
            "verse 68:37": "O es que tenéis un libro que os dice",
            "verse 68:38": "que tendréis lo que elijáis?",
            "verse 68:39": "O es que tenéis un juramento favorable de Nuestra parte, y que alcanza hasta el Día del Levantamiento, de que tendréis lo que suponéis?",
            "verse 68:40": "Pregúntales cuál de ellos puede garantizar eso.",
            "verse 68:41": "O es que tienen asociados? Que traigan a ésos que (me) asocian, si es verdad lo que dicen.",
            "verse 68:42": "El día que se ponga de manifiesto la gravedad de la situación, se les llamará a postrarse pero no podrán.",
            "verse 68:43": "La mirada rendida, les cubrirá la humillación. Ya se les llamó a que se postraran cuando gozaban de bienestar.",
            "verse 68:44": "Déjame con quien niega la verdad de este relato!Los agarraremos, sin prisa, cuando menos lo esperen.",
            "verse 68:45": "Y los dejaré un tiempo; realmente Mi plan es sólido.",
            "verse 68:46": "O es que les pide alguna recompensa y semejante impuesto les agobia?",
            "verse 68:47": "O acaso tienen acceso a lo desconocido y toman nota?",
            "verse 68:48": "Ten paciencia con el juicio de tu Señor y no seas como el del pez cuando suplicó mientras estaba en la más completa indefensión.",
            "verse 68:49": "Si no le hubiera alcanzado una gracia de tu Señor, habría quedado abandonado en la soledad, reprobado.",
            "verse 68:50": "Pero su Señor lo había escogido y lo hizo de los justos.",
            "verse 68:51": "Casi te tumban con sus miradas los que se niegan a creer, cuando oyen el Recuerdo, y dicen: Es un poseso.",
            "verse 68:52": "Sin embargo, no es sino un recuerdo para los mundos."
        },
        "Swahili": {
            "verse 68:1": "Nuun. Naapa kwa kalamu na yale wayaandikayo,",
            "verse 68:2": "Kwa neema ya Mola wako Mlezi wewe si mwendawazimu.",
            "verse 68:3": "Na kwa hakika wewe una malipo yasiyo katika.",
            "verse 68:4": "Na hakika wewe una tabia tukufu.",
            "verse 68:5": "Karibu utaona, na wao wataona,",
            "verse 68:6": "Ni nani kati yenu aliye pandwa na wazimu.",
            "verse 68:7": "Hakika Mola wako Mlezi ndiye Yeye ajuaye zaidi nani aliye ipotea Njia yake, na Yeye ndiye anaye wajua zaidi walio ongoka.",
            "verse 68:8": "Basi usiwat'ii wanao kadhibisha.",
            "verse 68:9": "Wanatamani lau unge lainisha ili nao wakulainishie.",
            "verse 68:10": "Wala usimt'ii kila mwingi wa kuapa wa kudharauliwa,",
            "verse 68:11": "Mtapitapi, apitaye akifitini,",
            "verse 68:12": "Mwenye kuzuia kheri, dhaalimu, mwingi wa madhambi,",
            "verse 68:13": "Mkavu, na juu ya hayo, mshari, amejipachika tu.",
            "verse 68:14": "Ati kwa kuwa ana mali na watoto!",
            "verse 68:15": "Anapo somewa Aya zetu, husema: Hizi ni simulizi za uwongo za watu wa zamani!",
            "verse 68:16": "Tutamtia kovu juu ya pua yake.",
            "verse 68:17": "Hakika tumewajaribu hawa kama tulivyo wajaribu wale wenye shamba, walipo apa kwamba watayavuna mazao yake itakapo kuwa asubuhi.",
            "verse 68:18": "Wala hawakusema: Mungu akipenda!",
            "verse 68:19": "Basi lilitokea tukio juu yake kutoka kwa Mola wako Mlezi, nao wamelala!",
            "verse 68:20": "Likawa kama usiku wa giza.",
            "verse 68:21": "Asubuhi wakaitana.",
            "verse 68:22": "Ya kwamba nendeni kondeni mwenu ikiwa mnataka kuvuna.",
            "verse 68:23": "Basi walikwenda na huku wakinong'onezana,",
            "verse 68:24": "Ya kuwa leo hata masikini mmoja asikuingilieni.",
            "verse 68:25": "Na walikwenda asubuhi, nao wameshikilia azimio hilo.",
            "verse 68:26": "Basi walipo liona, wakasema: Hakika tumepotea!",
            "verse 68:27": "Bali tumenyimwa!",
            "verse 68:28": "Mbora wao akasema: Sikukwambieni, kwa nini hamumtakasi Mwenyezi Mungu?",
            "verse 68:29": "Wakasema: Ametakasika Mola wetu Mlezi! Hakika sisi tulikuwa wenye kudhulumu.",
            "verse 68:30": "Basi wakakabiliana kulaumiana wao kwa wao.",
            "verse 68:31": "Wakasema: Ole wetu! Tulikuwa tumeikiuka mipaka!",
            "verse 68:32": "Asaa Mola wetu Mlezi akatubadilishia lilio bora kuliko hili. Hakika sisi ni wenye kurejea kwa Mola wetu Mlezi.",
            "verse 68:33": "Namna hivi yanakuwa mateso, na bila ya shaka mateso ya Akhera ni makubwa zaidi, laiti wangeli jua!",
            "verse 68:34": "Hakika wachamngu watakuwa na Bustani za neema kwa Mola wao Mlezi.",
            "verse 68:35": "Kwani tutawafanya Waislamu kama wakosefu?",
            "verse 68:36": "Mna nini? Mnahukumu vipi?",
            "verse 68:37": "Au mnacho kitabu ambacho ndani yake mnasoma?",
            "verse 68:38": "Kuwa mtapata humo mnayo yapenda?",
            "verse 68:39": "Au mnazo ahadi za viapo juu yetu za kufika Siku ya Kiyama ya kuwa hakika mtapata kila mnayo jihukumia?",
            "verse 68:40": "Waulize: Ni nani miongoni mwao dhamini wa haya?",
            "verse 68:41": "Au wanao washirika? Basi wawalete washirika wao wakiwa wanasema kweli.",
            "verse 68:42": "Siku utakapo wekwa wazi mundi, na wataitwa kusujudu, lakini hawataweza,",
            "verse 68:43": "Macho yao yatainama chini, fedheha itawafunika. Na hakika walikuwa wakiitwa wasujudu walipo kuwa wazima -",
            "verse 68:44": "Basi niache na wanao kadhibisha maneno haya! Tutawavutia kidogo kidogo kwa mahali wasipo pajua.",
            "verse 68:45": "Na ninawapururia muhula; hakika hila zangu ni imara.",
            "verse 68:46": "Au unawaomba ujira, na wao wanaemewa na gharama hiyo?",
            "verse 68:47": "Au iko kwao siri, basi wao wanaiandika?",
            "verse 68:48": "Basi ingojee hukumu ya Mola wako Mlezi, wala usiwe kama mmezwa na samaki, alipo nadi naye kazongwa.",
            "verse 68:49": "Kama isingeli mfikia neema kutoka kwa Mola wake Mlezi, bila ya shaka angeli tupwa ufukweni naye ni mwenye kulaumiwa.",
            "verse 68:50": "Lakini Mola wake Mlezi alimteua na akamfanya miongoni mwa watu wema.",
            "verse 68:51": "Na walio kufuru hukaribia kukutelezesha kwa macho yao, wanapo sikia mawaidha, na wanasema: Hakika yeye ni mwendawazimu.",
            "verse 68:52": "Na hayakuwa haya, ila ni ukumbusho kwa walimwengu wote."
        },
        "Swedish": {
            "verse 68:1": "Nun. VID PENNAN och det som skrivs ned!",
            "verse 68:2": "Tack vare din Herres nåd är du inte besatt!",
            "verse 68:3": "Helt visst kommer din belöning att vara i evighet.",
            "verse 68:4": "Ditt liv och ditt handlande är ett lysande [exempel],",
            "verse 68:5": "och du skall se - och [dina fiender] skall se -",
            "verse 68:6": "vem av er som har förlorat förståndet.",
            "verse 68:7": "Din Herre vet bäst vem som har vikit av från Hans väg, och Han vet bäst vem som följer Hans ledning.",
            "verse 68:8": "Hör därför inte på dem som förnekar sanningen;",
            "verse 68:9": "de skulle vilja att du gick dem till mötes för att då visa sig tillmötesgående [mot dig].",
            "verse 68:10": "Och lyssna inte till den som är färdig att svära på allt",
            "verse 68:11": "och springer med skvaller och illvilligt förtal,",
            "verse 68:12": "som motarbetar det goda, överträder alla förbud [och] syndar [av vana],",
            "verse 68:13": "grov i sättet och omåttlig [och] därtill av tvivelaktig härkomst.",
            "verse 68:14": "[Högmodig över] sin rikedom och sina [talrika] söner",
            "verse 68:15": "säger han, när han hör Våra budskap läsas upp: \"[Detta är ingenting annat än] sagor från förfädernas tid!\"",
            "verse 68:16": "På hans panna skall Vi bränna in skammens och vanärans brännmärke!",
            "verse 68:17": "Vi har satt [dessa människor] på prov, liksom Vi satte ägarna till en fruktträdgård på prov, när de svor att de skulle skörda [dess frukt] följande morgon",
            "verse 68:18": "utan att göra förbehåll [för Guds vilja].",
            "verse 68:19": "Medan de sov, kom en [besökare sänd] av din Herre; han gick ronden [runt fruktträdgården]",
            "verse 68:20": "och följande morgon låg [den] tom som ett redan skördat sädesfält.",
            "verse 68:21": "I gryningen ropade de till varandra:",
            "verse 68:22": "\"Vi bör gå tidigt till trädgården om vi vill skörda [frukten]!\"",
            "verse 68:23": "Och när de gick sade de sinsemellan med låg röst:",
            "verse 68:24": "\"I dag får ingen fattiglapp komma in och störa oss!\"",
            "verse 68:25": "Och de begav sig tidigt i väg, beslutna att genomföra vad de hade föresatt sig.",
            "verse 68:26": "Men när de fick se [trädgården] sade de: \"Vi måste ha tagit fel väg!\"",
            "verse 68:27": "[Men när de insåg vad som hänt ropade de:] \"Vi har blivit ruinerade!\"",
            "verse 68:28": "Den förnuftigaste av dem sade: ”Jag sa' er ju att ni skulle prisa Gud.”",
            "verse 68:29": "Och de svarade: \"Stor är vår Herre i Sin härlighet! Vi har sannerligen gjort orätt!\"",
            "verse 68:30": "Och de överföll varandra med förebråelser.",
            "verse 68:31": "[Till sist] sade de: \"Vår olycka var att vi gick för långt!",
            "verse 68:32": "Kanske ger oss vår Herre något ännu bättre än det [som vi har förlorat] - till vår Herre vänder vi vår håg, till honom sätter vi vårt hopp!\"",
            "verse 68:33": "SÅDANT är Vårt straff [i denna värld]. Men det straff [som väntar syndarna] i det kommande livet är sannerligen hårdare - om de bara visste...!",
            "verse 68:34": "[Men] på de gudfruktiga väntar lycksalighetens lustgårdar hos deras Herre;",
            "verse 68:35": "eller skulle Vi behandla dem som har underkastat sig Vår vilja på samma sätt som de obotfärdiga syndarna",
            "verse 68:36": "Hur är det fatt med ert omdöme?",
            "verse 68:37": "Eller har ni en Skrift som ni studerar",
            "verse 68:38": "där [det sägs] att ni skall ha det som ni [själva] väljer?",
            "verse 68:39": "Eller har ni fått ett högtidligt löfte av Oss, gällande till Uppståndelsens dag, att låta er själva fälla avgörandet",
            "verse 68:40": "Fråga dem vem av dem som borgar för detta;",
            "verse 68:41": "Har de några som är med dem i detta, låt dem då kalla på dem, om de har talat sanning.",
            "verse 68:42": "[Påminn dem om] den Dag då allt som varit djupast dolt skall dras fram i ljuset och de kommer att uppmanas att falla ned [inför Gud] men förmår inte göra det.",
            "verse 68:43": "[De skall stå] med sänkta huvuden, överväldigade av skam, eftersom de redan [i livet], friska [till kropp och själ], uppmanades att falla ned [inför Honom men vägrade].",
            "verse 68:44": "Lämna nu åt Mig [att ta itu med] dem som förnekar sanningen i detta budskap; Vi skall föra dem mot undergången steg för steg, utan att de inser vad [som sker];",
            "verse 68:45": "Jag ger dem ett uppskov, men Min plan ligger fast.",
            "verse 68:46": "Eller begär du en avgift av dem [för att framföra ditt budskap], så att de nu tyngs av skuldbördor",
            "verse 68:47": "Eller har de [sådan kunskap om] den verklighet som är dold för människor att de [kan] skriva ned [vad de vet]?",
            "verse 68:48": "HA därför tålamod, [Muhammad,] och avvakta din Herres dom och var inte som han som slukades av en väldig fisk och som anropade [sin Herre], medan vreden [mot hans motspänstiga landsmän ännu] kokade inom honom.",
            "verse 68:49": "Och om inte hans Herre hade inneslutit honom i Sin nåd, skulle han ha kastats upp på den öde stranden, tyngd av sin skuld.",
            "verse 68:50": "Men Gud hade utvalt honom och gjort honom till en av de rättfärdiga.",
            "verse 68:51": "[Ha tålamod] även om de som förnekar sanningen kastar så hätska blickar mot dig, när de får höra [stycken av] Koranen [att de så när får dig att förlora fattningen] och säger: \"Han är sannerligen galen!\"",
            "verse 68:52": "Denna [Koran] är ingenting mindre än en påminnelse till alla folk."
        },
        "Tajik": {
            "verse 68:1": "Нун, савганд ба қалам ва он чӣ менависанд,",
            "verse 68:2": "ки ту ба фазли Парвардигорат девона нестӣ",
            "verse 68:3": "ва турост мукофоте бепоён",
            "verse 68:4": "ва турост хулқе азим.",
            "verse 68:5": "Ба зудӣ ту бубинӣ ва онҳо низ бубинанд,",
            "verse 68:6": "ки девонагӣ дар кадом як аз шумост.",
            "verse 68:7": "Албатта Парвардигори ту беҳтар медонад чӣ касе аз тариқи Ӯ гумроҳ гашта, ва Ӯ ба роҳёфтагон донотар аст.",
            "verse 68:8": "Пас ба такзибкунандагон (дурӯғ шуморандагон) итоъат макун.",
            "verse 68:9": "Дӯст доранд, ки нармӣ кунӣ, то нармӣ кунанд,.",
            "verse 68:10": "Ба ҳар фурӯмояе (пасте), ки бисёр: савганд мехӯрад пайравӣ макун:",
            "verse 68:11": "айбҷӯе, ки барои суханчинӣ ин ҷову он ҷо меравад,",
            "verse 68:12": "боздоранда аз хайр, аз ҳад гузаранда, гуноҳкор,",
            "verse 68:13": "дағалмарде, ношинохтанасаб,",
            "verse 68:14": "ба он ҷиҳат, ки соҳиби молу фарзанд аст.",
            "verse 68:15": "Чун оёти Мо бар ӯ хонда шавад, гӯяд: «Афсонаҳои пешиниён аст».",
            "verse 68:16": "Ба зудӣ бар биниаш доғ гузорем.",
            "verse 68:17": "Мо онҳоро озмудем, чунон ки соҳибони он бустонҳоро озмудем. Он гоҳ., ки қасам хӯрданд, ки фардо бомдод меваҳоро хоҳанд чид.",
            "verse 68:18": "Ва иншооллоҳ нагуфтанд.",
            "verse 68:19": "Пас шабҳангом, ки ба хоб буданд, офате аз осмон омад,",
            "verse 68:20": "ва бӯстонҳо сиёҳ шуд.",
            "verse 68:21": "Ва саҳаргоҳон якдигарро нидо доданд:",
            "verse 68:22": "«Агар мехоҳед, мева бичинед, бомдодон ба киштзори худ биравед!»",
            "verse 68:23": "Ба роҳ афтоданд ва оҳиста мегуфтанд;",
            "verse 68:24": "ки имрӯз набояд бенавое ба бӯстони шумо дарояд.",
            "verse 68:25": "Субҳгоҳон ба ин ният, ки метавонанд бенаворо манъ кунанд, берун шуданд.",
            "verse 68:26": "Чун бӯстонҳои худро диданд, гуфтанд: «Роҳро гум кардаем.",
            "verse 68:27": "На, мо аз ҳосил маҳрум шудаем».",
            "verse 68:28": "Некмардашон гуфт: «Шуморо нагуфгам, чаро Худоро тасбеҳ намегӯед?»",
            "verse 68:29": "Гуфтанд,: «Пок аст Парвардигори мо, мо ситамкор будем».",
            "verse 68:30": "Пас забон ба маломати якдигар кушуданд.",
            "verse 68:31": "Гуфтанд: «Вой бар мо, мо мардуме саркаш будаем,",
            "verse 68:32": "бошад, ки Парвардигори 'мо дар иваз чизе беҳтар аз он моро диҳад, Мо ба Парвардигори худ рӯй овардаем!»",
            "verse 68:33": "Инчунин аст азоб! Ва агар бидонанд, азоби охират бузургтар аст!",
            "verse 68:34": "Барои парҳезгорон дар назди Парвардигорашон бӯстонҳоест пурнеъмат.",
            "verse 68:35": "Оё бо таслимшудагон чун ба гунаҳкорон рафтор мекунем?",
            "verse 68:36": "Шуморо чӣ мешавад? Чӣ тавр доварӣ мекунед?",
            "verse 68:37": "Оё шуморо китобест, ки аз он мехонед?",
            "verse 68:38": "Ва ҳар чӣ ихтиёр кунед, дар он ҳаст?",
            "verse 68:39": "Ё бо Мо паймоне, ки то рӯзи қиёмат кашад, бастаед, ки ба ҳар чӣ ҳукм кунед, ҳаққи шумо бошад?",
            "verse 68:40": "Аз онҳо бипурс, кадом якашон зомини чунин паймонест?",
            "verse 68:41": "Ё онҳоро шариконест? Агар рост мегӯянд, шарикони худро биёваранд.",
            "verse 68:42": "Рӯзе, ки он воқеъаи азим рӯй диҳад ва онҳоро ба саҷда даъваткунанд, вале натавонанд.",
            "verse 68:43": "Ваҳшат дар чашмонашон пайдост, хори бар онҳо ғолиб шудааст, пеш аз ин низ онҳоро дар айни тандуруст ба саҷда даъват карда буданд.",
            "verse 68:44": "Пас Маро ба онҳо, ки ин суханро дурӯғ мебароранд вогузор, то андак-андак,: чунон ки дарнаёбанд, ба азоб гиремашон",
            "verse 68:45": "ва ба онҳо мӯҳлат диҳам. Албатта макри Ман макре устувор аст.",
            "verse 68:46": "Ё аз онон музде талабидаӣ ва акнун аз адои он дар ранҷанд?",
            "verse 68:47": "Ё илми ғайб медонанд ва онҳо, менависанд?",
            "verse 68:48": "Дар баробари фармони Парвардигорат собир бош ва чун соҳиби моҳӣ мабош, ки бо диле пурандӯҳ нидо дардод.",
            "verse 68:49": "Агар неъмати Парвардигораш набуд, дар айни бадҳолӣ ба саҳрое беобу гиёҳ меафтод.",
            "verse 68:50": "Пас Парвардигораш ӯро ихтиёр кард ва дар зумраи солеҳонаш даровард.",
            "verse 68:51": "Ва кофирон чун Қуръонро шуниданд, наздик буд, ки туро, бо чашмони худ билағжонанд ва мегӯянд, ки ӯ девона аст",
            "verse 68:52": "ва ҳол он ки Қуръон барои ҷаҳониён фақат панде аст!"
        },
        "Tamil": {
            "verse 68:1": "நூன், எழுதுகோல் மீதும் இன்னும் (அதன் மூலம்) அவர்கள் எழுதுவதின் மீதும் சத்தியமாக!",
            "verse 68:2": "உம்முடைய இறைவன் அருட்கொடையால், நீர் பைத்தியக்காரர் அல்லர்.",
            "verse 68:3": "இன்னும், உமக்குக் குறைவே இல்லாத நற்கூலி நிச்சயமாக இருக்கிறது.",
            "verse 68:4": "மேலும், (நபியே) நிச்சயமாக நீர் மிக உயர்ந்த மகத்தான நற்குணம் உடையவராக இருக்கின்றீர்.",
            "verse 68:5": "எனவே, வெகு சீக்கிரத்தில் நீரும் பார்ப்பீர்; அவர்களும் பார்ப்பார்கள்.",
            "verse 68:6": "உங்களில் எவர் (பைத்தியமென்னும் நோயால்) சோதனைக்குள்ளாக்கப்பட்டவர் என்பதை.",
            "verse 68:7": "உம்முடைய இறைவன் அவனுடைய வழியை விட்டுத் தவறியவர்கள் யார் என்பதை நிச்சயமாக நன்கறிவான்; (அது போன்றே) நேர்வழி பெற்றோரையும் அவன் நன்கறிவான்.",
            "verse 68:8": "எனவே, (சன்மார்க்கத்தைப்) பொய்ப்பிப்பவர்களுக்கு நீர் வழிபடாதீர்.",
            "verse 68:9": "(சன்மார்க்க போதனையை) நீர் தளர்த்தினால், தாங்களும் தளர்ந்து போகலாம் என்று அவர்கள் விரும்புகின்றனர்.",
            "verse 68:10": "அன்றியும், இழிவானவனான அதிகம் சத்தியம் செய்யும் ஒவ்வொருவனுக்கும் நீர் வழிபடாதீர்;",
            "verse 68:11": "(அத்தகையவன்) குறைகூறித்திரிபவன், கோள் சொல்லிக் கொண்டு நடப்பவன்.",
            "verse 68:12": "(எப்பொழுதும்) நன்மையானவற்றைத் தடுத்துக் கொண்டிருப்பவன், வரம்பு மீறிய பெரும் பாவி.",
            "verse 68:13": "கடின சித்தமுடையவன், அப்பால் இழி பிறப்புமுடையவன்.",
            "verse 68:14": "பெரும் செல்வமும், (பல) ஆண் மக்களும் உள்ளவனாக அவனிருப்பதால்",
            "verse 68:15": "நம் வசனங்கள் அவனிடம் ஓதப்பட்டால், \"இவை முன்னோர்களின் கட்டுக்கதைகள்\" என்று அவன் கூறுகின்றான்.",
            "verse 68:16": "விரைவிலேயே அவனுடைய மூக்கின் மீது அடையாளமிடுவோம்.",
            "verse 68:17": "நிச்சயமாக நாம் தோட்டமுடையவர்களைச் சோதித்தது போலவே, நாம் அவர்களைச் சோதித்தோம். அ(த் தோட்; டத்திற்குடைய)வர்கள் அதிலுள்ள கனிகளை அதிகாலையில் சென்று பறித்து விடுவோமென்று சத்தியம் செய்தார்கள்.",
            "verse 68:18": "அல்லாஹ் நாடினால் என்று அவர்கள் கூறவில்லை,",
            "verse 68:19": "எனவே, அவர்கள் தூங்கிக் கொண்டிருந்த போது உம் இறைவனிடமிருந்து சுற்றக் கூடிய (நெருப்பின் ஆபத்)து சுற்றி(த் தோட்டத்தை) அழித்து விட்டது.",
            "verse 68:20": "(நெருப்புக் கரித்து விட்ட படியால் அத்தோட்டம்) காலையில் கருத்த சாம்பலைப் போல் ஆயிருந்தது.",
            "verse 68:21": "(இது அறியாது) காலையில் எழுந்த அவர்கள் ஒருவரை ஒருவர் அழைத்தனர்.",
            "verse 68:22": "\"நீங்கள் (விளைந்த) கனிகளைக் கொய்பவர்களாக இருந்தால் உங்கள் தோட்டத்திற்கு அதிகாலையில் செல்லுங்கள்\" (என்று கூறிக் கொண்டனர்).",
            "verse 68:23": "எனவே அவர்கள் (பிறர் அறியாது) மெதுவாகப் பேசிக் கொண்டு சென்றனர்,",
            "verse 68:24": "\"எந்த ஏழை எளியவரும் இன்று உங்களிடம் அ(த் தோட்டத்)தில் நிச்சயமாக பிரவேசிக்கக் கூடாது\" (என்று).",
            "verse 68:25": "உறுதியுடன் சக்தியுடையவர்களாக காலையில் சென்றனர்.",
            "verse 68:26": "ஆனால், அவர்கள் அதை (தோட்டத்தை அழிந்து போன நிலையில்) கண்ட போது: \"நிச்சயமாக நாம் வழி தவறி (வேறு தோட்டத்திற்கு) வந்து விட்டோம்\" என்று கூறினார்கள்.",
            "verse 68:27": "(பின்னர் கவனித்துப் பார்த்துவிட்டு) \"இல்லை! (ஏழை எளியோர்க்கு எதுவும் கிடைக்காமற் செய்து) நாம் தாம் பாக்கியம் இழந்தவர்களாக ஆகிவிட்டோம்\" (என்றும் கூறிக்கொண்டனர்.)",
            "verse 68:28": "அவர்களில் நடுநிலையுள்ள ஒருவர் \"நீங்கள் தஸ்பீஹு செய்திருக்க வேண்டும் என்று நான் உங்களுக்கு கூறவில்லையா?\" என்று கூறினார்.",
            "verse 68:29": "\"எங்கள் இறைவன் தூயவன், நாம் தாம் நிச்சமயாக அநியாயம் செய்தவர்கள் ஆகிவிட்டோம்\" என்றும் கூறினர்.",
            "verse 68:30": "பின்னர், அவர்களில் சிலர் சிலரை நிந்தித்தவர்களாக முன்னோகினர்.",
            "verse 68:31": "அவர்கள் கூறினார்கள்: \"எங்களுக்குண்டான கேடே! நிச்சயமாக நாம் வரம்பு மீறியவர்களாக இருந்தோம்.",
            "verse 68:32": "\"எங்களுடைய இறைவன் இதைவிட மேலானதை எங்களுக்கு மாற்றித் தரக்கூடும், நாங்கள் (தவ்பா செய்து) நிச்சயமாக எங்களுடைய இறைவன் மீதே ஆதரவு வைக்கிறோம்\" (எனக் கூறினர்).",
            "verse 68:33": "இவ்வாறுதான் (இவ்வுலக) வேதனை வருகிறது, அவர்கள் அறிந்து கொள்வார்களானால் மறுமையின் வேதனை (இதைவிட) மிகவும் பெரிது (என உணர்ந்து சன்மார்க்கத்தின் பால் திரும்புவார்கள்).",
            "verse 68:34": "நிச்சயமாக, பயபக்தியுடையோருக்கு, அவர்களுடைய இறைவனிடத்தில் (பாக்கியமுடைய) சுவனச் சோலைகள் உண்டு.",
            "verse 68:35": "நாம் முஸ்லிம்களை, (பாவம் செய்யும்) குற்றவாளிகளைப் போல் ஆக்குவோமா?",
            "verse 68:36": "(சத்தியத்தை நிராகரிப்போரே! உங்களுக்கு என்ன நேர்ந்தது? (இரு சாராரும் சமமென) எவ்வாறு நீங்கள் தீர்ப்புச் செய்கிறீர்கள்?",
            "verse 68:37": "அல்லது உங்களிடம் ஏதாவது வேத(ஆதார)ம் இருக்கின்றதா? அதில் நீங்கள் படித்திருக்கின்றீர்களா?",
            "verse 68:38": "நிச்சயமாக நீங்கள் உங்களுக்காகத் தெரிந்தெடுத்துக் கொள்வதுவே (சரி) என்று அதில் இருக்கின்றதா,",
            "verse 68:39": "அல்லது, நீங்கள் தீர்ப்புச் செய்து கொள்வதெல்லாம் கியாம நாள் வரை உங்களுக்கு நிச்சயமாகக் கிடைத்துக் கொண்டிருக்கும் என்று நம் உறுதி பிரமாணங்கள் உங்களிடம் இருக்கின்றனவா?",
            "verse 68:40": "(அவ்வாறெனில்) அவர்களில் எவர் அதற்குப் பொறுப்பேற்பவர் என்பதை (நபியே!) நீர் அவர்களிடம் கேட்பீராக.",
            "verse 68:41": "அல்லது (பொறுப்பேற்க) அவர்களுக்கு இணை வைக்கும் கூட்டாளிகள் தாம் இருக்கின்றார்களா? அவ்வாறாயின், அவர்கள் உண்மையாளர்களாக இருந்தால் அவர்களுடைய கூட்டாளிகளைக் கொண்டு வரட்டும்.",
            "verse 68:42": "கெண்டைக் காலை விட்டு (திரை) அகற்றப்படும் நாளில் ஸுஜூது செய்யுமாறு (மக்கள்) அழைக்கப்படும் நாளில், (இவ்வுலகில் மாறு செய்த) அவர்கள் அதற்கும் இயலாதிருப்பார்கள்.",
            "verse 68:43": "அவர்களுடைய பார்வைகள் கீழ் நோக்கியவையாக இருக்கும்நிலையில் இழிவு அவர்களை மூடிக் கொள்ளும்; அவர்களோ (உலகில்) திடமாக இருந்த போது, ஸுஜூது செய்யுமாறு அழைக்கப்பட்டுக் கொண்டுதானிருந்தனர். (ஆனால் அப்போது அலட்சியமாக இருந்தனர்.)",
            "verse 68:44": "எனவே, என்னையும், இந்தச் செய்தியைப் பொய்யாக்குவோரையும் விட்டு விடுவீராக! அவர்களே அறியாத விதத்தில் படிப்படியாகப் பிடிப்போம்.",
            "verse 68:45": "அன்றியும், நான் அவர்களுக்கு அவகாசம் கொடுப்பேன், நிச்சயமாக என் திட்டமே உறுதியானது.",
            "verse 68:46": "நீர் அவர்களிடம் ஏதாவது கூலிகேட்டு, அதனால் அவர்களுக்கு கடன் சுமை ஏற்பட்டு விட்டதா?",
            "verse 68:47": "அல்லது மறைவான விஷயங்கள் (எழுதப்படும் ஏடு) அவர்களிடம் இருந்து (அதில்) அவர்கள் எழுதுகின்றார்களா?",
            "verse 68:48": "ஆகவே, உம்முடைய இறைவனின் கட்டளைக்காக (நபியே!) நீர் பொறுத்திருப்பீராக, மீனுடையவரைப் போன்று (அவசரப்பட்டவர்) ஆகிவிடவேண்டாம், அவர் துன்பம் நிறைந்தவராகத் (தன் இறைவனை) அழைத்தபோது:",
            "verse 68:49": "அவருடைய இறைவனிடமிருந்து அருள் கொடை அவரை அடையாதிருந்தால், அவர் பழிக்கப்பட்டவராக வெட்டவெளியில் எறியப்பட்டிருப்பார்.",
            "verse 68:50": "ஆனால், அவருடைய இறைவன், அவரைத் தேர்ந்தெடுத்து, அவரை ஸாலிஹானவர்களில் - நல்லவர்களில் நின்றும் ஆக்கினான்.",
            "verse 68:51": "மேலும், எவர்கள் நிராகரிக்கின்றார்களோ அவர்கள் நல்லுபதேசத்தை (குர்ஆனை) கேட்கும் போது, தங்களுடைய பார்வைகளால் உம்மை வீழ்த்திட நெருங்குகிறார்கள்; \"நிச்சயமாக அவர் பைத்தியக்காரர்\" என்றும் கூறுகின்றனர்.",
            "verse 68:52": "ஆனால் அது (குர்ஆன்) அகிலத்தார் அனைவருக்குமே நல்லுபதேசயேன்றி வேறில்லை."
        },
        "Tatar": {
            "verse 68:1": "Нун. Вә Ләүхүл Мәхфузны язган каләм белән һәм фәрештәдә язган кешеләрнең гамәл дәфтәрләре илә ант итәмен.",
            "verse 68:2": "Ий Мухәммәд г-м, син мәҗнүн түгелсең, бәлки Раббыңнан пәйгамбәрлек нигъмәте белән хөрмәтләнгәнсең.",
            "verse 68:3": "Сиңа, әлбәттә, һич киселми торган әҗер вә нигъмәт бардыр.",
            "verse 68:4": "Тәхкыйк син күркәм холыктасың.",
            "verse 68:5": "Ий Мухәммәд, тиздән күрерсең һәм хакны инкяр итүче кәферләр күрерләр:",
            "verse 68:6": "кайсыларыгыз Мәҗнүн исеме илә фетнәләргә лаек икәнен. Ягъни мөэминнәрме яки кәферләрме мәҗнүн-тиздән белерләр.",
            "verse 68:7": "Тәхкыйк синең Раббың – Ул белүчедер Аның юлыннан адашкан кешене вә Ул белүчедер туры юлга күнелгән кешене.",
            "verse 68:8": "Хакны ялган диючеләргә итагать итмә!",
            "verse 68:9": "Мөшрикләр синең аларны ислам диненә һәм аларның батыл динен яманламыйча аларга йомшаклык кылуыңны телиләр, әгәр син аларга йомшаклык кылсаң алар да сиңа йомшаклык кылырлар, үзләренә ияртү өчен.",
            "verse 68:10": "Итагать итмә һәр күп ант итүче җиңел гакыллы ялганчыга.",
            "verse 68:11": "Кешене мәсхәрәләп ґәйбәт сөйләүче, сүз йөртүчегә.",
            "verse 68:12": "Коръән күрсәткән туры юлдан һәм изге гамәлләрдән кешеләрне тыючы, чиктән үтеп йөрүче күп гөнаһлыга.",
            "verse 68:13": "Каты сүзле яман холыклы шуның өстенә ул зинадан тугандыр.",
            "verse 68:14": "Ул күп мал вә күп бала иясе булганы өчен генә аңа һич итагать итмә һәм дус булма!",
            "verse 68:15": "Әгәр аңа Безнең аятьләребез укылса, ул явыз әйтәдер: \"Бу әүвәлгеләрдән калган әкият\", – дип.",
            "verse 68:16": "Без аның борынына тиз билге ясарбыз. \"Бәдер сугышында аның борыны киселде. Ул Вәлид исемле явыз кеше иде. Андый явыз кешеләргә дус булырга Аллаһудан һич рөхсәт юк\".",
            "verse 68:17": "Тәхкыйк Без Мәккә мөшрикләрен ачлык белән бәлаләндердек, бакча ияләрен бәлаләндергәнебез кеби\" Ямәндә бер кешенең хөрмә бакчасы бар иде, хөрмә өлгергәч җил койган хөрмәләрне җыеп алсыннар өчен һәр көнне фәкыйрьләрне чакыра торган булган. Бу яхшы кеше вафат булгач, бакча өч угълына калды. Алар үзара сөйләштеләр: \"Әгәр хөрмәбезне фәкыйрьләргә бирсәк, үзебезгә аз калыр, фәкыйрьләр килгәнче, бакчабызга иртүк барып җимешләрне җыеп алыйк\", – дип. Алар таң вакытыңда бакчадан җимешләрне җыеп алырбыз, дип ант иттеләр.",
            "verse 68:18": "Ләкин алар Аллаһ теләсә димәделәр.",
            "verse 68:19": "Ул бакчада Раббыңнан бер бәла әйләнде, алар әле бу вакытта йокыда иделәр.",
            "verse 68:20": "Ул бакча агачсыз, җимешсез коры җир булып әверелде.",
            "verse 68:21": "Бу өч егет таң вакытында бер-берсен бакчага чакырдылар.",
            "verse 68:22": "Бакчагызга иртәрәк барыгыз, әгәр җимешләрегезне кисеп җыярга теләсәгез.",
            "verse 68:23": "Алар яшерен генә сөйләшкән хәлләрендә бакчага киттеләр.",
            "verse 68:24": "Бүген бакчага сезнең өстегезгә һич ярлы мескеннәр кермәсен диделәр.",
            "verse 68:25": "Мескеннәр килмәс борын бакчага йөгерделәр, бу эшкә кадирбыз, дип уйладылар.",
            "verse 68:26": "Бакчалары янына килеп андагы хәлне күргәч, тәхкыйк бакча юлыбыздан адаштык, башка юлга киткәнбез, диделәр, чөнки бакчаларының коры җире генә калган иде.",
            "verse 68:27": "Үз бакчаларының шул хәлгә калганын белгәч, юк без адашмаганбыз, бәлки без Аллаһуның нигъмәтеннән тәмам мәхрүм ителгәнбез, Аллаһ безгә бәла җибәргән, диештеләр",
            "verse 68:28": "Аларның уртанчысы яки гакыллырагы: \"Мин сезгә әйткән идем түгелме? Аллаһ теләсә дисәгезче\", – дип.",
            "verse 68:29": "Алар әйттеләр: \"Раббыбыз һәр кимчелектән пакь, тәхкыйк без үзебезгә золым кылдык\".",
            "verse 68:30": "Һәм бер-берсенә каршы килеп шелтәләшә башладылар",
            "verse 68:31": "Әйттеләр: \"Ий безнең кайгыбыз никадәр олугътыр, тәхкыйк без азган кешеләрдән булдык, Аллаһуның чигеннән чыктык.",
            "verse 68:32": "Без Раббыбыздан өмет итәбез бакчабызны яхшырак бакчага алыштыруын, тәхкыйк без Раббыбызга вә Аның гыйбадәтенә кызыгучыбыз\", – дип.",
            "verse 68:33": "Әнә шулайдыр дөнья ґәзабы чиктән үткәннәр! Ахирәт ґәзабы тагын да олугърактыр, әгәр аны кешеләр белсәләр,",
            "verse 68:34": "дөреслектә Аллаһудан куркып гөнаһтан сакланучы мөэминнәргә булыр Раббылары хозурында нәгыйм җәннәтләре.",
            "verse 68:35": "Әйә Безгә итагать итүче мөселманнарны кәферләр кеби яки ышанып та Аллаһуга итагать итмичә гөнаһка чумган динсезләр кеби кылырбызмы, аларны бер дәрәҗәгә вә бер урынга куярбызмы? Димәк тел белән генә үзләрен мөселман санап динсез йөргән кешеләр Коръәнгә тотынмасалар һәм намаз укымасалар, рузә тотмасалар – Аллаһудан яхшылык көтмәсеннәр!",
            "verse 68:36": "Ий кәферләр вә ышанучы динсезләр, сезгә нәрсә булды, әллә гакылыгызга диваналык ирештеме, чын мөселманнар өчен генә хәзерләнгән җәннәтләргә Аллаһ сезне дә кертер дип уйлыйсызмы?",
            "verse 68:37": "Әллә сезнең күктән иңгән китабыгыз булып, аны укыйсызмы.",
            "verse 68:38": "Тәхкыйк сезгә ни теләсәгез, шул булыр, дип язылганмы ул китапта?",
            "verse 68:39": "Әллә сезгә кыямәт көненә чаклы ни генә хөкем итсәгез дә вә ни генә теләсәгез дә шул сезгә булыр дигән, Безгә биргән ышанычлы ґәһедләрегез бармы? Ягъни ничек теләсәгез – шулай азарга Аллаһудан сезгә рөхсәт бармы?",
            "verse 68:40": "Син алардан сорагыл – кайсы бу ялган хөкемнәрен вә батыл дәгъваләрен өстенә ала, яки бу сүзләрне кайсысы дөресли ала.",
            "verse 68:41": "Әллә аларның Аллаһуга каршы сөйли торган Аллаһудан башка Аллалары бармы? Әгәр булса – китерсеннәр, дөрес сөйләүчеләрдән булсалар.",
            "verse 68:42": "Бер көн эшләрнең пәрдәләре ачылыр, хак батылдан аерылыр һәм сәҗдәгә чакырылырлар, ләкин кәферләрнең вә монафикъларның сәҗдә кылырга көчләре җитмәс.",
            "verse 68:43": "Куркудан күзләре түбән салынган булыр вә аларны хурлык каплар. Тәхкыйк алар дөньяда сәҗдә кылырга, ягъни намаз укырга боерылган иделәр, ләкин укымадылар, үзләре сәламәт тә иделәр, намаз укымаска һич гозерләре юк иде.",
            "verse 68:44": "Ий Мухәммәд г-м, Коръәнне ялганга тотучыларны минем белән калдыр, ягъни Коръән сүзләрен катлап-катлап ишетеп тә аны инкяр итүче динсезләрне Миңа тапшыр да алардан кисел, тиздән аларны ґәзабка тартырбыз алар белмәгән юл белән.",
            "verse 68:45": "Аларга вакыт бирермен, ґәзаб кылырга ашыкмамын, тәхкыйк Минем хәйләм төпледер, ґәзабымнан һич котыла алмаслар.",
            "verse 68:46": "Ислам динен өйрәткән өчен син әллә алардан хезмәт хакын сорыйсыңмы, алар шул хакны түләргә авырсынып Ислам динен кабул итмиләрме?",
            "verse 68:47": "Әллә алар хозурында яшерен эшне белү белеме бармы, ягъни Ләүхүл Мәхфуз алар хозурында булып шуннан күчереп язалармы, шуның өчен аларның синең пәйгамбәрлегеңә ихтыяҗлары юкмы?",
            "verse 68:48": "Чыда Раббыңның хөкеменә һәм кәферләрнең каршылык күрсәтүләренә, вә балык юлдашы Йунүс кеби булма Ул Йунүс балык эчендә тарлыкта Раббысына мөнәҗәть итте, ялварды эченә кайгы тулган хәлдә.",
            "verse 68:49": "Әгәр ул Йунүскә балык эчендә Раббысыннан нигъмәт ирешмәгән булса иде, әлбәттә, балык эченнән чыгарылып агачсыз вә үләнсез булган кызу сәхрәгә хур ителеп ташланыр иде.",
            "verse 68:50": "Ул Йунүсне Раббысы ихтыяр кылды, яңадан вәхий иңдереп пәйгамбәрлеген дәвам иттерде, дәхи аны изгеләрдән кылды.",
            "verse 68:51": "Кәферләр Мухәммәд г-мнең Коръән укыганын яки Коръәннән вәгазь сөйләгәнен ишетсәләр, ачуларыннан яки хөседләнеп зәһәрле карашлары белән, аны аягыннан егарга якынлашалар иде һәм ул Мухәммәд мәҗнүн дияләр иде",
            "verse 68:52": "Ул – Коръән бөтен мәхлүкатны уятучы вә Аллаһының яхшыларга рәхмәтне, яманларга ґәзабны искә тешерүчедер һәм иманны, динне, һидәятне һәм яхшылыкны кәсеп итәр өчен Аллаһ тарафыннан кешеләргә күрсәтелгән якты туры юлдыр."
        },
        "Telugu": {
            "verse 68:1": "నూన్, కలం సాక్షిగా! మరియు వారు (దేవదూతలు) వ్రాస్తున్న దాని సాక్షిగా",
            "verse 68:2": "నీ ప్రభువు అనుగ్రహం వలన నీవు (ఓ ముహమ్మద్) పిచ్చివాడవు కావు",
            "verse 68:3": "మరియు నిశ్చయంగా, నీకు ఎన్నటికీ తరిగిపోని ప్రతిఫలం ఉంది",
            "verse 68:4": "మరియు నిశ్చయంగా, నీవు ఉత్తమమైన శీలవంతుడవు",
            "verse 68:5": "కావున త్వరలోనే నీవు చూడగలవు మరియు వారు కూడా చూడగలరు",
            "verse 68:6": "మీలో ఎవరికి పిచ్చి ఉందో",
            "verse 68:7": "నిశ్చయంగా, నీ ప్రభువు! ఆయనకు ఎవడు మార్గభ్రష్టుడయ్యాడో తెలుసు మరియు ఎవడు సన్మార్గం మీద ఉన్నాడో కూడా ఆయనకు బాగా తెలుసు",
            "verse 68:8": "కావున నీవు ఈ అసత్యవాదులను అనుసరించకు",
            "verse 68:9": "ఒకవేళ నీవు (ధర్మం విషయంలో) మెత్తపడితే వారు కూడా మెత్తపడ కోరుతున్నారు",
            "verse 68:10": "కావున నీవు ప్రమాణాలు చేసే ప్రతి నీచుడిని అనుసరించకు",
            "verse 68:11": "చాడీలు చెప్పేవాడిని, ఎత్తి పొడుస్తూ ఉండేవాడిని",
            "verse 68:12": "మంచిని నిరోధించేవాడిని, హద్దు మీరి ప్రవర్తించే పాపిష్ఠుడిని",
            "verse 68:13": "నిర్ధయుడిని, ఇంతే గాకుండా అపఖ్యాతి గల (నిందార్హుడైన) వాడిని",
            "verse 68:14": "వాడు ధనవంతుడూ మరియు సంతాన భాగ్యంతో తలతూగుతూ ఉన్నవాడు అయినా సరే",
            "verse 68:15": "ఒకవేళ వాడికి మా సూచనలు (ఆయాత్) వినిపిస్తే, అందుకు వాడు: ఇవి పూర్వకాలపు కట్టుకథలే!\" అని అంటాడు",
            "verse 68:16": "మేము త్వరలోనే వాడి ముక్కు మీద వాత పెడ్తాము",
            "verse 68:17": "నిశ్చయంగా, మేము ఆ తోటవారిని పరీక్షించినట్లుగా వీరిని కూడా పరీక్షిస్తాము. ఎవరైతే తెల్లవారగానే తప్పక దాని పంట కోసుకుందామని ప్రతిజ్ఞ చేసుకున్నారో",
            "verse 68:18": "మరియు (అల్లాహ్ కోరితే) అనే, మినహాయింపుకు తావు ఇవ్వకుండా",
            "verse 68:19": "కావున వారు పడుకొని ఉండగానే నీ ప్రభువు తరఫు నుండి దానిపై (ఆ తోటపై) ఒక ఆపద వచ్చి పడింది",
            "verse 68:20": "దాంతో తెల్లవారే సరికి అది (ఆ తోట) పంట కోసిన పొలం వలే మారి పోయింది",
            "verse 68:21": "తరువాత ఉదయం లేచి వారు ఒకరితో నొకరు ఇలా చెప్పుకోసాగారు",
            "verse 68:22": "మీరు పంటను కోయదలుచుకుంటే ఉదయమే మీ పొలానికి వెళ్ళండి",
            "verse 68:23": "ఆ తరువాత వారు ఒకరితోనొకరు (ఈ విధంగా) మెల్లగా చెప్పుకుంటూ బయలు దేరారు",
            "verse 68:24": "ఈ రోజు ఏ పేదవాడిని కూడా మీ దగ్గరకు రానివ్వకండి",
            "verse 68:25": "మరియు వారు (పేదవారిని) దగ్గరకు రానివ్వకూడదని గట్టి నిర్ణయంతో తెల్లవారు ఝామున బయలు దేరారు",
            "verse 68:26": "వారు దానిని (తోటను) చూసి ఇలా వాపోయారు: నిశ్చయంగా, మనం దారి తప్పాము",
            "verse 68:27": "కాదు! కాదు! మనం సర్వం కోల్పోయాము",
            "verse 68:28": "వారిలో మధ్యరకానికి చెందినవాడు ఇలా అన్నాడు: ఏమీ? నేను మీతో అనలేదా? మీరు ఎందుకు ఆయన (అల్లాహ్) పవిత్రతను కొనియాడరని (ఇన్ షా అల్లాహ్!` అనరని)",
            "verse 68:29": "వారు ఇలా అన్నారు: మా ప్రభువు సర్వలోపాలకూ అతీతుడు! నిశ్చయంగా, మేమే దుర్మార్గులము",
            "verse 68:30": "తరువాత వారు అభిముఖులై ఒకరి నొకరు నిందించుకోసాగారు",
            "verse 68:31": "వారు ఇలా వాపోయారు: అయ్యో! మా పాడుగాను! నిశ్చయంగా, మేము తలబిరుసుతనం చూపాము",
            "verse 68:32": "బహశా! మన ప్రభువు మనకు దీనికి బదులుగా దీని కంటే శ్రేష్ఠమైన దానిని ప్రసాదించ వచ్చు! నిశ్చయంగా, మనం మన ప్రభువు వైపునకు (పశ్చాత్తాపంతో) మరలుదాము",
            "verse 68:33": "ఈ విధంగా ఉంటుంది శిక్ష! మరియు పరలోక శిక్ష దీని కంటే ఘోరంగా ఉంటుంది. వారు ఇది తెలుసుకుంటే ఎంత బాగుండేది",
            "verse 68:34": "నిశ్చయంగా, దైవభీతి గలవారికి వారి ప్రభువు వద్ద పరమానందకరమైన స్వర్గవనాలు ఉంటాయి",
            "verse 68:35": "ఏమీ? మేము విధేయులను (ముస్లింలను) నేరస్థులతో సమానంగా ఎంచుదుమా",
            "verse 68:36": "మీకేమయింది? మీరు ఏ విధమైన నిర్ణయాలు చేస్తున్నారు",
            "verse 68:37": "మీ వద్ద ఏదయినా (దివ్య) గ్రంథముందా? దాని నుండి మీరు నేర్చుకోవటానికి",
            "verse 68:38": "నిశ్చయంగా, అందులో మీకు, మీరు కోరేదంతా ఉందని",
            "verse 68:39": "లేక, పునరుత్థాన దినం వరకు, మీరు నిర్ణయించుకున్నదే మీకు తప్పక లభిస్తుందని, మేము మీతో చేసిన గట్టి ప్రమాణం ఏదైనా ఉందా",
            "verse 68:40": "వారిలో దీనికి ఎవడు హామీగా ఉన్నాడో అడుగు",
            "verse 68:41": "లేక, వారికి ఎవరైనా (వారు అల్లాహ్ కు కల్పించిన) భాగస్వాములు ఉన్నారా? ఒకవేళ వారు సత్యవంతులే అయితే తమ ఆ భాగస్వాములను తీసుకు రమ్మను",
            "verse 68:42": "(జ్ఞాపకముంచుకోండి) ఏ రోజయితే పిక్క ఎముక తెరిచి వేయబడుతుందో! మరియు వారు సాష్టాంగం (సజ్దా) చేయటానికి పిలువబడతారో, అప్పుడు వారు (కపట విశ్వాసులు), అలా (సజ్దా) చేయలేరు",
            "verse 68:43": "వారి చూపులు క్రిందికి వాలిపోయి ఉంటాయి, అవమానం వారిని ఆవరించి ఉంటుంది. మరియు వాస్తవానికి వారు నిక్షేపంగా ఉన్నప్పుడు సాష్టాంగం (సజ్దా) చేయటానికి ఆహ్వానించబడితే (తిరస్కరించేవారు)",
            "verse 68:44": "కావున నన్ను మరియు ఈ సందేశాన్ని అబద్ధమని తిరస్కరించే వారిని వదలండి. వారు గ్రహించని విధంగా మేము వారిని క్రమక్రమంగా (వినాశం వైపునకు) తీసుకొని పోతాము",
            "verse 68:45": "మరియు నేను వారికి కొంత వ్యవధి నిస్తున్నాను. నిశ్చయంగా, నా పన్నాగం చాలా దృఢమైనది",
            "verse 68:46": "లేక, (ఓ ప్రవక్తా!) నీవు వారిని ఏదైనా ప్రతిఫలం ఇవ్వమని అడుగుతున్నావా? వారికి దాని రుణం భారమవటానికి",
            "verse 68:47": "లేక, వారి వద్ద ఏదైనా అగోచర జ్ఞానం ఉందా? వారు దానిని వ్రాసి పెట్టడానికి",
            "verse 68:48": "కావున నీవు నీ ప్రభువు ఆజ్ఞ కొరకు వేచి ఉండు. మరియు నీవు, చేపవాని (యూనుస్) వలే వ్యవహరించకు. (గుర్తుకు తెచ్చుకో) అతను దుఃఖంలో ఉన్నప్పుడు (తన ప్రభువును) మొర పెట్టుకున్నాడు",
            "verse 68:49": "అతని ప్రభువు అనుగ్రహమే గనక అతనికి అందక పోయి ఉంటే, అతను అవమానకరమైన స్థితిలో (చేప కడుపులో పడి ఉండేవాడు కాని మేము అతనిని క్షమించాము). కావున అతను చౌట (బంజరు) మైదానంలో విసరి వేయ బడ్డాడు",
            "verse 68:50": "చివరకు అతని ప్రభువు అతనిని ఎన్నుకొని సత్పురుషులలో చేర్చాడు",
            "verse 68:51": "మరియు ఆ సత్యతిరస్కారులు, ఈ సందేశాన్ని (ఖుర్ఆన్ ను) విన్నప్పుడు, తమ చూపులతో నీ కాళ్ళు ఊడగొడతారా అన్నట్లు (నిన్ను జారించి పడవేసేటట్లు) నిన్ను చూస్తున్నారు. మరియు వారు నిన్ను (ఓ ముహమ్మద్!): నిశ్చయంగా ఇతడు పిచ్చివాడు!\" అని అంటున్నారు",
            "verse 68:52": "కాని సర్వలోకాల (వారికి) ఇదొక హితోపదేశం మాత్రమే"
        },
        "Thai": {
            "verse 68:1": "นูน ขอสาบานด้วยปากกา และสิ่งที่พวกเขาขีดเขียน",
            "verse 68:2": "ด้วยความโปรดปรานแห่งพระเจ้าของเจ้า เจ้ามิได้เป็นผู้เสียสติ",
            "verse 68:3": "และแท้จริงสำหรับเจ้านั้นมีรางวัลอย่างมิขาดสาย",
            "verse 68:4": "และแท้จริง เจ้านั้นอยู่บนคุณธรรมอันยิ่งใหญ่",
            "verse 68:5": "แล้วเจ้าจะได้เห็นและพวกเขาก็จะได้เห็น",
            "verse 68:6": "ว่าผู้ใดในหมู่พวกเจ้าคือผู้วิกลจิริต",
            "verse 68:7": "แท้จริงพระเจ้าของเจ้านั้นพระองค์ทรงรู้ดียิ่งถึงผู้ที่หลงจากทางของพระองค์ และพระองค์ทรงรู้ดียิ่งถึงผู้ที่อยู่ในแนวทางที่ถูกต้อง",
            "verse 68:8": "ดังนั้นเจ้าอย่าได้ปฏิบัติตามบรรดาผู้ปฏิเสธเลย",
            "verse 68:9": "พวกเขาใคร่ที่จะเห็นว่า หากเจ้าอ่อนข้อ แล้วพวกเขาก็จะอ่อนข้อตาม",
            "verse 68:10": "และเจ้าอย่าปฏิบัติตามทุกคนที่เป็นนักสาบานที่ต่ำช้า",
            "verse 68:11": "ผู้นินทาตระเวนใส่ร้ายผู้อื่น",
            "verse 68:12": "ผู้ขัดขวางการทำความดี ผู้อธรรมทำร้ายบาปหนา",
            "verse 68:13": "เป็นคนหยาบคายเลวทราม ยิ่งกว่านั้นยังเป็นคนต่ำช้าแปลกปลอม",
            "verse 68:14": "โดยถือว่าเขาเป็นผู้มีทรัพย์สินและมีบุตรหลานมาก",
            "verse 68:15": "เมื่ออายาต (อัลกุรอาน) ทั้งหลายของเราถูกสาธยายแก่เขา เขากล่าวว่าเป็นนิยายเหลวไหลสมัยก่อน",
            "verse 68:16": "เราจะตีตราเขาบนปลายจมูก",
            "verse 68:17": "แท้จริงเราได้ทดสอบพวกเขา ดั่งเช่นที่เราได้ทดสอบบรรดาเจ้าของสวน เมื่อพวกเขาสาบานว่าจะเก็บเกี่ยวผลของมันในยามรุ่ง",
            "verse 68:18": "และพวกเขามิได้กล่าวคำว่า “อินชาอัลลอฮฺ”",
            "verse 68:19": "ดังนั้น การลงโทษจากพระเจ้าของเจ้าก็ได้มาทำลายสวนนั้น ขณะที่พวกเขากำลังนอนหลับอยู่",
            "verse 68:20": "ครั้นในตอนเช้า มันก็กลายเป็นเช่นถูกตัดอย่างราบเรียบ",
            "verse 68:21": "ดังนั้นพวกเขาจึงกู่ตะโกนให้ตื่นแต่เช้าตรู่",
            "verse 68:22": "จงเข้าไปในสวนของพวกท่านในตอนเช้าตรู่เถิด หากพวกท่านต้องการจะเก็บผลไม้",
            "verse 68:23": "แล้วพวกเขาพากันออกไป แล้วพวกเขาพูดกระซิบซึ่งกันและกันอย่างเบา ๆ",
            "verse 68:24": "ว่า วันนี้อย่าได้ให้คนยากจนขัดสนสักคนหนึ่ง เข้าไปหาพวกท่านในสวนนั้น",
            "verse 68:25": "และพวกเขาก็ได้ออกไปแต่เช้า ตั้งใจว่าจะเก็บผลไม้ให้หมดก่อนที่ยากจนจะเข้าไปในสวน",
            "verse 68:26": "ครั้นเมื่อพวกเขาเห็นสวน (อยู่ในสภาพที่ถูกทำลาย) พวกเขาก็กล่าวขึ้นว่าแท้จริงพวกเราหลงทางเสียแล้ว",
            "verse 68:27": "(บางคนกล่าวว่า) เปล่าดอก พวกเราถูกหวงห้ามสิทธิ์เสียแล้ว",
            "verse 68:28": "คนที่มีสติปัญญาคนหนึ่งในหมู่พวกเขากล่าวว่า ฉันมิได้บอกพวกท่านดอกหรือว่า ทำไม่พวกท่านจึงไม่กล่าวสดุดีแด่อัลลอฮฺ",
            "verse 68:29": "พวกเขาจึงกล่าวว่า มหาบริสุทธิ์แห่งพระเจ้าของเรา แท้จริงเรานั้นเป็นผู้อธรรม",
            "verse 68:30": "แล้วบางคนในหมู่พวกเขาก็หันไปต่อว่าซึ่งกันแล้วกัน",
            "verse 68:31": "พวกเขากล่าวว่าความหายนะประสบแก่เราแล้วเพราะเราเป็นผู้ละเมิดฝ่าฝืน",
            "verse 68:32": "บางทีพระเจ้าของเรา จะทรงเปลี่ยนแปลงสิ่งที่ดีกว่าให้แก่เรา แท้จริงเราหวังในความอภัยต่อพระเจ้าของเรา",
            "verse 68:33": "เช่นนั้นแหละการลงโทษ และแน่นอนการลงโทษในปรโลกนั้นยิ่งใหญ่นัก หากพวกเขาล่วงรู้",
            "verse 68:34": "แท้จริง สำหรับบรรดาผู้ยำเกรง ณ ที่พระเจ้าของพวกเขานั้นคือสวนสวรรค์หลากหลายแห่งบรมสุข",
            "verse 68:35": "ดังนั้นจะให้เราปฏิบัติแก่บรรดาผู้นอบน้อมเสมือนกับเราปฏิบัติแก่บรรดาผู้กระทำผิดกระนั้นหรือ ?",
            "verse 68:36": "เกิดอะไรขึ้นแด่พวกเจ้า ? ทำไมพวกเจ้าจึงตัดสินเช่นนั้น",
            "verse 68:37": "หรือว่าที่พวกเจ้ามีคัมภีร์ไว้สำหรับอ่าน ?",
            "verse 68:38": "ซึ่งในคัมภีร์นั้นมีสิ่งสำหรับพวกเจ้าที่พวกเจ้าจะเลือกเอาได้",
            "verse 68:39": "หรือว่าพวกเจ้าสัญญาผูกพันกับเราจนกระทั่งถึงวันกิยามะฮฺว่า แท้จริงสำหรับพวกเจ้านั้นจำได้ตามที่พวกเจ้าตัดสินเอาไว้",
            "verse 68:40": "มุฮัมมัดจงถามพวกเขาดูว่า คนใดในหมู่พวกเขาจะเป็นหัวหน้าในการตัดสินเรื่องนั้น",
            "verse 68:41": "หรือว่าพวกเขามีหุ้นส่วนกับอัลลอฮฺก็จงให้พวกเขานำหุ้นส่วนเหล่านั้นของพวกเขามา ถ้าหากพวกเขาสัตย์จริง",
            "verse 68:42": "วันที่น้าแข้งจะถูกเลิกขึ้น (ในวันกิยามะฮฺ พระเจ้าจะมาตัดสินคดี หน้าแข้งของพระองค์จะถูกเลิกขึ้น) และพวกเขาจะถูกเรียกให้มาสุญูด แต่พวกเขาไม่สามารถจะสุญูดได้",
            "verse 68:43": "สายตาของพวกเขาจะละห้อย ความต่ำต้อยจะปกคลุมพวกเขา และแน่นอนพวกเขาเคยถูกเรียกให้มาสุญูดแล้วขณะที่พวกเขายังอยู่ในสภาพที่ปลอดภัยดี",
            "verse 68:44": "ดังนั้นจงปล่อยให้ข้าเถิด สำหรับผู้ที่ปฏิเสธต่ออัลกุรอาน เราจะนำพวกเขาลงสู่ (การลงโทษ) ทีละขั้น โดยที่พวกเขาไม่รู้",
            "verse 68:45": "และข้าจะประวิงเวลาให้แก่พวกเขาแท้จริงอุบายของข้านั้นแข็งแรงนัก",
            "verse 68:46": "หรือว่าเจ้าได้ขอค่าตอบแทนจากพวกเขา ดังนั้นพวกเขาจึงแบกภาระหนักเพราะมีหนี้",
            "verse 68:47": "หรือว่าพวกเขารู้ในสิ่งเร้นลับ แล้วพวกเขาก็บันทึกเอาไว้",
            "verse 68:48": "ดังนั้น เจ้า (มุฮัมมัด) จงอดทนต่อไปเถิดต่อบัญชาของพระเจ้าของเจ้า และอย่าเป็นดั่งเช่นเจ้าของปลา (นะบียูนุส) ขณะที่เขาวิงวอนเขาอยู่ในสภาพที่ระทมทุกข์",
            "verse 68:49": "หากมิใช่เพราะความเมตตาจากพระเจ้าของเขามีมายังเขาแล้ว เขาคงถูกเหวี่ยงไปยังที่โล่งเตียน และเขาจะถูกตำหนิด้วย",
            "verse 68:50": "แต่พระเจ้าของเขาได้ทรงคัดเลือกเขา และทรงทำให้เขาอยู่ในหมู่ผู้กระทำความดี",
            "verse 68:51": "และบรรดาผู้ปฏิเสธศรัทธานั้นแทบจะทำให้สายตาของพวกเขาจ้องเขม็งไปยังเจ้า เมื่อพวกเขาได้ยินอัลกุรอานพวกเขาก็กล่าวว่าแท้จริงเขาเป็นคนบ้าแน่ ๆ",
            "verse 68:52": "แต่อัลกุรอานนั้นมิใช่อื่นใดนอกจากเป็นข้อตักเตือนแก่ประชาชาติทั้งหมด"
        },
        "Turkish": {
            "verse 68:1": "Nun; kalem ve onunla yazılanlara and olsun ki, sen Rabbinin nimetine uğramış bir kimsesin, deli (cinlenmiş) değilsin.",
            "verse 68:2": "Nun; kalem ve onunla yazılanlara and olsun ki, sen Rabbinin nimetine uğramış bir kimsesin, deli (cinlenmiş) değilsin.",
            "verse 68:3": "Doğrusu sana kesintisiz bir ecir vardır.",
            "verse 68:4": "Şüphesiz sen büyük bir ahlaka sahipsindir.",
            "verse 68:5": "Hanginizin aklından zoru olduğunu yakında sen de göreceksin, onlar da görecekler.",
            "verse 68:6": "Hanginizin aklından zoru olduğunu yakında sen de göreceksin, onlar da görecekler.",
            "verse 68:7": "Doğrusu senin Rabbin, yolundan sapıtanları çok iyi bilir; O, doğru yolda olanları da çok iyi bilir.",
            "verse 68:8": "Bundan böyle, yalanlayanlara itaat etme;",
            "verse 68:9": "(Onlar sana indirilen ayetlerden beğenmediklerini bırakman suretiyle senin) kendilerine yumuşak davranmanı isterler; böyle yapsan, onlar da seni över, yumuşak davranırlar.",
            "verse 68:10": "Diliyle iğneleyen, kovuculuk eden, iyiliği daima önleyen, aşırı giden, suç işleyen, çok yemin eden alçak zorbaya, bütün bunlar dışında bir de soysuzlukla damgalanmış kimseye, mal ve oğulları vardır diye aldırış etmeyesin.",
            "verse 68:11": "Diliyle iğneleyen, kovuculuk eden, iyiliği daima önleyen, aşırı giden, suç işleyen, çok yemin eden alçak zorbaya, bütün bunlar dışında bir de soysuzlukla damgalanmış kimseye, mal ve oğulları vardır diye aldırış etmeyesin.",
            "verse 68:12": "Diliyle iğneleyen, kovuculuk eden, iyiliği daima önleyen, aşırı giden, suç işleyen, çok yemin eden alçak zorbaya, bütün bunlar dışında bir de soysuzlukla damgalanmış kimseye, mal ve oğulları vardır diye aldırış etmeyesin.",
            "verse 68:13": "Diliyle iğneleyen, kovuculuk eden, iyiliği daima önleyen, aşırı giden, suç işleyen, çok yemin eden alçak zorbaya, bütün bunlar dışında bir de soysuzlukla damgalanmış kimseye, mal ve oğulları vardır diye aldırış etmeyesin.",
            "verse 68:14": "Diliyle iğneleyen, kovuculuk eden, iyiliği daima önleyen, aşırı giden, suç işleyen, çok yemin eden alçak zorbaya, bütün bunlar dışında bir de soysuzlukla damgalanmış kimseye, mal ve oğulları vardır diye aldırış etmeyesin.",
            "verse 68:15": "Ayetlerimiz ona okunduğu zaman: \"Öncekilerin masalları\" der.",
            "verse 68:16": "Onun havada olan burnunu yakında yere sürteceğiz.",
            "verse 68:17": "Biz bunları, vaktiyle bahçe sahiplerini denediğimiz gibi denedik. Sahipleri daha sabah olmadan, bahçeyi devşireceklerine bir istisna payı bırakmaksızın yemin etmişlerdi.",
            "verse 68:18": "Biz bunları, vaktiyle bahçe sahiplerini denediğimiz gibi denedik. Sahipleri daha sabah olmadan, bahçeyi devşireceklerine bir istisna payı bırakmaksızın yemin etmişlerdi.",
            "verse 68:19": "Ama onlar daha uykudayken Rabbinin katından gönderilen bir salgın o bahçeyi sarıvermişti de bahçe kapkara kesilmişti.",
            "verse 68:20": "Ama onlar daha uykudayken Rabbinin katından gönderilen bir salgın o bahçeyi sarıvermişti de bahçe kapkara kesilmişti.",
            "verse 68:21": "Sabah erken: \"Ürünlerinizi devşirecekseniz erken çıkın\" diye birbirlerine seslendiler.",
            "verse 68:22": "Sabah erken: \"Ürünlerinizi devşirecekseniz erken çıkın\" diye birbirlerine seslendiler.",
            "verse 68:23": "\"Bugün orada, hiçbir düşkün kimse yanımıza sokulmasın\" diye gizli gizli konuşarak yürüyorlardı.",
            "verse 68:24": "\"Bugün orada, hiçbir düşkün kimse yanımıza sokulmasın\" diye gizli gizli konuşarak yürüyorlardı.",
            "verse 68:25": "Yoksullara yardım etmeye güçleri yeterken böyle konuşarak erkenden gittiler.",
            "verse 68:26": "Bahçeyi gördüklerinde: \"Herhalde yolumuzu şaşırmış olacağız; belki de biz yoksun bırakıldık\" dediler.",
            "verse 68:27": "Bahçeyi gördüklerinde: \"Herhalde yolumuzu şaşırmış olacağız; belki de biz yoksun bırakıldık\" dediler.",
            "verse 68:28": "Ortancaları: \"Ben size Allah'ı anmanız gerekmez mi, dememiş miydim?\" dedi.",
            "verse 68:29": "\"Rabbimizi tenzih ederiz; doğrusu biz yazık etmiştik\" dediler.",
            "verse 68:30": "Birbirlerini yermeye başladılar.",
            "verse 68:31": "Sonra şöyle dediler: \"Yazıklar olsun bize; doğrusu azgınlık edenlerdendik.\"",
            "verse 68:32": "\"Belki Rabbimiz bize bundan daha iyisini verir; doğrusu artık, Rabbimizden dilemekteyiz.\"",
            "verse 68:33": "İşte azap böyledir; ama ahiret azabı daha büyüktür; keşke bilseler!",
            "verse 68:34": "Allah'a karşı gelmekten sakınanlara, Rableri katında nimet cennetleri vardır.",
            "verse 68:35": "Kendilerini Allah'a vermiş olanları hiç suçlular gibi tutar mıyız?",
            "verse 68:36": "Ne oluyorsunuz? Ne biçim hükmediyorsunuz?",
            "verse 68:37": "Yoksa okuduğunuz bir kitabınız mı var?",
            "verse 68:38": "Seçtikleriniz herhalde orada olacaktır.",
            "verse 68:39": "Yoksa aleyhimizde, kıyamet gününe kadar süregidecek ahidleriniz mi var ki, kendinize hükmettikleriniz sizin olacaktır?",
            "verse 68:40": "Sor onlara: \"Bunu kim üzerine alır?\"",
            "verse 68:41": "Yoksa onların ortakları mı vardır? Doğru sözlü iseler ortaklarını getirsinler.",
            "verse 68:42": "O gün işin dehşetinden baldırlar açılır; gözleri dönmüş olarak yüzlerini zillet bürür; secdeye çağırılırlar ama buna güçleri yetmez. Oysa, kendileri sapasağlam oldukları zaman secdeye çağırılmışlardı.",
            "verse 68:43": "O gün işin dehşetinden baldırlar açılır; gözleri dönmüş olarak yüzlerini zillet bürür; secdeye çağırılırlar ama buna güçleri yetmez. Oysa, kendileri sapasağlam oldukları zaman secdeye çağırılmışlardı.",
            "verse 68:44": "Kuran'ı yalanlayanları Bana bırak; Biz onları bilmedikleri yerden yavaş yavaş azaba yaklaştıracağız.",
            "verse 68:45": "Onlara mehil veriyorum; doğrusu Benim tuzağım sağlamdır.",
            "verse 68:46": "Yoksa, sen onlardan ücret istiyorsun da, ağır bir borç altında mı kalıyorlar? Elbette hayır.",
            "verse 68:47": "Yoksa, gaybın bilgisi kendilerinin katında da onlar mı yazıyorlar?",
            "verse 68:48": "Sen Rabbinin hükmüne kadar sabret; balık sahibi (Yunus) gibi olma, o, pek üzgün olarak Rabbine seslenmişti.",
            "verse 68:49": "Rabbinin katından ona bir nimet ulaşmasaydı, kınanmış olarak sahile atılacaktı.",
            "verse 68:50": "Rabbi onu seçip iyilerden kıldı. Doğrusu inkar edenler, Kuran'ı dinlediklerinde nerdeyse seni gözleriyle yıkıp devireceklerdi. \"O delidir\" diyorlardı.",
            "verse 68:51": "Rabbi onu seçip iyilerden kıldı. Doğrusu inkar edenler, Kuran'ı dinlediklerinde nerdeyse seni gözleriyle yıkıp devireceklerdi. \"O delidir\" diyorlardı.",
            "verse 68:52": "Oysa Kuran, alemler için bir öğütten başka bir şey değildir."
        },
        "Urdu": {
            "verse 68:1": "نٓ۔ قلم کی اور جو (اہل قلم) لکھتے ہیں اس کی قسم",
            "verse 68:2": "کہ (اے محمدﷺ) تم اپنے پروردگار کے فضل سے دیوانے نہیں ہو",
            "verse 68:3": "اور تمہارے لئے بے انتہا اجر ہے",
            "verse 68:4": "اور اخلاق تمہارے بہت (عالی) ہیں",
            "verse 68:5": "سو عنقریب تم بھی دیکھ لو گے اور یہ (کافر) بھی دیکھ لیں گے",
            "verse 68:6": "کہ تم میں سے کون دیوانہ ہے",
            "verse 68:7": "تمہارا پروردگار اس کو بھی خوب جانتا ہے جو اس کے رستے سے بھٹک گیا اور ان کو بھی خوب جانتا ہے جو سیدھے راستے پر چل رہے ہیں",
            "verse 68:8": "تو تم جھٹلانے والوں کا کہا نہ ماننا",
            "verse 68:9": "یہ لوگ چاہتے ہیں کہ تم نرمی اختیار کرو تو یہ بھی نرم ہوجائیں",
            "verse 68:10": "اور کسی ایسے شخص کے کہے میں نہ آجانا جو بہت قسمیں کھانے والا ذلیل اوقات ہے",
            "verse 68:11": "طعن آمیز اشارتیں کرنے والا چغلیاں لئے پھرنے والا",
            "verse 68:12": "مال میں بخل کرنے والا حد سے بڑھا ہوا بدکار",
            "verse 68:13": "سخت خو اور اس کے علاوہ بدذات ہے",
            "verse 68:14": "اس سبب سے کہ مال اور بیٹے رکھتا ہے",
            "verse 68:15": "جب اس کو ہماری آیتیں پڑھ کر سنائی جاتی ہیں تو کہتا ہے کہ یہ اگلے لوگوں کے افسانے ہیں",
            "verse 68:16": "ہم عنقریب اس کی ناک پر داغ لگائیں گے",
            "verse 68:17": "ہم نے ان لوگوں کی اسی طرح آزمائش کی ہے جس طرح باغ والوں کی آزمائش کی تھی۔ جب انہوں نے قسمیں کھا کھا کر کہا کہ صبح ہوتے ہوتے ہم اس کا میوہ توڑ لیں گے",
            "verse 68:18": "اور انشاء الله نہ کہا",
            "verse 68:19": "سو وہ ابھی سو ہی رہے تھے کہ تمہارے پروردگار کی طرف سے (راتوں رات) اس پر ایک آفت پھر گئی",
            "verse 68:20": "تو وہ ایسا ہوگیا جیسے کٹی ہوئی کھیتی",
            "verse 68:21": "جب صبح ہوئی تو وہ لوگ ایک دوسرے کو پکارنے لگے",
            "verse 68:22": "اگر تم کو کاٹنا ہے تو اپنی کھیتی پر سویرے ہی جا پہنچو",
            "verse 68:23": "تو وہ چل پڑے اور آپس میں چپکے چپکے کہتے جاتے تھے",
            "verse 68:24": "آج یہاں تمہارے پاس کوئی فقیر نہ آنے پائے",
            "verse 68:25": "اور کوشش کے ساتھ سویرے ہی جا پہنچے (گویا کھیتی پر) قادر ہیں",
            "verse 68:26": "جب باغ کو دیکھا تو (ویران) کہنے لگے کہ ہم رستہ بھول گئے ہیں",
            "verse 68:27": "نہیں بلکہ ہم (برگشتہ نصیب) بےنصیب ہیں",
            "verse 68:28": "ایک جو اُن میں فرزانہ تھا بولا کہ کیا میں نے تم سے نہیں کہا تھا کہ تم تسبیح کیوں نہیں کرتے؟",
            "verse 68:29": "(تب) وہ کہنے لگے کہ ہمارا پروردگار پاک ہے بےشک ہم ہی قصوروار تھے",
            "verse 68:30": "پھر لگے ایک دوسرے کو رو در رو ملامت کرنے",
            "verse 68:31": "کہنے لگے ہائے شامت ہم ہی حد سے بڑھ گئے تھے",
            "verse 68:32": "امید ہے کہ ہمارا پروردگار اس کے بدلے میں ہمیں اس سے بہتر باغ عنایت کرے ہم اپنے پروردگار کی طرف سے رجوع لاتے ہیں",
            "verse 68:33": "(دیکھو) عذاب یوں ہوتا ہے۔ اور آخرت کا عذاب اس سے کہیں بڑھ کر ہے۔ کاش! یہ لوگ جانتے ہوتے",
            "verse 68:34": "پرہیزگاروں کے لئے ان کے پروردگار کے ہاں نعمت کے باغ ہیں",
            "verse 68:35": "کیا ہم فرمانبرداروں کو نافرمانوں کی طرف (نعمتوں سے) محروم کردیں گے؟",
            "verse 68:36": "تمہیں کیا ہوگیا ہے کیسی تجویزیں کرتے ہو؟",
            "verse 68:37": "کیا تمہارے پاس کوئی کتاب ہے جس میں (یہ) پڑھتے ہو",
            "verse 68:38": "کہ جو چیز تم پسند کرو گے وہ تم کو ضرور ملے گی",
            "verse 68:39": "یا تم نے ہم سے قسمیں لے رکھی ہیں جو قیامت کے دن تک چلی جائیں گی کہ جس شے کا تم حکم کرو گے وہ تمہارے لئے حاضر ہوگی",
            "verse 68:40": "ان سے پوچھو کہ ان میں سے اس کا کون ذمہ لیتا ہے؟",
            "verse 68:41": "کیا (اس قول میں) ان کے اور بھی شریک ہیں؟ اگر یہ سچے ہیں تو اپنے شریکوں کو لا سامنے کریں",
            "verse 68:42": "جس دن پنڈلی سے کپڑا اٹھا دیا جائے گا اور کفار سجدے کے لئے بلائے جائیں گے تو سجدہ نہ کرسکیں گے",
            "verse 68:43": "ان کی آنکھیں جھکی ہوئی ہوں گی اور ان پر ذلت چھا رہی ہوگی حالانکہ پہلے (اُس وقت) سجدے کے لئے بلاتے جاتے تھے جب کہ صحیح وسالم تھے",
            "verse 68:44": "تو مجھ کو اس کلام کے جھٹلانے والوں سے سمجھ لینے دو۔ ہم ان کو آہستہ آہستہ ایسے طریق سے پکڑیں گے کہ ان کو خبر بھی نہ ہوگی",
            "verse 68:45": "اور میں ان کو مہلت دیئے جاتا ہوں میری تدبیر قوی ہے",
            "verse 68:46": "کیا تم ان سے کچھ اجر مانگتے ہو کہ ان پر تاوان کا بوجھ پڑ رہا ہے",
            "verse 68:47": "یا ان کے پاس غیب کی خبر ہے کہ (اسے) لکھتے جاتے ہیں",
            "verse 68:48": "تو اپنے پروردگار کے حکم کے انتظار میں صبر کئے رہو اور مچھلی (کا لقمہ ہونے) والے یونس کی طرح رہو نا کہ انہوں نے (خدا) کو پکارا اور وہ (غم و) غصے میں بھرے ہوئے تھے",
            "verse 68:49": "اگر تمہارے پروردگار کی مہربانی ان کی یاوری نہ کرتی تو وہ چٹیل میدان میں ڈال دیئے جاتے اور ان کا حال ابتر ہوجاتا",
            "verse 68:50": "پھر پروردگار نے ان کو برگزیدہ کرکے نیکوکاروں میں کرلیا",
            "verse 68:51": "اور کافر جب (یہ) نصیحت (کی کتاب) سنتے ہیں تو یوں لگتے ہیں کہ تم کو اپنی نگاہوں سے پھسلا دیں گے اور کہتے یہ تو دیوانہ ہے",
            "verse 68:52": "اور (لوگو) یہ (قرآن) اہل عالم کے لئے نصیحت ہے"
        },
        "Uyghur": {
            "verse 68:1": "نۇن. قەلەم بىلەن ۋە ئۇلار يازغان نەرسىلەر بىلەن قەسەمكى،",
            "verse 68:2": "(ئى مۇھەممەد!) سەن پەرۋەردىگارىڭنىڭ نېمىتى بىلەن، (مۇشرىكلار ئېيتقاندەك) مەجنۇن ئەمەسسەن",
            "verse 68:3": "مۇقەررەركى، سەن ئەلۋەتتە ئۆكسىمەس ساۋابقا ئېرىشىسەن",
            "verse 68:4": "(ئى مۇھەممەد!) سەن ھەقىقەتەن بۈيۈك ئەخلاققا ئىگىسەن",
            "verse 68:5": "كەلگۈسىدە قايسىڭلارنىڭ مەجنۇن ئىكەنلىكىنى سەن كۆرۈسەن، ئۇلارمۇ كۆرىدۇ",
            "verse 68:6": "كەلگۈسىدە قايسىڭلارنىڭ مەجنۇن ئىكەنلىكىنى سەن كۆرۈسەن، ئۇلارمۇ كۆرىدۇ",
            "verse 68:7": "شۈبھىسىزكى، سېنىڭ پەرۋەردىگارىڭ ئۆزىنىڭ يولىدىن ئازغانلارنى ئوبدان بىلىدۇ، ھىدايەت تاپقۇچىلارنىمۇ ئوبدان بىلىدۇ",
            "verse 68:8": "ئىنكار قىلغۇچىلارغا ئىتائەت قىلمىغىن",
            "verse 68:9": "ئۇلار سېنىڭ ئۆزلىرى بىلەن مادارا قىلىشىڭنى، شۇنىڭ بىلەن ئۆزلىرىنىڭ (سەن بىلەن) مادارا قىلىشىنى ئارزۇ قىلىدۇ",
            "verse 68:10": "قەسەمخور، پەس، غەيۋەتخور، سۇخەنچى، بېخىل، ھەددىدىن ئاشقۇچى، گۇناھكار، قوپال، ئۇنىڭ ئۈستىگە ھارامدىن بولغان ئادەم (يەنى ۋەلىد ئىبن مۇغىرە) گە ئىتائەت قىلمىغىن",
            "verse 68:11": "قەسەمخور، پەس، غەيۋەتخور، سۇخەنچى، بېخىل، ھەددىدىن ئاشقۇچى، گۇناھكار، قوپال، ئۇنىڭ ئۈستىگە ھارامدىن بولغان ئادەم (يەنى ۋەلىد ئىبن مۇغىرە) گە ئىتائەت قىلمىغىن",
            "verse 68:12": "قەسەمخور، پەس، غەيۋەتخور، سۇخەنچى، بېخىل، ھەددىدىن ئاشقۇچى، گۇناھكار، قوپال، ئۇنىڭ ئۈستىگە ھارامدىن بولغان ئادەم (يەنى ۋەلىد ئىبن مۇغىرە) گە ئىتائەت قىلمىغىن",
            "verse 68:13": "قەسەمخور، پەس، غەيۋەتخور، سۇخەنچى، بېخىل، ھەددىدىن ئاشقۇچى، گۇناھكار، قوپال، ئۇنىڭ ئۈستىگە ھارامدىن بولغان ئادەم (يەنى ۋەلىد ئىبن مۇغىرە) گە ئىتائەت قىلمىغىن",
            "verse 68:14": "بىزنىڭ ئايەتلىرىمىز ئۇنىڭغا ئوقۇپ بېرىلسە، ئۇنىڭ مال - مۈلكى ۋە ئوغۇللىرى بولغانلىقى ئۈچۈن، «(بۇ) بۇرۇنقىلارنىڭ ھېكايىلىرىدۇر»، دەيدۇ",
            "verse 68:15": "بىزنىڭ ئايەتلىرىمىز ئۇنىڭغا ئوقۇپ بېرىلسە، ئۇنىڭ مال - مۈلكى ۋە ئوغۇللىرى بولغانلىقى ئۈچۈن، «(بۇ) بۇرۇنقىلارنىڭ ھېكايىلىرىدۇر»، دەيدۇ",
            "verse 68:16": "ئۇنىڭ بۇرنىنى داغلاپ بەلگە سالىمىز",
            "verse 68:17": "شۈبھىسىزكى، بىز ئۇلارنى (يەنى مەككە ئاھالىسىنى) مەلۇم باغنىڭ ئىگىلىرىنى سىنىغاندەك (قەھەتچىلىك، ئاچارچىلىققا دۇچار قىلىش بىلەن) سىنىدۇق. ئۇلار (يەنى باغنىڭ ئىگىلىرى) ئۇنىڭ مېۋىلىرىنى (كەمبەغەللەر ئۇقمىسۇن، ئۇلارغا ھېچ نەرسە بەرمەيلى دېيىشىپ) سەھەردىلا ئۈزۈۋېلىشقا قەسەم ئىچىشكەن ئىدى",
            "verse 68:18": "ئۇلار خۇدا خالىسا دېمىگەن ئىدى",
            "verse 68:19": "ئۇلار ئۇخلاۋاتقاندا، باغقا پەرۋەردىگارىڭ تەرىپىدىن ئازاب (يەنى يانغىن) نازىل بولۇپ، باغ (كۆيۈپ) قاپقارا كۈلدەك بولۇپ قالدى",
            "verse 68:20": "ئۇلار ئۇخلاۋاتقاندا، باغقا پەرۋەردىگارىڭ تەرىپىدىن ئازاب (يەنى يانغىن) نازىل بولۇپ، باغ (كۆيۈپ) قاپقارا كۈلدەك بولۇپ قالدى",
            "verse 68:21": "ئۇلار: «ئەگەر (مېۋىلەرنى) ئۈزمەكچى بولساڭلار باغقا بېرىڭلار» دەپ، ئەتىگەندە بىر - بىرىنى توۋلاشتى",
            "verse 68:22": "ئۇلار: «ئەگەر (مېۋىلەرنى) ئۈزمەكچى بولساڭلار باغقا بېرىڭلار» دەپ، ئەتىگەندە بىر - بىرىنى توۋلاشتى",
            "verse 68:23": "ئۇلار ماڭدى، يولدا كېتىۋېتىپ: «بۈگۈن باغقا ھەرگىز بىر مىسكىنمۇ كىرمىسۇن» دېيىشىپ پىچىرلاشتى",
            "verse 68:24": "ئۇلار ماڭدى، يولدا كېتىۋېتىپ: «بۈگۈن باغقا ھەرگىز بىر مىسكىنمۇ كىرمىسۇن» دېيىشىپ پىچىرلاشتى",
            "verse 68:25": "ئۇلار: «(مىسكىنلەرنى باغقا كىرىشتىن) توسىيالايمىز دېگەن ئوي بىلەن، ئەتىگەندە تۇرۇشتى",
            "verse 68:26": "ئۇلار باغنىڭ (كۆيۈپ قاپقارا بولۇپ كەتكەنلىكىنى) كۆرۈپ: «بىز ھەقىقەتەن ئېزىپ قېلىپتۇق، ياق بىز (باغنىڭ مېۋىسىدىن) قۇرۇق قېلىپتۇق» دېدى",
            "verse 68:27": "ئۇلار باغنىڭ (كۆيۈپ قاپقارا بولۇپ كەتكەنلىكىنى) كۆرۈپ: «بىز ھەقىقەتەن ئېزىپ قېلىپتۇق، ياق بىز (باغنىڭ مېۋىسىدىن) قۇرۇق قېلىپتۇق» دېدى",
            "verse 68:28": "ئۇلارنىڭ ياخشىسى (يەنى ئەڭ ئەقىللىقى): «سىلەر نېمىشقا اﷲ قا تەۋبە قىلىپ تەسبىھ ئېيتمايسىلەر دېمىگەنمىدىم؟ دېدى",
            "verse 68:29": "ئۇلار: «پەرۋەردىگارىمىز! سېنى پاك ئېتىقاد قىلىمىزكى، بىز (مىسكىنلەرنىڭ ھەققىنى مەنئى قىلىش بىلەن) ھەقىقەتەن زۇلۇم قىلغۇچىلاردىن بولدۇق» دېدى",
            "verse 68:30": "شۇنىڭ بىلەن ئۇلار بىر - بىرگە قارىشىپ ئۆز ئارا مالامەت قىلىشتى",
            "verse 68:31": "ئۇلار دېيىشتى: «ۋاي بىزگە! بىز ھەقىقەتەن ھەددىمىزدىن ئېشىپتۇق",
            "verse 68:32": "ئۇمىدكى، پەرۋەردىگارىمىز بىزگە بۇنىڭدىن ياخشىراق باغنى بەرگەي، بىز ئەلۋەتتە پەرۋەردىگارىمىزدىن ئۈمىد قىلغۇچىلارمىز»",
            "verse 68:33": "ئازاب مانا مۇشۇنداقتۇر (يەنى قۇرەيشكىمۇ باغ ئىگىلىرىگە چۈشكەن ئازاب چۈشىدۇ). ئەگەر ئۇلار بىلسە، ئاخىرەتنىڭ ئازابى تېخىمۇ قاتتىقتۇر",
            "verse 68:34": "تەقۋادارلار پەرۋەردىگارىڭنىڭ دەرگاھىدا ھەقىقەتەن نازۇنېمەتلىك جەننەتلەردىن بەھرىمەن بولىدۇ",
            "verse 68:35": "بىز مۇسۇلمانلارنى كاپىرلار بىلەن باراۋەر قىلامدۇق؟",
            "verse 68:36": "سىلەرگە نېمە بولدى؟ قانداقچە مۇنداق ھۆكۈم چىقىرىسىلەر!",
            "verse 68:37": "ياكى سىلەردە (ئاسماندىن نازىل بولغان) بىر كىتاب بولۇپ، ئۇنىڭدىن سىلەرگە (قىيامەت كۈنى) خالىغىنىڭلار بار، دېگەننى ئوقۇدۇڭلارمۇ؟",
            "verse 68:38": "ياكى سىلەردە (ئاسماندىن نازىل بولغان) بىر كىتاب بولۇپ، ئۇنىڭدىن سىلەرگە (قىيامەت كۈنى) خالىغىنىڭلار بار، دېگەننى ئوقۇدۇڭلارمۇ؟",
            "verse 68:39": "ياكى سىلەر ھۆكۈم قىلغان نەرسەڭلارنىڭ بولۇشىغا بىز سىلەر بىلەن قىيامەت كۈنى ئاندىن ۋاقتى توشىدىغان مەھكەم بىر ئەھدى تۈزۈشكەنمۇ؟",
            "verse 68:40": "ئۇلاردىن سوراپ باققىنكى، ئۇلارنىڭ ئارىسىدا قايسىسى يۇقىرىقى ئىشلارغا كېپىللىك قىلالايدۇ؟",
            "verse 68:41": "ياكى ئۇلارنىڭ (يۇقىرىقى ئىشلارغا كېپىللىك قىلىدىغان شېرىكلىرى) بارمۇ؟ ئەگەر ئۇلار (دەۋاسىدا) راستچىل بولسا، شېرىكلىرىنى كەلتۈرۈپ باقسۇن",
            "verse 68:42": "ئۇ كۈندە (يەنى قىيامەت كۈنىدە) ئىش قىيىنلىشىدۇ. ئۇلار (ئىمانىنى سىناش ئۈچۈن) سەجدە قىلىشقا چاقىرىلىدۇ، ئۇلار سەجدە قىلالمايدۇ",
            "verse 68:43": "ئۇلار (قورقۇنچتىن) تىكىلىپ قارىيالمايدۇ، ئۇلارغا خارلىق يۈزلىنىدۇ، ئۇلار (دۇنيادا) ساغلام چاغلىرىدا سەجدىگە دەۋەت قىلىنغان ئىدى (ئۇلار سەجدىدىن باش تارتاتتى)",
            "verse 68:44": "بۇ قۇرئاننى ئىنكار قىلغانلارنى ماڭا قويۇۋەتكىن، ئۇلارنى تۇيدۇرماستىن، ئاستا - ئاستا ھالاكەتكە يۈزلەندۈرىمىز",
            "verse 68:45": "ئۇلارغا مۆھلەت بېرىمەن، شۈبھىسىزكى، مېنىڭ تەدبىرىم پۇختىدۇر",
            "verse 68:46": "ياكى ئۇلاردىن (دىنغا دەۋەت قىلغانلىقىڭغا) ھەق سوراپ، ئۇلارنىڭ (ئىقتىسادىي) يۈكىنى ئېغىرلاشتۇرۇۋەتتىڭمۇ؟",
            "verse 68:47": "ياكى ئۇلارنىڭ يېنىدا غەيب (يەنى غەيبنى ئىچىگە ئالغان لەۋھۇلمەھپۇز) بار بولۇپ، ئۇلار (ئېيتىدىغانلىرىنى شۇنىڭغا) يازامدۇ؟",
            "verse 68:48": "پەرۋەردىگارىڭنىڭ ھۆكمىگە سەۋر قىلغىن، (ئالدىراڭغۇلۇقتا، زېرىككەكلىكتە) بېلىقنىڭ ساھىبىگە (يەنى يۇنۇسقا) ئوخشاش بولمىغىن، ئۆز ۋاقتىدا ئۇ (بېلىقنىڭ قارنىدا تۇرۇپ) غەمكىن ھالدا پەرۋەردىگارىغا ئىلتىجا قىلدى",
            "verse 68:49": "ئەگەر ئۇ پەرۋەردىگارىنىڭ نېمىتىگە ئېرىشمىسە ئىدى، ئەلۋەتتە، ئۇ (قىلمىشىغا) مالامەت قىلىنغان ھالدا (دەرەخمۇ يوق، تاغمۇ يوق) بىر دالىغا تاشلانغان بولاتتى",
            "verse 68:50": "پەرۋەردىگارى ئۇنى (پەيغەمبەرلىككە) تاللىدى، ئۇنى ياخشىلاردىن قىلدى",
            "verse 68:51": "كاپىرلار قۇرئاننى ئاڭلىغان چاغلىرىدا (ساڭا بولغان دۈشمەنلىكىنىڭ قاتتىقلىقىدىن يامان) كۆزلىرى بىلەن سېنى يىقىتىۋېتىشكە تاس قالىدۇ. سېنى: «شۈبھىسىز بىر مەجنۇن» دېيىشىدۇ",
            "verse 68:52": "قۇرئان پەقەت تامام ئەھلى جاھان ئۈچۈن ۋەز - نەسىھەتتۇر"
        },
        "Uzbek": {
            "verse 68:1": "Нуун. Қалам билан ва сатрларга ёзадиган нарсалар билан қасам.",
            "verse 68:2": "Сен Роббинг неъмати ила мажнун эмассан.",
            "verse 68:3": "Ва албатта, сенга миннат қилинмайдиган ажр бордур.",
            "verse 68:4": "Ва албатта, сен улкан хулқдасан.",
            "verse 68:5": "Бас, тезда кўрурсан ва улар ҳам кўрурлар.",
            "verse 68:6": "Сизлардан кимда жунунлик борлигини.",
            "verse 68:7": "Албатта, Роббинг Ўзи, ким Унинг йўлидан адашганини билувчидур ва У ҳидоятда юрувчиларни ҳам билувчидур.",
            "verse 68:8": "Бас, ёлғонга чиқарувчиларга итоат қилма.",
            "verse 68:9": "Агар сен муроса қилсанг, улар ҳам муроса қилишни орзу қиларлар.",
            "verse 68:10": "Итоат қилма! Ҳар бир қасамхўр, пасткашга.",
            "verse 68:11": "Кишиларни айбловчи, чақимчилик қилиб юрувчига.",
            "verse 68:12": "яхшиликни ман қилувчи, тажавузкор, сергуноҳга.",
            "verse 68:13": "Қўпол, ундан сўнг отасининг таъйини йўққа.",
            "verse 68:14": "Моли ва ўғиллари кўп бўлганидан.",
            "verse 68:15": "Бизнинг оятларимиз Унгаўқилган пайтда, аввалгиларнинг афсоналари, деганга.",
            "verse 68:16": "Тезда унинг тумшуғига белги қўямиз.",
            "verse 68:17": "Албатта, Биз уларини боғ эгаларини синаганимиздек синаб кўрдик. Вақтики, эрта тонгада териб оламиз, деб қасам ичдилар.",
            "verse 68:18": "Ва истисно қилмадилар.",
            "verse 68:19": "Улар ухлаб ётганда, боғ устидан Роббингдан бўлган айланувчи айланиб чиқди.",
            "verse 68:20": "Бас, у худди меваси териб олинганга ўхшаб қолди.",
            "verse 68:21": "Улар, тонг-саҳарда бир-бирларини чақирдилар:",
            "verse 68:22": "«Агар терадиган бўлсангиз, экинзорингизга эртароқ боринг», деб.",
            "verse 68:23": "Бас, паст овозла гаплашиб, юриб кетдилар.",
            "verse 68:24": "«Бугун сиз борингизда у боғга мискин кира кўрмасин», деб.",
            "verse 68:25": "Ва эрталабда қасдла, ўзларини қодир сезиб, бордилар.",
            "verse 68:26": "Уни кўрганларида, биз адашибмиз, дедилар.",
            "verse 68:27": "Балки биз маҳрум бўлгандиримиз, дедилар.",
            "verse 68:28": "Уларнинг энг яхши ва адолатлиси, «Сизларга тасбиҳ айтсаларингиз-чи, демабмидим?!», деди.",
            "verse 68:29": "Роббимиз айблардан пок бўлди, албатта биз золимлардан эдик, дедилар.",
            "verse 68:30": "Бас, баъзилари баъзиларни маломат қила бошладилар.",
            "verse 68:31": "Вой, шўримиз қурсин, туғёнга кетган эканмиз.",
            "verse 68:32": "Шояд Роббимиз унинг ўрнига ундан кўра яхшироғини берса. Биз ўз Роббимизга рағбатлимиз, дедилар.",
            "verse 68:33": "Азоб шундоқ бўлур ва агар билсалар, албатта охират азоби бундан катта бўладир.",
            "verse 68:34": "Албатта, тақводорлар учун Роббилари ҳузурида наъийм жаннатлари бордур.",
            "verse 68:35": "Мусулмонларни жинояткорларга ўхшатиб қўярмидик?!",
            "verse 68:36": "Сизларга нима бўлди, қандай ҳукм чиқаряпсизлар?!",
            "verse 68:37": "Ёки сизларнинг китобингиз бор-у, ундан ўқидингизми?",
            "verse 68:38": "Унда сизларга нимани ихтиёр қилсангиз, албатта, (бўлаверади) дейилганми?!",
            "verse 68:39": "Ёки сизларга Бизнинг қиёмат кунигача етадиган ваъдаларимиз бўлиб, унда, албатта, сиз нима ҳукм қилсангиз шу бўлади, дейилганми?!",
            "verse 68:40": "Сўра улардан, қай бирлари бу нарсага кафил экан?",
            "verse 68:41": "Ёки уларнинг шериклари бормикин, агар ростгўй бўлсалар, ўша шерикларини ҳам олиб келсинлар.",
            "verse 68:42": "Болдирлар шимарилган кунида ва улар саждага чақирилганда, қодир бўлмаслар.",
            "verse 68:43": "Уларнинг кўзлари қўрқинчга тўла, хорлик ўраб олган. Ва дарҳақиқат, улар саломатлик ҳолларида сажда қилишга чақирилган эдилар.",
            "verse 68:44": "Бу гапни ёлғонга чиқарувчиларни Менинг Ўзимга қўйиб қўй. Биз уларни ўзлари билмаган тарафдан аста-секин оламиз.",
            "verse 68:45": "Ва уларга муҳлат бераман, албатта, Менинг ҳийлам метиндир.",
            "verse 68:46": "Ёки сен улардан ҳақ сўраяпсану, улар қарзга ботиб қолдиларми?",
            "verse 68:47": "Ёки ҳузурларида ғойиб илми бору, улар ёзиб оладиларми?",
            "verse 68:48": "Роббинг ҳукмига сабр қил ва бир вақтлар ғамга тўлган ҳолда нидо қилган балиқ соҳибига ўхшама.",
            "verse 68:49": "Агар уни Роббисининг неъмати топмаганда, очиқ саҳро жойга, мазамматга қолган ҳолда ташланган бўларди.",
            "verse 68:50": "Бас, уни Роббиси танлаб олди ва солиҳ бандаларидан қилди.",
            "verse 68:51": "Ва кофирлар зикрни эшитаётганларида сени кўзлари билан тойдирмоқчи бўлдилар ва, албатта, у жиннидур, дерлар.",
            "verse 68:52": "Ҳолбуки, у бутун одамларга эслатмадан ўзга нарса эмас."
        },
        "Vietnamese": {
            "verse 68:1": "Nun. Thề bởi cây viết và những gì họ (nhân loại) ghi chép.",
            "verse 68:2": "(Hỡi Muhammad!) với hồng ân Thượng Đế của Ngươi, Ngươi không phải là một kẻ điên.",
            "verse 68:3": "Quả thật, Ngươi chắc chắn sẽ có được một phần thưởng vô tận.",
            "verse 68:4": "Và quả thật, Ngươi là người có phẩm chất đạo đức vĩ đại.",
            "verse 68:5": "Vì vậy, Ngươi sẽ thấy và chúng cũng sẽ thấy.",
            "verse 68:6": "Ai trong các ngươi là kẻ mắc bệnh điên.",
            "verse 68:7": "Thật vậy, Thượng Đế của Ngươi biết rõ nhất ai đã đi chệch hướng khỏi con đường của Ngài và Ngài biết rõ nhất ai là những người được hướng dẫn.",
            "verse 68:8": "Vì vậy, Ngươi đừng nghe theo những kẻ phủ nhận (Thông Điệp Ngươi mang đến).",
            "verse 68:9": "Chúng mong muốn nếu Ngươi nhượng bộ thì chúng cũng sẽ nhượng bộ.",
            "verse 68:10": "Ngươi đừng nghe theo những kẻ có thói quen thề thốt một cách vô bổ và đáng khinh.",
            "verse 68:11": "Kẻ chuyên nói xấu sau lưng và chuyên tới lui mách lẻo chuyện thiên hạ.",
            "verse 68:12": "Kẻ cản trở điều tốt, vượt quá giới hạn và tội lỗi.",
            "verse 68:13": "Ngoài ra, còn bạo ngược, hạ cấp đáng khinh.",
            "verse 68:14": "Bởi vì y sở hữu của cải và con cái.",
            "verse 68:15": "Khi những Lời Mặc Khải của TA được đọc cho y nghe, y nói: “Chuyện cổ tích của người xưa”.",
            "verse 68:16": "TA sẽ đóng dấu trên mõm của y!",
            "verse 68:17": "Thật vậy, TA đã thử thách chúng giống như việc TA đã thử thách những người chủ của một ngôi vườn khi họ thề sẽ hái hết trái của nó vào một buổi sáng sớm.",
            "verse 68:18": "Và họ đã không nói “Insha-Allah” (Nếu Allah muốn).",
            "verse 68:19": "Vì vậy, một thảm họa từ Thượng Đế của Ngươi đã ập đến khu vườn khi họ đang ngủ.",
            "verse 68:20": "Thế là sáng ra khu vườn trở thành một màu đen như bóng tối của màn đêm (do đã bị thiêu rụi).",
            "verse 68:21": "Rồi họ gọi nhau vào buổi sáng.",
            "verse 68:22": "“Nếu các người muốn hái trái thì hãy mau ra vườn cho sớm!”",
            "verse 68:23": "Vậy là họ rời đi và nói khẽ với nhau:",
            "verse 68:24": "“Đừng để bất cứ người nghèo nào vào vườn hôm nay!”",
            "verse 68:25": "Và họ đã đi thật sớm, nhất quyết trong ý đồ đó.",
            "verse 68:26": "Nhưng khi nhìn thấy khu vườn, họ nói: “Chắc chắn chúng ta đã đi lạc đường rồi.”",
            "verse 68:27": "“Không, đúng hơn là chúng ta đã bị tước mất (mùa màng).”",
            "verse 68:28": "Một người tốt nhất trong số họ nói: “Tôi đã không nói với các người hãy nên tán dương (Allah) đó sao?”",
            "verse 68:29": "Họ nói: “Vinh quang thay Thượng Đế của bầy tôi, bầy tôi thực sự là những kẻ sai quấy.”",
            "verse 68:30": "Sau đó, họ quay sang trách móc và đổ lỗi cho nhau.",
            "verse 68:31": "Họ nói: “Thật khốn khổ thay cho chúng ta! Chúng ta thực sự là những kẻ đã vượt mức giới hạn.”",
            "verse 68:32": "“Có lẽ Thượng Đế của chúng ta sẽ đổi lại cho chúng ta một ngôi vườn khác tốt hơn. Chúng ta thực sự hướng về Thượng Đế của chúng ta trong hy vọng và sự cầu mong.”",
            "verse 68:33": "Sự trừng phạt (trên thế gian) là như thế đấy. Nhưng sự trừng phạt ở Đời Sau chắc chắn còn lớn hơn nếu họ biết.",
            "verse 68:34": "Quả thật, những người ngoan đạo sẽ hưởng Thiên Đàng Hạnh Phúc nơi Thượng Đế của họ.",
            "verse 68:35": "Lẽ nào TA lại đối xử với những người Muslim giống như những kẻ tội lỗi?",
            "verse 68:36": "Các ngươi phân xử sao thế?!",
            "verse 68:37": "Hoặc phải chăng các ngươi có Kinh Sách mà các ngươi học?!",
            "verse 68:38": "Và trong đó thực sự có mọi điều để các ngươi lựa chọn?!",
            "verse 68:39": "Hoặc các ngươi có những lời thề (ràng buộc) TA kéo dài cho đến Ngày Phục Sinh rằng chắc chắn các ngươi sẽ có được bất cứ điều gì các ngươi quyết định?",
            "verse 68:40": "Ngươi (Thiên Sứ Muhammad) hãy hỏi chúng ai trong bọn chúng bảo đảm điều đó!",
            "verse 68:41": "Hoặc phải chăng các thần linh mà chúng tổ hợp (cùng với Allah đứng ra bảo đảm)? Nếu vậy, chúng hãy đưa những thần linh tổ hợp đó của chúng đến nếu chúng là những kẻ nói thật.",
            "verse 68:42": "Vào Ngày mà (Allah) phơi bày ống chân (của Ngài) và chúng (những kẻ vô đức tin và những kẻ giả tạo đức tin) sẽ được gọi đến quỳ lạy (Ngài) nhưng chúng không thể (quỳ được).",
            "verse 68:43": "Đôi mắt của chúng nhìn gục xuống một cách hèn hạ, sự nhục nhã bao phủ chúng. Và quả thật trước kia (trên thế gian) chúng đã từng được kêu gọi đến quỳ lạy (Allah) trong lúc chúng hãy còn khỏe mạnh.",
            "verse 68:44": "Vì vậy, Ngươi (hỡi Thiên Sứ Muhammad) hãy để mặc TA với những kẻ phủ nhận Lời (Qur’an) này. TA sẽ từ từ đưa chúng (đến sự trừng phạt) mà chúng không hề hay biết.",
            "verse 68:45": "TA tạm tha cho chúng (một thời gian). Bởi vì kế hoạch của TA rất chắc chắn.",
            "verse 68:46": "Hoặc có phải Ngươi (hỡi Thiên Sứ) đã đòi chúng tiền thù lao nên chúng nặng nề vì phải gánh nợ?",
            "verse 68:47": "Hoặc phải chăng chúng có kiến thức về điều vô hình nên chúng viết nó ra?",
            "verse 68:48": "Vì vậy, Ngươi (hỡi Thiên Sứ Muhammad) hãy kiên nhẫn chờ đợi quyết định của Thượng Đế của Ngươi và hãy đừng giống như Người Bạn của con cá voi (Yunus) khi Y cầu cứu trong lúc đau khổ tuyệt vọng.",
            "verse 68:49": "Nếu không nhờ Ân Huệ từ Thượng Đế của Y thì chắc chắn Y đã bị ném lên bờ biển hoang vu trong lúc Y đang bị khiển trách.",
            "verse 68:50": "Rồi Thượng Đế của Y đã chọn Y và làm cho Y trở thành một người bề tôi ngoan đạo và đức hạnh.",
            "verse 68:51": "Những kẻ vô đức tin gần như làm cho Ngươi (hỡi Thiên Sứ Muhammad) chệch hướng với cái nhìn của chúng khi chúng nghe Lời Nhắc Nhở; và chúng nói: “Y (Muhammad) chắc chắn là một tên điên.”",
            "verse 68:52": "Nhưng Nó (Qur’an) là lời nhắc nhở cho muôn loài."
        },
        "Yoruba": {
            "verse 68:1": "Nun. (Allahu bura pelu) gege ikowe ati ohun ti awon molaika n ko sile",
            "verse 68:2": "Iwo ki i se were nipa idera Oluwa re",
            "verse 68:3": "Ati pe dajudaju esan ti ko nii dawo duro ti wa fun o",
            "verse 68:4": "Dajudaju iwo si wa lori iwa aponle",
            "verse 68:5": "Laipe iwo yoo ri i, awon naa yo si ri i",
            "verse 68:6": "ewo ninu yin ni were",
            "verse 68:7": "Dajudaju Oluwa re, O nimo julo nipa eni t’o sina kuro loju ona Re. O si nimo julo nipa awon olumona",
            "verse 68:8": "Nitori naa, ma se tele awon olupe-ododo-niro",
            "verse 68:9": "Ati pe won fe ki o dewo, ki awon naa si dewo",
            "verse 68:10": "Ma se tele gbogbo eni ti ibura re po, eni yepere",
            "verse 68:11": "abuni, alarinka t’o n sofofo kiri",
            "verse 68:12": "oludena ise rere, alakoyo, elese",
            "verse 68:13": "odaju. Leyin iyen, asawo ni",
            "verse 68:14": "Nitori pe o ni dukia ati awon omokunrin",
            "verse 68:15": "nigba ti won ba n ke awon ayah Wa fun un, o maa wi pe: “Akosile alo awon eni akoko (niwonyi)”",
            "verse 68:16": "A maa fi ami si i ni gongori imu",
            "verse 68:17": "Dajudaju Awa dan won wo gege bi A se dan awon ologba wo nigba ti won bura pe dajudaju awon yoo ka gbogbo eso ogba naa ni owuro kutukutu",
            "verse 68:18": "Won ko si se ayafi pe \"ti Allahu ba fe",
            "verse 68:19": "Adanwo t’o n yi nnkan po lati odo Oluwa re si yi ogba naa po, nigba ti won sun lo",
            "verse 68:20": "O si da bi oko agedanu (ti won ti resun)",
            "verse 68:21": "Won n pera won ni owuro kutukutu",
            "verse 68:22": "pe e ji lo si oko yin ti e ba fe ka eso",
            "verse 68:23": "Won lo, won si n fi ohun jeeje bara won soro",
            "verse 68:24": "pe ni oni mekunnu kan ko gbodo wonu re wa ba yin",
            "verse 68:25": "Won ji lo lori ero-okan kan (pe) awon lagbara",
            "verse 68:26": "Nigba ti won ri i, won wi pe: \"Dajudaju awa ti sina",
            "verse 68:27": "Rara o, won se ikore oko leewo fun wa ni",
            "verse 68:28": "Eni t’o duro deede julo ninu won so pe: \"Se emi ko so fun yin pe eyin ko se safomo fun Allahu (pe \"a maa kore oko wa, ’in sa ’Allahu)",
            "verse 68:29": "Won wi pe: \"Mimo ni fun Oluwa wa, dajudaju awa je alabosi",
            "verse 68:30": "Apa kan won koju si apa kan; won si n dara won lebi",
            "verse 68:31": "Won wi pe: \"Egbe wa o! Dajudaju awa je olutayo-enu ala",
            "verse 68:32": "O see se ki Oluwa wa fi eyi t’o dara ju eyi lo paaro re fun wa. Dajudaju odo Oluwa wa ni awa n rokan oore si",
            "verse 68:33": "Bayen ni iya naa se ri (fun won). Iya orun si tobi julo, ti o ba je pe won mo",
            "verse 68:34": "Dajudaju awon Ogba Idera wa fun awon oluberu lodo Oluwa won",
            "verse 68:35": "Se A maa se awon musulumi bi (A se maa se) awon elese bi",
            "verse 68:36": "Ki l’o n se yin ti e fi n dajo bayii na",
            "verse 68:37": "Tabi tira kan wa fun yin ti e n kekoo ninu re",
            "verse 68:38": "pe dajudaju eyin le ni ohun ti e ba n sa lesa ninu idajo",
            "verse 68:39": "Nje e ni awon adehun kan lodo wa ti o maa wa titi di Ojo Ajinde pe: \"Dajudaju tiyin ni idajo ti e ba ti mu wa",
            "verse 68:40": "Bi won leere wo pe ewo ninu won l’o le fowo iyen soya",
            "verse 68:41": "Tabi won ni awon orisa kan? Ki won mu awon orisa won wa nigba naa ti won ba je olododo",
            "verse 68:42": "Ni ojo ti A maa si ojugun sile, A si maa pe won sibi iforikanle, won ko si nii le se e",
            "verse 68:43": "Oju won yoo wale. Iyepere maa bo won mole. Won kuku ti pe won sibi iforikanle nigba ti won ni alaafia (won ko si kirun)",
            "verse 68:44": "Nitori naa, fi Emi ati eni t’o n pe oro yii niro sile. A oo maa de won leke lati je won niya ni aye ti won ko mo",
            "verse 68:45": "Mo n lora fun won ni. Dajudaju ete Mi lagbara",
            "verse 68:46": "Tabi o n beere owo-oya kan lodo won, ni gbese fi wo won lorun",
            "verse 68:47": "Tabi lodo won ni (walaa) ikoko wa ni won ba n ko o (sita)",
            "verse 68:48": "Nitori naa, se suuru fun idajo Oluwa re. Ki iwo ma si se da bi eleja (iyen, Anabi Yunus) nigba ti o pe (Allahu) pelu ibanuje",
            "verse 68:49": "Ti ko ba je pe ike kan lati odo Oluwa re le e ba, won iba ju u sori ile gbansasa (lati inu eja) ni eni-eebu",
            "verse 68:50": "Nitori naa, Oluwa re sa a lesa. O si se e ni ara awon eni rere",
            "verse 68:51": "Awon t’o sai gbagbo fee fi oju won gbe o subu nigba ti won gbo iranti naa. Won si n wi pe: \"Dajudaju were ma ni",
            "verse 68:52": "Ki si ni al-Ƙur’an bi ko se iranti fun gbogbo eda"
        }
    }
}