{
    "id": 71,
    "name_simple": "Nuh",
    "revelation_place": "makkah",
    "revelation_order": 71,
    "bismillah_pre": true,
    "verses_count": 28,
    "short_text": "'Nuh' is the name of this Surah as well as the title of its subject matter, for in it, from beginning to the end, the story of the Prophet Noah has been related.",
    "text": [
        "\n",
        "\"Nuh\" is the name of this Surah as well as the title of its subject matter, for in it, from beginning to the end, the story of the Prophet Noah has been related.",
        "\n",
        "Period of Revelation",
        "\n",
        "This also is one of the earliest Surahs to be revealed at Makkah, but the internal evidence of its subject matter shows that it was sent down in the period when opposition to the Holy Prophet's message of Islam by the disbelievers of Makkah had grown very strong and active.",
        "\n",
        "Theme and Subject",
        "\n",
        "In this surah the story of the Prophet Noah has not been related only for the sake of story telling, but its object is to warn the disbelievers of Makkah, so as to say:\"You, O people of Makkah, are adopting towards Muhammad (upon whom be Allah's peace and blessings) the same attitude as the people of the Prophet Noah had adopted towards him; if you do not change this attitude, you too would meet with the same end.\" This had not been said in so many words anywhere in the Surah, but in the background of the conditions under which this story was narrated to the people of Makkah, this subject itself became obvious.",
        "\n",
        "vv. 2-4 briefly explain how he began his mission and what he preached.",
        "\n",
        "Then after suffering hardships and troubles in the way of preaching his mission for ages the report that he made to his Lord has been given in vv. 5-20. In it he states how he had been trying to bring his people to the right path and how his people had stubbornly opposed him.",
        "\n",
        "After this, the Prophet Noah's final submission has been recorded in vv. 21-24, in which he prays to his Lord, saying: \"These people have rejected my invitation: they are blindly following their chiefs, who have devised a tremendous plot of deceit and cunning. Time now has come when these people should be deprived of every grace to accept guidance.\" This was not an expression of impatience by the Prophet Noah, but when after having preached his message under extremely trying circumstances for centuries be became utterly disappointed with his people, he formed the opinion that no chance whatever was left of their coming to the right path. His this opinion fully conformed to Allah's own decision. Thus, in the next verse (25), it has been said: \"The torment of Allah descended on those people because of their misdeeds.\"",
        "\n",
        "In the concluding verse, the Prophet Noah's supplication that he made to his Lord, right at the time the torment descended, has been recorded. In it he prays for his own and for all the believers' forgiveness, and makes a submission to Allah to the effect: \"Do not leave any of the disbelievers alive on the earth, for they have become utterly devoid of every good: they will not beget any but disbelieving and wicked descendants.\"",
        "\n",
        "While studying this Surah one should keep in view the details of the Prophet Noah's story which have been given in the Qur'an above. For this see Al-Araf: 59-64, Yunus: 71-73, Hud: 25-49, Al-Mu'minun: 23-31, Ash- Shua'ra: 105-122, Al-Ankabut: 14-15, As-Saaffat: 75-82, Al-Qamar: 9-16.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "That surah that opens with the story of the ancient Prophet Noah, the unrelenting Messenger of Resolve, and his obstinately unbelieving people. It is named after Noah (Nūḥ) whose account is related in the surah and further gives details of the life of Noah before the Flood, to encourage the Prophet and warn the disbelievers.",
    "name_translation": "Noah",
    "name_complex": "Nûh",
    "surah_name_ar": "نوح",
    "verses": {
        "Albanian": {
            "verse 71:1": "Ne e kemi dërguar Nuhun te populli i tij: “Paralajmëro popullin tënd para se t’i arrijë dënimi i dhembshëm!”",
            "verse 71:2": "Ai tha: “O populli im, unë, me të vërtetë, jam për ju paralajmërues i qartë;",
            "verse 71:3": "që t’i luteni Perëndisë dhe t’i ruheni (kundërshtimit) të Atij dhe që të më dëgjoni mua,",
            "verse 71:4": "Ai ju falë mëkatet tuaja dhe do t’ju lërë të jetoni deri në çastin e caktuar, e kur t’ju vije çasti i caktuar i Perëndisë, me të vërtetë, ai nuk shtyhet; ta dini ju”.",
            "verse 71:5": "Ai tha: “O Zoti im, unë, me te vërtetë, e thirra popullin tim natë e ditë,",
            "verse 71:6": "por thirrja ime (nuk solli dobi, por) shkaktoi largim edhe më të madh.",
            "verse 71:7": "E, sa herë që i thërrita (unë) ata (në punë të mbarë), për t’i falur Ti, ata i shtinin gishtërinjtë në veshët e tyre dhe mbuloheshin me petkat e tyre (për të mos më parë) – ishin këmbëngulës dhe shumë mendjemëdhenj.",
            "verse 71:8": "Pastaj, i thirra haptazi (me zë edhe më të lartë),",
            "verse 71:9": "e mandej ua shpalla publikisht atë, si dhe në besim u përshpërita (i thirra në të gjitha format).",
            "verse 71:10": "Dhe ju thashë: Kërkoni falje nga Perëndia i jua, sepse, me të vërtetë, Ai është falës, i madh;",
            "verse 71:11": "Ai do t’ju dërgojë juve shi të bollshëm,",
            "verse 71:12": "dhe do t’ju ndihmojë me pasuri dhe me fëmijë, dhe për ju do të krijojë kopshtije dhe për ju do të krijojë lumenj.",
            "verse 71:13": "Përse nuk i frikoheni madhërisë së Perëndisë,",
            "verse 71:14": "e, Ai ju ka krijuar me forma (faza) të ndryshme?!",
            "verse 71:15": "A nuk po shihni se si Perëndia i ka krijuar shtatë qiejt – palë-palë (kat-kat),",
            "verse 71:16": "dhe në ta e ka bërë Hënën dritë, kurse Diellin e ka bërë fener (ndriçues)?",
            "verse 71:17": "Perëndia ju ka krijuar nga toka (dheu), ashtu si bimët,",
            "verse 71:18": "pastaj ju kthen te ajo dhe prej saj sërish do t’ju nxjerrë.",
            "verse 71:19": "Perëndia për ju Tokën e ka bërë shtrojë,",
            "verse 71:20": "që të ecni nëpër të, nëpër rrugët e gjera?”",
            "verse 71:21": "Nuhu tha: “O Zoti im, ata më kundërshtuan mua dhe u dhanë pas atyre, pasuria dhe fëmijët e të cilëve nuk kanë sjellë gjë tjetër, pos shkatërrimt,",
            "verse 71:22": "dhe trilluan trillime të mëdha (kundër Nuhut)",
            "verse 71:23": "dhe kanë thënë (populli i Nuhut): Mos i lini kurrsesi zotrat tuaja, mos e lini kurrsesi as Veddin, as Suvain, as Jeguthin, as Jeukin, as Nesrin’!",
            "verse 71:24": "E, këta idhujë kanë mashtruar shumë (njerëz); e ti (keqbërësve), mos u smadho asgjë, përpos humbjes!”",
            "verse 71:25": "Për shkak të mëkateve të tyre, ata janë përmbytur, e janë hedhur në zjarr dhe ata nuk kanë gjetur mbrojtës tjetër për vete, përveç Perëndisë.",
            "verse 71:26": "Dhe Nuhu tha: “O Zoti im, mos lë të qarkullojë në faqe të dheut asnjë mohues,",
            "verse 71:27": "sepse, me të vërtetë, nëse Ti i lë, ata – do t’i shpien në humbje robërit e Tu dhe do tëlindin vetëm mëkatarë dhe jobesimtarë!",
            "verse 71:28": "O Zoti im, falmë mua dhe prindërit e mi, dhe ata të cilët hynë në shtëpinë time si besimtarë, dhe besimtarët e besimtaret, ndërsa zullumqarëve shtoju vetëm shkatërrimin!"
        },
        "Amharic": {
            "verse 71:1": "እኛ ኑሕን «ሕዝቦችህን አሳማሚ ቅጣት ሳይመጣባቸው በፊት አስጠንቅቅ በማለት ወደ ሕዝቦቹ ላክነው፡፡»",
            "verse 71:2": "(እርሱም) አለ «ሕዝቦቼ ሆይ! እኔ ለእናንተ ገላጭ የኾንኩ አስጠንቃቂ ነኝ፡፡",
            "verse 71:3": "«አላህን ተገዙት፣ ፍሩትም፣ ታዘዙኝም በማለት፤ (አስጠንቃቂ ነኝ)፡፡",
            "verse 71:4": "«ለእናንተ ከኀጢኣቶቻችሁ ይምራልና፡፡ ወደተወሰነው ጊዜም ያቆያችኋል፡፡ የአላህ (የወሰነው) ጊዜ በመጣ ወቅት አይቆይም፡፡ የምታውቁት ብትኾኑ ኖሮ (በታዘዛችሁ ነበር)፡፡»",
            "verse 71:5": "(ስለ ተቃወሙትም) «አለ ጌታዬ ሆይ! እኔ ሌሊትም ቀንም ሕዝቦቼን ጠራሁ፡፡",
            "verse 71:6": "«ጥሪየም መሸሽን እንጅ ሌላ አልጨመረላቸውም፡፡",
            "verse 71:7": "«እኔም ለእነርሱ ትምር ዘንድ (ወደ እምነት) በጠራኋቸው ቁጥር ጣቶቻቸውን በጆሮዎቻቸው ውስጥ አደረጉ፡፡ ልብሶቻቸውንም ተከናነቡ፡፡ (በመጥፎ ሥራቸው ላይ) ዘወተሩም፡፡ (ያለ ልክ) መኩራትንም ኮሩ፡፡",
            "verse 71:8": "«ከዚያም እኔ በጩኸት ጠራኋቸው፡፡",
            "verse 71:9": "«ከዚያም እኔ ለእነርሱ ገለጽኩ፡፡ ለእነርሱም መመስጠርን መሰጠርኩ",
            "verse 71:10": "«አልኳቸውም፡- ጌታችሁን ምሕረትን ለምኑት፡፡ እርሱ በጣም መሐሪ ነውና፡፡",
            "verse 71:11": "«በእናንተ ላይ ዝናምን ተከታታይ አድርጎ ይልካል፡፡",
            "verse 71:12": "«በገንዘቦችና በልጆችም ይለግሰላችኋል፡፡ ለእናንተም አትክልቶችን ያደርግላችኋል፡፡ ለእናንተም ወንዞችን ያደርግላችኋል፡፡»",
            "verse 71:13": "ለአላህ ልቅናን የማትሹት ለእናንተ ምን አላችሁ?",
            "verse 71:14": "በልዩ ልዩ ኹኔታዎች በእርግጥ የፈጠራችሁ ሲኾን፡፡",
            "verse 71:15": "አላህ ሰባትን ሰማያት አንዱ ካንዱ በላይ ሲኾን እንዴት እንደፈጠረ አታዩምን?",
            "verse 71:16": "በውስጣቸውም ጨረቃን አብሪ አደረገ፡፡ ፀሐይንም ብርሃን አደረገ፡፡",
            "verse 71:17": "አላህም ከምድር ማብቀልን አበቀላችሁ፡፡",
            "verse 71:18": "ከዚያም በውስጧ ይመልሳችኋል፡፡ ማውጣትንም ያወጣችኋል፡፡",
            "verse 71:19": "አላህም ምድርን ለእናንተ ምንጣፍ አደረጋት፡፡",
            "verse 71:20": "ከእርሷ ሰፋፊዎችን መንገዶች ትገቡ ዘንድ፡፡",
            "verse 71:21": "ኑሕ አለ፡- «ጌታዬ ሆይ! እነሱ አምመጹብኝ፡፡ ገንዘቡና ልጁም ከጥፋት በስተቀር ያልጨመረለትን ሰው ተከተሉ፡፡",
            "verse 71:22": "«ታላቅንም ተንኮል የመከሩትን ሰዎች» (ተከተሉ)፡፡",
            "verse 71:23": "አሉም «አምላኮቻችሁን አትተዉ፡፡ ወድንም፣ ሱዋዕንም፣ የጉሥንም፣ የዑቅንም ነስርንም አትተው፡፡",
            "verse 71:24": "«በእርግጥም ብዙዎችን አሳሳቱ፡፡ ከሓዲዎችንም ጥመትን እንጅ ሌላን አትጨምርላቸው» (አለ)፡፡",
            "verse 71:25": "በኀጢኣቶቻቸው ምክንያት ተሰጠሙ፡፡ እሳትንም እንዲገቡ ተደረጉ፡፡ ለእነርሱም ከአላህ ሌላ የኾኑ ረዳቶችን አላገኙም፡፡",
            "verse 71:26": "ኑሕም አለ «ጌታዬ ሆይ! ከከሓዲዎቹ በምድር ላይ አንድንም አትተው፡፡",
            "verse 71:27": "«አንተ ብትተዋቸው ባሮችህን ያሳስታሉና፡፡ ኀጢኣተኛ ከሓዲንም እንጅ ሌላን አይወልዱም፡፡",
            "verse 71:28": "«ጌታዬ ሆይ! ለእኔም ለወላጆቼም ምእመን ኾኖ በቤቴ ለገባም ሰው ሁሉ ለምእመናንና ለምእምናትም ምሕረት አድርግ፡፡ ከሓዲዎችንም ከጥፋት በቀር አትጨምርላቸው፤» (አለ)፡፡"
        },
        "Arabic": {
            "verse 71:1": "ٌميِلَأ ٌباَذَع ْمُهَيِتْأَي نَأ ِلْبَق نِم َكَمْوَق ْرِذنَأ ْنَأ ِهِمْوَق ٰىَلِإ اًحوُن اَنْلَسْرَأ اَّنِإ",
            "verse 71:2": "ٌنيِبُّم ٌريِذَن ْمُكَل يِّنِإ ِمْوَق اَي َلاَق",
            "verse 71:3": "ِنوُعيِطَأَو ُهوُقَّتاَو َهَّللا اوُدُبْعا ِنَأ",
            "verse 71:4": "َنوُمَلْعَت ْمُتنُك ْوَل ۖ ُرَّخَؤُي اَل َءاَج اَذِإ ِهَّللا َلَجَأ َّنِإ ۚ ىًّمَسُّم ٍلَجَأ ٰىَلِإ ْمُكْرِّخَؤُيَو ْمُكِبوُنُذ نِّم مُكَل ْرِفْغَي",
            "verse 71:5": "اًراَهَنَو اًلْيَل يِمْوَق ُتْوَعَد يِّنِإ ِّبَر َلاَق",
            "verse 71:6": "اًراَرِف اَّلِإ يِئاَعُد ْمُهْدِزَي ْمَلَف",
            "verse 71:7": "اًراَبْكِتْسا اوُرَبْكَتْساَو اوُّرَصَأَو ْمُهَباَيِث اْوَشْغَتْساَو ْمِهِناَذآ يِف ْمُهَعِباَصَأ اوُلَعَج ْمُهَل َرِفْغَتِل ْمُهُتْوَعَد اَمَّلُك يِّنِإَو",
            "verse 71:8": "اًراَهِج ْمُهُتْوَعَد يِّنِإ َّمُث",
            "verse 71:9": "اًراَرْسِإ ْمُهَل ُتْرَرْسَأَو ْمُهَل ُتنَلْعَأ يِّنِإ َّمُث",
            "verse 71:10": "(اًراَّفَغ َناَك ُهَّنِإ ْمُكَّبَر اوُرِفْغَتْسا ُتْلُقَف",
            "verse 71:11": "(اًراَرْدِّم مُكْيَلَع َءاَمَّسلا ِلِسْرُي",
            "verse 71:12": "(اًراَهْنَأ ْمُكَّل لَعْجَيَو ٍتاَّنَج ْمُكَّل لَعْجَيَو َنيِنَبَو ٍلاَوْمَأِب مُكْدِدْمُيَو",
            "verse 71:13": "(اًراَقَو ِهَّلِل َنوُجْرَت اَل ْمُكَل اَّم",
            "verse 71:14": "(اًراَوْطَأ ْمُكَقَلَخ ْدَقَو",
            "verse 71:15": "(اًقاَبِط ٍتاَواَمَس َعْبَس ُهَّللا َقَلَخ َفْيَك اْوَرَت ْمَلَأ",
            "verse 71:16": "(اًجاَرِس َسْمَّشلا َلَعَجَو اًروُن َّنِهيِف َرَمَقْلا َلَعَجَو",
            "verse 71:17": "(اًتاَبَن ِضْرَأْلا َنِّم مُكَتَبنَأ ُهَّللاَو",
            "verse 71:18": "(اًجاَرْخِإ ْمُكُجِرْخُيَو اَهيِف ْمُكُديِعُي َّمُث",
            "verse 71:19": "(اًطاَسِب َضْرَأْلا ُمُكَل َلَعَج ُهَّللاَو",
            "verse 71:20": "(اًجاَجِف اًلُبُس اَهْنِم اوُكُلْسَتِّل",
            "verse 71:21": "(اًراَسَخ اَّلِإ ُهُدَلَوَو ُهُلاَم ُهْدِزَي ْمَّل نَم اوُعَبَّتاَو يِنْوَصَع ْمُهَّنِإ ِّبَّر ٌحوُن َلاَق",
            "verse 71:22": "(اًراَّبُك اًرْكَم اوُرَكَمَو",
            "verse 71:23": "(اًرْسَنَو َقوُعَيَو َثوُغَي اَلَو اًعاَوُس اَلَو اًّدَو َّنُرَذَت اَلَو ْمُكَتَهِلآ َّنُرَذَت اَل اوُلاَقَو",
            "verse 71:24": "(اًلاَلَض اَّلِإ َنيِمِلاَّظلا ِدِزَت اَلَو ۖ اًريِثَك اوُّلَضَأ ْدَقَو",
            "verse 71:25": "(اًراَصنَأ ِهَّللا ِنوُد نِّم مُهَل اوُدِجَي ْمَلَف اًراَن اوُلِخْدُأَف اوُقِرْغُأ ْمِهِتاَئيِطَخ اَّمِّم",
            "verse 71:26": "(اًراَّيَد َنيِرِفاَكْلا َنِم ِضْرَأْلا ىَلَع ْرَذَت اَل ِّبَّر ٌحوُن َلاَقَو",
            "verse 71:27": "(اًراَّفَك اًرِجاَف اَّلِإ اوُدِلَي اَلَو َكَداَبِع اوُّلِضُي ْمُهْرَذَت نِإ َكَّنِإ",
            "verse 71:28": "(اًراَبَت اَّلِإ َنيِمِلاَّظلا ِدِزَت اَلَو ِتاَنِمْؤُمْلاَو َنيِنِمْؤُمْلِلَو اًنِمْؤُم َيِتْيَب َلَخَد نَمِلَو َّيَدِلاَوِلَو يِل ْرِفْغا ِّبَّر"
        },
        "Azerbaijani": {
            "verse 71:1": "Həqiqətən, Biz Nuhu öz qövmünə göndərdik və dedik: “Sən öz qövmünü, onlara ağrılı-acılı bir əzab gəlməmişdən əvvəl xəbərdar et!”",
            "verse 71:2": "O dedi: “Ey qövmüm! Şübhəsiz ki, mən sizi aydın bir tərzdə xəbərdar edənəm!",
            "verse 71:3": "Allaha ibadət edin, Ondan qorxun və mənə itaət edin!",
            "verse 71:4": "Belə etsəniz, O sizin günahlarınızdan keçər və sizə müəyyən vaxtadək möhlət verər. Həqiqətən, Allahın müəyyən etdiyi vaxt gəlib çatdıqda əsla təxirə salınmaz. Kaş biləydiniz!”",
            "verse 71:5": "O dedi: “Ey Rəbbim, mən xalqımı gecə də, gündüz də dəvət etdim.",
            "verse 71:6": "Amma dəvətim onların haqdan qaçmalarını daha da artırdı.",
            "verse 71:7": "Sən onları bağışlayasan deyə mən hər dəfə onları imana dəvət etdikdə, onlar barmaqlarını qulaqlarına tıxayır, paltarlarına bürünür, küfrlərində israr edir və ötkəm-ötkəm təkəbbürlənirdilər.",
            "verse 71:8": "Sonra mən onları aşkarcasına dəvət etdim.",
            "verse 71:9": "Sonra mən onlara həm uca səslə, həm də gizlicə bildirib",
            "verse 71:10": "dedim: “Rəbbinizdən bağışlanmağınızı diləyin! Həqiqətən, O, çox Bağışlayandır!",
            "verse 71:11": "O, sizin üzərinizə bol-bol yağış göndərər,",
            "verse 71:12": "var-dövlət və oğul-uşaqla sizin imdadınıza çatar, sizin üçün bağlar salar və çaylar yaradar.",
            "verse 71:13": "Necə olub ki, siz Allahın böyüklüyünü layiqincə uca tutmursunuz?",
            "verse 71:14": "Axı O sizi mərhələlərlə yaratdı.",
            "verse 71:15": "Məgər Allahın yeddi göyü təbəqə-təbəqə necə yaratdığını görmürsünüz?",
            "verse 71:16": "Ayı bir nur, günəşi də çıraq etmişdir.",
            "verse 71:17": "Allah sizi torpaqdan bir bitki kimi bitirmişdir.",
            "verse 71:18": "Sonra O sizi ora qaytaracaq və yenidən çıxardacaqdır.",
            "verse 71:19": "Allah yeri sizin üçün xalı təki döşədi.",
            "verse 71:20": "Belə etdi ki, orada geniş yollarla hərəkət edəsiniz”.",
            "verse 71:21": "Nuh dedi: “Ey Rəbbim! Onlar mənə asi oldular və var-dövləti, övladı özünə zərərdən başqa bir şey artırmayan bir adama tabe oldular.",
            "verse 71:22": "Onlar mənə qarşı böyük bir hiylə işlətdilər",
            "verse 71:23": "və özlərinə tabe olanlara dedilər: “Öz məbudlarınızı tərk etməyin; Vəddi, Suvaı, Yəğusu, Yəuqu və Nəsri tərk etməyin!”",
            "verse 71:24": "Artıq onlar çoxlarını azdırmışlar. Sən də zalımlara azğınlıqdan başqa bir şey artırma”.",
            "verse 71:25": "Onlar öz günahlarına görə suya qərq edildilər və oda atıldılar. Onlar özlərinə Allahdan savayı köməkçilər tapmadılar.",
            "verse 71:26": "Nuh dedi: “Ey Rəbbim, kafirlərdən yer üzündə bir nəfəri belə sağ qoyma!",
            "verse 71:27": "Əgər Sən onları sağ qoysan, onlar qullarını azdıracaq və yalnız günahkar, kafir övladlar doğub-törədəcəklər.",
            "verse 71:28": "Ey Rəbbim! Məni, valideynlərimi, evimə mömin kimi daxil olanları və bütün mömin kişi və qadınları bağışla! Zülmkarların isə ancaq həlakını artır”."
        },
        "Bengali": {
            "verse 71:1": "আমি নূহকে প্রেরণ করেছিলাম তাঁর সম্প্রদায়ের প্রতি একথা বলেঃ তুমি তোমার সম্প্রদায়কে সতর্ক কর, তাদের প্রতি মর্মন্তদ শাস্তি আসার আগে।",
            "verse 71:2": "সে বলল, হে আমার সম্প্রদায়! আমি তোমাদের জন্যে স্পষ্ট সতর্ককারী।",
            "verse 71:3": "এ বিষয়ে যে, তোমরা আল্লাহ তা’আলার এবাদত কর, তাঁকে ভয় কর এবং আমার আনুগত্য কর।",
            "verse 71:4": "আল্লাহ তা’আলা তোমাদের পাপসমূহ ক্ষমা করবেন এবং নির্দিষ্ট সময় পর্যন্ত অবকাশ দিবেন। নিশ্চয় আল্লাহ তা’আলার নির্দিষ্টকাল যখন হবে, তখন অবকাশ দেয়া হবে না, যদি তোমরা তা জানতে!",
            "verse 71:5": "সে বললঃ হে আমার পালনকর্তা! আমি আমার সম্প্রদায়কে দিবারাত্রি দাওয়াত দিয়েছি;",
            "verse 71:6": "কিন্তু আমার দাওয়াত তাদের পলায়নকেই বৃদ্ধি করেছে।",
            "verse 71:7": "আমি যতবারই তাদেরকে দাওয়াত দিয়েছি, যাতে আপনি তাদেরকে ক্ষমা করেন, ততবারই তারা কানে অঙ্গুলি দিয়েছে, মুখমন্ডল বস্ত্রাবৃত করেছে, জেদ করেছে এবং খুব ঔদ্ধত্য প্রদর্শন করেছে।",
            "verse 71:8": "অতঃপর আমি তাদেরকে প্রকাশ্যে দাওয়াত দিয়েছি,",
            "verse 71:9": "অতঃপর আমি ঘোষণা সহকারে প্রচার করেছি এবং গোপনে চুপিসারে বলেছি।",
            "verse 71:10": "অতঃপর বলেছিঃ তোমরা তোমাদের পালনকর্তার ক্ষমা প্রার্থনা কর। তিনি অত্যন্ত ক্ষমাশীল।",
            "verse 71:11": "তিনি তোমাদের উপর অজস্র বৃষ্টিধারা ছেড়ে দিবেন,",
            "verse 71:12": "তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি বাড়িয়ে দিবেন, তোমাদের জন্যে উদ্যান স্থাপন করবেন এবং তোমাদের জন্যে নদীনালা প্রবাহিত করবেন।",
            "verse 71:13": "তোমাদের কি হল যে, তোমরা আল্লাহ তা’আলার শ্রেষ্টত্ব আশা করছ না।",
            "verse 71:14": "অথচ তিনি তোমাদেরকে বিভিন্ন রকমে সৃষ্টি করেছেন।",
            "verse 71:15": "তোমরা কি লক্ষ্য কর না যে, আল্লাহ কিভাবে সপ্ত আকাশ স্তরে স্তরে সৃষ্টি করেছেন।",
            "verse 71:16": "এবং সেখানে চন্দ্রকে রেখেছেন আলোরূপে এবং সূর্যকে রেখেছেন প্রদীপরূপে।",
            "verse 71:17": "আল্লাহ তা’আলা তোমাদেরকে মৃত্তিকা থেকে উদগত করেছেন।",
            "verse 71:18": "অতঃপর তাতে ফিরিয়ে নিবেন এবং আবার পুনরুত্থিত করবেন।",
            "verse 71:19": "আল্লাহ তা’আলা তোমাদের জন্যে ভূমিকে করেছেন বিছানা।",
            "verse 71:20": "যাতে তোমরা চলাফেরা কর প্রশস্ত পথে।",
            "verse 71:21": "নূহ বললঃ হে আমার পালনকর্তা, আমার সম্প্রদায় আমাকে অমান্য করেছে আর অনুসরণ করছে এমন লোককে, যার ধন-সম্পদ ও সন্তান-সন্ততি কেবল তার ক্ষতিই বৃদ্ধি করছে।",
            "verse 71:22": "আর তারা ভয়ানক চক্রান্ত করছে।",
            "verse 71:23": "তারা বলছেঃ তোমরা তোমাদের উপাস্যদেরকে ত্যাগ করো না এবং ত্যাগ করো না ওয়াদ, সূয়া, ইয়াগুছ, ইয়াউক ও নসরকে।",
            "verse 71:24": "অথচ তারা অনেককে পথভ্রষ্ট করেছে। অতএব আপনি জালেমদের পথভ্রষ্টতাই বাড়িয়ে দিন।",
            "verse 71:25": "তাদের গোনাহসমূহের দরুন তাদেরকে নিমজ্জিত করা হয়েছে, অতঃপর দাখিল করা হয়েছে জাহান্নামে। অতঃপর তারা আল্লাহ তা’আলা ব্যতীত কাউকে সাহায্যকারী পায়নি।",
            "verse 71:26": "নূহ আরও বললঃ হে আমার পালনকর্তা, আপনি পৃথিবীতে কোন কাফের গৃহবাসীকে রেহাই দিবেন না।",
            "verse 71:27": "যদি আপনি তাদেরকে রেহাই দেন, তবে তারা আপনার বান্দাদেরকে পথভ্রষ্ট করবে এবং জন্ম দিতে থাকবে কেবল পাপাচারী, কাফের।",
            "verse 71:28": "হে আমার পালনকর্তা! আপনি আমাকে, আমার পিতা-মাতাকে, যারা মুমিন হয়ে আমার গৃহে প্রবেশ করে-তাদেরকে এবং মুমিন পুরুষ ও মুমিন নারীদেরকে ক্ষমা করুন এবং যালেমদের কেবল ধ্বংসই বৃদ্ধি করুন।"
        },
        "Berber Amazigh": {
            "verse 71:1": "S tidep, Nuzen ed Nuê i ugdud is: \"endeô agdud ik, uqbel a ten id ias uâaqeb aqeôêan\".",
            "verse 71:2": "Inna: \"a yagdud iw! Nek, i kunwi, d aneddaô ipbegginen.",
            "verse 71:3": "Âabdet Öebbi, têezzbem aS, tessemêessem iyi.",
            "verse 71:4": "Ad Isemmeê seg ibekkaven nnwen, ad awen Ifk lmudda ar lajel ipwassnen. S tidep, lajel n Öebbi, ma iusa d, ur ipwexxiô, lemmer peéôim\"!",
            "verse 71:5": "Inna: \"a Mass iw! Nek, ssawale$ i ugdud iw, am yiv am ass.",
            "verse 71:6": "Siwa tugin i sen terna ti$ôi w.",
            "verse 71:7": "Nek, yal tikelt ara ten neccde$ iwakken a sen Tsemmêev, ad rren ivudan nnsen deg imeééu$en nnsen, ad pplen deg iceîîiven nnsen. Ggernennen, zuxxen s tem$weô.",
            "verse 71:8": "Sinna, ssawle$ asen s uâaggev.",
            "verse 71:9": "Sinna, âinani nni$ asen; s tuffra, sser, mli$ assen.",
            "verse 71:10": "Nni$: \"ssutret ssmaê i Mass nnwen; Neppa ard Win Ipsemmiêen.",
            "verse 71:11": "Ippazen awen d ageffur, seg igenni, d ihedman.",
            "verse 71:12": "Ayla akked tarwa, Issuget awen; Ifka yawen timizar; Irra yawen isaffen.",
            "verse 71:13": "Acu kwen iu$en, Öebbi, ur aS tgim ccan?",
            "verse 71:14": "Ni$ i waya, Ixelq ikwen.",
            "verse 71:15": "Ur twalam ara amek Ixleq Öebbi ûa igenwan d idurra?",
            "verse 71:16": "Irra degsen, aggur d tafat. Irra iîij d asavef.",
            "verse 71:17": "Öebbi Issem$i kwen seg wakal, am im$an.",
            "verse 71:18": "Sinna, a kwen Irr $uôes; sinna, d tuff$a ara kwen id Issuffe$.",
            "verse 71:19": "Öebbi Irra yawen tamurt d tuwsiât,",
            "verse 71:20": "iwakken, degs, a ppafem iberdan d tiza\".",
            "verse 71:21": "Inna Nuê: \"a Mass iw! Atnan âuûan iyi. Ddan akked win iwumi, ayla s akked tarwa s, ay s rnan, siwa lexsaôa\".",
            "verse 71:22": "Sxedmen tiêila meqqwôen.",
            "verse 71:23": "Nnan: \"ur ppaooat iôebbiten nnwen! Ur ppaooat Wadd, Suwaâ, Ya$ut, Yaâuq, akked Naûô\"!",
            "verse 71:24": "Ni$ aîas ay telfen. Ur Trennuv i imednas, siwa ttelfan.",
            "verse 71:25": "Ilmend n tuccva nnsen, $evûen, sinna kecmen ar tmes. War Öebbi, ur ppafen imâiwnen nnsen.",
            "verse 71:26": "Inna Nuê: \"a Mass iw! Ur Ppaooa, seg ijehliyen, amezda$ di tmurt!",
            "verse 71:27": "Aql aK id ma Teooiv ten, ad telfen imdanen iK. Siwa tijehli akked lâaô, ara d arwen.",
            "verse 71:28": "A Mass iw, Semmeê a$, nek akked imawlan iw, akked win id ikecmen s axxam iw, iumen, akked wid d tid iumnen. Ur Rennu i imednas, siwa aquccu\"."
        },
        "Bosnian": {
            "verse 71:1": "Mi smo poslali Nuha narodu njegovu: \"Opominji narod svoj prije nego što ga stigne patnja nesnosna!\"",
            "verse 71:2": "\"O narode moj\" – govorio je on – \"ja vas otvoreno opominjem:",
            "verse 71:3": "Allahu se klanjajte i Njega se bojte i meni poslušni budite,",
            "verse 71:4": "On će vam grijehe vaše oprostiti i u životu vas do određenog časa ostaviti, a kada Allahov određeni čas dođe zaista se neće, neka znate, odgoditi.\"",
            "verse 71:5": "On reče: \"Gospodaru moj, ja sam narod svoj i noću i danju, doista, pozivao,",
            "verse 71:6": "ali ga je pozivanje moje još više udaljilo.",
            "verse 71:7": "I kad god sam ih pozivao da im oprostiš, prste su svoje u uši stavljali i haljinama svojim se pokrivali – bili su uporni i pretjerano oholi.",
            "verse 71:8": "Zatim, ja sam ih otvoreno pozivao,",
            "verse 71:9": "a onda sam im javno objavljivao i u povjerenju im šaputao,",
            "verse 71:10": "i govorio: 'Tražite od Gospodara svoga oprost jer On, doista, mnogo prašta;",
            "verse 71:11": "On će vam kišu obilnu slati",
            "verse 71:12": "i pomoći će vas imanjima i sinovima, i daće vam bašče, i rijeke će vam dati.",
            "verse 71:13": "Šta vam je, zašto se Allahove sile ne bojite,",
            "verse 71:14": "a On vas postepeno stvara?!",
            "verse 71:15": "Zar ne vidite kako je Allah sedam nebesa, jedno iznad drugog, stvorio,",
            "verse 71:16": "i na njima Mjesec svijetlim dao, a Sunce svjetiljkom učinio?",
            "verse 71:17": "Allah vas od zemlje poput bilja stvara,",
            "verse 71:18": "zatim vas u nju vraća i iz nje će vas, sigurno, izvesti.",
            "verse 71:19": "Allah vam je Zemlju učinio ravnom,",
            "verse 71:20": "da biste po njoj hodili putevima prostranim.'\"",
            "verse 71:21": "Nuh reče: \"Gospodaru moj, oni mene ne slušaju i povode se za onima čija bogatstva i djeca samo njihovu propast uvećavaju",
            "verse 71:22": "i spletke velike snuju",
            "verse 71:23": "i govore: 'Nikako božanstva svoja ne ostavljajte, i nikako ni Vedda, ni Suvaa, a ni Jegusa, ni Jeuka, ni Jesra ne napuštajte!',",
            "verse 71:24": "a već su mnoge u zabludu doveli, pa Ti njima, inadžijama, samo propast povećaj!\"",
            "verse 71:25": "I oni su zbog grijehova svojih potopljeni i u vatru će biti uvedeni i nikoga sebi, osim Allaha, kao pomagača neće naći.",
            "verse 71:26": "I Nuh reče: \"Gospodaru moj, ne ostavi na Zemlji nijednog nevjernika,",
            "verse 71:27": "jer, ako ih ostaviš, oni će robove Tvoje u zabludu zavoditi i samo će grješnika i nevjernika rađati!",
            "verse 71:28": "Gospodaru moj, oprosti meni, i roditeljima mojim, i onome koji kao vjernik u dom moj uđe, i vjernicima i vjernicama, a nevjernicima samo propast povećaj!\""
        },
        "Bulgarian": {
            "verse 71:1": "Ние изпратихме Нух при неговия народ: “Предупреди народа си, докато не го е сполетяло болезнено мъчение!”",
            "verse 71:2": "Рече: “О, народе мой, аз съм явен предупредител за вас.",
            "verse 71:3": "Служете на Аллах и се бойте от Него, и ми се покорете!",
            "verse 71:4": "Тогава Той ще ви опрости греховете и ще ви даде отсрочка за определено време. Срокът на Аллах, когато дойде, не ще бъде забавен, ако знаете.”",
            "verse 71:5": "Рече: “Господи мой, зовях народа си нощем и денем,",
            "verse 71:6": "но зовът ми само увеличи тяхното бягство.",
            "verse 71:7": "И всякога, щом ги зовях, за да ги опростиш, запушваха с пръсти ушите си и се загръщаха в дрехите си, и упорстваха, и все повече се възгордяваха.",
            "verse 71:8": "После ги зовях открито,",
            "verse 71:9": "после им прогласявах явно и им шепнех тайно.",
            "verse 71:10": "И казвах: “Молете вашия Господ за опрощение - Той е многоопрощаващ,",
            "verse 71:11": "за да ви праща обилен дъжд от небето,",
            "verse 71:12": "и да ви подкрепя с имоти и синове, и да сторва за вас градини, и да сторва за вас реки.",
            "verse 71:13": "Какво ви е, защо не зачитате величието на Аллах?",
            "verse 71:14": "Сътвори ви Той на етапи.",
            "verse 71:15": "Нима не виждате как Аллах сътвори седем небеса на слоеве?",
            "verse 71:16": "И стори Той там от луната сияние, и стори от слънцето светилник.",
            "verse 71:17": "И ви създаде [от пръст] от земята да израснете.",
            "verse 71:18": "После ще ви върне в нея и отново ще ви извади [в Съдния ден].",
            "verse 71:19": "Аллах стори за вас от земята постеля,",
            "verse 71:20": "за да ходите там по широки пътища.”",
            "verse 71:21": "Рече Нух: “Господи мой, те ми се възпротивиха и последваха онези, чиито имоти и деца само увеличиха тяхната загуба.",
            "verse 71:22": "И лукавстваха те с огромно лукавство.",
            "verse 71:23": "И казваха: “Никога не изоставяйте своите божества, не изоставяйте нито Уад, нито Суаа, нито Ягус и Яук, и Наср!”",
            "verse 71:24": "И вече заблудиха те мнозина. И надбавяй на угнетителите само заблуда!”",
            "verse 71:25": "Заради своите грехове те бяха издавени и въведени в Огъня, и не намериха за себе си други помощници вместо Аллах.",
            "verse 71:26": "И рече Нух: “Господи мой, не оставяй по земята нито един неверник!",
            "verse 71:27": "Оставиш ли ги, те ще заблудят Твоите раби и ще родят само нечестивци, неблагодарници.",
            "verse 71:28": "Господи мой, опрости на мен и на родителите ми, и на всеки вярващ, който влезе в моя дом, и на вярващите мъже, и на вярващите жени, и надбавяй на угнетителите само гибел!”"
        },
        "Chinese": {
            "verse 71:1": "我确已派谴努哈去教化他的宗族，我说：在痛苦的刑罚降临你的宗族之前，你当警告他们。",
            "verse 71:2": "他说：我的宗族啊！我确是你们的坦率的警告者，",
            "verse 71:3": "你们应当崇拜真主，应当敬畏他，应当服从我，",
            "verse 71:4": "他就赦宥你们的罪过，并且让你们延迟到一个定期。真主的定期一旦来临的时候，是绝不延迟的，假若你们知道。",
            "verse 71:5": "他说：我的主啊！我确已日夜召唤我的宗族，",
            "verse 71:6": "但我的召唤使他们愈加逃避。",
            "verse 71:7": "我每次召唤他们来受你的赦宥的时候，他们总是以指头塞住他们的耳朵，以衣服蒙住他们的头，他们固执而自大。",
            "verse 71:8": "然后我大声召唤他们，",
            "verse 71:9": "然后我公开地训导他们，秘密地劝谏他们，",
            "verse 71:10": "我说，你们应当向你们的主求饶--他确是至赦的--",
            "verse 71:11": "他就使丰足的雨水降临你们，",
            "verse 71:12": "并且以财产和子嗣援助你们，为你们创造园圃和河流。",
            "verse 71:13": "你们怎么不希望真主的尊重呢？",
            "verse 71:14": "他确已经过几个阶段创造了你们。",
            "verse 71:15": "难道你们没有看到真主怎样创造7层天，",
            "verse 71:16": "并以月亮为光明，以太阳为明灯吗？",
            "verse 71:17": "真主使你们从大地生长出来，",
            "verse 71:18": "然后使你们再返於大地，然后，又把你们从大地取出来。",
            "verse 71:19": "真主为你们而平展大地，",
            "verse 71:20": "以便你们在大地上走著宽阔的道路。",
            "verse 71:21": "努哈说：我的主啊！他们确已违抗我，他们顺从那因财产和子嗣而更加亏折的人们，",
            "verse 71:22": "那等人曾定了一个重大的计谋，",
            "verse 71:23": "他们说：'你们绝不要放弃你们的众神明，你们绝不要放弃旺德、素佤尔、叶巫斯、叶欧格、奈斯尔。'",
            "verse 71:24": "他们确已使许多人迷误，求你使不义的人们更加迷误。",
            "verse 71:25": "他们因为自己的罪恶而被淹死，遂堕入火狱，故他们没有获得援助的人们来抵御真主。",
            "verse 71:26": "努哈说：我的主啊！求你不要留一个不信道大者在大地上，",
            "verse 71:27": "如果你留他们，他们将使你的众仆迷误，他们只生育不道德的、不感恩的子女。",
            "verse 71:28": "我的主啊！求你赦宥我和我的父母，赦宥信道而入我的房屋的人，以及信士们和信女们。求你使不义的人们更加毁灭。"
        },
        "Danish": {
            "verse 71:1": "Wij zonden Noach tot zijn volk, Waarschuw uw volk voordat een smartelijke straf over hen komt",
            "verse 71:2": "Noach zeide: O mijn volk! Waarlijk ik ben een duidelijke waarschuwer voor u",
            "verse 71:3": "Aanbidt daarom Allah, vreest Hem en gehoorzaamt mij",
            "verse 71:4": "Hij zal u uw zonden vergeven en u uitstel verlenen tot een bepaalde termijn; voorwaar, de termijn van Allah kan, wanneer hij komt, niet worden uitgesteld, als gij dit slechts wist",
            "verse 71:5": "Hij zeide: Mijn Heer, ik heb mijn volk dag en nacht geroepen",
            "verse 71:6": "Maar mijn roepen heeft slechts hun afkeer vermeerderd",
            "verse 71:7": "En telkens wanneer ik hen riep, opdat Gij hen zoudt vergeven stopten zij hun vingers in de oren, bedekten zich met hun kleren, volhardden (in hun ongeloof) en gedroegen zich laatdunkend",
            "verse 71:8": "Toen riep ik hen luide",
            "verse 71:9": "En verkondigde hun in het openbaar; ook sprak ik tot hen in het verborgene",
            "verse 71:10": "En ik zeide: Zoekt vergiffenis van uw Heer, want Hij is de Vergevensgezinde",
            "verse 71:11": "Hij zal regen voor u nederzenden in overvloed",
            "verse 71:12": "En Hij zal uw rijkdommen en kinderen vermeerderen, en Hij zal u tuinen en rivieren schenken",
            "verse 71:13": "Wat scheelt u, dat gij geen Wijsheid van Allah verwacht",
            "verse 71:14": "En Hij heeft u door verschillende stadia heen geschapen",
            "verse 71:15": "Hebt gij niet gezien, hoe Allah de zeven opeenvolgende hemelen schiep",
            "verse 71:16": "En hoe Hij de maan daarin als licht heeft geplaatst en de zon als een stralende lamp",
            "verse 71:17": "En Allah heeft u voortgebracht vanuit de aarde",
            "verse 71:18": "Vervolgens zal Hij u daarheen doen terugkeren, en u daaruit opnieuw doen verrijzen",
            "verse 71:19": "En Allah heeft de aarde voor u uitgespreid",
            "verse 71:20": "Zodat gij de brede wegen er van doorkruist",
            "verse 71:21": "Noach zeide: Mijn Heer, zij gehoorzamen mij niet, en volgen iemand wiens bezit en kinderen slechts tot zijn ondergang hebben bijgedragen",
            "verse 71:22": "En zij hebben een vreselijk plan gesmeed",
            "verse 71:23": "En zeggen tegen elkander: Verlaat uw goden nooit. Verlaat noch Wodd, noch Sowa, noch Jaghoes en Jaoeq en Nasr",
            "verse 71:24": "En zij hebben velen doen dwalen, en Gij doet de onrechtvaardigen slechts in dwaling toenemen",
            "verse 71:25": "Daarom werden zij vanwege hun zonden verdronken en in het Vuur gedreven. Zij konden daar voor zich geen helpers vinden tegen Allah",
            "verse 71:26": "En Noach had gezegd: Mijn Heer, laat in het land geen huis der ongelovigen achterblijven",
            "verse 71:27": "Want als Gij hen achterlaat zullen zij Uw dienaren op een dwaalspoor leiden en zij zullen niets dan een onzedelijk en ondankbaar nageslacht voortbrengen",
            "verse 71:28": "Mijn Heer, vergeef mij, en mijn ouders, en hem die gelovend mijn huis binnentreedt, ook de gelovige mannen en vrouwen; en doe de onrechtvaardigen slechts in verderf toenemen"
        },
        "Dutch": {
            "verse 71:1": "Voorwaar, Wij hebben Nôeh tot zijn volk gezonden (en zeiden tot hem): \"Waarschuw jouw volk voordat er een pijnlijke bestraffing tot hen komt.\"",
            "verse 71:2": "Hij zei: \"O mijn volk, ik ben voor jullie een duidelijke waarschuwer.",
            "verse 71:3": "Aanbidt Allah en vreest Hem en gehoorzaamt mij.",
            "verse 71:4": "Dan zal Hij jullie zonden vergeven en jullie uitstel geven tot een vastgesteld tijdstip. Voorwaar, wanneer het tijdstip van Allah komt, zal het niet worden uitgesteld. Als jullie dat wisten!''",
            "verse 71:5": "Hij (Nôeh) zei: \"Mijn Heer, ik heb mijn volk dag en nacht opgeroepen.",
            "verse 71:6": "Maar mijn oproep deed hun vluchten (van de Waarheid) slechts toenemen.",
            "verse 71:7": "En voorwaar, telkens wanneer ik hen opriep opdat U hun zou vergeven, stopten zij hun vingers in hun oren en bedekten zij (hun gezichten) met hun kleding en bleven zij uiterst hoogmoedig.",
            "verse 71:8": "Toen heb ik hen waarlijk met een harde stem opgeroepen.",
            "verse 71:9": "Vervolgens heb ik hun waarlijk openlijk toegesproken en hun vertrouwelijk toegesproken, heimelijk.''",
            "verse 71:10": "Toen zei ik: \"Vraagt jullie Heer om vergeving: voorwaar, Hij is Vergevensgezind.",
            "verse 71:11": "Hij zal dan overvloedige regens uit de hemel over jullie neerzenden.",
            "verse 71:12": "En jullie bezittingen en kinderen vermeerderen en Hij zal jullie tuinen schenken en Hij zal jullie rivieren schenken.",
            "verse 71:13": "Wat is er met jullie, dat jullie de Grootheid van Allah niet vrezen?",
            "verse 71:14": "Terwijl Hij jullie waarlijk in fasen heeft geschapen?",
            "verse 71:15": "Zien jullie niet hoe Allah de zeven hemelen in lagen heeft geschapen?",
            "verse 71:16": "En Hij heeft daarin de maan geplaatst als een licht en de zon als een lamp.",
            "verse 71:17": "En Allah heeft jullie als schepselen voortgebracht uit de aarde.",
            "verse 71:18": "Daarna keert Hij jullie in haar terug en brengt Hij jullie weer tevoorschijn.",
            "verse 71:19": "En Allah heeft voor jullie de aarde als een tapijt uitgespreid.",
            "verse 71:20": "Opdat jullie haar over brede wegen bereizen.\"",
            "verse 71:21": "Nôeh zei: \"Mijn Heer, zij gehoorzamen mij niet, en zij volgen degene wiens bezit en kinderen voor hen slechts verlies vermeerdert.",
            "verse 71:22": "En zij beraamden een grote list.",
            "verse 71:23": "En zij zeiden: \"Verlaat jullie goden niet en verlaat Wadd niet, en niet Soewâ'a, en niet Yaghôets en Ya'ôeq en Nasr.\"",
            "verse 71:24": "En waarlijk, zij deden velen dwalen. En (O Allah) doe voor de onrechtplegers slechts de dwaling toenemen.\"",
            "verse 71:25": "Vanwege hun zonden werden zij verdronken en daarna in de Hel gevoerd. En zij vonden buiten Allah om voor zich geen helpers.",
            "verse 71:26": "En Nôeh zei: \"Mijn Heer, laat op de aarde geen enkele ongelovige in leven.",
            "verse 71:27": "Voorwaar, als U hen (in leven) laat, zullen zij Uw dienaren doen dwalen en zij brengen niets voort dan losbandige ongelovigen.",
            "verse 71:28": "Mijn Heer, vergeef mij en mijn ouders en wie mijn huis binnentreedt als gelovige, en de gelovige mannen en de gelovige vrouwen. En doe voor de onrechtplegers slechts de vernietiging toenemen.\""
        },
        "English": {
            "verse 71:1": "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"",
            "verse 71:2": "He said, \"O my people, indeed I am to you a clear warner,",
            "verse 71:3": "[Saying], 'Worship Allah, fear Him and obey me.",
            "verse 71:4": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"",
            "verse 71:5": "He said, \"My Lord, indeed I invited my people [to truth] night and day.",
            "verse 71:6": "But my invitation increased them not except in flight.",
            "verse 71:7": "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.",
            "verse 71:8": "Then I invited them publicly.",
            "verse 71:9": "Then I announced to them and [also] confided to them secretly",
            "verse 71:10": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.",
            "verse 71:11": "He will send [rain from] the sky upon you in [continuing] showers",
            "verse 71:12": "And give you increase in wealth and children and provide for you gardens and provide for you rivers.",
            "verse 71:13": "What is [the matter] with you that you do not attribute to Allah [due] grandeur",
            "verse 71:14": "While He has created you in stages?",
            "verse 71:15": "Do you not consider how Allah has created seven heavens in layers",
            "verse 71:16": "And made the moon therein a [reflected] light and made the sun a burning lamp?",
            "verse 71:17": "And Allah has caused you to grow from the earth a [progressive] growth.",
            "verse 71:18": "Then He will return you into it and extract you [another] extraction.",
            "verse 71:19": "And Allah has made for you the earth an expanse",
            "verse 71:20": "That you may follow therein roads of passage.' \"",
            "verse 71:21": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.",
            "verse 71:22": "And they conspired an immense conspiracy.",
            "verse 71:23": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.",
            "verse 71:24": "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"",
            "verse 71:25": "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.",
            "verse 71:26": "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.",
            "verse 71:27": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.",
            "verse 71:28": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\""
        },
        "Filipino": {
            "verse 71:1": "Katotohanang Aming isinugo si Noe sa kanyang pamayanan na may tagubilin: “Iyong bigyang babala ang iyong pamayanan bago dumatal sa kanila ang Kasakit- sakit na Kaparusahan”",
            "verse 71:2": "Siya (Noe) ay nagbadya: “o aking pamayanan! Katotohanang ako ay isang lantad na Tagapagbabala sa inyo",
            "verse 71:3": "(Na nagtatagubilin) na marapat ninyong sambahin si Allah (lamang), at maging masunurin sa inyong tungkulin sa Kanya at ako ay inyong sundin",
            "verse 71:4": "Upang mapatawad Niya (Allah) ang inyong mga kasalanan at bigyan kayo ng sapat na panahon (palugit) na natatakdaan. Katotohanan, kung ang Takdang Oras ni Allah ay dumatal, ito ay hindi maaaring antalahin kung inyo lamang nababatid.”",
            "verse 71:5": "(Si Noe) ay nagbadya: o aking Panginoon! Katotohanang aking tinawagan ang aking pamayanan sa gabi at araw (alalaong baga, sa lingid at lantad upang tanggapin ang doktrina ng Kaisahan ni Allah)",
            "verse 71:6": "Datapuwa’t ang aking panawagan sa kanila ay higit lamang na nakadagdag sa kanilang pagnanais na mapalayo (sa Tuwid na Landas)",
            "verse 71:7": "At katotohanan! Sa bawat sandali na sila ay aking pinagtatagubilinan upang sila ay Inyong mapatawad, ay tinatakpan nila ang kanilang mga tainga ng kanilang daliri, at tinatakpan nila ang kanilang sarili ng kanilang kasuotan, at nagpapatuloy sila (sa kanilang Propeta Noe\t911 pagtutol) at pinag-iibayo nila ang kanilang kapalaluan",
            "verse 71:8": "At katotohanang ako ay nananawagan sa kanila nang hayagan (sa malakas na tinig)",
            "verse 71:9": "At katotohanang ako ay nagpahayag sa kanila sa karamihan at ako ay nagsumamo sa kanila sa pribado (tagong pag-uusap)",
            "verse 71:10": "Na nagsasabi: “Humingi kayo ng kapatawaran mula sa inyong Panginoon; katotohanang Siya ay Lagi nang Nagpapatawad",
            "verse 71:11": "Kayo ay pagkakalooban Niya ng saganang ulan",
            "verse 71:12": "At kayo ay gagawaran Niya ng higit pang kayamanan at mga anak, at ipagkakaloob Niya sa inyo ang halamanan at gayundin ng mga batis (na may tubig na nagsisidaloy).”",
            "verse 71:13": "Ano ang nagpapagulo sa inyo at hindi ninyo pinangangambahan si Allah (sa Kanyang kaparusahan), at kayo ay hindi umaasam ng gantimpala mula kay Allah o kayo ay hindi sumasampalataya sa Kanyang Kaisahan",
            "verse 71:14": "Samantalang kayo ay nilikha Niya sa (iba’t ibang) antas (alalaong baga, ang una ay Nutfah, sumunod ay Alaqa at sumunod ay Mudgha. [Tunghayan ang Quran)",
            "verse 71:15": "Hindi baga ninyo napagmamalas kung paano nilikha ni Allah ang pitong kalangitan, ng suson-suson (ang bawat isa ay mataas sa iba)",
            "verse 71:16": "At ginawa Niya ang buwan bilang liwanag doon at ng araw bilang isang ilaw",
            "verse 71:17": "At nilikha kayo ni Allah mula sa alabok ng lupa (na dahan-dahan sa paglaki at pagyabong)",
            "verse 71:18": "At pagkaraan, kayo ay ibabalik Niyang muli rito (sa lupa), at Kanyang ibabangon kayong (muli sa Araw ng Muling Pagkabuhay)",
            "verse 71:19": "At si Allah ang gumawa para sa inyo ng kalupaan na nakalatag nang malawak",
            "verse 71:20": "Upang kayo ay makapaglakad dito sa malalapad na landas",
            "verse 71:21": "Si Noe ay nagbadya: “Aking Panginoon! Katotohanang sila ay sumuway sa akin at sila ay sumunod sa kanya na ang 912 kayamanan at mga anak ay hindi makakapagbigay sa kanya ng kapakinabangan bagkus ay kapahamakan (pagkatalo).”",
            "verse 71:22": "At sila ay nagpakana ng malaking balak",
            "verse 71:23": "At sila ay nagsipag-usapan sa isa’t-isa: “Huwag ninyong tatalikdan ang inyong mga diyos, gayundin ay huwag ninyong iiwan si Wadd, at si Suwa, at si Yaguth, at si Ya’uq, at si Nasr (mga pangalan ng mga imahen at rebulto);”",
            "verse 71:24": "At katotohanang inakay nila ang karamihan sa pagkaligaw. At (o Allah)! “Huwag Kayong magbigay ng dagdag sa Zalimun (mga mapagsamba sa diyus-diyosan, mapaggawa ng kamalian, walang pananalig, atbp.), maliban sa kamalian.”",
            "verse 71:25": "dahilan sa kanilang mga kasalanan sila ay nilunod (sa dilubyo ng baha), at pinag-utusan na magsipasok sa Apoy (ng kaparusahan), at sila ay hindi nakatagpo ng sinuman na makakatulong sa kanila sa halip (bilang kapalit) ni Allah",
            "verse 71:26": "At si Noe ay nagturing: “Aking Panginoon! Huwag Kayong mag-iwan sa kalupaan ng kahit na isang hindi nananampalataya",
            "verse 71:27": "Kung sila ay Inyong iwan, ay kanilang ililigaw ang Inyong matatapat na alipin, at sila ay magpapakarami (mga tao) na hindi hihigit pa sa pag- uugali maliban sa kabuktutan at kawalan ng utang na loob",
            "verse 71:28": "Aking Panginoon! Inyong patawarin ako at ang aking mga magulang, at sa sinuman na pumapasok sa aking tahanan ng may pananalig, at lahat ng mga sumasampalatayang lalaki at sumasampalatayang babae, at huwag Ninyong pagkalooban ang mga tampalasan (ng anuman) maliban sa kapahamakan at pagkawasak!”"
        },
        "French": {
            "verse 71:1": "Nous avons envoyé Noé vers son peuple: «Avertis ton peuple, avant que leur vienne un châtiment douloureux».",
            "verse 71:2": "Il [leur] dit: «O mon peuple, je suis vraiment pour vous, un avertisseur clair,",
            "verse 71:3": "Adorez Allah, craignez-Le et obéissez-moi,",
            "verse 71:4": "pour qu'Il vous pardonne vos péchés et qu'Il vous donne un délai jusqu'à un terme fixé. Mais quand vient le terme fixé par Allah, il ne saurait être différé si vous saviez!»",
            "verse 71:5": "Il dit: «Seigneur! J'ai appelé mon peuple, nuit et jour.",
            "verse 71:6": "Mais mon appel n'a fait qu'accroître leur fuite.",
            "verse 71:7": "Et chaque fois que je les ai appelés pour que Tu leur pardonnes, ils ont mis leurs doigts dans leurs oreilles. se sont enveloppés de leurs vêtements, se sont entêtés et se sont montrés extrêmement orgueilleux.",
            "verse 71:8": "Ensuite, je les ai appelés ouvertement.",
            "verse 71:9": "Puis, je leur ai fait des proclamations publiques, et des confidences en secret.",
            "verse 71:10": "J'ai donc dit: «Implorez le pardon de votre Seigneur, car Il est grand Pardonneur,",
            "verse 71:11": "pour qu'Il vous envoie du ciel, des pluies abondantes,",
            "verse 71:12": "et qu'Il vous accorde beaucoup de biens et d'enfants, et vous donne des jardins et vous donne des rivières.",
            "verse 71:13": "Qu'avez-vous à ne pas vénérer Allah comme il se doit,",
            "verse 71:14": "alors qu'Il vous a créés par phases successives?",
            "verse 71:15": "N'avez-vous pas vu comment Allah a créé sept cieux superposés",
            "verse 71:16": "et y a fait de la lune une lumière et du soleil une lampe?",
            "verse 71:17": "Et c'est Allah qui, de la terre, vous a fait croître comme des plantes,",
            "verse 71:18": "puis Il vous y fera retourner et vous en fera sortir véritablement.",
            "verse 71:19": "Et c'est Allah qui vous a fait de la terre un tapis,",
            "verse 71:20": "pour que vous vous acheminiez par ses voies spacieuses».",
            "verse 71:21": "Noé dit: «Seigneur, ils m'ont désobéi et ils ont suivi celui dont les biens et les enfants n'ont fait qu'accroître la perte.",
            "verse 71:22": "Ils ont ourdi un immense stratagème,",
            "verse 71:23": "et ils ont dit: «N'abandonnez jamais vos divinités et n'abandonnez jamais Wadd, Suwâ, Yaghhû, Ya'ûq et Nasr'.",
            "verse 71:24": "Elles [les idoles] ont déjà égaré plusieurs. Ne fais (Seigneur) croître les injustes qu'en égarement.",
            "verse 71:25": "A cause de leurs fautes, ils ont été noyés, puis on les a fait entrer au Feu, et ils n'ont pas trouvé en dehors d'Allah, de secoureurs».",
            "verse 71:26": "Et Noé dit: «Seigneur, ne laisse sur la terre aucun infidèle.",
            "verse 71:27": "Si Tu les laisses [en vie], ils égareront Tes serviteurs et n'engendreront que des pécheurs infidèles.",
            "verse 71:28": "Seigneur! Pardonne-moi, et à mes père et mère et à celui qui entre dans ma demeure croyant, ainsi qu'aux croyants et croyantes; et ne fais croître les injustes qu'en perdition»."
        },
        "Fulah": {
            "verse 71:1": "Men nulii Nuuhu haa e yimɓe makko ɓen, wonnde : \"Jertin yimɓe maa ɓen, ado lette muusuɗe arde e maɓɓe",
            "verse 71:2": "O maakani [ɓe] : \"Ko onon yo yimɓe am, min ko mi jertinoowo on ɓannguɗo",
            "verse 71:3": "wonnde yo on rewu Allah, hulon Mo, ɗoftoɗon lam",
            "verse 71:4": "O haforanay on junuubi mon ɗin, O nenna on haa e lajal taƴaangal. [Ko woni tun] lajal Allah ngal si hewtii, ngal nennetaake, si tawii hiɗon anndunoo",
            "verse 71:5": "O maaki : \"Joomi am, min mi noddirii yimɓe am ɓen jemma e ñalorma",
            "verse 71:6": "kono noddaandu am ndun ɓeydaali ɓe, si wanaa dogugol",
            "verse 71:7": "Tuma kala kadi nde mi noddi ɓe fii no Hafaranaa ɓe, ɓe waɗay kolli maɓɓe ɗin ka nder noppi maɓɓe, ɓe buumora comci maɓɓe ɗin, ɓe deppitoo, ɓe townitora townitaadee",
            "verse 71:8": "Refti mi noddirii ɓe e kene",
            "verse 71:9": "Refti mi feññinani ɓe, mi gunndii ɓe gunndaadee",
            "verse 71:10": "Mi wi`i [ɓe] : \"Insinanee Joomi mon, tawde O siforii wonnde Haforoow",
            "verse 71:11": "O wurtira toɓo ngon e mo’on rewnindiral",
            "verse 71:12": "O ɓeydira on jawle e ɓiɗɓe, O waɗana on gese, O waɗana on canɗi",
            "verse 71:13": "E ko heɓi on, on jortaaki manngural Allah ngal",
            "verse 71:14": "Hara le O tagir on taaɓe-taaɓe",
            "verse 71:15": "E on yi`aali no Allah tagiri kammuulli jeeɗiɗi tegondirɗi",
            "verse 71:16": "O waɗi lewru ndun jalɓundu e majji, O waɗi naange ngen pitilol",
            "verse 71:17": "Ko Allah fuɗniri on ka leydi fuɗnugol",
            "verse 71:18": "refti O ruttiray on e mayri, O yaltina on yaltinndee",
            "verse 71:19": "Allah waɗiranii on leydi ndin weertaandi",
            "verse 71:20": "fii yo on naatir e mayri laawi yaajuɗi",
            "verse 71:21": "Nuuhu maaki : \"Joomi am, ɓee yeddii lam, ɓe jokkii on mo jawle mun e ɓiɗɓe ɓeydaali ɗum si wanaa hayrugol",
            "verse 71:22": "Ɓe fewji feere mawnde",
            "verse 71:23": "ɓe wi`i: \"Wata on terto dey reweteeɗi mon ɗin: wata on terto Wudda, e Suwaa’a, e Ya’uuqatha, e Nasr",
            "verse 71:24": "Ko pellet, ɓe majjinii ko ɗuuɗi. [Joomi] wata A ɓeydir tooñuɓe ɓen, si wanaa majjere",
            "verse 71:25": "Ko sagu goopi maɓɓe ɗin ɓe yooliranoo, ɓe naadaa Yiite, ɓe heɓanaano ko`e maɓɓe faabotooɗo gaanin Allah",
            "verse 71:26": "Nuuhu maaki kadi : \"Joomi am, wata A accu e leydi ndin, hay keefeero dilloowo",
            "verse 71:27": "Ko pellet, si A accii ɓe, ɓe majjinay jeyaaɓe Maa ɓen, ɓe jiidoytaako si wanaa bonnooɓe ɗuuɗuɓe geddi",
            "verse 71:28": "Joomi am, haforanam min e jibimɓe lam ɓen, e ɓen gomɗimɓe naatuɓe ka suudu am, e gomɗimɓe worɓe ɓen e gomɗimɓe rewɓe ɓen; wata A ɓeydir tooñuɓe ɓen, si wanaa halakuyee"
        },
        "German": {
            "verse 71:1": "Wir sandten ja Nuh zu seinem Volk: \"Warne dein Volk, bevor schmerzhafte Strafe über sie kommt.\"",
            "verse 71:2": "Er sagte: \"O mein Volk, ich bin euch ja ein deutlicher Warner,",
            "verse 71:3": "(euch zu mahnen:) Dient Allah und fürchtet Ihn, und gehorcht mir,",
            "verse 71:4": "so wird Er euch (etwas) von euren Sünden vergeben und euch auf eine festgesetzte Frist zurückstellen. Gewiß, Allahs Frist, wenn sie kommt, kann nicht zurückgestellt werden, wenn ihr nur wüßtet!\"",
            "verse 71:5": "Er sagte: \"Mein Herr, ich habe mein Volk bei Nacht und bei Tag aufgerufen.",
            "verse 71:6": "Aber mein Rufen hat sie nur in ihrer Flucht bestärkt.",
            "verse 71:7": "Gewiß, jedesmal, wenn ich sie aufrief, damit Du ihnen vergibst, steckten sie ihre Finger in ihre Ohren, überdeckten sich mit ihren Gewändern, verharrten (im Irrtum) und verhielten sich sehr hochmütig.",
            "verse 71:8": "Hierauf richtete ich an sie den Ruf dann öffentlich.",
            "verse 71:9": "Hierauf sprach ich zu ihnen offen und ganz im geheimen.",
            "verse 71:10": "Ich sagte: .Bittet euren Herrn um Vergebung - Er ist ja Allvergebend -,",
            "verse 71:11": "so wird Er den Regen auf euch ergiebig (herab)senden",
            "verse 71:12": "und euch mit Besitz und Söhnen unterstützen und für euch Gärten machen und für euch Bäche machen.",
            "verse 71:13": "Was ist mit euch, daß ihr nicht glaubt, von Allah würdevoll behandelt zu werden,",
            "verse 71:14": "wo Er euch doch in Entwicklungsabschnitten erschaffen hat?",
            "verse 71:15": "Seht ihr nicht, wie Allah sieben Himmel in Schichten (übereinander) erschaffen hat,",
            "verse 71:16": "den Mond darin zu einem Licht gemacht und die Sonne zu einem Leuchtkörper gemacht hat?",
            "verse 71:17": "Und Allah hat euch aus der Erde heranwachsen lassen.",
            "verse 71:18": "Hierauf wird Er euch in sie zurückbringen und gewiß (wieder aus ihr) hervorbringen.",
            "verse 71:19": "Und Allah hat euch die Erde zu einer ausgebreiteten Unterlage gemacht,",
            "verse 71:20": "damit ihr auf ihr dahinziehen könnt - auf Wegen als breiten Durchgängen'.\"",
            "verse 71:21": "Nuh sagte: \"Mein Herr, sie haben sich mir widersetzt und sind jemandem gefolgt, dem sein Besitz und seine Kinder nur den Verlust mehren.",
            "verse 71:22": "Und sie haben ungeheure Ränke geschmiedet.",
            "verse 71:23": "Und sie haben gesagt: .Verlaßt doch nicht eure Götter; verlaßt doch nicht Wadd, noch Suwa\", noch Yagut,Ya'uq und Nasr.'",
            "verse 71:24": "Sie haben ja viele in die Irre geführt. So lasse die Ungerechten nur noch tiefer in die Irre gehen.\"",
            "verse 71:25": "Wegen ihrer Verfehlungen wurden sie ertränkt und dann in ein (Höllen)feuer hineingebracht. Und da fanden sie für sich außer Allah keine Helfer.",
            "verse 71:26": "Und Nuh sagte: \"Mein Herr, lasse auf der Erde von den Ungläubigen nicht einen einzigen Bewohner.",
            "verse 71:27": "Denn, gewiß, wenn Du sie (leben) läßt, führen sie Deine Diener in die Irre und zeugen nur Sittenlose und sehr beharrliche Ungläubige.",
            "verse 71:28": "Mein Herr, vergib mir und meinen Eltern und demjenigen, der als Gläubiger mein Haus betritt, und den gläubigen Männern und den gläubigen Frauen. Und stürze die Ungerechten nur noch tiefer ins Verderben.\""
        },
        "Hausa": {
            "verse 71:1": "Lalle ne Mun aiki Nũhu zuwa ga mutãnensa, cẽwa ka yi gargaɗi ga mutãnenka gabãnin wata azãba mai raɗaɗi ta zo musu.",
            "verse 71:2": "Ya ce: \"Ya mutãnena ni, a gare ku, mai gargaɗi ne, mai bayyanãwa.\"",
            "verse 71:3": "\"Cewa ku bauta wa Allah, ku ji tsõronSa, kuma ku bĩ ni.\"",
            "verse 71:4": "\"Allah zai gãfarta muku daga zunubanku kuma Ya jinkirta muku zuwa ga ajalin da aka ambata. Lalle ne ajalin Allah idan ya zo, ba za a jinkirta Shi ba, dã kun kasance masana (ga abin da nake faɗã dã, kun bar kãfirci).\"",
            "verse 71:5": "Nũhu) ya ce: \"Ya Ubangijina! Lalle ne, na kirãyi mutãnena, a cikin dare da yini.\"",
            "verse 71:6": "\"To, amma kirana bai ƙãre su ba sai da, gudu (daga gare ni).\"",
            "verse 71:7": "\"Kuma lalle ne ni, kõ da yaushe na kirãye su dõmin Ka gãfarta musu, sai su sanya yatsunsu a cikin kunnuwansu, su lulluɓe da tufãfinsu, su dõge ga yin laifi. Sun yi girman kai iyãkar girman kai.\"",
            "verse 71:8": "\"Sa'an nan lalle ne ni, na kira su, a bayyane.\"",
            "verse 71:9": "\"Sa'an nan lalle ne, na yi yẽkuwa sabõda su, kuma na gãna da su a cikin asĩri.\"",
            "verse 71:10": "\"Shi na ce, 'Ku nẽmi gãfara daga Ubangijinku, lalle ne shi Ya kasance Mai gãfara ne.\"",
            "verse 71:11": "\"Ya sako (girgijen) sama a kanku da ruwa mai ɓuɓɓuga.\"",
            "verse 71:12": "\"Kuma ya yalwata muku game da dũkiya da ɗiya, Ya sanya muku (albarka) ga gõnaki, kuma Ya sanya muku koguna.\"",
            "verse 71:13": "\"Me ya sãme ku, bã ku fãtar sãmun natsuwa daga Allah,\"",
            "verse 71:14": "\"Alhãli kuwa, lalle ne, Ya halitta. ku, a cikin hãlãye?\"",
            "verse 71:15": "\"Ba ku ga yadda Allah Ya halitta wasu sammai bakwai ɗabaƙõƙĩ a kan jũna ba?\"",
            "verse 71:16": "\"Ya sanya watã a cikinsu, yana mai haske, Ya sanya rãnã babbar fitila?\"",
            "verse 71:17": "\"Kuma Allah Ya tsirar da ku daga ƙasa (kamar ganye) tsirarwa.\"",
            "verse 71:18": "\"Sa'an nan Ya mayar da ku a cikinta, kuma Ya fitar da ku fitarwa.\"",
            "verse 71:19": "\"Kuma Allah Ya sanya muku ƙasa shimfidaɗɗiya.\"",
            "verse 71:20": "\"Dõmin ku shiga a cikinta, hanyõyi mãsu fãɗi.\"",
            "verse 71:21": "Nũhu ya ce: \"Ya Ubangijina! Lalle ne sũ sun saɓa mini sun bi wanda dukiyarsa da ɗiyansa ba su ƙãre shi da kõme ba sai da hasãra.\"",
            "verse 71:22": "\"Kuma sun yi wani mãkirci, mãkirci babba.\"",
            "verse 71:23": "\"Kuma suka ce: Faufau kada ku bar gumãkanku, kuma faufau, kada ku bar wadda, kuma kada ku bar suwã kuma kada ku bar Yagũsa da Ya'ũƙa da Nasra.\"",
            "verse 71:24": "\"Kuma lalle ne sun ɓatar da (mutãne) mãsu yawa, kuma kada Ka ƙãrã wa azzãlumai (kõme) sai ɓata.\"",
            "verse 71:25": "Sabõda laifukansu na ganganci aka nutsar da su, sa'an nan aka sanya su a wuta. Saboda haka ba su sãmã wa kansu wani mataimaki wanin Allah ba.",
            "verse 71:26": "Kuma Nũhu ya ce: \"Ya Ublngijina! Kada Ka bari, a kan ƙasa, daga cikin kãfirai, wanda ke zama a cikin gida.\"",
            "verse 71:27": "\"Lalle ne, Kai idan Ka bar su, zã su ɓatar da bãyinKa, kuma bã zã su haifi kowa ba fãce fãjiri mai yawan kãfirci\"",
            "verse 71:28": "\"Ya Ubanginjina! Ka yi mini gãfara (ni) da mahaifana biyu, da wanda ya shiga gidana, yana mai ĩmãni, da mũminai maza da mũminai mãtã, kuma kada Ka ƙãrã wa azzãlumai kõme sai halaka.\""
        },
        "Hindi": {
            "verse 71:1": "हमने नूह को उसकी क़ौम के पास (पैग़म्बर बनाकर) भेजा कि क़ब्ल उसके कि उनकी क़ौम पर दर्दनाक अज़ाब आए उनको उससे डराओ",
            "verse 71:2": "तो नूह (अपनी क़ौम से) कहने लगे ऐ मेरी क़ौम मैं तो तुम्हें साफ़ साफ़ डराता (और समझाता) हूँ",
            "verse 71:3": "कि तुम लोग ख़ुदा की इबादत करो और उसी से डरो और मेरी इताअत करो",
            "verse 71:4": "ख़ुदा तुम्हारे गुनाह बख्श देगा और तुम्हें (मौत के) मुक़र्रर वक्त तक बाक़ी रखेगा, बेशक जब ख़ुदा का मुक़र्रर किया हुआ वक्त अा जाता है तो पीछे हटाया नहीं जा सकता अगर तुम समझते होते",
            "verse 71:5": "(जब लोगों ने न माना तो) अर्ज़ की परवरदिगार मैं अपनी क़ौम को (ईमान की तरफ) बुलाता रहा",
            "verse 71:6": "लेकिन वह मेरे बुलाने से और ज्यादा गुरेज़ ही करते रहे",
            "verse 71:7": "और मैने जब उनको बुलाया कि (ये तौबा करें और) तू उन्हें माफ कर दे तो उन्होने अपने कानों में उंगलियां दे लीं और मुझसे छिपने को कपड़े ओढ़ लिए और अड़ गए और बहुत शिद्दत से अकड़ बैठे",
            "verse 71:8": "फिर मैंने उनको बिल एलान बुलाया फिर उनको ज़ाहिर ब ज़ाहिर समझाया",
            "verse 71:9": "और उनकी पोशीदा भी फ़हमाईश की कि मैंने उनसे कहा",
            "verse 71:10": "अपने परवरदिगार से मग़फेरत की दुआ माँगो बेशक वह बड़ा बख्शने वाला है",
            "verse 71:11": "(और) तुम पर आसमान से मूसलाधार पानी बरसाएगा",
            "verse 71:12": "और माल और औलाद में तरक्क़ी देगा, और तुम्हारे लिए बाग़ बनाएगा, और तुम्हारे लिए नहरें जारी करेगा",
            "verse 71:13": "तुम्हें क्या हो गया है कि तुम ख़ुदा की अज़मत का ज़रा भी ख्याल नहीं करते",
            "verse 71:14": "हालॉकि उसी ने तुमको तरह तरह का पैदा किया",
            "verse 71:15": "क्या तुमने ग़ौर नहीं किया कि ख़ुदा ने सात आसमान ऊपर तलें क्यों कर बनाए",
            "verse 71:16": "और उसी ने उसमें चाँद को नूर बनाया और सूरज को रौशन चिराग़ बना दिया",
            "verse 71:17": "और ख़ुदा ही तुमको ज़मीन से पैदा किया",
            "verse 71:18": "फिर तुमको उसी में दोबारा ले जाएगा और (क़यामत में उसी से) निकाल कर खड़ा करेगा",
            "verse 71:19": "और ख़ुदा ही ने ज़मीन को तुम्हारे लिए फ़र्श बनाया",
            "verse 71:20": "ताकि तुम उसके बड़े बड़े कुशादा रास्तों में चलो फिरो",
            "verse 71:21": "(फिर) नूह ने अर्ज़ की परवरदिगार इन लोगों ने मेरी नाफ़रमानी की उस शख़्श के ताबेदार बन के जिसने उनके माल और औलाद में नुक़सान के सिवा फ़ायदा न पहुँचाया",
            "verse 71:22": "और उन्होंने (मेरे साथ) बड़ी मक्कारियाँ की",
            "verse 71:23": "और (उलटे) कहने लगे कि आपने माबूदों को हरगिज़ न छोड़ना और न वद को और सुआ को और न यगूस और यऊक़ व नस्र को छोड़ना",
            "verse 71:24": "और उन्होंने बहुतेरों को गुमराह कर छोड़ा और तू (उन) ज़ालिमों की गुमराही को और बढ़ा दे",
            "verse 71:25": "(आख़िर) वह अपने गुनाहों की बदौलत (पहले तो) डुबाए गए फिर जहन्नुम में झोंके गए तो उन लोगों ने ख़ुदा के सिवा किसी को अपना मददगार न पाया",
            "verse 71:26": "और नूह ने अर्ज़ की परवरदिगार (इन) काफ़िरों में रूए ज़मीन पर किसी को बसा हुआ न रहने दे",
            "verse 71:27": "क्योंकि अगर तू उनको छोड़ देगा तो ये (फिर) तेरे बन्दों को गुमराह करेंगे और उनकी औलाद भी गुनाहगार और कट्टी काफिर ही होगी",
            "verse 71:28": "परवरदिगार मुझको और मेरे माँ बाप को और जो मोमिन मेरे घर में आए उनको और तमाम ईमानदार मर्दों और मोमिन औरतों को बख्श दे और (इन) ज़ालिमों की बस तबाही को और ज्यादा कर"
        },
        "Indonesian": {
            "verse 71:1": "Sesungguhnya Kami telah mengutus Nuh kepada kaumnya (dengan memerintahkan): \"Berilah kaummu peringatan sebelum datang kepadanya azab yang pedih\",",
            "verse 71:2": "Nuh berkata: \"Hai kaumku, sesungguhnya aku adalah pemberi peringatan yang menjelaskan kepada kamu,",
            "verse 71:3": "(yaitu) sembahlah olehmu Allah, bertakwalah kepada-Nya dan taatlah kepadaku,",
            "verse 71:4": "niscaya Allah akan mengampuni sebagian dosa-dosamu dan menangguhkan kamu sampai kepada waktu yang ditentukan. Sesungguhnya ketetapan Allah apabila telah datang tidak dapat ditangguhkan, kalau kamu mengetahui\".",
            "verse 71:5": "Nuh berkata: \"Ya Tuhanku sesungguhnya aku telah menyeru kaumku malam dan siang,",
            "verse 71:6": "maka seruanku itu hanyalah menambah mereka lari (dari kebenaran).",
            "verse 71:7": "Dan sesungguhnya setiap kali aku menyeru mereka (kepada iman) agar Engkau mengampuni mereka, mereka memasukkan anak jari mereka ke dalam telinganya dan menutupkan bajunya (kemukanya) dan mereka tetap (mengingkari) dan menyombongkan diri dengan sangat.",
            "verse 71:8": "Kemudian sesungguhnya aku telah menyeru mereka (kepada iman) dengan cara terang-terangan,",
            "verse 71:9": "kemudian sesungguhnya aku (menyeru) mereka (lagi) dengan terang-terangan dan dengan diam-diam,",
            "verse 71:10": "maka aku katakan kepada mereka: 'Mohonlah ampun kepada Tuhanmu, -sesungguhnya Dia adalah Maha Pengampun-,",
            "verse 71:11": "niscaya Dia akan mengirimkan hujan kepadamu dengan lebat,",
            "verse 71:12": "dan membanyakkan harta dan anak-anakmu, dan mengadakan untukmu kebun-kebun dan mengadakan (pula di dalamnya) untukmu sungai-sungai.",
            "verse 71:13": "Mengapa kamu tidak percaya akan kebesaran Allah?",
            "verse 71:14": "Padahal Dia sesungguhnya telah menciptakan kamu dalam beberapa tingkatan kejadian.",
            "verse 71:15": "Tidakkah kamu perhatikan bagaimana Allah telah menciptakan tujuh langit bertingkat-tingkat?",
            "verse 71:16": "Dan Allah menciptakan padanya bulan sebagai cahaya dan menjadikan matahari sebagai pelita?",
            "verse 71:17": "Dan Allah menumbuhkan kamu dari tanah dengan sebaik-baiknya,",
            "verse 71:18": "kemudian Dia mengembalikan kamu ke dalam tanah dan mengeluarkan kamu (daripadanya pada hari kiamat) dengan sebenar-benarnya.",
            "verse 71:19": "Dan Allah menjadikan bumi untukmu sebagai hamparan,",
            "verse 71:20": "supaya kamu menjalani jalan-jalan yang luas di bumi itu\".",
            "verse 71:21": "Nuh berkata: \"Ya Tuhanku, sesungguhnya mereka telah mendurhakaiku dan telah mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka,",
            "verse 71:22": "dan melakukan tipu-daya yang amat besar\".",
            "verse 71:23": "Dan mereka berkata: \"Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwwa', yaghuts, ya'uq dan nasr\".",
            "verse 71:24": "Dan sesudahnya mereka menyesatkan kebanyakan (manusia); dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kesesatan.",
            "verse 71:25": "Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan lalu dimasukkan ke neraka, maka mereka tidak mendapat penolong-penolong bagi mereka selain dari Allah.",
            "verse 71:26": "Nuh berkata: \"Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi.",
            "verse 71:27": "Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka tidak akan melahirkan selain anak yang berbuat maksiat lagi sangat kafir.",
            "verse 71:28": "Ya Tuhanku! Ampunilah aku, ibu bapakku, orang yang masuk ke rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kebinasaan\"."
        },
        "Italian": {
            "verse 71:1": "In verità inviammo Noè al suo popolo: “Avverti il tuo popolo prima che giunga loro un doloroso castigo”.",
            "verse 71:2": "Disse: “O popol mio, in verità io sono per voi un ammonitore evidente:",
            "verse 71:3": "adorate Allah, temeteLo e obbeditemi,",
            "verse 71:4": "affinché perdoni una parte dei vostri peccati e vi conceda dilazione fino a un termine stabilito; ma quando giungerà il termine di Allah non potrà essere rimandato, se [solo] lo sapeste”.",
            "verse 71:5": "Disse: “Signore, ho chiamato il mio popolo giorno e notte,",
            "verse 71:6": "ma il mio richiamo ha solo accresciuto la loro repulsione.",
            "verse 71:7": "Ogni volta che li chiamavo affinché Tu li perdonassi, si turavano le orecchie con le dita e si avvolgevano nelle loro vesti, pervicaci e tronfi di superbia.",
            "verse 71:8": "Poi li ho chiamati ad alta voce.",
            "verse 71:9": "Li ho arringati e ho parlato loro in segreto,",
            "verse 71:10": "dicendo: Implorate il perdono del vostro Signore, Egli è Colui Che molto perdona,",
            "verse 71:11": "affinché vi invii dal cielo una pioggia abbondante,",
            "verse 71:12": "accresca i vostri beni e i vostri figli e vi conceda giardini e ruscelli.",
            "verse 71:13": "Perché non confidate nella magnanimità di Allah,",
            "verse 71:14": "quando è Lui che vi ha creati in fasi successive?",
            "verse 71:15": "Non avete considerato come Allah ha creato sette cieli sovrapposti",
            "verse 71:16": "e della luna ha fatto una luce e del sole un luminare.",
            "verse 71:17": "È Allah che vi ha fatto sorgere dalla terra come piante.",
            "verse 71:18": "Poi vi rimanderà [ad essa] e vi farà risorgere.",
            "verse 71:19": "Allah ha fatto della terra un tappeto per voi,",
            "verse 71:20": "affinché possiate viaggiare su spaziose vie”.",
            "verse 71:21": "Disse Noè: “Signore, mi hanno disobbedito seguendo coloro i cui beni e figli non fanno che aumentarne la rovina;",
            "verse 71:22": "hanno tramato un'enorme trama",
            "verse 71:23": "e hanno detto: Non abbandonate i vostri dèi, non abbandonate né Wadd, né Suwâ, né Yaghûth, né Yaûq, né Nasr”.",
            "verse 71:24": "Essi ne hanno traviati molti; [Signore,] non accrescere gli ingiusti altro che nella perdizione”.",
            "verse 71:25": "A causa dei loro peccati sono stati affogati e poi introdotti nel Fuoco, e non trovarono nessun soccorritore all'infuori di Allah.",
            "verse 71:26": "Pregò Noè: “Signore, non lasciare sulla terra alcun abitante che sia miscredente!",
            "verse 71:27": "Se li risparmierai, travieranno i Tuoi servi e non genereranno altro che perversi ingrati.",
            "verse 71:28": "Signore, perdona a me, ai miei genitori, a chi entra nella mia casa come credente, ai credenti e alle credenti; non accrescere gli ingiusti altro che nella rovina”."
        },
        "Japanese": {
            "verse 71:1": "本当にわれは，ヌーフをその民に遣わし，「痛ましい懲罰があなたの民に下る前に，あなたは，かれらに警告しなさい。」（と命じた）。",
            "verse 71:2": "かれは言った。「わたしの人びとよ，わたしはあなたがたへの公明な1人の警告者です。",
            "verse 71:3": "あなたがたはアッラーに仕え，かれを畏れ，わたしに従いなさい。",
            "verse 71:4": "かれはあなたがたの様々な罪を赦し，定められた期限まで，あなたがたを猶予なされます。本当にアッラーの期限が来た時は，猶予されません。もしあなたがたが分っていたならば。」",
            "verse 71:5": "かれ（ヌーフ）は申し上げた。「主よ，わたしは夜も昼も，わたしの人びとに呼びかけました。",
            "verse 71:6": "だが，わたしの呼びかけは，只（正道からの）逃避を増すばかりです。",
            "verse 71:7": "わたしがかれらに，『かれが，あなたがたを御赦しになるのだ』と呼びかける時，かれらは指を自分の耳に差し込み，自分で外套を被って（不信心を）固執し，ひたすら高慢になります。",
            "verse 71:8": "それでわたしは，声を大きくしてかれらに呼びかけました。",
            "verse 71:9": "或る時は公に，また（或る時は）密かにかれらに（訴えて），",
            "verse 71:10": "わたしは言いました。『あなたがたの主の御赦しを願え。本当にかれは，度々御赦しなされる。",
            "verse 71:11": "かれは，あなたがたの上に豊かに雨を降らせられ，",
            "verse 71:12": "あなたがたの財産や子女を増やし，またあなたがたのために，様々な園や（水の流れる）河川を設けられる。",
            "verse 71:13": "あなたがたはどうしたのか。アッラーの御親切，我慢強さに対して，望みを持たないとは。",
            "verse 71:14": "かれは本当に順序よく段階をおってあなたがたを創られた。",
            "verse 71:15": "あなたがたは，アッラーが7天を如何に一層また一層と，創られたかを考えてみなかったのか。",
            "verse 71:16": "また月をその中の明りとされ，太陽を（燃える）灯明となされたかを。",
            "verse 71:17": "アッラーはあなたがたを土から育てられ，",
            "verse 71:18": "それから，あなたがたは大地に帰され，また起き上らせられる。",
            "verse 71:19": "またアッラーはあなたがたのために，大地を延べ広げられ，",
            "verse 71:20": "そこであなたがたは，広い大道を往来するであろう。』といって聞かせました。」",
            "verse 71:21": "ヌーフは（更に）言った。「主よ，かれらはわたしに従いません。自分の財産と子女とで，破滅を助長する者にだけ従います。",
            "verse 71:22": "そして重大な策謀を企みます。",
            "verse 71:23": "かれらは言います。『あなたがたの神々を捨てるな。ワッドもスフーウも，またャグースもヤウークもナスルも，捨ててはならない。』",
            "verse 71:24": "かれらは既に多くの者を迷わせました。（主よ）迷いを放任されても，不義を行う者を多くしないで下さい。」",
            "verse 71:25": "かれらは様々な罪のために溺れさせられ，更に火獄に送られ，アッラーの外には，どんな援助者も得られなかった。",
            "verse 71:26": "ヌーフは（祈って）言った。「主よ，不信心な居住者を誰一人として地上に残さないで下さい。",
            "verse 71:27": "もしあなたがかれらを残されれば，かれらは必ずあなたに仕える者を迷わせ，また罪を犯す不信心な者の外，生まないでしょう。",
            "verse 71:28": "主よ，わたしとわたしの両親を御赦し下さい。また信者としてわたしの家に入る者，また（凡ての）信仰する男と信仰する女たちを御赦し下さい。そして不義を行う者たちには，滅亡の外には（何も）加えないで下さい。」"
        },
        "Jawa": {
            "verse 71:1": "Ingsun wis ngutus Nuh, nyurup - nyurupake marang ummate, \"He Nuh, elingna para ummattira padha ngelakonono penggawe becik, mupung durung katekan siksaning Allah kang gelarani",
            "verse 71:2": "Dhawuhe Nuh, \"Para umatku, aku iki nyurupake lan ngelingake marang kowe",
            "verse 71:3": "Kowe padha ngabektia lan nyembaha Allah, apa dhene padha manut mituruta marang pituturku",
            "verse 71:4": "Allah bakal ngapura sekabehe dosamu, lan bakal nyarentekake kowe nganti tekan wewangen kang wis tinamtokake yaiku tekan ing pati. Menawa kowe padha weruh wawangening Allah iku yen wis pundhat ora kena disrantekake maneh",
            "verse 71:5": "Nuh munjuk ing Allah, \"Dhuh Pangeran kawula, kawula punika rinten dalu tansah ngajak - ajak para ummat kawula (supados pitados ing Paduka)",
            "verse 71:6": "Nanging pangajak kawula punika namung mewahi girasipun para ummat kawula, sami boten purun manut",
            "verse 71:7": "Kawula punika saben ngajak - ajak pitados ing Paduka dhumateng para ummat kawula supados ngapura piyambakipun, lajeng sami nutupi kupinginpun mawi drijinipun, sarta sirahipun dipun krukup mawi sinjangipun. Parta gumedhe",
            "verse 71:8": "Sasampunipun makaten para ummat wau sami kawula pituturi kalayan sora (terang - terangan)",
            "verse 71:9": "Lajeng sami kawula pituturi kalayan sora saha lirih",
            "verse 71:10": "Dhawuh kawula mekaten, \"Para ummatku padha nyuwuna pangapura ing Allah Pangeranmu, awit Allah iku kepareng ngapura",
            "verse 71:11": "(Yen wis kepareng ngapura) banjur nurunake banyu udan deres saka langit",
            "verse 71:12": "Apa dene paring wuwuh bandha lan anak, lan maringi palemahan sarta kali kanggo ngoncori palemahan mau",
            "verse 71:13": "Ya gena kowe padha ora pracaya kaagungane Allah",
            "verse 71:14": "Allah wis dadekake awakmu pirang - pirang rambahan kang tumaruntun",
            "verse 71:15": "Apa ora padha handeleng anggone Allah gawe langit pitu kang sap - sapan",
            "verse 71:16": "Lan andadekake rambulan madhangi langit kabeh, lan dadekake srengenge minangka damar",
            "verse 71:17": "Lan maneh Allah gawe awakmu asal saka lemah",
            "verse 71:18": "Sawise dadi manungsa, Allah banjur balekake awakmu menyang lemah maneh, sawise dadi lemah Allah nguripake kowe lan diwetokake saka kubur",
            "verse 71:19": "Apadene Allah dadekake bumi iki warna - warna mugunani marang kowe",
            "verse 71:20": "Supaya kowe padha bisa mlaku ana dalan kang jembar",
            "verse 71:21": "Nuh munjuk ing Allah, \"Dhuh Pangeran, para ummat kawula punika sami boten manut miturut dhumateng parintah kawula, sami manut dhateng tiyang ingkang asor budinipun, kasugihan arta sarta anakipun, namung badhe andadosaken kapitunanipun",
            "verse 71:22": "Para ummat wahu sami damel pakewet ageng",
            "verse 71:23": "Pangucapipun (tiyang ingkang asor budinipun), \"Aja padha tingal nyembah sesemabahan mu brahala, lan aja padha tinggal (nyembah) Wadd lan Suwaa’, Yaghuts, Ya’uq lan nasr\" (nami - nami brahala)",
            "verse 71:24": "Sejatosipun tiyang asor ing budi wau sami nasaraken tiyang kathah mila panyuwun kula tiyang kafir wahu mugi paduka boten nambahi kajawi siksa awon",
            "verse 71:25": "Sarehning gedhe kaluputane mulane padha dikelem banjir topan, ana sajeroning banyu di obong geni. Liyane Allah ora ana kang bisa nulungi",
            "verse 71:26": "Nuh munjuk ing Allah, \"Pangeran kawula, tiyang kafir wahu mugi Paduka telasaken sampun wonten ingkang kantun gesang ing bumi manggen ing griya",
            "verse 71:27": "Manawi Paduka kendelaken kemawon, tamtu badhe nasaraken para kawula Paduka, manawi ing tembe medal anakipun, anak wahu tamtu dados tiyang awon utawi kafir",
            "verse 71:28": "Pangeran kawula, Paduka mugi ngapuraha kalepatan kawula saha kalepatanipun tiyang sepuh kawula kekalih, saha dhumateng tiyang ingkang malebet griya kawula utawi, dhateng tiyang mukmin jaler estri, para tiyang kafir punika mugi Paduka tumpes kemawon"
        },
        "Kazakh": {
            "verse 71:1": "Ақиқатында, Біз, Нұхты еліне: «Қауымыңды, оларға жан күйзелтуші азап келместен бұрын ескерт», деп жібердік",
            "verse 71:2": "Ол айтты: «Әй, елім, шын мәнінде мен сендерге анық ескертушімін",
            "verse 71:3": "Аллаһқа Құлшылық жасаңдар, Одан Оның жазасынан қорқып, сақтаныңдар және маған бағыныңдар",
            "verse 71:4": "Ол күнәларыңды кешіреді және сендерге белгіленген бір мерзімге дейін мұрсат береді. Шын мәнінде, Аллаһ белгілеген мерзім жетсе, ол кейінге ұзартылмайды, Егер де сендер білсеңдер», деп",
            "verse 71:5": "Ол айтты: «Раббым, ақиқатында мен елімді түнде де, күндіз де иманға шақырдым",
            "verse 71:6": "Алайда, шақыруым олардың кері қашуын ғана арттырды",
            "verse 71:7": "Ақиқатында, мен оларды Сенің кешіруің үшін шақырған сайын олар саусақтарын құлақтарына тығып, киімдерімен бүркеніп алды және қасарысып, өздерін жоғары қойып, тәкаппарлана түсті",
            "verse 71:8": "Мен оларды ашық түрде шақырдым",
            "verse 71:9": "Содан кейін мен оларды жалпы және оңаша жекеше түрде де үгіттедім",
            "verse 71:10": "Сондай-ақ: «Өздеріңнің Раббыңнан кешірім тілеңдер, өйткені Ол көп Кешіруші Ғаффар",
            "verse 71:11": "Ол сендерге аспаннан мол жаңбыр жібереді",
            "verse 71:12": "сендерді мал-мүліктермен және перзенттермен қолдайды. Сендерге бау-бақшалар өсіріп және сендер үшін өзендер пайда қылады",
            "verse 71:13": "Сендер неге Аллаһқа бойсұнып, Одан қорықпайсыңдар",
            "verse 71:14": "Негізінде, Ол сендерді кезең-кезеңдермен жаратты",
            "verse 71:15": "Аллаһ жеті аспанды қабат-қабат етіп қалай жаратқанын көрмедіңдер ме",
            "verse 71:16": "Олардың ішінде айды нұр қылып, күнді жарық шығарушы қылды",
            "verse 71:17": "Аллаһ сендерді жерден өсімдік секілді шығарды",
            "verse 71:18": "Содан кейін сендерді оған қайтарады және қайта шығарады",
            "verse 71:19": "Әрі Аллаһ сендерге жерді кілем етті",
            "verse 71:20": "онда кең жолдармен жүрулерің үшін», деп",
            "verse 71:21": "Нұх айтты: «Раббым! Ақиқатында, олар мағанбағынбай, сондай, өздеріне мал-дүниесі мен перзенттері зияннан басқаны арттырмаған біреулерге ілесті»",
            "verse 71:22": "Сондай-ақ, олар өте үлкен құлықпен айлакерлік істеді",
            "verse 71:23": "және қауымына айтты: «Сендер ешқашан өз құдайларыңды тастамаңдар. Уадты, Суағты, Яғусты, Яғуқты және Нәсірді еш уақытта тастаушы болмаңдар», деп",
            "verse 71:24": "Нұх : «Ақиқатында, бұлар көбін адастырды. Сен де Раббым әділетсіздерге адасудан басқаны арттырма!» деді",
            "verse 71:25": "Олар біле тұра істеген қателерінің салдарынан суға батырылып әрі отқа кіргізілді. Сөйтіп, олар өздеріне Аллаһтан басқа ешқандай көмек берушілерді таппады",
            "verse 71:26": "Нұх айтты: «Раббым, кәпірлерден жерде бірде-бір тұрғын қалдырма",
            "verse 71:27": "Өйткені, Сен оларды қалдырсаң, олар құлдарыңды адастырады және бұзық, кәпірден басқаны көбейтпейді",
            "verse 71:28": "Раббым, мені, ата-анамды, үйіме иманды болып кіргендерді және иманды ерлер мен иманды әйелдерді кешір! Ал, әділетсіздерге жойылып кетуден басқаны арттырма!» деді"
        },
        "Korean": {
            "verse 71:1": "실로 나는 노아를 그의 사람들에게 보냈노라 : “그대의 사람들에게 고통스러운 벌이 찾아오기 전에 그대는 그들에게 경고하라”실로 하나님이 노아를 그의 백성에게 보냄은 그들 위에 고통 스러운 응벌이 임하기 전에 백성 들에게 경고하고자 하셨으니",
            "verse 71:2": "그가 말하길 “나의 사람들이여. 실로 나는 그대들을 위한 명백한 경고자라”그가 말하였더라 백성들이여 실로 나는 분명한 경고자로서 너 희에게 왔노라",
            "verse 71:3": "“그대들은 하나님을 경배하고 그분을 경외하며 나를 따르라”하나님을 경배하고 그분 만을두려워 하며 나에게 순종하라",
            "verse 71:4": "“그리하면 그분께서 그대들을 위해 그대들의 죄를 용서하여 주실 것이며 그대들을 지정된 기한까지 늦추어 주실 것이라. 그대들이 안다면 실로 하나님의 기한, 그것이 도래했을 때는 늦추어지지 않노라”그리하면 그분께서 너희의 잘못을 용서하사 일정 기간까지 너 희를 유예하나 실로 하나님의 유 예 기간이 이를 때면 유예될 수 없노라",
            "verse 71:5": "그가 말하길 “저의 주님, 실로 저는 저의 사람들을 밤낮으로 불렀습니다”그가 말하였더라 주여 저는 밤낮으로 저희 백성들을 인도하려하였습니다",
            "verse 71:6": "“그러나 저의 부름은 오직 그들의 회피만을 증가시켰을 뿐입니다”그러나 믿는 자들은 증가하지 아니하고 바른 길에서 벗어나는 자들이 늘어났습니다",
            "verse 71:7": "“당신께서 그들을 용서해 주시기 위해 제가 그들을 부를 때마다 그들은 손가락을 귀에 대고 자신의 옷으로 몸을 덮어 싸며 계속해서 거만을 떨었습니다”당신께서 그들을 용서할 것이 라 제가 말할 때마다 그들은 그들 의 손가락으로 귀를 막고 옷을 여 미며 거역하고 오만할 뿐입니다",
            "verse 71:8": "“그 후 실로 저는 그들을 소리내어 불렀습니다”그리하여 저는 그들에게 소리 높여 호소하였습니다",
            "verse 71:9": "“그 후 실로 저는 그들에게 공표하기도 하고, 비밀스레 소곤거리며 그들에게 말하기도 하였습니다”대중 앞에서도 그랬고 보이지 않게도 호소했으며",
            "verse 71:10": "“그리하여 제가 말하였습니다 : 그대들은 그대들 주님에게 용서를 구하라. 실로 그분께서는 가장 너그러이 용서하시는 분이도다 ”주님으로부터 용서를 구하라실로 그분은 관용으로 충만하신 분이라 말하였고",
            "verse 71:11": "`그리하면 그분께서 그대들 위로 줄기찬 비를 보내주실 것이라`그분께서 너희에게 비를 내 리되 풍성케 하여 주시며",
            "verse 71:12": "`그리고 그대들에게 재산과 자손을 늘려주실 것이며 그대들을 위해 정원을 두실 것이며 그대들을 위해 강을 두실 것이라`재산과 자손을 더하여 주시 고 과수원과 물이 흐르는 강을 너 희에게 주시는 분이시라고 하였습 니다",
            "verse 71:13": "`그대들은 하나님의 위엄을 개의치 않으니 이 어찌된 일인가?`그런데 너희가 하나님의 위 대함을 두려워 하지 아니한 것은 어떤 일이뇨",
            "verse 71:14": "`실로 그분께서는 점진적으로 그대들을 창조하셨노라`실로 그분은 여러가지 서로 다른 단계를 거쳐 너희를 창조하 셨노라",
            "verse 71:15": "`하나님께서 어떻게 일곱 개의 하늘을 층층이 창조하셨는지 그대들은 알지 못하는가?`하나님게서 층을 두어 일곱 개의 하늘을 만드신 것을 알지 못하느뇨",
            "verse 71:16": "`그분께서는 달을 그(하늘) 안에 빛으로 두셨으며 태양을 등불로 두셨노라`달을 두시매 빛을 반사케 하고 태양을 두시매 등불이 되게 하 셨노라",
            "verse 71:17": "`하나님께서는 그대들을 흙으로부터 자라나게 하셨노라`하나님은 초목이 성장하듯 너희를 대지위에서 성장케 했으며",
            "verse 71:18": "`그 후 그분께서는 그대들을 그곳(흙)으로 돌아가게 하시고 그대들을 꺼내실 것이라`그런 후 너희를 부활케 하시니라",
            "verse 71:19": "`하나님께서는 그대들을 위해 대지를 융단으로 두셨노라`하나님은 너희를 위하여 대 지를 융단처럼 펼쳐 주셨으니",
            "verse 71:20": "`그대들이 그 안에서 넓은 길을 드나들 수 있도록 함이라`이는 너희로 하여금 그 안의넓은 길들을 활보하도륵 함이라",
            "verse 71:21": "노아가 말하길 “저의 주님. 실로 그들은 저에게 불복하였으며 그들은, 자신의 재산과 자식으로써 오직 자신에게 손실만을 증가시키는 자를 따랐습니다”노아는 계속하여 말하였더라주여 실로 그들은 저를 거역하고 그들의 재산과 자손들에게 허악만 을 끼치는 자들을 따를 뿐입니다",
            "verse 71:22": "“그리고 그들은 매우 커다란 책략을 꾸몄습니다”그들은 크나큰 음모를 꾸미며",
            "verse 71:23": "“그리고 그들은 말했습니다 : 그대들은 절대 그대들의 우상을 포기하지 말며 절대 왓드와 수와으와 야구쓰와 야우끄와 나스르를 포기하지 말라`너희 신들을 버리지 말라 왓 드도 쑤와도 그리고 야구쓰와 야 우끄 그리고 나스르 신들을 단념 해서는 아니된다고 서로가 서로에 게 말하였더라",
            "verse 71:24": "“실로 그들은 많은 이들을 방황케 하였습니다. 당신께서는 부당한 자들에게 오직 방황만을 더해 주십시오”그들은 이미 많은 무리를 유혹하였으니 주여 당신께서 더 이 상 방황하는 자들을 제외하고는 그들의 죄악을 증가하지 않도록 하여 주소서",
            "verse 71:25": "그들의 죄로 말미암아 그들은 익사하였고 그 후 불 속으로 들어가게 되었으니 그들은 하나님이 아닌 그들을 위한 조력자들(우상들)을 발견하지 못하였노라그들의 죄악으로 말미암아 그들은 익사하였고 불지옥에 들어 가게 되었으니 하나님 외에는 그 들을 도울 자 아무도 없노라",
            "verse 71:26": "노아가 말하길 \"저의 주님. 불신자들 중에 어떤 인간도 지구상에 내버려두지 마십시오노아가 말하였더라 주여 대 지위에 한 사람도 불신자로 버려 두지 마옵소서",
            "verse 71:27": "“실로 당신께서 그들을 내버려두신다면 그들은 당신의 종복들을 방황케 할 것이며 그들은 오직 사악한 불신자만 낳을 것입니다”당신께서 그들 중에 한 불신 자라도 남겨 두신다면 그들은 당 신의 종들을 유혹하여 사악한 자 들로 만들 것입니다",
            "verse 71:28": "“저의 주님. 저를 용서하여 주시고 저의 부모님과, 믿는 자로서 저의 집에 들어왔던 자와, 믿는 남성들과 믿는 여성들을 용서하여 주십시오. 그리고 부당한 자들에게는 오직 파괴만을 더해 주십시오”주여 저를 용서하여 주사 저 의 부모와 믿음으로 저의 집에 들 어온 자들과 믿는 사람들과 믿는 여성들을 용서하여 주시고 죄인들 에게만 벌을 증가하여 주소서"
        },
        "Kurdish": {
            "verse 71:1": "Bi rastî me Nûh li bal koma wî da şandîye (me ji Nûh ra aha gotîye: \"Nûh!) hêj di berîya, ku ji komalê te ra şapateke dilsoz ne hatîye; tu komalê xwe bide hişyar kirinêبه‌ڕاستی ئێمه نوح مان ڕه‌وانه‌کرد بۆ لای قه‌ومه‌که‌ی، فه‌رمانمان پێدا که‌؛ قه‌ومه‌که‌ت بێدار بکه‌ره‌وه پێش ئه‌وه‌ی سزایه‌کی به ئێش یه‌خه‌یان پێبگرێت.",
            "verse 71:2": "(Nûh ji bona wan ra aha) gotîye: \"gelî min! bi rastî ez ji bona we ra hişyarvanekî xûyameئه‌ویش وتی: قه‌وم و هۆزو گه‌لم من بێگومان بێدارکه‌ره‌وه‌یه‌کی ئاشکرام بۆتان.",
            "verse 71:3": "Hûn perestî ya Yezdan bikin û bi gotina min bikinداواتان لێ ده‌که‌م که‌: هه‌ر خوا بپه‌رستن و له خه‌شم و قینی، خۆتان بپارێزن و فه‌رمانبه‌رداری منیش بن.",
            "verse 71:4": "(Heke hûn aha bikin. Yezdan ê) hinekî ji gunehên we ji bona we ra bibexşîne û wê ewayê heya danê nevdaî we para da bihile. Bi rastî heke hûn bizanin; gava danê dawîyê hatibe, nayê paradanêئه‌و کاته خوا له گوناهه‌کانتان خۆش ده‌بێت و ده‌تانهێڵێته‌وه بۆ کاتێکی دیاری کراو، بێگومان کاتی دیاری کراوی خوا وه‌ختێك پێش دێت، به‌هیچ شێوه‌یه‌ك دواناکه‌وێت ئه‌گه‌ر بتانزانیایه‌.",
            "verse 71:5": "(Nûh ji Xuda aha lava kirîye û) gotîye: \" Xuda yê min! bi rastî min komalê xwe di şev û rojê da (li bal te da) gazî kirîyeدوای سه‌ده‌ها ساڵ بانگه‌واز نوح سکاڵای کردو وتی: په‌روه‌ردگارا من به شه‌وو به ڕۆژ بانگی قه‌وم و گه‌له‌که‌مم کرد (بۆ یه‌کخواناسی و پارێزکاری).",
            "verse 71:6": "Îdî gazîkirina min ji wan ra hey revandina wan para da pir kiriyeکه‌چی بانگه‌وازه‌که‌ی من هیچی زیاد نه‌کردن؛ ته‌نها ڕاکردنیان نه‌بێت.",
            "verse 71:7": "Bi rastî ji bo ku tu ewan bibexşînî, min çiqa gazî wan kirîye ewan kincên xwe li xwe dipêçandin û tiliyê xwe dixistine guhê xwe (ji bo ku deng neçe wan înç dikirin, ji quratîyê xwe mezin dikirin)به‌ڕاستی من هه‌موو جارێك که بانگم ده‌کردن تا لێیان خۆش ببیت، په‌نجه‌یان ده‌خسته گوێچکه‌یانه‌وه تا نه‌بیستن، جله‌کانیان به‌سه‌ر خۆیاندا ده‌دا تا نه‌مبینن، زۆر گه‌رم بوون له‌سه‌ر بێ باوه‌ڕی و خۆیان به‌زل ده‌زانی و لووت به‌رز بوون.",
            "verse 71:8": "Paşê bi rastî min ewan bi eşkere gazî kirin (ku ji kirinê xwe poşman bibin)پاشان من به ئاشکرا بانگم کردن و (وتارم بۆ دان).",
            "verse 71:9": "Paşê bi rastî min, ji bona wan ra (doza xwe) eşkere kir, ça min ji bona wan ra (doza xwe) bi veşartî penha kiribûئینجا من به‌ڕوونی و بێ په‌رده هه‌موو شتێکم بۆ باس کردن، هه‌ندێ جاریش به‌نهێنی قسه‌م بۆ ده‌کردن (بۆ تاکه تاکه‌و خێزانه‌کانیان).",
            "verse 71:10": "Îdî minji wan ra (aha) got: \"hûn ji bona xwe ra ji Xuda yê xwe baxişandina xwe lava bikin. Loma bi rastî (Xuda yê we) baxişkar eبه‌رده‌وام پێم ده‌گوتن، ئێوه داوای لێخۆشبوون له په‌روه‌ردگارتان بکه‌ن چونکه به‌ڕاستی ئه‌و زاتێکی لێخۆشبووه‌.",
            "verse 71:11": "(Hûn jî wî baxişandinê bixwazin) ji bo ku di jor da li ser we da baranê bişîneبارانتان به لێزمه‌و خوڕه‌م بۆ ده‌بارێنێت.",
            "verse 71:12": "Ji bo ku ewa (berxudar ya we) bi mala û zaran pir bike, ji bona we ra bostan ş çeman çê bikeماڵ و سامان و نه‌وه‌تان پێ ده‌به‌خشێت، هاوڕێ له‌گه‌ڵ باخ و باخاتدا، ڕوبارو چه‌م و جۆگه‌تان بۆ به‌دی ده‌هێنێت.",
            "verse 71:13": "(Gelî min!) ji bona we ra çi bûye; ku hûn bi kubarî gazî Yezdan nakinئه‌وه چیتانه ئێوه قه‌دری خوا نازانن، بۆ ڕێزی بۆ دانانێن و لێی ناترسن.",
            "verse 71:14": "Ewî bi xweber jî hûn ji temtêlne curecure da afirandine (qey hûn naponijin)خۆ ئێوه پێشتر نه‌بوون؛ هه‌ر خوا خۆی به چه‌ند قۆناغدا ئێوه‌ی تێپه‌ڕاندو دروستی کردن.",
            "verse 71:15": "Maqey hûn nabînin, Yezdan ça hevt ezman wekî hev afirandîyeئایا سه‌رنجتان نه‌داوه چۆن خوا حه‌وت چین ئاسمانی دروست کردووه‌؟!",
            "verse 71:16": "(Yezdan) hîv di wan (ezmanan da) xistîye rohnayî û roj jî xistîye çiraمانگی کردۆته هۆی ڕوناکی تیایانداو خۆریشی داگیرساندووه‌.",
            "verse 71:17": "Yezdan hîn ji zemîn (wekî çêre) hêşîn kirineهه‌ر خوا خۆی ئێوه‌ی له خاکی زه‌وی به‌دیهێناوه‌و پێی گه‌یاندوون.",
            "verse 71:18": "Paşê wê dîsa we bixe zemîn, dîsa we ji zemîn derxe, carbicar aha bikeپاشان ده‌تانمرێنێت و ده‌تانخاته‌وه ناوی هه‌ر کاتیش بیه‌وێت ده‌رتان ده‌هێنێته‌وه‌.",
            "verse 71:19": "Yezdan zemîn ji bona we ra xistîye binraxهه‌ر ئه‌و خوایه زه‌وی بۆ ڕاخستوون (چۆنتان بوێت و بۆ چیتان بوێت به‌ده‌ستانه‌وه دێت)",
            "verse 71:20": "Ji bo ku hûn di rêne firene (di zemîn da) hatine vekirinê, bigerinتا (به ئاره‌زووی خۆتان) پیایدا بگه‌ڕێن له ڕێگه فراوانه‌کاندا.",
            "verse 71:21": "Nûh (gava dêna xwe dayê ku şîretên wî ji bona komalê wî ra qe kêrê wan ne hatîye, ji Xuda yê xwe aha lava kirîye û) gotîye: \"Xuda yê min! bi rastî ewan bê gotina min kirine û bûne peyrewê kesekê wusa, komal û zarê wî ji bona wî ra hey zîyana wî pir kirineسه‌رئه‌نجام، نوح نائومێد بوو بۆیه وتی: په‌روه‌ردگارا به‌ڕاستی ئه‌وان یاخی بوون لێم، شوێنی ئه‌و که‌سانه که‌وتن که ماڵ و نه‌وه‌کانیان قازانجی پێنه‌گه‌یاندن زیان نه‌بێت.",
            "verse 71:22": "Ewanan endezene mezin kirineخوانه‌ناسان پیلانی گه‌وره‌و نه‌خشه‌ی سامناکیان داڕشت.",
            "verse 71:23": "(Ji hev ra) gotine: \"hûn (gelî me! bi gotina Nûh) dest ji Xudan yên xwe bernedin û hûn dest (ji Xuda yê bi nav) Wed û Sewa û Yexûs û Ye´ûq û Nesir bernedinوتیان: خه‌ڵکینه نه‌که‌ن واز له خواکانتان بهێنن!! نه‌که‌ن واز له (ودو سواع و یه‌عوق و نه‌سر) بهێنن.",
            "verse 71:24": "Bi sond! ewan bi vî awayî pir kes ji rê ya rast derxistin e. Tu bi xweber jî ji bona cewrkaran hey teşqelan pir dikîبێگومان ئه‌وانه زۆر که‌سیان گومڕا کرد، په‌روه‌ردگارا، ئه‌م سته‌مکارانه ته‌نها گومڕای نه‌بێت هیچی تریان بۆ زیاد مه‌که‌.",
            "verse 71:25": "Ji ber dexelîne wan ewan (di avê da) feşirîn, îdî ketine agir. Ji bona wan ra ji peştirê Yezdan, îdî qe rastî tu arîkarî ne hatîyeجا له سه‌رئه‌نجامی گوناهو تاوانیاندا، هۆزی ناله‌بار نوقم کران له زریانه‌که‌دا، ئینجا خرانه ناو ئاگره‌وه‌، که‌سیشیان ده‌ست نه‌که‌وت له خه‌شم و سزای خوایی په‌نایان بدات.",
            "verse 71:26": "Nûh (aha lava kirîye û) gotîye: \"Xuda yê min! tu ji bona filan ra li ser zemîn qe tu welatê nehêleئینجا نوح وتی: په‌روه‌ردگارا هیچ که‌سێك له بێ بڕوایان له‌سه‌ر زه‌ویدا مه‌هێڵه‌و تۆویان ببڕه‌.",
            "verse 71:27": "(Xuda yê min!) bi rastî heke tu ewan (filan li ser zemîn) bihêlî, ewanê bendene te ji rê ya te derxin, ewanê hey filene bê xûne (cewrkar) bizêyîninچونکه به‌ڕاستی ئه‌گه‌ر تۆ وازیان لێ بهێنیت هه‌رچی به‌نده‌کانی تۆیه گومڕای ده‌که‌ن و که‌سیشیان لێنابێت (له نه‌وه‌ی تازه‌) مه‌گه‌ر خراپه‌کار و تاوانبار نه‌بێت.",
            "verse 71:28": "Xuda yê min! tu min û da û bavê min û ewanê bi bawerî dikevine xênîyê min û mer û jinê bawer kirine bibexşînî. (Xuda!) tu ji bona cewrkaran ra hey teşqelê pir bikeپه‌روه‌ردگارا؛ له خۆم و دایك و باوکم و ئه‌وانه خۆش ببه که دێنه ماڵم؛ به ئیمان و باوه‌ڕه‌وه‌، هه‌روه‌ها له ئیماندارانی پیاوو ئیماندارانی ئافره‌تیش خۆش ببه‌، سته‌مکارانیش ته‌نها تیاچوون نه‌بێت هیچی تر نه‌که‌یته به‌شیان."
        },
        "Kyrgyz": {
            "verse 71:1": "Биз Нухту өз коомуна элчи-пайгамбар кылып жибердик (жана ага): «Аларга катуу азап келишинен мурда коомуңду (тозок азабынан) эскерткин» - (деп вахий кылдык)",
            "verse 71:2": "Алайтты: «О, коомум! Мен силерге анык эскертүүчү-пайгамбармын",
            "verse 71:3": "Аллаһка гана ибадат кылып, Андан корккула жана мага моюн сунгула",
            "verse 71:4": "(Ошондо) Ал силердин күнөөңөрдү кечирип, белгилүү күндөргө (дүйнө жашоосун жашап бүткөнүңөргө) чейин силерди(н өлүмүңөрдү) кечиктирет. (Ал эми) Аллаһтын (белгилеген) ажалы келип калганда эч кечиктирилбейт, эгер билсеңер»",
            "verse 71:5": "(Нух) айтты: «О, Раббим! Мен коомумду түнү-күнү (токтоосуз) даават кылдым",
            "verse 71:6": "Бирок менин дааватым алардын (акыйкаттан) качуусун гана көбөйттү",
            "verse 71:7": "Сеналарды кечирүүң үчүн мен ар качан аларды даават кыла баштасам, манжаларын кулактарына тыгып, кийимдери менен оронуп алып (мени укпай, ширк ибадаттарын) уланта беришти жана аябай текеберленишти",
            "verse 71:8": "Кийин мен аларды ашкере түрдө даават кылдым",
            "verse 71:9": "Андан соң аларга (дааватымды) ачык-жарыя айттым жана (кези келгенде) жашыруун түрдө да айтым",
            "verse 71:10": "Анан мен аларга (мындай) дедим: «Раббиңерден кечирим сурагыла! Ал чынында Кечиримдүү",
            "verse 71:11": "Силерге асмандан себелеген жамгыр жиберет",
            "verse 71:12": "Жана дүйнө-мүлк, перзенттер менен кубаттап, бак-бостондорду жана (соолубас) дарыяларды берет",
            "verse 71:13": "Силерге эмне болгон, Аллаһка улуулукту каалабайсыңар",
            "verse 71:14": "Ал силерди доор - доор менен жаратты го",
            "verse 71:15": "Аллаһ (Таала) жети асманды кабат-кабаты менен кандай (чеберчиликте) жаратканына карабайсыңарбы",
            "verse 71:16": "Жана Ал асмандардын койнундагы Айды нур, ал эми Күндү (аалам үчүн) чырак кылып койгон",
            "verse 71:17": "Жана Аллаһ силерди жерден гана өстүрүп чыгарган",
            "verse 71:18": "Кийин силерди (өлгөн күнүңөрдө) кайра топуракка кайтарып, (Кыяматта) дагы (топурактан) чыгарып алат",
            "verse 71:19": "Аллаһ силер үчүн жерди(н бетин) тегиз кылды",
            "verse 71:20": "Анда(гы) кең жолдордон жүрүүңөр үчүн",
            "verse 71:21": "Нух айтты: “О, Раббим! Алар мага каршы чыгышты жана дүйнөсү менен бала-чакасы зыяндан башканы көбөйтпөй турган адам(дар)ды ээрчип кетишти",
            "verse 71:22": "Алар (байлар динге каршы) өтө чоң айла-амалдарды жасашты",
            "verse 71:23": "Жана (элдерге) “бут-кудайыңарды таштабагыла “Вадды” дагы, “Сувааны” дагы, “Ягусту” дагы, “Яукту” дагы, “Насрды” дагы таштабагыла!” дешти",
            "verse 71:24": "Алар көп элдерди азгырышты. Жана Сен (о, Аллаһым!) заалымдарга адашуучулуктан башканы көбөйтпө",
            "verse 71:25": "Күнөөлөрү себептүү (топон сууга) чөктүрүлүштү! Анан (наркы дүйнөдө) отко кириптер кылынышты дагы, өздөрүнө Аллаһтан башка жардамчы таппай калышты",
            "verse 71:26": "Нух айтты: “О, Раббим! Жер бетинде каапырлардан эч бирин калтырбагын",
            "verse 71:27": "Эгер аларды (тирүү) койсоң пенделериңди азгырышат жана бузуку, каапырларды гана насил (урпак) кылып калтырышат",
            "verse 71:28": "О, Раббим! Мени, менин ата-энемди, ыйман келтирип менин үйүмө киргендерди жана (бардык) ыймандуу эркектер менен ыймандуу аялдарды кечир! Заалымдарга өлүмдөн башканы көбөйтпө"
        },
        "Malay": {
            "verse 71:1": "Sesungguhnya Kami telah mengutus Nabi Nuh kepada kaumnya, (dengan berfirman kepadanya): \"Berikanlah peringatan dan amaran kepada kaummu sebelum mereka didatangi azab yang tidak terperi sakitnya\".",
            "verse 71:2": "dia pun (menyeru mereka dengan) berkata: \"Wahai kaumku! Sesungguhnya aku ini diutus kepada kamu, sebagai pemberi ingatan dan amaran yang nyata;",
            "verse 71:3": "\"Iaitu sembahlah kamu akan Allah dan bertaqwalah kepadaNya, serta taatlah kamu kepadaku;",
            "verse 71:4": "\"Supaya Allah mengampunkan bagi kamu sebahagian dari dosa-dosa kamu, dan memberi kamu hidup (dengan tidak terkena azab) hingga ke suatu masa yang tertentu; (maka segeralah beribadat dan bertaqwa) kerana sesungguhnya ajal (yang telah ditetapkan) Allah, apabila sampai masanya, tidak dapat ditangguhkan; kalaulah kamu mengetahui (hakikat ini tentulah kamu segera beriman)\".",
            "verse 71:5": "(Setelah puas menyeru mereka), Nabi Nuh berdoa dengan berkata: \"Wahai Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam (supaya mereka beriman);",
            "verse 71:6": "\"Maka seruanku itu tidak memberikan mereka (sesuatu faedah pun) selain daripada menambahi mereka melarikan diri (dari kebenaran).",
            "verse 71:7": "\"Dan sesungguhnya aku, tiap-tiap kali menyeru mereka (beriman) supaya Engkau mengampunkan dosa-dosa mereka, - mereka menyumbatkan telinganya dengan jari masing-masing, dan berselubung dengan pakaiannya, serta berdegil dengan keingkarannya, dan berlaku sombong takbur dengan melampau.",
            "verse 71:8": "\"Kemudian aku telah menyeru mereka dengan terang-terang;",
            "verse 71:9": "\"Selain dari itu, aku (berulang-ulang) menyeru mereka secara beramai-ramai dengan berterus-terang, dan menyeru mereka lagi secara berseorangan dengan perlahan-lahan.",
            "verse 71:10": "\"Sehingga aku berkata (kepada mereka): `Pohonkanlah ampun kepada Tuhan kamu, sesungguhnya adalah Ia Maha Pengampun.",
            "verse 71:11": "\"(Sekiranya kamu berbuat demikian), Ia akan menghantarkan hujan lebat mencurah-curah, kepada kamu;",
            "verse 71:12": "\"Dan Ia akan memberi kepada kamu dengan banyaknya harta kekayaan serta anak-pinak; dan Ia akan mengadakan bagi kamu kebun-kebun tanaman, serta mengadakan bagi kamu sungai-sungai (yang mengalir di dalamnya).",
            "verse 71:13": "\"Mengapa kamu berkeadaan tidak menghargai kebesaran Allah (dan kekuasaanNya), -",
            "verse 71:14": "\"Padahal sesungguhnya Ia telah menciptakan kamu dengan kejadian yang berperingkat-peringkat?",
            "verse 71:15": "\"Tidakkah kamu mengetahui dan memikirkan bagaimana Allah telah menciptakan tujuh petala langit bertingkat-tingkat,",
            "verse 71:16": "\"Dan Ia menjadikan padanya bulan sebagai cahaya serta menjadikan matahari sebagai lampu (yang terang-benderang),",
            "verse 71:17": "\"Dan Allah telah menumbuhkan kamu (hidup dari benda-benda yang berasal) dari bumi, dengan pertumbuhan yang sungguh-sungguh sempurna,",
            "verse 71:18": "\"Kemudian Ia mengembalikan kamu ke dalam bumi (sesudah mati), dan mengeluarkan kamu daripadanya (sesudah dihidupkan semula untuk dihitung amal kamu dan diberi balasan), dengan pengeluaran yang sesungguh-sungguhnya?",
            "verse 71:19": "\"Dan Allah telah menjadikan bumi bagi kamu sebagai hamparan,",
            "verse 71:20": "\"Supaya kamu melalui jalan-jalan yang luas padanya\".",
            "verse 71:21": "Nabi Nuh (merayu lagi dengan) berkata: \"Wahai Tuhanku! Sesungguhnya, mereka telah menderhaka kepadaku, dan mereka telah menurut orang yang harta bendanya dan anak-pinaknya tidak menambahinya melainkan kerugian (di akhirat kelak).",
            "verse 71:22": "\"Dan mereka telah menjalankan tipu daya dengan merancangkan rancangan yang amat besar jahatnya (untuk menentang seruanku).",
            "verse 71:23": "\"Dan (ketua-ketua) mereka (menghasut dengan) berkata: `Jangan kamu meninggalkan (penyembahan) tuhan-tuhan kamu, terutama (penyembahan) Wadd, dan Suwaa', dan Yaghuth, dan Ya'uuq, serta Nasr.",
            "verse 71:24": "\"Dan sesungguhnya ketua-ketua itu telah menyesatkan kebanyakan (dari umat manusia); dan (dengan yang demikian) janganlah Engkau (wahai Tuhanku) menambahi orang-orang yang zalim itu melainkan kesesatan jua\".",
            "verse 71:25": "Disebabkan dosa-dosa dan kesalahan mereka, mereka ditenggelamkan (dengan banjir dan taufan), kemudian (pada hari akhirat) dimasukkan ke dalam neraka; maka mereka tidak akan beroleh sebarang penolong yang lain dari Allah (yang dapat memberikan pertolongan).",
            "verse 71:26": "Dan Nabi Nuh (merayu lagi dengan) berkata: \"Wahai Tuhanku! Janganlah Engkau biarkan seorangpun dari orang-orang kafir itu hidup di atas muka bumi!",
            "verse 71:27": "\"Kerana sesungguhnya jika Engkau biarkan mereka (hidup), nescaya mereka akan menyesatkan hamba-hambaMu, dan mereka tidak akan melahirkan anak melainkan yang berbuat dosa lagi kufur ingkar.",
            "verse 71:28": "\"Wahai Tuhanku! Ampunkanlah bagiku, dan bagi kedua ibu bapaku, serta bagi sesiapa yang masuk ke rumahku dengan keadaan beriman; dan (ampunkanlah) bagi sekalian orang-orang yang beriman, lelaki dan perempuan (dalam segala zaman); dan janganlah Engkau tambahi orang-orang yang zalim melainkan kebinasaan!\""
        },
        "Malayalam": {
            "verse 71:1": "തീര്‍ച്ചയായും നൂഹിനെ അദ്ദേഹത്തിന്‍റെ ജനതയിലേക്ക് നാം അയച്ചു. നിന്‍റെ ജനതയ്ക്ക് വേദനയേറിയ ശിക്ഷ വരുന്നതിന്‍റെ മുമ്പ് അവര്‍ക്ക് താക്കീത് നല്‍കുക എന്ന് നിര്‍ദേശിച്ചു കൊണ്ട്‌",
            "verse 71:2": "അദ്ദേഹം പറഞ്ഞു: എന്‍റെ ജനങ്ങളെ, തീര്‍ച്ചയായും ഞാന്‍ നിങ്ങള്‍ക്കു വ്യക്തമായ താക്കീതുകാരനാകുന്നു.",
            "verse 71:3": "നിങ്ങള്‍ അല്ലാഹുവെ ആരാധിക്കുകയും അവനെ സൂക്ഷിക്കുകയും എന്നെ അനുസരിക്കുകയും ചെയ്യുവിന്‍.",
            "verse 71:4": "എങ്കില്‍ അവന്‍ നിങ്ങള്‍ക്കു നിങ്ങളുടെ പാപങ്ങളില്‍ ചിലത് പൊറുത്തുതരികയും, നിര്‍ണയിക്കപ്പെട്ട ഒരു അവധി വരെ നിങ്ങളെ നീട്ടിയിടുകയും ചെയ്യുന്നതാണ്‌. തീര്‍ച്ചയായും അല്ലാഹുവിന്‍റെ അവധി വന്നാല്‍ അത് നീട്ടി കൊടുക്കപ്പെടുകയില്ല. നിങ്ങള്‍ അറിഞ്ഞിരുന്നെങ്കില്‍.",
            "verse 71:5": "അദ്ദേഹം പറഞ്ഞു: എന്‍റെ രക്ഷിതാവേ, തീര്‍ച്ചയായും എന്‍റെ ജനതയെ രാവും പകലും ഞാന്‍ വിളിച്ചു.",
            "verse 71:6": "എന്നിട്ട് എന്‍റെ വിളി അവരുടെ ഓടിപ്പോക്ക് വര്‍ദ്ധിപ്പിക്കുക മാത്രമേ ചെയ്തുള്ളു.",
            "verse 71:7": "തീര്‍ച്ചയായും, നീ അവര്‍ക്ക് പൊറുത്തുകൊടുക്കുവാന്‍ വേണ്ടി ഞാന്‍ അവരെ വിളിച്ചപ്പോഴൊക്കെയും അവര്‍ അവരുടെ വിരലുകള്‍ കാതുകളില്‍ വെക്കുകയും, അവരുടെ വസ്ത്രങ്ങള്‍ മൂടിപ്പുതക്കുകയും, അവര്‍ ശഠിച്ചു നില്‍ക്കുകയും, കടുത്ത അഹങ്കാരം നടിക്കുകയുമാണ് ചെയ്തത്‌.",
            "verse 71:8": "പിന്നീട് അവരെ ഞാന്‍ ഉറക്കെ വിളിച്ചു.",
            "verse 71:9": "പിന്നീട് ഞാന്‍ അവരോട് പരസ്യമായും വളരെ രഹസ്യമായും പ്രബോധനം നടത്തി.",
            "verse 71:10": "അങ്ങനെ ഞാന്‍ പറഞ്ഞു: നിങ്ങള്‍ നിങ്ങളുടെ രക്ഷിതാവിനോട് പാപമോചനം തേടുക. തീര്‍ച്ചയായും അവന്‍ ഏറെ പൊറുക്കുന്നവനാകുന്നു.",
            "verse 71:11": "അവന്‍ നിങ്ങള്‍ക്ക് മഴ സമൃദ്ധമായി അയച്ചുതരും.",
            "verse 71:12": "സ്വത്തുക്കളും സന്താനങ്ങളും കൊണ്ട് നിങ്ങളെ അവന്‍ പോഷിപ്പിക്കുകയും, നിങ്ങള്‍ക്കവന്‍ തോട്ടങ്ങള്‍ ഉണ്ടാക്കിത്തരികയും നിങ്ങള്‍ക്കവന്‍ അരുവികള്‍ ഉണ്ടാക്കിത്തരികയും ചെയ്യും.",
            "verse 71:13": "നിങ്ങള്‍ക്കെന്തു പറ്റി? അല്ലാഹുവിന് ഒരു ഗാംഭീര്യവും നിങ്ങള്‍ പ്രതീക്ഷിക്കുന്നില്ല.",
            "verse 71:14": "നിങ്ങളെ അവന്‍ പല ഘട്ടങ്ങളിലായി സൃഷ്ടിച്ചിരിക്കുകയാണല്ലോ.",
            "verse 71:15": "നിങ്ങള്‍ കണ്ടില്ലേ; എങ്ങനെയാണ് അല്ലാഹു അടുക്കുകളായിട്ട് ഏഴ് ആകാശങ്ങള്‍ സൃഷ്ടിച്ചിരിക്കുന്നത് എന്ന്‌.",
            "verse 71:16": "ചന്ദ്രനെ അവിടെ ഒരു പ്രകാശമാക്കിയിരിക്കുന്നു.സൂര്യനെ ഒരു വിളക്കുമാക്കിയിരിക്കുന്നു.",
            "verse 71:17": "അല്ലാഹു നിങ്ങളെ ഭൂമിയില്‍ നിന്ന് ഒരു മുളപ്പിക്കല്‍ മുളപ്പിച്ചിരിക്കുന്നു.",
            "verse 71:18": "പിന്നെ അതില്‍ തന്നെ നിങ്ങളെ അവന്‍ മടക്കുകയും നിങ്ങളെ ഒരിക്കല്‍ അവന്‍ പുറത്തു കൊണ്ട് വരികയും ചെയ്യുന്നതാണ്‌.",
            "verse 71:19": "അല്ലാഹു നിങ്ങള്‍ക്കു വേണ്ടി ഭൂമിയെ ഒരു വിരിപ്പാക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 71:20": "അതിലെ വിസ്താരമുള്ള പാതകളില്‍ നിങ്ങള്‍ പ്രവേശിക്കുവാന്‍ വേണ്ടി.",
            "verse 71:21": "നൂഹ് പറഞ്ഞു: എന്‍റെ രക്ഷിതാവേ, തീര്‍ച്ചയായും ഇവര്‍ എന്നോട് അനുസരണക്കേട് കാണിക്കുകയും ഒരു വിഭാഗത്തെ പിന്തുടരുകയും ചെയ്തിരിക്കുന്നു; അവര്‍ക്ക് (പിന്തുടരപ്പെട്ട നേതൃവിഭാഗത്തിന്‌) സ്വത്തും സന്താനവും മൂലം (ആത്മീയവും പാരത്രികവുമായ) നഷ്ടം കൂടുക മാത്രമാണുണ്ടായത്‌.",
            "verse 71:22": "(പുറമെ) അവര്‍ (നേതാക്കള്‍) വലിയ കുതന്ത്രം പ്രയോഗിക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 71:23": "അവര്‍ പറഞ്ഞു: (ജനങ്ങളേ,) നിങ്ങള്‍ നിങ്ങളുടെ ദൈവങ്ങളെ ഉപേക്ഷിക്കരുത്‌. വദ്ദ്‌, സുവാഅ്‌, യഗൂഥ്‌, യഊഖ്‌, നസ്‌റ് എന്നിവരെ നിങ്ങള്‍ ഉപേക്ഷിക്കരുത്‌.",
            "verse 71:24": "അങ്ങനെ അവര്‍ വളരെയധികം ആളുകളെ വഴിപിഴപ്പിച്ചു. (രക്ഷിതാവേ,) ആ അക്രമകാരികള്‍ക്ക് വഴിപിഴവല്ലാതെ മറ്റൊന്നും നീ വര്‍ദ്ധിപ്പിക്കരുതേ.",
            "verse 71:25": "അവരുടെ പാപങ്ങള്‍ നിമിത്തം അവര്‍ മുക്കി നശിപ്പിക്കപ്പെട്ടു. എന്നിട്ടവര്‍ നരകാഗ്നിയില്‍ പ്രവേശിപ്പിക്കപ്പെട്ടു. അപ്പോള്‍ തങ്ങള്‍ക്ക് അല്ലാഹുവിനു പുറമെ സഹായികളാരെയും അവര്‍ കണ്ടെത്തിയില്ല.",
            "verse 71:26": "നൂഹ് പറഞ്ഞു.: എന്‍റെ രക്ഷിതാവേ, ഭൂമുഖത്ത് സത്യനിഷേധികളില്‍ പെട്ട ഒരു പൌരനെയും നീ വിട്ടേക്കരുതേ.",
            "verse 71:27": "തീര്‍ച്ചയായും നീ അവരെ വിട്ടേക്കുകയാണെങ്കില്‍ നിന്‍റെ ദാസന്‍മാരെ അവര്‍ പിഴപ്പിച്ചു കളയും. ദുര്‍വൃത്തന്നും സത്യനിഷേധിക്കുമല്ലാതെ അവര്‍ ജന്‍മം നല്‍കുകയുമില്ല.",
            "verse 71:28": "എന്‍റെ രക്ഷിതാവേ, എന്‍റെ മാതാപിതാക്കള്‍ക്കും എന്‍റെ വീട്ടില്‍ വിശ്വാസിയായിക്കൊണ്ട് പ്രവേശിച്ചവന്നും സത്യവിശ്വാസികള്‍ക്കും സത്യവിശ്വാസിനികള്‍ക്കും സത്യവിശ്വാസിനികള്‍ക്കും നീ പൊറുത്തുതരേണമേ. അക്രമകാരികള്‍ക്ക് നാശമല്ലാതൊന്നും നീ വര്‍ദ്ധിപ്പിക്കരുതേ."
        },
        "Norwegian": {
            "verse 71:1": "Vi sendte Noa til hans folk: «Advar ditt folk, før en smertelig straff kommer over dem.»",
            "verse 71:2": "Han sa: «Hør, mitt folk, jeg er en klar advarer for dere!",
            "verse 71:3": "Tjen Gud, og frykt Ham, og adlyd meg,",
            "verse 71:4": "så vil Han tilgi deres synder og gi dere en viss frist! Når Guds frist kommer, gis ingen utsettelse, om dere bare visste!»",
            "verse 71:5": "Han sa videre: «Herre, jeg har kalt på mitt folk natt og dag,",
            "verse 71:6": "men mitt kall har forsterket deres avstandtagen.",
            "verse 71:7": "Så ofte som jeg kalte dem, så Du kunne tilgi dem, satte de fingrene i ørene og gjemte seg i sine klær, og turet frem i største hovmod.",
            "verse 71:8": "Så kalte jeg på dem åpent,",
            "verse 71:9": "og så talte jeg både offentlig og privat,",
            "verse 71:10": "og jeg sa: ’Be om Herrens tilgivelse! Han er det som tilgir,",
            "verse 71:11": "og så vil Han sende dere strømmende regn fra oven,",
            "verse 71:12": "og forstrekke dere med rikdom og barn, og gi dere haver, og gi dere bekker.",
            "verse 71:13": "Hva er det med dere, at dere ikke håper på Guds langmodighet,",
            "verse 71:14": "da Han jo har skapt dere i utviklingsfaser?",
            "verse 71:15": "Har dere ikke sett hvordan Gud har skapt syv himler lagvis,",
            "verse 71:16": "og satt månen der som et bluss, og solen som en lysende lampe?",
            "verse 71:17": "Gud har latt dere vokse opp av jorden,",
            "verse 71:18": "og så lar Han dere vende tilbake dit, og så bringer Han dere frem på nytt.",
            "verse 71:19": "Gud har bredt ut jorden for dere som et teppe,",
            "verse 71:20": "så dere kan vandre på dens vide veier.’»",
            "verse 71:21": "Han fortsatte: «Herre, de har ikke adlydt meg, men fulgt ham, hvis rikdom og barn kun øker hans fortapelse,",
            "verse 71:22": "og de har smidd svære renker,",
            "verse 71:23": "og sier: ’Oppgi ikke deres guder! Forlat ikke Wadd og Suwa, og ikke Yaroth, Yahok eller Nasr.’",
            "verse 71:24": "De har ført mange vill. La de urettferdige bare tilta i villfarelse!»",
            "verse 71:25": "For sine overtredelsers skyld ble de druknet, og ført inn i en ild, og de fant ingen hjelpere utenom Gud.",
            "verse 71:26": "Og Noa sa: «Herre, etterlat ikke en eneste av de vantro på jorden!",
            "verse 71:27": "Om Du lar dem tilbake, så vil de føre dine tjenere vill, og de vil ikke fostre annet enn syndefulle vantro.",
            "verse 71:28": "Herre, tilgi meg og mine foreldre, og enhver som kommer inn i mitt hus som troende, og de troende menn og kvinner! Og la de urettferdige bare tilta i fordervelse.»"
        },
        "Pashto": {
            "verse 71:1": "بېشكه مونږ نوح خپل قوم ته په دې سره لېږلى و چې ته خپل قوم ووېروه، مخكې له دې چې په دوى ډېر دردوونكى عذاب راشي",
            "verse 71:2": "(نو) ده وویل: اى زما قومه! بېشكه زه ستاسو لپاره ښكاره وېروونكى یم",
            "verse 71:3": "چې تاسو د الله عبادت كوئ او له ده نه ووېرېږئ او زما اطاعت وكړئ",
            "verse 71:4": "دى به تاسو ته ستاسو ځینې ګناهونه وبخښي او ترټاكلې نېټې پورې به تاسو وروسته (او باقي پاتې) كړي، بېشكه د الله نېټه چې كله راشي (نو) وروسته كېدى نشي، كه چېرې تاسو پوهېږئ",
            "verse 71:5": "ده وویل: اى زما ربه! بېشكه ما شپه او ورځ خپل قوم (توحید ته) راوباله",
            "verse 71:6": "نو دوى ته زما بلنې زیاته نه كړه مګر تېښته",
            "verse 71:7": "او بېشكه زه چې هر وارې دوى د دې لپاره راوبلم چې ته دوى وبخښې (نو) دوى خپلې ګوتې په خپلو غوږونو كې ننباسي او په خپلو جامو سره ځان (مخ) پټ كړي او په كفر باندې) اصرار (او همېشه والى) كوي او لويي كوي ډېر غټه لويي",
            "verse 71:8": "بیا یقینًا ما دوى ښه په جار (په اوچت اواز سره) راوبلل",
            "verse 71:9": "بیا یقینًا ما دوى ته څرګند (او ښكاره) دعوت وركړ او ما دوى ته په پټه هم دعوت وركړ، ښه په پټه",
            "verse 71:10": "نو ما (دوى ته) وویل: تاسو له خپل رب نه بخښنه وغواړئ بېشكه دى ډېر بخښونكى دى",
            "verse 71:11": "دى به په تاسو ښه ورېدونكى باران راخوشې كړي",
            "verse 71:12": "او تاسو ته به مالونه او زامن درزیات كړي، او تاسو ته به باغونه پیدا كړي او تاسو ته به ولې پیدا كړي",
            "verse 71:13": "په تاسو څه شوي دي چې د الله لپاره د لويي عقیده نه ساتئ؟",
            "verse 71:14": "حال دا چې ده تاسو قسما قسم پیدا كړي یئ",
            "verse 71:15": "ایا تاسو نه دي كتلي چې الله اوه اسمانونه لاندې باندې پیدا كړي",
            "verse 71:16": "او په دغو كې يې سپوږمۍ روښانه جوړه كړه او لمر يې بَله (ځلېدونكې) ډيوه جوړه كړه",
            "verse 71:17": "او الله تاسو په خاصو زرغونولو سره له ځمكې نه رازرغون كړئ",
            "verse 71:18": "بیا به دى تاسو په دې كې ننباسي او راوبه موباسي په خاصو را اېستلو سره",
            "verse 71:19": "او الله تاسو لپاره ځمكه فرش جوړه كړې ده",
            "verse 71:20": "د دې لپاره چې تاسو د دې په ارتو لویو لارو باندې لاړ شئ",
            "verse 71:21": "نوح وویل: اى زما ربه! بېشكه دوى زما نافرماني وكړه، او دوى د هغه چا پیروي وكړه چې دغه (كس) ته د ده مال او د ده اولاد زیاته نه كړه مګر زیانكاري (او تاوان)",
            "verse 71:22": "او دغو خلقو ډېر لوى مكر وچلاوه",
            "verse 71:23": "او ويې ویل (خپلو خلقو ته): تاسو خپل معبودان مه پرېږدئ او تاسو مه پرېږدئ (عبادت د) وَد، او نه (د) سُواع او نه (د) یغوث او یعوق اونسر",
            "verse 71:24": "او یقینًا دغو (خلقو) ډېر كسان ګمراه كړي دي او ته ظالمانو ته مه زیاتوه مګر ګمراهي",
            "verse 71:25": "دوى د خپلو ګناهونو په سبب غرق (ډوب) كړِى شول، نو اور ته داخل كړى شول، نو دوى د خپلو ځانونو لپاره له الله نه غیر هېڅ مدد كوونكي ونه موندل",
            "verse 71:26": "او نوح وویل: اى زما ربه! ته د ځمكې له پاسه (د ځمكې په سر) په كافرانو كې هېڅ یو ګرځېدونكى مه پرېږده",
            "verse 71:27": "یقینًا ته كه دوى پرېږدې، نو دوى به ستا بنده ګان ګمراه كړي او دوى نه زېږوي مګر فاجر (بدكاره)، ډېر ناشكره",
            "verse 71:28": "اى زما ربه! ته ما وبخښه او زما مور او پلار او هغه څوك (هم) چې زما كور ته داخل شي، چې ایمان لرونكى وي اومومن سړي او مومنې ښځې (وبخښه) او ظالمانو ته مه زیاتوه مګر هلاكت"
        },
        "Persian": {
            "verse 71:1": "ما نوح را به سوى قومش فرستاديم كه: قوم خود را پيش از آنكه عذابى دردآور بر سرشان فرودآيد، بيم ده.",
            "verse 71:2": "گفت: اى قوم من، من بيم‌دهنده‌اى روشنگرم،",
            "verse 71:3": "خدا را بپرستيد، و از او بترسيد و از من اطاعت كنيد،",
            "verse 71:4": "تا گناهانتان را بيامرزد، و شما را تا مدتى معين مهلت دهد؛ زيرا آن مدت خدايى چون به سر آيد -اگر بدانيد- ديگر به تأخير نيفتد.",
            "verse 71:5": "گفت: اى پروردگار من، من قوم خود را شب و روز دعوت كردم،",
            "verse 71:6": "و دعوت من جز به فرارشان نيفزود.",
            "verse 71:7": "و من هر بار كه دعوتشان كردم تا تو آنها را بيامرزى، انگشتها در گوشهاى خود كردند و جامه در سر كشيدند و پاى فشردند و هر چه بيشتر سركشى كردند.",
            "verse 71:8": "پس به آواز بلند دعوتشان كردم.",
            "verse 71:9": "باز به آشكار گفتم و در نهان گفتم.",
            "verse 71:10": "سپس گفتم: از پروردگارتان آمرزش بخواهيد كه او آمرزنده است،",
            "verse 71:11": "تا از آسمان برايتان پى‌درپى باران فرستد،",
            "verse 71:12": "و شما را به اموال و فرزندان مدد كند و برايتان بستانها و نهرها بيافريند.",
            "verse 71:13": "شما را چه مى‌شود كه از شكوه خداوند نمى‌ترسيد،",
            "verse 71:14": "حال آنكه شما را به گونه‌هاى مختلف بيافريد.",
            "verse 71:15": "آيا نمى‌بينيد چگونه خدا هفت آسمان طبقه طبقه را بيافريد؟",
            "verse 71:16": "و ماه را روشنى آنها، و خورشيد را چراغشان گردانيد.",
            "verse 71:17": "و خدا شما را چون نباتى از زمين برويانيد.",
            "verse 71:18": "باز شما را بدان باز مى‌گرداند و باز از آن بيرون مى‌آورد.",
            "verse 71:19": "و خدا زمين را چون فرشى برايتان بگسترد،",
            "verse 71:20": "تا بر راه‌هاى پهناور آن برويد.",
            "verse 71:21": "نوح گفت: اى پروردگار من، آنها فرمان من نبردند، و از كسى پيروى كردند كه مال و فرزندش جز به زيانش نيفزود.",
            "verse 71:22": "مكر كردند - مكرى بزرگ.",
            "verse 71:23": "و گفتند: خدايانتان را وامگذاريد. وَدّ و سُواع و يَغوث و يَعوق و نَسر را ترك مكنيد.",
            "verse 71:24": "بسيارى را گمراه كردند و تو جز بر گمراهى ستمكاران ميفزاى.",
            "verse 71:25": "به كيفر گناهانشان غرقه شدند و به آتش رفتند و جز خدا براى خود يارى نيافتند.",
            "verse 71:26": "و نوح گفت: اى پروردگار من، بر روى زمين هيچ يك از كافران را مگذار،",
            "verse 71:27": "كه اگر بگذاريشان، بندگانت را گمراه مى‌كنند و جز فرزندانى فاجر و كافر نياورند.",
            "verse 71:28": "اى پروردگار من، مرا و پدر و مادرم را و هر كه را با ايمان به خانه من وارد شود و نيز مردان مؤمن و زنان مؤمن را بيامرز و ستمكاران را جز به هلاكتشان ميفزاى."
        },
        "Polish": {
            "verse 71:1": "Zaprawdę, wysłaliśmy Noego do jego ludu: \"Ostrzegaj twój lud, zanim spadnie na nich kara bolesna!\"",
            "verse 71:2": "On powiedział: \"O ludu mój! Ja jestem dla was jawnie ostrzegającym.",
            "verse 71:3": "Czcijcie Boga i bójcie się Go, i słuchajcie mnie!",
            "verse 71:4": "On wam przebaczy wasze grzechy i da wam zwłokę do określonego terminu. Lecz kiedy nadejdzie termin Boga, to już nie będzie mógł być opóźniony. O, gdybyście wiedzieli!\"",
            "verse 71:5": "Powiedział: \"Panie mój! Wzywałem swój lud noc i dzień,",
            "verse 71:6": "Lecz moje wezwanie zwiększyło tylko ich oddalenie.",
            "verse 71:7": "Zaprawdę, za każdym razem, kiedy ich wzywałem, abyś Ty im przebaczył, oni wkładali palce do uszu, okrywali się szatami i trwali w uporze, i okazywali niezmierną dumę.",
            "verse 71:8": "Następnie, wzywałem ich publicznie.",
            "verse 71:9": "Następnie, obwieszczałem im jawnie i mówiłem im w wielkiej tajemnicy.",
            "verse 71:10": "Powiedziałem: Proście o przebaczenie waszego Pana! Zaprawdę, On jest przebaczający!",
            "verse 71:11": "On spowoduje, iż niebo ześle wam obfity deszcz.",
            "verse 71:12": "On wspomoże was przez bogactwa i synów. On przygotuje dla was ogrody. On przygotuje dla was rzeki.",
            "verse 71:13": "Dlaczego nie spodziewacie się od Boga wielkoduszności?",
            "verse 71:14": "On stworzył was według pewnych stadiów.",
            "verse 71:15": "Czyż nie widzieliście, jak Bóg stworzył siedem niebios, nałożonych warstwami?",
            "verse 71:16": "I jak umieścił na nich księżyc jako światło, a słońce uczynił lampą?",
            "verse 71:17": "I Bóg spowodował, iż wyrośliście z ziemi jak rośliny.",
            "verse 71:18": "Ale On sprowadzi was do niej i wyprowadzi znowu niezawodnie.",
            "verse 71:19": "I Bóg uczynił dla was ziemię jak kobierzec,",
            "verse 71:20": "Abyście chodzili po niej szerokimi drogami. \"",
            "verse 71:21": "Powiedział Noe: \"Panie mój! Oni mnie nie posłuchali i poszli za człowiekiem, którego majątek i dzieci tylko powiększyły jego stratę.",
            "verse 71:22": "Oni knuli wielką chytrość",
            "verse 71:23": "I powiedzieli: Nie pozostawiajcie waszych bóstw! Nie pozostawiajcie ani Wadda, ani Suwa'a, ani Jaghuta, ani Ja`uka, ani Nasra",
            "verse 71:24": "Oni wprowadzili w błąd wielu. Nie powiększaj w niesprawiedliwych niczego oprócz zabłądzenia!",
            "verse 71:25": "Z powodu swoich błędów zostali pochłonięci, a potem wprowadzeni do ognia. I nie znaleźli oni, poza Bogiem, żadnych pomocników.\"",
            "verse 71:26": "I powiedział Noe: \"Panie mój! Nie zostaw na ziemi spośród niewiernych żadnego mieszkańca domostwa!",
            "verse 71:27": "Zaprawdę, jeśli Ty ich zostawisz, to wprowadzą oni w zabłądzenie Twoje sługi i nie zrodzą oni nikogo innego, jak tylko rozpustnika i niewiernego.",
            "verse 71:28": "Panie mój! Przebacz mi i moim rodzicom; i temu, kto wchodzi do mego domu jako wierny, i wierzącym - mężczyznom i kobietom! A niesprawiedliwym nie powiększaj niczego, jak tylko zgubę!\""
        },
        "Portuguese": {
            "verse 71:1": "Em verdade, enviamos Noé ao seu povo, (dizendo-lhe): Admoesta o teu povo, antes que o açoite um castigo doloroso!",
            "verse 71:2": "Disse: Ó povo meu, em verdade, sou um elucidativo admoestador para vós",
            "verse 71:3": "Adorai a Deus, temei-O e obedecei-me.",
            "verse 71:4": "Ele vos absolverá os pecados e vos concederá um prazo, até um término prefixado, porque quando chegar a hora do término prescrito por Deus, este não será prorrogado. Se o soubésseis!",
            "verse 71:5": "(Noé) disse: Ó Senhor meu, tenho predicado ao meu povo noite e dia;",
            "verse 71:6": "Porém, a minha predicação não fez outro, coisa senão aumentar o afastamento deles (da verdade).",
            "verse 71:7": "E cada vez que os convocava ao arrependimento, para que Tu os perdoasses, tapavam os ouvidos com os dedos e se envolviam com as suas vestimentas, obstinando-se no erro e ensoberbecendo-se grotescamente.",
            "verse 71:8": "Então, convoquei-os altissonantemente;",
            "verse 71:9": "Depois os exortei palatina e privativamente,",
            "verse 71:10": "Dizendo-lhes: Implorai o perdão do vosso Senhor, porque é Indulgentíssimo;",
            "verse 71:11": "Enviar-vos-á do céu copiosas chuvas,",
            "verse 71:12": "Aumentar-vos-á os vossos bens e filhos, e vos concederá jardins e rios.",
            "verse 71:13": "Que vos sucede, que não depositais as vossas esperanças em Deus,",
            "verse 71:14": "Sendo que Ele vos criou gradativamente?",
            "verse 71:15": "Não reparastes em como Deus criou sete céus sobrepostos,",
            "verse 71:16": "E colocou neles a lua reluzente e o sol, como uma lâmpada?",
            "verse 71:17": "E Deus vos produziu da terra, paulatinamente.",
            "verse 71:18": "Então, vos fará retornar a ela, e vos fará surgir novamente.",
            "verse 71:19": "Deus vos fez a terra como um tapete,",
            "verse 71:20": "Para que a percorrêsseis por amplos caminhos.",
            "verse 71:21": "Noé disse: Ó Senhor meu, eles me desobedeceram e seguiram aqueles para os quais os bens o filhos não fizeram mais do que lhes agravar a desventura!",
            "verse 71:22": "E conspiraram enormemente (contra Noé).",
            "verse 71:23": "E disseram (uns com os outros): Não abandoneis os vossos deuses, nem tampouco abandoneis Wadda, nem Sua'a, nem Yaguça, nem Ya'uca, nem Nassara,",
            "verse 71:24": "Apesar de estes haverem extraviado muitos, se bem que Tu, ó Senhor meu, não aumentarás em nada os iníquos, senão em extravio.",
            "verse 71:25": "Foram afogados pelos seus pecados, serão introduzidos no fogo infernal e não encontrarão, para si, socorredores, além de Deus.",
            "verse 71:26": "E Noé disse: Ó Senhor meu, não deixeis sobre a terra nenhum dos incrédulos.",
            "verse 71:27": "Porque, se deixares, eles extraviarão os Teus servos, e não gerarão senão os libertinos, ingratos.",
            "verse 71:28": "Ó Senhos meu, perdoa-me a mim, aos meus pais e a todo fiel que entrar em minha casa, assim como também aos fiéis e às fiéis, e não aumentes em nada os iníquos, senão em perdição."
        },
        "Punjabi": {
            "verse 71:1": "ਅਸੀਂ ਨੂਹ ਨੂੰ ਉਸ ਦੀ ਕੌਮ ਵੱਲ ਰਸੂਲ ਬਣਾ ਕੇ ਭੇਜਿਆ ਕਿ ਆਪਣੀ ਕੌਮ ਦੇ ਲੋਕਾਂ ਨੂੰ ਸਾਵਧਾਨ ਕਰ ਦੇਵੇਂ, ਇਸ ਤੋਂ’ ਪਹਿਲਾਂ ਕਿ ਉਨ੍ਹਾਂ ਉੱਤੇ ਇਕ ਦਰਦਨਾਕ ਆਫ਼ਤ ਆ ਜਾਵੇ।",
            "verse 71:2": "ਉਸ ਨੇ ਆਖਿਆ ਕਿ ਹੇ ਮੈਰੀ ਕੌਮ ਦੇ! ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਕ ਸਪੱਸ਼ਟ ਡਰਾਉਣ ਵਾਲਾ ਹਾਂ।",
            "verse 71:3": "ਕਿ ਤੁਸੀਂ ਅੱਲਾਹ ਦੀ ਇਬਾਦਤ ਕਰੋ ਅਤੇ ਉਸ ਤੋਂ ਡਰੋ ਅਤੇ ਮੇਰੀ ਆਗਿਆ ਦਾ ਪਾਲਣ ਕਰੋ।",
            "verse 71:4": "ਅੱਲਾਹ ਤੁਹਾਡੇ ਪਾਪਾਂ ਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇਵੇਗਾ ਅਤੇ ਤੁਹਾਨੂੰ ਇੱਕ ਮਿੱਥੇ ਹੋਏ ਸਮੇਂ ਤੱਕ ਮੌਕਾ ਦੇਵੇਗਾ ਬੇਸ਼ੱਕ ਜਦੋਂ ਅੱਲਾਹ ਦਾ ਮਿੱਥਿਆ ਹੋਇਆ ਸਮਾਂ ਆ ਜਾਂਦਾ ਹੈ ਫਿਰ ਉਹ ਟਾਲਿਆ ਨਹੀਂ ਜਾਂਦਾ, ਕਾਸ਼! ਤੁਸੀਂ ਉਸ ਨੂੰ ਜਾਣਦੇ।",
            "verse 71:5": "ਨੂਹ ਨੇ ਆਖਿਆ ਕਿ ਹੇ ਮੇਰਿਆ ਰੱਬਾ! ਮੈਂ ਆਪਣੀ ਕੌਂਮ ਨੂੰ ਦਿਨ ਅਤੇ ਰਾਤ ਨੂੰ ਪੁਕਾਰਿਆ।",
            "verse 71:6": "ਪਰੰਤੂ ਮੇਰੀ ਪੁਕਾਰ ਨੇ ਉਨ੍ਹਾਂ ਦੀ (ਮੇਰੇ ਤੋਂ) ਦੂਰੀ ਵਿਚ ਹੀ ਵਾਧਾ ਕੀਤਾ।",
            "verse 71:7": "ਅਤੇ ਮੈਂ ਜਦੋਂ ਵੀ ਉਨ੍ਹਾਂ ਨੂੰ ਸ਼ੁਲਾਇਆ ਕਿ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਨੂੰ ਮੁਆਫ਼ ਕਰ ਦਿਉ ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਕੰਨਾਂ ਵਿਚ ਉਂਗਲਾ ਪਾ ਲਈਆਂ ਅਤੇ ਆਪਣੇ ਉੱਪਰ ਆਪਣੇ ਕੱਪੜੇ ਲਪੇਟ ਲਏ ਅਤੇ ਜਿੱਦ ਤੇ ਅੜ ਗਏ ਅਤੇ ਬਹੁਤ ਹੀ ਹੰਕਾਰ ਕੀਤਾ।",
            "verse 71:8": "ਫਿਰ ਮੈਂ ਉਨ੍ਹਾਂ ਨੂੰ ਖੁਲ੍ਹ ਕੇ ਪੁਕਾਰਿਆ।",
            "verse 71:9": "ਫਿਰ ਮੈਂ ਉਨ੍ਹਾਂ ਵਿਚਕਾਰ ਸਮੂਹਕ ਤੌਰ ਤੇ ਪ੍ਰਚਾਰ ਕੀਤਾ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਹੌਲੀ ਜਿਹੀ ਸਮਝਾਇਆ।",
            "verse 71:10": "ਸੈਂ ਕਿਹਾ ਕਿ ਆਪਣੇ ਰੱਬ ਤੋਂ ਮੁਆਫ਼ੀ ਮੰਗੋ ਬੇਸ਼ੱਕ ਉਹ ਬੜਾ ਮੁਆਫ਼ੀ ਦੇਣ ਵਾਲਾ ਹੈ।",
            "verse 71:11": "ਉਹ ਤੁਹਾਡੇ ਤੇ ਅਸਮਾਨ ਵਿਚੋਂ ਕਾਫ਼ੀ ਪਾਣੀ ਵਰਸਾਏਗਾ।",
            "verse 71:12": "ਅਤੇ ਤੁਹਾਡੀ ਜਾਇਦਾਦ ਅਤੇ ਤੁਹਾਡੀ ਔਲਾਦ ਵਿਚ ਵਾਧਾ ਕਰੇਗਾ ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਬਾਗ਼ ਪੈਦਾ ਕਰੇਗਾ ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਨਹਿਰਾਂ ਵਗਾ ਦੇਵੇਗਾ।",
            "verse 71:13": "ਤੁਹਾਨੂੰ ਕੀ ਹੋ ਗਿਆ ਹੈ ਕਿ ਤੁਸੀਂ ਅੱਲਾਹ ਦੀ ਮਹਾਨਤਾ ਨੂੰ ਨਹੀਂ ਮੰਨਦੇ ਹੋ।",
            "verse 71:14": "ਹਾਲਾਂਕਿ ਉਸ ਨੇ ਤੁਹਾਨੂੰ ਤਰ੍ਹਾਂ-ਤਰ੍ਹਾਂ ਨਾਲ ਬਣਾਇਆ।",
            "verse 71:15": "ਕੀ ਤੁਸੀਂ ਦੇਖਿਆ ਨਹੀਂ ਕਿ ਅੱਲਾਹ ਨੇ ਕਿਸ ਤਰ੍ਹਾਂ ਇੱਕ ਤੇ ਇੱਕ ਸੱਤ ਅਸਮਾਨ ਬਣਾਏ।",
            "verse 71:16": "ਅਤੇ ਉਸ ਨੇ ਚੰਨ ਨੂੰ ਪ੍ਰਕਾਸ਼ ਅਤੇ ਸੂਰਜ ਨੂੰ ਦੀਵਾ ਬਣਾਇਆ।",
            "verse 71:17": "ਅਤੇ ਅੱਲਾਹ ਨੇ ਤੁਹਾਨੂੰ ਧਰਤੀ ਵਿੱਚੋਂ ਵਿਸ਼ੇਸ਼ ਢੰਗ ਨਾਲ ਪੈਦਾ ਕੀਤਾ।",
            "verse 71:18": "ਫਿਰ ਉਹ ਤੁਹਾਨੂੰ ਧਰਤੀ ਵਿਚ ਵਾਪਿਸ ਲੈ ਜਾਵੇਗਾ ਅਤੇ ਫਿਰ ਉਸ ਵਿਚੋਂ ਤੁਹਾਨੂੰ ਸ਼ਾਹਰ ਲੈ ਆਵੇਗਾ।",
            "verse 71:19": "ਅਤੇ ਅੱਲਾਹ ਨੇ ਤੁਹਾਡੇ ਲਈ ਧਰਤੀ ਨੂੰ ਪੱਧਰਾ ਬਣਾਇਆ ਹੈ।",
            "verse 71:20": "ਤਾਂ ਕਿ ਤੁਸੀ ਉਸ ਦੇ ਚੌੜੇ ਰਸਤਿਆਂ ਤੇ ਚੱਲੋ।",
            "verse 71:21": "ਨੂਹ ਨੇ ਆਖਿਆ ਹੇ ਮੇਰਿਆ ਰੱਬਾ! ਇਨ੍ਹਾਂ ਨੇ ਮੇਰਾ ਆਖਿਆ ਨਹੀਂ ਮੰਨਿਆ ਅਤੇ ਅਜਿਹੇ ਬੰਦਿਆਂ ਦਾ ਪਾਲਣ ਕੀਤਾ’ ਜਿਨ੍ਹਾਂ ਦੀ ਜਾਇਦਾਦ ਅਤੇ ਔਲਾਦ ਨੇ ਉਨ੍ਹਾਂ ਦੇ ਨੁਕਸਾਨ ਵਿਚ ਹੀ ਵਾਧਾ ਕੀਤਾ।",
            "verse 71:22": "ਅਤੇ ਇਨ੍ਹਾਂ ਨੇ ਬੜੇ ਛਲ-ਕਪਟ ਕੀਤੇ।",
            "verse 71:23": "ਅਤੇ ਇਨ੍ਹਾਂ ਨੇ ਕਿਹਾ ਕਿ ਤੁਸੀਂ ਆਪਣੇ ਪੂਜਨੀਕਾਂ ਨੂੰ ਕਦੇ ਵੀ ਨਾ ਛੱਡਿਉ। ਅਤੇ ਤੁਸੀਂ ਕਦੇ ਵੀ ਵੱਦ ਨੂੰ ਅਤੇ ਨਾ ਸਵਾਅ ਨੂੰ ਅਤੇ ਨਾਂ ਯਗੂਸ ਨੂੰ ਅਤੇ ਨਾ ਯਗੂਕ ਨੂੰ ਅਤੇ ਨਾ ਨਸਰ ਨੂੰ ਛੱਡਣਾ।",
            "verse 71:24": "ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਬਹੁਤ ਸਾਰੇ ਲੋਕਾਂ ਨੂੰ ਭਟਕਾ ਦਿੱਤਾ। ਅਤੇ ਹੁਣ ਤੂੰ ਇਨ੍ਹਾਂ ਕੁਰਾਹੀ ਲੋਕਾਂ ਦੀ ਗੁੰਮਰਾਹੀ ਵਿਚ ਵਾਧਾ ਕਰ।",
            "verse 71:25": "ਆਪਣੇ ਪਾਪਾਂ ਦੇ ਕਾਰਨ ਉਹ ਡੋਬੇ ਗਏ ਅਤੇ ਫਿਰ ਅੱਗ ਵਿਚ ਸੁੱਟੇ ਗਏ। ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਲਈ ਅੱਲਾਹ ਤੋਂ ਬਚਾਉਣ ਵਾਲਾ ਕੋਈ ਮਦਦਗਾਰ ਨਾ ਪਾਇਆ।",
            "verse 71:26": "ਅਤੇ ਨੂਹ ਨੇ ਆਖਿਆ ਕਿ ਹੇ ਮੇਰੇ ਪਾਲਣਹਾਰ! ਤੂੰ ਇਨ੍ਹਾਂ ਅਵੱਗਿਆਕਾਰੀਆਂ ਵਿਚੋਂ ਧਰਤੀ ਤੇ ਕੋਈ ਵੱਸਣ ਵਾਲਾ ਨਾ ਛੱਡ ।",
            "verse 71:27": "ਜੇਕਰ ਤੂੰ ਇਨ੍ਹਾਂ ਨੂੰ ਛੱਡ ਦਿੱਤਾ ਤਾਂ ਇਹ ਤੇਰੇ ਸ਼ੰਦਿਆਂ ਨੂੰ ਭਟਕਾਉਣਗੇ। ਅਤੇ ਇਨ੍ਹਾਂ ਦੇ ਵੱਸ਼ ਵਿਚ ਜਿਹੜਾ ਪੈਂਦਾ ਹੋਵੇਗਾ ਉਹ ਵਿਭਚਾਰੀ ਅਤੇ ਸਖਤ ਅਵੱਗਿਆਕਾਰੀ ਹੀ ਹੋਵੇਗਾ।",
            "verse 71:28": "ਹੇ ਮੇਰੇ ਪਾਲਣਹਾਰ! ਮੈਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇ ਅਤੇ ਮੇਰੇ ਮਾਤਾ ਪਿਤਾ ਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇ। ਅਤੇ ਜਿਹੜਾ ਮੇਰੇ ਘਰ ਵਿਚ ਸ਼ਰਧਾਵਾਨ ਹੋ ਕੇ ਦਾਖਿਲ ਹੋਵੇ ਤੂੰ ਉਸ ਨੂੰ ਵੀ ਮੁਆਫ਼ ਕਰ ਦੇ। ਅਤੇ ਸਾਰੇ ਪਵਿੱਤਰ ਮਰਦਾਂ ਅਤੇ ਔਰਤਾਂ ਨੂੰ ਮੁਆਫ਼ ਕਰ ਦੇ। ਅਤੇ ਅੱਤਿਆਚਾਰੀਆਂ ਲਈ ਵਿਨਾਸ਼ ਤੋਂ` ਬਿਨ੍ਹਾਂ ਕਿਸੇ ਚੀਜ਼ ਵਿਚ ਵਾਧਾ ਨਾ ਕਰ।"
        },
        "Roman english": {
            "verse 71:1": "Innaaa arsalnaa Noohan ilaa qawmihee an anzir qawmaka min qabli any yaatiyahum `azaabun aleem",
            "verse 71:2": "Qaala yaa qawmi innee lakum nazeerum mubeen",
            "verse 71:3": "Ani`udul laaha watta qoohu wa atee`oon",
            "verse 71:4": "Yaghfir lakum min zunoobikum wa yu`akhkhirkum ilaaa ajalim musammaa; innaa ajalal laahi izaa jaaa`a laa yu`akhkhar; law kuntum ta`lamoon",
            "verse 71:5": "Qaala rabbi innee da`awtu qawmee lailanw wa naharaa",
            "verse 71:6": "Falam yazid hum du`aaa `eee illaa firaaraa",
            "verse 71:7": "Wa inee kullamaa da`awtuhum litaghfira lahum ja`alooo asaabi`ahum fee aazaanihim wastaghshaw siyaabahum wa asaarroo wastakbarus tikbaaraa",
            "verse 71:8": "Summa innee da`aw tuhum jihaara",
            "verse 71:9": "Summaa inneee a`lantu lahum wa asrartu lahum israaraa",
            "verse 71:10": "Faqultus taghfiroo Rabakam innahoo kaana Ghaffaaraa",
            "verse 71:11": "Yursilis samaaa`a `alaikum midraaraa",
            "verse 71:12": "Wa yumdidkum bi am waalinw wa baneena wa yaj`al lakum Jannaatinw wa yaj`al lakum anhaaraa",
            "verse 71:13": "Maa lakum laa tarjoona lillaahi waqaaraa",
            "verse 71:14": "Wa qad khalaqakum at waaraa",
            "verse 71:15": "Alam taraw kaifa khalaqal laahu sab`a samaawaatin tibaaqaa",
            "verse 71:16": "Wa ja`alal qamara feehinna nooranw wa ja`alash shamsa siraajaa",
            "verse 71:17": "Wallaahu ambatakum minal ardi nabaataa",
            "verse 71:18": "Summa yu`eedukum feehaa wa ukhrijukum ikhraajaa",
            "verse 71:19": "Wallaahu ja`ala lakumul arda bisaataa",
            "verse 71:20": "Litaslukoo minhaa subulan fijaajaa",
            "verse 71:21": "Qaala Noohur Robbi innahum `asawnee wattaba`oo mal lam yazid hu maaluhoo wa waladuhooo illaa khasaara",
            "verse 71:22": "Wa makaroo makran kubbaaraa",
            "verse 71:23": "Wa qaaloo laa tazarunna aalihatakum wa laa tazarunna Waddanw wa laa Suwaa`anw wa laa Yaghoosa wa Ya`ooqa wa Nasraa",
            "verse 71:24": "Wa qad adalloo kasee ranw wa laa tazidiz zaalimeena illaa dalaalaa",
            "verse 71:25": "Mimmaa khateee` aatihim ughriqoo fa udkhiloo Naaran falam yajidoo lahum min doonil laahi ansaaraa",
            "verse 71:26": "Wa qaala Noohur Rabbi laa tazar `alal ardi minal kaafireena daiyaaraa",
            "verse 71:27": "Innaka in tazarhum yudil loo `ibaadaka wa laa yalidooo illaa faajiran kaffaaraa",
            "verse 71:28": "Rabbigh fir lee wa liwaa lidaiya wa liman dakhala baitiya mu`minanw wa lil mu`mineena wal mu`minaati wa laa tazidiz zaalimeena illaa tabaaraa"
        },
        "Russian": {
            "verse 71:1": "Послали Нуха Мы к его народу: \"Ты свой народ увещевай, Пока к ним не пришла мучительная кара\".",
            "verse 71:2": "Он им сказал: \"О мой народ! Я - увещатель ваш, Кто с ясной (миссией к вам послан),",
            "verse 71:3": "Чтоб поклонялись вы Аллаху, И Божьего страшились гнева, И, повинуясь, слушали меня.",
            "verse 71:4": "Тогда простит Он ваши прегрешенья И даст отсрочку вам (в сей жизни) До срока, что назначен Им. Поистине, когда сей срок придет, Его отсрочить невозможно. О, если бы вы знали это!\"",
            "verse 71:5": "И (Нух) сказал: \"О мой Господь! Я звал к Тебе народ свой днем и ночью,",
            "verse 71:6": "Но мой призыв лишь дальше удалил их (от Тебя).",
            "verse 71:7": "И всякий раз, когда я к ним взывал, Чтоб мог Ты им грехи простить, Они втыкали пальцы в уши, В одежды (плотно) закрывались, Упорствуя (в грехах) с надменною гордыней.",
            "verse 71:8": "Но и тогда я их открыто призывал.",
            "verse 71:9": "Затем я обращался к ним на людях И тайно (в личных разговорах).",
            "verse 71:10": "Я (им) сказал: \"Молите вашего Владыку о прощенье, - Ведь всепрощающ Он!",
            "verse 71:11": "Он (с неба) вам обильный дождь пошлет,",
            "verse 71:12": "И увеличит ваше достоянье, И ниспошлет вам больше сыновей, Сады устроит и обильно реки изольет.",
            "verse 71:13": "Что же не чтите вы величия Аллаха Достойным почитаньем?",
            "verse 71:14": "Ведь Он (назначил очередность) вам Различных стадий сотворенья.",
            "verse 71:15": "Ужель не видите вы, как Аллах Построил семь небес рядами,",
            "verse 71:16": "Меж ними свет луны пролил И солнце в качестве светильника поставил?",
            "verse 71:17": "Аллах взрастил вас из земли растеньем,",
            "verse 71:18": "И вновь в нее вас возвратит, И вновь вас изведет оттуда.",
            "verse 71:19": "Аллах ковром вам землю постелил,",
            "verse 71:20": "Чтоб вы по ней просторными дорогами ходили\".",
            "verse 71:21": "И Нух сказал: \"О мой Господь! Меня ослушались они и устремилися за теми, Чьи достояния и дети лишь отягчают их потери.",
            "verse 71:22": "И хитрость (тяжкую) задумали они,",
            "verse 71:23": "(Друг другу) говоря: \"Вы никаких богов своих не оставляйте: Ни Вадда, ни Совага, ни Йагуса, ни Йаука и ни Насра\".",
            "verse 71:24": "Они с пути уж многих сбили. И злотворящим ничего не прибавляй, А только (углуби) их заблужденье\".",
            "verse 71:25": "За их грехи они потоплены и введены в Огонь - И не нашли себе иного покровителя, опричь Аллаха.",
            "verse 71:26": "И Нух сказал: \"О мой Господь! Не сохрани на сей земле (под кровом) Ни одного (упрямого) неверца.",
            "verse 71:27": "Коль Ты оставишь хоть кого-нибудь из них, Они в Твоих служителях посеют смуту И никого не смогут породить, Кроме неверных и распутных.",
            "verse 71:28": "О мой Господь! Прости моим родителям и мне И всем, кто в дом мой верующим вступит, Всем верующим девам и мужам. Но злотворящим ничего не прибавляй, а погуби их\"."
        },
        "Sindhi": {
            "verse 71:1": "بيشڪ اسان نوح کي سندس قوم ڏانھن موڪليو ته پنھنجي قوم کي انھن وٽ ڏکوئيندڙ عذاب جي پھچڻ کان اڳ ۾ ڊيڄار.",
            "verse 71:2": "چيائين ته اي منھنجي قوم بيشڪ آءٌ اوھان لاءِ پڌرو ڊيڄاريندڙ آھيان.",
            "verse 71:3": "ته الله جي عبادت ڪريو ۽ کانئس ڊڄو ۽ منھنجو چيو مڃيو.",
            "verse 71:4": "ته اوھان جا گناھ اوھان کي بخشي ۽ اوھان کي ٺھرايل وقت تائين ڍر ڏئي، بيشڪ الله جو ٺھرايل وقت ايندو (تڏھن) ان کي ڍر نه ڏبي، جيڪڏھن ڄاڻندا آھيو.",
            "verse 71:5": "(نوح) چيو ته اي منھنجا پالڻھار بيشڪ آءٌ پنھنجي قوم کي رات ۽ ڏينھن سڏيندو رھيس.",
            "verse 71:6": "پوءِ منھنجي سڏڻ سندن حق ۾ ڀڄڻ کانسواءِ (ٻيو) ڪي نه وڌايو.",
            "verse 71:7": "۽ بيشڪ مون جڏھن به انھن کي سڏيو ته تون انھن کي بخشين (تڏھن) پنھنجيون آڱريون پنھنجن ڪَنن ۾ وڌائون ۽ پنھنجا ڪپڙا پاڻ تي ويڙھيائون ۽ (ڪُفر تي) قائم رھيا ۽ تمام گھڻو ھٺ ڪيائون.",
            "verse 71:8": "وري بيشڪ مون اُنھن کي ڏاڍيان سڏيو.",
            "verse 71:9": "وري بيشڪ مون انھن کي ظاھر ظھور چيو ۽ انھن کي ڳجھي طرح (به) چيم.",
            "verse 71:10": "پوءِ چيم ته پنھنجي پالڻھار کان بخشش گھرو، ڇوته اُھو بخشڻھار آھي.",
            "verse 71:11": "ته گھڻو وسندڙ مينھن اوھان تي لڳولڳ وسائي.",
            "verse 71:12": "۽ اوھان کي مال ۽ پٽ گھڻا ڏئي ۽ اوھان کي باغ ڏئي ۽ اوھان کي نَھرون بڻائي ڏي.",
            "verse 71:13": "اوھان کي ڇا (ٿيو) آھي جو الله جي وڏائي جو ويساھ نه ٿا رکو.",
            "verse 71:14": "حالانڪ اوھان کي قسمن قسمن ۾ بڻايائين.",
            "verse 71:15": "نه ڏسندا آھيو ڇا ته الله ڪيئن ستن آسمانن کي طبقا طبقا بڻايو.",
            "verse 71:16": "۽ انھن ۾ چنڊ کي روشن ڪيائين ۽ سج کي (چمڪندڙ) ڏيئو ڪيائين.",
            "verse 71:17": "۽ الله اوھان کي زمين منجھان ھڪڙي ڄمائڻ طرح ڄمايو.",
            "verse 71:18": "وري اوھان کي زمين ۾ موٽائي نيندو ۽ وري اوھان کي پوري طرح ٻاھر ڪڍندو.",
            "verse 71:19": "۽ الله اوھان لاءِ زمين کي وڇاڻو بڻايو.",
            "verse 71:20": "ته اُن ۾ ويڪرين واٽن سان ھلو.",
            "verse 71:21": "نوح چيو ته اي منھنجا پالڻھار بيشڪ انھن منھنجو چيو نه مڃيو ۽ اُنھن جي پويان لڳا جن جي حق ۾ سندن مال ۽ سندن اولاد ڇيئي کانسواءِ (ٻيو) ڪي نه وڌايو.",
            "verse 71:22": "۽ انھن تمام وڏو فريب پکيڙيو.",
            "verse 71:23": "۽ چيائون ته پنھنجن بُتن کي ڪڏھن نه ڇڏيو ۽ نڪي وَد ۽ نڪي سُوَاع ۽ نڪي يَغُوث ۽ يَعُوق ۽ نَسۡر کي ڇڏيو.",
            "verse 71:24": "۽ بيشڪ گھڻن کي گمراھ ڪيائون، ۽ (اي الله) ظالمن کي گمراھيءَ کانسواءِ (ٻيو) ڪي وڌيڪ نه ڏي.",
            "verse 71:25": "انھن کي سندن گناھن جي سبب ڪري ٻوڙيو ويو وري انھن کي باھ ۾ داخل ڪيو ويو، پوءِ الله کانسواءِ (ٻيو) ڪو پاڻ لاءِ مددگار نه لڌائون.",
            "verse 71:26": "۽ نُوح چيو ته اي منھنجا پالڻھار ڪافرن مان ڪو زمين تي رھندڙ نه ڇڏ.",
            "verse 71:27": "بيشڪ تون جيڪڏھن انھن کي ڇڏيندين ته تنھنجن ٻانھن کي گمراھ ڪندا ۽ اُھي بدڪار مُنڪر کانسواءِ (ٻيو) نه ڄڻيندا.",
            "verse 71:28": "اي منھنجا پالڻھار مون کي ۽ منھنجي ماءُ پيءُ کي بخش ۽ جيڪو منھنجي گھر ۾ مؤمن ٿي اچي تنھن کي ۽ سڀني مؤمنن ۽ مؤمنياڻين کي (بخش)، ۽ ظالمن کي ھلاڪيءَ کانسواءِ (ٻيو) ڪي وڌيڪ نه ڏي."
        },
        "Sinhalese": {
            "verse 71:1": "වේදනීය දඬුවමක් ඔවුන් වෙත පැමිණීමට පෙර නුඹ නුඹේ ජනයාට අනතුරු අඟවනු යැයි (නියෝග කර) අපි නූහ් ඔහුගේ ජනයා වෙත සැබැවින්ම එව්වෙමු.",
            "verse 71:2": "“අහෝ මාගේ ජනයිනි! නියත වශයෙන්ම මම නුඹලා වෙනුවෙන් ප්‍රකට අනතුරු අඟවන්නෙකු වෙමි” යැයි ඔහු පැවසුවේය.",
            "verse 71:3": "“නුඹලා අල්ලාහ්ට නැමදුම් කරනු. තවද ඔහුට බිය බැතිමත් වනු. තවද නුඹලා මට අවනත වනු”",
            "verse 71:4": "“නුඹලාගේ පාපයන්ට ඔහු නුඹලාට සමාව දෙනු ඇත. නියමිත කාලයක් දක්වා නුඹලා ව ඔහු ප්‍රමාද කරනු ඇත. නියත වශයෙන්ම අල්ලාහ්ගේ නිශ්චිත කාලය පැමිණි විට එය කල් දමනු නොලැබේ. නුඹලා දැන සිටියාහු නම්.”",
            "verse 71:5": "“මාගේ පරමාධිපතියාණනි! දිවා රාත්‍රියේ නියත වශයෙන්ම මම මාගේ ජනයාට ඇරයුම් කළෙමි” යැයි ඔහු පැවසීය.",
            "verse 71:6": "“නමුත් මාගේ ඇරයුම පලා යෑම මිස වෙනත් කිසිවක් ඔවුනට අධික නොකළේය.”",
            "verse 71:7": "“තවද නුඹ ඔවුනට සමාව දෙනු පිණිස නියත වශයෙන්ම මම ඔවුනට ඇරයුම් කළ සෑම කල්හිම ඔවුහු අඛණ්ඩව ඔවුන්ගේ ඇඟිලි කන් තුළ ඔබා ගත්තෝය. තවද ඔවුන්ගේ ඇඳුමින් ඔවුහු වසා ගත්තෝය. තවද පාපකම්හි නිරත වූවෝය. තවද අහංකාරයෙන් උඩඟුකම් පෑහ.”",
            "verse 71:8": "“පසු ව නියත වශයෙන්ම මම ඔවුනට විවෘත ව ඇරයුම් කළෙමි.”",
            "verse 71:9": "“පසු ව නියත වශයෙන්ම මම ප්‍රසිද්ධියේ ඔවුනට දැනුම් දුනිමි. තවද රහිසගත ව ද ඔවුනට දැනුම් දුනිමි.”",
            "verse 71:10": "“එවිට නුඹලා නුඹලාගේ පරමාධිපතිගෙන් සමාව අයැද සිටිනු. නියත වශයෙන්ම ඔහු අතික්ෂමාශීලී ය යැයි මම පැවසුවෙමි.”",
            "verse 71:11": "“ඔහු නුඹලා වෙත අහසින් (වැසි) නිරතුරු ව එවනු ඇත.”",
            "verse 71:12": "“ධනය හා දරුවන් ඔහු නුඹලාට පිරිනමනු ඇත. තවද නුඹලා වෙනුවෙන් උයන් ඇති කරනු ඇත. තවද නුඹලා වෙනුවෙන් ගංගාවන් ද ඇති කරනු ඇත”.",
            "verse 71:13": "“නුඹලාට කුමක් වී ද? අල්ලාහ්ට ගෞරවය කිරීමට නුඹලා අපේක්ෂා නොකරන්නෙහුය.”",
            "verse 71:14": "“තවද සැබැවින්ම ඔහු නුඹලා ව විවිධ අදියරයන්ගෙන් මැව්වේය.”",
            "verse 71:15": "“තල වශයෙන් අහස් හත අල්ලාහ් මවා ඇත්තේ කෙසේදැයි නුඹලා නොදුටුවෙහු ද?”",
            "verse 71:16": "“තවද ඔහු එහි සඳු ආලෝකයක් බවට පත් කළේය. තවද හිරු පහනක් බවට පත් කළේය.”",
            "verse 71:17": "“තවද අල්ලාහ් නුඹලා ව මහපොළොවෙන් බිහි කර වැඩෙන්නට සැලැස්වීය.”",
            "verse 71:18": "“පසු ව ඒ තුළට ඔහු නුඹලා ව නැවතත් එවන්නේය. තවද නුඹලා ව බැහැර කරමින් නික්මෙන්නට සලස්වන්නේය.”",
            "verse 71:19": "තවද නුඹලාට මහපොළොව ඇතිරිල්ලක් මෙන් අල්ලාහ් ඇති කළේය.",
            "verse 71:20": "නුඹලා එහි විවෘත මංමාවත් වල ගමන් කිරීම පිණිස.",
            "verse 71:21": "“මාගේ පරමාධිපතියාණනි! නියත වශයෙන්ම ඔවුන් මට පිටුපෑවෝය. තවද තම ධනය හා තම දරුවන් අලාභය මිස වෙනෙකක් ඔහුට අධික නොකළ අය ඔවුහු අනුගමනය කළෝය” යැයි නූහ් පැවසීය.",
            "verse 71:22": "“තවද ඔවුහු මහත් කුමන්ත්‍රණයක් සැලසුම් කළෝය.”",
            "verse 71:23": "“තවද නුඹලාගේ දෙවියන් නුඹලා අත් නොහරිනු. තවද වද්, සුවාඃ, යගූස්, යඌක්, හා නස්ර් (වැනි පිළිම ද) නුඹලා අත් නොහරිනු යැයි ඔවුහු පැවසුවෝය.”",
            "verse 71:24": "“තවද ඔවුහු බොහෝ දෙනා නොමග යැව්වෝය. අපරාධකරුවන්ට මුළා ව මිස වෙනත් කිසිවක් ඔබ අධික නොකරනු මැනව!” යනුවෙන් ප්‍රාර්ථනා කළහ.",
            "verse 71:25": "ඔවුන්ගේ වැරදි ක්‍රියා හේතුවෙන් ඔවුහු ගිල්වනු ලැබුවෝය. පසු ව නිරා ගින්නට ඇතුළත් කරනු ලැබුවෝය. ඔවුන් වෙනුවෙන් අල්ලාහ් හැර උදව්කරුවන් කිසිවෙකු හෝ ඔවුහු නොලැබුවෝය.",
            "verse 71:26": "“මාගේ පරමාධිපතියාණනි! දේවත්වය ප්‍රතික්ෂේප කරන්නන් අතරින් මහපොළොව මත කිසිදු නිවසක් හෝ අත් නොහරිනු මැනව!” යැයි නූහ් පැවසීය.",
            "verse 71:27": "“නියත වශයෙන්ම ඔබ ඔවුන් අතහැරියේ නම් ඔබේ ගැත්තන් ව ඔවුහු නොමග යවනු ඇත. තවද ඔවුහු ගුණමකු පාපතරයකු හැර බිහි නොකරනු ඇත.”",
            "verse 71:28": "“මාගේ පරමාධිපතියාණනි! මට හා මාගේ දෙමව්පියන්ටත් විශ්වාස කරන්නෙකු සේ මාගේ නිවසට ඇතුළත්වූවන්හටත් දේවත්වය විශ්වාස කරන්නන් හා විශ්වාස කරන්නියන් හටත් සමාව දෙනු මැනව! අපරාධකරුවන්හට විනාශය මිස වෙනකක් අධික නොකරනු මැනව!”"
        },
        "Somali": {
            "verse 71:1": "Annagaa Nabi Nuux u dirray Qoomkiisii si uu ugu digo Caddibaadda horteed.",
            "verse 71:2": "Wuxuuna ku yidhi Qoomkayow waxaan idiin ahay dige Cad «oo muuqda»",
            "verse 71:3": "ee Eebe Caabuda kana dhawrsada'anigana i adeeca.",
            "verse 71:4": "Wuu idiin dambi dhaafi wuuna idin dib dhigi ilaa muddo Magacaaban, marka Eebe la yimaaddo ajasha wax dib u dhigi ma jiro haddaad wax ogtihiin.",
            "verse 71:5": "Nabi Nuux wuxuu yiri Eebbow waan u yeeray Qoomkaygii Habeen iyo dharaar.",
            "verse 71:6": "Yeedhiddayduna uma siyaadinin waxaan caraar ahayn.",
            "verse 71:7": "Markasta oo aan u yeedhana si aad ugu dambi dhaafto waxay farahooda yeelaan dhagahooda, maryahoodana way isku dadaan, wayna ku Madax adaygaan xumaanta wayna is weyneeyaan.",
            "verse 71:8": "si kor ah yaan ugu yeedhay, «dadka dhexdiisa»",
            "verse 71:9": "Waana u qaylyey, hoosna waan ugu yeeray.",
            "verse 71:10": "Waxaana ku idhi Eebihiin dambi dhaaf weydiista waa dambi dhaaf badance.",
            "verse 71:11": "Cirkana Roob badan ha idinka keenee.",
            "verse 71:12": "Hana idiin kordhiyo Xoolo iyo Wiilal iyo Beero hana idiin yeelo Wabi yaal.",
            "verse 71:13": "Maxaad leedihiin ood weynida Eebe uga cabsoon weydeen.",
            "verse 71:14": "Isagoo idin abuuray idinkoo soo maray Xaalado kala duwan.",
            "verse 71:15": "Miyaydaan arkaynin sida Eebe u Abuuray toddoba Samo oo isdulsaaran.",
            "verse 71:16": "Dayaxana uga yeelay Dhexdooda Nuur, qorraxdana ka yeelay siraad.",
            "verse 71:17": "Eebe waa Kan idinka soo Bixiyay Dhulka.",
            "verse 71:18": "Haddana idinku Celin doona Dhexdiisa idinkana soo bixindoona.",
            "verse 71:19": "Eebe waa kan Idiinka yeelay Dhulka gogol.",
            "verse 71:20": "Si aad ugu socotaan Dhexdiisa waddooyin waawayn.",
            "verse 71:21": "(Nabi) Nuux wuxuu yidhi Eebow way I caasiyeen waxayna Raaceen kuwo aan xoolohoodu iyo Carrurtoodu waxaan khasaara ahayn u kordhinaynin.",
            "verse 71:22": "Dhagar waynna way Dhakreen.",
            "verse 71:23": "Waxay isu Dheheen ha ka tagina Ilaahyaalkiinna, hana ka Tagina wuddi iyo suwaax iyo yaguuth, iyo Yacuuq iyo Nasri.",
            "verse 71:24": "Waxayna Dhumiyeen dad Badan ee Eebow ha kordhinnin Daalimiinta waxaan baadi ahayn.",
            "verse 71:25": "Gafkoodi Dartiis yaa loo Maansheeyay Naarna Loo Galiyey, mana helayaan Eebe ka soke gargaare,",
            "verse 71:26": "Nuux wuxuu yidhi Eebow ha kaga tagin Dhulka korkiisa Gaalada Ruxna.",
            "verse 71:27": "Maxaayeelay Hadaad kaga tagto waxay Dhumin Addomahaaga, mana dhalayaan waxaan gaal xun ahayn.",
            "verse 71:28": "Eeboow u dambi Dhaaf Aniga iyo waalidiintay iyo ruuxii gala gurigeyga isagoo Mu'min ah Raf iyo haweenba, hana u kordhinnin Daalimiinta waxaan halaag ahayn."
        },
        "Spanish": {
            "verse 71:1": "Enviamos a Nuh a su gente: Advierte a tu gente antes de que les llegue un doloroso castigo!.",
            "verse 71:2": "Dijo: Gente mía! He venido a vosotros para advertiros con claridad",
            "verse 71:3": "que adoréis a Allah, Le temáis y me obedezcáis.",
            "verse 71:4": "Él os perdonará vuestras faltas y os dejará hasta un plazo fijado, pero cuando el plazo de Allah llegue a su fin, no habrá más demora. Si supierais!",
            "verse 71:5": "Dijo: Señor mío! He llamado a mi gente noche y día",
            "verse 71:6": "pero mi llamada no ha hecho sino aumentarles su rechazo.",
            "verse 71:7": "Cada vez que les he llamado a Tu perdón, se han puesto los dedos en los oídos y se han tapado con los vestidos, aferrándose a lo suyo con gran soberbia.",
            "verse 71:8": "Los he llamado de viva voz",
            "verse 71:9": "y les he hablado en público y a cada uno en privado.",
            "verse 71:10": "Y les he dicho: Pedid perdón a vuestro Señor, Él es muy Perdonador.",
            "verse 71:11": "Enviará sobre vosotros el cielo con lluvias abundantes",
            "verse 71:12": "y os dará más riquezas e hijos, así como jardines y ríos.",
            "verse 71:13": "Pero qué os pasa que no podéis concebir grandeza en Allah",
            "verse 71:14": "cuando Él os creó en fases sucesivas?",
            "verse 71:15": "Es que no veis cómo Allah creó siete cielos uno sobre otro",
            "verse 71:16": "y puso en ellos una luna a modo de luz y un sol a modo de lámpara,",
            "verse 71:17": "y os originó a partir de la tierra, cual plantas?",
            "verse 71:18": "Luego os hará regresar a ella y os hará salir de nuevo.",
            "verse 71:19": "Allah os ha puesto la tierra extendida",
            "verse 71:20": "para que en ella recorrierais amplios caminos.",
            "verse 71:21": "Dijo Nuh: Señor mío! Me han desobedecido y han seguido a quien no les procura ni más riquezas ni más hijos, sólo perdición.",
            "verse 71:22": "Y urdieron una gran estratagema",
            "verse 71:23": "Dijeron: No abandonéis a nuestros dioses, no abandonéis a Wudd ni a Suwaa ni a Yaghuz ni a Yauq ni a Nasr.",
            "verse 71:24": "(dijo Nuh:) Ellos han extraviado a muchos: No acrecientes a los injustos sino en extravío!",
            "verse 71:25": "Y así fueron ahogados a causa de sus transgresiones y fueron introducidos en un fuego; y no encontraron para ellos quien los defendiera aparte de Allah.",
            "verse 71:26": "Y dijo Nuh: Señor mío! No dejes en pie sobre la tierra ningún hogar de incrédulos.",
            "verse 71:27": "Pues si los dejas, extraviarán a Tus siervos y no engendrarán sino libertinos e incrédulos.",
            "verse 71:28": "Señor mío! Perdóname a mí y a mis padres y a todo aquel que entre creyente en mi casa, así como a todos los creyentes y a todas las creyentes. Y no acrecientes a los injustos sino en destrucción."
        },
        "Swahili": {
            "verse 71:1": "Hakika Sisi tulimtuma Nuh'u kwa watu wake: Uwaonye kaumu yako kabla ya kuwafikia adhabu chungu.",
            "verse 71:2": "Akasema: Enyi watu wangu! Kwa hakika mimi ni mwonyaji wa dhaahiri kwenu,",
            "verse 71:3": "Ya kwamba mumuabudu Mwenyezi Mungu, na mumche Yeye, na mumt'ii.",
            "verse 71:4": "Atakughufirieni madhambi yenu, na atakuakhirisheni mpaka muda ulio wekwa. Hakika muda wa Mwenyezi Mungu utapo fika haucheleweshwi. Laiti mngejua!",
            "verse 71:5": "Akasema: Ee Mola wangu Mlezi! Hakika mimi nimewaita watu wangu usiku na mchana,",
            "verse 71:6": "Lakini wito wangu haukuwazidisha ila kukimbia.",
            "verse 71:7": "Na hakika mimi kila nilipo waita ili upate kuwaghufiria, walijiziba masikio yao kwa vidole vyao, na wakajigubika nguo zao, na wakakamia, na wakatakabari vikubwa mno!",
            "verse 71:8": "Tena niliwaita kwa uwazi,",
            "verse 71:9": "Kisha nikawatangazia kwa kelele, tena nikasema nao kwa siri.",
            "verse 71:10": "Nikasema: Ombeni msamaha kwa Mola wenu Mlezi; hakika Yeye ni Mwingi wa kusamehe.",
            "verse 71:11": "Atakuleteeni mvua inyeshe mfululizo.",
            "verse 71:12": "Na atakupeni mali na wana, na atakupeni mabustani na atakufanyieni mito.",
            "verse 71:13": "Mna nini hamweki heshima ya Mwenyezi Mungu?",
            "verse 71:14": "Na hali Yeye kakuumbeni daraja baada ya daraja?",
            "verse 71:15": "Kwani hamwoni jinsi Mwenyezi Mungu alivyo ziumba mbingu saba kwa matabaka?",
            "verse 71:16": "Na akaufanya mwezi ndani yake uwe nuru, na akalifanya jua kuwa taa?",
            "verse 71:17": "Na Mwenyezi Mungu amekuotesheni katika ardhi kama mimea.",
            "verse 71:18": "Kisha atakurudsheni humo na atakutoeni tena.",
            "verse 71:19": "Na Mwenyezi Mungu amekukunjulieni ardhi kama busati.",
            "verse 71:20": "Ili mtembee humo katika njia zilizo pana.",
            "verse 71:21": "Nuh'u akasema: Mola wangu Mlezi! Hakika hao wameniasi, na wamemfuata yule ambaye mali yake na wanawe hawakumzidishia ila khasara.",
            "verse 71:22": "Na wakapanga vitimbi vikubwa.",
            "verse 71:23": "Na wakasema: Msiwaache miungu yenu, wala msimwache Wadda wala Suwaa' wala Yaghutha, wala Yau'qa, wala Nasra.",
            "verse 71:24": "Na hao walikwisha wapoteza wengi, wala usiwazidishie walio dhulumu ila kupotea.",
            "verse 71:25": "Basi kwa ajili ya makosa yao waligharikishwa wakaingizwa Motoni, wala hawakuwapata wa kuwanusuru badala ya Mwenyezi Mungu.",
            "verse 71:26": "Na Nuh'u akasema: Mola wangu Mlezi! Usimwache juu ya ardhi mkaazi wake yeyote katika makafiri!",
            "verse 71:27": "Hakika ukiwaacha watawapoteza waja wako, wala wao hawatazaa ila waovu makafiri.",
            "verse 71:28": "Mola wangu Mlezi! Nighufirie mimi na wazazi wangu, na kila aliye ingia nyumbani mwangu kuwa ni mwenye kuamini, na Waumini wote wanaume, na Waumini wanawake. Na wala usiwazidishie walio dhulumu ila kupotea."
        },
        "Swedish": {
            "verse 71:1": "VI SÄNDE Noa till hans folk med uppdraget: \"Varna ditt folk, innan ett plågsamt straff drabbar dem!\"",
            "verse 71:2": "[Och Noa] sade: \"Jag har kommit, mitt folk, för att varna er klart och entydigt:",
            "verse 71:3": "dyrka Gud och frukta Honom! Och lyd mig!",
            "verse 71:4": "Då skall Gud förlåta er era synder och ge er uppskov till en tid [som Han] har fastställt - när den är inne, kan den inte uppskjutas - om ni [bara] visste...!\"",
            "verse 71:5": "[Noa bad till Gud och] sade: \"Herre! Jag har talat till mitt folk natt och dag,",
            "verse 71:6": "men mina uppmaningar har bara lett till att de alltmer drar sig undan.",
            "verse 71:7": "Och varje gång jag kallar dem [till tron] för att Du skall ge dem Din förlåtelse, sätter de fingrarna i öronen och sveper kläderna tätare om sig, och de förskansar sig i envishet och högmod.",
            "verse 71:8": "Jag har vädjat till dem med hög röst",
            "verse 71:9": "och talat offentligt till dem på allmän plats, och jag har talat med dem i förtrolighet",
            "verse 71:10": "och sagt dem: 'Be er Herre om förlåtelse för era synder! Han förlåter och förlåter på nytt;",
            "verse 71:11": "Han skall låta himlen sända er rikligt regn",
            "verse 71:12": "och föröka er rikedom och era söners [antal] och skänka er trädgårdar, vattnade av bäckar.",
            "verse 71:13": "Hur är det fatt med er? Ni håller inte Gud i ära så som Han i Sitt höga majestät bör äras!",
            "verse 71:14": "Det är Han som har skapat er steg för steg!",
            "verse 71:15": "Ser ni inte att Gud har skapat sju himlar, som välver sig över varandra,",
            "verse 71:16": "och satt ibland dem månen [som lyser med lånat] ljus och solen som en sprakande fackla?",
            "verse 71:17": "Gud har låtit er växa upp som plantor ur jorden;",
            "verse 71:18": "med den skall Han sedan låta er återförenas [och till slut] skall Han låta er träda fram [ur den på nytt] i uppståndelsens [ögonblick].",
            "verse 71:19": "Och Gud har brett ut jordens [yta] för er som en matta,",
            "verse 71:20": "för att ni skall kunna färdas över den på vägar och stigar.'”",
            "verse 71:21": "Noa sade [vidare]: \"Herre! De lyssnar inte till mig men följer den som [stoltheten över stora] rikedomar och [många] söner driver allt närmare undergången.",
            "verse 71:22": "De har gjort upp en slug plan",
            "verse 71:23": "och säger [till varandra]: 'Låt oss aldrig överge våra gudar – varken Wadd, Suwa, Yaghuth, Ya'uq eller Nasr!'",
            "verse 71:24": "På detta sätt har de lett många vilse. Herre! Låt dessa orättfärdiga [människor] gå vidare från misstag till misstag!\"",
            "verse 71:25": "De dränktes på grund av sina synder och [en Dag] skall de ledas in i Elden, och de kommer inte att finna en annan hjälpare än Gud.",
            "verse 71:26": "Och Noa [sade till Gud]: \"Herre! Låt ingen av dem som förnekar sanningen bli kvar på jorden;",
            "verse 71:27": "om Du låter dem bli kvar, kommer de att leda Dina tjänare vilse och de kan inte lämna i arv annat än [ytterligare] sedligt fördärv och gudlöshet.",
            "verse 71:28": "Herre! Skänk oss Din förlåtelse - mig och mina föräldrar och de troende som stiger in i mitt hus och alla troende män och kvinnor! Och låt de orättfärdiga gå allt snabbare mot sin undergång!\""
        },
        "Tajik": {
            "verse 71:1": "Мо Нӯҳро ба сӯи қавмаш фиристодем, ки қавми худро пеш аз он ки азобе дардовар бар сарашон фуруд ояд, бим деҳ.",
            "verse 71:2": "Гуфт: «Эй қавми ман, ман бимдиҳандае равшангарам,",
            "verse 71:3": "Худоро бипарастед ва аз Ӯ битарсед ва ба ман итоъат кунед,",
            "verse 71:4": "то гуноҳонатонро бибахшояд ва шуморо то муддате муъайян мӯҳлат диҳад, зеро он муддати худо вақте ояд, — агар бидонед, — дигар ба дер наяфтад».",
            "verse 71:5": "Гуфт: «Эй Парвардигори ман, ман қавми худро шабу рӯз даъват кардам",
            "verse 71:6": "ва датъвати ман ҷуз ба фирорашон наяфзуд.",
            "verse 71:7": "Ва ман, ҳар бор, ки даъваташон кардам, то Ту онҳоро бибахшоӣ, ангуштҳо дар гӯшҳои худ карданд ва ҷома дар сар кашиданд ва пой фишурданд ва ҳар чӣ бештар саркашӣ карданд.",
            "verse 71:8": "Пас онҳоро ба овози баланд даъват кардам.",
            "verse 71:9": "Боз ба ошкор гуфтам ва дар ниҳон гуфтам.",
            "verse 71:10": "Сипас гуфтам: «Аз Парвардигоратон бахшоиш бихоҳед, ки Ӯ бахшоянда аст,",
            "verse 71:11": "то аз осмон бароятон пай дар пай борон фиристад",
            "verse 71:12": "ва шуморо ба'молҳову фарзандон мадад кунад ва бароятон бӯстонҳову наҳрҳо биёфаринад.",
            "verse 71:13": "Шуморо чӣ мешавад, ки аз шукӯҳи Худованд наметарсед,",
            "verse 71:14": "ҳол он ки шуморо ба гунаҳои мухталиф биёфарид.",
            "verse 71:15": "Оё намебинед, ки чӣ гуна Худо ҳафт осмони табақа-табақаро биёфарид?",
            "verse 71:16": "Ва моҳро равшании онҳо ва хуршедро чароғашон гардонид.",
            "verse 71:17": "Ва Худо шуморо чун наботе аз замин бирӯёнид,",
            "verse 71:18": "Боз шуморо ба он бозмегардонад ва боз аз он берун меоварад,",
            "verse 71:19": "Ва Худо заминро чун фарше бароятон бигустурд,",
            "verse 71:20": "то бар роҳҳои паҳновари он биравед».",
            "verse 71:21": "Нӯҳ гуфт: «Эй Парвардигори ман, онҳо фармони ман набурданд ва ба касе пайравӣ карданд, ки молу фарзандаш ҷуз ба зиёнаш наяфзуд.",
            "verse 71:22": "Макр карданд — макре бузург.",
            "verse 71:23": "Ва гуфтанд: «Худоёнатонро тарк накунед:, Вадд ва Сувоъ ва Яғус ва Яъуқ ва Насрро* тарк накунед!»",
            "verse 71:24": "Бисёреро гумроҳ карданд ва ту ҷуз бар гумроҳии ситамкорон наяфзой!»",
            "verse 71:25": "Ба ҷазои гуноҳонашон ғарк шуданд ва ба оташ рафтанд ва ҷуз Худо барои худ ёваре наёфтанд.",
            "verse 71:26": "Ва Нӯҳ гуфт: «Эй Парвардигори ман, бар рӯи замин ҳеҷ як аз кофиронро магузор,",
            "verse 71:27": "ки агар бигузорияшон, бандагонро гупроҳ мекунанд ва ҷуз фарзандоне фоҷиру кофир наёваранд.",
            "verse 71:28": "Эй Парвардигори ман, марову падару модарамро ва ҳар киро бо имон ба хонаи ман ворид шавад ва низ мардони мӯъмину занони мӯъминро бибахшо ва ситамкоронро ҷуз ба ҳалокаташон маяфзой!»"
        },
        "Tamil": {
            "verse 71:1": "நிச்சயமாக நாம் நூஹை, அவருடைய சமூகத்தாரிடம்; \"நீர் உம் சமூகத்தாருக்கு நோவினை செய்யும் வேதனை அவர்கள் மீது வருவதற்கு முன்னர் (அதுபற்றி) அச்சமூட்டி எச்சரிக்கை செய்வீராக\" என (ரஸூலாக) அனுப்பினோம்.",
            "verse 71:2": "\"என் சமூகத்தார்களே! நிச்சயமாக நான் உங்களுக்கு பகிரங்கமாக அச்சமூட்டி எச்சரிக்கை செய்பவன்\" என்று கூறினார்.",
            "verse 71:3": "\"அல்லாஹ்வையே நீங்கள் வணங்குங்கள்; அவனுக்கு அஞ்சிக் கொள்ளுங்கள்; எனக்கும் வழிபடுங்கள்.",
            "verse 71:4": "\"(இவ்வாறு நீங்கள் நடந்தால்) உங்களுடைய பாவங்களை அவன் மன்னிப்பான்; மேலும் ஒரு குறிப்பிட்ட தவணைவரை அவன் உங்களுக்கு அவகாசமளிப்பான்; நிச்சயமாக அல்லாஹ்வின் தவணை வரும்போது, அது பிற்படுத்தப்படமாட்டாது - (இதை) நீங்கள் அறிந்து கொண்டவர்களாக இருந்தால்\" (என்றும் கூறினார்).",
            "verse 71:5": "பின்னர் அவர், \"என் இறைவா! நிச்சயமாக, நான் என் சமூகத்தாரை இரவிலும், பகலிலும் (நேர்வழியின்பால்) அழைத்தேன்.",
            "verse 71:6": "\"ஆனால் என் அழைப்பு அவர்கள் (நேர்வழியிலிருந்து) வெருண்டு ஓடுதலை அதிகரித்ததல்லாமல் வேறில்லை.",
            "verse 71:7": "\"அன்றியும்; நீ அவர்களுக்கு மன்னிப்பு அளிப்பதற்காக, (உன் பக்கம்) நிச்சயமாக அவர்களை நான் அழைத்தபோதெல்லாம், தம் காதுகளில் தம் விரல்களை வைத்துக் கொண்டனர், மேலும், தங்களைத் தம் ஆடைகளைக் கொண்டு மூடிக் கொண்டனர், அன்றியும், அவர்கள் (தம் வழிகேட்டில்) பிடிவாதமாகவும்; பெரும் மமதை பெருமையடித்துக் கொள்வோராகவுமே இருக்கிறார்கள்.",
            "verse 71:8": "\"பின்னர், நிச்சயமாக நான் அவர்களை சப்தமாக அழைத்(தும் போதித்)தேன்.",
            "verse 71:9": "\"அதன் பின்னர், நிச்சயமாக நான் அவர்களிடம் பகிரங்கமாகவும் பேசினேன்; இரகசியமாக அந்தரங்கத்திலும் பேசினேன்.",
            "verse 71:10": "மேலும், \"நீங்கள் உங்களுடைய இறைவனிடம் மன்னிப்புத் தேடுங்கள்; நிச்சயமாக அவன் மிகவும் மன்னிப்பவன்\" என்றுங் கூறினேன்.",
            "verse 71:11": "\"(அப்படிச் செய்வீர்களாயின்) அவன் உங்கள் மீது தொடர்ந்து மழையை அனுப்புவான்.",
            "verse 71:12": "\"அன்றியும் அவன் உங்களுக்குப் பொருள்களையும், புதல்வர்களையும் கொண்டு உதவி செய்வான்; இன்னும், உங்களுக்காகத் தோட்டங்களை உண்டாக்குவான்; உங்களுக்காக ஆறுகளையும் (பெருக்கெடுத்து ஓடுமாறு) உண்டாக்குவான்.",
            "verse 71:13": "\"உங்களுக்கு என்ன நேர்ந்தது? அல்லாஹ்வின் மகத்துவத்தை(யும், மேன்மையையும்) நீங்கள் உணராமலிருக்கின்றீர்கள்.",
            "verse 71:14": "\"நிச்சயமாக அவன் உங்களை பல நிலைகளிலிருந்து படைத்தான்.",
            "verse 71:15": "\"ஏழு வானங்களையும் அல்லாஹ் அடுக்கடுக்காய் எப்படிப் படைத்திருக்கின்றான் என்பதை நீங்கள் பார்க்கவில்லையா?",
            "verse 71:16": "\"இன்னும் அவற்றில் சந்திரனைப் பிரகாசமாகவும், சூரியனை ஒளிவிளக்காகவும் அவனே ஆக்கியிருக்கின்றான்.",
            "verse 71:17": "\"அல்லாஹ்வே உங்களை பூமியிலிருந்து சிறந்த முறையில் உருவாக்கினான்.",
            "verse 71:18": "\"பின்னர் அந்த பூமியிலேயே உங்களை மீண்டும் சேர்த்து, மற்றொருமுறை உங்களை (அதிலிருந்து) வெளிப்படுத்துவான்.",
            "verse 71:19": "\"அன்றியும், அல்லாஹ், உங்களுக்காக பூமியை விரிப்பாக ஆக்கினான்.",
            "verse 71:20": "\"அதில் நீங்கள் செல்வதற்காக விசாலமான பாதைகளையும் அமைத்தான்\" (என்றும் போதித்தார்).",
            "verse 71:21": "நூஹ் கூறினார்: \"என் இறைவா! நிச்சயமாக அவர்கள் எனக்கு மாறு செய்கின்றனர், அன்றியும், எவர்களுக்கு அவர் பொருளும், அவர் மக்களும் நஷ்டத்தையன்றி (வேறு எதையும்) அதிகரிக்கவில்லையோ, அ(த்தகைய)வர்களையே அவர்கள் பின்பற்றுகின்றனர்.",
            "verse 71:22": "\"மேலும் (எனக்கெதிராகப்) பெரும் சூழ்ச்சியாகச் சூழ்ச்சி செய்கின்றனர்.\"",
            "verse 71:23": "மேலும் அவர்கள்; \"உங்கள் தெய்வங்களை விட்டுவிடாதீர்கள்; இன்னும் வத்து, ஸுவாஉ, யகூஸு, யஊக், நஸ்ரு ஆகியவற்றை நிச்சயமாக நீங்கள் விட்டுவிடாதீர்கள்\" என்றும் சொல்கின்றனர்.",
            "verse 71:24": "\"நிச்சயமாக அவர்கள் அநேகரை வழிகெடுத்துவிட்டனர், ஆகவே இவ்வநியாயக் காரர்களுக்கு வழி கேட்டைத் தவிர, வேறு எதையும் நீ அதிகப்படுத்தாதே.\"",
            "verse 71:25": "ஆகவே, அவர்கள் தம் பாவங்களினால் மூழ்கடிக்கப்பட்டு, பின்னால் நரக நெருப்பிலும் புகுத்தப்பட்டனர். எனவே, அல்லாஹ்வை அன்றி தங்களுக்கு உதவி செய்வோரை அவர்கள் காணவில்லை.",
            "verse 71:26": "அப்பால் நூஹ் கூறினார்: \"என் இறைவா! பூமியின் மீது இக்காஃபிர்களில் எவரையும் நீ வசித்திருக்க விட்டு விடாதே.",
            "verse 71:27": "\"நிச்சயமாக நீ அவர்களை விட்டு வைப்பாயானால். உன் அடியார்களை அவர்கள் வழி கெடுத்துவிடுவார்கள்; அன்றியும், பாவிகளையும், காஃபிர்களையும் அன்றி அவர்கள் பெற்றெடுக்கமாட்டார்கள்.",
            "verse 71:28": "\"என் இறைவா! எனக்கும், என் பெற்றோருக்கும், என் வீட்டில் நம்பிக்கையாளர்களாகப் பிரவேசித்தவர்களுக்கும், முஃமினான ஆண்களுக்கும், முஃமினான பெண்களுக்கும், நீ மன்னிப்பளிப்பாயாக! மேலும், அநியாயக்காரர்களுக்கு அழிவையேயல்லாது (வேறு எதையும்) நீ அதிகரிக்காதே\" (என்றும் கூறினார்)."
        },
        "Tatar": {
            "verse 71:1": "Тәхкыйк Без Нухны кавеменә пәйгамбәр итеп җибәрдек, кавемеңне куркыт Аллаһуның рәнҗеткүче каты ґәзабы килмәс борын, дип.",
            "verse 71:2": "Нух әйтте: \"Ий кавемем, тәхкыйк мин сезгә җибәрелгән Аллаһ ґәзабы илә ачык куркытучы пәйгамбәрмен.",
            "verse 71:3": "Аллаһуга гына гыйбадәт кылыгыз вә Аллаһудан куркыгыз, гөнаһлардан сакланыгыз һәм дә миңа итагать итегез, дип боерамын.",
            "verse 71:4": "Әгәр минем боерыкны кабул итеп тәүбә итсәгез, ислам динен кабул итеп мөселман булсагыз, Аллаһ гөнаһларыгызны ярлыкар һәм сезне яшәтер билгеләнгән әҗәлегезгә чаклы. Тәхкыйк Аллаһ билгеләгән әҗәл әгәр килсә һич кичектерелмәс. Әгәр шуны белсәгез!\"",
            "verse 71:5": "Нух әйтте: \"Ий Раббым, кавемемне ислам диненә кичләрдә дә вә көндезләрдә дә чакырдым.",
            "verse 71:6": "Минем чакыруым аларга арттырмады, мәгәр хактан, ислам диненнән качуны гына арттырды.",
            "verse 71:7": "Ий Раббым, һәркайчан мин аларны Синең ярлыкавыңа гафу итүеңә чакырсам, минем сүземне ишетмәс өчен бармакларын колакларына тыгалар һәм киемнәренә бөркәнделәр, вә, көферлектә дәвам иттеләр һәм каты тәкәбберләнү илә тәкәбберләнделәр.",
            "verse 71:8": "Моннан соң мин аларны бик каты кычкырып чакырдым.",
            "verse 71:9": "Соңра исламга чакыруымны ачык игълан кылдым, вә яшерен генә аулакта да өндәп карадым.",
            "verse 71:10": "Һәм әйттем аларга: \"Тәүбә итеп Раббыгыздан истигъфар кылыгыз, гафу сорагыз, шиксез, Ул гөнаһларны ярлыкаучы.",
            "verse 71:11": "Вә сезгә күктән яңгырны коеп яудырыр.",
            "verse 71:12": "Вә сезгә мал белән ярдәм итәр һәм балалар биреп куәтләр, дәхи җимеш үстерә торган бакчалар һәм елгалар бирер.\" Нух аларны күп еллар иманга өндәде, алар кабул итмәделәр. Шуннан соң Аллаһ аларга яңгырны туктатты, елгалары корыды вә хатыннары бала тудырмады.",
            "verse 71:13": "\"Ни булды сезгә, Аллаһуны олугъ дип белмисез вә Аның ґәзабыннан курыкмыйсыз.",
            "verse 71:14": "Тәхкыйк Ул сезне халык (бар) кылды бер хәлдән икенче хәлгә күчереп, ягъни башта бер тамчы су, аннары – оешкан кан, аннары – ит кисәге, аннары – кеше сыйфаты итеп.",
            "verse 71:15": "Әйә күрмисезме ничек халык кылган Аллаһ кат-кат итеп җиде күкне,",
            "verse 71:16": "вә ул күкләрдә айны якты итеп, вә кояшны яктылык һәм җылылык бирүче ут итеп.",
            "verse 71:17": "Аллаһ сезне җирдән үстерде, ягъни Адәм җирдән халык ителде.",
            "verse 71:18": "Соңра сезне шул җиргә кайтарыр, вә сезне тергезеп җирдән чыгарыр.",
            "verse 71:19": "Аллаһ сезнең өчен җирне палас кеби йомшак вә киң кылды.",
            "verse 71:20": "Ул җирнең олугъ вә киң юлларында көрмәклегегез өчен.\" Нух г-мнең бу сүзләрен дә кавеме инкяр иткәч, Аллаһуга ялварды һәм дога кылды.",
            "verse 71:21": "Нух әйтте: \"Ий Раббым тәхкыйк алар гасый вә дошман булдылар, һәм алар малы да вә балалары да ярдәм бирмәячәк, һич файданы арттырмаячак залим кешегә, ягъни үзләренең кәфер хуҗаларына иярделәр, ул залимнең малы вә балалары хәсрәтне вә ґәзабны гына арттырыр.",
            "verse 71:22": "Вә хәйлә мәкер кылдылар олугъ булган мәкерне.",
            "verse 71:23": "Вә олугълары әйттеләр: \"Әлбәттә, сынымнарыгызга гыйбадәт кылуны ташламагыз, әлбәттә Вәд, Сүвагъ, Йәгус, Йәгук, Нәсер исемле сынымнарыгызны ташламагыз\", – дип. \"Бу исемнәр Адәм илә Нух арасында булган яхшы кешеләрнең исемнәредер. Боларның балалары истәлек булсын дип аталарының һәйкәлен ясаганнар, бара-бара аларны зурлауда ифрат китеп гыйбадәт тә кыла башлаганнар\".",
            "verse 71:24": "Ий Раббым, тәхкыйк алар күпләрне хак юлдан адаштырдылар, бу залимнәргә арттырма һичнәрсәне, мәгәр адашуны гына арттыр\", – дип.",
            "verse 71:25": "Алар зур хаталары сәбәпле туфан суына батырылдылар вә утка кертелделәр, алар Аллаһ ґәзабыннан котылырга үзләренә ярдәмче тапмадылар.",
            "verse 71:26": "Нух әйтте: \"Ий Раббым, җир өстендә һич калдырма, кәферләрне һәммәсен һәлак ит!",
            "verse 71:27": "Әгәр Син аларны җир өстендә тере калдырсаң, алар Синең бәндәләреңне адаштырырлар һәм алар яхшы бала тудырмаслар, мәгәр явызны вә хаклы инкяр итүчене генә тудырырлар.",
            "verse 71:28": "Ий Раббым, мине ярлыкагыл вә мөэмин булган ата-анамны ярлыкагыл һәм минем өемә яки көймәмә мөэмин булып кергән кешене ярлыка һәм дә барча мөэмин ирләрне вә мөэминә хатыннарны ярлыка! Залим кәферләргә арттырма һичнәрсәне, мәгәр һәлак булуларын гына арттыр!\""
        },
        "Telugu": {
            "verse 71:1": "నిశ్చయంగా, మేము నూహ్ ను అతని జాతి వారి వద్దకు: వారిపై బాధాకరమైన శిక్ష రాకముందే వారిని హెచ్చరించు!\" అని (ఆజ్ఞాపించి) పంపాము",
            "verse 71:2": "అతను వారితో ఇలా అన్నాడు: ఓ నా జాతి ప్రజలారా! నిశ్చయంగా, నేను మీకు స్పష్టంగా హెచ్చరిక చేయటానికి వచ్చిన వాడిని",
            "verse 71:3": "కావున మీరు అల్లాహ్ నే ఆరాధించండి మరియు ఆయన యందు భయభక్తులు కలిగి ఉండండి మరియు నన్ను అనుసరించండి",
            "verse 71:4": "అలా చేస్తే ఆయన మీ పాపాలను క్షమిస్తాడు. మరియు ఒక నియమిత కాలం వరకు మిమ్మల్ని వదలి పెడ్తాడు. నిశ్చయంగా, అల్లాహ్ నిర్ణయించిన కాలం వచ్చినపుడు, దానిని తప్పించడం సాధ్యం కాదు. ఇది మీరు తెలుసుకుంటే ఎంత బాగుండేది",
            "verse 71:5": "అతను ఇలా ప్రార్థించాడు: ఓ నా ప్రభూ! నిశ్చయంగా, నేను నా జాతివారిని రేయింబవళ్ళు పిలిచాను",
            "verse 71:6": "కాని, నా పిలుపు, వారి పలాయనాన్ని మాత్రమే హెచ్చించింది",
            "verse 71:7": "మరియు వాస్తవానికి, నేను వారిని, నీ క్షమాభిక్ష వైపునకు పిలిచినప్పుడల్లా, వారు తమ చెవులలో వ్రేళ్ళు దూర్చుకునేవారు మరియు తమ వస్త్రాలను తమపై కప్పుకునేవారు మరియు వారు మొండి వైఖరి అవలంబిస్తూ దురహంకారంలో మునిగి ఉండేవారు",
            "verse 71:8": "తరువాత వాస్తవానికి, నేను వారిని ఎలుగెత్తి పిలిచాను",
            "verse 71:9": "ఆ తరువాత వాస్తవంగా, నేను వారికి బహిరంగంగా చాటి చెప్పాను మరియు ఏకాంతంలో రహస్యంగా పిలిచాను",
            "verse 71:10": "ఇంకా వారితో ఇలా అన్నాను: `మీ ప్రభువును క్షమాపణకై వేడుకోండి, నిశ్చయంగా ఆయన ఎంతో క్షమాశీలుడు",
            "verse 71:11": "ఆయన మీపై ఆకాశం నుండి ధారాళంగా వర్షాన్ని కురిపింపజేస్తాడు",
            "verse 71:12": "మరియు మీకు ధన సంపదలలోను మరియు సంతానంలోను వృద్ధి నొసంగుతాడు మరియు మీ కొరకు తోటలను ఉత్పత్తి చేస్తాడు. మరియు నదులను ప్రవహింపజేస్తాడు",
            "verse 71:13": "మీకేమయింది? మీరు అల్లాహ్ మహత్త్వమును ఎందుకు ఆదరించరు",
            "verse 71:14": "మరియు వాస్తవానికి ఆయనే మిమ్మల్ని విభిన్న దశలలో సృష్టించాడు",
            "verse 71:15": "ఏమీ? మీరు చూడటం లేదా? అల్లాహ్ ఏడు ఆకాశాలను ఏ విధంగా అంతస్తులలో సృష్టించాడో",
            "verse 71:16": "మరియు వాటి మధ్య చంద్రుణ్ణి (ప్రతిబింబించే) కాంతిగాను మరియు సూర్యుణ్ణి (వెలిగే) దీపం గాను చేశాడు",
            "verse 71:17": "మరియు అల్లాహ్ యే మిమ్మల్ని భూమి (మట్టి) నుండి ఉత్పత్తి చేశాడు",
            "verse 71:18": "తరువాత ఆయన మిమ్మల్ని అందులోకే తీసుకొని పోతాడు మరియు మిమ్మల్ని దాని నుండి (బ్రతికించి) బయటికి తీస్తాడు",
            "verse 71:19": "మరియు అల్లాహ్ యే మీ కొరకు భూమిని విస్తరింపజేశాడు",
            "verse 71:20": "మీరు దానిపై నున్న విశాలమైన మార్గాలలో నడవటానికి",
            "verse 71:21": "నూహ్ ఇంకా ఇలా విన్నవించుకున్నాడు: ఓ నా ప్రభూ! వాస్తవానికి వారు నా మాటను ధిక్కరించారు. మరియు వాడిని అనుసరించారు, ఎవడి సంపద మరియు సంతానం వారికి కేవలం నష్టం తప్ప మరేమీ అధికం చేయదో",
            "verse 71:22": "మరియు వారు పెద్ద కుట్ర పన్నారు",
            "verse 71:23": "మరియు వారు ఒకరితోనొకరు ఇలా అనుకున్నారు: `మీరు మీ ఆరాధ్యదైవాలను విడిచి పెట్టకండి. వద్ద్ మరియు సువాఅ; యగూస్, యఊఖ్ మరియు నస్ర్ లను విడిచిపెట్టకండి",
            "verse 71:24": "మరియు వాస్తవానికి, వారు చాలా మందిని తప్పు దారిలో పడవేశారు. కావున (ఓ నా ప్రభూ!) : నీవు కూడా ఈ దుర్మార్గులకు కేవలం వారి మార్గభ్రష్టత్వాన్నే హెచ్చించు",
            "verse 71:25": "వారు తమ పాపాల కారణంగా ముంచి వేయబడ్డారు మరియు నరకాగ్నిలోకి త్రోయబడ్డారు, కావున వారు అల్లాహ్ తప్ప తమను కాపాడే వారినెవ్వరినీ పొందలేక పోయారు",
            "verse 71:26": "మరియు నూహ్ ఇలా ప్రార్థించాడు: ఓ నా ప్రభూ! సత్యతిరస్కారులలో ఒక్కరిని కూడా భూమి మీద వదలకు",
            "verse 71:27": "ఒకవేళ నీవు వారిని వదలి పెడితే, నిశ్చయంగా వారు నీ దాసులను మార్గభ్రష్టత్వంలో పడవేస్తారు. మరియు వారు పాపులను మరియు కృతఘ్నులను మాత్రమే పుట్టిస్తారు",
            "verse 71:28": "ఓ మా ప్రభూ! నన్ను, నా తల్లిదండ్రులను మరియు విశ్వాసిగా నా ఇంటిలోనికి ప్రవేశించిన వానిని మరియు విశ్వాసులైన పురుషులను మరియు విశ్వాసులైన స్త్రీలను, అందరినీ క్షమించు. మరియు దుర్మార్గులకు వినాశం తప్ప మరేమీ అధికం చేయకు"
        },
        "Thai": {
            "verse 71:1": "แท้จริงเราได้ส่งนูหฺไปยังหมู่ชนของเขา (โดยบัญชาว่า) เจ้าจงกล่าวตักเตือนหมู่ชนของเจ้า ก่อนที่การลงโทษอันเจ็บปวดจะมาถึงพวกเขา",
            "verse 71:2": "เขากล่าวว่า โอ้หมู่ชนของฉันเอ๋ย! แท้จริงฉันคือผู้ตักเตือนอันชัดแจ้งของพวกท่าน",
            "verse 71:3": "พวกท่านจงเคารพภักดีอัลลอฮฺเถิด และจงยำเกรงพระองค์ และจงเชื่อฟังปฏิบัติตามฉัน",
            "verse 71:4": "พระองค์จะทรงอภัยโทษให้แก่พวกท่านในความผิดของพวกท่าน และจะทรงผ่อนผัน พวกท่านจนกระทั่งถึงวาระที่ถูกกำหนดไว้ แท้จริงวาระของอัลลอฮฺนั้น เมื่อมาถึงแล้วมันจะไม่ยืดเวลาต่อไปอีก หากพวกท่านได้รู้",
            "verse 71:5": "เขากล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ แท้จริงข้าพระองค์ได้เรียกร้องเชิญชวนหมู่ชนของข้าพระองค์ทั้งกลางคืนและกลางวัน",
            "verse 71:6": "แต่การเรียกร้องเชิญชวนของข้าพระองค์มิได้เพิ่มพูนสิ่งใดแก่เขานอกจากการหลบหนี",
            "verse 71:7": "และแท้จริงทุกครั้งที่ข้าพระองค์เรียกร้องเชิญชวนพวกเขาเพื่อที่พระองค์ท่านจะได้อภัยโทษให้แก่พวกเขา พวกเขาก็เอานิ้วมืออุดรูหูของพวกเขา และเอาเสื้อผ้าของพวกเขาคลุมโปง และพวกเขายังดื้อรั้น และหยิ่งยะโสด้วยความจองหอง",
            "verse 71:8": "ครั้นแล้วข้าพระองค์ได้เรียกร้องเชิญชวนพวกเขาอย่างเปิดเผย",
            "verse 71:9": "แล้วข้าพระองค์ก็ได้ประกาศแก่พวกเขาอย่างเปิดเผยอีกทั้งข้าพระองค์ยังได้บอกกล่าวแก่พวกเขาอย่างลับ ๆ อีกด้วย",
            "verse 71:10": "ข้าพระองค์ได้กล่าวว่า พวกท่านจงขออภัยโทษต่อพระเจ้าของพวกท่านเถิด เพราะแท้จริงพระองค์เป็นผู้ทรงอภัยโทษอย่างแท้จริง",
            "verse 71:11": "พระองค์จะทรงหลั่งน้ำฝนอย่างมากมายแก่พวกท่าน",
            "verse 71:12": "และพระองค์จะทรงเพิ่มพูนทรัพย์สินและลูกหลานแก่พวกท่าน และจะทรงทำให้มีสวนมากหลายแก่พวกท่าน และจะทรงทำให้มีลำน้ำมากหลายแก่พวกท่าน",
            "verse 71:13": "ทำไมพวกท่านจึงไม่สำนึกถึงความยิ่งใหญ่ของอัลลอฮฺ",
            "verse 71:14": "และโดยแน่นอน พระองค์ทรงสร้างพวกท่านตามลำดับขั้นตอน",
            "verse 71:15": "พวกเจ้าไม่เห็นดอกหรือว่าอัลลอฮฺทรงสร้างชั้นฟ้าทั้งเจ็ดเป็นชั้น ๆ อย่างไร ?",
            "verse 71:16": "และทรงทำให้ดวงจันทร์ในชั้นฟ้าเหล่านั้นมีแสงสว่าง และทรงทำให้ดวงอาทิตย์มีแสงจ้า",
            "verse 71:17": "และอัลลอฮฺทรงบังเกิดพวกท่านจากแผ่นดินเช่นพืชผัก",
            "verse 71:18": "แล้วจะทรงให้พวกท่านกลับคืนสู่ในแผ่นดิน และจะทรงให้พวกท่านออกมาอีกเพื่อคืนชีพ",
            "verse 71:19": "และอัลลอฮฺทรงทำให้แผ่นดินนี้ราบเรียบกว้างใหญ่สำหรับพวกท่าน",
            "verse 71:20": "เพื่อพวกท่านจะได้สัญจรไปมาตามพื้นที่โล่งกว้างนั้น",
            "verse 71:21": "นูหฺได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ แท้จริงพวกเขาได้ฝ่าฝืนข้าพระองค์และเชื่อฟังผู้ที่ทรัพย์สินของเขา และลูกหลานของเขามิได้เพิ่มพูนอันใดแก่เขานอกจากการขาดทุน",
            "verse 71:22": "และพวกเขาได้วางแผนร้ายอันยิ่งใหญ่",
            "verse 71:23": "และพวกเขาได้กล่าวว่า พวกท่านอย่าได้ทอดทิ้งพระเจ้าทั้งหลายของพวกท่านเป็นอันขาด พวกท่านอย่าได้ทอดทิ้งวัดดฺ และสุวาอฺ และยะฆูษ และยะอู๊ก และนัซรฺ เป็นอันขาด",
            "verse 71:24": "และโดยแน่นอน พวกเขาได้ทำให้หมู่ชนจำนวนมากหลง ดังนั้นขอพระองค์ท่านอย่าได้เพิ่มอันใดแก่พวกอธรรมเหล่านั้น นอกจากกการหลงผิดเท่านั้น",
            "verse 71:25": "อันเนื่องมาจากความผิดมากหลายของพวกเขา พวกเขาจึงถูกจมน้ำตาย และจะถูกให้เข้าอยู่ในไฟนรก ดังนั้นพวกเขาจะไม่ได้พบผู้ช่วยเหลือสำหรับพวกเขาอื่นจากอัลลอฮฺ",
            "verse 71:26": "และนูหฺได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ ขอพระองค์ทรงอย่าปล่อยให้พวกปฏิเสธศรัทธาหลงเหลืออยู่ในแผ่นดินนี้เลย",
            "verse 71:27": "เพราะแท้จริง หากพระองค์ทรงปล่อยให้พวกเขาหลงเหลืออยู่ พวกเขาก็จะทำให้ปวงบ่าวของพระองค์หลงผิด และพวกเขานั้นนะให้กำเนิดแต่พวกเลวทราม พวกปฏิเสธศรัทธาเท่านั้น",
            "verse 71:28": "ข้าแต่พระเจ้าของข้าพระองค์ ขอพระองค์ทรงอภัยโทษให้แก่ข้าพระองค์ และพ่อแม่ของข้าพระองค์ และผู้ที่เข้ามาในบ้านของข้าพระองค์เป็นผู้ศรัทธา และบรรดาผู้ศรัทธาชาย และบรรดาผู้ศรัทธาหญิง และพระองค์ท่านอย่าได้เพิ่มอันใดแก่พวกอธรรมเหล่านั้น นอกจากความพินาศหายนะเท่านั้น"
        },
        "Turkish": {
            "verse 71:1": "\"Milletine can yakıcı bir azap gelmezden önce onları uyar\" diye Nuh'u milletine gönderdik.",
            "verse 71:2": "O da şöyle söyledi: \"Ey Milletim! Şüphesiz ben, size gönderilmiş apaçık bir uyarıcıyım.\"",
            "verse 71:3": "\"Allah'a kulluk edin; O'ndan sakının ve bana itaat edin ki Allah günahlarınızı size bağışlasın ve sizi belli bir süreye kadar ertelesin; doğrusu Allah'ın belirttiği süre gelince geri bırakılamaz; keşke bilseniz!\"",
            "verse 71:4": "\"Allah'a kulluk edin; O'ndan sakının ve bana itaat edin ki Allah günahlarınızı size bağışlasın ve sizi belli bir süreye kadar ertelesin; doğrusu Allah'ın belirttiği süre gelince geri bırakılamaz; keşke bilseniz!\"",
            "verse 71:5": "Nuh dedi ki: \"Rabbim! Doğrusu ben, milletimi gece gündüz çağırdım.\"",
            "verse 71:6": "\"Fakat benim çağırmam, sadece benden uzaklıklarını artırdı.\"",
            "verse 71:7": "\"Doğrusu ben Senin onları bağışlaman için kendilerini her çağırışımda, parmaklarını kulaklarına tıkadılar, elbiselerine büründüler, direndiler, büyüklendikçe büyüklendiler.\"",
            "verse 71:8": "\"Sonra, doğrusu ben onları açıkça çağırdım.\"",
            "verse 71:9": "\"Sonra onlara açıktan açığa, gizliden gizliye de söyledim.\"",
            "verse 71:10": "Dedim ki: \"Rabbinizden bağışlanma dileyin; doğrusu O, çok bağışlayandır. Size gökten bol bol yağmur indirsin.\"",
            "verse 71:11": "Dedim ki: \"Rabbinizden bağışlanma dileyin; doğrusu O, çok bağışlayandır. Size gökten bol bol yağmur indirsin.\"",
            "verse 71:12": "\"Sizi, mallar ve oğullarla desteklesin; sizin için bahçeler var etsin, ırmaklar akıtsın.\"",
            "verse 71:13": "\"Ne oluyorsunuz ki Allah'a büyüklüğü yakıştıramıyorsunuz.\"",
            "verse 71:14": "\"Oysa sizi merhalelerden geçirerek O yaratmıştır.\"",
            "verse 71:15": "\"Allah'ın, göğü yedi kat üzerine nasıl yarattığını görmez misiniz?\"",
            "verse 71:16": "\"Aralarında aya aydınlık vermiş ve güneşin ışık saçmasını sağlamıştır.\"",
            "verse 71:17": "\"Allah sizi yerden bitirir gibi yetiştirmiştir.\"",
            "verse 71:18": "\"Sonra sizi oraya döndürür ve yine oradan çıkarır.\"",
            "verse 71:19": "\"Yeryüzünde dolaşabilmeniz, orada yollar ve geniş geçitlerden geçebilmeniz için, onu size yayan O'dur.\"",
            "verse 71:20": "\"Yeryüzünde dolaşabilmeniz, orada yollar ve geniş geçitlerden geçebilmeniz için, onu size yayan O'dur.\"",
            "verse 71:21": "Nuh: \"Rabbim! Doğrusu bunlar bana baş kaldırdılar ve malı, çocuğu kendisine sadece zarar getiren kimseye uydular; birbirinden büyük düzenler kurdular\" dedi.",
            "verse 71:22": "Nuh: \"Rabbim! Doğrusu bunlar bana baş kaldırdılar ve malı, çocuğu kendisine sadece zarar getiren kimseye uydular; birbirinden büyük düzenler kurdular\" dedi.",
            "verse 71:23": "İnsanlara: \"Sakın tanrılarınızı bırakmayın, Ved, Suva, Yağus, Yeuk ve Nesr putlarından asla vazgeçmeyin\" dediler.",
            "verse 71:24": "\"Böylece birçoğunu saptırdılar; Rabbim! Sen bu zalimlerin sadece şaşkınlığını artır.\"",
            "verse 71:25": "Onlar, günahları yüzünden suda boğuldular; ateşe sokuldular, kendilerine Allah'tan başka yardımcı bulamadılar.",
            "verse 71:26": "Nuh dedi ki: \"Rabbim! Yeryüzünde hiçbir inkarcı bırakma.\"",
            "verse 71:27": "\"Doğrusu Sen onları bırakırsan kullarını saptırırlar; sadece ahlaksız ve çok inkarcıdan başkasını doğurup yetiştirmezler.\"",
            "verse 71:28": "\"Rabbim! Beni, anamı, babamı, evime inanmış olarak gireni, inanan erkek ve kadınları bağışla; zalimlerin de yalnız helakını artır.\""
        },
        "Urdu": {
            "verse 71:1": "ہم نے نوحؑ کو ان کی قوم کی طرف بھیجا کہ پیشتر اس کے کہ ان پر درد دینے والا عذاب واقع ہو اپنی قوم کو ہدایت کردو",
            "verse 71:2": "انہوں نے کہا کہ اے قوم! میں تم کو کھلے طور پر نصیحت کرتا ہوں",
            "verse 71:3": "کہ خدا کی عبات کرو اور اس سے ڈرو اور میرا کہا مانو",
            "verse 71:4": "وہ تمہارے گناہ بخش دے گا اور (موت کے) وقت مقررہ تک تم کو مہلت عطا کرے گا۔ جب خدا کا مقرر کیا ہوگا وقت آجاتا ہے تو تاخیر نہیں ہوتی۔ کاش تم جانتے ہوتے",
            "verse 71:5": "جب لوگوں نے نہ مانا تو (نوحؑ نے) خدا سے عرض کی کہ پروردگار میں اپنی قوم کو رات دن بلاتا رہا",
            "verse 71:6": "لیکن میرے بلانے سے وہ اور زیادہ گزیر کرتے رہے",
            "verse 71:7": "جب جب میں نے ان کو بلایا کہ (توبہ کریں اور) تو ان کو معاف فرمائے تو انہوں نے اپنے کانوں میں انگلیاں دے لیں اور کپڑے اوڑھ لئے اور اڑ گئے اور اکڑ بیٹھے",
            "verse 71:8": "پھر میں ان کو کھلے طور پر بھی بلاتا رہا",
            "verse 71:9": "اور ظاہر اور پوشیدہ ہر طرح سمجھاتا رہا",
            "verse 71:10": "اور کہا کہ اپنے پروردگار سے معافی مانگو کہ وہ بڑا معاف کرنے والا ہے",
            "verse 71:11": "وہ تم پر آسمان سے لگاتار مینہ برسائے گا",
            "verse 71:12": "اور مال اور بیٹوں سے تمہاری مدد فرمائے گا اور تمہیں باغ عطا کرے گا اور ان میں تمہارے لئے نہریں بہا دے گا",
            "verse 71:13": "تم کو کیا ہوا ہے کہ تم خدا کی عظمت کا اعتقاد نہیں رکھتے",
            "verse 71:14": "حالانکہ اس نے تم کو طرح طرح (کی حالتوں) کا پیدا کیا ہے",
            "verse 71:15": "کیا تم نے نہیں دیکھا کہ خدا نے سات آسمان کیسے اوپر تلے بنائے ہیں",
            "verse 71:16": "اور چاند کو ان میں (زمین کا) نور بنایا ہے اور سورج کو چراغ ٹھہرایا ہے",
            "verse 71:17": "اور خدا ہی نے تم کو زمین سے پیدا کیا ہے",
            "verse 71:18": "پھر اسی میں تمہیں لوٹا دے گا اور (اسی سے) تم کو نکال کھڑا کرے گا",
            "verse 71:19": "اور خدا ہی نے زمین کو تمہارے لئے فرش بنایا",
            "verse 71:20": "تاکہ اس کے بڑے بڑے کشادہ رستوں میں چلو پھرو",
            "verse 71:21": "(اس کے بعد) نوح نے عرض کی کہ میرے پروردگار! یہ لوگ میرے کہنے پر نہیں چلے اور ایسوں کے تابع ہوئے جن کو ان کے مال اور اولاد نے نقصان کے سوا کچھ فائدہ نہیں دیا",
            "verse 71:22": "اور وہ بڑی بڑی چالیں چلے",
            "verse 71:23": "اور کہنے لگے کہ اپنے معبودوں کو ہرگز نہ چھوڑنا اور ود اور سواع اور یغوث اور یعقوب اور نسر کو کبھی ترک نہ کرنا",
            "verse 71:24": "(پروردگار) انہوں نے بہت لوگوں کو گمراہ کردیا ہے۔ تو تُو ان کو اور گمراہ کردے",
            "verse 71:25": "(آخر) وہ اپنے گناہوں کے سبب پہلے غرقاب کردیئے گئے پھر آگ میں ڈال دیئے گئے۔ تو انہوں نے خدا کے سوا کسی کو اپنا مددگار نہ پایا",
            "verse 71:26": "اور (پھر) نوحؑ نے (یہ) دعا کی کہ میرے پروردگار اگر کسی کافر کو روئے زمین پر بسا نہ رہنے دے",
            "verse 71:27": "اگر تم ان کو رہنے دے گا تو تیرے بندوں کو گمراہ کریں گے اور ان سے جو اولاد ہوگی وہ بھی بدکار اور ناشکر گزار ہوگی",
            "verse 71:28": "اے میرے پروردگار مجھ کو اور میرے ماں باپ کو اور جو ایمان لا کر میرے گھر میں آئے اس کو اور تمام ایمان والے مردوں اور ایمان والی عورتوں کو معاف فرما اور ظالم لوگوں کے لئے اور زیادہ تباہی بڑھا"
        },
        "Uyghur": {
            "verse 71:1": "بىز ھەقىقەتەن نۇھنى قەۋمىگە: «قەۋمىڭگە قاتتىق ئازاب (يەنى دۇنيادىكى چاغلىرىدا توپان بالاسى، ئاخىرەتتە دوزاخ ئازابى) كېلىشتىن بۇرۇن ئۇلارنى ئاگاھلاندۇرغىن» دەپ ئەۋەتتۇق",
            "verse 71:2": "نۇھ ئېيتتى: «ئى قەۋمىم! مەن ھەقىقەتەن كىشىلەرگە (ئەۋەتىلگەن) ئاشكارا ئاگاھلاندۇرغۇچىمەن",
            "verse 71:3": "اﷲ قا ئىبادەت قىلىڭلار، ئۇنىڭدىن قورقۇڭلار ۋە اﷲ قا ئىتائەت قىلىڭلار",
            "verse 71:4": "ئۇ بەزى گۇناھىڭلارنى مەغپىرەت قىلىدۇ، سىلەرنى مۇئەييەن مۇددەتكىچە كېچىكتۈرىدۇ (يەنى ئۆمرۈڭلارنى ئۇزۇن قىلىدۇ)، شۈبھىسىزكى، ئەگەر بىلسەڭلار، اﷲ نىڭ (ئىنسانغا بېكىتكەن) ئەجىلى كەلگەن چاغدا (ئەجەل) كېچىكتۈرۈلمەيدۇ",
            "verse 71:5": "نۇھ ئېيتتى: «پەرۋەردىگارىم! مەن ھەقىقەتەن قەۋمىمنى كېچە - كۈندۈز (ئىمانغا) دەۋەت قىلدىم",
            "verse 71:6": "مېنىڭ دەۋىتىم ئۇلارنى تېخىمۇ قاچۇرۇۋەتتى",
            "verse 71:7": "مەن ئۇلارنى سېنىڭ مەغپىرىتىڭگە ئېرىشسۇن دەپ، ھەر قاچان دەۋەت قىلسام، (دەۋىتىمنى ئاڭلىماسلىق ئۈچۈن) بارماقلىرىنى قۇلاقلىرىغا تىقىۋالدى، (سۆزۈمنى ئاڭلىماسلىق ياكى مېنى كۆرمەسلىك ئۈچۈن) كىيىملىرى بىلەن باشلىرىنى چۈمكىۋالدى، (كۇفرىدا) چىڭ تۇردى، چوڭچىلىق قىلىپ (ئىماندىن) تېخىمۇ باش تارتتى",
            "verse 71:8": "ئاندىن مەن ئۇلارنى توۋلاپ دەۋەت قىلدىم",
            "verse 71:9": "ئاندىن ئۇلارنى ئاشكارا دەۋەت قىلدىم ۋە يوشۇرۇن دەۋەت قىلدىم",
            "verse 71:10": "(ئۇلارغا) ئېيتتىم: پەرۋەردىگارىڭلاردىن مەغپىرەت تىلەڭلار، ئۇ ھەقىقەتەن مەغپىرەت قىلغۇچىدۇر",
            "verse 71:11": "ئۇ سىلەرگە مول يامغۇر ياغدۇرۇپ بېرىدۇ،",
            "verse 71:12": "سىلەرنىڭ ماللىرىڭلارنى ۋە ئوغۇللىرىڭلارنى كۆپەيتىپ بىرىدۇ، سىلەرگە باغلارنى، ئۆستەڭلارنى ئاتا قىلىدۇ،",
            "verse 71:13": "نېمە ئۈچۈن سىلەر اﷲ نىڭ بۈيۈكلۈكىدىن قورقمايسىلەر؟",
            "verse 71:14": "ھالبۇكى اﷲ سىلەرنى بىر قانچە باسقۇچلارغا بۆلۈپ ياراتتى،",
            "verse 71:15": "سىلەر كۆرمىدىڭلارمىكىن، اﷲ قانداق قىلىپ يەتتە ئاسماننى بىرىنىڭ ئۈستىدە بىرىنى قىلىپ ياراتتى،",
            "verse 71:16": "ئاينى ئۇلاردا (يەنى دۇنيانىڭ ئاسمىنىدا) نۇر قىلدى، كۈننى (نۇر چاچقۇچى) چىراغ قىلدى",
            "verse 71:17": "اﷲ سىلەرنى زېمىندىن ياراتتى (چۈنكى ئاتاڭلار ئادەمنى تۇپراقتىن ياراتقان ئىدى)",
            "verse 71:18": "ئاندىن اﷲ سىلەرنى (ئۆلگەندىن كېيىن) زېمىنغا قايتۇرىدۇ (يەنى زېمىندا دەپنە قىلىنىسىلەر)، ئاندىن سىلەرنى (قىيامەت كۈنى) زېمىندىن چىقىرىدۇ",
            "verse 71:19": "زېمىندا كەڭ يوللاردا مېڭىشىڭلار ئۈچۈن، اﷲ سىلەرگە زېمىننى بىسات قىلىپ بەردى»",
            "verse 71:20": "زېمىندا كەڭ يوللاردا مېڭىشىڭلار ئۈچۈن، اﷲ سىلەرگە زېمىننى بىسات قىلىپ بەردى»",
            "verse 71:21": "نۇھ ئېيتتى: «پەرۋەردىگارىم! ئۇلار ھەقىقەتەن ماڭا ئاسىيلىق قىلدى، مېلىغا، بالىسىغا ۋە ئۆزلىرىگە زىياندىن باشقىنى زىيادە قىلمىغان كىشىلەرگە (يەنى بايلىرىغا، كاتتىباشلىرىغا) ئەگەشتى",
            "verse 71:22": "ئۇلار (يەنى كاتتىباشلار) (ماڭا چىنپۈتمىدى، ماڭا ۋە ماڭا ئەگەشكەنلەرگە ئەزىيەت يەتكۈزۈپ) چوڭ ھىيلە تۈزدى",
            "verse 71:23": "ئۇلار: ‹مەبۇدلىرىڭلارنى ھەرگىز تەرك ئەتمەڭلار، ۋەدنى، سۇۋائنى، يەغۇسنى، يەئۇقنى ۋە نەسرىنى ھەرگىز تەرك ئەتمەڭلار› دېدى",
            "verse 71:24": "ئۇلار ھەقىقەتەن نۇرغۇن كىشىلەرنى ئازدۇردى، زالىملارنى تېخىمۇ گۇمراھ قىلغىن»",
            "verse 71:25": "ئۇلار گۇناھلىرى تۈپەيلىدىن (توپان بىلەن) غەرق قىلىندى، دوزاخقا كىرگۈزۈلدى، ئۇلار ئۆزلىرى ئۈچۈن اﷲ تىن باشقا ھېچقانداق ياردەمچى تاپالمىدى",
            "verse 71:26": "نۇھ ئېيتتى: «پەرۋەردىگارىم يەر يۈزىدە كاپىرلارنىڭ بىرىنىمۇ قويمىغىن",
            "verse 71:27": "ئەگەر ئۇلارنى قويساڭ، شۈبھىسىزكى، بەندىلىرىڭنى ئازدۇرىدۇ، ئۇلارنىڭ تاپقان بالىلىرىمۇ پەقەت فاجىر، كاپىر بولىدۇ",
            "verse 71:28": "پەرۋەردىگارىم! ماڭا، ئاتا - ئانامغا، مېنىڭ ئۆيۈمگە مۆمىن بولۇپ كىرگەن كىشىگە ۋە مۆمىن ئەرلەرگە، مۆمىن ئاياللارغا مەغپىرەت قىلغىن، زالىملارغا پەقەت ھالاكەتنى زىيادە قىلغىن»"
        },
        "Uzbek": {
            "verse 71:1": "Биз Нуҳни ўз қавмига, қавмингни уларга аламли азоб келишидан аввал огоҳлантиргин деб, Пайғамбар қилиб юбордик.",
            "verse 71:2": "У: «Эй қавмим, албатта мен сиз учун очиқ-ойдин огоҳлантирувчиман.",
            "verse 71:3": "Аллоҳга ибодат қилинглар, Унга тақво қилинглар ва менга итоат қилинглар.",
            "verse 71:4": "У сизларнинг гуноҳларингиздан мағфират қиладир ва сизни белгиланган ажалгача қўйиб қўядир. Агар билсангиз, албатта, Аллоҳнинг ажали орқага сурилмайдир», деди.",
            "verse 71:5": "У: «Роббим, мен ўз қавмимни кечаю кундуз даъват қилдим.",
            "verse 71:6": "Менинг чақириғим уларда қочишдан бошқа нарсани зиёда қилмади.",
            "verse 71:7": "Ва алабатта қачонки мен уларни сенинг мағфират қилишинг учун чақирсам, улар бармоқларини қулоқларига тиқдилар ва кийимларига бурканиб олдилар ва (кофирликда) собит бўлдилар ва ниҳоятда улкан такаббурлик қилдилар.",
            "verse 71:8": "Сўнгра, албатта мен уларни очиқ даъват қилдим.",
            "verse 71:9": "Сўнгра, албатта мен уларга эълон ва сиррий (даъват) қилдим.",
            "verse 71:10": "Бас, ўз Роббингизга истиғфор айтинг, албатта у гуноҳларни кўплаб мағфират қилувчидир, дедим.",
            "verse 71:11": "У зот осмондан устингизга кетма-кет (барака ёмғирини) юборадир.",
            "verse 71:12": "Ва сизга молу мулк ва бола-чақа ила мадад берадир ва сизларга боғу роғлар ҳамда анқорларни берадир.",
            "verse 71:13": "Сизларга нима бўлдики, Аллоҳнинг азаматини ўйлаб кўрмайсизлар?",
            "verse 71:14": "Ҳолбуки, у сизларни ҳолатма-ҳолат яратди.",
            "verse 71:15": "Аллоҳ еттти осмонни қандоқ қилиб табақама-табақа яратиб қўйганини кўрмадингизми?",
            "verse 71:16": "Ва улар ичида ойни нур ва қуёшни чироқ қилиб қўйганини кўрмадингизми?",
            "verse 71:17": "Ва Аллоҳ сизларни ердан ўстириб чиқарадир.",
            "verse 71:18": "Сўнгра сизларни унга қайтариб, яна чиқарадир.",
            "verse 71:19": "Ва Аллоҳ сизларга ерни гиламдек тўшаб қўйди.",
            "verse 71:20": "Унда сиз кенг йўллардан юришингиз учун», деб айтдим.",
            "verse 71:21": "Нуҳ: «Эй Роббим, албатта улар менга исён қилдилар ва моли, бола-чақаси хусрондан бошқани зиёда қилмаганга эргашдилар.",
            "verse 71:22": "Ва ниҳоятда улкан макр қилдилар.",
            "verse 71:23": "Ва улар: «Олиҳаларингизни ҳеч тарк қилманглар ва албатта Ваддни ҳам, Суваъни ҳам, Яғусни ҳам, Яъуқни ҳам ва Насрни ҳам тарк қилманг», дедилар.",
            "verse 71:24": "Дарҳақиқат улар кўпларини адаштирдилар ва сен золимларга залолатдан бошқани зиёда қилма», деди.",
            "verse 71:25": "Улар хатолари туфайли ғарқ қилиндилар, бас, дўзахга киритилдилар. Бас, ўзларига Аллоҳдан ўзга ёрдамчи топа олмадилар.",
            "verse 71:26": "Ва Нуҳ: «Эй Роббим, ер юзида кофирлардан бирорта ҳам ҳаракатланувчини қўймагин.",
            "verse 71:27": "Албатта сен уларни тек қўйсанг, бандаларингни адаштирурлар ва фожиру кофирдан бошқа туғмаслар.",
            "verse 71:28": "Роббим, мени мағфират қилгин, менинг ота-онамни ҳам ва уйимга мўмин бўлиб кирганларни ва мўминлару мўминаларни ҳам. Ва золимларга ҳалокатдан ўзга нарсани зиёда қилмагин», деди."
        },
        "Vietnamese": {
            "verse 71:1": "Quả thật, TA (Allah) đã cử Nuh đến với người dân của Y (với mệnh lệnh): “Ngươi hãy cảnh báo người dân của Ngươi trước khi chúng phải chịu một hình phạt đau đớn.”",
            "verse 71:2": "(Nuh) nói với dân của mình: “Này hỡi dân ta, quả thật ta chính là một người cảnh báo rõ ràng được cử đến với các ngươi.”",
            "verse 71:3": "“Các ngươi hãy thờ phượng Allah, hãy kính sợ Ngài và hãy vâng lời ta.”",
            "verse 71:4": "“Ngài sẽ tha thứ tội lỗi cho các ngươi và để các ngươi sống đến một thời hạn ấn định. Quả thật, khi thời hạn mà Allah ấn định đã hết thì sẽ không được trì hoãn, nếu các ngươi biết.”",
            "verse 71:5": "(Nuh) nói: “Lạy Thượng Đế của bề tôi! Bề tôi thực sự đã kêu gọi người dân của bề tôi cả ngày lẫn đêm.”",
            "verse 71:6": "“Nhưng lời kêu gọi của bề tôi đã không làm tăng thêm được gì cho họ mà chỉ làm cho họ chạy xa hơn.”",
            "verse 71:7": "“Và quả thật, mỗi khi bề tôi kêu gọi họ để Ngài tha thứ cho họ, họ đều lấy ngón tay bịt lỗ tai, lấy áo trùm đầu; họ cứ ngoan cố và quá ư kiêu ngạo.”",
            "verse 71:8": "“Rồi (có lúc) bề tôi đã kêu gọi họ một cách lớn tiếng.”",
            "verse 71:9": "“Rồi (có lúc) bề tôi đã thuyết giảng cho họ trước công chúng, (có lúc) bề tôi đã nói chuyện với họ một cách riêng tư.”",
            "verse 71:10": "“Bề tôi đã nói với họ: “Các ngươi hãy cầu xin Thượng Đế của các ngươi tha thứ tội lỗi cho các ngươi. Quả thật, Ngài là Đấng Tha Thứ.”",
            "verse 71:11": "“Ngài sẽ ban mưa dồi dào từ trên trời xuống cho các ngươi.”",
            "verse 71:12": "“Và Ngài sẽ gia tăng của cải và con cái cho các ngươi, và Ngài sẽ ban cho các ngươi vườn tược và ban cho các ngươi sông ngòi.”",
            "verse 71:13": "Có chuyện gì với các ngươi, sao các ngươi không sợ Quyền Uy và sự Vĩ Đại của Allah?",
            "verse 71:14": "Quả thật, Ngài đã tạo hóa các ngươi theo từng giai đoạn.",
            "verse 71:15": "Lẽ nào các ngươi không thấy Allah đã tạo bảy tầng trời, tầng này bên trên tầng kia, như thế nào ư?",
            "verse 71:16": "(Ở tầng trời hạ giới), Ngài đã tạo mặt trăng như một ánh sáng (phản chiếu) và mặt trời như một chiếc đèn (chiếu sáng).",
            "verse 71:17": "Allah đã tạo các ngươi và cho các ngươi phát triển từ đất.",
            "verse 71:18": "Rồi đây, Ngài sẽ cho các ngươi trở lại vào đất (sau khi các ngươi chết) và (sau đó) Ngài sẽ đưa các ngươi trở ra (lúc phục sinh).",
            "verse 71:19": "Và Allah đã tạo ra trái đất cho các ngươi như một tấm thảm rộng lớn.",
            "verse 71:20": "Để các ngươi có thể đi lại trên những con đường rộng rãi của nó (để các ngươi tìm kiếm bổng lộc Halal).",
            "verse 71:21": "Nuh nói: “Lạy Thượng Đế của bề tôi! Quả thật, họ đã không vâng lời bề tôi. Họ đi theo kẻ mà của cải và con cái của y chẳng tăng thêm được gì cho y ngoại trừ sự thua thiệt.”",
            "verse 71:22": "“Và họ đã mưu định một âm mưu to lớn.”",
            "verse 71:23": "“Họ nói (với nhau): “Các người đừng từ bỏ các thần linh của các người. Các người đừng từ bỏ thần Wadd, thần Suwa’, thần Yaghuth, thần Ya’uq và thần Nasr.”",
            "verse 71:24": "“Quả thật, (các thần linh bục tượng đó của họ), chúng đã dắt nhiều người đi lạc. (Lạy Thượng Đế của bề tôi) xin Ngài đừng tăng thêm gì cho những kẻ sai quấy ngoại trừ sự lầm lạc.”",
            "verse 71:25": "Vì tội lỗi của chúng nên chúng bị nhấn chìm (trong trận đại hồng thủy), sau đó chúng bị đưa vào Hỏa Ngục. Cho nên, ngoài Allah, chúng không tìm thấy cho mình bất kỳ người giúp đỡ nào.",
            "verse 71:26": "Và Nuh nói: “Lạy Thượng Đế của bề tôi! Xin Ngài đừng chừa một tên vô đức tin nào sống sót trên trái đất.”",
            "verse 71:27": "“Thật vậy, nếu Ngài để chúng sống, chúng sẽ dắt bầy tôi của Ngài lầm lạc và chúng sẽ sinh con đẻ cháu toàn là những kẻ tội lỗi, vô đức tin.”",
            "verse 71:28": "“Lạy Thượng Đế của bề tôi! Xin Ngài tha thứ cho bề tôi và cho cha mẹ của bề tôi và cho ai vào nhà của bề tôi là một người có đức tin, xin Ngài tha thứ cho những người có đức tin nam cũng như nữ, và xin Ngài đừng tăng thêm gì cho những kẻ sai quấy ngoại trừ sự diệt vong!”"
        },
        "Yoruba": {
            "verse 71:1": "Dajudaju Awa ran (Anabi) Nuh nise si ijo re pe: \"Sekilo fun ijo re siwaju ki iya eleta-elero to de ba won",
            "verse 71:2": "O so pe: \"Eyin ijo mi, dajudaju emi ni olukilo ponnbele fun yin",
            "verse 71:3": "pe ki e josin fun Allahu, ki e beru Re, ki e si tele mi",
            "verse 71:4": "(Allahu) maa saforijin awon ese yin fun yin. O si maa lo yin lara titi di gbedeke akoko kan. Dajudaju akoko (iku ti) Allahu (ko mo eda), nigba ti o ba de, won ko nii sun un siwaju ti o ba je pe e mo",
            "verse 71:5": "O so pe: \"Oluwa mi, dajudaju emi pe ijo mi ni oru ati ni osan",
            "verse 71:6": "Ipe mi ko si se alekun kan fun won ayafi sisa seyin (fun ododo)",
            "verse 71:7": "Ati pe igbakigba ti mo ba pe won pe ki O le forijin won, won n fi omonika won di eti won, won n yiso won bori, won n taku (sori ese), won si n segberaga gan-an",
            "verse 71:8": "Leyin naa, dajudaju emi pe won pelu ohun oke",
            "verse 71:9": "Leyin naa, dajudaju emi kede fun won, mo si tun pe won ni ida konko",
            "verse 71:10": "Mo si so pe, e toro aforijin ni odo Oluwa yin, dajudaju O n je Alaforijin",
            "verse 71:11": "O maa rojo fun yin ni ojo pupo",
            "verse 71:12": "O maa fi awon dukia ati awon omokunrin ran yin lowo. O maa se awon ogba oko fun yin. O si maa se awon odo fun yin",
            "verse 71:13": "Ki lo mu yin ti e ko paya titobi Allahu",
            "verse 71:14": "O si kuku seda yin lati irisi kan si omiran (ninu oyun)",
            "verse 71:15": "Se e o ri bi Allahu se da awon sanmo meje ni ipele ipele ni",
            "verse 71:16": "O si se osupa ni imole sinu won. O tun se oorun ni atupa",
            "verse 71:17": "Allahu mu yin jade lati ara erupe ile",
            "verse 71:18": "Leyin naa, O maa da yin pada sinu re. O si maa mu yin jade taara",
            "verse 71:19": "Allahu se ile fun yin ni ite",
            "verse 71:20": "nitori ki e le to awon oju ona fife gbegede lori re",
            "verse 71:21": "(Anabi) Nuh so pe: \"Oluwa mi, dajudaju won yapa mi. Won si tele eni ti dukia re ati omo re ko se alekun kan fun bi ko se ofo",
            "verse 71:22": "Won si dete ni ete t’o tobi",
            "verse 71:23": "Won si wi pe: \"E ma se fi awon orisa yin sile. E ma se fi orisa Wadd, Suwa‘u, Yeguth, Ye‘uƙ ati Nasr sile",
            "verse 71:24": "Dajudaju won ti ko opolopo sina. (Oluwa mi) ma se je ki awon alabosi lekun ni kini kan bi ko se isina",
            "verse 71:25": "Nitori ese won, won te won ri sinu omi. Won si maa fi won sinu Ina. Won ko si nii ri awon alaranse fun won leyin Allahu",
            "verse 71:26": "(Anabi) Nuh tun so pe: \"Oluwa mi, ma se fi eni kan kan ninu awon alaigbagbo sile lori ile",
            "verse 71:27": "Dajudaju ti Iwo ba fi won sile, won yoo ko isina ba awon eru Re. Won ko si nii bi omo kan afi eni buruku, alaigbagbo",
            "verse 71:28": "Oluwa mi forijin emi, awon obi mi mejeeji ati eni t’o ba wo inu ile mi (ti o je) onigbagbo ododo ati awon onigbagbo ododo lokunrin ati onigbagbo ododo lobinrin. Ma si salekun kan fun awon alabosi afi iparun"
        }
    }
}