{
    "id": 71,
    "name_simple": "Nuh",
    "revelation_place": "makkah",
    "revelation_order": 71,
    "bismillah_pre": true,
    "verses_count": 28,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "'Nuh' is the name of this Surah as well as the title of its subject matter, for in it, from beginning to the end, the story of the Prophet Noah has been related.",
    "text": [
        "\n",
        "\"Nuh\" is the name of this Surah as well as the title of its subject matter, for in it, from beginning to the end, the story of the Prophet Noah has been related.",
        "\n",
        "Period of Revelation",
        "\n",
        "This also is one of the earliest Surahs to be revealed at Makkah, but the internal evidence of its subject matter shows that it was sent down in the period when opposition to the Holy Prophet's message of Islam by the disbelievers of Makkah had grown very strong and active.",
        "\n",
        "Theme and Subject",
        "\n",
        "In this surah the story of the Prophet Noah has not been related only for the sake of story telling, but its object is to warn the disbelievers of Makkah, so as to say:\"You, O people of Makkah, are adopting towards Muhammad (upon whom be Allah's peace and blessings) the same attitude as the people of the Prophet Noah had adopted towards him; if you do not change this attitude, you too would meet with the same end.\" This had not been said in so many words anywhere in the Surah, but in the background of the conditions under which this story was narrated to the people of Makkah, this subject itself became obvious.",
        "\n",
        "vv. 2-4 briefly explain how he began his mission and what he preached.",
        "\n",
        "Then after suffering hardships and troubles in the way of preaching his mission for ages the report that he made to his Lord has been given in vv. 5-20. In it he states how he had been trying to bring his people to the right path and how his people had stubbornly opposed him.",
        "\n",
        "After this, the Prophet Noah's final submission has been recorded in vv. 21-24, in which he prays to his Lord, saying: \"These people have rejected my invitation: they are blindly following their chiefs, who have devised a tremendous plot of deceit and cunning. Time now has come when these people should be deprived of every grace to accept guidance.\" This was not an expression of impatience by the Prophet Noah, but when after having preached his message under extremely trying circumstances for centuries be became utterly disappointed with his people, he formed the opinion that no chance whatever was left of their coming to the right path. His this opinion fully conformed to Allah's own decision. Thus, in the next verse (25), it has been said: \"The torment of Allah descended on those people because of their misdeeds.\"",
        "\n",
        "In the concluding verse, the Prophet Noah's supplication that he made to his Lord, right at the time the torment descended, has been recorded. In it he prays for his own and for all the believers' forgiveness, and makes a submission to Allah to the effect: \"Do not leave any of the disbelievers alive on the earth, for they have become utterly devoid of every good: they will not beget any but disbelieving and wicked descendants.\"",
        "\n",
        "While studying this Surah one should keep in view the details of the Prophet Noah's story which have been given in the Qur'an above. For this see Al-Araf: 59-64, Yunus: 71-73, Hud: 25-49, Al-Mu'minun: 23-31, Ash- Shua'ra: 105-122, Al-Ankabut: 14-15, As-Saaffat: 75-82, Al-Qamar: 9-16.",
        "\n"
    ],
    "description": "That surah that opens with the story of the ancient Prophet Noah, the unrelenting Messenger of Resolve, and his obstinately unbelieving people. It is named after Noah (Nūḥ) whose account is related in the surah and further gives details of the life of Noah before the Flood, to encourage the Prophet and warn the disbelievers.",
    "name_translation": "NOAH",
    "name_complex": "Nûh",
    "surah_name_ar": "نوح",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 71:1": "Ne e kemi dërguar Nuhun te populli i tij: “Paralajmëro popullin tënd para se t’i arrijë dënimi i dhembshëm!”",
                            "verse 71:2": "Ai tha: “O populli im, unë, me të vërtetë, jam për ju paralajmërues i qartë;",
                            "verse 71:3": "që t’i luteni Perëndisë dhe t’i ruheni (kundërshtimit) të Atij dhe që të më dëgjoni mua,",
                            "verse 71:4": "Ai ju falë mëkatet tuaja dhe do t’ju lërë të jetoni deri në çastin e caktuar, e kur t’ju vije çasti i caktuar i Perëndisë, me të vërtetë, ai nuk shtyhet; ta dini ju”.",
                            "verse 71:5": "Ai tha: “O Zoti im, unë, me te vërtetë, e thirra popullin tim natë e ditë,",
                            "verse 71:6": "por thirrja ime (nuk solli dobi, por) shkaktoi largim edhe më të madh.",
                            "verse 71:7": "E, sa herë që i thërrita (unë) ata (në punë të mbarë), për t’i falur Ti, ata i shtinin gishtërinjtë në veshët e tyre dhe mbuloheshin me petkat e tyre (për të mos më parë) – ishin këmbëngulës dhe shumë mendjemëdhenj.",
                            "verse 71:8": "Pastaj, i thirra haptazi (me zë edhe më të lartë),",
                            "verse 71:9": "e mandej ua shpalla publikisht atë, si dhe në besim u përshpërita (i thirra në të gjitha format).",
                            "verse 71:10": "Dhe ju thashë: Kërkoni falje nga Perëndia i jua, sepse, me të vërtetë, Ai është falës, i madh;",
                            "verse 71:11": "Ai do t’ju dërgojë juve shi të bollshëm,",
                            "verse 71:12": "dhe do t’ju ndihmojë me pasuri dhe me fëmijë, dhe për ju do të krijojë kopshtije dhe për ju do të krijojë lumenj.",
                            "verse 71:13": "Përse nuk i frikoheni madhërisë së Perëndisë,",
                            "verse 71:14": "e, Ai ju ka krijuar me forma (faza) të ndryshme?!",
                            "verse 71:15": "A nuk po shihni se si Perëndia i ka krijuar shtatë qiejt – palë-palë (kat-kat),",
                            "verse 71:16": "dhe në ta e ka bërë Hënën dritë, kurse Diellin e ka bërë fener (ndriçues)?",
                            "verse 71:17": "Perëndia ju ka krijuar nga toka (dheu), ashtu si bimët,",
                            "verse 71:18": "pastaj ju kthen te ajo dhe prej saj sërish do t’ju nxjerrë.",
                            "verse 71:19": "Perëndia për ju Tokën e ka bërë shtrojë,",
                            "verse 71:20": "që të ecni nëpër të, nëpër rrugët e gjera?”",
                            "verse 71:21": "Nuhu tha: “O Zoti im, ata më kundërshtuan mua dhe u dhanë pas atyre, pasuria dhe fëmijët e të cilëve nuk kanë sjellë gjë tjetër, pos shkatërrimt,",
                            "verse 71:22": "dhe trilluan trillime të mëdha (kundër Nuhut)",
                            "verse 71:23": "dhe kanë thënë (populli i Nuhut): Mos i lini kurrsesi zotrat tuaja, mos e lini kurrsesi as Veddin, as Suvain, as Jeguthin, as Jeukin, as Nesrin’!",
                            "verse 71:24": "E, këta idhujë kanë mashtruar shumë (njerëz); e ti (keqbërësve), mos u smadho asgjë, përpos humbjes!”",
                            "verse 71:25": "Për shkak të mëkateve të tyre, ata janë përmbytur, e janë hedhur në zjarr dhe ata nuk kanë gjetur mbrojtës tjetër për vete, përveç Perëndisë.",
                            "verse 71:26": "Dhe Nuhu tha: “O Zoti im, mos lë të qarkullojë në faqe të dheut asnjë mohues,",
                            "verse 71:27": "sepse, me të vërtetë, nëse Ti i lë, ata – do t’i shpien në humbje robërit e Tu dhe do tëlindin vetëm mëkatarë dhe jobesimtarë!",
                            "verse 71:28": "O Zoti im, falmë mua dhe prindërit e mi, dhe ata të cilët hynë në shtëpinë time si besimtarë, dhe besimtarët e besimtaret, ndërsa zullumqarëve shtoju vetëm shkatërrimin! jobesimtarë!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Həqiqətən, Biz Nuhu: \"Qövmünə şiddətli bir əzab gəlməmişdən əvəl onları (Allahın əzabı ilə) qorxut!\" - deyə öz tayfasına peyğəmbər göndərdik.",
                            "verse 71:2": "O dedi: \"Ey qövmüm! Həqiqətən, mən sizi (Allahın əzabı ilə) açıq-aşkar qorxudan bir peyğəmbərəm!",
                            "verse 71:3": "Allaha ibadət edin, Ondan qorxun və mənə də itaət edin!",
                            "verse 71:4": "(Əgər belə etsəniz) O sizin günahlarınızdan keçər, sizə müəyyən vaxtadək (əcəliniz çatana qədər) möhlət verər (cəzanızı dünyada verməyib axirətə saxlayar).",
                            "verse 71:5": "O dedi: \"Ey Rəbbim! Mən qövmümü gecə-gündüz (imana, haqq yola) də'vət etdim!",
                            "verse 71:6": "Lakin də'vətim onların (imandan) qaçmalarını daha da artırmaqdan başqa bir şeyə yaramadı.",
                            "verse 71:7": "Sənin onları bağışlamağın üçün mən nə zaman onları (imana) də'vət etdimsə, onlar (də'vətimi eşitməsinlər deyə) barmaqlarını qularlarına tıxadılar, (məni görməsinlər deyə) libaslarına büründülər, (küfrlərində) israr edib durdular və təkəbbür göstərdilər.",
                            "verse 71:8": "Sonra mən onları uca səslə (açıq-açığına haqqa) də'vət etdim.",
                            "verse 71:9": "Daha sonra onlara (iman gətirmək lazım olduğunu) aşkar söylədim və gizli bildirdim\".",
                            "verse 71:10": "Və dedim: \"(Tövbə edib) Rəbbinizdən bağışlanmağınızı diləyin.",
                            "verse 71:11": "O sizə göydən bol yağış göndərər;",
                            "verse 71:12": "O sizə mal-dövlət, oğul-uşaq əta edər.",
                            "verse 71:13": "Sizə nə olub ki, Allahın əzəmətindən çəkinmirsiniz? (Sizə nə olub ki, Allahın əzəmət və qüdrətindən qorxmur, Onu layiqincə uca tutmursunuz? Yaxud iman gətirəcəyiniz təqdirdə Allahın axirətdə sizə mərhəmət əta edəcəyinə ümid bəsləmirsiniz?)",
                            "verse 71:14": "Halbuki O sizi cürbəcür (və ya müxtəlif mərhələlərlə - əvvəl nütfə, sonra laxtalanmış qan, sonra bir parça ət və, nəhayət, insan şəklində) xəlq etdi.",
                            "verse 71:15": "Məgər görmürsünüz ki, Allah yeddi göyü (bir-birinin üstündə) qat-qat necə yaratdı?!",
                            "verse 71:16": "Orada ayı bir nur, günəşi də bir çıraq etdi.",
                            "verse 71:17": "Və Allah sizi (atanız Adəmi) yerdən (torpaqdan) bir bitki kimi göyərtdi.",
                            "verse 71:18": "Sonra sizi yenə ora qaytaracaq və (qiyamət günü dirildib oradan da) çıxardacaqdır.",
                            "verse 71:19": "Allah yeri sizin üçün xalı etdi (fərş kimi ayaqlarınızın altına döşədi) ki,",
                            "verse 71:20": "Onun geniş yollarında gəzəsiniz!\"",
                            "verse 71:21": "Nuh dedi: \"Ey Rəbbim! Onlar mənə qarşı çıxdılar və mal-dövləti, oğul-uşağı özlərinə ziyandan başqa bir şey artırmayan kimsələrə (öz kafir başçılarına) tabe oldular.",
                            "verse 71:22": "(Onların kafir başçıları mənim əleyhimə) çox böyük bir hiylə qurdular.",
                            "verse 71:23": "Və (tabeçiliyində olanlara) dedilər: \"?z tanrılarınızı tərk etməyin, (xüsusilə) Bəddi, Suva'ı, Yəğusu, Yəuqu və Nəsri atmayın!\"",
                            "verse 71:24": "Onlar çoxlarını yoldan çıxartdılar.",
                            "verse 71:25": "Onlar öz günahlarından dolayı suda boğdurulub Cəhənnəmə daxil edildilər və özlərinə onları Allahdan (Allahın əzabından) qurtaracaq köməkçilər də tapa bilmədilər!",
                            "verse 71:26": "Nuh dedi: \"Ey Rəbbim! Yer üzündə bir nəfər belə kafir qoyma!",
                            "verse 71:27": "Cünki sən onları (sağ) buraxsan, onlar Sənin bəndələrini yoldan çıxardacaq, ancaq pozğun və kafir (oğul-uşaq) doğub-törədəcəklər.",
                            "verse 71:28": "Ey Rəbbim! Məni, ata-anamı, mənim evimə (yaxud məscidimə) mö'min kimi daxil olan kimsəni və (qiyamət gününə qədər olacaq) bütün mö'min kişiləri və qadınları bağışla."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Mi smo poslali Nuha narodu njegovu: \"Opominji narod svoj prije nego što ga stigne patnja nesnosna!\"",
                            "verse 71:2": "O narode moj, - govorio je on - \"ja vas otvoreno opominjem:",
                            "verse 71:3": "Allahu se klanjajte i Njega se bojte i meni poslušni budite,",
                            "verse 71:4": "On će vam grijehe vaše oprostiti i u životu vas do određenog časa ostaviti, a kada Allahov određeni čas dođe zaista se neće, neka znate, odgoditi.",
                            "verse 71:5": "On reče: \"Gospodaru moj, ja sam narod svoj i noću i danju, doista, pozivao,",
                            "verse 71:6": "ali ga je pozivanje moje još više udaljilo.",
                            "verse 71:7": "I kad god sam ih pozivao da im oprostiš, prste su svoje u uši stavljali i haljinama svojim se pokrivali - bili su uporni i pretjerano oholi.",
                            "verse 71:8": "Zatim, ja sam ih otvoreno pozivao,",
                            "verse 71:9": "a onda sam im javno objavljivao i u povjerenju im šaputao,",
                            "verse 71:10": "i govorio: ’Tražite od Gospodara svoga oprost jer On, doista, mnogo prašta;",
                            "verse 71:11": "On će vam kišu obilnu slati",
                            "verse 71:12": "i pomoći će vas imanjima i sinovima, i daće vam bašče, i rijeke će vam dati.",
                            "verse 71:13": "Šta vam je, zašto se Allahove sile ne bojite,",
                            "verse 71:14": "a On vas postepeno stvara?!",
                            "verse 71:15": "Zar ne vidite kako je Allah sedam nebesa, jedno iznad drugog, stvorio,",
                            "verse 71:16": "i na njima Mjesec svjetlim dao, a Sunce svjetiljkom učinio?",
                            "verse 71:17": "Allah vas od zemlje poput bilja stvara,",
                            "verse 71:18": "zatim vas u nju vraća i iz nje će vas, sigurno, izvesti.",
                            "verse 71:19": "Allah vam je zemlju učinio ravnom,",
                            "verse 71:20": "da biste po njoj hodili putevima prostranim?’”",
                            "verse 71:21": "Nuh reče: \"Gospodaru moj, oni mene ne slušaju i povode se za onima čija bogatstva i djeca samo njihovu propast uvećavaju",
                            "verse 71:22": "i spletke velike snuju",
                            "verse 71:23": "i govore: ’Nikako božanstva svoja ne ostavljajte, i nikako ni Vedda, ni Suvaa, a ni Jegusa, ni Jeuka, ni Jesra ne napuštajte!’,",
                            "verse 71:24": "a već su mnoge u zabludu doveli, pa Ti njima, inadžijama, samo propast povećaj!\"",
                            "verse 71:25": "I oni su zbog grijehova svojih potopljeni i u vatru će biti uvedeni i nikoga sebi, osim Allaha, kao pomagača neće naći.",
                            "verse 71:26": "I Nuh reče: \"Gospodaru moj, ne ostavi na Zemlji nijednog nevjernika,",
                            "verse 71:27": "jer, ako ih ostaviš, oni će robove Tvoje u zabludu zavoditi i samo će grješnika i nevjernika rađati!",
                            "verse 71:28": "Gospodaru moj, oprosti meni, i roditeljima mojim, i onome koji kao vjernik u dom moj uđe, i vjernicima i vjernicama, a nevjernicima samo propast povećaj!\" rađati!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "আমি নূহকে প্রেরণ করেছিলাম তাঁর সম্প্রদায়ের প্রতি একথা বলেঃ তুমি তোমার সম্প্রদায়কে সতর্ক কর, তাদের প্রতি মর্মন্তদ শাস্তি আসার আগে।",
                            "verse 71:2": "সে বলল, হে আমার সম্প্রদায়! আমি তোমাদের জন্যে স্পষ্ট সতর্ককারী।",
                            "verse 71:3": "এ বিষয়ে যে, তোমরা আল্লাহ তা’আলার এবাদত কর, তাঁকে ভয় কর এবং আমার আনুগত্য কর।",
                            "verse 71:4": "আল্লাহ তা’আলা তোমাদের পাপসমূহ ক্ষমা করবেন এবং নির্দিষ্ট সময় পর্যন্ত অবকাশ দিবেন। নিশ্চয় আল্লাহ তা’আলার নির্দিষ্টকাল যখন হবে, তখন অবকাশ দেয়া হবে না, যদি তোমরা তা জানতে!",
                            "verse 71:5": "সে বললঃ হে আমার পালনকর্তা! আমি আমার সম্প্রদায়কে দিবারাত্রি দাওয়াত দিয়েছি;",
                            "verse 71:6": "কিন্তু আমার দাওয়াত তাদের পলায়নকেই বৃদ্ধি করেছে।",
                            "verse 71:7": "আমি যতবারই তাদেরকে দাওয়াত দিয়েছি, যাতে আপনি তাদেরকে ক্ষমা করেন, ততবারই তারা কানে অঙ্গুলি দিয়েছে, মুখমন্ডল বস্ত্রাবৃত করেছে, জেদ করেছে এবং খুব ঔদ্ধত্য প্রদর্শন করেছে।",
                            "verse 71:8": "অতঃপর আমি তাদেরকে প্রকাশ্যে দাওয়াত দিয়েছি,",
                            "verse 71:9": "অতঃপর আমি ঘোষণা সহকারে প্রচার করেছি এবং গোপনে চুপিসারে বলেছি।",
                            "verse 71:10": "অতঃপর বলেছিঃ তোমরা তোমাদের পালনকর্তার ক্ষমা প্রার্থনা কর। তিনি অত্যন্ত ক্ষমাশীল।",
                            "verse 71:11": "তিনি তোমাদের উপর অজস্র বৃষ্টিধারা ছেড়ে দিবেন,",
                            "verse 71:12": "তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি বাড়িয়ে দিবেন, তোমাদের জন্যে উদ্যান স্থাপন করবেন এবং তোমাদের জন্যে নদীনালা প্রবাহিত করবেন।",
                            "verse 71:13": "তোমাদের কি হল যে, তোমরা আল্লাহ তা’আলার শ্রেষ্টত্ব আশা করছ না।",
                            "verse 71:14": "অথচ তিনি তোমাদেরকে বিভিন্ন রকমে সৃষ্টি করেছেন।",
                            "verse 71:15": "তোমরা কি লক্ষ্য কর না যে, আল্লাহ কিভাবে সপ্ত আকাশ স্তরে স্তরে সৃষ্টি করেছেন।",
                            "verse 71:16": "এবং সেখানে চন্দ্রকে রেখেছেন আলোরূপে এবং সূর্যকে রেখেছেন প্রদীপরূপে।",
                            "verse 71:17": "আল্লাহ তা’আলা তোমাদেরকে মৃত্তিকা থেকে উদগত করেছেন।",
                            "verse 71:18": "অতঃপর তাতে ফিরিয়ে নিবেন এবং আবার পুনরুত্থিত করবেন।",
                            "verse 71:19": "আল্লাহ তা’আলা তোমাদের জন্যে ভূমিকে করেছেন বিছানা।",
                            "verse 71:20": "যাতে তোমরা চলাফেরা কর প্রশস্ত পথে।",
                            "verse 71:21": "নূহ বললঃ হে আমার পালনকর্তা, আমার সম্প্রদায় আমাকে অমান্য করেছে আর অনুসরণ করছে এমন লোককে, যার ধন-সম্পদ ও সন্তান-সন্ততি কেবল তার ক্ষতিই বৃদ্ধি করছে।",
                            "verse 71:22": "আর তারা ভয়ানক চক্রান্ত করছে।",
                            "verse 71:23": "তারা বলছেঃ তোমরা তোমাদের উপাস্যদেরকে ত্যাগ করো না এবং ত্যাগ করো না ওয়াদ, সূয়া, ইয়াগুছ, ইয়াউক ও নসরকে।",
                            "verse 71:24": "অথচ তারা অনেককে পথভ্রষ্ট করেছে। অতএব আপনি জালেমদের পথভ্রষ্টতাই বাড়িয়ে দিন।",
                            "verse 71:25": "তাদের গোনাহসমূহের দরুন তাদেরকে নিমজ্জিত করা হয়েছে, অতঃপর দাখিল করা হয়েছে জাহান্নামে। অতঃপর তারা আল্লাহ তা’আলা ব্যতীত কাউকে সাহায্যকারী পায়নি।",
                            "verse 71:26": "নূহ আরও বললঃ হে আমার পালনকর্তা, আপনি পৃথিবীতে কোন কাফের গৃহবাসীকে রেহাই দিবেন না।",
                            "verse 71:27": "যদি আপনি তাদেরকে রেহাই দেন, তবে তারা আপনার বান্দাদেরকে পথভ্রষ্ট করবে এবং জন্ম দিতে থাকবে কেবল পাপাচারী, কাফের।",
                            "verse 71:28": "হে আমার পালনকর্তা! আপনি আমাকে, আমার পিতা-মাতাকে, যারা মুমিন হয়ে আমার গৃহে প্রবেশ করে-তাদেরকে এবং মুমিন পুরুষ ও মুমিন নারীদেরকে ক্ষমা করুন এবং যালেমদের কেবল ধ্বংসই বৃদ্ধি করুন। কাফের।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 71:1": "Ние изпратихме Нух при неговия народ: Предупреди народа си, докато не го е сполетяло болезнено мъчение!",
                            "verse 71:2": "Рече: О, народе мой, аз съм явен предупредител за вас.",
                            "verse 71:3": "Служете на Аллах и се бойте от Него, и ми се покорете!",
                            "verse 71:4": "Тогава Той ще ви опрости греховете и ще ви даде отсрочка за определено време.",
                            "verse 71:5": "Рече: Господи мой, зовях народа си нощем и денем,",
                            "verse 71:6": "но зовът ми само увеличи тяхното бягство.",
                            "verse 71:7": "И всякога, щом ги зовях, за да ги опростиш, запушваха с пръсти ушите си и се загръщаха в дрехите си, и упорстваха, и все повече се възгордяваха.",
                            "verse 71:8": "После ги зовях открито,",
                            "verse 71:9": "после им прогласявах явно и им шепнех тайно.",
                            "verse 71:10": "И казвах: Молете вашия Господ за опрощение - Той е многоопрощаващ,",
                            "verse 71:11": "за да ви праща обилен дъжд от небето,",
                            "verse 71:12": "и да ви подкрепя с имоти и синове, и да сторва за вас градини, и да сторва за вас реки.",
                            "verse 71:13": "Какво ви е, защо не зачитате величието на Аллах?",
                            "verse 71:14": "Сътвори ви Той на етапи.",
                            "verse 71:15": "Нима не виждате как Аллах сътвори седем небеса на слоеве?",
                            "verse 71:16": "И стори Той там от луната сияние, и стори от слънцето светилник.",
                            "verse 71:17": "И ви създаде [от пръст] от земята да израснете.",
                            "verse 71:18": "После ще ви върне в нея и отново ще ви извади [в Съдния ден].",
                            "verse 71:19": "Аллах стори за вас от земята постеля,",
                            "verse 71:20": "за да ходите там по широки пътища.",
                            "verse 71:21": "Рече Нух: Господи мой, те ми се възпротивиха и последваха онези, чиито имоти и деца само увеличиха тяхната загуба.",
                            "verse 71:22": "И лукавстваха те с огромно лукавство.",
                            "verse 71:23": "И казваха: Никога не изоставяйте своите божества, не изоставяйте нито Уад, нито Суаа, нито Ягус и Яук, и Наср!",
                            "verse 71:24": "И вече заблудиха те мнозина.",
                            "verse 71:25": "Заради своите грехове те бяха издавени и въведени в Огъня, и не намериха за себе си други помощници вместо Аллах.",
                            "verse 71:26": "И рече Нух: Господи мой, не оставяй по земята нито един неверник!",
                            "verse 71:27": "Оставиш ли ги, те ще заблудят Твоите раби и ще родят само нечестивци, неблагодарници.",
                            "verse 71:28": "Господи мой, опрости на мен и на родителите ми, и на всеки вярващ, който влезе в моя дом, и на вярващите мъже, и на вярващите жени, и надбавяй на угнетителите само гибел! неблагодарници."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "我確已派譴努哈去教化他的宗族，我說：「在痛苦的刑罰降臨你的宗族之前，你當警告他們。」",
                            "verse 71:2": "他說：「我的宗族啊！我確是你們的坦率的警告者，",
                            "verse 71:3": "你們應當崇拜真主，應當敬畏他，應當服從我，",
                            "verse 71:4": "他就赦宥你們的罪過，並且讓你們延遲到一個定期。真主的定期一旦來臨的時候，是絕不延遲的，假若你們知道。」",
                            "verse 71:5": "他說：「我的主啊！我確已日夜召喚我的宗族，",
                            "verse 71:6": "但我的召喚使他們愈加逃避。",
                            "verse 71:7": "我每次召喚他們來受你的赦宥的時候，他們總是以指頭塞住他們的耳朵，以衣服蒙住他們的頭，他們固執而自大。",
                            "verse 71:8": "然後我大聲召喚他們，",
                            "verse 71:9": "然後我公開地訓導他們，秘密地勸諫他們，",
                            "verse 71:10": "我說，你們應當向你們的主求饒——他確是至赦的——",
                            "verse 71:11": "他就使豐足的雨水降臨你們，",
                            "verse 71:12": "並且以財產和子嗣援助你們，為你們創造園圃和河流。",
                            "verse 71:13": "你們怎麼不希望真主的尊重呢？",
                            "verse 71:14": "他確已經過幾個階段創造了你們。",
                            "verse 71:15": "難道你們沒有看到真主怎樣創造七層天，",
                            "verse 71:16": "並以月亮為光明，以太陽為明燈嗎？",
                            "verse 71:17": "真主使你們從大地生長出來，",
                            "verse 71:18": "然後使你們再返於大地，然後，又把你們從大地取出來。",
                            "verse 71:19": "真主為你們而平展大地，",
                            "verse 71:20": "以便你們在大地上走著寬闊的道路。」",
                            "verse 71:21": "努哈說：「我的主啊！他們確已違抗我，他們順從那因財產和子嗣而更加虧折的人們，",
                            "verse 71:22": "那等人曾定了一個重大的計謀，",
                            "verse 71:23": "他們說：『你們絕不要放棄你們的眾神明，你們絕不要放棄旺德、素佤爾、葉巫斯、葉歐格、奈斯爾。』",
                            "verse 71:24": "他們確已使許多人迷誤，求你使不義的人們更加迷誤。」",
                            "verse 71:25": "他們因為自己的罪惡而被淹死，遂墮入火獄，故他們沒有獲得援助的人們來抵禦真主。",
                            "verse 71:26": "努哈說：「我的主啊！求你不要留一個不信道大者在大地上，",
                            "verse 71:27": "如果你留他們，他們將使你的眾僕迷誤，他們只生育不道德的、不感恩的子女。",
                            "verse 71:28": "我的主啊！求你赦宥我和我的父母，赦宥信道而入我的房屋的人，以及信士們和信女們。求你使不義的人們更加毀滅。」 如果你留他們，他們將使你的眾僕迷誤，他們只生育不道德的、不感恩的子女。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Věru jsme poslali Noema k lidu jeho s rozkazem: \"Varuj lid svůj, dříve než postihne jej trest bolestný!\"",
                            "verse 71:2": "I pravil Noe: \"Lide můj, jsem vyslán k vám jako varovatel zjevný,",
                            "verse 71:3": "abyste Boha uctívali, bohabojní byli a mne poslouchali!",
                            "verse 71:4": "On odpustí vám vaše viny a dá vám odklad až do lhůty určené.",
                            "verse 71:5": "A zvolal: \"Pane můj, vyzýval jsem lid svůj nocí i dnem,",
                            "verse 71:6": "mé kázání však rozmnožilo jejich odpor jen.",
                            "verse 71:7": "A kdykoliv jsem je vyzýval - abys jim mohl odpustit - tu prsty si do uší strkali, do šatů svých se halili, zatvrdili se a chovali se hrdopyšně.",
                            "verse 71:8": "Potom jsem jim kázal zcela veřejně,",
                            "verse 71:9": "pak jsem vystoupil otevřeně a jednal s nimi skrytě i tajně",
                            "verse 71:10": "a pravil jsem jim:, Proste Pána svého za odpuštění, vždyť On věru je odpouštějící!",
                            "verse 71:11": "On sešle na vás nebe deštěm hojným",
                            "verse 71:12": "a rozmnoží vám majetky i syny a připraví pro vás zahrady a řeky.",
                            "verse 71:13": "Co je vám, že nedoufáte ve velkomyslnost Boží?",
                            "verse 71:14": "On přece stvořil vás v postupných formách;",
                            "verse 71:15": "což nevidíte, jak Bůh stvořil sedm nebes ve vrstvách",
                            "verse 71:16": "a umístil mezi nimi měsíc jako světlo a slunce učinil pochodní?",
                            "verse 71:17": "Bůh dal vám vyrůst ze země jako rostlinám,",
                            "verse 71:18": "potom vás do ní vrátí a posléze vás z ní vyvede znenadání.",
                            "verse 71:19": "A Bůh zemi jako koberce rozprostřel vám,",
                            "verse 71:20": "abyste cestami širokými chodili po ní.",
                            "verse 71:21": "I pravil Noe dále: Pane můj, oni mne neuposlechli a následovali toho, jehož majetek a děti jen zkázu jeho zvětšily,",
                            "verse 71:22": "a nesmírný úklad proti mně připravili",
                            "verse 71:23": "a zvolali:, Neopouštějte božstva svá! Neopouštějte Wadda ani Suwá´, ani Jaghútha a Ja´úqa a Nasra!?",
                            "verse 71:24": "A věru oni mnohým zbloudit dali; a nerozmnožuj nespravedlivým ničeho, leda jejich bloudění!\"",
                            "verse 71:25": "Pro hříchy své pak byli utopeni a do ohně pekelného vrženi a nenalezli pro sebe mimo Boha žádné pomocníky.",
                            "verse 71:26": "A pravil Noe: \"Pane můj, neponechávej na zemi žádného obyvatele z nevěřících,",
                            "verse 71:27": "vždyť ponecháš-li je, oni dají zbloudit služebníkům Tvým a nezrodí nic, než zase zarputilé nevěřící a hříšníky.",
                            "verse 71:28": "Pane můj, odpusť mi a rodičům mým i těm, kdož jako věřící do mého domu vstoupili, a také věřícím mužům a ženám! A nerozmnožuj nespravedlivým nic, leda záhubu jejich!\" hříšníky."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Wij zonden Noach tot zijn volk, \"Waarschuw uw volk voordat een smartelijke straf over hen komt.",
                            "verse 71:2": "Noach zei: \"O mijn volk! Waarlijk ik ben een duidelijke waarschuwer voor u.",
                            "verse 71:3": "Aanbidt daarom God, vreest Hem en gehoorzaamt mij.",
                            "verse 71:4": "Hij zal u uw zonden vergeven en u uitstel verlenen tot een bepaalde termijn; voorwaar, de termijn van God kan, wanneer hij komt, niet worden uitgesteld, als gij dit slechts wist!\"",
                            "verse 71:5": "Hij zeide: \"Mijn Heer, ik heb mijn volk dag en nacht geroepen,",
                            "verse 71:6": "Maar mijn roepen heeft slechts hun afkeer vermeerderd.",
                            "verse 71:7": "En telkens wanneer ik hen riep, opdat Gij hen zoudt vergeven stopten zij hun vingers in de oren, bedekten zich met hun kleren, volhardden (in hun ongeloof) en gedroegen zich laatdunkend.",
                            "verse 71:8": "Toen riep ik hen luide,",
                            "verse 71:9": "En verkondigde hun in het openbaar; ook sprak ik tot hen in het verborgene.",
                            "verse 71:10": "En ik zeide: \"Zoekt vergiffenis van uw Heer, want Hij is de Vergevensgezinde.",
                            "verse 71:11": "Hij zal regen voor u nederzenden in overvloed.",
                            "verse 71:12": "En Hij zal uw rijkdommen en kinderen vermeerderen, en Hij zal u tuinen en rivieren schenken.",
                            "verse 71:13": "Wat scheelt u, dat gij geen Wijsheid van God verwacht?",
                            "verse 71:14": "En Hij heeft u door verschillende stadia heen geschapen.",
                            "verse 71:15": "\"Hebt gij niet gezien, hoe God de zeven opeenvolgende hemelen schiep?",
                            "verse 71:16": "En hoe Hij de maan daarin als licht heeft geplaatst en de zon als een stralende lamp!",
                            "verse 71:17": "En God heeft u voortgebracht vanuit de aarde.",
                            "verse 71:18": "Vervolgens zal Hij u daarheen doen terugkeren, en u daaruit opnieuw doen verrijzen.",
                            "verse 71:19": "En God heeft de aarde voor u uitgespreid",
                            "verse 71:20": "Zodat gij de brede wegen er van doorkruist.",
                            "verse 71:21": "Noach zeide: \"Mijn Heer, zij gehoorzamen mij niet, en volgen iemand wiens bezit en kinderen slechts tot zijn ondergang hebben bijgedragen.",
                            "verse 71:22": "En zij hebben een vreselijk plan gesmeed.",
                            "verse 71:23": "En zeggen tegen elkander: ’Verlaat uw goden nooit.",
                            "verse 71:24": "En zij hebben velen doen dwalen, en Gij doet de onrechtvaardigen slechts in dwaling toenemen.",
                            "verse 71:25": "Daarom werden zij vanwege hun zonden verdronken en in het Vuur gedreven.",
                            "verse 71:26": "En Noach had gezegd: \"Mijn Heer, laat in het land geen huis der ongelovigen achterblijven;",
                            "verse 71:27": "Want als Gij hen achterlaat zullen zij Uw dienaren op een dwaalspoor leiden en zij zullen niets dan een onzedelijk en ondankbaar nageslacht voortbrengen.",
                            "verse 71:28": "Mijn Heer, vergeef mij, en mijn ouders, en hem die gelovend mijn huis binnentreedt, ook de gelovige mannen en vrouwen; en doe de onrechtvaardigen slechts in verderf toenemen."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 71:1": "Lo! We sent Noah unto his people (saying): Warn thy people ere the painful doom come unto them.",
                            "verse 71:2": "He said: O my people! Lo! I am a plain warner unto you",
                            "verse 71:3": "(Bidding you): Serve Allah and keep your duty unto Him and obey me,",
                            "verse 71:4": "That He may forgive you somewhat of your sins and respite you to an appointed term.",
                            "verse 71:5": "He said: My Lord! Lo! I have called unto my people night and day",
                            "verse 71:6": "But all my calling doth but add to their repugnance;",
                            "verse 71:7": "And lo! whenever I call unto them that Thou mayst pardon them they thrust their fingers in their ears and cover themselves with their garments and persist (in their refusal) and magnify themselves in pride.",
                            "verse 71:8": "And lo! I have called unto them aloud,",
                            "verse 71:9": "And lo! I have made public proclamation unto them, and I have appealed to them in private.",
                            "verse 71:10": "And I have said: Seek pardon of your Lord.",
                            "verse 71:11": "He will let loose the sky for you in plenteous rain,",
                            "verse 71:12": "And will help you with wealth and sons, and will assign unto you Gardens and will assign unto you rivers.",
                            "verse 71:13": "What aileth you that ye hope not toward Allah for dignity",
                            "verse 71:14": "When He created you by (divers) stages ?",
                            "verse 71:15": "See ye not how Allah hath created seven heavens in harmony,",
                            "verse 71:16": "And hath made the moon a light therein, and made the sun a lamp ?",
                            "verse 71:17": "And Allah hath caused you to grow as a growth from the earth,",
                            "verse 71:18": "And afterward He maketh you return thereto, and He will bring you forth again, a (new) forthbringing.",
                            "verse 71:19": "And Allah hath made the earth a wide expanse for you",
                            "verse 71:20": "That ye may thread the valley-ways thereof.",
                            "verse 71:21": "Noah said: My Lord! Lo! they have disobeyed me and followed one whose wealth and children increase him in naught save ruin;",
                            "verse 71:22": "And they have plotted a mighty plot,",
                            "verse 71:23": "And they have said: Forsake not your gods.",
                            "verse 71:24": "And they have led many astray, and Thou increasest the wrong-doers in naught save error.",
                            "verse 71:25": "Because of their sins they were drowned, then made to enter a Fire.",
                            "verse 71:26": "And Noah said: My Lord! Leave not one of the disbelievers in the land.",
                            "verse 71:27": "If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates.",
                            "verse 71:28": "My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 71:1": "We sent Noah to his People (with the Command): \"Do thou warn thy People before there comes to them a grievous Penalty.",
                            "verse 71:2": "He said: \"O my People! I am to you a Warner, clear and open:",
                            "verse 71:3": "\"That ye should worship God, fear Him and obey me:",
                            "verse 71:4": "\"So He may forgive you your sins and give you respite for a stated Term: for when the Term given by God is accomplished, it cannot be put forward: if ye only knew.",
                            "verse 71:5": "He said: \"O my Lord! I have called to my People night and day:",
                            "verse 71:6": "\"But my call only increases (their) flight (from the Right).",
                            "verse 71:7": "\"And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance.",
                            "verse 71:8": "\"So I have called to them aloud;",
                            "verse 71:9": "\"Further I have spoken to them in public and secretly in private,",
                            "verse 71:10": "\"Saying, ’Ask forgiveness from your Lord; for He is Oft-Forgiving;",
                            "verse 71:11": "\"’He will send rain to you in abundance;",
                            "verse 71:12": "\"’Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water).",
                            "verse 71:13": "\"’What is the matter with you, that ye place not your hope for kindness and long-suffering in God,-",
                            "verse 71:14": "\"’Seeing that it is He that has created you in diverse stages?",
                            "verse 71:15": "\"’See ye not how God has created the seven heavens one above another,",
                            "verse 71:16": "\"’And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?",
                            "verse 71:17": "\"’And God has produced you from the earth growing (gradually),",
                            "verse 71:18": "\"’And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)?",
                            "verse 71:19": "\"’And God has made the earth for you as a carpet (spread out),",
                            "verse 71:20": "\"’That ye may go about therein, in spacious roads.",
                            "verse 71:21": "Noah said: \"O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss.",
                            "verse 71:22": "\"And they have devised a tremendous Plot.",
                            "verse 71:23": "\"And they have said (to each other), ’Abandon not your gods: Abandon neither Wadd nor Suwa’, neither Yaguth nor Ya’uq, nor Nasr’;-",
                            "verse 71:24": "\"They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark).",
                            "verse 71:25": "Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of God- none to help them.",
                            "verse 71:26": "And Noah, said: \"O my Lord! Leave not of the Unbelievers, a single one on earth!",
                            "verse 71:27": "\"For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones.",
                            "verse 71:28": "\"O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!\""
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 71:1": "We sent Noah to his people, saying, ’Warn thy people, ere there come on them a painful chastisement.",
                            "verse 71:2": "He said, ’O my people, I am unto you a clear warner,",
                            "verse 71:3": "saying, \"Serve God, and fear Him, and obey you me,",
                            "verse 71:4": "nd He will forgive you your sins, and defer you to a stated term; God’s term, when it comes, cannot be deferred, did you but know.",
                            "verse 71:5": "He said; ’My Lord, I have called my people by night and by day,",
                            "verse 71:6": "but my calling has only increased them in flight.",
                            "verse 71:7": "And whenever I called them, that Thou mightest forgive them, they put their fingers in their ears, and wrapped them in their garments, and persisted, and waxed very proud.",
                            "verse 71:8": "Then indeed I called them openly;",
                            "verse 71:9": "then indeed I spoke publicly unto them, and I spoke unto them secretly,",
                            "verse 71:10": "and I said, \"Ask you forgiveness of your Lord; surely He is ever All-forgiving,",
                            "verse 71:11": "and He will loose heaven upon you in torrents",
                            "verse 71:12": "and will succour you with wealth and sons, and will appoint for you gardens, and will appoint for you rivers.",
                            "verse 71:13": "What ails you, that you look not for majesty in God,",
                            "verse 71:14": "seeing He created you by stages?",
                            "verse 71:15": "Have you not regarded how God created seven heavens one upon another,",
                            "verse 71:16": "and set the moon therein for a light and the sun for a lamp?",
                            "verse 71:17": "And God caused you to grow out of the earth,",
                            "verse 71:18": "then He shall return you into it, and bring you forth.",
                            "verse 71:19": "And God has laid the earth for you as a carpet,",
                            "verse 71:20": "that thereof you may thread ways, ravines.",
                            "verse 71:21": "Noah said, ’My Lord, they have rebelled against me, and followed him whose wealth and children increase him only in loss,",
                            "verse 71:22": "and have devised a mighty device",
                            "verse 71:23": "and have said, \"Do not leave your gods, and do not leave Wadd, nor Suwa’, Yaghuth, Ya’uq, neither Nasr.",
                            "verse 71:24": "And they have led many astray.",
                            "verse 71:25": "And because of their transgressions they were drowned, and admitted into a Fire, for they found not, apart from God, any to help them.",
                            "verse 71:26": "And Noah said, ’My Lord, leave not upon the earth of the unbelievers even one.",
                            "verse 71:27": "Surely, if Thou leavest them, they will lead Thy servants astray, and will beget none but unbelieving libertines.",
                            "verse 71:28": "My Lord, forgive me and my parents and whosoever enters my house as a believer, and the believers, men and women alike; and do Thou not increase the evildoers save in ruin!’ libertines."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 71:1": "BEHOLD, We sent Noah unto his people,",
                            "verse 71:2": "\"Warn thy people ere grievous suffering befall them!\"",
                            "verse 71:3": "[And Noah] said: \"O my people! I am but a plain warner to you, [sent to tell you]",
                            "verse 71:4": "that you should worship God",
                            "verse 71:5": "and be conscious of Him.",
                            "verse 71:6": "so that He may forgive you some of your sins, and grant you respite until a term known [to Him alone]: but, behold, when the term appointed by God does come, it can never be put back – if you but knew it!\"",
                            "verse 71:7": "[And after a time, Noah] said: \"O my Sustainer! Verily, I have been calling unto my people night and day,",
                            "verse 71:8": "but my call has only caused them to flee farther and farther away [from Thee].",
                            "verse 71:9": "And, behold, whenever I called unto them with a view to Thy granting them forgiveness, they put their fingers into their ears, and wrapped themselves up in their garments [of sin], and grew obstinate, and became [yet more] arrogant in their false pride.",
                            "verse 71:10": "\"And, behold, I called unto them openly;",
                            "verse 71:11": "and, behold, I preached to them in public; and I spoke to them secretly, in private;",
                            "verse 71:12": "and I said: \"‘Ask your Sustainer to forgive you your sins – for, verily, He is all-forgiving!",
                            "verse 71:13": "He will shower upon you heavenly blessings abundant,",
                            "verse 71:14": "and will aid you with worldly goods and children, and will bestow upon you gardens, and bestow upon you running waters.",
                            "verse 71:15": "\"What is amiss with you that you cannot look forward to God’s majesty,",
                            "verse 71:16": "seeing that He has created [every one of] you in successive stages?",
                            "verse 71:17": "\"Do you not see how God has created seven heavens in full harmony with one another,",
                            "verse 71:18": "and has set up within them the moon as a light ,",
                            "verse 71:19": "and set up the sun as a",
                            "verse 71:20": "lamp?",
                            "verse 71:21": "\"And God has caused you to grow out of the earth in",
                            "verse 71:22": "growth; and thereafter He will return you to it [in death]:",
                            "verse 71:23": "and",
                            "verse 71:24": "He will bring you forth [from it] in resurrection.",
                            "verse 71:25": "\"And God has made the earth a wide expanse for you,",
                            "verse 71:26": "so that you might walk thereon on spacious paths.",
                            "verse 71:27": "",
                            "verse 71:28": "Noah continued: \"O my Sustainer! Behold, they have opposed me ,",
                            "verse 71:29": "for they follow people whose wealth and children lead them increasingly into ruin,",
                            "verse 71:30": "and who have devised a most awesome blasphemy [against Thee],",
                            "verse 71:31": "inasmuch as they said [to their followers], ‘Do not ever abandon your gods: abandon neither Wadd nor Suwa’, and neither Yaghūth nor Ya’ūq nor Nasr!’",
                            "verse 71:32": "\"And so they have led many a one astray: hence, ordain Thou that these evildoers stray but farther and farther away [from all that they may desire]!\"",
                            "verse 71:33": "And so, because of their sins, they were drowned [in the great flood], and were doomed to suffer the fire [of the hereafter]; and they found none who could succour them against God.",
                            "verse 71:34": "And Noah prayed: \"O my Sustainer! Leave not on earth any of those who deny the truth:",
                            "verse 71:35": "for, behold, if Thou dost leave them, they will [always try to] lead astray those who worship Thee, and will give birth to nothing but wickedness and stubborn ingratitude.",
                            "verse 71:36": "\"O my Sustainer! Grant Thy forgiveness unto me and unto my parents, and unto everyone who enters my house as a believer, and unto all believing men and believing women [of later times]; and grant Thou that the doers of evil shall increasingly meet with destruction!\"",
                            "verse 71:37": "(nūr); both these interpolations are explained in note 10 on 10:5.",
                            "verse 71:38": "bringing-forth."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 71:1": "We sent NūH to his people (and said to him): “Warn your people before a painful punishment comes to them.",
                            "verse 71:2": "He said, “O my people, I openly warn you",
                            "verse 71:3": "that you must worship Allah, and fear Him, and obey me,",
                            "verse 71:4": "and Allah will forgive you your sins, and will respite you to an appointed term.",
                            "verse 71:5": "He said, “My Lord, I have called my people night and day,",
                            "verse 71:6": "but my call added only to their flight (from the truth).",
                            "verse 71:7": "Whenever I called them, so that You might forgive them, they put their fingers into their ears, and wrapped their clothes around themselves, and grew obstinate, and waxed proud in extreme arrogance.",
                            "verse 71:8": "Then I called them loudly,",
                            "verse 71:9": "and then I spoke to them in public and spoke to them in private.",
                            "verse 71:10": "So I said, ‘Pray to your Lord for your forgiveness,- Indeed He is Very-Forgiving, -",
                            "verse 71:11": "and He will cause the heavens to rain upon you in abundance,",
                            "verse 71:12": "and will help you with riches and sons, and will cause gardens to grow for you, and cause rivers to flow for you.",
                            "verse 71:13": "What has happened to you that you do not appreciate the Majesty of Allah,",
                            "verse 71:14": "while He has created you in different phases?",
                            "verse 71:15": "Did you not see how Allah has created seven heavens one upon another,",
                            "verse 71:16": "and has made the moon a light therein, and made the sun a lamp?",
                            "verse 71:17": "And Allah has caused you to grow well out of the earth,",
                            "verse 71:18": "then He will send you back into it, and will bring you forth once again.",
                            "verse 71:19": "And Allah has made the earth a spread for you,",
                            "verse 71:20": "so that you may go about its broad ways.",
                            "verse 71:21": "And said NūH, “My Lord, they disobeyed me, and followed him whose wealth and children added nothing to him but loss,",
                            "verse 71:22": "and they devised a mighty plot,",
                            "verse 71:23": "and said (to their people), “Never forsake your gods, and never forsake Wadd, nor Suwā‘, nor Yaghūth and Ya‘ūq and Nasr.",
                            "verse 71:24": "And they have led many astray.",
                            "verse 71:25": "Because of their sins they were drowned, and then admitted into the Fire.",
                            "verse 71:26": "And said NūH, “My Lord, do not leave on earth even a single inhabitant (surviving) out of the disbelievers.",
                            "verse 71:27": "If You leave them (surviving), they will lead Your servants astray, and will beget none but a sinful disbeliever.",
                            "verse 71:28": "My Lord, grant pardon to me, and to my parents, and to everyone who enters my home as a believer, and to all the believing men and believing women, and do not increase the wrongdoers but in ruin."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 71:1": "Verily We sent Noah to his people :",
                            "verse 71:2": "‘Warn your people before there come on them a painful chastisement’.",
                            "verse 71:3": "He said, ‘O my people, I am indeed a plain warner to you,",
                            "verse 71:4": "[to tell you] that [you should] worship God and fear Him and obey me,",
                            "verse 71:5": "that He may forgive you some of your sins and defer you, until an appointed term.",
                            "verse 71:6": "He said, ‘My Lord, I have summoned my people night and day,",
                            "verse 71:7": "but my summon has only increased their evasion.",
                            "verse 71:8": "And indeed whenever I summoned them, so that You might forgive them, they put their fingers in their ears, and draw their cloaks over themselves, and they persist, and act in great arrogance.",
                            "verse 71:9": "Then indeed I summoned them aloud;",
                            "verse 71:10": "then assuredly I proclaimed to them, and I confided to them secretly,",
                            "verse 71:11": "saying, “Ask your Lord for forgiveness.",
                            "verse 71:12": "He will release the heaven for you in torrents,",
                            "verse 71:13": "and furnish you with wealth and sons, and assign to you gardens, and assign to you rivers.",
                            "verse 71:14": "What is wrong with you that you do not hope for dignity from God,",
                            "verse 71:15": "when verily He created you in stages?",
                            "verse 71:16": "Have you not seen how God created seven heavens in layers,",
                            "verse 71:17": "and made the moon therein as a light and made the sun as a lamp?",
                            "verse 71:18": "And God has caused you to grow from the earth.",
                            "verse 71:19": "Then He will make you return into it and bring you forth [with a veritable bringing forth].",
                            "verse 71:20": "And God has made the earth a flat",
                            "verse 71:21": "expanse for you,",
                            "verse 71:22": "so that you may follow throughout it spacious routes” ’.",
                            "verse 71:23": "Noah said, ‘My Lord, they have disobeyed me and followed those whose wealth and children, only add to their loss.",
                            "verse 71:24": "And they have devised a mighty plot,",
                            "verse 71:25": "and have said: “Do not abandon your gods, and do not abandon Wadd nor Suwā’, nor Yaghūth and Ya’ūq and Nasr”,",
                            "verse 71:26": "And they have certainly led astray many.",
                            "verse 71:27": "Because of their iniquities they were drowned then made to enter the Fire.",
                            "verse 71:28": "And Noah said, ‘My Lord, do not leave from among the disbelievers a single dweller upon the earth.",
                            "verse 71:29": "Assuredly if You leave them, they will lead Your servants astray, and will beget only disbelieving profligates.",
                            "verse 71:30": "My Lord, forgive me and my parents and whoever enters my house as a believer, and believing men and believing women, and do not increase the evildoers except in ruin’."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 71:1": "Surely, We sent Nuh (Noah) to his people: ‘Warn your people before a painful torment comes upon them.",
                            "verse 71:2": "He said: ‘O my people! Indeed, I am a clear Warner to you,",
                            "verse 71:3": "That you must worship Allah and fear Him and obey me.",
                            "verse 71:4": "He will forgive your sins and will give you respite till an appointed term.",
                            "verse 71:5": "Nuh (Noah) submitted: ‘O my Lord! Indeed, I kept calling my people night and day,",
                            "verse 71:6": "But my calling did no good except making them flee away.",
                            "verse 71:7": "And every time I called them (towards faith) so that You might forgive them, they only thrust their fingers into their ears and wrapped their clothes over themselves and stuck obstinately (to disbelief) and behaved most arrogantly.",
                            "verse 71:8": "Then I called them aloud.",
                            "verse 71:9": "Then I advised them publicly and privately and secretly (as well).",
                            "verse 71:10": "Then I said: ‘Seek forgiveness from your Lord.",
                            "verse 71:11": "He will send down on you torrents of rain,",
                            "verse 71:12": "And will help you with wealth and sons and will grow for you gardens and will make streams flow for you.",
                            "verse 71:13": "What is the matter with you that you do not have faith in, or the gnosis of, Allah’s Majesty,",
                            "verse 71:14": "Whereas He has created you through diverse conditions?",
                            "verse 71:15": "Have you not seen how Allah has created seven (or many) heavenly spheres corresponding to one another (layer upon layer)?",
                            "verse 71:16": "And He brightened in them the moon and made the sun a radiant lamp (i.",
                            "verse 71:17": "And Allah has caused you to grow like vegetation from the earth.",
                            "verse 71:18": "Then He will return you into the same (earth) and will then bring you forth (from the same again).",
                            "verse 71:19": "And Allah has made the earth a vast expanse for you,",
                            "verse 71:20": "So that you may move around through its broad ways.",
                            "verse 71:21": "Nuh (Noah) submitted: ‘O my Lord! They have disobeyed me and kept following that (class of the rebellious rich) whose wealth and children have not increased for them anything but loss.",
                            "verse 71:22": "And they kept perpetrating huge frauds (to keep the common man in error).",
                            "verse 71:23": "And they kept saying: Do not turn away from your gods and never abandon (the idols named as) Wadd, Suwa‘, Yaghuth, Ya‘uq and Nasr (as well).",
                            "verse 71:24": "And truly, they have misled many people.",
                            "verse 71:25": "(In the end) they were drowned due to their sins and then flung into Fire.",
                            "verse 71:26": "And Nuh (Noah) submitted: ‘O my Lord! Do not leave even a single disbeliever living on earth.",
                            "verse 71:27": "Surely, if You leave them (alive), they will keep leading your servants astray and will beget none but the most wicked and extremely disbelieving children.",
                            "verse 71:28": "O my Lord! Forgive me and my parents and everyone who enters my home as a believer and (all) the believing men and the believing women, and do not increase anything for the wrongdoers except destruction."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Totisesti Me lähetimme Nooan oman kansansa eteen sanoen: »Varoita kansaasi, ennenkuin tuskallinen rangaistus sen yllättää!»",
                            "verse 71:2": "Hän julisti: »Kansa, totisesti olen julkinen varoittajasi.",
                            "verse 71:3": "Palvelkaa Jumalaa, tarkoin täyttäen velvollisuutenne Häntä kohtaan, ja olkaa kuuliaisia minulle,",
                            "verse 71:4": "niin Hän antaa teille syntinne anteeksi ja myöntää teille armonaikaa.",
                            "verse 71:5": "Hän sanoi: »Herra, katso, olen vedonnut kansaani päivin ja öin,",
                            "verse 71:6": "mutta saarnani on heissä vain lisännyt vastahakoisuutta.",
                            "verse 71:7": "Ja katso, vaikka kuinka usein olisin heitä kutsunut, jotta Sinä voisit antaa heille anteeksi, tukkivat he sormin korvansa ja kietoutuvat vaatteisiinsa torjuen kaiken itsepintaisesti ja paisuen ylpeydessään.",
                            "verse 71:8": "Silloin totisesti saarnasin heille äänekkäästi",
                            "verse 71:9": "huusin kaikkien kuullen, haastoinpa heille myös kahden kesken",
                            "verse 71:10": "sanoen: 'Pyytäkää Herraltanne anteeksiantoa - Hän on totisesti armahtavainen -",
                            "verse 71:11": "Hän lähettää päällenne pilvet ja runsaan sateen,",
                            "verse 71:12": "enentää teille rikkautta ja lapsia sekä luo teitä varten paratiisin virtoineen.",
                            "verse 71:13": "Miksi ette pyydä armolahjoja Jumalalta?",
                            "verse 71:14": "Totisesti, Hänhän on luonut teidät eri vaiheiden kautta.",
                            "verse 71:15": "Ettekö näe, kuinka Jumala on luonut seitsemän taivasta toinen toisensa yläpuolelle?",
                            "verse 71:16": "Hän on myös asettanut niille kuun valoksi ja auringon lampuksi.",
                            "verse 71:17": "Jumala on kasvattanut teidät maasta,",
                            "verse 71:18": "Hän käskee teidän myöskin palata siihen ja antaa teille ylösnousemuksen.",
                            "verse 71:19": "Teitä varten Jumala on levittänyt maan ääret",
                            "verse 71:20": "vaeltaaksenne sen avarilla teillä.",
                            "verse 71:21": "Nooa sanoi: »Herra, totisesti he ovat olleet minua kohtaan uppiniskaisia ja pitäneet niitä esikuvinaan, joiden rikkaus ja lapset vain lisäävät heidän turmelustaan.",
                            "verse 71:22": "He ovat punoneet monia juonia",
                            "verse 71:23": "ja sanovat: 'Älkää suinkaan hylätkö jumalianne, Waddia ja Suwaa, Jaguutia, Jaukia ja Nasria!'",
                            "verse 71:24": "Näin he ovat totisesti johtaneet monia harhaan, ja villitys käy yhä suuremmaksi jumalattomien keskuudessa.",
                            "verse 71:25": "Heidät hukutettiin vääryyksiensä tähden, ja heidän oli käytävä tuleen, eikä heillä ollut muita auttajia kuin Jumala.",
                            "verse 71:26": "Ja Nooa sanoi: »Herra, älä jätä maan päälle ainoatakaan jumalatonta asumaan!",
                            "verse 71:27": "Totisesti, jos säästät heistä ketään, he johtavat palvelijasi harhaan ja siittävät irstaita ja epäuskoisia jälkeläisiä.",
                            "verse 71:28": "Herra, anna anteeksi minulle ja vanhemmilleni; niin myös jokaiselle, joka uskossa astuu talooni, sekä kaikille uskoville, miehille ja naisille! Mutta jumalattomille tuota turmio!»"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 71:1": "Oui, Nous avons envoyé Noé à son peuple : \" Avertis ton peuple avant qu'un douloureux châtiment ne l'atteigne ! \"",
                            "verse 71:2": "Il dit : \" O mon peuple ! Je suis pour vous un avertisseur explicite.",
                            "verse 71:3": "Adorez Dieu et craignez-Le, et obéissez-moi !",
                            "verse 71:4": "Il vous pardonnera vos péchés et Il vous accordera un délai jusqu'à un terme fixé ; mais quand vient le terme fixé par Dieu, il ne peut être différé.",
                            "verse 71:5": "Il dit : \" Mon Seigneur ! J'ai appelé mon peuple nuit et jour,",
                            "verse 71:6": "mais mon appel n'a fait qu'augmenter son éloignement.",
                            "verse 71:7": "Chaque fois que je les ai appelés pour que Tu leur pardonnes, ils se sont mis les doigts dans les oreilles, ils se sont enveloppés dans leur vêtements, ils se sont obstinés et ont fait preuve d'un orgueil invétéré.",
                            "verse 71:8": "Je les ai ensuite appelés à voix haute,",
                            "verse 71:9": "j'ai fait des proclamations et je leur ai parlé en secret.",
                            "verse 71:10": "J'ai dit : \"Implorez le pardon de votre Seigneur, car Il est Celui qui pardonne généreusement.",
                            "verse 71:11": "Il vous fera descendre du ciel une pluie abondante ;",
                            "verse 71:12": "Il vous assistera par des richesses et des enfants ; Il vous donnera des jardins et vous donnera des rivières.",
                            "verse 71:13": "Pourquoi n'espérez-vous pas en Dieu avec révérence,",
                            "verse 71:14": "Lui qui vous a créés par phases successives ?",
                            "verse 71:15": "N'avez-vous pas vu comment Dieu a créé sept cieux superposés ?",
                            "verse 71:16": "Il y a placé la lune comme une lumière ; Il y a placé le soleil comme une lampe.",
                            "verse 71:17": "Dieu vous a fait croître de la terre comme les plantes.",
                            "verse 71:18": "Ensuite, Il vous y renverra, et Il vous en fera ressurgir.",
                            "verse 71:19": "Dieu a fait pour vous de la terre un tapis",
                            "verse 71:20": "afin que vous puissiez en parcourir les voies spacieuses\" \".",
                            "verse 71:21": "Noé dit encore : \" Mon Seigneur, ils m'ont désobéi et ils ont suivi celui dont les richesses et les enfants n'ont fait qu'accroître leur perte.",
                            "verse 71:22": "Ils ont tramé un vaste complot",
                            "verse 71:23": "et ils ont dit : \"N'abandonnez pas vos divinités : n'abandonnez ni Wadd, ni Souwa', ni Yaghouth, ni Ya'ouq, ni Nasr !\"",
                            "verse 71:24": "Ainsi ils ont égaré des multitudes.",
                            "verse 71:25": "A cause de leurs fautes, ils furent noyés, puis introduits dans un feu, et ils n'ont trouvé aucun protecteur à la place de Dieu.",
                            "verse 71:26": "Noé dit : \" Mon Seigneur ! Ne laisse sur la terre aucun habitant qui soit du nombre des mécréants.",
                            "verse 71:27": "Si Tu les épargnais, ils égareraient Tes serviteurs et ils n'engendreraient que des négateurs pervertis.",
                            "verse 71:28": "Mon Seigneur ! Pardonne-moi ainsi qu'à mes père et mère, et à quiconque entre dans ma maison en ayant la foi, ainsi qu'aux croyants et aux croyantes."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 71:1": "Nous avons envoyé Noé vers son peuple : «Avertis ton peuple, avant que leur vienne un châtiment douloureux».",
                            "verse 71:2": "Il",
                            "verse 71:3": "dit : «ô mon peuple, je suis vraiment pour vous, un avertisseur clair,",
                            "verse 71:4": "Adorez Dieu, craignez-Le et obéissez-moi,",
                            "verse 71:5": "pour qu’Il vous pardonne vos péchés et qu’Il vous donne un délai jusqu’à un terme fixé.",
                            "verse 71:6": "Il dit : «Seigneur ! J’ai appelé mon peuple, nuit et jour.",
                            "verse 71:7": "Mais mon appel n’a fait qu’accroître leur fuite.",
                            "verse 71:8": "Et chaque fois que je les ai appelés pour que Tu leur pardonnes, ils ont mis leurs doigts dans leurs oreilles, se sont enveloppés de leurs vêtements, se sont entêtés et se sont montrés extrêmement orgueilleux.",
                            "verse 71:9": "Ensuite, je les ai appelés ouvertement.",
                            "verse 71:10": "Puis, je leur ai fait des proclamations publiques, et des confidences en secret.",
                            "verse 71:11": "J’ai donc dit : «Implorez le pardon de votre Seigneur, car Il est grand Pardonneur,",
                            "verse 71:12": "pour qu’Il vous envoie du ciel, des pluies abondante,",
                            "verse 71:13": "et qu’Il vous accorde beaucoup de biens et d’enfants, et vous donne des jardins et vous donne des rivières.",
                            "verse 71:14": "Qu’avez-vous à ne pas vénérer Dieu comme il se doit,",
                            "verse 71:15": "alors qu’Il vous a créés par phases successives ?",
                            "verse 71:16": "N’avez-vous pas vu comment Dieu a créé sept cieux superposés",
                            "verse 71:17": "et y a fait de la lune une lumière et du soleil une lampe ?",
                            "verse 71:18": "Et c’est Dieu qui, de la terre, vous a fait croître comme des plantes,",
                            "verse 71:19": "puis Il vous y fera retourner et vous en fera sortir véritablement.",
                            "verse 71:20": "Et c’est Dieu qui vous a fait de la terre un tapis,",
                            "verse 71:21": "pour que vous vous acheminiez par ses voies spacieuses».",
                            "verse 71:22": "Noé dit : «Seigneur, ils m’ont désobéi et ils ont suivi celui dont les biens et les enfants n’ont fait qu’accroître la perte.",
                            "verse 71:23": "Ils ont ourdi un immense stratagème,",
                            "verse 71:24": "et ils ont dit : «N’abandonnez jamais vos divinités et n’abandonnez jamais Wadd, Suwaa, Yagout, Yaouq et Nasr .",
                            "verse 71:25": "Elles [les idoles] ont déjà égaré plusieurs.",
                            "verse 71:26": "A cause de leurs fautes, ils ont été noyés, puis on les a fait entrer au Feu, et ils n’ont pas trouvé en dehors de Dieu, de secoureurs».",
                            "verse 71:27": "Et Noé dit : «Seigneur, ne laisse sur la terre aucun infidèle.",
                            "verse 71:28": "Si Tu les laisses [en vie], ils égareront Tes serviteurs et n’engendreront que des pécheurs infidèles.",
                            "verse 71:29": "Seigneur ! Pardonne-moi, et à mes père et mère et à celui qui entre dans ma demeure croyante, ainsi qu’aux croyants et croyantes; et ne fait croître les injustes qu’en perdition»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Wir sandten Noah zu seinem Volk (und sprachen): «Warne dein Volk, bevor über sie eine schmerzliche Strafe kommt.",
                            "verse 71:2": "Er sprach: «O mein Volk! wahrlich, ich bin euch ein aufklärender Warner,",
                            "verse 71:3": "Daß ihr Allah dienet und Ihn fürchtet und mir gehorchet.",
                            "verse 71:4": "Er wird euch eure Sünden vergeben und euch Aufschub gewähren bis zu einer bestimmten Frist.",
                            "verse 71:5": "Er sprach: «Mein Herr, ich habe mein Volke gerufen bei Nacht und bei Tag,",
                            "verse 71:6": "Doch mein Rufen hat nur ihre Abwendung verstärkt.",
                            "verse 71:7": "Sooft ich sie rief, daß Du ihnen vergeben möchtest, steckten sie ihre Finger in die Ohren und hüllten sich in ihre Gewänder und verharrten (im Frevel) und wurden allzu hochfahrend.",
                            "verse 71:8": "Dann rief ich sie offen auf.",
                            "verse 71:9": "Dann predigte ich ihnen öffentlich, und ich redete zu ihnen insgeheim,",
                            "verse 71:10": "Und ich sprach: \"Suchet eures Herrn Verzeihung, denn Er ist allverzeihend.",
                            "verse 71:11": "Er wird Regen für euch herniedersenden in Fülle",
                            "verse 71:12": "Und wird euch mit Glücksgütern und Kindern stärken und wird euch Gärten bescheren und für euch Flüsse schaffen.",
                            "verse 71:13": "Was ist euch, daß ihr von Allah nicht Weisheit und Gesetztheit erwartet,",
                            "verse 71:14": "Da Er euch doch in verschiedenen Stufen und verschiedenen Formen erschaffen hat?",
                            "verse 71:15": "Habt ihr nicht gesehen, wie Allah sieben Himmel in vollkommenem Einklang geschaffen hat,",
                            "verse 71:16": "Und den Mond in sie gesetzt hat als ein Licht und die Sonne gemacht hat zu einer Lampe?",
                            "verse 71:17": "Und Allah hat euch aus der Erde wachsen lassen wie eine Pflanzung.",
                            "verse 71:18": "Dann wird Er euch wieder in sie zurückkehren lassen, und Er wird euch hervorbringen in (neuer) Geburt.",
                            "verse 71:19": "Und Allah hat die Erde für euch zu einem weit offenen Bette gemacht,",
                            "verse 71:20": "Auf daß ihr auf ihren breiten Straßen ziehen möget.",
                            "verse 71:21": "Noah sprach: «Mein Herr, sie haben mir nicht gehorcht und sind einem gefolgt, dessen Reichtum und Kinder nur seinen Verlust gemehrt haben.",
                            "verse 71:22": "Und sie haben einen schrecklichen Plan entworfen.",
                            "verse 71:23": "Und sie sprechen (zueinander): \"Verlasset eure Götter auf keine Weise.",
                            "verse 71:24": "Und sie haben viele verführt; drum mehre die Frevler in nichts als im Irrtum.",
                            "verse 71:25": "Ob ihrer Sünden wurden sie ertränkt und in ein Feuer gebracht.",
                            "verse 71:26": "Und Noah sprach: «Mein Herr, laß im Lande (auch) nicht einen einzigen von den Ungläubigen;",
                            "verse 71:27": "Denn wenn Du sie lässest, so werden sie nur Deine Diener verführen und werden nur eine tief frevlerische (Nachkommenschaft) von hartnäckigen Ungläubigen zeugen.",
                            "verse 71:28": "Mein Herr, vergib mir und meinen Eltern und dem, der mein Haus gläubig betritt, und den gläubigen Männern und den gläubigen Frauen; und mehre die Frevler in nichts als in der Vernichtung."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "geus uwg dks mldh d+kSe ds ikl ¼iSx+Ecj cukdj½ Hkstk fd d+Cy mlds fd mudh d+kSe ij nnZukd vt+kc vk, mudks mlls Mjkvks",
                            "verse 71:2": "rks uwg ¼viuh d+kSe ls½ dgus yxs ,s esjh d+kSe eSa rks rqEgsa lkQ+ lkQ+ Mjkrk ¼vkSj le>krk½ gw¡",
                            "verse 71:3": "fd rqe yksx [+kqnk dh bcknr djks vkSj mlh ls Mjks vkSj esjh brkvr djks",
                            "verse 71:4": "[+kqnk rqEgkjs xqukg c[+’k nsxk vkSj rqEgsa ¼ekSr ds½ eqd+jZj oD+r rd ckd+h j",
                            "verse 71:5": "cs’kd tc [+kqnk dk eqd+jZj fd;k gqvk oD+r vk tkrk gS rks ihNs gVk;k ugha tk ldrk vxj rqe le>rs gksrs",
                            "verse 71:6": "¼tc yksxksa us u ekuk rks½ vt+Z dh ijojfnxkj eSa viuh d+kSe dks ¼bZeku dh rjQ½ cqykrk jgk",
                            "verse 71:7": "ysfdu og esjs cqykus ls vkSj T+;knk xqjst+ gh djrs jgs",
                            "verse 71:8": "vkSj eSus tc mudks cqyk;k fd ¼;s rkSck djsa vkSj½ rw mUgsa ekQ dj ns rks mUgksus vius dkuksa esa mWxfy;k¡ ns yha vkSj eq>ls fNius dks diM+s vks<+ fy, vkSj vM+ x, vkSj cgqr f’kn~nr ls vdM+ cSBs",
                            "verse 71:9": "fQj eSaus mudks fcy ,yku cqyk;k fQj mudks t+kfgj c t+kfgj le>k;k",
                            "verse 71:10": "vkSj mudh iks’khnk Hkh Q+gekbZ’k dh fd eSaus muls dgk",
                            "verse 71:11": "vius ijojfnxkj ls ex+Qs+jr dh nqvk ek¡xks cs’kd og cM+k c[+’kus okyk gS",
                            "verse 71:12": "¼vkSj½ rqe ij vkleku ls ewlyk/kkj ikuh cjlk,xk",
                            "verse 71:13": "vkSj eky vkSj vkSykn esa rjD+d+h nsxk] vkSj rqEgkjs fy, ckx+ cuk,xk] vkSj rqEgkjs fy, ugjsa tkjh djsxk",
                            "verse 71:14": "rqEgsa D;k gks x;k gS fd rqe [+kqnk dh vt+er dk t+jk Hkh [+;ky ugha djrs",
                            "verse 71:15": "gkykWfd mlh us rqedks rjg rjg dk iSnk fd;k",
                            "verse 71:16": "D;k rqeus x+kSj ugha fd;k fd [+kqnk us lkr vkleku Åij rysa D;ksa dj cuk,",
                            "verse 71:17": "vkSj mlh us mlesa pk¡n dks uwj cuk;k vkSj lwjt dks jkS’ku fpjkx+ cuk fn;k",
                            "verse 71:18": "vkSj [+kqnk gh rqedks t+ehu ls iSnk fd;k",
                            "verse 71:19": "fQj rqedks mlh esa nksckjk ys tk,xk vkSj ¼d+;ker esa mlh ls½ fudky dj [kM+k djsxk",
                            "verse 71:20": "vkSj [+kqnk gh us t+ehu dks rqEgkjs fy, Q+’kZ cuk;k",
                            "verse 71:21": "rkfd rqe mlds cM+s cM+s dq’kknk jkLrksa esa pyks fQjks",
                            "verse 71:22": "¼fQj½ uwg us vt+Z dh ijojfnxkj bu yksxksa us esjh ukQ+jekuh dh ml Ó[+l ds rkcsnkj cu ds ftlus muds eky vkSj vkSykn esa uqd+lku ds flok Q+k;nk u igq¡pk;k",
                            "verse 71:23": "vkSj mUgksaus ¼esjs lkFk½ cM+h eDdkfj;k¡ dh",
                            "verse 71:24": "vkSj ¼myVs½ dgus yxs fd vkius ekcwnksa dks gjfxt+ u NksM+uk vkSj u on dks vkSj lqvk dks vkSj u ;xwl vkSj ;Åd+ o ulz dks NksM+uk",
                            "verse 71:25": "vkSj mUgksaus cgqrsjksa dks xqejkg dj NksM+k",
                            "verse 71:26": "vkSj rw ¼mu½ t+kfyeksa dh xqejkgh dks vkSj c<+k ns",
                            "verse 71:27": "¼vkf[+kj½ og vius xqukgksa dh cnkSyr ¼igys rks½ Mqck, x, fQj tgUuqe esa >ksads x, rks mu yksxksa us [+kqnk ds flok fdlh dks viuk ennxkj u ik;k",
                            "verse 71:28": "vkSj uwg us vt+Z dh ijojfnxkj ¼bu½ dkfQ+jksa esa :, t+ehu ij fdlh dks clk gqvk u jgus ns",
                            "verse 71:29": "D;ksafd vxj rw mudks NksM+ nsxk rks ;s ¼fQj½ rsjs cUnksa dks xqejkg djsaxs vkSj mudh vkSykn Hkh xqukgxkj vkSj dV~Vh dkfQj gh gksxh"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Sesungguhnya Kami telah mengutus Nuh kepada kaumnya (dengan memerintahkan): \"Berilah kaummu peringatan sebelum datang kepadanya azab yang pedih\".",
                            "verse 71:2": "Nuh berkata: \"Hai kaumku, sesungguhnya aku adalah pemberi peringatan yang menjelaskan kepada kamu,",
                            "verse 71:3": "(yaitu) sembahlah olehmu Allah, bertakwalah kepada-Nya dan ta’atlah kepadaku,",
                            "verse 71:4": "niscaya Allah akan mengampuni sebagian dosa-dosamu dan menangguhkan kamu sampai kepada waktu yang ditentukan.",
                            "verse 71:5": "Nuh berkata: \"Ya Tuhanku sesungguhnya aku telah menyeru kaumku malam dan siang,",
                            "verse 71:6": "maka seruanku itu hanyalah menambah mereka lari (dari kebenaran).",
                            "verse 71:7": "Dan sesungguhnya setiap kali aku menyeru mereka (kepada iman) agar Engkau mengampuni mereka, mereka memasukkan anak jari mereka ke dalam telinganya dan menutupkan bajunya (ke mukanya) dan mereka tetap (mengingkari) dan menyombongkan diri dengan sangat.",
                            "verse 71:8": "Kemudian sesungguhnya aku telah menyeru mereka (kepada iman) dengan cara terang-terangan,",
                            "verse 71:9": "kemudian sesungguhnya aku (menyeru) mereka (lagi) dengan terang-terangan dan dengan diam-diam,",
                            "verse 71:10": "maka aku katakan kepada mereka: \"Mohonlah ampun kepada Tuhanmu, sesungguhnya Dia adalah Maha Pengampun,",
                            "verse 71:11": "niscaya Dia akan mengirimkan hujan kepadamu dengan lebat,",
                            "verse 71:12": "dan membanyakkan harta dan anak-anakmu, dan mengadakan untukmu kebun-kebun dan mengadakan (pula di dalamnya) untukmu sungai-sungai.",
                            "verse 71:13": "Mengapa kamu tidak percaya akan kebesaran Allah?",
                            "verse 71:14": "Padahal Dia sesungguhnya telah menciptakan kamu dalam beberapa tingkatan kejadian.",
                            "verse 71:15": "Tidakkah kamu perhatikan bagaimana Allah telah menciptakan tujuh langit bertingkat-tingkat?",
                            "verse 71:16": "Dan Allah menciptakan padanya bulan sebagai cahaya dan menjadikan matahari sebagai pelita?",
                            "verse 71:17": "Dan Allah menumbuhkan kamu dari tanah dengan sebaik-baiknya,",
                            "verse 71:18": "kemudian Dia mengembalikan kamu ke dalam tanah dan mengeluarkan kamu (daripadanya pada hari kiamat) dengan sebenar-benarnya.",
                            "verse 71:19": "Dan Allah menjadikan bumi untukmu sebagai hamparan,",
                            "verse 71:20": "supaya kamu menjalani jalan-jalan yang luas di bumi itu\".",
                            "verse 71:21": "Nuh berkata: \"Ya Tuhanku, sesungguhnya mereka telah mendurhakai-ku, dan telah mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka,",
                            "verse 71:22": "dan melakukan tipu-daya yang amat besar\".",
                            "verse 71:23": "Dan mereka berkata: \"Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwaa’, yaghuts, ya’uq dan nasr.",
                            "verse 71:24": "Dan sesudahnya mereka telah menyesatkan kebanyakan (manusia); dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kesesatan.",
                            "verse 71:25": "Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan lalu dimasukkan ke neraka, maka mereka tidak mendapat penolong-penolong bagi mereka selain dari Allah.",
                            "verse 71:26": "Nuh berkata: \"Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi.",
                            "verse 71:27": "Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka tidak akan melahirkan selain anak yang berbuat ma’siat lagi sangat kafir.",
                            "verse 71:28": "Ya Tuhanku! Ampunilah aku, ibu bapakku, orang yang masuk ke rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "In verità inviammo Noè al suo popolo: « Avverti il tuo popolo prima che giunga loro un doloroso castigo».",
                            "verse 71:2": "Disse: « O popol mio, in verità io sono per voi un ammonitore evidente:",
                            "verse 71:3": "adorate Allah, temeteLo e obbeditemi,",
                            "verse 71:4": "affinché perdoni una parte dei vostri peccati e vi conceda dilazione fino a un termine stabilito; ma quando giungerà il termine di Allah non potrà essere rimandato, se",
                            "verse 71:5": "lo sapeste ».",
                            "verse 71:6": "Disse: « Signore, ho chiamato il mio popolo giorno e notte,",
                            "verse 71:7": "ma il mio richiamo ha solo accresciuto la loro repulsione.",
                            "verse 71:8": "Ogni volta che li chiamavo affinché Tu li perdonassi, si turavano le orecchie con le dita e si avvolgevano nelle loro vesti, pervicaci e tronfi di superbia.",
                            "verse 71:9": "Poi li ho chiamati ad alta voce.",
                            "verse 71:10": "Li ho arringati e ho parlato loro in segreto,",
                            "verse 71:11": "dicendo: Implorate il perdono del vostro Signore, Egli è Colui che molto perdona,",
                            "verse 71:12": "affinché vi invii dal cielo una pioggia abbondante,",
                            "verse 71:13": "accresca i vostri beni e i vostri figli e vi conceda giardini e ruscelli.",
                            "verse 71:14": "Perché non confidate nella magnanimità di Allah,",
                            "verse 71:15": "quando è Lui che vi ha creati in fasi successive?",
                            "verse 71:16": "Non avete considerato come Allah ha creato sette cieli sovrapposti",
                            "verse 71:17": "e della luna ha fatto una luce e del sole un luminare.",
                            "verse 71:18": "E' Allah che vi ha fatto sorgere dalla terra come piante.",
                            "verse 71:19": "Poi vi rimanderà [ad essa] e vi farà risorgere.",
                            "verse 71:20": "Allah ha fatto della terra un tappeto per voi,",
                            "verse 71:21": "affinché possiate viaggiare su spaziose vie».",
                            "verse 71:22": "Disse Noè: « Signore, mi hanno disobbedito seguendo coloro i cui beni e figli non fanno che aumentarne la rovina;",
                            "verse 71:23": "hanno tramato un'enorme trama",
                            "verse 71:24": "e hanno detto: \" Non abbandonate i vostri dei, non abbandonate né Wadd, né Suwâ, né Yaghûth, né Ya'ûq, né Nasr' \" ».",
                            "verse 71:25": "Essi ne hanno traviati molti;",
                            "verse 71:26": "non accrescere gli ingiusti altro che nella perdizione».",
                            "verse 71:27": "A causa dei loro peccati sono stati affogati e poi introdotti nel Fuoco, e non trovarono nessun soccorritore all'infuori di Allah.",
                            "verse 71:28": "Pregò Noè: « Signore, non lasciare sulla terra alcun abitante che sia miscredente!",
                            "verse 71:29": "Se li risparmierai, travieranno i Tuoi servi e non genereranno altro che perversi ingrati.",
                            "verse 71:30": "Signore, perdona a me, ai miei genitori, a chi entra nella mia casa come credente, ai credenti e alle credenti; non accrescere gli ingiusti altro che nella rovina»."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "本当にわれは，ヌーフをその民に遣わし，「痛ましい懲罰があなたの民に下る前に，あなたは，かれらに警告しなさい。」（と命じた）。",
                            "verse 71:2": "かれは言った。「わたしの人びとよ，わたしはあなたがたへの公明な1人の警告者です。",
                            "verse 71:3": "あなたがたはアッラーに仕え，かれを畏れ，わたしに従いなさい。",
                            "verse 71:4": "かれはあなたがたの様々な罪を赦し，定められた期限まで，あなたがたを猶予なされます。本当にアッラーの期限が来た時は，猶予されません。もしあなたがたが分っていたならば。」",
                            "verse 71:5": "かれ（ヌーフ）は申し上げた。「主よ，わたしは夜も昼も，わたしの人びとに呼びかけました。",
                            "verse 71:6": "だが，わたしの呼びかけは，只（正道からの）逃避を増すばかりです。",
                            "verse 71:7": "わたしがかれらに，『かれが，あなたがたを御赦しになるのだ』と呼びかける時，かれらは指を自分の耳に差し込み，自分で外套を被って（不信心を）固執し，ひたすら高慢になります。",
                            "verse 71:8": "それでわたしは，声を大きくしてかれらに呼びかけました。",
                            "verse 71:9": "或る時は公に，また（或る時は）密かにかれらに（訴えて），",
                            "verse 71:10": "わたしは言いました。『あなたがたの主の御赦しを願え。本当にかれは，度々御赦しなされる。",
                            "verse 71:11": "かれは，あなたがたの上に豊かに雨を降らせられ，",
                            "verse 71:12": "あなたがたの財産や子女を増やし，またあなたがたのために，様々な園や（水の流れる）河川を設けられる。",
                            "verse 71:13": "あなたがたはどうしたのか。アッラーの御親切，我慢強さに対して，望みを持たないとは。",
                            "verse 71:14": "かれは本当に順序よく段階をおってあなたがたを創られた。",
                            "verse 71:15": "あなたがたは，アッラーが7天を如何に一層また一層と，創られたかを考えてみなかったのか。",
                            "verse 71:16": "また月をその中の明りとされ，太陽を（燃える）灯明となされたかを。",
                            "verse 71:17": "アッラーはあなたがたを土から育てられ，",
                            "verse 71:18": "それから，あなたがたは大地に帰され，また起き上らせられる。",
                            "verse 71:19": "またアッラーはあなたがたのために，大地を延べ広げられ，",
                            "verse 71:20": "そこであなたがたは，広い大道を往来するであろう。』といって聞かせました。」",
                            "verse 71:21": "ヌーフは（更に）言った。「主よ，かれらはわたしに従いません。自分の財産と子女とで，破滅を助長する者にだけ従います。",
                            "verse 71:22": "そして重大な策謀を企みます。",
                            "verse 71:23": "かれらは言います。『あなたがたの神々を捨てるな。ワッドもスフーウも，またャグースもヤウークもナスルも，捨ててはならない。』",
                            "verse 71:24": "かれらは既に多くの者を迷わせました。（主よ）迷いを放任されても，不義を行う者を多くしないで下さい。」",
                            "verse 71:25": "かれらは様々な罪のために溺れさせられ，更に火獄に送られ，アッラーの外には，どんな援助者も得られなかった。",
                            "verse 71:26": "ヌーフは（祈って）言った。「主よ，不信心な居住者を誰一人として地上に残さないで下さい。",
                            "verse 71:27": "もしあなたがかれらを残されれば，かれらは必ずあなたに仕える者を迷わせ，また罪を犯す不信心な者の外，生まないでしょう。",
                            "verse 71:28": "主よ，わたしとわたしの両親を御赦し下さい。また信者としてわたしの家に入る者，また（凡ての）信仰する男と信仰する女たちを御赦し下さい。そして不義を行う者たちには，滅亡の外には（何も）加えないで下さい。」 もしあなたがかれらを残されれば，かれらは必ずあなたに仕える者を迷わせ，また罪を犯す不信心な者の外，生まないでしょう。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "실로 하나님이 노아를 그의 백성에게 보냄은 그들 위에 고통 스러운 응벌이 임하기 전에 백성 들에게 경고하고자 하셨으니",
                            "verse 71:2": "그가 말하였더라 백성들이여 실로 나는 분명한 경고자로서 너 희에게 왔노라",
                            "verse 71:3": "하나님을 경배하고 그분 만을두려워 하며 나에게 순종하라",
                            "verse 71:4": "그리하면 그분께서 너희의 잘못을 용서하사 일정 기간까지 너 희를 유예하나 실로 하나님의 유 예 기간이 이를 때면 유예될 수 없노라",
                            "verse 71:5": "그가 말하였더라 주여 저는 밤낮으로 저희 백성들을 인도하려하였습니다",
                            "verse 71:6": "그러나 믿는 자들은 증가하지 아니하고 바른 길에서 벗어나는 자들이 늘어났습니다",
                            "verse 71:7": "당신께서 그들을 용서할 것이 라 제가 말할 때마다 그들은 그들 의 손가락으로 귀를 막고 옷을 여 미며 거역하고 오만할 뿐입니다",
                            "verse 71:8": "그리하여 저는 그들에게 소리 높여 호소하였습니다",
                            "verse 71:9": "대중 앞에서도 그랬고 보이지 않게도 호소했으며",
                            "verse 71:10": "주님으로부터 용서를 구하라실로 그분은 관용으로 충만하신 분이라 말하였고",
                            "verse 71:11": "그분께서 너희에게 비를 내 리되 풍성케 하여 주시며",
                            "verse 71:12": "재산과 자손을 더하여 주시 고 과수원과 물이 흐르는 강을 너 희에게 주시는 분이시라고 하였습 니다",
                            "verse 71:13": "그런데 너희가 하나님의 위 대함을 두려워 하지 아니한 것은 어떤 일이뇨",
                            "verse 71:14": "실로 그분은 여러가지 서로 다른 단계를 거쳐 너희를 창조하 셨노라",
                            "verse 71:15": "하나님게서 층을 두어 일곱 개의 하늘을 만드신 것을 알지 못하느뇨",
                            "verse 71:16": "달을 두시매 빛을 반사케 하고 태양을 두시매 등불이 되게 하 셨노라",
                            "verse 71:17": "하나님은 초목이 성장하듯 너희를 대지위에서 성장케 했으며",
                            "verse 71:18": "그런 후 너희를 부활케 하시니라",
                            "verse 71:19": "하나님은 너희를 위하여 대 지를 융단처럼 펼쳐 주셨으니",
                            "verse 71:20": "이는 너희로 하여금 그 안의넓은 길들을 활보하도륵 함이라",
                            "verse 71:21": "노아는 계속하여 말하였더라주여 실로 그들은 저를 거역하고 그들의 재산과 자손들에게 허악만 을 끼치는 자들을 따를 뿐입니다",
                            "verse 71:22": "그들은 크나큰 음모를 꾸미며",
                            "verse 71:23": "너희 신들을 버리지 말라 왓 드도 쑤와도 그리고 야구쓰와 야 우끄 그리고 나스르 신들을 단념 해서는 아니된다고 서로가 서로에 게 말하였더라",
                            "verse 71:24": "그들은 이미 많은 무리를 유혹하였으니 주여 당신께서 더 이 상 방황하는 자들을 제외하고는 그들의 죄악을 증가하지 않도록 하여 주소서",
                            "verse 71:25": "그들의 죄악으로 말미암아 그들은 익사하였고 불지옥에 들어 가게 되었으니 하나님 외에는 그 들을 도울 자 아무도 없노라",
                            "verse 71:26": "노아가 말하였더라 주여 대 지위에 한 사람도 불신자로 버려 두지 마옵소서",
                            "verse 71:27": "당신께서 그들 중에 한 불신 자라도 남겨 두신다면 그들은 당 신의 종들을 유혹하여 사악한 자 들로 만들 것입니다",
                            "verse 71:28": "주여 저를 용서하여 주사 저 의 부모와 믿음으로 저의 집에 들 어온 자들과 믿는 사람들과 믿는 여성들을 용서하여 주시고 죄인들 에게만 벌을 증가하여 주소서"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "به‌ڕاستی ئێمه نوح مان ڕه‌وانه‌کرد بۆ لای قه‌ومه‌که‌ی، فه‌رمانمان پێدا که‌؛ قه‌ومه‌که‌ت بێدار بکه‌ره‌وه پێش ئه‌وه‌ی سزایه‌کی به ئێش یه‌خه‌یان پێبگرێت.",
                            "verse 71:2": "ئه‌ویش وتی: قه‌وم و هۆزو گه‌لم من بێگومان بێدارکه‌ره‌وه‌یه‌کی ئاشکرام بۆتان.",
                            "verse 71:3": "داواتان لێ ده‌که‌م که‌: هه‌ر خوا بپه‌رستن و له خه‌شم و قینی، خۆتان بپارێزن و فه‌رمانبه‌رداری منیش بن.",
                            "verse 71:4": "ئه‌و کاته خوا له گوناهه‌کانتان خۆش ده‌بێت و ده‌تانهێڵێته‌وه بۆ کاتێکی دیاری کراو، بێگومان کاتی دیاری کراوی خوا وه‌ختێك پێش دێت، به‌هیچ شێوه‌یه‌ك دواناکه‌وێت ئه‌گه‌ر بتانزانیایه‌.",
                            "verse 71:5": "دوای سه‌ده‌ها ساڵ بانگه‌واز نوح سکاڵای کردو وتی: په‌روه‌ردگارا من به شه‌وو به ڕۆژ بانگی قه‌وم و گه‌له‌که‌مم کرد (بۆ یه‌کخواناسی و پارێزکاری).",
                            "verse 71:6": "که‌چی بانگه‌وازه‌که‌ی من هیچی زیاد نه‌کردن؛ ته‌نها ڕاکردنیان نه‌بێت.",
                            "verse 71:7": "به‌ڕاستی من هه‌موو جارێك که بانگم ده‌کردن تا لێیان خۆش ببیت، په‌نجه‌یان ده‌خسته گوێچکه‌یانه‌وه تا نه‌بیستن، جله‌کانیان به‌سه‌ر خۆیاندا ده‌دا تا نه‌مبینن، زۆر گه‌رم بوون له‌سه‌ر بێ باوه‌ڕی و خۆیان به‌زل ده‌زانی و لووت به‌رز بوون.",
                            "verse 71:8": "پاشان من به ئاشکرا بانگم کردن و (وتارم بۆ دان).",
                            "verse 71:9": "ئینجا من به‌ڕوونی و بێ په‌رده هه‌موو شتێکم بۆ باس کردن، هه‌ندێ جاریش به‌نهێنی قسه‌م بۆ ده‌کردن (بۆ تاکه تاکه‌و خێزانه‌کانیان).",
                            "verse 71:10": "به‌رده‌وام پێم ده‌گوتن، ئێوه داوای لێخۆشبوون له په‌روه‌ردگارتان بکه‌ن چونکه به‌ڕاستی ئه‌و زاتێکی لێخۆشبووه‌.",
                            "verse 71:11": "بارانتان به لێزمه‌و خوڕه‌م بۆ ده‌بارێنێت.",
                            "verse 71:12": "ماڵ و سامان و نه‌وه‌تان پێ ده‌به‌خشێت، هاوڕێ له‌گه‌ڵ باخ و باخاتدا، ڕوبارو چه‌م و جۆگه‌تان بۆ به‌دی ده‌هێنێت.",
                            "verse 71:13": "ئه‌وه چیتانه ئێوه قه‌دری خوا نازانن، بۆ ڕێزی بۆ دانانێن و لێی ناترسن.",
                            "verse 71:14": "خۆ ئێوه پێشتر نه‌بوون؛ هه‌ر خوا خۆی به چه‌ند قۆناغدا ئێوه‌ی تێپه‌ڕاندو دروستی کردن.",
                            "verse 71:15": "ئایا سه‌رنجتان نه‌داوه چۆن خوا حه‌وت چین ئاسمانی دروست کردووه‌؟!",
                            "verse 71:16": "مانگی کردۆته هۆی ڕوناکی تیایانداو خۆریشی داگیرساندووه‌.",
                            "verse 71:17": "هه‌ر خوا خۆی ئێوه‌ی له خاکی زه‌وی به‌دیهێناوه‌و پێی گه‌یاندوون.",
                            "verse 71:18": "پاشان ده‌تانمرێنێت و ده‌تانخاته‌وه ناوی هه‌ر کاتیش بیه‌وێت ده‌رتان ده‌هێنێته‌وه‌.",
                            "verse 71:19": "هه‌ر ئه‌و خوایه زه‌وی بۆ ڕاخستوون (چۆنتان بوێت و بۆ چیتان بوێت به‌ده‌ستانه‌وه دێت)",
                            "verse 71:20": "تا (به ئاره‌زووی خۆتان) پیایدا بگه‌ڕێن له ڕێگه فراوانه‌کاندا.",
                            "verse 71:21": "سه‌رئه‌نجام، نوح نائومێد بوو بۆیه وتی: په‌روه‌ردگارا به‌ڕاستی ئه‌وان یاخی بوون لێم، شوێنی ئه‌و که‌سانه که‌وتن که ماڵ و نه‌وه‌کانیان قازانجی پێنه‌گه‌یاندن زیان نه‌بێت.",
                            "verse 71:22": "خوانه‌ناسان پیلانی گه‌وره‌و نه‌خشه‌ی سامناکیان داڕشت.",
                            "verse 71:23": "وتیان: خه‌ڵکینه نه‌که‌ن واز له خواکانتان بهێنن!! نه‌که‌ن واز له (ودو سواع و یه‌عوق و نه‌سر) بهێنن.",
                            "verse 71:24": "بێگومان ئه‌وانه زۆر که‌سیان گومڕا کرد، په‌روه‌ردگارا، ئه‌م سته‌مکارانه ته‌نها گومڕای نه‌بێت هیچی تریان بۆ زیاد مه‌که‌.",
                            "verse 71:25": "جا له سه‌رئه‌نجامی گوناهو تاوانیاندا، هۆزی ناله‌بار نوقم کران له زریانه‌که‌دا، ئینجا خرانه ناو ئاگره‌وه‌، که‌سیشیان ده‌ست نه‌که‌وت له خه‌شم و سزای خوایی په‌نایان بدات.",
                            "verse 71:26": "ئینجا نوح وتی: په‌روه‌ردگارا هیچ که‌سێك له بێ بڕوایان له‌سه‌ر زه‌ویدا مه‌هێڵه‌و تۆویان ببڕه‌.",
                            "verse 71:27": "چونکه به‌ڕاستی ئه‌گه‌ر تۆ وازیان لێ بهێنیت هه‌رچی به‌نده‌کانی تۆیه گومڕای ده‌که‌ن و که‌سیشیان لێنابێت (له نه‌وه‌ی تازه‌) مه‌گه‌ر خراپه‌کار و تاوانبار نه‌بێت.",
                            "verse 71:28": "په‌روه‌ردگارا؛ له خۆم و دایك و باوکم و ئه‌وانه خۆش ببه که دێنه ماڵم؛ به ئیمان و باوه‌ڕه‌وه‌، هه‌روه‌ها له ئیماندارانی پیاوو ئیماندارانی ئافره‌تیش خۆش ببه‌، سته‌مکارانیش ته‌نها تیاچوون نه‌بێت هیچی تر نه‌که‌یته به‌شیان."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Sesungguhnya Kami telah mengutus Nabi Nuh kepada kaumnya, (dengan berfirman kepadanya): Berikanlah peringatan dan amaran kepada kaummu sebelum mereka didatangi azab yang tidak terperi sakitnya.",
                            "verse 71:2": "Dia pun (menyeru mereka dengan) berkata: Wahai kaumku! Sesungguhnya aku ini diutus kepada kamu, sebagai pemberi ingatan dan amaran yang nyata;",
                            "verse 71:3": "Iaitu sembahlah kamu akan Allah dan bertakwalah kepadaNya, serta taatlah kamu kepadaku;",
                            "verse 71:4": "Supaya Allah mengampunkan bagi kamu sebahagian dari dosa-dosa kamu dan memberi kamu hidup (dengan tidak terkena azab) hingga ke suatu masa yang tertentu; (maka segeralah beribadat dan bertakwa) kerana sesungguhnya ajal (yang telah ditetapkan) Allah, apabila sampai masanya, tidak dapat ditangguhkan; kalaulah kamu mengetahui (hakikat ini tentulah kamu segera beriman).",
                            "verse 71:5": "(Setelah puas menyeru mereka), Nabi Nuh berdoa dengan berkata: Wahai Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam (supaya mereka beriman);",
                            "verse 71:6": "Maka seruanku itu tidak memberikan mereka (sesuatu faedah pun) selain daripada menambahi mereka melarikan diri (dari kebenaran).",
                            "verse 71:7": "Dan sesungguhnya aku, tiap-tiap kali menyeru mereka (beriman) supaya Engkau mengampunkan dosa-dosa mereka, - mereka menyumbatkan telinganya dengan jari masing-masing dan berselubung dengan pakaiannya, serta berdegil dengan keingkarannya, dan berlaku sombong takbur dengan melampau.",
                            "verse 71:8": "Kemudian aku telah menyeru mereka dengan terang-terang;",
                            "verse 71:9": "Selain dari itu, aku (berulang-ulang) menyeru mereka secara beramai-ramai dengan berterus-terang dan menyeru mereka lagi secara berseorangan dengan perlahan-lahan.",
                            "verse 71:10": "Sehingga aku berkata (kepada mereka): Pohonkanlah ampun kepada Tuhan kamu, sesungguhnya adalah Dia Maha Pengampun.",
                            "verse 71:11": "(Sekiranya kamu berbuat demikian), Dia akan menghantarkan hujan lebat mencurah-curah, kepada kamu;",
                            "verse 71:12": "Dan Dia akan memberi kepada kamu dengan banyaknya harta kekayaan serta anak-pinak; dan Dia akan mengadakan bagi kamu kebun-kebun tanaman, serta mengadakan bagi kamu sungai-sungai (yang mengalir di dalamnya).",
                            "verse 71:13": "Mengapa kamu berkeadaan tidak menghargai kebesaran Allah (dan kekuasaanNya), -",
                            "verse 71:14": "Padahal sesungguhnya Dia telah menciptakan kamu dengan kejadian yang berperingkat-peringkat?",
                            "verse 71:15": "Tidakkah kamu mengetahui dan memikirkan bagaimana Allah telah menciptakan tujuh petala langit bertingkat-tingkat,",
                            "verse 71:16": "Dan Dia menjadikan padanya bulan sebagai cahaya serta menjadikan matahari sebagai lampu (yang terang-benderang),",
                            "verse 71:17": "Dan Allah telah menumbuhkan kamu (hidup dari benda-benda yang berasal) dari bumi, dengan pertumbuhan yang sungguh-sungguh sempurna,",
                            "verse 71:18": "Kemudian Dia mengembalikan kamu ke dalam bumi (sesudah mati) dan mengeluarkan kamu daripadanya (sesudah dihidupkan semula untuk dihitung amal kamu dan diberi balasan), dengan pengeluaran yang sesungguh-sungguhnya?",
                            "verse 71:19": "Dan Allah telah menjadikan bumi bagi kamu sebagai hamparan,",
                            "verse 71:20": "Supaya kamu melalui jalan-jalan yang luas padanya.",
                            "verse 71:21": "Nabi Nuh (merayu lagi dengan) berkata: Wahai Tuhanku! Sesungguhnya, mereka telah menderhaka kepadaku dan mereka telah menurut orang yang harta bendanya dan anak-pinaknya tidak menambahinya melainkan kerugian (di akhirat kelak).",
                            "verse 71:22": "Dan mereka telah menjalankan tipu daya dengan merancangkan rancangan yang amat besar jahatnya (untuk menentang seruanku).",
                            "verse 71:23": "Dan (ketua-ketua) mereka (menghasut dengan) berkata: Jangan kamu meninggalkan (penyembahan) tuhan-tuhan kamu, terutama (penyembahan) Wadd dan Suwaa' dan Yaghuth dan Ya'uuq, serta Nasr."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "ما نوح را به سوى قومش فرستاديم و گفتيم: «قوم خود را انذار كن پيش از آنكه عذاب دردناك به سراغشان آيد!»",
                            "verse 71:2": "گفت: «اى قوم! من براى شما بيم‏دهنده آشكارى هستم،",
                            "verse 71:3": "كه خدا را پرستش كنيد و از مخالفت او بپرهيزيد و مرا اطاعت نماييد!",
                            "verse 71:4": "اگر چنين كنيد، خدا گناهانتان را مى‏آمرزد و تا زمان معينى شما را عمر مى‏دهد; زيرا هنگامى كه اجل الهى فرا رسد، تاخيرى نخواهد داشت اگر مى‏دانستيد!»",
                            "verse 71:5": "(نوح) گفت: «پروردگارا! من قوم خود را شب و روز (بسوى تو) دعوت كردم،",
                            "verse 71:6": "اما دعوت من چيزى جز فرار از حق بر آنان نيفزود!",
                            "verse 71:7": "و من هر زمان آنها را دعوت كردم كه (ايمان بياورند و) تو آنها را بيامرزى، انگشتان خويش را در گوشهايشان قرار داده و لباسهايشان را بر خود پيچيدند، و در مخالفت اصرار ورزيدند و به شدت استكبار كردند!",
                            "verse 71:8": "سپس من آنها را با صداى بلند (به اطاعت فرمان تو) دعوت كردم،",
                            "verse 71:9": "سپس آشكارا و نهان (حقيقت توحيد و ايمان را) براى آنان بيان داشتم!",
                            "verse 71:10": "به آنها گفتم: «از پروردگار خويش آمرزش بطلبيد كه او بسيار آمرزنده است",
                            "verse 71:11": "تا بارانهاى پربركت آسمان را پى در پى بر شما فرستد،",
                            "verse 71:12": "و شما را با اموال و فرزندان فراوان كمك كند و باغهاى سرسبز و نهرهاى جارى در اختيارتان قرار دهد!",
                            "verse 71:13": "چرا شما براى خدا عظمت قائل نيستيد؟!",
                            "verse 71:14": "در حالى كه شما را در مراحل مختلف آفريد (تا از نطفه به انسان كامل رسيديد)!",
                            "verse 71:15": "آيا نمى‏دانيد چگونه خداوند هفت آسمان را يكى بالاى ديگرى آفريده است،",
                            "verse 71:16": "و ماه را در ميان آسمانها مايه روشنايى، و خورشيد را چراغ فروزانى قرار داده است؟!",
                            "verse 71:17": "و خداوند شما را همچون گياهى از زمين رويانيد،",
                            "verse 71:18": "سپس شما را به همان زمين بازمى‏گرداند، و بار ديگر شما را خارج مى‏سازد!",
                            "verse 71:19": "و خداوند زمين را براى شما فرش گسترده‏اى قرار داد",
                            "verse 71:20": "تا از راههاى وسيع و دره‏هاى آن بگذريد (و به هر جا مى‏خواهيد برويد)!»",
                            "verse 71:21": "نوح (بعد از نوميدى از هدايت آنان) گفت: «پروردگارا! آنها نافرمانى من كردند و از كسانى پيروى نمودند كه اموال و فرزندانشان چيزى جز زيانكارى بر آنها نيفزوده است!",
                            "verse 71:22": "و (اين رهبران گمراه) مكر عظيمى به كار بردند",
                            "verse 71:23": "و گفتند: دست از خدايان و بتهاى خود برنداريد (به خصوص) بتهاى «ود»، «سواع‏»، «يغوث‏»، س‏خ‏للّهيعوق‏» و «نسر» را رها نكنيد!",
                            "verse 71:24": "و آنها گروه بسيارى را گمراه كردند! خداوندا، ظالمان را جز ضلالت ميفزا!»",
                            "verse 71:25": "(آرى، سرانجام) همگى بخاطر گناهانشان غرق شدند و در آتش دوزخ وارد گشتند، و جز خدا ياورانى براى خود نيافتند!",
                            "verse 71:26": "نوح گفت: «پروردگارا! هيچ يك از كافران را بر روى زمين باقى مگذار!",
                            "verse 71:27": "چرا كه اگر آنها را باقى بگذارى، بندگانت را گمراه مى‏كنند و جز نسلى فاجر و كافر به وجود نمى‏آورند!",
                            "verse 71:28": "پروردگارا! مرا، و پدر و مادرم و تمام كسانى را كه با ايمان وارد خانه من شدند، و جميع مردان و زنان باايمان را بيامرز; و ظالمان را جز هلاكت ميفزا!»"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Em verdade, enviamos Noé ao seu povo, (dizendo-lhe): Admoesta o teu povo, antes que o açoite um castigo doloroso!",
                            "verse 71:2": "Disse: Ó povo meu, em verdade, sou um elucidativo admoestador para vós",
                            "verse 71:3": "Adorai a Deus, temei-O e obedecei-me.",
                            "verse 71:4": "Ele vos absolverá os pecados e vos concederá um prazo, até um término prefixado, porque quando chegar a hora do término prescrito por Deus, este não será prorrogado.",
                            "verse 71:5": "(Noé) disse: Ó Senhor meu, tenho predicado ao meu povo noite e dia;",
                            "verse 71:6": "Porém, a minha predicação não fez outro, coisa senão aumentar o afastamento deles (da verdade).",
                            "verse 71:7": "E cada vez que os convocava ao arrependimento, para que Tu os perdoasses, tapavam os ouvidos com os dedos e se envolviam com as suas vestimentas, obstinando-se no erro e ensoberbecendo-se grotescamente.",
                            "verse 71:8": "Então, convoquei-os altissonantemente;",
                            "verse 71:9": "Depois os exortei palatina e privativamente,",
                            "verse 71:10": "Dizendo-lhes: Implorai o perdão do vosso Senhor, porque é Indulgentíssimo;",
                            "verse 71:11": "Enviar-vos-á do céu copiosas chuvas,",
                            "verse 71:12": "Aumentar-vos-á os vossos bens e filhos, e vos concederá jardins e rios.",
                            "verse 71:13": "Que vos sucede, que não depositais as vossas esperanças em Deus,",
                            "verse 71:14": "Sendo que Ele vos criou gradativamente?",
                            "verse 71:15": "Não reparastes em como Deus criou sete céus sobrepostos,",
                            "verse 71:16": "E colocou neles a lua reluzente e o sol, como uma lâmpada?",
                            "verse 71:17": "E Deus vos produziu da terra, paulatinamente.",
                            "verse 71:18": "Então, vos fará retornar a ela, e vos fará surgir novamente.",
                            "verse 71:19": "Deus vos fez a terra como um tapete,",
                            "verse 71:20": "Para que a percorrêsseis por amplos caminhos.",
                            "verse 71:21": "Noé disse: Ó Senhor meu, eles me desobedeceram e seguiram aqueles para os quais os bens o filhos não fizeram mais do que lhes agravar a desventura!",
                            "verse 71:22": "E conspiraram enormemente (contra Noé).",
                            "verse 71:23": "E disseram (uns com os outros): Não abandoneis os vossos deuses, nem tampouco abandoneis Wadda, nem Sua’a, nem Yaguça, nem Ya’uca, nem Nassara,",
                            "verse 71:24": "Apesar de estes haverem extraviado muitos, se bem que Tu, ó Senhor meu, não aumentarás em nada os iníquos, senão em extravio.",
                            "verse 71:25": "Foram afogados pelos seus pecados, serão introduzidos no fogo infernal e não encontrarão, para si, socorredores, além de Deus.",
                            "verse 71:26": "E Noé disse: Ó Senhor meu, não deixeis sobre a terra nenhum dos incrédulos.",
                            "verse 71:27": "Porque, se deixares, eles extraviarão os Teus servos, e não gerarão senão os libertinos, ingratos.",
                            "verse 71:28": "Ó Senhos meu, perdoa-me a mim, aos meus pais e a todo fiel que entrar em minha casa, assim como também aos fiéis e às fiéis, e não aumentes em nada os iníquos, senão em perdição."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 71:1": "Noi l-am trimis pe Noe la neamul sãu, :",
                            "verse 71:2": "“Îndeamnã neamul tãu, înainte de a se abate asupra lui o osândã dureroasã!”",
                            "verse 71:3": "A zis el: \"O, neam al meu! Eu sunt pentru voi un prevenitor limpede,",
                            "verse 71:4": "Adorați-L pe Allah, fiți cu fricã de El și dați-mi ascultare!",
                            "verse 71:5": "El vã va ierta o parte din pãcatele voastre și vã va da vouã rãgazpânã la un termen hotãrât.",
                            "verse 71:6": "El a zis: \"Doamne, eu am chemat neamul meu , noaptea și ziua ,",
                            "verse 71:7": "Însã chemarea mea nu a fãcut decât sã le sporeascã fuga.",
                            "verse 71:8": "Și de câte ori i-am chemat ca sã le ierți lor, ei și-au vârât degeteleîn urechi, s-au înfãșurat în veșmintele lor și au stãruit și s-au arãtat cu mare trufie;",
                            "verse 71:9": "Apoi i-am chemat cu glas tare;",
                            "verse 71:10": "Apoi le-am vorbit lor deschis și le-am vorbit lor în tainã",
                            "verse 71:11": "Și le-am zis lor: \"Rugați-vã de iertare Domnului vostru, cãci El este Iertãtor ,",
                            "verse 71:12": "Pentru ca El sã trimitã asupra voastrã cerul cu ploaie din belșug",
                            "verse 71:13": "Și pentru ca sã vã dãruiascã vouã averi și copii și sã vã dea vouã grãdini și sã vã dea vouã pâraie!",
                            "verse 71:14": "Ce este cu voi cã nu vã rugați lui Allah, așa cum se cuvine,",
                            "verse 71:15": "Dupã ce El v-a creat pe voi în [mai multe] faze?",
                            "verse 71:16": "Oare nu ați vãzut voi cum a creat Allah șapte ceruri, unul peste altul",
                            "verse 71:17": "Și a fãcut Luna sã le fie lor luminã și a fãcut Soarele ca o candelã?",
                            "verse 71:18": "Allah v-a fãcut pe voi sã rãsãriți asemenea ierburilor, din pãmânt ,",
                            "verse 71:19": "Apoi vã va aduce pe voi înapoi la el și vã va face sã ieșiți cuadevãrat.",
                            "verse 71:20": "Și Allah v-a fãcut vouã pãmântul ca un covor,",
                            "verse 71:21": "Pentru ca voi sã umblați pe el, pe cãrãri largi!\"",
                            "verse 71:22": "Noe a zis: \"Doamne, ei s-au arãtat cu nesupunere fațã de mine șiîl urmeazã pe acela ale cãrui averi și ai cãrui copii nu fac decât sã-isporeascã pierderea!",
                            "verse 71:23": "Și ei au nãscocit un vicleșug prea mare",
                            "verse 71:24": "Și au zis: \"Nu-i pãrãsiți niciodatã pe zeii voștri! Nu-i pãrãsiți nicio- datã pe Wadd și pe Suwa' și pe Yaguth și pe Ya'uq și pe Nasr! \"",
                            "verse 71:25": "Ei i-au adus pe mulți în rãtãcire.",
                            "verse 71:26": "nu le spori nelegiuiților decât rãtãcirea!",
                            "verse 71:27": "Din pricina pãcatelor lor ei au fost înecați și vor fi duși sã intreîn Foc și nu au aflat pentru ei ajutoare afarã de Allah!\"",
                            "verse 71:28": "Și Noe a zis: \"Doamne, nu lãsa pe pãmânt nici un sãlãșluitor într-o casã, dintre necredincioși ,",
                            "verse 71:29": "Cãci, dacã-i vei lãsa [în viațã], ei îi vor duce în rãtãcire pe robii Tãiși nu vor zãmisli decât pãcãtoși necredincioși!",
                            "verse 71:30": "Doamne! Iartã-mã pe mine și pe pãrinții mei și pe cel care intrãîn casa mea cu credințã, ca și pe dreptcredincioși și pe dreptcre- dincioase, și nu le spori nelegiui& necredincioși!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 71:1": "Noi l-am trimis pe Noe poporului său: “Previne-ţi poporul înainte să-i vină o dureroasă osândă!”",
                            "verse 71:2": "El spuse: “O, popor al meu! Eu vouă vă sunt predicator limpede la vorbă.",
                            "verse 71:3": "Închinaţi-vă lui Dumnezeu! Temeţi-vă de El! Daţi-i ascultare!",
                            "verse 71:4": "El vă iartă vouă din păcatele voastre şi vă dă vouă un răgaz până la un anumit soroc.",
                            "verse 71:5": "El spuse: “Domnul meu! Eu mi-am chemat poporul noapte şi zi,",
                            "verse 71:6": "însă chemarea mea mai mult i-a pus pe fugă.",
                            "verse 71:7": "De fiece dată când i-am chemat ca Tu să le ierţi lor, ei şi-au băgat degetele în urechi, s-au înfăşurat în veşmintele lor şi s-au înverşunat arătându-se plini de mândrie.",
                            "verse 71:8": "I-am chemat răspicat.",
                            "verse 71:9": "Le-am spus pe faţă şi în taină.",
                            "verse 71:10": "Le-am spus: “Cereţi-i iertare Domnului vostru, căci El este Iertător.",
                            "verse 71:11": "El vă va trimite vouă, din cer, multă ploaie.",
                            "verse 71:12": "El vă va spori averile şi numărul fiilor şi vă va da grădini şi râuri.",
                            "verse 71:13": "De ce nu aşteptaţi de la Dumnezeu ceva vrednic de El.",
                            "verse 71:14": "El este Cel ce v-a creat rând pe rând.",
                            "verse 71:15": "N-aţi văzut cum Dumnezeu a creat cele şapte ceruri aşezate unul asupra celuilalt?",
                            "verse 71:16": "Şi a făcut luna în ele precum o lumină şi soarele precum un opaiţ.",
                            "verse 71:17": "Dumnezeu v-a făcut să răsăriţi din pământ precum ierburile,",
                            "verse 71:18": "apoi vă va înapoia în el ca să vă scoată deodată.",
                            "verse 71:19": "Dumnezeu v-a făcut vouă pământul covor",
                            "verse 71:20": "ca voi să-l străbateţi pe drumuri largi.",
                            "verse 71:21": "Noe spuse: “Domnul meu! Ei nu m-au ascultat şi l-au urmat pe cel ale cărui bogăţii şi fii nu fac decât să-i apropie pierzania.",
                            "verse 71:22": "Ei au viclenit şi au spus:",
                            "verse 71:23": "“Nu-i părăsiţi niciodată pe dumnezeii voştri! Nu-i părăsiţi pe Wadd, şi nici pe Suwa’, şi nici pe Yaghut, şi nici pe Ya’uq, şi nici pe Nasr!”",
                            "verse 71:24": "Aceştia au rătăcit mulţi oameni.",
                            "verse 71:25": "Ei au fost înecaţi şi aruncaţi în Foc pentru păcatele lor şi nu aflară nici un ajutor afară de Dumnezeu.",
                            "verse 71:26": "Noe spuse: “Domnul meu! Nu lăsa pe pământ nici un locuitor dintre tăgăduitori.",
                            "verse 71:27": "Dacă îi laşi, ei îi vor rătăci pe robii Tăi şi nu vor zămisli decât desfrânaţi mult-tăgăduitori.",
                            "verse 71:28": "Domnul meu! Iartă-mi mie şi părinţilor mei, precum şi celui ce intră, credincios, în casa mea, credincioşilor şi credincioaselor."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Послали Ну –ха Мы к его народу:«Ты свой народ увещевай,Пока к ним не пришла мучительнаякара».",
                            "verse 71:2": "Он им сказал:«О мой народ!Я — увещатель ваш,Кто с ясной (миссией к вам послан),",
                            "verse 71:3": "Чтоб поклонялись вы Аллаху,И Божьего страшились гнева,И, повинуясь, слушали меня.",
                            "verse 71:4": "Тогда простит Он ваши прегрешеньяИ даст отсрочку вам (в сей жизни)До срока, что назначен Им.",
                            "verse 71:5": "И (Ну–х) сказал:«О мой Господь!Я звал к Тебе народ свой днеми ночью,",
                            "verse 71:6": "Но мой призыв лишь дальше удалилих (от Тебя).",
                            "verse 71:7": "И всякий раз, когда я к ним взывал,Чтоб мог Ты им грехи простить,Они втыкали пальцы в уши,В одежды (плотно) закрывались,Упорствуя (в грехах) с надменноюгордыней.",
                            "verse 71:8": "Но и тогда я их открыто призывал.",
                            "verse 71:9": "Затем я обращался к ним на людяхИ тайно (в личных разговорах).",
                            "verse 71:10": "Я (им) сказал:„Молите вашего Владыкуо прощенье, —Ведь всепрощающ Он!",
                            "verse 71:11": "Он (с неба) вам обильный дождьпошлет,",
                            "verse 71:12": "И увеличит ваше достоянье,И ниспошлет вам больше сыновей,Сады устроит и обильно реки изольет.",
                            "verse 71:13": "Что же не чтите вы величия АллахаДостойным почитаньем?",
                            "verse 71:14": "Ведь Он (назначил очередность) вамРазличных стадий сотворенья2270а.",
                            "verse 71:15": "Ужель не видите вы, как АллахПостроил семь небес рядами,",
                            "verse 71:16": "Меж ними свет луны пролилИ солнце в качестве светильникапоставил?",
                            "verse 71:17": "Аллах взрастил вас из земли растеньем,",
                            "verse 71:18": "И вновь в нее вас возвратит,И вновь вас изведет оттуда.",
                            "verse 71:19": "Аллах ковром вам землю постелил,",
                            "verse 71:20": "Чтоб вы по ней просторнымидорогами ходили“».",
                            "verse 71:21": "И Ну–х сказал:«О мой Господь!Меня ослушались они и устремилисяза теми,Чьи достояния и дети лишь отягчаютих потери.",
                            "verse 71:22": "И хитрость (тяжкую) задумали они,",
                            "verse 71:23": "(Друг другу) говоря:“Вы никаких богов своихне оставляйте:Ни Вадда, ни Совага, ни Йагуса,ни Йаука и ни Насра“2271.",
                            "verse 71:24": "Они с пути уж многих сбили.",
                            "verse 71:25": "За их грехи они потопленыи введены в Огонь —И не нашли себе иного покровителя,опричь Аллаха.",
                            "verse 71:26": "И Ну–х сказал:«О мой Господь!Не сохрани на сей земле (под кровом)Ни одного (упрямого) неверца",
                            "verse 71:27": "Коль Ты оставишь хоть кого-нибудьиз них,Они в Твоих служителях посеют смутуИ никого не смогут породить,Кроме неверных и распутных.",
                            "verse 71:28": "О мой Господь! Прости моимродителям, и мне,И всем, кто в дом мой верующимвступит,Всем верующим девам и мужам."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Enviamos a Noé a su pueblo: «¡Advierte a tu pueblo antes de que le alcance un castigo doloroso!»",
                            "verse 71:2": "Dijo: «¡Pueblo! Soy para vosotros un monitor que habla claro.",
                            "verse 71:3": "¡Servid a Alá y temedle! ¡Y obedecedme!",
                            "verse 71:4": "Así, os perdonará vuestros pecados y os remitirá a un plazo fijo.",
                            "verse 71:5": "Dijo: «¡Señor! He llamado a mi pueblo noche y día.",
                            "verse 71:6": "Mi llamamiento sólo ha servido para que huyan más.",
                            "verse 71:7": "Siempre que les llamo para que Tú les perdones, se ponen los dedos en los oídos, se cubren con la ropa, se obstinan y se muestran en extremo altivos.",
                            "verse 71:8": "Además, les he llamado abiertamente",
                            "verse 71:9": "y les he hablado en público y en secreto.",
                            "verse 71:10": "Y he dicho: '¡Pedid perdón a vuestro Señor -Que es indulgente-",
                            "verse 71:11": "y enviará sobre vosotros del cielo una lluvia abundante!",
                            "verse 71:12": "Os dará mucha hacienda e hijos varones.",
                            "verse 71:13": "¿Qué os pasa, que no esperáis de Alá magnanimidad,",
                            "verse 71:14": "habiéndoos creado en fases?",
                            "verse 71:15": "¿No habéis visto cómo ha creado Alá siete cielos superpuestos",
                            "verse 71:16": "y puesto en ellos la luna como luz y el sol como lámpara?",
                            "verse 71:17": "Alá os ha hecho crecer de la tierra como plantas.",
                            "verse 71:18": "Después, os hará volver a ella, y os sacará.",
                            "verse 71:19": "Alá os ha puesto la tierra como alfombra",
                            "verse 71:20": "para que recorráis en ella caminos, anchos pasos'».",
                            "verse 71:21": "Noé dijo: «¡Señor! Me han desobedecido y han seguido a aquéllos cuya hacienda e hijos no hacen sino perderles más.",
                            "verse 71:22": "Han perpetrado una enorme intriga.",
                            "verse 71:23": "Y dicen: '¡No abandonéis a vuestros dioses! ¡No abandonéis a Wadd, ni a Suwaa, ni a Yagut, a Yauq y a Nasr!'",
                            "verse 71:24": "Han extraviado a muchos.",
                            "verse 71:25": "Por sus pecados, fueron anegados e introducidos en un Fuego.",
                            "verse 71:26": "Noé dijo: «¡Señor! ¡No dejes en la tierra a ningún infiel con vida!",
                            "verse 71:27": "Si les dejas, extraviarán a Tus siervos y no engendrarán sino a pecadores, infieles pertinaces.",
                            "verse 71:28": "¡Señor! ¡Perdónanos, a mi y a mis padres, a quien entre en mi casa como creyente, a los creyentes y a las creyentes! Y a los impíos ¡no hagas sino perderles más!»"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "நிச்சயமாக நாம் நூஹை, அவருடைய சமூகத்தாரிடம்; \"நீர் உம் சமூகத்தாருக்கு நோவினை செய்யும் வேதனை அவர்கள் மீது வருவதற்கு முன்னர் (அதுபற்றி) அச்சமூட்டி எச்சரிக்கை செய்வீராக\" என (ரஸூலாக) அனுப்பினோம்.",
                            "verse 71:2": "\"என் சமூகத்தார்களே! நிச்சயமாக நான் உங்களுக்கு பகிரங்கமாக அச்சமூட்டி எச்சரிக்கை செய்பவன்\" என்று கூறினார்.",
                            "verse 71:3": "\"அல்லாஹ்வையே நீங்கள் வணங்குங்கள்; அவனுக்கு அஞ்சிக் கொள்ளுங்கள்; எனக்கும் வழிபடுங்கள்.",
                            "verse 71:4": "\"(இவ்வாறு நீங்கள் நடந்தால்) உங்களுடைய பாவங்களை அவன் மன்னிப்பான்; மேலும் ஒரு குறிப்பிட்ட தவணைவரை அவன் உங்களுக்கு அவகாசமளிப்பான்; நிச்சயமாக அல்லாஹ்வின் தவணை வரும்போது, அது பிற்படுத்தப்படமாட்டாது - (இதை) நீங்கள் அறிந்து கொண்டவர்களாக இருந்தால்\" (என்றும் கூறினார்).",
                            "verse 71:5": "பின்னர் அவர், \"என் இறைவா! நிச்சயமாக, நான் என் சமூகத்தாரை இரவிலும், பகலிலும் (நேர்வழியின்பால்) அழைத்தேன்.",
                            "verse 71:6": "\"ஆனால் என் அழைப்பு அவர்கள் (நேர்வழியிலிருந்து) வெருண்டு ஓடுதலை அதிகரித்ததல்லாமல் வேறில்லை.",
                            "verse 71:7": "\"அன்றியும்; நீ அவர்களுக்கு மன்னிப்பு அளிப்பதற்காக, (உன் பக்கம்) நிச்சயமாக அவர்களை நான் அழைத்தபோதெல்லாம், தம் காதுகளில் தம் விரல்களை வைத்துக் கொண்டனர், மேலும், தங்களைத் தம் ஆடைகளைக் கொண்டு மூடிக் கொண்டனர், அன்றியும், அவர்கள் (தம் வழிகேட்டில்) பிடிவாதமாகவும்; பெரும் மமதை பெருமையடித்துக் கொள்வோராகவுமே இருக்கிறார்கள்.",
                            "verse 71:8": "\"பின்னர், நிச்சயமாக நான் அவர்களை சப்தமாக அழைத்(தும் போதித்)தேன்.",
                            "verse 71:9": "\"அதன் பின்னர், நிச்சயமாக நான் அவர்களிடம் பகிரங்கமாகவும் பேசினேன்; இரகசியமாக அந்தரங்கத்திலும் பேசினேன்.",
                            "verse 71:10": "மேலும், \"நீங்கள் உங்களுடைய இறைவனிடம் மன்னிப்புத் தேடுங்கள்; நிச்சயமாக அவன் மிகவும் மன்னிப்பவன்\" என்றுங் கூறினேன்.",
                            "verse 71:11": "\"(அப்படிச் செய்வீர்களாயின்) அவன் உங்கள் மீது தொடர்ந்து மழையை அனுப்புவான்.",
                            "verse 71:12": "\"அன்றியும் அவன் உங்களுக்குப் பொருள்களையும், புதல்வர்களையும் கொண்டு உதவி செய்வான்; இன்னும், உங்களுக்காகத் தோட்டங்களை உண்டாக்குவான்; உங்களுக்காக ஆறுகளையும் (பெருக்கெடுத்து ஓடுமாறு) உண்டாக்குவான்.",
                            "verse 71:13": "\"உங்களுக்கு என்ன நேர்ந்தது? அல்லாஹ்வின் மகத்துவத்தை(யும், மேன்மையையும்) நீங்கள் உணராமலிருக்கின்றீர்கள்.",
                            "verse 71:14": "\"நிச்சயமாக அவன் உங்களை பல நிலைகளிலிருந்து படைத்தான்.",
                            "verse 71:15": "\"ஏழு வானங்களையும் அல்லாஹ் அடுக்கடுக்காய் எப்படிப் படைத்திருக்கின்றான் என்பதை நீங்கள் பார்க்கவில்லையா?",
                            "verse 71:16": "\"இன்னும் அவற்றில் சந்திரனைப் பிரகாசமாகவும், சூரியனை ஒளிவிளக்காகவும் அவனே ஆக்கியிருக்கின்றான்.",
                            "verse 71:17": "\"அல்லாஹ்வே உங்களை பூமியிலிருந்து சிறந்த முறையில் உருவாக்கினான்.",
                            "verse 71:18": "\"பின்னர் அந்த பூமியிலேயே உங்களை மீண்டும் சேர்த்து, மற்றொருமுறை உங்களை (அதிலிருந்து) வெளிப்படுத்துவான்.",
                            "verse 71:19": "\"அன்றியும், அல்லாஹ், உங்களுக்காக பூமியை விரிப்பாக ஆக்கினான்.",
                            "verse 71:20": "\"அதில் நீங்கள் செல்வதற்காக விசாலமான பாதைகளையும் அமைத்தான்\" (என்றும் போதித்தார்).",
                            "verse 71:21": "நூஹ் கூறினார்: \"என் இறைவா! நிச்சயமாக அவர்கள் எனக்கு மாறு செய்கின்றனர், அன்றியும், எவர்களுக்கு அவர் பொருளும், அவர் மக்களும் நஷ்டத்தையன்றி (வேறு எதையும்) அதிகரிக்கவில்லையோ, அ(த்தகைய)வர்களையே அவர்கள் பின்பற்றுகின்றனர்.",
                            "verse 71:22": "\"மேலும் (எனக்கெதிராகப்) பெரும் சூழ்ச்சியாகச் சூழ்ச்சி செய்கின்றனர்.",
                            "verse 71:23": "மேலும் அவர்கள்; \"உங்கள் தெய்வங்களை விட்டுவிடாதீர்கள்; இன்னும் வத்து, ஸுவாஉ, யகூஸு, யஊக், நஸ்ரு ஆகியவற்றை நிச்சயமாக நீங்கள் விட்டுவிடாதீர்கள்\" என்றும் சொல்கின்றனர்.",
                            "verse 71:24": "\"நிச்சயமாக அவர்கள் அநேகரை வழிகெடுத்துவிட்டனர், ஆகவே இவ்வநியாயக் காரர்களுக்கு வழி கேட்டைத் தவிர, வேறு எதையும் நீ அதிகப்படுத்தாதே.",
                            "verse 71:25": "ஆகவே, அவர்கள் தம் பாவங்களினால் மூழ்கடிக்கப்பட்டு, பின்னால் நரக நெருப்பிலும் புகுத்தப்பட்டனர்.",
                            "verse 71:26": "அப்பால் நூஹ் கூறினார்: \"என் இறைவா! பூமியின் மீது இக்காஃபிர்களில் எவரையும் நீ வசித்திருக்க விட்டு விடாதே.",
                            "verse 71:27": "\"நிச்சயமாக நீ அவர்களை விட்டு வைப்பாயானால்.",
                            "verse 71:28": "\"என் இறைவா! எனக்கும், என் பெற்றோருக்கும், என் வீட்டில் நம்பிக்கையாளர்களாகப் பிரவேசித்தவர்களுக்கும், முஃமினான ஆண்களுக்கும், முஃமினான பெண்களுக்கும், நீ மன்னிப்பளிப்பாயாக! மேலும், அநியாயக்காரர்களுக்கு அழிவையேயல்லாது (வேறு எதையும்) நீ அதிகரிக்காதே\" (என்றும் கூறினார்)."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "แท้จริงเราได้ส่งนูห์ไปยังหมู่ชนของพวกเขา (โดยบัญชาว่า) เจ้าจงตักเตือนหมู่ชนของเจ้า ก่อนที่การลงโทษอันเจ็บปวดจะมาถึงพวกเขา",
                            "verse 71:2": "เขากล่าวว่า โอ้หมู่ชนของฉันเอ๋ย แท้จริงฉันคือผู้ตักเตือนอันชัดแจ้งของพวกท่าน",
                            "verse 71:3": "พวกท่านจงเคารพภักดีอัลลอฮ์เถิด และจงยำเกรงพระองค์ และลงเชื่อฟังปฏิบัติตามฉัน",
                            "verse 71:4": "พระองค์จะทรงอภัยโทษให้แก่พวกท่านในความผิดของพวกท่าน และจะทรงผ่อนผัน พวกท่านจนกระทั่งถึงวาระที่ถูกกำหนดไว้ แท้จริงวาระของอัลลอฮ์นั้น เมื่อมาถึงแล้วมันจะไม่ยืดเวลาต่อไปอีก หากพวกท่านได้รู้",
                            "verse 71:5": "เขากล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ แท้จริงข้าพระองค์ได้เรียกร้องเชิญชวนหมู่ชนของข้าพระองค์ทั้งกลางคืนและกลางวัน",
                            "verse 71:6": "แต่การเรียกร้องเชิญชวนของข้าพระองค์มิได้เพิ่มพูนสิ่งใดแก่เขา นอกจากการหลบหนี",
                            "verse 71:7": "และแท้จริงทุกครั้งที่ข้าพระองค์เรียกร้องเชิญชวนพวกเขาเพื่อที่พระองค์ท่านจะได้อภัยโทษให้แก่พวกเขา พวกเขาก็เอานิ้วอุดรูหูของพวกเขา และเอาเสื้อผ้าของพวกเขาคลุมโปง และพวกเขายังดื้อรั้น และหยิ่งยโสด้วยความจองหอง",
                            "verse 71:8": "ครั้นแล้วข้าพระองค์ได้เรียกร้องเชิญชวนพวกเขาอย่างเปิดเผย",
                            "verse 71:9": "และข้าพระองค์ได้ประกาศแก่พวกเขาอย่างเปิดเผย อีกทั้งข้าพระองค์ยังได้บอกกล่าวแก่พวกเขาอย่างลับๆอีกด้วย",
                            "verse 71:10": "ข้าพระองค์ได้กล่าวว่า พวกท่านจงขออภัยโทษต่อพระเจ้าของพวกท่านเถิด เพราะแท้จริงพระองค์ทรงเป็นผู้ทรงอภัยโทษอย่างแท้จริง",
                            "verse 71:11": "พระองค์จะทรงหลั่งน้ำฝนอย่างมากมายแก่พวกท่าน",
                            "verse 71:12": "และพระองค์จะทรงเพิ่มพูนทรัพย์สินและลูกหลานแก่พวกท่าน และจะทรงทำให้มีส่วนมากหลายแก่พวกท่าน และจะทรงทำให้มีลำน้ำมากหลายแก่พวกท่าน",
                            "verse 71:13": "ทำไมพวกท่านถึงไม่สำนึกถึงความยิ่งใหญ่ของอัลลอฮ์",
                            "verse 71:14": "และโดยแน่นอน พระองค์ทรงสร้างพวกท่านตามลำดับขั้นตอน",
                            "verse 71:15": "พวกเจ้าไม่เห็นดอกหรือ ว่าพระองค์ทรงสร้างชั้นฟ้าทั้งเจ็ดเป็นชั้นๆอย่างไร",
                            "verse 71:16": "และพระองค์ทรงทำให้ดวงจันทร์ในชั้นฟ้าเหล่านั้นมีแสงสว่าง และทรงทำให้ดวงอาทิตย์มีแสงจ้า",
                            "verse 71:17": "และอัลลอฮ์ทรงบังเกิดพวกท่านมาจากแผ่นดินเช่นพืชผัก",
                            "verse 71:18": "และทรงทำให้พวกท่านกลับคืนสู่แผ่นดิน และจะทรงให้พวกท่านออกมาอีกเพื่อฟื้นคืนชีพ",
                            "verse 71:19": "และอัลลอฮ์ทรงทำให้แผ่นดินนี้ราบเรียบกว้างใหญ่สำหรับพวกท่าน",
                            "verse 71:20": "เพื่อพวกท่านจะได้สัญจรไปมาตามพื้นที่โล่งกว้างนั้น",
                            "verse 71:21": "นูห์ได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ แท้จริงพวกเขาได้ฝ่าฝืนข้าพระองค์ และเชื่อฟังผู้ที่ทรัพย์สินของเขา และลูกหลานของเขามิได้เพิ่มพูนอันใดแก่พวกเขา นอกจากการขาดทุน",
                            "verse 71:22": "และพวกเขาได้วางแผนร้ายอันยิ่งใหญ่",
                            "verse 71:23": "และพวกเขาได้กล่าวว่า พวกท่านอย่าได้ทอดทิ้งพระเจ้าทั้งหลายของพวกท่านเป็นอันขาด พวกท่านอย่าได้ทอดทิ้งวัดดฺ และสุวาอ์ และยะฆูษ และยะอู๋ก และนัซรฺ เป็นอันขาด",
                            "verse 71:24": "และโดยแน่นอน พวกเขาได้ทำให้หมู่ชนจำนวนมากหลง ดังนั้นขอพระองค์ท่านอย่าได้เพิ่มอันใดแก่พวกอธรรมเหล่านั้น นอกจากการหลงผิดเท่านั้น",
                            "verse 71:25": "อันเนื่องมาจากความผิดอันมากหลายของพวกเขา พวกเขาจึงถูกจมน้ำตาย และจะถูกให้เข้าอยู่ในไฟนรก ดังนั้นพวกเขาจะไม่ได้พบผู่ชวยเหลือสำหรับพวกเขาอื่นนอกจากอัลลอฮ์",
                            "verse 71:26": "และนัวหฺได้กล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ ขอพระองค์ทรงอย่าปล่อยให้พวกปฏิเสธศรัทธาหลงเหลืออยู่ในแผ่นดินนี้เลย",
                            "verse 71:27": "เพราะแท้จริง หากพระองค์ทรงปล่อยให้พวกเขาหลงเหลืออยู่ พวกเขาก็จะทำให้ปวงบ่าวของพระองค์หลงผิด และพวกเขานั้นจะให้กำเนิดแต่พวกเลวทราม พวกปฏิเสธศรัทธาเท่านั้น",
                            "verse 71:28": "ข้าแต่พวกเจ้าของข้าพระองค์ ขอทรงอภัยโทษให้แก่ข้าพระองค์ และพ่อแม่ของข้าพระองค์ และผู้ที่เข้ามาในบ้านของข้าพระองค์เป็นผู้ศรัทธา และบรรดาผู้ศรัทธาชาย และบรรดาผู้ศรัทธาหญิง และพระองค์ท่านอย่าได้เพิ่มอันใดแก่พวกอธรรมเหล่านั้น นอกจากความพินาศหายนะเท่านั้น"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Kendilerine yakıcı bir azap gelmeden önce kavmini uyar, diye Nuh'u kendi kavmine gönderdik.",
                            "verse 71:2": "\"Ey",
                            "verse 71:3": "kavmim dedi,ben sizin için açık bir uyarıcıyım\"",
                            "verse 71:4": "\"Allah'a kulluk edin; O'na karşı gelmekten sakının ve bana itaat edin.",
                            "verse 71:5": "\"Ki Allah bir kısım günahlarınızı bağışlasın ve sizi belli bir vâdeye kadar tehir etsin (muahaze etmeden yaşatsın)\" Bilinmeli ki Allah'ın tayin ettiği vâde gelince, artık o ertelenmez.",
                            "verse 71:6": "(Sonra Nuh:) Rabbim! dedi, doğrusu ben kavmimi gece gündüz (imana) davet ettim;",
                            "verse 71:7": "Fakat benim davetim, ancak kaçmalarını arttırdı.",
                            "verse 71:8": "Gerçekten de, (imana gelmeleri ve böylece) günahlarını bağışlaman için onları ne zaman davet ettiysem, parmaklarını kulaklarına tıkadılar, (beni görmemek için) elbiselerine büründüler, ayak dirediler, kibirlendikçe kibirlendiler.",
                            "verse 71:9": "Sonra, ben kendilerine haykırarak davette bulundum.",
                            "verse 71:10": "Sonra, onlarla hem açıktan açığa hem de gizli gizli konuştum.",
                            "verse 71:11": "Dedim ki : Rabbinizden mağfiret dileyin; çünkü O çok bağışlayıcıdır.",
                            "verse 71:12": "(Mağfiret dileyin ki,) üzerinize gökten bol bol yağmur indirsin,",
                            "verse 71:13": "Mallarınızı ve oğullarınızı çoğaltsın, size bahçeler ihsan etsin, sizin için ırmaklar akıtsın.",
                            "verse 71:14": "Size ne oluyor ki, Allah'a büyüklüğü yakıştıramıyorsunuz?",
                            "verse 71:15": "Oysa, sizi türlü merhalelerden geçirerek O yaratmıştır.",
                            "verse 71:16": "Görmediniz mi, Allah yedi göğü birbiriyle ahenktar olarak nasıl yaratmış!",
                            "verse 71:17": "Onların içinde ayı bir nûr kılmış, güneşi de bir çerağ yapmıştır.",
                            "verse 71:18": "Allah, sizi de yerden ot (bitirir) gibi bitirmiştir.",
                            "verse 71:19": "Sonra sizi yine oraya döndürecek ve sizi yeniden çıkaracaktır.",
                            "verse 71:20": "\"Allah,yeryüzünü sizin için bir sergi yapmıştır.",
                            "verse 71:21": "\"Ki, onda geniş yollar edinip dolaşabilesiniz.",
                            "verse 71:22": "(Öğütlerinin fayda vermemesi üzerine) Nuh: Rabbim! dedi, doğrusu bunlar bana karşı geldiler de, malı ve çocuğu kendi ziyanını arttırmaktan başka işe yaramayan kimseye uydular.",
                            "verse 71:23": "Bunlar da, büyük hileler, büyük desiseler kurdular!",
                            "verse 71:24": "Ve dediler ki: Sakın ilâhlarınızı bırakmayın; hele Ved'den, Suvâ'dan, Yeğûs'tan, Ye'ûk'tan ve Nesr'den asla vazgeçmeyin!",
                            "verse 71:25": "(Böylece) onlar gerçekten birçoklarını saptırdılar.",
                            "verse 71:26": "Bunlar, günahları yüzünden suda boğuldular, ardından da ateşe sokuldular ve o zaman Allah'a karşı yardımcılar da bulamadılar.",
                            "verse 71:27": "Nuh: \"Rabbim! dedi, yeryüzünde kâfirlerden hiç kimseyi bırakma!\"",
                            "verse 71:28": "\"Çünkü sen onları bırakırsan kullarını saptırırlar; yalnız ahlâksız, nankör (insanlar) doğururlar (yetiştirirler).",
                            "verse 71:29": "\"Rabbim! Beni, ana-babamı, iman etmiş olarak evime girenleri, iman eden erkekleri ve iman eden kadınları bağışla, zalimlerin de ancak helâkini arttır."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "بے شک ہم نے نوح (عليہ السلام) کو ان کي قوم کي طرف بھيجا کہ آپ اپني قوم کو ڈرائيں قبل اس کے کہ اُنہيں دردناک عذاب آپہنچےo",
                            "verse 71:2": "ہم نے نوح کو ان کی قوم کی طرف بھیجا کہ پیشتر اس کے کہ ان پر درد دینے والا عذاب واقع ہو اپنی قوم کو ہدایت کردو",
                            "verse 71:3": "انہوں نے کہا کہ اے قوم! میں تم کو کھلے طور پر نصیحت کرتا ہوں",
                            "verse 71:4": "اُنہوں نے کہا: اے ميري قوم! بے شک ميں تمہيں واضح ڈر سنانے والا ہوںo",
                            "verse 71:5": "کہ تم ا? کي عبادت کرو اور اُس سے ڈرو اور ميري اِطاعت کروo",
                            "verse 71:6": "کہ خدا کی عبات کرو اور اس سے ڈرو اور میرا کہا مانو",
                            "verse 71:7": "وہ تمہارے گناہ بخش دے گا اور (موت کے) وقت مقررہ تک تم کو مہلت عطا کرے گا۔ جب خدا کا مقرر کیا ہوگا وقت آجاتا ہے تو تاخیر نہیں ہوتی۔ کاش تم جانتے ہوتے",
                            "verse 71:8": "وہ تمہارے گناہ بخش دے گا اور تمہيں مقررہ مدت تک مہلت عطا کرے گا، بے شک ا? کي (مقرر کردہ) مدت جب آجائے تو مہلت نہيں دي جاتي، کاش! تم جانتے ہوتےo",
                            "verse 71:9": "نوح (عليہ السلام) نے عرض کيا: اے ميرے رب! بے شک ميں اپني قوم کو رات دن بلاتا رہاo",
                            "verse 71:10": "جب لوگوں نے نہ مانا تو (نوح نے) خدا سے عرض کی کہ پروردگار میں اپنی قوم کو رات دن بلاتا رہا",
                            "verse 71:11": "ليکن ميري دعوت نے ان کے لئے سوائے بھاگنے کے کچھ زيادہ نہيں کياo",
                            "verse 71:12": "لیکن میرے بلانے سے وہ اور زیادہ گزیر کرتے رہے",
                            "verse 71:13": "جب جب میں نے ان کو بلایا کہ (توبہ کریں اور) تو ان کو معاف فرمائے تو انہوں نے اپنے کانوں میں انگلیاں دے لیں اور کپڑے اوڑھ لئے اور اڑ گئے اور اکڑ بیٹھے",
                            "verse 71:14": "اور ميں نے جب (بھي) اُنہيں (ايمان کي طرف) بلايا تاکہ تو انہيں بخش دے تو انہوں نے اپني انگلياں اپنے کانوں ميں دے ليں اور اپنے اوپر اپنے کپڑے لپيٹ لئے اور (کفر پر) ہٹ دھرمي کي اور شديد تکبر کياo",
                            "verse 71:15": "پھر ميں نے انہيں بلند آواز سے دعوت ديo",
                            "verse 71:16": "پھر میں ان کو کھلے طور پر بھی بلاتا رہا",
                            "verse 71:17": "اور ظاہر اور پوشیدہ ہر طرح سمجھاتا رہا",
                            "verse 71:18": "پھر ميں نے انہيں اِعلانيہ (بھي) سمجھايا اور انہيں پوشيدہ رازدارانہ طور پر (بھي) سمجھاياo",
                            "verse 71:19": "پھر ميں نے کہا کہ تم اپنے رب سے بخشش طلب کرو، بے شک وہ بڑا بخشنے والا ہےo",
                            "verse 71:20": "اور کہا کہ اپنے پروردگار سے معافی مانگو کہ وہ بڑا معاف کرنے والا ہے",
                            "verse 71:21": "وہ تم پر آسمان سے لگاتار مینہ برسائے گا",
                            "verse 71:22": "وہ تم پر بڑي زوردار بارش بھيجے گاo",
                            "verse 71:23": "اور تمہاري مدد اَموال اور اولاد کے ذريعے فرمائے گا اور تمہارے لئے باغات اُگائے گا اور تمہارے لئے نہريں جاري کر دے گاo",
                            "verse 71:24": "اور مال اور بیٹوں سے تمہاری مدد فرمائے گا اور تمہیں باغ عطا کرے گا اور ان میں تمہارے لئے نہریں بہا دے گا",
                            "verse 71:25": "تم کو کیا ہوا ہے کہ تم خدا کی عظمت کا اعتقاد نہیں رکھتے",
                            "verse 71:26": "تمہيں کيا ہو گيا ہے کہ تم ا? کي عظمت کا اِعتقاد اور معرفت نہيں رکھتےo",
                            "verse 71:27": "حالانکہ اس نے تمہيں طرح طرح کي حالتوں سے پيدا فرماياo",
                            "verse 71:28": "حالانکہ اس نے تم کو طرح طرح (کی حالتوں) کا پیدا کیا ہے",
                            "verse 71:29": "کیا تم نے نہیں دیکھا کہ خدا نے سات آسمان کیسے اوپر تلے بنائے ہیں",
                            "verse 71:30": "کيا تم نے نہيں ديکھا کہ ا? نے کس طرح سات (يا متعدّد) آسماني کرّے باہمي مطابقت کے ساتھ (طبق در طبق) پيدا فرمائےo",
                            "verse 71:31": "اور اس نے ان ميں چاند کو روشن کيا اور اس نے سورج کو چراغ (يعني روشني اور حرارت کا منبع) بناياo",
                            "verse 71:32": "اور چاند کو ان میں (زمین کا) نور بنایا ہے اور سورج کو چراغ ٹھہرایا ہے",
                            "verse 71:33": "اور خدا ہی نے تم کو زمین سے پیدا کیا ہے",
                            "verse 71:34": "اور ا? نے تمہيں زمين سے سبزے کي مانند اُگايا?o? اَرضي زندگي ميں پودوں کي طرح حياتِ اِنساني کي اِبتداء اور نشو و نما بھي کيميائي اور حياتياتي مراحل سے گزرتے ہوئے تدريجاً ہوئي، اِسي لئے اِسے اَنبَتَکُم مِّنَ الاَرضِ نَبَاتًا کے بليغ اِستعارہ کے ذريعے بيان کيا گيا ہے?",
                            "verse 71:35": "پھر تم کو اسي (زمين) ميں لوٹا دے گا اور (پھر) تم کو (اسي سے دوبارہ) باہر نکالے گاo",
                            "verse 71:36": "پھر اسی میں تمہیں لوٹا دے گا اور (اسی سے) تم کو نکال کھڑا کرے گا",
                            "verse 71:37": "اور خدا ہی نے زمین کو تمہارے لئے فرش بنایا",
                            "verse 71:38": "اور ا? نے تمہارے لئے زمين کو فرش بنا دياo",
                            "verse 71:39": "تاکہ تم اس کے کشادہ راستوں ميں چلو پھروo",
                            "verse 71:40": "تاکہ اس کے بڑے بڑے کشادہ رستوں میں چلو پھرو",
                            "verse 71:41": "(اس کے بعد) نوح نے عرض کی کہ میرے پروردگار! یہ لوگ میرے کہنے پر نہیں چلے اور ایسوں کے تابع ہوئے جن کو ان کے مال اور اولاد نے نقصان کے سوا کچھ فائدہ نہیں دیا",
                            "verse 71:42": "نوح (عليہ السلام)نے عرض کيا: اے ميرے رب! انہوں نے ميري نافرماني کي اور اُس (سرکش رؤساء کے طبقے) کي پيروي کرتے رہے جس کے مال و دولت اور اولاد نے انہيں سوائے نقصان کے اور کچھ نہيں بڑھاياo",
                            "verse 71:43": "اور (عوام کو گمراہي ميں رکھنے کے لئے) وہ بڑي بڑي چاليں چلتے رہےo",
                            "verse 71:44": "اور وہ بڑی بڑی چالیں چلے",
                            "verse 71:45": "اور کہنے لگے کہ اپنے معبودوں کو ہرگز نہ چھوڑنا اور ود اور سواع اور یغوث اور یعقوب اور نسر کو کبھی ترک نہ کرنا",
                            "verse 71:46": "اور کہتے رہے کہ تم اپنے معبودوں کو مت چھوڑنا اور وَدّ اور سُوَاع اور يَغُوث اور يَعُوق اور نَسر (نامي بتوں) کو (بھي) ہرگز نہ چھوڑناo",
                            "verse 71:47": "اور واقعي انہوں نے بہت لوگوں کو گمراہ کيا، سو (اے ميرے رب!) تو (بھي ان) ظالموں کو سوائے گمراہي کے (کسي اور چيز ميں) نہ بڑھاo",
                            "verse 71:48": "(پروردگار) انہوں نے بہت لوگوں کو گمراہ کردیا ہے۔ تو تُو ان کو اور گمراہ کردے",
                            "verse 71:49": "(آخر) وہ اپنے گناہوں کے سبب پہلے غرقاب کردیئے گئے پھر آگ میں ڈال دیئے گئے۔ تو انہوں نے خدا کے سوا کسی کو اپنا مددگار نہ پایا",
                            "verse 71:50": "(بالآخر) وہ اپنے گناہوں کے سبب غرق کر دئيے گئے، پھر آگ ميں ڈال دئيے گئے، سو وہ اپنے لئے ا? کے مقابل کسي کو مددگار نہ پا سکےo",
                            "verse 71:51": "اور نوح (عليہ السلام) نے عرض کيا: اے ميرے رب! زمين پر کافروں ميں سے کوئي بسنے والا باقي نہ چھوڑo",
                            "verse 71:52": "اور (پھر) نوح نے (یہ) دعا کی کہ میرے پروردگار اگر کسی کافر کو روئے زمین پر بسا نہ رہنے دے",
                            "verse 71:53": "اگر تم ان کو رہنے دے گا تو تیرے بندوں کو گمراہ کریں گے اور ان سے جو اولاد ہوگی وہ بھی بدکار اور ناشکر گزار ہوگی",
                            "verse 71:54": "بے شک اگر تو اُنہيں (زندہ) چھوڑے گا تو وہ تيرے بندوں کو گمراہ کرتے رہيں گے، اور وہ بدکار (اور) سخت کافر اولاد کے سوا کسي کو جنم نہيں ديں گےo",
                            "verse 71:55": "اے ميرے رب! مجھے بخش دے اور ميرے والدين کو اور ہر اس شخص کو جو مومن ہو کر ميرے گھر ميں داخل ہوا اور (جملہ) مومن مردوں کو اور مومن عورتوں کو، اور ظالموں کے لئے سوائے ہلاکت کے کچھ (بھي) زيادہ نہ فرماo",
                            "verse 71:56": "اے میرے پروردگار مجھ کو اور میرے ماں باپ کو اور جو ایمان لا کر میرے گھر میں آئے اس کو اور تمام ایمان والے مردوں اور ایمان والی عورتوں کو معاف فرما اور ظالم لوگوں کے لئے اور زیادہ تباہی بڑھا فرماo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 71:1": "Биз Нуҳни ўз қавмига, қавмингни уларга аламли азоб келишидан аввал огоҳлантиргин деб, Пайғамбар қилиб юбордик.",
                            "verse 71:2": "У: «Эй қавмим, албатта мен сиз учун очиқ-ойдин огоҳлантирувчиман.",
                            "verse 71:3": "Аллоҳга ибодат қилинглар, Унга тақво қилинглар ва менга итоат қилинглар.",
                            "verse 71:4": "У сизларнинг гуноҳларингиздан мағфират қиладир ва сизни белгиланган ажалгача қўйиб қўядир.",
                            "verse 71:5": "У: «Роббим, мен ўз қавмимни кечаю кундуз даъват қилдим.",
                            "verse 71:6": "Менинг чақириғим уларда қочишдан бошқа нарсани зиёда қилмади.",
                            "verse 71:7": "Ва алабатта қачонки мен уларни сенинг мағфират қилишинг учун чақирсам, улар бармоқларини қулоқларига тиқдилар ва кийимларига бурканиб олдилар ва (кофирликда) собит бўлдилар ва ниҳоятда улкан такаббурлик қилдилар.",
                            "verse 71:8": "Сўнгра, албатта мен уларни очиқ даъват қилдим.",
                            "verse 71:9": "Сўнгра, албатта мен уларга эълон ва сиррий (даъват) қилдим.",
                            "verse 71:10": "Бас, ўз Роббингизга истиғфор айтинг, албатта у гуноҳларни кўплаб мағфират қилувчидир, дедим.",
                            "verse 71:11": "У зот осмондан устингизга кетма-кет (барака ёмғирини) юборадир.",
                            "verse 71:12": "Ва сизга молу мулк ва бола-чақа ила мадад берадир ва сизларга боғу роғлар ҳамда анқорларни берадир.",
                            "verse 71:13": "Сизларга нима бўлдики, Аллоҳнинг азаматини ўйлаб кўрмайсизлар?",
                            "verse 71:14": "Ҳолбуки, у сизларни ҳолатма-ҳолат яратди.",
                            "verse 71:15": "Аллоҳ еттти осмонни қандоқ қилиб табақама-табақа яратиб қўйганини кўрмадингизми?",
                            "verse 71:16": "Ва улар ичида ойни нур ва қуёшни чироқ қилиб қўйганини кўрмадингизми?",
                            "verse 71:17": "Ва Аллоҳ сизларни ердан ўстириб чиқарадир.",
                            "verse 71:18": "Сўнгра сизларни унга қайтариб, яна чиқарадир.",
                            "verse 71:19": "Ва Аллоҳ сизларга ерни гиламдек тўшаб қўйди.",
                            "verse 71:20": "Унда сиз кенг йўллардан юришингиз учун», деб айтдим.",
                            "verse 71:21": "Нуҳ: «Эй Роббим, албатта улар менга исён қилдилар ва моли, бола-чақаси хусрондан бошқани зиёда қилмаганга эргашдилар.",
                            "verse 71:22": "Ва ниҳоятда улкан макр қилдилар.",
                            "verse 71:23": "Ва улар: «Олиҳаларингизни ҳеч тарк қилманглар ва албатта Ваддни ҳам, Суваъни ҳам, Яғусни ҳам, Яъуқни ҳам ва Насрни ҳам тарк қилманг», дедилар.",
                            "verse 71:24": "Дарҳақиқат улар кўпларини адаштирдилар ва сен золимларга залолатдан бошқани зиёда қилма», деди.",
                            "verse 71:25": "Улар хатолари туфайли ғарқ қилиндилар, бас, дўзахга киритилдилар.",
                            "verse 71:26": "Ва Нуҳ: «Эй Роббим, ер юзида кофирлардан бирорта ҳам ҳаракатланувчини қўймагин.",
                            "verse 71:27": "Албатта сен уларни тек қўйсанг, бандаларингни адаштирурлар ва фожиру кофирдан бошқа туғмаслар.",
                            "verse 71:28": "Роббим, мени мағфират қилгин, менинг ота-онамни ҳам ва уйимга мўмин бўлиб кирганларни ва мўминлару мўминаларни ҳам."
                        }
                    }
                }
            }
        }
    }
}