{
    "id": 72,
    "name_simple": "Al-Jinn",
    "revelation_place": "makkah",
    "revelation_order": 40,
    "bismillah_pre": true,
    "verses_count": 28,
    "short_text": "'Al-Jinn' is the name of this Surah as well as the title of its subject matter, for in it the event of the Jinn's hearing the Qur'an and returning to their people to preach Islam to them, has been related in detail.",
    "text": [
        "\n",
        "\"Al-Jinn \" is the name of this Surah as well as the title of its subject matter, for in it the event of the Jinn's hearing the Qur'an and returning to their people to preach Islam to them, has been related in detail.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to a tradition related in Bukhari and Muslim, on the authority of Hadrat Abdullah bin Abbas, once the Holy Prophet (upon whom be peace) was going to Visit the Fair of Ukaz with some of his Companions, On the way be led the Fajr Prayer at Nakhlah. At that time a company of the jinn happened to pass that way. When they heard the Quran being recited, they tarried and listened to it attentively. This very event has been described in this Surah.",
        "\n",
        "Most of the commentators, on the basis of this tradition, believe that this relates to the Holy Prophet's well known journey to Taif, which had taken place three years before the Hijrah in the 10th year of the Prophethood. But this is not correct for several reasons. The jinn's hearing the Qur'an during the journey to Taif has been related in Al-Ahqaf 29-32. A cursory reading of those verses shows that the jinn who had believed after hearing the Qur'an on that occasion were already believers in the Prophet Moses and the previous scriptures. On the contrary, vv. 2-7 of this surah clearly show that the jinn who heard the Qur'an on this occasion were polytheists and deniers of the Hereafter and Prophethood. Then, it is confirmed historically that in his journey to Taif none accompanied the Holy Prophet except Hadrat Zaid bin Harithah. On the contrary, concerning this journey Ibn Abbas says that the Holy Prophet (upon whom be peace) was accompanied by some of his Companions.\r\nFurthermore, the traditions also agree that in that journey the jinn heard the Qur'an when the Holy Prophet had stopped at Nakhlah on his return journey from Taif to Makkah, and in this journey, according to the traditions of Ibn Abbas, the event of the jinn's hearing the Qur'an occurred when the Holy Prophet was going to Ukaz from Makkah. Therefore, in view of these reasons what seems to be correct is that in Surah Al-Ahqaf and Surah Al Jinn, one and the same event has not been narrated, but these were two separate events, which took place during two separate journeys.",
        "\n",
        "As far as Surah Al-Ahqaf is concerned, it is agreed that the event mentioned in it occurred on the return journey from Taif in the 10th year of Prophethood. As for the question, when this second event took place, its answer is not given by the tradition of Ibn Abbas, nor any other historical tradition shows as to when the Holy Prophet had gone to the Fair of Ukaz along with some of his Companions. However, a little consideration of vv. 8-10 of this surah shows that this could only be an event of the earliest stage of Prophethood. In these verses it has been stated that before the appointment of the Holy Prophet (upon whom be peace) to Divine Mission the jinn used to have one or another opportunity to eavesdrop in the heavens in order to hear news of the unseen, but after it they suddenly found that angels had been set as guards and meteorites were being shot on every side so that they could find no place of safety from where they could hear the secret news. Thereupon they had set\r\nabout searching for the unusual thing that had occurred on the earth, or was going to occur, because of which the security measures had been tightened up. Probably since then many companies of the jinn must have been moving about in search of the unusual occurrence and one of them after having heard the Qur'an from the Holy Prophet (upon whom be peace) must have formed the opinion that that was the very thing for the sake of which all the gates of the heavens had been shut against the jinn.",
        "\n",
        "Reality of Jinn",
        "\n",
        "Before one starts the study of this Surah one must clearly know what is the reality of the jinn so as to avoid any possible mental confusion. Many people of the modern times are involved in the misunderstanding that the jinn are not real, but only a figment of the ancient superstition and myths. They have not formed this opinion on the basis that they have known all the realities and truths about the universe and have thus discovered that the jinn do not exist. They cannot claim to possess any such knowledge either. But they have assumed without reason and proof that nothing exists in the universe except what they can see, whereas the sphere of human perceptions as against the vastness of this great universe is not even comparable to a drop of water as against the ocean. Here, the person who thinks that what he does not perceive, does not exist, and what exists must necessarily be perceived, in fact, provides a proof of the narrowness of his own mind. With this mode of thought,\r\nnot to speak of the jinn, man cannot even accept and acknowledge any reality, which he cannot directly experience and observe, and he cannot even admit the existence of God, to say nothing of admitting any other unseen reality.",
        "\n",
        "Those of the Muslims who have been influenced by modernism, but cannot deny the Qur'an either, have given strange interpretations of the clear statements of the Qur'an about the jinn, Iblis and Satan. They say that this does not refer to any hidden creation, which may have its own independent existence, but it sometimes implies man's own animal forces, which have been called Satan, and sometimes it implies savage and wild mountain tribes, and sometimes the people who used to listen to the Qur'an secretly. But the statements of the Qur'an in this regard are so clear and explicit that these interpretations bear no relevance to them whatever.",
        "\n",
        "The Qur'an frequently mentions the jinn and the men in a manner as to indicate that they are two separate creations. For this, see Al Araf: 38, Hud: 119, Ha Mim As-Sajdah: 25,29, Ahqaf: 18, Adh Dhariyat: 56, and the entire surah Ar-Rahman, which bears such clear evidence as to leave no room to regard the jinn as a human species.",
        "\n",
        "In Surah Al-Araf: 12, Al Hijr: 26-27 and Ar-Rahman: 14-19, it has been expressly stated that man was created out of clay and jinn out of fire.",
        "\n",
        "In Surah Al Hijr: 27, it has been said that the jinn had been created before man. The same thing is testified by the story of Adam and Iblis, which has been told at seven different places in the Qur'an, and at every place it confirms that Iblis was already there at the creation of man. Moreover, in surah Al- Kahf: 50, it has been stated that Iblis belonged to the jinn.",
        "\n",
        "In Surah Al-Araf: 27,, it has been stated in clear words that the jinn see the human beings but the human beings do not see them.",
        "\n",
        "In Surah Al Hijr: 16-18, Surah As-Saaffat: 6-10 and Surah Al-Mulk: 5, it has been said that although the jinn can ascend to the heavens, they cannot exceed a certain limit; if they try to ascend beyond that limit and try to hear what goes on in the heavens, they are not allowed to do so, and if they try to eavesdrop they are driven away by meteorites. By this the belief of the polytheistic Arabs that the jinn possess the knowledge of the unseen, or have access to Divine secrets, has been refuted. The same error has a]so been refuted in Saba: 14.",
        "\n",
        "Al-Baqarah: 30-34 and Al- Kahf: 50 show that Allah has entrusted man with the vicegerency of the earth and the men are superior to the jinn. Although the jinn also have been given certain extraordinary powers and abilities an example of which is found in An-Naml: 39, yet the animals likewise have been given some powers greater than man, but these are no argument that the animals are superior to man.",
        "\n",
        "The Qur'an also explains that the jinn, like men, are a creation possessed of power and authority, and they, just like them, can choose between obedience and disobedience, faith and disbelief. This is confirmed by the story of Satan and the event of the jinn affirming the faith as found in Surahs Al-Ahqaf and Al-Jinn.",
        "\n",
        "At scores of places in the Qur'an, it has also been stated that Iblis at the very creation of Adam had resolved to misguide mankind, and since then the Satanic jinn have been persistently trying to mislead man, but they do not have the power to overwhelm him and make him do something forcibly. However, they inspire him with evil suggestions, beguile him and make evil seem good to him. For this, see An-Nisa: 117-120, Al-Araf: 11-17, Ibrahim: 22, Al-Hijr: 30-42, An-Nahl: 98-100, Bani Israil 61-65.",
        "\n",
        "The Qur'an also tells us that in the pre Islamic ignorance the polytheistic Arabs regarded the jinn as associates of God, worshiped them and thought they were descended from God. For this, see Al-An'am: 100, Saba: 40-41, As Saffat: 158.",
        "\n",
        "From these details, it becomes abundantly clear that the jinn have their own objective existence and are a concealed creation of an entirely different species from man. Because of their mysterious qualities, ignorant people have formed exaggerated notions and concepts about them and their powers, and have even worshiped them, but the Qur'an has explained the whole truth about them, which shows what they are and what they are not.",
        "\n",
        "Theme and Topics",
        "\n",
        "In this Surah in vv. 1-15, it has been told what was the impact of the Qur'an on the company of the jinn when they heard it and what they said to their fellow jinn when they returned to them. Allah, in this connection, has not cited their whole conversation but only those particular things which were worthy of mention. That is why the style is not that of a continuous speech but sentences have been cited so as to indicate that they said this and this. If one studies these sentences spoken by the jinn carefully, one can easily understand the real object of the narration of this event of their affirming the faith and or mentioning this conversation of theirs with their people in the Qur'an. The explanations that we have given of their statements in our Notes will be of further help in understanding this object.",
        "\n",
        "After this, in vv. 16-18, the people have been admonished to the effect:\"If you refrain from polytheism and follow the way of righteousness firmly, you will be blessed; otherwise if you turn away from the admonition sent down by Allah, you will meet with a severe punishment.\" Then, in vv. 19-23, the disbelievers of Makkah have been reproached, as if to say: When the Messenger of Allah calls you towards Allah, you surround and mob him from every side, whereas the only duty of the Messenger is to convey the messages of Allah. He does not claim to have any power to bring any gain or cause any harm to the people.\" Then, in vv. 24-25 the disbelievers have been warned to the effect: \"Today you are trying to overpower and suppress the Messenger seeing that he is helpless and friendless, but a time will come when you will know who in actual fact is helpless and friendless. Whether that time is yet far off, or near at hand, the Messenger has no knowledge thereof, but it will come to pass\r\nin any case.\" In conclusion, the people have been told: The Knower of the unseen is Allah alone. The Messenger receives only that knowledge which Allah is pleased to give him. This knowledge pertains to matters connected with the performance of the duties of Prophethood and it is delivered to him in such security which does not admit of any external interference whatever.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the revelation that a group of The Jinn listened to the Prophet reciting the Quran, believed in it, and so admonished their own race. It is names after the jinn-kind, whose account is given in its first part. The surah begins with the account of what a group of jinn said when they overheard a recitation of the Quran and realized its truth (verse 1 .). This is a lesson to the Meccan Arabs, who are also told that the Prophet can help them only by delivering the Message—God is the All Powerful One (verse 16 .). The disbelievers are threatened with what they will meet on the Day of Judgement (verse 23 ).The surah is also known as: Jinn-kind, Sprites, The Jinn's, The Spirits.",
    "name_translation": "The Jinn",
    "name_complex": "Al-Jinn",
    "surah_name_ar": "الجن",
    "verses": {
        "Albanian": {
            "verse 72:1": "Thuaj (o Muhammed!): “Mua m’u ka shpallur se disa prej xhindëve (krijesa të padukshme), kanë dëgjuar dhe kanë thënë: “Me të vërtetë, kemi dëgjuar (një) Kur’an të mrekullueshëm,",
            "verse 72:2": "i cili udhëzon në rrugën e drejtë – e ne kemi besuar në të, dhe kurrsesi më nuk do t’i bëjmë shok askë Perëndisë sonë,",
            "verse 72:3": "e, me të vërtetë, qoftë, lartë madhëria e Tij – Zotit tonë! Ai, nuk ka marrë për Vete as bashkëshorte as fëmijë;",
            "verse 72:4": "(Disa) të marrët nga ne, flisnin gënjeshtra për Perëndinë,",
            "verse 72:5": "kurse ne, kemi menduar se as njerëzit as xhindët nuk flasin gënjeshtra për Perëndinë;",
            "verse 72:6": "e disa njerëz kanë kërkuar strehim te disa xhindë, e kjo vetëm që ua shtoi atyre tërbimin,",
            "verse 72:7": "dhe, ata mendojnë siç mendoni edhe ju: se, Perëndia nuk do të ringjallë askë;",
            "verse 72:8": "ne jemi ata që kemi arritur në qiell, por kemi hasur në plotë roje të forta (engjëj) dhe shigjeta të zjarrta (meteorë);",
            "verse 72:9": "dhe uleshim rreth tij, nëpër vende të përshtatshme për të dëgjuar diçka, por ai që përgjon tani, do të hasë në shigjeta të zjarrta (meteorë) që janë në pritje (pusi),",
            "verse 72:10": "dhe ne nuk dimë, se e keqja i qëllimohet atyre që janë në Tokë, apo Zoti i tyre don t’i udhëzojë në rrugë të mirë,",
            "verse 72:11": "e midis nesh ka të mirë dhe ka që nuk janë të mirë, ka prej nesh kategori të ndryshme, (grupe të përçara);",
            "verse 72:12": "dhe ne e kemi ditur se nuk do të mund t’i shpëtojmë Perëndisë në Tokë dhe nuk mund ta lodhim Atë duke ikur (në qiell);",
            "verse 72:13": "dhe ne, posa dëgjuam udhëzimin (Kur’anin), besuam në të; e kush beson në Zotin e vet, nuk ka përse të druajë nga dëmi as nga zullumi (tërbimi);",
            "verse 72:14": "dhe ka prej nesh muslimanë, e ka prej nesh edhe mëkatarë, e kush e ka përqafuar islamizmin, e ka zgjedhur rrugën e drejtë,",
            "verse 72:15": "kurse, jobesimtarët, do të jenë lëndë djegëse të skëterrës”.",
            "verse 72:16": "Sikur të qëndronin në rrugën e vërtetë, Ne do t’i furnizonim me ujë të bollshëm,",
            "verse 72:17": "për t’i vënë me këtë në sprovë ata; e kushdo që largohet nga të përkujtuarit Zotin e tij, Zoti atë ia nënshtron dënimit të ashpër.",
            "verse 72:18": "Xhamiat i janë kushtuar Perëndisë, dhe mos iu lutni askujt, përveç Perëndisë!",
            "verse 72:19": "E, kur adhuruesi i Perëndisë (Muhammedi), u ngrit t’i lutet Atij, ata (xhindët) u tubuan rreth tij si të ishin shtëllungë leshi.",
            "verse 72:20": "Thuaj (o Muhammed!): “Unë i lutem vetëm Zotit tim dhe askë s’ia bëjë shok Atij”.",
            "verse 72:21": "Thuaj (o Muhammed!): “Unë nuk mundem t’jua largojë ndonjë dëm juve e as t’ua sjell ndonjë dobi (vetëm Perëndia ka pushtet për këtë)”.",
            "verse 72:22": "Thuaj (o Muhammed!): “Me të vërtetë, mua askush nuk mund të më mbrojë nga dënimi i Perëndisë; as që mund të gjejë strehim tjetër kund, përveç te Ai, -",
            "verse 72:23": "(Unë s’kam tjetër funksion) përveç që t’ua predikojë atë që vjen nga Perëndia dhe të dërguarit e Tij”. E, ai që s’dëgjon Perëndinë dhe të Dërguarin e Tij, atë e pret zjarri i skëterrës, në të cilin do të mbetet përgjithmonë. –",
            "verse 72:24": "E, kur ata të shohin atë për çka u është tërhequr vërejtja, do ta dinë ata se kush është më i dobët (në ndihmë) dhe në numër më i vogël.",
            "verse 72:25": "Thuaj (o Muhammed!): “Unë nuk e di, a është afër ajo që u është premtuar juve, apo Zoti im ka caktuar për të afat (më të gjatë),",
            "verse 72:26": "vetëm Ai i di sekretet dhe Ai nuk ia zbulon sekretet e Veta askujt;",
            "verse 72:27": "përveç atij të cilin Ai e ka zgjedhur për të dërguar (pejgamber); andaj, Ai para tij dhe pas tij, i vë ata që e ruajnë (engjëjt)",
            "verse 72:28": "në mënyrë që t’i dijë (qartë) se a i kanë zbatuar misionet e Zotit të tyre. Ai di në hollësi çdo gjë që është te të dërguarit; Ai di numrin e çdo gjëje që ekziston."
        },
        "Amharic": {
            "verse 72:1": "(ሙሐመድ ሆይ!) በል «እነሆ ከጂን የኾኑ ጭፈሮች (ቁርኣንን) አዳመጡ፡፡‹እኛ አስደናቂ የኾነን ቁርኣን ሰማንም› አሉ ማለት ወደእኔ ተወረደ፡፡",
            "verse 72:2": "‹ወደ ቀጥታ መንገድ የሚመራን (ቁርአን ሰማን)፡፡ በእርሱም አመንን፡፡ በጌታችንም አንድንም አናጋራም፡፡›",
            "verse 72:3": "‹እነሆም የጌታችን ክብር ላቀ፡፡ ሚስትንም ልጅንም አልያዘም፡፡›",
            "verse 72:4": "‹እነሆም ቂላችን በአላህ ላይ ወሰን ያለፈን (ውሸት) ይናገር ነበር፡፡›",
            "verse 72:5": "‹እኛም ሰዎችና ጋኔኖች በአላህ ላይ ውሸትን (ቃል) አይናገሩም ማለትን ጠረጠርን፡፡›",
            "verse 72:6": "‹እነሆም ከሰዎች የኾኑ ወንዶች በጋኔን ወንዶች ይጠበቁ ነበሩ፡፡ ኩራትንም ጨመሩዋቸው፡፡›",
            "verse 72:7": "‹እነርሱም አላህ አንድንም አይቀሰቅስም ማለትን እንደጠረጠራችሁ ጠረጠሩ፡፡›",
            "verse 72:8": "‹እኛም ሰማይን (ለመድረስ) ፈለግን፡፡ ብርቱ ጠባቂዎችንና ችቦዎችንም ተሞልታ አገኘናት፡፡",
            "verse 72:9": "‹እኛም ከእርሷ (ወሬን) ለማደመጥ በመቀመጫዎች እንቀመጥ ነበርን፡፡ አሁን ግን የሚያዳምጥ ሰው ለእርሱ ተጠባባቂ ችቦን ያገኛል፡፡",
            "verse 72:10": "‹እኛም በምድር ውስጥ ባልሉ ሰዎች ክፉ ተሽቷል? ወይስ በእነርሱ ጌታቸው ደግን ነገር ሽቷል? ማለትን አናውቅም፡፡",
            "verse 72:11": "‹እኛም ከእኛ ውስጥ ደጎች አልሉ፡፡ ከኛም ከዚህ ሌላ የኾኑ አልሉ፡፡ የተለያዩ መንገዶች (ባለ ቤቶች) ነበርን፡፡",
            "verse 72:12": "‹እኛም አላህን በምድር ውስጥ ፈጽሞ የማናቅተው፤ ሸሽተንም ፈጽሞ የማናመልጠው መኾናችንን አረጋገጥን፡፡",
            "verse 72:13": "‹እኛም መሪውን በሰማን ጊዜ በርሱ አመንን፡፡ በጌታውም የሚያምን ሰው መግጎደልንም መጭጨመርንም አይፈራም፡፡",
            "verse 72:14": "«እኛም ከእኛ ውስጥ ሙስሊሞች አልሉ፡፡ ከእኛም ውስጥ በዳዮች አልሉ፡፡ የሰለሙም ሰዎች እነዚያ ቅንን መንገድ መረጡ፡፡»",
            "verse 72:15": "በዳዮቹማ ለገሀነም ማገዶ ኾኑ፡፡",
            "verse 72:16": "እነሆም በመንገዲቱ ላይ ቀጥ ባሉ ኖሮ ብዙ ዝናምን ባጠጣናቸው ነበር (ማለትም ተወረደልኝ)፡፡",
            "verse 72:17": "በእርሱ ልንሞክራቸው (ባጠጣናቸው ነበር)፡፡ ከጌታውም ማስታወሻ የሚያፈገፍግ ሰው አስቸጋሪን ቅጣት ያገባዋል፡፡",
            "verse 72:18": "እነሆ መስጊዶችም የአላህ ብቻ ናቸው፡፡ (በውስጣቸው) ከአላህ ጋር አንድንም አትገዙ (ማለትም)፡፡",
            "verse 72:19": "እነሆም የአላህ ባሪያ (ሙሐመድ አላህን) የሚጠራው ኾኖ በተነሳ ጊዜ (ጋኔኖች) በእርሱ ላይ ድርብርቦች ሊኾኑ ቀረቡ (ማለትም)፡፡",
            "verse 72:20": "«እኔ የምግገዛው ጌታየን ብቻ ነው፡፡ በእርሱም አንድንም አላጋራም» በል፡፡",
            "verse 72:21": "«እኔ ለእናንተ ጉዳትንም ቀጥታንም አልችልም» በላቸው፡፡",
            "verse 72:22": "«እኔ ከአላህ (ቅጣት) አንድም አያድነኝም፡፡ ከእርሱም ሌላ መጠጊያን አላገኝም» በላቸው፡፡",
            "verse 72:23": "«ከአላህ የኾነ ማድረስን መልክቶቹንም በስተቀር (አልችልም)፡፡ አላህንና መልክተኛውንም የሚያምጽ ሰው ለእርሱ የገሀነም እሳት አልለው፡፡ በውስጧ ዘላለም ዘውታሪዎች ሲኾኑ፡፡»",
            "verse 72:24": "የሚስፈራሩበትንም ባዩ ጊዜ ረዳቱ ደካማ፣ ቁጥሩም አነስተኛ የኾነው ማን እንደኾነ በእርግጥ ያውቃሉ፡፡",
            "verse 72:25": "«የምትስፈራሩበት ነገር ቅርብ ወይም ጌታየ ለእርሱ የተወሰነ ጊዜን የሚያደርግለት (ሩቅ) መኾኑን አላውቅም» በላቸው፡፡",
            "verse 72:26": "«(እርሱ) ሩቁን ምስጢር ዐዋቂ ነው፡፡ በምስጢሩም ላይ አንድንም አያሳውቅም፡፡»",
            "verse 72:27": "ከመልክተኛ ለወደደው ቢኾን እንጅ (ለሌላ አይገልጽም)፡፡ እርሱም ከስተፊቱም ከስተኋላውም ጠባቂዎችን ያደርግለታል፡፡",
            "verse 72:28": "እነርሱ ዘንድ ባለው ነገር ዕውቀቱ የከበበና ነገሩንም ሁሉ በቁጥር ያጠቃለለ ሲኾን የጌታቸውን መልክቶች ያደረሱ መኾናቸውን ያውቅ ዘንድ (ጠባቂ ያደርጋል)፡፡"
        },
        "Arabic": {
            "verse 72:1": "اًبَجَع اًنآْرُق اَنْعِمَس اَّنِإ اوُلاَقَف ِّنِجْلا َنِّم ٌرَفَن َعَمَتْسا ُهَّنَأ َّيَلِإ َيِحوُأ ْلُق",
            "verse 72:2": "اًدَحَأ اَنِّبَرِب َكِرْشُّن نَلَو ۖ ِهِب اَّنَمآَف ِدْشُّرلا ىَلِإ يِدْهَي",
            "verse 72:3": "اًدَلَو اَلَو ًةَبِحاَص َذَخَّتا اَم اَنِّبَر ُّدَج ٰىَلاَعَت ُهَّنَأَو",
            "verse 72:4": "اًطَطَش ِهَّللا ىَلَع اَنُهيِفَس ُلوُقَي َناَك ُهَّنَأَو",
            "verse 72:5": "اًبِذَك ِهَّللا ىَلَع ُّنِجْلاَو ُسنِإْلا َلوُقَت نَّل نَأ اَّنَنَظ اَّنَأَو",
            "verse 72:6": "اًقَهَر ْمُهوُداَزَف ِّنِجْلا َنِّم ٍلاَجِرِب َنوُذوُعَي ِسنِإْلا َنِّم ٌلاَجِر َناَك ُهَّنَأَو",
            "verse 72:7": "اًدَحَأ ُهَّللا َثَعْبَي نَّل نَأ ْمُتنَنَظ اَمَك اوُّنَظ ْمُهَّنَأَو",
            "verse 72:8": "اًبُهُشَو اًديِدَش اًسَرَح ْتَئِلُم اَهاَنْدَجَوَف َءاَمَّسلا اَنْسَمَل اَّنَأَو",
            "verse 72:9": "اًدَصَّر اًباَهِش ُهَل ْدِجَي َنآْلا ِعِمَتْسَي نَمَف ۖ ِعْمَّسلِل َدِعاَقَم اَهْنِم ُدُعْقَن اَّنُك اَّنَأَو",
            "verse 72:10": "(اًدَشَر ْمُهُّبَر ْمِهِب َداَرَأ ْمَأ ِضْرَأْلا يِف نَمِب َديِرُأ ٌّرَشَأ يِرْدَن اَل اَّنَأَو",
            "verse 72:11": "(اًدَدِق َقِئاَرَط اَّنُك ۖ َكِلَٰذ َنوُد اَّنِمَو َنوُحِلاَّصلا اَّنِم اَّنَأَو",
            "verse 72:12": "(اًبَرَه ُهَزِجْعُّن نَلَو ِضْرَأْلا يِف َهَّللا َزِجْعُّن نَّل نَأ اَّنَنَظ اَّنَأَو",
            "verse 72:13": "(اًقَهَر اَلَو اًسْخَب ُفاَخَي اَلَف ِهِّبَرِب نِمْؤُي نَمَف ۖ ِهِب اَّنَمآ ٰىَدُهْلا اَنْعِمَس اَّمَل اَّنَأَو",
            "verse 72:14": "(اًدَشَر اْوَّرَحَت َكِئَٰلوُأَف َمَلْسَأ ْنَمَف ۖ َنوُطِساَقْلا اَّنِمَو َنوُمِلْسُمْلا اَّنِم اَّنَأَو",
            "verse 72:15": "(اًبَطَح َمَّنَهَجِل اوُناَكَف َنوُطِساَقْلا اَّمَأَو",
            "verse 72:16": "(اًقَدَغ ًءاَّم مُهاَنْيَقْسَأَل ِةَقيِرَّطلا ىَلَع اوُماَقَتْسا ِوَّل نَأَو",
            "verse 72:17": "(اًدَعَص اًباَذَع ُهْكُلْسَي ِهِّبَر ِرْكِذ نَع ْضِرْعُي نَمَو ۚ ِهيِف ْمُهَنِتْفَنِّل",
            "verse 72:18": "(اًدَحَأ ِهَّللا َعَم اوُعْدَت اَلَف ِهَّلِل َدِجاَسَمْلا َّنَأَو",
            "verse 72:19": "(اًدَبِل ِهْيَلَع َنوُنوُكَي اوُداَك ُهوُعْدَي ِهَّللا ُدْبَع َماَق اَّمَل ُهَّنَأَو",
            "verse 72:20": "(اًدَحَأ ِهِب ُكِرْشُأ اَلَو يِّبَر وُعْدَأ اَمَّنِإ ْلُق",
            "verse 72:21": "(اًدَشَر اَلَو اًّرَض ْمُكَل ُكِلْمَأ اَل يِّنِإ ْلُق",
            "verse 72:22": "(اًدَحَتْلُم ِهِنوُد نِم َدِجَأ ْنَلَو ٌدَحَأ ِهَّللا َنِم يِنَريِجُي نَل يِّنِإ ْلُق",
            "verse 72:23": "(اًدَبَأ اَهيِف َنيِدِلاَخ َمَّنَهَج َراَن ُهَل َّنِإَف ُهَلوُسَرَو َهَّللا ِصْعَي نَمَو ۚ ِهِتاَلاَسِرَو ِهَّللا َنِّم اًغاَلَب اَّلِإ",
            "verse 72:24": "(اًدَدَع ُّلَقَأَو اًرِصاَن ُفَعْضَأ ْنَم َنوُمَلْعَيَسَف َنوُدَعوُي اَم اْوَأَر اَذِإ ٰىَّتَح",
            "verse 72:25": "(اًدَمَأ يِّبَر ُهَل ُلَعْجَي ْمَأ َنوُدَعوُت اَّم ٌبيِرَقَأ يِرْدَأ ْنِإ ْلُق",
            "verse 72:26": "(اًدَحَأ ِهِبْيَغ ٰىَلَع ُرِهْظُي اَلَف ِبْيَغْلا ُمِلاَع",
            "verse 72:27": "(اًدَصَر ِهِفْلَخ ْنِمَو ِهْيَدَي ِنْيَب نِم ُكُلْسَي ُهَّنِإَف ٍلوُسَّر نِم ٰىَضَتْرا ِنَم اَّلِإ",
            "verse 72:28": "(اًدَدَع ٍءْيَش َّلُك ٰىَصْحَأَو ْمِهْيَدَل اَمِب َطاَحَأَو ْمِهِّبَر ِتاَلاَسِر اوُغَلْبَأ ْدَق نَأ َمَلْعَيِّل"
        },
        "Azerbaijani": {
            "verse 72:1": "De: “Mənə vəhy olundu ki, cinlərdən bir dəstə Quranı dinlədikdən sonra öz tayfalarına qayıdıb dedilər: “Həqiqətən, biz heyrətamiz bir Quran dinlədik!",
            "verse 72:2": "O, doğru yola yönəldir. Biz ona inandıq və bundan sonra əsla kimsəni Rəbbimizə şərik qoşmayacağıq.",
            "verse 72:3": "Doğrudan da, Rəbbimizin əzəməti çox yüksəkdir. O, nə zövcə, nə də övlad sahibi olmamışdır.",
            "verse 72:4": "Bizim səfehimiz İblis Allaha qarşı hədsiz yalanlar danışır.",
            "verse 72:5": "Biz zənnə qapılaraq düşünürdük ki, insanlar da, cinlər də Allaha iftira atmazlar.",
            "verse 72:6": "Həqiqətən, insanlardan bəziləri cinlərin bəzilərinə sığınırdılar. Bu isə onların azğınlığını artırırdı.",
            "verse 72:7": "Onlar da siz zənn etdiyiniz kimi, elə düşünürdülər ki, Allah ölənləri diriltməyəcəkdir.",
            "verse 72:8": "Biz səmaya qalxdıqda onun sərt gözətçilər və yandırıb-yaxan alovlarla dolu olduğunun şahidi olduq.",
            "verse 72:9": "Biz əvvəllər gizlicə qulaq asmaq üçün göyün bəzi sahələrində oturardıq. Amma kim bunu indi etmək istəsə, o, pusquda gözləyən yandırıcı alova rast gələr.",
            "verse 72:10": "Biz bilmirik, bununla yerdəkilərə pislik etmək qəsd edilmişdir, yoxsa Rəbbi onları doğru yola yönəltmək istəmişdir?",
            "verse 72:11": "Əlbəttə, aramızda xeyirxah əməl sahibləri də, onlar kimi olmayanlar da var. Biz ayrı-ayrı yollar tutmuşuq.",
            "verse 72:12": "Biz yəqin etdik ki, yer üzündə Allahdan yaxa qurtara bilmərik. Göyə qaçmalı olsaq da Onun əzabından yayına bilməyəcəyik.",
            "verse 72:13": "Biz doğru yolu göstərən rəhbəri eşitdiyimiz zaman ona iman gətirdik. Rəbbinə iman gətirən, nə savabının azalmasından, nə də haqsızlığa uğramaqdan qorxmaz.",
            "verse 72:14": "Sözsüz ki, bizlərdən müsəlmanlar da var, doğru yoldan sapanlar da. Müsəlman olan şəxslər doğru yol tutanlardır.",
            "verse 72:15": "Doğru yoldan sapanlar Cəhənnəm üçün odun olacaqlar”.",
            "verse 72:16": "Əgər onlar o yolda sabit qalsaydılar, Biz onlara bol-bol su verərdik.",
            "verse 72:17": "Belə edərdik ki, bununla onları sınayaq. Kim öz Rəbbinin zikrindən üz döndərərsə, O, həmin şəxsi şiddətli bir əzaba məruz qoyar.",
            "verse 72:18": "Şübhəsiz ki, məscidlər Allahındır. Allahdan başqa heç kəsə dua etməyin!",
            "verse 72:19": "Allahın qulu qalxıb Allaha dua etdikdə cinlər az qala onun dövrəsində bir-birinə keçib çəpər yaradırdılar.",
            "verse 72:20": "De: “Mən yalnız öz Rəbbimə dua edirəm və kimisə Ona şərik qoşmuram!”",
            "verse 72:21": "De: “Mən sizə nə ziyan verməyə, nə də sizi doğru yola yönəltməyə qadir deyiləm!”",
            "verse 72:22": "De: “Həqiqətən, məni Allahdan kimsə xilas edə bilməz və mən Ondan başqa bir pənah yeri tapa bilmərəm!",
            "verse 72:23": "Mənim əlimdən gələn ancaq Allahı və Onun göndərdiklərini təbliğ etməkdir. Kim Allaha və Onun Elçisinə asi olarsa, onun üçün içərisində əbədi qalacaqları Cəhənnəm odu hazırlanmışdır”.",
            "verse 72:24": "Onlar özlərinə vəd olunmuş əzabı gördükləri zaman kimin köməkçisinin daha zəif və sayca daha az olduğunu biləcəklər.",
            "verse 72:25": "De: “Mən sizə vəd olunmuş əzabın yaxın olduğunu və yaxud Rəbbimin onun üçün uzun bir müddət təyin etmiş olduğunu bilmirəm.",
            "verse 72:26": "O, qeybi Biləndir və Öz qeybini heç kəsə açmaz;",
            "verse 72:27": "razı qaldığı elçidən başqa. Həqiqətən, Allah onların önündə və arxasında gözətçilər qoyur ki,",
            "verse 72:28": "hər kəs onların, Rəbbinin göndərdiklərini necə təbliğ etdiyini bilsin. Allah onların nə etdiklərini nəzarəti altında saxlayır və hər şeyi ayrı-ayrılıqda hesaba alır”."
        },
        "Bengali": {
            "verse 72:1": "বলুনঃ আমার প্রতি ওহী নাযিল করা হয়েছে যে, জিনদের একটি দল কোরআন শ্রবণ করেছে, অতঃপর তারা বলেছেঃ আমরা বিস্ময়কর কোরআন শ্রবণ করেছি;",
            "verse 72:2": "যা সৎপথ প্রদর্শন করে। ফলে আমরা তাতে বিশ্বাস স্থাপন করেছি। আমরা কখনও আমাদের পালনকর্তার সাথে কাউকে শরীক করব না।",
            "verse 72:3": "এবং আরও বিশ্বাস করি যে, আমাদের পালনকর্তার মহান মর্যাদা সবার উর্ধ্বে। তিনি কোন পত্নী গ্রহণ করেননি এবং তাঁর কোন সন্তান নেই।",
            "verse 72:4": "আমাদের মধ্যে নির্বোধেরা আল্লাহ তা’আলা সম্পর্কে বাড়াবাড়ির কথাবার্তা বলত।",
            "verse 72:5": "অথচ আমরা মনে করতাম, মানুষ ও জিন কখনও আল্লাহ তা’আলা সম্পর্কে মিথ্যা বলতে পারে না।",
            "verse 72:6": "অনেক মানুষ অনেক জিনের আশ্রয় নিত, ফলে তারা জিনদের আত্নম্ভরিতা বাড়িয়ে দিত।",
            "verse 72:7": "তারা ধারণা করত, যেমন তোমরা মানবেরা ধারণা কর যে, মৃত্যুর পর আল্লাহ তা’আলা কখনও কাউকে পুনরুত্থিত করবেন না।",
            "verse 72:8": "আমরা আকাশ পর্যবেক্ষণ করছি, অতঃপর দেখতে পেয়েছি যে, কঠোর প্রহরী ও উল্কাপিন্ড দ্বারা আকাশ পরিপূর্ণ।",
            "verse 72:9": "আমরা আকাশের বিভিন্ন ঘাঁটিতে সংবাদ শ্রবণার্থে বসতাম। এখন কেউ সংবাদ শুনতে চাইলে সে জলন্ত উল্কাপিন্ড ওঁৎ পেতে থাকতে দেখে।",
            "verse 72:10": "আমরা জানি না পৃথিবীবাসীদের অমঙ্গল সাধন করা অভীষ্ট, না তাদের পালনকর্তা তাদের মঙ্গল সাধন করার ইচ্ছা রাখেন।",
            "verse 72:11": "আমাদের কেউ কেউ সৎকর্মপরায়ণ এবং কেউ কেউ এরূপ নয়। আমরা ছিলাম বিভিন্ন পথে বিভক্ত।",
            "verse 72:12": "আমরা বুঝতে পেরেছি যে, আমরা পৃথিবীতে আল্লাহ তা’আলাকে পরাস্ত করতে পারব না এবং পলায়ন করেও তাকে অপারক করত পরব না।",
            "verse 72:13": "আমরা যখন সুপথের নির্দেশ শুনলাম, তখন তাতে বিশ্বাস স্থাপন করলাম। অতএব, যে তার পালনকর্তার প্রতি বিশ্বাস করে, সে লোকসান ও জোর-জবরের আশংকা করে না।",
            "verse 72:14": "আমাদের কিছুসংখ্যক আজ্ঞাবহ এবং কিছুসংখ্যক অন্যায়কারী। যারা আজ্ঞাবহ হয়, তারা সৎপথ বেছে নিয়েছে।",
            "verse 72:15": "আর যারা অন্যায়কারী, তারা তো জাহান্নামের ইন্ধন।",
            "verse 72:16": "আর এই প্রত্যাদেশ করা হয়েছে যে, তারা যদি সত্যপথে কায়েম থাকত, তবে আমি তাদেরকে প্রচুর পানি বর্ষণে সিক্ত করতাম।",
            "verse 72:17": "যাতে এ ব্যাপারে তাদেরকে পরীক্ষা করি। পক্ষান্তরে যে ব্যক্তি তার পালনকর্তার স্মরণ থেকে মুখ ফিরিয়ে নেয়, তিনি তাকে উদীয়মান আযাবে পরিচালিত করবেন।",
            "verse 72:18": "এবং এই ওহীও করা হয়েছে যে, মসজিদসমূহ আল্লাহ তা’আলাকে স্মরণ করার জন্য। অতএব, তোমরা আল্লাহ তা’আলার সাথে কাউকে ডেকো না।",
            "verse 72:19": "আর যখন আল্লাহ তা’আলার বান্দা তাঁকে ডাকার জন্যে দন্ডায়মান হল, তখন অনেক জিন তার কাছে ভিড় জমাল।",
            "verse 72:20": "বলুনঃ আমি তো আমার পালনকর্তাকেই ডাকি এবং তাঁর সাথে কাউকে শরীক করি না।",
            "verse 72:21": "বলুনঃ আমি তোমাদের ক্ষতি সাধন করার ও সুপথে আনয়ন করার মালিক নই।",
            "verse 72:22": "বলুনঃ আল্লাহ তা’আলার কবল থেকে আমাকে কেউ রক্ষা করতে পারবে না এবং তিনি ব্যতীত আমি কোন আশ্রয়স্থল পাব না।",
            "verse 72:23": "কিন্তু আল্লাহ তা’আলার বাণী পৌছানো ও তাঁর পয়গাম প্রচার করাই আমার কাজ। যে আল্লাহ ও তাঁর রসূলকে অমান্য করে, তার জন্যে রয়েছে জাহান্নামের অগ্নি। তথায় তারা চিরকাল থাকবে।",
            "verse 72:24": "এমনকি যখন তারা প্রতিশ্রুত শাস্তি দেখতে পাবে, তখন তারা জানতে পারবে, কার সাহায্যকারী দূর্বল এবং কার সংখ্যা কম।",
            "verse 72:25": "বলুনঃ আমি জানি না তোমাদের প্রতিশ্রুত বিষয় আসন্ন না আমার পালনকর্তা এর জন্যে কোন মেয়াদ স্থির করে রেখেছেন।",
            "verse 72:26": "তিনি অদৃশ্যের জ্ঞানী। পরন্ত তিনি অদৃশ্য বিষয় কারও কাছে প্রকাশ করেন না।",
            "verse 72:27": "তাঁর মনোনীত রসূল ব্যতীত। তখন তিনি তার অগ্রে ও পশ্চাতে প্রহরী নিযুক্ত করেন",
            "verse 72:28": "যাতে আল্লাহ তা’আলা জেনে নেন যে, রসূলগণ তাঁদের পালনকর্তার পয়গাম পৌছিয়েছেন কি না। রসূলগণের কাছে যা আছে, তা তাঁর জ্ঞান-গোচর। তিনি সবকিছুর সংখ্যার হিসাব রাখেন।"
        },
        "Berber Amazigh": {
            "verse 72:1": "Ini: \"ippuweêêa yi d, ar agraw n leonun ssemêessen, u nnan: ih, nesla i Leqwôan, d lwehma.",
            "verse 72:2": "Inehhu ar ûûwab, d$a numen yis. I Mass nne$, ur nepcarak yiwen.",
            "verse 72:3": "U Neppa, gedha s loeôs n Mass nne$ Aâlayan, ur Isâi tameddakwelt, ne$ ùùmmi S!",
            "verse 72:4": "Ih, abuhal nne$ iêekku, af Öebbi, ixmiôen.",
            "verse 72:5": "Nekwni nenwa leonun akked imdanen, ur sawalen, af Öebbi, tikerkas, d awez$i.",
            "verse 72:6": "Ih, seg imdanen, llan irgazen ijjemen ddkeô n leonun. Snernan lbe$wv nnsen.",
            "verse 72:7": "S tidep, $ilen, akken t$ilem, ar Öebbi ur d Isskar yiwen, d awez$i.",
            "verse 72:8": "Aql a$ nqelleb igenni, nufa t iççuô d iâssasen uqsiêen, akked ijujaê.",
            "verse 72:9": "Nella nep$imi $uôes, seg imukan nessemêas; win issemêessen tura, a t id immager usafu d aâessas.",
            "verse 72:10": "Nekwni, ur neéôi ma iura lhemm, af at ddunit, ne$ ma Ib$a, Mass nnsen, ad pwanhun.",
            "verse 72:11": "Llan garane$ iâaôviyen, llan wid ur nemâin; ur naâdil iberdan.",
            "verse 72:12": "Nmeyyez nufa, war ccekk, ur nesfunnug Öebbi di tmurt, ur T nesfunnug ma nerwel.",
            "verse 72:13": "Nnhaya mi s nesla, yis numen. Win iumnen s Mass is, ur ippagwad ara t ixaûen, ne$ ara t ivuôôen.",
            "verse 72:14": "Ih, garane$ imvuâen, garane$ lâaûûap. Wid iunzen, widak, xtaôen lewqam.",
            "verse 72:15": "Ma d lâaûûap, di Loahennama, d nitni ay d is$aôen\".",
            "verse 72:16": "Lemmer deg ubrid ay ddan, yili Nefka yasen aman iqwan.",
            "verse 72:17": "A ten njeôôeb yissen. Win iooan asmekti n Mass is, ad isâaddi aâaqeb aqesêan.",
            "verse 72:18": "Leowamaâ n Öebbi. Ur naâôet yiwen ar tama n Öebbi.",
            "verse 72:19": "Atan, mi ikker umdan n Öebbi ad inuj $ureS, qôib lesqen $uôes.",
            "verse 72:20": "Ini: \"pnuju$ kan ar Mass iw, ur aS pcarake$ yiwen\".",
            "verse 72:21": "Ini: \"nek, ur pwakelfe$ $ef vveôô nnwen ne$ $ef nnhaya nnwen\".",
            "verse 72:22": "Ini: \"nek, ur iyi ipfukku yiwen seg ufus n Öebbi, d awez$i. War Neppa, ur ppafe$ ssôan,",
            "verse 72:23": "siwa anabi s$uô Öebbi, akked tebrap iS\". Ih, i wid iâuûan Öebbi akked Umazan iS, times n Loahennama, ad wekkôen degs, i lebda.",
            "verse 72:24": "Alamma mi walan ayen i sen ippuwaââden, ad éôen anwi ay d uôhifen mavi, i leslak, anwi drus iten mavi.",
            "verse 72:25": "Ini: \"ur éôi$ ma iqeôb ed wayen i wen ippuweââden, ne$ ma a t Iweooel Mass iw;",
            "verse 72:26": "Amusnaw n tbavnit; tabavnit iS, ur p Immal i yiwen.",
            "verse 72:27": "Kkes ed win Iôuva d amazan. Winna, iteddu, zdat deffir, s iâssasen.",
            "verse 72:28": "Ad Iéeô ma ssawven tibratin n Mass nnsen. Izzi i wayen akw illan $uôsen, Iêeppeb yal cci s imvanen."
        },
        "Bosnian": {
            "verse 72:1": "Reci: \"Meni je objavljeno da je nekoliko džina prisluškivalo i reklo: 'Mi smo, doista, Kur'an, koji izaziva divljenje, slušali,",
            "verse 72:2": "koji na Pravi put upućuje – i mi smo u nj povjerovali i više nikoga nećemo Gospodaru našem ravnim smatrati,",
            "verse 72:3": "a On nije – neka uzvišeno bude dostojanstvo Gospodara našeg! – uzeo Sebi ni drúge ni djeteta;",
            "verse 72:4": "jedan naš bezumnik je o Allahu laži govorio,",
            "verse 72:5": "a mi smo mislili da ni ljudi ni džini o Allahu laži ne govore;",
            "verse 72:6": "i bilo je ljudi koji su pomoć od džina tražili, pa su im tako obijest povećali;",
            "verse 72:7": "i oni misle, kao što i vi mislite, da Allah nikoga neće oživiti;",
            "verse 72:8": "i mi smo nastojali da nebo dotaknemo i utvrdili smo da je moćnih čuvara i zvijezda padalica puno;",
            "verse 72:9": "i sjedili smo okolo njega po busijama da bismo što čuli, ali će onaj, ko sada prisluškuje, na zvijezdu padalicu koja vreba naići;",
            "verse 72:10": "i mi ne znamo da li se onima na Zemlji želi zlo ili im Gospodar njihov želi dobro;",
            "verse 72:11": "a među nama ima i dobrih i onih koji to nisu, ima nas vrsta različitih;",
            "verse 72:12": "i mi znamo da ne možemo Allahu na Zemlji umaći i da od Njega ne možemo pobjeći;",
            "verse 72:13": "i mi smo, čim smo Kur'an čuli, u nj povjerovali; a ko u Gospodara svoga vjeruje, ni štete ni nepravde ne treba se bojati;",
            "verse 72:14": "i ima nas muslimana, a ima nas zalutalih; oni koji islam prihvate Pravi put su izabrali,",
            "verse 72:15": "a nevjernici će u Džehennemu gorivo biti.'\"",
            "verse 72:16": "A da se Pravog puta drže, Mi bismo ih vodom obilnom pojili,",
            "verse 72:17": "da bismo ih time na kušnju stavili; a onoga ko neće da se Gospodaru svome klanja On će patnju tešku uvesti.",
            "verse 72:18": "Džamije su Allaha radi, i ne molite se, pored Allaha, nikome!",
            "verse 72:19": "A kad je Allahov rob ustao da Mu se pomoli, oni su se u gomilama oko njega tiskati stali.",
            "verse 72:20": "Reci: \"Ja se samo Gospodaru svome klanjam, i nikoga Njemu ravnim ne smatram.\"",
            "verse 72:21": "Reci: \"Ja nisam u stanju da od vas kakvu štetu otklonim niti da nekom od vas kakvu korist pribavim.\"",
            "verse 72:22": "Reci: \"Mene niko od Allahove kazne ne može u zaštitu uzeti; samo u Njega ja mogu utočište naći –",
            "verse 72:23": "samo mogu oglasiti ono što je od Allaha i poslanice Njegove.\" A onoga koji Allahu i Poslaniku Njegovu ne bude poslušan sigurno čeka vatra džehennemska; u njoj će vječno i zauvijek ostati.",
            "verse 72:24": "I kada oni dožive ono čime im se prijeti, saznaće ko je slabiji i brojem manji.",
            "verse 72:25": "Reci: \"Ja ne znam da li će uskoro biti ono čime vam se prijeti ili je Gospodar moj odredio da će to poslije dugo vremena biti,",
            "verse 72:26": "On tajne zna i On tajne Svoje ne otkriva nikome,",
            "verse 72:27": "osim onome koga On za poslanika odabere; zato On i ispred njega i iza njega postavlja one koji će ga čuvati",
            "verse 72:28": "da bi pokazao da su poslanice Gospodara svoga dostavili, On u tančine zna ono što je u njih, On zna broj svega što postoji."
        },
        "Bulgarian": {
            "verse 72:1": "Кажи [о, Мухаммад]: “Разкрито ми бе, че няколко джинове слушали и рекли: “Чухме удивителен Коран.",
            "verse 72:2": "Насочва той към правия път. Затова повярвахме в него и никого не ще съдружим с нашия Господ.",
            "verse 72:3": "Той - превисоко е величието на нашия Господ! - не се е сдобивал нито със съпруга, нито със син.",
            "verse 72:4": "Глупците измежду нас говорят измислици за Аллах.",
            "verse 72:5": "А ние предполагахме, че хората и джиновете никога не ще изрекат лъжа за Аллах.",
            "verse 72:6": "Някои хора търсеха убежище при някои джинове, а [хората] им надбавиха безразсъдство.",
            "verse 72:7": "И [хората] предполагаха, както и вие предполагахте, че Аллах не ще възкреси никого.",
            "verse 72:8": "И досегнахме небето, и открихме, че е пълно със силна стража и с изгарящи звезди.",
            "verse 72:9": "А преди седяхме там на места, за да подслушваме. А който подслушва сега, дебне го изгаряща звезда.",
            "verse 72:10": "И не знаем дали зло е поискано за онези, които са на земята, или техният Господ е поискал добро за тях.",
            "verse 72:11": "Сред нас има правдиви, сред нас има и други освен това. Следваме различни пътища.",
            "verse 72:12": "Вече сме убедени, че никога не ще обезсилим Аллах на земята и никога не ще Го обезсилим, дори да бягаме.",
            "verse 72:13": "И когато чухме Напътствието, повярвахме в него. А който вярва в своя Господ, да не се страхува нито от ощетяване, нито от угнетяване.",
            "verse 72:14": "Сред нас има отдали се на Аллах [мюсюлмани], но сред нас има и отклонили се [неверници]. Онези, които са се отдали на Аллах - те са избрали правия път.",
            "verse 72:15": "А отклонилите се - те са горивото за Ада.”",
            "verse 72:16": "И ако се бяха придържали към правия път, Ние щяхме да им дадем вода в изобилие,",
            "verse 72:17": "за да ги изпитаме с това. А който се отдръпва от споменаването на своя Господ, Той ще го въведе в тежко мъчение.",
            "verse 72:18": "Джамиите са само за Аллах и затова не зовете никой друг заедно с Аллах!",
            "verse 72:19": "Когато рабът на Аллах [Мухаммад] се изправи да Го позове, те едва не се струпаха около него на пълчища.",
            "verse 72:20": "Кажи: “Зова единствено моя Господ и никого не съдружавам с Него.”",
            "verse 72:21": "Кажи: “Аз нито мога да ви навредя, нито да ви бъда от полза.”",
            "verse 72:22": "Кажи: “Никой не може да ме защити от Аллах и не ще намеря убежище освен при Него.",
            "verse 72:23": "Аз предавам само известие от Аллах и Негови послания. А които не се подчиняват на Аллах и на Неговия Пратеник, за тях е Огънят на Ада, там ще пребивават вечно.”",
            "verse 72:24": "Когато видят обещаното им, ще научат кой има по-слаби и по-малобройни помощници.",
            "verse 72:25": "Кажи: “Не знам близо ли е това, което ви е обещано, или е сторил за него предел моят Господ -",
            "verse 72:26": "Знаещия неведомото. Той на никого не разкрива Своите тайни,",
            "verse 72:27": "освен на онзи пратеник, когото е избрал. И сторва Той пред него и зад него да има [ангели] пазители,",
            "verse 72:28": "за да знае, че са съобщили посланията на своя Господ. Обгръща Той това, което е у тях, и пресмята всяко нещо.”"
        },
        "Chinese": {
            "verse 72:1": "你说：我曾奉到启示：有几个精灵已经静听，并且说：我们确已听见奇异的《古兰经》，",
            "verse 72:2": "它能导人於正道，故我们信仰它，我们绝不以任何物配我们的主。'",
            "verse 72:3": "赞颂我们的主的尊严！超绝万物，他没有择取妻室，也没有择取儿女。",
            "verse 72:4": "我们中的庸愚，常以悖谬的事诬蔑真主，",
            "verse 72:5": "我们曾猜想人和精灵绝不诬蔑真主。",
            "verse 72:6": "曾有一些男人，求些男精灵保护他们，因而使他们更加骄傲。",
            "verse 72:7": "那些男人曾像你们一样猜想真主绝不使任何死者复活。",
            "verse 72:8": "我们曾试探天，发现天上布满坚强的卫士和灿烂的星宿。",
            "verse 72:9": "过去，我们为窃听而常常坐在天上可坐的地方。现在谁去窃听，谁就发现一颗灿烂的星宿在等著他。",
            "verse 72:10": "我们不知道，究竟是大地上的万物将遭患难呢？还是他们的主欲引他们於正道呢？",
            "verse 72:11": "我们中有善良的，有次於善良的，我们是分为许多派别的。",
            "verse 72:12": "我们相信，我们在大地上，绝不能使真主无奈，也绝不能逃避真主的谴责。",
            "verse 72:13": "当我们听见正道的时候，我们已信仰它。谁信仰主，谁不怕克扣，也不怕受辱。",
            "verse 72:14": "我们中有顺服的，有乖张的。凡顺服的，都是有志於正道的。",
            "verse 72:15": "至於乖张的，将作火狱的燃料。",
            "verse 72:16": "假如他们遵循正道，我必赏赐他们的丰富的雨水，",
            "verse 72:17": "以便我以雨水考验他们。谁退避主的教训，他将使谁入在严峻的刑罚中。",
            "verse 72:18": "一切清真寺，都是真主的，故你们应当祈祷真主，不要祈祷任何物。",
            "verse 72:19": "当真主的仆人起来祈祷的时候，他们几乎群起而攻之。",
            "verse 72:20": "你说：我只祈祷我的主，我不以任何物配他。",
            "verse 72:21": "你说：我不能为你们主持祸福。",
            "verse 72:22": "你说：任何人不能保护我不受真主的惩罚；除真主外，我绝不能发现任何避难所。",
            "verse 72:23": "我只能传达从真主降示的通知和使命。谁违抗真主和使者，谁必受火狱的刑罚，而且永居其中。",
            "verse 72:24": "待他们看见他们所被警告的刑罚的时候，他们就知道谁是更寡助的。",
            "verse 72:25": "你说：我不知道你们被警告的刑罚是临近的呢？还是我的主将为它规定一个期限呢？",
            "verse 72:26": "他是全知幽玄的，他不让任何人窥见他的幽玄，",
            "verse 72:27": "除非他所喜悦的使者，因为他派遣卫队，在使者的前面和后面行走，",
            "verse 72:28": "以便他知道使者确已传达了他们的主的使命，并且周知他们所有的言行，而且统计万物的数目。"
        },
        "Danish": {
            "verse 72:1": "Zeg: Het is aan mij geopenbaard dat een groep der djinn heeft geluisterd (naar de Koran), en zij zeiden: Waarlijk, wij hebben een wonderbaarlijke verkondiging gehoord",
            "verse 72:2": "Die tot rechtschapenheid leidt; daarom hebben wij er in geloofd, en wij zullen stellig niemand met onze Heer vereenzelvigen",
            "verse 72:3": "En de Majesteit van onze Heer is hoog verheven. Hij heeft noch echtgenote noch zoon",
            "verse 72:4": "En voorzeker, de dwaas onder ons placht over Allah leugen te spreken",
            "verse 72:5": "Doch wij hadden gemeend dat mensen en djinn nooit een leugen over Allah zouden uiten",
            "verse 72:6": "Voorzeker, waren er enige mensen die toevlucht bij sommige djinn zochten, waardoor zij hun zonden vermeerderden",
            "verse 72:7": "En zij meenden inderdaad, zoals gij meendet, dat Allah nooit een boodschapper zou zenden",
            "verse 72:8": "En wij trachtten de hemel te bespieden en wij vonden deze vol sterke wachters en vlammen",
            "verse 72:9": "En voorzeker, wij plachten op enige plaatsen te zitten om de gesprekken te beluisteren. Maar wie nu luistert, vindt een vlam die op hem wacht",
            "verse 72:10": "Wij weten daardoor niet of voor degenen die op aarde zijn, een ramp wordt bedoeld of dat hun Heer hen op het goede pad wil leiden",
            "verse 72:11": "Er zijn onder ons die rechtvaardig zijn en er zijn onder ons die anders zijn en wij volgen verschillende wegen",
            "verse 72:12": "En wij beseffen dat wij Allah`s (plan) op aarde onmogelijk kunnen verijdelen, noch kunnen wij Hem door de vlucht ontlopen",
            "verse 72:13": "En toen wij de leiding hoorden, geloofden wij er in. En hij, die gelooft in zijn Heer, heeft geen vrees voor verlies of onrecht",
            "verse 72:14": "En er zijn onder ons Moslims en er zijn onder ons die van de rechte weg zijn afgeweken. En zij die zich onderwerpen - hebben de rechte weg gezocht",
            "verse 72:15": "En zij die van de rechte weg afwijken, zullen brandstof der hel zijn",
            "verse 72:16": "Indien zij zich aan het rechte pad houden zullen Wij hun water in overvloed te drinken geven",
            "verse 72:17": "Om hen daarmee op de proef te stellen. En wie zich van de gedachte aan zijn Heer afwendt, Hij zal hem een toenemende straf toedienen",
            "verse 72:18": "En zeg: Alle bedehuizen behoren aan Allah; roept daarom niemand naast Allah aan",
            "verse 72:19": "En toen de dienaar van Allah opstond om Hem te aanbidden, vielen zij hem bijna aan",
            "verse 72:20": "Zeg: Ik bid alleen tot mijn Heer en ik vereenzelvig niemand met Hem",
            "verse 72:21": "Zeg: Ik heb (uit mijzelf) geen macht u goed of kwaad te doen",
            "verse 72:22": "Zeg: Voorzeker, niemand kan mij tegen Allah beschermen, noch kan ik een andere schuilplaats vinden buiten Hem",
            "verse 72:23": "(Mij is) slechts de verkondiging van Allah`s boodschap opgedragen. En voor degenen die Allah en Zijn boodschapper niet gehoorzamen is het Vuur der hel, waarin zij lange tijd zullen vertoeven",
            "verse 72:24": "Tot zij de straf zien waarmee zij worden bedreigd, maar dan zullen zij ook weten wie zwakkere helpers en kleiner aantal heeft",
            "verse 72:25": "Zeg hun: Ik weet niet of hetgeen waarmede gij bedreigd wordt nabij is of wel dat mijn Heer het zal uitstellen voor een lange tijd",
            "verse 72:26": "Hij is de Kenner van het onzienlijke en Hij geeft niemand overvloedig kennis van Zijn geheimen",
            "verse 72:27": "Behalve hem die Hij als boodschapper kiest. Dan doet Hij een wacht vóór hem en achter hem gaan",
            "verse 72:28": "Opdat Hij moge weten dat zij (Zijn boodschappers) de boodschappen van hun Heer hebben overgebracht. En Hij omvat alles wat met hen is - en Hij heeft alles berekend"
        },
        "Dutch": {
            "verse 72:1": "Zeg (O Moehammad): \"Het is aan mij geopenbaard dat een aantal Djinn's heeft meegeluisterd, waarop zij zeiden: \"Voorwaar, Wij hebben een verbazingwekkende Koran gehoord.",
            "verse 72:2": "Hij (de Koran) leidt tot het juiste, toen geloofden wij erin, en wij zullen nooit één deelgenoot aan onze Heer toekennen.",
            "verse 72:3": "En dat de Majesteit van onze Heer Verheven is, Hij heeft Zich geen echtgenote genomen en geen zoon.",
            "verse 72:4": "En dat de dwazen onder ons plachten leugens te vertellen over Allah.",
            "verse 72:5": "En dat wij dachten dat de mens en de Djinn's nooit leugens over Allah zouden vertellen.",
            "verse 72:6": "En dat er mannen onder de mensen waren die hulp zochten bij mannen van de Djinn's, wat hun zondigheid vermeerderde.",
            "verse 72:7": "En dat zij dachten zoals jullie dachten: dat Allah nooit iemand zou doen opstaan.",
            "verse 72:8": "En dat wij hebben gevraagd naar de hemel (te mogen gaan): toen vonden wij dat zij vol was met strenge bewakers en brandende vlammen.",
            "verse 72:9": "En dat, wij vroeger (vóór de Koran) op geheime plaatsen zaten om mee te luisteren, maar wie nu wil meeluisteren treft een pijl van vuur aan die op hem loert.",
            "verse 72:10": "En dat wij niet weten of er kwaad bedoeld wordt voor degenen die op de aarde zijn, of dat hun Heer hun rechte Leiding wil geven.",
            "verse 72:11": "En dat er onder ons rechtschapenen zijn, en er onder ons zijn die dat niet zijn. Wij waren op verschillende wegen.",
            "verse 72:12": "En dat wij overtuigd zijn dat wij op de aarde Allah nooit kunnen ontkomen en dat wij nooit van Hem kunnen wegvluchten.",
            "verse 72:13": "En dat, toen wij over de rechte Leiding hadden gehoord, wij erin geloofden. En wie in zijn Heer gelooft; hij zal geen vermindering (van beloning) en geen vermeerdering (van zondigheid) vrezen.",
            "verse 72:14": "En dat er onder ons zijn die zich aan Allah hebben overgegeven, en er onder ons zijn die afwijken (van het rechte Pad). Wie zich heeft overgegeven: zij zijn degenen die de rechte Leiding gekozen hebben.",
            "verse 72:15": "Maar wat de afwijkenden betreft: zij zijn brandhout voor de Hel.\"",
            "verse 72:16": "(En Allah zegt:) \"Als zij op het rechte Pad zouden zijn gebleven, dan zouden Wij hun overvloedig water te drinken gegeven hebben.",
            "verse 72:17": "Om hen daarmee te beproeven. En wie zich afwendt van de gedachtenis van zijn Heer, die voert Hij naar een zware bestraffing.\"",
            "verse 72:18": "En voorwaar, de moskeeën behoren aan Allah toe: roept dan naast Allah niet één aan.",
            "verse 72:19": "En voorwaar, wanneer de dienaar van Allah (Moehammed) in de shalât staat en Hem aanroept, dan bedelven zij (de Djinn's) hem bijna.",
            "verse 72:20": "Zeg: \"Ik roep alleen mijn Heer aan en ik ken Hem in niets deelgenoten toe.\"",
            "verse 72:21": "Zeg: \"Ik heb geen macht om voor jullie schade te voorkomen en niet om Leiding te geven.\"",
            "verse 72:22": "Zeg: \"Niemand zal mij ooit tegen Allah kunnen redden en ik zal nooit naast Hem een toevluchtsoord vinden.",
            "verse 72:23": "(Ik vind een toevluchtsoord) van Allah slechts door de verkondiging van Zijn Boodschappen.\" En wie opstaat tegen Allah en Zijn Boodschapper: voor hen is er het vuur van de Hel. Zij zijn daarin eeuwig levenden, voor altijd.",
            "verse 72:24": "Wanneer zij dan zien wat hun is aangezegd, dan zullen zij weten wie de zwakste helpers heeft en het kleinst in aantal is.",
            "verse 72:25": "Zeg: \"Ik weet niet of het nabij is, wat jullie aangezegd is, of dat mijn Heer het nog lang uitstelt.\"",
            "verse 72:26": "De Kenner van het onwaarneembare, Hij maakt voor niemand het onwaarneembare dat bij Hem is zichtbaar.",
            "verse 72:27": "Behalve aan een Boodschapper die Hem welgevallig is, en voorwaar, dan laat Hij vóór hem en achter hem wachters (Engelen) gaan.",
            "verse 72:28": "Om te doen weten dat zij de Boodschappen van hun Heer overbrachten. En Hij omvat wat er bij hen is en Hij somt alle zaken nauwkeurig op."
        },
        "English": {
            "verse 72:1": "Say, [O Muhammad], \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an.",
            "verse 72:2": "It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone.",
            "verse 72:3": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son",
            "verse 72:4": "And that our foolish one has been saying about Allah an excessive transgression.",
            "verse 72:5": "And we had thought that mankind and the jinn would never speak about Allah a lie.",
            "verse 72:6": "And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden.",
            "verse 72:7": "And they had thought, as you thought, that Allah would never send anyone [as a messenger].",
            "verse 72:8": "And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames.",
            "verse 72:9": "And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him.",
            "verse 72:10": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.",
            "verse 72:11": "And among us are the righteous, and among us are [others] not so; we were [of] divided ways.",
            "verse 72:12": "And we have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight.",
            "verse 72:13": "And when we heard the guidance, we believed in it. And whoever believes in his Lord will not fear deprivation or burden.",
            "verse 72:14": "And among us are Muslims [in submission to Allah], and among us are the unjust. And whoever has become Muslim - those have sought out the right course.",
            "verse 72:15": "But as for the unjust, they will be, for Hell, firewood.'",
            "verse 72:16": "And [Allah revealed] that if they had remained straight on the way, We would have given them abundant provision",
            "verse 72:17": "So We might test them therein. And whoever turns away from the remembrance of his Lord He will put into arduous punishment.",
            "verse 72:18": "And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone.",
            "verse 72:19": "And that when the Servant of Allah stood up supplicating Him, they almost became about him a compacted mass.\"",
            "verse 72:20": "Say, [O Muhammad], \"I only invoke my Lord and do not associate with Him anyone.\"",
            "verse 72:21": "Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\"",
            "verse 72:22": "Say, \"Indeed, there will never protect me from Allah anyone [if I should disobey], nor will I find in other than Him a refuge.",
            "verse 72:23": "But [I have for you] only notification from Allah, and His messages.\" And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever.",
            "verse 72:24": "[The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number.",
            "verse 72:25": "Say, \"I do not know if what you are promised is near or if my Lord will grant for it a [long] period.\"",
            "verse 72:26": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone",
            "verse 72:27": "Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers",
            "verse 72:28": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number."
        },
        "Filipino": {
            "verse 72:1": "Ipagbadya ( o Muhammad): “Ipinahayag sa akin na ang isang pangkat ng Jinn (na may bilang mula tatlo hanggang sampu) ay nakinig (sa Qur’an).” Sila ay nagsasabi: “Katotohanang aming napakinggan ang isang Maindayog at Kamangha-manghang Pagbigkas (sa Quran)!”",
            "verse 72:2": "Na namamatnubay sa Tuwid na Landas (katuwiran at kagalingan), at kami ay sumampalataya rito at hindi kailanman kami ay magtatambal ng anuman (sa pagsamba) sa aming Panginoon (Allah)",
            "verse 72:3": "At ganap na Kaluwalhatian ang Kataasan ng aming Panginoon. Siya (Allah) ay hindi nag-angkin sa Kanyang sarili ng asawa o ng anak (o mga supling o mga anak)",
            "verse 72:4": "At ang mga luku- luko (at baliw) sa lipon namin (alalaong baga, si Iblis o ang mga Jinn na mapagsamba sa mga diyus-diyosan) ay nagpapahayag ng kasinungalingan laban kay Allah na hindi nararapat",
            "verse 72:5": "Katotohanan! Ang sangkatauhan at mga Jinn ay hindi marapat na magturing ng kasinungalingan laban kay Allah",
            "verse 72:6": "At katotohanan na may mga tao sa lipon ng sangkatauhan ang nananahan sa matitipunong mga tao sa gitna ng mga Jinn, datapuwa’t sila (Jinn) ay lalong naglulong (sa sangkatauhan) sa kasalanan at kawalan ng pananalig",
            "verse 72:7": "At katotohanang sila ay nag-akala na katulad ng inyong pag-aakala na si Allah ay hindi magsusugo ng sinumang tagapagbalita (sa sangkatauhan at sa Jinn)",
            "verse 72:8": "At ang mga Jinn ay nagsabi: “At kami ay sumilip (sa mga lihim) ng kalangitan, datapuwa’t aming natagpuan na tigib ito ng mga mahihigpit na tagapagbantay at naglalagablab na apoy.”",
            "verse 72:9": "At katotohanang kami ay lagi nang nakaupo roon (sa nakukubling lugar) upang (makaulinig) ng mapapakinggan, datapuwa’t sinuman ang nakikinig ngayon ay makakatagpo ng isang naglalagablab na apoy na naghihintay sa kanya upang tambangan",
            "verse 72:10": "At hindi namin napag-uunawa kung ang kasamaan (o panganib) ay nakalaan sa lahat ng nasa kalupaan, o kung ang kanilang Panginoon ay nagnanais na sila ay patnubayan sa Tuwid na Landas",
            "verse 72:11": "At sa karamihan namin ay mayroong ilan na matutuwid (sa asal) at ang ilan ay malayo sa (matutuwid na asal). Kami ay mga pangkatin na sumusunod sa magkakahiwalay na landas (iba’t ibang sekta ng pananampalataya, atbp)",
            "verse 72:12": "At nababatid namin na kami ay hindi makakatakas sa (kaparusahan) ni Allah dito sa kalupaan, at hindi rin kami makakawala (sa kaparusahan) sa pamamagitan ng pagtakas",
            "verse 72:13": "At katotohanan na aming napakinggan ang Pahayag (Qur’an), kami ay nagsisampalataya rito (sa Kaisahan ni Allah), at sinuman ang manampalataya sa kanyang Panginoon ay walang ipangangamba maging ito man ay sa pagkabawas ng gantimpala sa kanyang mabubuting gawa o sa dagdag na kaparusahan sa kanyang mga kasalanan. ** Mga nilikha ni Allah na hindi natin nakikita, subalit katulad din ng mga tao ay may pananagutan sa kanilang gawa, may kalayaan sila na gumawa ng mabuti at masama, ang sumunod o sumuway kay Allah at sa Kanyang kautusan, at sa kanila ay may paghuhukom din na darating at may kabayaran ng gantimpala o kaparusahan ayon sa kanilang ginawa",
            "verse 72:14": "At ang ilan sa karamihan namin ay mga Muslim (na nagsuko ng kanilang kalooban kay Allah matapos na makinig sa Qur’an), at may mga ilan sa karamihan namin ay Al-Qasitun (mga walang pananalig at lumihis sa Tuwid na Landas). At sinuman ang magsuko ng kanyang kalooban kay Allah (alalaong baga, ang yumakap sa Islam), katotohanang sila ay nagkamit ng Tuwid na Landas (sa mabuting asal)",
            "verse 72:15": "At sa Qasitun (mga walang pananalig at katarungan na lumihis sa Tuwid na Landas), sila ang magiging panggatong (sa Apoy) ng Impiyerno",
            "verse 72:16": "At kung sila (na sumasamba sa diyus-diyosan, hindi mga Muslim) ay sumampalataya kay Allah at namalagi lamang sa Tuwid na Landas (Islam), katotohanang Kami ay magkakaloob sa kanila ng saganang ulan",
            "verse 72:17": "Upang sila ay Aming masubukan sa gayong paraan. Datapuwa’t sinuman ang tumalikod sa Paala-ala ng kanyang Panginoon (alalaong baga, sa Qur’an at hindi nagsagawa sa mga batas at pag-uutos nito), ay igagawad Niya sa kanya ang pumasok sa Matinding Kaparusahan (Impiyerno)",
            "verse 72:18": "At ang mga Moske o lugar ng pagpapatirapa (sa pagsamba) ay tanging kay Allah (lamang), kaya’t huwag manalangin sa sinuman (bilang kahati) ni Allah",
            "verse 72:19": "(Ipinahayag sa akin) nang ang alipin ni Allah (Muhammad) ay tumindig sa paninikluhod (sa kanyang Panginoon, kay Allah) sa pananalangin, sila (na mga Jinn) ay pumalibot sa kanya sa makapal na lipon na wari bang sila ay dikit-dikit sa isa’t isa (upang sila ay makinig sa pagdalit ng Propeta)",
            "verse 72:20": "Ipagbadya ( o Muhammad): “Ako ay nananalangin lamang sa aking Panginoon (kay Allah lamang), at ako ay hindi nagtatambal sa Kanya ng iba pang huwad na diyos.”",
            "verse 72:21": "Ipagbadya: “Katotohanang ako ay walang kapamahalaan upang ilagay kayo sa kapahamakan, o dalhin kayo sa Tuwid na Landas.”",
            "verse 72:22": "(Ipagbadya O Muhammad): “Katotohanang walang makakapagligtas sa akin sa kaparusahan ni Allah (kung ako ay susuway sa kanya), gayundin, ako ay hindi makakatagpo ng kaligtasan maliban sa Kanya.”",
            "verse 72:23": "(Ang aking tungkulin ) ay iparating sa inyo (ang Katotohanan) na mula kay Allah at sa Kanyang Kapahayagan (Kaisahan ni Allah), at sinumang sumuway kay Allah at sa Kanyang Tagapagbalita, kung gayon, katotohanang sasakanya ang Apoy ng Impiyerno, mananahan siya rito magpakailanman",
            "verse 72:24": "Hanggang sa sumapit ang Araw na itatambad (sa harap ng kanilang mga mata) ang bagay na sa kanila ay ipinangako (na kanilang pinag-aalinlanganan), ay mapag- aalaman nila kung sino ang mahina (sa kanyang) kapanalig (kawaksi) at walang halaga sa (karamihan) ng bilang",
            "verse 72:25": "Ipagbadya ( O Muhammad ): “Hindi ko nababatid kung ang kaparusahan na ipinangako sa inyo ay nalalapit na, o kung ang Panginoon ay magtatakda roon sa matagal pang panahon.”",
            "verse 72:26": "Siya lamang ang lubos na nakakatalastas ng Al-Ghaib (mga nakalingid at Kabilang Buhay) at hindi Niya ipinahahayag sa kaninuman ang Kanyang Ghaib (lihim at nakalingid)",
            "verse 72:27": "Maliban sa isang Tagapagbalita (sa sangkatauhan) na Kanyang hinirang (Siya ay nagpapahayag sa kanya sa Kanyang nais), at nagtalaga Siya ng pangkat ng tagapagbantay (mga anghel) upang manguna sa kanyang harapan at kanyang likuran",
            "verse 72:28": "Siya [Allah] ang nangangalaga sa kanila [mga Tagapagbalita]), hanggang sa Kanyang mamalas na katotohanang ipinahayag nila (mga Tagapagbalita) ang Kapahayagan (Tagubilin) ng kanilang Panginoon. At Kanyang nilulukuban ang lahat ng nasa kanilang (paghahawak), at Siya ang naghahawak sa pagsusulit ng lahat ng bagay (alalaong baga, lubos Niyang batid ang ganap na bilang ng bawat bagay). siyA nA nABABAlutAn ng kAsuutAn"
        },
        "French": {
            "verse 72:1": "Dis: «Il m'a été révélé qu'un groupe de djinns prêtèrent l'oreille, puis dirent: «Nous avons certes entendu une Lecture [le Coran] merveilleuse,",
            "verse 72:2": "qui guide vers la droiture. Nous y avons cru, et nous n'associerons jamais personne à notre Seigneur.",
            "verse 72:3": "En vérité notre Seigneur - que Sa grandeur soit exaltée - ne S'est donné ni compagne, ni enfant!",
            "verse 72:4": "Notre insensé [Iblis] disait des extravagances contre Allah.",
            "verse 72:5": "Et nous pensions que ni les humains ni les djinns ne sauraient jamais proférer de mensonge contre Allah.",
            "verse 72:6": "Or, il y avait parmi les humains, des mâles qui cherchaient protection auprès des mâles parmi les djinns mais cela ne fit qu'accroître leur détresse.",
            "verse 72:7": "Et ils avaient pensé comme vous avez pensé qu'Allah ne ressusciterait jamais personne.",
            "verse 72:8": "Nous avions frôlé le ciel et nous l'avions trouvé plein d'une forte garde et de bolides.",
            "verse 72:9": "Nous y prenions place pour écouter. Mais quiconque prête l'oreille maintenant, trouve contre lui un bolide aux aguets.",
            "verse 72:10": "Nous ne savons pas si on veut du mal aux habitants de la terre ou si leur Seigneur veut les mettre sur le droit chemin.",
            "verse 72:11": "Il y a parmi nous des vertueux et [d'autres] qui le sont moins: nous étions divisés en différentes sectes.",
            "verse 72:12": "Nous pensions bien que nous ne saurions jamais réduire Allah à l'impuissance sur la terre et que nous ne saurions jamais le réduire à l'impuissance en nous enfuyant.",
            "verse 72:13": "Et lorsque nous avons entendu le guide [le Coran], nous y avons cru, et quiconque croit en son Seigneur ne craint alors ni diminution de récompense ni oppression.",
            "verse 72:14": "Il y a parmi nous les Musulmans, et il y en a les injustes [qui ont dévié]. Et ceux qui se sont convertis à l'Islam sont ceux qui ont cherché la droiture.",
            "verse 72:15": "Et quant aux injustes, ils formeront le combustible de l'Enfer.",
            "verse 72:16": "Et s'ils se maintenaient dans la bonne direction, Nous les aurions abreuvés, certes d'une eau abondante,",
            "verse 72:17": "afin de les y éprouver. Et quiconque se détourne du rappel de son Seigneur, Il l'achemine vers un châtiment sans cesse croissant.",
            "verse 72:18": "Les mosquées sont consacrées à Allah: n'invoquez donc personne avec Allah.",
            "verse 72:19": "Et quand le serviteur d'Allah s'est mis debout pour L'invoquer, ils faillirent se ruer en masse sur lui.",
            "verse 72:20": "Dis: «Je n'invoque que mon Seigneur et ne Lui associe personne».",
            "verse 72:21": "Dis: «Je ne possède aucun moyen pour vous faire du mal, ni pour vous mettre sur le chemin droit».",
            "verse 72:22": "Dis: «Vraiment, personne ne saura me protéger contre Allah; et jamais je ne trouverai de refuge en dehors de Lui.",
            "verse 72:23": "[Je ne puis que transmettre] une communication et des messages [émanant] d'Allah. Et quiconque désobéit à Allah et à Son Messager aura le feu de l'Enfer pour y demeurer éternellement.",
            "verse 72:24": "Puis, quand ils verront ce dont on les menaçait, ils sauront lesquels ont les secours les plus faibles et [lesquels] sont les moins nombreux.",
            "verse 72:25": "Dis: «Je ne sais pas si ce dont vous êtes menacés est proche, ou bien, si mon Seigneur va lui assigner un délai.",
            "verse 72:26": "[C'est Lui] qui connaît le mystère. Il ne dévoile Son mystère à personne,",
            "verse 72:27": "sauf à celui qu'Il agrée comme Messager et qu'Il fait précéder et suivre de gardiens vigilants,",
            "verse 72:28": "afin qu'Il sache s'ils ont bien transmis les messages de leur Seigneur. Il cerne (de Son savoir) ce qui est avec eux, et dénombre exactement toute chose."
        },
        "Fulah": {
            "verse 72:1": "Maaku : \"Wahayinaama e am, wonnde dental jinna heɗino [lam miɗo jannga Alqur`aana], ɗi wi`i: \"Menen men nani janngeteende haawniinde",
            "verse 72:2": "Hinde ɗowira e peewal. Men gomɗinii nde. Men kafidatah e Joomi amen, hay e gooto",
            "verse 72:3": "E wonnde manngural Joomi amen ngal mawnii, O siforaali jogitagol genndo, wanaa ɓiɗɗo",
            "verse 72:4": "E wonnde [Ibuliisa] ɗayɗo on e amen hino wowlaynoo penaale e hoore Allah",
            "verse 72:5": "Menen men sikkuno wonnde yimɓe e jinna wowlataano fenaande e hoore Allah",
            "verse 72:6": "Hari le worɓe yimɓe hino mooloraynoo worɓe jinna, ɓe ɓeydi ɗi bewre",
            "verse 72:7": "Kamɓe [yimɓe ɓen] ɓe sikkir no sikkirɗon non, wonnde Allah immintintah hay gooto",
            "verse 72:8": "E wonnde men meemii kammu ngun, men tawi hingu hebbiniraa aynooɓe tiiɗuɓe e docote",
            "verse 72:9": "E wonnde meɗen jooɗotonoo ton fii heɗagol. Kala non heɗitiiɗo jooni, o hawray e docotal tommbingal",
            "verse 72:10": "E wonnde men anndaa si ko bone faandanaa wonɓe ka leydi ɓen, kaa hara Joomi maɓɓe faandani ɓe peewal",
            "verse 72:11": "E wonnde hino e amen moƴƴuɗi, hino e amen kadi ko jaasi ɗum. Hari meɗen e laawi seertuɗi",
            "verse 72:12": "E wonnde men fellituno men laawotaako Allah ka hoore leydi, e wonnde men laawortaa Mo dogugol",
            "verse 72:13": "E wonnde nde men nanunoo peewal nagl, men gomɗini ngal. Kala gomɗinɗo Joomi mun, on hulataa ɗuytaneede [moƴƴi] wanaa ɓeydaneede [bonɗi]",
            "verse 72:14": "E wonnde hino e amen jebbiliiɗi, hino e amen kadi ooñiiɗi. Kala jebbilii ngii, ɗin ɗon faandike peewal",
            "verse 72:15": "Ooñiiɗi ɗin kan, ɗi laatanike Jahannama on carmalle",
            "verse 72:16": "E wonnde si ɓe ñiiɓuno e hoore laawol ngol, ko pellet, Men yarnayno ɓe ndiyam ɗuuɗuɗam",
            "verse 72:17": "fii yo Men ndaarndoro ɓe heen. Kala ɗuurniiɗo e jantoore Joomi mun nden, O naaday mo e lette sattuɗe",
            "verse 72:18": "E wonnde juulirɗe ɗen ko Allah heeranii. Wata on kafidu e Allah hay e gooto",
            "verse 72:19": "E wonnde tuma jeyaaɗo Allah on darinoo himo rewa Mo, ɗi ɗeɓuno waɗɗondirgol e hoore makko",
            "verse 72:20": "Maaku : \"Anndee ko Joomi am (tun) mi rewata, mi kafidataa Mo kadi hay e gooto",
            "verse 72:21": "Maaku : \"Min on mi waawanaa on duñude lorra, wanaa fii pooɗugol nafa",
            "verse 72:22": "Maaku : \"Hay gooto waawaa daɗndugol lam e Allah; mi heɓataa ko woori Mo ƴooñorde",
            "verse 72:23": "si wanaa yottingol immorde e Allah e nule Makko ɗen. Kala yedduɗo Allah e Nulaaɗo Makko on, haray ko Yiite Jahannama woodani mo, ɓe luttay e magge poomaa",
            "verse 72:24": "Haa si ɓe yi`ii ko ɓe kammbirananoo kon, ɓe aray anndude ko hombo ɓuri lo’ude ballo, ɓuri kadi fanɗude limoore",
            "verse 72:25": "Maaku : \"Mi anndaa si ko kammbiranaɗon kon hino ɓadii, maa si Joomi am waɗanay ɗum dumunna",
            "verse 72:26": "Ko O ganndo wirniiɗi. O ƴellintinantaa wirniiɗi Makko ɗin hay e gooto",
            "verse 72:27": "si wanaa mo O welanaa e Nulaaɗo, O naadnay yeeso on e ɓaawo makko tommbotooɓe",
            "verse 72:28": "fii yo o anndu wonnde ɓen yottinii nule Joomi maɓɓe ɗen. O huɓindorii (anndugol) ko woni ka maɓɓe kon, O mofti limoore kala huunde"
        },
        "German": {
            "verse 72:1": "Sag: Mir ist (als Offenbarung) eingegeben worden, daß eine kleinere Schar Ginn zuhörte. Sie sagten: \"Wir haben einen wunderbaren Qur'an gehört,",
            "verse 72:2": "der zur Besonnenheit leitet; so haben wir an ihn geglaubt, und wir werden unserem Herrn niemanden beigesellen.",
            "verse 72:3": "Und erhaben ist die Größe unseres Herrn. Er hat sich weder eine Gefährtin noch Kinder genommen.",
            "verse 72:4": "Und es pflegte der Tor unter uns etwas Abwegiges gegen Allah zu sagen.",
            "verse 72:5": "Und wir meinten, daß weder die Menschen noch die Ginn gegen Allah jemals eine Lüge sagen würden.",
            "verse 72:6": "Und (manche) Männer von den Menschen pflegten Zuflucht zu nehmen bei (einigen) Männern von den Ginn, doch mehrten sie so (bei) ihnen die Drangsal.",
            "verse 72:7": "Und sie meinten -, wie (auch) ihr meint -, daß Allah niemanden mehr (als Gesandten) schicken würde.",
            "verse 72:8": "Und wir haben den Himmel abgetastet, aber festgestellt, daß er mit strengen Wächtern und Leuchtkörpern gefüllt worden ist.",
            "verse 72:9": "Und wir pflegten ja an Stellen von ihm Sitze zum Abhören einzunehmen; wer aber jetzt abhört, der findet einen auf ihn wartenden Leuchtkörper.",
            "verse 72:10": "Und wir wissen doch nicht, ob für diejenigen auf der Erde Schlechtes gewollt wird oder ob ihr Herr sie zur Besonnenheit (führen) will.",
            "verse 72:11": "Und unter uns gibt es Rechtschaffene, und unter uns gibt es solche, die weniger rechtschaffen sind; wir sind getrennte(n) Wege(n gefolgt).",
            "verse 72:12": "Und wir meinten, daß wir uns auf der Erde Allah niemals entziehen können und daß wir uns Ihm niemals durch Flucht entziehen können.",
            "verse 72:13": "Und als wir die Rechtleitung hörten, glaubten wir daran. Wer an seinen Herrn glaubt, der befürchtet keine (Lohn)schmälerung und keine Drangsal.",
            "verse 72:14": "Und unter uns sind Gottergebene; und unter uns sind (vom rechten Weg) Abschweifende. Was nun jemanden angeht, der sich (Allah) ergeben hat, so bemüht er sich um (mehr) Besonnenheit.",
            "verse 72:15": "Was aber die (vom rechten Weg) Abschweifenden angeht, so werden sie Brennholz für die Hölle sein.",
            "verse 72:16": "Und wenn sie sich auf dem Weg recht verhielten, würden Wir ihnen wahrlich Wasser im Überfluß zu trinken geben,",
            "verse 72:17": "damit Wir sie dadurch der Versuchung aussetzen. Und wer sich von der Ermahnung seines Herrn abwendet, den wird Er in überwältigende Strafe stecken.",
            "verse 72:18": "Und die Gebetsstätten gehören doch Allah; so ruft neben Allah niemanden an.",
            "verse 72:19": "Und als Allahs Diener aufstand, um Ihn anzurufen, hätten sie ihn (alle) beinahe erdrückt.\"",
            "verse 72:20": "Sag: Ich rufe nur meinen Herrn an, und ich geselle Ihm niemanden bei.",
            "verse 72:21": "Sag: Ich vermag euch weder Schaden noch Besonnenheit (zu bringen).",
            "verse 72:22": "Sag: Niemand kann mir gegen Allah Schutz gewähren, und ich werde außer (bei) Ihm keinen Ort der Sicherheit finden.",
            "verse 72:23": "(Ich vermag) nur etwas zu übermitteln von Allah und Seinen Botschaften. Und wer sich Allah und Seinem Gesandten widersetzt, gewiß, für ihn wird es das Feuer der Hölle geben, ewig und auf immer darin zu bleiben.",
            "verse 72:24": "Wenn sie dann sehen, was ihnen versprochen worden ist, da werden sie wissen, wer die schwächeren Helfer und die geringere Zahl hat.",
            "verse 72:25": "Sag: Ich weiß nicht, ob das, was euch versprochen worden ist, nahe ist, oder ob mein Herr ihm eine (längere) Frist setzt,",
            "verse 72:26": "(Er,) der Kenner des Verborgenen - Er enthüllt niemandem das, was bei Ihm verborgen ist,",
            "verse 72:27": "außer dem Gesandten, den Er bewilligt; da läßt Er vor ihm und hinter ihm Wächter einhergehen,",
            "verse 72:28": "damit er weiß, ob sie wohl die Botschaften ihres Herrn ausgerichtet haben, und daß Er das, was bei ihnen ist, umfaßt, und Er die Zahl von allem erfaßt'."
        },
        "Hausa": {
            "verse 72:1": "Ka ce: \"An yi wahayi zuwa gare ni cewa wasu jama'a na aljannu sun saurũri (karatuna), sai suka ce: Lalle ne mũ mun ji wani abin karantãwa (Alƙui'ãni), mai ban mãmãki.\"",
            "verse 72:2": "\"Yana nũni zuwa ga hanyar ƙwarai, sabõda haka mun yi ĩmãni da shi bã zã mu kõma bautã wa Ubangijinmu tãre da kõwa ba.\"",
            "verse 72:3": "\"Kuma lalle ne shĩ girman Ubangijinmu, Ya ɗaukaka, bai riƙi mãta ba, kuma bai riƙi ɗã ba.\"",
            "verse 72:4": "\"Kuma lalle ne shi, wãwanmu ya kasance yana faɗar abin da ya ƙetare haddi ga Allah.\"",
            "verse 72:5": "\"Kuma lalle ne mũ, mun yi zaton mutum da aljani bã zã su iya faɗar ƙarya ba ga Allah.\"",
            "verse 72:6": "\"Kuma lalle ne shi wasu maza daga cikin mutãne, sun kasance sunã nẽman tsari da wasu maza daga cikin aljannu, sabõda haka suka ƙara musu girman kai.\"",
            "verse 72:7": "\"Kuma lalle ne sũ, sun yi zato, kamar yadda kuka yi zato, cewa Allah bã zai aiko kowa ba.\"",
            "verse 72:8": "\"Kuma lalle ne mũ mun nẽmi (hawan) sama, sai muka, sãme ta an cika ta da tsaro mai tsanani da kuma yũlãye.\"",
            "verse 72:9": "\"Kuma lalle ne mũ, mun kasance muna zama daga garẽta, a wurãren zama dõmin saurare. To wanda ya yi saurãre a yanzu, zai sãmi yũla, mai dãko dõminsa.\"",
            "verse 72:10": "\"Kuma lalle ne mũ ba mu sani ba, shin, sharri ne aka yi nufi ga waɗanda ke cikin ƙasa, ko Ubangijinsu Yã yi nufin shiriya a gare su ne?\"",
            "verse 72:11": "\"Kuma lalle ne mũ, akwai sãlaihai a cikinmu, kuma akwai a cikinmu waɗanda ba haka bã mun kasance ƙungiyõyi dabam-dabam.\"",
            "verse 72:12": "\"Kuma lalle ne mũ mun tabbatã bã zã mu buwãyi Allah ba, a cikin ƙasa, kuma bã zã mu buwãye Shi da gudu ba.\"",
            "verse 72:13": "\"Kuma lalle ne mũ, a lõkacin da muka ji shiriya, mun yi ĩmãni da ita. To wanda ya yi ĩimãni da Uhangijinsa, bã zai ji tsõron nakkasa ba, kuma bã zai ji tsõron zãlunci ba.\"",
            "verse 72:14": "\"Kuma lalle ne mũ akwai a cikinmu, waɗanda suka mĩƙa wuya, kuma akwai a cikinmu karkatattu. to, wanda ya mĩƙa wuya waɗancan kam sun nufi shiryuwa.\"",
            "verse 72:15": "\"Kuma amma karkatattu sai suka kasance makãmashi ga Jahannama.\"",
            "verse 72:16": "\"Kuma dã sun tsayu sõsai a kan hanya, dã lalle Mun shãyar da su ruwa mai yawa.\"",
            "verse 72:17": "\"Domin Mu jarraba su a ciki, kuma wanda ya kau da kai daga tuna Ubangijinsa, Ubangijinsa zai shigar da shi azãba mai hauhawa.\"",
            "verse 72:18": "\"Kuma lalle ne wurãren sujada na Allah ne, saboda haka kada ku kira kõwa tãre da Allah (da su, a cikinsu).\"",
            "verse 72:19": "\"Kuma, lalle ne shi, a lõkacin da bãwan Allah ke kiran Sa sun yi kusa su zama kamar shirgi a kansa.\"",
            "verse 72:20": "Ka ce: \"lna kiran Ubangijina ne kawai, kuma bã zan tãra kowa da Shi ba.\"",
            "verse 72:21": "Ka ce: \"Lalle ne, nĩ bã ni mallakar wata cũta gare ku, kuma bã ni mallakar wani alhẽri.\"",
            "verse 72:22": "Ka ce: \"Lalle ne, nĩ kõwa bã ya iya cẽtona daga Allah, kuma bã zan iya sãmun mafaka ba daga gare Shi.\"",
            "verse 72:23": "\"Fãce iyarwa, daga Allah, da manzancinsa. To, wanda ya sãɓa wa Allah da ManzonSa, to, lalle yana da wutar Jahannama suna mãsu dawwama a cikinta, har abada.\"",
            "verse 72:24": "Har idan sun ga abin da ake yi musu gargaɗi da shi, to, zã su san wanda ya zama mafi raunin mataimaki da mafi ƙarancin adadi.",
            "verse 72:25": "Ka ce: \"Ban sani ba a kusa ne abin da ake yi muku gargaɗi da shi, ko Ubangijina Ya sanya maSa dõgon ajali!\"",
            "verse 72:26": "\"Shi ɗai ne Masanin fake sabõda haka, bã Ya bayyana gaibinSa ga kowa.\"",
            "verse 72:27": "\"Fãce ga wanda Yã yarda da shi, wato wani manzo sa'an nan lalle ne, zai sanya gãdi a gaba gare shi da bãya gare shi.\"",
            "verse 72:28": "\"Dõmin Ya san lalle, sun iyar da sãƙonnin Ubangijinsu, kuma (Shi Ubangijin) Yã kẽwaye su da sani, kuma Yã lissafe dukan kõme da ƙididdiga.\""
        },
        "Hindi": {
            "verse 72:1": "(ऐ रसूल लोगों से) कह दो कि मेरे पास 'वही' आयी है कि जिनों की एक जमाअत ने (क़ुरान को) जी लगाकर सुना तो कहने लगे कि हमने एक अजीब क़ुरान सुना है",
            "verse 72:2": "जो भलाई की राह दिखाता है तो हम उस पर ईमान ले आए और अब तो हम किसी को अपने परवरदिगार का शरीक न बनाएँगे",
            "verse 72:3": "और ये कि हमारे परवरदिगार की शान बहुत बड़ी है उसने न (किसी को) बीवी बनाया और न बेटा बेटी",
            "verse 72:4": "और ये कि हममें से बाज़ बेवकूफ ख़ुदा के बारे में हद से ज्यादा लग़ो बातें निकाला करते थे",
            "verse 72:5": "और ये कि हमारा तो ख्याल था कि आदमी और जिन ख़ुदा की निस्बत झूठी बात नहीं बोल सकते",
            "verse 72:6": "और ये कि आदमियों में से कुछ लोग जिन्नात में से बाज़ लोगों की पनाह पकड़ा करते थे तो (इससे) उनकी सरकशी और बढ़ गयी",
            "verse 72:7": "और ये कि जैसा तुम्हारा ख्याल है वैसा उनका भी एतक़ाद था कि ख़ुदा हरगिज़ किसी को दोबारा नहीं ज़िन्दा करेगा",
            "verse 72:8": "और ये कि हमने आसमान को टटोला तो उसको भी बहुत क़वी निगेहबानों और शोलो से भरा हुआ पाया",
            "verse 72:9": "और ये कि पहले हम वहाँ बहुत से मक़ामात में (बातें) सुनने के लिए बैठा करते थे मगर अब कोई सुनना चाहे तो अपने लिए शोले तैयार पाएगा",
            "verse 72:10": "और ये कि हम नहीं समझते कि उससे अहले ज़मीन के हक़ में बुराई मक़सूद है या उनके परवरदिगार ने उनकी भलाई का इरादा किया है",
            "verse 72:11": "और ये कि हममें से कुछ लोग तो नेकोकार हैं और कुछ लोग और तरह के हम लोगों के भी तो कई तरह के फिरकें हैं",
            "verse 72:12": "और ये कि हम समझते थे कि हम ज़मीन में (रह कर) ख़ुदा को हरगिज़ हरा नहीं सकते हैं और न भाग कर उसको आजिज़ कर सकते हैं",
            "verse 72:13": "और ये कि जब हमने हिदायत (की किताब) सुनी तो उन पर ईमान लाए तो जो शख़्श अपने परवरदिगार पर ईमान लाएगा तो उसको न नुक़सान का ख़ौफ़ है और न ज़ुल्म का",
            "verse 72:14": "और ये कि हम में से कुछ लोग तो फ़रमाबरदार हैं और कुछ लोग नाफ़रमान तो जो लोग फ़रमाबरदार हैं तो वह सीधे रास्ते पर चलें और रहें",
            "verse 72:15": "नाफरमान तो वह जहन्नुम के कुन्दे बने",
            "verse 72:16": "और (ऐ रसूल तुम कह दो) कि अगर ये लोग सीधी राह पर क़ायम रहते तो हम ज़रूर उनको अलग़ारों पानी से सेराब करते",
            "verse 72:17": "ताकि उससे उनकी आज़माईश करें और जो शख़्श अपने परवरदिगार की याद से मुँह मोड़ेगा तो वह उसको सख्त अज़ाब में झोंक देगा",
            "verse 72:18": "और ये कि मस्जिदें ख़ास ख़ुदा की हैं तो लोगों ख़ुदा के साथ किसी की इबादन न करना",
            "verse 72:19": "और ये कि जब उसका बन्दा (मोहम्मद) उसकी इबादत को खड़ा होता है तो लोग उसके गिर्द हुजूम करके गिर पड़ते हैं",
            "verse 72:20": "(ऐ रसूल) तुम कह दो कि मैं तो अपने परवरदिगार की इबादत करता हूँ और उसका किसी को शरीक नहीं बनाता",
            "verse 72:21": "(ये भी) कह दो कि मैं तुम्हारे हक़ में न बुराई ही का एख्तेयार रखता हूँ और न भलाई का",
            "verse 72:22": "(ये भी) कह दो कि मुझे ख़ुदा (के अज़ाब) से कोई भी पनाह नहीं दे सकता और न मैं उसके सिवा कहीं पनाह की जगह देखता हूँ",
            "verse 72:23": "ख़ुदा की तरफ से (एहकाम के) पहुँचा देने और उसके पैग़ामों के सिवा (कुछ नहीं कर सकता) और जिसने ख़ुदा और उसके रसूल की नाफरमानी की तो उसके लिए यक़ीनन जहन्नुम की आग है जिसमें वह हमेशा और अबादुल आबाद तक रहेगा",
            "verse 72:24": "यहाँ तक कि जब ये लोग उन चीज़ों को देख लेंगे जिनका उनसे वायदा किया जाता है तो उनको मालूम हो जाएगा कि किसके मददगार कमज़ोर और किसका शुमार कम है",
            "verse 72:25": "(ऐ रसूल) तुम कह दो कि मैं नहीं जानता कि जिस दिन का तुमसे वायदा किया जाता है क़रीब है या मेरे परवरदिगार ने उसकी मुद्दत दराज़ कर दी है",
            "verse 72:26": "(वही) ग़ैबवॉ है और अपनी ग़ैब की बाते किसी पर ज़ाहिर नहीं करता",
            "verse 72:27": "मगर जिस पैग़म्बर को पसन्द फरमाए तो उसके आगे और पीछे निगेहबान फरिश्ते मुक़र्रर कर देता है",
            "verse 72:28": "ताकि देख ले कि उन्होंने अपने परवरदिगार के पैग़ामात पहुँचा दिए और (यूँ तो) जो कुछ उनके पास है वह सब पर हावी है और उसने तो एक एक चीज़ गिन रखी हैं"
        },
        "Indonesian": {
            "verse 72:1": "Katakanlah (hai Muhammad): \"Telah diwahyukan kepadamu bahwasanya: telah mendengarkan sekumpulan jin (akan Al Quran), lalu mereka berkata: Sesungguhnya kami telah mendengarkan Al Quran yang menakjubkan,",
            "verse 72:2": "(yang) memberi petunjuk kapada jalan yang benar, lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan seseorangpun dengan Tuhan kami,",
            "verse 72:3": "dan bahwasanya Maha Tinggi kebesaran Tuhan kami, Dia tidak beristeri dan tidak (pula) beranak.",
            "verse 72:4": "Dan bahwasanya: orang yang kurang akal daripada kami selalu mengatakan (perkataan) yang melampaui batas terhadap Allah,",
            "verse 72:5": "dan sesungguhnya kami mengira, bahwa manusia dan jin sekali-kali tidak akan mengatakan perkataan yang dusta terhadap Allah.",
            "verse 72:6": "Dan bahwasanya ada beberapa orang laki-laki di antara manusia meminta perlindungan kepada beberapa laki-laki di antara jin, maka jin-jin itu menambah bagi mereka dosa dan kesalahan.",
            "verse 72:7": "Dan sesungguhnya mereka (jin) menyangka sebagaimana persangkaan kamu (orang-orang kafir Mekah), bahwa Allah sekali-kali tidak akan membangkitkan seorang (rasul)pun,",
            "verse 72:8": "dan sesungguhnya kami telah mencoba mengetahui (rahasia) langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api,",
            "verse 72:9": "dan sesungguhnya kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya). Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu) tentu akan menjumpai panah api yang mengintai (untuk membakarnya).",
            "verse 72:10": "Dan sesungguhnya kami tidak mengetahui (dengan adanya penjagaan itu) apakah keburukan yang dikehendaki bagi orang yang di bumi ataukah Tuhan mereka menghendaki kebaikan bagi mereka.",
            "verse 72:11": "Dan sesungguhnya di antara kami ada orang-orang yang saleh dan di antara kami ada (pula) yang tidak demikian halnya. Adalah kami menempuh jalan yang berbeda-beda.",
            "verse 72:12": "Dan sesungguhnya kami mengetahui bahwa kami sekali-kali tidak akan dapat melepaskan diri (dari kekuasaan) Allah di muka bumi dan sekali-kali tidak (pula) dapat melepaskan diri (daripada)Nya dengan lari.",
            "verse 72:13": "Dan sesungguhnya kami tatkala mendengar petunjuk (Al Quran), kami beriman kepadanya. Barangsiapa beriman kepada Tuhannya, maka ia tidak takut akan pengurangan pahala dan tidak (takut pula) akan penambahan dosa dan kesalahan.",
            "verse 72:14": "Dan sesungguhnya di antara kami ada orang-orang yang taat dan ada (pula) orang-orang yang menyimpang dari kebenaran. Barangsiapa yang yang taat, maka mereka itu benar-benar telah memilih jalan yang lurus.",
            "verse 72:15": "Adapun orang-orang yang menyimpang dari kebenaran, maka mereka menjadi kayu api bagi neraka Jahannam.",
            "verse 72:16": "Dan bahwasanya: jikalau mereka tetap berjalan lurus di atas jalan itu (agama Islam), benar-benar Kami akan memberi minum kepada mereka air yang segar (rezeki yang banyak).",
            "verse 72:17": "Untuk Kami beri cobaan kepada mereka padanya. Dan barangsiapa yang berpaling dari peringatan Tuhannya, niscaya akan dimasukkan-Nya ke dalam azab yang amat berat.",
            "verse 72:18": "Dan sesungguhnya mesjid-mesjid itu adalah kepunyaan Allah. Maka janganlah kamu menyembah seseorangpun di dalamnya di samping (menyembah) Allah.",
            "verse 72:19": "Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembah-Nya (mengerjakan ibadat), hampir saja jin-jin itu desak mendesak mengerumuninya.",
            "verse 72:20": "Katakanlah: \"Sesungguhnya aku hanya menyembah Tuhanku dan aku tidak mempersekutukan sesuatupun dengan-Nya\".",
            "verse 72:21": "Katakanlah: \"Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudharatanpun kepadamu dan tidak (pula) suatu kemanfaatan\".",
            "verse 72:22": "Katakanlah: \"Sesungguhnya aku sekali-kali tiada seorangpun dapat melindungiku dari (azab) Allah dan sekali-kali aku tiada akan memperoleh tempat berlindung selain daripada-Nya\".",
            "verse 72:23": "Akan tetapi (aku hanya) menyampaikan (peringatan) dari Allah dan risalah-Nya. Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya maka sesungguhnya baginyalah neraka Jahannam, mereka kekal di dalamnya selama-lamanya.",
            "verse 72:24": "Sehingga apabila mereka melihat azab yang diancamkan kepada mereka, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit bilangannya.",
            "verse 72:25": "Katakanlah: \"Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu dekat ataukah Tuhanku menjadikan bagi (kedatangan) azab itu masa yang panjang?\".",
            "verse 72:26": "(Dia adalah Tuhan) Yang Mengetahui yang ghaib, maka Dia tidak memperlihatkan kepada seorangpun tentang yang ghaib itu.",
            "verse 72:27": "Kecuali kepada rasul yang diridhai-Nya, maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di muka dan di belakangnya.",
            "verse 72:28": "Supaya Dia mengetahui, bahwa sesungguhnya rasul-rasul itu telah menyampaikan risalah-risalah Tuhannya, sedang (sebenarnya) ilmu-Nya meliputi apa yang ada pada mereka, dan Dia menghitung segala sesuatu satu persatu."
        },
        "Italian": {
            "verse 72:1": "Di': “Mi è stato rivelato che un gruppo di dèmoni ascoltarono e dissero: Invero abbiamo ascoltato una Lettura meravigliosa,",
            "verse 72:2": "che conduce sulla retta via; abbiamo creduto in essa e non assoceremo nessuno al nostro Signore.",
            "verse 72:3": "In verità Egli _ esaltata sia la Sua Maestà - non si è preso né compagna, né figlio.",
            "verse 72:4": "Uno stolto dei nostri diceva menzogne contro Allah.",
            "verse 72:5": "Pensavamo che né gli uomini, né i dèmoni, potessero proferire menzogne contro Allah.",
            "verse 72:6": "Invero c'erano degli uomini che si rifugiavano presso i dèmoni, e questo non fece che aumentare la loro follia:",
            "verse 72:7": "anch'essi pensavano, come lo pensavate voi, che Allah non avrebbe resuscitato nessuno.",
            "verse 72:8": "Invero abbiamo sfiorato il cielo, ma lo abbiamo trovato munito di temibili guardiani e di bolidi fiammeggianti.",
            "verse 72:9": "Ci sedevamo [un tempo] in sedi appropriate, per ascoltare. Ma ora chi vuole origliare trova un bolide fiammeggiante in agguato.",
            "verse 72:10": "Noi non sappiamo se sia stata decretata una sventura per coloro che stanno sulla terra, o se il loro Signore li voglia guidare [al bene].",
            "verse 72:11": "Tra noi ci sono dei giusti e altri che non lo sono: siamo in diverse sette.",
            "verse 72:12": "Pensavamo che mai avremmo potuto annullare [la potenza di] Allah sulla terra e che non avremmo mai potuto sfuggire [a Lui].",
            "verse 72:13": "Quando udimmo la Guida, credemmo; e chi crede nel suo Signore non teme danno, né offesa.",
            "verse 72:14": "[Ora] tra noi ci sono i musulmani e i ribelli. I musulmani sono quelli che hanno scelto la Retta via. [“musulmani”: cioè sottomessi alla volontà di Allah (gloria a Lui l'Altissimo)]",
            "verse 72:15": "I ribelli, invece, saranno combustibile dell'Inferno\".",
            "verse 72:16": "Se si manterranno sulla Retta via, Noi li disseteremo di acqua abbondante",
            "verse 72:17": "per metterli colà alla prova. Allah condurrà ad un castigo incessantemente più severo chi avrà trascurato il monito del suo Signore.",
            "verse 72:18": "Le moschee appartengono ad Allah: non invocate nessuno insieme con Lui.",
            "verse 72:19": "Quando il servo di Allah si levò per invocarLo, poco mancò che lo stringessero [fino a soffocarlo]!”",
            "verse 72:20": "Di': “Non invoco altri che il mio Signore e non Gli associo alcunché”.",
            "verse 72:21": "Di': “In verità non posso né nuocervi, né giovarvi”.",
            "verse 72:22": "Di': “In verità nessuno potrà proteggermi da Allah e mai troverò rifugio all'infuori di Lui,",
            "verse 72:23": "se non comunicando, in Nome di Allah, i Suoi messaggi”. Coloro che disobbediranno ad Allah e al Suo Messaggero, avranno il fuoco dell'Inferno e vi rimarranno in perpetuo per sempre.",
            "verse 72:24": "Quando poi vedranno quello che è stato promesso loro, allora sapranno chi avrà avuto l'alleato più debole e [chi sarà stato] numericamente esiguo!",
            "verse 72:25": "Di': “Io non so se quello che vi è stato promesso è imminente o se il mio Signore vorrà ritardarlo:",
            "verse 72:26": "[Egli è] Colui Che conosce l'invisibile e non lo mostra a nessuno,",
            "verse 72:27": "se non a un messaggero di cui si compiace, che fa precedere e seguire da una guardia [angelica],",
            "verse 72:28": "per sapere se [i profeti] hanno trasmesso i messaggi del loro Signore. Gli è ben noto tutto ciò che li concerne e tiene il conto di tutte le cose”."
        },
        "Japanese": {
            "verse 72:1": "言え，「わたしにこう啓示された。一団のジンが（クルアーンを）聞いて言った。『わたしたちは，本当に驚くべき読誦を聞いた。",
            "verse 72:2": "正しい道への導きである。だからわたしたちは信仰し，主に何ものをも配さない。",
            "verse 72:3": "尊厳にしていと高き主の御威光よ，かれは妻を娶らず，子も持たれない。",
            "verse 72:4": "わたしたちの中の愚かな者が，アッラーに対し途方もない嘘を話していた。",
            "verse 72:5": "しかしわたしたちは，人間もジンも，アッラーに就いて嘘を言うべきではないと考えていた。",
            "verse 72:6": "本当に或る種の人間は，ジンの或る者に庇護を求める。しかしそれは，かれらの愚劣を助長した。",
            "verse 72:7": "かれらもあなたがたが考えたように，アッラーは，何者も甦らされないだろうと考えていた。",
            "verse 72:8": "わたしたちは，天（の秘密）に触れようとしたが，これは強い護衛の燃え輝く星（流星）で一杯であることが分った。",
            "verse 72:9": "わたしたちは（盗み）聞くためにそこに坐っていた。だが聞き耳を立てる者には，警戒している燃え輝く星（流星）が待ち構えている。",
            "verse 72:10": "わたしたちは，主が地上の者に対して悪を望まれているのか，または，かれらを正しい道に，導くことを望まれているのか知らなかった。",
            "verse 72:11": "わたしたちの中には，正しい者もいるが，そうではない者もいて，様々な道に従っている。",
            "verse 72:12": "だがわたしたちは，地上においてアッラーを出し抜くことは出来ないし，また逃避して，かれを失敗させることも出来ないと思っている。",
            "verse 72:13": "わたしたちは導きを聴いて，直ぐそれを信仰した。そして主を信じる者には，恐れもなく，損うこともなく，また不正にあうこともない。",
            "verse 72:14": "わたしたちの中には，（アッラーに）服従，帰依する者もあり，また正道から逸れる者もいる。服従，帰依した者は正しい道に志向を定める。",
            "verse 72:15": "だが正道から逸れる者は火獄の薪となろう。』と。」",
            "verse 72:16": "もしかれらが（正しい）道を守るならば，われは必ず豊かな雨（凡ての恩恵）をかれらに恵む。",
            "verse 72:17": "われはそれによってかれらを試みよう。だが主を念うことから逸れる者は，厳しい懲罰に追いたてられることになる。",
            "verse 72:18": "本当にマスジドは（凡て）アッラーの有である。それでアッラーと同位に配して他の者に祈ってはならない。",
            "verse 72:19": "アッラーのしもべ（ムハンマド）が，かれに祈るために立った時，かれら（マッカの多神教徒）はどっと押し寄せんばかりに，かれを取り巻いた。",
            "verse 72:20": "言ってやるがいい。「わたしは，一途にわが主に祈り，何もかれと同位に配さない。」",
            "verse 72:21": "言ってやるがいい。「わたしには，あなたがたを害したり，益したりする力はないのである。」",
            "verse 72:22": "言ってやるがいい。「誰もアッラーからわたしを守り切ることは出来ないし，またかれの外に，避難所を見い出すことも出来ない。",
            "verse 72:23": "（わたしは）只アッラーからの御告げを，宣べ伝えるに過ぎない。それでアッラーとその使徒に従わない者，かれらには地獄の火があり，永遠にその中に住むであろう。」",
            "verse 72:24": "かれらは，約束されたことを見る時になって，助力において誰が最も頼りにならないか，数においても誰が最も頼りにならないかを知るであろう。",
            "verse 72:25": "言ってやるがいい。「わたしは，あなたがたに約束されたことが近付いているのか，それともアッラーがもう少し期間を設けられたのかを知らない。",
            "verse 72:26": "かれ（だけ）が幽玄界を知っておられ，その秘密を誰にも漏されはしない。",
            "verse 72:27": "かれの御気に召した使徒以外には。それで，かれは，前からも後ろからも護衛して，（使徒を）赴かせられた。",
            "verse 72:28": "それはかれらが，果して主の御告げを伝えたかどうかをかれが知られるためであり，またかれらの持つものを取り囲んで，凡てをそれぞれ計算に数え上げられるためである。"
        },
        "Jawa": {
            "verse 72:1": "Dhawuha, \"Aku tampa dhawuhe Allah paring pirsa ana sagolongan jin padha ngrungokake anggonku dhawuhake al-Quran, Jin mau ngeram - ngeramake al-Quran marang para kancane celathune, ’Aku krungu anggone Muhammad dhawuhake al-Quran kang helok",
            "verse 72:2": "al-Quran nuduhake dalan bener, aku banjur pracaya ora pisan mangro tingal marang Allah Pangeranku lan ora menyang sapa - sapa",
            "verse 72:3": "Satemene Allah Pangeranku kang Maha Luhur lan Agung tanpa garwa lan ora kagungan putra",
            "verse 72:4": "Satemene kancaku kang bodho ngucap kang ora patut marang Allah, ngarani kagungan putra lan garwa",
            "verse 72:5": "Mahune penyanaku ora ana Jin lan manungsa celathu goroh tumrap marang Allah",
            "verse 72:6": "Sarta dene saka wong - wong saka antaraning manungsa jaluk pitulungan marang para Jin lanang, kang mangkono mau muwuhi kesasar tumrap dheweke",
            "verse 72:7": "Sateme dheweke (Jin) uga padha nyana kaya panyanamu, ing tembe Allah ora bakal nguripake wong siji kang wis mati",
            "verse 72:8": "Jin celathu, \"Aku neja munggah marang langit, ngrungokake guneme kang padha ana kono, bareng meh tekan ing kono kebak malaekat kang jaga padha gagah prakoso lan panah - panah geni",
            "verse 72:9": "Sarta, dene adat sabene aku padha lungguh ing palungguhan, supaya bisa amrungu, ananing saiki sapa sing ngrungokake bakal kapethukake urub (ing geni) kang ngadhang dheweke",
            "verse 72:10": "Aku ora weruh sebabe ora pareng ngrungokake guneme para malaekat mau, tumrape wong kang manggon ana bumi becik apa ala",
            "verse 72:11": "Sawenehe golonganku padha wong tulus lan sawenehe ora mangkono, aku iki pepanthan kang padha seje - seje dalane",
            "verse 72:12": "Panemuku, ora bisa ngoncati siksaning Allah ing bumi sarta ora bisa ngoncati Panjenengane sarana mlayu",
            "verse 72:13": "Aku bareng krungu pituduhe al-Quran banjur ngandel marang Allah lan al-Quran. Sing sapa pracaya marang Allah Pangerane mesthi ora kuatir suda kabecikane lan tambah halane",
            "verse 72:14": "Satemen sawenehing golonganku ana wong kang sumarah, lan sawenehing nyimpang. Sapa wonge sing sumarah iku nuju marang dalan kang bener",
            "verse 72:15": "Wondene wong kang padha nyimpang padha dadi urub - urubing neraka jahannam",
            "verse 72:16": "Dene menawa dheweke padha tetep ngambah dalan (bener) mesthi bakal Ingsun turunake banyu udan kang deres (rizki kang akeh)",
            "verse 72:17": "Ingsun anggo nyoba marang dheweke ing dalem prakara iku lan sapa sing malengos saka eling marang Pangerane bakal dilebokake siksa kang nusahake banget",
            "verse 72:18": "Lan satemene sarupaning masjid kabeh kagungane Allah, mulane anggonmu padha nyembah Allah aja dicampuri nyembah liyane",
            "verse 72:19": "Lan satemene bareng kawulaning Allah (Muhammad) ngadek nyembah Allah para Jin padha rebut dujung tunggang - tinunggang nyedhak (kudo ngurokake al-Quran)",
            "verse 72:20": "Dhawuhe (Muhammad), \"Satemene aku mung nyembah ing Allah Pangeranku ora pisan tak wori nyembah liyane",
            "verse 72:21": "Dhawuha (Muhammad), \"Aku iki ora nguasani marang kowe dadi kesasar utawa begja (iku atas kersaning Allah)",
            "verse 72:22": "Dhawuha, \"(Menawa aku duraka ing Allah) ora ana wong sawiji kang bisa nulak siksaning Allah, lan aku ora oleh pangungsen liyane ngungsi marang Allah",
            "verse 72:23": "Kuwasaku mung mratakake dhawuhe Allah marang kowe kabeh (timbalan sarta ayahane) lan sapa wonge nglirwakake Allah lan utusane sayekti bakal oleh geni neraka langgeng salawase",
            "verse 72:24": "Nganti padha deleng siksa kang diancamake marang dheweke, banjur bakal padha weruh sapa sing panulunge luwih apes sarta luwih sethithik cacahe",
            "verse 72:25": "Dhawuha, \"Aku ora weruh siksa kang diancamake marang kowe apa wis cedhak utawa isih lawas kelakone",
            "verse 72:26": "Allah iku nguningani barang kang samar kang ora diweruhi manungsa, lan ora kersa medharake barang kang samar mau marang sawijining wong",
            "verse 72:27": "Kajaba rasul kang wis diparengake nyumurupi, rasul dijaga (para Malaikat) ana ing ngarep buri lan kiwa tengene",
            "verse 72:28": "Supaya Allah nguningani kelawan gumelar yen para Rosul mau temen wis ngundangake dhawuhing Allah Pangerane, kaweruhhing Allah ngalimputi para Rosul kabeh lan bisa nacahake samu barang"
        },
        "Kazakh": {
            "verse 72:1": "Ей, Мұхаммед! Айт: «Жындардың бір тобының тыңдағаны маған уахи етілді, сонда олар: «Ақиқатында, біз бір ғажап Құранды естідік",
            "verse 72:2": "Ол тура жолға салады. Біз оған сендік. Енді Раббымызға ешкімді серік етіп қоспаймыз",
            "verse 72:3": "Әрі күдіксіз, Раббымыздың ұлылығы өте жоғары. Ол Өзіне жұбай да, бала да алған емес",
            "verse 72:4": "Ал біздің ішіміздегі жетесіз Ібіліс Аллаһ жөнінде шектен шыққан сөз айтатын еді",
            "verse 72:5": "Ақиқатында, біз адамдар да, жындар да Аллаһ жөнінде ешқашан өтірік айтпайды деп ойлаған едік",
            "verse 72:6": "Адамдардың ішіндегі кейбір кісілер жындардың ішіндегі кейбір еркек жындардан пана сұрап, олардың менменсіп, басынуларын арттыратын еді",
            "verse 72:7": "Әрі олар да сендер сияқты «Аллаһ ешқашан, ешкімді қайта тірілтпейді», деп ойлаған еді",
            "verse 72:8": "Анығында, біз аспанға шыққанымызда, оны аспанды қатаң күзетшілер мен отты ұшқындар толы түрде таптық",
            "verse 72:9": "Әрі расында, біз оның аспанның кейбір жайларында тыңдау үшін отыратын едік. Ал, енді кім тыңдамақшы болса, сол сәтте-ақ ол өзін көздеген отты ұшқынға кезігеді",
            "verse 72:10": "Шын мәнінде, біз білмейміз, жер бетіндегілерге жамандық көзделді ме әлде оларға өздерінің Раббысы тура жолды қалады ма",
            "verse 72:11": "Ақиқатында, біздің арамызда түзулер де бар және арамызда одан өзгелер де бар. Біз түрлі жолдарда едік",
            "verse 72:12": "Негізінде, біз Аллаһты Оның құдіретін жерде ешқашан әлсірете алмайтынымызды және қашып та Оны Оның азабын! ешқашан әлсірете алмайтынымызды білдік",
            "verse 72:13": "Әрі біз тура жолды естіген соң, оған сендік. Кім Раббысына сенсе, ол жақсылығының кемуінен де, әділетсіздіктен де қорықпайды",
            "verse 72:14": "Ақиқатында, біздің арамызда мұсылмандар бойсұнушылар да бар және арамыз­да ауытқығандар бар. Кім бойсұнса, міне, солар туралықты ұстанған болады",
            "verse 72:15": "Ал, ауытқығандар Жаһаннамға отын болады»,- деді",
            "verse 72:16": "Егер олар ауытқығандар жолда тура дұрыс тұрғандарында, онда Біз оларды мол сумен қамтамасыз етер едік",
            "verse 72:17": "сонымен оларды сынау үшін. Кім Раббысының Еске салуынан Құраннан бет бұрса, Ол оны ауыр азапқа салады",
            "verse 72:18": "Әрі ақиқатында, мешіттер Аллаһтікі. Аллаһпен қатар ешкімді шақырмаңдар құлшылық етпеңдер",
            "verse 72:19": "Әрі шын мәнінде, Аллаһтың құлы Оған дұға қылып тұрған кезінде, олар жындар үсті-үстіне үймелеп, оның үстіне түсе жаздады",
            "verse 72:20": "Ей, Мұхаммед! Айт: «Шын мәнінде, мен тек Раббымнан ғана тілеймін, Оған ешкімді серік етіп қоспаймын», деп",
            "verse 72:21": "Айт: «Ақиқатында мен сендерге зиян да тигізе алмаймын әрі тура жолға салу билігіне де ие емеспін», деп",
            "verse 72:22": "Айт: «Ақиқатында мені ешкім Аллаһтан қорғай алмайды әрі мен де Одан басқа бір қорғаныш-пана таба алмаймын",
            "verse 72:23": "Мен тек Аллаһтан жіберілгенді әрі Оның тапсырғанын жеткіземін. Енді кім Аллаһқа және Оның елшісіне қарсы келсе, әлбетте, оған Жаһаннам оты бар. Олар онда мәңгі қалады», деп",
            "verse 72:24": "Олар өздеріне уәде етілгенді көрген сәтте, кімнің жәрдемшілерінің әлсіз және саны аз екенін біледі",
            "verse 72:25": "Ей, Мұхаммед! Айт: «Сендерге уәде етілген нәрсе жақын ба, әлде Раббым оғанұзақ мерзім белгіледі ме, білмеймін», деп",
            "verse 72:26": "Ол ғайыпты Білуші. Өзінің ғайып еткенін ешкімге білдірмейді",
            "verse 72:27": "тек, Өзі разы болған елшілерге ғана білдіреді . Сонда оның алдынан да, артынан да күзетушілер қорғаушылар қойып қояды",
            "verse 72:28": "олардың елшілердің Раббысының жібергендерін жеткізгендігін білу үшін. Ол олардағыны барлық нәрсені қамтыған және әрбір нәрсені санап, есептеп қойған"
        },
        "Korean": {
            "verse 72:1": "그대는 말하라 : 나에게 다음의 계시가 내려졌노라 ; 진의 한 무리가 경청한 후 말하길 \"실로 우리는 놀라운 낭송을 들었습니다일러가로되 내게 말씀이 계시 되었고 한 무리의 영마가 꾸란을 듣고 말하길 실로 우리는 아름다 운 꾸란 낭송을 들었노라 하더라",
            "verse 72:2": "그것(꾸란)은 올바름으로 가는 길을 가리키기에 우리는 그것을 믿었습니다. 그리고 우리는 우리 주님께 어떤 대등한 존재도 두지 않을 것입니다그것은 바른 길로 인도하여 주 는 것이니 우리가 그것을 믿되 주님을 어떤 것과 비유하지 않노라",
            "verse 72:3": "실로 우리 주님의 부(富)는 지고하시며 그분께서는 배우자도 자식도 가지지 않으셨습니다하나님은 가장 위대한 주님으 로 아내도 그리고 자손도 두지 않 으신 분이라",
            "verse 72:4": "실로 우리 중의 우매한 자는 하나님에 관하여 가당하지 않는 말을 하곤 하였습니다우리 가운데 우매한 자들이 있어 하나님을 거역하고 거짓하는 자 있었으나",
            "verse 72:5": "“실로 우리는 인간과 진이 하나님에 관하여 결코 거짓을 말하지 않을 것이라 생각하였습니다”우리는 사람도 영마도 하나님 께 거역하고 거짓말하리라 생각 지 아니 했노라",
            "verse 72:6": "“실로 인간 남성들은 진 남성들에게 보호를 요청하곤 하였고 그리하여 그들(인간)은 그들(진)에게 거드름을 더해 주었습니다”사람중에 영마의 무리에게 보호를 구하는 자 있으나 그들은 오히려 그들에게 어리석음을 더하여 주니라",
            "verse 72:7": "“그리고 실로 그들(인간)은, 그대들(진)이 생각한 것처럼 하나님께서 그 누구도 결코 부활시키지 않을 것이라 생각하였습니다”그들은 너희가 생각했듯 하 나님은 어느 누구도 부활시키지 않으리라 생각했더라",
            "verse 72:8": "“실로 우리가 하늘을 훑어보았더니 그곳(하늘)이 파수꾼들과 별똥별들로 가득찬 것을 발견하였습니다”우리가 하늘에 이르려고 시도하였으나 힘센 수호자들과 빛나는별들로 가득차 있음을 알았노라",
            "verse 72:9": "“실로 우리는 엿듣기 위해 그곳(하늘)에 착석하곤 하였습니다. 그러나 엿들으려 하는 자는 이제, 그를 위해 준비된 엄호하는 별똥별에 직면하는 것입니다”실로 우리는 보이지 않는 곳 에 앉아 소식을 엿듣곤 하였으나 그렇게 엿들으려는 자는 유성이 숨어서 그를 기다리고 있음을 알 게 되리라",
            "verse 72:10": "“지구에 있는 자들에게 나쁜 것이 의도된 것인지 아니면 그들 주님께서 그들에게 좋은 것을 원하시는 것인지 실로 우리는 모릅니다”우리는 지상에 있는 그들 위에 재앙이 있을 것인지 아니면 주님께서 그들을 인도 하실련지 알지 못하노라",
            "verse 72:11": "“실로 우리 중에는 선량한 자들이 있고 우리 중에는 그렇지 않은 자들이 있습니다. 우리들은 가는 길이 제각각이었습니다”우리 중에는 의로운 자들이있고 의롭지 못한 자들이 있어 우리는 다른 길을 따르고 있노라",
            "verse 72:12": "“실로 우리는 지구에서 하나님을 결코 피해갈 수 없으며 도망한대도 우리가 그분을 결코 피해갈 수 없음을 확신하였습니다”우리는 대지 위에서 하나님 을 초월하고 또한 그분을 피할 수 없음을 알고 있노라",
            "verse 72:13": "“실로 우리가 인도의 말씀을 들었을 때 우리는 그것을 믿었습니다. 자신의 주님을 믿는 자가 있다면 그는 부족함도 부당함도 두려워하지 않을 것입니다”우리는 복음을 들었을 때 그 것을 믿었으니 주님을 믿는 자 누 구든 어떤 손실과 수치도 두려워 하지 않노라",
            "verse 72:14": "“실로 우리의 일부는 무슬림들이며 우리의 일부는 부조리한 자들입니다. 이슬람을 받아들인 자 그들은 좋은 것을 추구한 자들입니다”우리 중에 하나님께 귀의하 는 자 있고 이탈하는 자 있나니 귀의하는 자 누구든 올바른 길을 추구하노라",
            "verse 72:15": "“부조리한 자들에 관해서는 그들은 지옥을 위한 장작더미가 될 것입니다”그러나 바른 길에서 이탈하 는 자 그들은 불지옥의 연료가 되 니라",
            "verse 72:16": "만약 그들이 올바른 길을 따르며 굳건하였다면 나는 그들이 풍성한 물을 마시도록 하였을 것이라하나님의 말씀이 있어 만일 그들이 바른 길을 걷는다면 내가 그 들 위에 풍성한 비를 내려 주리라",
            "verse 72:17": "그리하여 나는 그(은총)에 관해 그들을 시험하노라. 자신의 주님을 떠올리는 일에 등돌리는 자 그분께서는 그를 고된 벌 속에 들게 하실 것이라하나님은 그렇게 하여 그들을 시험하였나니 주님의 가르침을 외 면하는 자 있다면 그분은 그를 고 통스러운 응벌속에 들게 하리라",
            "verse 72:18": "실로 성원은 하나님을 위한 것이니 그대들은 하나님과 더불어 다른 것에 기도하지 말라사원은 하나님의 것이거늘하 나님과 어떤 것도 비유하지 말라",
            "verse 72:19": "실로 하나님의 종복이 서서 그분께 기도할 때 그들은 그에게 밀착하기 직전이었노라하나님의 종이 일어나 그분께 경배하니 그들이 떼를지어 그 를 둘러 싸더라",
            "verse 72:20": "그대(무함마드)는 말하라 : 나는 오직 나의 주님께 기도할 뿐이며 그분께 어떤 대등한 존재도 두지 않노라일러가로되 실로 나는 주님 만을 경배하며 그분에게 어떤 것 도 비유하지 아니하노라",
            "verse 72:21": "그대(무함마드)는 말하라 : 실로 나는 그대들에게 어떤 해악이나 좋은 것도 통제하지 못하노라일러가로되 스스로에게 해악을 끼치는 너희를 바른길로 인도 하는 것은 나의 능력이 아니라",
            "verse 72:22": "그대(무함마드)는 말하라 : 그 누구도 하나님으로부터 나를 구원하지 못하며 나는 결코 그분 이외의 도피처를 찾지 못할 것이라`일러가로되 하나님에 대항하여 나를 보호하여 줄 어느 누구도없으니 나는 그분 외에 어떤 곳에서도 안식처를 구할 수 없노라",
            "verse 72:23": "`그러나 하나님으로부터의 (진리) 전달과 그분의 메시지는 나의 몫이라. 하나님과 그의 사도에 불복하는 자가 있다면 실로 지옥의 불이 그의 것이니 그들은 그곳에서 영원히 머물 것이라`실로 나는 하나님의 계시와 메세지를 전하는 것 뿐으로 하나 님과 그분의 선지자를 거역하는 자 볼지옥에 들어가 그곳에서 영 주하리라",
            "verse 72:24": "`(그들의 불신은) 그들이 약속받은 것을 볼 때까지라. 그 때 그들은 누가 더 허약한 조력자를 가지고 더 적은 숫자가 될 것인지 알게 될 것이라`그들은 약속받은 것을 보게 되리니 그때 그들은 누가 더 약한자이며 어느 쪽이 열세인가를 알 게 되리라",
            "verse 72:25": "그대(무함마드)는 말하라 : 그대들이 약속받은 것이 가까운지 아니면 나의 주님께서 그것에 기한을 두셨는지 나는 모르노라일러가로되 너희가 약속받은 응벌이 가까이 왔는지 아니면 주 님께서 일정기간 동안 유예하셨는 지 알지 못하노라",
            "verse 72:26": "`보이지 않는 것도 아시는 분. 그리하여 그분께서는 그 누구에게도 그분의 보이지 않는 영역을 보여주지 않으시노라`하나님만이 보이지 않는 것 을 알 뿐으로 그분은 어느 누구에 게도 그분의 신비를 알려 주지 않 으시니라",
            "verse 72:27": "`그러나 그분께서 선택하신 사도는 예외로서 실로 그분께서는 그의 앞쪽과 그의 뒤쪽 사이에 엄호하는 자들을 보내시노라`그러나 그분이 선택한 선지 자는 제외로 그분은 한 무리의 수 호자들로 하여금 그의 앞뒤를 행 진케 하시니라",
            "verse 72:28": "`이는, 그들(이전 사도들)이 이미 그들 주님의 메시지를 전달하였음을 그(사도)가 알도록 하기 위함이라. 그리고 그분께서는 그들에게 있는 것을 아우르시며 모든 것을 숫자로 헤아리셨노라`하나님은 그들이 주님의 메 세지를 전달하였는지 알고자 하심 이며 또한 그분은 그들과 함께 있 는 모든 신비들을 에워싸고 계시 며 모든 것을 숫자로 기록하시니라"
        },
        "Kurdish": {
            "verse 72:1": "(Muhammed! tu ji bona wan ra aha) bêje: \"bi rastî li bal min da hatîye niqandinê, ku çend nijdewanê ji cunûkan eva (Qu´ran a) guhdarî kirine û paşê ji hev ra (aha) gotine: \"Bi rastî me guhdarî ya Qu´ran-eke sodret kirîyeئه‌ی محمد صلی الله علیه وسلم پێیان بڵێ: وه‌حی و نیگام پێڕاگه‌یه‌نراوه که به‌ڕاستی ده‌سته‌یه‌ك له په‌ریان گوێیان گرتووه بۆ خوێندنه‌وه‌ی قورئان و جا که ته‌واو بووه وتویانه‌: به‌ڕاستی ئێمه خوێندنه‌وه‌یه‌کی سه‌رسوڕهێنه‌رمان بیست.",
            "verse 72:2": "Ewa (Qu´ran a) beledî ya rê ya rast dike, îdî me jî bi wê (Qu´ran ê) bawer kir. Îdî em tu kesî naxne hempaê Xuda yê xweهیدایه‌ت ده‌دات بۆ ڕێبازی ژیری و تێگه‌یشتن، ئێمه‌ش باوه‌ڕمان پێ کردو هه‌رگیز که‌س ناکه‌ینه شه‌ریك و هاوه‌ڵ بۆ په‌روه‌ردگارمان.",
            "verse 72:3": "Bi rastî temtêla Xuda yê me ji her kemasîyan paqij e (Xuda yê me) qe ji bona xwe ra tu hevalê jînê zar ne girtineبه‌ڕاستی په‌روه‌ردگاری پایه بڵندمان مه‌زن و گه‌وره‌یه‌، بێگومان ئه‌و زاته نه هاوسه‌ری بڕیارداوه نه نه‌وه‌ش.",
            "verse 72:4": "Bi rastî nezan û evsenene me di hemberê Yezdan da mijûlîne necê dibêjinبه‌ڕاستی بێ دین و یاخیه‌که‌مان (واته ئیبلیس) شتی زۆر ناڕه‌واو نابه‌جێی بۆ خوا هه‌ڵبه‌ستووه (ده‌یه‌وێت هه‌موومان گومڕا بکات).",
            "verse 72:5": "Bi rastî me guman dikir, ku meriv û cunûk li ser (navê) Yezdan derewan nakinئێمه گومانمان وابوو که ده‌سته‌ی ئاده‌میزادو په‌ری هه‌رگیز درۆ به‌ناوی خواوه ناکه‌ن!!",
            "verse 72:6": "Bi rastî mêrne ji merivan hane! xwe diavîtne berbextê mêrne ji cunûkan, îdî meçetiran jî xwe pir qure dikirinبه‌ڕاستی پیاوانێك له ده‌سته‌ی ئاده‌میزاد په‌نایان ده‌برد به پیاوانێك له ده‌سته‌ی په‌ریه‌کان (په‌ریه‌کان ئه‌مه‌یان به‌هه‌لزانی) که‌چی ئه‌وه‌نده‌ی تر مانوویان کردن (به‌خورافات و شتی بێ سه‌رو به‌ر).",
            "verse 72:7": "Bi rastî (cunûkan jî) wekî we guman dikirin, ku Yezdan tu kesî (ji piştî mirinê) ranake naşîn civîneجا بێگومان په‌ریه‌کانیش گومانیان وه‌ك گومانی ئێوه وابوو که‌: ئیتر خوا هه‌رگیز هیچ پێغه‌مبه‌رێکی تر نانێرێت.",
            "verse 72:8": "Bi rastî me destê xwe da ezmana; me (dêna) xwe dayê, ku nobedarê zor û alava (agirva) tijî bûئێمه‌ش به‌ڕاستی به‌ره‌و ئاسمان کشاین و هه‌ست و هۆشمان خسته‌کار، سه‌رنجماندا که پڕه له پاسه‌وانی به‌تواناو بێ شومار، نه‌یزه‌کیش به هه‌موو لایه‌کدا ده‌کشا، (دیار بوو که ڕووداوێکی گه‌وره ڕووی دابوو).",
            "verse 72:9": "Bi rastî ji bona guhdarîyê, em di şûnê xurî da di (ezman) da rûdiniştin, îdî kîjan di naha da guhdarî bike alava nobedarekî dîdeban rastê wî têئێمه جاران له هه‌ندێك شوێنی ئاسماندا خۆمان حه‌شارده‌دا بۆ گوێگرتن و ده‌نگوباس بیستن، به‌ڵام ئێستا ئه‌وه‌ی بیه‌وێت گوێ بگرێت یه‌کسه‌ر نه‌یزه‌کێکی بۆ ئاماده‌یه‌و بۆی ده‌هاوێژرێت و له‌ناوی ده‌بات.",
            "verse 72:10": "Bi rastî me nizanîye gelo (Xuda) ji bona wanê di zemîn da sikatî va ye, ya jî Xuda yê wan ji bona wan ra qencî va yeجا به‌ڕاستی ئێمه نازانین ئایا نه‌خشه‌یه‌کی شه‌ڕو وێرانکاری کێشراوه بۆ دانیشتوانی سه‌ر زه‌وی، یاخود په‌روه‌ردگاریان ده‌یه‌وێت ڕێنموویی و هیدایه‌تیان بدات بۆ دینداری و سه‌رفرازی.",
            "verse 72:11": "Bi rastî ji me (cunûkan) aştîkar hene, ça ji me ne aştîkar jî hene, ji bo ku em di rê û olê cure û cure dabûn evan nemekhevyan çê dibûnبێگومان ئێمه که‌سانی چاك و دیندارمان هه‌یه‌، هه‌روه‌ها که‌سانی تریش که‌به‌و شێوه‌یه نین، ئێمه جاران ڕێگه‌و ڕێبازو به‌رنامه‌ی هه‌مه جۆرمان گرتبووه‌به‌ر (به‌ڵام ئێسته به‌رنامه‌ی ئیسلام ڕون و دیاره‌).",
            "verse 72:12": "Bi rastî me guman dikir ku em nikarin di zemîn da Yezdan bêzar bikin û rava me jî (Yezdan) bêzar nake (ku me celat neke)ئێمه دڵنیا بووین که هه‌رگیز له‌ژێر ده‌سه‌ڵاتی خوا ده‌رناچن له زه‌ویدا، هه‌روه‌ها به‌هه‌ڵاتن و خۆ دزینه‌وه‌ش هه‌رگیز له ژێر ده‌سه‌ڵاتی خوا ده‌رناچین.",
            "verse 72:13": "Gava me bi rastî beledî bihîst, îdî me bi wê (Qu´ran) ê bawer kir. Kîjan bi Xuda yê xwe bawer bike, îdî ewa bila ji kêmaya xelat û celat kirinê netirseبه‌ڕاستی ئێمه کاتێك گوێمان له بانگه‌وازی هیدایه‌ت بوو، یه‌کسه‌ر باوه‌ڕمان پێکرد، جا ئه‌وه‌ی ئیمان بهێنێت به په‌روه‌ردگاری، ئیتر ناترسێت له‌وه‌ی، کرده‌وه چاکه‌کانی بێ نرخ ته‌ماشا بکرێت، له گوناهه‌کانیشی چاوپۆشی نه‌کرێت.",
            "verse 72:14": "Û bi rastî ji me Misilman jî hene û ji me ji rê ya (rast) derketî jî hene, îdî kîjan Misilman bibe,ewan li rê ya rast geryaneبه‌ڕاستی له‌ناو ئێمه‌دا که‌سانی موسوڵمان و خواناس هه‌یه‌، که‌سانی بێ دین و خوانه‌ناس و سه‌ر که‌شیش، جا ئه‌وه‌ی موسوڵمان ده‌بێت دیاره که ڕێبازی سه‌ر فرازی دۆزیوه‌ته‌وه‌.",
            "verse 72:15": "Ewanê ji rê ya rast derketine hene! Îdî ewan ji bona doje ra bûne ardûkبه‌ڵام خوانه‌ناس و سه‌ر که‌شه‌کان به‌سه‌ریانه‌وه ناچێت به‌ڵکو ده‌بنه سوته‌مه‌نی دۆزه‌خ (لێره‌دا گوفتاری په‌ریه ئیمانداره‌کان ته‌واو ده‌بێت).",
            "verse 72:16": "(Yezdan li ser gotina meçêtiran aha dibêje): \"heke ewan (cunûkan) di rê ya rast da bi çûnan, meyê ewan bi aveke pir av bidan (ku rojînê wan pir bibû ya)جا ئه‌گه‌ر ئه‌و خه‌ڵکه ڕێگه‌ی ئیسلامه‌تی و دینداری بگرنه به‌ر ئێمه بارانی پڕ به‌ره‌که‌تیان به‌سه‌ردا ده‌بارێنین.",
            "verse 72:17": "Ji bo ku em ewan di qencîyan da biceribînin (ka sipasî ya qencîne me dikin, ya qe nakin. Û kîjan ji sipasî ya Xuda yê xwe rû bifitilîne (Xuda yê wî) ewî dixe şapateke serberjêrkarتا له‌وه‌شدا تاقییان بکه‌ینه‌وه‌و (به ته‌واوی ده‌ر ده‌که‌وێت کێ به‌نده‌ی ڕاسته‌قینه‌یه‌و کێیش به دنیا ده‌خه‌ڵه‌تێت) جا ئه‌وه‌ی له یادو به‌رنامه‌ی په‌روه‌ردگاری لابدات، ده‌یخاته ناو سزاو ئازارێکی به‌رده‌وام.",
            "verse 72:18": "Bi rastî mizgevt hemû ji bona Yezdan r anin, îdî hûn (di wan mizgevtan da) ji tu kesî ra perestî nekinدڵنیابن که‌: مزگه‌وته‌کان تایبه‌تی خوای گه‌وره‌ن، ده‌بێت هه‌ر ئه‌وه‌ی تێدا بپه‌رسترێت و ناوی که‌سی تر نه‌کرێته شه‌ریك و هاوتای ناوی ئه‌و زاته‌.",
            "verse 72:19": "Bi rastî gava bendeyê Yezdan rabûye gazî bal perestî ya wî kirîye (ewan cunûkan) nêzîk dibûn, ku wekî kulavan ( li dora Pêxember bicivin) ewî binixîmîninجا کاتێکیش به‌نده‌ی خوا محمد صلی الله علیه وسلم بانگه‌وازی بۆ شوێنکه‌وتنی به‌رنامه‌ی خوا ده‌کرد (ئه‌و خه‌ڵکه به‌ده‌سته‌ی ئاده‌میزادو په‌ریه‌وه‌) خه‌ریکبوو له ناوی به‌رن (نووری خوا بکوژێننه‌وه‌).",
            "verse 72:20": "(Muhenuned! tu ji bona wan ra aha) bêje: \"ez hey bi rastî perestî ya Xuda yê xwe dikim. Û ez ji bona Xuda yê xwe ra jî, tu kesî naxme hempaپێیان بڵێ: من هه‌ر به‌رده‌وام ده‌بم و هه‌ر بانگه‌واز ده‌که‌م بۆ لای په‌روه‌ردگارم، که‌سیش ناکه‌مه هاوه‌ڵ و شه‌ریکی.",
            "verse 72:21": "Tu (ji bona wan ra aha) bêje: \"bi rastî ez ji bona we ra qe tu zîyan û rehberî nakimهه‌روه‌ها پێیان بڵێ: من هیچ جۆره زه‌ره‌رو زیانێکم به‌ده‌ست نیه‌، هه‌روه‌ها هیدایه‌تیش به‌ده‌ست من نیه (ئه‌گه‌ر خۆتان بیر نه‌که‌نه‌وه‌، قه‌ناعه‌ت به‌زۆر نی یه‌).",
            "verse 72:22": "Tu (ji bona wan ra) bêje, \"bi rastî (heke Yezdan nexwaşyekî bide min) tu kes ji pêştirê wî min naparisîne, ez ji pêştirê Yezdan jî rastê tu kesekî, ku xwe bavêjime berbextê wî nayêmبڵێ: به‌ڕاستی من هه‌رگیز هیچ که‌سێك له خوا په‌نام نادات ئه‌گه‌ر خوا بیه‌وێت تووشی زیانێکم بکات و هه‌رگیز په‌ناگایه‌کم ده‌ست ناکه‌وێت جگه لای خوا نه‌بێت.",
            "verse 72:23": "Ez hey (wan bi yarne) Yezdan û pêxemberî ya wî ku li bal min da hînartîye, li bal we da radigihinim. Kîjan bê gotina Yezdan û qasidê wî bike, îdî ji bona wî ra agirê dojê heye. Ewanê di dojê da her bimîninبه‌ڵکو من ته‌نها گه‌یاندنی په‌یامه‌کان و به‌رنامه‌ی خوام له‌سه‌ره‌، جا ئه‌وه‌ی له خواو پێغه‌مبه‌ره‌که‌ی یاخی ببێت ئه‌وه با دڵنیابێت که دۆزه‌خی بۆ ئاماده‌کراوه بۆ هه‌میشه‌و هه‌تاهه‌تایی.",
            "verse 72:24": "Heya ewan, ewê şapata, ku ji bona wan ra hatîye peyman danê dibînin, îdî ewanê bizanin ka bi arîkar kê bêwec û hindikinهه‌تا کاتێك هه‌ڕه‌شه‌کان ده‌بینن، ئه‌و کاته ئیتر ده‌زانن، کێ پشتیوانی لاوازه‌و ژماره‌که‌ی که‌مه‌.",
            "verse 72:25": "(Muhemmed! tu ji bona wan ra aha) bêje: \"Bi rastî ez nizanim; gelo ewa (şapata) ji bona wan ra hatîye peymandanê nezîke ya jî Xuda yê minê ji bona wî ra danekî dirêj çêkeهه‌روه‌ها پێیان بڵێ: من نازانم ئایا ئه‌و هه‌ڕه‌شانه‌ی لێتان ده‌کرێت نزیکه یاخود ماوه‌یه‌کی درێژی بۆ داده‌نێت.",
            "verse 72:26": "Zana yê bi veşartîyan, hey (Yezdan ê), îdî tu kes li ser veşartînê (Yezdan da) nayêئه‌و زاته زانای نهێنی و شاراوه‌کانه‌، که‌سیش له نهێنی و شاراوه‌کانی ئاگادار ناکات.",
            "verse 72:27": "Ji pêştirê ewan qasidên, ku bi xweber ji bona zanîna wan ra qayîl be. Loma îdî (Yezdan) di ber û paşî ya wan (qasidan) dadîdevanan digerîn eمه‌گه‌ر بۆ پێغه‌مبه‌رێك خوا خۆی ڕازی بێت (به‌وه‌ی هه‌ندێ نهێنی بزانێت)، ئه‌و کاته فریشته ده‌کاته پاسه‌وانی له به‌رو پشته‌وه (تا په‌ری و شه‌یتانه‌کان نه‌توانن زه‌فه‌ری پێ به‌رن)...",
            "verse 72:28": "(Yezdan aha) dike; ji bona ku ewa bizane bi rastî ewan pêxemberan fermanê Xuda yê ragihandine. Û çiz anîn li bal wan heye ewî ewn hemû hildane binê zanîna xwe û hemû tişt jî jimartin eتا خوا چاك بزانێت و ئاگادار بێت له‌وه‌ی به‌ڕێکوپێکی په‌یام و ڕێنموویی په‌روه‌ردگاریان گه‌یاندووه‌، هه‌رچه‌نده خوا به‌هه‌موو ئه‌و شتانه‌ش ئاگاداره که کردوویانه و پێی هه‌ستاون و هه‌موو شتێك لای ئه‌و زاته به‌ژماره ئامار کراوه‌."
        },
        "Kyrgyz": {
            "verse 72:1": "Айт (о, Мухаммад) “Мага (Аллаһ Тааладан мындай деген) вахий келди: Жиндерден бир жамааты (Кураанды) угушту жана (бири-бирине мындай) дешти: “Биз ажаайып Кураан? уктук",
            "verse 72:2": "Ал Туура Жолго баштайт экен. Биз ага ыйман келтирдик. Эми, биз Раббибизге эч кимди шерик кылбайбыз",
            "verse 72:3": "Чынында Раббибиздин кудурети бийик (жана) Ал (Өзүнө) аял да, перзент да туткан эмес",
            "verse 72:4": "Чынында, биздин акмактарыбыз Аллаһ жөнүндө акылга сыйбаган (жалган) сөздөрдү айтышат",
            "verse 72:5": "Биз болсо, инсандар менен жиндер Аллаһка (Анын улуулугуна жарашпаган) жалган сөздөрдү эч качан доомат кылбайт деп ойлочубуз",
            "verse 72:6": "Көрсө, инсандардан кээ бир адамдар кээ бир жиндерден коргоо сурашат экен. Натыйжада алар (жиндер) алардын коркуусун (дагы да) көбөйтүп коюшат",
            "verse 72:7": "Алар (жиндердин арасындагы каапырлар) дагы силер(дин араңардагы каапырлар) күмөн кылгандай Аллаһ эч кимди эч качан кайра тирилтире албайт деп ойлошот",
            "verse 72:8": "Биз асманга тырмышканда, аны (периштелерден турган) корукчулар жана оттуу жылдыздар менен толо экенин көрдүк",
            "verse 72:9": "Мурун биз асмандагы тыңшоочу орундарга олтуруп (кайып кабарын угуп) алаар элек. Эми болсо, ким угууга аракет кылса аңдып-күтүп турган оттуу жылдызга жолугат",
            "verse 72:10": "Жана биз (асмандагы кайып илиминде) жердеги кишилерге жамандык белгилендиби же Раббиси аларга жакшылык кааладыбы, биле албай калабыз",
            "verse 72:11": "Биздин арабызда (ыймандуу) жакшыларыбыз да, андан башкачаларыбыз да бар. Биз ар кандай жолдогулар элек",
            "verse 72:12": "Жана биз аныгында (төмөндөгү чындыкка) ынандык: Биз эч качан жер бетинде (же асманда) Аллаһты алсыз кыла албайт экенбиз жана Андан качып да кете албайт экенбиз.”",
            "verse 72:13": "Биз (Кураандагы) Туура Жолду укканыбызда ага ыйман келтирдик. Ким Раббисине ыйман келтирсе (жасаган сооп иштери) кемитип коюлуудан жана (күнөөлөрүнүн) көбөйтүп коюлуусунан коркпойт",
            "verse 72:14": "Биздин арабызда мусулмандар да бар (ислам жолунан) адашкандар да бар. Эми ким исламга кирген болсо, анда алар туура багытты тандап алышыптыр",
            "verse 72:15": "Ал эми, адашкандар (демек алар) тозокко отун болгондор",
            "verse 72:16": "Эгер алар (исламдык) жолдо түз жүрсө мол суу менен сугарабыз",
            "verse 72:17": "аларды сынаш үчүн.! Жана (ошондо) ким Раббисинин эскертүүсүнөн (Кураандан) жүз бурса, (Аллаһ) аны оор азапка жолуктурат",
            "verse 72:18": "(Бардык) мечиттер Аллаһка ибадат кылуу үчүн! Силер Аллаһка кошуп башка “кудайларга” дуба кылбагыла",
            "verse 72:19": "Аллаһтын пендеси (Мухаммад Кураан окуу менен) Аллаһка дуба кылып турганда (жиндер жабалактап келип) бири-бирин басып-тебелеп таштоого аз калды",
            "verse 72:20": "Айт (о, Мухаммад!): “Мен жалаң өзүмдүн Раббиме гана дуба (ибадат) кыламын жана Ага эч нерсени шерик кылбаймын”",
            "verse 72:21": "Айт: “Силерге зыян жеткирүү да, пайда келтирүү да менин колуман келбейт”",
            "verse 72:22": "(Дагы) айт: “(Эгер мен күнөө иш кылчу болсом) мени Аллаһтын азабынан эч ким сактап кала албайт жана мен эч качан (жалынып баруу үчүн) Андан башка коргоочу таба албаймын",
            "verse 72:23": "(Менин колумда) Аллаһ тарабынан (келген кабарларды) жеткирүү жана Анын пайгамбарлыгы гана (бар) Ким Аллаһ жана пайгамбарына күнөө кылса, ага тозок оту даяр! Ал жерде түбөлүк калышат",
            "verse 72:24": "Алар өздөрүнө убада кылынган нерсени (азапты) көргөндө, кимдин колдоочусу алсызыраак жана саны азыраак экенин билип алышат",
            "verse 72:25": "Айт: ”Силерге убада кылынган нерсе жакынбы же Раббим ага алыс мөөнөт койгонбу, билбеймин”",
            "verse 72:26": "Кайыпты билүүчү (Аллаһ!) Ал Өз кайыбын эч кимге билдирбейт",
            "verse 72:27": "Бирок, Өзү каалаган пайгамбар(лар)га гана билдирет. Албетте, Аллаһ анын (пайгамбардын) алды жана арты жагынан (периште) коргоочуларды дайындайт",
            "verse 72:28": "(Мухаммад төмөнкүлөрдү) билиши үчүн: (периштелер) Раббисинин кабарларын (жиндерден коргоп) жеткизишкен жана (Раббиси) алардын (бардык) абалдарын билип, бардык нерселерди эсеп-китеп кылып койгон"
        },
        "Malay": {
            "verse 72:1": "Katakanlah (wahai Muhammad): \"Telah diwahyukan kepadaku, bahawa sesungguhnya: satu rombongan jin telah mendengar (Al-Quran yang aku bacakan), lalu mereka (menyampaikan hal itu kepada kaumnya dengan) berkata: `Sesungguhnya kami telah mendengar Al-Quran (sebuah Kitab Suci) yang susunannya dan kandungannya sungguh menakjubkan!",
            "verse 72:2": "`Kitab yang memberi panduan ke jalan yang betul, lalu kami beriman kepadanya, dan kami tidak sekali-kali akan mempersekutukan sesuatu makhluk dengan Tuhan kami.",
            "verse 72:3": "`Dan (ketahuilah wahai kaum kami!) Bahawa sesungguhnya: tertinggilah kebesaran dan keagungan Tuhan kita daripada beristeri atau beranak.",
            "verse 72:4": "`Dan (dengan ajaran Al-Quran nyatalah) bahawa sesungguhnya: (ketua) yang kurang akal pertimbangannya dari kalangan kita telah mengatakan terhadap Allah kata-kata yang melampaui kebenaran;",
            "verse 72:5": "`Dan bahawa sesungguhnya (nyatalah kesalahan) kita menyangka bahawa manusia dan jin tidak sekali-kali akan berani mengatakan sesuatu yang dusta terhadap Allah.",
            "verse 72:6": "`Dan bahawa sesungguhnya adalah (amat salah perbuatan) beberapa orang dari manusia, menjaga dan melindungi dirinya dengan meminta pertolongan kepada ketua-ketua golongan jin, kerana dengan permintaan itu mereka menjadikan golongan jin bertambah sombong dan jahat.",
            "verse 72:7": "`Dan bahawa sesungguhnya (tidaklah benar) manusia menyangka sebagaimana yang kamu sangka, bahawa Allah tidak sekali-kali mengutuskan sebarang Rasul (atau tidak akan membangkitkan manusia pada hari kiamat).",
            "verse 72:8": "`Dan bahawa sesungguhnya kami telah berusaha mencari berita langit, lalu kami dapati langit itu penuh dengan pengawal-pengawal yang sangat kuat kawalannya, dan (dengan rejaman-rejaman) api yang menyala.",
            "verse 72:9": "`Padahal sesungguhnya kami dahulu biasa menduduki tempat-tempat (perhentian) di langit untuk mendengar (percakapan penduduknya); maka sekarang sesiapa yang cuba mendengar, akan mendapati api yang menyala yang menunggu merejamnya.",
            "verse 72:10": "`Dan bahawa sesungguhnya kami tidak mengetahui adakah (dengan adanya kawalan langit yang demikian) hendak menimpakan bala bencana kepada penduduk bumi, atau pun Tuhan mereka hendak melimpahkan kebaikan kepada mereka?",
            "verse 72:11": "`Dan bahawa sesungguhnya (memang maklum) ada di antara kita golongan yang baik keadaannya, dan ada di antara kita yang lain dari itu; kita masing-masing adalah menurut jalan dan cara yang berlainan.",
            "verse 72:12": "`Dan bahawa sesungguhnya kita (sekarang) mengetahui, bahawa kita tidak sekali-kali akan dapat melepaskan diri dari balasan Allah (walau di mana sahaja kita berada) di bumi, dan kita juga tidak sekali-kali akan dapat melarikan diri dari balasanNya (walau ke langit sekalipun).",
            "verse 72:13": "`Dan bahawa sesungguhnya kami, ketika mendengar petunjuk (Al-Quran), kami beriman kepadanya (dengan tidak bertangguh lagi); kerana sesiapa yang beriman kepada Tuhannya, maka tidaklah ia akan merasa bimbang menanggung kerugian (mengenai amalnya yang baik), dan juga tidak akan ditimpakan sebarang kesusahan.",
            "verse 72:14": "`Dan bahawa sesungguhnya (dengan datangnya Al-Quran, nyatalah) ada di antara kita golongan yang berugama Islam, dan ada pula golongan yang (kufur derhaka dengan) menyeleweng dari jalan yang benar; maka sesiapa yang menurut Islam (dengan beriman dan taat), maka merekalah golongan yang bersungguh-sungguh mencari dan menurut jalan yang benar,",
            "verse 72:15": "` Adapun orang-orang yang menyeleweng dari jalan yang benar, maka mereka menjadi bahan bakaran bagi neraka Jahannam. '",
            "verse 72:16": "(Nabi Muhammad diwahyukan menerangkan lagi): \"Dan bahawa sesungguhnya! Kalaulah mereka (manusia dan jin) itu berjalan betul di atas jalan (Islam), sudah tentu Kami (akan memberikan mereka sebab-sebab kemewahan, terutama) menurunkan hujan lebat kepada mereka.",
            "verse 72:17": "\"(Pemberian yang demikian) untuk Kami menguji (dan menzahirkan bawaan dan keadaan) mereka dalam menikmati apa yang Kami berikan itu (adakah mereka bersyukur dan tetap betul menurut Islam); dan (ingatlah), sesiapa yang berpaling dari mengingati Tuhannya, (dengan berlaku ingkar - derhaka, maka) Tuhan akan memasukkannya ke dalam azab yang memuncak beratnya.",
            "verse 72:18": "\"Dan bahawa sesungguhnya masjid-masjid itu untuk (ibadat kepada) Allah semata-mata; maka janganlah kamu seru dan sembah sesiapapun bersama-sama Allah.",
            "verse 72:19": "\"Dan bahawa sesungguhnya, ketika hamba Allah (Nabi Muhammad) berdiri mengerjakan ibadat kepadaNya, mereka hampir-hampir menindih satu sama lain mengerumuninya\".",
            "verse 72:20": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku hanyalah beribadat kepada Tuhanku semata-mata, dan aku tidak mempersekutukanNya dengan sesiapapun\".",
            "verse 72:21": "Katakanlah lagi; \" Sesungguhnya aku tidak berkuasa mendatangkan sebarang mudarat dan tidak juga berkuasa mendatangkan sebarang kebaikan bagi kamu.",
            "verse 72:22": "Katakanlah lagi; \"Sesungguhnya aku, tidak sekali-kali akan dapat diberi perlindungan oleh sesiapapun dari (azab) Allah (jika aku menderhaka kepadaNya), dan aku tidak sekali-kali akan mendapat tempat perlindungan selain daripadaNya,",
            "verse 72:23": "\"(Aku diberi kuasa) hanya menyampaikan (wahyu) dari Allah dan perintah-perintahNya (yang ditugaskan kepadaku menyampaikannya); dan sesiapa yang menderhaka kepada Allah dan ingkarkan bawaan RasulNya, maka sesungguhnya disediakan baginya neraka Jahannam; kekalah mereka di dalamnya selama-lamanya.\".",
            "verse 72:24": "(Golongan yang kufur ingkar itu tetap memandang engkau lemah dan kurang penyokong wahai Muhammad), sehingga apabila mereka melihat (azab) yang dijanjikan kepada mereka, maka (pada saat itu) mereka akan mengetahui siapakah orangnya yang lemah penolong-penolongnya, dan sedikit jumlah bilangannya.",
            "verse 72:25": "(Kalau ditanya bilakah azab itu? Maka) katakanlah: \"Aku tidak mengetahui sama ada (azab) yang dijanjikan kepada kamu itu sudah dekat, atau Tuhanku menentukan bagi kedatangannya satu tempoh yang lanjut.",
            "verse 72:26": "\"Tuhanlah sahaja yang mengetahui segala yang ghaib, maka Ia tidak memberitahu perkara ghaib yang diketahuiNya itu kepada sesiapapun, -",
            "verse 72:27": "\"Melainkan kepada mana-mana Rasul yang di redaiNya (untuk mengetahui sebahagian dari perkara ghaib yang berkaitan dengan tugasnya; apabila Tuhan hendak melakukan yang demikian) maka Ia mengadakan di hadapan dan di belakang Rasul itu malaikat-malaikat yang menjaga dan mengawasnya (sehingga perkara ghaib itu selamat sampai kepada yang berkenaan).",
            "verse 72:28": "\"(Tuhan mengadakan malaikat-malaikat itu) supaya Ia mengetahui bahawa sesungguhnya - (dengan jagaan mereka) - Rasul-rasul itu telah menyampaikan perutusan-perutusan Tuhan mereka, (dengan sempurna); pada hal Ia memang mengetahui dengan meliputi segala keadaan yang ada pada mereka, serta Ia menghitung tiap-tiap sesuatu: satu persatu\"."
        },
        "Malayalam": {
            "verse 72:1": "നബിയേ,) പറയുക: ജിന്നുകളില്‍ നിന്നുള്ള ഒരു സംഘം ഖുര്‍ആന്‍ ശ്രദ്ധിച്ചു കേള്‍ക്കുകയുണ്ടായി എന്ന് എനിക്ക് ദിവ്യബോധനം നല്‍കപ്പെട്ടിരിക്കുന്നു. എന്നിട്ടവര്‍ (സ്വന്തം സമൂഹത്തോട്‌) പറഞ്ഞു: തീര്‍ച്ചയായും അത്ഭുതകരമായ ഒരു ഖുര്‍ആന്‍ ഞങ്ങള്‍ കേട്ടിരിക്കുന്നു.",
            "verse 72:2": "അത് സന്‍മാര്‍ഗത്തിലേക്ക് വഴി കാണിക്കുന്നു. അതു കൊണ്ട് ഞങ്ങള്‍ അതില്‍ വിശ്വസിച്ചു. മേലില്‍ ഞങ്ങളുടെ രക്ഷിതാവിനോട് ആരെയും ഞങ്ങള്‍ പങ്കുചേര്‍ക്കുകയേ ഇല്ല.",
            "verse 72:3": "നമ്മുടെ രക്ഷിതാവിന്‍റെ മഹത്വം ഉന്നതമാകുന്നു. അവന്‍ കൂട്ടുകാരിയെയോ, സന്താനത്തെയോ സ്വീകരിച്ചിട്ടില്ല.",
            "verse 72:4": "ഞങ്ങളിലുള്ള വിഡ്ഢികള്‍ അല്ലാഹുവെപറ്റി അതിക്രമപരമായ പരാമര്‍ശം നടത്തുമായിരുന്നു.",
            "verse 72:5": "ഞങ്ങള്‍ വിചാരിച്ചു; മനുഷ്യരും ജിന്നുകളും അല്ലാഹുവിന്‍റെ പേരില്‍ ഒരിക്കലും കള്ളം പറയുകയില്ലെന്ന്‌. എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:6": "മനുഷ്യരില്‍പെട്ട ചില വ്യക്തികള്‍ ജിന്നുകളില്‍ പെട്ട വ്യക്തികളോട് ശരണം തേടാറുണ്ടായിരുന്നു. അങ്ങനെ അതവര്‍ക്ക് (ജിന്നുകള്‍ക്ക്‌) ഗര്‍വ്വ് വര്‍ദ്ധിപ്പിച്ചു.",
            "verse 72:7": "നിങ്ങള്‍ ധരിച്ചത് പോലെ അവരും ധരിച്ചു; അല്ലാഹു ആരെയും ഉയിര്‍ത്തെഴുന്നേല്‍പിക്കുകയില്ലെന്ന് എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:8": "ഞങ്ങള്‍ ആകാശത്തെ സ്പര്‍ശിച്ചു നോക്കി. അപ്പോള്‍ അത് ശക്തിമത്തായ പാറാവുകാരാലും തീജ്വാലകളാലും നിറക്കപ്പെട്ടതായി ഞങ്ങള്‍ കണ്ടെത്തി എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:9": "(ആകാശത്തിലെ) ചില ഇരിപ്പിടങ്ങളില്‍ ഞങ്ങള്‍ കേള്‍ക്കാന്‍ വേണ്ടി ഇരിക്കാറുണ്ടായിരുന്നു. എന്നാല്‍ ഇപ്പോള്‍ ആരെങ്കിലും ശ്രദ്ധിച്ചു കേള്‍ക്കുകയാണെങ്കില്‍ കാത്തിരിക്കുന്ന അഗ്നിജ്വാലയെ അവന്ന് കണ്ടെത്താനാവും. എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:10": "ഭൂമിയിലുള്ളവരുടെ കാര്യത്തില്‍ തിന്‍മയാണോ, ഉദ്ദേശിക്കപ്പെട്ടിട്ടുള്ളത്‌, അതല്ല അവരുടെ രക്ഷിതാവ് അവരെ നേര്‍വഴിയിലാക്കാന്‍ ഉദ്ദേശിച്ചിരിക്കുകയാണോ എന്ന് ഞങ്ങള്‍ക്ക് അറിഞ്ഞ് കൂടാ.",
            "verse 72:11": "ഞങ്ങളാകട്ടെ, ഞങ്ങളുടെ കൂട്ടത്തില്‍ സദ്‌വൃത്തന്‍മാരുണ്ട്‌. അതില്‍ താഴെയുള്ളവരും ഞങ്ങളുടെ കൂട്ടത്തിലുണ്ട്‌. ഞങ്ങള്‍ വിഭിന്ന മാര്‍ഗങ്ങളായിതീര്‍ന്നിരിക്കുന്നു. എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:12": "ഭൂമിയില്‍ വെച്ച് അല്ലാഹുവെ ഞങ്ങള്‍ക്ക് തോല്‍പിക്കാനാവില്ല എന്നും, ഓടി മാറിക്കളഞ്ഞിട്ട് അവനെ തോല്‍പിക്കാനാവില്ലെന്നും ഞങ്ങള്‍ ധരിച്ചിരിക്കുന്നു",
            "verse 72:13": "സന്‍മാര്‍ഗം കേട്ടപ്പോള്‍ ഞങ്ങള്‍ അതില്‍ വിശ്വസിച്ചിരിക്കുന്നു. അപ്പോള്‍ ഏതൊരുത്തന്‍ തന്‍റെ രക്ഷിതാവില്‍ വിശ്വസിക്കുന്നുവോ അവന്‍ യാതൊരു നഷ്ടത്തെയും അനീതിയെയും പറ്റി ഭയപ്പെടേണ്ടി വരില്ല. എന്നും (അവര്‍ പറഞ്ഞു.)",
            "verse 72:14": "ഞങ്ങളുടെ കൂട്ടത്തില്‍ കീഴ്പെട്ടു ജീവിക്കുന്നവരുണ്ട്‌. അനീതി പ്രവര്‍ത്തിക്കുന്നവരും ഞങ്ങളുടെ കൂട്ടത്തിലുണ്ട്‌. എന്നാല്‍ ആര്‍ കീഴ്പെട്ടിരിക്കുന്നുവോ അത്തരക്കാര്‍ സന്‍മാര്‍ഗം അവലംബിച്ചിരിക്കുന്നു.",
            "verse 72:15": "അനീതി പ്രവര്‍ത്തിച്ചകരാകട്ടെ നരകത്തിനുള്ള വിറക് ആയി തീരുന്നതാണ്‌. (എന്നും അവര്‍ പറഞ്ഞു.)",
            "verse 72:16": "ആ മാര്‍ഗത്തില്‍ (ഇസ്ലാമില്‍) അവര്‍ നേരെ നിലകൊള്ളുകയാണെങ്കില്‍ നാം അവര്‍ക്ക് ധാരാളമായി വെള്ളം കുടിക്കാന്‍ നല്‍കുന്നതാണ്‌.",
            "verse 72:17": "അതിലൂടെ നാം അവരെ പരീക്ഷിക്കുവാന്‍ വേണ്ടിയത്രെ അത്‌. തന്‍റെ രക്ഷിതാവിന്‍റെ ഉല്‍ബോധനത്തെ വിട്ട് ആര്‍ തിരിഞ്ഞുകളയുന്നുവോ അവനെ അവന്‍ (രക്ഷിതാവ്‌) പ്രയാസകരമായ ശിക്ഷയില്‍ പ്രവേശിപ്പിക്കുന്നതാണ്‌. (എന്നും എനിക്ക് ബോധനം നല്‍കപ്പെട്ടിരിക്കുന്നു.)",
            "verse 72:18": "പള്ളികള്‍ അല്ലാഹുവിന്നുള്ളതാകുന്നു. അതിനാല്‍ നിങ്ങള്‍ അല്ലാഹുവോടൊപ്പം ആരെയും വിളിച്ച് പ്രാര്‍ത്ഥിക്കരുത് എന്നും.",
            "verse 72:19": "അല്ലാഹുവിന്‍റെ ദാസന്‍ (നബി) അവനോട് പ്രാര്‍ത്ഥിക്കുവാനായി എഴുന്നേറ്റ് നിന്നപ്പോള്‍ അവര്‍ അദ്ദേഹത്തിന് ചുറ്റും തിങ്ങിക്കൂടുവാനൊരുങ്ങി എന്നും.",
            "verse 72:20": "(നബിയേ,)പറയുക: ഞാന്‍ എന്‍റെ രക്ഷിതാവിനെ മാത്രമേ വിളിച്ചു പ്രാര്‍ത്ഥിക്കുകയുള്ളൂ. അവനോട് യാതൊരാളെയും ഞാന്‍ പങ്കുചേര്‍ക്കുകയില്ല.",
            "verse 72:21": "പറയുക: നിങ്ങള്‍ക്ക് ഉപദ്രവം ചെയ്യുക എന്നതോ (നിങ്ങളെ) നേര്‍വഴിയിലാക്കുക എന്നതോ എന്‍റെ അധീനതയിലല്ല.",
            "verse 72:22": "പറയുക: അല്ലാഹുവി (ന്‍റെ ശിക്ഷയി) ല്‍ നിന്ന് ഒരാളും എനിക്ക് അഭയം നല്‍കുകയേ ഇല്ല; തീര്‍ച്ചയായും അവന്നു പുറമെ ഒരു അഭയസ്ഥാനവും ഞാന്‍ ഒരിക്കലും കണ്ടെത്തുകയുമില്ല.",
            "verse 72:23": "അല്ലാഹുവിങ്കല്‍ നിന്നുള്ള പ്രബോധനവും അവന്‍റെ സന്ദേശങ്ങളും ഒഴികെ (മറ്റൊന്നും എന്‍റെ അധീനതയിലില്ല.) വല്ലവനും അല്ലാഹുവെയും അവന്‍റെ ദൂതനെയും ധിക്കരിക്കുന്ന പക്ഷം തീര്‍ച്ചയായും അവന്നുള്ളതാണ് നരകാഗ്നി. അത്തരക്കാര്‍ അതില്‍ നിത്യവാസികളായിരിക്കും.",
            "verse 72:24": "അങ്ങനെ അവര്‍ക്ക് താക്കീത് നല്‍കപ്പെടുന്ന കാര്യം അവര്‍ കണ്ടു കഴിഞ്ഞാല്‍ ഏറ്റവും ദുര്‍ബലനായ സഹായി ആരാണെന്നും എണ്ണത്തില്‍ ഏറ്റവും കുറവ് ആരാണെന്നും അവര്‍ മനസ്സിലാക്കികൊള്ളും.",
            "verse 72:25": "(നബിയേ,) പറയുക: നിങ്ങള്‍ക്ക് താക്കീത് നല്‍കപ്പെടുന്ന കാര്യം അടുത്തു തന്നെയാണോ അതല്ല എന്‍റെ രക്ഷിതാവ് അതിന് അവധി വെച്ചേക്കുമോ എന്ന് എനിക്ക് അറിയില്ല.",
            "verse 72:26": "അവന്‍ അദൃശ്യം അറിയുന്നവനാണ്‌. എന്നാല്‍ അവന്‍ തന്‍റെ അദൃശ്യജ്ഞാനം യാതൊരാള്‍ക്കും വെളിപ്പെടുത്തി കൊടുക്കുകയില്ല.",
            "verse 72:27": "അവന്‍ തൃപ്തിപ്പെട്ട വല്ല ദൂതന്നുമല്ലാതെ. എന്നാല്‍ അദ്ദേഹത്തിന്‍റെ (ദൂതന്‍റെ) മുന്നിലും പിന്നിലും അവന്‍ കാവല്‍ക്കാരെ ഏര്‍പെടുത്തുക തന്നെ ചെയ്യുന്നതാണ്‌.",
            "verse 72:28": "അവര്‍ (ദൂതന്‍മാര്‍) തങ്ങളുടെ രക്ഷിതാവിന്‍റെ ദൌത്യങ്ങള്‍ എത്തിച്ചുകൊടുത്തിട്ടുണ്ട് എന്ന് അവന്‍ (അല്ലാഹു) അറിയാന്‍ വേണ്ടി. അവരുടെ പക്കലുള്ളതിനെ അവന്‍ പരിപൂര്‍ണ്ണമായി അറിഞ്ഞിരിക്കുന്നു. എല്ലാ വസ്തുവിന്‍റെയും എണ്ണം അവന്‍ തിട്ടപ്പെടുത്തിയിരിക്കുന്നു."
        },
        "Norwegian": {
            "verse 72:1": "Si: «Det er blitt åpenbart meg at en flokk dsjinner gav øre, og sa: ’Vi har visselig hørt en bemerkelsesverdig forkynnelse (Koran),",
            "verse 72:2": "som leder til rettsindighet! Vi tror på den, og vi vil ikke gi Herren medguder.",
            "verse 72:3": "Og Han – opphøyet er Herrens majestet – har ikke lagt seg til hustru eller barn.",
            "verse 72:4": "De forstandssvake blant oss uttalte om Gud noe hinsides alt,",
            "verse 72:5": "og vi mente at menneske eller dsjinn aldri ville si en løgn om Gud.",
            "verse 72:6": "Men det var noen blant menneskene som søkte sammen med noen av dsjinnene, og forøket deres dårlighet,",
            "verse 72:7": "og mente, som også dere mente, at Gud ville aldri gjenoppvekke noen.",
            "verse 72:8": "Vi søkte over himmelen, men fant den fylt av strenge voktere og ildflammer.",
            "verse 72:9": "Vi pleide å ta plass her og der for å lytte, men den som nå lytter, finner en ildflamme som lurer på ham.",
            "verse 72:10": "Vi vet ikke om ondt er tiltenkt dem på jorden, eller om Herren har tiltenkt dem det som er godt.",
            "verse 72:11": "Visselig er det blant oss rettskafne, og slike som ikke er det. Vi følger forskjellige veier.",
            "verse 72:12": "Vi mente at vi aldri kunne sette Gud ut av spill på jorden, og heller ikke forpurre Ham ved flukt.",
            "verse 72:13": "Da vi fikk høre ledelsen, trodde vi på den, og den som tror på Herren, han frykter ikke smålighet eller urett.",
            "verse 72:14": "Noen av oss har gitt seg Gud i vold, og noen følger det de selv mener er rett: De som har gitt seg Gud i vold, disse har søkt det rette.",
            "verse 72:15": "Men de som følger egne veier, de blir brensel for helvete.’»",
            "verse 72:16": "«Om de holdt seg på rett vei, ville Vi gi dem rikelig vann å drikke.",
            "verse 72:17": "for derved å sette dem på prøve. Og den som snur seg bort fra Herrens formaning, sender Han til en svær straff.",
            "verse 72:18": "Bedestedene tilhører Gud, så påkall ingen ved siden av Gud.",
            "verse 72:19": "Da Guds tjener stod opp for å påkalle Ham, var de tett omkring ham.»",
            "verse 72:20": "Si: «Jeg påkaller kun Herren, og setter ingen ved Hans side.»",
            "verse 72:21": "Si: «Jeg formår ikke å gjøre dere ondt eller godt.»",
            "verse 72:22": "Si: «Ingen kan beskytte meg mot Gud, og jeg finner ingen tilflukt utenom Ham.",
            "verse 72:23": "Meg påligger kun formidling fra Gud og Hans budskap. Den som ikke adlyder Gud og Hans sendebud, har i vente helvetes ild, og der skal de være og bli for alltid.",
            "verse 72:24": "Når de så endelig får se det som var stilt dem i utsikt, da vil de få vite hvem som står svakest med hensyn til hjelpere, og tallmessig.»",
            "verse 72:25": "Si: «Jeg vet ikke om det som er stilt dere i utsikt er nær, eller om Herren vil gi det utsettelse.",
            "verse 72:26": "Han kjenner det skjulte, og Han gjør ingen kjent med Sitt skjulte,",
            "verse 72:27": "unntatt et sendebud Han har velbehag i. Og han ferdes med vakt, foran og bak seg,",
            "verse 72:28": "så Han kan vite at de har levert Herrens budskap. Han omfatter alt som hos dem er, og opptegner alt nøyaktig.»"
        },
        "Pashto": {
            "verse 72:1": "ته (دوى ته) ووایه چې ما ته وحي شوې ده چې بېشكه شان دا دى چې په پېریانو كې یو ټولي (ډلې) (زما قراءت) په غور سره واورېده، (نو كله چې خپل قوم ته لاړل)، نو دوى وویل: بېشكه مونږ یو عجیبه قرآن واورېده",
            "verse 72:2": "چې نېغې لارې ته هدایت كوي، نو مونږ په ده ایمان راوړ، او مونږ به هیڅكله له خپل رب سره هیڅوك شریك نه كړو",
            "verse 72:3": "او بېشكه شان دا دى چې زمونږ د رب شان ډېر اوچت دى، ده نه ښځه نیولې ده او نه اولاد",
            "verse 72:4": "او بېشكه شان دا دى چې زمونږ ناپوهو (بېوقوفو) په الله باندې زیاتي (او بې حقیقته) خبرې اړولې",
            "verse 72:5": "او یقینًا مونږ دا خیال كاوه چې په الله باندې به انسانان او پېریان هیڅكله دروغ ونه وايي",
            "verse 72:6": "او بېشكه شان دا دى چې په انسانانو كې ډېر داسې سړي وو چې په پېریانو كې په ځینو سړیو پورې به يې پناه نیوله، نو دغو خلقو دغو (پېریانو) ته سركشي ورزیاته كړه",
            "verse 72:7": "او دا چې یقینًا دوى ګمان كړى و لكه چې تاسو ګمان كړى دى چې الله به هرګز هیڅوك بیا ژوندي راپورته نه كړي",
            "verse 72:8": "او دا چې بېشكه مونږ اسمان ته ورسېدو، نو مونږ هغه ومونده چې په ډېرو سختو څوكيدارانو او سوځوونكو شغلو (ستوریو) سره ډك كړى شوى دى",
            "verse 72:9": "او دا چې بېشكه مونږ به د اورېدلو لپاره له دې (اسمان) نه د كېناستو په ځایونو كې كېناستو، نو هغه څوك چې اوس غواړي چې واوري (نو) دى به د ځان لپاره د اور لمبه منتظره ومومي",
            "verse 72:10": "او دا چې یقینًا مونږ نه پوهېږو چې له هغه چا سره د شر (او بدۍ) اراده شوې ده چې په ځمكه كې دي، یا له دوى سره د دوى رب د لارښوونې (او خیر) اراده كړې ده",
            "verse 72:11": "او دا چې بېشكه پر مونږ كې ځینې نېكان (او صالحه خلق) دي او پر مونږ كې له دغو نه لاندې هم شته۔، مونږ په مختلفو لارو روان یو",
            "verse 72:12": "او دا چې بېشكه مونږ یقین وكړ چې مونږ به په ځمكه كې الله له سره عاجز نه كړى شو او مونږ به دى له سره په تېښتې سره عاجز نه كړى شو",
            "verse 72:13": "او دا چې بېشكه مونږ چې كله هدایت واورېده (، نو) مونږ په ده ایمان راوړ، نو هغه څوك چې په خپل رب ایمان راوړي، نو دى به نه له نقصان نه وېرېږي او نه (د چا) له ظلم نه",
            "verse 72:14": "او دا چې بېشكه په مونږ كې ځینې مسلمانان دي او ځینې په مونږ كې ظالمان دي، نو هغه چې اسلام راوړي، نو دغو خلقو د نېغې لارې قصد (او طلب) وكړ",
            "verse 72:15": "او هر چې ظالمان دي، نو دوى به د جهنم لرګي (خشاك) وي",
            "verse 72:16": "او (بله وحي ما ته دا راغلې ده چې) كه دوى په نېغې لارې باندې سم ودرېږي (نو) مونږ به په دوى ډېرې اوبه وڅښوو",
            "verse 72:17": "د دې لپاره چې مونږ دوى په دغه (نعمت) كې وازمایو او هغه څوك چې د خپل رب له ذكر (قرآن) نه مخ واړوي، نو هغه (رب) به دى سخت عذاب ته داخل كړي",
            "verse 72:18": "او دا چې یقینًا جوماتونه خاص د الله لپاره دي، نو تاسو له الله سره بل هیڅوك مه بلئ",
            "verse 72:19": "او دا چې یقینًا شان دا دى چې كله د الله بنده (محمدﷺ لمانځه ته) ودرېده، چې دغه (الله) يې باله، (نو) دوى نژدې وو چې په ده باندې په یو بل پسې ورپرېوتونكي شي",
            "verse 72:20": "ته (دوى ته) ووایه: یقینًا زه خو يواځې خپل رب بولم او زه به له ده سره هیڅوك شریك نه كړم",
            "verse 72:21": "ته (دوى ته) ووایه: بېشكه زه تاسو لپاره نه د هېڅ ضرر مالك (او اختیار من) یم او نه د خیر رسولو",
            "verse 72:22": "ته (دوى ته) ووایه: بېشكه زه چې یم هیڅوك به ما له الله نه له سره خلاص نه كړى شي او زه به له ده نه غیر هېڅ پناه ځاى ونه مومم",
            "verse 72:23": "مګر د الله له جانبه د تبلیغ او د هغه د پېغام رسولو (اختیارمن یم) او هغه څوك چې د الله او د هغه د رسول نافرماني وكړي، نو بېشكه د ده لپاره د جهنم اور دى، چې دوى به په هغه كې تل ترتله وي",
            "verse 72:24": "تر هغه پورې چې كله دوى هغه څه وویني چې له دوى سره يې وعده كولى شي، نو دوى به ژر پوه شي چې د مددګار په لحاظ څوك ډېر كمزورى دى او د شمېر په لحاظ څوك ډېر كم دى",
            "verse 72:25": "ته (دوى ته) ووایه: زه نه پوهېږم چې ایا هغه (عذاب) نژدې دى چې تاسو سره يې وعده كولى شي، یا به د ده لپاره زما رب لرې زمانه مقرره كړي",
            "verse 72:26": "دى عالم الغیب (په غیبو عالم) دى، نو دى په خپلو غیبو باندې هیڅوك نه خبروي",
            "verse 72:27": "مګر هغه چې كوم رسول يې خوښ شي، نو بېشكه دغه (الله) د ده په مخ كې او د ده شا ته ساتونكي (څوكيداران) روانوي",
            "verse 72:28": "د دې لپاره چې دى په دې پوه شي چې دوى د خپل رب پېغامونه رسولي دي۔ او ده په هغه څه احاطه كړې ده چې له دوى سره دى او ده هر شى ښه په شمېر سره ساتلى دى"
        },
        "Persian": {
            "verse 72:1": "بگو: به من وحى شده است كه گروهى از جن گوش فرا دادند، و گفتند كه ما قرآنى شگفت شنيديم؛",
            "verse 72:2": "به راه راست هدايت مى‌كند. پس ما بدان ايمان آورديم و هرگز كسى را شريك پروردگارمان نمى‌سازيم.",
            "verse 72:3": "عظمت پروردگار ما متعالى است. نه همسرى گيرد و نه فرزندى دارد.",
            "verse 72:4": "و سفيه ما در باره خدا سخنانى به ناحق مى‌گفت.",
            "verse 72:5": "و ما مى‌پنداشتيم كه آدمى و جن در باره خدا دروغ نمى‌گويند.",
            "verse 72:6": "و نيز مردانى بودند از آدميان كه به مردانى از جن پناه مى‌بردند و بر طغيانشان مى‌افزودند.",
            "verse 72:7": "همچنان كه شما مى‌پنداشتيد آنها هم مى‌پنداشتند كه خدا هيچ كس را دوباره زنده نمى‌سازد.",
            "verse 72:8": "ما به آسمان رسيديم و آن را پر از نگهبانان قدرتمند و شهابها يافتيم.",
            "verse 72:9": "ما در آنجايها كه مى‌توان گوش فرا داد مى‌نشستيم. اما هر كه اكنون گوش نشيند، شهابى را در كمين خود يابد.",
            "verse 72:10": "از اين روى نمى‌دانيم كه آيا براى كسانى كه در روى زمين هستند بدى مقدر مى‌شود، يا پروردگارشان مى‌خواهد به راه راستشان ببرد.",
            "verse 72:11": "برخى از ما صالحند و برخى جز آن، و ما فرقه‌هايى گوناگونيم.",
            "verse 72:12": "ما مى‌دانيم كه خدا را در زمين ناتوان نمى‌كنيم و با گريختن نيز ناتوانش نسازيم.",
            "verse 72:13": "و چون سخن هدايت شنيديم، بدان ايمان آورديم. و هر كه به پروردگارش ايمان آورد نه از نقصان مى‌ترسد و نه از ستم.",
            "verse 72:14": "و بعضى از ما مسلمانند و بعضى از حق دور. و آنان كه اسلام آورده‌اند در جست و جوى راه راست بوده‌اند.",
            "verse 72:15": "اما آنان كه از حق دورند هيزم جهنم خواهند بود.",
            "verse 72:16": "و اگر بر طريقه راست پايدارى كنند، از آبى فراوان سيرابشان كنيم.",
            "verse 72:17": "تا آنها را بيازماييم. و هر كه از ذكر پروردگارش اعراض كند او را به عذابى دشوار دراندازد.",
            "verse 72:18": "و مسجدها از آنِ خداست. و با وجود خداى يكتا كسى را به خدايى مخوانيد.",
            "verse 72:19": "چون بنده خدا براى پرستش او بر پاى ايستاد، گرد او را گرفتند.",
            "verse 72:20": "بگو: تنها پروردگارم را مى‌خوانم و هيچ كس را شريك او نمى‌سازم.",
            "verse 72:21": "بگو: من نمى‌توانم به شما زيانى برسانم يا شما را به صلاح آورم.",
            "verse 72:22": "بگو: هيچ كس مرا از عقوبت خدا پناه ندهد و من جز او پناهگاهى نمى‌يابم.",
            "verse 72:23": "آنچه مى‌توانم جز رساندن پيام او و انجام دادن رسالتهاى او نيست. و هر كه خدا و پيامبرش را نافرمانى كند، نصيب او آتش جهنم است كه همواره در آن خواهند بود،",
            "verse 72:24": "تا آنگاه كه آنچه را به آنها وعده داده بودند بنگرند. پس خواهند دانست چه كسى را ياران ناتوان‌تر و شمار كمتر بوده است.",
            "verse 72:25": "بگو: من نمى‌دانم كه آيا آن وعده‌اى كه به شما داده‌اند نزديك است، يا پروردگار من براى آن زمانى نهاده است؟",
            "verse 72:26": "او داناى غيب است و غيب خود را بر هيچ كس آشكار نمى‌سازد،",
            "verse 72:27": "مگر بر آن پيامبرى كه از او خشنود باشد كه براى نگهبانى از او پيش روى و پشت سرش نگهبانى مى‌گمارد،",
            "verse 72:28": "تا بداند كه آنها پيامهاى پروردگارشان را رسانيده‌اند و خدا به آنچه در نزد آنهاست احاطه دارد و همه چيز را به عدد شمار كرده است."
        },
        "Polish": {
            "verse 72:1": "Mów: \"Zostało mi objawione, że pewna grupa dżinów przysłuchiwała się, i wtedy powiedzieli: Zaprawdę, słyszeliśmy cudowny Koran,",
            "verse 72:2": "Który prowadzi ku prawości; więc uwierzyliśmy w niego i nie będziemy dodawać nikogo za współtowarzysza naszemu Panu.",
            "verse 72:3": "On - niech będzie wywyższony majestat naszego Pana! - nie przybrał sobie ani towarzyszki, ani dziecka.",
            "verse 72:4": "Głupiec spośród nas mówił przeciwko Bogu obraźliwe kłamstwo,",
            "verse 72:5": "A sądziliśmy, że ani ludzie, ani dżiny nie będą mówić przeciwko Bogu kłamstwa.",
            "verse 72:6": "I mężczyźni spośród rodzaju ludzkiego szukali opieki u mężczyzn spośród dżinów, a ci jeszcze powiększyli ich szaleństwo.",
            "verse 72:7": "Oni myśleli, jak i wy myślicie, że Bóg nie wskrzesi nikogo.",
            "verse 72:8": "A my dotknęliśmy nieba i znaleźliśmy je wypełnione strażami i płomieniami ognia.",
            "verse 72:9": "Usiedliśmy tam na miejscach do siedzenia, aby słuchać; lecz ten, kto się przysłuchuje teraz, znajduje płomień w zasadzce.",
            "verse 72:10": "I my nie wiemy, czy chciano zła dla tych na ziemi, czy też chciał dla nich Pan drogi prawości.",
            "verse 72:11": "Są wśród nas sprawiedliwi i są wśród nas tacy, którzy są niżej tego; poszliśmy różnymi drogami.",
            "verse 72:12": "I myśleliśmy, że nie potrafimy nigdy uczynić Boga bezsilnym na ziemi; i nie potrafimy nigdy uczynić Go bezsilnym, uciekając.",
            "verse 72:13": "Kiedy posłyszeliśmy o drodze prostej, uwierzyliśmy w Niego; a kto uwierzy w swego Pana, nie obawia się ani obrazy, ani ucisku.",
            "verse 72:14": "Są wśród nas poddani całkowicie Bogu i są wśród nas zbuntowani. A ten, kto się poddał całkowicie - wybrał sobie drogę prawości;",
            "verse 72:15": "Zaś ci zbuntowani - są drewnem dla Gehenny.\"",
            "verse 72:16": "A jeśliby oni utrzymali się prosto na drodze, to napoilibyśmy ich wodą obfitą,",
            "verse 72:17": "Aby ich przez to doświadczyć. A kto odsuwa się od wspomnienia swego Pana, tego poprowadzi On do cierpienia ciągle wzrastającego.",
            "verse 72:18": "Miejsca oddawania czci są tylko dla Boga. Nie wzywajcie więc nikogo wraz z Bogiem!",
            "verse 72:19": "I kiedy podniósł się sługa Boga, modląc się do Niego, to oni zebrali się tłumnie wokół niego, omal go nie dusząc.",
            "verse 72:20": "Mów: \"Ja wzywam tylko swego Pana i nie dodaję Mu nikogo za współtowarzysza.\"",
            "verse 72:21": "Mów: \"Ja nie rozporządzam dla was ani złem, ani drogą prawości.\"",
            "verse 72:22": "Mów: \"Nikt mnie nie uchroni przed Bogiem i nie znajdę, poza Nim, miejsca schronienia",
            "verse 72:23": "- tylko obwieszczenie pochodzące od Boga i Jego posłannictwa. A wszyscy, którzy zbuntują się przeciw Bogu i Jego Posłańcowi, to, zaprawdę, dla nich będzie ogień Gehenny - oni tam będą przebywać nieśmiertelni na zawsze.",
            "verse 72:24": "A kiedy w końcu zobaczą to, co im zostało obiecane, wtenczas się dowiedzą, kto jest słabszy, jeśli chodzi o pomocnika, kto jest mniejszy, jeśli chodzi o liczbę.\"",
            "verse 72:25": "Mów: \"Nie wiem, czy bliskie jest to, co wam zostało obiecane, czy też mój Pan ustanowi jakiś termin.",
            "verse 72:26": "On zna dobrze to, co skryte, i nie ujawni nikomu, co u Niego jest skryte,",
            "verse 72:27": "Jedynie posłańcowi, którego Sobie upodobał. I, zaprawdę, On prowadzi przed nim i za nim straż,",
            "verse 72:28": "Aby wiedział,. czy posłańcy przekazują posłannictwa swego Pana. On obejmuje wszystkie ich czyny i wyliczył każdą rzecz liczbą."
        },
        "Portuguese": {
            "verse 72:1": "Dize: Foi-me revelado que um grupo de gênios escutou (a recitação do Alcorão). Disseram: Em verdade, ouvimos um Alcorão admirável,",
            "verse 72:2": "Que guia à verdade, pelo que nele cremos, e jamais atribuiremos parceiro alguém ao nosso Senhor;",
            "verse 72:3": "Cremos em que - exaltada seja a Majestade do nosso Senhor - Ele jamais teve cônjuge ou prole,",
            "verse 72:4": "E o insensato, entre nós, proferiu extravagâncias a respeito de Deus.",
            "verse 72:5": "E jamais imaginamos que os humanos e ao gênios iriam urdir mentiras a respeito de Deus.",
            "verse 72:6": "E, em verdade, algumas pessoas, dentre os humanos, invocaram a proteção de pessoas, dentre os gênios. Porém, estes só lhes aumentaram os desatinos.",
            "verse 72:7": "E eles pensaram como pensastes: que Deus jamais ressuscitará alguém.",
            "verse 72:8": "(Disseram os gênios): Quisemos inteirar-nos acerca do céu e o achamos pleno de severos guardiães e flamígeros meteoros.",
            "verse 72:9": "E usávamos nos sentar lá, em locais (ocultos), para ouvir; e quem se dispusesse a ouvir agora, defrontar-se- ia com um flamígero meteoro, de guarda.",
            "verse 72:10": "E nós não compreendemos se o mal era destinado àqueles que estão na terra ou se o Senhor tencionava encaminhá-los para a boa conduta.",
            "verse 72:11": "E, entre nós (os gênios), há virtuosos e há também os que não o são, porque seguimos diferentes caminhos.",
            "verse 72:12": "E achamos que jamais poderemos safar-nos de Deus na terra, nem tampouco iludi-Lo, fugindo (para outras paragens).",
            "verse 72:13": "E quando escutamos a orientação, cremos nela; e quem quer que creia em seu Senhor, não há de temer fraude, nem desatino.",
            "verse 72:14": "E, entre nós, há submissos, como os também há desencaminhados. Quanto àqueles que se submetem (à vontade de Deus), buscam a verdadeira conduta.",
            "verse 72:15": "Quanto aos desencaminhados, esses serão combustíveis do inferno.",
            "verse 72:16": "Mas, se tivessem sido firmes no (verdadeiro) caminho, tê-los-íamos agraciado com água abundante,",
            "verse 72:17": "Para prová-los, com ela. Em verdade, a quem se afastar da Mensagem do seu Senhor, Ele lhe infligirá um severo castigo.",
            "verse 72:18": "Sabei que as mesquitas são (casas) de Deus; não invoqueis, pois, ninguém, juntamente com Deus.",
            "verse 72:19": "E quando o servo de Deus se levantou para invocá-Lo (em oração), aglomeraram-se em tomo dele.",
            "verse 72:20": "Dize-lhes: Invoco tão somente o meu Senhor, a Quem não atribuo parceiro algum.",
            "verse 72:21": "Dize-lhes (mais): Em verdade, não posso livrar-vos do mal, nem trazer-vos para a conduta verdadeira.",
            "verse 72:22": "Dize-lhes (ainda): Em verdade, ninguém poderá livrar-me de Deus, nem tampouco acharei amparo algum fora d'Ele;",
            "verse 72:23": "Somente proclamo o que de Deus recebi, bem como a Sua mensagem. E aqueles que desobedecem a Deus e ao Seu Mensageiro, certamente terão o fogo infernal, onde morarão eternamente.",
            "verse 72:24": "(Eles duvidarão) até que, quando se depararem com o que lhes foi prometido, saberão quem tem menos socorredores e quem tem menor número (de aliados).",
            "verse 72:25": "Dize-lhes: Ignoro se o que vos tem sido prometido é iminente, ou se o meu Senhor fixou-lhe um término remoto.",
            "verse 72:26": "Ele é Conhecedor do incognoscível e não revela os Seus mistérios a quem quer que seja,",
            "verse 72:27": "Salvo a um mensageiro que tenta escolhido, e faz um grupo de guardas marcharem, na frente e por trás dele,",
            "verse 72:28": "Para certificar-se de que transmitiu as mensagens do seu Senhor, o Qual abrange tudo quanto os humanos possuem, e que toma conta de tudo."
        },
        "Punjabi": {
            "verse 72:1": "ਆਖੋ, ਕਿ ਮੈਨੂੰ ਵਹੀ (ਸੰਦੇਸ਼) ਕੀਤੀ ਗਈ ਹੈ ਕਿ ਜਿੰਨਾਂ ਦੇ ਇੱਕ ਸਮੂਹ ਨੇ ਕੁਰਆਨ ਨੂੰ ਸੁਣਿਆ ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਅਸੀਂ ਇਕ ਅਜੀਬ ਕੁਰਆਨ ਸੁਣਿਆ ਹੈ।",
            "verse 72:2": "ਜਿਹੜਾ ਮਾਰਗ ਦਰਸ਼ਨ ਹੈ। ਤਾਂ ਅਸੀਂ ਉਸ ਉੱਪਰ ਈਮਾਨ ਲਿਆਏ ਤਾਂ ਅਸੀਂ ਆਪਣੇ ਰੱਬ ਤੋਂ ਬਿਨ੍ਹਾਂ ਕਿਸੇ ਨੂੰ (ਉਸ ਅੱਲਾਹ ਦਾ) ਸ਼ਰੀਕ ਨਹੀਂ ਬਣਾਵਾਂਗੇ।",
            "verse 72:3": "ਅਤੇ ਇਹ ਕਿ ਸਾਡੇ ਰੱਬ ਦੀ ਸ਼ਾਨ ਬਹੁਤ ਉੱਚੀ ਹੈ। ਉਸ ਨੇ ਨਾ ਕੋਈ ਪਤਨੀ ਬਣਾਈ ਹੈ ਅਤੇ ਨਾ ਕੋਈ ਔਲਾਦ।",
            "verse 72:4": "ਅਤੇ ਇਹ ਕਿ ਸਾਡਾ ਨਾ ਸਮਝ ਬੰਦਾ ਸਾਡੇ ਅੱਲਾਹ ਦੇ ਬਾਰੇ ਅਸਲੀਅਤ ਤੋਂ ਬਹੁਤ ਦੂਰ ਦੀਆਂ ਗੱਲਾਂ ਕਹਿੰਦਾ ਸੀ।",
            "verse 72:5": "ਅਤੇ ਅਸੀਂ ਕਲਪਣਾ ਕੀਤੀ ਸੀ ਕਿ ਮਨੁੱਖ ਅਤੇ ਜਿੰਨ ਅੱਲਾਹ ਦੇ ਸਬੰਧ ਵਿਚ ਕਦੇ ਝੂਠੀ ਗੱਲ ਨਹੀਂ ਕਹਿਣਗੇ।",
            "verse 72:6": "ਅਤੇ ਇਹ ਕਿ ਮਨੁੱਖਾਂ ਵਿਚ ਕੁਝ ਅਜਿਹੇ ਵੀ ਸਨ ਜਿਹੜੇ ਜਿੰਨਾਂ ਵਿਚੋਂ ਕੁਝ ਦੀ ਸ਼ਰਣ ਲੈਂਦੇ ਸੀ ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਜਿੰਨਾਂ ਦਾ ਹੰਕਾਰ ਹੋਰ ਵਧਾ ਦਿੱਤਾ।",
            "verse 72:7": "ਅਤੇ ਇਹ ਕਿ ਉਨ੍ਹਾਂ ਨੇ ਵੀ ਕਲਪਣਾ ਕੀਤੀ ਜਿਵੇਂ ਤੁਸੀਂ ਕਲਪਣਾ ਕੀਤੀ ਕਿ ਅੱਲਾਹ ਕਿਸੇ ਨੂੰ ਨਹੀਂ ਉਠਾਵੇਗਾ।",
            "verse 72:8": "ਅਤੇ ਅਸੀਂ ਅਸਮਾਨ ਦੀ ਪੜਤਾਲ ਕੀਤੀ ਤਾਂ ਅਸੀਂ ਦੇਖਿਆ ਕਿ ਉਹ ਸਖ਼ਤ ਪਹਿਰੇਦਾਰਾਂ ਨਾਲ ਭਰਿਆ ਪਿਆ ਹੈ ਅਤੇ ਅੰਗਿਆਰਾਂ ਦਾ ਮੀਂਹ ਵਰ੍ਹ ਰਿਹਾ ਹੈ।",
            "verse 72:9": "ਅਤੇ ਅਸੀਂ ਉਸ ਦੇ ਕੁਝ ਟਿਕਾਣਿਆਂ ਤੇ ਸੁਣਨ ਲਈ ਬੈਠਿਆ ਕਰਦੇ ਸੀ ਤਾਂ ਹੁਣ ਵੀ ਜੇ ਕੋਈ ਸੁਨਣਾ ਚਾਹੁੰਦਾ ਹੈ ਤਾਂ ਉਹ ਆਪਣੇ ਲਈ ਇੱਕ ਤਿਆਰ ਅੰਗਿਆਰਾ ਪਾਉਂਦਾ ਹੈ।",
            "verse 72:10": "ਅਤੇ ਅਸੀਂ ਨਹੀਂ ਜਾਣਦੇ ਕਿ ਇਹ ਧਰਤੀ ਵਾਲਿਆਂ ਲਈ ਕੋਈ ਬੁਰਾਈ ਚਾਹੀ ਗਈ ਹੈ ਜਾਂ ਉਨ੍ਹਾਂ ਦੇ ਰੱਬ ਨੇ ਉਨ੍ਹਾਂ ਦੇ ਨਾਲ ਨੇਕੀ ਦਾ ਇਰਾਦਾ ਕੀਤਾ ਹੈ।",
            "verse 72:11": "ਅਤੇ ਇਹ ਕਿ ਸਾਡੇ ਵਿਚ ਕੁਝ ਚੰਗੇ ਹਨ ਅਤੇ ਕੂਝ ਵੱਖਰੀ ਤਰ੍ਹਾਂ ਦੇ। ਅਸੀਂ ਵੱਖਰੇ ਰਾਹਾਂ ਤੇ ਹਾਂ।",
            "verse 72:12": "ਅਤੇ ਇਹ ਕਿ ਅਸੀਂ ਸਮਝ ਲਿਆ ਹੈ ਕਿ ਅਸੀਂ ਧਰਤੀ ਤੇ ਅੱਲਾਹ ਨੂੰ ਨਹੀਂ ਹਰਾ ਸਕਦੇ ਅਤੇ ਨਾ ਭੱਜ ਕੇ ਉਸ ਨੂੰ ਹਰਾ ਸਕਦੇ ਹਾਂ।",
            "verse 72:13": "ਅਤੇ ਇਹ ਕਿ ਅਸੀਂ ਜਦੋਂ ਉਪਦੇਸ਼ ਦੀ ਗੱਲ ਸੁਣੀ ਤਾਂ ਅਸੀਂ ਉਸ ਤੇ ਈਮਾਨ ਲਿਆਏ। ਤਾਂ ਜਿਹੜਾ ਬੰਦਾ ਆਪਣੇ ਰੱਬ ਤੇ ਈਮਾਨ ਲਿਆਏਗਾ ਉਸ ਨੂੰ ਨਾ ਕਿਸੇ ਘਾਟੇ ਦਾ ਡਰ ਹੋਵੇਗਾ ਅਤੇ ਨਾ ਵਾਧੇ ਦਾ।",
            "verse 72:14": "ਅਤੇ ਇਹ ਕਿ ਅਸੀਂ ਕੁਝ ਆਗਿਆਕਾਰੀ ਹਾਂ ਅਤੇ ਸਾਡੇ ਵਿਚੋਂ ਕੂਝ ਕੁਰਾਹੀਏ ਹਨ। ਸੋ ਜਿਸ ਨੇ ਆਗਿਆ ਦਾ ਪਾਲਣ ਕੀਤਾ ਤਾਂ ਉਨ੍ਹਾਂ ਨੇ ਨੇਕੀ ਦਾ ਰਾਹ ਲੱਭ ਲਿਆ।",
            "verse 72:15": "ਅਤੇ ਜਿਹੜੇ ਲੋਕ ਕੁਰਾਹੇ ਪਏ ਹਨ, ਉਹ ਨਰਕ ਦਾ ਬਾਲਣ ਬ਼ਨਣਗੇ।",
            "verse 72:16": "ਅਤੇ ਮੈਨੂੰ ਵਹੀ ਕੀਤੀ ਗਈ ਕਿ ਇਹ ਲੋਕ ਜੇਕਰ ਰਾਹ ਤੇ ਅਟੱਲ ਹੋ ਜਾਂਦੇ ਹਨ ਤਾਂ ਅਸੀਂ ਇਨ੍ਹਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰਾ ਪੀਣ ਵਾਲਾ ਪਾਣੀ ਦਿੰਦੇ।",
            "verse 72:17": "ਤਾਂ ਕਿ ਉਸ ਰਾਹੀ’ ਉਨ੍ਹਾਂ ਦਾ ਇਮਤਿਹਾਨ ਲੈਂਦੇ ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਆਪਣੇ ਰੱਬ ਦੀ ਯਾਦ ਤੋਂ ਮੂੰਹ ਮੋੜੇਗਾ ਤਾਂ ਉਹ ਉਸ ਨੂੰ ਸਖ਼ਤ ਸਜ਼ਾ ਦੇ ਵਿਚ ਸੁੱਟ ਦੇਵੇਗਾ।",
            "verse 72:18": "ਅਤੇ ਇਹ ਕਿ ਮਸਜਿਦਾਂ ਅੱਲਾਹ ਲਈ ਹਨ ਤਾਂ ਤੁਸੀਂ ਅੱਲਾਹ ਦੇ ਬਰਾਬਰ ਕਿਸੇ ਹੋਰ ਦੀ ਬੰਦਗੀ ਨਾ ਕਰੋ।",
            "verse 72:19": "ਅਤੇ ਇਹ ਕਿ ਜਦੋਂ ਅੱਲਾਹ ਦਾ ਬੰਦਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਪੁਕਾਰਣ ਲਈ ਖੜ੍ਹਾ ਹੋਇਆ ਤਾਂ ਲੋਕ ਉਸ ਤੇ ਟੁੱਟ ਕੇ ਪੈਣ ਲਈ ਤਿਆਰ ਹੋ ਗਏ।",
            "verse 72:20": "ਕਿਉਂਕਿ ਮੈਂ ਸਿਰਫ਼ ਆਪਣੇ ਰੱਬ ਨੂੰ ਪੁਕਾਰਦਾ ਹਾਂ ਅਤੇ ਉਸ ਦੇ ਬਰਾਬਰ ਕਿਸੇ ਨੂੰ ਸ਼ਰੀਕ ਨਹੀਂ ਮੰਨਦਾ।",
            "verse 72:21": "ਆਖੋਂ, ਕਿ ਸੈ’ ਤੁਹਾਡੇ ਲੋਕਾਂ ਲਈ ਨਾ ਕਿਸੇ ਨੁਕਸਾਨ ਦਾ ਅਧਿਕਾਰ ਰੱਖਦਾ ਹਾਂ ਅਤੇ ਨਾ ਕਿਸੇ ਲੇਕੀ ਦਾ।",
            "verse 72:22": "ਆਖੋ, ਕਿ ਮੈਨੂੰ ਅੱਲਾਹ ਤੋਂ ਕੋਈ ਬਚਾ ਨਹੀਂ ਸਕਦਾ ਅਤੇ ਨਾ ਮੈਂ ਉਸ (ਅੱਲਾਹ) ਤੋਂ ਬਿਨ੍ਹਾਂ ਕੋਈ ਸ਼ਰਣ ਪਾ ਸਕਦਾ ਹਾਂ।",
            "verse 72:23": "ਸਿਰਫ਼ ਅੱਲਾਹ ਵੱਲੋਂ ਹੁਕਮਾਂ ਦਾ ਅਤੇ ਉਸ ਦੇ ਸੁਨੇਹਿਆਂ ਦਾ ਪਹੁੰਚਾ ਦੇਣਾ ਹੀ ਮੇਰੀ ਜ਼ਿੰਮੇਵਾਰੀ ਹੈ। ਜਿਹੜਾ ਬੰਦਾ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲ ਦੀ ਅਵੱਗਿਆ ਕਰੇਗਾ ਉਸ ਲਈ ਨਰਕ ਦੀ ਅੱਗ ਹੈ ਜਿਸ ਵਿਚ ਉਹ ਹਮੇਸ਼ਾ ਰਹਿਣਗੇ।",
            "verse 72:24": "ਇੱਥੋਂ ਤੱਕ ਕਿ ਜਦੋਂ ਉਹ ਉਸ ਚੀਜ਼ ਨੂੰ ਦੇਖਣਗੇ ਜਿਸ ਦਾ ਉਨ੍ਹਾਂ ਨਾਲ ਵਾਅਦਾ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ ਤਾਂ ਉਸ ਸਮਝ ਲੈਣਗੇ ਕਿ ਕਿਸ ਦੇ ਸਾਥੀ ਕਮਜ਼ੋਰ ਹਨ ਅਤੇ ਕਿਹੜੇ ਗਿਣਤੀ ਵਿਚ ਘੱਟ ਹਨ।",
            "verse 72:25": "ਆਖੋ, ਕਿ ਮੈਂ ਨਹੀਂ ਜਾਣਦਾ ਜਿਸ ਚੀਜ਼ ਦਾ ਤੁਹਾਡੇ ਨਾਲ ਵਾਅਦਾ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ। ਉਹ ਨੇੜੇ ਹੈ ਜਾਂ ਮੇਰੇ ਰੱਬ ਨੇ ਲੰਮਾਂ ਸਮਾਂ ਤਹਿ ਕਰ ਰੱਖਿਆ ਹੈ।",
            "verse 72:26": "ਗੁੱਝੀਆਂ ਨੂੰ ਜਾਣਨ ਵਾਲਾ ਉਹ ਹੀ ਹੈ। ਉਹ ਆਪਣੀਆਂ ਗੁੱਝੀਆਂ ਗੱਲਾਂ ਲਈ ਕਿਸੇ ਨੂੰ ਸੂਚਿਤ ਨਹੀਂ ਕਰਦਾ।",
            "verse 72:27": "ਬਿਲ੍ਹਾਂ ਉਸ ਰਸੂਲ ਦੇ ਜਿਸ ਨੂੰ ਉਸ (ਅੱਲਾਹ) ਨੇ ਪਸੰਦ ਕੀਤਾ ਹੋਵੇ। ਤਾਂ ਉਹ ਉਸ ਦੇ ਅੱਗੇ ਅਤੇ ਪਿੱਛੇ ਪਹਿਰੇਦਾਰ ਲੱਗਾ ਦਿੰਦਾ।",
            "verse 72:28": "ਤਾਂ ਕਿ ਅੱਲਾਹ ਜਾਣ ਲਵੇ ਕਿ ਉਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਰੱਬ ਦੇ ਸੁਨੇਹੇ ਪਹੁੰਚਾ ਦਿੱਤੇ ਹਨ। ਅਤੇ (ਇਸ ਤਰ੍ਹਾਂ) ਉਸ ਨੇ ਉਨ੍ਹਾਂ ਦੇ ਆਲੇ-ਦੁਆਲੇ ਨੂੰ ਘੇਰਿਆ ਹੋਇਆ ਹੈ ਅਤੇ ਉਸ ਨੇ ਹਰ ਇੱਕ ਚੀਜ਼ ਨੂੰ ਗਿਣ ਰੱਖਿਆ ਹੈ।"
        },
        "Roman english": {
            "verse 72:1": "Qul oohiya ilaiya annna hustama`a nafarum minal jinnni faqaalooo innaa sami`naa quraanan `ajabaa",
            "verse 72:2": "Yahdeee ilar rushdi fa aamannaa bihee wa lan nushrika bi rabbinaaa ahadaa",
            "verse 72:3": "Wa annahoo Ta`aalaa jaddu Rabbinaa mat takhaza saahibatanw wa la waladaa",
            "verse 72:4": "Wa annahoo kaana yaqoolu safeehunaa `alal laahi shatataa",
            "verse 72:5": "Wa annaa zanannaaa al lan taqoolal insu wal jinnu `alal laahi kazibaa",
            "verse 72:6": "Wa annahoo kaana rijaa lum minal insi ya`oozoona birijaalim minal jinni fazaa doohum rahaqaa",
            "verse 72:7": "Wa annahum zannoo kamaa zanantum al lany yab`asal laahu ahadaa",
            "verse 72:8": "Wa annaa lamasnas sa maaa`a fa wajadnaahaa muli`at harasan shadeedanw wa shuhubaa",
            "verse 72:9": "Wa annaa kunnaa naq`udu minhaa maqaa`ida lis`sam`i famany yastami`il aana yajid lahoo shihaabar rasada",
            "verse 72:10": "Wa annaa laa nadreee asharrun ureeda biman fil ardi am araada bihim rabbuhum rashadaa",
            "verse 72:11": "Wa annaa minnas saalihoona wa minnaa doona zaalika kunnaa taraaa`ilqa qidadaa",
            "verse 72:12": "Wa annaa zanannaaa al lan nu`jizal laaha fil ardi wa lan nu`jizahoo harabaa",
            "verse 72:13": "Wa annaa lammaa sami`nal hudaaa aamannaa bihee famany yu`mim bi rabbihee falaa yakhaafu bakhsanw wa laa rahaqaa",
            "verse 72:14": "Wa annaa minnal muslimoona wa minnal qaasitoona faman aslama fa ulaaa`ika taharraw rashadaa",
            "verse 72:15": "Wa ammal qaasitoona fa kaanoo li jahannama hatabaa",
            "verse 72:16": "Wa alla wis taqaamoo `alat tareeqati la asqaynaahum maa`an ghadaqaa",
            "verse 72:17": "Linaftinahum feeh; wa many yu`rid `an zikri rabbihee yasluk hu `azaaban sa`adaa",
            "verse 72:18": "Wa annal masaajida lillaahi falaa tad`oo ma`al laahi ahadaa",
            "verse 72:19": "Wa annahoo lammaa qaama `adul laahi yad`oohu kaadoo yakoonoona `alaihi libadaa",
            "verse 72:20": "Qul innamaaa ad`oo rabbee wa laaa ushriku biheee ahadaa",
            "verse 72:21": "Qul innee laaa amliku lakum darranw wa laa rashadaa",
            "verse 72:22": "Qul innee lany yujeeranee minal laahi ahad, wa lan ajida min doonihee multahadaa",
            "verse 72:23": "Illaa balaagham minal laahi wa risaalaatih; wa many ya`sil laaha wa rasoolahoo fa inna lahoo naara jahannama khaalideena feehaaa abadaa",
            "verse 72:24": "Hattaaa izaa ra aw maa yoo`adoona fasaya`lamoona man ad`afu naasiranw wa aqallu `adadaa",
            "verse 72:25": "Qul in adreee a qareebum maa too`adoona am yaj`alu lahoo rabbeee amadaa",
            "verse 72:26": "Aalimul ghaibi falaa yuzhiru alaa ghaibiheee ahadaa",
            "verse 72:27": "Illaa manir tadaa mir rasoolin fa innahoo yasluku mim baini yadihi wa min khalfihee rasadaa",
            "verse 72:28": "Liya`lama an qad ablaghoo risaalaati rabbihim wa ahaata bima ladihim wa ahsaa kulla shai`in `adadaa"
        },
        "Russian": {
            "verse 72:1": "Скажи: \"Открыто мне, что джиннов сонм, Услышав чтение, сказали: \"Поистине, мы дивный слышали Коран.",
            "verse 72:2": "Он к Истине указывает путь, В него уверовали мы И в поклонении Аллаху Других богов не будем измышлять.",
            "verse 72:3": "И пусть достойно вознесется Величественность нашего Владыки, - Себе ни сына, ни супруги Он не брал.",
            "verse 72:4": "Средь нас один безумец был, Кто возмутительную (ложь) высказывал против Аллаха.",
            "verse 72:5": "Мы думали, ни люди и ни джинны Ложь на Аллаха никогда не станут возводить.",
            "verse 72:6": "Конечно, средь людей бывали и такие, Которые убежища искали среди джиннов, Но те лишь увеличили безумие таких.",
            "verse 72:7": "Они считали, как и вы, Что никого Аллах вам не пошлет, (Чтоб вас на путь Его наставить).",
            "verse 72:8": "Мы прикоснулись (к таинствам) небес И там нашли их полными могучих стражей И светочей, (что разлетаются сжигающим огнем).",
            "verse 72:9": "Мы на седалищах там затаились, Чтоб слышать, (что там говорят); Но кто сейчас услышать пожелает, Найдет там для себя Подстерегающий его горящий светоч.",
            "verse 72:10": "И мы понять того не можем: Задумано ли зло для тех, кто на земле,",
            "verse 72:11": "Средь нас есть те, Кто добродетелен и кто порочен, - Идем различными путями мы,",
            "verse 72:12": "Но знаем: Могущества Аллаха на земле нам не ослабить И (замыслов) Его не избежать.",
            "verse 72:13": "И мы, когда услышали про путь прямой, В него уверовали (тотчас), - Ведь тот, кто верует, - Тому неведом страх Ни пред потерею (награды в День Суда), Ни перед незаслуженною (карой).",
            "verse 72:14": "Средь нас есть те, кто Господу предался, Но есть и те, кто отступил. И те, которые предАлись, Идут по верному пути\"\".",
            "verse 72:15": "Но те, кто отступил, - Им быть растопкою для адова костра!",
            "verse 72:16": "А если б удержались на прямой стезе они, Мы напоили б их водой обильной.",
            "verse 72:17": "Мы этим испытали б их; Того ж, кто Бога своего не поминает, Подвергнет Он суровой каре.",
            "verse 72:18": "Лишь для Аллаха все места молений! И вы других богов Ему не измышляйте.",
            "verse 72:19": "И вот когда, к Всевышнему взывая, Поднялся раб Аллаха (Мухаммад), Они толпою плотной встали вкруг него.",
            "verse 72:20": "Скажи: \"Взываю я лишь к своему Владыке И соучастников Ему не придаю\".",
            "verse 72:21": "Скажи: \"Не властен я ни злом (вас наказать) (И ни добром) на путь вас праведный наставить\".",
            "verse 72:22": "Скажи: \"Никто меня от Господа не защитит, И не найти убежища нигде мне, Кроме как у Бога,",
            "verse 72:23": "Коль я не передам (того, что Он вещает), Его посланий (вам не изъясню). А тем, кто будет непослушен Аллаху и посланнику Его, Назначен Ад, где пребывать им вечно\".",
            "verse 72:24": "Когда же наконец они увидят то, Что было им обещано (в сей жизни), Они узнают, Кто слабее по числу (помощников) своих И меньше по числу (собратьев).",
            "verse 72:25": "Скажи: \"Не знаю я, близка ли вам обещанная (кара) Или Аллах назначил более далекий срок. Или Господь на путь прямой желает их направить?",
            "verse 72:26": "Ему лишь одному Незримое известно, И в сокровенное Свое Он не допустит никого,",
            "verse 72:27": "Кроме посланника, которого Он выбрал, И стражей перед ним и сзади,",
            "verse 72:28": "Чтобы (с уверенностью) мог он знать, Что (в чистоте и точности) Они передают ему послания Господни, - Господь объемлет их во всем И счет ведет всему, что суще\"."
        },
        "Sindhi": {
            "verse 72:1": "(اي پيغمبر) چؤ ته مون ڏانھن (ھن ڳالھ جو) وحي موڪليو ويو ته جِنّن مان ھڪ ٽوليءَ (قرآن) ٻڌو پوءِ چيائون ته بيشڪ اسان ھڪ عجيب قرآن ٻڌو.",
            "verse 72:2": "جو سڌي رستي ڏانھن ڏس ڏئي ٿو تنھنڪري ان تي ايمان آندوسون، ۽ پنھنجي پالڻھار سان ڪنھن ھڪڙي کي شريڪ ھرگز نه ڪنداسون.",
            "verse 72:3": "۽ (بيان ڪرڻ لڳا) ته اسان جي پالڻھار جو شان تمام وڏو آھي نڪي ڪو زال ۽ اولاد رکيو اٿس.",
            "verse 72:4": "۽ ھي ته الله جي نسبت ۾ اسان مان بيوقوف ڪوڙو ٺاھ ٺاھيو ٿي.",
            "verse 72:5": "۽ ھي ته اسان ڀانيو ھو ته اسان ۽ جنّ ڪڏھن الله تي ڪوڙ نه چوندا.",
            "verse 72:6": "۽ ھي ته ماڻھن مان ڪيترا مڙس جنّن جي مڙسن جي سام پوندا ھوا پوءِ ماڻھن جنّن (جي حق) ۾ (ھٿئون) وڏائي وڌائي.",
            "verse 72:7": "۽ ھي ته (اي جنّو) ماڻھن اھڙو گمان ڪيو ھو جھڙو اوھان گمان ڪيو ھو ته الله ھرگز ڪنھن کي پيغمبر ڪري نه موڪليندو.",
            "verse 72:8": "۽ ھي ته اسان آسمان کي جاچيو پوءِ ڏٺوسونس ته سخت چوڪيدارن ۽ اُلانبن سان ڀرجي ويو آھي.",
            "verse 72:9": "۽ ھي ته اسان (اڳي) آسمان جي (گھڻن) رستن تي (ملائڪن جي گفتگو) ٻڌڻ لاءِ وھندا ھواسين، پوءِ جيڪو ھاڻي ڪن ڏيندو آھي سو پاڻ لاءِ تيار ٿيل اُلانبي وارو تارو ڏسندو آھي.",
            "verse 72:10": "۽ ھي ته اسين نه ٿا ڄاڻون ته جيڪي زمين ۾ آھن تن لاءِ ڪنھن مدائي جو ارادو ڪيو ويو آھي يا انھن لاءِ سندن پالڻھار ڪو چڱائي جو ارادو ڪيو آھي.",
            "verse 72:11": "۽ ھي ته ڪي اسان مان سڌريل آھن ۽ اسان مان ڪي اُن کانسواءِ (به) آھن، (اسين) مختلف ٽوليون ٽوليون ھواسون.",
            "verse 72:12": "۽ ھي ته اسان ڄاتو ته زمين ۾ الله کي ڪڏھن به ٿَڪائي نه سگھنداسون ۽ نڪي ڀڄي ڪڏھن ٿَڪائي سگھنداسونس.",
            "verse 72:13": "۽ ھي ته جڏھن اسان ھدايت (جي ڳالھ) ٻڌي (تڏھن) اُن تي ايمان آندوسون، پوءِ جيڪو پنھنجي پالڻھار تي ايمان آڻيندو سو نڪي ڪنھن نقصان کان ۽ نڪي ڪنھن ظلم کان ڊڄندو.",
            "verse 72:14": "۽ ھي ته اسان مان ڪي مسلمان آھن ۽ اسان مان ڪي گنھگار آھن، پوءِ جيڪي مُسلمان ٿيا تن سِڌي واٽ جي نيت ڪئي.",
            "verse 72:15": "۽ گنھگار سي دوزخ جي ڪاٺيون ھوندا.",
            "verse 72:16": "۽ (اي پيغمبر) ھيءَ (به چؤ ته مون ڏانھن موڪليو ويو آھي) ته جيڪڏھن ماڻھو سڌيءَ واٽ تي بيھڪ وٺن ھا ته ضرور انھن (جي پوکن) کي گھڻو پاڻي پياريون ھا.",
            "verse 72:17": "ته اُن ۾ کين پرکيون ۽ جيڪو پنھنجي پالڻھار جي ياد ڪرڻ کان مُنھن موڙيندو تنھن کي (الله) سخت عذاب ۾ ڦاسائيندو.",
            "verse 72:18": "۽ ھي ته سڀ مسجدون (خاص) الله جون آھن تنھنڪري الله سان گڏ ڪنھن جي عبادت نه ڪريو.",
            "verse 72:19": "۽ ھي ته جنھن مھل الله جو ٻانھو (ﷴ ﷺ) بيٺو ته سندس عبادت ڪري تنھن مھل جنّ مٿس ڳاھٽ ڪرڻ تي ھوا.",
            "verse 72:20": "چؤ ته آءٌ رڳو پنھنجي پالڻھار جي عبادت ڪريان ٿو ۽ ڪنھن ھڪڙي کي ساڻس شريڪ نه ٿو ڪريان.",
            "verse 72:21": "چؤ ته بيشڪ آءٌ اوھان کي ڏک پھچائڻ ۽ سنئي رستي تي آڻڻ جو وس نٿو رکان.",
            "verse 72:22": "چؤ ته بيشڪ مون کي الله (جي عذاب) کان ڪوبه نه بچائيندو، ۽ اُن کانسواءِ ڪا پناھ ڪڏھن نه لھندس.",
            "verse 72:23": "مگر الله جي پار کان خبر پھچائڻي آھي ۽ سندس پيغام پھچائڻا آھن ۽ جيڪو الله ۽ سندس پيغمبر جي نافرماني ڪندو تنھن لاءِ بيشڪ دوزخ جي باھ آھي جنھن ۾ سدائين رھندا.",
            "verse 72:24": "(ايستائين غفلت ۾ رھندا) جيسين ڪه جيڪو اُنھن کي انجام ڏجي ٿو سو ڏسن پوءِ ڄاڻندا ته مددگار جي ڪري وڌيڪ ھيڻو ۽ ڳاڻيٽي جي ڪري تمام ٿورو ڪير آھي.",
            "verse 72:25": "(کين) چؤ ته آءٌ نه ٿو ڄاڻان ته جنھنجو اوھان کي انجام ڏجي ٿو سو (الائي) ويجھو آھي يا منھنجو پالڻھار اُن جي ڪا (ٻي) مُدت مُقرر ڪندو.",
            "verse 72:26": "(اُھو) ڳُجھ جو ڄاڻندڙ آھي پوءِ پنھنجي ڳجھ تي ڪنھن ھڪڙي کي واقف نه ڪندو آھي.",
            "verse 72:27": "سواءِ انھيءَ جي جو جنھن پيغمبر کي پسند ڪيائين بيشڪ الله سندس اڳتان ۽ سندس پوئتان نگھبان (ملائڪ) موڪليندو آھي.",
            "verse 72:28": "(ھن لاءِ) ته ڄاڻي ته پنھنجي پالڻھار جا حُڪم سچ پچ پھچايا اٿن ۽ جيڪي وٽن آھي تنھنکي الله ھر طرح پنھنجي وس رکيو آھي ۽ سڀڪنھن شيءَ جو ڳاڻيٽو ڳڻي ڇڏيو اٿس."
        },
        "Sinhalese": {
            "verse 72:1": "නියත වශයෙන්ම ජින්නුන්ගෙන් පිරිසක් (අල් කුර්ආනයට) සවන් දී \"සැබැවින්ම අපි පුදුමාකාර පාරායනයකට සවන් දුන්නෙමු යැයි පැවසූ වග මා වෙත දේව පණිවිඩය මගින් දන්වනු ලැබීය” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 72:2": "එය ඍජු මාර්ගය වෙත මග පෙන්වයි. එහෙයින් අපි එය විශ්වාස කළෙමු. අපගේ පරමාධිපතිට කිසිවකු හෝ ආදේශ නොකරන්නෙමු යැයි පැවසූ බවත් (දන්වනු ලැබීය.)",
            "verse 72:3": "“තවද නියත වශයෙන්ම අපගේ පරමාධිපතිගේ කීර්තිය උත්තරීතර විය. ඔහු සහකාරියක හෝ දරුවෙකු හෝ නොගත්තේය.”",
            "verse 72:4": "තවද අප අතර සිටි අඥානයකු අල්ලාහ්ට එරෙහි ව ප්‍රබන්ධ කතා පවසා සිටියේය.",
            "verse 72:5": "“මිනිස් වර්ගයා හා ජින් වර්ගයා අල්ලාහ්ට එරෙහි ව බොරුවක් කිසිවිටෙක නොපවසනු ඇතැයි නියත වශයෙන්ම අපි සිතමින් සිටියෙමු.”",
            "verse 72:6": "තවද නියත වශයෙන්ම ජින් වර්ගයාගෙන් වූ පිරිසකගෙන් මිනිස් වර්ගයාගෙන් පිරිසක් ආරක්ෂාව පැතුවෝය. එහෙයින් ඔවුහු ඔවුනට උඩඟුකම අධික කළෝය.",
            "verse 72:7": "අල්ලාහ් කිසිවකු හෝ නැවත (පණ දී) එවන්නේම නැතැයි නුඹලා සිතුවාක් මෙන් සැබැවින්ම ඔවුහු ද සිතුවෝය.",
            "verse 72:8": "තවද නියත වශයෙන්ම (ජින්වරුන් වන) අපි අහස ස්පර්ශ කළෙමු. එවිට එය දැඩි ආරක්ෂාවෙන් හා උල්කාපාත වලින් පිරී තිබෙනු අපි දුටුවෙමු.",
            "verse 72:9": "තවද (අහසේ සිදුවන කතා බහ) සවන් දීම සඳහා අසුන් ගන්නා ස්ථානයන්හි අසුන් ගන්නට අපි පුරුදුව සිටියෙමු. දැන් කවරෙකු හෝ එසේ සවන් දුන්නේ නම් එවිට උල්කා ප්‍රහාර ඔහු දකිනු ඇත.",
            "verse 72:10": "තවද මහපොළොවේ වෙසෙන්නන් හට නපුරක් අපේක්ෂා කරනු ලබන්නේ ද එසේ නැතහොත් ඔවුන්ගේ පරමාධිපති ඔවුනට යහමග අපේක්ෂා කරන්නේ දැයි නියත වශයෙන්ම අපි නොදනිමු.",
            "verse 72:11": "තවද නියත වශයෙන්ම අප අතරින් දැහැමියෝ ද වෙති. එමෙන්ම අප අතරින් එසේ නොවන්නන් ද වෙති. අපි විවිධ මාර්ග වල වෙන් ව සිටියෙමු.",
            "verse 72:12": "තවද මහපොළොවේ අල්ලාහ් පරාජය කිරීමට අපට නොහැකි බවත් පලා යෑමෙන් ඔහු පරාජයට පත් කළ නොහැකි බවත් සැබැවින්ම අපි සිතුවෙමු.",
            "verse 72:13": "තවද නියත වශයෙන්ම අපි යහමගට සවන් දුන් කල්හි අපි එය විශ්වාස කළෙමු. එහෙයින් කවරෙකු තම පරමාධිපති විශ්වාස කරන්නේ ද එවිට පාඩුවක් ගැන හෝ අසාධාරණයක් ගැන හෝ ඔහු බිය නොවනු ඇත.",
            "verse 72:14": "තවද නියත වශයෙන්ම අප වනාහි අප අතරින් අවනත වන්නෝ ද වෙති. එමෙන්ම අප අතරින් (සත්‍යයෙන්) බැහැර වන්නෝ ද වෙති. එහෙයින් කවුරුන් අවනත වන්නෝ ද ඔවුහු ඍජු මග සොයා ගත්තෝය.",
            "verse 72:15": "තවද (සත්‍යයෙන්) බැහැර වන්නෝ වූ කලී නිරය සඳහා ඉන්ධන බවට ඔවුහු පත් වූවෝය.",
            "verse 72:16": "එසේම (යහ) මාර්ගයේ ඔවුන් ස්ථාවර ව සිටියේ නම් අපි ඔවුනට බහුල වශයෙන් ජලය සපයන්නෙමු යන වගත් (මට දන්වනු ලැබීය.)",
            "verse 72:17": "එය අපි ඔවුන් එහි පරීක්ෂාවට ලක් කරනු පිණිසය. තවද කවරෙකු තම පරමාධිපති මෙනෙහි කිරීම පිටු දකින්නේ ද ඔහු ඔහු ව දරුණු දඬුවමට යොමු කරනු ඇත.",
            "verse 72:18": "තවද නියත වශයෙන්ම මස්ජිදයන් අල්ලාහ් සතුය. එහෙයින් නුඹලා අල්ලාහ් සමග කිසිවෙක් නොඅයදිනු.",
            "verse 72:19": "තවද නියත වශයෙන්ම අල්ලාහ්ගේ ගැත්තා (නබිවරයා) ඔහු වෙත ඇරයුම් කිරීමට නැගී සිටී කල්හි ඔවුහු කණ්ඩායම් වශයෙන් ඔහු වෙත සමීපවන්නට වූවෝය.",
            "verse 72:20": "“නියත වශයෙන්ම මා අයදිනුයේ මාගේ පරමාධිපතිවය. තවද මම ඔහුට කිසිවකු හෝ ආදේශ නොකරමි” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 72:21": "“නුඹලාට යම් හානියක් හෝ යම් මග පෙන්වීමක් හෝ සිදු කරන්නට නියත වශයෙන්ම මා බලය නොදරමි” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 72:22": "“(මා අවනත නොවුයේ නම්) අල්ලාහ්ගෙන් මා ආරක්ෂා කරන්නට කිසිවකුට නොහැක්කේමය. තවද ඔහු හැර වෙනත් පිළිසරණක් මම කිසිවිටෙක නොලබමි” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 72:23": "අල්ලාහ් හා ඔහුගේ දූත පණිවිඩය ගැන දැනුම් දීම මිස (වෙනත් කිසිවක් මා සතු නොවේ.) තවද කවරෙකු අල්ලාහ්ට හා ඔහුගේ දූතයාණන්හට පිටුපාන්නේද එවිට නියත වශයෙන්ම ඔහුට නිරා ගින්න ඇත. ඔවුහු එහි නිරන්තරයෙන්ම සදාතනිකයින් වෙති.",
            "verse 72:24": "අවසානයේ ප්‍රතිඥා දෙනු ලබන දෑ ඔවුහු දුටු විට උදව්කරුගෙන් වඩාත් දුර්වල කවුරුන් දැයි ද සංඛ්යාවෙන් වඩාත් අඩු කවුරුන් දැයි ද ඔවුහු මතු දැන ගනු ඇත.",
            "verse 72:25": "“නුඹලාට ප්‍රතිඥා දෙනු ලබන දෑ සමීප ද? එසේ නැතහොත් මාගේ පරමාධිපති එයට දිගු කලක් තබා ඇත්තේදැයි ද මම නොදනිමි” යැයි (නබිවරය!) නුඹ පවසනු.",
            "verse 72:26": "ඔහු ගුප්ත දෑ දන්නාය. එහෙයින් ඔහුගේ ගුප්ත දෑ කිසිවකුට ඔහු හෙළිදරව් නොකරයි.",
            "verse 72:27": "නමුත් රසූල්වරයකුගෙන් ඔහු තෝරා ගත් අයට හැර. එවිට ඔහු ඉදිරියෙන් හා ඔහු පසුපසින් නියත වශයෙන්ම ඔහු ආරක්ෂකයින් ගමන් කරවනු ඇත.",
            "verse 72:28": "ඔවුන්ගේ පරමාධිපතිගේ දූත පණිවිඩ ඔවුන්ට දැනුම් දී ඇත්තේදැයි ඔහු දැන ගනු පිණිසය. ඔවුන් සමග ඇති දෑ පිළිබඳ ව ඔහු සර්ව ප්‍රකාරයෙන් දැන සිටියි. තවද සියලු දෑ ගණන් කොට තබා ඇත."
        },
        "Somali": {
            "verse 72:1": "Waxaad Dhahdaa (Nabiyow) waxaa lay waxyooday inay Dhagaysteen Koox Jinni ah (Quraanka) Dheheen waxaan maqallay quraan layaab leh.",
            "verse 72:2": "Oo ku hanuunin xaqa waana Rumaynay waxaan Eebe cibaada la wadaajinhaynana ma jiro.",
            "verse 72:3": "Waxaana Sarreeya sharafta Eebeheen, mana yeelan haweenay iyo ilmo midna.",
            "verse 72:4": "Waxay Ahaayeen kuwannagii xumaa inay ku dhaheen hadallo xadgudug ah Eebe.",
            "verse 72:5": "Waxaana u Malaynaynay inuusan insi iyo Jini Midna Eebe ku beensheegaynin.",
            "verse 72:6": "Waxayna ahaayeen kuwo insiga ka mid ah inay Magangalaan kuwo Jinniga ka mida markaasna u kordhiyeen kibir (iyo xad Gudub).",
            "verse 72:7": "Waxayna jinnigu u maleeyeen sidaad u malayseen inaan Eebe soo Bixinhaynin Ruuxna.",
            "verse 72:8": "Waxaan Doonnay samada waxaana hellay iyadoo ka buuxda Ilaalin daran iyo danabyo.",
            "verse 72:9": "Waxaana ahayn kuwo Fadhiista xageeda meelo si aan wax uga dhagaysanno Ruuxiise Dhagaysta hadda wuxuu heli danabyo darban «la kulmi».",
            "verse 72:10": "Mana ogin inay tahay shar lala Doonay dadka Dhulka ku nool ama Eebohood la Doonay hanuun (iyo khayr).",
            "verse 72:11": "Waxaa naga mid ah kuwo suuban iyo kuwo kaleba, waxaan nahay kooxa kala duwan.",
            "verse 72:12": "Waxaanna Ognahay Inaannaan Eebe ku daalinkarin Dhulka Dhexdiisa, kuna Daalinhaynin Cararid.",
            "verse 72:13": "Markaan Maqallay hanuunkana waan Rumaynay, Ruuxii rumeeya Eebihiisana kama yaabo Nusqaan iyo Dulmi Midna.",
            "verse 72:14": "Waxaa naga mida Muslimiin iyo Kuwo xadgudbay, Ruusiise islaama waa mid ku dadaalay hanuun.",
            "verse 72:15": "Kuwiise xadgudbay waxay ahaan Qoryaha Jahannamo.",
            "verse 72:16": "Hadday ku toosaan Dadku jidka (wanaagsan) waxaaan ka waraabinlahayn biyo badan.",
            "verse 72:17": "Imtixaan Dartiis, Ruuxii ka Jeedsada Xusidda Eebihiis wuxuu galin cadaab daran.",
            "verse 72:18": "Masaajidda Eebaa iska leh ee ha kula baryina «caabudina» Eeb Cid kale.",
            "verse 72:19": "Markuu istaagay Addoonkii Eebe (Nabigu) isagoo Caabudi Eebe waxay Jinnigu u dhawaadeen inay korkiisa is dulfuulan.",
            "verse 72:20": "Waxaad Dhahdaa Nabiyow waxaan uun Caabudi Eebahay lana wadaajinmahayo cidna.",
            "verse 72:21": "Waxaad dhahdaa idiin ma hanto shar iyo khayr midna.",
            "verse 72:22": "Waxaad Dhahdaa cidna igama korinayso Eebe, mana helayo isaga ka sakow Magangalyo.",
            "verse 72:23": "Hase yeeshee waxaan hantaa Gaadhsiinta xaqa Eebe iyo Farriimihiisa, Ruuxiise Eebe Caasiya iyo Rasuulkiisa waxaa u sugnaaday Naarta Jahannama isagoo ku waari Dhexdeeda.",
            "verse 72:24": "Markay Gaaladu Arkaan waxa loo yaboohi waxay ogaan cidda Gargaarihiisu tabaryaryahay tirana yaryahay.",
            "verse 72:25": "Waxaad Dhahdaa ma ogi inuu Dhawyahay waxa la idiinku Gooddin ama Eebahay waqti u yeeli.",
            "verse 72:26": "Eebaa og waxa Maqan, umana muujiyo waxaa maqan Ruuxna.",
            "verse 72:27": "Marka laga Reebo ciduu ka raalli Noqday oo Rasuulah, Isagoo hor iyo gadaalba ka ilaalin.",
            "verse 72:28": "Si Eebe u muujiyo inay Gaadhsiiyeen Farriimihii Eebohood, Eebana waa koobay waxa Agtooda ah wayna u tirakoobanyihiin wax walba."
        },
        "Spanish": {
            "verse 72:1": "Di: Se me ha inspirado que unos genios han escuchado y han dicho: Hemos oído una Recitación maravillosa",
            "verse 72:2": "que conduce a la guía recta, así que hemos creído en ella y no asociamos a ningún otro con nuestro Señor.",
            "verse 72:3": "Y en verdad que Él, ensalzada sea la majestad de nuestro Señor, no ha tomado ni compañera ni hijo.",
            "verse 72:4": "Sino que nuestro necio decía una enorme mentira contra Allah.",
            "verse 72:5": "Cuando pensábamos que ni los hombres ni los genios eran capaces de decir mentiras contra Allah.",
            "verse 72:6": "Y algunos hombres de los humanos buscaban refugio en hombres de los genios con lo cual no hacían sino aumentarles su osadía en el mal.",
            "verse 72:7": "Y pensaron, como pensasteis, que Allah no levantaría a nadie.",
            "verse 72:8": "Quisimos acceder al cielo pero lo encontramos lleno de una fuerte vigilancia y de estrellas fugaces.",
            "verse 72:9": "Solíamos tomar posiciones en él para escuchar, pero ahora quien intenta escuchar encuentra una estrella fugaz que lo persigue.",
            "verse 72:10": "Y no sabemos si se quiere mal para quien hay en la tierra o si su Señor quiere guiarlos.",
            "verse 72:11": "Entre nosotros los hay que son rectos y los hay que no lo son; somos caminos distintos.",
            "verse 72:12": "Supimos que no podríamos escapar de Allah en la tierra y que tampoco podríamos salir huyendo",
            "verse 72:13": "Y realmente cuando oímos la guía, creímos en ella.Quien crea en su Señor, no tendrá que temer ni menoscabo ni opresión.",
            "verse 72:14": "Entre nosotros los hay musulmanes y los hay injustos.El que se somete... Esos están en la buena dirección.",
            "verse 72:15": "Pero los injustos... Son leña de Yahannam.",
            "verse 72:16": "Si fueran con rectitud por el camino, les daríamos a beber agua en abundancia.",
            "verse 72:17": "Para con ello ponerlos a prueba. A quien se aparte del recuerdo de su Señor, le haremos entrar en un penoso castigo.",
            "verse 72:18": "Y puesto que las mezquitas son de Allah, no invoquéis a nadie junto a Allah.",
            "verse 72:19": "Y cuando el siervo de Allah se ponía a invocarlo a punto estaban de venírsele encima.",
            "verse 72:20": "Decía: Sólo invoco a mi Señor sin asociarle a nadie.",
            "verse 72:21": "Di: No tengo poder ni para perjudicaros ni para conduciros a ningún bien.",
            "verse 72:22": "Di: Nadie me librará de Allah y fuera de Él no encontraré ningún refugio.",
            "verse 72:23": "No es sino una transmisión, de parte de Allah, de Sus mensajes. Y quien desobedece a Allah y a Su mensajero tendrá el fuego de Yahannam donde será inmortal para siempre.",
            "verse 72:24": "Hasta que llegue el momento en que vean lo que se les prometió y sepan quién tiene el más débil auxilio y cuenta con menor número de fuerzas.",
            "verse 72:25": "Di: No sé si lo que se os promete está cerca o si mi Señor me dará algún plazo más.",
            "verse 72:26": "El Conocedor del No-Visto, a nadie le da acceso a Su No-Visto.",
            "verse 72:27": "A excepción de aquel mensajero que goza de Su beneplácito.Y es cierto que despliega vigilancia delante y detrás de él",
            "verse 72:28": "para saber si ha transmitido los mensajes de su Señor.Él abarca lo que ellos poseen y toma en cuenta con detalle cada cosa."
        },
        "Swahili": {
            "verse 72:1": "Sema: Imefunuliwa kwangu ya kuwa kundi moja la majini lilisikiliza, na likasema: Hakika sisi tumeisikia Qur'ani ya ajabu!",
            "verse 72:2": "Inaongoza kwenye uwongofu, kwa hivyo tumeiamini, wala hatutamshirikisha yeyote na Mola wetu Mlezi.",
            "verse 72:3": "Na kwa hakika utukufu wa Mola wetu Mlezi umetukuka kabisa; hana mke wala mwana.",
            "verse 72:4": "Na kwa hakika wapumbavu miongoni mwetu walikuwa wakisema uwongo ulio pindukia mipaka juu ya Mwenyezi Mungu.",
            "verse 72:5": "Nasi tulidhani kuwa watu na majini hawamzulii uwongo Mwenyezi Mungu.",
            "verse 72:6": "Na hakika walikuwako wanaume katika watu walio kuwa wakitafuta kujikinga kwa wanaume wa kijini; kwa hivyo wakawazidisha madhambi.",
            "verse 72:7": "Na kwa hakika wao walidhani, kama mlivyo dhani nyinyi, ya kuwa Mwenyezi Mungu hatamleta Mtume.",
            "verse 72:8": "Nasi tulizigusa mbingu, na tukaziona zimejaa walinzi wenye nguvu na vimondo.",
            "verse 72:9": "Na hakika tulikuwa tukikaa humo katika baadhi ya makao ili kusikiliza; lakini sasa anaye taka kusikiliza atakuta kimondo kinamvizia!",
            "verse 72:10": "Nasi hatujui kama wanatakiwa shari wale wanao kaa kwenye ardhi au Mola wao Mlezi anawatakia uwongofu.",
            "verse 72:11": "Na hakika katika sisi wamo walio wema, na wengine wetu ni kinyume na hivyo. Tumekuwa njia mbali mbali.",
            "verse 72:12": "Nasi tulijua kuwa hatutomshinda Mwenyezi Mungu duniani, wala hatuwezi kumponyoka kwa kukimbia.",
            "verse 72:13": "Nasi tulipo usikia uwongofu tuliuamini. Basi mwenye kumuamini Mola wake Mlezi basi haogopi kupunjwa wala kudhulumiwa.",
            "verse 72:14": "Na hakika wamo katika sisi Waislamu, na wamo kati yetu wanao acha haki. Basi walio silimu, hao ndio walio tafuta uwongofu.",
            "verse 72:15": "Na ama wanao acha haki, hao watakuwa kuni za Jahannamu.",
            "verse 72:16": "Na lau kama wangeli simama sawasawa juu ya njia tungeli wanywesha maji kwa wingi,",
            "verse 72:17": "Ili tuwajaribu kwa hayo. Na anaye puuza kumkumbuka Mola wake Mlezi atamsukuma kwenye adhabu ngumu.",
            "verse 72:18": "Na hakika misikiti ni ya Mwenyezi Mungu, basi msimuabudu yeyote pamoja na Mwenyezi Mungu.",
            "verse 72:19": "Na hakika Mja wa Mwenyezi Mungu alipo simama kumwomba, wao walikuwa karibu kumzonga!",
            "verse 72:20": "Sema: Hakika mimi namwomba Mola wangu Mlezi, wala simshirikishi Yeye na yeyote.",
            "verse 72:21": "Sema: Mimi sina mamlaka ya kukudhuruni wala kukuongozeni.",
            "verse 72:22": "Sema: Hakika hapana yeyote awezae kunilinda na Mwenyezi Mungu, wala sitapata pa kukimbilia isipo kuwa kwake Yeye tu.",
            "verse 72:23": "Ila nifikishe Ujumbe utokao kwa Mwenyezi Mungu na risala zake. Na wenye kumuasi Mwenyezi Mungu na Mtume wake, basi hakika hao watapata Moto wa Jahannamu wadumu humo milele.",
            "verse 72:24": "Hata watakapo yaona wanayo ahidiwa, ndipo watakapo jua ni nani mwenye msaidizi dhaifu, na mchache wa idadi.",
            "verse 72:25": "Sema: Sijui kama yapo karibu hayo mnayo ahidiwa, au Mola wangu Mlezi atayawekea muda mrefu.",
            "verse 72:26": "Yeye ndiye Mwenye kujua ya siri, wala hamdhihirishii yeyote siri yake,",
            "verse 72:27": "Isipo kuwa Mtume wake aliye mridhia. Naye huyo humwekea walinzi mbele yake na nyuma yake.",
            "verse 72:28": "Ili Yeye ajue kwamba wao wamefikisha ujumbe wa Mola wao Mlezi, na Yeye anayajua vyema yote walio nayo, na amedhibiti idadi ya kila kitu."
        },
        "Swedish": {
            "verse 72:1": "Säg [Muhammad]: ”Det har uppenbarats för mig att en skara av osynliga väsen fick lyssna till [Koranen], och [att] de sade [till de sina]: 'Vi har lyssnat till en märklig uppläsning,",
            "verse 72:2": "som leder [lyssnaren] till kunskap om rätt och orätt. Vi tror på dess [ord] och vi skall inte sätta gudar vid vår Herres sida.",
            "verse 72:3": "Låt Vår Herres namn hållas högt i ära, Han som aldrig haft en ledsagerska vid Sin sida och inte har [avlat] någon son!",
            "verse 72:4": "Den dåraktigaste av oss brukade göra oerhörda [påståenden] om Gud,",
            "verse 72:5": "och förr trodde vi att varken människorna eller de osynliga väsendena skulle yttra lögner om Gud.",
            "verse 72:6": "Men det fanns människor som hade för vana att anropa några av de osynliga väsendena om skydd, och kom på så sätt deras högmod att växa,",
            "verse 72:7": "och de trodde, liksom ni har trott, att Gud inte skulle sända någon ytterligare [profet].",
            "verse 72:8": "Vi försökte nå himlen [för att utforska dess hemligheter], men där fann vi mäktiga väktare och flammor av eld;",
            "verse 72:9": "och vi [försökte] komma till de platser där vi brukade lyssna, men den som nu vill lyssna kommer att finna [att] en flamma av eld ligger i beredskap för honom.",
            "verse 72:10": "Vi vet inte om de som lever på jorden skall få det onda [på sin lott] eller om deras Herre vill [ge dem] kunskap om rätt och orätt.",
            "verse 72:11": "Bland oss finns de som vill göra det rätta och andra som har mindre intresse för det rätta; ja, vi har alltid varit delade i olika grupper.",
            "verse 72:12": "Men vi har insett att vi inte kan trotsa Guds [vilja] på jorden och inte heller komma undan den genom att fly.",
            "verse 72:13": "Och efter att [nu] ha fått höra om vägledningen, tror vi på den; den som tror på sin Herre behöver inte vara rädd att [hans förtjänster] skall frånkännas honom eller [att han skall få lida annan] orätt.",
            "verse 72:14": "Bland oss finns [nu] de som har underkastat sig Guds vilja och de som går det ondas väg. De som har underkastat sig Guds vilja är de som sökte kunskap om rätt och orätt;",
            "verse 72:15": "men de som väljer att gå det ondas väg skall bli bränsle för helvetets [ugnar]!'”",
            "verse 72:16": "OM DE [som förnekar Oss] hade slagit in på den raka vägen, skulle Vi helt visst ha skänkt dem regn i riklig mängd",
            "verse 72:17": "för att pröva deras [villighet att tacka Oss för Våra gåvor]. Och den som vägrar att åkalla sin Herre skall Han utlämna åt ett straff från vilket ingen lindring ges.",
            "verse 72:18": "All dyrkan tillkommer Gud; anropa därför ingen vid sidan av Honom!",
            "verse 72:19": "Men när Guds tjänare reser sig för att anropa Honom tränger massorna på [som om de ville övermanna honom].",
            "verse 72:20": "Säg: \"Jag anropar ingen annan än min Herre och jag sätter ingen vid Hans sida.\"",
            "verse 72:21": "Säg: \"Jag har ingen makt över er och kan inte vålla er skada; inte heller [kan jag] förmå er att följa den raka vägen.\"",
            "verse 72:22": "Säg: \"Ingen kan skydda mig mot Gud och jag kan heller inte finna en tillflykt undan Honom,",
            "verse 72:23": "om [jag] inte förkunnar vad Gud [befaller mig att förkunna] och framför [alla] Hans budskap.\" Och på den som visar olydnad mot Gud och Hans Sändebud väntar helvetets eld och i den skall han [och hans likar] förbli till evig tid.",
            "verse 72:24": "När de [som sätter gudar vid Guds sida] till sist får skåda [straffet], som de varnades för; skall de inse vilka som hade det svagaste stödet och var obetydligast till antalet [- de eller de troende]!",
            "verse 72:25": "Säg: \"Jag vet inte om det som har lovats er är nära förestående eller om min Herre skall skjuta upp det.\"",
            "verse 72:26": "Han känner det som är dolt för människor, men Han låter ingen få insikt i Sina hemligheter",
            "verse 72:27": "utom det sändebud som Han [utser till detta]. Och då sätter Han ut vakter framför och bakom sändebudet,",
            "verse 72:28": "för att det skall vara uppenbart att [han såväl som de andra sändebuden] har kunnat framföra sin Herres budskap. Allt som berör dem har Han under uppsikt och Han håller räkning på allt [i Sin skapelse]."
        },
        "Tajik": {
            "verse 72:1": "Бигӯ: «Ба ман ваҳй шудааст, ки гурӯҳе аз ҷин гӯш андохтанду гуфтанд,- ки мо Қуръоне аҷиб шунидем.",
            "verse 72:2": "ба роҳи рост ҳидоят мекунад. Пас мо ба он имон овардем ва ҳаргиз касеро шарики Парвардигорамон намесозем.",
            "verse 72:3": "Азамати Парвардигори мо олист. На ҳамсаре гирад, ва на фарзанде дорад.",
            "verse 72:4": "Ва бехиради мо дар бораи Худо суханоне ба ноҳақ мегуфт.",
            "verse 72:5": "Ва мо мепиндоштем, ки одамиву ҷин дар бораи Худо дурӯғ намегӯянд.",
            "verse 72:6": "Ва низ мардоне буданд аз одамиён, ки ба мардоне аз ҷин паноҳ мебурданд ва бар саркашиашон меафзуданд.",
            "verse 72:7": "Ҳамчунон ки шумо мепиндоштед, онҳо ҳам мепиндоштанд, ки Худо ҳеҷ касро дубора зинда намесозад.",
            "verse 72:8": "Мо ба осмон расидем ва онро пур аз нигаҳбонони қудратманду шиҳобҳо (чароғ, оташак) ёфтем.",
            "verse 72:9": "Мо дар он ҷойҳо, ки метавон гӯш андохт, менишастем. Аммо ҳар кӣ акнун (ба) гӯш нишинад, шиҳоберо (оташпораеро) дар камини худ ёбад.",
            "verse 72:10": "Аз ин рӯй намедонем, ки оё барои касоне, ки дар рӯи замин ҳастанд, бадӣ тақдир мешавад ё Парвардигорашон мехоҳад ба роҳи росташон бибарад.",
            "verse 72:11": "Баъзе аз мо солеҳанд ва баъзе ҷуз он ва мо фирқаҳое гуногунем.",
            "verse 72:12": "Мо медонем, ки Худоро дар замин нотавон намекунем ва бо гурехтан' низ нотавонаш насозем.",
            "verse 72:13": "Ва чун сухани ҳидоят шунидем, ба он имон овардем. Ва ҳар кӣ ба Парвардигораш имон оварад, на аз нуқсон метарсад ва на аз зулм.",
            "verse 72:14": "Ва баъзе аз мо мусалмонанд ва баъзе аз ҳак, дур. Ва онон, ки ислом овардаанд, дар ҷустуҷӯи роҳи рост будаанд.",
            "verse 72:15": "Аммо онон, ки аз ҳақ дуранд, ҳезуми ҷаҳаннам хоҳанд буд».",
            "verse 72:16": "Ва агар бар тариқаи рост пойдорӣ кунанд аз обе фаровон ба онҳо менушонем,",
            "verse 72:17": "то онҳоро биёзмоем. Ва ҳар кӣ аз зикри Парвардигораш рӯй гардонад, ӯро ба азобе душвор меандозад,",
            "verse 72:18": "Ва масҷидҳо аз ояи Худост. Ва бо вуҷуди Худои якто касе дигарро ба худоӣ махонед.",
            "verse 72:19": "Чун бандаи Худо барои парастиши Ӯ бар пой истод, гирли ӯро гирифтанд.",
            "verse 72:20": "Бигӯ: «Танҳо Парвардигорамро ибодат мекунам ва ҳеҷ касро шарики Ӯ намесозам».",
            "verse 72:21": "Бигӯ: «Ман наметавонам ба шумо зиёне бирасонам ё шуморо ба салоҳ оварам».",
            "verse 72:22": "Бигӯ: «Ҳеҷ кас маро аз уқубати Худо паноҳ надиҳад ва ман ғайри Ӯ паноҳгоҳе намеёбам,",
            "verse 72:23": "он чӣ метавонам фақат расондани паёми Ӯ ва анҷом додани рисолатҳои Ӯ аст. Ва ҳар кӣ Худову паёмбарашро нофармонӣ кунад, насиби ӯ оташи ҷаҳаннам аст, ки ҳамеша дар он хоҳад буд,",
            "verse 72:24": "то он гоҳ ки он чиро ба онҳо ваъда дода буданд, бингаранд. Пас хоҳанд донист, чӣ касеро ёрони нотавонтар ва шумори камтар будааст».",
            "verse 72:25": "Бигӯ: «Ман намедонам, ки оё он ваъдае, ки ба шумо додаанд, наздик аст ё Парвардигори ман барои он замоне нисҳодааст?",
            "verse 72:26": "Ӯ донои ғайб аст ва ғайби худро бар ҳеҷ кас ошкор намесозад,",
            "verse 72:27": "магар бар он паёмбаре, ки аз ӯ хушнуд бошад, зеро ки барои нигаҳбонӣ аз ӯ пеши рӯй ва пушти сараш нигаҳбоне қарор медиҳад,",
            "verse 72:28": "то бидонад, ки онҳо паёмҳои Парвардигорашонро расонидаанд ва Худо ба он чӣ дар назди онҳост, иҳота дорад (бо илми худ) ва ҳама чизро ба адад шумор кардааст»."
        },
        "Tamil": {
            "verse 72:1": "நிச்சயமாக, ஜின்களில் சில (திருக் குர்ஆனை) செவிமடுத்து(த் தம் இனத்தாரிடம் கூறினர்) \"நிச்சயமாக நாங்கள், மிகவும் ஆச்சரியமான ஒரு குர்ஆனை கேட்டோம்\" என்று கூறினர், என எனக்கு வஹீ அறிவிக்கப்பட்டதென்று (நபியே!) நீர் கூறுவீராக.",
            "verse 72:2": "\"அது நேர்மையின் பால் வழிகாட்டுகிறது, ஆகவே அதைக் கொண்டு நாங்கள் ஈமான் கொண்டோம்; அன்றியும் எங்கள் இறைவனுக்கு ஒருவனையும் நாங்கள் இணையாக்கமாட்டோம்\" (என்று அந்த ஜின் கூறலாயிற்று).",
            "verse 72:3": "\"மேலும் எங்கள் இறைவனுடைய மகிமை நிச்சயமாக மிக்க மேலானது, அவன் (எவரையும் தன்) மனைவியாகவோ மகனாகவோ எடுத்துக் கொள்ளவில்லை.",
            "verse 72:4": "\"ஆனால் நம்மில் மூடராகிவிட்ட (சிலர்) அல்லாஹ்வின் மீது தகாத வார்த்தைகளை சொல்லிக் கொண்டிருக்கின்றனர்.",
            "verse 72:5": "மேலும் \"மனிதர்களும் ஜின்களும் அல்லாஹ்வின் மீது பொய் கூறவே மாட்டார்கள்\" என்று நிச்சயமாக நாம் எண்ணிக் கொண்டிருந்தோம்.",
            "verse 72:6": "\"ஆனால், நிச்சயமாக மனிதர்களிலுள்ள ஆடவர்களில் சிலர் ஜின்களிலுள்ள ஆடவர்கள் சிலரிடம் காவல் தேடிக் கொண்டிருந்தனர், இதனால் அவர்கள், (ஜின்களிலுள்ள அவ்வாடவர்களின்) மமதையை பெருக்கிவிட்டனர்.",
            "verse 72:7": "\"இன்னும், நிச்சயமாக அவர்களும் நீங்கள் எண்ணியதைப் போலவே, அல்லாஹ் ஒருவரையும் (மறுமையில் உயிர்ப்பித்து) எழுப்பமாட்டான் என்று எண்ணிக் கொண்டு இருந்தனர்.",
            "verse 72:8": "\"நிச்சயமாக நாம் வானத்தைத் தொட்டுப் பார்த்தோம். அது கடுமையான காவலாளிகளாலும், தீப்பந்தங்களாலும் நிரப்பப்பட்டிருப்பதை, நாங்கள் கண்டோம்.",
            "verse 72:9": "\"(முன்னர் வானில் பேசப்படுவதைச்) செவிமடுப்பதற்காக (அதற்குள்ள சில) இடங்களில் நாங்கள் அமர்ந்திருப்போம்; ஆனால் இப்பொழுதோ எவன் அவ்வாறு செவிமடுக்க முயல்கிறானோ, அவன் தனக்காகக் காத்திருக்கும் தீப்பந்தத்தையே கண்பான்.",
            "verse 72:10": "\"அன்றியும், பூமியிலிருப்பவர்களுக்குத் தீங்கு நாடப்பட்டிருக்கிறதா, அல்லது அவர்களுடைய இறைவன் அவர்களுக்கு நன்மையை நாடி இருக்கிறானா என்பதையும் நாங்கள் நிச்சயமாக அறிய மாட்டோம்.",
            "verse 72:11": "\"மேலும், நிச்சயமாக நம்மில் நல்லோரும் இருக்கின்றனர், அப்படியல்லாதவர்களும் நம்மில் இருக்கின்றனர், நாம் பல்வேறு வழிகளையுடையவர்களாகவும் இருந்தோம்.",
            "verse 72:12": "\"அன்றியும், நிச்சயமாக நாம் பூமியில் அல்லாஹ்வை இயலாமலாக்க முடியாது என்பதையும், அவனை விட்டு ஓடி (ஒளிந்து ) கொள்வதாலும் அவனை (எங்கேயும்) இயலாமலாக்க முடியாதென்பதையும், நாம் அறிந்து கொண்டோம்.",
            "verse 72:13": "\"இன்னும், நிச்சயமாக நாம் நேர்வழியை (குர்ஆனை) செவிமடுத்த போது, நாம் அதன் மீது ஈமான் கொண்டோம்.\" எனவே எவன் தன் இறைவன் மீது ஈமான் கொள்கிறானோ, அவன் இழப்பைப் பற்றியும், அநீதியைப் பற்றியும் பயப்படமாட்டான்.",
            "verse 72:14": "\"இன்னும், நிச்சயமாக, நம்மில் முஸ்லிம்களும் இருக்கின்றனர். நம்மில் அக்கிரமக்காரர்களும் இருக்கின்றனர் - எவர்கள் முஸ்லிம்களாகி (வழிப்பட்டார்களோ) அவர்கள் தாம் நேர்வழியைத் தேடிக் கொண்டனர்.",
            "verse 72:15": "\"அக்கிரமக்காரர்களோ நரகத்திற்கு எரி விறகாய் விட்டனர்\" (என்று அந்த ஜின் கூறிற்று).",
            "verse 72:16": "\"(மானிடர்களோ, ஜின்களோ) அவர்கள் (நேர்) வழியின் மீது, உறுதியுடன் நிலைத்து நின்றால், நிச்சயமாக நாம் அவர்களுக்கு மிக அதிகமாகத் தண்ணீர் புகட்டுவோம்.",
            "verse 72:17": "\"அதைக் கொண்டு நாம் அவர்களைச் சோதிப்பதற்காக, ஆகவே, எவன் தன் இறைவனை நினைப்பதைப் புறக்கணிக்கிறானோ, அவனைக் கொடிய வேதனையில் அவன் புகுத்தி விடுவான்.",
            "verse 72:18": "\"அன்றியும், நிச்சயமாக மஸ்ஜிதுகள் அல்லாஹ்வுக்கே இருக்கின்றன, எனவே, (அவற்றில்) அல்லாஹ்வுடன் (சேர்த்து வேறு) எவரையும் நீங்கள் பிரார்த்திக்காதீர்கள்.",
            "verse 72:19": "\"மேலும், நிச்சயமாக அல்லாஹ்வின் அடியார் அவனைப் பிரார்த்தித்தவராக நின்றபோது, அவர்பால் அவர்கள் கூட்டம் கூட்டமாக (வந்து) நெருங்கிவிடுகின்றனர்.\"",
            "verse 72:20": "(நபியே!) நீர் கூறும்; \"நான் பிரார்த்திப்பதெல்லாம் என்னுடைய இறைவனைத் தான்; அன்றியும், நான் அவனுக்கு எவரையும் இணை வைக்க மாட்டேன்.\"",
            "verse 72:21": "கூறுவீராக, \"நிச்சயமாக நான் உங்களுக்கு நன்மையோ, தீமையோ, செய்ய சக்தி பெற மாட்டேன்.\"",
            "verse 72:22": "கூறுவீராக, \"நிச்சயமாக அல்லாஹ்வை விட்டும் ஒருவரும் என்னைப் பாதுகாக்க மாட்டார்; இன்னும், அவனையன்றி ஒதுங்குந் தலத்தையும் நான் காணமுடியாது.",
            "verse 72:23": "\"அல்லாஹ்விடமிருந்து (வருவதை) எடுத்துச் சொல்வதும், அவனுடைய தூதுவத்துவத்தையும் தவிர (எனக்கு வேறில்லை) எனவே, எவர் அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் மாறு செய்கிறாரோ அவருக்கு நிச்சயமாக நரக நெருப்புத்தான். அதில் அவர் என்றென்றும் இருப்பர்\" என (நபியே!) நீர் கூறும்.",
            "verse 72:24": "அவர்களுக்கு வாக்களிக்கப்பட்டதை (வேதனையை) அவர்கள் பார்க்கும் போது, எவருடைய உதவியாளர்கள் மிக பலஹீனமானவர்கள் என்பதையும், எண்ணிக்கையில் மிகக் குறைந்தவர்கள் என்பதையும் விரைவில் அறிந்து கொள்வார்கள்.",
            "verse 72:25": "(நபியே!) நீர் கூறும், \"உங்களுக்கு வாக்களிக்கப்பட்டிருப்பது (அவ்வேதனை) சமீபமா, அல்லது என்னுடைய இறைவன் அதற்குத் தவணை ஏற்படுத்தியிருக்கிறானா என்பதை நான் அறியேன்.",
            "verse 72:26": "\"(அவன்தான்) மறைவனாவற்றை அறிந்தவன்; எனவே, தான் மறைத்திருப்பவற்றை அவன் எவருக்கும் வெளியாக்கமாட்டான்.",
            "verse 72:27": "\"தான் பொருந்திக் கொண்ட தூதருக்குத் தவிர - எனவே அவருக்கு முன்னும், அவருக்குப் பின்னும் பாதுகாவலர்க(ளான மலக்குக)ளை நிச்சயமாக நடத்தாட்டுகிறான்.",
            "verse 72:28": "\"தங்களுடைய இறைவனின் தூதுத்துவச் செய்திகளை, திட்டமாக எடுத்துச் சொல்லிவிட்டார்களா? என்று அறிவதற்காக - இன்னும் அவர்களிடமுள்ளவற்றை அவன் சூழ்ந்தறிந்து கொண்டிருப்பதுடன், அவன் சகல பொருளையும் எண்ணிக்கையால் மட்டுப்படுத்தி இருக்கிறான்.\""
        },
        "Tatar": {
            "verse 72:1": "Әйт: \"Миңа вәхий кылынды, Аллаһудан хәбәр бирелде, тәхкыйк миннән җеннәрдән бер таифә Коръәнне тыңлады, ул җеннәр кавемнәренә барып сөйләделәр: \"Тәхкыйк без ґәҗәеб Коръәнне ишеттек!",
            "verse 72:2": "Ул Коръән туры юлга күндерәдер. Без ул Коръәнгә иман китердек, әлбәттә, Раббыбызга һичкемне тиңдәш кылмабыз\".",
            "verse 72:3": "Тәхкыйк Раббыбызның олугълыгы бөек булды, Аның хатыны вә баласы һич булмады.",
            "verse 72:4": "Тәхкыйк безнең ахмакларыбыз Аллаһуга үлчәүсез сүзне әйтә иделәр, ягъни Аллаһуның баласы бар, дип.",
            "verse 72:5": "Тәхкыйк без Коръән сүзләрен ишетмәс борын уйлый идек, һичбер кеше вә җен заты Аллаһуга ялган сөйләмәс, дип.",
            "verse 72:6": "Тәхкыйк кеше затыннан булган ирләр, җен затыннан булган ирләргә сыгына иделәр, ул кешеләр шул җеннәргә ахмаклыкны арттырдылар.",
            "verse 72:7": "Тәхкыйк ул җеннәр уйладылар сез кәферләр уйлаган кеби, Аллаһ һичкемне кубармас, тергезмәс дип.",
            "verse 72:8": "Коръәнгә иман китереп мөселман булган җеннәр янә әйттеләр: \"Без күк тарафына менгән идек, күкне көчле сакчы фәрештәләр вә атылучы ялкынлы йолдызлар белән тутырылган таптык.",
            "verse 72:9": "Янә без фәрештәләр сүзен ишетер өчен күкләргә менеп урыннарга утырадыр идек, бер җен хәзер менеп тыңласа, үзе өчен шайтаннар саклап торган ялкынны табар!",
            "verse 72:10": "Без, әлбәттә, белмибез йә җирдәге кешеләргә бер зарар касд ителмәде, әллә Раббылары аларга һидәятне теләдеме?",
            "verse 72:11": "Дәхи бездән, әлбәттә, яхшылар да бар вә бездә яхшылардан башка явызлар да бар, без, әлбәттә, төрле юлда булдык.",
            "verse 72:12": "Тәхкыйк без белдек, әлбәттә, Аллаһуны гаҗиз кыла алмабыз, җирдә һәм качып та гаҗиз кыла алмабыз.",
            "verse 72:13": "Тәхкыйк без Коръәнне ишеткәч аңа иман китердек, берәү Раббысына вә Аның сүзенә ышанса, ул кеше кимсетелүдән һәм гакылсызланудан курыкмас.",
            "verse 72:14": "Тәхкыйк бездә мөселманнар бар һәм туры юлдан читкә чыгып адашканнар да бар бездә. Коръән белән гамәл кылып мөселман булган кешеләр туры юлны таптылар.",
            "verse 72:15": "Әмма Коръән белән гамәл кылмыйча кәфер булган кешеләр – алар җәһәннәмгә утын булдылар.",
            "verse 72:16": "Әгәр кеше белән җен бар да Коръән күрсәткән туры юлда булсалар, әлбәттә, аларның җиренә куп су илә сугарыр идек.",
            "verse 72:17": "Шул күп яңгырдан хасил булган байлыкта аларны сынамак өчен. Берәү Аллаһ вәгазе булган Коръәннән йөз чөерсә аның белән гамәл кылудан баш тартса, Аллаһ ул кешене кертер каты мәшәкатьле ґәзабка.",
            "verse 72:18": "Тәхкыйк мәсҗидләр Аллаһуга гыйбадәт кылу өчендер, шулай булгач, мәсҗидләрдә Аллаһудан башкага гыйбадәт кылмагыз һәм кәферләргә дога кылмагыз, вә бидеґәт гамәлләрне эшләмәгез!",
            "verse 72:19": "Тәхкыйк ул Аллаһ колы Мухәммәд г-м аулакта намазга торып, кычкырып Коръән укыганда, Коръән тыңлау өчен аның янына килеп җеннәр бер-берсенең өстенә өелә яздылар.",
            "verse 72:20": "Әйт: \"Мин фәкать Аллаһуга гына гыйбадәт кыламын, Ул – Аллаһуга һичкемне шәрик-тиңдәш кылмамын\", – дип.",
            "verse 72:21": "Әйт: \"Мин сезгә зарар китерергә кадир түгелмен һәм сезгә һидәят бирергә дә кадир түгелмен\".",
            "verse 72:22": "Әйт: \"Әлбәттә, мине Аллаһ хөкеменнән һичкем коткара алмас, әгәр Ул миңа зарар теләсә, мин, әлбәттә, тапмамын Аллаһудан башка сыгыныр вә ярдәм сорар өчен бер затны.\"",
            "verse 72:23": "Мәгәр мин сезгә Аллаһ хөкемнәрен ирештерүче һәм пәйгамбәрлек бурычын үтәүче генәмен. Берәү Аллаһуга вә Аның расүленә гасый булса аларга каршы торса, тәхкыйк ул кешегә җәһәннәм уты хәзерләнмештер алар анда мәңге калучылардыр.",
            "verse 72:24": "Хәтта алар үзләренә вәгъдә ителгән ґәзабны күрсәләр, тиз белерләр кемнең ярдәмчесе зәгыйфьрәк вә азырак икәнлеген.",
            "verse 72:25": "Әйт: \"Белмимен сезгә вәгъдә ителгән кыямәт көне якындырмы, әллә Раббым ул кыямәт көненә озын вакыт билгеләгәнме?",
            "verse 72:26": "Ул яшерен эшләрне белүчедер вә Ул үзенең яшерен эшләренә һичкемне хәбәрдар кылмас.",
            "verse 72:27": "Мәгәр рәсүлләрнең алларыннан вә артларыннан сакчы фәрештәләрен йөртер Иблис зарар бирмәсен өчен.",
            "verse 72:28": "Ул рәсүлләр Раббылары йөкләгән пәйгамбәрлек бурычларын үтәгәнлекләрен вә шәригать хөкемнәрен кешеләргә ирештергәннәрен белсен өчен алар янына фәрештәләр билгеләде, вә расүл тирәсендә булган һәр кешенең эшен Аллаһуның белеме әйләндереп алды, вә Ул – Аллаһ вөҗүдтә булган һәрнәрсәнең санын беләдер."
        },
        "Telugu": {
            "verse 72:1": "(ఓ ప్రవక్తా!) ఇలా అను: నాకు ఈ విధంగా దివ్యసందేశం పంపబడింది; నిశ్చయంగా, ఒక జిన్నాతుల సమూహం - దీనిని (ఈ ఖుర్ఆన్ ను) విని - తమ జాతి వారితో ఇలా అన్నారు: `వాస్తవానికి మేము ఒక అద్భుతమైన పఠనం (ఖుర్ఆన్) విన్నాము",
            "verse 72:2": "అది సరైన మార్గం వైపునకు మార్గదర్శకత్వం చేస్తుంది. కావున మేము దానిని విశ్వసించాము. మరియు మేము మా ప్రభువుకు ఎవ్వడిని కూడా భాగస్వామిగా సాటి కల్పించము",
            "verse 72:3": "మరియు నిశ్చయంగా, మా ప్రభువు వైభవం ఎంతో ఉన్నతమైనది. ఆయన ఎవ్వడినీ భార్యగా (సాహిబతున్ గా) గానీ, కుమారునిగా గానీ చేసుకోలేదు",
            "verse 72:4": "మరియు నిశ్చయంగా, మనలోని అవివేకులు, కొందరు అల్లాహ్ విషయంలో దారుణమైన మాటలు పలుకుతున్నారు",
            "verse 72:5": "మరియు వాస్తవానికి మనం మానవులు గానీ, జిన్నాతులు గానీ అల్లాహ్ ను గురించి అబద్ధం పలకరని భావించేవారము",
            "verse 72:6": "మరియు వాస్తవానికి, మానవులలో నుండి కొందరు పురుషులు, జిన్నాతులలో నుండి కొందరు పురుషుల శరణు వేడుతూ ఉండేవారు. ఈ విధంగా వారు, వారి (జిన్నాతుల) తలబిరుసుతనం మరింత అధికమే చేసేవారు",
            "verse 72:7": "మరియు వాస్తవానికి, వారు (మానవులు) కూడా మీరు (జిన్నాతులు) భావించినట్లు, అల్లాహ్ ఎవ్వడినీ కూడా సందేశహరునిగా పంపడని భావించారు",
            "verse 72:8": "మరియు నిశ్చయంగా, మేము ఆకాశాలలో (రహస్యాలను) తొంగి చూడటానికి ప్రయత్నించినపుడు, మేము దానిని కఠినమైన కావలివారితో మరియు అగ్ని జ్వాలలతో నిండి ఉండటాన్ని చూశాము",
            "verse 72:9": "మరియు వాస్తవానికి పూర్వం అక్కడి మాటలు వినటానికి మేము రహస్యంగా అక్కడ కూర్చునేవారం. కాని ఇప్పుడు ఎవడైనా (రహస్యంగా) వినే ప్రయత్నం చేస్తే, అతడి కొరకు అక్కడ ఒక అగ్నిజ్వాల పొంచి ఉంటుంది",
            "verse 72:10": "మరియు వాస్తవానికి భూమిలో ఉన్న వారికి ఏదైనా కీడు ఉద్దేశింపబడిందా, లేక వారి ప్రభువు వారికి సరైన మార్గం చూపగోరుతున్నాడా అనే విషయం మాకు అర్థం కావడం లేదు",
            "verse 72:11": "మరియు వాస్తవానికి, మనలో కొందరు సద్వర్తనులున్నారు, మరికొందరు దానికి విరుద్ధంగా ఉన్నారు. వాస్తవానికి మనం విభిన్న మార్గాలను అనుసరిస్తూ వచ్చాము",
            "verse 72:12": "మరియు నిశ్చయంగా, మేము అల్లాహ్ నుండి భూలోకంలో తప్పించుకోలేము, అని అర్థం చేసుకున్నాము. మరియు పారిపోయి కూడా ఆయన నుండి తప్పించుకోలేము",
            "verse 72:13": "మరియు నిశ్చయంగా, మేము ఈ మార్గదర్శకత్వాన్ని (ఖుర్ఆన్ ను) విన్నప్పుడు దానిని విశ్వసించాము. కావున ఎవడైనా తన ప్రభువును విశ్వసిస్తాడో అతడికి తన సత్కర్మల ఫలితంలో నష్టాన్ని గురించీ మరియు శిక్షలో హెచ్చింపును గురించీ భయపడే అవసరం ఉండదు",
            "verse 72:14": "మరియు నిశ్చయంగా, మనలో కొందరు అల్లాహ్ కు విధేయులైన వారు (ముస్లింలు) ఉన్నారు. మరికొందరు నిశ్చయంగా, అన్యాయపరులు (సత్యానికి దూరమైన వారు) ఉన్నారు. కావున ఎవరైతే అల్లాహ్ కు విధేయత (ఇస్లాం) ను అవలంబించారో, అలాంటి వారే సరైన మార్గాన్ని కనుగొన్న వారు",
            "verse 72:15": "మరియు అన్యాయపరులే (సత్యానికి దూరమైనవారు) నరకానికి ఇంధనమయ్యే వారు",
            "verse 72:16": "ఒకవేళ వారు (సత్యతిరస్కారులు) ఋజుమార్గం మీద స్థిరంగా ఉన్నట్లైతే, మేము వారిపై పుష్కలంగా నీటిని కురిపించే వారము",
            "verse 72:17": "దాంతో వారిని పరీక్షించటానికి! మరియు ఎవడైతే తన ప్రభువు ధాన్యం నుండి విముఖుడవుతాడో, ఆయన వానిని తీవ్రమైన శిక్షకు గురి చేస్తాడు",
            "verse 72:18": "మరియు నిశ్చయంగా, మస్జిదులు అల్లాహ్ కొరకే ప్రత్యేకించబడ్డాయి. కావున వాటిలో అల్లాహ్ తో పాటు ఇతరులెవ్వరినీ ప్రార్థించకండి",
            "verse 72:19": "మరియు నిశ్చయంగా, అల్లాహ్ యొక్క దాసుడు (ముహమ్మద్) ఆయన (అల్లాహ్)ను ప్రార్థించటానికి నిలబడి నప్పుడు, వారు (జిన్నాతులు) అతన చుట్టు దట్టంగా (అతని ఖుర్ఆన్ పఠనాన్ని వినటానికి) గుమి గూడుతారు",
            "verse 72:20": "వారితో ఇలా అను: నిశ్చయంగా నేను నా ప్రభువును మాత్రమే ప్రార్థిస్తాను మరియు ఆయనకు ఎవ్వరినీ సాటి కల్పించను",
            "verse 72:21": "వారితో ఇలా అను: నిశ్చయంగా, మీకు కీడు చేయటం గానీ, లేదా సరైన మార్గం చూపటం గానీ నా వశంలో లేదు",
            "verse 72:22": "ఇంకా ఇలా అను: నిశ్చయంగా, నన్ను అల్లాహ్ నుండి ఎవ్వడునూ కాపాడలేడు మరియు నాకు ఆయన తప్ప మరొకరి ఆశ్రయం కూడా లేదు",
            "verse 72:23": "(నా పని) కేవలం అల్లాహ్ ఉపదేశాన్ని మరియు ఆయన సందేశాన్ని అందజేయటమే!\" ఇక ఎవడైతే అల్లాహ్ మరియు ఆయన ప్రవక్త ఆజ్ఞను ఉల్లంఘిస్తాడో! అతడు నిశ్చయంగా, నరకాగ్నికి గురి అవుతాడు; అందులో శాశ్వతంగా కలకాలం ఉంటాడు",
            "verse 72:24": "చివరకు వారికి వాగ్దానం చేయబడిన దానిని వారు చూసినప్పుడు, ఎవరి సహాయకులు బలహీనులో, మరెవరి వర్గం సంఖ్యాపరంగా తక్కువో వారికి తెలిసి పోతుంది",
            "verse 72:25": "ఇలా అను: మీకు వాగ్దానం చేయబడినది (శిక్ష) సమీపంలోనే రానున్నదో, లేక దాని కొరకు నా ప్రభువు దీర్ఘకాల వ్యవధి నియమించాడో నాకు తెలియదు",
            "verse 72:26": "ఆయనే అగోచర జ్ఞానం గలవాడు, కావున ఆయన అగోచర విషయాలు ఎవ్వడికీ తెలియజేయడు",
            "verse 72:27": "తాను కోరి ఎన్నుకొన్న ప్రవక్తకు తప్ప - ఎందుకంటే, ఆయన నిశ్చయంగా, అతని (ఆ ప్రవక్త) ముందు మరియు వెనుక రక్షకభటులను నియమిస్తాడు",
            "verse 72:28": "వారు, (ప్రవక్తలు) తమ ప్రభువు యొక్క సందేశాలను యథాతథంగా అందజేస్తున్నారని పరిశీలించడానికి. మరియు ఆయన వారి అన్ని విషయాలను పరివేష్టించి ఉన్నాడు మరియు ఆయన ప్రతి ఒక్క విషయాన్ని లెక్క పెట్టి ఉంచుతాడు"
        },
        "Thai": {
            "verse 72:1": "จงกล่าวเถิดมุฮัมมัดว่า ได้มีวะฮียฺมายังฉันว่า แท้จริงพวกญินจำนวนหนึ่งได้ฟังฉัน (อ่านกุรอาน) และพวกเขากล่าวว่า แท้จริงเราได้ยินกุรอานที่แปลกประหลาด",
            "verse 72:2": "นำไปสู่ทางที่ถูกต้อง ดังนั้นพวกเราจึงศรัทธาต่ออัลกุรอานนั้น และเราจะไม่ตั้งสิ่งใดเป็นภาคีต่อพระเจ้าของเรา",
            "verse 72:3": "และความจริงนั้น ความยิ่งใหญ่แห่งพระเจ้าของเรานั้นทรงสูงส่งยิ่ง พระองค์ไม่มีภริยาและไม่มีบุตร",
            "verse 72:4": "และแท้จริง คนโง่ในหมู่พวกเราได้กล่าวร้ายต่ออัลลอฮฺอย่างเกินเหตุ",
            "verse 72:5": "และแท้จริงเราคาดคิดว่า มนุษย์และญินจะไม่กล่าวเท็จต่ออัลลอฮฺเป็นอันขาด",
            "verse 72:6": "และแท้จริงมนุษย์บางคนเคยขอความคุ้มครองจากญินบางคน ดังนั้นพวกเขา (มนุษย์) จึงทำให้พวกเขา (ญิน)เพิ่มการหยิ่งจองหองยิ่งขึ้น",
            "verse 72:7": "และแท้จริงพวกเขา (มนุษย์) คาดคิดเช่นเดียวกับที่พวกท่าน (ญิน) คาดคิดว่าอัลลอฮฺ จะไม่ทรงแต่งตั้งผู้ใดขึ้น (เป็นร่อซูล)",
            "verse 72:8": "และแท้จริงเราได้ค้นคว้าหาข่าว ณ ชั้นฟ้า แต่เราได้พบ ณ ที่นั่งเต็มไปด้วยยามเฝ้าผู้เข้มแข็งและเปลวเพลิง",
            "verse 72:9": "และแท้จริงเราเคยนั่ง ณ สถานที่นั่งในท้องฟ้านั้นเพื่อฟัง แต่ขณะนี้ผู้ใดนั่งฟังเขาก็จะพบเปลวเพลิงถูกเตรียมไว้สำหรับเขา",
            "verse 72:10": "และแท้จริงเราไม่รู้ดอกว่า ความชั่วร้ายนั้นจะถูกให้มีขึ้นแก่ผู้ที่อยู่ในแผ่นดินนี้ หรือว่าพระเจ้าของพวกเขาปรารถนาแนวทางที่ถูกต้องแก่พวกเขา",
            "verse 72:11": "และแท้จริงในหมู่พวกเรานั้นมีคนดีและในหมู่พวกเราก็มีคนอื่นจากนั้น พวกเราอยู่ในแนวทางที่แตกต่างกัน",
            "verse 72:12": "และแท้จริงเราคาดคิดว่า เราจะไม่รอดพ้นจาก (การลงโทษ) ของอัลลอฮฺในแผ่นดินนี้ และเราจะหนีไม่รอดพ้นไปจากพระองค์",
            "verse 72:13": "และแท้จริงเมื่อเราได้ยินอัลกุรอานเราก็ศรัทธาต่ออัลกุรอานนั้น ดังนั้นผู้ใดศรัทธาต่อพระเจ้าของเขา เขาก็จะไม่หวั่นเกรงต่อการขาดทุน และการอยุติธรรม",
            "verse 72:14": "และแท้จริงในหมู่พวกเรามีผู้ที่เป็นมุสลิม และในหมู่พวกเรามีผู้อธรรม ดังนั้นผู้ใดนอบน้อม ชนเหล่านั้นพวกเขาได้มุ่งสู่แนวทางที่ถูกต้อง",
            "verse 72:15": "และส่วนบรรดาผู้ที่หันห่างออกจากความจริง พวกเขาก็เป็นฟืนของไฟนรก",
            "verse 72:16": "และหากพวกเขาธำรงมั่นอยู่บนแนวทางที่เที่ยงธรรม แน่นอนเราก็จะให้พวกเขามีริซกีกว้างขวาง",
            "verse 72:17": "เพื่อเราจะทดสอบพวกเขาในเรื่องนี้ และผู้ใดหันห่างจากการรำลึกถึงพระเจ้าของเขา พระองค์จะให้เขาได้รับการลงโทษอันแสนสาหัส",
            "verse 72:18": "และว่าแท้จริงบรรดามัสยิดนั้นเป็นของอัลลอฮฺ ดังนั้น พวกเจ้าอย่าวิงวอนขอผู้ใดเคียงคู่กับอัลลอฮฺ",
            "verse 72:19": "และว่าแท้จริงเมื่อบ่าวของอัลลอฮฺ (มุฮัมมัด) ยืนขึ้นกล่าววิงวอนขอต่อพระองค์พวกเขา (ญิน) ก็ได้ห้อมล้อมเขาอย่างหนาแน่น",
            "verse 72:20": "จงกล่าวเถิดมุฮัมมัด ว่า แท้จริงฉันวิงวอนขอต่อพระเจ้าของฉัน และฉันจะมิตั้งผู้ใดเป็นภาคีต่อพระองค์",
            "verse 72:21": "จงกล่าวเถิดมุฮัมมัดว่า แท้จริงฉันไม่มีอำนาจที่จะให้โทษและให้คุณแก่พวกท่าน",
            "verse 72:22": "จงกล่าวเถิดมุฮัมมัดว่า ไม่มีผู้ใดจะคุ้มครองฉันให้พ้นจาก (การลงโทษของ) อัลลอฮฺได้ และฉันจะไม่พบที่พึ่งอันใดอื่นจากพระองค์เลย",
            "verse 72:23": "เว้นแต่ฉันจะเผยแผ่ (สิ่งที่รับ) จากอัลลอฮฺ และสาส์นของพระองค์ และผู้ใดฝ่าฝืนอัลลอฮฺ และร่อซูลของพระองค์แท้จริงสำหรับ เขานั้นคือไฟนรก เป็นผู้พำนักอยู่ในนั้นตลอดกาล",
            "verse 72:24": "จนกระทั่งเมื่อพวกเขาได้เห็นสิ่งที่พวกเขาถูกสัญญาไว้ แล้วพวกเขาก็จะได้รู้ว่าใครเป็นผู้อ่อนแอยิ่งในการเป็นผู้ช่วยเหลือและมีจำนวนน้อยกว่า",
            "verse 72:25": "จงกล่าวเถิดมุฮัมมัด ฉันไม่รู้สิ่งที่พวกท่านถูกสัญญาไว้นั้น หรือว่าพระเจ้าของฉันจะทรงกำหนดเวลาการลงโทษนั้นให้ห่างไกลออกไป",
            "verse 72:26": "พระผู้ทรงรอบรู้สิ่งเร้นลับ ดังนั้นพระองค์จะไม่ทรงเปิดเผยสิ่งเร้นลับของพระองค์แก่ผู้ใด",
            "verse 72:27": "นอกจากผู้ที่พระองค์ทรงยินดีเช่นร่อซูล ดังนั้นพระองค์จะทรงส่งผู้พิทักษ์เฝ้าดูแลข้างหน้าและข้างหลังเขา",
            "verse 72:28": "เพื่อพระองค์จะทรงรู้ว่า แน่นอนพวกเขาได้เผยแผ่สาส์นของพระเจ้าของพวกเขาแล้ว และพระองค์ได้ทรงห้อมล้อม (รอบรู้) ทุกสิ่งที่อยู่ ณ ที่พวกเขา และพระองค์ทรงนับจำนวนทุก ๆ สิ่งไว้อย่างครบถ้วน"
        },
        "Turkish": {
            "verse 72:1": "De ki: \"Cinlerden bir topluluğun Kuran'ı dinlediği bana vahyolundu; onlar şöyle demişlerdir;\" \"Doğrusu biz, doğru yola götüren, hayrete düşüren bir Kuran dinledik de ona inandık; biz, Rabbimize hiçbir şeyi ortak koşmayacağız.\"",
            "verse 72:2": "De ki: \"Cinlerden bir topluluğun Kuran'ı dinlediği bana vahyolundu; onlar şöyle demişlerdir;\" \"Doğrusu biz, doğru yola götüren, hayrete düşüren bir Kuran dinledik de ona inandık; biz, Rabbimize hiçbir şeyi ortak koşmayacağız.\"",
            "verse 72:3": "\"Doğrusu Rabbimizin yüceliği her yücelikten üstündür. O, zevce ve çocuk edinmemiştir.\"",
            "verse 72:4": "\"Doğrusu aramızdaki beyinsiz, Allah'a karşı yalanlar uyduruyordu.\"",
            "verse 72:5": "\"Doğrusu insanların ve cinlerin Allah'a karşı yalan uydurabileceklerini sanmazdık.\"",
            "verse 72:6": "\"Gerçekten, bir takım insanlar, cinlerin bir takımına sığınırlardı da onların azgınlıklarını artırırlardı.\"",
            "verse 72:7": "\"Doğrusu, onlar da sizin, Allah'ın kimseyi yeniden diriltmeyeceğinizi sandığınız gibi sanıda bulunmuşlardı.\"",
            "verse 72:8": "\"Doğrusu biz göğü yokladık; onu sert bekçiler ve kayan ateşlerle (ışınlarla) doldurulmuş bulduk.\"",
            "verse 72:9": "\"Doğrusu biz, göğün dinleyebileceğimiz bir yerinde otururduk; ama şimdi kim dinleyecek olsa, kendisini gözleyen bir ateş (ışın) buluyor.\"",
            "verse 72:10": "\"Yeryüzünde olanlara kötülük mü murad edildi, yahut Rableri onlara bir iyilik mi dilemiştir, doğrusu biz bilemeyiz.\"",
            "verse 72:11": "\"Doğrusu aramızda iyiler de vardır, bundan aşağı bulunanlar da vardır. Biz, türlü türlü yolda olan topluluklardık.\"",
            "verse 72:12": "\"Yeryüzünde kalsak da Allah'ı aciz bırakamayacağımız, başka yere kaçsak da, O'nu aciz kılamayacağımız gerçeğini şüphesiz anladık.\"",
            "verse 72:13": "\"Şüphesiz, doğruluk rehberi olan Kuran'ı dinlediğimizde ona inandık; kim Rabbine inanırsa, o, ecrinin eksiltileceğinden ve kendisine haksızlık edileceğinden korkmaz.\"",
            "verse 72:14": "\"İçimizde, kendini Allah'a vermiş olanlar da, yazık edenler de vardır. Kendini Allah'a veren kimseler, işte onlar, doğru yolu arayanlar, ona layık olanlardır.\"",
            "verse 72:15": "\"Kendilerine yazık edenlere gelince; onlar, cehennemin odunları oldular.\"",
            "verse 72:16": "Ama doğru yola girmiş olsalardı, onları bu hususta denememiz için onlara bol su içirirdik; kim Rabbini anmaktan yüz çevirirse, Rabbi onu gittikçe artan bir azaba uğratır.",
            "verse 72:17": "Ama doğru yola girmiş olsalardı, onları bu hususta denememiz için onlara bol su içirirdik; kim Rabbini anmaktan yüz çevirirse, Rabbi onu gittikçe artan bir azaba uğratır.",
            "verse 72:18": "Mescidler şüphesiz Allah'ındır, öyleyse oralarda Allah'a yalvarırken başkasını katmayın.",
            "verse 72:19": "Allah'ın kulu Muhammed, O'na yalvarmak, namaz kılmak için kalkınca, nerdeyse, çevresinde keçeleşirler, birbirlerine girerlerdi.",
            "verse 72:20": "De ki: \"Ben sadece Rabbime yalvarırım ve O'na kimseyi ortak koşmam.\"",
            "verse 72:21": "De ki: \"Ben size zarar vermeye de iyilik yapmaya da kadir değilim.\"",
            "verse 72:22": "De ki: \"Beni kimse Allah'a karşı savunamaz ve ben O'ndan başka bir sığınak bulamam.\"",
            "verse 72:23": "\"Benim yaptığım yalnız, Allah katından olanı, O'nun gönderdiklerini tebliğdir. Allah'a ve Peygamberine kim karşı gelirse ona, içinde sonsuz ve temelli kalınacak cehennem ateşi vardır.\"",
            "verse 72:24": "Sonunda, kendilerine söz verileni gördükleri zaman, kimin yardımcısının daha güçsüz ve sayısının daha az olduğunu bileceklerdir.",
            "verse 72:25": "De ki: Size söz verilen yakın mıdır, yoksa Rabbim onu uzun süreli mi kılmıştır ben bilmem.\"",
            "verse 72:26": "Görülmeyeni bilen Allah, görülmeyene kimseyi muttali kılmaz.",
            "verse 72:27": "Ancak peygamberlerden, bildirmek istediği bunun dışındadır. Rablerinin bildirilerini tebliğ etmelerini ortaya koymak için her peygamberin önünden ve ardından gözcüler salar; onların yaptıklarını ilmiyle kuşatır ve herşeyi bir bir sayar.",
            "verse 72:28": "Ancak peygamberlerden, bildirmek istediği bunun dışındadır. Rablerinin bildirilerini tebliğ etmelerini ortaya koymak için her peygamberin önünden ve ardından gözcüler salar; onların yaptıklarını ilmiyle kuşatır ve herşeyi bir bir sayar."
        },
        "Urdu": {
            "verse 72:1": "(اے پیغمبر لوگوں سے) کہہ دو کہ میرے پاس وحی آئی ہے کہ جنوں کی ایک جماعت نے (اس کتاب کو) سنا تو کہنے لگے کہ ہم نے ایک عجیب قرآن سنا",
            "verse 72:2": "جو بھلائی کا رستہ بتاتا ہے سو ہم اس پر ایمان لے آئے۔ اور ہم اپنے پروردگار کے ساتھ کسی کو شریک نہیں بنائیں گے",
            "verse 72:3": "اور یہ کہ ہمارے پروردگار کی عظمت (شان) بہت بڑی ہے اور وہ نہ بیوی رکھتا ہے نہ اولاد",
            "verse 72:4": "اور یہ کہ ہم میں سے بعض بےوقوف خدا کے بارے میں جھوٹ افتراء کرتا ہے",
            "verse 72:5": "اور ہمارا (یہ) خیال تھا کہ انسان اور جن خدا کی نسبت جھوٹ نہیں بولتے",
            "verse 72:6": "اور یہ کہ بعض بنی آدم بعض جنات کی پناہ پکڑا کرتے تھے (اس سے) ان کی سرکشی اور بڑھ گئی تھی",
            "verse 72:7": "اور یہ کہ ان کا بھی یہی اعتقاد تھا جس طرح تمہارا تھا کہ خدا کسی کو نہیں جلائے گا",
            "verse 72:8": "اور یہ کہ ہم نے آسمان کو ٹٹولا تو اس کو مضبوط چوکیداروں اور انگاروں سے سے بھرا پایا",
            "verse 72:9": "اور یہ کہ پہلے ہم وہاں بہت سے مقامات میں (خبریں) سننے کے لئے بیٹھا کرتے تھے۔ اب کوئی سننا چاہے تو اپنے لئے انگارا تیار پائے",
            "verse 72:10": "اور یہ کہ ہمیں معلوم نہیں کہ اس سے اہل زمین کے حق میں برائی مقصود ہے یا ان کے پروردگار نے ان کی بھلائی کا ارادہ فرمایا ہے",
            "verse 72:11": "اور یہ کہ ہم میں کوئی نیک ہیں اور کوئی اور طرح کے۔ ہمارے کئی طرح کے مذہب ہیں",
            "verse 72:12": "اور یہ کہ ہم نے یقین کرلیا ہے کہ ہم زمین میں (خواہ کہیں ہوں) خدا کو ہرا نہیں سکتے اور نہ بھاگ کر اس کو تھکا سکتے ہیں",
            "verse 72:13": "اور جب ہم نے ہدایت (کی کتاب) سنی اس پر ایمان لے آئے۔ تو جو شخص اپنے پروردگار پر ایمان لاتا ہے اس کو نہ نقصان کا خوف ہے نہ ظلم کا",
            "verse 72:14": "اور یہ کہ ہم میں بعض فرمانبردار ہیں اور بعض (نافرمان) گنہگار ہیں۔ تو جو فرمانبردار ہوئے وہ سیدھے رستے پر چلے",
            "verse 72:15": "اور جو گنہگار ہوئے وہ دوزخ کا ایندھن بنے",
            "verse 72:16": "اور (اے پیغمبر) یہ (بھی ان سے کہہ دو) کہ اگر یہ لوگ سیدھے رستے پر رہتے تو ہم ان کے پینے کو بہت سا پانی دیتے",
            "verse 72:17": "تاکہ اس سے ان کی آزمائش کریں۔ اور جو شخص اپنے پروردگار کی یاد سے منہ پھیرے گا وہ اس کو سخت عذاب میں داخل کرے گا",
            "verse 72:18": "اور یہ کہ مسجدیں (خاص) خدا کی ہیں تو خدا کے ساتھ کسی اور کی عبادت نہ کرو",
            "verse 72:19": "اور جب خدا کے بندے (محمدﷺ) اس کی عبادت کو کھڑے ہوئے تو کافر ان کے گرد ہجوم کرلینے کو تھے",
            "verse 72:20": "کہہ دو کہ میں تو اپنے پروردگار ہی کی عبادت کرتا ہوں اور کسی کو اس کا شریک نہیں بناتا",
            "verse 72:21": "(یہ بھی) کہہ دو کہ میں تمہارے حق میں نقصان اور نفع کا کچھ اختیار نہیں رکھتا",
            "verse 72:22": "(یہ بھی) کہہ دو کہ خدا (کے عذاب) سے مجھے کوئی پناہ نہیں دے سکتا۔ اور میں اس کے سوا کہیں جائے پناہ نہیں دیکھتا",
            "verse 72:23": "ہاں خدا کی طرف سے احکام کا اور اس کے پیغاموں کا پہنچا دینا (ہی) میرے ذمے ہے۔ اور جو شخص خدا اور اس کے پیغمبر کی نافرمانی کرے گا تو ایسوں کے لئے جہنم کی آگ ہے ہمیشہ ہمیشہ اس میں رہیں گے",
            "verse 72:24": "یہاں تک کہ جب یہ لوگ وہ (دن) دیکھ لیں گے جس کا ان سے وعدہ کیا جاتا ہے تب ان کو معلوم ہو جائے گا کہ مددگار کس کے کمزور اور شمار کن کا تھوڑا ہے",
            "verse 72:25": "کہہ دو کہ جس (دن) کا تم سے وعدہ کیا جاتا ہے میں نہیں جانتا کہ وہ (عن) قریب (آنے والا ہے) یا میرے پروردگار نے اس کی مدت دراز کر دی ہے",
            "verse 72:26": "غیب (کی بات) جاننے والا ہے اور کسی پر اپنے غیب کو ظاہر نہیں کرتا",
            "verse 72:27": "ہاں جس پیغمبر کو پسند فرمائے تو اس (کو غیب کی باتیں بتا دیتا اور اس) کے آگے اور پیچھے نگہبان مقرر کر دیتا ہے",
            "verse 72:28": "تاکہ معلوم فرمائے کہ انہوں نے اپنے پروردگار کے پیغام پہنچا دیئے ہیں اور (یوں تو) اس نے ان کی سب چیزوں کو ہر طرف سے قابو کر رکھا ہے اور ایک ایک چیز گن رکھی ہے"
        },
        "Uyghur": {
            "verse 72:1": "(ئى مۇھەممەد! قەۋمىڭگە) ئېيتقىنكى، «بىر قانچە نەپەر جىننىڭ (قۇرئان) تىڭشاپ (ئىمان ئېيتقانلىقى) ماڭا ۋەھيى قىلىندى، ئۇلار (قەۋمىگە قايتىپ بارغاندىن كېيىن) ئېيتتى: بىز توغرا يولغا باشلايدىغان ئاجايىپ قۇرئاننى ھەقىقەتەن ئاڭلىدۇق",
            "verse 72:2": "ئۇنىڭغا ئىمان ئېيتتۇق، پەرۋەردىگارىمىزغا ھېچكىمنى شېرىك كەلتۈرمەيمىز",
            "verse 72:3": "پەرۋەردىگارىمىزنىڭ ئەزىمىتى كاتتىدۇر، خوتۇنى ۋە بالىسى يوقتۇر",
            "verse 72:4": "بىزنىڭ ئارىمىزدىكى ئەخمەق (يەنى ئىبلىس) اﷲ قا ۋە ئۇنىڭ كاتتىلىقىغا نالايىق سۆزلەرنى قىلدى",
            "verse 72:5": "بىز، ئىنسانلار ۋە جىنلار اﷲ قا يالغاننى چاپلىمايدۇ، دەپ ئويلىغان ئىدۇق",
            "verse 72:6": "ئىنسانلاردىن بەزى كىشىلەر جىنلاردىن بولغان بەزى كىشىلەرگە سېغىناتتى، شۇنىڭ بىلەن جىنلار تېخىمۇ تەكەببۇرلىشىپ كەتتى",
            "verse 72:7": "ئۇلار (يەنى ئىنساننىڭ كۇففارلىرى)، سىلەرگە ئوخشاش، اﷲ ھېچ ئادەمنى (ئۆلگەندىن كېيىن) تىرىلدۈرمەيدۇ، دەپ گۇمان قىلدى»",
            "verse 72:8": "(جىنلار ئېيتتى) «بىز (ئاسمان ئەھلىنىڭ سۆزلىرىنى تىڭشاش ئۈچۈن) ئاسمانغا (چىقىشنى) تىلىدۇق، ئاسماننىڭ كۈچلۈك مۇھاپىزەتچىلەر (يەنى پەرىشتىلەر) بىلەن ۋە (كۆيدۈرگۈچى) يۇلتۇزلار بىلەن تولۇپ كەتكەنلىكىنى بايقىدۇق",
            "verse 72:9": "بىز ھەمىشە (ئوغرىلىقچە تىڭشاش ئۈچۈن) ئاسماننىڭ ئولتۇرۇشقا بولىدىغان جايلىرىدا ئولتۇراتتۇق، كىمكى ئەمدى (ئوغرىلىقچە) ئاڭلاشقا ئورۇنىدىكەن، ئۇنى كۆزىتىپ تۇرغان كۆيدۈرگۈچى يۇلتۇزلارنى بايقايدۇ",
            "verse 72:10": "بىز (جىنلار جامائەسى) زېمىندىكىلەرگە يامانلىق ئىرادە قىلىندىمۇ ياكى پەرۋەردىگارى ئۇلارغا ياخشىلىق ئىرادە قىلدىمۇ؟ بىلمەيمىز",
            "verse 72:11": "بىزنىڭ ئىچىمىزدە ياخشىلارمۇ ۋە ئۇنىڭدىن تۆۋەن تۇرىدىغانلارمۇ بار، بىز تۈرلۈك يوللارغا بۆلۈندۇق",
            "verse 72:12": "بىز جەزمەن ئىشەندۇقكى، اﷲ نى (ئۆز ئىرادىسىنى ئىشقا ئاشۇرۇشتىن) ھەرگىز ئاجىز قىلالمايمىز، ئۇنىڭ (ئازابى) دىنمۇ قېچىپ قۇتۇلالمايمىز",
            "verse 72:13": "بىز ھىدايەتنى (يەنى قۇرئاننى) ئاڭلىغان چېغىمىزدا ئۇنىڭغا ئىمان كەلتۈردۇق، كىمكى پەرۋەردىگارىغا ئىمان ئېيتىدىكەن، (ياخشىلىقلىرىنىڭ) كېمىيىپ كېتىشىدىن ۋە (يامانلىقلىرىنىڭ ئارتتۇرۇلۇپ) زۇلۇم قىلىنىشتىن قورقمايدۇ",
            "verse 72:14": "بىزدىن مۇسۇلمانلار ۋە ھەق يولدىن چىققۇچىلارمۇ بار، مۇسۇلمان بولغانلار توغرا يولنى ئىزدىگەن بولىدۇ",
            "verse 72:15": "توغرا يولدىن چىققۇچىلار جەھەننەمگە ئوتۇن بولىدۇ»",
            "verse 72:16": "ئەگەر ئۇلار (يەنى مەككە كۇففارلىرى) توغرا يولدا بولسا ئىدى، ئۇلارنى سىناش ئۈچۈن مول يامغۇر ياغدۇرۇپ بېرەتتۇق (يەنى رىزقىنى كەڭ قىلىپ بېرەتتۇق)، كىمكى پەرۋەردىگارىنىڭ زىكرىدىن (يەنى اﷲ نىڭ تائەت - ئىبادىتىدىن) يۈز ئۆرۈيدىكەن، اﷲ ئۇنى قاتتىق ئازابقا دۇچار قىلىدۇ",
            "verse 72:17": "ئەگەر ئۇلار (يەنى مەككە كۇففارلىرى) توغرا يولدا بولسا ئىدى، ئۇلارنى سىناش ئۈچۈن مول يامغۇر ياغدۇرۇپ بېرەتتۇق (يەنى رىزقىنى كەڭ قىلىپ بېرەتتۇق)، كىمكى پەرۋەردىگارىنىڭ زىكرىدىن (يەنى اﷲ نىڭ تائەت - ئىبادىتىدىن) يۈز ئۆرۈيدىكەن، اﷲ ئۇنى قاتتىق ئازابقا دۇچار قىلىدۇ",
            "verse 72:18": "مەسجىدلەر اﷲ قا خاستۇر، اﷲ قا قوشۇپ ھېچكىمگە ئىبادەت قىلماڭلار",
            "verse 72:19": "اﷲ نىڭ بەندىسى (يەنى مۇھەممەد ئەلەيھىسسالام) اﷲ قا ئىبادەت قىلىشقا تۇرغاندا، (قۇرئان تىڭشاش ئۈچۈن) جىنلار (ئولىشىپ) ئۇنى بېسىۋىلىشقا تاس قالىدۇ",
            "verse 72:20": "(ئى مۇھەممەد! دىنىڭدىن يېنىپ كېتىشىڭنى تەلەپ قىلغان بۇ كۇففارلارغا) ئېيتقىنكى، «پەرۋەردىگارىمغا ئىبادەت قىلىمەن، ئۇنىڭغا ھېچ ئەھەدىنى شېرىك كەلتۈرمەيمەن»",
            "verse 72:21": "ئېيتقىنكى، «مەن سىلەرگە پايدا - زىيان يەتكۈزۈشكە قادىر بولالمايمەن (بۇنىڭغا پەقەت اﷲ قادىر بولالايدۇ)»",
            "verse 72:22": "ئېيتقىنكى، «(ئەگەر مەن اﷲ قا ئاسىي بولسام) مېنى اﷲ نىڭ ئازابىدىن ھېچ كىشى قۇتقۇزالمايدۇ، اﷲ تىن باشقا ھېچ پاناھگاھمۇ تاپالمايمەن (شۇنداق تۇرۇقلۇق، مەن سىلەرنىڭ تەلىپىڭلارنى قانداق قوبۇل قىلالايمەن)",
            "verse 72:23": "مەن پەقەت (سىلەرگە) اﷲ نىڭ ئەلچىلىكىنى يەتكۈزۈشكە قادىرمەن، كىمكى اﷲ قا ۋە ئۇنىڭ پەيغەمبىرىگە ئاسىيلىق قىلىدىكەن (يەنى كىمكى اﷲ نى ۋە اﷲ نىڭ پەيغەمبىرىنى ئىنكار قىلىدىكەن، اﷲ قا مۇلاقات بولۇشقا ئىشەنمەيدىكەن، اﷲ نىڭ ئايەتلىرىگە قۇلاق سېلىشتىن يۈز ئۆرۈيدىكەن)، ئۇ دوزاخ ئازابىغا دۇچار بولىدۇ، دوزاختا مەڭگۈ قالىدۇ",
            "verse 72:24": "ئۇلار (يەنى مۇشرىكلار) ئاگاھلاندۇرۇلغان ئازابنى كۆرگەن چاغدا كىمنىڭ ياردەمچىسى ئاجىز ۋە سانى ئاز ئىكەنلىكىنى بىلىدۇ»",
            "verse 72:25": "(ئى مۇھەممەد! ئۇلارغا) ئېيتقىنكى، «سىلەرگە ئاگاھلاندۇرۇلغان ئازاب يېقىنمۇ؟ ياكى پەرۋەردىگارىم ئۇنىڭغا (ئۇزاق) ۋاقىت تەيىن قىلامدۇ؟ ئۇقمايمەن",
            "verse 72:26": "اﷲ غەيبنى بىلگۈچىدۇر، ئۆزىنىڭ غەيبىدىن ھېچبىر ئادەمنى خەۋەردار قىلمايدۇ",
            "verse 72:27": "پەقەت اﷲ ئۆزى مەمنۇن بولغان پەيغەمبىرىگىلا (بەزى غەيبنى بىلدۈرىدۇ)، ئۇنىڭ ئالدىغا ۋە ئارقىسىغا كۆزەتچى (پەرىشتە) سېلىپ قويىدۇ",
            "verse 72:28": "(بۇ اﷲ نىڭ) ئۇنىڭ (يەنى پەيغەمبەرنىڭ) اﷲ نىڭ ئەلچىلىكىنى يەتكۈزگەنلىكىنى بىلىپ تۇرۇشى ئۈچۈندۇر، اﷲ ئۇلارنىڭ سۆز - ھەرىكەتلىرىنى تولۇق بىلگۈچىدۇر، ھەر شەيئىنىڭ سانىنى تولۇق ئىگەللىگۈچىدۇر»"
        },
        "Uzbek": {
            "verse 72:1": "Сен айт: «Менга ваҳий қилиндики, Албатта жинлардан (бир неча) нафари қулоқ осдилар ва дедилар: «Биз ажойиб Қуръонни эшитдик.",
            "verse 72:2": "У тўғри йўлга ҳидоят қилур. Бас, биз унга иймон келтирдик ва ўз Роббимизга бировни ширк келтирмасмиз.",
            "verse 72:3": "Ва, албатта, Роббимизнинг азамати юксак бўлди. У ўзига хотин ва фарзанд тутгани йўқ!",
            "verse 72:4": "Ва албатта эси пастимиз Аллоҳга ноҳақ гапларни айтарди.",
            "verse 72:5": "Ва, албатта, биз, инс ҳам, жин ҳам Аллоҳга (нисбатан) ёлғон гапирмас, деб ўйлардик.",
            "verse 72:6": "Албатта, инсдан баъзи кишилар, жинларнинг баъзи кишиларидан паноҳ сўрардилар. Бас, бу(жин)лар у(инс)ларнинг гуноҳ ва хорлигини зиёда қилдилар.",
            "verse 72:7": "Ва албатта у(инс)лар худди сизлар гумон қилганингиздек, Аллоҳ бирор кишини ўлгандан сўнг тирилтирмас, деб гумон қилардилар.",
            "verse 72:8": "Ва албатта биз осмонга (етишни) талаб қилдик. Бас, уни кучли қўриқчиларга ва учқунларга тўлган ҳолда кўрдик.",
            "verse 72:9": "Ва, алабатта, биз у(осмон)да тинглашга қулай жойларга жойлашиб олар эдик. Энди эса, ким қулоқ солса, ўзини пойлаб турган учқунга дучор бўладир.",
            "verse 72:10": "Ва, албатта, биз ер юзидагиларга ёмонлик ирода қилиндими ёки Роббилари уларга рушдни ирода қилдими-билмасмиз.",
            "verse 72:11": "Ва, албатта, биздан солиҳлар ҳам ва бошқалар ҳам бор. Турли гуруҳлар бўлган эдик.",
            "verse 72:12": "Ва, албатта, биз Аллоҳни ер юзида ожиз қолдира олмаслигимизга ва ундан қочиб қутила олмаслигимизга ишондик.",
            "verse 72:13": "Ва, албатта, биз ҳидоятни эшитган пайтимизда унга иймон келтирдик. Кимки ўз Роббисига иймон келтирса, савоби озайиб қолишдан ҳам, унга оғир юк юкланишидан ҳам қўрқмас.",
            "verse 72:14": "Ва, албатта, биздан мусулмонлар ва биздан адашганлар бор. Кимлар Исломга кирса, бас, улар ҳақ йўлни танлабдилар.",
            "verse 72:15": "Ва, аммо, адашганлар, бас, жаҳаннамга ўтин бўлибдилар.",
            "verse 72:16": "Ва агар улар тўғри йўлда мустақим бўлсалар, албатта, Биз кўп сув ила суғорамиз.",
            "verse 72:17": "У ила уларни синаш учун. Ва кимки ўз Роббиси зикридан юз ўригса, уни У зот қийин азобга соладир.",
            "verse 72:18": "Ва, алабатта, масжидлар Аллоҳникидир. Бас, Аллоҳдан бошқага дуо қилманг.",
            "verse 72:19": "Ва, албатта, Аллоҳнинг бандаси Унга ибодат қилиб турганда улар унинг атрофида от ёлидек тўпланиб, босиб юборай дейишди.",
            "verse 72:20": "Сен: «Албатта, мен фақат ўз Роббимга ибодат қиламан ва Унга ҳеч кимни ширк келтирмасман», деб айт.",
            "verse 72:21": "Сен: «Албатта, мен сизлар учун зарарга ҳам, манфаатга ҳам молик эмасман»-деб айт.",
            "verse 72:22": "Сен: «Албатта, мени ҳеч ким Аллоҳ(азоби)дан сақлаб қола олмас ва ҳаргиз Аллоҳдан ўзга пушти паноҳ топа олмасман.",
            "verse 72:23": "Менинг вазифам, фақат, Аллоҳнинг топшириқларини етказишдир. Кимки Аллоҳга ва Унинг Пайғамбарига бўйсунмаса, унга жаҳаннам оташи бор, унда абадий қолажаклар.",
            "verse 72:24": "Токи уларга ваъда қилинган нарсани кўрганларида, кимнинг ёрдамчиси заифу, кимнинг сони озлигини ҳам биларлар», деб айт.",
            "verse 72:25": "Сен: «Сизларга ваъда қилинган нарса яқинми ёки Роббим унга узоқ муддат қилганми–билмайман.",
            "verse 72:26": "У ғайбни билувчидир ва ҳеч кимни Ўз ғойбидан хабардор қилмайди.",
            "verse 72:27": "Магар Ўзи рози бўлган Пайғамбарлар. Албатта Аллоҳ унинг олдидан ҳам, ортидан ҳам кузатиб юрувчи қўйиб қўядир.",
            "verse 72:28": "Пайғамбарлар ўз Роббилари рисолаларини дарҳақиқат етказганликларини билиш учун ва Аллоҳ бандалар ҳузуридаги барча нарсани ихота қилиб олганлигини ва ҳамма нарсани адади, ҳисобини қилганлигини билиш учун», деб айт."
        },
        "Vietnamese": {
            "verse 72:1": "Ngươi (Thiên Sứ Muhammad) hãy nói (với cộng đồng tín đồ của Ngươi): “Quả thật, Ta được mặc khải cho biết rằng có một nhóm Jinn đã lắng nghe (Ta xướng đọc Qur’an). (Khi trở về với người dân của mình), chúng nói: Chúng tôi đã nghe được một cuộc xướng đọc thật tuyệt vời!”",
            "verse 72:2": "“Nó hướng dẫn đến Chân Lý. Vì vậy, chúng tôi đã tin nơi Nó. Và chúng tôi sẽ không bao giờ tổ hợp với Thượng Đế của chúng tôi bất cứ ai.”",
            "verse 72:3": "“Và (chúng tôi tin) rằng quả thật, Quyền Uy của Thượng Đế của chúng ta rất mực tối cao, Ngài không có bạn đời và không có con.”",
            "verse 72:4": "“Quả thật, kẻ ngu ngốc (Iblis) trong chúng ta đã nói về Allah những điều quá đáng cho Allah.”",
            "verse 72:5": "“Chúng tôi đã nghĩ rằng loài người và Jinn không bao giờ nói những điều gian dối cho Allah.”",
            "verse 72:6": "“Quả thật, có những đàn ông trong loài người đã tìm kiếm sự che chở và phù hộ từ những đàn ông trong loài Jinn. Tuy nhiên, (điều đó) chỉ làm cho họ càng thêm sợ hãi trước (những đàn ông Jinn).”",
            "verse 72:7": "“Quả thật, (loài người) đã nghĩ như các ngươi (loài Jinn) đã nghĩ, rằng Allah sẽ không bao giờ cử bất cứ ai (làm Sử Giả).”",
            "verse 72:8": "“Chúng tôi đã tìm cách lên trời (để nghe trộm thông tin) nhưng chúng tôi thấy đầy những vệ binh hùng mạnh cùng với những ngọn lửa rực cháy (dùng để ném những ai muốn tiếp cận.”",
            "verse 72:9": "“Quả thật, chúng tôi đã từng ngồi tại những chỗ ngồi (trên trời) để nghe trộm tin tức nhưng giờ đây nếu ai lên nghe trộm thì sẽ thấy một ngọn lửa cháy rực đang mai phục.”",
            "verse 72:10": "“Chúng tôi không biết liệu (việc trên trời có những vệ binh với những ngọn lửa cháy rực mai phục) là điều xấu mà Thượng Đế của họ muốn dành cho những ai sống trên trái đất hay Ngài muốn hướng dẫn họ một con đường đúng đắn.”",
            "verse 72:11": "“Thật vậy, trong chúng ta có những kẻ đức hạnh và cũng có những kẻ không như vậy. Chúng ta đã đi theo những con đường khác nhau.”",
            "verse 72:12": "“Quả thật, chúng tôi tin chắc rằng chúng tôi sẽ không bao giờ có thể làm cho Allah thất bại trên trái đất và chúng tôi sẽ không bao giờ có thể trốn thoát khỏi Ngài.”",
            "verse 72:13": "“Quả thật, khi chúng tôi nghe được nguồn Chỉ Đạo (Qur’an), chúng tôi đã tin vào Nó. Và bất kỳ ai có đức tin nơi Thượng Đế của y thì sẽ không sợ thiếu thốn (phần thưởng) hay gánh nặng (tội lỗi trước đây).”",
            "verse 72:14": "“Quả thật, trong số chúng ta có những người Muslim (phục tùng Allah) và trong chúng ta cũng có những người lầm lạc. Vì vậy, những ai thần phục (Allah) thì họ đã tìm thấy con đường đúng đắn.”",
            "verse 72:15": "“Và đối với những kẻ đi lạc, họ sẽ là chất đốt của Hỏa Ngục.”",
            "verse 72:16": "Và nếu chúng (con người và loài jinn) vẫn ngay thẳng trên con đường (chính đạo) thì chắc chắn TA sẽ ban cho chúng nước mưa dồi dào.",
            "verse 72:17": "Để TA có thể thử thách chúng trong đó (xem ai biết tạ ơn TA và ai là kẻ quay lưng với TA). Ai quay lưng với việc tưởng nhớ Thượng Đế của y thì Ngài sẽ đẩy y vào sự trừng phạt đau đớn tột cùng.",
            "verse 72:18": "Quả thật, các Masjid là của Allah, vì vậy, các ngươi đừng cầu nguyện cùng với Allah bất kỳ ai.",
            "verse 72:19": "Và khi người bề tôi của Allah (Thiên Sứ Muhammad) đứng cầu nguyện Ngài, chúng (Jinn) xúm nhau đến thành một đám đông (để nghe Y đọc Qur’an).",
            "verse 72:20": "Ngươi (Thiên Sứ Muhammad) hãy nói (với những kẻ đa thần): “Ta chỉ cầu nguyện Thượng Đế của Ta và Ta không tổ hợp cùng với Ngài bất cứ ai.”",
            "verse 72:21": "Ngươi hãy nói với chúng: “Ta thực sự không nắm trong tay (quyền năng) gây tổn hại cho các ngươi cũng như Ta (không nắm quyền) hướng dẫn các ngươi.”",
            "verse 72:22": "Ngươi hãy nói với chúng: “Thật vậy, (nếu Ta không vâng lời Allah) thì chắc chắn sẽ không một ai có thể cứu được Ta khỏi (hình phạt của) Allah; và ngoài Ngài, Ta sẽ không bao giờ tìm được một nơi nương thân nào khác.”",
            "verse 72:23": "Trừ phi Ta truyền đạt (Mệnh lệnh) từ Ngài và Bức Thông Điệp của Ngài. Và ai không vâng lệnh Allah và Sứ Giả của Ngài thì quả thật, y sẽ phải đón nhận Lửa của Hỏa Ngục, nơi mà y sẽ ở trong đó mãi mãi.",
            "verse 72:24": "(Những kẻ vô đức tin vẫn cứ ở trên tình trạng vô đức tin của chúng) cho đến khi chúng thấy điều mà chúng đã được hứa thì (lúc bấy giờ) chúng sẽ biết ai là kẻ yếu thế về phương diện người giúp đỡ và thiểu số hơn.",
            "verse 72:25": "Ngươi hãy nói với chúng: “Ta không biết liệu điều mà các ngươi được hứa sắp đến hay Thượng Đế của Ta sẽ định cho nó một khoảng thời gian nữa.”",
            "verse 72:26": "(Ngài là) Đấng biết những điều không thể nhìn thấy. Và Ngài không tiết lộ những điều không thể nhìn thấy của Ngài cho bất cứ ai.",
            "verse 72:27": "Ngoại trừ những ai mà Ngài hài lòng trong số các Sứ Giả của Ngài. Và Ngài phái cảnh vệ binh tháp tùng Y đằng trước và đằng sau.",
            "verse 72:28": "Để Ngài có thể biết rằng họ đã truyền đạt các Thông Điệp của Thượng Đế của họ hay chưa và Ngài bao quát (kiểm soát) mọi điều nơi họ và tất cả mọi thứ đều được Ngài đếm số lượng."
        },
        "Yoruba": {
            "verse 72:1": "So pe: \"Won fi imisi ranse si mi pe dajudaju ijo kan ninu awon alujannu teti (si al-Ƙur’an).\" Won si so pe: \"Dajudaju awa gbo al-Ƙur’an iyanu",
            "verse 72:2": "O n setosona sibi imona. Nitori naa, a gba a gbo. Awa ko si nii fi eni kan kan se akegbe fun Oluwa wa",
            "verse 72:3": "Ati pe dajudaju titobi Oluwa wa ga. Ko fi eni kan kan se aya ati omo",
            "verse 72:4": "Dajudaju omugo ninu wa maa n so isokuso nipa Allahu",
            "verse 72:5": "Dajudaju awa si n ro pe eniyan ati alujannu ko nii pa iro mo Allahu ni",
            "verse 72:6": "Ati pe dajudaju awon okunrin kan ninu eniyan maa n fi awon okunrin kan ninu awon alujannu wa aabo. Awon alujannu si se alekun aburu fun won",
            "verse 72:7": "Dajudaju awon alujannu lero gege bi eyin eniyan naa se lero pe Allahu ko nii gbe eni kan kan dide (leyin iku)",
            "verse 72:8": "Dajudaju awa wa (oro ayogbo) wa si sanmo, a si ba a ti o ti kun fun awon eso t’o lagbara ati awon ogunna",
            "verse 72:9": "Dajudaju awa maa n jokoo sibe ni awon ibudo kan fun gbigbo oro. Sugbon eni t’o ba joro gbo lasiko yii, o maa ri ogunna t’o ti lugo de e",
            "verse 72:10": "Dajudaju awa ko si mo boya aburu ni won gba lero pelu awon t’o wa lori ile tabi Oluwa won gbero imona fun won",
            "verse 72:11": "Dajudaju awon eni rere wa ninu wa. Awon miiran yato si iyen tun wa ninu wa. A wa loju ona (esin) otooto",
            "verse 72:12": "Dajudaju awa mo amodaju pe awa ko le mori bo mo Allahu lowo lori ile. Awa ko si le sa mo On lowo",
            "verse 72:13": "Dajudaju nigba ti a gbo nipa imona (lati inu al-Ƙur’an), a gba a gbo. Nitori naa, enikeni ti o ba gba Oluwa re gbo, ki o ma beru adinku (esan rere) ati (alekun) aburu",
            "verse 72:14": "Dajudaju awon musulumi wa ninu wa. Awon arufin naa wa ninu wa. Nitori naa, enikeni ti o ba se ’Islam, awon wonyen ni won se awari imona",
            "verse 72:15": "Ni ti awon arufin, awon ni won maa je igi ikona fun ina Jahanamo.”",
            "verse 72:16": "Ati pe ti o ba je pe won duro sinsin loju ona (’Islam) ni, dajudaju Awa iba fun won ni omi pupo mu",
            "verse 72:17": "Nitori ki A le fi dan won wo ni. Enikeni ti o ba gbunri kuro nibi iranti Oluwa re, O maa mu un wo inu iya inira",
            "verse 72:18": "Dajudaju awon mosalasi n je ti Allahu. Nitori naa, e o gbodo fi pe eni kan pelu Allahu",
            "verse 72:19": "Dajudaju nigba ti erusin Allahu dide duro t’o n pe Allahu, awon alujannu fee maa difun-un-unfun lodo re (lati teti si al-Ƙur’an)",
            "verse 72:20": "So pe: \"Oluwa mi ni mo n pe. Ati pe emi ko nii so eni kan kan di akegbe fun Un",
            "verse 72:21": "So pe: \"Dajudaju emi ko ni ikapa lori inira ati imona fun yin",
            "verse 72:22": "So pe: \"Dajudaju emi, ko si eni kan t’o le gba mi la lodo Allahu. Emi ko si ri ibusasi kan leyin Re",
            "verse 72:23": "Afi (ki ng se) ikede (t’o wa) lati odo Allahu ati awon ise Re (t’O fi ran mi). Enikeni t’o ba yapa Allahu ati Ojise Re, dajudaju ina Jahanamo n be fun un. Olusegbere ni won ninu re titi laelae",
            "verse 72:24": "(Alaigbagbo ko nii ye sai gbagbo) titi di igba ti won yoo fi ri ohun ti A n se ni adehun fun won. Nigba naa, won yoo mo ta ni o le julo ni alaranse, ti o si kere julo ni onka",
            "verse 72:25": "So pe: \"Emi ko mo boya ohun ti Won n se ni adehun fun yin ti sunmo tabi Oluwa mi yoo fun un ni akoko (t’o jinna)",
            "verse 72:26": "Onimo-ikoko, ko si fi (imo) ikoko Re han eni kan",
            "verse 72:27": "ayafi eni ti O salesa t’o je Ojise. Dajudaju O n mu eso kan rin niwaju Ojise naa ati leyin re",
            "verse 72:28": "nitori ki O le safi han pe won ti je awon ise Oluwa won. Ati pe Allahu fi imo rokiri ka ohun ti n be lodo won. O si so onka gbogbo nnkan"
        }
    }
}