{
    "id": 73,
    "name_simple": "Al-Muzzammil",
    "revelation_place": "makkah",
    "revelation_order": 3,
    "bismillah_pre": true,
    "verses_count": 20,
    "short_text": "The Surah has been so designated after the word al-muzzammil occurring in the very first verse. This is only a name and not a title of its subject matter.",
    "text": [
        "\n",
        "The Surah has been so designated after the word al-muzzammil occurring in the very first verse. This is only a name and not a title of its subject matter.",
        "\n",
        "Period of Revelation",
        "\n",
        "The two sections of this Surah were revealed in two separate periods.",
        "\n",
        "The first section (vv. 1-19) is unanimously a Makki Revelation, and this is supported both by its subject matter and by the traditions of the Hadith. As for the question, in which specific period of the life at Makkah it was revealed, it is not answered by the tradition, but the internal evidence of the subject matter of this section helps to determine the period of its revelation.",
        "\n",
        "First, in it the Holy Prophet (upon whom be peace) has been instructed to the effect: \"Arise during the night and worship Allah so that you may develop the capability to shoulder the heavy burden of Prophethood and to discharge its responsibilities.\" This shows that this Command must have been given in the earliest period of the Prophethood when training was being imparted to the Holy prophet by Allah for this office.",
        "\n",
        "Secondly, a Command has been given in it that the Qur'an be recited in, the Tahajjud Prayer for half the night, or thereabout. This Command by itself points out that by that time at least so much of the Qur'an had been revealed as could be recited for that long.",
        "\n",
        "Thirdly, in this section the Holy Prophet (upon whom be peace) has been exhorted to have patience at the excesses being committed by his opponents, and the disbelievers of Makkah have been threatened with the torment. This shows that this section was revealed at a time when the Holy Prophet (upon whom be peace) had openly started preaching Islam and the opposition to him at Makkah had grown active and strong.",
        "\n",
        "About the second section (v. 20) although many of the commentators have expressed the opinion that this too was sent down at Makkah, yet some other commentators regard it as a Madani Revelation, and this same opinion is confirmed by the subject matter of this section. For it mentions fighting in the way of Allah, and obviously, there could be no question of it at Makkah; it also contains the Command to pay the obligatory zakat, and it is fully confirmed that the zakat at a specific rate and with an exemption limit (nisab) was enjoined at Madinah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In the first seven verses the Holy Prophet (upon whom be peace) has been commanded to the effect: \"Prepare yourself to shoulder the responsibilities of the great Mission that has been entrusted to you; its practical form is that you should rise during the hours of night and stand up in Prayer for half the night, or for a little more or less of it.\"",
        "\n",
        "In vv. 8-14, he has been exhorted to the effect: \"Devote yourself exclusively to that God Who is the Owner of the whole universe. Entrust all your affairs to Him with full satisfaction of the heart. Bear with patience whatever your opponents may utter against you. Do not be intimate with them. Leave their affair to God: He Himself will deal with them.\"",
        "\n",
        "Then, in vv. 15-19, those of the people of Makkah, who were opposing the Holy Prophet (upon whom be peace) have been warned, so as to say: \"We have sent a Messenger to you just as We sent a Messenger to the Pharaoh. Just consider what fate the Pharaoh met when he did not accept the invitation of the Messenger of Allah. Supposing that you are not punished by a torment in this world, how will you save yourselves from the punishment for disbelief on the Day of Resurrection.\"",
        "\n",
        "This is the subject matter of the first section. The second section, according to a tradition from Hadrat Sa'id bin Jubair, was sent down ten years later, and in it the initial Command given in connection with the Tahajjud Prayer, in the beginning of the first section, was curtailed. The new Command enjoined, \"Offer as much of the Tahajjud Prayer as you easily can, but what the Muslims should particularly mind and attend to is the five times obligatory Prayer a day:, they should establish it regularly and punctually; they should discharge their zakat dues accurately; and they should spend their wealth with sincere intentions for the sake of Allah. In conclusion, the Muslims have been exhorted, saying: \"Whatever good works you do in the world, will not go waste, but they are like the provision which a traveler sends up in advance to his permanent place of residence. Whatever good you send up from the world, you will find it with Allah, and the provision thus sent up is\r\nmuch better than what you will have to leave behind in the world, and with Allah you will also get a much better and richer reward than what you have actually sent up before.\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens by addressing the mantled Prophet as the Enwrapped Messenger. It takes its name from the word “wrapped in mantle” (muzzammil) in verse 1. The surah describes how God relaxed the early regime of devotion first imposed on the Prophet (verse 1 .) to prepare him for the weighty message. The Prophet is urged to be patient (verse 10 .), told of the punishment that awaits the disbelievers in Hell (verse 12 .), and reminded of the punishment that befell Pharaoh in this life (verse 15 .).The surah is also known as: Bundled up, Enfolded, Folded in Garments, The Enwrapped Messenger, The Enwrapped One, The Mantled One, Wrapped in Mantle.",
    "name_translation": "Enwrapped",
    "name_complex": "Al-Muzzammil",
    "surah_name_ar": "المزمل",
    "verses": {
        "Albanian": {
            "verse 73:1": "O ti i mbështjellur (Muhammed)!",
            "verse 73:2": "Zgjoju (lutju) Perëndisë natën, pos të paktën; -",
            "verse 73:3": "gjysmën e saj ose edhe më pak nga ajo,",
            "verse 73:4": "ose diçka më shumë se ajo, dhe lexo Kur’anin me kujdes dhe qartë,",
            "verse 73:5": "Ne, me të vërtetë, do të dërgojmë ty fjalë të rënda –",
            "verse 73:6": "sepse, zgjuarja natën, me të vërtetë, vepron më fuqishëm dhe shprehjet (mësimet) janë më të kthjellta,",
            "verse 73:7": "meqë ti, me të vërtetë, ditën je shumë i angazhuar.",
            "verse 73:8": "Dhe përmende emrin e Zotit tënd dhe përkushtoju krejtësisht Atij.",
            "verse 73:9": "Ai ësht Zot i lindjes dhe i perëndimit, s’ka zot tjetër përveç Tij, dhe Atë merre për mbrojtës!",
            "verse 73:10": "Dhe, duroji llomotitjet e atyre dhe largohu nga ata në mënyrë të bukur,",
            "verse 73:11": "e lermëni Mua (t’i qeroj hesapet) me ata që të konsiderojnë (ty) për gënjeshtar, të cilët jetojnë në luks dhe jepju pak afat atyre:",
            "verse 73:12": "se, padyshim, Ne kemi pranga dhe zjarr,",
            "verse 73:13": "dhe gjellëra që ngelin në fyt, dhe dënime të dhembshme",
            "verse 73:14": "në Ditën kur Toka dhe malet dridhen e bëhen si grumbuj të shkapërderdhur të rërës.",
            "verse 73:15": "Ne, juve, me të vërtetë, ju kemi dërguar një Profet dëshmitar kundër jush, ashtu siç ia kemi pas dërguar një profet Faraonit,",
            "verse 73:16": "por Faraoni e ka kundërshtuar Profetin, andaj e kemi dënuar atë me dënim të rëndë.",
            "verse 73:17": "Qysh do të ruheni ju (nga dënimet) nëse mbeteni jobesimtarë Ditën në të cilën fëmijët bëhen të thinjët (prej tmerrit të madh)?!",
            "verse 73:18": "Atë ditë, qielli do të çahet (nga tmerri), e premtimi i Zotit do të jetë i plotësuar.",
            "verse 73:19": "Kjo, me të vërtetë, është këshillë; dhe kush dëshiron – le ta zgjedhin rrugën (që shpie) te Zoti i tij.",
            "verse 73:20": "Me të vërtetë, Zoti yt e di, se ti (o Muhammed) lutesh më pak se dy të tretat e natës, ndonjëherë gjysmën ose të tretën e saj, si edhe disa prej atyre që janë me ty. Zoti e ka caktuar gjatësinë e ditës dhe të natës, Ai e di se ju nuk mundeni me e llogaritur atë, andaj ju ka bërë lehtësi; e ju lexoni Kur’an aq sa mundeni; Ai e di që ndokush nga ju do të jetë i sëmurë, kurse disa të tjerë udhëtojnë nëpër botë, duke kërkuar dhuntitë e Perëndisë (për jetesë), dhe të tjerë që luftojnë në rrugën e Perëndisë – prandaj, lexoni ju sa keni mundëis nga Kur’ani, dhe kryeni namazin dhe jepnie zeqatin, dhe për hir të Perëndisë jepnihua, sepse, çdo të mirë që e përgatitni ju për vete më parë, do ta gjeni te Perëndia më të mirë dhe (do të keni) shpërblim më të madh. Kërkoni falje te Perëndia, se, Perëndia, me të vërtetë, është falës dhe mëshirues i madh."
        },
        "Amharic": {
            "verse 73:1": "አንተ ተከናናቢው ሆይ፡፡",
            "verse 73:2": "ሌሊቱን ሁሉ ጥቂት ሲቀር ቁም፤ (ስገደ)፡፡",
            "verse 73:3": "ግማሹን (ቁም)፤ ወይም ከርሱ ጥቂትን ቀንስ፡፡",
            "verse 73:4": "ወይም በእርሱ ላይ ጨምር፡፡ ቁርኣንንም በዝግታ ማንበብን አንብብ፡፡",
            "verse 73:5": "እኛ ባንተ ላይ ከባድ ቃልን እንጥላለንና፡፡",
            "verse 73:6": "የሌሊት መነሳት እርሷ (ሕዋሳትንና ልብን) ለማስማማት በጣም ብርቱ ናት፡፡ ለማንበብም ትክክለኛ ናት፡፡",
            "verse 73:7": "ላንተ በቀን ውስጥ ረዥም መዘዋወር አልለህ፡፡",
            "verse 73:8": "የጌታህንም ስም አውሳ፤ ወደእርሱም (መግገዛት) መቋረጥን ተቋረጥ ፡፡",
            "verse 73:9": "(እርሱም) የምሥራቅና የምዕራብ ጌታ ነው፡፡ ከእርሱ ሌላ አምላክ የለም፡፡ መጠጊያ አድርገህም ያዘው፡፡",
            "verse 73:10": "(ከሓዲዎች) በሚሉትም ላይ ታገሥ፡፡ መልካምንም መተው ተዋቸው፡፡",
            "verse 73:11": "የድሎት ባለቤቶችም ከኾኑት አስተባባዮች ጋር ተዎኝ፡፡ ጥቂትንም ጊዜ አቆያቸው፡፡",
            "verse 73:12": "እኛ ዘንድ ከባድ ማሰሪያዎች እሳትም አልለና፡፡",
            "verse 73:13": "የሚያንቅ ምግብም፤ አሳማሚ ቅጣትም (አልለ)",
            "verse 73:14": "ምድርና ገራዎች በሚርገፈገፉበት፣ ጋራዎችም ፈሳሽ የአሸዋ ክምር በሚኾኑበት ቀን፡፡",
            "verse 73:15": "እኛ በእናንተ ላይ መስካሪ መልክተኛን ወደእናንተ ላክን፡፡ ወደ ፈርዖን መልክተኛን እንደላክን፡፡",
            "verse 73:16": "ፈርዖንም መልክተኛውን አመጸ፤ ብርቱ መያዝንም ያዝነው፡፡",
            "verse 73:17": "ብትክዱ ልጆችን ሸበቶዎች የሚያደርገውን ቀን (ቅጣት) እንዴት ትጠበቃላችሁ፡፡",
            "verse 73:18": "ሰማዩ በርሱ (በዚያ ቀን) ተሰንጣቂ ነው፡፡ ቀጠሮው ተፈጻሚ ነው፡፡",
            "verse 73:19": "ይህቺ መገሠጫ ናት፡፡ (መዳንን) የሻም ሰው ወደ ጌታው መንገድን ይይዛል፡፡",
            "verse 73:20": "አንተ ከሌሊቱ ሁለት እጅ ያነሰን ግማሹንም ሲሶውንም የምትቆም መኾንህን ጌታህ በእርግጥ ያውቃል፡፡ ከእነዚያም አብረውህ ካሉት ከፊሎች (የሚቆሙ መኾናቸውን ያውቃል)፡፡ አላህም ሌሊትንና ቀንን ይለክካል፡፡ (ሌሊቱን) የማታዳርሱት መኾናችሁን ዐወቀ፡፡ በእናንተ ላይም (ወደ ማቃለል) ተመለሰላችሁ፡፡ ስለዚህ ከቁርኣን (በስግደት) የተቻላችሁን አንብቡ፡፡ ከእናንተ ውስጥ በሽተኞች፣ ሌሎችም ከአላህ ችሮታ ለመፈለግ በምድር ላይ የሚጓዙ፣ ሌሎችም በአላህ መንገድ (ሃይማኖት) የሚጋደሉ እንደሚኖሩ ዐወቀ፡፡ (አቃለለላቸውም)፡፡ ከእርሱም የተቻለችሁን አንብቡ፡፡ ሶላትንም ስገዱ፡፡ ዘካንም ስጡ፡፡ ለአላህም መልካም ብደርን አበድሩ፡፡ ከመልካም ሥራም ለነፍሶቻችሁ የምታስቀድሙትን ሁሉ እርሱ የተሻለና በምንዳም ታላቅ ኾኖ አላህ ዘንድ ታገኙታላችሁ፡፡ አላህንም ምሕረትን ለምኑት፡፡ አላህ በጣም መሓሪ አዛኝ ነውና፡፡"
        },
        "Arabic": {
            "verse 73:1": "ُلِّمَّزُمْلا اَهُّيَأ اَي",
            "verse 73:2": "اًليِلَق اَّلِإ َلْيَّللا ِمُق",
            "verse 73:3": "اًليِلَق ُهْنِم ْصُقنا ِوَأ ُهَفْصِّن",
            "verse 73:4": "اًليِتْرَت َنآْرُقْلا ِلِّتَرَو ِهْيَلَع ْدِز ْوَأ",
            "verse 73:5": "اًليِقَث اًلْوَق َكْيَلَع يِقْلُنَس اَّنِإ",
            "verse 73:6": "اًليِق ُمَوْقَأَو اًئْطَو ُّدَشَأ َيِه ِلْيَّللا َةَئِشاَن َّنِإ",
            "verse 73:7": "اًليِوَط اًحْبَس ِراَهَّنلا يِف َكَل َّنِإ",
            "verse 73:8": "اًليِتْبَت ِهْيَلِإ ْلَّتَبَتَو َكِّبَر َمْسا ِرُكْذاَو",
            "verse 73:9": "اًليِكَو ُهْذِخَّتاَف َوُه اَّلِإ َهَٰلِإ اَل ِبِرْغَمْلاَو ِقِرْشَمْلا ُّبَّر",
            "verse 73:10": "(اًليِمَج اًرْجَه ْمُهْرُجْهاَو َنوُلوُقَي اَم ٰىَلَع ْرِبْصاَو",
            "verse 73:11": "(اًليِلَق ْمُهْلِّهَمَو ِةَمْعَّنلا يِلوُأ َنيِبِّذَكُمْلاَو يِنْرَذَو",
            "verse 73:12": "(اًميِحَجَو اًلاَكنَأ اَنْيَدَل َّنِإ",
            "verse 73:13": "(اًميِلَأ اًباَذَعَو ٍةَّصُغ اَذ اًماَعَطَو",
            "verse 73:14": "(اًليِهَّم اًبيِثَك ُلاَبِجْلا ِتَناَكَو ُلاَبِجْلاَو ُضْرَأْلا ُفُجْرَت َمْوَي",
            "verse 73:15": "(اًلوُسَر َنْوَعْرِف ٰىَلِإ اَنْلَسْرَأ اَمَك ْمُكْيَلَع اًدِهاَش اًلوُسَر ْمُكْيَلِإ اَنْلَسْرَأ اَّنِإ",
            "verse 73:16": "(اًليِبَو اًذْخَأ ُهاَنْذَخَأَف َلوُسَّرلا ُنْوَعْرِف ٰىَصَعَف",
            "verse 73:17": "(اًبيِش َناَدْلِوْلا ُلَعْجَي اًمْوَي ْمُتْرَفَك نِإ َنوُقَّتَت َفْيَكَف",
            "verse 73:18": "(اًلوُعْفَم ُهُدْعَو َناَك ۚ ِهِب ٌرِطَفنُم ُءاَمَّسلا",
            "verse 73:19": "(اًليِبَس ِهِّبَر ٰىَلِإ َذَخَّتا َءاَش نَمَف ۖ ٌةَرِكْذَت ِهِذَٰه َّنِإ",
            "verse 73:20": "(ٌميِحَّر ٌروُفَغ َهَّللا َّنِإ ۖ َهَّللا اوُرِفْغَتْساَو ۚ اًرْجَأ َمَظْعَأَو اًرْيَخ َوُه ِهَّللا َدنِع ُهوُدِجَت ٍرْيَخ ْنِّم مُكِسُفنَأِل اوُمِّدَقُت اَمَو ۚ اًنَسَح اًضْرَق َهَّللا اوُضِرْقَأَو َةاَكَّزلا اوُتآَو َةاَلَّصلا اوُميِقَأَو ۚ ُهْنِم َرَّسَيَت اَم اوُءَرْقاَف ۖ ِهَّللا ِليِبَس يِف َنوُلِتاَقُي َنوُرَخآَو ۙ ِهَّللا ِلْضَف نِم َنوُغَتْبَي ِضْرَأْلا يِف َنوُبِرْضَي َنوُرَخآَو ۙ ٰىَضْرَّم مُكنِم ُنوُكَيَس نَأ َمِلَع ۚ ِنآْرُقْلا َنِم َرَّسَيَت اَم اوُءَرْقاَف ۖ ْمُكْيَلَع َباَتَف ُهوُصْحُت نَّل نَأ َمِلَع ۚ َراَهَّنلاَو َلْيَّللا ُرِّدَقُي ُهَّللاَو ۚ َكَعَم َنيِذَّلا َنِّم ٌةَفِئاَطَو ُهَثُلُثَو ُهَفْصِنَو ِلْيَّللا ِيَثُلُث نِم ٰىَنْدَأ ُموُقَت َكَّنَأ ُمَلْعَي َكَّبَر َّنِإ ۞"
        },
        "Azerbaijani": {
            "verse 73:1": "Ey libasına bürünüb örtünmüş peyğəmbər!",
            "verse 73:2": "Az bir hissəsi istisna olmaqla gecələr namaza dur!",
            "verse 73:3": "Onun yarısını, yaxud ondan bir az əskilt,",
            "verse 73:4": "və ya ona artır. Quranı da aramla oxu!",
            "verse 73:5": "Həqiqətən Biz sənə ağır bir Söz (Quran) vəhy edəcəyik.",
            "verse 73:6": "Sözsüz ki, gecə qalxmaq çox çətin və Quran oxumaq daha münasibdir.",
            "verse 73:7": "Şübhəsiz ki, gündüz sənin üçün uzun-uzadı işlər vardır.",
            "verse 73:8": "Rəbbinin adını zikr et və özünü tamamilə Ona həsr et!",
            "verse 73:9": "O, məşriqin və məğribin Rəbbidir. Ondan başqa məbud yoxdur. Elə isə Onu özünə Himayəçi götür!",
            "verse 73:10": "Müşriklərin dediklərinə səbir et və onlardan xoşluqla uzaqlaş.",
            "verse 73:11": "Məni, ayələrimi yalan sayan var-dövlət sahibləri ilə tək burax və onlara bir az möhlət ver.",
            "verse 73:12": "Həqiqətən, Bizdə onlar üçün qandallar və Cəhənnəm hazırlanmışdır,",
            "verse 73:13": "boğazda tıxanıb keçməyən yemək və ağrılı-acılı bir əzab da vardır.",
            "verse 73:14": "O gün yer və dağlar titrəyəcək, dağlar səpələnən qum təpəsinə dönəcəkdir.",
            "verse 73:15": "Həqiqətən, Biz Firona elçi göndərdiyimiz kimi sizə də şahidlik edəcək elçi göndərdik.",
            "verse 73:16": "Firon elçiyə asi oldu. Biz də onu şiddətli bir əzabla yaxaladıq.",
            "verse 73:17": "Əgər küfr etsəniz, uşaqların saçlarının ağaracağı gündən necə yaxa qurtaracaqsınız?",
            "verse 73:18": "O gün göy parçalanacaq. Allahın vədi mütləq yerinə yetəcəkdir.",
            "verse 73:19": "Həqiqətən, bu, bir nəsihətdir. Kim istəsə, Rəbbinə tərəf yönələr.",
            "verse 73:20": "Həqiqətən, Rəbbin bilir ki, sən və səninlə olan insanların bir qismi bəzən gecənin üçdə ikisindən az, bəzən yarısını, bəzən də üçdə birini ibadət üçün durursunuz. Gecə və gündüzü Allah ölçüb müəyyənləşdirir. O, sizin bunları hesablamaqda çətinlik çəkəcəyinizi nəzərə alaraq, tövbələrinizi qəbul etdi. Elə isə namaz qılarkən Qurandan sizə asan gələni oxuyun! O bilir ki, bəziləriniz xəstə olacaq, digərləriniz Allahın mərhəmətindən ruzi əldə etmək məqsədilə müxtəlif yerlərə səfərə çıxacaq, bir qisminiz də Allah yolunda vuruşacaqdır. Buna görə namaz qılarkən Qurandan sizə asan olanı oxuyun! Namaz qılın, zəkatınızı ödəyin və Allaha gözəl bir borc verin. Bu dünyada qabaqcadan özünüzə hansı xeyirli əməlləri tədarük etsəniz, Allah yanında onun daha xeyirlisi ilə və daha böyük mükafatla əvəz olunduğunu görəcəksiniz. Elə isə Allahdan sizi əfv etməsini istəyin! Şübhəsiz ki, Allah Bağışlayandır, Rəhmlidir!"
        },
        "Bengali": {
            "verse 73:1": "হে বস্ত্রাবৃত!",
            "verse 73:2": "রাত্রিতে দন্ডায়মান হোন কিছু অংশ বাদ দিয়ে;",
            "verse 73:3": "অর্ধরাত্রি অথবা তদপেক্ষা কিছু কম",
            "verse 73:4": "অথবা তদপেক্ষা বেশী এবং কোরআন আবৃত্তি করুন সুবিন্যস্ত ভাবে ও স্পষ্টভাবে।",
            "verse 73:5": "আমি আপনার প্রতি অবতীর্ণ করেছি গুরুত্বপূর্ণ বাণী।",
            "verse 73:6": "নিশ্চয় এবাদতের জন্যে রাত্রিতে উঠা প্রবৃত্তি দলনে সহায়ক এবং স্পষ্ট উচ্চারণের অনুকূল।",
            "verse 73:7": "নিশ্চয় দিবাভাগে রয়েছে আপনার দীর্ঘ কর্মব্যস্ততা।",
            "verse 73:8": "আপনি আপনার পালনকর্তার নাম স্মরণ করুন এবং একাগ্রচিত্তে তাতে মগ্ন হোন।",
            "verse 73:9": "তিনি পূর্ব ও পশ্চিমের অধিকর্তা। তিনি ব্যতীত কোন উপাস্য নেই। অতএব, তাঁকেই গ্রহণ করুন কর্মবিধায়করূপে।",
            "verse 73:10": "কাফেররা যা বলে, তজ্জন্যে আপনি সবর করুন এবং সুন্দরভাবে তাদেরকে পরিহার করে চলুন।",
            "verse 73:11": "বিত্ত-বৈভবের অধিকারী মিথ্যারোপকারীদেরকে আমার হাতে ছেড়ে দিন এবং তাদেরকে কিছু অবকাশ দিন।",
            "verse 73:12": "নিশ্চয় আমার কাছে আছে শিকল ও অগ্নিকুন্ড।",
            "verse 73:13": "গলগ্রহ হয়ে যায় এমন খাদ্য এবং যন্ত্রণাদায়ক শাস্তি।",
            "verse 73:14": "যেদিন পৃথিবী পর্বতমালা প্রকম্পিত হবে এবং পর্বতসমূহ হয়ে যাবে বহমান বালুকাস্তুপ।",
            "verse 73:15": "আমি তোমাদের কাছে একজন রসূলকে তোমাদের জন্যে সাক্ষী করে প্রেরণ করেছি, যেমন প্রেরণ করেছিলাম ফেরাউনের কাছে একজন রসূল।",
            "verse 73:16": "অতঃপর ফেরাউন সেই রসূলকে অমান্য করল, ফলে আমি তাকে কঠিন শাস্তি দিয়েছি।",
            "verse 73:17": "অতএব, তোমরা কিরূপে আত্নরক্ষা করবে যদি তোমরা সেদিনকে অস্বীকার কর, যেদিন বালককে করে দিব বৃদ্ধ?",
            "verse 73:18": "সেদিন আকাশ বিদীর্ণ হবে। তার প্রতিশ্রুতি অবশ্যই বাস্তবায়িত হবে।",
            "verse 73:19": "এটা উপদেশ। অতএব, যার ইচ্ছা, সে তার পালনকর্তার দিকে পথ অবলম্বন করুক।",
            "verse 73:20": "আপনার পালনকর্তা জানেন, আপনি এবাদতের জন্যে দন্ডায়মান হন রাত্রির প্রায় দু’তৃতীয়াংশ, অর্ধাংশ ও তৃতীয়াংশ এবং আপনার সঙ্গীদের একটি দলও দন্ডায়মান হয়। আল্লাহ দিবা ও রাত্রি পরিমাপ করেন। তিনি জানেন, তোমরা এর পূর্ণ হিসাব রাখতে পার না। অতএব তিনি তোমাদের প্রতি ক্ষমা পরায়ন হয়েছেন। কাজেই কোরআনের যতটুকু তোমাদের জন্যে সহজ, ততটুকু আবৃত্তি কর। তিনি জানেন তোমাদের মধ্যে কেউ কেউ অসুস্থ হবে, কেউ কেউ আল্লাহর অনুগ্রহ সন্ধানে দেশে-বিদেশে যাবে এবং কেউ কেউ আল্লাহর পথে জেহাদে লিপ্ত হবে। কাজেই কোরআনের যতটুকু তোমাদের জন্যে সহজ ততটুকু আবৃত্তি কর। তোমরা নামায কায়েম কর, যাকাত দাও এবং আল্লাহকে উত্তম ঋণ দাও। তোমরা নিজেদের জন্যে যা কিছু অগ্রে পাঠাবে, তা আল্লাহর কাছে উত্তম আকারে এবং পুরস্কার হিসেবে বর্ধিতরূপে পাবে। তোমরা আল্লাহর কাছে ক্ষমাপ্রার্থনা কর। নিশ্চয় আল্লাহ ক্ষমাশীল, দয়ালু।"
        },
        "Berber Amazigh": {
            "verse 73:1": "A win isburen!",
            "verse 73:2": "Aâwez, xas cwiî.",
            "verse 73:3": "Azgen n yiv, ne$ ssenqes segs, acemma.",
            "verse 73:4": "Ne$ rnu yas. Di Leqwôan ûûun leqôaya!",
            "verse 73:5": "Aql a£, ad ak d Nini awal amray.",
            "verse 73:6": "Ccaw n yiv, iééaéay kteô asurif, u issewqam kteô leqôaya.",
            "verse 73:7": "Deg wass, s tidep, tce$wlev, maççi d kra.",
            "verse 73:8": "Mmekti d isem n Mass ik, lhu yideS, akken iwata.",
            "verse 73:9": "Mass ugmuv akked utaram, ur illi ôebbi siwa Neppa. Ihi, sâu T d Awkil.",
            "verse 73:10": "Eûbeô i innan nnsen, faôeq iten s leêdaqa.",
            "verse 73:11": "Eoo iyI inekkaôen, akked usâiyen; efk asen cwiî n lmudda.",
            "verse 73:12": "£uône£, s tidep, slasel akked tmes iôeqqen,",
            "verse 73:13": "lqut ipceôôiqen, aâaqeb aqeôêan.",
            "verse 73:14": "Ass ideg tamurt akked idurar ad rgagin, idurar ad u$alen am ôômel ippazalen.",
            "verse 73:15": "Atan Nuzen awen ed Amazan, d anagi nnwen, akken Nuzen amazan i Ferâun.",
            "verse 73:16": "Ferâun iâuûa amazan. Newwet it tiyta tuqsiêt.",
            "verse 73:17": "Amek ara têezzbem, ma tnekkôem ass ideg igwerdan ad caben?",
            "verse 73:18": "Segs, ad icerreg igenni, ad iûaô wayen i wen Iwaââed.",
            "verse 73:19": "Atan wagi d asmekti; win iôe$ben ad iawi abrid ar Mass is.",
            "verse 73:20": "Ih, Iéôa Mass ik, keçç akked urbaâ seg wid illan yidek, teppekkrem deg iv, qôib sin imuren, ne$ azgen, ne$ amur wis kué. Öebbi Iwezzen iv akked wass; Iéôa ur ten têepbem ara. Issuref awen. E$ôet, si Leqwôan, ayen isehlen fellawen. Iéôa ad ilin segwen imuvan. Wiyav ppinigen di tmurt, pnadin lfevl n Öebbi. Wiyav pna$en deg ubrid n Öebbi. Ihi, e$ôet, segs, ayen isehlen fellawen; éallet; zekkit; ôevlet aS i Öebbi, aôeîîal umâin. Lxiô ara txedmem i iman nnwen, a t tafem ar Öebbi. D arraz it yifen, it i$elben. Ssutret ssmaê i Öebbi. Ih, Öebbi Ipsemmiê, Ipêunu."
        },
        "Bosnian": {
            "verse 73:1": "O ti, umotani! –",
            "verse 73:2": "probdij noć, osim maloga dijela;",
            "verse 73:3": "polovinu njezinu ili malo manje od nje;",
            "verse 73:4": "ili malo više od nje, i izgovaraj Kur'an pažljivo,",
            "verse 73:5": "Mi ćemo ti, doista, teške riječi slati –",
            "verse 73:6": "ta ustajanje noću, zaista, jače djeluje i izgovara se jasnije,",
            "verse 73:7": "a ti danju, doista, imaš mnogo posla.",
            "verse 73:8": "I spominji ime Gospodara svoga i Njemu se potpuno posveti –",
            "verse 73:9": "On je Gospodar istoka i zapada, nema boga osim Njega, i Njega uzmi za zaštitnika!",
            "verse 73:10": "I otrpi ono što oni govore i izbjegavaj ih na prikladan način,",
            "verse 73:11": "a Mene ostavi onima koji te u laž ugone, koji raskošno žive i daj im malo vremena;",
            "verse 73:12": "biće u Nas, doista, okova i ognja,",
            "verse 73:13": "i jela koje u grlu zastaje, i patnje nesnosne",
            "verse 73:14": "na Dan kada se Zemlja i planine zatresu, i planine – pješčani humci razbacani postanu.",
            "verse 73:15": "Mi smo vam, zaista, poslali Poslanika da bi svjedočio protiv vas isto onako kao što smo i faraonu poslanika poslali,",
            "verse 73:16": "ali faraon nije poslušao poslanika, pa smo ga teškom kaznom kaznili.",
            "verse 73:17": "Kako ćete se, ako ostanete nevjernici, sačuvati Dana koji će djecu sijedom učiniti?!",
            "verse 73:18": "Nebo će se toga dana rascijepiti, prijetnja Njegova će se ispuniti.",
            "verse 73:19": "To je, doista, pouka; i ko hoće, put ka Gospodaru svome će izabrati.",
            "verse 73:20": "Gospodar tvoj, sigurno, zna da ti u molitvi provodiš manje od dvije trećine noći, polovinu njezinu ili trećinu njezinu, a i neki od onih koji su uz tebe. Allah određuje dužinu noći i dana, On zna da vi to ne umijete izračunati pa vam prašta, a vi iz Kur'ana učite ono što je lahko; On zna da će među vama biti bolesnih, i onih koji će po svijetu putovati i Allahove blagodati tražiti, i onih koji će se na Allahovu putu boriti – zato izgovarajte iz njega ono što vam je lahko, i molitvu obavljajte, i milostinju udjeljujte, i draga srca Allahu zajam dajte! A dobro koje za sebe unaprijed osigurate naći ćete kod Allaha još većim i dobićete još veću nagradu. I molite Allaha da vam oprosti, jer Allah prašta i milostiv je."
        },
        "Bulgarian": {
            "verse 73:1": "О, ти, който се загръщаш,",
            "verse 73:2": "ставай [за молитва] през нощта, но не цялата,",
            "verse 73:3": "а наполовина, или по-малко от това,",
            "verse 73:4": "или повече, и чети Корана отмерено!",
            "verse 73:5": "Ще ти пратим Ние тежко Слово.",
            "verse 73:6": "Ставането [за молитва] нощем е най-силно по въздействие и най-подходящо за размисъл.",
            "verse 73:7": "През деня ти си много зает.",
            "verse 73:8": "И споменавай името на своя Господ, и с всеотдайност се посвети на Него -",
            "verse 73:9": "Господа на Изтока и на Запада! Няма друг Бог освен Него. Него вземи за покровител!",
            "verse 73:10": "И бъди търпелив към онова, което говорят! И ги напускай с достойнство!",
            "verse 73:11": "И остави на Мен отричащите, които живеят в благоденствие, и им дай малка отсрочка!",
            "verse 73:12": "При Нас има окови и пламъци,",
            "verse 73:13": "и храна, която присяда, и болезнено мъчение",
            "verse 73:14": "в Деня, в който ще се разтресат земята и планините, и ще станат планините купища от пясък.",
            "verse 73:15": "Изпратихме ви Пратеник - свидетел за вас, както изпратихме при Фараона пратеник.",
            "verse 73:16": "Но възпротиви се Фараонът на пратеника, и затова силно го сграбчихме.",
            "verse 73:17": "И как ще се предпазите, ако сте неверници, от Деня, който ще направи и децата да посивеят?",
            "verse 73:18": "Небето тогава ще се разцепи. Обещанието Му се сбъдва.",
            "verse 73:19": "Това е напомняне. Който желае, поема пътя към своя Господ.",
            "verse 73:20": "Твоят Господ знае, че стоиш по-малко от две трети от нощта, [понякога] и половината от нея, а [понякога] и една трета, - и група от тези, които са заедно с теб. Аллах отмерва нощта и деня. Знае Той, че не ще смогнете и затова ви помилва. Ето защо четете,"
        },
        "Chinese": {
            "verse 73:1": "披衣的人啊！",
            "verse 73:2": "你应当在夜间礼拜，除开不多的时间，",
            "verse 73:3": "半夜或少一点，",
            "verse 73:4": "或多一点。你应当讽诵《古兰经》，",
            "verse 73:5": "我必定以庄严的言辞授予你，",
            "verse 73:6": "夜间的觉醒确是更适当的；夜间的讽诵确是更正确的。",
            "verse 73:7": "你在白天忙於事务，",
            "verse 73:8": "故你应当纪念你的主的尊名，你应当专心致志地敬事他。",
            "verse 73:9": "他是东方和西方的主，除他之外，绝无应受崇拜的，故你应当以他为监护者。",
            "verse 73:10": "你应当忍受他们所说的谰言，而温和地退避他们。",
            "verse 73:11": "你让我处治享受安乐而否认真理的人们吧！你稍稍地宽待他们吧！",
            "verse 73:12": "我那里确有沉重的镣和强烈的火，",
            "verse 73:13": "有噎人的食物，和痛苦的刑罚。",
            "verse 73:14": "在那日，天地和山峦都要震动，而山峦将要变成一堆散沙。",
            "verse 73:15": "我确已派遣一个使者来教化你们，而且对你们作证，犹如我曾派遣一个使者去教化法老一样。",
            "verse 73:16": "但法老违抗了那个使者，故我严厉地惩治了他。",
            "verse 73:17": "如果你们不信道，那末，你们怎么防备那将使儿童白发苍苍的日子呢？",
            "verse 73:18": "天将为那日而破裂，真主的应许要实现的。",
            "verse 73:19": "这确是一种教训。谁愿意觉悟，谁可以选择一条通达主的道路。",
            "verse 73:20": "你的主的确知道你礼拜的时间，不到全夜的三分之二，或二分之一，或三分之一。你的同道中，有一群人也是那样做的。真主预定黑夜和白昼的长度，他知道你们不能计算它，故赦宥你们。你们应当诵《古兰经》中简易的（文辞）。他知道你们中将有一些病人，和别的许多人，或旅行四方，寻求真主的恩惠；或为真主而作战，故你们应当讽诵其中简易的（文辞）。你们应当谨守拜功，完纳天课，并以善债借给真主。你们为自己做什么善事，都将在真主那里得到更好更大的报酬。你们应当向真主求饶，真主是至赦的，是至慈的。"
        },
        "Danish": {
            "verse 73:1": "O, gij die u omwikkelt",
            "verse 73:2": "Sta op in de nacht voor korte tijd",
            "verse 73:3": "De helft er van of minder dan dat",
            "verse 73:4": "Of maak het iets langer - en zeg de Koran duidelijk en aandachtig op",
            "verse 73:5": "Waarlijk, Wij dragen u een gewichtig Woord op",
            "verse 73:6": "Voorwaar, des nachts opstaan is de zekerste weg en geeft het Woord krachtige uitwerking",
            "verse 73:7": "Gij hebt inderdaad gedurende de dag langdurige bezigheden",
            "verse 73:8": "Daarom gedenk de naam van uw Heer, en geef u met volle toewijding aan Hem over",
            "verse 73:9": "Hij is de Heer van het Oosten en het Westen, er is geen andere God naast Hem; neem Hem daarom tot uw Beschermer",
            "verse 73:10": "En verdraag met geduld alles wat zij (de ongelovigen) zeggen; en verlaat hen op gepaste wijze",
            "verse 73:11": "En laat Mij alleen met degenen die loochenen, de bezitters van rijkdom en geef hun een wijle uitstel",
            "verse 73:12": "Voorzeker, bij Ons zijn zware boeien en een laaiend Vuur",
            "verse 73:13": "En voedsel dat verstikt, en pijnlijke straf",
            "verse 73:14": "Er zal een Dag komen waarop de aarde en de bergen zullen beven, en de bergen in een hoop mul zand zullen veranderen",
            "verse 73:15": "Waarlijk, Wij hebben tot u een boodschapper gezonden, die een getuige tegen u is, geljik Wij een boodschapper tot Pharao zonden",
            "verse 73:16": "Maar Pharao gehoorzaamde de boodschapper niet, daarom grepen Wij hem met een verschrikkelijke greep aan",
            "verse 73:17": "Hoe zult gij u, indien gij het ware geloof verwerpt, beveiligen voor de Dag, waarop de kinderen grijze haren zullen krijgen (van schrik)",
            "verse 73:18": "En waarbij de hemel uiteen zi splijten, en Zijn belofte zal worden vervuld",
            "verse 73:19": "Dit is zeker een vermaning. Dus moge hij die wil, de weg tot zijn Heer inslaan",
            "verse 73:20": "Waarlijk uw Heer weet dat gij bijna twee-derde van de nacht staat (te bidden), somsdehelft of ook wel een derde er van, en eveneens doet dit een deel van degenen die met u zijn. En Allah bepaalt de maat van dag en nacht. Hij weet, dat gij het niet kunt volhouden, en daarom heeft Hij Zich in barmhartigheid tot u gewend. Zegt dan zoveel van de Koran op als u gemakkelijk valt. Hij weet dat er enigen onder u ziek kunnen zijn, en anderen op reis door het land trekken, zoekende naar Allah`s genade, en weer anderen strijdend voor Allah`s zaak. Zegt er dus zoveel van (de Koran) op, als u gemakkelijk valt en onderhoudt het gebed, en betaalt de Zakaat, en sluit met Allah een goede lening. En wat goeds gij voor u uitzendt, gij zult betere en grotere beloning bij Allah vinden. En zoekt vergiffenis van Allah, voorwaar, Allah is Vergevensgezind, Genadevol"
        },
        "Dutch": {
            "verse 73:1": "O jij omhulde.",
            "verse 73:2": "Sta op in de nacht om de shalât te verrichten, met uitzondering van een kort gedeelte (van de nacht).",
            "verse 73:3": "De helft ervan of iets minder dan dat.",
            "verse 73:4": "Of maak het iets langer en draag de Koran voor, nauwkeurig.",
            "verse 73:5": "Voorwaar, Wij zullen zware Woorden tot jou neerzenden.",
            "verse 73:6": "Voorwaar, het opstaan in de nacht (om te bidden) is zwaarder en maakt het woord zekerder.",
            "verse 73:7": "Voorwaar, jij bent overdag belast met vele aangelegenheden.",
            "verse 73:8": "En gedenk de Naam van jouw Heer en wijd je geheel aan Hem.",
            "verse 73:9": "De Heer van de opgang (van de zon etc.) en de ondergang, geen god is er dan Hij, neem Hem daarom als Beschermer.",
            "verse 73:10": "En wees geduldig met wat zij zeggen en houd op gepaste wijze afstand van hen.",
            "verse 73:11": "En Laat de loochenaars, de bezitters van weelde, aan Mij over, en geef hen nog even uitstel.",
            "verse 73:12": "Voorwaar, bij Ons bevinden zich (voor hen) ketenen en Djahim (de Hel).",
            "verse 73:13": "En voedsel dat in de keel blijft steken en een pijnlijke bestraffing.",
            "verse 73:14": "Op de Dag waarop de aarde en de bergen heftig zullen beven en de bergen tot uit elkaar geblazen stof zullen worden.",
            "verse 73:15": "Voorwaar, Wij hebben een Boodschapper tot jullie gezonden als getuige over jullie, zoals Wij tot Fir'aun een Boodschapper zonden.",
            "verse 73:16": "Toen was Fir'aun de Boodschapper ongehoorzaam, waarop Wij hem grepen met een verschrikkelijke greep.",
            "verse 73:17": "Hoe zullen jullie je dan beschermen, als jullie de Dag waarop de kinderen grijsaards worden ontkennen?",
            "verse 73:18": "De hemel zal dan gespleten zijn (en) Zijn aanzegging zal zeker uitgevoerd worden.",
            "verse 73:19": "Voorwaar, dit is een Vermaning en wie wil, laat hem een Weg nemen naar zijn Heer.",
            "verse 73:20": "Voorwaar, jouw Heer weet dat jij bijna tweederde van de nacht, of de helft of een derde (in gebed) staat, en (ook) een groep van degenen die bij jou horen. En Allah kent de nacht en de dag. Hij weet dat jullie nooit (de hele nacht) de shalât kunnen verrichten, daarom heeft Hij jullie berouw aanvaard. Verricht van het nachtgebed wat gemakkelijk is voor jullie. Hij weet dat er onder jullie zieken zijn en anderen die door het land reizen, zoekend naar de gunst van Allah, en anderen die strijden op de Weg van Allah. En verricht van het nachtgebed wat gemakkelijk is voor jullie. En onderhoudt de shalât en geeft de zakât en leent aan Allah een goede lening. En wat jullie vooruitzenden voor julliezelf aan goede daden, jullie zullen het bij Allah aantreffen. Het is een betere en grotere beloning. En vraagt Allah om vergeving. Voorwaar, Allah is Vergevensgezind, Meest Barmhartig."
        },
        "English": {
            "verse 73:1": "O you who wraps himself [in clothing],",
            "verse 73:2": "Arise [to pray] the night, except for a little -",
            "verse 73:3": "Half of it - or subtract from it a little",
            "verse 73:4": "Or add to it, and recite the Qur'an with measured recitation.",
            "verse 73:5": "Indeed, We will cast upon you a heavy word.",
            "verse 73:6": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.",
            "verse 73:7": "Indeed, for you by day is prolonged occupation.",
            "verse 73:8": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
            "verse 73:9": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.",
            "verse 73:10": "And be patient over what they say and avoid them with gracious avoidance.",
            "verse 73:11": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
            "verse 73:12": "Indeed, with Us [for them] are shackles and burning fire",
            "verse 73:13": "And food that chokes and a painful punishment -",
            "verse 73:14": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
            "verse 73:15": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
            "verse 73:16": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
            "verse 73:17": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?",
            "verse 73:18": "The heaven will break apart therefrom; ever is His promise fulfilled.",
            "verse 73:19": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
            "verse 73:20": "Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful."
        },
        "Filipino": {
            "verse 73:1": "o ikaw na nababalutan ng kasuotan (alalaong baga, si Propeta Muhammad)",
            "verse 73:2": "Tumindig ka (sa pananalangin) sa buong magdamag, maliban sa kaunting oras lamang",
            "verse 73:3": "Sa kalahati nito (ng magdamag), o kulang pa rito",
            "verse 73:4": "o humigit pa rito; at iyong dalitin ang Qur’an (nang malakas) sa marahan at matimyas na pagbigkas",
            "verse 73:5": "Katotohanan na Aming ipapanaog sa iyo ang isang mayamang Pahayag (at Tagubilin sa mga batas, katungkulan, atbp)",
            "verse 73:6": "Katotohanan, ang iyong pagbangon sa gabi (Tahajjud na panalangin) ay siyang oras na napakahirap (datapuwa’t) mabisa at mainam sa pamamatnubay ng (iyong kaluluwa), at pinakaangkop sa (pang-unawa) sa Salita (ni Allah)",
            "verse 73:7": "Katotohanang nasa iyo sa maghapon (sa liwanag ng araw) ang paghanap ng iyong ikabubuhay at pagganap sa mga pangkaraniwang gawain",
            "verse 73:8": "At lagi mong alalahanin ang Pangalan ng iyong Panginoon at ibuhos mo ang iyong pansin sa Kanya nang ganap at taimtim",
            "verse 73:9": "Tanging Siya 918 (lamang) ang Panginoon ng Silangan at Kanluran. La ilaha illa Allah (wala ng iba pang diyos na karapat-dapat pag- ukulan ng pagsamba maliban kay Allah). Kaya’t panaligan mo lamang Siya bilang iyong wakil (tagapamahala ng iyong kapakanan)",
            "verse 73:10": "At maging matiyaga (o Muhammad) sa kanila (na hindi sumasampalataya) sa kanilang sinasabi, at lumayokasakanilasamabutingparaan",
            "verse 73:11": "Atiyonghayaanna Ako (ang tanging) makitungo sa mga bulaan (na nagtatatwa ng Aking mga Talata, atbp.), at sila na naghahawak ng mga mabubuting bagay sa buhay. At iyong bigyan sila ng palugit sa maigsing panahon",
            "verse 73:12": "Katotohanan! Nasa Amin ang mga panggapos (na magtatali sa kanila) at Nag-aalimpuyong Apoy (na tutupok sa kanila)",
            "verse 73:13": "At pagkain na babalalak sa kanilang lalamunan (na nakakabunsol) at Kasakit-sakit na Kaparusahan",
            "verse 73:14": "Sa Araw na ang kalupaan at kabundukan ay mayayanig nang matindi, at ang kabundukan ay magiging pinong tumpok ng buhangin na bumubuhos at umaagos nang pababa",
            "verse 73:15": "Katotohanan! Kami ay nagsugo sa inyo (O mga tao) ng isang Tagapagbalita (Muhammad) na magiging saksi sa harapan ninyo, kung paano Kami nagsugo ng isang Tagapagbalita (Moises) kay Paraon",
            "verse 73:16": "Datapuwa’t si Paraon ay sumuway sa Aming Tagapagbalita (Moises), kaya’t Aming sinakmal siya ng matinding kaparusahan",
            "verse 73:17": "Kaya’t paano ninyo iiwasan ang kaparusahan kung kayo ay walang paniniwala (kay Allah), sa Araw na ang mga bata ay magiging lanta (sa kulay na pilak ng kanilang buhok) sa (Araw ng Muling Pagkabuhay)",
            "verse 73:18": "Na roon ang kalangitan ay mawawarak? Ang Kanyang pangako ay katiyakang matutupad",
            "verse 73:19": "Katotohanan! Ito ay isang Paala-ala (at Tagubilin). Kaya’t sinuman ang magnais, hayaan siyang tumahak sa tuwid na landas patungo sa kanyang Panginoon",
            "verse 73:20": "Katotohanan! Ang iyong Panginoon ay nakakabatid na ikaw ay nagpupuyat sa pananalangin (sa kahabaan ng gabi), ng maigsi sa dalawang katlo (2/3) ng gabi, o kalahati (1/2) ng gabi, o isang katlo (1/3) ng gabi, gayundin naman ang isang pangkat na iyong kasama-sama. At si Allah ang nagtalaga (sa inyo) ng Gabi at Araw sa ganap na sukat. Talastas Niya na ikaw ay hindi makakapanalangin sa buong magdamag, kaya’t Siya ay naggawad sa iyo ng Kanyang Habag. Kaya’t iyong ipagsaysay ang Qur’an sa iyong makakaya, sa paraan na magaan sa iyo. Talastas Niya na mayroong ilan sa inyo ang may sakit, at ang iba naman ay naglalakbay sa kalupaan sa paghahanap ng (saganang) Biyaya ni Allah, at ang iba ay nakikipaglaban tungo sa Kapakanan ni Allah. Kaya’t iyong ipagsaysay ang Qur’an sa iyong makakaya, sa paraang magaan sa iyo, at ikaw ay mag-alay ng pang-araw-araw na panalangin (Iqamat-as-Salah) nang mahinusay, at magbigay ng Zakah (katungkulang kawanggawa), at magpautang kay Allah ng isang Magandang Pautang (alalaong baga, gumugol sa Kapakanan ni Allah). At anumang mabuting bagay ang inyong ipinadala patungkol sa inyong kaluluwa (mga gawa ng pagsamba tulad ng pagdarasal, kawanggawa, pag-aayuno, Hajj, Umra, atbp.) ay katiyakang matatagpuan ninyo ito sa harapan ni Allah. Katotohanan! Ito ay mainam at sagana sa kabayaran ng gantimpala. At inyong paghanapin ang Biyaya (at Pagpapatawad) ni Allah. Katotohanang si Allah ay Lagi nang Nagpapatawad, ang Lubos na Mahabagin. 920 siyA nA nABABAlutAn"
        },
        "French": {
            "verse 73:1": "O toi, l'enveloppé [dans tes vêtements]!",
            "verse 73:2": "Lève-toi [pour prier], toute la nuit, excepté une petite partie;",
            "verse 73:3": "Sa moitié, ou un peu moins;",
            "verse 73:4": "ou un peu plus. Et récite le Coran, lentement et clairement.",
            "verse 73:5": "Nous allons te révéler des paroles lourdes (très importantes).",
            "verse 73:6": "La prière pendant la nuit est plus efficace et plus propice pour la récitation.",
            "verse 73:7": "Tu as, dans la journée, à vaquer à de longues occupations.",
            "verse 73:8": "Et rappelle-toi le nom de ton Seigneur et consacre-toi totalement à Lui,",
            "verse 73:9": "le Seigneur du Levant et du Couchant. Il n'y a point de divinité à part Lui. Prends-Le donc comme Protecteur.",
            "verse 73:10": "Et endure ce qu'ils disent; et écarte-toi d'eux d'une façon convenable.",
            "verse 73:11": "Et laisse-moi avec ceux qui crient au mensonge et qui vivent dans l'aisance; et accorde-leur un court répit:",
            "verse 73:12": "Nous avons [pour eux] lourdes chaînes et Enfer,",
            "verse 73:13": "et nourriture à faire suffoquer, et châtiment douloureux.",
            "verse 73:14": "Le jour où la terre et les montagnes trembleront, tandis que les montagnes deviendront comme une dune de sable dispersée.",
            "verse 73:15": "Nous vous avons envoyé un Messager pour être témoin contre vous, de même que Nous avions envoyé un Messager à Pharaon.",
            "verse 73:16": "Pharaon désobéit alors au Messager. Nous le saisîmes donc rudement.",
            "verse 73:17": "Comment vous préserverez-vous, si vous mécroyez, d'un jour qui rendra les enfants comme des vieillards aux cheveux blancs?",
            "verse 73:18": "[et] durant lequel le ciel se fendra. Sa promesse s'accomplira sans doute.",
            "verse 73:19": "Ceci est un rappel. Que celui qui veut prenne une voie [menant] à son Seigneur.",
            "verse 73:20": "Ton Seigneur sait, certes, que tu (Muhammad) te tiens debout moins de deux tiers de la nuit, ou sa moitié, ou son tiers. De même qu'une partie de ceux qui sont avec toi. Allah détermine la nuit et le jour. Il sait que vous ne saurez jamais passer toute la nuit en prière. Il a usé envers vous avec indulgence. Récitez donc ce qui [vous] est possible du Coran. Il sait qu'il y aura parmi vous des malades, et d'autres qui voyageront sur la terre, en quête de la grâce d'Allah, et d'autres encore qui combattront dans le chemin d'Allah. Récite-en donc ce qui [vous] sera possible. Accomplissez la Salât, acquittez la Zakât, et faites à Allah un prêt sincère. Tout bien que vous vous préparez, vous le retrouverez auprès d'Allah, meilleur et plus grand en fait de récompense. Et implorez le pardon d'Allah. Car Allah est Pardonneur et Très Miséricordieux."
        },
        "Fulah": {
            "verse 73:1": "Ko an yo buumorɗo [comci mun]",
            "verse 73:2": "Ɓaŋo (wuurnitaa) jemma on, si wanaa seeɗa [e makko]",
            "verse 73:3": "feccere makko, maa ɗuytaa seeɗa e ɗum",
            "verse 73:4": "maa ɓeydaa ɗon. Janngiraa Alqur`aanaare nden rewnindiral",
            "verse 73:5": "Meɗen saatii tellinnde e maaɗa konngol teddungol",
            "verse 73:6": "Pellet, ko dewal tummbo jemma ngal, ɓuri tiiɗude batte e fooccaade konngol",
            "verse 73:7": "Anndu hino woodan-maa e ñalorma on, ferlitagol juutungol",
            "verse 73:8": "Janto innde Joomi maa nden, taƴo-ɗaa yahaa e Makko hattirde taƴagol",
            "verse 73:9": "Jeyɗo On fuɗnaange e hiirnaange.Reweteeɗo woo alaa e si nwona Kanko,Jogito Mo hoolorteeɗo",
            "verse 73:10": "Muñño e ko ɓe wowlata kon; woɗɗito-raa ɓe woɗɗitannde labaande",
            "verse 73:11": "Accidam e fennooɓe joomiraaɓe neemaaji ɓen; habbito-ɗaa ɓe seeɗa",
            "verse 73:12": "Ko pellet, hino ka Amen gaa : Tonngii e Jahiimi",
            "verse 73:13": "e ñaametee ɗeɗɗoowo, e lette muusuɗe",
            "verse 73:14": "Ñalnde leydi ndin e pelle ɗen dillata, pelle ɗen wa’a wa njaare ilayndi",
            "verse 73:15": "Min nelii e mon nelaaɗo haa o wona seede e dow mon hono no Min nelduno faade e Fir*awna Nelaaɗo",
            "verse 73:16": "Fir*awna woopi nelaaɗo O Min nanngi mbo nanngugol cattungol",
            "verse 73:17": "Hono ndeenraton pittaali mon si on yeddi ñalawmo baɗoowo sukaaɓe danndalinde",
            "verse 73:18": "Kammu o na fetti e kulhuli hembo laatiima fodoore Alla ko wonoore",
            "verse 73:19": "Ko oon woni waaju goongo kala faalaaɗo daɗde nanngira joomiiko ruttorde",
            "verse 73:20": "Pellet joom Ma na anndi haɗa juula ko ɓuri famɗude e tataɓal jemma wollo feccere mammbo wondude e fedde e ɓeen wonduɓe e Ma Alla hoddira jemma e ñalawma O anndi on tonngataa mbo O yaafii mon, njannge ko newanii on e Quraana hombo anndi ma won e mon ñawɓe goo ngona e ɗatngal ka leydi hoɓe ndaarta ɓural Alla woɓɓe kadi na kaɓano laawol Alla njannge ko newanii mon e hembo ndarnon juulde tottiron askal ñamlon Alla ñamaande moƴƴere kala ko mbaɗaɗon ko*e mon e jam tawon mbo ka Alla hombo ɓuri moƴƴude e mawnude njobdi njaafnee Alla sabu Alla ko jaafatooɗo ko jurmotooɗo"
        },
        "German": {
            "verse 73:1": "O du Eingehüllter,",
            "verse 73:2": "steh (zum Gebet) die (ganze) Nacht auf- bis auf einen kleinen Teil,",
            "verse 73:3": "ihre Hälfte, oder verringere sie um einen kleinen Teil",
            "verse 73:4": "oder füge etwas hinzu. Und trage den Qur'an wohlgeordnet vor.",
            "verse 73:5": "Gewiß, Wir werden dir gewichtige Worte offenbaren.",
            "verse 73:6": "Das Aufstehen in der Nacht hat stärkeren Einfluß (auf die Seele) und bringt eher aufklärende Worte.",
            "verse 73:7": "Du hast ja am Tage lange Zeit für Beschäftigung.",
            "verse 73:8": "Und gedenke des Namens deines Herrn und widme dich Ihm ganz allein.",
            "verse 73:9": "(Er ist) der Herr des Ostens und des Westens. Es gibt keinen Gott außer Ihm. So nimm Ihn dir zum Sachwalter.",
            "verse 73:10": "Und ertrage standhaft, was sie sagen, und meide sie auf schöne Weise.",
            "verse 73:11": "Und lasse Mich (allein) mit den Leugnern (der Botschaft), die ein angenehmes Leben haben, und lasse ihnen noch kurze Zeit.",
            "verse 73:12": "Gewiß, bei Uns gibt es schwere Fesseln und einen Höllenbrand",
            "verse 73:13": "und Speise, die im Hals Würgen hervorruft, und schmerzhafte Strafe",
            "verse 73:14": "am Tag, da die Erde und die Berge zittern und die Berge ein zerrinnender Sandhügel sein werden.",
            "verse 73:15": "Wir haben zu euch ja einen Gesandten als Zeugen über euch gesandt, so wie Wir zu Fir'aun einen Gesandten sandten.",
            "verse 73:16": "Es widersetzte sich Fir'aun dem Gesandten. Da ergriffen Wir ihn mit hartem Griff.",
            "verse 73:17": "Wie wollt ihr euch denn, wenn ihr ungläubig seid, vor einem Tag bewahren, der die Kinder weißhaarig (wie Greise) macht?",
            "verse 73:18": "Der Himmel wird an ihm zerbrechen. Sein Versprechen wird ausgeführt.",
            "verse 73:19": "Gewiß, dies ist eine Erinnerung; wer nun will, (der) nimmt (so diesen) einen Weg zu seinem Herrn.",
            "verse 73:20": "Gewiß, dein Herr weiß, daß du etwas weniger als zwei Drittel der Nacht (zum Gebet) aufstehst, oder die Hälfte oder ein Drittel davon, und (ebenso) ein Teil von denjenigen, die mit dir sind. Und Allah setzt das Maß der Nacht und des Tages fest. Er weiß, daß ihr es nicht erfassen würdet'. Da wandte Er Sich euch zu und erließ es euch. So lest (bei Nacht), was euch vom Qur'an leichtfällt. Er weiß, daß es unter euch Kranke geben wird und andere, die im Land umherreisen, wo sie nach (etwas) von Allahs Huld trachten, und (wieder) andere, die auf Allahs Weg kämpfen. So lest davon, was euch leichtfällt, und verrichtet das Gebet und entrichtet die Abgabe und gebt Allah ein gutes Darlehen. Und was ihr für euch selbst an Gutem vorausschickt, das werdet ihr noch besser und großartiger belohnt bei Allah finden. Und bittet Allah um Vergebung. Gewiß, Allah ist Allvergebend und Barmherzig."
        },
        "Hausa": {
            "verse 73:1": "Yã wanda ya lulluɓe!",
            "verse 73:2": "Ka tsayu domin yin salla a cikin dare (duka) fãce kaɗan.",
            "verse 73:3": "Rabinsa, ko ka rage abu kaɗan daga gare shi.",
            "verse 73:4": "Ko ka ƙara kansa kuma ka kyautata karanta Alƙu'ãni, daki daki.",
            "verse 73:5": "Lalle ne, Mũ, zã Mu jẽfa maka magana mai nauyi.",
            "verse 73:6": "Lalle ne, tashin dare shi ne mafi tsananin natsuwa, kuma mafi daidaituwa ga magana.",
            "verse 73:7": "Lalle ne, kanã da, a cikin yini, wani tasĩhi mai tsawo.",
            "verse 73:8": "Kuma ka ambaci sũnan Ubangijinka, kuma ka yanke (ƙauna daga kowa ka koma) zuwa gare Shi, yankewa.",
            "verse 73:9": "Shi ne Ubangijin mafitar rãnã da mafãɗarta, bãbu abin bautawa fãce Shi. Sabõda haka ka riƙe Shi wakili.",
            "verse 73:10": "Kuma ka yi haƙuri ga abin da suke faɗã, kuma ka ƙaurace musu, ƙauracẽwa mai kyãwo.",
            "verse 73:11": "Kuma ka bar Ni da mãsu ƙaryatãwa, mawadãta, kuma ka jinkirta musu kaɗan.",
            "verse 73:12": "Lalle ne, a wurinMu, akwai wasu marũruwa mãsu nauyi da Jahĩm.",
            "verse 73:13": "Da wani abinci mai mãƙara da azãba mai raɗaɗi.",
            "verse 73:14": "Rãnar da ƙasa ke raurawa, da duwãtsu kuma duwãtsu su kasance tudun rairayi mai malãlã.",
            "verse 73:15": "Lalle ne, Mũ. Mun aika zuwa gare ku, wani Manzo mai shaida a kanku, kamar yadda Muka aika wani Manzo zuwaga Fir'auna,",
            "verse 73:16": "Sai Fir'auna ya saɓa wa Manzon, saboda haka Muka kãma shi kãmu mai tsanani.",
            "verse 73:17": "To, yãya, idan kun kãfirta, zã ku kãre (azabar) wani yini mai mayar da yãra (tsofaffi) mãsu hurhura.",
            "verse 73:18": "Sama za ta tsãge a cikinsa, wa'adinsa yã kasance mai aukuwa.",
            "verse 73:19": "Lalle ne, wannan wata tunãtarwa ce, sai dai wanda ya so, ya kãma hanyar ƙwarai zuwa ga Ubangijinsa.",
            "verse 73:20": "Lalle ne, Ubangijinka Yã sani cẽwa, kai kana tsayuwa a kusan kashi biyu daga uku na dare, da rabinsa, da sulusinsa, tãre da wani ɓangare na waɗanda ke tãre da kai. Allah Yake iya ƙaddara dare da yini, Ya san bã zã ku iya lissafa shi ba, sabõda haka Ya karɓi tubarku sai, ku karanta abin da ya sauƙaƙa na Alƙur'ãni. Ya san wasu daga cikinku, zã su yi cĩwo, kuma wasu zã su yi tafiya cikin ƙasa suna nẽman falalar Allah da fatauci, kuma wasu zã su yi yãƙi a cikin banyar Allah. Sabõda haka ku karanta abin da ya sauƙaƙa daga gare shi, kuma ku tsai da salla kuma ku bãyar da zakka, kumaa ku bai wa Allah rance, rance mai kyãwo. Kuma abin da kuka gabatar dõmin kanku, na alhẽri, zã ku sãme shi a wurin Allah zai kasance mafifici (daga wanda kuka ajiye) kuma zai fi girma ga sakamako, kuma ku rõƙi Allah gãfara; lalle ne Allah Mai gãfara ne, Mai jin ƙai."
        },
        "Hindi": {
            "verse 73:1": "ऐ (मेरे) चादर लपेटे रसूल",
            "verse 73:2": "रात को (नमाज़ के वास्ते) खड़े रहो मगर (पूरी रात नहीं)",
            "verse 73:3": "थोड़ी रात या आधी रात या इससे भी कुछ कम कर दो या उससे कुछ बढ़ा दो",
            "verse 73:4": "और क़ुरान को बाक़ायदा ठहर ठहर कर पढ़ा करो",
            "verse 73:5": "हम अनक़रीब तुम पर एक भारी हुक्म नाज़िल करेंगे इसमें शक़ नहीं कि रात को उठना",
            "verse 73:6": "ख़ूब (नफ्स का) पामाल करना और बहुत ठिकाने से ज़िक्र का वक्त है",
            "verse 73:7": "दिन को तो तुम्हारे बहुत बड़े बड़े अशग़ाल हैं",
            "verse 73:8": "तो तुम अपने परवरदिगार के नाम का ज़िक्र करो और सबसे टूट कर उसी के हो रहो",
            "verse 73:9": "(वही) मशरिक और मग़रिब का मालिक है उसके सिवा कोई माबूद नहीं तो तुम उसी को कारसाज़ बनाओ",
            "verse 73:10": "और जो कुछ लोग बका करते हैं उस पर सब्र करो और उनसे बा उनवाने शाएस्ता अलग थलग रहो",
            "verse 73:11": "और मुझे उन झुठलाने वालों से जो दौलतमन्द हैं समझ लेने दो और उनको थोड़ी सी मोहलत दे दो",
            "verse 73:12": "बेशक हमारे पास बेड़ियाँ (भी) हैं और जलाने वाली आग (भी)",
            "verse 73:13": "और गले में फँसने वाला खाना (भी) और दुख देने वाला अज़ाब (भी)",
            "verse 73:14": "जिस दिन ज़मीन और पहाड़ लरज़ने लगेंगे और पहाड़ रेत के टीले से भुर भुरे हो जाएँगे",
            "verse 73:15": "(ऐ मक्का वालों) हमने तुम्हारे पास (उसी तरह) एक रसूल (मोहम्मद) को भेजा जो तुम्हारे मामले में गवाही दे जिस तरह फिरऔन के पास एक रसूल (मूसा) को भेजा था",
            "verse 73:16": "तो फिरऔन ने उस रसूल की नाफ़रमानी की तो हमने भी (उसकी सज़ा में) उसको बहुत सख्त पकड़ा",
            "verse 73:17": "तो अगर तुम भी न मानोगे तो उस दिन (के अज़ाब) से क्यों कर बचोगे जो बच्चों को बूढ़ा बना देगा",
            "verse 73:18": "जिस दिन आसमान फट पड़ेगा (ये) उसका वायदा पूरा होकर रहेगा",
            "verse 73:19": "बेशक ये नसीहत है तो जो शख़्श चाहे अपने परवरदिगार की राह एख्तेयार करे",
            "verse 73:20": "(ऐ रसूल) तुम्हारा परवरदिगार चाहता है कि तुम और तुम्हारे चन्द साथ के लोग (कभी) दो तिहाई रात के करीब और (कभी) आधी रात और (कभी) तिहाई रात (नमाज़ में) खड़े रहते हो और ख़ुदा ही रात और दिन का अच्छी तरह अन्दाज़ा कर सकता है उसे मालूम है कि तुम लोग उस पर पूरी तरह से हावी नहीं हो सकते तो उसने तुम पर मेहरबानी की तो जितना आसानी से हो सके उतना (नमाज़ में) क़ुरान पढ़ लिया करो और वह जानता है कि अनक़रीब तुममें से बाज़ बीमार हो जाएँगे और बाज़ ख़ुदा के फ़ज़ल की तलाश में रूए ज़मीन पर सफर एख्तेयार करेंगे और कुछ लोग ख़ुदा की राह में जेहाद करेंगे तो जितना तुम आसानी से हो सके पढ़ लिया करो और नमाज़ पाबन्दी से पढ़ो और ज़कात देते रहो और ख़ुदा को कर्ज़े हसना दो और जो नेक अमल अपने वास्ते (ख़ुदा के सामने) पेश करोगे उसको ख़ुदा के हाँ बेहतर और सिले में बुर्ज़ुग तर पाओगे और ख़ुदा से मग़फेरत की दुआ माँगो बेशक ख़ुदा बड़ा बख्शने वाला मेहरबान है"
        },
        "Indonesian": {
            "verse 73:1": "Hai orang yang berselimut (Muhammad),",
            "verse 73:2": "bangunlah (untuk sembahyang) di malam hari, kecuali sedikit (daripadanya),",
            "verse 73:3": "(yaitu) seperduanya atau kurangilah dari seperdua itu sedikit.",
            "verse 73:4": "atau lebih dari seperdua itu. Dan bacalah Al Quran itu dengan perlahan-lahan.",
            "verse 73:5": "Sesungguhnya Kami akan menurunkan kapadamu perkataan yang berat.",
            "verse 73:6": "Sesungguhnya bangun di waktu malam adalah lebih tepat (untuk khusyu') dan bacaan di waktu itu lebih berkesan.",
            "verse 73:7": "Sesungguhnya kamu pada siang hari mempunyai urusan yang panjang (banyak).",
            "verse 73:8": "Sebutlah nama Tuhanmu, dan beribadatlah kepada-Nya dengan penuh ketekunan.",
            "verse 73:9": "(Dialah) Tuhan masyrik dan maghrib, tiada Tuhan (yang berhak disembah) melainkan Dia, maka ambillah Dia sebagai pelindung.",
            "verse 73:10": "Dan bersabarlah terhadap apa yang mereka ucapkan dan jauhilah mereka dengan cara yang baik.",
            "verse 73:11": "Dan biarkanlah Aku (saja) bertindak terhadap orang-orang yang mendustakan itu, orang-orang yang mempunyai kemewahan dan beri tangguhlah mereka barang sebentar.",
            "verse 73:12": "Karena sesungguhnya pada sisi Kami ada belenggu-belenggu yang berat dan neraka yang menyala-nyala.",
            "verse 73:13": "Dan makanan yang menyumbat di kerongkongan dan azab yang pedih.",
            "verse 73:14": "Pada hari bumi dan gunung-gunung bergoncangan, dan menjadilah gunung-gunung itu tumpukan-tumpukan pasir yang berterbangan.",
            "verse 73:15": "Sesungguhnya Kami telah mengutus kepada kamu (hai orang kafir Mekah) seorang Rasul, yang menjadi saksi terhadapmu, sebagaimana Kami telah mengutus (dahulu) seorang Rasul kepada Fir'aun.",
            "verse 73:16": "Maka Fir'aun mendurhakai Rasul itu, lalu Kami siksa dia dengan siksaan yang berat.",
            "verse 73:17": "Maka bagaimanakah kamu akan dapat memelihara dirimu jika kamu tetap kafir kepada hari yang menjadikan anak-anak beruban.",
            "verse 73:18": "Langit(pun) menjadi pecah belah pada hari itu. Adalah janji-Nya itu pasti terlaksana.",
            "verse 73:19": "Sesungguhnya ini adalah suatu peringatan. Maka barangsiapa yang menghendaki niscaya ia menempuh jalan (yang menyampaikannya) kepada Tuhannya.",
            "verse 73:20": "Sesungguhnya Tuhanmu mengetahui bahwasanya kamu berdiri (sembahyang) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan (demikian pula) segolongan dari orang-orang yang bersama kamu. Dan Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu sekali-kali tidak dapat menentukan batas-batas waktu-waktu itu, maka Dia memberi keringanan kepadamu, karena itu bacalah apa yang mudah (bagimu) dari Al Quran. Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit dan orang-orang yang berjalan di muka bumi mencari sebagian karunia Allah; dan orang-orang yang lain lagi berperang di jalan Allah, maka bacalah apa yang mudah (bagimu) dari Al Quran dan dirikanlah sembahyang, tunaikanlah zakat dan berikanlah pinjaman kepada Allah pinjaman yang baik. Dan kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh (balasan)nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Dan mohonlah ampunan kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
        },
        "Italian": {
            "verse 73:1": "O tu l'avvolto [nelle tue vesti],",
            "verse 73:2": "veglia una parte della notte,",
            "verse 73:3": "la metà, oppure meno,",
            "verse 73:4": "oppure poco più. E recita il Corano lentamente, distintamente.",
            "verse 73:5": "Faremo scendere su di te parole gravi.",
            "verse 73:6": "In verità la preghiera della notte è la più efficace e la più propizia:",
            "verse 73:7": "durante il giorno hai occupazioni impegnative.",
            "verse 73:8": "Menziona il Nome del tuo Signore e consacrati totalmente a Lui.",
            "verse 73:9": "Il Signore dell'Oriente e dell'Occidente: non c'è dio all'infuori di Lui. Prendi Lui come Protettore.",
            "verse 73:10": "Sopporta con pazienza quello che dicono e allontanati dignitosamente.",
            "verse 73:11": "LasciaMi con coloro che tacciano di menzogna, che vivono nell'agiatezza e concedi loro un po' di tempo.",
            "verse 73:12": "Invero presso di Noi ci sono catene e la Fornace",
            "verse 73:13": "e cibo che soffoca e doloroso castigo,",
            "verse 73:14": "nel Giorno in cui la terra e le montagne tremeranno e in cui le montagne diventeranno come dune di sabbia fina.",
            "verse 73:15": "In verità inviammo a voi un Messaggero, affinché testimoniasse contro di voi, così come inviammo un Messaggero a Faraone.",
            "verse 73:16": "Ma Faraone disobbedì al Messaggero.Lo afferrammo allora con stretta severa.",
            "verse 73:17": "Come vi difenderete, voi che già non credeste nel Giorno che trasformerà i bambini in vecchi canuti",
            "verse 73:18": "[nel Giorno in cui] si spaccherà il cielo? La promessa [di Allah] si realizzerà.",
            "verse 73:19": "In verità questo è un Monito. Chi vuole, intraprenda dunque la via che conduce al suo Signore.",
            "verse 73:20": "In verità il tuo Signore sa che stai ritto [in preghiera] per quasi due terzi della notte, o la metà, o un terzo e che lo stesso [fanno] una parte di coloro che sono con te. Allah ha stabilito la notte e il giorno. Egli già sapeva che non avreste potuto passare tutta la notte in preghiera ed è stato indulgente verso di voi. Recitate dunque, del Corano, quello che vi sarà agevole. Egli già sapeva che ci sarebbero stati tra voi i malati ed altri che avrebbero viaggiato sulla terra in cerca della grazia di Allah ed altri ancora che avrebbero lottato per la Sua causa. Recitatene dunque quello che vi sarà agevole. Assolvete all'orazione e versate la decima e fate ad Allah un prestito bello. Tutto il bene che avrete compiuto, lo ritroverete presso Allah, migliore e maggiore ricompensa. Implorate il perdono di Allah. In verità Allah è perdonatore, misericordioso."
        },
        "Japanese": {
            "verse 73:1": "衣を頭から纒う者（ムハンマド）よ，",
            "verse 73:2": "夜間に（礼拝に）立て，少時を除いて。",
            "verse 73:3": "夜間の半分，またそれよりも少し縮めて（礼拝に立て），",
            "verse 73:4": "あるいは，それよりも少し多く礼拝に（立て），そしてゆっくりと慎重な調子で，クルアーンを読め。",
            "verse 73:5": "やがてわれは，荘重な御言葉（クルアーン）をあなたに下すであろう。",
            "verse 73:6": "本当に夜間（礼拝）に起きることは，最も力強い歩みであり，御言葉を一層明確にする。",
            "verse 73:7": "本当にあなたは，昼間は要務で長く追われる。",
            "verse 73:8": "それであなたの主の御名を唱念し，精魂を傾けてかれに仕えなさい。",
            "verse 73:9": "東と西の主であられ，かれの外に神はないのである。それでかれを，御槌すべき方として仰ぎなさい。",
            "verse 73:10": "かれらの言うことを耐え忍び，かれらを離れよ，立派に身をかわせ。",
            "verse 73:11": "現世の富にあずかって嘘付き呼ばわりする者たちをわれに委ねて，暫くの間かれらを猶与しなさい，",
            "verse 73:12": "本当にわれの手元には鎖があり，また炎もある。",
            "verse 73:13": "（喉に）病える食物があり，また痛ましい懲罰がある。",
            "verse 73:14": "その日，大地と山々は震動し，山々は崩れ流れて，砂の固まりになるであろう。",
            "verse 73:15": "本当にわれは，あなたがたの証人とするために，使徒をあなたがたに遣わした。われが且つて，フィルアウンに一人の使徒を送ったように。",
            "verse 73:16": "だがフィルアウンはその使徒に従わなかったので，われはかれを厳しく罰して破滅させた。",
            "verse 73:17": "もしあなたがたが依然として（アッラーを）拒否するなら，子供が（恐怖のあまり）白髪になる日，あなたがたはどうして自分を守れようか。",
            "verse 73:18": "その日，天は裂け散るであろう。かれの約束は，必ず完遂されるのである。",
            "verse 73:19": "本当にこれは訓戒である。それで望む者に，主ヘの道を取らせなさい。",
            "verse 73:20": "主は，あなたが夜間の殆ど3分の2，また（ある時は）2分の1，または3分の1を，（礼拝に）立つことを知っておられる。またあなたと一諸にいる一団の者も同様である。アッラーは，夜と昼を妥当に計られる。かれはあなたがたがそれを計れないことを知り，あなたがたを慈しまれる。だからあなたがたは，クルアーンを無理にならない程度に読め。かれは，あなたがたの中病める者のあることを知っておられる。また或る者はアッラーの恩恵を求めて，地上を旅し，或る者はアッラーの道のために戦っている（ことを）。だからそれを無理にならない程度に読め。礼拝の務めを守り，定めの喜捨をなし，アッラーに立派な貸付け（信仰のための散財）をしなさい。あなたがたが，自分の魂のために予め行う，どんな善いことも，アッラーの御許でそれを見い出そう。その（善行の）報奨は，最善にして最大である。あなたがたはアッラーの御赦しを請い求めるがいい。本当にアッラーは寛容にして慈悲深くあられる。"
        },
        "Jawa": {
            "verse 73:1": "He wong kang kemulan (Muhammad)",
            "verse 73:2": "Sira tangiya sholat ing wayah wengi mung kena leren sedhela (kanggo turu)",
            "verse 73:3": "Sholata setengah wengi utawa suda sethithik (dadi mung saprotelone wengi)",
            "verse 73:4": "Utawa tambahan (dari rong protelon wengi) sarta macaa al-Quran kang patitis wacanira",
            "verse 73:5": "Ingsun bakal dhawuhake al-Quran kang abot marang sira",
            "verse 73:6": "Satemen sholat ing wektu wengi (sawuse turu) empaning ponco driya condhong banget lan ati, kanggo benerake pengucap",
            "verse 73:7": "Satemene sira ing wayah awan wis nyambut gawe suwe",
            "verse 73:8": "Sira nyebuta asmaning Allah Pangeranira sarta melenga ngabekti",
            "verse 73:9": "Allah iku Pangeraning jagad sisih wetan lan sisih kulon, ora ana sesembahan kelawan bener kejaba Allah, sira nyumanggakna samu barang prakara marang Allah",
            "verse 73:10": "Sabara marang pangucape (wong kafir) kang nglarakake ati tokna kelawan becik",
            "verse 73:11": "Lan Ingsun togna wae, mangkana uga wongkang anggorohake kang sarwa mubra - mubru (kecukupan) togna wae sedhela",
            "verse 73:12": "Satemene Ingsun kagungan dhadhung kang santosa lan kagungan neraka jahanam",
            "verse 73:13": "Sarta kagungan pepanganan kang nglalekake lan siksa kang nglarani",
            "verse 73:14": "Kelakone kang mangkono mau ing dinane bumi lan gunung - gunung gonjang - ganjing, gunung - gunung padha dadi wedhi kang mawur - mawur",
            "verse 73:15": "Ingsun wis ngutus rasul nerangkae marang sira bakal anggoningsun ngutus rasul marang Fir’aun",
            "verse 73:16": "Nanging Fir’aun ambangkang marang parenthe rosul (Musa) mulane banjur dipatrapi siksa abot",
            "verse 73:17": "Kapriye olehmu bakal anjaga awakmu, manawa padha maido, ing dinane kang para bocah adha didadekake kaki (tuwa uwanen)",
            "verse 73:18": "Ing dina iku sanadyan langit hiya sigar, kang wis ditemtokake dening Allah, mesthi kaleksanan",
            "verse 73:19": "Satemene ayat (tanda) iki dadi wewulang sing sapa kepengen selamet ngestokna ayat mau, minangka dalan marang ngarsaning Allah Pangerane",
            "verse 73:20": "Satemene Allah Pangeranira nguningane yen sira nindakake sholat kira - kira / wengi, lan setengah wengi lan (kala - kala)"
        },
        "Kazakh": {
            "verse 73:1": "Ей, жамылып алушы",
            "verse 73:2": "Түннің аз бөлігінен өзгесін, тұр намаз оқуға",
            "verse 73:3": "оның жартысын не одан біраз кеміт",
            "verse 73:4": "не оған қос. Әрі Құранды анық етіп оқы",
            "verse 73:5": "Ей, Мұхаммед! Ақиқатында, саған салмақты Сөзді түсіреміз",
            "verse 73:6": "Шын мәнінде, түнде түру өте эсерлі және айтылуы түсініктірек",
            "verse 73:7": "Ақиқатында, күндіз сенің ұзақ істерің бар",
            "verse 73:8": "Әрі Раббыңның есімін еске ал және Оған толығымен беріл",
            "verse 73:9": "Ол шығыс пен батыстың Раббысы. Одан басқа ешбір құдай жоқ. Сондықтан Оны Қамқоршы етіп ал",
            "verse 73:10": "Олардың серік қатушылардың айтып жатқандарына сабыр ет және оларды сыпайы түрде тәрк ет",
            "verse 73:11": "Әрі өтірік санаушы дәулет иелерін Маған қалдырып, оларға біраз уақыт бер",
            "verse 73:12": "Шын мәнінде, Бізде бұғаулар және Жахим бар",
            "verse 73:13": "әрі өңештен өтпейтін тамақ және күйзелтуші азап бар",
            "verse 73:14": "Ол күні жер мен таулар тітірейді де таулар сусымалы құм төбелерге айналады",
            "verse 73:15": "Анығында, Біз Фиръаунға Елші жібергеніміздей, сендерге де өздеріңе қарсы куәлік беруші Елші жібердік",
            "verse 73:16": "Ал, Фиръаун Елшіге бағынбады. Сондықтан оны қатты ұстаумен қолға алдық",
            "verse 73:17": "Ал, егер сендер күпірлік етсеңдер қарсы келсеңдер , сәбилердің шашы ағаратын Күннен қалай сақтанасыңдар",
            "verse 73:18": "Сонда аспан жарылады. Оның уәдесі орындалады",
            "verse 73:19": "Ақиқатында, бұл Еске салу. Ендеше кім қалайтын болса, Раббысына қарай жол ұстанады",
            "verse 73:20": "Анығында, Раббың сенің түннің үштен екісінен азырақ бөлігін әрі оның жартысын және үштен бір бөлігін намазда тұрып өткізетініңді біледі және сенімен бірге болғандардан бір топтың да. Түн мен күндіздің мөлшерін Аллаһ белгілейді. Ол сендердің есептей алмайтындарыңды біледі, сондықтан Өзіне бойсұнуға қайтуларыңды тәубелеріңді қабыл етті. Құраннан жеңіл келгенін оқыңдар. Ол араларыңда науқастар болатынын, біреулер Аллаһтың кеңшілігін іздеп сапарда болатындарын және біреулер Аллаһтың жолында соғысатынын біледі. Ендеше, одан жеңіл келгенін оқыңдар әрі намазды барлық шарттарын сақтап, беріле! толық орындаңдар және зекетті беріңдер және Аллаһқа көркем қарыз беріңдер. Өздерің үшін алдын ала қандай жақсылық істеген болсаңдар, оны Аллаһтың алдында содан да қайырлы әрі ұлы сый күйінде табасыңдар. Аллаһтан кешірім тілеңдер. Шын мәнінде, Аллаһ өте Кешірімді, ерекше Рақымды"
        },
        "Korean": {
            "verse 73:1": "옷을 두른 자여망투 속에 싸여진 그대여",
            "verse 73:2": "그대는 얼마간을 제외하고는 한밤중에 일어나 예배하라밤에 일어나 예배하라 그러나밤중 내내가 아니며",
            "verse 73:3": "그때(밤)의 절반을 예배하거나 거기서 조금만 줄이거나그것의 절반 아니면 그 이하 면 되며",
            "verse 73:4": "거기에 더하라. 그리고 그대는 꾸란을 천천히 낭송하라그 이상이라도 좋으니라 그 리고 꾸란을 낭송하되 느리고 리 듬을 두어 읽으라",
            "verse 73:5": "실로 나는 그대에게 무거운 말씀을 던질 것이라내가 그대에게 중요한 메세지 를 보내리라",
            "verse 73:6": "실로 한밤에 일어나서 드리는 예배 그것은 가장 견고한 것이며 가장 올곧은 말이라실로 밤중에 일어나는 것은 어려운 일이되 예배하고 찬미하는 말을 하기에 가장 적합한 때라",
            "verse 73:7": "실로 낮에는 그대에게 기다란 분주함이 주어지노라실로 그대에게는 낮에 해야할임무가 있나니",
            "verse 73:8": "그대는 그대 주님의 이름을 떠올리고 오로지 그분께로 전념하라그대 주님의 이름을 상기하고 온 정성을 다하여 그분만을 성기라",
            "verse 73:9": "동쪽과 서쪽의 주님, 그분 이외에는 경배받을 존재가 없으니 그대는 그분을 의탁의 대상으로 두라그분은 동쪽과 서쪽의 주님으 로 그분 외에는 신이 없나니 그분 만을 보호자로 택하라",
            "verse 73:10": "그대는 그들이 하는 말에 인내하고 그들을 아름답게 멀리하라그들이 말하는 것에 인내하 고 정중한 태도로 그들을 멀리하라",
            "verse 73:11": "그리고 그대는 나와 안락함을 지닌 진리를 부정하는 자들을 놓아두고 그들을 얼마간 늦추어 주라거짓하는 자들은 내게 두라 그들로 하여금 향락케 하여 잠시 만 유예하리라",
            "verse 73:12": "실로 나에게는 족쇄와 타오르는 불이 있으며나에게는 그들을 묶을 족쇠 와 그들을 태울 불이 있으며",
            "verse 73:13": "목을 메우는 음식과 고통스런 벌이 있노라질식시킬 음식과 고통스러운벌이 있나니",
            "verse 73:14": "그날 대지와 산들은 요동치며 산들은 무너져내릴 모래 언덕이 될 것이라대지와 산들이 크게 동요하 는 그날 산들은 모래 산더미가 되 어 흘러 내리니라",
            "verse 73:15": "실로 나는 그대들에게 그대들에 대한 증언자가 될 사도를 보냈으니 마치 내가 파라오에게 사도를 보낸 것과 같노라실로 내가 그대들에게 한 선지자를 보냄은 너희를 위한 증 인이 되도록 함이니 이는 내가 파 라오에게 선지자를 보낸 것과 같 노라",
            "verse 73:16": "그러나 파라오는 사도에게 불복하였고 이에 나는 그를 거칠게 움켜잡았노라그러나 파라오는 그 선지자 에게 복종하지 아니하였으매 나는 그에게 무거운 응벌을 내렸노라",
            "verse 73:17": "그런데도 만약 그대들이 불신한다면, 그분께서 어린이들을 백발노인들로 만드시는 그날(의 벌)을 그대들이 어떻게 막을 것인가너희가 하나님을 부정한다면어린이가 호호백발이 되는 그날 너희는 너희 자신을 어떻게 보호 하려 하느뇨",
            "verse 73:18": "하늘은 그로 인해 갈라질 것이라. 그분의 약속은 실행되게 되어 있노라그때 하늘은 갈라지고 그분 의 약속은 이행되니라",
            "verse 73:19": "실로 이것은 떠올림이라. 그러니 원하는 자는 그의 주님께로 향하는 길을 잡으라실로 이것이 하나의 교훈이 니 뜻이 있는 자 주님의 길을 따 르게 하라",
            "verse 73:20": "실로 그대 주님께서는 그대가 밤의 삼분의 이보다 더 적게, 그것(밤)의 절반을, 그것의 삼분의 일을 일어나 예배하는 것을 알고 계시며 그대와 함께 있는 자들 중의 한 무리도 마찬가지라. 하나님께서는 밤과 낮을 조절하시노라. 그분께서는 그대들이 그것(밤)을 새울 수 없음을 알고 계셨기에 그대들의 뉘우침을 받아주셨노라. 그러니 그대들은 꾸란 중에 쉽게 다가오는 것을 읽으라. 그분께서는 그대들 중에 병자들이 있을 것이고 다른 이들은 하나님의 은혜를 간구하며 대지를 여행할 것이며 다른 이들은 하나님의 길에서 전투에 참전할 것임을 알고 계셨노라. 그러니 그대들은 그것(꾸란) 중에 쉽게 다가오는 것을 읽으라. 그리고 그대들은 꾸준히 예배를 드리고 의무 희사금을 내며 하나님을 위해 돌려받지 않을 빚을 내주라. 그대들 자신들을 위해 내놓는 그 어떤 재산도 그대들은 하나님 앞에서 그것이 실로 더 훌륭하고 더 위대한 보상이 있음을 발견할 것이라. 그대들은 하나님께 용서를 구하라. 실로 하나님께서는 너그러이 용서하시는 자애로우신 분이라실로 주님은 그대가 밤의 삼 분의 이 또는 그것의 반을 때로는 삼분의 일을 예배하며 경배하는지 알고 계시며 또한 그대와 함께한 무리도 그러하니라 하나님만이 밤 낮을 운용하시며 너희가 그렇게 계산할 수 없음을 그분은 알고 계 시니라 그리하여 그분은 너희에게 자비를 베푸셨으니 꾸란을 많이 읽으라 너희에게 쉬워지리라 또 한 그분은 너희 가운데 병든자 있 고 하나님의 은혜를 추구하며 지 상을 여행하는 자 있으며 하나님 의 길에서 성전하는 자 있음을 알 고 계시나니 꾸란을 많이 읽으라 너희에게 쉬워지리라 그리고 예배 를 드리고 이슬람세를 내며 하나 님께 좋은 것으로 대부하라 너희 가 너희 영혼을 위해 바친 것은 하나님 앞에서 더 좋은 것으로 발견하리니 하나님의 은혜를 추구하라 하나님은 관용과 자비로 충만 하시니라"
        },
        "Kurdish": {
            "verse 73:1": "Kesê (te) xwe di kincê xwe da peçaîئه‌ی ئه‌وکه‌سه‌ی خۆت داپۆشیووه‌، ئه‌ی محمد صلی الله علیه وسلم",
            "verse 73:2": "Di şevê da rabe (perestî bike) ji pêştirê hindikê (ji şevê)شه‌و هه‌سته نوێژ بکه مه‌گه‌ر که‌مێکی نه‌بێت.",
            "verse 73:3": "Di nîvê şevê da (rabe) ya jî hindik ji wî nîvî jî biboreنیوه‌ی یان که‌متر له نیوه‌ی لێ که‌م بکه‌ره‌وه‌.",
            "verse 73:4": "Ya jî hinekî ji wî nîvî pir bike û tu Qu´ran ê hêdî û tîpên wî ji hev derxe, bixûneیاخود زیاتری بکه‌و ده‌وری قورئان بکه‌ره‌وه به وردی و له‌سه‌رخۆ.",
            "verse 73:5": "Bi rastî emê di nezîk da, gotineke giran li ser te da bavêjinچونکه به‌ڕاستی ئێمه فه‌رمووده‌و گوفتارێکی سه‌نگین داده‌به‌زێنینه سه‌رت (که به‌هۆیه‌وه به‌ره‌نگاری ئه‌رك و زه‌حمه‌تی زۆر ده‌بیت).",
            "verse 73:6": "Bi rastî temtêla (merivên) di şevê da rabû î (ji bona xebat û perestîyî) û xwûndinê, şidya û bi hêztir eبه‌ڕاستی خۆ پێگه‌یاندن له شه‌ودا قورستره له ڕووی کردارو باشتره له ڕووی گوفتاره‌وه‌.",
            "verse 73:7": "Loma bi rastî di royî da ji bona te ra danê xebatên dirêj heneتۆ بۆت هه‌یه له ڕۆژدا هه‌وڵ بده‌یت (بانگه‌واز بکه‌یت) و بگه‌ڕێیت، کۆششی زۆر بکه‌یت.",
            "verse 73:8": "(Muhemmed!) tu bi navê Xuda yê xwe (bi xwûne) tu ji hemî (xebat û sêwrandinan) dile xwe vala bike, xurî hey li bal (Xuda yê xwe da) bizvireتۆ هه‌میشه با ناوی په‌روه‌ردگارت ویردی سه‌ر زارت بێت، به دڵسۆزی و ملکه‌چیه‌وه ڕووی تێ بکه‌.",
            "verse 73:9": "(Ewa Xuda yê te) Xuda yê rojhilat û rojava ye. Ji pêştirê wî, tu Yezdan ê babetê (Perestîyê) tunene, îdî tu ewî bi tenê ji xwe ra cînîşte bigireئه‌و زاته‌ی که تۆی ڕه‌وانه‌کردوه‌؛ خاوه‌ن و په‌روه‌ردگاری ڕۆژهه‌ڵات و ڕۆژئاوایه‌، جگه له‌و هیچ خوایه‌کی تر نیه فه‌رمانی به‌ده‌ست بێت، که‌واته هه‌ر ئه‌و بکه به پشتیوانی خۆت و داوای یارمه‌تیی هه‌ر له‌و بکه‌.",
            "verse 73:10": "Û tu li ser gotinê wan hew bike, tu bi qencîyan dest ji wan berdeله به‌رامبه‌ر گوفتاری ناڕه‌وای خوانه‌ناسانه‌وه هه‌رده‌م خۆ ڕاگربه‌و به شێوازێکی جوان به‌جێیان بهێڵه‌.",
            "verse 73:11": "Tu min ü ewanê maldarên virek bi tenê bihêle û tu hindik dan ji wan ra bideواز بهێنه له من و له‌و خاوه‌ن نازو نیعمه‌تانه‌ی که ئایینی من به‌درۆ ده‌زانن، تۆ که‌مێك مۆڵه‌تیان بده‌.",
            "verse 73:12": "Loma bi rastî li bal me (ji bona wan ra) serberjêr kirin û agirê doja pêketî heyeبه‌ڕاستی ئێمه کۆت و زنجیرو دۆزه‌خمان ئاماده کردووه (بۆ ئه‌و جۆره تاوانبارانه‌).",
            "verse 73:13": "Xwarinê (bi sturî) û xenoqe û şapata dilsoz heyeهه‌روه‌ها خۆراکێك که له گه‌روو ده‌گیرێت، سه‌ره‌ڕای سزای به ئێش و ئازار.",
            "verse 73:14": "Di wê rojê da zemîn çîyan dihejin û çîya di binê wekî tîxê qumê da dimîninله ڕۆژێکدا که زه‌وی و کێوه‌کان دێنه له‌رزه‌، سه‌رئه‌نجام کێوه‌کان وردو خاش ده‌بن و وه‌کو ته‌پۆلکه‌ی لمیان لێ دێت.",
            "verse 73:15": "(Geli merivan!) Me ça li bal Fir´ewn da qasidek, şandibû bi rastî wusa jî me li bal we da qasidek şandîye ji bo ku li ser we bibe nihrewanخۆ به‌ڕاستی ئێمه پێغه‌مبه‌رێکمان بۆ ڕه‌وانه‌کردوون که بوه‌ته شایه‌ت به‌سه‌رتانه‌وه هه‌روه‌کو چۆن بۆ لای فیر عه‌ونیش پێغه‌مبه‌رێکمان ڕه‌وانه کرد.",
            "verse 73:16": "Îdî Fir´ewn bê gotina wî qasidê kiriye, mejî Fir´ewn bi girtinekî (zor şapat va) îdî girtîyeجا فیرعه‌ون یاخی بوو له‌و پێغه‌مبه‌ره‌، ئێمه‌ش به‌توندی پێچامانه‌وه‌و به‌ڵایه‌کی گه‌وره‌مان به‌سه‌ر هێنا.",
            "verse 73:17": "Erê heke hûn filetî ya wî bikin, ka hûnê ça (ji şapata) wê roya, ku zar tê da kal dibin, xwe biparisînin(ئه‌گه‌ر ئێوه له‌سه‌ر یاخی بوونتان به‌رده‌وام بن)؛ جا چۆن خۆتان ده‌پارێزن له ڕۆژێك که منداڵ پیر ده‌کات و سه‌ری سپی ده‌بێت.",
            "verse 73:18": "Ezman (ji tirsa) di wê royî da çiryaye.Bi rastî peymana (Yezdan bi şapatdana wan) pêk hatîyeئه‌و ڕۆژه ئاسمان به‌هه‌موو ئه‌ستێره‌و هه‌ساره‌کانیه‌وه له‌ت و په‌ت ده‌بێت، بێگومان ئه‌و به‌ڵێنه هه‌ر دێته دی.",
            "verse 73:19": "Bi rastî evan(beratan) şîret in, îdî kîjan hez bike, ewa (ji bo çûna) li bal Xuda yê xwe da rêyekî digireبه‌ڕاستی ئه‌م سووره‌ته‌ش یادخه‌ره‌وه‌و ئامۆژگاریه‌، بۆ ئه‌و که‌سه‌ی ده‌یه‌وێت ڕێگه به‌ره‌و په‌روه‌ردگاری بگرێته‌به‌ر.",
            "verse 73:20": "Bi rastî Xuda yê te dizane, ku tu ji sê parê şevê nêzîkê duparan, yan jî nîvê şevê, yan jî sê parê şevê, di parekî da radibî (nimêj dikî). Destekî ji wanê bi ter a jî (wekî te radibin, Xuda yê xwe te bi wan jî dizane). Pîvandina şev û royan Yezdan dike. Ji ber ku ewî dizanibû, hûn nikarin (danê xweyê şevê) bipîvin (di wan danan da ranabin) îdî ewî hûn (ji hijmara wan danan) baxişandîne. Îdî ji Qur´an ê (ji bona we ra) çi hêsaîye, ewî bixwûnin (zor nedine xwe)! Ji ber (Yezdan) zanîbû, ku wê ji we nexwaşê hebin û destekî ji we di zemin da ji rûmeta wî rojînê xwe bigerin û destek jî di rê ya Yezdan da qirînê (bi wanê file ra) bikin (eva hêsaya hanê, ji bona we ra pêk anî). Îdî (gelî bawerkeran!) ji (Qu´ran ê ji bona we ra) çi hêsaîye, hûn ewî bixwûnin (zor nedine xwe). Hûn nimêj bikin û baca malê xwe bidin, hûn ji bona qayîlbûna Yezdan, bi qencî ji hev ra deynan bidin. Hûn ji bona xwe ra ji qenrîyan çi pêş da pêk bînin, hûnê li bal Yezdan rastê wî werin, ku ewa (ji bona we ra) qencîyeke û meztirê kiryane. Hûn baxişandina xwe ji Yezdan bixwazin, loma bi rastî Yezdan baxişkarê dilovîn eبه‌ڕاستی ئه‌و په‌روه‌ردگاره‌ت چاك ده‌زانێت که تۆ نزیکه‌ی دوو به‌شی شه‌و یاخود نیوه‌ی یان سێیه‌کی هه‌ڵده‌سیت و شه‌ونوێژ ده‌که‌یت، هه‌روه‌ها هه‌ندێك له‌وانه‌ی که له گه‌ڵتان، خوا ئه‌ندازه‌ی شه‌وو ڕۆژ دیاری ده‌کات، خوا زانیویه‌تی که ئێوه هه‌رگیز نازانن دیاریی بکه‌ن و ئاماری بکه‌ن ئه‌گه‌ر ئه‌و نه‌یکردایه‌، له‌به‌ر ئه‌وه ته‌وبه‌ی لێوه‌رگرتن، جا چه‌ندتان توانی و چۆنتان بۆ لوا له شه‌ونوێژو له کاتی تردا قورئان بخوێنن و ده‌وری بکه‌نه‌وه‌، چونکه ئه‌و خوایه میهره‌بانه‌و ده‌زانێت، له‌وانه‌یه که‌سانێکتان لێ نه‌خۆش بکه‌وێت و که‌سانی تریش ببن له زه‌ویدا بگه‌ڕێن به‌شوێن بازرگانی و فه‌زڵی خواداو که‌سانی تر له داهاتوودا بجه‌نگن بۆ لابردنی کۆسپه‌کانی سه‌ر ڕێی دینی خواو بۆ به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و، که‌واته چه‌نده‌تان بۆکرا ئه‌وه‌نده قورئان بخوێنن و نوێژه‌کانتان به‌چاکی ئه‌نجام بده‌ن و زه‌کاتیش (به‌و شێوه‌یه‌ی دیاریکراوه‌) بیده‌ن و قه‌رز به‌شێوه‌یه‌کی جوان به‌خوا بده‌ن (ئه‌وه‌ی بۆ خوا ببه‌خشرێت خوای گه‌وره به‌قه‌رزێکی داده‌نێت که به‌زاتی خۆی درا بێت) هه‌ر ده‌ست پێشکه‌ریه‌کی چاکه بکه‌ن بۆ خۆتان سبه‌ی ده‌یبیننه‌وه لای خوا ده‌ستان ده‌که‌وێته‌وه به باشترو پاداشتی گه‌وره‌تر، ده داوای لێخۆشبوون هه‌ر له خوا بکه‌ن و دڵنیابن ئه‌و خوایه لێخۆشبوو میهره‌بانه‌."
        },
        "Kyrgyz": {
            "verse 73:1": "О, оронуп жаткан киши",
            "verse 73:2": "Түндөсү тур (жана ибадат кыл!?) Бир аз гана бөлүгүндө-жарымында (уктасаң) мейли",
            "verse 73:3": "Же болбосо, (уйкуну) андан (жарымдан) аз гана кемит",
            "verse 73:4": "Же бир аз кош жана Кураанды кыраатын келиштирип оку!“",
            "verse 73:5": "Биз жакында сага салмактуу Сөздү (Кураанды) түшүрөбүз",
            "verse 73:6": "Түңкү убакыттар(да ибадат кылуу жана Кураан окуунун көңүлгө) тамгалануусу катуураак жана сөзү туурараак",
            "verse 73:7": "Күндүзүндө болсо сенин узун убарагерчилигиң бар",
            "verse 73:8": "(Кураан окуганыңда “Бисмиллахир Рахмаанир Рахийм” деп) Раббиңдин ысымын эсте жана ал үчүн (дүйнөлүк ойлордон) толук үзүл",
            "verse 73:9": "(Аллаһ) Чыгыштын жана Батыштын Раббиси! Андан башка сыйынууга татыктуу кудай жок! Демек, (О, Мухаммад) сен Аны гана (өзүңө) таяныч кылып ал",
            "verse 73:10": "(О, Мухаммад) алардын айткандарына сабыр кыл жана алардан акырын гана алыс боло тур",
            "verse 73:11": "(Динди) жалган деген байлык-мансап ээлерин Мага кой жана аларга бир аз мөөнөт бер",
            "verse 73:12": "Биздин алдыбызда аларга арналган оор кишендер жана алоолонгон от бар",
            "verse 73:13": "Жана тикенектүү тамак менен жан ооруткан азап бар",
            "verse 73:14": "Ал (Кыямат) күнү жер менен тоолор титиреп, тоолор (суудай) аккан кумдөбөлөргө айланат",
            "verse 73:15": "(Эй, Макка каапырлары!) Биз Фираунга (Муса) пайгамбарды жибергенибиз сыяктуу, силерге да (Мухаммад) пайгамбарды жибердик. (Ал) силерге күбө болуп турат",
            "verse 73:16": "Фираун айгамбарга каршы чыкты эле, Биз аны катуу (азап менен) алып койдук",
            "verse 73:17": "Эгер каапыр болсоңор жаш балдардын чачын агартып жибере турган Күндөн кантип сактана аласыңар",
            "verse 73:18": "Ал (коркунучтуу Күндөгү кыйроолор) себептүү асман дагы барчаланып кетет! Анын (Аллаһтын) убадасы аткарылат",
            "verse 73:19": "Албетте, бул(айтылганд)ар эскертүү гана. Ким кааласа Раббисине (алып баруучу туура) жолду (тандап) алат.”",
            "verse 73:20": "(О, Мухаммад) Раббиң сенин жана сен менен болгон тайпанын түндүн үчтөн экисинен азыраагында жана жарымында жана үчтөн биринде (ибадат үчүн) турушуңду билет. Аллаһ түн менен күндү ченейт. Ал силердин аны (түндөгү ибадат сааттарды) эсептей албай калганыңарды билип, силерге жеңилдикти кайтарды. Эми, (түндөсү) Кураандан алыңар жеткенче гана окугула. (Себеби Аллаһ) жакын келечекте силердин араңарда оорулуу адамдар болушун, жана башкалары Аллаһтын ырыскы — пазилетин издеп жер бетин кезип (соода же сапар кылып) жүрүшүн, жана башка бирөөлөр Аллаһ жолунда жихад кылуу менен алектенишин билди. (Ошондой болгон соң) эми, ал-кудуретиңер жеткенче Кураан окугула. Жана намазды (толук) аткарып, зекет бергиле. Жана Аллаһка жакшынакай карыз бергиле. Өзүнөр(дүн араңардагы кедей муктаж инсандар) үчүн эмне жакшылык (садака) кылган болсоңор, аны Аллаһтын алдында андан да жакшыраак, улугураак сооп иретинде табасыңар. Жана Аллаһтан (көп) кечирим сурагыла! Чынында Аллаһ — Кечиримдүү, Ырайымдуу"
        },
        "Malay": {
            "verse 73:1": "Wahai orang yang berselimut!.",
            "verse 73:2": "Bangunlah sembahyang Tahajjud pada waktu malam, selain dari sedikit masa (yang tak dapat tidak untuk berehat),",
            "verse 73:3": "Iaitu separuh dari waktu malam, atau kurangkan sedikit dari separuh itu,",
            "verse 73:4": "Ataupun lebihkan (sedikit) daripadanya; dan bacalah Al-Quran dengan \"Tartil\".",
            "verse 73:5": "(Sayugialah engkau dan pengikut-pengikutmu membiasakan diri masing-masing dengan ibadat yang berat kepada hawa nafsu, kerana) sesungguhnya Kami akan menurunkan kepadamu wahyu (Al-Quran yang mengandungi perintah-perintah) yang berat (kepada orang-orang yang tidak bersedia menyempurnakannya).",
            "verse 73:6": "Sebenarnya sembahyang dan ibadat malam lebih kuat kesannya (kepada jiwa), dan lebih tetap betul bacaannya.",
            "verse 73:7": "(Kami galakkan engkau dan umatmu beribadat pada waktu malam), kerana sesungguhnya engkau pada siang hari mempunyai urusan-urusan yang panjang kira bicaranya;",
            "verse 73:8": "Dan sebutlah (dengan lidah dan hati) akan nama Tuhanmu (terus menerus siang dan malam), serta tumpukanlah (amal ibadatmu) kepadaNya dengan sebulat-bulat tumpuan.",
            "verse 73:9": "Dia lah Tuhan yang menguasai timur dan barat; tiada Tuhan melainkan Dia; maka jadikanlah Dia Penjaga yang menyempurnakan urusanmu.",
            "verse 73:10": "Dan bersabarlah terhadap apa yang dikatakan oleh mereka (yang menentangmu), dan jauhkanlah dirimu dari mereka dengan cara yang baik.",
            "verse 73:11": "Dan biarkanlah Aku sahaja membalas orang-orang yang mendustakan (bawaanmu) itu, orang-orang yang berada dalam kemewahan, dan berilah tempoh kepada mereka sedikit masa;",
            "verse 73:12": "Kerana sesungguhnya di sisi Kami disediakan (untuk mereka) belenggu-belenggu dan neraka yang menjulang-julang,",
            "verse 73:13": "Serta makanan yang menjadikan pemakannya tercekik, dan azab seksa yang tidak terperi sakitnya.",
            "verse 73:14": "(Azab itu tetap berlaku) pada hari bumi dan gunung-ganang bergoncang (serta hancur lebur), dan menjadilah gunung-ganang itu timbunan pasir yang mudah bersepah.",
            "verse 73:15": "Sesungguhnya Kami telah mengutus kepada kamu (wahai umat Muhammad), seorang Rasul yang menjadi saksi terhadap kamu (tentang orang yang mematuhi atau menolak seruannya), sebagaimana Kami telah mengutus kepada Firaun seorang Rasul.",
            "verse 73:16": "Maka Firaun menderhaka kepada Rasul itu, lalu Kami menyeksakannya dengan azab seksa yang seberat-beratnya.",
            "verse 73:17": "(Sekiranya kamu tidak ditimpa azab di dunia), maka bagaimana kamu dapat menjaga dan menyelamatkan diri kamu - kalau kamu kufur ingkar - (dari azab) hari yang huru-haranya menyebabkan kanak-kanak menjadi tua beruban?",
            "verse 73:18": "Langit (yang demikian besarnya) akan pecah belah dengan sebab kedahsyatan hari itu. (Ingatlah), janji Allah adalah perkara yang tetap dilakukanNya.",
            "verse 73:19": "Sesungguhnya (keterangan-keterangan yang mengandungi amaran) ini menjadi peringatan oleh itu sesiapa yang mahukan kebaikan dirinya dapatlah ia mengambil jalan yang membawa kepada Tuhannya (dengan iman dan taat).",
            "verse 73:20": "Sesungguhnya Tuhanmu (wahai Muhammad) mengetahui bahawasanya engkau bangun (sembahyang Tahajjud) selama kurang dari dua pertiga malam, dan selama satu perduanya, dan selama satu pertiganya; dan (demikian juga dilakukan oleh) segolongan dari orang-orang yang bersama-samamu (kerana hendak menepati perintah yang terdahulu); padahal Allah jualah yang menentukan dengan tepat kadar masa malam dan siang. Ia mengetahui bahawa kamu tidak sekali-kali akan dapat mengira dengan tepat kadar masa itu, lalu Ia menarik balik perintahNya yang terdahulu (dengan memberi kemudahan) kepada kamu; oleh itu bacalah mana-mana yang mudah kamu dapat membacanya dari Al-Quran (dalam sembahyang). Ia juga mengetahui bahawa akan ada di antara kamu orang-orang yang sakit; dan yang lainnya orang-orang yang musafir di muka bumi untuk mencari rezeki dari limpah kurnia Allah; dan yang lainnya lagi orang-orang yang berjuang pada jalan Allah (membela ugamaNya). Maka bacalah mana-mana yang sudah kamu dapat membacanya dari Al-Quran; dan dirikanlah sembahyang serta berikanlah zakat; dan berilah pinjaman kepada Allah sebagai pinjaman yang baik (ikhlas). Dan (ingatlah), apa jua kebaikan yang kamu kerjakan sebagai bekalan untuk diri kamu, tentulah kamu akan mendapat balasannya pada sisi Allah, -sebagai balasan yang sebaik-baiknya dan yang amat besar pahalanya. Dan mintalah ampun kepada Allah; sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani."
        },
        "Malayalam": {
            "verse 73:1": "ഹേ, വസ്ത്രം കൊണ്ട് മൂടിയവനേ,",
            "verse 73:2": "രാത്രി അല്‍പസമയം ഒഴിച്ച് എഴുന്നേറ്റ് നിന്ന് പ്രാര്‍ത്ഥിക്കുക.",
            "verse 73:3": "അതിന്‍റെ (രാത്രിയുടെ) പകുതി, അല്ലെങ്കില്‍ അതില്‍ നിന്നു (അല്‍പം) കുറച്ചു കൊള്ളുക.",
            "verse 73:4": "അല്ലെങ്കില്‍ അതിനെക്കാള്‍ വര്‍ദ്ധിപ്പിച്ചു കൊള്ളുക. ഖുര്‍ആന്‍ സാവകാശത്തില്‍ പാരായണം നടത്തുകയും ചെയ്യുക.",
            "verse 73:5": "തീര്‍ച്ചയായും നാം നിന്‍റെ മേല്‍ ഒരു കനപ്പെട്ട വാക്ക് ഇട്ടുതരുന്നതാണ്‌.",
            "verse 73:6": "തീര്‍ച്ചയായും രാത്രിയില്‍ എഴുന്നേറ്റു നമസ്കരിക്കല്‍ കൂടുതല്‍ ശക്തമായ ഹൃദയസാന്നിദ്ധ്യം നല്‍കുന്നതും വാക്കിനെ കൂടുതല്‍ നേരെ നിര്‍ത്തുന്നതുമാകുന്നു.",
            "verse 73:7": "തീര്‍ച്ചയായും നിനക്ക് പകല്‍ സമയത്ത് ദീര്‍ഘമായ ജോലിത്തിരക്കുണ്ട്‌.",
            "verse 73:8": "നിന്‍റെ രക്ഷിതാവിന്‍റെ നാമം സ്മരിക്കുകയും, (മറ്റു ചിന്തകള്‍ വെടിഞ്ഞ്‌) അവങ്കലേങ്കു മാത്രമായി മടങ്ങുകയും ചെയ്യുക.",
            "verse 73:9": "ഉദയസ്ഥാനത്തിന്‍റെയും, അസ്തമനസ്ഥാനത്തിന്‍റെയും രക്ഷിതാവാകുന്നു അവന്‍. അവനല്ലാതെ യാതൊരു ദൈവവുമില്ല. അതിനാല്‍ ഭരമേല്‍പിക്കപ്പെടേണ്ടവനായി അവനെ സ്വീകരിക്കുക.",
            "verse 73:10": "അവര്‍ (അവിശ്വാസികള്‍) പറയുന്നതിനെപ്പറ്റി നീ ക്ഷമിക്കുകയും, ഭംഗിയായ വിധത്തില്‍ അവരില്‍ നിന്ന് ഒഴിഞ്ഞു നില്‍ക്കുകയും ചെയ്യുക.",
            "verse 73:11": "എന്നെയും, സുഖാനുഗ്രഹങ്ങള്‍ ഉള്ളവരായ സത്യനിഷേധികളെയും വിട്ടേക്കുക. അവര്‍ക്കു അല്‍പം ഇടകൊടുക്കുകയും ചെയ്യുക.",
            "verse 73:12": "തീര്‍ച്ചയായും നമ്മുടെ അടുക്കല്‍ കാല്‍ ചങ്ങലകളും ജ്വലിക്കുന്ന നരകാഗ്നിയും",
            "verse 73:13": "തൊണ്ടയില്‍ അടഞ്ഞു നില്‍ക്കുന്ന ഭക്ഷണവും വേദനയേറിയ ശിക്ഷയുമുണ്ട്‌.",
            "verse 73:14": "ഭൂമിയും പര്‍വ്വതങ്ങളും വിറകൊള്ളുകയും പര്‍വ്വതങ്ങള്‍ ഒലിച്ചു പോകുന്ന മണല്‍ കുന്ന് പോലെയാവുകയും ചെയ്യുന്ന ദിവസത്തില്‍.",
            "verse 73:15": "തീര്‍ച്ചയായും നിങ്ങളിലേക്ക് നിങ്ങളുടെ കാര്യത്തിന് സാക്ഷിയായിട്ടുള്ള ഒരു ദൂതനെ നാം നിയോഗിച്ചിരിക്കുന്നു. ഫിര്‍ഔന്‍റെ അടുത്തേക്ക് നാം ഒരു ദൂതനെ നിയോഗിച്ചത് പോലെത്തന്നെ.",
            "verse 73:16": "എന്നിട്ട് ഫിര്‍ഔന്‍ ആ ദൂതനോട് ധിക്കാരം കാണിച്ചു. അപ്പോള്‍ നാം അവനെ കടുത്ത ഒരു പിടുത്തം പിടിക്കുകയുണ്ടായി.",
            "verse 73:17": "എന്നാല്‍ നിങ്ങള്‍ അവിശ്വസിക്കുകയാണെങ്കില്‍, കുട്ടികളെ നരച്ചവരാക്കിത്തീര്‍ക്കുന്ന ഒരു ദിവസത്തെ നിങ്ങള്‍ക്ക് എങ്ങനെ സൂക്ഷിക്കാനാവും?",
            "verse 73:18": "അതു നിമിത്തം ആകാശം പൊട്ടിപ്പിളരുന്നതാണ്‌. അല്ലാഹുവിന്‍റെ വാഗ്ദാനം പ്രാവര്‍ത്തികമാക്കപ്പെടുന്നതാകുന്നു.",
            "verse 73:19": "തീര്‍ച്ചയായും ഇതൊരു ഉല്‍ബോധനമാകുന്നു. അതിനാല്‍ വല്ലവനും ഉദ്ദേശിക്കുന്ന പക്ഷം അവന്‍ തന്‍റെ രക്ഷിതാവിങ്കലേക്ക് ഒരു മാര്‍ഗം സ്വീകരിച്ചു കൊള്ളട്ടെ.",
            "verse 73:20": "നീയും നിന്‍റെ കൂടെയുള്ളവരില്‍ ഒരു വിഭാഗവും രാത്രിയുടെ മിക്കവാറും മൂന്നില്‍ രണ്ടു ഭാഗവും (ചിലപ്പോള്‍) പകുതിയും (ചിലപ്പോള്‍) മൂന്നിലൊന്നും നിന്നു നമസ്കരിക്കുന്നുണ്ട് എന്ന് തീര്‍ച്ചയായും നിന്‍റെ രക്ഷിതാവിന്നറിയാം. അല്ലാഹുവാണ് രാത്രിയെയും പകലിനെയും കണക്കാക്കുന്നത്‌. നിങ്ങള്‍ക്ക് അത് ക്ലിപ്തപ്പെടുത്താനാവുകയില്ലെന്ന് അവന്നറിയാം. അതിനാല്‍ അവന്‍ നിങ്ങള്‍ക്ക് ഇളവ് ചെയ്തിരിക്കുന്നു. ആകയാല്‍ നിങ്ങള്‍ ഖുര്‍ആനില്‍ നിന്ന് സൌകര്യപ്പെട്ടത് ഓതിക്കൊണ്ട് നമസ്കരിക്കുക. നിങ്ങളുടെ കൂട്ടത്തില്‍ രോഗികളും ഭൂമിയില്‍ സഞ്ചരിച്ച് അല്ലാഹുവിന്‍റെ അനുഗ്രഹം തേടിക്കൊണ്ടിരിക്കുന്ന വേറെ ചിലരും അല്ലാഹുവിന്‍റെ മാര്‍ഗത്തില്‍ യുദ്ധം ചെയ്യുന്ന മറ്റ് ചിലരും ഉണ്ടാകും എന്ന് അല്ലാഹുവിന്നറിയാം. അതിനാല്‍ അതില്‍ (ഖുര്‍ആനില്‍) നിന്ന് സൌകര്യപ്പെട്ടത് നിങ്ങള്‍ പാരായണം ചെയ്തു കൊള്ളുകയും നമസ്കാരം മുറപ്രകാരം നിര്‍വഹിക്കുകയും സകാത്ത് നല്‍കുകയും അല്ലാഹുവിന്ന് ഉത്തമമായ കടം നല്‍കുകയും ചെയ്യുക. സ്വദേഹങ്ങള്‍ക്ക് വേണ്ടി നിങ്ങള്‍ എന്തൊരു നന്‍മ മുന്‍കൂട്ടി ചെയ്ത് വെക്കുകയാണെങ്കിലും അല്ലാഹുവിങ്കല്‍ അത് ഗുണകരവും ഏറ്റവും മഹത്തായ പ്രതിഫലമുള്ളതുമായി നിങ്ങള്‍ കണ്ടെത്തുന്നതാണ്‌. നിങ്ങള്‍ അല്ലാഹുവോട് പാപമോചനം തേടുകയും ചെയ്യുക. തീര്‍ച്ചയായും അല്ലാഹു ഏറെ പൊറുക്കുന്നവനും കരുണാനിധിയുമാകുന്നു."
        },
        "Norwegian": {
            "verse 73:1": "Du som ligger overdekket,",
            "verse 73:2": "stå opp og våk om natten, unntatt litt",
            "verse 73:3": "– halvparten av den, eller trekk fra litt,",
            "verse 73:4": "eller legg til litt, og fremsi Koranen, langsomt og tydelig!",
            "verse 73:5": "Vi har vektige ord å si deg!",
            "verse 73:6": "Nattens første timer er egnet for de sterkeste inntrykk, og de beste ord.",
            "verse 73:7": "Om dagen har du meget som opptar deg.",
            "verse 73:8": "Kom Herrens navn i hu, og hengi deg fullt og helt til Ham!",
            "verse 73:9": "Han er Herre over øst og vest. Det finnes ingen gud unntatt Ham. La Ham ta seg av deg.",
            "verse 73:10": "Bær tålmodig det folk sier, og hold deg unna dem på en pen måte.",
            "verse 73:11": "Overlat til Meg dem som fornekter, dem som lever et liv i velstand. Gi dem en liten frist.",
            "verse 73:12": "Hos oss finnes lenker, og helvetes ild,",
            "verse 73:13": "kvelende føde, og smertelig straff,",
            "verse 73:14": "på den dag da jord og fjell rystes, da fjellene blir som løs sand.",
            "verse 73:15": "Vi har sendt dere et sendebud, som frembærer vitnesbyrd for dere, som Vi også sendte et sendebud til Farao.",
            "verse 73:16": "Men Farao adlød ikke Sendebudet, og Vi tok ham alvorlig fatt!",
            "verse 73:17": "Hvordan vil dere, hvis dere ikke tror, verge dere mot en dag som gjør barna gråhårede?",
            "verse 73:18": "Himmelen vil revne, og det Han har lovet, vil gå i oppfyllelse!",
            "verse 73:19": "Dette er en påminnelse. La den som vil, finne en vei til Herren.",
            "verse 73:20": "Herren vet at du holder nattevåk, henimot to tredjedeler av natten, eller halvparten eller en tredjepart, således også en flokk av dem som følger deg. Gud bestemmer utstrekningen av natt og dag. Han vet at dere ikke kan holde regning med det, og Han viser miskunn mot dere. Fremsi så meget av Koranen som dere rimeligvis kan. Han vet at det finnes syke blant dere, andre som farter rundt i landet for å søke Guds goder, atter andre er i felten og kjemper for Guds sak. Så fremsi så meget av den som dere rimeligvis kan. Overhold bønnen, betal det rituelle bidrag! Gi Gud et godt lån! Alt godt dere sender i forveien for dere, dere vil finne det igjen hos Gud, som en bedre og større belønning. Be Gud om tilgivelse. Gud er tilgivende, nåderik!"
        },
        "Pashto": {
            "verse 73:1": "اى په ځان پورې جامه راتاوونكیه!",
            "verse 73:2": "په شپه كې لمانځه ته ودرېږه مګر لږه حصه (نه)",
            "verse 73:3": "چې هغه د دغې (شپې) نیمه (ده)، یا ته له دغې (نیمې) نه لږ څه كم شه",
            "verse 73:4": "یا ته په دغې (نیمې) باندې څه اضافه وكړه او قرآن ښه ښكاره واضح لوله، واضح لوستل",
            "verse 73:5": "بېشكه مونږ به خامخا په تا باندې ډېر دروند قول نازلوو",
            "verse 73:6": "بېشكه د شپې پورته كېدل، دغه (پاڅېدل) د (نفس) د پايمال كولو په لحاظ ډېر سخت دي او د (قرآن د) ویلو په لحاظ ډېر سموونكي دي",
            "verse 73:7": "بېشكه تا لره په ورځ كې ډېره اوږده مشغولتیا (مصروفيت) وي",
            "verse 73:8": "او ته د خپل رب نوم یادوه او ده ته (له هر څه نه) جدا شه، پوره جدا كېدل",
            "verse 73:9": "(دغه الله) د مشرق او مغرب رب دى۔، نشته هېڅ لايق د عبادت مګر هم دى دى، نو ته دى (خپل) كار ساز ونیسه",
            "verse 73:10": "او ته په هغو خبرو صبر كوه چې دوى يې وايي او ته دوى پرېږده۔ ډېر ښه پرېښودل",
            "verse 73:11": "او پرېږده ما او دروغ ګڼونكي چې د نعمت والا دي او دوى ته لږ مهلت وركړه",
            "verse 73:12": "بېشكه زمونږ سره درانه ځنځیرونه (زولنې) او سوځوونكى اور دى",
            "verse 73:13": "او داسې طعام دى چې په مرۍ كې نښتونكى دى او ډېر دردوونكى عذاب دى",
            "verse 73:14": "په هغې ورځ كې چې ځمكه او غرونه به خوځېږي او غرونه به د شګو روانې ډېرۍ شي",
            "verse 73:15": "بېشكه مونږ تاسو ته رسول درلېږلى دى، چې په تاسو (د قیامت په ورځ) شاهد دى، لكه څنګه چې مونږ فرعون ته رسول لېږلى و",
            "verse 73:16": "نو فرعون د دغه رسول نافرماني وكړه، نو مونږ دغه (فرعون) ونیولو په سختو نیولو سره",
            "verse 73:17": "كه تاسو كافر شئ، نو تاسو به ځان له هغې ورځې نه څنګه وساتئ چې (واړه) هلكان به سپین ږیري (بوډاګان) وګرځوي",
            "verse 73:18": "اسمان په دغې (ورځ) كې چاودېدونكى دى۔، د دغه (الله) وعده كېدونكې ده",
            "verse 73:19": "بېشكه دا (ایتونه) نصیحت (او پند) دى، نو هغه څوك چې غواړي چې خپل رب ته تلونكې لاره غوره كړي، (نو غوره دې كړي)",
            "verse 73:20": "بېشكه ستا رب یقینًا په دې پوهېږي چې ته د شپې (په درې برخو كې) له دوو نه لږ كم (لمانحهٔ ته) پاڅېږې او (كله) د دې نیمه برخه او (كله) دریمه برخه (هم) او له هغو كسانو نه یوه ډله هم چې له تا سره دي۔ او الله شپه او ورځ مقدار (او اندازه) كوي۔، دى په دې پوه دى چې بېشكه حقیقت دا دى چې تاسو به هرګز د دې طاقت ونه لرئ۔، نو ده پر تاسو باندې رجوع وكړه، نو تاسو له قرآنه هومره لولئ چې اسان وي. دى په دې پوه دى چې یقینًا شان دا دى چې په تاسو كې به مریضان وي او نور به په ځمكه كې سفر كوي، چې د الله فضل به لټوي او نور به د الله په لاره كې جنګ كوي، نو تاسو له دغه (قرآنه) هومره لولئ چې (درته) اسان وي او لمونځ قايموئ او زكاۃت ادا كوئ او الله ته قرض وركوئ، ډېر ښكلى قرض۔ او هر هغه څه چې تاسو يې د خپلو ځانونو لپاره له څه خیره مخكې لېږئ (نو) هغه به تاسو له الله سره ومومئ. دغه ډېر غوره او د اجر په لحاظ ډېر لوى دي او تاسو له الله نه بخښنه وغواړئ، بېشكه الله ډېر بخښونكى، بې حده رحم كوونكى دى"
        },
        "Persian": {
            "verse 73:1": "اى جامه بر خود پيچيده،",
            "verse 73:2": "شب را زنده بدار، مگر اندكى را،",
            "verse 73:3": "نيمه‌اى از آن را، يا اندكى از نيمه كم كن.",
            "verse 73:4": "يا اندكى بر نيمه بيفزاى و قرآن را شمرده و روشن بخوان.",
            "verse 73:5": "ما به تو سخنى دشوار را القا خواهيم كرد.",
            "verse 73:6": "هر آينه شب‌هنگام از بستر برخاستن، موافقت زبان و دل را افزاينده‌تر است و بيان سخن را استواردارنده‌تر.",
            "verse 73:7": "كه كارهاى تو در روز بسيار است.",
            "verse 73:8": "و نام پروردگارت را ياد كن و از همه ببر و به او بپيوند:",
            "verse 73:9": "پروردگار مشرق و مغرب. هيچ خدايى جز او نيست. او را كارساز خويش برگزين.",
            "verse 73:10": "و بر آنچه مى‌گويند صبر كن و به وجهى پسنديده از ايشان دورى جوى.",
            "verse 73:11": "تكذيب كنندگان صاحب نعمت را به من واگذار. و اندكى مهلتشان ده.",
            "verse 73:12": "نزد ماست بندهاى گران و دوزخ،",
            "verse 73:13": "و طعامى گلوگير و عذابى دردآور.",
            "verse 73:14": "روزى كه زمين و كوه‌ها به لرزه آيند و كوه‌ها تپه‌اى از ريگ روان گردند.",
            "verse 73:15": "ما بر شما پيامبرى فرستاديم كه بر اعمالتان گواه است، بدان سان كه بر فرعون هم پيامبرى فرستاديم.",
            "verse 73:16": "و فرعون از پيامبر فرمان نبرد. ما نيز او را به سختى فروگرفتيم.",
            "verse 73:17": "اگر كافر باشيد، در روزى كه كودكان را پير مى‌گرداند چگونه در امان مانيد؟",
            "verse 73:18": "در آن روز آسمان بشكافد و وعده خدا به وقوع پيوندد.",
            "verse 73:19": "اين تذكارى است. پس هر كه بخواهد، راهى به سوى پروردگارش آغاز كند.",
            "verse 73:20": "پروردگار تو مى‌داند كه تو و گروهى از آنان كه با تو هستند نزديك به دو ثلث شب و نيم شب و ثلث شب را به نماز مى‌ايستيد. و خداست كه اندازه شب و روز را معين مى‌كند. و مى‌داند كه شما هرگز حساب آن را نتوانيد داشت. پس توبه شما را بپذيرفت. و هر چه ميّسر شود از قرآن بخوانيد. مى‌داند چه كسانى از شما بيمار خواهند شد، و گروهى ديگر به طلب روزى خدا به سفر مى‌روند و گروه ديگر در راه خدا به جنگ مى‌روند. پس هر چه ميسر شود از آن بخوانيد. نماز بگزاريد و زكات بدهيد و به خدا قرض الحسنه دهيد. و هر خيرى را كه براى خود پيشاپيش بفرستيد، آن را نزد خدا خواهيد يافت. و آن پاداش بهتر است و پاداشى بزرگ‌تر است. و از خدا آمرزش بخواهيد، زيرا خدا آمرزنده و مهربان است."
        },
        "Polish": {
            "verse 73:1": "O ty, owinięty szatą!",
            "verse 73:2": "Czuwaj na modlitwie nocą, niewiele wypoczywając",
            "verse 73:3": "- pół nocy lub nieco mniej",
            "verse 73:4": "Albo trochę więcej i recytuj wyraźnie Koran!",
            "verse 73:5": "My rzucimy ci słowo wielkiej wagi:",
            "verse 73:6": "Oto modlitwa na początku nocy jest bardziej skuteczna i bardziej poprawna w wypowiedzi.",
            "verse 73:7": "Bo przecież w ciągu dnia masz liczne zajęcia.",
            "verse 73:8": "Wspominaj imię twego Pana i poświęć Mu się całkowicie!",
            "verse 73:9": "On Panem Wschodu i Zachodu. Nie ma boga, jak tylko On! Przeto weź Go sobie za opiekuna!",
            "verse 73:10": "Znoś cierpliwie to, co oni mówią! Uciekaj od nich ucieczką piękną!",
            "verse 73:11": "Pozostaw Mnie z tymi, którzy uznają, że to kłamstwo, którzy znajdują się w dobrobycie! I daj im nieco zwłoki!",
            "verse 73:12": "Zaprawdę, My posiadamy łańcuchy i ogień palący,",
            "verse 73:13": "Pożywienie, które staje w gardle, i karę bolesną",
            "verse 73:14": "- na ten Dzień, kiedy zatrzęsie się ziemia i góry, a góry staną się jak ruchome wydmy piasku.",
            "verse 73:15": "Oto posłaliśmy wam Posłańca, aby był świadkiem przeciwko wam; tak jak posłaliśmy posłańca do Faraona.",
            "verse 73:16": "Lecz on nie posłuchał posłańca i ukaraliśmy go za to surową karą.",
            "verse 73:17": "Jakże wy się uchronicie - jeśli pozostaniecie niewiernymi - tego Dnia, który dzieci uczyni siwowłosymi?",
            "verse 73:18": "Niebo rozerwie sie wtedy - dopelni sie Jego obietnica.",
            "verse 73:19": "Zaprawdę, to jest przypomnienie! Przeto ten, kto chce, niech podejmie drogę do swego Pana!",
            "verse 73:20": "Zaprawdę, Twój Pan wie, że ty i ci, którzy są z tobą, trwacie na modlitwie, stojąc blisko dwie trzecie, połowę lub jedną trzecią nocy. Bóg wymierza noc i dzień. On wie, że wy nie policzycie tego, i On wam to przebaczy. Przeto recytujcie głośno to, co jest łatwe z Koranu! On wie, że niektórzy spośród was będą chorzy, a inni będą wędrować po ziemi, poszukując dobroci Boga, a inni będą walczyć na drodze Boga. Przeto recytujcie, co z niego dla was jest łatwe! Odprawiajcie modlitwę i dawajcie jałmużnę! Użyczajcie Bogu pożyczki pięknej! Co wy przygotujecie pierwej dobrego dla waszych dusz, znajdziecie to u Boga - lepszym i większym jako nagrodę. Proście Boga o przebaczenie! Zaprawdę, Bóg jest przebaczający, miłosierny!"
        },
        "Portuguese": {
            "verse 73:1": "Ó tu, acobertado,",
            "verse 73:2": "Levanta-te à noite (para rezar), porém não durante toda a noite;",
            "verse 73:3": "A metade dela ou pouco menos,",
            "verse 73:4": "Ou pouco mais, e recita fervorosamente o Alcorão.",
            "verse 73:5": "Em verdade, vamos revelar-te uma mensagem de peso.",
            "verse 73:6": "Em verdade, o ato de te levantares à noite para rezares é mais marcante e mais adequado.",
            "verse 73:7": "Porque durante o dia tens muitos afazeres.",
            "verse 73:8": "Porém, recorda-te do teu Senhor e consagra-te integralmente a Ele.",
            "verse 73:9": "Ele é o Senhor do Oriente e do Ocidente. Não há mais divindade além d'Ele! Toma-O, pois, por Guardião!",
            "verse 73:10": "E tolera tudo quanto te digam, e afasta-te dignamente deles.",
            "verse 73:11": "E deixa por Minha conta os desmentidores, opulentos, e tolera-os por curto tempo,",
            "verse 73:12": "Porque lhes reservamos os grilhões e o fogo,",
            "verse 73:13": "Um alimento que engasga e um doloroso castigo.",
            "verse 73:14": "Será o dia em que haverão de tremer a terra e as montanhas, e haverão de se converter, as montanhas, em dunas dispersas.",
            "verse 73:15": "Sabei que vos enviamos um Mensageiro, para ser testemunha contra vós, tal como enviamos um mensageiro ao Faraó.",
            "verse 73:16": "Porém, o Faraó desobedeceu ao mensageiro, pelo que o castigamos severamente.",
            "verse 73:17": "Se não crerdes, como, então, vos precavereis, no dia em que envelhecerão as crianças.",
            "verse 73:18": "E o céu se fenderá? Sabei que a Sua promessa se cumprirá!",
            "verse 73:19": "Em verdade, esta é uma admoestação, e, quem quiser, poderá encaminhar-se para a senda do seu Senhor.",
            "verse 73:20": "Em verdade, o teu Senhor sabe que tu te levantas para rezar, algumas vezes durante dois terços da noite, outras, metade, e outras, ainda, um terço, assim como (o faz) uma boa parte dos teus; mas Deus mede a noite e o dia, e bem sabe que não podeis precisar (as horas), pelo que vos absolve. Recitai, pois, o que puderdes do Alcorão! Ele sabe que, entre vós, há enfermos, e outros que viajam pela terra, à procura da graça de Deus, e outros, que combatem pela causa de Deus. Recitai, oferecei espontaneamente a Deus. E todo o bem que fizerdes, será em favor às vossas almas; achareis a recompensa em Deus, porque Deus é Indulgente, Misericordiosíssimo."
        },
        "Punjabi": {
            "verse 73:1": "ਹੇ (ਮੁਹੰਮਦ) ਕੱਪੜੇ ਨੂੰ (ਆਪਣੇ ਆਪ ਉੱਤੇ) ਲਪੇਟਣ ਵਾਲੇ",
            "verse 73:2": "ਰਾਤ ਨੂੰ ਖੜ੍ਹੇ ਹੋਵੇਂ ਪਰੰਤੂ ਥੋੜ੍ਹੀ ਰਾਤ (ਰਹਿੰਦੇ)।",
            "verse 73:3": "ਅੱਧੀ ਰਾਤ ਜਾਂ ਉਸ ਤੋਂ ਵੀ ਕੁਝ ਘੱਟ ਕਰ ਦੇਵੋ।",
            "verse 73:4": "ਜਾਂ ਉਸ ਤੋਂ ਕੁਝ ਵਧਾ ਦੇਵੋ ਅਤੇ ਕੁਰਆਨ ਨੂੰ ਰੁਕ-ਰੂਕ ਕੇ ਪੜੋ।",
            "verse 73:5": "ਅਸੀਂ ਤੁਹਾਡੇ ਉੱਪਰ ਭਾਰੀ ਹੁਕਮ ਉਤਾਰਨ ਵਾਲੇ ਹਾ।",
            "verse 73:6": "ਬੇਸ਼ੱਕ ਰਾਤ ਨੂੰ ਉੱਠਣਾ ਬੇਹੱਦ ਔਖਾ ਹੈ ਅਤੇ ਗੱਲ ਠੀਕ ਨਿਕਲਦੀ ਹੈ।",
            "verse 73:7": "ਬੇਸ਼ੱਕ ਤੁਹਾਨੂੰ ਦਿਨੇ ਬਹੁਤ ਕੰਮ ਰਹਿੰਦਾ ਹੈ।",
            "verse 73:8": "ਅਤੇ ਆਪਣੇ ਰੱਬ ਦਾ ਸਿਮਰਨ ਕਰੋਂ ਅਤੇ ਸਾਰਿਆਂ ਤੋਂ ਅੱਲਗ ਹੋ ਕੇ ਉਸ ਵੱਲ ਧਿਆਨ ਕੇਂਦਰਿਤ ਕਰ ਲਵੋ।",
            "verse 73:9": "ਉਹ ਪੂਰਬ ਅਤੇ ਪੱਛਮ ਦਾ ਮਾਲਕ ਹੈ, ਉਸ ਤੋਂ ਬਿਲ੍ਹਾਂ ਕੋਈ ਪੂਜਨਯੋਗ ਨਹੀਂ। ਸੋ ਤੁਸੀਂ ਉਸ ਨੂੰ ਆਪਣਾ ਸਭ ਕੁਝ ਬਣਾ ਲਵੋਂ।",
            "verse 73:10": "ਅਤੇ ਲੋਕ ਜਿਹੜਾ ਕੁਝ ਆਖਦੇ ਹਨ ਉਸ ਤੇ ਧੀਰਜ ਰੱਖੋ ਅਤੇ ਚੰਗੇ ਤਰੀਕੇ ਨਾਲ ਉਨ੍ਹਾਂ ਤੋਂ ਅਲੱਗ ਹੋ ਜਾਵੋ।",
            "verse 73:11": "ਅਤੇ ਝੁਠਲਾਉਣ ਵਾਲੇ ਸੰਪੰਨ ਲੋਕਾਂ ਦਾ ਮਾਮਲਾ ਮੇਰੇ ਤੇ ਛੱਡ ਦਿਉ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਥੋੜ੍ਹੀ ਜਿਹੀ ਢਿੱਲ ਦੇ ਦੇਵੋ।",
            "verse 73:12": "ਸਾਡੇ ਕੋਲ ਬੇੜੀਆਂ ਅਤੇ ਨਰਕ ਹੈ।",
            "verse 73:13": "ਅਤੇ ਸੰਘ ਵਿਚ ਫਸਣ ਵਾਲਾ ਭੋਜਣ ਹੈ ਅਤੇ ਦੁੱਖਦਾਇਕ ਸਜ਼ਾ ਹੈ।",
            "verse 73:14": "ਜਿਸ ਦਿਨ ਧਰਤੀ ਤੇ ਪਹਾੜ ਹਿੱਲਣ ਲੱਗਣਗੇ ਅਤੇ ਪਹਾੜ ਡਿੱਗਦੇ ਹੋਏ ਰੇਤ ਵਾਂਗ ਢੇਰ ਹੋ ਜਾਣਗੇ।",
            "verse 73:15": "ਅਸੀਂ ਤੁਹਾਡੇ ਵੱਲ ਇੱਕ ਰਸੂਲ ਭੇਜਿਆ ਹੈ, ਤੁਹਾਡੇ ਤੇ ਗਵਾਹ ਬਣਾ ਕੇ, ਜਿਵੇਂ ਅਸੀਂ ਫਿਰਔਨ ਵੱਲ ਇੱਕ ਰਸੂਲ ਭੇਜਿਆ ਸੀ।",
            "verse 73:16": "ਫਿਰ ਫਿਰਔਨ ਨੇ ਰਸੂਲ ਦਾ ਕਹਿਣਾ ਨਾ ਮੰਨਿਆਂ ਤਾਂ ਅਸੀਂ’ ਉਸ ਨੂੰ ਸਖ਼ਤ ਪਕੜ ਨਾਲ ਫੜ੍ਹ ਲਿਆ।",
            "verse 73:17": "ਤਾਂ ਜੇਕਰ ਤੁਸੀਂ ਇਨਕਾਰ ਕੀਤਾ ਤਾਂ ਉੱਸ ਦਿਨ ਦੀ ਸਜ਼ਾ ਤੋਂ ਕਿਵੇਂ ਬਚੋਂਗੇ ਜਿਹੜੀ ਬੱਚਿਆਂ ਨੂੰ ਬੁੱਢਾ ਬਣਾ ਦੇਵੇਗੀ।",
            "verse 73:18": "ਜਿਸ ਵਿਚ ਅਸਮਾਨ ਪਾਟ ਜਾਏਗਾ ਬੇਸ਼ੱਕ ਉਸ (ਅੱਲਾਹ) ਦਾ ਵਾਅਦਾ ਪੂਰਾ ਹੋ ਕੇ ਰਹੇਗਾ।",
            "verse 73:19": "ਇਹ ਇੱਕ ਸਿੱਖਿਆ ਹੈ, ਇਸ ਲਈ ਜੇ ਚਾਹੋ ਤਾਂ ਆਪਣੇ ਰੱਬ ਵੱਲ (ਜਾਣ ਵਾਲਾ) ਰਾਹ ਅਪਣਾ ਲਵੋ।",
            "verse 73:20": "ਬੇਸ਼ੱਕ ਤੁਹਾਡਾ ਰੱਬ ਜਾਣਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਲੱਗਭਗ ਦੋ ਤਿਆਹੀ ਰਾਤ ਜਾਂ ਅੱਧੀ ਰਾਤ ਜਾਂ ਇੱਕ ਤਿਆਹੀ ਰਾਤ (ਨਮਾਜ਼ ਲਈ) ਖੜੇ ਹੁੰਦੇ ਹੋ ਅਤੇ ਇੱਕ ਵਰਗ ਤੁਹਾਡੇ ਸਾਥੀਆਂ ਵਿਚੋਂ ਵੀ। ਅਤੇ ਅੱਲਾਹ ਹੀ ਰਾਤ ਅਤੇ ਦਿਨ ਦਾ ਪੈਮਾਨਾਂ ਤੈਅ ਕਰਦਾ ਹੈ। ਉਸ ਨੇ ਜਾਣਿਆਂ ਹੈ ਕਿ ਤੁਸੀਂ ਉਸ ਨੂੰ ਪੂਰਾ ਨਹੀਂ ਕਰ ਸਕੋਗੇ। ਅਤੇ ਉਸ ਨੇ ਤੁਹਾਡੇ ਉੱਪਰ ਕਿਰਪਾ ਕੀਤੀ ਹੈ ਹੁਣ ਕੁਰਆਨ ਵਿੱਚੋਂ ਪੜ੍ਹੋ ਜਿੰਨ੍ਹਾ ਤੁਹਾਨੂੰ ਸੌਖਾ ਲੱਗੇ। ਉਸ ਨੇ ਜਾਣਿਆ ਹੈ ਕਿ ਤੁਹਾਡੇ ਵਿਚੋਂ ਰੋਗੀ ਹੋਣਗੇ ਅਤੇ ਕਿੰਨੇ ਲੋਕ ਅੱਲਾਹ ਦੀ ਖੋਜ ਵਿਚ ਧਰਤੀ ਤੇ ਸਫ਼ਰ ਕਰਨਗੇ ਅਤੇ ਦੂਜੇ ਅਜਿਹੇ ਲੋਕ ਵੀ ਹੋਣਗੇ ਜਿਹੜੇ ਅੱਲਾਹ ਦੇ ਰਾਹ ਵਿਚ ਜਿਹਾਦ ਕਰਨਗੇ। ਤਾਂ ਇਸ ਕੁਰਆਨ ਵਿਚੋਂ ਕਰੋ। ਅਤੇ ਅੱਲਾਹ ਨੂੰ ਕਰਜ਼ਾ ਦੇਵੋ, ਵਧੀਆ ਕਰਜ਼ਾ। ਅਤੇ ਜਿਹੜੀ ਨੇਕੀ ਤੁਸੀਂ ਅੱਗੇ ਭੇਜੋਗੇ ਉਸ ਨੂੰ ਅੱਲਾਹ ਦੇ ਕੋਲ ਹਾਜ਼ਿਰ ਦੇਖੌਗੇ। ਉਹ ਉਤਮ ਹੈ ਅਤੇ ਪੁੰਨ ਵਿਚ ਵੱਧ ਹੈ। ਅੱਲਾਹ ਤੋਂ ਮੁਆਫ਼ੀ ਮੰਗੋਂ ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਮੁਆਫ਼ ਕਰਨ ਵਾਲਾ ਰਹਿਮ ਵਾਲਾ ਹੈ।"
        },
        "Roman english": {
            "verse 73:1": "Yaw ayyuhal muzzammil",
            "verse 73:2": "Qumil laila illaa qaleelaa",
            "verse 73:3": "Nisfahooo awinqus minhu qaleelaa",
            "verse 73:4": "Aw zid `alaihi wa rattilil Qur`aana tarteela",
            "verse 73:5": "Innaa sanulqee `alika qawalan saqeelaa",
            "verse 73:6": "Inn naashi`atal laili hiya ashadddu wat anw wa aqwamu qeelaa",
            "verse 73:7": "Inna laka fin nahaari sabhan taweelaa",
            "verse 73:8": "Wazkuris ma rabbika wa tabattal ilaihi tabteelaa",
            "verse 73:9": "Rabbul mashriqi wal maghriibi laaa ilaaha illaa Huwa fattakhizhu wakeelaa",
            "verse 73:10": "Wasbir `alaa maa yaqoo loona wahjurhum hajran jameelaa",
            "verse 73:11": "Wa zarnee walmukaz zibeena ulin na`mati wa mahhilhum qaleelaa",
            "verse 73:12": "Inna ladainaaa ankaalanw wa jaheemaa",
            "verse 73:13": "Wa ta`aaman zaa ghussa tinw wa`azaaban aleemaa",
            "verse 73:14": "Yawma tarjuful ardu waljibaalu wa kaanatil jibaalu kaseebam maheelaa",
            "verse 73:15": "Innaa arsalnaaa ilaikum rasoolan shahidan `alikum kamaaa arsalnaaa ilaa Fir`awna Rasoolna",
            "verse 73:16": "Fa`asaa Fir`awnur Rasoola fa akhaznaahu akhzanw wabeelaa",
            "verse 73:17": "Fakaifa tattaqoona in kafartum yawmany yaj`alul wildaana sheeba",
            "verse 73:18": "Assamaaa`u munfatirum bih; kaana wa`duhoo maf`oola",
            "verse 73:19": "Inna haazihee tazkiratun fa man shaaa`at takhaza ilaa Rabbihee sabeelaa",
            "verse 73:20": "Inna Rabbaka ya`lamu annaka taqoomu adnaa min sulusa yil laili wa nisfahoo wa sulusahoo wa taaa`ifatum minal lazeena ma`ak; wal laahu yuqaddirul laila wanna haar; `alima al lan tuhsoohu fataaba `alaikum faqra`oo maa tayassara minal quraan; `alima an sa yakoonu minkum mardaa wa aakharoona yadriboona fil ardi yabtaghoona min fadlil laahi wa aakharoona yuqaatiloona fee sabeelil laahi faqra`oo ma tayassara minhu wa aqeemus salaata wa aatuz zakaata wa aqridul laaha qardan hasanaa; wa maa tuqadimoo li anfusikum min khairin tajidoohu `indal laahi huwa khayranw wa a`zama ajraa; wastaghfirul laahaa innal laaha ghafoorur raheem"
        },
        "Russian": {
            "verse 73:1": "О завернувшийся в свой плащ!",
            "verse 73:2": "Простаивай в молитве ночь, И коль не всю,",
            "verse 73:3": "То половину, иль немногим меньше,",
            "verse 73:4": "Иль к этому прибавь, - Коран читай размеренным (и стройным) чтеньем.",
            "verse 73:5": "Мы скоро ниспошлем тебе Слова весомости великой.",
            "verse 73:6": "Вставание в начальные часы ночИ И ум, и душу просветляет и силу придает словам, -",
            "verse 73:7": "Ведь день твой полон множеством забот.",
            "verse 73:8": "Так поминай же имя Бога своего И устремись к Нему всем сердцем -",
            "verse 73:9": "Владыке и восхода, и заката, - Ведь нет другого божества, кроме Него! Возьми ж Его ты в покровители себе.",
            "verse 73:10": "Терпимо относись к словам (неверных) И с честью отойди от них.",
            "verse 73:11": "И предоставь Мне справиться со всеми, Кто, наслаждаясь благами на сей земле, Все ж истину за ложь считает. Ты дай короткую отсрочку им.",
            "verse 73:12": "У Нас для них тяжелые оковы и Огонь,",
            "verse 73:13": "И удавляющие яства, И мучительные кары.",
            "verse 73:14": "В тот День Земля и горы содрогнутся, Сыпучими холмами станут горы.",
            "verse 73:15": "Мы к вам посланника послали Свидетельствовать против вас, Как Мы послали (Мусу) к Фараону.",
            "verse 73:16": "Но Фараон отверг его (призыв), За что схватили Мы его мучительною карой.",
            "verse 73:17": "Так как же оградите вы себя, Коль вы в неверии живете, От Дня того, Когда (от ужаса) седыми дети станут?",
            "verse 73:18": "Тогда расколется небесный свод, И сбудется Господне обещанье.",
            "verse 73:19": "Ведь это - увещание (Аллаха), А потому всяк, кто того желает, Дорогой праведной идет (к Нему).",
            "verse 73:20": "Поистине, (о Мухаммад!), Господь твой знает, Что меньше чем две трети ночи Стоишь (в ночной молитве) ты, А то и половину или треть ее, И так же делают твои собратья. Господь наш размеряет ночь и день, И знает Он, что вы не в состоянье отсчет (ночным часам) вести, А потому, (прощая вас за это), Он говорит: \"Читайте из Корана то, что вам легко\". Он знает, что средь вас больные могут быть И те, кто в поисках Господних благ По странам разным разъезжает, А также те, кто за Господне дело В сраженьях (жизнь свою проводит). А потому читайте из Корана то, что вам легко, И по часам молитву отправляйте, И приносите очистительную подать, И предоставьте Господу прекрасный займ, (Что будет Им оплачен щедро). Ведь все то доброе, что вы Для душ своих загОдя предпошлете, Найдете вы в присутствии Господнем - Но в большей мере и почетней по награде. Просите о прощении Аллаха, - Ведь, истинно, Аллах прощающ, милосерд!"
        },
        "Sindhi": {
            "verse 73:1": "اي (پاڻ تي) ڪپڙي ويڙھڻ ورا مڙس.",
            "verse 73:2": "رات جو کڙو ٿيءُ پر ٿورو.",
            "verse 73:3": "رات جو اڌ يا اڌ رات کان ٿورو گھٽاءِ.",
            "verse 73:4": "يا اڌ رات تي وڌاءِ ۽ قرآن ٺاھي ٺاھي پڙھ.",
            "verse 73:5": "بيشڪ اسين توتي ھڪ ڳرو حُڪم نازل ڪنداسين.",
            "verse 73:6": "بيشڪ رات جو اُٿڻ (نفس جي) جھڪي ڪرڻ ۾ تمام سخت آھي ۽ لفظن (چوڻ) ۾ تمام پڪو آھي.",
            "verse 73:7": "بيشڪ توکي ڏينھن ۾ گھڻو ڌنڌو آھي.",
            "verse 73:8": "۽ پنھنجي پالڻھار جو نالو ياد ڪر ۽ سڀني پاسن کان ھڪ طرفو ٿي چڱي طرح ڏانھس متوجه ٿيءُ.",
            "verse 73:9": "جو اوڀر ۽ اولھ جو پالڻھار آھي ان کانسواءِ ٻيو ڪو عبادت جو لائق نه آھي تنھنڪري تون کيس ڀرجھلو ڪري وٺ.",
            "verse 73:10": "۽ (ڪافر) جيڪي چوندا آھن تنھن تي صبر ڪر ۽ چڱي طرح انھن کي ڇڏي ڏي.",
            "verse 73:11": "۽ مون کي ۽ جيڪي ڪوڙ ڀائيندڙ آسودا آھن تن کي ڇڏي ڏي ۽ اُنھن کي ٿوري مُھلت ڏي.",
            "verse 73:12": "بيشڪ اسان وٽ (ڳرا) نيل ۽ ٻاريل باھ آھي.",
            "verse 73:13": "۽ نڙي گھٽيندڙ طعام ۽ ڏکوئيندڙ عذاب آھي.",
            "verse 73:14": "جنھن ڏينھن زمين ۽ جبل ڌٻندا ۽ جبل واريءَ جا ڍڳ ھاريل ٿيندا.",
            "verse 73:15": "(اي ماڻھو) بيشڪ اسان اوھان ڏانھن ھڪ پيغمبر اوھان تي شاھدي ڏيندڙ موڪليو جھڙي طرح فرعون ڏانھن (موسى) پيغمبر (ڪري) موڪليوسون.",
            "verse 73:16": "پوءِ فرعون اُن پيغمبر جي نافرماني ڪئي تنھنڪري اُن کي سخت پڪڙ ۾ پڪڙيوسون.",
            "verse 73:17": "پوءِ جيڪڏھن (اوھين) ڪافر رھندؤ ته اھڙي ڏينھن کان ڪيئن بچندو جيڪو ٻارن کي ٻڍو ڪندو.",
            "verse 73:18": "اُن ڏينھن ۾ آسمان ڦاٽندو، الله جو انجام (ضرور پورو) ٿيڻو آھي.",
            "verse 73:19": "بيشڪ ھيءَ نصيحت آھي، پوءِ جيڪو گھري سو پنھنجي پالڻھار ڏانھن واٽ وٺي.",
            "verse 73:20": "بيشڪ تنھنجو پالڻھار ڄاڻندو آھي ته تون ٻن ٽھائن رات جي ويجھو اُٿندڙ آھين ۽ اڌ رات جو ۽ ٽھائي رات جي ۽ جيڪي تو ساڻ آھن تن مان به ھڪ ٽولي (اٿندي آھي)، ۽ الله رات ۽ ڏينھن جو اندازو ڪندو آھي، الله ڄاتو ته اوھين رات جو اُٿڻ پورو ڪري نه ٿا سگھو تنھنڪري اوھان تي (ٻاجھ سان) موٽيو پوءِ جيترو آسان ٿي سگھي سو قرآن مان پڙھو، الله ڄاڻي چڪو ته اوھان مان ڪي بيمار ٿيندا ۽ ٻيا جي زمين ۾ مسافري ڪن ٿا الله جي فضل مان (روزيءَ جي) طلب ڪن ٿا ۽ ٻيا الله جي واٽ ۾ (ڪافرن سان) وڙھن ٿا، تنھنڪري جيترو قرآن مان آسان ٿي سگھي سو پڙھو ۽ نماز کي قائم رکو ۽ زڪوٰة ڏيو ۽ الله کي چڱيءَ طرح قرض ڏيو، ۽ جيڪي پاڻ لاءِ چڱائي مان اڳي موڪليندؤ تنھن کي الله وٽ وڌيڪ چڱو ۽ اجر ڪري تمام وڏو لھندؤ، ۽ الله کان بخشش گھرو، ڇوته الله بخشڻھار مھربان آھي."
        },
        "Sinhalese": {
            "verse 73:1": "අහෝ පොරවා ගෙන සිටින්නාණනි!",
            "verse 73:2": "සුළු කාලයක් හැර රාත්‍රියෙහි නැගිට සිට නැමදුම් කරනු.",
            "verse 73:3": "එයින් අඩක් හෝ එයින් ස්වල්පයක් හෝ නුඹ අඩු කර ගනු.",
            "verse 73:4": "නැතහොත් ඊට වඩා වැඩි කර ගනු. තවද අල් කුර්ආනය නිසි අයුරින් පිළිවෙළට පාරායනය කරනු.",
            "verse 73:5": "නියත වශයෙන්ම අපි නුඹ වෙත බරැති ප්‍රකාශයක් මතු හෙළන්නෙමු.",
            "verse 73:6": "නියත වශයෙන්ම රාත්‍රියේ අවදිවීම (සිත්) දමනයට වඩාත් බලගතුය. තවද කියවීමට වඩාත් උචිතය.",
            "verse 73:7": "දහවල් කාලයේ නියත වශයෙන්ම ඔබට දිගු කාර්ය භාරයක් ඇත.",
            "verse 73:8": "තවද ඔබේ පරමාධිපතිගේ නාමය ඔබ මෙනෙහි කරනු. තවද (නැමදුමෙහි) ඔහු වෙත පූර්ණ ව යොමු වනු.",
            "verse 73:9": "ඔහු නැගෙනහිර හා බටහිරෙහි හිමිපාණන්ය. ඔහු හැර වෙනත් දෙවිඳෙකු නොමැත. එහෙයින් භාරකරුවකු වශයෙන් ඔබ ඔහු ගනු.",
            "verse 73:10": "තවද ඔවුන් පවසන දෑ ගැන නුඹ ඉවසනු. තවද අලංකාර මග හැරීමකින් ඔවුන් මග හරිනු.",
            "verse 73:11": "තවද සැප පහසුකමින් යුත් බොරු පවසන්නන් මා සමඟ නුඹ අත්හැර දමනු. තවද නුඹ ඔවුනට ස්වල්ප කාලයක් අවකාශ දෙනු.",
            "verse 73:12": "නියත වශයෙන්ම අප වෙත (ඔවුන් සඳහා) විලංගු හා නිරය ද ඇත.",
            "verse 73:13": "උගුර හිර කරන ආහාරයක් හා වේදනීය දඬුවමක් ද (ඇත).",
            "verse 73:14": "එදින මහපොළොව හා කඳු කම්පනය වෙයි. තවද කඳු හැළෙන සුළු ගොඩ ගසා ඇති පස් බවට පත් වනු ඇත.",
            "verse 73:15": "ෆිර්අවුන් වෙත අපි දූතයකු එව්වාක් මෙන් නුඹලා මත සාක්ෂි දරන දූතයකු නුඹලා වෙත සැබැවින්ම අපි එව්වෙමු.",
            "verse 73:16": "නමුත් ෆිර්අවුන් එම දූතයාණන්ට පිටුපෑවේය. එහෙයින් අපි ඔහු බිහිසුනු ග්‍රහණයකින් ග්‍රහණය කළෙමු.",
            "verse 73:17": "නුඹලා ප්‍රතික්ෂේප කළේ නම් දරුවන් පවා මහලුන් බවට පත් කරන දිනයෙහි නුඹලා කෙසේ නම් ආරක්ෂා වන්නෙහු ද?",
            "verse 73:18": "එහි අහස පිපිරී යන්නකි. ඔහුගේ ප්‍රතිඥාව සිදු කරනු ලබන්නක් විය.",
            "verse 73:19": "නියත වශයෙන්ම මෙය මෙනෙහි කිරීමකි. එහෙයින් කවරෙකු අභිමත කරන්නේ ද ඔහු එය තම පරමාධිපති වෙත වූ මාර්ගයක් ලෙස ගනිත්වා!",
            "verse 73:20": "නියත වශයෙන්ම නුඹ රාත්‍රියෙන් තුනෙන් දෙකකට වඩා අඩු කාලයක් ද ඉන් අඩක් ද තුනෙන් එකක කොටසක් ද නැගී සිටින බවත් නුඹ සමග සිටින අය අතරින් පිරිසක් ද (එසේ) සිටින බවත් නියත වශයෙන්ම නුඹගේ පරමාධිපති දන්නේය. අල්ලාහ් රාත්‍රිය හා දහවල නිර්ණය කරන්නේය. නුඹලා එය (නිවැරදිව) ගණන් නොකරන බව ඔහු දන්නේය. එවිට ඔහු නුඹලාට සමාව දුන්නේය. එහෙයින් අල් කුර්ආනයෙන් පහසු දෑ නුඹලා පාරායනය කරනු. නුඹලා අතර රෝගීන් හා අල්ලාහ්ගේ භාග්යයන් සොයා මහපොළොවේ සැරිසරන වෙනත් අය හා අල්ලාහ්ගේ මාර්ගයේ සටන් වදින තවත් අයද සිටින බව ඔහු දන්නේය. එහෙයින් එයින් පහසු දෑ නුඹලා පාරායනය කරනු. තවද සලාතය නිසි අයුරින් ඉටු කරනු. zසකාත් ද දෙනු. අල්ලාහ්ට අලංකාර ණයක් දෙනු. නුඹලා වෙනුවෙන් කවර යහපතක් නුඹලා ඉදිරිපත් කරන්නේ ද නුඹලා එය අල්ලාහ් අබියස දැක ගනු ඇත. එය ශ්‍රේෂ්ඨය. ප්‍රතිඵලයෙන් වඩාත් ඉමහත්ය. තවද නුඹලා අල්ලාහ්ගෙන් සමාව අයැද සිටිනු. නියත වශයෙන්ම අල්ලාහ් අති ක්ෂමාශීලීය. මහා කරුණාන්විතය."
        },
        "Somali": {
            "verse 73:1": "(Nabiga) Isduuduubayow.",
            "verse 73:2": "Istaag habeenka (Tuko) wax yar Mooyee.",
            "verse 73:3": "Nuskiisa tuko ama ka nusqaami wax yar.",
            "verse 73:4": "Ama ka badi, Quraanku u akhri si fiican.",
            "verse 73:5": "Annagaa Kugu Dakin Hadal Culus (wayne).",
            "verse 73:6": "Habeenka Saacadihiisa (oo la tukado) yaa ku daran khushuucda Aadna u toosan.",
            "verse 73:7": "Maalintii waxaa kuu sugnaaday shaqa Dheer.",
            "verse 73:8": "Magaca Eebana xus cibaadadiisana u go'.",
            "verse 73:9": "Qorrax ka soobax iyo u Dhaeba Eebaa iska leh, isaga Mooyee ilaah kalena ma jiro ee ka yeelo wakiil (la cuskado).",
            "verse 73:10": "kuna Samir waxay sheegi gaaladu, si Quruxsanna uga hijroo (iskaga tag).",
            "verse 73:11": "Isu kaanna daa aniga iyo kuwa Beeniyay xaqa ee Nicmaysan wax yarna Sug.",
            "verse 73:12": "Agtannada waxaa ah caddibaad iyo Naarta Jaxiimo.",
            "verse 73:13": "Iyo cunno lagu Margado iyo Cadaab daran.",
            "verse 73:14": "(waxay ku dhiei Arrintaasu) Maalinta Dhulka iyo Buuruhu Gilgilan, Buuruhuna ay noqon Tamuux socda.",
            "verse 73:15": "Annagaa idiin dirray Rasuul markhaati ah, sidaan ugu dirray fircoonba Rasuul.",
            "verse 73:16": "Fircoonna wuu Caasiyay Rasuulkii (Nabi Muuse). Firconna waxaan ku Qabannay qabasha Daran.",
            "verse 73:17": "Ee seebaad Gaalloy uga dhawrsanaysaan Caddibaadda Maalinta qiyaame ee carruurta Cirroole ka Yeeli Hadaad Gaalawdaan.",
            "verse 73:18": "Samaduna Maalintaas Darteed ay la Dildillaaci Balaanqaadka Eebana waa wax Dhici.",
            "verse 73:19": "Aayadahani Waa waano Ee Ruuxii Doona Eeba xaggiisa jid ha uga yeesho.",
            "verse 73:20": "Eebahaa wuxuu ogyahay Nabiyow inaad tukatid wax ka yar habeenka saddex Meelood laba iyo Badhkiis iyo saddex meelood meel, iyo in koox ka mida kuwa kula jira ay tukato, Eebana waa u qadaranyahay Habeenka iyo Maalintuba, wuxuuna Ogyahay inaydaan Koobi karin, wuuna Idinka toobad aqbalay ee Akhriya wixii idiin Fududaada oo quraan ah, wuxuu Eebe ogyahay inay idin ka mid Noqon kuwa Buka iyo kuwo safri iyagoo dooni Khayrka Eebe iyo kuwo u dagaallami Jidka Eebe ee akhriya wixii idiin Fududaada oo Quraan ah, Salaaddana ooga Zakadana Bixiya Eebana wax wanaagsan daynsada Waxaad naftiinna u hormarsataan oo khayr ahna waxaad ka ogaandoontaan kana Heleysaan Eeba Agtiisa Isagoo khayr ah iyo Ajri wayn, ee Eebe Dambi dhaaf waydiista waa Dambi Dhaafe Naxariiste."
        },
        "Spanish": {
            "verse 73:1": "Oh tú que te envuelves en el manto!",
            "verse 73:2": "Permanece rezando por la noche a excepción de un poco!",
            "verse 73:3": "La mitad o algo menos,",
            "verse 73:4": "o algo más. Y recita el Corán pausadamente.",
            "verse 73:5": "Realmente vamos a depositar en ti palabras de peso.",
            "verse 73:6": "Y en el seno de la noche hay mayor quietud y es más certera la dicción.",
            "verse 73:7": "Durante el día llevas a cabo una larga actividad.",
            "verse 73:8": "Recuerda el nombre de tu Señor y concéntrate de lleno en Él.",
            "verse 73:9": "El Señor del oriente y del occidente, no hay dios sino Él; tomadlo como Protector.",
            "verse 73:10": "Ten paciencia con lo que dicen y aléjate de ellos con delicadeza.",
            "verse 73:11": "Y déjame con los que niegan la verdad, ésos que gozan de bienestar. Dales un poco de plazo.",
            "verse 73:12": "Cierto es que junto a Nos hay cadenas y un fuego inflamado,",
            "verse 73:13": "un alimento que se atraganta y un doloroso castigo.",
            "verse 73:14": "El día en que la tierra y las montañas se estremezcan y sean como arena esparcida.",
            "verse 73:15": "Os hemos enviado un mensajero que es testigo sobre vosotros, al igual que a Firaún le enviamos otro mensajero.",
            "verse 73:16": "Firaún desobedeció al mensajero y lo agarramos con un fuerte castigo.",
            "verse 73:17": "Y cómo habríais de tener temor, si os habéis negado a creer, del día en que los recién nacidos encanecerán?",
            "verse 73:18": "Por su causa el cielo se partirá y Su promesa será un hecho.",
            "verse 73:19": "Realmente esto es un recuerdo; quien quiera, que tome un camino hacia su Señor.",
            "verse 73:20": "Tu Señor sabe que permaneces por la noche rezando durante algo menos de dos tercios o durante la mitad o un tercio, así como una parte de los que están contigo.Allah, que mide la noche y el día, sabe que no podréis ser constantes en ello y se ha vuelto a vosotros con indulgencia, así pues recitad del Corán lo que os sea fácil.Él sabe que entre vosotros hay enfermos, que algunos viajan por la tierra buscando el favor de Allah y que otros luchan en el camino de Allah, de modo que recitad de él lo que os sea fácil, estableced el salat, entregad el zakat y hacedle a Allah un generoso préstamo.El bien que adelantéis en vuestro favor lo encontraréis junto a Allah. Eso es mejor y posee más recompensa.Y pedid perdón a Allah, realmente Allah es Perdonador y Compasivo."
        },
        "Swahili": {
            "verse 73:1": "Ewe uliye jifunika!",
            "verse 73:2": "Kesha usiku kucha, ila kidogo tu!",
            "verse 73:3": "Nusu yake, au ipunguze kidogo.",
            "verse 73:4": "Au izidishe - na soma Qur'ani kwa utaratibu na utungo.",
            "verse 73:5": "Hakika Sisi tutakuteremshia kauli nzito.",
            "verse 73:6": "Hakika kuamka usiku kunawafikiana zaidi na moyo, na maneno yake yanatua zaidi.",
            "verse 73:7": "Kwani hakika mchana una shughuli nyingi.",
            "verse 73:8": "Na lidhukuru jina la Mola wako Mlezi, na ujitolee kwake kwa ukamilifu.",
            "verse 73:9": "Mola Mlezi wa mashariki na magharibi, hapana mungu isipo kuwa Yeye, basi mfanye kuwa Mtegemewa wako.",
            "verse 73:10": "Na vumilia hayo wayasemayo, na jitenge nao kwa vizuri.",
            "verse 73:11": "Na niache Mimi na hao wanao kanusha, walio neemeka; na wape muhula kidogo!",
            "verse 73:12": "Hakika Sisi tunazo pingu nzito na Moto unao waka kwa ukali kabisa!",
            "verse 73:13": "Na chakula kinacho kwama kooni, na adhabu inayo umiza.",
            "verse 73:14": "Siku ambayo ardhi itatikiswa na milima pia, na milima itakuwa kama tifutifu la mchanga!",
            "verse 73:15": "Hakika Sisi tumemtuma kwenu Mtume aliye shahidi juu yenu, kama tulivyo mtuma Mtume kwa Firauni.",
            "verse 73:16": "Lakini Firauni alimuasi huyo Mtume, basi tukamshika mshiko wa mateso.",
            "verse 73:17": "Basi nyinyi mkikufuru, mtawezaje kujikinga na Siku ambayo itawafanya watoto wadogo waote mvi?",
            "verse 73:18": "Hapo mbingu zitapasuka! Ahadi yake itakuwa imetekelezwa.",
            "verse 73:19": "Kwa hakika hili ni kumbusho. Mwenye kutaka atashika njia ya kwendea kwa Mola wake Mlezi.",
            "verse 73:20": "Hakika Mola wako Mlezi anajua ya kuwa hakika wewe unakesha karibu na thuluthi mbili za usiku, na nusu yake, na thuluthi yake. Na baadhi ya watu walio pamoja nawe kadhaalika. Na Mwenyezi Mungu ndiye anaye ukadiria usiku na mchana. Anajua kuwa hamwezi kuweka hisabu, basi amekusameheni. Basi someni kilicho chepesi katika Qur'ani. Anajua ya kuwa baadhi yenu watakuwa wagonjwa, na wengine wanasafiri katika ardhi wakitafuta fadhila ya Mwenyezi Mungu, na wengine wanapigana katika Njia ya Mwenyezi Mungu. Kwa hivyo someni kilicho chepesi humo, na mshike Sala, na toeni Zaka, na mkopesheni Mwenyezi Mungu mkopo mwema. Na kheri yoyote mnayo itanguliza kwa ajili ya nafsi zenu mtaikuta kwa Mwenyezi Mungu, imekuwa bora zaidi, na ina thawabu kubwa sana. Na mtakeni msamaha Mwenyezi Mungu. Hakika Mwenyezi Mungu ni Mwenye kusamehe Mwenye kurehemu."
        },
        "Swedish": {
            "verse 73:1": "DU som täcker över dig [med din mantel]!",
            "verse 73:2": "Vaka [i bön] under natten, inte hela,",
            "verse 73:3": "men halva natten - eller förkorta denna tid något,",
            "verse 73:4": "eller förläng den - och läs högt ur Koranen i en lugn och jämn rytm, med klart uttal och tanken fäst vid dess mening.",
            "verse 73:5": "Vi inpräglar i ditt [hjärta] ord av stor vikt. -",
            "verse 73:6": "Den nattliga [bönen] går med stadigare steg och dess ord ljuder renare,",
            "verse 73:7": "medan en strid ström av ärenden om dagen påkallar din uppmärksamhet.",
            "verse 73:8": "Åkalla alltid din Herres namn och ge dig i din andakt hän åt Honom med hela din själ.",
            "verse 73:9": "Han är Herre över öst och väst; ingen gudom finns utom Han. Lita därför [i allt] till Honom som din Beskyddare",
            "verse 73:10": "och bär vad [illasinnade människor] säger med tålamod, men håll dig värdigt på avstånd från dem.",
            "verse 73:11": "Och lämna åt Mig att [ta itu med] dem som förnekar sanningen [i Mina budskap] och ägnar sig åt att njuta av livets goda [utan en tanke på evigheten]. Låt dem hållas ännu en liten tid!",
            "verse 73:12": "Hos Oss ligger bojor [i beredskap] och helvetets eld [väntar]",
            "verse 73:13": "och föda som kväver [den ätande], och [annat] svårt lidande,",
            "verse 73:14": "den Dag då jorden och bergen skall bäva och bergen bli till drivor av lös sand.",
            "verse 73:15": "VI HAR sänt ett sändebud till er, som skall vittna mot er, liksom Vi sände ett sändebud till Farao.",
            "verse 73:16": "Men Farao lydde inte sändebudet och Vi straffade honom med ett fruktansvärt straff.",
            "verse 73:17": "Om ni framhärdar i att förneka sanningen, hur skall ni skydda er mot [följderna av detta] den Dag då barnens lockar skall gråna,",
            "verse 73:18": "himlen skall rämna och Hans löfte bli verklighet",
            "verse 73:19": "Detta är en påminnelse. Låt nu den som vill, söka en väg till sin Herre [medan det är tid]!",
            "verse 73:20": "DIN HERRE vet att du [Muhammad] vakar [i bön] nästan två tredjedelar av natten eller halva natten eller en tredjedel av den, tillsammans med några av dina följeslagare. Och Gud, som fastställer nattens och dagens längd, vet att ni inte håller räkning på [era vakor] och Han vänder Sig till er [och lättar i Sin barmhärtighet era bördor]. Läs således ur Koranen vad ni med lätthet kan läsa. [Gud] vet att det kommer att finnas sjuka bland er och andra som färdas långt bort för att söka [den utkomst som] Han i Sin godhet [beviljar dem], och andra som kämpar för Guds sak. Läs alltså vad ni med lätthet kan läsa och förrätta bönen och hjälp de behövande och ge Gud ett lån av goda gärningar - varje god handling som ni sänder framför er [till Domen] skall ni återfinna hos Gud, förskönad och [följd av] en rikare belöning. Och be om Guds förlåtelse för era synder - Gud är ständigt förlåtande, barmhärtig!"
        },
        "Tajik": {
            "verse 73:1": "Эй ҷома бар худ печида,",
            "verse 73:2": "Шабро зинда бидор, магар андакеро,",
            "verse 73:3": "нимае аз онро ё андаке аз нима кам кун,",
            "verse 73:4": "ё андаке бар нима бияфзой ва Қуръонро оҳиставу равшан бихон.",
            "verse 73:5": "Мо ба ту сухане душворро илқо (андохтан, омӯхтан) хоҳем кард.",
            "verse 73:6": "Албатта шабҳангом аз бистар бархостан мувофиқати забону дилро афзояндатар аст ва баёни суханро устувор дорандатар",
            "verse 73:7": "ки корҳои ту дар рӯз бисёр аст.",
            "verse 73:8": "Ва номи Парвардигоратро ёд кун ва аз ҳама бибур ва ба Ӯ бипайванд:",
            "verse 73:9": "Парвардигори машриқу мағриб. Ҳеҷ худое ғайри Ӯ нест. Ӯро корсози худ интихоб кун!",
            "verse 73:10": "Ва бар он чӣ мегӯянд, сабр кун ва ба ваҷҳе писандида аз онҳо дурӣ ҷӯй.",
            "verse 73:11": "Дурӯғбарорандагони соҳибнеъматро ба Ман бигузор. Ва андаке мӯҳлаташон деҳ.",
            "verse 73:12": "Назди Мост бандҳои вазнин ва дӯзах.",
            "verse 73:13": "ва таъоме гулӯгиру азобе дардовар,",
            "verse 73:14": "рӯзе, ки замину кӯҳҳо ба ларза оянд ва кӯҳҳо теппае аз реги равон гарданд!",
            "verse 73:15": "Мо бар шумо паёмбаре фиристодем, ки бар амалҳоятон гувоҳ аст, ҳамон тавр, ки ба Фиръавн ҳам паёмбаре фиристодем.",
            "verse 73:16": "Ва Фиръавн ба паёмбар фармон набурд. Мо низ ӯро ба сахтӣ фурӯ гирифтем.",
            "verse 73:17": "Агар кофир бошед, дар рӯзе, ки кӯдаконро пир мегардонад, чӣ гуна дар амон монед?",
            "verse 73:18": "Дар он рӯз осмон бишикофад ва ваъдаи Худо ба вуқӯъ пайвандад.",
            "verse 73:19": "Ин пандест. Пас ҳар кӣ бихоҳад, роҳе ба сӯи Парвардигораш оғоз кунад.",
            "verse 73:20": "Парвардигори ту медонад, ки ту ва гурӯҳе аз онон, ки бо ту ҳастанд, наздик ба ду сеяки шабу нимшаб ва сеяки шабро ба намоз меистед. Ва Худост, ки андозаи шабу рӯзро муъайян мекунад. Ва медонад, ки шумо ҳаргиз ҳисоби онро натавонед дошт. Пас тавбаи шуморо қабул кард. Ва ҳар чӣ муяссар шавад, аз Қуръон бихонед. Медонад чӣ касоне аз шумо бемор хоҳанд шуд ва гурӯҳе дигар ба талаби рӯзии Худо ба сафар мераванд ва гурӯҳи дигар дар роҳи Худо ба ҷанг мераванд. Пас ҳар чӣ муяссар шавад, аз он бихонед. Намоз бигузореду закот бидиҳед ва ба Худо қарзи некӯ диҳед. Ва ҳар хайреро, ки барои худ пешопеш бифиристед, онро назди Худо хоҳед ёфт. Ва он мукофоти беҳтар аст ва музде бузургтар аст. Ва аз Худо бахшоиш бихоҳед, зеро Худо бахшояндаву меҳрубон аст!"
        },
        "Tamil": {
            "verse 73:1": "போர்வை போர்த்திக் கொண்டிருப்பவரே!",
            "verse 73:2": "இரவில் - சிறிது நேரம் தவிர்த்து (தொழுகைக்காக எழுந்து) நிற்பீராக,",
            "verse 73:3": "அதில் பாதி (நேரம்) அல்லது அதில் சிறிது குறைத்துக் கொள்வீராக!",
            "verse 73:4": "அல்லது அதைவிடச் சற்று அதிகப்படுத்திக் கொள்வீராக, மேலும் குர்ஆனைத் தெளிவாகவும், நிறுத்தி, நிறுத்தியும் ஓதுவீராக.",
            "verse 73:5": "நிச்சயமாக, நாம் விரைவில் கனமான உறுதியான - ஒரு வாக்கை உம்மீது இறக்கி வைப்போம்.",
            "verse 73:6": "நிச்சயமாக, இரவில் எழு(ந்திருந்து வணங்கு)வது (அகத்தையும் புறத்தையும்) ஒருங்கிணைக்க வல்லது. மேலும் வாக்கையும் செவ்வைப்படுத்த வல்லது.",
            "verse 73:7": "நிச்சயமாகப் பகலில் உமக்கு நெடிய (கடினமான) வேலைகள் இருக்கின்றன.",
            "verse 73:8": "எனினும் (இரவிலும், பகலிலும்) உம்முடைய இறைவனின் பெயரை தியானிப்பீராக! இன்னும் அவனளவிலேயே முற்றிலும் திரும்பியவராக இருப்பீராக.",
            "verse 73:9": "(அவனே) கிழக்கிற்கும், மேற்கிற்கும் இறைவன்; அவனைத் தவிர வேறு நாயனில்லை ஆகவே அவனையே நீர் பாதுகாவலனாக ஆக்கிக் கொள்வீராக.",
            "verse 73:10": "அன்றியும், அவர்கள் (உமக்கெதிராகக்) கூறுவதைப் பொறுத்துக் கொள்வீராக, மேலும், அழகான கண்ணியமான - முறையில் அவர்களை விட்டும் வெறுத்து ஒதுங்கி விடுவீராக.",
            "verse 73:11": "என்னையும், பொய்ப்பிப்வர்களாகிய அந்தச் சுக வாசிகளையும் விட்டுவிடும்; அவர்களுக்குச் சிறிது அவகாசமும் கொடுப்பீராக.",
            "verse 73:12": "நிச்சமயாக நம்மிடத்தில் (அவர்களுக்காக) விலங்குகளும், நரகமும் இருக்கின்றன.",
            "verse 73:13": "(தொண்டையில்) விக்கிக் கொள்ளும் உணவும், நோவினை செய்யும் வேதனையும் இருக்கின்றன.",
            "verse 73:14": "அந்நாளில் பூமியும், மலைகளும் அதிர்ந்து, மலைகள் சிதறி மணல் குவியல்களாகிவிடும்.",
            "verse 73:15": "நிச்சயமாக ஃபிர்அவ்னிடம் தூதரை நாம் அனுப்பியது போல், உங்களிடமும், உங்கள் மீது சாட்சி சொல்பவராகிய தூதரை நாம் அனுப்பி வைத்தோம்.",
            "verse 73:16": "எனினும் ஃபிர்அவ்ன் அத்தூதருக்கு மாறு செய்தான் எனவே, அவனைக் கடினமான பிடியாக, நாம் பிடித்துக் கொண்டோம்.",
            "verse 73:17": "எனவே, நீங்கள் நிராகரித்தீர்களானால், குழந்தைகளையும் நரைத்தவர்களாக்கும் அந்த நாளிலிருந்து எவ்வாறு தப்பிக்க போகிறீர்கள்.",
            "verse 73:18": "அதில் வானம் பிளந்து விடும் அவனுடைய வாக்குறுதி செயல்படுத்தப்படும்.",
            "verse 73:19": "நிச்சயமாக இது நினைவூட்டும் நல்லுபபதேசமாகும் ஆகவே எவர் விரும்புகிறாரோ அவர் தம்முடைய இறைவனிடம் (செல்லும் இவ்)வழியை எடுத்துக் கொள்வாராக.",
            "verse 73:20": "நிச்சயமாக நீரும், உம்முடன் இருப்போரில் ஒரு கூட்டத்தாரும் இரவில் மூன்றில் இரு பாகங்களுக்குச் சமீபமாகவே, இன்னும் அதில் பாதியோ இன்னும் இதில் மூன்றில் ஒரு பாகத்திலோ (வணக்கத்திற்காக) நிற்கிறீர்கள் என்பதை உம்முடைய இறைவன் நிச்சயமாக அறிவான், அல்லாஹ்வே இரவையும் பகலையும் அளவாகக் கணக்கிடுகின்றான், அதை நீங்கள் சரியாகக் கணக்கிட்டுக் கொள்ள மாட்டீர்கள் என்பதையும் அவன் அறிகிறான். ஆகவே, அவன் உங்களுக்கு மன்னிப்பு அளித்து விட்டான். எனவே, நீங்கள் குர்ஆனில் உங்களுக்குச் சுலபமான அளவு ஓதுங்கள். (ஏனெனில்) நோயாளிகளும் அல்லாஹ்வின் அருளைத் தேடியவாறு பூமியில் செல்லும் வேறு சிலரும், அல்லாஹ்வின் பாதையில் போர் செய்யும் மற்றும் சிலரும், உங்களில் இருப்பார்கள் என்பதை அவன் அறிகிறான், ஆகவே, அதிலிருந்து உங்களுக்குச் சுலபமான அளவே ஓதுங்கள்; தொழுகையை முறையாக நிலை நிறுத்துங்கள்; இன்னும் ஜகாத்தும் கொடுத்து வாருங்கள்; அன்றியும் (தேவைப்படுவோருக்கு) அல்லாஹ்வுக்காக அழகான கடனாக கடன் கொடுங்கள், நன்மைகளில் எவற்றை நீங்கள் உங்கள் ஆத்மாக்களுக்காச் செய்து (மறுமைக்காக) முற்படுத்துகிறீர்களோ, அவற்றை நீங்கள் அல்லாஹ்விடம் மிகவும் மேலானதாகவும், நற்கூலியில் மகத்தானதாகவும் காண்பீர்கள்; அன்றியும் அல்லாஹ்விடமே மன்னிப்புக் கோருங்கள் - நிச்சயமா அல்லாஹ் மிக்க மன்னிப்பவன், மிக்க கிருபையுடையவன்."
        },
        "Tatar": {
            "verse 73:1": "Ий киеме илә бөркәнгән пәйгамбәр.",
            "verse 73:2": "Гыйбадәт өчен төнлә уяу тор, мәгәр төннең беразын йокла, ял ит.",
            "verse 73:3": "Яки төннең яртысыннан бераз азырагын да гыйбадәт өчен тор, яки ярты төнне гыйбадәт өчен уяу тор.",
            "verse 73:4": "Яки ярты төннән күбрәк тор, вә Коръәнне тәртибе белән тыңлап торган кеше сүзләрне дөрес аңларлык итеп ашыкмыйча укыгыз!",
            "verse 73:5": "Без, әлбәттә, авыр сүзне сиңа тиз йөкләрбез, ягъни нәфес сөймәгән шәригать хөкемнәрен.",
            "verse 73:6": "Төплә торып намаз, Коръән уку, әлбәттә, нәфескә катырак мәшәкатьтер вә укылышта сүзләре дөресерәк һәм күңелгә тәэсирлерәктер.",
            "verse 73:7": "Әлбәттә, көндез синең эшләрең күптер, эштән бушангач тынычланып кичләрен Аллаһуга гыйбадәт кыл!",
            "verse 73:8": "Раббыңның исемен зекер ит, Аңа гыйбадәт кыл һәм гыйбадәттә дөнья уйларыннан кисел, ныклап киселеп күңелеңне фәкать Аллаһуга багъла!",
            "verse 73:9": "Ул – Аллаһ мәшрикъның вә мәгърибнең Раббысы, һич мәгьбуд юк, мәгәр Аллаһ үзе генәдер, Аны барча эшләреңдә үзеңә хуҗа итеп ал!",
            "verse 73:10": "Вә аларның хакка каршы сөйләгән мәгънәсез сүзләренә чыда, вә аларны бер тарафка куй күркәм кую белән!",
            "verse 73:11": "Мине вә Минем белән бергә куй, Коръәнне ялган диюче байларны вә олугъларны, Мин аларны Үзем хөкем итәрмен, вә аларга бераз вакыт бир!",
            "verse 73:12": "Тәхкыйк Безнең кулыбызда җәһәннәм һәм авыр богаулар бардыр.",
            "verse 73:13": "Дәхи тамакка утыра торган яман ашамлыклар һәм рәнҗеткүче ґәзаб бардыр.",
            "verse 73:14": "Кыямәт көнендә җир вә таулар селкенер, вә таулар җыелып таралган кеби булырлар.",
            "verse 73:15": "Тәхкыйк Без сезгә расүл җибәрдек хакны кабул итүегезгә яки кабул итмәвегезгә гуаһ кылып, Фиргаунга расүл җибәргәнебез кеби.",
            "verse 73:16": "Фиргаун рәсүлгә карышты дошман булды, Без аны каты тотып һәлак иттек.",
            "verse 73:17": "Ий кешеләр, ахирәт ґәзабыннан ничек котылырсыз, кыямәт көненең катылыгы гөнаһсыз сабый балаларның чәчләрен агартыр?",
            "verse 73:18": "Ул көннең катылыгыннан кук ярылучы булыр, Аллаһуның вәгъдәсе утәлмеш булды.",
            "verse 73:19": "Тәхкыйк бу Коръән һәммә нәрсәдән хәбәр бирүче, җәннәт юлын күрсәтеп җәннәткә чакыручы һәм җәһәннәм юлын күрсәтеп аннан тыючыдыр, сездән теләгән кеше Коръән беләк вәгазьләнеп һәм гамәл кылып Раббысының туры юлына керер.",
            "verse 73:20": "Тәхкыйк синең Раббың беләдер, әлбәттә, син төннең өчтән ике өлешеннән аз гына кимрәк торып гыйбадәт кыласың, кайвакытта төннең яртысыны торасың, вә кайвакыт өчтән берен торасың, дәхи синең белән бергә торып бер таифә мөэминнәр гыйбадәт кылырлар. Аллаһ төнне һәм көнне белеп үлчидер, Аллаһ беләдер, әлбәттә, сез ул төннең барча сәгатьләрен дә ригая кылып бетерә алмассыз, сезгә җиңеләйтте ул төнне. Төнлә укыла торган намазларда кыйраәтне үзегезгә бик авыр килмәслек итеп җиңелрәк сүрәләрне укыгыз! Аллаһ белде, сезнең арагызда авыру кешеләр булыр, вә кайберләре Аллаһуның юмартлыгыннан өмет итеп мал, гыйлем кәсеб итәр өчен сәфәрдә булырлар, вә кайберләре Аллаһ юлында сугышта булырлар, андый вакытларда җиңел сүрәләрне укыгыз, вә намазларыгызны укыгыз, вә малларыгыздан зәкят бирегез һәм изге гамәлләрне Аллаһуга бурыч итеп бирегез ягъни сәваблы эшләрне фәкать Аллаһ ризалыгы өчен эшләгез, Аллаһ арттырып үзегезгә нигъмәт белән кайтарып бирер. Үзегез өчен ахирәткә алдан җибәргән яхшылыкларыгызны, изге гамәлләрегезне Аллаһ хозурында табарсыз, үзегез үлгәннән соң васыятегез буенча бирелгән садакагызга караганда исән вакытыгызда биргән садакагыз хәерлерәк вә сәвабы да олуграк. Аллаһуның ярлыкавын һәрвакыт сорагыз! Шиксез, Аллаһ гөнаһларны ярлыкаучы вә рәхимле."
        },
        "Telugu": {
            "verse 73:1": "ఓ దుప్పటి కప్పుకున్నవాడా",
            "verse 73:2": "రాత్రంతా (నమాజ్ లో) నిలబడు, కొంత భాగాన్ని విడిచి",
            "verse 73:3": "దాని సగభాగంలో, లేదా దాని కంటే కొంత తక్కువ",
            "verse 73:4": "లేదా దాని కంటే కొంత ఎక్కువ; మరియు ఖుర్ఆన్ ను ఆగి ఆగి నెమ్మదిగా స్పష్టంగా పఠించు",
            "verse 73:5": "నిశ్చయంగా, మేము నీపై భారమైన సందేశాన్ని అవతరింప జేయబోతున్నాము",
            "verse 73:6": "నిశ్చయంగా, రాత్రివేళ లేవటం (మనస్సును) అదుపులో ఉంచుకోవటానికి ఎంతో ఉపయుక్తమైనది మరియు (అల్లాహ్) ప్రవచనాలను (అర్థం చేసుకోవటానికి) కూడా ఎంతో అనుగణమైనది",
            "verse 73:7": "వాస్తవానికి, పగటివేళ నీకు చాలా పనులుంటాయి",
            "verse 73:8": "మరియు నీవు నీ ప్రభువు నామాన్ని స్మరిస్తూ ఉండు. మరియు అత్యంత శ్రద్థతో ఆయన వైపుకు మరలుతూ ఉండు",
            "verse 73:9": "ఆయనే తూర్పూ పడమరల స్వామి, ఆయన తప్ప మరొక ఆరాధ్య దైవం లేడు, కావున నీవు ఆయననే కార్యకర్తగా చేసుకో",
            "verse 73:10": "మరియు వారు పలికే మాటలకు సహనం వహించు మరియు మంచితనంతో వారి నుండి తొలగిపో",
            "verse 73:11": "మరియు అసత్యవాదులైన ఈ సంపన్నులను, నాకు వదలిపెట్టు. మరియు వారికి కొంత వ్యవధినివ్వు",
            "verse 73:12": "నిశ్చయంగా, మా వద్ద వారి కొరకు సంకెళ్ళు మరియు భగభగమండే నరకాగ్ని ఉన్నాయి",
            "verse 73:13": "మరియు గొంతులో ఇరుక్కుపోయే ఆహారం మరియు బాధాకరమైన శిక్ష (ఉన్నాయి)",
            "verse 73:14": "ఆ రోజు భూమి మరియు పర్వతాలు కంపించి పోతాయి. మరియు పర్వతాలు ప్రవహించే ఇసుక దిబ్బలుగా మారిపోతాయి",
            "verse 73:15": "మేము ఫిర్ఔన్ వద్దకు సందేశహరుణ్ణి పంపినట్లు, నిశ్చయంగా మీ వద్దకు కూడా ఒక సందేశహరుణ్ణి, మీకు సాక్షిగా ఉండటానికి పంపాము",
            "verse 73:16": "కాని ఫిర్ఔన్ ఆ సందేశహరునికి అవిధేయత చూపాడు. కావున మేము అతనిని తీవ్రమైన శిక్షకు గురి చేశాము",
            "verse 73:17": "ఒకవేళ మీరు సత్యాన్ని తిరస్కరిస్తే, బాలురను ముసలివారిగా చేసేటటు వంటి ఆ దినపు శిక్ష నుండి ఎలా తప్పించుకోగలరు",
            "verse 73:18": "అప్పుడు ఆకాశం బ్రద్దలై పోతుంది. ఆయన యొక్క వాగ్దానం తప్పక నెరవేరి తీరుతుంది",
            "verse 73:19": "నిశ్చయంగా, ఇదొక ఉపదేశం కావున ఇష్టమైన వాడు తన ప్రభువు వద్దకు పోయే మార్గాన్ని అవలంబించవచ్చు",
            "verse 73:20": "(ఓ ముహమ్మద్!) నీవు, వాస్తవానికి దాదాపు మూడింట రెండు వంతుల రాత్రి లేక సగం (రాత్రి) లేక మూడింట ఒక భాగం (నమాజ్ లో) నిలుస్తావనేది నీ ప్రభువుకు బాగా తెలుసు. మరియు నీతో పాటు ఉన్న వారిలో కొందరు కూడా! మరియు అల్లాహ్ రేయింబవళ్ళ పరిమాణాలను నిర్ణయిస్తాడు. మీరు ఖచ్ఛితంగా పూర్తి రాత్రి ప్రార్థించలేరని ఆయనకు తెలుసు. కావున ఆయన మీ వైపునకు (కనికరంతో) మరలాడు. కావున ఖుర్ఆన్ ను, మీరు సులభంగా పఠించగలిగినంతే పఠించండి. మీలో కొందరు వ్యాధిగ్రస్తులు కావచ్చు, మరికొందరు అల్లాహ్ అనుగ్రహాన్ని అన్వేషిస్తూ భూమిలో ప్రయాణంలో ఉండవచ్చు. మరికొందరు అల్లాహ్ మార్గంలో ధర్మయుద్ధం చేస్తూ ఉండవచ్చు అని ఆయనకు బాగా తెలుసు. కావున మీకు దానిలో సులభమైనంత దానినే పఠించండి. మరియు నమాజ్ను స్థాపించండి, విధిదానం (జకాత్) ఇవ్వండి. మరియు అల్లాహ్ కు మంచి అప్పును, అప్పుగా ఇస్తూ ఉండండి. మరియు మీరు, మీ కొరకు ముందుగా చేసి పంపుకున్న మంచి కార్యాలన్నింటినీ అల్లాహ్ దగ్గర పొందుతారు. అదే చాలా ఉత్తమమైనది. మరియు దాని ప్రతిఫలం చాలా గొప్పది. మరియు మీరు అల్లాహ్ ను క్షమాభిక్ష అర్థిస్తూ ఉండండి. నిశ్చయంగా, అల్లాహ్ క్షమాశీలుడు, అపార కరుణా ప్రదాత"
        },
        "Thai": {
            "verse 73:1": "โอ้ ผู้คลุมกายอยู่เอ๋ย !",
            "verse 73:2": "จงยืนขึ้น (ละหมาด) เวลากลางคืน เว้นแต่เพียงเล็กน้อย (ไม่ใช่ตลอดคืน)",
            "verse 73:3": "ครึ่งหนึ่งของเวลากลางคืน หรือน้อยกว่านั้นเพียงเล็กน้อย",
            "verse 73:4": "หรือมากกว่านั้น และจงอ่านอัลกุรอานช้า ๆ เป็นจังหวะ (ชัดถ้อยชัดคำ)",
            "verse 73:5": "แท้จริงเราจะประทานวจนะ (วะฮียฺ) อันหนักหน่วงแก่เจ้า",
            "verse 73:6": "แท้จริงการตื่นขึ้นในเวลากลางคืนนั้นเป็นเวลาที่ประทับใจยิ่งและเป็นการอ่านที่ชัดเจนยิ่ง",
            "verse 73:7": "แท้จริงสำหรับเจ้านั้นในเวลากลางวันมีภารกิจมากมาย",
            "verse 73:8": "และจงรำลึกถึงพระนามแห่งพระเจ้าของเจ้า และจงตั้งจิตมั่นต่อพระองค์อย่างเคร่งครัด",
            "verse 73:9": "พระเจ้าแห่งทิศตะวันออกและทิศตะวันตก ไม่มีพระเจ้าอื่นใดนอกจากพระองค์ ดังนั้นจงยึดพระองค์ให้เป็นผู้คุ้มครองเถิด",
            "verse 73:10": "และจงอดทนต่อสิ่งที่พวกเขากล่าวร้ายและจงแยกตัวออกจากพวกเขาด้วยการแยกตัวอย่างสุภาพ",
            "verse 73:11": "และจงปล่อยข้ากับบรรดาผู้ปฏิเสธผู้สำราญ และจงผ่อนผันให้แก่พวกเขาสักเล็กน้อย",
            "verse 73:12": "แท้จริง ณ ที่เรานั้นมีตรวนและกองไฟลุกโชน",
            "verse 73:13": "และอาหารที่ติดลำคอและการลงโทษอันเจ็บปวด",
            "verse 73:14": "วันที่แผ่นดินและภูเขาจะสั่นสะเทือนและภูเขาจะกลายเป็นกองทรายไหลพรู",
            "verse 73:15": "แท้จริงเราได้ส่งร่อซูลคนหนึ่งไปยังพวกเจ้า เพื่อเป็นพยานต่อพวกเจ้า ดังที่เราได้ส่งร่อซูลคนหนึ่งไปยังฟิรเอานฺ",
            "verse 73:16": "แต่ฟิรเอานฺได้ฝ่าฝืนร่อซูลคนนั้น ดังนั้นเราจึงได้ลงโทษเขาด้วยการลงโทษอย่างหนักหน่วง",
            "verse 73:17": "ถ้าพวกเจ้าปฏิเสธ ดังนั้นพวกเจ้าจะปกป้องตนเองต่อวันนั้นได้อย่างไรเล่า ซึ่งจะทำให้เด็กๆ กลายเป็นแก่ (มีผมสีขาวเพราะความตกใจกลัว)",
            "verse 73:18": "(วันนั้น) ชั้นฟ้าจะปริแยกออก และสัญญาของพระองค์จะต้องเกิดขึ้น (อย่างไม่ต้องสงสัย)",
            "verse 73:19": "แท้จริง นี่คือข้อเตือนสติ ดังนั้นผู้ใดประสงค์ก็พึงยึดถือเป็นแนวทางไปสู่พระเจ้าของเขาเถิด",
            "verse 73:20": "และอัลลอฮฺทรงกำหนดเวลากลางคืนและกลางวัน พระองค์ทรงรู้ดีว่าพวกเจ้าไม่สามารถที่จะกำหนดเวลาได้ ด้วยเหตุนี้พระองค์จึงทรงผ่อนผันให้แก่พวกเจ้า ดังนั้นพวกเจ้าจงอ่านอัลกุรอานตามแต่สะดวกเถิด พระองค์ทรงรู้ดีว่า อาจมีบางคนในหมู่พวกเจ้าเป็นคนป่วย และบางคนอื่น ๆ ต้องเดินทางไปดินแดนอื่น เพื่อแสวงหาจากความโปรดปรานของอัลลอฮฺ และบางคนอื่นต่อสู้ในทางของอัลลอฮฺ ดังนั้นพวกเจ้าจงอ่านตามสะดวกจากอัลกุรอานเถิด และจงดำรงไว้ซึ่งการละหมาดและจงบริจาคซะกาต และจงให้อัลลอฮฺยืมอย่างดีเยี่ยมเถิด และความดีอันใดที่พวกเจ้าได้กระทำไว้เพื่อตัวของพวกเจ้าเองพวกเจ้าก็จะพบมัน ณ ที่อัลลอฮฺ ซึ่งเป็นความดีและผลตอบแทนก็ยิ่งใหญ่กว่า ดังนั้นพวกเจ้าจงขออภัยโทษต่ออัลลอฮฺ แท้จริงอัลลอฮฺเป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ"
        },
        "Turkish": {
            "verse 73:1": "Ey örtünüp bürünen! Gecenin yarısında, istersen biraz sonra, istersen biraz önce bir müddet için kalk ve ağır ağır Kuran oku.",
            "verse 73:2": "Ey örtünüp bürünen! Gecenin yarısında, istersen biraz sonra, istersen biraz önce bir müddet için kalk ve ağır ağır Kuran oku.",
            "verse 73:3": "Ey örtünüp bürünen! Gecenin yarısında, istersen biraz sonra, istersen biraz önce bir müddet için kalk ve ağır ağır Kuran oku.",
            "verse 73:4": "Ey örtünüp bürünen! Gecenin yarısında, istersen biraz sonra, istersen biraz önce bir müddet için kalk ve ağır ağır Kuran oku.",
            "verse 73:5": "Doğrusu Biz, sana, taşıması ağır bir söz vahyedeceğiz.",
            "verse 73:6": "şüphesiz, gece kalkışı daha tesirli ve o zaman okumak daha elverişlidir.",
            "verse 73:7": "Çünkü gündüz, seni uzun uzun alıkoyacak işler vardır.",
            "verse 73:8": "Rabbinin adını an; herşeyi bırakıp yalnız O'na yönel,",
            "verse 73:9": "O, doğunun ve batının Rabbidir; O'ndan başka tanrı yoktur. Öyleyse O'nu vekil tut.",
            "verse 73:10": "Onların söylediklerine sabret, yanlarından güzellikle ayrıl.",
            "verse 73:11": "Varlık sahibi olup da seni yalanlayanları Bana bırak; onlara az bir mehil ver.",
            "verse 73:12": "Şüphesiz katımızda onlar için ağır boyunduruklar, cehennem, boğazı tıkayan bir yiyecek ve can yakan azap vardır.",
            "verse 73:13": "Şüphesiz katımızda onlar için ağır boyunduruklar, cehennem, boğazı tıkayan bir yiyecek ve can yakan azap vardır.",
            "verse 73:14": "Kıyametin koptuğu gün, yeryüzü ve dağlar sarsılır; dağlar, yumuşak kum yığını haline gelir.",
            "verse 73:15": "Firavun'a bir peygamber gönderdiğimiz gibi, size de, hakkınızda şahidlik edecek bir peygamber gönderdik.",
            "verse 73:16": "Ama Firavun o peygambere karşı gelmişti de onu çok ağır bir şekilde tutup cezalandırmıştık.",
            "verse 73:17": "Eğer inkar ederseniz, gençleri ihtiyarlatan günden nasıl korunursunuz?",
            "verse 73:18": "O günün şiddetiyle gök bile parçalanır. O'nun sözü yerine gelir.",
            "verse 73:19": "Doğrusu bu anlatılanlar birer öğüttür. Dileyen kimse, Rabbine doğru giden bir yol tutar.",
            "verse 73:20": "Şüphesiz Rabbin, senin ve beraberinde bulunanlardan bir topluluğun gecenin üçte ikisinden biraz az, yarısı ve üçte biri kadar vakit içinde kalktığını bilir. Gece ve gündüzü Allah ölçer; sizin bu vakitleri takdir edemeyeceğinizi bildiğinden tevbenizi kabul etmiştir. Artık, Kuran'dan kolayınıza geleni okuyun; Allah, içinizden, hasta olanları, Allah'ın lütfundan rızık aramak üzere yeryüzünde dolaşacak olan kimseleri ve Allah yolunda savaşacak olanları şüphesiz bilir. Kuran'dan kolayınıza geleni okuyun; namazı kılın; zekatı verin; Allah'a güzel ödünç takdiminde bulunun; kendiniz için yaptığınız iyiliği daha iyi ve daha büyük ecir olarak Allah katında bulursunuz. Allah'tan bağışlanma dileyin; Allah elbette bağışlar ve merhamet eder."
        },
        "Urdu": {
            "verse 73:1": "اے (محمدﷺ) جو کپڑے میں لپٹ رہے ہو",
            "verse 73:2": "رات کو قیام کیا کرو مگر تھوڑی سی رات",
            "verse 73:3": "(قیام) آدھی رات (کیا کرو)",
            "verse 73:4": "یا اس سے کچھ کم یا کچھ زیادہ اور قرآن کو ٹھہر ٹھہر کر پڑھا کرو",
            "verse 73:5": "ہم عنقریب تم پر ایک بھاری فرمان نازل کریں گے",
            "verse 73:6": "کچھ شک نہیں کہ رات کا اٹھنا (نفس بہیمی) کو سخت پامال کرتا ہے اور اس وقت ذکر بھی خوب درست ہوتا ہے",
            "verse 73:7": "دن کے وقت تو تمہیں اور بہت سے شغل ہوتے ہیں",
            "verse 73:8": "تو اپنے پروردگار کے نام کا ذکر کرو اور ہر طرف سے بےتعلق ہو کر اسی کی طرف متوجہ ہوجاؤ",
            "verse 73:9": "مشرق اور مغرب کا مالک (ہے اور) اس کے سوا کوئی معبود نہیں تو اسی کو اپنا کارساز بناؤ",
            "verse 73:10": "اور جو جو (دل آزار) باتیں یہ لوگ کہتے ہیں ان کو سہتے رہو اور اچھے طریق سے ان سے کنارہ کش رہو",
            "verse 73:11": "اور مجھے ان جھٹلانے والوں سے جو دولتمند ہیں سمجھ لینے دو اور ان کو تھوڑی سی مہلت دے دو",
            "verse 73:12": "کچھ شک نہیں کہ ہمارے پاس بیڑیاں ہیں اور بھڑکتی ہوئی آگ ہے",
            "verse 73:13": "اور گلوگیر کھانا ہے اور درد دینے والا عذاب (بھی) ہے",
            "verse 73:14": "جس دن زمین اور پہاڑ کانپنے لگیں اور پہاڑ ایسے بھر بھرے (گویا) ریت کے ٹیلے ہوجائیں",
            "verse 73:15": "(اے اہل مکہ) جس طرح ہم نے فرعون کے پاس (موسیٰ کو) پیغمبر (بنا کر) بھیجا تھا (اسی طرح) تمہارے پاس بھی (محمدﷺ) رسول بھیجے ہیں جو تمہارے مقابلے میں گواہ ہوں گے",
            "verse 73:16": "سو فرعون نے (ہمارے) پیغمبر کا کہا نہ مانا تو ہم نے اس کو بڑے وبال میں پکڑ لیا",
            "verse 73:17": "اگر تم بھی (ان پیغمبروں کو) نہ مانو گے تو اس دن سے کیونکر بچو گے جو بچّوں کو بوڑھا کر دے گا",
            "verse 73:18": "(اور) جس سے آسمان پھٹ جائے گا۔ یہ اس کا وعدہ (پورا) ہو کر رہے گا",
            "verse 73:19": "یہ (قرآن) تو نصیحت ہے۔ سو جو چاہے اپنے پروردگار تک (پہنچنے کا) رستہ اختیار کرلے",
            "verse 73:20": "تمہارا پروردگار خوب جانتا ہے کہ تم اور تمہارے ساتھ کے لوگ (کبھی) دو تہائی رات کے قریب اور (کبھی) آدھی رات اور (کبھی) تہائی رات قیام کیا کرتے ہو۔ اور خدا تو رات اور دن کا اندازہ رکھتا ہے۔ اس نے معلوم کیا کہ تم اس کو نباہ نہ سکو گے تو اس نے تم پر مہربانی کی۔ پس جتنا آسانی سے ہوسکے (اتنا) قرآن پڑھ لیا کرو۔ اس نے جانا کہ تم میں بعض بیمار بھی ہوتے ہیں اور بعض خدا کے فضل (یعنی معاش) کی تلاش میں ملک میں سفر کرتے ہیں اور بعض خدا کی راہ میں لڑتے ہیں۔ تو جتنا آسانی سے ہوسکے اتنا پڑھ لیا کرو۔ اور نماز پڑھتے رہو اور زکوٰة ادا کرتے رہو اور خدا کو نیک (اور خلوص نیت سے) قرض دیتے رہو۔ اور جو عمل نیک تم اپنے لئے آگے بھیجو گے اس کو خدا کے ہاں بہتر اور صلے میں بزرگ تر پاؤ گے۔ اور خدا سے بخشش مانگتے رہو۔ بےشک خدا بخشنے والا مہربان ہے"
        },
        "Uyghur": {
            "verse 73:1": "ئى كىيىمگە يۆگىنىۋالغۇچى (پەيغەمبەر!)",
            "verse 73:2": "كېچىنىڭ ئازغىنىسىدىن باشقىسىدا، يېرىمىدا ياكى يېرىمىدىنمۇ ئازراقىدا ياكى يېرىمىدىن كۆپرەكىدە ناماز ئوقۇغىن، قۇرئاننى تەرتىل بىلەن (يەنى دانە - دانە، ئوچۇق) ئوقۇغىن",
            "verse 73:3": "كېچىنىڭ ئازغىنىسىدىن باشقىسىدا، يېرىمىدا ياكى يېرىمىدىنمۇ ئازراقىدا ياكى يېرىمىدىن كۆپرەكىدە ناماز ئوقۇغىن، قۇرئاننى تەرتىل بىلەن (يەنى دانە - دانە، ئوچۇق) ئوقۇغىن",
            "verse 73:4": "كېچىنىڭ ئازغىنىسىدىن باشقىسىدا، يېرىمىدا ياكى يېرىمىدىنمۇ ئازراقىدا ياكى يېرىمىدىن كۆپرەكىدە ناماز ئوقۇغىن، قۇرئاننى تەرتىل بىلەن (يەنى دانە - دانە، ئوچۇق) ئوقۇغىن",
            "verse 73:5": "ساڭا ھەقىقەتەن تەنتەنىلىك قۇرئاننى نازىل قىلىمىز",
            "verse 73:6": "شۈبھىسىزكى، كېچىنىڭ قىيامى (يەنى كېچىدە كىشىنىڭ ئىبادەت قىلىشى ئۈچۈن ئۇيقۇدىن ئويغىنىپ تۇرۇشى) ئەڭ مۇۋاپىقتۇر، (تىنچ بولغانلىقى ئۈچۈن) كېچىنىڭ قىرائىتى ئەڭ توغرا بولىدۇ",
            "verse 73:7": "ھەقىقەتەن كۈندۈزى ئىش بىلەن ئالدىراش بولىسەن، (شۇڭا ئىبادەتكە) كېچىسى بېرىلگىن",
            "verse 73:8": "پەرۋەردىگارىڭنىڭ نامىنى ياد ئەتكىن، (ئىبادىتىڭدا) ئۇنىڭغا تولۇق يۈزلەنگىن",
            "verse 73:9": "ئۇ مەشرىقنىڭ ۋە مەغرىبنىڭ پەرۋەردىگارىدۇر، ئۇنىڭدىن باشقا ھېچ ئىلاھ يوقتۇر، ئۇنى ھامىي قىلىۋالغىن (يەنى ھەممە ئىشىڭنى ئۇنىڭغا تاپشۇرغىن)",
            "verse 73:10": "ئۇلارنىڭ (يەنى مەككە كۇففارلىرىنىڭ) (سېنى سېھىرگەر، شائىر، مەجنۇن دېگەن) سۆزلىرىگە سەۋر قىلغىن، ئۇلارنى چىرايلىقچە تەرك ئەتكىن",
            "verse 73:11": "(ئى مۇھەممەد! مېنىڭ ئايەتلىرىمنى) ئىنكار قىلغۇچى دۆلەتمەنلەرنى ماڭا قويۇۋەتكىن (يەنى ئۇلارنىڭ جازاسىنى ئۆزۈم بېرىمەن)، ئۇلارغا ئازغىنا مۆھلەت بەرگىن",
            "verse 73:12": "شۈبھىسىزكى، بىزنىڭ دەرگاھىمىزدا (ئۇلارغا) ئېغىر ئىشكەللەر ۋە (كۆيدۈرگۈچى) دوزاخ بار",
            "verse 73:13": "(زەققۇم، زەرىدىن ئىبارەت) گالدىن ئۆتمەيدىغان تاماق ۋە قاتتىق ئازاب بار",
            "verse 73:14": "ئۇ كۈندە زېمىن ۋە تاغلار قاتتىق تەۋرەيدۇ، تاغلار بىر دۆۋە تارقاق قۇمغا ئايلىنىدۇ",
            "verse 73:15": "شۈبھىسىزكى، بىز پىرئەۋنگە بىر پەيغەمبەرنى ئەۋەتكەندەك، سىلەرگە (ئەمەلىڭلارغا) گۇۋاھلىق بەرگۈچى بىر پەيغەمبەرنى ئەۋەتتۇق",
            "verse 73:16": "پىرئەۋن پەيغەمبەرگە (يەنى مۇسا ئەلەيھىسسالامغا) ئاسىيلىق قىلدى (يەنى پىرئەۋن مۇسا ئەلەيھىسسالامغا ئىمان ئېيتماي، ئۇنى يالغانغا چىقاردى، ئى قۇرەيش جامائەسى! سىلەر مۇھەممەد ئەلەيھىسسالامغا ئاسىيلىق قىلغاندەك، پىرئەۋنمۇ مۇسا ئەلەيھىسسالامغا ئاسىيلىق قىلغان ئىدى)، شۇنىڭ بىلەن ئۇنى قاتتىق جازالىدۇق",
            "verse 73:17": "(ئى قۇرەيش جامائەسى!) ئەگەر ئىمان ئېيتمىساڭلار، (دەھشىتىدىن) بالىلارنىڭ بېشىنى ئاقارتىۋېتىدىغان كۈندىن قانداق ساقلىنىسىلەر",
            "verse 73:18": "ئۇ كۈننىڭ (دەھشىتىدىن) ئاسمان يېرىلىدۇ، اﷲ نىڭ ۋەدىسى چوقۇم ئەمەلگە ئاشىدۇ (چۈنكى اﷲ ۋەدىسىگە خىلاپلىق قىلمايدۇ)",
            "verse 73:19": "بۇ ئايەتلەر ھەقىقەتەن ۋەز - نەسىھەتتۇر، (بۇ ۋەز - نەسىھەتتىن پايدىلىنىشنى) خالىغان ئادەم پەرۋەردىگارىغا يەتكۈزىدىغان يولنى تۇتسۇن",
            "verse 73:20": "(ئى مۇھەممەد!) شۈبھىسىزكى، پەرۋەردىگارىڭ سېنىڭ ۋە سەن بىلەن بولغانلارنىڭ (يەنى ساھابىلەر) دىن بىر توپ ئادەمنىڭ (تەھەججۇد نامىزى ئۈچۈن) كېچىنىڭ ئۈچتىن ئىككى ھەسسىسىدە، يېرىمىدا ۋە ئۈچتىن بىر ھەسسىسىدە تۇرىدىغانلىقىڭلارنى بىلىدۇ، كېچە بىلەن كۈندۈزنىڭ (ئۇزۇنلۇقى) نى اﷲ ئالدىنئالا بەلگىلەيدۇ، سىلەرنىڭ ئۇنى ھېسابلاپ بولالمايدىغانلىقىڭلارنى اﷲ بىلىدۇ، اﷲ سىلەرگە رەھىم قىلدى (يەنى كېچىدە تەھەججۇد نامىزى ئوقۇشنىڭ پەرزلىكىنى) ئەمەلدىن قالدۇردى، تەھەججۇد نامىزىدىن سىلەرگە قۇلاي بولغاننى ئوقۇڭلار، اﷲ بىلىدۇكى، بەزىڭلار كېسەل بولۇپ قالىسىلەر، بەزىلەر اﷲ نىڭ پەزلىنى تىلەپ (يەنى تىجارەت قىلىپ) يەر يۈزىدە سەپەر قىلىدۇ، يەنە بەزىلەر اﷲ نىڭ يولىدا جىھاد قىلىدۇ، شۇنىڭ ئۈچۈن ئۇنىڭدىن (يەنى تەھەججۇد نامىزىدىن) قۇلاي بولغاننى ئوقۇڭلار، (پەرز) نامازنى ئادا قىلىڭلار، زاكاتنى بېرىڭلار، اﷲ قا قەرزىي ھەسەنە بېرىڭلار (يەنى اﷲ نىڭ رازىلىقى ئۈچۈن ياخشىلىق يوللىرىغا پۇل - مال سەرپ قىلىڭلار)، ئۆزۈڭلار ئۈچۈن (دۇنيادا) قايسىبىر ياخشى ئىشنى قىلساڭلار، اﷲ نىڭ دەرگاھىدا تېخىمۇ ياخشى، تېخىمۇ كاتتا ساۋابقا ئېرىشىسىلەر (دۇنيا بولسا پانىيدۇر، ئاخىرەت بولسا باقىيدۇر ياخشى بەندىلەر ئۈچۈن اﷲ نىڭ دەرگاھىدىكى ساۋاب ھەممىدىن ئارتۇقتۇر)، اﷲ تىن مەغپىرەت تىلەڭلار، اﷲ ھەقىقەتەن ناھايىتى مەغپىرەت قىلغۇچىدۇر، ناھايىتى مېھرىباندۇر"
        },
        "Uzbek": {
            "verse 73:1": "Эй ўраниб ётувчи!",
            "verse 73:2": "Кечани озгинасидан бошқасини (ибодатда) тик туриб ўтказ!",
            "verse 73:3": "Ярмини ёки ундан бир оз қисқароғини.",
            "verse 73:4": "Ёки у(ярим)га яна қўш ва Қуръонни тартил билан тиловат қил.",
            "verse 73:5": "Албатта, Биз устингга оғир сўзни ташлармиз.",
            "verse 73:6": "Албатта, кечасиги ибодат кўпроқ мувофиқ келадир ва қироати тўғрироқ бўладир.",
            "verse 73:7": "Албатта, кундузи сенинг узоқ ишлашинг бор.",
            "verse 73:8": "Ва Роббингнинг исмини зикр эт ва Унинг ибодатига бутунлай ажралиб чиқ.",
            "verse 73:9": "У машриқу мағрибнинг Роббисидир. Ундан ўзга ибодатга сазовор илоҳ йўқ. Бас, Уни ўзингга вакил тут.",
            "verse 73:10": "Ва уларнинг гапларига сабр қил ва улардан чиройли четлашла, четлаб тур.",
            "verse 73:11": "Аҳли неъмат бўлган, ёлғонга чиқарувчиларни Ўзимга қўйиб қўй ва уларга озгина муҳлат бер.",
            "verse 73:12": "Албатта, Бизда оғир кишанлар ва жаҳаннам бор.",
            "verse 73:13": "Ва (томоққа) тиқиладиган таом ва аламли азоб бор.",
            "verse 73:14": "Бир кундаки, унда еру тоғлар ларзага келадир ва тоғлар оқувчи қумтепаларга айланадир.",
            "verse 73:15": "Албатта, Биз сизларга, худди Фиръавнга Расул юборганимиздек, сиз ҳақингизда гувоҳлик берувчи Расулни юбордик.",
            "verse 73:16": "Бас, Фиръавн Расулга осий бўлди ва Биз уни шиддатли азоб билан тутдик.",
            "verse 73:17": "Агар кофир бўлсангиз, болаларнинг сочини оқартиб юборадиган кундан қандай сақланасиз?!",
            "verse 73:18": "Унда осмон парчаланувчидир, У зотнинг ваъдаси амалга ошадир.",
            "verse 73:19": "Албатта, булар эслатмадир, Ким хоҳласа, ўз Робиси томон йўл оладир.",
            "verse 73:20": "Албатта, Роббинг сени кечанинг учдан биридан озроғини, ё ярмини, ё учдан бирини қоим бўлиб ўтказаётганингни ва сен билан бирга бўлганлардан ҳам бир тоифа (шундоқ қилаётганларини) биладир. Ва Аллоҳ кечаю кундузни Ўзи ўлчайдир. У сизлар ҳеч чидай олмаслигингизни билиб, сизларга (енгилликни) қайтарди. Бас (энди), Қуръондан муяссар бўлганича ўқинглар. Сизлардан келажакда касаллар бўлишини ҳам билди. Бошқалар ер юзида юриб, Аллоҳнинг фазлини ахтаришини, яна бошқалар эса, Аллоҳнинг йўлида жиҳод қилишларини (ҳам билди). Бас, ундан муяссар бўлганича қироат қилинглар. Ва намозни қоим қилинглар, закот беринглар ва Аллоҳга яхши қарз беринглар. Ўзингиз учун нима яхшилик қилган бўлсангиз, Аллоҳнинг ҳузурида ундан яхшироғини ва улканроқ ажрни топарсизлар. Аллоҳга истиғфор айтинглар. Албатта, Аллоҳ мағфират қилувчи ва раҳмдилдир."
        },
        "Vietnamese": {
            "verse 73:1": "Này hỡi người cuộn mình trong áo (Thiên Sứ Muhammad)!",
            "verse 73:2": "Ngươi hãy đứng (dâng lễ nguyện Salah) trong đêm trừ một ít thời gian.",
            "verse 73:3": "Một nửa của đêm hoặc ít hơn một chút.",
            "verse 73:4": "Hoặc thêm nữa; và Ngươi hãy đọc Qur’an với âm điệu nhịp nhàng, chậm rãi.",
            "verse 73:5": "Quả thật, TA sẽ truyền xuống cho Ngươi (Qur’an, và Nó là) lời nặng nề (vì trong đó chứa đựng các nghĩa vụ, các giới hạn, các qui định, các nghi thức và những điều khác).",
            "verse 73:6": "Thật vậy, những giờ trong đêm tác động mạnh mẽ nhất (đối với tâm trí và trái tim) và (làm cho) lời nói trở nên ngay thẳng và chính trực nhất.",
            "verse 73:7": "Ban ngày Ngươi thực sự bận rộn với nhiều công việc.",
            "verse 73:8": "Ngươi hãy tụng niệm đại danh Thượng Đế của Ngươi và hãy toàn tâm thờ phượng Ngài.",
            "verse 73:9": "(Allah là) Thượng Đế của phương Đông lẫn phương Tây; không có Thượng Đế đích thực nào khác ngoài Ngài. Vì vậy, Ngươi hãy tôn Ngài làm Đấng Bảo Hộ của Ngươi.",
            "verse 73:10": "Ngươi hãy kiên nhẫn chịu đựng với những gì chúng nói và hãy tránh xa chúng một cách nhã nhặn và tốt đẹp.",
            "verse 73:11": "Ngươi hãy để TA (một mình xử trí) những kẻ phủ nhận (Sự Thật) nhưng sở hữu những điều tốt đẹp của cuộc sống (này), và cứ để chúng (yên lành) trong một thời gian ngắn.",
            "verse 73:12": "Quả thật, (ở Đời Sau), TA có những chiếc gông nặng và lửa cháy.",
            "verse 73:13": "Và (TA có) loại thức ăn làm nghẹn họng và một hình phạt đau đớn.",
            "verse 73:14": "Vào Ngày (đó), trái đất và những quả núi sẽ rung chuyển và những quả núi sẽ giống như những đồi cát đổ xuống.",
            "verse 73:15": "Thật vậy, TA (Allah) đã gửi đến các ngươi một Sứ Giả làm nhân chứng cho các ngươi giống như TA đã gửi đến Pha-ra-ông một Sứ Giả.",
            "verse 73:16": "Nhưng Pha-ra-ông không vâng lời Sứ Giả (của TA), vì vậy, TA đã bắt phạt hắn bằng một sự trừng phạt khủng khiếp.",
            "verse 73:17": "Vậy làm sao các ngươi sẽ tránh được tai họa vào Ngày mà những đứa trẻ trở nên bạc đầu nếu các ngươi vô đức tin?",
            "verse 73:18": "Bầu trời (trong Ngày Hôm đó) sẽ vỡ nứt ra. Lời Hứa của (Allah) sẽ được thể hiện.",
            "verse 73:19": "Quả thật, đây là một sự nhắc nhở, vì vậy, ai muốn thì hãy chọn lấy một con đường trở về với Thượng Đế của mình.",
            "verse 73:20": "Thật vậy, Thượng Đế của Ngươi (hỡi Thiên Sứ Muhammad) biết rằng Ngươi và một nhóm đi theo Ngươi thực sự đứng dâng lễ nguyện Salah gần hai phần ba của đêm, hoặc phân nửa đêm, hoặc một phần ba của đêm. Và Allah ấn định (phạm vi của) ban đêm và ban ngày. Ngài biết các ngươi không thể nhớ chính xác (các giờ của ban đêm) nên Ngài đã tha thứ cho các ngươi. Vì vậy, các ngươi hãy đọc Qur’an phần nào mà các ngươi nhận thấy dễ dàng cho các ngươi. Ngài biết trong các ngươi có một số bệnh tật, một số khác đi tìm kiếm thiên lộc của Allah xa xôi trên trái đất; và một số khác đi chinh chiến cho Chính Nghĩa của Allah. Vì vậy, các ngươi hãy đọc phần nào mà các ngươi thấy dễ dàng đối với các ngươi. Và các ngươi hãy chu đáo dâng lễ nguyện Salah, đóng Zakah và cho Allah mượn một khoản nợ tốt. Và bất cứ điều gì tốt đẹp mà các ngươi gởi đi trước cho bản thân mình thì các ngươi sẽ tìm thấy (phần thưởng của) nó ở nơi Allah, và phần thưởng sẽ tốt và lớn hơn. Các ngươi hãy cầu xin Allah tha thứ. Quả thật, Allah là Đấng Tha Thứ, Đấng Nhân Từ."
        },
        "Yoruba": {
            "verse 73:1": "Iwo oludasobora",
            "verse 73:2": "Dide (kirun) ni oru ayafi fun igba die",
            "verse 73:3": "Lo ilaji re tabi din die ku ninu re",
            "verse 73:4": "Tabi fi kun un. Ki o si ke al-Ƙur’an ni pelepele",
            "verse 73:5": "Dajudaju Awa maa gbe oro t’o lagbara fun o",
            "verse 73:6": "Dajudaju idide kirun loru, o wonu okan julo, o si dara julo fun kike (al-Ƙur’an)",
            "verse 73:7": "Dajudaju ise pupo wa fun o ni osan",
            "verse 73:8": "Ranti oruko Oluwa re. Ki o si da okan ko O patapata",
            "verse 73:9": "Oluwa ibuyo oorun ati ibuwo oorun, ko si olohun ti ijosin to si afi Oun. Nitori naa, mu Un ni Alafeyinti",
            "verse 73:10": "Ki o si se suuru lori ohun ti won n wi. Pa won ti ni ipati t’o rewa",
            "verse 73:11": "Fi Mi da awon olupe-ododo-niro, awon oloro. Ki o si lora fun won fun igba die",
            "verse 73:12": "Dajudaju sekeseke ati Ina Jehim n be lodo Wa",
            "verse 73:13": "Ounje hafunhafun ati iya eleta-elero (tun wa fun won)",
            "verse 73:14": "Ni ojo ti ile ati awon apata yoo maa mi titi pelu ohun igbe lile. Awon apata si maa di yanrin ti won kojo ti won tuka",
            "verse 73:15": "Dajudaju Awa ran Ojise kan nise si yin (ti o je) olujerii lori yin gege bi A se ran Ojise kan nise si Fir‘aon",
            "verse 73:16": "Sugbon Fir‘aon yapa Ojise naa. A si gba a mu ni igbamu lile",
            "verse 73:17": "Ti eyin ba sai gbagbo, bawo ni eyin yoo se beru ojo kan t’o maa mu awon omode hewu",
            "verse 73:18": "Sanmo si maa faya perepere ninu re. Adehun Re je ohun ti o maa se",
            "verse 73:19": "Dajudaju eyi ni iranti. Nitori naa, eni ti o ba fe ki o mu oju ona kan to de odo Oluwa re",
            "verse 73:20": "Dajudaju Oluwa re mo pe dajudaju iwo n dide kirun fun ohun t’o kere si ilata meji oru tabi ilaji re tabi ilata re. Igun kan ninu awon t’o wa pelu re (naa n se bee). Allahu l’O n sodiwon oru ati osan. O si mo pe e ko le so o. Nitori naa, O ti da a pada si fifuye fun yin. Nitori naa, e ke ohun ti o ba rorun (fun yin) ninu al-Ƙur’an. O mo pe awon alaisan yoo wa ninu yin. Awon miiran si n ririn ajo lori-ile, ti won n wa ninu oore Allahu. Awon miiran si n jagun fun esin Allahu. Nitori naa, e ke ohun ti o ba rorun (fun yin) ninu re. E kirun (oran-an-yan). E yo Zakah. Ki e si ya Allahu ni dukia t’o dara. Ohunkohun ti e ba ti siwaju fun emi ara yin ninu ohun rere, eyin yoo ba a lodo Allahu ni ohun rere ati ni ohun ti o tobi julo ni esan. E toro aforijin lodo Allahu. Dajudaju Allahu ni Alaforijin, Asake-orun"
        }
    }
}