{
    "id": 74,
    "name_simple": "Al-Muddaththir",
    "revelation_place": "makkah",
    "revelation_order": 4,
    "bismillah_pre": true,
    "verses_count": 56,
    "short_text": "The Surah takes its name from the word al-muddaththir in the first verse. This also is only a name, not a title of its subject matter.",
    "text": [
        "The Surah takes its name from the word al-muddaththir in the first verse. This also is only a name, not a title of its subject matter.",
        "Period of Revelation",
        "The first seven verses of this Surah belong to the earliest period at Makkah. Even according to some traditions which have been related in Bukhari, Muslim, Tirmidhi, Musnad Ahmad, etc., on the authority of Hadrat Jabir bin Abdullah, these are the very earliest verses of the Qur'an to be revealed to the Holy Prophet (upon whoa be peace). But the Muslim Ummah almost unanimously agreed that the earliest Revelation to the Holy Prophet (upon whom be peace) consisted of the first five verses of Surah Al-Alaq(XCVI). However, what is established by authentic traditions is that after this first Revelation, no Revelation came down to the Holy Prophet (upon whom be peace) for quite some time. Then, when it was resumed, it started with theme verses of Surah Al- Muddaththir. Imam Zuhri has given the following details of it:",
        "\"Revelation to the Holy Prophet remained suspended for quite some time, and it was such a period of deep grief and distress for him that he started going early to the tops of the mountains to throw himself down from them. But whenever he stood on the edge of a peak, the Angel Gabriel would appear and tell him that he was Allah's Prophet. This would console him and restore to him full peace of mind.\" (Ibn Jarir).",
        "After this Imam Zuhri relates the following tradition on the authority of Hadrat Jabir bin Abdullah:",
        "\"The Holy Messenger of Allah describing the period of falrat al-wahi (break in revelation) said: One day when I was passing on the way, I suddenly heard a call from heaven. I raised my head and saw that the same Angel who had visited me in the Cave of Hira was sitting on a throne between heaven and earth. This struck terror in my heart, and reaching home quickly, I said: 'Cover me up, cover me up'. So the people of the house covered me up with a quilt (or blanket). At that time Allah sent down the Revelation: Ya ayyuhal-Muddaththiru... From then on revelation became intense and continuous.\" (Bukhari, Muslim Musnad Ahmad, Ibn Jarir).",
        "The rest of the Surah (vv. 8-56) was revealed when the first Hajj season came after public preaching of Islam had begun in Makkah. This has been fully well described in the Sirah by Ibn Hisham and we shall cite it below.",
        "Theme and Subject Matter",
        "As has been explained above, the earliest Revelation to the Holy Prophet (upon whom be peace) consisted of the first five verses of Surah Al-Alaq, in which it had been Said: \"Read (O Prophet), in the name of your Lord, Who created: created man from a clot of congealed blood. Read: and your Lord is Most Generous, Who taught knowledge by the pen, taught man what he did not know.\"",
        "This was the first experience of Revelation met with suddenly by the Holy Prophet (upon whom be peace). in this message it was not told what great mission he had been entrusted with and what duties he had to perk form in future. He was only initiated into it and then left alone for a time so that the great strain this experience had caused should pass away and he should mentally become prepared to receive the Revelation and perform the prophetic mission in the future. After this intermission when Revelation Was resumed, the first seven verses of this Surah Were revealed:In these he Was for the first time commanded to arise and warn the people of the consequences of the way of life they were following and to proclaim the greatness of God in the world where others were being magnified without any right. Along with that he was given this instruction: The demand of the Unique mission that you have to perform, now is that your life should be pure in every respect and you should carry out the duty of reforming your people sincerely irrespective of any worldly gain. Then, in the last sentence, he was exhorted to endure with patience, for the sake of his Lord, all the hardships and troubles that he might have to face while performing his mission.",
        "In the implementation of this Divine Command when the Holy Messenger of Allah began to preach Islam and recite the Qur'anic Surahs revealed successively, the people of Makkah felt alarmed, and it provoked a great storm of opposition and hostility. A few months passed in this state until the Hajj season approached. The people of Makkah feared that if Muhammad (upon whom be Allah's peace) started visiting the caravans of the pilgrims coming from all over Arabia at their halting places and reciting the spell binding and unique Revelations of the Qur'an in their assemblies on the occasion of Hajj, his message would reach every part of Arabia and influence countless people. Therefore, the Quraish chiefs held a conference and settled that they would start a propaganda campaign against the Holy Prophet (upon whom be peace) among the pilgrims as soon as they arrived.",
        "After they had agreed on this, Walid bin al-Mughirah said to the assembled people: \"If you said contradictory things about Muhammad (upon whom be Allah's peace and blessings), we all would lose our trust among the people. Therefore, let us agree upon one opinion, which we should all say without dispute.",
        "Some people said that they would call Muhammad (upon whom be Allah's peace and blessings) a soothsayer. Walid said: “No, by God, be is not a soothsayer. We have seen the soothsayers: what they murmur and what they utter has no remote resemblance with the Qur'an.”",
        "Some other people said: “Then we say he is possessed.” Walid said: He is not a possessed one: we have seen mad and insane people; the way one talks disjointedly and behaves foolishly in that state is known to all: who would believe that what Muhammad (upon whom be peace) presented was the incoherent speech of a madman?”",
        "The people said: “Then we say he is a poet.” Walid said: “No, he is not a poet, for we know poetry in all its forms, and what he presents conforms to no form of it.”",
        "The people said: “Then he is a sorcerer.” Walid said: “He is no sorcerer either: we have seen sorcerers and we also know what methods they adopt for their sorcery. This also does not apply to Muhammad.”",
        "Then he said: \"Whichever of these things you said about Muhammad, it would be known to be a false accusation. By God, his speech is sweet, his root is deep and his branches are fruitful.” At this Abu Jahl urging on Walid said: “Your people will never be pleased with you unless you say something about Muhammad.” He said: “Let me think over it awhile.”",
        "Then, after prolonged thought and consideration, he said: “The nearest thing to the truth is that you tell the Arabs that he is a sorcerer, who has brought a message by which he separates a man from his father; and from his brother, and from his wife and children, and from his family.” They all agreed on what Walid had proposed.",
        "Then, according to a scheme the men of Quraish spread among the pilgrims in the Hajj season and they warned everyone they met of the sorcery of Muhammad (upon whom be peace) and of his stirring up divisions in the families by it.\" But the result was that by their this plan the Quraish chiefs themselves made the name of the Holy Messenger known throughout Arabia. (Ibn Hisham, pp. 288-289. That Walid had made this proposal on the insistence of Abu Jahl has been related by Ibn Jarir in his Tafsir on the authority of Ikrimah).",
        "This same event has been reviewed and commented upon in the second section of this Surah. The sequence of its contents is as follows:",
        "In vv. 8-10 the deniers of Truth have been warned, saying: \"You will see the evil result of what you are doing today on the Resurrection Day.\"",
        "In vv. 11-26, without naming Walid bin al-Mughirah, it has been told how Allah had blessed him and how inimical he proved to be to true Faith. In this connection, his mental conflict has been portrayed, telling that, on the one hand, he was fully convinced of the truth of Muhammad (upon whom be Allah's peace and blessings) and the Qur'an, but, on the other, he did not want to risk his leadership and position among his people. Therefore, not only he did not believe himself but after a long-drawn-out conflict with his conscience he also came out with the proposal that in order to restrain the people from believing the Qur'an should be branded as magic. After exposing his evil nature, it has been said: \"Notwithstanding such evil inclinations and misdeeds, this person desires that he should be further blessed, whereas he has now become worthy of Hell, and never of further blessings.\"",
        "In vv. 27-48, the dreadfulness of Hell has been depicted and it has been explained as to people of what character and morals really deserve it.",
        "In vv. 49-53, the root cause of the disbelievers' aversion has been pointed out, saying: \"Since they are fearless of the Hereafter, and look upon this worldly life as an end in itself, they flee from the Qur'an as though they were wild asses fleeing away from the lion: therefore, they propose unreasonable conditions for believing, whereas even if each and every condition of theirs was fulfilled, they could not advance even an inch on the way of Faith with their denial of the Hereafter.\"",
        "In conclusion, it has been explicitly stated: Allah does not stand in need of anybody's faith that He may fulfill his conditions. The Qur'an is an admonition that has been presented before the people openly; now whoever wills may accept it. Allah has a right that the people should fear His disobedience and He alone has the power to forgive the one who adopts piety and an attitude of God consciousness even though one may have committed many acts of disobedience in the past."
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens by addressing the enwrapped Prophet as the Shrouded Messenger. It takes its name from the word “wrapped in mantle” (muddaththir) in verse 1. The first verses of this surah (verse 1 .) were revealed after one of the Prophets first encounter with the Angel of Revelation in the Cave of Ḥirāʾ. The surah goes on, in a section from a later period, to remind the obstinate disbelievers of their fate on the Day of Judgement (verse 8 .) and a specific opponent of the Prophet is singled out (verse 11 .). The end of the surah (verse 39 .) exposes the foolishness of the disbelievers” attitude to the Revelation and the Day of Resurrection.The surah is also known as: The Cloaked One, The Enfolded, The Enfolded One, The Enveloped, The Man Wearing a Cloak, The Mantled Messenger, Wrapped in his Cloak.",
    "name_translation": "Shrouded",
    "name_complex": "Al-Muddaththir",
    "surah_name_ar": "المدثر",
    "verses": {
        "Albanian": {
            "verse 74:1": "O ti, i mbuluar (Muhammed)!",
            "verse 74:2": "Çou dhe lajmëroi!",
            "verse 74:3": "Dhe Zotin tënd madhëroje!",
            "verse 74:4": "Dhe petkat tuaja pastroji!",
            "verse 74:5": "Dhe largoju (veprave) të këqia!",
            "verse 74:6": "Dhe mos ndajë me qëllim që të marrësh më shumë!",
            "verse 74:7": "Dhe për hir të Zotit tënd, duro",
            "verse 74:8": "e, kur të fryhet në buri –",
            "verse 74:9": "do të jetë ato ditë e rëndë,",
            "verse 74:10": "për jobesimtarët nuk do të jetë e lehtë.",
            "verse 74:11": "Lemëni Mua dhe atë që e kam krijuar Unë, vet,",
            "verse 74:12": "dhe i kam dhënë pasuri kolosale,",
            "verse 74:13": "dhe djemtë që i ka të pranishëm,",
            "verse 74:14": "dhe nderë e prestigj i kam dhuruar",
            "verse 74:15": "dhe përpos kësaj - dëshiron, që Unë t’ia zmadhojë (të mirat)!",
            "verse 74:16": "Jo, kurrsesi! Me të vërtetë, ai është mohues kryeneç i ajeteve Tona;",
            "verse 74:17": "e Unë do ta ngarkojë atë me dënime të rënda,",
            "verse 74:18": "sepse, ka paramenduar dhe ka kurdisur (kundër Kur’anit), -",
            "verse 74:19": "dhe, qoftë mallkuar, si e ka kurdisur!",
            "verse 74:20": "dhe sërish – edhe njëherë, qoftë mallkuar, si e ka kurdisur! –",
            "verse 74:21": "Pastaj ka shikuar",
            "verse 74:22": "e, u vrejt dhe iu mrrol (fytyra)",
            "verse 74:23": "dhe u kthye (nga mendimi i drejtë) dhe u kapardis,",
            "verse 74:24": "dhe tha: “Ky (Kur’ani) nuk është gjë tjetër, përpos magji trashëguese,",
            "verse 74:25": "këto janë vetëm fjalë njeriu!”",
            "verse 74:26": "Do ta hudhi (dënojë) në Sekar (Skëterrë) –",
            "verse 74:27": "e kush të shpjegon ty se çka është Sekari?",
            "verse 74:28": "Ai nuk lë gjë dhe i përfshinë të gjithë (i djegë)",
            "verse 74:29": "lëkurat iu bënë të zeza (nga të djegurit)",
            "verse 74:30": "mbikëqyrës të tij (Skëterrës) janë nëntëmbëdhjetë (engjëj). –",
            "verse 74:31": "Na, kemi bërë rojtarë të zjarrit (engjëj) dhe kemi caktuar numrin e tyre, vetëm për t’i provuar jobesimtarët; për ‘tu bindur njerëzit, të cilëve, u është dhënë Libri, që t’u shtohet (forcohet) besimi atyre që besojnë, e mos të dyshojnë, ata, të cilëve u është dhënë Libri, - dhe për të thënë ata që janë zemërkëqinj (hipokrit) dhe jobesimtarë: “Ç’ka dashur Zoti (të tregojë) me këtë shembull?” Kështu, Perëndia i lë në hutim (dhe në humbje) ata që do, dhe në rrugë të drejtë e udhëzon atë që don. Askush tjetër, përveç Tij, nuk e di numrin e ushtrisë së Zotit tënd. Kjo është vetëm këshillë për njerëzit.",
            "verse 74:32": "Kurrsesi! Betohem në Hënën",
            "verse 74:33": "dhe në natën që largohet,",
            "verse 74:34": "e mëngjesin që zbardhëllon, -",
            "verse 74:35": "ajo (skëterra), me të vërtetë, është njëra nga fatkeqësitë më të mëdha,",
            "verse 74:36": "kjo është si këshillim –",
            "verse 74:37": "për ata nga ju që dëshirojnë të bëjnë mirë ose të abstenojnë (në këtë)!",
            "verse 74:38": "Çdo njeri është peng (përgjegjës) për veprat e veta,",
            "verse 74:39": "përveç fatlumëve;",
            "verse 74:40": "të cilët në kopshtijet e xhenneti i pyesin fajtorët:",
            "verse 74:41": "-",
            "verse 74:42": "“Çka u ka sjellë juve në Sekar (Skëterrë)?”",
            "verse 74:43": "Ata do të përgjigjen: “Nuk kemi qenë nga ata që kanë bërë namaz",
            "verse 74:44": "dhe prej atyre që i kanë ushqyer të varfërit",
            "verse 74:45": "dhe jemi lëshuar në biseda të kota me djerraditësit (badihavxhinjtë),",
            "verse 74:46": "dhe kemi përgënjeshtruar Ditën e Kijametit,",
            "verse 74:47": "përderisa nuk na erdhi vdekja”.",
            "verse 74:48": "Kurrfarë ndërmjetësimi i ndërmjetësuesve nuk do t’u ndihmojë atyre.",
            "verse 74:49": "E, përse shmangën ata nga këshillimi,",
            "verse 74:50": "thua se janë gomarë të egër,",
            "verse 74:51": "të frikësuar, që kanë ikur prej luanit.",
            "verse 74:52": "Po! Çdonjëri nga ata do të kërkojë që t’i jepet rregjistri i qartë (nga Zoti).",
            "verse 74:53": "Kurrsesi, pasi që ata nuk i frikohen Ditës së Kijametit!",
            "verse 74:54": "Ai (Kur’ani), në të vërtetë, është këshillë,",
            "verse 74:55": "dhe kush të dojë, le ta pranojë,",
            "verse 74:56": "e këshillohen vetëm ata që do Perëndia; Ai është i vetmi të cilit duhet t’i druajmë dhe Ai është i vetmi falës."
        },
        "Amharic": {
            "verse 74:1": "አንተ (ልብስህን) ደራቢው ሆይ!",
            "verse 74:2": "ተነሳ አስጠንቅቅም፡፡",
            "verse 74:3": "ጌታህንም አክብር፡፡",
            "verse 74:4": "ልብስህንም አጥራ፡፡",
            "verse 74:5": "ጣዖትንም ራቅ፡፡",
            "verse 74:6": "ማብዛትንም የምትፈልግ ኾነህ፤ (በረከትን) አትለግስለለ",
            "verse 74:7": "ለጌታህም (ትዕዛዝ) ታገሥ፡፡",
            "verse 74:8": "በቀንዱም በተነፋ ጊዜ (ነገሩ ይበረታል)፡፡",
            "verse 74:9": "ይህም (ጊዜ) ያ ቀን አስቸጋሪ ቀን ነው፡፡",
            "verse 74:10": "በከሓዲዎች ላይ ገር ያልኾነ ነው፡፡",
            "verse 74:11": "አንድ ኾኖ ከፈጠርኩት ሰው ጋር ተዎኝ (እኔ እበቃሃለሁ)፡፡",
            "verse 74:12": "ለእርሱም የተዘረጋን ገንዘብ (በያይነቱ) ያደረግሁለት፡፡",
            "verse 74:13": "(በያደባባዩ) ተገኝዎች የኾኑ ወንዶች ልጆችንም፡፡",
            "verse 74:14": "ለእርሱም (ኑሮውን) መዘርጋትን የዘረጋሁለት (ከኾነ ሰው ገር ተዎኝ)፡፡",
            "verse 74:15": "ከዚያም ልጨምርለት ይከጅላል፡፡",
            "verse 74:16": "ይከልከል፤ እርሱ ለአንቀጾቻችን በእርግጥ ተቃዋሚ ነበር፡፡",
            "verse 74:17": "በእርግጥ ችግርን አስገድደዋለሁ፡፡",
            "verse 74:18": "እርሱ (በቁርኣን ነገር) ሐሰበ፤ ገመተም፡፡",
            "verse 74:19": "ተረገመም፤ እንዴት ገመተ!",
            "verse 74:20": "ከዚያም (ከሞት በኋላ) ተረገመ፡፡ እንዴት ገመተ!",
            "verse 74:21": "ከዚያም እንደ ገና (በቁርኣኑ ነገር) ተመለከተ፡፡",
            "verse 74:22": "ከዚያም ፊቱን አጨፈገገ፤ አኮማተረም፡፡",
            "verse 74:23": "ከዚያም (ከማመን) ዞረ፤ ኮራም፡፡",
            "verse 74:24": "አለም «ይህ (ከሌላ) የሚቀዳ ድግምት እንጅ ሌላ አይደለም፡፡",
            "verse 74:25": "«ይህ የሰው ቃል እንጅ ሌላ አይደለም፡፡»",
            "verse 74:26": "በሰቀር ውስጥ በእርግጥ አገባዋለሁ፡፡",
            "verse 74:27": "ሰቀር ምን እንደኾነች ምን አሳወቀህ?",
            "verse 74:28": "(ያገኘችውን ሁሉ) አታስቀርም አትተውምም፡፡",
            "verse 74:29": "ቆዳን በጣም አክሳይ ናት፡፡",
            "verse 74:30": "በእርሷም ላይ አሥራ ዘጠኝ (ዘበኞች) አሉባት፡፡",
            "verse 74:31": "የእሳትንም ዘበኞች መላእክት እንጅ ሌላ አላደረግንም፡፡ ቁጥራቸውንም ለእነዚያ ለካዱት መፈተኛ እንጅ አላደረግንም፡፡ እነዚያ መጽሐፍን የተሰጡት እንዲያረጋግጡ፣ እነዚያም ያመኑት እምነትን እንዲጨምሩ፣ እነዚያም መጽሐፍን የተሰጡትና ምእምናኖቹ እንዳይጠራጠሩ፣ እነዚያም በልቦቻቸው ውስጥ በሽታ ያለባቸው (መናፍቃን)፣ ከሓዲዎችም አላህ በዚህ (ቁጥር) ምን ምሳሌ ሽቷል? እንዲሉ (እንጅ አላደረግንም)፡፡ እንደዚሁ አላህ የሚሻውን ያጠምማል፡፡ የሚሻውንም ያቀናል፡፡ የጌታህንም ሰራዊት (ልክ) ከርሱ በቀር ማንም አያውቅም፡፡ እርሷም (የሰቀር እሳት) ለሰዎች መገሰጫ እንጅ ሌላ አይደለችም፡፡",
            "verse 74:32": "(ከክህደት) ይከልከሉ፡፡ በጨረቃ እምላለሁ፡፡",
            "verse 74:33": "በሌሊቱም በኼደ ጊዜ፡፡",
            "verse 74:34": "በንጋቱም ባበራ ጊዜ፡፡",
            "verse 74:35": "እርሷ (ሰቀር) ከታላላቆቹ (አደጋዎች) አንዷ ናት፡፡",
            "verse 74:36": "ለሰዎች አስፈራሪ ስትኾን፡፡",
            "verse 74:37": "ከእናንተ (ወደ በጎ ነገር) መቅደምን ወይም ወደ ኋላ መቅረትን ለሻ ሰው (አስፈራሪ ስትኾኑ)፡፡",
            "verse 74:38": "ነፍስ ሁሉ በሠራችው ሥራ ተያዥ ናት፡፡",
            "verse 74:39": "የቀኝ ባለቤቶች ብቻ ሲቀሩ፡፡",
            "verse 74:40": "(እነርሱስ) በገነቶች ውስጥ ይጠያየቃሉ፡፡",
            "verse 74:41": "ከአመጸኞቹ ኹነታ፡፡",
            "verse 74:42": "(ይሏቸዋልም) «በሰቀር ውስጥ ምን አገባችሁ?»",
            "verse 74:43": "(እነርሱም) ይላሉ «ከሰጋጆቹ አልነበርንም፡፡",
            "verse 74:44": "«ለድኾችም የምናበላ አልነበርንም፡፡",
            "verse 74:45": "«ከዘባራቂዎቹም ጋር እንዘባርቅ ነበርን፡፡",
            "verse 74:46": "«በፍርዱ ቀንም እናስተባብል ነበርን፡፡",
            "verse 74:47": "«እርግጠኛው (ሞት) እስከ መጣን ድረስ፡፡»",
            "verse 74:48": "የአማላጆችም ምልጃ አትጠቅማቸውም፡፡",
            "verse 74:49": "ከግሣጼዬም (ከቁርኣን) የሚያፈገፍጉት ለእነርሱ ምን አልላቸው?",
            "verse 74:50": "እነርሱ ልክ ደንባሪዎች የሜዳ አህዮች ይመስላሉ፡፡",
            "verse 74:51": "ከዐንበሳ የሸሹ፡፡",
            "verse 74:52": "ይልቁንም ከእነርሱ እያንዳንዱ ሰው ሁሉ የተዘረጉ ጽሑፎችን እንዲስሰጥ ይፈልጋል፡፡",
            "verse 74:53": "ይከልከሉ፡፡ ይልቁንም የመጨረሻይቱን ዓለም (ቅጣት) አይፈሩም፡፡",
            "verse 74:54": "ይከልከሉ፡፡ እርሱ (ቁርኣን) መገሠጫ ነው፡፡",
            "verse 74:55": "ስለዚህ የሻ ሰው ይገሰጽበታል፡፡",
            "verse 74:56": "አላህም ካልሻ በስተቀር አይገሠጹም፡፡ እርሱ (አላህ) የመፈራት ባለቤት የምሕረትም ባለቤት ነው፡፡"
        },
        "Arabic": {
            "verse 74:1": "ُرِّثَّدُمْلا اَهُّيَأ اَي",
            "verse 74:2": "ْرِذنَأَف ْمُق",
            "verse 74:3": "ْرِّبَكَف َكَّبَرَو",
            "verse 74:4": "ْرِّهَطَف َكَباَيِثَو",
            "verse 74:5": "ْرُجْهاَف َزْجُّرلاَو",
            "verse 74:6": "ُرِثْكَتْسَت نُنْمَت اَلَو",
            "verse 74:7": "ْرِبْصاَف َكِّبَرِلَو",
            "verse 74:8": "ِروُقاَّنلا يِف َرِقُن اَذِإَف",
            "verse 74:9": "ٌريِسَع ٌمْوَي ٍذِئَمْوَي َكِلَٰذَف",
            "verse 74:10": "(ٍريِسَي ُرْيَغ َنيِرِفاَكْلا ىَلَع",
            "verse 74:11": "(اًديِحَو ُتْقَلَخ ْنَمَو يِنْرَذ",
            "verse 74:12": "(اًدوُدْمَّم اًلاَم ُهَل ُتْلَعَجَو",
            "verse 74:13": "(اًدوُهُش َنيِنَبَو",
            "verse 74:14": "(اًديِهْمَت ُهَل ُّتدَّهَمَو",
            "verse 74:15": "(َديِزَأ ْنَأ ُعَمْطَي َّمُث",
            "verse 74:16": "(اًديِنَع اَنِتاَيآِل َناَك ُهَّنِإ ۖ اَّلَك",
            "verse 74:17": "(اًدوُعَص ُهُقِهْرُأَس",
            "verse 74:18": "(َرَّدَقَو َرَّكَف ُهَّنِإ",
            "verse 74:19": "(َرَّدَق َفْيَك َلِتُقَف",
            "verse 74:20": "(َرَّدَق َفْيَك َلِتُق َّمُث",
            "verse 74:21": "(َرَظَن َّمُث",
            "verse 74:22": "(َرَسَبَو َسَبَع َّمُث",
            "verse 74:23": "(َرَبْكَتْساَو َرَبْدَأ َّمُث",
            "verse 74:24": "(ُرَثْؤُي ٌرْحِس اَّلِإ اَذَٰه ْنِإ َلاَقَف",
            "verse 74:25": "(ِرَشَبْلا ُلْوَق اَّلِإ اَذَٰه ْنِإ",
            "verse 74:26": "(َرَقَس ِهيِلْصُأَس",
            "verse 74:27": "(ُرَقَس اَم َكاَرْدَأ اَمَو",
            "verse 74:28": "(ُرَذَت اَلَو يِقْبُت اَل",
            "verse 74:29": "(ِرَشَبْلِّل ٌةَحاَّوَل",
            "verse 74:30": "(َرَشَع َةَعْسِت اَهْيَلَع",
            "verse 74:31": "(ِرَشَبْلِل ٰىَرْكِذ اَّلِإ َيِه اَمَو ۚ َوُه اَّلِإ َكِّبَر َدوُنُج ُمَلْعَي اَمَو ۚ ُءاَشَي نَم يِدْهَيَو ُءاَشَي نَم ُهَّللا ُّلِضُي َكِلَٰذَك ۚ اًلَثَم اَذَٰهِب ُهَّللا َداَرَأ اَذاَم َنوُرِفاَكْلاَو ٌضَرَّم مِهِبوُلُق يِف َنيِذَّلا َلوُقَيِلَو ۙ َنوُنِمْؤُمْلاَو َباَتِكْلا اوُتوُأ َنيِذَّلا َباَتْرَي اَلَو ۙ اًناَميِإ اوُنَمآ َنيِذَّلا َداَدْزَيَو َباَتِكْلا اوُتوُأ َنيِذَّلا َنِقْيَتْسَيِل اوُرَفَك َنيِذَّلِّل ًةَنْتِف اَّلِإ ْمُهَتَّدِع اَنْلَعَج اَمَو ۙ ًةَكِئاَلَم اَّلِإ ِراَّنلا َباَحْصَأ اَنْلَعَج اَمَو",
            "verse 74:32": "(ِرَمَقْلاَو اَّلَك",
            "verse 74:33": "(َرَبْدَأ ْذِإ ِلْيَّللاَو",
            "verse 74:34": "(َرَفْسَأ اَذِإ ِحْبُّصلاَو",
            "verse 74:35": "(ِرَبُكْلا ىَدْحِإَل اَهَّنِإ",
            "verse 74:36": "(ِرَشَبْلِّل اًريِذَن",
            "verse 74:37": "(َرَّخَأَتَي ْوَأ َمَّدَقَتَي نَأ ْمُكنِم َءاَش نَمِل",
            "verse 74:38": "(ٌةَنيِهَر ْتَبَسَك اَمِب ٍسْفَن ُّلُك",
            "verse 74:39": "(ِنيِمَيْلا َباَحْصَأ اَّلِإ",
            "verse 74:40": "(َنوُلَءاَسَتَي ٍتاَّنَج يِف",
            "verse 74:41": "(َنيِمِرْجُمْلا ِنَع",
            "verse 74:42": "(َرَقَس يِف ْمُكَكَلَس اَم",
            "verse 74:43": "(َنيِّلَصُمْلا َنِم ُكَن ْمَل اوُلاَق",
            "verse 74:44": "(َنيِكْسِمْلا ُمِعْطُن ُكَن ْمَلَو",
            "verse 74:45": "(َنيِضِئاَخْلا َعَم ُضوُخَن اَّنُكَو",
            "verse 74:46": "(ِنيِّدلا ِمْوَيِب ُبِّذَكُن اَّنُكَو",
            "verse 74:47": "(ُنيِقَيْلا اَناَتَأ ٰىَّتَح",
            "verse 74:48": "(َنيِعِفاَّشلا ُةَعاَفَش ْمُهُعَفنَت اَمَف",
            "verse 74:49": "(َنيِضِرْعُم ِةَرِكْذَّتلا ِنَع ْمُهَل اَمَف",
            "verse 74:50": "(ٌةَرِفنَتْسُّم ٌرُمُح ْمُهَّنَأَك",
            "verse 74:51": "(ٍةَرَوْسَق نِم ْتَّرَف",
            "verse 74:52": "(ًةَرَّشَنُّم اًفُحُص ٰىَتْؤُي نَأ ْمُهْنِّم ٍئِرْما ُّلُك ُديِرُي ْلَب",
            "verse 74:53": "(َةَرِخآْلا َنوُفاَخَي اَّل لَب ۖ اَّلَك",
            "verse 74:54": "(ٌةَرِكْذَت ُهَّنِإ اَّلَك",
            "verse 74:55": "(ُهَرَكَذ َءاَش نَمَف",
            "verse 74:56": "(ِةَرِفْغَمْلا ُلْهَأَو ٰىَوْقَّتلا ُلْهَأ َوُه ۚ ُهَّللا َءاَشَي نَأ اَّلِإ َنوُرُكْذَي اَمَو"
        },
        "Azerbaijani": {
            "verse 74:1": "Ey libasına bürünüb örtünmüş peyğəmbər!",
            "verse 74:2": "Qalx və insanları xəbərdar et!",
            "verse 74:3": "Təkcə Rəbbini uca tut!",
            "verse 74:4": "Geyimini təmiz saxla!",
            "verse 74:5": "Pis şeyləri tərk et!",
            "verse 74:6": "Yaxşılığı təmənna məqsədilə etmə!",
            "verse 74:7": "Rəbbin üçün səbir et!",
            "verse 74:8": "Sur üfürülərkən –",
            "verse 74:9": "Çətin bir gün olacaq.",
            "verse 74:10": "Həmin gün kafirlərə asan olmayacaqdır.",
            "verse 74:11": "Məni yaratdığım kimsə ilə tək burax;",
            "verse 74:12": "Mən ona bolluca var-dövlət bağışladım,",
            "verse 74:13": "qayğısına qalan oğullar verdim",
            "verse 74:14": "və onu hər cür imkanlarla təmin etdim.",
            "verse 74:15": "Bunlara baxmayaraq, o, yenə də əlavə etməyimi arzulayır.",
            "verse 74:16": "Xeyr! Çünki o, ayələrimizi inadla inkar edir.",
            "verse 74:17": "Mən onu sərt bir yoxuşa sürükləyəcəyəm.",
            "verse 74:18": "Çünki o, fikirləşərək qərara gəldi.",
            "verse 74:19": "Ona ölüm olsun! Necə qərara gəldi?",
            "verse 74:20": "Sonra yenə ona ölüm olsun! Gör nə qərara gəldi?",
            "verse 74:21": "Sonra o nəzər saldı.",
            "verse 74:22": "Üz-gözünü turşudub qaşqabağını tökdü.",
            "verse 74:23": "Sonra da arxasını çevirib təkəbbür göstərdi",
            "verse 74:24": "və dedi: “Bu, sehrbazlardan eşidilib təkrarlanan sehrdən başqa bir şey deyildir!",
            "verse 74:25": "Bu, adi insan kəlamıdır!",
            "verse 74:26": "Mən onu Səqərə salacağam.",
            "verse 74:27": "Sən haradan biləsən ki, Səqər nədir?!",
            "verse 74:28": "O, kimsəni sağ-salamat buraxmaz,",
            "verse 74:29": "dərini yandırıb-yaxar.",
            "verse 74:30": "Onun üzərində on doqquz gözətçi mələk vardır.",
            "verse 74:31": "Biz Cəhənnəm gözətçilərini yalnız mələklərdən etdik və onların sayını on doqquz etdik ki, bu, kafirlər üçün ancaq bir sınaq olsun, özlərinə Kitab verilənlər yəqinlik hasil etsinlər, iman gətirənlərin imanı artsın, Kitab verilənlər və möminlər haqqa şübhə etməsinlər və qəlblərində xəstəlik olanlar və kafirlər: “Allah bu məsəllə nə demək istəyir?”– desinlər. Allah istədiyi kimsəni belə azdırır, istədiyini də doğru yola yönəldir. Sənin Rəbbinin qoşunları barədə yalnız Özü bilir. Bu, bəşəriyyət üçün ancaq bir xatırlatmadır.",
            "verse 74:32": "Xeyr! And olsun aya!",
            "verse 74:33": "And olsun dönüb uzaqlaşan gecəyə!",
            "verse 74:34": "And olsun ağarmaqda olan sübh çağına!",
            "verse 74:35": "Doğrudan da o Cəhənnəm ən böyük fəlakətdir,",
            "verse 74:36": "həm bəşəriyyət üçün xəbərdarlıqdır,",
            "verse 74:37": "həm də sizlərdən yaxşı işlər görüb irəli çıxmaq və ya günah edib geriyə düşmək istəyənlər üçün.",
            "verse 74:38": "Hər bir kəs qazandığının girovuna çevrilir,",
            "verse 74:39": "sağ tərəf sahiblərindən başqa.",
            "verse 74:40": "Onlar Cənnət bağlarında bir-birlərindən soruşacaqlar –",
            "verse 74:41": "günahkarlar barəsində.",
            "verse 74:42": "Sizi Səqərə salan nədir?",
            "verse 74:43": "Onlar deyəcəklər: “Biz namaz qılanlardan deyildik.",
            "verse 74:44": "Kasıbı da yedizdirməzdik.",
            "verse 74:45": "Batil sözlər danışanlarla birlikdə biz də danışardıq,",
            "verse 74:46": "və Haqq-hesab gününü yalan hesab edərdik –",
            "verse 74:47": "ölüm yəqinliyi bizə gələnə qədər”.",
            "verse 74:48": "Odur ki, şəfaət edənlərin şəfaəti onlara fayda verməz.",
            "verse 74:49": "Onlara nə olub ki, nəsihətdən üz döndərirlər?",
            "verse 74:50": "Sanki ürküdülmüş vəhşi uzunqulaqlardır ki,",
            "verse 74:51": "ovçulardan (yaxud aslandan) qaçırlar.",
            "verse 74:52": "Əksinə, onlardan hər biri vəhy olunmuş səhifələrin məhz ona verilməsini istəyir.",
            "verse 74:53": "Xeyr! Əksinə, onlar Axirətdən qorxmurlar.",
            "verse 74:54": "Xeyr! Bu Quran bir nəsihətdir.",
            "verse 74:55": "İstəyən onu xatırlayar.",
            "verse 74:56": "Bilin ki, Allah istəmədikcə onlar xatırlaya bilməzlər. Mütləq qüdrətindən qorxub çəkinməyə layiq olan da, bağışlamağa qadir olan da Odur!"
        },
        "Bengali": {
            "verse 74:1": "হে চাদরাবৃত!",
            "verse 74:2": "উঠুন, সতর্ক করুন,",
            "verse 74:3": "আপন পালনকর্তার মাহাত্ম্য ঘোষনা করুন,",
            "verse 74:4": "আপন পোশাক পবিত্র করুন",
            "verse 74:5": "এবং অপবিত্রতা থেকে দূরে থাকুন।",
            "verse 74:6": "অধিক প্রতিদানের আশায় অন্যকে কিছু দিবেন না।",
            "verse 74:7": "এবং আপনার পালনকর্তার উদ্দেশে সবর করুন।",
            "verse 74:8": "যেদিন শিংগায় ফুঁক দেয়া হবে;",
            "verse 74:9": "সেদিন হবে কঠিন দিন,",
            "verse 74:10": "কাফেরদের জন্যে এটা সহজ নয়।",
            "verse 74:11": "যাকে আমি অনন্য করে সৃষ্টি করেছি, তাকে আমার হাতে ছেড়ে দিন।",
            "verse 74:12": "আমি তাকে বিপুল ধন-সম্পদ দিয়েছি।",
            "verse 74:13": "এবং সদা সংগী পুত্রবর্গ দিয়েছি,",
            "verse 74:14": "এবং তাকে খুব সচ্ছলতা দিয়েছি।",
            "verse 74:15": "এরপরও সে আশা করে যে, আমি তাকে আরও বেশী দেই।",
            "verse 74:16": "কখনই নয়! সে আমার নিদর্শনসমূহের বিরুদ্ধাচরণকারী।",
            "verse 74:17": "আমি সত্ত্বরই তাকে শাস্তির পাহাড়ে আরোহণ করাব।",
            "verse 74:18": "সে চিন্তা করেছে এবং মনঃস্থির করেছে,",
            "verse 74:19": "ধ্বংস হোক সে, কিরূপে সে মনঃস্থির করেছে!",
            "verse 74:20": "আবার ধ্বংস হোক সে, কিরূপে সে মনঃস্থির করেছে!",
            "verse 74:21": "সে আবার দৃষ্টিপাত করেছে,",
            "verse 74:22": "অতঃপর সে ভ্রূকুঞ্চিত করেছে ও মুখ বিকৃত করেছে,",
            "verse 74:23": "অতঃপর পৃষ্ঠপ্রদশন করেছে ও অহংকার করেছে।",
            "verse 74:24": "এরপর বলেছেঃ এতো লোক পরস্পরায় প্রাপ্ত জাদু বৈ নয়,",
            "verse 74:25": "এতো মানুষের উক্তি বৈ নয়।",
            "verse 74:26": "আমি তাকে দাখিল করব অগ্নিতে।",
            "verse 74:27": "আপনি কি বুঝলেন অগ্নি কি?",
            "verse 74:28": "এটা অক্ষত রাখবে না এবং ছাড়বেও না।",
            "verse 74:29": "মানুষকে দগ্ধ করবে।",
            "verse 74:30": "এর উপর নিয়োজিত আছে উনিশ (ফেরেশতা)।",
            "verse 74:31": "আমি জাহান্নামের তত্ত্বাবধায়ক ফেরেশতাই রেখেছি। আমি কাফেরদেরকে পরীক্ষা করার জন্যেই তার এই সংখ্যা করেছি-যাতে কিতাবীরা দৃঢ়বিশ্বাসী হয়, মুমিনদের ঈমান বৃদ্ধি পায় এবং কিতাবীরা ও মুমিনগণ সন্দেহ পোষণ না করে এবং যাতে যাদের অন্তরে রোগ আছে, তারা এবং কাফেররা বলে যে, আল্লাহ এর দ্বারা কি বোঝাতে চেয়েছেন। এমনিভাবে আল্লাহ যাকে ইচ্ছা পথভ্রষ্ট করেন এবং যাকে ইচ্ছা সৎপথে চালান। আপনার পালনকর্তার বাহিনী সম্পর্কে একমাত্র তিনিই জানেন এটা তো মানুষের জন্যে উপদেশ বৈ নয়।",
            "verse 74:32": "কখনই নয়। চন্দ্রের শপথ,",
            "verse 74:33": "শপথ রাত্রির যখন তার অবসান হয়,",
            "verse 74:34": "শপথ প্রভাতকালের যখন তা আলোকোদ্ভাসিত হয়,",
            "verse 74:35": "নিশ্চয় জাহান্নাম গুরুতর বিপদসমূহের অন্যতম,",
            "verse 74:36": "মানুষের জন্যে সতর্ককারী।",
            "verse 74:37": "তোমাদের মধ্যে যে সামনে অগ্রসর হয় অথবা পশ্চাতে থাকে।",
            "verse 74:38": "প্রত্যেক ব্যক্তি তার কৃতকর্মের জন্য দায়ী;",
            "verse 74:39": "কিন্তু ডানদিকস্থরা,",
            "verse 74:40": "তারা থাকবে জান্নাতে এবং পরস্পরে জিজ্ঞাসাবাদ করবে।",
            "verse 74:41": "অপরাধীদের সম্পর্কে",
            "verse 74:42": "বলবেঃ তোমাদেরকে কিসে জাহান্নামে নীত করেছে?",
            "verse 74:43": "তারা বলবেঃ আমরা নামায পড়তাম না,",
            "verse 74:44": "অভাবগ্রস্তকে আহার্য্য দিতাম না,",
            "verse 74:45": "আমরা সমালোচকদের সাথে সমালোচনা করতাম।",
            "verse 74:46": "এবং আমরা প্রতিফল দিবসকে অস্বীকার করতাম।",
            "verse 74:47": "আমাদের মৃত্যু পর্যন্ত।",
            "verse 74:48": "অতএব, সুপারিশকারীদের সুপারিশ তাদের কোন উপকারে আসবে না।",
            "verse 74:49": "তাদের কি হল যে, তারা উপদেশ থেকে মুখ ফিরিয়ে নেয়?",
            "verse 74:50": "যেন তারা ইতস্ততঃ বিক্ষিপ্ত গর্দভ।",
            "verse 74:51": "হট্টগোলের কারণে পলায়নপর।",
            "verse 74:52": "বরং তাদের প্রত্যেকেই চায় তাদের প্রত্যেককে একটি উম্মুক্ত গ্রন্থ দেয়া হোক।",
            "verse 74:53": "কখনও না, বরং তারা পরকালকে ভয় করে না।",
            "verse 74:54": "কখনও না, এটা তো উপদেশ মাত্র।",
            "verse 74:55": "অতএব, যার ইচ্ছা, সে একে স্মরণ করুক।",
            "verse 74:56": "তারা স্মরণ করবে না, কিন্তু যদি আল্লাহ চান। তিনিই ভয়ের যোগ্য এবং ক্ষমার অধিকারী।"
        },
        "Berber Amazigh": {
            "verse 74:1": "A win ipwadlen!",
            "verse 74:2": "Ekker, endeô!",
            "verse 74:3": "Mass ik, ssem$weô!",
            "verse 74:4": "Iceîîiven ik, zzizdeg!",
            "verse 74:5": "Timenqas janeb!",
            "verse 74:6": "Ur ppak ma tuôoiv kteô!",
            "verse 74:7": "I Mass ik, eûbeô!",
            "verse 74:8": "Ma ûuven di lbuq,",
            "verse 74:9": "assen, ihi, d ass uwâiô.",
            "verse 74:10": "Ur ippili d yiser, i ijehliyen.",
            "verse 74:11": "Eooet iyI, akked win Xelqe$ d afôid.",
            "verse 74:12": "Fki$ as ayla iwerrken,",
            "verse 74:13": "akked tarwa d imsaâfen.",
            "verse 74:14": "Ssehle$ as, ad istumen.",
            "verse 74:15": "Sinna issarem ad Rnu$.",
            "verse 74:16": "Xaîi! Atan, issekniyen nne£, inkeô iten.",
            "verse 74:17": "Ad êeppme$ fellas ssxev.",
            "verse 74:18": "Ih, ixemmem, d$a iseyya.",
            "verse 74:19": "Ipwasxev f akken iseyya.",
            "verse 74:20": "Da$en, ipwasxev f akken iseyya.",
            "verse 74:21": "Sinna, imuqel.",
            "verse 74:22": "Sinna, ikres tagwenza, innu$ben.",
            "verse 74:23": "Sinna, izzux, ibren.",
            "verse 74:24": "D$a inna: \"wagi d ssêur kan ippulemden.",
            "verse 74:25": "Ayagi d awal kan n umdan\".",
            "verse 74:26": "A t Fke$ i tmes iôeqqen.",
            "verse 74:27": "W ara k imlen, d acu p tmes iôeqqen?",
            "verse 74:28": "Ur teppaooa, ur tessagwar.",
            "verse 74:29": "Tesseô$a igwelman.",
            "verse 74:30": "Nnig es mrawtza.",
            "verse 74:31": "D lmalayek kan i Nerra d imawlan n tmes. Nefka d kan amvan nnsent, iwakken ad hewwlen wid ijehlen; ad pputebbten wid iwumi teppunefk Tezmamt; ad innerni liman n wid iumnen; ur ippili ccekk ar wid iwumi teppunefk Tezmamt, akked lmumnin; akken ad inin at wul iblan, akked ijehliyen: \"acu i Ib$a Öebbi s umedya agi\"? Akka, Itellif Öebbi win i S ihwan, Inehhu win i S ihwan. Iâsekôiwen n Mass ik, siwa Neppa iten Issnen. Wagi d asmekti kan i imdanen.",
            "verse 74:32": "Xaîi! S waggur!",
            "verse 74:33": "S yiv ma isahel!",
            "verse 74:34": "S tafrara ma tecâal!",
            "verse 74:35": "Ar neppat d tabarart.",
            "verse 74:36": "D aâggen i medden.",
            "verse 74:37": "I win ib$an, segwen, ad iqeddem, ne$ ad iwexxeô.",
            "verse 74:38": "Yal iman d ameôhun n wayen ixdem.",
            "verse 74:39": "Kkes ed iyeffusen.",
            "verse 74:40": "Di Loennet pmesteqsayen",
            "verse 74:41": "af ibe$wviyen:",
            "verse 74:42": "\"ar tmes acu i kwen ibbwin\"?",
            "verse 74:43": "A d inin: \"ur nelli seg wid iéullen.",
            "verse 74:44": "Ur necceççay aéawali.",
            "verse 74:45": "Nella nepjuôu akked imjuôen.",
            "verse 74:46": "Nella d inekkaôen n wass iqeîîiyen,",
            "verse 74:47": "armi d iusa i a$ itebbten\".",
            "verse 74:48": "Ur ten tenfaâ ccafuâa imcafâen.",
            "verse 74:49": "Mi ugin asmekti, d acu ten iu$en?",
            "verse 74:50": "Cuban i$wyal ixelâan,",
            "verse 74:51": "i irewlen i izem.",
            "verse 74:52": "Zi$ yal yiwen degsen ib$a ad as d asen isebtar ifesren.",
            "verse 74:53": "Xaîi! Laxeôt, ur p ugaden.",
            "verse 74:54": "Xaîi! Wagi, war ccekk, d asmekti.",
            "verse 74:55": "Win ib$an, a t ismekti.",
            "verse 74:56": "Siwa ma Ib$a Öebbi ara d smektayen. D Neppa ay d Bab uêezzeb, d Bab n ssmaê."
        },
        "Bosnian": {
            "verse 74:1": "O ti, pokriveni!",
            "verse 74:2": "Ustani i opominji!",
            "verse 74:3": "I Gospodara svoga veličaj!",
            "verse 74:4": "I haljine svoje očisti!",
            "verse 74:5": "I kumīrā se kloni!",
            "verse 74:6": "I ne prigovaraj držeći da je mnogo!",
            "verse 74:7": "I radi Gospodara svoga trpi!",
            "verse 74:8": "A kada se u Rog puhne –",
            "verse 74:9": "biće to naporan dan",
            "verse 74:10": "nevjernicima, neće biti lagahan.",
            "verse 74:11": "Meni ostavi onoga koga sam Ja izuzetkom učinio",
            "verse 74:12": "i bogatstvo mu ogromno dao",
            "verse 74:13": "i sinove koji su s njim",
            "verse 74:14": "i čast i ugled mu pružio –",
            "verse 74:15": "i još žudi da uvećam!",
            "verse 74:16": "Nikako! On, doista, prkosi ajetima Našim –",
            "verse 74:17": "a naprtiću Ja njemu teškoće,",
            "verse 74:18": "jer je smišljao i računao –",
            "verse 74:19": "i, proklet bio, kako je proračunao!",
            "verse 74:20": "i još jednom, proklet bio, kako je proračunao! –",
            "verse 74:21": "Zatim je pogledao",
            "verse 74:22": "pa se onda smrknuo i namrštio",
            "verse 74:23": "i potom se okrenuo i uzoholio,",
            "verse 74:24": "i rekao: \"Ovo nije ništa drugo do vradžbina koja se nasljeđuje,",
            "verse 74:25": "ovo su samo čovjekove riječi!\"",
            "verse 74:26": "U Sekar ću Ja njega baciti –",
            "verse 74:27": "a znaš li ti šta je Sekar?",
            "verse 74:28": "Ništa on neće poštedjeti,",
            "verse 74:29": "kože će crnim učiniti,",
            "verse 74:30": "nad njim su devetnaesterica.",
            "verse 74:31": "Mi smo čuvarima vatre meleke postavili i odredili broj njihov kao iskušenje onima koji ne vjeruju, da se oni kojima je Knjiga data uvjere, i da se onima koji vjeruju vjerovanje učvrsti, i da oni kojima je Knjiga data i oni koji su vjernici ne sumnjaju, i da oni čija su srca bolesna i oni koji su nevjernici – kažu: \"Šta je Allah htio ovim primjerom?\" Tako Allah ostavlja u zabludi onoga koga hoće, i na Pravi put ukazuje onome kome hoće. A vojske Gospodara tvoga samo On zna. I Sekar je ljudima samo opomena.",
            "verse 74:32": "I tako Mi Mjeseca,",
            "verse 74:33": "i noći kada mine,",
            "verse 74:34": "i zore kada svane –",
            "verse 74:35": "on je, zaista, najveća nevolja,",
            "verse 74:36": "ljudima je opomena –",
            "verse 74:37": "onome između vas koji želi učiniti dobro ili onome koji ne želi!",
            "verse 74:38": "Svaki čovjek je odgovoran za ono što je radio,",
            "verse 74:39": "osim sretnīkā,",
            "verse 74:40": "oni će se u džennetskim baščama raspitivati",
            "verse 74:41": "o nevjernicima:",
            "verse 74:42": "\"Šta vas je u Sekar dovelo?\"",
            "verse 74:43": "\"Nismo\" – reći će – \"bili od onih koji su molitvu obavljali",
            "verse 74:44": "i od onih koji su siromahe hranili,",
            "verse 74:45": "i u besposlice smo se sa besposlenjacima upuštali,",
            "verse 74:46": "i Sudnji dan smo poricali,",
            "verse 74:47": "sve dok nam smrt nije došla.\"",
            "verse 74:48": "Njima posredovanje posrednika neće biti od koristi.",
            "verse 74:49": "Pa zašto oni pouku izbjegavaju,",
            "verse 74:50": "kao da su divlji magarci preplašeni",
            "verse 74:51": "koji od onih koji ih progone bježe.",
            "verse 74:52": "Da! Svaki čovjek bi od njih htio da mu se daju listovi rašireni.",
            "verse 74:53": "Nikada, jer oni se onoga svijeta ne plaše!",
            "verse 74:54": "Uistinu! Kur'an je pouka,",
            "verse 74:55": "i ko hoće, na umu će ga imati,",
            "verse 74:56": "a na umu će ga imati samo ako Allah bude htio, On je jedini dostojan da Ga se boje i On jedini prašta."
        },
        "Bulgarian": {
            "verse 74:1": "О, ти, който се обвиваш [в своите одежди],",
            "verse 74:2": "стани и предупреждавай,",
            "verse 74:3": "и твоя Господ възвеличавай,",
            "verse 74:4": "и дрехите си почиствай,",
            "verse 74:5": "и скверността отбягвай,",
            "verse 74:6": "и давайки, не се стреми да получиш вповече,",
            "verse 74:7": "и в името на твоя Господ бъди търпелив!",
            "verse 74:8": "И когато се протръби с Рога,",
            "verse 74:9": "тогава този Ден ще е тежък Ден,",
            "verse 74:10": "за неверниците - нелек.",
            "verse 74:11": "Остави на Мен онзи, когото сътворих самотен",
            "verse 74:12": "и комуто отредих голямо богатство,",
            "verse 74:13": "и синове до него,",
            "verse 74:14": "и всичко му улесних!",
            "verse 74:15": "А после той ламти да му надбавя.",
            "verse 74:16": "Ала не! Пред Нашите знамения той упорства.",
            "verse 74:17": "Ще го подложа на непоносимо мъчение.",
            "verse 74:18": "Размисли той и прецени,",
            "verse 74:19": "и - проклет да е! - как прецени!",
            "verse 74:20": "И отново - проклет да е! - как прецени!",
            "verse 74:21": "После погледна.",
            "verse 74:22": "После се намръщи и навъси.",
            "verse 74:23": "После се отвърна и се възгордя.",
            "verse 74:24": "И рече: “Това е само разпространена магия.",
            "verse 74:25": "Това е само хорска реч.”",
            "verse 74:26": "Ще го пека Аз в Преизподнята.",
            "verse 74:27": "И откъде да знаеш ти какво е Преизподнята?",
            "verse 74:28": "Тя нищо не оставя и не пощадява -",
            "verse 74:29": "обгаря кожата.",
            "verse 74:30": "Пазят я деветнадесет [ангели].",
            "verse 74:31": "И сторихме пазители на Огъня само ангели, и сторихме броя им единствено за изпитание на неверниците, за да се убедят дарените с Писанието и да се усили вярата на повярвалите, и да не се съмняват дарените с Писанието и вярващите, и за да кажат онези, в чии",
            "verse 74:32": "Ала не! Кълна се в луната",
            "verse 74:33": "и в нощта, когато отминава,",
            "verse 74:34": "и в утрото, когато засиява!",
            "verse 74:35": "Този [Огън] е едно от великите изпитания",
            "verse 74:36": "предупреждение за хората,",
            "verse 74:37": "за всеки от вас, който пожелае да напредва или да изостава.",
            "verse 74:38": "Всеки е заложник на онова, което е придобил,",
            "verse 74:39": "освен владелците на десницата.",
            "verse 74:40": "В градини те ще разпитват",
            "verse 74:41": "за престъпниците.",
            "verse 74:42": "“Какво ви отведе в Преизподнята?”",
            "verse 74:43": "Ще рекат: “Ние не бяхме сред отслужващите молитвата",
            "verse 74:44": "и не хранехме нуждаещия се,",
            "verse 74:45": "и затъвахме в празнословие със затъващите,",
            "verse 74:46": "и взимахме за лъжа Съдния ден,",
            "verse 74:47": "докато ни застигна смъртта.”",
            "verse 74:48": "Затова не ще им помогне ничие застъпничество.",
            "verse 74:49": "Какво им е, защо се отдръпват от напомнянето,",
            "verse 74:50": "сякаш са подплашени диви магарета,",
            "verse 74:51": "бягащи от лъв?",
            "verse 74:52": "И всеки от тях иска да му се даде разясняващата книга.",
            "verse 74:53": "Ала не! Те не се страхуват от отвъдния живот.",
            "verse 74:54": "Ала не! Той [- Коранът] е поучение.",
            "verse 74:55": "И който пожелае, ще се поучи.",
            "verse 74:56": "И не се поучават, без Аллах да пожелае. Той е Достойният да се боят от Него и е Достойният да опрости."
        },
        "Chinese": {
            "verse 74:1": "盖被的人啊！",
            "verse 74:2": "你应当起来，你应当警告，",
            "verse 74:3": "你应当颂扬你的主宰，",
            "verse 74:4": "你应当洗涤你的衣服，",
            "verse 74:5": "你应当远离污秽，",
            "verse 74:6": "你不要施恩而求厚报，",
            "verse 74:7": "你应当为你的主而坚忍。",
            "verse 74:8": "当号角被吹向的时候，",
            "verse 74:9": "在那时，将有一个艰难的日子。",
            "verse 74:10": "那个日子对不信道的人们，是不容易渡过的。",
            "verse 74:11": "你让我独自处治我所创造的那个人吧！",
            "verse 74:12": "我赏赐他丰富的财产，",
            "verse 74:13": "和在跟前的子嗣，",
            "verse 74:14": "我提高了他的声望，",
            "verse 74:15": "而他还冀望我再多加赏赐。",
            "verse 74:16": "绝不然，他确实是反对我的迹象的，",
            "verse 74:17": "我将使他遭受苦难。",
            "verse 74:18": "他碓已思考，确已计划。",
            "verse 74:19": "但无论他怎样计划，他是被弃绝的。",
            "verse 74:20": "无论他怎样计划，他终是被弃绝的。",
            "verse 74:21": "他看一看，",
            "verse 74:22": "然后皱眉蹙额，",
            "verse 74:23": "然后高傲地转过身去，",
            "verse 74:24": "而且说：这只是传习的魔术，",
            "verse 74:25": "这只是凡人的言辞。",
            "verse 74:26": "我将使他堕入火狱，",
            "verse 74:27": "你怎能知道火狱是什么？",
            "verse 74:28": "它不让任何物存在，不许任何物留下，",
            "verse 74:29": "它烧灼肌肤。",
            "verse 74:30": "管理它的，共计十九名。",
            "verse 74:31": "我只将管理火狱的成天神，我只以他们的数目，考验不信道的人们，以便曾受天经的人们认清，而信道的人们更加笃信；以免曾受天经的人们和信道的人们怀疑；以便心中有病者和不信道者说：真主设这个譬喻做什么？真主这样使他所意欲的人误入迷途，使他所意欲的人遵循正路。只有你的主，能知道他的军队，这只是人类的教训。",
            "verse 74:32": "真的，以月亮盟誓，",
            "verse 74:33": "以逝去的黑夜盟誓，",
            "verse 74:34": "以显照的黎明盟誓，",
            "verse 74:35": "火狱确是一个大难，",
            "verse 74:36": "可以警告人类，",
            "verse 74:37": "警告你们中欲前进者或欲后退者；",
            "verse 74:38": "各人将因自己的营谋而作抵押，",
            "verse 74:39": "惟幸福的人们除外。",
            "verse 74:40": "他们在乐园中互相询问，",
            "verse 74:41": "问犯罪人们的情状，",
            "verse 74:42": "你们为什么堕入火狱呢？",
            "verse 74:43": "他们说：我们没有礼拜，",
            "verse 74:44": "也没有济贫，",
            "verse 74:45": "我们与妄言的人们一道妄言，",
            "verse 74:46": "我们否认报应日，",
            "verse 74:47": "一直到死亡降临了我们。",
            "verse 74:48": "说情者的说情，将无益於他们。",
            "verse 74:49": "他们怎么退避这教训呢？",
            "verse 74:50": "他们好像一群惊慌的驴子，",
            "verse 74:51": "刚逃避了一只狮子一样。",
            "verse 74:52": "不然，他们中的每个人都希望获得一些展开的天经。",
            "verse 74:53": "绝不然，他们不畏惧后世！",
            "verse 74:54": "真的，这《古兰经》确是一个教诲！",
            "verse 74:55": "谁愿意，谁记忆它，",
            "verse 74:56": "他们只因真主的意欲而记忆它。他是应受敬畏的，他是宜於赦宥的。"
        },
        "Danish": {
            "verse 74:1": "O gij die u omhult",
            "verse 74:2": "Sta op en waarschuw",
            "verse 74:3": "En verkondig de Grootheid van uw Heer",
            "verse 74:4": "En reinig uw hart",
            "verse 74:5": "En vlied de onreinheid",
            "verse 74:6": "Bewijs geen gunsten om u daardoor te verrijken",
            "verse 74:7": "En wees geduldig ter wille van uw Heer",
            "verse 74:8": "Want als de bazuin wordt geblazen",
            "verse 74:9": "Die Dag zal een moeilijke dag zijn",
            "verse 74:10": "Niet gemakkelijk voor de ongelovigen",
            "verse 74:11": "Laat Mij alleen met hem die Ik schiep",
            "verse 74:12": "Ik heb hem overvloedig bezit gegeven",
            "verse 74:13": "En zonen die bij hem zijn",
            "verse 74:14": "En ik verschafte hem elk gemak",
            "verse 74:15": "Toch verlangt hij dat Ik hem nog meer zal geven",
            "verse 74:16": "Stellig niet; want hij was vijandig tegenover Onze boodschappen",
            "verse 74:17": "Hem zal Ik een zware straf opleggen",
            "verse 74:18": "Ziet! Hij dacht na en hij besloot",
            "verse 74:19": "Vervloekt zij hij, hoe besloot hij",
            "verse 74:20": "Nogmaals, vervloekt zij hij! Hoe be sloot hij",
            "verse 74:21": "Toen keek hij (om zich heen)",
            "verse 74:22": "Daarna fronste hij zijn voorhoofd en keek nors",
            "verse 74:23": "Dan keerde hij zich om en toonde zich hovaardig",
            "verse 74:24": "Hij zeide: Dit is niets dan een nagebootste tovenarij",
            "verse 74:25": "Dit is slechts het woord van een mens",
            "verse 74:26": "Weldra zal Ik hem in het Vuur werpen",
            "verse 74:27": "En wat weet gij wat het Vuur der hel is",
            "verse 74:28": "Het ontziet niets, noch laat het iets (onverteerd) achter",
            "verse 74:29": "Het verschroeit het gezicht",
            "verse 74:30": "Daarover waken er negentien (engelen)",
            "verse 74:31": "En Wij hebben niets dan engelen tot wachters van het Vuur gemaakt. En Wij hebben hun getal niet vastgesteld, dan tot beproeving der ongelovigen, opdat wie het Boek is gegeven zekerheid mogen verkrijgen en dat de gelovigen in geloof mogen toenemen en opdat de mensen van het Boek en de gelovigen niet zullen twijfelen. En dat degenen in wier hart een ziekte is en degenen die ongelovig zijn, mogen zeggen: Wat bedoelt Allah met deze gelijkenis? Zo laat Allah dwalen wie Hij wil en leidt wie Hij wil. Niemand kent de legerscharen van uw Heer dan Hij. Dit is niets dan een vermaning voor de mensheid",
            "verse 74:32": "Neen, bij de maan",
            "verse 74:33": "En de nacht als zij heengaat",
            "verse 74:34": "En de dageraad wanneer zij gloort",
            "verse 74:35": "Waarlijk, het is een der grootste tijdingen",
            "verse 74:36": "Een waarschuwing voor de mensen",
            "verse 74:37": "Aan degene onder u, die vooruit wenst te gaan of degene die wil achterblijven",
            "verse 74:38": "Elke ziel is als een pand voor hetgeen zij doet",
            "verse 74:39": "Doch degenen aan de rechter hand",
            "verse 74:40": "In tuinen (wonende) vragen zij",
            "verse 74:41": "Aan de schuldigen",
            "verse 74:42": "Wat heeft u in de hel gebracht",
            "verse 74:43": "Zij zullen antwoorden: Wij behoorden niet tot hen die plachten te bidden",
            "verse 74:44": "Noch voedden wij de armen",
            "verse 74:45": "En wij plachten ijdele gesprekken te voeren met hen die ijdele gesprekken voerden",
            "verse 74:46": "En wij plachten de Dag des Oordeels te loochenen",
            "verse 74:47": "Totdat de dood ons overviel",
            "verse 74:48": "De tussenkomst van bemiddelaars zal hen daarom niets baten",
            "verse 74:49": "Wat scheelt hun dat zij zich van de vermaning afwenden",
            "verse 74:50": "Als bange ezels",
            "verse 74:51": "Vluchtende voor een leeuw",
            "verse 74:52": "Neen, ieder van hen wenst dat hem opengeslagen bladzijden zullen worden getoond",
            "verse 74:53": "Voorwaar, zij vrezen het Hiernamaals niet",
            "verse 74:54": "Neen, waarlijk, dit is een vermaning",
            "verse 74:55": "Die wil, trekke er lering uit",
            "verse 74:56": "Doch zij zullen er geen lering uit trekken tenzij Allah het wil. Hij is Waardig, dat men Hem vreest, en Hij is de Heer der vergiffenis"
        },
        "Dutch": {
            "verse 74:1": "O jij ommantelde.",
            "verse 74:2": "Sta op en waarschuw.",
            "verse 74:3": "En prijs de grootheid van jouw Heer",
            "verse 74:4": "En reinig jouw kleding.",
            "verse 74:5": "En vermijd de zondigheid.",
            "verse 74:6": "En geef niet om meer te ontvangen.",
            "verse 74:7": "En wees geduldig omwille van jouw Heer.",
            "verse 74:8": "Als dan op de bazuin geblazen wordt.",
            "verse 74:9": "Dan is dat die Dag, een zware Dag.",
            "verse 74:10": "(Die Dag is) voor de ongelovigen niet gemakkelijk.",
            "verse 74:11": "Laat hem aan Mij over die Ik alleenstaand geschapen heb.",
            "verse 74:12": "En Ik heb hem vele bezittingen ter beschikking gesteld.",
            "verse 74:13": "En kinderen, voortdurend aan zijn zijde.",
            "verse 74:14": "En Ik verschafte hem gemak in ruime mate.",
            "verse 74:15": "En vervolgens verlangt hij dat Ik (voor hem) vermeerder.",
            "verse 74:16": "Nee! Hij is opstandig tegen Onze Verzen.",
            "verse 74:17": "Ik zal hem beladen met een zware bestraffing.",
            "verse 74:18": "Voorwaar, hij dacht na en nam een besluit.",
            "verse 74:19": "Verdoemd is hij daarom. Hoe vreemd was zijn besluit!",
            "verse 74:20": "Nogmaals, verdoemd is hij! Hoe vreemd was zijn besluit!",
            "verse 74:21": "Toen dacht hij weer na.",
            "verse 74:22": "Daarna fronste hij en keek somber.",
            "verse 74:23": "Vervolgens keerde hij zijn rug toe en was hoogmoedig.",
            "verse 74:24": "En hij zei: \"Deze (Koran) is slechts overgedragen tovenarij.",
            "verse 74:25": "Dit is slechts het woord van een mens.\"",
            "verse 74:26": "Ik zal hem doen braden in Saqar (de Hel).",
            "verse 74:27": "En wat doet jou weten wat Saqar is?",
            "verse 74:28": "Zij (de Hel) laat niet achter en zij laat niet met rust.",
            "verse 74:29": "Zij verschroeit (de huid) van de mens.",
            "verse 74:30": "Over haar waken negentien (Engelen).",
            "verse 74:31": "En Wij hebben geen anderen dan Engelen aangesteld als wachters van de Hel. En Wij hebben hun aantal slechts vastgesteld als een beproeving voor degenen die niet geloven en opdat degenen aan wie de Schrift gegeven is overtuigd zullen zijn. En opdat degenen die geloven zullen toenemen in geloof, en opdat degenen aan wie de Schrift is gegeven en de gelovigen niet zullen twijfelen. En opdat degenen in wier harten een ziekte is en de ongelovigen zullen zeggen: \"Wat wil Allah met dit voorbeeld zeggen?\" Zo laat Allah dwalen wie Hij wil, en leidt Hij wie Hij wil. En niemand kent de troepenmacht van jouw Heer dan Hij. En dit is niets anders dan een Vermaning voor de mensheid.",
            "verse 74:32": "Nee, bij de maan!",
            "verse 74:33": "En de nacht wanneer hij terugkeert.",
            "verse 74:34": "En de dageraad wanneer hij gloort.",
            "verse 74:35": "Voorwaar, zij (de Hel) is zeker een van de grootste verschrikkingen.",
            "verse 74:36": "(Zij is er) als een waarschuwing voor de mensheid.",
            "verse 74:37": "Voor degenen onder hen die voort willen gaan (door goede daden te verrichten) of achter willen blijven (door slechte daden te verrichten).",
            "verse 74:38": "Iedere ziel is een borg voor wat zij heeft verricht.",
            "verse 74:39": "Behalve de mensen van de rechterzijde.",
            "verse 74:40": "In Tuinen (het Paradijs) vragen zij elkaar.",
            "verse 74:41": "Over de misdadigers.",
            "verse 74:42": "(Zij zeggen:) \"Wat heeft hen naar Saqar (de Hel) gevoerd?\"",
            "verse 74:43": "Zij zeiden: \"Wij behoorden niet tot degenen die de shalât verrichten.",
            "verse 74:44": "En wij voedden de armen niet.",
            "verse 74:45": "En wij plachten ijdele gesprekken te voeren met degenen die ijdel praatten.",
            "verse 74:46": "En wij plachten de Dag des Oordeels te loochenen.",
            "verse 74:47": "Tot het zekere (de dood) tot ons kwam.\"",
            "verse 74:48": "De voorspraak van de voorsprekers baat hen niet.",
            "verse 74:49": "Wat is er met hen dat zij zich van de Vermaning afwenden?",
            "verse 74:50": "Alsof zij opgeschrikte ezels zijn.",
            "verse 74:51": "Die vluchten voor een leeuw.",
            "verse 74:52": "Toch wil een ieder van hen, dat hun opengespreidde bladen (van een Openbaring) worden gegeven.",
            "verse 74:53": "Nee! Zij vrezen zelfs het Hiernamaals niet.",
            "verse 74:54": "Nee, voorwaar, hij (de Koran) is een Vermaning.",
            "verse 74:55": "Wie wil trekt er lering uit.",
            "verse 74:56": "En zij trekken er geen lering uit, behalve als Allah het wil. Hij is het Die vrees toekomt en Hij is het Die het toekomt om te vergeven."
        },
        "English": {
            "verse 74:1": "O you who covers himself [with a garment],",
            "verse 74:2": "Arise and warn",
            "verse 74:3": "And your Lord glorify",
            "verse 74:4": "And your clothing purify",
            "verse 74:5": "And uncleanliness avoid",
            "verse 74:6": "And do not confer favor to acquire more",
            "verse 74:7": "But for your Lord be patient.",
            "verse 74:8": "And when the trumpet is blown,",
            "verse 74:9": "That Day will be a difficult day",
            "verse 74:10": "For the disbelievers - not easy.",
            "verse 74:11": "Leave Me with the one I created alone",
            "verse 74:12": "And to whom I granted extensive wealth",
            "verse 74:13": "And children present [with him]",
            "verse 74:14": "And spread [everything] before him, easing [his life].",
            "verse 74:15": "Then he desires that I should add more.",
            "verse 74:16": "No! Indeed, he has been toward Our verses obstinate.",
            "verse 74:17": "I will cover him with arduous torment.",
            "verse 74:18": "Indeed, he thought and deliberated.",
            "verse 74:19": "So may he be destroyed [for] how he deliberated.",
            "verse 74:20": "Then may he be destroyed [for] how he deliberated.",
            "verse 74:21": "Then he considered [again];",
            "verse 74:22": "Then he frowned and scowled;",
            "verse 74:23": "Then he turned back and was arrogant",
            "verse 74:24": "And said, \"This is not but magic imitated [from others].",
            "verse 74:25": "This is not but the word of a human being.\"",
            "verse 74:26": "I will drive him into Saqar.",
            "verse 74:27": "And what can make you know what is Saqar?",
            "verse 74:28": "It lets nothing remain and leaves nothing [unburned],",
            "verse 74:29": "Blackening the skins.",
            "verse 74:30": "Over it are nineteen [angels].",
            "verse 74:31": "And We have not made the keepers of the Fire except angels. And We have not made their number except as a trial for those who disbelieve - that those who were given the Scripture will be convinced and those who have believed will increase in faith and those who were given the Scripture and the believers will not doubt and that those in whose hearts is hypocrisy and the disbelievers will say, \"What does Allah intend by this as an example?\" Thus does Allah leave astray whom He wills and guides whom He wills. And none knows the soldiers of your Lord except Him. And mention of the Fire is not but a reminder to humanity.",
            "verse 74:32": "No! By the moon",
            "verse 74:33": "And [by] the night when it departs",
            "verse 74:34": "And [by] the morning when it brightens,",
            "verse 74:35": "Indeed, the Fire is of the greatest [afflictions]",
            "verse 74:36": "As a warning to humanity -",
            "verse 74:37": "To whoever wills among you to proceed or stay behind.",
            "verse 74:38": "Every soul, for what it has earned, will be retained",
            "verse 74:39": "Except the companions of the right,",
            "verse 74:40": "[Who will be] in gardens, questioning each other",
            "verse 74:41": "About the criminals,",
            "verse 74:42": "[And asking them], \"What put you into Saqar?\"",
            "verse 74:43": "They will say, \"We were not of those who prayed,",
            "verse 74:44": "Nor did we used to feed the poor.",
            "verse 74:45": "And we used to enter into vain discourse with those who engaged [in it],",
            "verse 74:46": "And we used to deny the Day of Recompense",
            "verse 74:47": "Until there came to us the certainty.\"",
            "verse 74:48": "So there will not benefit them the intercession of [any] intercessors.",
            "verse 74:49": "Then what is [the matter] with them that they are, from the reminder, turning away",
            "verse 74:50": "As if they were alarmed donkeys",
            "verse 74:51": "Fleeing from a lion?",
            "verse 74:52": "Rather, every person among them desires that he would be given scriptures spread about.",
            "verse 74:53": "No! But they do not fear the Hereafter.",
            "verse 74:54": "No! Indeed, the Qur'an is a reminder",
            "verse 74:55": "Then whoever wills will remember it.",
            "verse 74:56": "And they will not remember except that Allah wills. He is worthy of fear and adequate for [granting] forgiveness."
        },
        "Filipino": {
            "verse 74:1": "o ikaw (Muhammad) na nababalot (ng balabal)",
            "verse 74:2": "Magbangon ka at ipahayag mo ang iyong babala",
            "verse 74:3": "Ang iyong Panginoon (Allah) ang iyong ipinagbubunyi sa kapurihan",
            "verse 74:4": "Ang iyong kasuotan ay gawin mong dalisay",
            "verse 74:5": "Ang lahat ng kabuktutan ay iyong layuan (Ar-Rujz, mga imahen o diyus-diyosan)",
            "verse 74:6": "At huwag maghangad ng ganti kung ikaw ay nagbigay, na dagdag sa makamundong pakinabang (o huwag mong ipalagay na ang gawang kabutihan sa pagsunod kay Allah ay isang biyaya sa Kanya)",
            "verse 74:7": "At maging matimtiman (sa pagtitimpi) sa kapakanan ng iyong Panginoon (alalaong baga, iyong ganapin ang iyong tungkulin sa Kanya)",
            "verse 74:8": "At kung hihipan na ang Tambuli (sa kanyang pangalawang pag-ihip)",
            "verse 74:9": "Katotohanan! Ang Araw na yaon ay Araw ng Hapis",
            "verse 74:10": "Na kasakit-sakit sa mga walang pananalig",
            "verse 74:11": "Hayaang Ako lamang (ang makitungo) sa mga (nilalang) na Aking nilikha (na hubad at walang pinagkukunan ng anuman)",
            "verse 74:12": "Na Aking ginawaran ng lahat ng bagay ng kasaganaan",
            "verse 74:13": "At mga anak na nasa kanyang tabi",
            "verse 74:14": "Aking iginawad ang buhay na maayos at maginhawa sa kanya",
            "verse 74:15": "Datapuwa’t siya ay sakim, - na Ako ay marapat pang magbigay ng higit",
            "verse 74:16": "Katotohanan, (siya ay pagkakaitan)! Sapagkat siya ay hindi nagbigay ng halaga sa Aming Kapahayagan at Tagubilin (at nanatiling matigas ang ulo)",
            "verse 74:17": "Hindi magtatagal, siya ay Aming dadalawin ng gabundok na kapahamakan (ang umakyat sa madulas na bundok ng As-Sa’ud sa Impiyerno)",
            "verse 74:18": "Katotohanang siya ay nag-isip at nagbalak",
            "verse 74:19": "Kaya’t kasawian sa kanya ( sa kaparusahan)! Paano siya nagbalak",
            "verse 74:20": "At minsan pa, kasawian sa kanya (sa kaparusahan), paano siya nagbalak",
            "verse 74:21": "At siya ay nagmuni-muni (nagmalas sa kanyang kapaligiran)",
            "verse 74:22": "At siya ay kumunot at siya ay nayamot",
            "verse 74:23": "At siya ay tumalikod at naging palalo",
            "verse 74:24": "At siya ay nagturing : “Ito ay wala ng iba kundi salamangka, mula pa noong unang panahon",
            "verse 74:25": "Ito ay wala ng iba maliban sa salita lamang ng isang tao!”",
            "verse 74:26": "Hindi magtatagal , Aking ihahagis siya sa Apoy ng Impiyerno",
            "verse 74:27": "Ah! Ano nga ba ang makakapagbigay paliwanag sa iyo kung ano ang Apoy ng Impiyerno",
            "verse 74:28": "Ito ay hindi nagpapaubaya (sa sinumang makasalanan), gayundin, ito ay hindi nag-iiwan (ng anumang bagay na hindi sunog)",
            "verse 74:29": "Na nagpapaitim at nagpapabago sa kulay ng tao (dahilan sa pagkasunog)",
            "verse 74:30": "Sa itaas nito ay may labingsiyam (na mga anghel bilang tagapagbantay at tagapanatili ng Impiyerno)",
            "verse 74:31": "At Kami ang nagtalaga ng mga anghel bilang tagapagbantay ng Apoy, at Aming itinakda lamang ang kanilang dami (19) bilang isang pagsubok sa mga hindi nananampalataya, - upang ang mga tao ng Angkan ng Kasulatan (mga Hudyo at Kristiyano) ay dumatal sa katiyakan (na ang Qur’an ay katotohanan na umaayon sa kanilang mga Aklat, alalaong baga, ang kanilang bilang [19] ay nasusulat sa Torah [mga Batas] at Ebanghelyo), at upang ang mga sumasampalataya ay lalong mag-ibayo sa Pananalig 922 (sapagkat ang Qur’an ang katotohanan), - at upang ang mga tao ng Angkan ng Kasulatan at ang mga sumasampalataya ay hindi mag-alinlangan dito, at ang mga tao na ang laman ng kanilang puso ay isang sakit (ng pagkukunwari) at ang mga hindi nananampalataya ay makapagsabi: “Ano baga ang ibig ipakahulugan ni Allah sa pamamagitan nito? Kaya’t si Allah ang umaakay na mapaligaw ang sinumang Kanyang maibigan at namamatnubay sa sinumang Kanyang maibigan. At walang sinuman ang nakakatalos ng mga kapangyarihan ng iyong Panginoon maliban sa Kanya. At ito (Impiyerno) ay wala ng iba pa maliban na isang Paala-ala (babala at tagubilin) sa sangkatauhan",
            "verse 74:32": "Hindi, at katotohanang sa pamamagitan ng Buwan",
            "verse 74:33": "At sa pamamagitan ng gabi kung ito ay humimlay",
            "verse 74:34": "At sa pamamagitan ng bukang liwayway kung ito ay namamanaag",
            "verse 74:35": "Katotohanang ito ay isa lamang sa mga Matitibay na Palatandaan (Impiyerno, o ang kanilang pagtatatwa kay Propeta Muhammad, o ang Araw ng Muling Pagkabuhay)",
            "verse 74:36": "Bilang pagpapaala-ala sa sangkatauhan",
            "verse 74:37": "Sa sinuman sa inyo na nagpasyang tumahak nang pasulong (sa pamamagitan ng paggawa ng kabutihan), o magpaiwan sa likuran (sa pamamagitan ng paggawa ng kasamaan)",
            "verse 74:38": "Ang bawat tao (kaluluwa) ay isang sanla sa kanyang mga gawa",
            "verse 74:39": "Maliban sa kanila na nanatili sa Kanan (alalaong baga, ang mga tunay na nananampalataya sa Kaisahan ni Allah at sa Islam)",
            "verse 74:40": "Sila ay mapapasa- Halamanan ng Kaligayahan, at nagtatanungan sa isa’t isa",
            "verse 74:41": "Ng tungkol sa Al-Mujrimun (mga makasalanan, mapagsamba sa diyus-diyosan, walang pananalig, kriminal, atbp.), [at sila ay mangungusap sa kanila]",
            "verse 74:42": "“Ano ang naghatid sa inyo tungo sa Apoy ng Impiyerno?”",
            "verse 74:43": "Sila ay magsasabi: “Kami ay kabilang sa mga hindi nag-aalay ng palagiang panalangin",
            "verse 74:44": "At kami rin ay hindi kabilang sa nagbibigay ng pagkain sa naghihikahos",
            "verse 74:45": "Bagkus kami ay nangag-uusap ng kabulaanan (na kinamumuhiang lahat ni Allah) sa mga walang saysay na pangungusap",
            "verse 74:46": "At kami ay lagi nang nagpapasinungaling sa Araw ng Paghuhukom",
            "verse 74:47": "Hanggang sa sumapit sa amin ang tiyak na Takdang Oras (kamatayan).”",
            "verse 74:48": "At ang pamamagitan ng mga namamagitan ay walang kapakinabangan sa kanila",
            "verse 74:49": "Kung gayon, ano ang nagpapagulo sa kanila (alalaong baga,angmgahindisumasampalataya),atsilaaytumatalikod (sa pagtanggap) ng Paala-ala",
            "verse 74:50": "Na wari bang sila ay mga nasisindaknaasno",
            "verse 74:51": "Natumatalilissaleon",
            "verse 74:52": "Katotohanan! Ang bawat isa sa kanila ay nagnanais na sila ay bigyan ng nakaladlad na dahon ng kapahayagan (mula kay Allah, na may nakasulat na ang Islam ang tamang Pananampalataya, at si Muhammad ay dumatal na may dalang katotohanan mula kay Allah, ang Panginoon ng kalangitan at kalupaan, atbp)",
            "verse 74:53": "Hindi, sa anumang kaparaanan! Sapagkat sila ay hindi nangangamba sa (kaparusahan ni Allah) sa Kabilang Buhay",
            "verse 74:54": "Hindi! Katotohanang ito (ang Qur’an) ay isang Paala-ala",
            "verse 74:55": "Kaya’t sinuman ang magnais, (hayaan siyang bumasa nito), at tumanggap ng tagubilin (mula rito)",
            "verse 74:56": "Datapuwa’t sila ay hindi tatanggap ng tagubilin malibang pahintulutan ni Allah. Siya ang Panginoon ng Kabutihan at Panginoon ng Pagpapatawad (alalaong baga, sinuman ang umiwas sa masamang gawa na Kanyang ipinagbabawal at gumawa ng mabuti na Kanyang ipinag-uutos, Siya [kung gayon] ay magpapatawad sa kanila at sila ay hindi Niya parurusahan"
        },
        "French": {
            "verse 74:1": "O, toi (Muhammad)! Le revêtu d'un manteau!",
            "verse 74:2": "Lève-toi et avertis.",
            "verse 74:3": "Et de ton Seigneur, célèbre la grandeur.",
            "verse 74:4": "Et tes vêtements, purifie-les.",
            "verse 74:5": "Et de tout péché, écarte-toi.",
            "verse 74:6": "Et ne donne pas dans le but de recevoir davantage.",
            "verse 74:7": "Et pour ton Seigneur, endure.",
            "verse 74:8": "Quand on sonnera du Clairon,",
            "verse 74:9": "alors, ce jour-là sera un jour difficile,",
            "verse 74:10": "pas facile pour les mécréants.",
            "verse 74:11": "Laisse-Moi avec celui que J'ai créé seul,",
            "verse 74:12": "et à qui J'ai donné des biens étendus,",
            "verse 74:13": "et des enfants qui lui tiennent toujours compagnie,",
            "verse 74:14": "pour qui aussi J'ai aplani toutes difficultés",
            "verse 74:15": "Cependant, il convoite [de Moi] que Je lui donne davantage.",
            "verse 74:16": "Pas du tout! Car il reniait nos versets (le Coran) avec entêtement.",
            "verse 74:17": "Je vais le contraindre à gravir une pente.",
            "verse 74:18": "Il a réfléchi. Et il a décidé.",
            "verse 74:19": "Qu'il périsse! Comme il a décidé!",
            "verse 74:20": "Encore une fois, qu'il périsse; comme il a décidé!",
            "verse 74:21": "Ensuite, il a regardé.",
            "verse 74:22": "Et il s'est renfrogné et a durci son visage.",
            "verse 74:23": "Ensuite il a tourné le dos et s'est enflé d'orgueil",
            "verse 74:24": "Puis il a dit: «Ceci (le Coran) n'est que magie apprise",
            "verse 74:25": "ce n'est là que la parole d'un humain».",
            "verse 74:26": "Je vais le brûler dans le Feu intense (Saqar).",
            "verse 74:27": "Et qui te dira ce qu'est Saqar?",
            "verse 74:28": "Il ne laisse rien et n'épargne rien;",
            "verse 74:29": "Il brûle la peau et la noircit.",
            "verse 74:30": "Ils sont dix neuf à y veiller.",
            "verse 74:31": "Nous n'avons assigné comme gardiens du Feu que des Anges. Cependant, Nous n'en avons fixé le nombre que pour éprouver les mécréants, et aussi afin que ceux à qui le Livre a été apporté soient convaincus, et que croisse la foi de ceux qui croient, et que ceux à qui le Livre a été apporté et les croyants n'aient point de doute; et pour que ceux qui ont au cœur quelque maladie ainsi que les mécréants disent: «Qu'a donc voulu Allah par cette parabole?» C'est ainsi qu'Allah égare qui Il veut et guide qui Il veut. Nul ne connaît les armées de ton Seigneur, à part Lui. Et ce n'est là qu'un rappel pour les humains.",
            "verse 74:32": "Non!... Par la lune!",
            "verse 74:33": "Et par la nuit quand elle se retire!",
            "verse 74:34": "Et par l'aurore quand elle se découvre!",
            "verse 74:35": "[Saqar] est l'un des plus grands [malheurs]",
            "verse 74:36": "un avertissement, pour les humains.",
            "verse 74:37": "Pour qui d'entre vous, veut avancer ou reculer.",
            "verse 74:38": "Toute âme est l'otage de ce qu'elle a acquis.",
            "verse 74:39": "Sauf les gens de la droite (les élus):",
            "verse 74:40": "dans des Jardins, ils s'interrogeront",
            "verse 74:41": "au sujet des criminels:",
            "verse 74:42": "«Qu'est-ce qui vous a acheminés à Saqar?»",
            "verse 74:43": "Ils diront: «Nous n'étions pas de ceux qui faisaient la Salât,",
            "verse 74:44": "et nous ne nourrissions pas le pauvre,",
            "verse 74:45": "et nous nous associions à ceux qui tenaient des conversations futiles,",
            "verse 74:46": "et nous traitions de mensonge le jour de la Rétribution,",
            "verse 74:47": "jusqu'à ce que nous vînt la vérité évidente [la mort]».",
            "verse 74:48": "Ne leur profitera point donc, l'intercession des intercesseurs.",
            "verse 74:49": "Qu'ont-ils à se détourner du Rappel?",
            "verse 74:50": "Ils sont comme des onagres épouvantés,",
            "verse 74:51": "s'enfuyant devant un lion.",
            "verse 74:52": "Chacun d'eux voudrait plutôt qu'on lui apporte des feuilles tout étalées.",
            "verse 74:53": "Ah! Non! C'est plutôt qu'ils ne craignent pas l'au-delà.",
            "verse 74:54": "Ah! Non! Ceci est vraiment un Rappel.",
            "verse 74:55": "Quiconque veut, qu'il se le rappelle.",
            "verse 74:56": "Mais ils ne se rappelleront que si Allah veut. C'est Lui qui est Le plus digne d'être craint; et c'est Lui qui détient le pardon."
        },
        "Fulah": {
            "verse 74:1": "Ko an yo mojiiɗo",
            "verse 74:2": "Ɓaŋo waajo-ɗaa",
            "verse 74:3": "Fii Joomi maa, mawninaa",
            "verse 74:4": "Comci maa ɗin, laɓɓinaa",
            "verse 74:5": "Sanamuuji ɗin, woɗɗito-ɗaa",
            "verse 74:6": "Wata a okkir fii heɓugol ko ɓuri ɗum",
            "verse 74:7": "Ko fii Joomi maa, muññortaa",
            "verse 74:8": "Si wuttaama ka allaandu",
            "verse 74:9": "haray nden ñalnde woni, ñalaande sattunde",
            "verse 74:10": "e hoore heeferɓe ɓen, nde wanaa newiinde",
            "verse 74:11": "Accidam e mo Mi tagi on kañun tun",
            "verse 74:12": "Mi waɗani mo jawdi ɗuuɗundi",
            "verse 74:13": "e ɓiɗɓe wonnduɓe e makko",
            "verse 74:14": "Mi yaññani mo yaññudee",
            "verse 74:15": "refti himo tamƴinoo nde mi ɓeydata",
            "verse 74:16": "Ɗum waɗataa ! Tawde o laatino sanndalɗiiɗo e Aayeeje Amen ɗen",
            "verse 74:17": "Aray Mi fawa mo lette sattuɗe",
            "verse 74:18": "Kanko on, o miijiti o eɓɓindii",
            "verse 74:19": "O huɗaama hono no o hoddiri",
            "verse 74:20": "Refti o huɗa hono o hoddiri",
            "verse 74:21": "Refti o ndaari",
            "verse 74:22": "Refti ñirɓanii o ɓeydi ñirɓinaade",
            "verse 74:23": "Refti o runtii hombo mawnikini",
            "verse 74:24": "ɓe wi`a: \"Ɗum wonaali, si wanaa mbilewu ɓanngu ngu",
            "verse 74:25": "Mbo wonah si wonah konngol aade",
            "verse 74:26": "Ma Mi naatnu mbo yiite saqara",
            "verse 74:27": "Hol ko anndin ma ko woni Saqara",
            "verse 74:28": "Nge heddatah nge accatah",
            "verse 74:29": "Sumoowe geece",
            "verse 74:30": "Ina e dow mannge sappa e jeenay",
            "verse 74:31": "Men waɗaali aynooɓe yimɓe Yiite ngen, si wanaa Malaa’ika. Men waɗiraali limoore maɓɓe si wanaa jarraborgol yedduɓe ɓen, e fii yo henan okkaaɓe Defte ɓen, e fii no gomɗimɓe ɓen ɓeydora gomɗinal, e fii wata okkaaɓe Defte ɓen e gomɗimɓe ɓen sikkito; e fii yo ɓen ɓe ñawu woni e ɓerɗe mun e heeferɓe ɓen wi’u: \"Hara ko honɗum Allah faandorii e ngal misal?\" Ko wano non Allah majjinirta mo O muuyani, himo fewna kadi mo O muuyani. Hay gooto anndaa yeru koneeli Joomi maa ɗin, si wanaa Kanko. Ngen [Yiite] wonaali, si wanaa waaju wonannde neɗɗanke",
            "verse 74:32": "Kono yo henane! Mi woondirii lewru ndun",
            "verse 74:33": "O woondiri jemma si mbo runtii ma",
            "verse 74:34": "E subaka si mbo fooyni",
            "verse 74:35": "Ko mbo gootel e mawɗi",
            "verse 74:36": "Ko nge jertinirde wonannde neɗɗanke",
            "verse 74:37": "Wonannde on yiɗuɗo e mo’on, nde o yaccotoo maa nennoo",
            "verse 74:38": "Wonkii kala ko faggii kon nanngirte",
            "verse 74:39": "Si wanaa yimɓe ñaamo ɓen",
            "verse 74:40": "hiɓe e nder gese, hiɓe lamndondira",
            "verse 74:41": "fii bomɓe ɓen",
            "verse 74:42": "ko hoɗum naadi on Saqara",
            "verse 74:43": "Ɓen wi`a: \"Men jeyanooka e juulooɓe ɓen",
            "verse 74:44": "men jeyanooka kadi e ñamminooɓe miskimɓe ɓen",
            "verse 74:45": "Hari men jumpidayno kadi e jumpooɓe ɓen",
            "verse 74:46": "Hari kadi men fennayno fii ñalaande njoɓdi nden",
            "verse 74:47": "Haa [maayde] yananaande nden arani men",
            "verse 74:48": "Nafataaɓe tefoore tefooɓe",
            "verse 74:49": "Hol ko waɗi ɓe sirkuɓe na ɗuurno Quraana",
            "verse 74:50": "Hoɓe mba*i e bamɗi laawatooɗi na ndoga",
            "verse 74:51": "Dokɗi mbaroodi",
            "verse 74:52": "Gooto e mum en fof na faaala totteede ɗeri caraaɗi",
            "verse 74:53": "Alah woni koɓe kulaani laakara",
            "verse 74:54": "Alah ɗuum ko ciftanirgol",
            "verse 74:55": "Ko kala faalaaɗo waactaroo mbo o waaccaroo mbo",
            "verse 74:56": "ɓe mbaactaaka si wonah Alla na haaja, ko Kanko woni kaanduɗo e huleede ko Kanko woni kaanduɗo e yaafaade"
        },
        "German": {
            "verse 74:1": "O du Zugedeckter,",
            "verse 74:2": "stehe auf und warne;",
            "verse 74:3": "und deinen Herrn, Den preise als den Größten,",
            "verse 74:4": "und deine Gewänder, die reinige,",
            "verse 74:5": "und die (Unreinheit des) Götzen(dienstes), die meide,",
            "verse 74:6": "und halte nicht (deinen Verdienst) vor, und halte ihn nicht für zu groß,",
            "verse 74:7": "und ertrage standhaft (alles) für deinen Herrn.",
            "verse 74:8": "Wenn dann ins Horn gestoßen wird,",
            "verse 74:9": "so wird jener Tag ein schwerer Tag sein",
            "verse 74:10": "für die Ungläubigen nicht leicht.",
            "verse 74:11": "Lasse Mich (allein) mit wem Ich allein erschaffen habe,",
            "verse 74:12": "und dem Ich ausgedehnten Besitz gegeben habe",
            "verse 74:13": "und Söhne (als ständige Begleiter) anwesend",
            "verse 74:14": "und dem Ich alles schön zurechtgemacht habe;",
            "verse 74:15": "doch begehrt er hierauf, daß Ich (ihm) noch mehr gebe.",
            "verse 74:16": "Keineswegs! Er ist gegen Unsere Zeichen wiederholt widerspenstig gewesen.",
            "verse 74:17": "Ich werde ihn mit Beschwerlichem bedrücken.",
            "verse 74:18": "Er hat ja nachgedacht und abgewogen.",
            "verse 74:19": "Tod ihm, wie er abgewogen hat!",
            "verse 74:20": "Abermals: Tod ihm, wie er abgewogen hat!",
            "verse 74:21": "Hierauf hat er geschaut,",
            "verse 74:22": "hierauf hat er düster geblickt und ein finsteres Gesicht gemacht,",
            "verse 74:23": "hierauf hat er den Rücken gekehrt und ist hochmütig geblieben.",
            "verse 74:24": "Er sagt: \"Das ist nur Zauberei, die überliefert wird.",
            "verse 74:25": "Das sind nur die Worte von Menschenwesen.\"",
            "verse 74:26": "Ich werde ihn der Saqar aussetzen.",
            "verse 74:27": "Und was läßt dich wissen, was Saqar ist?",
            "verse 74:28": "Sie läßt nichts übrig und läßt nichts bestehen.",
            "verse 74:29": "Sie verändert die Menschen ganz.",
            "verse 74:30": "Über ihr gibt es neunzehn (Wächter).",
            "verse 74:31": "Wir haben als Wächter des (Höllen)feuers nur Engel eingesetzt, und Wir haben ihre Zahl nur zu einer Versuchung gemacht für diejenigen, die ungläubig sind, damit diejenigen Überzeugung gewinnen, denen die Schrift gegeben wurde, und damit diejenigen, die glauben, an Glauben zunehmen, und damit diejenigen, denen die Schrift gegeben wurde, und (auch) die Gläubigen nicht zweifeln und damit diejenigen, in deren Herzen Krankheit ist, und (auch) die Ungläubigen sagen: \"Was will denn Allah damit als Gleichnis?\" So läßt Allah in die Irre gehen, wen Er will, und leitet recht, wen Er will. Aber niemand weiß über die Heerscharen deines Herrn Bescheid außer Ihm. Und es ist nur eine Ermahnung für die Menschenwesen.",
            "verse 74:32": "Keineswegs! Beim Mond",
            "verse 74:33": "und (bei) der Nacht, wenn sie den Rücken kehrt,",
            "verse 74:34": "und (bei) dem Morgen, wenn er erstrahlt,",
            "verse 74:35": "sie ist wahrlich eine der größten (Heimsuchungen)",
            "verse 74:36": "zur Warnung für die Menschenwesen,",
            "verse 74:37": "für jemanden von euch, der vorankommen oder zurückbleiben will.",
            "verse 74:38": "Jede Seele haftet für das, was sie erworben hat,",
            "verse 74:39": "außerdem die Gefährten von der rechten Seite;",
            "verse 74:40": "sie werden sich in Gärten befinden, und sie werden einander fragen",
            "verse 74:41": "nach den Übeltätern:",
            "verse 74:42": "\"Was hat euch in Saqar geführt?\"",
            "verse 74:43": "Sie werden sagen: \"Wir gehörten nicht zu denjenigen, die beteten,",
            "verse 74:44": "und wir pflegten nicht den Armen zu speisen,",
            "verse 74:45": "und wir pflegten auf schweifende Reden mit denjenigen einzugehen, die solche führten,",
            "verse 74:46": "und wir erklärten stets den Tag des Gerichts für Lüge",
            "verse 74:47": "bis die Gewißheit zu uns kam.\"",
            "verse 74:48": "Nun nützt ihnen die Fürsprache derjenigen nicht, die Fürsprache einlegen (können).",
            "verse 74:49": "Was ist denn mit ihnen, daß sie sich von der Ermahnung abwenden,",
            "verse 74:50": "als wären sie aufgeschreckte Wildesel,",
            "verse 74:51": "die vor einem Löwen fliehen?",
            "verse 74:52": "Aber nein! Jedermann von ihnen will, daß ihm aufgeschlagene Blätter zukommen.",
            "verse 74:53": "Keineswegs! Vielmehr fürchten sie nicht das Jenseits.",
            "verse 74:54": "Keineswegs! Er ist ja eine Erinnerung.",
            "verse 74:55": "Wer nun will, gedenkt seiner.",
            "verse 74:56": "Sie werden aber (seiner) nicht gedenken, außer daß Allah es will. Ihm gebührt die Gottesfurcht und Ihm gebührt die Vergebung."
        },
        "Hausa": {
            "verse 74:1": "Yã wanda ya lulluɓa da mayãfi.",
            "verse 74:2": "Ka tãshi dõmin ka yi gargaɗi",
            "verse 74:3": "Kuma Ubangijinka, sai ka girmama Shi,",
            "verse 74:4": "Kuma tutãfinka, sai ka tsarkake su,",
            "verse 74:5": "Kuma gumãka, sai ka ƙaurace musu.",
            "verse 74:6": "Kada ka yi kyauta kana nẽman ƙãri",
            "verse 74:7": "Kuma sabõda Ubangijinka? Sai ka yi haƙure",
            "verse 74:8": "To, idan aka yi bũsa a cikin ƙaho.",
            "verse 74:9": "To, wannan, a rãnar nan, yini ne mai wuya",
            "verse 74:10": "A kan kãfirai, bã mai sauƙi ba ne.",
            "verse 74:11": "Ka bar Ni da wanda Na halitta, yana shi kaɗai,",
            "verse 74:12": "Kuma Na sanya masa dũkiya shimfiɗaɗɗiya",
            "verse 74:13": "Da ɗiyã halartattu,",
            "verse 74:14": "Kuma Na shimfiɗa? masa kõme shimfiɗãwa.",
            "verse 74:15": "Sa'an nan, yanã kwaɗayin in yi masa ƙãri!",
            "verse 74:16": "Faufau! Lalle ne, shĩ yã kasance, ga ãyõyinMu, mai tsaurin kai.",
            "verse 74:17": "Zã Ni kallafa masa wahala mai hauhawa.",
            "verse 74:18": "Lalle ne, Shi, yã yi tunãni, kuma yã ƙaddara (abin da zai faɗã game da Alƙur'ãni)",
            "verse 74:19": "Sabõda haka, aka la'ane shi, kamar yadda ya ƙaddara.",
            "verse 74:20": "Sa'an nan, aka la'ane shi kamar yadda ya ƙaddara.",
            "verse 74:21": "Sa'an nan, ya yi tunãni",
            "verse 74:22": "Sa'an nan, ya gintse huska? kuma ya yi murtuk.",
            "verse 74:23": "Sa'an nan, ya jũya bãya, kuma ya bunƙãsa,",
            "verse 74:24": "Sai ya ce: \"Wannan abu dai bã kõme ba ne fãce wani sihiri, wanda aka ruwaito.\"",
            "verse 74:25": "\"Wannan maganar mutum dai ce.\"",
            "verse 74:26": "Zã Ni ƙõna shi da Saƙar.",
            "verse 74:27": "Kuma mẽ ya sanar da kai abin da akẽ cẽwa Saƙar!",
            "verse 74:28": "Bã ta ragẽwa, kuma bã ta bari.",
            "verse 74:29": "Mai nãcẽwa ga jiki ce (da (ƙũna).",
            "verse 74:30": "A kanta akwai (matsara) gõma shã tara.",
            "verse 74:31": "Kuma ba Mu sanya ma'abũta wutã (wãto matsaranta) ba, fãce malã'iku, kuma ba Mu sanya adadinsu (gõma sha tara) ba, fãce dõmin fitina ga waɗanda suka kãfirta domin waɗanda aka bai wa littãfi su sãmi yaƙĩni kuma waɗanda suka yi ĩmãni su ƙãra ĩmãni, kuma waɗanda aka bai wa littãfi da mũminai bã zã su yi shakka ba, kuma domin wa ɗanda a cikin zukatansu akwai wata cuta da kãfirai su ce: \"Mẽ Allah Yake nufi da wannan, ya kasance misãli?\" Haka dai Allah ke ɓatar da wanda Ya so, kuma Ya shiryar da wanda ya so. Kuma bãbu wanda ya san mayãƙan Ubangijinka fãce Shi, kuma ita (wutar) ba ta kasance ba fãce wata tunãtarwa ce ga mutum.",
            "verse 74:32": "A'aha! Ina rantsuwa da watã.",
            "verse 74:33": "Da dare a lõkacin da ya jũyar da baya.",
            "verse 74:34": "Da sãfiya idan ta wãye.",
            "verse 74:35": "Ita (wutar) ɗayan manyan masĩfũ? ce.",
            "verse 74:36": "Mai gargaɗĩ ce ga mutum.",
            "verse 74:37": "Ga wanda ya so, daga cikinku, ya gabãta ko ya jinkirta.",
            "verse 74:38": "Kõwane rai ga abin da ya aikata jingina ce.",
            "verse 74:39": "Fãce mutãnen dãma.",
            "verse 74:40": "A cikin Aljanna suna tambayar jũna.",
            "verse 74:41": "Game da mãsu laifi.",
            "verse 74:42": "(Su ce musu) \"Me ya shigar da ku a cikin Saƙar?\"",
            "verse 74:43": "Suka ce: \"Ba mu kasance munã a cikin mãsu salla ba.\"",
            "verse 74:44": "\"Kuma ba mu kasance muna ciyar da matalautã ba.\"",
            "verse 74:45": "\"Kuma mun kasance muna kũtsãwa tãre da mãsu kũtsãwa.\"",
            "verse 74:46": "\"Mun kasance munã ƙaryata rãnar sãkamako.\"",
            "verse 74:47": "\"Har gaskiya (wãto mutuwa) ta zo mana.\"",
            "verse 74:48": "Sabõda haka cẽton mãsu cẽto bã zai amfãne su ba.",
            "verse 74:49": "Haba! Me ya same su, suka zama mãsu bijirewa daga wa'azin gaskiya.",
            "verse 74:50": "Kamar dai sũ, jãkuna firgitattu ne.",
            "verse 74:51": "Sun gudu daga zãki.",
            "verse 74:52": "A'aha! Kõwãne mutum daga cikinsu yanã son a zo masa da takardu (da sũnansa) ana wãtsãwa",
            "verse 74:53": "A'aha! Kai dai, bã su jin tsõron Lãhira.",
            "verse 74:54": "A'aha! Lalle ne, shi (Alƙur'ãni) tunãtarwa ce.",
            "verse 74:55": "Dõmin wanda ya so, ya tuna.",
            "verse 74:56": "Kuma bã zã su tuna ba fãce idan Allah Ya so, Shi ne Ya cancanta a bi Shi da taƙawa kuma Ya cancanta ga Ya yi gãfara."
        },
        "Hindi": {
            "verse 74:1": "ऐ (मेरे) कपड़ा ओढ़ने वाले (रसूल) उठो",
            "verse 74:2": "और लोगों को (अज़ाब से) डराओ",
            "verse 74:3": "और अपने परवरदिगार की बड़ाई करो",
            "verse 74:4": "और अपने कपड़े पाक रखो",
            "verse 74:5": "और गन्दगी से अलग रहो",
            "verse 74:6": "और इसी तरह एहसान न करो कि ज्यादा के ख़ास्तगार बनो",
            "verse 74:7": "और अपने परवरदिगार के लिए सब्र करो",
            "verse 74:8": "फिर जब सूर फूँका जाएगा",
            "verse 74:9": "तो वह दिन काफ़िरों पर सख्त दिन होगा",
            "verse 74:10": "आसान नहीं होगा",
            "verse 74:11": "(ऐ रसूल) मुझे और उस शख़्श को छोड़ दो जिसे मैने अकेला पैदा किया",
            "verse 74:12": "और उसे बहुत सा माल दिया",
            "verse 74:13": "और नज़र के सामने रहने वाले बेटे (दिए)",
            "verse 74:14": "और उसे हर तरह के सामान से वुसअत दी",
            "verse 74:15": "फिर उस पर भी वह तमाअ रखता है कि मैं और बढ़ाऊँ",
            "verse 74:16": "ये हरगिज़ न होगा ये तो मेरी आयतों का दुश्मन था",
            "verse 74:17": "तो मैं अनक़रीब उस सख्त अज़ाब में मुब्तिला करूँगा",
            "verse 74:18": "उसने फिक्र की और ये तजवीज़ की",
            "verse 74:19": "तो ये (कम्बख्त) मार डाला जाए",
            "verse 74:20": "उसने क्यों कर तजवीज़ की",
            "verse 74:21": "फिर ग़ौर किया",
            "verse 74:22": "फिर त्योरी चढ़ाई और मुँह बना लिया",
            "verse 74:23": "फिर पीठ फेर कर चला गया और अकड़ बैठा",
            "verse 74:24": "फिर कहने लगा ये बस जादू है जो (अगलों से) चला आता है",
            "verse 74:25": "ये तो बस आदमी का कलाम है",
            "verse 74:26": "(ख़ुदा का नहीं) मैं उसे अनक़रीब जहन्नुम में झोंक दूँगा",
            "verse 74:27": "और तुम क्या जानों कि जहन्नुम क्या है",
            "verse 74:28": "वह न बाक़ी रखेगी न छोड़ देगी",
            "verse 74:29": "और बदन को जला कर सियाह कर देगी",
            "verse 74:30": "उस पर उन्नीस (फ़रिश्ते मुअय्यन) हैं",
            "verse 74:31": "और हमने जहन्नुम का निगेहबान तो बस फरिश्तों को बनाया है और उनका ये शुमार भी काफिरों की आज़माइश के लिए मुक़र्रर किया ताकि अहले किताब (फौरन) यक़ीन कर लें और मोमिनो का ईमान और ज्यादा हो और अहले किताब और मोमिनीन (किसी तरह) शक़ न करें और जिन लोगों के दिल में (निफ़ाक का) मर्ज़ है (वह) और काफिर लोग कह बैठे कि इस मसल (के बयान करने) से ख़ुदा का क्या मतलब है यूँ ख़ुदा जिसे चाहता है गुमराही में छोड़ देता है और जिसे चाहता है हिदायत करता है और तुम्हारे परवरदिगार के लशकरों को उसके सिवा कोई नहीं जानता और ये तो आदमियों के लिए बस नसीहत है",
            "verse 74:32": "सुन रखो (हमें) चाँद की क़सम",
            "verse 74:33": "और रात की जब जाने लगे",
            "verse 74:34": "और सुबह की जब रौशन हो जाए",
            "verse 74:35": "कि वह (जहन्नुम) भी एक बहुत बड़ी (आफ़त) है",
            "verse 74:36": "(और) लोगों के डराने वाली है",
            "verse 74:37": "(सबके लिए नहीें बल्कि) तुममें से वह जो शख़्श (नेकी की तरफ़) आगे बढ़ना",
            "verse 74:38": "और (बुराई से) पीछे हटना चाहे हर शख़्श अपने आमाल के बदले गिर्द है",
            "verse 74:39": "मगर दाहिने हाथ (में नामए अमल लेने) वाले",
            "verse 74:40": "(बेहिश्त के) बाग़ों में गुनेहगारों से बाहम पूछ रहे होंगे",
            "verse 74:41": "कि आख़िर तुम्हें दोज़ख़ में कौन सी चीज़ (घसीट) लायी",
            "verse 74:42": "वह लोग कहेंगे",
            "verse 74:43": "कि हम न तो नमाज़ पढ़ा करते थे",
            "verse 74:44": "और न मोहताजों को खाना खिलाते थे",
            "verse 74:45": "और अहले बातिल के साथ हम भी बड़े काम में घुस पड़ते थे",
            "verse 74:46": "और रोज़ जज़ा को झुठलाया करते थे (और यूँ ही रहे)",
            "verse 74:47": "यहाँ तक कि हमें मौत आ गयी",
            "verse 74:48": "तो (उस वक्त) उन्हें सिफ़ारिश करने वालों की सिफ़ारिश कुछ काम न आएगी",
            "verse 74:49": "और उन्हें क्या हो गया है कि नसीहत से मुँह मोड़े हुए हैं",
            "verse 74:50": "गोया वह वहशी गधे हैं",
            "verse 74:51": "कि येर से (दुम दबा कर) भागते हैं",
            "verse 74:52": "असल ये है कि उनमें से हर शख़्श इसका मुतमइनी है कि उसे खुली हुई (आसमानी) किताबें अता की जाएँ",
            "verse 74:53": "ये तो हरगिज़ न होगा बल्कि ये तो आख़ेरत ही से नहीं डरते",
            "verse 74:54": "हाँ हाँ बेशक ये (क़ुरान सरा सर) नसीहत है",
            "verse 74:55": "तो जो चाहे उसे याद रखे",
            "verse 74:56": "और ख़ुदा की मशीयत के बग़ैर ये लोग याद रखने वाले नहीं वही (बन्दों के) डराने के क़ाबिल और बख्यिश का मालिक है"
        },
        "Indonesian": {
            "verse 74:1": "Hai orang yang berkemul (berselimut),",
            "verse 74:2": "bangunlah, lalu berilah peringatan!",
            "verse 74:3": "dan Tuhanmu agungkanlah!",
            "verse 74:4": "dan pakaianmu bersihkanlah,",
            "verse 74:5": "dan perbuatan dosa tinggalkanlah,",
            "verse 74:6": "dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak.",
            "verse 74:7": "Dan untuk (memenuhi perintah) Tuhanmu, bersabarlah.",
            "verse 74:8": "Apabila ditiup sangkakala,",
            "verse 74:9": "maka waktu itu adalah waktu (datangnya) hari yang sulit,",
            "verse 74:10": "bagi orang-orang kafir lagi tidak mudah.",
            "verse 74:11": "Biarkanlah Aku bertindak terhadap orang yang Aku telah menciptakannya sendirian.",
            "verse 74:12": "Dan Aku jadikan baginya harta benda yang banyak,",
            "verse 74:13": "dan anak-anak yang selalu bersama dia,",
            "verse 74:14": "dan Ku-lapangkan baginya (rezeki dan kekuasaan) dengan selapang-lapangnya,",
            "verse 74:15": "kemudian dia ingin sekali supaya Aku menambahnya.",
            "verse 74:16": "Sekali-kali tidak (akan Aku tambah), karena sesungguhnya dia menentang ayat-ayat Kami (Al Quran).",
            "verse 74:17": "Aku akan membebaninya mendaki pendakian yang memayahkan.",
            "verse 74:18": "Sesungguhnya dia telah memikirkan dan menetapkan (apa yang ditetapkannya),",
            "verse 74:19": "maka celakalah dia! Bagaimana dia menetapkan?,",
            "verse 74:20": "kemudian celakalah dia! Bagaimanakah dia menetapkan?,",
            "verse 74:21": "kemudian dia memikirkan,",
            "verse 74:22": "sesudah itu dia bermasam muka dan merengut,",
            "verse 74:23": "kemudian dia berpaling (dari kebenaran) dan menyombongkan diri,",
            "verse 74:24": "lalu dia berkata: \"(Al Quran) ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu),",
            "verse 74:25": "ini tidak lain hanyalah perkataan manusia\".",
            "verse 74:26": "Aku akan memasukkannya ke dalam (neraka) Saqar.",
            "verse 74:27": "Tahukah kamu apakah (neraka) Saqar itu?",
            "verse 74:28": "Saqar itu tidak meninggalkan dan tidak membiarkan.",
            "verse 74:29": "(Neraka Saqar) adalah pembakar kulit manusia.",
            "verse 74:30": "Dan di atasnya ada sembilan belas (malaikat penjaga).",
            "verse 74:31": "Dan tiada Kami jadikan penjaga neraka itu melainkan dari malaikat: dan tidaklah Kami menjadikan bilangan mereka itu melainkan untuk jadi cobaan bagi orang-orang kafir, supaya orang-orang yang diberi Al-Kitab menjadi yakin dan supaya orang yang beriman bertambah imannya dan supaya orang-orang yang diberi Al Kitab dan orng-orang mukmin itu tidak ragu-ragu dan supaya orang-orang yang di dalam hatinya ada penyakit dan orang-orang kafir (mengatakan): \"Apakah yang dikehendaki Allah dengan bilangan ini sebagai suatu perumpamaan?\" Demikianlah Allah membiarkan sesat orang-orang yang dikehendaki-Nya dan memberi petunjuk kepada siapa yang dikehendaki-Nya. Dan tidak ada yang mengetahui tentara Tuhanmu melainkan Dia sendiri. Dan Saqar itu tiada lain hanyalah peringatan bagi manusia.",
            "verse 74:32": "Sekali-kali tidak, demi bulan,",
            "verse 74:33": "dan malam ketika telah berlalu,",
            "verse 74:34": "dan subuh apabila mulai terang.",
            "verse 74:35": "Sesungguhnya Saqar itu adalah salah satu bencana yang amat besar,",
            "verse 74:36": "sebagai ancaman bagi manusia.",
            "verse 74:37": "(Yaitu) bagi siapa di antaramu yang berkehendak akan maju atau mundur.",
            "verse 74:38": "Tiap-tiap diri bertanggung jawab atas apa yang telah diperbuatnya,",
            "verse 74:39": "kecuali golongan kanan,",
            "verse 74:40": "berada di dalam surga, mereka tanya menanya,",
            "verse 74:41": "tentang (keadaan) orang-orang yang berdosa,",
            "verse 74:42": "\"Apakah yang memasukkan kamu ke dalam Saqar (neraka)?\"",
            "verse 74:43": "Mereka menjawab: \"Kami dahulu tidak termasuk orang-orang yang mengerjakan shalat,",
            "verse 74:44": "dan kami tidak (pula) memberi makan orang miskin,",
            "verse 74:45": "dan adalah kami membicarakan yang bathil, bersama dengan orang-orang yang membicarakannya,",
            "verse 74:46": "dan adalah kami mendustakan hari pembalasan,",
            "verse 74:47": "hingga datang kepada kami kematian\".",
            "verse 74:48": "Maka tidak berguna lagi bagi mereka syafa'at dari orang-orang yang memberikan syafa'at.",
            "verse 74:49": "Maka mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah)?,",
            "verse 74:50": "seakan-akan mereka itu keledai liar yang lari terkejut,",
            "verse 74:51": "lari daripada singa.",
            "verse 74:52": "Bahkan tiap-tiap orang dari mereka berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka.",
            "verse 74:53": "Sekali-kali tidak. Sebenarnya mereka tidak takut kepada negeri akhirat.",
            "verse 74:54": "Sekali-kali tidak demikian halnya. Sesungguhnya Al Quran itu adalah peringatan.",
            "verse 74:55": "Maka barangsiapa menghendaki, niscaya dia mengambil pelajaran daripadanya (Al Quran).",
            "verse 74:56": "Dan mereka tidak akan mengambil pelajaran daripadanya kecuali (jika) Allah menghendakinya. Dia (Allah) adalah Tuhan Yang patut (kita) bertakwa kepada-Nya dan berhak memberi ampun."
        },
        "Italian": {
            "verse 74:1": "O tu che sei avvolto nel mantello,",
            "verse 74:2": "alzati e ammonisci,",
            "verse 74:3": "e il tuo Signore magnifica,",
            "verse 74:4": "e le tue vesti purifica,",
            "verse 74:5": "allontanati dall'abiezione.",
            "verse 74:6": "Non dar nulla sperando di ricevere di più,",
            "verse 74:7": "ma sopporta con pazienza per il tuo Signore!",
            "verse 74:8": "Quando sarà soffiato nel Corno,",
            "verse 74:9": "quello sarà un Giorno difficile,",
            "verse 74:10": "niente affatto facile per i miscredenti.",
            "verse 74:11": "LasciaMi solo con colui che ho creato,",
            "verse 74:12": "cui ho concesso abbondanza di beni,",
            "verse 74:13": "e figli al suo fianco,",
            "verse 74:14": "al quale ho facilitato ogni cosa,",
            "verse 74:15": "e che ancora desidera che gli dia di più.",
            "verse 74:16": "No, invero è stato refrattario ai Nostri segni:",
            "verse 74:17": "lo costringerò a una dura salita.",
            "verse 74:18": "Ha ponderato e l'ha definito.",
            "verse 74:19": "Perisca per come l'ha definito,",
            "verse 74:20": "sì, perisca per come l'ha definito!",
            "verse 74:21": "Quindi ha guardato,",
            "verse 74:22": "si è accigliato e rabbuiato.",
            "verse 74:23": "Ha volto le spalle, si è fatto altero",
            "verse 74:24": "e ha detto: “Questo non è che magia appresa;",
            "verse 74:25": "non è altro che un discorso di un uomo”.",
            "verse 74:26": "Lo getterò nel Calore che brucia.",
            "verse 74:27": "Chi mai ti dirà cos'è il Calore che brucia?",
            "verse 74:28": "Nulla risparmia, non lascia nulla;",
            "verse 74:29": "carbonizza gli uomini.",
            "verse 74:30": "Gli stanno a guardia diciannove [angeli].",
            "verse 74:31": "Non ponemmo che angeli a guardia del fuoco, fissando il loro numero solo per tentare i miscredenti affinché credessero con fermezza quelli cui è stato dato il Libro e aumentasse la fede dei credenti e non dubitassero coloro cui è stata data la Scrittura e i credenti, e affinché coloro che hanno morbo nel cuore e i miscredenti dicessero: “Cosa vuol significare Allah con questa metafora?”. È così che Allah travia chi vuole e guida chi vuole.Non conosce le truppe del tuo Signore altri che Lui.",
            "verse 74:32": "No, per la luna,",
            "verse 74:33": "per la notte quando volge al termine,",
            "verse 74:34": "e per l'aurora quando si mostra,",
            "verse 74:35": "[il Calore è davvero uno dei segni più grandi,",
            "verse 74:36": "un monito per gli uomini,",
            "verse 74:37": "per chi di voi vuole avanzare [nella fede] o indietreggiare.",
            "verse 74:38": "Ogni anima è pegno di quello che ha compiuto,",
            "verse 74:39": "eccetto i compagni della destra;",
            "verse 74:40": "[saranno] nei Giardini e si interpelleranno a vicenda",
            "verse 74:41": "a proposito dei colpevoli:",
            "verse 74:42": "“Cosa mai vi ha condotti al Calore che brucia?”.",
            "verse 74:43": "Risponderanno: “Non eravamo tra coloro che eseguivamo l'orazione,",
            "verse 74:44": "né nutrivamo il povero,",
            "verse 74:45": "e chiacchieravamo vanamente con i chiacchieroni",
            "verse 74:46": "e tacciavamo di menzogna il Giorno del Giudizio,",
            "verse 74:47": "finché non ci pervenne la certezza”.",
            "verse 74:48": "Non gioverà loro l'intercessione di intercessori.",
            "verse 74:49": "Ma perché mai si scostano dal Monito?",
            "verse 74:50": "Sembravano onagri spaventati",
            "verse 74:51": "che fuggono davanti a un leone!",
            "verse 74:52": "Ciascuno di loro vorrebbe che gli fossero dati fogli dispiegati.",
            "verse 74:53": "No, non hanno invece alcun timore dell'altra vita!",
            "verse 74:54": "No, in verità questo è un Monito.",
            "verse 74:55": "Se ne ricordi dunque chi vuole.",
            "verse 74:56": "Ma non se ne ricorderanno altrimenti che se Allah vuole. Egli è il più Degno di essere temuto, è il Detentore del perdono."
        },
        "Japanese": {
            "verse 74:1": "（大衣に）包る者よ，",
            "verse 74:2": "立ち上って警告しなさい。",
            "verse 74:3": "あなたの主を讃えなさい。",
            "verse 74:4": "またあなたの衣を清潔に保ちなさい。",
            "verse 74:5": "不浄を避けなさい。",
            "verse 74:6": "見返りを期待して施してはならない。",
            "verse 74:7": "あなたの主の（道の）ために，耐え忍びなさい。",
            "verse 74:8": "ラッパが吹かれる時，",
            "verse 74:9": "その日は苦難の日。",
            "verse 74:10": "不信者たちにとり，安らぎのない（日である）。",
            "verse 74:11": "われが創った者を，われ一人に任せなさい。",
            "verse 74:12": "われは，かれに豊かな富を授け，",
            "verse 74:13": "またその回りに，息子たちを侍らせ，",
            "verse 74:14": "かれのために，（物事を）円満容易にした。",
            "verse 74:15": "それでもかれは，われが更に豊かにするよう欲した。",
            "verse 74:16": "断じて許されない。かれは，わが印に対し頑迷であった。",
            "verse 74:17": "やがてわれは，酪い痛苦でかれを悩ますであろう。",
            "verse 74:18": "かれは想を練り，策謀した。",
            "verse 74:19": "かれは滅びるであろう。何と（惑意をもって）かれらは策謀したことよ。",
            "verse 74:20": "重ねていう。かれは滅びるであろう。何とかれは策謀したことよ。",
            "verse 74:21": "その時，かれはちらっと（クルアーンを）眺め，",
            "verse 74:22": "眉をひそめ，苦い顔をして，",
            "verse 74:23": "それから，高慢に背を向けて去った。",
            "verse 74:24": "かれは言った。「これは昔からの魔術に過ぎません。",
            "verse 74:25": "どうみても人間の言葉に過ぎません。」",
            "verse 74:26": "やがてわれは地獄の火て，かれを焼くであろう。",
            "verse 74:27": "地獄の火が何であるかを，あなたに理解させるものは何か。",
            "verse 74:28": "それは何ものも免れさせず，また何ものも残さない。",
            "verse 74:29": "人の皮膚を，黒く焦がす。",
            "verse 74:30": "その上には19（の天使が看守る）。",
            "verse 74:31": "われが業火の看守として，天使たちの外に誰も命じなかった。またかれらの数を限定したことは，不信心の者たちに対する一つの試みに過ぎない。（それにより）啓典を授けられた者たちを確信させ，また信じる者の信仰を深めるためである。また啓典を授けられた者や信者たちが，疑いを残さず，またその心に病の宿る者や，不信者たちに，「アッラーはこの比喩で，何を御望みになるのでしょうか。」と言わせるためである。このようにアッラーは，御自分の望みの者を迷わせ，また望みの者を導かれる。そしてかれの外誰もあなたの主の軍勢を知らないのである。本当にこれは人間に対する訓戒に外ならない。",
            "verse 74:32": "いや，月に誓けて，",
            "verse 74:33": "退こうとする，夜に誓けて，",
            "verse 74:34": "また輝こうとする，暁に誓けて（誓う）。",
            "verse 74:35": "それは大きな（徴の）一つであり，",
            "verse 74:36": "人間への警告。",
            "verse 74:37": "あなたがたの中，前に進むことを望む者，また後に残ることを願う者への（警告である）。",
            "verse 74:38": "それぞれの魂は，その行ったことに対し，（アッラーに）担保を提供している。",
            "verse 74:39": "右手の仲間は別である。",
            "verse 74:40": "（かれらは）楽園の中にいて，互いに尋ね合うであろう。",
            "verse 74:41": "罪を犯した者たちに就いて，",
            "verse 74:42": "「何が，あなたがたを烈火の中に導いたのですか。」と。",
            "verse 74:43": "かれらは（答えて）言う。「わたしたちは礼拝を捧げていませんでした。",
            "verse 74:44": "わたしたちはまた，貧者を養いませんでした。",
            "verse 74:45": "わたしたちは空論の徒と共に無駄話に耽り，",
            "verse 74:46": "常に審判の日を否定していました。",
            "verse 74:47": "遂に真実が，わたしたちに到来しました。」",
            "verse 74:48": "それで執り成す者の執り成しも，かれらに役立たないであろう。",
            "verse 74:49": "一体訓戒から背き去るとは，かれらはどうしたのであろう。",
            "verse 74:50": "かれらは丁度獅子を見て恐怖に陥ったロバのように，",
            "verse 74:51": "一目散に逃げ出すかのようであった。",
            "verse 74:52": "いや，かれらはそれぞれ開かれた書巻が授けられることを望んでいる。",
            "verse 74:53": "いや断してそうではない。かれらは来世を恐れていないのである。",
            "verse 74:54": "いや，これは正に訓戒である。",
            "verse 74:55": "だから誰でも欲する者には，それを肝に銘じさせなさい。",
            "verse 74:56": "だが，アッラーが望まれる者の外は，留意しないであろう。かれは畏るべき御方よく許して下される御方である。"
        },
        "Jawa": {
            "verse 74:1": "wengi. Lan shabatira sagolongan hiya padha mangkono. Allah nemtokake dawa cendhake rina lan wengi, nguningani yen sira padha ora kelar sholat samono suwene mau kajaba kelawan rekasa, mulane Allah muwung marang sira. Sarehne mangkono sira macaa al-Quran sakuwasanira ana sajerone sholat. Allah nguningani yen sira iku bakal ana kang nandhang lara banjur rekasa sholat ing wayah wengi lan ana uga kang padha mlaku lelungan ing bumi ngupaya jiwa golek rizki kanugrahaning Allah lan ana uga kang padha perang ing dalaning Allah, mulane sira padhaa maca al-Quran sakuwasanira lan ngakonana sholat, bayar zakat, padha motangna becik marang Allah. Samu barang kabecikan kang padha sira lakoni bakal nemu ganjran becik ana ngarsaning Allah ngungkuli kabecikan kang sira lakoni ing buri. Lan nyuwuna pangapuraning Allah, satemene Allah iku karsa ngapura tur maha asih. . He wong kang mujung (Muhammad)",
            "verse 74:2": "Sira ngadeka lan elingna",
            "verse 74:3": "Lan nyebuta Maha Agung ing Allah Pangeranira",
            "verse 74:4": "Tuwin angresikna sasandanganira",
            "verse 74:5": "Apa dene angedohna jejember",
            "verse 74:6": "Lan aja weweh murih wewales kang luwih akeh",
            "verse 74:7": "Lan sabara karana ngelakoni parentahe Pangeranira",
            "verse 74:8": "Amarga samangsa slompret tiniyub",
            "verse 74:9": "Ing dina iku kena diarani dina rekasa",
            "verse 74:10": "TUmrap engatase para wong kafir ora pisan gampang",
            "verse 74:11": "Tona wae Ingsun dheweke karo wong kang wus Ingsun titahake",
            "verse 74:12": "Lan wis Ingsun paringi bandha kang omber",
            "verse 74:13": "Uga Ingsun paringin anak lanang akeh padha nglumpuk",
            "verse 74:14": "Tuwin perkarane Ingsun tata sarwa tumata",
            "verse 74:15": "Ewa dene dheweke isih angajab Ingsun wuwuhana",
            "verse 74:16": "Ora pisan - pisan! Sayekti dheweke amilawani timbalan - timbalan Ingsun",
            "verse 74:17": "Ingsun bakal anibakake siksa kang nyusahake marang dheweke",
            "verse 74:18": "Sayekti, dheweke mikir - mikir sarta anetepake",
            "verse 74:19": "Ananging marga siniku, kapriye anggone netepake",
            "verse 74:20": "Maneh, muga siniku kapriye anggone netepake",
            "verse 74:21": "Banjur angawasake",
            "verse 74:22": "Tumuli mrengut sarta nyawang sumengit",
            "verse 74:23": "Banjur mungkur sarta gumedhe",
            "verse 74:24": "Banjur celathu, \"Al-Quran iki ora liya kajaba sihir kang disinau (saka wong - wong biyen)",
            "verse 74:25": "(Al-Quran) iki ora liya mung pangucaping manungsa wae",
            "verse 74:26": "Dheweke bakal Ingsun cemplungake neraka saqar",
            "verse 74:27": "Kapriye panemunira, apa kang aran neraka saqar",
            "verse 74:28": "Neraka saqar mau ora ngawetake, sadhengah kang kacemplung ing kono mesthi rusak",
            "verse 74:29": "Tur gosongake kulit",
            "verse 74:30": "Ing kono ana (Malaikat) kang anjaga",
            "verse 74:31": "Lan ora liya kajaba Malaikat kang Ingsun dadekake panjaganing geni, sarta wilangane iku ora liya kajaba mung Ingsun dadekake coba tumrap wong kang padha kafir, supaya para kang kaparingan Kitab padha yakin, sarta para kang padha iman pada wuwuh imane, apa dene (supaya) ora padha semang - semang para kang kaparingan kitab lan para mukminin, sarta supaya para kang sajeroning atine ana lelarane sarta para kafir padha elathir: apa ta kersaning Allah andamel sanepa iki? Iya kaya mangkono iku anggone Allah andadekake sasare sapa kang dadi karsane, sarta aparing pituduh (marang) sapa sing dadi kersane, lan ora ana kang weruh wedyabalane Pangeranira kajaba mung Panjenengane, lan iki ora liya kajaba pepeling tumrap para manungsa",
            "verse 74:32": "Demi rembulan, wong kafir ora pisan ngistokake wewulanging al-Quran",
            "verse 74:33": "Demi wengi nalikane mungkur",
            "verse 74:34": "Demi wajah Shubuh nalikane padhang",
            "verse 74:35": "Temen neraka Saqar iku ewone bebaya kang gedhe",
            "verse 74:36": "Kanggo medheni marang manungsa",
            "verse 74:37": "Tumrap wong kancanira kang arep maju pracaya (al-Quran) utawa mundur ora pracaya",
            "verse 74:38": "Sarupaning awak iku kaiket (tanggung jawab) karo sabarang panggawene",
            "verse 74:39": "Kajaba para kang ana ing tangan tengen",
            "verse 74:40": "Ana sajeroning patamanan bakal padha takon - takon",
            "verse 74:41": "Prakara wong kang padha dosa",
            "verse 74:42": "Punapa marganipun sampeyan wonten ing salebeting neraka",
            "verse 74:43": "Bakal padha mangsuli, \"Kula punika sanes golonganipun tiyang ingkang sami sholat",
            "verse 74:44": "Lan kula boten nate nyukani tedha tiyang miskin",
            "verse 74:45": "Sarta damel kula omong lelahanan kaliyan tiyang ingkang damelipun omong lelahanan",
            "verse 74:46": "Sarta kula punika mahiben badhe kalampahipun dinten piwale",
            "verse 74:47": "Ngantos datengipun pejah kula",
            "verse 74:48": "(Pangendikaning Allah) Mulane syafa’ate para juru syafaat ora bakal migunani marang dheweke",
            "verse 74:49": "Lan apa ta pakolehe anggone wong mau padha lumuh nistakake saka pepeling (al-Quran)",
            "verse 74:50": "Kaya dene kuldi (keledai liar) kang kaget",
            "verse 74:51": "Kan anggeblas ngoncati: singo barong",
            "verse 74:52": "Balik dheweke, siji - sijine padha angajab diparingana dhewe - dhewe lembaran kang ginelar",
            "verse 74:53": "Ora bakal (dipituruti panjaluke) balik dheweke padha ora wedi marang akherat",
            "verse 74:54": "Temen iku sawijining pepeling",
            "verse 74:55": "Lah sapa sing gelem, angelangana iku",
            "verse 74:56": "Lan ora bakal padha angelingi, kejaba sing dadi kaparenging Allah. Panjenengane iku panthes diestokake dhawuhe lan pantes aparing pangapura"
        },
        "Kazakh": {
            "verse 74:1": "Ей, бүркеніп алушы",
            "verse 74:2": "Орныңнан түр, ескерт",
            "verse 74:3": "Әрі Раббыңды ұлықта",
            "verse 74:4": "Әрі киіміңді тазала",
            "verse 74:5": "және лас нәрселерден аулақ бол",
            "verse 74:6": "Әрі жақсылықты көп болып қайтуы үшін жасама",
            "verse 74:7": "Әрі Раббың үшін сабыр ет",
            "verse 74:8": "Ал, қашан сүр үрілсе",
            "verse 74:9": "міне, сол күн ауыр күн",
            "verse 74:10": "кәпірлер үшін оңай болмайтын",
            "verse 74:11": "Ей, Мұхаммед! Жалғыз етіп жаратқанымды Өзіме қалдыр",
            "verse 74:12": "Мен оған мол мал-дәулет бердім",
            "verse 74:13": "және жанында тұратын перзенттерді",
            "verse 74:14": "әрі оған дүниені жайып қойдым",
            "verse 74:15": "Содан кейін де ол Менің арттыра түсуімді қалайды",
            "verse 74:16": "Жоқ, олай болмайды! Ақиқатында, ол аяттарымызға қарсы қасарысушы еді",
            "verse 74:17": "Таяуда оны «өрге» мәжбүрлеймін",
            "verse 74:18": "Анығында, ол ойлап, есептеді",
            "verse 74:19": "Жойылып кеткір, ол қалай есептеді",
            "verse 74:20": "Содан кейін тағы жойылғыр, ол қалай есептеді",
            "verse 74:21": "Сосын ол ойланып қарады",
            "verse 74:22": "Содан кейін қабағын шытып, бетін тыржитты",
            "verse 74:23": "Одан соң теріс айналып, өзін жоғары санап, менменсіп",
            "verse 74:24": "«Бұл айтылып келе жатқан сиқырдан басқа ештеңе емес",
            "verse 74:25": "Бұл бар болғаны адамның сөзі», деді",
            "verse 74:26": "Жақында оны Сақарға кіргіземін",
            "verse 74:27": "Сақардың не екенін саған не білдірді",
            "verse 74:28": "Ол қалдырмайды да, тастамайды",
            "verse 74:29": "теріні жандырып жіберуші",
            "verse 74:30": "Оның үстінде он тоғыз бар",
            "verse 74:31": "Біз тозақ сақшыларын періштелерден ғана қылдық. Әрі олардың санын сондай күпірлік етушілер имансыздар үшін бір сынақ еттік. Бұл Кітап берілгендердің көздері жетуі, имандылардың иманы артуы үшін және Кітап берілгендер мен имандылардың күмәнданбауы үшін. Сондай-ақ жүректерінде дерті барлар мен кәпірлер: «Аллаһ бұл мысалмен нені қалады?!» деп айтуы үшін. Осылай, Аллаһ кімді қаласа адастырып, кімді қаласа тура жолға салады. Раббыңның әскерін Одан басқа ешкім білмейді. бұл адамзат үшін бір Еске салудан басқа еш нәрсе емес",
            "verse 74:32": "Иә, солай! Аймен ант етемін",
            "verse 74:33": "Әрі кейін қайтқан түнмен",
            "verse 74:34": "және ағарып жатқан таңмен",
            "verse 74:35": "Ақиқатында, ол тозақ өте үлкендердің құбылыстардың бірі",
            "verse 74:36": "адамзатты ескертуші ретінде",
            "verse 74:37": "сендерден алға жүруді немесе артқа шегінуді қалағандар үшін",
            "verse 74:38": "Әрбір жан істеп тапқанының амалының тұтқыны",
            "verse 74:39": "Бірақ оң жақтағылар олай емес",
            "verse 74:40": "Олар жәннаттарда бір-бірінен сұрасады",
            "verse 74:41": "қылмыскерлер туралы",
            "verse 74:42": "Тозаққа түскендерге : «Сендерді Сақарға тозаққа не кіргізді?» дейді",
            "verse 74:43": "Олар: «Біз намаз оқушылардан болмадық",
            "verse 74:44": "әрі кедейді тамақтандырмайтын едік",
            "verse 74:45": "және бос, өтірік сөздерге батушылармен бірге батушы едік",
            "verse 74:46": "және Есеп қиямет күнін өтірік санауда болдық",
            "verse 74:47": "бізге айқын нәрсе өлім келгенге дейін», дейді",
            "verse 74:48": "Сонда оларға араға түсушілердің шапағат етушілердің араға түсуі пайда бермейді",
            "verse 74:49": "Оларға не болды, Еске салатыннан Құраннан бет бұратындай",
            "verse 74:50": "бейне бір үріккен жабайы есектер тәрізді",
            "verse 74:51": "Арыстаннан қашқан",
            "verse 74:52": "Негізінде, олардың әрбірі өзіне ашық жазбалардың берілуін қалайды",
            "verse 74:53": "Жоқ, керісінше, олар соңғы, мәңгілік өмірден ақиреттен қорықпайды",
            "verse 74:54": "Жоқ, олай емес! Анығында, бұл бір еске салу, ескерту",
            "verse 74:55": "кім қаласа, оны есіне алады",
            "verse 74:56": "Алайда олар Аллаһ қаламаса, есіне алмайды. Ол жазасынан қорқуға лайықты әрі кешірім Иесі"
        },
        "Korean": {
            "verse 74:1": "외투를 덮은 자여망투를 걸친 자여",
            "verse 74:2": "일어나서 경고하라일어나서 경고하라",
            "verse 74:3": "그대 주님의 위대함을 찬양하고그리고 그대 주님만을 찬양하고",
            "verse 74:4": "그대의 옷은 정화하며그대의 망투를 청결케 할 것 이며",
            "verse 74:5": "우상은 멀리하라부정한 것을 피하고",
            "verse 74:6": "그리고 더 많이 받으려 은혜를 베풀지 말며필요 이상의 것을 주지 말며",
            "verse 74:7": "그대 주님을 위해 인내하라주님을 위해 인내하라",
            "verse 74:8": "그리하여 나팔이 불릴 때나팔이 부는 그때",
            "verse 74:9": "실로 그날은 어려운 날이라그날은 곧 재앙의 날이 될 것이라",
            "verse 74:10": "불신자들에게 쉽지 않은 날이라그것은 불신자들을 위한 것 으로 평탄한 것이 아니라",
            "verse 74:11": "그대는 나와 내가 홀몸으로 창조한 자를 놓아두라내가 홀로 창조한 그를 내게맡기라",
            "verse 74:12": "나는 그를 위해 즐비한 재산을 두었고실로 나는 그에게 풍성함을 베풀어 주었고",
            "verse 74:13": "함께 하는 자손들을 두었노라자손들이 그와 함께 거주하 게 하였으니",
            "verse 74:14": "그리고 나는 그를 위해 많은 것을 펼쳐 주었노라내가 그에게 안락한 생활을 베풀었노라",
            "verse 74:15": "그 후에도 그는 내가 더해 주기를 희망하더라그런데도 그는 내가 더하여 주기를 바라고 있느뇨",
            "verse 74:16": "그렇지 않노라. 실로 그는 나의 징표에 대해 고집부리는 자였노라결코 그렇게 될 수 없나니 하나님의 예증들을 거역하였노라",
            "verse 74:17": "나는 그에게 고된 벌이 덮치게 할 것이라곧 내가 그에게 산더미 같은재앙들을 가져다 주리라",
            "verse 74:18": "실로 그는 생각하고 재더라그는 숙고하고서도 음모하 였으니",
            "verse 74:19": "그러니 그가 재는 방법에 저주가 있노라음모한 그에게 재앙이 있으 리라",
            "verse 74:20": "다시 한번, 그가 재는 방법에 저주가 있노라그러하니라 음모하는 자에게재앙이 있을 것이라",
            "verse 74:21": "그 후 그는 보았고그런 후 그는 생각하고",
            "verse 74:22": "그 후 그는 얼굴을 찌푸리고 찡그렸노라눈살을 찌푸리고 불쾌한 표 정을 하더라",
            "verse 74:23": "그 후 그는 꽁무니를 빼며 거만해 하였노라외면하며 오만해 하더라",
            "verse 74:24": "그리하여 그가 말하길 : \"이것은 오직 전해져 내려오는 주술일 뿐이라이것은 옛 선조들로부터 유 래된 마술에 불과하다고 말하고",
            "verse 74:25": "이것은 오직 인간의 말일 뿐이라이것은 한 인간의 말에 불과하다고 하였더라",
            "verse 74:26": "나는 그를 뜨거운 불지옥으로 태울 것이라그러므로 내가 곧 그를 볼지옥으로 이르게 하리라",
            "verse 74:27": "무엇이 그대에게 뜨거운 불지옥이 무엇인지를 알려 줄 것인가그 불지옥이 무엇인지 무엇 이 그대에게 설명하여 주리요",
            "verse 74:28": "그것은 남겨두지도 않으며 내버려두지도 않으며그것은 아무것도 남기지 아 니하면 어느 누구도 남겨두지 아 니한 곳으로",
            "verse 74:29": "피부를 구워버리노라인간을 그슬러 버리며",
            "verse 74:30": "열아홉이 그것을 책임지노라그 위에는 열 아홉이 있노라",
            "verse 74:31": "나는 불지옥의 관리자들을 오직 천사들로만 두었으며, 나는 그들의 숫자를 오직 불신하는 자들에 대한 시험으로 두었노라. 그리하여 성서를 받은 자들이 확신을 얻고, 믿는 자들이 믿음이 증가되며, 성서를 받은 자들과 신앙인들이 의심하지 않기 위함이라. 그러나 마음 속에 병이 있는 자들과 불신자들은 이 비유로써 하나님이 원하는 것은 무엇인가? 라고 말하더라. 그렇게 하나님께서는 그분께서 원하시는 자를 방황시키시고 그분께서 원하시는 자를 인도하시노라. 오직 그분만이 그대 주님의 군대를 알고 계시노라. 그것(불지옥)은 다름 아닌 인간을 위한 떠올림이라하나님은 천사들을 불지옥의수호자들로 두었노라 그 숫자를 둔 것은 믿지 아니한 불신자들을 위한 시련으로써 그리고 성서의 백성들을 확신시키고 믿는 사람들의 신앙을 더하며 성서의 백성들 과 믿는 신도들이 의심하지 아니 하고 마음이 병든 자들과 불신자 들이 하나님은 이 비유로 무엇을 의도하려 하느뇨 라고 말하는 그 들을 시험하기 위해서라 이렇듯 하나님은 그분이 원하는 자를 방 황케 하사 그분이 원하는 자를 인도하시니 그분 외에는 어느 누구 도 주님의 수호자들을 알 수 없 노라 이것은 인간을 위한 교훈에 불과하니라",
            "verse 74:32": "그렇지 않노라. 달을 두고 맹세코달을 두고 맹세하사",
            "verse 74:33": "자취를 감출 때의 밤을 두고 맹세코사라져 가는 밤을 두고 맹세하며",
            "verse 74:34": "밝아올 때의 아침을 두고 맹세코빛나는 아침을 두고 맹세하 나니",
            "verse 74:35": "진실로 그것(불지옥)은 어마한 것 중의 하나이며실로 그것은 가장 중대한 재앙 중의 하나라",
            "verse 74:36": "인간을 위한 경고이니그것은 인간을 위한 하나의 경고로",
            "verse 74:37": "그대들 중에서 앞으로 나아가거나 혹은 뒤로 물러서고자 하는 자를 위한 것이라너희 중에 앞서려는 자와 유예하려는 자들을 위한 것이라",
            "verse 74:38": "모든 영혼은 그가 얻은 것으로 전당 잡혀 있노라모든 인간은 그가 행한 행위 에 의해 저당이 되나",
            "verse 74:39": "그러나 우편의 거주자들은 예외라우편의 동료들은 제외로",
            "verse 74:40": "천국에서 그들은 서로 물으니이들은 천국으로 들어가 서 로가 서로에게 질문을 하며",
            "verse 74:41": "악행을 저지른 자들에 관해서라죄인들에 관하여 묻고",
            "verse 74:42": "무엇이 그대들을 뜨거운 불지옥에 들게 하였는가무엇이 너희로 하여금 불지 옥에 들게 하였느뇨 라고 물으니",
            "verse 74:43": "그들이 말하길 : \"우리는 예배 드리는 자들이 아니었고그들은 대답하길 저희는 예 배하는 자 중에 있지 아니하였으 며",
            "verse 74:44": "불우한 자들에게 음식을 주지도 않았소가난한 사람들에게 자선을 베풀지 아니하고",
            "verse 74:45": "우리는 노닥이는 자들과 함께 노닥였고무익한 잡담을 하는 자들과 공론을 하곤 했으며",
            "verse 74:46": "심판의 날을 부정하였으니”심판의 날을 믿지 않고",
            "verse 74:47": "우리에게 죽음이 찾아올 때까지 그러하였소심판의 날이 온다는 것을 부 인하였습니까",
            "verse 74:48": "그러니 중재자들의 중재도 그들에게는 소용이 없노라그리하여 어떤 중재자들의 중재도 그들에게 유용하지 못하리라",
            "verse 74:49": "그럼에도 그들은 떠올림에 등을 돌리는 자들이니 이 어찌 된 일인가교훈을 거역한 그들이 어떻 게 되었느뇨",
            "verse 74:50": "그들은 마치 달음질치는 당나귀들과 같으니그들은 마치 놀란 당나귀들 이",
            "verse 74:51": "사자로부터 도망치는 당나귀들이라한마리의 사자에 놀라 도망 치는 것과 같더라",
            "verse 74:52": "실로 그들 중의 모든 이는 펼쳐진 책자를 받길 원하더라실로 이들 각자는 펼쳐진 성서가 그들에게도 내려지기를 원하고 있느뇨",
            "verse 74:53": "결코 그렇지 않노라! 그들은 내세를 두려워하지 않노라그것은 불가능한 것으로 그 들은 내세를 두려워 하지 않노라",
            "verse 74:54": "그렇지 않노라. 실로 그것(꾸란)은 떠올림이라실로 이것이 교훈이니",
            "verse 74:55": "그렇기에, 원하는 자는 그것(꾸란)을 떠올리노라그것을 지키려 하는 자 그것을 기억케 하리라",
            "verse 74:56": "그들은 오직 하나님께서 원하실 때만 떠올릴 것이라. 그분께서는 경외심을 받으실 분이며 용서의 권리를 가지시는 분이라그러나 하나님이 원하는 자 외에는 어느 누구도 그것을 기억 하려 하지 아니 하리라 그분은 두려워 해야 할 주님이요 관용의 주님이시라"
        },
        "Kurdish": {
            "verse 74:1": "Yê xwe di kinca da pêcayîئه‌ی ئه‌و که‌سه‌ی خۆت پێچاوه‌ته‌وه‌، ئه‌ی محمد صلی الله علیه وسلم",
            "verse 74:2": "Tu rabe, îdî tu (merivan) hişyar bikeهه‌سته‌و خه‌ڵکی بێداربکه‌ره‌وه (ڕاستیه‌کان ڕوون بکه‌ره‌وه‌).",
            "verse 74:3": "Û tu Xuda yê xwe (ji hevrîtî ya pûtan) bi mezinahî paqij bikeپه‌روه‌ردگارت به گه‌وره ناوببه (الله اکبر، با دروشمت بێت، مه‌زنی ئه‌و زاته ڕوون بکه‌ره‌وه‌).",
            "verse 74:4": "Û tu îdî cilê xwe paqij bikeپۆشاکت (دڵ و ده‌روونت، ڕه‌فتارت، هه‌ر هه‌مووی) خاوێن بکه (خۆت و شوێنکه‌وتووانت).",
            "verse 74:5": "Û tu îdî dest ji pîsî ya berdeبه‌رده‌وام به له‌سه‌ر واز هێنان له گوناه.",
            "verse 74:6": "Û tu tilfa bi kirina xwe neke, ji bo ku tu (hember ya wan) pir hildîمنه‌تیش مه‌که (به‌سه‌ر که‌سدا) چاکه‌و به‌خشینه‌کانت به‌زۆر مه‌زانه له کاتێکدا به‌ته‌مای زیاتر بیت.",
            "verse 74:7": "Îdî tu ji bona (qayîlbûna) Xuda yê xwe ra hew bikeهه‌وڵ بده له‌به‌ر خاترو ڕێزی په‌روه‌ردگارت خۆگرو ئارامگربه‌.",
            "verse 74:8": "Îdî gava (ji bona hewarê) di stûrî da hatibe qîkirinêجا کاتێك فوو ده‌کرێت به (صور) داو ده‌زگای تایبه‌تی لێ ده‌درێت.",
            "verse 74:9": "Îdî ewa roya royeke pir tengeئه‌و ڕۆژه ڕۆژێکی زۆر گران و سه‌خته (که به‌سه‌ر دانیشتوانی زه‌ویدا دێت).",
            "verse 74:10": "Li ser filan qe hêsaî nîneله‌سه‌ر کافران هیچ ئاسان نی یه (به‌ڵکو زۆر سه‌غڵه‌تیان ده‌کات).",
            "verse 74:11": "Tu min û ewî (fileyê) ku min ewa rût afirandîye bi tenê bihêleواز له من و ئه‌و که‌سه بهێنه که به‌ته‌نهایی (تاقانه‌) دروستم کردووه (هیچی نه‌بوو، که وه‌لیدی کوڕی موغه‌یره‌یه‌).",
            "verse 74:12": "Min ji bona wî ra malê peyweste dayeله‌وه‌ودوا ماڵ و سامانی زۆرو زه‌به‌نده‌م پێبه‌خشی.",
            "verse 74:13": "Û zarên xûyaî jî dayeچه‌نده‌ها کوڕو نه‌وه‌ش که هه‌میشه ئاماده‌ن له نزیکیدا.",
            "verse 74:14": "Û min ji bona wî ra qencî raxistibûله هه‌موو که‌ل و په‌ل و نازو نیعمه‌تێك به‌هره‌وه‌رم کرد.",
            "verse 74:15": "Paşê ewî jî dixwast, ku ez ji wî ra hêj pir bikimله پاش ئه‌وه‌ش به‌ته‌مایه بۆی زیاتر بکه‌م.",
            "verse 74:16": "Na! (ez ji bona wî ra pir nakim) loma bi rastî ewa ji bona beratene me ra înçkar bûyeنه‌خێر، به‌ڕاستی ئه‌و به‌رامبه‌ر فه‌رمانه‌کانی ئێمه هه‌ر سه‌رکه‌ش و که‌لله ڕه‌ق و سه‌رسه‌خته‌.",
            "verse 74:17": "Di nêzîk da bi rastî ezê ji bona bilindî ya wî ra (şapatan) raximئه‌وسا سزای سه‌ختی پێ ئه‌چێژم.",
            "verse 74:18": "Bi rastî ewî raman kirîye û pîva yeبه‌ڕاستی ئه‌و بیری کرده‌وه‌و په‌یامه‌که‌ی هه‌ڵسه‌نگاند (به‌ڵام به‌هه‌ڵه‌).",
            "verse 74:19": "Îdî ewa bimire (hatîye kuştinê) ka ewî ça pîva yeبه‌کوشت چێ و سه‌ره‌و نگوون بێت، چۆن هه‌ڵسه‌نگاندنێکی کرد.",
            "verse 74:20": "Paşê dîsa ewa bimire, ka ewî biçi awayî pîva yeپاشان هه‌ر به‌کوشت بچێت بۆ خۆی و هه‌ڵسه‌نگاندنێك که کردی بۆ قورئان.",
            "verse 74:21": "Paşê li wan (pîvanê xwe) mêze kirîyeئینجا بیری لێ کرده‌وه‌و ورد بۆوه‌و ته‌ماشای ده‌وروبه‌ری کرد.",
            "verse 74:22": "Pasê murûzê xwe kirîye û rûye xwe tirş kirîyeئینجا ناوچاوی هێنایه‌وه یه‌ك (وه‌ك یه‌کێك به‌قووڵی بیربکاته‌وه‌) ڕه‌ش داگیرسا.",
            "verse 74:23": "Paşê pişta xwe daye xwe qure kirîyeپاشان ڕووی وه‌رگێڕاو خۆی به‌زلزانی.",
            "verse 74:24": "Îdî (aha) gotiye: \"Bi rastî eva (Qur´an a) ançeke; ji şopa wan ançne borîneبه‌هه‌موو عه‌قڵیه‌وه وتی!! ئه‌م قورئانه جگه جادوو نه‌بێت که وه‌رده‌گیرێت هیچی تر نی یه‌!!...",
            "verse 74:25": "Bi rastî eva (Qur´an a) hey gotinêmerivan inئه‌مه هه‌ر قسه‌ی به‌شه‌ره و هیچی تر نی یه‌؟!",
            "verse 74:26": "Di nêzîk da ezê jî ewî bavêjime (doja) sar(ئه‌و بێ ویژدانه به‌سه‌ریه‌وه ناچێت) ده‌بێت بیگه‌یه‌نمه ناو دۆزه‌خ.",
            "verse 74:27": "Tu ji kû dizanî gelo ka (doja) sar çîyeجا تۆ نازانیت دۆزه‌خ چیه‌...",
            "verse 74:28": "(Ewa doja) di para da tu tiştî nahêle û tu kesî bernadeهیچ ئه‌ندامێك ناهێڵێته‌وه‌و ده‌ست هه‌ڵناگرێت...",
            "verse 74:29": "Ewa (doja) çerman hişk dikeپێستیان هه‌ڵده‌قرچێنێت و ڕه‌شی ده‌کات و ده‌ری ده‌خات.",
            "verse 74:30": "Li ser (wê dojê) nuzdeh (ferişteyên fermande) heneنۆزده فریشته سه‌رپه‌رشتی دۆزه‌خ ده‌که‌ن.",
            "verse 74:31": "Ji bona ku ewanê pirtûk ji wan ra hatîye bizanin bi rastî ewa pirtûka ji wan ra hatîye maf e û bawer ya wanê, ku bawer kirine jî pir bibe û ji bo ku ewanê ji wan ra pirtûk hatîye û ewanê bawer kirine dudil nebin û ji bona ku ewanê di dilê wan da nexwaşî heye û ewanê bûne file (aha) bêjin, ka Yezdan bi van hecwekîyan çi va ye? Me hevrîne dojê hey ji feriştan çê kirîye, me hêjmara wan (feriştan) ji bona wanê, ku bûne fıne raxistîye ceribandin. Bi vî awayî Yezdan ji kîjanî ra bivê, rê ya xwe li ber wî wunda dike û ji kîjanî ra jî bivê,ewî tîne rê ya rast. Ji pêştirê Xuda yê te tu kes bi hêjmara leşkerê wî nizan e.Ewa (doja sar) ji bona kesan ra hey şîretek eجا ئێمه وه‌نه‌بێت کار گوزارانی دۆزه‌خمان له که‌سانی تر جگه له فریشته به‌دی هێنابێت، ئه‌و ژماره‌یه‌شمان ته‌نها بۆ تاقیکردنه‌وه دیاری کردووه بۆ ئه‌وانه‌ی که بێ باوه‌ڕ بوون، هه‌روه‌ها بۆ ئه‌وه‌ی ئه‌وانه‌ی کتێبیان پێدراوه دڵنیابن له ڕاستی ئه‌م قورئانه (چونکه له ته‌ورات و ئینجیلدا ئه‌و باسه هه‌یه‌) و بۆ ئه‌وه‌ش که ئیمانداران زیاتر باوه‌ڕیان دامه‌زراو بێت و ئه‌وانه‌ش که کتێبیان پێدراوه ئیماندارانیش حه‌ق نیه تووشی دوو دڵی ببن، با ئه‌وانه‌ی دڵ و ده‌روونیان نه‌خۆشه له دووڕووه‌کان و بێ باوه‌ڕان هه‌ر بۆ خۆیان قسه بکه‌ن و بڵێن: نیازی خوا چی یه به‌م ژماره‌یه‌؟ به‌و شێوه‌یه باسکرا خوا هه‌ر که‌سێکی بوێت گومڕای ده‌کات، هه‌ر که‌سێکیشی بوێت ڕێنموویی ده‌کات، که‌س ژماره‌ی سه‌ربازانی په‌روه‌ردگارت نازانێت جگه له زاتی خۆی، ئه‌و ئایه‌ت و فه‌رموودانه ته‌نها په‌ندو ئامۆژگارین بۆ ئاده‌می.",
            "verse 74:32": "Nal (bi gotina wan filan nîne) bi hîvêنه‌خێر، سوێند به مانگ (ئه‌و خه‌ڵکه چاك هه‌ستی پێ ناکه‌ن).",
            "verse 74:33": "Û bi danê şevê gava dizvire diçeبه شه‌ویش کاتێك که تێ په‌ڕی (زۆربه‌یان باوه‌ڕیان به قیامه‌ت نیه‌).",
            "verse 74:34": "Û bi danê sibehê jî gava zer dibeبه به‌ره‌به‌یان کاتێك که خۆی ده‌نوێنێت.. (زۆربه‌ی خه‌ڵکی غافڵه‌)",
            "verse 74:35": "Sond dixum, ku ewa (doja sar) yek ji wan (şapatên) mezin inبه‌ڕاستی_سه‌قه‌ر_ یه‌کێکه له شته سامناك و گه‌وره‌کان.",
            "verse 74:36": "(Ewa doja) ji bona merivan ra hişyar bûnek eبۆ ترساندنی سه‌رجه‌م خه‌ڵکانه‌.",
            "verse 74:37": "(Her wusan jî) ji we kîjanê bivê, ku di qencîyan da pêş û paş da bikeve, ji bona (wî ra jî hişyar bûnek e)جا ئیتر ئه‌وه‌ی ده‌یه‌وێت با به‌ره‌و پێش بچێت (پێشبڕکێ بکات له چاکه‌کاریدا) یان خۆی دوا بخات (له‌و بواره‌دا).",
            "verse 74:38": "Her kesek gerewa kirina xwe yeچونکه له قیامه‌تدا هه‌موو که‌س بارمته‌ی ده‌ستپێشکه‌ری خۆیه‌تی (کرده‌وه‌کانی دێنه‌وه ڕێی).",
            "verse 74:39": "Ji pêştirê (wanê pirtûka wan) li rastê wan da hatîye dayînêجگه له ده‌سته‌ی ڕاستان و ئیماندارانی کرده‌وه چاك.",
            "verse 74:40": "Ewanan di behiştandan inله‌ناو به‌هه‌شته‌کاندان و پرسیار ده‌که‌ن له یه‌کتر...",
            "verse 74:41": "Ji gunehkaran dipirsinله باره‌ی تاوانبارانه‌وه‌...",
            "verse 74:42": "Gelo çi tişti hûn xistine vê (doja) sare qeremokئه‌وه چی بوو ئێوه‌ی ڕاپێچی دۆزه‌خ کرد؟!",
            "verse 74:43": "Ewan (aha pisyara wan dane û) gotine: \"Bi rastî em ji wanê nimêjker ne bûnبه که‌ساسیه‌وه ده‌ڵێن: ئێمه له نوێژگه‌ران نه‌بووین...",
            "verse 74:44": "Me ji bona belengazan ra jî xurek ne didaخۆراکمان به هه‌ژاران نه‌ده‌به‌خشی...",
            "verse 74:45": "Û em bi leyîztik hazan ra noqê leyîztikê dibûnئێمه له‌گه‌ڵ ده‌م درێژو بێ ئابڕووه‌کاندا قسه‌ی خۆمان ده‌کردو له بابه‌تی ئه‌وانمان ده‌گوت و ڕه‌خنه‌ی بێ جێمان ده‌گرت له گه‌ڵیان ڕۆده‌چووین.",
            "verse 74:46": "Û me bi roya xelat û celatan vir dikir (bi wê bawer ne dikir)ئێمه بڕوامان به ڕۆژی پاداشت نه‌بوو.",
            "verse 74:47": "(Em di van kirinan da bûn) heya mirina me hatهه‌تا مردن یه‌خه‌ی پێگرتن و ڕۆژگاری ته‌مه‌نمان کۆتایی هات.",
            "verse 74:48": "Îdî mehder ya tu mehdervanî kêrê wan ne hatکه‌واته ئیتر تکای تکاکاران سوودیان پێ ناگه‌یه‌نێت.",
            "verse 74:49": "Bi vî ra jî gelo ji bona wan ra çi bûye ku ewan (ji Qur´an ê) rû difetilîninباشه‌، ئه‌وه بۆچی له یادخستنه‌وه پشت هه‌ڵده‌که‌ن و ڕوو وه‌رده‌گێڕن.",
            "verse 74:50": "Tu dibê qey ewan kerên kovîn eده‌ڵێی گه‌له گوێدرێژی کێوین و ده‌سڵه‌مێنه‌وه‌...",
            "verse 74:51": "Ji şêran silikîn eله ترسی شێر هه‌ڵهاتوون...",
            "verse 74:52": "Na! (ewan ji wan şîretan hiş hilnadin) lê divên, ku ji bona wan heryekê ra rûpelên vekirî li ser navê wan ji Xuda yê wan bihata, paşê bawer bikirinanبه‌ڵکو هه‌ریه‌ك له‌وان ده‌یه‌وێت له ئاسمانه‌وه چه‌نده‌ها نامه‌ی کراوه‌ی بۆ بێت؟",
            "verse 74:53": "Na! (ji bona wan ra ewan rûpelan nayên) lê ewan ji (şapata) para da natirsin (loma bawer nakin)نه‌خێر ئه‌وانه به‌هیچ شتێك داناچڵه‌کێن به‌ڵکو له دواڕۆژ ناترسن.",
            "verse 74:54": "Na! (bila ewan ji wan kirinê xwe para werin) loma bi rastî ewa (Qur´an a) hişyar bûneke (sedritî ye)نه‌خێر ئه‌وانه به‌سه‌ریانه‌وه ناچێت، چونکه ئه‌و قورئانه ئامۆژگاریه‌.",
            "verse 74:55": "Îdî kîjan bivê, ji bona xwe ra ji wê (Qur´an ê) şîretan hildideجا ئه‌وه‌ی ده‌یه‌وێت با یادی بگرێت و شوێنی بکه‌وێت (چه‌ندی توانی له‌به‌ری بکات).",
            "verse 74:56": "Ji pêştirê wanêYezdan va ye, ku ji (Our´an ê) şîretan hildin, qe tu kes şîretan hilnade. Bi rastî (Yezdan) babete ji bo parizî û baxişandinê raجا ئه‌و خه‌ڵکه یاداوه‌ری وه‌رناگرێت و بیر له‌م ڕاستیانه ناکاته‌وه مه‌گه‌ر ویستی خوای له‌سه‌ر بێت (که له‌گه‌ڵ ویستی ئینسانه به‌خته‌وه‌ره‌کاندا یه‌ك ده‌که‌وێت) جا هه‌ر ئه‌و زاته‌ش شایسته‌ی ئه‌وه‌یه که خه‌ڵکی حسابی بۆ بکه‌ن و له خه‌شمی بترسن و هه‌ر ئه‌ویش له خۆی گرتووه که لێخۆشبوو بێت (له ئیماندارانی گوناهبار، کاتێك ته‌وبه ده‌که‌ن)."
        },
        "Kyrgyz": {
            "verse 74:1": "ӨО,чүмкөнүп (жатып) алган адам",
            "verse 74:2": "Туруп (элдерге Акыретти) эскерт",
            "verse 74:3": "Жана Раббиңдин улуулугун даңазала",
            "verse 74:4": "Жана кийимиңди тазала",
            "verse 74:5": "Жана ыпластыктан ыраак бол!“",
            "verse 74:6": "Аз нерсе берип ордуна көп нерсе сураба",
            "verse 74:7": "(Көргөн жамандыктарга) Раббиң үчүн сабыр кыл",
            "verse 74:8": "Эми, качан (Исрафил периште тарабынан «Сур» деген) керней тартылганда (жана Кыямат башталганда)",
            "verse 74:9": "Мына ушул күн-оөтө оор күн",
            "verse 74:10": "Каапырларга жеңил болбогон (күн)",
            "verse 74:11": "(О, Мухаммад) Мен жалгыз жараткан (каапыр) пендени Мага кой",
            "verse 74:12": "Мен ага эсепсиз дүйнө-мүлк бердим",
            "verse 74:13": "Жана (ар дайым кызматына) даяр турган уул перзенттерди бердим",
            "verse 74:14": "Жана ага өтө кененчилик бердим",
            "verse 74:15": "Андан соң ал (каниетсиз, наадан адам) Биз ага (Акыреттик бейишти да) кошумча кылуубузду үмүт кылат",
            "verse 74:16": "Жок! (андай болбойт! Себеби) ал Биздин аяттарыбызды (билип, түшүнүп туруп) четке какты",
            "verse 74:17": "Мен аны жакында (тозоктогу) аска таштын үстүнө чыгарамын",
            "verse 74:18": "Себеби, ал (Кураан жөнүндө) пикир кылды жана (аны өзүнүн кыска ченем-өлчөмү менен) өлчөдү",
            "verse 74:19": "Өлүмгө жолуккур! Кандай (жаман) өлчөдү",
            "verse 74:20": "Дагы (бир ирет) өлүмгө жолуккур! Эмне деген (жаман өлчөм менен) өлчөдү",
            "verse 74:21": "Анан (чыгарган тыянагын) байкап көрдү",
            "verse 74:22": "Кийин (жактырбай) кабак чытып, маңдайын тырыштырды",
            "verse 74:23": "Андан соң (акыйкаттан артка кетенчиктеп) текеберленди",
            "verse 74:24": "Анан айтты: «Бул байыркыдан калган сыйкыр",
            "verse 74:25": "Бул- адамдын гана сөзү»",
            "verse 74:26": "Мен аны жакында “Сакар” тозогуна киргиземин",
            "verse 74:27": "(О, Мухаммад) сен “Сакар” тозогунун кандай экенин билбейсиң",
            "verse 74:28": "Ал (өзүнө ташталган эч бир кылмышкерди) калтырбайт жана жөн койбойт",
            "verse 74:29": "(Терини карартып,) өзгөртүп койот",
            "verse 74:30": "Анын үстүндө он тогуз (орой периштелер) бар",
            "verse 74:31": "Биз тозоктун кожоюндарын периштелерден гана кылдык жана алардын санын, каапыр болгон адамдарды сыноо үчүн, китеп элдери (яхудийлер менен христиандар) анык билип алуулары үчүн, жана ыймандуулардын ыйманы дагы (бир нече даражага) көбөйүшү үчүн (он тогуз даана) кылдык. Жана китеп (Тоорат, Инжил) берилген элдер менен момундар (периштелердин саны боюнча) шектенип калбашы үчүн, ал эми, жүрөгүндө кара ниети болгон адамдар (мунаафыктар) менен каапырлар: «Аллаһ бул мисал менен эмнени каалады экен» деп (шектенип) сүйлөшү үчүн (Аллаһ тозок периштелеринин санын он тогуз даана кылды). Аллаһ мына ушинтип, Өзү каалаган пендесин адаштырат жана каалаганын Туура Жолго салат. (О, Мухаммад, периштелерден турган) Раббиңдин аскерлерин(ин санын) бир Өзү гана билет. Жана бул (насааттар) адамдар үчүн эскертүүдөн башка (нерсе) эмес",
            "verse 74:32": "Жок, Мен айга ант (ичип)",
            "verse 74:33": "кайтып кеткен түнгө ант (ичип)",
            "verse 74:34": "(агарып) келе жаткан таңга ант (ичип)",
            "verse 74:35": "(Айтамын): Чынында ал (“Сакар” тозогу) чоң балээлердин бири",
            "verse 74:36": "(“Сакар” тозогу) адамдарга эскертүү",
            "verse 74:37": "Силердин араңардагы, (Аллаһтын ыраазычылыгына) умтулууну же болбосо кетенчиктеп кетүүнү каалагандар үчүн",
            "verse 74:38": "Ар бир жан (ээси) өзү жасаган (күнөө) иштердин туткуну",
            "verse 74:39": "Оң тарап ээлери гана андай (туткун) эмес",
            "verse 74:40": "Алар Бейиштерде туруп сурашат",
            "verse 74:41": "(тозоктогу) кылмышкерлерден",
            "verse 74:42": "«Силерди «Сакар» тозогуна эмне түшүрдү?»",
            "verse 74:43": "Алар айтышат: «Биз намаз окуучулардан болбодук",
            "verse 74:44": "Жана бей-бечараларды тамактандырбадык",
            "verse 74:45": "(Күнөө деңизине) чөмүлгөндөр менен бирге чөмүлдүк",
            "verse 74:46": "Жана Акырет күндү жалган дедик",
            "verse 74:47": "Башыбызга өлүм келгенге чейин»",
            "verse 74:48": "Эми аларга (тозокуларга) эч бир шапаатчынын шапааты пайда бербейт",
            "verse 74:49": "Аларга (каапырларга) эмне болду, насааттан (Кураандан) жүз буруп качышат",
            "verse 74:50": "Жапайы эшектерге окшоп",
            "verse 74:51": "арстандан үркүп качкан",
            "verse 74:52": "Жок, алардын ар бири (жеке өзүнө гана, атайын арналган) ачык китептер берилишин каалашат!”",
            "verse 74:53": "Жок, андай эмес! (чынында) алар Акыреттен коркушпайт",
            "verse 74:54": "Жок, андай эмес! Чынында, бул (Кураан эң чоң) эскерме-насаат",
            "verse 74:55": "Ким кааласа андан сабак алат",
            "verse 74:56": "Бирок, (андан) Аллаһ каалаган пенделер гана насаат ала билишет. (Анткени), Ал (Аллаһ Таала) гана коркууга жана кечирим суроого татыктуу"
        },
        "Malay": {
            "verse 74:1": "Wahai orang yang berselimut!",
            "verse 74:2": "Bangunlah serta berilah peringatan dan amaran (kepada umat manusia).",
            "verse 74:3": "Dan Tuhanmu, maka ucaplah dan ingatlah kebesaranNya!",
            "verse 74:4": "Dan pakaianmu, maka hendaklah engkau bersihkan.",
            "verse 74:5": "Dan segala kejahatan, maka hendaklah engkau jauhi.",
            "verse 74:6": "Dan janganlah engkau memberi (sesuatu, dengan tujuan hendak) mendapat lebih banyak daripadanya.",
            "verse 74:7": "Dan bagi (menjalankan perintah) Tuhanmu, maka hendaklah engkau bersabar (terhadap tentangan musuh)!",
            "verse 74:8": "Kerana apabila telah ditiup sangkakala,",
            "verse 74:9": "Maka saat yang demikian adalah saat (berlakunya) hari yang sukar -",
            "verse 74:10": "Kepada orang-orang kafir, lagi tidak mudah (mengelak azabnya).",
            "verse 74:11": "(Jangan engkau bimbang wahai Muhammad) biarkanlah Aku sahaja membalas orang (yang menentangmu) yang Aku ciptakan dia (dalam keadaan) seorang diri (tidak berharta dan anak pinak),",
            "verse 74:12": "Dan Aku jadikan baginya harta kekayaan yang banyak,",
            "verse 74:13": "Serta anak pinak (yang ramai), yang sentiasa ada di sisinya.",
            "verse 74:14": "Dan Aku mudahkan baginya (mendapat kekayaan dan kekuasaan) dengan semudah-mudahnya.",
            "verse 74:15": "Kemudian ia ingin sangat, supaya Aku tambahi lagi;",
            "verse 74:16": "Tidak sekali-kali (akan ditambahi) ! Kerana sesungguhnya dia menentang dengan degilnya akan ayat-ayat Kami (Al-Quran, yang disampaikan oleh Rasul Kami).",
            "verse 74:17": "Aku akan menyeksanya (dengan azab) yang memuncak beratnya.",
            "verse 74:18": "Kerana sesungguhnya ia telah memikirkan dan mereka-reka berbagai tuduhan terhadap Al-Quran) -",
            "verse 74:19": "Maka binasalah dia hendaknya! Bagaimanakah dia berani mereka-reka (yang demikian)?",
            "verse 74:20": "Sekali lagi: binasalah dia hendaknya! Bagaimana ia berani mereka-reka (tuduhan-tuduhan itu)?",
            "verse 74:21": "Kemudian ia merenung dan memikirkan (berkali-kali: jalan-jalan mencaci Al-Quran, tetapi ia gagal);",
            "verse 74:22": "Setelah itu ia memasamkan mukanya serta ia bertambah masam berkerut;",
            "verse 74:23": "Kemudian ia berpaling (dari kebenaran) dan berlaku sombong angkuh,",
            "verse 74:24": "Serta ia berkata: \" (Al-Quran) ini tidak lain hanyalah sihir yang dituntut serta dipelajari (dari ahli-ahlinya);",
            "verse 74:25": "\"Ini tidak lain hanyalah kata-kata (rekaan) manusia!\"",
            "verse 74:26": "(Disebabkan kekufurannya itu) Aku akan masukkan dia ke dalam neraka Saqar.",
            "verse 74:27": "Dan apa jalannya engkau dapat mengetahui kedahsyatan neraka Saqar itu?",
            "verse 74:28": "Ia membakar mangsanya dengan tidak meninggalkan sisa, dan tidak membiarkannya (binasa terus)",
            "verse 74:29": "Ia terus-menerus membakar kulit manusia!",
            "verse 74:30": "Pengawal dan penjaganya adalah sembilan belas (malaikat).",
            "verse 74:31": "Dan (ketahuilah bahawa hikmat) Kami tidak menjadikan pengawal-pengawal neraka itu melainkan (dari kalangan) malaikat, (kerana merekalah sekuat-kuat dan sebenar-benar makhluk yang menjalankan perintah Kami); dan (hikmat) Kami tidak menerangkan bilangan mereka melainkan dengan satu bilangan yang menyebabkan kesesatan dan kesengsaraan orang-orang kafir itu, supaya orang-orang yang diberi Kitab (Yahudi dan Nasrani) boleh percaya dengan yakin (akan kebenaran Al-Quran), dan supaya orang-orang yang beriman bertambah imannya; dan juga supaya orang-orang yang diberi Kitab dan orang-orang yang beriman itu tidak ragu-ragu (tentang kebenaran keterangan itu); dan (sebaliknya) supaya orang-orang (munafik) yang ada penyakit (ragu-ragu) dalam hatinya dan orang-orang kafir berkata: \"Apakah yang di maksudkan oleh Allah dengan menyebutkan bilangan ganjil ini?\" Demikianlah Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya), dan memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan tiada yang mengetahui tentera Tuhanmu melainkan Dia lah sahaja. Dan (ingatlah, segala yang diterangkan berkenaan dengan) neraka itu tidak lain hanyalah menjadi peringatan bagi manusia.",
            "verse 74:32": "Sebenarnya! Demi bulan,",
            "verse 74:33": "Dan malam apabila ia balik melenyapkan diri,",
            "verse 74:34": "Dan waktu subuh apabila ia terang-benderang,",
            "verse 74:35": "Sesungguhnya neraka Saqar itu adalah salah satu (malapetaka) yang amat besar,",
            "verse 74:36": "Yang menjadi amaran bagi umat manusia,",
            "verse 74:37": "(Iaitu) bagi sesiapa di antara kamu yang mahu maju (dalam mengerjakan kebaikan) atau yang mahu mundur (daripada mengerjakannya).",
            "verse 74:38": "Tiap-tiap diri terikat, tidak terlepas daripada (balasan buruk bagi amal jahat) yang dikerjakannya,",
            "verse 74:39": "Kecuali puak Kanan,",
            "verse 74:40": "(Mereka ditempatkan) di dalam Syurga (yang penuh nikmat), mereka bertanya-tanya,",
            "verse 74:41": "Tentang (tempat tinggal) orang-orang yang bersalah,",
            "verse 74:42": "(Setelah melihat orang-orang yang bersalah itu, mereka berkata): \"Apakah yang menyebabkan kamu masuk ke dalam (neraka) Saqar?\"",
            "verse 74:43": "Orang-orang yang bersalah itu menjawab: \"Kami tidak termasuk dalam kumpulan orang-orang yang mengerjakan sembahyang;",
            "verse 74:44": "\"Dan kami tidak pernah memberi makan orang-orang miskin;",
            "verse 74:45": "\"Dan kami dahulu selalu mengambil bahagian memperkatakan perkara yang salah, bersama-sama orang-orang yang memperkatakannya;",
            "verse 74:46": "\"Dan kami sentiasa mendustakan hari pembalasan,",
            "verse 74:47": "\"Sehinggalah kami didatangi oleh perkara yang tetap diyakini\".",
            "verse 74:48": "Maka tidak akan berguna kepada mereka sebarang syafaat pertolongan (kalaulah ditakdirkan ada) sesiapa yang boleh memberikan syafaat itu.",
            "verse 74:49": "(Kalau demikianlah halnya orang-orang yang bersalah), maka mengapa mereka berpaling lari dari peringatan (Al-Quran) ?",
            "verse 74:50": "Seolah-olah mereka sekawan keldai liar yang lari,",
            "verse 74:51": "Melarikan diri (ketakutan) dari singa!",
            "verse 74:52": "(Mereka tidak merasa cukup dengan peringatan itu) bahkan tiap-tiap seorang di antaranya mahu supaya diberi kepadanya lembaran surat yang terbuka (yang diturunkan dari langit untuk dibaca oleh mereka sendiri).",
            "verse 74:53": "Sebenarnya! (Bukan kerana kemahuan mereka tidak berhasil), bahkan mereka (tidak percaya dan) tidak takut akan hari akhirat.",
            "verse 74:54": "Ketahuilah! Sesungguhnya Al-Quran itu adalah satu peringatan (yang sangat besar pengajarannya);",
            "verse 74:55": "Oleh itu sesiapa yang mahu (beringat) dapatlah ia mengambil peringatan daripadanya.",
            "verse 74:56": "Dan (dalam pada itu) tiadalah mereka dapat beringat melainkan jika dikehendaki Allah; Dia lah Tuhan yang berhak dipatuhi perintahNya, dan Dia lah jua yang berhak memberi keampunan (kepada orang-orang yang beriman dan taat)."
        },
        "Malayalam": {
            "verse 74:1": "ഹേ, പുതച്ചു മൂടിയവനേ,",
            "verse 74:2": "എഴുന്നേറ്റ് (ജനങ്ങളെ) താക്കീത് ചെയ്യുക.",
            "verse 74:3": "നിന്‍റെ രക്ഷിതാവിനെ മഹത്വപ്പെടുത്തുകയും",
            "verse 74:4": "നിന്‍റെ വസ്ത്രങ്ങള്‍ ശുദ്ധിയാക്കുകയും",
            "verse 74:5": "പാപം വെടിയുകയും ചെയ്യുക.",
            "verse 74:6": "കൂടുതല്‍ നേട്ടം കൊതിച്ചു കൊണ്ട് നീ ഔദാര്യം ചെയ്യരുത്‌.",
            "verse 74:7": "നിന്‍റെ രക്ഷിതാവിനു വേണ്ടി നീ ക്ഷമ കൈക്കൊള്ളുക.",
            "verse 74:8": "എന്നാല്‍ കാഹളത്തില്‍ മുഴക്കപ്പെട്ടാല്‍",
            "verse 74:9": "അന്ന് അത് ഒരു പ്രയാസകരമായ ദിവസമായിരിക്കും.",
            "verse 74:10": "സത്യനിഷേധികള്‍ക്ക് എളുപ്പമുള്ളതല്ലാത്ത ഒരു ദിവസം!",
            "verse 74:11": "എന്നെയും ഞാന്‍ ഏകനായിക്കൊണ്ട് സൃഷ്ടിച്ച ഒരുത്തനെയും വിട്ടേക്കുക.",
            "verse 74:12": "അവന്ന് ഞാന്‍ സമൃദ്ധമായ സമ്പത്ത് ഉണ്ടാക്കി കൊടുക്കുകയും ചെയ്തു.",
            "verse 74:13": "സന്നദ്ധരായി നില്‍ക്കുന്ന സന്തതികളെയും",
            "verse 74:14": "അവന്നു ഞാന്‍ നല്ല സൌകര്യങ്ങള്‍ ചെയ്തു കൊടുക്കുകയും ചെയ്തു.",
            "verse 74:15": "പിന്നെയും ഞാന്‍ കൂടുതല്‍ കൊടുക്കണമെന്ന് അവന്‍ മോഹിക്കുന്നു.",
            "verse 74:16": "അല്ല, തീര്‍ച്ചയായും അവന്‍ നമ്മുടെ ദൃഷ്ടാന്തങ്ങളോട് മാത്സര്യം കാണിക്കുന്നവനായിരിക്കുന്നു.",
            "verse 74:17": "പ്രയാസമുള്ള ഒരു കയറ്റം കയറാന്‍ നാം വഴിയെ അവനെ നിര്‍ബന്ധിക്കുന്നതാണ്‌.",
            "verse 74:18": "തീര്‍ച്ചയായും അവനൊന്നു ചിന്തിച്ചു, അവനൊന്നു കണക്കാക്കുകയും ചെയ്തു.",
            "verse 74:19": "അതിനാല്‍ അവന്‍ നശിക്കട്ടെ. എങ്ങനെയാണവന്‍ കണക്കാക്കിയത്‌?",
            "verse 74:20": "വീണ്ടും അവന്‍ നശിക്കട്ടെ, എങ്ങനെയാണവന്‍ കണക്കാക്കിയത്‌?",
            "verse 74:21": "പിന്നീട് അവനൊന്നു നോക്കി.",
            "verse 74:22": "പിന്നെ അവന്‍ മുഖം ചുളിക്കുകയും മുഖം കറുപ്പിക്കുകയും ചെയ്തു.",
            "verse 74:23": "പിന്നെ അവന്‍ പിന്നോട്ട് മാറുകയും അഹങ്കാരം നടിക്കുകയും ചെയ്തു.",
            "verse 74:24": "എന്നിട്ടവന്‍ പറഞ്ഞു: ഇത് (ആരില്‍ നിന്നോ) ഉദ്ധരിക്കപ്പെടുന്ന മാരണമല്ലാതെ മറ്റൊന്നുമല്ല.",
            "verse 74:25": "ഇത് മനുഷ്യന്‍റെ വാക്കല്ലാതെ മറ്റൊന്നുമല്ല.",
            "verse 74:26": "വഴിയെ ഞാന്‍ അവനെ സഖറില്‍ (നരകത്തില്‍) ഇട്ട് എരിക്കുന്നതാണ്‌.",
            "verse 74:27": "സഖര്‍ എന്നാല്‍ എന്താണെന്ന് നിനക്കറിയുമോ?",
            "verse 74:28": "അത് ഒന്നും ബാക്കിയാക്കുകയോ വിട്ടുകളയുകയോ ഇല്ല.",
            "verse 74:29": "അത് തൊലി കരിച്ച് രൂപം മാറ്റിക്കളയുന്നതാണ്‌.",
            "verse 74:30": "അതിന്‍റെ മേല്‍നോട്ടത്തിന് പത്തൊമ്പത് പേരുണ്ട്‌.",
            "verse 74:31": "നരകത്തിന്‍റെ മേല്‍നോട്ടക്കാരായി നാം മലക്കുകളെ മാത്രമാണ് നിശ്ചയിച്ചിരിക്കുന്നത്‌. അവരുടെ എണ്ണത്തെ നാം സത്യനിഷേധികള്‍ക്ക് ഒരു പരീക്ഷണം മാത്രമാക്കിയിരിക്കുന്നു. വേദം നല്‍കപ്പെട്ടിട്ടുള്ളവര്‍ക്ക് ദൃഢബോധ്യം വരുവാനും സത്യവിശ്വാസികള്‍ക്ക് വിശ്വാസം വര്‍ദ്ധിക്കാനും വേദം നല്‍കപ്പെട്ടവരും സത്യവിശ്വാസികളും സംശയത്തിലകപ്പെടാതിരിക്കാനും അല്ലാഹു എന്തൊരു ഉപമയാണ് ഇതു കൊണ്ട് ഉദ്ദേശിച്ചിട്ടുള്ളതെന്ന് ഹൃദയങ്ങളില്‍ രോഗമുള്ളവരും സത്യനിഷേധികളും പറയുവാനും വേണ്ടിയത്രെ അത്‌. അപ്രകാരം അല്ലാഹു താന്‍ ഉദ്ദേശിക്കുന്നവരെ പിഴപ്പിക്കുകയും, താന്‍ ഉദ്ദേശിക്കുന്നവരെ നേര്‍വഴിയിലാക്കുകയും ചെയ്യുന്നു. നിന്‍റെ രക്ഷിതാവിന്‍റെ സൈന്യങ്ങളെ അവനല്ലാതെ മറ്റാരും അറിയുകയില്ല. ഇത് മനുഷ്യര്‍ക്ക് ഒരു ഉല്‍ബോധനമല്ലാതെ മറ്റൊന്നുമല്ല.",
            "verse 74:32": "നിസ്സംശയം, ചന്ദ്രനെ തന്നെയാണ സത്യം.",
            "verse 74:33": "രാത്രി പിന്നിട്ട് പോകുമ്പോള്‍ അതിനെ തന്നെയാണ സത്യം.",
            "verse 74:34": "പ്രഭാതം പുലര്‍ന്നാല്‍ അതു തന്നെയാണ സത്യം.",
            "verse 74:35": "തീര്‍ച്ചയായും അത് (നരകം) ഗൌരവമുള്ള കാര്യങ്ങളില്‍ ഒന്നാകുന്നു.",
            "verse 74:36": "മനുഷ്യര്‍ക്ക് ഒരു താക്കീതെന്ന നിലയില്‍.",
            "verse 74:37": "അതായത് നിങ്ങളില്‍ നിന്ന് മുന്നോട്ട് പോകുവാനോ, പിന്നോട്ട് വെക്കുവാനോ ഉദ്ദേശിക്കുന്നവര്‍ക്ക്‌.",
            "verse 74:38": "ഓരോ വ്യക്തിയും താന്‍ സമ്പാദിച്ചു വെച്ചതിന് പണയപ്പെട്ടവനാകുന്നു.",
            "verse 74:39": "വലതുപക്ഷക്കാരൊഴികെ.",
            "verse 74:40": "ചില സ്വര്‍ഗത്തോപ്പുകളിലായിരിക്കും അവര്‍. അവര്‍ അന്വേഷിക്കും;",
            "verse 74:41": "കുറ്റവാളികളെപ്പറ്റി",
            "verse 74:42": "നിങ്ങളെ നരകത്തില്‍ പ്രവേശിപ്പിച്ചത് എന്തൊന്നാണെന്ന്‌.",
            "verse 74:43": "അവര്‍ (കുറ്റവാളികള്‍) മറുപടി പറയും: ഞങ്ങള്‍ നമസ്കരിക്കുന്നവരുടെ കൂട്ടത്തിലായില്ല.",
            "verse 74:44": "ഞങ്ങള്‍ അഗതിക്ക് ആഹാരം നല്‍കുമായിരുന്നില്ല.",
            "verse 74:45": "തോന്നിവാസത്തില്‍ മുഴുകുന്നവരുടെ കൂടെ ഞങ്ങളും മുഴുകുമായിരുന്നു.",
            "verse 74:46": "പ്രതിഫലത്തിന്‍റെ നാളിനെ ഞങ്ങള്‍ നിഷേധിച്ചു കളയുമായിരുന്നു.",
            "verse 74:47": "അങ്ങനെയിരിക്കെ ആ ഉറപ്പായ മരണം ഞങ്ങള്‍ക്ക് വന്നെത്തി.",
            "verse 74:48": "ഇനി അവര്‍ക്ക് ശുപാര്‍ശക്കാരുടെ ശുപാര്‍ശയൊന്നും പ്രയോജനപ്പെടുകയില്ല.",
            "verse 74:49": "എന്നിരിക്കെ അവര്‍ക്കെന്തു പറ്റി? അവര്‍ ഉല്‍ബോധനത്തില്‍ നിന്ന് തിരിഞ്ഞുകളയുന്നവരായിരിക്കുന്നു.",
            "verse 74:50": "അവര്‍ വിറളി പിടിച്ച കഴുതകളെപ്പോലിരിക്കുന്നു.",
            "verse 74:51": "സിംഹത്തില്‍ നിന്ന് ഓടിരക്ഷപ്പെടുന്ന (കഴുതകള്‍)",
            "verse 74:52": "അല്ല, അവരില്‍ ഓരോരുത്തരും ആഗ്രഹിക്കുന്നു; തനിക്ക് അല്ലാഹുവിങ്കല്‍ നിന്ന് നിവര്‍ത്തിയ ഏടുകള്‍ നല്‍കപ്പെടണമെന്ന്‌.",
            "verse 74:53": "അല്ല; പക്ഷെ, അവര്‍ പരലോകത്തെ ഭയപ്പെടുന്നില്ല.",
            "verse 74:54": "അല്ല; തീര്‍ച്ചയായും ഇത് ഒരു ഉല്‍ബോധനമാകുന്നു.",
            "verse 74:55": "ആകയാല്‍ ആര്‍ ഉദ്ദേശിക്കുന്നുവോ അവരത് ഓര്‍മിച്ചു കൊള്ളട്ടെ.",
            "verse 74:56": "അല്ലാഹു ഉദ്ദേശിക്കുന്നുവെങ്കിലല്ലാതെ അവര്‍ ഓര്‍മിക്കുന്നതല്ല. അവനാകുന്നു ഭക്തിക്കവകാശപ്പെട്ടവന്‍; പാപമോചനത്തിന് അവകാശപ്പെട്ടവന്‍."
        },
        "Norwegian": {
            "verse 74:1": "Du som ligger innhyllet i din kappe,",
            "verse 74:2": "stå opp og advar!",
            "verse 74:3": "Lovpris din Herre!",
            "verse 74:4": "Hold dine klær rene!",
            "verse 74:5": "Sky det urene!",
            "verse 74:6": "Gi ikke i håp om å få mer igjen!",
            "verse 74:7": "Vis standhaftighet overfor din Herre!",
            "verse 74:8": "Når det støtes i basunen;",
            "verse 74:9": "det vil bli en hard dag;",
            "verse 74:10": "for de vantro alt annet enn lett.",
            "verse 74:11": "La Meg alene med ham Jeg har skapt!",
            "verse 74:12": "Jeg gav ham rikdom i overflod,",
            "verse 74:13": "og sønner som han har om seg.",
            "verse 74:14": "Jeg tilrettela alt for ham!",
            "verse 74:15": "Så begjærer han at Jeg gir ham mer!",
            "verse 74:16": "Nei, så sannelig! Han viser tross mot Våre tegn!",
            "verse 74:17": "Jeg skal gi ham en tung vei!",
            "verse 74:18": "Han tenkte og vurderte,",
            "verse 74:19": "du verden som han vurderte.",
            "verse 74:20": "Ja, du verden, som han vurderte.",
            "verse 74:21": "Derpå så han opp,",
            "verse 74:22": "rynket pannen og så bister ut,",
            "verse 74:23": "snudde ryggen til i hovmod,",
            "verse 74:24": "og sa: «Dette er intet annet enn overlevert magi.",
            "verse 74:25": "Dette er bare et vanlig menneskes ord!»",
            "verse 74:26": "Jeg skal steke ham i Saqar!",
            "verse 74:27": "Vet du hva Saqar er?",
            "verse 74:28": "Det er helvetes ild, som ikke sparer eller skåner.",
            "verse 74:29": "Den svir huden.",
            "verse 74:30": "Den voktes av nitten.",
            "verse 74:31": "Det er alene engler som Vi har satt som Ildens voktere. Deres antall har Vi satt som en prøvelse for de vantro, for at troende skal søke i tro. For at skriftfolkene og de troende ikke skal være i tvil, for at de i hvis hjerter er sykdom, og de vantro, kan si: «Hva kan vel Gud ha ment med noe slikt?» Således lar Gud hvem Han vil fare vill, og veileder hvem Han vil. Ingen kjenner Herrens hærskarer, uten Han selv. Dette er en påminnelse for menneskene.",
            "verse 74:32": "Nei, ved månen!",
            "verse 74:33": "Ved natten når den heller!",
            "verse 74:34": "Ved morgenen når den gryr!",
            "verse 74:35": "Dette er sannelig en av de største ting,",
            "verse 74:36": "en advarsel til menneskene!",
            "verse 74:37": "Til den av dere som vil gå fremover, eller henge etter.",
            "verse 74:38": "Enhver står i pant for det han har gjort!",
            "verse 74:39": "Unntatt er høyrehåndsflokken.",
            "verse 74:40": "I havene vil de forhøre seg",
            "verse 74:41": "om synderne,",
            "verse 74:42": "«Hva har ført dere til helvetes ild?»",
            "verse 74:43": "De vil svare: «Vi var ikke av dem som bad,",
            "verse 74:44": "og vi gav ikke den fattige mat.",
            "verse 74:45": "Vi bare pratet med likesinnede,",
            "verse 74:46": "og fornektet dommens dag,",
            "verse 74:47": "inntil vissheten kom til oss.»",
            "verse 74:48": "Nå nytter det dem ikke om noen taler deres sak.",
            "verse 74:49": "Hva feiler det dem, siden de vender seg bort fra påminnelsen?",
            "verse 74:50": "Som forskremte esler",
            "verse 74:51": "som flykter for en løve?",
            "verse 74:52": "Joda, hver og én av dem ønsker at utbredte blader legges frem for ham.",
            "verse 74:53": "Nei så sannelig! De frykter ikke det hinsidige.",
            "verse 74:54": "Nei. Dette er en formaning.",
            "verse 74:55": "Og den som vil kan legge seg den på minnet.",
            "verse 74:56": "Men de legger seg den ikke på minnet, uten at Gud vil. Ham tilligger gudsfrykten, og Ham tilligger tilgivelsen."
        },
        "Pashto": {
            "verse 74:1": "اى په جامه كې نغښتونكیه!",
            "verse 74:2": "ته پورته شه، نو (خلق) ووېروه",
            "verse 74:3": "او نو د خپل رب لويي بیانوه",
            "verse 74:4": "او نو خپلې جامې پاكې ساته",
            "verse 74:5": "او ګناه (او بتان) نو ترك كړه",
            "verse 74:6": "او (داسې) احسان مه كوه چې بدل (او ډېرول) يې غواړې",
            "verse 74:7": "او خاص د خپل رب لپاره، پس صبر كوه",
            "verse 74:8": "نو كله چې په شپېلۍ كې پوكى وكړى شي",
            "verse 74:9": "نو په دغه وخت كې دغه ډېره سخته ورځ ده",
            "verse 74:10": "په كافرانو باندې اسانه نه ده",
            "verse 74:11": "ته پرېږده ما او هغه څوك چې ما دى يواځې پیدا كړى دى",
            "verse 74:12": "او (بیا مې) ده ته ډېر زیات مال وركړ",
            "verse 74:13": "او زامن حاضر (باشه)",
            "verse 74:14": "او ده ته مې فراخي وركړه، ډېره فراخي",
            "verse 74:15": "بیا دى طمع لري چې زه به ده ته لا زیات وركړم",
            "verse 74:16": "هیڅكله هم نه، بېشكه دى زمونږ له ایتونو سره ډېر عناد كوونكى (مخالف) و",
            "verse 74:17": "ژر به زه ده ته ډېر سخت تكلیف وركړم",
            "verse 74:18": "بېشكه ده فكر وكړ او اندازه يې وكړه",
            "verse 74:19": "پس دى دې هلاك كړى شي، ده څنګه اندازه وكړه؟",
            "verse 74:20": "بیا دې هلاك كړى شي، ده څنګه اندازه وكړه",
            "verse 74:21": "بیا يې وكتل",
            "verse 74:22": "بیا يې مخ تریو كړ او وچولى (تندى) يې بوټ كړ",
            "verse 74:23": "بیا يې شا كړه او لويي يې وكړه",
            "verse 74:24": "نو ده وویل: نه دى دا (قرآن) مګر داسې جادو چې رانقل كولى شي",
            "verse 74:25": "نه دى دا مګر د انسان قول",
            "verse 74:26": "ژر به زه دى د دوزخ اور ته داخل كړم",
            "verse 74:27": "او ته څه شي پوه كړې چې سقر (د دوزخ اور) څه شى دى",
            "verse 74:28": "دى به نه باقي ساتي او نه به پرېږدي",
            "verse 74:29": "انسان لره ډېر سوځوونكى دى",
            "verse 74:30": "په ده باندې نولس (ملايك) مقرر دي",
            "verse 74:31": "او مونږ د دوزخ څوكيداران نه دي ګرځولي مګر ملايك او مونږ د دوى شمېر نه دى ګرځولى مګر ازمېښت د هغو كسانو لپاره چې كافران شوي دي، د دې لپاره چې هغه كسان یقین وكړي چې كتاب ورته وركړى شوى دى او د هغو كسانو ایمان زیات شي چې ایمان يې راوړى دى او شك ونه كړي هغه كسان چې كتاب ورته وركړى شوى دى او مومنان۔ او د دې لپاره چې هغه كسان ووايي چې د هغوى په زړونو كې مرض دى او كافران: الله په دې سره د مثال په لحاظ څه اراده كړې ده۔. همداسې الله ګمراه كوي چا ته چې وغواړي او هدایت وركوي چا ته چې وغواړي۔ او ستا د رب لښكرې نه پېژني مګر هم دى. او نه دى دا مګر د خلقو لپاره نصیحت (او پند)",
            "verse 74:32": "هیڅكله داسې نه ده، قسم دى په سپوږمۍ",
            "verse 74:33": "او په شپې باندې كله چې شا كړي",
            "verse 74:34": "او په سبا باندې كله چې روښانه شي",
            "verse 74:35": "بېشكه دغه (اور د سقر) یقینًا په لویو (بلاګانو) كې یو دى",
            "verse 74:36": "چې انسان لره وېروونكى دى",
            "verse 74:37": "هغه چا لره چې په تاسو كې غواړي چې وړاندې شي، یا وروسته شي",
            "verse 74:38": "هر نفس به د خپلو كړو په بدل كې ګاڼه (ګرو) وي",
            "verse 74:39": "غیر له ښي اړخ والاو نه",
            "verse 74:40": "(دوى به) په جنتونو كې وي، یو تر بله به پوښتنې كوي",
            "verse 74:41": "د مجرمانو (كافرانو) په باره كې",
            "verse 74:42": "(مومنان به مجرمانو ته وايي:) تاسو په دوزخ كې څه شي داخل كړي یئ؟",
            "verse 74:43": "دوى به ووايي: مونږ له لمونځ كوونكو ځنې نه وو",
            "verse 74:44": "او مسكین ته به مو طعام نه وركاوه",
            "verse 74:45": "او له باطل ویونكو سره به مونږ په باطلو خبرو كې ننوتلو",
            "verse 74:46": "او مونږ به د بدلې ورځ دروغ ګڼله",
            "verse 74:47": "تر دې پورې چې مونږ ته یقین راغى",
            "verse 74:48": "نو دوى ته د سفارش كوونكو سفارش فايده نه رسوي",
            "verse 74:49": "نو په دوى څه شوي دي چې له نصیحت (قرآن) نه مخ ګرځوونكي دي",
            "verse 74:50": "ګویا كې دوى تښتېدونكي ځنګلي خره دي",
            "verse 74:51": "چې له زمري نه تښتي",
            "verse 74:52": "بلكې په دوى كې هر یو سړى غواړي چې ده ته خورې كړى شوې صحیفې (پاڼې) وركړى شي",
            "verse 74:53": "هیڅكله داسې نه ده۔ بلكې دوى له اخرت نه نه وېرېږي",
            "verse 74:54": "هیڅكله داسې نه ده۔، بېشكه دا (قرآن) نصیحت دى",
            "verse 74:55": "نو څوك چې غواړي (نو) له ده نه دې پند واخلي",
            "verse 74:56": "او دوى نصیحت (او پند) نه اخلي مګر كه الله يې وغواړي. هم دى د وېرې لايق دى او د بخښنې اهل دى"
        },
        "Persian": {
            "verse 74:1": "اى جامه در سر كشيده،",
            "verse 74:2": "برخيز و بيم ده.",
            "verse 74:3": "و پروردگارت را تكبير گوى.",
            "verse 74:4": "و جامه‌ات را پاكيزه دار.",
            "verse 74:5": "و از پليدى دورى گزين.",
            "verse 74:6": "و چيزى مده كه بيش از آن چشم داشته باشى.",
            "verse 74:7": "براى پروردگارت صابر باش.",
            "verse 74:8": "و آنگاه كه در صور دميده شود،",
            "verse 74:9": "آن روز روزى سخت خواهد بود.",
            "verse 74:10": "و براى كافران ناآسان.",
            "verse 74:11": "مرا با آن كه تنهايش آفريده‌ام واگذار.",
            "verse 74:12": "او را مالى بسيار دادم.",
            "verse 74:13": "و پسرانى همه در نزد او حاضر.",
            "verse 74:14": "و كارهاى او را به نيكوتر وجهى برساختم.",
            "verse 74:15": "آنگاه طمع مى‌بندد كه زيادت كنم.",
            "verse 74:16": "آرى، كه او در برابر آيات ما ستيزه‌جوست.",
            "verse 74:17": "او را به مشقتى مى‌اندازم.",
            "verse 74:18": "او انديشيد و طرحى افكند.",
            "verse 74:19": "مرگ بر او باد، چگونه طرحى افكند؟",
            "verse 74:20": "باز هم مرگ بر او باد، چگونه طرحى افكند؟",
            "verse 74:21": "آنگاه نگريست.",
            "verse 74:22": "سپس روى ترش كرد و پيشانى در هم كشيد.",
            "verse 74:23": "سپس روى گردانيد و گردنكشى كرد.",
            "verse 74:24": "گفت: اين، جز جادويى كه ديگرانش آموخته‌اند، هيچ نيست.",
            "verse 74:25": "اين، جز سخن آدمى هيچ نيست.",
            "verse 74:26": "زودا كه او را به سَقَر بيفكنيم.",
            "verse 74:27": "چه چيز آگاهت ساخت كه سَقَر چيست؟",
            "verse 74:28": "نه هيچ باقى مى‌گذارد و نه چيزى را وا مى‌گذارد.",
            "verse 74:29": "سوزاننده پوست است.",
            "verse 74:30": "نوزده فرشته بر آن گماشته‌اند.",
            "verse 74:31": "موكلان دوزخ را جز از فرشتگان قرارنداديم. و شمار آنها جز براى امتحان كافران نيست. تا اهل كتاب يقين كنند و بر ايمان مؤمنان بيفزايد و اهل كتاب و مؤمنان شك نكنند. و تا آنان كه در دلهاشان مرضى است نگويند: خدا از اين مثَل چه مى‌خواسته است؟ خدا اينچنين هر كس را كه بخواهد گمراه مى‌كند و هر كس را كه بخواهد راه مى‌نمايد. و شمار سپاهيان پروردگارت را جز او نداند. و اين سخن جز اندرزى از براى مردم نيست.",
            "verse 74:32": "آرى، سوگند به ماه.",
            "verse 74:33": "و سوگند به شب، چون روى در رفتن آرد،",
            "verse 74:34": "و سوگند به صبح، چون پرده برافكند،",
            "verse 74:35": "كه اين يكى از حادثه‌هاى بزرگ است.",
            "verse 74:36": "ترساننده آدميان است.",
            "verse 74:37": "براى هر كس از شما كه خواهد پيش افتد يا از پى رود.",
            "verse 74:38": "هر كس در گرو كارى است كه كرده است.",
            "verse 74:39": "مگر اهل سعادت،",
            "verse 74:40": "كه در بهشتها نشسته‌اند و مى‌پرسند",
            "verse 74:41": "از گناهكاران:",
            "verse 74:42": "كه چه چيز شما را به جهنم كشانيد؟",
            "verse 74:43": "مى‌گويند: ما از نمازگزاران نبوديم.",
            "verse 74:44": "و به درويشان طعام نمى‌داديم.",
            "verse 74:45": "و با آنان كه سخن باطل مى‌گفتند هماواز مى‌شديم،",
            "verse 74:46": "و روز قيامت را دروغ مى‌انگاشتيم.",
            "verse 74:47": "تا مرگ ما فرا رسيد.",
            "verse 74:48": "پس شفاعت شفاعت‌كنندگان سودشان نبخشيد.",
            "verse 74:49": "چه شده است كه از اين پند اعراض مى‌كنند؟",
            "verse 74:50": "مانند گورخران رميده‌",
            "verse 74:51": "كه از شير مى‌گريزند.",
            "verse 74:52": "بلكه هر يك از ايشان مى‌خواهد كه نامه‌هايى گشاده به او داده شود.",
            "verse 74:53": "آرى، كه از آخرت نمى‌ترسند.",
            "verse 74:54": "آرى، كه اين قرآن اندرزى است.",
            "verse 74:55": "هر كه خواهد، آن را بخواند.",
            "verse 74:56": "و پند نمى‌گيرند، مگر اينكه خدا خواهد. او شايان آن است كه از او بترسند. و او شايان آمرزيدن است."
        },
        "Polish": {
            "verse 74:1": "O ty, okryty płaszczem!",
            "verse 74:2": "Powstań i ostrzegaj!",
            "verse 74:3": "I twego Pana wysławiaj!",
            "verse 74:4": "I twoje szaty oczyszczaj!",
            "verse 74:5": "Od obrzydliwości - uciekaj!",
            "verse 74:6": "Nie obdarzaj, by otrzymać więcej!",
            "verse 74:7": "I dla twojego Pana bądź cierpliwy!",
            "verse 74:8": "A kiedy zadmą w trąbę,",
            "verse 74:9": "Tego Dnia dzień będzie trudny;",
            "verse 74:10": "Dla niewiernych - nie będzie on łatwy.",
            "verse 74:11": "Pozostaw Mnie samego z tym, którego stworzyłem!",
            "verse 74:12": "Ja dałem mu rozległy majątek",
            "verse 74:13": "I synów tu obecnych.",
            "verse 74:14": "I wyrównałem dla niego wszystko,",
            "verse 74:15": "A on pożąda, abym mu dał więcej.",
            "verse 74:16": "Otóż nie! On okazał się dla Naszych znaków oporny!",
            "verse 74:17": "Ja nałożę na niego nieustanne cierpienie.",
            "verse 74:18": "Oto on - pomyślał i zdecydował.",
            "verse 74:19": "Przeto niech zginie, jak zdecydował!",
            "verse 74:20": "Jeszcze raz niech zginie, jak zdecydował!",
            "verse 74:21": "Potem on popatrzył!",
            "verse 74:22": "Potem zmarszczył brwi i zasępił się!",
            "verse 74:23": "Potem odwrócił się, wbił się w pychę",
            "verse 74:24": "I powiedział: \"To nic innego, jak tylko czary, które się przekazuje!",
            "verse 74:25": "To nic innego, jak tylko słowo ludzi śmiertelnych!\"",
            "verse 74:26": "Ja narażę go na palenie się w ogniu-sakar.",
            "verse 74:27": "A co ciebie pouczy, co to jest sakar?",
            "verse 74:28": "On niczego nie zostawia i niczego nie oszczędza,",
            "verse 74:29": "Palący na czarno skórę.",
            "verse 74:30": "Nad nim czuwa dziewiętnastu.",
            "verse 74:31": "Uczyniliśmy stróżami ognia tylko aniołów. Uczyniliśmy taką ich liczbę tylko po to, aby doświadczyć tych, którzy nie uwierzyli; aby przekonali się o prawdzie ci, którym została dana Księga; aby powiększyła się wiara tych, którzy uwierzyli; aby nie wątpili ci, którzy otrzymali Księgę, oraz wierni; aby powiedzieli ci, w których sercach tkwi choroba, oraz niewierni: \"Jaki Bóg chciał dać przykład przez to?\" W ten sposób Bóg prowadzi w zabłądzenie, kogo chce, i On prowadzi drogą prostą, kogo chce. Nikt nie zna wojsk twego Pana, jak tylko On. To jest tylko przypomnienie dla ludzi.",
            "verse 74:32": "Ależ nie! Na księżyc!",
            "verse 74:33": "I na noc, kiedy się cofa!",
            "verse 74:34": "I na zorzę poranną, kiedy się zjawia!",
            "verse 74:35": "Zaprawdę, on jest jednym z największych!",
            "verse 74:36": "Jest ostrzeżeniem dla ludzi,",
            "verse 74:37": "Dla tych spośród was, którzy chcą się posuwać naprzód lub którzy chcą się cofać.",
            "verse 74:38": "Każda dusza jest poręką na to, co sobie zyskała",
            "verse 74:39": "- z wyjątkiem ludzi będących po prawicy.",
            "verse 74:40": "Oni w Ogrodach będą się nawzajem wypytywać",
            "verse 74:41": "O grzeszników:",
            "verse 74:42": "\"Co doprowadziło was do ognia-sakar?\"",
            "verse 74:43": "Powiedzą oni: \"Nie byliśmy wśród modlących się;",
            "verse 74:44": "Nie dawaliśmy pożywienia ubogim;",
            "verse 74:45": "Pogrążaliśmy się w daremnej dyspucie wraz z pogrążającymi się;",
            "verse 74:46": "I uznaliśmy za kłamstwo Dzień Sądu,",
            "verse 74:47": "- aż przyszła do nas pewność.\"",
            "verse 74:48": "I nie pomoże im wstawiennictwo wstawiających się.",
            "verse 74:49": "Cóż im się stało, że odwracają się od napomnienia,",
            "verse 74:50": "Jak gdyby byli wystraszonymi osłami,",
            "verse 74:51": "Które uciekają przed lwem?",
            "verse 74:52": "A przecież każdy z nich chce, aby mu dano karty rozpostarte.",
            "verse 74:53": "Ależ nie! Oni nie obawiają się życia ostatecznego!",
            "verse 74:54": "Ależ nie! Zaprawdę, to jest napomnienie!",
            "verse 74:55": "Przeto ten, kto zechce, przypomni to sobie!",
            "verse 74:56": "Lecz oni przypomną sobie tylko, jeśli zechce Bóg. On jest godny bojaźni i On włada przebaczeniem."
        },
        "Portuguese": {
            "verse 74:1": "Ó tu, emantado!",
            "verse 74:2": "Levante-te e admoesta!",
            "verse 74:3": "E enaltece o teu Senhor!",
            "verse 74:4": "E purifica as tuas vestimentas!",
            "verse 74:5": "E foge da abominação!",
            "verse 74:6": "E não esperes qualquer aumento (em teu interesse),",
            "verse 74:7": "Mas persevera, pela causa do teu Senhor,",
            "verse 74:8": "Pois, quando for tocada a trombeta,",
            "verse 74:9": "Esse dia será um dia nefasto,",
            "verse 74:10": "Insuportável para os incrédulos.",
            "verse 74:11": "Deixa por Minha conta aquele que criei solitário,",
            "verse 74:12": "Que depois agraciei com infinitos bens,",
            "verse 74:13": "E filhos, ao seu lado,",
            "verse 74:14": "E que agraciei liberalmente,",
            "verse 74:15": "E que ainda pretende que lhe sejam acrescentados (os bens)!",
            "verse 74:16": "Qual! Por Ter sido insubmisso quanto aos Nossos versículos,",
            "verse 74:17": "Infligir-lhe-ei um acúmulo de vicissitudes,",
            "verse 74:18": "Porque meditou e planejou.",
            "verse 74:19": "Que pereça, pois, por planejar,",
            "verse 74:20": "E, uma vez mais, que pereça por planejar!",
            "verse 74:21": "Então, refletiu;",
            "verse 74:22": "Depois, tornou-se austero e ameaçador;",
            "verse 74:23": "Depois, renegou e se ensoberbeceu;",
            "verse 74:24": "E disse: Este (Alcorão) não é mais do que magia, oriunda do passado;",
            "verse 74:25": "Esta não é mais do que a palavra de um mortal!",
            "verse 74:26": "Por isso, introduzi-lo-ei no tártaro!",
            "verse 74:27": "E o que te fará compreender o que é o tártaro?",
            "verse 74:28": "Nada deixa perdurar e nada deixa a sós!",
            "verse 74:29": "Carbonizador do humanos,",
            "verse 74:30": "Guardado por dezenove.",
            "verse 74:31": "E não designamos guardiães do fogo, senão os anjos, e não fixamos o seu número, senão como prova para os incrédulos, para que os adeptos do Livro se convençam; para que os fiéis aumentem em sua fé e para que os adeptos do Livro, assim como os fiéis, não duvidem; e para que os que abrigam a morbidez em seus corações, bem como os incrédulos, digam: Que quer dizer Deus com esta prova? Assim Deus extravia quem quer e encaminha quem Lhe apraz e ninguém, senão Ele, conhece os exércitos do teu Senhor. Isto não é mais do que uma mensagem para a humanidade.",
            "verse 74:32": "Qual! Pela lua,",
            "verse 74:33": "E pela noite, quando se extingue,",
            "verse 74:34": "E pela manhã, quando surge,",
            "verse 74:35": "Que isto é um doa maiores portentos,",
            "verse 74:36": "Admoestação para o gênero humano,",
            "verse 74:37": "E para aquele, dentre vós, que se antecipa ou se atrasa!",
            "verse 74:38": "Toda a alma é depositária das suas ações,",
            "verse 74:39": "Salvo as que estiverem à mão direita,",
            "verse 74:40": "Que estarão nos jardins das delícias. Perguntarão,",
            "verse 74:41": "Aos pecadores:",
            "verse 74:42": "O que foi que vos introduziu no tártaro?",
            "verse 74:43": "Responder-lhes-ão: Não nos contávamos entre os que oravam,",
            "verse 74:44": "Nem alimentávamos o necessitado;",
            "verse 74:45": "Ao contrário, dialogávamos sobre futilidades, com palradores,",
            "verse 74:46": "E negávamos o Dia do Juízo,",
            "verse 74:47": "Até que nos chegou a (Hora) infalível!",
            "verse 74:48": "De nada, então, valerá, a intercessão dos mediadores.",
            "verse 74:49": "Porque, pois, desdenham a admoestação,",
            "verse 74:50": "Como se fossem asnos espantados,",
            "verse 74:51": "Fugindo de um leão?",
            "verse 74:52": "Porém, cada um deles quereria receber (agora) páginas abertas (com a revelação).",
            "verse 74:53": "Qual! Em verdade não temem a outra vida.",
            "verse 74:54": "Qual! Sabei que (o Alcorão) é uma admoestação.",
            "verse 74:55": "Quem quiser, pois, que o recorde!",
            "verse 74:56": "Porém, não o recordarão, a menos que Deus o queira, porque é o Senhor do temor e o Senhor da remissão."
        },
        "Punjabi": {
            "verse 74:1": "ਹੇ (ਮੁਹੰਮਦ) ਕੱਪੜੇ ਵਿਚ ਲਿਪਟਣ ਵਾਲੇ",
            "verse 74:2": "ਉੱਠ ਅਤੇ ਲੋਕਾਂ ਨੂੰ ਡਰਾ",
            "verse 74:3": "ਅਤੇ ਆਪਣੇ ਰੱਬ ਦੀ ਵਡਿਆਈ ਬਿਆਨ ਕਰ।",
            "verse 74:4": "ਅਤੇ ਆਪਣੇ ਕੱਪੜਿਆਂ ਨੂੰ ਪਵਿੱਤਰ ਰੱਖ।",
            "verse 74:5": "ਅਤੇ ਗੰਦਗੀ ਨੂੰ ਛੱਡ ਦੇ",
            "verse 74:6": "ਅਤੇ ਅਜਿਹਾ ਨਾ ਕਰੋ, ਕਿ ਉਪਕਾਰ ਕਰੋ ਅਤੇ ਫ਼ਲ ਦੀ ਇੱਛਾ ਬਹੁਤੀ ਰੱਖੋ।",
            "verse 74:7": "ਅਤੇ ਆਪਣੇ ਰੱਬ ਲਈ ਧੀਰਜ ਰੱਖੋ।",
            "verse 74:8": "ਫਿਰ ਜਦੋਂ ਬਿਗਲ ਵਜਾਇਆ ਜਾਵੇਗਾ।",
            "verse 74:9": "ਤਾਂ ਉਹ ਬਹੁਤ ਸਖ਼ਤ ਦਿਨ ਹੋਵੇਗਾ।",
            "verse 74:10": "ਅਵੱਗਿਆਕਾਰੀਆਂ ਲਈ ਅਸਾਨ ਨਹੀਂ ਹੋਵੇਗਾ।",
            "verse 74:11": "ਮੈਨੂੰ ਛੱਡ ਦੇਵੋ ਅਤੇ ਉਸ ਬੰਦੇ ਨੂੰ ਵੀ ਜਿਸ ਨੂੰ ਸੈਂ ਇਕੱਲਾ ਪੈਦਾ ਕੀਤਾ ਹੈ।",
            "verse 74:12": "ਅਤੇ ਉਸ ਨੂੰ ਬਹੁਤ ਸਾਰਾ ਮਾਲ ਦਿੱਤਾ।",
            "verse 74:13": "ਅਤੇ ਨੇੜੇ ਰਹਿਣ ਵਾਲੇ ਪੁੱਤਰ।",
            "verse 74:14": "ਅਤੇ ਹਰ ਤਰ੍ਹਾਂ ਦਾ ਸਮਾਨ ਉਨ੍ਹਾਂ ਲਈ ਹਾਜ਼ਿਰ ਕਰ ਦਿੱਤਾ ਹੈ।",
            "verse 74:15": "ਫਿਰ ਉਹ ਲਾਲਸਾ ਰੱਖਦਾ ਹੈ ਕਿ ਮੈਂ ਉਸ ਨੂੰ ਹੋਰ ਦੇਂਵਾ।",
            "verse 74:16": "ਕਦੇ ਵੀ ਨਹੀਂ, ਉਹ ਮੇਰੀਆਂ ਆਇਤਾਂ ਦਾ ਵਿਰੋਧੀ ਹੈ।",
            "verse 74:17": "ਜਲਦੀ ਹੀ ਮੈਂ ਉਸ ਨੂੰ ਇੱਕ ਔਖੀ ਚੜ੍ਹਾਈ ਤੇ ਚੜ੍ਹਾਂਵਂਗ।",
            "verse 74:18": "ਉਸ ਨੇ ਸੋਚਿਆ ਅਤੇ ਗੱਲ ਬਣਾ ਨਹੀਂ।",
            "verse 74:19": "ਸੋ ਉਹ ਨਸ਼ਟ ਹੋਇਆ, ਉਸ ਨੇ ਕਿਹੋ ਜਿਹੀ ਗੱਲ ਬਣਾਈ।",
            "verse 74:20": "ਫਿਰ ਉਹ ਹਲਾਕ ਹੋ ਜਾਵੇ, ਉਸ ਨੇ ਕਿਹੋਂ ਜਿਹੀ ਗੱਲ ਬਣਾਈ।",
            "verse 74:21": "ਫਿਰ ਉਸ ਨੇ ਦੇਖਿਆ।",
            "verse 74:22": "ਫਿਰ ਉਸ ਨੇ ਤਿਊਂੜੀ ਚੜ੍ਹਾਈ ਅਤੇ ਮੂੰਹ ਬਣਾਇਆ।",
            "verse 74:23": "ਫਿਰ ਪਿੱਠ ਫੇਰੀ ਅਤੇ ਹੰਕਾਰ ਕੀਤਾ।",
            "verse 74:24": "ਫਿਰ ਬੋਲਿਆ ਇਹ ਤਾਂ ਸਿਰਫ਼ ਲਿੱਕ ਜਾਦੂ ਹੈ ਜਿਹੜਾ ਪਹਿਲਾਂ ਤੋਂ ਚੱਲਿਆ ਆ ਰਿਹਾ ਹੈ।",
            "verse 74:25": "ਇਹ ਤਾਂ ਸਿਰਫ਼ ਮਨੁੱਖ ਦੀ ਬਾਣੀ ਹੈ।",
            "verse 74:26": "ਮੈਂ ਉਸ ਨੂੰ ਜਲਦੀ ਹੀ ਨਰਕ ਵਿਚ ਸੁੱਟ ਦੇਵਾਂਗਾ।",
            "verse 74:27": "ਅਤੇ ਤੁਸੀਂ ਕੀ ਜਾਣੋ, ਕਿ ਨਰਕ ਕੀ ਹੈ।",
            "verse 74:28": "ਨਾ ਬਾਕੀ ਰਹਿਣ ਦੇਵੇਗੀ ਅਤੇ ਨਾ ਛੱਡੇਗੀ।",
            "verse 74:29": "ਚਮੜੀ ਨੂੰ ਝੁਲਸਾ ਦੇਣ ਵਾਲੀ।",
            "verse 74:30": "ਉਸ ਤੇ ਉਨੀਂ (19) ਫ਼ਰਿਸ਼ਤੇ ਹਨ।",
            "verse 74:31": "ਅਸੀਂ ਨਰਕ ਦੇ ਕਰਮਚਾਰੀ ਸਿਰਫ਼ ਫ਼ਰਿਸ਼ਤਿਆਂ ਨੂੰ ਬਣਾਇਆ ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਦੀ ਜਿਹੜੀ ਗਿਣਤੀ ਰੱਖੀ ਹੈ ਉਹ ਸਿਰਫ਼ ਅਵੱਗਿਆਕਾਰੀਆਂ ਨੂੰ ਪਰਖਣ ਲਈ ਹੈ। ਤਾਂ ਕਿ ਉਹ ਲੋਕ ਵਿਸ਼ਵਾਸ਼ ਹਾਸਲ ਕਰਨ ਜਿਨ੍ਹਾਂ ਨੂੰ ਕਿਤਾਬ ਦਿੱਤੀ ਗਈ। ਅਤੇ ਈਮਾਨ ਵਾਲੇ ਆਪਣੇ ਈਮਾਨ ਨੂੰ ਵਧਾਉਣ ਅਤੇ ਕਿਤਾਬ ਵਾਲੇ (ਯਾਹੂਵੀ ਤੇ ਇਸਾਈ) ਅਤੇ ਮੋਮਿਨ ਸ਼ੱਕ ਨਾ ਕਰਨ, ਤਾਂ ਕਿ ਜਿਨ੍ਹਾਂ ਲੋਕਾਂ ਦੇ ਦਿਲ ਵਿਚ ਰੋਂਗ ਹੈ ਉਹ ਅਤੇ ਅਵੱਗਿਆਕਾਰੀ ਲੋਕ ਆਖਣਗੇ, ਕਿ ਇਸ ਨਾਲ ਅੱਲਾਹ ਦਾ ਕੀ ਮਤਲਬ ਹੈ। ਇਸ ਤਰ੍ਹਾਂ ਅੱਲਾਹ ਜਿਸ ਨੂੰ ਚਾਹੁੰਦਾ ਹੈ ਭਟਕਾ ਦਿੰਦਾ ਹੈ ਅਤੇ ਜਿਸ ਨੂੰ ਚਾਹੁੰਦਾ ਹੈ ਨਸੀਹਤ ਪ੍ਰਦਾਨ ਕਰਦਾ ਹੈ। ਤੇਰੇ ਰੱਬ ਦੀਆਂ ਫੌਜਾਂ ਨੂੰ ਸਿਰਫ਼ ਉਹੀ ਜਾਣਦਾ ਹੈ। ਇਹ ਤਾਂ ਬੱਸ ਲੋਕਾਂ ਨੂੰ ਸਮਝਾਉਣਾ ਹੈ।",
            "verse 74:32": "ਕਦੇ ਵੀ ਨਹੀਂ, ਸਹੂੰ ਹੈ ਚੰਨ ਦੀ",
            "verse 74:33": "ਅਤੇ ਰਾਤ ਦੀ ਜਦੋਂ ਉਹ ਜਾਣ ਲੱਗੇ।",
            "verse 74:34": "ਅਤੇ ਸਵੇਰ ਦੀ ਜਦੋਂ ਉਹ ਚੜ੍ਹ ਜਾਵੇ।",
            "verse 74:35": "ਬੇਸ਼ੱਕ ਨਰਕ ਵੱਡੀਆਂ ਚੀਜ਼ਾਂ ਵਿਚੋਂ ਹੈ।",
            "verse 74:36": "ਮਨੁੱਖ ਲਈ ਡਰਾਵਾ।",
            "verse 74:37": "ਉਨ੍ਹਾਂ ਲਈ ਜਿਹੜੇ ਤੁਹਾਡੇ ਵਿਚੋਂ ਅੱਗੇ ਵੱਲ ਵਧੇ ਜਾਂ ਪਿੱਛੇ ਵੱਲ ਮੁੜੇ।",
            "verse 74:38": "ਹਰੇਕ ਬੰਦਾ ਆਪਣੇ ਕਰਮਾਂ ਦੇ ਬਦਲੇ ਗਹਿਣੇ (ਗਿਰਵੀ) ਹੈ।",
            "verse 74:39": "ਬਿਲ੍ਹਾਂ ਸੱਜੇ ਵਾਲਿਆਂ ਦੇ।",
            "verse 74:40": "[ਕੌਣ ਹੋਣਗੇ] ਬਾਗਾਂ ਵਿੱਚ, ਇੱਕ ਦੂਜੇ ਤੋਂ ਪ੍ਰਸ਼ਨ ਕਰਦੇ",
            "verse 74:41": "ਅਪਰਾਧੀ ਬਾਰੇ",
            "verse 74:42": "[ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਪੁੱਛਦੇ ਹੋਏ], \" ਤੁਹਾਨੂੰ ਸਾਕਾਰ ਵਿੱਚ ਕਿਸ ਚੀਜ਼ ਨੇ ਪਾ ਦਿੱਤਾ",
            "verse 74:43": "ਉਹ ਕਹਿਣਗੇ, ਅਸੀਂ ਪ੍ਰਾਰਥਨਾ ਕਰਨ ਵਾਲਿਆਂ ਵਿੱਚੋਂ ਨਹੀਂ ਸੀ",
            "verse 74:44": "ਅਤੇ ਅਸੀਂ ਗਰੀਬਾਂ ਨੂੰ ਨਹੀਂ ਖੁਆਇਆ",
            "verse 74:45": "ਅਤੇ ਅਸੀਂ ਵਿਚਾਰ ਕਰਨ ਵਾਲਿਆਂ ਨਾਲ ਬਹਿਸ ਕਰਦੇ।",
            "verse 74:46": "ਅਤੇ ਅਸੀਂ ਇਨਸਾਫ਼ ਦੇ ਦਿਨ ਤੋਂ ਮੁਨਕਰ ਸੀ।",
            "verse 74:47": "ਇੱਥੋਂ ਤੱਕ ਕਿ ਉਹ ਯਕੀਨਨੀ ਗੱਲ ਸਾਡੇ ਤੇ ਆ ਗਈ।",
            "verse 74:48": "ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਸਿਫ਼ਾਰਿਸ਼ ਕਰਨ ਵਾਲਿਆਂ ਦੀ ਸਿਫ਼ਾਰਿਸ਼ ਕੋਈ ਵੀ ਲਾਭ ਨਹੀਂ ਦੇਵੇਗੀ।",
            "verse 74:49": "ਫਿਰ ਉਨ੍ਹਾਂ ਨੂੰ ਕੀ ਹੋ ਗਿਆ ਕਿ ਉਹ ਉਪਦੇਸ਼ ਤੋਂ ਮੂੰਹ ਮੋੜਦੇ ਹਨ।",
            "verse 74:50": "ਜਿਵੇਂ, ਕਿ ਉਹ ਜੰਗਲੀ ਗਧੇ ਹੋਣ।",
            "verse 74:51": "ਜਿਹੜੇ ਸ਼ੇਰ ਦੇ ਅੱਗੇ ਭੱਜੇ ਜਾ ਰਹੇ ਹਨ।",
            "verse 74:52": "ਸਗੋਂ ਉਨ੍ਹਾਂ ਵਿਚੋਂ ਹਰੇਕ ਬੰਦਾ ਇਹ ਚਾਹੁੰਦਾ ਹੈ, ਕਿ ਉਸ ਨੂੰ ਖੁੱਲ੍ਹੀ ਹੋਈ ਕਿਤਾਬ ਦਿੱਤੀ ਜਾਵੇ।",
            "verse 74:53": "ਕਦੇ ਵੀ ਨਹੀਂ, ਸਗੋ ਇਹ ਲੋਕ ਪ੍ਰਲੋਕ ਤੋਂ ਨਹੀਂ ਡਰਦੇ।",
            "verse 74:54": "ਕਦੇ ਵੀ ਨਹੀਂ। ਇਹ ਤਾਂ ਇੱਕ ਉਪਦੇਸ਼ ਹੈ।",
            "verse 74:55": "ਸੋ ਜਿਸ ਦਾ ਜੀਅ ਚਾਹੇ (ਉਹ) ਉਸ ਤੋਂ ਉਪਦੇਸ਼ ਪ੍ਰਾਪਤ ਕਰੇ।",
            "verse 74:56": "ਅਤੇ ਉਹ ਉਸ ਤੋਂ ਉਪਦੇਸ਼ ਪ੍ਰਾਪਤ ਨਹੀ’ ਕਰਨਗੇ ਪਰੰਤੂ ਇਹ ਕਿ ਜੇ ਅੱਲਾਹ ਚਾਹੇ। ਉਹ ਹੀ ਹੈ ਜਿਸ ਤੋਂ ਡਰਨਾ ਚਾਹੀਦਾ ਹੈ ਅਤੇ ਉਹ ਹੀ ਮੁਆਫ਼ੀ ਦੇਣ ਦੇ ਯੋਗ ਹੈ।"
        },
        "Roman english": {
            "verse 74:1": "Yaaa ayyuhal muddassir",
            "verse 74:2": "Qum fa anzir",
            "verse 74:3": "Wa rabbaka fakabbir",
            "verse 74:4": "Wa siyaabaka fatahhir",
            "verse 74:5": "Warrujza fahjur",
            "verse 74:6": "Wa laa tamnun tastaksir",
            "verse 74:7": "Wa li Rabbika fasbir",
            "verse 74:8": "Fa izaa nuqira fin naaqoor",
            "verse 74:9": "Fazaalika yawma `iziny yawmun `aseer",
            "verse 74:10": "Alal kaafireena ghayru yaseer",
            "verse 74:11": "Zamee wa man khalaqtu waheedaa",
            "verse 74:12": "Wa ja`altu lahoo maalam mamdoodaa",
            "verse 74:13": "Wa baneena shuhoodaa",
            "verse 74:14": "Wa mahhattu lahoo tamheeda",
            "verse 74:15": "Summa yat ma`u an azeed",
            "verse 74:16": "Kallaaa innahoo kaana li Aayaatinaa `aneedaa",
            "verse 74:17": "Sa urhiquhoo sa`oodaa",
            "verse 74:18": "Innahoo fakkara wa qaddar",
            "verse 74:19": "Faqutila kayfa qaddar",
            "verse 74:20": "Summa qutila kaifa qaddar",
            "verse 74:21": "Summa nazar",
            "verse 74:22": "Summa `abasa wa basar",
            "verse 74:23": "Summaa adbara wastakbar",
            "verse 74:24": "Faqaala in haazaaa illaa sihruny yu`sar",
            "verse 74:25": "In haazaaa illaa qawlul bashar",
            "verse 74:26": "Sa usleehi saqar",
            "verse 74:27": "Wa maaa adraaka maa saqar",
            "verse 74:28": "Laa tubqee wa laa tazar",
            "verse 74:29": "Lawwaahatul lilbashar",
            "verse 74:30": "Alaihaa tis`ata `ashar",
            "verse 74:31": "Wa maaja``alnaaa As haaban naari illaa malaaa `ikatanw wa maa ja`alnaa `iddatahum illaa fitnatal lillazeena kafaroo liyastayqinal lazeena ootul kitaaba wa yazdaadal lazeena aamanooo eemaananw wa laa yartaabal lazeena ootul kitaaba walmu`minoona wa liyaqoolal lazeena fee quloo bihim maradunw walkaafiroona maazaaa araadal laahu bihaazaa masalaa; kazaalika yudillul laahu many yashaaa`u wa yahdee many yashaaa`; wa maa ya`lamu junooda rabbika illaa hoo; wa maa hiya illaa zikraa lil bashar",
            "verse 74:32": "Kallaa walqamar",
            "verse 74:33": "Wallaili adbar",
            "verse 74:34": "Wassub hi izaaa asfar",
            "verse 74:35": "Innahaa la ihdal kubar",
            "verse 74:36": "Nazeeral lilbashar",
            "verse 74:37": "Liman shaaa`a minkum any yataqaddama aw yata akhkhar",
            "verse 74:38": "Kullu nafsim bim kasabat raheenah",
            "verse 74:39": "Illaaa as haabal yameen",
            "verse 74:40": "Fee jannaatiny yata saaa`aloon",
            "verse 74:41": "Anil mujrimeen",
            "verse 74:42": "Maa salakakum fee saqar",
            "verse 74:43": "Qaaloo lam naku minal musalleen",
            "verse 74:44": "Wa lam naku nut`imul miskeen",
            "verse 74:45": "Wa kunnaa nakhoodu ma`al khaaa`ideen",
            "verse 74:46": "Wa kunnaa nukazzibu bi yawmid Deen",
            "verse 74:47": "Hattaaa ataanal yaqeen",
            "verse 74:48": "Famaa tanfa`uhum shafaa`atush shaafi`een",
            "verse 74:49": "Famaa lahum `anittazkirati mu`rideen",
            "verse 74:50": "Ka annahum humurum mustanfirah",
            "verse 74:51": "Farrat min qaswarah",
            "verse 74:52": "Bal yureedu kullum ri`im minhum any yu`taa suhufam munashsharah",
            "verse 74:53": "Kallaa bal laa yakhaafoonal aakhirah",
            "verse 74:54": "Kallaaa innahoo tazkirah",
            "verse 74:55": "Fa man shaaa`a zakarah",
            "verse 74:56": "Wa maa yazkuroona illaaa any yashaaa`al laah; Huwa ahlut taqwaa wa ahlul maghfirah"
        },
        "Russian": {
            "verse 74:1": "О ты, укрывшийся плащом!",
            "verse 74:2": "Встань и неси предупрежденье",
            "verse 74:3": "И славь Владыку своего!",
            "verse 74:4": "И в чистоте блюди свои одежды,",
            "verse 74:5": "От мерзости беги",
            "verse 74:6": "И (благ) не раздавай В надежде получить (с лихвой) обратно.",
            "verse 74:7": "В Господнем деле проявляй терпенье.",
            "verse 74:8": "Когда раздастся трубный глас,",
            "verse 74:9": "Настанет День - день тяжкий,",
            "verse 74:10": "День, нелегкий для неверных.",
            "verse 74:11": "И одного Меня оставь с тем (человеком), Кого Я одиноким создал,",
            "verse 74:12": "Потом пространное богатство даровал",
            "verse 74:13": "И сыновей, стоящих рядом (в радости и в горе),",
            "verse 74:14": "И гладко перед ним простер (дорогу жизни).",
            "verse 74:15": "И все же жадничает он.",
            "verse 74:16": "Увы! К знаменьям Нашим он упрям и дерзок.",
            "verse 74:17": "Я возложу (как наказанье) на него подъем, -",
            "verse 74:18": "Ведь он замыслил все и рассчитал.",
            "verse 74:19": "Да будет убиен он! Как он все устроил!",
            "verse 74:20": "И вновь - пусть будет он убит! Как рассчитал он все!",
            "verse 74:21": "Затем он поглядел вокруг,",
            "verse 74:22": "Затем нахмурился и сдвинул брови,",
            "verse 74:23": "Затем спиною встал и возгордился,",
            "verse 74:24": "Затем сказал: \"Сие - не боле колдовства, Пришедшего с времен далеких;",
            "verse 74:25": "Не боле чем людская речь!\"",
            "verse 74:26": "Я в сАкаре его сожгу!",
            "verse 74:27": "Как объяснить тебе, что \"сАкар\" значит?",
            "verse 74:28": "Его нельзя ни вытерпеть и ни покинуть,",
            "verse 74:29": "Сжигает (кожу человека) он,",
            "verse 74:30": "Над ним же - девятнадцать (стражей).",
            "verse 74:31": "Мы во властители Огня лишь ангелов призвали, Назначив точно их число Для искушения неверных, Чтоб убедить людей Писания (Уверовать в пророка и Коран), Чтобы усилить веру в тех, кто верует, И чтобы никаких сомнений не осталось Ни в праведных сердцах, ни у людей Писаний, И чтоб неверные и те, Сердца которых недугом объяты, Сказать могли: \"Какую ж суть Аллах нам этой притчей выражает?\" Так позволяет Он (в грехах) блуждать тому, кто этого захочет, И ясною стезей ведет того, кто мил Ему. И никому, кроме Него, не знать (числа) Его воИнств. И сей (Огонь) - не что иное, Как увещанье для людей.",
            "verse 74:32": "В знак (Моего знамения) - луны,",
            "verse 74:33": "И уходящей ночи,",
            "verse 74:34": "И пламенеющей зари, -",
            "verse 74:35": "Ведь это - (всего) один из величайших (Моих знаков)",
            "verse 74:36": "И увещанье для людей,",
            "verse 74:37": "Для тех, кто во главе (к добру) идет, (А равно) и для тех, кто остается сзади.",
            "verse 74:38": "Ведь каждая душа заложницей своих деяний будет, -",
            "verse 74:39": "Помимо (братьев) правой стороны.",
            "verse 74:40": "Вступая в сад (прекрасный Рая), Они друг друга воспрошают",
            "verse 74:41": "И грешникам (вопрос свой задают):",
            "verse 74:42": "Что привело вас в сАкар?",
            "verse 74:43": "Они ответят: \"Мы не были средь тех, Кто совершал молитву,",
            "verse 74:44": "И не были средь тех, Кто бедняков кормил.",
            "verse 74:45": "Мы пустословьем с болтунами занимались",
            "verse 74:46": "И ложью нарекали Судный День,",
            "verse 74:47": "Пока нас не постигла смерть\".",
            "verse 74:48": "И тут ничье заступничество им не поможет.",
            "verse 74:49": "Так что ж от увещаний Наших Их заставляет отвернуться,",
            "verse 74:50": "Подобно перепуганным ослам,",
            "verse 74:51": "От льва спасающихся бегством?",
            "verse 74:52": "Поистине, любой из них хотел бы, Чтобы (Аллах) лишь одному ему послал Развернутые свитки Откровений.",
            "verse 74:53": "Увы! В них страха нет перед последней жизнью.",
            "verse 74:54": "Да будет так! Ведь сей (Коран), поистине, Является напоминаньем.",
            "verse 74:55": "И кто захочет, тот его услышит,",
            "verse 74:56": "Но не услышит ни один из них, Если Аллах того не пожелает. Лишь Он достоин, чтобы (в почитании Его) Страшились (Его гнева). Вершитель всепрощенья - только Он!"
        },
        "Sindhi": {
            "verse 74:1": "اي (پاڻتي) ڪپڙي ويڙھڻ وارا مڙس.",
            "verse 74:2": "کڙو ٿي پوءِ ڊيڄار.",
            "verse 74:3": "۽ پنھنجي پالڻھار جي وڏائي بيان ڪر.",
            "verse 74:4": "۽ پنھنجا ڪپڙا پاڪ رک.",
            "verse 74:5": "۽ پليتي کان پري رھ.",
            "verse 74:6": "۽ (اھڙو) احسان نه ڪر جو زيادہ عوض گھرين.",
            "verse 74:7": "۽ پنھنجي پالڻھار (جي حُڪم) لاءِ صبر اختيار ڪر.",
            "verse 74:8": "پوءِ جڏھن صُور ۾ ڦوڪبو.",
            "verse 74:9": "تڏھن اُن ڏينھن اوکو وقت ٿيندو.",
            "verse 74:10": "ڪافرن تي اڻ سکيو (وقت) ھوندو.",
            "verse 74:11": "مون کي ۽ جنھن کي اڪيلو پيدا ڪيم تنھن کي ڇڏي ڏي.",
            "verse 74:12": "۽ اُن کي گھڻو مال ڏنم.",
            "verse 74:13": "۽ (مجلسن ۾) حاضر ٿيڻ وارا پُٽ (به ڏنم).",
            "verse 74:14": "۽ ان کي پوري طرح وڌايم.",
            "verse 74:15": "وري (به) لالچ رکندو آھي ته (کيس) وڌيڪ ڏيان.",
            "verse 74:16": "ائين نه آھي، بيشڪ اُھو اسان جي آيتن سان جھڳڙو ڪندڙ آھي.",
            "verse 74:17": "جلد اُن کي وڏي سختي سان تڪليف ڏيندس.",
            "verse 74:18": "بيشڪ اُن دل ۾ سوچ ڪئي ۽ ٺھراءُ ڪيو.",
            "verse 74:19": "پوءِ لعنت ھجيس شال ڪيئن ٺھراء ڪيائين.",
            "verse 74:20": "وري به لعنت ھجيس شال ڪيئن ٺھراءُ ڪيائين.",
            "verse 74:21": "وري (غور ڪري) ڏٺائين.",
            "verse 74:22": "وري منھن ۾ شور وڌائين ۽ گھنڊ پاتائين.",
            "verse 74:23": "وري پٺيرو ٿيو ۽ وڏائي ڪيائين.",
            "verse 74:24": "پوءِ چيائين ته ھي (قرآن) رڳو جادو آھي جو (جادوگرن کان) ھليو اچي ٿو.",
            "verse 74:25": "ھي (قرآن) رڳو ماڻھوءَ جو ڪلام آھي.",
            "verse 74:26": "جلد اُن کي دوزخ ۾ وجھندس.",
            "verse 74:27": "۽ توکي ڪھڙي شيءَ ڄاڻايو ته دوزخ ڇا آھي.",
            "verse 74:28": "اُھو نڪي ڪجھ (گوشت) رھائي ٿو ۽ نڪي (ھڏا) ڇڏي ٿو.",
            "verse 74:29": "ماڻھن کي (ساڙي) ڪارو ڪندڙ آھي.",
            "verse 74:30": "اُن تي اُڻويہ ڄڻا دربان آھن.",
            "verse 74:31": "۽ دوزخ جا دربان رڳو ملائڪ ڪيا اٿون، ۽ سندن ڳاڻيٽو رڳو ڪافرن لاءِ پرک ڪئي اٿون ته ڪتاب وارا يقين ڪن ۽ ايمان وارا پنھنجي ايمان ۾ وڌن ۽ ڪتاب وارا ۽ مؤمن شڪ ۾ نه پون ۽ ته جن جي دلين ۾ (منافقيءَ جي) بيماري آھي سي ۽ ڪافر چون ته ھن مثال ڏيڻ ۾ الله جو ڇا مطلب آھي، اھڙيءَ طرح الله جنھن کي گھري (تنھن کي) ڀلائيندو آھي ۽ جنھن کي گھري (تنھن کي) ھدايت ڪندو آھي، ۽ تنھنجي پالڻھار جا لشڪر اُن کانسواءِ (ٻيو) ڪونه ڄاڻندو آھي، ۽ ھيءَ (دوزخ) سڀ ڪنھن ماڻھوءَ لاءِ رڳو نصيحت آھي.",
            "verse 74:32": "سچ چوان ٿو چنڊ جو قسم آھي.",
            "verse 74:33": "۽ رات جو جڏھن پٺ ڦيري.",
            "verse 74:34": "۽ صبح جو (قسم آھي) جڏھن روشن ٿئي.",
            "verse 74:35": "ته بيشڪ دوزخ ھڪ وڏين شين مان آھي.",
            "verse 74:36": "(سڀڪنھن) ماڻھو کي ڊيڄاريندڙ آھي.",
            "verse 74:37": "اوھان مان انھي لاءِ جيڪو گھري ته (بھشت) لاءِ اڳي وڌي يا (دوزخ ۾) پٺ تي رھي.",
            "verse 74:38": "سڀڪو جيءُ پنھنجي ڪئي ۾ ڳه پيل آھي.",
            "verse 74:39": "پر سڄي پاسي وارا (ڇٽل آھن).",
            "verse 74:40": "(بھشت جي) باغن ۾ ھوندا، گڏجي پڇندا.",
            "verse 74:41": "ڏوھارين کان.",
            "verse 74:42": "ته اوھان کي دوزخ ۾ ڪھڙي ڳالھ وڌو.",
            "verse 74:43": "چوندا ته نڪي نمازين مان ھواسون.",
            "verse 74:44": "۽ نڪي مسڪينن کي کارائيندا ھواسون.",
            "verse 74:45": "۽ بڪواتن سان گڏ بڪوات ڪندا ڪندا ھواسون.",
            "verse 74:46": "۽ بدلي جي ڏينھن کي ڪوڙ ڀانئيندا ھواسون.",
            "verse 74:47": "تان جو اسان کي موت پھتو.",
            "verse 74:48": "پوءِ کين پارت ڪندڙن جي پارت نفعو نه ڏيندي.",
            "verse 74:49": "پوءِ انھن کي ڇا (ٿيو) آھي جو نصيحت کان منھن موڙيندڙ (ٿيا) آھن.",
            "verse 74:50": "ڄڻ ته اُھي ٽھندڙ گڏھ آھن.",
            "verse 74:51": "جي شينھن کان ڀڳا ھجن.",
            "verse 74:52": "بلڪ منجھائن ھر ھڪ مڙس گھرندو آھي ته کيس (آسمان) مان کليل ڪتاب ڏجن.",
            "verse 74:53": "ائين نه آھي، بلڪ آخرت کان نه ٿا ڊڄن.",
            "verse 74:54": "سچ آھي ته بيشڪ قرآن ھڪ نصيحت آھي.",
            "verse 74:55": "پوءِ جيڪو گُھري سو اُن کي پڙھي.",
            "verse 74:56": "۽ الله جي گھر کانسواءِ (ان کي) ياد ڪري نه سگھندا آھن، (الله) اُھو آھي جنھن کان ڊڄڻ گھرجي ۽ اھو بخشش جو به مالڪ آھي."
        },
        "Sinhalese": {
            "verse 74:1": "අහෝ පොරවා ගෙන සිටින්නාණනි!",
            "verse 74:2": "නුඹ නැගී සිට, අවවාද කරනු.",
            "verse 74:3": "තවද නුඹගේ පරමාධිපතිව උත්කෘෂ්ට කරනු.",
            "verse 74:4": "තවද නුඹගේ වස්ත්‍රය පිරිසිදු කරනු.",
            "verse 74:5": "තවද කිලිට්ටෙන් වළකිනු.",
            "verse 74:6": "නුඹ අධික වශයෙන් ලබන්නට බලාපොරොත්තු වී උපකාර නොකරනු.",
            "verse 74:7": "තවද නුඹේ පරමාධිපති වෙනුවෙන් නුඹ ඉවසනු.",
            "verse 74:8": "හොරණෑවෙහි හඬ නිකුත් කරනු ලැබූ විට;",
            "verse 74:9": "එය දුෂ්කර දිනයක් වනු ඇත.",
            "verse 74:10": "දේවත්වය ප්‍රතික්ෂේප කරන්නන්ට එදින පහසු නොවනු ඇත.",
            "verse 74:11": "මා හා මා මැවූ අය නුඹ තනි ව අත හැර දමනු.",
            "verse 74:12": "තවද මම ඔහුට බොහෝ සේ ධනය ඇති කර දුනිමි.",
            "verse 74:13": "ඔහු සමඟ වන දරුවන් ද (ඇති කර දුනිමි.)",
            "verse 74:14": "තවද (සියල්ල) පහසු කරමින් මම ඔහුට දිගු හැර දුනිමි.",
            "verse 74:15": "පසු ව ද මම වැඩියෙන් දිය යුතු යැයි ඔහු ප්රිය කරන්නේය.",
            "verse 74:16": "එසේ නොව; නියත වශයෙන්ම ඔහු අපගේ වදන් වලට විරුද්ධ විය.",
            "verse 74:17": "ඔහුට දරුණු දඬුවමක් මම මතු පටවන්නෙමි.",
            "verse 74:18": "නියත වශයෙන්ම ඔහු කල්පනා කොට සැලසුම් යෙදුවේය.",
            "verse 74:19": "ඔහු විනාශ කරනු ලැබීය. ඔහු කෙසේ නම් සැලසුම් කළේද?",
            "verse 74:20": "පසු ව ද ඔහු විනාශ කරනු ලැබීය. ඔහු කෙසේ නම් සැලසුම් කළේද?",
            "verse 74:21": "පසු ව ඔහු අධීක්ෂණය කර බැලීය.",
            "verse 74:22": "පසු ව ඔහු රවා කිපුණේය.",
            "verse 74:23": "පසු ව ඔහු පිටු පා උඩඟු විය.",
            "verse 74:24": "එවිට මෙය දන්වනු ලැබූ හූනියමක් මිස නැත ඔහු පැවසුවේය.",
            "verse 74:25": "මෙය මිනිසාගේ ප්‍රකාශයක් මිස නැතැයි (ඔහු පැවසුවේය.)",
            "verse 74:26": "මම ඔහු සකර්(නම් නිරය)ට මතු ඇතුළත් කරමි.",
            "verse 74:27": "සකර් යනු කුමක්දැ?යි නුඹට දැනුම් දුන්නේ කුමක් ද?",
            "verse 74:28": "එය (කිසිවක්) ඉතිරි නොකරයි. තවද අත් හැර නොදමයි.",
            "verse 74:29": "සම දැඩි ලෙස දවාලන්නකි.",
            "verse 74:30": "ඒ මත දහනව දෙනෙකි.",
            "verse 74:31": "නිරයේ සගයින් ලෙස මලක්වරුන් මිස (වෙනත් අය) අපි පත් නොකළෙමු. දේවත්වය ප්‍රතික්ෂේප කළවුනට මොවුන්ගේ සංඛ්යාව පරීක්ෂණයක් ලෙසින් මිස අපි පත් නොකළෙමු. එය ධර්ම ග්‍රන්ථ දෙනු ලැබූවන් ස්ථාවරත්වයට පත් වනු පිණිසත්ය. තවද දෙවියන් කෙරෙහි විශ්වාසය තැබූවන්ගේ විශ්වාසය වර්ධනය කරනු පිණිසත් ධර්ම ග්‍රන්ථ දෙනු ලැබූවන් හා දෙවියන් කෙරෙහි විශ්වාසය තැබූවන් සැක නොකරනු පිණිසත්ය. එමෙන්ම \"මෙමගින් උපමාවක් ලෙසින් අල්ලාහ් අදහස් කරනුයේ කුමක්දැ\"යි තම සිත් තුළ රෝග ඇතිවුන් හා දෙවියන් ගැන ප්‍රතික්ෂේප කළවුන් පවසනු පිණිසත්ය. එලෙස අල්ලාහ් තමන් අභිමත කරන අය නොමග යවයි. තවද තමන් අභිමත කරන අයට මග පෙන්වයි. නුඹගේ පරමාධිපතිගේ සේනාව ගැන ඔහු හැර වෙනත් කිසිවෙක් නොදනී. මෙය මිනිසුනට මෙනෙහි කිරීමක් මිස නැත.",
            "verse 74:32": "එසේ නොව සඳු මත දිවුරමින්.",
            "verse 74:33": "රාත්‍රිය ගෙවී යන විට එය මත දිවුරමින්.",
            "verse 74:34": "අරුණෝදය උදා වන විට එය මත දිවුරමින්.",
            "verse 74:35": "නියත වශයෙන්ම එය (නිරය) බලවත් කරුණු අතරින් එකකි.",
            "verse 74:36": "මිනිසාට අනතුරු අඟවන්නක් වශයෙනි.",
            "verse 74:37": "එය නුඹලා අතුරින් පෙරට යාමට හෝ පසුබැස රැඳෙන්නට කැමති අය වෙනුවෙනි.",
            "verse 74:38": "සෑම ආත්මයක්ම තමන් උපයා ගත් දෑ වෙනුවෙන් ඇපකරුවෙකු ලෙස සිටින්නේය.",
            "verse 74:39": "නමුත් දකුණුපස ජනයා හැර.",
            "verse 74:40": "ඔවුන් ස්වර්ග උයන් මත සිට විමසති.",
            "verse 74:41": "වැරදි කරුවන්ගෙන්;",
            "verse 74:42": "\"නුඹලා ව සකර් තුළට ගෙන ආවේ කුමක්ද?\"",
            "verse 74:43": "\"අපි සලාත් ඉටු කරන්නන් අතුරින් නොවූයෙමු\" යැයි ඔවුහු පැවසූහ.",
            "verse 74:44": "තවද අපි දිළිඳුන්ට ආහාර සපයමින් නොසිටියෙමු.",
            "verse 74:45": "\"(නිෂ්ඵල කටයුතු වල) ගිලී සිටින්නන් සමග අපද ගිලී සිටියෙමු\".",
            "verse 74:46": "තවද අපි විනිශ්චය දිනය බොරු කරමින් සිටියෙමු.",
            "verse 74:47": "ස්ථීර දෑ (මරණය) අප වෙත පැමිණෙන තෙක්.",
            "verse 74:48": "එහෙයින් මැදිහත්වන්නන්ගේ මැදිහත්වීම ඔවුනට ඵලක් නොවන්නේය.",
            "verse 74:49": "එහෙයින් ඔවුනට කුමක් වී ද? ඔවුන් මෙනෙහි කිරීම පිටුදකින්නන්ය.",
            "verse 74:50": "ඔවුන් තැති ගත් බූරුවන් මෙනි.",
            "verse 74:51": "සිංහ ගොදුරින් පලා යන.",
            "verse 74:52": "එසේ නොව දිගු හරින ලද පත්‍රිකාවන් තමන්ට ද දෙනු ලැබිය යුතු යැයි ඔවුන් අතරින් සෑම කෙනෙකුම අපේක්ෂා කරනු ඇත.",
            "verse 74:53": "එසේ නොව ඔවුන් මතු ලොව පිළිබඳ බිය නොවෙති.",
            "verse 74:54": "එසේ නොව නියත වශයෙන්ම එය උපදෙසකි.",
            "verse 74:55": "එහෙයින් කවරෙකු අභිමත කරන්නේ ද ඔහු එයින් උපදෙස් ලබත්වා!",
            "verse 74:56": "අල්ලාහ් අභිමත කරන්නේ නම් මිස ඔවුහු උපදෙස් නොලබති. ඔහු බැතිමත්කම ලබන්නට සුදුස්සාය. එමෙන්ම සමාව දායාද කරන්නට ද සුදුස්සාය."
        },
        "Somali": {
            "verse 74:1": "(Nabiga) Isadadayow.",
            "verse 74:2": "Istaag oo dig.",
            "verse 74:3": "Eebahaana waynee.",
            "verse 74:4": "Dharkaagana daahiri.",
            "verse 74:5": "Xumuuntana ka hijroo (iyo Sanamyada).",
            "verse 74:6": "Hana ku mannaysan Adoo Badsan (waxaad Bixisay).",
            "verse 74:7": "Eebahaa Dartiisna u Samir.",
            "verse 74:8": "Marka Suurka (yiaame) la Afuufo.",
            "verse 74:9": "Maalintaasu waa maalin ku Daran.",
            "verse 74:10": "Gaalada oon u Fududayn.",
            "verse 74:11": "Isukaanna daa Aniga iyo kaan Abuuray isaga oo kaligiisa.",
            "verse 74:12": "Una yeelay Xoolo Badan.",
            "verse 74:13": "Iyo Wilaal Jooga oo «Darban».",
            "verse 74:14": "Aan una waasiciyay Risqiga.",
            "verse 74:15": "Oo haddana sii damci inaan u Badiyo.",
            "verse 74:16": "Saas ma aha, ee kaas wuxuu diiday Aayaadkannaga.",
            "verse 74:17": "Waxaana ku kalligi (Ku Dhibi) Cadaab daran.",
            "verse 74:18": "Gaalkaasu wuu Fikiray waxbuuna Goostay.",
            "verse 74:19": "Waxaana loo Lacnaday Siduu wax u goostay.",
            "verse 74:20": "Haddana waxaa loo Lacnaday siduu wax u goostay.",
            "verse 74:21": "Kadib wuxuu eebay (si uu Quraanka u wax yeeleeyo).",
            "verse 74:22": "Wuuna Waji Macbuusay oo Uruuriyay.",
            "verse 74:23": "Markaasuu jeedsaday oo is Kibriyay.",
            "verse 74:24": "Isagoo Dhihi quraankani ma aha waxaan sixir la soo Guuriyay ahayn.",
            "verse 74:25": "quraankani ma aha waxaan hadal Bashar ahayn.",
            "verse 74:26": "waxaannu galin kaas (Naarta) saqara.",
            "verse 74:27": "Ma taqaannaa Naarta Saqara.",
            "verse 74:28": "Hilib iyo laf midna ma Reebto.",
            "verse 74:29": "waxayna Doorisaa jidhka (oy Gubtaa).",
            "verse 74:30": "waxaana kor jooga (ka shaqeeya) sagaal iyo toban malag (ama saf).",
            "verse 74:31": "Ugama Aannaan yeelin naarta kuwa ka shaqeeya malaa'ig, tirana uma aannaan yeelin inay Gaaladu ku fidnoobaan Mooyeen, iyo inay yaqiin sadaan kuwa Kitaabka la siiyay, iyo inay kordhistaan kuwii xaqa Rumeeyay Iimaan, ayna shakiyiinna kuwii Kitaab- ka la siiyay iyo Mu'miniintu, iyo inay Dhahaan kuwa Qalbiga ka buka iyo Gaaladu Eebe muxuu uga Jeedaa Tusaalahan, saasaa Eebe u dhumiyaa Ruuxuu Doono, una Hanuuniyaa Ruuxuu Doono, wax og junuuda Eebe oon isaga Ahaynna ma jiro, waxaan la soo Sheegayna ma aha waano Dadka Mooyee.",
            "verse 74:32": "Waxaa sugan dayaxa ku Dhaartaye.",
            "verse 74:33": "Iyo Habeenku Markuu Jeedsado.",
            "verse 74:34": "Iyo Subaxu markuu iftiimo.",
            "verse 74:35": "Ee Naarta Saqara waa waxyaalaha waawayn Midkood (Balaayooyinka).",
            "verse 74:36": "Waana Digniinta Dadka.",
            "verse 74:37": "Ruuxii Doona inuu Hormaro, iyo Ruuxii Doona inuu dib dhaco, (waa Loodigay).",
            "verse 74:38": "Naf walba waxay u xidhantahay waxay Camal fashay.",
            "verse 74:39": "Hase yeeshee kuwa Midigta mari (Ehlu khayrka).",
            "verse 74:40": "Waxay gali Jannooyin, waxayna iswaydiin.",
            "verse 74:41": "Dambiilayaasha.",
            "verse 74:42": "Iyagoo ku dhihi Maxaa idin Galiyay Naarta saqara.",
            "verse 74:43": "Waxayna ugu Jawabi ka mid ma'aannaan ahayn kuwa Tukada.",
            "verse 74:44": "Mana aannaan ahayn kuwa Quudiya Miskiinka.",
            "verse 74:45": "Waxaana ahayn kuwa la dhumbada kuwa xumaanta Dumban.",
            "verse 74:46": "Waxaana ahayn kuwa beeniya Maalinta Abaalmarinta (Qiyaamada).",
            "verse 74:47": "Ilaa ay Dhabtu Nooga Timaado (Geeridu).",
            "verse 74:48": "Ma anfacayso kuwaas Shafeecada kuwa Shafeeca.",
            "verse 74:49": "Maxaase u sugnaaday iy waanada uga Jeedsadaan.",
            "verse 74:50": "ood u moodaa Dameero Diday.",
            "verse 74:51": "oo ka Cararay libaax.",
            "verse 74:52": "Haddana wuxuu dooni midkasta oo ka mida warqado Qoran (kitaab).",
            "verse 74:53": "Saas ma aha Ee kama yaabayaan Aakhiro.",
            "verse 74:54": "Waxaa sugan in Quraanku waana yahay.",
            "verse 74:55": "Ruuxii Doona yaana waantoobi.",
            "verse 74:56": "Mana Waantoobayaan in Eebe Doona Mooyee, Eebana wuxuu mutaa in laga Dhawrsado, wuxuuna Ehel u yahay inii Dambi Dhaafo."
        },
        "Spanish": {
            "verse 74:1": "Oh tú que te arropas!",
            "verse 74:2": "Levántate y advierte!",
            "verse 74:3": "Y a tu Señor engrandece.",
            "verse 74:4": "Y tu vestido purifícalo.",
            "verse 74:5": "De lo abominable aléjate.",
            "verse 74:6": "No des esperando recibir más.",
            "verse 74:7": "Y sé constante con tu Señor.",
            "verse 74:8": "Cuando se sople en el cuerno;",
            "verse 74:9": "ése será un día difícil,",
            "verse 74:10": "nada fácil para los incrédulos.",
            "verse 74:11": "Déjame con el que creé, solo.",
            "verse 74:12": "Y le di grandes riquezas.",
            "verse 74:13": "E hijos presentes.",
            "verse 74:14": "Le dimos de todo con holgura.",
            "verse 74:15": "Sin embargo él ambiciona aún más.",
            "verse 74:16": "Pero no! Se ha enfrentado a Nuestros signos.",
            "verse 74:17": "Le haré subir a Suud",
            "verse 74:18": "Ha reflexionado y ha meditado su respuesta.",
            "verse 74:19": "Muera! Pero cómo ha podido premeditar así?",
            "verse 74:20": "Que muera por cómo ha premeditado!",
            "verse 74:21": "Y después ha examinado.",
            "verse 74:22": "Y luego ha fruncido el ceño y se le ha mudado el semblante.",
            "verse 74:23": "Y luego ha dado la espalda y se ha llenado de soberbia.",
            "verse 74:24": "Y ha dicho: Esto no es mas que magia aprendida.",
            "verse 74:25": "Es sólo lo que dice un ser humano.",
            "verse 74:26": "Le haré entrar en Saqar.",
            "verse 74:27": "Y cómo sabrá qué es Saqar?",
            "verse 74:28": "No deja nada ni cesa.",
            "verse 74:29": "Abrasa la piel.",
            "verse 74:30": "Sobre él hay diecinueve.",
            "verse 74:31": "No hemos designado como encargados del Fuego sino a ángeles cuyo número hemos hecho una tribulación para los que se niegan a creer.Para que aquéllos a los que les fue dado el Libro tengan certeza y los que creen aumenten en creencia y para que los que recibieron el Libro y los creyentes no duden. Y para que los que tienen una enfermedad en el corazón y los incrédulos digan: Qué pretende Allah poniendo este ejemplo?Así es como Allah extravía a quien quiere y guía a quien quiere y sólo tu Señor conoce Sus ejércitos, que no son sino un recuerdo para el género humano.",
            "verse 74:32": "Pero no! Por la luna!",
            "verse 74:33": "Por la noche cuando retrocede!",
            "verse 74:34": "Por la mañana cuando brilla!",
            "verse 74:35": "Que es una de las grandes cosas que han de ocurrir.",
            "verse 74:36": "Advertencia para el género humano.",
            "verse 74:37": "Para quien de vosotros quiera adelantar o retrasar.",
            "verse 74:38": "Cada uno será rehén de lo que se ganó.",
            "verse 74:39": "Pero no así los compañeros de la derecha,",
            "verse 74:40": "que en jardines harán preguntas",
            "verse 74:41": "acerca de los que hicieron el mal.",
            "verse 74:42": "Qué os ha traído a Saqar?",
            "verse 74:43": "Dirán: No fuimos de los que rezaban",
            "verse 74:44": "ni de los que daban de comer al pobre.",
            "verse 74:45": "Y discutimos vanamente con los charlatanes,",
            "verse 74:46": "y negamos la verdad del día de la Retribución",
            "verse 74:47": "hasta que nos llegó la certeza.",
            "verse 74:48": "No les servirá de nada la intercesión de ningún intercesor.",
            "verse 74:49": "Qué les pasa que se apartan de aquello que les hace recordar",
            "verse 74:50": "como si fueran asnos espantados",
            "verse 74:51": "que huyen de un león?",
            "verse 74:52": "Sin embargo cada uno de sus hombres querría que les trajeras páginas abiertas.",
            "verse 74:53": "Pero no es eso, es que no tienen temor de la Otra Vida.",
            "verse 74:54": "Realmente es un Recuerdo.",
            "verse 74:55": "Y quien quiera recordará.",
            "verse 74:56": "Pero no recordaréis, excepto que Allah quiera; Él es el Digno de ser temido y el Digno de perdonar."
        },
        "Swahili": {
            "verse 74:1": "Ewe uliye jigubika!",
            "verse 74:2": "Simama uonye!",
            "verse 74:3": "Na Mola wako Mlezi mtukuze!",
            "verse 74:4": "Na nguo zako, zisafishe.",
            "verse 74:5": "Na yaliyo machafu yahame!",
            "verse 74:6": "Wala usitoe kwa kutaraji kuzidishiwa.",
            "verse 74:7": "Na kwa ajili ya Mola wako Mlezi, subiri!",
            "verse 74:8": "Basi litapo pulizwa barugumu,",
            "verse 74:9": "Siku hiyo, basi, itakuwa siku ngumu.",
            "verse 74:10": "Kwa makafiri haitakuwa nyepesi.",
            "verse 74:11": "Niache peke yangu na niliye muumba;",
            "verse 74:12": "Na nikamjaalia awe na mali mengi,",
            "verse 74:13": "Na wana wanao onekana,",
            "verse 74:14": "Na nikamtgenezea mambo vizuri kabisa.",
            "verse 74:15": "Kisha anatumai nimzidishie!",
            "verse 74:16": "Hasha! Kwani hakika yeye alikuwa akizifanyia inadi Aya zetu!",
            "verse 74:17": "Nitamtesa kwa mateso yasio wezekana.",
            "verse 74:18": "Kwani hakika yeye alifikiri na akapima.",
            "verse 74:19": "Basi ameangamia! Vipi alivyo pima!",
            "verse 74:20": "Tena ameangamia! Vipi alivyo pima!",
            "verse 74:21": "Kisha akatazama,",
            "verse 74:22": "Kisha akakunja kipaji, na akanuna.",
            "verse 74:23": "Kisha akaipa kisogo haki, na akatakabari.",
            "verse 74:24": "Na akasema: Haya si chochote ila ni uchawi ulio nukuliwa.",
            "verse 74:25": "Haya si chochote ila kauli ya binaadamu.",
            "verse 74:26": "Nitakuja mtia kwenye Moto wa Saqar.",
            "verse 74:27": "Na nini kitakujuulisha ni nini huo Moto wa Saqar?",
            "verse 74:28": "Haubakishi wala hausazi.",
            "verse 74:29": "Unababua ngozi iwe nyeusi.",
            "verse 74:30": "Juu yake wapo kumi na tisa.",
            "verse 74:31": "Na hatukuwafanya walinzi wa Motoni ila ni Malaika, wala hatukuifanya idadi yao hiyo ila kuwatatanisha walio kufuru, wapate kuwa na yakini walio pewa Kitabu, na wazidi Imani wale walio amini, wala wasiwe na shaka walio pewa Kitabu na Waumini, na wapate kusema wenye maradhi katika nyoyo zao na makafiri: Mwenyezi Mungu amekusudia nini kwa mfano huu? Ndio kama hivyo Mwenyezi Mungu humwacha apotee amtakaye, na humwongoa amtakaye. Na hapana yeyote anaye jua majeshi ya Mola wako Mlezi ila Yeye tu. Na haya si chochote ila ni ukumbusho kwa binaadamu.",
            "verse 74:32": "Hasha! Naapa kwa mwezi!",
            "verse 74:33": "Na kwa usiku unapo kucha!",
            "verse 74:34": "Na kwa asubuhi inapo pambazuka!",
            "verse 74:35": "Hakika huo Moto ni katika mambo yaliyo makubwa kabisa!",
            "verse 74:36": "Ni onyo kwa binaadamu,",
            "verse 74:37": "Kwa anaye taka miongoni mwenu kutangulia au kuchelewa.",
            "verse 74:38": "Kila nafsi imo rahanini kwa mabaya iliyo yachuma.",
            "verse 74:39": "Isipo kuwa watu wa kuliani.",
            "verse 74:40": "Hao watakuwa katika Mabustani, wawe wanaulizana",
            "verse 74:41": "Khabari za wakosefu:",
            "verse 74:42": "Ni nini kilicho kupelekeni Motoni?",
            "verse 74:43": "Waseme: Hatukuwa miongoni walio kuwa wakisali.",
            "verse 74:44": "Wala hatukuwa tukiwalisha masikini.",
            "verse 74:45": "Na tulikuwa tukizama pamoja na walio zama katika maovu.",
            "verse 74:46": "Na tulikuwa tukiikanusha siku ya malipo.",
            "verse 74:47": "Mpaka yakini ilipo tufikia.",
            "verse 74:48": "Basi hautawafaa kitu uombezi wa waombezi.",
            "verse 74:49": "Basi wana nini hata wanapuuza onyo hili?",
            "verse 74:50": "Kama kwamba wao ni mapunda walio timuliwa,",
            "verse 74:51": "Wanao mkimbia simba!",
            "verse 74:52": "Ati kila mmoja katika wao anataka apewe nyaraka zilizo funuliwa.",
            "verse 74:53": "Hasha! Kwani wao hawaiogopi Akhera?",
            "verse 74:54": "Hasha! Kwa hakika huu ni ukumbusho!",
            "verse 74:55": "Basi anaye taka atakumbuka.",
            "verse 74:56": "Na hawatakumbuka isipo kuwa Mwenyezi Mungu atake. Uchamngu ni kwake Yeye, na msamaha ni wake Yeye."
        },
        "Swedish": {
            "verse 74:1": "DU SOM sveper in dig [i din ensamhet]!",
            "verse 74:2": "Stå upp och varna!",
            "verse 74:3": "Och prisa din Herres majestät!",
            "verse 74:4": "Och rena ditt hjärta!",
            "verse 74:5": "Och fly från all hednisk smitta!",
            "verse 74:6": "[När du ger] ge inte för att få något tillbaka!",
            "verse 74:7": "Och ha tålamod och fördrag [med allt] för din Herres skull!",
            "verse 74:8": "När det blåses i basunen",
            "verse 74:9": "har en svår Dag randats",
            "verse 74:10": "för dem som [ständigt] förnekade sanningen, och ingen lättnad skall ges dem!",
            "verse 74:11": "LÄMNA åt Mig att [ta itu med] den som Jag har skapat ensam [i moderlivet]",
            "verse 74:12": "och gett stor rikedom",
            "verse 74:13": "och söner som står vid hans sida,",
            "verse 74:14": "och för vilken Jag har jämnat vägen [genom livet].",
            "verse 74:15": "Och som nu väntar sig att Jag skall ge honom ännu mer!",
            "verse 74:16": "Nej! Denne inbitne motståndare till Våra budskap,",
            "verse 74:17": "skall Jag låta utstå [ett straff tyngre än] klättringen uppför [en hal och brant bergvägg].",
            "verse 74:18": "Han tänker skarpt och överväger [hur han skall angripa dessa budskap] -",
            "verse 74:19": "måtte han förgås för dessa tankar,",
            "verse 74:20": "ja, måtte han förgås för dessa [onda] tankar. -",
            "verse 74:21": "Så ser han sig omkring,",
            "verse 74:22": "rynkar pannan och antar en bister uppsyn.",
            "verse 74:23": "Till sist vänder han sig bort med överlägsen min",
            "verse 74:24": "och säger: \"Det är bara vältalighet som bländar [åhöraren, ord] hämtade från [gamla sagor];",
            "verse 74:25": "människors ord och ingenting annat!\"",
            "verse 74:26": "Honom skall Jag låta brinna i helvetets eld!",
            "verse 74:27": "Och vad kan låta dig förstå vad helvetets eld betyder",
            "verse 74:28": "Den skonar ingen och förtär allt.",
            "verse 74:29": "I [dess lågor] förkolnar människans [hud].",
            "verse 74:30": "Nitton [väktare vakar] över den.",
            "verse 74:31": "Till Eldens väktare har Vi inte utsett andra än änglar, och Vi har enbart angett deras antal för att sätta dem som framhärdar i att förneka sanningen på prov, och att de som [i gångna tider] fick del av uppenbarelsen skall få visshet [om sanningen i denna Skrift], och att de som tror skall befästas i sin tro och att ingen tvekan skall finnas kvar hos dem som [tidigare] fick del av uppenbarelsen och hos de troende, och för att de vilkas sinne är sjukt [av tvivel] och förnekarna skall ställa sig frågan: \"Vad kan Gud ha velat säga med denna liknelse?\" Så låter Gud den Han vill gå vilse och så vägleder Han den Han vill. Och ingen känner [styrkan hos] Guds härskaror utom Han själv. Allt detta är enbart en påminnelse till människorna.",
            "verse 74:32": "NEJ, vid månen!",
            "verse 74:33": "Vid natten, när den viker;",
            "verse 74:34": "vid morgonrodnadens glöd!",
            "verse 74:35": "[Påminnelsen om domen och helveteselden] är förvisso ett av de mäktiga [varningstecknen]",
            "verse 74:36": "som varnar människorna,",
            "verse 74:37": "både dem av er som vill gå i främsta ledet och dem som [tvekar och] blir efter.",
            "verse 74:38": "Var och en skall ställas till svars för vad han har gjort",
            "verse 74:39": "utom de rättfärdiga som hör till den högra sidan",
            "verse 74:40": "[och som där de vilar] i [paradisets] lustgårdar, skall förhöra sig",
            "verse 74:41": "om [de dömda] syndarna [och fråga]:",
            "verse 74:42": "\"Vad förde er till helveteselden?\"",
            "verse 74:43": "De skall svara: \"Vi hörde inte till dem som bad",
            "verse 74:44": "och vi gav inte heller den nödställde att äta",
            "verse 74:45": "och vi ägnade oss med [andra] likasinnade åt tomt och respektlöst tal [om höga ting]",
            "verse 74:46": "och påstod att Domens dag var en lögn -",
            "verse 74:47": "till dess vi fick visshet.\"",
            "verse 74:48": "Då skall medlarnas förböner inte vara dem till någon nytta.",
            "verse 74:49": "HUR är det fatt med dem som vänder ryggen åt påminnelsen",
            "verse 74:50": "[De beter sig] som skrämda åsnor",
            "verse 74:51": "som flyr för ett lejon!",
            "verse 74:52": "Men [i stället för att lyssna till uppenbarelsen] begär de, var och en av dem, att få [en egen] lättförståelig Skrift!",
            "verse 74:53": "Nej! De [tror ju inte på räkenskap och dom] fruktar inte evigheten.",
            "verse 74:54": "Nej, detta är en påminnelse,",
            "verse 74:55": "och låt den som vill lägga den på minnet!",
            "verse 74:56": "Men de kommer inte att lägga den på minnet annat än om Gud vill. Det är Han som är värd att fruktas, Han ensam som förlåter synd."
        },
        "Tajik": {
            "verse 74:1": "Эй ҷома дар сар кашида,",
            "verse 74:2": "бархезу бим деҳ!",
            "verse 74:3": "Ва Парвардигоратро такбир гӯй!",
            "verse 74:4": "Ва ҷомаатро покиза дор!",
            "verse 74:5": "Ва аз палидӣ дурӣ ҷӯй!",
            "verse 74:6": "Ва чизе мадеҳ ки беш аз он умед дошта бошӣ.",
            "verse 74:7": "Барои Парвардигорат сабркунанда бош!",
            "verse 74:8": "Ва он гоҳ ки дар сур дамида шавад,",
            "verse 74:9": "он рӯз рӯзе сахт хоҳад буд,",
            "verse 74:10": "Ва барои кофирон душвор.",
            "verse 74:11": "Маро бо он ки танҳояш офаридаам, вогузор.",
            "verse 74:12": "Ӯро моле бисёр додам.",
            "verse 74:13": "Ва писароне ҳама дар назди ӯ ҳозир",
            "verse 74:14": "ва корҳои ӯро ба некӯтар тарзе вусъат додам.",
            "verse 74:15": "Он гоҳ тамаъ мебандад, ки зиёдат кунам.",
            "verse 74:16": "Не, не! Ӯ дар баробари оёти Мо ситеза ҷӯст.",
            "verse 74:17": "Ӯро ба машаққате меандозам.",
            "verse 74:18": "Ӯ андешид ва тарҳе афканд (нақшае кашид).",
            "verse 74:19": "Марг бар ӯ бод, чӣ гуна тарҳе афканд?",
            "verse 74:20": "Боз ҳам марг бар ӯ бод, чӣ гуна тарҳе афканд?",
            "verse 74:21": "Он гоҳ нигарист.",
            "verse 74:22": "Сипас рӯй турш кард ва пешонӣ дар ҳам кашид.",
            "verse 74:23": "Сипас рӯй гардониду гарданкашӣ кард,",
            "verse 74:24": "гуфт: «Ин ғайри ҷодуе, ки дигаронаш омӯхтанд, ҳеҷ нест.",
            "verse 74:25": "Ин ғайри сухани одамӣ ҳеҷ нест».",
            "verse 74:26": "Ба зудӣ ӯро ба сақар бияфканем.",
            "verse 74:27": "Чӣ чиз огоҳат сохт, ки сақар чист?",
            "verse 74:28": "На ҳеҷ боқӣ мегузорад ва на чизеро тарк кунад.",
            "verse 74:29": "Сӯзонандаи пӯст аст.",
            "verse 74:30": "Нуздаҳ фаришта бар он вазифадоранд.",
            "verse 74:31": "Вазифадорони дузахро фақат аз фариштагон қарор додем. Ва шумори онҳо фақат барои имтиҳони кофирон аст. То аҳли китоб яқин кунанд ва бар имони мӯъминон бияфзояд ва аҳли китобу мӯъминон шак накунанд. Ва то онон, ки дар дилҳояшон маразест, нагӯянд: «Худо аз ин мисол чӣ мехостааст?» Худо инчунин ҳар касро, ки бихоҳад, гумроҳ мекунад ва ҳар касро, ки бихоҳад, роҳ менамояд. Ва шумори лашкари Парвардигоратро ғайри Ӯ надонад. Ва ин сухан фақат панде аз барои мардум аст.",
            "verse 74:32": "Оре, савганд ба моҳ!",
            "verse 74:33": "Ва савганд ба шаб, чун рӯй ба рафтан орад",
            "verse 74:34": "ва савганд ба субҳ чун парда барафканад,",
            "verse 74:35": "ки ин яке аз ҳодисаҳои бузург аст.",
            "verse 74:36": "Тарсонандаи одамиён аст.",
            "verse 74:37": "Барои ҳар кас аз шумо, ки хоҳад, пеш ояд (бо амали нек) ё аз пай равад (бо куфру нофармонӣ).",
            "verse 74:38": "Ҳар кас гаравгони корест, ки кардааст,",
            "verse 74:39": "ғайри аҳли саъодат,",
            "verse 74:40": "ки дар биҳиштҳо нишастаанд ва мепурсанд",
            "verse 74:41": "аз гуноҳкорон,",
            "verse 74:42": "ки чӣ чиз шуморо ба ҷаҳаннам кашонид?,",
            "verse 74:43": "Мегӯянд: «Мо аз намозгузорон набудем",
            "verse 74:44": "ва ба дарвешон таъом намедодем",
            "verse 74:45": "ва бо онон, ки сухани ботил мегуфтанд, ҳамовоз мешудем",
            "verse 74:46": "ва рӯзи қиёматро дурӯғ мешуморидем,",
            "verse 74:47": "то марги мо фаро расид».",
            "verse 74:48": "Пас шафоъати шафоъаткунандагон фоидаашон набахшад.",
            "verse 74:49": "Чӣ шудааст, ки аз ин панд рӯй мегардонанд?",
            "verse 74:50": "Монанди харони рамида,",
            "verse 74:51": "ки аз шер мегурезанд,",
            "verse 74:52": "балки ҳар як аз онҳо мехоҳад, ки номаҳое ку шода ба ӯ дода шавад.",
            "verse 74:53": "Оре, ки аз охират наметарсанд.",
            "verse 74:54": "Оре, ки ин Қуръон пандест,",
            "verse 74:55": "ҳар ки хоҳад онро бихонад.",
            "verse 74:56": "Ва панд намегиранд, бе он ки Худо хоҳад. Ӯ шоёни он аст, ки аз Ӯ битарсанд. Ва ӯ шоёни бахшоидан аст!"
        },
        "Tamil": {
            "verse 74:1": "(போர்வை) போர்த்திக் கொண்டு இருப்பவரே!",
            "verse 74:2": "நீர் எழுந்து (மக்களுக்கு அச்சமூட்டி) எச்சரிக்கை செய்வீராக.",
            "verse 74:3": "மேலும், உம் இறைவனைப் பெருமைப் படுத்துவீராக.",
            "verse 74:4": "உம் ஆடைகளைத் தூய்மையாக ஆக்கி வைத்துக் கொள்வீராக.",
            "verse 74:5": "அன்றியும் அசுத்தத்தை வெறுத்து (ஒதுக்கி) விடுவீராக.",
            "verse 74:6": "(பிறருக்குக் கொடுப்பதையும் விட அவர்களிடமிருந்து) அதிமாகப் பொறும் (நோக்கோடு) உபகாரம் செய்யாதீர்.",
            "verse 74:7": "இன்னும், உம் இறைவனுக்காகப் பொறுமையுடன் இருப்பீராக.",
            "verse 74:8": "மேலும், எக்காளத்தில் ஊதப்படும்போது-",
            "verse 74:9": "அந்நாள் மிகக் கடினமான நாள் ஆகும்.",
            "verse 74:10": "காஃபிர்களுக்கு (அந்நாள்) இலேசானதல்ல.",
            "verse 74:11": "என்னையும், நான் தனித்தே படைத்தவனையும் விட்டுவிடும்.",
            "verse 74:12": "இன்னும் அவனுக்கு விசாலமாகப் பொருளையும் கொடுத்தேன்.",
            "verse 74:13": "அவனிடம் இருக்கிறவர்களாகவுள்ள புதல்வர்களையும் (கொடுத்தேன்).",
            "verse 74:14": "இன்னும் அவனுக்கு (வசதியான) தயாரிப்புகளை அவனுக்காகத் தயார் செய்தளித்தேன்.",
            "verse 74:15": "பின்னரும், அவனுக்கு(ச் செல்வங்களை) நான் அதிகமாக்க வேண்டுமென்று அவன் ஆசைப்படுகிறான்.",
            "verse 74:16": "அவ்வாறில்லை! நிச்சயமாக அவன் நம் வசனங்களுக்கு முரண்பட்டவனாகவே இருக்கின்றான்.",
            "verse 74:17": "விரைவிலேயே, அவனைக் கடினமான ஒரு சிகரத்தின் மேல் ஏற்றுவேன்.",
            "verse 74:18": "நிச்சயமாக அவன் (குர்ஆனுக்கு எதிராகச்) சிந்தித்து (ஒரு திட்டத்தை) ஏற்படுத்திக் கொண்டான்.",
            "verse 74:19": "அவன் அழிவானாக! எப்படி அவன் ஏற்படுத்திக் கொண்டான்?",
            "verse 74:20": "பின்னரும், அவன் அழிவானாக! எப்படி அவன் ஏற்படுத்திக் கொண்டான்?",
            "verse 74:21": "பிறகும் (குர்ஆனின் வசனங்களை) அவன் நோட்டமிட்டான்.",
            "verse 74:22": "பின்னர், (அதுபற்றிக் குறை கூற இயலாதவனாக) கடுகடுத்தான், இன்னும் (முகஞ்) சுளித்தான்.",
            "verse 74:23": "அதன் பின்னர் (சத்தியத்தை ஏற்காமல்) புறமுதுகு காட்டினான்; இன்னும் பெருமை கொண்டான்.",
            "verse 74:24": "அப்பால் அவன் கூறினான்: \"இது (பிறரிடமிருந்து கற்றுப்) பேசப்படும் சூனியமே அன்றி வேறில்லை.",
            "verse 74:25": "\"இது மனிதனின் சொல்லல்லாமலும் வேறில்லை\" (என்றும் கூறினான்.)",
            "verse 74:26": "அவனை நான் \"ஸகர்\" (என்னும்) நரகில் புகச் செய்வேன்.",
            "verse 74:27": "\"ஸகர்\" என்னவென்பதை உமக்கு எது விளக்கும்?",
            "verse 74:28": "அது (எவரையும்) மிச்சம் வைக்காது, விட்டு விடவும் செய்யாது.",
            "verse 74:29": "(அது சுட்டுக் கரித்து மனிதனின்) மேனியையே உருமாற்றி விடும்.",
            "verse 74:30": "அதன் மீது பத்தொன்பது (வானவர்கள் நியமிக்கப்பட்டு) இருக்கின்றனர்.",
            "verse 74:31": "அன்றியும், நரகக் காவலாளிகளை மலக்குகள் அல்லாமல் நாம் ஆக்கவில்லை, காஃபிர்களுக்கு அவர்களுடைய எண்ணிக்கையை ஒரு சோதனையாகவே ஆக்கினோம் - வேதம் கொடுக்கப்பட்டவர்கள் - உறுதிகொள்வதற்கும், ஈமான் கொண்டவர்கள், ஈமானை அதிகரித்துக் கொள்வதற்கும் வேதம் கொடுக்கப்பட்டவர்களும், முஃமின்களும் சந்தேகம் கொள்ளாமல் இருப்பதற்கும் (நாம் இவ்வாறு ஆக்கினோம்); எனினும் எவர்களுடைய இருதயங்களில் நோய் இருக்கிறதோ, அவர்களும் காஃபிர்களும்; \"அல்லாஹ் (பத்தொன்பது எனும் இந்த எண்ணிக்கையின்) உதாரணத்தைக் கொண்டு எ(ன்ன கருத்)தை நாடினான்?\" என கேட்பதற்காகவுமே (இவ்வாறு ஆக்கினோம்). இவ்வாறே அல்லாஹ் தான் நாடியவர்களை வழிகேட்டிலும் விடுகிறான், இன்னும் தான் நாடியவர்களை நேர்வழியிலும் செலுத்துகிறான், அன்றியும் உம்முடைய இறைவனின் படைகளை அவனைத் தவிர மற்றெவரும் அறிய மாட்டார்கள், (ஸகர் பற்றிய செய்தி) மனிதர்களுக்கு நினைவூட்டும் நல்லுபதேசமேயன்றி வேறில்லை.",
            "verse 74:32": "(ஸகர் என்னும் நரகு நிராகரிப்போர் கூறுவது போல்) அல்ல, இன்னும் சந்திரன் மீது சத்தியமாக.",
            "verse 74:33": "இரவின் மீதும் சத்தியமாக - அது பின்னோக்கிச் செல்லும் பொழுது.",
            "verse 74:34": "விடியற் காலையின் மீது சத்தியமாக - அது வெளிச்சமாகும் பொழுது,",
            "verse 74:35": "நிச்சயமாக அ(ந்த ஸகரான)து மிகப் பெரியவற்றுள் ஒன்றாகும்.",
            "verse 74:36": "(அது) மனிதர்களுக்கு அச்சமூட்டி எச்சரிக்கை செய்கின்றது-",
            "verse 74:37": "உங்களில் எவன் (அதை) முன்னோக்கியோ, அல்லது (அதிலிருந்து) பின்வாங்கியோ செல்ல விரும்புகிறானோ அவனை (அது எச்சரிக்கிறது).",
            "verse 74:38": "ஒவ்வொரு மனிதனும் தான் சம்பாதிப்பதற்குப் பிணையாக இருக்கின்றான்.",
            "verse 74:39": "வலக்கைப்புறத்துத் தோழர்களைத் தவிர",
            "verse 74:40": "(அவர்கள்) சுவர்க்கச் சோலைகளில் (இருப்பார்கள்; எனினும்) விசாரித்தும் கொள்வார்கள்-",
            "verse 74:41": "குற்றவாளிகளைக் குறித்து-",
            "verse 74:42": "\"உங்களை ஸகர் (நரகத்தில்) நுழைய வைத்தது எது?\" (என்று கேட்பார்கள்.)",
            "verse 74:43": "அவர்கள் (பதில்) கூறுவார்கள்; \"தொழுபவர்களில் நின்றும் நாங்கள் இருக்கவில்லை.",
            "verse 74:44": "\"அன்றியும், ஏழைகளுக்கு நாங்கள் உணவும் அளிக்கவில்லை.",
            "verse 74:45": "\"(வீணானவற்றில்) மூழ்கிக்கிடந்தோருடன், நாங்களும் மூழ்கிக்கிடந்தோம்.",
            "verse 74:46": "\"இந்த நியாயத் தீர்ப்பு நாளை நாங்கள் பொய்யாக்கிக் கொண்டும் இருந்தோம்.",
            "verse 74:47": "\"உறுதியான (மரணம்) எங்களிடம் வரும்வரையில் (இவ்வாறாக இருந்தோம்\" எனக் கூறுவர்).",
            "verse 74:48": "ஆகவே, சிபாரிசு செய்வோரின் எந்த சிபாரிசும் அவர்களுக்குப் பயனளிக்காது.",
            "verse 74:49": "நல்லுபதேசத்தை விட்டும் முகம் திருப்புகிறார்களே - இவர்களுக்கு என்ன நேர்ந்தது?",
            "verse 74:50": "அவர்கள் வெருண்டு ஓடும் காட்டுக்கழுதைகளைப் போல்-",
            "verse 74:51": "(அதுவும்) சிங்கத்தைக் கண்டு வெருண்டு ஓடும் (காட்டுக் கழுதை போல் இருக்கின்றனர்).",
            "verse 74:52": "ஆனால், அவர்களில் ஒவ்வொரு மனிதனும் விரிக்கப்பட்ட வேதங்கள் தனக்கும் கொடுக்கப்பட வேண்டும் என்று நாடுகிறான்.",
            "verse 74:53": "அவ்வாறில்லை: மறுமையைப் பற்றி அவர்கள் பயப்படவில்லை.",
            "verse 74:54": "அப்படியல்ல: நிச்சயமாக இது நல்லுபதேசமாகும்.",
            "verse 74:55": "(எனவே நல்லுபதேசம் பெற) எவர் விரும்புகிறாரோ அவர் இதை நினைவில் வைத்துக் கொள்ளட்டும்,",
            "verse 74:56": "இன்னும், அல்லாஹ் நாடினாலன்றி அவர்கள் நல்லுபதேசம் பெற முடியாது. அவனே (நம்) பயபக்திக்குரியவன், அவனே (நம்மை) மன்னிப்பதற்கும் உரிமையுடையவன்."
        },
        "Tatar": {
            "verse 74:1": "Ий тышкы киеме илә бөркәнгән пәйгамбәр!",
            "verse 74:2": "Торгыл, кешеләрне Аллаһ ґәзабы белән куркыт! Мухәммәд г-м җир белән күк арасында тәхеткә утырган Җәбраил фәрештәне күреп курыкты, тиз генә өенә кайтып ятты һәм Хәдиҗәгә тышкы киемнәре белән капларга кушты. Шул вакыт Җәбраил ошбу сүрәнен, аятьләрен китерә башлады. Бу сүрә икенче иңгән сүрәдер.",
            "verse 74:3": "Раббыңны зурлап тәкбир әйт.",
            "verse 74:4": "Вә киемеңне нәҗәсәттән пакь кыл.",
            "verse 74:5": "Аллаһуның ачуына илтә торган эшләрне ташла.",
            "verse 74:6": "Кешегә бернәрсә бирсәң аннан күбрәкне өмет итеп бирмә.",
            "verse 74:7": "Вә Раббың ризасы өчен кәферләрнең дошманлыгына сабыр ит, чыда!",
            "verse 74:8": "Әгәр кыямәт өчен сур өрелсә.",
            "verse 74:9": "Менә шул көн каты көндер.",
            "verse 74:10": "Кәферләргә җиңеллеге юк авыр көндер.",
            "verse 74:11": "Мин халык кылган бер кеше белән Мине ялгызымны гына куй.",
            "verse 74:12": "Мин аңа төрле-төрле күп мал бирдем.",
            "verse 74:13": "Вә үзе янында гына тора торган балалар бирдек, ягъни аталары бай булгач, балалары сәүдә белән китеп йөрмәделәр.",
            "verse 74:14": "Вә аңа тормышны никадәр киң кылу белән киң кылдым.",
            "verse 74:15": "Моның соңында да Минем аңа мал арттырмагымны өмет итәдер.",
            "verse 74:16": "Юк инде, Бездән яхшылык көтмәсен, тәхкыйк ул Безнең аятьләребезгә карыша иде.",
            "verse 74:17": "Аны бик мәшәкатьле булган ґәзабка кертермен. Ул Вәлид исемле бер бай мөшриктер, Мәккә мөшрикләре аңа киңәшкә килделәр һәм Коръән вә Мухәммәд хакында аның фикерен сорадылар. Вәлид әйтте: \"Сез Мухәммәдне дивана дисез, бу сүзегез һич дөрес түгел, аның гакыллы икәнлеге тирә-якка мәгълүмдер. Сез аны сихерче дисез, аның сихер белән шөгыльләнгәне һич заһир булганы юк. Сез аны ялганчы дисез, аның ялган сөйләгәнен бу көнгәчә һичкем ишеткәне юк, һәм аның сүзләре шагыйрь сүзенә дә охшамый\", – дип. Мөшрикләр: син нинди киңәш бирәсең, аңа ни дип әйтик, диделәр. Вәлид аларның сорауларына җавап бире алмыйча уйга калды.",
            "verse 74:18": "Тәхкыйк ул – Вәлид Коръән һәм пәйгамбәр хакында ничек мәкерлек кылырга дип фикерләде, үзенчә халыкларга сөйләргә ялган сүзләр дә хәзерләде.",
            "verse 74:19": "Вәлидкә ләгънәт булсын башы ватылсын – ничек чамалый!",
            "verse 74:20": "Ул һәлак булсын, халыкны хактан адаштырырга янә ничек чамалый!",
            "verse 74:21": "Соңра Коръәнгә каршы ничек мәкерлек кылырга дип, янә уйлап фикерләп карады.",
            "verse 74:22": "Соңра Коръән сүзен ишеткәндә ачуланып йөзен сытты, маңгаен җыерды.",
            "verse 74:23": "Аннары артына әйләнде вә тәкәбберләнде.",
            "verse 74:24": "Башка сүз таба алмагач, бу Коръән Аллаһ сүзе түгел мәгәр әүвәлге сихерчеләрдән калган сихер диде.",
            "verse 74:25": "Бу Коръән кеше сүзе генә, аны Мухәммәд әүвәлге сихерчеләрдән күчереп алган, диде.",
            "verse 74:26": "Тиздән аны сакар тәмугына салырмын.",
            "verse 74:27": "Сиңа ул сакарның ґәзабын кем белдерде?",
            "verse 74:28": "Ул сакар үзенә салынган нәрсәне калдырмас вә бетермичә куймас.",
            "verse 74:29": "Ул сакар кешеләрнең тиреләрен яндырыр.",
            "verse 74:30": "Ул сакарда унтугыз ґәзаб фәрештәләре бардыр. \"Мөшрикләр бу сүзне ишеткәч: \"Ґәзаб фәрештәләре унтугыз гына булгач без аларга каршы тора алырбыз, алар безне ґәзаб кыла алмаслар\", – диделәр.",
            "verse 74:31": "Ут ияләрен, ягъни җәһәннәмгә ґәзаб кылучыларны башка заттан кылмадык фәкать фәрештәләрдән кылдык, вә аларның саннарын унтугыз дип әйттек, фәкать кәферләргә фетнә булсын өчен, вә Инҗил, Тәүрат әһелләре Мухәммәд г-мнең хак пәйгамбәр икәнлегенә ышансыннар өчен. (Чөнки Тәүратта, Инҗилдә дә унтугыз дип зекер ителмештер). Вә мөэминнәр иманнарын куәтләсеннәр өчен, вә китап әһелләре һәм мөэминнәр: аларның саны унтугыз, дигән сүздән шикләнмәсеннәр өчен, вә күңелләрендә авыру булган монафикълар һәм кәферләр: \"Аллаһуның бу мисалны китерүдә максаты нәрсә\", – дип әйтсеннәр, ягъни бу сүз Аллаһ сүзенә охшамый, аны Аллаһ әйтмәгән, дип фетнәләнсеннәр өчен. Әнә шулай Аллаһ Аның хак сүзенә ышанган мөэминнәрен туры юлга күндерде. Раббыңның гаскәрләрен Аллаһудан башка һичкем белмәс, ул сакара җәһәннәме һәм унтугыз фәрештә бушка сөйләнмәде, мәгәр кешеләргә вәгазь өчен сөйләнде.",
            "verse 74:32": "Юк, алай гына түгел, ай белән ант итәмен.",
            "verse 74:33": "Вә көндездән соң килә торган төн белән.",
            "verse 74:34": "Һәм саргаючы таң белән ант итәмен.",
            "verse 74:35": "Тәхкыйк ул сакар җәһәннәме олугъ бәлаләрнең берседер.",
            "verse 74:36": "Ул кешеләрне куркытучыдыр.",
            "verse 74:37": "Вә Сезләрдән яхшы эшләрне эшләүдә алга -чыгарга теләгән кешеләргә һәм бозык эшләр белән артта калуны теләгән кешеләргә куркытудыр. Ягъни яхшы кешеләрне дә һәм яман кешеләрне дә куркытыр өчен сөйләнәдер сакар җәһәннәме.",
            "verse 74:38": "Аллаһуга итагать итмәгән һәрбер кеше үзенең кылган гөнаһы белән бәйләнгәндер.",
            "verse 74:39": "Мәгәр гамәл дәфтәрләре уң кулларыннан бирелгән күп сәваблы мөселманнар бәйләнмәсләр.",
            "verse 74:40": "Анар җәннәтләрдә булырлар, җәһәннәмгә кергән таныш кешеләрдән сорашырлар.",
            "verse 74:41": "Аллаһуга итагать итмәгән күп гөнаһлы кешеләрдән:",
            "verse 74:42": "\"Сезне сакар җәһәннәменә нәрсә салды, нинди сәбәп белән анда кердегез?\"",
            "verse 74:43": "Сакардагы кешеләр әйтерләр: \"Без намаз укучылардан түгел идек.",
            "verse 74:44": "Дәхи без фәкыйрьләрне ашатучылардан, аларга садака бирүчеләрдән булмадык.",
            "verse 74:45": "Дәхи хактан качып төрле бозык эшләргә чумган кешеләргә ияреп без дә бозыклыкка чумадыр идек.",
            "verse 74:46": "Һәм кыямәт көнен ялганга тотар идек.",
            "verse 74:47": "Бу әйтелгәннәрне эшләдек, хәтта гомеребез бетеп үлем килгәнче\", – дип.",
            "verse 74:48": "Аларга шәфкатьчеләрнең шәфәгате һич файда бирмәс.",
            "verse 74:49": "Нәрсә булган аларга, ни сәбәпле батылдан хакны аеручы Коръәннән баш тарталар?",
            "verse 74:50": "Алар Коръәннән вә аның вәгазьләреннән һәм хөкемнәреннән качалар, куркып өреккән ишәк кеби.",
            "verse 74:51": "Ул ишәк арысланнан өркеп качар.",
            "verse 74:52": "Бәлки алардан һәрбересе телидер Аллаһудан һәрберсенә ачык хат бирелмәкне. Ягъни мөшрикләр: \"Аллаһ безгә һәрберебезгә кәгазь иңдерсә, ул кәгазьгә: Мухәммәд хак пәйгамбәр, Коръән Минем китабым, дип язылган булса, иман китерер идек\", – диделәр.",
            "verse 74:53": "Юк әле, алар тиешсезне сорамасыннар, бәлки алар ахирәт ґәзабыннан курыкмыйлар. Әгәр курыксалар иде, әлбәттә, иман китереп Коръән белән гамәл кылыр иделәр һәм Коръәннән башка дәлил сорамас иделәр.",
            "verse 74:54": "Юк, Коръән уенчык түгел, бәлки ул Коръән гакыллы кешеләр өчен хакыйкый көчле вәгазьдер.",
            "verse 74:55": "Теләгән кеше ул Коръән белән вәгазьләнеп туры юлга керсен һәм иманлы динле булсын!",
            "verse 74:56": "Юк ул Коръән белән һәммә кеше вәгазьләнмәс мәгәр Аллаһ теләгән кеше генә вәгазьләнер. Димәк Коръән белән вәгазьләнеп һәм гамәл кылып туры юлны табуны Аллаһудан сорарга кирәк! Ул – Аллаһ Аның ачуыннан вә ґәзабыннан сакланырга тиешле булган заттыр һәм гөнаһларның ярлыкануын Аңардан сорарга тиешле заттыр."
        },
        "Telugu": {
            "verse 74:1": "ఓ దుప్పటిలో చుట్టుకున్నవాడా",
            "verse 74:2": "లే! ఇక హెచ్చరించు",
            "verse 74:3": "మరియు మీ ప్రభువు గొప్పతనాన్ని (ఘనతను) కొనియాడు (చాటి చెప్పు)",
            "verse 74:4": "మరియు నీ వస్త్రాలను పరిశుభ్రంగా ఉంచుకో",
            "verse 74:5": "మరియు మాలిన్యానికి దూరంగా ఉండు",
            "verse 74:6": "మరియు ఎక్కువ పొందాలనే ఆశతో ఇవ్వకు (ఉపకారం చేయకు)",
            "verse 74:7": "మరియు నీ ప్రభువు కొరకు సహనం వహించు",
            "verse 74:8": "మరియు బాకా (నాఖూర్) ఊదబడినప్పుడు",
            "verse 74:9": "ఆ దినం చాలా కఠినమైన దినమై ఉంటుంది",
            "verse 74:10": "సత్యతిరస్కారులకు అది సులభమైన (దినం) కాదు",
            "verse 74:11": "వదలండి! నన్నూ మరియు నేను ఒంటరిగా పుట్టించిన వానినీ",
            "verse 74:12": "మరియు నేను అతనికి పుష్కలంగా సంపదనిచ్చాను",
            "verse 74:13": "మరియు అతనికి తోడుగా ఉండే కుమారులను",
            "verse 74:14": "మరియు అతను కొరకు అతని జీవన సౌకర్యాలను సులభం చేశాను",
            "verse 74:15": "అయినా నేను అతనికి ఇంకా ఇవ్వాలని అతడు ఆశిస్తూ ఉంటాడు",
            "verse 74:16": "అలా కాదు! వాస్తవానికి అతడు మా (అల్లాహ్) సూచనల (ఆయాత్ ల) పట్ల విరోధం కలిగి వున్నాడు",
            "verse 74:17": "నేను త్వరలోనే అతనిని దుర్గమమైన స్థానానికి (శిక్షకు) నెట్టుతాను",
            "verse 74:18": "వాస్తవానికి, అతడు ఆలోచించాడు మరియు మనస్సులో ప్రణాళిక చేసుకున్నాడు",
            "verse 74:19": "కావున (అతనిని) తాను ప్రణాళిక చేసుకున్నట్లు నాశనానికి గురి కానివ్వండి",
            "verse 74:20": "అవును (అతనిని) తాను ప్రణాళిక చేసుకున్నట్లు, నాశనానికి గురి కానివ్వండి",
            "verse 74:21": "అప్పుడు అతడు ఆలోచించాడు",
            "verse 74:22": "తరువాత అతడు నుదరు చిట్లించుకున్నాడు మరియు కోపంతో చూశాడు (ముఖం మాడ్చుకున్నాడు)",
            "verse 74:23": "తరువాత అతడు వెనుకకు మరలి దురహంకారం చూపాడు",
            "verse 74:24": "అప్పుడు అతడు ఇలా అన్నాడు: ఇది పూర్వ నుండి వస్తూ వున్న ఒక మంత్రజాలం మాత్రమే",
            "verse 74:25": "ఇది కేవలం ఒక మానవ హక్కు మాత్రమే",
            "verse 74:26": "త్వరలోనే నేను అతనిని నరకాగ్నిలో కాల్చుతాను",
            "verse 74:27": "మరియు ఆ నరకాగ్ని అంటే నీవు ఏమనుకుంటున్నావు",
            "verse 74:28": "అది (ఎవరినీ) మిగల్చదు మరియు వదలి పెట్టదు",
            "verse 74:29": "అది మానవుణ్ణి (అతడి చర్మాన్నిదహించి వేస్తుంది)",
            "verse 74:30": "దానిపై పందొమ్మిది (దేవదూతలు నియమించబడి) ఉన్నారు",
            "verse 74:31": "మరియు మేము దేవదూతలను మాత్రమే నరకానికి రక్షకులుగా నియమించాము. మరియు మేము వారి సంఖ్యను (పందొమ్మిదిని), సత్యతిరస్కారులకు ఒక పరీక్షగా, గ్రంథ ప్రజలకు నమ్మకం కలగటానికి, విశ్వాసుల విశ్వాసాన్ని అధికం చేయటానికి మరియు గ్రంథ ప్రజలు మరియు విశ్వాసులు సందేహంలో పడకుండా ఉండటానికి మరియు తమ హృదయాలలో రోగమున్న వారు మరియు సత్యతిరస్కారులు: ఈ ఉపమానం ఇవ్వటంలో అల్లాహ్ ఉద్దేశమేమిటి?\" అని పలుకటానికి! ఈ విధంగా అల్లాహ్ తాను కోరిన వారిని మార్గభ్రష్టత్వంలో వదలుతాడు. మరియు తాను కోరిన వారికి మార్గదర్శకత్వం చేస్తాడు. మరియు నీ ప్రభూవు సైన్యాలను ఆయన తప్ప మరెవ్వరూ ఎరుగరు. మరియు ఇదంతా మానవునికి ఒక జ్ఞాపిక మాత్రమే",
            "verse 74:32": "అలా కాదు! చంద్రుని సాక్షిగా",
            "verse 74:33": "గడిచిపోయే రాత్రి సాక్షిగా",
            "verse 74:34": "ప్రకాశించే, ఉదయం సాక్షిగా",
            "verse 74:35": "నిశ్చయంగా, ఇది (ఈ నరకాగ్ని ప్రస్తావన) ఒక గొప్ప విషయం",
            "verse 74:36": "మానవునికి ఒక హెచ్చరిక",
            "verse 74:37": "మీలో ముందుకు రావాలని కోరుకునే వానికి లేదా వెనుక ఉండి పోయేవానికి",
            "verse 74:38": "ప్రతి మానవుడు తాను చేసిన కర్మలకు తాకట్టుగా ఉంటాడు",
            "verse 74:39": "కుడిపక్షం వారు తప్ప",
            "verse 74:40": "వారు స్వర్గాలలో ఉంటూ ఒకరినొకరు ఇలా ప్రశ్నించుకుంటారు",
            "verse 74:41": "అపరాధులను గురించి (మరియు వారితో అంటారు)",
            "verse 74:42": "మిమ్మల్ని ఏ విషయం నరకంలోకి ప్రవేశింపజేసింది",
            "verse 74:43": "వారు (నరకవాసులు) ఇలా జవాబిస్తారు: మేము నమాజ్ చేసే వాళ్ళం కాము",
            "verse 74:44": "మరియు నిరుపేదలకు ఆహారం పెట్టేవాళ్ళం కాము",
            "verse 74:45": "మరియు వృథా కాలక్షేపం చేసే వారితో కలిసి వ్యర్థ ప్రలాపాలు (ప్రసంగాలు) చేస్తూ ఉండే వాళ్ళము",
            "verse 74:46": "మరియు తీర్పుదినాన్ని అబద్ధమని నిరాకరిస్తూ ఉండేవాళ్ళము",
            "verse 74:47": "చివరకు ఆ అనివార్యమైన ఘడియ మాపై వచ్చి పడింది",
            "verse 74:48": "అప్పుడు సిఫారసు చేసేవారి సిఫారసు వారికి ఏ మాత్రం ఉపయోగపడదు",
            "verse 74:49": "అయితే, వారికేమయింది? ఈ హితోపదేశం నుండి వారెందుకు ముఖం త్రిప్పుకుంటున్నారు",
            "verse 74:50": "వారి స్థితి బెదిరిన అడవి గాడిదల మాదిరిగా ఉంది",
            "verse 74:51": "సింహం నుండి పారిపోయే (గాడిదల మాదిరిగా)",
            "verse 74:52": "అలా కాదు! వారిలో ప్రతి ఒక్క వ్యక్తి తనకు విప్పబడిన గ్రంథాలు ఇవ్వబడాలని కోరుతున్నాడు",
            "verse 74:53": "కాదు! కాదు! అసలు వారు పరలోక జీవితం గురించి భయపడటం లేదు",
            "verse 74:54": "అలా కాదు! నిశ్చయంగా, ఇది ఒక హితోపదేశం",
            "verse 74:55": "కావున కోరినవాడు దీని నుండి హితబోధ గ్రహించవచ్చు",
            "verse 74:56": "కాని అల్లాహ్ కోరితే తప్ప! వీరు దీని నుండి హితబోధ గ్రహించలేరు. ఆయనే (అల్లాహ్ యే) భయభక్తులకు అర్హుడు మరియు ఆయనే క్షమించే అర్హత గలవాడు"
        },
        "Thai": {
            "verse 74:1": "โอ้ผู้ห่มกายอยู่เอ๋ย !",
            "verse 74:2": "จงลุกขึ้น แล้วประกาศตักเตือน",
            "verse 74:3": "และแด่พระเจ้าของเจ้า จงให้ความเกียงไกร (ต่อพระองค์)",
            "verse 74:4": "และเสื้อผ้าของเจ้า จงทำให้สะอาด",
            "verse 74:5": "และสิ่งสกปรกก็จงหลบหลีกให้ห่างเสีย",
            "verse 74:6": "และอย่าทำคุณ เพื่อหวังการตอบแทนอันมากมาย",
            "verse 74:7": "และเพื่อพระเจ้าของเจ้าเท่านั้นจงอดทน",
            "verse 74:8": "ในที่สุด เมื่อเสียงเป่าถูกเป่าขึ้น",
            "verse 74:9": "นั่นคือ วันนั้น วันแห่งความยากลำบาก",
            "verse 74:10": "แก่บรรดาผู้ปฏิเสธศรัทธา มิใช่เป็นเรื่องง่าย",
            "verse 74:11": "จงปล่อยข้าไว้กับผู้ที่ข้าได้สร้างเขาไว้แต่ลำพังเถิด",
            "verse 74:12": "และข้าได้ทำให้เขามีทรัพย์สมบัติอย่างล้นเหลือ",
            "verse 74:13": "และลูกหลานอย่างพรั่งพร้อม",
            "verse 74:14": "และข้าได้ทำให้เขาสุขสบายอย่างราบรื่น",
            "verse 74:15": "แล้วเขายังโลภที่จะให้ข้าเพิ่มพูนแก่เขาอีก",
            "verse 74:16": "เปล่าเลย ! เพราะว่าเขาเป็นผู้ดื้อรั้นต่อสัญญาณต่าง ๆ ของเรา",
            "verse 74:17": "ในไม่ช้าข้าจะเพิ่มพูนความยากลำบากแก่เขา",
            "verse 74:18": "แท้จริงเขาได้ใคร่ครวญและคาดคะเน",
            "verse 74:19": "ดังนั้นเขาได้รับความหายนะ เขาจะคาดคะเนได้อย่างไร ?",
            "verse 74:20": "แล้วเขาได้รับความหายนะ เขาจะคาดคะเนได้อย่างไร ?",
            "verse 74:21": "แล้วเขาได้ตรึกตรอง",
            "verse 74:22": "แล้วเขาทำหน้าบูดบึ้ง และทำหน้านิ่วคิ้วขมวด",
            "verse 74:23": "แล้วเขาก็ผินหลังออกไป และหยิ่งผยอง",
            "verse 74:24": "แล้วเขากล่าวว่า นี่มิใช่อื่นนอกจากเป็นมายากลที่สืบทอดกันมา",
            "verse 74:25": "นี่มิใช่อื่นใดนอกจากเป็นคำพูดของปุถุชน",
            "verse 74:26": "ในไม่ช้าข้าจะโยนเขาเข้าสู่กองไฟที่เผาไหม้",
            "verse 74:27": "และอันใดเล่าทำให้เจ้ารู้ได้ว่า สิ่งที่เผาไหม้นั้นคืออะไร ?",
            "verse 74:28": "มันจะไม่เหลืออะไรเลย และมันจะไม่ปล่อยผู้ใดให้คงเหลือไว้ (เช่นกัน)",
            "verse 74:29": "มันจะเผาไหม้ผิวหนังจนเกรียมดำ",
            "verse 74:30": "เหนือมันมีมะลาอิกะฮฺสิบเก้าท่าน",
            "verse 74:31": "และเรามิได้แต่งตั้งผู้ใดเป็นยามเฝ้าประตูนรก นอกจากมะลาอิกะฮฺเท่านั้น และเรามิได้กำหนดจำนวนของพวกเขาไว้ เว้นแต่เพื่อเป็นการทดสอบแก่บรรดาผู้ปฏิเสธศรัทธา เพื่อบรรดาอะฮฺลุลกิตาบจะได้เชื่อมั่น และบรรดาผู้ศรัทธาจะได้เพิ่มพูนการศรัทธา และบรรดาอะฮฺลุลกิตาบรวมทั้งบรรดาผู้ศรัทธาจะไม่ต้องสงสัย และเพื่อบรรดาผู้ในหัวใจของพวกเขามีโรคอีกทั้งบรรดาผู้ปฏิเสธศรัทธาจะกล่าวว่า อัลลอฮฺทรงประสงค์อะไรด้วยอุปมานี้ เช่นนั้นแหละอัลลอฮฺจะทรงให้หลงทางผู้ที่พระองค์ทรงประสงค์ และจะทรงชี้แนะทางแก่ผู้ที่พระองค์ทรงประสงค์และไม่มีผู้ใดรู้จำนวนไพร่พลของพระเจ้าของเจ้านอกจากพระองค์ และนี่มิใช่อื่นใดนอกจากเป็นข้อตักเตือนแก่มนุษย์",
            "verse 74:32": "เปล่าเลย ขอสาบานด้วยดวงจันทร์",
            "verse 74:33": "ขอสาบานด้วยกลางคืนเมือมันคล้อยไป",
            "verse 74:34": "ขอสาบานด้วยยามเช้าเมื่อมันทอแสง",
            "verse 74:35": "แท้จริงนรกนั้นแน่นอนเป็นหนึ่งในความหายนะอันใหญ่หลวง",
            "verse 74:36": "เพื่อเป็นการเตือนสำทับแก่มนุษย์",
            "verse 74:37": "สำหรับผู้ที่ประสงค์ในหมู่พวกเจ้าจะรุดหน้า (ไปสู่ความดี) หรือจะรั้งท้าย (เพื่อกระทำความชั่ว)",
            "verse 74:38": "แต่ละชีวิตย่อมถูกค้ำประกันกับสิ่งที่มันขวนขวายไป",
            "verse 74:39": "ยกเว้นบรรดาผู้อยู่เบื้องขวา",
            "verse 74:40": "อยู่ในสวนสวรรค์หลากหลาย พวกเขาจะไต่ถามซึ่งกันและกัน",
            "verse 74:41": "เกี่ยวกับพวกที่กระทำความผิด",
            "verse 74:42": "อะไรที่นำพวกท่านเข้าสู่กองไฟที่เผาไหม้",
            "verse 74:43": "พวกเขากล่าวว่า เรามิได้อยู่ในหมู่ผู้ทำละหมาด",
            "verse 74:44": "เรามิได้ให้อาหารแก่บรรดาผู้ขัดสน",
            "verse 74:45": "และพวกเราเคยมั่วสุมอยู่กับพวกที่มั่วสุม",
            "verse 74:46": "และเราเคยปฏิเสธวันแห่งการตอบแทน",
            "verse 74:47": "จนกระทั่งความตายได้มาเยือนเรา",
            "verse 74:48": "ดังนั้นการชะฟาอะฮฺของบรรดาผู้มีชะฟาอะฮฺจะไม่เกิดประโยชน์อันใดแก่พวกเขา",
            "verse 74:49": "ดังนั้นเกิดอะไรขึ้นแก่พวกเขา โดยทีพวกเขาผินหลังออกห่างจากการเตือนสติ",
            "verse 74:50": "ประหนึ่งว่าพวกเขาเป็นลาเปรียวที่ตื่นตระหนก",
            "verse 74:51": "หนีจากเสือสิงห์",
            "verse 74:52": "แท้จริงแล้วทุกคนในหมู่พวกเขาต้องการที่จะมีแผ่นกระดาษกางแผ่ยืนมาให้แก่เขา",
            "verse 74:53": "ไม่เลยทีเดียว! ยิ่งไปกว่านั้นพวกเขายังไม่กลัววันปรโลกอีกด้วย",
            "verse 74:54": "เปล่ามิได้! แท้จริงนั่นคือข้อเตือนสติ",
            "verse 74:55": "ฉะนั้นผู้ใดประสงค์เขาก็จะจดจำรำลึกไว้",
            "verse 74:56": "และพวกเขาจะไม่จดจำรำลึกได้ เว้นแต่อัลลอฮฺจะทรงประสงค์ พระองค์เท่านั้นคือพระเจ้าแห่งการยำเกรงและพระเจ้าแห่งการให้อภัย"
        },
        "Turkish": {
            "verse 74:1": "Ey örtüye bürünen!",
            "verse 74:2": "Kalk da uyar.",
            "verse 74:3": "Rabbini yücelt.",
            "verse 74:4": "Giydiklerini temiz tut.",
            "verse 74:5": "Kötü şeyleri terke devam et.",
            "verse 74:6": "Yaptığın iyiliği çok görerek başa kakma.",
            "verse 74:7": "Rabbin için sabret.",
            "verse 74:8": "Sura üflendiği vakit, işte o gün, inkarcılara kolay olmayan zorlu bir gündür.",
            "verse 74:9": "Sura üflendiği vakit, işte o gün, inkarcılara kolay olmayan zorlu bir gündür.",
            "verse 74:10": "Sura üflendiği vakit, işte o gün, inkarcılara kolay olmayan zorlu bir gündür.",
            "verse 74:11": "Tek olarak yaratıp kendisine bol bol mal, çevresinde bulunan oğullar verdiğim ve nimetleri yaydıkça yaydığım o kimseyi Bana bırak.",
            "verse 74:12": "Tek olarak yaratıp kendisine bol bol mal, çevresinde bulunan oğullar verdiğim ve nimetleri yaydıkça yaydığım o kimseyi Bana bırak.",
            "verse 74:13": "Tek olarak yaratıp kendisine bol bol mal, çevresinde bulunan oğullar verdiğim ve nimetleri yaydıkça yaydığım o kimseyi Bana bırak.",
            "verse 74:14": "Tek olarak yaratıp kendisine bol bol mal, çevresinde bulunan oğullar verdiğim ve nimetleri yaydıkça yaydığım o kimseyi Bana bırak.",
            "verse 74:15": "Bir de verdiğim nimetten artırmamı umar;",
            "verse 74:16": "Hayır; hayır; çünkü o, Bizim ayetlerimize karşı son derece inatçıdır.",
            "verse 74:17": "Onu sarp bir yokuşa sardıracağım.",
            "verse 74:18": "Çünkü o, düşündü, ölçtü biçti;",
            "verse 74:19": "Canı çıkası, ne biçim ölçüp biçti!",
            "verse 74:20": "Canı çıkası; sonra yine ne biçim ölçüp biçti!",
            "verse 74:21": "Sonra baktı;",
            "verse 74:22": "Sonra kaşlarını çattı, suratını aştı;",
            "verse 74:23": "Sonra da sırt çevirip büyüklük tasladı.",
            "verse 74:24": "\"Bu sadece öğretilegelen bir sihirdir. Bu Kuran yalnızca bir insan sözüdür\" dedi.",
            "verse 74:25": "\"Bu sadece öğretilegelen bir sihirdir. Bu Kuran yalnızca bir insan sözüdür\" dedi.",
            "verse 74:26": "İşte bu adamı yakıcı bir ateşe yaslayacağım.",
            "verse 74:27": "Yakıcı ateşin ne olduğunu sen nerden bilirsin?",
            "verse 74:28": "O, ne geri bırakır ne de azabdan vazgeçer.",
            "verse 74:29": "İnsanın derisini kavurur;",
            "verse 74:30": "Orada ondokuz bekçi vardır.",
            "verse 74:31": "Cehennemin bekçilerini yalnız meleklerden kılmışızdır. Sayılarını bildirmekle de, ancak inkar edenlerin denenmesini ve kendilerine kitap verilenlerin kesin bilgi edinmesini ve inananların da imanlarının artmasını sağladık. Kendilerine kitap verilenler ve inananlar şüpheye düşmesinler. Kalblerinde hastalık bulunanlar ve inkarcılar: \"Allah bu misalle neyi muradetti?\" desinler. İşte Allah, böylece, dilediğini saptırır, dilediğini de doğru yola eriştirir. Rabbinin ordularını kendisinden başkası bilmez. Bu, insanoğluna bir öğütten ibarettir.",
            "verse 74:32": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:33": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:34": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:35": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:36": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:37": "Hayır, hayır öğüt almazlar. Aya, dönüp gelen geceye, ağarmakta olan sabaha and olsun ki, içinizden öne geçmek veya geri kalmak isteyen kimseye, insanoğlunu uyarıcı olarak anlatılan cehennem büyük olaylardan biridir.",
            "verse 74:38": "Herkes kazancına bağlı bir rehindir;",
            "verse 74:39": "Ancak, defteri sağdan verilenler böyle değildir; onlar cennettedirler. Suçlulara: \"Sizi bu yakıcı ateşe sürükleyen nedir?\" diye sorarlar.",
            "verse 74:40": "Ancak, defteri sağdan verilenler böyle değildir; onlar cennettedirler. Suçlulara: \"Sizi bu yakıcı ateşe sürükleyen nedir?\" diye sorarlar.",
            "verse 74:41": "Ancak, defteri sağdan verilenler böyle değildir; onlar cennettedirler. Suçlulara: \"Sizi bu yakıcı ateşe sürükleyen nedir?\" diye sorarlar.",
            "verse 74:42": "Ancak, defteri sağdan verilenler böyle değildir; onlar cennettedirler. Suçlulara: \"Sizi bu yakıcı ateşe sürükleyen nedir?\" diye sorarlar.",
            "verse 74:43": "Onlar derler ki: \"Namaz kılanlardan değildik.\"",
            "verse 74:44": "\"Düşkün kimseyi doyurmuyorduk.\"",
            "verse 74:45": "\"Batıla dalanlarla biz de dalardık.\"",
            "verse 74:46": "\"Ceza gününü yalanlardık.\"",
            "verse 74:47": "\"Ölüm bize o haldeyken geldi.\"",
            "verse 74:48": "Artık onlara, şefaatçilerin şefaati fayda vermez.",
            "verse 74:49": "Öyleyken, bunlara ne oluyor ki öğütten yüz çeviriyorlar?",
            "verse 74:50": "Aslandan ürkerek kaçan yabani merkeplere benzerler.",
            "verse 74:51": "Aslandan ürkerek kaçan yabani merkeplere benzerler.",
            "verse 74:52": "Hayır; her biri önüne açılıvermiş sahifeler verilmesini ister.",
            "verse 74:53": "Hayır; daha doğrusu ahiretten korkmazlar.",
            "verse 74:54": "Hayır; şüphesiz bu Kuran bir öğüttür.",
            "verse 74:55": "Dileyen kimse öğüt alır.",
            "verse 74:56": "Allah dilemeksizin öğüt alamazlar. O, kendisinden korkulmaya daha layıktır ve bağışlamaya daha ehildir."
        },
        "Urdu": {
            "verse 74:1": "اے (محمدﷺ) جو کپڑا لپیٹے پڑے ہو",
            "verse 74:2": "اُٹھو اور ہدایت کرو",
            "verse 74:3": "اور اپنے پروردگار کی بڑائی کرو",
            "verse 74:4": "اور اپنے کپڑوں کو پاک رکھو",
            "verse 74:5": "اور ناپاکی سے دور رہو",
            "verse 74:6": "اور (اس نیت سے) احسان نہ کرو کہ اس سے زیادہ کے طالب ہو",
            "verse 74:7": "اور اپنے پروردگار کے لئے صبر کرو",
            "verse 74:8": "جب صور پھونکا جائے گا",
            "verse 74:9": "وہ دن کا مشکل دن ہوگا",
            "verse 74:10": "(یعنی) کافروں پر آسان نہ ہوگا",
            "verse 74:11": "ہمیں اس شخص سے سمجھ لینے دو جس کو ہم نے اکیلا پیدا کیا",
            "verse 74:12": "اور مال کثیر دیا",
            "verse 74:13": "اور (ہر وقت اس کے پاس) حاضر رہنے والے بیٹے دیئے",
            "verse 74:14": "اور ہر طرح کے سامان میں وسعت دی",
            "verse 74:15": "ابھی خواہش رکھتا ہے کہ اور زیادہ دیں",
            "verse 74:16": "ایسا ہرگز نہیں ہوگا۔ یہ ہماری آیتیں کا دشمن رہا ہے",
            "verse 74:17": "ہم اسے صعود پر چڑھائیں گے",
            "verse 74:18": "اس نے فکر کیا اور تجویز کی",
            "verse 74:19": "یہ مارا جائے اس نے کیسی تجویز کی",
            "verse 74:20": "پھر یہ مارا جائے اس نے کیسی تجویز کی",
            "verse 74:21": "پھر تامل کیا",
            "verse 74:22": "پھر تیوری چڑھائی اور منہ بگاڑ لیا",
            "verse 74:23": "پھر پشت پھیر کر چلا اور (قبول حق سے) غرور کیا",
            "verse 74:24": "پھر کہنے لگا کہ یہ تو جادو ہے جو (اگلوں سے) منتقل ہوتا آیا ہے",
            "verse 74:25": "(پھر بولا) یہ (خدا کا کلام نہیں بلکہ) بشر کا کلام ہے",
            "verse 74:26": "ہم عنقریب اس کو سقر میں داخل کریں گے",
            "verse 74:27": "اور تم کیا سمجھے کہ سقر کیا ہے؟",
            "verse 74:28": "(وہ آگ ہے کہ) نہ باقی رکھے گی اور نہ چھوڑے گی",
            "verse 74:29": "اور بدن جھلس کر سیاہ کردے گی",
            "verse 74:30": "اس پر اُنیس داروغہ ہیں",
            "verse 74:31": "اور ہم نے دوزخ کے داروغہ فرشتے بنائے ہیں۔ اور ان کا شمار کافروں کی آزمائش کے لئے مقرر کیا ہے (اور) اس لئے کہ اہل کتاب یقین کریں اور مومنوں کا ایمان اور زیادہ ہو اور اہل کتاب اور مومن شک نہ لائیں۔ اور اس لئے کہ جن لوگوں کے دلوں میں (نفاق کا) مرض ہے اور (جو) کافر (ہیں) کہیں کہ اس مثال (کے بیان کرنے) سے خدا کا مقصد کیا ہے؟ اسی طرح خدا جس کو چاہتا ہے گمراہ کرتا ہے اور جس کو چاہتا ہے ہدایت کرتا ہے اور تمہارے پروردگار کے لشکروں کو اس کے سوا کوئی نہیں جانتا۔ اور یہ تو بنی آدم کے لئے نصیحت ہے",
            "verse 74:32": "ہاں ہاں (ہمیں) چاند کی قسم",
            "verse 74:33": "اور رات کی جب پیٹھ پھیرنے لگے",
            "verse 74:34": "اور صبح کی جب روشن ہو",
            "verse 74:35": "کہ وہ (آگ) ایک بہت بڑی (آفت) ہے",
            "verse 74:36": "(اور) بنی آدم کے لئے مؤجب خوف",
            "verse 74:37": "جو تم میں سے آگے بڑھنا چاہے یا پیچھے رہنا چاہے",
            "verse 74:38": "ہر شخص اپنے اعمال کے بدلے گرو ہے",
            "verse 74:39": "مگر داہنی طرف والے (نیک لوگ)",
            "verse 74:40": "(کہ) وہ باغہائے بہشت میں (ہوں گے اور) پوچھتے ہوں گے",
            "verse 74:41": "(یعنی آگ میں جلنے والے) گنہگاروں سے",
            "verse 74:42": "کہ تم دوزخ میں کیوں پڑے؟",
            "verse 74:43": "وہ جواب دیں گے کہ ہم نماز نہیں پڑھتے تھے",
            "verse 74:44": "اور نہ فقیروں کو کھانا کھلاتے تھے",
            "verse 74:45": "اور اہل باطل کے ساتھ مل کر (حق سے) انکار کرتے تھے",
            "verse 74:46": "اور روز جزا کو جھٹلاتے تھے",
            "verse 74:47": "یہاں تک کہ ہمیں موت آگئی",
            "verse 74:48": "(تو اس حال میں) سفارش کرنے والوں کی سفارش ان کے حق میں کچھ فائدہ نہ دے گی",
            "verse 74:49": "ان کو کیا ہوا ہے کہ نصیحت سے روگرداں ہو رہے ہیں",
            "verse 74:50": "گویا گدھے ہیں کہ بدک جاتے ہیں",
            "verse 74:51": "(یعنی) شیر سے ڈر کر بھاگ جاتے ہیں",
            "verse 74:52": "اصل یہ ہے کہ ان میں سے ہر شخص یہ چاہتا ہے کہ اس کے پاس کھلی ہوئی کتاب آئے",
            "verse 74:53": "ایسا ہرگز نہیں ہوگا۔ حقیقت یہ ہے کہ ان کو آخرت کا خوف ہی نہیں",
            "verse 74:54": "کچھ شک نہیں کہ یہ نصیحت ہے",
            "verse 74:55": "تو جو چاہے اسے یاد رکھے",
            "verse 74:56": "اور یاد بھی تب ہی رکھیں گے جب خدا چاہے۔ وہی ڈرنے کے لائق اور بخشش کا مالک ہے"
        },
        "Uyghur": {
            "verse 74:1": "ئى (ۋەھيى نازىل بولغان چاغدا) كىيىمگە چۈمكىلىۋالغۇچى (پەيغەمبەر!)",
            "verse 74:2": "تۇر! (ئىنسانلارنى) اﷲ ىڭ ئازابىدىن ئاگاھلاندۇر",
            "verse 74:3": "پەرۋەردىگارىڭنى ئۇلۇغلا",
            "verse 74:4": "كىيىمىڭنى پاك تۇت",
            "verse 74:5": "ئازابتىن (يەنى ئازابقا قالدۇرىدىغان ئىشلاردىن) يىراق بول",
            "verse 74:6": "كۆپ ئېلىش نىيىتىدە بەرمە (يەنى بىر كىشىگە بىرەر سوۋغا بەرسەڭ، ئۇنىڭدىن بەرگەن نەرسەڭدىن كۆپرەك نەرسە ئېلىشنى تەمە قىلما)،",
            "verse 74:7": "پەرۋەردىگارىڭنىڭ (رازىلىقى) ئۈچۈن (قەۋمىڭدىن يەتكەن ئەزىيەتكە) سەۋر قىل",
            "verse 74:8": "سۇر چېلىنغان ۋاقىت - ئۇ كۈن قىيىن كۈندۇر",
            "verse 74:9": "سۇر چېلىنغان ۋاقىت - ئۇ كۈن قىيىن كۈندۇر",
            "verse 74:10": "كاپىرلارغا ئاسان ئەمەستۇر",
            "verse 74:11": "(ئى مۇھەممەد!) مەن تەنھا ياراتقان كىشىنى (يەنى ۋەلىد ئىبن مۇغىرەنى) ماڭا قويۇۋەت",
            "verse 74:12": "ئۇنىڭغا نۇرغۇن مال بەردىم",
            "verse 74:13": "ئۇنىڭغا كۆز ئالدىدا تۇرىدىغان ئوغۇللارنى بەردىم",
            "verse 74:14": "ئۇنىڭ ئابرۇيىنى ئۆستۈردۈم",
            "verse 74:15": "ئاندىن ئۇ يەنە كۆپ بېرىشىمنى تەمە قىلىدۇ",
            "verse 74:16": "ياق، (يەنى ئۇنىڭ خالىغىنى بولمايدۇ)، چۈنكى ئۇ بىزنىڭ ئايەتلىرىمىزگە قارشى چىقتى",
            "verse 74:17": "ئۇنىڭغا قاتتىق ئازابىمنى تېتىتىمەن",
            "verse 74:18": "ئۇ (پەيغەمبەر ۋە قۇرئان ھەققىدە) ئويلاندى، (قۇرئان توغرۇلۇق نېمە دېيىشنى ۋە قانداق بوھتان قىلىشنى) پىلانلىدى",
            "verse 74:19": "لەنەت بولسۇنكى، ئۇ قانداق پىلانلىدى",
            "verse 74:20": "يەنە لەنەت بولسۇنكى، ئۇ قانداق پىلانلىدى",
            "verse 74:21": "ئاندىن ئۇ قارىدى،",
            "verse 74:22": "ئاندىن قوشۇمىسىنى تۈردى ۋە چىرايىنى پۈرۈشتۈردى،",
            "verse 74:23": "ئاندىن (ئىماندىن) يۈز ئۆرۈدى (پەيغەمبەرگە ئەگىشىشتىن) تەكەببۇرلۇق بىلەن باش تارتتى،",
            "verse 74:24": "«بۇ (كالامۇللاھ ئەمەس) پەقەت ئۆگىنىلگەن سېھىردۇر، بۇ پەقەت ئىنسان سۆزىدۇر» دېدى،",
            "verse 74:25": "«بۇ (كالامۇللاھ ئەمەس) پەقەت ئۆگىنىلگەن سېھىردۇر، بۇ پەقەت ئىنسان سۆزىدۇر» دېدى",
            "verse 74:26": "ئۇنى مەن سەقەرگە (يەنى دوزاخقا) سالىمەن",
            "verse 74:27": "سەقەرنىڭ نېمىلىكىنى قانداق بىلەلەيسەن؟",
            "verse 74:28": "ئۇ ھېچ نەرسىنى قالدۇرمايدۇ، قويمايدۇ (بەلكى كۆيدۈرۈپ تاشلايدۇ)",
            "verse 74:29": "ئۇ (چوڭلۇقىدىن) ئىنسانلارنىڭ (كۆزلىرىگە يىراق مۇساپىلەردىن) كۆرۈنۈپ تۇرىدۇ",
            "verse 74:30": "ئۇنىڭغا 19 پەرىشتە مۇئەككەلدۇر",
            "verse 74:31": "بىز دوزاخ مۇئەككەللىرىنى پەقەت پەرىشتىلەردىن قىلدۇق، بىز ئۇلارنىڭ سانى بىلەن پەقەت كاپىرلارنى سىنىدۇق، تاكى ئەھلى كىتاب (ئۆزلىرىنىڭ ساماۋى كىتابلىرىدىكى بۇ ساننى كۆرۈپ قۇرئاننىڭ ھەق ئىكەنلىكىگە) ئىمان ئېيتماي، مۆمىنلەرنىڭ (پەيغەمبەر ئەلەيھىسسالامنىڭ بەرگەن خەۋىرىگە ئىشەنگەنلىكلىرىدىن ۋە ئەھلى كىتابنىڭ قۇرئان خەۋەرلىرىنىڭ تەۋرات، ئىنجىلدىكى خەۋەرلەرگە ئۇيغۇن ئىكەنلىكىنى ئېتىراپ قىلغانلىقىدىن) ئىمانى كۈچەيگەي، ئەھلى كىتاب ۋە مۆمىنلەر (بۇنىڭدىن) شەكلەنمەيدۇ، دىللىرىدا كېسەل بارلار (يەنى مۇناپىقلار)، كاپىرلار: «بۇ مىسالدىن اﷲ نېمىنى ئىرادە قىلىدۇ» دەيدۇ، اﷲ مۇشۇنداق خالىغان ئادەمنى گۇمراھ قىلىدۇ، خالىغان ئادەمنى ھىدايەت قىلىدۇ، پەرۋەردىگارىڭنىڭ قوشۇنىنى (يەنى پەرىشتىلەرنىڭ سانىنىڭ كۆپلۈكىنى، ئۇلارنىڭ كۈچ - قۇۋۋىتىنى ۋە ئۇلارنىڭ يارىتىلىشتىكى چوڭلۇقىنى) پەقەت ئۇ ئۆزى بىلىدۇ، بۇ، (يەنى اﷲ بايان قىلغان دوزاخ) پەقەت ئىنسانلار ئۈچۈن ۋەز - نەسىھەتتۇر",
            "verse 74:32": "ياق (يەنى ئۇ مەسخىرە قىلغۇچىلار قەبىھ قىلمىشىدىن يانسۇن)، ئاي بىلەن قەسەمكى،",
            "verse 74:33": "ئۆتۈپ كەتكەن كېچە بىلەن قەسەمكى،",
            "verse 74:34": "يورۇغان سۈبھى بىلەن قەسەمكى،",
            "verse 74:35": "شۈبھىسىزكى، دوزاخ بالالاردىن بىرىدۇر (ئۇنى قانداقمۇ مەسخىرە قىلىسىلەر ۋە ئۇنىڭغا چىنپۈتمەيسىلەر؟)",
            "verse 74:36": "ئۇ ئىنسانلارنى ئاگاھلاندۇرغۇچىدۇر",
            "verse 74:37": "سىلەردىن (جەننەتكە) ئىلگىرىلەشنى خالىغان ياكى (دوزاختىن) چېكىنىشنى خالىغان ئادەمنى ئاگاھلاندۇرغۇچىدۇر",
            "verse 74:38": "ھەر ئىنسان قىلمىشلىرى تۈپەيلىدىن (دوزاختا) مەھبۇستۇر",
            "verse 74:39": "پەقەت ئەسھابى يەمىن (يەنى سائادەتمەن مۆمىنلەر) بۇنىڭدىن مۇستەسنا",
            "verse 74:40": "ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ",
            "verse 74:41": "ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ",
            "verse 74:42": "ئۇلار جەننەتلەردە بولۇپ، گۇناھكارلاردىن: «سىلەرنى دوزاخقا كىرگۈزگەن نېمە؟» دەپ سورايدۇ",
            "verse 74:43": "ئۇلار (جاۋابەن) ئېيتىدۇ: «بىز ناماز ئوقۇمىدۇق",
            "verse 74:44": "مىسكىنلەرگە تائام بەرمىدۇق",
            "verse 74:45": "بىز بىھۇدە سۆز قىلغۇچىلار بىلەن بىللە بىھودە سۆز قىلاتتۇق",
            "verse 74:46": "قىيامەت كۈنىنى ئىنكار قىلاتتۇق،",
            "verse 74:47": "تاكى بىز ئۆلگۈچە (شۇنداق قىلدۇق)»",
            "verse 74:48": "شاپائەت قىلغۇچىلارنىڭ شاپائىتى ئۇلارغا پايدا بەرمەيدۇ (يەنى ئۇلارنى اﷲ نىڭ ئازابىدىن قۇتقۇزىدىغان شاپائەتچى بولمايدۇ، ئۇلارغا پۈتۈن ئەھلى زېمىن شاپائەت قىلغان تەقدىردىمۇ، ئۇلارنىڭ شاپائىتى قوبۇل قىلىنمايدۇ)",
            "verse 74:49": "ئۇلار نېمىشقا ۋەز (يەنى قۇرئان) دىن يۈز ئۆرۈيدۇ",
            "verse 74:50": "گويا ئۇلار يولۋاستىن قاچقان ياۋايى ئېشەكلەردۇر (يەنى بۇ مۇشرىكلار مۇھەممەد ئەلەيھىسسالامنى كۆرگەندە، ئۇنىڭدىن خۇددى يولۋاسنى كۆرۈپ قاچقان ياۋا ئېشەكلەردەك قاچىدۇ)",
            "verse 74:51": "گويا ئۇلار يولۋاستىن قاچقان ياۋايى ئېشەكلەردۇر (يەنى بۇ مۇشرىكلار مۇھەممەد ئەلەيھىسسالامنى كۆرگەندە، ئۇنىڭدىن خۇددى يولۋاسنى كۆرۈپ قاچقان ياۋا ئېشەكلەردەك قاچىدۇ)",
            "verse 74:52": "بەلكى ئۇلاردىن ھەر كىشى ئۆزىگە ئوچۇق سەھىپىلەر بېرىلىشىنى خالايدۇ (يەنى ئۇلار اﷲ نىڭ مۇھەممەد ئەلەيھىسسالامغا نازىل قىلىنغان كىتابىدەك كىتاب نازىل قىلىنىشىنى تەمە قىلىدۇ)",
            "verse 74:53": "ياق (يەنى ئۇلار مۇنداق تەمەدىن يانسۇن). بەلكى ئۇلار (ئاخىرەتتىن) قورقمايدۇ",
            "verse 74:54": "ياق، مۇقەررەركى، ئۇ (يەنى قۇرئان) ۋەز - نەسىھەتتۇر (ئۇلار ئۆزلىرىنىڭ بەختىيار بولۇشىنى كۆزلەيدىغان بولسا، قۇرئان ئۇلارنىڭ ۋەز - نەسىھەت ئېلىشىغا يېتەرلىكتۇر)",
            "verse 74:55": "خالىغان ئادەم ئۇنىڭدىن ۋەز - نەسىھەت ئالىدۇ",
            "verse 74:56": "ئۇلار پەقەت خالىسا، ئاندىن ۋەز - نەسىھەت ئالىدۇ، اﷲ (بەندىلىرى) قورقۇشقا تېگىشلىك زاتتۇر، (بەندىلىرىنى) مەغپىرەت قىلىشقا لايىق زاتتۇر"
        },
        "Uzbek": {
            "verse 74:1": "Эй бурканиб ётган!",
            "verse 74:2": "Тур ва огоҳлантир!",
            "verse 74:3": "Ва Роббингни улуғла!",
            "verse 74:4": "Ва кийимингни покла!",
            "verse 74:5": "Ва азоб(сабабчиси)дан четлан!",
            "verse 74:6": "Ва кўп (иш)қилган бўлсанг ҳам, миннат қилма!",
            "verse 74:7": "Ва Роббинг учун сабр қил!",
            "verse 74:8": "Ва қачонки дудга пуфланса.",
            "verse 74:9": "Ўшал кун, қийин кундир.",
            "verse 74:10": "У кофирларга осон эмасдир.",
            "verse 74:11": "Мени, Ўзим якка яратган кимса бидан қўйиб қўй.",
            "verse 74:12": "Ва унга кўплаб молу дунё.",
            "verse 74:13": "Ва ҳозиру нозир фарзандлар бериб қўйдим.",
            "verse 74:14": "Ва унга (ҳамма нарсани) осонлаштириб қўйдим.",
            "verse 74:15": "Сўнгра, яна зиёда қилишимни тамаъ қиладир.",
            "verse 74:16": "Йўқ! Чунки, у Бизнинг оятларимизга саркаш эди.",
            "verse 74:17": "Тезда уни машаққатли чиқишла ҳоритарман.",
            "verse 74:18": "Албатта, у тафаккур қилди ва чамалаб кўрди.",
            "verse 74:19": "Лаънат бўлсин унга, қандоқ ҳам чамалаб кўрди!",
            "verse 74:20": "Сўнгра яна лаънат бўлсин унга, қандоқ ҳам чамалаб кўрди.",
            "verse 74:21": "Сўнгра назар солди.",
            "verse 74:22": "Сўнгра юзини буриштирди ва қавоғини солди.",
            "verse 74:23": "Сўнгра юз ўгирди ва такаббурлик қилди.",
            "verse 74:24": "Бас, бу асар қолган сеҳрдан ўзга ҳеч нарса эмас.",
            "verse 74:25": "Бу башар сўзидан ўзга ҳеч нарса эмас, деди.",
            "verse 74:26": "Тезда уни сақар (дўзахи)га киритаман.",
            "verse 74:27": "Ва сақар нималигини сенга нима билдирди?",
            "verse 74:28": "У (сақар) боқий қолдирмас ва тарк ҳам қилмас.",
            "verse 74:29": "У терини кўп куйдирувчидир.",
            "verse 74:30": "Унинг устида ўн тўққизта (фаришта) бордир.",
            "verse 74:31": "Дўзах соҳибларини фаришталардан қилганимиз ва уларнинг адади ҳам фақат кофирларни санаш учундир. Китоб берилганлар ишонч ҳосил қилишлари учундир. Ва иймонлиларнинг иймони зиёда бўлиши учундир. Китоб берилганлар ва мўминлар шак-шубҳа қилмасликлари учундир ва қалбларида касали бор(мунофиқ)лар ва кофирлар, Аллоҳ бу билан нима мисолни ирода қилмоқчи, дейишлари учундир. Шундоқ қилиб Аллоҳ хоҳлаган кимсани адаштирадир ва хоҳлаган кимсани ҳидоятга соладир. Роббингнинг аскарларини Ўзидан бошқа ҳеч ким билмайдир. Ва у (дўзах) башарият учун эслатмадан ўзга ҳеч нарса эмасдир.",
            "verse 74:32": "Йўқ! Ой билан қасам.",
            "verse 74:33": "Ва чекинаётган тун билан қасам.",
            "verse 74:34": "Ва ёришаётган тонг билан қасам.",
            "verse 74:35": "Албатта у(дўзах) улкан(азоб) ларнинг биридир.",
            "verse 74:36": "Башарият учун огоҳлантирувчидир.",
            "verse 74:37": "Сизлардан пешқадам бўлишни ёки ортда қолишни хоҳлаётган кимсалар учун ҳамдир.",
            "verse 74:38": "Ҳар бир шахс ўз касбининг гаровидир.",
            "verse 74:39": "Магар ўнг тараф соҳиблари мустаснодир.",
            "verse 74:40": "Улар жаннатларда сўрарлар.",
            "verse 74:41": "Гуноҳкорлардан.",
            "verse 74:42": "Сизларни дўзахга нима киритди?",
            "verse 74:43": "Улар: «Намоз ўқийдиганлардан бўлмаган эдик.",
            "verse 74:44": "Ва мискинларга таом бермаган эдик.",
            "verse 74:45": "Ва ботилга шунғувчилар билан бирга шўнғир эдик.",
            "verse 74:46": "Ва қиёмат куни ёлғонга чиқарган эдик.",
            "verse 74:47": "Токи бизга ўлим келгунича», дерлар.",
            "verse 74:48": "Бас, уларга шафоатчиларнинг шафоати манфаат бермас.",
            "verse 74:49": "Уларга не бўлдики, эслатмадан юз ўрирурлар?!",
            "verse 74:50": "Худди қаттиқ қўрққан эшаклар.",
            "verse 74:51": "Арслондан қочгани каби.",
            "verse 74:52": "Балки улардан ҳар бири ўзига нашр қилинган саҳифалар берилишини ирода қиладир.",
            "verse 74:53": "Йўқ! Балки улар охиратдан қўрқмаслар.",
            "verse 74:54": "Йўқ! Албатта у(Қуръон) эслатмадир.",
            "verse 74:55": "Бас, ким хоҳласа уни эслайдир.",
            "verse 74:56": "Ва фақат Аллоҳ хоҳласагина эслайдилар. У зот тақво аҳлидир ва мағфират аҳлидир."
        },
        "Vietnamese": {
            "verse 74:1": "Này hỡi người phủ áo choàng lên mình (Thiên Sứ Muhammad)!",
            "verse 74:2": "Ngươi hãy đứng dậy và đi cảnh báo (dân chúng về sự trừng phạt của Allah).",
            "verse 74:3": "Ngươi hãy tôn vinh Thượng Đế của Ngươi.",
            "verse 74:4": "Ngươi hãy làm sạch y phục của Ngươi.",
            "verse 74:5": "Ngươi hãy tránh xa việc thờ phượng các bục tượng.",
            "verse 74:6": "Ngươi đừng mong (Thượng Đế của Ngươi dành cho sự ưu ái) bởi việc Ngươi làm nhiều việc tốt.",
            "verse 74:7": "Ngươi hãy kiên nhẫn, chịu đựng vì Thượng Đế của Ngươi.",
            "verse 74:8": "Và khi Còi được thổi (trong lần thứ hai).",
            "verse 74:9": "Ngày đó sẽ là một Ngày khó khăn.",
            "verse 74:10": "Đối với những kẻ vô đức tin chắc chắn không dễ dàng.",
            "verse 74:11": "Ngươi hãy để mặc TA (xử trí) kẻ mà TA đã tạo ra (trần trụi và) một mình (trong bụng mẹ của y).",
            "verse 74:12": "Và TA đã ban phát cho y nguồn tài sản dồi dào.",
            "verse 74:13": "Và những đứa con trai luôn hiện diện bên cạnh.",
            "verse 74:14": "Và (TA) trải (mọi thứ) suôn sẻ cho y (trong cuộc sống).",
            "verse 74:15": "Rồi y còn tham muốn TA ban thêm nhiều hơn nữa.",
            "verse 74:16": "Không! Y quả thật là kẻ chống đối các Lời Mặc Khải của TA.",
            "verse 74:17": "TA sẽ làm cho y khốn đốn và gian khổ tột cùng.",
            "verse 74:18": "Y quả thật đã suy tính và mưu đồ.",
            "verse 74:19": "Nhưng dù y có suy tính và mưu đồ thế nào thì y cũng bị nguyền rủa và bị trừng phạt.",
            "verse 74:20": "Rồi cho dù y có suy tính và mưu đồ thế nào thì y cũng bị nguyền rủa và bị trừng phạt.",
            "verse 74:21": "Rồi y xem xét (lại một lần nữa).",
            "verse 74:22": "Rồi y nhíu mày, cau có.",
            "verse 74:23": "Sau đó, y quay lưng và ngạo mạn.",
            "verse 74:24": "Y nói: “Đây chỉ là trò ma thuật có nguồn gốc từ xưa.”",
            "verse 74:25": "“(Qur’an) này (không phải là lời của Thượng Đế mà) chỉ là lời của một người phàm tục.”",
            "verse 74:26": "TA sẽ nướng y trong Saqar (một trong những tầng cấp của Hỏa Ngục).",
            "verse 74:27": "Ngươi có biết Saqar là gì không?",
            "verse 74:28": "Nó không chừa cũng không bỏ sót (bất cứ kẻ tội lỗi nào).",
            "verse 74:29": "Nó đốt cháy và làm tróc hết các lớp da.",
            "verse 74:30": "Cai quản nó có mười chín (Thiên Thần).",
            "verse 74:31": "TA đã không tạo những vị canh giữ Hỏa Ngục ngoại trừ các Thiên Thần. Và TA đưa ra con số của họ như một sự thử thách cho những kẻ vô đức tin và để thuyết phục những ai đã được ban cấp Kinh Sách đồng thời để tăng thêm đức tin cho những người tin tưởng; và để cho những người được ban cho Kinh Sách và những người có đức tin không còn hoài nghi; và để cho những kẻ mang trong lòng chứng bệnh và những kẻ vô đức tin nói: “Allah muốn ngụ ý điều gì qua hình ảnh thí dụ này?” Như thế đó, Allah muốn làm lạc hướng kẻ nào là tùy ý Ngài và muốn hướng dẫn người nào cũng tùy ý Ngài. Và không một ai biết rõ binh lính của Thượng Đế của Ngươi ngoại trừ Ngài. Và (Hỏa Ngục) là một sự nhắc nhở dành cho nhân loại.",
            "verse 74:32": "Không, thề bởi mặt trăng.",
            "verse 74:33": "Thề bởi ban đêm khi nó ra đi.",
            "verse 74:34": "Thề bởi bình minh khi nó sáng tỏ.",
            "verse 74:35": "(Hỏa Ngục) quả thật là một đại họa.",
            "verse 74:36": "Một sự cảnh báo cho loài người.",
            "verse 74:37": "Cho bất cứ ai trong các ngươi muốn đi trước (bằng đức tin và các việc làm thiện tốt) hoặc muốn ở lại phía sau (bằng sự vô đức tin và tội lỗi).",
            "verse 74:38": "Mọi linh hồn đều phải trả giá cho những việc làm xấu của mình.",
            "verse 74:39": "Ngoại trừ những người của bên phải (những người có đức tin).",
            "verse 74:40": "(Họ sẽ ở) trong các Ngôi Vườn Thiên Đàng, họ sẽ hỏi nhau.",
            "verse 74:41": "Về những kẻ tội lỗi.",
            "verse 74:42": "“Điều gì đã đưa các người vào Saqar?”",
            "verse 74:43": "(Những kẻ tội lỗi) sẽ nói: “Chúng tôi đã không dâng lễ nguyện Salah.”",
            "verse 74:44": "“Chúng tôi đã không nuôi ăn người nghèo.”",
            "verse 74:45": "“Chúng tôi đã thường tham gia vào những cuộc trò chuyện vô ích với những kẻ nói chuyện phù phiếm, viển vông.”",
            "verse 74:46": "“Và chúng tôi đã phủ nhận Ngày Phán Xét Cuối Cùng.”",
            "verse 74:47": "“Cho tới khi điều kiên định (cái chết) đến với chúng tôi.”",
            "verse 74:48": "Vì vậy, sẽ không một sự can thiệp nào của những người can thiệp có thể giúp ích được chúng.",
            "verse 74:49": "Sao chúng quay lưng lại với Lời Nhắc Nhở (Qur’an), có vấn đề gì với chúng?",
            "verse 74:50": "Chúng quay lưng bỏ chạy tránh xa (Qur’an) giống như những con ngựa vằn hoảng sợ.",
            "verse 74:51": "Tháo chạy trước con sư tử.",
            "verse 74:52": "Đúng hơn, mỗi tên trong bọn chúng mong muốn rằng mình sẽ được trao cho những tờ kinh được trải ra.",
            "verse 74:53": "Không. Đúng hơn, chúng không sợ Ngày Sau.",
            "verse 74:54": "Không, (Qur’an) quả thật là một sự nhắc nhở.",
            "verse 74:55": "Vì vậy, ai muốn thì hãy ghi nhớ (Nó).",
            "verse 74:56": "Tuy nhiên, không ai ghi nhớ (Nó) ngoại trừ người nào Allah muốn. Quả thật, Ngài là Đấng đáng phải sợ và là Đấng Tha Thứ."
        },
        "Yoruba": {
            "verse 74:1": "Iwo oludasobora",
            "verse 74:2": "Dide ki o sekilo",
            "verse 74:3": "Oluwa re si ni ki o gbe titobi fun",
            "verse 74:4": "Aso re ni ki o fo mo",
            "verse 74:5": "Orisa ni ki o jinna si",
            "verse 74:6": "Ma se tore nitori ki o le ri pupo gba",
            "verse 74:7": "Oluwa re ni ki o se suuru fun",
            "verse 74:8": "Nigba ti won ba fon fere oniwo fun ajinde",
            "verse 74:9": "iyen, ni ojo yen, ni ojo inira",
            "verse 74:10": "ti ko nii rorun fun awon alaigbagbo",
            "verse 74:11": "Fi Mi da eni ti Mo da ni oun nikan",
            "verse 74:12": "Mo si fun un ni opolopo dukia",
            "verse 74:13": "ati awon omokunrin t’o n be pelu re",
            "verse 74:14": "Mo si se aye nirorun fun un gan-an",
            "verse 74:15": "Leyin naa, o tun n jerankan pe ki Ng se alekun",
            "verse 74:16": "Rara o! Dajudaju o je alatako si awon ayah Wa",
            "verse 74:17": "Emi yoo la iya ponkeponke bo o lorun (ninu Ina)",
            "verse 74:18": "Dajudaju o ronu (lodi nipa al-Ƙur’an). O si pinnu (oro kan ninu emi re)",
            "verse 74:19": "Won si sebi le e nipa bi o se pinnu",
            "verse 74:20": "Leyin naa, Won tun sebi le e nipa bi o se pinnu",
            "verse 74:21": "Leyin naa, o wo sun",
            "verse 74:22": "Leyin naa, o faju ro, o si diju magbari",
            "verse 74:23": "Leyin naa, o peyin da, o si segberaga",
            "verse 74:24": "O si wi pe: \"Ki ni eyi bi ko se idan atowodowo",
            "verse 74:25": "Ki ni eyi bi ko se oro abara",
            "verse 74:26": "Emi yoo fi sinu ina Saƙor",
            "verse 74:27": "Ki l’o mu o mo ohun t’o n je ina Saƙor",
            "verse 74:28": "(Saƙor) ko nii se e ku, ko si nii pa a ti",
            "verse 74:29": "O maa jo awo ara di dudu",
            "verse 74:30": "(Awon molaika) mokandinlogun ni eso re",
            "verse 74:31": "Awa ko se eni kan ni eso Ina afi awon molaika. Awa ko si se onka won (bee) bi ko se (nitori ki o le je) adanwo fun awon t’o sai gbagbo, ati nitori ki awon ti A fun ni Tira le ni amodaju ati nitori ki awon ti won gbagbo ni ododo le lekun ni igbagbo ododo. (O ri bee) nitori ki awon ti A fun ni Tira ati awon onigbagbo ododo ma baa seyemeji ati nitori ki awon ti arun wa ninu okan won ati awon alaigbagbo le wi pe: \"Ki ni Allahu gba lero pelu apejuwe yii?\" Bayen ni Allahu se n si eni ti O ba fe lona, O si n to eni ti O ba fe sona. Ko si si eni ti o mo awon omo ogun Oluwa re afi Oun naa. (Ina Saƙor) ko si je kini kan bi ko se iranti fun abara",
            "verse 74:32": "E gbo! Allahu bura pelu osupa",
            "verse 74:33": "O tun bura pelu ale nigba ti o ba lo",
            "verse 74:34": "O tun bura pelu owuro nigba ti ojumo ba mo",
            "verse 74:35": "Dajudaju (ina Saƙor) ni okan ninu (awon adanwo) t’o tobi",
            "verse 74:36": "(O je) ikilo fun abara",
            "verse 74:37": "Fun eni ti o ba fe ninu yin lati te siwaju tabi lati fa seyin",
            "verse 74:38": "Emi kookan ni oniduuro fun ohun t’o se nise",
            "verse 74:39": "Ayafi awon ero owo otun",
            "verse 74:40": "Won yoo maa bira won leere oro ninu awon Ogba Idera",
            "verse 74:41": "nipa awon elese pe",
            "verse 74:42": "Ki ni o mu yin wo inu ina Saƙor",
            "verse 74:43": "Won yoo wi pe: \"Awa ko si ninu awon olukirun ni",
            "verse 74:44": "Awa ko si si ninu awon t’o n bo awon mekunnu",
            "verse 74:45": "Awa si maa n so isokuso pelu awon onisokuso",
            "verse 74:46": "Ati pe awa maa n pe Ojo esan niro",
            "verse 74:47": "titi iku fi de ba wa",
            "verse 74:48": "Ipe awon olusipe ko si nii se won ni anfaani",
            "verse 74:49": "Ki lo mu won na ti won n gbunri kuro nibi iranti",
            "verse 74:50": "bi eni pe awon ni ketekete t’o n sa lo",
            "verse 74:51": "t’o sa fun kinihun",
            "verse 74:52": "Rara, nse ni enikookan ninu won n fe ki A fun oun naa ni Tira ti o maa see te han awon eniyan (bii ti al-Ƙur’an)",
            "verse 74:53": "Rara. Won ko paya orun ni",
            "verse 74:54": "E gbo! Dajudaju al-Ƙur’an ni iranti",
            "verse 74:55": "Nitori naa, eni ti o ba fe ko ranti re",
            "verse 74:56": "Won ko si nii ranti (al-Ƙur’an) afi ti Allahu ba fe. (Allahu) Oun l’a gbodo beru. Oun l’o si laforijin"
        }
    }
}