{
    "id": 76,
    "name_simple": "Al-Insan",
    "revelation_place": "madinah",
    "revelation_order": 98,
    "bismillah_pre": true,
    "verses_count": 31,
    "short_text": "This Surah is called Ad-Dahr as well as Al-Insan after the words occurring in the first verse.",
    "text": [
        "\n",
        "This Surah is called Ad-Dahr as well as Al-Insan after the words occurring in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Most of the commentators, including Allama Zamakhshari, Imam Razi, Qadi, Baidawi, Allama Nizam ad-Din Nisaburi, Hafiz Ibn Kathir and many others, regard it as a Makki Surah, and, according to Allama Alusi, the same is the opinion of the majority of scholars. However, some commentators hold the view that the Surah was revealed at Madinah, and some others say that it was revealed at Makkah but vv. 8-10 of it were sent down at Madinah.",
        "\n",
        "As far as the subject matter and the style of the Surah are concerned, these are very different from those of the Madani Surahs. A little study of it rather shown that it is not only a Makki Surah but it was revealed during the earliest period at Makkah, which began just after the revelation of the first seven verses of Surah Al-Muddaththir. As for vv. 8-10, they are so naturally set in the theme of the Surah that if they are read in their proper context, no one can say that the theme preceding and following them had been sent down 15 to 16 years earlier but these three verses which were revealed many years later were inserted here unnaturally.",
        "\n",
        "In fact, the basis of the idea that this Surah; or some verses of it were revealed at Madinah, is a tradition which has related from Ibn Abbas (may Allah bless him). He says that once Hadrat Hasan and Husain fell ill The Holy Prophet and some of his Companions visited them. They wished Hadrat Ali to make a vow to Allah for the recovery of the two children. Thereupon, Hadrat Ali, Hadrat Fatimah and Fiddah their maid servant, vowed a fast of three days if Allah restored the children to health. The children recovered by the grace of Allah and the three of them began to fast as avowed. As there was nothing to eat in the house, Hadrat Ali borrowed three measures (sa') of barley from somebody (according to another tradition, earned through labor). When on the first day they sat down to eat after breaking the fast, a poor man came and begged for food. They gave all their food to him, drank water and retired to bed. The next day when they again sat down to eat after breaking the fast,\r\nan orphan came and begged for something. They again gave away the whole food to him, drank water and went to bed. On the third day when they were just going to eat after breaking the fast, a captive came up and begged for food likewise. Again the whole food was given away to him. On the fourth day Hadrat Ali took both the children with him and went before the Holy Prophet (upon whom be peace). The Holy Prophet (on whom be peace) seeing the weak condition of the three, returned with them to the house of Hadrat Fatimah and found her lying in a corner half dead with hunger. This moved him visibly. In the meantime the Angel Gabriel (peace be on him) came and said; \"Look, Allah has congratulated you on the virtues of the people of your house!\"When the Holy Prophet asked what it was, he recited this whole Surah in response. (According to Ibn Mahran's tradition, he recited it from verse 5 till the end. But the tradition which Ibn Marduyah has related from Ibn Abbas only says that the\r\nverse Wa yut'imun-at ta'am... was sent down concerning Hadrat Ali and Hadrat Fatimah; there is no mention of this story in it). This whole story has been narrated by Ali bin Ahmad al-Wahidi in his Commentary of the Qur'an, entitled Al'Basit, and probably from the same it has been taken by Zamakhshari, Razi, Nisaburi and others.",
        "\n",
        "In the first place, this tradition is very weak as regards its chain of transmission. Then, from the point of view of its subject matter also, it is strange that when a poor man, or an orphan, or a captive, comes to beg for food, he is given all the food. He could be given one member's food and the five of them could share the rest of it among themselves:Then this also is incredible that illustrious persons like Hadrat Ali and Hadrat Fatimah, who possessed perfect knowledge of Islam, should have regarded it as an act of virtue to keep the two children, who had just recovered their health and were still weak, hungry for three consecutive days. Moreover, in respect of the captives also, it has never been a practice under the Islamic government that they should be left to beg for food for themselves. For if they were prisoners of the government, the government itself was responsible to arrange food and clothing for them, and if they were in an individual's custody, he was made\r\nresponsible to feed and clothe them. Therefore, it was not possible that in Madinah a captive should have gone about begging food from door to door. However, overlooking the weaknesses of transmission and the probability of subject matter, even if the narrative is accepted as it goes, at the most what it shows is that when the people of the Holy Prophet's house acted righteously as they did, Gabriel came and gave him the good news that Allah had much appreciated their act of virtue, for they had acted precisely in the righteous way that Allah had commanded in these verses of Surah Ad-Dahr. This does not necessitate that these verses too were sent down on that very occasion. The same is the case with many traditions concerning the occasion of revelation. When about a certain verse it is said that it was sent down on a particular occasion, it in fact does not mean that the verse was sent down on the very occasion the incident took place. But it means that the verse applies precisely\r\nand exactly to the incident. Imam Suyuti in Al-Itqan has quoted this from Hafiz Ibn Taimiyyah: \"When the reporters say that a verse was sent down concerning a particular incident, it sometimes implies that the same incident (or matter) occasioned its revelation, and sometimes that the verse applies to the matter although it may not have occasioned its revelation.\"Further on he quotes Imam Badr ad-Din Zarkashi's view from his Al-Burhan fi Ulum al-Quran :\"It is well known in respect of the Companions and their immediate successors that when one of them says that a verse was sent down concerning a particular matter, it means that the ruling contained in it applied to that matter and not that the matter itself occasioned the revelation of the verse. Thus, it only uses the ruling of the verse for the purpose of reasoning and not for stating a fact.\" (Al-Itqan fi Ulum al-Quran, vol. I, p. 31, Ed. 1929).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of this Surah is to inform man of his true position in the world and to tell him that if he understood his true position rightly and adopted the attitude of gratefulness, he would meet with such and such good end, and if he adopted the way of disbelief, he would meet with such and such evil ends In the longer Surahs of the Qur'an this same theme has been presented at length, but a special characteristic of the style of the earliest Surahs revealed at Makkah is that the subjects dealt with at length in the later period, \"have been presented in a brief but highly effective way in this period in such concise, elegant sentences as may automatically be preserved in the memory of the hearers.",
        "\n",
        "In this Surah, first of all man has been reminded that there was a time when he was nothing; then a humble beginning of him was made with a mixed drop of sperm and ovum of which even his mother was not aware; even she did not know that he had been conceived nor anyone else seeing the microscopic cell could say that it was a man, who in future would become the best of creation on the earth. After this, man has been warned, so as to say: \"Beginning your creation in this way We have developed and shaped you into what you are today in order to test and try you in the world. That is why, unlike other creatures, you were made intelligent and sensible and were shown both the way of gratitude and the way of ingratitude clearly so that you may show, in the interval that you have been granted here for work, whether you have emerged as a grateful servant from the test or an unbelieving, Un- grateful wretch!\"",
        "\n",
        "Then, just in one sentence, it has been stated decisively what will be the fate to be met with in the Hereafter by those who emerged as unbelievers from this test.",
        "\n",
        "After this, in vv. 5-22 continuously, the blessings with which those who do full justice to servitude in the world, will be favored, have been mentioned in full detail. In these verses, not only have their best rewards been mentioned but they have also been told briefly what are the acts on the basis of which they would become worthy of those rewards. Another special characteristic of the earliest Surahs revealed at Makkah is that besides introducing in them briefly the fundamental beliefs and concepts of Islam, here and there, those moral qualities and virtuous acts have been mentioned, which are praiseworthy according to Islam, and also those evils of deed and morality of which Islam strives to cleanse human life. And these two things have not been mentioned with a view to show what good or evil result is entailed by them in the transitory life of the world, but they have been mentioned only to point out what enduring results they will produce in the eternal and everlasting\r\nlife of the Hereafter, irrespective of whether an evil quality may prove useful or a good quality may prove harmful in the world.",
        "\n",
        "This is the subject matter of the first section (vv. 1-22). In the second section, addressing the Holy Prophet (upon whom be peace), three things have been stated: first, that \"it is in fact We Ourself Who are revealing this Qur'an piecemeal to you, and this is intended to inform the disbelievers, not you, that the Qur'an is not being fabricated by Muhammad (upon whom be Allah's peace and blessings) but it is \"We Who are revealing it, and it is Our Own wisdom which requires that We should reveal it piece by piece and not all at once.\"Second, the Holy Prophet has been told: \"No matter how long ,it may take for the decree of your Lord to be enforced and no matter what afflictions may befall you in the meantime, in any case you should continue to perform your mission of Apostleship patiently, and not to yield to the pressure tactics of any of these wicked and unbelieving people.\"The third thing he has been told is: \"Remember Allah day and night, perform the Prayer and spend your\r\nnights in the worship of Allah, for it is these things which sustain and strengthen those who call to Allah in the face of iniquity and disbelief.\"",
        "\n",
        "Then in one single sentence, the actual cause of the disbelievers wrong attitude has been stated: they have forgotten the Hereafter and are enamored of the world. In the second sentence, they have been warned to the effect: \"You have not come into being by yourself: We have created you. You have not made these broad chests, and strong, sturdy hands and feet for yourselves, it is We Who made these for you; and it so lies in Our power to treat you as We please. We can distort your figures, We can destroy you and replace you by some other nation. We can cause you to die and can recreate you in whatever form We like.\"",
        "\n",
        "In conclusion, it has been said: This is an Admonition: whoever wills may accept it and take a path to his Lord. But man's own will and desire is not everything in the world. No one's will and desire can be fulfilled unless Allah (also) so wills. And Allah's willing is not haphazard: whatever He wills, He wills it on the basis of His knowledge and wisdom. He admits into His mercy whomever He regards as worthy of His mercy on the basis of His knowledge and wisdom, and He has prepared a painful torment for those whom He finds unjust and wicked.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with a question posed to arrogant Man about his utter nothingness before God brought him into existence. It takes its name from the word “man” (al-insān) mentioned in verse 1. The surah speaks of how man is tested (verse 2 .) and what the results will be for the evildoers (verse 4) and for the righteous (verse 5 .). The Prophet is urged to persevere in his devotion and to bear with patience (verse 23 .).The surah is also known as: Every (Man).",
    "name_translation": "Man",
    "name_complex": "Al-Insân",
    "surah_name_ar": "الأنسان",
    "verses": {
        "Albanian": {
            "verse 76:1": "Pa dyshim ka qenë kohë e gjatë (ajo), e që njeriu nuk është përmendur (nuk ka ekzistuar).",
            "verse 76:2": "Me të vërtetë, Ne e kemi krijuar njeriun nga një farë e përzier (spermës); për ta provuar, dhe e bëmë atë që të dëgjojë dhe të shoh;",
            "verse 76:3": "Na, ia treguam atij rrugën, e ai (do të jetë) ose mirënjohës ose jomirënjohës;",
            "verse 76:4": "Na, me të vërtetë, për jobesimtarët kemi përgatitur zingjirë e pranga dhe flakë të zjarrit.",
            "verse 76:5": "Sigurisht, të ndershmit besimtarë do të pinë nga kupa (në xhennet), pije të përbërë me kambor.",
            "verse 76:6": "Nga burimi që vetëm adhuruesit e Perëndisë pinë, dhe të cilin mund ta çojnë (bartin) kah të duan;",
            "verse 76:7": "ata (njerëz) që e zbatojnë premtimin dhe i druajnë Ditës, tmerri i së cilës përhapet gjithëkah,",
            "verse 76:8": "dhe i ushqejnë të varfërit, bonjakët dhe të zënët robë (në luftë), madje edhe pse janë vetë nevojtarë për te (ushqim).",
            "verse 76:9": "(Thonë ata): “Na, ju ushqejmë vetëm për hir të Zotit. Na – për këtë, nuk duam shpërblim as falenderim!",
            "verse 76:10": "Na i druajmë Zotit tonë atë Ditë kur fytyrat janë të vrenjtura dhe të ashpra”.",
            "verse 76:11": "Perëndia i ruan ata nga tmerret e asaj Dite; Ai atyre u jep shkëlqim (në fytyrat e tyre) dhe gëzim,",
            "verse 76:12": "dhe, për durimin e tyre (në të drejtë), Ai i shpërblen ata me xhennet dhe (petka) të mëndafshta:",
            "verse 76:13": "(ata) të mbështetur në kanape, nuk do ta ndjejnë as vapën (e Diellit) dhe as të ftohtit (e dimërit),",
            "verse 76:14": "dhe do t’u jetë afër tyre hija e pemëve, frutet e të cilave do të mund t’i shfrytëzojnë (kapin) lehtë.",
            "verse 76:15": "Do të shërbehen ata nga enët e argjendta dhe kupat (si shtamba) e tejdukshme,",
            "verse 76:16": "të tejdukshme, nga argjendi, madhësinë e të cilave (do ta zgjedhin) sipas dëshirës.",
            "verse 76:17": "Në të (xhennet) do të pinë shishe pijesh të përziera me Zenxhebil",
            "verse 76:18": "nga burimi i xhennetit, (pija) e quajtur Selsebil.",
            "verse 76:19": "Atyre do t’u shërbejnë djelmoshat (shërbyesit) përherë të rinj, - që, kur t’i shikosh, duken se janë margaritarë të shpërndarë.",
            "verse 76:20": "Dhe, kahdo të shikosh (në xhennet), do të shohësh komoditet e begati të gjerë.",
            "verse 76:21": "Ata do të janë të veshur me petka të holla mëndafshi të gjelbërt, dhe nga mëndafsi i trashë, të stolisur me bylyzykë të argjendtë, dhe do t’u jap Zoti i tyre të pinë pije të pastërta (të mrekullueshme).",
            "verse 76:22": "(Ju thuhet atyre): “Ky është shpërblimi juaj; përpjekja juaj (në vepra të mira) është e falenderuar.",
            "verse 76:23": "Me të vërtetë, Na ta kemi shpallur Kur’anin ty në intervale (kohë pas kohe),",
            "verse 76:24": "Duro (prite) vendimin e Zotit tënd, e mos dëgjo as mëkatarët, as jobesimtarët!",
            "verse 76:25": "Dhe, përmende emrin e Zotit tënd në mëngjes dhe në mbrëmje,",
            "verse 76:26": "dhe, në një pjesë të natës kryej detyrat (falu) për Zotin, dhe falenderoje Atë natën, gjatë!",
            "verse 76:27": "E, me të vërtetë, këta (jobesimtarët) e duan jetën e këtushme, e nuk e përfillin Ditën e vështirë (Kijametin) që do t’u vie.",
            "verse 76:28": "Na i kemi krijuar ata dhe Na ua kemi dhënë forcën (e trupit të tyre).",
            "verse 76:29": "Kjo, me të vërtetë, është këshillë, e kush të dojë, ndjekë rrugën që shpie te Zoti i tij, -",
            "verse 76:30": "por ju nuk mund të duani, përveç nëse don Perëndia – se, Perëndia, me të vërtetë, është i Plotëdijshëm dhe i Gjithëdijshëm,",
            "verse 76:31": "atë që don Ai, e shpie në mëshirën e Vet, e jobesimtarëve u ka përgatitur vuajtje të rënda."
        },
        "Amharic": {
            "verse 76:1": "በሰው ላይ የሚታወስ ነገር ሳይኾን ከዘመናት የተወሰነ ጊዜ በእርግጥ አልፎበታል፡፡",
            "verse 76:2": "እኛ ሰውን (በሕግ ግዳጅ) የምንሞከረው ስንኾን ቅልቅሎች ከኾኑ የፍትወት ጠብታ ፈጠርነው፡፡ ሰሚ ተመልካችም አደረግነው፡፡",
            "verse 76:3": "እኛ ወይ አመስጋኝ ወይም ከሓዲ ሲኾን መንገዱን መራነው፤ (ገለጽንለት)፡፡",
            "verse 76:4": "እኛ ለከሓዲዎች ሰንሰሎቶችንና እንዛዝላዎችን፣ እሳትንም አዘጋጅተናል፡፡",
            "verse 76:5": "በጎ አድራጊዎች መበረዣዋ ካፉር ከኾነች ጠጅ ይጠጣሉ፡፡",
            "verse 76:6": "ከእርሷ የአላህ ባሮች የሚጠጡላት (ወደፈለጉበት) ማንቧቧትን የሚያንቧቧት ከኾነች ምንጭ (ይጠጣሉ)፡፡",
            "verse 76:7": "(ዛሬ) በስለታቸው ይሞላሉ፡፡ መከራው ተሰራጪ የኾነንም ቀን ይፈራሉ፡፡",
            "verse 76:8": "ምግብንም ከመውደዳቸው ጋር ለድኻ፣ ለየቲምም፣ ለምርኮኛም ለእስረኛም ያበላሉ፡፡",
            "verse 76:9": "«የምናበላችሁ ለአላህ ውዴታ ብቻ ነው፡፡ ከእናንተ ዋጋንም ማመስገንንም አንፈልግም፡፡",
            "verse 76:10": "«እኛ (ፊትን) የሚያጨፈግግን ብርቱ ቀን ከጌታችን እንፈራለንና፤» (ይላሉ)፡፡",
            "verse 76:11": "አላህም የዚያን ቀን ክፋት ጠበቃቸው፡፡ (ፊታቸው) ማማርንና መደሰትንም ገጠማቸው፡፡",
            "verse 76:12": "በመታገሣቸውም ገነትንና የሐር ልብስን መነዳቸው፡፡",
            "verse 76:13": "በውስጧ በባለ አጎበር አልጋዎች ላይ ተደጋፊዎች በውስጧ ፀሐይንም ጨረቃንም የማያዩ ሲኾኑ፡፡",
            "verse 76:14": "ዛፎችዋም በእነርሱ ላይ የቀረበች፣ ፍሬዎችዋም (ለለቃሚዎች) መግገራትን የተገራች ስትኾን (ገነትን መነዳቸው)፡፡",
            "verse 76:15": "በእነርሱም ላይ ከብር በኾኑ ዕቃዎች (ሰሐኖች) የብርጭቆዎች በኾኑ ኩባያዎችም ይዝዞርባቸዋል፡፡",
            "verse 76:16": "መለካትን የለኳቸው በኾኑ የብር ብርጭቆዎች (ይዝዞርባቸዋል)፡፡",
            "verse 76:17": "በእርሷም መበረዣዋ ዘንጀቢል የኾነችን ጠጅ ይጠጣሉ፡፡",
            "verse 76:18": "በውስጧ ያለችውን ሰልሰቢል ተብላ የምትጠራውን ምንጭ፡፡",
            "verse 76:19": "በእነርሱም ላይ (ባሉበት ኹነታ) የሚዘወትሩ ወጣት ልጆች ይዘዋወራሉ፡፡ ባየሃቸው ጊዜ የተበተነ ሉል ናቸው ብለህ ታስባቸዋለህ፡፡",
            "verse 76:20": "እዚያም በተመለከትክ ጊዜ ጸጋንና ታላቅ ንግሥናን ታያለህ፡፡",
            "verse 76:21": "አረንጓዴዎች የኾኑ የቀጭን ሐር ልብሶችና ወፍራም ሐርም በላያቸው ላይ አልለ፡፡ ከብር የኾኑ አንባሮችንም ይሸለማሉ፡፡ ጌታቸውም አጥሪ የኾነን መጠጥ ያጠጣቸዋል፡፡",
            "verse 76:22": "«ይህ በእርግጥ ለእናንተ ዋጋ ኾነ፡፡ ሥራችሁም ምስጉን ኾነ፤» (ይባላሉ)፡፡",
            "verse 76:23": "እኛ ቁርኣንን ባንተ ላይ ማውረድን እኛው አወረድነው፡፡",
            "verse 76:24": "ለጌታህ ፍርድም ታገሥ፡፡ ከእነርሱም ኀጢአተኛን ወይም ከሓዲን አትታዘዝ፡፡",
            "verse 76:25": "የጌታህንም ስም በጧትና ከቀትር በላይ አውሳ፡፡",
            "verse 76:26": "ከሌሊቱም ለእርሱ ስገድ፡፡ በረዢም ሌሊትም አወድሰው፡፡",
            "verse 76:27": "እነዚያ ፈጣኒቱን ዓለም ይወዳሉ፡፡ ከባድን ቀንም በስተፊታቸው ኾኖ ይተዋሉ፡፡",
            "verse 76:28": "እኛ ፈጠርናቸው፡፡ መለያልያቸውንም አጠነከርን፡፡ በሻንም ጊዜ መሰሎቻቸውን መለወጥን እንለውጣለን፡፡",
            "verse 76:29": "ይህቺ መገሠጫ ናት፡፡ የሻም ሰው ወደ ጌታው መንገድን ይይዛል፡፡",
            "verse 76:30": "አላህም ካልሻ በስተቀር አትሹም፡፡ አላህ ዐዋቂ ጥበበኛ ነውና፡፡",
            "verse 76:31": "የሚሻውን ሰው በእዝነቱ ውስጥ ያገባዋል፡፡ በዳዮቹንም (ዝቶባቸዋል)፡፡ ለእነርሱ አሳማሚ ቅጣትን አዘጋጅቶላቸዋል፡፡"
        },
        "Arabic": {
            "verse 76:1": "اًروُكْذَّم اًئْيَش نُكَي ْمَل ِرْهَّدلا َنِّم ٌنيِح ِناَسنِإْلا ىَلَع ٰىَتَأ ْلَه",
            "verse 76:2": "اًريِصَب اًعيِمَس ُهاَنْلَعَجَف ِهيِلَتْبَّن ٍجاَشْمَأ ٍةَفْطُّن نِم َناَسنِإْلا اَنْقَلَخ اَّنِإ",
            "verse 76:3": "اًروُفَك اَّمِإَو اًرِكاَش اَّمِإ َليِبَّسلا ُهاَنْيَدَه اَّنِإ",
            "verse 76:4": "اًريِعَسَو اًلاَلْغَأَو َلِساَلَس َنيِرِفاَكْلِل اَنْدَتْعَأ اَّنِإ",
            "verse 76:5": "اًروُفاَك اَهُجاَزِم َناَك ٍسْأَك نِم َنوُبَرْشَي َراَرْبَأْلا َّنِإ",
            "verse 76:6": "اًريِجْفَت اَهَنوُرِّجَفُي ِهَّللا ُداَبِع اَهِب ُبَرْشَي اًنْيَع",
            "verse 76:7": "اًريِطَتْسُم ُهُّرَش َناَك اًمْوَي َنوُفاَخَيَو ِرْذَّنلاِب َنوُفوُي",
            "verse 76:8": "اًريِسَأَو اًميِتَيَو اًنيِكْسِم ِهِّبُح ٰىَلَع َماَعَّطلا َنوُمِعْطُيَو",
            "verse 76:9": "اًروُكُش اَلَو ًءاَزَج ْمُكنِم ُديِرُن اَل ِهَّللا ِهْجَوِل ْمُكُمِعْطُن اَمَّنِإ",
            "verse 76:10": "(اًريِرَطْمَق اًسوُبَع اًمْوَي اَنِّبَّر نِم ُفاَخَن اَّنِإ",
            "verse 76:11": "(اًروُرُسَو ًةَرْضَن ْمُهاَّقَلَو ِمْوَيْلا َكِلَٰذ َّرَش ُهَّللا ُمُهاَقَوَف",
            "verse 76:12": "(اًريِرَحَو ًةَّنَج اوُرَبَص اَمِب مُهاَزَجَو",
            "verse 76:13": "(اًريِرَهْمَز اَلَو اًسْمَش اَهيِف َنْوَرَي اَل ۖ ِكِئاَرَأْلا ىَلَع اَهيِف َنيِئِكَّتُّم",
            "verse 76:14": "(اًليِلْذَت اَهُفوُطُق ْتَلِّلُذَو اَهُلاَلِظ ْمِهْيَلَع ًةَيِناَدَو",
            "verse 76:15": "(اَريِراَوَق ْتَناَك ٍباَوْكَأَو ٍةَّضِف نِّم ٍةَيِنآِب مِهْيَلَع ُفاَطُيَو",
            "verse 76:16": "(اًريِدْقَت اَهوُرَّدَق ٍةَّضِف نِم َريِراَوَق",
            "verse 76:17": "(اًليِبَجنَز اَهُجاَزِم َناَك اًسْأَك اَهيِف َنْوَقْسُيَو",
            "verse 76:18": "(اًليِبَسْلَس ٰىَّمَسُت اَهيِف اًنْيَع",
            "verse 76:19": "(اًروُثنَّم اًؤُلْؤُل ْمُهَتْبِسَح ْمُهَتْيَأَر اَذِإ َنوُدَّلَخُّم ٌناَدْلِو ْمِهْيَلَع ُفوُطَيَو ۞",
            "verse 76:20": "(اًريِبَك اًكْلُمَو اًميِعَن َتْيَأَر َّمَث َتْيَأَر اَذِإَو",
            "verse 76:21": "(اًروُهَط اًباَرَش ْمُهُّبَر ْمُهاَقَسَو ٍةَّضِف نِم َرِواَسَأ اوُّلُحَو ۖ ٌقَرْبَتْسِإَو ٌرْضُخ ٍسُدنُس ُباَيِث ْمُهَيِلاَع",
            "verse 76:22": "(اًروُكْشَّم مُكُيْعَس َناَكَو ًءاَزَج ْمُكَل َناَك اَذَٰه َّنِإ",
            "verse 76:23": "(اًليِزنَت َنآْرُقْلا َكْيَلَع اَنْلَّزَن ُنْحَن اَّنِإ",
            "verse 76:24": "(اًروُفَك ْوَأ اًمِثآ ْمُهْنِم ْعِطُت اَلَو َكِّبَر ِمْكُحِل ْرِبْصاَف",
            "verse 76:25": "(اًليِصَأَو ًةَرْكُب َكِّبَر َمْسا ِرُكْذاَو",
            "verse 76:26": "(اًليِوَط اًلْيَل ُهْحِّبَسَو ُهَل ْدُجْساَف ِلْيَّللا َنِمَو",
            "verse 76:27": "(اًليِقَث اًمْوَي ْمُهَءاَرَو َنوُرَذَيَو َةَلِجاَعْلا َنوُّبِحُي ِءاَلُؤَٰه َّنِإ",
            "verse 76:28": "(اًليِدْبَت ْمُهَلاَثْمَأ اَنْلَّدَب اَنْئِش اَذِإَو ۖ ْمُهَرْسَأ اَنْدَدَشَو ْمُهاَنْقَلَخ ُنْحَّن",
            "verse 76:29": "(اًليِبَس ِهِّبَر ٰىَلِإ َذَخَّتا َءاَش نَمَف ۖ ٌةَرِكْذَت ِهِذَٰه َّنِإ",
            "verse 76:30": "(اًميِكَح اًميِلَع َناَك َهَّللا َّنِإ ۚ ُهَّللا َءاَشَي نَأ اَّلِإ َنوُءاَشَت اَمَو",
            "verse 76:31": "(اًميِلَأ اًباَذَع ْمُهَل َّدَعَأ َنيِمِلاَّظلاَو ۚ ِهِتَمْحَر يِف ُءاَشَي نَم ُلِخْدُي"
        },
        "Azerbaijani": {
            "verse 76:1": "Doğrudanmı insanın heç kimə məlum olmadığı bir dövr hələ də ötüb keçməmişdir?",
            "verse 76:2": "İnsanı qarışdırılmış nütfədən yaradaraq onu sınaqdan keçirmək məqsədilə eşidən və görən etdik.",
            "verse 76:3": "Şübhəsiz ki, Biz ona yol göstərdik! Fərqi yoxdur, ya şükür etsin, ya da naşükür olsun.",
            "verse 76:4": "Doğrudan da, kafirlərdən ötrü zəncirlər, buxovlar və alovsaçan od hazırlamışıq.",
            "verse 76:5": "Sözsüz ki, itaətkarlar kafur qatılmış şərabla dolu badələrdən nuş edəcəklər.",
            "verse 76:6": "Bu elə bir bulaqdır ki, Allahın qulları ondan doyunca içər və onun mənsəbini istədikləri səmtə yönəldərlər.",
            "verse 76:7": "Onlar vəd etdikləri nəziri verər və dəhşəti hər yeri sarsıdacaq gündən qorxarlar.",
            "verse 76:8": "Onlar özlərinin istədikləri şeylərdən kasıba, yetimə və əsirə də verərlər",
            "verse 76:9": "və deyərlər: “Biz sizi yalnız Allahın Üzü xatirinə yedirdirik və sizdən nə əvəzini, nə də minnətdarlıq gözləyirik!",
            "verse 76:10": "Əslində, biz, Rəbbimizdən gələ bilən çox kəskin və ağır bir gündən ehtiyat edirik!”",
            "verse 76:11": "Bunun əvəzində Allah da onları həmin günün şərindən qoruyar və onlara gözəllik və sevinc nəsib edər;",
            "verse 76:12": "onlara səbir etdiklərinə görə Cənnəti bəxş edər və orada geyəcəkləri ipəklə mükafatlandırar.",
            "verse 76:13": "Onlar orada taxtlar üzərində mütəkkələrə dirsəklənəcək və orada nə günəş, nə də şaxta görməyəcəklər.",
            "verse 76:14": "Cənnət ağaclarının kölgələri özləri onlara yaxınlaşacaq, meyvələri də tam onların ixtiyarına veriləcək.",
            "verse 76:15": "Onların ətrafına təamlarla dolu gümüşdən hazırlanmış qablar və büllur qədəhlər dolandırılacaq.",
            "verse 76:16": "Gümüşdən olan elə büllur qədəhlər ki, xidmətçilər onları cənnətdəkilərin içmək istədikləri həcmdə hazırlamışlar.",
            "verse 76:17": "Orada onlara zəncəfil qatılmış şərab badəsi içirdiləcək.",
            "verse 76:18": "Bu elə bir bulaqdandır ki, o, Cənnətdə Səlsəbil adlanır.",
            "verse 76:19": "Onların ətrafında həmişə gənc olan xidmətçi cavanlar dolanacaqlar. Onları gördükdə səpələnmiş mirvari dənələri olduqlarını sanarsan.",
            "verse 76:20": "Cənnətdə hara baxsan nemət və əzəmətli səltənət nişanəsi görərsən.",
            "verse 76:21": "Onlar əyinlərinə taftadan və atlazdan yaşıl paltarlar geyəcəklər. Onların qoluna gümüş bilərziklər bağlanacaq. Onların Rəbbi onlara tərtəmiz şərab içirdəcəkdir.",
            "verse 76:22": "Onlara deyiləcəkdir: “Həqiqətən, bu sizə bir hədiyyədir və səyiniz təşəkkürə layiqdir”.",
            "verse 76:23": "Biz Quranı sənə hissə-hissə aramla nazil etdik.",
            "verse 76:24": "Belə ki, Rəbbinin qərar verəcəyinə qədər səbir et və onlardan heç bir günahkara və ya nankora itaət etmə!",
            "verse 76:25": "Səhər-axşam Rəbbinin adını zikr et!",
            "verse 76:26": "Gecənin bir hissəsində Ona səcdə et və gecədə uzun müddət Onun şəninə təriflər de!",
            "verse 76:27": "Əsl həqiqətdə, bunlar ötəri dünyanı üstün tutaraq qarşılarındakı ağır günü görməməzliyə vururlar.",
            "verse 76:28": "Biz onları yaratdıq və xilqətini möhkəmlətdik. Əgər istəsək, onları özlərinə bənzərləri ilə dəyişdirərik.",
            "verse 76:29": "Həqiqətən, bu bir ibrətdir. İstəyən, Rəbbinə doğru aparan bir yol tutar.",
            "verse 76:30": "Amma Allah istəməyincə, siz istəyə bilməzsiniz! Həqiqətən, Allah Biləndir, Müdrikdir!",
            "verse 76:31": "O, istədiyini Öz mərhəmətinə qovuşdurar. Zalımlara isə, O, ağrılı-acılı əzab hazırlamışdır."
        },
        "Bengali": {
            "verse 76:1": "মানুষের উপর এমন কিছু সময় অতিবাহিত হয়েছে যখন সে উল্লেখযোগ্য কিছু ছিল না।",
            "verse 76:2": "আমি মানুষকে সৃষ্টি করেছি মিশ্র শুক্রবিন্দু থেকে, এভাবে যে, তাকে পরীক্ষা করব অতঃপর তাকে করে দিয়েছি শ্রবণ ও দৃষ্টিশক্তিসম্পন্ন।",
            "verse 76:3": "আমি তাকে পথ দেখিয়ে দিয়েছি। এখন সে হয় কৃতজ্ঞ হয়, না হয় অকৃতজ্ঞ হয়।",
            "verse 76:4": "আমি অবিশ্বাসীদের জন্যে প্রস্তুত রেখেছি শিকল, বেড়ি ও প্রজ্বলিত অগ্নি।",
            "verse 76:5": "নিশ্চয়ই সৎকর্মশীলরা পান করবে কাফুর মিশ্রিত পানপাত্র।",
            "verse 76:6": "এটা একটা ঝরণা, যা থেকে আল্লাহর বান্দাগণ পান করবে-তারা একে প্রবাহিত করবে।",
            "verse 76:7": "তারা মান্নত পূর্ণ করে এবং সেদিনকে ভয় করে, যেদিনের অনিষ্ট হবে সুদূরপ্রসারী।",
            "verse 76:8": "তারা আল্লাহর প্রেমে অভাবগ্রস্ত, এতীম ও বন্দীকে আহার্য দান করে।",
            "verse 76:9": "তারা বলেঃ কেবল আল্লাহর সন্তুষ্টির জন্যে আমরা তোমাদেরকে আহার্য দান করি এবং তোমাদের কাছে কোন প্রতিদান ও কৃতজ্ঞতা কামনা করি না।",
            "verse 76:10": "আমরা আমাদের পালনকর্তার তরফ থেকে এক ভীতিপ্রদ ভয়ংকর দিনের ভয় রাখি।",
            "verse 76:11": "অতঃপর আল্লাহ তাদেরকে সেদিনের অনিষ্ট থেকে রক্ষা করবেন এবং তাদেরকে দিবেন সজীবতা ও আনন্দ।",
            "verse 76:12": "এবং তাদের সবরের প্রতিদানে তাদেরকে দিবেন জান্নাত ও রেশমী পোশাক।",
            "verse 76:13": "তারা সেখানে সিংহাসনে হেলান দিয়ে বসবে। সেখানে রৌদ্র ও শৈত্য অনুভব করবে না।",
            "verse 76:14": "তার বৃক্ষছায়া তাদের উপর ঝুঁকে থাকবে এবং তার ফলসমূহ তাদের আয়ত্তাধীন রাখা হবে।",
            "verse 76:15": "তাদেরকে পরিবেশন করা হবে রূপার পাত্রে এবং স্ফটিকের মত পানপাত্রে।",
            "verse 76:16": "রূপালী স্ফটিক পাত্রে, পরিবেশনকারীরা তা পরিমাপ করে পূর্ণ করবে।",
            "verse 76:17": "তাদেরকে সেখানে পান করানো হবে ‘যানজাবীল’ মিশ্রিত পানপাত্র।",
            "verse 76:18": "এটা জান্নাতস্থিত ‘সালসাবীল’ নামক একটি ঝরণা।",
            "verse 76:19": "তাদের কাছে ঘোরাফেরা করবে চির কিশোরগণ। আপনি তাদেরকে দেখে মনে করবেন যেন বিক্ষিপ্ত মনি-মুক্তা।",
            "verse 76:20": "আপনি যখন সেখানে দেখবেন, তখন নেয়ামতরাজি ও বিশাল রাজ্য দেখতে পাবেন।",
            "verse 76:21": "তাদের আবরণ হবে চিকন সবুজ রেশম ও মোটা সবুজ রেশম এবং তাদেরকে পরিধান করোনো হবে রৌপ্য নির্মিত কংকণ এবং তাদের পালনকর্তা তাদেরকে পান করাবেন ‘শরাবান-তহুরা’।",
            "verse 76:22": "এটা তোমাদের প্রতিদান। তোমাদের প্রচেষ্টা স্বীকৃতি লাভ করেছে।",
            "verse 76:23": "আমি আপনার প্রতি পর্যায়ক্রমে কোরআন নাযিল করেছি।",
            "verse 76:24": "অতএব, আপনি আপনার পালনকর্তার আদেশের জন্যে ধৈর্য্য সহকারে অপেক্ষা করুন এবং ওদের মধ্যকার কোন পাপিষ্ঠ কাফেরের আনুগত্য করবেন না।",
            "verse 76:25": "এবং সকাল-সন্ধ্যায় আপন পালনকর্তার নাম স্মরণ করুন।",
            "verse 76:26": "রাত্রির কিছু অংশে তাঁর উদ্দেশে সিজদা করুন এবং রাত্রির দীর্ঘ সময় তাঁর পবিত্রতা বর্ণনা করুন।",
            "verse 76:27": "নিশ্চয় এরা পার্থিব জীবনকে ভালবাসে এবং এক কঠিন দিবসকে পশ্চাতে ফেলে রাখে।",
            "verse 76:28": "আমি তাদেরকে সৃষ্টি করেছি এবং মজবুত করেছি তাদের গঠন। আমি যখন ইচ্ছা করব, তখন তাদের পরিবর্তে তাদের অনুরূপ লোক আনব।",
            "verse 76:29": "এটা উপদেশ, অতএব যার ইচ্ছা হয় সে তার পালনকর্তার পথ অবলম্বন করুক।",
            "verse 76:30": "আল্লাহর অভিপ্রায় ব্যতিরেকে তোমরা অন্য কোন অভিপ্রায় পোষণ করবে না। আল্লাহ সর্বজ্ঞ প্রজ্ঞাময়।",
            "verse 76:31": "তিনি যাকে ইচ্ছা তাঁর রহমতে দাখিল করেন। আর যালেমদের জন্যে তো প্রস্তুত রেখেছেন মর্মন্তুদ শাস্তি।"
        },
        "Berber Amazigh": {
            "verse 76:1": "Day tâadda tallit $ef umdan ideg ur illi d ayen ipwabedren?",
            "verse 76:2": "Ih, Nexleq amdan si tiqqit n l$ella ixelven. A t Njeôôeb, Nerra t isell, ipwali.",
            "verse 76:3": "Nebbwi t d ubrid, ama isnemmir, ne$ inkeô.",
            "verse 76:4": "Nhegga, ih, i ijehliyen, sslasel, aruz, u$ud.",
            "verse 76:5": "Iâaôviyen, s tidep, ad swen, di lkas, ayen ixelîen akked lkafuô.",
            "verse 76:6": "Tala ideg tessen ixdimen n Öebbi, aman is pfeggiven.",
            "verse 76:7": "Ppaîîafen di tuqqna, ugaden ass ideg lhemm immebruzzaâ.",
            "verse 76:8": "Ppaken lqut, ilmend n lemêibba S, i igellil, i ugujil, i umeêbus.",
            "verse 76:9": "\"F udem n Öebbi kan, ay kwen necceççay. Ur neb$i segwen tiririt ne$ tajmilt.",
            "verse 76:10": "Nekwni, ih, nugad Mass nne$, ass awaâôan, aqessêan\".",
            "verse 76:11": "Isellek iten Öebbi si lhemm n wassen. Ccbaêa, lfeôê, Ifka yasen.",
            "verse 76:12": "Ikufa ten af wayen ûebôen: leonan, leêrir.",
            "verse 76:13": "Ad éélen din af imîeôêen; ur pwalin iîij, asemmiv.",
            "verse 76:14": "Tili ines $uôsen, izwayen wâan asen.",
            "verse 76:15": "A sen tezzin ibuqalen n lfeîîa, lkisan ulelluc.",
            "verse 76:16": "Alelluc n lfeîîa; taceôt nnsen, s lmizan.",
            "verse 76:17": "Dinna sswan asen lkas n wayen iwumi xelîen skenjbir.",
            "verse 76:18": "Dinna tala; Salsabil i s ssawalen.",
            "verse 76:19": "Ilmeéiyen imezgiyen tezzin asen. Ma twalav ten, ad as tiniv d tiyuqat imfaôaqen.",
            "verse 76:20": "Ma tmuqlev ar din, a pwaliv ssaâd akked tgelda meqqwôen.",
            "verse 76:21": "Iceîîiven i llsan d leêrir aêcici iêewwcen; imeqqyasen n lfeîîa; Isswa ten Mass nnsen, s tissit iûfan.",
            "verse 76:22": "Ih, wagi d arraz nnwen, u d tajmilt igiten nnwen.",
            "verse 76:23": "D Nekwni, s tidep, i k id Issersen Leqwôan, s lmizan.",
            "verse 76:24": "Eûbeô i uêuddu n Mass ik; segsen, ur teccev, ur jehhel.",
            "verse 76:25": "Mmekti d isem n Mass ik, tafrara, tameddit.",
            "verse 76:26": "Deg iv, knu yaS, u sbuccaâ iT tallit $wezzifen.",
            "verse 76:27": "Ih, wigi êemmlen taêemmaqt, stehzan deg wass amôay.",
            "verse 76:28": "Nekwni Nxelq iten, Nesseohed i$san nnsen. Ma ihwa ya£, a Nerr ay ten icban, wakali, deg umkan nnsen.",
            "verse 76:29": "Wagi, s tidep, d asmekti. Win ib$an, ad iddem abrid ar Mass is.",
            "verse 76:30": "Ur tbeqqum, siwa ma Ib$a Öebbi. Öebbi, s tidep, d Amusnaw, d Bab n ûûwab.",
            "verse 76:31": "Win i S ihwan, a t Issekcem ar uêunu S; ma d imednas, Ihegga yasen aâaqeb aqeôêan."
        },
        "Bosnian": {
            "verse 76:1": "Zar je to davno bilo kad čovjek nije bio spomena vrijedan?",
            "verse 76:2": "Mi čovjeka od smjese sjemena stvaramo da bismo ga na kušnju stavili i činimo da on čuje i vidi;",
            "verse 76:3": "Mi mu na Pravi put ukazujemo, a njegovo je da li će zahvalan ili nezahvalan biti;",
            "verse 76:4": "Mi smo za nevjernike okove i sindžire i oganj razbuktali pripremili.",
            "verse 76:5": "Čestiti će iz pehara piti kamforom začinjeno piće",
            "verse 76:6": "sa izvora iz kojeg će samo Allahovi štićenici piti, i koji će kuda hoće bez muke razvoditi.",
            "verse 76:7": "Oni su zavjet ispunjavali plašeći se Dana čija će kob svuda prisutna biti,",
            "verse 76:8": "i hranu su davali – mada su je i sami željeli – siromahu i siročetu i sužnju.",
            "verse 76:9": "\"Mi vas samo za Allahovu ljubav hranimo, od vas ni priznanja ni zahvalnosti ne tražimo!",
            "verse 76:10": "Mi se Gospodara našeg bojimo, onog Dana kada će lica smrknuta i namrgođena biti.\"",
            "verse 76:11": "I njih će Allah strahote toga Dana sačuvati i blaženstvo i radost im darovati",
            "verse 76:12": "i Džennetom i svilom ih za ono što su trpjeli nagraditi:",
            "verse 76:13": "naslonjeni na divanima, oni u njemu ni mraz ni žegu neće osjetiti,",
            "verse 76:14": "i blizu će im hladovina njegova biti, a plodovi njegovi će im nadohvat ruke stajati.",
            "verse 76:15": "Služiće ih iz srebrenih posuda i čaša prozirnih,",
            "verse 76:16": "prozirnih, od srebra, čiju će veličinu prema željama njihovim odrediti.",
            "verse 76:17": "U njemu će iz čaše piće inbirom začinjeno piti",
            "verse 76:18": "sa izvora u Džennetu, koji će se Selsebil zvati.",
            "verse 76:19": "Služiće ih vječno mlada posluga – da ih vidiš, pomislio bi da su biser prosutī.",
            "verse 76:20": "I kud god pogledaš, vidjećeš udobnost i carstvo prostrano.",
            "verse 76:21": "Na njima će biti odijela od tanke zelene svile, i od teške svile, nakićeni narukvicama od srebra, i daće im Gospodar njihov da piju čisto piće.",
            "verse 76:22": "\"To vam je nagrada; vaš trud je dostojan blagodarnosti!\"",
            "verse 76:23": "Od vremena do vremena Mi objavljujemo Kur'an tebi,",
            "verse 76:24": "zato izdrži do odluke Gospodara tvoga, i ne slušaj ni grješnika ni nevjernika njihova!",
            "verse 76:25": "I spominji ime Gospodara svoga ujutro i predvečer,",
            "verse 76:26": "i u jednom dijelu noći radi Njega molitvu obavljaj, i dugo Ga noću hvali!",
            "verse 76:27": "A ovi, oni život na ovom svijetu vole doista, a ništa ih se ne tiče Dan tegobni, koji ih čeka.",
            "verse 76:28": "Mi ih stvaramo i zglobove im vezujemo, a ako htjednemo, zamijenićemo ih njima sličnim.",
            "verse 76:29": "Ovo je pouka, pa ko hoće držaće se puta koji Gospodaru njegovu vodi –",
            "verse 76:30": "a vi ćete htjeti samo ono što Allah hoće – Allah, uistinu, sve zna i mudar je,",
            "verse 76:31": "On koga hoće uvodi u milost Svoju, a nevjernicima je pripremio tešku patnju."
        },
        "Bulgarian": {
            "verse 76:1": "Не премина ли човекът през период от време, когато той бе нещо неназовано?",
            "verse 76:2": "Сътворихме Ние човека от частица сперма с примеси, за да го изпитаме, и го сторихме чуващ, зрящ.",
            "verse 76:3": "Ние му показахме пътя - или признателен, или неблагодарник.",
            "verse 76:4": "Приготвихме Ние за неверниците вериги, окови и пламъци.",
            "verse 76:5": "Праведниците пият от чаши с добавено питие от Камфор -",
            "verse 76:6": "извор, от който пият рабите на Аллах - пускат го в обилие да бликва.",
            "verse 76:7": "Те изпълняват обета и се страхуват от Деня, злото на който се разпростира.",
            "verse 76:8": "И дават храна - въпреки че и те я обичат - на нуждаещ се и на сирак, и на пленник:",
            "verse 76:9": "“Храним ви в името на Аллах. Не искаме от вас нито отплата, нито признателност.",
            "verse 76:10": "Страхуваме се от [мъчението на] Нашия Господ в Деня свъсен, зловещ.”",
            "verse 76:11": "Но Аллах ще ги предпази от злото на този Ден, и ще им дари сияние и щастие.",
            "verse 76:12": "И ще ги възнагради - защото бяха търпеливи - с Градина и с коприна,",
            "verse 76:13": "облегнати там на престоли. Не ще виждат там ни зной, ни мраз.",
            "verse 76:14": "Близо над тях ще са нейните сенки и ще са сведени плодовете й ниско.",
            "verse 76:15": "Ще бъдат обслужвани със съдове от сребро и с кристални чаши",
            "verse 76:16": "от сребърен кристал. Ще им се отмерва с мярка.",
            "verse 76:17": "И ще им се дава там да пият от питие, смесено с джинджифил,",
            "verse 76:18": "от извор там, наречен Салсабил,",
            "verse 76:19": "и ще ги обикалят вечномлади юноши - когато ги видиш, ще ги помислиш за разпръснати бисери.",
            "verse 76:20": "Където и да погледнеш там, ще видиш блаженство и огромно владение.",
            "verse 76:21": "Ще бъдат облечени в зелени одежди от коприна и брокат, и ще носят украшения - гривни от сребро, и ще им дава техният Господ да пият от чиста напитка.",
            "verse 76:22": "“Това е награда за вас. Вашето старание заслужи признание.”",
            "verse 76:23": "Ние ти низпослахме Корана постепенно.",
            "verse 76:24": "Затова и ти [о, Мухаммад] бъди търпелив към повелята на твоя Господ, и не се покорявай на никой грешник от тях, или на неверник!",
            "verse 76:25": "И споменавай името на своя Господ и сутрин, и вечер,",
            "verse 76:26": "и в част от нощта Му се покланяй, и дълго нощем Го прославяй!",
            "verse 76:27": "Тези обичат преходността и нехаят за тежкия Ден пред тях.",
            "verse 76:28": "Ние ги сътворихме и укрепихме телата им, а ако пожелаем, напълно ще ги заменим с подобни на тях.",
            "verse 76:29": "Това е поучение. Който желае, поема пътя към своя Господ.",
            "verse 76:30": "Тогава ще пожелавате само онова, което Аллах желае. Аллах е всезнаещ, премъдър.",
            "verse 76:31": "Той въвежда когото пожелае в Своята милост, а за угнетителите е приготвил болезнено мъчение."
        },
        "Chinese": {
            "verse 76:1": "人确实经历一个时期，不是一件可以记念的事物。",
            "verse 76:2": "我确已用混合的精液创造人，并加以试验，将他创造成聪明的。",
            "verse 76:3": "我确已指引他正道，他或是感谢，或是辜负。",
            "verse 76:4": "我确已为不信者预备许多铁链、铁圈和火狱。",
            "verse 76:5": "善人们必得饮含有樟脑的醴泉，",
            "verse 76:6": "即真主的众仆所饮的一道泉水，他们将使它大量涌出。",
            "verse 76:7": "他们履行誓愿，并畏惧灾难普降日。",
            "verse 76:8": "他们为喜爱真主而赈济贫民、孤儿、俘虏。",
            "verse 76:9": "我们只为爱戴真主而赈济你们，我们不望你们的报酬和感谢。",
            "verse 76:10": "我们的确畏惧从我们的主发出的严酷的一日。",
            "verse 76:11": "故真主将为他们防御那日的灾难，并赏赐他们光华和快乐。",
            "verse 76:12": "他将因他们的坚忍而以乐园和丝绸报酬他们。",
            "verse 76:13": "他们在乐园中，靠在床上，不觉炎热，也不觉严寒。",
            "verse 76:14": "乐园的荫影覆庇著他们，乐园的果实，他们容易采摘。",
            "verse 76:15": "将有人在他们之间传递银盘和玻璃杯--",
            "verse 76:16": "晶莹如玻璃的银杯，他们预定每杯的容量。",
            "verse 76:17": "他们得用那些杯饮含有姜汁的醴泉，",
            "verse 76:18": "即乐园中有名的清快泉。",
            "verse 76:19": "许多长生不老的少年，轮流著服侍他们。当你看见那些少年的时候，你以为他们是些散漫的珍珠。",
            "verse 76:20": "当你观看那里的时候，你会看见恩泽和大国。",
            "verse 76:21": "他们将穿著绫罗锦缎的绿袍，他们将享受银镯的装饰，他们的主，将以纯洁的饮料赏赐他们。",
            "verse 76:22": "（将对他们说：）这确是你们的报酬，你们的劳绩是有报酬的。",
            "verse 76:23": "我确已将《古兰经》零星地降示你，",
            "verse 76:24": "故你应当忍受你的主的判决。你不要顺从他们中任何犯罪的人，或孤恩的人。",
            "verse 76:25": "你应当朝夕记念你的主的尊名，",
            "verse 76:26": "夜里，你应当以小部份时间向他叩头，以大部份时间赞颂他。",
            "verse 76:27": "这等人的确爱好现世，而忽视未来的严重的一日。",
            "verse 76:28": "我创造了他们，并使他们的体格坚实。如果我意欲，我将以像他们一样的人代替他们。",
            "verse 76:29": "这确是教诲，谁愿意觉悟，谁可以选择一条通达他的主的道路。",
            "verse 76:30": "除真主意欲外，你们决不意欲。真主是全知的，是至睿的。",
            "verse 76:31": "他使他所意欲的人，入在他的慈恩中。至於不义的人们，他已为他们预备了痛苦的刑罚。"
        },
        "Danish": {
            "verse 76:1": "Voorzeker, er is voor de mens een tijdperk geweest toen hij geen vermeldenswaardig ding was",
            "verse 76:2": "Wij hebben de mens uit een gemengde levenskiem geschapen en hebben hem horende en ziende gemaakt om hem op de proef te stellen",
            "verse 76:3": "Wij hebben hem de weg getoond, hij moge dankbaar of wel ondankbaar zijn",
            "verse 76:4": "Voorwaar, Wij hebben voor de ongelovigen ketenen, ijzeren halsbanden en een laaiend Vuur bereid",
            "verse 76:5": "Maar de deugdzamen drinken uit een beker (een drank) gemengd met Kamfer",
            "verse 76:6": "De dienaren van Allah drinken uit een bron, welke zij in overvloed doen stromen",
            "verse 76:7": "Zij vervullen de gelofte, en vrezen een Dag waarvan het kwaad verstrekkend is",
            "verse 76:8": "En zij geven voedsel, uit liefde voor Hem, aan de armen, de wees en de gevangenen",
            "verse 76:9": "(Zeggende): Wij voeden u slechts ter wille van Allah. Wij verlangen geen beloning noch dank van u",
            "verse 76:10": "Wij vrezen van onze Heer een moeilijke en drukkende Dag",
            "verse 76:11": "Daarom zal Allah hen voor het kwade van die Dag beschermen en zal hun blijdschap en geluk schenken",
            "verse 76:12": "En Hij zal hen voor hun standvastigheid belonen met een tuin en kleren van zijde",
            "verse 76:13": "Zich daarin nedervlijende op sofa`s zullen zij het noch te koud noch te warm hebben",
            "verse 76:14": "En de schaduw der bomen zal dicht over hen zijn en de trossen fruit zullen gemakkelijk bereikbaar worden gemaakt",
            "verse 76:15": "En zilveren vaten zullen aan hen worden rondgereikt, en bekers",
            "verse 76:16": "Kristalhelder, uit zilver, in de juiste maat vervaardigd",
            "verse 76:17": "En daarin zal hun een drank worden gegeven, vermengd met Gember",
            "verse 76:18": "Van een bron genaamd: Salsabiel",
            "verse 76:19": "En jonge mensen, die niet verouderen, zullen om hen rondgaan (om hen te bedienen). Wanneer gij hen ziet, denkt gij dat zij verstrooide paarlen zijn",
            "verse 76:20": "En waarheen gij ook kijkt, zult gij een zaligheid voelen en een groot koninkrijk aanschouwen",
            "verse 76:21": "Zij zullen klederen van fijne groene zijde en zwaar brocaat dragen en zilveren armbanden. En hun Heer zal hun een zuivere drank geven",
            "verse 76:22": "(Hij zal zeggen): Dit is uw loon, omdat uw streven waardevol was",
            "verse 76:23": "Voorwaar, Wij hebben de Koran aan u bij gedeelten geopenbaard",
            "verse 76:24": "Wees daarom geduldig volgens het gebod van uw Heer en gehoorzaam niemand die onder hen zondig of ongelovig is",
            "verse 76:25": "En gedenk de naam van uw Heer `s morgens en `s avonds",
            "verse 76:26": "En aanbid Hem gedurende (een deel) van de nacht en prijs Zijn eer gedurende een groot deel ervan",
            "verse 76:27": "Waarlijk, de ongelovigen houden van de voorbijgaande wereld en denken niet aan de zware Dag (des Oordeels)",
            "verse 76:28": "Wij zijn het Die hen geschapen hebben en hun lichaamsbouw hebben gesterkt. En indien Wij willen, kunnen Wij hen door gelijksoortige schepselen vervangen",
            "verse 76:29": "Voorwaar, dit is een vermaning. Wie het daarom wenst, kieze een weg die tot zijn Heer leidt",
            "verse 76:30": "En gij zult niets anders willen dan hetgeen Allah wil. Voorwaar, Allah is Alwetend, Alwijs",
            "verse 76:31": "Hij laat tot Zijn barmhartigheid ingaan wie Hij wil, en voor de onrechtvaardigen heeft Hij een pijnlijke straf bereid"
        },
        "Dutch": {
            "verse 76:1": "Voorzeker, er is voor de mens een periode geweest waarin hij in niets gedenkwaardig was.",
            "verse 76:2": "Voorwaar, Wij hebben de mens geschapen uit een gemengde druppel om hem te beproeven. Daarop gaven Wij hem het gehoor en gezichtsvermogen.",
            "verse 76:3": "Voorwaar, Wij wezen hem de Weg: wordt hij dankbaar of wordt hij ondankbaar?",
            "verse 76:4": "Voorwaar, voor de ongelovigen hebben Wij kettingen, en ketens en Sa'îr (de Hel) bereid.",
            "verse 76:5": "Voorwaar, de deugdzamen zullen drinken uit een beker waarvan de mengdrank van Kâfôer (kamfer) is.",
            "verse 76:6": "Een bron waarvan de dienaren van Allah drinken. Zij laten deze overvloedig stromen.",
            "verse 76:7": "Zij vervulden hun geloften. En zij vreesden een Dag waarvan het kwaad verschrikkelijk is.",
            "verse 76:8": "En zij gaven het voedsel waarvan zij hielden aan een arme, en een wees en een gevangene.",
            "verse 76:9": "(Zij zeiden:) \"Wij voeden jullie slechts omwille van het welbehagen van Allah, wij verlangen van jullie geen beloning en geen dank.",
            "verse 76:10": "Voorwaar, wij vrezen van onze Heer een angstaanjagende, huiveringwekkende Dag.\"",
            "verse 76:11": "Allah zal hen op die Dag beschermen voor het kwaad en hen glans en blijdschap schenken.",
            "verse 76:12": "En Hij zal hen vanwege hun geduldige volharding belonen met het Paradijs en met zijde.",
            "verse 76:13": "Leunend zitten zij daarin op rustbanken. Zij vinden daarin geen zon en geen kou.",
            "verse 76:14": "En haar schaduwen zijn voor hen dichtbij en haar vruchten zijn vlakbij, makkelijk te plukken.",
            "verse 76:15": "En onder hen wordt rondgegaan met kruiken van zilver en glazen als van kristal.",
            "verse 76:16": "Kristalhelder, van zilver gemaakt, die naar wens schenken.",
            "verse 76:17": "En daarin wordt er voor hen geschonken uit een beker waarvan de mengdrank gember is.",
            "verse 76:18": "Er bevindt zich daarin een bron die Salsabîl genoemd wordt.",
            "verse 76:19": "En onder hen wordt rondgegaan door eeuwig jeugdigen. Als jij hen ziet, dan denk jij dat zij verstrooide parels zijn.",
            "verse 76:20": "En als jij rondkijkt dan zie jij een genieting en een geweldig koninkrijk.",
            "verse 76:21": "Zij dragen kleren van fijne groene zijde en brokaat en zij zullen gesierd worden met zilveren armbanden. En hun Heer zal hen een pure drank schenken.",
            "verse 76:22": "(Er wordt gezegd:) \"Voorwaar, dat is een beloning voor jullie en jullie daden zijn aanvaard.\"",
            "verse 76:23": "Voorwaar, Wij zijn het Die de Koran in fasen tot jou neergezonden hebben.",
            "verse 76:24": "Wees dan geduldig met de wetten van jouw Heer en volg niet de zondaar of de ongelovige onder hen.",
            "verse 76:25": "En gedenk (in jouw shalât) de Naam van jouw Heer, in de ochtend en de avond.",
            "verse 76:26": "En in een gedeelte van de nacht, en kniel je neer voor Hem en prijs Zijn Glorie tijdens een lang deel van de nacht.",
            "verse 76:27": "Voorwaar, zij (de ongelovigen) houden van het voorbijgaande en leggen achter hun rug een zware Dag.",
            "verse 76:28": "Wij hebben hen geschapen en Wij hebben hun gestel stevig gemaakt. En als Wij het gewild hadden, dan zouden Wij hen vervangen door gelijksoortigen.",
            "verse 76:29": "Voorwaar, dit is een Vermaning. Wie het dan wil, laat hij een Weg naar zijn Heer nemen.",
            "verse 76:30": "En jullie zullen het niet willen, behalve als Allah het wil: voorwaar, Allah is Alwetend, Alwijs.",
            "verse 76:31": "Hij doet in Zijn Barmhartigheid binnengaan wie Hij wil. En Hij heeft een pijnlijke bestraffing bereid voor de onrechtvaardigen."
        },
        "English": {
            "verse 76:1": "Has there [not] come upon man a period of time when he was not a thing [even] mentioned?",
            "verse 76:2": "Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing.",
            "verse 76:3": "Indeed, We guided him to the way, be he grateful or be he ungrateful.",
            "verse 76:4": "Indeed, We have prepared for the disbelievers chains and shackles and a blaze.",
            "verse 76:5": "Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,",
            "verse 76:6": "A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance].",
            "verse 76:7": "They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread.",
            "verse 76:8": "And they give food in spite of love for it to the needy, the orphan, and the captive,",
            "verse 76:9": "[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude.",
            "verse 76:10": "Indeed, We fear from our Lord a Day austere and distressful.\"",
            "verse 76:11": "So Allah will protect them from the evil of that Day and give them radiance and happiness",
            "verse 76:12": "And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments].",
            "verse 76:13": "[They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold.",
            "verse 76:14": "And near above them are its shades, and its [fruit] to be picked will be lowered in compliance.",
            "verse 76:15": "And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],",
            "verse 76:16": "Clear glasses [made] from silver of which they have determined the measure.",
            "verse 76:17": "And they will be given to drink a cup [of wine] whose mixture is of ginger",
            "verse 76:18": "[From] a fountain within Paradise named Salsabeel.",
            "verse 76:19": "There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls.",
            "verse 76:20": "And when you look there [in Paradise], you will see pleasure and great dominion.",
            "verse 76:21": "Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink.",
            "verse 76:22": "[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\"",
            "verse 76:23": "Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively.",
            "verse 76:24": "So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever].",
            "verse 76:25": "And mention the name of your Lord [in prayer] morning and evening",
            "verse 76:26": "And during the night prostrate to Him and exalt Him a long [part of the] night.",
            "verse 76:27": "Indeed, these [disbelievers] love the immediate and leave behind them a grave Day.",
            "verse 76:28": "We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration.",
            "verse 76:29": "Indeed, this is a reminder, so he who wills may take to his Lord a way.",
            "verse 76:30": "And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise.",
            "verse 76:31": "He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment."
        },
        "Filipino": {
            "verse 76:1": "Hindi baga ang tao ay wala sa loob ng mahabang panahon at hindi man lamang nababanggit",
            "verse 76:2": "Katotohanang Aming nilikha ang tao mula sa Nutfah (magkahalong katas ng semilya ng lalaki at babae), upang siya ay Aming masubukan, kaya’t Aming ginawaran siya ng biyaya ng pandinig at pangmasid",
            "verse 76:3": "Katotohanang Aming itinuro sa kanya ang landas (na may kalayaan) na maging mabuti sa pasasalamat o kawalan ng pasasalamat",
            "verse 76:4": "At sa mga nagtatakwil sa pananampalataya ay Aming inihanda ang mga bakal na kadena, ang mga gapos (sa leeg) at Naglalagablab na Apoy",
            "verse 76:5": "Katotohanang sa mga Abrar (matutuwid na tao na nangangamba kay Allah at umiiwas sa kasalanan), ay magsisiinom sa kopita na ang laman nito (ay alak) na hinaluan ng tubig mula sa batis ng Paraiso na tinatawag na Kafur",
            "verse 76:6": "Sa isang bukal na kung saan ang mga tagapaglingkod ni Allah ay magsisiinom, na dumadaloy nang masagana at hindi magmamaliw",
            "verse 76:7": "(Sapagkat) sila nga ang nagsiganap ng kanilang tungkulin at nangamba sa Araw na ang kasamaan ay magsisipangalat nang malayo at malawak",
            "verse 76:8": "At sila ay nagkaloob ng pagkain dahilan sa pagmamahal kay Allah, sa nagdarahop, sa ulila at napipiit",
            "verse 76:9": "(Na nagsasabi): “Kami ay nagpakain sa inyo dahilan sa pagmamahal namin kay Allah. Kami ay hindi naghahangad 928 ng pabuya, gayundin ng pasasalamat mula sa inyo",
            "verse 76:10": "Katotohanang kami ay nangangamba sa aming Panginoon sa Araw ng kahirapan at kaguluhan na magdudulot sa mga mukha ng kalagim-lagim na anyo (dahilan sa matinding pag-ayaw dito).”",
            "verse 76:11": "Datapuwa’t sila ay iniligtas ni Allah sa kasamaan ng Araw na yaon at sila ay biniyayaan Niya ng Nadratan (isang Liwanag ng Kagandahan) at kaligayahan",
            "verse 76:12": "At sapagkat sila ay naging matiyaga at matatag (sa pananalig), si Allah ay magkakaloob sa kanila ng Halamanan (Paraiso) at mga kasuutang yari sa sutla",
            "verse 76:13": "Sila ay nakahimlay nang pahilig sa Halamanan sa mga nakataas na luklukan, at sila ay hindi makakamalas dito ng mahapding init ng araw o ng napakalamig na sinag ng buwan",
            "verse 76:14": "At ang lilim ng Halamanan ay bababa upang limliman sila at ang mga kumpol ng hitik na bunga ay nakabitin nang mababa na abot-kamay nila",
            "verse 76:15": "At sa kanila ay palibot na idudulot ang mabibilog na banga na yari sa pilak at mga kopitang kristal",
            "verse 76:16": "Kristal na kumikislap na gawa sa pilak. Tatamasahin nila ang anumang dami (sa sisidlan) sa anumang kanilang maibigan",
            "verse 76:17": "At sila ay dudulutan upang uminom sa kopita na ang laman (ay alak) na nahahaluan ng Zanjabil",
            "verse 76:18": "Mula sa isang bukal ng tubig doon na tinatawag na Salsabil",
            "verse 76:19": "At sa kanila ay magsisilbi ang mga kabataan na may hindi nagmamaliw na kasariwaan (kabataan), na kung inyong mapagmamalas, sila ay wari bang nagkalat na perlas (sa kariktan)",
            "verse 76:20": "At kung tutunghay kayo rito (Paraiso), kayo ay makakamalas ng Sukdol na Kaligayahan (na hindi mapapangarap at mauunawaan), at isang dakilang Paghahari",
            "verse 76:21": "Ang kanilang mga kasuutan ay kulay luntiang sutla na napapalamutihan ng ginto. Sila ay gagayakan ng mga pulseras na pilak at ang kanilang Panginoon ay magkakaloob sa kanila ng dalisay na inumin",
            "verse 76:22": "(At sa kanila ay ipagbabadya): “Katotohanang ito ang ganti sa inyo at ang inyong pinagsumikapan ay tinanggap na mainam (sa karangalan)”",
            "verse 76:23": "Katotohanang Kami ang nagpahayag ng Qur’an sa iyo (o Muhammad) sa sunod-sunod na antas (ng pagpapahayag)",
            "verse 76:24": "Kaya’t maging matiyaga at matimtiman ka (o Muhammad) at tumalima sa pag-uutos ng iyong Panginoon (si Allah, sa pamamagitan ng pagganap ng iyong tungkulin sa Kanya at sa pagpapalaganap ng Kanyang Mensahe sa sangkatauhan), at huwag kang makinig sa makasalanan, gayundin sa mga hindi sumasampalataya sa kanilang lipon",
            "verse 76:25": "At alalahanin ang Pangalan ng iyong Panginoon sa bawat umaga at hapon (alalaong baga, ang mag-alay ng panalangin sa umaga, tanghali at hapon)",
            "verse 76:26": "At sambahin Siya (sa pagpapatirapa) sa ilang bahagi ng gabi at papurihan Siya sa buong magdamag (alalaong baga, ang mag-alay ng panalangin sa takipsilim, gabi at sa gitna ng gabi)",
            "verse 76:27": "Katotohanan, ang mga hindi sumasampalataya ay nagmamahal (sa panandaliang) buhay sa mundong ito, at inilayo nila sa kanila (ang pag-aala-ala) sa Kasakit-sakit na Araw",
            "verse 76:28": "Kami (Allah) ang lumikha sa kanila at ginawa Naming matibay ang kanilang balangkas (ng buto). At kung Aming naisin, magagawa Naming palitan sila ng iba na katulad din nila, ng buong-buo",
            "verse 76:29": "Katotohanan! Ang (mga Talata ng Qur’an) ay isang Pagpapaala-ala (tagubilin), kaya’t sinuman ang magnais, hayaan siya na tahakin ang Landas tungo sa kanyang Panginoon (Allah)",
            "verse 76:30": "Ngunit malibang pahintulutan ni Allah, ito ay hindi ninyo magaganap. Katotohanang si Allah ay Lalagi nang Pinakamaalam, ang Tigib ng Karunungan",
            "verse 76:31": "Tatanggapin Niya ng Kanyang Habag ang sinumang Kanyang maibigan, datapuwa’t sa Zalimun (mga tampalasan, mapagsamba sa diyus-diyosan, pagano, makasalanan, walang pananalig, atbp.), sa kanila ay inihanda Niya ang Kasakit-sakit na Kaparusahan"
        },
        "French": {
            "verse 76:1": "S'est-il écoulé pour l'homme un laps de temps durant lequel il n'était même pas une chose mentionnable?",
            "verse 76:2": "En effet, Nous avons créé l'homme d'une goutte de sperme mélangé [aux composantes diverses] pour le mettre à l'épreuve. [C'est pourquoi] Nous l'avons fait entendant et voyant.",
            "verse 76:3": "Nous l'avons guidé dans le chemin, - qu'il soit reconnaissant ou ingrat -",
            "verse 76:4": "Nous avons préparé pour les infidèles des chaînes, des carcans et une fournaise ardente.",
            "verse 76:5": "Les vertueux boiront d'une coupe dont le mélange sera de camphre,",
            "verse 76:6": "d'une source de laquelle boiront les serviteurs d'Allah et ils la feront jaillir en abondance.",
            "verse 76:7": "Ils accomplissent leurs vœux et ils redoutent un jour dont le mal s'étendra partout.",
            "verse 76:8": "et offrent la nourriture, malgré son amour, au pauvre, à l'orphelin et au prisonnier,",
            "verse 76:9": "(disant): «C'est pour le visage d'Allah que nous vous nourrissons: nous ne voulons de vous ni récompense ni gratitude.",
            "verse 76:10": "Nous redoutons, de notre Seigneur, un jour terrible et catastrophique».",
            "verse 76:11": "Allah les protègera donc du mal de ce jour-là, et leur fera rencontrer la splendeur et la joie,",
            "verse 76:12": "et les rétribuera pour ce qu'ils auront enduré, en leur donnant le Paradis et des [vêtements] de soie,",
            "verse 76:13": "ils y seront accoudés sur des divans, n'y voyant ni soleil ni froid glacial.",
            "verse 76:14": "Ses ombrages les couvriront de près, et ses fruits inclinés bien bas [à portée de leurs mains].",
            "verse 76:15": "Et l'on fera circuler parmi eux des récipients d'argent et des coupes cristallines,",
            "verse 76:16": "en cristal d'argent, dont le contenu a été savamment dosé.",
            "verse 76:17": "Et là, ils seront abreuvés d'une coupe dont le mélange sera de gingembre,",
            "verse 76:18": "puisé là-dedans à une source qui s'appelle Salsabîl.",
            "verse 76:19": "Et parmi eux, circuleront des garçons éternellement jeunes. Quand tu les verras, tu les prendras pour des perles éparpillées.",
            "verse 76:20": "Et quand tu regarderas là-bas, tu verras un délice et un vaste royaume.",
            "verse 76:21": "Ils porteront des vêtements verts de satin et de brocart. Et ils seront parés de bracelets d'argent. Et leur Seigneur les abreuvera d'une boisson très pure.",
            "verse 76:22": "Cela sera pour vous une récompense, et votre effort sera reconnu.",
            "verse 76:23": "En vérité c'est Nous qui avons fait descendre sur toi le Coran graduellement.",
            "verse 76:24": "Endure donc ce que ton Seigneur a décrété, et n'obéis ni au pécheur, parmi eux, ni au grand mécréant.",
            "verse 76:25": "Et invoque le nom de ton Seigneur, matin et après-midi;",
            "verse 76:26": "et prosterne-toi devant Lui une partie de la nuit; et glorifie-Le de longues [heures] pendant la nuit.",
            "verse 76:27": "Ces gens-là aiment [la vie] éphémère (la vie sur terre) et laissent derrière eux un jour bien lourd [le Jour du Jugement].",
            "verse 76:28": "C'est Nous qui les avons créés et avons fortifié leur constitution. Quand Nous voulons, cependant, Nous les remplaçons [facilement] par leurs semblables.",
            "verse 76:29": "Ceci est un rappel. Que celui qui veut prenne donc le chemin vers son Seigneur!",
            "verse 76:30": "Cependant, vous ne saurez vouloir, à moins qu'Allah veuille. Et Allah est Omniscient et Sage.",
            "verse 76:31": "Il fait entrer qui Il veut dans Sa miséricorde. Et quant aux injustes, Il leur a préparé un châtiment douloureux."
        },
        "Fulah": {
            "verse 76:1": "Mbela arii e aade tumo e yonta nde o wonaana hay huunde jantateende",
            "verse 76:2": "Min tagii aade e toɓɓere jillunde ndiyam gorko e debbo Min kumpitoo mbo Min laatini mbo nanoowo ji*oowo",
            "verse 76:3": "Min peewnii mbo e laawol o yetta wollo o yedda",
            "verse 76:4": "Pellet Min keblinii heeferbe callalle e tonngi e yiite",
            "verse 76:5": "Pellet ɗigguɓe ɓe na yara e kaas jilluɗo kaafuur",
            "verse 76:6": "Seewnde nde jiyaaɓe Alla ɓallinaaɓe njarata hoɓe ilnande ilnugol",
            "verse 76:7": "Hoɓe kuuɓna takkere hoɓe kula ñalawma mbo bone mum na caroo",
            "verse 76:8": "Hoɓe ñammina ñamri wondude e yiɗde ndi miskiin e alyatiime e dahaaɗo",
            "verse 76:9": "Min ñamminirta mon ko sabi Alla Min faalaaka e mon njoɓdi wonah yetteede",
            "verse 76:10": "Pellet min kuli ummaade e joomi amen ko ñalawma nyirɓiniiɗo cattuɗo tumminaare",
            "verse 76:11": "Alla reeniɓe e bone oon ñalawma O okkiɓe pummam labaɗam e weltaare",
            "verse 76:12": "Alla yoɓiri ɓe koɓe muñi ko aljanna e hariir",
            "verse 76:13": "Hoɓe tuugnii e fotooyji ɓe yi*atah heen naange wonah jaangol cattungol",
            "verse 76:14": "Na ɓadi e dow mum en ɗowdi mammba ɓesnaaɗe mum na eeltanaaɓe eeltegol",
            "verse 76:15": "Ina taarneeɓe ngennduwon kaalis e kaasyon na feewnira weer",
            "verse 76:16": "Kaaseeje kaalis hoɗe potndira potndegol",
            "verse 76:17": "Hoɓe njarnee kaas njilludi mum ko janjabiil",
            "verse 76:18": "Seewnde na e hembo na inne Sal sabiil",
            "verse 76:19": "Sukaaɓe saasnaaɓe na mbanngo e mum en si a yi*iiɓe cikka ko ɓe lu*u lu*u caraaɗo",
            "verse 76:20": "Si a yi*i toon yi*a neema e laamu manngu",
            "verse 76:21": "Ina e dow mum en comci sundus ɗi mbaadi haaka hecco e istabraq ɓe ɓoorna jawe kaalis joom mum en yarnaɓe njaram laaɓɗam",
            "verse 76:22": "Pellet ɗum wonanii mon njoɓdi golle mon kadi golle mon ngoniina mantaaɗe",
            "verse 76:23": "Ko Minen tigi tellini Quraana e dow ma tellingol",
            "verse 76:24": "Muny e ñaawoore joom Ma woto ɗofto e mum en bakkadinɗo wolla keefeero",
            "verse 76:25": "janta inne joom ma subaka e kikiiɗa",
            "verse 76:26": "E jemma he sujjan Mbo cubahinanɗaa Mbo jemma juutɗo",
            "verse 76:27": "Pellet ɓe na njiɗi nguurndam aduna yaawɗam gasde ɓe acca caggal mum en ñalawma nisɗo",
            "verse 76:28": "Ko Minen tagi on Min cemmbini terɗo si Min haajaama Min gostoroo on nandadiiɓe mon gostogol",
            "verse 76:29": "Ko nde woni waaju goongo kala faalaaɗo daɗde nanngira faade e joomiiko ruttorde",
            "verse 76:30": "On paaletaake si wonah Alla haaje pellet Alla ko Ganndo ko ñeeño",
            "verse 76:31": "Hombo naatna mbo O welaa e yurmeene Makko O heblanii tooñɓe ɓe lepte muusɗe"
        },
        "German": {
            "verse 76:1": "Ist (nicht) über den Menschen eine Spanne der endlosen Zeit gekommen, in der er nichts Nennenswertes ist?",
            "verse 76:2": "Wir haben den Menschen ja aus einem Samentropfen, einem Gemisch erschaffen, (um) ihn zu prüfen. Und so haben Wir ihn mit Gehör und Augenlicht versehen.",
            "verse 76:3": "Wir haben ihn ja den (rechten) Weg geleitet, ob er nun dankbar oder undankbar sein mag.",
            "verse 76:4": "Wir haben ja für die Ungläubigen Ketten und Fesseln und eine Feuerglut bereitet.",
            "verse 76:5": "Gewiß, die Frommen trinken aus einem Becher, dessen Beimischung Kampfer ist,",
            "verse 76:6": "aus einer Quelle, aus der Allahs Diener trinken, die sie sprudelnd hervorströmen lassen.",
            "verse 76:7": "Sie erfüllen das Gelübde und fürchten einen Tag, dessen Übel sich wie im Flug ausbreitet,",
            "verse 76:8": "und sie geben - obwohl man sie liebt - Speise zu essen einem Armen, einer Waisen und einem Gefangenen:",
            "verse 76:9": "\"Wir speisen euch nur um Allahs Angesicht willen. Wir wollen von euch weder Belohnung noch Dank.",
            "verse 76:10": "Wir fürchten ja von unserem Herrn einen Tag, der düster blicken läßt, einen unheilvollen.\"",
            "verse 76:11": "So bewahrt sie Allah vor dem Übel jenes Tages und wird ihnen strahlendes Glück und Freude darbieten",
            "verse 76:12": "und ihnen vergelten, daß sie standhaft gewesen sind, mit einem Garten und mit Seide,",
            "verse 76:13": "worin sie sich auf überdachten Liegen lehnen, und worin sie weder (heiße) Sonne noch bittere Kälte wahrnehmen werden.",
            "verse 76:14": "Nahe über ihnen sind seine Schatten, und seine Früchte sind ihnen (zum Pflücken) sehr gefügig gemacht.",
            "verse 76:15": "Herumgereicht werden ihnen Gefäße aus Silber und Trinkschalen, die (wie) aus Glas sind,",
            "verse 76:16": "Gläser aus Silber, die sie im rechten Maß bemessen.",
            "verse 76:17": "Und zu trinken gegeben wird ihnen darin ein Becher, dessen Beimischung Ingwer ist,",
            "verse 76:18": "aus einer Quelle darin, die Salsabil genannt wird.",
            "verse 76:19": "Und unter ihnen gehen ewig junge Knaben umher. Wenn du sie siehst, hältst du sie für ausgestreute Perlen.",
            "verse 76:20": "Und wenn du dort hinsiehst, wirst du Wonne und ein großes Reich sehen.",
            "verse 76:21": "Auf ihnen werden grüne Gewänder aus Seidenbrokat sein und schwerer Brokat, und geschmückt werden sie sein mit Armreifen aus Silber. Und zu trinken wird ihr Herr ihnen ein reines\" Getränk geben.",
            "verse 76:22": "\"Dies ist ja der Lohn für euch, und euer Bemühen wird gedankt sein.\"",
            "verse 76:23": "Gewiß, Wir sind es, die Wir dir den Qur'an offenbart, ja offenbart haben.",
            "verse 76:24": "So sei standhaft in Bezug auf das Urteil deines Herrn, und gehorche von ihnen keinem Sündhaften oder sehr Undankbaren.",
            "verse 76:25": "Und gedenke des Namens deines Herrn morgens und abends,",
            "verse 76:26": "und in (einem Teil) der Nacht, da wirf dich vor Ihm nieder und preise Ihn lange Zeit zur Nacht.",
            "verse 76:27": "Diese da lieben ja das schnell Eintreffende und lassen hinter sich einen schwer lastenden Tag.",
            "verse 76:28": "Wir doch haben sie erschaffen und ihren Körperbau vollendet. Und wenn Wir wollen, tauschen Wir sie durch andere ihresgleichen aus.",
            "verse 76:29": "Gewiß, dies ist eine Erinnerung; wer nun will, nimmt (so diesen) einen Weg zu seinem Herrn.",
            "verse 76:30": "Und ihr könnt nicht(s) wollen, außer daß Allah (es) will. Gewiß, Allah ist All wissend und All weise.",
            "verse 76:31": "Er läßt, wen Er will, in Seine Barmherzigkeit eingehen. Und die Ungerechten, für sie hat Er schmerzhafte Strafe bereitet."
        },
        "Hausa": {
            "verse 76:1": "Lalle ne, wata mudda ta zamani tã zo a kan mutum, bai kasance kõme ba wanda ake ambata.",
            "verse 76:2": "Lalle ne, Mũ Mun halitta mutum daga ɗigon ruwa garwayayye, Muna jarraba shi, sabõda haka Muka sanya shi mai ji mai gani,",
            "verse 76:3": "Lalle ne, Mũ, Mun shiryar da shi ga hanyar ƙwarai, ko ya zama mai gõdiya, kuma ko ya zama mai kãfirci.",
            "verse 76:4": "Lalle ne, Mũ, Mun yi tattali, dõmin kãfirai, sarƙoƙi da ƙuƙumma da sa'ĩr.",
            "verse 76:5": "Lalle ne, mutãnen kirki zã su sha daga finjãlin giya abin gaurayarta yã kãsance kãfur ne.",
            "verse 76:6": "Wani marmaro ne, daga gare shi bayin Allah suke sha, suna ɓuɓɓugar da shi ɓuɓɓugarwa.",
            "verse 76:7": "Suna cikãwa da alwãshin (da suka bãkanta), kuma suna tsõron wani yini wanda sharrinsa ya kasance mai tartsatsi ne.",
            "verse 76:8": "Kuma suna ciyar da abinci, a kan suna bukãtarsa, ga matalauci da marãya da kãmamme.",
            "verse 76:9": "(Suna cẽwa): \"Munã ciyar da ku ne dõmin nẽman yardar Allah kawai, bã mu nufin sãmun wani sakamako daga gare ku, kuma bã mu nufin gõdiya.",
            "verse 76:10": "\"Lalle ne, mũ muna tsõro daga Ubangijinmu, wani yini mai gintsẽwa, mai murtukẽwa.\"",
            "verse 76:11": "Sabõda haka Allah Ya tsare musu sharrin wannan yini, kuma Ya hlɗa su da annũrin huska da farin ciki,",
            "verse 76:12": "Kuma Ya sãka musu sabõda haƙurin da suka yi, da Aljanna da tufãfin alharini.",
            "verse 76:13": "Sunã mãsu zaman ginciri, a cikinta, a kan karagu, bã su ganin rãnã a cikinta, kuma bã su ganin jaura.",
            "verse 76:14": "Kuma, inuwõyinta suna kusa, a kansu, an hõre nunannun 'yã'yan itãcenta, hõrẽwa.",
            "verse 76:15": "Kuma ana kẽwayãwa a kansu da finjãlai na azurfa da kofuna waɗanda suka kasance na ƙarau.",
            "verse 76:16": "¡arau na azurfa, sun ƙaddara su ƙaddarawa, daidai bukãta.",
            "verse 76:17": "Ana shayarwa da su, a cikinta, finjalan giya, wadda abin gaurayarta ya kasance zanjabil ne.",
            "verse 76:18": "Wani marmaro ne, a cikinta, ana kiran sa salsabil.",
            "verse 76:19": "Kuma wasu yara samãrin dindindin na kẽwayãwa, a kansu, idan ka gan su, zã ka zaci sũ lu'ulu'u ne wanda aka wãtsa.",
            "verse 76:20": "Kuma idan kã ga wannan wurin, to, kã ga wata irin ni'ima da mulki babba.",
            "verse 76:21": "Tufãfinsu na sama na alharĩ ni ne, kõre da mai walƙiya, kuma an ƙawãce su da mundãye na wata curin azurfa kuma Ubangijinsu, Ya shãyar da su abin sha mai tsarkakẽwar (ciki).",
            "verse 76:22": "(A ce musu) \"Lalle ne, wannan ya kasance, a gare ku sakamako, kuma aikink. ya kasance abin gõdewa.\"",
            "verse 76:23": "Lalle, Mũ ne Muka saukar da Alƙur'ãni a gare ka, saukarwa.",
            "verse 76:24": "Sabõda haka ka yi haƙuri ga hukuncin Ubangijinka, kuma kada ka bi, daga cikinsu, mai zunubi ko mai kãfirci.",
            "verse 76:25": "Kuma ka ambaci sũnan Ubangijinka, sãfe da maraice.",
            "verse 76:26": "Daga dare, sai ka yi sujũda gare Shi, kuma ka tsarkake Shi darẽ mai tsawo.",
            "verse 76:27": "Lalle ne, waɗannan suna son mai gaugãwa (dũniya) kuma suna bari, a bãyansu, wani yini mai nauyi.",
            "verse 76:28": "Mũ ne Muka halitta su kuma Muka, ƙarfafa halittarsu, kuma idan Mun so, za Mu musanyâ su da wasu mutane kwatankwacinsu, musanyawa.",
            "verse 76:29": "Lalle ne, wannan wata tunãtarwa ce, saboda wanda ya so ya riƙa hanyar kirki zuwa ga Ubangijinsa.",
            "verse 76:30": "Kuma, bã zã ku so ba, sai Allah Ya so, lalle ne Allah Yã kasance Masani' Mai hikima.",
            "verse 76:31": "Yana shigar da wanda Ya so a cikin rahamarsa, kuma azzãlumai, Yã yi musu tattalin wata azãba mai raɗaɗi."
        },
        "Hindi": {
            "verse 76:1": "बेशक इन्सान पर एक ऐसा वक्त अा चुका है कि वह कोई चीज़ क़ाबिले ज़िक्र न था",
            "verse 76:2": "हमने इन्सान को मख़लूत नुत्फे से पैदा किया कि उसे आज़माये तो हमने उसे सुनता देखता बनाया",
            "verse 76:3": "और उसको रास्ता भी दिखा दिया (अब वह) ख्वाह शुक्र गुज़ार हो ख्वाह नाशुक्रा",
            "verse 76:4": "हमने काफ़िरों के ज़ंजीरे, तौक और दहकती हुई आग तैयार कर रखी है",
            "verse 76:5": "बेशक नेकोकार लोग शराब के वह सागर पियेंगे जिसमें काफूर की आमेज़िश होगी ये एक चश्मा है जिसमें से ख़ुदा के (ख़ास) बन्दे पियेंगे",
            "verse 76:6": "और जहाँ चाहेंगे बहा ले जाएँगे",
            "verse 76:7": "ये वह लोग हैं जो नज़रें पूरी करते हैं और उस दिन से जिनकी सख्ती हर तरह फैली होगी डरते हैं",
            "verse 76:8": "और उसकी मोहब्बत में मोहताज और यतीम और असीर को खाना खिलाते हैं",
            "verse 76:9": "(और कहते हैं कि) हम तो तुमको बस ख़ालिस ख़ुदा के लिए खिलाते हैं हम न तुम से बदले के ख़ास्तगार हैं और न शुक्र गुज़ारी के",
            "verse 76:10": "हमको तो अपने परवरदिगार से उस दिन का डर है जिसमें मुँह बन जाएँगे (और) चेहरे पर हवाइयाँ उड़ती होंगी",
            "verse 76:11": "तो ख़ुदा उन्हें उस दिन की तकलीफ़ से बचा लेगा और उनको ताज़गी और ख़ुशदिली अता फरमाएगा",
            "verse 76:12": "और उनके सब्र के बदले (बेहिश्त के) बाग़ और रेशम (की पोशाक) अता फ़रमाएगा",
            "verse 76:13": "वहाँ वह तख्तों पर तकिए लगाए (बैठे) होंगे न वहाँ (आफताब की) धूप देखेंगे और न शिद्दत की सर्दी",
            "verse 76:14": "और घने दरख्तों के साए उन पर झुके हुए होंगे और मेवों के गुच्छे उनके बहुत क़रीब हर तरह उनके एख्तेयार में",
            "verse 76:15": "और उनके सामने चाँदी के साग़र और शीशे के निहायत शफ्फ़ाफ़ गिलास का दौर चल रहा होगा",
            "verse 76:16": "और शीशे भी (काँच के नहीं) चाँदी के जो ठीक अन्दाज़े के मुताबिक बनाए गए हैं",
            "verse 76:17": "और वहाँ उन्हें ऐसी शराब पिलाई जाएगी जिसमें जनजबील (के पानी) की आमेज़िश होगी",
            "verse 76:18": "ये बेहश्त में एक चश्मा है जिसका नाम सलसबील है",
            "verse 76:19": "और उनके सामने हमेशा एक हालत पर रहने वाले नौजवाल लड़के चक्कर लगाते होंगे कि जब तुम उनको देखो तो समझो कि बिखरे हुए मोती हैं",
            "verse 76:20": "और जब तुम वहाँ निगाह उठाओगे तो हर तरह की नेअमत और अज़ीमुश शान सल्तनत देखोगे",
            "verse 76:21": "उनके ऊपर सब्ज़ क्रेब और अतलस की पोशाक होगी और उन्हें चाँदी के कंगन पहनाए जाएँगे और उनका परवरदिगार उन्हें निहायत पाकीज़ा शराब पिलाएगा",
            "verse 76:22": "ये यक़ीनी तुम्हारे लिए होगा और तुम्हारी (कारगुज़ारियों के) सिले में और तुम्हारी कोशिश क़ाबिले शुक्र गुज़ारी है",
            "verse 76:23": "(ऐ रसूल) हमने तुम पर क़ुरान को रफ्ता रफ्ता करके नाज़िल किया",
            "verse 76:24": "तो तुम अपने परवरदिगार के हुक्म के इन्तज़ार में सब्र किए रहो और उन लोगों में से गुनाहगार और नाशुक्रे की पैरवी न करना",
            "verse 76:25": "सुबह शाम अपने परवरदिगार का नाम लेते रहो",
            "verse 76:26": "और कुछ रात गए उसका सजदा करो और बड़ी रात तक उसकी तस्बीह करते रहो",
            "verse 76:27": "ये लोग यक़ीनन दुनिया को पसन्द करते हैं और बड़े भारी दिन को अपने पसे पुश्त छोड़ बैठे हैं",
            "verse 76:28": "हमने उनको पैदा किया और उनके आज़ा को मज़बूत बनाया और अगर हम चाहें तो उनके बदले उन्हीं के जैसे लोग ले आएँ",
            "verse 76:29": "बेशक ये कुरान सरासर नसीहत है तो जो शख़्श चाहे अपने परवरदिगार की राह ले",
            "verse 76:30": "और जब तक ख़ुदा को मंज़ूर न हो तुम लोग कुछ भी चाह नहीं सकते बेशक ख़ुदा बड़ा वाक़िफकार दाना है",
            "verse 76:31": "जिसको चाहे अपनी रहमत में दाख़िल कर ले और ज़ालिमों के वास्ते उसने दर्दनाक अज़ाब तैयार कर रखा है"
        },
        "Indonesian": {
            "verse 76:1": "Bukankah telah datang atas manusia satu waktu dari masa, sedang dia ketika itu belum merupakan sesuatu yang dapat disebut?",
            "verse 76:2": "Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur yang Kami hendak mengujinya (dengan perintah dan larangan), karena itu Kami jadikan dia mendengar dan melihat.",
            "verse 76:3": "Sesungguhnya Kami telah menunjukinya jalan yang lurus; ada yang bersyukur dan ada pula yang kafir.",
            "verse 76:4": "Sesungguhnya Kami menyediakan bagi orang-orang kafir rantai, belenggu dan neraka yang menyala-nyala.",
            "verse 76:5": "Sesungguhnya orang-orang yang berbuat kebajikan minum dari gelas (berisi minuman) yang campurannya adalah air kafur,",
            "verse 76:6": "(yaitu) mata air (dalam surga) yang daripadanya hamba-hamba Allah minum, yang mereka dapat mengalirkannya dengan sebaik-baiknya.",
            "verse 76:7": "Mereka menunaikan nazar dan takut akan suatu hari yang azabnya merata di mana-mana.",
            "verse 76:8": "Dan mereka memberikan makanan yang disukainya kepada orang miskin, anak yatim dan orang yang ditawan.",
            "verse 76:9": "Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih.",
            "verse 76:10": "Sesungguhnya kami takut akan (azab) Tuhan kami pada suatu hari yang (di hari itu) orang-orang bermuka masam penuh kesulitan.",
            "verse 76:11": "Maka Tuhan memelihara mereka dari kesusahan hari itu, dan memberikan kepada mereka kejernihan (wajah) dan kegembiraan hati.",
            "verse 76:12": "Dan Dia memberi balasan kepada mereka karena kesabaran mereka (dengan) surga dan (pakaian) sutera,",
            "verse 76:13": "di dalamnya mereka duduk bertelakan di atas dipan, mereka tidak merasakan di dalamnya (teriknya) matahari dan tidak pula dingin yang bersangatan.",
            "verse 76:14": "Dan naungan (pohon-pohon surga itu) dekat di atas mereka dan buahnya dimudahkan memetiknya semudah-mudahnya.",
            "verse 76:15": "Dan diedarkan kepada mereka bejana-bejana dari perak dan piala-piala yang bening laksana kaca,",
            "verse 76:16": "(yaitu) kaca-kaca (yang terbuat) dari perak yang telah diukur mereka dengan sebaik-baiknya.",
            "verse 76:17": "Di dalam surga itu mereka diberi minum segelas (minuman) yang campurannya adalah jahe.",
            "verse 76:18": "(Yang didatangkan dari) sebuah mata air surga yang dinamakan salsabil.",
            "verse 76:19": "Dan mereka dikelilingi oleh pelayan-pelayan muda yang tetap muda. Apabila kamu melihat mereka, kamu akan mengira mereka, mutiara yang bertaburan.",
            "verse 76:20": "Dan apabila kamu melihat di sana (surga), niscaya kamu akan melihat berbagai macam kenikmatan dan kerajaan yang besar.",
            "verse 76:21": "Mereka memakai pakaian sutera halus yang hijau dan sutera tebal dan dipakaikan kepada mereka gelang terbuat dari perak, dan Tuhan memberikan kepada mereka minuman yang bersih.",
            "verse 76:22": "Sesungguhnya ini adalah balasan untukmu, dan usahamu adalah disyukuri (diberi balasan).",
            "verse 76:23": "Sesungguhnya Kami telah menurunkan Al Quran kepadamu (hai Muhammad) dengan berangsur-angsur.",
            "verse 76:24": "Maka bersabarlah kamu untuk (melaksanakan) ketetapan Tuhanmu, dan janganlah kamu ikuti orang yang berdosa dan orang yang kafir di antar mereka.",
            "verse 76:25": "Dan sebutlah nama Tuhanmu pada (waktu) pagi dan petang.",
            "verse 76:26": "Dan pada sebagian dari malam, maka sujudlah kepada-Nya dan bertasbihlah kepada-Nya pada bagian yang panjang dimalam hari.",
            "verse 76:27": "Sesungguhnya mereka (orang kafir) menyukai kehidupan dunia dan mereka tidak memperdulikan kesudahan mereka, pada hari yang berat (hari akhirat).",
            "verse 76:28": "Kami telah menciptakan mereka dan menguatkan persendian tubuh mereka, apabila Kami menghendaki, Kami sungguh-sungguh mengganti (mereka) dengan orang-orang yang serupa dengan mereka.",
            "verse 76:29": "Sesungguhnya (ayat-ayat) ini adalah suatu peringatan, maka barangsiapa menghendaki (kebaikan bagi dirinya) niscaya dia mengambil jalan kepada Tuhannya.",
            "verse 76:30": "Dan kamu tidak mampu (menempuh jalan itu), kecuali bila dikehendaki Allah. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha Bijaksana.",
            "verse 76:31": "Dan memasukkan siapa yang dikehendaki-Nya ke dalam rahmat-Nya (surga). Dan bagi orang-orang zalim disediakan-Nya azab yang pedih."
        },
        "Italian": {
            "verse 76:1": "Non è forse trascorso un lasso di tempo in cui l'uomo non sia stato una creatura degna di menzione?",
            "verse 76:2": "Invero creammo l'uomo, per metterlo alla prova, da una goccia di sperma eterogenea e abbiamo fatto sì che sentisse e vedesse",
            "verse 76:3": "e gli abbiamo indicato la Retta Via, sia esso riconoscente o ingrato.",
            "verse 76:4": "In verità abbiamo preparato per i miscredenti catene, gioghi e la Fiamma.",
            "verse 76:5": "In verità i giusti berranno da una coppa in cui è un miscuglio di [acqua e di] Kafûr,",
            "verse 76:6": "[attinta da una] fonte da cui berranno i servi di Allah, che la faranno fluire con abbondanza,",
            "verse 76:7": "coloro che assolvono ai loro voti e temono il giorno il cui male si propagherà ovunque,",
            "verse 76:8": "[loro] che, nonostante il loro bisogno, nutrono il povero, l'orfano e il prigioniero;",
            "verse 76:9": "[e interiormente affermano:] “È solo per il volto di Allah, che vi nutriamo; non ci aspettiamo da voi né ricompensa, né gratitudine.",
            "verse 76:10": "Invero noi temiamo un Giorno terribile e catastrofico da parte del nostro Signore”.",
            "verse 76:11": "Allah li preserverà dal male di quel Giorno e verserà su di loro splendore e gioia,",
            "verse 76:12": "li compenserà del loro perseverare con il Giardino e la seta.",
            "verse 76:13": "Adagiati su alti divani, non dovranno subire né il sole, né il freddo pungente.",
            "verse 76:14": "Le sue ombre li copriranno e i suoi frutti penderanno a portata di mano.",
            "verse 76:15": "Verranno serviti da un vassoio d'argento e coppe di cristallo,",
            "verse 76:16": "di cristallo e d'argento, convenientemente riempite.",
            "verse 76:17": "E berranno colà, da una coppa contenente una mistura di zenzero,",
            "verse 76:18": "[attinta] da una fonte di quel luogo chiamata Salsabîl.",
            "verse 76:19": "Saranno serviti da fanciulli di eterna giovinezza: vedendoli, ti sembreranno perle sparse.",
            "verse 76:20": "Quando lo vedrai, vedrai delizia e un vasto regno.",
            "verse 76:21": "Indosseranno abiti verdi di seta finissima e broccato. Saranno ornati con bracciali d'argento e il loro Signore darà loro una bevanda purissima.",
            "verse 76:22": "In verità questo vi sarà concesso in ricompensa e il vostro sforzo sarà riconosciuto.",
            "verse 76:23": "In verità siamo stati Noi a far scendere gradualmente il Corano su di te.",
            "verse 76:24": "Sii paziente [nell'attesa] del Decreto del tuo Signore e non obbedire al peccatore e all'ingrato dei loro.",
            "verse 76:25": "Menziona il Nome del tuo Signore, al mattino e alla sera,",
            "verse 76:26": "e durante la notte prosternati a Lui e glorificaLo a lungo nella notte.",
            "verse 76:27": "Coloro che amano l'effimero trascurano un Giorno grave.",
            "verse 76:28": "Siamo stati Noi a crearli e a consolidare le loro giunture. Se volessimo, li sostituiremmo con altri loro simili.",
            "verse 76:29": "In verità questo è un Monito. Chi vuole, intraprenda dunque la via che conduce al suo Signore.",
            "verse 76:30": "Ma voi lo vorrete solo se Allah lo vuole. Allah è sapiente e saggio.",
            "verse 76:31": "Introduce chi vuole nella Sua misericordia, mentre per gli ingiusti ha preparato un doloroso castigo."
        },
        "Japanese": {
            "verse 76:1": "人間には，なにものとも呼べない，長い時期があったではないか。",
            "verse 76:2": "本当にわれはかれを試みるため混合した一滴の精液から人間を創った。それでわれは聴覚と視覚をかれに授けた。",
            "verse 76:3": "われは，人間に（正しい）道を示した。感謝する者（信じる者）になるか，信じない者になるか，と。",
            "verse 76:4": "不信心者には，われは鎖と首枷と烈火を準備して置いた。",
            "verse 76:5": "（信者の）善行者は，カーフールを混ぜた杯（の飲物）を飲むであろう。",
            "verse 76:6": "（それは）アッラーのしもべたちが飲む泉のことで，われは思いのままに滾々と（泉を）涌き出させる。",
            "verse 76:7": "かれら（善行者）は誓いを果し，災厄の広がる日を恐れている。",
            "verse 76:8": "またかれらは，かれを敬愛するために，貧者と孤児と捕虜に食物を与える。",
            "verse 76:9": "（そして言う。）「わたしたちは，アッラーの御喜びを願って，あなたがたを養い，あなたがたに報酬も感謝も求めません。",
            "verse 76:10": "わたしたちは，主の苦渋に満ちた御怒りの日を恐れます」。",
            "verse 76:11": "それでアッラーは，その日の災厄からかれらを守り，素晴しい喜びを与えられる。",
            "verse 76:12": "かれらが耐え忍んだので，かれは楽園と絹（の衣）でかれらに報われ，",
            "verse 76:13": "その（楽園の）中で，寝床の上にゆったりと身を伸ばし，かれらは酷暑の太陽も，水る寒気もおぼえないであろう。",
            "verse 76:14": "（樹木の）木陰はかれらの上を覆い，（果実の）房は慎ましく垂れ下る。",
            "verse 76:15": "銀の水差しとガラスの杯は，かれらの間に回されよう。",
            "verse 76:16": "ガラス（の杯と見えたの）は銀で造られていて，かれらは好みの量をそれに満たす。",
            "verse 76:17": "かれらはそこて，生姜を混ぜた杯の飲物を与えられよう。",
            "verse 76:18": "そこに，サルサビールと名付けられる泉がある。",
            "verse 76:19": "また永遠の少年たちがかれらの間を往米し，あなたがかれらを見ると，(捲?)き散らされた真珠であると思うであろう。",
            "verse 76:20": "あなたは視線を向けると至福の壮大な三国を認めるであろう。",
            "verse 76:21": "かれらは美しい緑色の絹と錦の外衣を纒い，銀の腕輪で飾られ，主はかれらに純良な飲物を飲ませられる。",
            "verse 76:22": "「本当にこれはあなたがたに対する報奨である。あなたがたの努力が受け入られたのである。」（と仰せられよう）。",
            "verse 76:23": "われこそは，段階をおってあなたにクルアーンを下したものである。",
            "verse 76:24": "だから（伝道に専念し），あなたの主の審判を耐え忍んで待て。かれらの中の罪ある者や，不信心者に従ってはならない。",
            "verse 76:25": "朝な夕な，あなたの主の御名を唱念しなさい。",
            "verse 76:26": "そして夜の一部をかれにサジダし，長夜のしじまに，かれを讃えなさい。",
            "verse 76:27": "本当にこれらの者は，束の間の生活を愛し，重大な日を背後に捨て去る。",
            "verse 76:28": "かれを創り，その四肢を堅く縛ぎ止めたのはわれである。われが欲するならば，かれらと類似の外のもので置き替えることも出来るのである。",
            "verse 76:29": "本当にこれは一つの訓戒である。だから誰でも望む者には，かれの主への道をとらせなさい。",
            "verse 76:30": "だがアッラーが御望みにならなければ，あなたがたは欲しないであろう。アッラーは全知にして英明であられる。",
            "verse 76:31": "かれは，御心に適う者を慈悲に浴させ，また不義の徒に対しては痛烈な懲罰を備えられる。"
        },
        "Jawa": {
            "verse 76:1": "Temen wus tumeka marang manungsa sawijining waktu, nalikane dheweke dudu barang kang kocap",
            "verse 76:2": "Sayekti Ingsun nitahake manungsa saka nutfah kang campur, dheweke bakal Ingsun coba, mulane Ingsun dadekake bisa ngrungu, bisa deleng",
            "verse 76:3": "Sayekti Ingsun anuduhake dalane, apa dheweke arep sukur apa arep maido (kufur)",
            "verse 76:4": "Ingsun nyadhiani rante lan belenggu marang para wong kafir apa dene Ingsun sadiyani neraka Sa’ir",
            "verse 76:5": "Sarupaning wong kang padha ngestokake dhawuhing Allah, iku ana ing suwarga padha ngombe saka pinggan kang campurane toya kafuur (jenenge sumber banyu ing suwarga)",
            "verse 76:6": "Para kekasihe Allah padha ngombe banyu sumber kang diilekake kelawan gampang",
            "verse 76:7": "Mulane tampa ganjaran samono, awit para kekasih mau padha netepi kuwajibane ngabekti ing Allah (ngelaksanaaken nadzar) lan padha wedi dina Qiyamat kang wartane dadi horege bumi (mratani bumi)",
            "verse 76:8": "Sarta aweh pangan, amarga saka tresnane ing Panjenengane, marang wong miskin sarta bocah yatim apa dene wong tawanan (kinunjara)",
            "verse 76:9": "Anggonku aweh panganan marang kowe iku mung murih ganjaraning Allah, ora pisan ngarep - arep wewales utawa panarima saka kowe",
            "verse 76:10": "Aku wedi ing Allah Pangeranku besuk ing dina Qiyamat",
            "verse 76:11": "Mulane Allah ngersakake para kekasihe mau didohake saka sarupane hala lan padha diparingi rupa bagus lan ulat bingar ati bungah",
            "verse 76:12": "Allah ganjar suwarga lan panganggo sutra marang para kekasihe amarga anggone padha sabar",
            "verse 76:13": "Ana ing kono padha linggih ana dipan ora kroso panas lan adhem padhang tanpa srengenge lan rembulan",
            "verse 76:14": "Kekayoning suwarga kang cedhek wohe gampang banget dipethik",
            "verse 76:15": "Padha diladeni nganggo wadhah selaka tuwin pinggan kang bening kaya kaca",
            "verse 76:16": "(Bening) kaya kaca - kaca (kang digawe) saka perak sing diukir dheweke sak apik - apike",
            "verse 76:17": "Ing suwarga mau dheweke diladeni unukkan kang campurane jahe",
            "verse 76:18": "Saka sumber banyu sajeroning suwarga arane Salsabil",
            "verse 76:19": "Padha diladeni para peladen nom - noman kang tetep enome pandelengira marang dheweke mau saking dening baguse prasasat mutiara durung dironce",
            "verse 76:20": "Manawa sira deleng suwarga kaya sarupangin kabungahan lan kraton gedhe",
            "verse 76:21": "Dheweke dienggon - enggoni sandhangan sutra alus ijo sarta sutra kandel sinulam benang emas apa dene bakal rinengga gelang salaka, lan Pangerane aparing ngombe dheweke omben - omben kang suci",
            "verse 76:22": "Sayekti iku pituwas marang sira lan budi dayamu bakal winales",
            "verse 76:23": "Sayekti Ingsun andhawuhake al-Quran marang sira kalawan dhumawuh (saka sathithik)",
            "verse 76:24": "Mulane sira narimaa hukume Pangeranira lan aja manut wong duraka utawa wong kafir",
            "verse 76:25": "Lan nyebuta asmaning Pangeranira (ana sajeroning sholat) wayah isuk lan sore",
            "verse 76:26": "Lan ing wayah wengi shalata lan sujuda ing Allah, apadene nyebuta Maha Suci ing Allah ing wayah wengi, kang dawa",
            "verse 76:27": "Awit satemene wong kafir iku padha dhemen oleh kabungahan kencengan lan ora perduli dina Qiyamat, kang bakal kelakon ing buri, kacarita akeh pakewuh kang abot",
            "verse 76:28": "Ingsun wis gawe wong kafir mau sarta awake Ingsun gawe gagah prakosa, nanging manawa ana parenge kersaningsun wong kafir mau Ingsun gawekake tandhing kang dadi mungsuhe, kang timbang gagah prakosane bakal numpes dheweke",
            "verse 76:29": "(Surat/ayat iku) dadi wewulang sing sapa dhemen wewulang mau dienggo wewaton ngabekti ing Allah Pangerane",
            "verse 76:30": "Lan ora bakal sira gelem kajaba yen Allah ngarsakake. Sayekti Allah iku ngudaneni tur wicaksana",
            "verse 76:31": "Panjenengane ganjar wong kang dadi parenge kersane, dilebokake ing suwarga rahmate Allah, lan ngancam siksa nglarani tumrap para nganiaya"
        },
        "Kazakh": {
            "verse 76:1": "Адамға ол еске алынбаған кезінен жаратылғанға дейін біраз уақыт өтпеді ме",
            "verse 76:2": "Ақиқатында, Біз адам баласын араласқан бір тамшыдан жараттық. Біз оны сынаймыз. Сөйтіп, оны еститін, көретін еттік",
            "verse 76:3": "Күмәнсіз, Біз оны тура жолға түсірдік. Ол не шүкір етер Раббысының берген игіліктеріне алғыс білдірер , немесе күпірлік етер ол игіліктерді мойындамай теріске шығарар",
            "verse 76:4": "Ақиқатында, Біз, кәпірлер үшін шынжырлар, бұғаулар және Саъирді әзірледік",
            "verse 76:5": "Әлбетте ізгілер кафур араластырған кеседен сусын ішеді",
            "verse 76:6": "Аллаһтың құлдары ішетін бір бұлақтан, олар оны қалағанынша ағызады",
            "verse 76:7": "Олар нәзірді Аллаһ жолына атағанын орындайды және жамандығы кең жайылатын Күннен қорқады",
            "verse 76:8": "Өздері тамақты қалап тұрғанына қарамастан, оны кедейге, жетімге және тұтқынға жегізеді",
            "verse 76:9": "Олар!: «Шын мәнінде біз сендерді Аллаһтың дидары үшін тамақтандырамыз. Сендерден сый да, алғыс та қаламаймыз",
            "verse 76:10": "Ақиқатында, біз Раббымыздан болатын түнерген, ауыр бір Күннен қорқамыз», дейді",
            "verse 76:11": "Аллаһ оларды сол Күннің жамандығынан сақтап, оларға жарқындық пен қуаныш нәсіп етеді",
            "verse 76:12": "және сабыр еткендері үшін оларға Жәннаттағы бақ пен жібекті қайтарым сый етіп береді",
            "verse 76:13": "Олар онда перделермен сәнделгенжұмсақ сәкілерде сүйеніп отырады. Олар онда күнді де, аязды да көрмейді",
            "verse 76:14": "Әрі оларға оның көлеңкелері жақын, ал жемістері төмен иіліп тұрады",
            "verse 76:15": "Және оларды күміс ыдыстармен, шыны көзелермен айналып жүреді",
            "verse 76:16": "Ал шынысы күмістен. бұл ыдыстар сайма-сай өлшеніп қойылған",
            "verse 76:17": "Әрі оларға зәнжәбил сусыны араластырылған кеседен ішкізіледі",
            "verse 76:18": "«Сәлсәбил» деп аталатын бұлақтан",
            "verse 76:19": "Әрі оларды мәңгі жас өрендер айналып қызмет етіп жүреді. Оларды көргеніңде, шашылған інжу деп ойлайсың",
            "verse 76:20": "Әрі көрген кезде, онда жәннатта игілік әрі ұлы патшалықты көресің",
            "verse 76:21": "Олардың жәннаттықтардың үстерінде жұқа және қалың жасыл жібек киімдер болады, олар күміс білезіктермен безендіріледі, әрі Оларға Раббысы тап-таза сусын ішкізеді",
            "verse 76:22": "Оларға : «Ақиқатында, бұл сендерге қайтарым ретінде берілген сый, сендердің әрекет-талпыныстарың алғысқа бөленді», делінеді",
            "verse 76:23": "Ей, Мұхаммед! Ақиқатында, Біз саған Құранды бөліп-бөліп біртіндеп түсірдік",
            "verse 76:24": "Раббыңның үкіміне сабыр ет. Олардың ішіндегі күнәһарға да, кәпірге де бағынба",
            "verse 76:25": "Әрі таңертең және кешке Раббыңның есімін есіңе ал",
            "verse 76:26": "Ал, түннің бөлігінде Оған сәжде жаса әрі ұзын түнде Оны дәріпте",
            "verse 76:27": "Ақиқатында, бұлар имансыздар тез өтетінді осы дүниені жақсы көріп, ауыр Күнді қияметті арттарына қалдырады",
            "verse 76:28": "Біз оларды жаратып, тұла бойын бекіттік. Егер қаласақ, оларды өздеріне ұқсағандармен алмастыра аламыз",
            "verse 76:29": "Анығында, бұл еске салу насихат . Енді кім қаласа, Раббысына апаратын жол ұстанады",
            "verse 76:30": "Алайда, Аллаһ қаламайынша, сендер бұны қалай алмайсыңдар. Ақиқатында, Аллаһ Білуші, аса Дана",
            "verse 76:31": "Ол қалағанын мейіріміне кіргізеді. Ал, әділетсіздер үшін Ол күйзелтуші азап әзірледі"
        },
        "Korean": {
            "verse 76:1": "인간은 시간의 흐름 속에서 언급조차 되지 않던 시기가 있지 않았던가인간에 관하여 언급할 만한 어떤 것도 없었던 오랜 기간이 흘렀노라",
            "verse 76:2": "실로 나는 인간을 혼합된 방울로부터 창조하였고 그를 시험하니 그를 듣고 보는 자로 두었노라실로 하나님은 혼합된 한방울의 정액으로써 인간을 창조하사 그를 시험하기 위해서라 그리하 여 하나님은 인간에게 청각과 시 력을 부여하고",
            "verse 76:3": "실로 나는 그에게 길을 가리켜 주었으니 (그는) 감사하는 자거나 불신하는 자더라길을 제시하여 주었으되 인 간이 감사하고 불신하는 것은 그 의 선택이라",
            "verse 76:4": "실로 나는 불신자들에게 사슬과 멍에와 화염을 준비해 두었노라그러나 불신자들에게는 쇠사 슬과 멍에와 타오르는 불지옥을 준비하였고",
            "verse 76:5": "실로 신앙인은 술잔을 마시는데 그것에 섞인 것은 장뇌라의로운 자들을 위해서는 그들이 마실 카푸르가 혼합된 술을 마실 잔을 준비하셨노라",
            "verse 76:6": "하나님의 종복들은 그것(장뇌)이 맞닿은 우물을 마시니 그들은 그것(우물)을 풍성히 길러내더라그것은 하나님의 종들이 마 실 샘물로 그들이 원하는대로 길 러오니라",
            "verse 76:7": "그들은 맹세의 말을 준수하며, 사악함이 몰아칠 그날을 두려워하고그들은 약속을 수행하였고 멀리서 퍼져 다가올 사악한 어떤 그날을 두려워 했으며",
            "verse 76:8": "불우한 자와 고아와 포로에게 자신이 애착하는 음식을 주더라그들은 하나님을 사랑하여 가난한 자와 고아와 포로들에게 먹 을 음식을 제공하며",
            "verse 76:9": "우리가 그대들에게 음식을 줌은 오직 하나님의 얼굴을 위함이며 우리는 그대들로부터 보상이나 감사도 원하지 않노라우리는 하나님만을 위해 여러분에게 음식을 제공할 뿐 어떤 보상이나 감사도 원치 아니합니다 라고 말하고",
            "verse 76:10": "실로 우리는 얼굴을 찌푸려야 할 험난한 날에 우리의 주님을 두려워하노라실로 우리는 주님께서 엄하고 크게 노여워 하실 어느 날을 두려워합니다 라고 하더라",
            "verse 76:11": "그리하여 하나님께서는 그날의 사악함으로부터 그들을 구해 주셨으며 그들이 포근함과 즐거움을 영접토록 해주셨노라그러나 하나님은 그날의 사악함으로부터 그들을 구하사 그들에게 기쁨과 행복을 주실 것이라",
            "verse 76:12": "그리고 그분께서는 그들의 인내에 대해 보상하셨으니 천국과 비단이라이는 그들이 인내하였기 때문으로 그분께서 천국과 명주의 의상으로 그들을 보상하실 것이 니",
            "verse 76:13": "그곳에서 그들은 차양이 드리워진 침대 위에 몸을 기대고, 그곳에서 그들은 태양을 보지 않으며 된추위도 없노라그들은 천국의 높은 안락의자에 기대어 작열하는 태양의 열 사와 추위도 맛보지 아니 하노라",
            "verse 76:14": "그곳의 그늘은 그들에게 드리워져 있으며 그곳의 과실은 (따기가) 매우 수월해져 있노라천국의 그늘이 그들 위로 내려져 있으며 과일들은 그들의 손 이 닿기에 가까운 곳에 있으며",
            "verse 76:15": "은으로 된 그릇과 투명한 컵이 그들 주위를 도니은과 수정으로된 잔들이 그 들 사이를 오가고",
            "verse 76:16": "은으로 된 투명한 컵으로서 그들은 그것(컵)을 적당한 양으로 조절하노라그들은 수정같은 맑은 은잔 에 좋을 만큼 따라 마시더라",
            "verse 76:17": "그리고 그들은 그곳에서 술잔으로 마실 거리가 주어지는데 그것에 섞인 것은 생강이며잔자빌이 혼합된 술잔이 그 들에게 주어지고",
            "verse 76:18": "그곳에서 살사빌이라는 이름의 우물을 마시노라그곳에는 쌀싸빌이라는 우 물이 있으며",
            "verse 76:19": "영생의 어린이들이 그들 사이를 도니 그대가 그들을 보았을 때는 그들을 흩어진 진주알로 생각할 것이며그들 주위를 도는 청순한 소년들을 너희가 보리니 너희는 그들이 뿌려논 진주들처럼 생각하리라",
            "verse 76:20": "그곳에서 정녕 그대가 볼 것은 안락함과 위대한 주권이라너희가 그곳을 볼 때 너희는 그곳에서 축복과 위대한 왕국을 목격하리라",
            "verse 76:21": "그들 위에 걸쳐진 것은 부드러운 녹색 비단 옷과 두툼한 명주붙이이며 그들은 은으로 된 팔찌로 치장될 것이라. 그리고 그들 주님께서는 그들에게 청정한 음료를 주실 것이라그들은 초록색 명주와 두꺼 운 금실로 짠 명주를 걸치고 은팔 찌로 장식을 하고 있으며 주님은 그들로 하여금 성스러운 음료수를 마시게 하더라",
            "verse 76:22": "“실로 이것은 그대들을 위한 보상으로서 그대들의 노력은 보답받았노라”실로 이것이 너희를 위한 보 상으로 너희의 노력은 이처럼 보 상되니라",
            "verse 76:23": "진실로 나는 그대에게 꾸란을 단계적으로 내렸노라하나님이 그대에게 단계적으 로 꾸란을 계시했노라",
            "verse 76:24": "그러니 그대는 그대 주님의 판결에 인내하고 그들 중에 죄짓는 자나 불신하는 자를 따르지 말라주님의 명령에 인내하고 죄 인들이나 은혜를 모르는 자들에게 귀를 기울이지말며",
            "verse 76:25": "그리고 이른 낮과 늦은 낮에 그대 주님의 이름을 떠올리며아침 저녁으로 주님을 염원 하고",
            "verse 76:26": "밤중에는 그분을 위해 부복하고 밤의 오랜 시간에 그분을 찬양하라밤중에는 그분께 부복하여 경배하며 긴 밤을 통하여 그분을 영광되게 하라",
            "verse 76:27": "실로 이들은 현세를 사랑하며 무거운 날을 뒤로 내버려두더라실로 이들은 잠시 지나가는 현세를 사랑할 뿐 고통스러울 어 느 날은 소홀히 할 뿐이라",
            "verse 76:28": "실로 내가 그들을 창조하였고 그들의 골격을 강하게 하였노라. 내가 원했다면 그들과 유사한 자들로 정녕히 (그들을) 대체했을 것이라하나님이 그들을 창조하고 강하게 하였으나 하나님이 원할 때 그들을 완전히 대체할 수 있노라",
            "verse 76:29": "실로 이것은 떠올림이라. 그러니 원하는 자는 그의 주님께로 향하는 길을 잡으라실로 이것이 하나의 교훈이 거늘 원하는 자 누구든지 주님으 로 이르는 길을 따르도록 하라",
            "verse 76:30": "그대들이 원함은 오직 하나님께서 원하시기 때문이라. 실로 하나님께서는 아시는 분이며 지혜로우신 분이도다너희가 원하는 것 하나님의 허락없이는 아니 되나니 실로 하나님은 아심과 지혜로 충만하시니라",
            "verse 76:31": "그분께서는 원하시는 자를 당신의 자비 속에 들게 하시노라. 그리고 부당한 자들, 그들을 위해 그분께서는 고통스런 벌을 준비하셨노라하나님은 그분이 원하는 자 를 그분의 은혜속에 들게 하시나 사악한 자들을 위해서는 고통스러 운 응벌을 준비하셨노라"
        },
        "Kurdish": {
            "verse 76:1": "Bi sond! meriv qe hêj tu tişt ne bûye, ku navê wî bihata gotinê; dan û demê pir dirêj li ser da borîye (paşê ji xalya qîmîtîye bênketî hêdî hatîye afirandinê)به‌ڕاستی ماوه‌یه‌کی زۆر له ڕۆژگار به‌سه‌ر ئاده‌میزادا هات که شتێکی وانه‌بوو ناو ببرێت.",
            "verse 76:2": "Bi rastî mc meriv di temtêlne pey hev da,ji aveke tevlihevê (ji nêr û mêyan) afirandîye, îdî ji bo ku emê ewî biceribînin, me ji bona wî ra bihîstin û dîtin çê kirîyeبێگومان ئێمه ئینسانمان دروستکرد له تێکه‌ڵه‌یه‌ك (له سه‌ره‌مێکوته‌یه‌کی بچووك و هێلکۆکه‌یه‌ك) له کاتێکدا ده‌مانه‌وێت تاقی بکه‌ینه‌وه‌، هه‌ر بۆیه ده‌زگای بیستن و بینینمان پێبه‌خشی.",
            "verse 76:3": "Bi rastî me ji bona wî ra rê nîşan daye, îdî ewa (meriva) ya sipazî û ya jî nankorî dikeبه‌ڕاستی ئێمه ڕێنمووییمان کرد بۆ ڕێگه‌ی ڕاست، به ئازادی ده‌توانێت ببێته که‌سایه‌تیه‌کی ئیماندارو سوپاسگوزار، یان بێ باوه‌ڕو خوانه‌ناس.",
            "verse 76:4": "Bi rastî me ji bona filan û nankoran ra, zincir û bend û doja hilopît amade kirîyeبه‌ڕاستی با بزانێت که ئێمه چه‌نده‌ها کۆت و زنجیرو ئاگری هه‌ڵگیرساومان ئاماده‌کردووه بۆ بێ باوه‌ڕان.",
            "verse 76:5": "Bi rastî ewanê qenc jî hene! ewanan, meya ku tevê kafûrê bûye, di şelbikan da vedixwunبێگومان چاکان و پاکانیش له په‌رداخێکی پڕ شه‌رابدا ده‌خۆنه‌وه‌، که ئاوێته‌که‌ی له سه‌رچاوه‌ی کافووره‌وه‌یه‌.",
            "verse 76:6": "(Ewa meya) kanyeke wusane, bendanê Yezdan ji wê (kanîye) vedixwun.(Ewanbendan ewê) kanîyê ça bixwazin, wusa didine kişandinêکه کانی یه‌که به‌نده‌کانی خوا لێی ده‌خۆنه‌وه له هه‌ر شوێنێکدا بیانه‌وێت هه‌ڵی ده‌قوڵێنن و فواره ده‌کات.",
            "verse 76:7": "Ewan (qencan) gorînê xwe pêk tînin. Ewanan ji wê roja ku aşîta wê belav dibe ditirsinئه‌و به‌خته‌وه‌رانه‌، یه‌کێك له سیفاتیان ئه‌وه‌یه‌: وه‌فا به‌نه‌زر ده‌که‌ن، یاخود به‌ڵێنێکیاندا وه‌فادارن و ئه‌نجامی ده‌ده‌ن و بیمیان هه‌یه له ڕۆژێك که شه‌ڕی لێ ده‌بارێت و پرشو بڵاوه‌...",
            "verse 76:8": "Bi hez kirina xwe, xurekan ji bona belengaz û sewî û zebûnan ra didinهه‌روه‌ها نان و خۆراك ده‌به‌خشن، ئه‌گه‌رچی خۆشه‌ویستیش بێت لایان، به‌هه‌ژارو هه‌تیوو دیله‌کان.",
            "verse 76:9": "Ewan (ji bona hewcan ra aha dibêjin): \"Em hey ji bona qayîlbûna Yezdan bi we didine xwurinê. Loma me ji we qe xelat û sipazî navênده‌ڵێن: بێگومان ئێمه ئه‌م خۆراکه‌تان هه‌ر له‌به‌ر خواو بۆ به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و پێده‌به‌خشین، نه پاداشتمان لێتان ده‌وێت نه سوپاس.",
            "verse 76:10": "Loma bi rastî em di roja rû tirş û bi mirûz da ji (şapata) Xuda yê xwe, ditirsinهه‌روه‌ها ده‌ڵێن: ئه‌م کاره بۆیه ده‌که‌ین چونکه له ڕۆژێکی تاڵ و گرژو ڕه‌ش و تاریك ده‌ترسین، که په‌روه‌ردگارمان پێشی ده‌هێنێت.",
            "verse 76:11": "İdî Yezdan jî ewanan ji şapata wê royê parisandin û Yezdan ji bona wan ra (rûyekî) bi ken û (dilekî) fire dayeجا خوای گه‌وره‌ش له شه‌ڕو ناخۆشی و نه‌هامه‌تی ئه‌و ڕۆژه پاڕاستنی و ڕووی گه‌ش و شادمانی پێبه‌خشین.",
            "verse 76:12": "Bi sedema, ku ewan li ser (cefan) hew kirine, xelata wan (di wê royê da) behişt û hevirmûş eله پاداشتی خۆگری و ئارامگریاندا به‌هه‌شت و ئاوریشمی پێبه‌خشین.",
            "verse 76:13": "Ewanan di (behiştê da) û ser kursîyan paldayîne ewanan di (behiştê da) germa (şewatok) û serma (qermandok) nabîninئه‌و به‌خته‌وه‌رانه له‌سه‌ر کورسی و قه‌نه‌فه ڕازاوه‌کان شانیان داداوه‌، نه گه‌رمای خۆر بێزاریان ده‌کات، نه کزه باو سه‌رما سه‌غڵه‌تیان ده‌کات.",
            "verse 76:14": "Û sîne (darê behiştê) bi ser wan da hatîye vegirtinê, çiqilên (daran ji bona weşandina beran) berjêr bûne, hatinê jêrêسێبه‌ری دره‌خته جوانه‌کان به‌سه‌ر شوێنه خۆشه‌کانیاندا سه‌ری فرو هێناوه‌و لێکردنه‌وه‌ی میوه‌کانیش ئاسانه‌و ملکه‌چ کراوه‌.",
            "verse 76:15": "Bi firaqê ji zîv û bi misînên ji biloran li ber wan digerinهه‌روه‌ها له سوراحی و دۆلکه‌ی زیودا شه‌رابیان بۆ ده‌گێڕن که ده‌کرێته ئه‌و کوپ و په‌رداخانه‌وه که له شووشه‌و کریستاڵی تایبه‌ت دروستکراون.",
            "verse 76:16": "Ewan îstekanê ji zîv in, bi pîvandin hatine pêk anînêهه‌موو دام و ده‌زگای خواردن و خواردنه‌وه‌کان له شووشه‌ی زیوی دروستکراون به‌شێوه‌یه‌کی جوان و دڵڕفێن.",
            "verse 76:17": "Û ewanan (di behiştê da) bi aveke wusa têne avdanê, ku ewa (ava) bi zencefîlê hatine tevdane (di wan şûşan da) vedixunهه‌روه‌ها شه‌رابێکی تریان پێشکه‌ش ده‌کرێت که ئاوێته‌که‌ی زه‌نجه‌بیله‌.",
            "verse 76:18": "Eva di (behiştê da) kanyeke jêra selselbîl tê gotinêکه سه‌رچاوه‌یه‌که له به‌هه‌شتدا به سه‌لسه‌بیل ناو ده‌برێت.",
            "verse 76:19": "Ewan (vexurinan) zarên, ku di (behiştê da) hermaîne li dora wan da digerînin. Gava tu (ewan zaran) dibînî, tu dibê qey luluyê zêr kildayîneئینجا نه‌وجه‌وانانی هه‌میشه لاوو ڕووخۆش و جوان و پاك، به‌ناویاندا ده‌گه‌ڕێن (قسه‌ی خۆش و سروودی به‌تام ده‌ڵێن) کاتێك ده‌یانبینیت وا ده‌زانیت مروارین و به‌و ناوه‌دا بڵاو بوونه‌ته‌وه‌.",
            "verse 76:20": "Tu çi gavê li wura mêze bikî (tu di wura da) qencî û maldar ya mezin dibînîکاتێکیش به‌هه‌ر لایه‌کدا چاوده‌گێڕیت، ئه‌وه نازو نیعمه‌تی نه‌بڕاوه‌و بێ ئه‌ندازو ده‌سه‌ڵاتێکی گه‌وره ده‌بینیت له باخ و باخات و کۆشك و ته‌لارو دیمه‌نی جوان و فراوانی بێ سنوور.",
            "verse 76:21": "Li ser (behiştîyan) kincê ji hevirmûşê kesk û birqonek hene. Ewan ji bazinê zîv xwe xemilandin e. Xuda yê wan, ewan bi aveke paqij dane avdanêپۆشاکی به‌خته‌وه‌ران ئاوریشمی سه‌وزی ته‌نکه که به‌سه‌ر پۆشاکی ئاوریشمی ئه‌ستووردا له‌به‌ریان کردووه‌، به بازنی زیوی ڕازێنراونه‌ته‌وه‌، ئینجا له‌لایه‌ن په‌روه‌ردگاریانه‌وه شه‌رابی پاك و بێگه‌رد و خاوێنیان پێشکه‌ش کراوه‌.",
            "verse 76:22": "Bi rastî ewa ji bona we ra xeleteke û xebata we hatîye sipaz kirinê (litê kirinê)پاشان په‌روه‌ردگاریان پێیان ده‌فه‌رموێت: به‌ڕاستی ئه‌م پاداشته شایسته‌ی ئێوه‌یه‌، هه‌وڵ و کۆشش و کارو کرده‌وه‌ی ئێوه شایانی سوپاس و ڕێزه‌.. (بێگومان خوای گه‌وره به‌م سوپاسگوزاریه ئه‌وه‌نده‌ی تر به‌خته‌وه‌ران و دڵخۆش ده‌کات).",
            "verse 76:23": "(Muhemmed!) bi rastî me Qur´an bi vekirî li ser te da hînartî yeدڵنیاش به ئه‌ی محمد صلی الله علیه وسلم هه‌ر ئێمه قورئانمان بۆ تۆ دابه‌زاندووه به‌ش به‌ش (تا خه‌ڵکی پێ بێدار بکه‌یته‌وه‌).",
            "verse 76:24": "Îdî ji bona berawanî ya Xuda yê xwe tu hew bike û tu ji wan (filan) qe bigotina tu gunehkar û nankoran nekeکه‌واته خۆڕاگربه بۆ فه‌رمانی په‌روه‌ردگارت، نه‌که‌یت ملکه‌چ و فه‌رمانبه‌رداری تاوانباران و بێ باوه‌ڕان بیت له‌وان.",
            "verse 76:25": "Û tu bi navê Xuda yê xwe di sibeh û êvaran da perestî bikeئینجا به‌رده‌وام یادی په‌روه‌ردگارت بکه‌و ناوی پیرۆزی با ویردی سه‌رزارت بێت، له به‌ره‌به‌یان و ده‌مه‌و ئێواراندا.",
            "verse 76:26": "Û di hinekî şevê da, îdî tu ji (Xuda yê xwe ra) kunde behere û tu di şeva dirêj da jî perestî ya (Xuda yê xwe) bikeله شه‌وگاریشدا سوژده‌ی بۆ ببه‌و ته‌سبیحات و ستایشی له هه‌ندێکی شه‌ودا زۆر بکه‌.",
            "verse 76:27": "Bi rastî evanan (ji vê cihana) zû çûyî hez dikin û dest ji wê roja girane pêş ya xwe da berdan eبه‌ڕاستی زۆربه‌ی ئه‌و خه‌ڵکه سه‌رگه‌ردانه حه‌زیان له ژیانی ئه‌م دنیا ته‌مه‌ن کۆتایه‌یه که به‌خێرایی تێ ده‌په‌ڕێت و ڕۆژێکی سه‌خت و سه‌نگین پشتگوێ ده‌خه‌ن و حسابی بۆ ناکه‌ن.",
            "verse 76:28": "Me ewan afirandine û me (momikên wan) pevxistine û ewan bi hez kirine û gava em bivên jî, emê ewanan bi hinekî wekî wan ra biguhurîninبۆ بیرناکه‌نه‌وه‌، خۆ هه‌ر ئێمه دروستمان کردوون ئه‌ندامه‌کانی له‌شیانمان پێکه‌وه به‌ستووه‌، کاتێکیش بمانه‌وێت ئه‌مانه لاده‌به‌ین و به‌که‌سانی تر سه‌ر زه‌وی ئاوه‌دان ده‌که‌ینه‌وه‌.",
            "verse 76:29": "Evan beratan şîret in; îdî kîjan bivê, wê li bal Xuda yê xwe da ji bona xwe ra rêyekî bigireبه‌ڕاستی ئه‌م سووره‌ته و سه‌رجه‌م ئایه‌ته‌کانی قورئان ئامۆژگارییه‌، جا ئه‌وه‌ی ئاره‌زووی به‌هه‌شتی هه‌یه‌، ئه‌وه بۆ لای خوا ڕێگه‌و ڕێباز ده‌گرێته به‌ر.",
            "verse 76:30": "Û hûn bi xweber jî ji pêştirê vîna Yezdan qe tu tiştî navên.Loma bi rastî Yezdan pirzanê bijejke yeدڵنیاش بن: ئێوه هیچتان پێناکرێت و هیچ کارێکتان پێ ئه‌نجام نادرێت مه‌گه‌ر خوا ویستی له‌سه‌ربێت، بێگومان ئه‌و خوایه زاناو دانایه ده‌زانێت کێ شایسته‌ی هیدایه‌ته‌، داناشه له هیدایه‌تدانی به‌نده چاکه‌کاندا.",
            "verse 76:31": "Ewa ji kîjanî ra bivê ewî dixe nava dilovanî ya xwe. Ewî ji bona cewr karan ra jî şapateke dilsoz amade kirîyeئینجا ئه‌و که‌سه‌ی خوا بیه‌وێت و خۆشی هه‌وڵبدات، ده‌یخاته ژێر سایه‌ی ڕه‌حمه‌تی خۆیه‌وه‌و بۆ سته‌مکارانیش سزای به‌ئێشی ئاماده کردووه‌."
        },
        "Kyrgyz": {
            "verse 76:1": "Инсандын үстүнөн (ал жарала электе) доорлордун (нечендеген) мезгил(дер)и өткөн. (Анда инсан) эске да алынбай турган (жок нерсе) эле",
            "verse 76:2": "Чынында, Биз инсанды (энелик менен аталык уруктун) аралашмасынан турган бир тамчы суудан жараттык. (Жана ушул абалын билээр бекен деп) аны сынап, уга турган, көрө турган (аң-сезимдүү) кылдык",
            "verse 76:3": "(Кийин) Биз ага (жакшы менен жаман) жолду тааныттык. (Эми ал) же шүгүр (ибадат) кылуучу болот, же каапыр (болот)",
            "verse 76:4": "Биз чынында каапырлар үчүн чынжырларды, (темир) көгөндөрдү жана тозокту даярдап койдук",
            "verse 76:5": "Ыймандуу адамдар (бейиштерде) «каафур»? аралаштырылган (шарапты) чөйчөктөрдөн ичишет",
            "verse 76:6": "(“Каафур”) булагы... Аны Аллаһтын (бейишке арзыган) пенделери (каалаган жерине) агызышып, (каалагандай) ичишет.”",
            "verse 76:7": "Алар (дүйнө жашоосунда) назирлерин! аткарышкан жана жамандыгы жайылган күндөн (Кыяматтан жана андагы Аллаһтын азабынан) коркушкан",
            "verse 76:8": "Жана бей-бечараларга, жетимдер менен туткундагыларга, өздөрү сүйүп (жегиси келип) турган тамактан жедирип? (мындай дешкен)",
            "verse 76:9": "«Биз силерди Аллаһтын Жүзү (ыраазычылыгы) үчүн тамактандыруудабыз. Биз силерден (эч кандай) акы жана алкыш сурабайбыз",
            "verse 76:10": "Биз Раббибизден (жана жүрөктү) сыга турган, оор күндөн (Кыяматтан) коркобуз»",
            "verse 76:11": "Анан Аллаһ аларды ушул күндүн жамандыгынан куткарып (жүздөрүнө) нур жана кубаныч (белгилерин) берди",
            "verse 76:12": "Жана (дүйнө жашоосунда шайтандын, напсинин азгырыктарына) сабыр кылгандары себептүү аларды Бейиш менен, жибек (кийимдер) менен сыйлады",
            "verse 76:13": "Алар ал жердеги (бейиштеги) сөрүлөргө жөлөнүп отурушат. Ал жерде алар күндү(н ысыгын) да, кычыраган суукту да көрүшпөйт",
            "verse 76:14": "Аларга Бейиш (бактарынын) көлөкөсү тийип, мөмөлөрү ийилип турат",
            "verse 76:15": "Аларга күмүш идиштер(де тамак-аш) жана шише чөйчөктөр(дө шарап) айлантып турулат",
            "verse 76:16": "Күмүш чөйчөктөр... Аны(н ичиндеги шарапты кызматчылар кажетке жараша) өлчөп-ченеп (куюп) турушат",
            "verse 76:17": "Ал жерде (ыймандууларга) занжабил? аралаштырылган шарап",
            "verse 76:18": "(жана) «Салсабил» деп аталган (агып турган) булак (суусу ичирилет)",
            "verse 76:19": "Аларды(н кызматында) түбөлүк жаш жигиттер айланып-тегеренишет. Эгер сен аларды көрсөң чачылган берметтерби деп ойлойсуң",
            "verse 76:20": "Назар салсаң ал жерде (түгөнгүс) нээматарды жана өтө чоң дөөлөттү көрөсүң",
            "verse 76:21": "Алардын (Бейишке түшкөн ыймандуулардын) үстүндө жашыл жибектен жана (алтын-күмүш, асыл таштар кадалган) баркут-кымкаптан кийимдер... (Эркек- аялынын баарынын колдоруна) күмүш билериктер тагылган... Раббилери аларды тунук-пакиза шарап менен сугарган",
            "verse 76:22": "(О, ыймандуулар!) Булар — силер үчүн сыйлык! Жана силердин (дүйнөдөгү аз гана) аракетиңер! ченемсиз нээматтар менен төлөндү",
            "verse 76:23": "Чынында Биз (о, Мухаммад) сага Кураанды? бөлүп-бөлүп түшүрдүк",
            "verse 76:24": "Сен эми, Раббиңдин өкүмүнө сабыр кылгын? жана алардан (каапырлардан) болгон шүгүрсүз, күнөөкөр адамдарга моюн сунбагын",
            "verse 76:25": "Жана Раббиңдин ысымын эртели-кеч эскерип (зикир кылып) жүргүн",
            "verse 76:26": "Түндүн бир бөлүгүндө Ага сажда кыл жана түндөсү узун —узун тасбих айт",
            "verse 76:27": "Чынында, алар (каапырлар) дүйнөнү сүйөт жана оор күндү (Кыяматты) артына таштап (көңүл бурбай) коюшат",
            "verse 76:28": "Аларды Биз жаратып, бүт тулку-боюн бекем-кубаттуу кылган элек! Эгер кааласак, аларды (жаратылышы боюнча) өздөрүнө окшогон? (бирок, каапыр болбой турган, башка) пенделерге алмаштырып коебуз!”",
            "verse 76:29": "Аныгында, бул (Кураан) - эскерме. Ким кааласа, Раббиси тарапка (түз) жолду кармай алат",
            "verse 76:30": "(Бирок) силер Аллаһ каалаган нерсени гана каалай аласыңар. Чынында, Аллаһ Билүүчү, Даанышман",
            "verse 76:31": "Ал Өзү каалаган пенделерин ырайымынын астына алат. Ал эми, заалымдарга болсо, катуу азапты даярдап койгон"
        },
        "Malay": {
            "verse 76:1": "Bukankah telah berlalu kepada manusia satu ketika dari masa (yang beredar), sedang ia (masih belum wujud lagi, dan) tidak menjadi sesuatu benda yang disebut-sebut, (maka mengapa kaum musyrik itu mengingkari hari akhirat)?",
            "verse 76:2": "Sesungguhnya Kami telah aturkan cara mencipta manusia bermulanya dari air mani yang bercampur (dari pati benih lelaki dan perempuan), serta Kami tetap mengujinya (dengan kewajipan-kewajipan); oleh itu maka Kami jadikan dia berkeadaan mendengar dan melihat.",
            "verse 76:3": "Kerana keadaan itu tidak mencukupi, maka) sesungguhnya Kami telah menunjukkan kepadanya (melalui akal dan Rasul) akan jalan-jalan (yang benar dan yang salah; maka terserahlah kepadanya) sama ada ia bersyukur (dengan beriman dan taat), ataupun ia berlaku kufur (dengan mengingkari kebenaran atau menderhaka).",
            "verse 76:4": "(Dalam pada itu), sesungguhnya Kami telah menyediakan bagi sesiapa yang berlaku kufur (atau menderhaka): beberapa rantai dan belenggu serta neraka yang menjulang-julang.",
            "verse 76:5": "Sesungguhnya orang-orang yang berbakti (dengan taat dan kebajikan), akan meminum dari piala: sejenis minuman yang bercampur dengan \"Kafur\", -",
            "verse 76:6": "Iaitu sebuah matair (di Syurga), yang diminum daripadanya oleh hamba-hamba Allah (yang taat); mereka boleh mengalirkannya (di tempat-tempat tinggal mereka) dengan aliran yang semudah-mudahnya dan menurut kemahuannya.",
            "verse 76:7": "(Mereka dikurniakan kesenangan itu kerana) mereka menyempurnakan nazarnya (apatah lagi yang diwajibkan Tuhan kepadanya), serta mereka takutkan hari (akhirat) yang azab seksanya merebak di sana sini.",
            "verse 76:8": "Mereka juga memberi makan benda-benda makanan yang dihajati dan disukainya, kepada orang miskin dan anak yatim serta orang tawanan,",
            "verse 76:9": "(Sambil berkata dengan lidah atau dengan hati): \"Sesungguhnya kami memberi makan kepada kamu kerana Allah semata-mata; kami tidak berkehendakkan sebarang balasan dari kamu atau ucapan terima kasih,",
            "verse 76:10": "\"Kami sebenarnya takutkan Tuhan kami, takut Ia kenakan kami azab hari yang padanya muka orang-orang yang bersalah: masam berkerut-kerut\".",
            "verse 76:11": "Dengan sebab (mereka menjaga diri dari kesalahan), maka Allah selamatkan mereka dari kesengsaraan hari yang demikian keadaannya, serta memberikan kepada mereka keindahan yang berseri-seri (di muka), dan perasaan ria gembira (di hati).",
            "verse 76:12": "Dan kerana kesabaran mereka (mengerjakan suruhan Allah dan meninggalkan laranganNya), mereka dibalas oleh Allah dengan Syurga dan (persalinan dari) sutera.",
            "verse 76:13": "Mereka berehat di dalam Syurga dengan berbaring di atas pelamin-pelamin (yang berhias), mereka tidak nampak di situ adanya matahari (usahkan hawa panasnya), dan tidak juga merasai suasana yang terlampau sejuk;",
            "verse 76:14": "Sedang naungan pohon-pohon Syurga itu dekat kepada mereka, dan buah-buahannya pula dimudahkan (untuk mereka memetiknya) dengan semudah-mudahnya.",
            "verse 76:15": "Dan (selain itu) diedarkan kepada mereka (oleh pelayan-pelayannya): bijana dari perak dan piala-piala minuman yang keadaannya laksana kaca (nampak jelas isinya) -",
            "verse 76:16": "(Keadaannya laksana) kaca, (sedang ia) dari perak; pelayan-pelayan itu menentukan kadar isinya sekadar yang cukup betul dengan kehendak penggunanya.",
            "verse 76:17": "Dan mereka dalam Syurga itu, diberi minum sejenis minuman yang campurannya dari \"Zanjabil\",",
            "verse 76:18": "Iaitu sebuah matair dalam Syurga, yang disebutkan sifatnya sebagai \"Salsabil\".",
            "verse 76:19": "Dan mereka dilayani oleh anak-anak muda lelaki yang tetap kekal (dalam keadaan mudanya), yang sentiasa beredar di sekitar mereka; apabila engkau melihat anak-anak muda itu, nescaya engkau menyangkanya mutiara yang bertaburan.",
            "verse 76:20": "Dan apabila engkau melihat di sana (dalam Syurga itu), engkau melihat nikmat yang melimpah-limpah dan kerajaan yang besar (yang tidak ada bandingannya).",
            "verse 76:21": "Mereka di dalam Syurga memakai pakaian hijau yang diperbuat dari sutera halus dan sutera tebal (yang bertekat), serta mereka dihiasi dengan gelang-gelang tangan dari perak; dan mereka diberi minum oleh Tuhan mereka dengan sejenis minuman (yang lain) yang bersih suci.",
            "verse 76:22": "(Serta dikatakan kepada mereka): \"Sesungguhnya (segala pemberian) ini adalah untuk kamu sebagai balasan, dan adalah usaha amal kamu (di dunia dahulu) diterima dan dihargai (oleh Allah)\".",
            "verse 76:23": "Sesungguhnya Kami telah menurunkan Al-Quran kepadamu (wahai Muhammad), dengan beransur-ansur.",
            "verse 76:24": "Oleh itu hendaklah engkau bersabar menerima hukum Tuhanmu (memberi tempoh kepada golongan yang menentangmu), dan janganlah engkau menurut kehendak orang yang berdosa di antara mereka, atau orang yang kufur ingkar.",
            "verse 76:25": "Dan sebutlah dengan lidah atau dengan hati akan nama Tuhanmu (di dalam dan di luar sembahyang), pada waktu pagi dan petang;",
            "verse 76:26": "Dan (dengan apa keadaan pun maka) pada sebahagian dari waktu malam sujudlah kepada Tuhan (dengan mengerjakan sembahyang), dan (seboleh-bolehnya) bertasbihlah memujiNya (dengan mengerjakan sembahyang Tahajjud), pada sebahagian yang panjang dari waktu malam.",
            "verse 76:27": "Sesungguhnya orang-orang (yang menentangmu) itu sentiasa mencintai (kesenangan dan kemewahan dunia) yang cepat habisnya, serta mereka membelakangkan (tidak menghiraukan bekalan) untuk hari akhirat yang amat berat (penderitaannya kepada orang-orang yang tidak bertaqwa).",
            "verse 76:28": "Kamilah yang menciptakan mereka serta menguatkan tulang sendi dan urat saraf mereka; (Kami berkuasa membinasakan mereka) dan apabila Kami kehendaki, Kami gantikan (mereka dengan) orang-orang yang serupa dengan mereka, dengan penggantian yang sebaik-baiknya.",
            "verse 76:29": "Sesungguhnya (segala keterangan yang disebutkan) ini, menjadi peringatan; maka sesiapa yang mahukan (kebaikan dirinya) bolehlah ia mengambil jalan yang menyampaikan kepada keredaan Allah (dengan iman dan taat).",
            "verse 76:30": "Dan tiadalah kamu berkemahuan (melakukan sesuatu perkara) melainkan dengan cara yang dikehendaki Allah; sesungguhnya Allah adalah Maha Mengetahui, lagi Maha Bijaksana (mengaturkan sebarang perkara yang dikehendakiNya).",
            "verse 76:31": "Ia memasukkan sesiapa yang dikehendakiNya (menurut aturan yang ditetapkan) ke dalam rahmatNya (dengan ditempatkannya di dalam Syurga); dan orang-orang yang zalim, Ia menyediakan untuk mereka azab seksa yang tidak terperi sakitnya."
        },
        "Malayalam": {
            "verse 76:1": "മനുഷ്യന്‍ പ്രസ്താവ്യമായ ഒരു വസ്തുവേ ആയിരുന്നില്ലാത്ത ഒരു കാലഘട്ടം അവന്‍റെ മേല്‍ കഴിഞ്ഞുപോയിട്ടുണ്ടോ?",
            "verse 76:2": "കൂടിച്ചേര്‍ന്നുണ്ടായ ഒരു ബീജത്തില്‍ നിന്ന് തീര്‍ച്ചയായും നാം മനുഷ്യനെ സൃഷ്ടിച്ചിരിക്കുന്നു. നാം അവനെ പരീക്ഷിക്കുവാനായിട്ട്‌. അങ്ങനെ അവനെ നാം കേള്‍വിയുള്ളവനും കാഴ്ചയുള്ളവനുമാക്കിയിരിക്കുന്നു.",
            "verse 76:3": "തീര്‍ച്ചയായും നാം അവന്ന് വഴി കാണിച്ചുകൊടുത്തിരിക്കുന്നു. എന്നിട്ട് ഒന്നുകില്‍ അവന്‍ നന്ദിയുള്ളവനാകുന്നു. അല്ലെങ്കില്‍ നന്ദികെട്ടവനാകുന്നു.",
            "verse 76:4": "തീര്‍ച്ചയായും സത്യനിഷേധികള്‍ക്ക് നാം ചങ്ങലകളും വിലങ്ങുകളും കത്തിജ്വലിക്കുന്ന നരകാഗ്നിയും ഒരുക്കി വെച്ചിരിക്കുന്നു.",
            "verse 76:5": "തീര്‍ച്ചയായും പുണ്യവാന്‍മാര്‍ (സ്വര്‍ഗത്തില്‍) ഒരു പാനപാത്രത്തില്‍ നിന്ന് കുടിക്കുന്നതാണ്‌. അതിന്‍റെ ചേരുവ കര്‍പ്പൂരമായിരിക്കും.",
            "verse 76:6": "അല്ലാഹുവിന്‍റെ ദാസന്‍മാര്‍ കുടിക്കുന്ന ഒരു ഉറവു വെള്ളമത്രെ അത്‌. അവരത് പൊട്ടിച്ചൊഴുക്കിക്കൊണ്ടിരിക്കും.",
            "verse 76:7": "നേര്‍ച്ച അവര്‍ നിറവേറ്റുകയും ആപത്തു പടര്‍ന്ന് പിടിക്കുന്ന ഒരു ദിവസത്തെ അവര്‍ ഭയപ്പെടുകയും ചെയ്യും.",
            "verse 76:8": "ആഹാരത്തോട് പ്രിയമുള്ളതോടൊപ്പം തന്നെ അഗതിക്കും അനാഥയ്ക്കും തടവുകാരന്നും അവരത് നല്‍കുകയും ചെയ്യും.",
            "verse 76:9": "(അവര്‍ പറയും:) അല്ലാഹുവിന്‍റെ പ്രീതിക്കു വേണ്ടി മാത്രമാണ് ഞങ്ങള്‍ നിങ്ങള്‍ക്കു ആഹാരം നല്‍കുന്നത്‌. നിങ്ങളുടെ പക്കല്‍ നിന്നു യാതൊരു പ്രതിഫലവും നന്ദിയും ഞങ്ങള്‍ ആഗ്രഹിക്കുന്നില്ല.",
            "verse 76:10": "മുഖം ചുളിച്ചു പോകുന്നതും, ദുസ്സഹവുമായ ഒരു ദിവസത്തെ ഞങ്ങളുടെ രക്ഷിതാവിങ്കല്‍ നിന്ന് തീര്‍ച്ചയായും ഞങ്ങള്‍ ഭയപ്പെടുന്നു.",
            "verse 76:11": "അതിനാല്‍ ആ ദിവസത്തിന്‍റെ തിന്‍മയില്‍ നിന്ന് അല്ലാഹു അവരെ കാത്തുരക്ഷിക്കുകയും, പ്രസന്നതയും സന്തോഷവും അവര്‍ക്കു അവന്‍ നല്‍കുകയും ചെയ്യുന്നതാണ്‌.",
            "verse 76:12": "അവര്‍ ക്ഷമിച്ചതിനാല്‍ സ്വര്‍ഗത്തോപ്പും പട്ടു വസ്ത്രങ്ങളും അവര്‍ക്കവന്‍ പ്രതിഫലമായി നല്‍കുന്നതാണ്‌.",
            "verse 76:13": "അവരവിടെ സോഫകളില്‍ ചാരിയിരിക്കുന്നവരായിരിക്കും. വെയിലോ കൊടും തണുപ്പോ അവര്‍ അവിടെ കാണുകയില്ല.",
            "verse 76:14": "ആ സ്വര്‍ഗത്തിലെ തണലുകള്‍ അവരുടെ മേല്‍ അടുത്തു നില്‍ക്കുന്നതായിരിക്കും. അതിലെ പഴങ്ങള്‍ പറിച്ചെടുക്കാന്‍ സൌകര്യമുള്ളതാക്കപ്പെടുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 76:15": "വെള്ളിയുടെ പാത്രങ്ങളും (മിനുസം കൊണ്ട്‌) സ്ഫടികം പോലെയായിതീര്‍ന്നിട്ടുള്ള കോപ്പകളുമായി അവര്‍ക്കിടയില്‍ (പരിചാരകന്‍മാര്‍) ചുറ്റി നടക്കുന്നതാണ്‌.",
            "verse 76:16": "വെള്ളിക്കോപ്പകള്‍. അവര്‍ അവയ്ക്ക് (പാത്രങ്ങള്‍ക്ക്‌) ഒരു തോതനുസരിച്ച് അളവ് നിര്‍ണയിച്ചിരിക്കും.",
            "verse 76:17": "ഇഞ്ചിനീരിന്‍റെ ചേരുവയുള്ള ഒരു കോപ്പ അവര്‍ക്ക് അവിടെ കുടിക്കാന്‍ നല്‍കപ്പെടുന്നതാണ്‌.",
            "verse 76:18": "അതായത് അവിടത്തെ (സ്വര്‍ഗത്തിലെ) സല്‍സബീല്‍ എന്നു പേരുള്ള ഒരു ഉറവിലെ വെള്ളം.",
            "verse 76:19": "അനശ്വര ജീവിതം നല്‍കപ്പെട്ട ചില കുട്ടികള്‍ അവര്‍ക്കിടയിലൂടെ ചുറ്റി നടന്നുകൊണ്ടുമിരിക്കും. അവരെ നീ കണ്ടാല്‍ വിതറിയ മുത്തുകളാണ് അവരെന്ന് നീ വിചാരിക്കും.",
            "verse 76:20": "അവിടം നീ കണ്ടാല്‍ സുഖാനുഗ്രഹവും വലിയൊരു സാമ്രാജ്യവും നീ കാണുന്നതാണ്‌.",
            "verse 76:21": "അവരുടെ മേല്‍ പച്ച നിറമുള്ള നേര്‍ത്ത പട്ടുവസ്ത്രങ്ങളും കട്ടിയുള്ള പട്ടു വസ്ത്രവും ഉണ്ടായിരിക്കും. വെള്ളിയുടെ വളകളും അവര്‍ക്ക് അണിയിക്കപ്പെടുന്നതാണ്‌. അവര്‍ക്ക് അവരുടെ രക്ഷിതാവ് തികച്ചും ശുദ്ധമായ പാനീയം കുടിക്കാന്‍ കൊടുക്കുന്നതുമാണ്‌.",
            "verse 76:22": "(അവരോട് പറയപ്പെടും:) തീര്‍ച്ചയായും അത് നിങ്ങള്‍ക്കുള്ള പ്രതിഫലമാകുന്നു. നിങ്ങളുടെ പരിശ്രമം നന്ദിപൂര്‍വ്വം സ്വീകരിക്കപ്പെട്ടിരിക്കയാകുന്നൂ.",
            "verse 76:23": "തീര്‍ച്ചയായും നാം നിനക്ക് ഈ ഖുര്‍ആനിനെ അല്‍പാല്‍പമായി അവതരിപ്പിച്ചു തന്നിരിക്കുന്നു.",
            "verse 76:24": "ആകയാല്‍ നിന്‍റെ രക്ഷിതാവിന്‍റെ തീരുമാനത്തിന് നീ ക്ഷമയോടെ കാത്തിരിക്കുക. അവരുടെ കൂട്ടത്തില്‍ നിന്ന് യാതൊരു പാപിയെയും നന്ദികെട്ടവനെയും നീ അനുസരിച്ചു പോകരുത്‌.",
            "verse 76:25": "നിന്‍റെ രക്ഷിതാവിന്‍റെ നാമം കാലത്തും വൈകുന്നേരവും നീ സ്മരിക്കുകയും ചെയ്യുക.",
            "verse 76:26": "രാത്രിയില്‍ നീ അവനെ പ്രണമിക്കുകയും ദീര്‍ഘമായ നിശാവേളയില്‍ അവനെ പ്രകീര്‍ത്തിക്കുകയും ചെയ്യുക.",
            "verse 76:27": "തീര്‍ച്ചയായും ഇക്കൂട്ടര്‍ ക്ഷണികമായ ഐഹികജീവിതത്തെ ഇഷ്ടപ്പെടുന്നു. ഭാരമേറിയ ഒരു ദിവസത്തിന്‍റെ കാര്യം അവര്‍ തങ്ങളുടെ പുറകില്‍ വിട്ടുകളയുകയും ചെയ്യുന്നു.",
            "verse 76:28": "നാമാണ് അവരെ സൃഷ്ടിക്കുകയും അവരുടെ ശരീരഘടന ബലപ്പെടുത്തുകയും ചെയ്തത്‌. നാം ഉദ്ദേശിക്കുന്ന പക്ഷം അവര്‍ക്ക് തുല്യരായിട്ടുള്ളവരെ നാം അവര്‍ക്കു പകരം കൊണ്ടു വരുന്നതുമാണ്‌.",
            "verse 76:29": "തീര്‍ച്ചയായും ഇത് ഒരു ഉല്‍ബോധനമാകുന്നു. ആകയാല്‍ വല്ലവനും ഉദ്ദേശിക്കുന്ന പക്ഷം തന്‍റെ രക്ഷിതാവിങ്കലേക്കുള്ള മാര്‍ഗം സ്വീകരിച്ചു കൊള്ളട്ടെ.",
            "verse 76:30": "അല്ലാഹു ഉദ്ദേശിക്കുന്ന പക്ഷമല്ലാതെ നിങ്ങള്‍ ഉദ്ദേശിക്കുകയില്ല. തീര്‍ച്ചയായും അല്ലാഹു സര്‍വ്വജ്ഞനും യുക്തിമാനുമാകുന്നു.",
            "verse 76:31": "അവന്‍ ഉദ്ദേശിക്കുന്നവരെ അവന്‍റെ കാരുണ്യത്തില്‍ അവന്‍ പ്രവേശിപ്പിക്കുന്നതാണ്‌. അക്രമകാരികള്‍ക്കാവട്ടെ അവന്‍ വേദനയേറിയ ശിക്ഷ ഒരുക്കി വെച്ചിരിക്കുന്നു."
        },
        "Norwegian": {
            "verse 76:1": "Var det ikke for mennesket en tid da han ikke var noe nevneverdig?",
            "verse 76:2": "Vi har skapt mennesket av en sæddråpe, en blanding, for å prøve ham, og Vi gav ham hørsel og syn.",
            "verse 76:3": "Og Vi har ledet ham til veien, enten han er takknemlig eller utakknemlig.",
            "verse 76:4": "Vi har gjort klar for de vantro kjeder og lenker, og en Ild.",
            "verse 76:5": "De fromme skal drikke av et beger med en blanding med kamfer,",
            "verse 76:6": "en kilde som Guds tjenere drikker fra, og som de lar strømme frem rikelig.",
            "verse 76:7": "De var tro mot sine løfter og fryktet den dag hvis hardhet overalt er på farten.",
            "verse 76:8": "De gav mat til den fattige, den foreldreløse og fangen, selv om de trengte den.",
            "verse 76:9": "«Vi bespiser dere bare for Guds skyld, og vi ønsker verken gjengjeldelse eller takk fra dere!",
            "verse 76:10": "Vi frykter en truende, uhellsvanger dag fra Herren.»",
            "verse 76:11": "Men Gud har bevart dem fra denne dags hardhet, og har gitt dem fryd og glede,",
            "verse 76:12": "og belønnet dem for deres standhaftighet med paradisets have, og silkeskrud.",
            "verse 76:13": "Hvilende der på sine leier møter de verken solens hete eller bitter kulde.",
            "verse 76:14": "Havens skygger hviler over dem, og fruktklaser henger ydmykt ned.",
            "verse 76:15": "Det går rundt blant dem sølvkar og krystallbegre,",
            "verse 76:16": "krystallblankt sølv, fint laget.",
            "verse 76:17": "Der får de å drikke et beger med ingefærblanding.",
            "verse 76:18": "fra en kilde der som kalles Salsabil.",
            "verse 76:19": "Evig unge gutter kretser rundt dem. Når du ser dem, tar du dem for utstrødde perler.",
            "verse 76:20": "Når du ser deg om, ser du lykksalighet og et herlig rike.",
            "verse 76:21": "De bærer grønne klær av silke og brokade, og er smykket med sølvarmbånd, og Herren gir dem en ren drikk.",
            "verse 76:22": "«Dette er deres lønn! Deres innsats møter anerkjennelse.»",
            "verse 76:23": "Vi har visselig sendt deg Koranen som åpenbaring.",
            "verse 76:24": "Bær tålmodig Herrens tilskikkelser, og hør ikke etter synderen eller den vantro blant dem,",
            "verse 76:25": "men kom Herrens navn i hu tidlig og sent.",
            "verse 76:26": "Og når natten kommer, fall ned for Ham, og pris Ham inn i den dype natt.",
            "verse 76:27": "Disse mennesker elsker det som iler hen, og kaster bak seg en tung dag.",
            "verse 76:28": "Vi har skapt dem, og gitt dem deres styrke. Når Vi vil, bytter Vi dem ut med andre i deres sted.",
            "verse 76:29": "Dette er en formaning, og den som vil, tar veien til sin Herre.",
            "verse 76:30": "Men dere vil ikke, med mindre Gud vil. Gud vet, er vis.",
            "verse 76:31": "Han lar dem Han vil gå inn til Hans nåde. Men de urettferdige har Han beredt en smertelig straff!"
        },
        "Pashto": {
            "verse 76:1": "یقینًا په انسان باندې داسې وخت هم راغلى دى چې دى څه داسې د يادولو (وړ) شى نه و",
            "verse 76:2": "بېشكه مونږ انسان له ګډې وډې شوې نطفې نه پیدا كړى دى، چې مونږ به دى ازمایو، نو دى مونږ اورېدونكى (او) لیدونكى وګرځاوه",
            "verse 76:3": "بېشكه مونږ ده ته د نېغې لارې ښوونه كړې ده، یا به دى شكر كوونكى وي او یا به ډېر ناشكره وي",
            "verse 76:4": "بېشكه مونږ د كافرانو لپاره ځنځیرونه او طوقونه (زلونې) او لمبې وهونكى اور تیار كړى دى",
            "verse 76:5": "بېشكه نېكان خلق به د شرابو له داسې جامونو نه څښاك كوي چې د هغو ګډونى (امېزش) به كافور وي",
            "verse 76:6": "چې چینه ده، د الله بنده ګان به له هغې نه څښي۔، دوى به هغه بهوي (چېرته چې وغواړي) ښه بهول",
            "verse 76:7": "دوى نذرونه پوره كوي او له هغې ورځې نه وېرېږي چې د هغې شر ښه ښكاره دى",
            "verse 76:8": "او دوى د هغه (الله) په مینه كې مسكین او یتیم او بندي ته طعام وركوي",
            "verse 76:9": "(دوى وايي:) بېشكه همدا خبره ده چې مونږ تاسو ته د الله له مخه طعام دركوو۔، مونږ له تاسو نه څه بدله او شكر نه غواړو",
            "verse 76:10": "بېشكه مونږ له خپل رب نه د تریو مخې ډېرې سختې ورځې (له عذاب) نه وېرېږو",
            "verse 76:11": "نو الله به دوى د دغې ورځې له شر نه بچ وساتي او دوى ته به تازګي او خوشالي ورسوي",
            "verse 76:12": "او دوى ته به د خپل صبر په سبب جنت او ورېښم په بدل كې وركړي",
            "verse 76:13": "په داسې حال كې چې په تختونو باندې به تكیه وهونكي وي۔، دوى به په هغه (جنت) كې نه لمر ویني او نه ساړه (یخني)",
            "verse 76:14": "په داسې حال كې چې په دوى باندې به د دغه (جنت د ونو) سیورى نژدې وي او د هغه د مېوو شوكول به مُسخَّر (راټیټ) كړى شوي وي، مُسخركېدل",
            "verse 76:15": "او په دوى باندې به لوښي د سپينو زرو او ګلاسونه ګرځولى شي چې د شیشو به وي",
            "verse 76:16": "د سپینو زرو شیشې چې دوى به دغه (لوښي) اندازه كړي وي، اندازه كول",
            "verse 76:17": "او په دغه (جنت) كې به په دوى د شرابو داسې جامونه ورڅښول كېږي چې ګډونى به يې زنجبیل وي",
            "verse 76:18": "چې چینه ده په دغه (جنت) كې چې نوم يې سلسبیل ایښودل شوى دى",
            "verse 76:19": "او په دوى باندې به (د خدمت لپاره) همېشني هلكان ګرځي۔، كله چې ته دوى ووینې۔ (نو) ته به دوى خورې كړى شوې ملغلرې ګڼې",
            "verse 76:20": "او كله چې ته وګورې (نو) په دغه ځاى كې به نعمتونه او ډېره لویه بادشاهي ووینې",
            "verse 76:21": "د دوى په تن باندې به د نري ورېښمو جامې وي چې شنې به وي او د پېړو ورېښمو (جامې به هم وي) او دوى ته به د سپینو زرو باهوګان واچولى شي۔ او خپل رب به په دوى ډېر پاكيزه شراب وڅښي",
            "verse 76:22": "بېشكه دا (نعمت) تاسو لپاره بدله ده. او ستاسو سعي (كوشش) قبول كړى شوى دى",
            "verse 76:23": "بېشكه همدا مونږ پر تاسو باندې قرآن نازل كړى دى، ښه نازلول",
            "verse 76:24": "نو ته د خپل رب حكم ته صبر كوه او په دوى كې د هېڅ ګناهګار او سخت ناشكره خبره مه منه",
            "verse 76:25": "او په سبا او بېګاه كې ته د خپل رب نوم یادوه",
            "verse 76:26": "او د شپې په څه حصه كې۔، نو ته هغه ته سجده كوه او د هغه تسبیح وایه په اوږده شپه كې",
            "verse 76:27": "بېشكه دغه خلق تادي كوونكې (زر تېرېدونكي دنیا) خوښوي او له خپل ځان وروسته درنه ورځ پرېږدي",
            "verse 76:28": "مونږ دوى پیدا كړي دي او مونږ د دوى بندونه مضبوط كړي دي۔ او كله چې مونږ وغواړو د دوى مثالونه به په بدل كې راولو، په بدل كې راوستل",
            "verse 76:29": "بېشكه دا (قرآن) نصیحت دى، نو هغه څوك چې غواړي چې خپل رب طرف ته لار ونیسي (نو ودې نیسي)",
            "verse 76:30": "او تاسو اراده نشئ كولى مګر دا چې الله وغواړي۔، بېشكه الله ښه عالم، ښه حكمت والا دى",
            "verse 76:31": "چا ته چې وغواړي په خپل رحمت كې يې داخلوي او ظالمان (كافران) چې دي هغهٔ، د دوى لپاره ډېر دردوونكى عذاب تیار كړى دى"
        },
        "Persian": {
            "verse 76:1": "هرآينه بر انسان مدتى از زمان گذشت و او چيزى در خور ذكر نبود.",
            "verse 76:2": "ما آدمى را از نطفه‌اى آميخته بيافريده‌ايم، تا او را امتحان كنيم. و شنوا و بينايش ساخته‌ايم.",
            "verse 76:3": "راه را به او نشان داده‌ايم. يا سپاسگزار باشد يا ناسپاس.",
            "verse 76:4": "ما براى كافران زنجيرها و غلها و آتش افروخته آماده كرده‌ايم.",
            "verse 76:5": "نيكان از جامهايى مى‌نوشند كه آميخته به كافور است:",
            "verse 76:6": "چشمه‌اى كه بندگان خدا از آن مى‌نوشند و آن را به هر جاى كه خواهند روان مى‌سازند.",
            "verse 76:7": "به نذر وفا مى‌كنند و از روزى كه شر آن همه جا را گرفته است مى‌ترسند.",
            "verse 76:8": "و طعام را در حالى كه خود دوستش دارند به مسكين و يتيم و اسير مى‌خورانند:",
            "verse 76:9": "جز اين نيست كه شما را براى خدا اطعام مى‌كنيم و از شما نه پاداشى مى‌خواهيم نه سپاسى.",
            "verse 76:10": "ما از پروردگار خود مى‌ترسيم، در روزى كه آن روز عبوس و سخت و هولناك است.",
            "verse 76:11": "خدا ايشان را از شر آن روز نگه داشت و آنان را طراوت و شادمانى بخشيد.",
            "verse 76:12": "به پاداش صبرى كه كرده‌اند پاداششان را بهشت و حرير داد.",
            "verse 76:13": "در آنجا بر تختها تكيه زده‌اند نه هيچ آفتابى مى‌بينند و نه سرمايى.",
            "verse 76:14": "سايه‌هاى درختانش بر سرشان افتاده و ميوه‌هايش به فرمانشان باشد.",
            "verse 76:15": "كاسه‌هاى سيمين و كوزه‌هاى شراب ميانشان به گردش در مى‌آيد.",
            "verse 76:16": "كوزه‌هايى از سيم كه آنها را به اندازه پُر كرده‌اند.",
            "verse 76:17": "در آنجا جامى بنوشانندشان كه آميخته با زنجبيل باشد،",
            "verse 76:18": "از چشمه‌اى كه آن را سلسبيل مى‌گويند.",
            "verse 76:19": "همواره پسرانى به گردشان مى‌چرخند كه چون آنها را ببينى، پندارى مرواريد پراكنده‌اند.",
            "verse 76:20": "چون بنگرى، هر چه بنگرى نعمت فراوان است و فرمانروايى بزرگ.",
            "verse 76:21": "بر تنشان جامه‌هايى است از سُندس سبز و استبرق. و به دستبندهايى از سيم زينت شده‌اند. و پروردگارشان از شرابى پاكيزه سيرابشان سازد.",
            "verse 76:22": "اين پاداش شماست و از كوششتان سپاسگزارى شده است.",
            "verse 76:23": "ما قرآن را بر تو نازل كرديم، نازل‌كردنى نيكو.",
            "verse 76:24": "در برابر فرمان پروردگارت صابر باش و از هيچ گناهكار يا ناسپاسى اطاعت مكن.",
            "verse 76:25": "و بامدادان و شامگاهان نام پروردگارت را بر زبان بياور.",
            "verse 76:26": "در پاره‌اى از شب سجده‌اش كن و در همه درازناى شب تسبيحش گوى.",
            "verse 76:27": "اينان اين دنياى زودگذر را دوست دارند و آن روز دشوار را پس پشت مى‌افكنند.",
            "verse 76:28": "ما آدميان را آفريديم و اعضا و مفاصلشان را نيرومند گردانيديم و اگر خواهيم، به جاى آنها قومى همانندشان بياوريم.",
            "verse 76:29": "اين اندرزى است. پس هر كه خواهد، راهى به سوى پروردگار خويش برگزيند.",
            "verse 76:30": "و شما جز آن نمى‌خواهيد كه خدا خواسته باشد، زيرا خدا دانا و حكيم است.",
            "verse 76:31": "هر كس را كه بخواهد مشمول رحمت خود سازد، و براى ستمكاران عذابى دردآور آماده كرده است."
        },
        "Polish": {
            "verse 76:1": "Czy nie przeszedł nad człowiekiem pełen czas, kiedy on nie był rzeczą wspomnianą?",
            "verse 76:2": "Zaprawdę, stworzyliśmy człowieka z kropli spermy, mieszaniny, aby go doświadczyć. I uczyniliśmy go słyszącym, widzącym.",
            "verse 76:3": "Zaprawdę, poprowadziliśmy go prostą drogą - czy był on wdzięcznym czy niewdzięcznym.",
            "verse 76:4": "Zaprawdę, przygotowaliśmy dla niewiernych łańcuchy, kajdany i ogień płonący.",
            "verse 76:5": "Zaprawdę, ludzie sprawiedliwi będą pili z pucharu, pełnego mieszaniny z kamforą",
            "verse 76:6": "- źródła, u którego pić będą sługi Boga, powodującego, iż będzie ono tryskało obficie.",
            "verse 76:7": "Oni wypełniali ślubowanie i obawiali się Dnia, którego zło rozprzestrzeni się szeroko.",
            "verse 76:8": "Oni dawali pożywienie - z miłości do Niego - biednemu, sierocie i niewolnikowi.",
            "verse 76:9": "\"Karmimy was tylko dla oblicza Boga i nie chcemy od was ani nagrody, ani wdzięczności.",
            "verse 76:10": "Zaprawdę, obawiamy się ze strony naszego Pana Dnia mrocznego, nieszczęsnego.\"",
            "verse 76:11": "I Bóg ustrzegł ich od zła tego Dnia, i dał im spotkać jasność i radość.",
            "verse 76:12": "I wynagrodził ich za to, że byli cierpliwi - Ogrodem i jedwabiem.",
            "verse 76:13": "Będą oni tam przebywać wyciągnięci wygodnie na sofach; nie będą tam widzieć słońca ani zimna.",
            "verse 76:14": "Blisko nad nimi będą ich cienie i pochylą się do nich nisko grona owoców.",
            "verse 76:15": "I będą krążyć pośród nich naczynia ze srebra i puchary z kryształu;",
            "verse 76:16": "- Z kryształu i srebra dokładnie wymierzonego.",
            "verse 76:17": "Napoją ich tam z pucharu napojem z domieszką imbiru;",
            "verse 76:18": "Ze źródła zwanego Salsabil, które się tam znajduje.",
            "verse 76:19": "I będą krążyć pośród nich młodzieńcy nieśmiertelni; kiedy ich zobaczysz, uznasz ich za rozsypane perły.",
            "verse 76:20": "A kiedy popatrzysz, zobaczysz tam szczęśliwość i wielkie królestwo.",
            "verse 76:21": "Będą odziani w szaty zielone z atłasu i brokatu; będą strojni w bransolety ze srebra. Napoi ich Pan napojem czystym.",
            "verse 76:22": "\"Zaprawdę, to jest dla was zapłata, wasz wysiłek otrzymał podziękę!\"",
            "verse 76:23": "Zaprawdę, My zesłaliśmy tobie Koran zesłaniem rzeczywistym!",
            "verse 76:24": "Bądź więc cierpliwy do rozstrzygnięcia twego Pana! Nie słuchaj ni grzesznika, ni niewdzięcznego spośród nich!",
            "verse 76:25": "Wspominaj imię twego Pana rankiem i wieczorem!",
            "verse 76:26": "I nocą wybijaj Mu pokłony! I długo nocą Go wysławiaj!",
            "verse 76:27": "Zaprawdę, oni kochają to, co przemijające, nie zwracają uwagi na ciężki Dzień.",
            "verse 76:28": "My stworzyliśmy ich i związaliśmy mocno ich członki. Ale jeśli zechcemy, zamienimy ich na im podobnych zamianą całkowitą.",
            "verse 76:29": "Zaprawdę, to jest napomnienie! Przeto kto chce, niech podejmie drogę do swojego Pana.",
            "verse 76:30": "Lecz wy nie zechcecie, jeśli nie zechce Bóg. Zaprawdę, Bóg jest wszechwiedzący, mądry!",
            "verse 76:31": "On wprowadza, kogo chce, do Swego miłosierdzia. A dla niesprawiedliwych przygotował karę bolesną."
        },
        "Portuguese": {
            "verse 76:1": "Acaso, não transcorreu um longo período, desde que o homem nada era?",
            "verse 76:2": "Em verdade, criamos o homem, de esperma misturado, para prová-lo, e o dotamos de ouvidos e vistas.",
            "verse 76:3": "Em verdade, assinalamos-lhe uma senda, quer fosse agradecido, quer fosse ingrato.",
            "verse 76:4": "Em verdade, aos incrédulos, destinamos correntes, grilhões e o tártaro.",
            "verse 76:5": "Em verdade, os justos beberão, em uma taça, um néctar, mesclado com cânfora.",
            "verse 76:6": "De uma fonte, da qual beberão todos os servos de Deus. Eles a fazem fluir abundantemente,",
            "verse 76:7": "Porque cumprem os seus votos e temem o dia em que o mal estará espalhado,",
            "verse 76:8": "E porque, por amor a Ele, alimentam o necessitado, o órfão e o cativo.",
            "verse 76:9": "(Dizendo): Certamente vos alimentamos por amor a Deus; não vos exigimos recompensa, nem gratidão.",
            "verse 76:10": "Em verdade, tememos, da parte do nosso Senhor, o dia da aflição calamitosa.",
            "verse 76:11": "Mas Deus os preservará do mal daquele dia, e os receberá com esplendor e júbilo;",
            "verse 76:12": "E os recompensará, por sua perseverança, com um vergel e (vestimentas de) seda,",
            "verse 76:13": "Onde, reclinados sobre almofadas, não sentirão calor nem frio excessivos,",
            "verse 76:14": "E as sombras (do vergel) os cobrirão, e os cachos (de frutos) estarão pendurados, em humildade.",
            "verse 76:15": "E serão servidos em taças de prata e em copos diáfanos,",
            "verse 76:16": "Feitos de prata, semelhantes a cristal, que lhe serão fornecidos em abundância.",
            "verse 76:17": "E ali ser-lhes-á servido um copo de néctar, cuja mescla será de gengibre,",
            "verse 76:18": "De uma fonte (no Paraíso), chamada Salsabil.",
            "verse 76:19": "E os servirão mancebos imortais; quando os vires, parecer-te-ão pérolas dispersas.",
            "verse 76:20": "E quando olhares além, verás glórias e um magnífico reino.",
            "verse 76:21": "Sobre eles haverá vestimentas verdes, de tafetá e de brocado, estarão enfeitados com braceletes de prata e o seu Senhor lhes saciará a sede com uma bebida pura!",
            "verse 76:22": "Sabei que esta será a vossa recompensa, e os vossos esforços serão reconhecidos.",
            "verse 76:23": "Em verdade, temos-te revelado (ó Mensageiro), o Alcorão, por etapas,",
            "verse 76:24": "Persevera, pois, até o Juízo do teu Senhor, e não obedeças a nenhum dos pecadores ou incrédulos,",
            "verse 76:25": "E celebra o nome do teu Senhor, de manhã e à tarde.",
            "verse 76:26": "E adora-O, e glorifica-O durante grande parte da noite.",
            "verse 76:27": "Em verdade, (quanto aos outros) preferem a efêmera vida terrena e tentam afastar a lembrança de um dia (que será) pesado.",
            "verse 76:28": "Nós os criamos e fortalecemos as suas estruturas; porém se quiséssemos, suplantá-los-íamos inteiramente por outros, semelhantes a eles.",
            "verse 76:29": "Em verdade, esta é uma admoestação: e, quem quiser, poderá encaminhar-se até à senda do seu Senhor.",
            "verse 76:30": "Porém, só o conseguireis se Deus o permitir, porque é Prudente, Sapientíssimo.",
            "verse 76:31": "Ele admite em Sua misericórdia quem Lhe apraz; porém, destinou aos iníquos, um doloroso castigo."
        },
        "Punjabi": {
            "verse 76:1": "ਕਦੇ ਮਨੁੱਖ ਤੇ ਬੀਤੇ ਸਮੇਂ ਵਿਚ ਇੱਕ ਅਜਿਹਾ ਸਮਾਂ ਵੀ ਆਇਆ ਹੈ ਜਦੋਂ ਉਹ ਕੋਈ ਬਿਆਨ ਕਰਨ ਵਾਲੀ ਵਸਤੂ ਨਹੀਂ ਸੀ।",
            "verse 76:2": "ਅਸੀਂ ਮਨੁੱਖ ਨੂੰ ਇੱਕ ਰਲੀ-ਮਿਲੀ ਬੂੰਦ ਤੋਂ ਪੈਦਾ ਕੀਤਾ ਅਤੇ ਅਸੀਂ ਉਸ ਨੂੰ ਪਲਟਦੇ ਰਹੇ। ਫਿਰ ਅਸੀਂ ਉਸ ਨੂੰ ਸੁਣਨ ਵਾਲਾ ਅਤੇ ਦੇਖਣ ਵਾਲਾ ਬਣਾ ਦਿੱਤਾ।",
            "verse 76:3": "ਅਸੀਂ ਹੀ ਉਸ ਨੂੰ ਰਾਹ ਸਮਝਾਇਆ, ਚਾਹੇ ਉਹ ਸ਼ੁਕਰ ਕਰਨ ਵਾਲਾ ਬਣੇ ਜਾਂ ਨਾ-ਸ਼ੁਕਰਾ।",
            "verse 76:4": "ਅਸੀਂ ਅੱਵਗਿਆਕਾਰੀਆਂ ਲਈ ਬੇੜੀਆਂ ਅਤੇ ਤੌਕ (ਗਲੇ ਦਾ ਪਟਾ) ਅਤੇ ਭੜਕਦੀ ਹੋਈ ਅੱਗ ਤਿਆਰ ਕਰ ਰੱਖੀ ਹੈ।",
            "verse 76:5": "ਨੇਕ ਲੋਕ ਅਜਿਹੇ ਪਿਆਲਿਆਂ ਨਾਲ (ਸ਼ਰਾਬ) ਪੀਣਗੇ ਜਿਨ੍ਹਾਂ ਵਿਚ ਕਫੂਰ ਵਾਲੇ ਪਾਣੀ ਦਾ ਮਿਸ਼ਰਨ ਹੋਵੇਗਾ।",
            "verse 76:6": "ਉਸ (ਵੱਗਦੇ ਹੋਏ) ਝਰਨੇ ਵਿੱਚੋਂ ਅੱਲਾਹ ਦੇ ਬੰਦੇ ਪੀਣਗੇ। ਉਹ ਉਸ ਵਿਚੋਂ’ ਸ਼ਾਖਾਂਵਾ (ਛੋਟੀਆਂ ਨਹਿਰਾਂ) ਕੱਢ ਲੈਣਗੇ।",
            "verse 76:7": "ਉਹ ਲੋਕ ਜ਼ਰੂਰੀ ਕੰਮਾਂ ਨੂੰ ਪੂਰਾ ਕਰਦੇ ਹਨ ਅਤੇ ਅਜਿਹੇ ਦਿਨਾਂ ਤੋਂ ਡਰਦੇ ਹਨ ਜਿਸ ਦੀ ਸਖ਼ਤੀ ਬੜੀ ਵਿਆਪਕ ਹੋਵੇਗੀ।",
            "verse 76:8": "ਅਤੇ ਉਸ ਦੇ ਪ੍ਰੇਮ ਵਿਚ ਫ਼ਕੀਰਾਂ, ਅਨਾਥਾਂ ਅਤੇ ਕੈਦੀਆਂ ਨੂੰ ਭੋਜਨ ਖਵਾਉਂਦੇ ਹਨ।",
            "verse 76:9": "ਅਸੀਂ ਜਿਹੜਾ ਤੁਹਾਨੂੰ ਖਵਾਉਂਦੇ ਹਾਂ, ਉਹ ਅੱਲਾਹ ਦੀ ਖੁਸ਼ੀ ਲੈਣ ਲਈ ਹੈ। ਅਸੀਂ ਤੁਹਾਡੇ ਤੋਂ ਨਾ ਕੋਈ ਮੁਆਵਜ਼ਾ ਚਾਹੁੰਦੇ ਹਾਂ ਅਤੇ ਨਾ ਸ਼ੁਕਰਗੁਜ਼ਾਰੀ ਦੀ ਇੱਛਾ।",
            "verse 76:10": "ਬੇਸ਼ੱਕ ਅਸੀਂ ਆਪਣੇ ਰੱਬ ਤੋਂ ਉਸ ਦਿਨ ਦਾ ਖੌਫ਼ ਰਖਦੇ ਹਾਂ ਜਿਹੜਾ ਵਲੋਂ ਇੱਕ ਸਖ਼ਤ ਅਤੇ ਕੌੜਾ ਦਿਨ ਹੋਵੇਗਾ।",
            "verse 76:11": "ਤਾਂ ਅੱਲਾਹ ਨੇ ਉਸ ਨੂੰ ਉਸ ਦਿਨ ਦੀ ਸਖ਼ਤੀ ਤੋਂ ਬਚਾ ਲਿਆ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਤਾਜ਼ਗੀ ਅਤੇ ਖੁਸ਼ੀ ਪ੍ਰਦਾਨ ਕੀਤੀ।",
            "verse 76:12": "ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਸਬਰ ਦੇ ਬਦਲੇ ਉਨ੍ਹਾਂ ਨੂੰ ਜੰਨਤ ਅਤੇ ਰੇਸ਼ਮੀ ਕੱਪੜੇ ਬਖਸੇ।",
            "verse 76:13": "ਉਹ ਤਖ਼ਤਾਂ ਤੇ (ਸਿਰਾਹਣਿਆੰ) ਨੂੰ ਢੋਅ ਲਾ ਕੇ ਬੈਠੇ ਹੋਣਗੇ। ਉੱਤੇ ਨਾ ਉਹ ਗਰਮੀ ਦਾ ਸਾਹਮਣਾ ਕਰਨਗੇ ਅਤੇ ਨਾ ਸਰਦੀ ਦਾ।",
            "verse 76:14": "ਜੰਨਤਾਂ ਦੀ ਛਾਂ ਉਨ੍ਹਾਂ ਤੇ ਝੁਕੀ ਹੋਈ ਹੋਵੇਗੀ ਅਤੇ ਉਸ ਦੇ ਫ਼ਲ ਉਨ੍ਹਾਂ ਦੀ ਪਹੁੰਚ ਵਿਚ ਹੋਣਗੇ।",
            "verse 76:15": "ਉਨ੍ਹਾਂ ਦੇ ਅੱਗੇ ਚਾਂਦੀ ਦੇ ਭਾਂਡੇ ਅਤੇ ਕੱਚ ਦੇ ਪਿਆਲੇ ਘੁੰਮ ਰਹੇ ਹੋਣਗੇ।",
            "verse 76:16": "ਸ਼ੀਸ਼ੇ ਵੀ ਚਾਂਦੀ ਦੇ ਹੋਣਗੇ, ਜਿੰਨ੍ਹਾ ਨੂੰ ਪਿਲਾਉਣ ਵਾਲਿਆਂ ਨੇ ਠੀਕ ਅੰਦਾਜ਼ੇ ਅਨੁਸਾਰ ਭਰਿਆ ਹੋਵੇਗਾ।",
            "verse 76:17": "ਅਤੇ ਉੱਥੇ ਉਨ੍ਹਾਂ ਨੂੰ ਇੱਕ ਹੋਰ ਜਾਮ ਪਿਆਇਆ ਜਾਵੇਗਾ ਜਿਸ ਵਿਚ ਅਦਰਕ ਦਾ ਮਿਸ਼ਰਨ ਹੋਵੇਗਾ।",
            "verse 76:18": "ਇਹ ਉਸ ਵਿਚ ਇੱਕ ਝਰਨਾਂ ਹੈ ਜਿਸ ਨੂੰ “ਸਲਸਬੀਲ” ਕਿਹਾ ਜਾਂਦਾ ਹੈ।",
            "verse 76:19": "ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਕੋਲ ਅਜਿਹੇ ਬੱਚੇ ਘੁੰਮ ਰਹੇ ਹੋਣਗੇ ਜਿਹੜੇ ਹਮੇਸ਼ਾਂ (ਨੌਜਵਾਨ) ਬੱਚੇ ਹੀ ਰਹਿਣਗੇ। ਤੁਸੀ’ ਉਨ੍ਹਾਂ ਨੂੰ ਵੇਖੋ ਤਾਂ ਜਾਣੋ ਕਿ ਇਹ ਉਹ ਮੌਤੀ ਹਨ, ਜਿਹੜੇ ਖਿੰਡਾ ਦਿੱਤੇ ਗਏ ਹਨ।",
            "verse 76:20": "ਅਤੇ ਤੁਸੀਂ ਜਿੱਥੇ ਵੀ ਦੇਖੋਗੇ (ਉੱਥੇ) ਉਹ ਹੀ ਮਹਾਨ ਨਿਅਮਤ ਵਾਲਾ ਅਤੇ ਅਜ਼ੀਮ ਪਾਤਸ਼ਾਹੀ ਦੇਖੋਂਗੇ।",
            "verse 76:21": "ਉਨ੍ਹਾਂ ਦੇ ਉੱਪਰ ਪਤਲੇ ਰੇਸ਼ਮ ਦੇ ਹਰੇ ਕੱਪੜੇ ਹੋਣਗੇ ਅਤੇ ਮੋਟੇ ਰੇਸ਼ਮ ਦੇ ਵੀ ਅਤੇ ਉਨ੍ਹਾਂ ਨੂੰ ਚਾਂਦੀ ਦੇ ਕੜੇ (ਕੰਗਨ) ਪਹਿਣਾਏ ਜਾਣਗੇ ਅਤੇ ਉਨ੍ਹਾਂ ਦਾ ਰੱਬ ਉਨ੍ਹਾਂ ਨੂੰ ਪਵਿੱਤਰ (ਸ਼ਰਾਬ) ਪਿਆਵੇਗਾ।",
            "verse 76:22": "ਬੇਸ਼ੱਕ ਇਹ ਤੁਹਾਡਾ ਼ਦਲ ਹੈ ਅਤੇ ਤੁਹਾਡੀ ਘਾਲ ਕਮਾਈ ਸਵੀਕਾਰ ਹੋਈ।",
            "verse 76:23": "ਅਸੀਂ ਤੁਹਾਡੇ ਉੱਪਰ ਥੋੜ੍ਹਾ ਥੋੜ੍ਹਾ ਕਰਕੇ ਕੁਰਆਨ ਉਤਾਰਿਆ।",
            "verse 76:24": "ਸੋ ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਤੇ ਹੁਕਮ ਤੇ ਧੀਰਜ ਰੱਖੋ ਅਤੇ ਉਸ ਵਿਚ ਕਿਸੇ ਪਾਪੀ ਜਾਂ ਨਾ ਸ਼ੁਕਰੇ ਦੀ ਗੱਲ ਨਾ ਮੰਨੋ।",
            "verse 76:25": "ਅਤੇ ਸੁਲ੍ਹਾ ਸ਼ਾਮ ਆਪਣੇ ਰੱਬ ਦਾ ਨਾਮ ਯਾਦ ਕਰੋ।",
            "verse 76:26": "ਅਤੇ ਉਸ ਨੂੰ ਰਾਤ ਨੂੰ ਵੀ ਸਿਜਦਾ ਕਰੋ ਅਤੇ ਰਾਤ ਦੇ ਲੰਮੇ ਹਿੱਸੇ ਵਿਚ ਵੀ ਉਸ ਦੀ ਸਿਫ਼ਤ ਸਲਾਹ ਕਰੋ।",
            "verse 76:27": "ਇਹ ਲੋਕ ਜਲਦੀ ਮਿਲਣ ਵਾਲੀ ਚੀਜ਼ ਚਾਹੁੰਦੇ ਹਨ ਅਤੇ ਇਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਪਿੱਛੇ ਇੱਕ ਭਾਰੀ ਦਿਨ ਨੂੰ ਛੱਡ ਰੱਖਿਆ ਹੈ।",
            "verse 76:28": "ਅਸੀਂ ਹੀ ਉਨ੍ਹਾਂ ਨੂੰ ਪੈਦਾ ਕੀਤਾ ਅਤੇ ਅਸੀਂ ਹੀ ਉਨ੍ਹਾਂ ਦੇ ਢਾਂਚੇ ਨੂੰ ਪੱਕਾ ਕੀਤਾ ਅਤੇ ਜਦੋਂ ਅਸੀਂ ਚਾਹਾਂਗੇ ਤਾਂ ਉਨ੍ਹਾਂ ਦੇ ਬਦਲੇ ਉਨ੍ਹਾਂ ਵਰਗੇ ਹੋਰ ਲੋਕ ਲੈ ਆਵਾਂਗੇ।",
            "verse 76:29": "ਇਹ ਇੱਕ ਉਪਦੇਸ਼ ਹੈ ਤਾਂ ਜਿਹੜਾ ਬੰਦਾ ਚਾਹੇ ਆਪਣੇ ਰੱਬ ਵੱਲ (ਜਾਣ ਵਾਲਾ) ਰਾਹ ਅਪਣਾ ਲਵੇ।",
            "verse 76:30": "ਅਤੇ ਤੁਸੀਂ ਨਹੀਂ ਚਾਹ ਸਕਦੇ ਪਰੰਤੂ ਇਹ ਕਿ ਜਿਹੜਾ ਅੱਲਾਹ ਨੂੰ ਮਨਜ਼ੂਰ ਹੋਵੇ। ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਜਾਣਨ ਵਾਲਾ ਅਤੇ ਬਿਬੇਕ ਵਾਲਾ ਹੈ।",
            "verse 76:31": "ਉਹ ਜਿਸ ਨੂੰ ਚਾਹੁੰਦਾ ਹੈ ਆਪਣੀ ਰਹਿਮਤ ਵਿਚ ਦਾਖਿਲਾ ਦਿੰਦਾ ਹੈ ਅਤੇ ਉਸ ਨੇ ਅੱਤਿਆਚਾਰੀਆਂ ਲਈ ਦੁੱਖਦਾਇਕ ਸਜ਼ਾ ਤਿਆਰ ਕਰ ਰੱਖੀ ਹੈ।"
        },
        "Roman english": {
            "verse 76:1": "Hal ataa `alal insaani heenum minad dahri lam yakun shai`am mazkooraa",
            "verse 76:2": "Innaa khalaqnal insaana min nutfatin amshaajin nabta leehi faja`alnaahu samee`am baseeraa",
            "verse 76:3": "Innaa hadainaahus sabeela immaa shaakiranw wa immaa kafoora",
            "verse 76:4": "Innaaa a`tadnaa lilkaa fireena salaasila wa aghlaalanw wa sa`eeraa",
            "verse 76:5": "innal abraara yashra boona min kaasin kaana mizaa juhaa kaafooraa",
            "verse 76:6": "Aynany yashrabu bihaa `ibaadul laahi yafajjiroonahaa tafjeeraa",
            "verse 76:7": "Yoofoona binnazri wa yakhaafoona yawman kaana sharruhoo mustateeraa",
            "verse 76:8": "Wa yut``imoonat ta`aama `alaa hubbihee miskeenanw wa yatemanw wa aseeraa",
            "verse 76:9": "Innaamaa nut`imukum li wajhil laahi laa nureedu minkum jazaaa`anw wa laa shukooraa",
            "verse 76:10": "Innaa nakhaafu mir Rabbinna Yawman `aboosan qamtareeraa",
            "verse 76:11": "Fa waqaahumul laahu sharra zaalikal yawmi wa laqqaahum nadratanw wa surooraa",
            "verse 76:12": "Wa jazaahum bimaa sabaroo janatanw wa hareeraa",
            "verse 76:13": "muttaki`eena feeha `alal araaa `iki laa yarawna feehaa shamsanw wa laa zamhareeraa",
            "verse 76:14": "Wa daaniyatan `alaihim zilaaluhaa wa zullilat qutoofu haa tazleela",
            "verse 76:15": "Wa yutaafu `alaihim bi aaniyatim min fiddatinw wa akwaabin kaanat qawaareeraa",
            "verse 76:16": "Qawaareera min fiddatin qaddaroohaa taqdeeraa",
            "verse 76:17": "Wa yusawna feehaa kaasan kaana mizaajuhaa zanjabeelaa",
            "verse 76:18": "Aynan feeha tusammaa salsabeelaa",
            "verse 76:19": "Wa yatoofu `alaihim wildaanum mukhalladoona izaa ra aytahum hasibtahum lu`lu `am mansoora",
            "verse 76:20": "Wa izaa ra ayta summa ra ayta na`eemanw wa mulkan kabeera",
            "verse 76:21": "Aaliyahum siyaabu sundusin khudrunw wa istabraq, wa hullooo asaawira min fiddatinw wa saqaahum Rabbuhum sharaaban tahooraa",
            "verse 76:22": "Innaa haazaa kaana lakum jazz `anw wa kaana sa`yukum mashkooraa",
            "verse 76:23": "Innaa nahnu nazzalnaa `alaikal quraana tanzeelaa",
            "verse 76:24": "Fasbir lihukmi Rabbika wa laa tuti` minhum aasiman aw kafooraa",
            "verse 76:25": "Wazkuris ma Rabbika bukratanw wa aseelaa",
            "verse 76:26": "Wa minal laili fasjud lahoo wa sabbihhu lailan taweelaa",
            "verse 76:27": "Inna haaa`ulaa`i yuhibboona `aajilata wa yazaroona waraaa`ahum yawman saqeelaa",
            "verse 76:28": "Nahnu khalaqnaahum wa shadadnaaa asrahum wa izaa shi`naa baddalnaaa amsaala hum tabdeelaa",
            "verse 76:29": "Inna haazihee tazkiratun fa man shaaa`at takhaza ilaa rabbihee sabeela",
            "verse 76:30": "Wa maa tashaaa`oona illaa anyyashaaa`al laah; innal laahaa kaana`Aleeman Hakeema",
            "verse 76:31": "Yudkhilu mai yashaaa`u fee rahmatih; wazzaalimeena a`adda lahum `azaaban aleemaa"
        },
        "Russian": {
            "verse 76:1": "Ужель над человеком не прошел Тот долгий срок, когда он был ничем?",
            "verse 76:2": "Мы человека сотворили Из капли смеси; Чтоб испытать его, Мы одарили его зрением и слухом.",
            "verse 76:3": "И Мы (всеведением Нашим) Определили ему путь: Быть благодарным (Господу) или неверным.",
            "verse 76:4": "Назначили Мы для неверных Ярмо, оковы и пылающий Огонь.",
            "verse 76:5": "А праведные будут пить из чаш Напиток с добавлением кафура,",
            "verse 76:6": "Что из источника служителей Аллаха Струею льется непрерывной.",
            "verse 76:7": "Они свои обеты исполняют, Страшася Дня, когда (расплата за грехи) (В тот День) Поглотит всех и вся.",
            "verse 76:8": "Вздыхая о еде, они накормят все ж И сироту, и пленника, и бедняка:",
            "verse 76:9": "Мы кормим вас лишь для того, Чтобы снискать довольствие Аллаха, Не требуя ни благодарности от вас, ни воздаянья.",
            "verse 76:10": "Поистине, страшимся мы Дня бедствия и скорби, (Что ниспадет) по воле нашего Владыки.",
            "verse 76:11": "И потому Аллах избавил их от бедствия и скорби того Дня, Пролив на лик их свет блаженства и радости (благословенной),",
            "verse 76:12": "За постоянство и терпимость их Вознаградил их Садом и шелками.",
            "verse 76:13": "(В Саду), на ложах возлегая, Им не терпеть уж боле никогда Ни зноя солнца и ни холода луны.",
            "verse 76:14": "Прикроет их (деревьев) тень; В смиренье полном перед ними Склонятся гроздья (райских) фруктов.",
            "verse 76:15": "Им из серебряных сосудов (Льют питье) в хрустальные бокалы",
            "verse 76:16": "Из кубов серебра, сверкающих хрустальным блеском, Которые несут отметины о мере.",
            "verse 76:17": "И им дадут испить из чаш с добавкой имбиря",
            "verse 76:18": "Напиток, что там бьет фонтаном из ключа, Который именуют Сальсабиль.",
            "verse 76:19": "Со всех сторон их Отроки, навечно (молодые), будут ублажать, Взглянув на коих вы сочтете, (Что чистотой своей и красотой) Они рассыпанным жемчужинам подобны.",
            "verse 76:20": "А коль ты взглянешь, ты узришь услады (Рая) И ширь великую (владений Божьих).",
            "verse 76:21": "Облечены они в зеленые одежды Из шелка (тонкого) и (расписной) парчи, Украшены браслетами из серебра, И им Господь их даст испить Напиток (райской) чистоты.",
            "verse 76:22": "(И прозвучит): \"Сие, поистине, награда вам, И ваше тщание (на промысле Аллаха) (Им) принято и воздано'\".",
            "verse 76:23": "(Поистине, о Мухаммад!), Мы по частям тебе Коран ниспосылаем,",
            "verse 76:24": "(А потому) - Ты терпеливо жди указа твоего Владыки И не прислушивайся к тем средь них, Кто грешен иль неверен (пред Аллахом).",
            "verse 76:25": "И поминай Владыку твоего И по утрам, и в час вечерний.",
            "verse 76:26": "И ночью ниц пади пред Ним, И славь Его всей ночью долгой.",
            "verse 76:27": "Но их прельщает (тщЕта) проходящей (жизни), И тяжким Днем (Последнего Суда) они пренебрегают.",
            "verse 76:28": "Мы сотворили их и укрепили в целостном единстве, Но, если пожелаем Мы, Мы их заменим полною заменой - Подобными (по лику, но праведными пред Аллахом).",
            "verse 76:29": "Вот таково предупреждение (Господне), И всяк, кто этого желает, Пусть следует стезей, ведущей в Его Рай.",
            "verse 76:30": "Но ни одно желанье ваше (В сей жизни) не найдет пути Иначе, как по изволению Аллаха, - Ведь мудр и всезнающ Он!",
            "verse 76:31": "Введет Он в Свою милость того, кого сочтет, А скверным уготовил тяжкую расплату."
        },
        "Sindhi": {
            "verse 76:1": "ڪڏھن ماڻھوءَ تي زماني مان ھڪ (اھڙو) وقت گذري چڪو آھي جو (ھو اھڙي) ڪا شيءَ نه ھو جا يادگيريءَ ۾ اچي.",
            "verse 76:2": "بيشڪ اسان ماڻھوءَ کي ھڪڙي (پاڻ ۾) گڏيل منيءَ مان پيدا ڪيو، ته اُن کي پرکيون پوءِ کيس ٻڌندڙ ڏسندڙ ڪيوسون.",
            "verse 76:3": "بيشڪ اسان کيس سڌو دڳ ڏسيو (ھاڻي ھو) شُڪر ڪندڙ ٿئي يا بي شُڪر.",
            "verse 76:4": "بيشڪ اسان ڪافرن لاءِ زنجير يا ڳٽ ۽ ٻرندڙ باھ تيار ڪئي آھي.",
            "verse 76:5": "بيشڪ نيڪ بخت ٻانھا (انھي شراب جي) پيالي مان پيئندا جنھن جي ملاوت ڪافور (جي چشمي جي پاڻي) جي ھوندي.",
            "verse 76:6": "اھو ھڪ چشمو آھي جنھن مان الله جا (پيارا) ٻانھا پيئندا جنھن کي چڱي طرح وھائيندا.",
            "verse 76:7": "جي (الله جي) باس پوري ڪندا آھن ۽ اُن ڏينھن کان ڊڄندا آھن جنھن جي بڇڙائي (ھر طرف) پڌري ھوندي.",
            "verse 76:8": "۽ طعام جي احتياج ھوندي مُحتاج ۽ يتيم ۽ قيدي کي کارائيندا آھن.",
            "verse 76:9": "(۽ چوندا آھن ته) اسين ته اوھان کي الله جي واسطي کارائيندا آھيون اوھان کان نڪو بدلو ۽ نڪا شڪر گذاري گھرندا آھيون.",
            "verse 76:10": "بيشڪ اسين پنھنجي پالڻھار کان ھڪ ڏکئي ڏينھن کان ڊڄندا آھيون جو تمام سخت آھي.",
            "verse 76:11": "پوءِ الله اُن ڏينھن جي مدائي کان کين بچايو ۽ اُنھن کي تازگي ۽ خوشي پھچائي.",
            "verse 76:12": "۽ سندن صبر ڪرڻ سببان باغ ۽ پَٽ (جو ويس) کين بدلو ڏنائين.",
            "verse 76:13": "اُن (باغ) ۾ تختن تي ٽيڪ ڏئي وھندا، اتي نڪي (سج جي) اُتت ۽ نڪي ڪا سخت سردي ڏسندا.",
            "verse 76:14": "۽ اُن (باغ) جون ڇانئون مٿن ويجھيون ٿيل ھونديون ۽ اُن جا ميوا (پٽڻ ۾) چڱي طرح ويجھا ڪبا.",
            "verse 76:15": "۽ روپن ٿانون ۽ پيالن سان وٽن اچ وڃ ٿيندي جي شيشن وانگر ھوندا.",
            "verse 76:16": "(پر) شيشا (به) چاندي جا جن کي انھن (پياريندڙن) پوري انداز سان ٺھرايو آھي.",
            "verse 76:17": "۽ اُتي کين شراب جا پيالا پياربا جنھن (جي پاڻي) جي ملاوت سُنڍ (جي چشمي) جي ھوندي.",
            "verse 76:18": "اُتي اھو ھڪ چشمو آھي جنھن جو نالو سَلۡسَبِيۡل رکيو وڃي ٿو.",
            "verse 76:19": "۽ وٽن ھميشه رھندڙ نينگر پيا گھمندا ڦرندا، (اي ڏسندڙ) جڏھن انھن کي ڏسندين (ته) انھن کي کنڊريل موتي پيو ڀائيندين.",
            "verse 76:20": "۽ جڏھن اُتي نھاريندين (ته) اڻ کٽ نعمت ۽ وڏي بادشاھي پيو ڏسندين.",
            "verse 76:21": "مٿانئن سنھي سائي پَٽ ۽ ٿُلھي پَٽ جا ڪپڙا ھوندا، ۽ چاندِيءَ جا ڪنگڻ کين پارايا ويندا، ۽ سندن پالڻھار کين تمام پاڪ شراب پياريندو.",
            "verse 76:22": "بيشڪ اھو اوھان (جي عملن) جو بدلو آھي ۽ اوھان جو سعيو قبول ڪيل آھي.",
            "verse 76:23": "بيشڪ اسان توتي قرآن درجي بدرجي لاٿو.",
            "verse 76:24": "پوءِ پنھنجي پالڻھار جي حڪم (اچڻ) تائين صبر ڪر ۽ انھن (ماڻھن) مان ڪنھن گنھگار يا بي شڪر جو چيو نه مڃ.",
            "verse 76:25": "۽ پنھنجي پالڻھار جو نالو صبح ۽ سانجھيءَ ياد ڪر.",
            "verse 76:26": "۽ ڪجھ (وقت) رات ۾ اُن لاءِ نماز پڙھ ۽ گھڻي رات سندس پاڪائي ساراھ.",
            "verse 76:27": "بيشڪ اُھي (ڪافر) دنيا کي پيارو رکندا آھن ۽ ڳوري ڏينھن کي پنھنجي پٺيان ڦٽو ڪندا آھن.",
            "verse 76:28": "اسان کين پيدا ڪيو ۽ سندن سَنڌ پُختا ڪياسون، ۽ جڏھن گھرون (ته) اھڙا ٻيا عوض ۾ مٽائي آڻيون.",
            "verse 76:29": "بيشڪ اھا نصيحت آھي، پوءِ جيڪو گھري سو پنھنجي پالڻھار ڏانھن واٽ وٺي.",
            "verse 76:30": "۽ اوھين نه گھرندؤ مگر اُھو جيڪي الله گھري، ڇوته الله ڄاڻندڙ حڪمت وارو آھي.",
            "verse 76:31": "جنھن کي گھري (تنھن کي) پنھنجي رحمت ۾ داخل ٿو ڪري، ۽ ظالمن لاءِ ڏکوئيندڙ عذاب تيار ڪيو اٿس."
        },
        "Sinhalese": {
            "verse 76:1": "(මෙසේ යැයි) පවසන්නට තරම් වස්තුවක් ලෙස මිනිසා නොසිටි කාලයක් මිනිසාට නොපැමිණියේ ද?",
            "verse 76:2": "නියත වශයෙන්ම මුසු වූ ශුක්‍රාණු බිඳුවකින් අපි මිනිසා මැව්වෙමු. අපි ඔහු පරීක්ෂණයට ලක් කරන්නෙමු. එහෙයින් අපි ඔහු සවන් දිය හැකි හා බැලිය හැකි කෙනෙකු බවට පත් කළෙමු.",
            "verse 76:3": "එම මාර්ගය වෙත නියත වශයෙන්ම අපි ඔහුට මග පෙන්වූයෙමු. ඔහු කෘතවේදියෙකු ලෙස හෝ ගුණමකුවෙකු ලෙස හෝ සිටිය හැක.",
            "verse 76:4": "නියත වශයෙන්ම අපි දේවත්වය ප්‍රතික්ෂේප කරන්නන් ට දම්වැල් ද ගෙල විලංගු ද ඇවිළෙන ගින්න ද සූදානම් කළෙමු.",
            "verse 76:5": "නියත වශයෙන්ම දැහැමියෝ එහි කපුරු මිශ්රැති (කුසලාන මෙන් වූ) භාජන වලින් පානය කරති.",
            "verse 76:6": "(එය) උල්පතකි. එමගින් අල්ලාහ්ගේ ගැත්තන් පානය කරති. එය ඔවුන් (කැමැති තැනකට) පීරා ගලා යන්නට සලස්වති.",
            "verse 76:7": "ඔවුහු (තමන්ගේ) භාරය ඉටු කරති. තවද එහි හානිය පැතිර පවතින දිනයට ඔවුහු බිය වෙති.",
            "verse 76:8": "තවද ඒ (ආහාර) කෙරෙහි වූ ඇල්මක් (ඔවුන් තුළ තිබුනද) දිළින්දාට ද අනාථයාට ද සිරකරුවාට ද ඔවුහු ආහාර සපයති.",
            "verse 76:9": "“අපි නුඹලාට ආහාර සපයනුයේ අල්ලාහ්ගේ තෘප්තිය වෙනුවෙනි. නුඹලාගෙන් කිසිදු ප්‍රතිඵලයක් හෝ කිසිදු තුති පිදුමක් හෝ අපි අපේක්ෂා නොකරමු” (යැයි පවසති.)",
            "verse 76:10": "අපගේ පරමාධිපති වෙතින් මුහුණෙහි අප්‍රසන්න හා පිළිකුල විදහා පාන දිනයකට නියත වශයෙන්ම අපි බියවෙමු.",
            "verse 76:11": "එහෙයින් අල්ලාහ් එදින නපුරෙන් ඔවුන් මුදවා ගනු ඇත. තවද සතුට හා සොම්නස ඔවුන් හමුවන්නට සලසනු ඇත.",
            "verse 76:12": "ඔවුන් ඉවසා සිටි බැවින් ස්වර්ග උයන හා සේද රෙදි ඔවුනට ඔහු ප්‍රතිඵල වශයෙන් පිරිනැමනු ඇත.",
            "verse 76:13": "ඔවුහු ඇදන් මත හාන්සිවෙමින් සිටිති. ඔවුහු එහි හිරු රශ්මිය හෝ අධික සීතල හෝ නොදකිනු ඇත.",
            "verse 76:14": "තවද එහි හෙවණ ඔවුන් මත පහත් ව පවතී. වලු බර පලතුරු පොකුරුද එහි එල්ලී පවතී.",
            "verse 76:15": "රිදියෙන් වූ භාජන හා පළිඟු වලින් යුත් ගුරුලේත්තු රැගෙන ඔවුන් වටා ගමන් කරවනු ලබති.",
            "verse 76:16": "එය රිදියෙන් වූ පළිඟුය. ඔවුහු එහි ප්‍රමාණය සකස් කර ගන්නෝය.",
            "verse 76:17": "සන්ජබීල් (ඉඟුරු) මිශ්රැති පානයෙන් යුත් කුසලාන එහි ඔවුනට පානය සඳහා දෙනු ලබති.",
            "verse 76:18": "එහි සල්සබීල් යැයි හඳුන්වනු ලබන උල්පතක්ද වෙයි.",
            "verse 76:19": "සදා යෞවනයේ පසු වන දරුවන් ඔවුන් වටා යති. නුඹ ඔවුන් දුටු විට එය විසිරනු ලැබූ මුතු යැයි සිතනු ඇත.",
            "verse 76:20": "තවද නුඹ එහි දුටු විට අතිශය ප්‍රීතිය හා විශාල රාජ්‍යයක් ලෙස නුඹ දකිනු ඇත.",
            "verse 76:21": "කොළ පැහැති ඝන හා සිනිඳු සේද ඇඟලුම් ඔවුන් මත වෙයි. ඔවුනට රිදියෙන් වූ වළලු පලන්ඳවනු ලබති. තවද ඔවුන්ගේ පරමාධිපති ඔවුනට පිරිසිදු පානය සපයනු ඇත.",
            "verse 76:22": "නියත වශයෙන්ම මෙය නුඹලා සඳහා වූ ප්‍රතිඵලයක් විය. තවද නුඹලාගේ උත්සාහය තුති පුද කරනු ලබන්නක් විය.",
            "verse 76:23": "නියත වශයෙන්ම අල් කුර්ආනය අපි නුඹ වෙත කොටස් වශයෙන් පහළ කළෙමු.",
            "verse 76:24": "එහෙයින් නුඹගේ පරමාධිපතිගේ නීතිය වෙනුවෙන් ඉවසීමෙන් සිටිනු. ඔවුන් අතරින් කිසිදු පාපියෙකුට හෝ දේවත්වය ප්‍රතික්ෂේප කරන කිසිදු අයකුට හෝ නුඹ අවනත නොවනු.",
            "verse 76:25": "තවද උදේ සවස නුඹේ පරමාධිපතිගේ නාමය සුවිශුද්ධ කරනු.",
            "verse 76:26": "තවද රාත්‍රියේදී ඔහුට සුජූද් කරනු. තවද රාත්‍රියේදී දිගු වේලාවක් නුඹ ඔහු සුවිශුද්ධ කරනු.",
            "verse 76:27": "නියත වශයෙන්ම ඔවුහු මෙලොවට ප්රිය කරති. නමුත් ඔවුනට පසු ව ඇති බැරෑරුම් දිනය අත හැර දමති.",
            "verse 76:28": "අපි ඔවුන් මැව්වෙමු. තවද ඔවුන්ගේ ව්‍යූහය අපි ශක්තිමත් කළෙමු. තවද අප අභිමත කළේ නම් ඔවුන් වෙනුවට ඔවුන් මෙන් වූවන් අපි වෙනස් කොට පත් කරන්නෙමු.",
            "verse 76:29": "නියත වශයෙන්ම මෙය උපදෙසකි. එහෙයින් කවරෙකු අභිමත කරන්නේ ද තම පරමාධිපති වෙත මාර්ගයක් ගනිත්වා!",
            "verse 76:30": "අල්ලාහ් අභිමත කරන්නේ නම් මිස නුඹලා අභිමත නොකරන්නෙහුය. නියත වශයෙන්ම අල්ලාහ් සර්ව ඥානීය; මහා ප්‍රඥාවන්තය.",
            "verse 76:31": "ඔහු අභිමත කරන අය ඔහුගේ කරුණාව තුළට ඇතුළත් කරනු ඇත. තවද අපරාධකරුවන් වනාහි ඔවුනට වේදනීය දඬුවමක් ඔහු සූදානම් කර ඇත."
        },
        "Somali": {
            "verse 76:1": "Dhab ahaan waxaa dadka soo maray waqti wax la sheego uusan ahayn (uusan jirin).",
            "verse 76:2": "Annagaa ka abuuray dadka dhibic isku Dheehan, Imtixaan Dartiis, waxaana ka yeellay wax maqle wax arka ah.",
            "verse 76:3": "Annagaa Dadka tusinnay Jidka, waxayna Noqdeen mid Shukriya (mahadiya) iyo mid Gaalnimo Badan.",
            "verse 76:4": "Annagaa u darabnay Gaalada silsilado iyo katinado iyo naarta Saciira.",
            "verse 76:5": "kuwa Baarriyiinta ah waxay ka cabbi weel Buuxa oo lagu Dheehay kaafuur.",
            "verse 76:6": "Waa il ay ka Cabbaan Addoomada Eebe, ayna ujiidaan say Doonaan,",
            "verse 76:7": "Wayna oofiyaan Nadarka, waxayna ka yaabi maalin sharkeedu fidi (qiyaamada).",
            "verse 76:8": "Waxayna Quudiyaan iyagoo jecel miskiinka Agoonka iyo kan xabbisan (Dhibban).",
            "verse 76:9": "Iyagoo Dhihi waxaan idiin quudinnay dar Eebe, mana idinka doonaynno Ahaalmarin iyo Mahadnaq Midna.",
            "verse 76:10": "Waxaan ka Yabaynaa Eebahanno Maalin (wajigu) doorsoomi oo Daran.",
            "verse 76:11": "Eebana waa ka Dhawray sharka Maalintaas, wuxuuna siiyay nuur iyo Farax.",
            "verse 76:12": "Wuxuuna ku abaal Mariyay Samirkooda Dartiis jano iyo Xariir.",
            "verse 76:13": "Waxayna ku Dangiigsan Sariiro Sare, iyagoon ku arkayn qorrax iyo Dhaxan midna.",
            "verse 76:14": "Waxaana u dhaw hooska jannada, waxaana loo soo Raariciyay Midheheeda.",
            "verse 76:15": "Waxaa lala kor socon weelal Fidla ah iyo Koobab Quruurado ah.",
            "verse 76:16": "Quruuradahaas oo fidla ah si fiicanna u Qiyaasan.",
            "verse 76:17": "Waxaana laga Waraabiyaa Ehlu jannaha Sharaab macaan oo lugu Dheehay sinjibiil.",
            "verse 76:18": "Waana il lugu Magacaabo Salsabiil (ay ka cabbi).",
            "verse 76:19": "Waxaana u ageegi wiilal waari, Haddaad Aragtana aad u malayn Jawhar la saydhay.",
            "verse 76:20": "Haddaad Aragto halkaas waxaad arki nicmo iyo sharaf wayn.",
            "verse 76:21": "Dharkooduna (Ehlu Jannaha) waa xariir Jilicsan oo cagaaran iyo Xariir adagba, waxaana loo xidhi fidlo Gacmaha la Gashado, Eebana wuxuu ka waraabiyaa sharaab nadiifah.",
            "verse 76:22": "Kaasi waa Abaalmarintiinii Falkiiniina wuxuu Noqday mid la Mahadiyay.",
            "verse 76:23": "Annagaa Quraanka Nabiyow kugu soo Dajinnay.",
            "verse 76:24": "Ee ku Samir Xukunka Eebe, hana Maqlin Dambiile iyo Gaalnima Badane (warkiis).",
            "verse 76:25": "Xus magaca Eebe subax iyo Galabba.",
            "verse 76:26": "Habeenkana Eebe u sujuud, una tasbiixso Habeenkii (u tuko) waqti Dheer.",
            "verse 76:27": "Kuwaasi waxay Jecelyihiin tan soo Dagdagaysa (Adduunyada) waxay kaga Tagayaan Gadaashoodana Maalin Culus (Qiaamada).",
            "verse 76:28": "Annagaa Abuurray Dadka, Adkaynayna xubnohooda, Haddaan Doonnana waxaan ku Baddalaynaa kuwa la mid ah.",
            "verse 76:29": "Suuraddani waa waano, Ee Ruuxii Doona ha ka yeesho Eebe Xaggiisa waddo.",
            "verse 76:30": "Waxna ma dooni kartaan in Eebe doona mooyee, Eebana waa wax walba oge falsan.",
            "verse 76:31": "Wuxuu galiyaa naxariistiisa ruuxuu doono, daalimiintana wuxuu u darbay cadaab daran."
        },
        "Spanish": {
            "verse 76:1": "Acaso no hubo un tiempo para el hombre en el que no fue nada, ni siquiera un recuerdo?",
            "verse 76:2": "Es verdad que creamos al hombre a partir de una gota de esperma eyaculada, como una prueba para él, y lo hicimos con capacidad de ver y oír.",
            "verse 76:3": "Y lo guiamos al camino: agradecido o ingrato.",
            "verse 76:4": "Y para los incrédulos hemos preparado cadenas, argollas y un fuego ardiente.",
            "verse 76:5": "Los creyentes sinceros beberán de una copa cuya mezcla será kafur.",
            "verse 76:6": "Fuente de la que beberán los siervos de Allah y a la que harán manar cuando y como quieran.",
            "verse 76:7": "Ellos cumplían las promesas y temían un día cuyo mal se desatará.",
            "verse 76:8": "Y daban de comer, a pesar de su propia necesidad y apego a ello, al pobre, al huérfano y al cautivo.",
            "verse 76:9": "No os alimentamos sino por la faz de Allah, no buscamos en vosotros recompensa ni agradecimiento.",
            "verse 76:10": "Realmente tememos de nuestro Señor un día largo, penoso.",
            "verse 76:11": "Allah los habrá librado del mal de ese día y les dará resplandor y alegría.",
            "verse 76:12": "Su recompensa por haber tenido paciencia es un jardín y seda.",
            "verse 76:13": "En él estarán recostados sobre lechos y no verán solana ni helada.",
            "verse 76:14": "Las sombras estarán sobre ellos, cercanas, y sus frutos bajarán sumisamente.",
            "verse 76:15": "Se circulará en torno a ellos con vasijas de plata y copas que serán cristal,",
            "verse 76:16": "cristal de plata, cuyas proporciones habrán medido con exactitud.",
            "verse 76:17": "En él se les dará de beber un vino cuya substancia será jengibre.",
            "verse 76:18": "Y habrá una fuente llamada Salsabil.",
            "verse 76:19": "Y circularán en torno a ellos muchachos que tendrán para siempre la misma edad; al verlos los tomarás por perlas esparcidas.",
            "verse 76:20": "Y cuando veas a los que allí están, verás deleite y un gran reino.",
            "verse 76:21": "Llevarán vestidos de raso verde y de brocado, irán adornados con brazaletes de plata y su Señor les dará de beber una bebida pura.",
            "verse 76:22": "Esto es una recompensa que os corresponde; vuestro esfuerzo ha sido agradecido.",
            "verse 76:23": "Hemos hecho que descendiera el Corán sobre ti gradualmente.",
            "verse 76:24": "Así pues ten paciencia con el juicio de tu Señor y no obedezcas al que de ellos es malvado e ingrato.",
            "verse 76:25": "Y recuerda el nombre de tu Señor mañana y tarde.",
            "verse 76:26": "Y por la noche póstrate ante Él glorificándolo un largo período de ella.",
            "verse 76:27": "Es cierto que éstos aman la Vida Fugaz dejando a sus espaldas un día grave.",
            "verse 76:28": "Nosotros los hemos creado y hemos fortalecido su constitución y cuando queramos, pondremos en su lugar a otros semejantes a ellos.",
            "verse 76:29": "Esto es un recuerdo, quien quiera que tome un camino hacia su Señor.",
            "verse 76:30": "Pero no querréis a menos que Allah quiera, es cierto que Allah es Conocedor y Sabio.",
            "verse 76:31": "Introduce en Su misericordia a quien quiere.Los injustos tendrán un doloroso castigo."
        },
        "Swahili": {
            "verse 76:1": "Hakika kilimpitia binaadamu kipindi katika zama ambacho kwamba hakuwa kitu kinacho tajwa.",
            "verse 76:2": "Hakika Sisi tumemuumba mtu kutokana na mbegu ya uhai iliyo changanyika, tumfanyie mtihani. Kwa hivyo tukamfanya mwenye kusikia, mwenye kuona.",
            "verse 76:3": "Hakika Sisi tumembainishia Njia. Ama ni mwenye kushukuru, au mwenye kukufuru.",
            "verse 76:4": "Hakika Sisi tumewaandalia makafiri minyororo na pingu na Moto mkali.",
            "verse 76:5": "Hakika watu wema watakunywa katika vinywaji vilivyo changanyika na kafuri,",
            "verse 76:6": "Ni chemchem watakao inywa waja wa Mwenyezi Mungu, wakiifanya imiminike kwa wingi.",
            "verse 76:7": "Wanatimiza ahadi, na wanaiogopa siku ambayo shari yake inaenea sana,",
            "verse 76:8": "Na huwalisha chakula, juu ya kukipenda kwake, masikini, na yatima, na wafungwa.",
            "verse 76:9": "Hakika sisi tunakulisheni kwa wajihi wa Mwenyezi Mungu. Hatutaki kwenu malipo wala shukrani.",
            "verse 76:10": "Hakika sisi tunaiogopa kwa Mola wetu Mlezi hiyo siku yenye shida na taabu.",
            "verse 76:11": "Basi Mwenyezi Mungu atawalinda na shari ya siku hiyo, na atawakutanisha na raha na furaha.",
            "verse 76:12": "Na atawajazi Bustani za Peponi na maguo ya hariri kwa vile walivyo subiri.",
            "verse 76:13": "Humo wataegemea juu ya viti vya enzi, hawataona humo jua kali wala baridi kali.",
            "verse 76:14": "Na vivuli vyake vitakuwa karibu yao, na mashada ya matunda yataning'inia mpaka chini.",
            "verse 76:15": "Na watapitishiwa vyombo vya fedha na vikombe vya vigae,",
            "verse 76:16": "Vya fedha safi kama kiyoo, wamevipima kwa vipimo.",
            "verse 76:17": "Na humo watanyweshwa kinywaji kilicho changanyika na tangawizi.",
            "verse 76:18": "Hiyo ni chemchem iliyo humo inaitwa Salsabil.",
            "verse 76:19": "Na watawazungukia kuwatumikia wavulana wasio pevuka, ukiwaona utawafikiri ni lulu zilizo tawanywa.",
            "verse 76:20": "Na utakapo yaona, utakuwa umeona neema na ufalme mkubwa.",
            "verse 76:21": "Juu yao zipo nguo za hariri laini za kijani kibichi, na hariri nzito ya at'ilasi. Na watavikwa vikuku vya fedha, na Mola wao Mlezi atawanywesha kinywaji safi kabisa.",
            "verse 76:22": "Hakika haya ni malipo yenu; na juhudi zenu zimekubaliwa.",
            "verse 76:23": "Hakika Sisi tumekuteremshia Qur'ani kidogo kidogo.",
            "verse 76:24": "Basi ngojea hukumu ya Mola wako Mlezi wala usimt'ii miongoni mwao mwenye dhambi au mwenye kufuru.",
            "verse 76:25": "Na likumbuke jina la Mola wako Mlezi asubuhi na jioni;",
            "verse 76:26": "Na usiku msujudie Yeye, na umtakase usiku, wakati mrefu.",
            "verse 76:27": "Kwa hakika watu hawa wanapenda maisha ya kidunia, na wanaiacha nyuma yao siku nzito.",
            "verse 76:28": "Sisi tumewaumba, na tukavitia nguvu viungo vyao. Na tukitaka tutawabadilisha mfano wao wawe badala yao.",
            "verse 76:29": "Hakika haya ni mawaidha; basi anaye taka atashika Njia ya kwenda kwa Mola wake Mlezi.",
            "verse 76:30": "Wala hamwezi kutaka ila atakapo Mwenyezi Mungu. Hakika Mwenyezi Mungu ni Mwenye ilimu, Mwenye hikima.",
            "verse 76:31": "Humuingiza amtakaye katika rehema yake. Na wenye kudhulumu amewawekea adhabu iliyo chungu."
        },
        "Swedish": {
            "verse 76:1": "EN OÄNDLIG tid förflöt före människans ankomst, [en tid] då hon var något helt okänt.",
            "verse 76:2": "För att sätta henne på prov har Vi skapat människan av en droppe av ett flöde, blandat [med ett annat flöde], och så har Vi gett henne hörsel och syn.",
            "verse 76:3": "Vi har visat henne [hennes] väg, [och det är sedan hennes sak] att antingen visa tacksamhet [och följa vägledningen] eller att visa otacksamhet och så förneka [Oss].",
            "verse 76:4": "För dem som väljer förnekelsens väg har Vi kedjor och järn och en flammande eld i beredskap.",
            "verse 76:5": "Men de gudfruktiga skall tömma en bägare [vin] spetsat med kamfer",
            "verse 76:6": "[från] en källa där Guds tjänare släcker törsten och vars flöde aldrig sinar.",
            "verse 76:7": "[Det är] de som står fast vid sina löften och som bävar för den Dag då skräcken skall överskugga allt,",
            "verse 76:8": "de som ger den fattige, den faderlöse och fången att äta - oavsett deras eget behov och det pris de sätter på [födan] -",
            "verse 76:9": "[och säger:] \"Det är för Guds skull vi ger er att äta och vi väntar ingen gengåva och inget tack från er;",
            "verse 76:10": "vi fruktar vad vår Herre [har i beredskap för oss] en olycksdiger Dag!\"",
            "verse 76:11": "Den Dagen skall Gud skydda dem mot allt ont och skänka dem kraft och glädje,",
            "verse 76:12": "och belöna med en [evigt grönskande] lustgård och [dräkter av] silke för deras tålamod och uthållighet.",
            "verse 76:13": "I denna [lustgård] skall de vila på divaner, stödda [på mjuka kuddar], och där skall de varken utsättas för solens [hetta] eller för köld;",
            "verse 76:14": "skuggorna skall luta sig över dem och [fruktträden] tjänstvilligt bjuda ut sin frukt.",
            "verse 76:15": "Och fat av silver skall bäras omkring och bägare, genomskinliga som kristall -",
            "verse 76:16": "som [om de hade varit] av kristall [fastän de är] av silver; och de bestämmer [själva] hur mycket [som skall sättas för dem].",
            "verse 76:17": "Och [i lustgården] skall de bjudas en dryck spetsad med ingefära",
            "verse 76:18": "från en källa vars namn är Salsabeel.",
            "verse 76:19": "Och de skall betjänas av evigt unga gossar, som du skulle kunna tro vara kringströdda pärlor;",
            "verse 76:20": "och vart du än vänder dig, ser du överallt glädje och överdådig prakt.",
            "verse 76:21": "Och de skall bära dräkter av grönt siden och brokad och som smycken skall de ha armringar av silver. Och deras Herre skall stilla deras törst med den renaste dryck.",
            "verse 76:22": "[Och en röst skall säga:] \"Detta är lönen för era mödor, som [Gud] har sett med välbehag!\"",
            "verse 76:23": "JA, DET är Vi, som steg för steg har uppenbarat för dig denna Koran.",
            "verse 76:24": "Vänta därför med tålamod [Muhammad] på din Herres dom, och lyssna inte till någon av dem som är djupt sjunkna i synd eller framhärdar i förnekelse.",
            "verse 76:25": "Och åkalla din Herres namn när dagen gryr och när aftonen är nära",
            "verse 76:26": "och fall ned i tillbedjan inför Honom också under natten, och prisa och lova Honom utan avbrott en hel natt.",
            "verse 76:27": "De älskar livet och dess flyktiga glädjeämnen [över allt annat] och de skjuter undan [alla tankar på] den svåra Dag [som skall komma].",
            "verse 76:28": "Det är Vi som har skapat dem och gett deras lemmar och leder styrka, men om Vi vill kan Vi i deras ställe sätta andra, som liknar dem.",
            "verse 76:29": "DETTA är en påminnelse. Låt då den som vill, söka en väg till sin Herre!",
            "verse 76:30": "Men ni kan bara vilja om [också] Gud vill [att ni söker denna väg]; Gud är allvetande, vis.",
            "verse 76:31": "Han innesluter den Han vill i Sin nåd; men för de orättfärdiga har Han ett plågsamt straff i beredskap."
        },
        "Tajik": {
            "verse 76:1": "Дар ҳақиқат бар инсон муддате аз замон гузашт ва ӯ чизе зикршуда набуд.",
            "verse 76:2": "Мо одамиро аз нутфае омехта биёфаридем, то ӯро имтиҳон кунем. Ва шунавову бинояш сохтаем.",
            "verse 76:3": "Роҳро ба ӯ нишон додаем. Ё шукргузор бошад ё ношукр.",
            "verse 76:4": "Мо барои кофирон занҷирҳову ғулҳо ва оташи афрӯхта омода кардаем.",
            "verse 76:5": "Некон аз ҷомҳое менӯшанд, ки омехта ба кофур аст,",
            "verse 76:6": "чашмае, ки бандагони Худо аз он менушанд ва онро ба ҳар ҷое, ки мехоҳанд, равон месозанд.",
            "verse 76:7": "Ба назр вафо мекунанд ва аз рӯзе, ки шарри он ҳама ҷоро гирифтааст, метарсанд.",
            "verse 76:8": "Ва таъомро дар ҳоле, худ дӯсташ доранд, ба мискину ятим ва асир мехӯронанд,",
            "verse 76:9": "шуморо фақат барои Худо таъом медиҳем ва аз шумо на музде мехоҳем на шукре.",
            "verse 76:10": "Мо аз Парвардигори худ метарсем, дар рӯзе, ки он рӯз рӯйҳо турш мешавад ва тарснок аст.",
            "verse 76:11": "Худо онҳоро аз бадии он рӯз нигаҳ дошт ва ононро таровату шодмонӣ бахшид,",
            "verse 76:12": "Ба мукофоти сабре, ки кардаанд, биҳишту ҳарир дод.",
            "verse 76:13": "Дар он ҷо бар тахтҳо такя задаанд на ҳеҷ офтобе мебинанд ва на хунукии сахте.",
            "verse 76:14": "Сояҳои дарахтонаш бар сарашон афтода ва меваҳояш ба фармонашон бошад.",
            "verse 76:15": "Косаҳои нуқрагину кӯзаҳои шароб миёнашон ба гардиш дармеояд.",
            "verse 76:16": "Кӯзаҳое аз нуқра, ки онҳоро ба андоза пур кардаанд.",
            "verse 76:17": "Дар он ҷо ҷоме бинӯшонандашон, ки омехта бо занҷабил бошад,",
            "verse 76:18": "аз чашмае, ки онро салсабил мегӯянд.",
            "verse 76:19": "Ва писароне ба гирдашон мечарханд, ки чун онҳоро бубинӣ, пиндорӣ марвориди парокандаанд.",
            "verse 76:20": "Чун бингарӣ, ҳар чи бингари неъмат фаровон аст ва фармонравоии бузург.",
            "verse 76:21": "Бар танашон ҷомаҳоест аз сундуси сабз ва истабрақ. Ва ба дастбандҳое аз нуқра зинат шудаанд ва онҳоро Парвардигорашон шароби пок бинӯшонад.",
            "verse 76:22": "Ин мукофоти шумост ва аз кӯшишатон шукргузорӣ шудааст.",
            "verse 76:23": "Мо Қуръонро бар ту нозил кардем, нозил кардане некӯ!",
            "verse 76:24": "Дар баробари фармони Парвардигорат собир бош ва аз ҳеҷ гуноҳкор ё носипосе итоъат макун!",
            "verse 76:25": "Ва бомдодну шамгоҳон номи Парвардигоратро бар забон биёвар.",
            "verse 76:26": "Дар қисме аз шаб саҷдааш кун ва дар ҳамаи дарозии шаб тасбеҳаш гӯй!",
            "verse 76:27": "Инҳо ин дунёи зудгузарро дӯст доранд ва он рӯзи душворро паси пушт мепартоянд.",
            "verse 76:28": "Мо одамиёнро офаридем ва аъзову пайвандҳояшонро нерӯманд гардонидем ва агар хоҳем, ба ҷои онҳо қавме монандашон биёварем.",
            "verse 76:29": "Ин пандест. Пас ҳар кӣ хоҳад роҳе ба сӯи Парвардигори худ интихоб кунад.",
            "verse 76:30": "Ва шумо ҷуз он намехоҳед, ки Худо хоста бошад зеро Худо донову ҳаким аст!",
            "verse 76:31": "Ҳар касро, ки бихоҳад, шомили раҳмати худ созад ва барои ситамкорон азобе дардовар омода кардааст."
        },
        "Tamil": {
            "verse 76:1": "திட்டமாக மனிதன் மீது காலத்தில் ஒரு நேரம் வந்து, அதில் அவன் இன்ன பொருள் என்று குறிப்பிட்டுக் கூறுவற்கில்லாத நிலையில் இருக்கவில்லையா?",
            "verse 76:2": "(பின்னர் ஆண், பெண்) கலப்பான இந்திரியத்துளியிலிருந்து நிச்சயமாக மனிதனை நாமே படைத்தோம் - அவனை நாம் சோதிப்பதற்காக, அவனைக் கேட்பவனாகவும், பார்ப்பவனாகவும் ஆக்கினோம்.",
            "verse 76:3": "நிச்சயமாக, நாம் அவனுக்கு வழியைக் காண்பித்தோம்; (அதைப் பின்பற்றி) நன்றி உள்ளவனாக இருக்கின்றான்; அல்லது (அதைப்புறக்கணித்து) நன்றியற்றவனாக இருக்கின்றான்.",
            "verse 76:4": "காஃபிர்களுக்குச் சங்கிலிகளையும், அரிகண்டங்களையும், கொழுந்து விட்டெரியும் நரக நெருப்பையும் நிச்சயமாக நாம் தயார் செய்திருக்கின்றோம்.",
            "verse 76:5": "நிச்சயமாக நல்லவர்கள் (சுவர்க்கத்தில்) குவளைகளிலிருந்து (பானம்) அருந்துவார்கள்; அதன் கலப்பு காஃபூராக (கற்பூரமாக) இருக்கும்,",
            "verse 76:6": "(காஃபூர்) ஒரு சுனையாகும்; அதிலிருந்து அல்லாஹ்வின் நல்லடியார்கள் அருந்துவார்கள். அதை (அவர்கள் விரும்பும் இடங்களுக்கெல்லாம்) ஓடைகளாக ஓடச் செய்வார்கள்.",
            "verse 76:7": "அவர்கள் தாம் (தங்கள்) நேர்ச்சைகளை நிறை வேற்றி வந்தார்கள்; (கியாம) நாளை அவர்கள் அஞ்சி வந்தார்கள். அதன் தீங்கு (எங்கும்) பரவியிருக்கும்.",
            "verse 76:8": "மேலும், அ(வ்விறை)வன் மீதுள்ள பிரியத்தினால் ஏழைகளுக்கும், அநாதைகளுக்கும், சிறைப்பட்டோருக்கும் உணவளிப்பார்கள்.",
            "verse 76:9": "\"உங்களுக்கு நாங்கள் உணவளிப்பதெல்லாம், அல்லாஹ்வின் முகத்திற்காக (அவன் திருப்பொருத்தத்திற்காக); உங்களிடமிருந்து பிரதிபலனையோ (அல்லது நீங்கள்) நன்றி செலுத்த வேண்டுமென்பதையோ நாங்கள் நாடவில்லை\" (என்று அவர்கள் கூறுவர்).",
            "verse 76:10": "\"எங்கள் இறைவனிடமிருந்து, (எங்கள்) முகங் கடுகடுத்துச் சுண்டிவிடும் நாளை நிச்சயமாக நாங்கள் பயப்படுகிறோம்\" (என்றும் கூறுவர்).",
            "verse 76:11": "எனவே, அல்லாஹ் அந்நாளின் தீங்கை விட்டும் அவர்களைப் பாதுகாத்து அவர்களுக்கு முகச் செழுமையையும், மனமகிழ்வையும் அளிப்பான்.",
            "verse 76:12": "மேலும், அவர்கள் பொறுமையுடன் இருந்ததற்காக அவர்களுக்கு சுவர்க்கச் சோலைகளையும், பட்டாடைகளையும் அவன் நற்கூலியாகக் கொடுத்தான்.",
            "verse 76:13": "அவர்கள் அங்குள்ள ஆசனங்களில் சாய்ந்து (மகிழ்ந்து) இருப்பார்கள்; சூரியனையோ, கடுங் குளிரையோ அதில் அவர்கள் காணமாட்டார்கள்.",
            "verse 76:14": "மேலும், அதன் (மர) நிழல்கள், அவர்கள் மீது நெருங்கியதாக இருக்கும்; அன்றியும், அதன் பழங்கள் மிகத் தாழ்வாகத் தாழ்ந்திருக்கும்.",
            "verse 76:15": "(பானங்கள்) வெள்ளிப் பாத்திரங்களையும், பளிங்குக் கிண்ணங்களையும் (கொண்டு) அவர்கள் மீது சுற்றிக் கொண்டு வரப்படும்.",
            "verse 76:16": "(அவை பளிங்கல்ல) வெள்ளியினாலான, பளிங்கைப் போன்ற தெளிவான கிண்ணங்கள். அவற்றைத் தக்க அளவாக அமைந்திருப்பார்கள்.",
            "verse 76:17": "மேலும் அ(ச்சுவர்க்கத்)தில் ஸன்ஜபீல் (என்னும் இஞ்சி) கலந்த ஒரு கிண்ண(த்தில் பான)ம் புகட்டப்படுவார்கள்.",
            "verse 76:18": "'ஸல்ஸபீல்' என்ற பெயருடைய ஓர் ஊற்றும் அங்கு இருக்கிறது.",
            "verse 76:19": "இன்னும், (அந்த சுவர்க்கவாசிகளைச்) சுற்றி எப்போதும் (இளமையோடு) இருக்கும் சிறுவர்கள் (சேவை செய்து) வருவார்கள்; அவர்களை நீர் காண்பீரானால் சிதறிய முத்துகளெனவே அவர்களை நீர் எண்ணுவீர்.",
            "verse 76:20": "அன்றியும், (அங்கு) நீர் பார்த்தீராயின், இன்ப பாக்கியங்களையும், மாபெரும் அரசாங்கத்தையும் அங்கு காண்பீர்.",
            "verse 76:21": "அவர்களின் மீது ஸுன்துஸு, இஸ்தப்ரக் போன்ற பச்சை நிற பூம்பட்டாடைகள் இருக்கும்; இன்னும் அவர்கள் வெள்ளியாலாகிய கடகங்கள் அணிவிக்கப்பட்டிருப்பர், அன்றியும், அவர்களுடைய இறைவன் அவர்களுக்குப் பரிசுத்தமான பானமும் புகட்டுவான்.",
            "verse 76:22": "\"நிச்சயமாக இது உங்களுக்கு நற்கூலியாக இருக்கும்; உங்களுடைய முயற்சியும் ஏற்றுக் கொள்ளப்பட்டதாயிற்று\" (என்று அவர்களிடம் கூறப்படும்).",
            "verse 76:23": "நிச்சயமாக நாம் தான் உம்மீது இந்தக் குர்ஆனை சிறுகச் சிறுக இறக்கி வைத்தோம்.",
            "verse 76:24": "ஆகவே, உம்முடைய இறைவனின் கட்டளைக்காகப் பொறுமையுடன் (எதிர் பார்த்து) இருப்பீராக, அன்றியும், அவர்களில் நின்று எந்தப் பாவிக்கோ அல்லது நன்றியற்றவனுக்கோ நீர் வழிபடாதீர்.",
            "verse 76:25": "காலையிலும், மாலையிலும் உம்முடைய இறைவனின் திருநாமத்தை தஸ்பீஹு (துதி) செய்து கொண்டிருப்பீராக.",
            "verse 76:26": "இன்னும் இரவிலும் அவனுக்கு ஸுஜூது செய்வீராக, அன்றியும் இரவில் நெடுநேரம் அவனுக்கு தஸ்பீஹு(துதி) செய்வீராக.",
            "verse 76:27": "நிச்சயமாக இவர்கள் விரைந்து சென்று விடுவ(தான இவ்வுலகத்)தையே நேசிக்கின்றனர், அப்பால் பளுவான (மறுமை) நாளைத் தங்களுக்குப் பின்னே விட்டு(ப் புறக்கணித்து) விடுகின்றனர்.",
            "verse 76:28": "நாமே அவர்களைப் படைத்து அவர்களுடைய அமைப்பையும் கெட்டிப்படுத்தினோம்; அன்றியும் நாம் விரும்பினால் அவர்கள் போன்றவர்களை (அவர்களுக்குப் பதிலாக) மாற்றிக் கொண்டு வருவோம்.",
            "verse 76:29": "நிச்சயமாக இது ஒரு நல்லுபதேசமாகும்; எனவே யார் விரும்புகிறாரோ அவர் தம்முடைய இறைவன் பால் (செல்லும்) வழியைத் தேர்ந்தெடுத்துக் கொள்வாராக.",
            "verse 76:30": "எனினும், அல்லாஹ் நாடினாலன்றி, நீங்கள் நாட மாட்டீர்கள்; நிச்சயமாக அல்லாஹ் நன்கறிந்தவன், ஞானம் மிக்கவன்.",
            "verse 76:31": "அவன், தான் விரும்புபவரை தன்னுடைய ரஹ்மத்தில் புகுத்துகிறான்; அன்றியும் அநியாயக்காரர்களுக்கு நோவினை செய்யும் வேதனையை அவர்களுக்காகச் சித்தம் செய்து வைத்திருக்கின்றான்."
        },
        "Tatar": {
            "verse 76:1": "Әйә кешегә заманында бер вакыт килеп үтте түгелме, ул вакытта кеше телгә алына торган нәрсә түгел иде. Адәм г-м балчыктан халык ителгәч, Мәккә илә Таиф арасында берникадәр вакытлар ятты, һич телдә сөйләнмәде.",
            "verse 76:2": "Тәхкыйк Без Адом балаларын яраттык, ир илә хатынның катнашкан мәниләреннән, Без аны бәлаләндереп сынарбыз, аны ишетүче вә күрүче кылдык.",
            "verse 76:3": "Тәхкыйк аңа туры юлның сибешләрен күрсәттек, ул кеше Без биргән нигъмәтләргә йә шөкер итүчедер, йә нигъмәтләрне Аллаһ биргәнлеген инкяр итүчедер.",
            "verse 76:4": "Тәхкыйк Без нигъмәтләргә көферлек кылучыларга хәзерләдек чылбырларны вә богауларны һәм кызган утны.",
            "verse 76:5": "Тәхкыйк яхшы мөселманнар тәмле сулар эчәрләр, ул суның исе һәм тәме кәфур (камфора) кебидер.",
            "verse 76:6": "Ул кәфур чишмәдер, аннан эчәрләр Аллаһуның итагатьле коллары, вә ул чишмәне ничек кирәк – шулай агызырлар.",
            "verse 76:7": "Алар дөньяда вакытта Аллаһудан йөкләтелгән бурычларын үтәрләр, ягъни Аллаһ кушкан эшләрне эшләрләр вә Ул тыйган эшләрдән тыелырлар, вә алар катылыгы һәркайда таралган кыямәт көненнән куркырлар.",
            "verse 76:8": "Дәхи алар Аллаһ ризасы өчен мескеннәргә, ятимнәргә һәм тоткында булган мөселманнарга аш һәм садака бирерләр.",
            "verse 76:9": "Алар әйтерләр: \"Без сезне фәкать Аллаһ ризасы өчен генә ашатабыз, без сездән өмет итмибез каршысына безгә бер изгелек итүегезне һәм дога кылыгыз, дип тә әйтмибез.",
            "verse 76:10": "Чөнки без Раббыбыздан куркабыз катылыгы белән йөзләрне чытыкландыручы кыямәт көненнән\", – дип.",
            "verse 76:11": "Аллаһ аларны ул көннең катылыгыннан саклар һәм аларның йөзләремә яктылыкны дәхи шатлыкны салыр.",
            "verse 76:12": "Дәхи алармы Аллаһ юлында чыдамлы булганнары өчен җәннәт һәм ефәк киемнәр белән бүләкләр.",
            "verse 76:13": "Алар җәннәттә яхшы диваннарга таянучылардыр, анда кояш эсселеген һәм суыкны күрмәсләр.",
            "verse 76:14": "Дәхи аларга агач күләгәсе якын булыр һәм ул агачларның җимешләре аларга бик якын ителде.",
            "verse 76:15": "Дәхи алар тирәсендә йөртәләр көмеш савытларны һәм бәллүрдән булган борынсыз, тоткасыз савытларны.",
            "verse 76:16": "Ул савытлар көмешләнгән бәллүрдәндер, җәннәт хезмәтчеләре ул савытлар белән эчемлекне кирәк кадәр генә бирерләр.",
            "verse 76:17": "Дәхи алар тәмле сулардан эчерелмеш булырлар, ул суның катыштырылган тәме зәнҗәбил кебидер. (Зәнҗәбил эчемлекне бик хушландыра торган нәрсәдер.)",
            "verse 76:18": "Ул җәннәттә бер чишмәдер, ул чишмә сәлсәбил, дип аталыр.",
            "verse 76:19": "Дәхи алар янында һич үзгәрми торган яшь егетләр хезмәт итеп йөрерләр, әгәр күрсәң, аларны чәчелгән энҗе данәләре дип уйларсың.",
            "verse 76:20": "Әгәр син җәннәткә карасаң, анда төрле күп нигъмәтләрне күрерсең һәм зур байлыкны күрерсең.",
            "verse 76:21": "Аларның өсләрендә калып һәм нечкә яшел ефәк киемнәрдер, алар көмеш беләзекләр белән зиннәтләнерләр, Раббылары аларга пакь, татлы эчемлекләр эчерер.",
            "verse 76:22": "Тәхкыйк бу нигъмәтләр сезгә изге гамәлләрегез өчен бүләктер һәм барча көчегезне сарыф итеп Аллаһ юлында тырышуыгызның хакы ошбу җәннәт нигъмәтләре белән түләнде.",
            "verse 76:23": "Тәхкыйк Без, ий Мухәммәд г-м сиңа Коръәнне аерып ачык аңлатып иңдердек.",
            "verse 76:24": "Раббыңның хөкеменә чыда, һәм кешеләрнең гөнаһка чумганнарына вә хакны инкяр итүче кәферләрне итагать итмәгел!",
            "verse 76:25": "Раббыңның исемен зекер ит, намаз укытыл иртә белән һәм кич белән!",
            "verse 76:26": "Дәхи төнлә Аллаһуга сәҗдә кылгыл, һәм төнлә озын вакыт намаз укыгыл!",
            "verse 76:27": "Тәхкыйк бу Мәккә мөшрикләре һәм башка кәферләр үтеп китә торган дөньяны сөяләр, вә бик каты авыр кыямәт көне өчен хәзерләнүне артларына куялар.",
            "verse 76:28": "Без аларны халык кылдык, вә аларның буыннарын ныгыттык вә әгъзаларын куәтле кылдык, вә әгәр Без теләсәк, алыштырырбыз аларның охшашлары белән, ягъни аларны һәлак итәрбез дә урыннарына икенче кешеләрне китерербез.",
            "verse 76:29": "Тәхкыйк бу Коръән кешеләргә кирәк нәрсәләрне сөйләп белдерүче көчле вәгазь, ачык дәлилдер. Теләгән кеше Коръән белән гамәл кылсын да, үзенә Раббысының җәннәтләренә бара торган туры юлны алсын!",
            "verse 76:30": "Әле сез туры юлны кирәксенгән яхшы теләкне дә таба алмассыз, мәгәр Аллаһ теләсә генә табарсыз, тәхкыйк Аллаһ һәрнәрсәне белүче вә гадел хөкем итүче булды.",
            "verse 76:31": "Теләгән кешесене рәхмәтенә кергезер һәм Аңа каршылык күрсәтеп үзләренә золым иткән залимнәргә рәнҗеткүче каты ґәзабны хәзерләде."
        },
        "Telugu": {
            "verse 76:1": "అనంత కాలచక్రంలో, మానవుడు తాను చెప్పుకోదగిన వస్తువు కాకుండా ఉన్న సమయం గడవలేదా",
            "verse 76:2": "నిశ్చయంగా, మేము మానవుణ్ణి ఒక మిశ్రమ వీర్యబిందువుతో సృష్టించాము. అతనిని పరీక్షించటానికి, మేము అతనిని వినేవాడిగా, చూసేవాడిగా చేశాము",
            "verse 76:3": "నిశ్చయంగా, మేము అతనికి మార్గం చూపాము. ఇక అతడు కృతజ్ఞుడు కావచ్చు, లేదా కృతఘ్నుడూ కావచ్చు",
            "verse 76:4": "నిశ్చయంగా, మేము సత్యతిరస్కారుల కొరకు సంకెళ్ళను, మెడలో పట్టాలను మరియు భగభగ మండే నరకాగ్నిని (సఈరానుసిద్ధపరచి ఉంటాము)",
            "verse 76:5": "నిశ్చయంగా, పుణ్యాత్ములు కాఫూర్ అనే ఒక చెలమ నుండి ఒక గిన్నెలో తెచ్చిన (పానీయాన్ని) త్రాగుతారు",
            "verse 76:6": "ధారాళంగా పొంగి ప్రవహింప జేయబడే ఊటల నుండి, అల్లాహ్ దాసులు త్రాగుతూ ఉంటారు",
            "verse 76:7": "వారు తమ మొక్కుబడులను పూర్తి చేసుకున్నవారై ఉంటారు. మరియు దాని హాని అన్ని వైపులా క్రమ్ముకొనే, ఆ దినమును గురించి భయపడుతూ ఉంటారు",
            "verse 76:8": "మరియు అది తమకు ప్రీతికరమైనప్పటికీ వారు నిరుపేదలకు మరియు అనాథలకు మరియు ఖైదీలకు, ఆహారం పెట్టేవారై ఉంటారు",
            "verse 76:9": "వార (వారితో ఇలా అంటారు): వాస్తవానికి మేము అల్లాహ్ ప్రసన్నత కొరకే మీకు ఆహారం పెడుతున్నాము. మేము మీ నుండి ఎలాంటి ప్రతిఫలం గానీ, లేదా కృతజ్ఞతలు గానీ ఆశించటం లేదు",
            "verse 76:10": "నిశ్చయంగా, మేము మా ప్రభువు నుండి వచ్చే ఉగ్రమైన, దుర్భరమైన, ఆ దినానికి భయపడుతున్నాము",
            "verse 76:11": "కావున అల్లాహ్ వారిని ఆ దినపు కీడు నుండి కాపాడాడు. మరియు వారికి ఉల్లాసాన్ని మరియు ఆనందాన్ని ప్రసాదించాడు",
            "verse 76:12": "మరియు వారి సహనానికి ప్రతిఫలంగా వారికి స్వర్గాన్ని మరియు పట్టు వస్త్రాలను ఇచ్చాడు",
            "verse 76:13": "అందులో, వారు ఎత్తైన పీఠాల మీద దిండ్లకు ఆనుకొని కూర్చొని ఉంటారు. అందులో వారు ఎండ (బాధ) గానీ, చలి తీవ్రతను గానీ చూడరు",
            "verse 76:14": "మరియు అందులో వారిపై నీడలు పడుతుంటాయి. దాని ఫలాల గుత్తులు వారికి అందుబాటులో ఉంటాయి",
            "verse 76:15": "మరియు వారి మధ్య వెండి పాత్రలు మరియు గాజుగ్లాసులు త్రిప్ప బడుతూ ఉంటాయి",
            "verse 76:16": "ఆ గాజు గ్లాసులు స్ఫటికం వలే తెల్లవైన వెండితో చేయబడి ఉంటాయి. అవి నియమబద్ధాం నింపబడి ఉంటాయి",
            "verse 76:17": "మరియు వారికి సొంటి కలిపిన మధుపాత్రలు త్రాగటానికి ఇవ్వబడతాయి",
            "verse 76:18": "అది స్వర్గంలోని సల్ సబీల్ అనే పేరు గల ఒక ఊట",
            "verse 76:19": "మరియు వారి మద్య శాశ్వతంగా, యవ్వనులుగా ఉంటే బాలురు తిరుగుతూ ఉంటారు. మరియు నీవు వారిని చూస్తే, వారిని వెదజల్లిన ముత్యాలుగా భావిస్తావు",
            "verse 76:20": "మరియు నీవు అక్కడ (స్వర్గంలో) చూస్తే, ఎక్కడ చూసినా ఆనందమే పొందుతావు. మరియు ఒక మహత్తర సామ్రాజ్య వైభవం కనిపిస్తుంది",
            "verse 76:21": "వారి ఒంటి మీద సన్నని ఆకుపచ్చని శ్రేష్ఠమైన పట్టు వస్త్రాలు మరియు బంగారు జలతారు అల్లిన దుస్తులుంటాయి. మరియు వారికి వెండి కంకణాలు తొడిగించబడతాయి. మరియు వారి ప్రభువు వారికి నిర్మలమైన పానీయాన్ని త్రాగటానికి ప్రసాదిస్తాడు",
            "verse 76:22": "(వారితో ఇలా అనబడుతుంది): నిశ్చయంగా, ఇది మీకు ఇవ్వబడే ప్రతిఫలం. ఎందుకంటే, మీ శ్రమ అంగీరించబడింది",
            "verse 76:23": "నిశ్చయంగా, మేమే, ఈ ఖుర్ఆన్ ను, నీ పై (ఓ ముహమ్మద్!) క్రమక్రమంగా అవతరింపజేశాము",
            "verse 76:24": "కావున నీవు నీ ప్రభువు యొక్క ఆజ్ఞపై స్థిరంగా ఉండు మరియు వీరిలోని ఏ పాపి యొక్క లేదా సత్యతిరస్కారుని యొక్క మాట గాని వినకు",
            "verse 76:25": "మరియు నీ ప్రభువు నామాన్ని ఉదయం మరియు సాయంత్రం స్మరిస్తూ ఉండు",
            "verse 76:26": "మరియు రాత్రివేళ ఆయన సన్నిధిలో సాష్టాంగం (సజ్దా) చేస్తూ ఉండు మరియు రాత్రివేళ సుదీర్ఘ కాలం, ఆయన పవిత్రతను కొనియాడుతూ ఉండు",
            "verse 76:27": "నిశ్చయంగా, వీరు అనిశ్చితమైన ఈ ప్రాపంచిక జీవితం పట్ల మోహితులై వున్నారు. మరియు మున్ముందు రానున్న భారమైన దినాని విస్మరిస్తున్నారు",
            "verse 76:28": "మేమే వీరిని సృష్టించినవారము మరియు వీరి శరీరాన్ని దృఢ పరిచిన వారము. మరియు మేము కోరినప్పుడు వీరికి బదులుగా వీరి వంటి వారిని తేగలము",
            "verse 76:29": "నిశ్చయంగా, ఇదొక హితోపదేశం కావున ఇష్టపడినవాడు తన ప్రభువు వైపునకు పోయే మార్గాన్ని అవలంబించవచ్చు",
            "verse 76:30": "మరియు అల్లాహ్ కోరకపోతే, మీరు కోరేదీ (జరగదు)! నిశ్చయంగా, అల్లాహ్ సర్వజ్ఞుడు, మహావివేకవంతుడు",
            "verse 76:31": "ఆయన తాను కోరినవారిని తన కారుణ్యంలోకి తీసుకుంటాడు. మరియు దుర్మార్గుల కొరకు ఆయన బాధాకరమైన శిక్షను సిద్ధపరచి ఉంచాడు"
        },
        "Thai": {
            "verse 76:1": "แน่นอนกาลเวลาที่ยาวนานได้เกิดขึ้นแก่มนุษย์ เมื่อเขามิได้เป็นสิ่งที่ถูกกล่าวถึงเลย",
            "verse 76:2": "แท้จริงเราได้สร้างมนุษย์จากน้ำเชื้อผสมหยดหนึ่ง เพื่อเราได้ทดสอบเขา ดังนั้นเราจึงทำให้เขาเป็นผู้ได้ยิน เป็นผู้ได้เห็น",
            "verse 76:3": "แท้จริงเราได้ชี้แนะแนวทางให้แก่เขาแล้ว บางทีเขาก็เป็นผู้กตัญญู และบางทีเขาก็เป็นผู้เนรคุณ",
            "verse 76:4": "แท้จริงเราได้เตรียมโซ่ตรวน และกุญแจมือ และไฟที่ลุกโชติช่วงไว้สำหรับบรรดาผู้ปฏิเสธศรัทธา",
            "verse 76:5": "แท้จริงบรรดาผู้ทรงคุณธรรมนั้น จะได้ดื่มจากแก้วน้ำ ซึ่งผสมด้วยการบูรหอม",
            "verse 76:6": "เป็นตาน้ำพุที่ปวงบ่าวของอัลลอฮฺจะได้ดื่ม พวกเขาทำให้มันพวยพุ่งออกมาอย่างล้นเหลือ",
            "verse 76:7": "พวกเขาปฏิบัติตามคำสัตย์สาบาน และกลัวต่อวันหนึ่งที่ความชั่วร้ายของมันจะกระจายไปทั่ว",
            "verse 76:8": "และพวกเขาให้อาหารเนื่องด้วยความรักต่อพระองค์แก่คนยากจน เด็กกำพร้าและเชลยศึก",
            "verse 76:9": "(พวกเขากล่าวว่า) แท้จริงเราให้อาหารแก่พวกท่าน โดยหวังความโปรดปรานของอัลลอฮฺ เรามิได้หวังการตอบแทนและการขอบคุณจากพวกท่านแต่ประการใด",
            "verse 76:10": "แท้จริงเรากลัวต่อพระเจ้าของเราซึ่งเป็นวันแห่งหน้านิ่วคิ้วขมวดและแสนสาหัส",
            "verse 76:11": "ดังนั้น อัลลอฮฺจะทรงปกป้องพวกเขาให้พ้นจากความชั่วร้ายของวันนั้น และจะทรงให้พวกเขาพบกับความสดชื่นและความปิติ",
            "verse 76:12": "และพระองค์จะทรงตอบแทนแก่พวกเขาด้วยสวนสวรรค์ และอาภรณ์ไหมแพรเนื่องเพราะพวกเขาอดทน",
            "verse 76:13": "นอนเอกเขนก อยู่บนเก้าอี้นวมยาวในสวนสวรรค์ พวกเขาจะไม่พบเห็นแสงอาทิตย์ และความเหน็บหนาว",
            "verse 76:14": "และร่มเงาของสวนสวรรค์จะปกคลุมพวกเขาอย่างใกล้ชิด และผลไม่ในสวนสวรรค์ถูกโน้มต่ำลงมาใกล้พวกเขา",
            "verse 76:15": "และมีภาชนะที่ทำด้วยเงิน และแก้วน้ำที่ทำด้วยแก้วใสถูกวนเวียนรอบๆพวกเขา",
            "verse 76:16": "แก้วที่ทำด้วยเงินโดยพวกเขาจะเติมมันตามสัดส่วนที่พวกเขาต้องการ",
            "verse 76:17": "และในสวนสวรรค์นั้นพวกจะได้รับเครื่องดื่มจากแก้วซึ่งผสมด้วยขิง",
            "verse 76:18": "ในสวนสวรรค์มีตาน้ำพุที่มีชื่อว่า ซัลสะบีล",
            "verse 76:19": "และมีเด็กวัยรุ่นวนเวียนรอบๆ พวกเขา เมื่อเจ้าเห็นพวกเขา เจ้าคิดว่าพวกเขาเป็นไข่มุกที่เรียงราย",
            "verse 76:20": "และเมื่อเจ้ามองไปยังที่นั่นเจ้าจะพบแต่ความสุข และอาณาจักรอันกว้างใหญ่ไพศาล",
            "verse 76:21": "บนพวกเขามีอาภรณ์สีเขียวทำด้วยผ้าไหมละเอียด และผ้าไหมหยาบ และถูกประดับด้วยกำไลเงิน และพระเจ้าของพวกเขาจะทรงให้พวกเขาได้ดื่มเครื่องดื่มอันบริสุทธิ์ยิ่ง",
            "verse 76:22": "แท้จริงนี่คือ การตอบแทนแก่พวกเจ้า และการบากบั่นของพวกเจ้านั้นเป็นที่ยอมรับด้วยความยินดี",
            "verse 76:23": "แท้จริงเราได้ประทานอัลกุรอานให้แก่เจ้าเป็นขั้นตอน",
            "verse 76:24": "ดังนั้น เจ้าจงอดทนคอยข้อตัดสินของพระเจ้าของเจ้า และอย่าเชื่อฟังผู้ประพฤติชั่ว และผู้ปฏิเสธศรัทธาคนใดในหมู่พวกเขา",
            "verse 76:25": "และจงรำลึกถึงพระนามของพระเจ้าของเจ้าทั้งในยามเช้าและยามเย็น",
            "verse 76:26": "และจากส่วนหนึ่งของกลางคืนก็จงสุญดต่อพระองค์ และจงแซ่ซ้องสดุดีพระองค์ ในยามกลางคืนอันยาวนาน",
            "verse 76:27": "แท้จริง ชนเหล่านี้ (พวกปฏิเสธศรัทธา) รักชีวิตชั่วคราว และปล่อยทิ้งวันอันหนักหน่วงไว้เบื้องหลังพวกเขา",
            "verse 76:28": "เราได้บังเกิดพวกเขา และเราได้ทำให้เรือนร่างของพวกเขามั่นคงแข็งแรง และหากเราประสงค์ เราก็จะเปลี่ยนพวกอื่นเยี่ยงพวกเขา",
            "verse 76:29": "แท้จริง นี่คือข้อตักเตือนสติ ดังนั้นผู้ใดต้องการก็ให้เขายึดแนวทางสู่พระเจ้าของเขา",
            "verse 76:30": "แต่พวกเจ้าจะไม่สมความปรารถนาได้ เว้นแต่ที่อัลลอฮฺ เป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
            "verse 76:31": "พระองค์จะทรงให้ผู้ที่พระองค์ทรงประสงค์เข้าสู่ความเมตตาของพระองค์ แต่บรรดาผู้อธรรมนั้น พระองค์ทรงเตรียมการลงโทษอันเจ็บปวดไว้สำหรับพวกเขา"
        },
        "Turkish": {
            "verse 76:1": "İnsanoğlu, var edilip bahse değer bir şey olana kadar, şüphesiz, uzun bir zaman geçmemiş midir?",
            "verse 76:2": "Biz insanı katışık bir nutfeden yaratmışızdır; onu deneriz; bu yüzden, onun işitmesini ve görmesini sağlamışızdır.",
            "verse 76:3": "Şüphesiz ona yol gösterdik; buna kimi şükreder, kimi de nankörlük.",
            "verse 76:4": "Doğrusu, inkarcılar için zincirler, demir halkalar ve çılgın alevli cehennem hazırladık.",
            "verse 76:5": "Şüphesiz iyiler kafur katılmış bir tastan içerler.",
            "verse 76:6": "Bu ancak Allah'ın kullarının taşıra taşıra içebileceği bir pınardır.",
            "verse 76:7": "Onlar verdikleri sözleri yerine getirirler, fenalığı yaygın olan bir günden korkarlar.",
            "verse 76:8": "Onlar içleri çektiği halde, yiyeceği yoksula, öksüze ve esire yedirirler.",
            "verse 76:9": "\"Biz sizi ancak Allah rızası için doyuruyoruz, bir karşılık ve teşekkür beklemiyoruz. Doğrusu biz çok asık suratların bulunacağı bir günde Rabbimizden korkarız\" derler.",
            "verse 76:10": "\"Biz sizi ancak Allah rızası için doyuruyoruz, bir karşılık ve teşekkür beklemiyoruz. Doğrusu biz çok asık suratların bulunacağı bir günde Rabbimizden korkarız\" derler.",
            "verse 76:11": "Allah da onları bu yüzden o günün fenalığından korur; onların yüzüne parlaklık ve neşe verir.",
            "verse 76:12": "Sabırlarının karşılığı, cennet ve oradaki ipeklerdir.",
            "verse 76:13": "Orada tahtlara yaslanırlar; orada yakıcı sıcak ve dondurucu soğuk görmezler.",
            "verse 76:14": "Meyve ağaçlarının gölgeleri üzerlerine sarkmış ve onların koparılması kolaylaştırılmıştır.",
            "verse 76:15": "Çevrelerinde gümüş kaplar ve billur kaseler dolaştırılır.",
            "verse 76:16": "Billurları gümüş gibi parlaktır, onları ölçüp ölçüp dağıtırlar.",
            "verse 76:17": "Orada, zencefil karışık bir tasla içirilirler.",
            "verse 76:18": "O pınara \"Selsebil\" denir.",
            "verse 76:19": "Yanlarında ölümsüz gençler dolaşır; onları gördüğünde saçılmış birer inci sanırsın.",
            "verse 76:20": "Oranın neresine baksan, nimet ve büyük bir saltanat görürsün.",
            "verse 76:21": "Üzerlerinde ince yeşil ipekli, parlak atlastan elbiseler vardır; gümüş bileziklerle süslenmişlerdir Rableri onlara tertemiz içecekler içirir.",
            "verse 76:22": "\"İşte bu sizin işlediklerinizin karşılığıdır, çalışmalarınız şükre değer\" denir.",
            "verse 76:23": "Kuran'ı sana indiren şüphesiz Biziz.",
            "verse 76:24": "Rabbinin hükmüne kadar sabret; onların günah işleyen ve inkarcı olanlarına uyma.",
            "verse 76:25": "Rabbinin adını sabah akşam an.",
            "verse 76:26": "Geceleyin O'na secde et; O'nu geceleri uzun uzun tesbih et.",
            "verse 76:27": "Doğrusu insanlar, çabuk elde edilen dünya nimetlerini severler de ağırlığı çekilmez günü arkalarında bırakırlar.",
            "verse 76:28": "Onları yaratan, mafsallarını pekiştiren Biziz; dilersek onları benzerleri ile değiştiriveririz.",
            "verse 76:29": "Bu sadece bir öğüttür; dileyen, Rabbine giden yolu tutar.",
            "verse 76:30": "Allah dilemedikçe siz dileyemezsiniz. Doğrusu Allah, bilendir, Hakim'dir.",
            "verse 76:31": "Dilediğine rahmet eder. Zalimlere, işte onlara, can yakıcı bir azap hazırlamıştır."
        },
        "Urdu": {
            "verse 76:1": "بےشک انسان پر زمانے میں ایک ایسا وقت بھی آچکا ہے کہ وہ کوئی چیز قابل ذکر نہ تھی",
            "verse 76:2": "ہم نے انسان کو نطفہٴ مخلوط سے پیدا کیا تاکہ اسے آزمائیں تو ہم نے اس کو سنتا دیکھتا بنایا",
            "verse 76:3": "(اور) اسے رستہ بھی دکھا دیا۔ (اب) وہ خواہ شکرگزار ہو خواہ ناشکرا",
            "verse 76:4": "ہم نے کافروں کے لئے زنجیر اور طوق اور دہکتی آگ تیار کر رکھی ہے",
            "verse 76:5": "جو نیکو کار ہیں اور وہ ایسی شراب نوش جان کریں گے جس میں کافور کی آمیزش ہوگی",
            "verse 76:6": "یہ ایک چشمہ ہے جس میں سے خدا کے بندے پئیں گے اور اس میں سے (چھوٹی چھوٹی) نہریں نکالیں گے",
            "verse 76:7": "یہ لوگ نذریں پوری کرتے ہیں اور اس دن سے جس کی سختی پھیل رہی ہوگی خوف رکھتے ہیں",
            "verse 76:8": "اور باوجود یہ کہ ان کو خود طعام کی خواہش (اور حاجت) ہے فقیروں اور یتیموں اور قیدیوں کو کھلاتے ہیں",
            "verse 76:9": "(اور کہتے ہیں کہ) ہم تم کو خالص خدا کے لئے کھلاتے ہیں۔ نہ تم سے عوض کے خواستگار ہیں نہ شکرگزاری کے (طلبگار)",
            "verse 76:10": "ہم کو اپنے پروردگار سے اس دن کا ڈر لگتا ہے (جو چہروں کو) کریہہ المنظر اور (دلوں کو) سخت (مضطر کر دینے والا) ہے",
            "verse 76:11": "تو خدا ان کو اس دن کی سختی سے بچالے گا اور تازگی اور خوش دلی عنایت فرمائے گا",
            "verse 76:12": "اور ان کے صبر کے بدلے ان کو بہشت (کے باغات) اور ریشم (کے ملبوسات) عطا کرے گا",
            "verse 76:13": "ان میں وہ تختوں پر تکیے لگائے بیٹھے ہوں گے۔ وہاں نہ دھوپ (کی حدت) دیکھیں گے نہ سردی کی شدت",
            "verse 76:14": "ان سے (ثمردار شاخیں اور) ان کے سائے قریب ہوں گے اور میوؤں کے گچھے جھکے ہوئے لٹک رہے ہوں گے",
            "verse 76:15": "خدام) چاندی کے باسن لئے ہوئے ان کے اردگرد پھریں گے اور شیشے کے (نہایت شفاف) گلاس",
            "verse 76:16": "اور شیشے بھی چاندی کے جو ٹھیک اندازے کے مطابق بنائے گئے ہیں",
            "verse 76:17": "اور وہاں ان کو ایسی شراب (بھی) پلائی جائے گی جس میں سونٹھ کی آمیزش ہوگی",
            "verse 76:18": "یہ بہشت میں ایک چشمہ ہے جس کا نام سلسبیل ہے",
            "verse 76:19": "اور ان کے پاس لڑکے آتے جاتے ہوں گے جو ہمیشہ (ایک ہی حالت پر) رہیں گے۔ جب تم ان پر نگاہ ڈالو تو خیال کرو کہ بکھرے ہوئے موتی ہیں",
            "verse 76:20": "اور بہشت میں (جہاں) آنکھ اٹھاؤ گے کثرت سے نعمت اور عظیم (الشان) سلطنت دیکھو گے",
            "verse 76:21": "ان (کے بدنوں) پر دیبا سبز اور اطلس کے کپڑے ہوں گے۔ اور انہیں چاندی کے کنگن پہنائے جائیں گے اور ان کا پروردگار ان کو نہایت پاکیزہ شراب پلائے گا",
            "verse 76:22": "یہ تمہارا صلہ اور تمہاری کوشش (خدا کے ہاں) مقبول ہوئی",
            "verse 76:23": "اے محمد (ﷺ) ہم نے تم پر قرآن آہستہ آہستہ نازل کیا ہے",
            "verse 76:24": "تو اپنے پروردگار کے حکم کے مطابق صبر کئے رہو اور ان لوگوں میں سے کسی بد عمل اور ناشکرے کا کہا نہ مانو",
            "verse 76:25": "اور صبح وشام اپنے پروردگار کا نام لیتے رہو",
            "verse 76:26": "اور رات کو بڑی رات تک سجدے کرو اور اس کی پاکی بیان کرتے رہو",
            "verse 76:27": "یہ لوگ دنیا کو دوست رکھتے ہیں اور (قیامت کے) بھاری دن کو پس پشت چھوڑے دیتے ہیں",
            "verse 76:28": "ہم نے ان کو پیدا کیا اور ان کے مقابل کو مضبوط بنایا۔ اور اگر ہم چاہیں تو ان کے بدلے ان ہی کی طرح اور لوگ لے آئیں",
            "verse 76:29": "یہ تو نصیحت ہے۔ جو چاہے اپنے پروردگار کی طرف پہنچنے کا رستہ اختیار کرے",
            "verse 76:30": "اور تم کچھ بھی نہیں چاہ سکتے مگر جو خدا کو منظور ہو۔ بےشک خدا جاننے والا حکمت والا ہے",
            "verse 76:31": "جس کو چاہتا ہے اپنی رحمت میں داخل کرلیتا ہے اور ظالموں کے لئے اس نے دکھ دینے والا عذاب تیار کر رکھا ہے"
        },
        "Uyghur": {
            "verse 76:1": "ئىنسان (ئانىنىڭ قورسىقىدا) بىر مۇددەتنى ئۆتكۈزدى، ئۇ (ئەرزىمگەنلىكتىن) تىلغا ئېلىنىدىغان نەرسە بولمىدى",
            "verse 76:2": "شۈبھىسىزكى، بىز ئىنساننى ئارىلاشما مەنىي (يەنى ئەر بىلەن ئاياللارنىڭ مەنىيسى) دىن ياراتتۇق، ئۇنى بىز (شەرىئەت تەكلىپلىرى بىلەن) سىنايمىز، شۇنىڭ ئۈچۈن ئۇنى بىز (ئۇنى نازىل قىلغان ئايەتلىرىمىزنى ئاڭلىسۇن، كائىناتنى ياراتقۇچىنىڭ بىرلىكىگە دالالەت قىلىدىغان دەلىللەرنى كۆرسۇن دەپ) ئاڭلايدىغان، كۆرۈدىغان قىلىپ ياراتتۇق",
            "verse 76:3": "شۈبھىسىزكى، ئۇنىڭغا بىز (پەيغەمبەر ئەۋەتىش بىلەن ياخشى - يامان) يولنى كۆرسەتتۇق، ئۇ مۆمىن بولۇپ ياخشى يولدا مېڭىپ) اﷲ نىڭ نېمىتىگە) شۈكۈر قىلغۇچىدۇر، ياكى (فاجىر بولۇپ يامان يولدا مېڭىپ) كۇفرىلىق قىلغۇچىدۇر",
            "verse 76:4": "شۈبھىسىزكى، بىز كاپىرلارغا (پۇتلىرىغا سېلىنىدىغان) زەنجىرلەرنى، (بويۇنلىرىغا سېلىنىدىغان) تاقاقلارنى ۋە يېنىپ تۇرغان دوزاخنى تەييارلىدۇق",
            "verse 76:5": "ھەقىقەتەن ياخشىلار كافۇر ئارىلاشتۇرۇلغان (مەي بىلەن تولدۇرۇلغان) جاملاردىن ئىچىدۇ",
            "verse 76:6": "(ئۇ كافۇر جەننەتتىكى بىر) بۇلاقتىن ئېتىلىپ چىققان بولۇپ، ئۇنىڭدىن اﷲ نىڭ (ياخشى) بەندىلىرى ئىچىدۇ، ئۇ بۇلاقنى ئۇلار (خالىغان جايلىرىغا ئېقىتىپ بارالايدۇ",
            "verse 76:7": "ئۇلار ئۆز ئۈستىگە قەسەم ئىچىپ ئالغان ئىشنى ئورۇنلايدۇ ۋە دەھشىتى كەڭ دائىرىلىك بولغان كۈندىن (يەنى قىيامەت كۈنىدىن) قورقىدۇ",
            "verse 76:8": "ئۆزى موھتاج تۇرۇقلۇق، مىسكىنگە، يېتىمگە ۋە ئەسىرگە تائام بېرىدۇ",
            "verse 76:9": "(ئۇلار ئېيتىدۇ) «سىلەرگە بىز اﷲ نىڭ رازىلىقى ئۈچۈن تائام بېرىمىز، سىلەردىن (بۇنىڭ بەدىلىگە) ھېچقانداق مۇكاپات ۋە تەشەككۈر تەلەپ قىلمايمىز",
            "verse 76:10": "شۈبھىسىزكى، بىز پەرۋەردىگارىمىز تەرىپىدىن مەيدانغا كەلتۈرۈلگەن ئېغىر، قاتتىق كۈندىن قورقىمىز»",
            "verse 76:11": "اﷲ ئۇلارنى شۇ كۈننىڭ شەررىدىن ساقلايدۇ، ئۇلارنىڭ (يۈزلىرىگە) نۇر، (دىللىرىغا) خۇشاللىق ئاتا قىلىدۇ",
            "verse 76:12": "ئۇلارنىڭ سەۋر - تاقەتلىرى ئۈچۈن اﷲ ئۇلارنى جەننەت بىلەن ۋە (ئۇ يەردىكى) يىپەك (لىباسلار) بىلەن مۇكاپاتلايدۇ",
            "verse 76:13": "ئۇلار جەننەتتە تەختلەرگە يۆلىنىپ ئولتۇرىدۇ، ئۇلار جەننەتتە قاتتىق ئىسسىقنىمۇ، قاتتىق سوغۇقنىمۇ كۆرمەيدۇ",
            "verse 76:14": "جەننەتتىكى (دەرەخلەرنىڭ) سايىلىرى ئۇلارغا يېقىندۇر، جەننەتنىڭ مېۋىلىرىنى ئۈزۈش ئۇلارغا ئاسان قىلىنىدۇ",
            "verse 76:15": "ئۇلارغا (تاماق قاچىلانغان) كۈمۈش تەخسىلەر، (مەي تولدۇرۇلغان) كۈمۈشتىن ياسالغان (شىشىدەك سۈزۈك) جاملار ئايلاندۇرۇپ سۇنۇلۇپ تۇرىدۇ، (ساقىيلار، ئۇلارنىڭ ئېھتىياجىغا قاراپ) لايىق ئۆلچەيدۇ (يەنى ئىچكۈچىلەرنىڭ ئېھتىياجىدىن ئېشىپمۇ قالمايدۇ، كېمىيىپمۇ قالمايدۇ",
            "verse 76:16": "ئۇلارغا (تاماق قاچىلانغان) كۈمۈش تەخسىلەر، (مەي تولدۇرۇلغان) كۈمۈشتىن ياسالغان (شىشىدەك سۈزۈك) جاملار ئايلاندۇرۇپ سۇنۇلۇپ تۇرىدۇ، (ساقىيلار، ئۇلارنىڭ ئېھتىياجىغا قاراپ) لايىق ئۆلچەيدۇ (يەنى ئىچكۈچىلەرنىڭ ئېھتىياجىدىن ئېشىپمۇ قالمايدۇ، كېمىيىپمۇ قالمايدۇ",
            "verse 76:17": "ئۇلار يەنە جەننەتتە زەنجىبىل ئارىلاشتۇرۇلغان جام بىلەن (يەنى جامدىكى مەي بىلەن) سۇغىرىلىدۇ",
            "verse 76:18": "جەننەتتە سەلسەبىل دەپ ئاتىلىدىغان بىر بۇلاقمۇ بار",
            "verse 76:19": "قېرىماي ھەمىشە ياش تۇرىدىغان غىلمانلار نۆۋەت بىلەن ئۇلارنىڭ خىزمىتىنى قىلىپ تۇرىدۇ، ئۇلارنى كۆرگەن چېغىڭدا (ئۇلارنىڭ گۈزەللىكى، سۈزۈكلۈكى ۋە نۇرلۇقلۇقىغا قاراپ) ئۇلارنى تېرىلىپ كەتكەن مەرۋايىتمىكىن دەپ قالىسەن",
            "verse 76:20": "قاچانكى سەن قارايدىغان بولساڭ، بۇ يەردە (تەسۋىرلەپ تۈگەتكىلى بولمايدىغان) نېمەتلەرنى ۋە كاتتا پادىشاھلىقنى كۆرۈسەن",
            "verse 76:21": "ئۇلارنىڭ ئۇچىسىدا يۇپقا يىپەك ۋە قېلىن يىپەكتىن (تەييارلانغان) يېشىل كىيىملەر بولىدۇ، (ئۇلار) كۈمۈش ئۈزۈكلەرنى تاقايدۇ، پەرۋەردىگارى ئۇلارنى پاك شاراب بىلەن سۇغىرىدۇ",
            "verse 76:22": "شۈبھىسىزكى، بۇ سىلەرگە بېرىلگەن مۇكاپاتتۇر، سىلەرنىڭ مېھنىتىڭلار قوبۇل بولدى",
            "verse 76:23": "(ئى مۇھەممەد!) ھەقىقەتەن بىز ساڭا قۇرئاننى بۆلۈپ - بۆلۈپ نازىل قىلدۇق",
            "verse 76:24": "سەن پەرۋەردىگارىڭنىڭ ھۆكمىگە سەۋر قىلغىن، سەن ئۇلارنىڭ ئىچىدىن ھېچبىر گۇناھكارغا ياكى كۇفرىلىق قىلغۇچىغا بويسۇنمىغىن",
            "verse 76:25": "ئەتىگەن - ئاخشامدا پەرۋەردىگارىڭنىڭ نامىنى ياد قىلغىن (يەنى ناماز ئوقۇغىن، پەرۋەردىگارىڭغا كۆپ تائەت - ئىبادەت قىلغىن)",
            "verse 76:26": "كېچىنىڭ ئاز قىسمىدا ئۇنىڭغا سەجدە قىل، كۆپ قىسمىدا ئۇنىڭغا تەسبىھ ئېيت",
            "verse 76:27": "شۈبھىسىزكى، بۇلار (يەنى مۇشرىكلار) دۇنيانى (ئاخىرەتتىن) ئارتۇق بىلىدۇ، كەلگۈسىدىكى قىيىن بىر كۈنگە (يەنى قىيامەتكە) سەل قارايدۇ",
            "verse 76:28": "بىز ئۇلارنى ياراتتۇق، ئۇلارنىڭ بەدىنىنى مەزمۇت قىلدۇق، ئەگەر بىز خالىساق (ئۇلارنى ھالاك قىلىپ) ئورنىغا ئۇلارغا ئوخشاش باشقا ئادەمنى دەسسىتەتتۇق",
            "verse 76:29": "شۈبھىسىزكى، بۇ (ئايەتلەر) ۋەز - نەسىھەتتۇر (بۇ ۋەز - نەسىھەتتىن پايدىلىنىشنى) خالىغان ئادەم پەرۋەردىگارىغا يەتكۈزىدىغان يولنى تۇتسۇن",
            "verse 76:30": "پەقەت اﷲ خالىغاندىلا، ئاندىن سىلەر خالايسىلەر (يەنى ھەممە ئىش اﷲ نىڭ خاھىشىغا باغلىقتۇر). اﷲ ھەقىقەتەن ھەممىنى بىلگۈچىدۇر، ھېكمەت بىلەن ئىش قىلغۇچىدۇر",
            "verse 76:31": "اﷲ خالىغان ئادەمنى رەھمىتىنىڭ دائىرىسىگە كىرگۈزىدۇ. اﷲ زالىملارغا قاتتىق ئازابنى تەييارلىدى"
        },
        "Uzbek": {
            "verse 76:1": "Ҳақиқатда инсонга, у эсга олинадиган нарса бўлмаган бир замон келмадими?",
            "verse 76:2": "Албатта, Биз инсонни аралаш нутфадан яратдик. Синаш учун, бас, уни эшитадиган, кўрадиган қилдик.",
            "verse 76:3": "Албатта, Биз унга йўл кўрсатдик. (У эса) ёки шукр қилувчи, ёки куфр қилувчи бўлди.",
            "verse 76:4": "Албатта, Биз кофирлар учун занжирлар, кишанлар ва ёниб турган оловни тайёрлаб қўйдик.",
            "verse 76:5": "Албатта, яхшилар каафур аралаштирилган қадаҳдан ичарлар.",
            "verse 76:6": "Бир булоқданики, ундан Аллоҳнинг бандалари отилтириб ичарлар.",
            "verse 76:7": "Улар назрга вафо қиларлар ва ёмонлиги кенг тарқаладиган кундан қўрқарлар.",
            "verse 76:8": "Ўзлари таомни яхши кўриб турсалар ҳам, уни мискин, етим ва асирга берарлар.",
            "verse 76:9": "«Албатта, Биз сизларни фақат Аллоҳнинг розилиги учун овқатлантирамиз. Бунинг эвазига сизлардан мукофот ёки ташуккур хоҳласмиз.",
            "verse 76:10": "Албатта, биз қўрқинчли, шиддатли, узун кунда ўз Роббимиздан қўрқамиз», (дерлар).",
            "verse 76:11": "Бас, уларни Роббилари ўшал кун шарридан сақлади ва уларга хушрўйлик ҳамда хурсандчилик ато қилди.",
            "verse 76:12": "Ва сабр қилганликлари учун уларни боғу роғ ва ипаклар билан мукофотлади.",
            "verse 76:13": "У ерда сўриларда суянган ҳолдалар. У ерда қуёшни ҳам, совуқни ҳам кўрмаслар.",
            "verse 76:14": "Ва устиларига у(жаннат)нинг соялари яқиндир ҳамда унинг мевалари жуда ҳам осон қилингандир.",
            "verse 76:15": "Ва уларга кумуш идишлар ва биллурлардан бўлган қадаҳлар айлантириб турилар.",
            "verse 76:16": "Биллурлар, кумушсиймон, (соқийлар) ўлчовини келтирар.",
            "verse 76:17": "Ва улар у ерда аралашмаси занжабил бўлган қадаҳдан суғорилар",
            "verse 76:18": "Уердаги салсабийл, деб номланган булоқдан.",
            "verse 76:19": "Ва уларнинг атрофида абадий ёш болалар айланурлар, агар уларни кўрсанг, сочилган маржон, деб ўйларсан.",
            "verse 76:20": "Ва агар кўрсанг, у ерда неъматни ва улкан мулкни кўрарсан.",
            "verse 76:21": "Уларнинг устиларида яшил сундусдан (юпқа ипакдан) ва истобрақдан (қалин ипакдан) кийимлар бор ва кумуш билакузуклар-ла ясанганлар ва Роббилари уларни пок шароб билан суғорар.",
            "verse 76:22": "Албатта, бу сизга мукофот бўлди, ва амалингиз қабул бўлмшдир.",
            "verse 76:23": "Албатта, Биз сенга Қуръонни бўлак-бўлак қилиб туширдик.",
            "verse 76:24": "Бас, Роббинг ҳукмига сабр қил ва улардан гуноҳкор ёки кофирларига итоат қилма.",
            "verse 76:25": "Эртаю кеч Роббинг исмини зикр қил.",
            "verse 76:26": "Ва кечасида ҳам Унга сажда қил ва узоқ кечаларда Унга тасбиҳ айт.",
            "verse 76:27": "Албатта, анавилар шошган дунё)ни яхши кўрарлар ва оғир кунни ортларида қолдирарлар.",
            "verse 76:28": "Биз уларни яратдик ва яратилишларини мстаҳкам қилдик. Ва агар хоҳласак уларнинг ўринларига ўхшашларини келтирурмиз.",
            "verse 76:29": "Албатта, бу(сура)эслатмадир. Бас, ким хоҳласа ўз Роббисига йўл оладир.",
            "verse 76:30": "Ва Аллоҳ хоҳласагина, сизлар ҳам хоҳларсиз. Албатта, Аллоҳ билувчи ва ҳикматли зотдир.",
            "verse 76:31": "У кимни хоҳласа Ўз раҳматига киритадир ва золимлар учун аламли азоблар тайёрлаб қўйгандир."
        },
        "Vietnamese": {
            "verse 76:1": "Chẳng phải đã có một khoảng thời gian mà con người không là một thứ gì đáng nhắc đến?",
            "verse 76:2": "Thật vậy, TA (Allah) đã tạo ra con người từ một giọt tinh dịch, để TA có thể thử thách y; và TA đã làm cho y nghe và thấy.",
            "verse 76:3": "Quả thật, TA đã hướng dẫn y con đường (rõ ràng, TA cho y toàn quyền lựa chọn), hoặc là y biết ơn hoặc là y vô ơn.",
            "verse 76:4": "Thật vậy, TA đã chuẩn bị cho những kẻ vô đức tin những xiềng xích, gông cùm và ngọn lửa rực cháy.",
            "verse 76:5": "Người ngoan đạo, đức hạnh chắc chắn sẽ được uống ly (rượu) được pha chế với hỗn hợp Kafur (mang hương thơm như long não).",
            "verse 76:6": "Có một con suối mà những người bề tôi của Allah sẽ uống; dòng chảy của nó dồi dào theo mong muốn của họ.",
            "verse 76:7": "Họ (là những người) đã hoàn thành lời thề nguyện (của họ) và luôn sợ cái Ngày mà sự xấu xa sẽ lan tràn (và đó là Ngày Tận Thế).",
            "verse 76:8": "Họ chia sẻ thức ăn cho người nghèo, trẻ mồ côi, và tù binh trong lúc họ cũng yêu thích và cần thức ăn đó.",
            "verse 76:9": "(Họ nói): “Chúng tôi chia sẻ thức ăn cho quí vị là chỉ vì sắc Diện của Allah chứ chúng tôi không mong sự đền đáp và tri ân từ quí vị.”",
            "verse 76:10": "“Chúng tôi thực sự sợ Thượng Đế của chúng tôi vào một Ngày (mà những kẻ tội lỗi sẽ) cau mày nhăn nhó và buồn thảm.”",
            "verse 76:11": "Vì vậy, Allah sẽ bảo vệ họ khỏi cái xấu của Ngày đó và Ngài sẽ ban cho họ sự rạng rỡ và niềm vui.",
            "verse 76:12": "Ngài sẽ thưởng cho họ một ngôi vườn (trong Thiên Đàng) và lụa là bởi những gì mà họ đã kiên nhẫn chịu đựng.",
            "verse 76:13": "Trong đó, họ sẽ ngả mình trên những chiếc ghế dài có lưng tựa. Họ sẽ không còn nhìn thấy (cái nóng của) mặt trời cũng như cảnh giá lạnh và rét buốt.",
            "verse 76:14": "Gần sát bên trên họ là những (cành) rợp bóng trải rộng và những chùm quả lủng lẳng gần tầm tay.",
            "verse 76:15": "Họ sẽ được phục vụ xung quanh với những chiếc bình bạc và những chiếc cốc pha lê.",
            "verse 76:16": "Có những chiếc cốc bằng bạc nhưng trong suốt như pha lê; chúng được định lượng thức uống vừa đủ (như họ muốn).",
            "verse 76:17": "Trong đó, họ sẽ được cho uống (với những) ly (rượu) được pha chế từ hỗn hợp gừng.",
            "verse 76:18": "Trong đó, có một con suối tên là Salsabil.",
            "verse 76:19": "Đi vòng quanh (để phục vụ) họ là những chàng thiếu niên trẻ mãi. Khi thấy chúng, Ngươi tưởng chúng là những viên ngọc trai rải rác.",
            "verse 76:20": "Khi Ngươi nhìn thấy (những gì trong Thiên Đàng), Ngươi sẽ thấy đó là một niềm hạnh phúc và một vương quốc vĩ đại.",
            "verse 76:21": "(Các cư dân Thiên Đàng), y phục của họ sẽ là lụa và gấm thêu màu xanh lá. Đồ trang sức của họ là những chiếc vòng bạc. Và Thượng Đế của họ sẽ cho họ uống một loại nước tinh khiết.",
            "verse 76:22": "(Họ sẽ được bảo): “Đây là phần thưởng cho các ngươi. Quả thật, sự cố gắng của các ngươi đã được đền đáp.”",
            "verse 76:23": "Quả thật, TA (Allah) đã ban Qur’an xuống cho Ngươi (Muhammad) bằng một sự mặc khải dần dần theo từng giai đoạn.",
            "verse 76:24": "Vì vậy, Ngươi hãy kiên nhẫn chịu đựng với quyết định của Thượng Đế của Ngươi; Ngươi chớ đừng nghe theo bất kỳ tên tội lỗi hay kẻ vô đức tin nào của bọn chúng.",
            "verse 76:25": "Ngươi hãy tụng niệm Tên của Thượng Đế Ngươi sáng chiều.",
            "verse 76:26": "Ngươi hãy cúi đầu quỳ lạy Ngài vào một phần của đêm và hãy tán dương Ngài qua đêm dài.",
            "verse 76:27": "Thật vậy, những kẻ (đa thần) này yêu thế giới hối hả (trần gian) và bỏ sau lưng chúng một Ngày nặng nề.",
            "verse 76:28": "TA đã tạo ra chúng và làm cho cơ thể của chúng cường tráng, nhưng khi TA muốn, TA có thể đưa những người tương tự đến thay thế chúng toàn bộ.",
            "verse 76:29": "Quả thật, đây là một sự nhắc nhở, vì vậy, ai muốn thì hãy chọn lấy một con đường trở về với Thượng Đế của mình.",
            "verse 76:30": "Tuy nhiên, những gì các ngươi muốn sẽ không thành trừ phi Allah muốn. Quả thật, Allah Toàn Tri, Sáng Suốt.",
            "verse 76:31": "Ngài thu nhận vào lòng thương xót của Ngài đối với ai Ngài muốn; nhưng những kẻ làm điều sai quấy, Ngài đã chuẩn bị cho chúng một sự trừng phạt đau đớn."
        },
        "Yoruba": {
            "verse 76:1": "Sebi akoko kan ninu igba ti re koja lori eniyan ti (eniyan) ko je kini kan ti won n daruko",
            "verse 76:2": "Dajudaju Awa seda eniyan lati ara ato t’o ropo mora won (lati ara okunrin ati obinrin), ki A le dan an wo. A si se e ni olugbo, oluriran",
            "verse 76:3": "Dajudaju A fi ona mo on; O le je oludupe, o si le je alaimoore",
            "verse 76:4": "Dajudaju Awa pese awon ewon, ajaga ati Ina sile de awon alaigbagbo",
            "verse 76:5": "Dajudaju awon eni rere, won yoo maa mu omi kan ninu ife. Ohun ti A popo mo (omi naa) ni kafura",
            "verse 76:6": "Omi iseleru kan ni, ti awon erusin Allahu yoo maa mu, ti won yo si maa mu un san jade daadaa (si ibi ti won ba fe)",
            "verse 76:7": "Won n mu eje won se. Won si n paya ojo kan, ti aburu re je ohun ti o maa fonka gan-an",
            "verse 76:8": "Tohun ti bi won se ni ife si (oro to), won n fun mekunnu, omo orukan ati eru ni ounje je",
            "verse 76:9": "(Won si n so pe:) \"Nitori Oju rere Allahu (nikan) l’a fi n fun yin ni ounje; awa ko si gbero esan tabi idupe kan lati odo yin",
            "verse 76:10": "Dajudaju awa n paya ni odo Oluwa wa ojo kan ti (eda yoo) faju ro koko",
            "verse 76:11": "Nitori naa, Allahu yoo so won nibi aburu ojo yen. O si maa fun won ni itutu oju ati idunnu",
            "verse 76:12": "O si maa san won ni esan Ogba Idera ati aso alari nitori pe won se suuru",
            "verse 76:13": "Won yoo maa rogbo ku sori awon ibusun won. Won ko si nii ri oorun tabi otutu",
            "verse 76:14": "Awon ooji (inu Ogba Idera) yoo sunmo won. A si maa mu awon eso ibe sunmo arowoto won ni ti sisunmo",
            "verse 76:15": "Ati pe won yoo maa gbe ife imumi nla ti won se lati ara fadaka ati awon ife imumi kekere ti o je alawo kaa kiri odo won",
            "verse 76:16": "Ife alawo ti won se lati ara fadaka ni (won). A si se won niwon-niwon (ti o se weku ohun ti won fe mu)",
            "verse 76:17": "Ati pe won yoo maa fun won ni ife oti kan mu ninu (Ogba Idera). Ohun ti A popo mo (oti naa) ni atale",
            "verse 76:18": "Ninu Ogba Idera (won yoo tun maa mu) omi iseleru kan, ti A n pe ni omi salsabil",
            "verse 76:19": "Awon odokunrin ti ko nii gbo yo si maa lo bo laaarin won. Nigba ti iwo ba si ri won, iwo yoo ka won kun okuta olowo iyebiye ti won tan kale",
            "verse 76:20": "Nigba ti iwo ba si wo ibe yen (ninu Ogba Idera), iwo yoo ri idera ati ola t’o tobi",
            "verse 76:21": "Aso ara won ni aso aran felefele alawo eweko ati aso alagbaaa. A si maa fi egba-owo onifadaka se won ni oso. Oluwa won yo si fun won ni ohun mimu mimo mu",
            "verse 76:22": "Dajudaju eyi je esan fun yin. Ise yin si ja si ope",
            "verse 76:23": "Dajudaju Awa l’A so al-Ƙur’an kale fun o diedie",
            "verse 76:24": "Nitori naa, se suuru fun idajo Oluwa re. Ma se tele elese tabi alaimoore kan ninu won",
            "verse 76:25": "Ranti oruko Oluwa re ni aaro ati ni asale",
            "verse 76:26": "Ati ni oru, fori kanle fun Un. Ki o si safomo fun Un ni oru fun igba pipe",
            "verse 76:27": "Dajudaju awon wonyi feran aye. Won si n pa ojo t’o wuwo ti seyin won",
            "verse 76:28": "Awa l’A seda won. A si se won ni alagbara. Nigba ti A ba si fe, A oo fi iru won (miiran) paaro won ni ti ipaaro",
            "verse 76:29": "Dajudaju eyi ni iranti. Nitori naa, eni ti o ba fe ki o mu oju ona to si odo Oluwa re",
            "verse 76:30": "Eyin ko si nii fe (kini kan) afi ti Allahu ba fe. Dajudaju Allahu n je Onimo, Ologbon",
            "verse 76:31": "O maa fi eni ti o ba fe sinu ike re. (Ni ti) awon alabosi, O si pese iya eleta-elero sile de won"
        }
    }
}