{
    "id": 78,
    "name_simple": "An-Naba",
    "revelation_place": "makkah",
    "revelation_order": 80,
    "bismillah_pre": true,
    "verses_count": 40,
    "short_text": "The Surah derived its name from the word an-Naba in the second verse. This is not only a name but also a title of its subject matter, for Naba implies the news of Resurrection and Hereafter and the whole Surah is devoted to the same theme.",
    "text": [
        "\n",
        "The Surah derived its name from the word an-Naba in the second verse. This is not only a name but also a title of its subject matter, for Naba implies the news of Resurrection and Hereafter and the whole Surah is devoted to the same theme.",
        "\n",
        "Period of Revelation",
        "\n",
        "As we have explained in the introduction to Surah Al-Mursalat, the theme of all the Surahs, from Al-Qiyamah to An-Naziat, closely resembles one another's, and all these seem to have been revealed in the earliest period at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme also is the same as of Surah Al-Mursalat, i. e. to affirm the Resurrection and Hereafter, and to warn the people of the consequences of acknowledging or disacknowledging it.",
        "\n",
        "When the Holy Prophet (upon whom be peace) first started to preach Islam in Makkah, his message consisted of three elements: (1) That none be held as an associate with Allah in Godhead; (2) that Allah had appointed him as His Messenger; (3) that this world will come to an end one day and then another world will be established when all the former and the latter generations will be resurrected with the same bodies in which they lived and worked in the world; then they will be called to account for their beliefs and deeds and those who emerge as believing and righteous in this accountability will go to Paradise and those who are proved to be disbelieving and wicked will live in Hell for ever.",
        "\n",
        "Of these although the first thing was highly unpleasant for the people of Makkah, yet in any case they were not disbelievers in the existence of Allah. They believed in His Being the Supreme Sustainer, Creator and Providence and also admitted that all those beings whom they regarded as their deities, were themselves Allah's creatures. Therefore, in this regard the only thing they disputed was whether they had any share in the attributes and powers of Divinity and in the Divine Being itself or not.",
        "\n",
        "As for the second thing, the people of Makkah were not prepared to accept it. However, what they could not possibly deny was that during the 40 years life that the Holy Prophet (upon whom be peace) had lived among them before his claim to Prophethood, they had never found him a lying deceitful person or the one who would adopt unlawful methods for selfish ends. They themselves admitted that he was a man possessed of wisdom, righteousness and moral superiority. Therefore, in spite of charging him with a thousand false accusations, nothing to say of making others believe, they were finding it difficult even for themselves to believe that although he was an honest and upright man in every other affair and dealing of life, yet, God forbid, a liar only in his claim to be a Prophet.",
        "\n",
        "Thus, the first two things were not in fact so perplexing for the people of Makkah as the third thing. When this was presented before them, they mocked it most of all, expressed unusual wonder at it, and regarding it as remote from reason and impossible, started talking against it as incredible, even inconceivable, in their assemblies. But in order to bring them to the way of Islam it was absolutely essential that the doctrine of the Hereafter should be instilled into their minds, for without belief in this doctrine, it was not at all possible that they could adopt a serious attitude with regard to the truth and falsehood, could change their standard of values in respect of good and evil, and giving up worship of the world, could be inclined to follow the way that Islam urged them to follow. That is why in the earliest Surahs revealed at Makkah the doctrine of the Hereafter has been impressed and stressed more than anything else. However, the arguments for it have been given in\r\nsuch a way that the doctrine of the Oneness of God (Tauhid) also is impressed on the minds automatically. This also contains brief arguments, here and there, to confirm the truth of the Holy Messenger of Allah and the Qur'an.",
        "\n",
        "After understanding well why the theme of the Hereafter has been so frequently repeated in the Surahs of this period, let us now have a look at the subject matter of this Surah. In it first of all, allusion has been made to the common talk and the doubts that were being expressed in every street of Makkah and in every assembly of the people of Makkah on hearing the news about Resurrection. Then, the deniers have been asked: \"Don't you see this earth which We have spread as a carpet for you? Don't you see the high mountains which we have so firmly placed in the earth?Don't you consider your own selves how We have created you as pairs of men and women?Don't you consider your sleep by which We make you seek a few hours rest after every few hours labour and toil so as to keep you fit for work in the world? Don't you see the alternation of the night and day which We are so regularly perpetuating precisely according to your needs and requirements?Don't you see the strongly fortified\r\nsystem of the heavens above you? Don't you see the sun by means of which you are receiving your light and heat? Don't you see the rains which fall from the clouds and help produce corns and vegetables and luxuriant gardens? Do these things only tell you that the power of the Almighty Being Who has created them, will be unable to bring about Resurrection and establish the Next World? Then, from the supreme wisdom which is clearly working in this world around you, do you only understand this that although each part of it and each function of it is purposive, yet life is meaningless? Nothing could be more absurd and meaningless that after appointing man to the office of foreman and granting him vast powers of appropriation, in this workhouse, when he leaves the world after fulfilling his role, he should be let off without any accountability. He should neither be rewarded and granted pension on satisfactory work, nor subjected to any accountability and punishment on unsatisfactory\r\nperformance of duty.",
        "\n",
        "After giving these arguments it has been emphatically stated that the Day of Judgment shall certainly come to pass on its appointed time. No sooner is the Trumpet sounded than whatever is being foretold shall appear before the eyes, and whether you believe in it today, or not, at that time you will come out in your multitudes from wherever you would be lying dead and buried to render your account. Your denial cannot in any way avert this inevitable event.",
        "\n",
        "Then, in vv. 21-30; it has been stated that every single misdeed of those who do not expect any accountability to take place and have thus belied Our Revelations, lies reckoned and recorded with Us, and Hell is ever lying an ambush to punish them and punish them fully for all their doings. Then, in vv. 31-36, the best rewards of those who lived as responsible people in the world and have provided for their Hereafter beforehand have been mentioned. They have been reassured that they will not only be rewarded richly for their services but in addition they will also be given sufficient gifts.",
        "\n",
        "In conclusion, the Divine Court in the Hereafter has been depicted, making it plain that there will be no question of somebody's being adamant in the matter of getting his followers and associates forgiven, none will speak without leave, and leave will be granted on the condition that intercession be made only for the one to whom leave of intercession will have been given, and the intercessor will say only what is right. Moreover, leave for intercession will be given only for those who had acknowledged the Truth in the world but were sinners; rebels of God and rejectors of the Truth will deserve no intercession at all.",
        "\n",
        "The discourse has been concluded with this warning: The Day the coming of which is being foretold, shall certainly come to pass. Do not think it is yet far off, it is close at hand. Now, whoever wills, let him believe in it and take the way towards his Lord. But he who disbelieves, in spite of the warning, \"will have all his deeds placed before him: and he will exclaim regretfully: \"Oh, would that I were not born in the world!\" At that time, his regrets will be about the same world of which he is so enamored today!",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that mentions The [Great] Tiding of the coming of the Day og Judgment, the truth of which people yet dispute. It takes its name from the expression “the great tiding” (al-nabaʾ al-ʿaẓīm). The disbelievers often asked incredulously about the Resurrection. This surah gives evidence of God’s power, then explains what will happen on the Day of Resurrection, and the respective fates of believers and disbelievers.The surah is also known as: The Announcement, The Great News, The Important News, The News.",
    "name_translation": "The Tiding",
    "name_complex": "An-Naba’",
    "surah_name_ar": "النبأ",
    "verses": {
        "Albanian": {
            "verse 78:1": "Për çka pyesin ata njëri-tjetrin? –",
            "verse 78:2": "Për lajmin e madh,",
            "verse 78:3": "për të cilin ata kanë mendime të ndryshme.",
            "verse 78:4": "Jo, jo, ata, me siguri, do ta dinë!",
            "verse 78:5": "E pastaj, sërish, me të vërtetë, do ta dinë!",
            "verse 78:6": "A nuk u kemi bërë ne Tokën shtrat?",
            "verse 78:7": "E malet shtyll?",
            "verse 78:8": "Ne ju kemi krijuar dy lloje (mashkull e femër),",
            "verse 78:9": "dhe gjumin tuaj ua kemi bërë çlodhje,",
            "verse 78:10": "kure natën ua kemi bërë mbulesë,",
            "verse 78:11": "dhe ditën e kemi caktuar për jetesë (ekonomizim),",
            "verse 78:12": "dhe mbi ju kemi ndërtuar shtratë qiej të fortë.",
            "verse 78:13": "Dhe kemi krijur kandil (diell) të shëndritshëm!",
            "verse 78:14": "Ne, nga retë, u leshojmë ujëra të mëdha (shira)",
            "verse 78:15": "për rritjen e drithërave dhe bimëve,",
            "verse 78:16": "dhe kopshteve të dendura.,",
            "verse 78:17": "Me të vërtetë, Dita e sqarimit, është caktuar,",
            "verse 78:18": "Dita kur do të fryhet në buri (Sur), e do të vini ju, grupe-grupe,",
            "verse 78:19": "dhe qielli do të hapet dhe do të bëhet dyer,",
            "verse 78:20": "dhe malet lëvizin e bëhen si hije e ajrit (fatamorganë).",
            "verse 78:21": "Me të vërtetë, Skëterra do të bëhet pusi,",
            "verse 78:22": "për të këqinjtë vendbanim, -",
            "verse 78:23": "që aty të mbeten përgjithmonë:",
            "verse 78:24": "në të, nuk do të shijojnë as freskim, as pije,",
            "verse 78:25": "përpos ujit të vluar dhe qelbësirave,",
            "verse 78:26": "(si) shpërblim gjegjës (i veprave të tyre).",
            "verse 78:27": "Ata, me të vërtetë, nuk kanë menduar në dhënie të llogarisë,",
            "verse 78:28": "dhe argumentet Tona i kanë mohuar krejtësisht,",
            "verse 78:29": "por Ne, çdo gjë e kemi numërura dhe shënuar.",
            "verse 78:30": "“Andaj, shijoni, Ne do t’ju shtojmë vetëm dënimin”.",
            "verse 78:31": "E, me të vërtetë, për ata që i kanë druajtur Perëndisë, u janë përgatitur vende kënaqësie:",
            "verse 78:32": "kopshte dhe vreshta,",
            "verse 78:33": "dhe vajza të reja, të njëjtës moshë,",
            "verse 78:34": "dhe kupa të plota.",
            "verse 78:35": "Nuk do të dëgjojnë atje (në xhennet) biseda të kota as gënjeshtra,",
            "verse 78:36": "(ky është) shpërblimi i Zotit tënd, i dhënë sipas llogarisë (së veprave të tyre),",
            "verse 78:37": "Zotit të qiejve dhe të Tokës, dhe çka gjendet në mes tyre, Mëshiruesi, të cilit askush nuk do të mund t’i bëzejë (flas),",
            "verse 78:38": "në Ditën kur Xhebraili dhe engjëjt do të jenë të rreshtuar, e nuk do të flas askush, përpos atij që do t’i lejojë Mëshiruesi, e që do të thonë të vërtetën.",
            "verse 78:39": "Ajo është Ditë e pashmangshme, e kush të dojë, do ta marr strehimin te Zoti i vet.",
            "verse 78:40": "Me të vërtetë, Ne u kemi paralajmëruar se është i afërt dënimi, në Ditën kur njeriu do t’i shohë veprat e tija, dhe, kur jobesimtari, do të thotë: “Ah, të isha dhé!”"
        },
        "Amharic": {
            "verse 78:1": "ከምን ነገር ይጠያየቃሉ?",
            "verse 78:2": "ከታላቁ ዜና (ከቁርኣን ይጠያየቃሉ)፡፡",
            "verse 78:3": "ከዚያ እነርሱ በእርሱ የተለያዩበት ከኾነው፡፡",
            "verse 78:4": "ይከልከሉ፤ ወደፊት (የሚደርስበቸውን) በእርግጥ ያውቃሉ፡፡",
            "verse 78:5": "ከዚያም ይከልከሉ፤ ወደፊት ያውቃሉ፡፡",
            "verse 78:6": "ምድርን ምንጣፍ አላደረግንምን?",
            "verse 78:7": "ጋራዎችንም ችካሎች አላደረግንምን?",
            "verse 78:8": "ብዙ ዓይነቶችም አድርገን ፈጠርናችሁ፡፡",
            "verse 78:9": "እንቅልፋችሁንም ዕረፍት አደረግን፡፡",
            "verse 78:10": "ሌሊቱንም ልባስ አደረግን፡፡",
            "verse 78:11": "ቀኑንም (ለኑሮ) መስሪያ አደረግን፡፡",
            "verse 78:12": "ከበላያችሁም ሰባትን ብርቱዎች (ሰማያት) ገነባን፡፡",
            "verse 78:13": "አንጸባራቂ ብርሃንንም አደረግን፡፡",
            "verse 78:14": "ከአረገዙት ደመናዎችም ተንቧቢ ውሃን አወረድን፡፡",
            "verse 78:15": "በእርሱ እኽልንና ቅጠላ ቅጠልን እናወጣ ዘንድ (አወረድን)፡፡",
            "verse 78:16": "የተቆላለፉ አትክልቶችንም፡፡",
            "verse 78:17": "የመለያው ቀን የተወሰነ ጊዜ ነው፡፡",
            "verse 78:18": "በቀንዱ በሚነፋና የተለያዩ ጭፍሮች ኾናችሁ በምትመጡ ቀን ነው፡፡",
            "verse 78:19": "ሰማይም በምትከፈትና (ባለ) ደጃፎችም በምትኾንበት፡፡",
            "verse 78:20": "ጋራዎችም በሚነዱበት (እንደ) ሲሪብዱም በሚኾኑበት (ቀን) ነው፡፡",
            "verse 78:21": "ገሀነም መጠባበቂያ (ስፍራ) ናት፡፡",
            "verse 78:22": "ለሕግ ተላላፊዎች መመለሻ ስትኾን፡፡",
            "verse 78:23": "በውስጧ ብዙን ዘመናት ነዋሪዎች ሲኾኑ፤",
            "verse 78:24": "በውስጧ ቅዝቃዜንም መጠጥንም አይቀምሱም፡፡",
            "verse 78:25": "ግን ሙቅ ውሃንና እዥን (ይቀምሳሉ)፡፡",
            "verse 78:26": "ተስማሚን ምንዳ ይምመነዳሉ፡፡",
            "verse 78:27": "እነርሱ ምርመራን የማይፈሩ ነበሩና፡፡",
            "verse 78:28": "በአንቀጾቻችንም ማስተባበልን አስተባበሉና፡፡",
            "verse 78:29": "ነገሩንም ሁሉ የተጻፈ ሲኾን አጠቃለልነው፡፡",
            "verse 78:30": "ቅመሱም ቅጣትንም እንጅ (ሌላን) አንጨምራችሁም (ይባላሉ)፡፡",
            "verse 78:31": "ለጥንቁቆቹ መዳኛ ስፍራ አልላቸው፡፡",
            "verse 78:32": "አትክልቶችና ወይኖችም፡፡",
            "verse 78:33": "እኩያዎች የኾኑ ጡተ ጉቻማዎችም፡፡",
            "verse 78:34": "የተሞሉ ብርጭቆዎችም፡፡",
            "verse 78:35": "በውስጧ ትርፍ ቃልንም ማስዋሸትንም አይሰሙም፡፡",
            "verse 78:36": "ከጌታህ የኾነን ምንዳ በቂ ስጦታን (ተሰጡ)፡፡",
            "verse 78:37": "የሰማያትና የምድር በመካከላቸውም ያለው ሁሉ ጌታ በጣም አዛኝ ከኾነው (ተመነዱ)፡፡ ከእርሱ ጋር መነጋገርን አይችሉም፡፡",
            "verse 78:38": "መንፈሱ (ጂብሪል) መላእክቶቹም የተሰለፉ ኾነው በሚቆሙ ቀን አል-ረሕማን ለእርሱ የፈቀደለትና ትክክለኛን ቃል ያለ ሰው ቢኾን እንጅ (መነጋገርን አይችሉም)፡፡",
            "verse 78:39": "ይህ የተረጋገጠው ቀን ነው፡፡ የሻም ሰው ወደ ጌታው መመለስን ይይዛል፡፡",
            "verse 78:40": "እኛ ሰው ሁሉ እጆቹ ያስቀደሙትን በሚያይበትና ከሓዲውም ዋ ምኞቴ! ምንነው ዐፈር በኾንኩ በሚልበት ቀን ቅርብ የኾነን ቅጣት አስጠነቀቅናችሁ፡፡"
        },
        "Arabic": {
            "verse 78:1": "َنوُلَءاَسَتَي َّمَع",
            "verse 78:2": "ِميِظَعْلا ِإَبَّنلا ِنَع",
            "verse 78:3": "َنوُفِلَتْخُم ِهيِف ْمُه يِذَّلا",
            "verse 78:4": "َنوُمَلْعَيَس اَّلَك",
            "verse 78:5": "َنوُمَلْعَيَس اَّلَك َّمُث",
            "verse 78:6": "اًداَهِم َضْرَأْلا ِلَعْجَن ْمَلَأ",
            "verse 78:7": "اًداَتْوَأ َلاَبِجْلاَو",
            "verse 78:8": "اًجاَوْزَأ ْمُكاَنْقَلَخَو",
            "verse 78:9": "اًتاَبُس ْمُكَمْوَن اَنْلَعَجَو",
            "verse 78:10": "(اًساَبِل َلْيَّللا اَنْلَعَجَو",
            "verse 78:11": "(اًشاَعَم َراَهَّنلا اَنْلَعَجَو",
            "verse 78:12": "(اًداَدِش اًعْبَس ْمُكَقْوَف اَنْيَنَبَو",
            "verse 78:13": "(اًجاَّهَو اًجاَرِس اَنْلَعَجَو",
            "verse 78:14": "(اًجاَّجَث ًءاَم ِتاَرِصْعُمْلا َنِم اَنْلَزنَأَو",
            "verse 78:15": "(اًتاَبَنَو اًّبَح ِهِب َجِرْخُنِّل",
            "verse 78:16": "(اًفاَفْلَأ ٍتاَّنَجَو",
            "verse 78:17": "(اًتاَقيِم َناَك ِلْصَفْلا َمْوَي َّنِإ",
            "verse 78:18": "(اًجاَوْفَأ َنوُتْأَتَف ِروُّصلا يِف ُخَفنُي َمْوَي",
            "verse 78:19": "(اًباَوْبَأ ْتَناَكَف ُءاَمَّسلا ِتَحِتُفَو",
            "verse 78:20": "(اًباَرَس ْتَناَكَف ُلاَبِجْلا ِتَرِّيُسَو",
            "verse 78:21": "(اًداَصْرِم ْتَناَك َمَّنَهَج َّنِإ",
            "verse 78:22": "(اًبآَم َنيِغاَّطلِّل",
            "verse 78:23": "(اًباَقْحَأ اَهيِف َنيِثِباَّل",
            "verse 78:24": "(اًباَرَش اَلَو اًدْرَب اَهيِف َنوُقوُذَي اَّل",
            "verse 78:25": "(اًقاَّسَغَو اًميِمَح اَّلِإ",
            "verse 78:26": "(اًقاَفِو ًءاَزَج",
            "verse 78:27": "(اًباَسِح َنوُجْرَي اَل اوُناَك ْمُهَّنِإ",
            "verse 78:28": "(اًباَّذِك اَنِتاَيآِب اوُبَّذَكَو",
            "verse 78:29": "(اًباَتِك ُهاَنْيَصْحَأ ٍءْيَش َّلُكَو",
            "verse 78:30": "(اًباَذَع اَّلِإ ْمُكَديِزَّن نَلَف اوُقوُذَف",
            "verse 78:31": "(اًزاَفَم َنيِقَّتُمْلِل َّنِإ",
            "verse 78:32": "(اًباَنْعَأَو َقِئاَدَح",
            "verse 78:33": "(اًباَرْتَأ َبِعاَوَكَو",
            "verse 78:34": "(اًقاَهِد اًسْأَكَو",
            "verse 78:35": "(اًباَّذِك اَلَو اًوْغَل اَهيِف َنوُعَمْسَي اَّل",
            "verse 78:36": "(اًباَسِح ًءاَطَع َكِّبَّر نِّم ًءاَزَج",
            "verse 78:37": "(اًباَطِخ ُهْنِم َنوُكِلْمَي اَل ۖ ِنَٰمْحَّرلا اَمُهَنْيَب اَمَو ِضْرَأْلاَو ِتاَواَمَّسلا ِّبَّر",
            "verse 78:38": "(اًباَوَص َلاَقَو ُنَٰمْحَّرلا ُهَل َنِذَأ ْنَم اَّلِإ َنوُمَّلَكَتَي اَّل ۖ اًّفَص ُةَكِئاَلَمْلاَو ُحوُّرلا ُموُقَي َمْوَي",
            "verse 78:39": "(اًبآَم ِهِّبَر ٰىَلِإ َذَخَّتا َءاَش نَمَف ۖ ُّقَحْلا ُمْوَيْلا َكِلَٰذ",
            "verse 78:40": "(اًباَرُت ُتنُك يِنَتْيَل اَي ُرِفاَكْلا ُلوُقَيَو ُهاَدَي ْتَمَّدَق اَم ُءْرَمْلا ُرُظنَي َمْوَي اًبيِرَق اًباَذَع ْمُكاَنْرَذنَأ اَّنِإ"
        },
        "Azerbaijani": {
            "verse 78:1": "Onlar nə barədə bir-birindən soruşurlar?",
            "verse 78:2": "Böyük bir xəbər barəsində –",
            "verse 78:3": "elə bir xəbər ki, onlar onun haqqında ziddiyyətdədirlər.",
            "verse 78:4": "Xeyr, onlar Qiyamətin həqiqət olduğunu hökmən biləcəklər!",
            "verse 78:5": "Bir daha xeyr! Onlar hökmən biləcəklər!",
            "verse 78:6": "Məgər Biz yeri yataq etmədikmi?",
            "verse 78:7": "Dağları da payalar?!",
            "verse 78:8": "Biz sizi cüt yaratdıq.",
            "verse 78:9": "Yuxunuzu da sizin üçün rahatlıq etdik.",
            "verse 78:10": "Gecəni örtük etdik,",
            "verse 78:11": "gündüzü isə ruzi qazanmaq vaxtı.",
            "verse 78:12": "Üstünüzdə yeddi möhkəm göy qurduq",
            "verse 78:13": "və çox parlaq bir çıraq yaratdıq.",
            "verse 78:14": "Biz buludlardan şırıltıyla yağış yağdırdıq ki,",
            "verse 78:15": "onunla taxıl və digər bitkilər yetişdirək,",
            "verse 78:16": "habelə ağaclarının qol-budaqları bir-birinə sarmaşan bağlar salaq.",
            "verse 78:17": "Həqiqətən, ayırd etmə günü bəlli bir vaxta təyin edilmişdir!",
            "verse 78:18": "Sur üfürüləcəyi gün siz dəstə-dəstə gələcəksiniz.",
            "verse 78:19": "O gün göyün qapıları açılacaqdır.",
            "verse 78:20": "Dağlar da hərəkətə gətirilib ilğıma çevriləcək.",
            "verse 78:21": "Həqiqətən, Cəhənnəm kafirlər üçün pusquda dayanıb gözləyir.",
            "verse 78:22": "O, həddi aşanların qayıdacağı yerdir.",
            "verse 78:23": "Onlar orada əsrlər boyu qalacaqlar.",
            "verse 78:24": "Onlar orada nə bir sərinlik, nə də sərinlədirici içki dadacaqlar.",
            "verse 78:25": "İçdikləri yalnız qaynar su və irin olacaq –",
            "verse 78:26": "Törətdikləri əməllərinə uyğun bir cəza kimi.",
            "verse 78:27": "Doğrusu, onlar haqq-hesab çəkiləcəklərinə ümid etmirdilər.",
            "verse 78:28": "Ayələrimizi də qətiyyətlə təkzib edirdilər.",
            "verse 78:29": "Biz hər bir şeyi hesablayıb yazmışıq.",
            "verse 78:30": "Elə isə dadın əzabı! Biz sizə əzabdan başqa bir şey artırmayacağıq!",
            "verse 78:31": "Həqiqətən, müttəqilər üçün nicat yeri vardır.",
            "verse 78:32": "Həmçinin bağlar və üzümlüklər,",
            "verse 78:33": "dolğun döşlü həmyaşıd qızlar",
            "verse 78:34": "və ləbələb doldurulmuş qədəhlər də vardır!",
            "verse 78:35": "Onlar orada nə mənasız sözlər, nə də iftira eşidəcəklər.",
            "verse 78:36": "Bunlar sənin Rəbbindən olan mükafatlar, artıqlaması ilə verilən töhfələrdir.",
            "verse 78:37": "Göylərin, yerin və onların arasında olanların Mərhəmətli Rəbbindən mükafatdır. Onlar Allahın hüzurunda bir söz deməyə qadir olmayacaqlar.",
            "verse 78:38": "Ruh (Cəbrail) və mələklər səf-səf duracağı gün, Mərhəmətli Allahın izin verdiyi kimsələrdən və doğru söz deyənlərdən başqa heç kəs danışmayacaq.",
            "verse 78:39": "O gün, gerçək bir gündür. Kim istəsə öz Rəbbi yanında sığınacaq tapar!",
            "verse 78:40": "Həqiqətən, Biz sizi yaxın əzab barədə xəbərdar etdik. O gün insan öz əlləri ilə nələr etdiyini görəcək, kafir isə deyəcəkdir: “Kaş mən torpaq olaydım!”"
        },
        "Bengali": {
            "verse 78:1": "তারা পরস্পরে কি বিষয়ে জিজ্ঞাসাবাদ করছে?",
            "verse 78:2": "মহা সংবাদ সম্পর্কে,",
            "verse 78:3": "যে সম্পর্কে তারা মতানৈক্য করে।",
            "verse 78:4": "না, সত্ত্বরই তারা জানতে পারবে,",
            "verse 78:5": "অতঃপর না, সত্বর তারা জানতে পারবে।",
            "verse 78:6": "আমি কি করিনি ভূমিকে বিছানা",
            "verse 78:7": "এবং পর্বতমালাকে পেরেক?",
            "verse 78:8": "আমি তোমাদেরকে জোড়া জোড়া সৃষ্টি করেছি,",
            "verse 78:9": "তোমাদের নিদ্রাকে করেছি ক্লান্তি দূরকারী,",
            "verse 78:10": "রাত্রিকে করেছি আবরণ।",
            "verse 78:11": "দিনকে করেছি জীবিকা অর্জনের সময়,",
            "verse 78:12": "নির্মান করেছি তোমাদের মাথার উপর মজবুত সপ্ত-আকাশ।",
            "verse 78:13": "এবং একটি উজ্জ্বল প্রদীপ সৃষ্টি করেছি।",
            "verse 78:14": "আমি জলধর মেঘমালা থেকে প্রচুর বৃষ্টিপাত করি,",
            "verse 78:15": "যাতে তদ্দ্বারা উৎপন্ন করি শস্য, উদ্ভিদ।",
            "verse 78:16": "ও পাতাঘন উদ্যান।",
            "verse 78:17": "নিশ্চয় বিচার দিবস নির্ধারিত রয়েছে।",
            "verse 78:18": "যেদিন শিংগায় ফুঁক দেয়া হবে, তখন তোমরা দলে দলে সমাগত হবে।",
            "verse 78:19": "আকাশ বিদীর্ণ হয়ে; তাতে বহু দরজা সৃষ্টি হবে।",
            "verse 78:20": "এবং পর্বতমালা চালিত হয়ে মরীচিকা হয়ে যাবে।",
            "verse 78:21": "নিশ্চয় জাহান্নাম প্রতীক্ষায় থাকবে,",
            "verse 78:22": "সীমালংঘনকারীদের আশ্রয়স্থলরূপে।",
            "verse 78:23": "তারা তথায় শতাব্দীর পর শতাব্দী অবস্থান করবে।",
            "verse 78:24": "তথায় তারা কোন শীতল এবং পানীয় আস্বাদন করবে না;",
            "verse 78:25": "কিন্তু ফুটন্ত পানি ও পূঁজ পাবে।",
            "verse 78:26": "পরিপূর্ণ প্রতিফল হিসেবে।",
            "verse 78:27": "নিশ্চয় তারা হিসাব-নিকাশ আশা করত না।",
            "verse 78:28": "এবং আমার আয়াতসমূহে পুরোপুরি মিথ্যারোপ করত।",
            "verse 78:29": "আমি সবকিছুই লিপিবদ্ধ করে সংরক্ষিত করেছি।",
            "verse 78:30": "অতএব, তোমরা আস্বাদন কর, আমি কেবল তোমাদের শাস্তিই বৃদ্ধি করব।",
            "verse 78:31": "পরহেযগারদের জন্যে রয়েছে সাফল্য।",
            "verse 78:32": "উদ্যান, আঙ্গুর,",
            "verse 78:33": "সমবয়স্কা, পূর্ণযৌবনা তরুণী।",
            "verse 78:34": "এবং পূর্ণ পানপাত্র।",
            "verse 78:35": "তারা তথায় অসার ও মিথ্যা বাক্য শুনবে না।",
            "verse 78:36": "এটা আপনার পালনকর্তার তরফ থেকে যথোচিত দান,",
            "verse 78:37": "যিনি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছুর পালনকর্তা, দয়াময়, কেউ তাঁর সাথে কথার অধিকারী হবে না।",
            "verse 78:38": "যেদিন রূহ ও ফেরেশতাগণ সারিবদ্ধভাবে দাঁড়াবে। দয়াময় আল্লাহ যাকে অনুমতি দিবেন, সে ব্যতিত কেউ কথা বলতে পারবে না এবং সে সত্যকথা বলবে।",
            "verse 78:39": "এই দিবস সত্য। অতঃপর যার ইচ্ছা, সে তার পালনকর্তার কাছে ঠিকানা তৈরী করুক।",
            "verse 78:40": "আমি তোমাদেরকে আসন্ন শাস্তি সম্পর্কে সতর্ক করলাম, যেদিন মানুষ প্রত্যেক্ষ করবে যা সে সামনে প্রেরণ করেছে এবং কাফের বলবেঃ হায়, আফসোস-আমি যদি মাটি হয়ে যেতাম।"
        },
        "Berber Amazigh": {
            "verse 78:1": "£ef aydeg pmesteqsayen?",
            "verse 78:2": "£ef usali abarar,",
            "verse 78:3": "i$ef mgarraden.",
            "verse 78:4": "Xaîi, ad éôen.",
            "verse 78:5": "Sinna, xaîi, ad éôen.",
            "verse 78:6": "Day ur Nerra ara tamurt d usu,",
            "verse 78:7": "idurar, d ibudiden?",
            "verse 78:8": "Nexleq ikwen d tiwugiwin.",
            "verse 78:9": "Nerra ives nnwen d ôôaêa.",
            "verse 78:10": "Nerra iv d talaba.",
            "verse 78:11": "Nerra ass i tmeddurt.",
            "verse 78:12": "Nebna sennig wen ûa uohiden.",
            "verse 78:13": "Nerna asavef ipôeqôiqen.",
            "verse 78:14": "Nesse$li d, seg usigna, aman d ihedman,",
            "verse 78:15": "iwakken a Nessker, yissen, im$an, iâqqayen,",
            "verse 78:16": "tibêirin ideôsen.",
            "verse 78:17": "Ih, ass n ufraz ipwassen.",
            "verse 78:18": "Ass uûuvu n lbuq, a d tasem d iorawen.",
            "verse 78:19": "Ad ildi igenni, d$a ad ilint tebbura.",
            "verse 78:20": "Ad lêun idurar, u$alen d aylal.",
            "verse 78:21": "Ih, Loahennama teqquôa.",
            "verse 78:22": "D axxam imednas.",
            "verse 78:23": "Aîas ara qqimen dinna.",
            "verse 78:24": "Tissit, tasmuvi, ur degs, ppafen;",
            "verse 78:25": "siwa aman iô$an, akked iôeûvan.",
            "verse 78:26": "D aqeîîi iwulmen.",
            "verse 78:27": "Nitni, s tidep, ur oaâlen ara ad ppuqeîîin.",
            "verse 78:28": "Isekniyen nne£, s leqseê ay ten nekkôen.",
            "verse 78:29": "Yal cci, Nêesb it s tira.",
            "verse 78:30": "Ihi, jeôôbet! Ur awen Nernu, d awez$i, siwa aâaqeb.",
            "verse 78:31": "S tidep, i wid ipêezziben, amkan n laman;",
            "verse 78:32": "tifeôôanin, iqwiôen;",
            "verse 78:33": "tizzyiwin ifazen;",
            "verse 78:34": "lkisan ifalen.",
            "verse 78:35": "Ur din sellen yir awal ne$ tikerkas.",
            "verse 78:36": "D arraz s$uô Mass ik, d tikci klalen.",
            "verse 78:37": "Mass n tmurt, igenwan, akked wayen illan garasen; Aênin, ur zmiren a ten Ioo a d mmeslayen.",
            "verse 78:38": "Asmi ara beddent lmalayek akked ôôuê, d idurra, siwa win Iooa Uênin ara d immeslayen; a d yini awal uûwib.",
            "verse 78:39": "D wagi ay d ass n tidep; win ib$an, idda d ubrid n tu$alin ar Mass is.",
            "verse 78:40": "Ih, Nâaggen awen: aâaqeb d ayen iqeôben. Ass ideg ara iéeô umdan, acu xedmen ifassen is, ad yini ujehli: \"a ssexv iw, a lemmer lli$ d akal\"!"
        },
        "Bosnian": {
            "verse 78:1": "O čemu oni jedni druge pitaju?",
            "verse 78:2": "O vijesti velikoj,",
            "verse 78:3": "o kojoj oni različita mišljenja imaju.",
            "verse 78:4": "To nije dobro, oni će saznati sigurno!",
            "verse 78:5": "I još jednom, to nije dobro, oni će saznati sigurno!",
            "verse 78:6": "Zar Zemlju posteljom nismo učinili,",
            "verse 78:7": "i planine stupovima,",
            "verse 78:8": "i vas kao parove stvorili,",
            "verse 78:9": "i san vaš počinkom učinili,",
            "verse 78:10": "i noć pokrivačem dali,",
            "verse 78:11": "i dan za privređivanje odredili,",
            "verse 78:12": "i iznad vas sedam silnih sazdali,",
            "verse 78:13": "i svjetiljku plamteću postavili?",
            "verse 78:14": "Mi iz oblaka vodu obilno spuštamo",
            "verse 78:15": "i činimo da uz njenu pomoć raste žito i bilje,",
            "verse 78:16": "i bašče guste.",
            "verse 78:17": "Dan sudnji je, zaista, već određen,",
            "verse 78:18": "Dan kada će se u Rog puhnuti, pa ćete vi, sve skupina po skupina, dolaziti,",
            "verse 78:19": "i nebo će se otvoriti i mnogo kapija imati,",
            "verse 78:20": "i planine će se zdrobiti i priviđenje će biti.",
            "verse 78:21": "Džehennem će zasjeda postati,",
            "verse 78:22": "nasilnicima mjesto povratka –",
            "verse 78:23": "u kome će zauvijek ostati:",
            "verse 78:24": "u njemu svježine neće osjetiti, ni pića okusiti,",
            "verse 78:25": "osim vrele vode i kapljevine,",
            "verse 78:26": "kazne prikladne.",
            "verse 78:27": "Oni nisu očekivali da će račun polagati",
            "verse 78:28": "i dokaze Naše su pretjerano poricali,",
            "verse 78:29": "a Mi smo sve pobrojali i zapisali –",
            "verse 78:30": "pa trpite, mučenje ćemo vam sve gorim učiniti.",
            "verse 78:31": "A onima koji su se Allaha bojali želje će se ostvariti:",
            "verse 78:32": "bašče i vinogradi,",
            "verse 78:33": "i djevojke mlade, godīnā istih,",
            "verse 78:34": "i pehari puni.",
            "verse 78:35": "Tamo prazne besjede i neistinu neće slušati,",
            "verse 78:36": "Gospodar tvoj će ih darom obilnim nagraditi,",
            "verse 78:37": "Gospodar nebesa i Zemlje i onoga što je između njih, Milostivi, kome neće smjeti niko prvi riječ prozboriti",
            "verse 78:38": "na Dan kada Džibril i meleki budu u redove poredani, kada će samo onaj kome Milostivi dozvoli govoriti, a istinu će reći.",
            "verse 78:39": "To je neizbježan Dan, pa ko hoće, Gospodaru svome će, kao utočištu, poći.",
            "verse 78:40": "Mi vas na skoru patnju upozoravamo, na Dan u kome će čovjek djela ruku svojih vidjeti, a nevjernik uzviknuti: \"Da sam, bogdo, zemlja ostao!\""
        },
        "Bulgarian": {
            "verse 78:1": "За какво се питат един друг?",
            "verse 78:2": "За Великата вест,",
            "verse 78:3": "за която са в разногласие.",
            "verse 78:4": "Ала не! Те ще узнаят.",
            "verse 78:5": "И пак - не! Те ще узнаят.",
            "verse 78:6": "Не сторихме ли Ние земята постеля",
            "verse 78:7": "и планините - подпори?",
            "verse 78:8": "И ви сътворихме по двойки,",
            "verse 78:9": "и сторихме съня ви покой,",
            "verse 78:10": "и сторихме нощта покров,",
            "verse 78:11": "и сторихме деня за препитание,",
            "verse 78:12": "и съградихме над вас седем непоклатими небеса,",
            "verse 78:13": "и сторихме [слънцето] горящ светилник,",
            "verse 78:14": "и изсипваме от дъждовните облаци обилна вода,",
            "verse 78:15": "за да извадим чрез нея зърна и растения,",
            "verse 78:16": "и гъсти градини.",
            "verse 78:17": "Денят на разделението е уречен -",
            "verse 78:18": "Денят, когато се протръби с Рога и ще дойдете на тълпи,",
            "verse 78:19": "и ще се разтвори небето, и ще стане на двери,",
            "verse 78:20": "и планините ще бъдат раздвижени, и ще станат на мираж.",
            "verse 78:21": "Адът е в очакване",
            "verse 78:22": "за престъпващите - място за завръщане,",
            "verse 78:23": "където ще останат столетия.",
            "verse 78:24": "Не ще вкусят там нито прохлада, нито питие,",
            "verse 78:25": "освен вряща вода и гной -",
            "verse 78:26": "съответстващо въздаяние.",
            "verse 78:27": "Не се надяваха те на равносметка.",
            "verse 78:28": "И взимаха за пълна лъжа Нашите знамения.",
            "verse 78:29": "Но всяко нещо вписахме в книга.",
            "verse 78:30": "Затова вкусете! Не ще увеличим за вас друго освен мъчението.",
            "verse 78:31": "За богобоязливите има убежище [-Рая] -",
            "verse 78:32": "градини и лозя,",
            "verse 78:33": "и с напъпили гърди - девствени връстнички,",
            "verse 78:34": "и пълни чаши.",
            "verse 78:35": "Не ще чуват там нито празнословие, нито лъжа -",
            "verse 78:36": "въздаяние от твоя Господ - достатъчен дар,",
            "verse 78:37": "Господа на небесата и на земята, и на всичко между тях, Всемилостивия. Не ще могат с Него да говорят",
            "verse 78:38": "в Деня, в който Духът [Джибрил] и ангелите ще се възправят в редица. Не ще продумат, освен комуто Всемилостивият позволи, и той правдиво ще говори.",
            "verse 78:39": "Този е Денят на истината. А който пожелае, да търси пристан при своя Господ.",
            "verse 78:40": "Предупредихме ви за близко мъчение в Деня, в който всеки ще види какво е сторил преди с ръцете си. И неверникът ще каже: “О, да можех да съм прах!”"
        },
        "Chinese": {
            "verse 78:1": "他们互相询问，询问什么？",
            "verse 78:2": "询问那重大的消息，",
            "verse 78:3": "就是他们所争论的消息。",
            "verse 78:4": "绝不然！他们将来就知道了。",
            "verse 78:5": "绝不然，他们将来就知道了。",
            "verse 78:6": "难道我没有使大地如摇篮，",
            "verse 78:7": "使山峦如木桩吗？",
            "verse 78:8": "我曾把你们造成配偶，",
            "verse 78:9": "我曾使你们从睡眠中得到休息，",
            "verse 78:10": "我曾以黑夜为帷幕，",
            "verse 78:11": "我以白昼供谋生，",
            "verse 78:12": "我曾在你们上面建造了7层坚固的天，",
            "verse 78:13": "我创造一盏明灯，",
            "verse 78:14": "我从含水的云里，降下滂沱大雨，",
            "verse 78:15": "以便我借它而生出百谷和草木，",
            "verse 78:16": "以及茂密的园圃。",
            "verse 78:17": "判决之日，确是指定的日期，",
            "verse 78:18": "在那日，号角将被吹向，你们就成群而来；",
            "verse 78:19": "天将被开辟，有许多门户；",
            "verse 78:20": "山峦将被移动，而变成幻影；",
            "verse 78:21": "火狱确是伺候著，",
            "verse 78:22": "它是悖逆者的归宿；",
            "verse 78:23": "他们将在其中逗留长久的时期。",
            "verse 78:24": "他们在其中不能睡眠，不得饮料，",
            "verse 78:25": "只饮沸水和脓汁。",
            "verse 78:26": "那是一个很适当的报酬。",
            "verse 78:27": "他们的确不怕清算，",
            "verse 78:28": "他们曾否认我的迹象，",
            "verse 78:29": "我曾将万事记录在一本天经里。",
            "verse 78:30": "（将对他们说：）你们尝试吧！我只增加你们所受的刑罚。",
            "verse 78:31": "敬畏的人们必有一种收获，",
            "verse 78:32": "许多园圃和葡萄，",
            "verse 78:33": "和两乳圆润，年龄划一的少女，",
            "verse 78:34": "和满杯的醴泉。",
            "verse 78:35": "他们在那里面听不到恶言和谎话。",
            "verse 78:36": "那是从你的主发出的报酬　　充足的赏赐。",
            "verse 78:37": "他是天地万物的主，是至仁的主，他们不敢向他陈说。",
            "verse 78:38": "在精神和众天神排班肃立之日，他们不得说话，唯至仁主所特许而且能说正话的，才敢发言。",
            "verse 78:39": "那是必有的日子，谁意欲，谁就择取一个向他的主的归宿。",
            "verse 78:40": "我的确警告你们一种临近的刑罚，在那日，各人将要看见自己所已做的工作，不信道的人们将要说：啊！但愿我原是尘土。"
        },
        "Danish": {
            "verse 78:1": "Waarover vragen zij",
            "verse 78:2": "Over de grote aankondiging",
            "verse 78:3": "Waaromtrent zij (van mening) verschillen",
            "verse 78:4": "Waarlijk, zij zullen het spoedig te weten komen",
            "verse 78:5": "Nogmaals zij zullen het weldra te weten komen",
            "verse 78:6": "Hebben Wij de aarde niet als een bed gespreid",
            "verse 78:7": "En de bergen als palen opgezet",
            "verse 78:8": "En hebben Wij u niet in paren geschapen",
            "verse 78:9": "En hebben Wij uw slaap niet tot rusten bestemd",
            "verse 78:10": "En hebben Wij de nacht niet als een mantel gemaakt",
            "verse 78:11": "En hebben Wij de dag niet voor (het zoeken) naar levensonderhoud gemaakt",
            "verse 78:12": "En hebben Wij niet zeven sterke (hemelen) boven u gebouwd",
            "verse 78:13": "En daarin een stralende lamp geplaatst",
            "verse 78:14": "En zenden Wij niet vanuit de wolken regen neder die voortstroomt",
            "verse 78:15": "Opdat Wij daardoor graan en plantengroei voortbrengen",
            "verse 78:16": "En weelderige tuinen",
            "verse 78:17": "Voorzeker, de Dag der beslissing is bepaald",
            "verse 78:18": "De Dag waarop de bazuin wordt geblazen; dan zult gij in scharen komen",
            "verse 78:19": "En de hemel wordt geopend en zal vele poorten hebben",
            "verse 78:20": "En de bergen verdwijnen en worden tot een luchtspiegeling",
            "verse 78:21": "Voorzeker de hel ligt in een hinderlaag",
            "verse 78:22": "Een tehuis voor de opstandigen",
            "verse 78:23": "Die daarin lange tijd zullen vertoeven",
            "verse 78:24": "Zij zullen daar geen koelte hebben en geen dronk smaken",
            "verse 78:25": "Behalve kokend water en een stinkende vloeistof die verschrikkelijk koud is",
            "verse 78:26": "Een passende vergelding (voor hun daden)",
            "verse 78:27": "Zij verwachtten geen rekening",
            "verse 78:28": "En verwierpen Onze tekenen geheel",
            "verse 78:29": "En Wij hebben alles in een boek neergeschreven",
            "verse 78:30": "Smaakt dus de straf! Wij zullen u slechts hierin doen toenemen",
            "verse 78:31": "Voorwaar, er is triomf voor de rechtvaardigen",
            "verse 78:32": "Beschutte tuinen en wijnbergen",
            "verse 78:33": "En jeugdige gezellen, gelijk in leeftijd",
            "verse 78:34": "En een gevulde beker",
            "verse 78:35": "Zij horen daar geen ijdele gesprekken noch leugens",
            "verse 78:36": "Een beloning van uw Heer, een toereikende gave",
            "verse 78:37": "Van de Heer der hemelen en der aarde en van alles wat daar tussen is, de Barmhartige. Niemand zal Hem kunnen aanspreken",
            "verse 78:38": "De Dag waarop de Geest en de (andere) engelen in gelederen opgesteld staan, zullen zij niet spreken, met uitzondering van hem aan wie de Barmhartige het toestaat en die alleen zal spreken wat recht is",
            "verse 78:39": "Die Dag is de werkelijkheid. Daarom, laat hij die het wil een toevlucht bij zijn Heer zoeken",
            "verse 78:40": "Voorwaar, Wij hebben u voor een straf die nabij is gewaarschuwd; de Dag waarop de mens zal zien wat hij heeft uitgevoerd en (waarop) de ongelovige zal zeggen: O, ware ik maar stof geweest"
        },
        "Dutch": {
            "verse 78:1": "Waarover stellen zij elkaar vragen?",
            "verse 78:2": "Over de geweldige aankondiging.",
            "verse 78:3": "Waarover zij redetwisten.",
            "verse 78:4": "Nee! Zij zullen het weten.",
            "verse 78:5": "Nogmaals nee, zij zullen het weten.",
            "verse 78:6": "Hebben Wij de aarde niet tot een uitgespreide plaats gemaakt?",
            "verse 78:7": "En de bergen als pinnen?",
            "verse 78:8": "En Wij hebben jullie in paren geschapen.",
            "verse 78:9": "En Wij hebben voor jullie de slaap gemaakt, als rust.",
            "verse 78:10": "En Wij hebben de nacht als een bedekking gemaakt.",
            "verse 78:11": "En Wij hebben de dag gemaakt om levensonderhoud te zoeken.",
            "verse 78:12": "En Wij hebben boven jullie zeven hechte hemelen gebouwd.",
            "verse 78:13": "En Wij hebben daarin een stralende lamp geplaatst.",
            "verse 78:14": "En Wij hebben uit de wolken stromend water gezonden.",
            "verse 78:15": "Opdat Wij daarmee graan en planten voortbrengen.",
            "verse 78:16": "En dichtbegroeide tuinen.",
            "verse 78:17": "Voorwaar, de Dag van de Beoordeling is op een vastgesteld tijdstip.",
            "verse 78:18": "De Dag waarop op de bazuin wordt geblazen zullen jullie komen, groep na groep.",
            "verse 78:19": "En de hemel wordt geopend en zij heeft vele poorten.",
            "verse 78:20": "En de bergen worden verpulverd en worden tot luchtspiegelingen.",
            "verse 78:21": "Voorwaar, de Hel is als een hinderlaag.",
            "verse 78:22": "Een bestemmingsoord voor de overtreders.",
            "verse 78:23": "Zij verblijven eeuwig daarin.",
            "verse 78:24": "Zij zullen daarin geen koelte en geen drank proeven.",
            "verse 78:25": "Behalve kokend water en etter.",
            "verse 78:26": "Als passende vergelding.",
            "verse 78:27": "Voorwaar, zij verwachtten nooit een afrekening.",
            "verse 78:28": "En loochenden Onze Verzen geheel.",
            "verse 78:29": "En Wij hebben alle zaken in een Boek opgesomd.",
            "verse 78:30": "Proeft daarom de straf, en er is voor jullie geen vermeerdering, behalve van de bestraffing.",
            "verse 78:31": "Voorwaar, voor de Moettaqôen is er een overwinning.",
            "verse 78:32": "Tuinen en druivenstruiken.",
            "verse 78:33": "En jeugdige gezellinnen, gelijk in leeftijd.",
            "verse 78:34": "En een gevulde beker.",
            "verse 78:35": "Zij horen daar geen onzin en geen leugens.",
            "verse 78:36": "Als een beloning van jouw Heer, als afrekenende gift.",
            "verse 78:37": "De Heer der hemelen en der aarde en wat er tussen beide is, de Barmhartige. Zij zijn niet in staat Hem aan te spreken.",
            "verse 78:38": "Op die Dag staan de Geest (Djibrîl) en de Engelen in rijen opgesteld. Zij spreken niet, behalve na wie de Barmhartige toestemming verleent en die zegt wat juist is.",
            "verse 78:39": "Dat is de Dag van de Waarheid. Laat wie wil daarom een terugkeer naar zijn Heer afleggen.",
            "verse 78:40": "Voorwaar, Wij hebben jullie gewaarschuwd voor een nabije bestraffing op de Dag dat de mens zal kijken naar wat zijn handen vroeger bedreven, en waarop de ongelovige zal zeggen: \"O wee, was ik maar aarde.\""
        },
        "English": {
            "verse 78:1": "About what are they asking one another?",
            "verse 78:2": "About the great news -",
            "verse 78:3": "That over which they are in disagreement.",
            "verse 78:4": "No! They are going to know.",
            "verse 78:5": "Then, no! They are going to know.",
            "verse 78:6": "Have We not made the earth a resting place? (Have we not smoothed the Earth's surface?)",
            "verse 78:7": "And the mountains as stakes?",
            "verse 78:8": "And We created you in pairs",
            "verse 78:9": "And made your sleep [a means for] rest",
            "verse 78:10": "And made the night as clothing",
            "verse 78:11": "And made the day for livelihood",
            "verse 78:12": "And constructed above you seven strong [heavens]",
            "verse 78:13": "And made [therein] a burning lamp",
            "verse 78:14": "And sent down, from the rain clouds, pouring water",
            "verse 78:15": "That We may bring forth thereby grain and vegetation",
            "verse 78:16": "And gardens of entwined growth.",
            "verse 78:17": "Indeed, the Day of Judgement is an appointed time -",
            "verse 78:18": "The Day the Horn is blown and you will come forth in multitudes",
            "verse 78:19": "And the heaven is opened and will become gateways",
            "verse 78:20": "And the mountains are removed and will be [but] a mirage.",
            "verse 78:21": "Indeed, Hell has been lying in wait",
            "verse 78:22": "For the transgressors, a place of return,",
            "verse 78:23": "In which they will remain for ages [unending].",
            "verse 78:24": "They will not taste therein [any] coolness or drink",
            "verse 78:25": "Except scalding water and [foul] purulence -",
            "verse 78:26": "An appropriate recompense.",
            "verse 78:27": "Indeed, they were not expecting an account",
            "verse 78:28": "And denied Our verses with [emphatic] denial.",
            "verse 78:29": "But all things We have enumerated in writing.",
            "verse 78:30": "\"So taste [the penalty], and never will We increase you except in torment.\"",
            "verse 78:31": "Indeed, for the righteous is attainment -",
            "verse 78:32": "Gardens and grapevines",
            "verse 78:33": "And full-breasted [companions] of equal age",
            "verse 78:34": "And a full cup.",
            "verse 78:35": "No ill speech will they hear therein or any falsehood -",
            "verse 78:36": "[As] reward from your Lord, [a generous] gift [made due by] account,",
            "verse 78:37": "[From] the Lord of the heavens and the earth and whatever is between them, the Most Merciful. They possess not from Him [authority for] speech.",
            "verse 78:38": "The Day that the Spirit and the angels will stand in rows, they will not speak except for one whom the Most Merciful permits, and he will say what is correct.",
            "verse 78:39": "That is the True Day; so he who wills may take to his Lord a [way of] return.",
            "verse 78:40": "Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, \"Oh, I wish that I were dust!\""
        },
        "Filipino": {
            "verse 78:1": "Ano baga ang kanilang pinagtatalunan (sa isa’t isa)",
            "verse 78:2": "Tungkol ba sa Malaking Balita (alalaong baga, ang Islam, Kaisahan ni Allah, ang Qur’an na dinala ni Propeta Muhammad, ang Araw ng Muling Pagkabuhay, atbp)",
            "verse 78:3": "Na dahil dito, sila ay hindi nagkakasundo",
            "verse 78:4": "Katotohanan! 934 Hindi magtatagal at kanilang mapag-aalaman",
            "verse 78:5": "Katotohanan! Katotohanan! Hindi magtatagal at kanilang mapag-aalaman",
            "verse 78:6": "Hindi baga ginawa Namin ang kalupaan na malawak (bilang himlayan)",
            "verse 78:7": "At ang kabundukan bilang pampatatag (na may ugat)",
            "verse 78:8": "At Aming nilikha kayo sa pares (lalaki at babae, mataas at mababa, mabuti at masama, atbp)",
            "verse 78:9": "At Aming ginawaran kayo ng pagtulog (o antok upang maidlip), sa inyong pamamahinga",
            "verse 78:10": "At ginawa Namin ang gabi bilang pantakip (sa pamamagitan ng kanyang kadiliman)",
            "verse 78:11": "At ginawa Namin ang araw (maghapon) tungo sa inyong ikabubuhay",
            "verse 78:12": "At itinatag Namin sa itaas ninyo ang pitong matatatag (na kalangitan)",
            "verse 78:13": "At ginawaran Namin yaon ng Marilag na Liwanag (sikat ng araw)",
            "verse 78:14": "At nagpamalisbis Kami ng saganang ulan mula sa kimpal ng mga ulap",
            "verse 78:15": "Upang mapatubo Namin dito (sa pag-aani) ang mga butil at mga gulayan",
            "verse 78:16": "At mga halamang mayabong at luntian",
            "verse 78:17": "Katotohanan! Ang Araw ng Pagpapasya (sa katarungan) ay natatakdaang panahon",
            "verse 78:18": "Sa Araw na ang Tambuli ay hihipan at kayo ay magsisiparito ng langkay-langkay (at sa maraming pangkat)",
            "verse 78:19": "At ang kalangitan ay bubuksan na waring mga pintuan",
            "verse 78:20": "At ang kabundukan ay maglalaho sa kanilang kinatatayuan na tulad ng isang malikmata",
            "verse 78:21": "Katotohanan! Ang Impiyerno ay matutulad (sa isang pook) ng pagtambang",
            "verse 78:22": "Bilang isang Tahanan sa Taghun (sila na lumalabag at sumusuway sa hangganan na itinakda ni Allah, katulad ng mga mapagsamba sa diyus-diyosan, walang pananalig sa Kaisahan ni Allah at sa Islam, mga mapagkunwari, mga makasalanan, mga kriminal, atbp)",
            "verse 78:23": "Magsisipanatili sila rito sa mahabang panahon",
            "verse 78:24": "dito ay wala silang malalasap na lamig (at ginhawa), ni anumang inumin (na pampasigla)",
            "verse 78:25": "Maliban sa kumukulong tubig at maruming katas ng sugat (nana, dugo, atbp)",
            "verse 78:26": "Na siyang katumbas na kabayaran (ayon sa kanilang kabuktutan)",
            "verse 78:27": "Sapagkat katotohanang sila ay hindi nagbigay pahalaga ( at nangamba) tungo sa (araw) ng pagsusulit (ng kanilang mga gawa)",
            "verse 78:28": "At ganap nilang itinuring na walang katotohanan ang Aming Ayat (kapahayagan, tanda, katibayan, aral, atbp)",
            "verse 78:29": "At ang lahat ng bagay ay Aming itinala sa napapangalagaang Aklat",
            "verse 78:30": "Kaya’t lasapin ninyo ang bunga (na inani) ng inyong masasamang gawa, at kayo ay hindi Namin bibigyan ng anuman maliban sa Kaparusahan",
            "verse 78:31": "Katotohanan! Sa Muttaqun (mga matutuwid at mabubuting tao na sumusunod sa lahat ng ipinag-uutos ni Allah at umiiwas sa lahat ng Kanyang ipinagbabawal) ay tagumpay, at katuparan ng kanilang inaasam (Paraiso)",
            "verse 78:32": "Na napapalibutan ng Halamanan at malinamnam na ubasan",
            "verse 78:33": "At mga birheng dalaga na magkakatulad sa gulang",
            "verse 78:34": "At ng tigib na Kopita (ng alak)",
            "verse 78:35": "dito ay wala silang maririnig na hinagpis o kasinungalingan (sa pag- uusap)",
            "verse 78:36": "Isang kabayaran mula sa inyong Panginoon, isang Biyayang sagana",
            "verse 78:37": "Mula sa Panginoon ng kalangitan at kalupaan at anumang nasa pagitan nito, ang diyos na Lubos na Mapagbigay ng biyaya, at walang sinuman (ang may kapamahalaan) na makakasalansang sa Kanya (sa Araw ng Muling Pagkabuhay), malibang Kanyang pahintulutan",
            "verse 78:38": "SaAraw na ang ruh (si Gabriel o ibangAnghel) at iba pang anghel ay nakatindig (nang tuwid at maayos) sa mga hanay, at hindi makakapangusap malibang pahintulutan siya ng Lubos na Mapagbigay (Allah), at kanyang ipagsasaysay kung ano ang matuwid",
            "verse 78:39": "Ito ang Araw ng Katotohanan na walang alinlangan, kaya’t sinuman ang magnais, hayaang tahakin niya ang Pagbabalik, sa tuwid na landas ng kanyang Panginoon (sa pamamagitan ng pagsunod sa Kanya sa buhay sa mundong ito)",
            "verse 78:40": "Katotohanang Aming pinaaalalahanan kayo ng daratal na Kaparusahan. Sa Araw na ang tao ay makakapagmalas (sa gawa) ng kanyang kamay kung saan siya inihantong. Ang mga hindi sumasampalataya ay magsasabi: “ Kasawian sa akin! Sana ay naging alabok na lamang ako!”"
        },
        "French": {
            "verse 78:1": "Sur quoi s'interrogent-ils mutuellement?",
            "verse 78:2": "Sur la grande nouvelle,",
            "verse 78:3": "à propos de laquelle ils divergent.",
            "verse 78:4": "Eh bien non! Ils sauront bientôt.",
            "verse 78:5": "Encore une fois, non! Ils sauront bientôt.",
            "verse 78:6": "N'avons-Nous pas fait de la terre une couche?",
            "verse 78:7": "et (placé) les montagnes comme des piquets?",
            "verse 78:8": "Nous vous avons créés en couples,",
            "verse 78:9": "et désigné votre sommeil pour votre repos,",
            "verse 78:10": "et fait de la nuit un vêtement,",
            "verse 78:11": "et assigné le jour pour les affaires de la vie,",
            "verse 78:12": "et construit au-dessus de vous sept (cieux) renforcés,",
            "verse 78:13": "et [y] avons placé une lampe (le soleil) très ardente,",
            "verse 78:14": "et fait descendre des nuées une eau abondante",
            "verse 78:15": "pour faire pousser par elle grains et plantes",
            "verse 78:16": "et jardins luxuriants.",
            "verse 78:17": "Le Jour de la Décision [du Jugement] a son terme fixé.",
            "verse 78:18": "Le jour où l'on soufflera dans la Trompe, vous viendrez par troupes,",
            "verse 78:19": "et le ciel sera ouvert et [présentera] des portes,",
            "verse 78:20": "et les montagnes seront mises en marche et deviendront un mirage.",
            "verse 78:21": "L'Enfer demeure aux aguets,",
            "verse 78:22": "refuge pour les transgresseurs.",
            "verse 78:23": "Ils y demeureront pendant des siècles successifs.",
            "verse 78:24": "Ils n'y goûteront ni fraîcheur ni breuvage,",
            "verse 78:25": "Hormis une eau bouillante et un pus",
            "verse 78:26": "comme rétribution équitable.",
            "verse 78:27": "Car ils ne s'attendaient pas à rendre compte,",
            "verse 78:28": "et traitaient de mensonges, continuellement, Nos versets,",
            "verse 78:29": "alors que Nous avons dénombré toutes choses en écrit.",
            "verse 78:30": "Goûtez-donc. Nous n'augmenterons pour vous que le châtiment!",
            "verse 78:31": "Pour les pieux ce sera une réussite:",
            "verse 78:32": "jardins et vignes,",
            "verse 78:33": "et des (belles) aux seins arrondis, d'une égale jeunesse,",
            "verse 78:34": "et coupes débordantes.",
            "verse 78:35": "Ils n'y entendront ni futilités ni mensonges.",
            "verse 78:36": "A titre de récompense de ton Seigneur et à titre de don abondant",
            "verse 78:37": "du Seigneur des cieux et de la terre et de ce qui existe entre eux, le Tout Miséricordieux; ils n'osent nullement Lui adresser la parole.",
            "verse 78:38": "Le jour où l'Esprit et les Anges se dresseront en rangs, nul ne saura parler, sauf celui à qui le Tout Miséricordieux aura accordé la permission, et qui dira la vérité.",
            "verse 78:39": "Ce jour-là est inéluctable. Que celui qui veut prenne donc refuge auprès de son Seigneur.",
            "verse 78:40": "Nous vous avons avertis d'un châtiment bien proche, le jour où l'homme verra ce que ses deux mains ont préparé; et l'infidèle dira: «Hélas pour moi! Comme j'aurais aimé n'être que poussière»."
        },
        "Fulah": {
            "verse 78:1": "Kol ko ɓee naamnandirta",
            "verse 78:2": "Ko faati e kabaaru mawɗo",
            "verse 78:3": "Mboɓe luuri e mum",
            "verse 78:4": "Alah wonah noon, maɓe nganndu",
            "verse 78:5": "Refti yaama maɓe nganndu",
            "verse 78:6": "Mbela Min mbaɗaani leydi ndaɗɗudi keblaandi",
            "verse 78:7": "E pelleɗe ngona penɗe",
            "verse 78:8": "Min tagi on kuɓe",
            "verse 78:9": "Min mbaɗi ɗoyngol mon fooftere",
            "verse 78:10": "Min mbaɗi jemma o ko sutura",
            "verse 78:11": "Min mbaɗi ñalawma ko yiilaraade nguura",
            "verse 78:12": "Min mahi dow mon jeeɗiɗi cattuɗi",
            "verse 78:13": "Min mbaɗi lampu jalbuɗo kuɓɓam",
            "verse 78:14": "Min tellini ummaade e duule ndiyam njuppajam sanne",
            "verse 78:15": "Ngam Min njaltina heen gabbe e puɗi",
            "verse 78:16": "E gese piilandirɗe",
            "verse 78:17": "Pellet, ko ñalaande Senndindiro ngon, laatinooma ko saatinaa",
            "verse 78:18": "Ñande allaadu ndu wutta ma on ngardu pelle pelle",
            "verse 78:19": "Kammu on udditee mbo laato dame",
            "verse 78:20": "Pelle ɗe yahnaa ɗe ngonta merere",
            "verse 78:21": "Pellet Yiite jahannama wonti tommborde",
            "verse 78:22": "Nge wonanii bewɓe ɓe ruttorde",
            "verse 78:23": "Ma ɓe ñiiɓ toon dummunaaji",
            "verse 78:24": "ɓe meeɗatah toon ɓuuɓol wolla ndiyam ɓuuɓɗam",
            "verse 78:25": "Si wonah patɗam ƴiiƴiiri",
            "verse 78:26": "Njobdi kawrundi e koɓe ngonno ko",
            "verse 78:27": "Pellet ɓe ngoniina ɓe njoortaaki haasboore",
            "verse 78:28": "ɓe pennii aayeeje Amen pennugol",
            "verse 78:29": "Kala huunde min tonngirii nde binndol",
            "verse 78:30": "Meeɗe Min ɓeydantah on si wonah lepte",
            "verse 78:31": "Pellet na woodani hulɓe Alla ɓe foolirde",
            "verse 78:32": "Gese e inabeeje",
            "verse 78:33": "E ƴoolnuɓe giƴiraaɓe",
            "verse 78:34": "E kaas sanngara keewɗo",
            "verse 78:35": "Ɓe nanataa nder toon haala meere, wanaa ko bakkondiŋta",
            "verse 78:36": "Ko njoɓdi ummaade ka Alla e dokke keƴɗe",
            "verse 78:37": "jom kammu e leydi e ko woni hakkunde mum en jurmtooɗo Mbo ɓe ngalah e dow Mum haala",
            "verse 78:38": "Ñande jibriil ummii tawa malayka en na waɗi sappeeli ɓe haalatah si wonah mbo Alla sakkitani o haala ko feewi",
            "verse 78:39": "Ko oon woni ñalngu goongo kala faalaaɗo daɗde nanngira joomiiko ruttorde",
            "verse 78:40": "Min njeertinii on lepte ɓadiiɗe ñande aade ndaari ko juuɗe mum mbaɗno keefeero o wiya haaniina mi woniina leydi"
        },
        "German": {
            "verse 78:1": "Wonach fragen sie sich?",
            "verse 78:2": "Nach der gewaltigen Kunde,",
            "verse 78:3": "über die sie sich uneinig sind.",
            "verse 78:4": "Keineswegs! Sie werden (es noch) erfahren.",
            "verse 78:5": "Abermals: Keineswegs! Sie werden (es noch) erfahren.",
            "verse 78:6": "Haben Wir nicht die Erde zu einer Lagerstatt gemacht",
            "verse 78:7": "und die Berge zu Pfählen?",
            "verse 78:8": "Und Wir haben euch als Paare erschaffen.",
            "verse 78:9": "Und Wir haben euren Schlaf zum Ausruhen gemacht.",
            "verse 78:10": "Und Wir haben die Nacht zum Kleid gemacht.",
            "verse 78:11": "Und Wir haben den Tag zur Lebensführung gemacht.",
            "verse 78:12": "Und Wir haben über euch sieben feste (Himmel) aufgebaut.",
            "verse 78:13": "Und Wir haben einen hell glühenden Leuchtkörper gemacht.",
            "verse 78:14": "Und Wir haben von den Regenwolken sich ergießendes Wasser herabkommen lassen,",
            "verse 78:15": "um damit Korn und Gewächse hervorzubringen",
            "verse 78:16": "und dichtbestandene Gärten.",
            "verse 78:17": "Gewiß, der Tag der Entscheidung ist eine festgesetzte Zeit,",
            "verse 78:18": "der Tag, da ins Horn geblasen wird und ihr in Scharen herkommt",
            "verse 78:19": "und da der Himmel geöffnet und dann zu Toren wird",
            "verse 78:20": "und da die Berge versetzt und dann zu einer Luftspiegelung werden.",
            "verse 78:21": "Gewiß, die Hölle ist ein Hinterhalt,",
            "verse 78:22": "für diejenigen, die das Maß (an Frevel) überschreiten, eine Heimstatt,",
            "verse 78:23": "lange Zeiten darin zu verweilen;",
            "verse 78:24": "sie werden darin weder Kühlung noch Getränk kosten,",
            "verse 78:25": "außer heißem Wasser und stinkender Brühe,",
            "verse 78:26": "als angemessene Vergeltung.",
            "verse 78:27": "Sie erwarteten ja niemals eine Abrechnung",
            "verse 78:28": "und erklärten Unsere Zeichen hartnäckig für Lüge.",
            "verse 78:29": "Doch alles haben Wir schriftlich erfaßt.",
            "verse 78:30": "So kostet; Wir werden euch nur die Strafe mehren.",
            "verse 78:31": "Gewiß, für die Gottesfürchtigen wird es einen Ort des Erfolgs geben,",
            "verse 78:32": "umfriedete Gärten und Rebstöcke",
            "verse 78:33": "und prächtige, gleichaltrige (weibliche Wesen)",
            "verse 78:34": "und ein (stets) voller Becher.",
            "verse 78:35": "Weder hören sie darin unbedachte Rede noch Lüge.",
            "verse 78:36": "(Dies) als Belohnung von deinem Herrn, als hinreichende Gabe,",
            "verse 78:37": "dem Herrn der Himmel und der Erde und dessen, was dazwischen ist, dem Allerbarmer. Sie verfügen nicht darüber, vor Ihm zu reden,",
            "verse 78:38": "am Tag, da der Geist und die Engel in Reihe stehen. Sie werden nicht sprechen, außer wem der Allerbarmer es erlaubt und wer Richtiges sagt.",
            "verse 78:39": "Das ist der wahrhaftig (eintreffend)e Tag. Wer nun will, nimmt zu seinem Herrn eine Heimkehr.",
            "verse 78:40": "Wir warnen euch ja vor naher Strafe, am Tag, da der Mensch schauen wird, was seine Hände vorausgeschickt haben, und der Ungläubige sagen wird: \"O wäre ich doch Erde!\""
        },
        "Hausa": {
            "verse 78:1": "A kan mẽ suke tambayar jũna?",
            "verse 78:2": "A kan muhimmin lãbãri mai girma (Alƙur'ãni)?",
            "verse 78:3": "Wanda suke sãɓa wa jũna a cikinsa?",
            "verse 78:4": "A'aha! Zã su sani.",
            "verse 78:5": "Kuma, a'aha! Zã su sani.",
            "verse 78:6": "Ashe, ba Mu sanya ƙasa shimfiɗa ba?",
            "verse 78:7": "Da duwãtsu turaku (ga riƙe ƙasa)?",
            "verse 78:8": "Kuma, Mun halitta ku mazã da mãtã?",
            "verse 78:9": "Kuma, Muka sanya barcinku hũtãwa?",
            "verse 78:10": "Kuma, Muka sanya dare (ya zama) sutura?",
            "verse 78:11": "Kuma, Muka sanya yini (yazama) lõkacin nẽman abinci?",
            "verse 78:12": "Kuma, Muka gina, a samanku, sammai bakwai mãsu ƙarfi?",
            "verse 78:13": "Kuma, Muka sanya fitila mai tsanin haske (rãnã)?",
            "verse 78:14": "Kuma, Muka saukar daga cikakkun girãgizai, ruwa mai yawan zuba?",
            "verse 78:15": "Dõmin, Mu fitar da ƙwaya da tsiri game da shi?",
            "verse 78:16": "Da itãcen lambuna mãsu lillibniya?",
            "verse 78:17": "Lalle ne, rãnar rarrabẽwa tã kasance abin ƙayyadẽ wa lõkaci.",
            "verse 78:18": "Rãnar da zã a yi bũsa a cikin ƙaho, sai ku zo, jama'a jama'a.",
            "verse 78:19": "Kuma, aka buɗe sama, sai ta kasance ƙõfõfi.",
            "verse 78:20": "Kuma, aka tafiyar da duwãtsu, sai suka kasance ƙũra.",
            "verse 78:21": "Lalle ne, Jahannama tã kasance madãkata.",
            "verse 78:22": "Ga mãsu ƙẽtare iyãkõki, tã zama makõma.",
            "verse 78:23": "Sunã, mãsu zama a cikinta, zãmunna.",
            "verse 78:24": "Bã su ɗanɗanãwar wani sanyi a cikinta, kuma bã su ɗanɗana abin sha.",
            "verse 78:25": "Fãce tafasasshen ruwa da ruɓaɓɓen jini.",
            "verse 78:26": "Sakamako mai dãcẽwa.",
            "verse 78:27": "Lalle ne, sũ, sun kasance bã su fãtar sauƙin wani hisãbi.",
            "verse 78:28": "Kuma, suka ƙaryata game da ãyõyinMu, ƙaryatãwa!",
            "verse 78:29": "Alhãli, kõwane abu Mun ƙididdigẽ shi, a rubũce.",
            "verse 78:30": "Sabõda haka, ku ɗanɗana domin haka, bã zã Mu ƙara muku kõme ba fãce azãba.",
            "verse 78:31": "Lalle ne, mãsu taƙawã nã da wani wurin sãmun babban rabo.",
            "verse 78:32": "Lambuna da inabõbi.",
            "verse 78:33": "Da cikakkun 'yammata, tsãrar jũna.",
            "verse 78:34": "Da hinjãlan giya cikakku.",
            "verse 78:35": "Bã su jin yãsassar magana, a cikinta, kuma bã su jin ƙaryatãwa.",
            "verse 78:36": "Dõmin sakamako daga Ubangijinka, kyautã mai yawa.",
            "verse 78:37": "Ubangijin sammai da ƙasa da abin da yake a tsakãninsu, Mai rahama, bã su da ikon yin wata magana daga gare Shi.",
            "verse 78:38": "Rãnar da Rũhi da malã'iku zã su tsaya a cikin safu, bã su magana, sai wanda Allah Ya yi masa izni, kuma ya faɗi abin da ke daidai.",
            "verse 78:39": "Wancan, shi ne yini na gaskiya; to wanda ya so, ya riƙa makõma zuwa ga Ubangijinsa.",
            "verse 78:40": "Lalle ne, Mũ, Mun yi muku gargaɗin azãba makusanciya, rãnar da mutum ke dũbi zuwa ga abin da hannãyensa suka aikata, kuma kafiri ya ce: \"Kaitona, dã dai nã zama turɓãya!\""
        },
        "Hindi": {
            "verse 78:1": "ये लोग आपस में किस चीज़ का हाल पूछते हैं",
            "verse 78:2": "एक बड़ी ख़बर का हाल",
            "verse 78:3": "जिसमें लोग एख्तेलाफ कर रहे हैं",
            "verse 78:4": "देखो उन्हें अनक़रीब ही मालूम हो जाएगा",
            "verse 78:5": "फिर इन्हें अनक़रीब ही ज़रूर मालूम हो जाएगा",
            "verse 78:6": "क्या हमने ज़मीन को बिछौना",
            "verse 78:7": "और पहाड़ों को (ज़मीन) की मेख़े नहीं बनाया",
            "verse 78:8": "और हमने तुम लोगों को जोड़ा जोड़ा पैदा किया",
            "verse 78:9": "और तुम्हारी नींद को आराम (का बाइस) क़रार दिया",
            "verse 78:10": "और रात को परदा बनाया",
            "verse 78:11": "और हम ही ने दिन को (कसब) मआश (का वक्त) बनाया",
            "verse 78:12": "और तुम्हारे ऊपर सात मज़बूत (आसमान) बनाए",
            "verse 78:13": "और हम ही ने (सूरज) को रौशन चिराग़ बनाया",
            "verse 78:14": "और हम ही ने बादलों से मूसलाधार पानी बरसाया",
            "verse 78:15": "ताकि उसके ज़रिए से दाने और सबज़ी",
            "verse 78:16": "और घने घने बाग़ पैदा करें",
            "verse 78:17": "बेशक फैसले का दिन मुक़र्रर है",
            "verse 78:18": "जिस दिन सूर फूँका जाएगा और तुम लोग गिरोह गिरोह हाज़िर होगे",
            "verse 78:19": "और आसमान खोल दिए जाएँगे",
            "verse 78:20": "तो (उसमें) दरवाज़े हो जाएँगे और पहाड़ (अपनी जगह से) चलाए जाएँगे तो रेत होकर रह जाएँगे",
            "verse 78:21": "बेशक जहन्नुम घात में है",
            "verse 78:22": "सरकशों का (वही) ठिकाना है",
            "verse 78:23": "उसमें मुद्दतों पड़े झींकते रहेंगें",
            "verse 78:24": "न वहाँ ठन्डक का मज़ा चखेंगे और न खौलते हुए पानी",
            "verse 78:25": "और बहती हुई पीप के सिवा कुछ पीने को मिलेगा",
            "verse 78:26": "(ये उनकी कारस्तानियों का) पूरा पूरा बदला है",
            "verse 78:27": "बेशक ये लोग आख़ेरत के हिसाब की उम्मीद ही न रखते थे",
            "verse 78:28": "और इन लोगो हमारी आयतों को बुरी तरह झुठलाया",
            "verse 78:29": "और हमने हर चीज़ को लिख कर मनज़बत कर रखा है",
            "verse 78:30": "तो अब तुम मज़ा चखो हमतो तुम पर अज़ाब ही बढ़ाते जाएँगे",
            "verse 78:31": "बेशक परहेज़गारों के लिए बड़ी कामयाबी है",
            "verse 78:32": "(यानि बेहश्त के) बाग़ और अंगूर",
            "verse 78:33": "और वह औरतें जिनकी उठती हुई जवानियाँ",
            "verse 78:34": "और बाहम हमजोलियाँ हैं और शराब के लबरेज़ साग़र",
            "verse 78:35": "और शराब के लबरेज़ साग़र वहाँ न बेहूदा बात सुनेंगे और न झूठ",
            "verse 78:36": "(ये) तुम्हारे परवरदिगार की तरफ से काफ़ी इनाम और सिला है",
            "verse 78:37": "जो सारे आसमान और ज़मीन और जो इन दोनों के बीच में है सबका मालिक है बड़ा मेहरबान लोगों को उससे बात का पूरा न होगा",
            "verse 78:38": "जिस दिन जिबरील और फरिश्ते (उसके सामने) पर बाँध कर खड़े होंगे (उस दिन) उससे कोई बात न कर सकेगा मगर जिसे ख़ुदा इजाज़त दे और वह ठिकाने की बात कहे",
            "verse 78:39": "वह दिन बरहक़ है तो जो शख़्श चाहे अपने परवरदिगार की बारगाह में (अपना) ठिकाना बनाए",
            "verse 78:40": "हमने तुम लोगों को अनक़रीब आने वाले अज़ाब से डरा दिया जिस दिन आदमी अपने हाथों पहले से भेजे हुए (आमाल) को देखेगा और काफ़िर कहेगा काश मैं ख़ाक हो जाता"
        },
        "Indonesian": {
            "verse 78:1": "Tentang apakah mereka saling bertanya-tanya?",
            "verse 78:2": "Tentang berita yang besar,",
            "verse 78:3": "yang mereka perselisihkan tentang ini.",
            "verse 78:4": "Sekali-kali tidak; kelak mereka akan mengetahui,",
            "verse 78:5": "kemudian sekali-kali tidak; kelak mereka mengetahui.",
            "verse 78:6": "Bukankah Kami telah menjadikan bumi itu sebagai hamparan?,",
            "verse 78:7": "dan gunung-gunung sebagai pasak?,",
            "verse 78:8": "dan Kami jadikan kamu berpasang-pasangan,",
            "verse 78:9": "dan Kami jadikan tidurmu untuk istirahat,",
            "verse 78:10": "dan Kami jadikan malam sebagai pakaian,",
            "verse 78:11": "dan Kami jadikan siang untuk mencari penghidupan,",
            "verse 78:12": "dan Kami bina di atas kamu tujuh buah (langit) yang kokoh,",
            "verse 78:13": "dan Kami jadikan pelita yang amat terang (matahari),",
            "verse 78:14": "dan Kami turunkan dari awan air yang banyak tercurah,",
            "verse 78:15": "supaya Kami tumbuhkan dengan air itu biji-bijian dan tumbuh-tumbuhan,",
            "verse 78:16": "dan kebun-kebun yang lebat?",
            "verse 78:17": "Sesungguhnya Hari Keputusan adalah suatu waktu yang ditetapkan,",
            "verse 78:18": "yaitu hari (yang pada waktu itu) ditiup sangkakala lalu kamu datang berkelompok-kelompok,",
            "verse 78:19": "dan dibukalah langit, maka terdapatlah beberapa pintu,",
            "verse 78:20": "dan dijalankanlah gunung-gunung maka menjadi fatamorganalah ia.",
            "verse 78:21": "Sesungguhnya neraka Jahannam itu (padanya) ada tempat pengintai,",
            "verse 78:22": "lagi menjadi tempat kembali bagi orang-orang yang melampaui batas,",
            "verse 78:23": "mereka tinggal di dalamnya berabad-abad lamanya,",
            "verse 78:24": "mereka tidak merasakan kesejukan di dalamnya dan tidak (pula mendapat) minuman,",
            "verse 78:25": "selain air yang mendidih dan nanah,",
            "verse 78:26": "sebagai pambalasan yang setimpal.",
            "verse 78:27": "Sesungguhnya mereka tidak berharap (takut) kepada hisab,",
            "verse 78:28": "dan mereka mendustakan ayat-ayat Kami dengan sesungguh-sungguhnya.",
            "verse 78:29": "Dan segala sesuatu telah Kami catat dalam suatu kitab.",
            "verse 78:30": "Karena itu rasakanlah. Dan Kami sekali-kali tidak akan menambah kepada kamu selain daripada azab.",
            "verse 78:31": "Sesungguhnya orang-orang yang bertakwa mendapat kemenangan,",
            "verse 78:32": "(yaitu) kebun-kebun dan buah anggur,",
            "verse 78:33": "dan gadis-gadis remaja yang sebaya,",
            "verse 78:34": "dan gelas-gelas yang penuh (berisi minuman).",
            "verse 78:35": "Di dalamnya mereka tidak mendengar perkataan yang sia-sia dan tidak (pula) perkataan dusta.",
            "verse 78:36": "Sebagai pembalasan dari Tuhanmu dan pemberian yang cukup banyak,",
            "verse 78:37": "Tuhan Yang memelihara langit dan bumi dan apa yang ada di antara keduanya; Yang Maha Pemurah. Mereka tidak dapat berbicara dengan Dia.",
            "verse 78:38": "Pada hari, ketika ruh dan para malaikat berdiri bershaf-shaf, mereka tidak berkata-kata, kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pemurah; dan ia mengucapkan kata yang benar.",
            "verse 78:39": "Itulah hari yang pasti terjadi. Maka barangsiapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Tuhannya.",
            "verse 78:40": "Sesungguhnya Kami telah memperingatkan kepadamu (hai orang kafir) siksa yang dekat, pada hari manusia melihat apa yang telah diperbuat oleh kedua tangannya; dan orang kafir berkata: \"Alangkah baiknya sekiranya aku dahulu adalah tanah\"."
        },
        "Italian": {
            "verse 78:1": "Su cosa si interrogano a vicenda?",
            "verse 78:2": "Sul grande Annuncio,",
            "verse 78:3": "a proposito del quale sono discordi.",
            "verse 78:4": "No, presto verranno e sapranno.",
            "verse 78:5": "Ancora no, presto sapranno.",
            "verse 78:6": "Non facemmo della terra una culla,",
            "verse 78:7": "delle montagne pioli?",
            "verse 78:8": "Vi abbiamo creato in coppie",
            "verse 78:9": "e facciamo del vostro sonno un riposo,",
            "verse 78:10": "della notte un indumento,",
            "verse 78:11": "e del giorno un mezzo per le incombenze della vita.",
            "verse 78:12": "Costruimmo sopra di voi sette solidi [cieli]",
            "verse 78:13": "e vi ponemmo una lampada ardente;",
            "verse 78:14": "facciamo scendere dalle nuvole un'acqua abbondante",
            "verse 78:15": "per suscitare grano e vegetazione",
            "verse 78:16": "e giardini lussureggianti.",
            "verse 78:17": "Invero il Giorno della Decisione è stabilito.",
            "verse 78:18": "Il Giorno in cui verrà soffiato nel Corno, accorrerete a frotte;",
            "verse 78:19": "sarà spalancato il cielo e [sarà tutto] porte,",
            "verse 78:20": "e le montagne saranno messe in marcia, diventando un miraggio.",
            "verse 78:21": "Invero l'Inferno è in agguato,",
            "verse 78:22": "asilo per i ribelli.",
            "verse 78:23": "Vi dimoreranno per [intere] generazioni,",
            "verse 78:24": "senza gustare né freschezza né bevanda,",
            "verse 78:25": "eccetto acqua bollente o liquido infetto.",
            "verse 78:26": "Giusto compenso,",
            "verse 78:27": "[poiché] non si aspettavano il rendiconto;",
            "verse 78:28": "sfrontatamente tacciavano di menzogna i Nostri segni,",
            "verse 78:29": "mentre di ogni cosa abbiamo tenuto conto per iscritto.",
            "verse 78:30": "E allora gustate [il tormento]! A voi non accresceremo null'altro che il castigo.",
            "verse 78:31": "In verità avranno successo i timorati:",
            "verse 78:32": "giardini e vigne,",
            "verse 78:33": "fanciulle dai seni pieni e coetanee,",
            "verse 78:34": "calici traboccanti.",
            "verse 78:35": "Non udranno colà né vanità né menzogna:",
            "verse 78:36": "compenso del tuo Signore, dono adeguato",
            "verse 78:37": "da parte del Signore dei cieli e della terra e di ciò che vi è frammezzo, del Compassionevole, Cui non oseranno rivolgere la parola.",
            "verse 78:38": "Il Giorno in cui lo Spirito e gli angeli si ergeranno in schiere, nessuno oserà parlare, eccetto colui cui il Compassionevole l'avrà permesso e che dirà cose vere.",
            "verse 78:39": "Quel Giorno [verrà] ineluttabilmente. Si rifugi quindi presso il suo Signore chi vuole.",
            "verse 78:40": "In verità vi abbiamo avvertito di un castigo imminente, il Giorno in cui l'uomo vedrà quello che le sue mani avranno preparato e dirà il miscredente: “Ahimè, fossi io polvere!”."
        },
        "Japanese": {
            "verse 78:1": "何事に就いて， かれらは尋ね合うのか。",
            "verse 78:2": "偉大な消息に就いて。",
            "verse 78:3": "それに就いて，かれらは意見が果なる。",
            "verse 78:4": "いや，かれらはやがて知ろう．",
            "verse 78:5": "いや，いや，かれらはやがて知るであろう。",
            "verse 78:6": "われは大地を，広々としなかったか。",
            "verse 78:7": "また山々を，杭としたてはないか。",
            "verse 78:8": "われはあなたがたを両性に創り，",
            "verse 78:9": "また休息のため，あなたがたの睡眠を定め，",
            "verse 78:10": "夜を覆いとし，",
            "verse 78:11": "昼を生計の手段として定めた。",
            "verse 78:12": "またわれは，あなたがたの上に堅固に7層（の天）を打ち建て，",
            "verse 78:13": "輝やかしい灯し火を（その中に）字置き，",
            "verse 78:14": "われは雲から豊かに雨を降らせ，",
            "verse 78:15": "それによって，殻物や野菜を萠え出させ，",
            "verse 78:16": "様々な園を茂らせる。",
            "verse 78:17": "本当に裁きの日は定められていて，",
            "verse 78:18": "その日，ラッパが吹かれるとあなたがたは群をなして出て来る。",
            "verse 78:19": "天は開かれて数々の門となり，",
            "verse 78:20": "山々は移されて蜃気楼のようになる。",
            "verse 78:21": "本当に地獄は，待ち伏せの場であり，",
            "verse 78:22": "背信者の落ち着く所，",
            "verse 78:23": "かれらは何時までもその中に住むであろう。",
            "verse 78:24": "そこで涼しさも味わえず，（どんな）飲物もない，",
            "verse 78:25": "煮えたぎる湯と膿の外には。",
            "verse 78:26": "（かれらのため）相応しい報奨である。",
            "verse 78:27": "本当にかれらは，（その行いに対する）清算を希望しないでいた。",
            "verse 78:28": "またかれらはわが印を嘘であると言って，強く拒否した。",
            "verse 78:29": "われは一切のことを，天の書に留めている。",
            "verse 78:30": "だからあなたがたは（自分の行いの結果を）味わえ。われは懲罰を増加するばかりである。",
            "verse 78:31": "本当に主を畏れる者には，安全な場所（楽園）がある。",
            "verse 78:32": "緑の園や，ブドウ園，",
            "verse 78:33": "胸の脹れた同じ年頃の乙女たち，",
            "verse 78:34": "またなみなみと（溢？）れる杯。",
            "verse 78:35": "そこではつまらぬ話や偽り言を聞かない。",
            "verse 78:36": "これらはあなたの主からの報奨，賜物の決算である。",
            "verse 78:37": "天と地，そしてその間の凡てのものの主，慈悲深き御方（からの賜物であり），誰もかれに語りかけることは出来ない。",
            "verse 78:38": "聖霊と天使たちが，整列して立つ日，慈悲深き御方から御許しを得て正しいことを言う者以外には，誰も口をきくことが出来ない。",
            "verse 78:39": "それは真実の日である。だから誰でも望む者は，主の御許に戻るがいい。",
            "verse 78:40": "本当にわれは，懲罰が近いと，あなたがたに警告した。その日，人は，自分の両方の手が前もって行ったもの（所業）を見るであろう。不信者は，「ああ，情けない，わたしが塵であったならば。」と言うであろう。"
        },
        "Jawa": {
            "verse 78:1": "Padha takon - tinakon perkara apa dheweke (si kafir)",
            "verse 78:2": "Padha takon bab pawarto gedhe",
            "verse 78:3": "Panemune bab pawarta mau beda - beda",
            "verse 78:4": "Besuk wong mau bakal padha weruh nyatane",
            "verse 78:5": "Sayekti wong mau bakal padha weruh nyatane",
            "verse 78:6": "Ingsun apa ora wis gawe bumi dadi panggonan",
            "verse 78:7": "Sarta gunung - gung minangka gegeneng",
            "verse 78:8": "Lan Ingsun gawe awakira jodhon - jodhon",
            "verse 78:9": "Lan Ingsun dadekake anggonira turu kapenak (kanggo ngaso)",
            "verse 78:10": "Lan Ingsun dadekake wengi minangka tutup (pakaian)",
            "verse 78:11": "Lan Ingsun dadekake awan mingonko pangupa jiwa",
            "verse 78:12": "Lan Ingsun dadekake langit pitu luwih dening santosa ing duwurira",
            "verse 78:13": "Lan Ingsun dadekake cahya madangi lan panas hiya iku srengenge",
            "verse 78:14": "Lan Ingsun nurunake banyu udan kang deres saka mendhung",
            "verse 78:15": "Ingsun anggo nulake tethukulan sarta nganakake woh lan wiji",
            "verse 78:16": "Apa dene palemahan kang kebak tetanduran",
            "verse 78:17": "Dina pancasaning prakara iku wayahe maringi ganjaran lan mratapi siksa",
            "verse 78:18": "Dinane malaikat niyup slompret banjur sira padha teka panthan - panthan",
            "verse 78:19": "Langit padha sigar banjur dadi lawang pirang - pirang",
            "verse 78:20": "Sarupane gunung padha mlaku entheng - entheng kaya andhek - andhek hamun - hamun (fatamorgana)",
            "verse 78:21": "Sayekti neraka jahanam wis sumadiya",
            "verse 78:22": "Dadi panggonan tetep tumrap para wong kafir",
            "verse 78:23": "Padha manggon tetahunan tanpa wekasan",
            "verse 78:24": "Ana kono ora bakal weruh rasane adhem utawa omben - omben",
            "verse 78:25": "Kejaba ngombe wedang kang panas banget lan banyu adhem jekut banget",
            "verse 78:26": "Iku patrapan kang wurwat (karo kaluputhe)",
            "verse 78:27": "Amarga padha maido lan ora wedi bakal ditimbang ala-becike",
            "verse 78:28": "Pada maido al-Quran ayatingsun",
            "verse 78:29": "Samu barang lelakone manungsa, Ingsun cacahake ganep tinulis (ana ing kitab)",
            "verse 78:30": "Mulane padha ngrasakna siksa! amarga Ingsun ora amuwuhi apa - apa marang sira kajaba siksa",
            "verse 78:31": "Sayekti para kang jaga dirine (saka ing ala) padha oleh pangginan kabegjan",
            "verse 78:32": "Patamanan lan kebon anggur pirang - pirang",
            "verse 78:33": "Lan widadari pirang - pirang kang padha tedhenge birahi (seyuswa/seumuran)",
            "verse 78:34": "Lan gelas - gelas kang kebak (isi ombenan) / Lan pinggan kang suci",
            "verse 78:35": "Ora tau krungu pangucap ala lan pamaido",
            "verse 78:36": "Ganjaran saka Pangeranira murwat karo pangabektinira",
            "verse 78:37": "Pangeranira iku Pangerane langit lan bumi lan kang ana antarane kang Maha Murah, ora ono kang wenang munjuk ong Allah yen ora dadi parenging kersane",
            "verse 78:38": "Dinane ruh lan para malaekat padha ngadek aba barisan, ora wani munjuk ing Allah kajaba kang diparengake dening Pangeran kang Maha Murah lan kunjuke bener",
            "verse 78:39": "Hiya iku dina kang mesthi bener kelakone, sing sapa gelem ngabekti ing Allah Pangerane",
            "verse 78:40": "Sayekti Ingsun paring pepeling marang sira siksa kang cepak, dinane manungsa deleng panggawening tangan lorone kang dhisik - dhisik, sarta (kang ing kono) para kafir bakal padha ngucap, \"Dhuh!, bok iya aku iki dadiya lemah wae"
        },
        "Kazakh": {
            "verse 78:1": "Олар бір-бірінен не туралы сұрасып жатыр",
            "verse 78:2": "Ұлы хабар туралы",
            "verse 78:3": "өздері ол жөнінде қарама-қайшылықта",
            "verse 78:4": "Жоқ, олай емес! Олар жақында біледі",
            "verse 78:5": "Кейін, тіпті олай емес! Олар әлі-ақ біледі",
            "verse 78:6": "Біз жерді төсеніш етпедік пе",
            "verse 78:7": "ал тауларды қазық",
            "verse 78:8": "Әрі Біз сендерді жұптар етіп жараттық",
            "verse 78:9": "Ал ұйқыларыңды тынығу еттік",
            "verse 78:10": "әрі түнді жамылғы етіп жасадық",
            "verse 78:11": "және күндізді тіршілік уақыты етіп жасадық",
            "verse 78:12": "Әрі үстеріңнен жеті берікті құрдық",
            "verse 78:13": "және лаулаған шырақ жасадық",
            "verse 78:14": "Әрі сығылушылардан бұлттардан мол су түсірдік",
            "verse 78:15": "онымен дән және өсімдікті шығару үшін",
            "verse 78:16": "және ну бақтарды да",
            "verse 78:17": "Ақиқатында, Айыру күні белгіленген бір мерзім",
            "verse 78:18": "Ол күні сүр үрленеді де сендер топ-топ болып келесіңдер",
            "verse 78:19": "Әрі аспан ашылып, қақпаларға айналады",
            "verse 78:20": "ал таулар жүргізіліп, сағымға айналады",
            "verse 78:21": "Ақиқатында, Жаһаннам аңдып, күтіп тұрушы",
            "verse 78:22": "шектен шығушылар үшін қайтар орын",
            "verse 78:23": "Олар онда ғасырлар бойы қалады",
            "verse 78:24": "Ол жерде олар салқындықты да, су сын да татпайды",
            "verse 78:25": "тек қайнап тұрған су мен іріңнен басқа",
            "verse 78:26": "істеріне лайықты қайтарым ретінде",
            "verse 78:27": "Анығында, олар, есепке тартылуды «үміт» етпеген қорықпаған еді",
            "verse 78:28": "әрі аяттарымызды мүлде өтірікке шығарған еді",
            "verse 78:29": "Ал, Біз барлық нәрсені жазып, есептеп қойдық",
            "verse 78:30": "Енді, татыңдар. Сендерге азаптан басқа ешнәрсені арттырмаймыз",
            "verse 78:31": "Күмәнсіз, тақуалар Аллаһтың жазасынан қорқып, сақтанушылар үшін игілік мекені",
            "verse 78:32": "бақтар мен жүзімдіктер",
            "verse 78:33": "әрі құрбылас, толық омыраулы қыздар",
            "verse 78:34": "және толы кеселер",
            "verse 78:35": "Олар онда Жәннатта бос сөзді де, өтірікті де естімейді",
            "verse 78:36": "Бұл Раббыңнан қайтарым ретінде берілген толық сый",
            "verse 78:37": "аспандардың және жердің әрі олардың арасындағыларының Раббысы ар-Рахманнан. Одан рұқсатсыз тіл қатуға ие болмайды",
            "verse 78:38": "Ол күні Рух Жәбірейіл және періштелер тізіліп тұрады. Ар-Рахманның рұхсат еткенінен басқа ешкім сөйлемейді. Әрі рұқсат берілгенде дұрысты ғана сөйлейді",
            "verse 78:39": "Сол күн ақиқат. Кім қаласа, Раббысына қайтатын жолды ұстанады",
            "verse 78:40": "Ақиқатында, Біз сендерді жақын бір азаптан сақтандырып, ескерттік. Ол күні адам екі қолы алдын-ала дайындағанына қарайды. Сонда кәпір: «Әттең! Топырақ болып кетсем еді», дейді"
        },
        "Korean": {
            "verse 78:1": "그들은 무엇에 관하여 서로에게 묻는 것인가이 말 이후에 그들은 어떤 메세지를 믿으려 하느뇨",
            "verse 78:2": "위대한 소식에 관해서니위대한 소식에 관하여 질문 하느뇨",
            "verse 78:3": "그들은 그에 관해 의견을 달리하고 있노라그것에 관하여 그들은 의견을달리하나",
            "verse 78:4": "그렇지 않노라. 그들은 곧 알게 될 것이라실로 그들은 곧 알게 되리라",
            "verse 78:5": "다시 한번, 그렇지 않노라. 그들은 곧 알게 될 것이라실로 그들은 곧 알게 되리라",
            "verse 78:6": "내가 대지를 침상으로 두지 않았던가하나님이 대지를 두매 넓다 랗게 두셨으며",
            "verse 78:7": "또한 산을 말뚝으로 두지 않았던가산들을 두매 기둥으로 두었고",
            "verse 78:8": "나는 그대들을 남녀로 창조하였으며너희를 창조하매 자웅으로 두 셨으며",
            "verse 78:9": "그대들의 잠을 단절의 시간으로 두었노라수면을 두매 너희 휴식을 위 해 두었고",
            "verse 78:10": "그리고 밤을 옷으로 두었고밤을 두매 의상으로 두었으 며",
            "verse 78:11": "낮을 생계로 두었노라낮을 두매 일용할 양식을 얻도록 두었노라",
            "verse 78:12": "그리고 그대들 위에 일곱 개의 강한 것(하늘)을 지었으며하나님은 너희위에 칠천을 두었으며",
            "verse 78:13": "찬란한 등불(태양)을 두었노라그 안에 찬란한 빛을 두고",
            "verse 78:14": "그리고 빗방울을 짜내는 구름에서 퍼붓는 비를 내렸으니풍부한 비구름을 보내어",
            "verse 78:15": "그것으로써 곡물과 야초를 내고이로 하여 곡식과 채소들을 생산케 하고",
            "verse 78:16": "나무가 우거진 정원도 내노라울창한 정원들이 되도록 하 지 아니 했더뇨",
            "verse 78:17": "실로 분리의 날은 기약되어 있노라실로 분류하는 그날은 정하 여진 것으로",
            "verse 78:18": "그날 나팔이 불리면 그대들은 떼지어 올 것이며나팔이 울리는 그날 너희는 떼를 지어 앞으로 나오게 되며",
            "verse 78:19": "하늘은 열리어 문(門)처럼 되고하늘은 문이 열리는 것처럼 열리고",
            "verse 78:20": "산들은 흘러내리어 신기루처럼 될 것이라산들은 신기루처럼 사라지며",
            "verse 78:21": "실로 지옥은 잠복해 있으니지옥은 기다리고 있으니",
            "verse 78:22": "경계를 넘어선 자들을 위한 귀착지라사악한 자들을 위한 목적지라",
            "verse 78:23": "그곳에서 그들은 영구의 시간을 머물 것이며그들은 그곳에서 영주하니라",
            "verse 78:24": "그들은 그곳에서 시원함도, 음료도 맛보지 못할 것이니그들은 그곳에서 시원함도 맛보지 못할 것이며 마실 음료수 도 없으며",
            "verse 78:25": "오직 부글거리는 물과 고름 뿐이라오직 끓어 오르는 액체와 검 고 어두운 혹독한 액체 뿐으로",
            "verse 78:26": "이는 상응하는 징벌로서이것이 그들을 위한 적절한 보상이라",
            "verse 78:27": "실로 그들은 심판을 개의치 않았으며그들은 그들의 행위에 대한 어떤 계산도 두려워 하지 아니하 고",
            "verse 78:28": "나의 징표를 고집스레 부인하였노라하나님의 말씀을 거짓이라 부정하였으매",
            "verse 78:29": "모든 것을 나는 기록부에 기재하였노라하나님은 모든 것을 기륵보관 하시니라",
            "verse 78:30": "그러니 너희는 맛보라, 내가 너희에게 증가시킬 것은 오직 벌 뿐이라그러므로 너희 행위의 결과 들을 맛보라 응벌 외에는 너희에 게 더하여주지 아니 하리라",
            "verse 78:31": "실로 (하나님을) 경외하는 자들에게는 성공의 장소가 주어질 것이니그러나 의로운 자들은 승리 한 것이 있나니",
            "verse 78:32": "뜰과 포도나무천국과 포도들이 있고",
            "verse 78:33": "봉긋한 가슴의 동갑내기 여성나이가 같은 청순한 배우자 가 있으며",
            "verse 78:34": "가득 찬 술잔이 주어질 것이며넘치는 잔이 있도다",
            "verse 78:35": "그들은 그곳에서 실없는 말도, 거짓말도 듣지 않을 것이라그들은 그곳에서 어떤 무익 한 대화나 거짓된 말도 듣지 아니 하며",
            "verse 78:36": "그대 주님으로부터의 보상으로서 베풂이자 계산의 결과로서주님의 계산에 따라 보상을 받노라",
            "verse 78:37": "하늘과 대지 그리고 그 사이에 존재하는 것의 주님, 가장 자비로우신 분에게서 온 것이라. 그들은 그분께 관하여 어떠한 발언권도 갖지 못할 것이라하늘과 대지와 그 사이에 있 는 만물의 주님이신 가장 자비로 운 하나님께 어느 누구도 그분의 능력에 견주지 못하리라",
            "verse 78:38": "영혼(가브리엘 천사)과 천사들이 대열을 지어 서는 그날 그들은 말을 하지 못할 것이나, 가장 자비로우신 분께서 허락하신 자는 예외로 그는 진실을 말할 것이라영혼과 천사들이 앞으로 줄 지어 서는 그날 자비로우신 하나님의 허락을 얻어 사실을 말할 자 외에는 어느 누구도 말할 수 없나니",
            "verse 78:39": "이것이야말로 진리의 날이라. 그러니 원하는 자는 그의 주님께로 귀착지를 두라그날이 진리의 날이 될 것이라 그러므로 원하는 자는 그로 하여금 주님께 귀의토록 하리라",
            "verse 78:40": "실로 나는 그대들에게 가까운 벌을 경고하였노라. 그날 인간은 자신의 두 손이 내놓은 것을 볼 것이며 불신자는 “내가 흙이었다면 좋았을 것을!” 이라고 말하게 될 것이라실로 하나님께서 너희에게 다가올 응벌에 관하여 경고했나니인간은 그가 행한 그 행위들을 지켜볼 그날 불신자들은 저에게 재 앙이 있나니 차라리 xC3D으로 돌아 갔으면 하고 말하리라"
        },
        "Kurdish": {
            "verse 78:1": "Ewa (filan) çi tiştî ji hev dipirsin(ئه‌ی خه‌ڵکه‌) ده‌رباره‌ی چی له یه‌کتر ده‌پرسن؟",
            "verse 78:2": "(Qey) ewan ji wê Peyva (Qarsîya) mezin ji hev (dipirsin)ده‌رباره‌ی هه‌واڵه گه‌وره و گرنگه‌که‌!! (که ڕۆژی قیامه‌ته‌).",
            "verse 78:3": "Ewa (Qarsî ya) ku ewan (di hebûna) wê da ne wek hevbûneله حاڵێکدا له ئه‌وانه ڕاو بۆچوونیان جیاوازه ده‌رباره‌ی.",
            "verse 78:4": "Na! Bi rastî (wekî gotina wan nîne,lê ewanê) di nêzîk da bizaninنه‌خێر، وا بۆیان نالوێت، له داهاتوویه‌کی نزیکدا خۆیان ده‌بیننه‌وه و هه‌موو ڕاستیه‌کانیان بۆ ده‌رده‌که‌وێت.",
            "verse 78:5": "Paşê (dîsa wekî gotina wan nîne, lê ewanê) di nêzîk da bizaninبه‌ڵێ! له‌وه‌و دوا، له داهاتوویه‌کی نزیکدا خۆیان ده‌بیننه‌وه و ڕاستیه‌کانیان بۆ ده‌رده‌که‌وێت.",
            "verse 78:6": "Maqey me zemîn (ji bona wan ra) nexistîye hêlan(پێش باسی قیامه‌ت په‌روه‌ردگار گه‌شتێکیان به ناو دروستکراوه‌کان و دیارده‌کاندا پێده‌کات ده‌پرسێت: ئایا زه‌ویمان وه‌ک لانکه بۆ فه‌راهه‌نگ نه‌هێناون؟",
            "verse 78:7": "(Me) çîya jî (ji bona zemîn ra ne xistîye) sing(ئایا) کێوه‌کانمان وه‌ک مێخ بۆ دانه‌کوتاون؟ (تا زه‌وی بپارێزێت له فشاری بورکان و ماده تواوه‌کانی ناو ناخی، هه‌روه‌رها هه‌تا له‌نگه‌ری ڕابگرێت و چه‌نده‌ها سودی ترتان پێ بگه‌یه‌نێت).",
            "verse 78:8": "Û me hûn bi zotî afirandine(ئایا) نێوه‌مان به جووت دروست نه‌کردووه‌؟",
            "verse 78:9": "Me xewa we jî (ji bona ew ra) xistîye rawestandinخه‌وتنمان بۆ نه‌کردوون به‌هۆی سره‌وتن؟",
            "verse 78:10": "Û me şev jî (bi tarîtî ya wê va ji bona we ra) xistîye xewkirin(ئایا) شه‌وگارمان بۆ نه‌کردوون به‌داپۆشه‌ر وه‌ک پۆشاک، تاتیایدا بشاردرێنه‌وه‌؟",
            "verse 78:11": "Û me roj jî (ji bona we ra) xistîye (danê) jînê (ji bo ku hûn tê da bixebitin)(ئایا) ڕۆژیشمان بۆ نه‌کردوونه‌ته کاتی به ده‌ستهێنانی ڕزق و ڕۆزی؟",
            "verse 78:12": "Û me di jora we da heft ramaxne bi hêz ava kirîye(ئایا) حه‌وت چین ئاسمانی به هێز و پته‌ومان به ڕا سه‌رتانه‌وه دروست نه‌کردووه‌؟",
            "verse 78:13": "Û me (di wan ramaxana da) çirane çilwulok çêkirineچرایه‌کی پرشنگدارمان بۆ فه‌راهه‌م نه‌هێناون؟ (که مه‌به‌ست خۆره‌)",
            "verse 78:14": "Û me ji ewrne givaştok aveke şîroke hinartîye‎ (ئایا) له هه‌وره گوشراوه‌کان بارانێکی زۆرمان نه‌باراندووه‌؟",
            "verse 78:15": "Ji bo ku em bi wê (avê) lub û hêşnayan derxinتا به هۆی ئه‌و بارانه‌وه جۆره‌ها دانه‌وێڵه و ڕووه‌ک بڕوێنین.",
            "verse 78:16": "Û em (bi vê avê) bax û rezne li hevalyaî (derxin)هه‌روه‌ها چه‌نده‌ها باخی چڕو پڕو له‌یه‌ک ئاڵاو به‌دی نه‌هێناوه‌.",
            "verse 78:17": "Bi rastî roja (pûçaî û maf) ji hev radiqete heye! Bûye danê radewa ê(ئینجا دێته سه‌ر باسی هه‌واڵه گرنگ و سامناکه‌که‌): به‌‎ڕاستی ڕۆژی جیاکرنه‌وه‌، کاتێكیدیاری کراوه (بۆ جیاکردنه‌وه‌ی چاکان له خراپان، ئیمانداران له کافران، سته‌مکاران له سته‌ملێکراوان).",
            "verse 78:18": "Hûnê di roja di stûrî da tê puf kirinê, îdî deste deste werinئه‌و ڕۆژه‌ی که فوو ده‌کرێت به (صور) دا، جا پۆل پۆل و ده‌سته ده‌سته به‌ره‌و مه‌یدانی لێپرسینه‌وه بێ په‌روا دێن.",
            "verse 78:19": "(Di wê rojê da) ezman vebûye; îdî derî derî çêbûyeئاسمان ده‌کرێته‌وه و ده‌بێته ده‌روازه و ده‌رگا (بۆ دابه‌زینی فریشته‌کان).",
            "verse 78:20": "Û çîya (ji şûna xwe) hatine ajotinê, îdî bûne leylanکێوه‌کانیش هه‌ڵده‌که‌نرێن و ده‌ڕۆن به ئاسماندا وه‌ک تراویلکه و سه‌رابێکی گه‌وره‌.",
            "verse 78:21": "Bi rastî doj jî bûye dîdevanبێگومان دۆزه‌خیش ده‌مێکه چاوه‌ڕێی ئه‌و ڕۆژه‌یه و خۆی بۆ مه‌ڵاسداوه‌.",
            "verse 78:22": "Ji bona wanê rê derketî bûye êwirده‌بێته مه‌نزڵگای خوانه‌ناس و یاخیه‌کان.",
            "verse 78:23": "Ewanê di wura da pur danan bimîninهه‌زاره‌ها ساڵی دوورو درێژ و نه‌بڕاوه‌ی تێدا ده‌به‌نه‌سه‌ر...",
            "verse 78:24": "Ewan (di dojê da) saritî û ave çeşne nakinله‌ناویدا ناچێژن فێنکاییه‌ک، یا خواردنه‌وه‌یه‌کی به‌تام...",
            "verse 78:25": "Hey hilmojek û kêmê (çeşne dikin)جگه له ئاوی له کوڵ و کێم و زووخاو.",
            "verse 78:26": "Eva celata (ji bona kirinê wan ra) gavîkan bûyeکه ئه‌وه‌ش پاداشتێكی له‌بارو پڕاو پڕه (بۆ خوانه‌ناسان).",
            "verse 78:27": "Loma ewan guman ne dikir, ku wê kirinê wanê bêne hijmartinêچونکه ئه‌وانه کاتی خۆی به‌ته‌مای ئه‌م ڕۆژه و لێپرسینه‌وه‌یه نه‌بوون، حه‌زیان له باسی نه‌ده‌کرد.",
            "verse 78:28": "Û ewan beratene me bivir di dane derewdêrandinêبه‌ڵکو زۆر به‌توندی دژایه‌تی ئایه‌ته‌کانی ئێمه‌یان ده‌رکرد و به درۆیان ده‌زانی..",
            "verse 78:29": "Û hemî tişt me bi nivîsarî hijmartîyeئێمه‌ش هه‌موو شتێکمان له‌سه‌ریان سه‌رژمێری کردووه و به‌وردیی تۆمارمان کردووه‌.",
            "verse 78:30": "Îdî hûn çeşna (kirinê) xwe bikin, îdî em ji bona we ra hey şapatê pur dikin(پاشان پێیان ده‌وترێت) ده بچێژن (ئه‌ی خوانه‌ناسان) له سزاو ئازار و ئه‌شکه‌نجه به‌ولاوه‌، جا هه‌رگیز هیچی ترتان بۆ زیاد ناکه‌ین.",
            "verse 78:31": "Bi rastî ji bona Xuda parizan ra serfirazî heneبه‌ڕاستی بۆ خواناس و پارێزکاران سه‌رفرازی و خۆشێ و شادی و کامه‌رانی فراوان ئاماده‌یه‌.",
            "verse 78:32": "Bostan û rezê tiryan (hene)چه‌نده‌ها باخچه‌ی جوان و جۆری ترێ.",
            "verse 78:33": "Perîne hevsalî, ku memikne wan hêj gulîkdane (hene)(له‌و جێگه و ڕێگه خۆشانه‌دا هاوسه‌ر و هاوده‌می) ئافره‌تانی سینه جوان و (دیمه جوان) هاوته‌مه‌ن ئاماده‌یه‌.",
            "verse 78:34": "Û kasikne tijî mey (hene)له‌گه‌ڵ کاسه‌ی پڕ له شه‌رابی تایبه‌تیدا.",
            "verse 78:35": "Ewan (Xuda parizan) di wura da vir û mijûlîne kêrnehatî nabihênله‌و به‌هه‌شته‌دا هیچ جۆره قسه‌یه‌کی پڕو پووچ و درۆ و ده‌له‌سه‌یه‌ک نابیستن.",
            "verse 78:36": "(Eva) xelata ji Xuda yê te(ji bona wan ra hatîye dayînê) dayîneke wusane nayê hijmartinêئه‌مه‌ش هه‌مووی پاداشتێکه له‌لایه‌ن په‌روه‌ردگارته‌وه (ئه‌ی ئیماندار)، به‌خششێکه به حسابێکی ورد ده‌به‌خشرێت (به به‌خته‌وه‌ران).",
            "verse 78:37": "Xuda yê ezman û zemîn û di nîveka wan herdukan da heyî (Yezdan ê) dilovan e; ewan (heyan)qe ji wî mijûl nabin‎ (له‌لایه‌ن) په‌روه‌ردگاری میهره‌بانی ئاسمانه‌کان و زه‌وی و هه‌رچی له نێوانیاندا هه‌یه‌، (ئه‌و ڕۆژه‌) که‌س ناتوانێت له‌به‌رده‌م زاتی په‌روه‌ردگاردا بدوێت.",
            "verse 78:38": "Di wê rojê da can û fereşte gargî dibin, li bal wî ji pêştirê wîyê ku Yezdan ê dilovanji bona wî ra destûra axiftinê daye û gotinê qencî bêje, qe tu kes nikare bi axiveڕۆژێک دێت جوبڕه‌ئیل و فه‌ریشته‌کان به ڕیز ده‌وه‌ستن و ورته‌یان لێنایه‌ت و هیچ قسه ناکه‌ن، مه‌گه‌ر ئه‌وه‌یان که خوای میهره‌بان مۆڵه‌تی بدات و قسه‌ی جوان و به‌جێ پێشکه‌ش بکات.",
            "verse 78:39": "Roja mafê (ku hatîye peyman danê) evaye. Îdî kîjan bi vê ewa li bal Xuda yê xwe (ji bona xwe ra) êwrekî digireئه‌و ڕۆژه ڕۆژێکی حه‌ق و ڕاسته و به‌ڕێوه‌یه‌.. جا ئه‌وه‌ی ده‌یه‌وێت با به‌ره‌و لای په‌روه‌ردگاری ڕێگه بگرێته به‌ر.",
            "verse 78:40": "Bi rastî me hûn bi şapateke nêzîk dane hişyarkirinê. Di wê rojê da meriv li bal wan tiştne, ku hêj di berê da kirîya mêze dike û file (aha) dibêje: “xwazîka ez xwelî bûma (ne hatima vê derê).“به‌ڕاستی ئێمه ئێوه‌مان ئاگادار کردووه له‌وه‌ی که سزایه‌کی نزیک به‌ڕێوه‌یه‌، ئه‌و ڕۆژه ڕۆژێکه که ئاده‌میزاد سه‌یری ده‌ستپێشخه‌ری خۆی ده‌کات، خوانه‌ناسیش ده‌ڵێت.. خۆزگه هه‌ر خاک بوومایه (ئاوا زیندوو نه‌کرامایه‌ته‌وه و گیرم نه‌خواردایه‌)."
        },
        "Kyrgyz": {
            "verse 78:1": "Алар (бири-биринен) эмне жөнүндө сурашууда",
            "verse 78:2": "Улук Кабар жөнүндө",
            "verse 78:3": "Алар ал (Улук Кабар) жөнүндө талашып-тартышышат эле",
            "verse 78:4": "Жок, андай эмес! Жакында билип алышат",
            "verse 78:5": "Дагы бир ирет андай эмес! Жакында билип алышат",
            "verse 78:6": "Биз силерге жерди жайылган (төшөк сыяктуу) кылып койбодукпу",
            "verse 78:7": "Тоолорду (бекем) казыктар (сыяктуу кылып жаратпадыкпы)",
            "verse 78:8": "Жана Биз силерди жуп-түгөй? кылып жараттык",
            "verse 78:9": "Уйкуңарды (денеңер үчүн) ырыхат кылдык",
            "verse 78:10": "Түндү (силерге) кийим (сыяктуу) кылдык",
            "verse 78:11": "Күндүздү жашоо үчүн жараттык",
            "verse 78:12": "Жана силердин үстүңөргө бекем жети (кабат) асманды куруп",
            "verse 78:13": "ысык-нурлуу чыракты (күндү) жараттык",
            "verse 78:14": "Жана (силерге) булуттардан мол суу түшүрдүк",
            "verse 78:15": "чыгарып берүү үчүн дан азыктарды жана өсүмдүктөрдү",
            "verse 78:16": "Жана да калың бак-бостондорду",
            "verse 78:17": "Албетте (ыймандуу менен каапыр) ажыратыла турган (Кыямат) күн (Аллаһ тарабынан) белгиленген убакыт",
            "verse 78:18": "Ал күнү Сур (чоор) тартылат. Анан силер топ-топ болуп (Раббиңерге сурак бергени) келесиңер",
            "verse 78:19": "(Кыямат күн башталганда) асман ачылып (жарылып) эшиктер (пайда ) болот",
            "verse 78:20": "Жана тоолор (ордунан) учурулуп, закым болуп калат",
            "verse 78:21": "Албетте, тозок күтүп туруучу (жана)",
            "verse 78:22": "чектен чыккан адамдар үчүн кайтып баруучу орун",
            "verse 78:23": "Алар анда кылымдар бою турушат",
            "verse 78:24": "Ал жерде не салкындык не суусундук татышпайт",
            "verse 78:25": "Болгону (тозокулардын денесинен аккан) сасык ириң жана (ичегилерди тилип, үзүп жибере турган даражадагы) кайнак суу (менен гана “азыктанышат”)",
            "verse 78:26": "(Бул— күнөөлөрүнө) ылайык жаза",
            "verse 78:27": "Алар (Акыреттеги) эсеп — китепке ишенишпеген",
            "verse 78:28": "Жана Биздин аяттарыбызды ачык түрдө жалганга чыгарышкан",
            "verse 78:29": "Биз бардык иштерди тизмектеп, китеп кылып жазып койгонбуз",
            "verse 78:30": "Эми, (жазаңарды) таткыла! Биз силерге азапты гана көбөйтөбүз",
            "verse 78:31": "Ал эми, такыбаа кишилерге ийгилик жайы (Бейиш)",
            "verse 78:32": "бак-бостондор, жүзүмдүктөр",
            "verse 78:33": "жаш, бир курактагы, көкүрөгү тикчийген селкилер",
            "verse 78:34": "жана («Рахийк» деп аталган аябай даамдуу шарап менен) мелмилдеп турган кеселер бар",
            "verse 78:35": "Ал жерде пайдасы жок жана күнөө-жалган сөздөрдү угушпайт",
            "verse 78:36": "(Булар) Раббиң тарабынан берилген сыйлык-белектер",
            "verse 78:37": "(Ушул сыйлыкты берген Рабби) асмандар менен жердин, ал экөөнүн арасындагы бардык нерселердин да Раббиси болгон Ырайымдуу Зат. (Ошондуктан, ал күнү эч ким Анын уруксаты болмоюнча) сөз сүйлөөгө батына албайт",
            "verse 78:38": "Рух (Жебрейил периште) жана (башка бардык) периштелер сап-сап болуп турган (ошол) күнү Ырайымдуу Зат уруксат бергендер гана (сүйлөп,) чын сөздү айтышат",
            "verse 78:39": "Бул- чындап болуучу Күн. Ал эми, ким кааласа (жакшы амалдарды кылат жана) Раббисине (ошол амалдар менен) кайтууну(н жолдорун бекем) кармайт",
            "verse 78:40": "Биз силерди жакын(да келе турган) азаптан эскерткен элек. Ал күндө адам баласы эки колу эмне алып келгенин көрөт жана каапыр адам: «кана эми, (ушундай азапка дуушар болгондон көрө) топурак эле болуп калсам!!!» - дейт"
        },
        "Malay": {
            "verse 78:1": "Tentang apakah mereka bertanya-tanya?",
            "verse 78:2": "Tentang berita yang besar, (berita kebangkitan manusia hidup semula menerima balasannya).",
            "verse 78:3": "Yang mereka (ragu-ragu dan) berselisihan mengenainya.",
            "verse 78:4": "Jangan! (Janganlah mereka bersikap demikian!) Mereka akan mengetahui (dengan yakin tentang kebenaran hari balasan itu).",
            "verse 78:5": "Sekali lagi jangan! (Janganlah mereka berselisihan!) Mereka akan mengetahui kelak (tentang apa yang akan menimpa mereka).",
            "verse 78:6": "(Mengapa kamu ragu-ragukan kekuasaan Kami menghidupkan semula orang-orang yang telah mati?) Bukankah Kami telah menjadikan bumi (terbentang luas) sebagai hamparan?",
            "verse 78:7": "Dan gunung-ganang sebagai pancang pasaknya?",
            "verse 78:8": "Dan Kami telah menciptakan kamu berpasang-pasang?",
            "verse 78:9": "Dan Kami telah menjadikan tidur kamu untuk berehat?",
            "verse 78:10": "Dan Kami telah menjadikan malam (dengan gelapnya) sebagai pakaian (yang melindungi)?",
            "verse 78:11": "Dan Kami telah menjadikan siang (dengan cahaya terangnya) - masa untuk mencari rezeki?",
            "verse 78:12": "Dan Kami telah membina di atas kamu tujuh petala (langit) yang kuat kukuh?",
            "verse 78:13": "Dan Kami telah mengadakan matahari menjadi lampu yang terang-benderang cahayanya?",
            "verse 78:14": "Dan Kami telah menurunkan dari awan, air (hujan) yang mencurah-curah, -",
            "verse 78:15": "Untuk Kami mengeluarkan dengan air itu, biji-bijian dan tumbuh-tumbuhan, -",
            "verse 78:16": "Serta kebun-kebun yang subur bertaut-taut pokoknya?",
            "verse 78:17": "Sesungguhnya hari pemutusan hukum itu, adalah satu masa yang ditentukan,",
            "verse 78:18": "Iaitu masa ditiup sangkakala, lalu kamu (bangkit hidup) serta datang berpuak-puak (ke Padang Mahsyar);",
            "verse 78:19": "Dan (pada masa itu) langit dipecah belahkan sehingga tiap-tiap belahannya menjadi ibarat pintu yang terbuka luas,",
            "verse 78:20": "Dan gunung-ganang - setelah dihancurkan - diterbangkan ke angkasa, lalu menjadilah ia bayangan semata-mata seperti riak sinaran panas di padang pasir.",
            "verse 78:21": "Sesungguhnya neraka Jahannam adalah disediakan -",
            "verse 78:22": "Untuk orang-orang yang melampaui batas hukum Tuhan, sebagai tempat kembalinya.",
            "verse 78:23": "Mereka tinggal di dalamnya berkurun-kurun lamanya.",
            "verse 78:24": "Mereka tidak dapat merasai udara yang sejuk di dalamnya, dan tidak pula sebarang minuman -",
            "verse 78:25": "Kecuali air panas yang menggelegak, dan air danur yang mengalir, -",
            "verse 78:26": "Sebagai balasan yang sesuai (dengan amal mereka yang buruk).",
            "verse 78:27": "Kerana sesungguhnya mereka dahulu tidak menaruh ingatan terhadap hari hitungan amal,",
            "verse 78:28": "Dan mereka telah mendustakan dengan sesungguh-sungguhnya akan ayat-ayat keterangan Kami;",
            "verse 78:29": "Dan tiap-tiap sesuatu dari bawaan hidupnya, telah Kami hitung secara bertulis.",
            "verse 78:30": "(Setelah mereka masuk ke dalam neraka, dikatakan kepada mereka: \"Oleh sebab kamu telah mendustakan ayat-ayat Kami) maka rasalah kamu (azab yang disediakan), kerana Kami tidak akan melakukan selain dari menambah berbagai azab kepada kamu\".",
            "verse 78:31": "Sesungguhnya orang-orang yang bertaqwa, disediakan Syurga tempat mereka beroleh apa yang mereka ingini.",
            "verse 78:32": "(Mereka akan beroleh) taman-taman bunga dan kebun-kebun buah-buahan, terutama anggur;",
            "verse 78:33": "Dan perawan-perawan yang sebaya umurnya;",
            "verse 78:34": "Serta piala atau gelas yang penuh dengan minuman;",
            "verse 78:35": "Mereka tidak mendengar di dalam Syurga itu perkataan yang sia-sia, dan tiada pula perkataan yang dusta;",
            "verse 78:36": "Sebagai balasan dari Tuhanmu, iaitu satu limpah kurnia yang dikira cukup (menurut yang dijanjikanNya),",
            "verse 78:37": "Tuhan yang mentadbirkan tujuh petala langit dan bumi serta apa yang ada di antara keduanya, Tuhan Yang Maha Pemurah, tidak ada sesiapapun diberi kuasa berkata-kata denganNya (untuk memohon pertimbangan tentang balasan atau pengurniaan itu);",
            "verse 78:38": "(Tambahan pula) pada masa Jibril dan malaikat-malaikat yang lain berdiri bersaf-saf (menunggu perintah Tuhan), tidak ada yang berani berkata-kata (memohon pertimbangan) melainkan yang telah diizinkan baginya oleh Tuhan Yang Maha Pemurah, serta ia berkata benar.",
            "verse 78:39": "Itulah keterangan-keterangan mengenai hari (kiamat) yang sungguh tetap berlakunya; maka sesiapa yang mahukan kebaikan dirinya, dapatlah ia mengambil jalan dan cara kembali kepada Tuhannya (dengan iman dan amal yang soleh)!",
            "verse 78:40": "Sesungguhnya (dengan keterangan-keterangan yang tersebut), Kami memberi amaran kepada kamu mengenai azab yang dekat (masa datangnya), - iaitu hari seseorang melihat apa yang telah diusahakannya; dan orang yang kafir akan berkata (pada hari itu): \"Alangkah baiknya kalau aku menjadi tanah (supaya aku tidak dibangkitkan untuk dihitung amalku dan menerima balasan)\"."
        },
        "Malayalam": {
            "verse 78:1": "എന്തിനെപ്പറ്റിയാണ് അവര്‍ പരസ്പരം ചോദിച്ചു കൊണ്ടിരിക്കുന്നത്‌?",
            "verse 78:2": "ആ മഹത്തായ വൃത്താന്തത്തെപ്പറ്റി.",
            "verse 78:3": "അവര്‍ ഏതൊരു കാര്യത്തില്‍ അഭിപ്രായവ്യത്യാസത്തിലായി ക്കൊണ്ടിരിക്കുന്നുവോ അതിനെപ്പറ്റി.",
            "verse 78:4": "നിസ്സംശയം; അവര്‍ വഴിയെ അറിഞ്ഞു കൊള്ളും.",
            "verse 78:5": "വീണ്ടും നിസ്സംശയം; അവര്‍ വഴിയെ അറിഞ്ഞു കൊള്ളും.",
            "verse 78:6": "ഭൂമിയെ നാം ഒരു വിരിപ്പാക്കിയില്ലേ?",
            "verse 78:7": "പര്‍വ്വതങ്ങളെ ആണികളാക്കുകയും (ചെയ്തില്ലേ?)",
            "verse 78:8": "നിങ്ങളെ നാം ഇണകളായി സൃഷ്ടിക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 78:9": "നിങ്ങളുടെ ഉറക്കത്തെ നാം വിശ്രമമാക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 78:10": "രാത്രിയെ നാം ഒരു വസ്ത്രമാക്കുകയും,",
            "verse 78:11": "പകലിനെ നാം ജീവസന്ധാരണവേളയാക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 78:12": "നിങ്ങള്‍ക്ക് മീതെ ബലിഷ്ഠമായ ഏഴു ആകാശങ്ങള്‍ നാം നിര്‍മിക്കുകയും",
            "verse 78:13": "കത്തിജ്വലിക്കുന്ന ഒരു വിളക്ക് നാം ഉണ്ടാക്കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 78:14": "കാര്‍മേഘങ്ങളില്‍ നിന്ന് കുത്തി ഒഴുകുന്ന വെള്ളം നാം ഇറക്കുകയും ചെയ്തു.",
            "verse 78:15": "അതു മുഖേന ധാന്യവും സസ്യവും നാം പുറത്തു കൊണ്ടു വരാന്‍ വേണ്ടി.",
            "verse 78:16": "ഇടതൂര്‍ന്ന തോട്ടങ്ങളും",
            "verse 78:17": "തീര്‍ച്ചയായും തീരുമാനത്തിന്‍റെ ദിവസം സമയം നിര്‍ണയിക്കപ്പെട്ടതായിരിക്കുന്നു.",
            "verse 78:18": "അതായത് കാഹളത്തില്‍ ഊതപ്പെടുകയും, നിങ്ങള്‍ കൂട്ടംകൂട്ടമായി വന്നെത്തുകയും ചെയ്യുന്ന ദിവസം.",
            "verse 78:19": "ആകാശം തുറക്കപ്പെടുകയും എന്നിട്ടത് പല കവാടങ്ങളായി തീരുകയും ചെയ്യും.",
            "verse 78:20": "പര്‍വ്വതങ്ങള്‍ സഞ്ചരിപ്പിക്കപ്പെടുകയും അങ്ങനെ അവ മരീചിക പോലെ ആയിത്തീരുകയും ചെയ്യും.",
            "verse 78:21": "തീര്‍ച്ചയായും നരകം കാത്തിരിക്കുന്ന സ്ഥലമാകുന്നു.",
            "verse 78:22": "അതിക്രമകാരികള്‍ക്ക് മടങ്ങിച്ചെല്ലാനുള്ള സ്ഥലം.",
            "verse 78:23": "അവര്‍ അതില്‍ യുഗങ്ങളോളം താമസിക്കുന്നവരായിരിക്കും.",
            "verse 78:24": "കുളിര്‍മയോ കുടിനീരോ അവര്‍ അവിടെ ആസ്വദിക്കുകയില്ല.",
            "verse 78:25": "കൊടുംചൂടുള്ള വെള്ളവും കൊടും തണുപ്പുള്ള വെള്ളവുമല്ലാതെ",
            "verse 78:26": "അനുയോജ്യമായ പ്രതിഫലമത്രെ അത്‌.",
            "verse 78:27": "തീര്‍ച്ചയായും അവര്‍ വിചാരണ പ്രതീക്ഷിക്കുന്നില്ലായിരുന്നു.",
            "verse 78:28": "നമ്മുടെ ദൃഷ്ടാന്തങ്ങളെ അവര്‍ തീര്‍ത്തും നിഷേധിച്ചു തള്ളുകയും ചെയ്തു.",
            "verse 78:29": "ഏതു കാര്യവും നാം എഴുതി തിട്ടപ്പെടുത്തിയിരിക്കുന്നു.",
            "verse 78:30": "അതിനാല്‍ നിങ്ങള്‍ (ശിക്ഷ) ആസ്വദിച്ചു കൊള്ളുക. തീര്‍ച്ചയായും നാം നിങ്ങള്‍ക്കു ശിക്ഷയല്ലാതൊന്നും വര്‍ദ്ധിപ്പിച്ചു തരികയില്ല.",
            "verse 78:31": "തീര്‍ച്ചയായും സൂക്ഷ്മത പാലിച്ചവര്‍ക്ക് വിജയമുണ്ട്‌.",
            "verse 78:32": "അതായത് (സ്വര്‍ഗത്തിലെ) തോട്ടങ്ങളും മുന്തിരികളും,",
            "verse 78:33": "തുടുത്ത മാര്‍വിടമുള്ള സമപ്രായക്കാരായ തരുണികളും.",
            "verse 78:34": "നിറഞ്ഞ പാനപാത്രങ്ങളും.",
            "verse 78:35": "അവിടെ അനാവശ്യമായ ഒരു വാക്കോ ഒരു വ്യാജവാര്‍ത്തയോ അവര്‍ കേള്‍ക്കുകയില്ല.",
            "verse 78:36": "(അത്‌) നിന്‍റെ രക്ഷിതാവിങ്കല്‍ നിന്നുള്ള ഒരു പ്രതിഫലവും, കണക്കൊത്ത ഒരു സമ്മാനവുമാകുന്നു.",
            "verse 78:37": "ആകാശങ്ങളുടെയും ഭൂമിയുടെയും അവക്കിടയിലുള്ളതിന്‍റെയും രക്ഷിതാവും പരമകാരുണികനുമായുള്ളവന്‍റെ (സമ്മാനം.) അവനുമായി സംഭാഷണത്തില്‍ ഏര്‍പെടാന്‍ അവര്‍ക്കു സാധിക്കുകയില്ല.",
            "verse 78:38": "റൂഹും മലക്കുകളും അണിയായി നില്‍ക്കുന്ന ദിവസം. പരമകാരുണികനായ അല്ലാഹു അനുവാദം നല്‍കിയിട്ടുള്ളവനും സത്യം പറഞ്ഞിട്ടുള്ളവനുമല്ലാതെ അന്ന് സംസാരിക്കുകയില്ല.",
            "verse 78:39": "അതത്രെ യഥാര്‍ത്ഥമായ ദിവസം. അതിനാല്‍ വല്ലവനും ഉദ്ദേശിക്കുന്ന പക്ഷം തന്‍റെ രക്ഷിതാവിങ്കലേക്കുള്ള മടക്കത്തിന്‍റെ മാര്‍ഗം അവന്‍ സ്വീകരിക്കട്ടെ.",
            "verse 78:40": "ആസന്നമായ ഒരു ശിക്ഷയെ പറ്റി തീര്‍ച്ചയായും നിങ്ങള്‍ക്കു നാം മുന്നറിയിപ്പ് നല്‍കിയിരിക്കുന്നു. മനുഷ്യന്‍ തന്‍റെ കൈകള്‍ മുന്‍കൂട്ടി ചെയ്തു വെച്ചത് നോക്കിക്കാണുകയും, അയ്യോ ഞാന്‍ മണ്ണായിരുന്നെങ്കില്‍ എത്ര നന്നായിരുന്നേനെ എന്ന് സത്യനിഷേധി പറയുകയും ചെയ്യുന്ന ദിവസം."
        },
        "Norwegian": {
            "verse 78:1": "Hva snakket de med hverandre om?",
            "verse 78:2": "Om det store budskap,",
            "verse 78:3": "som de er uenige om.",
            "verse 78:4": "Nei, sannelig skal de få å vite!",
            "verse 78:5": "Så sannelig skal de få å vite!",
            "verse 78:6": "Har Vi ikke gjort jorden til et leie?",
            "verse 78:7": "Og fjellene til støttepilarer?",
            "verse 78:8": "Vi har skapt dere parvis",
            "verse 78:9": "og gitt dere søvnen til hvile",
            "verse 78:10": "og gjort natten til en kledning",
            "verse 78:11": "og dagen til å skaffe en levemåte.",
            "verse 78:12": "Over dere har Vi bygget syv solide himler",
            "verse 78:13": "og plassert en skinnende lampe,",
            "verse 78:14": "og Vi lot falle regn fra regntunge skyer i strømmer,",
            "verse 78:15": "for derved å frembringe korn og planter",
            "verse 78:16": "og bugnende haver.",
            "verse 78:17": "Dommens dag er fastsatt.",
            "verse 78:18": "Den dag det støtes i basunen, og dere kommer i flokker;",
            "verse 78:19": "når himmelen åpnes og blir dører,",
            "verse 78:20": "og fjellene settes i bevegelse og blir en luftspeiling.",
            "verse 78:21": "Sannelig, helvete ligger på lur,",
            "verse 78:22": "et hjem for de oppsetsige.",
            "verse 78:23": "Der skal de bli gjennom tider,",
            "verse 78:24": "og der smaker de ingen forfriskende kjølighet og intet å drikke,",
            "verse 78:25": "unntatt kokende vann og kloakk,",
            "verse 78:26": "som en passende belønning.",
            "verse 78:27": "De så ikke frem til en avregning,",
            "verse 78:28": "og fornektet trossig Vårt ord.",
            "verse 78:29": "Alt har Vi opptegnet i en regnskapsbok.",
            "verse 78:30": "«Nå kan dere smake! Vi skal bare øke straffen enda mer.»",
            "verse 78:31": "De gudfryktige har i vente seierens sted,",
            "verse 78:32": "haver og vingårder,",
            "verse 78:33": "høybarmede, jevngamle jomfruer,",
            "verse 78:34": "og et fylt beger.",
            "verse 78:35": "Der hører de verken tomt snakk eller løgnprat.",
            "verse 78:36": "Som lønn fra Herren, som gave og som avregning,",
            "verse 78:37": "fra Herren over himmel og jord og alt som mellom dem er, den Barmhjertige, som ingen formår å tale til.",
            "verse 78:38": "Den dag, da Ånden og englene står på rekke og rad, da kan ingen tale, unntatt den som den barmhjertige har tillatt, og som taler rett.",
            "verse 78:39": "Dette er sannhetens dag, og måtte alle som vil, finne hjem til Herren.",
            "verse 78:40": "Vi har advart dere mot en overhengende straff, den dag når mennesket får se hva han har sendt i forveien til regnskapet, og den vantro utbryter: «Hadde jeg bare vært støv!»"
        },
        "Pashto": {
            "verse 78:1": "دوى د څه شي په باره كې یو له بل پوښتنه كوي؟",
            "verse 78:2": "د ډېر لوى خبر په باره كې",
            "verse 78:3": "هغه چې دوى په هغه كې سره اختلاف كوونكي دي",
            "verse 78:4": "نه دې كوي (دغه اختلاف او پوښتنې)، ژر به دوى پوه شي",
            "verse 78:5": "بیا هیڅكله دې نه كوي، ژر به دوى پوه شي",
            "verse 78:6": "ایا مونږ ځمكه فرش نه ده ګرځولې؟",
            "verse 78:7": "او غرونه (مو) میخونه",
            "verse 78:8": "او مونږ تاسو پیدا كړي یئ جوړې (نر او ښځه)",
            "verse 78:9": "او مونږ ستاسو خوب (تاسو لپاره) راحت ګرځولى دى",
            "verse 78:10": "او شپه مو لباس ګرځولې ده",
            "verse 78:11": "او ورځ مو د روزۍ لټولو وخت ګرځولى دى",
            "verse 78:12": "او ستاسو له پاسه مو اوه ډېر مضبوط اسمانونه جوړ كړي دي",
            "verse 78:13": "او مونږ روښانه ځلېدونكې ډېوه پیدا كړې ده",
            "verse 78:14": "او مونږ له ډكو ورېځو نه ډېرې تويېدونكې اوبه نازلې كړې دي",
            "verse 78:15": "د دې لپاره چې مونږ په دغو (اوبو) سره دانې او زرغونه راوباسو",
            "verse 78:16": "او باغونه یو له بل سره نژدې",
            "verse 78:17": "بېشكه د فیصلې ورځ مقرر وخت دى",
            "verse 78:18": "هغه ورځ چې پوكى به ووهل شي په شپېلۍ كې، نو تاسو به ډلې ډلې راځئ",
            "verse 78:19": "او اسمان به پرانستل شي، نو دى به دروازې دروازې وي",
            "verse 78:20": "او غرونه به روان كړى شي، نو دوى به سراب شي",
            "verse 78:21": "بېشكه دوزخ به د انتظار ځاى (كمین ځاى) شي",
            "verse 78:22": "د سركشو لپاره د ورتللو ځاى",
            "verse 78:23": "چې دوى به په هغه كې زمانې زمانې (همېشه) پاتې كېږي",
            "verse 78:24": "دوى به په هغه كې نه څه یخوالى څَكي او نه څه اوبه",
            "verse 78:25": "غیر د اېشېدلو تودو اوبو او بهېدونكو وینو زوو نه",
            "verse 78:26": "بدله به وركولى شي د عملونو سره برابره موافقه",
            "verse 78:27": "بېشكه دوى به د حساب امېد نه كاوه",
            "verse 78:28": "او زمونږ ایتونه به يې دروغ ګڼل، سخت دروغ ګڼل",
            "verse 78:29": "او هر شى، مونږ هغه په كتاب (لوح محفوظ) كې شمېرلى (او محفوظ كړى) دى",
            "verse 78:30": "نو تاسو (خپله سزا) وڅَكئ۔، پس مونږ به تاسو ته له سره زیات نه كړو مګر عذاب",
            "verse 78:31": "بېشكه خاص د متقیانو لپاره كامیابي ده",
            "verse 78:32": "(چې) باغونه او انګور دي",
            "verse 78:33": "او انارسینه همځولې پېغلې دي",
            "verse 78:34": "او ترڅنډو پورې ډكې د شرابو پیالې دي",
            "verse 78:35": "دوى په دغه (جنت) كې نه لغوه (بېكاره) خبره اوري او نه دروغ",
            "verse 78:36": "د رب له جانبه به بدله وركولى شي۔ (د عملونو) په حساب سره ډېره وركړه",
            "verse 78:37": "چې د اسمانونو او ځمكې رب دى او د هغه څه چې د دغو دواړو په مینځ كې دي، چې ډېر زیات مهربان دى، دوى له هغه سره د خبرو كولو اختیار (او قدرت) نه لري",
            "verse 78:38": "په هغې ورځ كې چې روح او ملايك به صفونه صفونه ودرېږي۔، دوى به خبرې نشي كولى مګرهغه څوك چې هغه ته رحمٰن اجازت وركړي او ده (په دنیا كې) حقه خبره (لا إله الا الله) ویلې وي",
            "verse 78:39": "دغه حق ورځ ده، نو هغه څوك چې د خپل رب په طرف د ورتلو ځاى نیسي (نو ودې نیسي)",
            "verse 78:40": "بېشكه مونږ تاسو له نژدې (راتلونكي) عذاب څخه ووېرولئ، په هغه ورځ كې چې هر سړى به هغه څه ته ګوري چې د ده لاسونو مخكې لېږلي دي او كافر به وايي: اى كاشكې چې زه خاورې وى"
        },
        "Persian": {
            "verse 78:1": "از چه چيز مى‌پرسند؟",
            "verse 78:2": "از آن خبر بزرگ،",
            "verse 78:3": "كه در آن اختلاف مى كنند.",
            "verse 78:4": "آرى، به زودى خواهند دانست.",
            "verse 78:5": "باز هم آرى، به زودى خواهند دانست.",
            "verse 78:6": "آيا ما زمين را بسترى نساختيم؟",
            "verse 78:7": "و كوهها را ميخهايى؟",
            "verse 78:8": "و شما را جفت جفت آفريديم.",
            "verse 78:9": "و خوابتان را آسايشتان گردانيديم.",
            "verse 78:10": "و شب را پوششتان قرار داديم.",
            "verse 78:11": "و روز را گاه طلب معيشت.",
            "verse 78:12": "و بر فراز سرتان هفت آسمان استوار بنا كرديم.",
            "verse 78:13": "و چراغى روشن آفريديم.",
            "verse 78:14": "از ابرهاى باران‌زاى آبى فراوان نازل كرديم،",
            "verse 78:15": "تا بدان دانه و نبات برويانيم،",
            "verse 78:16": "و بستانهاى انبوه.",
            "verse 78:17": "هر آينه روز داورى روزى است معين.",
            "verse 78:18": "روزى كه در صور دميده شود و شما فوج‌فوج بياييد.",
            "verse 78:19": "آسمان شكافته شود و هر شكاف درى باشد.",
            "verse 78:20": "و كوه‌ها روان شوند، و سراب گردند.",
            "verse 78:21": "جهنم در انتظار باشد.",
            "verse 78:22": "طاغيان را بازگشتنگاهى است.",
            "verse 78:23": "زمانى دراز در آنجا درنگ كنند.",
            "verse 78:24": "نه خُنكى چشند و نه آب؛",
            "verse 78:25": "جز آب جوشان و خون و چرك.",
            "verse 78:26": "اين كيفرى است برابر كردار.",
            "verse 78:27": "زيرا آنان به روز حساب اميد نداشتند.",
            "verse 78:28": "و آيات ما را به سختى تكذيب مى‌كردند.",
            "verse 78:29": "و ما همه چيز را در كتابى شماره كرده‌ايم.",
            "verse 78:30": "پس بچشيد كه جز به شكنجه شما نخواهيم افزود.",
            "verse 78:31": "پرهيزگاران را جايى است در امان از هر آسيب؛",
            "verse 78:32": "بستانها و تاكستانها،",
            "verse 78:33": "و دخترانى همسال، با پستانهاى برآمده،",
            "verse 78:34": "و جامهاى پر.",
            "verse 78:35": "نه سخن بيهوده شنوند و نه دروغ.",
            "verse 78:36": "و اين پاداشى است كافى، از جانب پروردگارت.",
            "verse 78:37": "پروردگار آسمانها و زمين و آنچه ميان آنهاست. آن خداى رحمان، كه كس را به او ياراى خطاب نباشد.",
            "verse 78:38": "روزى كه روح و فرشتگان به صف مى‌ايستند، و كس سخن نمى‌گويد مگر آنكه خداى رحمان به او رخصت دهد و او سخن به صواب گويد.",
            "verse 78:39": "آن روز روزى است آمدنى. پس هر كه خواهد به سوى پروردگارش بازگردد.",
            "verse 78:40": "ما شما را از عذابى نزديك مى‌ترسانيم: روزى كه آدمى هر چه را پيشاپيش فرستاده است مى‌نگرد و كافر مى‌گويد: اى كاش من خاك مى‌بودم."
        },
        "Polish": {
            "verse 78:1": "O co oni wzajemnie się pytają?",
            "verse 78:2": "O wieść wielką,",
            "verse 78:3": "Co do której nie są zgodnie",
            "verse 78:4": "Nie! Oni niebawem się dowiedzą!",
            "verse 78:5": "I jeszcze raz nie! Oni niebawem się dowiedzą!",
            "verse 78:6": "Czyż nie uczyniliśmy ziemi łożem dla wypoczynku,",
            "verse 78:7": "A gór jako podpory do namiotu?",
            "verse 78:8": "Stworzyliśmy was parami.",
            "verse 78:9": "Uczyniliśmy wasz sen odpoczynkiem.",
            "verse 78:10": "Uczyniliśmy noc zasłoną.",
            "verse 78:11": "Uczyniliśmy dzień czasem życia.",
            "verse 78:12": "Zbudowaliśmy nad wami siedem sfer solidnych.",
            "verse 78:13": "Uczyniliśmy lampę płonącą.",
            "verse 78:14": "Spuściliśmy z deszczowych chmur wodę obfitą",
            "verse 78:15": "I sprawiliśmy, iż dzięki niej wyrosły ziarna i rośliny",
            "verse 78:16": "Oraz bujne ogrody.",
            "verse 78:17": "Zaprawdę, Dzień Rozstrzygnięcia jest wyznaczony!",
            "verse 78:18": "Tego Dnia, kiedy zadmą w trąbę, przybędziecie grupami.",
            "verse 78:19": "Niebo zostanie otwarte i stanie się bramami.",
            "verse 78:20": "Góry zostaną z posad poruszone i staną się mirażem.",
            "verse 78:21": "Zaprawdę, Gehenna jest na czatach",
            "verse 78:22": "Jako miejsce powrotu dla buntowników!",
            "verse 78:23": "Będą przebywać w niej przez wieki.",
            "verse 78:24": "Nie zakosztują w niej ani ochłody, ani napoju,",
            "verse 78:25": "A jedynie wodę wrzącą i ropę cuchnącą",
            "verse 78:26": "Jako zapłatę odpowiednią.",
            "verse 78:27": "Zaprawdę, oni się nie spodziewali, iż będą zdawali rachunek!",
            "verse 78:28": "Uważali znaki Nasze za kłamstwo",
            "verse 78:29": "Podczas gdy My wyliczyliśmy każdą rzecz, zapisując ją.",
            "verse 78:30": "Zakosztujcie więc! My nie zwiększymy dla was niczego oprócz cierpienia!",
            "verse 78:31": "Zaprawdę, dla bogobojnych - miejsce szczęśliwości:",
            "verse 78:32": "Sady i winnice,",
            "verse 78:33": "I dziewczęta o zaokrąglonych piersiach - jednakowej młodości,",
            "verse 78:34": "I puchary napełnione!",
            "verse 78:35": "Nie będą oni, tam słyszeć ani próżnej gadaniny, ani kłamstwa.",
            "verse 78:36": "Taka jest nagroda od twojego Pana - dar dobrze obliczony -,",
            "verse 78:37": "Od Pana niebios i ziemi i tego wszystkiego, co jest między nimi, Miłosiernego; nie będą oni mieli możności przemawiania do Niego.",
            "verse 78:38": "Tego Dnia kiedy Duch i aniołowie staną w szeregach, nie będą mogli mówić, oprócz tego, któremu pozwoli Miłosierny, i powie on to, co słuszne.",
            "verse 78:39": "Ten Dzień to prawda. Przeto ten, kto zechce, znajdzie drogę powrotu do swojego Pana.",
            "verse 78:40": "Zaprawdę, daliśmy wam ostrzeżenie o karze bliskiej, w Dniu, kiedy człowiek zobaczy to, co przygotowały jego ręce, i powie niewierny: \"O, gdybym mógł być prochem!\""
        },
        "Portuguese": {
            "verse 78:1": "Acerca de quê se interrogam?",
            "verse 78:2": "Acerca da grande notícia,",
            "verse 78:3": "A respeito da qual discordam.",
            "verse 78:4": "Sim, logo saberão!",
            "verse 78:5": "Sim, realmente, logo saberão!",
            "verse 78:6": "Acaso, não fizemos da terra um leito,",
            "verse 78:7": "E das montanhas, estacas?",
            "verse 78:8": "E não vos criamos, acaso, em casais,",
            "verse 78:9": "Nem fizemos o vosso sono, para o descanso,",
            "verse 78:10": "Nem fizemos a noite, como um manto,",
            "verse 78:11": "Nem fizemos o dia, para ganhardes o sustento?",
            "verse 78:12": "E não construímos, por cima de vós, os sete firmamentos?",
            "verse 78:13": "Nem colocamos neles um esplendoroso lustre?",
            "verse 78:14": "Nem enviamos, das nuvens, copiosa chuva,",
            "verse 78:15": "Para produzir, por meio desta, o grão e as plantas,",
            "verse 78:16": "E frondosos vergéis?",
            "verse 78:17": "Sabei que o Dia da Discriminação está com a hora fixada.",
            "verse 78:18": "Será o dia em que a trombeta soará e em que comparecereis em grupos,",
            "verse 78:19": "E se abrirá o céu, e terá muitas portas.",
            "verse 78:20": "E as montanhas serão dispersadas, parecendo uma miragem.",
            "verse 78:21": "Em verdade, o inferno será uma emboscada,",
            "verse 78:22": "Morada para os transgressores,",
            "verse 78:23": "Onde permanecerão, por tempo ininterrupto.",
            "verse 78:24": "Em que não provarão do frescor, nem de (qualquer) bebida,",
            "verse 78:25": "A não ser água fervente e uma paralisante beberagem, gelada,",
            "verse 78:26": "Como castigo adequado (pelos seus feitos malignos),",
            "verse 78:27": "Porque nunca temeram o cômputo,",
            "verse 78:28": "E desmentiram, descarada e veementemente, os Nossos versículos.",
            "verse 78:29": "Mas anotamos tudo, me registro.",
            "verse 78:30": "Sofrei, pois, conquanto nada vos proporcionaremos, senão castigo.",
            "verse 78:31": "Por outra, os tementes obterão a recompensa,",
            "verse 78:32": "Jardins e videiras,",
            "verse 78:33": "E donzelas, da mesma idade, por companheiras,",
            "verse 78:34": "E taças transbordantes,",
            "verse 78:35": "Onde não escutarão veleidades nem mentidas.",
            "verse 78:36": "Com efeito, receberão a recompensa do teu Senhor, que será uma paga suficiente,",
            "verse 78:37": "(Do) Senhor dos céus e da terra e de tudo quanto existe entre ambos, o Clemente com Quem ninguém pode dialogar.",
            "verse 78:38": "No dia em que comparecerem o Espírito e os anjos enfileirados, ninguém poderá falar, salvo aquele a quem o Clemente o permitir; e falará a verdade.",
            "verse 78:39": "Tal será o dia infalível; quem quiser, pois, poderá encaminhar-se para o seu Senhor!",
            "verse 78:40": "Sabei que vos temos advertido do castigo iminente, o dia em que o homem verá as obras das suas mãos, e o incrédulo dirá: Oxalá me tivesse convertido em pó!"
        },
        "Punjabi": {
            "verse 78:1": "ਲੋਕ ਕਿਸ ਚੀਜ਼ ਬਾਰੇ ਪੁੱਛ ਰਹੇ ਹਨ।",
            "verse 78:2": "ਉਸ ਵੱਡੀ ਸੂਚਨਾ ਬਾਰੇ।",
            "verse 78:3": "ਜਿਸ ਬਾਰੇ ਇਹ ਲੋਕ ਮੱਤਭੇਦ ਕਰਦੇ ਹਨ।",
            "verse 78:4": "ਕਦੇ ਵੀ ਨਹੀਂ, ਜਲਦੀ ਹੀ ਉਹ ਜਾਣ ਲੈਣਗੇ।",
            "verse 78:5": "ਕਦੇ ਵੀ ਨਹੀਂ, ਜਲਦੀ ਹੀ ਉਹ ਜਾਣ ਲੈਣਗੇ।",
            "verse 78:6": "ਕੀ ਅਸੀਂ ਧਰਤੀ ਨੂੰ ਫਰਸ਼ ਨਹੀਂ ਬਣਾਇਆ।",
            "verse 78:7": "ਅਤੇ ਪਹਾੜਾਂ ਨੂੰ ਮੇਖਾਂ (ਸਹਾਰਾ ਦੇਣ ਵਾਲੇ ਖੰਬੇ)।",
            "verse 78:8": "ਅਤੇ ਤੁਹਾਨੂੰ ਅਸੀਂ’ ਜੋੜੇ-ਜੋੜੇ ਬਣਾਇਆ।",
            "verse 78:9": "ਅਤੇ ਨੀਂਦ ਨੂੰ ਤੁਹਾਡੀ ਥਕਾਨ ਦੂਰ ਕਰਨ ਲਈ ਬਣਾਇਆ।",
            "verse 78:10": "ਅਤੇ ਰਾਤ ਨੂੰ ਪਰਦਾ ਬਣਾਇਆ।",
            "verse 78:11": "ਅਤੇ ਅਸੀਂ ਦਿਨ ਨੂੰ ਰੋਜ਼ੀ ਕਮਾਉਣ ਦਾ ਸਮਾਂ ਬਣਾਇਆ।",
            "verse 78:12": "ਅਤੇ ਅਸੀਂ ਤੁਹਾਡੇ ਉੱਪਰ ਸੱਤ ਪੱਕੇ ਅਸਮਾਨ ਬਣਾਏ।",
            "verse 78:13": "ਅਤੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਵਿਚ ਇੱਕ ਚਮਕਦਾ ਹੋਇਆ ਦੀਵਾ ਰੱਖ ਦਿੱਤਾ।",
            "verse 78:14": "ਅਤੇ ਅਸੀਂ ਪਾਣੀ ਨਾਲ ਭਰੇ ਬੱਦਲਾਂ ਰਾਹੀ’ ਮੋਹਲੇਧਾਰ ਮੀਂਹ ਵਰਸਾਇਆ।",
            "verse 78:15": "ਤਾਂ ਕਿ ਅਸੀਂ ਉਸ ਦੇ ਰਾਹੀਂ ਅਨਾਜ ਅਤੇ ਸਬਜ਼ੀਆਂ ਉਗਾਈਏ।",
            "verse 78:16": "ਅਤੇ ਸੰਘਣੇ ਬਾਗ਼।",
            "verse 78:17": "ਬੇਸ਼ੱਕ ਫ਼ੈਸਲੇ ਦੇ ਦਿਨ ਦਾ ਸਮਾਂ ਨਿਸ਼ਚਿਤ ਹੈ।",
            "verse 78:18": "ਜਿਸ ਦਿਨ ਸੂਰ ਵਿਚ ਬਿਗਲ ਵਜਾਇਆ ਜਾਵੇਗਾ, ਫਿਰ ਤੁਸੀਂ ਝੂੰਡਾਂ ਦੇ ਝੁੰਡ ਆਵੋਗੇ।",
            "verse 78:19": "ਅਤੇ ਅਸਮਾਨ ਖੌਲ੍ਹ ਦਿੱਤਾ ਜਾਵੇਗਾ, ਫਿਰ ਉਸ ਵਿਚ ਦਰਵਾਜ਼ੇ ਹੀ ਦਰਵਾਜ਼ੇ ਹੋ ਜਾਣਗੇ।",
            "verse 78:20": "ਅਤੇ ਪਹਾੜ ਚਲਾ ਦਿੱਤਾ ਜਾਣਗੇ ਉਹ ਰੇਤ ਵਰਗੇ ਹੋ ਜਾਣਗੇ।",
            "verse 78:21": "ਬੇਸ਼ੱਕ ਨਰਕ ਘਾਤ ਵਿਚ ਹੈ।",
            "verse 78:22": "ਬਾਗ਼ੀਆਂ ਦਾ ਟਿਕਾਣਾ।",
            "verse 78:23": "ਉਸ ਵਿਚ ਉਹ ਲੰਮੇ ਸਮੇਂ ਤੱਕ ਪਏ ਰਹਿਣਗੇ।",
            "verse 78:24": "ਉਸ ਵਿਚ ਨਾ ਉਹ ਕਿਸੇ ਠੰਡਕ ਨੂੰ ਚੱਖਣਗੇ ਅਤੇ ਨਾ ਪੀਣ ਵਾਲੀ ਜ਼ੀਜ਼ ਨੂੰ।",
            "verse 78:25": "ਪਰੰਤੂ ਖੌਲ੍ਹਦਾ ਪਾਣੀ ਅਤੇ (ਜਖ਼ਮਾਂ ਦੀ) ਪੀਕ।",
            "verse 78:26": "ਉਨ੍ਹਾਂ ਦੇ ਕਰਮ ਅਨੁਸਾਰ ਬਦਲਾ ਹੈ।",
            "verse 78:27": "ਉਹ ਹਿਸਾਬ ਦਾ ਡਰ ਨਹੀਂ ਰੱਖਦੇ ਸਨ।",
            "verse 78:28": "ਅਤੇ ਉਨ੍ਹਾਂ ਨੇ ਸਾਡੀਆਂ ਆਇਤਾਂ ਨੂੰ ਸੰਪੂਰਨ ਝੁਠਲਾ’ ਦਿੱਤਾ।",
            "verse 78:29": "ਅਤੇ ਅਸੀਂ ਹਰ ਚੀਜ਼ ਨੂੰ ਲਿਖ ਕੇ ਉਸ ਦੀ ਗਿਣਤੀ ਕਰ ਰੱਖੀ ਹੈ।",
            "verse 78:30": "ਤਾਂ ਚੱਖੋ। ਅਸੀਂ ਤੁਹਾਡੀ ਸਜ਼ਾ ਵਧਾਉਂਦੇ ਜਾਂਵਾਗੇ।",
            "verse 78:31": "ਬੇਸ਼ੱਕ ਡਰਨ ਵਾਲਿਆਂ ਲਈ ਸਫ਼ਲਤਾ ਹੈ।",
            "verse 78:32": "ਸ਼ਾਗ਼ ਅਤੇ ਅੰਗੂਰ",
            "verse 78:33": "ਅਤੇ ਬਰਾਬਰ ਉਮਰ ਵਾਲੀਆਂ ਨੌਜਵਾਨ ਲੜਕੀਆਂ।",
            "verse 78:34": "ਅਤੇ ਭਰੇ ਹੋਏ ਜਾਮ।",
            "verse 78:35": "ਉੱਥੇ ਉਹ ਮਿਥਿਆ ਅਤੇ ਝੂਠੀਆਂ ਗੱਲਾਂ ਨਹੀਂ ਸੁਨਣਗੇ।",
            "verse 78:36": "ਤੇਰੇ ਰੱਬ ਵੱਲੋਂ ਉਨ੍ਹਾਂ ਦੇ ਕਰਮਾਂ ਦੇ ਅਨੁਸਾਰ ਬਦਲਾ ਹੋਵੇਗਾ।",
            "verse 78:37": "ਰਹਿਮਾਨ ਵੱਲੋਂ ਜਿਹੜਾ ਆਕਾਸ਼ ਅਤੇ ਧਰਤੀ ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਵਿਚਕਾਰ ਦੀਆਂ ਚੀਜ਼ਾਂ ਦਾ ਪਾਲਣਹਾਰ ਹੈ। ਕੋਈ ਤਾਕਤ ਨਹੀਂ ਰੱਖਦਾ ਕਿ ਉਸ ਨਾਲ ਗੱਲ ਕਰੇ।",
            "verse 78:38": "ਜਿਸ ਦਿਨ ਜਿਬਰੀਲ ਅਤੇ ਫ਼ਰਿਸ਼ਤੇ ਕਤਾਰਾਂ ਬਣਾ ਕੇ ਖੜ੍ਹੇ ਹੋਣਗੇ, (ਉਸ ਵੇਲੇ) ਕੋਈ ਨਹੀਂ’ ਬੋਲੇਗਾ। ਪਰੰਤੂ (ਉਸ ਤੋਂ’ ਬਿਨ੍ਹਾਂ? ਜਿਸ ਨੂੰ ਰਹਿਮਾਨ ਆਗਿਆ ਦੇਵੇ ਅਤੇ ਉਹ ਯੋਗ ਗੱਲ ਕਹੇਗਾ।)",
            "verse 78:39": "ਇਹ ਦਿਨ ਨਿਸ਼ਚਿਤ ਹੈ, ਸੌ ਜਿਹੜਾ ਚਾਹੇ ਆਪਣੇ ਰੱਬ ਵੱਲ (ਆਪਣਾ) ਟਿਕਾਣਾ ਬਣਾ ਲਵੇ।",
            "verse 78:40": "ਅਸੀਂ ਤੁਹਾਨੂੰ ਨੇੜੇ ਆ ਜਾਣ ਵਾਲੀ ਸਜ਼ਾ ਤੋਂ ਡਰਾ ਦਿੱਤਾ ਹੈ। ਜਿਸ ਦਿਨ ਮਨੁੱਖ ਉਸ ਨੂੰ ਦੇਖ ਲਵੇਗਾ, ਜਿਹੜਾ ਉਸ ਦੇ ਹੱਥਾਂ ਨੇ ਅੱਗੇ ਭੇਜਿਆ ਹੈ ਤਾਂ ਅਵੱਗਿਆਕਾਰੀ ਆਖੇਗਾ ਕਿ ਕਾਸ਼! ਮੈਂ ਸਿੱਟੀ ਹੁੰਦਾ।"
        },
        "Roman english": {
            "verse 78:1": "Amma Yatasaa-aloon",
            "verse 78:2": "Anin-nabaa-il `azeem",
            "verse 78:3": "Allazi hum feehi mukh talifoon",
            "verse 78:4": "Kallaa sa y`alamoon",
            "verse 78:5": "Thumma kallaa sa y`alamoon",
            "verse 78:6": "Alam naj`alil arda mihaa da",
            "verse 78:7": "Wal jibaala au taada",
            "verse 78:8": "Wa khalaq naakum azwaaja",
            "verse 78:9": "Waja`alnan naumakum subata",
            "verse 78:10": "Waja`alnal laila libasa",
            "verse 78:11": "Waja`alnan nahara ma `aasha",
            "verse 78:12": "Wa banaina fauqakum sab `an shi daada",
            "verse 78:13": "Waja`alna siraajaw wah haaja",
            "verse 78:14": "Wa anzalna minal m`usiraati maa-an saj-jaaja",
            "verse 78:15": "Linukh rija bihee habbaw wana baata",
            "verse 78:16": "Wa jan naatin alfafa",
            "verse 78:17": "Inna yaumal-fasli kana miqaata",
            "verse 78:18": "Yauma yun fakhu fis-soori fataa toona afwaaja",
            "verse 78:19": "Wa futiha tis samaa-u fakaanat abwaaba",
            "verse 78:20": "Wa suyyi raatil jibaalu fa kaanat saraaba",
            "verse 78:21": "Inna jahan nama kaanat mirsaada",
            "verse 78:22": "Lit taa gheena ma aaba",
            "verse 78:23": "Laa bitheena feehaa ahqaaba",
            "verse 78:24": "Laa ya zooqoona feeha bar daw walaa sharaaba",
            "verse 78:25": "Illa hamee maw-wa ghas saaqa",
            "verse 78:26": "Jazaa-aw wi faaqa",
            "verse 78:27": "Innahum kaanu laa yarjoona hisaaba",
            "verse 78:28": "Wa kazzabu bi aayaa tina kizzaba",
            "verse 78:29": "Wa kulla shai-in ahsai naahu kitaa ba",
            "verse 78:30": "Fa zooqoo falan-nazee dakum ill-laa azaaba",
            "verse 78:31": "Inna lil mutta qeena mafaaza",
            "verse 78:32": "Hadaa-iqa wa a`anaa ba",
            "verse 78:33": "Wa kaawa `iba at raaba",
            "verse 78:34": "Wa ka`san di haaqa",
            "verse 78:35": "Laa yasma`oona fiha lagh waw walaa kizzaba",
            "verse 78:36": "Jazaa-am mir-rabbika ataa-an hisaaba",
            "verse 78:37": "Rabbis samaa waati wal ardi wa maa baina humar rahmaani laa yam likoona minhu khi taaba",
            "verse 78:38": "Yauma yaqoo mur roohu wal malaa-ikatu saf-fal laa yata kalla moona illa man azina lahur rahmaanu wa qaala sawaaba",
            "verse 78:39": "Zaalikal yaumul haqqu faman shaa-at ta khaaza ill-laa rabbihi ma-aaba",
            "verse 78:40": "In naa anzar naakum azaaban qareebaiy-yauma yan zurul marr-u maa qaddamat yadaahu wa ya qoolul-kaafiru yaa lai tanee kuntu turaaba"
        },
        "Russian": {
            "verse 78:1": "О чем они друг друга вопрошают?",
            "verse 78:2": "О Превеликой Вести,",
            "verse 78:3": "Единого согласья о которой нет.",
            "verse 78:4": "Поистине, познать им скоро предстоит!",
            "verse 78:5": "Поистине, поистине, познанье близко!",
            "verse 78:6": "Но разве Мы не разостлали землю вам Широкой колыбелью?",
            "verse 78:7": "Столпами горы не воздвигли?",
            "verse 78:8": "Мы пАрами создАли вас,",
            "verse 78:9": "А для покоя ниспослали сон,",
            "verse 78:10": "Защитным кровом ночь спустили,",
            "verse 78:11": "Для созиданий сотворили день.",
            "verse 78:12": "Построили над вами семь твердей,",
            "verse 78:13": "И поместили в них пылающий светильник,",
            "verse 78:14": "И шлем из облаков обильные дожди,",
            "verse 78:15": "Что зелень и зерно взрастят,",
            "verse 78:16": "Прекрасные сады подымут.",
            "verse 78:17": "Поистине, День Разделенья уж назначен -",
            "verse 78:18": "Тот День, Когда раздастся трубный глас И толпами пойдете вы;",
            "verse 78:19": "Вратами распахнутся небеса,",
            "verse 78:20": "Исчезнут горы, словно в мираже.",
            "verse 78:21": "Поистине, засадою предстанет Ад,",
            "verse 78:22": "Обителью предназначенья для неверных.",
            "verse 78:23": "И пребывать им там навечно,",
            "verse 78:24": "И не вкушать им там ни влаги, ни прохлады, \"Падите ниц в молитве (перед Богом)!\", Они не внемлют.",
            "verse 78:25": "Помимо пития из жидкости кипящей И темного питья из нечистот,",
            "verse 78:26": "Что станет им достойным возданьем, -",
            "verse 78:27": "Ведь на расплату (за свои грехи) Они надежд не возлагали",
            "verse 78:28": "И, сея ложь, отвергли все знаменья Наши.",
            "verse 78:29": "Мы ж все сочли и записали.",
            "verse 78:30": "Вкусите же (награду за свои грехи) - И никакого усиления удач и благ Мы (в жизни этой) вам не предоставим, Помимо возрастания (в Аду) всех наказаний.",
            "verse 78:31": "Поистине, для почитателей Аллаха В Раю - пристанище благое:",
            "verse 78:32": "Сады и виноградники,",
            "verse 78:33": "И девы-сверстницы с округлыми грудями,",
            "verse 78:34": "И чаши, полные до края.",
            "verse 78:35": "Они не встретят там Ни пустословия, ни лжи -",
            "verse 78:36": "Как воздаянье Господа и дар Его (сполна) -",
            "verse 78:37": "От Господа земли и неба И того, что между ними суще, - От Милосердного! С Которым Речь держать они не смеют.",
            "verse 78:38": "В тот День Рядами встанут ангелы и Дух Святой, И речь глаголать будут те, Кому дозволит Милосердный. И будут праведны их речи.",
            "verse 78:39": "День этот - Истина (Господнего Завета), И тот, кто этого желает, Пойдет путем возврата к Богу своему!",
            "verse 78:40": "Поистине, предупрежденье было вам О наказанье близком (в Судный День), - В тот День, Когда вы сможете узреть Деянья те, что ваши руки совершили. А тот, кто верой пренебрег, воскликнет: \"О, горе мне! Уж лучше быть мне прахом!\""
        },
        "Sindhi": {
            "verse 78:1": "ڪھڙيءَ ڳالھ بابت ھڪ ٻئي کان پڇن ٿا.",
            "verse 78:2": "(ھائو!) ھڪڙي اھڙي وڏي واقعي بابت.",
            "verse 78:3": "جنھن (جي ٿيڻ) ۾ اُھي (پاڻ ۾) مختلف آھن.",
            "verse 78:4": "ائين (سندن خيالن وانگر) نه آھي سگھوئي ڄاڻندا.",
            "verse 78:5": "وري (به چئون ٿا) ته ائين نه آھي سگھوئي ڄاڻندا.",
            "verse 78:6": "زمين کي وڇاڻو نه ڪيو اٿون ڇا؟",
            "verse 78:7": "۽ جبلن کي ميخون؟",
            "verse 78:8": "۽ اوھان کي جوڙو جوڙو (نر ۽ مادي) بڻايوسون.",
            "verse 78:9": "۽ اوھان جي ننڊ کي فرحت بڻايوسون.",
            "verse 78:10": "۽ رات کي ڍَڪ ڪيوسون.",
            "verse 78:11": "۽ ڏينھن کي گذران (جو وقت) ڪيوسون.",
            "verse 78:12": "۽ اوھان جي مٿون ست مُحڪم (آسمان) بڻاياسون.",
            "verse 78:13": "۽ ھڪ چمڪندڙ ڏيئو (سج) بڻايوسون.",
            "verse 78:14": "۽ ڪڪرن مان پلٽندڙ پاڻي وسايوسون.",
            "verse 78:15": "ته اُن سان اَن ۽ سَلا ڄمايون.",
            "verse 78:16": "۽ گھاٽاباغ (به).",
            "verse 78:17": "بيشڪ فيصلي جو ڏينھن ھڪ مقرر مھل آھي.",
            "verse 78:18": "جنھن ڏينھن صُور ۾ ڦوڪبو ته اوھين ٽوليون ٽوليون ٿي ايندؤ.",
            "verse 78:19": "۽ آسمان کولبو پوءِ دروازا ٿي پوندو.",
            "verse 78:20": "۽ جبل ھلائبا پوءِ رُڃ وانگر ٿيندا.",
            "verse 78:21": "بيشڪ دوزخ انتظار ڪڍڻ وارو آھي.",
            "verse 78:22": "جو ھٺيلن جو رھڻ جو ھنڌ آھي.",
            "verse 78:23": "منجھس ڪيئي ڊگھيون مُدتون رھندا.",
            "verse 78:24": "اُن ۾ نڪا ٿڌائي ۽ نڪا پيڻ جي شيءِ چکندا.",
            "verse 78:25": "تتي پاڻي ۽ روڳ کانسواءِ.",
            "verse 78:26": "(اھو سندن) پورو پورو بدلو آھي.",
            "verse 78:27": "ڇوته اُھي حساب ڏيڻ جي اُميد نه رکندا ھوا.",
            "verse 78:28": "۽ اسان جي حُڪمن کي بلڪل ڪوڙ ڀائيندا ھوا.",
            "verse 78:29": "۽ سڀ شيءِ کي لکي ڳڻي ڇڏيو اٿون.",
            "verse 78:30": "پوءِ (چئبن ته مزو) چکو جو عذاب کانسواءِ اوھان تي (ٻيو) ڪي (به) نه وڌائينداسون.",
            "verse 78:31": "بيشڪ پرھيزگارن لاءِ ڪاميابي آھي.",
            "verse 78:32": "جو باغ ۽ ڊاکون.",
            "verse 78:33": "۽ ھم عمر نوجوان زالون.",
            "verse 78:34": "۽ شراب جا ڇلڪندڙ پيالا (به).",
            "verse 78:35": "اتي نڪا اجائي بڪ ۽ نڪو ڪوڙ ٻڌندا.",
            "verse 78:36": "(اھو پورو) بدلو تنھنجي پالڻھار کان (انعام) عطا ڪيل حساب روءِ آھي.",
            "verse 78:37": "جو آسمانن ۽ زمين جو ۽ جيڪي ٻنھي جي وچ ۾ آھي تن جو پالڻھار ٻاجھارو آھي اُن (جي ھيبت) کان ڪوبه ورندي ڏئي نه سگھندو.",
            "verse 78:38": "جنھن ڏينھن روح ۽ (سڀئي) ملائڪ صفون ٻڌي بيھندا (تنھن ڏينھن) جنھن کي ٻاجھاري (الله) موڪل ڏني ھوندي ۽ پوري ڳالھ ڳالھائي ھوندائين تنھن کانسواءِ (ٻيو ڪي به) نه ڳالھائيندا.",
            "verse 78:39": "اِھو ڏينھن سچ پچ (ٿيڻو) آھي، تنھنڪري جيڪو گھري سو پنھنجي پالڻھار ڏانھن (پنھنجي) رھڻ جو ھنڌ ٺاھي.",
            "verse 78:40": "بيشڪ اسان اوھان کي ويجھي عذاب (اچڻ) کان ڊيڄاري چڪاسون، جنھن ڏينھن آدمي اُھو ڏسندو جيڪي سندس ٻنھي ھٿن اڳي ڪري موڪليو ۽ ڪافر چوندو ته ھاءِ ارمان جيڪر آءٌ مٽي ھجان ھا."
        },
        "Sinhalese": {
            "verse 78:1": "(නබිවරය!) කුමක් පිළිබඳව ද ඔවුන් තමන් අතර විමසා සිටිනුයේ.",
            "verse 78:2": "මහඟු වූ ආරංචිය පිළිබඳව ය.",
            "verse 78:3": "එය ඔවුන් භේද බින්න වී සිටි දෑය.",
            "verse 78:4": "නොඑසේය. ඔවුහු මතු දැන ගනු ඇත.",
            "verse 78:5": "යළි නොඑසේය. ඔවුහු මතු දැන ගනු ඇත.",
            "verse 78:6": "අපි මහපොළොව තොටිල්ලක් ලෙස පත් නොකළෙමු ද?",
            "verse 78:7": "තවද කඳු, කූඤ්ඤ ලෙස ද (පත් නොකළෙමු ද?)",
            "verse 78:8": "තවද අපි නුඹලා ව (ස්ත්‍රී පුරුෂ ලෙස) යුගල වශයෙන් මැව්වෙමු.",
            "verse 78:9": "තවද අපි නුඹලාගේ නින්ද විවේකයක් බවට පත් කළෙමු.",
            "verse 78:10": "තවද අපි රාත්‍රිය ආවරණයක් බවට පත් කළෙමු.",
            "verse 78:11": "තවද අපි දහවල ජීවනෝපාය (සලසා ගන්නක්) බවට පත් කළෙමු.",
            "verse 78:12": "තවද අපි නුඹලාට ඉහළින් ශක්තිමත් (අහස්) හතක් ඉදි කළෙමු.",
            "verse 78:13": "තවද අපි දීප්තියෙන් දැල්වෙන පහනක් බවට (සූර්යයා) පත් කළෙමු.",
            "verse 78:14": "තවද අපි මේඝ වලාවන්ගෙන් (වැසි) ජලය අධික ලෙස පහළ කළෙමු.",
            "verse 78:15": "එමගින් ධාන්‍ය (වර්ග) හා වෘක්ෂලතා ද හට ගනු පිණිස.",
            "verse 78:16": "තුරු පතරින් ගහන (සරුසාර) උයන් ද (හට ගනු පිණිස.)",
            "verse 78:17": "නියත වශයෙන්ම තීරණාත්මක දිනයට (අදාළ) කාලය නියම වී ඇත.",
            "verse 78:18": "සූර් (හොරණෑ‍ව) පිඹිනු ලබන දිනයේ දී නුඹලා කණ්ඩායම් වශයෙන් පැමිණෙනු ඇත.",
            "verse 78:19": "තවද අහස විවෘත කරනු ලැබ එය දොරටු බවට පත් වනු ඇත.",
            "verse 78:20": "කඳු (තිබූ තැන් වලින්) විතැන් කරනු ලැබ එය මිරිඟුවක් වනු ඇත.",
            "verse 78:21": "නියත වශයෙන්ම නිරය රැක බලා සිටින ස්ථානයක් විය.",
            "verse 78:22": "(එය) සීමාව ඉක්මවා යන්නවුන් සඳහා නවාතැනක් වශයෙනි.",
            "verse 78:23": "එහි ඔවුහු යුග ගණනාවක්ම වෙසෙන්නන් වෙති.",
            "verse 78:24": "ඔවුහු එහි සිසිල හෝ පානය හෝ රස නොවිඳිති.",
            "verse 78:25": "නමුත් නටන උණු දිය සහ සැරව මිස.",
            "verse 78:26": "එය සුදුසු ප්‍රතිඵලයක් වශයෙනි.",
            "verse 78:27": "නියත වශයෙන්ම ඔවුහු විනිශ්චය අපේක්ෂා නොකරමින් සිටියෝය.",
            "verse 78:28": "තවද ඔවුහු අපගේ වදන් දැඩි ලෙස බොරු යැයි පවසමින් ප්‍රතික්ෂේප කළෝය.",
            "verse 78:29": "තවද අපි සෑම දෙයක්ම ලිඛිත ව ලේඛණයෙහි සටහන් කර ඇත්තෙමු.",
            "verse 78:30": "“එබැවින් නුඹලා රස විඳිනු. එවිට කිසිවිටෙක දඬුවම මිස අන් කිසිවක් අපි නුඹලාට වැඩි නොකරන්නෙමු.”",
            "verse 78:31": "නියත වශයෙන්ම බිය බැතිමතුන්ට ජයග්‍රහණය ඇත.",
            "verse 78:32": "වතු හා මිදි ද (ඇත.)",
            "verse 78:33": "තවද පියයුරු නෙරා ගිය සම වයසේ කන්‍යාවන් ද (සිටිති).",
            "verse 78:34": "(පානවලින්) පිරුණු කුසලාන ද (ඇත.)",
            "verse 78:35": "නිෂ්ඵල කතා බහක් හෝ (ඔවුනොවුන් අතර) කිසිදු බොරු කිරීමක් හෝ එහි ඔවුහු ශ්‍රවණය නොකරති.",
            "verse 78:36": "(එය) නුඹගේ පරමාධිපතිගෙන් වූ නිර්ණය කරන ලද දායාදයක ප්‍රතිඵලයකි.",
            "verse 78:37": "(එය) අහස්හි ද මහපොළොවෙහි ද ඒ දෙක අතර පවතින දෑහි ද පරමාධිපතියාණන් වන අපරිමිත දයාන්විතයාණන්ගෙනි. (ඔහු ඉදිරියේ) කතා කිරීමට ඔවුනට බලය නොමැත.",
            "verse 78:38": "එදින රූහ් (ජිබ්රීල්) හා මලක් (දේවදූත)වරුන් පෙළ ගැසී නැගිට සිටිති. අපරිමිත දයාන්විතයා අනුමැතිය දුන් කෙනෙකු හා සත්‍ය දෑ කතා කරන්නෙකු මිස (අන් කිසිවෙක්) කතා නොකරයි.",
            "verse 78:39": "මෙයමය සත්‍යය වූ දිනය. එබැවින් යමෙක් අභිමත කරන්නේද ඔහු තම පරමාධිපති වෙත ආපසු යන මාර්ගය තෝරා ගනිත්වා!",
            "verse 78:40": "නියත වශයෙන්ම සමීපයෙන් පවතින දඬුවම පිළිබඳ ව අපි නුඹලාට අවවාද කළෙමු. එදින මිනිසා තම දෙඅත් ඉදිරිපත් කළ දෑ දැක ගනී. තවද ප්‍රතික්ෂේප කරන්නා, “අහෝ මා පස් බවට පත් විය යුතු නොවෙම් දැ”යි පවසයි."
        },
        "Somali": {
            "verse 78:1": "Maxay iska waydiinayaan (Gaaladu).",
            "verse 78:2": "Warkii waynaa xaggiisa (Qiyayaamada ama Quraanka).",
            "verse 78:3": "Ay isku diiddanaayeen.",
            "verse 78:4": "Saas ma aha ee way ogaan donaan.",
            "verse 78:5": "Haddana way ogaandoonaan (wa xa ka dhaca).",
            "verse 78:6": "Miyaannaan Dhulka gogol ka yeelin.",
            "verse 78:7": "Buurahana Rukummo (ka yeelin).",
            "verse 78:8": "Miyannaan idinka Abuurina Noocyo.",
            "verse 78:9": "Miyannaan Hurdada Raaxo idiinka dhigin.",
            "verse 78:10": "Miyaannaan Habeenka asturaal idiinka dhigin.",
            "verse 78:11": "Miyaannaan Maalinta waqti shaqo idiinka dhigin.",
            "verse 78:12": "Korkiinna miyaannaan ka dhisin Tooddoba xoog leh.",
            "verse 78:13": "Miyaannaan dhexdeeda yeelin Sirraad aad u ifi (Qorraxda).",
            "verse 78:14": "Waxaan idiinka soodajinnay daruuraha biyo badan.",
            "verse 78:15": "Si aan ugu soo bixinno Midho iyo Daaq.",
            "verse 78:16": "Iyo Beero kulansan (badan).",
            "verse 78:17": "Maalinta kalabuxu waxay leedahay waqtu go'an.",
            "verse 78:18": "Waana Maalinta Suurka la afuufi ood u imanaysaan Kooxo.",
            "verse 78:19": "Samadana waa la furi waxayna yeelan Albaabo.",
            "verse 78:20": "Buurahana waa la kaxayn waxayna noqon Dhalanteed.",
            "verse 78:21": "Naarta Jahannamana waxay u darbantahay.",
            "verse 78:22": "(Gaalada) Xadgudbay meelay u noqdaan.",
            "verse 78:23": "Waxayna ku nagaan Dhexdeeda Sanooyin.",
            "verse 78:24": "Mana ku dhadhamiyaan dhexdeeda qabaw (ama Hurdo) ama Cabbid midna.",
            "verse 78:25": "Waxaan ahayn biyo kulul iyo Dhacaanka (ehlu Naarka).",
            "verse 78:26": "Waxaana lagu abaalmariyay si waafaqsan Camalkoodii.",
            "verse 78:27": "Waxayna ahaayeen kuwa aan ka yaabaynin xisaab.",
            "verse 78:28": "Waxayna beeniyeen Aayaadkannaga.",
            "verse 78:29": "Wax walbana waxaan ku koobnay Kitaab.",
            "verse 78:30": "Ee dhadhamiya Caddibaad Gaalooy waxaan caddibaad ahayn idiin kordhinmaynee.",
            "verse 78:31": "Kuwa Eebe ka dhawrsada waxay leeyihiin liibaan.",
            "verse 78:32": "Beero iyo Cinabyana way heli.",
            "verse 78:33": "Waxayna Guursan Haween da'yar oo isle eg.",
            "verse 78:34": "Waxayna heli Cabbid wanaagsan.",
            "verse 78:35": "Jannada kuma dhexmaqlaan hadal macna la'aan ah iyo is beenin midna.",
            "verse 78:36": "Waa abaalmarin Eebe uu siiyay oo ku filan.",
            "verse 78:37": "Eebaha Samada iyo Dhulka iyo waxa u dhexeeya waa Allaha Raxmaan ah, Hadal wax ku soocelinna ma jiro (Qiyaamada).",
            "verse 78:38": "Maalinta Jibriil iyo Malaa'igtu Saf istaagi wax hadli ma jiro Ruux Eebe idmo mooyee oo Hadal xaq ah ku hadla.",
            "verse 78:39": "Maalintaasi waa sugantahay ee Ruuxii doona Eebe xaggiisa meeluu ku noqdo ha ka samaysto.",
            "verse 78:40": "Waxaannu idiinka digaynaa Cadibaad dhaw Maalinta uu arki Ruux walba waxay Gacmihiisu hor marsadeen, Gaalkuna uu dhihi Shallaytadaydee maan Carro noqdo."
        },
        "Spanish": {
            "verse 78:1": "Sobre qué se preguntan?",
            "verse 78:2": "Sobre la Gran Noticia",
            "verse 78:3": "acerca de la cual difieren.",
            "verse 78:4": "Pero no! Ya sabrán,",
            "verse 78:5": "sabrán de verdad.",
            "verse 78:6": "Acaso no hemos hecho de la tierra un lecho,",
            "verse 78:7": "hemos puesto las montañas como estacas,",
            "verse 78:8": "os hemos creado en parejas,",
            "verse 78:9": "hemos hecho de vuestro sueño reposo,",
            "verse 78:10": "hemos hecho de la noche un vestido,",
            "verse 78:11": "hemos hecho del día un medio de vida,",
            "verse 78:12": "hemos edificado sobre vosotros siete firmamentos,",
            "verse 78:13": "hemos puesto una lámpara reluciente,",
            "verse 78:14": "y hacemos caer de las nubes agua de lluvia",
            "verse 78:15": "con la que hacemos que broten granos y plantas",
            "verse 78:16": "y vergeles de espeso arbolado?",
            "verse 78:17": "El Día de la Distinción es una cita con un momento fijado.",
            "verse 78:18": "El día en que se sople en el cuerno y vengan en grupos.",
            "verse 78:19": "El cielo se abrirá y será todo puertas.",
            "verse 78:20": "Y las montañas serán transportadas cual espejismo.",
            "verse 78:21": "Yahannam es un lugar acechante,",
            "verse 78:22": "un lugar de retorno para los que se excedieron,",
            "verse 78:23": "que en él permanecerán eternidades.",
            "verse 78:24": "Y donde no probarán ni frescor ni bebida,",
            "verse 78:25": "tan sólo agua hirviendo y pus.",
            "verse 78:26": "Apropiada recompensa.",
            "verse 78:27": "Ellos no esperaban tener que rendir cuentas",
            "verse 78:28": "y negaron rotundamente la veracidad de Nuestros signos.",
            "verse 78:29": "Pero cada cosa la registramos en un libro.",
            "verse 78:30": "Así pues, gustad. Sólo habrá aumento en el castigo.",
            "verse 78:31": "Los temerosos tendrán un lugar de triunfo:",
            "verse 78:32": "Jardines y viñedos",
            "verse 78:33": "y doncellas de senos formados y edad invariable.",
            "verse 78:34": "Y una copa rebosante.",
            "verse 78:35": "Allí no oirán vanidad ni mentira.",
            "verse 78:36": "Recompensa de tu Señor, regalo idóneo.",
            "verse 78:37": "El Señor de los cielos, de la tierra y de lo que entre ambos hay, el Misericordioso, no tienen el poder de dirigirle la palabra.",
            "verse 78:38": "El día en que el espíritu y los ángeles se pongan en filas, no hablarán sino aquéllos a los que el Misericordioso autorice y hablen con verdad.",
            "verse 78:39": "Ese es el día de la verdad. Quien quiera, que tome refugio en su Señor.",
            "verse 78:40": "Os hemos advertido de un castigo próximo.El día en que el hombre contemple lo que sus manos presentaron y diga el incrédulo: Ay de mí! Ojalá fuera tierra."
        },
        "Swahili": {
            "verse 78:1": "WANAULIZANA nini?",
            "verse 78:2": "Ile khabari kuu,",
            "verse 78:3": "Ambayo kwayo wanakhitalifiana.",
            "verse 78:4": "La! Karibu watakuja jua.",
            "verse 78:5": "Tena la! Karibu watakuja jua.",
            "verse 78:6": "Kwani hatukuifanya ardhi kama tandiko?",
            "verse 78:7": "Na milima kama vigingi?",
            "verse 78:8": "Na tukakuumbeni kwa jozi?",
            "verse 78:9": "Na tukakufanya kulala kwenu ni mapumziko?",
            "verse 78:10": "Na tukaufanya usiku ni nguo?",
            "verse 78:11": "Na tukaufanya mchana ni wa kuchumia maisha?",
            "verse 78:12": "Na tukajenga juu yenu saba zenye nguvu?",
            "verse 78:13": "Na tukaifanya taa yenye mwanga na joto;",
            "verse 78:14": "Na tukateremsha maji yanayo anguka kwa kasi kutoka mawinguni,",
            "verse 78:15": "Ili tutoe kwayo nafaka na mimea,",
            "verse 78:16": "Na mabustani yenye miti iliyo kamatana.",
            "verse 78:17": "Hakika siku ya uamuzi imewekewa wakati wake,",
            "verse 78:18": "Siku litapo pulizwa barugumu, nanyi mtakuja kwa makundi,",
            "verse 78:19": "Na mbingu zitafunguliwa, ziwe milango,",
            "verse 78:20": "Na milima itaondolewa na itakuwa kama sarabi.",
            "verse 78:21": "Hakika Jahannamu inangojea!",
            "verse 78:22": "Kwa walio asi ndio makaazi yao,",
            "verse 78:23": "Wakae humo karne baada ya karne,",
            "verse 78:24": "Hawataonja humo chochote kibaridi wala kinywaji,",
            "verse 78:25": "Ila maji yamoto sana na usaha,",
            "verse 78:26": "Ndio jaza muwafaka.",
            "verse 78:27": "Hakika hao hawakuwa wakitaraji kuwa kuna hisabu.",
            "verse 78:28": "Na wakikanusha Aya zetu kwa nguvu.",
            "verse 78:29": "Na kila kitu Sisi tumekidhibiti kwa kukiandika.",
            "verse 78:30": "Basi onjeni! Nasi hatutakuzidishieni ila adhabu!",
            "verse 78:31": "Hakika wachamngu wanastahiki kufuzu,",
            "verse 78:32": "Mabustani na mizabibu,",
            "verse 78:33": "Na wake walio lingana nao,",
            "verse 78:34": "Na bilauri zilizo jaa,",
            "verse 78:35": "Hawatasikia humo upuuzi wala uwongo -",
            "verse 78:36": "Malipo kutoka kwa Mola wako Mlezi, kipawa cha kutosha.",
            "verse 78:37": "Mola Mlezi wa mbingu na ardhi na vilio baina yao, Arrahman, Mwingi wa rehema; hawamiliki usemi mbele yake!",
            "verse 78:38": "Siku atakapo simama Roho na Malaika kwa safu. Hawatasema ila Mwingi wa rehema aliye mruhusu, na atasema yaliyo sawa tu.",
            "verse 78:39": "Hiyo ndiyo Siku ya haki. Basi anaye taka na ashike njia arejee kwa Mola wake Mlezi.",
            "verse 78:40": "Hakika tumekuhadharisheni adhabu iliyo karibu kufika; Siku ambayo mtu atakapo ona yaliyo tangulizwa na mikono yake; na kafiri atasema: Laiti ningeli kuwa udongo!"
        },
        "Swedish": {
            "verse 78:1": "VAD FRÅGAR de varandra om",
            "verse 78:2": "[De frågar] om det viktiga tillkännagivandet,",
            "verse 78:3": "om vars [innebörd] meningarna går isär.",
            "verse 78:4": "Men [de behöver inte fråga]! De skall snart få visshet.",
            "verse 78:5": "Ja, de skall sannerligen snart få visshet!",
            "verse 78:6": "HAR VI inte gjort jorden till en bädd [över vilken ni kan resa ert tält för att] få vila",
            "verse 78:7": "Och [har Vi inte gjort] bergen som tältpålar?",
            "verse 78:8": "Vi har skapat er i par, [män och kvinnor,]",
            "verse 78:9": "och Vi har skänkt er sömnen som ett avbrott för vila",
            "verse 78:10": "och gjort natten som ett täcke",
            "verse 78:11": "och dagen så att ni [kan se] att förtjäna ert bröd.",
            "verse 78:12": "Och Vi har välvt sju fast hopfogade [himlar] över er",
            "verse 78:13": "och [där] skapat en vitglödande lampa.",
            "verse 78:14": "Och Vi pressar ut vattnet ur regnmolnen i rikliga flöden",
            "verse 78:15": "och frambringar därmed säd och [annan] växtlighet",
            "verse 78:16": "och rikt blommande trädgårdar.",
            "verse 78:17": "TIDEN FÖR Åtskillnadens dag [då de goda skall skiljas från de onda] är fastställd.",
            "verse 78:18": "Det är den Dag då det skall stötas i basunen och ni skall skynda fram [ur gravarna] i myllrande massor,",
            "verse 78:19": "och himlen skall öppnas som [om den varit försedd med] portar",
            "verse 78:20": "och bergen skall tona bort som hägringar.",
            "verse 78:21": "Och helvetet som [ständigt] lurar på [offer]",
            "verse 78:22": "skall välkomna de trotsiga syndarna.",
            "verse 78:23": "Där skall de förbli under oöverskådlig tid",
            "verse 78:24": "utan att känna svalka och utan att få dricka",
            "verse 78:25": "annat än skållhett vatten och den motbjudande [vätska som sipprar ur ett sår], -",
            "verse 78:26": "en lön som svarar mot [deras handlingar]!",
            "verse 78:27": "De fruktade varken räkenskapen [eller domen]",
            "verse 78:28": "och de förkastade alla Våra budskap som lögn,",
            "verse 78:29": "men allt [vad de har gjort] har Vi fört upp i en bok.",
            "verse 78:30": "[Och Vi skall säga:] \"Smaka nu [frukten av era handlingar] - Vi skall [hädanefter] bara hopa nya lidanden över er!\"",
            "verse 78:31": "I sin triumf får de gudfruktiga glädjas åt",
            "verse 78:32": "lummiga parker och [spaljéer av] vindruvor",
            "verse 78:33": "och följeslagerskor, evigt unga som de själva,",
            "verse 78:34": "och bägare fyllda till brädden [med paradisets vin].",
            "verse 78:35": "Där skall de varken höra tomt och meningslöst tal eller lögner.",
            "verse 78:36": "[Detta är] din Herres belöning - som Han skänker enligt [Sin] räkning -",
            "verse 78:37": "Herren över himlarna och jorden och allt som är däremellan, den Nåderike! Ingen skall kunna tala till Honom",
            "verse 78:38": "den Dag då själarna och änglarna står uppställda på led och ingen tar till orda utom den som fått den Nåderikes tillåtelse och han säger inte annat än det som är rätt och sant.",
            "verse 78:39": "Så kommer Sanningens dag att vara. Låt då den som så vill, försöka finna vägen tillbaka till sin Herre [medan det är tid]!",
            "verse 78:40": "Vi har varnat er för ett straff som är nära förestående [och som kommer att drabba er] den Dag då människan ser [klart], vad hon har sänt framför sig [till Domen], och då den som förnekade sanningen skall säga: \"Ack, om jag nu hade varit mull och jord!\""
        },
        "Tajik": {
            "verse 78:1": "Аз чӣ чиз (ҳамдигарро) мепурсанд?",
            "verse 78:2": "Аз он хабари бузург, (қиёмат).",
            "verse 78:3": "ки дар он ихтилоф мекунанд.",
            "verse 78:4": "Оре, ба зудӣ хоҳад донист.",
            "verse 78:5": "Боз ҳам, оре, ба зудӣ хоҳанд донист!",
            "verse 78:6": "Оё Мо заминрро бистаре насохтем?",
            "verse 78:7": "Ва кӯҳҳоро мехҳое?",
            "verse 78:8": "Ва шуморо ҷуфт-ҷуфт офаридем.",
            "verse 78:9": "Ва хобатонро оссишатон гардонидем.",
            "verse 78:10": "Ва шабро пӯшишатон қарор додем.",
            "verse 78:11": "Ва рӯзро вақти талаби маъишат. (касб).",
            "verse 78:12": "Ва бар болои саратон ҳафт осмони устувор бино кардем.",
            "verse 78:13": "Ва чароғе равшан офаридем. (офтоб).",
            "verse 78:14": "Аз абрҳои боронзой обе фаровон нозил кардем,",
            "verse 78:15": "то бо он донаву набот бирӯёнем",
            "verse 78:16": "ва бӯстонҳои анбӯҳ (сердарахт).",
            "verse 78:17": "Албатта рӯзи доварӣ рӯзест муъайян.",
            "verse 78:18": "Рӯзе, ки дар сур дамида шавад, ва шумо гурӯҳгурӯҳ биёед.",
            "verse 78:19": "Осмон шикофта шавад ва ҳар шикоф даре бошад.",
            "verse 78:20": "Ва куҳҳо равон шаванд ва сароб гарданд.",
            "verse 78:21": "Ҷаҳаннам дар интизор бошад.",
            "verse 78:22": "Саркашонро бозгаштангоҳест.",
            "verse 78:23": "Замоне дароз дар он ҷо бошанд.",
            "verse 78:24": "На хунукӣ чашанду на об,",
            "verse 78:25": "фақат оби ҷӯшону хуну чирк. (нӯшанд).",
            "verse 78:26": "Ин ҷазоест мувофиқи кирдор.",
            "verse 78:27": "Зеро онон ба рӯзи ҳисоб умед надоштанд.",
            "verse 78:28": "Ва оёти Моро ба сахтӣ дурӯғ мебароварданд.",
            "verse 78:29": "Ва Мо ҳама чизро дар, китобе шумора кардаем.",
            "verse 78:30": "Пас бичашед, ки фақат бар азоби шумо хоҳем афзуд!",
            "verse 78:31": "Парҳезгоронро ҷоест дар амон аз ҳар осеб,",
            "verse 78:32": "бӯстонҳову токистонҳо",
            "verse 78:33": "ва духтароне ҳамсол бо пистонҳои баромада",
            "verse 78:34": "ва ҷомҳои пур.",
            "verse 78:35": "На сухани беҳуда шунаванд ва на дурӯғ",
            "verse 78:36": "ва ин мукофотест кофӣ аз ҷониби Парвардигорат—",
            "verse 78:37": "Парвардигори осмонҳову замин ва он чӣ миёни онҳост. Он Худои раҳмон, ки касро ба Ӯ ёрои хитоб набошад,",
            "verse 78:38": "рӯзе, ки рӯҳ ва фариштагон ба саф меистанд ва кас сухан намегӯяд, ғайри он ки Худои раҳмон ба ӯ рухсат диҳад, ва ӯ сухан ба савоб гӯяд.",
            "verse 78:39": "Он рӯз рӯзест омаданӣ. Пас ҳар кӣ хоҳад ба сӯи Парвардигораш бозгардад.",
            "verse 78:40": "Мо шуморо аз азобе наздик метарсонем: рӯзе, ки одамӣ ҳар чиро пешопеш фиристодааст, менигарад ва кофир мегӯяд: «Эй кош, ман хок мебудам!»"
        },
        "Tamil": {
            "verse 78:1": "எதைப்பற்றி அவர்கள் ஒருவருக்கொருவர் கேட்டுக்கொள்கின்றனர்?",
            "verse 78:2": "மகத்தான அச்செய்தியைப் பற்றி,",
            "verse 78:3": "எதைப்பற்றி அவர்கள் வேறுபட்(ட கருத்துக்கள் கொண்)டிருக்கிறார்களோ அதைப் பற்றி,",
            "verse 78:4": "அவ்வாறன்று! அவர்கள் விரைவில் அறிந்துகொள்வார்கள்.",
            "verse 78:5": "பின்னரும் (சந்தேகமின்றி) அவர்கள் விரைவிலேயே அறிந்துகொள்வார்கள்.",
            "verse 78:6": "நாம் இப்பூமியை விரிப்பாக ஆக்கவில்லையா?",
            "verse 78:7": "இன்னும், மலைகளை முளைகளாக ஆக்கவில்லையா?",
            "verse 78:8": "இன்னும் உங்களை ஜோடி ஜோடியாகப் படைத்தோம்.",
            "verse 78:9": "மேலும், உங்களுடைய தூக்கத்தை இளைப்பாறுதலாக ஆக்கினோம்.",
            "verse 78:10": "அன்றியும், இரவை உங்களுக்கு ஆடையாக ஆக்கினோம்.",
            "verse 78:11": "மேலும், பகலை உங்கள் வாழ்க்கை (வசதிகளைத் தேடிக்கொள்ளும் காலம்) ஆக்கினோம்.",
            "verse 78:12": "உங்களுக்குமேல் பலமான ஏழுவானங்களை உண்டாக்கினோம்.",
            "verse 78:13": "ஒளிவீசும் விளக்கை(சூரியனை)யும் (அங்கு) அமைத்தோம்.",
            "verse 78:14": "அன்றியும், கார்மேகங்களிலிருந்து பொழியும் மழையையும் இறக்கினோம்.",
            "verse 78:15": "அதைக் கொண்டு தானியங்களையும், தாவரங்களையும் நாம் வெளிப்படுத்துவதற்காக.",
            "verse 78:16": "(கிளைகளுடன்) அடர்ந்த சோலைகளையும் (வெளிப்படுத்துவதற்காக).",
            "verse 78:17": "நிச்சயமாகத் தீர்ப்புக்குரிய நாள், நேரங்குறிக்கப்பட்டதாகவே இருக்கிறது.",
            "verse 78:18": "ஸூர் (எக்காளம்) ஊதப்படும் அந்நாளில் நீங்கள் அணிஅணியாக வருவீர்கள்.",
            "verse 78:19": "இன்னும், வானம் திறக்கப்பட்டு பல வாசல்களாகிவிடும்.",
            "verse 78:20": "மலைகள் பெயர்க்கப்பட்டு கானல் நீராகிவிடும்.",
            "verse 78:21": "நிச்சயமாக நரகம் எதிர்பார்த்துக் கொண்டிருக்கின்றது.",
            "verse 78:22": "வரம்பு மீறிவர்களுக்குத் தங்குமிடமாக.",
            "verse 78:23": "அதில் அவர்கள் பல யுகங்களாகத் தங்கியிருக்கும் நிலையில்.",
            "verse 78:24": "அவர்கள் அதில் குளிர்ச்சியையோ, குடிப்பையோ சுவைக்கமாட்டார்கள்.",
            "verse 78:25": "கொதிக்கும் நீரையும் சீழையும் தவிர.",
            "verse 78:26": "(அதுதான் அவர்களுக்குத்) தக்க கூலியாகும்.",
            "verse 78:27": "நிச்சயமாக அவர்கள் கேள்வி கணக்கில் நம்பிக்கை கொள்ளாமலேயே இருந்தனர்.",
            "verse 78:28": "அன்றியும் அவர்கள் நம் வசனங்களைப் பொய்யெனக் கூறி பொய்யாக்கிக் கொண்டிருந்தார்கள்.",
            "verse 78:29": "நாம் ஒவ்வொரு பொருளையும் பதிவேட்டில் பதிவு செய்திருக்கின்றோம்.",
            "verse 78:30": "\"ஆகவே சுவையுங்கள் - வேதனையைத் தவிர வேறு எதனையும் உங்களுக்கு நாம் அதிகப் படுத்த மாட்டோம்\" (என்று அவர்களுக்குக் கூறப்படும்).",
            "verse 78:31": "நிச்சயமாக பயபக்தியுடையவர்களுக்கு வெற்றிப் பாக்கியம் இருக்கிறது.",
            "verse 78:32": "தோட்டங்களும், திராட்சைப் பழங்களும்.",
            "verse 78:33": "ஒரே வயதுள்ள கன்னிகளும்.",
            "verse 78:34": "பானம் நிறைந்த கிண்ணங்களும், (இருக்கின்றன).",
            "verse 78:35": "அங்கு அவர்கள் வீணானவற்றையும், பொய்ப்பித்தலையும் கேட்கமாட்டார்கள்.",
            "verse 78:36": "(இது) உம்முடைய இறைவனிடமிருந்து (அளிக்கப் பெறும்) கணக்குப் படியான நன்கொடையாகும்.",
            "verse 78:37": "(அவனே) வானங்களுக்கும், பூமிக்கும் அவ்விரண்டிற்கும் இடையேயுள்ள வற்றிற்கும் இறைவன்; அர்ரஹ்மான் - அவனிடம் பேச எவரும் அதிகாரம் பெறமாட்டார்கள்.",
            "verse 78:38": "ரூஹு (என்ற ஜிப்ரயீலு)ம், மலக்குகளும் அணியணியாக நிற்கும் நாளில் அர்ரஹ்மான் எவருக்கு அனுமதி கொடுகிறானோ அவர்களைத் தவிர்த்து வேறெவரும் பேசமாட்டார்கள் - அ(த்தகைய)வரும் நேர்மையானதையே கூறுவார்.",
            "verse 78:39": "அந்நாள் சத்தியமானது. ஆகவே, எவர் விரும்புகிறாரோ, அவர் தம் இறைவனிடம் தங்குமிடத்தை ஏற்படுத்திக் கொள்வாராக.",
            "verse 78:40": "நிச்சயமாக, நெருங்கி வரும் வேதனையைப்பற்றி உங்களுக்கு எச்சரிக்கை செய்கிறோம் - மனிதன் தன் இருகைகளும் செய்து முற்படுத்தியவற்றை - அமல்களை - அந்நாளில் கண்டு கொள்வான் - மேலும் காஃபிர் \"அந்தோ கைசேதமே! நான் மண்ணாகிப் போயிருக்க வேண்டுமே!\" என்று (பிரலாபித்துக்) கூறுவான்."
        },
        "Tatar": {
            "verse 78:1": "Мәккә мөшрикләре нәрсәдән сорашалар? Мухәммәд г-м кыямәт хакында сөйләгәч: \"Мухәммәд нәрсә сөйли\", – дип бер-берсеннән сораштылар\".",
            "verse 78:2": "Алар олугъ кыямәт хәбәреннән һәм ахирәтнең барча хәленнән\" хәбәр бирүче Коръәннән сорашалар.",
            "verse 78:3": "Кыямәт һәм Коръән хакында дөньядагы кешеләр төрле фикердәләр.",
            "verse 78:4": "Юк әле тыныч кына тормасыннар, кыямәткә һәм Коръәнгә ышанмауларының ахыры кайда барганын тиздән белерләр.",
            "verse 78:5": "Моның соңында тиздән белерләр ышанмаулары, кабахәт эш икәнлеген!",
            "verse 78:6": "Әйә җирне аларга торырга яраклы кылмадыммы.",
            "verse 78:7": "Дәхи селкенмәсен өчен тауларны җиргә кадак кылмадыммы.",
            "verse 78:8": "Дәхи сезне ирле-хатынлы итеп халык кылдык.",
            "verse 78:9": "Дәхи йокыны тәннәрегезгә истирахәт кылдык.",
            "verse 78:10": "Дәхи төнне сезгә пәрдә кылдык.",
            "verse 78:11": "Дәхи көндезне тереклегегез өчен кәсеп кылырга якты кылдык.",
            "verse 78:12": "Дәхи өстегездә җиде кат мәхкәм күкләрне бина кылдык.",
            "verse 78:13": "Дәхи бик яктыртучы һәм җылы бирүче кояшны халык кылдык.",
            "verse 78:14": "Дәхи болытлардан бере артыннан бере коелучы яңгыр суын иңдердек.",
            "verse 78:15": "Ул су белән төрле икмәк орлыкларын вә төрле үләннәрне.",
            "verse 78:16": "Вә агачларны, бер-берсенә уралып үскән җимеш бакчаларын үстермәклегебез өчен.",
            "verse 78:17": "Тәхкыйк хакны батылдан аера торган көн сәваб вә ґәзаб вәгъдә ителгән көндер.",
            "verse 78:18": "Бер көнне сурда өрелер дә, хисаб өчен төркем-төркем булып килерсез.",
            "verse 78:19": "Күк ачылыр да, анда ишекләре булыр.",
            "verse 78:20": "Дәхи таулар йөртелерләр, тузган тузан кеби булырлар.",
            "verse 78:21": "Тәхкыйк җәһәннәм үтә торган юл булды (Җәннәткә керәсе кешеләр дә җәһәннәмне күреп үтерләр).",
            "verse 78:22": "Ул җәһәннәм хактан качып азганнарга тора торган урын булды.",
            "verse 78:23": "Алар җәһәннәмдә күп заманалар торырлар.",
            "verse 78:24": "Алар анда салкын рәхәтлекне һәм яхшы эчемлекне татымаслар.",
            "verse 78:25": "Мәгәр кайнар яман суны һәм җәһәннәм кешеләренең тәннәреннән аккан сары суны эчәрләр.",
            "verse 78:26": "Бу җәза аларга гөнаһларына күрә тиешле җәза итеп бирелде.",
            "verse 78:27": "Тәхкыйк алар кыямәттә булачак хисабны көтми һәм ышанмый иделәр.",
            "verse 78:28": "Дәхи Безнең аятьләребезне ныклап ялганга тоталар иде.",
            "verse 78:29": "Вә һәрнәрсәне санадык өммүл китапта язып.",
            "verse 78:30": "Татыгыз ґәзабны ґәзабка мөстәхыйк кешеләр, сезгә, әлбәттә, ґәзабтан башканы арттырмабыз.",
            "verse 78:31": "Котылу һәм өстенлек, әлбәттә, Аллаһудан куркып гөнаһлардан сакланучы тәкъва мөэминнәргәдер.",
            "verse 78:32": "Дәхи аларга җимеш бакчалары һәм йөземнәр.",
            "verse 78:33": "Дәхи аларга яшьтәш булган яшь кызлар.",
            "verse 78:34": "Дәхи эчемлекләр тутырылган савытлар.",
            "verse 78:35": "Алар анда буш сүзне һәм ялган сүзне ишетмәсләр.",
            "verse 78:36": "Раббыңнан изге гамәлләре өчен җәзадыр, мәңгелеккә җитәргә хисаплап бирелгән бүләктер.",
            "verse 78:37": "Ул Раббың җир вә күкләрнең, дәхи җир илә күкләр арасында булган нәрсәләрнең Раббысыдыр, рәхмәтенә һәрнәрсәне сыйдыргандыр. Хисаб көнендә кешеләр бер-берсенә дәшергә, бер кирәк сүзне әйтергә кадир булмаслар.",
            "verse 78:38": "Хисаб көнендә Җәбраил г-м һәм башка фәрештәләр сафта тезелеп торырлар, сөйләшмәсләр, мәгәр Аллаһ изен биргән яки дөньяда чакта Аллаһ риза булырдай яхшы сүзләрне сөйләгән кеше генә сөйләр.",
            "verse 78:39": "Бу көннең булачагы, әлбәттә хак, теләгән кеше үзенә тәүбә истигъфар һәм итагать белән Аллаһуга кайта торган юлны алыр.",
            "verse 78:40": "Тәхкыйк сезне куркыттык якын һәм хак булган кыямәт ґәзабы белән, ул көндә һәркем үзеннән алда җибәргән гамәл дәфтәренә карар, Коръәнне инкяр итүче яки аның илә гамәл кылмаучы кәфер әйтер: \"Әгәр мин туфрак булсамчы\", – дип. (Хисаб, хөкем соңында Аллаһ хайваннарны туфрак итәр. Кәферләр дә үзләренең туфрак булуларын теләрләр, ләкин туфрак\" була алмаслар.)"
        },
        "Telugu": {
            "verse 78:1": "ఏ విషయాన్ని గురించి వారు (ఒకరినొకరు) ప్రశ్నించుకుంటున్నారు",
            "verse 78:2": "ఆ మహా వార్తను గురించేనా",
            "verse 78:3": "దేనిని గురించైతే వారు భేదాభిప్రాయాలను కలిగి ఉన్నారో",
            "verse 78:4": "అది కాదు! వారు త్వరలోనే దానిని తెలుసుకోగలరు",
            "verse 78:5": "ఎంత మాత్రము కాదు! వారు త్వరలోనే దానిని తెలుసుకోగలరు",
            "verse 78:6": "ఏమీ? మేము భూమిని పరుపుగా చేయలేదా",
            "verse 78:7": "మరియు పర్వతాలను మేకులుగా",
            "verse 78:8": "మరియు మేము మిమ్మల్ని (స్త్రీ-పురుషుల) జంటలుగా సృష్టించాము",
            "verse 78:9": "మరియు మేము నిద్రను, మీకు విశ్రాంతి నిచ్చేదిగా చేశాము",
            "verse 78:10": "మరియు రాత్రిని ఆచ్ఛాదనగా చేశాము",
            "verse 78:11": "మరియు పగటిని జీవనోపాధి సమయంగా చేశాము",
            "verse 78:12": "మరియు మేము మీపైన పటిష్టమైన ఏడు (ఆకాశాలను) నిర్మించాము",
            "verse 78:13": "మరియు (అందులో) ప్రకాశించే దీపాన్ని (సూర్యుణ్ణి) ఉంచాము",
            "verse 78:14": "మరియు మేఘాల నుండి ధారాపాతంగా వర్షాన్ని కురిపించాము",
            "verse 78:15": "దానితో మేము ధాన్యం మరియు పచ్చికను (చెట్లు చేమలను) పెరిగించటానికి",
            "verse 78:16": "మరియు దట్టమైన తోటలను",
            "verse 78:17": "నిశ్చయంగా, తీర్పుదినం ఒక నిర్ణీత సమయం",
            "verse 78:18": "ఆ రోజు బాకా ఊదబడినప్పుడు! అప్పుడు మీరంతా గుంపులు గుంపులుగా లేచి వస్తారు",
            "verse 78:19": "మరియు ఆకాశం తెరువబడుతుంది, అందులో ద్వారాలు ఏర్పడుతాయి",
            "verse 78:20": "మరియు పర్వతాలు ఎండమావులుగా అదృశ్యమై పోతాయి",
            "verse 78:21": "నిశ్చయంగా, నరకం ఒక మాటు",
            "verse 78:22": "ధిక్కారుల గమ్యస్థానం",
            "verse 78:23": "అందులో వారు యుగాల తరబడి ఉంటారు",
            "verse 78:24": "అందులో వారు ఎలాంటి చల్లదనాన్ని గానీ మరియు (చల్లని) పానీయాన్ని గానీ చవి చూడరు",
            "verse 78:25": "సలసల కాగే నీరు మరియు చీము లాంటి మురికి (పానీయం) తప్ప",
            "verse 78:26": "(వారి కర్మలకు) తగిన పూర్తి ప్రతిఫలంగా",
            "verse 78:27": "వాస్తవానికి వారు లెక్క తీసుకోబడుతుందని ఆశించలేదు",
            "verse 78:28": "పైగా వారు మా సూచనలను (ఆయాత్ లను) అసత్యాలని తిరస్కరించారు",
            "verse 78:29": "మరియు మేము (వారు చేసిన) ప్రతిదానిని ఒక పుస్తకంలో వ్రాసి పెట్టాము",
            "verse 78:30": "కావున మీరు (మీ కర్మల ఫలితాన్ని) చవి చూడండి. ఎందుకంటే, మేము మీకు శిక్ష తప్ప మరేమీ అధికం చేయము",
            "verse 78:31": "నిశ్చయంగా, దైవభీతి గలవారికి సాఫల్యం (స్వర్గం) ఉంది",
            "verse 78:32": "ఉద్యానవనాలూ, ద్రాక్ష తోటలూ",
            "verse 78:33": "మరియు ఈడూజోడూ గల (యవ్వన) సుందర కన్యలు",
            "verse 78:34": "మరియు నిండి పొర్లే (మధు) పాత్ర",
            "verse 78:35": "అందులో (స్వర్గంలో) వారు ఎలాంటి వ్యర్థపు మాటలు గానీ, అసత్యాలు గానీ వినరు",
            "verse 78:36": "(ఇదంతా) నీ ప్రభువు తరఫు నుండి లభించే ప్రతిఫలం, చాలినంత బహుమానం",
            "verse 78:37": "భూమ్యాకాశాలు మరియు వాటి మధ్య ఉన్న సమస్తానికీ ప్రభువైన అనంత కరుణామయుని (బహుమానం), ఆయన ముందు మాట్లాడే సాహసం ఎవ్వరికీ లేదు",
            "verse 78:38": "ఏ రోజునయితే ఆత్మ (జిబ్రీల్) మరియు దేవదూతలు వరుసలలో నిలిచి ఉంటారో! అప్పుడు ఆ అనంత కరుణామయుడు అనుమతించిన వాడు తప్ప, మరెవ్వరూ మాట్లాడలేరు; ఒకవేళ ఎవడైనా మాట్లాడినా అతడు సరైన మాటే మాట్లాడుతాడు",
            "verse 78:39": "అదే అంతిమ సత్యదినం. కావున ఇష్టమున్నవాడు, తన ప్రభువు వైపునకు చేరే మార్గాన్ని అవలంబించాలి",
            "verse 78:40": "నిశ్చయంగా, మేము అతని సమీపంలో ఉన్న శిక్షను గురించి మిమ్మల్ని హెచ్చరించాము. ఆ రోజు ప్రతి మనిషి తన చేజేతులా చేసుకొని ముందు పంపుకున్నదంతా ప్రత్యక్షంగా చూసుకుంటాడు. మరియు సత్యతిరస్కారి: అయ్యో! నా పాడుగాను! నేను మట్టినయి ఉంటే ఎంత బాగుండేది!\" అని వాపోతాడు"
        },
        "Thai": {
            "verse 78:1": "พวกเขาต่างถามกันถึงเรื่องอะไร ?",
            "verse 78:2": "(ถาม) ถึงข่าวอันยิ่งใหญ่สำคัญ",
            "verse 78:3": "ซึ่งเป็นข่าวที่พวกเขาขัดแย้งกันอยู่",
            "verse 78:4": "เปล่าเลย พวกเขาจะได้รู้",
            "verse 78:5": "แล้วก็เปล่าเลย พวกเขาจะได้รู้",
            "verse 78:6": "เรามิได้ทำให้แผ่นดินเป็นพื้นราบดอกหรือ ?",
            "verse 78:7": "และมิได้ให้เทือกเขาเป็นหลักตรึงไว้ดอกหรือ ?",
            "verse 78:8": "และเราได้บังเกิดพวกเจ้าให้เป็นคู่ครองกัน",
            "verse 78:9": "และเราได้ทำให้การนอนของพวกเจ้าเป็นการพักผ่อน",
            "verse 78:10": "และเราได้ทำให้กลางคืนคล้ายเครื่องปกปิดร่างกาย",
            "verse 78:11": "และเราได้ทำให้กลางวันเป็นที่แสวงหาเครื่องยังชีพ",
            "verse 78:12": "และเราได้สร้างไว้เหนือพวกเจ้าสิ่งที่แข็งแรงทั้งเจ็ด (ชั้นฟ้า)",
            "verse 78:13": "และเราได้ทำให้มีดวงประทีปหนึ่งที่มีแสงสว่างจ้า",
            "verse 78:14": "และเราได้หลั่งน้ำลงมาอย่างมากมายมากเมฆฝน",
            "verse 78:15": "เพื่อว่าเราจะให้งอกเงยด้วยน้ำนั้นซึ่งเมล็ดพืช และพืชผัก",
            "verse 78:16": "และบรรดาเรือกสวนอันหนาแน่น",
            "verse 78:17": "แท้จริงวันแห่งการตัดสินนั้นเป็นเวลาที่ถูกกำหนดไว้",
            "verse 78:18": "วันที่แตรจะถูกเป่า แล้วพวกเจ้าก็จะมากันเป็นหมู่ ๆ",
            "verse 78:19": "และชั้นฟ้าจะถูกเปิดออก แล้วก็จะมีประตูหลายบาน",
            "verse 78:20": "และเทือกเขาจะถูกให้เคลื่อนออกไปแล้วก็กลายเป็นภาพลวง",
            "verse 78:21": "แท้จริงนรกญะฮันนัมนั้นเป็นที่สอดส่อง",
            "verse 78:22": "เป็นที่กลับไปสำหรับบรรดาผู้ละเมิด",
            "verse 78:23": "พวกเขาจะพำนักอยู่ในนั้นเป็นเวลานาน",
            "verse 78:24": "พวกเขาจะไม่ได้ลิ้มรสความเย็นและเครื่องดื่มใด ๆ ในนรกนั้น",
            "verse 78:25": "นอกจากน้ำเดือด และน้ำเลือดน้ำหนองเท่านั้น",
            "verse 78:26": "ทั้งนี้เป็นการตอบแทนอย่างคู่ควร",
            "verse 78:27": "เพราะพวกเขามิได้หวังว่าจะมีการชำระสอบสวน",
            "verse 78:28": "และพวกเขาปฏิเสธสัญญาณต่าง ๆ ของเราอย่างสิ้นเชิง",
            "verse 78:29": "และทุก ๆ สิ่งนั้นเราได้จารึกมันไว้อย่างครบถ้วนในบันทึก",
            "verse 78:30": "ดังนั้น พวกเจ้าจงลิ้มรส (การลงโทษ) เถิด เราจะไม่เพิ่มอันใดแก่พวกเจ้านอกจากการทรมานเท่านั้น",
            "verse 78:31": "แท้จริงสำหรับบรรดาผู้ยำเกรงนั้น จะได้รับชัยชนะ",
            "verse 78:32": "เรือกสวนหลากหลายและองุ่น",
            "verse 78:33": "และบรรดาสาววัยรุ่นที่มีอายุคราวเดียวกัน",
            "verse 78:34": "และแก้วที่มีเครื่องดื่มเต็มเปี่ยม",
            "verse 78:35": "ในสวนสวรรค์นั้นพวกเขาจะไม่ได้ยินคำพูดไร้สาระและคำกล่าวเท็จ",
            "verse 78:36": "ทั้งนี้เป็นการตอบแทนจากพระเจ้าของเจ้าเป็นการประทานให้อย่างพอเพียง",
            "verse 78:37": "พระเจ้าแห่งชั้นฟ้าทั้งหลายและแผ่นดิน และสิ่งที่อยู่ในระหว่างทั้งสอง คือพระผู้ทรงกรุณาปรานี พวกเขาไม่มีอำนาจที่จะกล่าวคำพูดใด ๆ ต่อพระองค์",
            "verse 78:38": "วันซึ่งญิบริลและมะลาอิกะฮฺจะยืนเป็นแถวเดียวกัน พวกเขาจะไม่พูด นอกจากผู้ที่พระผู้ทรงกรุณาปรานีทรงอนุญาตให้แก่เขาและเขาจะพูดแต่สิ่งที่ถูกต้องเท่านั้น",
            "verse 78:39": "นั่นคือวันแห่งความจริง ดังนั้นผู้ใดประสงค์ก็ให้เขายึดทางกลับไปสู่พระเจ้าของเขาเถิด",
            "verse 78:40": "แท้จริงเราได้เตือนพวกเจ้าแล้วถึงการลงโทษอันใกล้ วันที่มนุษย์จะมองไปยังสิ่งที่สองมือของเขาได้ประกอบไว้ และผู้ปฏิเสธศรัทธาจะกล่าวว่า โอ้..ถ้าฉันเป็นฝุ่นดินเสียก็จะดี"
        },
        "Turkish": {
            "verse 78:1": "Neyi soruşturuyorlar?",
            "verse 78:2": "Üzerinde anlaşmazlığa düştükleri, büyük bir olay olan tekrar dirilme haberini mi?",
            "verse 78:3": "Üzerinde anlaşmazlığa düştükleri, büyük bir olay olan tekrar dirilme haberini mi?",
            "verse 78:4": "Hayır; şüphesiz görüp bileceklerdir.",
            "verse 78:5": "Yine hayır; elbette görüp bileceklerdir.",
            "verse 78:6": "Biz yeryüzünü bir beşik, dağları da onun için birer direk kılmadık mı?",
            "verse 78:7": "Biz yeryüzünü bir beşik, dağları da onun için birer direk kılmadık mı?",
            "verse 78:8": "Sizi çift çift yarattık;",
            "verse 78:9": "Uykunuzu dinlenme vakti kıldık;",
            "verse 78:10": "Geceyi bir örtü yaptık;",
            "verse 78:11": "Gündüzü geçimi sağlama vakti kıldık;",
            "verse 78:12": "Üstünüze yedi kat sağlam gök bina ettik;",
            "verse 78:13": "Parlak ışık veren güneşi varettik;",
            "verse 78:14": "Taneler, bitkiler, ağaçları sarmaş dolaş bahçeler yetiştirmek için, yoğunlaşmış bulutlardan bol yağmur yağdırdık.",
            "verse 78:15": "Taneler, bitkiler, ağaçları sarmaş dolaş bahçeler yetiştirmek için, yoğunlaşmış bulutlardan bol yağmur yağdırdık.",
            "verse 78:16": "Taneler, bitkiler, ağaçları sarmaş dolaş bahçeler yetiştirmek için, yoğunlaşmış bulutlardan bol yağmur yağdırdık.",
            "verse 78:17": "Doğrusu, hüküm gününün vakti elbette tesbit edilmiştir.",
            "verse 78:18": "Sura üfürüldüğü gün hepiniz bölük bölük gelirsiniz.",
            "verse 78:19": "Gökler kapı kapı açılacaktır.",
            "verse 78:20": "Dağlar yürütülüp serap olacaktır.",
            "verse 78:21": "Cehennem, yalnız azgınları bekleyen yerdir. Dönecekleri yer orasıdır.",
            "verse 78:22": "Cehennem, yalnız azgınları bekleyen yerdir. Dönecekleri yer orasıdır.",
            "verse 78:23": "Orada çağlar boyunca (nice devirler) kalacaklardır.",
            "verse 78:24": "Orada ne serinlik ne de içilecek bir şey tatmazlar; sadece kaynar su ve irin....",
            "verse 78:25": "Orada ne serinlik ne de içilecek bir şey tatmazlar; sadece kaynar su ve irin....",
            "verse 78:26": "Orada ne serinlik ne de içilecek bir şey tatmazlar; sadece kaynar su ve irin....",
            "verse 78:27": "Çünkü onlar, hesaba çekileceklerini sanmazlardı.",
            "verse 78:28": "Ayetlerimizi hep yalan sayıp dururlardı.",
            "verse 78:29": "Biz de herşeyi yazıp saymışızdır.",
            "verse 78:30": "Şöyle deriz: \"Artık tadınız, bundan böyle size azabdan başka bir şey artırmayız.\"",
            "verse 78:31": "Doğrusu, Allah'a karşı gelmekten sakınanlara kurtuluş, bahçeler, bağlar, yaşıtlar ve dolu kadehler vardır.",
            "verse 78:32": "Doğrusu, Allah'a karşı gelmekten sakınanlara kurtuluş, bahçeler, bağlar, yaşıtlar ve dolu kadehler vardır.",
            "verse 78:33": "Doğrusu, Allah'a karşı gelmekten sakınanlara kurtuluş, bahçeler, bağlar, yaşıtlar ve dolu kadehler vardır.",
            "verse 78:34": "Doğrusu, Allah'a karşı gelmekten sakınanlara kurtuluş, bahçeler, bağlar, yaşıtlar ve dolu kadehler vardır.",
            "verse 78:35": "Orada boş ve yalan söz işitmezler.",
            "verse 78:36": "Bunlar Rabbinin katından, hesabları karşılığı verilenlerdir.",
            "verse 78:37": "O, göklerin, yerin ve ikisi arasında olanların Rabbidir. O, önünde kimsenin konuşmayacağı Rahman olan Allah'tır.",
            "verse 78:38": "Cebrail ve meleklerin dizi dizi durdukları gün, Rahman olan Allah'ın izni olmadan kimse konuşamayacaktır. Konuştuğu zaman da doğruyu söyleyecektir.",
            "verse 78:39": "İşte gerçek gün budur. Dileyen kimse, Rabbine götürecek bir yol benimser.",
            "verse 78:40": "Sizi, yakın gelecekteki bir azabla uyardık; o gün kişi elleriyle sunduğuna bakar ve inkarcı da: \"Keşke toprak olaydım\" der."
        },
        "Urdu": {
            "verse 78:1": "(یہ) لوگ کس چیز کی نسبت پوچھتے ہیں؟",
            "verse 78:2": "(کیا) بڑی خبر کی نسبت؟",
            "verse 78:3": "جس میں یہ اختلاف کر رہے ہیں",
            "verse 78:4": "دیکھو یہ عنقریب جان لیں گے",
            "verse 78:5": "پھر دیکھو یہ عنقریب جان لیں گے",
            "verse 78:6": "کیا ہم نے زمین کو بچھونا نہیں بنایا",
            "verse 78:7": "اور پہاڑوں کو (ا س کی) میخیں (نہیں ٹھہرایا؟)",
            "verse 78:8": "(بے شک بنایا) اور تم کو جوڑا جوڑابھی پیدا کیا",
            "verse 78:9": "اور نیند کو تمہارے لیے (موجب) آرام بنایا",
            "verse 78:10": "اور رات کو پردہ مقرر کیا",
            "verse 78:11": "اور دن کو معاش (کا وقت) قرار دیا",
            "verse 78:12": "اور تمہارے اوپر سات مضبوط (آسمان) بنائے",
            "verse 78:13": "اور (آفتاب کا) روشن چراغ بنایا",
            "verse 78:14": "اور نچڑتے بادلوں سے موسلا دھار مینہ برسایا",
            "verse 78:15": "تاکہ اس سے اناج اور سبزہ پیدا کریں",
            "verse 78:16": "اور گھنے گھنے باغ",
            "verse 78:17": "بےشک فیصلہ کا دن مقرر ہے",
            "verse 78:18": "جس دن صور پھونکا جائے گا تو تم لوگ غٹ کے غٹ آ موجود ہو گے",
            "verse 78:19": "اور آسمان کھولا جائے گا تو (اس میں) دروازے ہو جائیں گے",
            "verse 78:20": "اور پہاڑ چلائے جائیں گے تو وہ ریت ہو کر رہ جائیں گے",
            "verse 78:21": "بےشک دوزخ گھات میں ہے",
            "verse 78:22": "(یعنی) سرکشوں کا وہی ٹھکانہ ہے",
            "verse 78:23": "اس میں وہ مدتوں پڑے رہیں گے",
            "verse 78:24": "وہاں نہ ٹھنڈک کا مزہ چکھیں گے۔ نہ (کچھ) پینا (نصیب ہو گا)",
            "verse 78:25": "مگر گرم پانی اور بہتی پیپ",
            "verse 78:26": "(یہ) بدلہ ہے پورا پورا",
            "verse 78:27": "یہ لوگ حساب (آخرت) کی امید ہی نہیں رکھتے تھے",
            "verse 78:28": "اور ہماری آیتوں کو جھوٹ سمجھ کر جھٹلاتے رہتے تھے",
            "verse 78:29": "اور ہم نے ہر چیز کو لکھ کر ضبط کر رکھا ہے",
            "verse 78:30": "سو (اب) مزہ چکھو۔ ہم تم پر عذاب ہی بڑھاتے جائیں گے",
            "verse 78:31": "بے شک پرہیز گاروں کے لیے کامیابی ہے",
            "verse 78:32": "(یعنی) باغ اور انگور",
            "verse 78:33": "اور ہم عمر نوجوان عورتیں",
            "verse 78:34": "اور شراب کے چھلکتے ہوئے گلاس",
            "verse 78:35": "وہاں نہ بیہودہ بات سنیں گے نہ جھوٹ (خرافات)",
            "verse 78:36": "یہ تمہارے پروردگار کی طرف سے صلہ ہے انعام کثیر",
            "verse 78:37": "وہ جو آسمانوں اور زمین اور جو ان دونوں میں ہے سب کا مالک ہے بڑا مہربان کسی کو اس سے بات کرنے کا یارا نہیں ہوگا",
            "verse 78:38": "جس دن روح (الامین) اور فرشتے صف باندھ کر کھڑے ہوں گے تو کوئی بول نہ سکے گا مگر جس کو (خدائے رحمٰن) اجازت بخشے اور اس نے بات بھی درست کہی ہو",
            "verse 78:39": "یہ دن برحق ہے۔ پس جو شخص چاہے اپنے پروردگار کے پاس ٹھکانہ بنا ئے",
            "verse 78:40": "ہم نے تم کو عذاب سے جو عنقریب آنے والا ہے آگاہ کر دیا ہے جس دن ہر شخص ان (اعمال) کو جو اس نے آگے بھیجے ہوں گے دیکھ لے گا اور کافر کہے گا کہ اے کاش میں مٹی ہوتا"
        },
        "Uyghur": {
            "verse 78:1": "(مۇشرىكلار ئۆزئارا نېمە توغرۇلۇق) سورىشىدۇ؟",
            "verse 78:2": "ئۇلار چوڭ بىر خەۋەر (يەنى قىيامەت توغرۇلۇق) سورىشىدۇ",
            "verse 78:3": "ئۇلار شۇ (يەنى قىيامەت) توغرىسىدا ئىختىلاپ قىلىشقۇچىلاردۇر",
            "verse 78:4": "ھەرگىز ئۇنداق ئەمەس (قىيامەت ئۇلارنىڭ ئويلىغىنىدەك يالغان ئەمەس)، ئۇلار (ھەقىقىي ئەھۋالنى) كەلگۈسىدە بىلىدۇ",
            "verse 78:5": "ھەرگىز ئۇنداق ئەمەس، ئۇلار (بېشىغا كەلگەن ئازابنى) كەلگۈسىدە بىلىدۇ",
            "verse 78:6": "(زېمىننىڭ ئۈستىدە مۇقىملىشىشىڭلار ۋە كەڭ تۈزلەڭلىكلەرگە زىرائەت تېرىپ پايدىلىنىشىڭلار ئۈچۈن) زېمىننى بىسات قىلمىدۇقمۇ؟",
            "verse 78:7": "(زېمىننىڭ تەۋرەپ كەتمەسلىكى ئۈچۈن) تاغلارنى قوزۇق قىلمىدۇقمۇ؟",
            "verse 78:8": "سىلەرنى ئەر - ئايال قىلىپ ياراتتۇق",
            "verse 78:9": "ئۇيقۇنى سىلەرنىڭ (بەدىنىڭلار ئۈچۈن) راھەت قىلدۇق",
            "verse 78:10": "كېچىنى لىباس قىلدۇق",
            "verse 78:11": "كۈندۈزنى (سىلەر) تىرىكچىلىك قىلىدىغان (ۋاقىت) قىلدۇق",
            "verse 78:12": "ئۈستۈڭلاردا مۇستەھكەم يەتتە ئاسماننى بىنا قىلدۇق",
            "verse 78:13": "(سىلەر ئۈچۈن) يېنىپ تۇرغان چىراغنى (كۈننى) ياراتتۇق",
            "verse 78:14": "ئاشلىقلارنى، ئوت - چۆپلەرنى، دەرەخلىرى قويۇق باغچىلارنى ئۆستۈرۈش ئۈچۈن بۇلۇتلاردىن مول ياغدۇرۇپ بەردۇق",
            "verse 78:15": "ئاشلىقلارنى، ئوت - چۆپلەرنى، دەرەخلىرى قويۇق باغچىلارنى ئۆستۈرۈش ئۈچۈن بۇلۇتلاردىن مول ياغدۇرۇپ بەردۇق",
            "verse 78:16": "ئاشلىقلارنى، ئوت - چۆپلەرنى، دەرەخلىرى قويۇق باغچىلارنى ئۆستۈرۈش ئۈچۈن بۇلۇتلاردىن مول ياغدۇرۇپ بەردۇق",
            "verse 78:17": "قىيامەت كۈنى ھەقىقەتەن (مۇكاپاتلاش ۋە جازالاش) ۋاقتىدۇر",
            "verse 78:18": "ئۇ كۈنى سۇر چېلىنىدۇ، سىلەر توپ - توپ بولۇپ كېلىسىلەر",
            "verse 78:19": "ئاسمان ئېچىلىپ نۇرغۇن ئىشىكلەر پەيدا بولىدۇ",
            "verse 78:20": "تاغلار ھەرىكەتلەندۈرۈلۈپ سەررابتەك بولۇپ قالىدۇ (يەنى تاغلار توزۇپ يىراقتىن قارىغۇچىغا سۇدەك تۇيۇلىدۇ)",
            "verse 78:21": "جەھەننەم ھەقىقەتەن (كۇففارلارنى) كۈتۈپ تۇرىدۇ",
            "verse 78:22": "جەھەننەم، شۈبھىسىزكى، گۇناھكارلارنىڭ جايىدۇر",
            "verse 78:23": "ئۇلار جەھەننەمدە ئۇزاق مۇددەت قالىدۇ",
            "verse 78:24": "ئۇلار جەھەننەمدە (جەھەننەمنىڭ ھارارىتىنى يىنىكلىتىلگەن) بىرەر سۆرۈنلۈككە ۋە (تەشنالىقنى قاندۇرىدىغان) بىرەر ئىچىملىككە ئېرىشەلمەيدۇ",
            "verse 78:25": "ئۇلارنىڭ ئېرىشىدىغىنى پەقەت يۇقىرى ھارارەتلىك قايناقسۇ ۋە يىرىڭدىنلا ئىبارەت بولىدۇ",
            "verse 78:26": "بۇ (ئۇلارغا بېرىلىدىغان) مۇۋاپىق جازادۇر",
            "verse 78:27": "چۈنكى ئۇلار (قىلمىشلىرىدىن) ھېساب ئېلىنىشتىن قورقمايتتى",
            "verse 78:28": "ھەمدە بىزنىڭ ئايەتلىرىمىزنى قاتتىق ئىنكار قىلاتتى",
            "verse 78:29": "ھەر نەرسىنى تولۇق خاتىرىلەپ قويىمىز",
            "verse 78:30": "(ئۇلارغا ئېيتىمىزكى) «تېتىڭلار! سىلەرگە پەقەت ئازابنىلا زىيادە قىلىمىز»",
            "verse 78:31": "شۈبھىسىزكى، تەقۋادارلار نېمەتكە ئېرىشىدۇ",
            "verse 78:32": "(ئۇ نېمەت) باغلار، ئۈزۈملەردۇر",
            "verse 78:33": "تەڭتۇش قىزلاردۇر",
            "verse 78:34": "(شاراب بىلەن) تولدۇرۇلغان جاملاردۇر",
            "verse 78:35": "ئۇلار جەننەتتە يالغان سۆز، بىھۇدە سۆز ئاڭلىمايدۇ",
            "verse 78:36": "(ئەنە شۇلار) پەرۋەردىگارىڭنىڭ بەرگەن مۇكاپاتى، يېتەرلىك ئاتاسىدۇر",
            "verse 78:37": "ئۇ ئاسمانلارنىڭ، زېمىننىڭ ۋە ئۇلارنىڭ ئارىسىدىكى شەيئىلەرنىڭ پەرۋەردىگارىدۇر. ناھايىتى شەپقەتلىكتۇر. (ئۇ كۈندە ھېچ كىشى) ئۇنىڭغا سۆز قىلىشقا قادىر بولالمايدۇ",
            "verse 78:38": "جىبرىئىل ۋە پەرىشتىلەر سەپ بولۇپ تۇرۇپ كېتىدىغان كۈندە (يەنى قىيامەتتە)، ئۇلار (نىڭ ئارىسىدا) مېھرىبان اﷲ نىڭ ئىزنىگە ئېرىشكەن ۋە توغرا سۆزنى قىلغانلاردىن باشقا ھېچ ئەھەدىنىڭ سۆز قىلىشىغا بولمايدۇ",
            "verse 78:39": "ئەنە شۇ چوقۇم بولىدىغان كۈندۇر. كىمكى (ئىمان بىلەن، ياخشى ئەمەل بىلەن) پەرۋەردىگارىغا قايتىدىغان يولنى تۇتۇشنى خالىسا (تۇتسۇن)",
            "verse 78:40": "بىز سىلەرنى ھەقىقەتەن (يۈز بېرىشى) يېقىن ئازابتىن (يەنى ئاخىرەت ئازابىدىن) ئاگاھلاندۇردۇق، ئۇ كۈندە كىشى ئىلگىرى قىلغان ئەمەللىرىنى كۆرىدۇ. كاپىر: «كاشكى مەن تۇپراق بولۇپ كەتسەمچۇ!» دەيدۇ"
        },
        "Uzbek": {
            "verse 78:1": "Нима ҳақида сўрашади?",
            "verse 78:2": "Улкан, муҳим хабар ҳақида (сўрашади).",
            "verse 78:3": "Шундай хабарки, у(мушрик)лар) унинг ҳақида ихтилоф қиларлар.",
            "verse 78:4": "Йўқ! Улар тезда биларлар!",
            "verse 78:5": "Яна йўқ! Улар тезда биларлар!",
            "verse 78:6": "Ерни тўшаб қўймадикми?",
            "verse 78:7": "Ва тоғларни қозиқ (қилиб қўймадикми?).",
            "verse 78:8": "Ва сизларни жуфт қилиб яратдик.",
            "verse 78:9": "Ва уйқуларингизни роҳат қилиб қўйдик.",
            "verse 78:10": "Ва кечасини либос қилиб қўйдик.",
            "verse 78:11": "Ва кундузни тириклик қилдик.",
            "verse 78:12": "Тепаларнгизга етти мустаҳкам (осмон)ни бино қилдик.",
            "verse 78:13": "Ва шуъла таратувчи чироқ ҳам қилдик.",
            "verse 78:14": "Ва сиқилган(булут)лардан оқувчи сувлар туширдик.",
            "verse 78:15": "У(сув) билан дон ва наботот чиқаришимиз учун.",
            "verse 78:16": "Ва дарахтлари бир-бирига киришган бўстонлар.",
            "verse 78:17": "Албатта, ажрим куни вақти белгиланган эди.",
            "verse 78:18": "У кунда сурга пуфланур ва сизлар тўп-тўп бўлиб келурсизлар.",
            "verse 78:19": "Осмон ёрилиб, эшик-эшиклар очилур.",
            "verse 78:20": "Тоғлар ўрнидан кўчирилиб, саробга айланур.",
            "verse 78:21": "Албатта, жаҳаннам пойлаб турувчи эди.",
            "verse 78:22": "Туғёнга кетганларга қайтар жойдир.",
            "verse 78:23": "Улар унда замонлар бўйи қолувчилардир.",
            "verse 78:24": "Улар унда совуқни ҳам, шаробни ҳам татий олмаслар.",
            "verse 78:25": "Магар қайноқ сув ва йирингни (татирлар).",
            "verse 78:26": "Мувофиқ жазо ўлароқ.",
            "verse 78:27": "Чунки улар ҳисоб-китоб бўлишига ишонмасдилар.",
            "verse 78:28": "Ва Бизнинг оятлариимизни ёлғон дейишган эди, ёлғон!.",
            "verse 78:29": "Биз барча нарсани китобга жамлаб қўйганмиз.",
            "verse 78:30": "Бас, татиб кўринглар, сизларга азобдан бошқа ҳеч нарсани зиёда қилмасмиз.",
            "verse 78:31": "Албатта, тақводорларга ютуқ бордир:",
            "verse 78:32": "Боғ-роғлар, узумзорлар бордир.",
            "verse 78:33": "Ва янги бўйи етган бир хил ёшдаги қизлар бордир.",
            "verse 78:34": "Ва тўлдирилган қадаҳлар бордир.",
            "verse 78:35": "У ерда бекорчи гапларни ҳам, ёлғон гапларни ҳам эшитмаслар.",
            "verse 78:36": "Роббингдан мукофот, совға ҳисобидандир.",
            "verse 78:37": "У осмонлар, ер ва уларнинг орасидаги барча нарсаларнинг Роббиси, Роҳмандир, Унинг ҳузурида ҳеч ким хитоб қилишга қодир бўлмас.",
            "verse 78:38": "Ўша кунда Руҳ ва фаришталар саф бўлиб турадир. Роҳман изн берганлар ва тўғри сўзлаганлардан ўзгалар гапира олмаслар.",
            "verse 78:39": "У ҳақ кундир. Ким хоҳласа, ўз Роббисига қайтар йўл оладир.",
            "verse 78:40": "Албатта, Биз сизларни яқин келажакдаги азобдан қўрқитдик. У кунда, ҳар киши (қўли) тақдим қилган нарсага назар соладир. Ва кофир «кошки тупроқ бўлиб кетсам», –дейдир."
        },
        "Vietnamese": {
            "verse 78:1": "(Những kẻ đa thần), chúng hỏi nhau về điều gì?",
            "verse 78:2": "Về các nguồn tin vĩ đại.",
            "verse 78:3": "Các nguồn tin mà chúng tranh cãi nhau.",
            "verse 78:4": "Không, chúng sẽ biết.",
            "verse 78:5": "Không, rồi đây chúng thực sự sẽ biết.",
            "verse 78:6": "Chẳng phải TA đã làm cho mặt đất trải rộng (như một tấm thảm)?",
            "verse 78:7": "Và những quả núi như những cái trụ (giữ vững mặt đất)?",
            "verse 78:8": "TA đã tạo các ngươi thành từng cặp (nam và nữ).",
            "verse 78:9": "TA đã làm giấc ngủ của các ngươi thành (một phương tiện) nghỉ ngơi.",
            "verse 78:10": "TA đã tạo ra màn đêm thành y phục (che đậy phần kín của các ngươi).",
            "verse 78:11": "TA đã tạo ra ban ngày để các ngươi tìm kế sinh nhai.",
            "verse 78:12": "TA đã dựng phía trên các ngươi bảy tầng trời kiên cố, vững chắc.",
            "verse 78:13": "TA đã tạo ra một chiếc đèn sáng chói (mặt trời).",
            "verse 78:14": "TA đã ban xuống từ những đám mây chứa nước các cơn mưa.",
            "verse 78:15": "Để TA làm mọc ra các loại hạt và cây cối.",
            "verse 78:16": "Và những khu vườn xanh tươi và đa dạng.",
            "verse 78:17": "Thật vậy, Ngày Phân Loại đã được ấn định.",
            "verse 78:18": "Ngày mà tiếng còi sẽ được thổi lên và các ngươi sẽ lũ lượt kéo đến từng đoàn.",
            "verse 78:19": "(Ngày mà) bầu trời sẽ mở ra và sẽ trở thành những cánh cổng.",
            "verse 78:20": "(Ngày mà) những ngọn núi bị dời đi và trở thành một ảo ảnh.",
            "verse 78:21": "Thật vậy, Hỏa Ngục là một nơi phục kích.",
            "verse 78:22": "(Nó là) một nơi trở về cho những kẻ tội lỗi và sai quấy.",
            "verse 78:23": "(Những kẻ tội lỗi) sẽ ở trong đó mãi mãi.",
            "verse 78:24": "Trong Hỏa Ngục, chúng sẽ không tìm thấy sự mát lạnh cũng như không tìm thấy thức uống dễ chịu nào.",
            "verse 78:25": "Ngoại trừ loại nước cực sôi và chất mủ tanh hôi (từ các vết thương).",
            "verse 78:26": "Một khoản đền bù xứng đáng (cho những việc làm của chúng).",
            "verse 78:27": "Quả thật, chúng đã không quan tâm đến việc (chúng sẽ phải đối mặt với) việc phán xét.",
            "verse 78:28": "Chúng đã phủ nhận các Lời Mặc Khải của TA một cách hoàn toàn.",
            "verse 78:29": "Nhưng tất cả mọi điều đã được TA cho ghi vào quyển sổ.",
            "verse 78:30": "Vì vậy, các ngươi (hỡi những kẻ tội lỗi) hãy nếm (thành quả việc làm của các ngươi), và TA sẽ không thêm gì cho các ngươi ngoại trừ hình phạt.",
            "verse 78:31": "Những người ngoan đạo chắc chắn sẽ thành đạt.",
            "verse 78:32": "(Họ sẽ được ban cho) những ngôi vườn tươi xanh và các vườn nho.",
            "verse 78:33": "(Họ sẽ) có những nàng trinh nữ với bộ ngực đầy đặn cùng trang lứa (làm bạn đời).",
            "verse 78:34": "(Họ sẽ được phục vụ với) chiếc cốc đầy (rượu).",
            "verse 78:35": "Nơi đó, họ sẽ không còn nghe thấy lời sàm bậy và dối trá.",
            "verse 78:36": "Đó là một đền đáp từ Thượng Đế của ngươi (Thiên Sứ Muhammad), một món quà hào phóng.",
            "verse 78:37": "Không ai dám thốt ra lời nào trừ phi Thượng Đế của trời đất và mọi vạn vật, Đấng Nhân Từ cho phép.",
            "verse 78:38": "Ngày mà Ruh (Đại Thiên thần Jibril) và các Thiên Thần khác đứng thành hàng ngũ chỉnh tề. Không một ai được nói ngoại trừ Đấng Nhân Từ cho phép, và y chỉ nói sự thật.",
            "verse 78:39": "Đó là Ngày của sự thật. Vì vậy, người nào muốn thì hãy chọn lấy một nơi trở về với Thượng Đế của y.",
            "verse 78:40": "Quả Thật, TA đã cảnh báo các ngươi về một sự trừng phạt gần kề; Ngày mà một người sẽ thấy điều mà y đã gởi đi trước, và kẻ vô đức tin sẽ nói: “Ôi, ước gì mình là cát bụi!”"
        },
        "Yoruba": {
            "verse 78:1": "Nipa ki ni won n bira won leere na",
            "verse 78:2": "Nipa iro ikoko nla ni",
            "verse 78:3": "eyi ti won n yapa enu si",
            "verse 78:4": "Rara! Won n bo wa mo",
            "verse 78:5": "Leyin naa, ni ti ododo won n bo wa mo",
            "verse 78:6": "Nje Awa ko se ile ni ite bi",
            "verse 78:7": "ati awon apata ni eekan (fun ile)",
            "verse 78:8": "A si seda yin ni orisirisi (ako ati abo)",
            "verse 78:9": "A se oorun yin ni isinmi",
            "verse 78:10": "A tun se ale ni ibora",
            "verse 78:11": "A tun se osan ni (asiko fun) wiwa ije-imu",
            "verse 78:12": "A tun mo sanmo meje t’o lagbara soke yin",
            "verse 78:13": "A tun se oorun ni imole t’o n tan gbola",
            "verse 78:14": "Ati pe A so omi t’o n bo telera won kale lati inu awon esujo",
            "verse 78:15": "nitori ki A le fi mu koro eso ati irugbin jade",
            "verse 78:16": "pelu awon ogba t’o kun digbi fun nnkan oko",
            "verse 78:17": "Dajudaju ojo ipinya, o ni gbedeke akoko kan",
            "verse 78:18": "(Iyen ni) ojo ti won a fon fere oniwo fun ajinde. Eyin yo si maa wa nijo-nijo",
            "verse 78:19": "Won si maa si sanmo sile. O si maa di awon ilekun",
            "verse 78:20": "Won maa mu awon apata rin (bo si aye miiran). O si maa di ahunpeena",
            "verse 78:21": "Dajudaju ina Jahanamo, o lugo sile loju ona",
            "verse 78:22": "(O je) ibugbe fun awon alakoyo",
            "verse 78:23": "Won yoo maa gbe inu re fun igba gbooro",
            "verse 78:24": "Won ko nii ri itura tabi ohun mimu kan towo ninu re",
            "verse 78:25": "ayafi omi gbigbona ati awoyunweje",
            "verse 78:26": "(O je) esan t’o se weku (ise won)",
            "verse 78:27": "Dajudaju won ki i reti isiro-ise",
            "verse 78:28": "Won si pe awon ayah Wa niro gan-an",
            "verse 78:29": "Gbogbo nnkan si ni A ti se akosile re sinu Tira kan",
            "verse 78:30": "Nitori naa, e to (iya) wo. A o si nii se alekun kan fun yin bi ko se iya",
            "verse 78:31": "Dajudaju igbala wa fun awon oluberu (Allahu)",
            "verse 78:32": "Awon ogba ati eso ajara",
            "verse 78:33": "ati awon olomoge, ti won ko jura won lo lojo-ori",
            "verse 78:34": "ati ife oti t’o kun denu (ni esan won)",
            "verse 78:35": "Won ko nii gbo isokuso ati oro iro ninu re",
            "verse 78:36": "(O je) esan lati odo Oluwa re, (o si je) ore ni ibamu si isiro-ise (won)",
            "verse 78:37": "(Esan naa wa lati odo) Oluwa awon sanmo, ile ati ohun t’o wa laaarin mejeeji, Ajoke-aye. Won ko si ni ikapa oro lodo Re",
            "verse 78:38": "Ojo ti molaika Jibril ati awon molaika (miiran) yoo duro ni owoowo. Won ko si nii soro afi eni ti Ajoke-aye ba yonda fun. Onitoun si maa soro t’o se weku",
            "verse 78:39": "Iyen ni ojo ododo. Nitori naa, eni ti o ba fe ki o mu ona to maa gba seri pada si odo Oluwa re pon (ni ti ironupiwada)",
            "verse 78:40": "Dajudaju A fi iya t’o sunmo se ikilo fun yin. Ojo ti eniyan yoo maa wo ohun ti o ti siwaju, alaigbagbo yo si wi pe: \"Yee, emi iba si je erupe, (emi iba la ninu iya)"
        }
    }
}