{
    "id": 79,
    "name_simple": "An-Nazi'at",
    "revelation_place": "makkah",
    "revelation_order": 81,
    "bismillah_pre": true,
    "verses_count": 46,
    "short_text": "It is derived from the word wan-nazi`at with which the Surah opens.",
    "text": [
        "\n",
        "It is derived from the word wan-nazi\\`at with which the Surah opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to Hadrat Abdullah bin Abbas, this Surah was sent down after Surah An-Naba. Its subject matter also testifies that it belongs to the earliest period at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is affirmation of Resurrection and the life hereafter; It also warns of the consequences of belying the Messenger of God.",
        "\n",
        "The Surah opens with oaths sworn by the angels who take the soul at deaths and those who hasten to carryout Allah's Commands, and those who conduct the affairs of the universe according to Divine Will, to assure that the Resurrection will certainly come to pass and the second life after death will certainly take place. For the angels who are employed to pluck out the soul today can also be employed to restore the soul tomorrow, and the angels who promptly execute Allah's Commands and conduct the affairs of the universe today can also upset the order of the universe tomorrow by orders of the same God and can also bring about a new order.",
        "\n",
        "After this the people have been told, so as to say: \"This work which you regard as absolutely impossible, is not any difficult for Allah, for which He may have to make lengthy preparations. Just a single jolt will upset this system of the world and a second jolt will be enough to cause you to appear as living beings in the new world. At that time the same people who were wont to deny it, would be trembling with fear and seeing with awe struck eyes all that they thought was impossible.",
        "\n",
        "Then, relating the story of the Prophet Moses and Pharaoh briefly, the people have been warned to the effect: \"You know full well what fate the Pharaoh met in consequence of belying the Messenger and rejecting the guidance brought by him and endeavoring to defeat his mission by trickery and deceit. If you do not learn any lesson from it and do not change your ways and attitude accordingly, you also will have to meet the same fate.",
        "\n",
        "Then, in vv. 27-33, arguments have been given for the Hereafter and life after death. In this regard, the deniers have been asked the question:\"Is your resurrection a more difficult task or the creation of the huge Universe which spreads around you to infinite distances with myriads of its stars and planets? Your recreation cannot be difficult for the God for Whom this was an easy task. Thus, after presenting in a single sentence, a decisive argument for the possibility of the Hereafter, attention has been drawn to the earth and its provisions that have been arranged in it for the sustenance of man and animal and of which everything testifies that it has been created with great wisdom for fulfilling some special purpose. Pointing to this the question has been left for the intellect of man to ponder for itself and form the opinion whether calling man to account after having delegated authority and responsibilities to a creature like him in this wise system would be more in\r\nkeeping with the demands of wisdom, or that he should die after committing all sorts of misdeeds in the world and should perish and mix in the dust for ever and should never be called to account as to how he employed the authority and fulfilled the responsibilities entrusted to him. Instead of discussing this question, in vv. 34-41, it has been said: \"When the Hereafter is established, men's eternal future will be determined on the criterion as to which of them rebelled against his God transgressing the bounds of service and made the material benefits and pleasures his objective of life and which of them feared standing before his Lord and refrained from fulfilling the unlawful desires of the self.\" This by itself provides the right answer to the above question to every such person who considers it honestly, free from stubbornness. For the only rational, logical and moral demand of giving authority and entrusting responsibilities to man in the world is that he should be called to\r\naccount on this very basis ultimately and rewarded or punished accordingly.",
        "\n",
        "In conclusion, the question of the disbelievers of Makkah as to when Resurrection will take place, has been answered. They asked the Holy Prophet this question over and over again. In reply it has been said that the knowledge of the time of its occurrence rests with Allah alone. The Messenger is there only to give the warning that it will certainly come. Now whoever wishes may mend his ways, fearing its coming, and whoever wishes may behave and conduct himself as he likes, fearless of its coming. When the appointed time comes, those very people who loved the life of this world and regarded its pleasures as the only object of life, would feel that they had stayed in the world only for an hour or so. Then they will realize how utterly they had ruined their future for ever for the sake of the short lived pleasures of the world.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Wresters, the angelic pullers, who shall harshly wrest out the souls of the unbelievers at their appointed time of death. It takes its name from “the wresters” (al-nāziʿāt) mentioned in verse 1. The main theme of the surah is the possibility and inevitability of the Resurrection, its results, and its timing. The story of Moses and Pharaoh acts as encouragement to the Prophet and a warning to the disbelievers.The surah is also known as: (Soul-)Snatchers, Extractors, The Angelic Pullers, The Forceful Chargers, The Pluckers, The Soul-Snatchers, Those That Rise, Those Who Pull and Withdraw, Those Who Tear Out.",
    "name_translation": "The Wresters",
    "name_complex": "An-Nâzi‘ât",
    "surah_name_ar": "النازعات",
    "verses": {
        "Albanian": {
            "verse 79:1": "Betohem në ata (engjëj) që i marrin shpirtërat ashpër (jombesimtarëve)",
            "verse 79:2": "dhe në ata që i marrin butësisht (besimtarëve)",
            "verse 79:3": "dhe në ata (engjëj) që notojnë në hapësirë (në mes Tokës e qiellit),",
            "verse 79:4": "si dhe në ata (engjëj) që garojnë (për kryerjen e urdhërave),",
            "verse 79:5": "dhe betohem në ata (engjëj) që i rregullojnë ato që nuk janë të rregulluara,",
            "verse 79:6": "në Ditën kur Toka do të dridhet nga tërmeti,",
            "verse 79:7": "ps të cilit pason tjetri. –",
            "verse 79:8": "Atë ditë, zemrat do të jenë të tronditura,",
            "verse 79:9": "e shikimet e tyre të përulura.",
            "verse 79:10": "Ata (jobesimtarët) thonë: “A, me të vërtetë, do të kthehemi ne – në jetë (në gjendjen e mëparshme)?",
            "verse 79:11": "A thua edhe kur të bëhemi eshtra të kalbur?”",
            "verse 79:12": "E thonë: “E atëherë (të kthyerit), do të jemi të humbur.",
            "verse 79:13": "E do të jetë ajo (ringjallja) vetëm një thirrje,",
            "verse 79:14": "dhe, ja ata përnjëherësh (të gjallë) në Tokë.",
            "verse 79:15": "A të ka ardhur ty (o Muhammed) lajmi për Musain,",
            "verse 79:16": "kur Zoti i tij e ka thirrë atë në luginën e shenjtë të Tuvasë:",
            "verse 79:17": "“Shko te Faraoni, se ai, me të vërtetë, është tërbuar,",
            "verse 79:18": "dhe thuaj (Faraonit): ‘A don ti të pastrohesh (nga të këqiat),",
            "verse 79:19": "dhe të udhëzoj te Zoti yt, që t’i druhesh (për të mos bërë të këqia)?",
            "verse 79:20": "Dhe, ia tregoi (Musai-Faraonit) mrekullinë më të madhe,",
            "verse 79:21": "por ai e mohoi dhe e kundërshtoi,",
            "verse 79:22": "pastaj u kthye,",
            "verse 79:23": "u përpoq dhe i tuboi njerëzit e thirri:",
            "verse 79:24": "“Unë jam zoti juaj suprem (më i lartë)!",
            "verse 79:25": "dhe, Perëndia, ia ekspozoi atij dënimin e kësaj bote dhe të botës tjetër.",
            "verse 79:26": "Kjo është këshillë për ata që i druajnë Perëndisë.",
            "verse 79:27": "E, çka është më vështirë: krijimi i juaj apo i qiellit? Ai e ka ndërtuar (qiellin),",
            "verse 79:28": "lart e ka ngritur kupën e tij dhe e ka përsosur,",
            "verse 79:29": "dhe netët e tij i ka bërë të errta, kurse ditët të ndritshme,",
            "verse 79:30": "e pastaj e rrafshoi (shtriu) Tokën,",
            "verse 79:31": "dhe nga ajo (toka) i nxorri ujërat dhe kullosat,",
            "verse 79:32": "dhe malet i bëri të palëvizshme (i forcoi)",
            "verse 79:33": "për gjallërinë tuaj dhe të bagëtive tuaja.",
            "verse 79:34": "E, kur të arrijë vështirësia më e madhe,",
            "verse 79:35": "Dita kur njeriu e kujton atë çka ka punuar,",
            "verse 79:36": "dhe i tregohet skëterra çdokujt që sheh,",
            "verse 79:37": "atëherë, ai që ka qenë kërcënues,",
            "verse 79:38": "dhe e ka preferuar (dashtë më shumë) jetën e kësaj bote,",
            "verse 79:39": "pë te, me të vërtetë, vendbanim është skëterra.",
            "verse 79:40": "Kurse, ai që i druan madhërisë së Zotit të tij dhe e frenon vete nga epshet,",
            "verse 79:41": "me të vërtetë, vendbanim i tij është xhenneti.",
            "verse 79:42": "Të pyesin ty për Kijametin: “Kur do të ndodhë?”",
            "verse 79:43": "Çka ka rëndësi për ty ta përmendësh atë?!",
            "verse 79:44": "Vetëm Zoti yt di për te.",
            "verse 79:45": "Ti je vetëm paralajmërues i atyre që i druajnë atij (Kijametit);",
            "verse 79:46": "kurse, atë ditë, që do ta shohin atë (Kijametin), atyre do t’u duket se kanë qëndruar në këtë botë, vetëm një mbrëmje apo një mëngjes (të asaj mbrëmjeje)."
        },
        "Amharic": {
            "verse 79:1": "በኃይል አውጪዎች በኾኑት፤",
            "verse 79:2": "በቀስታ መምዘዝንም መዘዦች በኾኑት፤",
            "verse 79:3": "መዋኘትም ዋኚዎች በኾኑት፤",
            "verse 79:4": "መቅደምንም ቀዳሚዎች በኾኑት፤",
            "verse 79:5": "ነገርንም አስተናባሪዎች በኾኑት (መላእክት) እምላለሁ፡፡ (በእርግጥ ትቀሰቀሳላችሁ)፡፡",
            "verse 79:6": "ተርገፍጋፊይቱ (ምድር) በምትርገፈገፍበት ቀን፤",
            "verse 79:7": "ለጣቂይቱ የምትከተላት ስትኾን (ትቀሰቀሳላችሁ)፡፡",
            "verse 79:8": "በዚያ ቀን ልቦች ተሸባሪዎች ናቸው፡፡",
            "verse 79:9": "ዓይኖቻቸው ተዋራጆች (አቀርቃሪዎች) ናቸው፡፡",
            "verse 79:10": "«እኛ ወደ መጀመሪያይቱ ኹነታ ተመላሾች ነን?» ይላሉ፡፡",
            "verse 79:11": "«የበሰበሱ አጥንቶች በኾን ጊዜ (እንቀሰቀሳለን?)»",
            "verse 79:12": "«ይህቺ ያን ጊዜ ባለ ከሳራ መመለስ ናት» ይላሉ፡፡",
            "verse 79:13": "እርሷም አንዲት ጩኸት ብቻ ናት፡፡",
            "verse 79:14": "ወዲያውኑም እነርሱ እንቅልፍ በሌለባት (ምድር) ላይ ይኾናሉ፡፡",
            "verse 79:15": "የሙሳ ወሬ መጣልህን?",
            "verse 79:16": "ጌታው በተቀደሰው ሸለቆ በጡዋ በጠራው ጊዜ፤",
            "verse 79:17": "ወደ ፈርዖን ኺድ፡፡ እርሱ ወሰን አልፏልና፡፡",
            "verse 79:18": "በለውም፡- «ወደ መጥራራትህ ላንተ (መንገድ) አለህን?»",
            "verse 79:19": "«ወደ ጌታህም ልመራህ ትፈራውም ዘንድ፤ (መንገድ አለህን?)» አለው፡፡",
            "verse 79:20": "ታላቂቱንም ተዓምር አሳየው፡፡",
            "verse 79:21": "አስተባበለም፤ አመጸም፡፡",
            "verse 79:22": "ከዚያም (ለማጥፋት) የሚተጋ ኾኖ ዞረ፡፡",
            "verse 79:23": "(ሰራዊቶቹን) ሰበሰበም፤ ተጣራም፡፡",
            "verse 79:24": "አለም፡- «እኔ ታላቁ ጌታችሁ ነኝ፡፡»",
            "verse 79:25": "አላህም በኋለኛይቱና በፊተኛይቱ (ቃል) ቅጣት ያዘው፡፡",
            "verse 79:26": "በዚህ ውስጥ ለሚፈራ ሰው በእርግጥ መገምገሚያ አለበት፡፡",
            "verse 79:27": "ባፈጣጠር እናንተ ይበልጥ የበረታችሁ ናችሁን? ወይንስ ሰማይ? (አላህ) ገነባት፡፡",
            "verse 79:28": "ከፍታዋን አጓነ፤ አስተካከላትም፡፡",
            "verse 79:29": "ሌሊቷንም አጨለመ፡፡ ቀንዋንም ገለጸ፡፡",
            "verse 79:30": "ምድርንም ከዚህ በኋላ ዘረጋት፡፡",
            "verse 79:31": "ውሃዋንና ግጦሿን ከእርሷ አወጣ፡፡",
            "verse 79:32": "ጋራዎችንም አደላደላቸው፡፡",
            "verse 79:33": "ለእናንተና ለእንስሶቻችሁ መጣቀሚያ ይኾን ዘንድ (ይህን አደረገ)፡፡",
            "verse 79:34": "ታላቂቱም መዐት በመጣች ጊዜ፣",
            "verse 79:35": "ሰው ሁሉ የሠራውን በሚያስታውስበት ቀን፣",
            "verse 79:36": "ገሀነምም ለሚያይ ሰው በተገለጠች ጊዜ፣",
            "verse 79:37": "የካደ ሰውማ፣",
            "verse 79:38": "ቅርቢቱንም ሕይወት የመረጠ፣",
            "verse 79:39": "ገሀነም እርሷ በእርግጥ መኖሪያው ናት፡፡",
            "verse 79:40": "በጌታው ፊት መቆምን የፈራ ሰውማ ነፍሱንም ከዝንባሌዋ የከለከለ",
            "verse 79:41": "ገነት እርሷ በእርግጥ መኖሪያው ናት፡፡",
            "verse 79:42": "«ከሰዓቲቱ መቼ ነው መኾኛዋ?» ሲሉ ይጠይቁሃል፡፡",
            "verse 79:43": "አንተ እርሷን ከማስታወስ በምን ውስጥ ነህ?",
            "verse 79:44": "(የዕውቀት) መጨረሻዋ ወደ ጌታህ ብቻ ነው፡፡",
            "verse 79:45": "አንተ የሚፈራትን ሰው አስፈራሪ ብቻ ነህ፡፡",
            "verse 79:46": "እነርሱ በሚያዩዋት ቀን ያንዲት ቀን ምሽትን ወይም ረፏዷን እንጅ ያልቆዩ ይመስላሉ፡፡"
        },
        "Arabic": {
            "verse 79:1": "اًقْرَغ ِتاَعِزاَّنلاَو",
            "verse 79:2": "اًطْشَن ِتاَطِشاَّنلاَو",
            "verse 79:3": "اًحْبَس ِتاَحِباَّسلاَو",
            "verse 79:4": "اًقْبَس ِتاَقِباَّسلاَف",
            "verse 79:5": "اًرْمَأ ِتاَرِّبَدُمْلاَف",
            "verse 79:6": "ُةَفِجاَّرلا ُفُجْرَت َمْوَي",
            "verse 79:7": "ُةَفِداَّرلا اَهُعَبْتَت",
            "verse 79:8": "ٌةَفِجاَو ٍذِئَمْوَي ٌبوُلُق",
            "verse 79:9": "ٌةَعِشاَخ اَهُراَصْبَأ",
            "verse 79:10": "(ِةَرِفاَحْلا يِف َنوُدوُدْرَمَل اَّنِإَأ َنوُلوُقَي",
            "verse 79:11": "(ًةَرِخَّن اًماَظِع اَّنُك اَذِإَأ",
            "verse 79:12": "(ٌةَرِساَخ ٌةَّرَك اًذِإ َكْلِت اوُلاَق",
            "verse 79:13": "(ٌةَدِحاَو ٌةَرْجَز َيِه اَمَّنِإَف",
            "verse 79:14": "(ِةَرِهاَّسلاِب مُه اَذِإَف",
            "verse 79:15": "(ٰىَسوُم ُثيِدَح َكاَتَأ ْلَه",
            "verse 79:16": "(ىًوُط ِسَّدَقُمْلا ِداَوْلاِب ُهُّبَر ُهاَداَن ْذِإ",
            "verse 79:17": "(ٰىَغَط ُهَّنِإ َنْوَعْرِف ٰىَلِإ ْبَهْذا",
            "verse 79:18": "(ٰىَّكَزَت نَأ ٰىَلِإ َكَّل لَه ْلُقَف",
            "verse 79:19": "(ٰىَشْخَتَف َكِّبَر ٰىَلِإ َكَيِدْهَأَو",
            "verse 79:20": "(ٰىَرْبُكْلا َةَيآْلا ُهاَرَأَف",
            "verse 79:21": "(ٰىَصَعَو َبَّذَكَف",
            "verse 79:22": "(ٰىَعْسَي َرَبْدَأ َّمُث",
            "verse 79:23": "(ٰىَداَنَف َرَشَحَف",
            "verse 79:24": "(ٰىَلْعَأْلا ُمُكُّبَر اَنَأ َلاَقَف",
            "verse 79:25": "(ٰىَلوُأْلاَو ِةَرِخآْلا َلاَكَن ُهَّللا ُهَذَخَأَف",
            "verse 79:26": "(ٰىَشْخَي نَمِّل ًةَرْبِعَل َكِلَٰذ يِف َّنِإ",
            "verse 79:27": "(اَهاَنَب ۚ ُءاَمَّسلا ِمَأ اًقْلَخ ُّدَشَأ ْمُتنَأَأ",
            "verse 79:28": "(اَهاَّوَسَف اَهَكْمَس َعَفَر",
            "verse 79:29": "(اَهاَحُض َجَرْخَأَو اَهَلْيَل َشَطْغَأَو",
            "verse 79:30": "(اَهاَحَد َكِلَٰذ َدْعَب َضْرَأْلاَو",
            "verse 79:31": "(اَهاَعْرَمَو اَهَءاَم اَهْنِم َجَرْخَأ",
            "verse 79:32": "(اَهاَسْرَأ َلاَبِجْلاَو",
            "verse 79:33": "(ْمُكِماَعْنَأِلَو ْمُكَّل اًعاَتَم",
            "verse 79:34": "(ٰىَرْبُكْلا ُةَّماَّطلا ِتَءاَج اَذِإَف",
            "verse 79:35": "(ٰىَعَس اَم ُناَسنِإْلا ُرَّكَذَتَي َمْوَي",
            "verse 79:36": "(ٰىَرَي نَمِل ُميِحَجْلا ِتَزِّرُبَو",
            "verse 79:37": "(ٰىَغَط نَم اَّمَأَف",
            "verse 79:38": "(اَيْنُّدلا َةاَيَحْلا َرَثآَو",
            "verse 79:39": "(ٰىَوْأَمْلا َيِه َميِحَجْلا َّنِإَف",
            "verse 79:40": "(ٰىَوَهْلا ِنَع َسْفَّنلا ىَهَنَو ِهِّبَر َماَقَم َفاَخ ْنَم اَّمَأَو",
            "verse 79:41": "(ٰىَوْأَمْلا َيِه َةَّنَجْلا َّنِإَف",
            "verse 79:42": "(اَهاَسْرُم َناَّيَأ ِةَعاَّسلا ِنَع َكَنوُلَأْسَي",
            "verse 79:43": "(اَهاَرْكِذ نِم َتنَأ َميِف",
            "verse 79:44": "(اَهاَهَتنُم َكِّبَر ٰىَلِإ",
            "verse 79:45": "(اَهاَشْخَي نَم ُرِذنُم َتنَأ اَمَّنِإ",
            "verse 79:46": "(اَهاَحُض ْوَأ ًةَّيِشَع اَّلِإ اوُثَبْلَي ْمَل اَهَنْوَرَي َمْوَي ْمُهَّنَأَك"
        },
        "Azerbaijani": {
            "verse 79:1": "And olsun kafirlərin canını zorla alanlara!",
            "verse 79:2": "And olsun möminlərin canını rahatlıqla alanlara!",
            "verse 79:3": "And olsun göydə üzdükcə üzənlərə!",
            "verse 79:4": "And olsun ötdükcə ötənlərə!",
            "verse 79:5": "And olsun buyruqları yerinə yetirənlərə!",
            "verse 79:6": "O gün lərzəyə gələn lərzələnəcək,",
            "verse 79:7": "onun ardınca təkrar lərzələnəcək.",
            "verse 79:8": "Həmən gün qəlblər qorxudan tir-tir əsəcək.",
            "verse 79:9": "Bu qəlb sahiblərinin gözləri məzlum görkəm alacaq.",
            "verse 79:10": "Onlar deyirlər: “Yəni biz yenidən bundan qabaqkı halımıza döndəriləcəyik?",
            "verse 79:11": "Sümüklərimiz çürüdükdən sonra?”",
            "verse 79:12": "Onlar dedilər: “Belə olduğu halda bu, zərərli bir qayıdışdır”.",
            "verse 79:13": "O surun üfürülməsi təkcə qorxunc bir səsdir.",
            "verse 79:14": "O vaxt onlar ləngimədən qəbirlərindən yerin səthinə çıxacaqlar.",
            "verse 79:15": "Musanın hadisəsi sənə yetişdimi?",
            "verse 79:16": "O zaman Rəbbi onu müqəddəs Tuva vadisində səsləyib demişdi:",
            "verse 79:17": "“Fironun yanına yollan! O, həddini çox aşmışdır.",
            "verse 79:18": "De: “Günahlardan xilas olmaq istəyirsənmi?",
            "verse 79:19": "Səni Rəbbinə doğru yönəldimmi ki, Ondan qorxub çəkinəsən?”",
            "verse 79:20": "Musa ən böyük möcüzəni Firona göstərdi.",
            "verse 79:21": "O isə haqqı yalan sayıb üsyankar olduğunu göstərdi.",
            "verse 79:22": "Sonra da üz döndərib fəsad törətməyə girişdi.",
            "verse 79:23": "O, camaatını toplayıb onlara hündür səslə müraciət edərək",
            "verse 79:24": "dedi: “Sizin ən uca rəbbiniz mənəm!”",
            "verse 79:25": "Belə olduqda, Allah da onu dünya və Axirət əzabı ilə yaxaladı.",
            "verse 79:26": "Həqiqətən, bunda Allahdan qorxanlardan ötrü işarə var.",
            "verse 79:27": "Sizin yaradılışınız çətindir, yoxsa göyün? Allah onu qurdu,",
            "verse 79:28": "onun qübbəsini yüksəltdi və düzəldib kamilləşdirdi,",
            "verse 79:29": "gecəsini qaranlıq edib, səhərini də nurlandırdı.",
            "verse 79:30": "Sonra yeri döşəyib,",
            "verse 79:31": "onda su və otlaq yaratdı,",
            "verse 79:32": "dağları da yerə bərkitdi.",
            "verse 79:33": "Bunlar sizin və mal-qaranızın faydalanmasından ötrüdür.",
            "verse 79:34": "Ən böyük fəlakətin gəldiyi zaman –",
            "verse 79:35": "o gün insan törətdiklərini xatırlayacaqdır.",
            "verse 79:36": "Cəhənnəm isə hər görmə qabiliyyətliyə göstəriləcəkdir.",
            "verse 79:37": "Kim həddi aşmışsa,",
            "verse 79:38": "dünya həyatını axirətdən üstün bilmişsə,",
            "verse 79:39": "həqiqətən, Cəhənnəm onun sığınacağı olacaqdır.",
            "verse 79:40": "Ancaq kim Rəbbinin hüzuruna gələcəyindən qorxmuş və nəfsinə ehtirası yasaq etmişsə,",
            "verse 79:41": "həqiqətən, Cənnət onun məskəni olacaq.",
            "verse 79:42": "Səndən o Saat barəsində: “O nə vaxt qopacaq?”– deyə soruşurlar.",
            "verse 79:43": "Axı sən onu haradan biləsən?!",
            "verse 79:44": "Onu kamil bilmək sənin Rəbbinə aiddir.",
            "verse 79:45": "Sən yalnız ondan qorxanı xəbərdar edənsən.",
            "verse 79:46": "Onlar Qiyaməti gördükləri an dünyada yalnız bir axşam çağı və yaxud bir gündüz qədər yaşadıqlarını güman edəcəklər!"
        },
        "Bengali": {
            "verse 79:1": "শপথ সেই ফেরেশতাগণের, যারা ডুব দিয়ে আত্মা উৎপাটন করে,",
            "verse 79:2": "শপথ তাদের, যারা আত্মার বাঁধন খুলে দেয় মৃদুভাবে;",
            "verse 79:3": "শপথ তাদের, যারা সন্তরণ করে দ্রুতগতিতে,",
            "verse 79:4": "শপথ তাদের, যারা দ্রুতগতিতে অগ্রসর হয় এবং",
            "verse 79:5": "শপথ তাদের, যারা সকল কর্মনির্বাহ করে, কেয়ামত অবশ্যই হবে।",
            "verse 79:6": "যেদিন প্রকম্পিত করবে প্রকম্পিতকারী,",
            "verse 79:7": "অতঃপর পশ্চাতে আসবে পশ্চাদগামী;",
            "verse 79:8": "সেদিন অনেক হৃদয় ভীত-বিহবল হবে।",
            "verse 79:9": "তাদের দৃষ্টি নত হবে।",
            "verse 79:10": "তারা বলেঃ আমরা কি উলটো পায়ে প্রত্যাবর্তিত হবই-",
            "verse 79:11": "গলিত অস্থি হয়ে যাওয়ার পরও?",
            "verse 79:12": "তবে তো এ প্রত্যাবর্তন সর্বনাশা হবে!",
            "verse 79:13": "অতএব, এটা তো কেবল এক মহা-নাদ,",
            "verse 79:14": "তখনই তারা ময়দানে আবির্ভূত হবে।",
            "verse 79:15": "মূসার বৃত্তান্ত আপনার কাছে পৌছেছে কি?",
            "verse 79:16": "যখন তার পালনকর্তা তাকে পবিত্র তুয়া উপ্যকায় আহবান করেছিলেন,",
            "verse 79:17": "ফেরাউনের কাছে যাও, নিশ্চয় সে সীমালংঘন করেছে।",
            "verse 79:18": "অতঃপর বলঃ তোমার পবিত্র হওয়ার আগ্রহ আছে কি?",
            "verse 79:19": "আমি তোমাকে তোমার পালনকর্তার দিকে পথ দেখাব, যাতে তুমি তাকে ভয় কর।",
            "verse 79:20": "অতঃপর সে তাকে মহা-নিদর্শন দেখাল।",
            "verse 79:21": "কিন্তু সে মিথ্যারোপ করল এবং অমান্য করল।",
            "verse 79:22": "অতঃপর সে প্রতিকার চেষ্টায় প্রস্থান করল।",
            "verse 79:23": "সে সকলকে সমবেত করল এবং সজোরে আহবান করল,",
            "verse 79:24": "এবং বললঃ আমিই তোমাদের সেরা পালনকর্তা।",
            "verse 79:25": "অতঃপর আল্লাহ তাকে পরকালের ও ইহকালের শাস্তি দিলেন।",
            "verse 79:26": "যে ভয় করে তার জন্যে অবশ্যই এতে শিক্ষা রয়েছে।",
            "verse 79:27": "তোমাদের সৃষ্টি অধিক কঠিন না আকাশের, যা তিনি নির্মাণ করেছেন?",
            "verse 79:28": "তিনি একে উচ্চ করেছেন ও সুবিন্যস্ত করেছেন।",
            "verse 79:29": "তিনি এর রাত্রিকে করেছেন অন্ধকারাচ্ছন্ন এবং এর সূর্যোলোক প্রকাশ করেছেন।",
            "verse 79:30": "পৃথিবীকে এর পরে বিস্তৃত করেছেন।",
            "verse 79:31": "তিনি এর মধ্য থেকে এর পানি ও ঘাম নির্গত করেছেন,",
            "verse 79:32": "পর্বতকে তিনি দৃঢ়ভাবে প্রতিষ্ঠিত করেছেন,",
            "verse 79:33": "তোমাদের ও তোমাদের চতুস্পদ জন্তুদের উপকারার্থে।",
            "verse 79:34": "অতঃপর যখন মহাসংকট এসে যাবে।",
            "verse 79:35": "অর্থাৎ যেদিন মানুষ তার কৃতকর্ম স্মরণ করবে",
            "verse 79:36": "এবং দর্শকদের জন্যে জাহান্নাম প্রকাশ করা হবে,",
            "verse 79:37": "তখন যে ব্যক্তি সীমালংঘন করেছে;",
            "verse 79:38": "এবং পার্থিব জীবনকে অগ্রাধিকার দিয়েছে,",
            "verse 79:39": "তার ঠিকানা হবে জাহান্নাম।",
            "verse 79:40": "পক্ষান্তরে যে ব্যক্তি তার পালনকর্তার সামনে দন্ডায়মান হওয়াকে ভয় করেছে এবং খেয়াল-খুশী থেকে নিজেকে নিবৃত্ত রেখেছে,",
            "verse 79:41": "তার ঠিকানা হবে জান্নাত।",
            "verse 79:42": "তারা আপনাকে জিজ্ঞাসা করে, কেয়ামত কখন হবে?",
            "verse 79:43": "এর বর্ণনার সাথে আপনার কি সম্পর্ক ?",
            "verse 79:44": "এর চরম জ্ঞান আপনার পালনকর্তার কাছে।",
            "verse 79:45": "যে একে ভয় করে, আপনি তো কেবল তাকেই সতর্ক করবেন।",
            "verse 79:46": "যেদিন তারা একে দেখবে, সেদিন মনে হবে যেন তারা দুনিয়াতে মাত্র এক সন্ধ্যা অথবা এক সকাল অবস্থান করেছে।"
        },
        "Berber Amazigh": {
            "verse 79:1": "S tid iqelâen $evsent!",
            "verse 79:2": "S tid iteddun éewôent!",
            "verse 79:3": "S tid ippâumun s sshala!",
            "verse 79:4": "S tid ipêizwaren d amêizwer!",
            "verse 79:5": "S tid idebbiôen lameô!",
            "verse 79:6": "Ass ideg ara d i$eô ûûut,",
            "verse 79:7": "a t id ivfeô uvfiô,",
            "verse 79:8": "ulawen, ad rgagin, assen.",
            "verse 79:9": "Ad brunt wallen nnsen.",
            "verse 79:10": "Ad inin: \"day, s tidep, a d nu$al akken nella?",
            "verse 79:11": "Xas nekwni d i$san irkan\"?",
            "verse 79:12": "Ad inin: \"ayagi, ihi, d tu$alin n lexsaôa\"!",
            "verse 79:13": "Neppa, d yiwet n ti$ôi kan.",
            "verse 79:14": "Atnan u$alen ar tmurt.",
            "verse 79:15": "Ma tusa k id tedyant n Musa?",
            "verse 79:16": "Mi s d Issawel Mass is di Ïuwa, ta$zut iôqan:",
            "verse 79:17": "\"ôuê ar Feôâun, atan ijuô.",
            "verse 79:18": "Ini: ma tzemrev a ppizdigev?",
            "verse 79:19": "A k nhu$ ar Mass ik, d$a a ppagwadev\".",
            "verse 79:20": "Issenâat as assekni abarar.",
            "verse 79:21": "D$a, iskaddeb, iâuûa.",
            "verse 79:22": "Sinna, ibren, icqa.",
            "verse 79:23": "Issemlal ed, iberreê.",
            "verse 79:24": "Inna: \"d nek ay d mass nnwen aâlayan\"!",
            "verse 79:25": "Irra t Öebbi d amedya uâaqeb, di tmezwarut u di tneggarut.",
            "verse 79:26": "Ih, tagi degs nnqida i win iugaden.",
            "verse 79:27": "Day d lxelq nnwen i iwaâôen, ne$ d igenni mi t Ibna?",
            "verse 79:28": "Issuli lqus is, Iwezn it.",
            "verse 79:29": "Issebrek iv is; Issuffe$ ed tafat is.",
            "verse 79:30": "Deffir waya, Issewsaâ tamurt.",
            "verse 79:31": "Issuffe$ ed segs aman is, akked tkessawt is.",
            "verse 79:32": "Idurar, Iôûa ten;",
            "verse 79:33": "d l$it i kunwi, akw i lmal nnwen.",
            "verse 79:34": "Mara d tas twa$it tabarart,",
            "verse 79:35": "ayen ixdem umdan, a t id ismekti, assen;",
            "verse 79:36": "times a d tban i win ipwalin.",
            "verse 79:37": "Wanag win ijuôen,",
            "verse 79:38": "ismenyafen tameddurt n ddunit,",
            "verse 79:39": "Ihi, d times ay d ûûôan.",
            "verse 79:40": "Wanag win iugaden ibeddi zdat Mass is, u ikkes cchawi i teôwiêt,",
            "verse 79:41": "ihi, d Loennet ay d ûûôan.",
            "verse 79:42": "Steqsan k af yimir, melmi tisin is.",
            "verse 79:43": "Amek ara t id tdekôev, keçç?",
            "verse 79:44": "Ar Mass ik, agwav is.",
            "verse 79:45": "Keçç d aneddaô kan i win it iugaden.",
            "verse 79:46": "Ihi, nitni, ass ideg ara t walin, amzun qqimen kan tameddit, ne$ tasebêit nni."
        },
        "Bosnian": {
            "verse 79:1": "Tako Mi onih koji čupaju grubo,",
            "verse 79:2": "i onih koji vade blago,",
            "verse 79:3": "i onih koji plove brzo,",
            "verse 79:4": "pa naređenja izvršavaju žurno",
            "verse 79:5": "i sređuju ono što nije sređeno…",
            "verse 79:6": "na Dan kada se Zemlja potresom zatrese,",
            "verse 79:7": "za kojim će slijediti sljedeći –",
            "verse 79:8": "srca toga dana biće uznemirena,",
            "verse 79:9": "a pogledi njihovi oboreni.",
            "verse 79:10": "Ovi pitaju: \"Zar ćemo, zaista, biti opet ono što smo sada?",
            "verse 79:11": "Zar kad truhle kosti postanemo?\",",
            "verse 79:12": "i još kažu: \"E tada bismo mi bili izgubljeni!\"",
            "verse 79:13": "A biće to samo povik jedan,",
            "verse 79:14": "i evo njih – na Zemlji.",
            "verse 79:15": "Da li je do tebe doprla vijest o Musau,",
            "verse 79:16": "kad ga je Gospodar njegov u svetoj dolini Tuva zovnuo,",
            "verse 79:17": "\"Idi faraonu, on se osilio,",
            "verse 79:18": "i reci: 'Da li bi ti da se očistiš,",
            "verse 79:19": "da te o Gospodaru tvome poučim, pa da Ga se bojiš?'\"",
            "verse 79:20": "I onda mu je najveće čudo pokazao,",
            "verse 79:21": "ali je on porekao i nije poslušao,",
            "verse 79:22": "već se okrenuo i potrudio",
            "verse 79:23": "i sabrao i povikao:",
            "verse 79:24": "\"Ja sam gospodar vaš najveći!\" – on je rekao,",
            "verse 79:25": "i Allah ga je i za ove i za one prijašnje riječi kaznio.",
            "verse 79:26": "To je pouka za onoga koji se bude Allaha bojao.",
            "verse 79:27": "A šta je teže: vas ili nebo stvoriti? On ga je sazdao,",
            "verse 79:28": "svod njegov visoko digao i usavršio,",
            "verse 79:29": "noći njegove mračnim, a dane svijetlim učinio.",
            "verse 79:30": "Poslije toga je Zemlju poravnao,",
            "verse 79:31": "iz nje je vodu i pašnjake izveo,",
            "verse 79:32": "i planine nepomičnim učinio –",
            "verse 79:33": "na uživanje vama i stoci vašoj.",
            "verse 79:34": "A kada dođe nevolja najveća,",
            "verse 79:35": "Dan kada se čovjek bude sjećao onoga što je radio",
            "verse 79:36": "i kada se Džehennem svakome ko vidi bude ukazao,",
            "verse 79:37": "onda će onome koji je obijestan bio",
            "verse 79:38": "i život na ovome svijetu više volio",
            "verse 79:39": "Džehennem prebivalište postati sigurno.",
            "verse 79:40": "A onome koji je pred dostojanstvom Gospodara svoga strepio i dušu od prohtjeva uzdržao",
            "verse 79:41": "Džennet će boravište biti sigurno.",
            "verse 79:42": "Pitaju te o Smaku svijeta: \"Kada će se dogoditi?\"",
            "verse 79:43": "Ti ne znaš, pa kako da o njemu zboriš,",
            "verse 79:44": "o njemu samo Gospodar tvoj zna.",
            "verse 79:45": "Tvoja opomena će koristiti samo onome koji ga se bude bojao,",
            "verse 79:46": "a njima će se učiniti, onoga Dana kada ga dožive, da su samo jednu večer ili jedno jutro njezino ostali."
        },
        "Bulgarian": {
            "verse 79:1": "Кълна се в изтръгващите [душите] с все сила",
            "verse 79:2": "и в изваждащите [ги] нежно,",
            "verse 79:3": "и в спускащите се бързо,",
            "verse 79:4": "и в гонещите се в надпревара,",
            "verse 79:5": "и в изпълняващите повелите!",
            "verse 79:6": "В Деня, когато [се протръби с първия Рог] ще се разтърси тресящата се [вселена],",
            "verse 79:7": "ще последва второто [протръбяване].",
            "verse 79:8": "Някои сърца в този Ден ще тръпнат.",
            "verse 79:9": "Погледите им ще бъдат сведени.",
            "verse 79:10": "Ще кажат: “Нима ще бъдем върнати към предишното,",
            "verse 79:11": "нима, след като бяхме прогнили кости?”",
            "verse 79:12": "Ще кажат: “Това тогава е завръщане със загуба.”",
            "verse 79:13": "То е само едно протръбяване -",
            "verse 79:14": "и ето всички - възкръснали!",
            "verse 79:15": "[О, Мухаммад], стигна ли до теб разказът за Муса?",
            "verse 79:16": "Когато неговият Господ го призова в свещената долина Туа:",
            "verse 79:17": "“Иди при Фараона! Той престъпи.",
            "verse 79:18": "И кажи: “Не ще ли се пречистиш,",
            "verse 79:19": "да те напътя към твоя Господ и да се побоиш?””",
            "verse 79:20": "И му показа [Муса] най-голямото знамение.",
            "verse 79:21": "И взе го за лъжа, и се възпротиви.",
            "verse 79:22": "После се отвърна с упорство.",
            "verse 79:23": "И насъбра [хората си], и прогласи.",
            "verse 79:24": "Каза: “Аз съм вашият господ, върховният.”",
            "verse 79:25": "И Аллах го сграбчи с наказание в отвъдния и в земния живот.",
            "verse 79:26": "В това има поучение за всеки богобоязлив.",
            "verse 79:27": "Вие ли сте по-трудни за сътворяване или небето? Той го съгради.",
            "verse 79:28": "Въздигна неговия свод и го изравни,",
            "verse 79:29": "и потъмни нощта му, и изведе утрото му,",
            "verse 79:30": "и земята след това разпростря.",
            "verse 79:31": "Извади от нея водите и пасбищата й,",
            "verse 79:32": "и планините поби",
            "verse 79:33": "за ползване от вас и от вашия добитък.",
            "verse 79:34": "И когато настъпи Голямото прииждане,",
            "verse 79:35": "тогава в Деня човек ще си припомни за какво се е старал,",
            "verse 79:36": "и Адът ще бъде показан на всеки, който вижда...",
            "verse 79:37": "За който е престъпвал",
            "verse 79:38": "и е предпочел земния живот,",
            "verse 79:39": "обиталището е Адът.",
            "verse 79:40": "За който се е страхувал да не застане пред своя Господ [с грях] и е въздържал душата от страстта,",
            "verse 79:41": "обиталището е Раят.",
            "verse 79:42": "Питат те [о, Мухаммад] за Часа: “Кога ще настъпи?”",
            "verse 79:43": "Какво [знание имаш] ти да го споменеш?",
            "verse 79:44": "При твоя Господ е пределът му.",
            "verse 79:45": "Ти си само предупредител за всеки, който се страхува от него.",
            "verse 79:46": "В Деня, когато го видят, те сякаш ще са пребивавали само една привечер или утрин."
        },
        "Chinese": {
            "verse 79:1": "誓以急掣的，",
            "verse 79:2": "轻曳的，",
            "verse 79:3": "奔驰的，",
            "verse 79:4": "先驱的，",
            "verse 79:5": "决策的，",
            "verse 79:6": "当震动者震动，",
            "verse 79:7": "而续发者续发之日，",
            "verse 79:8": "在那日，许多心将忐忑不安，",
            "verse 79:9": "许多眼将不敢仰视。",
            "verse 79:10": "他们说：我们必定复元吗？",
            "verse 79:11": "那是在我们已变成朽骨的时候吗？",
            "verse 79:12": "他们说：然则，那是一次亏折的复原。",
            "verse 79:13": "那只是一次吼声，",
            "verse 79:14": "他们忽然在地面之上。",
            "verse 79:15": "穆萨的故事已来临你了吗？",
            "verse 79:16": "当时，他的主，曾在圣谷杜洼中召唤他说：",
            "verse 79:17": "你到法老那里去吧！他确是悖逆的。",
            "verse 79:18": "你对他说：'你愿意成为纯洁的人吗？",
            "verse 79:19": "你愿意我引导你认识你的主，而你畏惧他吗？'",
            "verse 79:20": "他把那最大的迹象昭示了法老，",
            "verse 79:21": "但他否认，而且违抗。",
            "verse 79:22": "然后，他转身而奔走。",
            "verse 79:23": "於是，召集民众，而且喊叫，",
            "verse 79:24": "说：我是你们的至尊的主。",
            "verse 79:25": "故真主以后世和今世的刑罚惩治他。",
            "verse 79:26": "对於畏惧的人们，此中确有一种鉴戒。",
            "verse 79:27": "你们是更难造的呢？还是天是更难造的呢？他曾建造了天，",
            "verse 79:28": "他升起它的高度，而成全它的形体，",
            "verse 79:29": "他使它的夜间黑暗，并显出它的光明。",
            "verse 79:30": "此后，他将地面展开，",
            "verse 79:31": "他使地面涌出泉水来，生出植物来。",
            "verse 79:32": "他使山峦稳定，",
            "verse 79:33": "以便你们和你们的牲畜获得享受。",
            "verse 79:34": "大难来临的时候，",
            "verse 79:35": "就是人将记起自己所作的善恶，",
            "verse 79:36": "火狱将为能见的人显露出来的日子。",
            "verse 79:37": "悖逆",
            "verse 79:38": "而且选择今世生活的人，",
            "verse 79:39": "火狱必为他的归宿。",
            "verse 79:40": "至於怕站在主的御前受审问，并戒除私欲的人，",
            "verse 79:41": "乐园必为他的归宿。",
            "verse 79:42": "他们问你复活时在什么时候实现，",
            "verse 79:43": "你怎能说明它呢？",
            "verse 79:44": "惟有你的主能知它的究竟。",
            "verse 79:45": "你的警告只有裨於畏惧它的人，",
            "verse 79:46": "他们在见它的那日，好像在坟里只逗留过一朝或一夕。"
        },
        "Danish": {
            "verse 79:1": "Bij hen die zich volledig inspannen",
            "verse 79:2": "En bij hen die hun werk met vreugde verrichten",
            "verse 79:3": "En bij hen die snelle vorderingen maken",
            "verse 79:4": "En bij hen die de eersten willen zijn",
            "verse 79:5": "En bij hen die de zaak regelen",
            "verse 79:6": "De Dag waarop de bevende (aarde) zal beven",
            "verse 79:7": "Hierop zal volgen, wat volgen moet",
            "verse 79:8": "Op die Dag zullen de harten kloppen",
            "verse 79:9": "En de ogen zullen nedergeslagen zijn",
            "verse 79:10": "Zij (de ongelovigen) zeggen: Zullen wij werkelijk tot onze vroegere toestand worden teruggebracht",
            "verse 79:11": "Zelfs al zijn wij vergane beenderen geworden",
            "verse 79:12": "Zij zeggen: Dan zou deze opstanding een ondergang zijn",
            "verse 79:13": "Daar is slechts één dreigende roep",
            "verse 79:14": "En ziet, zij zijn opgewekt",
            "verse 79:15": "Heeft het verhaal van Mozes u niet bereikt",
            "verse 79:16": "Toen zijn Heer hem in het heilige dal van Towa toeriep, (zeggende)",
            "verse 79:17": "Ga naar Pharao; want hij is opstandig",
            "verse 79:18": "En zeg tot hem: Zoudt gij u willen reinigen",
            "verse 79:19": "En ik zal u tot uw Heer leiden opdat gij Hem moogt vrezen",
            "verse 79:20": "Toen toonde hij hem (Pharao) het grote teken",
            "verse 79:21": "Maar deze verwierp het en gehoorzaamde niet",
            "verse 79:22": "Maar wendde zich daarna haastig af",
            "verse 79:23": "En hij (Pharao) verzamelde de zijnen en riep uit",
            "verse 79:24": "(Zeggende), Ik ben uw Heer de Allerhoogste",
            "verse 79:25": "Daarop greep Allah hem aan met een voorbeeldige straf voor de toekomst en voor die tijd",
            "verse 79:26": "Waarlijk daarin is een les voor hem die vreest",
            "verse 79:27": "Zijt gij moeilijker te scheppen dan de hemel die Hij heeft gebouwd",
            "verse 79:28": "Hij verhief hem hoog en maakte hem volmaakt",
            "verse 79:29": "En Hij maakte de nacht donker en bracht het daglicht voort",
            "verse 79:30": "En ook de aarde spreidde hij uit",
            "verse 79:31": "Daaruit bracht Hij water en weide voort",
            "verse 79:32": "En Hij maakte de bergen onwrikbaar",
            "verse 79:33": "Een voorziening voor u en voor uw vee",
            "verse 79:34": "Maar als de grote ramp zal komen",
            "verse 79:35": "De Dag waarop de mens zich zal herinneren hetgeen hij heeft gedaan",
            "verse 79:36": "En de hel zal zichtbaar gemaakt worden voor hem die ziet",
            "verse 79:37": "Dan zal (voor hem) die opstandig is geweest",
            "verse 79:38": "En die het leven dezer wereld verkoos",
            "verse 79:39": "Brandend Vuur zijn tehuis zijn",
            "verse 79:40": "Doch voor hem die vreesde voor zijn Heer te staan, en die zijn ziel van begeerten onthield",
            "verse 79:41": "Zal het paradijs zeker zijn verblijf zijn",
            "verse 79:42": "Zij vragen u omtrent het Uur: Wanneer zal het komen",
            "verse 79:43": "Maar datgene waarmede gij u bezighoudt",
            "verse 79:44": "De uitkomst daarvan is bij uw Heer",
            "verse 79:45": "Gij zijt slechts een waarschuwer voor hem die vreest",
            "verse 79:46": "Op de dag waarop zij dit zullen zien, (zal het zijn) alsof zij slechts een avond of een morgen (op de aarde) hadden vertoefd"
        },
        "Dutch": {
            "verse 79:1": "Bij de hard uitrukkenden.",
            "verse 79:2": "Bij de zacht uittrekkenden.",
            "verse 79:3": "Bij de snel uitvoerenden.",
            "verse 79:4": "De snel voorbijstrevenden.",
            "verse 79:5": "De uitvoerenden van een bevel.",
            "verse 79:6": "Op de Dag waarop de bevende doet beven.",
            "verse 79:7": "Zal deze gevolgd worden door de (tweede) beving.",
            "verse 79:8": "De harten zullen op die Dag bonzen.",
            "verse 79:9": "Hun ogen zullen angstig teneergeslagen zijn.",
            "verse 79:10": "Zij zeggen: \"Zullen wij zeker worden teruggebracht in de vorige staat?",
            "verse 79:11": "Als wij vergruisde beenderen zijn geworden?\"",
            "verse 79:12": "Zij zeggen: \"Dat is dan een verliesgevende terugkeer.",
            "verse 79:13": "En voorwaar, het zal slechts één enkele stoot zijn.",
            "verse 79:14": "En dan staan zij op het aardoppervlak.",
            "verse 79:15": "Heeft het verhaal van Môesa jou bereikt?",
            "verse 79:16": "Toen zijn Heer hem riep in de heilige vallei van Thoewa.",
            "verse 79:17": "(Allah zei:) \"Ga naar Fir'aun: voorwaar, hij was in overtreding.",
            "verse 79:18": "En zeg tot hem: \"Heb jij de wil om jezelf te reinigen (van zonde)?",
            "verse 79:19": "En dat ik jou tot jouw Heer zal leiden, zodat jij (Hem) vreest?\"",
            "verse 79:20": "En hij toonde hem de grote Tekenen (wonderen).",
            "verse 79:21": "Maar hij loochende en was ongehoorzaam.",
            "verse 79:22": "Vervolgens draaide hij zich om en vluchtte.",
            "verse 79:23": "Toen verzamelde hij (zijn tovenaars) en riep uit.",
            "verse 79:24": "En zei: \"Ik ben jullie heer, de hoogste.\"",
            "verse 79:25": "En Allah greep hem met de bestraffing voor het eerste en het laatste (van wat hij zei).\"",
            "verse 79:26": "Voorwaar, daarin is zeker onderricht voor wie (Allah) vreest.",
            "verse 79:27": "Is de schepping van jullie moeilijker dan die van de hemel die Hij gebouwd heeft?",
            "verse 79:28": "Hij verhief haar (de hemel) en vervolmaakte haar.",
            "verse 79:29": "En Hij maakte haar nacht duister en Hij maakte haar dag licht.",
            "verse 79:30": "En daarna spreidde Hij de aarde uit.",
            "verse 79:31": "En Hij bracht uit haar haar water en planten tevoorschijn.",
            "verse 79:32": "En Hij verstevigde de bergen.",
            "verse 79:33": "Als een voorziening voor jullie en voor jullie vee.",
            "verse 79:34": "Wanneer dan de overweldigende gebeurtenis plaatsvindt.",
            "verse 79:35": "Op die Dag zal de mens zich herinneren wat hij bedreef.",
            "verse 79:36": "En de Hel zal getoond worden aan wie ziet.",
            "verse 79:37": "Wat betreft degene die overtrad.",
            "verse 79:38": "En de voorkeur gaf aan het wereldse leven.",
            "verse 79:39": "Voorwaar, de Hel is de verblijfplaats!",
            "verse 79:40": "En wat betreft degene die de macht van zijn Heer vreesde en zijn ziel weerhield van slechte begeerten.",
            "verse 79:41": "Voorwaar, het Paradijs is de verblijfplaats.",
            "verse 79:42": "Zij vragen jou naar het Uur: \"Wanneer zal het plaatsvinden?\"",
            "verse 79:43": "Hoe kan jij dat noemen?",
            "verse 79:44": "Bij jouw Heer is de kennis daarover.",
            "verse 79:45": "Voorwaar, jij bent slechts een vermaner voor wie het (Uur) vreest.",
            "verse 79:46": "Op de Dag dat zij het (Uur) zien, zal het zijn alsof zij slechts een avond of de morgen op de aarde verbleven."
        },
        "English": {
            "verse 79:1": "By those [angels] who extract with violence",
            "verse 79:2": "And [by] those who remove with ease",
            "verse 79:3": "And [by] those who glide [as if] swimming",
            "verse 79:4": "And those who race each other in a race",
            "verse 79:5": "And those who arrange [each] matter,",
            "verse 79:6": "On the Day the blast [of the Horn] will convulse [creation],",
            "verse 79:7": "There will follow it the subsequent [one].",
            "verse 79:8": "Hearts, that Day, will tremble,",
            "verse 79:9": "Their eyes humbled.",
            "verse 79:10": "They are [presently] saying, \"Will we indeed be returned to [our] former state [of life]?",
            "verse 79:11": "Even if we should be decayed bones?",
            "verse 79:12": "They say, \"That, then, would be a losing return.\"",
            "verse 79:13": "Indeed, it will be but one shout,",
            "verse 79:14": "And suddenly they will be [alert] upon the earth's surface.",
            "verse 79:15": "Has there reached you the story of Moses? -",
            "verse 79:16": "When his Lord called to him in the sacred valley of Tuwa,",
            "verse 79:17": "\"Go to Pharaoh. Indeed, he has transgressed.",
            "verse 79:18": "And say to him, 'Would you [be willing to] purify yourself",
            "verse 79:19": "And let me guide you to your Lord so you would fear [Him]?'\"",
            "verse 79:20": "And he showed him the greatest sign,",
            "verse 79:21": "But Pharaoh denied and disobeyed.",
            "verse 79:22": "Then he turned his back, striving.",
            "verse 79:23": "And he gathered [his people] and called out",
            "verse 79:24": "And said, \"I am your most exalted lord.\"",
            "verse 79:25": "So Allah seized him in exemplary punishment for the last and the first [transgression].",
            "verse 79:26": "Indeed in that is a warning for whoever would fear [Allah].",
            "verse 79:27": "Are you a more difficult creation or is the heaven? Allah constructed it.",
            "verse 79:28": "He raised its ceiling and proportioned it.",
            "verse 79:29": "And He darkened its night and extracted its brightness.",
            "verse 79:30": "And after that He spread the earth.",
            "verse 79:31": "He extracted from it its water and its pasture,",
            "verse 79:32": "And the mountains He set firmly",
            "verse 79:33": "As provision for you and your grazing livestock.",
            "verse 79:34": "But when there comes the greatest Overwhelming Calamity -",
            "verse 79:35": "The Day when man will remember that for which he strove,",
            "verse 79:36": "And Hellfire will be exposed for [all] those who see -",
            "verse 79:37": "So as for he who transgressed",
            "verse 79:38": "And preferred the life of the world,",
            "verse 79:39": "Then indeed, Hellfire will be [his] refuge.",
            "verse 79:40": "But as for he who feared the position of his Lord and prevented the soul from [unlawful] inclination,",
            "verse 79:41": "Then indeed, Paradise will be [his] refuge.",
            "verse 79:42": "They ask you, [O Muhammad], about the Hour: when is its arrival?",
            "verse 79:43": "In what [position] are you that you should mention it?",
            "verse 79:44": "To your Lord is its finality.",
            "verse 79:45": "You are only a warner for those who fear it.",
            "verse 79:46": "It will be, on the Day they see it, as though they had not remained [in the world] except for an afternoon or a morning thereof."
        },
        "Filipino": {
            "verse 79:1": "Sa pamamagitan ng (mga anghel) na bumabatak (sa kaluluwa ng mga walang pananampalataya at tampalasan) ng may matinding dahas",
            "verse 79:2": "Sa pamamagitan ng (mga anghel) na mabanayad na kumukuha (ng kaluluwa ng mga sumasampalataya at mapapalad)",
            "verse 79:3": "At sa pamamagitan ng (mga anghel) na bumababa sa kalangitan na may dalang pag-uutos ng kanilang Panginoon (o ang mga lumilipad [na mga anghel] o lumalangoy [na mga planeta] sa kanilang daan o landas",
            "verse 79:4": "At sa pamamagitan nila na nagpapatuloy na nangunguna na katulad ng isang karera (alalaong baga, ang mga anghel, o mga bituin o mga kabayo, atbp)",
            "verse 79:5": "At sa pamamagitan ng mga anghel na nagsasaayos upang gawin ang Pag-uutos ng kanilang Panginoon, (kaya’t katunayang kayo na hindi sumasampalataya ay tatawagin upang magsulit)",
            "verse 79:6": "Sa Araw na (kung ang unang Pag-ihip ng Tambuli ay gawin), ang kalupaan at kabundukan ay mayayanig nang marahas (at ang lahat ay mamamatay)",
            "verse 79:7": "Na susundan ng pangalawang Pag-ihip ng Tambuli (at ang lahat ay ibabangon)",
            "verse 79:8": "Sa Araw na ito, ang (ibang) mga puso ay magsisitibok sa pangamba at hapis",
            "verse 79:9": "Na ang kanilang mga mata ay nakatuon sa lupa",
            "verse 79:10": "Sa gayon , sila ay magtuturing: “Ano! Kami baga ay katotohanang ibabalik (na muli) sa aming dating anyo ng buhay",
            "verse 79:11": "Ano? Kahit kami ay lansag- lansag na mga buto na?”",
            "verse 79:12": "Sila ay magsasabi: “Ito, sa gayong pangyayari, ay isang pagbabalik na walang pakinabang!”",
            "verse 79:13": "Datapuwa’t katotohanang ito ay isang Hiyaw lamang (o isang Pag-ihip)",
            "verse 79:14": "At pagmasdan! Natagpuan nila ang kanilang sarili sa ibabaw ng lupa na buhay matapos ang kanilang kamatayan",
            "verse 79:15": "Narinig na ba ninyo ang kasaysayan ni Moises",
            "verse 79:16": "Nang siya ay tawagin ng kanyang Panginoon sa banal na Lambak ng Tuwa",
            "verse 79:17": "(Na nagsasabi): “Pumaroon ka kay Paraon. Katotohanang siya ay nagmalabis sa pagsuway at paglabag (sakanyangmgakasalanan, kawalanngpananalig, pagsamba sa mga diyus-diyosan, atbp.).”",
            "verse 79:18": "At iyong sabihin (sa kanya): “Nais mo bang dalisayin ang iyong sarili (sa kasalanan ng kawalang pananalig, sa pagiging isang mananampalataya)",
            "verse 79:19": "At upang mapatnubayan kita sa iyong Panginoon, at ikaw ay magkaroon ng pagkatakot sa Kanya?”",
            "verse 79:20": "At ipinamalas ni Moises sa kanya ang dakilang Tanda (mga himala)",
            "verse 79:21": "Datapuwa’t si Paraon ay nagtakwil dito at sumuway",
            "verse 79:22": "At siya ay tumalikod na labis na tumututol (laban kay Allah)",
            "verse 79:23": "At kanyang tinipon ang kanyang tao (at mga sundalo) at sumigaw ng malakas",
            "verse 79:24": "Na nagsasabi: “ Ako ang inyong panginoon, ang kataas-taasan.”",
            "verse 79:25": "Datapuwa’t sinakmal siya ni Allah ng kaparusahan, (at ginawa siya) na isang halimbawa, sa Kabilang Buhay , at sa buhay na ito",
            "verse 79:26": "Katotohanang naririto ang isang nagtuturong tagubilin (at aral) sa sinumang may pagkatakot kay Allah",
            "verse 79:27": "Ano? Kayo baga ay higit na mahirap likhain kaysa sa kalangitan na Kanyang itinatag",
            "verse 79:28": "Sa kaitaasan ay Kanyang itinaas ang kulandong nito at Kanyang ginawaran yaon nang kaayusan at pagiging ganap",
            "verse 79:29": "Ang kanyang gabi ay nilukuban Niya ng kadiliman, at ang kanyang katanghalian ay ginawaran Niya ng liwanag",
            "verse 79:30": "At matapos ito, ay inilatag Niya ang kalupaan nang malawak",
            "verse 79:31": "At nagpasibol Siya mula rito ng kanyang tubig at kanyang pastulan (na luntiang halaman)",
            "verse 79:32": "At ang kabundukan ay itinindig Niya nang matatag",
            "verse 79:33": "Bilang kapakinabangan sa inyo at sa inyong bakahan (at hayupan)",
            "verse 79:34": "Datapuwa’t kung dumatal na ang dakilang kapinsalaan (alalaong baga, ang Araw ng Kabayaran, atbp)",
            "verse 79:35": "Sa Araw na ang tao ay makakaala-ala ng lahat ng kanyang pinagsumikapan (pinagdaanang mga gawa)",
            "verse 79:36": "At ang Apoy ng Impiyerno Ay Ganap Namatatambadngmalapit Sa(bawat) isa na nakamasid",
            "verse 79:37": "At sa kanya na nag-Tagha (lumabag at sumuway sa lahat ng hangganan na itinakda ni Allah, kawalan ng paniniwala, pang-aapi, kasamaan, atbp)",
            "verse 79:38": "At minahalaga ang buhay sa mundong ito (sa pamamagitan ng pagsunod sa kanyang masamang hangarin at mga pagnanasa)",
            "verse 79:39": "Katotohanan! Ang kanyang pananahanan ay Apoy ng Impiyerno",
            "verse 79:40": "Datapuwa’t siya na may pagkatakot sa kanyang pagharap (sa pagsusulit) sa kanyang Panginoon, at nagtimpi ng kanyang sarili sa marumi at maitim na hangarin at pagnanasa",
            "verse 79:41": "Katotohanan! Ang kanilang pananahanan ay Halamanan (ng Paraiso)",
            "verse 79:42": "Sila ay nagtatanong sa iyo (o Muhammad) tungkol sa oras? Kailan kaya ang kanyang takdang panahon",
            "verse 79:43": "Ikaw ay walang Kaalaman na magpahayag ng anuman (tungkol) dito",
            "verse 79:44": "Nasa iyong Panginoon lamang (ang Kaalaman) ng Takdang Araw",
            "verse 79:45": "At ikaw (o Muhammad) ay isa lamang Tagapagbabala sa mga may pangangamba rito",
            "verse 79:46": "Sa Araw na ito ay kanilang mapagmamalas, (wari) bang sila ay umidlip lamang ng isang gabi sa mundong ito, (o ang pinakamatagal) ay hanggang sa pagdatal ng umaga"
        },
        "French": {
            "verse 79:1": "Par ceux qui arrachent violemment!",
            "verse 79:2": "Et par ceux qui recueillent avec douceur!",
            "verse 79:3": "Et par ceux qui voguent librement,",
            "verse 79:4": "puis s'élancent à toute vitesse,",
            "verse 79:5": "et règlent les affaires!",
            "verse 79:6": "Le jour où [la terre] tremblera [au premier son du clairon]",
            "verse 79:7": "immédiatement suivi du deuxième.",
            "verse 79:8": "Ce jour-là, il y aura des cœurs qui seront agités d'effroi,",
            "verse 79:9": "et leurs regards se baisseront.",
            "verse 79:10": "Ils disent: «Quoi! Serons-nous ramenés à notre vie première,",
            "verse 79:11": "quand nous serons ossements pourris?»",
            "verse 79:12": "Ils disent: «ce sera alors un retour ruineux!»",
            "verse 79:13": "Il n'y aura qu'une sommation,",
            "verse 79:14": "et voilà qu'ils seront sur la terre (ressuscités).",
            "verse 79:15": "Le récit de Moïse t'est-il parvenu?",
            "verse 79:16": "Quand son Seigneur l'appela, dans Towâ, la vallée sanctifiée:",
            "verse 79:17": "«Va vers Pharaon. Vraiment, il s'est rebellé!»",
            "verse 79:18": "Puis dis-lui: «Voudrais-tu te purifier?",
            "verse 79:19": "et que je te guide vers ton Seigneur afin que tu Le craignes?»",
            "verse 79:20": "Il lui fit voir le très grand miracle.",
            "verse 79:21": "Mais il le qualifia de mensonge et désobéit;",
            "verse 79:22": "Ensuite, il tourna le dos, s'en alla précipitamment,",
            "verse 79:23": "rassembla [les gens] et leur fit une proclamation,",
            "verse 79:24": "et dit: «C'est moi votre Seigneur, le très haut».",
            "verse 79:25": "Alors Allah le saisit de la punition exemplaire de l'au-delà et de celle d'ici-bas.",
            "verse 79:26": "Il y a certes là un sujet de réflexion pour celui qui craint.",
            "verse 79:27": "Etes-vous plus durs à créer? ou le ciel, qu'Il a pourtant construit?",
            "verse 79:28": "Il a élevé bien haut sa voûte, puis l'a parfaitement ordonné;",
            "verse 79:29": "Il a assombri sa nuit et fait luire son jour.",
            "verse 79:30": "Et quant à la terre, après cela, Il l'a étendue:",
            "verse 79:31": "Il a fait sortir d'elle son eau et son pâturage,",
            "verse 79:32": "et quant aux montagnes, Il les a ancrées,",
            "verse 79:33": "pour votre jouissance, vous et vos bestiaux.",
            "verse 79:34": "Puis quand viendra le grand cataclysme,",
            "verse 79:35": "le jour où l'homme se rappellera à quoi il s'est efforcé,",
            "verse 79:36": "l'Enfer sera pleinement visible à celui qui regardera...",
            "verse 79:37": "Quant à celui qui aura dépassé les limites",
            "verse 79:38": "et aura préféré la vie présente,",
            "verse 79:39": "alors, l'Enfer sera son refuge...",
            "verse 79:40": "Et pour celui qui aura redouté de comparaître devant son Seigneur, et préservé son âme de la passion,",
            "verse 79:41": "le Paradis sera alors son refuge.",
            "verse 79:42": "Ils t'interrogent au sujet de l'Heure: «Quand va-t-elle jeter l'ancre?»",
            "verse 79:43": "Quelle [science] en as-tu pour le leur dire?",
            "verse 79:44": "Son terme n'est connu que de ton Seigneur.",
            "verse 79:45": "Tu n'es que l'avertisseur de celui qui la redoute.",
            "verse 79:46": "Le jour où ils la verront, il leur semblera n'avoir demeuré qu'un soir ou un matin."
        },
        "Fulah": {
            "verse 79:1": "Alla woondirii malayka en pooɗooji pittaali pooɗgol cattungol",
            "verse 79:2": "Alla woondirii malayka en ittatɗi pittaali e newuya",
            "verse 79:3": "Alla woondirii lummbatooɗi lummbagol",
            "verse 79:4": "Alla woondarii daɗandirooji daɗndirgol",
            "verse 79:5": "E Alla woondirii yiilayɗi yamiroore",
            "verse 79:6": "ñande dimmbii dimmbatnde",
            "verse 79:7": "Rewa e hendu woɗndu",
            "verse 79:8": "ɓerɗe ɗe ñande heen na kuli",
            "verse 79:9": "Ndaarɗe mum en na koyi",
            "verse 79:10": "Hoɓe mbi*a mbela komin ruttatooɓe no min ngonirnoo",
            "verse 79:11": "Mbela somin ngontii ƴi*e ndappuɗe min nduttoto",
            "verse 79:12": "ɓe mbi*a si min nduttiima sinnda de ɗum wona duttal pertungal",
            "verse 79:13": "ɗuum ko haacaango wooto",
            "verse 79:14": "Ndeke tan ɓe ngontii wuurɓe",
            "verse 79:15": "taw si arii e maaɗa Yewtere fii Muusaa",
            "verse 79:16": "Tuma nde joom Makko noddi mbo ka caatngol Tuwaa",
            "verse 79:17": "Yahu ka Fir`awna, pellet, kanko o bewi",
            "verse 79:18": "Maakan mbo mbela woodanaani ma nde laaɓata e keefaraagal",
            "verse 79:19": "Mi feewnu ma e joom ma kulaa Mbo",
            "verse 79:20": "O holli mbo aaya mawɗo on",
            "verse 79:21": "O fennii o woopi",
            "verse 79:22": "Refti o runtii hombo yaha",
            "verse 79:23": "O renndini o noddi",
            "verse 79:24": "O wi*i ko miin woni joom mon ɓurɗo toowde",
            "verse 79:25": "Alla nanngiri mbo lepte cakkitiiɗe e gadane",
            "verse 79:26": "Wonii e ɗuum teskuya wonande kulɗo Alla",
            "verse 79:27": "Mbela ko tagde mon ɓuri sattude wolla ko kammu mbo O mahi o",
            "verse 79:28": "O ɓamti mbildi mammbo O fotndi mbo",
            "verse 79:29": "O niɓɓaɗini jemma makko O yaltini annoore makko",
            "verse 79:30": "E leydi ndi caggal ɗuum O werti ndi. @Corrected",
            "verse 79:31": "O yaltini heen ndiyam mayri e durngol mayri",
            "verse 79:32": "Pelle ɗe O ñiɓi ɗe",
            "verse 79:33": "Ngam wona nafoore mon e kulle mon",
            "verse 79:34": "Si wuttaandu ɗimmuru ndu arii",
            "verse 79:35": "ñalawma mbo kala aade siftori ko o yahnoo",
            "verse 79:36": "Yiite nge ɓannginane wonande oon ji*oowo",
            "verse 79:37": "Tawi ko oon bewɗo",
            "verse 79:38": "O ɓurni nguurndam aduna",
            "verse 79:39": "Ko yiite woni hoɗorde makko",
            "verse 79:40": "Tawi ko oon kulɗo daraade e yeeso joom makko o haɗi fittaandu belaaɗe",
            "verse 79:41": "Ko aljanna woni hoɗorde makko",
            "verse 79:42": "Hoɓe naaamna Ma ndey darnga daroto",
            "verse 79:43": "A alanah ɗum ganndal saka kaala ɗum",
            "verse 79:44": "Ko e joom ma tan woni haaɗtirde ganndal darnga",
            "verse 79:45": "Ngonɗa tan ko jeertinoowo wonande kulɗo mbo",
            "verse 79:46": "Elle kamɓe ñande ɓe nji*ata darnga ɓe ñiiɓaani si wonah kikiiɗa yel wolla feññaange"
        },
        "German": {
            "verse 79:1": "Bei den mit Heftigkeit Entreißenden",
            "verse 79:2": "und den leicht Herausziehenden",
            "verse 79:3": "und den unbeschwert Dahingleitenden,",
            "verse 79:4": "den allem Vorauseilenden,",
            "verse 79:5": "den eine Angelegenheit Regelnden!",
            "verse 79:6": "Am Tag, da das Zittern einsetzt",
            "verse 79:7": "und das nächste hinterherfolgt,",
            "verse 79:8": "(gewisse) Herzen werden an jenem Tag beunruhigt klopfen,",
            "verse 79:9": "und ihre Blicke werden demütig sein.",
            "verse 79:10": "Sie sagen: \"Sollen wir denn wirklich aus den Gräbern zurückgebracht werden?",
            "verse 79:11": "Wenn wir zu verrotteten Knochen geworden sind?\"",
            "verse 79:12": "Sie sagen: \"Das wäre dann eine verlustreiche Wiederkehr.\"",
            "verse 79:13": "Es wird nur ein einziger erschreckender Schrei sein,",
            "verse 79:14": "und sogleich sind sie auf der Oberfläche.",
            "verse 79:15": "Ist zu dir die Geschichte Musas gekommen?",
            "verse 79:16": "Als sein Herr ihn im geheiligten Tal Tuwa rief:",
            "verse 79:17": "\"Geh zu Fir'aun, denn gewiß, er überschreitet das Maß (an Frevel).",
            "verse 79:18": "Dann sag: Hast du (nicht) den Wunsch, dich zu läutern,",
            "verse 79:19": "und daß ich dich zu deinem Herrn rechtleite, so daß du gottesfürchtig wirst?\"",
            "verse 79:20": "Da zeigte er ihm das größte Zeichen.",
            "verse 79:21": "Er aber erklärte (es) für Lüge und widersetzte sich.",
            "verse 79:22": "Hierauf kehrte er den Rücken und ging eilig weg'.",
            "verse 79:23": "Da versammelte er (das Volk) und rief dann aus.",
            "verse 79:24": "Er sagte: \"Ich bin euer höchster Herr.\"",
            "verse 79:25": "Da ergriff Allah ihn als warnendes Beispiel für das Jenseits und das Diesseits.",
            "verse 79:26": "Darin ist wahrlich eine Lehre für jemanden, der gottesfürchtig ist.",
            "verse 79:27": "Seid etwa ihr schwerer zu erschaffen oder der Himmel? - Er hat ihn aufgebaut.",
            "verse 79:28": "Er hat seinen höchsten Teil emporgehoben und ihn dann zurechtgeformt.",
            "verse 79:29": "Und Er hat seine Nacht finster gemacht und seine Morgenhelle hervorkommen lassen.",
            "verse 79:30": "Und die Erde, Er hat sie danach hingebreitet.",
            "verse 79:31": "Er hat aus ihr ihr Wasser und ihre Weide hervorkommen lassen.",
            "verse 79:32": "Und die Berge, Er hat sie fest gegründet.",
            "verse 79:33": "(Dies) als Nießbrauch für euch und für euer Vieh.",
            "verse 79:34": "Wenn dann der größte, überwältigende Umsturz kommt,",
            "verse 79:35": "am Tag, da der Mensch das bedenkt, worum er sich bemüht hat,",
            "verse 79:36": "und zum Erscheinen gebracht wird der Höllenbrand für (je)den, der sieht;",
            "verse 79:37": "was den (denjenigen) angeht, wer das Maß (an Frevel) überschritten",
            "verse 79:38": "und das diesseitige Leben vorgezogen hat,",
            "verse 79:39": "gewiß, so wird der Höllenbrand (ihm) Zufluchtsort sein.",
            "verse 79:40": "Was aber jemanden angeht, der den Stand seines Herrn gefürchtet und seiner Seele die (bösen) Neigungen untersagt hat,",
            "verse 79:41": "so wird der (Paradies)garten (ihm) Zufluchtsort sein.",
            "verse 79:42": "Sie fragen dich nach der Stunde, wann sie bloß feststehen wird.",
            "verse 79:43": "Was hast du über sie zu erwähnen?",
            "verse 79:44": "Zu deinem Herrn ist ihr Endziel.",
            "verse 79:45": "Du bist nur ein Überbringer von Warnungen für jemanden, der sie fürchtet.",
            "verse 79:46": "Am Tag, da sie sie sehen, wird ihnen sein, als hätten sie nur einen Nachmittag verweilt oder seinen (dazugehörigen) Vormittag"
        },
        "Hausa": {
            "verse 79:1": "Ina rantsuwa da mala'iku mãsu fisgar rãyuka (na kafirai) da ƙarfi.",
            "verse 79:2": "Da mãsu ɗibar rãyuka (na mũminai) da sauƙi a cikin nishãɗi.",
            "verse 79:3": "Da mãsu sauka daga sama da umurnin Allah kamar suna iyo.",
            "verse 79:4": "Sa'an nan, su zama mãsu gaugãwa (da umurnin Allah) kamar suna tsẽre.",
            "verse 79:5": "Sa, an nan, su kasance masu shirya gudanar da umurni.",
            "verse 79:6": "Rãnar da mai girgiza abũbuwa (bũsar farko) zã ta kaɗa.",
            "verse 79:7": "Mai biyar ta (bũsa ta biyu) nã biye.",
            "verse 79:8": "Wasu zukãta, a rãnar nan, mãsu jin tsõro ne.",
            "verse 79:9": "Alhãli idãnunsu na ƙasƙantattu.",
            "verse 79:10": "Sunã cẽwa \"Ashe lalle zã a iya mayar da mu a kan sãwunmu?",
            "verse 79:11": "\"Ashe, idan muka zama ƙasusuwa rududdugaggu?\"",
            "verse 79:12": "Suka ce: \"Waccan kam kõmãwa ce, tãɓaɓɓiya!\"",
            "verse 79:13": "To, ita kam, tsãwa guda kawai ce.",
            "verse 79:14": "Sai kawai gã su a bãyan ƙasa.",
            "verse 79:15": "Shin, lãbãrin Mũsã ya zo maka?",
            "verse 79:16": "A lõkacin da Ubangijinsa Ya kirãye shi, a cikin kwari mai tsarki, wato Duwã?",
            "verse 79:17": "Ka tafi zuwa ga Fir'auna, lalle ne shi, ya ƙẽtare haddi.",
            "verse 79:18": "\"Sai ka ce masa, Kõ zã ka so ka tsarkaka.",
            "verse 79:19": "\"Kuma in shiryar da kai zuwa ga Ubangijinka domin ka ji tsoronSa?\"",
            "verse 79:20": "Sai ya nũna masa ãyar nan mafi girma.",
            "verse 79:21": "Sai ya ƙaryata, kuma ya sãɓa (umurni),",
            "verse 79:22": "Sa'an nan ya jũya bãya, yanã tafiya da sauri.",
            "verse 79:23": "Sai ya yi gayya, sa'an nan ya yi kira.",
            "verse 79:24": "Sai ya ce: \"Nĩ ne Ubangijinku mafi ɗaudaka.\"",
            "verse 79:25": "Sabõda haka Allah Ya kama shi, dõmin azãbar maganar ƙarshe da ta farko.",
            "verse 79:26": "Lalle ne, a cikin wannan haƙiƙa akwai abin kula ga wanda yake tsõron Allah.",
            "verse 79:27": "Shin, kũ ne mafi wuyar halitta ko sama? Allah Ya gina ta.",
            "verse 79:28": "Ya ɗaukaka rufinta, sa'an nan Ya daidaita ta.",
            "verse 79:29": "Kuma Ya duhuntar da darenta, kuma Ya fitar da hantsinta.",
            "verse 79:30": "Kuma, ƙasa a bayan haka Ya mulmula ta.",
            "verse 79:31": "Ya fitar da ruwanta daga gare ta da makiyãyarta.",
            "verse 79:32": "Da duwatsu, Yã kafe ta.",
            "verse 79:33": "Domin jiyarwa dãɗi a gare ku, kuma ga dabbõbinku.",
            "verse 79:34": "To, idan uwar masĩfu, mafi girma, ta zo.",
            "verse 79:35": "Rãnar da mutum zai yi tunãnin abin da ya aikata.",
            "verse 79:36": "Kuma, a bayyana Jahĩm ga mai gani.",
            "verse 79:37": "To, amma wanda ya yi girman kai.",
            "verse 79:38": "Kuma, ya zãɓi rãyuwa ta kusa, (wato dũniya).",
            "verse 79:39": "To, lalle ne Jahĩm, ita ce makõma.",
            "verse 79:40": "Kuma, amma wanda ya ji tsõron tsayi a gaba ga Ubangijinsa, kuma ya kange kansa daga son rai.",
            "verse 79:41": "To, lalle ne Aljanna ita ce makõma.",
            "verse 79:42": "Sunã tambayar ka game da sa'a, wai yaushe ne matabbatarta?",
            "verse 79:43": "Me ya haɗã ka da ambatonta?",
            "verse 79:44": "Zuwa ga Ubangijinka ƙarshen al'amarinta yake.",
            "verse 79:45": "Kai mai gargaɗi kawai ne ga mai tsõron ta.",
            "verse 79:46": "Kamar sũ a rãnar da zã su gan ta, ba su zauna ba fãce a lõkacin marẽce ko hantsinsa."
        },
        "Hindi": {
            "verse 79:1": "उन (फ़रिश्तों) की क़सम",
            "verse 79:2": "जो (कुफ्फ़ार की रूह) डूब कर सख्ती से खींच लेते हैं",
            "verse 79:3": "और उनकी क़सम जो (मोमिनीन की जान) आसानी से खोल देते हैं",
            "verse 79:4": "और उनकी क़सम जो (आसमान ज़मीन के दरमियान) पैरते फिरते हैं",
            "verse 79:5": "फिर एक के आगे बढ़ते हैं",
            "verse 79:6": "फिर (दुनिया के) इन्तज़ाम करते हैं (उनकी क़सम) कि क़यामत हो कर रहेगी",
            "verse 79:7": "जिस दिन ज़मीन को भूचाल आएगा फिर उसके पीछे और ज़लज़ला आएगा",
            "verse 79:8": "उस दिन दिलों को धड़कन होगी",
            "verse 79:9": "उनकी ऑंखें (निदामत से) झुकी हुई होंगी",
            "verse 79:10": "कुफ्फ़ार कहते हैं कि क्या हम उलटे पाँव (ज़िन्दगी की तरफ़) फिर लौटेंगे",
            "verse 79:11": "क्या जब हम खोखल हड्डियाँ हो जाएँगे",
            "verse 79:12": "कहते हैं कि ये लौटना तो बड़ा नुक़सान देह है",
            "verse 79:13": "वह (क़यामत) तो (गोया) बस एक सख्त चीख़ होगी",
            "verse 79:14": "और लोग शक़ बारगी एक मैदान (हश्र) में मौजूद होंगे",
            "verse 79:15": "(ऐ रसूल) क्या तुम्हारे पास मूसा का किस्सा भी पहुँचा है",
            "verse 79:16": "जब उनको परवरदिगार ने तूवा के मैदान में पुकारा",
            "verse 79:17": "कि फिरऔन के पास जाओ वह सरकश हो गया है",
            "verse 79:18": "(और उससे) कहो कि क्या तेरी ख्वाहिश है कि (कुफ्र से) पाक हो जाए",
            "verse 79:19": "और मैं तुझे तेरे परवरदिगार की राह बता दूँ तो तुझको ख़ौफ (पैदा) हो",
            "verse 79:20": "ग़रज़ मूसा ने उसे (असा का बड़ा) मौजिज़ा दिखाया",
            "verse 79:21": "तो उसने झुठला दिया और न माना",
            "verse 79:22": "फिर पीठ फेर कर (ख़िलाफ़ की) तदबीर करने लगा",
            "verse 79:23": "फिर (लोगों को) जमा किया और बुलन्द आवाज़ से चिल्लाया",
            "verse 79:24": "तो कहने लगा मैं तुम लोगों का सबसे बड़ा परवरदिगार हूँ",
            "verse 79:25": "तो ख़ुदा ने उसे दुनिया और आख़ेरत (दोनों) के अज़ाब में गिरफ्तार किया",
            "verse 79:26": "बेशक जो शख़्श (ख़ुदा से) डरे उसके लिए इस (किस्से) में इबरत है",
            "verse 79:27": "भला तुम्हारा पैदा करना ज्यादा मुश्किल है या आसमान का",
            "verse 79:28": "कि उसी ने उसको बनाया उसकी छत को ख़ूब ऊँचा रखा",
            "verse 79:29": "फिर उसे दुरूस्त किया और उसकी रात को तारीक बनाया और (दिन को) उसकी धूप निकाली",
            "verse 79:30": "और उसके बाद ज़मीन को फैलाया",
            "verse 79:31": "उसी में से उसका पानी और उसका चारा निकाला",
            "verse 79:32": "और पहाड़ों को उसमें गाड़ दिया",
            "verse 79:33": "(ये सब सामान) तुम्हारे और तुम्हारे चारपायो के फ़ायदे के लिए है",
            "verse 79:34": "तो जब बड़ी सख्त मुसीबत (क़यामत) आ मौजूद होगी",
            "verse 79:35": "जिस दिन इन्सान अपने कामों को कुछ याद करेगा",
            "verse 79:36": "और जहन्नुम देखने वालों के सामने ज़ाहिर कर दी जाएगी",
            "verse 79:37": "तो जिसने (दुनिया में) सर उठाया था",
            "verse 79:38": "और दुनियावी ज़िन्दगी को तरजीह दी थी",
            "verse 79:39": "उसका ठिकाना तो यक़ीनन दोज़ख़ है",
            "verse 79:40": "मगर जो शख़्श अपने परवरदिगार के सामने खड़े होने से डरता और जी को नाजायज़ ख्वाहिशों से रोकता रहा",
            "verse 79:41": "तो उसका ठिकाना यक़ीनन बेहश्त है",
            "verse 79:42": "(ऐ रसूल) लोग तुम से क़यामत के बारे में पूछते हैं",
            "verse 79:43": "कि उसका कहीं थल बेड़ा भी है",
            "verse 79:44": "तो तुम उसके ज़िक्र से किस फ़िक्र में हो",
            "verse 79:45": "उस (के इल्म) की इन्तेहा तुम्हारे परवरदिगार ही तक है तो तुम बस जो उससे डरे उसको डराने वाले हो",
            "verse 79:46": "जिस दिन वह लोग इसको देखेंगे तो (समझेंगे कि दुनिया में) बस एक शाम या सुबह ठहरे थे"
        },
        "Indonesian": {
            "verse 79:1": "Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras,",
            "verse 79:2": "dan (malaikat-malaikat) yang mencabut (nyawa) dengan lemah-lembut,",
            "verse 79:3": "dan (malaikat-malaikat) yang turun dari langit dengan cepat,",
            "verse 79:4": "dan (malaikat-malaikat) yang mendahului dengan kencang,",
            "verse 79:5": "dan (malaikat-malaikat) yang mengatur urusan (dunia).",
            "verse 79:6": "(Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama menggoncang alam,",
            "verse 79:7": "tiupan pertama itu diiringi oleh tiupan kedua.",
            "verse 79:8": "Hati manusia pada waktu itu sangat takut,",
            "verse 79:9": "Pandangannya tunduk.",
            "verse 79:10": "(Orang-orang kafir) berkata: \"Apakah sesungguhnya kami benar-benar dikembalikan kepada kehidupan semula?",
            "verse 79:11": "Apakah (akan dibangkitkan juga) apabila kami telah menjadi tulang belulang yang hancur lumat?\"",
            "verse 79:12": "Mereka berkata: \"Kalau demikian, itu adalah suatu pengembalian yang merugikan\".",
            "verse 79:13": "Sesungguhnya pengembalian itu hanyalah satu kali tiupan saja,",
            "verse 79:14": "maka dengan serta merta mereka hidup kembali di permukaan bumi.",
            "verse 79:15": "Sudah sampaikah kepadamu (ya Muhammad) kisah Musa.",
            "verse 79:16": "Tatkala Tuhannya memanggilnya di lembah suci ialah Lembah Thuwa;",
            "verse 79:17": "\"Pergilah kamu kepada Fir'aun, sesungguhnya dia telah melampaui batas,",
            "verse 79:18": "dan katakanlah (kepada Fir'aun): \"Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)\".",
            "verse 79:19": "Dan kamu akan kupimpin ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?\"",
            "verse 79:20": "Lalu Musa memperlihatkan kepadanya mukjizat yang besar.",
            "verse 79:21": "Tetapi Fir'aun mendustakan dan mendurhakai.",
            "verse 79:22": "Kemudian dia berpaling seraya berusaha menantang (Musa).",
            "verse 79:23": "Maka dia mengumpulkan (pembesar-pembesarnya) lalu berseru memanggil kaumnya.",
            "verse 79:24": "(Seraya) berkata: \"Akulah tuhanmu yang paling tinggi\".",
            "verse 79:25": "Maka Allah mengazabnya dengan azab di akhirat dan azab di dunia.",
            "verse 79:26": "Sesungguhnya pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Tuhannya).",
            "verse 79:27": "Apakah kamu lebih sulit penciptaanya ataukah langit? Allah telah membinanya,",
            "verse 79:28": "Dia meninggikan bangunannya lalu menyempurnakannya,",
            "verse 79:29": "dan Dia menjadikan malamnya gelap gulita, dan menjadikan siangnya terang benderang.",
            "verse 79:30": "Dan bumi sesudah itu dihamparkan-Nya.",
            "verse 79:31": "Ia memancarkan daripadanya mata airnya, dan (menumbuhkan) tumbuh-tumbuhannya.",
            "verse 79:32": "Dan gunung-gunung dipancangkan-Nya dengan teguh,",
            "verse 79:33": "(semua itu) untuk kesenanganmu dan untuk binatang-binatang ternakmu.",
            "verse 79:34": "Maka apabila malapetaka yang sangat besar (hari kiamat) telah datang.",
            "verse 79:35": "Pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya,",
            "verse 79:36": "dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat.",
            "verse 79:37": "Adapun orang yang melampaui batas,",
            "verse 79:38": "dan lebih mengutamakan kehidupan dunia,",
            "verse 79:39": "maka sesungguhnya nerakalah tempat tinggal(nya).",
            "verse 79:40": "Dan adapun orang-orang yang takut kepada kebesaran Tuhannya dan menahan diri dari keinginan hawa nafsunya,",
            "verse 79:41": "maka sesungguhnya surgalah tempat tinggal(nya).",
            "verse 79:42": "(Orang-orang kafir) bertanya kepadamu (Muhammad) tentang hari kebangkitan, kapankah terjadinya?",
            "verse 79:43": "Siapakah kamu (maka) dapat menyebutkan (waktunya)?",
            "verse 79:44": "Kepada Tuhanmulah dikembalikan kesudahannya (ketentuan waktunya).",
            "verse 79:45": "Kamu hanyalah pemberi peringatan bagi siapa yang takut kepadanya (hari berbangkit)",
            "verse 79:46": "Pada hari mereka melihat hari berbangkit itu, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari."
        },
        "Italian": {
            "verse 79:1": "Per gli strappanti violenti! [La maggior parte degli esegeti ritiene che i soggetti dell'invocazione espressa nei primi cinque versetti siano gli angeli incaricati di prendere le anime dei moribondi. In base a questa ipotesi sarà possibile formulare la traduzione interpretativa con parole molto diverse da quelle del testo coranico. Lo faremo nelle note per proporre al lettore il significato comunemente accettato dall'esegesi islamica] [“Per gli angeli che strappano le anime degli empi con violenza!”]",
            "verse 79:2": "Per i correnti veloci! [“Per gli angeli che delicatamente ritirano le anime dei credenti!”]",
            "verse 79:3": "Per i nuotanti leggeri! [“Per gli angeli che fluttuano liberamente nello spazio!”]",
            "verse 79:4": "Per i sopravanzanti con foga [“Per gli angeli che energicamente precedono le anime dei beati!”]",
            "verse 79:5": "per sistemare ogni cosa! [“Per gli angeli che fanno applicare i decreti di Allah!”]",
            "verse 79:6": "Il Giorno in cui risuonerà il Risuonante, [“il Risuonante”: il Corno del Giudizio fa risuonare il primo dei tre squilli fatidici. Si potrebbe anche tradurre: “il Giorno in cui la terra tremerà violentemente”]",
            "verse 79:7": "al quale seguirà il successivo, [“seguirà il successivo”: il secondo squillo del Corno, quello a cui risponderanno i morti, alzandosi dalle loro tombe, oppure “e sarà reiterata la scossa”]",
            "verse 79:8": "il quel Giorno tremeranno i cuori",
            "verse 79:9": "e saranno abbassati gli sguardi.",
            "verse 79:10": "Dicono: “Saremo ricondotti [sulla terra]",
            "verse 79:11": "quando già saremo ossa marcite?”.",
            "verse 79:12": "Dicono: “Sarebbe questo un disastroso ritorno!”.",
            "verse 79:13": "Ci sarà un solo grido,",
            "verse 79:14": "ed eccoli risvegliati, sulla superficie [della terra].",
            "verse 79:15": "Non ti giunse [o Muhammad] la storia di Mosè?",
            "verse 79:16": "Quando lo chiamò il suo Signore, nella valle santa di Tuwâ:",
            "verse 79:17": "“Va' da Faraone, invero è divenuto un ribelle!”.",
            "verse 79:18": "E digli: Sei disposto a purificarti,",
            "verse 79:19": "sicché io ti guidi verso il tuo Signore e tu [Lo] tema?\".",
            "verse 79:20": "Gli mostrò poi il segno più grande.",
            "verse 79:21": "Ma quello tacciò di menzogna e disobbedì,",
            "verse 79:22": "poi volse le spalle e si distolse.",
            "verse 79:23": "Convocò [i notabili] e proclamò:",
            "verse 79:24": "“Sono io il vostro signore, l'altissimo”.",
            "verse 79:25": "Lo colpì Allah con il castigo nell'altra vita e in questa.",
            "verse 79:26": "In ciò vi è motivo di riflessione per chi è timorato [di Allah].",
            "verse 79:27": "Sareste voi più difficili da creare o il cielo che [Egli] ha edificato?",
            "verse 79:28": "Ne ha innalzato la volta e le ha dato perfetta armonia,",
            "verse 79:29": "ha fatto oscura la sua notte e ha fatto brillare il chiarore del suo giorno.",
            "verse 79:30": "Dopo di ciò ha esteso la terra:",
            "verse 79:31": "ne ha tratto l'acqua e i pascoli,",
            "verse 79:32": "e le montagne le ha ancorate,",
            "verse 79:33": "sì che ne godeste voi e il vostro bestiame.",
            "verse 79:34": "Poi, quando verrà il grande cataclisma,",
            "verse 79:35": "il Giorno in cui l'uomo ricorderà in cosa si è impegnato,",
            "verse 79:36": "e apparirà la Fornace per chi potrà vederla,",
            "verse 79:37": "colui che si sarà ribellato,",
            "verse 79:38": "e avrà preferito la vita terrena,",
            "verse 79:39": "avrà invero la Fornace per rifugio.",
            "verse 79:40": "E colui che avrà paventato di comparire davanti al suo Signore e avrà preservato l'animo suo dalle passioni,",
            "verse 79:41": "avrà invero il Giardino per rifugio.",
            "verse 79:42": "T'interpellano a proposito dell'Ora: “Quando giungerà?”.",
            "verse 79:43": "Che [scienza] ne hai per informarli?",
            "verse 79:44": "Al tuo Signore il termine.",
            "verse 79:45": "Tu non sei che un ammonitore per coloro che la paventano.",
            "verse 79:46": "Il Giorno in cui la vedranno, sarà come se fossero rimasti [sulla terra] una sera o un mattino."
        },
        "Japanese": {
            "verse 79:1": "荒々しく（罪深い者の魂を）引き離すものだおいて（誓う），",
            "verse 79:2": "優しく（信仰深い者の魂を）引き出すものにおいて，",
            "verse 79:3": "泳ぐように（慈悲の使いに）滑走するものにおいて，",
            "verse 79:4": "先を争って前進するものにおいて，",
            "verse 79:5": "（主の命令で）事を処理するものにおいて（誓う）。",
            "verse 79:6": "その日（第一のラッパで），震動が（凡てのものを）揺がし，",
            "verse 79:7": "次のラッパ（で震動）が，続く。",
            "verse 79:8": "（不信者の）心は，その日戦き震え，",
            "verse 79:9": "目を伏せるであろう。",
            "verse 79:10": "かれらは言う。「わたしたちは初め（生前）の状態に，本当に返るのでしょうか。",
            "verse 79:11": "何と，わたしたちは朽ち果てた骨になってしまったのに。」",
            "verse 79:12": "かれらは言う。「その場合（復活），損な戻りです。」",
            "verse 79:13": "（復活は），只一声の叫びである。",
            "verse 79:14": "見よ，かれらは目覚めて（地上に）現われる。",
            "verse 79:15": "ムーサーの物語が，あなたに届いたか。",
            "verse 79:16": "主がトワーの聖谷に，かれを呼ばれた時を思い起せ。",
            "verse 79:17": "（かれは仰せられた。）「あなたはフィルアウンの許に行け。本当にかれは目にあまる者である。",
            "verse 79:18": "そしてかれに言ってやるがいい。『あなたは（罪から）清められたいのか。",
            "verse 79:19": "わたしはあなたを，主の御許に導く。あなたは（かれを）畏れなさい。』」",
            "verse 79:20": "（ムーサーは）偉大な印をかれに示した。",
            "verse 79:21": "だがかれ（フィルアウン）はそれを嘘であるとし，（導きに）従わなかった。",
            "verse 79:22": "背を向けて急いで去った。",
            "verse 79:23": "かれ（フィルアウン）は，（その民を）集め宣言して，",
            "verse 79:24": "言った。「わたしはあなたがたの主，至高者である。」",
            "verse 79:25": "そこでアッラーはかれを懲しめ，来世と現世の生活に懲罰を加えられた。",
            "verse 79:26": "本当にこの中には（主を）畏れる者への一つの教訓がある。",
            "verse 79:27": "あなたがたは（かれが）うち建てられた天（の創造）が，あなたがたを創ることより難しいとでも思うのか。",
            "verse 79:28": "かれはそれを高く掲げ，それから整え，",
            "verse 79:29": "夜を暗くなされ，また，光明を現わされる。",
            "verse 79:30": "その後，大地を延べ広げられた。",
            "verse 79:31": "そこから水と牧場を現われさせ，",
            "verse 79:32": "また山々をそれにしっかりと据えられ，",
            "verse 79:33": "あなたがたとあなたがたの家畜のための，用益に供される。",
            "verse 79:34": "それで大きい災厄が来ると，",
            "verse 79:35": "その日，人々は（現世で）その努力したことを思い出し，",
            "verse 79:36": "また獄火は，誰でも見る（程の）者に（ありありと）現わされる。",
            "verse 79:37": "その時，酷く目にあまった者，",
            "verse 79:38": "またこの世の生活を重んじていた者は，",
            "verse 79:39": "本当に火獄がその住まいであろう。",
            "verse 79:40": "だが主の御前に立つことを恐れた者，また低劣な欲望に対し（自分の）魂を抑制した者は，",
            "verse 79:41": "本当に楽園がその住まいであろう。",
            "verse 79:42": "かれらはその時に就いて，あなたに問う。「それが到来するのは，何時（の日）ですか。」",
            "verse 79:43": "あなたは，何によってそれを告げられようか。",
            "verse 79:44": "その終末（の知識）は，あなたの主にあるだけ。",
            "verse 79:45": "あなたは，それを恐れる者への，一人の警告者に過ぎない。",
            "verse 79:46": "かれらがそれを見る日，（墓の中に）滞留していたのは，一夕か一朝に過ぎなかったように思うであろう。"
        },
        "Jawa": {
            "verse 79:1": "Demi (Malaikat - Malaikat) kang medhoti nyawane kelawan sora",
            "verse 79:2": "Demi (Malaikat - Malaikat) kang nglolosi nyawa kelawan alon (marang wong mukmin)",
            "verse 79:3": "Demi (Malaikat) kang tumurun saka langit kanti rikat",
            "verse 79:4": "Lan (Malaikat) kang dhisiki banter",
            "verse 79:5": "Lan (Malaikat) kang ngatur urusan (donya)",
            "verse 79:6": "(Satemene sira bakal ditangekake) ana dina nalika paniyupe slompret kawitan horege alam kabeh",
            "verse 79:7": "Nuli ditungka horege maneh kang kapindho",
            "verse 79:8": "Ing kono atine wong kang padha maido padha teratapan",
            "verse 79:9": "Pandelenge padha konjem (wedi)",
            "verse 79:10": "Padha celathu, \"Apa aku iki dibalekake urip maneh",
            "verse 79:11": "Sawise dadi balung kang pisah - pisah urip maneh",
            "verse 79:12": "Padha celathu, \"Yen mangkono baliku urup maneh aku bali kapitunan",
            "verse 79:13": "Ananging iku mung petak sapisan wae",
            "verse 79:14": "Lan mara delengen dheweke padha tangi",
            "verse 79:15": "Apa ora wis teka marang sira ceritane Musa",
            "verse 79:16": "Nalikane dipangandikani Pangerane ana jurang Thuwa",
            "verse 79:17": "Lungoo marang panggonane Fir’aun, awit kebangetan anggone kafir",
            "verse 79:18": "Dhawuha, \"Punapa paduka kepengin anuceni sarira",
            "verse 79:19": "Sarta kula badhe nuntun paduka dhateng Pangeran supados ajrih",
            "verse 79:20": "Banjur panjenengane ngatonake tondha kang gedhe marang dheweke",
            "verse 79:21": "Ananging dheweke anggorohake (kasunyatan) sarta pra ambangun turut",
            "verse 79:22": "Tumuli dheweke bali kalawan rerikatan",
            "verse 79:23": "Banjur ngumpulake (wong - wong) tumuli dhawuh",
            "verse 79:24": "Celathune, \"Aku iki Pangeranira Kang Maha Luhur",
            "verse 79:25": "Ananging Allah amatrapi dheweke kelawan pidana ing akherat sarta ing uripe kang dhisik",
            "verse 79:26": "Lelakone Fir’aun kasebut mesthi dadi wewulang kanggo wong kang wedi ing Allah",
            "verse 79:27": "Apa Allah angone nguripake sira saka pati luwuh angel tinimbang anggone gawe langit",
            "verse 79:28": "Andhuwurake payoning langit banjur warata tanpa cacat",
            "verse 79:29": "Gawe peteng wayahe wengi, sarta gawe padhang wayahe awan",
            "verse 79:30": "Sawuse mangkono Allah gelar bumi",
            "verse 79:31": "Alah metokake banyu lan thethukulan saka bumi",
            "verse 79:32": "Lan ngukuhake gunung ana bumi",
            "verse 79:33": "Kabeh dadi bebungah marang sira lan ingon - ingonira raja kaya",
            "verse 79:34": "Ing besuk tekane horeg - horegan (malapetaka) gedhe teka",
            "verse 79:35": "Dinane manungsa padha eling apa kang wus ditindhakake",
            "verse 79:36": "Lan neraka dipitontonake tumrap sapa sing deleng",
            "verse 79:37": "Wondene wong kang ambalasar (kafir)",
            "verse 79:38": "Sarta milih kauripan dunya",
            "verse 79:39": "Sayekti neraka iku panggonane",
            "verse 79:40": "Dene wong kang wedi anggone ngadhep ing ngarsaning Pangerane sarta anahan jiwane saka pepenginan asor",
            "verse 79:41": "Lah sayekti suwarga iku panggonane",
            "verse 79:42": "Dheweke padha takon marang sira prakara wayahe, endhi ketentuane (Qiyamat)",
            "verse 79:43": "Tumrap prakara apa? Sira iku wong kang angelingake prakara iku",
            "verse 79:44": "Marang pangeranira pantoging tujune prakara iku",
            "verse 79:45": "Sira iku mung juru pepeling tumrap wong kang wedi marang prakra iku",
            "verse 79:46": "Ing dinane dheweke andeleng kaya - kaya anggone manggon ora liya kajaba mung sasore utawa sakesuk"
        },
        "Kazakh": {
            "verse 79:1": "Қатты тартып, суырып алушылармен",
            "verse 79:2": "жеңіл етіп шығарып алушылармен",
            "verse 79:3": "және жылдам жүзушілермен",
            "verse 79:4": "солай, екпінді озушылармен",
            "verse 79:5": "бұйрықты орындаушылармен ант етемін",
            "verse 79:6": "Ол күні сілкінуші сілкінеді",
            "verse 79:7": "оған артынан келесісі жалғасады",
            "verse 79:8": "Ол күні жүректер тітірейді",
            "verse 79:9": "көздер қорлана бағынып, төмен қарайды",
            "verse 79:10": "Олар сенбеушілер : «Біз артқа қайтарыламыз ба",
            "verse 79:11": "Егер біз үгітілген сүйекке айналсақ та ма?» дейді",
            "verse 79:12": "Олар: «Ендеше, ол тиімсіз бір қайту екен», дейді",
            "verse 79:13": "Ақиқатында, ол бар болғаны бір ғана қатты дауыс",
            "verse 79:14": "Сонда олар жер бетінде тіріліп тұрады",
            "verse 79:15": "Саған Мұсаның хабары келді ме",
            "verse 79:16": "Кезінде қасиетті Тууа алқабында оған Раббысы үндеді",
            "verse 79:17": "«Фиръаунға бар, өйткені ол шектен шықты",
            "verse 79:18": "Әрі оған айт: «Сен тазаруды қалайсың ба",
            "verse 79:19": "Саған Раббыңа апаратын жолды көрсетейін. Сонда сен Оның жазасынан қорқатын боласың», деп",
            "verse 79:20": "Сөйтіп оған үлкен бір белгі-мұғжизаны көрсетті",
            "verse 79:21": "бірақ Фиръаун оны өтірікке шығарды және қарсы шықты",
            "verse 79:22": "Содан кейін ол теріс айналып, әрекетке кірісті",
            "verse 79:23": "Әрі халқын жинап, жар салды",
            "verse 79:24": "«Мен сендердің ең жоғарғы иелеріңмін», деп",
            "verse 79:25": "Сондықтан Аллаһ, оны соңғы, мәңгілік өмір ақирет және осы өмір азабымен жазалады",
            "verse 79:26": "Күмәнсіз, мұнда қорқатындар үшін бір ғибрат бар",
            "verse 79:27": "Жаратуда сендерді жарату қиын ба, әлде аспанды ма? Ол оны құрды",
            "verse 79:28": "оның төбесін көтеріп, оны теңестірді",
            "verse 79:29": "және оның түнін қараңғы етіп, күндіз жарығын шығарды",
            "verse 79:30": "Әрі одан кейін жерді жайды",
            "verse 79:31": "Одан жерден оның суы мен жайылымдарын шығарды",
            "verse 79:32": "және тауларды бекітіп орнықтырды",
            "verse 79:33": "сендердің пайдалануларың әрі малдарың үшін",
            "verse 79:34": "Ал, өте үлкен бір қасірет келген кезде",
            "verse 79:35": "сол күні адам не нәрсеге талпынғанын есіне алады",
            "verse 79:36": "және көрушілерге Жахим анық көрсетіледі",
            "verse 79:37": "Сонда кім шектен шыққан болса",
            "verse 79:38": "әрі бұл өмірді артық көрген болса",
            "verse 79:39": "онда күмәнсіз, оның баратын орны Жахим (Тозақ)",
            "verse 79:40": "Ал, кім Раббысының алдына тұрудан қорқып, өзін құмарлықтан қайтарса",
            "verse 79:41": "онда күмәнсіз, оның баратын орны жәннат",
            "verse 79:42": "Ей, Мұхаммед! Олар сенен Сағат Қиямет туралы: «Ол қашан болады?», деп сұрайды",
            "verse 79:43": "Ол туралы сен не айта аласың",
            "verse 79:44": "Оның ол жайлы толық мағлұматтың шегі Раббыңда",
            "verse 79:45": "сен тек одан Есеп күнінен қорыққандарды ғана ескерте аласың",
            "verse 79:46": "Олар оны қияметті көрген күні, дүниеде бір кеш немесе бір сәске уақыты тұрғандай болады"
        },
        "Korean": {
            "verse 79:1": "사납게 끄집어내는 천사를 두고 맹세코사악한 자들의 영혼을 강력하게 끌어가는 천사들을 두고 맹세 하사",
            "verse 79:2": "유연히 뽑아내는 천사를 두고 맹세코축복받은 자들의 형혼을 부드 럽게 인도하는 천사들을 두고 맹 세하며",
            "verse 79:3": "날렵히 유영하는 천사를 두고 맹세코계시를 전달하는 천사를 두고 맹세하며",
            "verse 79:4": "경쟁하듯 앞서가는 천사를 두고 맹세코경주하여 인도하는 천사들을 두고 맹세하며",
            "verse 79:5": "일을 결정짓는 천사를 두고 맹세코하나님의 명령들을 수행하는 천사들을 두고 맹세하나니",
            "verse 79:6": "그날 요동치는 것이 요동치고어느날 동요하게 될 모든 것 은 크게 동요하고",
            "verse 79:7": "뒤서는 것이 그것을 뒤따를 것이라뒤를 이어 동요가 반복되도다",
            "verse 79:8": "그날 마음은 떨리며그날의 마음들은 두근거리고",
            "verse 79:9": "그들의 시선은 떨구어질 것이라그들의 눈들은 밑으로 척져있 으며",
            "verse 79:10": "그들이 말하니 “진실로 우리가 이전 상태로 되돌아간단 말인가?”저희가 실로 이전의 상태로 돌아갈 수 있느뇨 라고 말하며",
            "verse 79:11": "“우리가 부스러지는 뼈가 되었는데도 그렇단 말인가?”우리가 부패한 뼈들만 남는 데도 그러하느뇨",
            "verse 79:12": "그들이 말하길 “그것은 그렇다면 손해가 될 귀환이라”그리하면 그것이 실로 잃은 귀로가 되리라 말하더라",
            "verse 79:13": "실로 그것은 한번의 고함 소리일 뿐이라그러나 그것은 단 한번이 될 것이라",
            "verse 79:14": "보라, 이제 그들은 원기 가득한 대지 위에 있노라그때 그들은 심판을 위하여 깨어나 있지 않느뇨",
            "verse 79:15": "그대(무함마드)에게 모세의 이야기가 도래하였는가모세의 이야기가 그대에게 이르렀느뇨",
            "verse 79:16": "그의 주님께서 성스러운 골짜기인 뚜와` 에서 그를 불렀노라주님께서 성스러운 계곡 뚜 와로 그를 불러",
            "verse 79:17": "“그대는 파라오에게로 가라, 실로 그는 경계를 넘어섰노라”파라오에게 가라 실로 그는 모든 영역을 벗어난 자이니",
            "verse 79:18": "“그리고 말하라 : 그대(파라오)는 깨끗해지길 바라는가?` ”그에게 이르러 죄악으로 부터스스로를 청결케 하고자 하느뇨",
            "verse 79:19": "“ 내가 그대를 그대 주님으로 인도하려 하니, 그렇게 그대는 (하나님을) 경외하게 될 것이라` “그리하면 내가 당신을 주님께로 인도하여 주리니 당신은 그 분만을 두려워 하라고 하라",
            "verse 79:20": "그 후 그(모세)는 그(파라오)에게 어마한 징표를 보여주었으나그래서 모세는 그에게 큰 예증을 보였더라",
            "verse 79:21": "그는 부인하고 불복하였노라그러나 파라오는 그 진리를 거역하고 오만해 하였으며",
            "verse 79:22": "그 후 그는 꽁무니를 빼며 (거역함에) 매진하니등을 돌리고 서둘러 떠나",
            "verse 79:23": "(사람들을) 모아 불렀노라사람들을 불러 모아 소리쳐 말하길",
            "verse 79:24": "그 후 그가 말하길 “짐은 그대들의 가장 지고한 주님이라”내가 가장 높이 있는 너희 주님이라 하였으니",
            "verse 79:25": "그리하여 하나님께서는 내세와 현세의 징계로서 그를 움켜잡으셨노라하나님은 그에게 내세와 현 세의 벌을 내리셨느니라",
            "verse 79:26": "진실로 이것에는 두려워하는 자를 위한 교훈이 있노라실로 이 안에는 하나님을 두려워하는 자들을 위한 교훈이 있 노라",
            "verse 79:27": "창조가 더 어려운 것은 그대들인가 아니면 하늘인가? 그분께서 그것(하늘)을 지으셨노라너희를 창조하는 것이 더 어렵느뇨 아니면 그분이 세우신 하 늘이겠느뇨",
            "verse 79:28": "그분께서는 그것(하늘)의 꼭대기를 올리셨고 그 후 그것을 균등하게 두셨으며하나님은 하늘을 가장 높이 두시고 거기에 질서와 온전함을 두셨노라",
            "verse 79:29": "그것의 밤을 어둡게 하셨고 그것의 아침빛을 내셨노라그분은 밤을 어둡게 두사 빛을 두셨노라",
            "verse 79:30": "땅은 그 후에 펼치셨고대지를 두시되 넓다랗게 펼 치시어",
            "verse 79:31": "그것(땅)으로부터 그것의 물과 목초(牧草)를 내셨으며그곳으로 부터 물과 초목을 생산케 하셨으며",
            "verse 79:32": "산은 단단히 고정시키셨으니산들을 두시되 온전하게 고 정하셨으니",
            "verse 79:33": "그대들과 그대들 가축을 위한 편의라너희와 가축들에게 유용케 하기 위해서라",
            "verse 79:34": "그리하여 엄청난 대재앙이 도래하였을 때그러나 대 재앙이 다가올 때",
            "verse 79:35": "그날 인간은 자신의 노력을 떠올릴 것이라그날은 인간이 행한 것들을 회상하는 날이며",
            "verse 79:36": "보는 자에게 지옥의 모습이 드러날 때지옥이 보는 자 앞에 나타날때",
            "verse 79:37": "경계를 넘어서면서오만하며 불신하고",
            "verse 79:38": "현세의 삶을 선호하던 자는현세의 삶만을 좋아했던 자 들에게는",
            "verse 79:39": "실로 타오르는 불지옥, 그곳이 거주지가 될 것이라거주지가 불지옥이 될 것이라",
            "verse 79:40": "그러나 자신의 주님 앞에 서는 일을 두려워하며 자신의 욕구를 절제하던 자는그러나 주님앞에 서는 것을 두려워하고 저속한 욕망들로부터 자신을 자제하였던 자들에게는",
            "verse 79:41": "실로 천국, 그곳이 거주지가 될 것이라거주지가 천국이 될 것이라",
            "verse 79:42": "그들이 그대(무함마드)에게 종말의 시간에 관해 물으니 “그것은 언제 개시된단 말인가?”그들은 그때가 언제 있을 것이냐고 그대에게 질문하나",
            "verse 79:43": "그것(개시 시간)의 언급에 관하여 그대가 어떤 관련이 있단 말인가그것을 언급하는 것이 그대 에게 관계되는 일이뇨",
            "verse 79:44": "그것의 지식은 그대 주님께만 있는 것이라종말은 그대 주님만 아시는 것으로",
            "verse 79:45": "그대는 오직 그것(종말의 시간)을 두려워하는 자를 위한 경고자일 뿐이라그대는 그것을 두려워 하는 자에게 경고하는 경고자에 불과하니라",
            "verse 79:46": "그것(종말의 시간)을 보는 날 그들은 마치 (현세에서) 오후나 아침나절만을 머물렀다 생각할 것이라그것을 보는 날 그들은 저녁이나 아침시간의 정도 머문 것 같이 느껴질 것이라"
        },
        "Kurdish": {
            "verse 79:1": "Bi wan (fireştene) can sitandne fereşandokسویند به‌و فریشتانه‌ی که گیانی خه‌ڵکی ده‌کێشن، یان به‌و ئه‌ستێرانه‌ی که له قوڵایی ئاسماندا ده‌دره‌وشێنه‌وه و ده‌سوڕێنه‌وه.",
            "verse 79:2": "Bi wan (fireştene) ku canan bi hêsanî distînin (û dev) bi keninسوێند به‌و فریشتانه‌ی که گیانی ئیمانداران ده‌کێشن به چالاکی و بێ وچان ده‌سوڕێنه‌وه (که‌س فه‌رامۆش ناکه‌ن).",
            "verse 79:3": "Û bi wan sitêrke (di hewa da) melevanî dikinسوێند به‌و فریشتانه‌ی که به گورجی فه‌رمانی خوا جێبه‌جێ ده‌که‌ن، یان به‌و ئه‌ستێرانه‌ی که له بۆشایی دا مه‌له ده‌که‌ن و ده‌سوڕێنه‌وه‌.",
            "verse 79:4": "Û bi wan (fireştene) daberhevne (ku ji hev) di borinهه‌روه‌ها سوێند به‌و فریشتانه‌ی که ڕۆحی ئیمانداران به‌په‌له به به‌هه‌شت شاد ده‌که‌ن و ڕۆحی کافرانیش به دۆزه‌خ ده‌گه‌یه‌نن، هه‌روه‌ها پێشبڕکێ ده‌که‌ن و گورج و گۆڵ و ئاماده‌ن بۆ ئه‌نجامدانی هه‌ر کارێك پێیان ده‌سپێردرێت.",
            "verse 79:5": "Bi wî yê ku bûyerana pêk tîne (sond di xum)سوێند به‌و فریشتانه‌ی (که به‌ویستی خوا) کارو فه‌رمان جێبه‌جێ ده‌که‌ن به رێك و پێکی.",
            "verse 79:6": "Ku roja (di stûrî da tê puf kirinê) hej(bi zemîn digire û ) di heje(سوێند به‌وانه هه‌مووی) له ڕۆژێکدا (فوو ده‌کرێت به صوردا، ده‌ستبه‌جێ) زه‌وی به توندی ته‌کان ده‌دات و ده‌که‌وێته له‌رزه و ژێره‌و ژوور ده‌بێت.",
            "verse 79:7": "Li peyda jî hejeke dinê digireدوایی دووباره فووی پیاده‌کرێته‌وه (مردووان زیندوو ده‌کرێنه‌وه و جیهانی هه‌میشه‌یی به‌رپا ده‌بێت).",
            "verse 79:8": "Di wê rojê da dil (ji mirûzûyê) di silikinله‌و ڕۆژه‌دا دڵانێك به خێرایی لێ ده‌ده‌ن، زۆر ده‌ترسن و زۆر په‌رێشانن.",
            "verse 79:9": "Çavê (xweyê wan dilan ji tirsa) di telisinخاوه‌نی ئه‌و دڵانه له ڕیسوایی و خه‌جاڵه‌تی و شه‌رمه‌زاریدا چاویان شۆڕه و ڕوویان نایه‌ت سه‌ر هه‌ڵببڕن.",
            "verse 79:10": "(Aha ) dibêjin: « ma qey bi rastî (ji piştî mirina me, ku em ketine goran) dîsa emê (wekî temtêla xweyê berê) rabin? »(ئه‌مانه کاتی خۆی) ده‌یانوت: باشه ئێمه له‌م گۆڕانه ده‌ردێین و زیندووده‌کرێینه‌وه‌؟...",
            "verse 79:11": "« Qey gava em bibûna hestûyê rizî jî ? »کاتێك بووینه ئێسکی ڕزیوو پرتوکاو؟!",
            "verse 79:12": "Ewan (aha) gotine: « bi rastî (eva) zivirandina zîyaneke(به گاڵته پێکردن و بێ بڕواییه‌وه‌) ده‌یانوت: ئه‌گه‌ر وابێت، گه‌ڕانه‌وه‌یه‌کی زۆر زیانبه‌خشه‌!!",
            "verse 79:13": "Îdî (eva) bi rastî zaroke bitenê ye(با خوانه‌ناسان چاك بزانن) به‌ڕاستی ته‌نها گه‌ڕانه‌وه‌یه یه‌ك تێخوڕینه‌.",
            "verse 79:14": "Nişkêva ewan hişyar bûn eجا ده‌ستبه‌جێ هه‌ر هه‌موو ئه‌و خه‌ڵکه بێدارده‌بنه‌وه و زیندووده‌بنه‌وه و له گۆڕه‌پانی لێپرسینه‌وه‌دا ئاماده ده‌بن.",
            "verse 79:15": "Bi sond!ji tera dabaşa (serdaborya) Mûsa hatîye(ئینجا دێته سه‌ر باسی سه‌رگوزه‌شته‌ی حه‌زره‌تی موساو دڵخۆشی پێغه‌مبه‌ر (صلی الله علیه وسلم) ده‌داته‌وه و ده‌فه‌رموێت): ئایا به‌سه‌رهاتی موسات پێگه‌یشتووه‌؟!",
            "verse 79:16": "Gava Xuda yê (Mûsa) di newala pîrozê (bi nav) « Tuwa » da gazî wî kirîyeکاتێک په‌روه‌ردگاری له دۆڵی (طوی) دا بانگی کرد و گفتوگۆی له‌گه‌ڵدا کرد و فه‌رمانی پێدا:",
            "verse 79:17": "(Ji ra aha gotîye): « tu here bal Fir’ewn, loma bi rastî ewa ji avaril derketî ye »بچۆ بۆ لای فیرعه‌ون (چونکه‌) به‌ڕاستی له سنوور ده‌رچووه و سته‌می بێ ئه‌ندازه‌یه‌.",
            "verse 79:18": "Îdî tu (ji bo wî ra aha) bêje: « tu hez dikî, ku ez beledîya te li bal rîya rast da bikim, ku tu (ji sikatîyan) fereste bibî? »پێی بڵێ: باشه ئه‌وه ناکرێت دڵ و ده‌روون و کردارو ره‌فتارت پاك و جوان و پوخته بێت!",
            "verse 79:19": "Heke îdî tu (ji Xuda yê xwe , yan jî ji danê dawîyê) bi tirsî, ezê belidî ya te li bal Xuda yê te da bikimتا ڕێنموویت بکه‌م بۆ ناسینی په‌روه‌ردگارت، تا ترسی (سزای) ئه‌و زاته‌ت هه‌بێت و سته‌م نه‌که‌یت).",
            "verse 79:20": "Îdî (Mûsa) beratenê mezin daye nîşanê Fir’ewn(دیاره فیرعه‌ون داوای به‌ڵگه‌ی کردوه‌) ئه‌ویش موعجیزه گه‌وره‌که‌ی نیشانداوه (که دار عاساکه‌یه‌).",
            "verse 79:21": "Paşê (Fir’ewn)ewan (beratan) dane derewdêrandinê, serî hilda(به‌ڵام) به درۆی زانی و یاخی بوو.",
            "verse 79:22": "Paşê pişta (xwe daye Mûsa) bi lez çû yeله‌وه‌ودوا پشتی هه‌ڵگردو که‌وته هه‌وڵ و تێکۆشان (بۆ به‌رهه‌ڵستی موسا و دژایه‌تی ئیمان).",
            "verse 79:23": "(Merivê xwe) civandin îdî (aha) li wan çir kirîyeخه‌ڵکی کۆکرده‌وه و به‌ده‌نگی به‌رز وتی:",
            "verse 79:24": "Û (aha ji bona wan ra) got : “bi rastî ez xudayê weyê bilintirê mezin im.”من په‌روه‌ردگاری هه‌ره به‌رزو بڵندی ئێوه‌م!!",
            "verse 79:25": "Îdî Yezdan ewa wusa şapat kir, ku ewa bi wê şapatê ji bona wanê borî û para da tên bûye (bereketa sodret)ئه‌وسا خوا دووچاری سزای قیامه‌ت و دنیای کرد.",
            "verse 79:26": "Bi rastî ji bona wanê , ku (ji Yezdan) ditirsin di van (bûyeran da) beratenê sodret heneبه‌ڕاستی ئا له‌و به‌سه‌رهاته‌دا په‌ندو ئامۆژگاری هه‌یه بۆ هه‌رکه‌سێک له خوا بترسێت. (ئینجا دێته سه‌ر باسی هه‌ندێک له دروستکراوانی که به‌ڵگه‌ن له‌سه‌ر ده‌سه‌ڵات و گه‌وره‌یی ئه‌و زاته‌).",
            "verse 79:27": "Gelo di afirandinê da (ji piştî mirinê) ku hûn têne afirandinê zor e, yan jî (afirandina) ezmanan ? (ewî ezman) ava kirîyeباشه ئاخر زیندووکردنه‌وه‌ی ئێوه سه‌خترو گرانتره‌، یان به‌دیهێنانی ئه‌م ئاسمانه‌، که هه‌ر خۆی به‌رپای کردووه (که پڕه له ئه‌ستێره‌وهه‌ساره‌ی گه‌وره‌ی هه‌مه‌جۆر).",
            "verse 79:28": "Ewî (ezman )di jor da bilind kirîye, îdî wekî hev rast kirîyeبه‌به‌رزیه‌وه رایگرتووه و به‌وپه‌ڕی ڕێکو پێکی به‌دیهێناوه (به ڕاسه‌رتانه‌وه‌).",
            "verse 79:29": "Û şeva wî (ezmanî) tarî kirîye, roja wî ronahî kirîyeشه‌وگاره‌که‌ی تاریك کردووه‌، کاتی چێشته‌نگاویش ڕووناک خۆری ده‌رخستووه‌.",
            "verse 79:30": "Paşê (Yezdan) zemîn jî gulok kirîyeدواتر زه‌ویشی به‌شێوه‌یه‌کی هێلکه‌یی به‌دیهێناوه‌.",
            "verse 79:31": "Ewî ji zemîn, av û kovîçêrê wî derxistîyeئاوی لێده‌رهێناوه و له‌وه‌ڕگای بۆ ماڵات فه‌راهه‌م هێناوه‌.",
            "verse 79:32": "Û çîyane (zemîn jî) di zemîn da birakutî şandî yeکێوه‌کانیشی به تۆکمه‌یی دامه‌زراندووه‌.",
            "verse 79:33": "Ewî (evan) ji bona wê û ji bona tarişê we ra kirine (j ibo ku hûn daborîya xwe pêk bînin)(هه‌موو ئه‌مانه‌مان دروست کردووه‌) تا ببێته هۆی ئه‌وه‌ی که خۆتان و ماڵاته‌کانیشتان سوودی لێ وه‌ربگرن.",
            "verse 79:34": "Îdî gava ewa aşîta mezin hat (hemû tişt hildan e binê xwe, tune kirîye)جا کاتێك به‌ڵا گه‌وره‌که پێشهات، که ته‌نگانه سامناکه‌که ڕوویدا، (مه‌به‌ست ڕۆژی قیامه‌ته‌).",
            "verse 79:35": "Di wê rojê da merivan çi kiribin tînin e bîra xweئه‌و ڕۆژه ئاده‌میزاد دێته‌وه یادی که چی کردووه و چی ئه‌نجامداوه.",
            "verse 79:36": "Û doj jî ji bona wanê dibînin ra xuya bû yeدۆزه‌خ نیشان ده‌درێت و ده‌رده‌خرێت بۆ هه‌رکه‌سێك که ببینێت...",
            "verse 79:37": "Îdî kîjan ji (rîya rast derketibe) avarû rijandibeجا ئه‌وه‌ی خوانه‌ناس و یاخی و له‌سنوور ده‌رچوو بێت...",
            "verse 79:38": "Û jîna cihanê ji xwe ra helbijartin eژیانی دنیای زیاتر له قیامه‌ت مه‌به‌ست بووبێت...",
            "verse 79:39": "(Ji bona wî ra) bi rastî êwra wî doj eئه‌وه بێگومان ئه‌و دۆزه‌خه جێگه‌ی مانه‌وه و حه‌وانه‌وه‌یه‌تی!!",
            "verse 79:40": "Û kîjan jî ji (hewandina di hemberê) Xuda yê xwe tirsîyabe û xwe ji xwastina canê xwe parisandibeبه‌ڵام ئه‌وه‌ی له پایه‌و شکۆی په‌روه‌ردگاری ترسابێت و حیسابی بۆ کردبێت و جڵه‌وی نه‌فسی گرتبێته‌وه له هه‌موو هه‌واو هه‌وه‌س و ئاره‌زوویه‌کی نادروست...",
            "verse 79:41": "(Ji bona wî ra) bi rastî êwra wî hey bihêşt eبێگومان هه‌ر به‌هه‌شت جێگه‌ی مانه‌وه و حه‌وانه‌وه و گوزه‌رانیه‌تی.",
            "verse 79:42": "Ewan ji te danê qarsê dipirsin ; ka danê şandina (qarsê) kengê yeپرسیارت لێ ده‌که‌ن { ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) } ده‌رباره‌ی قیامه‌ت، که که‌ی؟ چ کاتێك به‌رپا ده‌بێت؟",
            "verse 79:43": "(Heke Yezdan nebe) tu ji kêderê dikerî (zanîna bi danê qarsê) bêjîجا تۆ له‌کوێ ده‌زانیت که‌ی به‌رپا ده‌بێت!! تۆ له کوی و ئه‌و باسه له‌کوێ؟",
            "verse 79:44": "Dawîya (zanîna )ji wî danî hey li bal Xuda yê te yeبێگومان کۆتایی دنیاو به‌رپابوونی قیامه‌ت، هه‌ر په‌روه‌ردگارت ده‌یزانێت.",
            "verse 79:45": "(Muhemmed!) tu hey dikarî ewanê ji (hejmara di roja qarsê da) ditirsin, bidî hişyar kirinêبێگومان ئه‌رکی تۆ ته‌نها بێدارکه‌ره‌وه‌ی ئه‌و که‌سانه‌یه که له‌و زاته ده‌ترسن.",
            "verse 79:46": "Gava (ewan) wê rojê dibînin tu bidê qey ewan (di cihanê da) şevekî, yan jî danê taştî ya wê (şevê) man e (wusa diqilqilin)ئه‌و ڕۆژه‌ی که قیامه‌ت به‌رپا ده‌بێت، بێ باوه‌ڕان واده‌زانن که ته‌نها سه‌ر له ئێواره‌یه‌ك یان سه‌ر له به‌یانیه‌ك درێژه‌ی ژیانی دنیایان بووه‌."
        },
        "Kyrgyz": {
            "verse 79:1": "(Каапырлардын жанын) тереңинен (оорутуп) сууруп алуучу периштелер менен ант ичип",
            "verse 79:2": "(ыймандуулардын жанын оорутпай) “чечип алуучу” периштелер менен ант ичип",
            "verse 79:3": "(Асман мейкиндигинде өйдө-ылдый) сүзүп жүрүүчү периштелер менен ант ичип",
            "verse 79:4": "(Аллаһтын буйругун аткарууда) бири-бири менен жарышуучу периштелер менен ант ичип",
            "verse 79:5": "(Аллаһ табыштаган ааламдык) иштерди башкаруучу периштелер менен ант ичип (айтамын)",
            "verse 79:6": "Ал Күнү (Сур кернейдин биринчи деминен улам) титирөөчү (жер) титирейт",
            "verse 79:7": "Анынартынан кийинки Сур тартылат",
            "verse 79:8": "Ошол күнү (каапыр) жүрөктөр катуу коркуп",
            "verse 79:9": "Көздөрү жалдырап калат",
            "verse 79:10": "(Каапырларга Кыяматтагы кайра тирилүү жөнүндө айтылчу болсо, адамды мыскылдап, какшыктап, мындай) дешет: «Эмне, биз мурдакы (тирүү) абалыбызга кайтарылабызбы",
            "verse 79:11": "чириген сөөк болуп калсак деле?!»",
            "verse 79:12": "(Дагы мындай) дешти: «Анда бул биз үчүн зыяндуу кайтыш болоор!»",
            "verse 79:13": "Ал болгону (Исрафил периште тарткан чоордун) бир гана (катуу) добушу",
            "verse 79:14": "Анан капыстан... (тирилип, мүрзөлөрүнөн) жер бетине чыгып калышат",
            "verse 79:15": "Сага Мусанын кабары келди беле",
            "verse 79:16": "Бир кезде Раббиси ага ыйык Туваа өрөөнүндө (мындай деп) сүйлөдү",
            "verse 79:17": "«Фираунга баргын! Ал чектен чыгып кетти",
            "verse 79:18": "Жана ага (мындай) дегин: «Өзүндү (ширк күнөөсүнөн) тазалоону",
            "verse 79:19": "жана мен сени (жалгыз, шериксиз) Раббиңе баштоомду каалайсыңбы? Анан сен (Аллаһка ширк келтирүүдөн) коркуп калаар элең»",
            "verse 79:20": "(Муса) ага (Фираунга) чоң моожизаны (жыланга айланган аса таякты) көргөздү",
            "verse 79:21": "Бирок ал «жалган!» деп, каршы чыкты",
            "verse 79:22": "Кийин тескери басып, (душмандашууга) аракет кылды",
            "verse 79:23": "жана (адамдарын) чогултуп, бийик добуш менен",
            "verse 79:24": "«Мен силердин эң жогорку Раббиңер боломун» деди",
            "verse 79:25": "Анан... Аллаһ аны дүйнөлүк (жазаа) жана Акыреттик азап менен жазалады",
            "verse 79:26": "Албетте, мында (Раббисинен) корккон пенделер үчүн (чоң) сабак бар",
            "verse 79:27": "(Эй, каапырлар!) силердин жаратылууңар татаалыраакпы же асмандынбы?! Аны (Аллаһ) жаратты",
            "verse 79:28": "Шыбын көтөрүп, бекем-кынтыксиз кылды",
            "verse 79:29": "Түнүн караңгы кылды жана (таң аттырып) жарыгын чыгарды",
            "verse 79:30": "Андан кийин жерди жайып (кооздоп) койду",
            "verse 79:31": "Андан сууларын, жайлоолорун чыгарды",
            "verse 79:32": "Тоолорду (бекем) орнотту",
            "verse 79:33": "Силер үчүн жана силердин айбандарыңар үчүн пайдалануу (ырыскы) болсун деп",
            "verse 79:34": "Качан чоң Кыямат келсе",
            "verse 79:35": "Ал күндө инсан (дүйнөдөгү) иш -аракеттерин эстейт",
            "verse 79:36": "Караган адамдарга тозок (анык) көргөзүлөт",
            "verse 79:37": "Кимде-ким чектен чыккан болсо",
            "verse 79:38": "жана дүйнө жашоосун (Акыреттен) артык көргөн болсо",
            "verse 79:39": "анын орду албетте, тозокто",
            "verse 79:40": "Ал эми, ким Раббисинин алдында (сурак берип) туруудан коркуп, өзүн (арам) каалоо-кумарлардан тыйса",
            "verse 79:41": "анын орду албетте, Бейиште",
            "verse 79:42": "(Кайра тирилүүдөн шектенген адамдар) сенден Кыяматтын качан болушун сурашат",
            "verse 79:43": "Аны(н убактысын) билүүдөн сен алыссың",
            "verse 79:44": "Анын (качан болоору жөнүндөгү илимдин башы жана) аягы Раббиңе гана тиешелүү",
            "verse 79:45": "Сен болгону андан (Кыяматтан) корко турган кишилерди эскертүүчүсүң",
            "verse 79:46": "Алар (Кыяматты «жалган» дегендер) аны (өз көздөрү менен) көргөн күндө, (бул дүйнөдө) бир күн кечке чейин же түшкө чейин гана турган сыяктуу болуп калышат"
        },
        "Malay": {
            "verse 79:1": "Demi (makhluk-makhluk) yang mencabut (apa yang ditugaskan mencabutnya) dengan cara yang sekasar-kasarnya;",
            "verse 79:2": "Dan yang menarik (apa yang ditugaskan menariknya) dengan cara yang selembut-lembutnya;",
            "verse 79:3": "Dan demi (makhluk-makhluk) yang cergas bergerak (menerima perintah) dengan gerak yang secergas-cergasnya;",
            "verse 79:4": "Lalu masing-masing berlumba-lumba dahulu-mendahului (menjalankan tugasnya) dengan cara yang sesungguh-sungguhnya;",
            "verse 79:5": "Serta menyempurnakan tadbir urusan alam yang diperintahkan kepadanya; (sumpah demi sumpah, sesungguhnya kamu akan dibangkitkan hidup semula pada hari kiamat)! -",
            "verse 79:6": "Pada masa berlakunya \"tiupan sangkakala yang pertama\" yang menggoncangkan alam, (sehingga mati segala yang bernyawa dan punah-ranah sekalian makhluk selain dari yang dikecualikan),",
            "verse 79:7": "Tiupan yang pertama itu diikuti oleh tiupan yang kedua, (yang menyebabkan orang-orang yang mati semuanya hidup semula serta keluar dari kubur masing-masing);",
            "verse 79:8": "Hati (manusia) pada hari itu berdebar-debar takut,",
            "verse 79:9": "Pemandangannya tunduk gerun.",
            "verse 79:10": "Mereka (yang ingkar) berkata: \"Sungguhkah kita akan dikembalikan hidup seperti keadaan di dunia dahulu?",
            "verse 79:11": "\"Bolehkah (dihidupkan semula) sesudah kita menjadi tulang yang reput?\"",
            "verse 79:12": "Mereka berkata lagi (secara mengejek: \"Kalaulah berlaku) yang demikian, sudah tentu kembalinya kita (hidup semula) itu satu perkara yang merugikan!\"",
            "verse 79:13": "(Menghidupkan semula tidaklah sukar), kerana berlakunya perkara itu hanyalah dengan satu jeritan (yang terbit dari tiupan sangkakala yang kedua), -",
            "verse 79:14": "Yang menyebabkan mereka dengan serta-merta berada di muka bumi yang putih rata.",
            "verse 79:15": "Sudahkah sampai kepadamu (wahai Muhammad) perihal Nabi Musa?",
            "verse 79:16": "Ketika ia diseru oleh Tuhannya di \"Wadi Tuwa\" yang suci; -",
            "verse 79:17": "(Lalu diperintahkan kepadanya): \"Pergilah kepada Firaun, sesungguhnya ia telah melampaui batas (dalam kekufuran dan kezalimannya);",
            "verse 79:18": "\"Serta katakanlah kepadanya: `Adakah engkau suka hendak mensucikan dirimu (dari kekufuran)?",
            "verse 79:19": "`Dan mahukah, aku tunjuk kepadamu jalan mengenal Tuhanmu, supaya engkau merasa takut (melanggar perintahNya)? ' \"",
            "verse 79:20": "(Setelah Nabi Musa menyempurnakan perintah Tuhannya, dan Firaun pun meminta bukti kebenarannya); maka Nabi Musa memperlihatkan kepada Firaun: mukjizat yang besar.",
            "verse 79:21": "Lalu Firaun mendustakan (Nabi Musa) dan menderhaka (kepada Allah);",
            "verse 79:22": "Kemudian ia berpaling ingkar sambil menjalankan usahanya (menentang Nabi Musa).",
            "verse 79:23": "Lalu ia menghimpunkan orang-orangnya dan menyeru, -",
            "verse 79:24": "Dengan berkata: \"Akulah tuhan kamu, yang tertinggi\".",
            "verse 79:25": "Maka Allah menyeksa Firaun di akhirat dan di dunia ini, dengan azab yang menakutkan sesiapa yang mengetahuinya.",
            "verse 79:26": "Sesungguhnya yang demikian itu mengandungi pelajaran yang mendatangkan iktibar bagi orang-orang yang takut (melanggar perintah Tuhannya).",
            "verse 79:27": "(Wahai golongan yang ingkarkan kebangkitan hidup semula!) Kamukah yang sukar diciptakan atau langit? Tuhan telah membinanya (dengan Kukuh)!",
            "verse 79:28": "Ia telah meninggikan bangunan langit itu lalu menyempurnaKannya,",
            "verse 79:29": "Dan Ia menjadikan malamnya gelap-gelita, serta menjadikan siangnya terang-benderang.",
            "verse 79:30": "Dan bumi sesudah itu dihamparkannya (untuk kemudahan penduduknya), -",
            "verse 79:31": "Ia mengeluarkan dari bumi itu: airnya dan tumbuh-tumbuhannya;",
            "verse 79:32": "Dan gunung-ganang pula dikukuhkan letaknya (di bumi, sebagai pancang pasak yang menetapnya);",
            "verse 79:33": "(Semuanya itu) untuk kegunaan kamu dan binatang-binatang ternak kamu.",
            "verse 79:34": "Maka apabila datang hari yang bencananya amat besar, -",
            "verse 79:35": "Iaitu hari manusia akan mengingati apa yang telah diusahakannya, -",
            "verse 79:36": "Dan neraka diperlihatkan kepada sesiapa sahaja yang dapat melihatnya, -",
            "verse 79:37": "Maka (dapatlah masing-masing mengetahui kesudahannya); adapun orang yang melampau (perbuatan derhakanya), -",
            "verse 79:38": "Serta ia mengutamakan kehidupan dunia semata-mata, -",
            "verse 79:39": "Maka sesungguhnya neraka Jahanamlah tempat kediamannya.",
            "verse 79:40": "Adapun orang yang takutkan keadaan semasa ia berdiri di mahkamah Tuhannya, (untuk dihitung amalnya), serta ia menahan dirinya dari menurut hawa nafsu, -",
            "verse 79:41": "Maka sesungguhnya Syurgalah tempat kediamannya.",
            "verse 79:42": "Mereka (yang ingkar) selalu bertanya kepadamu (wahai Muhammad) tentang hari kiamat: \"Bilakah masa datangnya?\"",
            "verse 79:43": "Apa hubungannya tugasmu dengan (soal) menerangkan masa kedatangan hari kiamat itu?",
            "verse 79:44": "Kepada Tuhanmu lah terserah kesudahan ilmu mengenainya.",
            "verse 79:45": "Tugasmu hanyalah memberi amaran kepada orang yang takut akan huru-hara hari kiamat itu.",
            "verse 79:46": "(Sangatlah dahsyatnya huru-hara hari itu, sehingga orang-orang yang bersalah merasa) pada masa melihatnya: seolah-olah mereka tidak tinggal di dunia melainkan sekadar satu petang atau paginya sahaja."
        },
        "Malayalam": {
            "verse 79:1": "(അവിശ്വാസികളിലേക്ക്‌) ഇറങ്ങിച്ചെന്ന് (അവരുടെ ആത്മാവുകളെ) ഊരിയെടുക്കുന്നവ തന്നെയാണ സത്യം.",
            "verse 79:2": "(സത്യവിശ്വാസികളുടെ ആത്മാവുകളെ) സൌമ്യതയോടെ പുറത്തെടുക്കുന്നവ തന്നെയാണ, സത്യം.",
            "verse 79:3": "ഊക്കോടെ ഒഴുകി വരുന്നവ തന്നെയാണ, സത്യം.",
            "verse 79:4": "എന്നിട്ടു മുന്നോട്ടു കുതിച്ചു പോകുന്നവ തന്നെയാണ, സത്യം.",
            "verse 79:5": "കാര്യം നിയന്ത്രിക്കുന്നവയും തന്നെയാണ, സത്യം.",
            "verse 79:6": "ആ നടുക്കുന്ന സംഭവം നടുക്കമുണ്ടാക്കുന്ന ദിവസം.",
            "verse 79:7": "അതിനെ തുടര്‍ന്ന് അതിന്‍റെ പിന്നാലെ മറ്റൊന്നും",
            "verse 79:8": "ചില ഹൃദയങ്ങള്‍ അന്നു വിറച്ചു കൊണ്ടിരിക്കും.",
            "verse 79:9": "അവയുടെ കണ്ണുകള്‍ അന്ന് കീഴ്പോട്ടു താഴ്ന്നിരിക്കും.",
            "verse 79:10": "അവര്‍ പറയും: തീര്‍ച്ചയായും നാം (നമ്മുടെ) മുന്‍സ്ഥിതിയിലേക്ക് മടക്കപ്പെടുന്നവരാണോ?",
            "verse 79:11": "നാം ജീര്‍ണിച്ച എല്ലുകളായി കഴിഞ്ഞാലും (നമുക്ക് മടക്കമോ?)",
            "verse 79:12": "അവര്‍ പറയുകയാണ്‌: അങ്ങനെയാണെങ്കില്‍ നഷ്ടകരമായ ഒരു തിരിച്ചുവരവായിരിക്കും അത്‌.",
            "verse 79:13": "അത് ഒരേയൊരു ഘോരശബ്ദം മാത്രമായിരിക്കും.",
            "verse 79:14": "അപ്പോഴതാ അവര്‍ ഭൂമുഖത്തെത്തിക്കഴിഞ്ഞു.",
            "verse 79:15": "മൂസാനബിയുടെ വര്‍ത്തമാനം നിനക്ക് വന്നെത്തിയോ?",
            "verse 79:16": "ത്വുവാ എന്ന പരിശുദ്ധ താഴ്‌വരയില്‍ വെച്ച് അദ്ദേഹത്തിന്‍റെ രക്ഷിതാവ് അദ്ദേഹത്തെ വിളിച്ച് ഇപ്രകാരം പറഞ്ഞ സന്ദര്‍ഭം:",
            "verse 79:17": "നീ ഫിര്‍ഔന്‍റെ അടുത്തേക്കു പോകുക. തീര്‍ച്ചയായും അവന്‍ അതിരുകവിഞ്ഞിരിക്കുന്നു.",
            "verse 79:18": "എന്നിട്ട് ചോദിക്കുക: നീ പരിശുദ്ധി പ്രാപിക്കാന്‍ തയ്യാറുണ്ടോ?",
            "verse 79:19": "നിന്‍റെ രക്ഷിതാവിങ്കലേക്ക് നിനക്ക് ഞാന്‍ വഴി കാണിച്ചുതരാം. എന്നിട്ട് നീ ഭയപ്പെടാനും (തയ്യാറുണ്ടോ?)",
            "verse 79:20": "അങ്ങനെ അദ്ദേഹം (മൂസാ) അവന്ന് ആ മഹത്തായ ദൃഷ്ടാന്തം കാണിച്ചുകൊടുത്തു.",
            "verse 79:21": "അപ്പോള്‍ അവന്‍ നിഷേധിച്ചു തള്ളുകയും ധിക്കരിക്കുകയും ചെയ്തു.",
            "verse 79:22": "പിന്നെ, അവന്‍ എതിര്‍ ശ്രമങ്ങള്‍ നടത്തുവാനായി പിന്തിരിഞ്ഞു പോയി.",
            "verse 79:23": "അങ്ങനെ അവന്‍ (തന്‍റെ ആള്‍ക്കാരെ) ശേഖരിച്ചു. എന്നിട്ടു വിളംബരം ചെയ്തു.",
            "verse 79:24": "ഞാന്‍ നിങ്ങളുടെ അത്യുന്നതനായ രക്ഷിതാവാകുന്നു എന്ന് അവന്‍ പറഞ്ഞു.",
            "verse 79:25": "അപ്പോള്‍ പരലോകത്തിലെയും ഇഹലോകത്തിലെയും ശിക്ഷയ്ക്കായി അല്ലാഹു അവനെ പിടികൂടി.",
            "verse 79:26": "തീര്‍ച്ചയായും അതില്‍ ഭയപ്പെടുന്നവര്‍ക്ക് ഒരു ഗുണപാഠമുണ്ട്‌.",
            "verse 79:27": "നിങ്ങളാണോ സൃഷ്ടിക്കപ്പെടാന്‍ കൂടുതല്‍ പ്രയാസമുള്ളവര്‍. അതല്ല; ആകാശമാണോ? അതിനെ അവന്‍ നിര്‍മിച്ചിരിക്കുന്നു.",
            "verse 79:28": "അതിന്‍റെ വിതാനം അവന്‍ ഉയര്‍ത്തുകയും, അതിനെ അവന്‍ വ്യവസ്ഥപ്പെടുത്തുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 79:29": "അതിലെ രാത്രിയെ അവന്‍ ഇരുട്ടാക്കുകയും, അതിലെ പകലിനെ അവന്‍ പ്രത്യക്ഷപ്പെടുത്തുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 79:30": "അതിനു ശേഷം ഭൂമിയെ അവന്‍ വികസിപ്പിച്ചിരിക്കുന്നു.",
            "verse 79:31": "അതില്‍ നിന്ന് അതിലെ വെള്ളവും സസ്യജാലങ്ങളും അവന്‍ പുറത്തു കൊണ്ടുവരികയും ചെയ്തിരിക്കുന്നു.",
            "verse 79:32": "പര്‍വ്വതങ്ങളെ അവന്‍ ഉറപ്പിച്ചു നിര്‍ത്തുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 79:33": "നിങ്ങള്‍ക്കും നിങ്ങളുടെ കന്നുകാലികള്‍ക്കും ഉപയോഗത്തിനായിട്ട്‌",
            "verse 79:34": "എന്നാല്‍ ആ മഹാ വിപത്ത് വരുന്ന സന്ദര്‍ഭം.",
            "verse 79:35": "അതായതു മനുഷ്യന്‍ താന്‍ അദ്ധ്വാനിച്ചു വെച്ചതിനെപ്പറ്റി ഓര്‍മിക്കുന്ന ദിവസം.",
            "verse 79:36": "കാണുന്നവര്‍ക്ക് വേണ്ടി നരകം വെളിവാക്കപ്പെടുന്ന ദിവസം.",
            "verse 79:37": "(അന്ന്‌) ആര്‍ അതിരുകവിയുകയും",
            "verse 79:38": "ഇഹലോകജീവിതത്തിനു കൂടുതല്‍ പ്രാധാന്യം നല്‍കുകയും ചെയ്തുവോ",
            "verse 79:39": "(അവന്ന്‌) കത്തിജ്വലിക്കുന്ന നരകം തന്നെയാണ് സങ്കേതം.",
            "verse 79:40": "അപ്പോള്‍ ഏതൊരാള്‍ തന്‍റെ രക്ഷിതാവിന്‍റെ സ്ഥാനത്തെ ഭയപ്പെടുകയും മനസ്സിനെ തന്നിഷ്ടത്തില്‍ നിന്ന് വിലക്കിനിര്‍ത്തുകയും ചെയ്തുവോ",
            "verse 79:41": "(അവന്ന്‌) സ്വര്‍ഗം തന്നെയാണ് സങ്കേതം.",
            "verse 79:42": "ആ അന്ത്യസമയത്തെപ്പറ്റി, അതെപ്പോഴാണ് സംഭവിക്കുക എന്ന് അവര്‍ നിന്നോട് ചോദിക്കുന്നു.",
            "verse 79:43": "നിനക്ക് അതിനെപ്പറ്റി എന്ത് പറയാനാണുള്ളത്‌?",
            "verse 79:44": "നിന്‍റെ രക്ഷിതാവിങ്കലേക്കാണ് അതിന്‍റെ കലാശം.",
            "verse 79:45": "അതിനെ ഭയപ്പെടുന്നവര്‍ക്ക് ഒരു താക്കീതുകാരന്‍ മാത്രമാണ് നീ.",
            "verse 79:46": "അതിനെ അവര്‍ കാണുന്ന ദിവസം ഒരു വൈകുന്നേരമോ ഒരു പ്രഭാതത്തിലോ അല്ലാതെ അവര്‍ (ഇവിടെ) കഴിച്ചുകൂട്ടിയിട്ടില്ലാത്ത പോലെയായിരിക്കും (അവര്‍ക്ക് തോന്നുക.)"
        },
        "Norwegian": {
            "verse 79:1": "Ved dem som trekker ut og spenner!",
            "verse 79:2": "Ved dem som går ivrig frem!",
            "verse 79:3": "Ved dem som siger frem,",
            "verse 79:4": "og så tar ledelsen",
            "verse 79:5": "og tar seg av saken!",
            "verse 79:6": "Den dag når rystelsen ryster,",
            "verse 79:7": "og følges av rystelse,",
            "verse 79:8": "på denne dag vil hjertene banke",
            "verse 79:9": "og blikkene slås ned.",
            "verse 79:10": "De sier: «Skal vi bringes tilbake til det vi var?",
            "verse 79:11": "Når vi er morkne ben?»",
            "verse 79:12": "Og de tilføyer: «Det vil være en retur med tap!»",
            "verse 79:13": "Men det lyder et eneste skrall,",
            "verse 79:14": "og så er de lys våkne.",
            "verse 79:15": "Historien om Moses har vel nådd deg?",
            "verse 79:16": "Da Herren ropte til ham i den hellige dal Tuwa:",
            "verse 79:17": "«Gå til Farao! Han er oppsetsig!",
            "verse 79:18": "Og si: ’Ønsker du ikke å rense deg,",
            "verse 79:19": "og at jeg leder deg hen til Herren, så du kan vise gudsfrykt?’»",
            "verse 79:20": "Så viste Han ham det største jærtegnet,",
            "verse 79:21": "men han forkastet og var ulydig.",
            "verse 79:22": "Så vendte han ryggen og fjernet seg raskt,",
            "verse 79:23": "sammenkalte folk",
            "verse 79:24": "og sa: «Jeg er deres høyeste herre.»",
            "verse 79:25": "Så tok Gud ham fatt med den hinsidiges og denne verdens straff.",
            "verse 79:26": "I dette er visselig en lærepenge for den som har gudsfykt!",
            "verse 79:27": "Er dere mer krevende å skape, eller himmelen Han har bygget?",
            "verse 79:28": "Han hevet opp dens tak og gav den form,",
            "verse 79:29": "lot dens natt bli mørk og lot morgenlyset komme frem.",
            "verse 79:30": "Så bredte Han jorden ut",
            "verse 79:31": "og brakte frem av den vann og grønne enger,",
            "verse 79:32": "og Han gav fjellene fast feste,",
            "verse 79:33": "til glede for dere og deres hjorder.",
            "verse 79:34": "Når så den store katastrofe inntreffer,",
            "verse 79:35": "den dag når mennesket kommer i hu hva han jaget etter,",
            "verse 79:36": "og helvete bringes frem for alle som ser,",
            "verse 79:37": "da skal den som var oppsetsig",
            "verse 79:38": "og foretrakk jordelivet,",
            "verse 79:39": "få helvete til herberge.",
            "verse 79:40": "Men den som fryktet Herrens maktstilling og nektet seg sine lyster,",
            "verse 79:41": "– se, paradisets have er herberget.",
            "verse 79:42": "De spør deg om timen, om når den kommer.",
            "verse 79:43": "Hva kan vel du si om dette?",
            "verse 79:44": "Dens endelige tid beror hos Herren.",
            "verse 79:45": "Du er bare en advarer for dem som frykter den.",
            "verse 79:46": "Den dag de får se den, blir det som om de hadde ventet bare en kveld eller en morgenstund."
        },
        "Pashto": {
            "verse 79:1": "قسم دى په (ملايكو) راوښكونكو (روحونو د كفارو لره)، راوښكل",
            "verse 79:2": "او په (ملايكو) اسان راوښكونكو (د مومنانو روحونو لره)، اسان راوښكل",
            "verse 79:3": "او په تېزو تلونكو (ملايكو)، تېز تلل",
            "verse 79:4": "پس په وړاندې كېدونكو (ملايكو)، وړاندې كېدل",
            "verse 79:5": "بیا د كار په تدبیر جوړونكو (ملايكو) چې تاسو به خامخا بیا راژوندي كړى شئ)",
            "verse 79:6": "په هغه ورځ چې لړځېدونكې به ولړځېږي",
            "verse 79:7": "په دې پسې به راځي ورپسې راتلونكې",
            "verse 79:8": "(د مجرمانو) زړونه به په دغه ورځ كې رپېدونكي (درزېدونكي) وي",
            "verse 79:9": "د دغو سترګې به ښكته وي",
            "verse 79:10": "دوى به وايي: ایا په رښتیا (او) یقینًا به مونږ ړومبني حالت ته ګرځولى شو (بیا به ژوندي كېږو؟)",
            "verse 79:11": "ایا كله چې مونږ زاړه رژېدونكي هډوكي شو",
            "verse 79:12": "دوى وویل: دغه (ګرځېدل) به په هغه وخت كې زیانمن ګرځېدل وي",
            "verse 79:13": "پس بېشكه دغه خو بس یوه چغه ده",
            "verse 79:14": "نو ناڅاپه به دوى د ځمكې په مخ وي",
            "verse 79:15": "ایا تا ته د موسٰی خبره راغلې ده",
            "verse 79:16": "كله چې ده ته خپل رب په پاكې دَرې (ناو) ’’طُوٰی‘‘ كې اواز وكړ",
            "verse 79:17": "ته فرعون ته لاړ شه، بېشكه ده سركشي شروع كړې ده",
            "verse 79:18": "نو ته (ورته) ووایه: ایا ته دا خوښوې چې ته پاك شې",
            "verse 79:19": "او دا چې زه تا ته ستا د رب په طرف ښوونه وكړم، پس چې ته ووېرېږې",
            "verse 79:20": "نو ده (موسٰی) دغه (فرعون) ته تر ټولو لویه نښه وښودله",
            "verse 79:21": "نو ده تكذيب وكړ او نافراني يې وكړه",
            "verse 79:22": "بيا يې شا كړه (او) په ډېره بيړه سره لاړ",
            "verse 79:23": "نو ده (جادوګر) راجمع كړل، پس اواز يې وكړ",
            "verse 79:24": "نو ويې ويل: زه ستاسو رب یم، تر ټولو اوچت (رب)",
            "verse 79:25": "نو دى الله راونیوه په عذاب د اخرت او دنیا سره",
            "verse 79:26": "بېشكه په دغه (غرقولو او سوځولو) كې یقینًا د هغه چا لپاره عبرت دى چې (له الله نه) وېرېږي",
            "verse 79:27": "ایا تاسو د پیدا كولو په لحاظ ډېر سخت یئ، یا كه اسمان، دغه هغه (الله) جوړ كړى دى",
            "verse 79:28": "د ده چت يې اوچت كړى دى، نو دغه يې ښه برابر جوړ كړى دى",
            "verse 79:29": "او د ده شپه يې توره تیاره كړې ده او د ده رڼا يې راوېستلې ده",
            "verse 79:30": "او ځمكه يې له ده نه وروسته غوړولې ده",
            "verse 79:31": "ده له دغې (ځمكې) نه د دې اوبه او د دې واښه رااېستلي دي",
            "verse 79:32": "او غرونو لره، ده دغه محكم كړي دي",
            "verse 79:33": "ستاسو او ستاسو د څاریو د فايدې لپاره",
            "verse 79:34": "نو كله چې تر ټولو لویه بلا (قیامت) راشي",
            "verse 79:35": "په هغه ورځ چې انسان به هغه څه یادوي چې ده كړي وي",
            "verse 79:36": "او دوزخ به هغه چا ته څرګند كړى شي چې يې ویني",
            "verse 79:37": "نو هر چې هغه څوك دى چې سركشي يې كړې وي",
            "verse 79:38": "او دنيايي ژوند ته يې ترجیح وركړې وي",
            "verse 79:39": "نو بېشكه چې هم دا دوزخ (د ده) استوګنه ده",
            "verse 79:40": "او هر چې هغه څوك دى چې د خپل رب په وړاندې له ودرېدلو نه وېرېدلى وي او نفس (ځان) يې له خواهشاتو نه منع كړى وي",
            "verse 79:41": "نو بېشكه چې هم دا جنت (د ده) استوګنه ده",
            "verse 79:42": "(اى نبي!) دوى له تا نه د قیامت په باره كې پوښتنه كوي چې د ده واقع كېدل به كله وي",
            "verse 79:43": "ته د ده له یاده (علمه) په څه كې يې",
            "verse 79:44": "خاص ستا رب ته د دغه (قيامت) انتها ده",
            "verse 79:45": "بېشكه ته خو يواځې د هغه چا وېروونكى يې چې له ده (قیامت) نه وېرېږي",
            "verse 79:46": "ګویاكې دوى به په هغې ورځې كې چې دوى دغه (قیامت) وویني (داسې به وي لكه چې) دوى (په دنیا، یا په قبر كې) نه دي ایسار شوي مګر د ورځې اخر، یا څاښت"
        },
        "Persian": {
            "verse 79:1": "سوگند به فرشتگانى كه جانها را به قوت مى‌گيرند،",
            "verse 79:2": "و سوگند به فرشتگانى كه جانها را به آسانى مى‌گيرند،",
            "verse 79:3": "و سوگند به فرشتگانى كه شناورند،",
            "verse 79:4": "و سوگند به فرشتگانى كه بر ديوان پيشى مى‌گيرند،",
            "verse 79:5": "و سوگند به آنها كه تدبير كارها مى‌كنند،",
            "verse 79:6": "كه آن روز كه نخستين نفخه قيامت زمين را بلرزاند،",
            "verse 79:7": "و نفخه دوم از پس آن بيايد،",
            "verse 79:8": "در آن روز دلهايى در هراس باشند،",
            "verse 79:9": "و نشان خشوع در ديدگان نمايان.",
            "verse 79:10": "مى‌گويند: آيا ما به حالت نخستين بازمى‌گرديم،",
            "verse 79:11": "آنگاه كه استخوانهايى پوسيده بوديم؟",
            "verse 79:12": "گويند: اين بازگشت ما بازگشتى است زيان‌آور.",
            "verse 79:13": "جز اين نيست كه تنها يك بانگ برمى‌آيد،",
            "verse 79:14": "و آنها خود را در آن صحرا خواهند يافت.",
            "verse 79:15": "آيا داستان موسى به تو رسيده است؟",
            "verse 79:16": "آنگاه كه پروردگارش او را در وادى مقدس طوى ندا داد:",
            "verse 79:17": "به سوى فرعون برو كه طغيان كرده است.",
            "verse 79:18": "بگو: آيا تو را رغبتى هست كه پاكيزه شوى،",
            "verse 79:19": "و من تو را به پروردگارت راه بنمايم و تو پروا كنى؟",
            "verse 79:20": "پس آن آيت بزرگ را به او نشان داد.",
            "verse 79:21": "و او تكذيب كرد و عصيان ورزيد.",
            "verse 79:22": "سپس پشت كرد و مى‌شتافت.",
            "verse 79:23": "پس همه را گرد كرد و ندا داد،",
            "verse 79:24": "و گفت: من پروردگار برتر شما هستم.",
            "verse 79:25": "خدايش به عذاب آخرت و دنيا گرفتار كرد.",
            "verse 79:26": "در اين عبرتى است براى كسى كه مى‌ترسد.",
            "verse 79:27": "آيا شما به خلقت سخت‌تريد يا اين آسمانى كه او بنا نهاده؟",
            "verse 79:28": "سقفش را برافراشت و بپرداختش،",
            "verse 79:29": "شبش را تاريك كرد و روشنايى‌اش را آشكار ساخت،",
            "verse 79:30": "و پس از آن زمين را بگسترد،",
            "verse 79:31": "و از آن آب بيرون آورد و چراگاه‌ها پديد كرد،",
            "verse 79:32": "و كوه‌ها را استوار گردانيد،",
            "verse 79:33": "براى بهره‌گيرى شما و چارپايانتان.",
            "verse 79:34": "چون آن حادثه بزرگ دررسد،",
            "verse 79:35": "روزى كه آدمى همه اعمال خود را به ياد آورد،",
            "verse 79:36": "و جهنم را به هر كه مى‌بيند نشان دهند؛",
            "verse 79:37": "پس هر كه طغيان كرده،",
            "verse 79:38": "و زندگى اينجهانى را برگزيده،",
            "verse 79:39": "جهنم جايگاه اوست.",
            "verse 79:40": "اما هر كس كه از ايستادن در برابر پروردگارش ترسيده و نفس را از هوى بازداشته،",
            "verse 79:41": "بهشت جايگاه اوست.",
            "verse 79:42": "تو را از قيامت مى‌پرسند كه چه وقت واقع شود.",
            "verse 79:43": "از يادكردن آن تو را چه كار است؟",
            "verse 79:44": "منتهاى آن نزد پروردگار توست.",
            "verse 79:45": "جز اين نيست كه تو كسانى را كه از آن روز بترسند بيم مى‌دهى.",
            "verse 79:46": "چون آن را ببينند، پندارند در اين جهان جز يك شامگاه يا چاشت درنگ نكرده‌اند."
        },
        "Polish": {
            "verse 79:1": "Na wyrywających gwałtownie!",
            "verse 79:2": "Na biegnących pośpiesznie!",
            "verse 79:3": "Na płynących lekko i",
            "verse 79:4": "Na wyprzedzających szybko!",
            "verse 79:5": "I na zarządzających sprawami!",
            "verse 79:6": "Tego Dnia, kiedy zadrży drżąca,",
            "verse 79:7": "Nastąpi po tym drżeniu następne;",
            "verse 79:8": "Serca tego Dnia będą wzburzone,",
            "verse 79:9": "Spojrzenia będą pokorne.",
            "verse 79:10": "Oni będą mówili: \"Czyż my rzeczywiście zostaniemy przywróceni do poprzedniego stanu?",
            "verse 79:11": "Czyż... skoro byliśmy kośćmi zestalonymi?\"",
            "verse 79:12": "Oni powiedzą: \"Byłby to wówczas powrót przynoszący stratę!\"",
            "verse 79:13": "I będzie tylko jeden okrzyk przerażenia,",
            "verse 79:14": "I naraz oni znajdą się na czuwającej ziemi!",
            "verse 79:15": "Czy doszło do ciebie opowiadanie o Mojżeszu?",
            "verse 79:16": "Oto wezwał go Pan w świętej dolinie Tuwa:",
            "verse 79:17": "\"Idź do Faraona - on się zbuntował -",
            "verse 79:18": "I powiedz: \"Czy ty jesteś gotów się oczyścić?",
            "verse 79:19": "Wtedy ja poprowadzę cię do twego Pana, a ty okażesz bojaźń Bożą.\"",
            "verse 79:20": "I pokazał mu znak największy,",
            "verse 79:21": "Lecz on uznał to za kłamstwo i zbuntował się.",
            "verse 79:22": "Następnie odwrócił się plecami, działając pośpiesznie.",
            "verse 79:23": "I zebrał lud, i obwieścił,",
            "verse 79:24": "Mówiąc: \"Ja jestem waszym panem najwyższym!\"",
            "verse 79:25": "Wtedy Bóg dosięgną go karą w życiu ostatecznym i pierwszym.",
            "verse 79:26": "Zaprawdę, w tym jest przykład pouczający dla tego, kto jest bogobojny.",
            "verse 79:27": "Czy was trudniej było stworzyć, czy niebo, które On zbudował?",
            "verse 79:28": "Wzniósł On wysoko jego sklepienie i ukształtował je harmonijnie.",
            "verse 79:29": "On zaciemnił jego noc i On wyprowadził światłość poranną.",
            "verse 79:30": "Następnie rozpostarł ziemię.",
            "verse 79:31": "Wyprowadził z niej wodę i pastwiska jej.",
            "verse 79:32": "I On utwierdził solidnie góry -",
            "verse 79:33": "Na pożytek wam i waszych trzód.",
            "verse 79:34": "Lecz kiedy przyjdzie bardzo wielkie nieszczęście,",
            "verse 79:35": "W tym Dniu przypomni sobie człowiek, nad czym się trudził;",
            "verse 79:36": "I pokazany będzie ogień piekielny temu, kto potrafi widzieć.",
            "verse 79:37": "Wtedy, dla tego, kto się zbuntował",
            "verse 79:38": "I wolał życie tego świata,",
            "verse 79:39": "Zaprawdę, dla niego miejscem schronienia będzie ogień piekielny.",
            "verse 79:40": "Lecz dla tego, kto się lękał stawienia się przed swoim Panem i powstrzymywał duszę od namiętności,",
            "verse 79:41": "To, zaprawdę, dla niego Ogród będzie miejscem schronienia!",
            "verse 79:42": "Będą cię pytać o Godzinę: \"Kiedyż nadejdzie?\"",
            "verse 79:43": "Jak możesz wspominać o niej?",
            "verse 79:44": "Do twojego Pana należy jej ostateczny termin.",
            "verse 79:45": "Ty jesteś tylko ostrzegającym dla tego, kto się obawia.",
            "verse 79:46": "W Dniu, kiedy oni zobaczą ową Godzinę - to wyda im się, jakby trwali tylko jeden wieczór lub jeden ranek."
        },
        "Portuguese": {
            "verse 79:1": "Pelos que arrebatam violentamente",
            "verse 79:2": "Pelos que extraem veementemente;",
            "verse 79:3": "Pelos que gravitam serenamente;",
            "verse 79:4": "Pelos que procuram sobrepujar repentinamente,",
            "verse 79:5": "Arranjadores (para a execução) das ordens (do seu Senhor)!",
            "verse 79:6": "No dia em que tudo o que poderá se comover, estará em comoção,",
            "verse 79:7": "E em que acontecerá, pela segunda vez (a comoção),",
            "verse 79:8": "Nesse dia, os corações baterão agitados,",
            "verse 79:9": "Enquanto os olhares estarão humildes.",
            "verse 79:10": "Dirão: Quê! Porventura voltaremos ao nosso estado primitivo,",
            "verse 79:11": "Mesmo que também sejamos ossos deteriorados?",
            "verse 79:12": "Dirão (mais): Tal será, então, um retorno de perdas!",
            "verse 79:13": "Porém, certamente, será um só grito,",
            "verse 79:14": "E, ei-los plenamente acordados.",
            "verse 79:15": "Conheces (ó Mensageiro) a história de Moisés?",
            "verse 79:16": "Seu Senhor o chamou, no vale sagrado de Tôwa,",
            "verse 79:17": "(E lhe disse): Vai ao Faraó, porque ele transgrediu,",
            "verse 79:18": "e dize-lhe: Desejas purificar-te,",
            "verse 79:19": "e encaminhar-te até o teu Senhor, para O temeres?",
            "verse 79:20": "E Moisés lhe mostrou o grande sinal,",
            "verse 79:21": "Porém (o Faraó) desmentiu (aquilo) e se rebelou;",
            "verse 79:22": "Então, rechaçou-o, contendendo tenazmente.",
            "verse 79:23": "Em seguida, congregou (a gente) e discursou,",
            "verse 79:24": "Proclamando: Sou o vosso senhor supremo!",
            "verse 79:25": "Porém, Deus lhe infligiu o castigo e (fez dele) um exemplo para o outro mundo e para o presente.",
            "verse 79:26": "Certamente, nisto há um exemplo para o temente.",
            "verse 79:27": "Quê! Porventura a vossa criação é mais difícil ou é a do céu, que Ele erigiu?",
            "verse 79:28": "Elevou a sua abóbada e, por conseguinte, a ordenou,",
            "verse 79:29": "Escureceu a noite e, (consequentemente) clareou o dia;",
            "verse 79:30": "E depois disso dilatou a terra,",
            "verse 79:31": "Da qual fez brotar a água e os pastos;",
            "verse 79:32": "E fixou, firmemente, as montanhas,",
            "verse 79:33": "Para o proveito vosso e do vosso gado.",
            "verse 79:34": "Mas, quando chegar o grande evento,",
            "verse 79:35": "O dia em que o homem se há de recordar de tudo quanto tiver feito,",
            "verse 79:36": "E a fogueira for exposta visivelmente, para quem a quiser ver,",
            "verse 79:37": "Então, o que tiver transgredido,",
            "verse 79:38": "E preferido a vida terrena,",
            "verse 79:39": "Esse certamente terá a fogueira por morada.",
            "verse 79:40": "Ao contrário, quem tiver temido o comparecimento ante o seu Senhor e se tiver refreado em relação à luxúria,",
            "verse 79:41": "Terá o Paraíso por abrigo.",
            "verse 79:42": "Interrogar-te-ão acerca da Hora: Quando aportará?",
            "verse 79:43": "Com quem está tu (envolvido), com tal declaração?",
            "verse 79:44": "Só ao teu Senhor incumbe tal conhecimento.",
            "verse 79:45": "Tu és comente um admoestador, para quem a teme.",
            "verse 79:46": "No dia em que a virem, parecer-lhes-á não terem permanecido no mundo mais do que um entardecer ou um amanhecer da mesma."
        },
        "Punjabi": {
            "verse 79:1": "ਸਹੂੰ ਹੈ ਜੜਾਂ ਤੋਂ ਪੁੱਟਣ ਵਾਲੀਆਂ ਹਵਾਵਾਂ ਦੀ।",
            "verse 79:2": "ਅਤੇ ਸਹੁੰ ਹੈ, ਸੱਧਮ ਚੱਲਣ ਵਾਲੀਆਂ ਹਵਾਵਾਂ ਦੀ।",
            "verse 79:3": "ਅਤੇ ਸਹੂੰ ਹੈ, ਤੈਰਨ ਵਾਲੇ ਬੱਦਲਾਂ ਦੀ।",
            "verse 79:4": "ਫਿਰ ਅੱਗੇ ਵਧਣ ਵਾਲਿਆਂ ਦੀ",
            "verse 79:5": "ਫਿਰ ਮਾਮਲਿਆਂ ਦਾ ਉਪਾਅ ਕਰਨ ਵਾਲਿਆਂ ਦੀ।",
            "verse 79:6": "ਜਿਸ ਦਿਨ ਹਿਲਾ ਦੇਣ ਵਾਲੀ ਹਿਲਾ ਦੇਵੇਗੀ।",
            "verse 79:7": "ਉਸ ਤੋਂ ਮਗਰੋਂ ਇੱਕ ਹੋਰ ਆਉਣ ਵਾਲੀ ਚੀਜ਼ ਆਵੇਗੀ।",
            "verse 79:8": "ਕਿੰਨੇ ਦਿਲ ਉਸ ਤੋਂ ਕੰਬ ਰਹੇ ਹੋਣਗੇ।",
            "verse 79:9": "ਉਨ੍ਹਾਂ ਦੀਆਂ ਅੱਖਾਂ ਝੁਕ ਰਹੀਆਂ ਹੋਣਗੀਆਂ।",
            "verse 79:10": "ਉਹ ਕਹਿੰਦੇ ਹਨ ਕਿ ਕੀ ਅਸੀਂ ਪਹਿਲੀ ਹਾਲਤ ਵਿਚ ਵਾਪਿਸ ਜਾਂਵਾਗੇ।",
            "verse 79:11": "ਕਿ ਜਦੋਂ ਸਾਡੀਆਂ ਹੱਡੀਆਂ ਗਲ ਸੜ ਜਾਣਗੀਆਂ।",
            "verse 79:12": "ਉਨ੍ਹਾਂ ਨੇ ਆਖਿਆ ਕਿ ਇਹ ਵਾਪਸੀ ਤਾਂ ਬੜੇ ਘਾਟੇ ਵਾਲੀ ਹੋਵੇਗੀ।",
            "verse 79:13": "ਉਹ ਤਾਂ ਬੱਸ ਇੱਕ ਝਿੜਕ ਹੋਵੇਗੀ।",
            "verse 79:14": "ਫਿਰ ਤੁਰੰਤ ਉਹ ਮੈਦਾਨ ਵਿਚ ਹਾਜ਼ਿਰ ਹੋਣਗੇ।",
            "verse 79:15": "ਕੀ ਤੁਹਾਡੇ ਕੋਲ ਮੂਸਾ ਦੀ ਗੱਲ ਪਹੁੰਚੀ ਹੈ।",
            "verse 79:16": "ਜਦੋਂ ਕਿ ਉਸ ਦੇ ਰੱਬ ਨੇ ਉਸ ਨੂੰ ਤੁਵਾ ਦੀ ਪਵਿੱਤਰ ਘਾਟੀ ਵਿਚ ਪੁਕਾਰਿਆ।",
            "verse 79:17": "ਫਿਰਔਨ ਦੇ ਕੋਲ ਜਾਉ ਉਹ ਬਾਗ਼ੀ ਹੋ ਗਿਆ ਹੈ।",
            "verse 79:18": "ਫਿਰ ਉਸ ਨੂੰ ਪੁੱਛੋ, ਕਿ ਕੀ ਤੈਨੂੰ ਇਸ ਗੱਲ ਦੀ ਇੱਛਾ ਹੈ ਕਿ ਤੂੰ ਸੁਧਰ ਜਾਵੇਂ।",
            "verse 79:19": "ਅਤੇ ਮੈਂ ਤੈਨੂੰ ਤੇਰੇ ਰੱਬ ਦਾ ਰਾਹ ਦਿਖਾਵਾਂ, ਫਿਰ ਤੂੰ ਡਰੇ।",
            "verse 79:20": "ਸੋ ਮੂਸਾ ਨੇ ਉਸ ਨੂੰ ਵੱਡੀ ਨਿਸ਼ਾਨੀ ਦਿਖਾਈ।",
            "verse 79:21": "ਫਿਰ ਉਸ ਨੇ ਝੁਠਲਾਇਆ ਅਤੇ ਨਾ ਮੰਨਿਆ।",
            "verse 79:22": "ਫਿਰ ਉਹ ਪਲਟਿਆ, ਯਤਨ ਕਰਦੇ ਹੋਏ।",
            "verse 79:23": "ਫਿਰ ਉਸ ਨੇ ਇਕੱਠਾ ਕੀਤਾ, ਫਿਰ ਉਸ ਨੇ ਪੁਕਾਰਿਆ।",
            "verse 79:24": "ਸੋ ਉਸ ਨੇ ਆਖਿਆ ਕਿ ਮੈਂ ਤੁਹਾਡਾ ਸਭ ਤੋਂ ਵੱਡਾ ਰੱਬ ਹਾਂ।",
            "verse 79:25": "ਤਾਂ ਅੱਲਾਹ ਨੇ ਉਸ ਨੂੰ ਪ੍ਰਲੋਕ ਅਤੇ ਸੰਸਾਰ ਦੀ ਸਜ਼ਾ ਵਿਚ ਫੜ੍ਹਿਆ।",
            "verse 79:26": "ਬੇਸ਼ੱਕ ਇਸ ਵਿਚ ਹਰੇਕ ਉਸ ਬੰਦੇ ਲਈ ਸਿੱਖਿਆ ਹੈ, ਜਿਹੜਾ (ਅੱਲਾਹ ਤੋਂ) ਡਰੇ।",
            "verse 79:27": "ਕੀ ਤੁਹਾਡਾ ਬਣਾਉਣਾ ਜ਼ਿਆਦਾ ਔਖਾ ਹੈ ਜਾਂ ਆਕਾਸ਼ ਦਾ, ਅੱਲਾਹ ਨੇ ਉਸ ਨੂੰ ਬਣਾਇਆ।",
            "verse 79:28": "ਉਸ ਦੀ ਛੱਤ ਨੂੰ ਉੱਚਾ ਕੀਤਾ, ਫਿਰ ਉਸ ਨੂੰ ਠੀਕ ਕੀਤਾ।",
            "verse 79:29": "ਫਿਰ ਉਸ ਦੀ ਰਾਤ ਨੂੰ ਹਨੇਰੀ ਬਣਾਇਆ ਅਤੇ ਉਸ ਦੇ ਦਿਨ ਨੂੰ ਪ੍ਰਕਾਸ਼ਵਾਨ ਕੀਤਾ।",
            "verse 79:30": "ਅਤੇ ਉਸ ਤੋਂ ਬਾਅਦ ਧਰਤੀ ਨੂੰ ਫੈਲਾਇਆ।",
            "verse 79:31": "ਇਸ ਵਿੱਚੋਂ ਉਸ ਦਾ ਪਾਣੀ ਅਤੇ ਚਾਰਾ ਕੱਢਿਆ।",
            "verse 79:32": "ਅਤੇ ਪਹਾੜਾਂ ਨੂੰ ਸਥਾਪਿਤ ਕੀਤਾ।",
            "verse 79:33": "ਤੁਹਾਡੇ ਲਈ ਅਤੇ ਤੁਹਾਡੇ ਪਸ਼ੂਆਂ ਲਈ ਜੀਵਨ ਸਮੱਗਰੀ ਦੇ ਰੂਪ ਵਿਚ (ਪੈਦਾ ਕੀਤਾ)।",
            "verse 79:34": "ਫਿਰ ਜਦੋਂ ਉਹ ਵੱਡੀ ਆਫ਼ਤ ਆਵੇਗੀ।",
            "verse 79:35": "ਜਿਸ ਦਿਨ ਮਨੁੱਖ ਆਪਣੇ ਕੀਤੇ ਨੂੰ ਯਾਦ ਕਰੇਗਾ।",
            "verse 79:36": "ਅਤੇ ਦੇਖਣ ਵਾਲਿਆਂ ਦੇ ਸਾਹਮਣੇ ਨਰਕ ਪ੍ਰਗਟ ਕਰ ਦਿੱਤਾ ਜਾਵੇਗਾ।",
            "verse 79:37": "ਤਾਂ ਜਿਸ ਨੇ ਸ਼ਗਾਵਤ ਕੀਤੀ।",
            "verse 79:38": "ਅਤੇ ਸੰਸਾਰਿਕ ਜੀਵਨ ਨੂੰ ਪਹਿਲ ਦਿੱਤੀ।",
            "verse 79:39": "ਤਾਂ ਉਨ੍ਹਾਂ ਦਾ ਟਿਕਾਣਾ ਨਰਕ ਹੋਂਵੇਗਾ।",
            "verse 79:40": "ਅਤੇ ਜਿਹੜਾ ਬੰਦਾ ਆਪਣੇ ਰੱਬ ਦੇ ਸਾਹਮਣੇ ਖੜ੍ਹੇ ਹੋਣ ਤੋਂ ਡਰਿਆ ਅਤੇ ਆਪਣੇ ਮਨ ਨੂੰ ਬੁਰੀਆਂ ਇੱਛਾਵਾਂ ਤੋਂ ਰੋਕਿਆ।",
            "verse 79:41": "ਤਾਂ ਉਸ ਦਾ ਟਿਕਾਣਾ ਜੰਨਤ ਹੋਵੇਗਾ।",
            "verse 79:42": "ਉਹ ਕਿਆਮਤ ਦੇ ਸਬੰਧ ਵਿਚ ਪੁੱਛਦੇ ਹਨ ਕਿ ਇਹ ਕਦੋਂ ਵਾਪਰੇਗੀ।",
            "verse 79:43": "ਉਸ ਦੀ ਚਰਚਾ ਨਾਲ ਤੁਹਾਡਾ ਕੀ ਸਬੰਧ ਹੈ।",
            "verse 79:44": "ਇਹ ਮਾਮਲਾ ਤੇਰੇ ਰੱਬ ਨਾਲ ਸਬੰਧਿਤ ਹੈ।",
            "verse 79:45": "ਤਾਂ ਤੁਸੀਂ ਸਿਰਫ਼ ਉਸ ਬੰਦੇ ਨੂੰ ਡਰਾਉਣ ਵਾਲੇ ਹੋ, ਜਿਹੜਾ ਡਰੇ।",
            "verse 79:46": "ਜਿਸ ਦਿਨ ਇਹ ਉਸ ਨੂੰ (ਤਾਂ ਅਜਿਹਾ ਖਿਆਲ ਕਰਨਗੇ) ਦੇਖਣਗੇ ਤਾਂ ਜਾਣੋ ਉਹ ਸੰਸਾਰ ਵਿਚ ਠਹਿਰੇ ਹੀ ਨਹੀਂ। ਜਿਵੇਂ (ਦੁਨੀਆਂ ਵਿਚ ਸਿਰਫ਼) ਇੱਕ ਸ਼ਾਮ ਜਾਂ ਇੱਕ ਸਵੇਰ ਬਤੀਤ ਕੀਤੀ ਹੋਵੇ।"
        },
        "Roman english": {
            "verse 79:1": "Wan naazi `aati gharqa",
            "verse 79:2": "Wan naa shi taati nashta",
            "verse 79:3": "Wass saabi-haati sabha",
            "verse 79:4": "Fass saabi qaati sabqa",
            "verse 79:5": "Fal mu dab-bi raati amra",
            "verse 79:6": "Yawma tarjufur raajifa",
            "verse 79:7": "Tatba`u har raadifa",
            "verse 79:8": "Quloobuny-yau maaiziw-waaji-fa",
            "verse 79:9": "Absaa ruhaa khashi`ah",
            "verse 79:10": "Ya qoo loona a-inna lamar doo doona fil haafirah",
            "verse 79:11": "Aizaa kunna `izaa man-nakhirah",
            "verse 79:12": "Qaalu tilka izan karratun khaasirah",
            "verse 79:13": "Fa inna ma hiya zajratuw-waahida",
            "verse 79:14": "Faizaa hum biss saahirah",
            "verse 79:15": "Hal ataaka hadeethu Musaa",
            "verse 79:16": "Iz nadaahu rabbuhu bil waadil-muqad dasi tuwa",
            "verse 79:17": "Izhab ilaa fir`auna innahu taghaa",
            "verse 79:18": "Faqul hal laka ilaa-an tazakka",
            "verse 79:19": "Wa ahdi yaka ila rabbika fatakh sha",
            "verse 79:20": "Fa araahul-aayatal kubra",
            "verse 79:21": "Fa kazzaba wa asaa",
            "verse 79:22": "Thumma adbara yas`aa",
            "verse 79:23": "Fa hashara fanada",
            "verse 79:24": "Faqala ana rabbu kumul-a`laa",
            "verse 79:25": "Fa-akha zahul laahu nakalal aakhirati wal-oola",
            "verse 79:26": "Inna fee zaalika la`ibratal limaiy-yaksha",
            "verse 79:27": "A-antum a shaddu khalqan amis samaa-u banaaha",
            "verse 79:28": "Raf`a sam kaha fasaw waaha",
            "verse 79:29": "Wa aghtasha lailaha wa akhraja duhaaha",
            "verse 79:30": "Wal arda b`ada zaalika dahaaha",
            "verse 79:31": "Akhraja minha maa-aha wa mar `aaha",
            "verse 79:32": "Wal jibala arsaaha",
            "verse 79:33": "Mataa`al lakum wali an `aamikum",
            "verse 79:34": "Fa-izaa jaaa`atit taaam matul kubraa",
            "verse 79:35": "Yauma Yata zakkarul insaanu ma sa`aa",
            "verse 79:36": "Wa burrizatil-jaheemu limany-yaraa",
            "verse 79:37": "Fa ammaa man taghaa",
            "verse 79:38": "Wa aasaral hayaatad dunyaa",
            "verse 79:39": "Fa innal jaheema hiyal maawaa",
            "verse 79:40": "Wa ammaa man khaafa maqaama Rabbihee wa nahan nafsa `anil hawaa",
            "verse 79:41": "Fa innal jannata hiyal maawaa",
            "verse 79:42": "Yas`aloonaka `anis saa`ati ayyaana mursaahaa",
            "verse 79:43": "Feema anta min zikraahaa",
            "verse 79:44": "Ilaa Rabbika muntahaa haa",
            "verse 79:45": "Innamaaa anta munziru maiy yakshaahaa",
            "verse 79:46": "Ka annahum Yawma yarawnahaa lam yalbasooo illaa `ashiyyatan aw duhaahaa"
        },
        "Russian": {
            "verse 79:1": "В знак тех, кто с силой исторгает (души грешных),",
            "verse 79:2": "И тех, кто с мягкостью из праведных их извлекает,",
            "verse 79:3": "Скользящих плавно (и незримо по миссиям Господним),",
            "verse 79:4": "Опережающих в своем скольженье,",
            "verse 79:5": "Порядок (строгий) учреждая (по повелению Аллаха).",
            "verse 79:6": "В тот День, (Когда под трубный глас) Великим сотрясеньем (Земля и горы) сотрясутся",
            "verse 79:7": "И вслед за ним второй раздастся глас.",
            "verse 79:8": "В тот День Волнение охватит все сердца,",
            "verse 79:9": "Потупленными будут взоры,",
            "verse 79:10": "И возгласят они: \"Ужель вернемся мы в земное состоянье?",
            "verse 79:11": "Теперь, когда истлели наши кости?\"",
            "verse 79:12": "И скажут: \"В случае таком Возврат сей будет лишь убытком!\"",
            "verse 79:13": "Поистине, раздастся лишь единый вскрик,",
            "verse 79:14": "И пробужденье вечное для всех настанет.",
            "verse 79:15": "К тебе пришел рассказ о Мусе,",
            "verse 79:16": "Когда Господь его воззвал к нему в святой долине Тува:",
            "verse 79:17": "Ступай ты к Фараону, - Ведь преступил он все пределы.",
            "verse 79:18": "Скажи ему: Не хочешь ли себя очистить (от греха)?",
            "verse 79:19": "И я тебя направлю к Владыке твоему, И станешь ты страшиться Его (гнева)\"\".",
            "verse 79:20": "И тут он пред его глазами Знаменье величайшее представил,",
            "verse 79:21": "Но Фараон отверг его И оставался непокорным;",
            "verse 79:22": "Потом спиной он повернулся, Усердствуя (против Аллаха).",
            "verse 79:23": "Потом собрал своих людей, и возгласил,",
            "verse 79:24": "И (так) сказал: \"Я - высочайший ваш владыка!\"",
            "verse 79:25": "И взял Аллах его (жестоким) наказаньем И в жизни ближней, и в далекой.",
            "verse 79:26": "И в этом - назидание, поистине, для тех, Которые страшатся (разгневить) Аллаха.",
            "verse 79:27": "И что ж! Труднее было вас создать Или небесный свод (построить)?",
            "verse 79:28": "Его построил Он. И совершенным сделал.",
            "verse 79:29": "Его залил Он мраком ночи И выявил (великолепие его сиянием) дневного света.",
            "verse 79:30": "Потом Он землю распростер",
            "verse 79:31": "И из нее исторгнул воду и луга,",
            "verse 79:32": "Установил недвижно горы",
            "verse 79:33": "Для пользы вам и вашему скоту.",
            "verse 79:34": "А потому, когда Миг величайший, Всеобъемлющий наступит,",
            "verse 79:35": "В День, Когда воспомнит человек, К чему в трудах своих стремился,",
            "verse 79:36": "И огненное пламя Ада Предстанет пред очами всех, кто видит, -",
            "verse 79:37": "Тогда для тех, кто (Господа) отверг",
            "verse 79:38": "И отдал предпочтенье жизни ближней,",
            "verse 79:39": "Поистине, жилищем станет Ад.",
            "verse 79:40": "Для тех же, кто из страха перед Господом предстать Греховные желания умерил,",
            "verse 79:41": "Поистине, жилищем Рай предстанет.",
            "verse 79:42": "Они тебя о Часе вопрошают: \"Когда придет назначенное время?\"",
            "verse 79:43": "К чему тебе касаться этого (вопроса)?",
            "verse 79:44": "Лишь у Владыки твоего - Предел конечный.",
            "verse 79:45": "А ты, (о Мухаммад!), лишь увещатель тех, Которые Его страшатся.",
            "verse 79:46": "В тот День, Когда они его увидят, Они подумают, что длился (смертный сон их) Не дольше полдня или утра."
        },
        "Sindhi": {
            "verse 79:1": "اندر گھڙي ڇڪي آئيندڙن جو قسم آھي.",
            "verse 79:2": "۽ کولي آسانيءَ سان ڳنڍ ڇوڙيندڙن جو قسم آھي.",
            "verse 79:3": "۽ چڱي طرح سان ترندڙن جو قسم آھي.",
            "verse 79:4": "پوءِ ڊوڙي اڳرائي ڪندڙن جو قسم آھي.",
            "verse 79:5": "پوءِ (سڀ) ڪم جي رٿيندڙن ٽولين جو قسم آھي.",
            "verse 79:6": "ته جنھن ڏينھن ڌٻڻ واري ڌٻندي.",
            "verse 79:7": "ان کي پٺيان لڳندڙ (ٻيو ڌوڏو) پٺيان لڳندو.",
            "verse 79:8": "تنھن ڏينھن ڪيتريون ئي دليون ڏڪي وڃڻ واريون ھونديون.",
            "verse 79:9": "انھن جون اکيون (خواريءَ سبب) جھڪيون ٿينديون.",
            "verse 79:10": "چون ٿا ته اسين پوئين پيرين موٽائباسون ڇا؟",
            "verse 79:11": "ھان جڏھن ڀُتا ھڏا ٿينداسون؟",
            "verse 79:12": "چوندا آھن ته انھي مھل اھو ٻيھر موٽڻ (وڏو) نقصان وارو آھي.",
            "verse 79:13": "پوءِ اھو (واقعو) ھڪڙي سخت ھڪل آھي.",
            "verse 79:14": "پوءِ اتي جو اُتي ھڪ پڌري ميدان ۾ حاضر ٿيل ھوندا.",
            "verse 79:15": "(اي پيغمبر) تو وٽ مُوسىٰ جي خبر پُھتي آھي ڇا؟",
            "verse 79:16": "جڏھن سندس پالڻھار کيس پاڪ ميدان طُوىٰ ۾ سڏيو.",
            "verse 79:17": "ته فرعون ڏانھن وڃ ڇوته ھو حد کان لنگھيو آھي.",
            "verse 79:18": "پوءِ (ان کي) چؤ ته ھن ڏانھن خيال اٿئي ته تون سڌرجين؟",
            "verse 79:19": "۽ تنھنجي پالڻھار ڏانھن توکي (سڌو) رستو ڏيکاريان ته (تون اُن کان) ڊڄين.",
            "verse 79:20": "پوءِ فرعون کي وڏي نشاني ڏيکاريائين.",
            "verse 79:21": "پوءِ (فرعون موسى) کي ڪوڙو ڀانيو ۽ نافرماني ڪيائين.",
            "verse 79:22": "وري (اُتان) پٺيرو ٿي تکو ھلڻ لڳو.",
            "verse 79:23": "پوءِ (پنھنجي قوم کي) گڏ ڪيائين پوءِ سڏيائين.",
            "verse 79:24": "پوءِ چيائين ته آءٌ اوھان جو تمام مٿاھون پالڻھار آھيان.",
            "verse 79:25": "پوءِ الله ان کي آخرت ۽ دُنيا جي عذاب ۾ پڪڙيو.",
            "verse 79:26": "بيشڪ ھن (قصّي) ۾ انھي لاءِ نصيحت آھي جيڪو ڊڄي.",
            "verse 79:27": "ڀلا بڻاوت ۾ اوھين ڏکيا آھيو يا آسمان جنھن کي الله بڻايو؟",
            "verse 79:28": "اُن جي مٿاھين بلند ڪيائين پوءِ اُن کي برابر بيھاريائين.",
            "verse 79:29": "۽ اُن جي رات کي اوندھ ڪيائين ۽ اُن جو سوجھرو (ڏينھن جو) پڌرو ڪيائين.",
            "verse 79:30": "۽ اُن کان پوءِ زمين کي وڇايائين.",
            "verse 79:31": "اُن مان سندس پاڻي ۽ سندس گاھ ڪڍيائين.",
            "verse 79:32": "۽ جبلن کي مُحڪم کوڙيائين.",
            "verse 79:33": "اوھان جي نفعي لاءِ ۽ اوھان جي ڍورن (جي نفعي) لاءِ.",
            "verse 79:34": "پوءِ جڏھن وڏو واقعو (قيامت جو) ايندو.",
            "verse 79:35": "اُن ڏينھن ماڻھو اھو ياد ڪندو جيڪي (دنيا ۾) ڪمايو ھوائين.",
            "verse 79:36": "۽ دوزخ اُنھيءَ لاءِ پڌرو ڪبو جيڪو ڏسڻ گھرندو.",
            "verse 79:37": "پوءِ جيڪو حد کان لنگھيو ھوندو.",
            "verse 79:38": "۽ ھن دنيا جي حياتيءَ کي ڀَلو سمجھيائين.",
            "verse 79:39": "تنھن جي جاءِ بيشڪ دوزخ آھي.",
            "verse 79:40": "۽ جيڪو پنھنجي پالڻھار جي (حضور ۾) روبرو بيھڻ کان ڊنو ۽ نفس کي سَڌ کان جھليائين.",
            "verse 79:41": "پوءِ تنھنجي جاءِ بيشڪ بھشت آھي.",
            "verse 79:42": "(اي پيغمبر) توکان قيامت بابت پُڇن ٿا ته اُن جو (واقعو) ٿيڻ ڪڏھن آھي؟",
            "verse 79:43": "(اي پڇندڙ) اُن جي خبر بابت تون ڪھڙي خيال ۾ آھين؟",
            "verse 79:44": "اُن جي پڄاڻي (جي خبر) تنھنجي پالڻھار وٽ آھي.",
            "verse 79:45": "جيڪو قيامت کان ڊڄي رڳو تنھن لاءِ تون ڊيڄاريندڙ آھين.",
            "verse 79:46": "جنھن ڏينھن اُن کي ڏسندا (تنھن ڏينھن) ائين ڀانئيندا ته ڄڻڪ ھڪڙي وقت سانجھي يا ان جي صبح کانسواءِ (دنيا ۾) رھيا ئي نه ھوا."
        },
        "Sinhalese": {
            "verse 79:1": "සාහසික ලෙස (ප්‍රාණය) ගලවන්නන් මත දිවුරමින්.",
            "verse 79:2": "මෘදු ලෙස ගලවන්නන් මත ද දිවුරමින්.",
            "verse 79:3": "පාවෙමින් පිහිනා යන්නන් මත ද දිවුරමින්.",
            "verse 79:4": "තරඟකාරී ලෙස තරඟ වදින්නන් මත ද (දිවුරමින්)",
            "verse 79:5": "කටයුතු මෙහෙයවන්නන් මත ද (දිවුරමින්)",
            "verse 79:6": "එදින කම්පනය වන දෑ කම්පනය වේ.",
            "verse 79:7": "එයට පරව කම්පනය නැවත සිදු වනු ඇත.",
            "verse 79:8": "එදින හදවත් (බියෙන්) තැති ගනියි.",
            "verse 79:9": "ඔවුන්ගේ බැල්ම බියෙන් පවතී.",
            "verse 79:10": "“නියත වශයෙන්ම අපි පෙර තත්ත්වයටම නැවත හරවනු ලබන්නෙම්දැ” යි ඔවුහු පවසති.",
            "verse 79:11": "“අප දිරා ගිය අස්ථි බවට පත්වූයේ පසුව ද?”",
            "verse 79:12": "“එසේ නම් එය අලාභවන්ත හැරීමකි” යැයි ඔවුහු පවසති.",
            "verse 79:13": "එහෙත් එය එක් භයානක හඬක් පමණි.",
            "verse 79:14": "එවිට ඔවුහු (විනිශ්චය සඳහා) එළිමහන් තැනක සිටිති.",
            "verse 79:15": "මූසාගේ තොරතුරු (නබිවරය!) නුඹට ලැබුණේද?",
            "verse 79:16": "ඔහුගේ පරමාධිපති ඔහු ව තුවා නම් පාරිශුද්ධ නිම්නයෙහි ඇමතූ විට,",
            "verse 79:17": "ඔබ ෆිර්අවුන් වෙත යනු. නියත වශයෙන්ම ඔහු සීමාව ඉක්මවා ගොස් ඇත.",
            "verse 79:18": "එවිට ඔබ පිවිතුරු වීමට ඔබට (කැමැත්තක්) ඇත්දැයි නුඹ විමසනු.",
            "verse 79:19": "තවද මා ඔබට ඔබේ පරමාධිපති වෙත මඟ පෙන්වන්නෙමි. එවිට ඔබ බියබැතිමත් වනු ඇත.",
            "verse 79:20": "එවිට ඔහු (මූසා) ඔහුට මහා සළකුණ පෙන්වීය.",
            "verse 79:21": "නමුත් ඔහු (ෆිර්අවුන් එය)බොරු යැයි පවසා පිටුපෑවේය.",
            "verse 79:22": "පසු ව පසු බැස ගොස් (ඔහුට හානි කිරීමට) වෑයම් කළේය.",
            "verse 79:23": "එවිට ඔහු (ඔහුගේ ජනයා) රැස් කොට ඇමතුවේය.",
            "verse 79:24": "එවිට මම නුඹලාගේ උසස් පරමාධිපති වෙමි යැයි ඔහු පැවසුවේය.",
            "verse 79:25": "එහෙයින් අල්ලාහ් මෙලොව හා පරලොව දඬුවමට ඔහු ව හසු කර ගත්තේය.",
            "verse 79:26": "නියත වශයෙන්ම (අල්ලාහ්ට) බියවන්නෙකුට එහි පාඩමක් ඇත.",
            "verse 79:27": "මැවීමට දුෂ්කර වන්නේ නුඹලා ද නැතහොත් අහස ද? එය ඔහු(අල්ලාහ්) නිර්මාණය කළේය.",
            "verse 79:28": "ඔහු එහි වියන ඔසවා පසු ව එය නිවැරදි ව සැකසුවේය.",
            "verse 79:29": "තවද ඔහු එහි රාත්‍රිය (අඳුරෙන්) ආවරණය කර එහි දහවල හෙළි කළේය.",
            "verse 79:30": "තවද මහපොළොව ඉන් පසුව ඔහු එය දිග හැරියේය.",
            "verse 79:31": "ඔහු එයින් එහි ඇති ජලය ද එහි ඇති තණබිම් ද හටගැන්වීය.",
            "verse 79:32": "තවද කඳු එය ඔහු ස්ථාපිත කළේය.",
            "verse 79:33": "(එය) නුඹලාට හා නුඹලාගේ ගොවිපළ සතුන්ට භුක්ති විඳීමක් වශයෙනි.",
            "verse 79:34": "එහෙත් මහත් ව්‍යසනය පැමිණි විට,",
            "verse 79:35": "එදින මිනිසා තමන් (මෙලොව) ප්‍රයත්න දැරූ දෑ සිහිපත් කරන්නේය.",
            "verse 79:36": "තවද නරඹන්නන්හට නිරය ප්‍රත්‍යක්‍ෂ කරනු ලබයි.",
            "verse 79:37": "\"එහෙයින් සීමාව උල්ලංඝනය කර\"",
            "verse 79:38": "\"මෙලොව ජීවිතය තෝරා ගත් අය වූ කලී\"",
            "verse 79:39": "සැබැවින්ම නිරය වන එයමය (ඔවුන්ගේ) නිවහන වන්නේ.",
            "verse 79:40": "\"තවද තම පරමාධිපතිගේ සන්නිධාන(යේ පෙනී සිටීම)ට බිය වී තම ආත්මය ආශාවන්ගෙන් වළක්වා ගත් අය වූ කලී\"",
            "verse 79:41": "සැබැවින්ම ස්වර්ගය වන එයමය (ඔවුන්ගේ) නිවහන වන්නේ.",
            "verse 79:42": "එම හෝරාව එය කවදා සිදුවන්නේ දැයි ඔවුහු ඔබගෙන් විමසති.",
            "verse 79:43": "ඒ පිළිබඳ පැවසීමට ඔබට කුම(න බලය)ක් තිබේද?",
            "verse 79:44": "එහි අවසන් තීන්දුව නුඹගේ පරමාධිපති වෙත ය.",
            "verse 79:45": "ඒ පිළිබඳ බිය වන්නන්ට සැබැවින්ම නුඹ අවවාද කරන්නෙක් පමණි.",
            "verse 79:46": "සැබැවින්ම ඔවුන් එදින (එය දකින විට) සවස් කාලයක් හෝ දිවා කාලයක් හෝ මිස (ලොවෙහි) රැඳී නොසිටියාක් මෙන් සිතනු ඇත."
        },
        "Somali": {
            "verse 79:1": "Eebe wuxuu ku dhaartay Malaa'igta Nafta si daran uga siibta (gaalada).",
            "verse 79:2": "Iyo tan si fudud uga qaadda (mu'miniinta).",
            "verse 79:3": "Iyo Malaa'igta Hawada Dabbaalata (si amar fulin).",
            "verse 79:4": "Iyo tan u orotanta wanaagga.",
            "verse 79:5": "Iyo kuwa Maamula amarka (Eebe).",
            "verse 79:6": "Maalinta ay gilgilan afuufka (hore).",
            "verse 79:7": "Oyna raaci tii dambe (waa sugantahay).",
            "verse 79:8": "Qalbiyaduna Maalintaa way cabsan.",
            "verse 79:9": "Araggeeduna wuu dullaysnaan.",
            "verse 79:10": "Waxayna dhihi (Gaaladu) Ma raadkiibaa naloo celin (Adduunkii).",
            "verse 79:11": "Markaan noqonno Lafo duugoobay.",
            "verse 79:12": "Waxay dheheen taasi waa noqosho khasaara ah.",
            "verse 79:13": "Waa uun Hal Qaylo kaliya.",
            "verse 79:14": "Dadkuna markaas ay Dhulka kor iman.",
            "verse 79:15": "Ma ku soo gaadhay warkii (Nabi) Muuse.",
            "verse 79:16": "Markii Eebe uga yeedahy Toggii barakaysnaa ee Dhuwa.",
            "verse 79:17": "Kuna yidhi u tag Fircoon wuu xadgudbaye.",
            "verse 79:18": "Oo ku dheh ma rabtaa inaad daahir noqotid.",
            "verse 79:19": "Oon Eebe Jidkiisa kugu hanuuniyo kana yaabtid.",
            "verse 79:20": "Wuxuuna tusiyay (Nabi-Muuse) Aayad wayn.",
            "verse 79:21": "Wuuse beeniyay oo caasiyay (Fircoon).",
            "verse 79:22": "Wuuna jeedsaday isagoo xumaan la socda.",
            "verse 79:23": "Wuxuuna kulmiyay (Askartii) una Qaylyay.",
            "verse 79:24": "Isagoo dhihi waxaan ahay Eebihiinna sare.",
            "verse 79:25": "Markaasaa Eebe Ciqaabay Aakhiro iyo Adduunba.",
            "verse 79:26": "Arrintaasna waano yaa ugu sugan Ruuxii Eebe ka yaabi.",
            "verse 79:27": "Ma idinkaa daran abuuridda masc Samada Eebaa dhisay.",
            "verse 79:28": "Korna yeelay jurmigeeda ekeeyayna.",
            "verse 79:29": "Habeenkeedana madoobeeyay Maalinteedana soo bixiyay (Ifiyay).",
            "verse 79:30": "Dhulkana markaas ka dib fidiyay.",
            "verse 79:31": "Biyahiisa iyo Daaqiisana soo bixiyay.",
            "verse 79:32": "Buurahana sugay.",
            "verse 79:33": "Si aad idinka iyo Xoolihiinnu ugu nacfidaan.",
            "verse 79:34": "Markay timaaddo Musiibadii waynayd (qiyaamadu).",
            "verse 79:35": "Maalintaas Dadku way xusuusan waxay faleen.",
            "verse 79:36": "Naarta Jaxiimana waxaa loo muujin Ruuxii Arki.",
            "verse 79:37": "Ruuxiise xadgudba.",
            "verse 79:38": "Nolosha Adduunyana doorta.",
            "verse 79:39": "Wuxuu ku dheelman Naarta Jaxiimo.",
            "verse 79:40": "Ruuxiise ka yaaba la kulanka Eebe Naftana ka reeba Hawada (xun).",
            "verse 79:41": "Wuxuu u dheelman Janno.",
            "verse 79:42": "Waxay ku waydiin Saacadda (Qiyaamaha) markay sugnaan.",
            "verse 79:43": "Maxaa ku ogaysiiyay waqtigeeda.",
            "verse 79:44": "Eebe umbuu ku dhammaan ogaansheheedu.",
            "verse 79:45": "Adugu waxaad tahay uun u digaha Ruuxii ka yaabi.",
            "verse 79:46": "Waxay la mid noqon Malintay arkaan (Qiyaamada) yagon nagaanin Galab iyo Barqin mooyeen (Addunka)."
        },
        "Spanish": {
            "verse 79:1": "Por los que arrancan violentamente!",
            "verse 79:2": "Por los que toman con suavidad!",
            "verse 79:3": "Por los que bajan deprisa",
            "verse 79:4": "y se adelantan con ventaja",
            "verse 79:5": "y se encargan de llevar un asunto!",
            "verse 79:6": "El día en que se haga sonar el primer toque de cuerno",
            "verse 79:7": "y le siga el segundo;",
            "verse 79:8": "ese día habrá corazones palpitando.",
            "verse 79:9": "Sus miradas estarán humilladas.",
            "verse 79:10": "Decían: Acaso se nos devolverá al estado del que vinimos",
            "verse 79:11": "cuando ya seamos huesos descompuestos?",
            "verse 79:12": "Decían: Será entonces un regreso absurdo.",
            "verse 79:13": "Habrá un solo toque,",
            "verse 79:14": "y aparecerán en la superficie de la tierra.",
            "verse 79:15": "Te ha llegado la historia de Musa?",
            "verse 79:16": "Cuando tu Señor lo llamó en el valle purificado de Tuwa:",
            "verse 79:17": "Ve a Firaún que ha ido más allá de los límites!",
            "verse 79:18": "Y dile: Te llamo a que te purifiques,",
            "verse 79:19": "y a que te dejes guiar hacia tu Señor y tengas temor de Él!",
            "verse 79:20": "Y le hizo ver el mayor de los signos.",
            "verse 79:21": "Pero negó la realidad y desobedeció,",
            "verse 79:22": "luego se desentendió y siguió con lo suyo.",
            "verse 79:23": "Y convocó y proclamó",
            "verse 79:24": "diciendo: Yo soy vuestro señor supremo.",
            "verse 79:25": "Pero Allah lo agarró con el castigo ejemplar de la Última Vida y de la Primera.",
            "verse 79:26": "En eso hay un aviso para quien tenga temor.",
            "verse 79:27": "Sois vosotros más difíciles de crear o el cielo que Él edificó?",
            "verse 79:28": "Elevó su techo y lo hizo armonioso.",
            "verse 79:29": "Cubrió su noche y mostró su claridad diurna.",
            "verse 79:30": "Y después de eso extendió la tierra,",
            "verse 79:31": "e hizo salir de ella su agua y su pasto,",
            "verse 79:32": "y fijó las montañas.",
            "verse 79:33": "Como disfrute para vosotros y para vuestros rebaños.",
            "verse 79:34": "Así cuando llegue la gran Calamidad,",
            "verse 79:35": "el día en que el hombre recuerde aquello por lo que se esforzó",
            "verse 79:36": "y el Yahim sea mostrado a todo el que vea.",
            "verse 79:37": "El que traspasó los limites",
            "verse 79:38": "y prefirió la vida inmediata,",
            "verse 79:39": "tendrá como morada el Yahim.",
            "verse 79:40": "Pero quien temió que habría de comparecer ante su Señor y refrenó su alma del deseo,",
            "verse 79:41": "tendrá como morada el Jardín.",
            "verse 79:42": "Te preguntan sobre la Hora y su llegada.",
            "verse 79:43": "Y quién eres tú para hablar de ella?",
            "verse 79:44": "A tu Señor corresponde que llegue su momento.",
            "verse 79:45": "Tú no eres más que un advertidor para el que tenga temor.",
            "verse 79:46": "El día que la vean les parecerá que no permanecieron sino una tarde o su mañana."
        },
        "Swahili": {
            "verse 79:1": "Naapa kwa wanao komoa kwa nguvu,",
            "verse 79:2": "Na kwa wanao toa kwa upole,",
            "verse 79:3": "Na wanao ogelea,",
            "verse 79:4": "Wakishindana mbio,",
            "verse 79:5": "Wakidabiri mambo.",
            "verse 79:6": "Siku kitapo tetemeka cha kutetemeka,",
            "verse 79:7": "Kifuate cha kufuatia.",
            "verse 79:8": "Siku hiyo nyoyo zitapiga piga,",
            "verse 79:9": "Macho yatainama chini.",
            "verse 79:10": "Sasa wanasema: Ati kweli tutarudishwa kwenye hali ya kwanza?",
            "verse 79:11": "Hata tukiwa mifupa iliyo bunguliwa?",
            "verse 79:12": "Wanasema: Basi marejeo hayo ni yenye khasara!",
            "verse 79:13": "Kwa hakika hayo ni ukelele mmoja tu,",
            "verse 79:14": "Mara watakuwa kwenye uwanda wa mkutano!",
            "verse 79:15": "Je! Imekufikia hadithi ya Musa?",
            "verse 79:16": "Mola wake Mlezi alipo mwita katika bonde takatifu la T'uwaa, akamwambia:",
            "verse 79:17": "Nenda kwa Firauni. Hakika yeye amezidi jeuri.",
            "verse 79:18": "Umwambie: Je! Unapenda kujitakasa?",
            "verse 79:19": "Nami nitakuongoa ufike kwa Mola wako Mlezi, upate kumcha.",
            "verse 79:20": "Basi alimwonyesha Ishara kubwa.",
            "verse 79:21": "Lakini aliikadhibisha na akaasi.",
            "verse 79:22": "Kisha alirudi nyuma, akaingia kufanya juhudi.",
            "verse 79:23": "Akakusanya watu akanadi.",
            "verse 79:24": "Akasema: Mimi ndiye Mola wenu Mlezi mkuu kabisa.",
            "verse 79:25": "Basi hapo Mwenyezi Mungu akamshika kumuadhibu kwa la mwisho na la mwanzo.",
            "verse 79:26": "Kwa hakika katika haya yapo mazingatio kwa wanao ogopa.",
            "verse 79:27": "Je! Ni vigumu zaidi kukuumbeni nyinyi au mbingu? Yeye ndiye aliye ijenga!",
            "verse 79:28": "Akainua kimo chake, na akaitengeneza vizuri.",
            "verse 79:29": "Na akautia giza usiku wake, na akautokeza mchana wake.",
            "verse 79:30": "Na juu ya hivyo ameitandaza ardhi.",
            "verse 79:31": "Akatoa ndani yake maji yake na malisho yake,",
            "verse 79:32": "Na milima akaisimamisha,",
            "verse 79:33": "Kwa nafuu yenu na mifugo yenu.",
            "verse 79:34": "Basi itakapo fika hiyo balaa kubwa,",
            "verse 79:35": "Siku ambayo mtu atakumbuka aliyo yafanya,",
            "verse 79:36": "Na Jahannamu itadhihirishwa kwa mwenye kuona,",
            "verse 79:37": "Basi ama yule aliye zidi ujeuri,",
            "verse 79:38": "Na akakhiari maisha ya dunia,",
            "verse 79:39": "Kwa hakika Jahannamu ndiyo makaazi yake!",
            "verse 79:40": "Na ama yule anaye ogopa kusimamishwa mbele ya Mola wake Mlezi, na akajizuilia nafsi yake na matamanio,",
            "verse 79:41": "Basi huyo, Pepo itakuwa ndiyo makaazi yake!",
            "verse 79:42": "Wanakuuliza Saa (ya Kiyama) itakuwa lini?",
            "verse 79:43": "Una nini wewe hata uitaje?",
            "verse 79:44": "Kwa Mola wako Mlezi ndio mwisho wake.",
            "verse 79:45": "Kwa hakika wewe ni mwonyaji tu kwa mwenye kuikhofu.",
            "verse 79:46": "Ni kama kwamba wao siku watapo iona (hiyo Saa) hawakukaa ila jioni moja tu, au mchana wake."
        },
        "Swedish": {
            "verse 79:1": "VID STJÄRNORNA som stiger [över horisonten] för att [sedan sjunka och] försvinna,",
            "verse 79:2": "som rör sig i jämna och stadiga banor,",
            "verse 79:3": "som svävar med lätthet [genom rymden],",
            "verse 79:4": "som passerar varandra [i sina kretslopp]",
            "verse 79:5": "och som ger fasta hållpunkter [för människornas liv].",
            "verse 79:6": "[TÄNK PÅ] den Dag då [jorden] skall skälva i ett väldigt skalv,",
            "verse 79:7": "följt av ännu ett [skalv],",
            "verse 79:8": "och då allas hjärtan skall bulta av fruktan",
            "verse 79:9": "[och] allas blickar vara naglade vid marken!",
            "verse 79:10": "[Om detta] säger de: \"Skall vi återställas i vårt ursprungliga skick,",
            "verse 79:11": "sedan våra ben förmultnat?\"",
            "verse 79:12": "[Och] de fortsätter: \"På denna återkomst skulle vi förlora!\"",
            "verse 79:13": "Ett enda dån [skall höras]",
            "verse 79:14": "och de [döda och begravda] skall stå där, fullt vakna!",
            "verse 79:15": "HAR DU hört berättelsen om Moses?",
            "verse 79:16": "Det hände sig att hans Herre ropade till honom i den heliga dalen Tuwa [och sade]:",
            "verse 79:17": "\"Gå till Farao - han har gått för långt i sitt övermod -",
            "verse 79:18": "och säg [till honom]: ”Vill du bli renad [från synd]?",
            "verse 79:19": "Vill du att jag visar dig vem din Herre är – så att du kan frukta Honom?'”",
            "verse 79:20": "Och [Moses begav sig till Farao och] visade honom [Guds] största tecken.",
            "verse 79:21": "Men [Farao] kallade honom lögnare och ville inte lyssna till honom.",
            "verse 79:22": "Därefter vände han Moses ryggen och gick",
            "verse 79:23": "för att samla [sina styrkor]",
            "verse 79:24": "och sade: \"Jag [och ingen annan] är er högste Herre!\"",
            "verse 79:25": "Och Gud gav honom hans straff såväl i det kommande livet som i denna värld och gjorde honom till ett varnande exempel [för eftervärlden].",
            "verse 79:26": "I detta ligger helt visst en lärdom för dem som står i bävan [inför Gud].",
            "verse 79:27": "VAR DET en svårare uppgift att skapa er än att skapa den himmel som Han har byggt?",
            "verse 79:28": "Han har rest dess valv och format det [med hänsyn till den uppgift det skall fylla];",
            "verse 79:29": "Han har höljt dess natt i djupt mörker och låtit dess morgon framträda i klart ljus.",
            "verse 79:30": "Och efter detta har Han brett ut jordens yta",
            "verse 79:31": "och låtit dess vatten komma i dagen och dess ängar och beteshagar [frodas]",
            "verse 79:32": "och förankrat bergen;",
            "verse 79:33": "[allt detta har Han gjort] till nytta för er och er boskap.",
            "verse 79:34": "OCH när den Dag kommer då allt omstörtas,",
            "verse 79:35": "den Dag då människan skall återkalla i minnet allt det som hon strävade mot",
            "verse 79:36": "och då helvetet skall göras fullt synligt för alla som kan se -",
            "verse 79:37": "då skall han som alltid överskred [Guds bud]",
            "verse 79:38": "och som valde det jordiska livet [framför evigheten],",
            "verse 79:39": "[då skall han få se att] helvetet är [hans] slutliga bestämmelse!",
            "verse 79:40": "Men den som bävade vid tanken att en Dag stå [till svars] inför sin Herre och som kunde lägga band på sina begär",
            "verse 79:41": "skall [få se att] paradiset är [hans] slutliga bestämmelse.",
            "verse 79:42": "DE FRÅGAR dig om den Yttersta stunden och när den skall komma.",
            "verse 79:43": "Hur skulle du kunna säga något om detta?",
            "verse 79:44": "Ingen annan än din Herre vet när den [Yttersta stunden] till sist skall komma.",
            "verse 79:45": "Du [Muhammad] är bara varnaren som skall varna dem som fruktar denna [Stund].",
            "verse 79:46": "Den Dag då de får uppleva den, [skall det förefalla dem] som om de inte hade tillbringat mer än en afton eller en morgon [på jorden]."
        },
        "Tajik": {
            "verse 79:1": "Савганд ба фариштагоне, ки ҷонҳоро (ҷонҳои кофиронро) ба сахтӣ мегиранд",
            "verse 79:2": "ва савганд ба фариштагоне, ки чонҳоро (ҷонҳои муъминонро) ба осонӣ мегиранд",
            "verse 79:3": "ва савганд ба фариштагоне, ки шиноваранд",
            "verse 79:4": "ва савганд, ба фариштагоне, ки бар якдигар пешӣ мегиранд (дар боло бурдани ҷонҳои мӯъминон)",
            "verse 79:5": "ва савганд ба онҳо, ки тадбири корҳо мекунанд,",
            "verse 79:6": "ки он рӯз, ки нахустин нафхаи қиёмат (дамидани дар сур) заминро биларзонад",
            "verse 79:7": "ва нафхаи дуввум аз паси он биёяд,",
            "verse 79:8": "дар он рӯз дилҳое дар ҳарос бошанд",
            "verse 79:9": "ва нишони хушӯъ (хорӣ) дар дидагон намоён!",
            "verse 79:10": "Мегӯянд: «Оё мо ба ҳолати нахустин бозмегардем,",
            "verse 79:11": "он гоҳ ки устухонҳое пӯсида будем?»",
            "verse 79:12": "Гӯянд: «Ин бозгашти мо бозгаштест зиёновар!",
            "verse 79:13": "Фақат ин аст, ки танҳо як бонг бармеояд.",
            "verse 79:14": "ва онҳо худро дар он саҳро хоҳанд ёфт.",
            "verse 79:15": "Оё достони Мӯсо ба ту расидааст?",
            "verse 79:16": "Он гоҳ ки Парвардигораш ӯро дар водии муқаддаси Туво нидо дод:",
            "verse 79:17": "«Ба сӯи Фиръавн бирав, ки аз ҳад гузаштааст.",
            "verse 79:18": "Бигӯ: «Оё туро рағбате ҳаст, ки покиза шавӣ,",
            "verse 79:19": "ва ман туро ба Парвардигорат роҳ бинамоям ва ту битарсӣ (аз Ӯ)?»",
            "verse 79:20": "Пас он ояти бузургро ба ӯ нишон дод.",
            "verse 79:21": "Ва ӯ дурӯғ бароварду нофармонӣ кард.",
            "verse 79:22": "Сипас пушт гардонду мешитофт.",
            "verse 79:23": "Пас ҳамаро ҷамъ кард ва нидо дод.",
            "verse 79:24": "ва гуфт: «Ман Парвардигори бартари шумо ҳастам!»",
            "verse 79:25": "Худояш ба аозби охирату дунё гирифтор кард.",
            "verse 79:26": "Дар ин ибратест барои, касе, ки метарсад!",
            "verse 79:27": "Оё шумо ба офариниш сахттаред, ё ин осмоне, ки Ӯ бино кардааст?",
            "verse 79:28": "Сақфашро барафрошт ва дуруст кард,",
            "verse 79:29": "шабашро торик кард ва рӯшноияшро ошкор сохт",
            "verse 79:30": "ва пас аз он заминро бигустурд (паҳн кард)",
            "verse 79:31": "ва аз он об берун овард ва чарогоҳҳо падид овард",
            "verse 79:32": "ва кӯҳҳоро устувор гардонид",
            "verse 79:33": "барои баҳрагирии шумо ва чорпоёнатон.",
            "verse 79:34": "Чун он ҳодисаи бузург даррасад,",
            "verse 79:35": "рӯзе, ки одамӣ ҳамаи амалҳои худро ба ёд оварад",
            "verse 79:36": "ва ҷаҳаннамро ба ҳар кӣ мебинад нишон диҳанд,",
            "verse 79:37": "Пас ҳар кй аз ҳад гузашта бошад (дар куфру исён)",
            "verse 79:38": "ва зиндагии инҷаҳонро ихтиёр карда бошад,",
            "verse 79:39": "ҷаҳаннам ҷойгоҳи ӯст.",
            "verse 79:40": "Аммо ҳар кас, ки аз истодан дар баробари Парвардигораш тарсида ва нафсро аз ҳаво (ва ҳавас) боздошта бошад,",
            "verse 79:41": "биҳишт ҷойгоҳи ӯст.",
            "verse 79:42": "Туро аз қиёмат мепурсанд, ки чӣ вақт воқеъ шавад.",
            "verse 79:43": "Аз ёд кардани (илми) он туро чӣ кор аст?",
            "verse 79:44": "Интиҳои илми он назди Парвардигори туст.",
            "verse 79:45": "Фақат ва фақат ту касонеро, ки аз он рӯз битарсанд, бим медиҳӣ.",
            "verse 79:46": "Чун онро бубинанд, пиндоранд дар ин ҷаҳон фақат як шомгоҳ ё чоштгоҳ истодаанд."
        },
        "Tamil": {
            "verse 79:1": "(பாவிகளின் உயிர்களை) கடினமாகப் பறிப்பவர்(களான மலக்கு)கள் மீது சத்தியமாக-",
            "verse 79:2": "(நல்லோர் உயிர்களை) இலோசாகக் கழற்றுபவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
            "verse 79:3": "வேகமாக நீந்திச் செல்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
            "verse 79:4": "முந்தி முந்திச் செல்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
            "verse 79:5": "ஒவ்வொரு காரியத்தையும் நிர்வகிப்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
            "verse 79:6": "பூமி நடுக்கமாக நடுங்கும் அந்நாளில்;",
            "verse 79:7": "அதனைத் தொடரும் (நில நடுக்கம்) தொடர்ந்து வரும்.",
            "verse 79:8": "அந்நாளில் நெஞ்சங்கள் திடுக்கிட்டவையாக இருக்கும்.",
            "verse 79:9": "அவர்கள் பார்வைகள் (அச்சத்தால்) கீழ் நோக்கியிருக்கும்.",
            "verse 79:10": "\"நாம் நிச்சயமாக கப்ருகளிலிருந்து திரும்ப (எழுப்ப)ப் படுவோமா?\" என்று கூறுகிறார்கள்.",
            "verse 79:11": "\"மக்கிப் போன எலும்புகளாக நாம் ஆகிவிட்ட பொழுதிலுமா?\"",
            "verse 79:12": "\"அப்படியானால் அது பெரும் நஷ்ட முண்டாக்கும் திரும்புதலே யாகும்\" என்றும் கூறுகின்றார்கள்.",
            "verse 79:13": "ஆனால் (யுக முடிவுக்கு), அது நிச்சயமாக ஒரே ஒரு பயங்கர சப்தம் தான்-",
            "verse 79:14": "அப்போது அவர்கள் (உயிர் பெற்றெழுந்து) ஒரு திடலில் சேகரமாய் விடுவார்கள்.",
            "verse 79:15": "(நபியே!) மூஸாவின் செய்தி உங்களுக்கு வந்ததா?",
            "verse 79:16": "'துவா' என்னும் புனித பள்ளத்தாக்கில் அவருடைய இறைவன் அவரை அழைத்து,",
            "verse 79:17": "\"நீர் ஃபிர்அவ்னிடம் செல்லும், நிச்சயமாக அவன் வரம்பு மீறி விட்டான்.\"",
            "verse 79:18": "இன்னும் (ஃபிர்அவ்னிடம்; \"பாவங்களை விட்டும்) பரிசத்தமாக வேண்டும் என்ற (விருப்பம்) உன்னிடம் இருக்கிறதா?\" என்று கேளும்.",
            "verse 79:19": "\"அப்படியானால் இறைவனிடம் (செல்லும்) வழியை நான் உனக்குக் காண்பிக்கிறேன்; அப்போது நீ உள்ளச்சமுடையவன் ஆவாய்\" (எனக் கூறுமாறு இறைவன் பணித்தான்).",
            "verse 79:20": "ஆகவே, மூஸா அவனுக்கு பெரும் அத்தாட்சியை காண்பித்தார்.",
            "verse 79:21": "ஆனால், அவனோ அதைப் பொய்ப்பித்து, மாறு செய்தான்.",
            "verse 79:22": "பிறகு அவன் (அவரை விட்டுத்) திரும்பி (அவருக்கெதிராய் சதி செய்ய) முயன்றான்.",
            "verse 79:23": "அன்றியும் (அவன் தன் சமூகத்தாரை) ஒன்று திரட்டி அறிக்கை செய்தான்.",
            "verse 79:24": "\"நான்தான் உங்களுடைய மாபெரும் இறைவன் - ரப்புக்குமுல் அஃலா\" என்று (அவர்களிடம்) கூறினான்.",
            "verse 79:25": "இம்மைக்கும் மறுமைக்குமான தண்டனையாக அல்லாஹ் அவனை பிடித்துக் கொண்டான்.",
            "verse 79:26": "நிச்சயமாக இதில் இறையச்சம் கொள்வோருக்கு படிப்பினை இருக்கிறது.",
            "verse 79:27": "உங்களைப் படைத்தல் கடினமா? அல்லது வானத்தை (படைத்தல் கடினமா?) அதை அவனே படைத்தான்.",
            "verse 79:28": "அதன் முகட்டை அவன் உயர்த்தி அதை ஒழுங்கு படுத்தினான்.",
            "verse 79:29": "அவன்தான் இரவை இருளுடையதாக்கிப் பகலின் ஒளியையும் வெளியாக்கினான்.",
            "verse 79:30": "இதன் பின்னர், அவனே பூமியை விரித்தான்.",
            "verse 79:31": "அதிலிருந்து அதன் தண்ணீரையும், அதன் மீதுள்ள (பிராணிகளுக்கான) மேய்ச்சல் பொருள்களையும் அவனே வெளியாக்கினான்.",
            "verse 79:32": "அதில், மலைகளையும் அவனே நிலை நாட்டினான்.",
            "verse 79:33": "உங்களுக்கும், உங்கள் கால் நடைகளுக்கும் பலனளிப்பதற்காக (இவ்வாறு செய்துள்ளான்).",
            "verse 79:34": "எனவே (தடுத்து நிறுத்த முடியாத மறுமைப்) பேரமளி வந்து விட்டால்,",
            "verse 79:35": "அந்நாளில் மனிதன் தான் முயன்றவற்றையெல்லாம் நினைவுபடுத்திக் கொள்வான்.",
            "verse 79:36": "அப்போது பார்ப்போருக்கு(க் காணும் வகையில்) நரகம் வெளிப்படுத்தப்படும்.",
            "verse 79:37": "எனவே, எவன் வரம்பை மீறினானோ -",
            "verse 79:38": "இந்த உலக வாழ்க்கையைத் தேர்ந்தெடுத்தானோ-",
            "verse 79:39": "அவனுக்கு, நிச்சயமாக நரகந்தான் தங்குமிடமாகும்.",
            "verse 79:40": "எவன் தன் இறைவன் முன் நிற்பதை அஞ்சி மனதையும் இச்சைகளை விட்டு விலக்கிக் கொண்டானோ,",
            "verse 79:41": "நிச்சயமாக அவனுக்குச் சுவர்க்கம்தான் தங்குமிடமாகும்.",
            "verse 79:42": "(நபியே! \"மறுமையின்) நேரத்தைப் பற்றி - அது எப்போது ஏற்படும்?\" என்று அவர்கள் உம்மைக் கேட்கிறார்கள்.",
            "verse 79:43": "அ(ந்நேரத்)தைப் பற்றி நீர் குறிப்பிடுவதற்கு என்ன இருக்கிறது?",
            "verse 79:44": "அதன் முடிவெல்லாம் உம்முடைய இறைவனிடம் (அல்லவா) இருக்கிறது.",
            "verse 79:45": "அதை பயப்படுவோருக்கு, நிச்சயமாக நீர் எச்சரிக்கை செய்பவர் தாம்,",
            "verse 79:46": "நிச்சயமாக அதை அவர்கள் காணும் நாளில், மாலையிலோ, அல்லது காலையிலோ ஒரு சொற்ப நேரமேயன்றி, அவர்கள் (இவ்வுலகில்) தங்கியிருக்கவில்லை என்று தோன்றும்."
        },
        "Tatar": {
            "verse 79:1": "Кәферләрнең җаннарын катылык илә суырып алучы фәрештәләр илә,",
            "verse 79:2": "дәхи мөэминнәрнең җаннарын җиңеллек белән суырып алучы фәрештәләр илә ант итәмен.",
            "verse 79:3": "Дәхи җир белән кук арасында тизлек белән йөрүче фәрештәләр илә,",
            "verse 79:4": "кәферләрнең җаннарын җәһәннәмгә вә мөэминнәрнең җаннарын җәннәткә алып узышучы фәрештәләр илә,",
            "verse 79:5": "Эшләрне тәдбир кылып йөрүче фәрештәләр илә ант итәмен.",
            "verse 79:6": "Беренче сурда җир каты хәрәкәтләнер дә, җир өстендә тереклек бетәр.",
            "verse 79:7": "Вә беренче сурга ияртелеп икенче сур булыр да, кешеләр кабердән терелеп чыгарлар.",
            "verse 79:8": "Ул көндә куркудан күңелләр урыннарыннан купкан булырлар.",
            "verse 79:9": "Ул күңелләрнең, күзләре түбән төшкән булыр.",
            "verse 79:10": "Дөньяда Коръәнгә ышанмаучылар әйтәләр: \"Әйә без үлгәннән соң, терелеп яңадан әүвәлге хәлебезгә кайтабызмы?",
            "verse 79:11": "Әйә без черегән сөяк булганнан соң да терелеп кайтырбызмы?",
            "verse 79:12": "Терелүгә ышанмыйча мәсхәрәләп әйттеләр: \"Әгәр яңадан терелү булса, бу бик хәсрәтле кайтарылу икән, аның өчен кайгырырга кирәк\", – дип.",
            "verse 79:13": "Аларның терелеп кубарылулары фәкать бер тавыш белән булыр.",
            "verse 79:14": "Шул вакытта ук алар җир өстендә булырлар.",
            "verse 79:15": "Ий Мухәммәд г-м сиңа Муса хәбәре килде бит?",
            "verse 79:16": "Мусаның Раббысы аңа нида кылды, Тур тавының итәгендәге мүбарәк Тува дигән урында.",
            "verse 79:17": "Иманга өндәмәк өчен Фиргаунгә баргыл, тәхкыйк ул азды, бозыклыкны күп кылды.",
            "verse 79:18": "Әйт аңа: \"Әйә кирәксенәсеңме кабих булган көфердән пакьләнүне.",
            "verse 79:19": "Дәхи сиңа Раббыңны танытуымны телисеңме, әгәр Раббыңны танысаң, Аңардан куркырсың да изге гамәлләр кылырсың\", – дип.",
            "verse 79:20": "Муса Фиргаунгә олугъ могҗиза күрсәтте. (Ягъни таягы аҗдаһа булды һәм кулын култыгыннан чыгарган иде кояш кеби якты булып күренде).",
            "verse 79:21": "Фиргаун Мусаның пәйгамбәрлеген һәм күрсәткән могҗизасын ялганга санады һәм Мусага каршы дошманлык кылды.",
            "verse 79:22": "Соңра Мусадан йөз чөереп, борылып китте дә теләгән кадәр бозык эшләрне кыла торган булды.",
            "verse 79:23": "Һәм үзенең кавемен вә ґәскәрсн җыйды вә кычкырып нида кылды.",
            "verse 79:24": "Әйтте: \"Мин сезнең олугъ Раббыгызмын, миннән башка сезнең һич Илаһәгез юктыр\", – дип.",
            "verse 79:25": "Аллаһ, ул Фиргаунне тотты дөньяда суга батырып, ахирәттә җәһәннәмгә салу беләк.",
            "verse 79:26": "Тәхкыйк бу вакыйгада гыйбрәт бардыр Аллаһудан курыккан кешегә.",
            "verse 79:27": "Халык кылуда сезнең яратылуыгыз читенрәкме, әллә күкне ярату читенрәкме? Ул күкне Аллаһ бина кылды.",
            "verse 79:28": "Ул күкнең бөеклеген бик югары кылды, ул күкне һич кимчелексез төзеп тәмам итте.",
            "verse 79:29": "Ул күкнең кичен караңгы кылды вә аның көндезен якты кылды.",
            "verse 79:30": "Моның соңында Аллаһ, торырга яраклы итеп җирне түшәде.",
            "verse 79:31": "Җирнең суын һәм хайваннар утлый торган үләннәрне чыгарды.",
            "verse 79:32": "Дәхи тауларны мәхкәм сабит кылды.",
            "verse 79:33": "Сезгә вә сезнең хайваннарыгызга файда өчен.",
            "verse 79:34": "Әгәр олугъ җыелыш көне кыямәт килсә,",
            "verse 79:35": "ул көндә кеше дөньяда кылган яман эшләрен искәрер күз алдына китерер.",
            "verse 79:36": "Вә күзе күргән кешеләргә җәһәннәм күрсәтелер.",
            "verse 79:37": "Әмма берәү шәригать чигеннән чыгып бозыклык кылса,",
            "verse 79:38": "дәхи дөньяга бирелеп ахирәт гамәленә кимчелек китерсә,",
            "verse 79:39": "Шиксез, ул кешегә урын җәһәннәмдер.",
            "verse 79:40": "Вә әмма берәү Аллаһ алдына басып Аңа җавап бирүдән курыкса, вә үзен нәфесе теләгән гөнаһлы эшләрдән тыйса,",
            "verse 79:41": "әлбәттә җәннәт аңа урындыр.",
            "verse 79:42": "Кәферләр синнән кыямәт кайчан була, дип сорыйлар.",
            "verse 79:43": "Кыямәтнең кайчан булачагын әйтүдә сиңа нинди файда? Әйтсәң дә фәкать көферлекләрен арттырачаклар.",
            "verse 79:44": "Кыямәт вакытының ахыр чиге Аллаһуга хастыр.",
            "verse 79:45": "Ий Мухәммәд г-м, син фәкать ул кыямәттән курыккан кешене куркытучысың.",
            "verse 79:46": "Алар кыямәтне күргәндә гүя дөньяда бер дә тормаган кеби булырлар, мәгәр төшкә хәтле ярты көн яки төштән соң ярты көн торган кеби булырлар."
        },
        "Telugu": {
            "verse 79:1": "(అవిశ్వాసుల ప్రాణాలను) కఠినంగా లాగి తీసే వారి (దేవదూతల) సాక్షిగా",
            "verse 79:2": "(విశ్వాసుల ప్రాణాలను) నెమ్మదిగా తీసేవారి (దేవదూతల) సాక్షిగా",
            "verse 79:3": "(విశ్వంలో) తేలియాడుతూ పోయే వారి సాక్షిగా",
            "verse 79:4": "మరియు పందెంలో వలే (ఒకరితో నొకరు) పోటీ పడే వారి సాక్షిగా",
            "verse 79:5": "మరియు (తమ ప్రభువు) ఆజ్ఞానుసారం వ్యవహారాలు నిర్వహించేవారి (దేవదూతల) సాక్షిగా",
            "verse 79:6": "ఆ రోజు (మొదటి) బాకా ధ్వని భూగోళాన్ని తీవ్రంగా కంపింపజేస్తుంది",
            "verse 79:7": "దాని తర్వాత రెండవ సారి బాకా ఊదబడుతుంది. (అప్పుడు అందరూ పునరుత్థరింప బడతారు)",
            "verse 79:8": "ఆ రోజు (కొన్ని) హృదయాలు (భయంతో) దడదడలాడుతూ ఉంటాయి",
            "verse 79:9": "వారి చూపులు క్రిందికి వాలి ఉంటాయి",
            "verse 79:10": "వారు ఇలా అంటున్నారు: ఏమీ? మనం మన పూర్వ స్థితిలోకి మళ్ళీ తీసుకు రాబడతామా",
            "verse 79:11": "మనం శిథిలమైన ఎముకలుగా మారి పోయిన తరువాత కూడానా",
            "verse 79:12": "వారు (ఇంకా ఇలా) అంటారు: అయితే ఈ తిరిగి రావటమనేది చాల నష్టదాయకమైనదే",
            "verse 79:13": "కాని అది వాస్తవానికి, ఒకే ఒక (తీవ్రమైన) ధ్వని",
            "verse 79:14": "అప్పుడు వారందరూ, ఒకేసారి లేచి మైదానంలోకి వచ్చి ఉంటారు",
            "verse 79:15": "ఏమీ? నీకు మూసా వృత్తాంతం అందిందా",
            "verse 79:16": "అతని ప్రభువు పవిత్ర తువా లోయలో అతనిని పిలిచినప్పుడు",
            "verse 79:17": "(ఇలా అన్నాడు): ఫిర్ఔన్ వద్దకు వెళ్ళు, నిశ్చయంగా, అతడు ధిక్కారుడయ్యాడు",
            "verse 79:18": "ఇక (అతనితో) ఇట్లను: `ఏమీ? నీవు పాపరహితుడవు అవటానికి ఇష్టపడతావా",
            "verse 79:19": "మరియు నేను నీకు నీ ప్రభువు వైపునకు మార్గదర్శకత్వం చేస్తాను, మరి నీవు ఆయన పట్ల భీతి కలిగి ఉంటావా",
            "verse 79:20": "తరువాత అతను (మూసా) అతడికి (ఫిర్ఔన్ కు) గొప్ప అద్భుత నిదర్శనాన్ని చూపాడు",
            "verse 79:21": "కాని అతడు (ఫిర్ఔన్) దానిని అబద్ధమని తిరస్కరించాడు మరియు (అతని మాటను) ఉల్లంఘించాడు",
            "verse 79:22": "ఆ తర్వాత అతడు (ఫిర్ఔన్) వెనక్కి మరలి పోయి, (కుట్రలు) పన్నసాగాడు",
            "verse 79:23": "పిదప (ప్రజలను) సమావేశపరచి, ఎలుగెత్తి చాటుతూ",
            "verse 79:24": "ఇలా అన్నాడు: నేనే మీ యొక్క మహాన్నత ప్రభువును",
            "verse 79:25": "కావున అల్లాహ్ అతనిని ఇహపరలోకాల శిక్షకు గురి చేశాడు",
            "verse 79:26": "నిశ్చయంగా, ఇందులో (అల్లాహ్ కు) భయపడే ప్రతి వ్యక్తి కొరకు గుణపాఠముంది",
            "verse 79:27": "ఏమీ? మిమ్మల్ని సృష్టించడం కఠినమయిన పనా? లేక ఆకాశాన్నా? ఆయనే కదా దానిని నిర్మించింది",
            "verse 79:28": "ఆయన దాని కప్పు (ఎత్తు)ను చాలా పైకి లేపాడు. తరువాత దానిని క్రమపరిచాడు",
            "verse 79:29": "మరియు ఆయన దాని రాత్రిని చీకటిగా చేశాడు. మరియు దాని పగటిని (వెలుగును) బహిర్గతం చేశాడు",
            "verse 79:30": "మరియు ఆ పిదప భూమిని పరచినట్లు చేశాడు",
            "verse 79:31": "దాని నుండి దాని నీళ్ళను మరియు దాని పచ్చికను బయటికి తీశాడు",
            "verse 79:32": "మరియు పర్వతాలను (దానిలో) స్థిరంగా నాటాడు",
            "verse 79:33": "మీకు మరియు మీ పశువులకు జీవన సామగ్రిగా",
            "verse 79:34": "ఇక ఆ గొప్ప దుర్ఘటన (పునరుత్థాన దినం) వచ్చినప్పుడు",
            "verse 79:35": "ఆ రోజు మానవుడు తాను చేసిందంతా జ్ఞాపకం చేసుకుంటాడు",
            "verse 79:36": "మరియు చూసే వారి యెదుటకు, నరకాగ్ని స్పష్టంగా కనబడేటట్లు తేబడుతుంది",
            "verse 79:37": "ఇక ధిక్కారంతో హద్దులు మీరి ప్రవర్తించిన వాడికి",
            "verse 79:38": "మరియు ఐహిక జీవితానికి ప్రాధాన్యత నిచ్చిన వాడికి",
            "verse 79:39": "నిశ్చయంగా, నరకాగ్నియే, వాని నివాస స్థానమవుతుంది",
            "verse 79:40": "మరియు తన ప్రభువు ముందు నిలబడ వలసి వుంటుందన్న భయంతో తన మనస్సును దుష్టవాంఛలకు దూరంగా ఉంచిన వ్యక్తికి",
            "verse 79:41": "నిశ్చయంగా, స్వర్గమే, అతని నివాస స్థానమవుతుంది",
            "verse 79:42": "(ఓ ముహమ్మద్!) వీరు నిన్ను - ఆ ఘడియను గురించి: అసలు అది ఎప్పుడొస్తుంది?\" అని అడుగుతున్నారు",
            "verse 79:43": "దాని గురించి చెప్పడానికి దాంతో నీకేమి సంబంధం",
            "verse 79:44": "దాని వాస్తవ జ్ఞానం నీ ప్రభువుకే ఉంది",
            "verse 79:45": "(ఓ ముహమ్మద్!) నిశ్చయంగా, నీవు, దానికి భయపడే వారిని హెచ్చరించే వాడవు మాత్రమే",
            "verse 79:46": "వారు దానిని చూసిన రోజు (తాము ప్రపంచంలో) కేవలం ఒక సాయంత్రమో లేక ఒక ఉదయమో గడిపినట్లు భావిస్తారు"
        },
        "Thai": {
            "verse 79:1": "ขอสาบานด้วย (มะลาอิกะฮฺ) ผู้ฉุดกระชาก (วิญญาณของผู้ปฏิเสธศรัทธา) อย่างแรง",
            "verse 79:2": "ขอสาบานด้วย (มะลาอิกะฮฺ) ผู้ชัก (วิญญาณของผู้ศรัทธา) อย่างแผ่วเบา",
            "verse 79:3": "ขอสาบานด้วย (มะลาอิกะฮฺ) ที่แหวกว่ายในท้องนภากาศ",
            "verse 79:4": "แล้วพวกเขา (มะลาอิกะฮฺ) ผู้รีบรุดหน้าไปอย่างว่องไว",
            "verse 79:5": "แล้วพวกเขา (มะลาอิกะฮฺ) ผู้บริหารกิจการ",
            "verse 79:6": "วันซึ่งการเป่าสังข์ครั้งแรกทำให้สั่นสะเทือน",
            "verse 79:7": "การเป่าสังข์ครั้งสองจะติดตามมา",
            "verse 79:8": "ในวันนั้นดวงจิตทั้งหลายจะตระหนก",
            "verse 79:9": "สายตาของพวกเขาจะละห้อย",
            "verse 79:10": "พวกเขาจะกล่าวว่า พวกเราจะถูกให้กลับไปอยู่ในสภาพเดิมอีกกระนั้นหรือ ?",
            "verse 79:11": "เมื่อเราได้กลายเป็นกระดูกที่ผุแล้วกระนั้นหรือ ?",
            "verse 79:12": "พวกเขากล่าวว่า ถ้าเป็นเช่นนั้นก็เป็นการกลับไปที่ขาดทุน",
            "verse 79:13": "ความจริงมันเป็นเพียงเสียงก้อนครั้งเดียวเท่านั้น",
            "verse 79:14": "แล้วเมื่อนั้นพวกเขาก็จะออกมายังที่ราบโล่ง",
            "verse 79:15": "เรื่องราวของมูซาได้มาถึงได้มาถึงเจ้าแล้วมิใช่หรือ ?",
            "verse 79:16": "ขณะที่พระเจ้าของเขาทรงเรียกเขาที่หว่างหุบเขาฏวาอันบริสุทธิ์",
            "verse 79:17": "เจ้าจงไปหาฟิรเอานฺ เพราะเขาละเมิดฝ่าฝืน",
            "verse 79:18": "แล้วจงกล่าวว่า ท่านประสงค์จะซักฟอกไหม ?",
            "verse 79:19": "และจะให้ฉันนำท่านไปสู่พระเจ้าของท่านไหม ? เพื่อท่านจะได้ยำเกรง",
            "verse 79:20": "แล้วมูซาก็แสดงให้เขาเห็นสัญญาณอันยิ่งใหญ่",
            "verse 79:21": "แต่เขาได้ปฏิเสธและดื้นดัน",
            "verse 79:22": "แล้วเขาก็ผินหลังกลับหนีออกไปอย่างเร็ว",
            "verse 79:23": "แล้วเขาก็ได้เรียกชุมนุม แล้วประกาศออกไป",
            "verse 79:24": "แล้วกล่าวว่า ฉันคือพระเจ้าสูงสุดของพวกท่าน",
            "verse 79:25": "ดังนั้นอัลลอฮฺจึงคร่าเขาเป็นการลงโทษที่เป็นแบบอย่างทั้งในปรโลกและในโลกนี้",
            "verse 79:26": "แท้จริงในการนี้ย่อมเป็นข้อเตือนใจสำหรับผู้ยำเกรงของอัลลอฮฺ",
            "verse 79:27": "พวกเจ้าลำบากยิ่งในการสร้างกระนั้นหรือ ? หรือว่าชั้นฟ้าที่พระองค์ทรงสร้างมัน !",
            "verse 79:28": "พระองค์ทรงยกให้มันสูงขึ้นแล้วทรง ทำให้มันสมบูรณ์",
            "verse 79:29": "และทรงทำให้กลางคืนของมันมืดทึบ และทรงทำให้ความสว่างของมันออกมา",
            "verse 79:30": "และหลังจากนั้นทรงทำให้แผ่นดินเป็นพื้นราบเรียบ",
            "verse 79:31": "ทรงให้ออกมาจากแผ่นดินเป็นน้ำของมัน และทุ่งหญ้าของมัน",
            "verse 79:32": "ส่วนเทือกเขานั้นทรงทำให้มันมั่นคง",
            "verse 79:33": "ทั้งหมดนี้เป็นปัจจัยยังชีพสำหรับพวกเจ้า และสำหรับปศุสัตว์ของพวกเจ้า",
            "verse 79:34": "ดังนั้นเมื่อความหายนะอันใหญ่หลวงได้เกิดขึ้น",
            "verse 79:35": "เป็นวันที่มนุษย์จะนึกถึงสิ่งที่เขาได้ขวนขวายไว้",
            "verse 79:36": "และนรกหรือเปลวไฟจะถูกเผยให้แก่ผู้ที่มองมัน",
            "verse 79:37": "ส่วนผู้ที่ละเมิดฝ่าฝืนนั้น",
            "verse 79:38": "และเขาได้เลือกเอาการมีชีวิตอยู่ในโลกนี้",
            "verse 79:39": "ดังนั้นนรกหรือเปลวไฟคือที่พำนักของเขา",
            "verse 79:40": "และส่วนผู้ที่หวาดหวั่นต่อการยืนเบื้องหน้าพระเจ้าของเขา และได้หน่วงเหนี่ยวจิตใจจากกิเลสต่ำ",
            "verse 79:41": "ดังนั้นสวนสวรรค์ก็จะเป็นที่พำนักของเขา",
            "verse 79:42": "พวกเขาจะถามเจ้าถึงยามอวสาน (วันกิยามะฮฺ) ว่า เมื่อใดเล่ามันจะเกิดขึ้น ?",
            "verse 79:43": "ด้วยเหตุอันใดเจ้าจึงชอบกล่าวถึงมันนัก ?",
            "verse 79:44": "ยังพระเจ้าของเจ้าเท่านั้นคือวาระ",
            "verse 79:45": "ความจริงเจ้าเป็นแต่เพียงผู้ตักเตือนแก่คนที่หวาดหวั่นมัน (วันกิยามะฮฺ) เท่านั้น",
            "verse 79:46": "วันที่พวกเขาจะเห็นมัน (วันกิยามะฮฺ) ประหนึ่งว่าพวกเขามิได้พำนักอยู่โลกนี้เว้นแต่เพียงชั่วครู่หนึ่งของยามเย็นและยามเช้าของมันเท่านั้น"
        },
        "Turkish": {
            "verse 79:1": "Canları boğarcasına şiddetle çekip alanlara and olsun,",
            "verse 79:2": "Canları kolaylıkla alanlara and olsun,",
            "verse 79:3": "Yüzüp yüzüp gidenlere and olsun,",
            "verse 79:4": "Yarıştıkça yarışan ve işleri yöneten meleklere and olsun",
            "verse 79:5": "Yarıştıkça yarışan ve işleri yöneten meleklere and olsun",
            "verse 79:6": "O gün bir sarsıntı sarsar.",
            "verse 79:7": "Peşinden bir diğeri gelir.",
            "verse 79:8": "O gün kalbler titrer.",
            "verse 79:9": "İnsanların gözleri yere döner.",
            "verse 79:10": "Derler ki: \"Biz eski halimize mi döndürüleceğiz?\"",
            "verse 79:11": "\"Ufalanmış kemik olduğumuz zaman mı?\"",
            "verse 79:12": "Derler ki: \"O takdirde bu zararına bir dönüştür.\"",
            "verse 79:13": "Doğrusu bir tek çığlık yetecektir.",
            "verse 79:14": "Hepsi hemen bir düzlüğe dökülecektir.",
            "verse 79:15": "Musa'nın başından geçen olay sana geldi mi?",
            "verse 79:16": "Tuva'da, kutsal bir vadide, Rabbi ona şöyle hitap etmişti:",
            "verse 79:17": "\"Firavun'a git; doğrusu o azmıştır.\"",
            "verse 79:18": "\"Ona de ki: Arınmağa niyetin var mı?\"",
            "verse 79:19": "\"Rabbine giden yolu göstereyim ki O'na saygı duyup korkasın.\"",
            "verse 79:20": "Bunun üzerine ona en büyük mucizeyi gösterdi.",
            "verse 79:21": "Ama Firavun yalanladı ve baş kaldırdı.",
            "verse 79:22": "Geri dönüp yürüdü.",
            "verse 79:23": "Adamlarını toplayıp seslendi:",
            "verse 79:24": "\"Sizin en yüce rabbiniz benim\" dedi.",
            "verse 79:25": "Allah bunun üzerine onu dünya ve ahiret azabına uğrattı.",
            "verse 79:26": "Doğrusu bunda Allah'tan korkan kimseye ders vardır.",
            "verse 79:27": "Sizi yaratmak mı daha zordur, yoksa göğü yaratmak mı? Ki onu Allah bina edip yükseltmiş ve ona şekil vermiştir.",
            "verse 79:28": "Sizi yaratmak mı daha zordur, yoksa göğü yaratmak mı? Ki onu Allah bina edip yükseltmiş ve ona şekil vermiştir.",
            "verse 79:29": "Gecesini karanlık yapmış, gündüzünü aydınlatmıştır.",
            "verse 79:30": "Ardından yeri düzenlemiştir.",
            "verse 79:31": "Suyunu ondan çıkarmış ve otlak yer meydana getirmiştir.",
            "verse 79:32": "Dağları yerleştirmiştir.",
            "verse 79:33": "Bunları sizin ve hayvanlarınızın geçinmesi için yapmıştır.",
            "verse 79:34": "Güç yetirilemeyen en büyük baskın geldiği zaman, o gün, insan ne uğurda çalıştığını anlar.",
            "verse 79:35": "Güç yetirilemeyen en büyük baskın geldiği zaman, o gün, insan ne uğurda çalıştığını anlar.",
            "verse 79:36": "Cehennem her bakanın göreceği şekilde gösterilir.",
            "verse 79:37": "İşte, azıp da dünya hayatını tercih edenin varacağı yer şüphesiz cehennemdir.",
            "verse 79:38": "İşte, azıp da dünya hayatını tercih edenin varacağı yer şüphesiz cehennemdir.",
            "verse 79:39": "İşte, azıp da dünya hayatını tercih edenin varacağı yer şüphesiz cehennemdir.",
            "verse 79:40": "Ama kim Rabbinin azametinden korkup da kendini kötülükten alıkoymuşsa, varacağı yer şüphesiz cennettir.",
            "verse 79:41": "Ama kim Rabbinin azametinden korkup da kendini kötülükten alıkoymuşsa, varacağı yer şüphesiz cennettir.",
            "verse 79:42": "Senden kıyametin ne zaman gelip çatacağını sorarlar.",
            "verse 79:43": "Nerde senden onu anlatması?",
            "verse 79:44": "Onun bilgisi Rabbine aittir.",
            "verse 79:45": "Sen sadece kıyametten korkanı uyaransın.",
            "verse 79:46": "Kıyameti gördükleri gün dünyada ancak bir akşam yahut bir kuşluk vakti kadar kalmış olduklarını sanırlar."
        },
        "Urdu": {
            "verse 79:1": "ان (فرشتوں) کی قسم جو ڈوب کر کھینچ لیتے ہیں",
            "verse 79:2": "اور ان کی جو آسانی سے کھول دیتے ہیں",
            "verse 79:3": "اور ان کی جو تیرتے پھرتے ہیں",
            "verse 79:4": "پھر لپک کر آگے بڑھتے ہیں",
            "verse 79:5": "پھر (دنیا کے) کاموں کا انتظام کرتے ہیں",
            "verse 79:6": "(کہ وہ دن آ کر رہے گا) جس دن زمین کو بھونچال آئے گا",
            "verse 79:7": "پھر اس کے پیچھے اور (بھونچال) آئے گا",
            "verse 79:8": "اس دن (لوگوں) کے دل خائف ہو رہے ہوں گے",
            "verse 79:9": "اور آنکھیں جھکی ہوئی",
            "verse 79:10": "(کافر) کہتے ہیں کیا ہم الٹے پاؤں پھر لوٹ جائیں گے",
            "verse 79:11": "بھلا جب ہم کھوکھلی ہڈیاں ہو جائیں گے (تو پھر زندہ کئے جائیں گے)",
            "verse 79:12": "کہتے ہیں کہ یہ لوٹنا تو (موجب) زیاں ہے",
            "verse 79:13": "وہ تو صرف ایک ڈانٹ ہوگی",
            "verse 79:14": "اس وقت وہ (سب) میدان (حشر) میں آ جمع ہوں گے",
            "verse 79:15": "بھلا تم کو موسیٰ کی حکایت پہنچی ہے",
            "verse 79:16": "جب اُن کے پروردگار نے ان کو پاک میدان (یعنی) طویٰ میں پکارا",
            "verse 79:17": "(اور حکم دیا) کہ فرعون کے پاس جاؤ وہ سرکش ہو رہا ہے",
            "verse 79:18": "اور (اس سے) کہو کہ کیا تو چاہتا ہے کہ پاک ہو جائے؟",
            "verse 79:19": "اور میں تجھے تیرے پروردگار کا رستہ بتاؤں تاکہ تجھ کو خوف (پیدا) ہو",
            "verse 79:20": "غرض انہوں نے اس کو بڑی نشانی دکھائی",
            "verse 79:21": "مگر اس نے جھٹلایا اور نہ مانا",
            "verse 79:22": "پھر لوٹ گیا اور تدبیریں کرنے لگا",
            "verse 79:23": "اور (لوگوں کو) اکٹھا کیا اور پکارا",
            "verse 79:24": "کہنے لگا کہ تمہارا سب سے بڑا مالک میں ہوں",
            "verse 79:25": "تو خدا نے اس کو دنیا اور آخرت (دونوں) کے عذاب میں پکڑ لیا",
            "verse 79:26": "جو شخص (خدا سے) ڈر رکھتا ہے اس کے لیے اس (قصے) میں عبرت ہے",
            "verse 79:27": "بھلا تمہارا بنانا آسان ہے یا آسمان کا؟ اسی نے اس کو بنایا",
            "verse 79:28": "اس کی چھت کو اونچا کیا اور پھر اسے برابر کر دیا",
            "verse 79:29": "اور اسی نے رات کو تاریک بنایا اور (دن کو) دھوپ نکالی",
            "verse 79:30": "اور اس کے بعد زمین کو پھیلا دیا",
            "verse 79:31": "اسی نے اس میں سے اس کا پانی نکالا اور چارا اگایا",
            "verse 79:32": "اور اس پر پہاڑوں کابوجھ رکھ دیا",
            "verse 79:33": "یہ سب کچھ تمہارے اور تمہارے چارپایوں کے فائدے کے لیے (کیا)",
            "verse 79:34": "تو جب بڑی آفت آئے گی",
            "verse 79:35": "اس دن انسان اپنے کاموں کو یاد کرے گا",
            "verse 79:36": "اور دوزخ دیکھنے والے کے سامنے نکال کر رکھ دی جائے گی",
            "verse 79:37": "تو جس نے سرکشی کی",
            "verse 79:38": "اور دنیا کی زندگی کو مقدم سمجھا",
            "verse 79:39": "اس کا ٹھکانہ دوزخ ہے",
            "verse 79:40": "اور جو اپنے پروردگار کے سامنے کھڑے ہونے سے ڈرتا اور جی کو خواہشوں سے روکتا رہا",
            "verse 79:41": "اس کا ٹھکانہ بہشت ہے",
            "verse 79:42": "(اے پیغمبر، لوگ) تم سے قیامت کے بارے میں پوچھتے ہیں کہ اس کا وقوع کب ہو گا؟",
            "verse 79:43": "سو تم اس کے ذکر سے کس فکر میں ہو",
            "verse 79:44": "اس کا منتہا (یعنی واقع ہونے کا وقت) تمہارے پروردگار ہی کو (معلوم ہے)",
            "verse 79:45": "جو شخص اس سے ڈر رکھتا ہے تم تو اسی کو ڈر سنانے والے ہو",
            "verse 79:46": "جب وہ اس کو دیکھیں گے (تو ایسا خیال کریں گے) کہ گویا (دنیا میں صرف) ایک شام یا صبح رہے تھے"
        },
        "Uyghur": {
            "verse 79:1": "(كۇففارلارنىڭ جانلىرىنى) قاتتىق تارتىپ ئالغۇچى پەرىشتىلەر بىلەن قەسەمكى،",
            "verse 79:2": "(مۆمىنلەرنىڭ جانلىرىنى) سىلىق ئالغۇچى پەرىشتىلەر بىلەن قەسەمكى،",
            "verse 79:3": "(اﷲ نىڭ ئەمرىنى ئاسماندىن) تېز ئېلىپ چۈشكۈچى پەرىشتىلەر بىلەن قەسەمكى،",
            "verse 79:4": "(مۆمىنلەرنىڭ جانلىرىنى ئېلىپ جەننەتكە) ئىلگىرلىگۈچى پەرىشتىلەر بىلەن قەسەمكى،",
            "verse 79:5": "(اﷲ نىڭ ئەمرى بىلەن) كائىناتنىڭ ئىشلىرىنى باشقۇرغۇچى پەرىشتىلەر بىلەن قەسەمكى، (سىلەر چوقۇم تىرىلدۈرۈلىسىلەر، سىلەردىن چوقۇم ھېساب ئېلىنىدۇ)",
            "verse 79:6": "بۇ كۈن (يەنى قىيامەت كۈنى) دە زېمىن (ۋە ئۇنىڭدىكى شەيئىلەر قوشۇلۇپ) تەۋرەيدۇ",
            "verse 79:7": "ئۇنىڭ ئارقىسىدىنلا ئاسمان (ۋە ئۇنىڭدىكى شەيئىلەر قوشۇلۇپ) تەۋرەيدۇ",
            "verse 79:8": "بۇ كۈندە دىللارنى (يەنى كۇففارلارنىڭ دىللىرىنى) قورقۇنچ باسىدۇ",
            "verse 79:9": "شۇ (دىللارنىڭ ئىگىلىرىنىڭ) كۆزلىرى (قورقۇنچتىن) تىكىلىپ قارىيالمايدۇ",
            "verse 79:10": "ئۇلار ئېيتىدۇ: «راستلا بىز ئاۋۋالقى ھالىمىزغا قايتۇرۇلامدۇق؟ (يەنى ئۆلگەندىن كېيىن تىرىلەمدۇق؟)",
            "verse 79:11": "ئۇ بىزنىڭ چىرىگەن سۆڭەك بولۇپ قالغان ۋاقتىمىز ئەمەسمۇ؟»",
            "verse 79:12": "ئۇلار ئېيتتى: «ئۇنداق بولىدىغان بولسا، بۇ (يەنى ئۆلگەندىن كېيىن تىرىلىش) زىيانلىق قايتىشتۇر (يەنى بىز ئۆلگەندىن كېيىن تىرىلىدىغان بولساق، دوزاخ ئەھلى بولغانلىقىمىز ئۈچۈن زىيان تارتقۇچىلارمىز)»",
            "verse 79:13": "بىر سەيھە (يەنى ئىسراپىلنىڭ سۇر چېلىشى) بىلەنلا ئۇلار (يەنى جىمى خالايىق) (يەر ئاستىدىن) زېمىننىڭ ئۈستىگە چىقىپ قالىدۇ",
            "verse 79:14": "بىر سەيھە (يەنى ئىسراپىلنىڭ سۇر چېلىشى) بىلەنلا ئۇلار (يەنى جىمى خالايىق) (يەر ئاستىدىن) زېمىننىڭ ئۈستىگە چىقىپ قالىدۇ",
            "verse 79:15": "ساڭا مۇسانىڭ خەۋىرى كەلدىمۇ؟",
            "verse 79:16": "ئۆز ۋاقتىدا ئۇنى پەرۋەردىگارى تۇۋا ناملىق مۇقەددەس ۋادىدا (مۇنداق دەپ) چاقىردى:",
            "verse 79:17": "«سەن پىرئەۋننىڭ قېشىغا بارغىن، ئۇ ھەقىقەتەن ھەددىدىن ئاشتى",
            "verse 79:18": "ئۇنىڭغا: (كۇفرىدىن ۋە گۇناھلاردىن) پاك بولۇشنى خالامسەن",
            "verse 79:19": "سېنى پەرۋەردىگارىمنى تونۇشقا يېتەكلىشىمنى خالامسەن؟ (ئۇنى تونۇساڭ پەرۋەردىگارىڭدىن) قورقىسەن - دە، (ياخشى ئەمەللەرنى قىلىسەن)، دېگىن»",
            "verse 79:20": "مۇسا پىرئەۋنگە چوڭ مۆجىزىنى كۆرسەتتى",
            "verse 79:21": "پىرئەۋن (اﷲ نىڭ پەيغەمبىرى مۇسانى) ئىنكار قىلدى ۋە (اﷲ نىڭ ئەمرىگە) ئاسىيلىق قىلدى",
            "verse 79:22": "ئاندىن پىرئەۋن (مۇسادىن) يۈز ئۆرۈپ (ھىيلە - مىكىر ئىشلىتىشكە) كىرىشتى",
            "verse 79:23": "(ئۇ سېھرىگەرلەرنى، ئەسكەرلىرىنى، تەۋەلىرىنى) توپلىدى ھەم نىدا قىلىپ",
            "verse 79:24": "دېدى: «مەن سىلەرنىڭ بۈيۈك پەرۋەردىگارىڭلار بولىمەن»",
            "verse 79:25": "اﷲ ئۇنى دۇنيا ۋە ئاخىرەتنىڭ ئازابى بىلەن جازالىدى",
            "verse 79:26": "شەك - شۈبھىسىزكى، اﷲ تىن قورقىدىغانلار بۇنىڭدىن ئىبرەت ئالىدۇ",
            "verse 79:27": "سىلەرنى يارىتىش مۈشكۈلمۇ؟ ياكى ئاسماننى يارىتىش مۈشكۈلمۇ؟ اﷲ ئاسماننى ياراتتى",
            "verse 79:28": "ئۇنىڭ ئېگىزلىكىنى يۈكسەك قىلدى ۋە كەم - كۈتىسىز قىلدى",
            "verse 79:29": "ئۇنىڭ كېچىسىنى قاپقاراڭغۇ، كۈندۈزىنى يوپيورۇق قىلدى",
            "verse 79:30": "شۇنىڭدىن كېيىن زېمىننى (ئەھلى زېمىننىڭ تۇرۇشىغا لايىق قىلىپ) يايدى",
            "verse 79:31": "زېمىندىن بۇلاقلارنى ئاقتۇردى، ئۆسۈملۈكلەرنى ئۆستۈردى",
            "verse 79:32": "تاغلارنى (زېمىندا) مۇقىم قىلدى",
            "verse 79:33": "اﷲ تائالا ئۇلارنىڭ ھەممىسىنى سىلەرنىڭ ۋە ھايۋانلىرىڭلارنىڭ پايدىلىنىشى ئۈچۈن (ياراتتى)",
            "verse 79:34": "قىيامەت كەلگەندە،",
            "verse 79:35": "(شۇ) كۈندە ئىنسان (ياخشى - يامان) قىلمىشلىرىنى ئەسلەيدۇ",
            "verse 79:36": "قارىغۇچىلارغا جەھەننەم ئوچۇق كۆرسىتىلىدۇ",
            "verse 79:37": "كىمكى (كۇفرىدا، گۇناھتا) چېكىدىن ئاشىدىكەن،",
            "verse 79:38": "دۇنيا تىرىكچىلىكىنى (ئاخىرەتتىن) ئارتۇق كۆرىدىكەن،",
            "verse 79:39": "ئۇنىڭ جايى ھەقىقەتەن جەھەننەم بولىدۇ",
            "verse 79:40": "پەرۋەردىگارىنىڭ ئالدىدا (سوراققا تارتىلىشتىن) قورقىدىغان، ئۆزىنى نەپسى خاھىشىغا بېرىلىشتىن (يەنى ھارام قىلىنغان نەرسىلەردىن) چەكلىگەن ئادەمگە كەلسەك،",
            "verse 79:41": "ھەقىقەتەن ئۇنىڭ جايى جەننەت بولىدۇ",
            "verse 79:42": "ئۇلار سەندىن قىيامەتنىڭ قاچان بولىدىغانلىقىنى سورايدۇ",
            "verse 79:43": "سەن ئۇنى قانداقمۇ بايان قىلىپ بېرەلەيسەن؟",
            "verse 79:44": "ئۇنى بىلىش پەرۋەردىگارىڭغا خاستۇر",
            "verse 79:45": "سېنىڭ ۋەزىپەڭ پەقەت قىيامەتتىن قورقىدىغان ئادەمنى ئاگاھلاندۇرۇشتۇر",
            "verse 79:46": "ئۇلار قىيامەتنى كۆرگەن كۈندە، گويا ئۆزلىرىنى (دۇنيادا) پەقەت بىر كەچقۇرۇن ياكى بىر ئەتىگەن تۇرغاندەك (گۇمان قىلىدۇ)"
        },
        "Uzbek": {
            "verse 79:1": "Шиддат билан (кофир) жонни суғуриб олувчи(фаришта)лар билан қасам.",
            "verse 79:2": "Юмшоқлик билан (мўмин) жонни олувчи (фаришта)лар билан қасам.",
            "verse 79:3": "Сузиб юрувчи (фаришта)лар билан қасам.",
            "verse 79:4": "Ўзишда мусобақа қилувчи (фаришта)лар билан қасам.",
            "verse 79:5": "Амрнинг тадбирини қилувчи (фаришта)лар билан қасам.",
            "verse 79:6": "Изтиробга тушувчи изтиробга тушган кунда.",
            "verse 79:7": "Унга эргашувчи эргашар.",
            "verse 79:8": "Ўша кунда қалблар хавфга тўлар.",
            "verse 79:9": "Уларнинг кўзлари қўрқинчга тўлар.",
            "verse 79:10": "Улар: «Биз ортга қайтариламизми?",
            "verse 79:11": "Чириган суяк бўлганимиздан кейин ҳам-а?",
            "verse 79:12": "Агар шундоқ бўлса, бу ҳасратий қайтиш-ку?» дерлар.",
            "verse 79:13": "Албатта, у(қиёмат) бир қичқириқдан бошқа нарса эмас.",
            "verse 79:14": "Кўрибсизки, улар қиёмат майдонида турибди-да.",
            "verse 79:15": "Сенга Мусонинг хабари келдими?",
            "verse 79:16": "Қачонки Роббиси унга муқаддас Тува водийсида нидо қилди:",
            "verse 79:17": "«Фиръавн ҳузурига бор, албатта у туғёнга кетди.",
            "verse 79:18": "Бас унга айт: «Сенда покланишга (рағбат) борми?",
            "verse 79:19": "Ва сени Роббингга ҳидоят қилсам, шоядки (Ундан) қўрқсанг», деб»",
            "verse 79:20": "Ва унга улкан аломатни кўрсатди.",
            "verse 79:21": "Ул уни ёлғонга чиқарди ва осий бўлди.",
            "verse 79:22": "Сўнг ортига ўгирилиб тезлаб кетди¬.",
            "verse 79:23": "Кейин (одамларни) тўплаб нидо қилди.",
            "verse 79:24": "Ва, мен сизларнинг энг олий Роббингизман, деди.",
            "verse 79:25": "Бас Аллоҳ уни аввалги ва охирги гуноҳлари учун азобга олди.",
            "verse 79:26": "Албатта, бунда қўрқадиганлар учун ибрат бордир.",
            "verse 79:27": "Сизларни яратиш қийинми ёки У зот бино қилган осмонними?",
            "verse 79:28": "Унинг шифтини юқори кўтарди ва бекаму кўст, мустаҳкам қилиб қўйди.",
            "verse 79:29": "Кечасини қоронғу ва кундузини ёруғ қилди.",
            "verse 79:30": "Ва ундан сўнг ерни тухум шаклида қилди.",
            "verse 79:31": "Ундан сувни, ўт-ўланларни чиқарди.",
            "verse 79:32": "Ва тоғларни собит қилди.",
            "verse 79:33": "Сизларга ва чорваларингизга манфаат бўлсин учун.",
            "verse 79:34": "Вақтики катта ғолиб (қиёмат) келса.",
            "verse 79:35": "У куни инсон қилган ишларини эслайдир.",
            "verse 79:36": "Ва жаҳаннам кўрадиганларга зоҳир қилинадир.",
            "verse 79:37": "Аммо кимики туғёнга кетиб, ҳаддидан ошган бўлса",
            "verse 79:38": "Ва бу дунё ҳаётини устун қўйган бўлса,",
            "verse 79:39": "Бас, албатта, Жаҳийм ўрин бўладир.",
            "verse 79:40": "Ва, аммо ким Роббисининг мақомидан қўрққан ва ўз нафсини ҳаволаниб кетишидан қайтарган бўлса.",
            "verse 79:41": "Бас, албатта, жаннат ўрин бўладир.",
            "verse 79:42": "Сендан, қиёмат қачон бўлур? деб сўрарлар.",
            "verse 79:43": "Унинг зикрини сен қандоқ билардинг.",
            "verse 79:44": "Унинг интиҳоси Роббингга хосдир.",
            "verse 79:45": "Албатта сен ун(қиёмат)дан қўрққанларга огоҳлантирувчисан, холос.",
            "verse 79:46": "Уни кўрган кунлари худди бу дунёда бир кеча ёки кундуздан бошқа турмаганга ўхшарлар."
        },
        "Vietnamese": {
            "verse 79:1": "Thề bởi các Thiên Thần giật mạnh linh hồn của những kẻ vô đức tin.",
            "verse 79:2": "Thề bởi các Thiên Thần rút nhẹ linh hồn của những người có đức tin.",
            "verse 79:3": "Thề bởi các Thiên Thần lướt đi như bơi (từ trên trời xuống đất theo lệnh của Allah).",
            "verse 79:4": "Thề bởi các Thiên Thần luôn nhanh nhẹn và tiên phong (trong việc thực thi mệnh lệnh của Allah).",
            "verse 79:5": "Thề bởi các Thiên Thần thực thi các lệnh truyền.",
            "verse 79:6": "Vào Ngày mà tiếng còi Rajifah được thổi.",
            "verse 79:7": "Tiếp theo là tiếng còi Radifah.",
            "verse 79:8": "Vào Ngày đó, các con tim sẽ đập mạnh.",
            "verse 79:9": "Những cặp mắt sẽ sợ hãi.",
            "verse 79:10": "(Những kẻ không tin) thường bảo: “Chúng ta sẽ thực sự được trở lại trạng thái (cuộc sống) trước đây (của chúng ta) ư?”",
            "verse 79:11": "“Ngay cả khi chúng ta đã là những khúc xương rã mục ư?”",
            "verse 79:12": "Chúng nói: “Nếu vậy thì đó sẽ là một sự trở lại mất mát và thua thiệt!”",
            "verse 79:13": "Quả thật, (lệnh tập trung rất đơn giản), nó chỉ là một tiếng còi hụ duy nhất.",
            "verse 79:14": "Lập tức mọi sự sống sẽ nổi lên trên mặt đất.",
            "verse 79:15": "Ngươi (Thiên Sứ Muhammad) đã nghe câu chuyện về Musa chưa?",
            "verse 79:16": "Lúc Thượng Đế của Y gọi Y nơi thung lũng thiêng liêng của ngọn núi Tuwa.",
            "verse 79:17": "(Ngài phán bảo Y): “Ngươi hãy đi gặp Pha-ra-ông. Hắn quả thật đã quá mức tội lỗi.”",
            "verse 79:18": "“Ngươi hãy nói với hắn: Ngài có muốn được tẩy sạch tội lỗi không?”",
            "verse 79:19": "“Tôi sẽ hướng dẫn ngài đến với Thượng Đế của ngài mong rằng ngài sẽ biết kính sợ.”",
            "verse 79:20": "(Sau đó) Musa đã cho (Pha-ra-ông) xem một phép lạ vĩ đại.",
            "verse 79:21": "Tuy nhiên, (Pha-ra-ông) đã phủ nhận và không theo.",
            "verse 79:22": "Rồi hắn quay mặt bỏ đi và cố tìm cách chống lại.",
            "verse 79:23": "Rồi hắn đã triệu tập dân chúng và tuyên bố.",
            "verse 79:24": "Hắn nói: “Ta chính là Thượng Đế tối cao của các ngươi.”",
            "verse 79:25": "Vì vậy, Allah đã trừng phạt hắn với hình phạt của Đời Sau và đời này.",
            "verse 79:26": "Quả thật, trong câu chuyện đó là một bài học cho ai biết kính sợ (Allah).",
            "verse 79:27": "Việc tạo các ngươi khó hay việc TA đã dựng bầu trời khó hơn?",
            "verse 79:28": "Ngài (Allah) đã nhấc (bầu trời) lên cao và cân đối nó.",
            "verse 79:29": "Ngài đã làm cho ban đêm của nó trở thành tối và làm cho nó sáng trở lại vào ban mai.",
            "verse 79:30": "Sau đó, Ngài đã trải rộng mặt đất bằng phẳng.",
            "verse 79:31": "Từ đất, Ngài đã cho nước phún ra và làm mọc ra những đồng cỏ.",
            "verse 79:32": "Và những quả núi, Ngài đã đặt chúng vững chắc.",
            "verse 79:33": "(Tất cả) đều là nguồn lợi cho các ngươi và gia súc của các ngươi.",
            "verse 79:34": "Nhưng khi đại họa xảy đến.",
            "verse 79:35": "Đó là Ngày mà con người sẽ nhớ lại tất cả những gì mình đã làm (trên thế gian).",
            "verse 79:36": "(Vào Ngày đó), Hỏa Ngục sẽ được phơi bày cho nhìn thấy.",
            "verse 79:37": "Đối với ai vượt quá giới hạn (của Allah).",
            "verse 79:38": "Và yêu thích đời sống trần tục này.",
            "verse 79:39": "Chắc chắn Hỏa Ngục sẽ là nơi trú ngụ.",
            "verse 79:40": "Đối với người kính sợ Thượng Đế của y và luôn ngăn cản bản thân tránh những dục vọng thấp hèn.",
            "verse 79:41": "Chắc chắn Thiên Đàng sẽ là chỗ ở.",
            "verse 79:42": "(Những kẻ phủ nhận Sự Phục Sinh), chúng thường hỏi Ngươi (Thiên Sứ Muhammad) về giờ khắc đó khi nào sẽ xảy đến.",
            "verse 79:43": "Ngươi chẳng cần lo ngại gì để nói về điều đó (bởi Ngươi không hề biết).",
            "verse 79:44": "Chỉ Thượng Đế của Ngươi mới thực sự biết thời hạn của nó.",
            "verse 79:45": "Quả thật, Ngươi chỉ là một người cảnh báo cho những ai có lòng kính sợ.",
            "verse 79:46": "Vào Ngày chúng nhìn thấy nó, chúng sẽ cảm thấy như thể chúng đã ở lại trần gian chỉ trong một buổi chiều hoặc chỉ trong một buổi sáng!"
        },
        "Yoruba": {
            "verse 79:1": "Allahu bura pelu awon molaika t’o n fi ona ele gba emi awon alaigbagbo",
            "verse 79:2": "O tun bura pelu awon molaika t’o n fi ona ero gba emi awon onigbagbo ododo",
            "verse 79:3": "O tun bura pelu awon molaika t’o n yara gaga nibi ase Re",
            "verse 79:4": "O tun bura pelu awon molaika t’o maa siwaju emi awon onigbagbo ododo wonu Ogba Idera taara",
            "verse 79:5": "O tun bura pelu awon molaika t’o n seto ile aye",
            "verse 79:6": "Ni ojo ti ifon akoko fun opin aye maa mi gbogbo aye titi pelu ohun igbe",
            "verse 79:7": "Ifon keji fun Ajinde si maa tele e",
            "verse 79:8": "Awon okan yoo maa gbon pepe ni ojo yen",
            "verse 79:9": "Oju won yo si wale ni ti iyepere",
            "verse 79:10": "Won yoo wi pe: \"Se Won tun maa da wa pada si ibere isemi (bii taye ni)",
            "verse 79:11": "Se nigba ti a ti di eegun t’o kefun tan",
            "verse 79:12": "Won wi pe: \"Idapada ofo niyen nigba naa (fun eni t’o pe e niro)",
            "verse 79:13": "Nitori naa, igbe eyo kan si ni",
            "verse 79:14": "Nigba naa ni won yoo bara won lori ile gbansasa",
            "verse 79:15": "Nje oro (Anabi) Musa ti de odo re",
            "verse 79:16": "(Ranti) nigba ti Oluwa re pe e ni afonifoji mimo, Tuwa",
            "verse 79:17": "Lo ba Fir‘aon, dajudaju o ti tayo enu-ala",
            "verse 79:18": "Ki o si so pe: \"Nje o maa safomo ara re (kuro ninu aigbagbo) bi",
            "verse 79:19": "Ki emi si fi ona mo o de odo Oluwa re. Nitori naa, ki o paya (Re)",
            "verse 79:20": "O si fi ami t’o tobi han an",
            "verse 79:21": "(Amo) o pe e lopuro. O si yapa re",
            "verse 79:22": "Leyin naa, o keyin si i. O si n sise (tako o)",
            "verse 79:23": "O ko (awon eniyan) jo, o si ke gbajari",
            "verse 79:24": "O si wi pe: \"Emi ni oluwa yin, eni giga julo",
            "verse 79:25": "Nitori naa, Allahu gba a mu pelu iya ikeyin ati akoko (nipa oro enu re ikeyin yii ati akoko)",
            "verse 79:26": "Dajudaju ariwoye wa ninu iyen fun eni t’o n paya (Allahu)",
            "verse 79:27": "Se eyin le lagbara julo ni iseda ni tabi sanmo ti Allahu mo",
            "verse 79:28": "Allahu gbe aja re ga soke. O si se e ni pipe t’o gun rege",
            "verse 79:29": "O se oru re ni dudu. O si fa iyaleta re yo jade",
            "verse 79:30": "Ati ile, O te e perese leyin iyen",
            "verse 79:31": "O mu omi re ati irugbin re jade lati inu re",
            "verse 79:32": "Ati awon apata, O fi idi won mule sinsin",
            "verse 79:33": "Igbadun ni fun yin ati fun awon eran-osin yin",
            "verse 79:34": "Sugbon nigba ti iparun nla ba de",
            "verse 79:35": "ni ojo ti eniyan yoo ranti ohun t’o se nise",
            "verse 79:36": "Won si maa fi Ina han kedere fun (gbogbo) eni t’o riran",
            "verse 79:37": "Nitori naa, ni ti eni t’o ba tayo enu-ala",
            "verse 79:38": "ti o tun gbe ajulo fun isemi aye",
            "verse 79:39": "dajudaju ina Jehim, ohun ni ibugbe (re)",
            "verse 79:40": "Ni ti eni ti o ba paya iduro niwaju Oluwa re, ti o tun ko ife-inu fun emi (ara re)",
            "verse 79:41": "dajudaju Ogba Idera, ohun ni ibugbe (re)",
            "verse 79:42": "Won n bi o leere nipa Akoko naa pe: \"Igba wo l’o maa sele",
            "verse 79:43": "Ona wo ni iwo le fi ni (imo) iranti re na",
            "verse 79:44": "Odo Oluwa re ni opin imo nipa re wa",
            "verse 79:45": "Iwo kuku ni olukilo fun eni t’o n paya re",
            "verse 79:46": "Ni ojo ti won maa ri i, won maa da bi eni pe won ko lo tayo irole tabi iyaleta (ojo) kan lo (nile aye)"
        }
    }
}