{
    "id": 83,
    "name_simple": "Al-Mutaffifin",
    "revelation_place": "makkah",
    "revelation_order": 86,
    "bismillah_pre": true,
    "verses_count": 36,
    "short_text": "It is derived from the very first verse; Wayl-ul-lil mutaffifin.",
    "text": [
        "\n",
        "It is derived from the very first verse; Wayl-ul-lil mutaffifin.",
        "\n",
        "Period of Revelation",
        "\n",
        "The style of the Surah and its subject matter clearly show that it was revealed in the earliest stage at Makkah, when surah after surah was being revealed to impress the doctrine of the Hereafter on the people's minds. This Surah was revealed when they had started ridiculing the Muslims and disgracing them publicly in the streets and in their assemblies, but persecution and manhandling of the Muslims had not yet started. Some commentators regard this as a Madani Surah. This misunderstanding has been caused by a tradition from Ibn Abbas according to which when the Holy Prophet (upon whom be peace) arrived in Madinah, the evil of giving short weight and measure was widespread among the people there. Then Allah sent down Wayl ul-lil mutaffifin and the people began to give full weight and measure. (Nasa'i, Ibn Majah, Ibn Marduyah, Ibn Jarir, Baihaqi: Shu\\`ab-il-Iman) But, as we have explained in the introduction to Surah Ad-Dahr, the common practice with the\r\nCompanions and their successors was that when they found that a verse applied to a certain matter of life, they would say that it had been sent down concerning that particular matter. Therefore, what is proved by the tradition of Ibn Abbas is that when after his emigration to Madinah the Holy Prophet (upon whom be peace) saw that the evil was widespread among the people there, he recited this Surah before them by Allah's Command and this helped them mend their ways.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of this Surah too is the Hereafter. In the first six verses the people have been taken to task for the prevalent evil practice in their commercial dealings. When they had to receive their due from others, they demanded that it be given in full, but when they had to measure or weigh for others, they would give less than what was due. Taking this one evil as an example out of countless evils prevalent in society, it has been said that it is an inevitable result of the heedlessness of the Hereafter. Unless the people realized that one day they would have to appear before God and account for each single act they performed in the world, it was not possible that they would adopt piety and righteousness in their daily affairs. Even if a person might practice honesty in some of his less important dealings in view of \"honesty is the best policy,\" he would never practice honesty on occasions when dishonesty would seem to be \"the best policy\". Man can develop true and enduring\r\nhonesty only when he fears God and sincerely believes in the Hereafter, for then he would regard honesty not merely as \"a policy\" but as \"a duty\" and obligation, and his being constant in it, or otherwise, would not be dependent on its being useful or useless in the world.",
        "\n",
        "Thus, after making explicit the relation between morality and the doctrine of the Hereafter in an effective and impressive way, in vv. 7-17, it has been said: The deeds of the wicked are already being recorded in the black list of the culprits, and in the Hereafter they will meet with utter ruin. Then in vv. 18-28, the best end of the virtuous has been described and it has been laid that their deeds are being recorded in the list of the exalted people, on which are appointed the angels nearest to Allah.",
        "\n",
        "In conclusion, the believers have been consoled, and the disbelievers warned, as if to say: \"The people who are disgracing and humiliating the believers today, are culprits who, on the Resurrection Day, will meet with a most evil end in consequence of their conduct, and these very believers will feel comforted when they see their fate.\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with a dire divine warning of a debasing punishment awaiting in the Hereafter for those who practice cheating as a norm in commerce, and whom is calls The Defrauders because they insist on receiving a full amount in return for the partial measure that they themselves give. It takes its name from verse 1, which condemns the tradesmen who cheat customers by using short weights and measures (muṭaifūn). It appears that the practice of cheating have been prevalent in Mecca, and is strongly condemned here and elsewhere in the Quran (e.g. 11: 84 .; 7: 85).The surah is also known as: The Cheats, The Dealing in Fraud, The Defrauders, The Stinters, The Unjust, Those who Give Short Measure.",
    "name_translation": "The Defrauders",
    "name_complex": "Al-Mutaffifîn",
    "surah_name_ar": "المطففين",
    "verses": {
        "Albanian": {
            "verse 83:1": "Mjer për ata që kur masin – mungojnë,",
            "verse 83:2": "të cilët e marrin masën e plotë kur është e marrin vetveten,",
            "verse 83:3": "e, kur t’iu masin të tjerëve me litër ose me kandar – ju pakësojnë.",
            "verse 83:4": "A nuk mendojnë ata se do të ringjallen",
            "verse 83:5": "në një Ditë të madhe (të Kijametit),",
            "verse 83:6": "atë Ditë kur njerëzit do të dalin para Zotit të gjithësisë!",
            "verse 83:7": "Po, po, me të vërtetë, Libri i mëkatarëve është në Sixh-xhin,",
            "verse 83:8": "e, ata e di ti se ç’është Sixh-xhin?",
            "verse 83:9": "(Ai është) Libri i shkruar!",
            "verse 83:10": "Mjer atë ditë për përgënjeshtarët,",
            "verse 83:11": "që kanë mohuar Ditën e Kijametit –",
            "verse 83:12": "e atë, e mohon vetëm kundërvajtësi, mëkatari (i madh),",
            "verse 83:13": "i cili, kur i janë lexuar ajetet Tona, ka thënë: “Trillime të popujve të lashtë!”",
            "verse 83:14": "E, nuk është ashtu! Por, veprat e tyre (të këqia) i kanë ndryshkur zemrat e tyre (i kanë nxirë).",
            "verse 83:15": "Jo, jo, atë ditë, me të vërtetë, ata do të jenë të penguar që ta shohin Zotin e tyre,",
            "verse 83:16": "pastaj, me siguri, do të hyjnë në skëterrë,",
            "verse 83:17": "e do t’ju thuhet (nga engjëjt e skëterrës): “Qe, kjo është ajo që e keni mohuar!”",
            "verse 83:18": "Po, po, me të vërtetë, Libri i të ndershmëve është në Il-lijjin,",
            "verse 83:19": "E, a e di ti se ç’është Il-lijjin?",
            "verse 83:20": "Ai është Libri i shkruar",
            "verse 83:21": "që e dëshmojnë të afërmit (engjëjt) e Perëndisë.",
            "verse 83:22": "Me të vërtetë, të mirët (njerëz) do të gjenden në xhennet,",
            "verse 83:23": "e nga divanet – kanapet do të shikojnë,",
            "verse 83:24": "në fytyrat e tyre do të njohësh freskinë e begative,",
            "verse 83:25": "atyre do t’u jepet të pinë nga pijet e mbyllura (të ruajtura),",
            "verse 83:26": "vula e të cilave është misk (parfem), - dhe për këtë, le të bëjnë gara garuesit! –",
            "verse 83:27": "(pija) do të jetë e përzier me ujin e Tesnimit,",
            "verse 83:28": "nga burimi i të cilit do të pinë të afërmit e Perëndisë (të mirët).",
            "verse 83:29": "Me të vërtetë, mëkatarët qeshnin (në jetën e kësaj bote), me ata që besonin;",
            "verse 83:30": "kur kalonin pranë tyre, njëri-tjetrit ia bënin me sy,",
            "verse 83:31": "e kur ktheheshin te familjet e tyre, ata argëtoheshin në formë tallëse (me besimtarët);",
            "verse 83:32": "ata (mëkatarët), kur i shihnin (besimtarët), thonin: “Këta, me të vërtetë, janë të humbur”, -",
            "verse 83:33": "e, ata nuk janë dërguar për kujdestarë të tyre (besimtarëve).",
            "verse 83:34": "Sot, ata që kanë besuar, do t’i përqeshin mohuesit,",
            "verse 83:35": "e, nga divanet (kanapet) do të shikojnë",
            "verse 83:36": "a janë shpërblyer meritueshëm mohuesit, për veprat që kanë punuar?! (Po)."
        },
        "Amharic": {
            "verse 83:1": "ለሰላቢዎች ወዮላቸው፡፡",
            "verse 83:2": "ለእነዚያ ከሰዎች ባስሰፈሩ ጊዜ የሚያስሞሉ፡፡",
            "verse 83:3": "ለእነርሱም (ለሰዎቹ) በሰፈሩ ወይም በመዘኑላቸው ጊዜ የሚያጎድሉ (ለኾኑት)፡፡",
            "verse 83:4": "እነዚያ እነርሱ ተቀስቃሾች መኾናቸውን አያውቁምን?",
            "verse 83:5": "በታላቁ ቀን፡፡",
            "verse 83:6": "ሰዎች ሁሉ ለዓለማት ጌታ (ፍርድ)፤ በሚቆሙበት ቀን (ተቀስቃሾች መኾናቸውን)፡፡",
            "verse 83:7": "በእውነት የከሓዲዎቹ (የሰላቢዎቹ) መጽሐፍ በእርግጥ በሲጂን ውስጥ ነው፡፡",
            "verse 83:8": "ሲጂንም ምን እንደ ኾነ ምን አሳወቀህ?",
            "verse 83:9": "የታተመ መጽሐፍ ነው፡፡",
            "verse 83:10": "ለአስተባባዮች በዚያ ቀን ወዮላቸው፡፡",
            "verse 83:11": "ለእነዚያ በፍርዱ ቀን ለሚያስተባብሉት፡፡",
            "verse 83:12": "በእርሱም ወሰን አላፊ ኀጢአተኛ ሁሉ እንጅ ሌላ አያስተባብልም፡፡",
            "verse 83:13": "አንቀጾቻችን በእርሱ ላይ በተነበቡ ጊዜ «የመጀመሪያዎቹ ሰዎች ተረቶች ናቸው» ይላል፡፡",
            "verse 83:14": "ይከልከል፤ ይልቁንም በልቦቻቸው ላይ ይሠሩት የነበሩት (ኀጢአት) ደገደገባቸው፡፡",
            "verse 83:15": "ይከልከሉ፤ እነርሱ በዚያ ቀን ከጌታቸው (ማየት) ተጋራጆች ናቸው፡፡",
            "verse 83:16": "ከዚያም እነርሱ በእርግጥ ገሀነምን ገቢዎች ናቸው፡፡",
            "verse 83:17": "ከዚያም «ይህ ያ በእርሱ ታስተባብሉበት የነበራችሁት ነው» ይባላሉ፡፡",
            "verse 83:18": "በእውነቱ የእውነተኞቹ ምእምናን መጽሐፍ በዒሊዮን ውስጥ ነው፡፡",
            "verse 83:19": "ዒሊዮንም ምን እንደ ኾነ ምን አሳወቀህ?",
            "verse 83:20": "የታተመ መጽሐፍ ነው፡፡",
            "verse 83:21": "ባለሟልዎቹ ይጣዱታል፡፡",
            "verse 83:22": "እውነተኞቹ ምእምናን በእርግጥ በድሎት (ገነት) ውስጥ ናቸው፡፡",
            "verse 83:23": "በባለ አጎበር አልጋዎች ላይ ኾነው ይመለከታሉ፡፡",
            "verse 83:24": "በፊቶቻቸው ላይ የድሎትን ውበት ታውቃለህ፡፡",
            "verse 83:25": "ተጣርቶ ከታተመ ጠጅ ይጠጣሉ፡፡",
            "verse 83:26": "ማተሚያው ምስክ ከኾነ፤ በዚህም ተሽቀዳዳሚዎች ይሽቀዳደሙ፡፡",
            "verse 83:27": "መበረዣውም ከተስኒም ነው፡፡",
            "verse 83:28": "ባለሟሎቹ ከእርሷ የሚጠጡላት ምንጭ ናት፡፡",
            "verse 83:29": "እነዚያ ያምመጹት በእነዚያ ባመኑት በእርግጥ ይስቁ ነበሩ፡፡",
            "verse 83:30": "በእነርሱም ላይ ባለፉ ጊዜ ይጠቃቀሱ ነበር፡፡",
            "verse 83:31": "ወደ ቤተሰቦቻቸውም በተመለሱ ጊዜ (በመሳለቃቸው) ተደሳቾች ኾነው ይመለሱ ነበር፡፡",
            "verse 83:32": "ባዩዋቸውም ጊዜ «እነዚህ በእርግጥ ተሳሳቾች ናቸው» ይሉ ነበር፡፡",
            "verse 83:33": "በነርሱ ላይ ተጠባባቂዎች ተደርገው ያልተላኩ ሲኾኑ፡፡",
            "verse 83:34": "ዛሬ (በትንሣኤ ቀን) እነዚያ ያመኑት በከሓዲዎቹ ይስቃሉ፡፡",
            "verse 83:35": "በባለ አጎበር አልጋዎች ላይ ኾነው የሚመለከቱ ሲኾኑ (ይስቃሉ)፡፡",
            "verse 83:36": "ከሓዲዎች ይሠሩት የነበሩትን (ዋጋ) ተመነዱን? (ይላሉ)፡፡"
        },
        "Arabic": {
            "verse 83:1": "َنيِفِّفَطُمْلِّل ٌلْيَو",
            "verse 83:2": "َنوُفْوَتْسَي ِساَّنلا ىَلَع اوُلاَتْكا اَذِإ َنيِذَّلا",
            "verse 83:3": "َنوُرِسْخُي ْمُهوُنَزَّو وَأ ْمُهوُلاَك اَذِإَو",
            "verse 83:4": "َنوُثوُعْبَّم مُهَّنَأ َكِئَٰلوُأ ُّنُظَي اَلَأ",
            "verse 83:5": "ٍميِظَع ٍمْوَيِل",
            "verse 83:6": "َنيِمَلاَعْلا ِّبَرِل ُساَّنلا ُموُقَي َمْوَي",
            "verse 83:7": "ٍنيِّجِس يِفَل ِراَّجُفْلا َباَتِك َّنِإ اَّلَك",
            "verse 83:8": "ٌنيِّجِس اَم َكاَرْدَأ اَمَو",
            "verse 83:9": "ٌموُقْرَّم ٌباَتِك",
            "verse 83:10": "(َنيِبِّذَكُمْلِّل ٍذِئَمْوَي ٌلْيَو",
            "verse 83:11": "(ِنيِّدلا ِمْوَيِب َنوُبِّذَكُي َنيِذَّلا",
            "verse 83:12": "(ٍميِثَأ ٍدَتْعُم ُّلُك اَّلِإ ِهِب ُبِّذَكُي اَمَو",
            "verse 83:13": "(َنيِلَّوَأْلا ُريِطاَسَأ َلاَق اَنُتاَيآ ِهْيَلَع ٰىَلْتُت اَذِإ",
            "verse 83:14": "(َنوُبِسْكَي اوُناَك اَّم مِهِبوُلُق ٰىَلَع َناَر ۜ ْلَب ۖ اَّلَك",
            "verse 83:15": "(َنوُبوُجْحَمَّل ٍذِئَمْوَي ْمِهِّبَّر نَع ْمُهَّنِإ اَّلَك",
            "verse 83:16": "(ِميِحَجْلا وُلاَصَل ْمُهَّنِإ َّمُث",
            "verse 83:17": "(َنوُبِّذَكُت ِهِب مُتنُك يِذَّلا اَذَٰه ُلاَقُي َّمُث",
            "verse 83:18": "(َنيِّيِّلِع يِفَل ِراَرْبَأْلا َباَتِك َّنِإ اَّلَك",
            "verse 83:19": "(َنوُّيِّلِع اَم َكاَرْدَأ اَمَو",
            "verse 83:20": "(ٌموُقْرَّم ٌباَتِك",
            "verse 83:21": "(َنوُبَّرَقُمْلا ُهُدَهْشَي",
            "verse 83:22": "(ٍميِعَن يِفَل َراَرْبَأْلا َّنِإ",
            "verse 83:23": "(َنوُرُظنَي ِكِئاَرَأْلا ىَلَع",
            "verse 83:24": "(ِميِعَّنلا َةَرْضَن ْمِهِهوُجُو يِف ُفِرْعَت",
            "verse 83:25": "(ٍموُتْخَّم ٍقيِحَّر نِم َنْوَقْسُي",
            "verse 83:26": "(َنوُسِفاَنَتُمْلا ِسَفاَنَتَيْلَف َكِلَٰذ يِفَو ۚ ٌكْسِم ُهُماَتِخ",
            "verse 83:27": "(ٍميِنْسَت نِم ُهُجاَزِمَو",
            "verse 83:28": "(َنوُبَّرَقُمْلا اَهِب ُبَرْشَي اًنْيَع",
            "verse 83:29": "(َنوُكَحْضَي اوُنَمآ َنيِذَّلا َنِم اوُناَك اوُمَرْجَأ َنيِذَّلا َّنِإ",
            "verse 83:30": "(َنوُزَماَغَتَي ْمِهِب اوُّرَم اَذِإَو",
            "verse 83:31": "(َنيِهِكَف اوُبَلَقنا ُمِهِلْهَأ ٰىَلِإ اوُبَلَقنا اَذِإَو",
            "verse 83:32": "(َنوُّلاَضَل ِءاَلُؤَٰه َّنِإ اوُلاَق ْمُهْوَأَر اَذِإَو",
            "verse 83:33": "(َنيِظِفاَح ْمِهْيَلَع اوُلِسْرُأ اَمَو",
            "verse 83:34": "(َنوُكَحْضَي ِراَّفُكْلا َنِم اوُنَمآ َنيِذَّلا َمْوَيْلاَف",
            "verse 83:35": "(َنوُرُظنَي ِكِئاَرَأْلا ىَلَع",
            "verse 83:36": "(َنوُلَعْفَي اوُناَك اَم ُراَّفُكْلا َبِّوُث ْلَه"
        },
        "Azerbaijani": {
            "verse 83:1": "Çəkidə və ölçüdə aldadanların vay halına!",
            "verse 83:2": "O kəslərin ki, camaatdan bir şey aldıqda onu tam almaq istəyərlər,",
            "verse 83:3": "onlar üçün bir şey ölçdükdə və ya çəkdikdə onu ziyana salarlar.",
            "verse 83:4": "Onlar dirildiləcəklərini fikirləşmirlərmi?",
            "verse 83:5": "Həm də əzəmətli bir gündə.",
            "verse 83:6": "O gündə ki, insanlar aləmlərin Rəbbinin qarşısında dayanacaqlar.",
            "verse 83:7": "Xeyr! Həqiqətən, günahkarların kitabı Siccindədir.",
            "verse 83:8": "Sən haradan biləsən ki, Siccin nədir?!",
            "verse 83:9": "O, yazılı bir kitabdır!",
            "verse 83:10": "O gün haqqı yalan hesab edənlərin vay halına!",
            "verse 83:11": "O kəslərin ki, Haqq-hesab gününü yalan hesab edirlər.",
            "verse 83:12": "Amma bunu, həddini aşan günahkardan başqa, heç kəs yalan hesab etməz.",
            "verse 83:13": "Ayələrimiz ona oxunduğu zaman: “Bu, keçmişdəkilərin uydurduğu əfsanələrdir!”– deyir.",
            "verse 83:14": "Xeyr! Onların qəlbini qazandıqları günahlar bürümüşdür.",
            "verse 83:15": "Xeyr, həmin gün onlarla Rəbbi arasına pərdə çəkiləcək!",
            "verse 83:16": "Sonra onlar Cəhənnəmə girəcəklər",
            "verse 83:17": "və onlara deyiləcək: “Budur sizin yalan hesab etdiyiniz Cəhənnəm!”",
            "verse 83:18": "Xeyr! Həqiqətən, itaətkarların kitabı İlliyyundadir!",
            "verse 83:19": "Sən haradan biləsən ki, İlliyyun nədir?!",
            "verse 83:20": "O, elə bir yazılı kitabdır ki,",
            "verse 83:21": "onu yalnız Allaha yaxın olanlar görürlər!",
            "verse 83:22": "Həqiqətən, itaətkarlar nemətlər içində olacaqlar.",
            "verse 83:23": "Onlar taxtlar üstündə seyrə dalacaqlar.",
            "verse 83:24": "Sən onların çöhrəsində səadət parlaqlığı görəcəksən.",
            "verse 83:25": "Onlara möhürlü şərabdan içirdiləcəkdir.",
            "verse 83:26": "Onun möhürü müşkdür. Qoy çalışanlar onun üçün səy göstərsinlər!",
            "verse 83:27": "Onun qatışığı isə təsnim bulağındandır.",
            "verse 83:28": "O təsnim elə bir bulaqdır ki, ondan Allaha yaxın olanlar içərlər.",
            "verse 83:29": "Doğrudan da, günah edənlər iman gətirənlərə gülürdülər,",
            "verse 83:30": "onların yanından keçdikdə bir-birinə qaş-göz edirdilər,",
            "verse 83:31": "öz ailələrinin yanına fərəhlə qayıdırdılar,",
            "verse 83:32": "möminləri gördükdə isə deyirdilər: “Həqiqətən, bunlar azmışlardır!”",
            "verse 83:33": "Halbuki bu günahkarlar onlara gözətçi qoyulmamışdılar.",
            "verse 83:34": "Bu gün məhz iman gətirənlər kafirlərə güləcəklər.",
            "verse 83:35": "Onlar taxtlar üstündə ətrafa baxacaqlar.",
            "verse 83:36": "Kafirlər törətdiklərinin cəzasını aldılarmı?!"
        },
        "Bengali": {
            "verse 83:1": "যারা মাপে কম করে, তাদের জন্যে দুর্ভোগ,",
            "verse 83:2": "যারা লোকের কাছ থেকে যখন মেপে নেয়, তখন পূর্ণ মাত্রায় নেয়",
            "verse 83:3": "এবং যখন লোকদেরকে মেপে দেয় কিংবা ওজন করে দেয়, তখন কম করে দেয়।",
            "verse 83:4": "তারা কি চিন্তা করে না যে, তারা পুনরুত্থিত হবে।",
            "verse 83:5": "সেই মহাদিবসে,",
            "verse 83:6": "যেদিন মানুষ দাঁড়াবে বিশ্ব পালনকর্তার সামনে।",
            "verse 83:7": "এটা কিছুতেই উচিত নয়, নিশ্চয় পাপাচারীদের আমলনামা সিজ্জীনে আছে।",
            "verse 83:8": "আপনি জানেন, সিজ্জীন কি?",
            "verse 83:9": "এটা লিপিবদ্ধ খাতা।",
            "verse 83:10": "সেদিন দুর্ভোগ মিথ্যারোপকারীদের,",
            "verse 83:11": "যারা প্রতিফল দিবসকে মিথ্যারোপ করে।",
            "verse 83:12": "প্রত্যেক সীমালংঘনকারী পাপিষ্ঠই কেবল একে মিথ্যারোপ করে।",
            "verse 83:13": "তার কাছে আমার আয়াতসমূহ পাঠ করা হলে সে বলে, পুরাকালের উপকথা।",
            "verse 83:14": "কখনও না, বরং তারা যা করে, তাই তাদের হৃদয় মরিচা ধরিয়ে দিয়েছে।",
            "verse 83:15": "কখনও না, তারা সেদিন তাদের পালনকর্তার থেকে পর্দার অন্তরালে থাকবে।",
            "verse 83:16": "অতঃপর তারা জাহান্নামে প্রবেশ করবে।",
            "verse 83:17": "এরপর বলা হবে, একেই তো তোমরা মিথ্যারোপ করতে।",
            "verse 83:18": "কখনও না, নিশ্চয় সৎলোকদের আমলনামা আছে ইল্লিয়্যীনে।",
            "verse 83:19": "আপনি জানেন ইল্লিয়্যীন কি?",
            "verse 83:20": "এটা লিপিবদ্ধ খাতা।",
            "verse 83:21": "আল্লাহর নৈকট্যপ্রাপ্ত ফেরেশতাগণ একে প্রত্যক্ষ করে।",
            "verse 83:22": "নিশ্চয় সৎলোকগণ থাকবে পরম আরামে,",
            "verse 83:23": "সিংহাসনে বসে অবলোকন করবে।",
            "verse 83:24": "আপনি তাদের মুখমন্ডলে স্বাচ্ছন্দ্যের সজীবতা দেখতে পাবেন।",
            "verse 83:25": "তাদেরকে মোহর করা বিশুদ্ধ পানীয় পান করানো হবে।",
            "verse 83:26": "তার মোহর হবে কস্তুরী। এ বিষয়ে প্রতিযোগীদের প্রতিযোগিতা করা উচিত।",
            "verse 83:27": "তার মিশ্রণ হবে তসনীমের পানি।",
            "verse 83:28": "এটা একটা ঝরণা, যার পানি পান করবে নৈকট্যশীলগণ।",
            "verse 83:29": "যারা অপরাধী, তারা বিশ্বাসীদেরকে উপহাস করত।",
            "verse 83:30": "এবং তারা যখন তাদের কাছ দিয়ে গমন করত তখন পরস্পরে চোখ টিপে ইশারা করত।",
            "verse 83:31": "তারা যখন তাদের পরিবার-পরিজনের কাছে ফিরত, তখনও হাসাহাসি করে ফিরত।",
            "verse 83:32": "আর যখন তারা বিশ্বাসীদেরকে দেখত, তখন বলত, নিশ্চয় এরা বিভ্রান্ত।",
            "verse 83:33": "অথচ তারা বিশ্বাসীদের তত্ত্বাবধায়করূপে প্রেরিত হয়নি।",
            "verse 83:34": "আজ যারা বিশ্বাসী, তারা কাফেরদেরকে উপহাস করছে।",
            "verse 83:35": "সিংহাসনে বসে, তাদেরকে অবলোকন করছে,",
            "verse 83:36": "কাফেররা যা করত, তার প্রতিফল পেয়েছে তো?"
        },
        "Berber Amazigh": {
            "verse 83:1": "Imed$al, a nnegr nnsen!",
            "verse 83:2": "Wid, mara d ktilen ar medden, pêeppimen taceôt.",
            "verse 83:3": "Wanag, nitni, mara ktilen ne$ wezznen, ssenqasen.",
            "verse 83:4": "Wigi, day ur uminen ar aten id ssekren",
            "verse 83:5": "ass ameqwôaêan?",
            "verse 83:6": "Ass ideg ara bedden medden, zdat Mass imavalen.",
            "verse 83:7": "Xaîi! War ccekk, imcumen, di Siooin ara ppujerrden.",
            "verse 83:8": "Siooin, w ara k t imlen?",
            "verse 83:9": "D tazmamt ipwanesxen.",
            "verse 83:10": "Assen, a nnegr inekkaôen!",
            "verse 83:11": "Wid iskiddiben ass iqeîîiyen.",
            "verse 83:12": "I t inekkôen, siwa amâaûi amednub.",
            "verse 83:13": "Isekniyen nne£, ma $ôan as ten, yini: \"d tiêkayin imezwura\".",
            "verse 83:14": "Xaîi! Maca dubben wulawen nnsen seg wayen kesben.",
            "verse 83:15": "Xaîi! Assen, war ccekk, ad êêurrmen i Mass nnsen.",
            "verse 83:16": "Sinna, deg u$ud ara ô$en.",
            "verse 83:17": "Sinna, ad pwanecden: \"atan wacu tnekkôem\".",
            "verse 83:18": "Xaîi! S tidep, ar di Âiliyun, ayen ippujerden i iâaôviyen.",
            "verse 83:19": "Âiliyun, anwa ara k t imlen?",
            "verse 83:20": "D tazmamt ipwanesxen.",
            "verse 83:21": "Inagan is d iqôiben.",
            "verse 83:22": "Di ssaâd ara ilin, war ccekk, iâaôviyen!",
            "verse 83:23": "F imîeôêen, ssikiden.",
            "verse 83:24": "A pwaliv deg udmawen nnsen, ticci isaâdiyen.",
            "verse 83:25": "Tissit nnsen d lfayeq ipwacemâen;",
            "verse 83:26": "cmaâ ines d lmesk, f ayagi ad mêizwiren wid ippemêizwiren.",
            "verse 83:27": "Aman n Tasmin, ad as xelîen.",
            "verse 83:28": "D tala ideg tessen iqôiben.",
            "verse 83:29": "Ih, wid ibe$wven llan ppavûan deg wid iumnen.",
            "verse 83:30": "Ppem$emmazen mara ten mmagren.",
            "verse 83:31": "Mi zzin ar twaculin nnsen, tezzin, ppuraren.",
            "verse 83:32": "Mara ten walin, ad inin: \"s tidep, wigi nnetlafen\".",
            "verse 83:33": "Ur d pwaznen ara $uôsen, a ten âassen!",
            "verse 83:34": "Assa, d wid iumnen i ippavûan deg ijehliyen.",
            "verse 83:35": "£ef imîeôêen, ssikiden",
            "verse 83:36": "ma $elten ijehliyen, tirect igiten nnsen."
        },
        "Bosnian": {
            "verse 83:1": "Teško onima koji pri mjerenju zakidaju,",
            "verse 83:2": "koji punu mjeru uzimaju kada od drugih kupuju,",
            "verse 83:3": "a kada drugima mjere na litar ili na kantar – zakidaju.",
            "verse 83:4": "Kako ne pomisle da će oživljeni biti",
            "verse 83:5": "na Dan veliki,",
            "verse 83:6": "na Dan kada će se ljudi zbog Gospodara svjetova dići!",
            "verse 83:7": "Uistinu! Knjiga grješnika je u Sidždžinu,",
            "verse 83:8": "a znaš li ti šta je Sidždžin?",
            "verse 83:9": "Knjiga ispisana!",
            "verse 83:10": "Teško toga dana onima koji su poricali –",
            "verse 83:11": "koji su onaj svijet poricali –",
            "verse 83:12": "a njega može poricati samo prijestupnik, grješnik,",
            "verse 83:13": "koji je, kada su mu ajeti Naši kazivani, govorio: \"Izmišljotine naroda drevnih!\"",
            "verse 83:14": "A nije tako! Ono što su radili prekrilo je srca njihova,",
            "verse 83:15": "uistinu, oni će toga dana od milosti Gospodara svoga zaklonjeni biti,",
            "verse 83:16": "zatim će, sigurno, u oganj ući,",
            "verse 83:17": "pa će im se reći: \"Eto, to je ono što ste poricali!\"",
            "verse 83:18": "Uistinu! Knjiga čestitih je u Illijjunu,",
            "verse 83:19": "a znaš li ti šta je Illijjun?",
            "verse 83:20": "Knjiga ispisana! –",
            "verse 83:21": "nad njom bdiju oni Allahu bliski.",
            "verse 83:22": "Dobri će, zaista, u nasladama boraviti,",
            "verse 83:23": "sa divana gledati,",
            "verse 83:24": "na licima njihovim prepoznaćeš radost sretna života,",
            "verse 83:25": "daće im se pa će piće zapečaćeno piti,",
            "verse 83:26": "čiji će pečat mošus biti – i neka se za to natječu oni koji se hoće natjecati! –",
            "verse 83:27": "pomiješano sa vodom iz Tesnima će biti,",
            "verse 83:28": "sa izvora iz kojeg će Allahu bliski piti.",
            "verse 83:29": "Grješnici se smiju onima koji vjeruju;",
            "verse 83:30": "kada pored njih prolaze, jedni drugima namiguju,",
            "verse 83:31": "a kada se porodicama svojim vraćaju, šale zbijajući vraćaju se;",
            "verse 83:32": "kada ih vide, onda govore: \"Ovi su, doista, zalutali!\" –",
            "verse 83:33": "a oni nisu poslani da motre na njih.",
            "verse 83:34": "Danas će oni koji su vjerovali – nevjernicima se podsmijavati,",
            "verse 83:35": "sa divana će gledati.",
            "verse 83:36": "Zar će nevjernici biti drugačije kažnjeni nego prema onome kako su postupali!"
        },
        "Bulgarian": {
            "verse 83:1": "Горко на ощетяващите,",
            "verse 83:2": "които щом взимат от хората, изпълват мярката,",
            "verse 83:3": "а щом им отмерват или им претеглят, причиняват загуба!",
            "verse 83:4": "Не допускат ли тези, че ще бъдат възкресени",
            "verse 83:5": "за великия Ден -",
            "verse 83:6": "Деня, в който хората ще застанат пред Господа на световете?",
            "verse 83:7": "Не! Книгата [за делата] на разпътниците е в Сиджжин.",
            "verse 83:8": "Но откъде да знаеш ти какво е Сиджжин?",
            "verse 83:9": "Книга ясно записана.",
            "verse 83:10": "Горко в този Ден за отричащите,",
            "verse 83:11": "които взимат за лъжа Съдния ден!",
            "verse 83:12": "Взима го за лъжа само всеки престъпник, грешник.",
            "verse 83:13": "Когато му четат Нашите знамения, казва: “Легенди на предците!”",
            "verse 83:14": "Ала не! Сърцата им с ръжда покрива онова, което са придобили.",
            "verse 83:15": "Ала не! Тогава не ще бъдат допуснати до своя Господ.",
            "verse 83:16": "После ще горят в Ада.",
            "verse 83:17": "После ще се каже: “Това е, което отричахте!”",
            "verse 83:18": "Ала не! Книгата [за делата] на праведниците е в Иллийун.",
            "verse 83:19": "Но откъде да знаеш ти какво е Иллийун?",
            "verse 83:20": "Книга ясно записана.",
            "verse 83:21": "Свидетелстват за нея приближените.",
            "verse 83:22": "Праведниците са в блаженство,",
            "verse 83:23": "от престоли гледат [към техния Господ].",
            "verse 83:24": "Ще узнаеш по лицата им сиянието на блаженството.",
            "verse 83:25": "Ще им се поднесе запечатано, пребистро питие.",
            "verse 83:26": "Дори утайката му е като [ухание на] мускус. Нека за това се надпреварват надпреварващите се!",
            "verse 83:27": "Сместа му е от Тасним -",
            "verse 83:28": "извор, от който пият приближените.",
            "verse 83:29": "Онези, които престъпиха, се смееха на онези, които повярваха.",
            "verse 83:30": "И когато минаваха край тях, си смигваха.",
            "verse 83:31": "И когато се завръщаха при своите хора, те се завръщаха развеселени.",
            "verse 83:32": "И когато ги виждаха, казваха: “Тези са заблудени.”",
            "verse 83:33": "А те не бяха пратени за техни надзиратели.",
            "verse 83:34": "Но в този Ден вярващите се смеят на неверниците.",
            "verse 83:35": "От престоли гледат.",
            "verse 83:36": "Не се ли въздаде на неверниците за онова, което са вършили?"
        },
        "Chinese": {
            "verse 83:1": "伤哉！称量不公的人们。",
            "verse 83:2": "当他们从别人称量进来的时候，他们称量得很充足；",
            "verse 83:3": "当他们量给别人或称给别人的时候，他们不称足不量足。",
            "verse 83:4": "难道他们不信自己将复活，",
            "verse 83:5": "在一个重大的日子吗？",
            "verse 83:6": "在那日，人们将为全世界的主而起立。",
            "verse 83:7": "绝不然，恶人们的纪录，将在一本恶行簿中。",
            "verse 83:8": "你怎能知道恶行簿是什麽？",
            "verse 83:9": "是一本封存的簿子。",
            "verse 83:10": "在那日，伤哉否认的人们",
            "verse 83:11": "否认报应日的人们！",
            "verse 83:12": "只有每个过分的犯罪的人，否认它。",
            "verse 83:13": "当别人对他宣读我的迹象的时候，他说：这是古人的故事。",
            "verse 83:14": "绝不然，但他们所犯的罪恶，已像锈样蒙敝他们的心。",
            "verse 83:15": "真的，在那日，他们必受阻拦，不得觐见他们的主。",
            "verse 83:16": "然後，他们必堕入烈火之中。",
            "verse 83:17": "然後，或者将对他们说：这就是你们所否认的。",
            "verse 83:18": "真的，善人们的记录，确在善行簿中。",
            "verse 83:19": "你怎能知道善行簿是什麽？",
            "verse 83:20": "是一本封存的簿子，",
            "verse 83:21": "真主所亲近的天神们将作证它。",
            "verse 83:22": "善人们必在恩泽中，",
            "verse 83:23": "靠在床上注视著，",
            "verse 83:24": "你能在他们的面目上认识恩泽的光华。",
            "verse 83:25": "他们将饮封存的天醇，",
            "verse 83:26": "封瓶口的，是麝香。教贪爱这种幸福的人们，争先为善吧！",
            "verse 83:27": "天醇的混合物，是由太斯尼姆来的，",
            "verse 83:28": "那是一洞泉水，真主所亲近的人将饮它。",
            "verse 83:29": "犯罪的人们常常嘲笑信士们，",
            "verse 83:30": "当信士们从他们的面前走过的时候，他们以目互相示意；",
            "verse 83:31": "当他们回家的时候，洋洋得意地回去；",
            "verse 83:32": "当他们遇见信士们的时候，他们说：这等人确是迷误的。",
            "verse 83:33": "他们没有被派去监视信士们。",
            "verse 83:34": "故今日信士们，嘲笑不信道的人们，",
            "verse 83:35": "他们靠在床上注视著，",
            "verse 83:36": "不信道的人们已获得他们的行为的报酬了吗？"
        },
        "Danish": {
            "verse 83:1": "Wee hen die anderen tekort doen",
            "verse 83:2": "Wanneer zij voor zichzelf wegen, nemen zij volle maat",
            "verse 83:3": "Indien zij voor anderen uitmeten of afwegen, geven zij minder (dan behoort)",
            "verse 83:4": "Weten zulke mensen niet dat zij zullen herrijzen",
            "verse 83:5": "Op een grote Dag",
            "verse 83:6": "De Dag, waarop de mensheid voor de Heer der Werelden zal staan",
            "verse 83:7": "Neen! Het gedenkschrift over de bozen is in Sidjdjien",
            "verse 83:8": "En wat weet gij er van wat Sidjdjien is",
            "verse 83:9": "Het is een geschreven boek",
            "verse 83:10": "Wee, op die Dag de loochenaars",
            "verse 83:11": "Die de Dag des Oordeels loochenen",
            "verse 83:12": "En niemand behalve de zondige overtreder loochent die (Dag)",
            "verse 83:13": "Die zegt, als Onze woorden aan hem worden voorgedragen: Fabelen der ouden",
            "verse 83:14": "Neen, maar hetgeen zij plachten te verdienen heeft zich als roest aan hun hart gehecht",
            "verse 83:15": "Neen, zij zullen die Dag zeker van hun Heer worden uitgesloten",
            "verse 83:16": "Voorwaar, dan zullen zij in de hel branden",
            "verse 83:17": "En er zal tot hen worden gezegd: Dit is hetgeen gij placht te loochenen",
            "verse 83:18": "Neen, het gedenkschrift der deugdzamen is voorzeker in Illijjien",
            "verse 83:19": "En wat weet gij er van watIllijjien is",
            "verse 83:20": "Een geschreven boek",
            "verse 83:21": "De nabij (God) zijnden zullen het zien",
            "verse 83:22": "Voorwaar, de deugdzamen onder zegeningen",
            "verse 83:23": "Op hoge sofa`s zullen zij elkander aanschouwen",
            "verse 83:24": "Gij zult in hun gezicht de glans der gelukzaligheid herkennen",
            "verse 83:25": "Hun wordt zuivere verzegelde wijn te drinken gegeven",
            "verse 83:26": "Welks zegel muskus is. En laat degenen die wedijveren, hiervoor wedijveren",
            "verse 83:27": "En hij zal vermengd worden met water van Tasniem",
            "verse 83:28": "Een bron waaruit de nabij (God) zijnden drinken",
            "verse 83:29": "Waarlijk, de schuldigen plachten de gelovigen uit te lachen",
            "verse 83:30": "En wanneer zij hen voorbijgingen, knipoogden zij tegen elkander",
            "verse 83:31": "En wanneer zij tot de hunnen terugkeerden, keerden zij opgetogen terug",
            "verse 83:32": "En wanneer zij hen zagen, zeiden zij: Dit zijn inderdaad de dwalenden",
            "verse 83:33": "Maar zij waren niet als bewakers over hen gezonden",
            "verse 83:34": "Daarom zullen op deze Dag de gelovigen over de ongelovigen lachen",
            "verse 83:35": "Op hoge sofa`s zittende zullen zij aanschouwen",
            "verse 83:36": "Voorzeker wordt de ongelovigen vergolden voor hetgeen zij plachten te doen"
        },
        "Dutch": {
            "verse 83:1": "Wee de zwendelaars!",
            "verse 83:2": "Degenen die wanneer zij mensen voor zich laten wegen de volle maat eisen.",
            "verse 83:3": "Maar wanneer zij voor anderen afmeten of voor hen afwegen, benadelen zij (hen).",
            "verse 83:4": "Zijn diegenen dan er niet van overtuigd dat zij opgewekt zullen worden?",
            "verse 83:5": "Op een geweldige Dag?",
            "verse 83:6": "Op de Dag waarop de mensen voor de Heer der Werelden staan?",
            "verse 83:7": "Nee, voorwaar, het boek van de zondigen is in Siddjîen.",
            "verse 83:8": "En wat doet jou weten wat Siddjîen is?",
            "verse 83:9": "Een volbeschreven boek.",
            "verse 83:10": "Wee die Dag de loochenaars!",
            "verse 83:11": "Degenen die de Dag des Oordeels loochenen.",
            "verse 83:12": "En niemand loochent die behalve elke zondige overtreder.",
            "verse 83:13": "Wanneer Onze Verzen aan hem worden voorgedragen, zegt hij: \"Fabels van de vroegeren!\"",
            "verse 83:14": "Nee! Wat zij plachten te doen heeft zelfs hun harten bedekt.",
            "verse 83:15": "Nee, voorwaar, zij zullen zeker op die Dag van hun Heer afgescheiden zijn.",
            "verse 83:16": "Vervolgens zullen zij zeker Djahîm (de Hel) binnengaan.",
            "verse 83:17": "Daarop wordt gezegd: \"Dit is dat wat jullie plachten te loochenen.\"",
            "verse 83:18": "Nee! Voorwaar, het boek van de deugdzamen is zeker in 'Illiyyôen.",
            "verse 83:19": "En wat doet jou weten wat 'Illiyyôen is?",
            "verse 83:20": "Een volbeschreven Boek.",
            "verse 83:21": "De bij (Allah) gebrachten zijn er getuigen van.",
            "verse 83:22": "Voorwaar, de deugdzamen zullen zeker in Na'im (het Paradijs) vertoeven.",
            "verse 83:23": "Op rustbanken kijken zij toe.",
            "verse 83:24": "Jij herkent in hun gezichten de stralende gelukzaligheid",
            "verse 83:25": "Hun wordt verzegeld drinken ingeschonken.",
            "verse 83:26": "Waarvan het zegel van muskus is, en laten de wedijveraars hierom dan wedijveren.",
            "verse 83:27": "En zijn mengdrank is van (de bron) Tasmîm.",
            "verse 83:28": "Een bron waarvan de nabijgebrachten drinken.",
            "verse 83:29": "Voorwaar, degenen die zondigden plachten over degenen die geloofden te lachen.",
            "verse 83:30": "En wanneer zij aan hen voorbijgingen, knipoogden zij naar elkaar.",
            "verse 83:31": "En wanneer zij terugkeerden naar hun volk, keerden zij verheugd terug.",
            "verse 83:32": "En wanneer zij hen zagen, zeiden zij: \"Voorwaar, zij zijn zeker dwalend.\"",
            "verse 83:33": "En zij zijn niet als bewakers over hen gezonden.",
            "verse 83:34": "Maar op deze Dag zullen degenen die geloven lachen over de ongelovigen.",
            "verse 83:35": "Op rustbanken kijken zij toe.",
            "verse 83:36": "Worden de ongelovigen niet vergolden voor wat zij plachten te doen?"
        },
        "English": {
            "verse 83:1": "Woe to those who give less [than due],",
            "verse 83:2": "Who, when they take a measure from people, take in full.",
            "verse 83:3": "But if they give by measure or by weight to them, they cause loss.",
            "verse 83:4": "Do they not think that they will be resurrected",
            "verse 83:5": "For a tremendous Day -",
            "verse 83:6": "The Day when mankind will stand before the Lord of the worlds?",
            "verse 83:7": "No! Indeed, the record of the wicked is in sijjeen.",
            "verse 83:8": "And what can make you know what is sijjeen?",
            "verse 83:9": "It is [their destination recorded in] a register inscribed.",
            "verse 83:10": "Woe, that Day, to the deniers,",
            "verse 83:11": "Who deny the Day of Recompense.",
            "verse 83:12": "And none deny it except every sinful transgressor.",
            "verse 83:13": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"",
            "verse 83:14": "No! Rather, the stain has covered their hearts of that which they were earning.",
            "verse 83:15": "No! Indeed, from their Lord, that Day, they will be partitioned.",
            "verse 83:16": "Then indeed, they will [enter and] burn in Hellfire.",
            "verse 83:17": "Then it will be said [to them], \"This is what you used to deny.\"",
            "verse 83:18": "No! Indeed, the record of the righteous is in 'illiyyun.",
            "verse 83:19": "And what can make you know what is 'illiyyun?",
            "verse 83:20": "It is [their destination recorded in] a register inscribed",
            "verse 83:21": "Which is witnessed by those brought near [to Allah].",
            "verse 83:22": "Indeed, the righteous will be in pleasure",
            "verse 83:23": "On adorned couches, observing.",
            "verse 83:24": "You will recognize in their faces the radiance of pleasure.",
            "verse 83:25": "They will be given to drink [pure] wine [which was] sealed.",
            "verse 83:26": "The last of it is musk. So for this let the competitors compete.",
            "verse 83:27": "And its mixture is of Tasneem,",
            "verse 83:28": "A spring from which those near [to Allah] drink.",
            "verse 83:29": "Indeed, those who committed crimes used to laugh at those who believed.",
            "verse 83:30": "And when they passed by them, they would exchange derisive glances.",
            "verse 83:31": "And when they returned to their people, they would return jesting.",
            "verse 83:32": "And when they saw them, they would say, \"Indeed, those are truly lost.\"",
            "verse 83:33": "But they had not been sent as guardians over them.",
            "verse 83:34": "So Today those who believed are laughing at the disbelievers,",
            "verse 83:35": "On adorned couches, observing.",
            "verse 83:36": "Have the disbelievers [not] been rewarded [this Day] for what they used to do?"
        },
        "Filipino": {
            "verse 83:1": "Kasawian sa Al-Mutaffifin (sila na gumagawa ng pandaraya, alalaong baga, ang mga nagbibigay ng kulang sa sukat at timbang at nagbabawas sa mga karapatan ng iba)",
            "verse 83:2": "Sila na kung tatanggap sa mga tao ng may sukat at timbang ay naghahanap ng ganap na sukat at timbang",
            "verse 83:3": "Datapuwa’t kung sila ang magbibigay sa mga tao ng may sukat at timbang ay nagbibigay ng kulang",
            "verse 83:4": "Hindi baga nila napag-aakala na sila ay ibabangong muli upang tawagin sa Pagsusulit",
            "verse 83:5": "Sa dakilang Araw",
            "verse 83:6": "Sa Araw na yaon, ang buong sangkatauhan ay titindig sa harapan ng 946 Panginoon ng lahat ng mga nilalang",
            "verse 83:7": "Katotohanan! Ang Talaan (na kinapapalooban ng mga gawa) ng Fujjar (mga tampalasan, makasalanan, walang pananampalataya, mapaggawa ng kamalian) ay nakatago sa Sijjin",
            "verse 83:8": "Tunay nga, ano nga ba ang makakapagpahiwatig sa iyo kung ano ang kahulugan ng Sijjin",
            "verse 83:9": "Isang nasusulat na Talaan",
            "verse 83:10": "Kasawian sa Araw na yaon sa mga nagtatatwa (kay Allah, sa Kanyang mga Anghel, sa Kanyang mga Tagagapagbalita, sa Araw ng Muling Pagkabuhay at sa Al-Qadar [maka- Diyos na Pagtatakda)",
            "verse 83:11": "Sa mga nagtatakwil sa Araw ng Kabayaran",
            "verse 83:12": "At walang sinuman ang makakapagtakwil doon maliban sa mga makasalanan na lumalabag ng labis sa hangganan (ng kawalang pananampalataya, pang-aapi at pagsuway kay Allah), mga Makasalanan",
            "verse 83:13": "Na kung ang Aming mga Talata (ang Qur’an) ay ipinahahayag sa kanya, siya ay nagsasabi: “ Mga kathang isip lamang ng panahong lumipas!”",
            "verse 83:14": "Tunay nga! Ang kanilang puso ay may batik (nababahiran at nalalambungan ng mantsa dahil sa mga kasalanan at masasamang gawa) ng kanilang ginawa",
            "verse 83:15": "Katotohanan, sa Araw na yaon, ang Habag ng kanilang Panginoon ay ipagkakait sa kanila (ang mga makasalanan ay malalambungan upang hindi nila mamalas ang kanilang Panginoon)",
            "verse 83:16": "Tunay nga! Katotohanang sila ay papasok sa naglalagablab na Apoy ng Impiyerno",
            "verse 83:17": "At sa kanila ay ipagbabadya: “Ito ang kaganapan (at katotohanan) ng inyong tinalikdan (at tinalikuran)",
            "verse 83:18": "Katotohanan, ang Talaan ng mga matutuwid (at may pangangamba kay Allah at umiiwas sa kasamaan) ay nakatago sa Illiyyun",
            "verse 83:19": "Tunay nga, ano nga ba ang kahulugan na ipinapahiwatig ng Illiyyun",
            "verse 83:20": "Isang nasusulat na Talaan",
            "verse 83:21": "Na rito ay sumasaksi at nagpapatotoo ang mga pinakamalapit (kay Allah, alalaong baga, ang mga anghel)",
            "verse 83:22": "Katotohanan, ang mga matutuwid na may pangangamba kay Allah at umiiwas sa kasamaan ay mapapasa- Kaligayahan (sa Paraiso)",
            "verse 83:23": "Sa Luklukan (ng karangalan), at napagmamalas nila ang lahat ng bagay",
            "verse 83:24": "At mababanaag mo sa kanilang mukha ang kislap ng Kaligayahan",
            "verse 83:25": "Ang kanilang pagkauhaw ay papawiin ng purong alak na natatakpan pa ang sisidlan",
            "verse 83:26": "At ang huling (tungga) nito (alak) ay katulad ng halimuyak ng musko. At dahil dito, hayaan ang mga nagsisikap na may paghahangad sa kanilang kaligayahan (alalaong baga, ang magmadali sa pagsisigasig sa pagsunod kay Allah)",
            "verse 83:27": "At sa (alak) ay idaragdag pa ang sangkap ng Tasnim",
            "verse 83:28": "Isang batis, na sa tubig nito ay nagsisiinom ang malalapit kay Allah",
            "verse 83:29": "Katotohanan! (Sa panahon ng makamundong buhay) ang mga mapaggawa ng katampalasanan ay lagi nang nanglilibak sa mga nananampalataya",
            "verse 83:30": "At kailanman na sila ay dumaraan sa kanila, (sila ay) nagkikindatan sa isa’t isa (bilang panunuya)",
            "verse 83:31": "At kung sila ay magbalik na sa kanilang pamayanan, sila ay bumabalik ng may pagsasaya",
            "verse 83:32": "At kailanman na kanilang nakikita sila; sila (na hindi sumasampalataya) ay nagsasabi: “Tunay nga! Sila ang mga tao na napaligaw!”",
            "verse 83:33": "Datapuwa’t sila (mga hindi sumasampalataya at tampalasan) ay hindi isinugo bilang tagapagbantay sa kanila (mga sumasampalataya)",
            "verse 83:34": "Ngunit sa Araw na ito (ang Araw ng Kabayaran), ang mga sumasampalataya ay hahalakhak sa mga hindi sumasampalataya",
            "verse 83:35": "Sa luklukan (ng karangalan) ay napagmamalas nila ang lahat ng bagay",
            "verse 83:36": "Hindibagaangmgahindisumasampalatayaayginantihan (nang ganap) dahil sa kanilang ginawa"
        },
        "French": {
            "verse 83:1": "Malheur aux fraudeurs",
            "verse 83:2": "qui, lorsqu'ils font mesurer pour eux-mêmes exigent la pleine mesure,",
            "verse 83:3": "et qui lorsqu'eux-mêmes mesurent ou pèsent pour les autres, [leur] causent perte.",
            "verse 83:4": "Ceux-là ne pensent-ils pas qu'ils seront ressuscités,",
            "verse 83:5": "en un jour terrible,",
            "verse 83:6": "le jour où les gens se tiendront debout devant le Seigneur de l'Univers?",
            "verse 83:7": "Non...! Mais en vérité le livre des libertins sera dans le Sijjîn -",
            "verse 83:8": "et qui te dira ce qu'est le Sijjîn? -",
            "verse 83:9": "Un livre déjà cacheté (achevé).",
            "verse 83:10": "Malheur, ce jour-là, aux négateurs,",
            "verse 83:11": "qui démentent le jour de la Rétribution.",
            "verse 83:12": "Or, ne le dément que tout transgresseur, pécheur:",
            "verse 83:13": "qui, lorsque Nos versets lui sont récités, dit: «[Ce sont] des contes d'anciens!»",
            "verse 83:14": "Pas du tout, mais ce qu'ils ont accompli couvre leurs cœurs.",
            "verse 83:15": "Qu'ils prennent garde! En vérité ce jour-là un voile les empêchera de voir leur Seigneur,",
            "verse 83:16": "ensuite, ils brûleront certes, dans la Fournaise;",
            "verse 83:17": "on [leur] dira alors: «Voilà ce que vous traitiez de mensonge!»",
            "verse 83:18": "Qu'ils prennent garde! Le livre des bons sera dans l'Illiyûn -",
            "verse 83:19": "et qui te dira ce qu'est l'Illiyûn? -",
            "verse 83:20": "un livre cacheté!",
            "verse 83:21": "Les rapprochés [d'Allah: les Anges] en témoignent.",
            "verse 83:22": "Les bons seront dans [un Jardin] de délice,",
            "verse 83:23": "sur les divans, ils regardent.",
            "verse 83:24": "Tu reconnaîtras sur leurs visages, l'éclat de la félicité.",
            "verse 83:25": "On leur sert à boire un nectar pur, cacheté,",
            "verse 83:26": "laissant un arrière-goût de musc. Que ceux qui la convoitent entrent en compétition [pour l'acquérir]",
            "verse 83:27": "Il est mélangé à la boisson de Tasnîm,",
            "verse 83:28": "source dont les rapprochés boivent.",
            "verse 83:29": "Les criminels riaient de ceux qui croyaient,",
            "verse 83:30": "et, passant près d'eux, ils se faisaient des œillades,",
            "verse 83:31": "et, retournant dans leurs familles, ils retournaient en plaisantant,",
            "verse 83:32": "et les voyant, ils disaient: «Ce sont vraiment ceux-là les égarés».",
            "verse 83:33": "Or, ils n'ont pas été envoyés pour être leurs gardiens.",
            "verse 83:34": "Aujourd'hui, donc, ce sont ceux qui ont cru qui rient des infidèles",
            "verse 83:35": "sur les divans, ils regardent.",
            "verse 83:36": "Est-ce que les infidèles ont eu la récompense de ce qu'ils faisaient?"
        },
        "Fulah": {
            "verse 83:1": "Halkaare woodanii ɓeen ustooɓe peese",
            "verse 83:2": "ɓeen peesnatooɓe yimɓe ɓe ɗaɓɓa timminaneede",
            "verse 83:3": "Siɓe ɓetanii ɓe wolla ɓe peesanii ɓe usta",
            "verse 83:4": "E ɓee kan fellitaa wonnde ko ɓe immintinteeɓe",
            "verse 83:5": "Woodanii mbo ñalngu mawngu",
            "verse 83:6": "ñande yimɓe ummanii jom binnde",
            "verse 83:7": "Alah, pellet deftere faajireeɓe nani e sijijiin",
            "verse 83:8": "Ko honɗum anndin maa ko woni SijjIiin",
            "verse 83:9": "Ko deftere tonngaande",
            "verse 83:10": "haray nden ñalnde, bone woodanii fennuɓe ɓen",
            "verse 83:11": "ɓeen fennooɓe ñalaande njoɓdi",
            "verse 83:12": "Fennatah mbo si wonah kala palguɗo keerol bakkadinɗo",
            "verse 83:13": "Si Aayeeje Amen ɗen janngaama e [tawnde] makko, o wi`a: \"Ko tinndi adinooɓe",
            "verse 83:14": "Alah, kono muuri ɓerɗe maɓɓe koɓe pennatnoo ko",
            "verse 83:15": "Alah ɓeen de koɓe haɗaaɓe yiide joomi mum en",
            "verse 83:16": "Refti pellet koɓe naatooɓe yiite",
            "verse 83:17": "Refti ɓe wi*e:\"Meeɗee lepte mon ɗen; ko ɗum woni ko pennatɗon kon",
            "verse 83:18": "Alah, pellet deftere ɗigguɓe nani e ka illiyyiina",
            "verse 83:19": "Ko honɗum anndin maa ko woni Illiyyiina",
            "verse 83:20": "Ko deftere tonngaande",
            "verse 83:21": "Na seedoo nde ɓurɓe ɓadaade",
            "verse 83:22": "Pellet ɓeen ɗigguɓe hoɓe e neema",
            "verse 83:23": "E leece hoɓe ndaara",
            "verse 83:24": "Ina anndee e geeece mum en weltaare neema",
            "verse 83:25": "Hoɓe yarnee dola omndaako",
            "verse 83:26": "Haaɗtirde mum ko lati misku e ɗuum de yo fooɗondir fooɗondirooɓe",
            "verse 83:27": "Hombo e Tasniim ɗuum ko seewnde ɓurnde toowde to aljanna",
            "verse 83:28": "Seewnde nde ɓurɓe ɓadaade njarata",
            "verse 83:29": "ɓeen faajirinɓe ngoniina na njala ɓeen goonɗinɓe",
            "verse 83:30": "Siɓe mbirtiima ɓe ɓe ngona e ɓiiñandirde",
            "verse 83:31": "Siɓe nduttiima e koreeji maɓɓe ɓe ndutto koɓe weltiiɓe",
            "verse 83:32": "Siɓe nji*iiɓe ɓe mbi*a ɓe ko ɓe majjuɓe",
            "verse 83:33": "ɓe nelaaka e dow mum en ngam reende ɓe",
            "verse 83:34": "Hannde de goonɗinɓe njala heeferɓe",
            "verse 83:35": "E leece hoɓe ndaara",
            "verse 83:36": "Mbela heeferɓe njoɓaama koɓe mbaɗatnoo ko"
        },
        "German": {
            "verse 83:1": "Wehe den das Maß Kürzenden,",
            "verse 83:2": "die, wenn sie sich von den Menschen zumessen lassen, sich volles Maß geben lassen,",
            "verse 83:3": "wenn sie ihnen aber zumessen oder wägen, Verlust zufügen.",
            "verse 83:4": "Glauben jene nicht, daß sie auferweckt werden",
            "verse 83:5": "zu einem gewaltigen Tag,",
            "verse 83:6": "am Tag, da die Menschen sich um des Herrn der Weltenbewohner willen aufstellen werden?",
            "verse 83:7": "Keineswegs! Das Buch der Sittenlosen ist wahrlich in Siggin.",
            "verse 83:8": "Und was läßt dich wissen, was Siggin ist?",
            "verse 83:9": "(Es ist) ein Buch mit festen Eintragungen.",
            "verse 83:10": "Wehe an jenem Tag den Leugnern,",
            "verse 83:11": "die den Tag des Gerichts für Lüge erklären!",
            "verse 83:12": "Und nur derjenige erklärt ihn für Lüge, der Übertretungen begeht und ein Sünder ist.",
            "verse 83:13": "Wenn ihm Unsere Zeichen verlesen werden, sagt er: \"(Es sind) Fabeln der Früheren.\"",
            "verse 83:14": "Keineswegs! Vielmehr hat sich das, was sie zu erwerben pflegten, über ihren Herzen angesetzt.",
            "verse 83:15": "Keineswegs! Sie werden von ihrem Herrn an jenem Tag bestimmt abgeschirmt sein.",
            "verse 83:16": "Hierauf werden sie bestimmt dem Höllenbrand ausgesetzt sein.",
            "verse 83:17": "Hierauf wird gesagt werden: \"Das ist das, was ihr für Lüge zu erklären pflegtet.\"",
            "verse 83:18": "Keineswegs! Das Buch der Frommen ist wahrlich in 'Illiyyin.",
            "verse 83:19": "Und was läßt dich wissen, was 'Illiyyun ist?",
            "verse 83:20": "(Es ist) ein Buch mit festen Eintragungen,",
            "verse 83:21": "in das die (Allah) Nahegestellten Einsicht nehmen.",
            "verse 83:22": "Die Frommen werden wahrlich in Wonne sein,",
            "verse 83:23": "auf überdachten Liegen (gelehnt), und blicken um sich.",
            "verse 83:24": "Du erkennst in ihren Gesichtern das Strahlen der Wonne.",
            "verse 83:25": "Ihnen wird von versiegeltem Nektar zu trinken gegeben,",
            "verse 83:26": "dessen Siegel Moschus ist -, und darum sollen die Wettbewerber wettkämpfen -,",
            "verse 83:27": "und dessen Beimischung Tasnim ist,",
            "verse 83:28": "aus einer Quelle, aus der die (Allah) Nahegestellten trinken.",
            "verse 83:29": "Gewiß, diejenigen, die Übeltaten begingen, pflegten über diejenigen zu lachen, die glauben,",
            "verse 83:30": "und, wenn sie an ihnen vorbeikamen, einander zuzuzwinkern.",
            "verse 83:31": "Und, wenn sie zu ihren Angehörigen zurückkehrten, kehrten sie zurück, indem sie es sich wohl sein ließen.",
            "verse 83:32": "Und, wenn sie sie sahen, sagten sie: \"Diese gehen fürwahr in die Irre.\"",
            "verse 83:33": "Dabei waren sie doch nicht als Hüter über sie gesandt worden.",
            "verse 83:34": "Heute aber lachen diejenigen, die glauben, über die Ungläubigen,",
            "verse 83:35": "auf überdachten Liegen (gelehnt), und blicken um sich.",
            "verse 83:36": "Sind die Ungläubigen nicht doch belohnt worden für das, was sie zu tun pflegten?"
        },
        "Hausa": {
            "verse 83:1": "Bone ya tabbata ga mãsu naƙƙasãwa.",
            "verse 83:2": "Waɗanda suke idan suka auna daga mutãne suna cika mũdu.",
            "verse 83:3": "Kuma idan sun auna musu da zakka ko da sikẽli, suna ragẽwa",
            "verse 83:4": "Ashe! Waɗancan bã su tabbata cẽwa lalle sũ, ana tãyar da su ba?",
            "verse 83:5": "Domin yini mai girma.",
            "verse 83:6": "Yinin da mutãne ke tãshi zuwa ga Ubangijin halitta?",
            "verse 83:7": "Haƙĩƙa lalle ne littãfin fãjirai dãhir, yana a cikin Sijjĩn.",
            "verse 83:8": "Kuma, mẽ ya sanar da kai abin da akẽ cẽ wa Sijjĩn?",
            "verse 83:9": "Wani 1ittãfi ne rubũtacce.",
            "verse 83:10": "Bone yã tabbata a rãnar nan ga mãsu ƙaryatãwa.",
            "verse 83:11": "Waɗanda suke ƙaryatãwa game da rãnar sakamako.",
            "verse 83:12": "Babũ mai ƙaryatãwa gare shi fãce dukan mai ƙẽtare haddi mai yawan zunubi.",
            "verse 83:13": "Idan ana karãtun ãyõyinmu, a kansa, sai ya ce: tãtsũniyõyin mutãnen farko ne.",
            "verse 83:14": "A'aha! Bã haka ba, abin da suka kasance suna aikatãwa dai, yã yi tsãtsa a cikin zukãtãnsu.",
            "verse 83:15": "A'aha! Haƙĩƙa, lalle ne sũ daga Ubangijinsu, rãnar nan, waɗanda ake shãmakancẽwa ne.",
            "verse 83:16": "Sa'an nan, lalle ne, sũ mãsu shiga cikin Jahĩm ne.",
            "verse 83:17": "Sa'an nan a ce: \"Wannan shi ne abin da kuka kasance kuna ƙaryatãwa game da shi.\"",
            "verse 83:18": "A'aha! Haƙĩƙa lalle ne littãfin mãsu ɗã'ã yana a cikin Illiyyĩna?",
            "verse 83:19": "Kuma mẽne ne yã sanar da kai abin da ake cẽwa Illiyyũna?",
            "verse 83:20": "Wani littãfi ne rubũtacce.",
            "verse 83:21": "Muƙarrabai suke halarta shi.",
            "verse 83:22": "Lalle ne, mãsu ɗã'ã ga Allah tabbas suna cikin ni'ima.",
            "verse 83:23": "A kan karagu, suna ta kallo.",
            "verse 83:24": "Kana sani a cikin huskõkinsu, akwai kwarjinin ni'ima.",
            "verse 83:25": "Ana shãyar da sũ daga wata giya wadda aka yunƙe a kan rufinta.",
            "verse 83:26": "¡arshen kurɓinta miski ne. To, a cikin wannan, mãsu gwagwarmaya su yi ta gwagwarmayar nẽma.",
            "verse 83:27": "Kuma abin da ake gauraya ta da shi, daga tasnĩm yake.",
            "verse 83:28": "(Wato) wani marmaro ne wanda muƙarrabai ke sha daga gare shi.",
            "verse 83:29": "Lalle ne, waɗanda suka kãfirta sun kasance (a dũniya) suna yi wa waɗanda suka yi ĩmãni dãriya.",
            "verse 83:30": "Kuma idan sun shuɗe su sai su dinga yin zunɗe.",
            "verse 83:31": "Kuma idan suka jũya zuwa ga iyãlansu, sai su tafi suna kãkãci.",
            "verse 83:32": "Kuma idan sun gan su sai su ce: \"Lalle waɗannan ɓatattu ne.\"",
            "verse 83:33": "Alhãli kuwa, ba a aike su ba dõmin su zama mãsu tsaro a kansu.",
            "verse 83:34": "To, yau fa (a Lãhira] waɗanda suka yi ĩmãni, sũ ke yi wa kãfirai dãriya.",
            "verse 83:35": "A kan karagu, suna ta kallo.",
            "verse 83:36": "Shin an sãka ma kãfirai abin da suka kasance suna aikatawa?"
        },
        "Hindi": {
            "verse 83:1": "नाप तौल में कमी करने वालों की ख़राबी है",
            "verse 83:2": "जो औरें से नाप कर लें तो पूरा पूरा लें",
            "verse 83:3": "और जब उनकी नाप या तौल कर दें तो कम कर दें",
            "verse 83:4": "क्या ये लोग इतना भी ख्याल नहीं करते",
            "verse 83:5": "कि एक बड़े (सख्त) दिन (क़यामत) में उठाए जाएँगे",
            "verse 83:6": "जिस दिन तमाम लोग सारे जहाँन के परवरदिगार के सामने खड़े होंगे",
            "verse 83:7": "सुन रखो कि बदकारों के नाम ए अमाल सिज्जीन में हैं",
            "verse 83:8": "तुमको क्या मालूम सिज्जीन क्या चीज़ है",
            "verse 83:9": "एक लिखा हुआ दफ़तर है जिसमें शयातीन के (आमाल दर्ज हैं)",
            "verse 83:10": "उस दिन झुठलाने वालों की ख़राबी है",
            "verse 83:11": "जो लोग रोजे ज़ज़ा को झुठलाते हैं",
            "verse 83:12": "हालॉकि उसको हद से निकल जाने वाले गुनाहगार के सिवा कोई नहीं झुठलाता",
            "verse 83:13": "जब उसके सामने हमारी आयतें पढ़ी जाती हैं तो कहता है कि ये तो अगलों के अफसाने हैं",
            "verse 83:14": "नहीं नहीं बात ये है कि ये लोग जो आमाल (बद) करते हैं उनका उनके दिलों पर जंग बैठ गया है",
            "verse 83:15": "बेशक ये लोग उस दिन अपने परवरदिगार (की रहमत से) रोक दिए जाएँगे",
            "verse 83:16": "फिर ये लोग ज़रूर जहन्नुम वासिल होंगे",
            "verse 83:17": "फिर उनसे कहा जाएगा कि ये वही चीज़ तो है जिसे तुम झुठलाया करते थे",
            "verse 83:18": "ये भी सुन रखो कि नेको के नाम ए अमाल इल्लीयीन में होंगे",
            "verse 83:19": "और तुमको क्या मालूम कि इल्लीयीन क्या है वह एक लिखा हुआ दफ़तर है",
            "verse 83:20": "जिसमें नेकों के आमाल दर्ज हैं",
            "verse 83:21": "उसके पास मुक़र्रिब (फ़रिश्ते) हाज़िर हैं",
            "verse 83:22": "बेशक नेक लोग नेअमतों में होंगे",
            "verse 83:23": "तख्तों पर बैठे नज़ारे करेंगे",
            "verse 83:24": "तुम उनके चेहरों ही से राहत की ताज़गी मालूम कर लोगे",
            "verse 83:25": "उनको सर ब मोहर ख़ालिस शराब पिलायी जाएगी",
            "verse 83:26": "जिसकी मोहर मिश्क की होगी और उसकी तरफ अलबत्ता शायक़ीन को रग़बत करनी चाहिए",
            "verse 83:27": "और उस (शराब) में तसनीम के पानी की आमेज़िश होगी",
            "verse 83:28": "वह एक चश्मा है जिसमें मुक़रेबीन पियेंगे",
            "verse 83:29": "बेशक जो गुनाहगार मोमिनों से हँसी किया करते थे",
            "verse 83:30": "और जब उनके पास से गुज़रते तो उन पर चशमक करते थे",
            "verse 83:31": "और जब अपने लड़के वालों की तरफ़ लौट कर आते थे तो इतराते हुए",
            "verse 83:32": "और जब उन मोमिनीन को देखते तो कह बैठते थे कि ये तो यक़ीनी गुमराह हैं",
            "verse 83:33": "हालॉकि ये लोग उन पर कुछ निगराँ बना के तो भेजे नहीं गए थे",
            "verse 83:34": "तो आज (क़यामत में) ईमानदार लोग काफ़िरों से हँसी करेंगे",
            "verse 83:35": "(और) तख्तों पर बैठे नज़ारे करेंगे",
            "verse 83:36": "कि अब तो काफ़िरों को उनके किए का पूरा पूरा बदला मिल गया"
        },
        "Indonesian": {
            "verse 83:1": "Kecelakaan besarlah bagi orang-orang yang curang",
            "verse 83:2": "(yaitu) orang-orang yang apabila menerima takaran dari orang lain mereka minta dipenuhi,",
            "verse 83:3": "dan apabila mereka menakar atau menimbang untuk orang lain, mereka mengurangi.",
            "verse 83:4": "Tidaklah orang-orang itu menyangka, bahwa sesungguhnya mereka akan dibangkitkan,",
            "verse 83:5": "pada suatu hari yang besar,",
            "verse 83:6": "(yaitu) hari (ketika) manusia berdiri menghadap Tuhan semesta alam?",
            "verse 83:7": "Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin.",
            "verse 83:8": "Tahukah kamu apakah sijjin itu?",
            "verse 83:9": "(Ialah) kitab yang bertulis.",
            "verse 83:10": "Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,",
            "verse 83:11": "(yaitu) orang-orang yang mendustakan hari pembalasan.",
            "verse 83:12": "Dan tidak ada yang mendustakan hari pembalasan itu melainkan setiap orang yang melampaui batas lagi berdosa,",
            "verse 83:13": "yang apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: \"Itu adalah dongengan orang-orang yang dahulu\"",
            "verse 83:14": "Sekali-kali tidak (demikian), sebenarnya apa yang selalu mereka usahakan itu menutupi hati mereka.",
            "verse 83:15": "Sekali-kali tidak, sesungguhnya mereka pada hari itu benar-benar tertutup dari (rahmat) Tuhan mereka.",
            "verse 83:16": "Kemudian, sesungguhnya mereka benar-benar masuk neraka.",
            "verse 83:17": "Kemudian, dikatakan (kepada mereka): \"Inilah azab yang dahulu selalu kamu dustakan\".",
            "verse 83:18": "Sekali-kali tidak, sesungguhnya kitab orang-orang yang berbakti itu (tersimpan) dalam 'Illiyyin.",
            "verse 83:19": "Tahukah kamu apakah 'Illiyyin itu?",
            "verse 83:20": "(Yaitu) kitab yang bertulis,",
            "verse 83:21": "yang disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah).",
            "verse 83:22": "Sesungguhnya orang yang berbakti itu benar-benar berada dalam kenikmatan yang besar (surga),",
            "verse 83:23": "mereka (duduk) di atas dipan-dipan sambil memandang.",
            "verse 83:24": "Kamu dapat mengetahui dari wajah mereka kesenangan mereka yang penuh kenikmatan.",
            "verse 83:25": "Mereka diberi minum dari khamar murni yang dilak (tempatnya),",
            "verse 83:26": "laknya adalah kesturi; dan untuk yang demikian itu hendaknya orang berlomba-lomba.",
            "verse 83:27": "Dan campuran khamar murni itu adalah dari tasnim,",
            "verse 83:28": "(yaitu) mata air yang minum daripadanya orang-orang yang didekatkan kepada Allah.",
            "verse 83:29": "Sesungguhnya orang-orang yang berdosa, adalah mereka yang menertawakan orang-orang yang beriman.",
            "verse 83:30": "Dan apabila orang-orang yang beriman lalu di hadapan mereka, mereka saling mengedip-ngedipkan matanya.",
            "verse 83:31": "Dan apabila orang-orang yang berdosa itu kembali kepada kaumnya, mereka kembali dengan gembira.",
            "verse 83:32": "Dan apabila mereka melihat orang-orang mukmin, mereka mengatakan: \"Sesungguhnya mereka itu benar-benar orang-orang yang sesat\",",
            "verse 83:33": "padahal orang-orang yang berdosa itu tidak dikirim untuk penjaga bagi orang-orang mukmin.",
            "verse 83:34": "Maka pada hari ini, orang-orang yang beriman menertawakan orang-orang kafir,",
            "verse 83:35": "mereka (duduk) di atas dipan-dipan sambil memandang.",
            "verse 83:36": "Sesungguhnya orang-orang kafir telah diberi ganjaran terhadap apa yang dahulu mereka kerjakan."
        },
        "Italian": {
            "verse 83:1": "Guai ai frodatori,",
            "verse 83:2": "che quando comprano esigono colma la misura,",
            "verse 83:3": "ma quando sono loro a misurare o a pesare, truffano.",
            "verse 83:4": "Non pensano che saranno resuscitati,",
            "verse 83:5": "in un Giorno terribile,",
            "verse 83:6": "il Giorno in cui le genti saranno ritte davanti al Signore dei mondi?",
            "verse 83:7": "No, in verità, il registro dei peccatori è nella Segreta;",
            "verse 83:8": "e chi mai ti farà comprendere cos'è la Segreta ?",
            "verse 83:9": "È uno scritto vergato.",
            "verse 83:10": "Guai, in quel Giorno, a coloro che tacciano di menzogna,",
            "verse 83:11": "che tacciano di menzogna il Giorno del Giudizio.",
            "verse 83:12": "Non lo taccia di menzogna altri che il peccatore inveterato,",
            "verse 83:13": "che, quando gli sono recitati i Nostri versetti, dice: “Favole degli antichi!”.",
            "verse 83:14": "Niente affatto: è piuttosto quello che fanno che copre i loro cuori.",
            "verse 83:15": "Niente affatto: in verità in quel Giorno un velo li escluderà dal vedere il loro Signore,",
            "verse 83:16": "e poi cadranno nella Fornace.",
            "verse 83:17": "Sarà detto loro: “Ecco quello che tacciavate di menzogna!”.",
            "verse 83:18": "Niente affatto: il registro dei caritatevoli sarà nelle Altezze.",
            "verse 83:19": "E chi mai ti farà comprendere cosa sono le Altezze?",
            "verse 83:20": "È uno scritto vergato.",
            "verse 83:21": "I ravvicinati ne renderanno testimonianza.",
            "verse 83:22": "I giusti saranno nella delizia,",
            "verse 83:23": "[appoggiati] su alti divani guarderanno.",
            "verse 83:24": "Sui loro volti vedrai il riflesso della Delizia.",
            "verse 83:25": "Berranno un nettare puro, suggellato",
            "verse 83:26": "con suggello di muschio - che vi aspirino coloro che ne sono degni -",
            "verse 83:27": "[un nettare] mescolato con Tasnîm,",
            "verse 83:28": "fonte di cui berranno i ravvicinati.",
            "verse 83:29": "Invero i malvagi schernivano i credenti;",
            "verse 83:30": "quando passavano nei loro pressi si davano occhiate,",
            "verse 83:31": "ritornando dalla loro gente, si burlavano di loro;",
            "verse 83:32": "e quando li vedevano, dicevano: “Davvero sono fuorviati!”.",
            "verse 83:33": "Certo non hanno avuto l'incarico di vegliare su di loro.",
            "verse 83:34": "Oggi invece sono i credenti a ridere dei miscredenti:",
            "verse 83:35": "[appoggiati] su alti divani guarderanno.",
            "verse 83:36": "I miscredenti non sono forse compensati per quello che hanno fatto?"
        },
        "Japanese": {
            "verse 83:1": "災いなるかな，量を減らす者こそは。",
            "verse 83:2": "かれらは人から計って受け取る時は，十分に取り，",
            "verse 83:3": "（相手にわたす）量や重さを計るときは，少なく計量する者たちである。",
            "verse 83:4": "これらの者は，甦ることを考えないのか，",
            "verse 83:5": "偉大なる日に。",
            "verse 83:6": "その日，（凡ての）人間は，万有の主の御前に立つのではないか。",
            "verse 83:7": "断じていけない。罰ある者の記録は，スィッジーンの中に（保管して）ある。",
            "verse 83:8": "スィッジーンが何であるかを，あなたに理解させるものは何か。",
            "verse 83:9": "（そこには完全に）書かれた一つの記録（がある）。",
            "verse 83:10": "災いなるかな，その日，嘘であると言って来た者たちよ，",
            "verse 83:11": "審判の日を，嘘であると言って来た者たちこそは。",
            "verse 83:12": "これを嘘であると言って来た者は，反逆者，罪人に外ならない。",
            "verse 83:13": "わが印が，かれらに読誦された時，かれらは，「昔の物語だ。」と言った。",
            "verse 83:14": "断じてそうではない。思うにかれらの行った（悪）事が，その心の(鋳?)となったのである。",
            "verse 83:15": "いや，本当にかれらは，その日，主（の御光）から締め出される。",
            "verse 83:16": "次にかれらは，地獄できっと焼かれよう。",
            "verse 83:17": "そこで，かれらに，「これが，あなたがたが嘘であると言ってきたことである。」と告げられるであろう。",
            "verse 83:18": "これに引き替え敬虔な者の記録は，イッリッイーンの中に（保管して）ある。",
            "verse 83:19": "イッリッイーンが何であるかを，あなたに理解させるものは何か。",
            "verse 83:20": "（そこには完全に）書かれた一つの記録（があり），",
            "verse 83:21": "（主の）側近者たちが，それを立証する。",
            "verse 83:22": "本当に敬虔な者は，必ず至福の中におり，",
            "verse 83:23": "かれらは寝床に寄って，見渡すであろう。",
            "verse 83:24": "あなたはかれらの顔に至福の輝きを認めよう。",
            "verse 83:25": "かれらは，封印された純良な酒を注がれる。",
            "verse 83:26": "その封印はジャコウである。これを求め熱望する者に熱望させなさい。",
            "verse 83:27": "それにはタスニームが混ぜられよう。",
            "verse 83:28": "（アッラーに）近い者たち（善行者）は，その泉から飲もう。",
            "verse 83:29": "本当に罪ある者たちは，信仰する者を嘲笑っていた。",
            "verse 83:30": "そしてかれら（信者）の傍を過ぎると，互いに（嘲笑して）目くばせし，",
            "verse 83:31": "家族の許へ帰る時，笑い草にしたものである。",
            "verse 83:32": "かれらはかれら（信者）を見かけると，「本当にこれらの者は迷っています。」と言う。",
            "verse 83:33": "だがかれらは，かれら（信者）の監視者として遣わされた者ではない。",
            "verse 83:34": "だがこの日は，信仰する者が不信者たちを笑い，",
            "verse 83:35": "かれらは寝床に寄って，見渡すであろう。",
            "verse 83:36": "不信者たちは，その行いの報いを受けたであろうかと。"
        },
        "Jawa": {
            "verse 83:1": "Cilaka temen wong kang padha cidra (anggone naker)",
            "verse 83:2": "Kang manawa naker saka wong liya (tumrap awake dewe) panakere ganep",
            "verse 83:3": "Lan samongsa anaker barang kang bakal ditampakake wong liya, panakere dikurangi dadi gawe patunan",
            "verse 83:4": "Wong kang mangkono mau ora ngira yen besuk bakal ditangekake saka pati",
            "verse 83:5": "Tumrap dina kang gedhe (qiyamat)",
            "verse 83:6": "Dinane manungsa padha ngadeg angadep Pangeraning ngalam kabeh",
            "verse 83:7": "Temen tulisane lakune para wong ala iku ana pakunjaran (sijjiin)",
            "verse 83:8": "Sapa kang nuduhake marang sira pakunjaran (sijjin) iku apa",
            "verse 83:9": "Buku kang ditulis",
            "verse 83:10": "Ing dina iku wong kang maido cilaka banget",
            "verse 83:11": "Kang padha maido marang dina piwales",
            "verse 83:12": "Ora ana wong gorohake kajaba sarupane wong kang mlangkah wates anggone dosa",
            "verse 83:13": "Manawa diwacakake al-Quran pangucape, \"al-Quran iku gaweyane para wong kuna",
            "verse 83:14": "Wong kebangeten mau mangsa gelema percaya, malah duraka kang dilakoni mau dadi rereged ing atine",
            "verse 83:15": "Temen ing dina iku dheweke padha ketutupan saka pangerane",
            "verse 83:16": "Sawuse mangkono wong mau banjur padha malebu ing neraka jahim",
            "verse 83:17": "Banjur di dawuhi, \"Neraka iki kang padha sira paido biyen",
            "verse 83:18": "O, sayekti kitabe para wong tulus iku temen ana panggonan kang luhur",
            "verse 83:19": "Lan sapa kang nuduhake sira, apa kang aran panggonan luhur",
            "verse 83:20": "Kitab kang katulis",
            "verse 83:21": "Para kang keparek (ing Allah) bakal anekseni",
            "verse 83:22": "Sayekti para wong tulus iku bakal ana sajeroning nugraha",
            "verse 83:23": "Ana kanthil dhuwur anyawang - nyawang",
            "verse 83:24": "Katon ing wajahe cahyaning nugraha",
            "verse 83:25": "Padha pinaringan ngombe omben - omben bening kang diecap",
            "verse 83:26": "Tutupi (mawa) kesturi, mulane para sing nyerempeng angarah lah angaraha iku",
            "verse 83:27": "Lan campurane arupa banyu kang turun amrang dheweke saka dhuwur",
            "verse 83:28": "Tuk kang dadi omben - omben para wong kang keparek (maring Allah)",
            "verse 83:29": "Sayekti para wong kang padha dosa gawene geguyu para kang angestu",
            "verse 83:30": "Lan samongsa angliwati dheweke padha kedep - kinedhepan",
            "verse 83:31": "Lan samangsa bali marang golongane, baline gawe pangeram - eram",
            "verse 83:32": "Lan samangsa ngingetake dheweke, padha kandha, \"Wong mukmin iku padha kesasar",
            "verse 83:33": "Mongka ora diutus supaya angreksa marang dheweke",
            "verse 83:34": "Ananging ing dina iki para wong kang angestu padha geguyu para kafir",
            "verse 83:35": "Linggih ana kanthil deleng sangsarane si kafir",
            "verse 83:36": "sayekti para kafir kapringan piwales miturut apa kang wus padha dilakoni"
        },
        "Kazakh": {
            "verse 83:1": "Өлшеу-тартуда кемітушілерге қасірет бар",
            "verse 83:2": "Солар, қашан адамдардан өлшетіп алса, толық өлшеп алатындар",
            "verse 83:3": "ал, егер өздері өлшеп немесе тартып беретін болса, кемітеді",
            "verse 83:4": "Олар өздерінің қайта тірілетіндіктерін ойламай ма",
            "verse 83:5": "ұлы Күн үшін",
            "verse 83:6": "Ол күні адамдар әлемдердің Раббысының алдында тұрады",
            "verse 83:7": "Жоқ! Әлбетте, бұзықтардың кітабы сөзсіз сижжинде болады",
            "verse 83:8": "Сижжиннің не екенін саған не білдірді",
            "verse 83:9": "Жазылған кітап",
            "verse 83:10": "Өтірікке шығарушыларға ол Күні қасірет бар",
            "verse 83:11": "солар Қайтарым күнін өтірікке шығаратындар",
            "verse 83:12": "Ал, оны әрбір шектен шығушы күнәһар ғана өтірікке шығарады",
            "verse 83:13": "Оған аяттарымыз оқылғанда, ол: “Әуелгілердің ертегісі”, деді",
            "verse 83:14": "Жоқ, керісінше, олардың жүректерін істеп тапқандары күнәлары бүркеп алды іс-амалдарының кірі басты",
            "verse 83:15": "Жоқ! Анығында, олар ол Күні өздерінің Раббысынан тосылатындар",
            "verse 83:16": "Кейін олар, сөзсіз Жахимға кіреді",
            "verse 83:17": "Содан соң Оларға : “Міне, сендердің өтірікке шығарғандарың осы!” деліндеді",
            "verse 83:18": "Жоқ! Шын мәнінде ізгілердің кітабы сөзсіз Иллиунда болады",
            "verse 83:19": "Иллиунның не екенін саған не білдірді",
            "verse 83:20": "Жазылған кітап",
            "verse 83:21": "Оны, жақындатылғандар көреді",
            "verse 83:22": "Анығында, ізгілер, сөзсіз игілікте",
            "verse 83:23": "перделермен сәнделген жұмсақ сәкілерден қарайды",
            "verse 83:24": "Олардың жүзінен игіліктің сәулесін көресің",
            "verse 83:25": "Олар мөрленген шәрбәттан сусындайды",
            "verse 83:26": "Оның сарқыны жұпар. Талпынушылар, міне осыған ұмтылсын",
            "verse 83:27": "Әрі оған Тәсним сусыны қосылған",
            "verse 83:28": "Ол жақындатылғандар ішетін бір бастау",
            "verse 83:29": "Ақиқатында, қылмыскерлер иманға келгендерге күлетін",
            "verse 83:30": "және олар жандарынан өткенде, бір-біріне көз қысып ымдасатын",
            "verse 83:31": "Әрі үйлеріне қайтқан кезде мәз болып, масайрап қайтатын",
            "verse 83:32": "Әрі қашан оларды Мұсылмандарды көрген кезде: «Сөзсіз, бұлар шынында да адасқандар», дейтін",
            "verse 83:33": "Алайда өздері олардың үстінен күзетуші етіліп жіберілмеген еді",
            "verse 83:34": "Ал, енді бұл Қиямет күні иманға келгендер кәпірлердің үстінен күледі",
            "verse 83:35": "сәнді перделі сәкілерден қарап",
            "verse 83:36": "Кәпірлерге істегендерінің қайтарым жазасы берілді ме"
        },
        "Korean": {
            "verse 83:1": "저울을 속이는 자들에게 재앙이 있을것이라저울을 속이는 자들에게 재앙이 있을것이라",
            "verse 83:2": "그들은 사람들로부터 받을 때저울을 넘치게 하여 받으나그들은 사람들로부터 받을 때저울을 넘치게 하여 받으나",
            "verse 83:3": "그들이 사람들에게 줄 때는 무게를 낮추어서 주노라그들이 사람들에게 줄 때는 무게를 낮추어서 주노라",
            "verse 83:4": "그들은 그들이 부활되리라 생 각지 않느뇨그들은 그들이 부활되리라 생 각지 않느뇨",
            "verse 83:5": "그날은 위대한 날로그날은 위대한 날로",
            "verse 83:6": "모든 인간이 만유의 주님앞에 서는 날이며모든 인간이 만유의 주님앞에 서는 날이며",
            "verse 83:7": "사악한 자들의 기록은 씨진 에 보관되어 있노라사악한 자들의 기록은 씨진 에 보관되어 있노라",
            "verse 83:8": "씨진이 무엇인지 무엇이 그대 에게 알려주리요씨진이 무엇인지 무엇이 그대 에게 알려주리요",
            "verse 83:9": "그곳에 기록된 기록부가 있노 라그곳에 기록된 기록부가 있노 라",
            "verse 83:10": "그날에는 불신한 그들에게 재앙이 있을 것이요그날에는 불신한 그들에게 재앙이 있을 것이요",
            "verse 83:11": "심판의 날을 부정하는 자들 에게도 재앙이 있을 것이라심판의 날을 부정하는 자들 에게도 재앙이 있을 것이라",
            "verse 83:12": "어느 누구도 그것을 부정하 지 아니하나 오만한 자들은 영역 을 벗어난 죄인들이라어느 누구도 그것을 부정하 지 아니하나 오만한 자들은 영역 을 벗어난 죄인들이라",
            "verse 83:13": "하나님의 말씀이 그에게 낭 송될 때 이것은 옛 선조들의 우화 요 라고 말하더라하나님의 말씀이 그에게 낭 송될 때 이것은 옛 선조들의 우화 요 라고 말하더라",
            "verse 83:14": "그렇지 않노라 그들의 마음 들이 죄악으로 물들어 있노라그렇지 않노라 그들의 마음 들이 죄악으로 물들어 있노라",
            "verse 83:15": "실로 그날 그들은 베일로 가리워져 바라보지도 못하며실로 그날 그들은 베일로 가리워져 바라보지도 못하며",
            "verse 83:16": "그들은 불지옥으로 들어가게되니그들은 불지옥으로 들어가게되니",
            "verse 83:17": "이것은 너희가 거짓이라 거 역했던 현실이라는 말씀이 있을 것이라이것은 너희가 거짓이라 거 역했던 현실이라는 말씀이 있을 것이라",
            "verse 83:18": "그러나 의로운 자들의 기록 은 일린에 보관되나니그러나 의로운 자들의 기록 은 일린에 보관되나니",
            "verse 83:19": "일린이 무엇인가를 무엇이 그대에게 설명하여 주리요일린이 무엇인가를 무엇이 그대에게 설명하여 주리요",
            "verse 83:20": "그곳에 기록된 기록부가 있 노라그곳에 기록된 기록부가 있 노라",
            "verse 83:21": "하나님 가까이에 있는 그들 이 그것을 증언할 것이니하나님 가까이에 있는 그들 이 그것을 증언할 것이니",
            "verse 83:22": "의로운 자들은 축복속에 있 게 될 것이며의로운 자들은 축복속에 있 게 될 것이며",
            "verse 83:23": "그들은 안락 의자에서 바라 볼 것이라그들은 안락 의자에서 바라 볼 것이라",
            "verse 83:24": "너희는 그들의 얼굴에서 밝 은 축복의 빛을 인식할 것이며너희는 그들의 얼굴에서 밝 은 축복의 빛을 인식할 것이며",
            "verse 83:25": "봉인된 순수한 술로써 그들 의 갈증을 식힐 것이며봉인된 순수한 술로써 그들 의 갈증을 식힐 것이며",
            "verse 83:26": "최후의 음료수는 미스크가 될 것이니 그것을 소망하는 자 갖게 하리라최후의 음료수는 미스크가 될 것이니 그것을 소망하는 자 갖게 하리라",
            "verse 83:27": "거기에 타쓰님이 혼합되어 지니거기에 타쓰님이 혼합되어 지니",
            "verse 83:28": "그것은 하나님 가까이에 있 는 자들이 마시는 샘물이라그것은 하나님 가까이에 있 는 자들이 마시는 샘물이라",
            "verse 83:29": "죄인들은 민음을 가졌던 자 들을 비웃어죄인들은 민음을 가졌던 자 들을 비웃어",
            "verse 83:30": "그들 옆을 지나갈 때면 눈짓으로 조롱하곤 하였고그들 옆을 지나갈 때면 눈짓으로 조롱하곤 하였고",
            "verse 83:31": "그들이 무리에게로 돌아왔을때는 우물 댔노라그들이 무리에게로 돌아왔을때는 우물 댔노라",
            "verse 83:32": "믿는자를 볼 때면 보라 이들이 방황한 자들이라 하더라믿는자를 볼 때면 보라 이들이 방황한 자들이라 하더라",
            "verse 83:33": "그러나 불신자들은 믿는자를감시하기 위해 보내어진 자가 아 니매그러나 불신자들은 믿는자를감시하기 위해 보내어진 자가 아 니매",
            "verse 83:34": "오늘은 믿음을 가진 자들이 그 불신자들을 조롱하리라오늘은 믿음을 가진 자들이 그 불신자들을 조롱하리라",
            "verse 83:35": "이들은 안락의자에 앉아 바 라다 보리라이들은 안락의자에 앉아 바 라다 보리라",
            "verse 83:36": "불신자들은 그들이 행하였던대로 보상을 되돌려 받지 않느뇨불신자들은 그들이 행하였던대로 보상을 되돌려 받지 않느뇨"
        },
        "Kurdish": {
            "verse 83:1": "Ewanê ku di keş û pîvandina xwe da kemasî dikin, xwelî li wan be‌‌هاوارو ئاهو ناڵه بۆ ته‌رازووبازه‌کان، بۆ ئه‌وانه‌ی که له‌کێشان و پێواندا له‌کڕین و فرۆشتندا ته‌رازوو بازی و فێڵ ده‌که‌ن (یان له هه‌ڵسه‌نگاندنی خه‌ڵکیدا ڕاست ناڵێن).",
            "verse 83:2": "Ewanan gava tiştekî ji merivan bistînin; pîvandina wî bê kêmasî pêktîn inئه‌وانه‌ی کاتێك شت له خه‌ڵکی ده‌کڕن به ته‌واوی، به زیاده‌وه ڵێیان وه‌رده‌گرن.",
            "verse 83:3": "Gava ewan ji bona merivan ra bipîvin ya jî bikişîn in; ewan di kêş û pîvandina xwe da kêmasî dikinبه‌ڵام کاتێك شتیان بۆ ده‌پێون یان ده‌کێشن لێی ده‌دزنه‌وه و که‌میان ده‌ده‌نێ و فێڵیان لێده‌که‌ن.",
            "verse 83:4": "Maqey ewan guman nakin ,ku wê ewanê (ji piştî mirinê) rabin herne civînêئایا ئه‌وانه گومان نابه‌ن که به‌ڕاستی زیندوو ده‌کرێنه‌وه (تا سه‌رئه‌نجامی خیانه‌ت و فێڵیان وه‌ربگرن).",
            "verse 83:5": "Ji bona royeke mezin (wê rabin)بۆ ڕۆژێکی زۆر سامناک و ترسناک و گه‌وره‌.",
            "verse 83:6": "ku di wê royê da meriv radibe (hijmara kirinê xwe) ji bona Xuda yê cihanê ra (dide)ئه‌و ڕۆژه‌ی که هه‌موو خه‌ڵکی به پێوه ده‌وه‌ستن له‌به‌رده‌م ده‌سه‌ڵاتی په‌روه‌ردگاری جیهانیاندا.",
            "verse 83:7": "Na! (gotî ewan kêş û pîvanê xwe bi kêmasî nekin) loma bi rastî nivîsara (ki- rinê) gunehkaran di sicîlan da hatîye pêk anînêواز بهێنن له ته‌رازووبازی، چونکه به‌ڕاستی نامه‌ی کرده‌وه‌ی تاوانباران له (سجین) دایه‌.",
            "verse 83:8": "(Muhcmmed!) tu ji ko dizanî ka sicîl çîyeجا تۆ چووزانی (سجین) چیه‌؟",
            "verse 83:9": "Ewa (sicîla deftereke wusane) hemû kirinan tê da cî hilda yeنامه‌یه‌کی (دیاری و ئاشکرایه هه‌ر به‌ڕواڵه‌تیدا دیاره که خێری تیادا نیه‌)، مۆرکراوو لۆک کراویشه‌.",
            "verse 83:10": "Di wê royê da xwelî li derewdêran beهاوارو ئاهوناڵه له‌و ڕۆژه‌دا بۆ ئه‌وانه‌ی بڕوایان نیه و، به‌رنامه‌ی خوا به‌درۆ ده‌زانن.",
            "verse 83:11": "Ewan (derevdêran) roya xelat û celatan didine derewdêrandinêئه‌وانه‌ی که بڕوایان به ڕۆژی قیامه‌ت و زیندوو بوونه‌وه نیه و هه‌میشه به‌درۆی ده‌زانن.",
            "verse 83:12": "Ewê\troyê\they\tewanê\tji\ttuxûbê\txwe\tborî\tû\tgunehkar,\tdidine derewdêrandinêکه‌سیش به‌رپا بوونی ئه‌و ڕۆژه به‌درۆ نازانێت، مه‌گه‌ر هه‌موو سته‌مکارێکی گوناهبار نه‌بێت.",
            "verse 83:13": "Gava beratenê me ji bona wî ra, tên e xwundinê ewî (aha) gotîye: \"Evan çîvanokê berêneئه‌وجۆره که‌سانه‌ی کاتێک ئایه‌ت و فه‌رمانه‌کانی ئێمه‌یان به‌سه‌ردا ده‌خوێنرێته‌وه‌، ده‌ڵێن: ئه‌مه ئه‌فسانه‌ی پێشینانه و (به‌سه‌رچووه‌)...!!",
            "verse 83:14": "Na! (bi gotina wan nîne). Lê bi rastî bi sedema keda wane kirî gemarê li ser dilê wan girtîyeنه‌خێر، وانیه (ئه‌و نه‌فامانه تێناگه‌ن و داناچڵه‌کێن) به‌ڵکو دڵیان ژه‌نگی هێناوه‌و چڵکی گوناه دایپۆشیوه له سه‌ره‌نجامی ئه‌و کاروکرده‌وانه‌ی که ده‌یانکرد.",
            "verse 83:15": "Na! (bi gotina wan nîne, keda wan jî bi tenê nîne) loma bi rastî ewanan di wê royê da ji Xuda yê xwe rûreş inنه‌خێڕ، ڕزگاربوونیان نیه‌، چونکه به‌ڕاستی ئه‌و ڕۆژه به‌ربه‌ست هه‌یه له‌نێوان تاوانباران و په‌روه‌ردگاریاندا و بێ به‌ش ده‌بن له‌بینینی ئه‌و زاته‌.",
            "verse 83:16": "Paşê ewanê li bal doji da bîne avêtinêله‌وه‌ودوا بێگومان ده‌خرێنه ناو ئاگری دۆزه‌خه‌وه‌.",
            "verse 83:17": "Wê hej paş da ji bona wan ra aha bêgotinê: \"Ewa tişta ku wê pê bawer ne dikir, eva ye (îdî de ji şapata wê çeşne bikin)پاشان پێیان ده‌وترێت: ئائه‌مه ئه‌و شوێنه‌یه که بڕواتان پێی نه‌بوو به‌ڕاستتان نه‌ده‌زانی.",
            "verse 83:18": "Na! (wekî gotina we nîne) loma bi rastî nivîsara kirinê wanê qencîkarê, di jora bilinddan inنه‌خێر (ده‌سته‌ی سه‌رفرازان دوورن له‌و ته‌نگانه‌یه‌) به‌ڵکو نامه‌ی کرده‌وه‌کانیان، دۆسیه‌ی ڕه‌فتاریان وا له شوێنه به‌رزو بڵنده‌کاندا.",
            "verse 83:19": "(Muhemmed!) tu ji ku dizanî, ka jora bilind çîyeجا تۆ چووزانی (علیون) چیه‌و چۆنه‌.",
            "verse 83:20": "Ewa (jora bilind deftereke wusane) hemû kirinan tê da cî hildan eنامه‌یه‌کی (دیارو ئاشکرایه‌، هه‌ر به ڕواڵه‌تیدا دیاره که خاوه‌نی سه‌رفرازو به‌خته‌وه‌ره‌) مۆرکراوو لۆک کراویشه‌.",
            "verse 83:21": "Ewan (feriştene) nêzîk, nêhrewanî ya wî dikinئه‌و نامه‌یه فریشته نزیکه به‌ڕێزه‌کانی لای خوا ده‌یکه‌نه‌وه‌و (به‌سه‌رسامی و خۆشیه‌وه سه‌رنجی چاکه و خواپه‌رستی چاکان ده‌ده‌ن و) شایه‌تی له‌سه‌ر ده‌ده‌ن.",
            "verse 83:22": "Loma bi rastî qencîkar di (behişta) xurekadan inبه‌ڕاستی چاکان، خواناسان له‌ناو نازو نیعمه‌تدا ژیانی خۆشی و شادی ده‌به‌نه سه‌ر.",
            "verse 83:23": "Li ser kursîyan temaşa dikinله‌سه‌ر کورسی و قه‌نه‌فه ڕازاوه‌کان ته‌ماشای ده‌وروبه‌ری خۆیان ده‌که‌ن (سه‌رنجی دیمه‌نی جوان و باخات و باخچه و گوڵ و گوڵزارو تاڤگه و ڕووبارو نازو نیعمه‌ته نه‌بڕاوه و بێشوماره‌کان ده‌ده‌ن).",
            "verse 83:24": "Tu di rûyê wan da, şopa qencîyan nîyas dikîخۆشی و خۆشگوزه‌رانی ناسک په‌روه‌ری له ڕووخساریاندا ده‌بینیت.",
            "verse 83:25": "Ewan, bi meya devgirtî ye xurî tên e avdanêشه‌رابێکیان پێشکه‌ش ده‌کرێت، که پاک و سه‌رمۆره‌.",
            "verse 83:26": "Derxûnê wî miske (ya jî daw ya wê meyê misk e). Îdî bira dexes (di van xelatan da) dexesî bikinکه نۆشکرا بۆنی میسک ئه‌و ناوه پڕده‌کات، (پێچه‌وانه‌ی شه‌رابی دنیایه که بخۆرو ده‌وروبه‌ریش بۆگه‌ن ده‌کات)، جا با له پێناوی ئه‌وه‌دا پێشبڕکێکه‌ران پێشبڕکێ بکه‌ن.",
            "verse 83:27": "Pê vexwarina wê (meyî) meya bi nav Tensîm eهه‌روه‌ها ئه‌و شه‌رابه ئاوێته‌که‌ی له (تسنیم)ه‌.",
            "verse 83:28": "Ewa (Tensîm a) kanyeke wusane, ji wê (kanîyê) hey ewanê nêzîkê (Yezdan) vedixun(تسنیم) یش سه‌رچاوه‌یه‌که ته‌نها خۆشه‌ویستان و نزیککراوه‌کان لێی ده‌خۆنه‌وه‌.",
            "verse 83:29": "Bi rastî ewanê gunehkarî dikirin hene! Ewanan, bi wanê bawer kiribûn e dikenîyanبێگومان ئه‌وانه‌ی که تاوانیان ده‌کرد گاڵته‌یان به ئیمانداران ده‌هات و پێیان پێده‌که‌نین.",
            "verse 83:30": "Gava ewanê (gunehkar) li bal wanê (bawerker da) diborîn li hev mêze dikin çav diniqîn in (bi bawerkeran tinazan dikin)کاتێکیش به‌لایاندا تێپه‌ڕ بوونایه ده‌یانکرده چپه‌چپ و سرته سرت و به چاو ئیشاره‌تیان ده‌کرد.",
            "verse 83:31": "Û gava (ewan gunehkaran) li bal malînê xwe da zivirîn e, ewan bi xweşî (bawerkeran) di nava xwe da bi ken mijûl dibinکاتێکیش ده‌گه‌ڕانه‌وه بۆ باڵه‌وه، به‌ده‌م پێکه‌نین و گاڵته‌وه ده‌گه‌ڕانه‌وه (هه‌ر باسیان ده‌کردن)...",
            "verse 83:32": "Û gava (ewan gunehkaran, bawerker) dîtin e; ji hev ra (aha) gotin e: \"Bi rastî evan (bawerkeran) rêya xwe wunda kirin eکاتێکیش ئیمانداران ده‌بیننه‌وه‌، ده‌ڵێن: به‌ڕاستی ئه‌وانه گومران و له‌ڕێگه‌ی باو وباپیران لایانداوه‌!!",
            "verse 83:33": "Ewan (gunehkaran dizan in) ku bi dîdevanî li ser wan (bawerkeran) ne hatin e şandinê, ji bo ku ewan biparisîn inخۆ ئه‌و خوانه‌ناسانه ڕه‌وانه نه‌کراون تا چاودێربن به‌سه‌ر ئیماندارانه‌وه‌.",
            "verse 83:34": "Îdî di îro da jî ewanê bawer kirin e hene! ewan (bi wanê gunehkar) di ken in(ئه‌مڕۆ ئیتر نۆره‌ی ئیماندارانه‌) جا ئه‌مڕۆ ئه‌وانه‌ی باوه‌ڕدار بوون به‌کافران پێده‌که‌نن.",
            "verse 83:35": "Ewan (bawerkeran) li ser textegahan (li wan filan) mêze dikinله‌سه‌ر کورسی و قه‌نه‌فه (ڕازاوه‌کان) ته‌ماشا ده‌که‌ن (دۆزه‌خیه‌کان ده‌بینن له‌سه‌ر شاشه‌ی تایبه‌تی پێیان ده‌ڵێن):",
            "verse 83:36": "Çane! (ka mêze bikin) gelo filan gerewa kirinên xweyên dikiribûn e, dîtin eباشه ئایا کافران پاداشتی ئه‌وه‌ی که ده‌یانکرد درانه‌وه‌؟!"
        },
        "Kyrgyz": {
            "verse 83:1": "Таразадан алдагандарга чоң азап болсун",
            "verse 83:2": "Алар адамдардан (бир нерсени) өлчөтүп (же тарттырып) алган кезде толтуруп алышат дагы",
            "verse 83:3": "Бирөөлөргө өлчөп же тартып бергенде кемитип беришет",
            "verse 83:4": "Алар кайра тирилүүлөрүн ойлонушпайт бекен",
            "verse 83:5": "Улуу Күн — Кыяматта",
            "verse 83:6": "Ал күнү (бардык) адамдар ааламдардын Раббисинин алдында (сурак берүү үчүн) тикесинен туруп калышат",
            "verse 83:7": "Жок! Бузукулардын амал китептери «Сижжийнде» экени анык",
            "verse 83:8": "(О, Мухаммад!) сен «Сижжийн» эмне экенин билбейсиң",
            "verse 83:9": "Ал— жазылган китеп",
            "verse 83:10": "Ал (Кыямат) күндө (аны) жалган дегендерге чоң азап берилет",
            "verse 83:11": "Алар сурак күндү жалган дегендер",
            "verse 83:12": "Ал күндү ар бир чектен чыккан, күнөөгө баткан (каапыр) пенделер «жалган» дешет",
            "verse 83:13": "А(лар)га Биздин аяттарыбыз окуп берилген кезде «(бул) байыркылардын жөө жомогу» дешет",
            "verse 83:14": "Жок, тескерисинче, жасаган (күнөө) иштери жүрөктөрүн ороп алган",
            "verse 83:15": "Чынында, ошол (Кыямат) күнү алар Раббилеринен тосулган болушат",
            "verse 83:16": "Андан соң, алар тозокко ташталышат",
            "verse 83:17": "Кийин аларга: «Силер аны «жалган» деген нерсе (тозок) ушул!»-деп айтылат",
            "verse 83:18": "Чынында, жакшы пенделердин китептери? «Иллийюнда»",
            "verse 83:19": "(О, Мухаммад!) Сен «Иллийюн» эмне экенин билбейсиң",
            "verse 83:20": "(Ал) - жазылган китеп",
            "verse 83:21": "Аны (Аллаһка) жакындар (периштелер) көрүп турат",
            "verse 83:22": "Жакшы (ыймандуу) пенделер «Наим» (деп аталган) бейиштерде",
            "verse 83:23": "Сөрүлөрдүн үстүндө (бейиш нээматтарына) карап олтурушат",
            "verse 83:24": "Сен алардын жүздөрүнөн «Наим» бейишинин кубаныч-таасирин көрөсүң",
            "verse 83:25": "Аларга (мас кылуу кесепетинен) сакталган таттуу шараптар ичирилет",
            "verse 83:26": "Ал шараптын сактагычы -«миск»!. Эми, ушул нерсе үчүн жарышкандар жарышсын",
            "verse 83:27": "Ал шараптын (дагы бир) аралашмасы «таснимден»",
            "verse 83:28": "(Тасним - бул) Аллаһка эң жакын болгон пенделер гана иче ала турган булак",
            "verse 83:29": "Ал эми, күнөөкөр адамдар (бул дүйнөдө) ыймандуу кишилердин үстүнөн күлгөн",
            "verse 83:30": "(Ыймандуулар) алардын жанынан өткөндө, (бири-бирине) ымдап көргөзүп, шылдыңдашкан",
            "verse 83:31": "Үй-бүлөсүнө кайтканда (мыскылдагандан ырахат алып) кубанычтуу кайтышкан",
            "verse 83:32": "Эгер аларды көрүп калса, «Булар-адашкандар» деп айтышкан",
            "verse 83:33": "Алар (каапырлар) аларга (ыймандууларга) кароолчу кылып жиберилбегенго",
            "verse 83:34": "Эми, ал (Кыямат) күндө болсо, ыйман келтиргендер каапырлардын үстүнөн күлүшөт",
            "verse 83:35": "(жана) сөрүлөрдүн үстүндө (бейиш нээматтарына) карап (жыргап) отурушат",
            "verse 83:36": "Каапырлар жасаган (күнөө) иштерине сооп алмак беле"
        },
        "Malay": {
            "verse 83:1": "Kecelakaan besar bagi orang-orang yang curang (dalam timbangan dan sukatan),",
            "verse 83:2": "Iaitu mereka yang apabila menerima sukatan (gantang cupak) dari orang lain mereka mengambilnya dengan cukup,",
            "verse 83:3": "Dan (sebaliknya) apabila mereka menyukat atau menimbang untuk orang lain, mereka kurangi.",
            "verse 83:4": "Tidakkah mereka menyangka bahawa mereka akan dibangkitkan (hidup semula sesudah mati)?",
            "verse 83:5": "Pada hari (kiamat) yang amat besar (huru-haranya),",
            "verse 83:6": "Hari berdiri manusia untuk mengadap Tuhan sekalian alam?",
            "verse 83:7": "Tidak sepatutnya (mereka melakukan perbuatan yang salah itu dan melalaikan hari akhirat)! Sesungguhnya \"kitab suratan amal\" orang-orang yang berdosa itu (didaftarkan) dalam \"Sijjiin\".",
            "verse 83:8": "Dan apa jalannya engkau dapat mengetahui: apa dia \"Sijjiin\" itu,",
            "verse 83:9": "Ialah (tempat simpanan) kitab catitan yang jelas nyata, (yang menghimpunkan amalan orang-orang yang berdosa).",
            "verse 83:10": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan -",
            "verse 83:11": "Iaitu mereka yang mendustakan hari pembalasan.",
            "verse 83:12": "Dan tiada yang mendustakannya melainkan tiap-tiap orang yang melampaui batas (kebenaran), lagi amat derhaka!",
            "verse 83:13": "(Sehingga) apabila ia dibacakan kepadanya ayat-ayat Kami, ia berkata:\" Ini ialah dongeng orang-orang dahulu kala!\"",
            "verse 83:14": "Sebenarnya! (Ayat-ayat Kami itu tidak ada cacatnya) bahkan mata hati mereka telah diselaputi kekotoran (dosa), dengan sebab (perbuatan kufur dan maksiat) yang mereka kerjakan.",
            "verse 83:15": "Jangan lagi mereka berlaku demikian! (kalau tidak), mereka pada hari itu, tetap terdinding dari (rahmat) Tuhannya.",
            "verse 83:16": "Kemudian, sesungguhnya mereka akan menderita bakaran neraka.",
            "verse 83:17": "Akhirnya dikatakan (kepada mereka): \"Inilah dia (azab seksa) yang kamu dustakan dahulu.\"",
            "verse 83:18": "Ingatlah wahai manusia! Sesungguhnya \"kitab suratan amal\" orang-orang yang berbakti (dengan taat dan amal kebajikan), adalah (didaftarkan) dalam\" Illiyiin\".",
            "verse 83:19": "Dan apa jalannya engkau dapat mengetahui, apa dia \"Illiyiin\" itu?",
            "verse 83:20": "Ialah (tempat simpanan) kitab catitan yang jelas nyata,",
            "verse 83:21": "Yang disaksikan oleh sekumpulan malaikat, yang didampingkan Tuhan di sisinya.",
            "verse 83:22": "Sesungguhnya orang-orang yang berbakti (dengan taat dan amal kebajikan), tetap berada di dalam Syurga yang penuh nikmat:",
            "verse 83:23": "Mereka berehat di atas pelamin-pelamin (yang berhias), sambil melihat (segala keindahan dan kemuliaan yang disediakan untuk mereka di situ).",
            "verse 83:24": "Engkau dapat melihat pada muka mereka: cahaya nikmat yang mereka perolehi.",
            "verse 83:25": "Mereka diberi minum dari satu minuman yang termeterai bekasnya,",
            "verse 83:26": "Meterainya kasturi; - dan untuk (memperolehi nikmat kesenangan) itu hendaknya berlumba-lumba mereka yang ingin merebut kelebihan dan kesenangan;",
            "verse 83:27": "Dan campuran minuman itu adalah dari \"Tasnim\":",
            "verse 83:28": "laitu matair yang diminum daripadanya oleh orang-orang yang di dampingkan (Tuhan di sisiNya).",
            "verse 83:29": "Sesungguhnya orang-orang yang derhaka, mereka selalu tertawakan orang-orang yang beriman.",
            "verse 83:30": "Dan apabila orang-orang yang beriman lalu dekat mereka, mereka mengerling dan memejam celikkan mata sesama sendiri (mencemuhnya).",
            "verse 83:31": "Dan apabila mereka kembali kepada kaum keluarganya, mereka kembali dengan riang gembira;",
            "verse 83:32": "Dan apabila mereka melihat orang-orang yang beriman, mereka berkata: \"Sesungguhnya orang-orang itu adalah golongan yang sesat!\"",
            "verse 83:33": "Pada hal mereka tidak diutus untuk menjaga sesat atau tidaknya orang-orang yang beriman itu!",
            "verse 83:34": "Maka pada hari ini, orang-orang yang beriman pula tertawakan orang yang kafir itu.",
            "verse 83:35": "Sambil mereka berehat di atas pelamin-pelamin (yang berhias), serta melihat (hal yang berlaku kepada musuhnya).",
            "verse 83:36": "(Untuk menambahkan kegembiraan mereka, mereka ditanya): \"Bukankah orang-orang yang kafir itu telah dibalas akan apa yang mereka telah kerjakan dahulu?\""
        },
        "Malayalam": {
            "verse 83:1": "അളവില്‍ കുറക്കുന്നവര്‍ക്ക് മഹാനാശം",
            "verse 83:2": "അതായത് ജനങ്ങളോട് അളന്നുവാങ്ങുകയാണെങ്കില്‍ തികച്ചെടുക്കുകയും.",
            "verse 83:3": "ജനങ്ങള്‍ക്ക് അളന്നുകൊടുക്കുകയോ തൂക്കികൊടുക്കുകയോ ആണെങ്കില്‍ നഷ്ടം വരുത്തുകയും ചെയ്യുന്നവര്‍ക്ക്‌.",
            "verse 83:4": "അക്കൂട്ടര്‍ വിചാരിക്കുന്നില്ലേ; തങ്ങള്‍ എഴുന്നേല്‍പിക്കപ്പെടുന്നവരാണെന്ന്‌?",
            "verse 83:5": "ഭയങ്കരമായ ഒരു ദിവസത്തിനായിട്ട്‌",
            "verse 83:6": "അതെ, ലോകരക്ഷിതാവിങ്കലേക്ക് ജനങ്ങള്‍ എഴുന്നേറ്റ് വരുന്ന ദിവസം.",
            "verse 83:7": "നിസ്സംശയം; ദുര്‍മാര്‍ഗികളുടെ രേഖ സിജ്ജീനില്‍ തന്നെയായിരിക്കും.",
            "verse 83:8": "സിജ്ജീന്‍ എന്നാല്‍ എന്താണെന്ന് നിനക്കറിയാമോ?",
            "verse 83:9": "എഴുതപ്പെട്ട ഒരു ഗ്രന്ഥമാകുന്നു അത്‌.",
            "verse 83:10": "അന്നേ ദിവസം നിഷേധിച്ചു തള്ളുന്നവര്‍ക്കാകുന്നു നാശം.",
            "verse 83:11": "അതായത് പ്രതിഫല നടപടിയുടെ ദിവസത്തെ നിഷേധിച്ചു തള്ളുന്നവര്‍ക്ക്‌.",
            "verse 83:12": "എല്ലാ അതിരുവിട്ടവനും മഹാപാപിയുമായിട്ടുള്ളവനല്ലാതെ അതിനെ നിഷേധിച്ചു തള്ളുകയില്ല.",
            "verse 83:13": "അവന്ന് നമ്മുടെ ദൃഷ്ടാന്തങ്ങള്‍ ഓതികേള്‍പിക്കപ്പെടുകയാണെങ്കില്‍ അവന്‍ പറയും; പൂര്‍വ്വികന്‍മാരുടെ ഐതിഹ്യങ്ങളാണെന്ന്‌.",
            "verse 83:14": "അല്ല; പക്ഷെ, അവര്‍ പ്രവര്‍ത്തിച്ചുക്കൊണ്ടിരിക്കുന്നത് അവരുടെ ഹൃദയങ്ങളില്‍ കറയുണ്ടാക്കിയിരിക്കുന്നു.",
            "verse 83:15": "അല്ല; തീര്‍ച്ചയായും അവര്‍ അന്നേ ദിവസം അവരുടെ രക്ഷിതാവില്‍ നിന്ന് മറയ്ക്കപ്പെടുന്നവരാകുന്നു.",
            "verse 83:16": "പിന്നീടവര്‍ ജ്വലിക്കുന്ന നരകാഗ്നിയില്‍ കടന്നെരിയുന്നവരാകുന്നു.",
            "verse 83:17": "പിന്നീട് പറയപ്പെടും; ഇതാണ് നിങ്ങള്‍ നിഷേധിച്ചുതള്ളിക്കൊണ്ടിരുന്ന കാര്യം.",
            "verse 83:18": "നിസ്സംശയം; പുണ്യവാന്‍മാരുടെ രേഖ ഇല്ലിയ്യൂനില്‍ തന്നെയായിരിക്കും.",
            "verse 83:19": "ഇല്ലിയ്യൂന്‍ എന്നാല്‍ എന്താണെന്ന് നിനക്കറിയുമോ?",
            "verse 83:20": "എഴുതപ്പെട്ട ഒരു രേഖയത്രെ അത്‌.",
            "verse 83:21": "സാമീപ്യം സിദ്ധിച്ചവര്‍ അതിന്‍റെ അടുക്കല്‍ സന്നിഹിതരാകുന്നതാണ്‌.",
            "verse 83:22": "തീര്‍ച്ചയായും സുകൃതവാന്‍മാര്‍ സുഖാനുഭവത്തില്‍ തന്നെയായിരിക്കും.",
            "verse 83:23": "സോഫകളിലിരുന്ന് അവര്‍ നോക്കിക്കൊണ്ടിരിക്കും.",
            "verse 83:24": "അവരുടെ മുഖങ്ങളില്‍ സുഖാനുഭവത്തിന്‍റെ തിളക്കം നിനക്കറിയാം.",
            "verse 83:25": "മുദ്രവെക്കപ്പെട്ട ശുദ്ധമായ മദ്യത്തില്‍ നിന്ന് അവര്‍ക്ക് കുടിക്കാന്‍ നല്‍കപ്പെടും.",
            "verse 83:26": "അതിന്‍റെ മുദ്ര കസ്തൂരിയായിരിക്കും. വാശി കാണിക്കുന്നവര്‍ അതിന് വേണ്ടി വാശി കാണിക്കട്ടെ.",
            "verse 83:27": "അതിലെ ചേരുവ തസ്നീം ആയിരിക്കും.",
            "verse 83:28": "അതായത് സാമീപ്യം സിദ്ധിച്ചവര്‍ കുടിക്കുന്ന ഒരു ഉറവ് ജലം.",
            "verse 83:29": "തീര്‍ച്ചയായും കുറ്റകൃത്യത്തില്‍ ഏര്‍പെട്ടവര്‍ സത്യവിശ്വാസികളെ കളിയാക്കി ചിരിക്കുമായിരുന്നു.",
            "verse 83:30": "അവരുടെ (സത്യവിശ്വാസികളുടെ) മുമ്പിലൂടെ കടന്നു പോകുമ്പോള്‍ അവര്‍ പരസ്പരം കണ്ണിട്ടു കാണിക്കുമായിരുന്നു.",
            "verse 83:31": "അവരുടെ സ്വന്തക്കാരുടെ അടുക്കലേക്ക് തിരിച്ചുചെല്ലുമ്പോള്‍ രസിച്ചു കൊണ്ട് അവര്‍ തിരിച്ചുചെല്ലുമായിരുന്നു.",
            "verse 83:32": "അവരെ (സത്യവിശ്വാസികളെ) അവര്‍ കാണുമ്പോള്‍, തീര്‍ച്ചയായും ഇക്കൂട്ടര്‍ വഴിപിഴച്ചവര്‍ തന്നെയാണ് എന്ന് അവര്‍ പറയുകയും ചെയ്യുമായിരുന്നു.",
            "verse 83:33": "അവരുടെ (സത്യവിശ്വാസികളുടെ) മേല്‍ മേല്‍നോട്ടക്കാരായിട്ട് അവര്‍ നിയോഗിക്കപ്പെട്ടിട്ടൊന്നുമില്ല.",
            "verse 83:34": "എന്നാല്‍ അന്ന് (ഖിയാമത്ത് നാളില്‍) ആ സത്യവിശ്വാസികള്‍ സത്യനിഷേധികളെ കളിയാക്കി ചിരിക്കുന്നതാണ്‌.",
            "verse 83:35": "സോഫകളിലിരുന്ന് അവര്‍ നോക്കിക്കൊണ്ടിരിക്കും.",
            "verse 83:36": "സത്യനിഷേധികള്‍ ചെയ്തു കൊണ്ടിരുന്നതിന് അവര്‍ക്ക് പ്രതിഫലം നല്‍കപ്പെട്ടുവോ എന്ന്‌."
        },
        "Norwegian": {
            "verse 83:1": "Ve dem som snyter!",
            "verse 83:2": "Som når de tilmåles av folk, krever fullt mål,",
            "verse 83:3": "men når de måler ut til dem eller veier til dem, så snyter de.",
            "verse 83:4": "Tror ikke disse at de blir gjenoppvekket",
            "verse 83:5": "til en svær dag,",
            "verse 83:6": "den dag da menneskene skal stå frem for all verdens Herre?",
            "verse 83:7": "Så sannelig, de syndefulles bok er i Sidsjin.",
            "verse 83:8": "Men hvordan kan du vite hva Sidsjin er?",
            "verse 83:9": "Det er en fullskreven bok.",
            "verse 83:10": "Ve dem som holder sannhet for løgn på denne dag!",
            "verse 83:11": "Som fornekter dommens dag!",
            "verse 83:12": "Ingen fornekter den, unntatt enhver som går over grensen, full av synd.",
            "verse 83:13": "Når Vårt ord fremleses for ham, sier han: «Fabler fra gamle dager!»",
            "verse 83:14": "Nei så sannelig, det de har bedrevet, har rustet fast på deres hjerter!",
            "verse 83:15": "Sannelig, på hin dag skal de stenges ute fra Herren,",
            "verse 83:16": "og så skal de havne i helvete.",
            "verse 83:17": "Så lyder det: «Dette er det dere fornektet!»",
            "verse 83:18": "Så sannelig, de frommes bok er i Illiyun.",
            "verse 83:19": "Men hvordan kan du vite hva Illiyun er?",
            "verse 83:20": "Det er en fullskreven bok,",
            "verse 83:21": "som de som er Gud nær, bevitner.",
            "verse 83:22": "De fromme skal visselig være i lykksalighet.",
            "verse 83:23": "På hvileleier lar de blikket streife,",
            "verse 83:24": "og du ser i deres ansikter i lykksalighetens glans.",
            "verse 83:25": "De får forseglet, edel vin å drikke,",
            "verse 83:26": "dens segl er moskus, og måtte alle lengtende lengte etter dette!",
            "verse 83:27": "Dens blanding er fra Tasnim,",
            "verse 83:28": "en kilde hvorav de drikker som er Gud nær.",
            "verse 83:29": "Sannelig, synderne lo av de troende,",
            "verse 83:30": "og når de gikk forbi dem, blunket de til hverandre,",
            "verse 83:31": "og når de kom hjem til sine egne, var de glade og fornøyde.",
            "verse 83:32": "Og når de så dem, sa de: «Disse er helt på villspor!»",
            "verse 83:33": "Men de var ikke sendt som voktere over dem!",
            "verse 83:34": "Så på denne dag ler de troende av de vantro,",
            "verse 83:35": "der de ligger på hvileleier og lar blikket streife.",
            "verse 83:36": "Er ikke de vantro blitt belønnet for det de bedrev?"
        },
        "Pashto": {
            "verse 83:1": "(په تول او پېمانه كې) كمي كوونكو لره هلاكت دى",
            "verse 83:2": "هغه كسان چې دوى له خلقو نه ځان ته پېمانه اخلي (، نو) پوره (يې) اخلي",
            "verse 83:3": "او كله چې دغو (خلقو) ته پېمانه وركوي، یا يې دوى ته تلي (، نو) كمى كوي",
            "verse 83:4": "ایا دغه خلق یقین نه كوي چې بېشكه دوى به بیا راژوندي كول شي",
            "verse 83:5": "په ډېره لویه ورځ كې (د حساب لپاره)",
            "verse 83:6": "هغه ورځ چې خلق به ’’رب العلمین‘‘ ته ودرېږي",
            "verse 83:7": "هیڅكله داسې نه ده په كار، بېشكه د فاجرانو (كافرانو) كتاب (لیكل شوي عملونه) خامخا په سجین كې دي",
            "verse 83:8": "او ته څه شي پوه كړې چې سجین څه شى دى",
            "verse 83:9": "یو دفتر (كتاب) دى لیكل شوى",
            "verse 83:10": "په دغې ورځ كې د دروغ ګڼونكو لپاره هلاكت دى",
            "verse 83:11": "هغه كسان چې د بدلې ورځ دروغ ګڼي",
            "verse 83:12": "او دغه (ورځ) دروغ نه ګڼي مګر هر زیاتي كوونكى، سخت ګناه ګار",
            "verse 83:13": "كله چې ده ته زمونږ ایتونه تلاوت كولى شي؛ دى وايي: (دا) د ړومبنیو (خلقو) باطلې قصې دي",
            "verse 83:14": "داسې نه ده، بلكې د دوى په زړونو باندې هغو (د ګناه عملونو) زنګ لګولى دى چې دوى به كول",
            "verse 83:15": "داسې نه ده په كار، بېشكه دوى به په دغې ورځ كې له خپل رب نه یقینًا په حجاب (بند) كړى شوي وي",
            "verse 83:16": "بیا بېشكه دوى یقینًا دوزخ ته ننوتونكي دي",
            "verse 83:17": "بیا به (دوى ته) ویلى شي: دا هغه (دوزخ) دى چې تاسو به دا دروغ ګاڼه",
            "verse 83:18": "داسې نه ده، بېشكه د نېكانو (خلقو) عملنامې (لیكلى كتاب) خامخا په ’’علِّیین‘‘ كې دي",
            "verse 83:19": "او ته څه شي پوه كړې چې ’’علّیون‘‘ څه شى دى",
            "verse 83:20": "یو دفتر (كتاب) دى چې لیكل شوى دى",
            "verse 83:21": "چې ده ته مقرب (بنده ګان او ملايك) حاضرېږي",
            "verse 83:22": "بېشكه نېكان خلق یقینًا په نعمتونو كې دي",
            "verse 83:23": "دوى به په تختونو باندې (ناست) وي، ګوري به",
            "verse 83:24": "(اى كتونكیه!) ته به د دوى په مخونو كې د نعمتونو تازګي وینې",
            "verse 83:25": "په دوى به مُهر (ټاپه) كړى شوي خالص شراب څښولى شي",
            "verse 83:26": "چې د دغو مُهر (ټاپه) به مشك وي، او په دغه (نعمتونو) كې، پس په كار ده چې رغبت كوونكي رغبت وكړي",
            "verse 83:27": "د دغو (شرابو) ګډون له تسنیم (چينې) څخه دى",
            "verse 83:28": "چې یوه چینه ده چې له دې نه به (د الله) مقربین څښي",
            "verse 83:29": "بېشكه هغه كسان چې جرم (د كفر) يې كړى دى۔، دوى به په هغو كسانو پورې خندا كوله چې ایمان يې راوړى و",
            "verse 83:30": "او كله چې به د دوى (مومنانو) په خوا كې تېرېدل (نو) په خپلو منځونو كې به يې سترګكونه وهل",
            "verse 83:31": "او كله چې به دوى خپلو كورونو ته واپس كېدل (نو) خوشاله به واپس كېدل",
            "verse 83:32": "او كله چې به دوى دغه (مسلمانان) وليدل (نو) ويل به يې: بېشكه دغه خلق یقینًا ګمراهان دي",
            "verse 83:33": "حال دا چې دوى په دغو (مومنانو) باندې نګرانان (څوكيداران) نه وو لېږل شوي",
            "verse 83:34": "نو په نن ورځ به هغه كسان چې ایمان يې راوړى دى؛ په كافرانو پورې خندا كوي",
            "verse 83:35": "په تختونو باندې به ناست وي، چې ګوري به",
            "verse 83:36": "یقینًا كافرانو ته د هغه څه بدله وركړى شوه چې دوى به كول"
        },
        "Persian": {
            "verse 83:1": "واى بر كم‌فروشان.",
            "verse 83:2": "آنان كه چون از مردم كيل مى‌ستانند آن را پُر مى‌كنند؛",
            "verse 83:3": "و چون براى مردم مى‌پيمايند يا مى‌كشند از آن مى‌كاهند.",
            "verse 83:4": "آيا اينان نمى‌دانند كه زنده مى‌شوند.",
            "verse 83:5": "در آن روز بزرگ؟",
            "verse 83:6": "روزى كه مردم به پيشگاه پروردگار جهانيان مى‌ايستند.",
            "verse 83:7": "آگاه باشيد كه اعمال بدكاران مكتوب در سِجّين است.",
            "verse 83:8": "تو چه مى‌دانى كه سجين چيست؟",
            "verse 83:9": "كتابى است نوشته.",
            "verse 83:10": "در آن روز واى بر تكذيب‌كنندگان:",
            "verse 83:11": "آنان كه روز جزا را دروغ انگاشتند.",
            "verse 83:12": "و آن روز را جز متجاوزى گناهكار دروغ نينگارد.",
            "verse 83:13": "چون آيات ما بر او خوانده شد، گفت: افسانه‌هاى پيشينيان است.",
            "verse 83:14": "حقا، كه كارهايى كه كرده بودند بر دلهاشان مسلط شده است.",
            "verse 83:15": "حقا، كه در آن روز از پروردگارشان محجوب باشند.",
            "verse 83:16": "پس ايشان به جهنم درآيند.",
            "verse 83:17": "و آنها را گويند: اين است آنچه دروغش مى‌شمرديد.",
            "verse 83:18": "حقا، كه اعمال نيكان در عِلّيّين مكتوب است.",
            "verse 83:19": "و تو چه مى‌دانى كه عِلّيّين چيست؟",
            "verse 83:20": "كتابى است نوشته،",
            "verse 83:21": "كه مقربان خدا در آن مى‌نگرند.",
            "verse 83:22": "هر آينه نيكان در نعمتند،",
            "verse 83:23": "بر تختها نشسته و نظاره مى‌كنند.",
            "verse 83:24": "بر چهره‌هاشان طراوت نعمت را بشناسى.",
            "verse 83:25": "از شرابى خالص كه بر سر آن مُهر نهاده‌اند سيراب مى‌شوند.",
            "verse 83:26": "مُهر آن از مشك است و پيشدستى‌كنندگان در آن بر يكديگر پيشدستى مى‌كنند.",
            "verse 83:27": "آميزه آن تَسنيم است.",
            "verse 83:28": "چشمه‌اى است كه مقربان خدا از آن مى‌آشامند.",
            "verse 83:29": "گناهكاران به مؤمنان مى‌خنديدند.",
            "verse 83:30": "و چون بر آنها مى‌گذشتند، به چشم و ابرو اشاره مى‌كردند.",
            "verse 83:31": "و چون نزد كسانشان بازمى‌گشتند، شادمانه بازمى‌گشتند.",
            "verse 83:32": "و چون آنان را مى‌ديدند، مى‌گفتند كه اينان گمراهند.",
            "verse 83:33": "و حال آنكه آنان را به مواظبت اعمال مؤمنان نفرستاده بودند.",
            "verse 83:34": "و امروز مؤمنان به كافران مى‌خندند.",
            "verse 83:35": "بر تختها تكيه زده‌اند و مى‌نگرند.",
            "verse 83:36": "آيا كافران برابر اعمالشان پاداش يافته‌اند؟"
        },
        "Polish": {
            "verse 83:1": "Biada oszustom!",
            "verse 83:2": "Tym, którzy kiedy otrzymują, domagają się od ludzi pełnej miary;",
            "verse 83:3": "A kiedy mierzą lub ważą dla nich, to przyczyniają się do ich straty.",
            "verse 83:4": "Czyż oni nie myślą, iż będą wskrzeszeni",
            "verse 83:5": "Dnia wielkiego,",
            "verse 83:6": "Dnia, kiedy ludzie staną przed Panem światów?",
            "verse 83:7": "Wcale nie! Zaprawdę, księga ludzi występnych znajduje się w Sidżdżinie!",
            "verse 83:8": "A co ciebie pouczy, co to jest Sidżdżin?",
            "verse 83:9": "To jest księga zapisana.",
            "verse 83:10": "Biada tego Dnia tym, którzy pomawiają o kłamstwo;",
            "verse 83:11": "Tym, którzy uważają za kłamstwo Dzień Sądu!",
            "verse 83:12": "Za kłamstwo uważa go tylko każdy człowiek występny, grzeszny.",
            "verse 83:13": "Kiedy mu recytują Nasze znaki, on mówi: \"To są baśnie praojców!\"",
            "verse 83:14": "Ależ nie! Przeciwnie, rdza uczynków pokryła ich serca.",
            "verse 83:15": "Wcale nie! Zaprawdę, oni tego Dnia będą oddzieleni od swego Pana!",
            "verse 83:16": "Potem będą się palić w piekle!",
            "verse 83:17": "Wtedy będzie im powiedziane: \"To jest to, co uważaliście za kłamstwo!\"",
            "verse 83:18": "Wcale nie tak! Zaprawdę, księga sprawiedliwych jest w Illijjun!",
            "verse 83:19": "A co ciebie pouczy, co to jest Illijjun?",
            "verse 83:20": "To jest księga zapisana.",
            "verse 83:21": "Będą świadkami jej owi blisko dopuszczeni.",
            "verse 83:22": "Zaprawdę, sprawiedliwi zaznają szczęśliwości;",
            "verse 83:23": "Spoczywając na łożach, będą spoglądać;",
            "verse 83:24": "Na ich twarzach poznasz blask szczęśliwości.",
            "verse 83:25": "Będą pojeni winem szlachetnym, pieczętowanym;",
            "verse 83:26": "Pieczęcią jego będzie piżmo - niech się starają pragnący tego, współzawodnicząc pilnie w staraniach -",
            "verse 83:27": "A domieszką jego będzie woda z Tasnim",
            "verse 83:28": "- źródła, z którego pić będą owi blisko dopuszczeni.",
            "verse 83:29": "Zaprawdę, ci, którzy zgrzeszyli, naśmiewali się z tych, którzy uwierzyli;",
            "verse 83:30": "Kiedy przechodzili mimo nich, wymieniali między sobą spojrzenia;",
            "verse 83:31": "A kiedy powracali do swoich domowników, stroili żarty.",
            "verse 83:32": "A kiedy ich widzieli, mówili: \"Zaprawdę, oni są zbłąkani!\"",
            "verse 83:33": "Lecz oni nie zostali posłani, aby być ich stróżami.",
            "verse 83:34": "Jednak dzisiaj ci, którzy uwierzyli, śmieją się z niewiernych;",
            "verse 83:35": "Spoczywając na łożach, spoglądają.",
            "verse 83:36": "Czyż niewierni zostali wynagrodzeni za to, co czynili?"
        },
        "Portuguese": {
            "verse 83:1": "Ai dos fraudadores,",
            "verse 83:2": "Aqueles que, quando alguém lhes mede algo, exigem a medida plena.",
            "verse 83:3": "Porém, quando eles medem ou pesam para os demais, burlam-nos.",
            "verse 83:4": "Porventura, não consideram que serão ressuscitados,",
            "verse 83:5": "Para o Dia terrível?",
            "verse 83:6": "Dia em que os seres comparecerão perante o Senhor do Universo?",
            "verse 83:7": "Qual! Sabei que o registro dos ignóbeis estará preservado em Sijjin.",
            "verse 83:8": "E o que te fará entender o que é Sijjin?",
            "verse 83:9": "É um registro escrito",
            "verse 83:10": "Ai, nesse dia, dos desmentidores!",
            "verse 83:11": "Que negam o Dia do Juízo,",
            "verse 83:12": "Coisa que ninguém nega, senão o transgressor, pecador.",
            "verse 83:13": "É aquele que, quando lhe são recitados os Nossos versículos, diz: São meras fábulas dos primitivos!",
            "verse 83:14": "Qual! Em seus corações há a ignomínia, pelo que cometeram.",
            "verse 83:15": "Qual! Em verdade, nesse dia, estar-lhes-á vedado contemplar o seu Senhor.",
            "verse 83:16": "Então, entrarão na fogueira.",
            "verse 83:17": "Em seguida, ser-lhes-á dito: Esta é a (realidade) que negáveis!",
            "verse 83:18": "Qual! Sabei que o registro dos piedosos está preservado em Il'lilin!",
            "verse 83:19": "E o que te fará entender o que é Il'lilin?",
            "verse 83:20": "É um registro manuscrito,",
            "verse 83:21": "Atestado por aqueles que estão próximos (ao seu Senhor).",
            "verse 83:22": "Em verdade, os piedosos estarão em deleite,",
            "verse 83:23": "Reclinados sobre almofadas, olhando-se de frente.",
            "verse 83:24": "Reconhecerás, em seus rostos o esplendor do deleite.",
            "verse 83:25": "Ser-lhes-á dado a beber um néctar (de um frasco) lacrado,",
            "verse 83:26": "Cujo lacre será de almíscar - que os que aspiram a isso rivalizem em aspirá-lo -",
            "verse 83:27": "Em cuja mistura vem do Tasnim,",
            "verse 83:28": "Que é uma fonte, da qual beberão os que estão próximos (a Deus).",
            "verse 83:29": "Sabei que os pecadores burlavam os fiéis.",
            "verse 83:30": "E quando passavam junto a eles, piscavam os olhos, uns para os outros,",
            "verse 83:31": "E quando voltavam aos seus, voltavam ridicularizando (os fiéis);",
            "verse 83:32": "E quando os viam, diziam: Em verdade, estes estão extraviados!",
            "verse 83:33": "Embora não estivessem destinados a ser os seus guardiães.",
            "verse 83:34": "Porém, hoje, os fiéis rirão dos incrédulos.",
            "verse 83:35": "E, reclinados sobre almofadas, observarão.",
            "verse 83:36": "Acaso, os incrédulos não serão punidos, por tudo quanto tiverem cometido?"
        },
        "Punjabi": {
            "verse 83:1": "ਨਾਪ ਤੋਲ ਵਿਚ ਕਮੀ ਕਰਨ ਵਾਲਿਆਂ ਲਈ ਵਿਨਾਸ਼ ਹੈ।",
            "verse 83:2": "ਜਿਹੜੇ ਲੋਕਾਂ ਤੋਂ ਨਾਪ ਕੇ ਲੈਣ ਤਾਂ ਪੂਰਾ ਲੈਣ।",
            "verse 83:3": "ਅਤੇ ਜਦੋਂ ਉਨ੍ਹਾਂ ਨੂੰ ਨਾਪ ਕੇ ਜਾਂ ਤੋਲ ਕੇ ਦੇਣ ਤਾਂ ਘਟਾ ਕੇ ਦੇਣ।",
            "verse 83:4": "ਕੀ ਇਹ ਲੋਕ ਨਹੀਂ ਸਮਝਦੇ ਕਿ ਉਹ ਚੁੱਕੇ ਜਾਣ ਵਾਲੇ ਹਨ।",
            "verse 83:5": "ਇੱਕ ਵੱਡੇ ਦਿਨ ਨੂੰ।",
            "verse 83:6": "ਜਿਸ ਦਿਨ ਸਾਰੇ ਲੋਕ ਸੰਸਾਰ ਦੇ ਮਾਲਕ ਦੇ ਸਾਹਮਣੇ ਖੜ੍ਹੇ ਹੋਣਗੇ।",
            "verse 83:7": "ਕਦੇ ਵੀ ਨਹੀਂ, ਬੇਸ਼ੱਕ ਪਾਪੀਆਂ ਦਾ ਅਮਲਨਾਮਾ ਸਿੱਜੀਨ (ਨਰਕ ਦਾ ਇੱਕ ਭਾਗ) ਵਿਚ ਹੋਵੇਗਾ।",
            "verse 83:8": "ਅਤੇ ਤੁਸੀਂ ਕੀ ਸਮਝੋ ਕਿ ਸਿੱਜੀਨ ਕੀ ਹੈ।",
            "verse 83:9": "ਇਹ ਇੱਕ ਲਿਖਿਆ ਹੋਇਆ ਦਫ਼ਤਰ ਹੈ।",
            "verse 83:10": "ਉਸ ਦਿਨ ਇਨਕਾਰ ਕਰਨ ਵਾਲਿਆਂ ਲਈ ਵਿਨਾਸ਼ ਹੈ।",
            "verse 83:11": "ਜਿਹੜੇ ਇਨਸਾਫ਼ ਦੇ ਦਿਨ ਤੋਂ ਇਨਕਾਰ ਕਰਦੇ ਹਨ।",
            "verse 83:12": "ਅਤੇ ਉਸ ਤੋਂ ਉਹ ਹੀ ਬੰਦਾ ਇਨਕਾਰ ਕਰਦਾ ਹੈ, ਜਿਹੜਾ ਹੱਦਾਂ ਦਾ ਉਲੰਘਣ ਕਰਨ ਵਾਲਾ ਹੋਵੇ, ਪਾਪੀ ਹੋਵੇ।",
            "verse 83:13": "ਜਦੋਂ ਇਹ ਪਿਛਲਿਆਂ (ਹੋ ਚੁੱਕਿਆਂ) ਦੀਆਂ ਕਹਾਣੀਆਂ ਹਨ।",
            "verse 83:14": "ਕਦੇ ਵੀ ਨਹੀਂ, ਸਗੋਂ ਉਨ੍ਹਾਂ ਦੇ ਦਿਲਾਂ ਤੇ ਉਨ੍ਹਾਂ ਦੇ ਕਰਮਾਂ ਦਾ ਜ਼ੰਗ ਚੜ੍ਹ ਗਿਆ।",
            "verse 83:15": "ਕਦੇ ਵੀ ਨਹੀਂ, ਸਗੋਂ ਉਸ ਦਿਨ ਉਹ ਆਪਣੇ ਰੱਬ ਵੱਲੋਂ ਇਟ ਵਿਚ ਰੱਖੋ ਜਾਣਗੇ।",
            "verse 83:16": "ਫਿਰ ਉਹ ਨਰਕ ਵਿਚ ਦਾਖ਼ਿਲ ਹੋਣਗੇ।",
            "verse 83:17": "ਫਿਰ ਆਖਿਆ ਜਾਵੇਗਾ ਕਿ ਉਹ ਚੀਜ਼ ਹੈ, ਜਿਸ ਨੂੰ ਤੁਸੀਂ ਝੁਠਲਾਉਂਦੇ ਸੀ।",
            "verse 83:18": "ਕਦੇ ਵੀ ਨਹੀਂ, ਬੇਸ਼ੱਕ ਨੇਕ ਲੋਕਾਂ ਦਾ ਕਰਮ ਪੱਤਰ (ਅਮਲ) ਇੱਲੀਯੀ (ਨੇਕ ਲੋਕਾਂ ਦੇ ਅਮਲ ਰੱਖਣ ਦੀ ਥਾਂ) ਵਿਚ ਹਨ।",
            "verse 83:19": "ਅਤੇ ਤੁਸੀਂ ਕੀ ਜਾਣੋ ਕਿ ਇੱਲੀਯੀ ਕੀ ਹੈ।",
            "verse 83:20": "ਲਿਖਿਆ ਹੋਇਆ ਦਫ਼ਤਰ ਹੈ।",
            "verse 83:21": "ਜਿਸ ਦੇ ਨਜ਼ਦੀਕ ਉੱਚ ਕੌਟੀ ਦੇ ਫ਼ਰਿਸ਼ਤੇ ਹਾਜ਼ਿਰ ਰਹਿੰਦੇ ਹਨ।",
            "verse 83:22": "ਬੇਸ਼ੱਕ ਨੇਕ ਲੋਕ ਆਰਾਮ ਵਿਚ ਹੋਣਗੇ।",
            "verse 83:23": "ਉਹ ਤਖ਼ਤਾਂ ਤੇ ਬੈਠੇ ਦੇਖਦੇ ਹੋਣਗੇ।",
            "verse 83:24": "ਉਨ੍ਹਾਂ ਦੇ ਚਿਹਰਿਆਂ ਵਿਚ ਤੁਸੀਂ ਆਰਾਮ ਦੀ ਤਾਜ਼ਗੀ ਮਹਿਸੂਸ ਕਰੋਗੇ।",
            "verse 83:25": "ਉਨ੍ਹਾਂ ਨੂੰ ਸ਼ੁੱਧ ਮੋਹਰ ਬੰਦ ਸ਼ਰਾਬ ਪਿਲਾਇਆ ਜਾਵੇਗਾ।",
            "verse 83:26": "ਜਿਸ ਤੇ ਮੁਸ਼ਕ ਦੀ ਮੋਹਰ ਹੋਵੇਗੀ। ਅਤੇ ਇਹ ਚੀਜ਼ ਹੈ ਜਿਸ ਦੀ ਕਾਮਨਾ ਕਰਨ ਵਾਲਿਆਂ ਨੂੰ ਕਾਮਨਾ ਕਰਨੀ ਚਾਹੀਦੀ ਹੈ।",
            "verse 83:27": "ਅਤੇ ਉਸ ਸ਼ਰਾਬ ਵਿਚ ਤਸਨੀਮ (ਜੰਨਤ ਦੀ ਇੱਕ ਨਹਿਰ) ਦੀ ਮਿਲਾਵਟ ਹੋਵੇਗੀ।",
            "verse 83:28": "ਇੱਕ ਅਜਿਹਾ ਝਰਨਾ ਜਿਸ ਵਿਚੋਂ (ਅੱਲਾਹ ਦੇ) ਨਜ਼ਦੀਕੀ ਲੋਕ ਪੀਣਗੇ।",
            "verse 83:29": "ਬੇਸ਼ੱਕ ਜਿਹੜੇ ਲੋਕ ਅਪਰਾਧੀ ਸਨ, ਉਹ ਈਮਾਨ ਵਾਲਿਆਂ ਤੇ ਹੱਸਦੇ ਸਨ।",
            "verse 83:30": "ਅਤੇ ਜਦੋਂ ਉਹ ਉਨ੍ਹਾਂ ਦੇ ਸਾਹਮਣਿਓ ਲੰਘਦੇ ਹਨ, ਤਾਂ ਉਹ ਆਪਿਸ ਵਿਚ ਅੱਖਾਂ ਦੇ ਇਸ਼ਾਰੇ ਕਰਦੇ ਸਨ।",
            "verse 83:31": "ਅਤੇ ਜਦੋਂ ਉਹ ਆਪਣੇ ਲੋਕਾਂ ਵਿਚ ਵਾਪਿਸ ਆਉਂਦੇ ਹਨ ਤਾਂ ਮੌਜਾਂ ਕਰਦੇ ਆਉਂਦੇ ਹਨ।",
            "verse 83:32": "ਅਤੇ ਜਦੋਂ ਉਹ ਉਨ੍ਹਾਂ ਨੂੰ ਦੇਖਦੇ ਹਨ, ਤਾਂ ਆਖਦੇ ਹਨ ਕਿ ਇਹ ਭਟਕੇ ਹੋਏ ਲੋਕ ਹਨ।",
            "verse 83:33": "ਜਦੋਂ ਕਿ ਉਹ ਉਨ੍ਹਾਂ ਤੇ ਪਹਿਰੇਦਾਰ ਬਣਾ ਕੇ ਨਹੀਂ ਭੇਜੇ ਗਏ ਸਨ।",
            "verse 83:34": "ਸੋ ਅੱਜ ਈਮਾਨ ਵਾਲੇ ਅਵੱਗਿਆਕਾਰੀਆਂ ਤੇ ਹੱਸਦੇ ਹੋਣਗੇ।",
            "verse 83:35": "ਉਹ ਤਖ਼ਤਾਂ ਤੇ ਬੈਠੇ ਦੇਖ ਰਹੇ ਹੋਣਗੇ।",
            "verse 83:36": "ਬੇਸ਼ੱਕ ਵਿਚ ਅਵੱਗਿਆਕਾਰੀਆਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੇ ਕੀਤੇ ਦਾ ਖ਼ੂਬ ਬਦਲਾ ਮਿਲਿਆ।"
        },
        "Roman english": {
            "verse 83:1": "Wailul lil mutaffifeen",
            "verse 83:2": "Allazeena izak taaloo `alan naasi yastawfoon",
            "verse 83:3": "Wa izaa kaaloohum aw wazanoohum yukhsiroon",
            "verse 83:4": "Alaa yazunnu ulaaa`ika annahum mab`oosoon",
            "verse 83:5": "Li Yawmin `Azeem",
            "verse 83:6": "Yawma yaqoomun naasu li Rabbil `aalameen",
            "verse 83:7": "Kallaaa inna kitaabal fujjaari lafee Sijjeen",
            "verse 83:8": "Wa maa adraaka maa Sijjeen",
            "verse 83:9": "Kitaabum marqoom",
            "verse 83:10": "Wailuny yawma`izil lil mukazzibeen",
            "verse 83:11": "Allazeena yukazziboona bi yawmid deen",
            "verse 83:12": "Wa maa yukazzibu biheee illaa kullu mu`tadin aseem",
            "verse 83:13": "Izaa tutlaa`alaihi aayaatunaa qaala asaateerul awwaleen",
            "verse 83:14": "Kallaa bal raana `alaa quloobihim maa kaanoo yaksiboon",
            "verse 83:15": "Kallaaa innahum `ar Rabbihim yawma`izil lamah jooboon",
            "verse 83:16": "Summa innahum lasaa lul jaheem",
            "verse 83:17": "Summa yuqaalu haazal lazee kuntum bihee tukazziboon",
            "verse 83:18": "Kallaaa inna kitaabal abraari lafee`Illiyyeen",
            "verse 83:19": "Wa maaa adraaka maa `Illiyyoon",
            "verse 83:20": "Kitaabum marqoom",
            "verse 83:21": "Yashhadu hul muqarra boon",
            "verse 83:22": "Innal abraara lafee Na`eem",
            "verse 83:23": "Alal araaa`iki yanzuroon",
            "verse 83:24": "Ta`rifu fee wujoohihim nadratan na`eem",
            "verse 83:25": "Yusqawna mir raheeqim makhtoom",
            "verse 83:26": "Khitaamuhoo misk; wa fee zaalika falyatanaafasil Mutanaafisoon",
            "verse 83:27": "Wa mizaajuhoo min Tasneem",
            "verse 83:28": "Ainaiy yashrabu bihal muqarraboon",
            "verse 83:29": "Innal lazeena ajramoo kaanoo minal lazeena aamanoo yadhakoon",
            "verse 83:30": "Wa izaa marroo bihim yataghaamazoon",
            "verse 83:31": "Wa izan qalabooo ilaaa ahlihimun qalaboo fakiheen",
            "verse 83:32": "Wa izaa ra awhum qaalooo inna haaa`ulaaa`i ladaaal loon",
            "verse 83:33": "Wa maaa ursiloo `alaihim haafizeen",
            "verse 83:34": "Fal yawmal lazeena aamanoo minal kuffaari yadhakoon",
            "verse 83:35": "Alal araaa`iki yanzuroon",
            "verse 83:36": "Hal suwwibal kuffaaru maa kaanoo yaf`aloon"
        },
        "Russian": {
            "verse 83:1": "Проклятье плутам,",
            "verse 83:2": "Кто при отмеривании для себя берет сполна,",
            "verse 83:3": "А отмеряя для других, сбавляет вес иль меру!",
            "verse 83:4": "Ужель не ведают они, Что и для них наступит Воскресенье,",
            "verse 83:5": "Великий День,",
            "verse 83:6": "Тот День, Когда предстанут люди пред Владыкой мира?",
            "verse 83:7": "Поистине, в сиджжине Книга скверных!",
            "verse 83:8": "Как объяснить тебе, что значит сей \"сиджжин\"?",
            "verse 83:9": "Исчертанная письменами Книга!",
            "verse 83:10": "И горе тем В тот День, Кто ложью называл,",
            "verse 83:11": "Кто ложью Судный День нарек.",
            "verse 83:12": "Отвергнуть же его способен Лишь преступник грешный, (пределы все переступив).",
            "verse 83:13": "Когда читают им знаменья Наши, говорят они: \"Все это - сказы первых!\"",
            "verse 83:14": "Но нет! От их деяний злых На их сердца спустилась темная завеса.",
            "verse 83:15": "Поистине, В тот День Отделены они завесой будут от взора своего Владыки.",
            "verse 83:16": "Потом они войдут в пылающее пламя (Ада),",
            "verse 83:17": "Потом им скажут: \"Это - то, что вы считали ложью\".",
            "verse 83:18": "И, истинно, хранится в ильлийине праведников книга!",
            "verse 83:19": "Как объяснить тебе, что значит \"ильлийин\"?",
            "verse 83:20": "Исчертанная письменами Книга!",
            "verse 83:21": "Про то свидетельствуют те, Которые приближены (к Аллаху).",
            "verse 83:22": "Поистине, там праведники пребывать в блаженстве будут.",
            "verse 83:23": "На возвышающихся ложах Откроется им созерцанье (всех вещей).",
            "verse 83:24": "Ты в лицах их узнаешь свет блаженства.",
            "verse 83:25": "И чистым запечатанным вином дадут им жажду утолять,",
            "verse 83:26": "И в завершение - сам мускус. И к этому пусть устремятся те, Кто истинную ценность осознал, В ком, истинно, стремление созрело.",
            "verse 83:27": "И будет смешан он с водой таснима -",
            "verse 83:28": "Источника, откуда пьют лишь те, Которые приближены (к Аллаху).",
            "verse 83:29": "Смеялись скверные над теми, Которые уверовали (в Бога),",
            "verse 83:30": "И, когда мимо проходили, Мигали (понимающе) друг другу,",
            "verse 83:31": "А приходя в свой круг людей, Они к насмешкам возвращались.",
            "verse 83:32": "При виде их они обычно говорили: \"Они, поистине, заблудшие в сем мире!\"",
            "verse 83:33": "Но скверным не дано нести над верными опеку.",
            "verse 83:34": "И над неверными В тот День Смеяться праведные будут.",
            "verse 83:35": "На возвышающихся ложах Откроется им созерцанье (всех вещей).",
            "verse 83:36": "И разве скверным не воздастся За все содеянное (на земле)?!"
        },
        "Sindhi": {
            "verse 83:1": "(تور ۽ ماپ ۾) انھن گھٽ ڪري ڏيندڙن لاءِ ويل آھي.",
            "verse 83:2": "جي جڏھن (پاڻ لاءِ) ماڻھن کان مَئي وٺندا آھن ته بلڪل پورو ڪري وٺندا آھن.",
            "verse 83:3": "۽ جڏھن اُنھن کي مَئي ڏيندا آھن يا کين توري ڏيندا آھن (ته) گھٽائي ڏيندا آھن.",
            "verse 83:4": "اھي گمان نه ٿا ڪن ڇا ته کين (ضرور) اُٿاربو.",
            "verse 83:5": "اُنھيءَ وڏي ڏينھن لاءِ.",
            "verse 83:6": "جنھن ڏينھن ماڻھو جھانن جي پالڻھار اڳيان ٿي بيھندا.",
            "verse 83:7": "سچ آھي ته بيشڪ بدڪارن جو اعمالنامو سجين ۾ آھي.",
            "verse 83:8": "۽ ڪنھن سمجھايئي ته سجين ڇا آھي؟",
            "verse 83:9": "ھڪ لکيل دفتر آھي.",
            "verse 83:10": "اُن ڏينھن (انھن) ڪوڙ ڀانئيندڙن لاءِ ويل آھي.",
            "verse 83:11": "جيڪي عملن جي بدلي جي ڏينھن کي ڪوڙ ڀانئيندا آھن.",
            "verse 83:12": "۽ اُن کي سڀڪنھن حد کان لنگھندڙ گنھگار کانسواءِ (ٻيو) ڪو ڪوڙ نه ڀانئيندو.",
            "verse 83:13": "جڏھن اسان جون آيتون کيس پڙھي ٻڌائبيون آھن ته چوندو آھي ته (اھي) اڳين جون آکاڻيون آھن.",
            "verse 83:14": "ائين بلڪل نه آھي! بلڪ، جيڪي ڪمائيندا ھوا تنھن جي ڪَٽ سندين دلين تي ڄمي ويئي آھي.",
            "verse 83:15": "ائين نه آھي پنھنجي پالڻھار (جي سامھون اچڻ) کان انھي ڏينھن روڪيل ھوندا.",
            "verse 83:16": "وري بيشڪ اُھي دوزخ ۾ گھڙڻ وارا ھوندا.",
            "verse 83:17": "وري چئبن ته ھي اُھو دوزخ آھي جنھن کي اوھين ڪوڙ ڀانئيندا ھُيؤ.",
            "verse 83:18": "سچ آھي بيشڪ ڀلارن جو اعمالنامو عِلّيِّيۡن ۾ آھي.",
            "verse 83:19": "۽ ڪنھن سمجھايئي ته عِلِّيّين ڇا آھي؟",
            "verse 83:20": "ھڪ لکيل دفتر آھي.",
            "verse 83:21": "اُن وٽ (الله جا) مقرب حاضر رھندا آھن.",
            "verse 83:22": "بيشڪ ڀلارا (بھشت) جي نعمتن ۾ ھوندا.",
            "verse 83:23": "تختن تي ويھي نظارو پيا ڪندا.",
            "verse 83:24": "(سڀني پاسن کان) سندن منھن مان ئي نعمت جي تازگي پيو معلوم ڪندين.",
            "verse 83:25": "مھر لڳل صاف شراب مان پيو پياربن.",
            "verse 83:26": "جنھن جي مُھر مشڪ (جي) ھوندي، ۽ شوقينن کي جڳائي ته اُنھيءَ ۾ شوق رکن.",
            "verse 83:27": "اُن جي ملاوت تَسۡنِيم (جي پاڻيءَ) مان ھوندي.",
            "verse 83:28": "جو ھڪ چشمو آھي جنھن مان الله جا ويجھا (ٻانھا) پيئندا.",
            "verse 83:29": "بيشڪ ڏوھاري (دنيا ۾) مؤمنن تي کلندا ھوا.",
            "verse 83:30": "۽ جڏھن وٽائن لنگھندا ھوا ته مؤمنن تي حقارت ڪري پاڻ ۾ ميڇون ڏيندا ھوا.",
            "verse 83:31": "۽ جڏھن پنھنجن گھر وارن ڏانھن موٽندا ھوا (ته) ڏاڍيون خوشيون ڪندا موٽندا ھوا.",
            "verse 83:32": "۽ جڏھن مؤمنن کي ڏسندا ھوا ته چوندا ھوا ته بيشڪ اُھي گمراھ آھن.",
            "verse 83:33": "۽ (حقيقت ڪري) اُھي مؤمنن تي نگھبان ڪري نه موڪليا ويا ھوا.",
            "verse 83:34": "تنھنڪري اڄ مؤمن ڪافرن تي کِلن ٿا.",
            "verse 83:35": "تختن تي (ويھي) نظارو ڪن ٿا.",
            "verse 83:36": "(۽ چون ٿا) ته ڪافرن کي انھيءَ جو بدلو ڏنو ويو آھي ڇا جيڪي اُھي ڪندا ھوا."
        },
        "Sinhalese": {
            "verse 83:1": "කිරුම් මිනුම් වල වංචා කරන්නන්හට විනාශයමය.",
            "verse 83:2": "ඔවුන් වනාහි මිනිසුන්ගෙන් කිරා ගන්නා විට සම්පූර්ණයෙන්ම කිරා ගනිති.",
            "verse 83:3": "කිරා දෙන විට හෝ මැන දෙන විට අඩු කර දෙති.",
            "verse 83:4": "නියත වශයෙන්ම තමන් නැගිටුවනු ලබන්නන් බව ඔවුහු නොසිතන්නෝ ද?",
            "verse 83:5": "මහත් වූ දිනයක් සඳහා.",
            "verse 83:6": "එදින මිනිස්සු සකල ලෝකයේ පරමාධිපති ඉදිරියේ නැගී සිටිනු ඇත.",
            "verse 83:7": "නොඑසේය. නියත වශයෙන්ම අපරාධකරුවන්ගේ ලේඛනය සිජ්ජීන්හි ඇත්තේය.",
            "verse 83:8": "(නබිවරය!) සිජ්ජීන් යනු කුමක් දැයි නුඹ ව දැනුවත් කළේ කුමක් ද?",
            "verse 83:9": "(එය) ලියන ලද වාර්තා පොතකි.",
            "verse 83:10": "බොරු කරන්නන් හට එදින විනාශයය.",
            "verse 83:11": "මොවුන් වනාහි විනිශ්චය දිනය බොරු කරති.",
            "verse 83:12": "සීමාව ඉක්මවා ගිය සෑම පාපතරයකුම මිස වෙනත් කිසිවෙක් එය බොරු නොකරනු ඇත.",
            "verse 83:13": "අපගේ වදන් ඔහු වෙත පාරායනා කරනු ලබන විට (මෙය) පැරැණ්නන්ගේ ප්‍රබන්ධයන් යැයි ඔහු පවසයි.",
            "verse 83:14": "නොඑසේය. නමුත් ඔවුන් උපයමින් සිටි දෑ (මගින්) ඔවුන්ගේ හදවත් මත මල බැඳී ඇත.",
            "verse 83:15": "නොඑසේය. නියත වශයෙන්ම ඔවුහු එදින ඔවුන්ගේ පරමාධිපතිගෙන් තිර දම(මින් වෙන් කර)නු ලබන්නෝය.",
            "verse 83:16": "තවද නියත වශයෙන්ම ඔවුහු නිරයෙහි පිවිසෙන්නෝ වෙති.",
            "verse 83:17": "ඉන්පසුව “නුඹලා බොරු කරමින් සිටි දෑ මෙය වේ” යැයි කියනු ලැබේ.",
            "verse 83:18": "නොඑසේය. නියත වශයෙන්ම දැහැමියන්ගේ ලේඛනය ඉල්ලීයියීන්හිම ය.",
            "verse 83:19": "තවද ඉල්ලීයියීන් යනු කුමක් දැයි නුඹ ව දැනුවත් කළේ කුමක් ද?",
            "verse 83:20": "(එය) ලියන ලද වාර්තා පොතකි.",
            "verse 83:21": "(දේව) සමීපතයෝ එයට සාක්ෂි දරති.",
            "verse 83:22": "නියත වශයෙන්ම දැහැමියෝ සැප පහසුකම් හි සිටිති.",
            "verse 83:23": "කවිච්චි මතට වී (සිරි) නරඹමින් සිටිති.",
            "verse 83:24": "(ඔවුනට ලැබුණු) සැප පහසුකම් හි සිරියාව නුඹ ඔවුන්ගේ මුහුණු තුළින් දැන ගනු ඇත.",
            "verse 83:25": "මුද්‍රා කරන ලද අමෘතයෙන් ඔවුහු පොවනු ලබති.",
            "verse 83:26": "එහි මුද්‍රාව කස්තූරි ය. එහෙයින් තරඟ වදින්නට අපේක්ෂා කරන්නන් ඒ තුළ තරඟ වදිත්වා.",
            "verse 83:27": "තවද එහි මිශ්‍රණය තස්නීමයෙනි.",
            "verse 83:28": "එය දේව සමීපතයින් එයින් පානය කරන උල්පතකි.",
            "verse 83:29": "නියත වශයෙන්ම අපරාධ කළ අය විශ්වාස කළවුන් පිළිබඳ ව සිනහසෙමින් සිටියෝය.",
            "verse 83:30": "තවද ඔවුන් පසු කරමින් ගිය විට ඔවුහු එකිනෙකා අතර ඇස් කොණින් ඉඟි කොට සමච්චල් කර ගත්තෝය.",
            "verse 83:31": "තවද ඔවුහු ඔවුන්ගේ ජනයා වෙත හැරී ගිය විට (ඒ ගෙන) සතුටු වන්නන් ලෙස හැරී ගියෝය.",
            "verse 83:32": "තවද ඔවුහු ඔවුන් ව දුටු විට “සැබැවින්ම මොවුන් නොමග ගියවුන්මය” යැයි පවසති.",
            "verse 83:33": "තවද ඔවුන් මත ආරක්ෂකයින් ලෙස මොවුහු එවනු නොලැබුවෝය.",
            "verse 83:34": "එහෙයින් අද දින විශ්වාස කළවුන් දේවත්වය ප්‍රතික්ෂේප කරන්නන් දෙස බලා සිනාසෙති.",
            "verse 83:35": "සුව පහසු කවිච්චි මත වී සිරි නරඹති.",
            "verse 83:36": "ප්‍රතික්ෂේපකයෝ තමන් කරමින් සිටි දෑ සඳහා ප්‍රතිවිපාක දෙනු ලැබුවෝ ද?"
        },
        "Somali": {
            "verse 83:1": "Wuxuu Halaag u sugnaaday kuwa xaqa nusqaamiya.",
            "verse 83:2": "Waa kuwa markay miisina oofsada (dhammaystirta).",
            "verse 83:3": "Markay u miisi ama u miisaamina ka nusqaamiya.",
            "verse 83:4": "Miyayna u malaynaynin kuwaasi in loo soo bixin.",
            "verse 83:5": "Maalin wayn darteed (Qiyaamada).",
            "verse 83:6": "Maalinta Dadku u istaagi Eebaha Caalamka.",
            "verse 83:7": "Saas ma aha ee Camalka kuwa xun wuxuu ku Qoranyahay Sijiin.",
            "verse 83:8": "Ma taqaannaa Sijiin.",
            "verse 83:9": "Waa Kitaab calaamaysan.",
            "verse 83:10": "Halaagna wuxuu u sugnaaday Maalintaas kuwa beeniya (xaqa).",
            "verse 83:11": "Ee ah kuwa beeniya Maalinta abaal marinta.",
            "verse 83:12": "Waxaana beeniya xaqa mid xad gudba oo dambiila ah.",
            "verse 83:13": "Marka Quraanka lagu akhriyana yidhaahda waa warkii Dadkii hore.",
            "verse 83:14": "Saas ma aha ee waxaa fuulay Qalbigooda (mirdhiyay) waxay kasbanjireen oo Dambi ah.",
            "verse 83:15": "Waxaa sugan in Eebohood Maalintaas (Qiyaame) laga xijaabi.",
            "verse 83:16": "Markaasna ay gali Jaxiimo.",
            "verse 83:17": "Waxaana loo odhan tani waa Naartaad ku beeninayseen Adduunka.",
            "verse 83:18": "Saas xaalku ma aha ee Kitaabka iyo Camalka Dadka Wanaagsan wuxuu ku Quranyahay Cilliyiin.",
            "verse 83:19": "Cilliyiin ma taqaannaa.",
            "verse 83:20": "Waa Kitaab la Calaameeyay (oo Dadka fiican magaciisa lagu qoro.",
            "verse 83:21": "Waxaana Gacanta ku haya Malaa'ig Eebe u dhaw.",
            "verse 83:22": "Kuwa wanaagsan waxay gali Naciima (Janno).",
            "verse 83:23": "(Maalinta Qiyaamana) Sariiro yay ku dangiigsanaan oy wax ka daawan.",
            "verse 83:24": "Wajigooda waanad ka garan Nicmada.",
            "verse 83:25": "Waxaana laga waraabin cabbid la dhawray (oo macaan).",
            "verse 83:26": "Waxaana lagu khatimaa Miski iyo udgoon, ee Arrintaas ha u tartameen Tartamayaashu.",
            "verse 83:27": "Waxaana lagu dheehi Cabbitaan.",
            "verse 83:28": "Waa Il ay ka cabbaan kuwa Eebe u dhaw.",
            "verse 83:29": "Kuwii Dambaabay (Gaaloobay) waxay ahaayeen kuwa ku qosla kuwii xaqa rumeeyay.",
            "verse 83:30": "Haday maraanna way xaqirijireen.",
            "verse 83:31": "Markay Guryahoodii u noqdaanna (gaaladu) waxay noqonjireen iyagoo isla Wayn (oo raaxaysan).",
            "verse 83:32": "Markay arkaan Mu'miniintana waxay dhahaan kuwaasi waa dhunsanyihiin.",
            "verse 83:33": "Loomana dirin inay ilaaliyaan Mu'miniinta.",
            "verse 83:34": "Maalinta (qiyaame) kuwa rumeeyay xaqa waxay ku qosli gaalada.",
            "verse 83:35": "Sariiro korkood yayna wax daawan.",
            "verse 83:36": "Miyaan laga abaalmarinnin Gaalada waxay falayeen. (waa laga abaalmariyay)."
        },
        "Spanish": {
            "verse 83:1": "Perdición para los defraudadores!",
            "verse 83:2": "Que cuando le compran a la gente le exigen la medida y el peso cumplidos,",
            "verse 83:3": "pero cuando son ellos los que miden o pesan, cometen fraude.",
            "verse 83:4": "Es que no tienen certeza de que serán devueltos a la vida",
            "verse 83:5": "para un día trascendente?",
            "verse 83:6": "El día en que los hombres se levantarán ante el Señor de los mundos.",
            "verse 83:7": "Realmente el libro de los farsantes estará en Siyyin.",
            "verse 83:8": "Y cómo podrás saber qué es Siyyin?",
            "verse 83:9": "Es un libro marcado.",
            "verse 83:10": "Perdición ese día para los que niegan la verdad!",
            "verse 83:11": "Los que negaron el día de la Rendición de Cuentas.",
            "verse 83:12": "Porque sólo niega la verdad el transgresor malvado,",
            "verse 83:13": "que cuando se le recitan Nuestros signos dice: Son leyendas de los primitivos.",
            "verse 83:14": "Pero no! Lo que han adquirido se ha apoderado de sus corazones.",
            "verse 83:15": "Ese día ellos estarán velados de su Señor;",
            "verse 83:16": "después entrarán en el Yahim.",
            "verse 83:17": "Y se dirá: Esto es aquello cuya veracidad negabais.",
            "verse 83:18": "Realmente el Libro de los creyentes estará en Il-liyyun.",
            "verse 83:19": "Y cómo sabrás qué es Il-liyyun?",
            "verse 83:20": "Es un libro marcado.",
            "verse 83:21": "Darán testimonio de él los de proximidad.",
            "verse 83:22": "Es cierto que los creyentes sinceros estarán en un deleite.",
            "verse 83:23": "Observando, reclinados sobre los lechos.",
            "verse 83:24": "En sus rostros reconocerás el resplandor de la dicha.",
            "verse 83:25": "Se les dará de beber de un vino puro, sellado;",
            "verse 83:26": "cuyo sello será almizcle.Que en ello pongan su anhelo los que anhelan!",
            "verse 83:27": "Y su mezcla será de Tasnim.",
            "verse 83:28": "Un manantial del que beberán los que tengan proximidad.",
            "verse 83:29": "Ciertamente los que cometían maldades se reían de los que eran creyentes.",
            "verse 83:30": "Y cuando pasaban a su lado se hacían guiños entre ellos.",
            "verse 83:31": "Y cuando regresaban a su familia lo hacían divertidos.",
            "verse 83:32": "Y al verlos decían: Estos están extraviados.",
            "verse 83:33": "Pero ellos no habían sido enviados como guardianes suyos.",
            "verse 83:34": "Y hoy los que creen se reirán de los incrédulos.",
            "verse 83:35": "Los observarán reclinados sobre los lechos.",
            "verse 83:36": "No han sido recompensados los incrédulos por lo que hacían?"
        },
        "Swahili": {
            "verse 83:1": "Ole wao hao wapunjao!",
            "verse 83:2": "Ambao wanapo jipimia kwa watu hudai watimiziwe.",
            "verse 83:3": "Na wao wanapo wapimia watu kwa kipimo au mizani hupunguza.",
            "verse 83:4": "Kwani hawadhani hao kwamba watafufuliwa",
            "verse 83:5": "Katika Siku iliyo kuu,",
            "verse 83:6": "Siku watapo msimamia watu Mola Mlezi wa walimwengu wote?",
            "verse 83:7": "Hasha! Hakika maandiko ya wakosefu bila ya shaka yamo katika Sijjin.",
            "verse 83:8": "Unajua nini Sijjin?",
            "verse 83:9": "Kitabu kilicho andikwa.",
            "verse 83:10": "Ole wao siku hiyo kwa wanao kadhibisha!",
            "verse 83:11": "Ambao wanaikadhibisha Siku ya Malipo.",
            "verse 83:12": "Wala haikadhibishi ila kila mwenye kuruka mipaka, mwenye dhambi.",
            "verse 83:13": "Anapo somewa Aya zetu husema: Ni visa vya watu wa kale!",
            "verse 83:14": "Hasha! Bali yametia kutu juu ya nyoyo zao hao walio kuwa wakiyachuma.",
            "verse 83:15": "Hasha! Hakika hao siku hiyo bila ya shaka watazuiliwa na neema za Mola wao Mlezi.",
            "verse 83:16": "Kisha wataingia Motoni!",
            "verse 83:17": "Kisha waambiwe: Haya ndiyo mliyo kuwa mkiyakadhabisha.",
            "verse 83:18": "Hasha! Hakika maandiko ya watu wema bila ya shaka yamo katika I'liyyin.",
            "verse 83:19": "Na nini kitakacho kujuvya nini I'liyyin?",
            "verse 83:20": "Kitabu kilicho andikwa.",
            "verse 83:21": "Wanakishuhudia walio karibishwa.",
            "verse 83:22": "Hakika watu wema bila ya shaka watakuwa katika neema.",
            "verse 83:23": "Wakae juu ya viti vya enzi wakiangalia.",
            "verse 83:24": "Utatambua katika nyuso zao mng'aro wa neema,",
            "verse 83:25": "Watanyweshwa kinywaji safi kiliyo tiwa muhuri,",
            "verse 83:26": "Muhuri wake ni miski. Na katika hayo washindanie wenye kushindana.",
            "verse 83:27": "Na mchanganyiko wake ni Tasniim,",
            "verse 83:28": "Chemchem watakayo inywa walio kurubishwa.",
            "verse 83:29": "Kwa hakika wale walio kuwa wakosefu walikuwa wakiwacheka walio amini.",
            "verse 83:30": "Na wanapo pita karibu yao wakikonyezana.",
            "verse 83:31": "Na wanapo rudi kwa watu wao hurudi nao wamefurahi.",
            "verse 83:32": "Na wanapo waona husema: Hakika hawa ndio khasa walio potea.",
            "verse 83:33": "Na wao hawakutumwa wawe walinzi juu yao.",
            "verse 83:34": "Basi leo walio amini ndio watawacheka makafiri,",
            "verse 83:35": "Nao wako juu ya viti vya enzi wakiangalia.",
            "verse 83:36": "Je! makafiri wamelipwa malipo ya yale waliyo kuwa wakiyatenda?"
        },
        "Swedish": {
            "verse 83:1": "OLYCKLIGA de som snålar med mått och vikt,",
            "verse 83:2": "de som vid köp kräver fullt mått,",
            "verse 83:3": "men som vållar förlust [för andra när de säljer] genom att mäta och väga upp snålt!",
            "verse 83:4": "Tror dessa [människor] att de inte skall uppväckas från de döda,",
            "verse 83:5": "ja, [uppväckas] till en fruktansvärd Dag,",
            "verse 83:6": "då människorna [i all sin ynklighet] skall stå inför världarnas Herre",
            "verse 83:7": "NEJ! Registret över [de handlingar som] de som sjunkit djupt i synd [har begått finns] i Sidjdjeen -",
            "verse 83:8": "och vad kan låta dig förstå vad Sidjdjeen är? -",
            "verse 83:9": "[Det är] en bok med outplånlig skrift.",
            "verse 83:10": "Förlorarna denna Dag är de som förnekade sanningen,",
            "verse 83:11": "som förnekade Domens dag!",
            "verse 83:12": "Ingen förnekar den utom den som överträder alla förbud och som sjunkit djupt i synd,",
            "verse 83:13": "den som, när Våra budskap läses upp för honom, säger: \"[Det där är bara] sagor från förfädernas tid!\"",
            "verse 83:14": "Nej [de är lögnare]! Det [onda] de har gjort har förlamat deras hjärtan!",
            "verse 83:15": "Nej! Denna Dag kommer de förvisso att se sig utestängda från Guds nåd",
            "verse 83:16": "och de kommer helt säkert att brinna i helvetets eld,",
            "verse 83:17": "medan de [hör en röst] säga: \"Det är detta som ni brukade kalla en lögn!\"",
            "verse 83:18": "NEJ! Registret över de gudfruktigas [handlingar finns] i `Illiyyun -",
            "verse 83:19": "och vad kan låta dig förstå vad `Illiyyun är? -",
            "verse 83:20": "Det [är] en bok med outplånlig skrift,",
            "verse 83:21": "bevittnad av dem som är i Guds närhet.",
            "verse 83:22": "De gudfruktiga skall förvisso finna salighet.",
            "verse 83:23": "[När de, vilande] på högsäten, betraktar [allt det som deras Herre har skänkt dem]",
            "verse 83:24": "kommer deras ansikten att ses stråla av lycka.",
            "verse 83:25": "De skall få dricka [paradisets] rena vin, förseglat med [Guds eget] sigill,",
            "verse 83:26": "[ett sigill] med [doft av] mysk. Låt dem som strävar [mot höga mål] tävla om [att få dricka av] detta [vin] -",
            "verse 83:27": "blandat med [vatten från en källa vars namn är] Tasneem,",
            "verse 83:28": "en dryck för dem som är i Guds närhet.",
            "verse 83:29": "DE som har slagit sig till ro med sin synd försöker göra de troende till åtlöje,",
            "verse 83:30": "och när de går förbi [någon av] dem utbyter de sinsemellan menande blickar;",
            "verse 83:31": "när de sedan återvänder till de sina [fortsätter de] med sina skämt.",
            "verse 83:32": "Och när de ser dem säger de: \"De där [människorna] har sannerligen gått vilse!\"",
            "verse 83:33": "Men de hade inget uppdrag att vaka över de troende!",
            "verse 83:34": "På denna [Uppståndelsens] dag skall de troende kunna se med [medlidsamt] löje på dem som förnekade sanningen;",
            "verse 83:35": "[där de sitter] på tronerna [i paradiset] kommer de att bevittna [deras straff och säga till varandra:]",
            "verse 83:36": "\"Har inte förnekarna fått en [rättvis] lön för sina handlingar?\""
        },
        "Tajik": {
            "verse 83:1": "Вой бар камфурӯшон,",
            "verse 83:2": "онон, ки чун аз мардум кайл (паймона) меситонанд, онро пур мекунанд",
            "verse 83:3": "ва чун барои мардум мепаймоянд ё бармекашанд, аз он кам мекунанд.",
            "verse 83:4": "Оё инҳо намедонанд, ки зинда мешаванд",
            "verse 83:5": "дар он рӯзи бузург?",
            "verse 83:6": "Рӯзе, ки мардум ба пешгоҳи Парвардигори ҷаҳониён меистанд.",
            "verse 83:7": "Ҳаққо, ки албатта аъмоли бадкорон навишташуда дар сиҷҷин аст.",
            "verse 83:8": "Ту чӣ медонӣ, ки сиҷҷин чист?",
            "verse 83:9": "Китобест навишта!",
            "verse 83:10": "Дар он рӯз вой бар такзибкунандагон (дурӯғбарорандагон),",
            "verse 83:11": "онон, ки рӯзи ҷазоро дурӯғ меҳисобанд!",
            "verse 83:12": "Ва он рӯзро фақат аз ҳад гузарандаи гуноҳкор дурӯғ меҳисобад.",
            "verse 83:13": "Чун оёти Мо бар ӯ хонда шуд, гуфт: «Афсонаҳои пешиниён аст!»",
            "verse 83:14": "Ҳаққо, ки корҳое, ки карда буданд, бар дилҳошон (ғолиб шуда) занг бастааст.",
            "verse 83:15": "Ҳаққо, ки дар он рӯз аз (дидори) Парвардигорашон маҳҷуб (маҳрум) бошанд.",
            "verse 83:16": "Пас онҳо ба ҷаҳаннам дароянд.",
            "verse 83:17": "Ва онҳоро гӯянд: «Ин аст он чӣ дурӯғаш мешумурдед!»",
            "verse 83:18": "Ҳаққо, ки амалҳои некон дар иллийин мактуб аст.",
            "verse 83:19": "Ва ту чӣ медонӣ, ки иллийин чист?",
            "verse 83:20": "Китобест навишта!",
            "verse 83:21": "Ки муқаррабони (наздикшудагони) Худо дар он менигаранд.",
            "verse 83:22": "Албатта некон дар неъматанд,",
            "verse 83:23": "бар тахтҳо нишаста ва назора мекунанд.",
            "verse 83:24": "Бар чеҳраҳошон таровати неъматро бишиносӣ.",
            "verse 83:25": "Аз шаробе холис, ки бар сари он мӯҳр ниҳодаанд, сероб мешаванд.",
            "verse 83:26": "Мӯҳри он аз мушк аст ва пешдастӣ кунандагон дар он бар якдигар пешдастӣ кунанд,",
            "verse 83:27": "Омезаи он тасним аст, (яъне ботасним омехта)",
            "verse 83:28": "чашмаест, ки муқаррабони (наздикони даргоҳи) Худо аз он меошоманд.",
            "verse 83:29": "Гуноҳкорон ба мӯъминон механдиданд",
            "verse 83:30": "Ва чун бар онҳо мегузаштанд, ба чашму абрӯ ишора мекарданд (бо нияти масхара)",
            "verse 83:31": "ва чун назди касонашон бозмегаштанд, шодмона бозмегаштанд.",
            "verse 83:32": "Ва чун ононро медиданд, мегуфтанд, ки инҳо гумроҳанд.",
            "verse 83:33": "Ва ҳол он ки ононро ба нигаҳбониву муҳофизати амалҳои мӯъминон нафиристода буданд.",
            "verse 83:34": "Ва имрӯз мӯъминон ба кофирон механданд,",
            "verse 83:35": "бар тахтҳо такя задаанд ва менигаранд.",
            "verse 83:36": "Оё кофирон баробари амалҳояшон ҷазо ёфтаанд?"
        },
        "Tamil": {
            "verse 83:1": "அளவு (எடையில்) மோசம் செய்பவர்களுக்கு கேடுதான்.",
            "verse 83:2": "அவர்கள் மனிதர்களிடமிருந்து அளந்து வாங்கும் போது நிறைவாக அளந்து வாங்குகின்றனர்.",
            "verse 83:3": "ஆனால், அவர்கள் அளந்தோ, நிறுத்தோ கொடுக்கும்போது குறை(த்து நஷ்டமுண்டா)க்குகிறார்கள்.",
            "verse 83:4": "நிச்சயமாக அவர்கள் எழுப்பப்படுபவர்களென்பதை அவர்கள் கருத்தில் கொள்ளவில்லையா?",
            "verse 83:5": "மகத்தான ஒரு நாளுக்காக,",
            "verse 83:6": "அகிலத்தாரின் இறைவன் முன் மனிதர்கள் நிற்கும் நாள்-",
            "verse 83:7": "ஆகவே, நிச்சயமாக தீயோர்களின் பதிவேடு ஸிஜ்ஜீனில் இருக்கிறது",
            "verse 83:8": "'ஸிஜ்ஜீன்' என்பது என்னவென்று உமக்கு எது அறிவிக்கும்?",
            "verse 83:9": "அது (செயல்கள்) எழுதப்பட்ட ஏடாகும்.",
            "verse 83:10": "பொய்ப்பிப்பவர்களுக்கு அந்நாளில் கேடுதான்.",
            "verse 83:11": "அவர்கள் நியாயத் தீர்ப்பு நாளையும் பொய்ப்பிக்கிறார்கள்.",
            "verse 83:12": "வரம்பு மீறிய, பெரும் பாவியைத் தவிர வேறெவரும் அதைப் பொய்ப்பிக்க மாட்டார்.",
            "verse 83:13": "நம்முடைய வசனங்கள் அவனுக்கு ஓதிக் காண்பிக்கப்பட்டால், \"அவை முன்னோர்களின் கட்டுக் கதைகளே\" என்று கூறுகின்றான்.",
            "verse 83:14": "அப்படியல்ல: அவர்கள் சம்பாதித்துக் கொண்டிருந்தவை அவர்களுடைய இருதயங்கள் மீது துருவாகப் படிந்து விட்டன.",
            "verse 83:15": "(தீர்ப்புக்குரிய) அந்நாளில் அவர்கள் தங்கள் இறைவனை விட்டும் திரையிடப்பட்டவர்களாவார்கள்.",
            "verse 83:16": "பின்னர் நிச்சயமாக அவர்கள் நரகில் புகுவார்கள்.",
            "verse 83:17": "\"எதை நீங்கள் பொய்ப்பித்துக் கொண்டு இருந்தீர்களோ, அதுதான் இது\" என்று பின் அவர்களுக்குச் சொல்லப்படும்.",
            "verse 83:18": "நிச்சயமாக நல்லோர்களின் பதிவேடும் \"இல்லிய்யீ\"னில் இருக்கிறது.",
            "verse 83:19": "\"இல்லிய்யுன்' என்பது என்னவென்று உமக்கு எது அறிவிக்கும்?",
            "verse 83:20": "(அது) செயல்கள் எழுதப்பட்ட ஏடாகும்.",
            "verse 83:21": "(அல்லாஹ்விடம்) நெருங்கிய (கண்ணியம் மிக்க வான)வர்கள் அதை பார்ப்பார்கள்.",
            "verse 83:22": "நிச்சயமாக அப்ரார்கள் (நல்லவர்கள்) 'நயீம்' என்னும் சுவர்க்கத்தில் இருப்பார்கள்.",
            "verse 83:23": "ஆசனங்களில் அமர்ந்து (சுவர்க்கக் காட்சிகளைப்) பார்ப்பார்கள்.",
            "verse 83:24": "அவர்களுடைய முகங்களிலிருந்தே (அவர்களுக்குக் கிட்டிய) பாக்கியத்தின் செழுமையை நீர் அறிவீர்.",
            "verse 83:25": "(பரிசுத்த) முத்திரையிடப்பட்ட தெளிவான (போதையோ, களங்கமோ அற்ற) மதுவிலிருந்து அவர்கள் புகட்டப்படுவார்கள்.",
            "verse 83:26": "அதன் முத்திரை கஸ்தூரியாகும், எனவே (அதற்காக) ஆர்வம் கொள்பவர்கள், (அதைப் பெற்றுக் கொள்வதற்கான நல்ல அமல்களில்) ஆர்வம் கொள்ளட்டும்.",
            "verse 83:27": "இன்னும், அதனுடைய கலவை தஸ்னீமில் நின்றுள்ளதாகும்.",
            "verse 83:28": "அது (தஸ்னீம், ஓர் இனிய) நீர்ச்சுனையாகும். அதிலிருந்து (அல்லாஹ்விடம் நெருங்கியவர்கள்) முகர்ரபுகள் அருந்துவார்கள்.",
            "verse 83:29": "நிச்சயமாக, குற்றமிழைத்தார்களே அவர்கள், ஈமான் கொண்டவர்களைப் பார்த்து (உலகில்) சிரித்துக் கொண்டிருந்தார்கள்.",
            "verse 83:30": "அன்றியும், அவர்கள் அண்மையில் சென்றால், (ஏளனமாக) ஒருவருக்கொருவர் கண்சாடை செய்துகொள்வார்கள்.",
            "verse 83:31": "இன்னும் அவர்கள் தம் குடும்பத்தார்பால் திரும்பிச் சென்றாலும், (தாங்கள் செய்தது பற்றி) மகிழ்வுடனேயே திரும்பிச் செல்வார்கள்.",
            "verse 83:32": "மேலும் அவர்கள் (முஃமின்களைப்) பார்த்தால், \"நிச்சமயாக இவர்களே வழி தவறியவர்கள்\" என்றும் கூறுவார்கள்.",
            "verse 83:33": "(முஃமின்களின் மீது) அவர்கள் பாதுகாவலர்களாக அனுப்பப்படவில்லையே!",
            "verse 83:34": "ஆனால் (மறுமை) நாளில் ஈமான் கொண்டவர்கள் காஃபிர்களைப் பார்த்து சிரிப்பார்கள்.",
            "verse 83:35": "ஆசனங்களில் அமர்ந்து (அவர்கள் நிலையைப்) பார்ப்பார்கள்.",
            "verse 83:36": "காஃபிர்களுக்கு, அவர்கள் செய்து கொண்டிருந்தவற்றுக்கு தக்க கூலி கொடுக்கப்பட்டதா? (என்றும் கேட்கப்படும்.)"
        },
        "Tatar": {
            "verse 83:1": "Киметеп үлчәүчеләргә үкенеч каты ґәзабдыр.",
            "verse 83:2": "Алар башка кешеләрдән берәр нәрсә үлчәп алсалар үлчәүне тутырып мул үлчәп алалар.",
            "verse 83:3": "Әгәр башка кешеләргә савыт яки бизмән белән үлчәп биргәндә киметеп үлчиләр.",
            "verse 83:4": "Әйә ул кешеләр терелеп кубарылачакларын уйламыйлармы.",
            "verse 83:5": "Олугъ кыямәт көнендә.",
            "verse 83:6": "Ул көндә кешеләр барча галәмне тәрбия итүче Аллаһ хозурында хисаб өчен басып торырлар.",
            "verse 83:7": "Юк, үлчәүдә хыянәт итмәгез, тәхкыйк хыянәтче гасыйларның гамәл дәфтәрләре сиҗҗиндәдер.",
            "verse 83:8": "Нәрсә белдерде сиңа ул сиҗҗиннең хакыйкатен?",
            "verse 83:9": "Аллаһуга итагать итмичә гөнаһка чумган кешеләрнең гамәле генә язылган китаптыр.",
            "verse 83:10": "Хыянәтче ялганчыларга кыямәт көнендә үкенеч вә каты ґәзабдыр.",
            "verse 83:11": "Алар кыямәт һәм хисаб көнен ялганга тоталар.",
            "verse 83:12": "Ул көнне ялганга тотмас, мәгәр хактан баш тартып батыл эшләрдә чиктән ашкан һәр күп гөнаһлы кеше генә ялган дияр.",
            "verse 83:13": "Әгәр аларга һәрнәрсәне аңлатучы аятьләребез укылса, бу әүвәлгеләрдән язылып калган әкият, диләр.",
            "verse 83:14": "Юк Аллаһуга каршы сөйләп һәлак булырга ашыкмагыз, бәлки аларның кылган явыз эшләре күңелләренә тузан булып утырган.",
            "verse 83:15": "Юк алданмасыннар, тәхкыйк алар кыямәт көнеңдә Раббыларыннан пәрдәләнмешләрдер, ягъни аларга Аллаһуның рәхмәте ирешмәс.",
            "verse 83:16": "Соңра, әлбәттә, алар җәһәннәмгә керерләр.",
            "verse 83:17": "Моның соңында аларга әйтелер: \"Бу ґәзаб сез ялганга тоткан ґәзабдыр\", – дип.",
            "verse 83:18": "Юк Аллаһуга карышып җәһәннәмгә кермәгез, тәхкыйк Аллаһуга итагать итеп һәрвакыт яхшылыкны кылган кешеләрнең гамәл дәфтәрләре, әлбәттә, ґилийөндәдер.",
            "verse 83:19": "Сиңа нәрсә белдерде ул ґиллийөннең нәрсә икәнлеген?",
            "verse 83:20": "Ул яхшы мөселманнарның гына яхшылыгы язылган китапдыр.",
            "verse 83:21": "Ул китаплар яныңда Аллаһуның якын фәрештәләре булырлар, кыямәт көнендә ул китаплардан хәбәр бирер өчен.",
            "verse 83:22": "Яманлыкны кылмыйча, фәкать яхшылыкны кылучы яхшы кешеләр, әлбәттә, җәннәттә төрле нигъмәтләр эчендәләр,",
            "verse 83:23": "яхшы урындыкларга утырып шатлык белән бер-берсенә карарлар.",
            "verse 83:24": "Аларны танырсың, йөзләрендә җәннәт нигъмәтләреннән хасыйл булган шатлык яктылыгы булыр.",
            "verse 83:25": "Алар эчерелерләр мөһерләнгән эчемлекләрдән.",
            "verse 83:26": "Ул мөһернең сургучы мускустыр, кызыккан кешеләр ошбу җәннәт нигъмәтләренә кызыксыннар!",
            "verse 83:27": "Аңарга катнаштырылган нәрсә тәснимнәндер.",
            "verse 83:28": "Ул тәсним җәннәттә бер чишмәдер, ул чишмәдән Аллаһуга иң якын кешеләр эчәрләр. (Әмма җәннәтнең башка кешеләренә катнаштырып кына бирелер.)",
            "verse 83:29": "Тәхкыйк гөнаһтан, җәһәннәмнән курыкмаган имансызлар, иман китереп мөселман булган кешеләрдән көлделәр",
            "verse 83:30": "Әгәр мөселманнар алар алдыннан үтсәләр, бер-берсенә күз кысышып мәсхәрә итә иделәр.",
            "verse 83:31": "Әгәр өйләренә кайтсалар, мөселманнарны мәсхәрә иткәннәре өчен киңәеп шатланып кайтыр иделәр.",
            "verse 83:32": "Әгәр мөселманнарны күрсәләр, бу кешеләр адашканнар, ата-баба юлын ташлаганнар, дияләр иде.",
            "verse 83:33": "Бит ул кәферләр мөселманнарга сакчы итеп тә вә гамәлләрендә язучы итеп җибәрелмәделәр.",
            "verse 83:34": "Кыямәт көнендә мөселманнар кәферләрдән көләрләр.",
            "verse 83:35": "Яхшы урындыкларга утырып кәферләрнең ґәзаб кылынганын карарлар.",
            "verse 83:36": "Әйә кәферләргә кылган кабәхәт эшләре өчен җәза бирелдеме? Әлбәттә, тиешле – җәза бирелде."
        },
        "Telugu": {
            "verse 83:1": "కొలతలలో, తూనికలలో తగ్గించి ఇచ్చే వారికి వినాశముంది",
            "verse 83:2": "వారు ప్రజల నుండి తీసుకునేటప్పుడు పూర్తిగా తీసుకుంటారు",
            "verse 83:3": "మరియు తాము ప్రజలకు కొలిచి గానీ లేక తూచి గానీ ఇచ్చేటప్పుడు మాత్రం తగ్గించి ఇస్తారు",
            "verse 83:4": "ఏమీ? ఇలాంటి వారు తిరిగి బ్రతికించి లేపబడరని భావిస్తున్నారా",
            "verse 83:5": "ఒక గొప్ప దినమున",
            "verse 83:6": "సర్వ లోకాల ప్రభువు సమక్షంలో ప్రజలు అందరూ నిలబడే రోజు",
            "verse 83:7": "అలా కాదు! నిశ్చయంగా, దుష్టుల కర్మపత్రం సిజ్జీనులో ఉంది",
            "verse 83:8": "ఆ సిజ్జీన్ అంటే నీవు ఏమనుకుంటున్నావు",
            "verse 83:9": "వ్రాసి పెట్టబడిన (చెరగని) గ్రంథం",
            "verse 83:10": "సత్యాన్ని తిరస్కరించే వారికి ఆ రోజు వినాశముంది",
            "verse 83:11": "వారికే! ఎవరైతే తీర్పుదినాన్ని తిరస్కరిస్తారో",
            "verse 83:12": "మరియు మితిమీరి ప్రవర్తించే పాపిష్ఠుడు తప్ప, మరెవ్వడూ దానిని (తీర్పు దినాన్ని) తిరస్కరించడు",
            "verse 83:13": "మా సూచనలు (ఆయాత్ లు) అతడికి వినిపించ బడినప్పుడు అతడు: ఇవి పూర్వకాలపు కట్టుకథలే!\" అని అంటాడు",
            "verse 83:14": "అలా కాదు! వాస్తవానికి వారి హృదయాలకు వారి (దుష్ట) కార్యాల త్రుప్పు పట్టింది",
            "verse 83:15": "అంతేకాదు, ఆ రోజు నిశ్చయంగా, వారు తమ ప్రభువు కారుణ్యం నుండి నిరోధింప బడతారు",
            "verse 83:16": "తరువాత వారు నిశ్చయంగా, భగభగ మండే నరకాగ్నిలోకి పోతారు",
            "verse 83:17": "అప్పుడు వారితో: దేనినైతే మీరు అసత్యమని తిరస్కరిస్తూ వచ్చారో, అది ఇదే!\" అని చెప్పబడుతుంది",
            "verse 83:18": "అలా కాదు! నిశ్చయంగా, ధర్మనిష్ఠాపరుల (పుణ్యాత్ముల) కర్మపత్రం మహోన్నత గ్రంథం (ఇల్లియ్యూన్)లో ఉంది",
            "verse 83:19": "మరి ఆ ఇల్లియ్యూన్ అంటే నీవు ఏమనుకుంటున్నావు",
            "verse 83:20": "అది వ్రాసిపెట్టబడిన ఒక గ్రంథం",
            "verse 83:21": "దానికి, (అల్లాహ్ కు) సన్నిహితులైన వారు (దేవదూతలు) సాక్ష్యంగా ఉంటారు",
            "verse 83:22": "నిశ్చయంగా, పుణ్యాత్ములు సుఖసంతోషాలలో ఉంటారు",
            "verse 83:23": "ఎత్తైన ఆసనాలపై కూర్చొని (స్వర్గదృశ్యాలను) తిలకిస్తూ",
            "verse 83:24": "వారి ముఖాలు సుఖసంతోషాలతో కళకళలాడుతూ ఉండటం నీవు చూస్తావు",
            "verse 83:25": "సీలు చేయబడిన నాణ్యమైన మధువు వారికి త్రాగటానికి ఇవ్వబడుతుంది",
            "verse 83:26": "దాని చివరి చుక్కలోనూ కస్తూరి సువాసన ఉంటుంది. కాబట్టి దానిని పొందటానికి అపేక్షించే వారంతా ప్రయాస పడాలి",
            "verse 83:27": "మరియు దానిలో (ఆ మధువులో) తస్నీమ్ కలుపబడి ఉంటుంది",
            "verse 83:28": "అదొక చెలమ, (అల్లాహ్) సాన్నిధ్యం పొందినవారే దాని నుండి త్రాగుతారు",
            "verse 83:29": "వాస్తవానికి (ప్రపంచంలో) అపరాధులు విశ్వసించిన వారిని హేళన చేసేవారు",
            "verse 83:30": "మరియు వీరు (విశ్వాసులు), వారి (అవిశ్వాసుల) యెదుట నుండి పోయి నప్పుడు, వారు (అవిశ్వాసులు) పరస్పరం కనుసైగలు చేసుకునేవారు",
            "verse 83:31": "మరియు (అవిశ్వాసులు) తమ ఇంటి వారి దగ్గరికి పోయినప్పుడు (విశ్వాసులను గురించి) పరిహసిస్తూ మరలేవారు",
            "verse 83:32": "మరియు (విశ్వాసులను) చూసినపుడల్లా: నిశ్చయంగా, వీరు దారి తప్పినవారు!\" అని అనేవారు",
            "verse 83:33": "మరియు వారు (అవిశ్వాసులు) వీరి (విశ్వాసుల) మీద కాపలాదారులుగా పంపబడలేదు",
            "verse 83:34": "కాని ఈ రోజు (పునరుత్థాన దినం నాడు) విశ్వసించినవారు, సత్యతిరస్కారులను చూసి నవ్వుతారు",
            "verse 83:35": "ఎత్తైన ఆసనాలపై కూర్చొని (స్వర్గదృశ్యాలను) తిలకిస్తూ (ఇలా అంటారు)",
            "verse 83:36": "ఇక! ఈ సత్యతిరస్కారులకు, వారి చేష్టలకు తగిన ప్రతిఫలం తప్ప మరేమైనా దొరుకునా"
        },
        "Thai": {
            "verse 83:1": "ความหายนะจงประสบแด่บรรดาผู้ทำให้พร่อง (ในการตวงและการชั่ง)",
            "verse 83:2": "คือบรรดาผู้ที่เมื่อพวกเขาตวงเอาจากคนอื่นก็ตวงเอาเต็ม",
            "verse 83:3": "และเมื่อพวกเขาตวงหรือชั่งให้คนอื่นก็ทำให้ขาด",
            "verse 83:4": "ชนเหล่านั้นมิได้คิดบ้างหรือว่าพวกเขาจะถูกให้ฟื้นคืนชีพ",
            "verse 83:5": "สำหรับวันอันยิ่งใหญ่",
            "verse 83:6": "วันที่มนุษย์จะยืนต่อหน้าพระเจ้าแห่งสากลโลก",
            "verse 83:7": "มิใช่เช่นนั้น แท้จริงบันทึกของบรรดาคนชั่วนั้นอยู่ในสิจญีน",
            "verse 83:8": "และอันใดเล่าทำให้เจ้ารู้ได้ว่าสิจญีนนั้นคืออะไร?",
            "verse 83:9": "คือบันทึกที่ถูกจารึกไว้",
            "verse 83:10": "ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ",
            "verse 83:11": "คือบรรดาผู้ปฏิเสธวันแห่งการตอบแทน",
            "verse 83:12": "และไม่ไม่ใครปฏิเสธวันแห่งการตอบแทนนั้น นอกจากทุกคนที่ละเมิดที่กระทำความผิด",
            "verse 83:13": "เมื่อบรรดาอายาตของเราถูกอ่านแก่เขา เขาจะกล่าวว่านี่คือนิยายเหลวไหวสมัยก่อน",
            "verse 83:14": "มิใช่เช่นนั้น แต่ว่าสิ่งที่พวกเขาได้ขวนขวายไว้นั้นได้เป็นสนิมบนหัวใจของพวกเขา",
            "verse 83:15": "มิใช่เช่นนั้น แท้จริงพวกเขาในวันนั้นจะถูกกั้นจากพระเจ้าของพวกเขา",
            "verse 83:16": "แล้วแท้จริงพวกเขาจะเข้าไปอยู่ในนรกที่มีเปลวไฟลุกโซน",
            "verse 83:17": "แล้วจะมีเสียงกล่าวขึ้นว่า นี่คือสิ่งที่พวกเจ้าได้ปฏิเสธมันไว้",
            "verse 83:18": "มิใช่เช่นนั้น แท้จริงบันทึกของบรรดาผู้ทรงคุณธรรมอยู่ในอิลลียีนอย่างแน่นอน",
            "verse 83:19": "และอันใดเล่าทำให้เจ้ารู้ได้ว่าอิลลียีนคืออะไร",
            "verse 83:20": "คือบันทึกที่ถูกจารึกไว้",
            "verse 83:21": "บรรดาผู้ที่อยู่ใกล้ชิด (มะลาอิกะฮฺ) จะเป็นผู้ดูแลรักษา",
            "verse 83:22": "แท้จริงบรรดาผู้ทรงคุณธรรมจะอยู่ในความโปรดปรานอย่างแน่นอน",
            "verse 83:23": "พวกเขาจะมองดูจากบนเตียง",
            "verse 83:24": "เจ้าจะรู้ได้ถึงการมีความสดชื่นแห่งความสุขสำราญที่ปรากฏอยู่บนใบหน้าของพวกเขา",
            "verse 83:25": "พวกเขาจะได้ดื่มสุราอันบริสุทธิ์ ซึ่งถูกผนึกไว้",
            "verse 83:26": "ที่ใช้ผนึกมันนั้นคือชะมดเชียง และในการนี้บรรดาผู้แข่งขัน (ที่จะให้ได้มาซึ่งความสุขสำราญนี้) จงแข่งขันกันเถิด",
            "verse 83:27": "ที่ใช้ผสมสุรานั้นมาจากตัสนีม",
            "verse 83:28": "คือตาน้ำแห่งหนึ่งซึ่งบรรดาผู้ใกล้ชิด (อัลลอฮฺ) เท่านั้นจะได้ดื่มมัน",
            "verse 83:29": "แท้จริงบรรดาผู้กระทำผิดนั้น เคยหัวเราะเยาะบรรดาผู้ศรัทธา",
            "verse 83:30": "และเมื่อบรรดาผู้ศรัทธาเดินผ่านพวกเขาไป พวกเขาจะหลิ่วตาเย้ยหยัน",
            "verse 83:31": "และเมื่อพวกเขากลับไปยังพวกพ้องของพวกเขา พวกเขาก็กลับไปอย่างตลกคะนอง",
            "verse 83:32": "และเมื่อพวกเขาเห็นบรรดาผู้ศรัทธาพวกเขาก็กล่าวว่า แท้จริงชนเหล่านี้เป็นผู้หลงทางแน่นอน",
            "verse 83:33": "และพวกเขา (ผู้ปฏิเสธศรัทธา) มิได้ถูกส่งมาเพื่อเป็นผู้ปกปักรักษาผู้ศรัทธาเหล่านั้น",
            "verse 83:34": "ดังนั้น วันนี้บรรดาผู้ศรัทธาก็จะหัวเราะเยาะพวกปฏิเสธศรัทธาบ้าง",
            "verse 83:35": "พวกเขา (บรรดาผู้ศรัทธา) จะมองดูอยู่บนเตียง",
            "verse 83:36": "บรรดาผู้ปฏิเสธจะได้รับการตอบแทนตามที่ได้ปฏิบัติมามิใช่หรือ"
        },
        "Turkish": {
            "verse 83:1": "İnsanlardan, kendileri bir şeyi ölçerek aldıkları zaman tam alan; ama onlara bir şeyi ölçüp tartarak verdiklerinde eksik tutan kimselerin, vay haline!",
            "verse 83:2": "İnsanlardan, kendileri bir şeyi ölçerek aldıkları zaman tam alan; ama onlara bir şeyi ölçüp tartarak verdiklerinde eksik tutan kimselerin, vay haline!",
            "verse 83:3": "İnsanlardan, kendileri bir şeyi ölçerek aldıkları zaman tam alan; ama onlara bir şeyi ölçüp tartarak verdiklerinde eksik tutan kimselerin, vay haline!",
            "verse 83:4": "Bunlar, büyük bir günde tekrar dirileceklerini sanmıyorlar mı?",
            "verse 83:5": "Bunlar, büyük bir günde tekrar dirileceklerini sanmıyorlar mı?",
            "verse 83:6": "O gün insanlar Alemlerin Rabbinin huzurunda dururlar.",
            "verse 83:7": "Sakının; Allah'ın buyruğundan dışarı çıkanlar, muhakkak \"Siccin\" adlı defterde yazılıdır.",
            "verse 83:8": "Siccin'in ne olduğunu sen nerden bilirsin?",
            "verse 83:9": "O, yazılmış bir kitaptır.",
            "verse 83:10": "Yalanlayanların o gün vay haline!",
            "verse 83:11": "Onlar, kıyamet gününü yalanlamış olanlardır.",
            "verse 83:12": "Oysa onu mütecaviz günahkardan başka kimse yalanlamaz.",
            "verse 83:13": "Ona ayetlerimiz okunduğu zaman \"Öncekilerin masalları\" der.",
            "verse 83:14": "Hayır, hayır; onların kazandıkları kalblerini paslandırıp körletmiştir.",
            "verse 83:15": "Hayır; doğrusu onlar o gün, Rablerinden yoksun kalacaklardır.",
            "verse 83:16": "Sonra onlar, şüphesiz, cehenneme gireceklerdir.",
            "verse 83:17": "Sonra da: \"yalanlayıp durduğunuz işte budur\" denecektir.",
            "verse 83:18": "Ama iyilerin defteri yüksek katlardadır.",
            "verse 83:19": "O yüksek katların ne olduğunu sen bilir misin?",
            "verse 83:20": "O, gözde meleklerin gördüğü, yazılı bir kitapdır.",
            "verse 83:21": "O, gözde meleklerin gördüğü, yazılı bir kitapdır.",
            "verse 83:22": "İyiler, şüphesiz, nimet içinde ve tahtlar üzerinde etrafı seyrederler.",
            "verse 83:23": "İyiler, şüphesiz, nimet içinde ve tahtlar üzerinde etrafı seyrederler.",
            "verse 83:24": "Onları, yüzlerindeki nimet pırıltısından tanırsın.",
            "verse 83:25": "Sonunda misk kokusu bırakan, ağzı kapalı saf bir içecekten içerler. İyi şeyler için yarışanlar, bunun için yarışsınlar.",
            "verse 83:26": "Sonunda misk kokusu bırakan, ağzı kapalı saf bir içecekten içerler. İyi şeyler için yarışanlar, bunun için yarışsınlar.",
            "verse 83:27": "Onun katkısı gözdelerin içtiği yüce kaynaktandır.",
            "verse 83:28": "Onun katkısı gözdelerin içtiği yüce kaynaktandır.",
            "verse 83:29": "Suçlular, şüphesiz, inanmış olanlara gülerlerdi.",
            "verse 83:30": "Yanlarından geçtikleri zaman da birbirlerine göz kırparlardı.",
            "verse 83:31": "Taraftarlarına vardıklarında bununla eğlenirlerdi.",
            "verse 83:32": "İnananları gördükleri zaman: \"Doğrusu bunlar sapık olanlardır\" derlerdi.",
            "verse 83:33": "Oysa kendileri, inananlara gözcü olarak gönderilmemişlerdi.",
            "verse 83:34": "Bugün de, inananlar inkarcılara gülerler.",
            "verse 83:35": "Tahtlar üzerinde, inkarcıların yaptıkları şeylerin karşılığının nasıl verildiğini seyrederler.",
            "verse 83:36": "Tahtlar üzerinde, inkarcıların yaptıkları şeylerin karşılığının nasıl verildiğini seyrederler."
        },
        "Urdu": {
            "verse 83:1": "ناپ اور تول میں کمی کرنے والوں کے لیے خرابی ہے",
            "verse 83:2": "جو لوگوں سے ناپ کر لیں تو پورا لیں",
            "verse 83:3": "اور جب ان کو ناپ کر یا تول کر دیں تو کم کر دیں",
            "verse 83:4": "کیا یہ لوگ نہیں جانتے کہ اٹھائے بھی جائیں گے",
            "verse 83:5": "(یعنی) ایک بڑے (سخت) دن میں",
            "verse 83:6": "جس دن (تمام) لوگ رب العالمین کے سامنے کھڑے ہوں گے",
            "verse 83:7": "سن رکھو کہ بدکارروں کے اعمال سجّین میں ہیں",
            "verse 83:8": "اور تم کیا جانتے ہوں کہ سجّین کیا چیز ہے؟",
            "verse 83:9": "ایک دفتر ہے لکھا ہوا",
            "verse 83:10": "اس دن جھٹلانے والوں کی خرابی ہے",
            "verse 83:11": "(یعنی) جو انصاف کے دن کو جھٹلاتے ہیں",
            "verse 83:12": "اور اس کو جھٹلاتا وہی ہے جو حد سے نکل جانے والا گنہگار ہے",
            "verse 83:13": "جب اس کو ہماری آیتیں سنائی جاتی ہیں تو کہتا ہے کہ یہ تو اگلے لوگوں کے افسانے ہیں",
            "verse 83:14": "دیکھو یہ جو (اعمال بد) کرتے ہیں ان کا ان کے دلوں پر زنگ بیٹھ گیا ہے",
            "verse 83:15": "بےشک یہ لوگ اس روز اپنے پروردگار (کے دیدار) سے اوٹ میں ہوں گے",
            "verse 83:16": "پھر دوزخ میں جا داخل ہوں گے",
            "verse 83:17": "پھر ان سے کہا جائے گا کہ یہ وہی چیز ہے جس کو تم جھٹلاتے تھے",
            "verse 83:18": "(یہ بھی) سن رکھو کہ نیکوکاروں کے اعمال علیین میں ہیں",
            "verse 83:19": "اور تم کو کیا معلوم کہ علیین کیا چیز ہے؟",
            "verse 83:20": "ایک دفتر ہے لکھا ہوا",
            "verse 83:21": "جس کے پاس مقرب (فرشتے) حاضر رہتے ہیں",
            "verse 83:22": "بےشک نیک لوگ چین میں ہوں گے",
            "verse 83:23": "تختوں پر بیٹھے ہوئے نظارے کریں گے",
            "verse 83:24": "تم ان کے چہروں ہی سے راحت کی تازگی معلوم کر لو گے",
            "verse 83:25": "ان کو خالص شراب سربمہر پلائی جائے گی",
            "verse 83:26": "جس کی مہر مشک کی ہو گی تو (نعمتوں کے) شائقین کو چاہیے کہ اسی سے رغبت کریں",
            "verse 83:27": "اور اس میں تسنیم (کے پانی) کی آمیزش ہو گی",
            "verse 83:28": "وہ ایک چشمہ ہے جس میں سے (خدا کے) مقرب پیئیں گے",
            "verse 83:29": "جو گنہگار (یعنی کفار) ہیں وہ (دنیا میں) مومنوں سے ہنسی کیا کرتے تھے",
            "verse 83:30": "اور جب ان کے پاس سے گزرتے تو حقارت سے اشارے کرتے",
            "verse 83:31": "اور جب اپنے گھر کو لوٹتے تو اتراتے ہوئے لوٹتے",
            "verse 83:32": "اور جب ان (مومنوں) کو دیکھتے تو کہتے کہ یہ تو گمراہ ہیں",
            "verse 83:33": "حالانکہ وہ ان پر نگراں بنا کر نہیں بھیجے گئے تھے",
            "verse 83:34": "تو آج مومن کافروں سے ہنسی کریں گے",
            "verse 83:35": "(اور) تختوں پر (بیٹھے ہوئے ان کا حال) دیکھ رہے ہوں گے",
            "verse 83:36": "تو کافروں کو ان کے عملوں کا (پورا پورا) بدلہ مل گیا"
        },
        "Uyghur": {
            "verse 83:1": "(ئۆلچەمدە ۋە تارازىدا) كەم بەرگۈچىلەرگە ۋاي!",
            "verse 83:2": "ئۇلار كىشىلەردىن ئۆلچەپ ئالغان چاغدا، تولۇق ئالىدۇ",
            "verse 83:3": "كىشىلەرگە ئۆلچەپ ياكى تارتىپ بەرگەن چاغدا، كەم بېرىدۇ",
            "verse 83:4": "ئۇلار بۈيۈك بىر كۈندە تىرىلىدىغانلىقىغا ئىشەنمەمدۇ",
            "verse 83:5": "ئۇلار بۈيۈك بىر كۈندە تىرىلىدىغانلىقىغا ئىشەنمەمدۇ",
            "verse 83:6": "ئۇ كۈندە ئىنسانلار ئالەملەرنىڭ پەرۋەردىگارىنىڭ ھۇزۇرىدا تىك تۇرىدۇ،",
            "verse 83:7": "ئۇلار (تارازىدا، ئۆلچەمدە) كەم بېرىشتىن يانسۇن، يامان ئادەملەرنىڭ نامە - ئەمالى چوقۇم سىججىندا بولىدۇ",
            "verse 83:8": "سىججىن دېگەن نېمە؟ ئۇنى قانداق بىلەلەيسەن؟",
            "verse 83:9": "ئۇ (يامان ئادەملەرنىڭ قىلمىشلىرى) خاتىرىلەنگەن بىر دەپتەردۇر",
            "verse 83:10": "بۇ كۈندە ئىنكار قىلغۇچىلارغا ۋاي!",
            "verse 83:11": "ئۇلار قىيامەت كۈنىنى ئىنكار قىلىدۇ",
            "verse 83:12": "ئۇنى پەقەت (كۇفرىدا) ھەددىدىن ئاشقان، ئىنتايىن گۇناھكار ئادەملا ئىنكار قىلىدۇ",
            "verse 83:13": "ئۇنىڭغا بىزنىڭ ئايەتلىرىمىز تىلاۋەت قىلىنسا، ئۇ: «(بۇ) قەدىمكىلەرنىڭ ھېكايىلىرىدۇر» دەيدۇ",
            "verse 83:14": "ھەرگىز ئۇنداق ئەمەس، بەلكى ئۇلارنىڭ گۇناھلىرى تۈپەيلىدىن دىللىرى قارىيىپ كەتكەن",
            "verse 83:15": "ھەرگىز ئۇنداق ئەمەس، ھەقىقەتەن ئۇلار بۇ كۈندە پەرۋەردىگارىنى كۆرۈشتىن مەنئى قىلىنغان",
            "verse 83:16": "ئاندىن ئۇلار ھەقىقەتەن دوزاخقا داخىل بولغۇچىلاردۇر",
            "verse 83:17": "ئاندىن (ئۇلارغا): «مانا بۇ سىلەر ئىنكار قىلغان نەرسە (يەنى ئازاب) دۇر» دېيىلىدۇ",
            "verse 83:18": "راستلا ياخشى بەندىلەرنىڭ نامە - ئەمالى شەك - شۈبھىسىز ئىللىيوندا بولىدۇ",
            "verse 83:19": "ئىللىيوننىڭ نېمە ئىكەنلىكىنى سەن قانداق بىلەلەيسەن؟",
            "verse 83:20": "(ئۇ) ياخشىلارنىڭ ئەمەللىرى خاتىرىلەنگەن دەپتەردۇر",
            "verse 83:21": "ئۇنىڭغا اﷲ نىڭ يېقىن پەرىشتىلىرى گۇۋاھ بولىدۇ",
            "verse 83:22": "ياخشىلار نېمەت ئىچىدە (يەنى جەننەتتە) بولىدۇ",
            "verse 83:23": "ئۇلار تەختلەر ئۈستىدە تۇرۇپ (اﷲ نىڭ جەننەتتە ئۇلارغا بەرگەن تۈرلۈك نېمەتلىرىگە) قارايدۇ",
            "verse 83:24": "ئۇلارغا قارايدىغان بولساڭ، نېمەتنىڭ (ئۇلارنىڭ چىرايلىرىدىن چىقىپ تۇرغان) ئەسىرىنى تونۇيسەن",
            "verse 83:25": "ئۇلار ئاغزى پېچەتلەنگەن ساپ شاراب بىلەن سۇغىرىلىدۇ، ئىچىشنىڭ ئاخىرىدا ئۇنىڭدىن ئىپارنىڭ ھىدى كېلىپ تۇرىدۇ. قىزىققۇچىلار شۇنىڭغا قىزىقسۇن!",
            "verse 83:26": "ئۇلار ئاغزى پېچەتلەنگەن ساپ شاراب بىلەن سۇغىرىلىدۇ، ئىچىشنىڭ ئاخىرىدا ئۇنىڭدىن ئىپارنىڭ ھىدى كېلىپ تۇرىدۇ. قىزىققۇچىلار شۇنىڭغا قىزىقسۇن!",
            "verse 83:27": "ئۇنىڭغا (يەنى ساپ شارابقا) تەسنىمنىڭ (سۈيى) ئارىلاشتۇرۇلغان",
            "verse 83:28": "تەسنىم جەننەتتىكى بىر بۇلاق بولۇپ، ئۇنىڭدىن اﷲ نىڭ يېقىن بەندىلىرى ئىچىدۇ",
            "verse 83:29": "كاپىرلار ھەقىقەتەن مۆمىنلەرنى (مەسخىرە قىلىپ) كۈلەتتى،",
            "verse 83:30": "(مۆمىنلەر) ئۇلارنىڭ ئالدىدىن ئۆتكەندە، ئۇلار ئۆزئارا كۆز قىسىشاتتى،",
            "verse 83:31": "ئۆيلىرىگە قايتقاندا (مۆمىنلەرنىڭ غەيۋىتىنى قىلىپ) مەزە قىلغان ھالدا قايتىشاتتى",
            "verse 83:32": "مۆمىنلەرنى كۆرگەندە: «بۇلار شەكسىز ئاداشقانلار» دېيىشەتتى",
            "verse 83:33": "ئۇلار مۆمىنلەرنى كۈزىتىشكە ئەۋەتىلگىنى يوق",
            "verse 83:34": "بۈگۈن (يەنى قىيامەت كۈنى) مۆمىنلەر كاپىرلاردىن كۈلىدۇ،",
            "verse 83:35": "(كاپىرلار) نىڭ ھالىغا (ئېسىل) تەختلەر ئۈستىدە ئولتۇرۇپ نەزەر تاشلايدۇ",
            "verse 83:36": "(كاپىرلار مۆمىنلەرنى) مەسخىرە قىلغان قىلمىشلىرىنىڭ جازاسىنى تارتتىمۇ؟"
        },
        "Uzbek": {
            "verse 83:1": "Вайл (вой) бўлсин, ўлчовдан уриб қолувчиларга.",
            "verse 83:2": "Улар одамлардан нарса ўлчаб олсалар, тўлиқ оларлар.",
            "verse 83:3": "Ва агар одамларга ўлчаб ёки тортиб берсалар, камайтирарлар.",
            "verse 83:4": "Ана шулар, албатта, қайта тирилтирилишларини ўйламайдиларми?",
            "verse 83:5": "Улуғ бир кунда.",
            "verse 83:6": "У кунда, одамлар оламлар Роббиси ҳузурида тик турарлар.",
            "verse 83:7": "Йўқ! Албатта фожирларларнинг китоби «сижжин»дадир.",
            "verse 83:8": "«Сижжин» қандай нарса эканини сенга нима билдирди?!",
            "verse 83:9": "У ёзилган китобдур.",
            "verse 83:10": "Ўша кунда ёлғонга чиқарувчиларга вайл бўлсин!",
            "verse 83:11": "Улар жазо кунини ёлғонга чиқарарлар.",
            "verse 83:12": "У кунни ҳаддан ошувчи ва ўта гуноҳкорлардан бошқалар ёлғонга чиқармаслар.",
            "verse 83:13": "Қачон унга оятларимиз тиловат қилинса, «авалгиларнинг афсоналари», дер.",
            "verse 83:14": "Йўқ! Уларнинг қилган касблари қалбларига моғор бўлиб ўрнашиб қолган, холос.",
            "verse 83:15": "Йўқ! Албатта, улар ўша кунда ўз Роббиларини кўришдан тўсиларлар.",
            "verse 83:16": "Сўнгра улар албатта жаҳиймга кирувчидирлар.",
            "verse 83:17": "Сўнгра, мана бу, сизлар ёлғонга чиқариб юрган нарса, дейилар.",
            "verse 83:18": "Йўқ! Албатта аброрларнинг китоби «Иллиййун»дадир.",
            "verse 83:19": "«Иллиййун» қандоқ нарса эканини сенга нима билдирди?!",
            "verse 83:20": "У ёзилган китобдур.",
            "verse 83:21": "Унга муқарраб(фаришта)лар шоҳид бўларлар.",
            "verse 83:22": "Албатта, аброрлар жаннати найимдадирлар.",
            "verse 83:23": "Пардали баланд сўрилар устида назар солиб турарлар.",
            "verse 83:24": "Уларнинг чеҳраларидан жаннат равнақини билиб оларсан.",
            "verse 83:25": "Улар муҳрланган, ниҳоятда пок, шаробдан ичарлар.",
            "verse 83:26": "У(шароб)нинг хотимаси мискдир. Ва шу нарса учун мусобақа қилувчилар мусобақа қилсинлар.",
            "verse 83:27": "У(шароб)нинг аралашмаси «тасним»дандир.",
            "verse 83:28": "У(Тасним) бир булоқдирки, ундан муқарраблар ичарлар.",
            "verse 83:29": "Албатта жиноят қилганлар иймон келтирганлар устидан кулар эдилар.",
            "verse 83:30": "Агар ул(мўмин)лар аларнинг ёнидан ўтсалар, масхаралаб, ишоралар қила эдилар.",
            "verse 83:31": "Агар у(кофир)лар ўз аҳллари ҳузурига қайтиб борсалар, ҳузурланиб қайтиб борар эдилар.",
            "verse 83:32": "Ва агар у(мўмин)ларни кўрсалар, «албатта ановилар адашганлар», дер эдилар.",
            "verse 83:33": "Ҳолбуки, улар а(мўмин)лар устидан кузатувчи қилиб юборилган эмаслар!",
            "verse 83:34": "Энди, бу Кунда иймон келтирганлар кофирлар устидан куларлар.",
            "verse 83:35": "Пардали, баланд сўрилар устида назар солиб турарлар.",
            "verse 83:36": "Кофирлар қилган ишларининг «савобини» олар миканлар?!"
        },
        "Vietnamese": {
            "verse 83:1": "Thật khốn thay cho những kẻ gian lận.",
            "verse 83:2": "Những kẻ mà khi nhận của người thì đòi cho đủ.",
            "verse 83:3": "Nhưng khi đong hoặc cân cho người thì lại cân và đong thiếu.",
            "verse 83:4": "Có phải những kẻ đó nghĩ rằng họ sẽ không được phục sinh?",
            "verse 83:5": "Cho một Ngày vĩ đại?",
            "verse 83:6": "Ngày mà nhân loại sẽ đứng trình diện trước Thượng Đế của vũ trụ và vạn vật.",
            "verse 83:7": "Không. Hồ sơ của những kẻ tội lỗi thực sự nằm trong Sijjin.",
            "verse 83:8": "Ngươi (Thiên Sứ Muhammad) có biết Sijjin là gì không?",
            "verse 83:9": "Đó là một quyển sổ ghi chép.",
            "verse 83:10": "Ngày đó sẽ là một thảm họa cho những kẻ phủ nhận (sự thật).",
            "verse 83:11": "Những kẻ đã phủ nhận Ngày Thưởng Phạt.",
            "verse 83:12": "Không ai phủ nhận Ngày đó ngoại trừ những kẻ tội lỗi vượt quá giới hạn.",
            "verse 83:13": "Khi các Lời Mặc Khải của TA được đọc lên, kẻ phủ nhận nói: “Chỉ là những câu chuyện của thời xa xưa!”.",
            "verse 83:14": "Không! Đúng hơn, trái tim của chúng đã bị chai sạn vì những việc làm xấu xa của chúng.",
            "verse 83:15": "Không! Vào Ngày đó, chắc chắn chúng sẽ bị che khuất khỏi Thượng Đế của chúng.",
            "verse 83:16": "Rồi chúng chắc chắn sẽ bị đày vào Hỏa Ngục.",
            "verse 83:17": "Rồi sẽ có lời bảo chúng: “Đây chính là điều mà các ngươi đã thường phủ nhận.”",
            "verse 83:18": "Quả thật, hồ sơ của những người ngoan đạo nằm trong ‘Illi-yin.",
            "verse 83:19": "Ngươi (Thiên Sứ Muhammad) biết gì về ‘Illi-yin?",
            "verse 83:20": "Đó là một quyển sổ ghi chép.",
            "verse 83:21": "Được các Thiên Thần gần kề nơi Allah xác nhận.",
            "verse 83:22": "Thật vậy, những người ngoan đạo và đức hạnh sẽ ở trong Thiên Đàng hạnh phúc.",
            "verse 83:23": "Họ sẽ nghỉ ngơi trên những chiếc ghế dài có lưng tựa, ngắm nhìn xung quanh.",
            "verse 83:24": "Ngươi sẽ nhận ra trên khuôn mặt họ sự rạng rỡ của niềm vui và hạnh phúc.",
            "verse 83:25": "Họ sẽ được cho uống một loại rượu (nguyên chất) tinh khiết được đậy kín.",
            "verse 83:26": "Mùi vị cuối cùng của nó là xạ hương. Vì vậy, hãy để tất cả những người khao khát thi đua cạnh tranh (giành lấy nó).",
            "verse 83:27": "Và nó được pha với một hỗn hợp Tasnim.",
            "verse 83:28": "Được lấy từ ngọn suối chỉ để dành cho những người gần (Allah) nhất uống.",
            "verse 83:29": "Quả thật, những kẻ tội lỗi đã thường cười chê những người có đức tin.",
            "verse 83:30": "Mỗi khi chúng đi ngang qua họ, chúng thường nháy mắt với nhau (thể hiện những cái nhìn chế nhạo).",
            "verse 83:31": "Và khi chúng trở lại với phe của chúng, chúng mang về điều chế giễu và nhạo báng.",
            "verse 83:32": "Và khi nhìn thấy họ, chúng nói với nhau: “Những kẻ này mới chính là những tên lầm lạc!”",
            "verse 83:33": "Nhưng chúng đâu phải là những người được cử phái đến trông chừng họ.",
            "verse 83:34": "Vì vậy, vào Ngày đó, những người có đức tin sẽ cười chê những kẻ vô đức tin trở lại.",
            "verse 83:35": "Họ sẽ nghỉ ngơi trên những chiếc ghế dài có lưng tựa, ngắm nhìn xung quanh.",
            "verse 83:36": "Những kẻ vô đức tin chắc chắn sẽ được đền bù xứng đáng cho những gì mà chúng đã làm!"
        },
        "Yoruba": {
            "verse 83:1": "Egbe ni fun awon oludin-osuwon-ku",
            "verse 83:2": "awon (ontaja) t’o je pe nigba ti won ba won nnkan lodo awon eniyan, won a gba a ni ekun",
            "verse 83:3": "nigba ti awon (ontaja naa) ba si lo iwon fun awon (onraja) tabi lo osuwon fun won, won yoo din in ku",
            "verse 83:4": "Se awon wonyen ko mo daju pe dajudaju A maa gbe won dide",
            "verse 83:5": "ni Ojo nla kan",
            "verse 83:6": "Ni ojo ti awon eniyan yoo dide naro fun Oluwa gbogbo eda",
            "verse 83:7": "Bee ni, dajudaju iwe ise awon eni ibi kuku wa ninu Sijjin",
            "verse 83:8": "Ki si l’o mu o mo ohun t’o n je Sijjin",
            "verse 83:9": "Iwe ti won ti ko ise aburu eda sinu re (ti won si fi pamo sinu ile keje ni Sijjin)",
            "verse 83:10": "Ni ojo yen, egbe ni fun awon olupe-ododo- niro",
            "verse 83:11": "awon t’o n pe Ojo esan niro",
            "verse 83:12": "Ko si si eni t’o n pe e niro afi gbogbo alakoyo, elese",
            "verse 83:13": "Nigba ti won ba n ke awon ayah Wa fun un, o maa wi pe: \"Awon akosile alo awon eni akoko (niwonyi)",
            "verse 83:14": "Rara ko ri bee, amo ohun ti won n se nise ibi l’o joba lori okan won",
            "verse 83:15": "Ni ti ododo, dajudaju won yoo wa ninu gaga, won ko si nii ri Oluwa won ni ojo yen",
            "verse 83:16": "Leyin naa, dajudaju won yoo wo inu ina Jehim",
            "verse 83:17": "Leyin naa, won maa so (fun won) pe: \"Eyi ni ohun ti e n pe niro",
            "verse 83:18": "Bee ni. Dajudaju iwe ise awon eni rere wa ninu ‘illiyyun",
            "verse 83:19": "Ki si l’o mu o mo ohun t’o n je ‘illiyyun",
            "verse 83:20": "Iwe ti won ti ko ise rere eda sinu re (ti won si fi pamo si oke sanmo ni ‘illiyyun)",
            "verse 83:21": "Awon (molaika) ti won sunmo Allahu n jerii si i",
            "verse 83:22": "Dajudaju awon eni rere maa wa ninu igbadun",
            "verse 83:23": "Won yoo maa woran lori awon ibusun",
            "verse 83:24": "Iwo yoo da itutu oju igbadun mo ninu oju won",
            "verse 83:25": "Won yoo maa fun won mu ninu oti onideeri",
            "verse 83:26": "Alumisiki ni (oorun) ipari re. Ki awon alapaantete sapantete ninu iyen",
            "verse 83:27": "Tesnim ni won yoo maa popo (mo oti naa)",
            "verse 83:28": "(Tesnim ni) omi iseleru kan, ti awon olusunmo (Allahu) yoo maa mu",
            "verse 83:29": "Dajudaju awon t’o dese, won maa n fi awon t’o gbagbo ni ododo rerin-in",
            "verse 83:30": "Nigba ti won ba gba egbe won koja, (awon adese) yoo maa seju sira won ni ti yeye",
            "verse 83:31": "Nigba ti won ba si pada si odo awon eniyan won, won a pada ti won yoo maa se faari",
            "verse 83:32": "Ati pe nigba ti won ba ri (awon onigbagbo ododo) won a wi pe: \"Dajudaju awon wonyi ni olusina",
            "verse 83:33": "Awa ko si ran won nise oluso si won",
            "verse 83:34": "Nitori naa, ni oni awon t’o gbagbo ni ododo yoo fi awon alaigbagbo rerin-in",
            "verse 83:35": "Won yoo maa woran lori awon ibusun",
            "verse 83:36": "Sebi won ti fi ohun ti awon alaigbagbo n se nise san won lesan (bayii)"
        }
    }
}