{
    "id": 86,
    "name_simple": "At-Tariq",
    "revelation_place": "makkah",
    "revelation_order": 36,
    "bismillah_pre": true,
    "verses_count": 17,
    "short_text": "The Surah taken its name from the word at-tariq in its first verse.",
    "text": [
        "\n",
        "The Surah taken its name from the word at-tariq in its first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "The style of its subject matter resembles that of the earliest Surahs revealed at Makkah, but this surah was sent down at a stage when the disbelievers of Makkah were employing all sorts of devices and plans to defeat and frustrate the message of the Qur'an and Muhammad (upon whom be Allah's peace and blessings).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "It discuses two themes: first that man has to appear before God after death; second, that the Qur'an is a decisive Word which no plan or device of the disbelievers can defeat or frustrate.",
        "\n",
        "First of all, the stars of the heavens have been cited as an evidence that there is nothing in the universe which may continue to exist and survive without guardian over it. Then man has been asked to consider his own self as to how he has been brought into existence from a mere sperm drop and shaped into a living human being. Then it has been said that the God, Who has so brought him into existence, has certainly the power to create him once again, and this resurrection will be for the purpose to subject to scrutiny all the secrets of man which remained hidden in the world. At that time, man will neither be able to escape the consequences of his deeds by his own power, nor will anyone else come to his rescue.",
        "\n",
        "In conclusion, it has been pointed out that just as the falling of rain from the sky and the sprouting of plants and crops from the earth is no child's play but a serious task, so also the truths expressed in the Qur'an are no jest but a firm and unchangeable reality. The disbelievers are involved in the misunderstanding that their plans and devices will defeat the invitation of the Qur'an, but they do not know that Allah too is devising a plan which will bring to naught all their scheming and planning. Than in one sentence the discourse has been summed up, with a word of consolation to the Holy Prophet (upon whom be peace) and a tacit warning to the disbelievers, saying: \"Have patience for a while: let the disbelievers do their worst. Before long they will themselves realize whether they have been able to defeat the Qur'an by their scheming or the Qur'an has dominated them in the very place where they are exerting their utmost to defeat it.\"",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by the sky of the world and The Nightly Visitor so called because it comes by night and leaves by day. It takes its name from verse 1 which mentions “the night-comer” or “nightly visitor” (ṭāriq). The surah focuses on a series of examples of things coming out: the piercing night-star, spurting semen, the baby that bursts out of the womb, and plants that sprout out of the ground. All of these are used to illustrate resurrection from the grave.The surah is also known as: The Night Star, The Night-Comer, The Night-Visitant, The Nightcomer, The Nightly Visitant, The Piercing Star.",
    "name_translation": "The Nightly Visitor",
    "name_complex": "At-Târiq",
    "surah_name_ar": "الطارق",
    "verses": {
        "Albanian": {
            "verse 86:1": "Betohem në qiellin dhe yllin e natës.",
            "verse 86:2": "E, a e di ti se ç’është ylli i natës?",
            "verse 86:3": "Ai është ylli që shpon terrin (me dritën e vet).",
            "verse 86:4": "Për çdo njeri ka mbikëqyrës (ndaj tij)!",
            "verse 86:5": "Le të shikojë njeriu prej çkahjes është krijuar:",
            "verse 86:6": "është krijuar nga lëngu që kullon (hudhet),",
            "verse 86:7": "i cili del nga kurrizi (i mashkullit) dhe krahërori,",
            "verse 86:8": "dhe, me të vërtetë, Ai (Perëndia) është i pushtetshëm – për ta kthyer (ringjallë) atë,",
            "verse 86:9": "në Ditën kur do të zbulohen sekretet",
            "verse 86:10": "kur njeriu nuk do të ketë as fuqi, as ndihmës.",
            "verse 86:11": "Betohem në qiellin, shëndrues i (plot) gjendjeve",
            "verse 86:12": "dhe Tokën që plasaritet për të mbirë bimët, -",
            "verse 86:13": "Kur’ani, me të vërtetë, është fjalë që ndanë të vërtetën prej të pavërtetës,",
            "verse 86:14": "ai nuk është kurrfarë burleske (tregim i kotë)!",
            "verse 86:15": "Me të vërtetë, at shërbehen me dinakëri (të mëdha),",
            "verse 86:16": "e, Unë i ndëshkojë për dinakërinë, e tyre –",
            "verse 86:17": "andaj, caktoju pak afat jobesimtarëve, lëri në qetësi ata edhe për një çast."
        },
        "Amharic": {
            "verse 86:1": "በሰማዩ በሌሊት መጪውም እምላለሁ፡፡",
            "verse 86:2": "የሌሊት መጪውም ምን እንደ ኾነ ምን አሳወቀህ?",
            "verse 86:3": "ጨለማን ቀዳጁ ኮከብ ነው፡፡",
            "verse 86:4": "ነፍስ ሁሉ በእርሷ ላይ ጠባቂ ያለባት እንጅ ሌላ አይደለችም፡፡",
            "verse 86:5": "ሰውም ከምን እንደተፈጠረ ይመልከት፡፡",
            "verse 86:6": "ከተስፈንጣሪ ውሃ ተፈጠረ፡፡",
            "verse 86:7": "ከጀርባና ከእርግብግብቶች መካከል የሚወጣ ከኾነ (ውሃ)፡፡",
            "verse 86:8": "እርሱ (አላህ) በመመለሱ ላይ በእርግጥ ቻይ ነው፡፡",
            "verse 86:9": "ምስጢሮች በሚገለጡበት ቀን፡፡",
            "verse 86:10": "ለእርሱም (ለሰው) ኀይልና ረዳት ምንም የለውም፡፡",
            "verse 86:11": "የመመለስ ባለቤት በኾነችው ሰማይም እምላለሁ፡፡",
            "verse 86:12": "(በበቃይ) የመሰንጠቅ ባለቤት በኾነችው ምድርም፤",
            "verse 86:13": "እርሱ (እውነትን ከውሸት) የሚለይ ቃል ነው፡፡",
            "verse 86:14": "እርሱም ቀልድ አይደለም፡፡",
            "verse 86:15": "እነርሱ በእርግጥ ተንኮልን ይሠራሉ፡፡",
            "verse 86:16": "(እኔ) ተንኮልንም እመልሳለሁ፡፡",
            "verse 86:17": "ከሓዲዎችንም ቀን ስጣቸው፡፡ ጥቂትን ጊዜ አቆያቸው፡፡"
        },
        "Arabic": {
            "verse 86:1": "ِقِراَّطلاَو ِءاَمَّسلاَو",
            "verse 86:2": "ُقِراَّطلا اَم َكاَرْدَأ اَمَو",
            "verse 86:3": "ُبِقاَّثلا ُمْجَّنلا",
            "verse 86:4": "ٌظِفاَح اَهْيَلَع اَّمَّل ٍسْفَن ُّلُك نِإ",
            "verse 86:5": "َقِلُخ َّمِم ُناَسنِإْلا ِرُظنَيْلَف",
            "verse 86:6": "ٍقِفاَد ٍءاَّم نِم َقِلُخ",
            "verse 86:7": "ِبِئاَرَّتلاَو ِبْلُّصلا ِنْيَب نِم ُجُرْخَي",
            "verse 86:8": "ٌرِداَقَل ِهِعْجَر ٰىَلَع ُهَّنِإ",
            "verse 86:9": "ُرِئاَرَّسلا ىَلْبُت َمْوَي",
            "verse 86:10": "(ٍرِصاَن اَلَو ٍةَّوُق نِم ُهَل اَمَف",
            "verse 86:11": "(ِعْجَّرلا ِتاَذ ِءاَمَّسلاَو",
            "verse 86:12": "(ِعْدَّصلا ِتاَذ ِضْرَأْلاَو",
            "verse 86:13": "(ٌلْصَف ٌلْوَقَل ُهَّنِإ",
            "verse 86:14": "(ِلْزَهْلاِب َوُه اَمَو",
            "verse 86:15": "(اًدْيَك َنوُديِكَي ْمُهَّنِإ",
            "verse 86:16": "(اًدْيَك ُديِكَأَو",
            "verse 86:17": "(اًدْيَوُر ْمُهْلِهْمَأ َنيِرِفاَكْلا ِلِّهَمَف"
        },
        "Azerbaijani": {
            "verse 86:1": "And olsun səmaya və gecə yolçusuna!",
            "verse 86:2": "Sən nə bilirsən ki, gecə yolçusu nədir?",
            "verse 86:3": "Bu, qaranlıqları dəlib keçən ulduzdur.",
            "verse 86:4": "Elə bir kimsə yoxdur ki, onun üzərində gözətçi olmasın!",
            "verse 86:5": "Qoy insan nədən yaradıldığına bir baxsın!",
            "verse 86:6": "O, süzülüb tökülən bir mayedən yaradılmışdır.",
            "verse 86:7": "Bu maye bel və köks sümükləri arasından çıxır.",
            "verse 86:8": "Şübhəsiz ki, Allah onu dirildib qaytarmağa qadirdir.",
            "verse 86:9": "Sirlərin sınaqdan keçiriləcəyi gün,",
            "verse 86:10": "onun nə bir qüvvəsi, nə də bir köməkçisi olar.",
            "verse 86:11": "And olsun yağmurla qayıdan göyə!",
            "verse 86:12": "And olsun növbənöv bitkilərlə yarılan yerə!",
            "verse 86:13": "Həqiqətən, bu, haqqı batildən ayırd edən bir kəlamdır.",
            "verse 86:14": "O, əyləncə də deyildir.",
            "verse 86:15": "Həqiqətən, kafirlər hiylə qururlar.",
            "verse 86:16": "Mən də hiylə qururam.",
            "verse 86:17": "Kafirlərə hələ möhlət ver! Onlara bir az da möhlət ver."
        },
        "Bengali": {
            "verse 86:1": "শপথ আকাশের এবং রাত্রিতে আগমনকারীর।",
            "verse 86:2": "আপনি জানেন, যে রাত্রিতে আসে সেটা কি?",
            "verse 86:3": "সেটা এক উজ্জ্বল নক্ষত্র।",
            "verse 86:4": "প্রত্যেকের উপর একজন তত্ত্বাবধায়ক রয়েছে।",
            "verse 86:5": "অতএব, মানুষের দেখা উচিত কি বস্তু থেকে সে সৃজিত হয়েছে।",
            "verse 86:6": "সে সৃজিত হয়েছে সবেগে স্খলিত পানি থেকে।",
            "verse 86:7": "এটা নির্গত হয় মেরুদন্ড ও বক্ষপাজরের মধ্য থেকে।",
            "verse 86:8": "নিশ্চয় তিনি তাকে ফিরিয়ে নিতে সক্ষম।",
            "verse 86:9": "যেদিন গোপন বিষয়াদি পরীক্ষিত হবে,",
            "verse 86:10": "সেদিন তার কোন শক্তি থাকবে না এবং সাহায্যকারীও থাকবে না।",
            "verse 86:11": "শপথ চক্রশীল আকাশের",
            "verse 86:12": "এবং বিদারনশীল পৃথিবীর",
            "verse 86:13": "নিশ্চয় কোরআন সত্য-মিথ্যার ফয়সালা।",
            "verse 86:14": "এবং এটা উপহাস নয়।",
            "verse 86:15": "তারা ভীষণ চক্রান্ত করে,",
            "verse 86:16": "আর আমিও কৌশল করি।",
            "verse 86:17": "অতএব, কাফেরদেরকে অবকাশ দিন, তাদেরকে অবকাশ দিন, কিছু দিনের জন্যে।"
        },
        "Berber Amazigh": {
            "verse 86:1": "S igenni, akked yitri n yiv!",
            "verse 86:2": "W ara k imlen d acu t itri n yiv?",
            "verse 86:3": "Ipôeôiq itri n yiv.",
            "verse 86:4": "Yal iman fellas amêareb.",
            "verse 86:5": "Ad iwali umdan seg wacu ipwaxleq.",
            "verse 86:6": "Ipwaxleq s waman id ifin.",
            "verse 86:7": "Ff$en ed ger tgeééal akked tgwejda.",
            "verse 86:8": "Ih, Izmer a t id Issker, Neppa.",
            "verse 86:9": "Ass ideg lesrar ur drigen ara.",
            "verse 86:10": "Ur isâi kra n tezmert ne$ n tallalt.",
            "verse 86:11": "S igenni bab n tririt!",
            "verse 86:12": "S tmurt ipceqqiqen!",
            "verse 86:13": "Ar neppa d awal ifeûûlen.",
            "verse 86:14": "Ur illi d urar waya.",
            "verse 86:15": "Atnan, ih, ppandin ticeôkep.",
            "verse 86:16": "Ad Andi$ ticeôkep.",
            "verse 86:17": "I ijehliyen eoo lmudda, eoo asen cwiî lmudda."
        },
        "Bosnian": {
            "verse 86:1": "Tako mi neba i Danice!",
            "verse 86:2": "A znaš li ti šta je Danica?",
            "verse 86:3": "Zvijezda blistava!",
            "verse 86:4": "Nema čovjeka nad kojim neko ne bdije.",
            "verse 86:5": "Nek čovjek pogleda od čega je stvoren!",
            "verse 86:6": "Stvoren je od tekućine koja se izbaci,",
            "verse 86:7": "koja između kičme i grudi izlazi,",
            "verse 86:8": "i On je, zaista, kadar da ga ponovo stvori",
            "verse 86:9": "onoga Dana kada budu ispitivane savjesti,",
            "verse 86:10": "kada čovjek ni snage ni branioca neće imati.",
            "verse 86:11": "I tako mi neba puna kiše",
            "verse 86:12": "i Zemlje koja se otvara da rastinje nikne,",
            "verse 86:13": "Kur'an je, doista, govor koji rastavlja istinu od neistine,",
            "verse 86:14": "lakrdija nikakva on nije!",
            "verse 86:15": "Oni se služe spletkama,",
            "verse 86:16": "a Ja ih uništavam –",
            "verse 86:17": "zato nevjernicima još vremena dadni, još koji trenutak ih ostavi."
        },
        "Bulgarian": {
            "verse 86:1": "Кълна се в небето и във Вечерницата!",
            "verse 86:2": "А откъде да знаеш ти какво е Вечерницата?",
            "verse 86:3": "Звездата с пронизваща светлина.",
            "verse 86:4": "Над всяка душа има надзорник.",
            "verse 86:5": "И да погледне човекът от какво бе сътворен!",
            "verse 86:6": "Бе сътворен от изтласкваща се вода,",
            "verse 86:7": "която излиза измежду гръбнака и ребрата.",
            "verse 86:8": "Способен е Той да го върне -",
            "verse 86:9": "в Деня, когато ще бъдат изявени тайните",
            "verse 86:10": "и не ще има той нито сила, нито избавител.",
            "verse 86:11": "Кълна се в небето, от което вали,",
            "verse 86:12": "и в земята, която се разпуква,",
            "verse 86:13": "че това е слово-разграничение.",
            "verse 86:14": "А не е шега.",
            "verse 86:15": "Те замислят с умисъл.",
            "verse 86:16": "И Аз замислям с умисъл.",
            "verse 86:17": "И дай отсрочка на неверниците, отсрочи ги за кратко!"
        },
        "Chinese": {
            "verse 86:1": "以穷苍和启明星盟誓，",
            "verse 86:2": "你怎能知道启明星是什麽？",
            "verse 86:3": "是那灿烂的明星。",
            "verse 86:4": "每个人，都有一个保护者。",
            "verse 86:5": "人应当想一想，他自己是用什麽造成的？",
            "verse 86:6": "他是射出的精液造成的。",
            "verse 86:7": "那精液是从脊柱和肋骨之间发出的。",
            "verse 86:8": "真主确是能使他复原的，",
            "verse 86:9": "那是在一切秘密被揭穿之日。",
            "verse 86:10": "他绝没有能力，也没有援助者。",
            "verse 86:11": "以含雨的云",
            "verse 86:12": "和有缝的地发誓，",
            "verse 86:13": "这确是分别真伪的言辞，",
            "verse 86:14": "这不是笑话。",
            "verse 86:15": "他们必定要用计谋，",
            "verse 86:16": "我也要用计谋。",
            "verse 86:17": "所以你当宽限不信道的人们，你当宽限他们一下。"
        },
        "Danish": {
            "verse 86:1": "Bij de hemel en bij de morgenster",
            "verse 86:2": "En wat weet gij (er van) wat de morgenster is",
            "verse 86:3": "Het is een ster van doordringende helderheid",
            "verse 86:4": "Er is geen ziel waarover geen wachter is",
            "verse 86:5": "Laat de mens derhalve overwegen waaruit hij geschapen werd",
            "verse 86:6": "Hij werd uit een stromende vloeistof geschapen",
            "verse 86:7": "Welke voortkomt van tussen de ruggegraat en de ribben",
            "verse 86:8": "Voorzeker, Hij kan hem (tot het leven) terugroepen",
            "verse 86:9": "Op de Dag waarop de geheimen zullen worden geopenbaard",
            "verse 86:10": "Dan zal hij geen kracht en geen helper hebben",
            "verse 86:11": "Bij de wolk die regen geeft",
            "verse 86:12": "En de aarde, die door planten splijt",
            "verse 86:13": "Dit is zeker een beslissend woord",
            "verse 86:14": "Het is geen scherts",
            "verse 86:15": "Voorwaar zij smeden een plan",
            "verse 86:16": "En ook Ik smeed een (machtiger) plan",
            "verse 86:17": "Geef derhalve de ongelovigen voor een wijle uitstel"
        },
        "Dutch": {
            "verse 86:1": "Bij de hemel en de verlichtende ster.",
            "verse 86:2": "En wat doet jou weten wat de verlichtende ster is?",
            "verse 86:3": "De doordringende ster.",
            "verse 86:4": "Voorwaar, er is geen ziel of er is een bewaker over aangesteld.",
            "verse 86:5": "Laat de mens er daarom over denken waarvan hij geschapen is.",
            "verse 86:6": "Geschapen is hij van een spurtend water.",
            "verse 86:7": "Dat komt van tussen de lendenen en de ribben.",
            "verse 86:8": "Voorwaar, Hij heeft zeker macht over zijn terugkeer.",
            "verse 86:9": "Op de Dag dat de harten beproefd worden.",
            "verse 86:10": "Dan heeft hij geen kracht en geen helper.",
            "verse 86:11": "Bij de hemel, regen bevattend.",
            "verse 86:12": "En bij de aarde, planten bevattend.",
            "verse 86:13": "Voorwaar, hij (de Koran) is zeker een beslissend Woord.",
            "verse 86:14": "En hij bevat geen scherts.",
            "verse 86:15": "Voorwaar, zij beramen een plan.",
            "verse 86:16": "En Ik beraam een plan.",
            "verse 86:17": "Geef daarom de ongelovigen uitstel, geef hun even uitstel."
        },
        "English": {
            "verse 86:1": "By the sky and the night comer -",
            "verse 86:2": "And what can make you know what is the night comer?",
            "verse 86:3": "It is the piercing star -",
            "verse 86:4": "There is no soul but that it has over it a protector.",
            "verse 86:5": "So let man observe from what he was created.",
            "verse 86:6": "He was created from a fluid, ejected,",
            "verse 86:7": "Emerging from between the backbone and the ribs.",
            "verse 86:8": "Indeed, Allah, to return him [to life], is Able.",
            "verse 86:9": "The Day when secrets will be put on trial,",
            "verse 86:10": "Then man will have no power or any helper.",
            "verse 86:11": "By the sky which returns [rain]",
            "verse 86:12": "And [by] the earth which cracks open,",
            "verse 86:13": "Indeed, the Qur'an is a decisive statement,",
            "verse 86:14": "And it is not amusement.",
            "verse 86:15": "Indeed, they are planning a plan,",
            "verse 86:16": "But I am planning a plan.",
            "verse 86:17": "So allow time for the disbelievers. Leave them awhile."
        },
        "Filipino": {
            "verse 86:1": "Sa pamamagitan ng langit at At-Tariq (ang dumarating na panauhin sa gabi, alalaong baga, ang maningning na bituin)",
            "verse 86:2": "Ah! Ano baga kaya ang ipinapahiwatig sa inyo ng At-Tariq (ang panggabing panauhin)",
            "verse 86:3": "Ito ay isang Bituin (na may naglalagos) na liwanag",
            "verse 86:4": "walang sinumang tao (kaluluwa) ang walang may tagapangalaga sa kanya (alalaong baga, ang mga Anghel na nakatalaga sa bawat tao at nagbabantay sa kanya, na nagtatala ng kanyang mabuti at masamang gawa, atbp)",
            "verse 86:5": "Ngayon, (hayaan) ang tao ang makatunghay 952 kung ano ang pinagmulan ng kanyang pagkalikha",
            "verse 86:6": "Siya ay nilikha mula sa isang patak na sumago",
            "verse 86:7": "Na nanggagaling sa pagitan ng gulugod at mga tadyang",
            "verse 86:8": "Katotohanan! Siya (Allah) lamang ang may kakayahan na muling magsauli ng (kanyang) buhay",
            "verse 86:9": "Sa Araw na ang lahat ng mga lihim (mga gawa, pagdarasal, pag-aayuno, kawanggawa, atbp.) ay mabubunyag at susuriin (kung katotohanan)",
            "verse 86:10": "Kaya’t (ang tao) ay walang magiging kapangyarihan at wala ring magiging katuwang",
            "verse 86:11": "Sa pamamagitan ng alapaap (na may balongngtubig) nanagpapamalisbisngulannangpaulit-ulit",
            "verse 86:12": "At sa kalupaan na nagbibitak (sa pagsulpot at pagtubo ng mga puno at halaman)",
            "verse 86:13": "Pananganan! Katotohanang ito (ang Qur’an) ang Pahayag na nagbubukod (sa pagkakaiba) ng katotohanan at kabulaanan (ng tumpak at mali at nag- uutos ng mahigpit na mga batas sa sangkatauhan upang masugpo ang ugat ng kasamaan)",
            "verse 86:14": "At ito ay hindi isang bagay na paglilibang lamang",
            "verse 86:15": "Katotohanang sila ay nagbabalak ng isang pakana (laban sa iyo, o Muhammad)",
            "verse 86:16": "At Ako (Allah) rin ay nagbabalak ng isang pakana (laban sa kanila)",
            "verse 86:17": "Kaya’t bigyan ninyo ng palugit ang mga hindi sumasampalataya (na mamahinga). (Sa ngayon), sila ay pansamantala ninyong pakitunguhan nang mabayanad"
        },
        "French": {
            "verse 86:1": "Par le ciel et par l'astre nocturne",
            "verse 86:2": "Et qui te dira ce qu'est l'astre nocturne?",
            "verse 86:3": "C'est l'étoile vivement brillante.",
            "verse 86:4": "Il n'est pas d'âme qui n'ait sur elle un gardien.",
            "verse 86:5": "Que l'homme considère donc de quoi il a été créé.",
            "verse 86:6": "Il a été créé d'une giclée d'eau",
            "verse 86:7": "sortie d'entre les lombes et les côtes.",
            "verse 86:8": "Allah est certes capable de le ressusciter.",
            "verse 86:9": "Le jour où les cœurs dévoileront leurs secrets,",
            "verse 86:10": "Il n'aura alors ni force ni secoureur.",
            "verse 86:11": "Par le ciel qui fait revenir la pluie!",
            "verse 86:12": "et par la terre qui se fend!",
            "verse 86:13": "Ceci [le Coran] est certes, une parole décisive [qui tranche entre le vrai et le faux],",
            "verse 86:14": "et non point une plaisanterie frivole!",
            "verse 86:15": "Ils se servent d'une ruse,",
            "verse 86:16": "et Moi aussi Je me sers de Mon plan.",
            "verse 86:17": "Accorde (ô Prophète) donc un délai aux infidèles: accorde-leur un court délai."
        },
        "Fulah": {
            "verse 86:1": "O woondirii kammu e hoodere fuɗoore jemma",
            "verse 86:2": "Hol ko anndin ma ko woni hoodere feeñoore jemma",
            "verse 86:3": "Hoodere fooynunde",
            "verse 86:4": "Alah fittaandu si wonah ina e dow mayru deenoowo",
            "verse 86:5": "Yo aade ndaaru ko o tagraa ko",
            "verse 86:6": "O tagiraama ko e ndiyam nduñotoɗam",
            "verse 86:7": "Hombo e hakkunde keeci gorko e ƴi*e ɓernde debba",
            "verse 86:8": "Hombo hattani ruttude mbo",
            "verse 86:9": "ñande cuuɗiiɗi kuncaa",
            "verse 86:10": "Alanah mbo semmbe wonah balloowo",
            "verse 86:11": "Mi woondirii kammu jom ɗate ngun",
            "verse 86:12": "O woondirii leydi mbaɗndi petti",
            "verse 86:13": "Pellet o Quraana kombo ceerndoowol",
            "verse 86:14": "Mbo wonah gaajaate",
            "verse 86:15": "Pellet kamɓe hoɓe pewja peeje",
            "verse 86:16": "Mi fewja feere",
            "verse 86:17": "Muñanɓe muñangol setta"
        },
        "German": {
            "verse 86:1": "Beim Himmel und dem Pochenden!",
            "verse 86:2": "Und was läßt dich wissen, was der Pochende ist?",
            "verse 86:3": "(Es ist) der durchbohrend helle Stem.",
            "verse 86:4": "Es gibt keine Seele, über der nicht ein Hüter (eingesetzt) ist.",
            "verse 86:5": "So soll der Mensch doch hinsehen, woraus er erschaffen ist.",
            "verse 86:6": "Er ist aus sich ergießendem Wasser erschaffen,",
            "verse 86:7": "das zwischen der Lende und der (weiblichen) Brust hervorkommt.",
            "verse 86:8": "Er hat die Macht dazu, ihn zurückkehren zu lassen,",
            "verse 86:9": "am Tag, da die geheimsten Gedanken geprüft werden.",
            "verse 86:10": "Dann hat er weder Kraft noch einen Helfer.",
            "verse 86:11": "Beim Himmel mit der Wiederkehr",
            "verse 86:12": "und der Erde mit ihren Sprüngen!",
            "verse 86:13": "Er ist wahrlich ein entscheidendes Wort;",
            "verse 86:14": "er ist kein Scherz.",
            "verse 86:15": "Sie wenden eine List an,",
            "verse 86:16": "Und Ich wende eine List an.",
            "verse 86:17": "So lasse den Ungläubigen noch Zeit; lasse ihnen nur eine Weile Zeit."
        },
        "Hausa": {
            "verse 86:1": "Inã rantsuwa da sama da mai aukõwa da dare.",
            "verse 86:2": "To, mẽ yã sanar da kai abin da ake cẽwa mai aukõwa da dare?",
            "verse 86:3": "Shi ne taurãron nan mai tsananin haske.",
            "verse 86:4": "Bãbu wani rai fãce a kansa akwai wani mai tsaro.",
            "verse 86:5": "To, mutum ya dũba, daga mẽ aka halittã shi?",
            "verse 86:6": "An halittã shi daga wani ruwa mai tunkuɗar jũna.",
            "verse 86:7": "Yanã fita daga tsakanin tsatso da karankarman ƙirji.",
            "verse 86:8": "Lalle ne Shi (Allah), ga mayar da shi (mutum), tabbas Mai iyãwa ne.",
            "verse 86:9": "Rãnar da ake jarrabawar asirai.",
            "verse 86:10": "Saboda haka, bã shi da wani ƙarfi, kuma bã shi da wani mai taimako (da zai iya kãre shi daga azãbar Allah).",
            "verse 86:11": "Ina rantsuwa da sama ma'abũciyar ruwa mai kõmãwa yana yankẽwa.",
            "verse 86:12": "Da ƙasa ma'abũciyar tsãgẽwa,",
            "verse 86:13": "Lalle ne shĩ (Alƙur'ãni), haƙĩƙa magana ce daki-daki",
            "verse 86:14": "Kuma shĩ bã bananci bane",
            "verse 86:15": "Lalle ne sũ, suna ƙulla kaidi na sõsai.",
            "verse 86:16": "Kuma Ni, Ina mayar da kaidi (gare su) kamar yadda suke ƙulla kaidi.",
            "verse 86:17": "Saboda haka, ka yi wa kafirai jinkiri, ka dakata musu, sannu-sannu."
        },
        "Hindi": {
            "verse 86:1": "आसमान और रात को आने वाले की क़सम",
            "verse 86:2": "और तुमको क्या मालूम रात को आने वाला क्या है",
            "verse 86:3": "(वह) चमकता हुआ तारा है",
            "verse 86:4": "(इस बात की क़सम) कि कोई शख़्श ऐसा नहीं जिस पर निगेहबान मुक़र्रर नहीं",
            "verse 86:5": "तो इन्सान को देखना चाहिए कि वह किस चीज़ से पैदा हुआ हैं",
            "verse 86:6": "वह उछलते हुए पानी (मनी) से पैदा हुआ है",
            "verse 86:7": "जो पीठ और सीने की हड्डियों के बीच में से निकलता है",
            "verse 86:8": "बेशक ख़ुदा उसके दोबारा (पैदा) करने पर ज़रूर कुदरत रखता है",
            "verse 86:9": "जिस दिन दिलों के भेद जाँचे जाएँगे",
            "verse 86:10": "तो (उस दिन) उसका न कुछ ज़ोर चलेगा और न कोई मददगार होगा",
            "verse 86:11": "चक्कर (खाने) वाले आसमान की क़सम",
            "verse 86:12": "और फटने वाली (ज़मीन की क़सम)",
            "verse 86:13": "बेशक ये क़ुरान क़ौले फ़ैसल है",
            "verse 86:14": "और लग़ो नहीं है",
            "verse 86:15": "बेशक ये कुफ्फ़ार अपनी तदबीर कर रहे हैं",
            "verse 86:16": "और मैं अपनी तद्बीर कर रहा हूँ",
            "verse 86:17": "तो काफ़िरों को मोहलत दो बस उनको थोड़ी सी मोहलत दो"
        },
        "Indonesian": {
            "verse 86:1": "Demi langit dan yang datang pada malam hari,",
            "verse 86:2": "tahukah kamu apakah yang datang pada malam hari itu?",
            "verse 86:3": "(yaitu) bintang yang cahayanya menembus,",
            "verse 86:4": "tidak ada suatu jiwapun (diri) melainkan ada penjaganya.",
            "verse 86:5": "Maka hendaklah manusia memperhatikan dari apakah dia diciptakan?",
            "verse 86:6": "Dia diciptakan dari air yang dipancarkan,",
            "verse 86:7": "yang keluar dari antara tulang sulbi laki-laki dan tulang dada perempuan.",
            "verse 86:8": "Sesungguhnya Allah benar-benar kuasa untuk mengembalikannya (hidup sesudah mati).",
            "verse 86:9": "Pada hari dinampakkan segala rahasia,",
            "verse 86:10": "maka sekali-kali tidak ada bagi manusia itu suatu kekuatanpun dan tidak (pula) seorang penolong.",
            "verse 86:11": "Demi langit yang mengandung hujan",
            "verse 86:12": "dan bumi yang mempunyai tumbuh-tumbuhan,",
            "verse 86:13": "sesungguhnya Al Quran itu benar-benar firman yang memisahkan antara yang hak dan yang bathil.",
            "verse 86:14": "dan sekali-kali bukanlah dia senda gurau.",
            "verse 86:15": "Sesungguhnya orang kafir itu merencanakan tipu daya yang jahat dengan sebenar-benarnya.",
            "verse 86:16": "Dan Akupun membuat rencana (pula) dengan sebenar-benarnya.",
            "verse 86:17": "Karena itu beri tangguhlah orang-orang kafir itu yaitu beri tangguhlah mereka itu barang sebentar."
        },
        "Italian": {
            "verse 86:1": "Per il cielo e per l'astro notturno,",
            "verse 86:2": "e chi mai ti dirà cos'è l'astro notturno?",
            "verse 86:3": "È la fulgida stella.",
            "verse 86:4": "Non c'è anima alcuna che non abbia su di sé un [angelo] guardiano.",
            "verse 86:5": "Consideri dunque l'uomo da che cosa fu creato!",
            "verse 86:6": "Da un liquido eiaculato,",
            "verse 86:7": "che esce di tra i lombi e le costole.",
            "verse 86:8": "[Allah] è certo capace di ricondurlo,",
            "verse 86:9": "nel Giorno in cui i segreti saranno svelati,",
            "verse 86:10": "e [l'uomo] non avrà più né forza, né ausilio.",
            "verse 86:11": "Per il cielo che ritorna incessantemente",
            "verse 86:12": "e per la terra quando si fende:",
            "verse 86:13": "in verità questa è Parola decisiva,",
            "verse 86:14": "per nulla frivola.",
            "verse 86:15": "Invero tramano insidie,",
            "verse 86:16": "e Io tesso la Mia strategia.",
            "verse 86:17": "Concedi una dilazione ai miscredenti, da' loro un po' di tempo."
        },
        "Japanese": {
            "verse 86:1": "天と，夜訪れるものによって（誓う）。",
            "verse 86:2": "夜訪れる者が何であるかを，あなたに理解させるものは何か。",
            "verse 86:3": "（それは）きらめき輝く星。",
            "verse 86:4": "誰も自分の上に守護者（天使）をもたない者はない。",
            "verse 86:5": "人間は，何から創られたかを考察させなさい。",
            "verse 86:6": "かれは噴出する水から創られ，",
            "verse 86:7": "（それは）肋骨と腰の間から出てくる。",
            "verse 86:8": "本当にかれは，かれを（新たな生命に）引き戻すことが可能である。",
            "verse 86:9": "隠されたことが暴露される日，",
            "verse 86:10": "（人間には）力もなく，誰の助けもない。",
            "verse 86:11": "（回転して）返る天によって，",
            "verse 86:12": "裂け割れる大地によって（誓う）。",
            "verse 86:13": "本当にこれは，（善悪を）識別する御言葉，",
            "verse 86:14": "それは戯れごとではない。",
            "verse 86:15": "本当にかれらは，陰謀を企んでいる。",
            "verse 86:16": "われもまた策謀をめぐらす。",
            "verse 86:17": "だから不信者たちを猶予し，暫く放任するがいい。"
        },
        "Jawa": {
            "verse 86:1": "Demi langit lan kang teka ing wajah wengi",
            "verse 86:2": "Sapa kang meruhake sira, apa kang teka ing wajah wengi iku",
            "verse 86:3": "Yaiku lintang kang padange nembus peteng",
            "verse 86:4": "Siji - sijine pengawal awak iku ora ana kang tanpa pengawal",
            "verse 86:5": "Mulane, Manungsa amaspadakna, awake iku apa sing digawe",
            "verse 86:6": "Sing digawe saka banyu sing mancrut",
            "verse 86:7": "Metu saka ing antarane geger lan iga",
            "verse 86:8": "Allah kuwasa nguripake manungsa sawuse mati",
            "verse 86:9": "Hiya iku besuk dina qiyamat nalika wadi padha kawiyak",
            "verse 86:10": "Ora bakal dheweke duwe kekuatan nulak siksa lan ora ana kang bisa nulungi",
            "verse 86:11": "Demi langit kang ana udane",
            "verse 86:12": "Demi bumi kang bledhag metu thetukulane",
            "verse 86:13": "Temen Al-Quran iku pangandikaning Allah kang bedakake bener lan luput",
            "verse 86:14": "Dudu sembranan lan jelomprongan",
            "verse 86:15": "Wong kafir padha nandukake pahekan kang elek banget",
            "verse 86:16": "Ingsun uga males pahekane si kafir",
            "verse 86:17": "(Muhammad) Mulane para kafir srantekna, Ingsun uga nyerantekke sawatara rusake si kafir mau"
        },
        "Kazakh": {
            "verse 86:1": "Аспанмен және Тариқпен жарық жұлдызбен ант етемін",
            "verse 86:2": "Ей, Мұхаммед Тариқтың жарық жұлдыздың не екенін саған не білдірді",
            "verse 86:3": "Ол жарығы өткір жұлдыз",
            "verse 86:4": "Анығында, әрбір жанның үстінде сақтаушы бар",
            "verse 86:5": "Ал енді адам өзінің не нәрседен жаратылғанына бір қарасын",
            "verse 86:6": "Ол атылып шыққан судан жаратылған",
            "verse 86:7": "Бел сүйегі мен көкірек сүйегінің арасынан шығады",
            "verse 86:8": "Ақиқатында, Ол оны қайтаруға күші жетеді",
            "verse 86:9": "Сырлар сынаққа тартылған сол күні",
            "verse 86:10": "оның кәпірдің күші-қуаты да, көмек берушісі де болмайды",
            "verse 86:11": "Қайталаушы жаңбырлы аспанмен ант етемін",
            "verse 86:12": "Тілімденіп айырылушы жермен ант етемін",
            "verse 86:13": "Анығында ол Құран айырушы Сөз",
            "verse 86:14": "ол әзіл емес",
            "verse 86:15": "Негізінде, олар имансыздар қулықпен айлакерлік түзуде",
            "verse 86:16": "Мен де айла-шарғыларынақарсы шара қолданамын",
            "verse 86:17": "Ей, Мұхаммед! Кәпірлерге уақыт бер де оларды аз ғана кейінге қалдыр"
        },
        "Korean": {
            "verse 86:1": "하늘과 샛별을 두고 맹세하사하늘과 샛별을 두고 맹세하사",
            "verse 86:2": "샛별이 무엇인지 무엇이 그대 에게 설명하여 주리요샛별이 무엇인지 무엇이 그대 에게 설명하여 주리요",
            "verse 86:3": "그것은 빛나는 별이라그것은 빛나는 별이라",
            "verse 86:4": "모든 인간에게는 그를 감시하 는 자가 있나니모든 인간에게는 그를 감시하 는 자가 있나니",
            "verse 86:5": "그가 무엇으로부터 창조되었 는지 생각케 하라그가 무엇으로부터 창조되었 는지 생각케 하라",
            "verse 86:6": "떨어지는 한 방울의 정액으로 창조되며떨어지는 한 방울의 정액으로 창조되며",
            "verse 86:7": "그 정액은 등뼈와 늑골 사이 에서 나오는 것이라그 정액은 등뼈와 늑골 사이 에서 나오는 것이라",
            "verse 86:8": "이렇듯 하나님은 그 인간을 부활케 하실 수 있으시며이렇듯 하나님은 그 인간을 부활케 하실 수 있으시며",
            "verse 86:9": "숨겨진 모든 것들이 명백하 게 드러나는 그날숨겨진 모든 것들이 명백하 게 드러나는 그날",
            "verse 86:10": "인간은 아무런 힘도 그리고구원자도 없노라인간은 아무런 힘도 그리고구원자도 없노라",
            "verse 86:11": "비를 보내는 하늘을 두고 맹세하사비를 보내는 하늘을 두고 맹세하사",
            "verse 86:12": "식물을 싹트게 하는 대지를두고 맹세하나니식물을 싹트게 하는 대지를두고 맹세하나니",
            "verse 86:13": "실로 이것은 선악을 구별하는 말씀으로실로 이것은 선악을 구별하는 말씀으로",
            "verse 86:14": "농담을 위한 것이 아니라농담을 위한 것이 아니라",
            "verse 86:15": "음모하는 그들에게음모하는 그들에게",
            "verse 86:16": "내가 방책을 세위 두었으니내가 방책을 세위 두었으니",
            "verse 86:17": "잠시 불신자들을 그대로 두라 얼마후에 그들을 벌하리라잠시 불신자들을 그대로 두라 얼마후에 그들을 벌하리라"
        },
        "Kurdish": {
            "verse 86:1": "Bi ezman û bi sitêrka qulokerسوێند به ئاسمان و ئه‌و ئه‌ستێرانه‌ی به‌شه‌ودا ده‌رده‌که‌ون.",
            "verse 86:2": "(Muhemmed!) ka tu ji ku dizanî ewa (sitêrka) quloker çîyeجا تۆ چووزانی (طارق) چیه‌.",
            "verse 86:3": "Ewa sitêrka bi runahî û rêjoke yeئه‌ستێره‌یه‌که به ڕووناکیه‌که‌ی تاریکی ده‌بڕێت.",
            "verse 86:4": "(Sond dixum!) ku li ser hemû candaran, parisvanekî wî heye(سوێند به‌وانه‌) هیچ که‌س نیه چاودێری نه‌بێت، (سه‌ره‌تا خوا چاودێری هه‌مووانه‌، فریشته‌کانیشی کردووه به چاودێرو پارێزه‌رمان).",
            "verse 86:5": "Ka bira meriv mêze bike ji çi hatîye afirandinêکه‌واته با ئاده‌میزاد ته‌ماشا بکات و سه‌رنج بدات که له چی دروستکراوه‌؟!",
            "verse 86:6": "Ewa (meriva) ji avekehilavok hatîye afirandinêدروستکراوه له ئاوێکی هه‌ڵقوڵاو (که مه‌نی پیاوه و هێلکۆکه‌ی ئافره‌ته‌، هه‌ردوولایان هه‌ڵده‌قوڵێن بۆ پێکهاتنی ئاده‌میزاد، به‌ویستی خوا).",
            "verse 86:7": "Ewa (ava) ji pişta (mêran) û ji nava (her du) memikê (jinan) derdikeveله نێوان بڕبڕه‌کانی پشت و ئێسکه‌کانی سینه‌دا ده‌رده‌چێت.",
            "verse 86:8": "Bi rastî (ew Yezdan ê, ku bi vî awayî merivan biafirîn e; ji piştî mirinê) di şî ku ewan para da bizvirîn eبێگومان ئه‌و زاته دووباره (دروستکردنه‌وه‌ی ئاده‌میزادی) زۆر لائاسانه و توانای ته‌واوی هه‌یه‌.",
            "verse 86:9": "Di roya, ku hemû (veşartî) wê derkevin xûya bibinئه‌و ڕۆژه‌ی که هه‌موو نهێنیه‌کان ده‌رده‌که‌وێت و ئاشکرا ده‌کرێت.",
            "verse 86:10": "Îdî ji bo wî merivî ra qe tu hêz û arîkarî namîn eئاده‌میزاد هیچ هێزو پشتیوانیه‌کی نیه‌.",
            "verse 86:11": "Û bi wî ezmanê (ku avê hildid e û) para da dîsa dizvirîn eسوێند به ئاسمانێك که خاوه‌نی گێڕانه‌وه‌یه (سوڕی ئاو له سروشتدا، شه‌پۆله‌کانی ته‌له‌فون و ڕادیۆ و ته‌له‌فیزیۆن... هتد).",
            "verse 86:12": "Û bi wî zemînê (ku ji bona hêşîna ya) çiryanê derizîهه‌روه‌ها سوێند به زه‌وی که درزی تێ ده‌بێت به‌هۆی ڕووه‌که‌وه‌.",
            "verse 86:13": "(Sond dixum!) ku ewa (Qur´an a) bi rastî pûçî û rastîyê ji hev ra diqetîn eبه‌ڕاستی ئه‌م قورئانه گوفتارێکی جیاکه‌ره‌وه‌یه (جیاکه‌ره‌وه‌ی حه‌ق و ناحه‌ق، ڕاست و درۆ، چاك و خراپ و،... هتد).",
            "verse 86:14": "Û ewa (Qur´an a) tinaz nîn eئه‌م قورئانه گوفتارێکی گه‌ڵته نیه‌.",
            "verse 86:15": "Bı rastî ewan (filan ji bona pûçatê ya Qur´an ê) endezan dikinبه‌ڕاستی ئه‌وانه سه‌رگه‌رمی پیلانن و خه‌ریکی داونانه‌وه‌ن (بۆ ئیمانداران).",
            "verse 86:16": "Ez bi xweber jî (ji bona girtina wan) defikan pev dixim(به‌ڵام خوا ده‌فه‌رموێت): منیش پلان و نه‌خشه‌ی خۆم ده‌خه‌مه‌کار.",
            "verse 86:17": "Îdî (Muhemmed!) tu ji bona wan filan ra firsetê bide, bira ewan hedî-hedî (di rê ya xwe da her in)که‌واته تۆیش تاوێك مۆڵه‌تی بێ باوه‌ڕان بده‌، که‌مێك لێیان بوه‌سته (بزانه چیان به‌سه‌ر ده‌هێنم)."
        },
        "Kyrgyz": {
            "verse 86:1": "Мен Асманга жана түндөсү келүүчүгө ант ичемин",
            "verse 86:2": "(О, Мухаммад) сен түндө келүүчү (Таарик) эмне экенин билбейсиң",
            "verse 86:3": "Ал (нуру менен караңгылыкты) тешүүчү жылдыз",
            "verse 86:4": "Бардык адам(дар)дын үстүндө сактоочу периште бар",
            "verse 86:5": "Эми, инсан өзүнүн эмнеден жаралганына байкоо салсын",
            "verse 86:6": "Атырылган (бел) суудан жаратылган",
            "verse 86:7": "(Ал суу) омуртка жана көкүрөк кабынын арасынан (бөлүнүп) чыгат",
            "verse 86:8": "Ал (Аллаһ) аны (экинчи ирет дагы жашоого) кайтарууга кудуреттүү",
            "verse 86:9": "Сырлар ашкереленген (Кыямат) күндө",
            "verse 86:10": "(Ал күнү) ага эч бир кудурет, эч бир жардам берүүчү болбойт",
            "verse 86:11": "Асманга ант, кайра-кайра жааган жамгырлуу",
            "verse 86:12": "Жерге ант, жарып чыккан өсүмдүктүү",
            "verse 86:13": "Ал (Кураан) аныгында (акыйкат менен жалганды) ажыратуучу Сөз",
            "verse 86:14": "Азил-тамаша (сөз) эмес",
            "verse 86:15": "Алар (каапырлар динге каршы) айла амалдарды жасашат",
            "verse 86:16": "Мен дагы амалкерлик кыламын",
            "verse 86:17": "Эми, сен (О, Мухаммад) каапырларды койо тур. Аларга бир аз гана мөөнөт бер"
        },
        "Malay": {
            "verse 86:1": "Demi langit dan \"At-Taariq\"; -",
            "verse 86:2": "Dan apa jalannya engkau dapat mengetahui apa dia \"At-Taariq\" itu? -",
            "verse 86:3": "(At-Taariq) ialah bintang yang menembusi (sinaran cahayanya);",
            "verse 86:4": "Tiada sesuatu diri juapun melainkan ada malaikat yang menjaga (keadaannya serta menyimpan catitan mengenai segala bawaannya).",
            "verse 86:5": "(Setelah mengetahui yang demikian), maka hendaklah manusia memikirkan: dari apa ia diciptakan.",
            "verse 86:6": "Ia diciptakan dari air (mani) yang memancut (ke dalam rahim) -",
            "verse 86:7": "Yang keluar dari \"tulang sulbi\" lelaki dan \"tulang dada\" perempuan.",
            "verse 86:8": "Sesungguhnya Allah Maha Kuasa untuk mengembalikannya (hidup semula sesudah mati),",
            "verse 86:9": "Pada hari didedahkan segala yang terpendam di hati (dari iktiqad, niat, dan lain-lainnya),",
            "verse 86:10": "Maka (pada saat itu) tidak ada bagi manusia sebarang kekuatan (untuk membela diri), dan tidak ada penolong (yang dapat memberikan pertolongan).",
            "verse 86:11": "Demi langit yang berulang-ulang mencurahkan hujan,",
            "verse 86:12": "Dan bumi yang merekah mengeluarkan tumbuh-tumbuhan,",
            "verse 86:13": "Sesungguhnya keterangan Al-Quran adalah kata-kata pemutus (yang sebenar),",
            "verse 86:14": "Dan bukanlah ia kata-kata yang olok-olok.",
            "verse 86:15": "Sesungguhnya mereka (yang menentangmu, wahai Muhammad) bermati-mati menjalankan rancangan jahat,",
            "verse 86:16": "Dan Aku pula tetap bertindak membalas rancangan jahat (mereka, dan menggagalkannya).",
            "verse 86:17": "Oleh itu janganlah engkau hendakkan segera kebinasaan orang-orang kafir itu, berilah tempoh kepada mereka sedikit masa."
        },
        "Malayalam": {
            "verse 86:1": "ആകാശം തന്നെയാണ, രാത്രിയില്‍ വരുന്നതു തന്നെയാണ സത്യം.",
            "verse 86:2": "രാത്രിയില്‍ വരുന്നത് എന്നാല്‍ എന്താണെന്ന് നിനക്കറിയുമോ?",
            "verse 86:3": "തുളച്ച് കയറുന്ന നക്ഷത്രമത്രെ അത്‌.",
            "verse 86:4": "തന്‍റെ കാര്യത്തില്‍ ഒരു മേല്‍നോട്ടക്കാരനുണ്ടായിക്കൊണ്ടല്ലാതെ യാതൊരാളുമില്ല.",
            "verse 86:5": "എന്നാല്‍ മനുഷ്യന്‍ ചിന്തിച്ചു നോക്കട്ടെ താന്‍ എന്തില്‍ നിന്നാണ് സൃഷ്ടിക്കപ്പെട്ടിരിക്കുന്നത് എന്ന്‌",
            "verse 86:6": "തെറിച്ചു വീഴുന്ന ഒരു ദ്രാവകത്തില്‍ നിന്നത്രെ അവന്‍ സൃഷ്ടിക്കപ്പെട്ടിരിക്കുന്നത്‌.",
            "verse 86:7": "മുതുകെല്ലിനും, വാരിയെല്ലുകള്‍ക്കുമിടയില്‍ നിന്ന് അത് പുറത്തു വരുന്നു.",
            "verse 86:8": "അവനെ (മനുഷ്യനെ) തിരിച്ചുകൊണ്ടു വരാന്‍ തീര്‍ച്ചയായും അവന്‍ (അല്ലാഹു) കഴിവുള്ളവനാകുന്നു.",
            "verse 86:9": "രഹസ്യങ്ങള്‍ പരിശോധിക്കപ്പെടുന്ന ദിവസം",
            "verse 86:10": "അപ്പോള്‍ അവന് (മനുഷ്യന്‌) യാതൊരു ശക്തിയോ, സഹായിയോ ഉണ്ടായിരിക്കുകയില്ല.",
            "verse 86:11": "ആവര്‍ത്തിച്ച് മഴപെയ്യിക്കുന്ന ആകാശത്തെക്കൊണ്ടും",
            "verse 86:12": "സസ്യലതാദികള്‍ മുളപ്പിക്കുന്ന ഭൂമിയെക്കൊണ്ടും സത്യം.",
            "verse 86:13": "തീര്‍ച്ചയായും ഇതു നിര്‍ണായകമായ ഒരു വാക്കാകുന്നു.",
            "verse 86:14": "ഇതു തമാശയല്ല.",
            "verse 86:15": "തീര്‍ച്ചയായും അവര്‍ (വലിയ) തന്ത്രം പ്രയോഗിച്ചു കൊണ്ടിരിക്കും.",
            "verse 86:16": "ഞാനും (വലിയ) തന്ത്രം പ്രയോഗിച്ചു കൊണ്ടിരിക്കും.",
            "verse 86:17": "ആകയാല്‍ (നബിയേ,) നീ സത്യനിഷേധികള്‍ക്ക് കാലതാമസം നല്‍കുക. അല്‍പസമയത്തേക്ക് അവര്‍ക്ക് താമസം നല്‍കിയേക്കുക."
        },
        "Norwegian": {
            "verse 86:1": "Ved himmelen og morgenstjernen!",
            "verse 86:2": "Vet du hva morgenstjernen er?",
            "verse 86:3": "Den tindrende stjerne!",
            "verse 86:4": "Over hvert menneske er det en som passer på.",
            "verse 86:5": "La mennesket betenke hvorav han ble skapt.",
            "verse 86:6": "Han ble skapt av en frembrytende væske,",
            "verse 86:7": "som kommer fra mellom lendene og brystbenet!",
            "verse 86:8": "Han er visselig i stand til å bringe ham tilbake",
            "verse 86:9": "den dag da alle hemmeligheter prøves,",
            "verse 86:10": "og han har verken makt eller hjelper.",
            "verse 86:11": "Ved himmelen med det tilbakevendende regn",
            "verse 86:12": "og jorden, som åpner sitt skjød!",
            "verse 86:13": "Dette er avgjørende ord,",
            "verse 86:14": "det er ingen spøk.",
            "verse 86:15": "De anvender knep.",
            "verse 86:16": "Men også Jeg bruker list!",
            "verse 86:17": "Så ta det med ro med de vantro, ta det med ro med dem for en tid."
        },
        "Pashto": {
            "verse 86:1": "قسم دى په اسمان او د شپې په راتلونكي",
            "verse 86:2": "او ته څه شي پوه كړې چې د شپې راتلونكى څه شى دى؟",
            "verse 86:3": "ځلېدونكى ستورى دى",
            "verse 86:4": "نشته هېڅ یو نفس مګر په هغه باندې څارونكى (ساتونكى) شته",
            "verse 86:5": "نو انسان دې وګوري چې دى له څه شي نه پیدا كړى شوى دى؟",
            "verse 86:6": "دى له ټوپ وهونكو اوبو نه پیدا كړى شوى دى",
            "verse 86:7": "چې د شا او له سینو د هډوكو له مینځ نه راوځي",
            "verse 86:8": "بېشكه دغه (الله) د دغه (انسان) په بیا راژوندي كولو یقینًا قادر دى",
            "verse 86:9": "په هغې ورځ چې د پټو څیزونو به (په كې) څېړنه (او څرګندونه) كولى شي",
            "verse 86:10": "نو د دغه (انسان) لپاره به نه هېڅ قوت وي او نه څوك مدد كوونكى",
            "verse 86:11": "قسم دى په اسمان چې خاوند د باران دى",
            "verse 86:12": "او په ځمكه چې د (زرغونې راوتلو لپاره) چاودېدلو والا ده",
            "verse 86:13": "بېشكه دا (قرآن) یقینًا (د حق او باطل) بېلونكې وینا ده",
            "verse 86:14": "او دا هیڅكله عبثه (او د ټوقو) خبره نه ده",
            "verse 86:15": "بېشكه دوى مكر او چل كوي، یو چل كول",
            "verse 86:16": "او زه هم یو تدبیر كوم، تدبیر كول",
            "verse 86:17": "نو ته كافرانو ته مهلت وركړه، ته دوى ته لږ مهلت وركړه"
        },
        "Persian": {
            "verse 86:1": "سوگند به آسمان و به آنچه در شب آيد.",
            "verse 86:2": "و تو چه دانى كه آنچه در شب آيد چيست؟",
            "verse 86:3": "ستاره‌اى است درخشنده.",
            "verse 86:4": "هيچ كس نيست مگر آنكه بر او نگهبانى است.",
            "verse 86:5": "پس آدمى بنگرد كه از چه چيز آفريده شده است،",
            "verse 86:6": "از آبى جهنده آفريده شده است،",
            "verse 86:7": "كه از ميان پشت و سينه بيرون مى‌آيد.",
            "verse 86:8": "خدا به باز گردانيدن او تواناست.",
            "verse 86:9": "روزى كه رازها آشكار مى‌شود،",
            "verse 86:10": "او را نه نيرويى است و نه ياورى.",
            "verse 86:11": "قسم به آسمان بازبارنده،",
            "verse 86:12": "قسم به زمين رويان شكاف خورده،",
            "verse 86:13": "كه اين كتاب، حق را از باطل جدا كند،",
            "verse 86:14": "و سخن هزل نيست.",
            "verse 86:15": "آنان حيله‌اى مى‌انديشند،",
            "verse 86:16": "و من هم حيله‌اى مى‌انديشم.",
            "verse 86:17": "پس كافران را مهلت ده، اندك مهلتشان ده."
        },
        "Polish": {
            "verse 86:1": "Na niebo i na gwiazdę nocną!",
            "verse 86:2": "A co ciebie pouczy, co to jest gwiazda nocna?",
            "verse 86:3": "To jest gwiazda przenikająca.",
            "verse 86:4": "Każda dusza ma nad sobą stróża!",
            "verse 86:5": "Niech więc rozważy człowiek, z czego on został stworzony!",
            "verse 86:6": "Został stworzony z cieczy wytryskającej,",
            "verse 86:7": "Która wychodzi spomiędzy lędźwi i żeber.",
            "verse 86:8": "Zaprawdę, On jest władny sprowadzić go",
            "verse 86:9": "W Dniu, kiedy będą badane skryte myśli.",
            "verse 86:10": "Nie będzie on miał wówczas ani siły, ani pomocnika!",
            "verse 86:11": "Na niebo, które włada powrotem!",
            "verse 86:12": "Na ziemię posiadającą rozpadliny!",
            "verse 86:13": "Zaprawdę, to jest słowo rozstrzygające,",
            "verse 86:14": "Nie żadna zabawa!",
            "verse 86:15": "Zaprawdę, oni zamyślają podstęp!",
            "verse 86:16": "I Ja zamyślam podstęp!",
            "verse 86:17": "Daj więc nieco wytchnienia niewiernym; daj im jeszcze chwilę zwłoki!"
        },
        "Portuguese": {
            "verse 86:1": "Pelo céu e pelo visitante noturno;",
            "verse 86:2": "E o que te fará entender o que é o visitante noturno?",
            "verse 86:3": "É a estrela fulgurante!",
            "verse 86:4": "Cada alma tem sobre si um guardião (angelical).",
            "verse 86:5": "Que o homem considere, pois, do quê foi criado!",
            "verse 86:6": "Foi criado de uma gota ejaculada,",
            "verse 86:7": "Que emana da conjunção das regiões sexuais do homem e da mulher.",
            "verse 86:8": "Sabei que Ele é capaz de ressuscitá-lo!",
            "verse 86:9": "(Isso se dará) no dia em que forem revelados os segredos,",
            "verse 86:10": "E em que (o homem) carecerá de poder e de um socorredor.",
            "verse 86:11": "Pelo céu, que proporciona a volta da chuva.",
            "verse 86:12": "E pela terra, que se fende (com o crescimento das plantas),",
            "verse 86:13": "Que (este Alcorão) é a palavra concludente,",
            "verse 86:14": "E não entretenimento.",
            "verse 86:15": "Em verdade, eles conspiram intensivamente (contra ti),",
            "verse 86:16": "E Eu conspiro intensivamente (contra eles).",
            "verse 86:17": "Tolera, pois, os incrédulos; tolera-os, por ora!"
        },
        "Punjabi": {
            "verse 86:1": "ਸਹੁੰ ਹੈ, ਅਸਮਾਨ ਵੀ ਅਤੇ ਰਾਤ ਨੂੰ ਪ੍ਰਗਟ ਹੋਣ ਵਾਲੇ ਦੀ।",
            "verse 86:2": "ਅਤੇ ਤੁਸੀ ਕੀ ਜਾਣੋ ਕਿ ਉਹ ਰਾਤ ਨੂੰ ਪ੍ਰਗਟ ਹੋਣ ਵਾਲਾ ਕੀ ਹੈ।",
            "verse 86:3": "ਚਮਕੀਲਾ ਤਾਰਾ।",
            "verse 86:4": "ਕੋਈ ਬੰਦਾ ਅਜਿਹਾ ਨਹੀਂ ਹੈ ਜਿਸ ਦੇ ਉੱਪਰ ਨਿਗਰਾਨ ਨਾ ਹੋਵੇ।",
            "verse 86:5": "ਤਾਂ ਮਨੁੱਖ ਨੂੰ ਦੇਖਣਾ ਚਾਹੀਦਾ ਹੈ ਕਿ ਉਹ ਕਿਸ ਚੀਜ਼ ਤੋਂ’ ਪੈਦਾ ਕੀਤਾ ਗਿਆ ਹੈ।",
            "verse 86:6": "ਉਹ ਇੱਕ ਉੱਛਲਦੇ ਹੋਏ ਪਾਣੀ ਤੋਂ ਪੈਦਾ ਕੀਤਾ ਗਿਆ ਹੈ।",
            "verse 86:7": "ਜਿਹੜਾ ਨਿਕਲਦਾ ਹੈ ਪਿੱਠ ਅਤੇ ਛਾਤੀ ਦੇ ਵਿਚੋਂ।",
            "verse 86:8": "ਬੇਸ਼ੱਕ ਉਹ (ਅੱਲਾਹ) ਉਸ ਨੂੰ ਮੁੜ ਜਨਮ ਦੇਣ ਦੀ ਤਾਕਤ ਰੱਖਦਾ ਹੈ।",
            "verse 86:9": "ਜਿਸ ਦਿਨ ਗੁਪਤ ਗੱਲਾਂ ਦੀ ਪਰਖ ਹੋਵੇਗੀ।",
            "verse 86:10": "ਉਸ ਵੇਲੇ ਮਨੁੱਖ ਦੇ ਕੋਲ ਨਾ ਕੋਈ ਬਲ ਹੋਵੇਗਾ ਅਤੇ ਨਾ ਕੋਈ ਸਹਾਇਕ।",
            "verse 86:11": "ਸਹੂੰ ਹੈ ਅਸਮਾਨ ਦੇ ਚੱਕਰ ਮਾਰਨ ਵਾਲੇ ਦੀ।",
            "verse 86:12": "ਅਤੇ ਫਟਣ ਵਾਲੀ ਧਰਤੀ ਦੀ।",
            "verse 86:13": "ਬੇਸ਼ੱਕ ਇਹ ਪੱਕੀ ਗੱਲ ਹੈ।",
            "verse 86:14": "ਅਤੇ ਇਹ ਮਜ਼ਾਕ ਦੀ ਗੱਲ ਨਹੀਂ।",
            "verse 86:15": "ਇਹ ਹੁਜਤਾਂ ਕਰਨ ਵਿਚ ਲੱਗੇ ਹੋਏ ਹਨ।",
            "verse 86:16": "ਅਤੇ ਮੈ’ ਵੀ ਯੋਜਨਾ ਬਣਾਉਣ ਵਿਚ ਲੱਗਿਆ ਹੋਇਆ ਹਾਂ।",
            "verse 86:17": "ਤਾਂ ਤੁਸੀਂ ਅਵੱਗਿਆਕਾਰੀਆਂ ਨੂੰ ਕੁਝ ਢਿੱਲ ਦੇਵੇਂ, ਬਸ ਕੁਝ ਦਿਨਾਂ ਦੀ ਹੀ ਢਿੱਲ ਦੇਵੋ।"
        },
        "Roman english": {
            "verse 86:1": "Wassamaaa`i wattaariq",
            "verse 86:2": "Wa maaa adraaka mattaariq",
            "verse 86:3": "Annajmus saaqib",
            "verse 86:4": "In kullu nafsil lammaa `alaihaa haafiz",
            "verse 86:5": "Fal yanzuril insaanu mimma khuliq",
            "verse 86:6": "Khuliqa mim maaa`in daafiq",
            "verse 86:7": "Yakhruju mim bainissulbi wat taraaa`ib",
            "verse 86:8": "Innahoo `alaa raj`ihee laqaadir",
            "verse 86:9": "Yawma tublas saraaa`ir",
            "verse 86:10": "Famaa lahoo min quwwatinw wa laa naasir",
            "verse 86:11": "Wassamaaa`i zaatir raj",
            "verse 86:12": "Wal ardi zaatis sad",
            "verse 86:13": "Innahoo laqawlun fasl",
            "verse 86:14": "Wa maa huwa bil hazl",
            "verse 86:15": "Innahum yakeedoona kaidaa",
            "verse 86:16": "Wa akeedu kaidaa",
            "verse 86:17": "Famahhilil kaafireena amhilhum ruwaidaa"
        },
        "Russian": {
            "verse 86:1": "В знак неба и идущего в ночи!",
            "verse 86:2": "Как объяснить тебе, что значит \"в ночь идущий\"?",
            "verse 86:3": "Звезда, что рассекает (небо своим светом).",
            "verse 86:4": "Нет ни одной живой души, Что над собою стража не имеет.",
            "verse 86:5": "Пусть человек подумает над тем, как он был создан!",
            "verse 86:6": "Он создан из воды, что изливается (струей)",
            "verse 86:7": "И из грудных костей, и из хребта исходит.",
            "verse 86:8": "Поистине, Он в силах воскресить его опять!",
            "verse 86:9": "В тот День Все тайное подвергнется проверке,",
            "verse 86:10": "Лишенным всякой помощи и власти будет (человек).",
            "verse 86:11": "В знак неба, что вершит обратный путь,",
            "verse 86:12": "И в знак земли, способной раскрываться (Для излияния воды иль прорастанья злаков), -",
            "verse 86:13": "Сие - поистине, решающее Слово (Для различения Добра и Зла).",
            "verse 86:14": "И это - не простая тщЕта.",
            "verse 86:15": "Они же хитрость замышляют,",
            "verse 86:16": "А Я (для них) Свою готовлю.",
            "verse 86:17": "Дай же отсрочку им - Отсрочь им мягко, нанемного!"
        },
        "Sindhi": {
            "verse 86:1": "آسمان جو ۽ رات جي وقت ۾ ايندڙ جو قسم آھي.",
            "verse 86:2": "۽ ڪنھن سمجھايئي ته رات جو ايندڙ ڇا آھي؟",
            "verse 86:3": "(اُھو) چمڪندڙ تارو آھي.",
            "verse 86:4": "ته ڪو جيءُ اھڙو ڪونھي جنھن تي ھڪ نگھبان مقرر ٿيل (نه) آھي.",
            "verse 86:5": "تنھنڪري ماڻھوءَ کي گھرجي ته نھاري ڏسي ته کيس ڇا مان بڻايو ويو آھي.",
            "verse 86:6": "ٽپي سان نڪرندڙ پاڻي مان بڻايو ويس.",
            "verse 86:7": "جو پُٺيءَ ۽ اُرھ جي وچ مان نڪرندو آھي.",
            "verse 86:8": "بيشڪ الله سندس وري موٽائڻ تي وس وارو آھي.",
            "verse 86:9": "جنھن ڏينھن (ماڻھن جي دلين جا) سڀ ڳُجھ جاچيا ويندا.",
            "verse 86:10": "پوءِ تنھن ڏينھن ڪانه اُن کي سگھ رھندي ۽ نڪو واھرو (ھوندس).",
            "verse 86:11": "۽ مينھن واري آسمان جو قسم آھي.",
            "verse 86:12": "۽ ڦاٽن واريءَ زمين جو (به) قسم آھي.",
            "verse 86:13": "ته بيشڪ قرآن ھڪ فيصلو ڪندڙ ڳالھ آھي.",
            "verse 86:14": "۽ ھيُ قرآن ڪا ٺـٺولي (جي ڳالھ) نه آھي.",
            "verse 86:15": "بيشڪ ڪافر ھڪ (طرح جي) ڳجھي رٿ رٿين ٿا.",
            "verse 86:16": "۽ (آءٌ به) ھڪ (طرح جي) رٿ رٿيان ٿو.",
            "verse 86:17": "پوءِ ڪافرن کي ڍر ڏي ۽ ٿوري مُدت کين ڇڏي ڏي."
        },
        "Sinhalese": {
            "verse 86:1": "අහස මත ද තාරික් මත ද දිවුරමින්,",
            "verse 86:2": "තාරික් යනු කුමක් දැයි නුඹට දැනුම් දුන්නේ කුමක් ද?",
            "verse 86:3": "(එය) අඳුර පසාරු කරමින් බැබළෙන තාරකාවකි.",
            "verse 86:4": "නිරීක්ෂකයකුගෙන් තොර ව කිසිදු ආත්මයක් නොමැත.",
            "verse 86:5": "මිනිසා තමන් මවනු ලැබුවේ කුමකින් දැයි සිතා බලත්වා !",
            "verse 86:6": "විදින ජලයෙන් ඔහු මවනු ලැබුවේය.",
            "verse 86:7": "කොඳු ඇට පෙළ හා පපු පෙදෙස අතරින් එය පිට වේ.",
            "verse 86:8": "සැබැවින්ම ඔහු නැවත ඔහු ව ගෙන්වා ගැනීමට ශක්තිවන්තයා ය.",
            "verse 86:9": "එදින රහස්ය දෑ හෙළි කරනු ලැබේ.",
            "verse 86:10": "එවිට කිසිදු බලයක් හෝ කිසිදු උදව් කරුවෙකු හෝ ඔහුට නොමැත.",
            "verse 86:11": "තවද (වර්ෂාව) නැවත නැවතත් ලබා දෙන ස්වභාවයෙන් යුත් අහස මත ද දිවුරමින්,",
            "verse 86:12": "පැළීම් ස්වභාවයෙන් යුත් මහපොළොව මත ද දිවුරමින්,",
            "verse 86:13": "සැබැවින්ම එය තීරණාත්මක වදනකි.",
            "verse 86:14": "තවද එය සරදමක් නොවේ.",
            "verse 86:15": "සැබැවින්ම ඔවුන් කුමන්ත්‍රණයක් සැලසුම් කරති.",
            "verse 86:16": "මම ද සැලසුමක් සැලසුම් කරමි.",
            "verse 86:17": "එබැවින් ප්‍රතික්ෂේපකයින්ට නුඹ අවකාශය දෙනු. තවද ඔවුනට ස්වල්ප කලකට අවකාශය දෙනු."
        },
        "Somali": {
            "verse 86:1": "Eebe wuxuu ku dhaartay Samada iyo Xiddigga guura.",
            "verse 86:2": "Ma taqaan Xiddigga guura.",
            "verse 86:3": "Waa Xiddig ifa.",
            "verse 86:4": "Ee Nafwalba waxaa kor jooga ilaaliye (Malag).",
            "verse 86:5": "Ee Dadku ha dayo waxa laga abuuray.",
            "verse 86:6": "Waxaa laga abuuray Biyo booda.",
            "verse 86:7": "Kana soobaxa Dhabar iyo laab dhexdood.",
            "verse 86:8": "Eebana waa karaa soo celinta Dadka (qiyaamada).",
            "verse 86:9": "Maalinta la imtixaani waxa (Laabta) ku qarsoon.",
            "verse 86:10": "Dadkuna Xoog ma leh (Maalintaas) iyo wax u gargaaara midna.",
            "verse 86:11": "Eebana wuxuu ku dhaartay Samada Roobka leh.",
            "verse 86:12": "Iyo Dhulka jeexma (waxna ka soo baxo).",
            "verse 86:13": "Ee Quraanku waa hadal wax kala bixiya (wanaagga iyo Xumaanta).",
            "verse 86:14": "Ciyaarra ma aha (ee waa dhab).",
            "verse 86:15": "Gaaladu waxbay dhakri.",
            "verse 86:16": "Annaguna waanu kaydi (Abaalmarin).",
            "verse 86:17": "Ee u sug Gaalada wax yar."
        },
        "Spanish": {
            "verse 86:1": "Por el cielo y el que viene de noche!",
            "verse 86:2": "Y cómo hacerte saber qué es el que viene de noche?",
            "verse 86:3": "Es el astro fulgurante.",
            "verse 86:4": "Que cada alma tiene un protector.",
            "verse 86:5": "Que mire el hombre de qué ha sido creado.",
            "verse 86:6": "Ha sido creado de agua eyaculada",
            "verse 86:7": "que sale de entre la espina dorsal y las costillas.",
            "verse 86:8": "Él tiene poder para hacerlo volver.",
            "verse 86:9": "El día en que los secretos queden al descubierto,",
            "verse 86:10": "no tendrá fuerza ni nadie que lo auxilie.",
            "verse 86:11": "Por el cielo con sus ciclos de lluvia!",
            "verse 86:12": "Por la tierra que se abre para dar fruto!",
            "verse 86:13": "Que es una palabra que encierra discriminación",
            "verse 86:14": "y no es ninguna ligereza.",
            "verse 86:15": "Ellos traman algo,",
            "verse 86:16": "pero Yo también tramo.",
            "verse 86:17": "Deja que les llegue su momento a los incrédulos, dales un poco de tiempo."
        },
        "Swahili": {
            "verse 86:1": "Naapa kwa mbingu na Kinacho kuja usiku!",
            "verse 86:2": "Na nini kitakacho kujuulisha ni nini hicho Kinacho kuja usiku?",
            "verse 86:3": "Ni Nyota yenye mwanga mkali.",
            "verse 86:4": "Hapana nafsi ila inayo mwangalizi.",
            "verse 86:5": "Hebu naajitazame mwanaadamu ameumbwa kwa kitu gani?",
            "verse 86:6": "Ameumbwa kwa maji yatokayo kwa kuchupa,",
            "verse 86:7": "Yatokayo baina ya mifupa ya mgongo na mbavu.",
            "verse 86:8": "Hakika Yeye ana uweza wa kumrudisha.",
            "verse 86:9": "Siku zitakapo dhihirishwa siri.",
            "verse 86:10": "Basi hatakuwa na nguvu wala msaidizi.",
            "verse 86:11": "Naapa kwa mbingu yenye marejeo!",
            "verse 86:12": "Na kwa ardhi inayo pasuka!",
            "verse 86:13": "Hakika hii ni kauli ya kupambanua.",
            "verse 86:14": "Wala si mzaha.",
            "verse 86:15": "Hakika wao wanapanga mpango.",
            "verse 86:16": "Na Mimi napanga mpango.",
            "verse 86:17": "Basi wape muhula makafiri - wape muhula pole pole."
        },
        "Swedish": {
            "verse 86:1": "VID himlen och vid den nattliga besökaren!",
            "verse 86:2": "Och vad kan låta dig förstå vad den nattliga besökaren betyder",
            "verse 86:3": "[Det är] den stjärna vars ljus lyser upp [det djupaste mörker].",
            "verse 86:4": "Ingen människa [har lämnats] utan den som vakar över henne.",
            "verse 86:5": "LÅT människan betrakta det som hon är skapad av!",
            "verse 86:6": "Hon är skapad av flöden,",
            "verse 86:7": "som väller fram ur [mannens] länder och ur [kvinnans] bäckenring.",
            "verse 86:8": "Han [som har skapat henne] har helt visst makt att återskapa henne",
            "verse 86:9": "den Dag då [hjärtats] innersta vrå skall granskas",
            "verse 86:10": "och då hon varken kan lita till [sin egen] styrka eller till andras hjälp.",
            "verse 86:11": "Vid himlen som ger regn",
            "verse 86:12": "och vid jorden som öppnar sig [för att ge plats åt det som spirar]!",
            "verse 86:13": "[UPPENBARELSENS ord] är ord som avgör [vad som är sanning och vad som är lögn],",
            "verse 86:14": "det är inte [fråga om] skämt eller upptåg.",
            "verse 86:15": "[Förnekarna] smider planer,",
            "verse 86:16": "men [även] Jag smider planer.",
            "verse 86:17": "Låt dem därför hållas, dessa förnekare, låt dem hållas [ännu] en liten tid!"
        },
        "Tajik": {
            "verse 86:1": "Савганд ба осмону ба он чӣ дар шаб ояд!",
            "verse 86:2": "Ва ту чӣ донӣ, ки он чӣ дар шаб ояд, чист?",
            "verse 86:3": "Ситораест дурахшанда.",
            "verse 86:4": "Ҳеҷ кас нест, кӣ бар ӯ нигаҳбоне набошад.",
            "verse 86:5": "Пас одамӣ бингарад, ки аз чӣ чиз офариша шудааст.",
            "verse 86:6": "Аз обе ҷаҳанда офарида шудааст,",
            "verse 86:7": "ки аз миёни пушту сина берун меояд.",
            "verse 86:8": "Худо ба бозгардонидани ӯ тавоност,",
            "verse 86:9": "рӯзе, ки розҳо (сирҳо) ошкор мешаванд.",
            "verse 86:10": "Ӯро на қувватест, ва на ёваре.",
            "verse 86:11": "Қасам ба осмони бозборанда!",
            "verse 86:12": "Қасам ба замини руёни шикофхӯрда, (барои гиёҳ)",
            "verse 86:13": "ки ин китоб ҳақро аз ботил ҷудо кунад,",
            "verse 86:14": "ва сухани ҳазл нест!",
            "verse 86:15": "Онон ҳилае меандешанд",
            "verse 86:16": "ва Ман ҳам ҳилае меандешам.",
            "verse 86:17": "Пас кофиронро мӯҳлат деҳ андак мӯҳлаташон деҳ!"
        },
        "Tamil": {
            "verse 86:1": "வானத்தின் மீது சத்தியமாக! தாரிக் மீதும் சத்தியமாக",
            "verse 86:2": "தாரிக் என்னவென்று உமக்கு அறிவித்தது எது?",
            "verse 86:3": "அது இலங்கும் ஒரு நட்சத்திரம்.",
            "verse 86:4": "ஒவ்வொரு ஆத்மாவுக்கு ஒரு பாதுகாவலர் இல்லாமலில்லை.",
            "verse 86:5": "மனிதன் எதிலிருந்து படைக்கப்பட்டான் என்பதை கவனிக்கட்டும்.",
            "verse 86:6": "குதித்து வெளிப்படும் (ஒரு துளி) நீரினால் படைக்கப்பட்டான்.",
            "verse 86:7": "முதுகந் தண்டிற்கும், விலா எலும்புகளுக்கும் இடையிலிருந்து அது வெளியாகிறது.",
            "verse 86:8": "இறைவன் (மனிதன் இறந்த பின் அவனை உயிர்ப்பித்து) மீட்டும் சக்தியுடையவன்.",
            "verse 86:9": "இரகசியங்கள் யாவும் வெளிப்பட்டுவிடும் அந்நாளில்.",
            "verse 86:10": "மனிதனுக்கு எந்த பலமும் இராது, (அவனுக்கு) உதவி செய்பவனும் இல்லை.",
            "verse 86:11": "(திரும்பத் திரும்பப்) பொழியும் மழையை உடைய வானத்தின் மீது சத்தியமாக,",
            "verse 86:12": "(தாவரங்கள் முளைப்பதற்குப்) பிளவு படும் பூமியின் மீதும் சத்தியமாக,",
            "verse 86:13": "நிச்சயமாக இது (குர்ஆன் சத்தியத்தையும், அசத்தியத்தையும்) பிரித்து அறிவிக்கக்கூடிய வாக்காகும்.",
            "verse 86:14": "அன்றியும், இது வீணான (வார்த்தைகளைக் கொண்ட)து அல்ல.",
            "verse 86:15": "நிச்சயமாக அவர்கள் (உமக்கெதிராகச்) சூழ்ச்சி செய்கிறார்கள்.",
            "verse 86:16": "நானும் (அவர்களுக்கெதிராகச்) சூழ்ச்சி செய்கிறேன்.",
            "verse 86:17": "எனவே, காஃபிர்களுக்கு நீர் அவகாசமளிப்பீராக, சொற்பமாக அவகாசம் அளிப்பீராக."
        },
        "Tatar": {
            "verse 86:1": "Күк белән һәм Тарыйк белән ант итәм.",
            "verse 86:2": "Ул Тарыйкның нинди икәнен сиңа нәрсә белдерде?",
            "verse 86:3": "Ул Тарыйк раушән ялтыраучы йолдыздыр.",
            "verse 86:4": "Юктыр һичбер кеше, мәгәр һәрбер кеше янында аның барча эшен язучы фәрештә бардыр.",
            "verse 86:5": "Адәм баласы үзенә карасын нәрсәдән халык кылынды?",
            "verse 86:6": "Халык кылынды ятакка коелган судан.",
            "verse 86:7": "Ул су чыгадыр ирнең арка сөякләре арасыннан вә хатынның күкрәк сөякләре арасыннан.",
            "verse 86:8": "Ул – Аллаһ үлгән кешене тергезергә, әлбәттә, кадирдер.",
            "verse 86:9": "Яшерен эшләр ачылган көндә,",
            "verse 86:10": "кешенең Аллаһ ґәзабыннан качарга куәте булмас һәм ярдәмчесе дә булмас.",
            "verse 86:11": "Яңгыр иясе булган күк илә.",
            "verse 86:12": "Вә үләннәр иясе булган җир белән ант итәм.",
            "verse 86:13": "Тәхкыйк ул Коръән сүзе хакны батылдан аеручы хак сүздер.",
            "verse 86:14": "Ул – Коръән уен вә батыл сүз түгелдер.",
            "verse 86:15": "Тәхкыйк ул кәферләр Коръән сүзләрен юкка чыгарырга хәйлә төзиләр.",
            "verse 86:16": "Вә аларны ґәзаб кылу өчен Мин чын хәйлә төзимен.",
            "verse 86:17": "Кәферләргә вакыт бир, азганлыкларында йөрсеннәр аларга бик аз гына вакыт бит!"
        },
        "Telugu": {
            "verse 86:1": "ఆకాశం మరియు రాత్రివేళ వచ్చే నక్షత్రం (అత్ తారిఖ్) సాక్షిగా",
            "verse 86:2": "రాత్రి వేళ వచ్చేది (అత్ తారిఖ్) అంటే ఏమిటో నీకు ఎలా తెలుస్తుంది",
            "verse 86:3": "అదొక అత్యంత ప్రకాశవంతమైన నక్షత్రం",
            "verse 86:4": "కనిపెట్టుకొని ఉండేవాడు (దేవదూత) లేకుండా ఏ వ్యక్తి కూడా లేడు",
            "verse 86:5": "కావున మానవుడు తాను దేనితో సృష్టించబడ్డాడో గమనించాలి",
            "verse 86:6": "అతడు విసర్జించబడే (చిమ్ముకుంటూ వెలువడే) ద్రవపదార్థంతో సృష్టించబడ్డాడు",
            "verse 86:7": "అది వెన్ను మరియు రొమ్ము ఎముకల మధ్యభాగం నుండి బయటికి వస్తుంది",
            "verse 86:8": "నిశ్చయంగా, ఆయన (సృష్టికర్త), అతనిని మరల బ్రతికించి తేగల సామర్థ్యం గలవాడు",
            "verse 86:9": "ఏ రోజయితే రహస్య విషయాల విచారణ జరుగుతుందో",
            "verse 86:10": "అప్పుడు అతనికి (మానవునికి) ఎలాంటి శక్తి ఉండదు మరియు ఏ సహాయకుడునూ ఉండడు",
            "verse 86:11": "వర్షం కురిపించే ఆకాశం సాక్షిగా",
            "verse 86:12": "(చెట్లు మొలకెత్తేటప్పుడు) చీలి పోయే భూమి సాక్షిగా",
            "verse 86:13": "నిశ్చయంగా, ఇది (ఈ ఖుర్ఆన్, సత్యాసత్యాలను) వేరు పరచే వాక్కు (గీటురాయి)",
            "verse 86:14": "మరియు ఇది వృథా కాలక్షేపానికి వచ్చినది కాదు",
            "verse 86:15": "(ఓ ముహమ్మద్!) నిశ్చయంగా, వారు (నీకు విరుద్ధంగా) కుట్రపన్నుతున్నారు",
            "verse 86:16": "మరియు నేను కూడా పన్నాగం పన్నుతున్నాను",
            "verse 86:17": "కనుక నీవు సత్యతిరస్కారులకు కొంత వ్యవధి నివ్వు! వారి పట్ల మృదువుగా వ్యవహరించు"
        },
        "Thai": {
            "verse 86:1": "ขอสาบานด้วยชั้นฟ้า และ (ดวงดาว) ที่มาในเวลาค่ำคืน",
            "verse 86:2": "และอะไรเล่าจะทำให้เจ้ารู้ได้ว่าสิ่งที่มาในเวลาค่ำคืนนั้นคืออะไร ?",
            "verse 86:3": "คือดวงดาวที่ประกายแสง",
            "verse 86:4": "ไม่มีชีวิตใด (อยู่โดยลำพัง) เว้นแต่มีผู้เฝ้ารักษามัน",
            "verse 86:5": "ดังนั้นมนุษย์จงไตร่ตรองดูซิว่าเขาถูกบังเกิดมาจากอะไร ?",
            "verse 86:6": "เขาถูกบังเกิดมาจากน้ำที่พุ่งออกมา",
            "verse 86:7": "มันออกมาจากกระดูกสันหลัง (ของชาย) และกระดูกหน้าอก (ของหญิง)",
            "verse 86:8": "แท้จริงพระองค์ทรงสามารถอย่างแน่นอนที่จะให้เขากลับมาอีก (คือฟื้นคืนชีพ)",
            "verse 86:9": "วันที่สิ่งเร้นลับทั้งหลายจะถูกเปิดเผย",
            "verse 86:10": "ดังนั้นเขาจะไม่มีพลังใด ๆ และไม่มีผู้ช่วยเหลือใด ๆ",
            "verse 86:11": "ขอสาบานด้วยชั้นฟ้าที่หลั่งน้ำฝน",
            "verse 86:12": "และแผ่นดินที่ปริออก (ให้เมล็ดพืชงอกเงย)",
            "verse 86:13": "แท้จริงอัลกุรอานนั้น คือพระดำรัสที่จำแนก (ระหว่างความจริงกลับความเท็จ)",
            "verse 86:14": "และอัลกุรอานนั้นมิใช่เรื่องไร้สาระ",
            "verse 86:15": "แท้จริงพวกเขากำลังวางแผนการณ์กันอยู่",
            "verse 86:16": "และข้าก็วางแผนการณ์อยู่",
            "verse 86:17": "ดังนั้น เจ้า (มุฮัมมัด) จงผ่อนปรนให้บรรดาผู้ปฏิเสธศรัทธาเถิด ข้าก็จะผ่อนปรนให้แก่พวกเขาระยะหนึ่ง"
        },
        "Turkish": {
            "verse 86:1": "Göğe ve Tarık'a and olsun;",
            "verse 86:2": "Tarık'ın ne olduğunu sen bilir misin?",
            "verse 86:3": "O, (ışığıyla karanlığı) delen yıldızdır.",
            "verse 86:4": "Üzerinde gözetici olmayan kimse yoktur.",
            "verse 86:5": "Öyleyse insan neden yaratıldığına bir baksın.",
            "verse 86:6": "O, erkek ve kadının beli ile kaburga kemikleri arasından atılagelen bir sudan yaratılmıştır.",
            "verse 86:7": "O, erkek ve kadının beli ile kaburga kemikleri arasından atılagelen bir sudan yaratılmıştır.",
            "verse 86:8": "Şüphesiz Allah, gizliliklerin ortaya çıkacağı gün, insanı tekrar yaratmaya Kadir'dir.",
            "verse 86:9": "Şüphesiz Allah, gizliliklerin ortaya çıkacağı gün, insanı tekrar yaratmaya Kadir'dir.",
            "verse 86:10": "O gün, insanın gücü de, yardımcısı da olmaz.",
            "verse 86:11": "Dönüşlü göğe ve yarılan yeryüzüne and olsun ki,",
            "verse 86:12": "Dönüşlü göğe ve yarılan yeryüzüne and olsun ki,",
            "verse 86:13": "Doğrusu bu Kuran kesin bir sözdür.",
            "verse 86:14": "O, eğlence için değildir.",
            "verse 86:15": "Gerçekten onlar düzen kuruyorlar.",
            "verse 86:16": "Ben de bir düzen kurmaktayım.",
            "verse 86:17": "Sen inkarcılara mehil ver; onlara mukabeleyi biraz geri bırak."
        },
        "Urdu": {
            "verse 86:1": "آسمان اور رات کے وقت آنے والے کی قسم",
            "verse 86:2": "اور تم کو کیا معلوم کہ رات کے وقت آنے والا کیا ہے",
            "verse 86:3": "وہ تارا ہے چمکنے والا",
            "verse 86:4": "کہ کوئی متنفس نہیں جس پر نگہبان مقرر نہیں",
            "verse 86:5": "تو انسان کو دیکھنا چاہئے کہ وہ کاہے سے پیدا ہوا ہے",
            "verse 86:6": "وہ اچھلتے ہوئے پانی سے پیدا ہوا ہے",
            "verse 86:7": "جو پیٹھ اور سینے کے بیچ میں سے نکلتا ہے",
            "verse 86:8": "بےشک خدا اس کے اعادے (یعنی پھر پیدا کرنے) پر قادر ہے",
            "verse 86:9": "جس دن دلوں کے بھید جانچے جائیں گے",
            "verse 86:10": "تو انسان کی کچھ پیش نہ چل سکے گی اور نہ کوئی اس کا مددگار ہو گا",
            "verse 86:11": "آسمان کی قسم جو مینہ برساتا ہے",
            "verse 86:12": "اور زمین کی قسم جو پھٹ جاتی ہے",
            "verse 86:13": "کہ یہ کلام (حق کو باطل سے) جدا کرنے والا ہے",
            "verse 86:14": "اور بیہودہ بات نہیں ہے",
            "verse 86:15": "یہ لوگ تو اپنی تدبیروں میں لگ رہے ہیں",
            "verse 86:16": "اور ہم اپنی تدبیر کر رہے ہیں",
            "verse 86:17": "تو تم کافروں کو مہلت دو بس چند روز ہی مہلت دو"
        },
        "Uyghur": {
            "verse 86:1": "ئاسمان بىلەن، تارىق (يەنى كېچىدە ئاشكارا بولغۇچى يۇلتۇز) بىلەن قەسەم قىلىمەن",
            "verse 86:2": "تارىقنىڭ نېمىلىكىنى بىلەمسەن؟",
            "verse 86:3": "ئۇ يورۇق يۇلتۇزدۇر",
            "verse 86:4": "ھەر بىر ئادەم بىلەن (شۇ ئادەمنى) ساقلىغۇچى (پەرىشتە) بار",
            "verse 86:5": "ئىنسان نېمىدىن يارىتىلغانلىقىغا قارىسۇن",
            "verse 86:6": "ئۇ ئېتىلىپ چىققۇچى مەنىدىن يارىتىلدى",
            "verse 86:7": "ئۇ مەنى ئۇمۇرتقا بىلەن قوۋۇرغا سۆڭىكىنىڭ ئارىسىدىن چىقىدۇ",
            "verse 86:8": "شەك - شۈبھىسىزكى، اﷲ ئۇنى ئەسلىگە كەلتۈرۈشكە (يەنى تىرىلدۈرۈشكە قادىردۇر",
            "verse 86:9": "سىرلار ئاشكارا قىلىنىدىغان كۈندە (يەنى قىيامەتتە)،",
            "verse 86:10": "ئۇنىڭدىن (يەنى ئىنساندىن) (ئازابنى دەپئى قىلىدىغان ھېچ كۈچ ۋە ياردەمچى يوقتۇر",
            "verse 86:11": "يامغۇرلۇق بۇلۇت بىلەن قەسەمكى،",
            "verse 86:12": "يېرىلىپ (گىياھلارنى ئۈندۈرۈپ بېرىدىغان) زېمىن بىلەن قەسەمكى،",
            "verse 86:13": "قۇرئان شەك - شۈبھىسىز (ھەق بىلەن باتىلنى ئايرىغۇچى) سۆزدۇر،",
            "verse 86:14": "ئۇ چاقچاق ئەمەستۇر",
            "verse 86:15": "ئۇلار (يەنى مۇشرىكلار) (قۇرئاننى يوققا چىقىرىش ئۈچۈن) ھەقىقەتەن ھىيلە - مىكىر ئىشلىتىدۇ",
            "verse 86:16": "مەن ئۇلارنىڭ ھىيلە - مىكرىگە تاقابىل تۇرىمەن",
            "verse 86:17": "(ئى مۇھەممەد!) كاپىرلارنىڭ ھالاك بولۇشىغا ئالدىرىمىغىن، ئۇلارغا ئازراق مۆھلەت بەرگىن (ئۇزاققا قالماي ئۇلارغا قانداق قىلغانلىقىمنى كۆرىسەن)"
        },
        "Uzbek": {
            "verse 86:1": "Осмон билан қасам ва ториқ билан қасам.",
            "verse 86:2": "Ториқ нималигини сенга не билдирди?",
            "verse 86:3": "У нур сочиб турувчи юлдуздир.",
            "verse 86:4": "Ҳеч бир жон йўқки, унинг ҳифз қилиб турувчиси бўлмаса.",
            "verse 86:5": "Инсон нимадан яралганига назар солсин.",
            "verse 86:6": "У отилиб чиқувчи сувдан яратилгандир.",
            "verse 86:7": "У (сув) сулб (умуртқа) ва тароиб (кўкрак суяги) орасидан чиқадир.",
            "verse 86:8": "Албатта У зот уни қайта тирилтиришга қодирдир.",
            "verse 86:9": "Сирлар фош бўладиган кундадир.",
            "verse 86:10": "Бас, (ўшанда) у(инсон)да қувват ҳам, нусрат берувчи ҳам бўлмайдир.",
            "verse 86:11": "Қайтувчи (ёмғир) соҳиби бўлган осмон билан қасам.",
            "verse 86:12": "Ёриб чиқувчи эгаси бўлган ер билан қасам.",
            "verse 86:13": "Албатта у(Қуръон) ажратувчи сўздир.",
            "verse 86:14": "Ва у ҳазил эмасдир.",
            "verse 86:15": "Албатта улар ҳийла-найранг қиларлар.",
            "verse 86:16": "Ва Мен ҳам ҳийла қилурман.",
            "verse 86:17": "Муҳлат бер кофирларга, уларга озгина муҳлат бер."
        },
        "Vietnamese": {
            "verse 86:1": "Thề bởi bầu trời và khách viếng đêm.",
            "verse 86:2": "Ngươi (Thiên Sứ Muhammad) biết gì về khách viếng đêm?",
            "verse 86:3": "Đó là vì sao xuyên không (với ánh sáng rực rỡ).",
            "verse 86:4": "Mỗi linh hồn thực sự đều có vị (Thiên Thần) trông coi.",
            "verse 86:5": "Vì vậy, hãy để con người quan sát từ những gì y được tạo ra.",
            "verse 86:6": "Quả thật, y đã được tạo ta từ một giọt nước xuất ra.",
            "verse 86:7": "Từ giữa xương sống và xương sườn.",
            "verse 86:8": "Thật vậy, Ngài (Allah) thừa khả năng tái tạo y trở lại.",
            "verse 86:9": "Vào một Ngày mà mọi điều bí mật đều sẽ được đưa ra xét xử.",
            "verse 86:10": "Khi đó con người sẽ bất lực và không có bất kỳ người trợ giúp nào.",
            "verse 86:11": "Thề bởi bầu trời với chu kỳ mưa lặp lại.",
            "verse 86:12": "Thề bởi đất đai nứt ra.",
            "verse 86:13": "Quả thật, (Qur’an) là lời phân biệt (phúc tội, đúng sai).",
            "verse 86:14": "Nó không phải là lời bỡn cợt vô ích.",
            "verse 86:15": "Quả thật, (những kẻ phủ nhận) đang định một âm mưu và thủ đoạn.",
            "verse 86:16": "Và TA cũng lập một mưu kế.",
            "verse 86:17": "Vì vậy, Ngươi (Thiên Sứ Muhammad) cứ để mặc những kẻ vô đức tin, hãy tạm tha cho chúng một lúc."
        },
        "Yoruba": {
            "verse 86:1": "(Allahu) bura pelu sanmo ati Toriƙ",
            "verse 86:2": "Ki si ni o mu o mo ohun t’o n je Toriƙ",
            "verse 86:3": "Irawo ti imole re n tan roro (ni ale ni)",
            "verse 86:4": "Ko si emi kan afi ki eso kan wa fun un (ninu awon molaika)",
            "verse 86:5": "Nitori naa, ki eniyan woye si ohun ti A fi seda re",
            "verse 86:6": "Won seda re lati inu omi t’o n tu jade kookoo",
            "verse 86:7": "O n jade lati aarin ibadi okunrin ati awon efonha igba-aya obinrin",
            "verse 86:8": "Dajudaju Allahu ni Alagbara lori idapada re",
            "verse 86:9": "ni ojo ti won maa se ayewo awon (ise) asepamo",
            "verse 86:10": "Nigba naa, ko nii si agbara tabi alaranse kan fun un",
            "verse 86:11": "Allahu bura pelu sanmo t’o n ro ojo ni odoodun",
            "verse 86:12": "O tun bura pelu ile t’o n san kankan (fun hihujade eso)",
            "verse 86:13": "Dajudaju al-Ƙur’an ni oro-ipinya (laaarin ododo ati iro)",
            "verse 86:14": "Ki i si se awada",
            "verse 86:15": "Dajudaju won n dete gan-an",
            "verse 86:16": "Emi naa si n dete gan-an",
            "verse 86:17": "Nitori naa, lora fun awon alaigbagbo. Lo won lara se fun igba die"
        }
    }
}