{
    "id": 87,
    "name_simple": "Al-A'la",
    "revelation_place": "makkah",
    "revelation_order": 8,
    "bismillah_pre": true,
    "verses_count": 19,
    "short_text": "The Surah takes its name from the word al-A`la in the very first verse.",
    "text": [
        "\n",
        "The Surah takes its name from the word al-A\\`la in the very first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "The subject matter shows that this too is one of the earliest Surahs to be revealed, and the words: \"We shall enable you to recite, then you shall never forget\" of verse 6 also indicate that it was sent down in the period when the Holy Messenger (upon whom he Allah's peace) was not yet fully accustomed to receive Revelation and at the time Revelation came down he feared lest he should forget its words. If this verse is read along with verse 114 of Surah Ta Ha and verses 16-19 of Al-Qiyamah and the three verses are also considered with regard to their styles and contexts, the sequence of events seems to be that first in this Surah the Holy Prophet (upon whom be peace) was reassured to the effect: \"Do not at all worry: We shall enable you to recite this Word, then you shall not forget it.\" Then after a lapse of time, on another occasion, when the Surah Al-Qiyamah was being revealed, the Holy Prophet involuntarily began to rehearse the words of the Revelation. Thereupon it was\r\nsaid: \"O Prophet do not move your tongue to remember this Revelation hastily. It is for Us to have it remembered and read. Therefore when We are reciting it, listen to its recital carefully. Again, it is for Us to explain its meaning.\"Last of all, on the occasion of the revelation of Surah Ta Ha, the Holy Prophet on account of human weakness, again became afraid lest his memory should fail to preserve some portion of the 113 verses which were continuously revealed at that time, and therefore, he began to memorize them. Thereupon, it was said: \"And see that you do not hasten to recite the Quran before its revelation is completed to you.\"After this, it never so happened that he felt any such danger, for apart form these three places, there is no other place in the Quran where there might be a reference to this matter.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "This short surah contains three themes: Tauhid, instructions to the Holy Prophet (upon whom be peace) and the Hereafter.",
        "\n",
        "In the first verse, the doctrine of Tauhid has been compressed into a single sentence, saying that Allah's name should be glorified and exalted, i. e. He should not be remembered by any name which mighty reflect a deficiency, fault, weakness, or an aspect of likeness, with created beings, for the root of all false creeds in the world are wrong concepts about Allah, which assumed the form of an erroneous name for His glorious and exalted Being. Therefore, for the correction of the creed, the primary thing is that Allah Almighty should be remembered only by the beautiful names which suit and befit Him.",
        "\n",
        "In the next three verses, it has been said: \"Your Lord, glorification of Whose name is being enjoined, is He Who created everything in the Universe, proportioned it, set it a destiny, taught it to perform the function for which it is created, and you witness this manifestation of His power day and night that He creates vegetation on the earth as well as reduces it to mere rubbish. No other being has the power to bring about spring nor the power to prevent autumn.\"",
        "\n",
        "Then, in the following two verses, the Holy Prophet (upon whom be peace) his been consoled, as if to say: \"Do not worry as to how you will remember word for word the Qur'an that is being revealed to you. It is for Us to preserve it in your memory, and its preservation is not in any way the result of any excellence in you but the result of Our bounty and favor, otherwise if We so will, We can cause you to forget it.\"",
        "\n",
        "Then, the Holy Prophet (upon whom be peace) has been told: \"You have not been made responsible to bring everyone on to the right path; your only duty is to convey the truth, and the simplest way of conveying the truth is that admonition be given to him who is inclined to listen to the admonition and accept it, and the one who is not inclined to it, should not be pursued. The one who fears the evil consequences of deviation and falsehood, will listen to the truth and accept it, and the wretched one who avoids listening to and accepting it, will himself see his evil end.\"'",
        "\n",
        "The discourse has been summed up, saying: \"Success is only for those who adopt purity of belief, morals and deed, and remember the name of their Lord and perform the Prayer. But, on the contrary, the people are wholly lost in seeking the ease, benefits and pleasures of the world, whereas they should actually endeavor for their well being in the Hereafter, for the world is transitory and the Hereafter everlasting and the blessings of the Hereafter are far better than the blessings of the world. This truth has not been expressed only in the Qur'an but in the books of the Prophets Abraham and Moses too, it had been brought to the notice of man.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the command to highly exalt God, the Divine One who is The Most Exalted, far above all that is unworthy that people wrongly attribute to Him. It is named after “the Most Exalted” (al-aʿlā), mentioned in verse 1. The surah reassures the Prophet Muhammad that God will help him and urging him to continue with his mission. The temporary nature of this world is highlighted through mention of the short life of green pasture (cf. verse 10:24 and verse 18: 45).The surah is also known as: Glory to Lord in the Highest, The Highest, The Most High.",
    "name_translation": "The Most Exalted",
    "name_complex": "Al-A‘lâ",
    "surah_name_ar": "الأعلى",
    "verses": {
        "Albanian": {
            "verse 87:1": "Falendero emrin e Zotit tënd të Lartësuar,",
            "verse 87:2": "që krijon çdo gjë dhe e bënë të harmonizuar,",
            "verse 87:3": "dhe që çdo gjë e ka caktuar dhe i ka dhënë inspirim,",
            "verse 87:4": "dhe që bënë të rriten kullosat,",
            "verse 87:5": "dhe pastaj bën që të shndërrohen, të thahen e të vyshken.",
            "verse 87:6": "Na do ta mësojmë ty (Kur’anin, përmes Xhebrailit), e ti nuk do ta harrosh,",
            "verse 87:7": "përveç asaj që don Zoti. Ai (Perëndia), me të vërtetë, di çdo gjë që shprehni haptazi dhe atë që fshihni –",
            "verse 87:8": "dhe Ne do ta lehtësojmë ty (rrugën) e lehtë,",
            "verse 87:9": "prandaj këshillo ti – nëse këshilla ka dobi:",
            "verse 87:10": "ai që i druan Perëndisë, këshillohet,",
            "verse 87:11": "e shmanget nga këshillat, ai më i keqi,",
            "verse 87:12": "i cili do të digjet në zjarrin e madh,",
            "verse 87:13": "e në të, as nuk do të vdes e as nuk do të jetojë (jetë normale).",
            "verse 87:14": "Shpëtimin do të arrijë ai që pastrohet (nga të këqiat)",
            "verse 87:15": "dhe që e përmend emrin e Zotit të vet dhe bënë namaz!",
            "verse 87:16": "Por ju, përkundrazi, më shumë po e parapëlqeni jetën e kësaj bote,",
            "verse 87:17": "por, jeta tjetër është më e mirë dhe e përhershme (amshuar).",
            "verse 87:18": "Kjo, me të vërtetë, ka qenë shënuar në faqet (e librave) e broshurat e lashta,",
            "verse 87:19": "librat (broshurat) e Ibrahimit dhe Musait."
        },
        "Amharic": {
            "verse 87:1": "ከሁሉ በላይ የኾነውን ጌታህን ስም አሞግሥ፡፡",
            "verse 87:2": "የዚያን (ሁሉን ነገር) የፈጠረውን ያስተካከለውንም፡፡",
            "verse 87:3": "የዚያንም የወሰነውን፡፡ (ለተፈጠረለት ነገር) የመራውንም፡፡",
            "verse 87:4": "የዚያንም ግጦሽን (ለምለም አድርጎ) ያወጣውን፡፡",
            "verse 87:5": "(ከዚያ) ደረቅ ጥቁር ያደረገውንም (አምላክ ስም አሞግስ)፡፡",
            "verse 87:6": "(ቁርኣንን) በእርግጥ እናስነብብሃለን፤ አትረሳምም፡፡",
            "verse 87:7": "አላህ ከሻው ነገር በስተቀር፡፡ እርሱ ግልጹን የሚሸሸገውንም ሁሉ ያውቃልና፡፡",
            "verse 87:8": "ለገሪቱም (ሕግጋት) እንገጥምሃለን፡፡",
            "verse 87:9": "ግሣጼይቱ ብትጠቅም (ሰዎችን) ገሥጽም፡፡",
            "verse 87:10": "(አላህን) የሚፈራ ሰው በእርግጥ ይገሠጻል፡፡",
            "verse 87:11": "መናጢውም ይርቃታል፡፡",
            "verse 87:12": "ያ ታላቂቱን እሳት የሚገባው፡፡",
            "verse 87:13": "ከዚያም በእርሷ ውስጥ አይሞትም ሕያውም አይኾንም፡፡",
            "verse 87:14": "የተጥራራ ሰው በእርግጥ ዳነ፡፡",
            "verse 87:15": "የጌታውንም ስም ያወሳና የሰገደ፡፡",
            "verse 87:16": "ይልቁንም ቅርቢቱን ሕይወት ትመርጣላችሁ፡፡",
            "verse 87:17": "መጨረሻይቱ (ሕይወት) በላጭ ሁል ጊዜ ዘውታሪም ስትኾን፡፡",
            "verse 87:18": "ይህ በፊተኞቹ መጻሕፍት ውስጥ ያልለ ነው፡፡",
            "verse 87:19": "በኢብራሂምና በሙሳ ጽሑፎች ውስጥ፡፡"
        },
        "Arabic": {
            "verse 87:1": "ىَلْعَأْلا َكِّبَر َمْسا ِحِّبَس",
            "verse 87:2": "ٰىَّوَسَف َقَلَخ يِذَّلا",
            "verse 87:3": "ٰىَدَهَف َرَّدَق يِذَّلاَو",
            "verse 87:4": "ٰىَعْرَمْلا َجَرْخَأ يِذَّلاَو",
            "verse 87:5": "ٰىَوْحَأ ًءاَثُغ ُهَلَعَجَف",
            "verse 87:6": "ٰىَسنَت اَلَف َكُئِرْقُنَس",
            "verse 87:7": "ٰىَفْخَي اَمَو َرْهَجْلا ُمَلْعَي ُهَّنِإ ۚ ُهَّللا َءاَش اَم اَّلِإ",
            "verse 87:8": "ٰىَرْسُيْلِل َكُرِّسَيُنَو",
            "verse 87:9": "ٰىَرْكِّذلا ِتَعَفَّن نِإ ْرِّكَذَف",
            "verse 87:10": "(ٰىَشْخَي نَم ُرَّكَّذَيَس",
            "verse 87:11": "(ىَقْشَأْلا اَهُبَّنَجَتَيَو",
            "verse 87:12": "(ٰىَرْبُكْلا َراَّنلا ىَلْصَي يِذَّلا",
            "verse 87:13": "(ٰىَيْحَي اَلَو اَهيِف ُتوُمَي اَل َّمُث",
            "verse 87:14": "(ٰىَّكَزَت نَم َحَلْفَأ ْدَق",
            "verse 87:15": "(ٰىَّلَصَف ِهِّبَر َمْسا َرَكَذَو",
            "verse 87:16": "(اَيْنُّدلا َةاَيَحْلا َنوُرِثْؤُت ْلَب",
            "verse 87:17": "(ٰىَقْبَأَو ٌرْيَخ ُةَرِخآْلاَو",
            "verse 87:18": "(ٰىَلوُأْلا ِفُحُّصلا يِفَل اَذَٰه َّنِإ",
            "verse 87:19": "(ٰىَسوُمَو َميِهاَرْبِإ ِفُحُص"
        },
        "Azerbaijani": {
            "verse 87:1": "Ən Uca Rəbbinin adına təriflər de!",
            "verse 87:2": "O Rəbbin ki, hər şeyi yaradıb kamilləşdirdi;",
            "verse 87:3": "O Rəbbin ki, hər şeyin müqəddəratını əzəldən müəyyən edərək yol göstərdi;",
            "verse 87:4": "O Rəbbin ki, otlağı cücərtdi,",
            "verse 87:5": "sonra da qaralmış samana çevirdi.",
            "verse 87:6": "Biz sənə Quranı elə oxumaq imkanı verəcəyik ki, o, yadından çıxmayacaq.",
            "verse 87:7": "Əlbəttə, Allahın istədiyindən başqa. Həqiqətən, O, aşkardakından da, gizli qalandan da xəbərdardır.",
            "verse 87:8": "Səni ən asan olana müvəffəq edərik.",
            "verse 87:9": "Xatırlatmanın fayda verdiyini görsən, onlara xatırlat!",
            "verse 87:10": "Allahdan qorxanlar öyüd-nəsihət götürərlər.",
            "verse 87:11": "Ən bədbəxt kimsələr isə onu qulaqardına vurarlar.",
            "verse 87:12": "O kimsə ki, Cəhənnəmə atılacaq,",
            "verse 87:13": "O orada nə öləcək, nə də yaşaya biləcəkdir.",
            "verse 87:14": "Günahlardan təmizlənən kimsə isə uğur qazanmışdır.",
            "verse 87:15": "O kimsə ki, Rəbbinin adını xatırlayıb namaz qılmışdır.",
            "verse 87:16": "Xeyr, siz dünya həyatını olduqca üstün tutursunuz;",
            "verse 87:17": "Axirət isə daha xeyirli və daha sürəklidir.",
            "verse 87:18": "Həqiqətən də bu, əvvəlki səhifələrdə bildirilmişdir –",
            "verse 87:19": "İbrahimin və Musanın səhifələrində."
        },
        "Bengali": {
            "verse 87:1": "আপনি আপনার মহান পালনকর্তার নামের পবিত্রতা বর্ণনা করুন",
            "verse 87:2": "যিনি সৃষ্টি করেছেন ও সুবিন্যস্ত করেছেন।",
            "verse 87:3": "এবং যিনি সুপরিমিত করেছেন ও পথ প্রদর্শন করেছেন",
            "verse 87:4": "এবং যিনি তৃণাদি উৎপন্ন করেছেন,",
            "verse 87:5": "অতঃপর করেছেন তাকে কাল আবর্জনা।",
            "verse 87:6": "আমি আপনাকে পাঠ করাতে থাকব, ফলে আপনি বিস্মৃত হবেন না",
            "verse 87:7": "আল্লাহ যা ইচ্ছা করেন তা ব্যতীত। নিশ্চয় তিনি জানেন প্রকাশ্য ও গোপন বিষয়।",
            "verse 87:8": "আমি আপনার জন্যে সহজ শরীয়ত সহজতর করে দেবো।",
            "verse 87:9": "উপদেশ ফলপ্রসূ হলে উপদেশ দান করুন,",
            "verse 87:10": "যে ভয় করে, সে উপদেশ গ্রহণ করবে,",
            "verse 87:11": "আর যে, হতভাগা, সে তা উপেক্ষা করবে,",
            "verse 87:12": "সে মহা-অগ্নিতে প্রবেশ করবে।",
            "verse 87:13": "অতঃপর সেখানে সে মরবেও না, জীবিতও থাকবে না।",
            "verse 87:14": "নিশ্চয় সাফল্য লাভ করবে সে, যে শুদ্ধ হয়",
            "verse 87:15": "এবং তার পালনকর্তার নাম স্মরণ করে, অতঃপর নামায আদায় করে।",
            "verse 87:16": "বস্তুতঃ তোমরা পার্থিব জীবনকে অগ্রাধিকার দাও,",
            "verse 87:17": "অথচ পরকালের জীবন উৎকৃষ্ট ও স্থায়ী।",
            "verse 87:18": "এটা লিখিত রয়েছে পূর্ববতী কিতাবসমূহে;",
            "verse 87:19": "ইব্রাহীম ও মূসার কিতাবসমূহে।"
        },
        "Berber Amazigh": {
            "verse 87:1": "Sbuccaâ ism n Mass ik, Aâlayan,",
            "verse 87:2": "Ixelqen, Issemsaway,",
            "verse 87:3": "Iwezznen, Inhan,",
            "verse 87:4": "I d Issuff$en takessawt,",
            "verse 87:5": "sinna, Ippara p d asa$uô aberkan.",
            "verse 87:6": "A k Ness$eô, ur teppu,",
            "verse 87:7": "siwa ayen Irad Öebbi. Ih, Neppa, Issen ayen ibanen, akked wayen iffren.",
            "verse 87:8": "A k Nawi ar liser.",
            "verse 87:9": "Smmekti mi infaâ usmekti.",
            "verse 87:10": "A d ismmekti win iugaden.",
            "verse 87:11": "Ageswaê ijuneb it.",
            "verse 87:12": "Di tmes tabarart mavi ara iô$.",
            "verse 87:13": "Degs, ur ipmeppat, ur ippidir.",
            "verse 87:14": "Amarezg n win zeddigen!",
            "verse 87:15": "I ismektayen ism n Mass is, d$a ipéalla.",
            "verse 87:16": "Maca, tesmenyafem tameddurt n ddunit.",
            "verse 87:17": "Tif ip laxeôt, a pdum kteô.",
            "verse 87:18": "Ayagi, illa di tewôeqtin timezwura,",
            "verse 87:19": "Tiwôeqtin n Ibôahim akked Musa."
        },
        "Bosnian": {
            "verse 87:1": "Hvali ime Gospodara svoga Svevišnjeg,",
            "verse 87:2": "koji sve stvara i čini skladnim,",
            "verse 87:3": "i koji sve s mjerom određuje i nadahnjuje,",
            "verse 87:4": "i koji čini da rastu pašnjaci,",
            "verse 87:5": "i potom čini da postanu suhi, potamnjeli.",
            "verse 87:6": "Mi ćemo te naučiti da izgovaraš pa ništa nećeš zaboraviti",
            "verse 87:7": "osim onoga što će Allah htjeti – jer, On zna i ono što na javu iznosite i ono što tajite –",
            "verse 87:8": "i sve što je dobro Mi ćemo tebi dostupnim učiniti;",
            "verse 87:9": "zato poučavaj – pouka će već od koristi biti:",
            "verse 87:10": "dozvaće se onaj koji se Allaha boji,",
            "verse 87:11": "a izbjegavaće je onaj najgori,",
            "verse 87:12": "koji će u vatri velikoj gorjeti,",
            "verse 87:13": "pa u njoj neće ni umrijeti ni živjeti.",
            "verse 87:14": "Postići će šta želi onaj koji se očisti",
            "verse 87:15": "i spomene ime Gospodara svoga pa molitvu obavi!",
            "verse 87:16": "Ali, vi više život na ovom svijetu volite,",
            "verse 87:17": "a onaj svijet je bolji i vječan je.",
            "verse 87:18": "Ovo, doista, ima u listovima davnašnjim,",
            "verse 87:19": "listovima Ibrahimovim i Musaovim."
        },
        "Bulgarian": {
            "verse 87:1": "Прославяй пречистото име на твоя Господ, Върховния,",
            "verse 87:2": "Който сътвори и осъразмери,",
            "verse 87:3": "Който прецени и напъти,",
            "verse 87:4": "Който изважда [тревата на] пасбището",
            "verse 87:5": "и го превръща в черно стърнище!",
            "verse 87:6": "Ще ти дадем да четеш [Корана, о, Мухаммад] и не ще забравиш,",
            "verse 87:7": "освен каквото Аллах пожелае. Той знае явното и скритото.",
            "verse 87:8": "И ще те улесним за лесното.",
            "verse 87:9": "Напомняй, ако има полза от напомнянето!",
            "verse 87:10": "Ще си спомни онзи, който се страхува.",
            "verse 87:11": "И ще се отдръпне от това най-лошият,",
            "verse 87:12": "който ще гори в най-големия Огън.",
            "verse 87:13": "После там нито ще умре, нито ще е жив.",
            "verse 87:14": "Сполучил е онзи, който се пречиства",
            "verse 87:15": "и споменава името на своя Господ, и отслужва молитвата.",
            "verse 87:16": "Да, предпочитате земния живот,",
            "verse 87:17": "но отвъдният е по-хубав и по-дълготраен.",
            "verse 87:18": "Това е [записано] в предишните писания -",
            "verse 87:19": "писанията на Ибрахим и на Муса."
        },
        "Chinese": {
            "verse 87:1": "你当赞颂你至尊主的大名超绝万物，",
            "verse 87:2": "他创造万物，并使各物匀称。",
            "verse 87:3": "他预定万物，而加以引导。",
            "verse 87:4": "他生出牧草，",
            "verse 87:5": "然後使它变成黑色的枯草。",
            "verse 87:6": "我将使你诵读，故你不会忘记，",
            "verse 87:7": "除非真主所欲你忘记的。他的确知道显著的和隐微的言行。",
            "verse 87:8": "我将使你遵循平易的道路，",
            "verse 87:9": "故你当教诲众人，如果教诲有裨於他们的话。",
            "verse 87:10": "畏主的人，将觉悟；",
            "verse 87:11": "薄命的人，将退避，",
            "verse 87:12": "他将入於大火，",
            "verse 87:13": "然後，在火里不死也不活。",
            "verse 87:14": "有教养的人确已成功，",
            "verse 87:15": "他记念他的主的尊名，而谨守拜功。",
            "verse 87:16": "不然，你们却选择今世的生活；",
            "verse 87:17": "其实，後世是更好的，是更久长的。",
            "verse 87:18": "这确是载在古经典中的，",
            "verse 87:19": "载在易卜拉欣和穆萨的经典中的。"
        },
        "Danish": {
            "verse 87:1": "Verheerlijk de Naam van uw Heer, de Allerhoogste",
            "verse 87:2": "Die schept en vervolmaakt",
            "verse 87:3": "En Die bepaalt en leidt",
            "verse 87:4": "En Die het gewas voortbrengt",
            "verse 87:5": "En het dan doet verdorren",
            "verse 87:6": "Wij zullen u weldra onderwijzen zodat gij het niet vergeet",
            "verse 87:7": "Behalve wat Allah wil - Voorwaar, Hij kent het openlijke en het verborgene",
            "verse 87:8": "En Wij zullen uw weg effenen tot gemak",
            "verse 87:9": "Maak (anderen) daarom indachtig, voorzeker dit is nuttig",
            "verse 87:10": "Hij die vreest zal er lering uit trekken",
            "verse 87:11": "Maar de rampzalige zal zich ervan afwenden",
            "verse 87:12": "Die het grote Vuur zal binnengaan",
            "verse 87:13": "Waarin hij noch sterven noch leven zal",
            "verse 87:14": "Voorzeker, geslaagd is hij die zich loutert",
            "verse 87:15": "En die de naam van zijn Heer gedenkt en bidt",
            "verse 87:16": "Maar gij verkiest het leven dezer wereld",
            "verse 87:17": "Ofschoon het Hiernamaals beter en van langere duur is",
            "verse 87:18": "Voorzeker, dit is in vroegere geschriften vermeld",
            "verse 87:19": "De geschriften van Abraham en Mozes"
        },
        "Dutch": {
            "verse 87:1": "Prijs de naam van jouw Heer, de Hoogste.",
            "verse 87:2": "Degene Die geschapen heeft en vervolmaakt.",
            "verse 87:3": "En Degene Die de maat bepaald heeft en Die geleid heeft.",
            "verse 87:4": "Degene die het weidegras doet groeien.",
            "verse 87:5": "En het daarna dor (en) zwart maakt.",
            "verse 87:6": "Wij zullen (de Koran) aan jou voordragen en jij zult (hem) niet vergeten.",
            "verse 87:7": "Behalve wat Allah wil. Voorwaar, Hij kent het openlijke en het verborgene.",
            "verse 87:8": "En Wij zullen het gemakkelijke voor jou gemakkelijk maken.",
            "verse 87:9": "Vermaan daarom, als de Vermaning (hun) baat.",
            "verse 87:10": "Wie (Allah) vreest zal zich laten vermanen.",
            "verse 87:11": "Maar de ellendige zal het vermijden.",
            "verse 87:12": "Degene die het grote Vuur binnengaat.",
            "verse 87:13": "Hij zal dan daarin niet sterven en niet leven.",
            "verse 87:14": "Hij die zich reinigt (van zijn zonden) zal waarlijk slagen.",
            "verse 87:15": "En (ook) die de Naam van zijn Heer gedenkt en de shalât verricht.",
            "verse 87:16": "Jullie geven immers voorrang aan het wereldse leven.",
            "verse 87:17": "Terwijl het Hiernamaals beter en blijvender is.",
            "verse 87:18": "Voorwaar, dit staat zeker in de vroegere bladen.",
            "verse 87:19": "De bladen van Ibrâhîm en Môesa."
        },
        "English": {
            "verse 87:1": "Exalt the name of your Lord, the Most High,",
            "verse 87:2": "Who created and proportioned",
            "verse 87:3": "And who destined and [then] guided",
            "verse 87:4": "And who brings out the pasture",
            "verse 87:5": "And [then] makes it black stubble.",
            "verse 87:6": "We will make you recite, [O Muhammad], and you will not forget,",
            "verse 87:7": "Except what Allah should will. Indeed, He knows what is declared and what is hidden.",
            "verse 87:8": "And We will ease you toward ease.",
            "verse 87:9": "So remind, if the reminder should benefit;",
            "verse 87:10": "He who fears [Allah] will be reminded.",
            "verse 87:11": "But the wretched one will avoid it -",
            "verse 87:12": "[He] who will [enter and] burn in the greatest Fire,",
            "verse 87:13": "Neither dying therein nor living.",
            "verse 87:14": "He has certainly succeeded who purifies himself",
            "verse 87:15": "And mentions the name of his Lord and prays.",
            "verse 87:16": "But you prefer the worldly life,",
            "verse 87:17": "While the Hereafter is better and more enduring.",
            "verse 87:18": "Indeed, this is in the former scriptures,",
            "verse 87:19": "The scriptures of Abraham and Moses."
        },
        "Filipino": {
            "verse 87:1": "Luwalhatiin ang Pangalan ng iyong Tagapagtangkilik na Panginoon, ang Kataas-taasan",
            "verse 87:2": "Na Siyang lumikha (ng lahat ng bagay) at nagbigay ng anyo at kaayusan",
            "verse 87:3": "Na nagtakda ng Ganap na Sukat (kahihinatnan ng lahat at bawat isa maging sa kabutihan o kasamaan) at nagbigay ng Patnubay (nagturo sa sangkatauhan ng Tumpak at Maling Landas)",
            "verse 87:4": "At nagpatubo ng mga luntiang halamanan at pastulan",
            "verse 87:5": "At muli ay ginawa, (at Kanyang) ginawa ito na dayami (at bagaso)",
            "verse 87:6": "Sa sunod-sunod na antas ay ipahahayag Namin sa iyo (o Muhammad) ang Mensahe (ang Qur’an) upang hindi mo malimutan",
            "verse 87:7": "Maliban sa anumang pahintulutan ni Allah. Talastas Niya ang nakalantad at nalilihim",
            "verse 87:8": "At gagawin Naming magaan ito sa iyo (O Muhammad) upang masunod mo ang Landas (sa paggawa ng mga kabutihan)",
            "verse 87:9": "Kaya’t paalalahanan mo (ang mga tao) kung ang pagpapaala-ala ay magbibigay kapakinabangan (sa mga makikinig)",
            "verse 87:10": "Ang panawagan at paala-ala ay diringgin niya na may pangangamba (kay Allah)",
            "verse 87:11": "Datapuwa’t ito ay itatakwil ng mga masasawing palad (sa kaparusahan)",
            "verse 87:12": "Na mahuhulog sa Nag-aalimpuyong Apoy at lalasap ng kanyang paglalagablab",
            "verse 87:13": "dito, siya ay hindi mamamatay (upang maginhawahan), o mabubuhay (sa mabuting kalagayan)",
            "verse 87:14": "Katiyakan, ang magtatamo 954 ng tagumpay ay siya na nagpapadalisay ng kanyang sarili (sa pamamagitan ng pag-iwas sa pagsamba sa mga diyus- diyosan at pagtanggap sa Kaisahan ni Allah at sa Islam)",
            "verse 87:15": "At lumuluwalhati sa Pangalan ng kanyang Tagapagtangkilik na Panginoon (sumasamba lamang kay Allah at wala ng iba), at bukas ang puso sa pananalangin (alalaong baga, ang limang takdang panalangin sa maghapon bukod pa ang mga dasal na ipinagtatagubilin)",
            "verse 87:16": "Datapuwa’t minahalaga ninyo ang buhay sa mundong ito na hindi magtatagal",
            "verse 87:17": "Bagama’t ang Kabilang Buhay ay higit na mainam at mananatili",
            "verse 87:18": "Katotohanang ito ay nasa mga Aklat ng unang kasulatan",
            "verse 87:19": "Sa mga Kasulatan ni Abraham at Moises"
        },
        "French": {
            "verse 87:1": "Glorifie le nom de ton Seigneur, le Très Haut,",
            "verse 87:2": "Celui Qui a créé et agencé harmonieusement,",
            "verse 87:3": "qui a décrété et guidé,",
            "verse 87:4": "et qui a fait pousser le pâturage,",
            "verse 87:5": "et en a fait ensuite un foin sombre.",
            "verse 87:6": "Nous te ferons réciter (le Coran), de sorte que tu n'oublieras",
            "verse 87:7": "que ce qu'Allah veut. Car, Il connaît ce qui paraît au grand jour ainsi que ce qui est caché.",
            "verse 87:8": "Nous te mettrons sur la voie la plus facile.",
            "verse 87:9": "Rappelle, donc, où le Rappel doit être utile.",
            "verse 87:10": "Quiconque craint (Allah) s'[en] rappellera,",
            "verse 87:11": "et s'en écartera le grand malheureux,",
            "verse 87:12": "qui brûlera dans le plus grand Feu,",
            "verse 87:13": "où il ne mourra ni ne vivra.",
            "verse 87:14": "Réussit, certes, celui qui se purifie,",
            "verse 87:15": "et se rappelle le nom de son Seigneur, puis célèbre la Salât.",
            "verse 87:16": "Mais, vous préférez plutôt la vie présente,",
            "verse 87:17": "alors que l'au-delà est meilleur et plus durable.",
            "verse 87:18": "Ceci se trouve, certes, dans les Feuilles anciennes,",
            "verse 87:19": "les Feuilles d'Abraham et de Moïse."
        },
        "Fulah": {
            "verse 87:1": "Senin innde joom Ma ɓurnde toowde",
            "verse 87:2": "Oon takɗo O fonndi",
            "verse 87:3": "Oon koddirɗo refti O feewni",
            "verse 87:4": "Oon yaltinɗo durngol",
            "verse 87:5": "O watti ngol yoorko wayliiko",
            "verse 87:6": "Ma Min njanngin Ma A yeɓjjittah",
            "verse 87:7": "Si wonah ko Alla haaji pellet hombo anndi ko feeñi e ko wirnii",
            "verse 87:8": "Min newnan Ma na newori",
            "verse 87:9": "Siftinir ɗoon ɗo ciftanirgol na nafata",
            "verse 87:10": "Ma waacta oon kulɗo Alla",
            "verse 87:11": "Woɗɗitoo mbo ɓurɗo hiiteede",
            "verse 87:12": "Oon naatoowo yiite mannge nge",
            "verse 87:13": "Refti o maayatah toon o wuuratah",
            "verse 87:14": "Malaama oon laaɓɗo e sirku",
            "verse 87:15": "O jantii Innde joom makko o juuli",
            "verse 87:16": "Ko woni, ko hoɗon ɓurna nguurndam aduna",
            "verse 87:17": "Ko laakira ɓuri moƴƴude e heddaade",
            "verse 87:18": "ɗum ina e ɗereeji gadiiɗi",
            "verse 87:19": "ɗereeji Ibraahiima e Muusa"
        },
        "German": {
            "verse 87:1": "Preise den Namen deines höchsten Herrn,",
            "verse 87:2": "Der erschafft und dann zurechtformt",
            "verse 87:3": "und Der das Maß festsetzt und dann rechtleitet",
            "verse 87:4": "und Der die Weide hervorbringt",
            "verse 87:5": "und sie dann zu dunkelbrauner Spreu macht.",
            "verse 87:6": "Wir werden dich lesen lassen, und dann wirst du nichts vergessen,",
            "verse 87:7": "außer dem, was Allah will. Er weiß ja, was laut vernehmbar geäußert wird und was verborgen bleibt.",
            "verse 87:8": "Und Wir werden dir den Weg zum Leichteren leicht machen.",
            "verse 87:9": "So ermahne -, wenn die Ermahnung nützt.",
            "verse 87:10": "Bedenken wird jemand, der gottesfürchtig ist.",
            "verse 87:11": "Meiden aber wird es der Unseligste,",
            "verse 87:12": "der dem größten (Höllen)feuer ausgesetzt sein wird;",
            "verse 87:13": "darin wird er hierauf weder sterben noch leben.",
            "verse 87:14": "Wohl ergehen wird es ja jemandem, der sich läutert,",
            "verse 87:15": "und des Namens seines Herrn gedenkt; so betet er.",
            "verse 87:16": "Nein! Vielmehr zieht ihr das diesseitige Leben vor,",
            "verse 87:17": "während das Jenseits besser und beständiger ist.",
            "verse 87:18": "Dies ist wahrlich in den früheren Blättern (enthalten),",
            "verse 87:19": "den Blättern Ibrahims und Musas."
        },
        "Hausa": {
            "verse 87:1": "Ka tsarkake sũnan Ubangijinka Mafi ɗaukaka.",
            "verse 87:2": "Wanda Yã yi halitta sa'an nan Ya daidaita abin halittar.",
            "verse 87:3": "Kuma Wanda Ya ƙaddara (abin da Ya so) sannan Ya shiryar, (da mutum ga hanyar alhẽri da ta sharri).",
            "verse 87:4": "Kuma Wanda Ya fitar da makiyãyã.",
            "verse 87:5": "Sa'an nan Ya mayar da ita ƙeƙasassa, baƙa.",
            "verse 87:6": "Za mu karantar da kai (Alƙur'ãni) sabõda haka bã zã ka mantã (shi) ba.",
            "verse 87:7": "Fãce abin da Allah Ya so, lalle ne Shi (Allah) Ya san bayyane da abin da yake bõye.",
            "verse 87:8": "Kuma za Mu sauƙaƙe maka (al'amari) zuwa ga (Shari'a) mai sauƙi.",
            "verse 87:9": "Sabõda baka, ka tunãtar, idan tunatarwa zã ta yi amfãni.",
            "verse 87:10": "Wanda yake tsõron (Allah) Zai tuna.",
            "verse 87:11": "Kuma shaƙiyyi, zai nisanceta,",
            "verse 87:12": "Wanda zai shiga wutar da tã fi girma.",
            "verse 87:13": "Sa'an nan bã zai mutu ba a cikinta, kuma bã zai rãyu ba.",
            "verse 87:14": "Lalle ne wanda ya tsarkaka (da ĩmãni) yã sãmu babban rabo.",
            "verse 87:15": "Kuma ya ambaci sũnan Ubangijinsa, sa'an nan yã yi salla.",
            "verse 87:16": "Ba haka ba! Kunã zãɓin rãyuwa ta kusa dũniya.",
            "verse 87:17": "Alhãli Lãhira ita ce mafi alheri kuma mafi wanzuwa.",
            "verse 87:18": "Lalle ne, wannan yanã a cikin littafan farko.",
            "verse 87:19": "Littaffan Ibrãhĩm da Mũsã."
        },
        "Hindi": {
            "verse 87:1": "ऐ रसूल अपने आलीशान परवरदिगार के नाम की तस्बीह करो",
            "verse 87:2": "जिसने (हर चीज़ को) पैदा किया",
            "verse 87:3": "और दुरूस्त किया और जिसने (उसका) अन्दाज़ा मुक़र्रर किया फिर राह बतायी",
            "verse 87:4": "और जिसने (हैवानात के लिए) चारा उगाया",
            "verse 87:5": "फिर ख़ुश्क उसे सियाह रंग का कूड़ा कर दिया",
            "verse 87:6": "हम तुम्हें (ऐसा) पढ़ा देंगे कि कभी भूलो ही नहीं",
            "verse 87:7": "मगर जो ख़ुदा चाहे (मन्सूख़ कर दे) बेशक वह खुली बात को भी जानता है और छुपे हुए को भी",
            "verse 87:8": "और हम तुमको आसान तरीके की तौफ़ीक़ देंगे",
            "verse 87:9": "तो जहाँ तक समझाना मुफ़ीद हो समझते रहो",
            "verse 87:10": "जो खौफ रखता हो वह तो फौरी समझ जाएगा",
            "verse 87:11": "और बदबख्त उससे पहलू तही करेगा",
            "verse 87:12": "जो (क़यामत में) बड़ी (तेज़) आग में दाख़िल होगा",
            "verse 87:13": "फिर न वहाँ मरेगा ही न जीयेगा",
            "verse 87:14": "वह यक़ीनन मुराद दिली को पहुँचा जो (शिर्क से) पाक हो",
            "verse 87:15": "और अपने परवरदिगार का ज़िक्र करता और नमाज़ पढ़ता रहा",
            "verse 87:16": "मगर तुम लोग दुनियावी ज़िन्दगी को तरजीह देते हो",
            "verse 87:17": "हालॉकि आख़ोरत कहीं बेहतर और देर पा है",
            "verse 87:18": "बेशक यही बात अगले सहीफ़ों",
            "verse 87:19": "इबराहीम और मूसा के सहीफ़ों में भी है"
        },
        "Indonesian": {
            "verse 87:1": "Sucikanlah nama Tuhanmu Yang Maha Tingi,",
            "verse 87:2": "yang menciptakan, dan menyempurnakan (penciptaan-Nya),",
            "verse 87:3": "dan yang menentukan kadar (masing-masing) dan memberi petunjuk,",
            "verse 87:4": "dan yang menumbuhkan rumput-rumputan,",
            "verse 87:5": "lalu dijadikan-Nya rumput-rumput itu kering kehitam-hitaman.",
            "verse 87:6": "Kami akan membacakan (Al Quran) kepadamu (Muhammad) maka kamu tidak akan lupa,",
            "verse 87:7": "kecuali kalau Allah menghendaki. Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi.",
            "verse 87:8": "dan Kami akan memberi kamu taufik ke jalan yang mudah,",
            "verse 87:9": "oleh sebab itu berikanlah peringatan karena peringatan itu bermanfaat,",
            "verse 87:10": "orang yang takut (kepada Allah) akan mendapat pelajaran,",
            "verse 87:11": "dan orang-orang yang celaka (kafir) akan menjauhinya.",
            "verse 87:12": "(Yaitu) orang yang akan memasuki api yang besar (neraka).",
            "verse 87:13": "Kemudian dia tidak akan mati di dalamnya dan tidak (pula) hidup.",
            "verse 87:14": "Sesungguhnya beruntunglah orang yang membersihkan diri (dengan beriman),",
            "verse 87:15": "dan dia ingat nama Tuhannya, lalu dia sembahyang.",
            "verse 87:16": "Tetapi kamu (orang-orang kafir) memilih kehidupan duniawi.",
            "verse 87:17": "Sedang kehidupan akhirat adalah lebih baik dan lebih kekal.",
            "verse 87:18": "Sesungguhnya ini benar-benar terdapat dalam kitab-kitab yang dahulu,",
            "verse 87:19": "(yaitu) Kitab-kitab Ibrahim dan Musa"
        },
        "Italian": {
            "verse 87:1": "Glorifica il Nome del tuo Signore, l'Altissimo,",
            "verse 87:2": "Colui Che ha creato e dato forma armoniosa,",
            "verse 87:3": "Colui Che ha decretato e guidato,",
            "verse 87:4": "Colui Che fa germinare i pascoli,",
            "verse 87:5": "e ne fa poi fieno scuro.",
            "verse 87:6": "Ti faremo recitare [il Corano] e non dimenticherai",
            "verse 87:7": "se non ciò che Allah vuole. Egli conosce il palese e l'occulto.",
            "verse 87:8": "Ti faciliteremo la [via] più facile.",
            "verse 87:9": "Ricorda, ché il Ricordo è utile:",
            "verse 87:10": "se ne ricorderà chi teme [Allah]",
            "verse 87:11": "e solo il malvagio se ne allontanerà:",
            "verse 87:12": "brucerà nel Fuoco più grande,",
            "verse 87:13": "in cui non morrà e non vivrà.",
            "verse 87:14": "Avrà successo chi si sarà purificato,",
            "verse 87:15": "e avrà ricordato il Nome di Allah e assolto all'orazione.",
            "verse 87:16": "Ma voi preferite la vita terrena,",
            "verse 87:17": "mentre l'altra è migliore e più duratura.",
            "verse 87:18": "In verità ciò è nei Fogli antichi,",
            "verse 87:19": "i Fogli di Abramo e di Mosè."
        },
        "Japanese": {
            "verse 87:1": "至高の御方，あなたの主の御名を讃えなさい。",
            "verse 87:2": "かれは創造し，整え調和させる御方，",
            "verse 87:3": "またかれは，法を定めて導き，",
            "verse 87:4": "牧野を現わされる御方。",
            "verse 87:5": "それから，浅黒く枯れた刈株になされる。",
            "verse 87:6": "われは，あなたに読誦させるようにした。それであなたは忘れないであろう。",
            "verse 87:7": "アッラーの御望みがない限りは。本当にかれは，表われたものと隠れたものを知っておられる。",
            "verse 87:8": "われはあなたに（道を）平坦で，安易にするであろう。",
            "verse 87:9": "だから訓戒しなさい。訓戒は（聞く者に）役立つ。",
            "verse 87:10": "訓戒は，主を畏れる者に受け入れられよう。",
            "verse 87:11": "だが最も不幸な者は，それを避けるであろう。",
            "verse 87:12": "かれは巨大な炎で焼かれよう。",
            "verse 87:13": "その中で，死にも，生きもしない。",
            "verse 87:14": "だが自ら清めた者は必ず栄え，",
            "verse 87:15": "かれの主の御名を唱念し，礼拝を守る。",
            "verse 87:16": "いや，あなたがたは現世の生活の方を好む。",
            "verse 87:17": "来世がもっと優れ，またもっと永遠なものであるのに。",
            "verse 87:18": "これは本当に，昔の啓典にあり，",
            "verse 87:19": "イブラーヒームやムーサーの啓典にもある。"
        },
        "Jawa": {
            "verse 87:1": "Nyebuta Maha Suci tumrap asmane Allah Pangeranira kang Maha Luhur",
            "verse 87:2": "Kang wis gawe samu barang kelawan prayoga",
            "verse 87:3": "Lan mesthi kahanane samu barang mau ala lan becik atas kersane pribadi nuli nuduhake barang kang amrih becik",
            "verse 87:4": "Lan kang angetokake thethukulan",
            "verse 87:5": "Sawuse ijo dikersakake garing warnane abang semu kuning",
            "verse 87:6": "Ingsun bakal mulang Qur’an maran sira (Muhammad) lan sira ora bakal lali",
            "verse 87:7": "Kajaba barang kang dikersaake Allah, satemene Allah iku nguningani panggawe lan pangucap nyata lan samar - samar",
            "verse 87:8": "Lan Ingsun nulungi sira anglakoni dalan kang gampang",
            "verse 87:9": "Mulane aweha pepeling, satemene pepeling iku migunani",
            "verse 87:10": "Sapa sing wedi ing Allah, bakal ngestokake pepeling",
            "verse 87:11": "Dene wong kang cilaka bakal angedohi",
            "verse 87:12": "Yaiku kang bakal nyemplung geni gedhe",
            "verse 87:13": "Ana ing kana banjur ora mati lan ora urip",
            "verse 87:14": "Sayekti bakal begja sapa sing anuceni dhirine",
            "verse 87:15": "WOng mau nyebut asmaning Allah pangerane lan anglakoni sholat",
            "verse 87:16": "Nanging sira padha milih kauripan dunya",
            "verse 87:17": "Kabegjan ing akherat iku luwih becik tur langgeng (ngungkuli kabungahan dunya)",
            "verse 87:18": "Wewulang sing wis kasebut mau, uga kasebut ana ing Kitab kang kuna - kuna",
            "verse 87:19": "Kitabe(Shuhuf) Ibrahim lan Kitabe (Shuhuf) Musa"
        },
        "Kazakh": {
            "verse 87:1": "Ей, Мұхаммед! Аса жоғары Раббыңның есімін пәк деп дәріпте",
            "verse 87:2": "Ол жаратып, орын-орнымен теңестірген",
            "verse 87:3": "және алдын ала белгілеп, бағыттаған",
            "verse 87:4": "әрі жайылымдарды шығарған",
            "verse 87:5": "кейін оны қурап, қарайған қоқымға айналдырған",
            "verse 87:6": "Ей, Мұхаммед! Біз саған Құранды оқытамыз, сен есіңнен шығармайсың",
            "verse 87:7": "тек Аллаһтың қалағанын ғана ұмытасың . Шын мәнінде, Ол жарияны да және жасырылғанды да біледі",
            "verse 87:8": "Әрі Біз саған ең жеңілін оңайластырамыз",
            "verse 87:9": "Естеріне салу пайда беретін болса, естеріне сал",
            "verse 87:10": "Аллаһтың жазасынан қорыққан есіне алады",
            "verse 87:11": "Ал, одан ең бақытсыз ғана өзін аулақ ұстайды",
            "verse 87:12": "үлкен отта жанатын",
            "verse 87:13": "Кейін ол онда өлмейді де, өмір де сүрмейді",
            "verse 87:14": "Сөзсіз, мұратына жетті өзін тазартқан",
            "verse 87:15": "әрі Раббысының есімін еске алған және намаз оқыған",
            "verse 87:16": "Алайда сендер осы өмірді артық көресіңдер",
            "verse 87:17": "Ал, соңғы, мәңгілік өмір ақирет қайырлы әрі тұрақты",
            "verse 87:18": "Анығында, бұл әуелгі жазбаларда бар",
            "verse 87:19": "Ибраһим және Мұсаның жазбаларында оларға түсірілген сухуфтарда"
        },
        "Korean": {
            "verse 87:1": "가장 위에 계시는 주님의 이름을 찬미하라가장 위에 계시는 주님의 이름을 찬미하라",
            "verse 87:2": "그분은 인간을 창조하사 가장아름다운 형상으로 지으셨으며그분은 인간을 창조하사 가장아름다운 형상으로 지으셨으며",
            "verse 87:3": "모든 것에 특징을 두사 그것 으로 유용케 하였으며모든 것에 특징을 두사 그것 으로 유용케 하였으며",
            "verse 87:4": "그분은 목초를 생성케 하시고그분은 목초를 생성케 하시고",
            "verse 87:5": "그것을 갈색의 마른 풀로 하 시도다그것을 갈색의 마른 풀로 하 시도다",
            "verse 87:6": "하나님이 그대에게 말씀을 계시하니 암기하여 잊지 말라하나님이 그대에게 말씀을 계시하니 암기하여 잊지 말라",
            "verse 87:7": "그러나 하나님이 원하는 것은제외라 실로 그분은 있는 것과 숨겨진 모든 것을 알고 계시니라그러나 하나님이 원하는 것은제외라 실로 그분은 있는 것과 숨겨진 모든 것을 알고 계시니라",
            "verse 87:8": "하나님은 그것이 그대에게 쉽도록 하여 주었으니하나님은 그것이 그대에게 쉽도록 하여 주었으니",
            "verse 87:9": "그 교훈을 전달하여 듣는 자 들에게 유익하도록 하라그 교훈을 전달하여 듣는 자 들에게 유익하도록 하라",
            "verse 87:10": "하나님을 두려워 하는 자들 은 그 교훈을 받아들일 것이며하나님을 두려워 하는 자들 은 그 교훈을 받아들일 것이며",
            "verse 87:11": "불행한 불신자들은 그것을 회피하니불행한 불신자들은 그것을 회피하니",
            "verse 87:12": "큰 불지옥으로 들어가큰 불지옥으로 들어가",
            "verse 87:13": "그곳에서 죽지도 아니하고 살지도 못하리라그곳에서 죽지도 아니하고 살지도 못하리라",
            "verse 87:14": "그러나 스스로를 청결케 한 자 번성하리니그러나 스스로를 청결케 한 자 번성하리니",
            "verse 87:15": "주님의 이름을 찬미하고 기 도하라주님의 이름을 찬미하고 기 도하라",
            "verse 87:16": "그래도 너희가 현세의 삶을 좋아하나그래도 너희가 현세의 삶을 좋아하나",
            "verse 87:17": "내세가 더 좋으며 영원하니 라내세가 더 좋으며 영원하니 라",
            "verse 87:18": "실로 이것은 옛 성서에도 계 시되어 있으며실로 이것은 옛 성서에도 계 시되어 있으며",
            "verse 87:19": "아브라함과 모세의 성서에도그러하니라아브라함과 모세의 성서에도그러하니라"
        },
        "Kurdish": {
            "verse 87:1": "(Muhemmed!) tu bi navê Xuda yê xweyê bilintir paqîjî ya vî ji kêmayan bikeته‌سبیحات و ستایشی په‌روه‌ردگاری به‌رزو بڵند و پایه‌دارت بکه‌.",
            "verse 87:2": "Ew (Xweda yê te) afirandin kirîye, îdî bi pêkanî rast kiriyeئه‌‌و زاته‌ی هه‌موو شتێکی دروستکردووه به‌جوانی و ڕێکوپێک و تێرو ته‌واویی کردووه‌.",
            "verse 87:3": "Ewî ji hemû heyan ra (temtêla wan) pîvaye, îdî paşê anîye rêya rastئه‌و زاته‌ی که نه‌خشه‌ی کێشاوه بۆ هه‌موو شتێك و جا ڕێنموویی کردووه‌.",
            "verse 87:4": "Ewî kovîçêr derxistîyeئه‌وه‌ی که گژوگیای له له‌وه‌ڕگا ده‌رهێناوه‌.",
            "verse 87:5": "Îdî paşê ewa (çêra) xistêye gîhakî reşê hişk maye(به‌ڵام دوای ماوه‌یه‌ک) ده‌یکاته پووش و په‌ڵاشتێکی زه‌رده و وشك و ڕه‌شهه‌ڵگه‌ڕاو.",
            "verse 87:6": "(Muhemmed) di nêzîk da (bi Cibraîl) emê (Qur´an ê) ji te ra bidin xûndinê, îdî tu bîrva nekî{ ئه‌ی محمد (صلی الله علیه وسلم) } ئێمه قورئانت له ڕێگه‌ی جوبره‌ئیله‌وه به‌سه‌ردا ده‌خوێنینه‌وه‌، ئیتر هه‌رگیز بیرت ناچێت.",
            "verse 87:7": "Ji pêştirê tişta Yezdan (bîrva kirina wê) va ye. Loma bi rastî Yezdan bi tişta xûyayî û bi tişta veşartî dizaneمه‌گه‌ر شتێك ویستی خوای له‌سه‌ربێت، چونکه به‌ڕاستی خوا ئاگاداره به‌و شتانه‌ی که ئاشکراو دیارن، یاخود شاراوه‌ن.",
            "verse 87:8": "Û emê ji bona te ra rêya hêsabûna (berkirinê) pêk bîn inجا دڵنیابه ئێمه یارمه‌تیت ده‌ده‌ین بۆ ئه‌نجامدانی هه‌موو چاکه‌یه‌ك، هه‌موو کارێكی له‌بارت بۆ ئاسان ده‌که‌ین.",
            "verse 87:9": "(Muhemmed) heke şîreta (bi Qur´an ê)ji bona wan ra kêr tê tu ji wan ra şîretan bikeکه‌واته تۆ ئیتر له‌سه‌ر یادخستنه‌وه و یاداوه‌ری ئه‌و که‌سانه به‌رده‌وام به که سوودیان وه‌رگرتووه و ئاماده‌ن زیاتر تێبگه‌ن.",
            "verse 87:10": "Bi rastî ewê (ji Xudê) bitirs e, wê (ji Qur´an ê) şîretan hildeبێگومان ئه‌و که‌سه‌ی که ترسی خوای له دڵدا بێت یاده‌وه‌ری وه‌رده‌گرێت.",
            "verse 87:11": "Ewê gunehkarê ji rê derketî heye! Ewa jî xwe (ji şîretê Qur´an ê) diparisîn eخراپترین که‌س خۆی لێ دوور ده‌گرێت...",
            "verse 87:12": "Ewa di agirê mezin da tê avêtinêئه‌وه‌ی ده‌چێته ناو ئاگره‌که گه‌وره‌که‌وه و ده‌سوتێت تیایدا.",
            "verse 87:13": "Paşê (di agirda jî) ne dijî û ne jî dimireله‌وه‌ودوا نه ئه‌وه‌یه بمرێت و (ڕزگاری بێت، نه ئه‌وه‌شه که‌) ژیانێکی ئاسایی به‌سه‌ر به‌رێت.",
            "verse 87:14": "Bi sond! Ewê ku xwe ji (gunehan) paqij kirîye haye! Ewa feredte bûyeبێگومان ئه‌و که‌سه سه‌رفرازه که ده‌روونی خۆی پاك ڕاگرتووه و...",
            "verse 87:15": "Îdî ewî bi navê Xuda yê xwe şîret hildaye û nimêj kirîyeناوی په‌روه‌ردگاری ده‌بات و نوێژی بۆ ده‌کات و کڕنووش و سوژده‌ی بۆ بردووه‌.",
            "verse 87:16": "Lê hûnê jîna cihanê heldibijêrinکه‌چی ئێوه ڕێبازی ڕزگاری ناگرنه به‌رو به‌ڵکو زیاتر ژیانی دنیاتان مه‌به‌سته‌.",
            "verse 87:17": "Jîna parada jî (ji jîna cihanê) çêtir û mayîtir eله‌کاتێکدا قیامه‌ت و به‌ده‌ست هێنانی به‌هه‌شت چاکتره و به‌رده‌وامیشه (هه‌ر به‌راورد ناکرێت له‌گه‌ڵ ته‌مه‌نی کورتی دنیادا).",
            "verse 87:18": "Bi rastî evan (şîretan) di pirtûk û rûpelên berêda jî hebûn eبێگومان ئه‌م یادخستنه‌وانه له په‌ڕاوه دێرینه‌کانیشدا باسکراوه‌.",
            "verse 87:19": "Ewan rûpelan, rûpelê Ibrahîm û Mûsa nin(له‌وانه‌) کتێبه پیرۆزه‌کانی ئیبراهیم و موسا."
        },
        "Kyrgyz": {
            "verse 87:1": "Эң жогорку Раббиңдин ысымын (бардык кемчилдиктүү сыпаттардан) аруула",
            "verse 87:2": "Ал(бүт ааламдарды) жараткан жана теңсалмактуу кылган",
            "verse 87:3": "Жана (ааламдардагы жандуу-жансыз нерселердин өмүрүн, тагдырын) өлчөп-белгилеп, (ар бирине өзгөчө касиеттер берип, жашоо жолуна) багыттаган",
            "verse 87:4": "Ал (эрте жазда жерден ар түрдүү) өсүмдүктү чыгарып",
            "verse 87:5": "андан соң (кеч күздө) карарган чөп кылып койот",
            "verse 87:6": "(О, Мухаммад), Биз сага (Кураанды) окутабыз. Анан сен эч унутпайсың",
            "verse 87:7": "Бирок, Аллаһ (унуттурууну) каалаган нерселерди гана унутасың. Ал чынында, ашкере жана купуя нерселерди билет",
            "verse 87:8": "Жана Биз сага оңой жолду жеңил кылып беребиз",
            "verse 87:9": "Эми, насаат пайда берсе (адамдарга Кураан менен) насаат айткын",
            "verse 87:10": "(Насаатты) Аллаһтан корккон адамдар гана эсине алышат",
            "verse 87:11": "Шордуу адам болсо андан качат",
            "verse 87:12": "Ал эбегейсиз чоң отко кире турган киши",
            "verse 87:13": "Ал анын (тозоктун) ичинде же өлө албайт же жашай албайт",
            "verse 87:14": "Ким (ыйман менен) тазарган болсо, ал ийгиликке жетти",
            "verse 87:15": "Жана Раббисинин ысымын эскерип, намаз окуса ( - ийгиликке жетти)",
            "verse 87:16": "Силер (эй, каапырлар!) дүйнө жашоосун (Акыреттен) жогору койосуңар",
            "verse 87:17": "Бирок, Акырет (жашоосу) жакшы жана түбөлүк",
            "verse 87:18": "Чынында, бул (айтылгандар) абалкы (ыйык) барактарда да бар эле",
            "verse 87:19": "Ибрахимдин жана Мусанын барактарында"
        },
        "Malay": {
            "verse 87:1": "Bertasbihlah mensucikan nama Tuhanmu Yang Maha Tinggi (dari segala sifat-sifat kekurangan), -",
            "verse 87:2": "Yang telah menciptakan (sekalian makhlukNya) serta menyempurnakan kejadiannya dengan kelengkapan yang sesuai dengan keadaannya;",
            "verse 87:3": "Dan Yang telah mengatur (keadaan makhluk-makhlukNya) serta memberikan hidayah petunjuk (ke jalan keselamatannya dan kesempurnaannya);",
            "verse 87:4": "Dan Yang telah mengeluarkan tumbuh-tumbuhan untuk binatang-binatang ternak,",
            "verse 87:5": "Kemudian Ia menjadikan (tumbuh-tumbuhan yang menghijau) itu kering - (berubah warnanya) kehitam-hitaman.",
            "verse 87:6": "Kami sentiasa menjadikan engkau (wahai Muhammad) dapat membaca (Al-Quran yang diturunkan kepadamu - dengan perantaraan jibril), sehingga engkau (menghafaznya dan) tidak lupa,",
            "verse 87:7": "Kecuali apa yang dikehendaki Allah engkau lupakan; sesungguhnya Ia mengetahui (segala keadaan yang patut berlaku), dan yang tersembunyi.",
            "verse 87:8": "Dan Kami tetap memberi kemudahan kepadamu untuk (melaksanakan segala perkara) Ugama yang mudah diterima oleh akal yang sihat.",
            "verse 87:9": "Oleh itu berilah peringatan (kepada umat manusia dengan ajaran Al-Quran), kalau-kalau peringatan itu berguna (dan sudah tentu berguna);",
            "verse 87:10": "Kerana orang yang takut (melanggar perintah Allah) akan menerima peringatan itu;",
            "verse 87:11": "Dan (sebaliknya) orang yang sangat celaka akan menjauhinya,",
            "verse 87:12": "Dia lah orang yang akan menderita bakaran neraka yang amat besar (azab seksanya),",
            "verse 87:13": "Selain dari itu, ia tidak mati di dalamnya dan tidak pula hidup senang.",
            "verse 87:14": "Sesungguhnya berjayalah orang yang - setelah menerima peringatan itu - berusaha membersihkan dirinya (dengan taat dan amal yang soleh),",
            "verse 87:15": "Dan menyebut-nyebut dengan lidah dan hatinya akan nama Tuhannya serta mangerjakan sembahyang (dengan khusyuk).",
            "verse 87:16": "(Tetapi kebanyakkan kamu tidak melakukan yang demikian), bahkan kamu utamakan kehidupan dunia;",
            "verse 87:17": "Padahal kehidupan akhirat lebih baik dan lebih kekal.",
            "verse 87:18": "Sesungguhnya (keterangan-keterangan yang dinyatakan) ini ada (disebutkan) di dalam Kitab-kitab yang terdahulu, -",
            "verse 87:19": "Iaitu Kitab-kitab Nabi Ibrahim dan Nabi Musa."
        },
        "Malayalam": {
            "verse 87:1": "അത്യുന്നതനായ നിന്‍റെ രക്ഷിതാവിന്‍റെ നാമം പ്രകീര്‍ത്തിക്കുക.",
            "verse 87:2": "സൃഷ്ടിക്കുകയും, സംവിധാനിക്കുകയും ചെയ്ത (രക്ഷിതാവിന്‍റെ)",
            "verse 87:3": "വ്യവസ്ഥ നിര്‍ണയിച്ചു മാര്‍ഗദര്‍ശനം നല്‍കിയവനും,",
            "verse 87:4": "മേച്ചില്‍ പുറങ്ങള്‍ ഉല്‍പാദിപ്പിച്ചവനും",
            "verse 87:5": "എന്നിട്ട് അതിനെ ഉണങ്ങിക്കരിഞ്ഞ ചവറാക്കി തീര്‍ത്തവനുമായ (രക്ഷിതാവിന്‍റെ നാമം)",
            "verse 87:6": "നിനക്ക് നാം ഓതിത്തരാം. നീ മറന്നുപോകുകയില്ല.",
            "verse 87:7": "അല്ലാഹു ഉദ്ദേശിച്ചതൊഴികെ. തീര്‍ച്ചയായും അവന്‍ പരസ്യമായതും, രഹസ്യമായിരിക്കുന്നതും അറിയുന്നു.",
            "verse 87:8": "കൂടുതല്‍ എളുപ്പമുള്ളതിലേക്ക് നിനക്ക് നാം സൌകര്യമുണ്ടാക്കിത്തരുന്നതുമാണ്‌.",
            "verse 87:9": "അതിനാല്‍ ഉപദേശം ഫലപ്പെടുന്നുവെങ്കില്‍ നീ ഉപദേശിച്ചു കൊള്ളുക.",
            "verse 87:10": "ഭയപ്പെടുന്നവര്‍ ഉപദേശം സ്വീകരിച്ചു കൊള്ളുന്നതാണ്‌.",
            "verse 87:11": "ഏറ്റവും നിര്‍ഭാഗ്യവാനായിട്ടുള്ളവന്‍ അതിനെ (ഉപദേശത്തെ) വിട്ടകന്നു പോകുന്നതാണ്‌.",
            "verse 87:12": "വലിയ അഗ്നിയില്‍ കടന്ന് എരിയുന്നവനത്രെ അവന്‍",
            "verse 87:13": "പിന്നീട് അവന്‍ അതില്‍ മരിക്കുകയില്ല. ജീവിക്കുകയുമില്ല.",
            "verse 87:14": "തീര്‍ച്ചയായും പരിശുദ്ധി നേടിയവര്‍ വിജയം പ്രാപിച്ചു.",
            "verse 87:15": "തന്‍റെ രക്ഷിതാവിന്‍റെ നാമം സ്മരിക്കുകയും എന്നിട്ട് നമസ്കരിക്കുകയും (ചെയ്തവന്‍)",
            "verse 87:16": "പക്ഷെ, നിങ്ങള്‍ ഐഹികജീവിതത്തിന്ന് കൂടുതല്‍ പ്രാധാന്യം നല്‍കുന്നു.",
            "verse 87:17": "പരലോകമാകുന്നു ഏറ്റവും ഉത്തമവും നിലനില്‍ക്കുന്നതും.",
            "verse 87:18": "തീര്‍ച്ചയായും ഇത് ആദ്യത്തെ ഏടുകളില്‍ തന്നെയുണ്ട്‌.",
            "verse 87:19": "അതായത് ഇബ്രാഹീമിന്‍റെയും മൂസായുടെയും ഏടുകളില്‍."
        },
        "Norwegian": {
            "verse 87:1": "Pris Herrens navn, den Høyeste,",
            "verse 87:2": "som skapte og formet,",
            "verse 87:3": "bestemte og ledet,",
            "verse 87:4": "som frembrakte beitemarker",
            "verse 87:5": "og lot dem bli tørre strå!",
            "verse 87:6": "Vi skal la deg forkynne (Koran), og glem så ikke,",
            "verse 87:7": "unntatt det Gud vil. Han kjenner til det som lyder høyt, og det som holdes skjult.",
            "verse 87:8": "Vi skal lette det for deg hen til lettelsen.",
            "verse 87:9": "Så forman, der formaning nytter!",
            "verse 87:10": "Den som frykter, vil vise ettertanke,",
            "verse 87:11": "men den usle vil unngå den,",
            "verse 87:12": "han som skal havne i den store Ild,",
            "verse 87:13": "og der kan han verken dø eller leve.",
            "verse 87:14": "Ham går det godt, som har renset seg,",
            "verse 87:15": "kommer Herrens navn i hu, og forretter bønnen.",
            "verse 87:16": "Nei, dere foretrekker jordelivet,",
            "verse 87:17": "men det hinsidige er bedre, og mer varig.",
            "verse 87:18": "Dette står visselig i de gamle skrifter,",
            "verse 87:19": "på Abrahams og Mose blader."
        },
        "Pashto": {
            "verse 87:1": "ته پاكي بیان كړه د خپل رب د نامې چې تر ټولو اوچت دى",
            "verse 87:2": "هغه چې پیدا يې كړل ټول شيان، پس ښه يې برابر كړل",
            "verse 87:3": "او هغه (رب) چې اندازه يې وكړه، پس لاره يې وښووله",
            "verse 87:4": "او هغه ذات چې تازه ګياه يې را اېستلې ده",
            "verse 87:5": "بيا يې هغه وګرځوله وچه توره",
            "verse 87:6": "ژر ده چې مونږ به په تا باندې (قرآن) ولولو، نو ته به يې نه هېروې",
            "verse 87:7": "مګر هغه چې الله يې وغواړي، بېشكه دغه (الله) په ښكاره و پوهېږي او په هغه څه چې پټ وي",
            "verse 87:8": "او مونږ به تا ته اسانې لارې ته اسانتیا دركوو",
            "verse 87:9": "نو ته نصیحت (پند) كوه كه نصیحت كول نفع رسوي (يا بېشكه نصيحت كول نفع رسوي)",
            "verse 87:10": "ژر ده چې هغه څوك به پند واخلي چې وېرېږي",
            "verse 87:11": "او له دغه (نصیحت) نه به تر ټولو بدبخته ډډه كوي",
            "verse 87:12": "هغه چې تر ټولو لوى اور ته به ننوځي",
            "verse 87:13": "بیا به دى په دغه (اور) كې نه مري او نه به ښه ژوند لري",
            "verse 87:14": "یقینًا هغه څوك كامیاب شو چې پاك شو",
            "verse 87:15": "او د خپل رب نامه يې یاده كړه، پس لمونځ يې وكړ",
            "verse 87:16": "بلكې تاسو (په اخرت باندې) دنيايي ژوند غوره كوئ",
            "verse 87:17": "حال دا چې اخرت ډېر غوره او تل ترتله دى",
            "verse 87:18": "بېشكه دا (خبرې) یقینًا په ړومبنیو صحیفو كې هم دي",
            "verse 87:19": "د ابراهیم او موسی په صحیفو كې"
        },
        "Persian": {
            "verse 87:1": "نام پروردگار بزرگ خويش را به پاكى ياد كن:",
            "verse 87:2": "آن كه آفريد و درست‌اندام آفريد.",
            "verse 87:3": "و آن كه اندازه معين كرد. سپس راه نمود.",
            "verse 87:4": "و آن كه چراگاه‌ها را رويانيد،",
            "verse 87:5": "سپس خشك و سياه گردانيد.",
            "verse 87:6": "زودا كه براى تو بخوانيم، مباد كه فراموش كنى.",
            "verse 87:7": "مگر آنچه خدا بخواهد. اوست كه آشكارا و نهان را مى‌داند.",
            "verse 87:8": "و تو را به كيش آسان توفيق دهيم.",
            "verse 87:9": "اگر پند دادنت سود كند، پند ده.",
            "verse 87:10": "آن كه مى‌ترسد، پند مى‌پذيرد.",
            "verse 87:11": "و بدبخت از آن دورى مى‌گزيند:",
            "verse 87:12": "آن كه به آتش بزرگ جهنم درافتد،",
            "verse 87:13": "و در آنجا نه بميرد و نه زنده باشد.",
            "verse 87:14": "هر آينه پاكان رستگار شدند؛",
            "verse 87:15": "آنان كه نام پروردگار خود را بر زبان آوردند و نماز گزاردند.",
            "verse 87:16": "آرى، شما زندگى اين جهان را بر مى‌گزينيد،",
            "verse 87:17": "حال آنكه آخرت بهتر و پاينده‌تر است.",
            "verse 87:18": "اين سخن در صحيفه‌هاى نخستين است:",
            "verse 87:19": "صحيفه‌هاى ابراهيم و موسى."
        },
        "Polish": {
            "verse 87:1": "Wysławiaj imię twego Pana, Najwyższego,",
            "verse 87:2": "Który stworzył i ukształtował harmonijnie,",
            "verse 87:3": "Który wyznaczył los i poprowadził;",
            "verse 87:4": "To On każe zielenić się pastwisku,",
            "verse 87:5": "A potem czyni je ciemniejącą paszą.",
            "verse 87:6": "My nauczymy cię recytować i ty zapomnisz",
            "verse 87:7": "Tylko to, co Bóg zechce. Przecież Bóg zna to, co jawne i co skryte!",
            "verse 87:8": "I My uczynimy łatwą dla ciebie drogę ku temu, co najpomyślniejsze.",
            "verse 87:9": "Napominaj więc, jeśli napomnienie jest pożyteczne!",
            "verse 87:10": "Opamięta się ten, kto się obawia;",
            "verse 87:11": "A odsunie się od napomnienia najnędzniejszy,",
            "verse 87:12": "Który się będzie palił w ogniu największym,",
            "verse 87:13": "Gdzie ani nie umrze, ani też nie będzie żył.",
            "verse 87:14": "Zaś szczęśliwy będzie ten, kto się oczyści",
            "verse 87:15": "I będzie wspominał imię swego Pana, i modlił się.",
            "verse 87:16": "Lecz wy wolicie życie tego świata,",
            "verse 87:17": "Tymczasem życie ostateczne jest lepsze i bardziej trwałe.",
            "verse 87:18": "Zaprawdę, to jest w dawnych księgach,",
            "verse 87:19": "Księgach Abrahama i Mojżesza!"
        },
        "Portuguese": {
            "verse 87:1": "Glorifica o nome do teu Senhor, o Altíssimo,",
            "verse 87:2": "Que criou e aperfeiçoou tudo;",
            "verse 87:3": "Que tudo predestinou e encaminhou;",
            "verse 87:4": "E que faz brotar o pasto,",
            "verse 87:5": "Que se converte em feno.",
            "verse 87:6": "Ensinar-te-emos a recitar (a Mensagem), para que não esqueças,",
            "verse 87:7": "Senão o que Deus permitir, porque Ele bem conhece o que está manifesto e o que é secreto.",
            "verse 87:8": "E te encaminharemos pela (senda) mais simples.",
            "verse 87:9": "Admoesta, pois, porque a admoestação é proveitosa (para o atento)!",
            "verse 87:10": "Ela guiará aquele que é temente.",
            "verse 87:11": "Porém, o desventurado a evitará;",
            "verse 87:12": "Entrará no fogo maior (o infernal),",
            "verse 87:13": "Onde não morrerá, nem viverá.",
            "verse 87:14": "Bem-aventurado aquele que se purificar,",
            "verse 87:15": "E mencionar o nome do seu Senhor e orar!",
            "verse 87:16": "Entretanto, vós, (ó incrédulos) preferis a vida terrena,",
            "verse 87:17": "Ainda que a outra seja preferível, e mais duradoura!",
            "verse 87:18": "Em verdade, isto se acha nos Livros primitivos,",
            "verse 87:19": "Nos Livros de Abraão e de Moisés."
        },
        "Punjabi": {
            "verse 87:1": "ਆਪਣੇ ਪਾਲਣਹਾਰ ਦੇ ਨਾਮ ਦੀ ਪਵਿੱਤਰਤਾ ਦਾ ਵਰਨਣ ਕਰੋ, ਜਿਹੜਾ ਸਭ ਤੋਂ ਸ੍ਰੇਸ਼ਟ ਹੈ।",
            "verse 87:2": "ਜਿਸ ਨੇ ਪੈਦਾ ਕੀਤਾ ਫਿਰ ਸਵਾਰਿਆ।",
            "verse 87:3": "ਜਿਸ ਨੇ (ਸਮਝ ਦਿੱਤੀ) ਠਹਿਰਾਇਆ ਅਤੇ ਫਿਰ ਰਾਹ ਵਿਖਾਇਆ।",
            "verse 87:4": "ਜਿਸ ਨੇ ਘਾਹ (ਚਾਰਾ) ਪੈਦਾ ਕੀਤਾ।",
            "verse 87:5": "ਫਿਰ ਉਸ ਨੂੰ ਕਾਲੇ ਰੰਗ ਦਾ ਕੂੜਾ ਬਣਾ ਦਿੱਤਾ।",
            "verse 87:6": "ਅਸੀਂ ਤੁਹਾਨੂੰ ਪੜ੍ਹਾਵਾਂਗੇ, ਫਿਰ ਤੁਸੀਂ ਨਹੀਂ ਭੁਲੋਗੇ।",
            "verse 87:7": "ਪਰੰਤੂ ਜੋ ਅੱਲਾਹ ਚਾਹੇ, ਉਹ ਜਾਣਦਾ ਹੈ, ` ਗੁੱਝੀਆਂ ਵੀ ਅਤੇ ਪ੍ਰਗਟ ਵੀ।",
            "verse 87:8": "ਅਤੇ ਅਸੀਂ ਤੁਹਾਨੂੰ ਸੌਖੇ ਰਾਹ ਤੇ ਲੈ ਚਲਾਂਗੇ।",
            "verse 87:9": "ਤਾਂ ਸਿੱਖਿਆ ਦੇਵੇਂ, ਜੇਕਰ ਸਿੱਖਿਆ ਲਾਭ ਦੇਵੇ।",
            "verse 87:10": "ਉਹ ਬੰਦਾ ਉਪਦੇਸ਼ ਸਵੀਕਾਰ ਕਰੇਗਾ ਜਿਹੜਾ ਡਰਦਾ ਹੈ।",
            "verse 87:11": "ਉਹ ਜਿਹੜਾ ਅਭਾਗਾ ਹੋਵੇਗਾ, ਉਸ ਤੋਂ ਮੂੰਹ ਮੋੜੇਗਾ।",
            "verse 87:12": "ਉਹ ਵੱਡੀ ਅੱਗ ਵਿਚ ਡਿੱਗੇਗਾ।",
            "verse 87:13": "ਉਹ ਨਾ ਉਸ ਵਿਚ ਮਰੇਗਾ ਅਤੇ ਨਾਂ ਜਿਉਂਦਾ ਰਹੇਗਾ।",
            "verse 87:14": "ਉਹ ਸਫ਼ਲ ਹੋਇਆ ਜਿਸ ਨੇ ਆਪਣੇ ਆਪ ਨੂੰ ਪਵਿੱਤਰ ਕੀਤਾ।",
            "verse 87:15": "ਅਤੇ ਅਪਣੇ ਰੱਬ ਦਾ ਨਾਮ ਲਿਆ, ਫਿਰ ਨਮਾਜ਼ ਪੜ੍ਹੀ।",
            "verse 87:16": "ਸਗੋਂ ਤੁਸੀਂ ਢੁਨਿਆਵੀ ਜੀਵਨ ਨੂੰ ਅਹਮੀਅਤ ਦਿੰਦੇ ਹੋ।",
            "verse 87:17": "ਅਤੇ ਪ੍ਰਲੋਕ ਬਿਹਤਰ ਹੈ ਅਤੇ ਸਥਾਈ ਹੈ।",
            "verse 87:18": "ਇਹ ਪਹਿਲੇ ਸਹੀਫ਼ਿਆਂ (ਗ੍ਰੰਥਾਂ? ਵਿਚ ਵੀ ਹੈ।)",
            "verse 87:19": "ਮੂਸਾ ਅਤੇ ਇਬਰਾਹੀਮ ਦੇ ਸਹੀਫ਼ਿਆਂ ਵਿਚ।"
        },
        "Roman english": {
            "verse 87:1": "Sabbihisma Rabbikal A`laa",
            "verse 87:2": "Allazee khalaqa fasawwaa",
            "verse 87:3": "Wallazee qaddara fahadaa",
            "verse 87:4": "Wallazeee akhrajal mar`aa",
            "verse 87:5": "Faja`alahoo ghusaaa`an ahwaa",
            "verse 87:6": "Sanuqri`uka falaa tansaaa",
            "verse 87:7": "Illaa maa shaaa`al laah; innahoo ya`lamul jahra wa maa yakhfaa",
            "verse 87:8": "Wa nu-yassiruka lilyusraa",
            "verse 87:9": "Fazakkir in nafa`atizzikraa",
            "verse 87:10": "Sa yazzakkaru maiyakhshaa",
            "verse 87:11": "Wa yatajannabuhal ashqaa",
            "verse 87:12": "Allazee yaslan Naaral kubraa",
            "verse 87:13": "Summa laa yamootu feehaa wa laa yahyaa",
            "verse 87:14": "Qad aflaha man tazakkaa",
            "verse 87:15": "Wa zakaras ma Rabbihee fasallaa",
            "verse 87:16": "Bal tu`siroonal hayaatad dunyaa",
            "verse 87:17": "Wal Aakhiratu khairunw wa abqaa",
            "verse 87:18": "Inna haazaa lafis suhu fil oolaa",
            "verse 87:19": "Suhufi Ibraaheema wa Moosaa"
        },
        "Russian": {
            "verse 87:1": "Восславь же имя Бога твоего - Всевышнего (Хранителя и Властелина),",
            "verse 87:2": "Кто сотворил и соразмерил,",
            "verse 87:3": "Распределил (пути) и все направил,",
            "verse 87:4": "Кто повелел произрасти лугам,",
            "verse 87:5": "Чтобы потом их в темное жнивье повергнуть.",
            "verse 87:6": "Тебе, (о Мухаммад!), дадим Мы прочитать (Коран), И будет не дано тебе его забыть,",
            "verse 87:7": "Опричь того, что Сам Аллах Себе позволит, - Он знает все, что явно и сокрыто!",
            "verse 87:8": "Мы облегчим тебе дороги Наши,",
            "verse 87:9": "И потому увещевай ты тех, Кто (слушает и) пользу извлекает.",
            "verse 87:10": "И увещанье это примет тот, Кто гнева Господа страшится,",
            "verse 87:11": "А отрекутся от него лишь те несчастные,",
            "verse 87:12": "Которые войдут в Огонь великий,",
            "verse 87:13": "И там им предстоит ни жить, ни умереть.",
            "verse 87:14": "Восторжествуют те, кто чистоту блюдет,",
            "verse 87:15": "Кто поминает имя своего Владыки и лишь Ему несет свои молитвы.",
            "verse 87:16": "Увы! Вы жизни ближней отдаете предпочтенье,",
            "verse 87:17": "Хотя последняя - и краше, и длиннее.",
            "verse 87:18": "Поистине, все это - в ранних Книгах (откровений) -",
            "verse 87:19": "В Писаниях (пророка) Ибрахима и (пророка) Мусы!"
        },
        "Sindhi": {
            "verse 87:1": "(اي پيغمبر) اُنھي پنھنجي تمام مٿاھين پالڻھار جي نالي جي پاڪائي بيان ڪر.",
            "verse 87:2": "جنھن (ساري مخلوق کي) خلقيو پوءِ سنئين لڱين ڪيائين.",
            "verse 87:3": "۽ جنھن اندازو ڪيو پوءِ رستو ڏيکاريائين.",
            "verse 87:4": "۽ جنھن تازو گاھ ڄمايو.",
            "verse 87:5": "پوءِ اُن کي سُڪو سڙيو ڪيائين.",
            "verse 87:6": "اسين توکي (قرآن) پاڙھينداسون پوءِ نه وساريندين.",
            "verse 87:7": "مگر جيڪي الله گھريو آھي، بيشڪ اُھو ظاھر کي ڄاڻندو آھي ۽ جيڪي ڳُجھو آھي تنھن کي (به).",
            "verse 87:8": "۽ آسان رستو توکي سنھنجو ڪري ڏينداسين.",
            "verse 87:9": "پوءِ جيڪڏھن نصيحت ڏئڻ فائدو ڪري ته نصيحت ڪر.",
            "verse 87:10": "جيڪو ڊڄندو سو سُتت سمجھ وٺندو.",
            "verse 87:11": "۽ اُن (نصيحت وٺڻ) کان (اُھو) تمام نڀاڳو پاسو ڪندو.",
            "verse 87:12": "جو وڏيءَ باھ ۾ پوندو.",
            "verse 87:13": "وري نڪي اُتي مرندو ۽ نڪي جيئرو رھندو.",
            "verse 87:14": "بيشڪ اُھو ڇٽو جيڪو سڌريو.",
            "verse 87:15": "۽ پڻ پنھنجي پالڻھار جو نالو ياد ڪري نماز پڙھندو رھيو.",
            "verse 87:16": "بلڪ دُنيا جي حياتيءَ کي (آخرت کان) پسند ڪندا آھيو.",
            "verse 87:17": "۽ (حقيقت ڪري) آخرت ڀَلي آھي ۽ ھميشه رھڻ واري آھي.",
            "verse 87:18": "بيشڪ ھيءَ (بيان) پھرين صحيفن ۾ (به لکيل) آھي.",
            "verse 87:19": "جي صحيفا ابراھيم ۽ مُوسىٰ جا آھن."
        },
        "Sinhalese": {
            "verse 87:1": "නුඹගේ උත්කෘෂ්ට පරමාධිපතිගේ නාමය පිවිතුරු කරනු.",
            "verse 87:2": "ඔහු (සියල්ල) මවා නිසි ලෙස සකස් කළේය.",
            "verse 87:3": "තවද ඔහු(සියල්ල) නිර්ණය කර මඟ ද පෙන් වූයේය.",
            "verse 87:4": "තවද උලා කන තණ බිම් පිට කළේ ඔහුය.",
            "verse 87:5": "පසු ව එය (වියැළුණු) කළු පැහැති ඉපැනලි බවට පත් කළේය.",
            "verse 87:6": "අපි ඔබට (අල්කුර්ආනය) මතුවට කියවා පෙන්වන්නෙමු. එබැවින් නුඹ එය අමතක නොකරනු ඇත.",
            "verse 87:7": "අල්ලාහ් අභිමත ළ දෑ හැර (වෙනත් කිසිවක් අමතක නොකරනු ඇත.) සැබැවින්ම ඔහු ප්‍රකට දෑ ද සැඟවුණු දෑ ද දනී.",
            "verse 87:8": "තවද අපි පහසු ව වෙත නුඹට පහසු කරවන්නෙමු.",
            "verse 87:9": "එබැවින් සිහිපත් කිරීම ප්‍රයෝජනවත් වේ නම් නුඹ උපදෙස් දෙනු.",
            "verse 87:10": "කවරෙකු (අල්ලාහ්ට) බිය වන්නේ ද ඔහු උපදෙස් ලබනු ඇත.",
            "verse 87:11": "තවද අභාග්‍යවන්තයා එයින් වැළකෙනු ඇත.",
            "verse 87:12": "ඔහු (නිරයේ) මහත් ගින්නට පිවිසෙයි.",
            "verse 87:13": "පසු ව ඔහු එහි මරණයට පත් නොවෙයි. ජීවත් ද නොවෙයි.",
            "verse 87:14": "සැබැවින්ම (උපදෙසින්) පිවිතුරු කර ගත් අය ජයග්‍රහණය කළේය.",
            "verse 87:15": "තවද ඔහු තම පරමාධිපතිගේ නාමය සිහිපත් තවද ඔහු තම පරමාධිපතිගේ නාමය සිහිපත් කර පසු ව සලාතය ද ඉටු කළේය.කර පසු ව සලාතය ද ඉටු කළේය.",
            "verse 87:16": "නමුත් නුඹලා මෙලොව ජීවිතය තෝරා ගන්නෙහුය.",
            "verse 87:17": "(මෙලොව ජීවිතයට වඩා) මතු ලොව උතුම් ය. තවද සදා පවතින්නකි.",
            "verse 87:18": "සත්‍ය වශයෙන්ම මෙය පූර්ව ලේඛනයන්හි (සඳහන් ව) ඇත.",
            "verse 87:19": "ඉබ්රාහීම් හා මූසාගේ ලේඛනයන්හි."
        },
        "Somali": {
            "verse 87:1": "Waynee Magaca Eebe ee Sarreeya.",
            "verse 87:2": "Eebaha abuuray khalqiga ekeeyayna.",
            "verse 87:3": "Eebaha wax walba qaddaray Jidkana tusiyey.",
            "verse 87:4": "Eebaha soo bixiya Daaqa.",
            "verse 87:5": "Kana dhiga markaas ka dib caws ingagagan oo Madow.",
            "verse 87:6": "Waxaan kuu akhriyaynaa Quraanka halmaaminamaysid.",
            "verse 87:7": "Wuxuu Eebe doono mooyee, Eebana waa ogyahay waxa muuqda iyo waxa qarsoonba.",
            "verse 87:8": "Waxaana kuu fududaynhaynaa Waddo fiican.",
            "verse 87:9": "Ee wax waani (Nabiyow) markay wax tari waanadu.",
            "verse 87:10": "Waxaa waantoobi Ruuxa Eebe ka yaabee.",
            "verse 87:11": "Waxaana ka fogaan waanada Ruuxa xune.",
            "verse 87:12": "Ee ah mid gali Naar wayn.",
            "verse 87:13": "Oon kuna dhimanayn dhexdeeda kuna noolanayn.",
            "verse 87:14": "Waxaana liibaanay Ruuxii Daahir noqda.",
            "verse 87:15": "magaca Eebana Xusa, Salaaddana tukada.",
            "verse 87:16": "Saas ma'aha ee Dadku wuxuu doortay nolosha Adduunyo ee dhaw.",
            "verse 87:17": "Aakhiraase khayr badan baaqina ah (hadhi).",
            "verse 87:18": "Arrintaasuna waxay ku sugantahay Kutubtii hore.",
            "verse 87:19": "Kutubtii (Nabi) Ibraahim iyo (Nabi) Muuse."
        },
        "Spanish": {
            "verse 87:1": "Glorifica el nombre de tu Señor, el Altísimo,",
            "verse 87:2": "que ha creado y ha conformado,",
            "verse 87:3": "que ha decretado y ha encaminado",
            "verse 87:4": "y que hace crecer el pasto verde",
            "verse 87:5": "y lo convierte en deshecho ennegrecido.",
            "verse 87:6": "Haremos que recites y no olvidarás, excepto lo que Allah quiera.",
            "verse 87:7": "Él conoce lo que se muestra y lo que se esconde.",
            "verse 87:8": "Te haremos propicia la facilidad.",
            "verse 87:9": "Así pues llama al Recuerdo, porque recordar beneficia.",
            "verse 87:10": "Recordará quien sea temeroso",
            "verse 87:11": "y se desentenderá el más miserable,",
            "verse 87:12": "que será arrojado al mayor de los fuegos,",
            "verse 87:13": "donde ni vivirá ni morirá.",
            "verse 87:14": "Habrá triunfado quien se purifique",
            "verse 87:15": "recuerde el nombre de su Señor y rece.",
            "verse 87:16": "Sin embargo preferís la vida de este mundo,",
            "verse 87:17": "cuando la Última es mejor y de mayor permanencia.",
            "verse 87:18": "Realmente esto ya estaba en las primeras escrituras,",
            "verse 87:19": "las páginas de Ibrahim y de Musa."
        },
        "Swahili": {
            "verse 87:1": "Litakase jina la Mola wako Mlezi aliye juu kabisa,",
            "verse 87:2": "Aliye umba, na akaweka sawa,",
            "verse 87:3": "Na ambaye amekadiria na akaongoa,",
            "verse 87:4": "Na aliye otesha malisho,",
            "verse 87:5": "Kisha akayafanya makavu, meusi.",
            "verse 87:6": "Tutakusomesha wala hutasahau,",
            "verse 87:7": "Ila akipenda Mwenyezi Mungu. Hakika Yeye anayajua yaliyo dhaahiri na yaliyo fichikana.",
            "verse 87:8": "Na tutakusahilishia yawe mepesi.",
            "verse 87:9": "Basi kumbusha, kama kukumbusha kunafaa.",
            "verse 87:10": "Atakumbuka mwenye kuogopa.",
            "verse 87:11": "Na atajitenga mbali nayo mpotovu,",
            "verse 87:12": "Ambaye atauingia Moto mkubwa.",
            "verse 87:13": "Tena humo hatakufa wala hawi hai.",
            "verse 87:14": "Hakika amekwisha fanikiwa aliye jitakasa.",
            "verse 87:15": "Na akakumbuka jina la Mola wake Mlezi, na akasali.",
            "verse 87:16": "Lakini nyinyi mnakhiari maisha ya dunia!",
            "verse 87:17": "Na Akhera ni bora na yenye kudumu zaidi.",
            "verse 87:18": "Hakika haya yamo katika Vitabu vya mwanzo,",
            "verse 87:19": "Vitabu vya Ibrahimu na Musa."
        },
        "Swedish": {
            "verse 87:1": "PRISA din Herres, den Högstes, namn!",
            "verse 87:2": "Han som skapar [allt] och därefter formar det [med hänsyn till den uppgift som det skall fylla],",
            "verse 87:3": "och som ger [människan] hennes rätta mått och därefter leder henne på rätt väg,",
            "verse 87:4": "och som låter betesmarkernas gräs växa",
            "verse 87:5": "för att sedan vissna och svartna.",
            "verse 87:6": "VI SKALL lära dig att läsa och du kommer inte att glömma något",
            "verse 87:7": "utom det som Gud vill [att du skall glömma]; Han vet vad [människorna] öppet tillkännager likaväl som det som [de vill] dölja.",
            "verse 87:8": "Och Vi skall göra det lätt för dig [att följa religionens bud].",
            "verse 87:9": "PÅMINN nu [människorna, Muhammad] - kanske skall påminnelsen vara [dem] till nytta;",
            "verse 87:10": "den som står i bävan [inför Gud] kommer att lägga den på minnet",
            "verse 87:11": "och [bara] den olycklige stackare kommer att vända ryggen till",
            "verse 87:12": "som blir lågornas rov i den stora Elden,",
            "verse 87:13": "där han varken kan dö eller leva.",
            "verse 87:14": "Den skall det gå väl i händer som [under sitt liv] strävar efter renhet",
            "verse 87:15": "och åkallar sin Herres namn och förrättar sin bön.",
            "verse 87:16": "Men ni [människor] sätter det jordiska livet före allt annat,",
            "verse 87:17": "trots att det kommande livet är bättre och varar i evighet.",
            "verse 87:18": "[Allt] detta har helt visst redan [sagts] i de tidigare uppenbarelserna,",
            "verse 87:19": "i Abrahams och Moses uppenbarelser."
        },
        "Tajik": {
            "verse 87:1": "Номи Парвардигори бузурги худро ба покӣ ёд кун,",
            "verse 87:2": "он ки офарид ва дурустандом кард,",
            "verse 87:3": "Ва он ки андоза муъайян кард. Сипас роҳ намуд.",
            "verse 87:4": "Ва он ки чарогоҳҳоро рӯёнид,",
            "verse 87:5": "сипас хушку сиёҳ гардонид.",
            "verse 87:6": "Ба зудӣ барои ту бихонем, мабод, ки фаромӯш кунӣ.",
            "verse 87:7": "ғайри он чи Худо бихоҳад. Ӯст, ки ошкорову ниҳонро медонад.",
            "verse 87:8": "Ва туро ба дини осон тавфиқ диҳем.",
            "verse 87:9": "Агар панд, доданат суд кунад, панд деҳ.",
            "verse 87:10": "Он ки метарсад, панд мегирад.",
            "verse 87:11": "Ва бадбахт аз он дурӣ мегирад,",
            "verse 87:12": "он ки ба оташи бузурги ҷаҳаннам дарафтад",
            "verse 87:13": "ва дар он ҷо на бимирад ва на зинда бошад.",
            "verse 87:14": "Албатта покон наҷот ёфтанд,",
            "verse 87:15": "онон, ки номи Парвардигори худро бар забон оварданд ва намоз гузориданд.",
            "verse 87:16": "Оре, шумо зиндагии ин ҷаҳонро ихтиёр мекунед,",
            "verse 87:17": "ҳол он ки охират беҳтару пояндатар аст.",
            "verse 87:18": "Ин сухан дар саҳифаҳои нахустин аст,",
            "verse 87:19": "саҳифаҳои Иброҳиму Мӯсо!"
        },
        "Tamil": {
            "verse 87:1": "(நபியே!) மிக்க மேலானவனான உம்முடைய இறைவனின் திருநாமத்தை(த் தியானித்து) தஸ்பீஹு செய்வீராக.",
            "verse 87:2": "அவனே (யாவற்றையும்) படைத்துச் செவ்வையாக்கினான்.",
            "verse 87:3": "மேலும், அவனே (அவற்றுக்கு வேண்டிய அனைத்தையும்) அளவுபட நிர்ணயித்து (அவற்றைப் பெறுவதற்கு) நேர்வழி காட்டினான்.",
            "verse 87:4": "அன்றியும் அவனே (கால் நடைகளுக்கென) மேய்ச்சலுக்குரியவற்றையும் வெளியாக்கினான்.",
            "verse 87:5": "பின்னர் அவற்றை உலர்ந்த கூளங்களாக ஆக்கினான்.",
            "verse 87:6": "(நபியே!) நாம் உமக்கு ஓதக்கற்றுக் கொடுப்போம்; அதனால் நீர் அதை மறக்கமாட்டீர்-",
            "verse 87:7": "அல்லாஹ் நாடியதை அல்லாமல் - நிச்சயமாக, அவன் வெளிப்படையானதையும் மறைந்திருப்பதையும் அறிகிறான்.",
            "verse 87:8": "அன்றியும், இலேசான (மார்க்கத்)தை நாம் உமக்கு எளிதாக்குவோம்.",
            "verse 87:9": "ஆகவே, நல்லுபதேசம் பயனளிக்குமாயின், நீர் உபதேசம் செய்வீராக.",
            "verse 87:10": "(அல்லாஹ்வுக்கு) அஞ்சுபவன் விரைவில் உபதேசத்தை ஏற்பான்.",
            "verse 87:11": "ஆனால் துர்பாக்கியமுடையவனோ, அதை விட்டு விலகிக் கொள்வான்.",
            "verse 87:12": "அவன் தான் பெரும் நெருப்பில் புகுவான்.",
            "verse 87:13": "பின்னர், அதில் அவன் மரிக்கவும் மாட்டான்; வாழவும் மாட்டான்.",
            "verse 87:14": "தூய்மையடைந்தவன், திட்டமாக வெற்றி பெறுகிறான்.",
            "verse 87:15": "மேலும், அவன் தன் இறைவனுடைய நாமத்தைத் துதித்துக் கொண்டும், தொழுது கொண்டும் இருப்பான்.",
            "verse 87:16": "எனினும், நீங்களோ (மறுமையை விட்டு விட்டு) இவ்வுலக வாழ்வைத் தேர்ந்தெடுத்துக் கொள்கிறீர்கள்.",
            "verse 87:17": "ஆனால் மறுமை (வாழ்க்கை)யோ சிறந்ததாகும்; என்றும் நிலைத்திருப்பதும் ஆகும்.",
            "verse 87:18": "நிச்யசமாக இது முந்திய ஆகமங்களிலும்-",
            "verse 87:19": "இப்றாஹீம், மூஸாவினுடைய ஆகமங்களிலும் (இவ்வாறே அறிவிப்பு) இருக்கிறது."
        },
        "Tatar": {
            "verse 87:1": "Барча кимчелекләрдән пакь булган Раббыңның исеме илә тәсбихләр әйткел, намаз укыгыл.",
            "verse 87:2": "Ул – Аллаһ барча вөҗудне халык кылды, һәр нәрсәне кагыйдәгә муафыйк төзеп тәмам итте.",
            "verse 87:3": "Вә Ул һәрнәрсәгә тәкъдир төзеде вә һәрнәрсәне юлга салды.",
            "verse 87:4": "Вә Ул хайваннар өчен үләннәр үстерде.",
            "verse 87:5": "Ул үләннәрне көзге көннәрдә кипкән сары кау кылды.",
            "verse 87:6": "Тиздән укырбыз сиңа Коръән аятьләрен һәм син онытмассың.",
            "verse 87:7": "Мәгәр Аллаһ теләгәнне генә онытырсың, әлбәттә, Ул яшерен эшләнгән эшләрне дә һәм әшкәрә эшләнгән эшләрне дә беләдер.",
            "verse 87:8": "Вә Без сине җиңеллеккә мүйәссәр кылырбыз, ягъни җәннәтнең мәңгелек җиңел тормышына алып бара торган шәригать хөкемнәрен сиңа бирербез.",
            "verse 87:9": "Кешеләрне Коръән белән вәгәзьлә, әгәр аларга вәгазь файда бирә торган булса.",
            "verse 87:10": "Аллаһудан курыккан кеше тиз вәгазьләнер һәм ишеткән белән гамәл кылыр.",
            "verse 87:11": "Вә Коръән вәгазеннән качар һич кабул итмәс, бик явыз яман кеше.",
            "verse 87:12": "Ул явыз кеше олугъ җәһәннәмгә керер.",
            "verse 87:13": "Соңра ул җәһәннәмдә үлмәс, үлсә ґәзабтан котылыр иде һәм файда күрә торган тере булу белән тере булмас.",
            "verse 87:14": "Мөшриклектән вә монафикълыктан, рия вә бидеґәт гамәлләрдән, фәхеш вә хәрам эшләрдән үзен пакьләгән һәм сакланган кеше, тәхкыйк ґәзабтан котылып өстенлек тапты.",
            "verse 87:15": "Вә ул кеше Раббысын зекер итеп намаз укыды.",
            "verse 87:16": "Ий кешеләр бәлки сез дөнья тереклеген ихтыяр кыласыз, барча көчегезне дөнья өчен генә сарыф итәсез.",
            "verse 87:17": "Бит ахирәт дөньядан яхшырактыр һәм мәңгелектер.",
            "verse 87:18": "Тәхкыйк бу сүзләр әүвәлге пәйгамбәрләрнең сәхифәләрендә зекер ителгәндер.",
            "verse 87:19": "Ул сәхифәләр Ибраһим вә Муса г-м сәхифәләредер."
        },
        "Telugu": {
            "verse 87:1": "అత్యున్నతుడైన నీ ప్రభువు నామాన్ని స్తుతించు",
            "verse 87:2": "ఆయనే (ప్రతిదానిని) సృష్టించాడు మరియు తగిన ప్రమాణంలో రూపొందించాడు",
            "verse 87:3": "మరియు ఆయనే దాని ప్రకృతి లక్షణాలను నిర్ణయించాడు, మరియు మార్గం చూపాడు",
            "verse 87:4": "మరియు ఆయనే పచ్చికను మొలిపింప జేశాడు",
            "verse 87:5": "మరల దానిని నల్లని చెత్తాచెదారంగా చేశాడు",
            "verse 87:6": "మేము నీచేత (ఖుర్ఆన్ ను) చదివింప జేస్తాము, తరువాత నీవు (దానిని) మరచిపోవు",
            "verse 87:7": "అల్లాహ్ కోరింది తప్ప! నిశ్చయంగా, బహిరంగంగా ఉన్నదీ మరియు గోప్యంగా ఉన్నదీ అన్నీ ఆయనకు బాగా తెలుసు",
            "verse 87:8": "మరియు మేము నీ మార్గాన్ని సులభం చేయడానికి నీకు సౌలభ్యాన్ని కలుగజేస్తాము",
            "verse 87:9": "కావున నీవు హితోపదేశం చేస్తూ ఉండు; వారికి హితోపదేశం లాభదాయకం కావచ్చు",
            "verse 87:10": "(అల్లాహ్ కు) భయపడే వాడు హితోపదేశాన్ని స్వీకరిస్తాడు",
            "verse 87:11": "మరియు దౌర్భాగ్యుడు దానికి దూరమై పోతాడు",
            "verse 87:12": "అలాంటి వాడే ఘోరమైన నరకాగ్నిలో పడి కాలుతాడు",
            "verse 87:13": "అప్పుడు, అతడు అందులో చావనూ లేడు, బ్రతకనూ లేడు",
            "verse 87:14": "సుశీలతను (పవిత్రతను) పాటించే వాడు తప్పక సాఫల్యం పొందుతాడు",
            "verse 87:15": "మరియు తన ప్రభువు నామాన్ని స్మరిస్తూ, నమాజ్ చేస్తూ ఉండేవాడు",
            "verse 87:16": "అలా కాదు! మీరు ఐహిక జీవితానికి ప్రాధాన్యత నిస్తున్నారు",
            "verse 87:17": "కాని పరలోక జీవితమే మేలైనది మరియు చిరకాలముండేది",
            "verse 87:18": "నిశ్చయంగా, ఈ విషయం పూర్వగ్రంథాలలో (వ్రాయబడి) ఉంది",
            "verse 87:19": "ఇబ్రాహీమ్ మరియు మూసాలపై (అవతరింపజేయబడిన) గ్రంథాలలో"
        },
        "Thai": {
            "verse 87:1": "จงแซ่ซ้องสดุดี พระนามแห่งพระเจ้าของเจ้า ผู้ทรงสูงสุดยิ่ง",
            "verse 87:2": "ผู้ทรงสร้างแล้วทรงทำให้สมบูรณ์",
            "verse 87:3": "และผู้ทรงกำหนดสภาวะแล้วทรงชี้แนะทาง",
            "verse 87:4": "และผู้ทรงนำทุ่งหญ้าออกมา (ให้งอกเงยเป็นอาหารของปศุสัตว์)",
            "verse 87:5": "แล้วทรงทำให้มันซังแห้งสีคล้ำมอซอ",
            "verse 87:6": "เราจะสอนให้เจ้าอ่าน แล้วเจ้าจะไม่ลืม",
            "verse 87:7": "เว้นแต่สิ่งที่อัลลอฮฺทรงประสงค์ แท้จริงพระองค์ทรงรอบรู้สิ่งที่เปิดเผยและสิ่งที่ซ่อนเร้น",
            "verse 87:8": "และเราจะทำให้เป็นการง่ายดายแก่ เจ้าซึ่งบัญญัติศาสนาอันง่ายดาย",
            "verse 87:9": "ดังนั้นจงตักเตือนกันเถิด เพราะการตักเตือนกันนั้นจะยังคุณประโยชน์",
            "verse 87:10": "ผู้ที่หวั่นกลัวจะได้รำลึก",
            "verse 87:11": "และผู้ที่ชั่วช้ายิ่งจะหลีกเลี่ยงการตักเตือนนั้น",
            "verse 87:12": "ซึ่งเขาจะเข้าไปเผาไหม้ในไฟกองใหญ่",
            "verse 87:13": "แล้วเขาจะไม่ตายในนั้นและจะไม่เป็นด้วย",
            "verse 87:14": "แน่นอนผู้ที่ขัดเกลาตนเอง ย่อมบรรลุความสำเร็จ",
            "verse 87:15": "และเขารำลึกถึงพระนามแห่งพระเจ้าของเขา แล้วเขาทำละหมาด",
            "verse 87:16": "หามิได้ แต่พวกเจ้าเลือกเอาการมีชีวิตอยู่ในโลกนี้ต่างหาก",
            "verse 87:17": "ทั้ง ๆ ที่ปรโลกนั้นดีกว่าและจีรังกว่า",
            "verse 87:18": "แท้จริง (ข้อตักเตือนสติ) นี้มีอยู่ในคัมภีร์ก่อน ๆ มาแล้ว",
            "verse 87:19": "คือคัมภีร์ของอิบรอฮีมและมูซา"
        },
        "Turkish": {
            "verse 87:1": "Yüce Rabbinin adını tesbih et.",
            "verse 87:2": "O, yaratıp şekil vermiştir.",
            "verse 87:3": "O, her şeyi ölçüyle yapıp doğru yolu göstermiştir.",
            "verse 87:4": "O, yeşillikler bitirmiştir.",
            "verse 87:5": "Sonra da onları siyah çerçöpe çevirmiştir.",
            "verse 87:6": "Sana Kuran'ı Biz okutacağız ve asla unutmayacaksın;",
            "verse 87:7": "Allah'ın dilediği bundan müstesnadır. Doğrusu açığı da, gizliyi de bilen O'dur.",
            "verse 87:8": "Kolay olanı yapmayı sana kolaylaştırırız.",
            "verse 87:9": "Faydalı olacaksa insanlara öğüt ver.",
            "verse 87:10": "Allah'tan korkan öğüt alacaktır.",
            "verse 87:11": "Bedbaht olan ondan kaçınacaktır.",
            "verse 87:12": "O, en büyük ateşe yaslanacaktır.",
            "verse 87:13": "O, orada ne ölecektir ne de dirilecektir.",
            "verse 87:14": "Arınmış olan, Rabbinin adını anıp namaz kılan, saadete erişecektir.",
            "verse 87:15": "Arınmış olan, Rabbinin adını anıp namaz kılan, saadete erişecektir.",
            "verse 87:16": "Ama sizler dünya hayatını tercih ediyorsunuz.",
            "verse 87:17": "Oysa ahiret daha iyi ve daha bakidir.",
            "verse 87:18": "Doğrusu bu hükümler ilk sahifelerde, İbrahim ve Musa'nın sahifelerinde de vardır.",
            "verse 87:19": "Doğrusu bu hükümler ilk sahifelerde, İbrahim ve Musa'nın sahifelerinde de vardır."
        },
        "Urdu": {
            "verse 87:1": "(اے پیغمبر) اپنے پروردگار جلیل الشان کے نام کی تسبیح کرو",
            "verse 87:2": "جس نے (انسان کو) بنایا پھر (اس کے اعضاء کو) درست کیا",
            "verse 87:3": "اور جس نے (اس کا) اندازہ ٹہرایا (پھر اس کو) رستہ بتایا",
            "verse 87:4": "اور جس نے چارہ اگایا",
            "verse 87:5": "پھر اس کو سیاہ رنگ کا کوڑا کر دیا",
            "verse 87:6": "ہم تمہیں پڑھا دیں گے کہ تم فراموش نہ کرو گے",
            "verse 87:7": "مگر جو خدا چاہے۔ وہ کھلی بات کو بھی جانتا ہے اور چھپی کو بھی",
            "verse 87:8": "ہم تم کو آسان طریقے کی توفیق دیں گے",
            "verse 87:9": "سو جہاں تک نصیحت (کے) نافع (ہونے کی امید) ہو نصیحت کرتے رہو",
            "verse 87:10": "جو خوف رکھتا ہے وہ تو نصیحت پکڑے گا",
            "verse 87:11": "اور (بےخوف) بدبخت پہلو تہی کرے گا",
            "verse 87:12": "جو (قیامت کو) بڑی (تیز) آگ میں داخل ہو گا",
            "verse 87:13": "پھر وہاں نہ مرے گا اور نہ جئے گا",
            "verse 87:14": "بے شک وہ مراد کو پہنچ گیا جو پاک ہوا",
            "verse 87:15": "اور اپنے پروردگار کے نام کا ذکر کرتا رہا اور نماز پڑھتا رہا",
            "verse 87:16": "مگر تم لوگ تو دنیا کی زندگی کو اختیار کرتے ہو",
            "verse 87:17": "حالانکہ آخرت بہت بہتر اور پائندہ تر ہے",
            "verse 87:18": "یہ بات پہلے صحیفوں میں (مرقوم) ہے",
            "verse 87:19": "(یعنی) ابراہیم اور موسیٰ کے صحیفوں میں"
        },
        "Uyghur": {
            "verse 87:1": "ھەممىدىن ئۈستۈن پەرۋەردىگارىڭنىڭ نامىنى پاك ئېتىقاد قىلغىن",
            "verse 87:2": "ئۇ (پۈتۈن مەخلۇقاتنى) ياراتتى، (ئۇلارنى) بېجىرىم (يەنى چىرايلىق ۋە مۇناسىپ شەكىلدە) قىلدى",
            "verse 87:3": "مەخلۇقاتقا پايدىلىق ئىشلارنى (تەقدىر قىلدى، ئۇلارغا پايدىلىنىش يوللىرىنى) كۆرسەتتى",
            "verse 87:4": "ئوت - چۆپلەرنى ئۆستۈرۈپ بەردى",
            "verse 87:5": "ئاندىن ئۇلارنى قارامتۇل قۇرۇق ئوت - خەسكە ئايلاندۇردى",
            "verse 87:6": "(ئى مۇھەممەد!) ساڭا (قۇرئاننى) ئوقۇتىمىز، اﷲ (نەسخى) قىلماقچى بولغان نەرسىدىن باشقىنى ئۇنتۇمايسەن. اﷲ (بەندىلەرنىڭ) ئاشكارا ۋە يوشۇرۇن (سۆز - ھەرىكەتلىرىنى) بىلىپ تۇرىدۇ",
            "verse 87:7": "(ئى مۇھەممەد!) ساڭا (قۇرئاننى) ئوقۇتىمىز، اﷲ (نەسخى) قىلماقچى بولغان نەرسىدىن باشقىنى ئۇنتۇمايسەن. اﷲ (بەندىلەرنىڭ) ئاشكارا ۋە يوشۇرۇن (سۆز - ھەرىكەتلىرىنى) بىلىپ تۇرىدۇ",
            "verse 87:8": "سېنى بىز ئاسان يولغا (يەنى ئىسلام شەرىئىتىگە) مۇۋەپپەق قىلىمىز",
            "verse 87:9": "ۋەز - نەسىھەت پايدىلىق بولىدىغان بولسا، (كىشىلەرگە قۇرئان بىلەن) ۋەز - نەسىھەت قىلغىن",
            "verse 87:10": "اﷲ تىن (قورققان) ئادەم ۋەز - نەسىھەتنى قوبۇل قىلىدۇ",
            "verse 87:11": "ئەڭ شەقى ئادەم ۋەز - نەسىھەتتىن قاچىدۇ",
            "verse 87:12": "ئۇ كاتتا ئوتقا (يەنى دوزاخقا) كىرىدۇ",
            "verse 87:13": "ئاندىن ئۇ ئوتتا ئۆلمەيدۇ ۋە (ئوبدان) ياشىمايدۇ",
            "verse 87:14": "(كۇفرىدىن ۋە گۇناھتىن) پاك بولغان ئادەم مەقسىتىگە يەتتى",
            "verse 87:15": "ئۇ پەرۋەردىگارىنىڭ نامىنى ياد ئەتتى، ئاندىن ناماز ئوقۇدى",
            "verse 87:16": "سىلەر دۇنيا تىرىكچىلىكىنى ئارتۇق كۆرىسىلەر",
            "verse 87:17": "ئاخىرەت ياخشىدۇر ۋە باقىيدۇر",
            "verse 87:18": "بۇ (يەنى بۇ سۈرىدىكى ۋەزلەر) شەك - شۈبھىسىز بۇرۇنقى كىتابلاردا - ئىبراھىم ۋە مۇسالارنىڭ كىتابلىرىدا باردۇر",
            "verse 87:19": "بۇ (يەنى بۇ سۈرىدىكى ۋەزلەر) شەك - شۈبھىسىز بۇرۇنقى كىتابلاردا - ئىبراھىم ۋە مۇسالارنىڭ كىتابلىرىدا باردۇر"
        },
        "Uzbek": {
            "verse 87:1": "Олий қадар бўлган Роббинг исмини поклаб ёд эт.",
            "verse 87:2": "У яратган ва мутаносиб қилган зотдир.",
            "verse 87:3": "У ўлчовли қилган ва ҳидоятга бошлаган зотдир.",
            "verse 87:4": "У ўт-ўланни чиқарган зотдир.",
            "verse 87:5": "Бас, У уни қорайган хашак қилган зотдир.",
            "verse 87:6": "Биз сенга қироат қилдирамиз, бас, эсдан чиқармайссан.",
            "verse 87:7": "Магар Аллоҳ хоҳлаганини. Албатта, У ошкорни ҳам, махфий нарсани ҳам биладир.",
            "verse 87:8": "Ва сени осон йўлга муяссар қилармиз.",
            "verse 87:9": "Бас, агар эслатиш манфаат берса, эслатгин.",
            "verse 87:10": "Албатта, қўрққан эсга оладир.",
            "verse 87:11": "Ва бадбахт ундан четда бўладир.",
            "verse 87:12": "У катта оловга кирадир.",
            "verse 87:13": "Сўнгра унинг ичида ўлмай ҳам, тирилмай ҳам қоладир.",
            "verse 87:14": "Батаҳқиқ, ким пок бўлса, ютуқ топадир.",
            "verse 87:15": "Ва Роббиси исмини зикр қилса ва намоз ўқиса ҳамдир.",
            "verse 87:16": "Лекин, сизлар дунё ҳаётини устун қўясизлар.",
            "verse 87:17": "Ҳолбуки, охират яхшироқ ва боқийроқдир.",
            "verse 87:18": "Албатта, бу аввалги саҳифаларда бордир.",
            "verse 87:19": "Иброҳим ва Мусо саҳифаларидадир."
        },
        "Vietnamese": {
            "verse 87:1": "Hãy tôn cao đại danh Thượng Đế của Ngươi, Đấng Tối Cao.",
            "verse 87:2": "Đấng đã tạo hóa và cân đối hình thể.",
            "verse 87:3": "Đấng đã định lượng và hướng dẫn.",
            "verse 87:4": "Đấng đã làm mọc ra đồng cỏ (xanh tươi).",
            "verse 87:5": "Sau đó, Ngài làm cho nó thành cộng rạ khô.",
            "verse 87:6": "(Hỡi Thiên Sứ Muhammad!) TA sẽ làm cho Ngươi đọc được (Qur’an) và Ngươi sẽ không bao giờ quên (Nó).",
            "verse 87:7": "Trừ phi Ngài muốn. Quả thật, Ngài biết rõ những gì được tiết lộ và những gì được che giấu.",
            "verse 87:8": "TA sẽ tạo sự dễ dàng và thuận lợi cho Ngươi (Thiên Sứ Muhammad trong việc làm hài lòng TA).",
            "verse 87:9": "Vì vậy, Ngươi hãy nhắc nhở nếu lời nhắc nhở có lợi.",
            "verse 87:10": "Người nào kính sợ (Allah) sẽ được nhắc nhở.",
            "verse 87:11": "Nhưng kẻ khốn khổ sẽ tránh xa (Qur’an).",
            "verse 87:12": "Đó là kẻ sẽ vào Lửa Lớn (của Hỏa Ngục).",
            "verse 87:13": "Trong đó, y sẽ không chết và cũng không thể sống.",
            "verse 87:14": "Chắc chắn sẽ thành công đối với ai thanh lọc bản thân (khỏi tội lỗi),",
            "verse 87:15": "Và tụng niệm đại danh của Thượng Đế và chu đáo dâng lễ nguyện Salah.",
            "verse 87:16": "Không. Các ngươi thường yêu thích cuộc sống trần gian này.",
            "verse 87:17": "Trong khi cuộc sống Đời Sau tốt hơn và mãi mãi trường tồn.",
            "verse 87:18": "Điều này thực sự có ghi trong các tờ Kinh trước đây.",
            "verse 87:19": "Các tờ Kinh của Ibrahim và Musa."
        },
        "Yoruba": {
            "verse 87:1": "Safomo fun oruko Oluwa re, Eni giga julo",
            "verse 87:2": "Eni ti O da eda. O si se (orikee-rikee re) ni dogbadogba",
            "verse 87:3": "Eni ti O yan kadara (fun eda). O si to o sona",
            "verse 87:4": "Eni ti O mu koriko tutu (hu) jade",
            "verse 87:5": "O si so o di gbigbe t’o dudu",
            "verse 87:6": "Awa yoo maa ke (al-Ƙur’an) fun o. Iwo ko si nii gbagbe",
            "verse 87:7": "Ayafi ohun ti Allahu ba fe. Dajudaju O mo gbangba ati ohun t’o pamo",
            "verse 87:8": "Awa yo si se ise rere ni irorun fun o",
            "verse 87:9": "Nitori naa, seranti ni aye ti iranti ti wulo",
            "verse 87:10": "Eni ti o maa paya (Allahu) maa lo iranti",
            "verse 87:11": "Olori-buruku si maa takete si i",
            "verse 87:12": "(Oun si ni) eni ti o maa wo inu Ina t’o tobi",
            "verse 87:13": "Leyin naa, ko nii ku sinu re, ko si nii semi (alaafia)",
            "verse 87:14": "Dajudaju eni ti o ba safomo (okan re) ti jere",
            "verse 87:15": "O tun ranti oruko Oluwa re, o si kirun",
            "verse 87:16": "Rara, nse l’e n gbe ajulo fun isemi aye",
            "verse 87:17": "Orun si loore julo, o si maa wa titi laelae",
            "verse 87:18": "Dajudaju eyi wa ninu awon takada akoko",
            "verse 87:19": "takada (Anabi) ’Ibrohim ati (Anabi) Musa"
        }
    }
}