{
    "id": 89,
    "name_simple": "Al-Fajr",
    "revelation_place": "makkah",
    "revelation_order": 10,
    "bismillah_pre": true,
    "verses_count": 30,
    "short_text": "The Surah is so designated after the word wal-fajr with which it opens.",
    "text": [
        "\n",
        "The Surah is so designated after the word wal-fajr with which it opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its contents show that it was revealed at the stage when persecution of the new converts to Islam had begun in Makkah. On that very basis the people of Makkah have been warned of the evil end of the tribes of Ad and Thamud and of Pharaoh.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to affirm the meting out of rewards and punishments in the Hereafter, which the people of Makkah were not prepared to acknowledge, Let us consider the reasoning in the order in which it has been presented.",
        "\n",
        "First of all, swearing oaths by the dawn, the ten nights, the even and the odd, and the departing night, the listeners have been asked: \"Are these things not enough to testify to the truth of that which you are refusing to acknowledge?\" From the explanation that we have given of these four things in the corresponding notes, it will become clear that these things are a symbol of the regularity that exists in the night and day, and swearing oaths by these the question has been asked in the sense: Even after witnessing this wise system established by God, do you still need any other evidence to show that it is not beyond the power of that God Who has brought about this system to establish the Hereafter, and that it is the very requirement of his wisdom that He should call man to account for his deeds?",
        "\n",
        "Then, reasoning from man's own history, the evil end of the Ad and the Thamud and Pharaoh has been cited as an example to show that when they transgressed all limits and multiplied corruption in the earth, Allah laid upon them the scourge of His chastisement. This is a proof of the fact that the system of the universe is not being run by deaf and blind forces, nor is the world a lawless kingdom of a corrupt ruler, but a Wise Ruler is ruling over it, the demand of Whose wisdom and justice is continuously visible in the world itself in man's own history that He should call to account, and reward and punish accordingly, the being whom He has blessed with reason and moral sense and given the right of appropriation in the world.",
        "\n",
        "After this, an appraisal has been made of the general moral state of human society of which Arab paganism was a conspicuous example; two aspects of it in particular, have been criticized: first the materialistic attitude of the people on account of which overlooking the moral good and evil, they regarded only the achievement of worldly wealth, rank and position, or the absence of it, as the criterion of honor or disgrace, and had forgotten that neither riches was a reward nor poverty a punishment, but that Allah is trying man in both conditions to see what attitude he adopts when blessed with wealth and how he behaves when afflicted by poverty. Second, the people's attitude under which the orphan child in their society was left destitute on the death of the father. Nobody asked after the poor; whoever could, usurped the whole heritage left by the deceased parent, and drove away the weak heirs fraudulently. The people were so afflicted with an insatiable greed for wealth that\r\nthey were never satisfied however much they might hoard and amass. This criticism is meant to make them realize as to why the people with such an attitude and conduct in the life of the world should not be called to account for their misdeeds.",
        "\n",
        "The discourse has been concluded with the assertion that accountability shall certainly be held and it will be held on the Day when the Divine Court will be established. At that time the deniers of the judgment will understand that which they are not understanding now in spite of instruction and admonition, but understanding then will be of no avail. The denier will regret and say, \"Would that I had provided for this Day beforehand while I lived in the world.\" But his regrets will not save him from Allah's punishment. However, as for the people who would have accepted the Truth, which the heavenly books and the Prophets of God were presenting, with full satisfaction of the heart in the world, Allah will be pleased with them and they will be well pleased with the rewards bestowed by Allah. They will be called upon to join the righteous and enter Paradise.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Dawn, and other natural occurrences and sacred designations, as a means of categorical airmation to mankind that God shall, indeed, hold all people accountable. It is names after “the dawn” (al-fajr) mentioned in verse 1. A surah in which God emphasizes that the tyrants of the Prophet’s time will be like those He dealt with in the past. The surah compares the destiny of the ungrateful with that of the souls at peace.The surah is also known as: The Daybreak.",
    "name_translation": "The Dawn",
    "name_complex": "Al-Fajr",
    "surah_name_ar": "الفجر",
    "verses": {
        "Albanian": {
            "verse 89:1": "Betohem në agimin,",
            "verse 89:2": "dhe dhjetë netët,",
            "verse 89:3": "dhe në të gjitha që janë çift e tek,",
            "verse 89:4": "dhe natën që shkon, -",
            "verse 89:5": "vallë, a nuk është ky betim për të mençurin?",
            "verse 89:6": "Vallë, a nuk di ti se çka ka bërë Zoti yt me Adin,",
            "verse 89:7": "e me banorët e qytetit Iremes, pronarë të pallatee madhështore,",
            "verse 89:8": "çfarë nuk ka pasur askund tjetër;",
            "verse 89:9": "dhe si i dënoi themudasit, të cilët kanë gëdhendur shkëmbinj në luginë,",
            "verse 89:10": "dhe Faraonin – pronarin e shtyllave,",
            "verse 89:11": "që kanë bërë zullum pa të drejtë në tokë",
            "verse 89:12": "dhe shtonin ngatërresat,",
            "verse 89:13": "andaj Zoti yt, e lëshoi mbi ta kamxhikun e dënimit (lloj-lloj dënimesh),",
            "verse 89:14": "sepse, me të vërtetë, Zoti yt i pret ata në pusi (i përcjellë punët e tyre).",
            "verse 89:15": "Por, Perëndia kur ta provojë njeriun e ta dhurojë me begati, (ai) thotë: “Zoti im është sjellë në mënyrë bujar endaj meje!”",
            "verse 89:16": "E, kur ta provojë atë, duke ia munguar furnizimin, atëherë ai thotë: “Zoti im më ka poshtëruar”.",
            "verse 89:17": "Jo, jo! Por ju nuk po i respektoni bonjakët,",
            "verse 89:18": "dhe nuk po e nxitni njëri-tjetrin për t’i ushqyer të varfërit,",
            "verse 89:19": "kurse trashëgiminë, e hani me lakmi të pangopur,",
            "verse 89:20": "dhe dëshironi pasuri të pakufishme.",
            "verse 89:21": "Por kjo nuk është mirë! Atëherë, kur Toka do të copëtohet në thërmia,",
            "verse 89:22": "dhe kur do të arrijë urdhëri i Zotit tënd, e engjëjt të rreshtohen radhë pas radhe,",
            "verse 89:23": "dhe atë Ditë kur afrohet (prezentohet) skëterra; atëherë njeriu do të kujtohet – por ç’dobi?!",
            "verse 89:24": "dhe thotë: “Ah! Sikur të kisha punuar gjëra të mira në jetën time!”",
            "verse 89:25": "Atë Ditë, askush nuk mund të dënojë, si Ai (dënimi i Tij),",
            "verse 89:26": "dhe, atë ditë, askush nuk lidhë në pranga si Ai!",
            "verse 89:27": "E ti, o shpirt i besuar (këmbëngulës në besim)",
            "verse 89:28": "kthehu te Zoti yt i kënaqur, sepse, edhe Ai është i kënaqur me ty,",
            "verse 89:29": "prandaj, hynnë mes të dashurve të Mi,",
            "verse 89:30": "dhe hyn në xhennetin Tim!"
        },
        "Amharic": {
            "verse 89:1": "በጎህ እምላለሁ፡፡",
            "verse 89:2": "በዐሥር ሌሊቶችም፡፡",
            "verse 89:3": "በጥንዱም በነጠላውም፡፡",
            "verse 89:4": "በሌሊቱም በሚኼድ ጊዜ፡፡",
            "verse 89:5": "በዚህ (መሓላ) ለባለ አእምሮ ታላቅ መሓላ አለበትን?",
            "verse 89:6": "ጌታህ በዓድ እንዴት እንደ ሠራ አታውቅምን?",
            "verse 89:7": "በኢረም በባለ ረዣዢሚቱ አዕማድ፡፡",
            "verse 89:8": "በዚያች ብጤዋ በአገሮች ውስጥ ያልተፈጠረ በኾነችው፡፡",
            "verse 89:9": "በሰሙድም በእነዚያ በሸለቆው ቋጥኝን የቆረጡ በኾኑት፡፡",
            "verse 89:10": "በፈርዖንም ባለ ችካሎች በኾነው፡፡",
            "verse 89:11": "በእነዚያ በአገሮች ላይ ግፍ የሠሩ፡፡",
            "verse 89:12": "በእርሷም ውስጥ ጥፋትን ያበዙ በኾኑት (እንዴት እንደሠራ አታውቅምን?)",
            "verse 89:13": "በእነርሱ ላይም ጌታህ የቅጣትን አለንጋ አወረደባቸው፡፡",
            "verse 89:14": "ጌታህ በመጠባበቂያ ላይ ነውና፡፡",
            "verse 89:15": "ሰውማ ጌታው በሞከረው ጊዜ፣ ባከበረውና ባጣቀመውም (ጊዜ) «ጌታዬ አከበረኝ (አበለጠኝ)» ይላል፡፡",
            "verse 89:16": "በሞከረውና በእርሱ ላይ ሲሳዩን ባጠበበ ጊዜማ «ጌታዬ አሳነሰኝ» ይላል፡፡",
            "verse 89:17": "ይከልከል፤ ይልቁንም የቲምን አታከብሩም፡፡",
            "verse 89:18": "ድኻንም በማብላት ላይ አትታዘዙም፡፡",
            "verse 89:19": "የውርስንም ገንዘብ የመሰብሰብን አበላል ትበላላችሁ፡፡",
            "verse 89:20": "ገንዘብንም ብዙን መውደድ ትወዳላችሁ፡፡",
            "verse 89:21": "ተዉ፤ ምድር ደጋግማ በተሰባበረች ጊዜ፤",
            "verse 89:22": "መላእክትም ሰልፍ ሰልፍ ኾነው ጌታህ (ትዕዛዙ) በመጣ ጊዜ፤",
            "verse 89:23": "ገሀነምም በዚያ ቀን በተመጣች ጊዜ በዚያ ቀን ሰው (ጥፋቱን) ይገነዘባል፡፡ መገንዘብም ለእርሱ ከየቱ?",
            "verse 89:24": "«ዋ እኔ! ምነው በሕይወቴ (መልካምን ሥራ) ባስቀደምኩ ኖሮ» ይላል፡፡",
            "verse 89:25": "በዚያ ቀንም የርሱን አቀጣጥ አንድም አይቀጣም፡፡",
            "verse 89:26": "የእርሱንም አስተሳሰር አንድም አያስርም፡፡",
            "verse 89:27": "(ለአመነች ነፍስም) «አንቺ የረካሺው ነፍስ ሆይ!",
            "verse 89:28": "«ወዳጅ ተወዳጅ ኾነሽ ወደ ጌታሽ ተመለሺ፡፡",
            "verse 89:29": "«በባሮቼም ውስጥ ግቢ፡፡",
            "verse 89:30": "ገነቴንም ግቢ፤» (ትባላለች)፡፡"
        },
        "Arabic": {
            "verse 89:1": "ِرْجَفْلاَو",
            "verse 89:2": "ٍرْشَع ٍلاَيَلَو",
            "verse 89:3": "ِرْتَوْلاَو ِعْفَّشلاَو",
            "verse 89:4": "ِرْسَي اَذِإ ِلْيَّللاَو",
            "verse 89:5": "ٍرْجِح يِذِّل ٌمَسَق َكِلَٰذ يِف ْلَه",
            "verse 89:6": "ٍداَعِب َكُّبَر َلَعَف َفْيَك َرَت ْمَلَأ",
            "verse 89:7": "ِداَمِعْلا ِتاَذ َمَرِإ",
            "verse 89:8": "ِداَلِبْلا يِف اَهُلْثِم ْقَلْخُي ْمَل يِتَّلا",
            "verse 89:9": "ِداَوْلاِب َرْخَّصلا اوُباَج َنيِذَّلا َدوُمَثَو",
            "verse 89:10": "(ِداَتْوَأْلا يِذ َنْوَعْرِفَو",
            "verse 89:11": "(ِداَلِبْلا يِف اْوَغَط َنيِذَّلا",
            "verse 89:12": "(َداَسَفْلا اَهيِف اوُرَثْكَأَف",
            "verse 89:13": "(ٍباَذَع َطْوَس َكُّبَر ْمِهْيَلَع َّبَصَف",
            "verse 89:14": "(ِداَصْرِمْلاِبَل َكَّبَر َّنِإ",
            "verse 89:15": "(ِنَمَرْكَأ يِّبَر ُلوُقَيَف ُهَمَّعَنَو ُهَمَرْكَأَف ُهُّبَر ُهاَلَتْبا اَم اَذِإ ُناَسنِإْلا اَّمَأَف",
            "verse 89:16": "(ِنَناَهَأ يِّبَر ُلوُقَيَف ُهَقْزِر ِهْيَلَع َرَدَقَف ُهاَلَتْبا اَم اَذِإ اَّمَأَو",
            "verse 89:17": "(َميِتَيْلا َنوُمِرْكُت اَّل لَب ۖ اَّلَك",
            "verse 89:18": "(ِنيِكْسِمْلا ِماَعَط ٰىَلَع َنوُّضاَحَت اَلَو",
            "verse 89:19": "(اًّمَّل اًلْكَأ َثاَرُّتلا َنوُلُكْأَتَو",
            "verse 89:20": "(اًّمَج اًّبُح َلاَمْلا َنوُّبِحُتَو",
            "verse 89:21": "(اًّكَد اًّكَد ُضْرَأْلا ِتَّكُد اَذِإ اَّلَك",
            "verse 89:22": "(اًّفَص اًّفَص ُكَلَمْلاَو َكُّبَر َءاَجَو",
            "verse 89:23": "(ٰىَرْكِّذلا ُهَل ٰىَّنَأَو ُناَسنِإْلا ُرَّكَذَتَي ٍذِئَمْوَي ۚ َمَّنَهَجِب ٍذِئَمْوَي َءيِجَو",
            "verse 89:24": "(يِتاَيَحِل ُتْمَّدَق يِنَتْيَل اَي ُلوُقَي",
            "verse 89:25": "(ٌدَحَأ ُهَباَذَع ُبِّذَعُي اَّل ٍذِئَمْوَيَف",
            "verse 89:26": "(ٌدَحَأ ُهَقاَثَو ُقِثوُي اَلَو",
            "verse 89:27": "(ُةَّنِئَمْطُمْلا ُسْفَّنلا اَهُتَّيَأ اَي",
            "verse 89:28": "(ًةَّيِضْرَّم ًةَيِضاَر ِكِّبَر ٰىَلِإ يِعِجْرا",
            "verse 89:29": "(يِداَبِع يِف يِلُخْداَف",
            "verse 89:30": "(يِتَّنَج يِلُخْداَو"
        },
        "Azerbaijani": {
            "verse 89:1": "And olsun dan yerinə!",
            "verse 89:2": "And olsun on gecəyə!",
            "verse 89:3": "And olsun cütə və təkə!",
            "verse 89:4": "And olsun keçib getməkdə olan gecəyə!",
            "verse 89:5": "Məgər bu andlar ağıl sahibi üçün kifayət deyilmi?",
            "verse 89:6": "Məgər görmədinmi ki, Rəbbin nələr etdi Ad qövmünə,",
            "verse 89:7": "sütunlar sahibi İrəm qəbiləsinə –",
            "verse 89:8": "halbuki, yer üzündə onlar kimisi xəlq edilməmişdi.",
            "verse 89:9": "Habelə vadidə qayaları yonan Səmud qövmünə?",
            "verse 89:10": "Eləcə də sütunlar sahibi Firona?",
            "verse 89:11": "Onlar o kəslər idi ki, ölkələrində həddi aşmış,",
            "verse 89:12": "çoxlu fitnə-fəsad törətmişdilər.",
            "verse 89:13": "Rəbbin də onları əzabla qamçıladı.",
            "verse 89:14": "Həqiqətən, sənin Rəbbin nəzarət edir.",
            "verse 89:15": "İnsana gəlincə, Rəbbi onu sınayıb ehtiram göstərəndə və ona nemət verəndə: “Rəbbim mənə ehtiram göstərdi!”– deyər.",
            "verse 89:16": "Amma onu sınamaq üçün ruzisini azaldanda: “Rəbbim məni alçaltdı!”– deyər.",
            "verse 89:17": "Xeyr! Əslində siz yetimə ehtiram göstərmirsiniz,",
            "verse 89:18": "kasıbı yedirməyə bir-birinizi təhrik etmirsiniz,",
            "verse 89:19": "mirası hərisliklə yeyirsiniz,",
            "verse 89:20": "var-dövləti də hərisliklə sevirsiniz.",
            "verse 89:21": "Xeyr! Elə ki yer lərzəyə gəlib parça-parça olacaq,",
            "verse 89:22": "sənin Rəbbin və səf-səf düzülmüş mələklər gələcək",
            "verse 89:23": "və o gün Cəhənnəm gətiriləcək. O gün insan günahlarını xatırlayacaqdır. Lakin bu xatırlamanın ona nə faydası?",
            "verse 89:24": "O: “Kaş axirət həyatım üçün əvvəlcədən hazırlıq görəydim!”– deyəcəkdir.",
            "verse 89:25": "O gün heç kəs Allahın verdiyi əzab kimi əzab verə bilməz",
            "verse 89:26": "və heç kəs Onun buxovladığı kimi buxovlaya bilməz.",
            "verse 89:27": "O gün möminə deyiləcəkdir: “Ey arxayın olan kəs!",
            "verse 89:28": "Razı qalmış və razılıq qazanmış halda öz Rəbbinə tərəf dön!",
            "verse 89:29": "Mənim qullarımın cərgəsinə keç!",
            "verse 89:30": "Cənnətimə daxil ol!"
        },
        "Bengali": {
            "verse 89:1": "শপথ ফজরের,",
            "verse 89:2": "শপথ দশ রাত্রির, শপথ তার,",
            "verse 89:3": "যা জোড় ও যা বিজোড়",
            "verse 89:4": "এবং শপথ রাত্রির যখন তা গত হতে থাকে",
            "verse 89:5": "এর মধ্যে আছে শপথ জ্ঞানী ব্যক্তির জন্যে।",
            "verse 89:6": "আপনি কি লক্ষ্য করেননি, আপনার পালনকর্তা আদ বংশের ইরাম গোত্রের সাথে কি আচরণ করেছিলেন,",
            "verse 89:7": "যাদের দৈহিক গঠন স্তম্ভ ও খুঁটির ন্যায় দীর্ঘ ছিল এবং",
            "verse 89:8": "যাদের সমান শক্তি ও বলবীর্যে সারা বিশ্বের শহরসমূহে কোন লোক সৃজিত হয়নি",
            "verse 89:9": "এবং সামুদ গোত্রের সাথে, যারা উপত্যকায় পাথর কেটে গৃহ নির্মাণ করেছিল।",
            "verse 89:10": "এবং বহু কীলকের অধিপতি ফেরাউনের সাথে",
            "verse 89:11": "যারা দেশে সীমালঙ্ঘন করেছিল।",
            "verse 89:12": "অতঃপর সেখানে বিস্তর অশান্তি সৃষ্টি করেছিল।",
            "verse 89:13": "অতঃপর আপনার পালনকর্তা তাদেরকে শাস্তির কশাঘাত করলেন।",
            "verse 89:14": "নিশ্চয় আপনার পালকর্তা সতর্ক দৃষ্টি রাখেন।",
            "verse 89:15": "মানুষ এরূপ যে, যখন তার পালনকর্তা তাকে পরীক্ষা করেন, অতঃপর সম্মান ও অনুগ্রহ দান করেন, তখন বলে, আমার পালনকর্তা আমাকে সম্মান দান করেছেন।",
            "verse 89:16": "এবং যখন তাকে পরীক্ষা করেন, অতঃপর রিযিক সংকুচিত করে দেন, তখন বলেঃ আমার পালনকর্তা আমাকে হেয় করেছেন।",
            "verse 89:17": "এটা অমূলক, বরং তোমরা এতীমকে সম্মান কর না।",
            "verse 89:18": "এবং মিসকীনকে অন্নদানে পরস্পরকে উৎসাহিত কর না।",
            "verse 89:19": "এবং তোমরা মৃতের ত্যাজ্য সম্পত্তি সম্পূর্ণরূপে কুক্ষিগত করে ফেল",
            "verse 89:20": "এবং তোমরা ধন-সম্পদকে প্রাণভরে ভালবাস।",
            "verse 89:21": "এটা অনুচিত। যখন পৃথিবী চুর্ণ-বিচুর্ণ হবে",
            "verse 89:22": "এবং আপনার পালনকর্তা ও ফেরেশতাগণ সারিবদ্ধভাবে উপস্থিত হবেন,",
            "verse 89:23": "এবং সেদিন জাহান্নামকে আনা হবে, সেদিন মানুষ স্মরণ করবে, কিন্তু এই স্মরণ তার কি কাজে আসবে?",
            "verse 89:24": "সে বলবেঃ হায়, এ জীবনের জন্যে আমি যদি কিছু অগ্রে প্রেরণ করতাম!",
            "verse 89:25": "সেদিন তার শাস্তির মত শাস্তি কেউ দিবে না।",
            "verse 89:26": "এবং তার বন্ধনের মত বন্ধন কেউ দিবে না।",
            "verse 89:27": "হে প্রশান্ত মন,",
            "verse 89:28": "তুমি তোমার পালনকর্তার নিকট ফিরে যাও সন্তুষ্ট ও সন্তোষভাজন হয়ে।",
            "verse 89:29": "অতঃপর আমার বান্দাদের অন্তর্ভুক্ত হয়ে যাও।",
            "verse 89:30": "এবং আমার জান্নাতে প্রবেশ কর।"
        },
        "Berber Amazigh": {
            "verse 89:1": "S tafrara!",
            "verse 89:2": "S mraw wavan!",
            "verse 89:3": "S wayugan akked waryugan!",
            "verse 89:4": "S yiv, ma ilêa!",
            "verse 89:5": "Day maççi dagi d tagallit i lfahem?",
            "verse 89:6": "Day ur twalav ara amek Ixdem Mass ik, i Âad?",
            "verse 89:7": "Iôam m tgejda;",
            "verse 89:8": "ur tepwaxleq temtilt is, di tmura.",
            "verse 89:9": "U Tamud, di te$zut, i i$zan tiéôa.",
            "verse 89:10": "Ferâun, bu ibudiden.",
            "verse 89:11": "Wid ijuôen di tmurt.",
            "verse 89:12": "Degs ssugten lefsad",
            "verse 89:13": "Iwwet iten Mass ik, s ujekwav uâaqeb.",
            "verse 89:14": "Ih, Mass ik d Amâassi.",
            "verse 89:15": "Amdan ma Ijeôôeb it Mass is, I$at it, Iga yas ccan, ad yini: \"d Mass iw iyi Iâuzzen\".",
            "verse 89:16": "Wanag, ma Ijeôôeb it, I$at it kan s lmizan, ad yini: \"d Mass iw iyi Igelzen\".",
            "verse 89:17": "Xaîi! Agujil, ur t tepâuzzum!",
            "verse 89:18": "Ur teppemtebbatem ar ume$bun, a t tecceççem!",
            "verse 89:19": "Teppeppem lweôt, têellqem!",
            "verse 89:20": "Têemlem ayla, tayri war tilas.",
            "verse 89:21": "Xaîi! Ma temsawi tmurt, yal amsawi,",
            "verse 89:22": "u Iusa d Mass ik, akked lmalayek, d idurra,",
            "verse 89:23": "assen, a d ters Loahennama. Assen, a d ismekti umdan. Acu ar as d iawi usmekti?",
            "verse 89:24": "Ad yini: \"a ssexv iw! A lemmer hegga$ i tmeddurt iw\"!",
            "verse 89:25": "Aâaqeb is, assen, ur t isâadda yiwen.",
            "verse 89:26": "Yiwen ur ipwaqqen akken ipwaqqen.",
            "verse 89:27": "A yiman illan di laman,",
            "verse 89:28": "u$al ar Mass ik, d amôavi ôuvan!",
            "verse 89:29": "Ekcem ger imdanen iW!",
            "verse 89:30": "Ekcem di Loennet iW!"
        },
        "Bosnian": {
            "verse 89:1": "Tako mi zore,",
            "verse 89:2": "i deset noći,",
            "verse 89:3": "i parnih i neparnih,",
            "verse 89:4": "i noći kada nestaje –",
            "verse 89:5": "zar to pametnom zakletva nije…?",
            "verse 89:6": "Zar ne znaš šta je Gospodar tvoj sa Adom uradio,",
            "verse 89:7": "sa stanovnicima Irema, punog palata na stupovima,",
            "verse 89:8": "kojima ravna ni u jednoj zemlji nije bilo;",
            "verse 89:9": "i Semudom, koji je stijene u dolini klesao,",
            "verse 89:10": "i faraonom, koji je šatore imao –",
            "verse 89:11": "koji su na Zemlji zulum provodili",
            "verse 89:12": "i poroke na njoj umnožili,",
            "verse 89:13": "pa je Gospodar tvoj – bič patnje na njih spustio,",
            "verse 89:14": "jer, Gospodar tvoj je, zaista, u zasjedi.",
            "verse 89:15": "Čovjek, kada Gospodar njegov hoće da ga iskuša pa mu počast ukaže i blagodatima ga obaspe, rekne: \"Gospodar moj je prema meni plemenito postupio!\"",
            "verse 89:16": "A kad mu, da bi ga iskušao, opskrbu njegovu oskudnom učini, onda rekne: \"Gospodar moj me je napustio!\"",
            "verse 89:17": "A nije tako! Vi pažnju siročetu ne ukazujete,",
            "verse 89:18": "i da se puki siromah nahrani – jedan drugog ne nagovarate,",
            "verse 89:19": "a nasljedstvo pohlepno jedete",
            "verse 89:20": "i bogatstvo pretjerano volite.",
            "verse 89:21": "A ne valja to! Kada se Zemlja u komadiće zdrobi",
            "verse 89:22": "i kad dođe naređenje Gospodara tvoga, a meleki budu sve red do reda,",
            "verse 89:23": "i kad se tog Dana primakne Džehennem; tada će se čovjek sjetiti – a na što mu je sjećanje?! –",
            "verse 89:24": "i reći: \"Kamo sreće da sam se za ovaj život pripremio!\"",
            "verse 89:25": "Tog Dana niko neće kao On mučiti,",
            "verse 89:26": "i niko neće kao On u okove okivati!",
            "verse 89:27": "A ti, o dušo smirena,",
            "verse 89:28": "vrati se Gospodaru svome zadovoljna, a i On tobom zadovoljan,",
            "verse 89:29": "pa uđi među robove Moje,",
            "verse 89:30": "i uđi u Džennet Moj!"
        },
        "Bulgarian": {
            "verse 89:1": "Кълна се в зората",
            "verse 89:2": "и в десетте нощи [от месеца за поклонение хадж],",
            "verse 89:3": "и в четното, и в нечетното,",
            "verse 89:4": "и в нощта, когато отминава!",
            "verse 89:5": "Нима в това няма клетва за разумния?",
            "verse 89:6": "Не видя ли ти как постъпи твоят Господ с адитите",
            "verse 89:7": "и с ирамитите, имащи високи постройки,",
            "verse 89:8": "подобни на които не бяха сътворени по земите,",
            "verse 89:9": "и със самудяните, които изсичаха скалите в долината,",
            "verse 89:10": "и с Фараона, владетеля на войските,",
            "verse 89:11": "които безчинстваха из селищата",
            "verse 89:12": "и множаха в тях развалата?",
            "verse 89:13": "Тогава твоят Господ стовари върху тях бича на мъчението.",
            "verse 89:14": "Твоят Господ надзирава.",
            "verse 89:15": "И ако неговият Господ го подложи на изпитание, като го почете и облагодетелства, човекът казва: “Моят Господ ме почете.”",
            "verse 89:16": "А ако го подложи на изпитание, като ограничи препитанието му, казва: “Моят Господ ме оскърби.”",
            "verse 89:17": "Ала не! Вие не почитате сирака",
            "verse 89:18": "и не подканвате да бъде нахранен нуждаещият се,",
            "verse 89:19": "и изяждате наследството [дори ако е чуждо] с лакомия.",
            "verse 89:20": "И обичате богатството с голяма любов.",
            "verse 89:21": "Ала не! Когато земята бъде стрита на прах",
            "verse 89:22": "и твоят Господ дойде с подредените в редици ангели,",
            "verse 89:23": "и Адът бъде докаран в този Ден, човекът ще си спомни тогава, ала защо ще му е спомнянето?",
            "verse 89:24": "Ще казва: “О, да бях сторил отнапред добрини заради моя [отвъден] живот!”",
            "verse 89:25": "В този Ден никой друг не ще измъчва, както Той измъчва,",
            "verse 89:26": "и никой друг не ще оковава, както Той оковава.",
            "verse 89:27": "О, душа успокоена,",
            "verse 89:28": "завърни се при твоя Господ доволстваща, заслужила благосклонност!",
            "verse 89:29": "Влез сред Моите раби,",
            "verse 89:30": "влез в Моя Рай!"
        },
        "Chinese": {
            "verse 89:1": "誓以黎明，",
            "verse 89:2": "与十夜，",
            "verse 89:3": "与偶数和奇数，",
            "verse 89:4": "与离去的黑夜，",
            "verse 89:5": "对於有理智者，此中有一种盟誓吗？",
            "verse 89:6": "难道你不知道你的主怎样惩治阿德人---",
            "verse 89:7": "有高柱的伊赖姆人吗？",
            "verse 89:8": "像那样的人，在别的城市里还没有被创造过的---",
            "verse 89:9": "怎样惩治在山谷里凿石为家的赛莫德人，",
            "verse 89:10": "怎样惩治有武力的法老。",
            "verse 89:11": "这等人曾在国中放肆，",
            "verse 89:12": "乃多行不义，",
            "verse 89:13": "故你的主把一种刑罚，倾注在他们身上。",
            "verse 89:14": "你的主，确是监视的。",
            "verse 89:15": "至於人，当他的主考验他，故优待他，而且使他过安逸生活的时候，他说：我的主优待我了。",
            "verse 89:16": "当他考验他，故节约他的给养的时候，他说：我的主凌辱我了。",
            "verse 89:17": "绝不然！但你们不优待孤儿，",
            "verse 89:18": "你们不以济贫相勉励，",
            "verse 89:19": "你们侵吞遗产，",
            "verse 89:20": "你们酷爱钱财。",
            "verse 89:21": "绝不然！当大地震动复震动，",
            "verse 89:22": "你的主的命令，和排班的天神，同齐来临的时候，",
            "verse 89:23": "在那日，火狱将被拿来；在那日，人将觉悟，但觉悟於他有何裨益呢？",
            "verse 89:24": "他将说：但愿我在世的时候曾行善事。",
            "verse 89:25": "在那日，任何人，不用他的那种刑罚惩治别人；",
            "verse 89:26": "任何人，不用他的那种束缚束缚别人。",
            "verse 89:27": "安定的灵魂啊！",
            "verse 89:28": "你应当喜悦地，被喜悦地归於你的主。",
            "verse 89:29": "你应当入在我的众仆里；",
            "verse 89:30": "你应当入在我的乐园里。"
        },
        "Danish": {
            "verse 89:1": "Bij de dageraad",
            "verse 89:2": "En de tien nachten",
            "verse 89:3": "En het even en het oneven",
            "verse 89:4": "En de nacht als deze vervaagt",
            "verse 89:5": "Daarin is zeker genoeg bewijs voor een man van begrip",
            "verse 89:6": "Weet gij niet hoe uw Heer met de Aad handelde",
            "verse 89:7": "Het volk van Iram dat verheven gebouwen bezat",
            "verse 89:8": "Wier gelijken nog in geen enkele stad zijn voortgebracht",
            "verse 89:9": "En met de Samoed die de rotsen in het dal uithieuwen",
            "verse 89:10": "En met Pharao, de heer der grote scharen",
            "verse 89:11": "Die zich in de steden aan overtreding overgaven",
            "verse 89:12": "En veel verderf daarin aanrichtten",
            "verse 89:13": "Daarom, deed uw Heer een roede der kastijding over hen nederdalen",
            "verse 89:14": "Voorwaar, uw Heer is waakzaam",
            "verse 89:15": "Wat de mens betreft, wanneer zijn Heer hem beproeft door hem te roemen en door hem gunsten te bewijzen, dan zegt hij: Mijn Heer heeft mij geëerd",
            "verse 89:16": "Maar wanneer Hij hem beproeft door hem in zijn levensonderhoud te beperken, zegt hij: Mijn Heer heeft mij onteerd",
            "verse 89:17": "Neen, maar gij ontziet de wees niet",
            "verse 89:18": "Noch spoort elkander aan, de armen te voeden",
            "verse 89:19": "En gij verslindt het erfdeel in zijn geheel",
            "verse 89:20": "En gij houdt te veel van weelde",
            "verse 89:21": "Neen, wanneer de aarde aan stukken wordt geschud",
            "verse 89:22": "En uw Heer komt en de engelen in rijen gerangschikt zijn",
            "verse 89:23": "Op die Dag zal de hel (hem) worden getoond; op die Dag zal de mens de vermaning willen volgen, maar hoe zal de vermaning hem kunnen baten",
            "verse 89:24": "Hij zal zeggen: o had ik (vroeger), voor dit leven iets verricht",
            "verse 89:25": "Niemand straft zoals Hij op die Dag zal straffen",
            "verse 89:26": "Noch boeit iemand zoals Hij zal boeien",
            "verse 89:27": "Maar gij, o ziel in vrede",
            "verse 89:28": "Keer tot uw Heer terug, verblijd in Allah`s welbehagen",
            "verse 89:29": "Ga daarom in onder Mijn dienaren",
            "verse 89:30": "En ga Mijn paradijs binnen"
        },
        "Dutch": {
            "verse 89:1": "Bij de dageraad.",
            "verse 89:2": "Bij de tien nachten. (De eerste tien dagen en nachten van de maand Dzoelhiddjah)",
            "verse 89:3": "Bij het even en het oneven.",
            "verse 89:4": "Bij de nacht wanneer hij voorbijgaat.",
            "verse 89:5": "Is daarin geen eed voor de bezitter van verstand?",
            "verse 89:6": "Heb jij niet vernomen hoe jouw Heer de 'Âd heeft behandeld?",
            "verse 89:7": "Van de stad Iram met zijn zuilen?",
            "verse 89:8": "Zoals nog nooit een stad is geschapen in de landen?",
            "verse 89:9": "En de Tsamôed die de rotsen uithieuwen in de vallei?",
            "verse 89:10": "En Fir'aun, de bezitter van de pinnen?",
            "verse 89:11": "Degenen die overtraden in het land?",
            "verse 89:12": "En daarin veelvuldig verderf zaaiden?",
            "verse 89:13": "Toen deed jouw Heer de gesel van de bestraffing op hen neerdalen.",
            "verse 89:14": "Voorwaar, jouw Heer is zeker waakzaam.",
            "verse 89:15": "Wat de mens betreft, wanneer zijn Heer hem op de proef stelt en hem aanzien geeft en hem genietingen schenkt, dan zegt hij: \"Mijn Heer heeft mij geëerd.\"",
            "verse 89:16": "Maar wanneer Hij hem beproeft, en dan zijn voorzieningen beperkt, dan zegt hij: \"Mijn Heer heeft mij vernederd.\"",
            "verse 89:17": "Nee! Jullie ondersteunen immers de wees niet.",
            "verse 89:18": "En jullie sporen elkaar niet aan tot het voeden van de behoeftigen.",
            "verse 89:19": "En jullie verteren het erfdeel inhalig.",
            "verse 89:20": "En jullie beminnen het bezit met overdreven liefde.",
            "verse 89:21": "Nee, wanneer de aarde met klappen verpulverd wordt.",
            "verse 89:22": "En jouw Heer komt, en de Engelen, rij na rij.",
            "verse 89:23": "En op de Dag dat de Hel wordt getoond, op die Dag zal de mens zich (zijn slechte daden) herinneren, maar wat baat hem dan nog de herinnering?",
            "verse 89:24": "Hij zegt: \"Wee, had ik maar goede (daden) verricht tijdens mijn leven.\"",
            "verse 89:25": "Maar op die Dag is er niemand die straft zoals Hij.",
            "verse 89:26": "En niemand knevelt zoals Hij knevelt.",
            "verse 89:27": "O tot rust gekomen ziel!",
            "verse 89:28": "Keer terug tot jouw Heer, behaagd en welbehaagd (ontvangen door Hem).",
            "verse 89:29": "En treed binnen onder Mijn dienaren.",
            "verse 89:30": "En treed binnen in Mijn Paradijs."
        },
        "English": {
            "verse 89:1": "By the dawn",
            "verse 89:2": "And [by] ten nights",
            "verse 89:3": "And [by] the even [number] and the odd",
            "verse 89:4": "And [by] the night when it passes,",
            "verse 89:5": "Is there [not] in [all] that an oath [sufficient] for one of perception?",
            "verse 89:6": "Have you not considered how your Lord dealt with 'Aad -",
            "verse 89:7": "[With] Iram - who had lofty pillars,",
            "verse 89:8": "The likes of whom had never been created in the land?",
            "verse 89:9": "And [with] Thamud, who carved out the rocks in the valley?",
            "verse 89:10": "And [with] Pharaoh, owner of the stakes? -",
            "verse 89:11": "[All of] whom oppressed within the lands",
            "verse 89:12": "And increased therein the corruption.",
            "verse 89:13": "So your Lord poured upon them a scourge of punishment.",
            "verse 89:14": "Indeed, your Lord is in observation.",
            "verse 89:15": "And as for man, when his Lord tries him and [thus] is generous to him and favors him, he says, \"My Lord has honored me.\"",
            "verse 89:16": "But when He tries him and restricts his provision, he says, \"My Lord has humiliated me.\"",
            "verse 89:17": "No! But you do not honor the orphan",
            "verse 89:18": "And you do not encourage one another to feed the poor.",
            "verse 89:19": "And you consume inheritance, devouring [it] altogether,",
            "verse 89:20": "And you love wealth with immense love.",
            "verse 89:21": "No! When the earth has been leveled - pounded and crushed -",
            "verse 89:22": "And your Lord has come and the angels, rank upon rank,",
            "verse 89:23": "And brought [within view], that Day, is Hell - that Day, man will remember, but what good to him will be the remembrance?",
            "verse 89:24": "He will say, \"Oh, I wish I had sent ahead [some good] for my life.\"",
            "verse 89:25": "So on that Day, none will punish [as severely] as His punishment,",
            "verse 89:26": "And none will bind [as severely] as His binding [of the evildoers].",
            "verse 89:27": "[To the righteous it will be said], \"O reassured soul,",
            "verse 89:28": "Return to your Lord, well-pleased and pleasing [to Him],",
            "verse 89:29": "And enter among My [righteous] servants",
            "verse 89:30": "And enter My Paradise.\""
        },
        "Filipino": {
            "verse 89:1": "Sa pamamagitan ng Bukang Liwayway",
            "verse 89:2": "Sa pamamagitan ng sampung gabi (alalaong baga, ang unang sampung araw ng buwan ng Dhul-Hijja)",
            "verse 89:3": "Sa pamamagitan (ng bilang) na pantay at gansal (sa lahat ng mga nilalang ni Allah)",
            "verse 89:4": "At sa pamamagitan ng gabi kung ito ay lumilipas",
            "verse 89:5": "Katotohanang narito (sa mga sumpang pahayag) ang sapat na katibayan sa mga tao na may ganap na pang-unawa (at dahil dito, sila ay marapat na umiwas sa lahat ng mga kasalanan at kawalang pananalig, atbp)",
            "verse 89:6": "Hindi mo ba namamalas ([o napagtatanto] O Muhammad) kung paano itinuring ng iyong Panginoon ang angkan ni A’ad",
            "verse 89:7": "Ng lunsod ng Imran, na may matataas na haligi",
            "verse 89:8": "Ang katulad nito ay hindi ginawa sa (lahat) ng lupain",
            "verse 89:9": "At sa angkan ni Thamud na bumabaak ng malalaking bato sa paanan ng bundok (upang gawing tirahan)",
            "verse 89:10": "At kay Paraon na may mga talasok (na nagpapahirap sa mga tao sa pamamagitan ng pagtatali sa mga talasok)",
            "verse 89:11": "Na nagmalabis sa lahat ng hangganan ng kalupaan (sa pagsuway kay Allah)",
            "verse 89:12": "At nagsagawa rito ng napakaraming kabuktutan",
            "verse 89:13": "Kaya’t ang iyong Panginoon ay naggawad sa kanila ng iba’t ibang uri ng kaparusahan",
            "verse 89:14": "Katotohanan, ang iyong Panginoon ay Laging Nagmamasid (sa kanila)",
            "verse 89:15": "At ang tao, kung siya ay subukan ng (kanyang) Panginoon at gawaran ng biyaya at karangalan; kanyang sasalitain (ng may pagmamalaki): “Ang aking Panginoon ay nagparangal sa akin!”",
            "verse 89:16": "Datapuwa’t ang tao, kung siya ay Kanyang subukan at higpitan ang pinagkukunan ng kanyang biyaya; kanyang sasalitain (sa kawalang pag-asa): “Ang aking Panginoon ay humamak (umaba) sa akin!”",
            "verse 89:17": "Hindi! Katotohanang ikaw ay hindi lumilingap sa mga ulila (maging ang pakitunguhan sila ng mabuti, o ipagkaloob sa kanila ang nararapat nilang mana)",
            "verse 89:18": "At walang malasakit na pakainin ang naghihikahos",
            "verse 89:19": "At kinamkammoang(kanilang) pamana, anglahat- sapagiging gahaman",
            "verse 89:20": "At nagmamahal ka sa iyong kayamanan ng labis-labis na pagmamahal",
            "verse 89:21": "Hindi! Kung ang kalupaan ay durugin ng pinung-pino",
            "verse 89:22": "At ang iyong Panginoon ay pumarito na kasama ng pangkat-pangkat na anghel",
            "verse 89:23": "At ang Impiyerno, sa Araw na ito ay matatambad ng malapit. Sa Araw na ito, ang tao ay makakaala-ala, datapuwa’t paano kaya na ang gayong pag-aala-ala ay makakatulong sa kanya",
            "verse 89:24": "Siya ay magsasabi: “Ah! Sana ay pinaghandaan ko ito (ng mabubuting gawa) tungo sa aking darating na (ibang) buhay!”",
            "verse 89:25": "Sa Araw na ito, ang Kanyang kaparusahan (ng sakit at lumbay) ay hindi maipadadama ng sinuman (maliban sa Kanya)",
            "verse 89:26": "At ang Kanyang paggapos (sa piitan) ay hindi maipadadama ng sinuman (maliban sa Kanya)",
            "verse 89:27": "(At sa mabubuting kaluluwa ay ipagbabadya): “o (ikaw na) kaluluwa, sa (ganap) na kapahingahan at kasiyahan",
            "verse 89:28": "Magbalik ka sa iyong Panginoon, na nalulugod (sa iyong sarili) at iyong tamasahin ang Kanyang lugod",
            "verse 89:29": "Halika, pumasok ka sa lipon ng Aking mararangal na alipin",
            "verse 89:30": "Katotohanan, pumasok ka sa Aking Langit (Paraiso)!”"
        },
        "French": {
            "verse 89:1": "Par l'Aube!",
            "verse 89:2": "Et par les dix nuits!",
            "verse 89:3": "Par le pair et l'impair!",
            "verse 89:4": "Et par la nuit quand elle s'écoule!",
            "verse 89:5": "N'est-ce pas là un serment, pour un doué d'intelligence?",
            "verse 89:6": "N'as-tu pas vu comment ton Seigneur a agi avec les 'Aad",
            "verse 89:7": "[avec] Iram, [la cité] à la colonne remarquable,",
            "verse 89:8": "dont jamais pareille ne fut construite parmi les villes?",
            "verse 89:9": "et avec les Thamûd qui taillaient le rocher dans la vallée?",
            "verse 89:10": "ainsi qu'avec Pharaon, l'homme aux épieux?",
            "verse 89:11": "Tous, étaient des gens qui transgressaient dans [leurs] pays,",
            "verse 89:12": "et y avaient commis beaucoup de désordre.",
            "verse 89:13": "Donc, ton Seigneur déversa sur eux un fouet du châtiment.",
            "verse 89:14": "Car ton Seigneur demeure aux aguets.",
            "verse 89:15": "Quant à l'homme, lorsque son Seigneur l'éprouve en l'honorant et en le comblant de bienfaits, il dit: «Mon Seigneur m'a honoré».",
            "verse 89:16": "Mais par contre, quand Il l'éprouve en lui restreignant sa subsistance, il dit: «Mon Seigneur m'a avili».",
            "verse 89:17": "Mais non! C'est vous plutôt, qui n'êtes pas généreux envers les orphelins;",
            "verse 89:18": "qui ne vous incitez pas mutuellement à nourrir le pauvre,",
            "verse 89:19": "qui dévorez l'héritage avec une avidité vorace,",
            "verse 89:20": "et aimez les richesses d'un amour sans bornes.",
            "verse 89:21": "Prenez garde! Quand la terre sera complètement pulvérisée,",
            "verse 89:22": "et que ton Seigneur viendra ainsi que les Anges, rang par rang,",
            "verse 89:23": "et que ce jour-là, on amènera l'Enfer; ce jour-là, l'homme se rappellera. Mais à quoi lui servira de se souvenir?",
            "verse 89:24": "Il dira: «Hélas! Que n'ai-je fait du bien pour ma vie future!",
            "verse 89:25": "Ce jour-là donc, nul ne saura châtier comme Lui châtie,",
            "verse 89:26": "et nul ne saura garrotter comme Lui garrotte.",
            "verse 89:27": "«O toi, âme apaisée,",
            "verse 89:28": "retourne vers ton Seigneur, satisfaite et agréée;",
            "verse 89:29": "entre donc parmi Mes serviteurs,",
            "verse 89:30": "et entre dans Mon Paradis»."
        },
        "Fulah": {
            "verse 89:1": "Alla woondirii Fajiri",
            "verse 89:2": "E balɗe sappa",
            "verse 89:3": "Mi woondiri kala ko ɗimmita e ko teelɗi",
            "verse 89:4": "Mi woondarii jemma si mbo arii e niɓɓidde",
            "verse 89:5": "Mbela ina e ndee woondoore jaɓnoore jom hakkille",
            "verse 89:6": "Mbela a yi*aani na joom ma waɗi Aad en",
            "verse 89:7": "Iram jom doosɗe",
            "verse 89:8": "Mbo hono mum tagaaka e leydi",
            "verse 89:9": "E Samuud ɓeen seekɓe kaaƴe to caatngol",
            "verse 89:10": "E Fir*awna jom penɗe",
            "verse 89:11": "ɓeen bewnooɓe to leydi",
            "verse 89:12": "ɓe kebbini e hendi bonannde",
            "verse 89:13": "joom Ma yuppi e maɓɓe lepte cattuɗe",
            "verse 89:14": "joom Ma na tommbiiɓe",
            "verse 89:15": "Tawi ko neɓɗɗanke si joom Makko jarabiimo mbo O teddani mbo O neemini mbo o wiyat joom am teddinii kam",
            "verse 89:16": "Si tawii noon O jaribiimo mbo O faaɗni arsuko makko o wiya joom am hoynii kam",
            "verse 89:17": "Alah wonah noon, ko woni ko on teddintaana baaya",
            "verse 89:18": "o rerɗiŋtaa e ñammiingol miskiino",
            "verse 89:19": "Hoɗon ñaama ndonu ñaamgol cattungol",
            "verse 89:20": "Hoɗon njiɗi jawdi jiɗgol cattungol",
            "verse 89:21": "Alah ɗum haanaani, si leydi ndii dimmbaama dimmbugol",
            "verse 89:22": "joom ma ardi e malaykaaji hoɗi mbaɗi saffeeji. @Corrected",
            "verse 89:23": "jahanama addee ñande heen neɗɗo siftoro kono hol ko siftorde nafata",
            "verse 89:24": "O wi*a haaniino mi ardinii golle lobbe wonande nguurndam am",
            "verse 89:25": "E oon ñalawma hay gooto leptatah hono lepte makko",
            "verse 89:26": "Hay gooto tonngetaake hono tonngi heeferɓe",
            "verse 89:27": "Eehey ma fittaandu huɓandiindu",
            "verse 89:28": "Rutto e joom ma haɗa woni belaaɗo Mbo Kanko ne hombo wela ma",
            "verse 89:29": "Naat e maccuɓe Am",
            "verse 89:30": "Naat e aljanna Am"
        },
        "German": {
            "verse 89:1": "Bei der Morgendämmerung",
            "verse 89:2": "und den zehn Nächten",
            "verse 89:3": "und dem geraden und dem ungeraden (Tag)",
            "verse 89:4": "und der Nacht, wenn sie fortzieht!",
            "verse 89:5": "Ist darin ein (ausreichender) Schwur für jemanden, der Klugheit besitzt?",
            "verse 89:6": "Siehst du nicht, wie dein Herr mit den 'Ad verfuhr,",
            "verse 89:7": "(mit) Iram mit den Stützen,",
            "verse 89:8": "dergleichen nicht erschaffen wurden in den Landstrichen?",
            "verse 89:9": "Und (mit) den Tamud, die im Tal die Felsen aushöhlten?",
            "verse 89:10": "Und (mit) Fir'aun, dem Besitzer der Pfähle,",
            "verse 89:11": "die (sie alle) das Maß (an Frevel) in den Landstrichen überschritten",
            "verse 89:12": "und darin viel Unheil stifteten?",
            "verse 89:13": "Da schüttete dein Herr auf sie eine Geißel von Strafe aus.",
            "verse 89:14": "Gewiß, dein Herr wartet ja (auf sie).",
            "verse 89:15": "Was nun den Menschen angeht, wenn sein Herr ihn prüft und ihn da(bei) freigebig behandelt und ihm ein wonnevolles Leben verschafft, so sagt er: \"Mein Herr behandelt mich freigebig.\"",
            "verse 89:16": "Was (ihn) aber angeht, wenn Er ihn prüft und ihm da(bei) seine Versorgung bemißt, so sagt er: \"Mein Herr setzt mich der Schmach aus.\"",
            "verse 89:17": "Keineswegs! Vielmehr behandelt ihr die Waise nicht freigebig",
            "verse 89:18": "und haltet euch nicht gegenseitig zur Speisung des Armen an.",
            "verse 89:19": "Und ihr verzehrt das Erbe, ja ihr verzehrt es ganz und gar.",
            "verse 89:20": "Und ihr liebt den Besitz, ja ihr liebt ihn voll und ganz.",
            "verse 89:21": "Keineswegs! Wenn die Erde eingeebnet, ja platt eingeebnet wird",
            "verse 89:22": "und dein Herr kommt und die Engel, Reihe um Reihe,",
            "verse 89:23": "und herbeigebracht wird an jenem Tag die Hölle, an jenem Tag wird der Mensch bedenken. Wie soll ihm dann die Selbstbesinnung (nützen)?",
            "verse 89:24": "Er wird sagen: \"O hätte ich doch für mein (jenseitiges) Leben (etwas) vorausgeschickt!\"",
            "verse 89:25": "An jenem Tag wird niemand strafen, so wie Er straft,",
            "verse 89:26": "und niemand wird fesseln, so wie Er fesselt.",
            "verse 89:27": "O du Seele, die du Ruhe gefunden hast,",
            "verse 89:28": "kehre zu deinem Herrn zufrieden und mit Wohlgefallen zurück.",
            "verse 89:29": "Tritt ein unter Meine Diener,",
            "verse 89:30": "und tritt ein in Meinen (Paradies)garten."
        },
        "Hausa": {
            "verse 89:1": "Inã rantsuwa da alfijiri.",
            "verse 89:2": "Da darũruwa gõma.",
            "verse 89:3": "Da (adadi na) cikã da (na) mãrã.",
            "verse 89:4": "Da dare idan yana shũɗewa.",
            "verse 89:5": "Ko a cikin waɗannan akwai abin rantsuwa ga mai hankali (da yake kange shi daga zunubi)?",
            "verse 89:6": "Ba ka ga yadda Ubangijinka Ya aikata da Ãdãwa ba?",
            "verse 89:7": "Iramawa mãsu sakon ƙĩrar jiki.",
            "verse 89:8": "Waɗanda ba a halitta kwatankwacinsu ba a cikin garũruwa (na dũniya).",
            "verse 89:9": "Da samũdãwa waɗanda suka fasa duwãtsu a cikin Wadi suka yi gidãje)?",
            "verse 89:10": "Da Fir'auna mai turãku.",
            "verse 89:11": "Waɗanda suka ƙẽtare iyãkarsu, a cikin garũruwa?",
            "verse 89:12": "Sabõda haka, suka yawaita yin ɓarna a cikinsu.",
            "verse 89:13": "Sabõda haka Ubangijinka Ya zuba musu bũlãlar azãba.",
            "verse 89:14": "Lalle ne, Ubangijinka Yana nan a mafaka.",
            "verse 89:15": "To, amma fa mutum idan Ubangijibsa Ya jarraba shi, wãto Yã girmama shi kuma Ya yi masa ni'ima, sai ya ce: \"Ubangijina Ya girmama ni.\"",
            "verse 89:16": "Kuma idan Ya jarraba shi, wãto Ya ƙuntata masa abincinsa, sai ya ce: \"Ubangijina Ya walãkanta ni.\"",
            "verse 89:17": "A'aha! Bari wannan, ai bã ku girmama marãya!",
            "verse 89:18": "Bã ku kwaɗaitã wa jũnanku ga (tattalin) abincin matalauci!",
            "verse 89:19": "Kuma kuna cin dũkiyar gãdo, ci na tãrãwa.",
            "verse 89:20": "Kuma kuna son dũkiya, so mai yawa.",
            "verse 89:21": "A'aha! Idan aka niƙa ƙasa niƙewa sosai.",
            "verse 89:22": "Kuma Ubangijinka Ya zo, alhãli malã'iku na jẽre, safũ- safu.",
            "verse 89:23": "Kuma a ranar nan aka zo da Jahannama. A ranar nan mutum zai yi tunãni. To, inã fa tunãni yake a gare shi!",
            "verse 89:24": "Yana dinga cẽwa, \"Kaitona, dã na gabatar (da aikin ƙwarai) domin rãyuwata!\"",
            "verse 89:25": "To, a rãnar nan bãbu wani mai yin azãba irin azãbar Allah.",
            "verse 89:26": "Kuma bãbu wani mai ɗauri irin ɗaurinSa.",
            "verse 89:27": "Yã kai rai mai natsuwa!",
            "verse 89:28": "Ka koma zuwa ga Ubangijinka, alhãli kana mai yarda (da abin da Ya ƙaddara maka a dũniya) abar yardarwa (da sakamakon da zã a ba ka a Lãhira).",
            "verse 89:29": "Sabõbda haka, ka shiga cikin bãyiNa (mãsu bin umurui a dũniya).",
            "verse 89:30": "Kuma ka shiga AljannaTa (a Lãhira)."
        },
        "Hindi": {
            "verse 89:1": "सुबह की क़सम",
            "verse 89:2": "और दस रातों की",
            "verse 89:3": "और ज़ुफ्त व ताक़ की",
            "verse 89:4": "और रात की जब आने लगे",
            "verse 89:5": "अक्लमन्द के वास्ते तो ज़रूर बड़ी क़सम है (कि कुफ्फ़ार पर ज़रूर अज़ाब होगा)",
            "verse 89:6": "क्या तुमने देखा नहीं कि तुम्हारे आद के साथ क्या किया",
            "verse 89:7": "यानि इरम वाले दराज़ क़द",
            "verse 89:8": "जिनका मिसल तमाम (दुनिया के) शहरों में कोई पैदा ही नहीं किया गया",
            "verse 89:9": "और समूद के साथ (क्या किया) जो वादी (क़रा) में पत्थर तराश कर घर बनाते थे",
            "verse 89:10": "और फिरऔन के साथ (क्या किया) जो (सज़ा के लिए) मेख़े रखता था",
            "verse 89:11": "ये लोग मुख़तलिफ़ शहरों में सरकश हो रहे थे",
            "verse 89:12": "और उनमें बहुत से फ़साद फैला रखे थे",
            "verse 89:13": "तो तुम्हारे परवरदिगार ने उन पर अज़ाब का कोड़ा लगाया",
            "verse 89:14": "बेशक तुम्हारा परवरदिगार ताक में है",
            "verse 89:15": "लेकिन इन्सान जब उसको उसका परवरदिगार (इस तरह) आज़माता है कि उसको इज्ज़त व नेअमत देता है, तो कहता है कि मेरे परवरदिगार ने मुझे इज्ज़त दी है",
            "verse 89:16": "मगर जब उसको (इस तरह) आज़माता है कि उस पर रोज़ी को तंग कर देता है बोल उठता है कि मेरे परवरदिगार ने मुझे ज़लील किया",
            "verse 89:17": "हरगिज़ नहीं बल्कि तुम लोग न यतीम की ख़ातिरदारी करते हो",
            "verse 89:18": "और न मोहताज को खाना खिलाने की तरग़ीब देते हो",
            "verse 89:19": "और मीरारा के माल (हलाल व हराम) को समेट कर चख जाते हो",
            "verse 89:20": "और माल को बहुत ही अज़ीज़ रखते हो",
            "verse 89:21": "सुन रखो कि जब ज़मीन कूट कूट कर रेज़ा रेज़ा कर दी जाएगी",
            "verse 89:22": "और तुम्हारे परवरदिगार का हुक्म और फ़रिश्ते कतार के कतार आ जाएँगे",
            "verse 89:23": "और उस दिन जहन्नुम सामने कर दी जाएगी उस दिन इन्सान चौंकेगा मगर अब चौंकना कहाँ (फ़ायदा देगा)",
            "verse 89:24": "(उस वक्त) क़हेगा कि काश मैने अपनी (इस) ज़िन्दगी के वास्ते कुछ पहले भेजा होता",
            "verse 89:25": "तो उस दिन ख़ुदा ऐसा अज़ाब करेगा कि किसी ने वैसा अज़ाब न किया होगा",
            "verse 89:26": "और न कोई उसके जकड़ने की तरह जकड़ेगा",
            "verse 89:27": "(और कुछ लोगों से कहेगा) ऐ इत्मेनान पाने वाली जान",
            "verse 89:28": "अपने परवरदिगार की तरफ़ चल तू उससे ख़ुश वह तुझ से राज़ी",
            "verse 89:29": "तो मेरे (ख़ास) बन्दों में शामिल हो जा",
            "verse 89:30": "और मेरे बेहिश्त में दाख़िल हो जा"
        },
        "Indonesian": {
            "verse 89:1": "Demi fajar,",
            "verse 89:2": "dan malam yang sepuluh,",
            "verse 89:3": "dan yang genap dan yang ganjil,",
            "verse 89:4": "dan malam bila berlalu.",
            "verse 89:5": "Pada yang demikian itu terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal.",
            "verse 89:6": "Apakah kamu tidak memperhatikan bagaimana Tuhanmu berbuat terhadap kaum 'Aad?",
            "verse 89:7": "(yaitu) penduduk Iram yang mempunyai bangunan-bangunan yang tinggi,",
            "verse 89:8": "yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,",
            "verse 89:9": "dan kaum Tsamud yang memotong batu-batu besar di lembah,",
            "verse 89:10": "dan kaum Fir'aun yang mempunyai pasak-pasak (tentara yang banyak),",
            "verse 89:11": "yang berbuat sewenang-wenang dalam negeri,",
            "verse 89:12": "lalu mereka berbuat banyak kerusakan dalam negeri itu,",
            "verse 89:13": "karena itu Tuhanmu menimpakan kepada mereka cemeti azab,",
            "verse 89:14": "sesungguhnya Tuhanmu benar-benar mengawasi.",
            "verse 89:15": "Adapun manusia apabila Tuhannya mengujinya lalu dia dimuliakan-Nya dan diberi-Nya kesenangan, maka dia akan berkata: \"Tuhanku telah memuliakanku\".",
            "verse 89:16": "Adapun bila Tuhannya mengujinya lalu membatasi rezekinya maka dia berkata: \"Tuhanku menghinakanku\".",
            "verse 89:17": "Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,",
            "verse 89:18": "dan kamu tidak saling mengajak memberi makan orang miskin,",
            "verse 89:19": "dan kamu memakan harta pusaka dengan cara mencampur baurkan (yang halal dan yang bathil),",
            "verse 89:20": "dan kamu mencintai harta benda dengan kecintaan yang berlebihan.",
            "verse 89:21": "Jangan (berbuat demikian). Apabila bumi digoncangkan berturut-turut,",
            "verse 89:22": "dan datanglah Tuhanmu; sedang malaikat berbaris-baris.",
            "verse 89:23": "Dan pada hari itu diperlihatkan neraka Jahannam; dan pada hari itu ingatlah manusia, akan tetapi tidak berguna lagi mengingat itu baginya.",
            "verse 89:24": "Dia mengatakan: \"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini\".",
            "verse 89:25": "Maka pada hari itu tiada seorangpun yang menyiksa seperti siksa-Nya.",
            "verse 89:26": "dan tiada seorangpun yang mengikat seperti ikatan-Nya.",
            "verse 89:27": "Hai jiwa yang tenang.",
            "verse 89:28": "Kembalilah kepada Tuhanmu dengan hati yang puas lagi diridhai-Nya.",
            "verse 89:29": "Maka masuklah ke dalam jama'ah hamba-hamba-Ku,",
            "verse 89:30": "masuklah ke dalam surga-Ku."
        },
        "Italian": {
            "verse 89:1": "Per l'alba,",
            "verse 89:2": "per le dieci notti,",
            "verse 89:3": "per il pari e per il dispari",
            "verse 89:4": "e per la notte quando trascorre.",
            "verse 89:5": "Non è questo un giuramento per chi ha intelletto?",
            "verse 89:6": "Non hai visto come il tuo Signore ha trattato gli Âd?",
            "verse 89:7": "e Iram dalla colonna,",
            "verse 89:8": "senza eguali tra le contrade,",
            "verse 89:9": "e i Thamûd che scavavano la roccia nella vallata",
            "verse 89:10": "e Faraone, quello dei pali?",
            "verse 89:11": "[Tutti] costoro furono ribelli nel mondo",
            "verse 89:12": "e seminarono la corruzione,",
            "verse 89:13": "e il tuo Signore calò su di loro la frusta del castigo.",
            "verse 89:14": "In verità il tuo Signore è all'erta.",
            "verse 89:15": "Quanto all'uomo, allorché il suo Signore lo mette alla prova onorandolo e colmandolo di favore, egli dice: “Il mio Signore mi ha onorato”.",
            "verse 89:16": "Quando invece lo mette alla prova lesinando i Suoi doni, egli dice: “Il mio Signore mi ha umiliato”.",
            "verse 89:17": "No, siete voi che non onorate l'orfano,",
            "verse 89:18": "che non vi sollecitate vicendevolmente a nutrire il povero,",
            "verse 89:19": "che divorate avidamente l'eredità",
            "verse 89:20": "e amate le ricchezze d'amore smodato.",
            "verse 89:21": "No, quando la terra sarà polverizzata, in polvere fine,",
            "verse 89:22": "e verranno il tuo Signore e gli angeli schiere su schiere,",
            "verse 89:23": "in quel Giorno sarà avvicinata l'Inferno, in quel Giorno l'uomo si rammenterà. Ma a cosa gli servirà rammentarsi?",
            "verse 89:24": "Dirà: “Ahimè! Se avessi mandato avanti qualcosa per la mia vita [futura]!”.",
            "verse 89:25": "In quel Giorno nessuno castigherà come Lui castiga,",
            "verse 89:26": "e nessuno incatenerà come Lui incatena.",
            "verse 89:27": "“O anima ormai acquietata,",
            "verse 89:28": "ritorna al tuo Signore soddisfatta e accetta;",
            "verse 89:29": "entra tra i Miei servi,",
            "verse 89:30": "entra nel Mio Paradiso”."
        },
        "Japanese": {
            "verse 89:1": "暁において，",
            "verse 89:2": "10夜において，",
            "verse 89:3": "偶数と奇数において，",
            "verse 89:4": "去り行く夜において（誓う）。",
            "verse 89:5": "本当にこの中には，分別ある者への誓いがあるではないか。",
            "verse 89:6": "あなたはアッラーが，如何にアード（の民）を処分されたかを考えないのか，",
            "verse 89:7": "円柱の並び立つイラム（の都）のことを，",
            "verse 89:8": "これに類するものは，その国において造られたことはなかったではないか。",
            "verse 89:9": "また谷間の岩に彫り込んだサムード（の民）や，",
            "verse 89:10": "杭のぬしフィルアゥン（のことを考えないのか）。",
            "verse 89:11": "これらは（凡て），その国において法を越えた者たちで，",
            "verse 89:12": "その地に邪悪を増長させた。",
            "verse 89:13": "それであなたの主は，懲罰の鞭をかれらに浴びせかけられた。",
            "verse 89:14": "本当にあなたの主は監視の塔におられる。",
            "verse 89:15": "さて人間は主が御試みのため，寛大にされ恵みを授けられると，かれは，「主は，わたしに寛大であられます。」と言う。",
            "verse 89:16": "だがかれを試み，御恵みを減らされる時は，「主はわたしを，軽視なさいます。」と言う。",
            "verse 89:17": "断じていけない。いや，あなたがたは孤児を大切にしない。",
            "verse 89:18": "また貧者を養うために，互いに励まさない。",
            "verse 89:19": "しかも遺産を取り上げ，強欲を欲しい尽にする。",
            "verse 89:20": "またあなたがたは，法外な愛で財産を愛する。",
            "verse 89:21": "断じていけない。大地が粉々に砕かれる時，",
            "verse 89:22": "主は，列また列の天使（を従え），来臨なされる。",
            "verse 89:23": "また地獄は，その日（目の当たりに）運ばれ，その日人間は反省するであろう。だが反省したとて，どうしてかれのためになろうか。",
            "verse 89:24": "かれは，「ああ，わたしの（将来の）生命のために，（善行を）貯えていたならば。」と言う。",
            "verse 89:25": "それでその日，誰もなし得ない程の懲罰を加えられ，",
            "verse 89:26": "また誰も拘束し得ない程に束縛なされる。",
            "verse 89:27": "（善行を積んだ魂に言われるであろう。）おお，安心，大悟している魂よ，",
            "verse 89:28": "あなたの主に返れ，歓喜し御満悦にあずかって。",
            "verse 89:29": "あなたは，わがしもべの中に入れ。",
            "verse 89:30": "あなたは，わが楽園に入れ。"
        },
        "Jawa": {
            "verse 89:1": "Demi wayah bangun esuk",
            "verse 89:2": "Demi malem tanggal sepuluh (sasi Dzul Hijjah)",
            "verse 89:3": "Demi cacah genep lan cacah ganjil",
            "verse 89:4": "Demi wengi kang kawitan lan wekasan",
            "verse 89:5": "Anggoningsun supata mangkono mau (sing bisa ditampa) wong kang ana akale",
            "verse 89:6": "Sira apa ora andeleng Allah Pangeranira anggone numpes wong ’Aad",
            "verse 89:7": "(Bongsa) Iram, tur padha gagah prakosa lan gedhe dhuwur",
            "verse 89:8": "Kang ing negara (liyane) ora ana kang diparingi kaya mangkono",
            "verse 89:9": "Lan (marang bangsa) Tsamud, kang anatah watu ing jurang - jurang",
            "verse 89:10": "Lan anggone numpes Fir’aun kang duwe bala",
            "verse 89:11": "Kang atindak gumedhe ana ing negara - negara",
            "verse 89:12": "Banget anggone gawe rusak ana ing negarane",
            "verse 89:13": "Allah Pangeranira banjur nurunake siksa warna - warna marang dheweke",
            "verse 89:14": "Satemene Allah Pangeranira angawasake",
            "verse 89:15": "Wondene manungsa iku manawa dicoba dening Pangerane anyoba marang awake, nuli maringi kamulyan lan kamukten banjur kondha, \"Pangeranku mulyakake aku",
            "verse 89:16": "Nanging samongsa dicoba (liyane) banjur rejekine dicumpi banjur kondha, \"Pangeranku anginakake aku",
            "verse 89:17": "Ora! nangeng kowe padha ora gelem welas asih marang bocah yatim",
            "verse 89:18": "Lan ora akon aweh pangan marang wong miskin",
            "verse 89:19": "Lan padha ngukub tinggalane wong mati kelawan banget",
            "verse 89:20": "Lan padha dhemen banget bondho",
            "verse 89:21": "O, samongsa bumi rinemuk ajur - mumur",
            "verse 89:22": "Parentahe Pangeranira kaleksanan lan malaekat jejer - jejer",
            "verse 89:23": "Ing dina iku neraka Jahan ditekakake. Ing dina iku wong bakal eling nanging apa gunae eling iku",
            "verse 89:24": "Dheweke bakal kondha, \"O, bok aku iki biyen duwea ngamal kanggo uripku saiki iki",
            "verse 89:25": "Ing dina iki ora ana wong bisa nguasani siksaning Allah",
            "verse 89:26": "Lan ora wong bisa nyentosani kaya anggone nyentosani Allah",
            "verse 89:27": "E, jiwa kang tentrem",
            "verse 89:28": "Sira baliya seba ing ngarsane Pangeranira, kelawan lega, tampa ganjaran, tur kalilan marga saka lakunira becik",
            "verse 89:29": "Sira malebua golongane para kawulaningsun kang becik",
            "verse 89:30": "Lan malebua ing suwarganingsun"
        },
        "Kazakh": {
            "verse 89:1": "Таңғы араймен ант етемін",
            "verse 89:2": "Әрі он түнмен",
            "verse 89:3": "және жұп әрі тақпен",
            "verse 89:4": "және өтіп бара жатқан түнмен ант етемін",
            "verse 89:5": "Міне осылар, ақылына иелік ететіндер үшін жеткілікті ант емес пе",
            "verse 89:6": "Ей, Мұхаммед! Раббыңның адтықтармен не істегенін көрмедің бе",
            "verse 89:7": "ұзын бағаналары бар Ирамға",
            "verse 89:8": "Олардың ұқсасы басқа елдерде жасалмаған еді",
            "verse 89:9": "Әрі ойпаттарда жартастарды ойған сәмұдтықтарға",
            "verse 89:10": "және қазықтар иесі Фиръаунға",
            "verse 89:11": "Олар елдерде шектен шығып",
            "verse 89:12": "әрі онда бұзықтықты көбейткен еді",
            "verse 89:13": "Сонда Раббың Оларға азап қамшысын жаудырды",
            "verse 89:14": "Анығында, Раббың сөзсіз бақылап тұрушы",
            "verse 89:15": "Адамды Раббысы сынап, оны құрметтесе және игілікке бөлесе, ол: «Раббым мені кұрметтеді»,- дейді",
            "verse 89:16": "Ал, қашан оны сынап, ризық-несбесін тарылтса, онда ол: «Раббым мені қорлады»,- дейді",
            "verse 89:17": "Жоқ, олай емес! Сендер жетімге ізет көрсетпейсіңдер",
            "verse 89:18": "және кедейді тамақтандыруға бір-біріңді қызықтырып, түрткіболмайсыңдар",
            "verse 89:19": "әрі мирасты бөлмей, өздерің жейсіңдер",
            "verse 89:20": "Сондай-ақ дүние-мүлікті өте қатты жақсы көресіңдер",
            "verse 89:21": "Жоқ, олай емес! Жер сілкініп теп-тегіс болған кезде",
            "verse 89:22": "әрі Раббың және сап-сап болып періштелер келген кезде",
            "verse 89:23": "және ол күні Жаһаннам келтірілген кезде міне, сол күні адам еске түсіреді. Алайда, еске түсіруден оған не пайда",
            "verse 89:24": "Ол: «Әттең! Өмірім үшін ізгі амалдар жіберген болсам еді»,- дейді",
            "verse 89:25": "Сол күні Оның азабындай, ешкім де азаптай алмайды",
            "verse 89:26": "әрі Оның бұғаулап байлағанындай ешкім байлай алмайды",
            "verse 89:27": "Ей, орнығып, тыныштық тапқан жан",
            "verse 89:28": "Раббыңа разы болған және разылығын алған күйде қайт",
            "verse 89:29": "Енді құлдарымның қатарына кір",
            "verse 89:30": "Әрі Менің жәннатыма кір"
        },
        "Korean": {
            "verse 89:1": "새벽의 여명기를 두고 맹세하사새벽의 여명기를 두고 맹세하사",
            "verse 89:2": "열흘 동안의 밤을 두고 맹세 하며열흘 동안의 밤을 두고 맹세 하며",
            "verse 89:3": "짝수와 홀수를 두고 맹세하며짝수와 홀수를 두고 맹세하며",
            "verse 89:4": "사라지는 밤을 두고 맹세하니사라지는 밤을 두고 맹세하니",
            "verse 89:5": "실로 그 안에는 이해하는 자 들을 위한 예증이 있노라실로 그 안에는 이해하는 자 들을 위한 예증이 있노라",
            "verse 89:6": "주님께서 아드 백성에 행한 이야기와주님께서 아드 백성에 행한 이야기와",
            "verse 89:7": "높은 빌딩을 소유한 이람의 백성에 관한 얘기를 아느뇨높은 빌딩을 소유한 이람의 백성에 관한 얘기를 아느뇨",
            "verse 89:8": "그와 같은 힘센 백성이 대지 위에서 창조된 적이 없었노라그와 같은 힘센 백성이 대지 위에서 창조된 적이 없었노라",
            "verse 89:9": "산의 바위로 계곡에 집을 세 운 사무드 백성의 이야기와산의 바위로 계곡에 집을 세 운 사무드 백성의 이야기와",
            "verse 89:10": "강한 군대를 가진 오만한 파라오의 이야기를 아느뇨강한 군대를 가진 오만한 파라오의 이야기를 아느뇨",
            "verse 89:11": "실로 이들 모두는 도읍에서 죄악을 낳고실로 이들 모두는 도읍에서 죄악을 낳고",
            "verse 89:12": "그곳에서 해악을 더해만 갔 으니그곳에서 해악을 더해만 갔 으니",
            "verse 89:13": "주님께서 그들 위에 여러가 지의 응벌을 내렸노라주님께서 그들 위에 여러가 지의 응벌을 내렸노라",
            "verse 89:14": "실로 그대 주님은 항상 감시하고 계시니라실로 그대 주님은 항상 감시하고 계시니라",
            "verse 89:15": "주님께서 인간을 시험삼아 명예와 은혜를 베풀면 이것은 주 께서 내게 영광을 주시었노라 하 더라주님께서 인간을 시험삼아 명예와 은혜를 베풀면 이것은 주 께서 내게 영광을 주시었노라 하 더라",
            "verse 89:16": "그분께서 일용할 양식을 감 소하실 때면 주께서 나를 처량하 게 만드시도다 말하고 있으나그분께서 일용할 양식을 감 소하실 때면 주께서 나를 처량하 게 만드시도다 말하고 있으나",
            "verse 89:17": "그렇지 아니함이라 너희는 고아들에게 은혜를 베풀지 아니했으며그렇지 아니함이라 너희는 고아들에게 은혜를 베풀지 아니했으며",
            "verse 89:18": "가난한 자들에게 음식을 제공함에 서로가 서로에게 격려하지아니하며가난한 자들에게 음식을 제공함에 서로가 서로에게 격려하지아니하며",
            "verse 89:19": "오히려 너희는 욕심을 내어그들의 유산을 삼키고오히려 너희는 욕심을 내어그들의 유산을 삼키고",
            "verse 89:20": "오만하게 재물만을 사랑하였노라오만하게 재물만을 사랑하였노라",
            "verse 89:21": "그러나 대지가 산산조각이 되고그러나 대지가 산산조각이 되고",
            "verse 89:22": "주님이 임하시고 그분의 천 사들이 줄지어 나을 때주님이 임하시고 그분의 천 사들이 줄지어 나을 때",
            "verse 89:23": "그날은 지옥이 나타나니라 그날 인간은 그의 업적을 상기하 나 그의 회고가 어떻게 그를 유 익하게 하겠느뇨그날은 지옥이 나타나니라 그날 인간은 그의 업적을 상기하 나 그의 회고가 어떻게 그를 유 익하게 하겠느뇨",
            "verse 89:24": "그때야 인간은 내 미래의 생을 위하여 선행을 xCg어야 xCg는데 라고 한탄하여 말하나그때야 인간은 내 미래의 생을 위하여 선행을 xC2g어야 xC2g는데 라고 한탄하여 말하나",
            "verse 89:25": "그날은 어느 누구도 가할 수없는 하나님의 응벌만이 있을 것 이라그날은 어느 누구도 가할 수없는 하나님의 응벌만이 있을 것 이라",
            "verse 89:26": "어느 누구도 할 수 없는 그 분의 속박이 있으리라어느 누구도 할 수 없는 그 분의 속박이 있으리라",
            "verse 89:27": "의로운 영혼들에게는 영혼들 아 너희는 완전한 휴식과 기쁨속 에 있으리라 라는 말씀과의로운 영혼들에게는 영혼들 아 너희는 완전한 휴식과 기쁨속 에 있으리라 라는 말씀과",
            "verse 89:28": "기뻐하고 즐거워하며 주님께 로 돌아가기뻐하고 즐거워하며 주님께 로 돌아가",
            "verse 89:29": "나와 함께 하는 자들 가운데들어와나와 함께 하는 자들 가운데들어와",
            "verse 89:30": "나의 천국으로 들라는 말씀 이 있을 것이라나의 천국으로 들라는 말씀 이 있을 것이라"
        },
        "Kurdish": {
            "verse 89:1": "Bi Segura (sibehê)سوێند به به‌ره‌به‌یان.",
            "verse 89:2": "Bi wan deh şevê (bi nev û nîşan)سوێندم به‌و شه‌وانه‌ی که ده شه‌ون (هه‌ندێک ده‌ڵێن ده شه‌وی کۆتایی ڕه‌مه‌زانه‌، هه‌ندێکیش ده‌ڵێن ده شه‌وی سه‌ره‌تای مانگی ذی الحجه‌یه که کاتی ئه‌نجامدانی حه‌جه‌، هه‌ردوو بۆنه‌که‌ش پیرۆزن).",
            "verse 89:3": "(Bi hemî afırandê) zo û kitسوێند به ئه‌و شتانه که جووتن، هه‌روه‌ها سوێند به هه‌موو ئه‌و شتانه‌ی که تاکن (یاخود سوێند به شه‌وه جووت و شه‌وه تاکه‌کان)",
            "verse 89:4": "Û bi şevê gava di çeبه هه‌موو شه‌وێک کاتێک تێده‌په‌ڕێت (له سه‌ره‌نجامی سوڕانه‌وه‌ی زه‌وی به‌ده‌وری خۆیدا).",
            "verse 89:5": "Ji bona xayî hişan ra bi rastî di vane borî da sond û ewletî heyeئایا له‌و شتانه‌دا سوێندی شایسته نییه بۆ که‌سێك خاوه‌نی عه‌قڵ و بیروهۆش بێت؟!",
            "verse 89:6": "Maqey tu nabînî, ku Xuda yê te komalê Ad ça şapat kirîyeئایا نه‌تزانیووه په‌روه‌ردگاری تۆ چی کرد به هۆزی عاد.",
            "verse 89:7": "Ewan (komelekî wusa bi hêz bûn) wekî sitûnan bilind bûnکه ئه‌ویش هۆزی (ارم) و خاوه‌نی پایه‌ی به‌رزو کۆڵه‌که و نیرگه‌ی درێژ بوون (قه‌ومی عاد له شاری ئیره‌م که باڵابه‌رزو تێکسمڕاو بوون، خانووبه‌ره و کۆشک و ته‌لاری گه‌وره و به‌رزیان دروست ده‌کرد).",
            "verse 89:8": "Ewan (komalên wusa bûn e) ku wekî wan tu komal di welatan da ne hatine afirandinêله سه‌رده‌می ئه‌واندا له هیچ شار و شوێنێکدا، کۆشك و ته‌لاری وه‌ک ئه‌وه‌ی ئه‌وان دروست نه‌کراوه‌.",
            "verse 89:9": "Û ewan Semûdîne di newalan da, zinar qul dikirin (ji bo ku ji xwe ra xanîyan ava bikin, Xuda yê te ça şapat kirîye)ئایا نه‌تزانیووه قه‌ومی ثمودیش خوا چی لێکردن، ئه‌وانه‌ی له دۆڵ و شیوه‌کانه‌وه به‌ردیان ده‌تاشی و ده‌یانگواسته‌وه بۆ ناو قه‌دی چیاکان و له‌وێ خانوویان دروست ده‌کرد؟",
            "verse 89:10": "Û (Xuda yê te) Fir´ewn ê xwedîyê hêz û singê jî ça şapat kirîyeهه‌روه‌ها فیرعه‌ونی خاوه‌ن ئه‌هرامه‌کان، (چ کۆشک و بینایه‌کی مه‌حکه‌میان وه‌کو مێخ داده‌کوتی به زه‌ویدا).",
            "verse 89:11": "Ewan di welatan da (bi zorbetî) ji ava rû derketibûnئه‌وانه‌ی که سته‌میان به‌رپاکرد له وڵاتداو خه‌ڵکیان ده‌چه‌وسانه‌وه‌.",
            "verse 89:12": "Îdî ewan di welatan da pir cewr kiribûn eجا خراپه و تاوان و گوناهی زۆریان ئه‌نجامده‌دا.",
            "verse 89:13": "Xuda yê te jî, îdî li ser wan da şapatek e zor rijandîye(دوای ماوه‌یه‌کی دیاریکراو) په‌روه‌ردگاری تۆ سزاو خه‌شـم و قینی خۆی ڕژاند به‌سه‌ریاندا و ته‌فرو تونای کردن.",
            "verse 89:14": "Loma bi rastî Xuda yê te (di hemû deman da) dîdevanê (bendeyê xwe ye)به‌ڕاستی په‌روه‌ردگاری تۆ هه‌میشه و به‌رده‌وام ئاماده‌یه که تۆڵه له سته‌مکاران بسێنێت.",
            "verse 89:15": "Îdî gava Xuda bivê, ku merivan biceribîn e; ewa merivê, ku Xuda yê wî ji bona wî ra berxudarî dabe (aha) bêje bi rastî Xuda yê min ji min ra qencî kirîyeجا کاتێک ئاده‌میزاد له‌لایه‌ن په‌روه‌ردگاریه‌وه تاقی ده‌کرێته‌وه‌، زێزی لێ ده‌نێت و نازو نیعمه‌تی به‌سه‌ردا ده‌ڕێژێت، ده‌ڵێت: (به خوا وا دیاره‌) په‌روه‌ردگارم خۆشی ده‌وێم ڕێزم هه‌یه لای.",
            "verse 89:16": "Lê gava Xuda yê wî ewî bi ceribîne,îdî rojînê wî kêm bike û bê pêar bike îdî ewa jî (aha) di bêje: \"Bi rastî xuda yê min, ez riswa kirimeبه‌ڵام کاتێک تاقی ده‌کاته‌وه و ڕزق و ڕۆزی که‌می پێده‌به‌خشێت و لێی ده‌گرێته‌وه ده‌ڵێت: وا دیاره په‌روه‌ردگارم منی خۆش ناوێت و ڕقی لێمه و ڕیسوای کردووم.",
            "verse 89:17": "Na! (bi gotina we nîne) lê hûn (gelî merivan!) rûmeta sêwyan na girinنه‌خێر ئه‌و شتانه‌، هیچی وا نیه‌، (نه‌به‌خشین مانی ڕێز و قه‌دره‌، نه‌لێگرتنه‌وه مانای بێ ڕێزی و بێ قه‌درییه‌، به‌ڵکو ئێوه (سه‌ره‌ڕای ئه‌و بیرو بۆچوونه چه‌وتانه‌تان) ڕێزی هه‌تیو ناگرن ونازی پێناده‌ن.",
            "verse 89:18": "Û hûn ji bona xurek dana belengazan helana nadene hevهانی یه‌کتر ناده‌ن بۆ ئه‌وه‌ی خۆراک ببه‌خشن به‌هه‌ژار و نه‌داران.",
            "verse 89:19": "Û hûn mîratê qe ji hev naraqetînin, hemî tevê hev dixunمیڕاتی ده‌خۆن و هه‌مووی ده‌ماشنه‌وه (حه‌ق خزمان و نه‌دارانی لێ ناده‌ن).",
            "verse 89:20": "Û hûn ji civandina mal pir hez dikinماڵ و سامان و دارایشتان زۆر خۆشده‌وێت (ره‌چاوی حه‌ڵاڵ و حه‌رام ناکه‌ن).",
            "verse 89:21": "Na! (evan kirinê we rast nînin) gava zemîn hejîya bû tozنه‌خێر، (هه‌ر ئاوا بۆتان نالوێت)، کاتێك دێت که زه‌وی ورد و خاش ده‌کرێت و له‌ناکاو ده‌درێت به‌یه‌کدا.",
            "verse 89:22": "Û (gava) Xuda yê te hat; ferişte bi gargî rêz bûnپه‌روه‌ردگارت دێت و فریشته‌کانیش پۆل پۆل (هاتنی په‌روه‌ردگاری مه‌زن خۆی نه‌بێت که‌س نازانێت چۆنه‌).",
            "verse 89:23": "Di wê rojê da doj jî hatîye anînê. Di wê rojê da meriv kirinê xwe tîne bîra xwe, îdî (di wê rojê da) bîranîna wî ji bona wî ra wê ça kêrê wî wereئه‌و ڕۆژه دۆزه‌خ ده‌هێنرێت و نیشان ده‌درێت، جا ئه‌و ڕۆژه (ئاده‌میزادی بێ باوه‌ڕ) ده‌زانێت چ په‌ندێکی به‌سه‌ر خۆی هێناوه‌، به‌ڵام تازه به‌خۆدا هاتنه‌وه و په‌شیمانی هیچ سوودێکی نیه و دادی نادات؟!",
            "verse 89:24": "(Di wê gavê da meriv aha) di bêje: \"Xwezîka min ji bona vê jîna xwe ra hêj di berê da (qencî) şandibûnan(ئه‌وسا به که‌ساسی و هه‌ناسه‌ی سارده‌وه‌‎) ده‌ڵێت: خۆزگه بۆ ئه‌م ژیانه‌م ده‌ست پێشخه‌ریم بکردایه‌.",
            "verse 89:25": "Îdî di wê rojê da wekî şapata (Yezdan) qe tu kes şapatê nakeجا ئیتر ئه‌و ڕۆژه که‌س وه‌ک خوا به‌خشم و قین نیه له بێ باوه‌ڕان، له‌به‌رئه‌وه سزایه‌کیان ده‌دات که که‌س ناتوانێت سزای له‌و چه‌شنه بدات.",
            "verse 89:26": "Û tu kes jî wekî girêdana (Yezdan) girêdanê nakeکه‌سیش وه‌ک ئه‌و زاته (بێ باوه‌ڕان) نابه‌ستێته‌وه و به‌ندیان ناکات.",
            "verse 89:27": "Gelî canê rawestîyayê hewda î(شایانی باسه به ئیماندارای سه‌رفراز له سه‌ره‌مه‌رگدا ده‌وترێت) ئه‌ی خاوه‌نی دڵ و ده‌روونی پڕ له ئارامی (ئه‌ی ئاده‌میزادی ژیر و هۆشمه‌ند که له ته‌مه‌نی کۆتای دنیادا په‌روه‌ردگارت ناسی و به‌جوانی ده‌تپه‌رست...).",
            "verse 89:28": "Tu li bal Xuda yê xwe da bi qayîlî bizvireبگه‌ڕێره‌وه بۆ لای په‌روه‌ردگارت که تۆ له‌و ڕازیت و ئه‌ویش له تۆ ڕازیه‌.",
            "verse 89:29": "Îdî tu bikeve nava bendenê minê (xurî)ده بچۆره ڕیزی به‌نده چاکه نازدار و به‌ڕێزه‌کانمه‌وه‌.",
            "verse 89:30": "Û tu bikeve behişta minبچۆره به‌هه‌شته خۆشه ڕازاوه‌که‌مه‌وه‌."
        },
        "Kyrgyz": {
            "verse 89:1": "Таңгаант",
            "verse 89:2": "Онтүнгөант",
            "verse 89:3": "Жуп менен такка ант",
            "verse 89:4": "Жана өтүп жаткан түнгө ант",
            "verse 89:5": "Ушул(айтылганд)арда акылдуу адам үчүн (канааттандырарлык) ант бар болсо керек эле",
            "verse 89:6": "Раббиң Аад коомун эмне кылганын көрбөдүңбү",
            "verse 89:7": "(Түркүктүү Ирамды) (эмне кылганынчы)",
            "verse 89:8": "Ага окшогону эч бир өлкөдө жаратылбаган эле",
            "verse 89:9": "Жана өрөөндө (үй куруу үчүн) аска зоолорду ойгон Самуд коомун (Раббиң эмне кылганын көрбөдүңбү)",
            "verse 89:10": "Кубаттуу аскерлердин ээси Фираунду (кандай жазалаганын көрбөдүңбү)",
            "verse 89:11": "Алар (ар кайсы) өлкөлөрдө чектен чыгып кетишкен",
            "verse 89:12": "жана бузукулукту көбөйтүшкөн болчу",
            "verse 89:13": "Раббиң алардын башына ар түрдүү азаптарды жаадырды",
            "verse 89:14": "Чынында, Раббиң көзөмөлдөп туруучу",
            "verse 89:15": "Раббиси инсанды (байлык менен) сынап, ага жоомарттык көргөзсө жана нээмат берсе “Раббим мени урматтады” дейт",
            "verse 89:16": "Ал эми, аны (кембагалдык менен) сынап, ырыскысын ченеп берсе, “Раббим мени кордоду” дейт",
            "verse 89:17": "Жок! Силер жетимди ызааттабайсыңар",
            "verse 89:18": "Кедейди тамактандырууга (бири-бириңерди) үгүттөбөйсүңөр",
            "verse 89:19": "Жана (жетимге тиешелүү) мурасты суктук менен жейсиңер",
            "verse 89:20": "Жана мал-дүйнөнү жан-дилиңер менен сүйөсүңөр",
            "verse 89:21": "Жок! Качан (Кыямат башталып) жер катуу титирегенде",
            "verse 89:22": "жана Раббиң менен периштелер сап-сап болуп келгенде",
            "verse 89:23": "Ошол күнү тозок жакын алып келингенде, дал ошол күнү гана (каапыр) инсан (бул дүйнөдөгү каталарын) эстейт. Бирок, эми (бул) эстөө ага пайда берсе кана",
            "verse 89:24": "(Ошондо ал) “Кана эми, (Акыреттеги) жашоомо (кандайдыр сооп) алып келген болсом!” дейт",
            "verse 89:25": "Ал күнү Аллаһ азаптагандай эч ким азаптай албайт",
            "verse 89:26": "Аллаһ байлагандай эч ким байлай албайт",
            "verse 89:27": "О,тынч- бейпил жан",
            "verse 89:28": "(Менден) ыраазы болгон жана (Мени) ыраазы кылган абалда Раббиңе кайткын",
            "verse 89:29": "Менин (жакшы) пенделериме кошулгун",
            "verse 89:30": "жана Менин Бейишиме киргин"
        },
        "Malay": {
            "verse 89:1": "Demi waktu fajar;",
            "verse 89:2": "Dan malam yang sepuluh (yang mempunyai kelebihan di sisi Allah);",
            "verse 89:3": "Dan bilangan yang genap serta yang ganjil;",
            "verse 89:4": "Dan malam, apabila ia berlalu; -",
            "verse 89:5": "Bukankah yang demikian itu mengandungi sumpah (yang diakui kebenarannya) oleh orang yang berakal sempurna?",
            "verse 89:6": "(Kami tetap akan membinasakan orang-orang yang menentangmu wahai Muhammad), tidakkah engkau perhatikan, bagaimana Tuhanmu telah melakukan terhadap kaum Aad (yang kufur derhaka)",
            "verse 89:7": "Iaitu penduduk \"Iram\" yang mempunyai bangunan-bangunan yang tinggi tiangnya, (sesuai dengan penduduknya)",
            "verse 89:8": "Yang belum pernah diciptakan sepertinya (tentang besar dan kukuhnya) di segala negeri (pada zamannya)?",
            "verse 89:9": "Dan (terhadap) kaum Thamud yang memahat batu-batu besar di lembah (Wadil-Qura iaitu tempat tinggalnya)?",
            "verse 89:10": "Dan (terhadap) Firaun yang menguasai bangunan-bangunan yang handal kukuh?",
            "verse 89:11": "(Semuanya itu ialah) orang-orang yang telah bermaharajalela di negeri (masing-masing).",
            "verse 89:12": "Lalu mereka melakukan dengan banyaknya kerosakan dan bencana di negeri-negeri itu.",
            "verse 89:13": "Dengan yang demikian, Tuhanmu mencurahkan ke atas mereka berbagai paluan azab;",
            "verse 89:14": "Sesungguhnya Tuhanmu tetap mengawas dan membalas, (terutama balasan akhirat)",
            "verse 89:15": "(Dalam pada itu manusia tidak menghiraukan balasan akhirat), oleh yang demikian, maka kebanyakan manusia apabila diuji oleh Tuhannya dengan dimuliakan dan dimewahkan hidupnya, (ia tidak mahu bersyukur tetapi terus bersikap takbur) serta berkata dengan sombongnya: \"Tuhanku telah memuliakan daku!\"",
            "verse 89:16": "Dan sebaliknya apabila ia diuji oleh Tuhannya, dengan disempitkan rezekinya, (ia tidak bersabar bahkan ia resah gelisah) serta merepek dengan katanya: \"Tuhanku telah menghinakan daku!\"",
            "verse 89:17": "Jangan demikian, (sebenarnya kata-kata kamu itu salah). Bahkan (perbuatan kamu wahai orang-orang yang hidup mewah, lebih salah lagi kerana) kamu tidak memuliakan anak yatim, (malah kamu menahan apa yang Ia berhak menerimanya);",
            "verse 89:18": "Dan kamu tidak menggalakkan untuk memberi makanan (yang berhak diterima oleh) orang miskin;",
            "verse 89:19": "Dan kamu sentiasa makan harta pusaka secara rakus (dengan tidak membezakan halal haramnya),",
            "verse 89:20": "Serta kamu pula sayangkan harta secara tamak haloba!",
            "verse 89:21": "Jangan sekali-kali bersikap demikian! (Sebenarnya) apabila bumi (dihancurkan segala yang ada di atasnya dan) diratakan serata-ratanya,",
            "verse 89:22": "Dan (perintah) Tuhanmu pun datang, sedang malaikat berbaris-baris (siap sedia menjalankan perintah),",
            "verse 89:23": "Serta diperlihatkan neraka Jahannam pada hari itu, (maka) pada saat itu manusia akan ingat (hendak berlaku baik), dan bagaimana ingatan itu akan berguna lagi kepadanya?",
            "verse 89:24": "Ia akan berkata: \"Alangkah baiknya kalau aku dahulu sediakan amal-amal baik untuk hidupku (di sini)!\"",
            "verse 89:25": "Maka pada hari itu tiada sesiapapun yang dapat menyeksa seperti azab (yang ditimpakan oleh) Allah.",
            "verse 89:26": "Dan tiada sesiapapun yang dapat mengikat serta membelenggu seperti ikatan dan belengguNya.",
            "verse 89:27": "(Setelah menerangkan akibat orang-orang yang tidak menghiraukan akhirat, Tuhan menyatakan bahawa orang-orang yang beriman dan beramal soleh akan disambut dengan kata-kata): \"Wahai orang yang mempunyai jiwa yang sentiasa tenang tetap dengan kepercayaan dan bawaan baiknya! -",
            "verse 89:28": "\"Kembalilah kepada Tuhanmu dengan keadaan engkau berpuas hati (dengan segala nikmat yang diberikan) lagi diredhai (di sisi Tuhanmu) ! -",
            "verse 89:29": "\"Serta masuklah engkau dalam kumpulan hamba-hambaku yang berbahagia -",
            "verse 89:30": "\"Dan masuklah ke dalam SyurgaKu! \""
        },
        "Malayalam": {
            "verse 89:1": "പ്രഭാതം തന്നെയാണ സത്യം.",
            "verse 89:2": "പത്തു രാത്രികള്‍ തന്നെയാണ സത്യം.",
            "verse 89:3": "ഇരട്ടയും ഒറ്റയും തന്നെയാണ സത്യം",
            "verse 89:4": "രാത്രി സഞ്ചരിച്ച് കൊണ്ടിരിക്കെ അത് തന്നെയാണ സത്യം.",
            "verse 89:5": "അതില്‍ (മേല്‍ പറഞ്ഞവയില്‍) കാര്യബോധമുള്ളവന്ന് സത്യത്തിന് വകയുണേ്ടാ?",
            "verse 89:6": "ആദ് സമുദായത്തെ കൊണ്ട് നിന്‍റെ രക്ഷിതാവ് എന്തു ചെയ്തുവെന്ന് നീ കണ്ടില്ലേ?",
            "verse 89:7": "അതായത് തൂണുകളുടെ ഉടമകളായ ഇറം ഗോത്രത്തെ കൊണ്ട്‌",
            "verse 89:8": "തത്തുല്യമായിട്ടൊന്ന് രാജ്യങ്ങളില്‍ സൃഷ്ടിക്കപ്പെട്ടിട്ടില്ലാത്ത ഗോത്രം.",
            "verse 89:9": "താഴ്‌വരയില്‍ പാറവെട്ടി കെട്ടിടമുണ്ടാക്കിയവരായ ഥമൂദ് ഗോത്രത്തെക്കൊണ്ടും",
            "verse 89:10": "ആണികളുടെ ആളായ ഫിര്‍ഔനെക്കൊണ്ടും.",
            "verse 89:11": "നാടുകളില്‍ അതിക്രമം പ്രവര്‍ത്തിക്കുകയും",
            "verse 89:12": "അവിടെ കുഴപ്പം വര്‍ദ്ധിപ്പിക്കുകയും ചെയ്തവരാണവര്‍.",
            "verse 89:13": "അതിനാല്‍ നിന്‍റെ രക്ഷിതാവ് അവരുടെ മേല്‍ ശിക്ഷയുടെ ചമ്മട്ടി വര്‍ഷിച്ചു.",
            "verse 89:14": "തീര്‍ച്ചയായും നിന്‍റെ രക്ഷിതാവ് പതിയിരിക്കുന്ന സ്ഥാനത്തു തന്നെയുണ്ട്‌.",
            "verse 89:15": "എന്നാല്‍ മനുഷ്യനെ അവന്‍റെ രക്ഷിതാവ് പരീക്ഷിക്കുകയും അങ്ങനെ അവനെ ആദരിക്കുകയും അവന് സൌഖ്യം നല്‍കുകയും ചെയ്താല്‍ അവന്‍ പറയും; എന്‍റെ രക്ഷിതാവ് എന്നെ ആദരിച്ചിരിക്കുന്നു എന്ന്‌.",
            "verse 89:16": "എന്നാല്‍ അവനെ (മനുഷ്യനെ) അവന്‍ പരീക്ഷിക്കുകയും എന്നിട്ടവന്‍റെ ഉപജീവനം ഇടുങ്ങിയതാക്കുകയും ചെയ്താല്‍ അവന്‍ പറയും; എന്‍റെ രക്ഷിതാവ് എന്നെ അപമാനിച്ചിരിക്കുന്നു എന്ന്‌.",
            "verse 89:17": "അല്ല, പക്ഷെ നിങ്ങള്‍ അനാഥയെ ആദരിക്കുന്നില്ല.",
            "verse 89:18": "പാവപ്പെട്ടവന്‍റെ ആഹാരത്തിന് നിങ്ങള്‍ പ്രോത്സാഹനം നല്‍കുന്നുമില്ല.",
            "verse 89:19": "അനന്തരാവകാശ സ്വത്ത് നിങ്ങള്‍ വാരിക്കൂട്ടി തിന്നുകയും ചെയ്യുന്നു.",
            "verse 89:20": "ധനത്തെ നിങ്ങള്‍ അമിതമായ തോതില്‍ സ്നേഹിക്കുകയും ചെയ്യുന്നു.",
            "verse 89:21": "അല്ല, ഭൂമി പൊടിപൊടിയായി പൊടിക്കപ്പെടുകയും,",
            "verse 89:22": "നിന്‍റെ രക്ഷിതാവും, അണിയണിയായി മലക്കുകളും വരുകയും,",
            "verse 89:23": "അന്ന് നരകം കൊണ്ടു വരപ്പെടുകയും ചെയ്താല്‍! അന്നേ ദിവസം മനുഷ്യന്ന് ഓര്‍മ വരുന്നതാണ്‌. എവിടെനിന്നാണവന്ന് ഓര്‍മ വരുന്നത്‌?",
            "verse 89:24": "അവന്‍ പറയും. അയ്യോ, ഞാന്‍ എന്‍റെ ജീവിതത്തിനു വേണ്ടി മുന്‍കൂട്ടി (സല്‍കര്‍മ്മങ്ങള്‍) ചെയ്തുവെച്ചിരുന്നെങ്കില്‍ എത്ര നന്നായിരുന്നേനെ!",
            "verse 89:25": "അപ്പോള്‍ അന്നേ ദിവസം അല്ലാഹു ശിക്ഷിക്കുന്നപ്രകാരം ഒരാളും ശിക്ഷിക്കുകയില്ല.",
            "verse 89:26": "അവന്‍ പിടിച്ചു ബന്ധിക്കുന്നത് പോലെ ഒരാളും പിടിച്ചു ബന്ധിക്കുന്നതുമല്ല.",
            "verse 89:27": "ഹേ; സമാധാനമടഞ്ഞ ആത്മാവേ,",
            "verse 89:28": "നീ നിന്‍റെ രക്ഷിതാവിങ്കലേക്ക് തൃപ്തിപ്പെട്ടുകൊണ്ടും, തൃപ്തി ലഭിച്ചു കൊണ്ടും മടങ്ങിക്കൊള്ളുക.",
            "verse 89:29": "എന്നിട്ട് എന്‍റെ അടിയാന്‍മാരുടെ കൂട്ടത്തില്‍ പ്രവേശിച്ചു കൊള്ളുക.",
            "verse 89:30": "എന്‍റെ സ്വര്‍ഗത്തില്‍ പ്രവേശിച്ചു കൊള്ളുക."
        },
        "Norwegian": {
            "verse 89:1": "Ved morgengryet!",
            "verse 89:2": "Ved ti netter!",
            "verse 89:3": "Ved det like og det ulike!",
            "verse 89:4": "Ved natten når den svinner hen!",
            "verse 89:5": "Er det ikke i dette en ed for den som har innsikt?",
            "verse 89:6": "Du har vel sett hva Herren gjorde med folket Ad?",
            "verse 89:7": "Med det søylerike Iram,",
            "verse 89:8": "hvis like ikke er skapt i verden?",
            "verse 89:9": "Og med folket Thamod, som hugget seg inn i fjellsiden i dalen?",
            "verse 89:10": "Og Farao, han med pyramidene?",
            "verse 89:11": "De som vandret i overmot på jorden,",
            "verse 89:12": "og spredte ufred og fordervelse?",
            "verse 89:13": "Men Herren lot tuktens svepe ramme dem!",
            "verse 89:14": "Herren er på vakt!",
            "verse 89:15": "Når Herren setter mennesket på prøve ved ære og velstand, sier det: «Herren har hedret meg!»",
            "verse 89:16": "Men hvis Han setter det på prøve ved å utmåle knapt hans levemåte, så sier det: «Herren ringeakter meg!»",
            "verse 89:17": "Nei, sannelig, men dere hedrer ikke den faderløse",
            "verse 89:18": "og ansporer ikke til å gi den fattige mat,",
            "verse 89:19": "dere sluker grådig hans lille arv.",
            "verse 89:20": "Dere elsker rikdom over all måte.",
            "verse 89:21": "Nei, sannelig! Når jorden jevnes til støv,",
            "verse 89:22": "når Herren kommer, og englene, rekke etter rekke,",
            "verse 89:23": "når helvete bringes frem, på denne dag vil mennesket saktens erindre. Men hva tjener det da til med ettertanke?",
            "verse 89:24": "Og det vil si: «Om jeg bare hadde sendt i forveien noe godt for mitt liv!»",
            "verse 89:25": "Ingen kan straffe som Han gjør på denne dag.",
            "verse 89:26": "Ingen lenker slik som Han.",
            "verse 89:27": "Du sjel, som har ro og harmoni,",
            "verse 89:28": "vend tilbake til din Herre tilfreds og godtatt:",
            "verse 89:29": "Gå inn blant Mine tjenere!",
            "verse 89:30": "Gå inn i Mitt paradis!"
        },
        "Pashto": {
            "verse 89:1": "قسم دى په فجر (سبا) باندې",
            "verse 89:2": "او په لسو شپو باندې",
            "verse 89:3": "او په جفت او طاق باندې",
            "verse 89:4": "او په شپه باندې كله چې روانه وي",
            "verse 89:5": "ایا په دغو (قسمونو) كې خاوند د عقل لره (كوم قانع كوونكى) قسم شته؟",
            "verse 89:6": "ایا تا نه دي كتلي چې ستا رب څه وكړل له ’’قوم عاد‘‘ سره؟",
            "verse 89:7": "چې ارم و د ستنو والا",
            "verse 89:8": "هغه چې په ښارونو كې د دوى په مثل نه و پیدا كړى شوي",
            "verse 89:9": "او ثمودیانو سره (يې څه وكړل) هغه چې په دره كې يې تیګې غوڅې كړې (تراشلې) وې؟",
            "verse 89:10": "او له میخونو والا فرعون سره (يې څه وكړل)",
            "verse 89:11": "هغه كسان چې دوى په ښارونو كې سركشي كړې وه",
            "verse 89:12": "نو په دغو كې يې فساد ډېر كړى و",
            "verse 89:13": "نو ستا رب په دوى باندې د عذاب قمچینه (كروړه) نازله كړه",
            "verse 89:14": "بېشكه ستا رب یقینًا په ځاى د انتظار كې دى",
            "verse 89:15": "نو هر چې انسان دى، كله چې ده لره خپل رب وازمايي، پس ده ته عزت وركړي او ده ته نعمت وركړي، نو دى وايي: زما رب ما ته عزت راكړ",
            "verse 89:16": "او خو هر كله چې دى وازمايي، پس په ده باندې د ده رزق تنګ كړي، نو دى وايي: زما رب زه سپك كړم",
            "verse 89:17": "داسې نه ده، بلكې تاسو د یتیم (سره احسان او د هغه) عزت نه كوئ",
            "verse 89:18": "او مسكین ته په طعام وركولو یو بل ته ترغیب نه وركوئ",
            "verse 89:19": "او تاسو د میراث (پردى) مال خورئ، په خوړلو ټولو سره",
            "verse 89:20": "او تاسو له مال سره مینه كوئ، ډېره زیاته مینه",
            "verse 89:21": "داسې نه ده۔ كله چې ځمكه وټكولى شي، په ټكولو ماتولو سختو سره",
            "verse 89:22": "او ستا رب راشي او ملايك قطار قطار (راشي)",
            "verse 89:23": "او په دغې ورځ كې به دوزخ راوستى شي۔، په دغې ورځ كې به انسان نصیحت (او پند) اخلي او (په دغه وخت كې) د ده لپاره نصیحت به څنګه (نفعمن) وي",
            "verse 89:24": "دى به وايي: اى كاشكې ما د خپل ژوند لپاره مخكې (څه نېك عملونه) لېږلي وى",
            "verse 89:25": "نو په دغې ورځ كې به د ده (يعنې د رب) د عذاب په شان هیڅوك عذاب نه وركوي",
            "verse 89:26": "او د ده د تړلو په شان به هیڅوك تړل نه كوي",
            "verse 89:27": "اى اطمینان نیوونكیه نفسه!",
            "verse 89:28": "ته وګرځه خپل رب ته، په داسې حال كې چې خوشاله او راضي كړى شوى به يې",
            "verse 89:29": "نو ته زما په بنده ګانو كې داخل شه",
            "verse 89:30": "او زما جنت ته ننوځه"
        },
        "Persian": {
            "verse 89:1": "سوگند به سپيده صبح،",
            "verse 89:2": "و سوگند به شبهاى دهگانه،",
            "verse 89:3": "و سوگند به جفت و طاق،",
            "verse 89:4": "و سوگند به شب چون روى به رفتن نهد.",
            "verse 89:5": "آيا خردمند را اين سوگندها كافى است؟",
            "verse 89:6": "آيا نديده‌اى كه پروردگار تو با قوم عاد چه كرد؟",
            "verse 89:7": "با اِرَم كه ستونها داشت؟",
            "verse 89:8": "و همانند آن در هيچ شهرى آفريده نشده بود.",
            "verse 89:9": "و قوم ثمود كه در آن وادى سنگ را مى‌بريدند،",
            "verse 89:10": "و قوم فرعون آن دارنده ميخها،",
            "verse 89:11": "آنها در بلاد طغيان كردند،",
            "verse 89:12": "و در آنها به فساد در افزودند.",
            "verse 89:13": "و پروردگار تو تازيانه عذاب را بر سرشان فرود آورد.",
            "verse 89:14": "زيرا پروردگارت به كمينگاه است.",
            "verse 89:15": "اما آدمى، چون پروردگارش بيازمايد و گرامى‌اش دارد و نعمتش دهد، مى‌گويد: پروردگار من مرا گرامى داشت.",
            "verse 89:16": "و چون بيازمايدش و رزق بر او تنگ گيرد، مى‌گويد: پروردگار من مرا خوار ساخت.",
            "verse 89:17": "نه چنان است. شما يتيم را گرامى نمى‌داريد،",
            "verse 89:18": "و يكديگر را به اطعام مسكين ترغيب نمى‌كنيد،",
            "verse 89:19": "و ميراث را حريصانه مى‌خوريد،",
            "verse 89:20": "و مال را فراوان دوست داريد.",
            "verse 89:21": "آرى، چون زمين شكسته شود و شكسته شود،",
            "verse 89:22": "و امر پروردگار تو فرا رسد و فرشتگان صف در صف،",
            "verse 89:23": "و در آن روز جهنم را حاضر آرند، آدمى پند گيرد. و چه جاى پند گرفتن باشد؟",
            "verse 89:24": "مى‌گويد: اى كاش زنده‌گشتن خويش را پيشاپيش چيزى مى‌فرستادم.",
            "verse 89:25": "در آن روز كسى چون عذاب او عذاب نكند،",
            "verse 89:26": "و همانند زنجير او به زنجير نكشد.",
            "verse 89:27": "اى روح آرامش يافته،",
            "verse 89:28": "خشنود و پسنديده به سوى پروردگارت باز گرد،",
            "verse 89:29": "و در زمره بندگان من داخل شو،",
            "verse 89:30": "و به بهشت من درآى."
        },
        "Polish": {
            "verse 89:1": "Na jutrzenkę!",
            "verse 89:2": "Na dziesięć nocy!",
            "verse 89:3": "Na podwójne i pojedyncze!",
            "verse 89:4": "Na noc, kiedy przemija!",
            "verse 89:5": "Czy to nie jest przysięga człowieka rozsądnego?",
            "verse 89:6": "Czy nie widziałeś, jak postąpił twój Pan z ludem Ad",
            "verse 89:7": "I z Iramem, posiadającym kolumny",
            "verse 89:8": "- czegoś podobnego nie stworzono w żadnym kraju -",
            "verse 89:9": "I z ludem Samud, który wydrążył skałę w dolinie,",
            "verse 89:10": "I z Faraonem, władcą pali namiotów?",
            "verse 89:11": "Oni popełniali przestępstwa w kraju",
            "verse 89:12": "I szerzyli w nim zgorszenie,",
            "verse 89:13": "Tak iż twój Pan spuścił na nich bicz kary.",
            "verse 89:14": "Zaprawdę, twój Pan pilnie wszystko obserwuje!",
            "verse 89:15": "A człowiek, kiedy Pan go doświadcza - uszanowawszy go i obdarzywszy dobrodziejstwami - mówi: \"Mój Pan mnie uszanował!\"",
            "verse 89:16": "A kiedy doświadcza go, ograniczając mu jego zaopatrzenie, wtedy on mówi: \"Pan mój wzgardził mną!\"",
            "verse 89:17": "Wcale nie! Lecz wy nie szanujecie sieroty;",
            "verse 89:18": "Nie zachęcacie się wzajemnie do nakarmienia biedaka;",
            "verse 89:19": "I zjadacie dziedzictwo z wielką chciwością;",
            "verse 89:20": "I kochacie bogactwo miłością ogromną!",
            "verse 89:21": "Ale miejcie się na baczności! Kiedy ziemia zostanie obrócona w pył,",
            "verse 89:22": "Kiedy przyjdzie twój Pan i aniołowie, szereg za szeregiem,",
            "verse 89:23": "I kiedy zostanie ukazana Gehenna, tego Dnia przypomni sobie człowiek:.. lecz na cóż mu się zda to przypomnienie?",
            "verse 89:24": "Będzie on mówił: \"O, gdybym był przygotował coś dla mego życia!\"",
            "verse 89:25": "I tego Dnia nikt nie ukarze tak jak On;",
            "verse 89:26": "I nie skrępuje łańcuchami tak jak On.",
            "verse 89:27": "O ty, duszo uspokojona,",
            "verse 89:28": "Powróć do twego Pana, zadowolona i z upodobaniem przyjęta!",
            "verse 89:29": "Wejdź więc między Moje sługi!",
            "verse 89:30": "Wejdź do Mojego Ogrodu!"
        },
        "Portuguese": {
            "verse 89:1": "Pela aurora,",
            "verse 89:2": "E pelas dez noites,",
            "verse 89:3": "E pelo par e pelo ímpar,",
            "verse 89:4": "E pela noite, quando se retira (que sereis castigados)!",
            "verse 89:5": "Porventura, não há nisso um juramento adequado, para o sensato?",
            "verse 89:6": "Não reparaste em como o teu Senhor procedeu, em relação à (tribo de) Ad,",
            "verse 89:7": "Aos (habitantes de) Iram, (cidade) de pilares elevados,",
            "verse 89:8": "Cujo similar não foi criado em toda a terra?",
            "verse 89:9": "E no povo de Samud, que perfurou rochas no vale?",
            "verse 89:10": "E no Faraó, o senhor das estacas,",
            "verse 89:11": "Os quais transgrediram, na terra,",
            "verse 89:12": "E multiplicaram, nela, a corrupção,",
            "verse 89:13": "Pelo que o teu Senhor lhes infligiu variados castigos?",
            "verse 89:14": "Atenta para o fato de que o teu Senhor está sempre alerta.",
            "verse 89:15": "Quanto ao homem, quando seu Senhor o experimenta, honrando-o e agraciando-o, diz (empertigado): Meu Senhor me honra!",
            "verse 89:16": "Porém, quando o prova, restringindo a Sua graça, diz: Meu Senhor me afronta!",
            "verse 89:17": "Qual! Vós não honrais o órfão,",
            "verse 89:18": "Nem nos estimulais a alimentar o necessitado;",
            "verse 89:19": "E consumis avidamente as heranças,",
            "verse 89:20": "E cobiçais insaciavelmente os bens terrenos!",
            "verse 89:21": "Qual! Quando a terra for triturada fortemente,",
            "verse 89:22": "E aparecer o teu Senhor, com os Seus anjos em desfile,",
            "verse 89:23": "E o inferno, nesse dia, for destacado, então o homem recordará; porém de que lhe servirá a recordação!",
            "verse 89:24": "Dirá: Oxalá tivesse diligenciado (na prática do bem), durante a minha vida!",
            "verse 89:25": "Porém, nesse dia, ninguém castigará como Ele (o fará),",
            "verse 89:26": "Nem ninguém acorrentará, como Ele (o fará);",
            "verse 89:27": "E tu, ó alma em paz,",
            "verse 89:28": "Retorna ao teu Senhor, satisfeita (com Ele) e Ele satisfeito (contigo)!",
            "verse 89:29": "Entre no número dos Meus servos!",
            "verse 89:30": "E entra no Meu jardim!"
        },
        "Punjabi": {
            "verse 89:1": "ਫ਼ਜਰ (ਅੰਮ੍ਰਿਤ ਵੇਲਾ) ਦੀ ਸਹੁੰ ਹੈ।",
            "verse 89:2": "ਅਤੇ ਦਸ ਰਾਤਾਂ ਦੀ।",
            "verse 89:3": "ਅਤੇ ਜਿਸਤ ਅਤੇ ਟਾਂਕ ਦੀ।",
            "verse 89:4": "ਅਤੇ ਰਾਤ ਦੀ ਜਦੋਂ ਉਹ ਜਾਣ ਲੱਗੇ।",
            "verse 89:5": "ਕਿਉਂ, ਇਸ ਵਿਚ ਤਾਂ ਬੁੱਧੀਮਾਨਾਂ ਲਈ ਕਾਫ਼ੀ ਪ੍ਰਮਾਣ ਹਨ।",
            "verse 89:6": "ਤੁਸੀਂ ਨਹੀਂ ਦੇਖਿਆ? ਤੁਹਾਡੇ ਰੱਬ ਨੇ ਆਦ (ਕੌਮ-ਏ-ਆਦ) ਦੇ ਨਾਲ ਕੀ ਕੀਤਾ।",
            "verse 89:7": "ਖੰਭਿਆਂ ਵਾਲੇ ਇਰਮ (ਵੱਡੇ ਕੱਦਾਂ ਵਾਲੇ) ਦੇ ਨਾਲ।",
            "verse 89:8": "ਜਿਨ੍ਹਾਂ ਵਰਗੀ ਕੋਈ ਕੌਮ ਦੇਸ਼ਾਂ ਵਿਚ ਪੈਦਾ ਨਹੀਂ ਕੀਤੀ ਗਈ।",
            "verse 89:9": "ਅਤੇ ਸਮੂਦ ਦੇ ਨਾਲ, ਜਿਨ੍ਹਾਂ ਨੇ (ਕਰਾ ਦੀਆਂ) ਘਾਟੀਆਂ ਵਿਚ ਚਟਾਨਾਂ ਤਰਾਸ਼ੀਆਂ (ਅਤੇ ਘਰ ਬਣਾਏ)।",
            "verse 89:10": "ਅਤੇ ਮੇਖਾਂ ਵਾਲੇ ਫਿਰਔਨ ਦੇ ਨਾਲ।",
            "verse 89:11": "ਜਿਨ੍ਹਾਂ ਨੇ ਦੇਸ਼ਾਂ ਵਿਚ ਬਗ਼ਾਵਤ ਕੀਤੀ।",
            "verse 89:12": "ਫਿਰ ਉਨ੍ਹਾਂ ਵਿਚ ਬਹੁਤ ਫਸਾਦ ਫ਼ੈਲਾਇਆ।",
            "verse 89:13": "ਤਾਂ ਤੁਹਾਡੇ ਰੱਬ ਨੇ ਉਨ੍ਹਾਂ ਤੇ ਸਜ਼ਾ ਦਾ ਕੋੜਾ ਵਰਸਾਇਆ।",
            "verse 89:14": "ਬੇਸ਼ੱਕ ਤੁਹਾਡਾ ਰੱਬ ਘਾਤ ਵਿਚ ਹੈ।",
            "verse 89:15": "ਸੋ ਮਨੁੱਖ ਦਾ ਮਾਮਲਾ ਇਹ ਹੈ ਕਿ ਜਦੋਂ ਉਸ ਦਾ ਰੱਬ ਉਸ ਦਾ ਇਮਤਿਹਾਨ ਲੈਂਦਾ ਹੈ ਅਤੇ ਉਸ ਨੂੰ ਇੱਜ਼ਤ ਅਤੇ ਨਿਅਮਤ ਬਖ਼ਸ਼ਦਾ ਹੈ, ਤਾਂ ਉਹ ਆਖਦਾ ਹੈ ਕਿ ਮੇਰੇ ਰੱਬ ਨੇ ਮੈਨੂੰ ਸਨਮਾਨ ਦਿੱਤਾ ਹੈ।",
            "verse 89:16": "ਅਤੇ ਜਦੋਂ ਉਹ ਉਸ ਦਾ ਇਮਤਿਹਾਨ ਲੈਂਦਾ ਹੈ ਅਤੇ ਉਸ ਦਾ ਰਿਜ਼ਕ ਤੰਗ ਕਰ ਦਿੰਦਾ ਹੈ। ਤਾਂ ਉਹ ਆਖਦਾ ਹੈ ਕਿ ਮੇਰੇ ਰੱਬ ਨੇ ਮੈਨੂੰ ਬੇ-ਇੱਜ਼ਤ ਕਰ ਦਿੱਤਾ।",
            "verse 89:17": "ਕਦੇ ਵੀ ਨਹੀਂ, ਸਗੋਂ’ ਤੁਸੀਂ ਅਨਾਥਾਂ ਦਾ ਸਨਮਾਨ ਨਹੀਂ ਕਰਦੇ।",
            "verse 89:18": "ਅਤੇ ਨਾ ਤੁਸੀ’ ਮਿਸਕੀਨ (ਨਿਰਧਨ) ਨੂੰ ਭੋਜਨ ਖਿਲਾਉਣ ਲਈ ਇੱਕ ਦੂਜੇ ਨੂੰ ਪ੍ਰੇਰਿਤ ਕਰਦੇ ਹੋ।",
            "verse 89:19": "ਅਤੇ ਤੁਸੀਂ ਵਿਰਾਸਤ (ਵਿਚ ਮਿਲੀ ਦੌਲਤ) ਨੂੰ ਇਕੱਠਾ ਕਰਕੇ ਖਾ ਜਾਂਦੇ ਹੋ।",
            "verse 89:20": "ਅਤੇ ਤੁਸੀਂ ਆਪਣੀ ਜਾਇਦਾਦ ਨਾਲ ਬਹੁਤ ਪਿਆਰ ਕਰਦੇ ਹੋ।",
            "verse 89:21": "ਕਦੇ ਵੀ ਨਹੀਂ, ਜਦੋਂ ਧਰਤੀ ਨੂੰ ਤੋੜ ਕੇ ਰੇਜ਼ਾ-ਰੇਜ਼ਾ (ਕਣ) ਕਰ ਦਿੱਤਾ ਜਾਵੇਗਾ।",
            "verse 89:22": "ਅਤੇ ਤੁਹਾਡਾ ਰੱਬ ਆਵੇਗਾ (ਤੇ ਰੰਗ ਵਿਖਾਵੇਗਾ), ਤੇ ਫ਼ਰਿਸ਼ਤੇ ਕਤਾਰਾਂ ਬੰਨ੍ਹ ਕੇ ਆ ਆਉਣਗੇ।",
            "verse 89:23": "ਅਤੇ ਉਸ ਦਿਨ ਨਰਕ ਹਾਜ਼ਿਰ ਕਰ ਦਿੱਤੀ ਜਾਵੇਗੀ। ਉਸ ਦਿਨ ਮਨੁੱਖ ਨੂੰ ਸਮਝ ਆਵੇਗੀ, ਪਰ ਉਸ ਵੇਲੇ ਸਮਝਣ ਦਾ ਮੌਕਾ ਕਿਥੇ",
            "verse 89:24": "ਉਹ ਆਖੇਗਾ ਕਿ ਕਾਸ਼! ਮੈਂ ਆਪਣੇ ਜੀਵਨ ਵਿਚ ਕੁਝ ਅੱਗੇ ਭੇਜਦਾ।",
            "verse 89:25": "ਸੋ ਉਸ ਦਿਨ ਨਾ ਤਾਂ ਅੱਲਾਹ ਦੇ ਬਰਾਬਰ ਕੌਈ ਸਜ਼ਾ ਦੇਵੇਗਾ।",
            "verse 89:26": "ਅਤੇ ਨਾ ਉਸ ਦੇ ਬੰਨ੍ਹਣ ਵਾਂਗ ਕੋਈ ਬੰਨ੍ਹ ਸਕੇਗਾ।",
            "verse 89:27": "ਹੇ ਸਤੂੰਸ਼ਟ ਆਤਮਾ",
            "verse 89:28": "ਚੱਲ ਆਪਣੇ ਰੱਬ ਵੱਲ। ਤੂੰ ਉਸ ਤੋਂ ਖੂਸ਼ ਅਤੇ ਉਹ ਤੇਰੇ ਤੋਂ ਖੂਸ਼।",
            "verse 89:29": "ਸੋ ਮੇਰੇ ਬੰਦਿਆਂ ਵਿਚ ਸ਼ਾਮਿਲ ਹੋ।",
            "verse 89:30": "ਅਤੇ ਮੇਰੀ ਜੰਨਤ ਵਿਚ ਦਾਖ਼ਿਲ ਹੋ।"
        },
        "Roman english": {
            "verse 89:1": "Wal-Fajr",
            "verse 89:2": "Wa layaalin `ashr",
            "verse 89:3": "Wash shaf`i wal watr",
            "verse 89:4": "Wallaili izaa yasr",
            "verse 89:5": "Hal fee zaalika qasamul lizee hijr",
            "verse 89:6": "Alam tara kaifa fa`ala rabbuka bi`aad",
            "verse 89:7": "Iramaa zaatil `imaad",
            "verse 89:8": "Allatee lam yukhlaq misluhaa fil bilaad",
            "verse 89:9": "Wa samoodal lazeena jaabus sakhra bil waad",
            "verse 89:10": "Wa fir`awna zil awtaad",
            "verse 89:11": "Allazeena taghaw fil bilaad",
            "verse 89:12": "Fa aksaroo feehal fasaad",
            "verse 89:13": "Fasabba `alaihim Rabbuka sawta `azaab",
            "verse 89:14": "Inna Rabbaka labil mirsaad",
            "verse 89:15": "Fa ammal insaanu izaa mab talaahu Rabbuhoo fa akramahoo wa na` `amahoo fa yaqoolu Rabbeee akraman",
            "verse 89:16": "Wa ammaaa izaa mabtalaahu faqadara `alaihi rizqahoo fa yaqoolu Rabbeee ahaanan",
            "verse 89:17": "Kalla bal laa tukrimooo nal yateem",
            "verse 89:18": "Wa laa tahaaaddoona `alaata`aamil miskeen",
            "verse 89:19": "Wa taakuloonat turaasa aklal lammaa",
            "verse 89:20": "Wa tuhibboonal maala hubban jammaa",
            "verse 89:21": "Kallaaa izaaa dukkatil ardu dakkan dakka",
            "verse 89:22": "Wa jaaa`a Rabbuka wal malaku saffan saffaa",
            "verse 89:23": "Wa jeee`a yawma`izim bi jahannnam; Yawma `iziny yatazakkarul insaanu wa annaa lahuz zikraa",
            "verse 89:24": "Yaqoolu yaa laitanee qaddamtu lihayaatee",
            "verse 89:25": "Fa Yawma izil laa yu`azzibu `azaabahooo ahad",
            "verse 89:26": "Wa laa yoosiqu wasaaqa hooo ahad",
            "verse 89:27": "Yaaa ayyatuhan nafsul mutma `innah",
            "verse 89:28": "Irji`eee ilaa Rabbiki raadiyatam mardiyyah",
            "verse 89:29": "Fadkhulee fee `ibaadee",
            "verse 89:30": "Wadkhulee jannatee"
        },
        "Russian": {
            "verse 89:1": "В знак утренней зари",
            "verse 89:2": "И десяти ночей,",
            "verse 89:3": "В знак четных и нечетных чисел",
            "verse 89:4": "И ночи, что вершит свой бег, -",
            "verse 89:5": "Не в них ли кроется свидетельство для тех, кто разумеет?",
            "verse 89:6": "Ужель не видишь ты, Как поступил Господь с народом Ад",
            "verse 89:7": "И с горделивыми колоннами Ирама,",
            "verse 89:8": "Подобия которых ни одной стране не удалось создать?",
            "verse 89:9": "И с самудянами, Что пробивали скалы (для жилья) в долине?",
            "verse 89:10": "С владыкой кольев - Фараоном,",
            "verse 89:11": "Кто нечести творил по всей земле",
            "verse 89:12": "И множил зло на ней?",
            "verse 89:13": "На них обрушил твой Господь Бич разных наказаний, -",
            "verse 89:14": "Поистине, Он зрит во все!",
            "verse 89:15": "Когда, испытывая человека, Бог осыпает благоденствием его, Глаголет человек надменно: \"Господь почтил меня Своим благоволеньем\".",
            "verse 89:16": "Когда ж (опять-таки) для испытанья Господь дары ему определяет (мерой), Он говорит: \"Меня мой Бог унизил\".",
            "verse 89:17": "Вовсе нет! Сирот не чтите вы!",
            "verse 89:18": "Не побуждаете друг друга накормить голодных!",
            "verse 89:19": "И жадно пожираете Оставленное не для вас наследство,",
            "verse 89:20": "Богатство любите любовию чрезмерной.",
            "verse 89:21": "Так нет же! Когда земля расколется на части,",
            "verse 89:22": "И явится Господь и ангелы Его рядами,",
            "verse 89:23": "И Ад предстанет (их глазам), - В тот День Все вспомнит человек! Но как воспоминанья эти помогут участь облегчить его?",
            "verse 89:24": "И скажет он: \"О, если бы деяньями благими Я уготовил себе (будущую) жизнь!\"",
            "verse 89:25": "В тот День Никто другой не сможет наказать таким (страданьем),",
            "verse 89:26": "Никто другой не сможет наложить таких оков.",
            "verse 89:27": "О ты, ничем не омраченная душа!",
            "verse 89:28": "Вернись к Владыке своему Ему угодной и довольной, -",
            "verse 89:29": "Средь (истинных) служителей Моих",
            "verse 89:30": "Войди в Мой Рай!"
        },
        "Sindhi": {
            "verse 89:1": "پرھ جو قسم آھي.",
            "verse 89:2": "۽ ڏھن راتين جو قسم آھي.",
            "verse 89:3": "۽ ٻڌيءَ ۽ اِڪئيءَ جو قسم آھي.",
            "verse 89:4": "۽ رات جو قسم آھي جڏھن ھلي.",
            "verse 89:5": "ھان ڌيان واري لاءِ ھن (قسمن) ۾ بيشڪ پورو قسم آھي.",
            "verse 89:6": "نه ڏٺئي ڇا ته (قوم) عاد سان تنھنجي پالڻھار ڪيئن ڪيو.",
            "verse 89:7": "(جي) ارم وارا وڏن ٿنڀن (جي عمارتن) وارا ھوا.",
            "verse 89:8": "جن جھڙو شھرن ۾ ڪونه بڻايو ويو آھي.",
            "verse 89:9": "۽ (قوم) ثمُود سان (ڪيئن ڪيائين) جن ميدان (قرٰا) ۾ پھڻن جون ڇپون گھڙيون ھيون.",
            "verse 89:10": "۽ ميخن واري فرعون سان (ڪئن ڪيائين).",
            "verse 89:11": "انھن (مڙني ٽولين) جن شھرن ۾ سرڪشي ڪئي.",
            "verse 89:12": "پوءِ منجھن گھڻو فساد ڪيائون.",
            "verse 89:13": "تنھنڪري تنھنجي پالڻھار مٿن عذاب جو چھبڪ وھايو.",
            "verse 89:14": "بيشڪ تنھنجو پالڻھار گھَٽَ (واري ھنڌ) ۾ (عملن کي ڏسندڙ) آھي.",
            "verse 89:15": "پوءِ ماڻھو کي جڏھن سندس پالڻھار (ھن طرح) پرکيندو آھي جو اُن کي مانوارو ڪندو آھي ۽ نعمت ڏيندو اٿس، ته چوندو آھي ته منھنجي پالڻھار مون کي نوازيو.",
            "verse 89:16": "۽ جڏھن کيس (ٻئي طرح ھيئن) پرکيندو آھي جو مٿس روزي تنگ ڪندو آھي ته چوندو آھي ته منھنجي پالڻھار مون کي بي مانو ڪيو.",
            "verse 89:17": "(ھرگز) ائين نه آھي بلڪ ڇوري ٻار کي تعظيم نه ڏيندا آھيو.",
            "verse 89:18": "۽ نڪي مسڪينن جي کارائڻ تي ھڪ ٻئي کي رغبت ڏياريندا آھيو.",
            "verse 89:19": "۽ مُئن جو مال سموروئي ڳھي ويندا آھيو.",
            "verse 89:20": "۽ گھڻي پيار سان مال کي پيارو رکندا آھيو.",
            "verse 89:21": "ائين نه ڪجي جڏھن زمين (جي اونچاڻ) ڪٽي ڪٽي سنئين ڪئي ويندي.",
            "verse 89:22": "۽ تنھنجو پالڻھار ايندو ۽ ملائڪ صِف صِف ٿي (ايندا).",
            "verse 89:23": "۽ اُن ڏينھن دوزخ کي آڻبو، اُن ڏينھن ماڻھو نصيحت وٺندو ۽ اُنھيءَ مھل (اھا نصيحت وٺڻ) اُن کي ڪٿي فائدي واري آھي.",
            "verse 89:24": "چوندو ته ھاءِ ارمان جيڪر پنھنجي (ھن ھميشه جي) حياتيءَ لاءَ (ڪجھ) اڳي موڪليان ھا.",
            "verse 89:25": "پوءِ انھيءَ ڏينھن الله جي عذاب جھڙو ڪوبه ڪونه عذاب ڪندو.",
            "verse 89:26": "۽ نڪو ڪو الله جي قيد ڪرڻ جھڙو قيد ڪندو.",
            "verse 89:27": "(مؤمنن کي چئبو ته) اي آرام وٺڻ وارا جيءُ.",
            "verse 89:28": "تون پنھنجي پالڻھار ڏانھن موٽِ ھل (تون اُن کان) راضي ٿيل آھين (ھو توکان) راضي ٿيل آھي.",
            "verse 89:29": "تنھنڪري (تون) منھنجي ٻانھن (جي ٽوليءَ) ۾ داخل ٿيءُ.",
            "verse 89:30": "۽ منھنجي بھشت ۾ گِھڙ."
        },
        "Sinhalese": {
            "verse 89:1": "අරුණෝදය මත ද දිවුරමින්.",
            "verse 89:2": "දස රාත්‍රියන් මත ද දිවුරමින්.",
            "verse 89:3": "ඉරට්ටේ හා ඔත්තේ මත ද දිවුරමින්.",
            "verse 89:4": "රාත්‍රිය ගෙවී යන විට ඒ මත ද දිවුරමින්.",
            "verse 89:5": "නුවණ ඇති අයට එහි (ප්‍රමාණවත්) දිවුරුමක් ඇත් ද?",
            "verse 89:6": "ආද් ජනයා සමඟ නුඹගේ පරමාධිපති කවර අයුරින් කටයුතු කළේ දැයි නුඹ නොදුටුවෙහි ද?",
            "verse 89:7": "(ඔවුන්) කුලුනු වලින් යුක්ත ඉරම් නගරවාසීන් ය.",
            "verse 89:8": "ඒවා මෙන් කිසිවක් (වෙනත්) දේශයන්හි නිර්මාණය කරනු නොලැබීය.",
            "verse 89:9": "නිම්නයන්හි ගල් පර්වත කැනූ සමූද් ජනයා සමඟත්;",
            "verse 89:10": "රිටි සහිත ෆිර්අවුන් සමඟත් (නුඹගේ පරමාධිපති කවර අයුරින් කටයුතු කළේ දැයි නුඹ නොදුටුවෙහි ද?)",
            "verse 89:11": "ඔවුහු දේශයන්හි සීමා ව ඉක්මවා කටයුතු කළෝය.",
            "verse 89:12": "ඔවුහු එහි කලහකම් අධික ලෙස සිදු කළෝය.",
            "verse 89:13": "එහෙයින් නුඹගේ පරමාධිපති ඔවුන් මත දඬුවමේ කසය හෙළුවේය.",
            "verse 89:14": "සැබැවින්ම නුඹගේ පරමාධිපති රැක බලා සිටින්නාය.",
            "verse 89:15": "එනමුත් මිනිසා වූ කලී, ඔහුගේ පරමාධිපති ඔහු ව පරීක්ෂාවට ලක් කර, පසු ව ඔහුට උපකාර කර ඔහුට දායාදයන් පිරිනැමූ කල්හි “මාගේ පරමාධිපති මට උපකාර කළේය” යැයි ඔහු පවසයි.",
            "verse 89:16": "තවද ඔහු ව පරීක්ෂාවට ලක් කර පසු ව ඔහුගේ ජීවන සම්පත් ඔහුට සීමා කළ කල්හි එවිට ඔහු “මාගේ පරමාධිපති මට අවමන් කළේය” යැයි පවසයි.",
            "verse 89:17": "නොඑසේය, නුඹලා අනාථයාට උපකාර නොකරන්නෙහුය.",
            "verse 89:18": "තවද නුඹලා දුගියාට ආහාර සැපයීමට දිරි නොගන්වන්නෙහුය.",
            "verse 89:19": "තවද නුඹලා උරුමයන් (අයුතු ලෙස) මුළුමණින් ම අනුභව කරන්නෙහුය.",
            "verse 89:20": "එමෙන්ම අප්‍රමාණ ළැදියාවකින් ධනයට ඇලුම් කරන්නෙහුය.",
            "verse 89:21": "එසේ නොව, මහපොළොව කැබලි කැබලි වශයෙන් සුනු විසුනු කරනු ලැබූ කල්හි,",
            "verse 89:22": "තවද මලක්වරු පෙළින් පෙළට (පෙළ ගැසී) සිටියදී නුඹගේ පරමාධිපති පැමිණෙන්නේය.",
            "verse 89:23": "තවද එදින නිරය ගෙන එනු ලැබේ. එදින මිනිසා සිහිපත් කරයි. එම සිහිපත් කිරීම ඔහුට කෙසේ (නම් ඵලක්) වන්නේ ද?",
            "verse 89:24": "“අහෝ මම මාගේ ජීවිතය වෙනුවෙන් කල් ඇති ව (යහකම්) සිදු කරන්නට තිබුණා නොවේ” දැයි ඔහු පවසයි.",
            "verse 89:25": "එදින ඔහුගේ දඬුවම මෙන් කිසිවෙක් දඬුවම් නොකරයි.",
            "verse 89:26": "තවද ඔහුගේ බැඳීම මෙන් කිසිවෙක් (අපරාධකරුවන් ව) බැඳ නොතබයි.",
            "verse 89:27": "“අහෝ සැනසුමට පත් ආත්මය!",
            "verse 89:28": "නුඹ තෘප්තියට පත් වන්නෙකු ලෙස ද තෘප්තියට ලක් වූ අයෙකු ලෙස ද නුඹගේ පරමාධිපති වෙත හැරී යනු.",
            "verse 89:29": "එවිට නුඹ මාගේ ගැත්තන් අතරට යනු.",
            "verse 89:30": "තවද මාගේ ස්වර්ගයට පිවිසෙනු."
        },
        "Somali": {
            "verse 89:1": "Eebe wuxuu ku dhaartay Waabariga.",
            "verse 89:2": "Iyo Habenanada Tobanka ah (Arrafo).",
            "verse 89:3": "Iyo Tirada siman iyo tan is dheer.",
            "verse 89:4": "Iyo Habeenku markuu tagayu.",
            "verse 89:5": "Miyayna arrintaasu ahayn wax loogu dhaarto Qof caqli leh.",
            "verse 89:6": "Ma ku soo Gaadhay sida Eebahaa ku falay Caad.",
            "verse 89:7": "Ee ahaa Irama xooggana lahaa.",
            "verse 89:8": "Wax la mid ahna aan iugu abuurin dhulka.",
            "verse 89:9": "Iyo Thamuud-kii ahaa dhagaxa kuwa ku jarjara Waadiga.",
            "verse 89:10": "lyo Fircoonkii dhakawyada lahaa.",
            "verse 89:11": "kuwiina ahaa ku xadgudbay dhulka.",
            "verse 89:12": "12 Kuna badiyay dhexdiisa fassaadka.",
            "verse 89:13": "Markaasaana Eeba ku shubay Caddibaad daran.",
            "verse 89:14": "Maxaayeelay Eebe waa u darbanyahay (abaalmarinta).",
            "verse 89:15": "Marks Eebe Dadka imtixaano xoolana ugu nicmeeyo wuxuu dhihi (kan xun) waa lai sharrifay (isagoo faani).",
            "verse 89:16": "Haddiise Eebe imtixaano oo Xoolaha ku yareeyo wuxuu dhihi Eebaa i dulleeyay.",
            "verse 89:17": "Saas ma aha ee waxaydaan dhaqaalaynayn Agoonka.",
            "verse 89:18": "Mana fartaan in masaakiinta wax la siiyo.",
            "verse 89:19": "Waxaadna aad u cuntaan dhaxal xaq darro.",
            "verse 89:20": "Xoolahana waxaad u jeceshihiin si daran.",
            "verse 89:21": "Saas ma aha ee marka dhulka la burburiyo.",
            "verse 89:22": "Eebe iyo Malaguna la yimaaddo amarkiisa Malaa'igtoo safan.",
            "verse 89:23": "Naarta Jahannamana Maalintaas la keeno, Dadku waxay xusuusan waxay faleen, Maxayse xusuusi tari.",
            "verse 89:24": "Waxay dhihi shallaytee maan wanaag hormarsado.",
            "verse 89:25": "Malintaas sida Eebe wax ruux u Cadaabi ma jiro.",
            "verse 89:26": "Wax sida Eebe wax u xidhina ma jiro.",
            "verse 89:27": "Naftase xaqa rumaysay ee Xasillooneey.",
            "verse 89:28": "U noqo Eebaha adoo raalli ah lagana raalli noqday.",
            "verse 89:29": "dhexgalna Addoomadayda (wanaagsan).",
            "verse 89:30": "Galna Jannadayda."
        },
        "Spanish": {
            "verse 89:1": "Por la Aurora!",
            "verse 89:2": "Por diez noches!",
            "verse 89:3": "Por lo par y lo impar!",
            "verse 89:4": "Por la noche cuando transcurre!",
            "verse 89:5": "No es eso un juramento para el que tiene intelecto?",
            "verse 89:6": "No has visto lo que hizo tu Señor con los Ad?",
            "verse 89:7": "Iram, la de las columnas",
            "verse 89:8": "como la que no se creó otra igual en todo el país.",
            "verse 89:9": "Y los Zamud que socavaban las rocas en el valle.",
            "verse 89:10": "Y Firaún el de las estacas.",
            "verse 89:11": "Que cometieron abusos en la tierra",
            "verse 89:12": "y sembraron en ella la corrupción.",
            "verse 89:13": "Y tu Señor envió contra ellos el azote de un castigo.",
            "verse 89:14": "Es cierto que tu Señor está Vigilante.",
            "verse 89:15": "Sin embargo el hombre cuando su Señor lo pone a prueba honrándolo y favoreciéndolo, dice: He sido honrado por Mi Señor.",
            "verse 89:16": "Pero cuando lo pone a prueba restringiéndole la provisión, dice: Mi Señor me ha abandonado.",
            "verse 89:17": "Pero no! Es que no tratáis con generosidad al huérfano,",
            "verse 89:18": "ni os exhortáis a alimentar al pobre.",
            "verse 89:19": "Acaparáis las herencias con voracidad",
            "verse 89:20": "y amáis la riqueza en demasía.",
            "verse 89:21": "Pero no! Cuando la tierra se convulsione una y otra vez hasta quedar plana.",
            "verse 89:22": "Y venga tu Señor y vengan los ángeles en filas y filas,",
            "verse 89:23": "y se haga venir, ese día, a Yahannam. Entonces el hombre recordará. Pero de qué le servirá recordar?",
            "verse 89:24": "Dirá: Ay de mí!, ojalá y hubiera adelantado algo en favor de mi vida.",
            "verse 89:25": "Ese día, nadie infligirá Su castigo",
            "verse 89:26": "y nadie prenderá con Su firmeza.",
            "verse 89:27": "Oh alma sosegada!",
            "verse 89:28": "Regresa a tu Señor, satisfecha y satisfactoria.",
            "verse 89:29": "Y entra con Mis siervos,",
            "verse 89:30": "entra en Mi Jardín."
        },
        "Swahili": {
            "verse 89:1": "Naapa kwa alfajiri,",
            "verse 89:2": "Na kwa masiku kumi,",
            "verse 89:3": "Na kwa viwili viwili na kimoja kimoja,",
            "verse 89:4": "Na kwa usiku unapo pita,",
            "verse 89:5": "Je! Hapana katika haya kiapo kwa mwenye akili?",
            "verse 89:6": "Kwani hukuona jinsi Mola wako Mlezi alivyo wafanya kina A'di?",
            "verse 89:7": "Wa Iram, wenye majumba marefu?",
            "verse 89:8": "Ambao haukuumbwa mfano wake katika nchi?",
            "verse 89:9": "Na Thamudi walio chonga majabali huko bondeni?",
            "verse 89:10": "Na Firauni mwenye vigingi?",
            "verse 89:11": "Ambao walifanya jeuri katika nchi?",
            "verse 89:12": "Wakakithirisha humo ufisadi?",
            "verse 89:13": "Basi Mola wako Mlezi aliwapiga mjeledi wa adhabu.",
            "verse 89:14": "Hakika Mola wako Mlezi yupo kwenye mavizio anawavizia.",
            "verse 89:15": "Ama mtu anapo jaribiwa na Mola wake Mlezi, akamkirimu na akamneemesha, husema: Mola wangu Mlezi amenikirimu!",
            "verse 89:16": "Na ama anapo mjaribu akampunguzia riziki yake, husema: Mola wangu Mlezi amenitia unyonge!",
            "verse 89:17": "Sivyo hivyo! Bali nyinyi hamuwakirimu mayatima,",
            "verse 89:18": "Wala hamhimizani kulisha masikini;",
            "verse 89:19": "Na mnakula urithi kwa ulaji wa pupa,",
            "verse 89:20": "Na mnapenda mali pendo la kupita kiasi.",
            "verse 89:21": "Sivyo hivyo! Itakapo vunjwa ardhi vipande vipande,",
            "verse 89:22": "Na akaja Mola wako Mlezi na Malaika safu safu,",
            "verse 89:23": "Na ikaletwa Jahannamu siku hiyo, siku hiyo mtu atakumbuka! Lakini kukumbuka huko kutamfaa nini?",
            "verse 89:24": "Atasema: Laiti ningeli jitangulizia kwa uhai wangu!",
            "verse 89:25": "Basi siku hiyo hataadhibu yeyote namna ya kuadhibu kwake.",
            "verse 89:26": "Wala hatafunga yeyote kama kufunga kwake.",
            "verse 89:27": "Ewe nafsi iliyo tua!",
            "verse 89:28": "Rejea kwa Mola wako Mlezi umeridhika, na umemridhisha.",
            "verse 89:29": "Basi ingia miongoni mwa waja wangu,",
            "verse 89:30": "Na ingia katika Pepo yangu."
        },
        "Swedish": {
            "verse 89:1": "VID gryningsljuset",
            "verse 89:2": "och vid de tio nätterna!",
            "verse 89:3": "Vid det jämna talet och det udda!",
            "verse 89:4": "Vid natten, när den viker!",
            "verse 89:5": "Räcker inte denna försäkran för [att övertyga] den som är begåvad med insikt och förstånd?",
            "verse 89:6": "HAR DU inte sett hur din Herre gick till väga mot [stammen] Aad?",
            "verse 89:7": "Och mot Iram, [de tusen] pelarnas [stad],",
            "verse 89:8": "vars like aldrig har återskapats på jorden",
            "verse 89:9": "Och mot thamudenerna, som högg ut [sina bostäder] i dalens klippväggar",
            "verse 89:10": "Och mot [de oräkneliga] tältmasternas Farao?",
            "verse 89:11": "[Alla] gick de för långt i sitt trots på jorden,",
            "verse 89:12": "och de störde ordningen och spred överallt sedefördärv,",
            "verse 89:13": "och därför lät din Herre straffets piska vina över dem.",
            "verse 89:14": "Din Herre förtröttas sannerligen [inte] i Sin vaksamhet!",
            "verse 89:15": "MEN vad människan beträffar säger hon, var gång hennes Herre för att pröva henne låter henne nå ära och välstånd: \"Min Herre har hedrat mig [på grund av mina förtjänster].\"",
            "verse 89:16": "Men då Han prövar henne genom att ge henne knappare utkomst, säger hon: \"Min Herre skämmer ut mig.\"",
            "verse 89:17": "Nej, men [se på er själva]! Mot de faderlösa visar ni ingen givmildhet,",
            "verse 89:18": "och ni uppmanar inte varandra att ge den nödställde att äta,",
            "verse 89:19": "och ni slukar [andras] arv med glupande aptit.",
            "verse 89:20": "Och er kärlek till pengar känner inga gränser!",
            "verse 89:21": "Nej [tag er i akt]! När jordskorpan smulas sönder i stöt efter stöt,",
            "verse 89:22": "och din Herre visar sig med änglarna i slutna led,",
            "verse 89:23": "och helvetet görs [synligt], den Dagen skall människan minnas [Våra varningar] - men vad hjälper det henne då att hon minns",
            "verse 89:24": "[Då] kommer hon att säga: \"Om jag ändå hade tänkt på [att med goda handlingar] förbereda mig för mitt liv [i evigheten]!\"",
            "verse 89:25": "Ingen straffar så hårt som Han den Dagen skall straffa,",
            "verse 89:26": "och ingen kan fängsla med sådana bojor som Han.",
            "verse 89:27": "[Då säger Gud till den rättfärdige:] \"Du själ, som har kommit till ro!",
            "verse 89:28": "Vänd tillbaka till din Herre, tillfredsställd [med Hans gåvor och] omsluten av Hans välbehag!",
            "verse 89:29": "Stig in med skaran av Mina tjänare!",
            "verse 89:30": "Stig in i Mitt paradis!\""
        },
        "Tajik": {
            "verse 89:1": "Савганд ба сапедаи субҳ",
            "verse 89:2": "ва савганд ба шабҳои даҳгона (даҳ шаби Зулҳиҷҷа)",
            "verse 89:3": "ва савганд ба ҷуфту тоқ",
            "verse 89:4": "ва савганд ба шаб, чун рӯй ба рафтан ниҳад.",
            "verse 89:5": "Оё дар ин зикркардашудаҳо хирадмандро савгандҳои кофист?",
            "verse 89:6": "Оё надидаӣ, ки Парвардигори ту бо қавми Од чӣ кард?",
            "verse 89:7": "Бо Ирам, ки сутунҳо дошт?",
            "verse 89:8": "Ва монанди он дар ҳеҷ шаҳре офарида нашуда буд.",
            "verse 89:9": "Ва қавми Самуд, ки дар он водӣ сангро мебуриданд.",
            "verse 89:10": "Ва қавми Фиръавн, он дорандаи мехҳо,",
            "verse 89:11": "онҳо дар шаҳрҳо аз ҳад таҷовуз карданд",
            "verse 89:12": "ва дар онҳо бисёр фасод карданд.",
            "verse 89:13": "Ва Парвардигори ту тозиёнаи азобро бар сарашон фуруд овард.",
            "verse 89:14": "Зеро Парвардигорат дар камингоҳ аст.",
            "verse 89:15": "Аммо одамӣ, чута Парвардигораш биёзмояд ва гиромиаш дорад ва неъматаш диҳад, мегӯяд: «Парвардигори ман маро гиромӣ дошт».",
            "verse 89:16": "Ва чун биёзмоядаш ва ризқ бар ӯ танг гирад, мегӯяд: «Парвардигори ман маро хор сохт».",
            "verse 89:17": "На чунон аст. Шумо ятимро гиромӣ намедоред",
            "verse 89:18": "ва якдигарро ба таъом додани мискиш тарғиб намекунед",
            "verse 89:19": "ва меросро ҳарисона мехӯред",
            "verse 89:20": "ва молро фаровон дӯст доред.",
            "verse 89:21": "Оре, чун замин шикаста шавад ва шикаста шавад",
            "verse 89:22": "ва амри Парвардигори ту фаро расад ва фариштагон саф дар саф шаванд",
            "verse 89:23": "ва дар он рӯз ҷаҳаннамро ҳозир оранд, одамӣ панд гирад. Ва чӣ ҷои панд гирифтан бошад?",
            "verse 89:24": "Мегӯяд: «Эй кош ки барои ҳаёти ҷовидонаи худ пешопеш чизе мефиристодам».",
            "verse 89:25": "Дар он рӯз касе чун азоби ӯ азоб накунад",
            "verse 89:26": "ва монанди занҷири ӯ ба занҷир накашад.",
            "verse 89:27": "Эй рӯҳи оромишёфта,",
            "verse 89:28": "хушнуду писандида ба сӯи Парвардигорат бозгард",
            "verse 89:29": "ва дар зумраи бандагони Ман дохил шав",
            "verse 89:30": "ва ба биҳишти Ман дарой!"
        },
        "Tamil": {
            "verse 89:1": "விடியற் காலையின் மீது சத்தியமாக,",
            "verse 89:2": "பத்து இரவுகளின் மீது சத்தியமாக,",
            "verse 89:3": "இரட்டையின் மீதும், ஒற்றையின் மீதும் சத்தியமாக,",
            "verse 89:4": "செல்கின்ற இரவின் மீதும், சத்தியமாக,",
            "verse 89:5": "இதில் அறிவுடையோருக்கு (போதுமான) சத்தியம் இருக்கிறதல்லவா?",
            "verse 89:6": "உம்முடைய இறைவன் ஆ(து கூட்டத்)தை என்ன செய்தான் என்பதை நீர் பார்க்கவில்லையா?",
            "verse 89:7": "(அவர்கள்) தூண்களையுடைய 'இரம்' (நகர) வாசிகள்,",
            "verse 89:8": "அவர்கள் போன்ற ஒரு சமுதாயம் எந்த நாடுகளிலும் படைக்கப்படவில்லை.",
            "verse 89:9": "பள்ளத்தாக்குகளில் பாறைகளைக் குடைந்(து வசித்து வந்)த ஸமூது கூட்டத்தையும் (என்ன செய்தான் என்று பார்க்கவில்லையா?)",
            "verse 89:10": "மேலும், பெரும் படைகளைக் கொண்ட ஃபிர்அவ்னையும் (உம் இறைவன் என்ன செய்தான் என்பதை நீர் பார்க்கவில்லையா?)",
            "verse 89:11": "அவர்களெல்லாம் நாடுகளில் வரம்பு மீறி நடந்தனர்.",
            "verse 89:12": "அன்றியும், அவற்றில் குழப்பத்தை அதிகப்படுத்தினர்.",
            "verse 89:13": "எனவே, உம்முடைய இறைவன் அவர்கள் மேல் வேதனையின் சாட்டையை எறிந்தான்.",
            "verse 89:14": "நிச்சயமாக, உம்முடைய இறைவன் கண்காணித்துக் கொண்டு இருக்கிறன்றான்.",
            "verse 89:15": "ஆனால், இறைவன் மனிதனுக்கு கண்ணியப்படுத்தி, பாக்கியம் அளித்து அவனைச் சோதிக்கும் போது அவன்; \"என் இறைவன் என்னை கண்ணியப்படுத்தியுள்ளான்\" என்று கூறுகிறான்.",
            "verse 89:16": "எனினும் அவனுடைய உணவு வசதிகளைக் குறைத்து, அவனை (இறைவன்) சோதித்தாலோ, அவன், \"என் இறைவன் என்னைச் சிறுமைப் படுத்தி விட்டான்\" எனக் கூறுகின்றான்.",
            "verse 89:17": "அப்படியல்ல! நீங்கள் அநாதையைக் கண்ணியப்படுத்துவது இல்லை.",
            "verse 89:18": "ஏழைக்கு உணவளிக்குமாறு தூண்டுவதில்லை.",
            "verse 89:19": "இன்னும் (பிறருடைய) அநந்தரச் சொத்துக்களையும் (சேர்த்து) உண்டு வருகின்றீர்கள்.",
            "verse 89:20": "இன்னும், பொருளை அளவு கடந்து பிரியத்துடன் நேசிக்கின்றீர்கள்.",
            "verse 89:21": "அப்படியல்ல! பூமி தூள் தூளாகத் தகர்க்கப்படும் போது,",
            "verse 89:22": "உம்முடைய இறைவனும், வானவரும் அணியணியாக வரும்போது,",
            "verse 89:23": "அந்நாளில் நரகம் முன் கொண்டு வரப்படும் போது - அந்நாளில் மனிதன் உணர்வு பெறுவான்; அந்த (நாளில்) உணர்வு (பெறுவதினால்) அவனுக்கு என்ன பலன்.",
            "verse 89:24": "\"என் (மறுமை) வாழ்க்கைக்காக நன்மையை நான் முற்படுத்தி (அனுப்பி)யிருக்க வேண்டுமே!\" என்று அப்போது மனிதன் கூறுவான்.",
            "verse 89:25": "ஆனால் அந்நாளில் (அல்லாஹ் செய்யும்) வேதனையைப் போல், வேறு எவனும் வேதனை செய்யமாட்டான்.",
            "verse 89:26": "மேலும், அவன் கட்டுவது போல் வேறு எவனும் கட்டமாட்டான்.",
            "verse 89:27": "(ஆனால், அந்நாளில் நல்லடியார்களிடம்) சாந்தியடைந்த ஆத்மாவே!",
            "verse 89:28": "நீ உன்னுடைய இறைவன்பால் திருப்தி அடைந்த நிலையிலும், (அவன்) உன்மீது திருப்தியடைந்த நிலையிலும் மீளுவாயாக.",
            "verse 89:29": "நீ என் நல்லடியார்களில் சேர்ந்து கொள்வாயாக.",
            "verse 89:30": "மேலும், நீ என் சுவர்க்கத்தில் பிரவேசிப்பாயாக (என்று இறைவன் கூறுவான்)."
        },
        "Tatar": {
            "verse 89:1": "Таң белән.",
            "verse 89:2": "Вә ун төн белән ант итәм, ун төннән мырад зәл хиҗҗә аеның әүвәлге ун төннәредер, яки рамадан аеның ахыргы ун төннәредер.",
            "verse 89:3": "Корбан көне һам ґәрәфа көне белән яки мәхлук һәм халык белән ант итәмен.",
            "verse 89:4": "Вә төн белән ант итәм, һәркайчан ул төн үтеп китсә.",
            "verse 89:5": "Бу зекер ителгән нәрсәләрдә гакыл ияләре өчен чын ант бар түгелме?",
            "verse 89:6": "Әйә күрмисеңме Раббың Гад кавемен ни кылды, ягъни һәлак кылмадымы?",
            "verse 89:7": "Гад кавеменең бабалары озын баганалар кеби озын вә куәтле кавем иделәр.",
            "verse 89:8": "Алар кеби эре кешеләр шәһәрләрдә халык ителмәделәр, шулай булса да Аллаһ ґәзабына каршы тора алмадылар – һәммәсе һәлак булдылар.",
            "verse 89:9": "Вә Сәмуд кавемен ни кылды, алар вади дигән җирдә ташны кисеп бөек өйләр бина кылдылар.",
            "verse 89:10": "Вә Фиргаунгә ни кылды, кадаклар иясе ул Фиргаун, ягъни хатыны Асияне Аллаһуга иман китергән өчен кадаклар белән ґәзаблап үтерде.",
            "verse 89:11": "Ул Гад, Сәмуд вә Фиргаун шәһәрләрдә алар явызлыкны күп кылдылар.",
            "verse 89:12": "Вә, фәсәд золым эшләрне күп эшләделәр.",
            "verse 89:13": "Раббың аларга койды ґәзаб камчысын.",
            "verse 89:14": "Тәхкыйк синең Раббың фәсәд кылучы залимнәрне күзәтүче һәм аларны тотучыдыр.",
            "verse 89:15": "Әмма адәм баласы Раббысы аны дөнья байлыгы илә мүбтәлә кылса һәм дөнья эшләрендә кешеләр арасында хөрмәтле итсә, ул мине Аллаһ хөрмәтләде, дип, дөнья байлыгы белән генә үзен Аллаһуның дусты саныйдыр.",
            "verse 89:16": "Вә әмма Раббысы аның ризыгың кылып, ярлылык белән мүбтәлә итсә, ул Раббым мине хур итте, диядер.",
            "verse 89:17": "Юк кешенең Аллаһ каршында хөрмәте дөнья байлыгы белән түгел, бәлки чын иман, хак дин һәм изге гамәлләр беләндер. Хур булуы да ярлылык белән түгел, бәлки имансыз, динсез булу белән һәм нәфескә ияреп азгынлык кылу беләндер. Бәлки сез ятимнәрне хөрмәтләмисез.",
            "verse 89:18": "Бай булсагыз фәкыйрьләрне ашатырга, аларга мал бирергә кызыкмыйсыз һәм башкаларны да кызыктырмыйсыз.",
            "verse 89:19": "Һәм мирас малын, ягъни үлгән кешедән калган мал – тол хатын вә ятимнәр хакыдыр, сез шул малның хәрам икәнен тикшермәстән ашый бирәсез.",
            "verse 89:20": "Вә дөнья малын бик нык сөю белән сөясез.",
            "verse 89:21": "Юк, шәригатьне бозмагыз, мирас малын ашамагыз, әгәр җир каты тетрәү белән тетрәсә.",
            "verse 89:22": "Вә Раббыңның әмере килсә, вә фәрештәләр саф-саф булып килеп бассалар.",
            "verse 89:23": "Вә ул көндә җәһәннәм китерелсә, менә шул көндә адәм баласының исенә төшер, алданганын белер, вәгазьләнергә бик теләр, ләкин эш узган булыр, кайда инде аңа хәзер искәрү, уяну файда бирсен?",
            "verse 89:24": "Эш узганнан соң адәм баласы әйтер: \"Әй миңа үкенеч кәшки дөньяда чагымда дини гыйлем өйрәнеп ахирәтем өчен изге гамәлләр кылган булсамчы\", – дип.",
            "verse 89:25": "Ул көндә Аллаһуның ґәзабы илә һичкем ґәзаб кыла алмас, мәгәр Аллаһ әмере белән ґәзаб фәрештәләре ґәзаб кылырлар.",
            "verse 89:26": "Дәхи чылбыр богаулар белән һичкем бәйләмәс, мәгәр Аллаһ әмере белән бәйләрләр.",
            "verse 89:27": "Тик Аллаһуга вә расүлгә итагать итеп гөнаһлардан сакланучы вә изге гамәлләр генә кылучы изге нәфес яхшы мөселманның рухына:",
            "verse 89:28": "\"Синең дөньяда өлешең бетте һәм бурычың үтәлде инде, Аллаһудан разый булганың хәлдә һәм Аллаһ синнән разый булган хәлдә Раббыңа кайткыл!",
            "verse 89:29": "Минем изге бәндәләрем арасына кергел.",
            "verse 89:30": "Һәм Минем җәннәтемә мәңгегә кергел!\" – диелер"
        },
        "Telugu": {
            "verse 89:1": "ప్రాంతః కాలం సాక్షిగా",
            "verse 89:2": "పది రాత్రుల సాక్షిగా",
            "verse 89:3": "సరి బేసీల సాక్షిగా",
            "verse 89:4": "గడచిపోయే రాత్రి సాక్షిగా",
            "verse 89:5": "వీటిలో బుద్ధిగల వాని కొరకు ఏ ప్రమాణమూ లేదా ఏమిటి",
            "verse 89:6": "నీ ప్రభువు ఆద్ (జాతి) వారి పట్ల ఎలా వ్యవహరించాడో నీకు తెలియదా",
            "verse 89:7": "ఎత్తైన స్థంభాల (భవనాలు గల) ఇరమ్ ప్రజల పట్ల",
            "verse 89:8": "వారిలాంటి జాతి భూమిలో ఎన్నడూ సృష్టించబడలేదు",
            "verse 89:9": "మరియు లోయలలోని కొండరాళ్ళలో (భవనాలను) తొలిచిన సమూద్ జాతి పట్ల",
            "verse 89:10": "మరియు మేకులవాడైన ఫిర్ఔన్ పట్ల",
            "verse 89:11": "వారంతా ఆయా దేశాలలో తలబిరుసుతనంతో ప్రవర్తించారు",
            "verse 89:12": "మరియు వాటిలో దౌర్జన్యాన్ని రేకెత్తించారు",
            "verse 89:13": "కాబట్టి నీ ప్రభువు వారిపైకి అనేక రకాల బాధాకరమైన శిక్షలను పంపాడు",
            "verse 89:14": "వాస్తవానికి, నీ ప్రభువు మాటు వేసి ఉన్నాడు (అంతా కనిపెడ్తూ ఉంటాడు)",
            "verse 89:15": "అయితే మానవుడు ఎలాంటి వాడంటే: అతని ప్రభువు అతన్ని పరీక్షించటానికి, అతనికి గౌరవ ప్రతిష్టల నిచ్చి అనుగ్రహించి నప్పుడు: నా ప్రభువు నన్ను గౌరవించాడు.\" అని అంటాడు",
            "verse 89:16": "కాని, అతన్ని పరీక్షించటానికి, అతని ఉపాధిని తగ్గించినప్పుడు: నా ప్రభువు నన్ను అవమానించాడు.\" అని అంటాడు",
            "verse 89:17": "అలా కాదు, వాస్తవానికి మీరు అనాథులను ఆదరించరు",
            "verse 89:18": "మరియు మీరు పేదలకు అన్నం పెట్టే విషయంలో ఒకరినొకరు ప్రోత్సహించుకోరు",
            "verse 89:19": "మరియు వారసత్వపు ఆస్తిని పేరాశతో అంతా మీరే తినేస్తారు",
            "verse 89:20": "మరియు మీరు ధనవ్యామోహంలో దారుణంగా చిక్కుకు పోయారు",
            "verse 89:21": "అలా కాదు, భూమి, దంచి పిండిపిండిగా చేయబడినపుడు",
            "verse 89:22": "మరియు నీ ప్రభువు (స్వయంగా) వస్తాడు మరియు దేవదూతలు వరుసలలో వస్తారు",
            "verse 89:23": "ఆ రోజు నరకం (ముందుకు) తీసుకు రాబడుతుంది. ఆ రోజు మానవుడు (తన కర్మలన్నీ) జ్ఞప్తికి తెచ్చుకుంటాడు; కాని ఆ రోజు జ్ఞప్తికి తెచ్చుకోవడం వల్ల అతనికి కలిగే ప్రయోజనమేమిటీ",
            "verse 89:24": "అతడు: అయ్యో! నా పాడుగానూ! నా ఈ జీవితం కొరకు నేను (సత్కార్యాలు) చేసి పంపు కొని ఉంటే ఎంత బాగుండేది!\" అని వాపోతాడు",
            "verse 89:25": "అయితే, ఆ రోజు, ఆయన (అల్లాహ్) శిక్షించినట్లు, మరెవ్వడూ శిక్షించలేడు",
            "verse 89:26": "మరియు ఆయన (అల్లాహ్) బంధించినట్లు, మరెవ్వడూ బంధించలేడు",
            "verse 89:27": "(సన్మార్గునితో ఇలా అనబడుతుంది): ఓ తృప్తి పొందిన ఆత్మా",
            "verse 89:28": "నీ ప్రభువు సన్నిధికి మరలి రా! (నీకు లభించే సత్ఫలితానికి) ఆనందిస్తూ మరియు (నీ ప్రభువునకు) ప్రియమైనదానివై",
            "verse 89:29": "నీవు (పుణ్యాత్ములైన) నా దాసులలో చేరిపో",
            "verse 89:30": "మరియు నీవు నా స్వర్గంలో ప్రవేశించు"
        },
        "Thai": {
            "verse 89:1": "ขอสาบานด้วยยามรุ่งอรุณ",
            "verse 89:2": "และด้วยค่ำคืนทั้งสิบ",
            "verse 89:3": "และด้วยสิ่งที่เป็น คู่ และที่เป็นคี่",
            "verse 89:4": "และด้วยเวลากลางคืนเมื่อมันโคจรไป",
            "verse 89:5": "ในดังกล่าวนั้นเป็นการสาบาน สำหรับผู้ที่มีปัญญามิใช่หรือ?",
            "verse 89:6": "เจ้าไม่เห็นดอกหรือว่า พระเจ้าของเจ้ากระทำต่อพวกอ๊าดอย่างไร ?",
            "verse 89:7": "(แห่ง) อิร็อม พวกมีเสาหินสูงตะหง่าน",
            "verse 89:8": "ซึ่งเยี่ยงนั้นมิได้ถูกสร้างตามหัวเมืองต่าง ๆ",
            "verse 89:9": "และพวกซะมูดผู้สกัดหิน ณ หุบเขา",
            "verse 89:10": "และฟิรเอานฺ เจ้าแห่งตรึงเสาเต๊นท์",
            "verse 89:11": "บรรดาผู้ละเมิดเหล่านั้นตามหัวเมืองต่าง ๆ",
            "verse 89:12": "แล้วก่อความเสียหายอย่างมากมายในหัวเมืองเหล่านั้น",
            "verse 89:13": "ดังนั้นพระเจ้าของเจ้าจึงกระหน่ำการลงโทษนานาชนิดบนพวกเขา",
            "verse 89:14": "แท้จริงพระเจ้าของเจ้านั้นทรงเฝ้าดูอย่างแน่นอน",
            "verse 89:15": "ส่วนมนุษย์นั้น เมื่อพระเจ้าของเขาทรงทดสอบเขา โดยทรงให้เกียรติเขาและทรงโปรดปรานเขา เขาก็จะกล่าวว่าพระเจ้าของฉันทรงยกย่องฉัน",
            "verse 89:16": "แต่ครั้งเมื่อพระองค์ทรงทดสอบเขาทรงให้การครองชีพของเขาเป็นที่คับแคบแก่เขา เขาก็จะกล่าวว่า พระเจ้าของฉันทรงเหยียดหยามฉัน",
            "verse 89:17": "มิใช่เช่นนั้นดอก แต่ว่าพวกเจ้ามิได้ให้เกียรติแก่เด็กกำพร้าต่างหาก",
            "verse 89:18": "และพวกเจ้ามิได้ส่งเสริมกันในการให้อาหารแก่คนยากจนขัดสน",
            "verse 89:19": "และพวกเจ้ากินมรดกกันอย่างหมดเกลี้ยง",
            "verse 89:20": "และพวกเจ้ารักสมบัติกันอย่างมากมาย",
            "verse 89:21": "หามิได้ เมื่อแผ่นดินถูกทำให้สั่นสะเทือนเป็นผุยผง",
            "verse 89:22": "และพระเจ้าของเจ้าเสด็จมาพร้อมทั้งมะลาอิกะฮฺด้วยเป็นแถว ๆ",
            "verse 89:23": "และวันนั้นนรกญะฮันนัมจะถูกนำมาให้ปรากฏ ในวันนั้นมนุษย์จะรำลึกขึ้นมาได้ แต่การรำลึกนั้นจะมีผลแก่เขาได้อย่างไร ?",
            "verse 89:24": "เขาจะกล่าวว่า โอ้ถ้าฉันได้ทำความดีไว้ล่วงหน้าสำหรับชีวิตของฉัน",
            "verse 89:25": "แล้วในวันนั้นไม่มีผู้ใดลงโทษเช่น การลงโทษของพระองค์",
            "verse 89:26": "และไม่มีผู้ใดผูกมัด เช่นการผูกมัดของพระองค์",
            "verse 89:27": "โอ้ชีวิตที่สงบแน่นเอ๋ย",
            "verse 89:28": "จงกลับมายังพระเจ้าของเจ้าด้วยความยินดีและเป็นที่ปิติเถิด",
            "verse 89:29": "แล้วจงเข้ามาอยู่ในหมู่ปวงบ่าวของข้าเถิด",
            "verse 89:30": "และจงเข้ามาอยู่ในสวนสวรรค์ของข้าเถิด"
        },
        "Turkish": {
            "verse 89:1": "Tanyerinin ağarmasına and olsun;",
            "verse 89:2": "Zilhicce ayının ilk on gecesine and olsun;",
            "verse 89:3": "Herşeyin çiftine de, tekine de and olsun;",
            "verse 89:4": "Gelip geçen geceye and olsun ki, bunların her biri akıl sahibi için birer yemine değmez mi?",
            "verse 89:5": "Gelip geçen geceye and olsun ki, bunların her biri akıl sahibi için birer yemine değmez mi?",
            "verse 89:6": "Rabbinin, hiçbir memlekette benzeri ortaya konmayan sütunlara sahip İrem şehrinde oturan Ad milletine ne ettiğini görmedin mi?",
            "verse 89:7": "Rabbinin, hiçbir memlekette benzeri ortaya konmayan sütunlara sahip İrem şehrinde oturan Ad milletine ne ettiğini görmedin mi?",
            "verse 89:8": "Rabbinin, hiçbir memlekette benzeri ortaya konmayan sütunlara sahip İrem şehrinde oturan Ad milletine ne ettiğini görmedin mi?",
            "verse 89:9": "Vadide kayaları kesip yontan Semud milletine, memleketlerde aşırı giden, oralarda bozgunculuğu artıran, sarsılmaz bir saltanat sahibi Firavun'a Rabbinin ne ettiğini görmedin mi?",
            "verse 89:10": "Vadide kayaları kesip yontan Semud milletine, memleketlerde aşırı giden, oralarda bozgunculuğu artıran, sarsılmaz bir saltanat sahibi Firavun'a Rabbinin ne ettiğini görmedin mi?",
            "verse 89:11": "Vadide kayaları kesip yontan Semud milletine, memleketlerde aşırı giden, oralarda bozgunculuğu artıran, sarsılmaz bir saltanat sahibi Firavun'a Rabbinin ne ettiğini görmedin mi?",
            "verse 89:12": "Vadide kayaları kesip yontan Semud milletine, memleketlerde aşırı giden, oralarda bozgunculuğu artıran, sarsılmaz bir saltanat sahibi Firavun'a Rabbinin ne ettiğini görmedin mi?",
            "verse 89:13": "Rabbin onları azap kırbacından geçirmiştir.",
            "verse 89:14": "Doğrusu Rabbin hep gözetlemektedir.",
            "verse 89:15": "Rabbin denemek için bir insana iyilik edip, nimet verdiği zaman, o: \"Rabbim beni şerefli kıldı\" der.",
            "verse 89:16": "Ama onu sınamak için rızkını daraltıp bir ölçüye göre verdiği zaman: \"Rabbim bana hor baktı\" der.",
            "verse 89:17": "Hayır; yetime karşı cömert davranmıyorsunuz.",
            "verse 89:18": "Yoksulu yedirmek konusunda birbirinize özenmiyorsunuz.",
            "verse 89:19": "Size kalan mirası hak gözetmeden yiyorsunuz.",
            "verse 89:20": "Malı pek çok seviyorsunuz.",
            "verse 89:21": "Ama yer, çarpılıp paralandığı zaman;",
            "verse 89:22": "Melekler sıra sıra dizilip, Rabbinin buyruğu gelince,",
            "verse 89:23": "O gün, cehennem ortaya konur. O gün insan öğüt almaya çalışır ama artık öğütten ona ne?",
            "verse 89:24": "\"Keşke bu hayatım için önceden bir şey yapsaymışım\" der.",
            "verse 89:25": "O gün, hiç kimse, Allah'ın azabettiği gibi azabedemez.",
            "verse 89:26": "Hiç kimse O'nun vurduğu bağ gibisini bağlayamaz.",
            "verse 89:27": "Ey huzur içinde olan can!",
            "verse 89:28": "O, senden, sen de O'ndan hoşnut olarak Rabbine dön!",
            "verse 89:29": "Ey can! İyi kullarımın arasına gir.",
            "verse 89:30": "Cennetime gir."
        },
        "Urdu": {
            "verse 89:1": "فجر کی قسم",
            "verse 89:2": "اور دس راتوں کی",
            "verse 89:3": "اور جفت اور طاق کی",
            "verse 89:4": "اور رات کی جب جانے لگے",
            "verse 89:5": "اور بے شک یہ چیزیں عقلمندوں کے نزدیک قسم کھانے کے لائق ہیں کہ (کافروں کو ضرور عذاب ہو گا)",
            "verse 89:6": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے عاد کے ساتھ کیا کیا",
            "verse 89:7": "(جو) ارم (کہلاتے تھے اتنے) دراز قد",
            "verse 89:8": "کہ تمام ملک میں ایسے پیدا نہیں ہوئے تھے",
            "verse 89:9": "اور ثمود کے ساتھ (کیا کیا) جو وادئِ (قریٰ) میں پتھر تراشتے تھے (اور گھر بناتے) تھے",
            "verse 89:10": "اور فرعون کے ساتھ (کیا کیا) جو خیمے اور میخیں رکھتا تھا",
            "verse 89:11": "یہ لوگ ملکوں میں سرکش ہو رہے تھے",
            "verse 89:12": "اور ان میں بہت سی خرابیاں کرتے تھے",
            "verse 89:13": "تو تمہارے پروردگار نے ان پر عذاب کا کوڑا نازل کیا",
            "verse 89:14": "بے شک تمہارا پروردگار تاک میں ہے",
            "verse 89:15": "مگر انسان (عجیب مخلوق ہے کہ) جب اس کا پروردگار اس کو آزماتا ہے تو اسے عزت دیتا اور نعمت بخشتا ہے۔ تو کہتا ہے کہ (آہا) میرے پروردگار نے مجھے عزت بخشی",
            "verse 89:16": "اور جب (دوسری طرح) آزماتا ہے کہ اس پر روزی تنگ کر دیتا ہے تو کہتا ہے کہ (ہائے) میرے پروردگار نے مجھے ذلیل کیا",
            "verse 89:17": "نہیں بلکہ تم لوگ یتیم کی خاطر نہیں کرتے",
            "verse 89:18": "اور نہ مسکین کو کھانا کھلانے کی ترغیب دیتے ہو",
            "verse 89:19": "اور میراث کے مال سمیٹ کر کھا جاتے ہو",
            "verse 89:20": "اور مال کو بہت ہی عزیز رکھتے ہو",
            "verse 89:21": "تو جب زمین کی بلندی کوٹ کوٹ کو پست کر دی جائے گی",
            "verse 89:22": "اور تمہارا پروردگار (جلوہ فرما ہو گا) اور فرشتے قطار باندھ باندھ کر آ موجود ہوں گے",
            "verse 89:23": "اور دوزخ اس دن حاضر کی جائے گی تو انسان اس دن متنبہ ہو گا مگر تنبہ (سے) اسے (فائدہ) کہاں (مل سکے گا)",
            "verse 89:24": "کہے گا کاش میں نے اپنی زندگی (جاودانی کے لیے) کچھ آگے بھیجا ہوتا",
            "verse 89:25": "تو اس دن نہ کوئی خدا کے عذاب کی طرح کا (کسی کو) عذاب دے گا",
            "verse 89:26": "اور نہ کوئی ویسا جکڑنا جکڑے گا",
            "verse 89:27": "اے اطمینان پانے والی روح!",
            "verse 89:28": "اپنے پروردگار کی طرف لوٹ چل۔ تو اس سے راضی وہ تجھ سے راضی",
            "verse 89:29": "تو میرے (ممتاز) بندوں میں شامل ہو جا",
            "verse 89:30": "اور میری بہشت میں داخل ہو جا"
        },
        "Uyghur": {
            "verse 89:1": "سۈبھى بىلەن، (زۇلھەججىنىڭ دەسلەپكى) ئون كېچىسى، بىلەن قۇربانلىق كۈنى بىلەن، قەسەمكى، (كاپىرلارغا ئازاب قىلىمىز)",
            "verse 89:2": "سۈبھى بىلەن، (زۇلھەججىنىڭ دەسلەپكى) ئون كېچىسى، بىلەن قۇربانلىق كۈنى بىلەن، قەسەمكى، (كاپىرلارغا ئازاب قىلىمىز)",
            "verse 89:3": "سۈبھى بىلەن، (زۇلھەججىنىڭ دەسلەپكى) ئون كېچىسى، بىلەن قۇربانلىق كۈنى بىلەن، قەسەمكى، (كاپىرلارغا ئازاب قىلىمىز)",
            "verse 89:4": "سۈبھى بىلەن، (زۇلھەججىنىڭ دەسلەپكى) ئون كېچىسى، بىلەن قۇربانلىق كۈنى بىلەن، قەسەمكى، (كاپىرلارغا ئازاب قىلىمىز)",
            "verse 89:5": "ئەقىل ئىگىسىگە بۇنىڭدا (يەنى يۇقىرىقى نەرسىلەردە قانائەتلىنەرلىك) قەسەم بارمۇ؟",
            "verse 89:6": "پەرۋەردىگارىڭنىڭ ئاد - كۈچلۈك ئىرەمنى قانداق جازالىغانلىقىنى كۆرمىدىڭمۇ؟",
            "verse 89:7": "پەرۋەردىگارىڭنىڭ ئاد - كۈچلۈك ئىرەمنى قانداق جازالىغانلىقىنى كۆرمىدىڭمۇ؟",
            "verse 89:8": "بۇنداق ئادەملەر باشقا شەھەرلەردە يارىتىلمىغان ئىدى",
            "verse 89:9": "شۇنىڭدەك ۋادىقورادا تاشلارنى كېسىپ (ئۆيلەرنى بىنا قىلغان) سەمۇدنى اﷲ قانداق جازالىدى",
            "verse 89:10": "شۇنىڭدەك قۇزۇقلار ئىگىسى پىرئەۋننى قانداق جازالىدى",
            "verse 89:11": "ئۇلار شەھەرلەردە (زۇلۇم قىلىشتا) ھەددىدىن ئاشتى",
            "verse 89:12": "ئۇ يەرلەردە بۇزغۇنچىلىقنى كۆپ قىلدى",
            "verse 89:13": "پەرۋەردىگارىڭ ئۇلارغا قاتتىق ئازابنى نازىل قىلدى",
            "verse 89:14": "پەرۋەردىگارىڭ (بەندىلەرنى) ئەلۋەتتە كۆزىتىپ تۇرغۇچىدۇر",
            "verse 89:15": "پەرۋەردىگارى ئىنساننى سىناپ ئەزىز قىلسا ۋە ئۇنىڭغا نېمەت بەرسە، ئۇ پەرۋەردىگارىم مېنى ئەزىز قىلدى» دەيدۇ",
            "verse 89:16": "پەرۋەردىگارى ئىنساننى سىناپ رىزقنى تار قىلسا، ئۇ: «پەرۋەردىگارىم مېنى خار قىلدى» دەيدۇ",
            "verse 89:17": "ھەرگىز ئۇنداق ئەمەس، سىلەر يېتىمنى ھۆرمەت قىلمايسىلەر",
            "verse 89:18": "بىر - بىرىڭلارنى مىسكىنگە ئاش، نان بېرىشكە تەرغىب قىلمايسىلەر",
            "verse 89:19": "مىراسنى (ھالال–ھارام دېمەستىن) ھە دەپ يەيسىلەر",
            "verse 89:20": "مالنى (ھېرىسلىق بىلەن) ناھايىتى دوست تۇتىسىلەر",
            "verse 89:21": "(ئى غاپىللار!) بۇنىڭدىن يېنىڭلار، زېمىن ئارقىمۇئارقا تەۋرىتىلگەن چاغدا",
            "verse 89:22": "پەرۋەردىگارىڭ كەلگەن ۋە پەرىشتىلەر سەپ - سەپ بولۇپ كەلگەن چاغدا",
            "verse 89:23": "(گۇناھكارلارنى كۆرۈش ئۈچۈن) جەھەننەم كەلتۈرۈلگەن چاغدا، شۇ كۈندە ئىنسان (يەنى كاپىر) (دۇنيادىكى قىلمىشلىرىنى) ئەسلەيدۇ، (بۇ چاغدا) ئەسلىگەننىڭ ئۇنىڭغا نېمە پايدىسى بولسۇن",
            "verse 89:24": "ئۇ ئېيتىدۇكى: «كاشكى مەن (دۇنيادىكى) ھايات ۋاقتىمدا ياخشى ئىشلارنى قىلغان بولسامچۇ!»",
            "verse 89:25": "شۇ كۈندە ھەر ئەھەدى (اﷲ قا ئاسىيلىق قىلغانلارنى) اﷲ جازالىغاندەك جازالىمايدۇ",
            "verse 89:26": "ھەمدە ھېچ ئەھەدى اﷲ باغلىغاندەك باغلىمايدۇ",
            "verse 89:27": "ئى ئارام تاپقۇچى جان!",
            "verse 89:28": "سەن پەرۋەردىگارىڭدىن مەمنۇن، پەرۋەردىگارىڭ سەندىن رازى بولغان ھالدا، ئۇنىڭ دەرگاھىغا قايتقىن",
            "verse 89:29": "سەن مېنىڭ (ياخشى) قاتارىغا قوشۇلغىن",
            "verse 89:30": "مېنىڭ جەننىتىمگە كىرگىن"
        },
        "Uzbek": {
            "verse 89:1": "Фажр билан қасам.",
            "verse 89:2": "Ва ўн кеча билан қасам.",
            "verse 89:3": "Жуфту тоқ билан қасам.",
            "verse 89:4": "Ва юрилган тун билан қасам.",
            "verse 89:5": "Мана шуларда ақл эгаси учун (қаноатлантирувчи) қасам бордир?!",
            "verse 89:6": "Сен Роббинг Одга қандай (муомала) қилганинни билмадингми?",
            "verse 89:7": "Баланд устунли «Ирам»га.",
            "verse 89:8": "Унинг мисли бошқа диёрларда халқ қилинмаганга.",
            "verse 89:9": "Ва водийда харсанг тошларни кесган Самудга.",
            "verse 89:10": "Ва кўп аскарлари бор Фиръавнга.",
            "verse 89:11": "Улар турли ўлкаларда туғёнга кетган эдилар.",
            "verse 89:12": "Улар у(ўлка)ларда бузғунчиликни кўпайтирдилар.",
            "verse 89:13": "Бас, Роббинг уларнинг бошига турли азобларни қуйди.",
            "verse 89:14": "Албатта, Роббинг кузатиб турувчидир.",
            "verse 89:15": "Бас, қачон инсонни Роббиси синаш учун икром қилса ва неъмат берса: «Мени Роббим икром қилди», дейдир.",
            "verse 89:16": "Бас, қачон Роббиси синаш учун ризқини тор қилиб қўйса: «Роббим мени хорлади», дейдир.",
            "verse 89:17": "Йўқ! Балки Сизлар етимларни икром қилмассизлар.",
            "verse 89:18": "Бир-бирингизни мискинларга таом беришга ундамассизлар.",
            "verse 89:19": "Ва меросни шиддатла ейсизлар.",
            "verse 89:20": "Ва молни кўп яхши кўрасизлар.",
            "verse 89:21": "Йўқ! Вақтики, ер зилзилага тушиб парча-парча бўлиб кетса.",
            "verse 89:22": "Ва Роббинг ва фаришталар саф-саф бўлиб келса.",
            "verse 89:23": "Ва ўша кунда жаҳаннамни келтирилса, ўша кунда инсон эслайдир. Лекин бу эслашдан энди не фойда?!",
            "verse 89:24": "У, афсуски, (охират) ҳаётимга ҳам бирор нарса тақдим қилсам бўлар экан, дейдир.",
            "verse 89:25": "Бас, ўша кунда Аллоҳнинг азобига ўхшаш азобла ҳеч ким азобламас.",
            "verse 89:26": "Ва Унинг боғлашига ўхшаш ҳеч ким боғламас.",
            "verse 89:27": "Эй хотиржам нафс!",
            "verse 89:28": "Роббингга сен Ундан, У сендан рози бўлган ҳолингда қайт!",
            "verse 89:29": "Бас, бандаларим ичига киргин!",
            "verse 89:30": "Ва жаннатимга киргин!"
        },
        "Vietnamese": {
            "verse 89:1": "Thề bởi rạng đông.",
            "verse 89:2": "Thề bởi mười đêm (đầu tiên của tháng Zdul-Hijjah).",
            "verse 89:3": "Thề bởi sự chẵn và lẻ (của các sự vật).",
            "verse 89:4": "Thề bởi sự chẵn và lẻ (của các sự vật).",
            "verse 89:5": "Chẳng lẽ đó không phải là một bằng chứng cho những người hiểu biết trong các sự việc đó ư?",
            "verse 89:6": "Ngươi (Thiên Sứ Muhammad) không thấy Thượng Đế của Ngươi đã đối xử thế nào với đám dân ‘Ad sao?",
            "verse 89:7": "(Một dân tộc của thị trấn) Iram có nhiều trụ cột cao.",
            "verse 89:8": "Nơi mà không có nơi nào được tạo ra giống như nó cả.",
            "verse 89:9": "Người dân Thamud thì lại đục đá làm nhà trong thung lũng.",
            "verse 89:10": "Và Pha-ra-ông, chủ nhân của các trụ cột.",
            "verse 89:11": "Chúng đã hành động thái quá và tàn bạo trong xứ sở.",
            "verse 89:12": "Chúng đã làm nhiều tội lỗi trong xứ.",
            "verse 89:13": "Vì vậy, Thượng Đế của Ngươi đã giáng xuống chúng những hình phạt.",
            "verse 89:14": "Quả thật, Thượng Đế của Ngươi (Thiên Sứ Muhammad) luôn theo dõi và quan sát.",
            "verse 89:15": "Quả thật, con người khi được Thượng Đế của y thử thách y với danh dự và ân huệ thì y nói: Thượng Đế của tôi đã ban cho tôi niềm vinh dự.",
            "verse 89:16": "Nhưng khi y bị thử thách với việc thu hẹp bổng lộc thì y lại bảo: Thượng Đế của tôi đã hạ nhục tôi.",
            "verse 89:17": "Không. Thật ra các ngươi không yêu quý trẻ mồ côi.",
            "verse 89:18": "Các ngươi cũng chẳng khuyến khích nhau nuôi ăn người túng thiếu.",
            "verse 89:19": "Các ngươi tham lam nuốt chửng tài sản thừa kế.",
            "verse 89:20": "Các ngươi chỉ biết yêu thích tài sản và của cải một cách quá mức.",
            "verse 89:21": "Không. Khi trái đất bị nghiền nát thành bụi.",
            "verse 89:22": "Khi Thượng Đế của Ngươi xuất hiện và các Thiên Thần đứng xếp thành hàng chỉnh tề.",
            "verse 89:23": "Và Ngày đó, Hỏa Ngục được mang đến. Ngày đó, con người sẽ thức tỉnh nhưng sự thức tỉnh đó chỉ là vô ích.",
            "verse 89:24": "Lúc đó, y sẽ than: Ước gì mình đã gởi đi cho cuộc sống này của mình.",
            "verse 89:25": "Ngày đó, không có ai trừng phạt giống như Ngài trừng phạt.",
            "verse 89:26": "Và không có một ai trói giống như Ngài trói cả.",
            "verse 89:27": "(Allah phán bảo các linh hồn của những người có đức tin): “Này hỡi linh hồn thanh thản!”",
            "verse 89:28": "“Hãy trở về với Thượng Đế của ngươi một cách hài lòng và toại nguyện.”",
            "verse 89:29": "“Hãy nhập cùng với những bề tôi đức hạnh của TA.”",
            "verse 89:30": "“Và hãy đi vào Thiên Đàng của TA.”"
        },
        "Yoruba": {
            "verse 89:1": "Allahu bura pelu afemojumo",
            "verse 89:2": "O tun bura pelu awon oru mewaa kan",
            "verse 89:3": "O tun bura pelu meji ati eyo",
            "verse 89:4": "O tun bura pelu oru nigba ti o ba lo (ti o ba de)",
            "verse 89:5": "Nje ibura wa ninu iyen fun onilaakaye",
            "verse 89:6": "Se o o ri bi Oluwa re ti se oro ara ‘Ad",
            "verse 89:7": "(iyen awon iran) ’Irom, awon omiran",
            "verse 89:8": "awon ti A o da iru won mo sinu ilu",
            "verse 89:9": "Ati awon Thamud ti won gbe (ile igbe) sinu apata ninu afonifoji",
            "verse 89:10": "ati Fir‘aon eleekan (iya)",
            "verse 89:11": "(Awon wonyi ni) awon t’o tayo enu-ala ninu ilu",
            "verse 89:12": "Won si se ibaje pupo sinu re",
            "verse 89:13": "Oluwa re si rojo iya le won lori",
            "verse 89:14": "Dajudaju Oluwa re wa ni ibuso (ise eda)",
            "verse 89:15": "Nitori naa, ni ti eniyan, nigba ti Oluwa re ba dan an wo, ti O pon on le, ti O si se idera fun un, nigba naa o maa wi pe: \"Oluwa mi ti pon mi le",
            "verse 89:16": "Sugbon nigba ti O ba dan an wo, ti O gan arisiki re le e lowo, nigba naa o maa wi pe: \"Oluwa mi ti yepere mi",
            "verse 89:17": "Rara, ko ri bee. Amo, eyin ko saponle omo-orukan",
            "verse 89:18": "Ati pe eyin ko gbera yin longbe lati fun mekunnu ni ounje",
            "verse 89:19": "E tun n je ogun ni ijekuje",
            "verse 89:20": "Ati pe e nifee si dukia ni ife pupo",
            "verse 89:21": "Rara, (ko ye ko ri bee). Nigba ti won ba mi ile titi ni mimi titi (t’o run womuwomu, ti ko si koto, ti ko si gelemo)",
            "verse 89:22": "(ti) Oluwa re de pelu awon molaika ni owoowo owoowo",
            "verse 89:23": "ni ojo yen ni won maa mu ina Jahanamo wa. Ni ojo yen, eniyan yoo ranti (oro ara re). Bawo si ni iranti naa se le wulo fun un",
            "verse 89:24": "O maa wi pe: \"Yee, emi iba ti ti (ise rere) siwaju fun isemi mi",
            "verse 89:25": "Ni ojo yen, eni kan ko le fi iya je (eda) bi iru iya (ti) Allahu (yoo fi je e)",
            "verse 89:26": "Eni kan ko si le de (eda) ni igbekun bi iru igbekun (ti) Allahu (yoo fi de e)",
            "verse 89:27": "Iwo emi olufokanbale",
            "verse 89:28": "pada si odo Oluwa re ni oluyonu, eni iyonu",
            "verse 89:29": "Nitori naa, wole saaarin awon erusin Mi",
            "verse 89:30": "Wo inu Ogba Idera Mi"
        }
    }
}