{
    "id": 89,
    "name_simple": "Al-Fajr",
    "revelation_place": "makkah",
    "revelation_order": 10,
    "bismillah_pre": true,
    "verses_count": 30,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah is so designated after the word wal-fajr with which it opens.",
    "text": [
        "\n",
        "The Surah is so designated after the word wal-fajr with which it opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its contents show that it was revealed at the stage when persecution of the new converts to Islam had begun in Makkah. On that very basis the people of Makkah have been warned of the evil end of the tribes of Ad and Thamud and of Pharaoh.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to affirm the meting out of rewards and punishments in the Hereafter, which the people of Makkah were not prepared to acknowledge, Let us consider the reasoning in the order in which it has been presented.",
        "\n",
        "First of all, swearing oaths by the dawn, the ten nights, the even and the odd, and the departing night, the listeners have been asked: \"Are these things not enough to testify to the truth of that which you are refusing to acknowledge?\" From the explanation that we have given of these four things in the corresponding notes, it will become clear that these things are a symbol of the regularity that exists in the night and day, and swearing oaths by these the question has been asked in the sense: Even after witnessing this wise system established by God, do you still need any other evidence to show that it is not beyond the power of that God Who has brought about this system to establish the Hereafter, and that it is the very requirement of his wisdom that He should call man to account for his deeds?",
        "\n",
        "Then, reasoning from man's own history, the evil end of the Ad and the Thamud and Pharaoh has been cited as an example to show that when they transgressed all limits and multiplied corruption in the earth, Allah laid upon them the scourge of His chastisement. This is a proof of the fact that the system of the universe is not being run by deaf and blind forces, nor is the world a lawless kingdom of a corrupt ruler, but a Wise Ruler is ruling over it, the demand of Whose wisdom and justice is continuously visible in the world itself in man's own history that He should call to account, and reward and punish accordingly, the being whom He has blessed with reason and moral sense and given the right of appropriation in the world.",
        "\n",
        "After this, an appraisal has been made of the general moral state of human society of which Arab paganism was a conspicuous example; two aspects of it in particular, have been criticized: first the materialistic attitude of the people on account of which overlooking the moral good and evil, they regarded only the achievement of worldly wealth, rank and position, or the absence of it, as the criterion of honor or disgrace, and had forgotten that neither riches was a reward nor poverty a punishment, but that Allah is trying man in both conditions to see what attitude he adopts when blessed with wealth and how he behaves when afflicted by poverty. Second, the people's attitude under which the orphan child in their society was left destitute on the death of the father. Nobody asked after the poor; whoever could, usurped the whole heritage left by the deceased parent, and drove away the weak heirs fraudulently. The people were so afflicted with an insatiable greed for wealth that\r\nthey were never satisfied however much they might hoard and amass. This criticism is meant to make them realize as to why the people with such an attitude and conduct in the life of the world should not be called to account for their misdeeds.",
        "\n",
        "The discourse has been concluded with the assertion that accountability shall certainly be held and it will be held on the Day when the Divine Court will be established. At that time the deniers of the judgment will understand that which they are not understanding now in spite of instruction and admonition, but understanding then will be of no avail. The denier will regret and say, \"Would that I had provided for this Day beforehand while I lived in the world.\" But his regrets will not save him from Allah's punishment. However, as for the people who would have accepted the Truth, which the heavenly books and the Prophets of God were presenting, with full satisfaction of the heart in the world, Allah will be pleased with them and they will be well pleased with the rewards bestowed by Allah. They will be called upon to join the righteous and enter Paradise.",
        "\n"
    ],
    "description": "The surah that opens with the oath of the Divine One swearing by The Dawn, and other natural occurrences and sacred designations, as a means of categorical airmation to mankind that God shall, indeed, hold all people accountable. It is names after “the dawn” (al-fajr) mentioned in verse 1. A surah in which God emphasizes that the tyrants of the Prophet’s time will be like those He dealt with in the past. The surah compares the destiny of the ungrateful with that of the souls at peace.The surah is also known as: The Daybreak.",
    "name_translation": "THE DAWN",
    "name_complex": "Al-Fajr",
    "surah_name_ar": "الفجر",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 89:1": "Betohem në agimin,",
                            "verse 89:2": "dhe dhjetë netët,",
                            "verse 89:3": "dhe në të gjitha që janë çift e tek,",
                            "verse 89:4": "dhe natën që shkon, -",
                            "verse 89:5": "vallë, a nuk është ky betim për të mençurin?",
                            "verse 89:6": "Vallë, a nuk di ti se çka ka bërë Zoti yt me Adin,",
                            "verse 89:7": "e me banorët e qytetit Iremes, pronarë të pallatee madhështore,",
                            "verse 89:8": "çfarë nuk ka pasur askund tjetër;",
                            "verse 89:9": "dhe si i dënoi themudasit, të cilët kanë gëdhendur shkëmbinj në luginë,",
                            "verse 89:10": "dhe Faraonin – pronarin e shtyllave,",
                            "verse 89:11": "që kanë bërë zullum pa të drejtë në tokë",
                            "verse 89:12": "dhe shtonin ngatërresat,",
                            "verse 89:13": "andaj Zoti yt, e lëshoi mbi ta kamxhikun e dënimit (lloj-lloj dënimesh),",
                            "verse 89:14": "sepse, me të vërtetë, Zoti yt i pret ata në pusi (i përcjellë punët e tyre).",
                            "verse 89:15": "Por, Perëndia kur ta provojë njeriun e ta dhurojë me begati, (ai) thotë: “Zoti im është sjellë në mënyrë bujar endaj meje!”",
                            "verse 89:16": "E, kur ta provojë atë, duke ia munguar furnizimin, atëherë ai thotë: “Zoti im më ka poshtëruar”.",
                            "verse 89:17": "Jo, jo! Por ju nuk po i respektoni bonjakët,",
                            "verse 89:18": "dhe nuk po e nxitni njëri-tjetrin për t’i ushqyer të varfërit,",
                            "verse 89:19": "kurse trashëgiminë, e hani me lakmi të pangopur,",
                            "verse 89:20": "dhe dëshironi pasuri të pakufishme.",
                            "verse 89:21": "Por kjo nuk është mirë! Atëherë, kur Toka do të copëtohet në thërmia,",
                            "verse 89:22": "dhe kur do të arrijë urdhëri i Zotit tënd, e engjëjt të rreshtohen radhë pas radhe,",
                            "verse 89:23": "dhe atë Ditë kur afrohet (prezentohet) skëterra; atëherë njeriu do të kujtohet – por ç’dobi?!",
                            "verse 89:24": "dhe thotë: “Ah! Sikur të kisha punuar gjëra të mira në jetën time!”",
                            "verse 89:25": "Atë Ditë, askush nuk mund të dënojë, si Ai (dënimi i Tij),",
                            "verse 89:26": "dhe, atë ditë, askush nuk lidhë në pranga si Ai!",
                            "verse 89:27": "E ti, o shpirt i besuar (këmbëngulës në besim)",
                            "verse 89:28": "kthehu te Zoti yt i kënaqur, sepse, edhe Ai është i kënaqur me ty,",
                            "verse 89:29": "prandaj, hynnë mes të dashurve të Mi,",
                            "verse 89:30": "dhe hyn në xhennetin Tim! Mi,"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "And olsun dan yerinə;",
                            "verse 89:2": "And olsun on gecəyə (zülhiccə ayının birinci, yaxud ramazan ayının sonuncu on gecəsinə);",
                            "verse 89:3": "And olsun cütə və təkə (tək olan xaliqə, erkək və dişi olmaqla cüt olan məxluqata; cüt olan hər şeyə, yaxud Qurban bayramına və yaxud Ərəfə gününə);",
                            "verse 89:4": "And olsun keçib getməkdə olan gecəyə (ki, qiyamət haqdır və siz kafirlər qiyamət günü dirilib əməllərinizin cəzasını layiqincə alacaqsınız)!",
                            "verse 89:5": "Məgər bunlarda (qiyamətin haq olması barədə) ağıl sahibi üçün and yoxmudur?!",
                            "verse 89:6": "(Ya Peyğəmbər!) məgər görmədinmi ki, Rəbbin nələr etdi Ada (Hud peyğəmbərin Ad qövmünə)?!",
                            "verse 89:7": "Sütunlar sahibi (və ya: sütun kimi uca boylu) İrəmə (İrəm camaatına)?!",
                            "verse 89:8": "(Elə bir qövm ki) məmləkətlər (əhli) arasında onun kimisi yaradılmamışdı.",
                            "verse 89:9": "(Məgər görmədinmi ki, Rəbbin nələr etdi) vadidə qayaları olan Səmuda (Səmud qövmünə)?!",
                            "verse 89:10": "Eləcə də saysız-hesabsız ordular sahibi Fir'ona?!",
                            "verse 89:11": "O kəslər ki, məmləkətlərdə tüğyan edir,",
                            "verse 89:12": "Oralarda çoxlu fitnə-fəsad törədirlər.",
                            "verse 89:13": "Nəhayət, Rəbbin onlara əzab qamçısı endirdi.",
                            "verse 89:14": "Şübhəsiz ki, Rəbbin (bəndələrinin bütün əməllərini) baxıb görür.",
                            "verse 89:15": "İnsana gəldikdə, nə zaman Rəbbin onu imtahana çəkib ehtiram etsə, ona bir ne'mət versə, o: \"Rəbbim mənə ehtiram göstərdi!\"-deyər.",
                            "verse 89:16": "Amma nə zaman (Rəbbin) onu imtahana çəkib ruzisini əskiltsə: \"Rəbbim məni alçaltdı (mənə xor baxdı)!\" - söyləyər.",
                            "verse 89:17": "Xeyr! (Belə deməyin).",
                            "verse 89:18": "Bir-birinizi yoxsulu yedirtməyə rəğbətləndirmirsiniz.",
                            "verse 89:19": "Mirası (halal-haramına) varmadan yeyirsiniz (qadınların, uşaqların paylarını vermirsiniz).",
                            "verse 89:20": "Mal-dövləti isə lap çox sevirsiniz.",
                            "verse 89:21": "Xeyr! Yer dağılıb parça-parça olacağı;",
                            "verse 89:22": "Rəbbinin əmri gəlib mələklər səf-səf duracağı",
                            "verse 89:23": "Və Cəhənnəmin (məhşər meydanına) gətiriləcəyi gün - məhz o gün insan (öz günahlarını) xatırlayacaqdır.",
                            "verse 89:24": "O: \"Kaş ki, mən əvvəlcədən (axirət) həyatım üçün (yaxşı əməllər) edəydim!\" - deyəcəkdir.",
                            "verse 89:25": "O gün (Allahın) etdiyi əzabı heç kəs edə bilməz!",
                            "verse 89:26": "(Günahkarları) heç kəs Onun kimi zəncirləyə bilməz!",
                            "verse 89:27": "(Qiyamət günü Allah-təala mö'min kimsəyə belə buyuracaqdır: ) \"Ey (öz imanından, əməlindən və Allahın və'dindən) xatircəm olan kəs! (Və ya: \"Ey arxayın nəfs!\")",
                            "verse 89:28": "Dön Rəbbinə, sən Ondan razı olaraq, O da səndən!",
                            "verse 89:29": "(Əməlisaleh) bəndələrimin zümrəsinə daxil ol!",
                            "verse 89:30": "(Onlarla birlikdə) Cənnətimə varid ol!\""
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Tako mi zore,",
                            "verse 89:2": "i deset noći,",
                            "verse 89:3": "i parnih i neparnih,",
                            "verse 89:4": "i noći kada nestaje -",
                            "verse 89:5": "zar to pametnom zakletva nije.",
                            "verse 89:6": "Zar ne znaš šta je Gospodar tvoj sa Adom uradio,",
                            "verse 89:7": "sa stanovnicima Irema, punog palata na stupovima,",
                            "verse 89:8": "kojima ravna ni u jednoj zemlji nije bilo;",
                            "verse 89:9": "i Semudom, koji je stijene u dolini klesao,",
                            "verse 89:10": "i faraonom, koji je šatore imao -",
                            "verse 89:11": "koji su na Zemlji zulum provodili",
                            "verse 89:12": "i poroke na njoj umnožili,",
                            "verse 89:13": "pa je Gospodar tvoj - bič patnje na njih spustio,",
                            "verse 89:14": "jer, Gospodar tvoj je, zaista, u zasjedi.",
                            "verse 89:15": "Čovjek, kada Gospodar njegov hoće da ga iskuša pa mu počast ukaže i blagodatima ga obaspe, rekne: \"Gospodar moj je prema meni plemenito postupio!\"",
                            "verse 89:16": "A kad mu, da bi ga iskušao, opskrbu njegovu oskudnom učini, onda rekne: \"Gospodar moj me je napustio!\"",
                            "verse 89:17": "A nije tako! Vi pažnju siročetu ne ukazujete,",
                            "verse 89:18": "i da se puki siromah nahrani - jedan drugog ne nagovarate,",
                            "verse 89:19": "a nasljedstvo pohlepno jedete",
                            "verse 89:20": "i bogatstvo pretjerano volite.",
                            "verse 89:21": "A ne valja to! Kada se Zemlja u komadiće zdrobi",
                            "verse 89:22": "i kad dođe naređenje Gospodara tvoga, a meleki budu sve red do reda,",
                            "verse 89:23": "i kad se tog Dana primakne Džehennem; tada će se čovjek sjetiti - a na što mu je sjećanje?! -",
                            "verse 89:24": "i reći: \"Kamo sreće da sam se za ovaj život pripremio!\"",
                            "verse 89:25": "Tog Dana niko neće kao On mučiti,",
                            "verse 89:26": "i niko neće kao On u okove okivati!",
                            "verse 89:27": "A ti, o dušo smirena,",
                            "verse 89:28": "vrati se Gospodaru svome zadovoljna, a i On tobom zadovoljan,",
                            "verse 89:29": "pa uđi među robove Moje,",
                            "verse 89:30": "i uđi u Džennet Moj! Moje,"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "শপথ ফজরের,",
                            "verse 89:2": "শপথ দশ রাত্রির, শপথ তার,",
                            "verse 89:3": "যা জোড় ও যা বিজোড়",
                            "verse 89:4": "এবং শপথ রাত্রির যখন তা গত হতে থাকে",
                            "verse 89:5": "এর মধ্যে আছে শপথ জ্ঞানী ব্যক্তির জন্যে।",
                            "verse 89:6": "আপনি কি লক্ষ্য করেননি, আপনার পালনকর্তা আদ বংশের ইরাম গোত্রের সাথে কি আচরণ করেছিলেন,",
                            "verse 89:7": "যাদের দৈহিক গঠন স্তম্ভ ও খুঁটির ন্যায় দীর্ঘ ছিল এবং",
                            "verse 89:8": "যাদের সমান শক্তি ও বলবীর্যে সারা বিশ্বের শহরসমূহে কোন লোক সৃজিত হয়নি",
                            "verse 89:9": "এবং সামুদ গোত্রের সাথে, যারা উপত্যকায় পাথর কেটে গৃহ নির্মাণ করেছিল।",
                            "verse 89:10": "এবং বহু কীলকের অধিপতি ফেরাউনের সাথে",
                            "verse 89:11": "যারা দেশে সীমালঙ্ঘন করেছিল।",
                            "verse 89:12": "অতঃপর সেখানে বিস্তর অশান্তি সৃষ্টি করেছিল।",
                            "verse 89:13": "অতঃপর আপনার পালনকর্তা তাদেরকে শাস্তির কশাঘাত করলেন।",
                            "verse 89:14": "নিশ্চয় আপনার পালকর্তা সতর্ক দৃষ্টি রাখেন।",
                            "verse 89:15": "মানুষ এরূপ যে, যখন তার পালনকর্তা তাকে পরীক্ষা করেন, অতঃপর সম্মান ও অনুগ্রহ দান করেন, তখন বলে, আমার পালনকর্তা আমাকে সম্মান দান করেছেন।",
                            "verse 89:16": "এবং যখন তাকে পরীক্ষা করেন, অতঃপর রিযিক সংকুচিত করে দেন, তখন বলেঃ আমার পালনকর্তা আমাকে হেয় করেছেন।",
                            "verse 89:17": "এটা অমূলক, বরং তোমরা এতীমকে সম্মান কর না।",
                            "verse 89:18": "এবং মিসকীনকে অন্নদানে পরস্পরকে উৎসাহিত কর না।",
                            "verse 89:19": "এবং তোমরা মৃতের ত্যাজ্য সম্পত্তি সম্পূর্ণরূপে কুক্ষিগত করে ফেল",
                            "verse 89:20": "এবং তোমরা ধন-সম্পদকে প্রাণভরে ভালবাস।",
                            "verse 89:21": "এটা অনুচিত। যখন পৃথিবী চুর্ণ-বিচুর্ণ হবে",
                            "verse 89:22": "এবং আপনার পালনকর্তা ও ফেরেশতাগণ সারিবদ্ধভাবে উপস্থিত হবেন,",
                            "verse 89:23": "এবং সেদিন জাহান্নামকে আনা হবে, সেদিন মানুষ স্মরণ করবে, কিন্তু এই স্মরণ তার কি কাজে আসবে?",
                            "verse 89:24": "সে বলবেঃ হায়, এ জীবনের জন্যে আমি যদি কিছু অগ্রে প্রেরণ করতাম!",
                            "verse 89:25": "সেদিন তার শাস্তির মত শাস্তি কেউ দিবে না।",
                            "verse 89:26": "এবং তার বন্ধনের মত বন্ধন কেউ দিবে না।",
                            "verse 89:27": "হে প্রশান্ত মন,",
                            "verse 89:28": "তুমি তোমার পালনকর্তার নিকট ফিরে যাও সন্তুষ্ট ও সন্তোষভাজন হয়ে।",
                            "verse 89:29": "অতঃপর আমার বান্দাদের অন্তর্ভুক্ত হয়ে যাও।",
                            "verse 89:30": "এবং আমার জান্নাতে প্রবেশ কর। যাও।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 89:1": "Кълна се в зората",
                            "verse 89:2": "и в десетте нощи [от месеца за поклонение хадж],",
                            "verse 89:3": "и в четното, и в нечетното,",
                            "verse 89:4": "и в нощта, когато отминава!",
                            "verse 89:5": "Нима в това няма клетва за разумния?",
                            "verse 89:6": "Не видя ли ти как постъпи твоят Господ с адитите",
                            "verse 89:7": "и с ирамитите, имащи високи постройки,",
                            "verse 89:8": "подобни на които не бяха сътворени по земите,",
                            "verse 89:9": "и със самудяните, които изсичаха скалите в долината,",
                            "verse 89:10": "и с Фараона, владетеля на войските,",
                            "verse 89:11": "които безчинстваха из селищата",
                            "verse 89:12": "и множаха в тях развалата?",
                            "verse 89:13": "Тогава твоят Господ стовари върху тях бича на мъчението.",
                            "verse 89:14": "Твоят Господ надзирава.",
                            "verse 89:15": "И ако неговият Господ го подложи на изпитание, като го почете и облагодетелства, човекът казва: Моят Господ ме почете.",
                            "verse 89:16": "А ако го подложи на изпитание, като ограничи препитанието му, казва: Моят Господ ме оскърби.",
                            "verse 89:17": "Ала не! Вие не почитате сирака",
                            "verse 89:18": "и не подканвате да бъде нахранен нуждаещият се,",
                            "verse 89:19": "и изяждате наследството [дори ако е чуждо] с лакомия.",
                            "verse 89:20": "И обичате богатството с голяма любов.",
                            "verse 89:21": "Ала не! Когато земята бъде стрита на прах",
                            "verse 89:22": "и твоят Господ дойде с подредените в редици ангели,",
                            "verse 89:23": "и Адът бъде докаран в този Ден, човекът ще си спомни тогава, ала защо ще му е спомнянето?",
                            "verse 89:24": "Ще казва: О, да бях сторил отнапред добрини заради моя",
                            "verse 89:25": "живот!",
                            "verse 89:26": "В този Ден никой друг не ще измъчва, както Той измъчва,",
                            "verse 89:27": "и никой друг не ще оковава, както Той оковава.",
                            "verse 89:28": "О, душа успокоена,",
                            "verse 89:29": "завърни се при твоя Господ доволстваща, заслужила благосклонност!",
                            "verse 89:30": "Влез сред Моите раби,",
                            "verse 89:31": "влез в Моя Рай! раби,"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "誓以黎明，",
                            "verse 89:2": "與十夜，",
                            "verse 89:3": "與偶數和奇數，",
                            "verse 89:4": "與離去的黑夜，",
                            "verse 89:5": "對於有理智者，此中有一種盟誓嗎？",
                            "verse 89:6": "難道你不知道你的主怎樣懲治阿德人——",
                            "verse 89:7": "有高柱的伊賴姆人嗎？",
                            "verse 89:8": "像那樣的人，在別的城市裡還沒有被創造過的——",
                            "verse 89:9": "怎樣懲治在山谷裡鑿石為家的賽莫德人，",
                            "verse 89:10": "怎樣懲治有武力的法老。",
                            "verse 89:11": "這等人曾在國中放肆，",
                            "verse 89:12": "乃多行不義，",
                            "verse 89:13": "故你的主把一種刑罰，傾注在他們身上。",
                            "verse 89:14": "你的主，確是監視的。",
                            "verse 89:15": "至於人，當他的主考驗他，故優待他，而且使他過安逸生活的時候，他說：「我的主優待我了。」",
                            "verse 89:16": "當他考驗他，故節約他的給養的時候，他說：「我的主凌辱我了。」",
                            "verse 89:17": "絕不然！但你們不優待孤兒，",
                            "verse 89:18": "你們不以濟貧相勉勵，",
                            "verse 89:19": "你們侵吞遺產，",
                            "verse 89:20": "你們酷愛錢財。",
                            "verse 89:21": "絕不然！當大地震動復震動，",
                            "verse 89:22": "你的主的命令，和排班的天神，同齊來臨的時候，",
                            "verse 89:23": "在那日，火獄將被拿來；在那日，人將覺悟，但覺悟於他有何裨益呢？",
                            "verse 89:24": "他將說：「但願我在世的時候曾行善事。」",
                            "verse 89:25": "在那日，任何人，不用他的那種刑罰懲治別人；",
                            "verse 89:26": "任何人，不用他的那種束縛束縛別人。",
                            "verse 89:27": "安定的靈魂啊！",
                            "verse 89:28": "你應當喜悅地，被喜悅地歸於你的主。",
                            "verse 89:29": "你應當入在我的眾僕裡；",
                            "verse 89:30": "你應當入在我的樂園裡。 你應當入在我的眾僕裡；"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Při úsvitu",
                            "verse 89:2": "a při nocích deseti",
                            "verse 89:3": "a při spárovaném a jedinečném",
                            "verse 89:4": "a při noci, když ubíhá!",
                            "verse 89:5": "Což není v tom pro člověka rozvážného přísaha?",
                            "verse 89:6": "Neviděls, co učinil Pán tvůj ´Ádovcům",
                            "verse 89:7": "Iramu, jenž proslul sloupy svými,",
                            "verse 89:8": "jimž nic podobného nebylo stvořeno v žádné zemi,",
                            "verse 89:9": "a kmeni Thamúd, jenž skály v údolí prorážel,",
                            "verse 89:10": "a Faraónovi, který na kůly narážel,",
                            "verse 89:11": "a těm, kdož v zemích vzpurní byli",
                            "verse 89:12": "a pohoršení v nich pak šířili?",
                            "verse 89:13": "Však Pán tvůj proti nim důtky trestající rozpoutal,",
                            "verse 89:14": "neb Pán tvůj neustále na číhané stál.",
                            "verse 89:15": "Co člověka se týče, když Pán jeho jej zkoušce podrobuje a štědrosti a dobrodiním jeho zahrnuje, pak on hovoří: \"Pán můj mi poctu prokazuje.",
                            "verse 89:16": "Když naopak jej zkouší tím, že příděl obživy mu odměřuje, pak on hovoří: \"Pán můj mě ponižuje.",
                            "verse 89:17": "Však pozor! Vždyť vy sirotky nectíte,",
                            "verse 89:18": "ani k nakrmení nuzných se navzájem nevybízíte",
                            "verse 89:19": "však dědictví slabých nenasytně pohlcujete",
                            "verse 89:20": "a jen bohatství v lásce vášnivé máte.",
                            "verse 89:21": "Však pozor! Až země bude rozdrcena ranou za ranou",
                            "verse 89:22": "a přijde Pán tvůj i andělé, řada za řadou,",
                            "verse 89:23": "a až v ten den bude peklo předvedeno, tehdy si člověk připomene - však co bude mu připomínání platno?",
                            "verse 89:24": "I zvolá: \"Kéž bych měl na život budoucí něco předem připraveno!\"",
                            "verse 89:25": "V ten den takovým trestem nebude nikdo potrestán",
                            "verse 89:26": "a nikdo takovými okovy spoután!",
                            "verse 89:27": "A ty, duše usmířená,",
                            "verse 89:28": "vrať se k Pánu svému v zalíbení a spokojená!",
                            "verse 89:29": "Vstup mezi služebníky mé",
                            "verse 89:30": "a vejdi do zahrady mé! mé"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Bij de dageraad,",
                            "verse 89:2": "En de tien nachten,",
                            "verse 89:3": "En het even en het oneven",
                            "verse 89:4": "En de nacht als deze vervaagt;",
                            "verse 89:5": "Daarin is zeker genoeg bewijs voor een man van begrip.",
                            "verse 89:6": "Weet gij niet hoe uw Heer met de Aad handelde?",
                            "verse 89:7": "Het volk van Iram dat verheven gebouwen bezat,",
                            "verse 89:8": "Wier gelijken nog in geen enkele stad zijn voortgebracht,",
                            "verse 89:9": "En met de Samoed die de rotsen in het dal uithieuwen?",
                            "verse 89:10": "En met de farao, de heer der grote scharen?",
                            "verse 89:11": "Die zich in de steden aan overtreding overgaven.",
                            "verse 89:12": "En veel verderf daarin aanrichtten.",
                            "verse 89:13": "Daarom, deed uw Heer een roede der kastijding over hen nederdalen.",
                            "verse 89:14": "Voorwaar, uw Heer is waakzaam.",
                            "verse 89:15": "Wat de mens betreft, wanneer zijn Heer hem beproeft door hem te roemen en door hem gunsten te bewijzen, dan zegt hij: \"Mijn Heer heeft mij geëerd.",
                            "verse 89:16": "Maar wanneer Hij hem beproeft door hem in zijn levensonderhoud te beperken, zegt hij: \"Mijn Heer heeft mij onteerd.",
                            "verse 89:17": "Neen, maar gij ontziet de wees niet.",
                            "verse 89:18": "Noch spoort elkander aan, de armen te voeden,",
                            "verse 89:19": "En gij verslindt het erfdeel in zijn geheel",
                            "verse 89:20": "En gij houdt te veel van weelde.",
                            "verse 89:21": "Neen, wanneer de aarde aan stukken wordt geschud,",
                            "verse 89:22": "En uw Heer komt en de engelen in rijen gerangschikt zijn,",
                            "verse 89:23": "Op die Dag zal de hel (hem) worden getoond; op die Dag zal de mens de vermaning willen volgen, maar hoe zal de vermaning hem kunnen baten?",
                            "verse 89:24": "Hij zal zeggen: \"O had ik (vroeger), voor dit leven iets verricht.",
                            "verse 89:25": "Niemand straft zoals Hij op die Dag zal straffen.",
                            "verse 89:26": "Noch boeit iemand zoals Hij zal boeien.",
                            "verse 89:27": "Maar gij, o ziel in vrede!",
                            "verse 89:28": "Keer tot uw Heer terug, verblijd in God’s welbehagen.",
                            "verse 89:29": "Ga daarom in onder Mijn dienaren,",
                            "verse 89:30": "En ga Mijn paradijs binnen."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 89:1": "By the Dawn",
                            "verse 89:2": "And ten nights,",
                            "verse 89:3": "And the Even and the Odd,",
                            "verse 89:4": "And the night when it departeth,",
                            "verse 89:5": "There surely is an oath for thinking man.",
                            "verse 89:6": "Dost thou not consider how thy Lord dealt with (the tribe of) A’ad,",
                            "verse 89:7": "With many-columned Iram,",
                            "verse 89:8": "The like of which was not created in the lands;",
                            "verse 89:9": "And with (the tribe of) Thamud, who clove the rocks in the valley;",
                            "verse 89:10": "And with Pharaoh, firm of might,",
                            "verse 89:11": "Who (all) were rebellious (to Allah) in these lands,",
                            "verse 89:12": "And multiplied iniquity therein ?",
                            "verse 89:13": "Therefore thy Lord poured on them the disaster of His punishment.",
                            "verse 89:14": "Lo! thy Lord is ever watchful.",
                            "verse 89:15": "As for man, whenever his Lord trieth him by honouring him, and is gracious unto him, he saith: My Lord honoureth me.",
                            "verse 89:16": "But whenever He trieth him by straitening his means of life, he saith: My Lord despiseth me.",
                            "verse 89:17": "Nay, but ye (for your part) honour not the orphan",
                            "verse 89:18": "And urge not on the feeding of the poor.",
                            "verse 89:19": "And ye devour heritages with devouring greed.",
                            "verse 89:20": "And love wealth with abounding love.",
                            "verse 89:21": "Nay, but when the earth is ground to atoms, grinding, grinding,",
                            "verse 89:22": "And thy Lord shall come with angels, rank on rank,",
                            "verse 89:23": "And hell is brought near that day; on that day man will remember, but how will the remembrance (then avail him) ?",
                            "verse 89:24": "He will say: Ah, would that I had sent before me (some provision) for my life!",
                            "verse 89:25": "None punisheth as He will punish on that day!",
                            "verse 89:26": "None bindeth as He then will bind.",
                            "verse 89:27": "But ah! thou soul at peace!",
                            "verse 89:28": "Return unto thy Lord, content in His good pleasure!",
                            "verse 89:29": "Enter thou among My bondmen!",
                            "verse 89:30": "Enter thou My Garden! bondmen!"
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 89:1": "By the break of Day",
                            "verse 89:2": "By the Nights twice five;",
                            "verse 89:3": "By the even and odd (contrasted);",
                            "verse 89:4": "And by the Night when it passeth away;-",
                            "verse 89:5": "Is there (not) in these an adjuration (or evidence) for those who understand?",
                            "verse 89:6": "Seest thou not how thy Lord dealt with the ’Ad (people),-",
                            "verse 89:7": "Of the (city of) Iram, with lofty pillars,",
                            "verse 89:8": "The like of which were not produced in (all) the land?",
                            "verse 89:9": "And with the Thamud (people), who cut out (huge) rocks in the valley?-",
                            "verse 89:10": "And with Pharaoh, lord of stakes?",
                            "verse 89:11": "(All) these transgressed beyond bounds in the lands,",
                            "verse 89:12": "And heaped therein mischief (on mischief).",
                            "verse 89:13": "Therefore did thy Lord pour on them a scourge of diverse chastisements:",
                            "verse 89:14": "For thy Lord is (as a Guardian) on a watch-tower.",
                            "verse 89:15": "Now, as for man, when his Lord trieth him, giving him honour and gifts, then saith he, (puffed up), \"My Lord hath honoured me.",
                            "verse 89:16": "But when He trieth him, restricting his subsistence for him, then saith he (in despair), \"My Lord hath humiliated me!\"",
                            "verse 89:17": "Nay, nay! but ye honour not the orphans!",
                            "verse 89:18": "Nor do ye encourage one another to feed the poor!-",
                            "verse 89:19": "And ye devour inheritance - all with greed,",
                            "verse 89:20": "And ye love wealth with inordinate love!",
                            "verse 89:21": "Nay! When the earth is pounded to powder,",
                            "verse 89:22": "And thy Lord cometh, and His angels, rank upon rank,",
                            "verse 89:23": "And Hell, that Day, is brought (face to face),- on that Day will man remember, but how will that remembrance profit him?",
                            "verse 89:24": "He will say: \"Ah! Would that I had sent forth (good deeds) for (this) my (Future) Life!\"",
                            "verse 89:25": "For, that Day, His Chastisement will be such as none (else) can inflict,",
                            "verse 89:26": "And His bonds will be such as none (other) can bind.",
                            "verse 89:27": "(To the righteous soul will be said:) \"O (thou) soul, in (complete) rest and satisfaction!",
                            "verse 89:28": "\"Come back thou to thy Lord,- well pleased (thyself), and well-pleasing unto Him!",
                            "verse 89:29": "\"Enter thou, then, among My devotees!",
                            "verse 89:30": "\"Yea, enter thou My Heaven!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 89:1": "By the dawn",
                            "verse 89:2": "and ten nights,",
                            "verse 89:3": "by the even and the odd,",
                            "verse 89:4": "by the night when it journeys on!",
                            "verse 89:5": "Is there in that an oath for a mindful man?",
                            "verse 89:6": "Hast thou not seen how thy Lord did with Ad,",
                            "verse 89:7": "Iram of the pillars,",
                            "verse 89:8": "the like of which was never created in the land,",
                            "verse 89:9": "and Thamood, who hollowed the rocks in the valley,",
                            "verse 89:10": "and Pharaoh, he of the tent-pegs,",
                            "verse 89:11": "who all were insolent in the land",
                            "verse 89:12": "and worked much corruption therein?",
                            "verse 89:13": "Thy Lord unloosed on them a scourge of chastisement;",
                            "verse 89:14": "surely thy Lord is ever on the watch.",
                            "verse 89:15": "As for man, whenever his Lord tries him, and honours him, and blesses him, then he says, ’My Lord has honoured me.",
                            "verse 89:16": "But when he tries him and stints for him his provision, then he says, ’My Lord has despised me.",
                            "verse 89:17": "No indeed; but you honour not the orphan,",
                            "verse 89:18": "and you urge not the feeding of the needy,",
                            "verse 89:19": "and you devour the inheritance greedily,",
                            "verse 89:20": "and you love wealth with an ardent love",
                            "verse 89:21": "No indeed! When the earth is ground to powder,",
                            "verse 89:22": "and thy Lord comes, and the angels rank on rank,",
                            "verse 89:23": "and Gehenna is brought out, upon that day man will remember; and how shall the Reminder be for him?",
                            "verse 89:24": "He shall say, ’O would that I had forwarded for my life!’",
                            "verse 89:25": "Upon that day none shall chastise as He chastises,",
                            "verse 89:26": "none shall bind as He binds.",
                            "verse 89:27": "’O soul at peace,",
                            "verse 89:28": "return unto thy Lord, well-pleased, well-pleasing!",
                            "verse 89:29": "Enter thou among My servants!",
                            "verse 89:30": "Enter thou My Paradise!’ servants!"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 89:1": "CONSIDER the daybreak",
                            "verse 89:2": "and the ten nights!",
                            "verse 89:3": "Consider the multiple and the One!",
                            "verse 89:4": "Consider the night as it runs its course!",
                            "verse 89:5": "Considering all this – could there be, to anyone endowed with reason, a",
                            "verse 89:6": "solemn evidence of the truth?",
                            "verse 89:7": "ART THOU NOT aware of how thy Sustainer has dealt with [the tribe of] ’ād,",
                            "verse 89:8": "[the people of] Iram the many-pillared,",
                            "verse 89:9": "the like of whom has never been reared in all the land? –",
                            "verse 89:10": "and with [the tribe of] Thamūd, who hollowed out rocks in the valley? –",
                            "verse 89:11": "and with Pharaoh of the",
                            "verse 89:12": "tent-poles?",
                            "verse 89:13": "[It was they] who transgressed all bounds of equity all over their lands,",
                            "verse 89:14": "and brought about great corruption therein:",
                            "verse 89:15": "and therefore thy Sustainer let loose upon them a scourge of suffering:",
                            "verse 89:16": "for, verily, thy Sustainer is ever on the watch!",
                            "verse 89:17": "BUT AS FOR man, whenever his Sustainer tries him by His generosity and by letting him enjoy a life of ease, he says, \"My Sustainer has been",
                            "verse 89:18": "generous towards me\";",
                            "verse 89:19": "whereas, whenever He tries him by straitening his means of livelihood, he says, \"My Sustainer has disgraced me!\"",
                            "verse 89:20": "But nay, nay, [O men, consider all that you do and fail to do:] you are not generous towards the orphan,",
                            "verse 89:21": "and you do not urge one another to feed the needy,",
                            "verse 89:22": "and you devour the inheritance [of others] with devouring greed,",
                            "verse 89:23": "and you love wealth with boundless love!",
                            "verse 89:24": "Nay, but [how will you fare on Judgment Day,] when the earth is crushed with crushing upon crushing,",
                            "verse 89:25": "and [the majesty of] thy Sustainer stands revealed, as well as [the true nature of] the angels, rank upon rank?",
                            "verse 89:26": "And on that Day hell will be brought [within sight]; on that Day man will remember [all that he did and failed to do]: but what will that remembrance avail him?",
                            "verse 89:27": "He will say, \"Oh, would that I had provided beforehand for my life [to come]!\"",
                            "verse 89:28": "For none can make suffer as He will make suffer [the sinners] on that Day,",
                            "verse 89:29": "and none can bind with bonds like His.",
                            "verse 89:30": "[But unto the righteous God will say,] \"O thou human being that hast attained to inner peace!",
                            "verse 89:31": "Return thou unto thy Sustainer, well-pleased",
                            "verse 89:32": "pleasing :",
                            "verse 89:33": "enter, then, together with My [other true] servants –",
                            "verse 89:34": "yea, enter thou My paradise!\"",
                            "verse 89:35": "solemn affirmation” (qasam): i.",
                            "verse 89:36": "thy Sustainer comes,” which almost all of the classical commentators understand as the revelation (in the abstract sense of this word) of God’s transcendental majesty and the manifestation of His judgment."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 89:1": "O thou soul which art at peace.",
                            "verse 89:2": "",
                            "verse 89:3": "",
                            "verse 89:4": "",
                            "verse 89:5": "",
                            "verse 89:6": "",
                            "verse 89:7": "Return unto thy Lord, glad in His Gladness! Return",
                            "verse 89:8": "unto they Lord with (in) gladness that is thine in Him and His in thee.",
                            "verse 89:9": "",
                            "verse 89:10": "",
                            "verse 89:11": "Return",
                            "verse 89:12": "unto thy Lord, pleased thou and whelmed in His good pleasure.",
                            "verse 89:13": "Return unto thy Lord gladly and accepted in mutual gladness.",
                            "verse 89:14": "Enter thou among My slaves!",
                            "verse 89:15": "",
                            "verse 89:16": "",
                            "verse 89:17": "",
                            "verse 89:18": "",
                            "verse 89:19": "",
                            "verse 89:20": "Enter thou My Paradise!",
                            "verse 89:21": "",
                            "verse 89:22": "",
                            "verse 89:23": "",
                            "verse 89:24": "",
                            "verse 89:25": "Sources",
                            "verse 89:26": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 89:27": "The Book of Certainty (1952) •",
                            "verse 89:28": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 89:29": "What is Sufism (1975) •",
                            "verse 89:30": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 89:31": "Muhammad (1983) •",
                            "verse 89:32": "Symbol and Archetype (1991) •",
                            "verse 89:33": "Sufi Poems (2004) •",
                            "verse 89:34": "Mecca (2004) •",
                            "verse 89:35": "Return to the Spirit (2005) •",
                            "verse 89:36": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 89:37": "“Proofs of Islam”(1954).",
                            "verse 89:38": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 89:39": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 89:40": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 89:41": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 89:42": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 89:43": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 89:44": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 89:45": "“The Quranic Origins of Sufism” •",
                            "verse 89:46": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 89:47": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 89:48": "“An Introduction to Islam” •",
                            "verse 89:49": "“The Universality of the Quran” •",
                            "verse 89:50": "Private Talks Books",
                            "verse 89:51": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 89:1": "I swear by the dawn,",
                            "verse 89:2": "and by Ten Nights,",
                            "verse 89:3": "and by the even and the odd,",
                            "verse 89:4": "and by the night when it moves away,",
                            "verse 89:5": "-Is there (not) in such an oath (enough assurance) for a man of sense?-",
                            "verse 89:6": "Have you not seen how your Lord dealt with (the people) of ‘Ād",
                            "verse 89:7": "of Iram , the men of tall pillars,",
                            "verse 89:8": "the like of whom were never created in the lands,",
                            "verse 89:9": "and (how He dealt) with (the people of) Thamūd who had carved out the rocks in the Valley (of Qurā),",
                            "verse 89:10": "and with Fir‘aun (Pharaoh), the man of the stakes,",
                            "verse 89:11": "- those who had rebelled in the cities,",
                            "verse 89:12": "and spread a lot of mischief therein.",
                            "verse 89:13": "So, your Lord let loose on them the whip of torment.",
                            "verse 89:14": "Surely your Lord is ever on the watch.",
                            "verse 89:15": "As for man, when his Lord tests him, and thus gives him honour and bounties, he says, “My Lord has honoured me.",
                            "verse 89:16": "But when he tests him, and thus straitens his provision for him, he says, “My Lord has disgraced me.",
                            "verse 89:17": "No! But you do not honour the orphan,",
                            "verse 89:18": "and do not encourage one another to feed the needy.",
                            "verse 89:19": "And you devour the inheritance with a sweeping gulp,",
                            "verse 89:20": "and love wealth, an excessive love.",
                            "verse 89:21": "No! When the earth will be crushed thoroughly to be turned into bits,",
                            "verse 89:22": "and your Lord will come, and the angels as well, lined up in rows,",
                            "verse 89:23": "and Jahannam (Hell), on that day, will be brought forward, it will be the day when man will realize the truth, but from where will he take advantage of such realization?",
                            "verse 89:24": "He will say, “O Would that I had sent ahead (some good deeds) for (this) my life!”",
                            "verse 89:25": "So no one can punish like He will punish, that day,",
                            "verse 89:26": "nor can anyone shackle like He will shackle.",
                            "verse 89:27": "(As for an obedient man, it will be said to him,) “O content soul,",
                            "verse 89:28": "come back to your Lord, well-pleased, well-pleasing.",
                            "verse 89:29": "So, enter among My (special) servants,",
                            "verse 89:30": "and enter My Paradise."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 89:1": "By the dawn,",
                            "verse 89:2": "and",
                            "verse 89:3": "the ten nights,",
                            "verse 89:4": "and",
                            "verse 89:5": "the even and the odd,",
                            "verse 89:6": "and",
                            "verse 89:7": "the night in motion:",
                            "verse 89:8": "Is there in that an oath for one of sense?",
                            "verse 89:9": "Have you not seen how your Lord dealt with ‘ād,",
                            "verse 89:10": "Iram of the towering ones —",
                            "verse 89:11": "the like of which was not created in the land,",
                            "verse 89:12": "and Thamūd, who hollowed the rocks in the valley,",
                            "verse 89:13": "and Pharaoh, the one of the tent-pegs —",
                            "verse 89:14": "those who were rebellious in the land,",
                            "verse 89:15": "and caused much corruption therein?",
                            "verse 89:16": "So your Lord poured on them a scourge of chastisement.",
                            "verse 89:17": "Assuredly your Lord is ever on the watch.",
                            "verse 89:18": "And as for man, whenever his Lord tests him and honours him, and is gracious to him, he says, ‘My Lord has honoured me’.",
                            "verse 89:19": "But when he tests him and restricts his provision for him, he says, ‘My Lord has humiliated me’.",
                            "verse 89:20": "No indeed! Rather they do not honour the orphan,",
                            "verse 89:21": "and they do not urge the feeding of the needy;",
                            "verse 89:22": "and they devour inheritance greedily;",
                            "verse 89:23": "and they love wealth with abounding love.",
                            "verse 89:24": "No indeed! When the earth is pulverised repeatedly,",
                            "verse 89:25": "and your Lord, and the angels arrive rank on rank,",
                            "verse 89:26": "and Hell on that day is brought ;",
                            "verse 89:27": "on that day man will remember, but how will remembering avail him ?",
                            "verse 89:28": "He will say, ‘O would that I had sent ahead for my life!’",
                            "verse 89:29": "Then on that day none shall mete out His chastisement;",
                            "verse 89:30": "And none shall bind His bind.",
                            "verse 89:31": "‘O soul at peace!",
                            "verse 89:32": "Return to your Lord, pleased, pleasing.",
                            "verse 89:33": "Then enter among My servants!",
                            "verse 89:34": "And enter My Paradise!’ servants!"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 89:1": "By the emerging dawn (that dispels the darkness of night),",
                            "verse 89:2": "And by the ten (blessed) nights,",
                            "verse 89:3": "And by the even and the odd,",
                            "verse 89:4": "And by the night as it departs.",
                            "verse 89:5": "Surely, in that is a mighty oath for the wise.",
                            "verse 89:6": "Have you not seen how your Lord treated (the people of ‘Ad)?",
                            "verse 89:7": "(They) were (the people) of Iram (and) were (tall like) lofty columns (possessing towering castles),",
                            "verse 89:8": "The like of which has not (at all) been created in the countries (of the world).",
                            "verse 89:9": "And (what treatment was given to) Thamud, who carved rocks (and constructed hundreds of cities) in the (Qura) valley?",
                            "verse 89:10": "And (how was) Pharaoh (dealt with), who wielded large armies (and used to punish victims with stakes)?",
                            "verse 89:11": "(They were) the people who perpetrated tyranny in their (respective) countries,",
                            "verse 89:12": "And spread great mischief and corruption there.",
                            "verse 89:13": "Then your Lord unleashed the scourge of punishment on them.",
                            "verse 89:14": "Indeed, your Lord is Ever-Watchful (over the tyrant transgressors).",
                            "verse 89:15": "But as for man, when his Lord tests him (by providing him pleasure and comfort) and honours him and gives him bounties, he says: ‘My Lord has honoured me.",
                            "verse 89:16": "But when He tries him (by afflicting him with pain and discomfort) and limits his means of sustenance, he says: ‘My Lord has humiliated me.",
                            "verse 89:17": "No indeed! But (the truth is that after you gain honour and good fortune), you do not give honour and care to orphans.",
                            "verse 89:18": "Nor do you inspire one another (in society) to promote the feeding of the destitute (i.",
                            "verse 89:19": "And you lay hand on the inherited wealth and devour it (yourselves and do not pay the poverty-stricken their due).",
                            "verse 89:20": "And you love wealth and riches inordinately.",
                            "verse 89:21": "Assuredly, when the earth will be cleft asunder and crushed to dust particles,",
                            "verse 89:22": "And your Lord will unveil His Light and the angels will appear (before His presence) rank upon rank,",
                            "verse 89:23": "And that Day, Hell will be brought forth.",
                            "verse 89:24": "He will say: ‘Would that I had sent (something) ahead of me for my (real) life (which would have helped me Today)!’",
                            "verse 89:25": "But that Day no one will be able to torment like His torment,",
                            "verse 89:26": "And no one will be able to bind as He binds.",
                            "verse 89:27": "O contented (pleased) self!",
                            "verse 89:28": "Return to your Lord in such a state that you are both the aspirant to, and the aspired of, His pleasure (i.",
                            "verse 89:29": "So join My (perfect) servants.",
                            "verse 89:30": "And enter My Paradise (of nearness and sight)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Kautta päivänkoiton",
                            "verse 89:2": "ja kymmenen yön,",
                            "verse 89:3": "kautta (juhlapäivien) luvun ja epäluvun,",
                            "verse 89:4": "kautta yön, jolloin lähdetään (kotimatkalle).",
                            "verse 89:5": "Eikö tässä kaikessa ole minkä nimeen vannoa, jos kuka sen tajuaa?",
                            "verse 89:6": "Etkö ole miettinyt sitä, mitä Herrasi teki Aadille",
                            "verse 89:7": "ja Aramin heimolle, jonka rakennuksia tukivat ylväät pilarit,",
                            "verse 89:8": "sellaiset, joiden vertaisia ei rakennettu muissa kaupungeissa,",
                            "verse 89:9": "(ja mitä tehtiin) Tamuudin kansalle, joka laaksossaan hakkasi asumuksensa suunnattomiin kallioihin",
                            "verse 89:10": "ja faraolle, sotajoukkojen valtiaalle,",
                            "verse 89:11": "noille kaikille,jotka harjoittivat irstaisuutta kaupungeissaan",
                            "verse 89:12": "ja saivat aikaan paljon pahaa.",
                            "verse 89:13": "Sentähden Herrasi lähetti heille kurituksen;",
                            "verse 89:14": "totisesti Herrasi seuraa valppaasti teidänkin menoanne.",
                            "verse 89:15": "Kun ihmisen Herra koettelee häntä antamalla hänelle kunniaa ja osoittamalla hänelle hyvyyttä, niin hän sanoo: »Herra pitää minut kunniassa.",
                            "verse 89:16": "Mutta kun Hän koettelee häntä toisin, niukentaen hänen elatustaan, silloin hän sanoo: »Herra halveksii minua.",
                            "verse 89:17": "Ei, te ette pidä orpoa missään arvossa",
                            "verse 89:18": "ettekä kehoita toisianne ruokkimaan köyhiä,",
                            "verse 89:19": "vaan te syötte olemattomiin kaikki heidän perintönsä ettekä mistään pidä väliä ahmiessanne,",
                            "verse 89:20": "ja te rakastatte ylellisyyttä koko sydämestänne.",
                            "verse 89:21": "Ei, kun tärähdykset panevat maan luhistumaan,",
                            "verse 89:22": "kun Herra ilmestyy enkeliparvien seuraamana",
                            "verse 89:23": "ja paljastaa helvetin, sinä päivänä ihminen noudattaisi kehoitusta, mutta miksi hyödyksi on hänelle totteleminen enää?",
                            "verse 89:24": "Hän sanoo: »Voi, jospa olisin huolehtinut tulevasta elämästäni!»",
                            "verse 89:25": "Mutta tuona päivänä ei kukaan rankaise niinkuin Hän,",
                            "verse 89:26": "ei kukaan sido niinkuin Hän.",
                            "verse 89:27": "Sinä levon löytänyt sielu,",
                            "verse 89:28": "palaa Herrasi luo saadaksesi Hänestä lohtusi ja ollaksesi Hänelle otollinen,",
                            "verse 89:29": "astu siis Minun palvelijoitteni joukkoon,",
                            "verse 89:30": "Niin, astu autuuden tarhaan!"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 89:1": "Par l'aube !",
                            "verse 89:2": "Par les dix nuits !",
                            "verse 89:3": "Par le pair et l'impair !",
                            "verse 89:4": "Par la nuit quand elle s'écoule !",
                            "verse 89:5": "N'est-ce pas là un serment pour qui est doué d'intelligence ?",
                            "verse 89:6": "N'as-tu pas vu comment ton Seigneur a agi envers les 'Ad",
                            "verse 89:7": "et Iram, [la cité] aux colonnades dont",
                            "verse 89:8": "nul autre exemple ne fut jamais créé dans le pays,",
                            "verse 89:9": "et envers les Thamoud qui taillèrent le roc dans la vallée",
                            "verse 89:10": "et envers Pharaon et ses piliers,",
                            "verse 89:11": "envers tous ceux qui se sont montrés rebelles dans le pays",
                            "verse 89:12": "et y ont intensifié la corruption ?",
                            "verse 89:13": "Ton Seigneur abattit sur eux le fouet du châtiment.",
                            "verse 89:14": "Certes, ton Seigneur se tient aux aguets.",
                            "verse 89:15": "Quant à l'homme, lorsque son Seigneur, pour l'éprouver, l'honore et le comble de bienfaits, il dit : \" Mon Seigneur m'a honoré ! \"",
                            "verse 89:16": "Mais quand, pour l'éprouver, Dieu lui mesure Ses dons, il dit : \" Mon Seigneur m'a humilié ! \"",
                            "verse 89:17": "Mais non ! Vous n'honorez pas l'orphelin ;",
                            "verse 89:18": "vous ne vous incitez pas mutuellement à nourrir le pauvre ;",
                            "verse 89:19": "vous dévorez avec avidité l'héritage ;",
                            "verse 89:20": "vous aimez les richesses d'un amour sans bornes.",
                            "verse 89:21": "Mais non ! Quand la terre sera réduite en poudre,",
                            "verse 89:22": "et que ton Seigneur viendra, ainsi que les anges rangée par rangée :",
                            "verse 89:23": "ce Jour-là, on amènera la Géhenne ; ce Jour-là, l'homme se souviendra.",
                            "verse 89:24": "Il dira : \" Malheur à moi ! Puissé-je avoir fait une avance pour ma vie",
                            "verse 89:25": "! \"",
                            "verse 89:26": "Ce Jour-là, nul autre que Dieu ne châtiera comme Lui,",
                            "verse 89:27": "et nul autre que Dieu ne chargera de chaînes comme Lui.",
                            "verse 89:28": "O âme apaisée !",
                            "verse 89:29": "Retourne vers ton Seigneur, agréante et agréée ;",
                            "verse 89:30": "entre donc parmi Mes serviteurs,",
                            "verse 89:31": "et entre dans Mon Paradis !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 89:1": "Par l’Aube !",
                            "verse 89:2": "et par les dix nuits !",
                            "verse 89:3": "Par le pair et l’impair !",
                            "verse 89:4": "Et par la nuit quand elle s’écoule !",
                            "verse 89:5": "N’est-ce pas là un serment, pour un doué d’intelligence ?",
                            "verse 89:6": "N’as-tu pas vu comment ton Seigneur a agi avec les Aad",
                            "verse 89:7": "",
                            "verse 89:8": "Iram , [la cité] à la colonne remarquable,",
                            "verse 89:9": "dont jamais pareille ne fut construite parmi les villes ?",
                            "verse 89:10": "et avec les Tamud qui taillaient le rocher dans la vallée ?",
                            "verse 89:11": "ainsi qu’avec Pharaon, l’homme aux épieux ?",
                            "verse 89:12": "Tous, étaient des gens qui transgressaient dans",
                            "verse 89:13": "pays,",
                            "verse 89:14": "et y avaient commis beaucoup de désordre.",
                            "verse 89:15": "Donc, ton Seigneur déversa sur eux un fouet du châtiment.",
                            "verse 89:16": "Car ton Seigneur demeure aux aguets.",
                            "verse 89:17": "Quant à l’homme, lorsque son Seigneur l’éprouve en l’honorant et en le comblant de bienfaits, il dit : «Mon Seigneur m’a honoré».",
                            "verse 89:18": "Mais par contre, quand Il l’éprouve en lui restreignant sa subsistance, il dit : «Mon Seigneur m’a avili».",
                            "verse 89:19": "Mais non ! C’est vous plutôt, qui n’êtes pas généreux envers les orphelins;",
                            "verse 89:20": "qui ne vous incitez pas mutuellement à nourrir le pauvre,",
                            "verse 89:21": "qui dévorez l’héritage avec une avidité vorace,",
                            "verse 89:22": "et aimez les richesses d’un amour sans bornes.",
                            "verse 89:23": "Prenez garde ! Quand la terre sera complètement pulvérisée,",
                            "verse 89:24": "et que ton Seigneur viendra ainsi que les Anges, rang par rang,",
                            "verse 89:25": "et que ce jour-là, on amènera l’Enfer; ce jour-là, l’homme se rappellera.",
                            "verse 89:26": "Il dira : «Hélas ! Que n’ai-je fait du bien pour ma vie future !",
                            "verse 89:27": "Ce jour-là donc, nul ne saura châtier comme Lui châtie,",
                            "verse 89:28": "et nul ne saura garrotter comme Lui garrotte.",
                            "verse 89:29": "«ô toi, âme apaisée,",
                            "verse 89:30": "retourne vers ton Seigneur, satisfaite et agréée;",
                            "verse 89:31": "entre donc parmi Mes serviteurs,",
                            "verse 89:32": "et entre dans Mon Paradis»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Bei der Morgendämmerung,",
                            "verse 89:2": "Und den zehn Nächten,",
                            "verse 89:3": "Und beim Geraden und Ungeraden,",
                            "verse 89:4": "Und der Nacht, wenn sie vergeht;",
                            "verse 89:5": "Hierin ist wahrlich ausreichender Beweis für einen Verständigen.",
                            "verse 89:6": "Hast du nicht gesehen, wie dein Herr mit den Àd verfuhr,",
                            "verse 89:7": "Dem Volk von Iram, Besitzer von hohen Burgen,",
                            "verse 89:8": "Dergleichen nicht erschaffen ward in (anderen) Städten,",
                            "verse 89:9": "Und den Thamüd, die die Felsen aushieben im Tal,",
                            "verse 89:10": "Und Pharao, dem Herrn von gewaltigen Zelten?",
                            "verse 89:11": "Die frevelten in den Städten,",
                            "verse 89:12": "Und viel Verderbnis darin stifteten.",
                            "verse 89:13": "Drum ließ dein Herr die Peitsche der Strafe auf sie fallen.",
                            "verse 89:14": "Wahrlich, dein Herr ist auf der Wacht.",
                            "verse 89:15": "Wenn sein Herr den Menschen prüft, indem Er ihn ehrt und Gnaden auf ihn häuft, dann spricht er: «Mein Herr hat mich geehrt.",
                            "verse 89:16": "Wenn Er ihn aber prüft, indem Er ihm seine Versorgung verkürzt, dann spricht er: «Mein Herr hat mich erniedrigt.",
                            "verse 89:17": "Nein, doch ihr ehrt nicht die Waise",
                            "verse 89:18": "Und treibet einander nicht an, den Armen zu speisen,",
                            "verse 89:19": "Und ihr verzehrt das Erbe (anderer) ganz und gar,",
                            "verse 89:20": "Und ihr liebt den Reichtum mit unmäßiger Liebe.",
                            "verse 89:21": "Nein, wenn die Erde zu Staub zermalmt wird;",
                            "verse 89:22": "Und dein Herr kommt und (auch) die Engel, in Reihen gereiht;",
                            "verse 89:23": "Und die Hölle nahegebracht wird an jenem Tage.",
                            "verse 89:24": "Er wird sprechen: «O hätte ich doch im voraus für (dieses) mein Leben Vorsorge getroffen!»",
                            "verse 89:25": "Keiner kann strafen, wie Er an jenem Tage strafen wird.",
                            "verse 89:26": "Und keiner bindet so fest, wie Er festbinden wird.",
                            "verse 89:27": "(Doch) du, o beruhigte Seele,",
                            "verse 89:28": "Kehre zurück zu deinem Herrn, befriedigt in (Seiner) Zufriedenheit!",
                            "verse 89:29": "So tritt denn ein unter Meine Diener,",
                            "verse 89:30": "Und tritt ein in Meinen Garten! Diener,"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "lqcg dh d+le",
                            "verse 89:2": "vkSj nl jkrksa dh",
                            "verse 89:3": "vkSj t+q¶r o rkd+ dh",
                            "verse 89:4": "vkSj jkr dh tc vkus yxs",
                            "verse 89:5": "vD+yeUn ds okLrs rks t+:j cM+h d+le gS ¼fd dq¶+Q+kj ij t+:j vt+kc gksxk½",
                            "verse 89:6": "D;k rqeus ns[kk ugha fd rqEgkjs vkn ds lkFk D;k fd;k",
                            "verse 89:7": ";kfu bje okys njkt+ d+n",
                            "verse 89:8": "ftudk fely reke ¼nqfu;k ds½ Ógjksa esa dksbZ iSnk gh ugha fd;k x;k",
                            "verse 89:9": "vkSj lewn ds lkFk ¼D;k fd;k½ tks oknh ¼d+jk½ esa iRFkj rjk’k dj ?kj cukrs Fks",
                            "verse 89:10": "vkSj fQjvkÅu ds lkFk ¼D;k fd;k½ tks ¼lt+k ds fy,½ es[+ks j[krk Fkk",
                            "verse 89:11": ";s yksx eq[+krfyQ+ Ógjksa esa ljd’k gks jgs Fks",
                            "verse 89:12": "vkSj muesa cgqr ls Q+lkn QSyk j[ks Fks",
                            "verse 89:13": "rks rqEgkjs ijojfnxkj us mu ij vt+kc dk dksM+k yxk;k",
                            "verse 89:14": "cs’kd rqEgkjk ijojfnxkj rkd esa gS",
                            "verse 89:15": "ysfdu bUlku tc mldks mldk ijojfnxkj ¼bl rjg½ vkt+ekrk gS fd mldks bT+t+r o usver nsrk gS] rks dgrk gS fd esjs ijojfnxkj us eq>s bT+t+r nh gS",
                            "verse 89:16": "exj tc mldks ¼bl rjg½ vkt+ekrk gS fd ml ij jkst+h dks rax dj nsrk gS cksy mBrk gS fd esjs ijojfnxkj us eq>s t+yhy fd;k",
                            "verse 89:17": "gjfxt+ ugha cfYd rqe yksx u ;rhe dh [k+kfrjnkjh djrs gks",
                            "verse 89:18": "vkSj u eksgrkt dks [kkuk f[kykus dh rjx+hc nsrs gks",
                            "verse 89:19": "vkSj ehjkjk ds eky ¼gyky o gjke½ dks lesV dj p[k tkrs gks",
                            "verse 89:20": "vkSj eky dks cgqr gh vt+ht+ j[krs gks",
                            "verse 89:21": "lqu j[kks fd tc t+ehu dwV dwV dj jst+k jst+k dj nh tk,xh",
                            "verse 89:22": "vkSj rqEgkjs ijojfnxkj dk gqDe vkSj Q+fj’rs drkj ds drkj vk tk,¡xs",
                            "verse 89:23": "vkSj ml fnu tgUuqe lkeus dj nh tk,xh ml fnu bUlku pkSadsxk exj vc pkSaduk dgk¡ ¼Q+k;nk nsxk½",
                            "verse 89:24": "¼ml oD+r½ dgsxk fd dk’k eSus viuh ¼bl½ ft+Unxh ds okLrs dqN igys Hkstk gksrk",
                            "verse 89:25": "rks ml fnu [+kqnk ,slk vt+kc djsxk fd fdlh us oSlk vt+kc u fd;k gksxk",
                            "verse 89:26": "vkSj u dksbZ mlds tdM+us dh rjg tdM+sxk",
                            "verse 89:27": "¼vkSj dqN yksxksa ls dgsxk½ ,s bResuku ikus okyh tku",
                            "verse 89:28": "vius ijojfnxkj dh rjQ+ py rw mlls [+kq’k og rq> ls jkt+h",
                            "verse 89:29": "rks esjs ¼[+kkl½ cUnksa esa Ókfey gks tk",
                            "verse 89:30": "vkSj esjs csfg’r esa nkf[+ky gks tk"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Demi fajar,",
                            "verse 89:2": "dan malam yang sepuluh,",
                            "verse 89:3": "dan yang genap dan yang ganjil,",
                            "verse 89:4": "dan malam bila berlalu.",
                            "verse 89:5": "Pada yang demikian itu terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal.",
                            "verse 89:6": "Apakah kamu tidak memperhatikan bagaimana Tuhanmu berbuat terhadap kaum ’Aad?,",
                            "verse 89:7": "(yaitu) penduduk Iram yang mempunyai bangunan-bangunan yang tinggi,",
                            "verse 89:8": "yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,",
                            "verse 89:9": "dan kaum Tsamud yang memotong batu-batu besar di lembah,",
                            "verse 89:10": "dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),",
                            "verse 89:11": "yang berbuat sewenang-wenang dalam negeri,",
                            "verse 89:12": "lalu mereka berbuat banyak kerusakan dalam negeri itu,",
                            "verse 89:13": "karena itu Tuhanmu menimpakan kepada mereka cemeti azab,",
                            "verse 89:14": "sesungguhnya Tuhanmu benar-benar mengawasi.",
                            "verse 89:15": "Adapun manusia apabila Tuhannya mengujinya lalu dimuliakan-Nya dan diberi-Nya kesenangan, maka dia berkata: \"Tuhanku telah memuliakanku\".",
                            "verse 89:16": "Adapun bila Tuhannya mengujinya lalu membatasi rezekinya maka dia berkata: \"Tuhanku menghinakanku\".",
                            "verse 89:17": "Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,",
                            "verse 89:18": "dan kamu tidak saling mengajak memberi makan orang miskin,",
                            "verse 89:19": "dan kamu memakan harta pusaka dengan cara mencampur baurkan (yang halal dan yang batil),",
                            "verse 89:20": "dan kamu mencintai harta benda dengan kecintaan yang berlebihan.",
                            "verse 89:21": "Jangan (berbuat demikian).",
                            "verse 89:22": "dan datanglah Tuhanmu; sedang malaikat berbaris-baris.",
                            "verse 89:23": "dan pada hari itu diperlihatkan neraka Jahanam; dan pada hari itu ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya.",
                            "verse 89:24": "Dia mengatakan: \"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.",
                            "verse 89:25": "Maka pada hari itu tiada seorang pun yang menyiksa seperti siksa-Nya,",
                            "verse 89:26": "dan tiada seorang pun yang mengikat seperti ikatan-Nya.",
                            "verse 89:27": "Hai jiwa yang tenang.",
                            "verse 89:28": "Kembalilah kepada Tuhanmu dengan hati yang puas lagi diridai-Nya.",
                            "verse 89:29": "Maka masuklah ke dalam jama’ah hamba-hamba-Ku,",
                            "verse 89:30": "dan masuklah ke dalam surga-Ku."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Per l'alba,",
                            "verse 89:2": "per le dieci notti ,",
                            "verse 89:3": "per il pari e per il dispari",
                            "verse 89:4": "e per la notte quando trascorre.",
                            "verse 89:5": "Non è questo un giuramento per chi ha intelletto?",
                            "verse 89:6": "Non hai visto come il tuo Signore ha trattato gli 'Âd?",
                            "verse 89:7": "e Iram dalla colonna,",
                            "verse 89:8": "senza eguali tra le contrade,",
                            "verse 89:9": "e i Thamûd che scavavano la roccia nella vallata",
                            "verse 89:10": "e Faraone, quello dei pali ?",
                            "verse 89:11": "",
                            "verse 89:12": "costoro furono ribelli nel mondo",
                            "verse 89:13": "e seminarono la corruzione,",
                            "verse 89:14": "e il tuo Signore calò su di loro la frusta del castigo.",
                            "verse 89:15": "In verità il tuo Signore è all'erta.",
                            "verse 89:16": "Quanto all'uomo, allorché il suo Signore lo mette alla prova onorandolo e colmandolo di favore, egli dice: « Il mio Signore mi ha onorato».",
                            "verse 89:17": "Quando invece lo mette alla prova lesinando i Suoi doni, egli dice: « Il mio Signore mi ha umiliato».",
                            "verse 89:18": "No, siete voi che non onorate l'orfano,",
                            "verse 89:19": "che non vi sollecitate vicendevolmente a nutrire il povero,",
                            "verse 89:20": "che divorate avidamente l'eredità",
                            "verse 89:21": "e amate le ricchezze d'amore smodato.",
                            "verse 89:22": "No, quando la terra sarà polverizzata, in polvere fine,",
                            "verse 89:23": "e verranno il tuo Signore e gli angeli schiere su schiere,",
                            "verse 89:24": "in quel Giorno sarà avvicinata l'Inferno, in quel Giorno l'uomo si rammenterà .",
                            "verse 89:25": "Dirà: «Ahimé! Se avessi mandato avanti qualcosa per la mia vita !».",
                            "verse 89:26": "",
                            "verse 89:27": "In quel Giorno nessuno castigherà come Lui castiga,",
                            "verse 89:28": "e nessuno incatenerà come Lui incatena.",
                            "verse 89:29": "\"O anima ormai acquietata ,",
                            "verse 89:30": "ritorna al tuo Signore soddisfatta e accetta;",
                            "verse 89:31": "entra tra i Miei servi,",
                            "verse 89:32": "entra nel Mio Paradiso\"."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "暁において，",
                            "verse 89:2": "10夜において，",
                            "verse 89:3": "偶数と奇数において，",
                            "verse 89:4": "去り行く夜において（誓う）。",
                            "verse 89:5": "本当にこの中には，分別ある者への誓いがあるではないか。",
                            "verse 89:6": "あなたはアッラーが，如何にアード（の民）を処分されたかを考えないのか，",
                            "verse 89:7": "円柱の並び立つイラム（の都）のことを，",
                            "verse 89:8": "これに類するものは，その国において造られたことはなかったではないか。",
                            "verse 89:9": "また谷間の岩に彫り込んだサムード（の民）や，",
                            "verse 89:10": "杭のぬしフィルアゥン（のことを考えないのか）。",
                            "verse 89:11": "これらは（凡て），その国において法を越えた者たちで，",
                            "verse 89:12": "その地に邪悪を増長させた。",
                            "verse 89:13": "それであなたの主は，懲罰の鞭をかれらに浴びせかけられた。",
                            "verse 89:14": "本当にあなたの主は監視の塔におられる。",
                            "verse 89:15": "さて人間は主が御試みのため，寛大にされ恵みを授けられると，かれは，「主は，わたしに寛大であられます。」と言う。",
                            "verse 89:16": "だがかれを試み，御恵みを減らされる時は，「主はわたしを，軽視なさいます。」と言う。",
                            "verse 89:17": "断じていけない。いや，あなたがたは孤児を大切にしない。",
                            "verse 89:18": "また貧者を養うために，互いに励まさない。",
                            "verse 89:19": "しかも遺産を取り上げ，強欲を欲しい尽にする。",
                            "verse 89:20": "またあなたがたは，法外な愛で財産を愛する。",
                            "verse 89:21": "断じていけない。大地が粉々に砕かれる時，",
                            "verse 89:22": "主は，列また列の天使（を従え），来臨なされる。",
                            "verse 89:23": "また地獄は，その日（目の当たりに）運ばれ，その日人間は反省するであろう。だが反省したとて，どうしてかれのためになろうか。",
                            "verse 89:24": "かれは，「ああ，わたしの（将来の）生命のために，（善行を）貯えていたならば。」と言う。",
                            "verse 89:25": "それでその日，誰もなし得ない程の懲罰を加えられ，",
                            "verse 89:26": "また誰も拘束し得ない程に束縛なされる。",
                            "verse 89:27": "（善行を積んだ魂に言われるであろう。）おお，安心，大悟している魂よ，",
                            "verse 89:28": "あなたの主に返れ，歓喜し御満悦にあずかって。",
                            "verse 89:29": "あなたは，わがしもべの中に入れ。",
                            "verse 89:30": "あなたは，わが楽園に入れ。 あなたは，わがしもべの中に入れ。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "새벽의 여명기를 두고 맹세하사",
                            "verse 89:2": "열흘 동안의 밤을 두고 맹세 하며",
                            "verse 89:3": "짝수와 홀수를 두고 맹세하며",
                            "verse 89:4": "사라지는 밤을 두고 맹세하니",
                            "verse 89:5": "실로 그 안에는 이해하는 자 들을 위한 예증이 있노라",
                            "verse 89:6": "주님께서 아드 백성에 행한 이야기와",
                            "verse 89:7": "높은 빌딩을 소유한 이람의 백성에 관한 얘기를 아느뇨",
                            "verse 89:8": "그와 같은 힘센 백성이 대지 위에서 창조된 적이 없었노라",
                            "verse 89:9": "산의 바위로 계곡에 집을 세 운 사무드 백성의 이야기와",
                            "verse 89:10": "강한 군대를 가진 오만한 파라오의 이야기를 아느뇨",
                            "verse 89:11": "실로 이들 모두는 도읍에서 죄악을 낳고",
                            "verse 89:12": "그곳에서 해악을 더해만 갔 으니",
                            "verse 89:13": "주님께서 그들 위에 여러가 지의 응벌을 내렸노라",
                            "verse 89:14": "실로 그대 주님은 항상 감시하고 계시니라",
                            "verse 89:15": "주님께서 인간을 시험삼아 명예와 은혜를 베풀면 이것은 주 께서 내게 영광을 주시었노라 하 더라",
                            "verse 89:16": "그분께서 일용할 양식을 감 소하실 때면 주께서 나를 처량하 게 만드시도다 말하고 있으나",
                            "verse 89:17": "그렇지 아니함이라 너희는 고아들에게 은혜를 베풀지 아니했으며",
                            "verse 89:18": "가난한 자들에게 음식을 제공함에 서로가 서로에게 격려하지아니하며",
                            "verse 89:19": "오히려 너희는 욕심을 내어그들의 유산을 삼키고",
                            "verse 89:20": "오만하게 재물만을 사랑하였노라",
                            "verse 89:21": "그러나 대지가 산산조각이 되고",
                            "verse 89:22": "주님이 임하시고 그분의 천 사들이 줄지어 나을 때",
                            "verse 89:23": "그날은 지옥이 나타나니라 그날 인간은 그의 업적을 상기하 나 그의 회고가 어떻게 그를 유 익하게 하겠느뇨",
                            "verse 89:24": "그때야 인간은 내 미래의 생을 위하여 선행을 \\xC2g어야 \\xC2g는데 라고 한탄하여 말하나",
                            "verse 89:25": "그날은 어느 누구도 가할 수없는 하나님의 응벌만이 있을 것 이라",
                            "verse 89:26": "어느 누구도 할 수 없는 그 분의 속박이 있으리라",
                            "verse 89:27": "의로운 영혼들에게는 영혼들 아 너희는 완전한 휴식과 기쁨속 에 있으리라 라는 말씀과",
                            "verse 89:28": "기뻐하고 즐거워하며 주님께 로 돌아가",
                            "verse 89:29": "나와 함께 하는 자들 가운데들어와",
                            "verse 89:30": "나의 천국으로 들라는 말씀 이 있을 것이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "سوێند به به‌ره‌به‌یان.",
                            "verse 89:2": "سوێندم به‌و شه‌وانه‌ی که ده شه‌ون (هه‌ندێک ده‌ڵێن ده شه‌وی کۆتایی ڕه‌مه‌زانه‌، هه‌ندێکیش ده‌ڵێن ده شه‌وی سه‌ره‌تای مانگی ذی الحجه‌یه که کاتی ئه‌نجامدانی حه‌جه‌، هه‌ردوو بۆنه‌که‌ش پیرۆزن).",
                            "verse 89:3": "سوێند به ئه‌و شتانه که جووتن، هه‌روه‌ها سوێند به هه‌موو ئه‌و شتانه‌ی که تاکن (یاخود سوێند به شه‌وه جووت و شه‌وه تاکه‌کان)",
                            "verse 89:4": "به هه‌موو شه‌وێک کاتێک تێده‌په‌ڕێت (له سه‌ره‌نجامی سوڕانه‌وه‌ی زه‌وی به‌ده‌وری خۆیدا).",
                            "verse 89:5": "ئایا له‌و شتانه‌دا سوێندی شایسته نییه بۆ که‌سێك خاوه‌نی عه‌قڵ و بیروهۆش بێت؟!",
                            "verse 89:6": "ئایا نه‌تزانیووه په‌روه‌ردگاری تۆ چی کرد به هۆزی عاد.",
                            "verse 89:7": "که ئه‌ویش هۆزی (ارم) و خاوه‌نی پایه‌ی به‌رزو کۆڵه‌که و نیرگه‌ی درێژ بوون (قه‌ومی عاد له شاری ئیره‌م که باڵابه‌رزو تێکسمڕاو بوون، خانووبه‌ره و کۆشک و ته‌لاری گه‌وره و به‌رزیان دروست ده‌کرد).",
                            "verse 89:8": "له سه‌رده‌می ئه‌واندا له هیچ شار و شوێنێکدا، کۆشك و ته‌لاری وه‌ک ئه‌وه‌ی ئه‌وان دروست نه‌کراوه‌.",
                            "verse 89:9": "ئایا نه‌تزانیووه قه‌ومی ثمودیش خوا چی لێکردن، ئه‌وانه‌ی له دۆڵ و شیوه‌کانه‌وه به‌ردیان ده‌تاشی و ده‌یانگواسته‌وه بۆ ناو قه‌دی چیاکان و له‌وێ خانوویان دروست ده‌کرد؟",
                            "verse 89:10": "هه‌روه‌ها فیرعه‌ونی خاوه‌ن ئه‌هرامه‌کان، (چ کۆشک و بینایه‌کی مه‌حکه‌میان وه‌کو مێخ داده‌کوتی به زه‌ویدا).",
                            "verse 89:11": "ئه‌وانه‌ی که سته‌میان به‌رپاکرد له وڵاتداو خه‌ڵکیان ده‌چه‌وسانه‌وه‌.",
                            "verse 89:12": "جا خراپه و تاوان و گوناهی زۆریان ئه‌نجامده‌دا.",
                            "verse 89:13": "(دوای ماوه‌یه‌کی دیاریکراو) په‌روه‌ردگاری تۆ سزاو خه‌شـم و قینی خۆی ڕژاند به‌سه‌ریاندا و ته‌فرو تونای کردن.",
                            "verse 89:14": "به‌ڕاستی په‌روه‌ردگاری تۆ هه‌میشه و به‌رده‌وام ئاماده‌یه که تۆڵه له سته‌مکاران بسێنێت.",
                            "verse 89:15": "جا کاتێک ئاده‌میزاد له‌لایه‌ن په‌روه‌ردگاریه‌وه تاقی ده‌کرێته‌وه‌، زێزی لێ ده‌نێت و نازو نیعمه‌تی به‌سه‌ردا ده‌ڕێژێت، ده‌ڵێت: (به خوا وا دیاره‌) په‌روه‌ردگارم خۆشی ده‌وێم ڕێزم هه‌یه لای.",
                            "verse 89:16": "به‌ڵام کاتێک تاقی ده‌کاته‌وه و ڕزق و ڕۆزی که‌می پێده‌به‌خشێت و لێی ده‌گرێته‌وه ده‌ڵێت: وا دیاره په‌روه‌ردگارم منی خۆش ناوێت و ڕقی لێمه و ڕیسوای کردووم.",
                            "verse 89:17": "نه‌خێر ئه‌و شتانه‌، هیچی وا نیه‌، (نه‌به‌خشین مانی ڕێز و قه‌دره‌، نه‌لێگرتنه‌وه مانای بێ ڕێزی و بێ قه‌درییه‌، به‌ڵکو ئێوه (سه‌ره‌ڕای ئه‌و بیرو بۆچوونه چه‌وتانه‌تان) ڕێزی هه‌تیو ناگرن ونازی پێناده‌ن.",
                            "verse 89:18": "هانی یه‌کتر ناده‌ن بۆ ئه‌وه‌ی خۆراک ببه‌خشن به‌هه‌ژار و نه‌داران.",
                            "verse 89:19": "میڕاتی ده‌خۆن و هه‌مووی ده‌ماشنه‌وه (حه‌ق خزمان و نه‌دارانی لێ ناده‌ن).",
                            "verse 89:20": "ماڵ و سامان و دارایشتان زۆر خۆشده‌وێت (ره‌چاوی حه‌ڵاڵ و حه‌رام ناکه‌ن).",
                            "verse 89:21": "نه‌خێر، (هه‌ر ئاوا بۆتان نالوێت)، کاتێك دێت که زه‌وی ورد و خاش ده‌کرێت و له‌ناکاو ده‌درێت به‌یه‌کدا.",
                            "verse 89:22": "په‌روه‌ردگارت دێت و فریشته‌کانیش پۆل پۆل (هاتنی په‌روه‌ردگاری مه‌زن خۆی نه‌بێت که‌س نازانێت چۆنه‌).",
                            "verse 89:23": "ئه‌و ڕۆژه دۆزه‌خ ده‌هێنرێت و نیشان ده‌درێت، جا ئه‌و ڕۆژه (ئاده‌میزادی بێ باوه‌ڕ) ده‌زانێت چ په‌ندێکی به‌سه‌ر خۆی هێناوه‌، به‌ڵام تازه به‌خۆدا هاتنه‌وه و په‌شیمانی هیچ سوودێکی نیه و دادی نادات؟!",
                            "verse 89:24": "(ئه‌وسا به که‌ساسی و هه‌ناسه‌ی سارده‌وه‌‎) ده‌ڵێت: خۆزگه بۆ ئه‌م ژیانه‌م ده‌ست پێشخه‌ریم بکردایه‌.",
                            "verse 89:25": "جا ئیتر ئه‌و ڕۆژه که‌س وه‌ک خوا به‌خشم و قین نیه له بێ باوه‌ڕان، له‌به‌رئه‌وه سزایه‌کیان ده‌دات که که‌س ناتوانێت سزای له‌و چه‌شنه بدات.",
                            "verse 89:26": "که‌سیش وه‌ک ئه‌و زاته (بێ باوه‌ڕان) نابه‌ستێته‌وه و به‌ندیان ناکات.",
                            "verse 89:27": "(شایانی باسه به ئیماندارای سه‌رفراز له سه‌ره‌مه‌رگدا ده‌وترێت) ئه‌ی خاوه‌نی دڵ و ده‌روونی پڕ له ئارامی (ئه‌ی ئاده‌میزادی ژیر و هۆشمه‌ند که له ته‌مه‌نی کۆتای دنیادا په‌روه‌ردگارت ناسی و به‌جوانی ده‌تپه‌رست.",
                            "verse 89:28": "بگه‌ڕێره‌وه بۆ لای په‌روه‌ردگارت که تۆ له‌و ڕازیت و ئه‌ویش له تۆ ڕازیه‌.",
                            "verse 89:29": "ده بچۆره ڕیزی به‌نده چاکه نازدار و به‌ڕێزه‌کانمه‌وه‌.",
                            "verse 89:30": "بچۆره به‌هه‌شته خۆشه ڕازاوه‌که‌مه‌وه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Demi waktu fajar;",
                            "verse 89:2": "Dan malam yang sepuluh (yang mempunyai kelebihan di sisi Allah);",
                            "verse 89:3": "Dan bilangan yang genap serta yang ganjil;",
                            "verse 89:4": "Dan malam, apabila ia berlalu;",
                            "verse 89:5": "Bukankah yang demikian itu mengandungi sumpah (yang diakui kebenarannya) oleh orang yang berakal sempurna?",
                            "verse 89:6": "(Kami tetap akan membinasakan orang-orang yang menentangmu wahai Muhammad), tidakkah engkau perhatikan, bagaimana Tuhanmu telah melakukan terhadap kaum Aad (yang kufur derhaka)",
                            "verse 89:7": "Iaitu penduduk \"Iram\" yang mempunyai bangunan-bangunan yang tinggi tiangnya, (sesuai dengan penduduknya)",
                            "verse 89:8": "Yang belum pernah diciptakan sepertinya (tentang besar dan kukuhnya) di segala negeri (pada zamannya)?",
                            "verse 89:9": "Dan (terhadap) kaum Thamud yang memahat batu-batu besar di lembah (Wadil-Qura iaitu tempat tinggalnya)?",
                            "verse 89:10": "Dan (terhadap) Firaun yang menguasai bangunan-bangunan yang handal kukuh?",
                            "verse 89:11": "(Semuanya itu ialah) orang-orang yang telah bermaharajalela di negeri (masing-masing).",
                            "verse 89:12": "Lalu mereka melakukan dengan banyaknya kerosakan dan bencana di negeri-negeri itu.",
                            "verse 89:13": "Dengan yang demikian, Tuhanmu mencurahkan ke atas mereka berbagai paluan azab;",
                            "verse 89:14": "Sesungguhnya Tuhanmu tetap mengawas dan membalas, (terutama balasan akhirat)",
                            "verse 89:15": "(Dalam pada itu manusia tidak menghiraukan balasan akhirat), oleh yang demikian, maka kebanyakan manusia apabila diuji oleh Tuhannya dengan dimuliakan dan dimewahkan hidupnya, (dia tidak mahu bersyukur tetapi terus bersikap takbur) serta berkata dengan sombongnya: Tuhanku telah memuliakan daku!",
                            "verse 89:16": "Dan sebaliknya apabila dia diuji oleh Tuhannya, dengan disempitkan rezekinya, (dia tidak bersabar bahkan dia resah gelisah) serta merepek dengan katanya: Tuhanku telah menghinakan daku!",
                            "verse 89:17": "Jangan demikian, (sebenarnya kata-kata kamu itu salah).",
                            "verse 89:18": "Dan kamu tidak menggalakkan untuk memberi makanan (yang berhak diterima oleh) orang miskin;",
                            "verse 89:19": "Dan kamu sentiasa makan harta pusaka secara rakus (dengan tidak membezakan halal haramnya),",
                            "verse 89:20": "Serta kamu pula sayangkan harta secara tamak haloba!",
                            "verse 89:21": "Jangan sekali-kali bersikap demikian! (Sebenarnya) apabila bumi (dihancurkan segala yang ada di atasnya dan) diratakan serata-ratanya,",
                            "verse 89:22": "Dan (perintah) Tuhanmu pun datang, sedang malaikat berbaris-baris (siap sedia menjalankan perintah),",
                            "verse 89:23": "Serta diperlihatkan Neraka Jahannam pada hari itu, (maka) pada saat itu manusia akan ingat (hendak berlaku baik) dan bagaimana ingatan itu akan berguna lagi kepadanya?",
                            "verse 89:24": "Dia akan berkata: Alangkah baiknya kalau aku dahulu sediakan amal-amal baik untuk hidupku (di sini)!",
                            "verse 89:25": "Maka pada hari itu tiada sesiapapun yang dapat menyeksa seperti azab (yang ditimpakan oleh) Allah.",
                            "verse 89:26": "Dan tiada sesiapapun yang dapat mengikat serta membelenggu seperti ikatan dan belengguNya.",
                            "verse 89:27": "(Setelah menerangkan akibat orang-orang yang tidak menghiraukan akhirat, Tuhan menyatakan bahawa orang-orang yang beriman dan beramal soleh akan disambut dengan kata-kata): Wahai orang yang mempunyai jiwa yang sentiasa tenang tetap dengan kepercayaan dan bawaan baiknya! -",
                            "verse 89:28": "Kembalilah kepada Tuhanmu dengan keadaan engkau berpuas hati (dengan segala nikmat yang diberikan) lagi diredhai (di sisi Tuhanmu) ! -",
                            "verse 89:29": "Serta masuklah engkau dalam kumpulan hamba-hambaku yang berbahagia",
                            "verse 89:30": "Dan masuklah ke dalam SyurgaKu!"
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "به سپيده دم سوگند،",
                            "verse 89:2": "و به شبهاى دهگانه،",
                            "verse 89:3": "و به زوج و فرد،",
                            "verse 89:4": "و به شب، هنگامى كه (به سوى روشنايى روز) حركت مى‏كند سوگند (كه پروردگارت در كمين ظالمان است)!",
                            "verse 89:5": "آيا در آنچه گفته شد، سوگند مهمى براى صاحبان خرد نيست؟!",
                            "verse 89:6": "آيا نديدى پروردگارت با قوم «عاد» چه كرد؟!",
                            "verse 89:7": "و با آن شهر «ارم‏» باعظمت،",
                            "verse 89:8": "همان شهرى كه مانندش در شهرها آفريده نشده بود!",
                            "verse 89:9": "و قوم «ثمود» كه صخره‏هاى عظيم را از (كنار) دره مى‏بريدند (و از آن خانه و كاخ مى‏ساختند)!",
                            "verse 89:10": "و فرعونى كه قدرتمند و شكنجه‏گر بود،",
                            "verse 89:11": "همان اقوامى كه در شهرها طغيان كردند،",
                            "verse 89:12": "و فساد فراوان در آنها به بار آوردند;",
                            "verse 89:13": "به همين سبب خداوند تازيانه عذاب را بر آنان فرو ريخت!",
                            "verse 89:14": "به يقين پروردگار تو در كمينگاه (ستمگران) است!",
                            "verse 89:15": "اما انسان هنگامى كه پروردگارش او را براى آزمايش، اكرام مى‏كند و نعمت مى‏بخشد (مغرور مى‏شود و) مى‏گويد: «پروردگارم مرا گرامى داشته است!»",
                            "verse 89:16": "و اما هنگامى كه براى امتحان، روزيش را بر او تنگ مى‏گيرد (مايوس مى‏شود و) مى‏گويد: س‏خ‏للّهپروردگارم مرا خوار كرده است!»",
                            "verse 89:17": "چنان نيست كه شما مى‏پنداريد; شما يتيمان را گرامى نمى‏داريد،",
                            "verse 89:18": "و يكديگر را بر اطعام مستمندان تشويق نمى‏كنيد،",
                            "verse 89:19": "و ميراث را (از راه مشروع و نامشروع) جمع كرده مى‏خوريد،",
                            "verse 89:20": "و مال و ثروت را بسيار دوست داريد (و بخاطر آن گناهان زيادى مرتكب مى‏شويد)!",
                            "verse 89:21": "چنان نيست كه آنها مى‏پندارند! در آن هنگام كه زمين سخت در هم كوبيده شود،",
                            "verse 89:22": "و فرمان پروردگارت فرا رسد و فرشتگان صف در صف حاضر شوند،",
                            "verse 89:23": "و در آن روز جهنم را حاضر مى‏كنند; (آرى) در آن روز انسان متذكر مى‏شود; اما اين تذكر چه سودى براى او دارد؟!",
                            "verse 89:24": "مى‏گويد: «اى كاش براى (اين) زندگيم چيزى از پيش فرستاده بودم!»",
                            "verse 89:25": "در آن روز هيچ كس همانند او ( خدا) عذاب نمى‏كند،",
                            "verse 89:26": "و هيچ كس همچون او كسى را به بند نمى‏كشد!",
                            "verse 89:27": "تو اى روح آرام‏يافته!",
                            "verse 89:28": "به سوى پروردگارت بازگرد در حالى كه هم تو از او خشنودى و هم او از تو خشنود است،",
                            "verse 89:29": "پس در سلك بندگانم درآى،",
                            "verse 89:30": "و در بهشتم وارد شو!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Pela aurora,",
                            "verse 89:2": "E pelas dez noites,",
                            "verse 89:3": "E pelo par e pelo ímpar,",
                            "verse 89:4": "E pela noite, quando se retira (que sereis castigados)!",
                            "verse 89:5": "Porventura, não há nisso um juramento adequado, para o sensato?",
                            "verse 89:6": "Não reparaste em como o teu Senhor procedeu, em relação à (tribo de) Ad,",
                            "verse 89:7": "Aos (habitantes de) Iram, (cidade) de pilares elevados,",
                            "verse 89:8": "Cujo similar não foi criado em toda a terra?",
                            "verse 89:9": "E no povo de Samud, que perfurou rochas no vale?",
                            "verse 89:10": "E no Faraó, o senhor das estacas,",
                            "verse 89:11": "Os quais transgrediram, na terra,",
                            "verse 89:12": "E multiplicaram, nela, a corrupção,",
                            "verse 89:13": "Pelo que o teu Senhor lhes infligiu variados castigos?",
                            "verse 89:14": "Atenta para o fato de que o teu Senhor está sempre alerta.",
                            "verse 89:15": "Quanto ao homem, quando seu Senhor o experimenta, honrando-o e agraciando-o, diz (empertigado): Meu Senhor me honra!",
                            "verse 89:16": "Porém, quando o prova, restringindo a Sua graça, diz: Meu Senhor me afronta!",
                            "verse 89:17": "Qual! Vós não honrais o órfão,",
                            "verse 89:18": "Nem nos estimulais a alimentar o necessitado;",
                            "verse 89:19": "E consumis avidamente as heranças,",
                            "verse 89:20": "E cobiçais insaciavelmente os bens terrenos!",
                            "verse 89:21": "Qual! Quando a terra for triturada fortemente,",
                            "verse 89:22": "E aparecer o teu Senhor, com os Seus anjos em desfile,",
                            "verse 89:23": "E o inferno, nesse dia, for destacado, então o homem recordará; porém de que lhe servirá a recordação!",
                            "verse 89:24": "Dirá: Oxalá tivesse diligenciado (na prática do bem), durante a minha vida!",
                            "verse 89:25": "Porém, nesse dia, ninguém castigará como Ele (o fará),",
                            "verse 89:26": "Nem ninguém acorrentará, como Ele (o fará);",
                            "verse 89:27": "E tu, ó alma em paz,",
                            "verse 89:28": "Retorna ao teu Senhor, satisfeita (com Ele) e Ele satisfeito (contigo)!",
                            "verse 89:29": "Entre no número dos Meus servos!",
                            "verse 89:30": "E entra no Meu jardim!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 89:1": "Pe zori",
                            "verse 89:2": "Și pe cele zece nopți!",
                            "verse 89:3": "Pe cel care are pereche și pe cel fãrã pereche",
                            "verse 89:4": "Și pe noaptea ce se scurge!",
                            "verse 89:5": "Oare este acesta un jurãmânt pentru cel cu pricepere?",
                            "verse 89:6": "Oare nu ai vãzut ce a fãcut Domnul tãu cu ’Ad,",
                            "verse 89:7": "Cu Iram,",
                            "verse 89:8": "cu corturi ridicate,",
                            "verse 89:9": "Care nu a mai avut seamãn printre cetãți",
                            "verse 89:10": "Și cu cei din neamul Thamud, care au tãiat stâncile din vale,",
                            "verse 89:11": "Și cu Faraon, stãpânul oștenilor",
                            "verse 89:12": "Care au fost nelegiuiți în cetãțile",
                            "verse 89:13": "Și au înmulțit stricãciunea în ele?",
                            "verse 89:14": "Așadar, Domnul tãu a vãrsat asupra lor chinuri felurite!",
                            "verse 89:15": "Domnul tãu este la pândã!",
                            "verse 89:16": "Cât despre om, când Domnul sãu îl încearcã și îl cinstește și este îndurãtor cu el, atunci el zice: \"Domnul meu m-a cinstit!\"",
                            "verse 89:17": "Însã când Domnul sãu îl încearcã și-i micșoreazã lui înzestrarea, atunci el zice: \"Domnul meu m-a umilit!\"",
                            "verse 89:18": "Dar nu! Voi nu-l cinstiți pe orfan",
                            "verse 89:19": "Și nu vã îndemnați la hrãnirea sãrmanului",
                            "verse 89:20": "Și mâncați moștenirea cu lãcomie",
                            "verse 89:21": "Și iubiți averea cu o dragoste fãrã de margini!",
                            "verse 89:22": "Nu! Când pãmântul va fi prefãcut în pulbere",
                            "verse 89:23": "Și va veni Domnul tãu, când îngerii vor sta rânduri-rânduri",
                            "verse 89:24": "Și va fi adusã în Ziua aceea Gheena, în Ziua aceea omul își amintește.",
                            "verse 89:25": "Și va zice el: \"Ce bine ar fi fost, dacã aș fi fãcut mai înainte [fapte bune] pentru viața mea!\"",
                            "verse 89:26": "Dar în Ziua aceea nimeni nu va osândi așa cum osândește El",
                            "verse 89:27": "Și nimeni nu va lega așa de strâns cum leagã El.",
                            "verse 89:28": "\"O, tu suflet liniștit!",
                            "verse 89:29": "Întoarce-te la Domnul tãu mulțumit și împãcat",
                            "verse 89:30": "Și intrã între robii Mei",
                            "verse 89:31": "Și intrã în Raiul Meu!” Mei"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 89:1": "Pe zori!",
                            "verse 89:2": "Pe cele zece nopţi!",
                            "verse 89:3": "Pe cel pereche şi pe cel nepereche!",
                            "verse 89:4": "Pe noapte când se împuţinează!",
                            "verse 89:5": "Este oare acesta un jurământ pentru cel cu cuget dăruit?",
                            "verse 89:6": "Nu ai văzut ce a făcut Domnul tău din adiţi",
                            "verse 89:7": "şi din Imran, cetatea cu coloane,",
                            "verse 89:8": "ce în alt ţinut n-a fost ca ea alta creată?",
                            "verse 89:9": "Şi din tamudiţi care au scobit stânca în vale?",
                            "verse 89:10": "Şi din Faraon cu ţepuşele sale?",
                            "verse 89:11": "Din toţi cei care se ticăloşesc pe lumea aceasta",
                            "verse 89:12": "şi o umplu de stricăciune?",
                            "verse 89:13": "Domnul tău i-a plesnit cu biciul osândei,",
                            "verse 89:14": "căci Domnul tău este asupra tuturor Veghetor.",
                            "verse 89:15": "Când omul este pus la încercare de Domnul său, cinstindu-l şi copleşindu-l cu daruri, atunci spune: “Domnul meu mă cinsteşte!”",
                            "verse 89:16": "Când însă îl pune la încercare, drămuindu-i traiul, atunci spune: “Domnul meu mă înjoseşte!”",
                            "verse 89:17": "Nu, voi sunteţi cei care nu cinstiţi orfanul!",
                            "verse 89:18": "Voi sunteţi cei care nu lăsaţi să fie ospătat sărmanul!",
                            "verse 89:19": "Voi mâncaţi cu lăcomie moştenirea!",
                            "verse 89:20": "Voi iubiţi în neştire bogăţia!",
                            "verse 89:21": "Nu, când pământul va fi făcut fărâme,",
                            "verse 89:22": "iar Domnul tău va veni cu îngerii, rând după rând:",
                            "verse 89:23": "în Ziua aceea, va veni Gheena şi în Ziua aceea, omul îşi va aminti.",
                            "verse 89:24": "El va spune: “Ce bine ar fi fost de aş fi făcut ceva pentru Viaţa mea de Apoi!”",
                            "verse 89:25": "În Ziua aceea va fi chinuit cum chinuit nu a mai fost nimeni,",
                            "verse 89:26": "şi va fi încătuşat cum încătuşat nu a mai fost nimeni.",
                            "verse 89:27": "Suflete ostoit!",
                            "verse 89:28": "Întoarce-te la Domnul tău, mulţumit şi dând mulţumire!",
                            "verse 89:29": "Intră dimpreună cu robii Mei!",
                            "verse 89:30": "Intră în Raiul Meu! Mei!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "В знак утренней зари",
                            "verse 89:2": "И десяти ночей2319,",
                            "verse 89:3": "В знак четных и нечетных чисел",
                            "verse 89:4": "И ночи, что вершит свой бег, —",
                            "verse 89:5": "Не в них ли кроется свидетельстводля тех, кто разумеет?",
                            "verse 89:6": "Ужель не видишь ты,Как поступил Господь с народом А –д2320",
                            "verse 89:7": "И с горделивыми колоннами Ирама,",
                            "verse 89:8": "Подобия которых ни одной странене удалось создать?",
                            "verse 89:9": "И с самудянами,Что пробивали скалы (для жилья)в долине?",
                            "verse 89:10": "С владыкой кольев — Фараоном2321,",
                            "verse 89:11": "Кто нечести творил по всей земле",
                            "verse 89:12": "И множил зло на ней?",
                            "verse 89:13": "На них обрушил твой ГосподьБич разных наказаний, —",
                            "verse 89:14": "Поистине, Он зрит во все!",
                            "verse 89:15": "Когда, испытывая человека,Бог осыпает благоденствием его,Глаголет человек надменно:«Господь почтил меня Своимблаговоленьем».",
                            "verse 89:16": "Когда ж (опять-таки) для испытаньяГосподь дары ему определяет (мерой),Он говорит: «Меня мой Бог унизил».",
                            "verse 89:17": "Вовсе нет! Сирот не чтите вы!",
                            "verse 89:18": "Не побуждаете друг друга накормитьголодных!",
                            "verse 89:19": "И жадно пожираетеОставленное не для вас наследство,",
                            "verse 89:20": "Богатство любите любовиючрезмерной.",
                            "verse 89:21": "Так нет же!Когда земля расколется на части,",
                            "verse 89:22": "И явится Господь и ангелы Егорядами,",
                            "verse 89:23": "И Ад предстанет (их глазам), —В тот ДеньВсе вспомнит человек!Но как воспоминанья эти помогутучасть облегчить его?",
                            "verse 89:24": "И скажет он:«О, если бы деяньями благимиЯ уготовил себе (будущую) жизнь!»",
                            "verse 89:25": "В тот ДеньНикто другой не сможет наказатьтаким (страданьем)2322,",
                            "verse 89:26": "Никто другой не сможет наложитьтаких оков2323.",
                            "verse 89:27": "О ты, ничем не омраченная душа!",
                            "verse 89:28": "Вернись к Владыке своемуЕму угодной и довольной, —",
                            "verse 89:29": "Средь (истинных) служителей Моих",
                            "verse 89:30": "Войди в Мой Рай! Моих"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "¡Por el alba!",
                            "verse 89:2": "¡Por diez noches!",
                            "verse 89:3": "¡Por el par y el impar!",
                            "verse 89:4": "¡Por la noche cuando transcurre.",
                            "verse 89:5": "¿No es esto un juramento para el dotado de intelecto?",
                            "verse 89:6": "¿No has visto cómo ha obrado tu Señor con los aditas,",
                            "verse 89:7": "con Iram, la de las columnas,",
                            "verse 89:8": "sin par en el país,",
                            "verse 89:9": "con los tamudeos, que excavaron la roca en el valle,",
                            "verse 89:10": "con Faraón el de las estacas,",
                            "verse 89:11": "que se habían excedido en el país",
                            "verse 89:12": "y que habían corrompido tanto en él?",
                            "verse 89:13": "Tu Señor descargó sobre ellos el azote de un castigo.",
                            "verse 89:14": "Tu Señor está, sí, al acecho.",
                            "verse 89:15": "El hombre, cuando su Señor le prueba honrándolo y concediéndole gracias, dice: «¡Mi Señor me ha honrado!»",
                            "verse 89:16": "En cambio.",
                            "verse 89:17": "¡No! Sois vosotros, más bien, los que no honráis al huérfano,",
                            "verse 89:18": "ni os animáis unos a otros a alimentar al pobre,",
                            "verse 89:19": "sino que devoráis vorazmente la herencia y",
                            "verse 89:20": "amáis la hacienda con desordenado amor.",
                            "verse 89:21": "¡No! Cuando la Tierra sea reducida a polvo fino",
                            "verse 89:22": "y venga tu Señor con los ángeles en filas,",
                            "verse 89:23": "ese día se traerá la gehena, ese día el hombre se dejará amonestar -y ¿de qué le servirá entonces la amonestación?-",
                            "verse 89:24": "y dirá: «¡Ojalá hubiera enviado por delante para mi vida!»",
                            "verse 89:25": "Ese día nadie castigará como Él,",
                            "verse 89:26": "nadie atará como Él.",
                            "verse 89:27": "«¡Alma sosegada!",
                            "verse 89:28": "¡Vuelve a tu Señor, satisfecha, acepta!",
                            "verse 89:29": "¡Y entra con Mis siervos,",
                            "verse 89:30": "Entra en Mi Jardín!»"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "விடியற் காலையின் மீது சத்தியமாக,",
                            "verse 89:2": "பத்து இரவுகளின் மீது சத்தியமாக,",
                            "verse 89:3": "இரட்டையின் மீதும், ஒற்றையின் மீதும் சத்தியமாக,",
                            "verse 89:4": "செல்கின்ற இரவின் மீதும், சத்தியமாக,",
                            "verse 89:5": "இதில் அறிவுடையோருக்கு (போதுமான) சத்தியம் இருக்கிறதல்லவா?",
                            "verse 89:6": "உம்முடைய இறைவன் ஆ(து கூட்டத்)தை என்ன செய்தான் என்பதை நீர் பார்க்கவில்லையா?",
                            "verse 89:7": "(அவர்கள்) தூண்களையுடைய 'இரம்' (நகர) வாசிகள்,",
                            "verse 89:8": "அவர்கள் போன்ற ஒரு சமுதாயம் எந்த நாடுகளிலும் படைக்கப்படவில்லை.",
                            "verse 89:9": "பள்ளத்தாக்குகளில் பாறைகளைக் குடைந்(து வசித்து வந்)த ஸமூது கூட்டத்தையும் (என்ன செய்தான் என்று பார்க்கவில்லையா?)",
                            "verse 89:10": "மேலும், பெரும் படைகளைக் கொண்ட ஃபிர்அவ்னையும் (உம் இறைவன் என்ன செய்தான் என்பதை நீர் பார்க்கவில்லையா?)",
                            "verse 89:11": "அவர்களெல்லாம் நாடுகளில் வரம்பு மீறி நடந்தனர்.",
                            "verse 89:12": "அன்றியும், அவற்றில் குழப்பத்தை அதிகப்படுத்தினர்.",
                            "verse 89:13": "எனவே, உம்முடைய இறைவன் அவர்கள் மேல் வேதனையின் சாட்டையை எறிந்தான்.",
                            "verse 89:14": "நிச்சயமாக, உம்முடைய இறைவன் கண்காணித்துக் கொண்டு இருக்கிறன்றான்.",
                            "verse 89:15": "ஆனால், இறைவன் மனிதனுக்கு கண்ணியப்படுத்தி, பாக்கியம் அளித்து அவனைச் சோதிக்கும் போது அவன்; \"என் இறைவன் என்னை கண்ணியப்படுத்தியுள்ளான்\" என்று கூறுகிறான்.",
                            "verse 89:16": "எனினும் அவனுடைய உணவு வசதிகளைக் குறைத்து, அவனை (இறைவன்) சோதித்தாலோ, அவன், \"என் இறைவன் என்னைச் சிறுமைப் படுத்தி விட்டான்\" எனக் கூறுகின்றான்.",
                            "verse 89:17": "அப்படியல்ல! நீங்கள் அநாதையைக் கண்ணியப்படுத்துவது இல்லை.",
                            "verse 89:18": "ஏழைக்கு உணவளிக்குமாறு தூண்டுவதில்லை.",
                            "verse 89:19": "இன்னும் (பிறருடைய) அநந்தரச் சொத்துக்களையும் (சேர்த்து) உண்டு வருகின்றீர்கள்.",
                            "verse 89:20": "இன்னும், பொருளை அளவு கடந்து பிரியத்துடன் நேசிக்கின்றீர்கள்.",
                            "verse 89:21": "அப்படியல்ல! பூமி தூள் தூளாகத் தகர்க்கப்படும் போது,",
                            "verse 89:22": "உம்முடைய இறைவனும், வானவரும் அணியணியாக வரும்போது,",
                            "verse 89:23": "அந்நாளில் நரகம் முன் கொண்டு வரப்படும் போது - அந்நாளில் மனிதன் உணர்வு பெறுவான்; அந்த (நாளில்) உணர்வு (பெறுவதினால்) அவனுக்கு என்ன பலன்.",
                            "verse 89:24": "\"என் (மறுமை) வாழ்க்கைக்காக நன்மையை நான் முற்படுத்தி (அனுப்பி)யிருக்க வேண்டுமே!\" என்று அப்போது மனிதன் கூறுவான்.",
                            "verse 89:25": "ஆனால் அந்நாளில் (அல்லாஹ் செய்யும்) வேதனையைப் போல், வேறு எவனும் வேதனை செய்யமாட்டான்.",
                            "verse 89:26": "மேலும், அவன் கட்டுவது போல் வேறு எவனும் கட்டமாட்டான்.",
                            "verse 89:27": "(ஆனால், அந்நாளில் நல்லடியார்களிடம்) சாந்தியடைந்த ஆத்மாவே!",
                            "verse 89:28": "நீ உன்னுடைய இறைவன்பால் திருப்தி அடைந்த நிலையிலும், (அவன்) உன்மீது திருப்தியடைந்த நிலையிலும் மீளுவாயாக.",
                            "verse 89:29": "நீ என் நல்லடியார்களில் சேர்ந்து கொள்வாயாக.",
                            "verse 89:30": "மேலும், நீ என் சுவர்க்கத்தில் பிரவேசிப்பாயாக (என்று இறைவன் கூறுவான்)."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "ขอสาบานด้วยยามรุ่งอรุณ",
                            "verse 89:2": "และด้วยค่ำคืนทั้งสิบ",
                            "verse 89:3": "และด้วยสิ่งที่เป็น คู่ และที่เป็นคี่",
                            "verse 89:4": "และด้วยเวลากลางคืนเมื่อมันโคจรไป",
                            "verse 89:5": "ในดังกล่าวนั้นเป็นการสาบาน สำหรับผู้ที่มีปัญญามิใช่หรือ?",
                            "verse 89:6": "เจ้าไม่เห็นดอกหรือว่า พระเจ้าของเจ้ากระทำต่อพวกอ๊าดอย่างไร ?",
                            "verse 89:7": "(แห่ง) อิร็อม พวกมีเสาหินสูงตะหง่าน",
                            "verse 89:8": "ซึ่งเยี่ยงนั้นมิได้ถูกสร้างตามหัวเมืองต่าง ๆ",
                            "verse 89:9": "และพวกซะมูดผู้สกัดหิน ณ หุบเขา",
                            "verse 89:10": "และฟิรเอาน์เจ้าแห่งตรึงเสาเต๊นท์",
                            "verse 89:11": "บรรดาผู้ละเมิดเหล่านั้นตามหัวเมืองต่าง ๆ",
                            "verse 89:12": "แล้วก่อความเสียหายอย่างมากมายในหัวเมืองเหล่านั้น",
                            "verse 89:13": "ดังนั้นพระเจ้าของเจ้าจึงกระหน่ำการลงโทษนานาชนิดบนพวกเขา",
                            "verse 89:14": "แท้จริงพระเจ้าของเจ้านั้นทรงเฝ้าดูอย่างแน่นอน",
                            "verse 89:15": "ส่วนมนุษย์นั้น เมื่อพระเจ้าของเขาทรงทดสอบเขา โดยทรงให้เกียรติเขาและทรงโปรดปรานเขา เขาก็จะกล่าวว่าพระเจ้าของฉันทรงยกย่องฉัน",
                            "verse 89:16": "แต่ครั้งเมื่อพระองค์ทรงทดสอบเขาทรงให้การครองชีพของเขาเป็นที่คับแคบแก่เขา เขาก็จะกล่าวว่า พระเจ้าของฉันทรงเหยียดหยามฉัน",
                            "verse 89:17": "มิใช่เช่นนั้นดอก แต่ว่าพวกเจ้ามิได้ให้เกียรติแก่เด็กกำพร้าต่างหาก",
                            "verse 89:18": "และพวกเจ้ามิได้ส่งเสริมกันในการให้อาหารแก่คนยากจนขัดสน",
                            "verse 89:19": "และพวกเจ้ากินมรดกกันอย่างหมดเกลี้ยง",
                            "verse 89:20": "และพวกเจ้ารักสมบัติกันอย่างมากมาย",
                            "verse 89:21": "หามิได้ เมื่อแผ่นดินถูกทำให้สั่นสะเทือนเป็นผุยผง",
                            "verse 89:22": "และพระเจ้าของเจ้าเสด็จมาพร้อมทั้งมลาอิกะฮ์ด้วยเป็นแถว ๆ",
                            "verse 89:23": "และวันนั้นนรกญะฮันนัมจะถูกนำมาให้ปรากฏ ในวันนั้นมนุษย์จะรำลึกขึ้นมาได้ แต่การรำลึกนั้นจะมีผลแก่เขาได้อย่างไร ?",
                            "verse 89:24": "เขาจะกล่าวว่า โอ้ถ้าฉันได้ทำความดีไว้ล่วงหน้าสำหรับชีวิตของฉัน",
                            "verse 89:25": "แล้วในวันนั้นไม่มีผู้ใดลงโทษเช่น การลงโทษของพระองค์",
                            "verse 89:26": "และไม่มีผู้ใดผูกมัด เช่นการผูกมัดของพระองค์",
                            "verse 89:27": "โอ้ชีวิตที่สงบแน่นเอ๋ย",
                            "verse 89:28": "จงกลับมายังพระเจ้าของเจ้าด้วยความยินดีและเป็นที่ปิติเถิด",
                            "verse 89:29": "แล้วจงเข้ามาอยู่ในหมู่ปวงบ่าวของข้าเถิด",
                            "verse 89:30": "และจงเข้ามาอยู่ในสวนสวรรค์ของข้าเถิด"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Andolsun Fecre ,",
                            "verse 89:2": "On",
                            "verse 89:3": "geceye ,",
                            "verse 89:4": "Çifte",
                            "verse 89:5": "ve teke,",
                            "verse 89:6": "(her",
                            "verse 89:7": "şeyi karanlığı ile) örttüğü an geceye",
                            "verse 89:8": "Bunlarda",
                            "verse 89:9": "akıl sahibi için elbette birer yemin (değeri) vardır.",
                            "verse 89:10": "Görmedin mi, Rabbin ne yaptı Âd kavmine?",
                            "verse 89:11": "Direkleri (yüksek binaları) olan, İrem şehrine?",
                            "verse 89:12": "Ki",
                            "verse 89:13": "ülkeler içinde onun benzeri yaratılmamıştı ,",
                            "verse 89:14": "O",
                            "verse 89:15": "vadide kayaları yontan Semûd kavmine?",
                            "verse 89:16": "Kazıklar",
                            "verse 89:17": "(çadırlar, ordular) sahibi Firavun'a?",
                            "verse 89:18": "Ki onların hepsi ülkelerinde azgınlık ettiler.",
                            "verse 89:19": "Oralarda",
                            "verse 89:20": "kötülüğü çoğalttılar.",
                            "verse 89:21": "Bu",
                            "verse 89:22": "yüzden Rabbin onların üstüne azap kamçısı yağdırdı.",
                            "verse 89:23": "Çünkü",
                            "verse 89:24": "Rabbin (her an) gözetlemededir.",
                            "verse 89:25": "İnsan var ya, Rabbi kendisini imtihan edip de ikramda bulunduğunda ve bol nimet verdiğinde \"Rabbim bana ikram etti\" der.",
                            "verse 89:26": "Onu imtihan edip rızkını daralttığında ise \"Rabbim beni önemsemedi\" der.",
                            "verse 89:27": "Hayır! Doğrusu siz yetime ikram etmiyorsunuz,",
                            "verse 89:28": "Yoksulu yedirmeye birbirinizi teşvik etmiyorsunuz,",
                            "verse 89:29": "Haram helâl demeden mirası yiyorsunuz.",
                            "verse 89:30": "Malı aşırı biçimde seviyorsunuz.",
                            "verse 89:31": "Ama yeryüzü parça parça döküldüğü,",
                            "verse 89:32": "Rabbin(in emri) geldiği ve melekler saf saf dizildiği zaman (her şey ortaya çıkacaktır).",
                            "verse 89:33": "O gün cehennem getirilir, insan yaptıklarını birer birer hatırlar.",
                            "verse 89:34": "(İşte o zaman insan:) \"Keşke bu hayatım için bir şeyler yapıp gönderseydim!\" der.",
                            "verse 89:35": "Artık o gün, Allah'ın edeceği azabı kimse edemez.",
                            "verse 89:36": "0'nun vuracağı bağı kimse vuramaz.",
                            "verse 89:37": "Ey huzura kavuşmuş insan!",
                            "verse 89:38": "Sen O'ndan hoşnut, O da senden hoşnut olarak Rabbine dön.",
                            "verse 89:39": "(Seçkin) kullarım arasına katıl,",
                            "verse 89:40": "Ve cennetime gir! l."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "فجر کی قسم",
                            "verse 89:2": "اس صبح کي قَسم (جس سے ظلمتِ شب چھٹ گئي)?o? مراد ہر روز کي صبح يا نمازِ فجر ہے يا بطورِ خاص ماہ ذي الحجہ کي پہلي صبح يا يکم محرم کي صبح ہے يا عيد الاضح?ي کي صبح? اس سے مراد سيدنا محمد مصطفي صلي اللہ عليہ وآلہ وسلم کي ذاتِ گرامي بھي ہے جن کي بعثت سے شبِ ظلمت کا خاتمہ ہوا اور صبحِ ايمان پھوٹي?",
                            "verse 89:3": "اور دس (مبارک) راتوں کي قَسم?o? مراد ماہِ رمضان کے آخري عشرہ کي راتيں يا پہلے عشر? محرّم کي راتيں ہيں يا اوّل عشر? ذي الحجہ کي راتيں ہيں جو برکات و درجات سے معمور ہيں?",
                            "verse 89:4": "اور دس راتوں کی",
                            "verse 89:5": "اور جفت اور طاق کی",
                            "verse 89:6": "اور جفت کي قَسم اور طاق کي قَسم?o? جفت (جوڑا) سے مراد کل مخلوق ہے جو جوڑوں کي صورت ميں پيدا کي گئي ہے، اور طاق (فرد و تنہا) سے مراد خالق ہے جو وحدہ لا شريک ہے? يا شَفع يومِ نحر (قرباني) اور وَتر يومِ عرفہ (حج) ہے، يا شَفع سے مراد دنيا کے شب و روز ہيں اور وَتر سے مراد يومِ قيامت ہے جس کي کوئي شب نہ ہوگي? يا شَفع سے مراد سال بھر کي عام جفت راتيں ہيں اور وَتر سے مراد سال بھر کي برکت والي طاق راتيں ہيں، مثلاً شبِ معراج، شبِ برات اور شبِ قدر وغيرہ جو پے در پے رجب، شعبان اور رمضان ميں آتي ہيں? يا شَفع سے مراد حضرت آدم عليہ السلام اور حضرت حواء عليہا السلام کا پہلا جوڑا ہے اور وَتر سے مراد تنہا حضرت آدم عليہ السلام، جن سے تخليقِ انسانيت کي ابتداء ہوئي?",
                            "verse 89:7": "اور رات کي قسم جب گزر چلے (مراد ہر شب ہے يا بطورِ خاص شبِ مزدلفہ يا شبِ قدر)o",
                            "verse 89:8": "اور رات کی جب جانے لگے",
                            "verse 89:9": "اور بے شک یہ چیزیں عقلمندوں کے نزدیک قسم کھانے کے لائق ہیں کہ (کافروں کو ضرور عذاب ہو گا)",
                            "verse 89:10": "بيشک ان ميں عقل مند کے لئے بڑي قسم ہےo",
                            "verse 89:11": "کيا آپ نے نہيں ديکھا کہ آپ کے رب نے (قومِ) عاد کے ساتھ کيسا (سلوک) کيا؟o",
                            "verse 89:12": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے عاد کے ساتھ کیا کیا",
                            "verse 89:13": "(جو) ارم (کہلاتے تھے اتنے) دراز قد",
                            "verse 89:14": "(جو اہلِ) اِرم تھے (اور) بڑے بڑے ستونوں (کي طرح دراز قد اور اونچے محلات) والے تھےo",
                            "verse 89:15": "جن کا مثل (دنيا کے) ملکوں ميں (کوئي بھي) پيدا نہيں کيا گياo",
                            "verse 89:16": "کہ تمام ملک میں ایسے پیدا نہیں ہوئے تھے",
                            "verse 89:17": "اور ثمود کے ساتھ (کیا کیا) جو وادئِ (قریٰ) میں پتھر تراشتے تھے (اور گھر بناتے) تھے",
                            "verse 89:18": "اور ثمود (کے ساتھ کيا سلوک ہوا) جنہوں نے وادئ (قري) ميں چٹانوں کو کاٹ (کر پتھروں سے سينکڑوں شہروں کو تعمير کر) ڈالا تھاo",
                            "verse 89:19": "اور فرعون (کا کيا حشر ہوا) جو بڑے لشکروں والا (يا لوگوں کو ميخوں سے سزا دينے والا) تھاo",
                            "verse 89:20": "اور فرعون کے ساتھ (کیا کیا) جو خیمے اور میخیں رکھتا تھا",
                            "verse 89:21": "یہ لوگ ملکوں میں سرکش ہو رہے تھے",
                            "verse 89:22": "(يہ) وہ لوگ (تھے) جنہوں نے (اپنے اپنے) ملکوں ميں سرکشي کي تھيo",
                            "verse 89:23": "پھر ان ميں بڑي فساد انگيزي کي تھيo",
                            "verse 89:24": "اور ان میں بہت سی خرابیاں کرتے تھے",
                            "verse 89:25": "تو تمہارے پروردگار نے ان پر عذاب کا کوڑا نازل کیا",
                            "verse 89:26": "تو آپ کے رب نے ان پر عذاب کا کوڑا برساياo",
                            "verse 89:27": "بيشک آپ کا رب (سرکشوں اور نافرمانوں کي) خوب تاک ميں ہےo",
                            "verse 89:28": "بے شک تمہارا پروردگار تاک میں ہے",
                            "verse 89:29": "مگر انسان (عجیب مخلوق ہے کہ) جب اس کا پروردگار اس کو آزماتا ہے تو اسے عزت دیتا اور نعمت بخشتا ہے۔ تو کہتا ہے کہ (آہا) میرے پروردگار نے مجھے عزت بخشی",
                            "verse 89:30": "مگر انسان (ايسا ہے) کہ جب اس کا رب اسے (راحت و آسائش دے کر) آزماتا ہے اور اسے عزت سے نوازتا ہے اور اسے نعمتيں بخشتا ہے تو وہ کہتا ہے: ميرے رب نے مجھ پر کرم فرماياo",
                            "verse 89:31": "ليکن جب وہ اسے (تکليف و مصيبت دے کر) آزماتا ہے اور اس پر اس کا رزق تنگ کرتا ہے تو وہ کہتا ہے: ميرے رب نے مجھے ذليل کر دياo",
                            "verse 89:32": "اور جب (دوسری طرح) آزماتا ہے کہ اس پر روزی تنگ کر دیتا ہے تو کہتا ہے کہ (ہائے) میرے پروردگار نے مجھے ذلیل کیا",
                            "verse 89:33": "نہیں بلکہ تم لوگ یتیم کی خاطر نہیں کرتے",
                            "verse 89:34": "يہ بات نہيں بلکہ (حقيقت يہ ہے کہ عزت اور مال و دولت کے ملنے پر) تم يتيموں کي قدر و اِکرام نہيں کرتےo",
                            "verse 89:35": "اور نہ ہي تم مسکينوں (يعني غريبوں اور محتاجوں) کو کھانا کھلانے کي (معاشرے ميں) ايک دوسرے کو ترغيب ديتے ہوo",
                            "verse 89:36": "اور نہ مسکین کو کھانا کھلانے کی ترغیب دیتے ہو",
                            "verse 89:37": "اور میراث کے مال سمیٹ کر کھا جاتے ہو",
                            "verse 89:38": "اور وراثت کا سارا مال سميٹ کر (خود ہي) کھا جاتے ہو (اس ميں سے افلاس زدہ لوگوں کا حق نہيں نکالتے)o",
                            "verse 89:39": "اور تم مال و دولت سے حد درجہ محبت رکھتے ہوo",
                            "verse 89:40": "اور مال کو بہت ہی عزیز رکھتے ہو",
                            "verse 89:41": "تو جب زمین کی بلندی کوٹ کوٹ کو پست کر دی جائے گی",
                            "verse 89:42": "يقيناً جب زمين پاش پاش کر کے ريزہ ريزہ کر دي جائے گيo",
                            "verse 89:43": "اور آپ کا رب جلوہ فرما ہوگا اور فرشتے قطار در قطار (اس کے حضور) حاضر ہوں گےo",
                            "verse 89:44": "اور تمہارا پروردگار (جلوہ فرما ہو گا) اور فرشتے قطار باندھ باندھ کر آ موجود ہوں گے",
                            "verse 89:45": "اور دوزخ اس دن حاضر کی جائے گی تو انسان اس دن متنبہ ہو گا مگر تنبہ (سے) اسے (فائدہ) کہاں (مل سکے گا)",
                            "verse 89:46": "اور اس دن دوزخ پيش کي جائے گي، اس دن انسان کو سمجھ آجائے گي مگر (اب) اسے نصيحت کہاں (فائدہ مند) ہوگيo",
                            "verse 89:47": "وہ کہے گا: اے کاش! ميں نے اپني (اس اصل) زندگي کے لئے (کچھ) آگے بھيج ديا ہوتا (جو آج ميرے کام آتا)o",
                            "verse 89:48": "کہے گا کاش میں نے اپنی زندگی (جاودانی کے لیے) کچھ آگے بھیجا ہوتا",
                            "verse 89:49": "تو اس دن نہ کوئی خدا کے عذاب کی طرح کا (کسی کو) عذاب دے گا",
                            "verse 89:50": "سو اس دن نہ اس کے عذاب کي طرح کوئي عذاب دے سکے گاo",
                            "verse 89:51": "اور نہ اس کے جکڑنے کي طرح کوئي جکڑ سکے گاo",
                            "verse 89:52": "اور نہ کوئی ویسا جکڑنا جکڑے گا",
                            "verse 89:53": "اے اطمینان پانے والی روح!",
                            "verse 89:54": "اے اطمينان پا جانے والے نفسo",
                            "verse 89:55": "تو اپنے رب کي طرف اس حال ميں لوٹ آکہ تو اس کي رضا کا طالب بھي ہو اور اس کي رضا کا مطلوب بھي (گويا اس کي رضا تيري مطلوب ہو اور تيري رضا اس کي مطلوب)o",
                            "verse 89:56": "اپنے پروردگار کی طرف لوٹ چل۔ تو اس سے راضی وہ تجھ سے راضی",
                            "verse 89:57": "تو میرے (ممتاز) بندوں میں شامل ہو جا",
                            "verse 89:58": "پس تو ميرے (کامل) بندوں ميں شامل ہو جاo",
                            "verse 89:59": "اور ميري جنتِ (قربت و ديدار) ميں داخل ہو جاo",
                            "verse 89:60": "اور میری بہشت میں داخل ہو جا جاo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 89:1": "Фажр билан қасам.",
                            "verse 89:2": "Ва ўн кеча билан қасам.",
                            "verse 89:3": "Жуфту тоқ билан қасам.",
                            "verse 89:4": "Ва юрилган тун билан қасам.",
                            "verse 89:5": "Мана шуларда ақл эгаси учун (қаноатлантирувчи) қасам бордир?!",
                            "verse 89:6": "Сен Роббинг Одга қандай (муомала) қилганинни билмадингми?",
                            "verse 89:7": "Баланд устунли «Ирам»га.",
                            "verse 89:8": "Унинг мисли бошқа диёрларда халқ қилинмаганга.",
                            "verse 89:9": "Ва водийда харсанг тошларни кесган Самудга.",
                            "verse 89:10": "Ва кўп аскарлари бор Фиръавнга.",
                            "verse 89:11": "Улар турли ўлкаларда туғёнга кетган эдилар.",
                            "verse 89:12": "Улар у(ўлка)ларда бузғунчиликни кўпайтирдилар.",
                            "verse 89:13": "Бас, Роббинг уларнинг бошига турли азобларни қуйди.",
                            "verse 89:14": "Албатта, Роббинг кузатиб турувчидир.",
                            "verse 89:15": "Бас, қачон инсонни Роббиси синаш учун икром қилса ва неъмат берса: «Мени Роббим икром қилди», дейдир.",
                            "verse 89:16": "Бас, қачон Роббиси синаш учун ризқини тор қилиб қўйса: «Роббим мени хорлади», дейдир.",
                            "verse 89:17": "Йўқ! Балки Сизлар етимларни икром қилмассизлар.",
                            "verse 89:18": "Бир-бирингизни мискинларга таом беришга ундамассизлар.",
                            "verse 89:19": "Ва меросни шиддатла ейсизлар.",
                            "verse 89:20": "Ва молни кўп яхши кўрасизлар.",
                            "verse 89:21": "Йўқ! Вақтики, ер зилзилага тушиб парча-парча бўлиб кетса.",
                            "verse 89:22": "Ва Роббинг ва фаришталар саф-саф бўлиб келса.",
                            "verse 89:23": "Ва ўша кунда жаҳаннамни келтирилса, ўша кунда инсон эслайдир.",
                            "verse 89:24": "У, афсуски, (охират) ҳаётимга ҳам бирор нарса тақдим қилсам бўлар экан, дейдир.",
                            "verse 89:25": "Бас, ўша кунда Аллоҳнинг азобига ўхшаш азобла ҳеч ким азобламас.",
                            "verse 89:26": "Ва Унинг боғлашига ўхшаш ҳеч ким боғламас.",
                            "verse 89:27": "Эй хотиржам нафс!",
                            "verse 89:28": "Роббингга сен Ундан, У сендан рози бўлган ҳолингда қайт!",
                            "verse 89:29": "Бас, бандаларим ичига киргин!",
                            "verse 89:30": "Ва жаннатимга киргин! киргин!"
                        }
                    }
                }
            }
        }
    }
}