{
    "id": 90,
    "name_simple": "Al-Balad",
    "revelation_place": "makkah",
    "revelation_order": 35,
    "bismillah_pre": true,
    "verses_count": 20,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah has been so named after the word al balad in the first verse.",
    "text": [
        "\n",
        "The Surah has been so named after the word al balad in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its subject matter and style resemble those of the earliest Surahs revealed at Makkah, but it contains a pointer which indicates that it was sent down in the period when the disbelievers of Makkah had resolved to oppose the Holy Prophet (upon whom be Allah's peace), and made it lawful for themselves to commit tyranny and excess against him.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In this Surah a vast subject has been compressed into a few brief sentences, and it is a miracle of the Quran that a complete ideology of life which could hardly be explained in a thick volume has been abridged most effectively in brief sentences of this short Surah. Its theme is to explain the true position of man in the world and of the world in relation to man and to tell that God has shown to man both the highways of good and evil, has also provided for him the means to judge and see and follow them, and now it rests upon mans own effort and judgment whether he chooses the path of virtue and reaches felicity or adopts the path of vice and meets with doom.",
        "\n",
        "First, the city of Makkah and the hardships being faced therein by the Holy Prophet (upon whom be peace) and the state of the children of Adam have been cited as a witness to the truth that this world is not a place of rest and ease for man, where he might have been born to enjoy life, but here he has been created into toil and struggle. If this theme is read with verse 39 of Surah An-Najm (Laisa lil insani illa ma saa : there is nothing for man but what he has striven for), it becomes plain that in this world the future of man depends on his toil and struggle, effort and striving.",
        "\n",
        "After this, man's misunderstanding that he is all in all in this world and that there is no superior power to watch what he does and to call him to account, has been refuted.",
        "\n",
        "Then, taking one of the many moral concepts of ignorance held by man, as an example, it has been pointed out what wrong criteria of merit and greatness he has proposed for himself in the world. The person who for ostentation and display squanders heaps of wealth, not only himself prides upon his extravagances but the people also admire him for it enthusiastically, whereas the Being Who is watching over his deeds, sees by what methods he obtained the wealth and in what ways and with what motives and intention he spent it.",
        "\n",
        "Then Allah says: We have given man the means of knowledge and the faculties of thinking and understanding and opened up before him both the highways of virtue and vice: one way leads down to moral depravity, and it is an easy way pleasing for the self; the other way leads up to moral heights, which is steep like an uphill road, for scaling which man has to exercise self- restraint. It is man's weakness that he prefers slipping down into the abyss to scaling the cliff.",
        "\n",
        "Then, Allah has explained what the steep road is by following which man can ascend to the heights. It is that he should give up spending for ostentation, display and pride and should spend his wealth to help the orphans and the needy, should believe in Allah and His Religion and joining the company of believers should participate in the construction of a society which should fulfill the demands of virtue and righteousness patiently and should be compassionate to the people. The end of those who follow this way is that they would become worthy of Allah's mercies. On the contrary, the end of those who follow the wrong way, is the fire of Hell from which there is no escape.",
        "\n"
    ],
    "description": "The surah that opens with the emphatic oath of the Divine One swearing by The City, that mankind us under the absolute power and watchfulness of God. It takes its name after the “city” or “town” (balad) mentioned in verse 1. The essential point of this surah is that man is created to work and be judged. He should therefore seek to do good deeds rather than indulge in arrogance and wastefulness.The surah is also known as: (This) Countryside, The Earth, The Land, The Town.",
    "name_translation": "THE CITY",
    "name_complex": "Al-Balad",
    "surah_name_ar": "البلد",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 90:1": "Betohem në këtë qytet,",
                            "verse 90:2": "pasi në të, ti je i lirë (o Muhammed), -",
                            "verse 90:3": "dhe (betohem) në ata që kanë lindur dhe lindën,",
                            "verse 90:4": "Na, e krijuam njeriun që të luftojë në vështirësi (për të dy jetërat).",
                            "verse 90:5": "A mendon ai se askush nuk mund t’i bëjë gjë?",
                            "verse 90:6": "Ai thotë: “Kam shpenzuar pasuri të pamasë!”",
                            "verse 90:7": "Vallë, a mendon ai, se, nuk e ka parë askush?",
                            "verse 90:8": "A nuk ia kemi dhënë dy sytë,",
                            "verse 90:9": "edhe gjuhën edhe dy buzët,",
                            "verse 90:10": "dhe të mirën e të keqen ia kemi shpjeguar?",
                            "verse 90:11": "E, përse nuk është përpjekur të kapërcejë vështirësitë?",
                            "verse 90:12": "E kush mund të shpjegojë ç’është vështirësia (për të punuar vepra të mira)?",
                            "verse 90:13": "me liruar skllavin (nga skllavëria),",
                            "verse 90:14": "ose me ushqyer, kur bredh uria (të urët)",
                            "verse 90:15": "bonjakun e afërm",
                            "verse 90:16": "ose të varfërin e mjerë,",
                            "verse 90:17": "e pos këtyre, të jetë nga ata që besojnë, të cilët njëri-tjetri i japin kurajo për durim dhe kurajo për mëshirë;",
                            "verse 90:18": "ët gjithë këta, do të jenë të lumtur!",
                            "verse 90:19": "E, ata që nuk besojnë në argumentet Tona, ata do të jenë fatzinj,",
                            "verse 90:20": "ata do të jenë në zjarrin e mbyllur."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "And içirəm bu şəhərə (Məkkəyə) -",
                            "verse 90:2": "Sənin yaşadığın (sənə halal olan) şəhərə;",
                            "verse 90:3": "And içirəm ataya və onun övladına (Adəmə və onun nəslinə, yaxud İbrahimə və oğlu İsmailə) ki,",
                            "verse 90:4": "Biz insanı məşəqqətdə yaratdıq! (İnsan doğulduğu gündən qəbir evinə gedənə qədər əzab-əziyyət içində çalışıb çabalayır, həyat boyu müxtəlif çətinliklərlə üzləşər.",
                            "verse 90:5": "Məgər insan (Vəlid bin əl-Müğirə) heç kəsin ona gücü çatmayacağını zənn edir?",
                            "verse 90:6": "Və: Mən (Peyğəmbərlə düşmənçilik yolunda) xeyli mal-dövlət sərf etmişəm!\" - deyir?",
                            "verse 90:7": "Məgər o heç kəsin onu görmədiyini güman edir?!",
                            "verse 90:8": "Məgər Biz ona iki göz vermədikmi?!",
                            "verse 90:9": "Eləcə də bir dil və qoşa dodaq (vermədikmi)?!",
                            "verse 90:10": "Biz ona iki yol (xeyir və şər, küfr və iman yollarını) göstərmədikmi?!",
                            "verse 90:11": "Lakin o, əqəbəni (maneəni) keçə bilmədi (özünə verilən bu qədər ne'mətlərə şükür etmədi).",
                            "verse 90:12": "(Ya Peyğəmbər!) Sən nə bilirsən (haradan bilirsən) ki, əqəbə nədir?!",
                            "verse 90:13": "(O) bir kölə azad etməkdir;",
                            "verse 90:14": "Yaxud aclıq günü (zamanı) yemək verməkdir -",
                            "verse 90:15": "Qohumluq əlaqəsi çatan bir yetimə.",
                            "verse 90:16": "Və ya (taqətsizlikdən) torpağa sərilmiş bir miskinə!",
                            "verse 90:17": "Sonra da iman gətirən və bir-birinə səbr tövsiyə edən, mərhəmət tövsiyə edən kimsələrdən olmaqdır!",
                            "verse 90:18": "Onlar sağ tərəf sahibləridir! (Əməl dəftərləri sağ əllərinə verilənlərdir!)",
                            "verse 90:19": "Ayələrimzi inkar edənlər isə sol tərəf sahibləridir! (Əməl dəftərləri sol əllərinə verilənlərdir!)",
                            "verse 90:20": "Onları hər tərəfi qapalı Cəhənnəm gözləyir! (Kafirlər Cəhənnəmdə həmişəlik qalar, oradan heç yerə çıxa bilməzlər!)"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Kunem se gradom ovim,",
                            "verse 90:2": "a tebi će biti dopušteno sve u gradu ovome,",
                            "verse 90:3": "i roditeljem i onim koga je rodio,",
                            "verse 90:4": "Mi čovjeka stvaramo da se trudi.",
                            "verse 90:5": "Misli li on da mu niko ništa ne može?",
                            "verse 90:6": "Utrošio sam blago nebrojeno! - reći će.",
                            "verse 90:7": "Zar misli da ga niko vidio nije?",
                            "verse 90:8": "Zar mu nismo dali oka dva",
                            "verse 90:9": "i jezik i usne dvije,",
                            "verse 90:10": "i dobro i zlo mu objasnili?",
                            "verse 90:11": "Pa, zašto on na blagodatima zahvalan bio nije? -",
                            "verse 90:12": "A šta ti misliš: kako se može na blagodatima zahvalan biti? -",
                            "verse 90:13": "roba ropstva osloboditi,",
                            "verse 90:14": "ili, kad glad hara, nahraniti",
                            "verse 90:15": "siroče bliska roda,",
                            "verse 90:16": "ili ubogoga nevoljnika,",
                            "verse 90:17": "a uz to da je od onih koji vjeruju, koji jedni drugima izdržljivost preporučuju i koji jedni drugima milosrđe preporučuju;",
                            "verse 90:18": "oni će biti - sretnici!",
                            "verse 90:19": "A oni koji ne vjeruju u dokaze Naše, oni će biti - nesretnici,",
                            "verse 90:20": "iznad njih će vatra zatvorena biti."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "আমি এই নগরীর শপথ করি",
                            "verse 90:2": "এবং এই নগরীতে আপনার উপর কোন প্রতিবন্ধকতা নেই।",
                            "verse 90:3": "শপথ জনকের ও যা জন্ম দেয়।",
                            "verse 90:4": "নিশ্চয় আমি মানুষকে শ্রমনির্ভররূপে সৃষ্টি করেছি।",
                            "verse 90:5": "সে কি মনে করে যে, তার উপর কেউ ক্ষমতাবান হবে না ?",
                            "verse 90:6": "সে বলেঃ আমি প্রচুর ধন-সম্পদ ব্যয় করেছি।",
                            "verse 90:7": "সে কি মনে করে যে, তাকে কেউ দেখেনি?",
                            "verse 90:8": "আমি কি তাকে দেইনি চক্ষুদ্বয়,",
                            "verse 90:9": "জিহবা ও ওষ্ঠদ্বয় ?",
                            "verse 90:10": "বস্তুতঃ আমি তাকে দু’টি পথ প্রদর্শন করেছি।",
                            "verse 90:11": "অতঃপর সে ধর্মের ঘাঁটিতে প্রবেশ করেনি।",
                            "verse 90:12": "আপনি জানেন, সে ঘাঁটি কি?",
                            "verse 90:13": "তা হচ্ছে দাসমুক্তি",
                            "verse 90:14": "অথবা দুর্ভিক্ষের দিনে অন্নদান।",
                            "verse 90:15": "এতীম আত্বীয়কে",
                            "verse 90:16": "অথবা ধুলি-ধুসরিত মিসকীনকে",
                            "verse 90:17": "অতঃপর তাদের অন্তর্ভুক্ত হওয়া, যারা ঈমান আনে এবং পরস্পরকে উপদেশ দেয় সবরের ও উপদেশ দেয় দয়ার।",
                            "verse 90:18": "তারাই সৌভাগ্যশালী।",
                            "verse 90:19": "আর যারা আমার আয়াতসমূহ অস্বীকার করে তারাই হতভাগা।",
                            "verse 90:20": "তারা অগ্নিপরিবেষ্টিত অবস্থায় বন্দী থাকবে। হতভাগা।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 90:1": "Не! Кълна се в този град",
                            "verse 90:2": "-",
                            "verse 90:3": "на теб [о, Мухаммад] този град ти беше позволен, -",
                            "verse 90:4": "и в родителя ,",
                            "verse 90:5": "и в неговото потомство!",
                            "verse 90:6": "Ние сътворихме човека в трудности.",
                            "verse 90:7": "Нима смята, че никой не ще го надмогне?",
                            "verse 90:8": "Казва: Пропилях огромно богатство.",
                            "verse 90:9": "Нима смята, че никой не го е видял?",
                            "verse 90:10": "Не му ли дадохме Ние две очи",
                            "verse 90:11": "и език, и устни,",
                            "verse 90:12": "и му посочихме двата пътя,",
                            "verse 90:13": "ала той не пое стръмния път.",
                            "verse 90:14": "Но откъде да знаеш ти какво е стръмният път?",
                            "verse 90:15": "Да се освободи роб",
                            "verse 90:16": "или да се даде храна в ден на глад",
                            "verse 90:17": "на сирак - роднина",
                            "verse 90:18": "или на окаян клетник.",
                            "verse 90:19": "И е от онези, които вярват и взаимно се наставляват за търпение, и взаимно се наставляват за състрадание.",
                            "verse 90:20": "Тези са хората на десницата.",
                            "verse 90:21": "А които отхвърлят Нашите знамения, те са хората на левицата.",
                            "verse 90:22": "Ще бъдат затворени в Огъня."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "我以這個地方盟誓——",
                            "verse 90:2": "你將在那裡，不受羈束——",
                            "verse 90:3": "我以一個父親和他所生的子孫盟誓，",
                            "verse 90:4": "我確已把人創造在苦難裡。",
                            "verse 90:5": "他以為任何人都不能制裁他嗎？",
                            "verse 90:6": "他說：「我花費了許多財產！」",
                            "verse 90:7": "他以為任何人都沒有看見他嗎？",
                            "verse 90:8": "難道我沒有為他創造兩隻眼睛、",
                            "verse 90:9": "一條舌頭、兩片嘴唇，",
                            "verse 90:10": "並指示他兩條明顯的道路嗎？",
                            "verse 90:11": "他怎麼不超越山徑呢？",
                            "verse 90:12": "你怎能知道超越山徑是什麼事？",
                            "verse 90:13": "是釋放奴隸，",
                            "verse 90:14": "或在饑荒日賑濟",
                            "verse 90:15": "親戚的孤兒，",
                            "verse 90:16": "或困窮的貧民；",
                            "verse 90:17": "同時，他是一個信道而且行善，並以堅忍相勉，以慈憫相助者。",
                            "verse 90:18": "這等人是幸福的。",
                            "verse 90:19": "不信我的跡象者，是薄命的，",
                            "verse 90:20": "他們將被關在火獄裡。 不信我的跡象者，是薄命的，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Hle, přísahám při tomto městě",
                            "verse 90:2": "- ty volně si žiješ v tomto městě -",
                            "verse 90:3": "při otci a tom, co zplodil,",
                            "verse 90:4": "že člověka jsme věru ke strastem stvořili!",
                            "verse 90:5": "Počítá snad, že nikdo proti němu nic nezmůže,",
                            "verse 90:6": "když říká: \"Bohatství obrovské jsem strávil.",
                            "verse 90:7": "Domnívá se snad, že nikdo jej nespatřil?",
                            "verse 90:8": "Což dvě oči jsme mu nedali",
                            "verse 90:9": "a jazyk a dva rty",
                            "verse 90:10": "a na dvě stezky jsme jej neuvedli?",
                            "verse 90:11": "A přece se nepustil po stezce vzhůru vedoucí.",
                            "verse 90:12": "Víš ty vůbec, co je to stezka vzhůru vedoucí?",
                            "verse 90:13": "Otroka propuštění",
                            "verse 90:14": "či v den hladu nakrmení",
                            "verse 90:15": "sirotka příbuzného",
                            "verse 90:16": "či chudáka nouzí trpícího,",
                            "verse 90:17": "a také být z těch, kdož uvěřili a k neochvějnosti a soucitu se vzájemně nabádají:",
                            "verse 90:18": "to budou lidé po pravici stojící,",
                            "verse 90:19": "zatímco ti, co ve znamení naše nevěřili, to budou lidé po levici stojící",
                            "verse 90:20": "a nad nimi plát bude oheň uzavírající! stojící"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Ik zweer bij deze stad (Mekka),",
                            "verse 90:2": "En gij zijt vogelvrij in deze stad.",
                            "verse 90:3": "En bij de vader en wat hij verwekte.",
                            "verse 90:4": "Voorwaar, Wij hebben de mens geschapen om moeilijkheden (te overwinnen).",
                            "verse 90:5": "Denkt hij dat niemand macht over hem heeft?",
                            "verse 90:6": "Hij zegt: \"Ik heb veel rijkdommen verkwist.",
                            "verse 90:7": "Denkt hij dat niemand hem ziet?",
                            "verse 90:8": "Hebben Wij hem niet twee ogen gegeven?",
                            "verse 90:9": "En een tong en twee lippen?",
                            "verse 90:10": "Hebben Wij hem dan niet de twee hoofdwegen getoond?",
                            "verse 90:11": "Maar hij besteeg de heuvel niet.",
                            "verse 90:12": "En wat weet gij (er van) wat de heuvel is?",
                            "verse 90:13": "Een slaaf te bevrijden",
                            "verse 90:14": "Of, op de dag van honger iemand te voeden",
                            "verse 90:15": "Of een wees die u verwant is.",
                            "verse 90:16": "Of een arme die in het stof rolt.",
                            "verse 90:17": "Bovendien behoort hij (die dit doet) tot hen, die geloven en elkander aansporen tot geduld en die elkander aansporen tot barmhartigheid.",
                            "verse 90:18": "Dezen zullen aan de rechter hand zijn.",
                            "verse 90:19": "Maar zij, die niet in Onze tekenen geloven zullen aan de linker hand zijn.",
                            "verse 90:20": "Een gesloten Vuur zal hen omringen."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 90:1": "Nay, I swear by this city -",
                            "verse 90:2": "And thou art an indweller of this city -",
                            "verse 90:3": "And the begetter and that which he begat,",
                            "verse 90:4": "We verily have created man in an atmosphere:",
                            "verse 90:5": "Thinketh he that none hath power over him ?",
                            "verse 90:6": "And he saith: I have destroyed vast wealth:",
                            "verse 90:7": "Thinketh he that none beholdeth him ?",
                            "verse 90:8": "Did We not assign unto him two eyes",
                            "verse 90:9": "And a tongue and two lips,",
                            "verse 90:10": "And guide him to the parting of the mountain ways ?",
                            "verse 90:11": "But he hath not attempted the Ascent -",
                            "verse 90:12": "Ah, what will convey unto thee what the Ascent is! -",
                            "verse 90:13": "(It is) to free a slave,",
                            "verse 90:14": "And to feed in the day of hunger.",
                            "verse 90:15": "An orphan near of kin,",
                            "verse 90:16": "Or some poor wretch in misery,",
                            "verse 90:17": "And to be of those who believe and exhort one another to perseverance and exhort one another to pity.",
                            "verse 90:18": "Their place will be on the right hand.",
                            "verse 90:19": "But those who disbelieve Our revelations, their place will be on the left hand.",
                            "verse 90:20": "Fire will be an awning over them."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 90:1": "I do call to witness this City;-",
                            "verse 90:2": "And thou art a freeman of this City;-",
                            "verse 90:3": "And (the mystic ties of) parent and child;-",
                            "verse 90:4": "Verily We have created man into toil and struggle.",
                            "verse 90:5": "Thinketh he, that none hath power over him?",
                            "verse 90:6": "He may say (boastfully); Wealth have I squandered in abundance!",
                            "verse 90:7": "Thinketh he that none beholdeth him?",
                            "verse 90:8": "Have We not made for him a pair of eyes?-",
                            "verse 90:9": "And a tongue, and a pair of lips?-",
                            "verse 90:10": "And shown him the two highways?",
                            "verse 90:11": "But he hath made no haste on the path that is steep.",
                            "verse 90:12": "And what will explain to thee the path that is steep?-",
                            "verse 90:13": "(It is:) freeing the bondman;",
                            "verse 90:14": "Or the giving of food in a day of privation",
                            "verse 90:15": "To the orphan with claims of relationship,",
                            "verse 90:16": "Or to the indigent (down) in the dust.",
                            "verse 90:17": "Then will he be of those who believe, and enjoin patience, (constancy, and self-restraint), and enjoin deeds of kindness and compassion.",
                            "verse 90:18": "Such are the Companions of the Right Hand.",
                            "verse 90:19": "But those who reject Our Signs, they are the (unhappy) Companions of the Left Hand.",
                            "verse 90:20": "On them will be Fire vaulted over (all round)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 90:1": "No! I swear by this land,",
                            "verse 90:2": "and thou art a lodger in this land;",
                            "verse 90:3": "by the begetter, and that he begot,",
                            "verse 90:4": "indeed, We created man in trouble.",
                            "verse 90:5": "What, does he think none has power over him,",
                            "verse 90:6": "saying, ’I have consumed wealth abundant’?",
                            "verse 90:7": "What, does he think none has seen him?",
                            "verse 90:8": "Have We not appointed to him two eyes,",
                            "verse 90:9": "and a tongue, and two lips,",
                            "verse 90:10": "and guided him on the two highways?",
                            "verse 90:11": "Yet he has not assaulted the steep;",
                            "verse 90:12": "and what shall teach thee what is the steep?",
                            "verse 90:13": "The freeing of a slave,",
                            "verse 90:14": "or giving food upon a day of hunger",
                            "verse 90:15": "to an orphan near of kin",
                            "verse 90:16": "or a needy man in misery;",
                            "verse 90:17": "then that he become of those who believe and counsel each other to be steadfast, and counsel each other to be merciful.",
                            "verse 90:18": "Those are the Companions of the Right Hand.",
                            "verse 90:19": "And those who disbelieve in Our signs, they are the Companions of the Left Hand;",
                            "verse 90:20": "over them is a Fire covered down."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 90:1": "NAY! I call to witness this land –",
                            "verse 90:2": "this land in which thou art free to dwell –",
                            "verse 90:3": "and [I call to witness] parent and offspring:",
                            "verse 90:4": "Verily, We have created man into [a life of] pain, toil, and trial.",
                            "verse 90:5": "Does he, then, think that no one has power over him?",
                            "verse 90:6": "He boasts, \"I have spent wealth abundant!\"",
                            "verse 90:7": "Does he, then, think that no one sees him?",
                            "verse 90:8": "Have We not given him two eyes,",
                            "verse 90:9": "and a tongue, and a pair of lips,",
                            "verse 90:10": "and shown him the two highways [of good and evil]?",
                            "verse 90:11": "But he would not try to ascend the steep uphill road.",
                            "verse 90:12": "And what could make thee conceive what it is, that steep uphill road?",
                            "verse 90:13": "[It is] the freeing of one’s neck [from the burden of sin],",
                            "verse 90:14": "or the feeding, upon a day of [one’s own] hunger,",
                            "verse 90:15": "of an orphan near of kin,",
                            "verse 90:16": "or of a needy",
                            "verse 90:17": "lying in the dust –",
                            "verse 90:18": "and being, withal, of those who have attained to faith, and who enjoin upon one another patience in adversity, and enjoin upon one another compassion.",
                            "verse 90:19": "Such are they that have attained to righteousness;",
                            "verse 90:20": "whereas those who are bent on denying the truth of Our messages – they are such as have lost themselves in evil,",
                            "verse 90:21": "",
                            "verse 90:22": "fire closing in upon them.",
                            "verse 90:23": "hearts” and “closing in upon them”: cf."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 90:1": "I swear by this city,",
                            "verse 90:2": "-and (O Prophet,) you are going to be allowed (to fight) in this city-",
                            "verse 90:3": "and by the father and all those he begot,",
                            "verse 90:4": "indeed We have created man (to live) in hard struggle.",
                            "verse 90:5": "Does he think that no one has power over him?",
                            "verse 90:6": "He says, “I have spent a lot of wealth.",
                            "verse 90:7": "Does he think that no one has seen him?",
                            "verse 90:8": "Did We not make for him two eyes,",
                            "verse 90:9": "and one tongue and two lips,",
                            "verse 90:10": "and showed him the two ways?",
                            "verse 90:11": "Yet he did not make his way through the steep course,- -",
                            "verse 90:12": "- And what may let you know what the steep course is?",
                            "verse 90:13": "(It is) freeing of the neck of a slave,",
                            "verse 90:14": "or giving food in a day of hunger",
                            "verse 90:15": "to an orphan near of kin,",
                            "verse 90:16": "or to a needy person lying in dust- -",
                            "verse 90:17": "- then he did not join those who believe and advise each other to be patient and advise each other to be merciful.",
                            "verse 90:18": "Those are the People of the Right Hand.",
                            "verse 90:19": "As for those who reject Our verses, they are the People of the Left Hand.",
                            "verse 90:20": "Upon them will be the Fire, enveloping them with closed exits."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 90:1": "I swear by this land,",
                            "verse 90:2": "and you have free disposal of this land.",
                            "verse 90:3": "And",
                            "verse 90:4": "the begetter and that which he begat.",
                            "verse 90:5": "We certainly created man in travail.",
                            "verse 90:6": "Does he suppose that no one will have power over him?",
                            "verse 90:7": "He says, ‘I have exhausted vast wealth!’",
                            "verse 90:8": "Does he suppose that no one has seen him?",
                            "verse 90:9": "Have We not given him two eyes,",
                            "verse 90:10": "and a tongue, and two lips,",
                            "verse 90:11": "and guided him to the two paths?",
                            "verse 90:12": "Yet why does he not assault the obstacle?",
                            "verse 90:13": "And what will show you what the obstacle is?,",
                            "verse 90:14": "the freeing of a slave,",
                            "verse 90:15": "or to give food on a day of hunger,",
                            "verse 90:16": "to an orphan near of kin",
                            "verse 90:17": "or a needy person in misery;",
                            "verse 90:18": "while being one of those who believe and enjoin one another to steadfastness and enjoin one another to compassion.",
                            "verse 90:19": "Those are the ones of the right .",
                            "verse 90:20": "But those who disbelieve in Our signs, they are the ones of the left .",
                            "verse 90:21": "Over them will be an enclosing Fire."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 90:1": "I swear by this city (Mecca),",
                            "verse 90:2": "(O My Esteemed Beloved,) because you are residing in it.",
                            "verse 90:3": "(O My Esteemed Beloved!) By (your) father (Adam or Ibrahim )",
                            "verse 90:4": "and by those who are born,",
                            "verse 90:5": "Indeed, We have created man (ever suffering) in rigours.",
                            "verse 90:6": "Does he think that no one can ever overpower him?",
                            "verse 90:7": "(Boasting,) he says: ‘I have spent heaps of wealth.",
                            "verse 90:8": "Does he think that no one has seen him (making this extravagant spending)?",
                            "verse 90:9": "Have We not made for him two eyes?",
                            "verse 90:10": "And (have We not given him) a tongue and two lips?",
                            "verse 90:11": "And (have We also not) shown him the two highways (of good and evil)?",
                            "verse 90:12": "But he has not yet attempted the steep ascent (of the Din )",
                            "verse 90:13": "of truth and the practical life dedicated to good and piety).",
                            "verse 90:14": "And what have you thought of the steep ascent (of the rigours of the Din",
                            "verse 90:15": "of truth)?",
                            "verse 90:16": "It is freeing a neck (from slavery and subjugation),",
                            "verse 90:17": "Or feeding on a day of scarcity (the poor and the needy during famine and scarcity i.",
                            "verse 90:18": "The orphaned relative,",
                            "verse 90:19": "Or the poverty-stricken destitute who is completely rundown (and homeless).",
                            "verse 90:20": "(Provided this striving soul is) one of those who believe and advise one another patience and tolerance and urge one another for mutual affection and mercy.",
                            "verse 90:21": "These are the people of the Right Hand (i.",
                            "verse 90:22": "And those who reject Our signs are the people of the Left Hand (the callous and the doomed).",
                            "verse 90:23": "Fire will be enclosed upon them (covering from all sides)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Kautta tämän kaupungin",
                            "verse 90:2": "jossa sinä asut",
                            "verse 90:3": "-kautta sukumme Alkuunpanijan ja hänestä syntyneen!",
                            "verse 90:4": "Me olemme luonut ihmisen todellakin elämään vaikeuksissa:",
                            "verse 90:5": "jottei hän luulisi, että kenelläkään ei ole valtaa hänen suhteensa.",
                            "verse 90:6": "Hän sanoo: »Olen tuhlannut paljon varoja» (Profeetan vastustamiseen).",
                            "verse 90:7": "Luuleeko hän, ettei kukaan näe häntä?",
                            "verse 90:8": "Emmekö ole antanut hänelle kaksi silmää,",
                            "verse 90:9": "kielen ja huulet?",
                            "verse 90:10": "ja tehnyt hänelle selväksi kummankin (hyvän ja pahan) tien?",
                            "verse 90:11": "Mutta hän ei yrittänyt nousta kaitaa polkua.",
                            "verse 90:12": "Miten saan sinut käsittämään, mikä kaita polku on?",
                            "verse 90:13": "Se on samaa kuin vapauttaa orja",
                            "verse 90:14": "tai ruokkia nälän päivinä",
                            "verse 90:15": "orpoa ja sukulaista",
                            "verse 90:16": "tai maahan vaipunutta köyhää miestä;",
                            "verse 90:17": "se on samaa kuin niihin kuuluminen, jotka uskovat ja kehoittavat toisiaan kestävyyteen ja laupeuteen.",
                            "verse 90:18": "Nämä ovat niitä, jotka vaeltavat oikealla puolella.",
                            "verse 90:19": "Mutta ne, jotka hylkivät julistamaamme totuutta, kulkevat vasempaa puolta,",
                            "verse 90:20": "ja heidät piirittää tuli."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 90:1": "Non ! J'en jure par cette cité !",
                            "verse 90:2": "- et toi, tu es un habitant de cette cité -,",
                            "verse 90:3": "par le procréateur et ce qu'il procrée !",
                            "verse 90:4": "Certes, Nous avons créé l'homme dans l'affliction.",
                            "verse 90:5": "Pense-t-il que personne n'a pouvoir contre lui ?",
                            "verse 90:6": "Il dit : \" J'ai dilapidé d'abondantes richesses ! \"",
                            "verse 90:7": "S'imagine-t-il que personne ne l'a vu ?",
                            "verse 90:8": "Ne lui avons-Nous pas donné deux yeux,",
                            "verse 90:9": "une langue et deux lèvres",
                            "verse 90:10": "et ne l'avons-Nous pas guidé jusqu'au confluent des deux voies ?",
                            "verse 90:11": "Mais il ne s'est pas engagé dans la voie ascendante !",
                            "verse 90:12": "Et qu'est-ce qui te fera connaître ce qu'est la voie ascendante ?",
                            "verse 90:13": "C'est racheter un captif,",
                            "verse 90:14": "ou nourrir, en un jour de disette,",
                            "verse 90:15": "un proche parent orphelin,",
                            "verse 90:16": "ou un pauvre dans le dénuement.",
                            "verse 90:17": "Puis, c'est être du nombre de ceux qui croient et s'encouragent mutuellement à la patience, et s'encouragent à la mansuétude.",
                            "verse 90:18": "Ceux-là sont les compagnons de la droite.",
                            "verse 90:19": "Quant à ceux qui mécroient en Nos signes, ce sont les compagnons de la gauche :",
                            "verse 90:20": "un Feu se refermera sur eux ! :"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 90:1": "Non ! .",
                            "verse 90:2": "et toi, tu es un résident dans cette cité -",
                            "verse 90:3": "Et par le père et ce qu’il engendre !",
                            "verse 90:4": "Nous avons, certes, créé l’homme pour une vie de lutte.",
                            "verse 90:5": "Pense-t-il que personne ne pourra rien contre lui ?",
                            "verse 90:6": "Il dit : «J’ai gaspillé beaucoup de biens».",
                            "verse 90:7": "Pense-t-il que nul ne l’a vu ?",
                            "verse 90:8": "Ne lui avons Nous pas assigné deux yeux,",
                            "verse 90:9": "et une langue et deux lèvres ?",
                            "verse 90:10": "Ne l’avons-Nous pas guidé aux deux voies .",
                            "verse 90:11": "Or, il ne s’engage pas dans la voie difficile !",
                            "verse 90:12": "Et qui te dira ce qu’est la voie difficile ?",
                            "verse 90:13": "C’est délier un joug [affranchir un esclave],",
                            "verse 90:14": "ou nourrir, en un jour de famine,",
                            "verse 90:15": "un orphelin proche parent",
                            "verse 90:16": "ou un pauvre dans le dénouement.",
                            "verse 90:17": "Et c’est être, en outre, de ceux qui croient et s’enjoignent mutuellement l’endurance, et s’enjoignent mutuellement la miséricorde.",
                            "verse 90:18": "Ceux-là sont les gens de la droite;",
                            "verse 90:19": "alors que ceux qui ne croient pas en Nos versets sont les gens de la gauche.",
                            "verse 90:20": "Le Feu se refermera sur eux."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Nein, aber Ich schwöre bei dieser Stadt",
                            "verse 90:2": "Und du wirst diese Stadt betreten -",
                            "verse 90:3": "Und bei dem Vater und dem Kind,",
                            "verse 90:4": "Wahrlich, Wir haben den Menschen zu einem Stande des Kampfes erschaffen.",
                            "verse 90:5": "Meint er, niemand habe Macht über ihn?",
                            "verse 90:6": "Er spricht: «Ich habe viel Gut aufgewendet.",
                            "verse 90:7": "Meint er, niemand sehe ihn?",
                            "verse 90:8": "Haben Wir ihm nicht zwei Augen zugeteilt",
                            "verse 90:9": "Und eine Zunge und zwei Lippen?",
                            "verse 90:10": "Dann haben Wir ihm die beiden Heerstraßen (zu Gut und Böse) gewiesen,",
                            "verse 90:11": "Doch er unternahm das Erklimmen nicht.",
                            "verse 90:12": "Und was lehrt dich wissen, was das Erklimmen ist?",
                            "verse 90:13": "Die Befreiung eines Sklaven,",
                            "verse 90:14": "Oder die Speisung an einem Tage der Hungersnot",
                            "verse 90:15": "Einer nah verwandten Waise,",
                            "verse 90:16": "Oder eines Armen, der sich im Staube wälzt.",
                            "verse 90:17": "Wiederum, er sollte zu denen gehören, die glauben und einander ermahnen zur Geduld und einander ermahnen zur Barmherzigkeit.",
                            "verse 90:18": "Diese werden zur Rechten sein.",
                            "verse 90:19": "Die aber nicht an Unsere Zeichen glauben, sie werden zur Linken sein.",
                            "verse 90:20": "Rings um sie wird ein umschließendes Feuer sein."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "eq>s bl Ógj ¼eDdk½ dh dle",
                            "verse 90:2": "vkSj rqe blh Ógj esa rks jgrs gks",
                            "verse 90:3": "vkSj ¼rqEgkjs½ cki ¼vkne½ vkSj mldh vkSykn dh d+le",
                            "verse 90:4": "geus bUlku dks e’kD+d+r esa ¼jgus okyk½ iSnk fd;k gS",
                            "verse 90:5": "D;k og ;s le>rk gS fd ml ij dksbZ dkcw u ik ldsxk",
                            "verse 90:6": "og dgrk gS fd eSus vyx+kjksa eky mM+k fn;k",
                            "verse 90:7": "D;k og ;s [+;ky j[krk gS fd mldks fdlh us ns[kk gh ugha",
                            "verse 90:8": "D;k geus mls nksuksa vk¡[ksa vkSj t+cku",
                            "verse 90:9": "vkSj nksuksa yc ugha fn, ¼t+:j fn,½",
                            "verse 90:10": "vkSj mldks ¼vPNh cqjh½ nksuksa jkgsa Hkh fn[kk nha",
                            "verse 90:11": "fQj og ?kkVh ij ls gksdj ¼D;ksa½ ugha xqt+jk",
                            "verse 90:12": "vkSj rqedks D;k ekywe fd ?kkVh D;k gS",
                            "verse 90:13": "fdlh ¼dh½ xnZu dk ¼xqykeh ;k dtZ+ ls½ NqM+kuk",
                            "verse 90:14": ";k Hkw[k ds fnu fj’rsnkj ;rhe ;k [+kkdlkj",
                            "verse 90:15": "eksgrkt dks",
                            "verse 90:16": "[kkuk f[kykuk",
                            "verse 90:17": "fQj rks mu yksxksa esa ¼Ókfey½ gks tkrk tks bZeku yk, vkSj lcz dh ulhgr vkSj rjl [kkus dh olh;r djrs jgs",
                            "verse 90:18": ";gh yksx [+kq’k ulhc gSa",
                            "verse 90:19": "vkSj ftu yksxksa us gekjh vk;rksa ls bUdkj fd;k gS ;gh yksx cnc[+r gSa",
                            "verse 90:20": "fd mudks vkx esa Mky dj gj rjQ ls cUn dj fn;k tk,xk lwj, cyn [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Aku benar-benar bersumpah dengan kota ini (Mekah),",
                            "verse 90:2": "dan kamu (Muhammad) bertempat di kota Mekah ini,",
                            "verse 90:3": "dan demi bapak dan anaknya.",
                            "verse 90:4": "Sesungguhnya Kami telah menciptakan manusia berada dalam susah payah.",
                            "verse 90:5": "Apakah manusia itu menyangka bahwa sekali-kali tiada seorang pun yang berkuasa atasnya?",
                            "verse 90:6": "Dia mengatakan: \"Aku telah menghabiskan harta yang banyak\".",
                            "verse 90:7": "Apakah dia menyangka bahwa tiada seorang pun yang melihatnya?",
                            "verse 90:8": "Bukankah Kami telah memberikan kepadanya dua buah mata,",
                            "verse 90:9": "lidah dan dua buah bibir.",
                            "verse 90:10": "Dan Kami telah menunjukkan kepadanya dua jalan.",
                            "verse 90:11": "Maka tidakkah sebaiknya (dengan hartanya itu) ia menempuh jalan yang mendaki lagi sukar?.",
                            "verse 90:12": "Tahukah kamu apakah jalan yang mendaki lagi sukar itu?",
                            "verse 90:13": "(yaitu) melepaskan budak dari perbudakan,",
                            "verse 90:14": "atau memberi makan pada hari kelaparan,",
                            "verse 90:15": "(kepada) anak yatim yang ada hubungan kerabat,",
                            "verse 90:16": "atau orang miskin yang sangat fakir.",
                            "verse 90:17": "Dan dia termasuk orang-orang yang beriman dan saling berpesan untuk bersabar dan saling berpesan untuk berkasih sayang.",
                            "verse 90:18": "Mereka (orang-orang yang beriman dan saling berpesan itu) adalah golongan kanan.",
                            "verse 90:19": "Dan orang-orang yang kafir kepada ayat-ayat Kami, mereka itu adalah golongan kiri.",
                            "verse 90:20": "Mereka berada dalam neraka yang ditutup rapat."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Lo giuro per questa contrada",
                            "verse 90:2": "- e tu sei un abitante di questa contrada -",
                            "verse 90:3": "e per chi genera e per chi è generato.",
                            "verse 90:4": "In verità abbiamo creato l'uomo perché combatta .",
                            "verse 90:5": "Crede forse che nessuno possa prevalere su di lui?",
                            "verse 90:6": "Dice: « Ho dilapidato una quantità di beni» .",
                            "verse 90:7": "Crede forse che nessuno lo abbia visto?",
                            "verse 90:8": "Non gli abbiamo dato due occhi,",
                            "verse 90:9": "una lingua e due labbra?",
                            "verse 90:10": "Non gli abbiamo indicato le due vie?",
                            "verse 90:11": "Segua dunque la via ascendente .",
                            "verse 90:12": "E chi ti farà comprendere cos'è la via ascendente?",
                            "verse 90:13": "E' riscattare uno schiavo ,",
                            "verse 90:14": "o nutrire, in un giorno di carestia,",
                            "verse 90:15": "un parente orfano",
                            "verse 90:16": "o un povero prostrato [dalla miseria],",
                            "verse 90:17": "ed essere tra coloro che credono e vicendevolmente si invitano alla costanza e vicendevolmente si invitano alla misericordia.",
                            "verse 90:18": "Costoro sono i compagni della destra ,",
                            "verse 90:19": "mentre coloro che non credono nei Nostri segni, sono i compagni della sinistra .",
                            "verse 90:20": "Il Fuoco si chiuderà su di loro."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "われはこの町において誓う。",
                            "verse 90:2": "あなたはこの町の（居住権を持つ）住民である。",
                            "verse 90:3": "生む者と生まれる者にかけて（誓う）。",
                            "verse 90:4": "本当にわれは，人間を労苦するように創った。",
                            "verse 90:5": "かれ（人間）は，何ものも，自分を左右する者はないと考えるのか。",
                            "verse 90:6": "かれは，「わたしは大変な財産を費した。」と言う。",
                            "verse 90:7": "かれは，誰もかれを見ていないと考えるのか。",
                            "verse 90:8": "われは，かれのために両目を創ったではないか，",
                            "verse 90:9": "また一つの舌と二つの唇を。",
                            "verse 90:10": "更に二つの道をかれに示した（ではないか）。",
                            "verse 90:11": "だがかれは，険しい道を取ろうとはしない。",
                            "verse 90:12": "険しい道が何であるかを，あなたに理解させるものは何か。",
                            "verse 90:13": "（それは）奴隷を解放し，",
                            "verse 90:14": "または飢餓の日には食物を出して，",
                            "verse 90:15": "近い縁者の孤児を，",
                            "verse 90:16": "または酷く哀れな貧者を（養うこと）。",
                            "verse 90:17": "それから信仰する者になって忍耐のために励ましあい，互いに親切，温情を尽しあう（ことである）。",
                            "verse 90:18": "これらは右手の仲間である。",
                            "verse 90:19": "だがわが印を拒否する者，かれらは左手の仲間である。",
                            "verse 90:20": "かれらの上には，業火が覆い被さるであろう。 だがわが印を拒否する者，かれらは左手の仲間である。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "이 도읍을 두고 맹세하사",
                            "verse 90:2": "그대는 이 도읍의 자유로운 거주인이라",
                            "verse 90:3": "선조와 자손을 두고 맹세하사",
                            "verse 90:4": "실로 하나님은 인간으로 하여금 노력과 시련속에서 살도록 창 조하였나니",
                            "verse 90:5": "어느 누구도 불신자를 제압할 수 없다고 생각 하느뇨",
                            "verse 90:6": "실로 나는 많은 재산을 탕진 하였습니다 라고 불신자는 말할 것이라",
                            "verse 90:7": "어느 누구도 그를 지켜보지 아니한다고 불신자는 생각하느뇨",
                            "verse 90:8": "하나님이 그에게 두 눈을 주 지 아니 했더뇨",
                            "verse 90:9": "하나의 혀와 두 입술을 주지 아니 했더뇨",
                            "verse 90:10": "하나님은 그에게 두 길을 설명하였노라",
                            "verse 90:11": "그는 힘든 길에서 수고하려 아니 하느뇨",
                            "verse 90:12": "그 힘든 길이 무엇인지 무엇이 그대에게 설명하여 주리요",
                            "verse 90:13": "그것은 노예를 해방시켜 주 는 일이요",
                            "verse 90:14": "배고픈 자에게 음식을 베푸 는 것이며",
                            "verse 90:15": "친척의 고아들과",
                            "verse 90:16": "먼지 투성이가 된 가난한 자들에게 자선을 베푸는 것이라",
                            "verse 90:17": "그런 후 믿음으로 서로가 서로에게 인내하고 서로가 서로에게 사랑을 베푸는 것으로",
                            "verse 90:18": "이들만이 우편에 있는 동료 들이라",
                            "verse 90:19": "그러나 하나님의 말씀을 거역하는 자들은 좌편에 있는 동료 들로",
                            "verse 90:20": "그들 위에는 닫혀진 불지옥 만이 있을 뿐이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "سوێندم به‌م شاره (واته شاری مه‌ککه‌).",
                            "verse 90:2": "له کاتێکدا تۆ نیشته‌جێی تیایدا.",
                            "verse 90:3": "سوێند به باوک و ڕۆڵه‌که‌ی.",
                            "verse 90:4": "(سوێند به‌وانه‌) به‌ڕاستی ئێمه ئینسانمان دروست کردووه و به‌رده‌وام له ناڕه‌حه‌تی و سه‌غڵه‌تی و کێشه و ناخۆشیدا.",
                            "verse 90:5": "ئایا ئاده‌میزاد واده‌زانێت که هه‌رگیز که‌س ده‌سه‌ڵاتی به‌سه‌ریدا نابێت؟",
                            "verse 90:6": "(زۆرجار) ده‌ڵێت: من پاره‌ی زۆرم له ناوداوه‌!! من ماڵی زۆرم خه‌رج کردووه‌!!",
                            "verse 90:7": "ئایا وا ده‌زانێت که‌س ئاگاداری نیه‌و نه‌یبینیووه (که ئه‌و سه‌رمایه‌یه‌ی له کوێوه په‌یداکردووه و له چیدا خه‌رجی کردووه‌؟! ‎).",
                            "verse 90:8": "ئایا جووتێک چاومان پێنه‌به‌خشیووه‌؟ (‎چاو: زۆر گرنگتره له دوو ده‌زگای کامێرای ئه‌له‌کترۆنی خودکار له هه‌ر چرکه‌یه‌کدا هه‌زاران وێنه‌ی ڕه‌نگاو ڕه‌نگ ده‌گرێت و ده‌ینێرێت بۆ مێشک، ئه‌ویش هه‌ندێکی هه‌ڵده‌گرێت).",
                            "verse 90:9": "هه‌روه‌ها زمان و دوو لێوه‌شمان پێ نه‌به‌خشیووه‌؟",
                            "verse 90:10": "ئایا به منداڵی ڕێنموویمان نه‌کردووه بۆ ئه‌وه‌ی شیر له مه‌مکه‌کانی دایکی بخوات؟، له گه‌وره‌یشدا بۆ ئه‌وه‌ی سه‌رپشک بێت له شوێنکه‌وتنی ڕێبازی ڕاست، یان چه‌وت؟!",
                            "verse 90:11": "که‌چی (زۆربه‌ی ئه‌و خه‌ڵکه‌) نه‌یتوانی به‌سه‌ر کۆسپ و له‌په‌ره‌کاندا زاڵ ببێت و ڕێگای سه‌رفه‌رزای بگرێته‌به‌ر.",
                            "verse 90:12": "جا تۆ ‎چووزانی ئه‌و کۆسپ و له‌مپه‌رانه کامه‌ن؟!.",
                            "verse 90:13": "ئازاد؛ ردنی به‌نده و کۆیله‌یه (یان ئازادکردنی گه‌ردنی خۆیه‌تی له گوناهو یاخی بوون و سه‌رکه‌شی).",
                            "verse 90:14": "یاخود خۆراک به‌خشینه له ڕۆژێکدا که گرانی و پرسێتی هه‌بێت.",
                            "verse 90:15": "به‌تایبه‌تی به‌و هه‌یتوه‌ی که خزمایه‌تی هه‌یه له‌گه‌ڵیدا.",
                            "verse 90:16": "یان به هه‌ژارێک که له هه‌ژاریدا له‌سه‌ر خاک دانیشێت، یان په‌ککه‌وته و که‌فته‌کارێک.",
                            "verse 90:17": "سه‌ره‌ڕای ئه‌وانه‌ش ئاده‌میزاد ده‌بێت له‌وانه‌بێت که باوه‌ڕیان هێناوه و ئامۆژگاری یه‌کتریان کردووه له‌سه‌ر خۆگری و ئارامگری و هه‌روه‌ها ئامۆژگاری یه‌کتریان کردووه له‌سه‌ر ڕه‌حم و به‌زه‌یی و میهره‌بانی.",
                            "verse 90:18": "(ئه‌وانه‌ی به‌و سیفه‌ته جوانانه خۆیان ده‌ڕازێننه‌وه‌) ئه‌وانه ده‌سته‌ی ڕاست و (ده‌سته‌ی به‌خته‌وه‌رانن‎).",
                            "verse 90:19": "ئه‌وانه‌ش که باوه‌ڕیان به ئایه‌ت و فه‌رمانه‌کانی ئێمه نه‌بووه‌، ئه‌وانه ده‌سته‌ی خوارو چه‌پ و چه‌وت و ناله‌باران، ده‌سته‌ی نه‌گبه‌ت و سه‌رلێشیواوه‌کانن.",
                            "verse 90:20": "ئه‌وانه ده‌رگا و قاپیه‌کانی دۆزه‌خ له‌سه‌ریان داخراوه و هیچ هیوایه‌کی ڕزگارییان نیه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Aku bersumpah dengan negeri (Mekah) ini;",
                            "verse 90:2": "Sedang engkau (wahai Muhammad) tinggal di negeri ini (sentiasa ditindas),",
                            "verse 90:3": "Demi manusia yang melahirkan zuriat dan zuriat yang dilahirkannya;",
                            "verse 90:4": "Sesungguhnya Kami telah jadikan manusia sentiasa dalam keadaan menghadapi kesulitan dan kesukaran (jasmani dan rohaninya);",
                            "verse 90:5": "Patutkah manusia yang demikian keadaannya (terpedaya dengan kekuasaan yang ada padanya dan) menyangka bahawa tidak ada sesiapapun yang dapat mengatasi kekuasaannya (dan menyeksakannya)?",
                            "verse 90:6": "Manusia yang demikian keadaannya (tidaklah patut dia bermegah-megah dengan kekayaannya dan) berkata: Aku telah habiskan harta benda yang banyak (dalam usaha menegakkan nama dan bangsa).",
                            "verse 90:7": "Adakah dia menyangka bahawa tidak ada sesiapapun yang melihatnya (dan mengetahui tujuannya menghabiskan harta bendanya itu?",
                            "verse 90:8": "(Mengapa manusia terpedaya dan bermegah-megah?) Tidakkah Kami telah menjadikan baginya: Dua mata (untuk dia memerhatikan kekuasaan dan kekayaan Kami?)",
                            "verse 90:9": "Dan lidah serta dua bibir (untuk dia menyempurnakan sebahagian besar dari hajat-hajatnya)?",
                            "verse 90:10": "Dan Kami telah menunjukkan kepadanya dua jalan, (jalan kebaikan untuk dijalaninya, dan jalan kejahatan untuk dijauhi)?",
                            "verse 90:11": "Dalam pada itu manusia tidak (memilih jalan kebaikan) merempuh masuk mengerjakan amal-amal yang tinggi darjatnya di sisi Tuhan;",
                            "verse 90:12": "Dan apa jalannya engkau dapat mengetahui: Apa dia amal-amal yang tinggi darjatnya di sisi Tuhan itu?",
                            "verse 90:13": "(Di antara amal-amal itu bagi orang yang mampu) ialah: Memerdekakan hamba abdi;",
                            "verse 90:14": "Atau memberi makan pada hari kelaparan -",
                            "verse 90:15": "Kepada anak yatim dari kaum kerabat,",
                            "verse 90:16": "Atau kepada orang miskin yang terlantar di atas tanah.",
                            "verse 90:17": "Selain dari (tidak mengerjakan amal-amal) itu, dia (tidak pula) menjadi dari orang-orang yang beriman dan berpesan-pesan dengan sabar serta berpesan-pesan dengan kasih sayang.",
                            "verse 90:18": "(Ketahuilah! Bahawa orang-orang yang beriman serta berusaha mengerjakan amal-amal yang tinggi darjatnya di sisi Tuhan), merekalah golongan pihak kanan (yang akan beroleh Syurga).",
                            "verse 90:19": "Dan (sebaliknya) orang-orang yang kufur ingkar akan ayat-ayat keterangan Kami, merekalah golongan pihak kiri.",
                            "verse 90:20": "Mereka ditimpakan (azab seksa) Neraka yang ditutup rapat (supaya kuat bakarannya)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "قسم به اين شهر مقدس ( مكه)،",
                            "verse 90:2": "شهرى كه تو در آن ساكنى،",
                            "verse 90:3": "و قسم به پدر و فرزندش ( ابراهيم خليل و فرزندش اسماعيل ذبيح)،",
                            "verse 90:4": "كه ما انسان را در رنج آفريديم (و زندگى او پر از رنجهاست)!",
                            "verse 90:5": "آيا او گمان مى‏كند كه هيچ كس نمى‏تواند بر او دست يابد؟!",
                            "verse 90:6": "مى‏گويد: «مال زيادى را (در كارهاى خير) نابود كرده‏ام!»",
                            "verse 90:7": "آيا (انسان) گمان مى‏كند هيچ كس او را نديده (كه عمل خيرى انجام نداده) است؟!",
                            "verse 90:8": "آيا براى او دو چشم قرار نداديم،",
                            "verse 90:9": "و يك زبان و دو لب؟!",
                            "verse 90:10": "و او را به راه خير و شر هدايت كرديم!",
                            "verse 90:11": "ولى او از آن گردنه مهم نگذشت!",
                            "verse 90:12": "و تو نمى‏دانى آن گردنه چيست!",
                            "verse 90:13": "آزادكردن برده‏اى،",
                            "verse 90:14": "يا غذا دادن در روز گرسنگى",
                            "verse 90:15": "يتيمى از خويشاوندان،",
                            "verse 90:16": "يا مستمندى خاك‏نشين را،",
                            "verse 90:17": "سپس از كسانى باشد كه ايمان آورده و يكديگر را به شكيبايى و رحمت توصيه مى‏كنند!",
                            "verse 90:18": "آنها «اصحاب اليمين‏»اند (كه نامه اعمالشان را به دست راستشان مى‏دهند)!",
                            "verse 90:19": "و كسانى كه آيات ما را انكار كرده‏اند افرادى شومند (كه نامه اعمالشان به دست چپشان داده مى‏شود)",
                            "verse 90:20": "بر آنها آتشى است فروبسته (كه راه فرارى از آن نيست)!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Qual! Juro por esta metrópole (Makka),",
                            "verse 90:2": "- E tu és um dos habitantes desta metrópole -",
                            "verse 90:3": "pelo procriador e pelo que procria,",
                            "verse 90:4": "que criamos o homem em uma atmosfera de aflição.",
                            "verse 90:5": "pensa, acaso, que ninguém poderá com ele?",
                            "verse 90:6": "Ele diz: Já consumi vastas riquezas.",
                            "verse 90:7": "Crê, ele, porventura, que ninguém o vê?",
                            "verse 90:8": "Não o dotamos, acaso, de dois olhos,",
                            "verse 90:9": "De uma língua e de dois lábios,",
                            "verse 90:10": "E lhe indicamos os dois caminhos?",
                            "verse 90:11": "Porventura, ele tentou vencer as vicissitudes?",
                            "verse 90:12": "E o que te fará entender o que é vencer as vicissitudes?",
                            "verse 90:13": "É libertar um cativo,",
                            "verse 90:14": "Ou alimentar, num dia de privação,",
                            "verse 90:15": "Ou parente órfão,",
                            "verse 90:16": "Ou um indigente necessitado.",
                            "verse 90:17": "É, ademais, contar-se entre os fiéis, que recomendam mutuamente a perseverança e se encomendam à misericórdia.",
                            "verse 90:18": "Seus lugares serão à destra.",
                            "verse 90:19": "Por outra, aqueles que negam os Nossos versículos terão os seus lugares à sinistra.",
                            "verse 90:20": "E serão circundados pelo fogo infernal!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 90:1": "Nu! Jur pe aceastã cetate -",
                            "verse 90:2": "Și Tu ești locuitor al acestei cetãți! -",
                            "verse 90:3": "Și pe pãrinte și pe ceea ce el zãmislește!",
                            "verse 90:4": "Noi l-am creat pe om spre încercare!",
                            "verse 90:5": "Crede el cã nu va avea nimeni putere asupra lui?",
                            "verse 90:6": "El zice: \"Am irosit avere multã!\"",
                            "verse 90:7": "Oare crede el cã nu-l vede nimeni?",
                            "verse 90:8": "Oare nu i-am dat lui doi ochi",
                            "verse 90:9": "Și o limbã și douã buze",
                            "verse 90:10": "Și nu i-am dat lui douã drumuri ?",
                            "verse 90:11": "Dar el nu a strãbãtut drumul cel greu!",
                            "verse 90:12": "Dar de unde sã știi tu ce este drumul cel greu?",
                            "verse 90:13": "Dezlegarea unui gât",
                            "verse 90:14": "Sau hrãnirea, într-o zi de foamete,",
                            "verse 90:15": "A unui orfan dintre rude",
                            "verse 90:16": "Sau a unui sãrman, aflat în sãrãcie lucie!",
                            "verse 90:17": "Apoi, a fost dintre aceia care cred și se îndeamnã la rãbdare șise îndeamnã la îndurare!.",
                            "verse 90:18": "Aceștia sunt adepți ai dreptei",
                            "verse 90:19": "Aceia, însã, care tãgãduiesc semnele Noastre sunt adepți ai stângii",
                            "verse 90:20": "Și asupra lor va fi un Foc închis."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 90:1": "Nu, eu jur pe această cetate!",
                            "verse 90:2": "Şi tu eşti locuitor al acestei cetăţi!",
                            "verse 90:3": "Pe un tată şi pe ceea ce a odrăslit!",
                            "verse 90:4": "Noi am creat omul în neajuns!",
                            "verse 90:5": "Oare el socoate că nimeni nu-l poate dovedi?",
                            "verse 90:6": "El spune: “Am isprăvit averi cu toptanul!”",
                            "verse 90:7": "Oare el socoate că nimeni nu l-a văzut?",
                            "verse 90:8": "Oare nu Noi i-am făcut ochi,",
                            "verse 90:9": "limbă şi buze?",
                            "verse 90:10": "Oare nu Noi i-am arătat cele două căi?",
                            "verse 90:11": "El nu o apucă însă pe calea suitoare!",
                            "verse 90:12": "Cum vei şti tu oare care este calea suitoare?",
                            "verse 90:13": "Aceasta înseamnă să răscumperi un prins,",
                            "verse 90:14": "să ospătezi, într-o zi de foamete,",
                            "verse 90:15": "o rudă orfană",
                            "verse 90:16": "ori un sărman lipit pământului.",
                            "verse 90:17": "Aceasta înseamnă să fii în rândul celor care cred, al celor care se îndeamnă la răbdare, al celor care se îndeamnă la îndurare.",
                            "verse 90:18": "Aceştia sunt cei de-a dreapta.",
                            "verse 90:19": "Cei care tăgăduiesc însă semnele Noastre sunt cei de-a stânga,",
                            "verse 90:20": "asupra lor un foc se va bolti."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Клянусь сим городом2324,",
                            "verse 90:2": "В котором ты живешь2325,",
                            "verse 90:3": "Родителем и тем, что породил он, —",
                            "verse 90:4": "Мы человека создали на тяготы(земные);",
                            "verse 90:5": "Так неужели он воображает,Что здесь над ним никто не властен?",
                            "verse 90:6": "Он может говорить:«Я заплатил за все сполна!»",
                            "verse 90:7": "Ужель он думает, никто его не видит?",
                            "verse 90:8": "И разве не дано ему двух глаз,",
                            "verse 90:9": "И языка, и пары губ?",
                            "verse 90:10": "И не указаны два главных направленья(Добра и Зла)?",
                            "verse 90:11": "Но не спешит избрать стезю крутуючеловек!",
                            "verse 90:12": "Как объяснить тебе, что значит«крутизна»?",
                            "verse 90:13": "Освободить раба,",
                            "verse 90:14": "Дать пищу в дни лишений",
                            "verse 90:15": "Сироте, который близок вам по крови,",
                            "verse 90:16": "Иль бедняку, презренному другими.",
                            "verse 90:17": "И вот тогда вы станете одним из тех,Кто верит (в Бога), и смиренносострадает,И с милосердием творит добро.",
                            "verse 90:18": "Таков лик праведных — стоящихПо праву сторону в День Судный.",
                            "verse 90:19": "Но тем, кто Наши ясные знаменияотверг,Почить на левой стороне —",
                            "verse 90:20": "Под сводом пламенным Огня! —"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "¡No! ¡Juro por esta ciudad,",
                            "verse 90:2": "en la que estás avecindado!",
                            "verse 90:3": "¡Por todo padre y lo que ha engendrado!",
                            "verse 90:4": "Hemos creado al hombre en aflicción.",
                            "verse 90:5": "¿Cree que nadie podrá contra él?",
                            "verse 90:6": "Dice: «He consumido una hacienda considerable».",
                            "verse 90:7": "¿Cree que nadie le ha visto?",
                            "verse 90:8": "¿No le hemos dado dos ojos,",
                            "verse 90:9": "una lengua y dos labios?",
                            "verse 90:10": "¿No le hemos mostrado las dos vías?",
                            "verse 90:11": "Pues nunca se ha puesto a subir la Cuesta.",
                            "verse 90:12": "Y ¿cómo sabrás qué es la Cuesta?",
                            "verse 90:13": "Es manumitir a un esclavo,",
                            "verse 90:14": "Alimentar en tiempo de hambre",
                            "verse 90:15": "A un pariente próximo huérfano,",
                            "verse 90:16": "A un pobre en la miseria.",
                            "verse 90:17": "Es, también, formar parte de los que creen, de los que se recomiendan mutuamente la paciencia y la misericordia.",
                            "verse 90:18": "Ésos son los de la Derecha.",
                            "verse 90:19": "En cambio, los que no creen en Nuestros signos, ésos son los de la izquierda.",
                            "verse 90:20": "Se cerrará un fuego sobre ellos."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "இந்நகரத்தின் மீது நான் சத்தியம் செய்கின்றேன்.",
                            "verse 90:2": "நீர் இந்நகரத்தில் (சுதந்திரமாகத்) தங்கியிருக்கும் நிலையில்,",
                            "verse 90:3": "பெற்றோர் மீதும், (பெற்ற) சந்ததியின் மீதும் சத்தியமாக,",
                            "verse 90:4": "திடமாக, நாம் மனிதனைக் கஷ்டத்தில் (உள்ளவனாகப்) படைத்தோம்.",
                            "verse 90:5": "'ஒருவரும், தன் மீது சக்தி பெறவே மாட்டார்' என்று அவன் எண்ணிக் கொள்கிறானா?",
                            "verse 90:6": "\"ஏராளமான பொருளை நான் அழித்தேன்\" என்று அவன் கூறுகிறான்.",
                            "verse 90:7": "தன்னை ஒருவரும் பார்க்கவில்லையென்று அவன் எண்ணுகிறானா?",
                            "verse 90:8": "அவனுக்கு நாம் இரண்டு கண்களை நாம் ஆக்கவில்லையா?",
                            "verse 90:9": "மேலும் நாவையும், இரண்டு உதடுகளையும் (ஆக்கவில்லையா)?",
                            "verse 90:10": "அன்றியும் (நன்மை, தீமையாகிய) இருபாதைகளை நாம் அவனுக்குக் காண்பித்தோம்.",
                            "verse 90:11": "ஆயினும், அவன் கணவாயைக் கடக்கவில்லை.",
                            "verse 90:12": "(நபியே!) கணவாய் என்பது என்ன என்பதை உமக்கு எது அறிவிக்கும்.",
                            "verse 90:13": "(அது) ஓர் அடிமையை விடுவித்தல்-",
                            "verse 90:14": "அல்லது, பசித்திருக்கும் நாளில் உணவளித்தலாகும்.",
                            "verse 90:15": "உறவினனான ஓர் அநாதைக்கோ,",
                            "verse 90:16": "அல்லது (வறுமை) மண்ணில் புரளும் ஓர் ஏழைக்கோ (உணவளிப்பதாகும்).",
                            "verse 90:17": "பின்னர், ஈமான் கொண்டு, பொறுமையைக் கொண்டு ஒருவருக்கொருவர் உபதேசித்தும், கிருபையைக் கொண்டு ஒருவருக் கொருவர் உபதேசித்தும் வந்தவர்களில் இருப்பதுவும் (கணவாயைக் கடத்தல்) ஆகும்.",
                            "verse 90:18": "அத்தகையவர் தாம் வலப்புறத்தில் இருப்பவர்கள்.",
                            "verse 90:19": "ஆனால், எவர்கள் நம் வசனங்களை நிராகரிக்கிறார்களோ, அவர்கள் தாம் இடப்பக்கத்தையுடையோர்.",
                            "verse 90:20": "அவர்கள் மீது (எப்பக்கமும்) மூடப்பட்ட நெருப்பு இருக்கிறது."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "ขอสาบานด้วยเมืองนี้",
                            "verse 90:2": "และเจ้านั้นเป็นผู้อาศัยอยู่ในเมืองนี้",
                            "verse 90:3": "และขอสาบานด้วยผู้บังเกิดและผู้ถือกำเนิด",
                            "verse 90:4": "โดยแน่นอนเราได้บังเกิดมนุษย์มาเพื่อเผชิญความยากลำบาก",
                            "verse 90:5": "เขาคิดว่าไม่มีผู้ใดจะมีความสามารถเหนือเขากระนั้นหรือ ?",
                            "verse 90:6": "เขาจึงกล่าวว่า ฉันได้ผลาญทรัพย์สมบัติมามากมายแล้ว",
                            "verse 90:7": "เขาคิดว่าไม่มีผู้ใดเห็นเขากระนั้นหรือ ?",
                            "verse 90:8": "เรามิได้ทำดวงตาทั้งสองข้างให้แก่เขาดอกหรือ ?",
                            "verse 90:9": "และลิ้นและริมฝีปากทั้งสองด้วย ?",
                            "verse 90:10": "และเราได้ชี้แนะทางแห่งความดี และความชั่วแก่เขาแล้ว",
                            "verse 90:11": "กระนั้นก็ดีเขาก็ยังไม่พากเพียรบนทางลำบาก",
                            "verse 90:12": "และอันใดเล่าที่จะทำให้เจ้ารู้ว่าทางลำบากนั้นคืออะไร ?",
                            "verse 90:13": "คือการปล่อยทาส",
                            "verse 90:14": "หรือการให้อาหารในวันยากลำบากแห่งความหิวโหย",
                            "verse 90:15": "แก่เด็กกำพร้าที่เป็นญาติใกล้ชิด",
                            "verse 90:16": "หรือคนยากจนขัดสนที่มอมอยู่กับฝุ่นดิน",
                            "verse 90:17": "แล้วเขาได้อยู่ในหมู่ผู้ศรัทธา และตักเตือนกันให้มีความอดทน และตักเตือนกันให้มีความเมตตา",
                            "verse 90:18": "ชนเหล่านี้คือพวกฝ่ายขวา",
                            "verse 90:19": "ส่วนบรรดาผู้ปฏิเสธศรัทธาต่อสัญญาณต่าง ๆ ของเรา พวกเขาคือพวกฝ่ายซ้าย",
                            "verse 90:20": "บนพวกเขานั้นมีไฟนรกครอบคลุมอยู่อย่างมิดชิด"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Ki sen bu beldedesin ,",
                            "verse 90:2": "Ve andolsun babaya ve ondan meydana gelen çocuğa,",
                            "verse 90:3": "Biz, insanı (yüzyüze geleceği nice) zorluklar içinde yarattık.",
                            "verse 90:4": "İnsan, hiç kimsenin kendisine güç yetiremeyeceğini mi sanıyor?",
                            "verse 90:5": "\"Pek çok mal harcadım\" diyor.",
                            "verse 90:6": "Kimse onu görmedi mi sanıyor?",
                            "verse 90:7": "Biz ona iki göz vermedik mi?",
                            "verse 90:8": "Bir dil ve iki dudak ,",
                            "verse 90:9": "Ona iki yolu (doğru ve eğriyi) gösterdik .",
                            "verse 90:10": "Fakat o, sarp yokuşu aşamadı.",
                            "verse 90:11": "O",
                            "verse 90:12": "sarp yokuş nedir bilir misin?",
                            "verse 90:13": "Köle azat etmek,",
                            "verse 90:14": "Veya",
                            "verse 90:15": "açlık gününde yemek yedirmektir,",
                            "verse 90:16": "Yakınlığı",
                            "verse 90:17": "olan bir yetime",
                            "verse 90:18": "Veya",
                            "verse 90:19": "hiçbir şeyi olmayan yoksula.",
                            "verse 90:20": "Sonra iman edenlerden, birbirlerine sabrı tavsiye edenlerden ve birbirlerine acımayı öğütleyenlerden olmaktır.",
                            "verse 90:21": "İşte bunlar sağdakilerdir.",
                            "verse 90:22": "Ayetlerimizi inkâr edenler ise işte onlar soldakilerdir,",
                            "verse 90:23": "Cezaları, kapıları üzerlerine sımsıkı kapatılmış bir ateştir."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "ہمیں اس شہر (مکہ) کی قسم",
                            "verse 90:2": "ميں اس شہر (مکہ) کي قَسم کھاتا ہوںo",
                            "verse 90:3": "(اے حبيبِ مکرّم!) اس لئے کہ آپ اس شہر ميں تشريف فرما ہيں?o? يہ ترجمہ “لا زائدہ” کے اعتبار سے ہے? لا “نفئ صحيح” کے لئے ہو تو ترجمہ يوں ہوگا: ميں (اس وقت) اس شہر کي قَسم نہيں کھاؤں گا (اے حبيب!) جب آپ اس شہر سے رخصت ہو جائيں گے?",
                            "verse 90:4": "اور تم اسی شہر میں تو رہتے ہو",
                            "verse 90:5": "اور باپ (یعنی آدم) اور اس کی اولاد کی قسم",
                            "verse 90:6": "(اے حبيبِ مکرّم! آپ کے) والد (آدم يا ابراہيم عليہما السلام) کي قَسم اور (ان کي) قَسم جن کي ولادت ہوئي?o? يعني آدم عليہ السلام کي ذريّتِ صالحہ يا آپ ہي کي ذات گرامي جن کے باعث يہ شہرِ مکہ بھي لائقِ قَسم ٹھہرا ہے?",
                            "verse 90:7": "بيشک ہم نے انسان کو مشقت ميں (مبتلا رہنے والا) پيدا کيا ہےo",
                            "verse 90:8": "کہ ہم نے انسان کو تکلیف (کی حالت) میں (رہنے والا) بنایا ہے",
                            "verse 90:9": "کیا وہ خیال رکھتا ہے کہ اس پر کوئی قابو نہ پائے گا",
                            "verse 90:10": "کيا وہ يہ گمان کرتا ہے کہ اس پر ہرگز کوئي بھي قابو نہ پا سکے گا؟o",
                            "verse 90:11": "وہ (بڑے فخر سے) کہتا ہے کہ ميں نے ڈھيروں مال خرچ کيا ہےo",
                            "verse 90:12": "کہتا ہے کہ میں نے بہت سا مال برباد کیا",
                            "verse 90:13": "کیا اسے یہ گمان ہے کہ اس کو کسی نے دیکھا نہیں",
                            "verse 90:14": "کيا وہ يہ خيال کرتا ہے کہ اسے (يہ فضول خرچياں کرتے ہوئے) کسي نے نہيں ديکھاo",
                            "verse 90:15": "کيا ہم نے اس کے لئے دو آنکھيں نہيں بنائيںo",
                            "verse 90:16": "بھلا ہم نیاس کو دو آنکھیں نہیں دیں؟",
                            "verse 90:17": "اور زبان اور دو ہونٹ (نہیں دیئے)",
                            "verse 90:18": "اور (اسے) ايک زبان اور دو ہونٹ (نہيں دئيے)o",
                            "verse 90:19": "اور ہم نے اسے (خير و شر کے) دو نماياں راستے (بھي) دکھا ديئےo",
                            "verse 90:20": "(یہ چیزیں بھی دیں) اور اس کو (خیر و شر کے) دونوں رستے بھی دکھا دیئے",
                            "verse 90:21": "مگر وہ گھاٹی پر سے ہو کر نہ گزرا",
                            "verse 90:22": "وہ تو (دينِ حق اور عملِ خير کي) دشوار گزار گھاٹي ميں داخل ہي نہيں ہواo",
                            "verse 90:23": "اور آپ کيا سمجھے ہيں کہ وہ (دينِ حق کے مجاہدہ کي) گھاٹي کيا ہےo",
                            "verse 90:24": "اور تم کیا سمجھے کہ گھاٹی کیا ہے؟",
                            "verse 90:25": "کسی (کی) گردن کا چھڑانا",
                            "verse 90:26": "وہ (غلامي و محکومي کي زندگي سے) کسي گردن کا آزاد کرانا ہےo",
                            "verse 90:27": "يا بھوک والے دن (يعني قحط و اَفلاس کے دور ميں غريبوں اور محروم المعيشت لوگوں کو) کھانا کھلانا ہے (يعني ان کے معاشي تعطل اور ابتلاء کو ختم کرنے کي جدّ و جہد کرنا ہے)o",
                            "verse 90:28": "یا بھوک کے دن کھانا کھلانا",
                            "verse 90:29": "یتیم رشتہ دار کو",
                            "verse 90:30": "قرابت دار يتيم کوo",
                            "verse 90:31": "يا شديد غربت کے مارے ہوئے محتاج کو جو محض خاک نشين (اور بے گھر) ہےo",
                            "verse 90:32": "یا فقیر خاکسار کو",
                            "verse 90:33": "پھر ان لوگوں میں بھی (داخل) ہو جو ایمان لائے اور صبر کی نصیحت اور (لوگوں پر) شفقت کرنے کی وصیت کرتے رہے",
                            "verse 90:34": "پھر (شرط يہ ہے کہ ايسي جدّ و جہد کرنے والا) وہ شخص ان لوگوں ميں سے ہو جو ايمان لائے ہيں اور ايک دوسرے کو صبر و تحمل کي نصيحت کرتے ہيں اور باہم رحمت و شفقت کي تاکيد کرتے ہيںo",
                            "verse 90:35": "يہي لوگ دائيں طرف والے (يعني اہلِ سعادت و مغفرت) ہيںo",
                            "verse 90:36": "یہی لوگ صاحب سعادت ہیں",
                            "verse 90:37": "اور جنہوں نے ہماری آیتوں کو نہ مانا وہ بدبخت ہیں",
                            "verse 90:38": "اور جن لوگوں نے ہماري آيتوں کا انکار کيا وہ بائيں طرف والے ہيں (يعني اہلِ شقاوت و عذاب) ہيںo",
                            "verse 90:39": "ان پر (ہر طرف سے) بند کي ہوئي آگ (چھائي) ہوگيo",
                            "verse 90:40": "یہ لوگ آگ میں بند کر دیئے جائیں گے ہوگيo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 90:1": "Мана шу шаҳар билан қасам.",
                            "verse 90:2": "Сен муқим турган бу шаҳарла.",
                            "verse 90:3": "Ва волид ва ундан тарқаган валадлар билан қасам.",
                            "verse 90:4": "Батаҳқиқ, Биз инсонни машаққатда яратдик.",
                            "verse 90:5": "У инсон унга ҳеч кимнинг кучи етмайди, деб ҳисоблайдими?",
                            "verse 90:6": "У, кўплаб мол-дунё нафақа қилдим, дейдир.",
                            "verse 90:7": "У инсон уни биров кўрмади, деб ўйлайдими?",
                            "verse 90:8": "Биз унга икки кўзни бермадикми?",
                            "verse 90:9": "Ва тилни ва икки лабни (бермадикми?)",
                            "verse 90:10": "Ва Биз уни икки: (яхши ва ёмон) йўлга йўллаб қўйдик.",
                            "verse 90:11": "Бас, у довон ошиб ўтмади.",
                            "verse 90:12": "Довон қандоқ нарса эканини сенга нима билдирди?",
                            "verse 90:13": "У қул озод қилишдир.",
                            "verse 90:14": "Ёки очарчилик кунида таом беришдир.",
                            "verse 90:15": "Қариндош етимларга.",
                            "verse 90:16": "Ёки тупроққа қориган мискинларга.",
                            "verse 90:17": "Сўнгра иймон келтирганлар ва бир-бирини сабрга, меҳр-шафқатга чақирганлар бўлса.",
                            "verse 90:18": "Ана ўшалар ўнг томон эгаларидир.",
                            "verse 90:19": "Оятларимизга куфр келтирганлар, улар, чап томон эгаларидир.",
                            "verse 90:20": "Уларни чиқиб бўлмайдиган ўт-олов ўраб олгандир."
                        }
                    }
                }
            }
        }
    }
}