{
    "id": 92,
    "name_simple": "Al-Layl",
    "revelation_place": "makkah",
    "revelation_order": 9,
    "bismillah_pre": true,
    "verses_count": 21,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from the word wal-lail with which it opens.",
    "text": [
        "\n",
        "The Surah takes its name from the word wal-lail with which it opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its subject matter so closely resembles that of Surah Ash-Shams that each Surah seems to be an explanation of the other. It is one and the same thing which has been explained in Surah Ash-Shams in one way and in this Surah in another. This indicates that both these Surahs were sent down in about the same period.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to distinguish between the two different ways of life and to explain the contrast between their ultimate ends and results. In view of the subject matter this Surah consists of two parts, the first part consisting of vv. 1-11 and the second of vv. 12-21.",
        "\n",
        "In the first part, at the outset it has been pointed out that the strivings and doings that the individuals, nations and groups of mankind are engaged in in the world, are, in respect of their moral nature, as divergent as the day is from the night, and the male from the female. After this, according to the general style of the brief Surahs of the Quran, three moral characteristics of one kind and three moral characteristics of the other kind have been presented as an illustration from among a vast collection of the strivings and activities of man, from which every man can judge which style of life is represented by one kind of the characteristics and which style of life by the other kind. Both these styles have been described in such brief, elegant. and pithy sentences that they move the heart and go down into memory as soon as one hears them. Characteristics of the first kind are that one should spend one's wealth, adopt God-consciousness and piety, and acknowledge the good as\r\ngood. The second kind of the characteristics are that one should be miserly, should least care for God's pleasure and His displeasure, and should repudiate what is good and right. Then it has been stated that these two modes of action which are clearly divergent, cannot be equal and alike in respect of their results. But, just as they are divergent in their nature, so they are divergent in their results. The person (or group of persons) who adopts the first mode of action, Allah will make easy for him the correct way of life, so much so that doing good will become easy for him and doing evil difficult. On the contrary, he who adopts the second mode of life, Allah will make easy for him the difficult and hard way of life, so much so that doing evil will become easy for him and doing good difficult. This passage has been concluded with a most effective and touching sentence, saying: \"This worldly wealth for the sake of which man is even prepared to risk his life will not go down with\r\nhim into the grave; therefore, what will it avail him after death?\"",
        "\n",
        "In the second part also three truths have been stated equally briefly. First, that Allah has not left man uninformed in the examination hall of the world, but He has taken on Himself the responsibility to tell him which one is the straight and right way out of the different ways of life. Here, there was no need to point out that by sending His Messenger and His Book He has fulfilled His this responsibility, for both the Messenger and the Book were present to afford the guidance. Second, that the Master of both the world and the Hereafter is Allah alone. If you seek the world, it is He Who will give it, and if you seek the Hereafter, again it is He Who will give it. Now, it is for you to decide what you should seek from Him. The third truth that has been stated is that the wretched one who rejects the good, which is being presented through the Messenger and the Book, and turns away from it, will have a blazing fire ready for him. As for the God fearing person who spends his\r\nwealth in a good cause, without any selfish motive, only for the sake of winning his Lord's good pleasure, his Lord will be pleased with him and will bless him with so much that he will be well pleased with Him.",
        "\n"
    ],
    "description": "The surah that opens with the oath of the Divine One swearing by the whelming of The Night that swathes the world in darkness. It is named after “the night” (al-layl), mentioned in verse 1. The surah shows the consequences of the paths people choose and emphasizing God’s guidance and warning.",
    "name_translation": "THE NIGHT",
    "name_complex": "Al-Layl",
    "surah_name_ar": "الليل",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 92:1": "Betohem në natën që e mbulon terri,",
                            "verse 92:2": "dhe ditën që agon,",
                            "verse 92:3": "dhe që ka krijuar mashkullin dhe femrën –",
                            "verse 92:4": "me të vërtetë, veprat tuaja janë të ndryshme:",
                            "verse 92:5": "atij që jep (për bamirës) dhe ruhet (prej gabimeve)",
                            "verse 92:6": "dhe i cili dëshmon (vërteton) atë që është më e bukur (besimin)",
                            "verse 92:7": "Na, atij do t’ia lehtësojmë rrugën e lumturisë (xhennetit);",
                            "verse 92:8": "kurse atij që është koprrac dhe e konsideron veten të pavarur (nga Zoti),",
                            "verse 92:9": "dhe e përgënjeshtron atë më të bukurën (besimin),",
                            "verse 92:10": "Na, atij, do t’ia lehtësojmë rrugën e rëndë (skëterrës),",
                            "verse 92:11": "e kur të hedhet (në varr), pasuria e tij nuk do t’i bën dobi.",
                            "verse 92:12": "Neve na përket, që ta tregojmë rrugën e drejtë,",
                            "verse 92:13": "dhe, me të vërtetë, e Jona është ajo botë dhe kjo botë!",
                            "verse 92:14": "Andaj Unë, ju kam tërhequr vërejtjen me zjarrin që ndizet,",
                            "verse 92:15": "në të cilin do të hidhet vetëm më i keqi,",
                            "verse 92:16": "i cili ka përgënjeshtruar dhe është larguar nga besimi;",
                            "verse 92:17": "e do të jetë larg nga ai (zjarri), ai që i druan Perëndisë,",
                            "verse 92:18": "ai që ndanë nga pasuria e tij, duke e pastruar veten (nga të këqiat),",
                            "verse 92:19": "e nuk e jep atë – për t’ia kthyer ndokush,",
                            "verse 92:20": "por vetëm që të fitojë kënaqësinë e Zotit të tij të Lartëmadhërueshëm,",
                            "verse 92:21": "dhe ai, me siguri, do të jetë i kënaqur! Lartëmadhërueshëm,"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "And olsun (aləmi zülmətə) bürüməkdə olan gecəyə;",
                            "verse 92:2": "And olsun işıqlanmaqda olan gündüzə;",
                            "verse 92:3": "And olsun kişini və qadını (erkəyi və dişini) yaradana ki,",
                            "verse 92:4": "Sizin zəhmətiniz (ey insanlar!) cürbəcürdür! (Bə'ziniz Cənnət üçün, bə'ziniz isə Cəhənnəm üçün çalışırsınız).",
                            "verse 92:5": "Kim (malını Allah yolunda) versə, (Allahdan) qorxsa,",
                            "verse 92:6": "Və ən gözəl sözü (la ilahə illallah kəlməsini) təsdiq etsə,",
                            "verse 92:7": "Biz ona ən asan olanı (Cənnəti) müyəssər edəcəyik!",
                            "verse 92:8": "Amma kim (malını Allah yolunda xərcləməyə) xəsislik etsə, (mal-dövlətinə güvənib Allaha) möhtac olmadığını sansa,",
                            "verse 92:9": "Və ən gözəl sözü (la ilahə illallah kəlməsini) yalan saysa,",
                            "verse 92:10": "Biz ona ən çətin olanı (Cəhənnəmi) müyəssər edəcəyik (onu Cəhənnəm üçün hazırlayacağıq!)",
                            "verse 92:11": "(O, Cəhənnəmə) düşəcəyi zaman mal-dövləti ona heç bir fayda verməz.",
                            "verse 92:12": "Bizim öhdəmizə düşən yalnız doğru yolu göstərməkdir! (Mö'min və ya kafir olmaq isə hər kəsin öz işidir).",
                            "verse 92:13": "Axirət də Bizim, dünya da Bizimdir!",
                            "verse 92:14": "(Ey insanlar!) Mən sizi alovlanan bir atəşlə qorxutdum.",
                            "verse 92:15": "Ora ancaq azğın (kafir) daxil olar.",
                            "verse 92:16": "O kimsə ki, (haqqı) yalan sayar, (imandan) üz döndərər!",
                            "verse 92:17": "Allahdan qorxub pis əməllərdən çəkinən isə ondan uzaqlaşdırılar (nicat tapar).",
                            "verse 92:18": "O kimsə ki, malını (Allah yolunda) verib (günahlardan) təmizlənər,",
                            "verse 92:19": "O şəxsin boynunda heç kəsin bir minnəti (ne'məti) yoxdur ki, onun əvəzi verilsin (etdiyi yaxşılıq ona əvəz olsun; və ya: o, etdiyi yaxşılıq müqabilində heç kəsdən bir mükafat gözləməz).",
                            "verse 92:20": "O ancaq ən uca olan Rəbbinin rizasını qazanmaq üçün belə edər.",
                            "verse 92:21": "And olsun ki, o (öz Rəbbindən Cənnətdə ona verəcəyi ne'mətlərə görə) razı olacaqdır!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Tako mi noći kada tmine razastre,",
                            "verse 92:2": "i dana kad svane,",
                            "verse 92:3": "i Onoga koji muško i žensko stvara -",
                            "verse 92:4": "vaš trud je, zaista, različit:",
                            "verse 92:5": "onome koji udjeljuje i ne griješi",
                            "verse 92:6": "i ono najljepše smatra istinitim -",
                            "verse 92:7": "njemu ćemo Džennet pripremiti;",
                            "verse 92:8": "a onome koji tvrdiči i osjeća se neovisnim",
                            "verse 92:9": "i ono najljepše smatra lažnim -",
                            "verse 92:10": "njemu ćemo Džehennem pripremiti,",
                            "verse 92:11": "i bogatstvo njegovo mu, kad se strovali, neće koristiti.",
                            "verse 92:12": "Mi smo dužni ukazati na Pravi put,",
                            "verse 92:13": "i jedino Nama pripada i onaj i ovaj svijet!",
                            "verse 92:14": "Zato vas opominjem razbuktalom vatrom,",
                            "verse 92:15": "u koju će ući samo nesretnik,",
                            "verse 92:16": "onaj koji bude poricao i glavu okretao,",
                            "verse 92:17": "a od nje će daleko biti onaj koji se bude Allaha bojao,",
                            "verse 92:18": "onaj koji bude dio imetka svoga udjeljivao, da bi se očistio,",
                            "verse 92:19": "ne očekujući da mu se zahvalnošću uzvrati,",
                            "verse 92:20": "već jedino da bi naklonost Gospodara svoga Svevišnjeg stekao,",
                            "verse 92:21": "i on će, zbilja, zadovoljan biti! stekao,"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "শপথ রাত্রির, যখন সে আচ্ছন্ন করে,",
                            "verse 92:2": "শপথ দিনের, যখন সে আলোকিত হয়",
                            "verse 92:3": "এবং তাঁর, যিনি নর ও নারী সৃষ্টি করেছেন,",
                            "verse 92:4": "নিশ্চয় তোমাদের কর্ম প্রচেষ্টা বিভিন্ন ধরনের।",
                            "verse 92:5": "অতএব, যে দান করে এবং খোদাভীরু হয়,",
                            "verse 92:6": "এবং উত্তম বিষয়কে সত্য মনে করে,",
                            "verse 92:7": "আমি তাকে সুখের বিষয়ের জন্যে সহজ পথ দান করব।",
                            "verse 92:8": "আর যে কৃপণতা করে ও বেপরওয়া হয়",
                            "verse 92:9": "এবং উত্তম বিষয়কে মিথ্যা মনে করে,",
                            "verse 92:10": "আমি তাকে কষ্টের বিষয়ের জন্যে সহজ পথ দান করব।",
                            "verse 92:11": "যখন সে অধঃপতিত হবে, তখন তার সম্পদ তার কোনই কাজে আসবে না।",
                            "verse 92:12": "আমার দায়িত্ব পথ প্রদর্শন করা।",
                            "verse 92:13": "আর আমি মালিক ইহকালের ও পরকালের।",
                            "verse 92:14": "অতএব, আমি তোমাদেরকে প্রজ্বলিত অগ্নি সম্পর্কে সতর্ক করে দিয়েছি।",
                            "verse 92:15": "এতে নিতান্ত হতভাগ্য ব্যক্তিই প্রবেশ করবে,",
                            "verse 92:16": "যে মিথ্যারোপ করে ও মুখ ফিরিয়ে নেয়।",
                            "verse 92:17": "এ থেকে দূরে রাখা হবে খোদাভীরু ব্যক্তিকে,",
                            "verse 92:18": "যে আত্নশুদ্ধির জন্যে তার ধন-সম্পদ দান করে।",
                            "verse 92:19": "এবং তার উপর কারও কোন প্রতিদানযোগ্য অনুগ্রহ থাকে না।",
                            "verse 92:20": "তার মহান পালনকর্তার সন্তুষ্টি অন্বেষণ ব্যতীত।",
                            "verse 92:21": "সে সত্বরই সন্তুষ্টি লাভ করবে। ব্যতীত।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 92:1": "Кълна се в нощта, когато се спуска",
                            "verse 92:2": "и в деня, когато засиява,",
                            "verse 92:3": "и в Онзи, Който е сътворил мъжа и жената, -",
                            "verse 92:4": "вашите стремежи са различни!",
                            "verse 92:5": "Който раздава и се бои,",
                            "verse 92:6": "и вярва в Най-прекрасното,",
                            "verse 92:7": "ще го улесним към лесното.",
                            "verse 92:8": "А който е скъперник и пренебрегва,",
                            "verse 92:9": "и взима за лъжа Най-прекрасното,",
                            "verse 92:10": "ще го улесним към трудното",
                            "verse 92:11": "и не ще го избави неговото богатство, когато пропадне.",
                            "verse 92:12": "Наша грижа е напътването.",
                            "verse 92:13": "На Нас принадлежи и отвъдното, и настоящето.",
                            "verse 92:14": "И ви предупредих за Огъня пламтящ.",
                            "verse 92:15": "Ще гори в него само злият,",
                            "verse 92:16": "който отрича и се отвръща.",
                            "verse 92:17": "И ще бъде предпазен от него богобоязливият,",
                            "verse 92:18": "който раздава своето богатство, за да се пречисти,",
                            "verse 92:19": "на никого не прави благодеяние, за да бъде възнаграден,",
                            "verse 92:20": "а само в стремеж към Лика на своя Господ, Върховния.",
                            "verse 92:21": "И непременно ще е доволен."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "以籠罩時的黑夜發誓，",
                            "verse 92:2": "以顯著時的白晝發誓，",
                            "verse 92:3": "以創造男性和女性的主發誓，",
                            "verse 92:4": "你們的行為，確是不同的。",
                            "verse 92:5": "至於賑濟貧民，敬畏真主，",
                            "verse 92:6": "且承認至善者，",
                            "verse 92:7": "我將使他易於達到最易的結局。",
                            "verse 92:8": "至於吝惜錢財，自謂無求，",
                            "verse 92:9": "且否認至善者，",
                            "verse 92:10": "我將使他易於達到最難的結局。",
                            "verse 92:11": "當他淪亡的時候，他的財產於他有什麼裨益呢！",
                            "verse 92:12": "我確有指導的責任，",
                            "verse 92:13": "我確有後世和今世的主權。",
                            "verse 92:14": "故我警告你們一種發焰的火，",
                            "verse 92:15": "唯薄命者墜入其中，",
                            "verse 92:16": "他否認真理，而背棄之。",
                            "verse 92:17": "敬畏者，得免於火刑。",
                            "verse 92:18": "他虔誠地施捨他的財產，",
                            "verse 92:19": "他沒有受過任何人的應報的恩德，",
                            "verse 92:20": "但他施捨只是為了求他的至尊主的喜悅，",
                            "verse 92:21": "他自己將來必定喜悅。 但他施捨只是為了求他的至尊主的喜悅，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Při noci, když temnem zahaluje,",
                            "verse 92:2": "při dni, když v slávě se objevuje,",
                            "verse 92:3": "při tom, jenž stvořil mužské i ženské pohlaví,",
                            "verse 92:4": "rozdílné je věru vaše snažení!",
                            "verse 92:5": "Co týče se toho, jenž rozdával a Boha se bál",
                            "verse 92:6": "a za pravdivou nejkrásnější odměnu pokládal,",
                            "verse 92:7": "tomu usnadníme přístup ke snadnému.",
                            "verse 92:8": "Však co se týče toho, kdo lakotil a za soběstačného se vydával",
                            "verse 92:9": "a nejkrásnější odměnu za lež pokládal,",
                            "verse 92:10": "tomu ulehčíme přístup do nesnází,",
                            "verse 92:11": "a co pomůže mu jmění jeho, až dořítí se do své zkázy?",
                            "verse 92:12": "Nám věru přísluší správné vedení,",
                            "verse 92:13": "Vždyť Nám patří život první i poslední!",
                            "verse 92:14": "Já varuji vás před ohněm jasně šlehajícím,",
                            "verse 92:15": "v němž hořet bude jen ten nejbídnější,",
                            "verse 92:16": "jenž za lež to pokládal a zády se obracel.",
                            "verse 92:17": "Však vzdálen bude od něho bohabojný,",
                            "verse 92:18": "jenž ze jmění svého dával, aby čistým se stal,",
                            "verse 92:19": "a dobrodiní neprokazoval jen proto, aby byl odměněn,",
                            "verse 92:20": "leč jen z touhy po tváři Pána svého nejvyššího to konal.",
                            "verse 92:21": "A ten věru bude spokojen."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Bij de nacht als hij bedekt.",
                            "verse 92:2": "En bij de dag wanneer hij schittert,",
                            "verse 92:3": "En bij de schepping van man en vrouw.",
                            "verse 92:4": "Voorzeker, uw streven is verschillend.",
                            "verse 92:5": "Wat hem betreft die geeft en God vreest,",
                            "verse 92:6": "En het goede aanvaardt,",
                            "verse 92:7": "Wij zullen zijn weg effenen tot welslagen.",
                            "verse 92:8": "Maar hij, die vrekkig en onverschillig is,",
                            "verse 92:9": "En het beste verwerpt,",
                            "verse 92:10": "Wij zullen hem naar moeilijkheden leiden.",
                            "verse 92:11": "Wanneer hij te gronde gaat zullen zijn rijkdommen hem niet baten.",
                            "verse 92:12": "Voorwaar, het is aan Ons om te leiden.",
                            "verse 92:13": "En aan Ons is het Hiernamaals en ook deze wereld.",
                            "verse 92:14": "Daarom waarschuw Ik u voor het laaiend Vuur;",
                            "verse 92:15": "Niemand zal er binnengaan dan de rampzaligste,",
                            "verse 92:16": "Die loochent en zich afwendt.",
                            "verse 92:17": "Maar de rechtvaardige zal ver daarvan verwijderd worden.",
                            "verse 92:18": "Die zijn rijkdommen weggeeft om zich te louteren.",
                            "verse 92:19": "En niemand heeft Hem een gunst bewezen waarvoor hij moet worden beloond.",
                            "verse 92:20": "Maar hij die het welbehagen zoekt van zijn Heer, de Verhevene,",
                            "verse 92:21": "Weldra zal hij tevreden zijn."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 92:1": "By the night enshrouding",
                            "verse 92:2": "And the day resplendent",
                            "verse 92:3": "And Him Who hath created male and female,",
                            "verse 92:4": "Lo! your effort is dispersed (toward divers ends).",
                            "verse 92:5": "As for him who giveth and is dutiful (toward Allah)",
                            "verse 92:6": "And believeth in goodness;",
                            "verse 92:7": "Surely We will ease his way unto the state of ease.",
                            "verse 92:8": "But as for him who hoardeth and deemeth himself independent,",
                            "verse 92:9": "And disbelieveth in goodness;",
                            "verse 92:10": "Surely We will ease his way unto adversity.",
                            "verse 92:11": "His riches will not save him when he perisheth.",
                            "verse 92:12": "Lo! Ours it is (to give) the guidance",
                            "verse 92:13": "And lo! unto Us belong the latter portion and the former.",
                            "verse 92:14": "Therefor have I warned you of the flaming Fire",
                            "verse 92:15": "Which only the most wretched must endure,",
                            "verse 92:16": "He who denieth and turneth away.",
                            "verse 92:17": "Far removed from it will be the righteous",
                            "verse 92:18": "Who giveth his wealth that he may grow (in goodness).",
                            "verse 92:19": "And none hath with him any favour for reward,",
                            "verse 92:20": "Except as seeking (to fulfil) the purpose of his Lord Most High.",
                            "verse 92:21": "He verily will be content."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 92:1": "By the Night as it conceals (the light);",
                            "verse 92:2": "By the Day as it appears in glory;",
                            "verse 92:3": "By (the mystery of) the creation of male and female;-",
                            "verse 92:4": "Verily, (the ends) ye strive for are diverse.",
                            "verse 92:5": "So he who gives (in charity) and fears (God),",
                            "verse 92:6": "And (in all sincerity) testifies to the best,-",
                            "verse 92:7": "We will indeed make smooth for him the path to Bliss.",
                            "verse 92:8": "But he who is a greedy miser and thinks himself self-sufficient,",
                            "verse 92:9": "And gives the lie to the best,-",
                            "verse 92:10": "We will indeed make smooth for him the path to Misery;",
                            "verse 92:11": "Nor will his wealth profit him when he falls headlong (into the Pit).",
                            "verse 92:12": "Verily We take upon Ourselves to guide,",
                            "verse 92:13": "And verily unto Us (belong) the End and the Beginning.",
                            "verse 92:14": "Therefore do I warn you of a Fire blazing fiercely;",
                            "verse 92:15": "None shall reach it but those most unfortunate ones",
                            "verse 92:16": "Who give the lie to Truth and turn their backs.",
                            "verse 92:17": "But those most devoted to God shall be removed far from it,-",
                            "verse 92:18": "Those who spend their wealth for increase in self-purification,",
                            "verse 92:19": "And have in their minds no favour from anyone for which a reward is expected in return,",
                            "verse 92:20": "But only the desire to seek for the Countenance of their Lord Most High;",
                            "verse 92:21": "And soon will they attain (complete) satisfaction."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 92:1": "By the night enshrouding",
                            "verse 92:2": "and the day in splendour",
                            "verse 92:3": "and That which created the male and the female,",
                            "verse 92:4": "surely your striving is to diverse ends.",
                            "verse 92:5": "As for him who gives and is godfearing",
                            "verse 92:6": "and confirms the reward most fair,",
                            "verse 92:7": "We shall surely ease him to the Easing.",
                            "verse 92:8": "But as for him who is a miser, and self-sufficient,",
                            "verse 92:9": "and cries lies to the reward most fair,",
                            "verse 92:10": "We shall surely ease him to the Hardship;",
                            "verse 92:11": "his wealth shall not avail him when he perishes.",
                            "verse 92:12": "Surely upon Us rests the guidance,",
                            "verse 92:13": "and to Us belong the Last and the First.",
                            "verse 92:14": "Now I have warned you of a Fire that flames,",
                            "verse 92:15": "whereat none but the most wretched shall be roasted,",
                            "verse 92:16": "even he who cried lies, and turned away;",
                            "verse 92:17": "and from which the most godfearing shall be removed,",
                            "verse 92:18": "even he who gives his wealth.",
                            "verse 92:19": "and confers no favour on any man for recompense,",
                            "verse 92:20": "only seeking the Face of his Lord the Most High;",
                            "verse 92:21": "and he shall surely be satisfied."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 92:1": "CONSIDER the night as it veils [the earth] in darkness,",
                            "verse 92:2": "and the day as it rises bright!",
                            "verse 92:3": "Consider the creation of the male and the female!",
                            "verse 92:4": "Verily, [O men,] you aim at most divergent ends!",
                            "verse 92:5": "Thus, as for him who gives [to others] and is conscious of God,",
                            "verse 92:6": "and believes in the truth of the ultimate good –",
                            "verse 92:7": "for him shall We make easy the path towards",
                            "verse 92:8": "ease.",
                            "verse 92:9": "But as for him who is niggardly, and thinks that he is self-sufficient,",
                            "verse 92:10": "and calls the ultimate good a lie –",
                            "verse 92:11": "for him shall We make easy the path towards hardship:",
                            "verse 92:12": "and what will his wealth avail him when he goes down [to his grave]?",
                            "verse 92:13": "BEHOLD, it is indeed for Us to grace",
                            "verse 92:14": "with guidance;",
                            "verse 92:15": "and, behold, Ours is [the dominion over] the life to come as well as",
                            "verse 92:16": "this earlier part [of your life]:",
                            "verse 92:17": "and so I warn you of the raging fire –",
                            "verse 92:18": "[the fire] which none shall have to endure but that most hapless wretch",
                            "verse 92:19": "who gives the lie to the truth and turns away [from it].",
                            "verse 92:20": "For distant from it shall remain he who is truly conscious of God:",
                            "verse 92:21": "he that spends his possessions [on others] so that he might grow in purity –",
                            "verse 92:22": "not as payment for favours received,",
                            "verse 92:23": "but only out of a longing for the countenance of his Sustainer, the All-Highest:",
                            "verse 92:24": "and such, indeed, shall in time be well-pleased."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 92:1": "I swear by the night when it covers (the sun),",
                            "verse 92:2": "and by the day when it unveils itself,",
                            "verse 92:3": "and by the One who created the male and the female,",
                            "verse 92:4": "your efforts are diverse:",
                            "verse 92:5": "As for the one who gives (in charity) and fears Allah,",
                            "verse 92:6": "and believes in the best (religion),",
                            "verse 92:7": "We will facilitate for him the way to extreme ease (i.",
                            "verse 92:8": "But the one who is miser and deems himself self-sufficient,",
                            "verse 92:9": "and rejects the best (religion),",
                            "verse 92:10": "We will facilitate for him the way to extreme distress.",
                            "verse 92:11": "And his wealth will not help him when he will fall down (into Hell).",
                            "verse 92:12": "Of course, it is undertaken by Us to guide,",
                            "verse 92:13": "and in Our control is the Hereafter and the worldly life.",
                            "verse 92:14": "So I have warned you of a blazing fire.",
                            "verse 92:15": "None will enter it but the wretched one,",
                            "verse 92:16": "who rejected (the truth) and turned away (from it).",
                            "verse 92:17": "And saved from it will be the most God-fearing one,",
                            "verse 92:18": "who gives his wealth (in charity) to become purified,",
                            "verse 92:19": "while no one has conferred any favour on him for which he would give a return,",
                            "verse 92:20": "but (he gave his wealth in charity) only to seek the Countenance of his Lord, the Most High.",
                            "verse 92:21": "And surely he will soon be happy."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 92:1": "By the night as it enshrouds,",
                            "verse 92:2": "and",
                            "verse 92:3": "the day as it unveils,",
                            "verse 92:4": "and",
                            "verse 92:5": "the One Who created the male and the female.",
                            "verse 92:6": "Assuredly your efforts are dissimilar.",
                            "verse 92:7": "As for him who gives and is fearful,",
                            "verse 92:8": "and affirms the truth of the best ,",
                            "verse 92:9": "We shall surely ease his way to [the abode of] ease.",
                            "verse 92:10": "But as for him who is niggardly, and deems himself self-sufficient,",
                            "verse 92:11": "and denies the best ,",
                            "verse 92:12": "We shall surely ease his way to hardship;",
                            "verse 92:13": "And his wealth shall not avail him when he perishes.",
                            "verse 92:14": "Truly with Us lies",
                            "verse 92:15": "guidance.",
                            "verse 92:16": "And truly to Us belong the Hereafter and the first .",
                            "verse 92:17": "So I have warned you of a raging fire,",
                            "verse 92:18": "which none shall enter but the wretched one",
                            "verse 92:19": "he who denies and turns away.",
                            "verse 92:20": "The God-fearing one shall be spared it,",
                            "verse 92:21": "he who gives his wealth to purify himself,",
                            "verse 92:22": "and no one has any favour",
                            "verse 92:23": "with him that must be requited;",
                            "verse 92:24": "but only seeking the pleasure of his Lord the Most High;",
                            "verse 92:25": "and verily",
                            "verse 92:26": "he shall",
                            "verse 92:27": "be pleased."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 92:1": "By the night when it covers up (and conceals everything in its darkness),",
                            "verse 92:2": "And by the day when it brightens up,",
                            "verse 92:3": "And by that Being Who created male and female (in everything),",
                            "verse 92:4": "Indeed, your striving is different (and singular).",
                            "verse 92:5": "So he who gives away (his wealth in the way of Allah) and commits himself to piousness,",
                            "verse 92:6": "And affirms the good (the Din )",
                            "verse 92:7": "of truth and life after death through charity and Godwariness),",
                            "verse 92:8": "Soon We shall facilitate him in seeking (Allah’s pleasure) with ease.",
                            "verse 92:9": "But he who is miser and disregards (spending in the cause of Allah),",
                            "verse 92:10": "And (in this way) denies the good (the Din )",
                            "verse 92:11": "of truth and afterlife),",
                            "verse 92:12": "Soon shall We facilitate his landing into hardship (advancing towards torment, so that punishment becomes his rightful due).",
                            "verse 92:13": "And his wealth will not help him any way when he falls into (the pit of) destruction.",
                            "verse 92:14": "Indeed, it is binding on Us to show you the path (of truth).",
                            "verse 92:15": "And indeed, We are the Master of the Hereafter and the world.",
                            "verse 92:16": "So I have warned you of the raging Fire (of Hell).",
                            "verse 92:17": "No one shall enter it but the most wretched,",
                            "verse 92:18": "He who gives lie to (the Din",
                            "verse 92:19": "of truth) and turns away (from obedience to the Messenger [blessings and peace be upon him]).",
                            "verse 92:20": "But the most pious one shall be saved from this (Fire),",
                            "verse 92:21": "Who gives his wealth away (in the cause of Allah) to attain to purity (of his soul and assets),",
                            "verse 92:22": "And who owes no favour to anyone that he is seeking to pay back.",
                            "verse 92:23": "Rather (he spends) seeking the pleasure of his Lord, Most High.",
                            "verse 92:24": "And soon shall he be well-pleased (with Allah for His bestowal and Allah with him for his fidelity)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Kautta verhoonsa vetäytyvän yön,",
                            "verse 92:2": "kautta kirkastuvan päivän,",
                            "verse 92:3": "kautta ihmisen luomisen mieheksi ja naiseksi:",
                            "verse 92:4": "totisesti ovat pyrkimyksemme erisuuntaisia.",
                            "verse 92:5": "Joka on antelias ja karttaa pahaa",
                            "verse 92:6": "sekä rakastaa hyvää,",
                            "verse 92:7": "häntä autamme vähitellen saavuttamaan onnellisen päämäärän,",
                            "verse 92:8": "mutta toisin on sen, joka on kitsas, itseänsä täynnä,",
                            "verse 92:9": "eikä hyveestä välitä,",
                            "verse 92:10": "hänen annamme vähitellen joutua pahan valtaan,",
                            "verse 92:11": "eikä hänen rikkautensa hyödytä häntä vähääkään, kun hänet tuhotaan.",
                            "verse 92:12": "Totisesti on Meistä lähtöisin ohjaus oikealle tielle,",
                            "verse 92:13": "Meidän on varmasti sekä tulevaisuus että menneisyys,",
                            "verse 92:14": "sentähden olen varoittanut teitä leimuavasta tulesta,",
                            "verse 92:15": "johon joutuvat vain pahat,",
                            "verse 92:16": "jotka vääristelevät totuutta ja kääntävät sille selkänsä.",
                            "verse 92:17": "Mutta Jumalaa pelkäävä pelastuu siitä,",
                            "verse 92:18": "hän, joka antaa pois rikkautensa puhdistuakseen,",
                            "verse 92:19": "eikä tee hyvää palkkion toivossa,",
                            "verse 92:20": "vaan etsiäkseen Herransa, korkeimman, mielisuosiota.",
                            "verse 92:21": "Totisesti, hän on aikanaan saava palkintonsa."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 92:1": "Par la nuit, quand elle occulte !",
                            "verse 92:2": "Par le jour, quand il irradie !",
                            "verse 92:3": "Par ce qu'Il a créé : le mâle et la femelle !",
                            "verse 92:4": "Certes, vos efforts sont divergents :",
                            "verse 92:5": "à celui qui fait l'aumône et craint Dieu,",
                            "verse 92:6": "et qui déclare véridique le souverain Bien,",
                            "verse 92:7": "Nous faciliterons l'accès au bonheur.",
                            "verse 92:8": "Quant à l'avare qui se veut bien pourvu,",
                            "verse 92:9": "et qui nie l'existence du souverain Bien,",
                            "verse 92:10": "Nous lui faciliterons l'accès au malheur.",
                            "verse 92:11": "Ses richesses ne lui serviront de rien lorsqu'il périra.",
                            "verse 92:12": "Certes, c'est à Nous qu'incombe la Guidance,",
                            "verse 92:13": "et c'est à Nous qu'appartiennent la vie dernière et la vie présente !",
                            "verse 92:14": "Je vous ai donc avertis d'un Feu ardent",
                            "verse 92:15": "où ne brûlera que le réprouvé,",
                            "verse 92:16": "celui qui crie au mensonge et qui se détourne.",
                            "verse 92:17": "Mais en sera préservé celui qui craint Dieu,",
                            "verse 92:18": "celui qui donne de son bien pour se purifier.",
                            "verse 92:19": "Nul auprès de Lui ne sera récompensé par un bienfait,",
                            "verse 92:20": "sinon celui qui aura recherché la Face de son Seigneur le Très-Haut :",
                            "verse 92:21": "alors, enfin, il obtiendra satisfaction."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 92:1": "Par la nuit quand elle enveloppe tous !",
                            "verse 92:2": "Par le jour quand il éclaire !",
                            "verse 92:3": "Et par ce qu’Il a créé, mâle et femelle !",
                            "verse 92:4": "Vos efforts sont divergents.",
                            "verse 92:5": "Celui qui donne et craint (Dieu)",
                            "verse 92:6": "et déclare véridique la plus belle récompense",
                            "verse 92:7": "Nous lui faciliterons la voie au plus grand bonheur.",
                            "verse 92:8": "Et quand à celui qui est avare, se dispense (de l’adoration de Dieu),",
                            "verse 92:9": "et traite de mensonge la plus belle récompense,",
                            "verse 92:10": "Nous lui faciliterons la voie à la plus grande difficulté,",
                            "verse 92:11": "et à rien ne lui serviront ses richesses quand il sera jeté (au Feu).",
                            "verse 92:12": "C’est à Nous, certes, de guider;",
                            "verse 92:13": "à Nous appartient, certes, la vie dernière et la vie présente.",
                            "verse 92:14": "Je vous ai donc avertis d’un Feu qui flambe",
                            "verse 92:15": "où ne brûlera que le damné,",
                            "verse 92:16": "qui dément et tourne le dos;",
                            "verse 92:17": "alors qu’en sera écarté le pieux,",
                            "verse 92:18": "qui donne ses biens pour se purifier",
                            "verse 92:19": "et auprès de qui personne ne profite d’un bienfait intéressé,",
                            "verse 92:20": "mais seulement pour la recherche de La Face de son seigneur le Très-Haut .",
                            "verse 92:21": "Et certes, il sera bientôt satisfait ! ."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Bei der Nacht, wenn sie überschattet,",
                            "verse 92:2": "Und bei dem Tag, wenn er strahlend erscheint,",
                            "verse 92:3": "Und bei der Erschaffung von Mann und Weib,",
                            "verse 92:4": "Fürwahr, eure Aufgabe ist in der Tat verschieden.",
                            "verse 92:5": "Jener aber, der gibt und sich vor Unrecht hütet",
                            "verse 92:6": "Und an das Beste glaubt,",
                            "verse 92:7": "Wir wollen es ihm leicht machen.",
                            "verse 92:8": "Jener aber, der geizt und gleichgültig ist",
                            "verse 92:9": "Und das Beste leugnet,",
                            "verse 92:10": "Ihm wollen Wir den Weg zur Drangsal leicht machen.",
                            "verse 92:11": "Und sein Reichtum soll ihm nichts nützen, wenn er zugrunde geht.",
                            "verse 92:12": "Wahrlich, Uns obliegt die Führung;",
                            "verse 92:13": "Und Unser ist die kommende wie diese Welt.",
                            "verse 92:14": "Darum warne Ich euch vor einem flammenden Feuer,",
                            "verse 92:15": "Keiner soll dort eingehen als der Bösewicht,",
                            "verse 92:16": "Der da leugnet und den Rücken kehrt.",
                            "verse 92:17": "Doch weit ferne von ihm wird der Gerechte sein,",
                            "verse 92:18": "Der seinen Reichtum dahingibt, um sich zu läutern.",
                            "verse 92:19": "Und er schuldet keinem eine Gunst, die zurückgezahlt werden müßte;",
                            "verse 92:20": "Dennoch (gibt er seinen Reichtum hin) im Trachten nach dem Wohlgefallen seines Herrn, des Höchsten.",
                            "verse 92:21": "Und bald wird Er (mit ihm) wohlzufrieden sein."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "jkr dh d+le tc ¼lwjt dks½ fNik ys",
                            "verse 92:2": "vkSj fnu dh d+le tc [+kwc jkS’ku gks",
                            "verse 92:3": "vkSj ml ¼t+kr½ dh ftlus uj o eknk dks iSnk fd;k",
                            "verse 92:4": "fd cs’kd rqEgkjh dksf’k’k rjg rjg dh gS",
                            "verse 92:5": "rks ftlus l[+kkor dh vkSj vPNh ckr ¼bLyke½ dh rLnhd+ dh",
                            "verse 92:6": "rks ge mlds fy, jkgr o vklkuh",
                            "verse 92:7": "¼tUur½ ds vlckc eqg¸;k dj nsaxs",
                            "verse 92:8": "vkSj ftlus cq[+y fd;k] vkSj csijokbZ dh",
                            "verse 92:9": "vkSj vPNh ckr dks >qByk;k",
                            "verse 92:10": "rks ge mls l[+rh ¼tgUuqe½ esa igq¡pk nsaxs]",
                            "verse 92:11": "vkSj tc og gykd gksxk rks mldk eky mlds dqN Hkh dke u vk,xk",
                            "verse 92:12": "gesa jkg fn[kk nsuk t+:j gS",
                            "verse 92:13": "vkSj vk[+ksjr vkSj nqfu;k ¼nksuksa½ [+kkl gekjh pht+s gSa",
                            "verse 92:14": "rks geus rqEgsa HkM+drh gq;h vkx ls Mjk fn;k",
                            "verse 92:15": "mlesa cl ogh nkf[+ky gksxk tks cM+k cnc[+r gS",
                            "verse 92:16": "ftlus >qByk;k vkSj eq¡g Qsj fy;k vkSj tks cM+k ijgst+xkj gS",
                            "verse 92:17": "og mlls cpk fy;k tk,xk",
                            "verse 92:18": "tks viuk eky ¼[+kqnk dh jkg½ esa nsrk gS rkfd ikd gks tk,",
                            "verse 92:19": "vkSj yqRQ ;s gS fd fdlh dk ml ij dksbZ ,glku ugha ftldk mls cnyk fn;k tkrk gS",
                            "verse 92:20": "cfYd ¼og rks½ flQZ vius vkyh’kku ijojfnxkj dh [+kq’kuwnh gkfly djus ds fy, ¼nsrk gS½",
                            "verse 92:21": "vkSj og vud+jhc Hkh [+kq’k gks tk,xk lwj, ySy [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Demi malam apabila menutupi (cahaya siang),",
                            "verse 92:2": "dan siang apabila terang benderang,",
                            "verse 92:3": "dan penciptaan laki-laki dan perempuan,",
                            "verse 92:4": "sesungguhnya usaha kamu memang berbeda-beda.",
                            "verse 92:5": "Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa,",
                            "verse 92:6": "dan membenarkan adanya pahala yang terbaik (surga),",
                            "verse 92:7": "maka Kami kelak akan menyiapkan baginya jalan yang mudah.",
                            "verse 92:8": "Dan adapun orang-orang yang bakhil dan merasa dirinya cukup,",
                            "verse 92:9": "serta mendustakan pahala yang terbaik,",
                            "verse 92:10": "maka kelak Kami akan menyiapkan baginya (jalan) yang sukar.",
                            "verse 92:11": "Dan hartanya tidak bermanfaat baginya apabila ia telah binasa.",
                            "verse 92:12": "Sesungguhnya kewajiban Kami-lah memberi petunjuk,",
                            "verse 92:13": "dan sesungguhnya kepunyaan Kami-lah akhirat dan dunia.",
                            "verse 92:14": "Maka Kami memperingatkan kamu dengan neraka yang menyala-nyala.",
                            "verse 92:15": "Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka,",
                            "verse 92:16": "yang mendustakan (kebenaran) dan berpaling (dari iman).",
                            "verse 92:17": "Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu,",
                            "verse 92:18": "yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,",
                            "verse 92:19": "padahal tidak ada seorang pun memberikan suatu nikmat kepadanya yang harus dibalasnya,",
                            "verse 92:20": "tetapi (dia memberikan itu semata-mata) karena mencari keridaan Tuhannya Yang Maha Tinggi.",
                            "verse 92:21": "Dan kelak dia benar-benar mendapat kepuasan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Per la notte quando avvolge [con le sue tenebre],",
                            "verse 92:2": "per il giorno quando risplende,",
                            "verse 92:3": "per Colui che ha creato il maschio e la femmina.",
                            "verse 92:4": "Invero i vostri sforzi divergono .",
                            "verse 92:5": "A chi sarà stato generoso e timorato",
                            "verse 92:6": "e avrà attestato la verità della cosa più bella ,",
                            "verse 92:7": "faciliteremo il facile ;",
                            "verse 92:8": "a chi invece sarà stato avaro e avrà creduto di bastare a se stesso",
                            "verse 92:9": "e tacciato di menzogna la cosa più bella,",
                            "verse 92:10": "faciliteremo il difficile .",
                            "verse 92:11": "Quando precipiterà ,",
                            "verse 92:12": "a nulla gli serviranno i suoi beni!",
                            "verse 92:13": "In verità spetta a Noi la guida!",
                            "verse 92:14": "In verità a Noi appartengono l'altra vita e questa vita.",
                            "verse 92:15": "Vi ho dunque messo in guardia da un fuoco fiammeggiante,",
                            "verse 92:16": "nel quale brucerà solo il malvagio,",
                            "verse 92:17": "che avrà tacciato di menzogna e avrà girato le spalle;",
                            "verse 92:18": "mentre ne sarà preservato il timorato,",
                            "verse 92:19": "che dà dei suoi beni per purificarsi,",
                            "verse 92:20": "che a nessuno avrà fatto un bene per ottenere ricompensa,",
                            "verse 92:21": "ma solo per amore del suo Signore l'Altissimo.",
                            "verse 92:22": "Per certo sarà soddisfatto."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "覆われる夜において，",
                            "verse 92:2": "輝く昼において，",
                            "verse 92:3": "男女を創造された御方において（誓う）。",
                            "verse 92:4": "あなたがたの努力は，本当に多様（な結末）である。",
                            "verse 92:5": "それで施しをなし，主を畏れる者，",
                            "verse 92:6": "また至善を実証する者には，",
                            "verse 92:7": "われは（至福への道を）容易にしよう。",
                            "verse 92:8": "だが強欲で，自惚れている者，",
                            "verse 92:9": "至善を拒否する者には，",
                            "verse 92:10": "われは（苦難への道を）容易にするであろう。",
                            "verse 92:11": "かれが滅び去ろうとする時，その富はかれに役立たないであろう。",
                            "verse 92:12": "本当に導きはわれにあり，",
                            "verse 92:13": "来世も現世もわれに属する。",
                            "verse 92:14": "それでわれは燃え盛る業火に就いてあなたがたに警告した。",
                            "verse 92:15": "最も不幸な者でない限り，誰もそれで焼かれない。",
                            "verse 92:16": "それは（真理を）嘘であると言い背き去った者。",
                            "verse 92:17": "だが（主のために）忠誠の限りを尽した者は，それから救われ，",
                            "verse 92:18": "その富を施し，自分を清める。",
                            "verse 92:19": "また誰からも，慈悲の報酬を求めない。",
                            "verse 92:20": "一生懸命に至高者，主の御顔を請うだけである。",
                            "verse 92:21": "やがて，かれは（十分に）満足出来るであろう。 一生懸命に至高者，主の御顔を請うだけである。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "어두워지는 밤을 두고 맹세하사",
                            "verse 92:2": "빛을 비추이는 낮을 두고 맹 세하며",
                            "verse 92:3": "남녀를 창조하신 주님을 두고 맹세하나니",
                            "verse 92:4": "실로 너희들의 행위는 여러가 지라",
                            "verse 92:5": "자선을 베풀고 두려워 하며",
                            "verse 92:6": "진리를 증언하는 자를 위해",
                            "verse 92:7": "하나님은 그가 축복으로 가는 길을 쉽게 하여 주시노라",
                            "verse 92:8": "그러나 인색하고 자기자신이 충만하다고 생각하며",
                            "verse 92:9": "진리를 거역하는자",
                            "verse 92:10": "하나님은 그가 불행으로 가 는 길을 쉽게 하리니",
                            "verse 92:11": "그가 지옥으로 향할 때는 그 의 재산이 그를 유익하게 못하니라",
                            "verse 92:12": "인도하는 것은 하나님의 일 이라",
                            "verse 92:13": "내세와 현세도 그분께 있노라",
                            "verse 92:14": "그러므로 내가 너희에게 격 렬하게 타오르는 불지옥을 경고하 나니",
                            "verse 92:15": "가장 불행한 자들만이 그곳 에 이르게 되니라",
                            "verse 92:16": "그는 바로 진리를 거역하고 외면하는 자라",
                            "verse 92:17": "그러나 하나님께 헌신하는 자는 그곳으로부터 제외 되거늘",
                            "verse 92:18": "이들은 그들의 재산을 바치 며 스스로를 순결케 하사",
                            "verse 92:19": "그가 베푼 은혜에 대한 보상을 그의 마음속에 갖지 아니하고",
                            "verse 92:20": "오직 가장 위에 계시는 주님 을 기쁘게 하고자 하는 소망을 가 진 자들로",
                            "verse 92:21": "이들은 곧 완전한 기쁨을 누 리게 되리라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "سوێند به شه‌و کاتێک دنیا داده‌گرێت.",
                            "verse 92:2": "به ڕۆژ کاتێک دنیا ڕووناک ده‌بێت و تاریکی ده‌ڕه‌وێنێته‌وه‌.",
                            "verse 92:3": "سوێند به‌و زاته‌ی که نێر و مێی دروست کردووه‌.",
                            "verse 92:4": "به‌ڕاستی هه‌وڵ و کۆششی ئێوه جۆراو جۆره (هه‌تانه هه‌وڵ و کۆششی بۆ به‌ده‌ستهێنانی به‌هه‌شته‌، هه‌تانه به پێچه‌وانه‌وه به ده‌ست و برده بۆ ئه‌نجامدانی تاوان و خراپکاری، هه‌تانه گوێڕایه‌ڵ و هه‌تانه یاخی.",
                            "verse 92:5": "جا ئه‌وه‌ی (ماڵ و سامان و زانستی و.",
                            "verse 92:6": "بڕوای بته‌وی به پاداشتی چاک و به‌نرخی خوایی هه‌یه‌.",
                            "verse 92:7": "ئه‌وه ڕێگه‌ی چاکه و چاکه‌کاری بۆ ئاسان ده‌که‌ین و سه‌رئه‌نجام ده‌یخه‌ینه خێر و خۆشیه‌وه‌.",
                            "verse 92:8": "به‌ڵام ئه‌وه‌ی ڕه‌زیل و ده‌ست نوقاو بێت و خۆی بێ نیاز بزانێت (ره‌زامه‌ندی خوایی مه‌به‌ست نه‌بێت).",
                            "verse 92:9": "بڕوای نه‌بێت به پاداشت و به‌هره‌ی چاکی خوایی و به‌درۆی بزانێت.",
                            "verse 92:10": "ئه‌وه ئێمه ڕێبازی ته‌نگانه و ناخۆشی بۆ ئاسان ده‌که‌ین و سه‌رئه‌نجام به دۆزه‌خی ده‌گه‌یه‌نین.",
                            "verse 92:11": "ئه‌و کاته‌ی که ده‌مرێت و له گۆڕ ده‌نرێت، ئه‌و کاته‌ش که فڕێ ده‌درێته دۆزه‌خه‌وه ماڵ و سامان هیچ فریای ناکه‌وێت.",
                            "verse 92:12": "به‌ڕاستی ڕوون کردنه‌وه‌ی ڕێبازی هیدایه‌ت و دیاریکردنی بۆ خه‌ڵکی له‌سه‌ر ئێمه‌یه‌.",
                            "verse 92:13": "بێگومان ده‌سه‌ڵاتی بێ سنورمان هه‌یه به‌سه‌ر پاشه‌ڕۆژ و قیامه‌تدا، هه‌روه‌ها به‌سه‌ر دنیادا.",
                            "verse 92:14": "جا من ئه‌وه‌ته ئاگادارتان ده‌که‌م و ده‌تانترسێنم له ئاگرێک که زۆر بڵێسه ده‌سێنێت.",
                            "verse 92:15": "ناچێته ناوی مه‌گه‌ر که‌سانی ناپوخت و دڕنده و خوانه‌ناس نه‌بێت.",
                            "verse 92:16": "ئه‌وه‌ی حه‌قیقه‌ت و ڕاستی به درۆ داناوه و پشتی هه‌ڵکردووه (له به‌رنامه‌ی خوا).",
                            "verse 92:17": "جا خواناس و پارێزکاران له‌و سزاو ناگرو ناخۆشیه دوور ده‌خرێنه‌وه‌.",
                            "verse 92:18": "ئه‌و جۆره که‌سه‌ی ماڵ و سامانی ده‌به‌خشێت به‌وه دڵ و ده‌روونی خۆی خاوێن ڕاده‌گرێت.",
                            "verse 92:19": "له کاتێکدا که‌که‌س چاکه‌یه‌کی وای به‌سه‌ریه‌وه نی یه که پاداشت بدرێته‌وه‌.",
                            "verse 92:20": "(چونکه‌) ته‌نها مه‌به‌ستی به‌ده‌ستهێنانی ڕه‌زامه‌ندیی په‌روه‌ردگاری به‌رزو بڵنده‌.",
                            "verse 92:21": "سوێند به‌خوا ڕازی و خۆشنوود ده‌بێت پێی."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Demi malam apabila ia menyelubungi segala-galanya (dengan gelap-gelitanya),",
                            "verse 92:2": "Dan siang apabila ia lahir terang-benderang;",
                            "verse 92:3": "Demi Yang menciptakan (makhluk-makhlukNya) lelaki dan perempuan, (jantan dan betina);",
                            "verse 92:4": "Sesungguhnya amal usaha kamu adalah berbagai-bagai keadaannya.",
                            "verse 92:5": "Jelasnya: Adapun orang yang memberikan apa yang ada padanya ke jalan kebaikan dan bertakwa (mengerjakan suruhan Allah dan meninggalkan segala laranganNya);",
                            "verse 92:6": "Serta dia mengakui dengan yakin akan perkara yang baik,",
                            "verse 92:7": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesenangan (Syurga).",
                            "verse 92:8": "Sebaliknya orang yang bakhil (daripada berbuat kebajikan) dan merasa cukup dengan kekayaan dan kemewahannya;",
                            "verse 92:9": "Serta dia mendustakan perkara yang baik,",
                            "verse 92:10": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesusahan dan kesengsaraan;",
                            "verse 92:11": "Dan apakah pertolongan yang dapat diberi kepadanya oleh hartanya apabiha dia telah terjerumus (ke dalam azab seksa hari akhirat)?",
                            "verse 92:12": "Sesungguhnya tanggungan Kamilah memberi hidayat petunjuk (tentang yang benar dan yang salah).",
                            "verse 92:13": "Dan sesungguhnya Kamilah yang menguasai hari akhirat dan alam dunia.",
                            "verse 92:14": "Maka (serentak dengan memberi hidayat petunjuk) Aku juga telah memberi amaran mengingatkan kamu akan api Neraka yang marak menjulang,",
                            "verse 92:15": "Yang tidak akan menderita bakarannya melainkan orang yang sungguh celaka;",
                            "verse 92:16": "Yang telah mendustakan (kebenaran) dan berpaling ingkar.",
                            "verse 92:17": "Dan (sebaliknya) akan dijauhkan (azab Neraka) itu daripada orang yang sungguh bertakwa;",
                            "verse 92:18": "Yang mendermakan hartanya dengan tujuan membersihkan dirinya dan harta bendanya,",
                            "verse 92:19": "Sedang dia tidak menanggung budi sesiapapun, yang patut di balas,",
                            "verse 92:20": "Hanyalah mengharapkan keredaan Tuhannya Yang Maha Tinggi;",
                            "verse 92:21": "Dan demi sesungguhnya, dia tetap akan berpuas hati (pada hari akhirat, dengan mendapat segala yang diharapkannya)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "قسم به شب در آن هنگام كه (جهان را) بپوشاند،",
                            "verse 92:2": "و قسم به روز هنگامى كه تجلى كند،",
                            "verse 92:3": "و قسم به آن كس كه جنس مذكر و مؤنث را آفريد،",
                            "verse 92:4": "كه سعى و تلاش شما مختلف است:",
                            "verse 92:5": "اما آن كس كه (در راه خدا) انفاق كند و پرهيزگارى پيش گيرد،",
                            "verse 92:6": "و جزاى نيك (الهى) را تصديق كند،",
                            "verse 92:7": "ما او را در مسير آسانى قرار مى‏دهيم!",
                            "verse 92:8": "اما كسى كه بخل ورزد و (از اين راه) بى‏نيازى طلبد،",
                            "verse 92:9": "و پاداش نيك (الهى) را انكار كند،",
                            "verse 92:10": "بزودى او را در مسير دشوارى قرار مى‏دهيم;",
                            "verse 92:11": "و در آن هنگام كه (در جهنم) سقوط مى‏كند، اموالش به حال او سودى نخواهد داشت!",
                            "verse 92:12": "به يقين هدايت كردن بر ماست،",
                            "verse 92:13": "و آخرت و دنيا از آن ماست،",
                            "verse 92:14": "و من شما را از آتشى كه زبانه مى‏كشد بيم مى‏دهم،",
                            "verse 92:15": "كسى جز بدبخت‏ترين مردم وارد آن نمى‏شود;",
                            "verse 92:16": "همان كس كه (آيات خدا را) تكذيب كرد و به آن پشت نمود!",
                            "verse 92:17": "و بزودى با تقواترين مردم از آن دور داشته مى‏شود،",
                            "verse 92:18": "همان كس كه مال خود را (در راه خدا) مى‏بخشد تا پاك شود",
                            "verse 92:19": "و هيچ كس را نزد او حق نعمتى نيست تا بخواهد (به اين وسيله) او را جزا دهد،",
                            "verse 92:20": "بلكه تنها هدفش جلب رضاى پروردگار بزرگ اوست;",
                            "verse 92:21": "و بزودى راضى و خشنود مى‏شود!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Pela noite, quando cobre (a luz),",
                            "verse 92:2": "Pelo dia, quando resplandece,",
                            "verse 92:3": "Por Quem criou o masculino e o feminino,",
                            "verse 92:4": "Que os vossos esforços são diferentes (quanto às metas a atingir).",
                            "verse 92:5": "Porém, àquele que dá (em caridade e é temente a Deus,",
                            "verse 92:6": "E crê no melhor,",
                            "verse 92:7": "Facilitaremos o caminho do conforto.",
                            "verse 92:8": "Porém, àquele que mesquinhar e se considerar suficiente,",
                            "verse 92:9": "E negar o melhor,",
                            "verse 92:10": "Facilitaremos o caminho da adversidade.",
                            "verse 92:11": "E de nada lhe valerão os seus bens, quando ele cair no abismo.",
                            "verse 92:12": "Sabei que a Nós incumbe a orientação,",
                            "verse 92:13": "Assim como também são Nossos o fim e o começo.",
                            "verse 92:14": "Por isso, vos tenho admoestado com o fogo voraz,",
                            "verse 92:15": "Em que não entrará senão o mais desventurado,",
                            "verse 92:16": "Que desmentir (a verdade) e desdenhar.",
                            "verse 92:17": "Contudo, livrar-se-á dele o mais temente a Deus,",
                            "verse 92:18": "Que aplica os seus bens, com o fito de purificá-los,",
                            "verse 92:19": "E não faz favores a ninguém com o fito de ser recompensado,",
                            "verse 92:20": "Senão com o intuito de ver o Rosto do seu Senhor, o Altíssimo;",
                            "verse 92:21": "A logo alcançará (completa) satisfação."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 92:1": "Pe noapte, când acoperã",
                            "verse 92:2": "Și pe zi, când se lumineazã",
                            "verse 92:3": "Și pe ceea ce a creat bãrbat și femeie!",
                            "verse 92:4": "Râvna voastrã este feluritã!",
                            "verse 92:5": "Cât despre cel care dãruiește și are fricã [de Allah]",
                            "verse 92:6": "Și crede în rãsplata cea frumoasã,",
                            "verse 92:7": "Aceluia îi vom ușura Noi",
                            "verse 92:8": "cãtre bucurie.",
                            "verse 92:9": "Cât despre cel care este zgârcit și cautã sã se îmbogãțeascã",
                            "verse 92:10": "Și tãgãduiește rãsplata cea frumoasã,",
                            "verse 92:11": "Aceluia îi vom ușura Noi",
                            "verse 92:12": "cãtre ceea ce este cel mai greu",
                            "verse 92:13": "Și nu-i va fi de nici un folos averea, când el va fi aruncat [în Foc].",
                            "verse 92:14": "Nouã Ne revine cãlãuzirea",
                            "verse 92:15": "Și ale Noastre sunt atât Lumea de Apoi, cât și lumea aceasta.",
                            "verse 92:16": "V-am prevenit pe voi despre un Foc ce arde cu flacãrã,",
                            "verse 92:17": "Unde nu va arde decât cel mișel,",
                            "verse 92:18": "Care tãgãduiește și întoarce spatele,",
                            "verse 92:19": "În vreme ce va fi ferit de el cel evlavios,",
                            "verse 92:20": "Care dã averea lui [ca milostenie] și se curãțește",
                            "verse 92:21": "Și care nimãnui nu-i face un bine pentru a fi rãsplãtit ,",
                            "verse 92:22": "Ci numai cãutând Fața Domnului sãu Cel Preaînalt.",
                            "verse 92:23": "Și el va fi mulțumit! Preaînalt."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 92:1": "Pe ziua care-l dezvăluie!",
                            "verse 92:2": "Pe noaptea care-l învăluie!",
                            "verse 92:3": "Pe ceea ce El a creat, bărbat şi femeie!",
                            "verse 92:4": "Felurită este truda voastră!",
                            "verse 92:5": "Celui care dă şi se teme,",
                            "verse 92:6": "celui care socoate adevărată prea-frumoasa răsplată,",
                            "verse 92:7": "Noi îl vom înlesni întru înlesnire.",
                            "verse 92:8": "Zgârcitului ce caută să se îmbogăţească,",
                            "verse 92:9": "celui care socoate minciună prea-frumoasa răsplată,",
                            "verse 92:10": "Noi îl vom înlesni întru împovărare.",
                            "verse 92:11": "La nimic nu-i va sluji averea sa, când se va prăvăli în genune!",
                            "verse 92:12": "Să arătăm Calea cea Dreaptă,",
                            "verse 92:13": "căci Viaţa de Apoi şi Viaţa de Acum sunt ale noastre deopotrivă.",
                            "verse 92:14": "V-am prevenit asupra Focului arzător",
                            "verse 92:15": "în care va fi aruncat cel prea nemernic,",
                            "verse 92:16": "cel care huleşte şi apoi întoarce spatele.",
                            "verse 92:17": "Cel mult temător va fi ţinut însă deoparte,",
                            "verse 92:18": "ca şi cel care dă din averea sa întru mântuire.",
                            "verse 92:19": "Nimeni nu-şi va afla rasplata la El",
                            "verse 92:20": "în afara celui care caută la faţa Domnului său, Preaînaltul,",
                            "verse 92:21": "şi care va fi mulţumit."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Клянусь спустившимся покровомночи,",
                            "verse 92:2": "И красотой проснувшегося дня,",
                            "verse 92:3": "И тайною созданья двух полов, —",
                            "verse 92:4": "Поистине, различны вашиустремленья!",
                            "verse 92:5": "И для того, кто щедростью дарит,и почитает Бога,",
                            "verse 92:6": "И принял (Откровение Его),",
                            "verse 92:7": "Разгладим путь Мы к (вечному)блаженству.",
                            "verse 92:8": "Но тот, кто скуп и думает, чтоон всевластен,",
                            "verse 92:9": "И отвергает (Откровения Его), —",
                            "verse 92:10": "Мы для него разгладим путьдля (вечного) страданья;",
                            "verse 92:11": "И вот когда он будет брошен в Ров2328,Ему добро накопленное не поможет.",
                            "verse 92:12": "Поистине, Мы направляем все земное,",
                            "verse 92:13": "И Нам принадлежитНачало и конец (сей жизненнойстези).",
                            "verse 92:14": "Предостерег Я вас об адовом огне,",
                            "verse 92:15": "В кой будут брошены лишь жалкиеневежды,",
                            "verse 92:16": "Кто к Истине великой глухИ воротит к ней спину.",
                            "verse 92:17": "Но кто страшился гнева Бога,Избавлен будет от Огня (навечно),",
                            "verse 92:18": "А кто расходует свое доброна самоочищенье",
                            "verse 92:19": "И не для почестей благодеяет,",
                            "verse 92:20": "А из желанья зрить Господень лик,",
                            "verse 92:21": "Сполна познает Его щедрость."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "¡Por la noche cuando extiende su velo!",
                            "verse 92:2": "¡Por el día cuando resplandece!",
                            "verse 92:3": "¡Por Quien ha creado al varón y a la hembra!",
                            "verse 92:4": "Vuestro esfuerzo, en verdad, da resultados diversos.",
                            "verse 92:5": "A quien da, teme a Dios,",
                            "verse 92:6": "y cree en lo más bello,",
                            "verse 92:7": "le facilitaremos el acceso a la mayor felicidad.",
                            "verse 92:8": "En cambio, a quien es avaro, cree bastarse a sí mismo",
                            "verse 92:9": "y desmiente lo más bello,",
                            "verse 92:10": "le facilitaremos el acceso a la mayor adversidad,",
                            "verse 92:11": "y de nada le servirá su hacienda cuando sea precipitado.",
                            "verse 92:12": "Sí, es de incumbencia Nuestra la Dirección.",
                            "verse 92:13": "Sí, es cosa Nuestra la otra vida y ésta.",
                            "verse 92:14": "Os he prevenido contra un fuego llameante,",
                            "verse 92:15": "en el cual sólo arderá el infame,",
                            "verse 92:16": "que desmiente y se desvía,",
                            "verse 92:17": "el cual evitará quien de veras teme a Dios,",
                            "verse 92:18": "que da su hacienda para purificarse,",
                            "verse 92:19": "que, cuando hace un favor, no lo hace con ánimo de ser retribuido,",
                            "verse 92:20": "sino tan sólo por deseo de agradar a su altísimo Señor.",
                            "verse 92:21": "¡Sí, ése quedará satisfecho!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "(இருளால்) தன்னை மூடிக்கொள்ளும் இரவின் மீது சத்தியமாக",
                            "verse 92:2": "பிரகாசம் வெளிப்படும் பகலின் மீதும் சத்தியமாக-",
                            "verse 92:3": "ஆணையும், பெண்ணையும் (அவன்) படைத்திருப்பதின் மீதும் சத்தியமாக-",
                            "verse 92:4": "நிச்சயமாக உங்களுடைய முயற்சி பலவாகும்.",
                            "verse 92:5": "எனவே எவர் (தானதருமம்) கொடுத்து, (தன் இறைவனிடம்) பயபக்தியுடன் நடந்து,",
                            "verse 92:6": "நல்லவற்றை (அவை நல்லவையென்று) உண்மையாக்குகின்றாரோ,",
                            "verse 92:7": "அவருக்கு நாம் (சுவர்க்கத்தின் வழியை) இலேசாக்குவோம்.",
                            "verse 92:8": "ஆனால் எவன் உலோபித்தனம் செய்து அல்லாஹ்விடமிருந்து தன்னைத் தேவையற்றவனாகக் கருதுகிறானோ,",
                            "verse 92:9": "இன்னும், நல்லவற்றை பொய்யாக்குகிறானோ,",
                            "verse 92:10": "அவனுக்கு கஷ்டத்திற்குள்ள (நரகத்தின்) வழியைத் தான் இலேசாக்குவோம்.",
                            "verse 92:11": "ஆகவே அவன் (நரகத்தில்) விழுந்து விட்டால் அவனுடைய பொருள் அவனுக்குப் பலன் அளிக்காது.",
                            "verse 92:12": "நேர் வழியைக் காண்பித்தல் நிச்சயமாக நம் மீது இருக்கிறது.",
                            "verse 92:13": "அன்றியும் பிந்தியதும் (மறுமையும்) முந்தியதும் (இம்மையும்) நம்முடையவையே ஆகும்.",
                            "verse 92:14": "ஆதலின், கொழுந்துவிட்டெறியும் (நரக) நெருப்பைப்பற்றி நான் உங்களை அச்சமூட்டி எச்சரிக்கிறேன்.",
                            "verse 92:15": "மிக்க துர்ப்பாக்கியமுள்ளவனைத் தவிர (வேறு) எவனும் அதில் புகமாட்டான்.",
                            "verse 92:16": "எத்தகையவனென்றால் அவன் (நம் வசனங்களைப்) பொய்யாக்கி, முகம் திரும்பினான்.",
                            "verse 92:17": "ஆனால் பயபக்தியுடையவர் தாம் அ(ந்நரகத்)திலிருந்து தொலைவிலாக்கப்படுவார்.",
                            "verse 92:18": "(அவர் எத்தகையோரென்றால்) தம்மை தூய்மைப் படுத்தியவராகத் தம் பொருளை (இறைவன் பாதையில்) கொடுக்கிறார்.",
                            "verse 92:19": "மேலும், தாம் பதில் (ஈடு) செய்யுமாறு பிறருடைய உபகாரமும் தம் மீது இல்லாதிருந்தும்.",
                            "verse 92:20": "மகா மேலான தம் இறைவனின் திருப்பொருத்தத்தை நாடியே (அவர் தானம் கொடுக்கிறார்).",
                            "verse 92:21": "வெகு விரைவிலேயே (அத்தகையவர் அல்லாஹ்வின் அருள் கொடையால்) திருப்தி பெறுவார்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "ขอสาบานด้วยเวลากลางคืน เมื่อมันปกคลุม",
                            "verse 92:2": "และด้วยเวลากลางวันเมื่อมันประกายแสง",
                            "verse 92:3": "และด้วยผู้ที่ทรงบังเกิดเพศชาย และเพศหญิง",
                            "verse 92:4": "แท้จริงการงานของพวกเจ้านั้นย่อมแตกต่างกันอย่างแน่นอน",
                            "verse 92:5": "ส่วนผู้ที่บริจาคและยำเกรง (อัลลอฮ์)",
                            "verse 92:6": "และเชื่อมั่นในสิ่งที่ดี",
                            "verse 92:7": "เราก็จะให้เขาได้รับความสะดวกอย่างง่ายดาย",
                            "verse 92:8": "และส่วนผู้ที่ตระหนี่ และถือว่ามีพอเพียงแล้ว",
                            "verse 92:9": "และปฏิเสธสิ่งที่ดีงาม",
                            "verse 92:10": "เราก็จะให้เขาได้รับความลำบากอย่างง่ายดาย",
                            "verse 92:11": "และทรัพย์สมบัติของเขาจะไม่อำนวยประโยชน์แก่เขาได้ เมื่อเขาตกไปในเหวนรก",
                            "verse 92:12": "แท้จริงหน้าที่ของเรานั้นคือให้การชี้แนะทาง",
                            "verse 92:13": "และแท้จริงปรโลกและโลกนี้เป็นของเรา",
                            "verse 92:14": "ดังนั้นข้าขอเตือนพวกเจ้าถึงไฟที่ลุกโชน",
                            "verse 92:15": "ไม่มีผู้ใดจะเข้าไปในเผาไหม้ในมัน นอกจากคนเลวทรามที่สุด",
                            "verse 92:16": "คือผู้ที่ปฏิเสธและผินหลังให้",
                            "verse 92:17": "และส่วนผู้ที่ยำเกรงยิ่งนั้นจะถูกปลีกตัวให้ห่างไกลจากมัน",
                            "verse 92:18": "ซึ่งเขาบริจาคทรัพย์สินของเขาเพื่อขัดเกลาตนเอง",
                            "verse 92:19": "และที่เขานั้นไม่มีบุญคุณแก่ผู้ใดที่บุญคุณนั้นจะถูกตอบแทน",
                            "verse 92:20": "นอกจากว่าเพื่อแสวงความโปรดปรานจากพระเจ้าของเขาผู้ทรงสูงส่งเท่านั้น",
                            "verse 92:21": "และเขาก็จะพึงพอใจ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "(Karanlığı ile etrafı) bürüyüp örttüğü zaman geceye,",
                            "verse 92:2": "Açılıp ağardığı vakit gündüze,",
                            "verse 92:3": "Erkeği ve dişiyi yaratana yemin ederim ki,",
                            "verse 92:4": "Sizin işleriniz başka başkadır.",
                            "verse 92:5": "Artık kim verir ve sakınırsa,",
                            "verse 92:6": "Ve en güzeli de tasdik ederse,",
                            "verse 92:7": "Biz de onu en kolaya hazırlarız (onda başarılı kılarız).",
                            "verse 92:8": "Kim cimrilik eder, kendini müstağni sayar,",
                            "verse 92:9": "Ve en güzeli de yalanlarsa,",
                            "verse 92:10": "Biz de onu en zora hazırlarız.",
                            "verse 92:11": "Düştüğü zaman da malı kendisine hiç fayda vermez.",
                            "verse 92:12": "Doğru yolu göstermek bize aittir.",
                            "verse 92:13": "Şüphesiz ahiret de dünya da bizimdir.",
                            "verse 92:14": "(Ey insanlar! ) Alev alev yanan bir ateşle sizi uyardım.",
                            "verse 92:15": "O ateşe, ancak kötü olan girer.",
                            "verse 92:16": "Öyle kötü ki, yalanlayıp ve yüz çevirmiştir.",
                            "verse 92:17": "En çok korunan ise ondan (ateşten) uzak tutulur.",
                            "verse 92:18": "O ki ,Allah yolunda malını verir, temizlenir.",
                            "verse 92:19": "Onun nezdinde hiçbir kimseye ait şükranla karşılanacak bir nimet yoktur.",
                            "verse 92:20": "O ancak Yüce Rabbinin rızasını aramak için verir.",
                            "verse 92:21": "Ve o (buna kavuşarak) hoşnut olacaktır."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "رات کی قسم جب (دن کو) چھپالے",
                            "verse 92:2": "رات کي قَسم جب وہ چھا جائے (اور ہر چيز کو اپني تاريکي ميں چھپا لے)o",
                            "verse 92:3": "اور دن کي قَسم جب وہ چمک اٹھےo",
                            "verse 92:4": "اور دن کی قسم جب چمک اٹھے",
                            "verse 92:5": "اور اس (ذات) کی قسم جس نے نر اور مادہ پیدا کیے",
                            "verse 92:6": "اور اس ذات کي (قَسم) جس نے (ہر چيز ميں) نر اور مادہ کو پيدا فرماياo",
                            "verse 92:7": "بيشک تمہاري کوشش مختلف (اور جداگانہ) ہےo",
                            "verse 92:8": "کہ تم لوگوں کی کوششں طرح طرح کی ہے",
                            "verse 92:9": "تو جس نے (خدا کے رستے میں مال) دیا اور پرہیز گاری کی",
                            "verse 92:10": "پس جس نے (اپنا مال ا? کي راہ ميں) ديا اور پرہيزگاري اختيار کيo",
                            "verse 92:11": "اور اس نے (اِنفاق و تقو?ي کے ذريعے) اچھائي (يعني دينِ حق اور آخرت) کي تصديق کيo",
                            "verse 92:12": "اور نیک بات کو سچ جانا",
                            "verse 92:13": "اس کو ہم آسان طریقے کی توفیق دیں گے",
                            "verse 92:14": "تو ہم عنقريب اسے آساني (يعني رضائے ال?ہي) کے لئے سہولت فراہم کر ديں گےo",
                            "verse 92:15": "اور جس نے بخل کيا اور (راہِ حق ميں مال خرچ کرنے سے) بے پروا رہاo",
                            "verse 92:16": "اور جس نے بخل کیا اور بیپروا بنا رہا",
                            "verse 92:17": "اور نیک بات کو جھوٹ سمجھا",
                            "verse 92:18": "اور اس نے (يوں) اچھائي (يعني دينِ حق اور آخرت) کو جھٹلاياo",
                            "verse 92:19": "تو ہم عنقريب اسے سختي (يعني عذاب کي طرف بڑھنے) کے لئے سہولت فراہم کر ديں گے (تاکہ وہ تيزي سے مستحقِ عذاب ٹھہرے)o",
                            "verse 92:20": "اسے سختی میں پہنچائیں گے",
                            "verse 92:21": "اور جب وہ (دوزخ کے گڑھے میں) گرے گا تو اس کا مال اس کے کچھ کام نہ آئے گا",
                            "verse 92:22": "اور اس کا مال اس کے کسي کام نہيں آئے گا جب وہ ہلاکت (کے گڑھے) ميں گرے گاo",
                            "verse 92:23": "بيشک راہِ (حق) دکھانا ہمارے ذمہ ہےo",
                            "verse 92:24": "ہمیں تو راہ دکھا دینا ہے",
                            "verse 92:25": "اور آخرت او ردنیا ہماری ہی چیزیں ہیں",
                            "verse 92:26": "اور بيشک ہم ہي آخرت اور دنيا کے مالک ہيںo",
                            "verse 92:27": "سو ميں نے تمہيں (دوزخ کي) آگ سے ڈرا ديا ہے جو بھڑک رہي ہےo",
                            "verse 92:28": "سو میں نے تم کو بھڑکتی آگ سے متنبہ کر دیا",
                            "verse 92:29": "اس میں وہی داخل ہو گا جو بڑا بدبخت ہے",
                            "verse 92:30": "جس ميں انتہائي بدبخت کے سوا کوئي داخل نہيں ہوگاo",
                            "verse 92:31": "جس نے (دينِ حق کو) جھٹلايا اور (رسول کي اطاعت سے) منہ پھير لياo",
                            "verse 92:32": "جس نے جھٹلایا اور منہ پھیرا",
                            "verse 92:33": "اور جو بڑا پرہیزگار ہے وہ (اس سے) بچا لیا جائے گا",
                            "verse 92:34": "اور اس (آگ) سے اس بڑے پرہيزگار شخص کو بچا ليا جائے گاo",
                            "verse 92:35": "جو اپنا مال (ا? کي راہ ميں) ديتا ہے کہ (اپنے جان و مال کي) پاکيزگي حاصل کرےo",
                            "verse 92:36": "جو مال دیتا ہے تاکہ پاک ہو",
                            "verse 92:37": "اور (اس لیے) نہیں( دیتا کہ) اس پر کسی کا احسان (ہے) جس کا وہ بدلہ اتارتا ہے",
                            "verse 92:38": "اور کسي کا اس پر کوئي احسان نہيں کہ جس کا بدلہ ديا جا رہا ہوo",
                            "verse 92:39": "مگر (وہ) صرف اپنے ربِ عظيم کي رضا جوئي کے لئے (مال خرچ کر رہا ہے)o",
                            "verse 92:40": "بلکہ اپنے خداوند اعلیٰ کی رضامندی حاصل کرنے کے لیے دیتا ہے",
                            "verse 92:41": "اور وہ عنقریب خوش ہو جائے گا",
                            "verse 92:42": "اور عنقريب وہ (ا? کي عطا سے اور ا? اس کي وفا سے) راضي ہو جائے گاo گا"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 92:1": "Туннинг қоплаб келаётган пайти билан қасам.",
                            "verse 92:2": "Наҳорнинг тажалли пайти билан қасам.",
                            "verse 92:3": "Эркак ва урғочининг яратилиши билан қасам.",
                            "verse 92:4": "Албатта, сизларнинг ишларингиз турличадур.",
                            "verse 92:5": "Аммо кимки (ато) берса ва тақво қилса.",
                            "verse 92:6": "Ва гўзал(сўз)ни тасдиқ қилса.",
                            "verse 92:7": "Бас, Биз уни осонга муяссар қиламиз.",
                            "verse 92:8": "Аммо кимки бахиллик ва истиғно қилса.",
                            "verse 92:9": "Ва гўзал(сўз)ни ёлғонга чиқарса.",
                            "verse 92:10": "Бас, Биз уни қийинга муяссар қиламиз.",
                            "verse 92:11": "У қулаган вақтда унга мол-мулки фойда бермас.",
                            "verse 92:12": "Албатта, ҳидоятга бошлаш Бизнинг зиммамиздадир.",
                            "verse 92:13": "Албатта, ҳам охират ва ҳам бу дунё Бизникидир.",
                            "verse 92:14": "Бас, Мен сизларни (алангаси авж олиб турган) ўтдан огоҳлантирдим.",
                            "verse 92:15": "У(ўт)га бадбахтдан бошқа ҳеч ким кирмас.",
                            "verse 92:16": "Ўша ёлғонга чиқарган ва юз ўгирган эди.",
                            "verse 92:17": "Ва албатта, ундан тақводор банда четда қолади.",
                            "verse 92:18": "У бойлигини сарфлайди ва ўзини поклайди.",
                            "verse 92:19": "Унда бирор кишининг қайтарилиши лозим яхшилиги йўқ эди.",
                            "verse 92:20": "Фақатгина олий мақом Роббисининг розилигини сўраб қилади.",
                            "verse 92:21": "Ва у албатта тезда рози бўлади."
                        }
                    }
                }
            }
        }
    }
}