{
    "id": 92,
    "name_simple": "Al-Layl",
    "revelation_place": "makkah",
    "revelation_order": 9,
    "bismillah_pre": true,
    "verses_count": 21,
    "short_text": "The Surah takes its name from the word wal-lail with which it opens.",
    "text": [
        "\n",
        "The Surah takes its name from the word wal-lail with which it opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its subject matter so closely resembles that of Surah Ash-Shams that each Surah seems to be an explanation of the other. It is one and the same thing which has been explained in Surah Ash-Shams in one way and in this Surah in another. This indicates that both these Surahs were sent down in about the same period.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to distinguish between the two different ways of life and to explain the contrast between their ultimate ends and results. In view of the subject matter this Surah consists of two parts, the first part consisting of vv. 1-11 and the second of vv. 12-21.",
        "\n",
        "In the first part, at the outset it has been pointed out that the strivings and doings that the individuals, nations and groups of mankind are engaged in in the world, are, in respect of their moral nature, as divergent as the day is from the night, and the male from the female. After this, according to the general style of the brief Surahs of the Quran, three moral characteristics of one kind and three moral characteristics of the other kind have been presented as an illustration from among a vast collection of the strivings and activities of man, from which every man can judge which style of life is represented by one kind of the characteristics and which style of life by the other kind. Both these styles have been described in such brief, elegant. and pithy sentences that they move the heart and go down into memory as soon as one hears them. Characteristics of the first kind are that one should spend one's wealth, adopt God-consciousness and piety, and acknowledge the good as\r\ngood. The second kind of the characteristics are that one should be miserly, should least care for God's pleasure and His displeasure, and should repudiate what is good and right. Then it has been stated that these two modes of action which are clearly divergent, cannot be equal and alike in respect of their results. But, just as they are divergent in their nature, so they are divergent in their results. The person (or group of persons) who adopts the first mode of action, Allah will make easy for him the correct way of life, so much so that doing good will become easy for him and doing evil difficult. On the contrary, he who adopts the second mode of life, Allah will make easy for him the difficult and hard way of life, so much so that doing evil will become easy for him and doing good difficult. This passage has been concluded with a most effective and touching sentence, saying: \"This worldly wealth for the sake of which man is even prepared to risk his life will not go down with\r\nhim into the grave; therefore, what will it avail him after death?\"",
        "\n",
        "In the second part also three truths have been stated equally briefly. First, that Allah has not left man uninformed in the examination hall of the world, but He has taken on Himself the responsibility to tell him which one is the straight and right way out of the different ways of life. Here, there was no need to point out that by sending His Messenger and His Book He has fulfilled His this responsibility, for both the Messenger and the Book were present to afford the guidance. Second, that the Master of both the world and the Hereafter is Allah alone. If you seek the world, it is He Who will give it, and if you seek the Hereafter, again it is He Who will give it. Now, it is for you to decide what you should seek from Him. The third truth that has been stated is that the wretched one who rejects the good, which is being presented through the Messenger and the Book, and turns away from it, will have a blazing fire ready for him. As for the God fearing person who spends his\r\nwealth in a good cause, without any selfish motive, only for the sake of winning his Lord's good pleasure, his Lord will be pleased with him and will bless him with so much that he will be well pleased with Him.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by the whelming of The Night that swathes the world in darkness. It is named after “the night” (al-layl), mentioned in verse 1. The surah shows the consequences of the paths people choose and emphasizing God’s guidance and warning.",
    "name_translation": "The Night",
    "name_complex": "Al-Layl",
    "surah_name_ar": "الليل",
    "verses": {
        "Albanian": {
            "verse 92:1": "Betohem në natën që e mbulon terri,",
            "verse 92:2": "dhe ditën që agon,",
            "verse 92:3": "dhe që ka krijuar mashkullin dhe femrën –",
            "verse 92:4": "me të vërtetë, veprat tuaja janë të ndryshme:",
            "verse 92:5": "atij që jep (për bamirës) dhe ruhet (prej gabimeve)",
            "verse 92:6": "dhe i cili dëshmon (vërteton) atë që është më e bukur (besimin)",
            "verse 92:7": "Na, atij do t’ia lehtësojmë rrugën e lumturisë (xhennetit);",
            "verse 92:8": "kurse atij që është koprrac dhe e konsideron veten të pavarur (nga Zoti),",
            "verse 92:9": "dhe e përgënjeshtron atë më të bukurën (besimin),",
            "verse 92:10": "Na, atij, do t’ia lehtësojmë rrugën e rëndë (skëterrës),",
            "verse 92:11": "e kur të hedhet (në varr), pasuria e tij nuk do t’i bën dobi.",
            "verse 92:12": "Neve na përket, që ta tregojmë rrugën e drejtë,",
            "verse 92:13": "dhe, me të vërtetë, e Jona është ajo botë dhe kjo botë!",
            "verse 92:14": "Andaj Unë, ju kam tërhequr vërejtjen me zjarrin që ndizet,",
            "verse 92:15": "në të cilin do të hidhet vetëm më i keqi,",
            "verse 92:16": "i cili ka përgënjeshtruar dhe është larguar nga besimi;",
            "verse 92:17": "e do të jetë larg nga ai (zjarri), ai që i druan Perëndisë,",
            "verse 92:18": "ai që ndanë nga pasuria e tij, duke e pastruar veten (nga të këqiat),",
            "verse 92:19": "e nuk e jep atë – për t’ia kthyer ndokush,",
            "verse 92:20": "por vetëm që të fitojë kënaqësinë e Zotit të tij të Lartëmadhërueshëm,",
            "verse 92:21": "dhe ai, me siguri, do të jetë i kënaqur!"
        },
        "Amharic": {
            "verse 92:1": "በሌሊቱ እምላለሁ (በጨለማው) በሚሸፍን ጊዜ፡፡",
            "verse 92:2": "በቀኑም፤ በተገለጸ ጊዜ፡፡",
            "verse 92:3": "ወንድንና ሴትን በፈጠረውም (አምላክ እምላለሁ)፡፡",
            "verse 92:4": "ሥራችሁ በእርግጥ የተለያየ ነው፡፡",
            "verse 92:5": "የሰጠ ሰውማ ጌታውን የፈራም፡፡",
            "verse 92:6": "በመልካሚቱም (እምነት) ያረጋገጠ፤",
            "verse 92:7": "ለገሪቱ ሥራ እናዘጋጀዋለን፡፡",
            "verse 92:8": "የሰሰተ ሰውማ የተብቃቃም፤ (በራሱ የተመካ)፤",
            "verse 92:9": "በመልካሚቱ (እምነት) ያሰተባበለም፤",
            "verse 92:10": "ለክፉይቱ ሥራ እናዘጋጀዋለን፡፡",
            "verse 92:11": "በወደቀም ጊዜ ገንዘቡ ከእርሱ ምንም አይጠቅመውም፡፡",
            "verse 92:12": "ቅኑን መንገድ መግለጽ በእኛ ላይ አለብን፡፡",
            "verse 92:13": "መጨረሻይቱም መጀመሪያይቱም ዓለም የእኛ ናቸው፡፡",
            "verse 92:14": "የምትንቀለቀልንም እሳት አስጠነቀቅኳችሁ (በላቸው)፡፡",
            "verse 92:15": "ከጠማማ በቀር ሌላ የማይገባት የኾነችን፡፡",
            "verse 92:16": "ያ ያስተባበለና ከትዕዛዝ የሸሸው፡፡",
            "verse 92:17": "አላህን በጣም ፈሪውም በእርግጥ ይርቃታል፡፡",
            "verse 92:18": "ያ የሚጥራራ ኾኖ ገንዘቡን (ለድኾች) የሚሰጠው፡፡",
            "verse 92:19": "ለአንድም ሰው እርሱ ዘንድ የምትመለስ ውለታ የለችም፡፡",
            "verse 92:20": "ግን የታላቅ ጌታውን ውዴታ ለመፈለግ (ይህንን ሠራ)፡፡",
            "verse 92:21": "ወደፊትም በእርግጥ ይደሰታል፡፡"
        },
        "Arabic": {
            "verse 92:1": "ٰىَشْغَي اَذِإ ِلْيَّللاَو",
            "verse 92:2": "ٰىَّلَجَت اَذِإ ِراَهَّنلاَو",
            "verse 92:3": "ٰىَثنُأْلاَو َرَكَّذلا َقَلَخ اَمَو",
            "verse 92:4": "ٰىَّتَشَل ْمُكَيْعَس َّنِإ",
            "verse 92:5": "ٰىَقَّتاَو ٰىَطْعَأ ْنَم اَّمَأَف",
            "verse 92:6": "ٰىَنْسُحْلاِب َقَّدَصَو",
            "verse 92:7": "ٰىَرْسُيْلِل ُهُرِّسَيُنَسَف",
            "verse 92:8": "ٰىَنْغَتْساَو َلِخَب نَم اَّمَأَو",
            "verse 92:9": "ٰىَنْسُحْلاِب َبَّذَكَو",
            "verse 92:10": "(ٰىَرْسُعْلِل ُهُرِّسَيُنَسَف",
            "verse 92:11": "(ٰىَّدَرَت اَذِإ ُهُلاَم ُهْنَع يِنْغُي اَمَو",
            "verse 92:12": "(ٰىَدُهْلَل اَنْيَلَع َّنِإ",
            "verse 92:13": "(ٰىَلوُأْلاَو َةَرِخآْلَل اَنَل َّنِإَو",
            "verse 92:14": "(ٰىَّظَلَت اًراَن ْمُكُتْرَذنَأَف",
            "verse 92:15": "(ىَقْشَأْلا اَّلِإ اَهاَلْصَي اَل",
            "verse 92:16": "(ٰىَّلَوَتَو َبَّذَك يِذَّلا",
            "verse 92:17": "(ىَقْتَأْلا اَهُبَّنَجُيَسَو",
            "verse 92:18": "(ٰىَّكَزَتَي ُهَلاَم يِتْؤُي يِذَّلا",
            "verse 92:19": "(ٰىَزْجُت ٍةَمْعِّن نِم ُهَدنِع ٍدَحَأِل اَمَو",
            "verse 92:20": "(ٰىَلْعَأْلا ِهِّبَر ِهْجَو َءاَغِتْبا اَّلِإ",
            "verse 92:21": "(ٰىَضْرَي َفْوَسَلَو"
        },
        "Azerbaijani": {
            "verse 92:1": "And olsun yer üzünü zülmətə bürüməkdə olan gecəyə!",
            "verse 92:2": "And olsun günəşin çıxması ilə aydınlaşan gündüzə!",
            "verse 92:3": "And olsun kişini və qadını yaradana!",
            "verse 92:4": "Sizin can atdıqlarınız başqa-başqadır.",
            "verse 92:5": "Kim haqqını verir və Allahdan qorxursa,",
            "verse 92:6": "və ən gözəl olanı (lə ilahə illəllahı) təsdiq edirsə,",
            "verse 92:7": "Biz onu ən asan olana nail edəcəyik.",
            "verse 92:8": "Kim də xəsislik edərək Rəbbinə ehtiyacı olmadığını güman edirsə",
            "verse 92:9": "və ən gözəl olanı (lə ilahə illəllahı) yalan hesab edirsə,",
            "verse 92:10": "Biz onun üstünə ən çətin olanı yükləyəcəyik.",
            "verse 92:11": "Cəhənnəmə düşdükdə var-dövləti ona fayda verməyəcək.",
            "verse 92:12": "Şübhəsiz ki, doğru yola yönəltmək Bizə aiddir.",
            "verse 92:13": "Sözsüz ki, Axirət də, dünya həyatı da Bizimdir.",
            "verse 92:14": "Mən sizi alov saçan bir odla qorxutdum.",
            "verse 92:15": "Ona ancaq ən bədbəxt kimsə girər.",
            "verse 92:16": "O kimsə ki, haqqı yalan sayır və ondan üz döndərir.",
            "verse 92:17": "Allahdan ən çox qorxan isə o Oddan uzaqlaşdırılar.",
            "verse 92:18": "O kimsə ki, malını Allah yolunda verir, günahlardan təmizlənir.",
            "verse 92:19": "Əvəzi veriləcək nemət üçün onun heç kəsə minnəti olmaz.",
            "verse 92:20": "O bunu ancaq Ən Uca Rəbbinin Üzünü dilədiyindən edər.",
            "verse 92:21": "O, mütləq razı qalacaqdır!"
        },
        "Bengali": {
            "verse 92:1": "শপথ রাত্রির, যখন সে আচ্ছন্ন করে,",
            "verse 92:2": "শপথ দিনের, যখন সে আলোকিত হয়",
            "verse 92:3": "এবং তাঁর, যিনি নর ও নারী সৃষ্টি করেছেন,",
            "verse 92:4": "নিশ্চয় তোমাদের কর্ম প্রচেষ্টা বিভিন্ন ধরনের।",
            "verse 92:5": "অতএব, যে দান করে এবং খোদাভীরু হয়,",
            "verse 92:6": "এবং উত্তম বিষয়কে সত্য মনে করে,",
            "verse 92:7": "আমি তাকে সুখের বিষয়ের জন্যে সহজ পথ দান করব।",
            "verse 92:8": "আর যে কৃপণতা করে ও বেপরওয়া হয়",
            "verse 92:9": "এবং উত্তম বিষয়কে মিথ্যা মনে করে,",
            "verse 92:10": "আমি তাকে কষ্টের বিষয়ের জন্যে সহজ পথ দান করব।",
            "verse 92:11": "যখন সে অধঃপতিত হবে, তখন তার সম্পদ তার কোনই কাজে আসবে না।",
            "verse 92:12": "আমার দায়িত্ব পথ প্রদর্শন করা।",
            "verse 92:13": "আর আমি মালিক ইহকালের ও পরকালের।",
            "verse 92:14": "অতএব, আমি তোমাদেরকে প্রজ্বলিত অগ্নি সম্পর্কে সতর্ক করে দিয়েছি।",
            "verse 92:15": "এতে নিতান্ত হতভাগ্য ব্যক্তিই প্রবেশ করবে,",
            "verse 92:16": "যে মিথ্যারোপ করে ও মুখ ফিরিয়ে নেয়।",
            "verse 92:17": "এ থেকে দূরে রাখা হবে খোদাভীরু ব্যক্তিকে,",
            "verse 92:18": "যে আত্নশুদ্ধির জন্যে তার ধন-সম্পদ দান করে।",
            "verse 92:19": "এবং তার উপর কারও কোন প্রতিদানযোগ্য অনুগ্রহ থাকে না।",
            "verse 92:20": "তার মহান পালনকর্তার সন্তুষ্টি অন্বেষণ ব্যতীত।",
            "verse 92:21": "সে সত্বরই সন্তুষ্টি লাভ করবে।"
        },
        "Berber Amazigh": {
            "verse 92:1": "S yiv, mara idell!",
            "verse 92:2": "S wass, mara iôeqq!",
            "verse 92:3": "S wayen Ixleq: ddkeô, nnta!",
            "verse 92:4": "Igiten nnwen, s tidep, mefruzit.",
            "verse 92:5": "Wanag win ipseddiqen, ipêezziben,",
            "verse 92:6": "di tezdeg iumen,",
            "verse 92:7": "ad as Nefk afus ad istiser.",
            "verse 92:8": "Wanag win icuêêen, i isme$wôen iman is,",
            "verse 92:9": "u iskaddeb ayen zeddigen,",
            "verse 92:10": "ad as Negg abrid ar laâûeô.",
            "verse 92:11": "Iwumi yas wayla s, imi ad i$li?",
            "verse 92:12": "Nnhaya, s tidep, fellane£.",
            "verse 92:13": "Ih, taneggarut akked tmezwarut, d ayla nne£.",
            "verse 92:14": "Âaggne$ awen: times d taqesêant.",
            "verse 92:15": "Ara p ikecmen, siwa imceôôi mavi,",
            "verse 92:16": "i iskaddben, u iwexxôen.",
            "verse 92:17": "A p swexxôen i win ipêezziben mavi,",
            "verse 92:18": "i ipseddiqen seg wayla s i tezdeg.",
            "verse 92:19": "Ur ippawi êedd, a$iti s$uôes,",
            "verse 92:20": "siwa ma iô$eb udem n Mass is Aâlayan.",
            "verse 92:21": "War ccekk, deqqal ad Iôavi."
        },
        "Bosnian": {
            "verse 92:1": "Tako mi noći kada tmine razastre,",
            "verse 92:2": "i dana kad svane,",
            "verse 92:3": "i Onoga koji muško i žensko stvara –",
            "verse 92:4": "vaš trud je, zaista, različit:",
            "verse 92:5": "onome koji udjeljuje i ne griješi",
            "verse 92:6": "i ono najljepše smatra istinitim –",
            "verse 92:7": "njemu ćemo Džennet pripremiti;",
            "verse 92:8": "a onome koji tvrdiči i osjeća se neovisnim",
            "verse 92:9": "i ono najljepše smatra lažnim –",
            "verse 92:10": "njemu ćemo Džehennem pripremiti,",
            "verse 92:11": "i bogatstvo njegovo mu, kad se strovali, neće koristiti.",
            "verse 92:12": "Mi smo dužni ukazati na Pravi put,",
            "verse 92:13": "i jedino Nama pripada i onaj i ovaj svijet!",
            "verse 92:14": "Zato vas opominjem razbuktalom vatrom,",
            "verse 92:15": "u koju će ući samo nesretnik,",
            "verse 92:16": "onaj koji bude poricao i glavu okretao,",
            "verse 92:17": "a od nje će daleko biti onaj koji se bude Allaha bojao,",
            "verse 92:18": "onaj koji bude dio imetka svoga udjeljivao, da bi se očistio,",
            "verse 92:19": "ne očekujući da mu se zahvalnošću uzvrati,",
            "verse 92:20": "već jedino da bi naklonost Gospodara svoga Svevišnjeg stekao,",
            "verse 92:21": "i on će, zbilja, zadovoljan biti!"
        },
        "Bulgarian": {
            "verse 92:1": "Кълна се в нощта, когато се спуска",
            "verse 92:2": "и в деня, когато засиява,",
            "verse 92:3": "и в Онзи, Който е сътворил мъжа и жената, -",
            "verse 92:4": "вашите стремежи са различни!",
            "verse 92:5": "Който раздава и се бои,",
            "verse 92:6": "и вярва в Най-прекрасното,",
            "verse 92:7": "ще го улесним към лесното.",
            "verse 92:8": "А който е скъперник и пренебрегва,",
            "verse 92:9": "и взима за лъжа Най-прекрасното,",
            "verse 92:10": "ще го улесним към трудното",
            "verse 92:11": "и не ще го избави неговото богатство, когато пропадне.",
            "verse 92:12": "Наша грижа е напътването.",
            "verse 92:13": "На Нас принадлежи и отвъдното, и настоящето.",
            "verse 92:14": "И ви предупредих за Огъня пламтящ.",
            "verse 92:15": "Ще гори в него само злият,",
            "verse 92:16": "който отрича и се отвръща.",
            "verse 92:17": "И ще бъде предпазен от него богобоязливият,",
            "verse 92:18": "който раздава своето богатство, за да се пречисти,",
            "verse 92:19": "на никого не прави благодеяние, за да бъде възнаграден,",
            "verse 92:20": "а само в стремеж към Лика на своя Господ, Върховния.",
            "verse 92:21": "И непременно ще е доволен."
        },
        "Chinese": {
            "verse 92:1": "以笼罩时的黑夜发誓，",
            "verse 92:2": "以显著时的白昼发誓，",
            "verse 92:3": "以创造男性和女性的主发誓，",
            "verse 92:4": "你们的行为，确是不同的。",
            "verse 92:5": "至於赈济贫民，敬畏真主，",
            "verse 92:6": "且承认至善者，",
            "verse 92:7": "我将使他易於达到最易的结局。",
            "verse 92:8": "至於吝惜钱财，自谓无求，",
            "verse 92:9": "且否认至善者，",
            "verse 92:10": "我将使他易於达到最难的结局。",
            "verse 92:11": "当他沦亡的时候，他的财产於他有什麽裨益呢！",
            "verse 92:12": "我确有指导的责任，",
            "verse 92:13": "我确有後世和今世的主权。",
            "verse 92:14": "故我警告你们一种发焰的火，",
            "verse 92:15": "唯薄命者坠入其中，",
            "verse 92:16": "他否认真理，而背弃之。",
            "verse 92:17": "敬畏者，得免於火刑。",
            "verse 92:18": "他虔诚地施舍他的财产，",
            "verse 92:19": "他没有受过任何人的应报的恩德，",
            "verse 92:20": "但他施舍只是为了求他的至尊主的喜悦，",
            "verse 92:21": "他自己将来必定喜悦。"
        },
        "Danish": {
            "verse 92:1": "Bij de nacht als hij bedekt",
            "verse 92:2": "En bij de dag wanneer hij schittert",
            "verse 92:3": "En bij de schepping van man en vrouw",
            "verse 92:4": "Voorzeker, uw streven is verschillend",
            "verse 92:5": "Wat hem betreft die geeft en God vreest",
            "verse 92:6": "En het goede aanvaardt",
            "verse 92:7": "Wij zullen zijn weg effenen tot welslagen",
            "verse 92:8": "Maar hij, die vrekkig en onverschillig is",
            "verse 92:9": "En het beste verwerpt",
            "verse 92:10": "Wij zullen hem naar moeilijkheden leiden",
            "verse 92:11": "Wanneer hij te gronde gaat zullen zijn rijkdommen hem niet baten",
            "verse 92:12": "Voorwaar, het is aan Ons om te leiden",
            "verse 92:13": "En aan Ons is het Hiernamaals en ook deze wereld",
            "verse 92:14": "Daarom waarschuw Ik u voor het laaiend Vuur",
            "verse 92:15": "Niemand zal er binnengaan dan de rampzaligste",
            "verse 92:16": "Die loochent en zich afwendt",
            "verse 92:17": "Maar de rechtvaardige zal ver daarvan verwijderd worden",
            "verse 92:18": "Die zijn rijkdommen weggeeft om zich te louteren",
            "verse 92:19": "En niemand heeft Hem een gunst bewezen waarvoor hij moet worden beloond",
            "verse 92:20": "Maar hij die het welbehagen zoekt van zijn Heer, de Verhevene",
            "verse 92:21": "Weldra zal hij tevreden zijn"
        },
        "Dutch": {
            "verse 92:1": "Bij de nacht wanneer hij bedekt.",
            "verse 92:2": "Bij de dag wanneer hij beschijnt.",
            "verse 92:3": "Bij Wie de man en de vrouw schiep.",
            "verse 92:4": "Voorwaar, jullie daden zijn zeker verschillend.",
            "verse 92:5": "Wat betreft degene die geeft en (Allah) vreest.",
            "verse 92:6": "En in de goede beloning (het Paradijs) gelooft.",
            "verse 92:7": "Wij zullen voor hem het gemakkelijke vergemakkelijken.",
            "verse 92:8": "En wat betreft degene die gierig is en zich behoefteloos waant.",
            "verse 92:9": "En die de goede beloning loochent.",
            "verse 92:10": "Wij zullen voor hem het moeilijke vergemakkelijken.",
            "verse 92:11": "En zijn bezit zal hem niet baten wanneer hij (in de Hel) valt.",
            "verse 92:12": "Voorwaar, aan Ons is zeker de Leiding.",
            "verse 92:13": "En voorwaar, Ons behoort zeker het laatste (het Hiernamaals) en het eerste (het wereldse leven).",
            "verse 92:14": "Daarom waarschuw Ik jullie voor een laaiend vuur (de Hel).",
            "verse 92:15": "Daarin gaat slechts de ergste ellendeling binnen.",
            "verse 92:16": "Die loochende en zich afwendde.",
            "verse 92:17": "Maar degenen die (Allah) vrezen zal daar ver van gehouden worden.",
            "verse 92:18": "Degene die van zijn bezit geeft om zich te reinigen.",
            "verse 92:19": "En niet om voor een gunst aan iemand beloond te worden.",
            "verse 92:20": "Maar om het welbehagen van zijn Heer, de Verhevene, te zoeken.",
            "verse 92:21": "Hij zal zeker tevreden zijn."
        },
        "English": {
            "verse 92:1": "By the night when it covers",
            "verse 92:2": "And [by] the day when it appears",
            "verse 92:3": "And [by] He who created the male and female,",
            "verse 92:4": "Indeed, your efforts are diverse.",
            "verse 92:5": "As for he who gives and fears Allah",
            "verse 92:6": "And believes in the best [reward],",
            "verse 92:7": "We will ease him toward ease.",
            "verse 92:8": "But as for he who withholds and considers himself free of need",
            "verse 92:9": "And denies the best [reward],",
            "verse 92:10": "We will ease him toward difficulty.",
            "verse 92:11": "And what will his wealth avail him when he falls?",
            "verse 92:12": "Indeed, [incumbent] upon Us is guidance.",
            "verse 92:13": "And indeed, to Us belongs the Hereafter and the first [life].",
            "verse 92:14": "So I have warned you of a Fire which is blazing.",
            "verse 92:15": "None will [enter to] burn therein except the most wretched one.",
            "verse 92:16": "Who had denied and turned away.",
            "verse 92:17": "But the righteous one will avoid it -",
            "verse 92:18": "[He] who gives [from] his wealth to purify himself",
            "verse 92:19": "And not [giving] for anyone who has [done him] a favor to be rewarded",
            "verse 92:20": "But only seeking the countenance of his Lord, Most High.",
            "verse 92:21": "And he is going to be satisfied."
        },
        "Filipino": {
            "verse 92:1": "Sa pamamagitan ng Gabi habang lumulukob (sa liwanag)",
            "verse 92:2": "At sa pamamagitan ng Araw habang ito ay namamanaag sa pagsikat",
            "verse 92:3": "At sa pamamagitan Niya na lumikha ng lalaki at babae",
            "verse 92:4": "Katotohanan, ang inyong pinagsusumikapan at mga gawa ay magkakaiba (sa layunin)",
            "verse 92:5": "At sa kanya na nagbibigay (sa kawanggawa) at nananampalataya at may pangangamba kay Allah",
            "verse 92:6": "At (buong katapatan) na nananampalataya sa Al-Husna (ang Pinakamainam, alalaong baga, isang gantimpala mula kay Allah, na si Allah ang magbabayad sa anumang kanyang ginugol tungo sa Kapakanan ni Allah o maggagawad sa kanya ng Paraiso)",
            "verse 92:7": "Katotohanang gagawin Naming magaan sa kanya ang Landas patungo sa Kaluwalhatian",
            "verse 92:8": "Datapuwa’t siya na makasarili at mapag-imbot at nagpapalagay na may sarili siyang kasapatan (alalaong baga, na nasa kanya ang lahat ng bagay)",
            "verse 92:9": "At hindi nananangan sa Al-Husna (ang Pinakamainam na gantimpalang manggagaling kay Allah, tingnan ang Talata bilang)",
            "verse 92:10": "Katotohanang gagawin Naming magaan sa kanya ang Landas patungo sa Kapariwaraan",
            "verse 92:11": "At anong kapakinabangan ang maidudulot sa kanya ng kanyang kayamanan sa sandaling siya ay ibulid sa Balon (ng Apoy ng Impiyerno)",
            "verse 92:12": "Katotohanan! Nasa sa Amin ang pagbibigay ng 962 Patnubay",
            "verse 92:13": "At Katotohanang Kami ang nagtataglay (ng kapamahalaan) ng Katapusan (Kabilang Buhay) at ng Simula (ang Buhay sa mundong ito)",
            "verse 92:14": "Kaya’t kayo ay Aking binabalaan ng Naglalagablab at Umaalimpuyong Apoy (Impiyerno)",
            "verse 92:15": "walang ibang papasok dito maliban sa mga tampalasan",
            "verse 92:16": "Na nagpapasinungaling sa Katotohanan at tumatalikod",
            "verse 92:17": "Datapuwa’t sa Muttaqun (mga matimtiman at matutuwid na tao na lubos na sumasampalataya kay Allah), ay malayo rito (Impiyerno)",
            "verse 92:18": "Sila na gumugugol ng kanilang kayamanan upang magkamit ng kadalisayan (sa kanilang sarili)",
            "verse 92:19": "At wala siyang iniisip na pag-asam ng ganti sa sinuman (na kanyang dinamayan)",
            "verse 92:20": "Maliban lamang sa kanyang hangarin na mapaghanap ang Bukas na Mukha ng kanyang Panginoon, ang Kataas-taasan",
            "verse 92:21": "Katiyakang Siya ay malulugod (kung siya ay papasok na sa Paraiso). BAgo tumAnghAli"
        },
        "French": {
            "verse 92:1": "Par la nuit quand elle enveloppe tout!",
            "verse 92:2": "Par le jour quand il éclaire!",
            "verse 92:3": "Et par ce qu'Il a créé, mâle et femelle!",
            "verse 92:4": "Vos efforts sont divergents.",
            "verse 92:5": "Celui qui donne et craint (Allah)",
            "verse 92:6": "et déclare véridique la plus belle récompense",
            "verse 92:7": "Nous lui faciliterons la voie au plus grand bonheur.",
            "verse 92:8": "Et quant à celui qui est avare, se dispense (de l'adoration d'Allah),",
            "verse 92:9": "et traite de mensonge la plus belle récompense,",
            "verse 92:10": "Nous lui faciliterons la voie à la plus grande difficulté,",
            "verse 92:11": "et à rien ne lui serviront ses richesses quand il sera jeté (au Feu).",
            "verse 92:12": "C'est à Nous, certes, de guider;",
            "verse 92:13": "à Nous appartient, certes, la vie dernière et la vie présente.",
            "verse 92:14": "Je vous ai donc avertis d'un Feu qui flambe",
            "verse 92:15": "où ne brûlera que le damné,",
            "verse 92:16": "qui dément et tourne le dos;",
            "verse 92:17": "alors qu'en sera écarté le pieux,",
            "verse 92:18": "qui donne ses biens pour se purifier",
            "verse 92:19": "et auprès de qui personne ne profite d'un bienfait intéressé,",
            "verse 92:20": "mais seulement pour la recherche de La Face de son Seigneur le Très Haut.",
            "verse 92:21": "Et certes, il sera bientôt satisfait!"
        },
        "Fulah": {
            "verse 92:1": "Mi woondarii jemma si mbo arii e niɓɓidde",
            "verse 92:2": "O woondirii ñalawma sombo hunciima",
            "verse 92:3": "O woondirii ko O tagi ko gorel e deyel",
            "verse 92:4": "Pellet golle mon na ceerti",
            "verse 92:5": "Tawi ko oon tottirɗo o reenti",
            "verse 92:6": "O goonɗini baraaji golle mum",
            "verse 92:7": "Ma Min newnan mbo kala jam e newaare. @Corrected",
            "verse 92:8": "Tawi ko oon ngammbuɗo o yondinii",
            "verse 92:9": "O fenni njoɓdi",
            "verse 92:10": "Ma Min newnan mbo satteende. @Corrected",
            "verse 92:11": "Nafataa mbo jawdi makko si o saami e yiite",
            "verse 92:12": "Ko e Amen peewal woni",
            "verse 92:13": "Ko minen woodani nguurndam cakkitiɗam e ngadiɗam",
            "verse 92:14": "Njeertin Mi mon yiite huɓɓoowe",
            "verse 92:15": "Naatataange si wona ɓurɗo hiiteede",
            "verse 92:16": "Oon pennuɗo ɗuurnii",
            "verse 92:17": "Ma woɗɗita ngol ɓurɗo reentaade oon woni Abu Bakri yo welu Alla won e makko",
            "verse 92:18": "Oon tottiroowo jawdi makko ngam o laaɓa",
            "verse 92:19": "Alanah hay gooto ka Makko neemo joɓeteeɗo",
            "verse 92:20": "Tawi wonah ɗaɓɓude Alla ɓurɗo toowde O",
            "verse 92:21": "Yaama o wele"
        },
        "German": {
            "verse 92:1": "Bei der Nacht, wenn sie (alles) überdeckt,",
            "verse 92:2": "und dem Tag, wenn er (in seiner Helligkeit) erscheint,",
            "verse 92:3": "und Dem, Der das Männliche und das Weibliche erschaffen hat!",
            "verse 92:4": "Euer Bemühen ist wahrlich verschieden.",
            "verse 92:5": "Was nun jemanden angeht, der gibt und gottesfürchtig ist",
            "verse 92:6": "und das Beste für wahr hält,",
            "verse 92:7": "so werden Wir ihm den Weg zum Leichteren leicht machen.",
            "verse 92:8": "Was aber jemanden angeht, der geizt und sich für unbedürftig hält",
            "verse 92:9": "und das Beste für Lüge erklärt,",
            "verse 92:10": "so werden Wir ihm den Weg zum Schwereren leicht machen;",
            "verse 92:11": "und was soll sein Besitz ihm nützen, wenn er sich ins Verderben stürzt?",
            "verse 92:12": "Uns obliegt wahrlich die Rechtleitung.",
            "verse 92:13": "Und Uns gehört wahrlich das Jenseits und das Diesseits.",
            "verse 92:14": "So habe Ich euch gewarnt vor einem Feuer, das lodert,",
            "verse 92:15": "dem nur der Unseligste ausgesetzt sein wird,",
            "verse 92:16": "der (die Botschaft) für Lüge erklärt und sich abkehrt.",
            "verse 92:17": "Doch davon ferngehalten wird der Gottesfürchtigste werden,",
            "verse 92:18": "der seinen Besitz hingibt, um sich zu läutern,",
            "verse 92:19": "und niemand hat bei ihm eine Gunst (anzurechnen), die vergolten werden müßte,",
            "verse 92:20": "sondern (er handelt) im Trachten nach dem Angesicht seines höchsten Herrn.",
            "verse 92:21": "Und er wird wahrlich zufrieden sein."
        },
        "Hausa": {
            "verse 92:1": "Inã rantsuwa da dare a lõkacin da yake rufẽwa.",
            "verse 92:2": "Da yini a lõkacin da yake kuranyẽwa.",
            "verse 92:3": "Da abin da ya halitta namiji da mace.",
            "verse 92:4": "Lãlle ne ayyukanku, dabam-dabam suke.",
            "verse 92:5": "To, amma wanda ya yi kyauta, kuma ya yi taƙawa.",
            "verse 92:6": "Kuma ya gaskata kalma mai kyãwo.",
            "verse 92:7": "To, zã Mu sauƙaƙe masa har ya kai ga sauƙi.",
            "verse 92:8": "Kuma amma wanda ya yi rõwa, kuma ya wadãtu da kansa.",
            "verse 92:9": "Kuma ya ƙaryatar da kalma mai kyãwo.",
            "verse 92:10": "To, zã Mu sauƙaƙke masa har ya kai ga tsanani.",
            "verse 92:11": "Kuma dũkiyarsa ba ta wadãtar masa da kõme ba, a lõkacin da ya gangara (a wuta).",
            "verse 92:12": "Lãlle aikinMu ne, Mu bayyana shiriya.",
            "verse 92:13": "Kuma lalle ne Lãhira da duniya Namu ne.",
            "verse 92:14": "Sabõda haka, Na yi maku gargaɗi da wuta mai babbaka.",
            "verse 92:15": "Bãbu mai shigarta sai mafi shaƙãwa.",
            "verse 92:16": "Wanda ya ƙaryata, kuma ya jũya bãya.",
            "verse 92:17": "Kuma mafi taƙawa zai nisance ta.",
            "verse 92:18": "Wanda yake bãyar da dũkiyarsa, alhãli yana tsarkaka.",
            "verse 92:19": "Alhãli bãbu wani mai wata ni'ima wurinsa wadda ake nẽman sakamakonta.",
            "verse 92:20": "Fãce dai nẽman yardar Ubangijinsa Mafi ɗaukaka.",
            "verse 92:21": "To, lalle ne zai yarda (da sakamakon da zã a bã shi)."
        },
        "Hindi": {
            "verse 92:1": "रात की क़सम जब (सूरज को) छिपा ले",
            "verse 92:2": "और दिन की क़सम जब ख़ूब रौशन हो",
            "verse 92:3": "और उस (ज़ात) की जिसने नर व मादा को पैदा किया",
            "verse 92:4": "कि बेशक तुम्हारी कोशिश तरह तरह की है",
            "verse 92:5": "तो जिसने सख़ावत की और अच्छी बात (इस्लाम) की तस्दीक़ की",
            "verse 92:6": "तो हम उसके लिए राहत व आसानी",
            "verse 92:7": "(जन्नत) के असबाब मुहय्या कर देंगे",
            "verse 92:8": "और जिसने बुख्ल किया, और बेपरवाई की",
            "verse 92:9": "और अच्छी बात को झुठलाया",
            "verse 92:10": "तो हम उसे सख्ती (जहन्नुम) में पहुँचा देंगे,",
            "verse 92:11": "और जब वह हलाक होगा तो उसका माल उसके कुछ भी काम न आएगा",
            "verse 92:12": "हमें राह दिखा देना ज़रूर है",
            "verse 92:13": "और आख़ेरत और दुनिया (दोनों) ख़ास हमारी चीज़े हैं",
            "verse 92:14": "तो हमने तुम्हें भड़कती हुई आग से डरा दिया",
            "verse 92:15": "उसमें बस वही दाख़िल होगा जो बड़ा बदबख्त है",
            "verse 92:16": "जिसने झुठलाया और मुँह फेर लिया और जो बड़ा परहेज़गार है",
            "verse 92:17": "वह उससे बचा लिया जाएगा",
            "verse 92:18": "जो अपना माल (ख़ुदा की राह) में देता है ताकि पाक हो जाए",
            "verse 92:19": "और लुत्फ ये है कि किसी का उस पर कोई एहसान नहीं जिसका उसे बदला दिया जाता है",
            "verse 92:20": "बल्कि (वह तो) सिर्फ अपने आलीशान परवरदिगार की ख़ुशनूदी हासिल करने के लिए (देता है)",
            "verse 92:21": "और वह अनक़रीब भी ख़ुश हो जाएगा"
        },
        "Indonesian": {
            "verse 92:1": "Demi malam apabila menutupi (cahaya siang),",
            "verse 92:2": "dan siang apabila terang benderang,",
            "verse 92:3": "dan penciptaan laki-laki dan perempuan,",
            "verse 92:4": "sesungguhnya usaha kamu memang berbeda-beda.",
            "verse 92:5": "Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa,",
            "verse 92:6": "dan membenarkan adanya pahala yang terbaik (surga),",
            "verse 92:7": "maka Kami kelak akan menyiapkan baginya jalan yang mudah.",
            "verse 92:8": "Dan adapun orang-orang yang bakhil dan merasa dirinya cukup,",
            "verse 92:9": "serta mendustakan pahala terbaik,",
            "verse 92:10": "maka kelak Kami akan menyiapkan baginya (jalan) yang sukar.",
            "verse 92:11": "Dan hartanya tidak bermanfaat baginya apabila ia telah binasa.",
            "verse 92:12": "Sesungguhnya kewajiban Kamilah memberi petunjuk,",
            "verse 92:13": "dan sesungguhnya kepunyaan Kamilah akhirat dan dunia.",
            "verse 92:14": "Maka, kami memperingatkan kamu dengan neraka yang menyala-nyala.",
            "verse 92:15": "Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka,",
            "verse 92:16": "yang mendustakan (kebenaran) dan berpaling (dari iman).",
            "verse 92:17": "Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu,",
            "verse 92:18": "yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,",
            "verse 92:19": "padahal tidak ada seseorangpun memberikan suatu nikmat kepadanya yang harus dibalasnya,",
            "verse 92:20": "tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Tuhannya yang Maha Tinggi.",
            "verse 92:21": "Dan kelak dia benar-benar mendapat kepuasan."
        },
        "Italian": {
            "verse 92:1": "Per la notte quando avvolge [con le sue tenebre],",
            "verse 92:2": "per il giorno quando risplende,",
            "verse 92:3": "per Colui Che ha creato il maschio e la femmina.",
            "verse 92:4": "Invero i vostri sforzi divergono.",
            "verse 92:5": "A chi sarà stato generoso e timorato",
            "verse 92:6": "e avrà attestato la verità della cosa più bella,",
            "verse 92:7": "faciliteremo il facile;",
            "verse 92:8": "a chi invece sarà stato avaro e avrà creduto di bastare a se stesso",
            "verse 92:9": "e tacciato di menzogna la cosa più bella,",
            "verse 92:10": "faciliteremo il difficile.",
            "verse 92:11": "Quando precipiterà [nell'abisso], a nulla gli serviranno i suoi beni!",
            "verse 92:12": "In verità spetta a Noi la guida!",
            "verse 92:13": "In verità a Noi appartengono l'altra vita e questa vita.",
            "verse 92:14": "Vi ho dunque messo in guardia da un fuoco fiammeggiante,",
            "verse 92:15": "nel quale brucerà solo il malvagio,",
            "verse 92:16": "che avrà tacciato di menzogna e avrà girato le spalle;",
            "verse 92:17": "mentre ne sarà preservato il timorato,",
            "verse 92:18": "che dà dei suoi beni per purificarsi,",
            "verse 92:19": "che a nessuno avrà fatto un bene per ottenere ricompensa,",
            "verse 92:20": "ma solo per amore del suo Signore l'Altissimo.",
            "verse 92:21": "Per certo sarà soddisfatto."
        },
        "Japanese": {
            "verse 92:1": "覆われる夜において，",
            "verse 92:2": "輝く昼において，",
            "verse 92:3": "男女を創造された御方において（誓う）。",
            "verse 92:4": "あなたがたの努力は，本当に多様（な結末）である。",
            "verse 92:5": "それで施しをなし，主を畏れる者，",
            "verse 92:6": "また至善を実証する者には，",
            "verse 92:7": "われは（至福への道を）容易にしよう。",
            "verse 92:8": "だが強欲で，自惚れている者，",
            "verse 92:9": "至善を拒否する者には，",
            "verse 92:10": "われは（苦難への道を）容易にするであろう。",
            "verse 92:11": "かれが滅び去ろうとする時，その富はかれに役立たないであろう。",
            "verse 92:12": "本当に導きはわれにあり，",
            "verse 92:13": "来世も現世もわれに属する。",
            "verse 92:14": "それでわれは燃え盛る業火に就いてあなたがたに警告した。",
            "verse 92:15": "最も不幸な者でない限り，誰もそれで焼かれない。",
            "verse 92:16": "それは（真理を）嘘であると言い背き去った者。",
            "verse 92:17": "だが（主のために）忠誠の限りを尽した者は，それから救われ，",
            "verse 92:18": "その富を施し，自分を清める。",
            "verse 92:19": "また誰からも，慈悲の報酬を求めない。",
            "verse 92:20": "一生懸命に至高者，主の御顔を請うだけである。",
            "verse 92:21": "やがて，かれは（十分に）満足出来るであろう。"
        },
        "Jawa": {
            "verse 92:1": "Demi wengi nalikane nutupi awan kelawan petenge",
            "verse 92:2": "Lan awan nalikane lahir gumelar",
            "verse 92:3": "Sarta tumitahing lanang lan wadon",
            "verse 92:4": "Satemene lakunira para manungsa, beda - beda",
            "verse 92:5": "Dene sapa wongkang we-wehsarta anjaga dirine (saka ala)",
            "verse 92:6": "Lan benerake kang becik",
            "verse 92:7": "Bakal Ingsun gampangake marang kawusanan kang gampang",
            "verse 92:8": "Dene wong kang kumed (cethil) sarta rumangsa ora butuh (marang Allah)",
            "verse 92:9": "Apa dene nampik barang kang becik",
            "verse 92:10": "Bakal Ingsun gampangake marang kawusanan kang angel",
            "verse 92:11": "Bandhane ora migunani apa - apa manawa dheweke wis sirna",
            "verse 92:12": "Sayekti nuduhake dalan iku tanggungan Ingsun",
            "verse 92:13": "Lan sayekti akherat sarta dunya iku Ingsun kang kagungan",
            "verse 92:14": "Mulane Ingsun ngelengake marang sira, geni kang mulad - mulad",
            "verse 92:15": "Ora mlebu mrunu kejaba kang banget cilaka",
            "verse 92:16": "Kang maido kasunyatan lan mlengos",
            "verse 92:17": "Lan bakal diedohake saka wong kang banget anggone anjaga dhirine (saka ing ala)",
            "verse 92:18": "Kang mewehake bandhane, anuceni dirine",
            "verse 92:19": "Ora ana wong siji kang oleh ganjaran kabungan ana ngarsane Allah",
            "verse 92:20": "Kajaba yen anggone ngelakoni kabecikan, murih keparenge Pangeran kang Maha Luhur",
            "verse 92:21": "Ing tembe bakal lega atine nampani ganjaran"
        },
        "Kazakh": {
            "verse 92:1": "Ант етемін, қараңғылығы жапқан кездегі түнмен",
            "verse 92:2": "және жарық болған кездегі күндізбен",
            "verse 92:3": "әрі ер мен әйелді Жаратқанмен",
            "verse 92:4": "Негізінде, сендердің ұмтылыстарың әртүрлі",
            "verse 92:5": "Ал, кім берсе және тақуалық етсе Раббысының жазасынан қорқып, сақтанса",
            "verse 92:6": "әрі ең жақсыны шын деп білсе",
            "verse 92:7": "жақында Біз оған ең жеңілін оңайластырамыз",
            "verse 92:8": "Ал, кім сараңдық істесе, қажетсінбесе",
            "verse 92:9": "және ең жақсыны өтірік деп білсе",
            "verse 92:10": "жақында Біз оған ең ауырын оңайластырамыз",
            "verse 92:11": "Ол құлағанда, дүние-мүлкі оған пайда бермейді",
            "verse 92:12": "Анығында, тура жолмен жүргізу Бізге тән",
            "verse 92:13": "Әрі шын мәнінде соңғы, мәңгілік өмір де ақирет те және алғашқысы да осы өмір де Біздікі",
            "verse 92:14": "Міне, Мен сендерді жалындаған Оттан сақтандырып ескерттім",
            "verse 92:15": "оған ең бақытсыз ғана кіреді",
            "verse 92:16": "сондай өтірік деп, теріс бұрылғандар",
            "verse 92:17": "Одан тақуалық еткендер Аллаһтың жазасынанқорқып, сақтанғандар ғана алыстатылады",
            "verse 92:18": "сондай, мал-дүниесінен беріп тазарған",
            "verse 92:19": "біреулерге беруге міндетті болмасада",
            "verse 92:20": "ол тек аса жоғары Раббысының дидарына ұмтылып қана береді",
            "verse 92:21": "Әрі ол сөзсіз, жақында разы болады"
        },
        "Korean": {
            "verse 92:1": "어두워지는 밤을 두고 맹세하사어두워지는 밤을 두고 맹세하사",
            "verse 92:2": "빛을 비추이는 낮을 두고 맹 세하며빛을 비추이는 낮을 두고 맹 세하며",
            "verse 92:3": "남녀를 창조하신 주님을 두고 맹세하나니남녀를 창조하신 주님을 두고 맹세하나니",
            "verse 92:4": "실로 너희들의 행위는 여러가 지라실로 너희들의 행위는 여러가 지라",
            "verse 92:5": "자선을 베풀고 두려워 하며자선을 베풀고 두려워 하며",
            "verse 92:6": "진리를 증언하는 자를 위해진리를 증언하는 자를 위해",
            "verse 92:7": "하나님은 그가 축복으로 가는 길을 쉽게 하여 주시노라하나님은 그가 축복으로 가는 길을 쉽게 하여 주시노라",
            "verse 92:8": "그러나 인색하고 자기자신이 충만하다고 생각하며그러나 인색하고 자기자신이 충만하다고 생각하며",
            "verse 92:9": "진리를 거역하는자진리를 거역하는자",
            "verse 92:10": "하나님은 그가 불행으로 가 는 길을 쉽게 하리니하나님은 그가 불행으로 가 는 길을 쉽게 하리니",
            "verse 92:11": "그가 지옥으로 향할 때는 그 의 재산이 그를 유익하게 못하니라그가 지옥으로 향할 때는 그 의 재산이 그를 유익하게 못하니라",
            "verse 92:12": "인도하는 것은 하나님의 일 이라인도하는 것은 하나님의 일 이라",
            "verse 92:13": "내세와 현세도 그분께 있노라내세와 현세도 그분께 있노라",
            "verse 92:14": "그러므로 내가 너희에게 격 렬하게 타오르는 불지옥을 경고하 나니그러므로 내가 너희에게 격 렬하게 타오르는 불지옥을 경고하 나니",
            "verse 92:15": "가장 불행한 자들만이 그곳 에 이르게 되니라가장 불행한 자들만이 그곳 에 이르게 되니라",
            "verse 92:16": "그는 바로 진리를 거역하고 외면하는 자라그는 바로 진리를 거역하고 외면하는 자라",
            "verse 92:17": "그러나 하나님께 헌신하는 자는 그곳으로부터 제외 되거늘그러나 하나님께 헌신하는 자는 그곳으로부터 제외 되거늘",
            "verse 92:18": "이들은 그들의 재산을 바치 며 스스로를 순결케 하사이들은 그들의 재산을 바치 며 스스로를 순결케 하사",
            "verse 92:19": "그가 베푼 은혜에 대한 보상을 그의 마음속에 갖지 아니하고그가 베푼 은혜에 대한 보상을 그의 마음속에 갖지 아니하고",
            "verse 92:20": "오직 가장 위에 계시는 주님 을 기쁘게 하고자 하는 소망을 가 진 자들로오직 가장 위에 계시는 주님 을 기쁘게 하고자 하는 소망을 가 진 자들로",
            "verse 92:21": "이들은 곧 완전한 기쁨을 누 리게 되리라이들은 곧 완전한 기쁨을 누 리게 되리라"
        },
        "Kurdish": {
            "verse 92:1": "Bi şeva gava taritî ewê som dikeسوێند به شه‌و کاتێک دنیا داده‌گرێت...",
            "verse 92:2": "Bi roya gava derdikeve (rohnaî dike)به ڕۆژ کاتێک دنیا ڕووناک ده‌بێت و تاریکی ده‌ڕه‌وێنێته‌وه‌.",
            "verse 92:3": "Bi wîyê ku nêr û mê afirandîyeسوێند به‌و زاته‌ی که نێر و مێی دروست کردووه‌.",
            "verse 92:4": "(Sond dixum!) ku xebata we bi rastî cure û cureyeبه‌ڕاستی هه‌وڵ و کۆششی ئێوه جۆراو جۆره (هه‌تانه هه‌وڵ و کۆششی بۆ به‌ده‌ستهێنانی به‌هه‌شته‌، هه‌تانه به پێچه‌وانه‌وه به ده‌ست و برده بۆ ئه‌نجامدانی تاوان و خراپکاری، هه‌تانه گوێڕایه‌ڵ و هه‌تانه یاخی... هتد).",
            "verse 92:5": "Îdî kîjan (ji bona xezanan ra mal) bi sixurîne û Xuda parizî bikeجا ئه‌وه‌ی (ماڵ و سامان و زانستی و... هتد) ده‌به‌خشێت و پارێزکار و له خوانرسه‌...",
            "verse 92:6": "Û (perestîne) qenc jî bike û rast bi dêrîneبڕوای بته‌وی به پاداشتی چاک و به‌نرخی خوایی هه‌یه‌...",
            "verse 92:7": "Îdî emê ji bona wî ra (hatina li bal rêya rast da) hêsanî bikinئه‌وه ڕێگه‌ی چاکه و چاکه‌کاری بۆ ئاسان ده‌که‌ین و سه‌رئه‌نجام ده‌یخه‌ینه خێر و خۆشیه‌وه‌.",
            "verse 92:8": "Kîjan jî çikûsî bike û xwe (ji Yezdan) ne hewce bibîneبه‌ڵام ئه‌وه‌ی ڕه‌زیل و ده‌ست نوقاو بێت و خۆی بێ نیاز بزانێت (ره‌زامه‌ندی خوایی مه‌به‌ست نه‌بێت)...",
            "verse 92:9": "Û qencê (gotinan jî) bide derewdêrandinêبڕوای نه‌بێت به پاداشت و به‌هره‌ی چاکی خوایی و به‌درۆی بزانێت...",
            "verse 92:10": "Îdî emê ji bona wî ra (çûna li bal rêne zehmet da) hêsanî bikinئه‌وه ئێمه ڕێبازی ته‌نگانه و ناخۆشی بۆ ئاسان ده‌که‌ین و سه‌رئه‌نجام به دۆزه‌خی ده‌گه‌یه‌نین.",
            "verse 92:11": "Û gava ewa bikeVe dojê, malê wî qe ji bona wî ra tu karê nakeئه‌و کاته‌ی که ده‌مرێت و له گۆڕ ده‌نرێت، ئه‌و کاته‌ش که فڕێ ده‌درێته دۆزه‌خه‌وه ماڵ و سامان هیچ فریای ناکه‌وێت.",
            "verse 92:12": "Loma bi rastî hatina wî li bal rêya rast da li ser meyeبه‌ڕاستی ڕوون کردنه‌وه‌ی ڕێبازی هیدایه‌ت و دیاریکردنی بۆ خه‌ڵکی له‌سه‌ر ئێمه‌یه‌.",
            "verse 92:13": "Û bi rastî cihan û parada jî ji bona me ra neبێگومان ده‌سه‌ڵاتی بێ سنورمان هه‌یه به‌سه‌ر پاشه‌ڕۆژ و قیامه‌تدا، هه‌روه‌ها به‌سه‌ر دنیادا.",
            "verse 92:14": "Îdî min hûn (gelî gunehkaran!) Bi agirekî pêtdayî dane hişyar kirinêجا من ئه‌وه‌ته ئاگادارتان ده‌که‌م و ده‌تانترسێنم له ئاگرێک که زۆر بڵێسه ده‌سێنێت.",
            "verse 92:15": "Ji pêştirê wanê rûreşê ji rêya rast derketî, tu kes nakeve wî agirîناچێته ناوی مه‌گه‌ر که‌سانی ناپوخت و دڕنده و خوانه‌ناس نه‌بێت.",
            "verse 92:16": "Ewî (rûreşê) maf daye derewdêrandinê, pişta xwe daye (mafê)ئه‌وه‌ی حه‌قیقه‌ت و ڕاستی به درۆ داناوه و پشتی هه‌ڵکردووه (له به‌رنامه‌ی خوا).",
            "verse 92:17": "Bi rastî ji wî (agirî) merivê Xuda pariz tê dûr xistinêجا خواناس و پارێزکاران له‌و سزاو ناگرو ناخۆشیه دوور ده‌خرێنه‌وه‌.",
            "verse 92:18": "(Ewê Xuda pariz) ew e, ku malê xwe (di rêya Yezdan da )sixurandîye (mali xwe) paqij kirîyeئه‌و جۆره که‌سه‌ی ماڵ و سامانی ده‌به‌خشێت به‌وه دڵ و ده‌روونی خۆی خاوێن ڕاده‌گرێت...",
            "verse 92:19": "Û (li bal Yezdan) ji bona tu kesekî ra qe tu qencîyek tuneye, ku ewan bi wê qencîyê bêne xelat kirinêله کاتێکدا که‌که‌س چاکه‌یه‌کی وای به‌سه‌ریه‌وه نی یه که پاداشت بدرێته‌وه‌.",
            "verse 92:20": "Ji pêştirê (maldana) ji bona qayîl bûna (Xuda yê xwe) yê bililindtir (heke dabe)(چونکه‌) ته‌نها مه‌به‌ستی به‌ده‌ستهێنانی ڕه‌زامه‌ندیی په‌روه‌ردگاری به‌رزو بڵنده‌.",
            "verse 92:21": "Di nêzîk da jî (ewa qencîya) ku Xuda yê wî (ji bona wî ra bide, ewê) bi wê qencîyê qayîl bibeسوێند به‌خوا ڕازی و خۆشنوود ده‌بێت پێی."
        },
        "Kyrgyz": {
            "verse 92:1": "(Ааламдарды караңгылыгы менен) каптаган түнгө ант",
            "verse 92:2": "(Жарыгы менен) көрүнгөн күндүзгө ант",
            "verse 92:3": "Жана эркек менен ургаачыны жараткан Затка ант",
            "verse 92:4": "Албетте (о, инсандар) силердин аракетиңер ар кандай",
            "verse 92:5": "Ким (садака) берсе жана такыба кылса",
            "verse 92:6": "жана жакшылыкты (Исламды) тастыктаса —",
            "verse 92:7": "Биз ага жакшылыкты (бактылуу жашоону) жеңил кылабыз",
            "verse 92:8": "Ал эми, ким (байлыгын Аллаһ жолуна сарп кылуудан) сараңдык кылса жана (Аллаһ бере турган соопту) “керек эмес” десе",
            "verse 92:9": "Жана ыйманды жалган десе",
            "verse 92:10": "Биз ага түйшүктүү жолго түшүүнү жеңил кылабыз",
            "verse 92:11": "(Тозокко) оңкосунан сайылган убакта (кызганган) мал-мүлкү ага пайда бербей калат",
            "verse 92:12": "Албетте, (адамдарды) Туура Жолго баштоо Бизге гана таандык иш",
            "verse 92:13": "Аныгында, Акырет (жашоосу) да, Дүйнө (жашоосу) да Биздин ыктыярыбызда",
            "verse 92:14": "Мен силерди алоолонгон оттон эскерттим",
            "verse 92:15": "Ал отко шору каткан адам гана кирет",
            "verse 92:16": "Ал (Исламды) жалган деп (чындыктан) жүз бурган",
            "verse 92:17": "Андан (тозоктон) такыбаа киши ыраак болот",
            "verse 92:18": "Ал мал-мүлкүн (Аллаһ жолунда) берип, (өзүн сараңдыктан) тазалаган киши",
            "verse 92:19": "Ал адамда эч ким үчүн (ордуна) сыйлык кайтарыла турган жакшылык жок",
            "verse 92:20": "(Анын бардык жакшылыктары) эң жогорку Раббисинин ыраазычылыгы үчүн гана (жасалат)",
            "verse 92:21": "Жакында (Аллаһ аны чоң сыйлык менен сыйлайт. Ошондо ал дагы Раббисинен) ыраазы болот"
        },
        "Malay": {
            "verse 92:1": "Demi malam apabila ia menyelubungi segala-galanya (dengan gelap-gelitanya),",
            "verse 92:2": "Dan siang apabila ia lahir terang-benderang;",
            "verse 92:3": "Demi Yang menciptakan (makhluk-makhlukNya) lelaki dan perempuan, (jantan dan betina); -",
            "verse 92:4": "Sesungguhnya amal usaha kamu adalah berbagai-bagai keadaannya.",
            "verse 92:5": "Jelasnya: adapun orang yang memberikan apa yang ada padanya ke jalan kebaikan dan bertaqwa (mengerjakan suruhan Allah dan meninggalkan segala laranganNya), -",
            "verse 92:6": "Serta ia mengakui dengan yakin akan perkara yang baik,",
            "verse 92:7": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesenangan (Syurga).",
            "verse 92:8": "Sebaliknya: orang yang bakhil (daripada berbuat kebajikan) dan merasa cukup dengan kekayaan dan kemewahannya, -",
            "verse 92:9": "Serta ia mendustakan perkara yang baik,",
            "verse 92:10": "Maka sesungguhnya Kami akan memberikannya kemudahan untuk mendapat kesusahan dan kesengsaraan;",
            "verse 92:11": "Dan apakah pertolongan yang dapat diberi kepadanya oleh hartanya apabiha ia telah terjerumus (ke dalam azab seksa hari akhirat)?",
            "verse 92:12": "Sesungguhnya tanggungan Kamilah memberi hidayah petunjuk (tentang yang benar dan yang salah).",
            "verse 92:13": "Dan sesungguhnya Kamilah yang menguasai hari akhirat dan alam dunia.",
            "verse 92:14": "Maka (serentak dengan memberi hidayah petunjuk) Aku juga telah memberi amaran mengingatkan kamu akan api neraka yang marak menjulang,",
            "verse 92:15": "Yang tidak akan menderita bakarannya melainkan orang yang sungguh celaka, -",
            "verse 92:16": "Yang telah mendustakan (kebenaran) dan berpaling ingkar.",
            "verse 92:17": "Dan (sebaliknya) akan dijauhkan (azab neraka) itu daripada orang yang sungguh bertaqwa, -",
            "verse 92:18": "Yang mendermakan hartanya dengan tujuan membersihkan dirinya dan hartabendanya,",
            "verse 92:19": "Sedang ia tidak menanggung budi sesiapapun, yang patut di balas,",
            "verse 92:20": "Hanyalah mengharapkan keredaan Tuhannya Yang Maha Tinggi;",
            "verse 92:21": "Dan demi sesungguhnya, ia tetap akan berpuas hati (pada hari akhirat, dengan mendapat segala yang diharapkannya)."
        },
        "Malayalam": {
            "verse 92:1": "രാവിനെതന്നെയാണ സത്യം ; അത് മൂടികൊണ്ടിരിക്കുമ്പോള്‍",
            "verse 92:2": "പകലിനെ തന്നെയാണ സത്യം ; അത് പ്രത്യക്ഷപ്പെടുമ്പോള്‍",
            "verse 92:3": "ആണിനെയും പെണ്ണിനെയും സൃഷ്ടിച്ച രീതിയെ തന്നെയാണ സത്യം;",
            "verse 92:4": "തീര്‍ച്ചയായും നിങ്ങളുടെ പരിശ്രമം വിഭിന്ന രൂപത്തിലുള്ളതാകുന്നു.",
            "verse 92:5": "എന്നാല്‍ ഏതൊരാള്‍ ദാനം നല്‍കുകയും, സൂക്ഷ്മത പാലിക്കുകയും",
            "verse 92:6": "ഏറ്റവും ഉത്തമമായതിനെ സത്യപ്പെടുത്തുകയും ചെയ്തുവോ",
            "verse 92:7": "അവന്നു നാം ഏറ്റവും എളുപ്പമായതിലേക്ക് സൌകര്യപ്പെടുത്തി കൊടുക്കുന്നതാണ്‌.",
            "verse 92:8": "എന്നാല്‍ ആര്‍ പിശുക്കു കാണിക്കുകയും, സ്വയം പര്യാപ്തത നടിക്കുകയും,",
            "verse 92:9": "ഏറ്റവും ഉത്തമമായതിനെ നിഷേധിച്ചു തള്ളുകയും ചെയ്തുവോ",
            "verse 92:10": "അവന്നു നാം ഏറ്റവും ഞെരുക്കമുള്ളതിലേക്ക് സൌകര്യമൊരുക്കികൊടുക്കുന്നതാണ്‌.",
            "verse 92:11": "അവന്‍ നാശത്തില്‍ പതിക്കുമ്പോള്‍ അവന്‍റെ ധനം അവന്ന് പ്രയോജനപ്പെടുന്നതല്ല.",
            "verse 92:12": "തീര്‍ച്ചയായും മാര്‍ഗദര്‍ശനം നമ്മുടെ ബാധ്യതയാകുന്നു.",
            "verse 92:13": "തീര്‍ച്ചയായും നമുക്കുള്ളതാകുന്നു പരലോകവും ഇഹലോകവും.",
            "verse 92:14": "അതിനാല്‍ ആളിക്കത്തിക്കൊണ്ടിരിക്കുന്ന അഗ്നിയെപ്പറ്റി ഞാന്‍ നിങ്ങള്‍ക്ക് താക്കീത് നല്‍കിയിരിക്കുന്നു.",
            "verse 92:15": "ഏറ്റവും ദുഷ്ടനായ വ്യക്തിയല്ലാതെ അതില്‍ പ്രവേശിക്കുകയില്ല.",
            "verse 92:16": "നിഷേധിച്ചു തള്ളുകയും, പിന്തിരിഞ്ഞു കളയുകയും (വ്യക്തി)",
            "verse 92:17": "ഏറ്റവും സൂക്ഷ്മതയുള്ള വ്യക്തി അതില്‍ നിന്ന് അകറ്റി നിര്‍ത്തപ്പെടുന്നതാണ്‌.",
            "verse 92:18": "പരിശുദ്ധിനേടുവാനായി തന്‍റെ ധനം നല്‍കുന്ന (വ്യക്തി)",
            "verse 92:19": "പ്രത്യുപകാരം നല്‍കപ്പെടേണ്ടതായ യാതൊരു അനുഗ്രഹവും അവന്‍റെ പക്കല്‍ ഒരാള്‍ക്കുമില്ല.",
            "verse 92:20": "തന്‍റെ അത്യുന്നതനായ രക്ഷിതാവിന്‍റെ പ്രീതി തേടുക എന്നതല്ലാതെ.",
            "verse 92:21": "വഴിയെ അവന്‍ തൃപ്തിപ്പെടുന്നതാണ്‌."
        },
        "Norwegian": {
            "verse 92:1": "Ved natten når den dekker til!",
            "verse 92:2": "Ved dagen når den stråler opp!",
            "verse 92:3": "Ved Han som skapte mann og kvinne!",
            "verse 92:4": "Deres innsats er visselig av mange slag.",
            "verse 92:5": "Hva ham angår, som gir gaver og viser gudsfrykt,",
            "verse 92:6": "og tror på det beste,",
            "verse 92:7": "ham vil Vi lette det for hen til lettelsen.",
            "verse 92:8": "Men hva ham angår, som er gjerrig og seg selv nok,",
            "verse 92:9": "og fornekter det beste,",
            "verse 92:10": "ham vil Vi lette det for hen til det tunge,",
            "verse 92:11": "og hans rikdom kan ikke hjelpe ham når han går i fortapelsen.",
            "verse 92:12": "Ledelsen er visselig Vår sak,",
            "verse 92:13": "og Vårt er det siste, og det første.",
            "verse 92:14": "Så advarer Jeg dere da mot en flammende Ild,",
            "verse 92:15": "hvor bare den elendigste skal havne,",
            "verse 92:16": "han som fornekter og vender ryggen til.",
            "verse 92:17": "Men den fromme og gudfryktige skal holdes unna den",
            "verse 92:18": "som gir ut det han eier for å rense seg,",
            "verse 92:19": "og som ikke viser noen en gunst for at den skal gjengjeldes,",
            "verse 92:20": "men kun søker Herrens, den Høyestes velbehag.",
            "verse 92:21": "Han skal visselig bli tilfreds!"
        },
        "Pashto": {
            "verse 92:1": "قسم دى په شپه كله چې دا (هر شى) پټ كړي",
            "verse 92:2": "او په ورځ باندې كله چې روښانه شي",
            "verse 92:3": "او په هغه ذات باندې چې نر او ښځه يې پیدا كړي دي",
            "verse 92:4": "چې بېشكه ستاسو سعي (او عمل) خامخا بېل بېل دي",
            "verse 92:5": "نو هر چې هغه څوك دى چې وركړه كوي او وېرېږي",
            "verse 92:6": "او د ډېرې ښكلې كلمې تصدیق كوي",
            "verse 92:7": "نو مونږ به ضرور ده ته د اسانې لارې اسانتیا وركړو",
            "verse 92:8": "او هر چې هغه څوك دى چې بخیلي كوي او بې پروايي كوي",
            "verse 92:9": "او د ډېرې ښكلې كلمې تكذیب كوي (دروغ يې ګڼي)",
            "verse 92:10": "نو مونږ به ضرور ده ته د سختې لارې اسانتیا وركړو",
            "verse 92:11": "او كله چې دى په كنده كې غورځېږي (هلاكېږي، نو) د ده مال به د ده هېڅ په كار رانشي",
            "verse 92:12": "بېشكه خاص زمونږ په ذمه خامخا لاره ښوول دي",
            "verse 92:13": "او بېشكه خاص زمونږ لپاره اخرت او دنیا ده (د دواړو اختيار دى)",
            "verse 92:14": "نوما تاسو له داسې اوره ووېرولئ چې لمبې وهي",
            "verse 92:15": "ده ته به نه ننوځي مګر ترټولو بدبخته",
            "verse 92:16": "هغه چې تكذیب يې كړى او مخ يې (له حقه) ګرځولى دى",
            "verse 92:17": "او له ده نه به خامخا لرې ساتلى شي ښه وېرېدونكى",
            "verse 92:18": "هغه چې خپل مال د دې لپاره وركوي چې پاك شي",
            "verse 92:19": "او له ده سره (د ده په غاړه) د هیچا لپاره څه نعمت (او احسان) نشته چې بدله يې وركولى شي",
            "verse 92:20": "مګر د خپل رب د مخ لټونې لپاره چې تر ټولو اوچت دى",
            "verse 92:21": "او خامخا ژر به دى راضي شي`"
        },
        "Persian": {
            "verse 92:1": "سوگند به شب آنگاه كه جهان را در خود فرو پوشد،",
            "verse 92:2": "و سوگند به روز آنگاه كه آشكار شود،",
            "verse 92:3": "و سوگند به آن كه نر و ماده را بيافريد،",
            "verse 92:4": "كه: حاصل كوششهاى شما متفاوت است.",
            "verse 92:5": "اما كسى كه بخشايش و پرهيزگارى كرد،",
            "verse 92:6": "و آن بهترين را تصديق كرد،",
            "verse 92:7": "پس براى بهشت آماده‌اش مى‌كنيم.",
            "verse 92:8": "اما آن كس كه بخل و بى نيازى ورزيد،",
            "verse 92:9": "و آن بهترين را تكذيب كرد،",
            "verse 92:10": "او را براى دوزخ آماده مى‌سازيم.",
            "verse 92:11": "و چون هلاكش دررسد، دارايى‌اش به حالش سود نبخشد.",
            "verse 92:12": "و آنچه بر ماست راهنمايى است.",
            "verse 92:13": "و از آنِ ماست آن جهان و اين جهان.",
            "verse 92:14": "پس شما را از آتشى كه زبانه مى‌كشد مى‌ترسانم.",
            "verse 92:15": "جز اهل شقاوت بدان درنيفتد:",
            "verse 92:16": "آن كه تكذيب كرد و رويگردان شد.",
            "verse 92:17": "و پرهيزگارترين مردم را از آن دور دارند:",
            "verse 92:18": "آن كه مال خويش مى‌بخشايد و پاكى مى‌جويد.",
            "verse 92:19": "و هيچ كس را بر او حقى نباشد كه اينك پاداش خواهد،",
            "verse 92:20": "مگر جستن خشنودى پروردگار والاى خويش.",
            "verse 92:21": "و زودا كه خشنود شود."
        },
        "Polish": {
            "verse 92:1": "Na noc, kiedy okrywa ciemnością!",
            "verse 92:2": "Na dzień, kiedy jaśnieje blaskiem!",
            "verse 92:3": "Na Tego, który stworzył mężczyznę i kobietę!",
            "verse 92:4": "Zaprawdę, wysiłki wasze są różnorodne!",
            "verse 92:5": "Ale ten, kto daje i jest bogobojny,",
            "verse 92:6": "I uznaje za prawdę nagrodę najpiękniejszą",
            "verse 92:7": "- temu My ułatwimy dostęp do szczęścia.",
            "verse 92:8": "A ten, kto skąpi i szuka bogactwa,",
            "verse 92:9": "I za kłamstwo uważa nagrodę najpiękniejszą",
            "verse 92:10": "- na tego My sprowadzimy nieszczęście.",
            "verse 92:11": "Na nic mu się zda jego majątek, kiedy się sam zaprzepaści.",
            "verse 92:12": "Zaprawdę, na Nas spoczywa kierowanie na drogę prostą!",
            "verse 92:13": "I, zaprawdę, do Nas należy życie ostateczne i pierwsze!",
            "verse 92:14": "Przeto ostrzegam was przed ogniem, który płonie!",
            "verse 92:15": "Pali się w nim tylko najnieszczęśliwszy;",
            "verse 92:16": "Ten, który zaprzeczał i odwracał się.",
            "verse 92:17": "Lecz zostanie odsunięty od niego bogobojny,",
            "verse 92:18": "Który daje swój majątek, by się oczyścić.",
            "verse 92:19": "On nie wyświadcza nikomu dobrodziejstwa, po to by otrzymać nagrodę,",
            "verse 92:20": "Lecz jedynie z tęsknoty do oblicza swego Pana - Najwyższego!",
            "verse 92:21": "On z pewnością będzie zadowolony!"
        },
        "Portuguese": {
            "verse 92:1": "Pela noite, quando cobre (a luz),",
            "verse 92:2": "Pelo dia, quando resplandece,",
            "verse 92:3": "Por Quem criou o masculino e o feminino,",
            "verse 92:4": "Que os vossos esforços são diferentes (quanto às metas a atingir).",
            "verse 92:5": "Porém, àquele que dá (em caridade e é temente a Deus,",
            "verse 92:6": "E crê no melhor,",
            "verse 92:7": "Facilitaremos o caminho do conforto.",
            "verse 92:8": "Porém, àquele que mesquinhar e se considerar suficiente,",
            "verse 92:9": "E negar o melhor,",
            "verse 92:10": "Facilitaremos o caminho da adversidade.",
            "verse 92:11": "E de nada lhe valerão os seus bens, quando ele cair no abismo.",
            "verse 92:12": "Sabei que a Nós incumbe a orientação,",
            "verse 92:13": "Assim como também são Nossos o fim e o começo.",
            "verse 92:14": "Por isso, vos tenho admoestado com o fogo voraz,",
            "verse 92:15": "Em que não entrará senão o mais desventurado,",
            "verse 92:16": "Que desmentir (a verdade) e desdenhar.",
            "verse 92:17": "Contudo, livrar-se-á dele o mais temente a Deus,",
            "verse 92:18": "Que aplica os seus bens, com o fito de purificá-los,",
            "verse 92:19": "E não faz favores a ninguém com o fito de ser recompensado,",
            "verse 92:20": "Senão com o intuito de ver o Rosto do seu Senhor, o Altíssimo;",
            "verse 92:21": "A logo alcançará (completa) satisfação."
        },
        "Punjabi": {
            "verse 92:1": "ਸਹੁੰ ਹੈ ਰਾਤ ਦੀ, ਜਦੋਂ ਉਹ (ਦਿਨ ਤੇ) ਛਾ ਜਾਵੇ।",
            "verse 92:2": "ਅਤੇ ਦਿਨ ਦੀ ਜਦੋਂ ਉਹ ਪ੍ਰਕਾਸ਼ਮਾਨ ਹੋ ਜਾਵੇ।",
            "verse 92:3": "ਅਤੇ ਉਸ ਦੇ ਪੈਦਾ ਕੀਤੇ ਨਰ ਅਤੇ ਮਾਦਾ ਦੀ (ਸਹੁੰ)।",
            "verse 92:4": "ਕਿ ਤੁਹਾਡੇ ਯਤਨ ਵੱਖਰੇ-ਵੱਖਰੇ ਹਨ।",
            "verse 92:5": "ਤਾਂ ਜਿਸ ਨੇ (ਅੱਲਾਹ ਦੇ ਰਾਹ ਵਿਚ ਧਨ) ਦਿੱਤਾ ਅਤੇ ਉਹ ਡਰਿਆ।",
            "verse 92:6": "ਅਤੇ ਉਸ ਨੇ ਭਲਾਈ ਨੂੰ ਸੱਚ ਮੰਨਿਆ।",
            "verse 92:7": "ਤਾਂ ਉਸ ਨੂੰ ਅਸੀਂ ਸੌਖੇ ਰਾਹ ਲਈ ਸਹੂਲਤ ਦੇਵਾਂਗੇ।",
            "verse 92:8": "ਅਤੇ ਜਿਸ ਨੇ ਕੰਜੂਸੀ ਕੀਤੀ ਅਤੇ ਲਾਪ੍ਵਾਹ ਰਿਹਾ।",
            "verse 92:9": "। ਅਤੇ ਭਲਾਈ ਤੋਂ ਇਨਕਾਰ ਕੀਤਾ।",
            "verse 92:10": "ਤਾਂ ਅਸੀਂ ਉਸ ਨੂੰ ਔਖੇ ਰਾਹ ਤੇ ਪਾਵਾਂਗੇ।",
            "verse 92:11": "ਅਤੇ ਜਦੋਂ ਉਹ ਖਾਈ (ਨਰਕ) ਵਿਚ ਡਿੱਗੇਗਾ ਤਾਂ ਉਸ ਦੀ ਜਾਇਦਾਦ ਉਸ ਦੇ ਕੰਮ ਨਹੀਂ ਆਵੇਗੀ।",
            "verse 92:12": "ਬੇਸ਼ੱਕ ਸਾਡੀ ਜ਼ਿੰਮੇਵਾਰੀ ਹੈ ਰਾਹ ਦੱਸਣਾ।",
            "verse 92:13": "ਅਤੇ ਬੇਸ਼ੱਕ ਸਾਡੇ ਅਧਿਕਾਰ ਵਿਚ ਹੈ, ਪ੍ਰਲੋਕ ਅਤੇ ਸੰਸਾਰ।",
            "verse 92:14": "ਸੋ ਮੈਂ ਤੁਹਾਨੂੰ ਭੜਕਦੀ ਹੋਈ ਅੱਗ ਤੋਂ ਡਰਾ ਦਿੱਤਾ।",
            "verse 92:15": "ਉਸ ਵਿਚ ਉਹ ਹੀ ਡਿੱਗੇਗਾ ਜਿਹੜਾ ਬੜਾ ਮੰਦਭਾਗਾ ਹੈ।",
            "verse 92:16": "ਜਿਸ ਨੇ ਝੁਠਲਾਇਆ ਅਤੇ ਮੂੰਹ ਮੌੜਿਆ।",
            "verse 92:17": "ਜ਼ਿਆਦਾ ਡਰਨ ਵਾਲਿਆਂ ਨੂੰ ਉਸ ਤੋਂ ਸੁਰੱਖਿਅਤ ਰੱਖਿਆ ਜਾਵੇਗਾ।",
            "verse 92:18": "ਜਿਹੜਾ ਪਵਿੱਤਰ ਹੋਣ ਲਈ ਆਪਣੀ ਜਾਇਦਾਦ ਦਿੰਦਾ ਹੈ।",
            "verse 92:19": "ਅਤੇ ਉਸ ਦਾ ਕਿਸੇ ਤੇ, ਕੋਈ ਉਪਕਾਰ ਨਹੀਂ?ਜਿਸ ਦਾ ਬਦਲਾ ਉਸ ਨੇ ਲੈਣਾ ਹੋਵੇ।",
            "verse 92:20": "ਪ੍ਰਤੂੰ ਸਿਰਫ਼ ਆਪਣੇ ਅਜ਼ੀਮ ਅੱਲਾਹ ਦੀ ਖੁਸ਼ੀ ਲਈ।",
            "verse 92:21": "ਅਤੇ ਜਲਦੀ ਹੀ ਉਹ ਪ੍ਰਸੰਨ ਹੋ ਜਾਵੇਗਾ।"
        },
        "Roman english": {
            "verse 92:1": "Wallaili izaa yaghshaa",
            "verse 92:2": "Wannahaari izaa tajalla",
            "verse 92:3": "Wa maa khalaqaz zakara wal unthaa",
            "verse 92:4": "Inna sa`yakum lashattaa",
            "verse 92:5": "Fa ammaa man a`taa wattaqaa",
            "verse 92:6": "Wa saddaqa bil husnaa",
            "verse 92:7": "Fasanu yassiruhoo lilyusraa",
            "verse 92:8": "Wa ammaa mam bakhila wastaghnaa",
            "verse 92:9": "Wa kazzaba bil husnaa",
            "verse 92:10": "Fasanu yassiruhoo lil`usraa",
            "verse 92:11": "Wa maa yughnee `anhu maaluhooo izaa taraddaa",
            "verse 92:12": "Inna `alainaa lal hudaa",
            "verse 92:13": "Wa inna lanaa lal Aakhirata wal oolaa",
            "verse 92:14": "Fa anzartukum naaran talazzaa",
            "verse 92:15": "Laa yaslaahaaa illal ashqaa",
            "verse 92:16": "Allazee kazzaba wa tawallaa",
            "verse 92:17": "Wa sa yujannnabuhal atqaa",
            "verse 92:18": "Allazee yu`tee maalahoo yatazakkaa",
            "verse 92:19": "Wa maa li ahadin `indahoo min ni`matin tujzaaa",
            "verse 92:20": "Illab tighaaa`a wajhi rabbihil a `laa",
            "verse 92:21": "Wa lasawfa yardaa"
        },
        "Russian": {
            "verse 92:1": "Клянусь спустившимся покровом ночи,",
            "verse 92:2": "И красотой проснувшегося дня,",
            "verse 92:3": "И тайною созданья двух полов, -",
            "verse 92:4": "Поистине, различны ваши устремленья!",
            "verse 92:5": "И для того, кто щедростью дарит, и почитает Бога,",
            "verse 92:6": "И принял (Откровение Его),",
            "verse 92:7": "Разгладим путь Мы к (вечному) блаженству.",
            "verse 92:8": "Но тот, кто скуп и думает, что он всевластен,",
            "verse 92:9": "И отвергает (Откровения Его), -",
            "verse 92:10": "Мы для него разгладим путь для (вечного) страданья;",
            "verse 92:11": "И вот когда он будет брошен в Ров, Ему добро накопленное не поможет.",
            "verse 92:12": "Поистине, Мы направляем все земное,",
            "verse 92:13": "И Нам принадлежит Начало и конец (сей жизненной стези).",
            "verse 92:14": "Предостерег Я вас об адовом огне,",
            "verse 92:15": "В кой будут брошены лишь жалкие невежды,",
            "verse 92:16": "Кто к Истине великой глух И воротит к ней спину.",
            "verse 92:17": "Но кто страшился гнева Бога, Избавлен будет от Огня (навечно),",
            "verse 92:18": "А кто расходует свое добро на самоочищенье",
            "verse 92:19": "И не для почестей благодеяет,",
            "verse 92:20": "А из желанья зрить Господень лик,",
            "verse 92:21": "Сполна познает Его щедрость."
        },
        "Sindhi": {
            "verse 92:1": "رات جو قسم آھي جڏھن ڍَڪي ٿي.",
            "verse 92:2": "۽ ڏينھن جو (قسم آھي) جڏھن روشن ٿئي ٿو.",
            "verse 92:3": "۽ اُن جو (قسم آھي) جنھن نر ۽ مادي خلقي.",
            "verse 92:4": "ته بيشڪ اوھان جي ڪوشش قسمين قسمين آھي.",
            "verse 92:5": "پوءِ جنھن (الله لڳ) ڏنو ۽ پرھيزگاري ڪئي.",
            "verse 92:6": "۽ چڱائي کي سچ ڄاتائين.",
            "verse 92:7": "تنھنکي (نجات جو) آسان رستو سھنجو ڪري ڏينداسين.",
            "verse 92:8": "۽ جنھن بخل ڪيو ۽ (پاڻ کي) بي پرواھ ڄاتائين.",
            "verse 92:9": "۽ چڱائي کي ڪوڙ ڀانيائين.",
            "verse 92:10": "تنھن کي اوکائيءَ (۾ پوڻ) لاءِ (رستو) آسان ڪري ڏينداسين.",
            "verse 92:11": "۽ جڏھن اونڌو ڪرندو ته سندس مال کانئس (ڪجھ) نه ٽاريندو.",
            "verse 92:12": "بيشڪ سڌو رستو ڏيکارڻ اسان تي (لازم) آھي.",
            "verse 92:13": "۽ بيشڪ آخرت ۽ دُنيا (ٻئي) اسان جي وس ۾ آھن.",
            "verse 92:14": "پوءِ اوھان کي باھ کان ڊيڄاريم جا ڄڀي ڪري ٿي.",
            "verse 92:15": "(اھڙي) وڏي نڀاڳي کانسواءِ (ٻيو) ڪو اُن ۾ ڪونه گھڙندو.",
            "verse 92:16": "جنھن (اسلام کي) ڪوڙ ڄاتو ۽ پٺيرو ٿيو.",
            "verse 92:17": "۽ اُن (باھ) کان انھي وڏي پرھيزگار کي پاسي ڪبو.",
            "verse 92:18": "جيڪو پنھنجو مال (الله جي واٽ ۾) ڏئي ٿو ته پاڪ ٿئي.",
            "verse 92:19": "۽ مٿس اھڙي ڪنھن جو ڪو احسان ٿيل نه آھي جو بدلو ڏجي.",
            "verse 92:20": "پر پنھنجي تمام مٿاھين پالڻھار جي رضامندي طلبڻ لاءِ (ڏئي ٿو).",
            "verse 92:21": "۽ ضرور جلد خوش ٿيندو."
        },
        "Sinhalese": {
            "verse 92:1": "රාත්‍රිය ආවරණය වන විට ඒ මත දිවුරමින්,",
            "verse 92:2": "දහවල (දීප්තිය) හෙළි වන විට ඒ මත දිවුරමින්,",
            "verse 92:3": "පිරිමියා හා ගැහැනිය මැවූ ඔහු මත ද දිවුරමින්,",
            "verse 92:4": "නියත වශයෙන්ම නුඹලාගේ උත්සාහයන් විවිධය.",
            "verse 92:5": "එහෙයින් කවරෙකු පරිත්‍යාග කර, බිය බැතිමත් වී,",
            "verse 92:6": "යහපත් දෑ සත්‍ය කළ කෙනෙකු වූ කලී;",
            "verse 92:7": "අපි ඔහුට පහසුව වෙත පහසුකම් සලසන්නෙමු.",
            "verse 92:8": "තවද මසුරු වී, තමන් අවශ්යතාවන්ගෙන් තොර යැයි සිතා,",
            "verse 92:9": "යහපත් දේ අසත්‍යය කළ කෙනෙකු වූ කලී;",
            "verse 92:10": "අපි ඔහුට දුෂ්කරතාව වෙත පහසුකම් සලසන්නෙමු.",
            "verse 92:11": "තවද ඔහු (නිරයට) ඇද වැටුණු විට ඔහුගේ ධනය ඔහුට ප්‍රයෝජනය ගෙන දෙන්නේ නැත.",
            "verse 92:12": "නියත වශයෙන්ම යහමඟ ඇත්තේ අප වෙතය.",
            "verse 92:13": "තවද නියත වශයෙන්ම එලොව හා මෙලොව අප සතුවය.",
            "verse 92:14": "එහෙයින් මම නුඹලාට ඇවිළෙන ගින්න පිළිබඳ ව අනතුරු අඟවමි.",
            "verse 92:15": "අභාග්‍යවන්තයා හැර වෙන කිසිවෙක් එහි පිවිස දැවෙන්නේ නැත.",
            "verse 92:16": "ඔහු වනාහි බොරු කරමින් පිටුපෑවේය.",
            "verse 92:17": "තවද බිය බැතිමත් අය ව සැබැවින්ම අපි මතු මුදවා ගන්නෙමු.",
            "verse 92:18": "ඔහු වනාහි තම ධනය පිරිනමා පිවිතුරු වූ අයෙකි.",
            "verse 92:19": "කිසිවකුට හෝ ප්‍රතිලාභ වශයෙන් පිරිනැමෙන කිසිදු සම්පතක් ඔහු සතුව නැත.",
            "verse 92:20": "උත්තරීතර තම පරමාධිපතිගේ තෘප්තිය අපේක්ෂාවෙන් මිස.",
            "verse 92:21": "තවද ඔහු මතු තෘප්තියට පත් වනු ඇත."
        },
        "Somali": {
            "verse 92:1": "Eebe wuxuu ku dhaartay Habeenku markuu wax qariyo.",
            "verse 92:2": "Iyo markay Maalintu Muuqato (ifto).",
            "verse 92:3": "Iyo Abuuridda Dadka Lab iyo dhaddigba.",
            "verse 92:4": "In Camalkiinnu (dadow) kala duwanyahay.",
            "verse 92:5": "Ruuxiise bixiya (xuquuqda) Eebana ka dhawrsada.",
            "verse 92:6": "Rumeeyana tii wanaaga badnayd (ciwal).",
            "verse 92:7": "Waxaanni u fududaynaa wanaagga (iyo Jidka fiican).",
            "verse 92:8": "Ruuxiise ku bakhayla Xoolaha isna deeqtoonaysiiya «iskibriya».",
            "verse 92:9": "Reeniyana Tii wanaaga badnayd (ciwal).",
            "verse 92:10": "Waxaan u fududaynaa Jidka xun.",
            "verse 92:11": "Xoolihiisuna wax uma taraan markuu halaagsamo.",
            "verse 92:12": "Annagaa wax hanuuninna.",
            "verse 92:13": "Aakhariyo Addunbana Annagaa iska leh.",
            "verse 92:14": "Waxana idiinka digaynaa Naar kulayl daran.",
            "verse 92:15": "Oosan galaynin Ruux xun mooyeen.",
            "verse 92:16": "Oo xaqa beeniyay jeedsadayna.",
            "verse 92:17": "Waxaana ka fogaada (galidda naarta) Ruuxii Eeba ka dhawrsada.",
            "verse 92:18": "Ee bixiya Xoolihiisa si uu u daahirnoqdo.",
            "verse 92:19": "Ruux wax ugu nicmeeyayna oo abaalmarinna ma uusanjirin.",
            "verse 92:20": "Ee Wuxuu u bixin dar Eebaha sareeya.",
            "verse 92:21": "Wuuna raalli noqondoonaa Ruuxaasi."
        },
        "Spanish": {
            "verse 92:1": "Por la noche cuando cubre!",
            "verse 92:2": "Por el día cuando se descubre!",
            "verse 92:3": "Por Quien creó al varón y a la hembra!",
            "verse 92:4": "Que en verdad las acciones de unos y de otros difieren.",
            "verse 92:5": "Así pues, al que dé con sinceridad, sea temeroso",
            "verse 92:6": "y crea en la verdad de lo más Hermoso,",
            "verse 92:7": "le haremos propicia la facilidad.",
            "verse 92:8": "Pero al que sea tacaño, se considere autosuficiente",
            "verse 92:9": "y niegue la verdad de lo más Hermoso,",
            "verse 92:10": "le haremos propicia la dificultad.",
            "verse 92:11": "Y de nada le servirán sus riquezas cuando haya perecido.",
            "verse 92:12": "Es cierto que a Nosotros nos corresponde la guía",
            "verse 92:13": "y que la Última Vida, como la Primera, nos pertenecen.",
            "verse 92:14": "Ya os he advertido de un fuego que llamea.",
            "verse 92:15": "No sufrirá su ardor sino el más miserable.",
            "verse 92:16": "El que niegue la verdad y se aparte.",
            "verse 92:17": "Y será librado de él quien se guarde",
            "verse 92:18": "y dé su riqueza para purificarse,",
            "verse 92:19": "no para que nadie tenga un favor que pagarle",
            "verse 92:20": "sino buscando la faz de su Señor, el Altísimo.",
            "verse 92:21": "Y por cierto que quedará satisfecho."
        },
        "Swahili": {
            "verse 92:1": "Naapa kwa usiku unapo funika!",
            "verse 92:2": "Na mchana unapo dhihiri!",
            "verse 92:3": "Na kwa Aliye umba dume na jike!",
            "verse 92:4": "Hakika juhudi zenu bila ya shaka ni mbali mbali.",
            "verse 92:5": "Ama mwenye kutoa na akamchamngu,",
            "verse 92:6": "Na akaliwafiki lilio jema,",
            "verse 92:7": "Tutamsahilishia yawe mepesi.",
            "verse 92:8": "Na ama mwenye kufanya ubakhili, na asiwe na haja ya wenzake,",
            "verse 92:9": "Na akakanusha lilio jema,",
            "verse 92:10": "Tutamsahilishia yawe mazito!",
            "verse 92:11": "Na mali yake yatamfaa nini atapo kuwa anadidimia?",
            "verse 92:12": "Hakika ni juu yetu kuonyesha uwongofu.",
            "verse 92:13": "Na hakika ni yetu Sisi Akhera na dunia.",
            "verse 92:14": "Basi nakuonyeni na Moto unao waka!",
            "verse 92:15": "Hatauingia ila mwovu kabisa!",
            "verse 92:16": "Anaye kadhibisha na kupa mgongo.",
            "verse 92:17": "Na mchamngu ataepushwa nao,",
            "verse 92:18": "Ambaye hutoa mali yake kwa ajili ya kujitakasa.",
            "verse 92:19": "Na wala si kwa kuwa yupo yeyote aliye mfanyia hisani ndio anamlipa.",
            "verse 92:20": "Ila ni kutaka radhi ya Mola wake Mlezi aliye juu kabisa.",
            "verse 92:21": "Naye atakuja ridhika!"
        },
        "Swedish": {
            "verse 92:1": "VID NATTEN, när den höljer [jorden]",
            "verse 92:2": "och vid dagen, när den träder fram i klarhet!",
            "verse 92:3": "Vid Den som har skapat man och kvinna!",
            "verse 92:4": "[Alla] strävar ni mot olika [mål]!",
            "verse 92:5": "För den som villigt ger [av sina ägodelar] och fruktar Gud",
            "verse 92:6": "och som tror på det högsta goda,",
            "verse 92:7": "skall Vi göra det lätt [att följa religionens bud].",
            "verse 92:8": "Men den som håller hårt om penningpåsen och som [därför att han är rik] tror sig vara fri från allt beroende",
            "verse 92:9": "och som förnekar det högsta goda,",
            "verse 92:10": "[för honom] skall Vi göra det tungt och svårt. -",
            "verse 92:11": "Och vilken glädje har han av sin rikedom, när han störtar i fördärvet?",
            "verse 92:12": "VÄGLEDNINGEN ankommer helt visst på Oss;",
            "verse 92:13": "och Oss tillhör det kommande [livet] såväl som ert första [liv i denna värld].",
            "verse 92:14": "Jag varnar er därför för en Eld som flammar högt,",
            "verse 92:15": "där bara den uslaste skall brinna,",
            "verse 92:16": "den som ropar \"Lögn!\" och vänder sanningen ryggen.",
            "verse 92:17": "Men den gudfruktige skall föras långt bort från denna [Eld] -",
            "verse 92:18": "han som ger [av sina ägodelar] för att rena [sin själ],",
            "verse 92:19": "inte för att betala tillbaka tidigare mottagna förmåner",
            "verse 92:20": "men av kärlek till sin Herre, den Högste.",
            "verse 92:21": "Och han kommer förvisso att bli nöjd."
        },
        "Tajik": {
            "verse 92:1": "Савганд ба шаб, он гоҳ ки чаҳонро бо торикиаш бипӯшад",
            "verse 92:2": "ва савганд ба рӯз, он гоҳ ки ошкор шавад",
            "verse 92:3": "ва савганд, ба он ки нару модаро биёфарид,",
            "verse 92:4": "ки ҳосили кӯшишҳои шумо гуногун аст.",
            "verse 92:5": "Аммо касе, ки бахшоишу парҳезгорӣ кард",
            "verse 92:6": "ва он беҳтаринро тасдиқ кард (калимаи тайибаро),",
            "verse 92:7": "пас барои биҳишт омодааш мекунем.",
            "verse 92:8": "Аммо он кас кӣ бахиливу беэҳтиёҷӣ кард.",
            "verse 92:9": "ва он беҳтаринро такзиб кард (дурӯғ баровард),",
            "verse 92:10": "ӯро барои дӯзах омода месозем.",
            "verse 92:11": "Ва чун ҳалокаш даррасад, дороияш ба ҳолаш фоида набахшад.",
            "verse 92:12": "Ва он чӣ бар Мост, роҳнамоист.",
            "verse 92:13": "Ва аз они Мост он ҷаҳону ин чаҳон.",
            "verse 92:14": "Пас шуморо аз оташе, ки забона мезанад, метарсонам,",
            "verse 92:15": "ҷуз аҳли бадбахтӣ ба он дарнаяфтад,",
            "verse 92:16": "он ки дурӯғ баровард ва рӯйгардон шуд.",
            "verse 92:17": "Ва парҳезгортарин мардумро аз он дур доранд,",
            "verse 92:18": "он кӣ моли худ мебахшояд ва покӣ меҷӯяд.",
            "verse 92:19": "Ва ҳеҷ касро бар (гардани) ӯ ҳаққе набошад, ки акнун мукофот хоҳад,",
            "verse 92:20": "Ғайри ҷустани хушнудии Парвардигори баландмартабаи худ.",
            "verse 92:21": "Ва ба зудӣ хушнуд шавад."
        },
        "Tamil": {
            "verse 92:1": "(இருளால்) தன்னை மூடிக்கொள்ளும் இரவின் மீது சத்தியமாக",
            "verse 92:2": "பிரகாசம் வெளிப்படும் பகலின் மீதும் சத்தியமாக-",
            "verse 92:3": "ஆணையும், பெண்ணையும் (அவன்) படைத்திருப்பதின் மீதும் சத்தியமாக-",
            "verse 92:4": "நிச்சயமாக உங்களுடைய முயற்சி பலவாகும்.",
            "verse 92:5": "எனவே எவர் (தானதருமம்) கொடுத்து, (தன் இறைவனிடம்) பயபக்தியுடன் நடந்து,",
            "verse 92:6": "நல்லவற்றை (அவை நல்லவையென்று) உண்மையாக்குகின்றாரோ,",
            "verse 92:7": "அவருக்கு நாம் (சுவர்க்கத்தின் வழியை) இலேசாக்குவோம்.",
            "verse 92:8": "ஆனால் எவன் உலோபித்தனம் செய்து அல்லாஹ்விடமிருந்து தன்னைத் தேவையற்றவனாகக் கருதுகிறானோ,",
            "verse 92:9": "இன்னும், நல்லவற்றை பொய்யாக்குகிறானோ,",
            "verse 92:10": "அவனுக்கு கஷ்டத்திற்குள்ள (நரகத்தின்) வழியைத் தான் இலேசாக்குவோம்.",
            "verse 92:11": "ஆகவே அவன் (நரகத்தில்) விழுந்து விட்டால் அவனுடைய பொருள் அவனுக்குப் பலன் அளிக்காது.",
            "verse 92:12": "நேர் வழியைக் காண்பித்தல் நிச்சயமாக நம் மீது இருக்கிறது.",
            "verse 92:13": "அன்றியும் பிந்தியதும் (மறுமையும்) முந்தியதும் (இம்மையும்) நம்முடையவையே ஆகும்.",
            "verse 92:14": "ஆதலின், கொழுந்துவிட்டெறியும் (நரக) நெருப்பைப்பற்றி நான் உங்களை அச்சமூட்டி எச்சரிக்கிறேன்.",
            "verse 92:15": "மிக்க துர்ப்பாக்கியமுள்ளவனைத் தவிர (வேறு) எவனும் அதில் புகமாட்டான்.",
            "verse 92:16": "எத்தகையவனென்றால் அவன் (நம் வசனங்களைப்) பொய்யாக்கி, முகம் திரும்பினான்.",
            "verse 92:17": "ஆனால் பயபக்தியுடையவர் தாம் அ(ந்நரகத்)திலிருந்து தொலைவிலாக்கப்படுவார்.",
            "verse 92:18": "(அவர் எத்தகையோரென்றால்) தம்மை தூய்மைப் படுத்தியவராகத் தம் பொருளை (இறைவன் பாதையில்) கொடுக்கிறார்.",
            "verse 92:19": "மேலும், தாம் பதில் (ஈடு) செய்யுமாறு பிறருடைய உபகாரமும் தம் மீது இல்லாதிருந்தும்.",
            "verse 92:20": "மகா மேலான தம் இறைவனின் திருப்பொருத்தத்தை நாடியே (அவர் தானம் கொடுக்கிறார்).",
            "verse 92:21": "வெகு விரைவிலேயே (அத்தகையவர் அல்லாஹ்வின் அருள் கொடையால்) திருப்தி பெறுவார்."
        },
        "Tatar": {
            "verse 92:1": "Төн белән ант итәм, һәркайчан караңгылыгы белән капласа.",
            "verse 92:2": "Вә көндез белән ант итәм, һәркайчан яктырса.",
            "verse 92:3": "Вә ирне һәм хатынны халык кылган Аллаһ белән ант итәм.",
            "verse 92:4": "Тәхкыйк сезнең эшләрегез вә гамәлләрегез, төрлечә-төрлечәдер.",
            "verse 92:5": "Әмма бер кеше Аллаһ күрсәткән урыннарга садакалар бирсә һәм Аллаһудан куркып гөнаһлардан сакланса.",
            "verse 92:6": "Һәм Аллаһуның берлеген, Исламның хаклыгын вә Коръәннең һәм пәйгамбәрнең хаклыгын тәсъдыйк кылса.",
            "verse 92:7": "Аңа җиңеллек вә рәхәтлек урыны булган җәннәткә алып керүче гамәлләрне мүйәссәр кылырбыз.",
            "verse 92:8": "Вә әмма бер кеше саранлык кылса, вә үзен Аллаһуга вә ахирәт нигъмәтләренә мохтаҗсыз санаса, кирәксенмәсә.",
            "verse 92:9": "Вә Аллаһуның берлеген һәм Коръәннең вә пәйгамбәрнең хаклыгын инкяр кылса.",
            "verse 92:10": "Бик тиз Без аңа авырлык вә ґәзаб урыны булган җәһәннәмгә алып керә торган бозык эшләрне, батыл гамәлләрне мүйәссәр кылырбыз.",
            "verse 92:11": "Җәһәннәмгә егылып һәлак булганда аңа малы файда бирмәс.",
            "verse 92:12": "Тәхкыйк Безгә туры юлны бәян кылмак тиешледер.",
            "verse 92:13": "Әлбәттә, дөнья һәм ахирәт байлыгы фәкать Безнекедер. Шулай булгач, икесен дә Аллаһудан сорарга тиешле.",
            "verse 92:14": "Ий кешеләр, Мин сезне куркыттым ялкынланган ут белән.",
            "verse 92:15": "Ул утка кермәс мәгәр бәхетсез явыз кеше генә керер.",
            "verse 92:16": "Ул явыз, Коръәнне вә пәйгамбәрне ялганга тотты һәм Аллаһуга итагать итүдән баш тартты.",
            "verse 92:17": "Аллаһудан куркып гөнаһтан сакланучы тәкъва кеше, ул уттан ягада, читтә булыр.",
            "verse 92:18": "Ул тәкъва кеше малын Аллаһ күрсәткән урыннарга бирер, гөнаһтан пакьләнмәк нияте белән.",
            "verse 92:19": "Бит Аллаһ хозурыңда һичкемгә сәваб вә нигъмәт юк.",
            "verse 92:20": "Мәгәр сәваб вә нигъмәтләр бирелер, ахирәт өчен кыла торган гамәлләрен фәкать Аллаһ ризалыгы өчен генә һәм Аллаһ кушканча гына кылган тәкъва кешегә.",
            "verse 92:21": "Вә андый кеше тиздән Аллаһ биргән җәннәт нигъмәтләреннән разый булыр."
        },
        "Telugu": {
            "verse 92:1": "క్రమ్ముకునే రాత్రి సాక్షిగా",
            "verse 92:2": "ప్రకాశించే పగటి సాక్షిగా",
            "verse 92:3": "మరియు, మగ మరియు ఆడ (జాతులను) సృష్టించిన ఆయన (అల్లాహ్) సాక్షిగా",
            "verse 92:4": "వాస్తవానికి, మీ ప్రయత్నాలు నానా విధాలుగా ఉన్నాయి",
            "verse 92:5": "కాని ఎవడైతే (దానధర్మాలు) చేస్తూ దైవభీతి కలిగి ఉంటాడో",
            "verse 92:6": "మరియు మంచిని నమ్ముతాడో",
            "verse 92:7": "అతనికి మేము మేలు కొరకు దారిని సులభం చేస్తాము",
            "verse 92:8": "కాని ఎవడైతే పిసినారితనం చేస్తూ, నిర్లక్ష్య వైఖరిని అవలంబిస్తాడో",
            "verse 92:9": "మరియు మంచిని అబద్ధమని తిరస్కరిస్తాడో",
            "verse 92:10": "అతనికి మేము చెడు కొరకు దారిని సులభం చేస్తాము",
            "verse 92:11": "మరియు అతడు నశించి పోయినప్పుడు, అతని ధనం అతనికి ఎలా ఉపయోగపడుతుంది",
            "verse 92:12": "నిశ్చయంగా, సన్మార్గం చూపడం మా పని",
            "verse 92:13": "మరియు నిశ్చయంగా, ఇహపరలోకాల (ఆధిపత్యం) మాకే చెందినది",
            "verse 92:14": "కాబట్టి నేను మిమ్మల్ని ప్రజ్వలించే నరకాగ్నిని గురించి హెచ్చరించాను",
            "verse 92:15": "పరమ దౌర్భాగ్యుడు తప్ప, మరెవ్వడూ అందులో కాలడు",
            "verse 92:16": "ఎవడైతే (సత్యాన్ని) తిరస్కరించి (దాని నుండి) విముఖుడవుతాడో",
            "verse 92:17": "కాని దైవభీతి గలవాడు దాని నుండి (ఆ నరకాగ్ని నుండి) దూరంగా ఉంచబడతాడు",
            "verse 92:18": "అతడే! ఎవడైతే, పవిత్రుడవటానికి తన ధనం నుండి (ఇతరులకు) ఇస్తాడో",
            "verse 92:19": "కాని అది, వారు అతనికి చేసిన ఏ ఉపకారానికి బదులుగా గాక",
            "verse 92:20": "కేవలం మహోన్నతుడైన తన ప్రభువు ప్రసన్నతను పొందటానికి మాత్రమే అయితే",
            "verse 92:21": "మరియు అలాంటి వాడే తప్పక సంతోషిస్తాడు"
        },
        "Thai": {
            "verse 92:1": "ขอสาบานด้วยเวลากลางคืน เมื่อมันปกคลุม",
            "verse 92:2": "และด้วยเวลากลางวันเมื่อมันประกายแสง",
            "verse 92:3": "และด้วยผู้ที่ทรงบังเกิดเพศชาย และเพศหญิง",
            "verse 92:4": "แท้จริงการงานของพวกเจ้านั้นย่อมแตกต่างกันอย่างแน่นอน",
            "verse 92:5": "ส่วนผู้ที่บริจาคและยำเกรง (อัลลอฮฺ)",
            "verse 92:6": "และเชื่อมั่นในสิ่งที่ดี",
            "verse 92:7": "เราก็จะให้เขาได้รับความสะดวกอย่างง่ายดาย",
            "verse 92:8": "และส่วนผู้ที่ตระหนี่ และถือว่ามีพอเพียงแล้ว",
            "verse 92:9": "และปฏิเสธสิ่งที่ดีงาม",
            "verse 92:10": "เราก็จะให้เขาได้รับความลำบากอย่างง่ายดาย",
            "verse 92:11": "และทรัพย์สมบัติของเขาจะไม่อำนวยประโยชน์แก่เขาได้ เมื่อเขาตกไปในเหวนรก",
            "verse 92:12": "แท้จริงหน้าที่ของเรานั้นคือให้การชี้แนะทาง",
            "verse 92:13": "และแท้จริงปรโลกและโลกนี้เป็นของเรา",
            "verse 92:14": "ดังนั้นข้าขอเตือนพวกเจ้าถึงไฟที่ลุกโซน",
            "verse 92:15": "ไม่มีผู้ใดจะเข้าไปในเผาไหม้ในมัน นอกจากคนเลวทรามที่สุด",
            "verse 92:16": "คือผู้ที่ปฏิเสธและผินหลังให้",
            "verse 92:17": "และส่วนผู้ที่ยำเกรงยิ่งนั้นจะถูกปลีกตัวให้ห่างไกลจากมัน",
            "verse 92:18": "ซึ่งเขาบริจาคทรัพย์สินของเขาเพื่อขัดเกลาตนเอง",
            "verse 92:19": "และที่เขานั้นไม่มีบุญคุณแก่ผู้ใดที่บุญคุณนั้นจะถูกตอบแทน",
            "verse 92:20": "นอกจากว่าเพื่อแสวงความโปรดปรานจากพระเจ้าของเขาผู้ทรงสูงส่งเท่านั้น",
            "verse 92:21": "และเขาก็จะพึงพอใจ"
        },
        "Turkish": {
            "verse 92:1": "Kararıp ortalığı bürüdüğü zaman geceye and olsun.",
            "verse 92:2": "Açılıp aydınlattığı zaman gündüze and olsun.",
            "verse 92:3": "Erkeği ve dişiyi yaratana and olsun ki:",
            "verse 92:4": "Doğrusu sizin çalışmalarınız çeşitlidir.",
            "verse 92:5": "Elinde bulunandan verenin, Allah'a karşı gelmekten sakınanın, en güzel söz olan Allah'ın birliğini doğrulayanın işlerini kolaylaştırırız.",
            "verse 92:6": "Elinde bulunandan verenin, Allah'a karşı gelmekten sakınanın, en güzel söz olan Allah'ın birliğini doğrulayanın işlerini kolaylaştırırız.",
            "verse 92:7": "Elinde bulunandan verenin, Allah'a karşı gelmekten sakınanın, en güzel söz olan Allah'ın birliğini doğrulayanın işlerini kolaylaştırırız.",
            "verse 92:8": "Ama, cimrilik eden, kendini Allah'tan müstağni sayan, en güzel sözü yalanlayan kimsenin güçlüğe uğramasını kolaylaştırırız.",
            "verse 92:9": "Ama, cimrilik eden, kendini Allah'tan müstağni sayan, en güzel sözü yalanlayan kimsenin güçlüğe uğramasını kolaylaştırırız.",
            "verse 92:10": "Ama, cimrilik eden, kendini Allah'tan müstağni sayan, en güzel sözü yalanlayan kimsenin güçlüğe uğramasını kolaylaştırırız.",
            "verse 92:11": "O kimse ölüp ateşe yuvarlandığı zaman, malı ona fayda vermez.",
            "verse 92:12": "Bize düşen sadece doğru yolu göstermektir.",
            "verse 92:13": "Şüphesiz ahiret de, dünya da Bizimdir.",
            "verse 92:14": "Sizi alevler saçan ateşle uyardım;",
            "verse 92:15": "Oraya, yalanlayıp yüz çevirmiş olan o en azgından başkası yaslanmaz.",
            "verse 92:16": "Oraya, yalanlayıp yüz çevirmiş olan o en azgından başkası yaslanmaz.",
            "verse 92:17": "Arınmak için malını veren, en çok sakınan kimse ise ondan uzak tutulur.",
            "verse 92:18": "Arınmak için malını veren, en çok sakınan kimse ise ondan uzak tutulur.",
            "verse 92:19": "O yaptığı iyiliği birinden karşılık görmek için değil, ancak yüce Rabbinin hoşnudluğunu (rızasını) gözeterek yapmıştır.",
            "verse 92:20": "O yaptığı iyiliği birinden karşılık görmek için değil, ancak yüce Rabbinin hoşnudluğunu (rızasını) gözeterek yapmıştır.",
            "verse 92:21": "Elbette kendisi de hoşnut (razı) olacaktır."
        },
        "Urdu": {
            "verse 92:1": "رات کی قسم جب (دن کو) چھپالے",
            "verse 92:2": "اور دن کی قسم جب چمک اٹھے",
            "verse 92:3": "اور اس (ذات) کی قسم جس نے نر اور مادہ پیدا کیے",
            "verse 92:4": "کہ تم لوگوں کی کوششں طرح طرح کی ہے",
            "verse 92:5": "تو جس نے (خدا کے رستے میں مال) دیا اور پرہیز گاری کی",
            "verse 92:6": "اور نیک بات کو سچ جانا",
            "verse 92:7": "اس کو ہم آسان طریقے کی توفیق دیں گے",
            "verse 92:8": "اور جس نے بخل کیا اور بےپروا بنا رہا",
            "verse 92:9": "اور نیک بات کو جھوٹ سمجھا",
            "verse 92:10": "اسے سختی میں پہنچائیں گے",
            "verse 92:11": "اور جب وہ (دوزخ کے گڑھے میں) گرے گا تو اس کا مال اس کے کچھ کام نہ آئے گا",
            "verse 92:12": "ہمیں تو راہ دکھا دینا ہے",
            "verse 92:13": "اور آخرت او ردنیا ہماری ہی چیزیں ہیں",
            "verse 92:14": "سو میں نے تم کو بھڑکتی آگ سے متنبہ کر دیا",
            "verse 92:15": "اس میں وہی داخل ہو گا جو بڑا بدبخت ہے",
            "verse 92:16": "جس نے جھٹلایا اور منہ پھیرا",
            "verse 92:17": "اور جو بڑا پرہیزگار ہے وہ (اس سے) بچا لیا جائے گا",
            "verse 92:18": "جو مال دیتا ہے تاکہ پاک ہو",
            "verse 92:19": "اور (اس لیے) نہیں (دیتا کہ) اس پر کسی کا احسان (ہے) جس کا وہ بدلہ اتارتا ہے",
            "verse 92:20": "بلکہ اپنے خداوند اعلیٰ کی رضامندی حاصل کرنے کے لیے دیتا ہے",
            "verse 92:21": "اور وہ عنقریب خوش ہو جائے گا"
        },
        "Uyghur": {
            "verse 92:1": "قاراڭغۇلۇقى ئالەمنى قاپلىغان كېچە بىلەن قەسەمكى،",
            "verse 92:2": "يورۇغان چاغدىكى كۈندۈز بىلەن قەسەمكى،",
            "verse 92:3": "ئەر - ئايالنى ياراتقان زات اﷲ بىلەن قەسەمكى،",
            "verse 92:4": "سىلەرنىڭ ئەمەلىڭلار شەك - شۈبھىسىز خىلمۇخىلدۇر",
            "verse 92:5": "(پۇل - مېلىنى اﷲ نىڭ رازىلىقى ئۈچۈن) سەرپ قىلغان، تەقۋادارلىق قىلغان، (كەلىمە تەۋھىدنى) تەستىق قىلغان ئادەمگە كەلسەك",
            "verse 92:6": "(پۇل - مېلىنى اﷲ نىڭ رازىلىقى ئۈچۈن) سەرپ قىلغان، تەقۋادارلىق قىلغان، (كەلىمە تەۋھىدنى) تەستىق قىلغان ئادەمگە كەلسەك،",
            "verse 92:7": "ئۇنىڭغا بىز ياخشى يولنى مۇيەسسەر قىلىپ بېرىمىز",
            "verse 92:8": "بېخىللىق قىلىپ (اﷲ نىڭ ساۋابىدىن) ئۆزىنى بىھاجەت ھېسابلىغان، كەلىمە تەۋھىدنى ئىنكار قىلغان ئادەمگە كەلسەك",
            "verse 92:9": "بېخىللىق قىلىپ (اﷲ نىڭ ساۋابىدىن) ئۆزىنى بىھاجەت ھېسابلىغان، كەلىمە تەۋھىدنى ئىنكار قىلغان ئادەمگە كەلسەك،",
            "verse 92:10": "بىز ئۇنىڭغا يامان يولنى مۇيەسسەر قىلىپ بېرىمىز",
            "verse 92:11": "ئۇ (دوزاخقا) تاشلانغان چاغدا، ئۇنىڭ مېلى ھېچ نەرسىگە ئەسقاتمايدۇ",
            "verse 92:12": "توغرا يولنى كۆرسىتىشكە شەك - شۈبھىسىز بىز مەسئۇلمىز",
            "verse 92:13": "دۇنيا ۋە ئاخىرەت شەك - شۈبھىسىز بىزنىڭ ئىلكىمىزدىدۇر",
            "verse 92:14": "سىلەرنى لاۋۇلداپ تۇرغان ئوتتىن ئاگاھلاندۇردۇم",
            "verse 92:15": "ئۇنىڭغا پەقەت (ھەقنى) ئىنكار قىلغان، (ئىماندىن) يۈز ئۆرۈگەن ئادەملا كىرىدۇ",
            "verse 92:16": "ئۇنىڭغا پەقەت (ھەقنى) ئىنكار قىلغان، (ئىماندىن) يۈز ئۆرۈگەن ئادەملا كىرىدۇ",
            "verse 92:17": "پاكلىنىش ئۈچۈن مال - مۈلكىنى (ياخشىلىق يوللىرىغا) سەرپ قىلىدىغان ئادەم ئۇنىڭدىن (يەنى ئوتتىن) يىراق قىلىنىدۇ",
            "verse 92:18": "پاكلىنىش ئۈچۈن مال - مۈلكىنى (ياخشىلىق يوللىرىغا) سەرپ قىلىدىغان ئادەم ئۇنىڭدىن (يەنى ئوتتىن) يىراق قىلىنىدۇ",
            "verse 92:19": "ئۇنىڭ قىلغان ياخشىلىقى بىراۋنىڭ ياخشىلىقىنى ياندۇرۇش ئۈچۈن ئەمەس، پەقەت ئۇلۇغ پەرۋەردىگارىنىڭ رازىلىقى ئۈچۈندۇر",
            "verse 92:20": "ئۇنىڭ قىلغان ياخشىلىقى بىراۋنىڭ ياخشىلىقىنى ياندۇرۇش ئۈچۈن ئەمەس، پەقەت ئۇلۇغ پەرۋەردىگارىنىڭ رازىلىقى ئۈچۈندۇر",
            "verse 92:21": "ئۇ (يەنى ئېھسان قىلغۇچى ئادەم) (پەرۋەردىگارىنىڭ بەرگەن مۇكاپاتىدىن) چوقۇم رازى بولىدۇ"
        },
        "Uzbek": {
            "verse 92:1": "Туннинг қоплаб келаётган пайти билан қасам.",
            "verse 92:2": "Наҳорнинг тажалли пайти билан қасам.",
            "verse 92:3": "Эркак ва урғочининг яратилиши билан қасам.",
            "verse 92:4": "Албатта, сизларнинг ишларингиз турличадур.",
            "verse 92:5": "Аммо кимки (ато) берса ва тақво қилса.",
            "verse 92:6": "Ва гўзал(сўз)ни тасдиқ қилса.",
            "verse 92:7": "Бас, Биз уни осонга муяссар қиламиз.",
            "verse 92:8": "Аммо кимки бахиллик ва истиғно қилса.",
            "verse 92:9": "Ва гўзал(сўз)ни ёлғонга чиқарса.",
            "verse 92:10": "Бас, Биз уни қийинга муяссар қиламиз.",
            "verse 92:11": "У қулаган вақтда унга мол-мулки фойда бермас.",
            "verse 92:12": "Албатта, ҳидоятга бошлаш Бизнинг зиммамиздадир.",
            "verse 92:13": "Албатта, ҳам охират ва ҳам бу дунё Бизникидир.",
            "verse 92:14": "Бас, Мен сизларни (алангаси авж олиб турган) ўтдан огоҳлантирдим.",
            "verse 92:15": "У(ўт)га бадбахтдан бошқа ҳеч ким кирмас.",
            "verse 92:16": "Ўша ёлғонга чиқарган ва юз ўгирган эди.",
            "verse 92:17": "Ва албатта, ундан тақводор банда четда қолади.",
            "verse 92:18": "У бойлигини сарфлайди ва ўзини поклайди.",
            "verse 92:19": "Унда бирор кишининг қайтарилиши лозим яхшилиги йўқ эди.",
            "verse 92:20": "Фақатгина олий мақом Роббисининг розилигини сўраб қилади.",
            "verse 92:21": "Ва у албатта тезда рози бўлади."
        },
        "Vietnamese": {
            "verse 92:1": "Thề bởi ban đêm khi nó bao phủ.",
            "verse 92:2": "Thề bởi ban ngày khi nó sáng tỏ.",
            "verse 92:3": "Thề bởi Đấng đã tạo ra nam và nữ, (đực và cái).",
            "verse 92:4": "Quả thật, nỗ lực của các ngươi rất đa dạng.",
            "verse 92:5": "Vì vậy, đối với ai cho (của cải, tài sản vào con đường của Allah) và kính sợ (Ngài).",
            "verse 92:6": "Và luôn tin vào điều thiện tốt.",
            "verse 92:7": "TA (Allah) sẽ tạo sự thuận lợi và dễ dàng cho y.",
            "verse 92:8": "Còn đối với ai keo kiệt và cho mình giàu có.",
            "verse 92:9": "Và phủ nhận điều tốt.",
            "verse 92:10": "TA sẽ khiến y luôn được thuận lợi để đến với sự gian khổ.",
            "verse 92:11": "Tài sản, của cải của y chẳng giúp ích được gì cho y khi y bị hủy diệt.",
            "verse 92:12": "Quả thật, việc hướng dẫn là nhiệm vụ của TA.",
            "verse 92:13": "Và quả thật, Đời Sau và đời sống trần gian đều là của TA.",
            "verse 92:14": "Vì vậy, TA cảnh báo các ngươi về ngọn lửa cháy dữ dội.",
            "verse 92:15": "Không ai bị thiêu đốt trong đó ngoại trừ những kẻ bất hạnh.",
            "verse 92:16": "(Đó là) những kẻ đã phủ nhận và quay lưng.",
            "verse 92:17": "Và người ngoan đạo (sợ Allah) sẽ được ở xa nó (Hỏa Ngục).",
            "verse 92:18": "Đó là người đã dùng của cải của y để tẩy sạch (bản thân).",
            "verse 92:19": "Y không mong được trả ơn khi y làm điều thiện cho người.",
            "verse 92:20": "Y chỉ mong sự hài lòng của Thượng Đế của y, Đấng Tối Cao.",
            "verse 92:21": "(Rồi đây) chắc chắn y sẽ được hài lòng và toại nguyện (về những gì Allah sẽ ban cho ở Đời Sau)."
        },
        "Yoruba": {
            "verse 92:1": "(Allahu) bura pelu ale nigba ti (ile) ba su",
            "verse 92:2": "O tun bura pelu osan nigba ti (osan) ba pon",
            "verse 92:3": "O tun bura pelu Eni ti O da ako ati abo",
            "verse 92:4": "Dajudaju ise yin, otooto ni",
            "verse 92:5": "Ni ti eni ti o ba tore, ti o si beru (Allahu)",
            "verse 92:6": "(ti) o tun pe esan rere ni ododo",
            "verse 92:7": "A si maa se ise rere ni irorun fun un",
            "verse 92:8": "Ni ti eni ti o ba yahun, ti o si ri ara re leni t’o roro tayo esan orun",
            "verse 92:9": "(ti) o tun pe esan rere ni iro",
            "verse 92:10": "A si maa se ise aburu ni irorun fun un",
            "verse 92:11": "Dukia re ko si nii ro o loro nigba ti o ba ja bo (sinu Ina)",
            "verse 92:12": "Dajudaju tiWa ni (lati salaye) imona",
            "verse 92:13": "Ati pe dajudaju tiWa ni orun ati aye",
            "verse 92:14": "Nitori naa, Mo ti fi Ina elejo fofo kilo fun yin",
            "verse 92:15": "Ko si eni ti o maa wo inu re afi olori buruku",
            "verse 92:16": "eni ti o pe ododo niro, ti o si keyin si i",
            "verse 92:17": "Won si maa gbe (Ina) jinna si oluberu (Allahu)",
            "verse 92:18": "eni t’o n fi dukia re tore, ti o n safomo (re)",
            "verse 92:19": "Ko si si oore idera kan ti (o ni lokan) lati gba ni esan ni odo enikeni",
            "verse 92:20": "bi ko se pe lati fi wa oju rere Oluwa re, Eni Giga julo",
            "verse 92:21": "Laipe o si maa yonu (si esan re)"
        }
    }
}