{
    "id": 93,
    "name_simple": "Ad-Duhaa",
    "revelation_place": "makkah",
    "revelation_order": 11,
    "bismillah_pre": true,
    "verses_count": 11,
    "short_text": "The Surah takes its name Ad-Duha from the very first word.",
    "text": [
        "\n",
        "The Surah takes its name Ad-Duha from the very first word.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its subject matter clearly indicates that it belongs to the earliest period at Makkah. Traditions also show that the revelations were suspended for a time, which caused the Holy Prophet (upon whom be Allah's peace) to be deeply distressed and grieved. On this account he felt very anxious that perhaps he had committed some error because of which his Lord had become angry with him and had forsaken him. Thereupon he was given the consolation that revelation had not been stopped because of some displeasure but this was necessitated by the same expediency as underlies the peace and stillness of the night after the bright day, as if to say: \"If you had continuously been exposed to the intensely bright light of Revelation (Wahi) your nerves could not have endured it. Therefore, an interval was given in order to afford you peace and tranquility.\" This state was experienced by the Holy Prophet in the initial stage of the Prophethood when he was not yet accustomed to hear the\r\nintensity of Revelation. On this basis, observance of a pause in between was necessary. This we have already explained in the introduction to Surah Al Muddaththir; and in E. N. 5 of Surah Al-Muzzammil also we have explained what great burden of the coming down of Revelation he had to bear. Later, when the Holy Prophet developed the power to bear this burden, there was no longer any need for long gaps.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to console the Holy Prophet (upon whom be peace) and its object to remove his anxiety and distress, which he had been caused by the suspension of Revelation. First of all, swearing an oath by the bright morning and the stillness of night, he has been reassured, so as to say: \"Your Lord has not at all forsaken you, nor is he displeased with you.\" Then, he has been given the good news that the hardships that he was experiencing in the initial stage of his mission, would not last long, for every later period of life for him would be better than the former period, and before long Allah would bless him so abundantly that he would be well pleased. This is one of the express prophecies of the Quran, which proved literally true, afterwards, whereas when this prophecy was made there seemed not to be the remotest chance that the helpless and powerless man who had come out to wage a war against the ignorance and paganism of the entire nation, would ever achieve such wonderful\r\nsuccess.",
        "\n",
        "Then, addressing His Holy Prophet (upon whom be peace) Allah says:\"O My dear Prophet, what has caused you the anxiety and distress that your Lord has forsaken you, and that We are displeased with you? Whereas the fact is that We have been good to you with kindness after kindness ever since the day of your birth. You were born an orphan, We made the best arrangement for your upbringing and care: you were unaware of the Way, We showed you the Way; you were indigent, We made you rich. All this shows that you have been favored by Us from the very beginning and Our grace and bounty has been constantly focused on you.\"Here, one should also keep in view vv. 37-42 of Surah Ta Ha, where Allah, while sending the Prophet Moses to confront a tyrant like Pharaoh, encouraged and consoled him, saying: \"We have been looking after you with kindness ever since your birth; therefore, you should be satisfied that you will not be left alone in this dreadful mission. Our bounty will constantly be\r\nwith you.\"",
        "\n",
        "In conclusion, Allah has instructed His Prophet (upon whom be peace) telling him how he should treat the creatures of God to repay for the favors He has done him and how he should render thanks for the blessings He has bestowed on him.",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by the The Morning Brightness and the night when all falls still. It is named after “the morning brightness” (ḍūḥā), mentioned in verse 1. The surah is an address to the Prophet Muhammad, to reassure him, when he had not received revelation for some time, that his Lord had not forsaken him.The surah is also known as: Daylight, Early Hours of Morning, Morning Bright, Morning Light, The Forenoon, The Glorious Morning Light, The Morning.",
    "name_translation": "The Morning Brightness",
    "name_complex": "Ad-Dhuhâ",
    "surah_name_ar": "الضحى",
    "verses": {
        "Albanian": {
            "verse 93:1": "Betohem në mëngjesin,",
            "verse 93:2": "dhe natën kur terrohet e qetësohet –",
            "verse 93:3": "Zoti yt, nuk të ka braktisur e as nuk të ka urrejtur!",
            "verse 93:4": "Me të vërtetë, jeta e ardhshme për ty është më e mirë se kjo jetë,",
            "verse 93:5": "e, me të vërtetë, Zoti yt do të japi ty, e ti do të jesh i kënaqur.",
            "verse 93:6": "A nuk ishe ti bonja, e Ai të mori në strehim,",
            "verse 93:7": "dhe të gjeti të humbur (të paudhëzuar), e të udhëzoi me Shpalljen e Kur’anit,",
            "verse 93:8": "dhe ishe i varfër e të bëri të pasur?",
            "verse 93:9": "Mos e nënçmo bonjakun",
            "verse 93:10": "e lypsin mos e refuzo me ashpërsi,",
            "verse 93:11": "dhe dhuntitë e Zotit tënd, shprehi!"
        },
        "Amharic": {
            "verse 93:1": "በረፋዱ እምላለሁ፡፡",
            "verse 93:2": "በሌሊቱም ጸጥ ባለ ጊዜ፤",
            "verse 93:3": "ጌታህ አላሰናበተህም፤ አልጠላህምም፡፡",
            "verse 93:4": "መጨረሻይቱም (ዓለም) ከመጀመሪያይቱ ይልቅ ላንተ በላጭ ናት፡፡",
            "verse 93:5": "ጌታህም ወደ ፊት (ብዙን ስጦታ) በእርግጥ ይሰጥሃል፡፡ ትደሰታለህም፡፡",
            "verse 93:6": "የቲም ኾነህ አላገኘህምና አላስጠጋህምን? (አስጠግቶሃል)፡፡",
            "verse 93:7": "የሳትክም ኾነህ አገኘህ መራህም፡፡",
            "verse 93:8": "ድኻም ኾነህ አገኘህ፤ አከበረህም፡፡",
            "verse 93:9": "የቲምንማ አትጨቁን፡፡",
            "verse 93:10": "ለማኝንም አትገላምጥ፡፡",
            "verse 93:11": "በጌታህም ጸጋ አውራ፤ (ግለጻት)፡፡"
        },
        "Arabic": {
            "verse 93:1": "ٰىَحُّضلاَو",
            "verse 93:2": "ٰىَجَس اَذِإ ِلْيَّللاَو",
            "verse 93:3": "ٰىَلَق اَمَو َكُّبَر َكَعَّدَو اَم",
            "verse 93:4": "ٰىَلوُأْلا َنِم َكَّل ٌرْيَخ ُةَرِخآْلَلَو",
            "verse 93:5": "ٰىَضْرَتَف َكُّبَر َكيِطْعُي َفْوَسَلَو",
            "verse 93:6": "ٰىَوآَف اًميِتَي َكْدِجَي ْمَلَأ",
            "verse 93:7": "ٰىَدَهَف اًّلاَض َكَدَجَوَو",
            "verse 93:8": "ٰىَنْغَأَف اًلِئاَع َكَدَجَوَو",
            "verse 93:9": "ْرَهْقَت اَلَف َميِتَيْلا اَّمَأَف",
            "verse 93:10": "(ْرَهْنَت اَلَف َلِئاَّسلا اَّمَأَو",
            "verse 93:11": "(ْثِّدَحَف َكِّبَر ِةَمْعِنِب اَّمَأَو"
        },
        "Azerbaijani": {
            "verse 93:1": "And olsun səhərə!",
            "verse 93:2": "And olsun sakitləşən gecəyə!",
            "verse 93:3": "Rəbbin nə səni tərk etmişdi, nə də sənə acığı tutmuşdu.",
            "verse 93:4": "Həqiqətən, Axirət sənə dünya həyatından daha xeyirlidir.",
            "verse 93:5": "Şübhəsiz ki, Rəbbin sənə nemət bəxş edəcək, sən də razı qalacaqsan.",
            "verse 93:6": "Məgər O, səni yetim çağında qoruyub sığınacaq vermədimi?",
            "verse 93:7": "Səni çaşqın olduğun halda doğru yola yönəltmədimi?",
            "verse 93:8": "Kasıb olduğun zaman səni varlandırmadımı?",
            "verse 93:9": "Elə isə yetimə xor baxma!",
            "verse 93:10": "Səndən kömək diləyəni qovma!",
            "verse 93:11": "Və Rəbbinin nemətindən danış."
        },
        "Bengali": {
            "verse 93:1": "শপথ পূর্বাহ্নের,",
            "verse 93:2": "শপথ রাত্রির যখন তা গভীর হয়,",
            "verse 93:3": "আপনার পালনকর্তা আপনাকে ত্যাগ করেনি এবং আপনার প্রতি বিরূপও হননি।",
            "verse 93:4": "আপনার জন্যে পরকাল ইহকাল অপেক্ষা শ্রেয়।",
            "verse 93:5": "আপনার পালনকর্তা সত্বরই আপনাকে দান করবেন, অতঃপর আপনি সন্তুষ্ট হবেন।",
            "verse 93:6": "তিনি কি আপনাকে এতীমরূপে পাননি? অতঃপর তিনি আশ্রয় দিয়েছেন।",
            "verse 93:7": "তিনি আপনাকে পেয়েছেন পথহারা, অতঃপর পথপ্রদর্শন করেছেন।",
            "verse 93:8": "তিনি আপনাকে পেয়েছেন নিঃস্ব, অতঃপর অভাবমুক্ত করেছেন।",
            "verse 93:9": "সুতরাং আপনি এতীমের প্রতি কঠোর হবেন না;",
            "verse 93:10": "সওয়ালকারীকে ধমক দেবেন না।",
            "verse 93:11": "এবং আপনার পালনকর্তার নেয়ামতের কথা প্রকাশ করুন।"
        },
        "Berber Amazigh": {
            "verse 93:1": "S tafat n tûebêit!",
            "verse 93:2": "S yiv, ma irked!",
            "verse 93:3": "Ur k Iooi Mass ik, ur k Ikrih.",
            "verse 93:4": "Tudert taneggarut ik, a ppif tamezwarut ik.",
            "verse 93:5": "A k tôavi tikci, deqqal, n Mass ik.",
            "verse 93:6": "Day ur k id Iufa ara d agujil, Isduri k?",
            "verse 93:7": "Iufa k id d utlif, Inha k.",
            "verse 93:8": "Iufa k id d igellil, I$at ik.",
            "verse 93:9": "Ihi, ur qehheô agujil.",
            "verse 93:10": "Ur ppara amappar.",
            "verse 93:11": "Wanag, $ef l$it n Mass ik, xas eêku."
        },
        "Bosnian": {
            "verse 93:1": "Tako mi jutra",
            "verse 93:2": "i noći kada se utiša –",
            "verse 93:3": "Gospodar tvoj nije te ni napustio ni omrznuo!",
            "verse 93:4": "Onaj svijet je, zaista, bolji za tebe od ovoga svijeta,",
            "verse 93:5": "a Gospodar tvoj će tebi, sigurno, dati, pa ćeš zadovoljan biti!",
            "verse 93:6": "Zar nisi siroče bio, pa ti je On utočište pružio,",
            "verse 93:7": "i za pravu vjeru nisi znao, pa te je na Pravi put uputio,",
            "verse 93:8": "i siromah si bio, pa te je imućnim učinio?",
            "verse 93:9": "Zato siroče ne ucvili,",
            "verse 93:10": "a na prosjaka ne podvikni,",
            "verse 93:11": "i o blagodati Gospodara svoga kazuj!"
        },
        "Bulgarian": {
            "verse 93:1": "Кълна се в утрото",
            "verse 93:2": "и в нощта, когато настъпва мрак -",
            "verse 93:3": "не те изостави твоят Господ [о, Мухаммад] и не те възненавиди.",
            "verse 93:4": "Отвъдният живот е по-добър за теб от настоящия.",
            "verse 93:5": "И ще ти въздаде твоят Господ, и ще си доволен.",
            "verse 93:6": "Не те ли намери Той сирак и не те ли приюти?",
            "verse 93:7": "И те намери заблуден, и те напъти.",
            "verse 93:8": "И те намери беден, и те замогна.",
            "verse 93:9": "Тъй че не огорчавай сирака!",
            "verse 93:10": "И не отпъждай умоляващия!",
            "verse 93:11": "И за благодатта на твоя Господ възвестявай!"
        },
        "Chinese": {
            "verse 93:1": "誓以上午，",
            "verse 93:2": "誓以黑夜，当其寂静的时候，",
            "verse 93:3": "你的主没有弃绝你，也没有怨恨你；",
            "verse 93:4": "後世於你，确比今世更好；",
            "verse 93:5": "你的主将来必赏赐你，以至你喜悦。",
            "verse 93:6": "难道他没有发现你伶仃孤苦，而使你有所归宿？",
            "verse 93:7": "他曾发现你徘徊歧途，而把你引入正路；",
            "verse 93:8": "发现你家境寒苦，而使你衣食丰足。",
            "verse 93:9": "至於孤儿，你不要压迫他；",
            "verse 93:10": "至於乞丐，你不要喝斥他，",
            "verse 93:11": "至於你的主所赐你的恩典呢，你应当宣示它。"
        },
        "Danish": {
            "verse 93:1": "Bij de glorie van de dag",
            "verse 93:2": "En bij de nacht als het donker is",
            "verse 93:3": "Uw Heer heeft u niet verlaten, noch is Hij mishaagd over u",
            "verse 93:4": "Voorwaar, het komende uur zal beter zijn voor u dan het vorige",
            "verse 93:5": "En voorwaar uw Heer zal u geven, en gij zult tevreden zijn",
            "verse 93:6": "Vond Hij u niet als wees, en beschermde u",
            "verse 93:7": "En vond Hij u niet zoekende en leidde Hij u",
            "verse 93:8": "En vond Hij u niet in armoede en verrijkte u",
            "verse 93:9": "Daarom verdruk de wees niet",
            "verse 93:10": "En snauw de bedelaar niet af",
            "verse 93:11": "Maar maak de gunst van uw Heer bekend"
        },
        "Dutch": {
            "verse 93:1": "Bij het ochtendlicht.",
            "verse 93:2": "En bij de nacht wanneer het geheel donker is.",
            "verse 93:3": "Jouw Heer heeft jou (O Moehammad) niet verlaten en Hij is niet kwaad (op jou).",
            "verse 93:4": "En het latere (het Hiernamaals) is zeker beter voor jou dan het eerste (het wereldse leven).",
            "verse 93:5": "En jouw Heer zal jou zeker gunsten schenken, zodat jij tevreden zult zijn.",
            "verse 93:6": "Heeft Hij jou niet als wees gevonden en jou in bescherming genomen?",
            "verse 93:7": "En Hij heeft jou dwalend gevonden en jou geleid.",
            "verse 93:8": "En Hij heeft jou behoeftig gevonden en rijk gemaakt.",
            "verse 93:9": "Wat de wees betreft: beledig hem niet.",
            "verse 93:10": "En wat de bedelaar betreft: wijs hem niet af.",
            "verse 93:11": "En wat de gunsten van jouw Heer betreft: spreek daarover!"
        },
        "English": {
            "verse 93:1": "By the morning brightness",
            "verse 93:2": "And [by] the night when it covers with darkness,",
            "verse 93:3": "Your Lord has not taken leave of you, [O Muhammad], nor has He detested [you].",
            "verse 93:4": "And the Hereafter is better for you than the first [life].",
            "verse 93:5": "And your Lord is going to give you, and you will be satisfied.",
            "verse 93:6": "Did He not find you an orphan and give [you] refuge?",
            "verse 93:7": "And He found you lost and guided [you],",
            "verse 93:8": "And He found you poor and made [you] self-sufficient.",
            "verse 93:9": "So as for the orphan, do not oppress [him].",
            "verse 93:10": "And as for the petitioner, do not repel [him].",
            "verse 93:11": "But as for the favor of your Lord, report [it]."
        },
        "Filipino": {
            "verse 93:1": "Sa pamamagitan ng katanghalian (matapos ang maluwalhating sikat ng umaga)",
            "verse 93:2": "At sa pamamagitan ng Gabi kung ito ay pusikit",
            "verse 93:3": "Ang iyong Panginoon (o Muhammad) ay hindi tumalikod sa iyo o namuhi sa iyo",
            "verse 93:4": "At katotohanan, ang Kabilang Buhay ay higit na mainam sa iyo kaysa sa kasalukuyang buhay (ng mundong ito)",
            "verse 93:5": "At katotohanan, ang iyong Panginoon ay magkakaloob sa iyo (ng lahat ng mabuti), upang ikaw ay lubos na masiyahan",
            "verse 93:6": "Hindi baga ikaw (O Muhammad) ay natagpuan Niya na isang ulila at ikaw ay pinagkalooban Niya ng masisilungan",
            "verse 93:7": "At Kanyang natagpuan na ikaw ay walang kamuwangan (sa Qur’an, sa mga legal na batas nito, sa pagka-propeta, atbp.) at ikaw ay ginawaran Niya ng patnubay",
            "verse 93:8": "At Kanyang namasdan na ikaw ay nangangailangan at ikaw ay ginawa Niyang maalwan (may sariling kasapatan at nasisiyahan, atbp)",
            "verse 93:9": "Kaya’t huwag mong ituring ang ulila ng may pang-aapi",
            "verse 93:10": "At huwag mong talikdan ang humihingi",
            "verse 93:11": "At ipagbunyi mo ang Kasaganaan ng iyong Panginoon (alalaong baga, ang pagka-Propeta at lahat ng iba pang Biyaya)"
        },
        "French": {
            "verse 93:1": "Par le Jour Montant!",
            "verse 93:2": "Et par la nuit quand elle couvre tout!",
            "verse 93:3": "Ton Seigneur ne t'a ni abandonné, ni détesté.",
            "verse 93:4": "La vie dernière t'est, certes, meilleure que la vie présente.",
            "verse 93:5": "Ton Seigneur t'accordera certes [Ses faveurs], et alors tu seras satisfait.",
            "verse 93:6": "Ne t'a-t-Il pas trouvé orphelin? Alors Il t'a accueilli!",
            "verse 93:7": "Ne t'a-t-Il pas trouvé égaré? Alors Il t'a guidé.",
            "verse 93:8": "Ne t'a-t-Il pas trouvé pauvre? Alors Il t'a enrichi.",
            "verse 93:9": "Quant à l'orphelin, donc, ne le maltraite pas.",
            "verse 93:10": "Quant au demandeur, ne le repousse pas.",
            "verse 93:11": "Et quant au bienfait de ton Seigneur, proclame-le."
        },
        "Fulah": {
            "verse 93:1": "E mbeeta",
            "verse 93:2": "Mi woondarii jemma si mbo deeƴi",
            "verse 93:3": "joom Ma accaani Mo O añaani",
            "verse 93:4": "Pellet ko galle laakara ɓuri gadana o",
            "verse 93:5": "Yaama joom Ma okku ma mbeleɗa",
            "verse 93:6": "Mbela O tawaani ma ko a Alyatiime O mool Ma",
            "verse 93:7": "O tawma ko majjuɗo O feewnu ma",
            "verse 93:8": "O taw ma ko a baasɗo O alɗin ma",
            "verse 93:9": "Tawi ko alyatiime woto hoynu mbo",
            "verse 93:10": "Woto furo ñaagatooɗo",
            "verse 93:11": "Tawi ko neema joom ma haal"
        },
        "German": {
            "verse 93:1": "Bei der Morgenhelle",
            "verse 93:2": "und der Nacht, wenn sie (alles) umhüllt!",
            "verse 93:3": "Dein Herr hat sich weder von dir verabschiedet noch haßt Er (dich).",
            "verse 93:4": "Und das Jenseits ist wahrlich besser für dich als das Diesseits.",
            "verse 93:5": "Und dein Herr wird dir wahrlich geben, und dann wirst du zufrieden sein.",
            "verse 93:6": "Hat Er dich nicht als Waise gefunden und (dir) dann Zuflucht verschafft",
            "verse 93:7": "und dich irregehend gefunden und dann rechtgeleitet",
            "verse 93:8": "und dich arm gefunden und dann reich gemacht?",
            "verse 93:9": "Was nun die Waise angeht, so unterjoche (sie) nicht,",
            "verse 93:10": "und was den Bettler angeht, so fahre (ihn) nicht an,",
            "verse 93:11": "und was die Gunst deines Herrn angeht, so erzähle (davon)."
        },
        "Hausa": {
            "verse 93:1": "Inã rantsuwa da hantsi.",
            "verse 93:2": "Da dare a lõkacin da ya rufe (da duhunsa).",
            "verse 93:3": "Ubangijinka bai yi maka bankwana ba, kuma bai ƙĩ kaba.",
            "verse 93:4": "Kuma lalle ta ƙarshe ce mafi alheri a gare ka daga ta farko.",
            "verse 93:5": "Kuma lalle ne, Ubangijinka zai yi ta bã ka kyauta sai ka yarda.",
            "verse 93:6": "Ashe, bai sãme ka marãya ba, sa'an nan Ya yi maka makõma?",
            "verse 93:7": "Kuma Ya sãme ka bã ka da shari'ã, sai Ya shiryar da kai?",
            "verse 93:8": "Kuma Ya sãme ka matalauci, sai Ya wadãtã ka?",
            "verse 93:9": "Sabõda haka, amma marãya, to, kada ka rinjãye shi.",
            "verse 93:10": "Kuma amma mai tambaya, kada ka yi masa tsãwa.",
            "verse 93:11": "Kuma amma ni'imar Ubangijinka, sai ka faɗa (dõmin gõdiya)."
        },
        "Hindi": {
            "verse 93:1": "(ऐ रसूल) पहर दिन चढ़े की क़सम",
            "verse 93:2": "और रात की जब (चीज़ों को) छुपा ले",
            "verse 93:3": "कि तुम्हारा परवरदिगार न तुमको छोड़ बैठा और (न तुमसे) नाराज़ हुआ",
            "verse 93:4": "और तुम्हारे वास्ते आख़ेरत दुनिया से यक़ीनी कहीं बेहतर है",
            "verse 93:5": "और तुम्हारा परवरदिगार अनक़रीब इस क़दर अता करेगा कि तुम ख़ुश हो जाओ",
            "verse 93:6": "क्या उसने तुम्हें यतीम पाकर (अबू तालिब की) पनाह न दी (ज़रूर दी)",
            "verse 93:7": "और तुमको एहकाम से नावाकिफ़ देखा तो मंज़िले मक़सूद तक पहुँचा दिया",
            "verse 93:8": "और तुमको तंगदस्त देखकर ग़नी कर दिया",
            "verse 93:9": "तो तुम भी यतीम पर सितम न करना",
            "verse 93:10": "माँगने वाले को झिड़की न देना",
            "verse 93:11": "और अपने परवरदिगार की नेअमतों का ज़िक्र करते रहना"
        },
        "Indonesian": {
            "verse 93:1": "Demi waktu matahari sepenggalahan naik,",
            "verse 93:2": "dan demi malam apabila telah sunyi (gelap),",
            "verse 93:3": "Tuhanmu tiada meninggalkan kamu dan tiada (pula) benci kepadamu.",
            "verse 93:4": "Dan sesungguhnya hari kemudian itu lebih baik bagimu daripada yang sekarang (permulaan).",
            "verse 93:5": "Dan kelak Tuhanmu pasti memberikan karunia-Nya kepadamu, lalu (hati) kamu menjadi puas.",
            "verse 93:6": "Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu?",
            "verse 93:7": "Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.",
            "verse 93:8": "Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan.",
            "verse 93:9": "Sebab itu, terhadap anak yatim janganlah kamu berlaku sewenang-wenang.",
            "verse 93:10": "Dan terhadap orang yang minta-minta, janganlah kamu menghardiknya.",
            "verse 93:11": "Dan terhadap nikmat Tuhanmu, maka hendaklah kamu siarkan."
        },
        "Italian": {
            "verse 93:1": "Per la luce del mattino,",
            "verse 93:2": "per la notte quando si addensa:",
            "verse 93:3": "il tuo Signore non ti ha abbandonato e non ti disprezza",
            "verse 93:4": "e per te l'altra vita sarà migliore della precedente.",
            "verse 93:5": "Il tuo Signore ti darà [in abbondanza] e ne sarai soddisfatto.",
            "verse 93:6": "Non ti ha trovato orfano e ti ha dato rifugio?",
            "verse 93:7": "Non ti ha trovato smarrito e ti ha dato la guida?",
            "verse 93:8": "Non ti ha trovato povero e ti ha arricchito?",
            "verse 93:9": "Dunque non opprimere l'orfano,",
            "verse 93:10": "non respingere il mendicante,",
            "verse 93:11": "e proclama la grazia del tuo Signore."
        },
        "Japanese": {
            "verse 93:1": "朝（の輝き）において，",
            "verse 93:2": "静寂な夜において（誓う）。",
            "verse 93:3": "主は，あなたを見捨てられず，憎まれた訳でもない。",
            "verse 93:4": "本当に来世（将来）は，あなたにとって現世（現在）より，もっと良いのである。",
            "verse 93:5": "やがて主はあなたの満足するものを御授けになる。",
            "verse 93:6": "かれは孤児のあなたを見付けられ，庇護なされたではないか。",
            "verse 93:7": "かれはさ迷っていたあなたを見付けて，導きを与え。",
            "verse 93:8": "また貧しいあなたを見付けて，裕福になされたではないか。",
            "verse 93:9": "だから孤児を虐げてはならない。",
            "verse 93:10": "請う者を揆ね付けてはならない。",
            "verse 93:11": "あなたの主の恩恵を宣べ伝えるがいい。"
        },
        "Jawa": {
            "verse 93:1": "Dhemi wayah esuk",
            "verse 93:2": "Lan wengi nalikane peteng",
            "verse 93:3": "Pangeranira ora ninggal sira lan ora duka marang sira",
            "verse 93:4": "Tumraping sira akherat iku luwih becik tinimbang donya",
            "verse 93:5": "Lan Pangeranira bakal enggal apaparing marang sira, supaya sira rena (lega)",
            "verse 93:6": "Apa Alah ora uninga yen sira iku bocah yatim, banjur aparing pangayoman",
            "verse 93:7": "Allah nguningani yen sira iku bingung nuli dituduhake dalan (pituduh)",
            "verse 93:8": "Allah nguningani yen sira iku ora duwe nuli disugihake",
            "verse 93:9": "Dene bocah yatim iku aja sira kanihaya",
            "verse 93:10": "Lan yen ana wong jejaluk, aja sira nulak",
            "verse 93:11": "Peparinge Pangeranira kabungahan sira handhak-kandhakna"
        },
        "Kazakh": {
            "verse 93:1": "Сәскемен ант етемін",
            "verse 93:2": "және қоюланған түнмен ант етемін",
            "verse 93:3": "Ей, Мұхаммед! Раббың сені тастап кетпеді және жеккөрген де жоқ",
            "verse 93:4": "Әрі күмәнсіз, сен үшін соңғы, мәңгілік өмір ақирет , алғашқысынан осы өмірден қайырлы",
            "verse 93:5": "Әрі сөзсіз, жақында Раббың саған береді де сен разы боласың",
            "verse 93:6": "Ол сені жетім күйде тауып, паналатпады ма",
            "verse 93:7": "Әрі адасқан түрде тауып, тура жолға салмады ма",
            "verse 93:8": "және кедей халде тауып, байытпады ма",
            "verse 93:9": "Енді сен де жетімді қор санама",
            "verse 93:10": "сұраушыны зекіп, қума",
            "verse 93:11": "Әрі Раббыңның игілігі жайлы айт"
        },
        "Korean": {
            "verse 93:1": "아침을 두고 맹세하고아침을 두고 맹세하고",
            "verse 93:2": "어둠이 짙어지는 밤을 두고 맹세하사어둠이 짙어지는 밤을 두고 맹세하사",
            "verse 93:3": "주님께서 그대를 버리지 아니했으며 미워하지도 않으시니라주님께서 그대를 버리지 아니했으며 미워하지도 않으시니라",
            "verse 93:4": "실로 그대에게는 내세가 현세보다 나으리니실로 그대에게는 내세가 현세보다 나으리니",
            "verse 93:5": "주님께서 그대에게 은혜를 베풀것이매 그대는 이로하여 기뻐하리라주님께서 그대에게 은혜를 베풀것이매 그대는 이로하여 기뻐하리라",
            "verse 93:6": "그분은 고아인 그대를 발견하여 그대를 보호하지 아니 했더뇨그분은 고아인 그대를 발견하여 그대를 보호하지 아니 했더뇨",
            "verse 93:7": "그분은 방황하는 그대를 발견하여 그대를 인도하지 아니 했더 뇨그분은 방황하는 그대를 발견하여 그대를 인도하지 아니 했더 뇨",
            "verse 93:8": "그분은 가난했던 그대를 부유하게 하여 주지 아니 했더뇨그분은 가난했던 그대를 부유하게 하여 주지 아니 했더뇨",
            "verse 93:9": "그러므로 고아들을 거칠게 대하지말며그러므로 고아들을 거칠게 대하지말며",
            "verse 93:10": "구하는 자에게 거절하지 말고구하는 자에게 거절하지 말고",
            "verse 93:11": "그리고 주님의 은혜를 이야기 하라그리고 주님의 은혜를 이야기 하라"
        },
        "Kurdish": {
            "verse 93:1": "Bi (danê) taştêسوێند به چێشته‌نگاو (کاتێك خۆر به‌رز ده‌بێته‌وه‌و کاتی جوڵه‌و چالاکیه‌).",
            "verse 93:2": "Bi şeva gava tarîtîya wê hewyaسوێند به شه‌و کاتێك به‌تاریکیه‌که‌ی زه‌وی داده‌پۆشێت.",
            "verse 93:3": "(Sond dixum!) Ku Xuda yê te dest ji te bernedaye ji te jî ne xeyîdîyeپه‌روه‌ردگارت ده‌ستبه‌رداری تۆ نه‌بووه‌و وازی له تۆ نه‌هێناوه‌و خه‌شمی لێ نه‌گرتوویت (ماوه‌یه‌ك وه‌حی نه‌هات بۆ پێغه‌مبه‌ر صلی الله علیه وسلم کافرانی قوڕه‌یش وتیان، په‌روه‌ردگاری محمد وازی لێ هێناوه‌، ئیتر خوای گه‌وره به‌درۆی خسته‌وه‌).",
            "verse 93:4": "Û bi rastî (danê para da) ji bona te ra (ji danê) cihanê çêtir eبێگومان قیامه‌ت و دواڕۆژ چاکتره بۆ تۆ له دنیا.",
            "verse 93:5": "Û Xuda yê teyê bi rastî ji bona te ra di nêzîk da dayîneke wusa bide, ku tu bi wê dayînê qayîl bibîله ئاینده‌دا په‌روه‌ردگارت ئه‌وه‌نده نازو نیعمه‌تت پێده‌به‌خشێت که زۆر پێی ڕازی و خۆشنوود ده‌بیت.",
            "verse 93:6": "Maqey (Xuda yê te)gava tu sêwî bûyî tu xweyî ne kirîئایا په‌روه‌ردگارت نه‌یبینیت به هه‌تیوی و خێرا ده‌رووی لێکردیته‌وه و لانه‌ی بۆ سازاندیت و حه‌واندیتیه‌وه‌؟!",
            "verse 93:7": "Gava tu wundayî bûyî ewî tu ne anî li ser rêya rastئه‌ی سه‌رگه‌ردان نه‌بوویت و نه‌ت ده‌زانی چی بکه‌یت، هیدایه‌تی دایت و ڕێنموویی کردیت؟!",
            "verse 93:8": "Gava tu xêzan bûyî ewî tu zengin ne kirîئه‌ی نه‌یبینیت که هه‌ژارو نه‌داریت، جا ماڵ و سامانی پێبه‌خشیت و ده‌وڵه‌مه‌ندی کردیت و بێ نیازی کردیت؟!",
            "verse 93:9": "Îdî tu bi tucureyî li sêwîyan zorê nekeکه‌واته تۆش (ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم، ئه‌ی ئیماندار) هه‌تیو مه‌چه‌وسێنه‌ره‌وه‌و دڵی مه‌ڕه‌نجێنه‌.",
            "verse 93:10": "Û bi tu cureyî parsekan bê par nekeهه‌ڵمه‌شاخێ به هه‌ژارو داماوو سواڵکه‌راندا.",
            "verse 93:11": "Û tu bi wan qencîne, ku Xuda yê te bi te kirîye bi axive(به‌ڵکو) ده‌رباره‌ی نازو نیعمه‌ته‌کانی په‌روه‌ردگارت هه‌میشه بدوێ و باسیان بکه له جێی خۆیاندا به‌کاریان بهێنه‌."
        },
        "Kyrgyz": {
            "verse 93:1": "Шашке маалына ант",
            "verse 93:2": "Тынч-— караңгы түнгө ант",
            "verse 93:3": "(О, Мухаммад!) Раббиң сени таштаган жок жана (сага) ачууланган жок",
            "verse 93:4": "Сен үчүн Акырет (жашоосу) абалкысынан (дүйнө жашоосунан) жакшыраак",
            "verse 93:5": "Раббиң сага жакында (сыйлыктарын) берет. Анан сен ыраазы болосуң",
            "verse 93:6": "Ал (Аллаһ) сени жетим абалда таап, андан кийин башпаанек бербеди беле?”",
            "verse 93:7": "Жана (Аллаһ) сени адашкан абалда таап?, андан кийин Туура Жол көргөздү го",
            "verse 93:8": "Жана (Раббиң) сени кембагал абалда таап, андан кийин бай кылды",
            "verse 93:9": "Эми, сен жетимге каарыңды төкпө",
            "verse 93:10": "Жана сураган адамга орой мамиле кылба",
            "verse 93:11": "Эми, сен Раббиңдин нээматтары жөнүндө сүйлө"
        },
        "Malay": {
            "verse 93:1": "Demi waktu dhuha,",
            "verse 93:2": "Dan malam apabila ia sunyi-sepi -",
            "verse 93:3": "(Bahawa) Tuhanmu (wahai Muhammad) tidak meninggalkanmu, dan Ia tidak benci (kepadamu, sebagaimana yang dituduh oleh kaum musyrik).",
            "verse 93:4": "Dan sesungguhnya kesudahan keaadaanmu adalah lebih baik bagimu daripada permulaannya.",
            "verse 93:5": "Dan sesungguhnya Tuhanmu akan memberikanmu (kejayaan dan kebahagiaan di dunia dan di akhirat) sehingga engkau reda - berpuas hati.",
            "verse 93:6": "Bukankah dia mendapati engkau yatim piatu, lalu la memberikan perlindungan?",
            "verse 93:7": "Dan didapatiNya engkau mencari-cari (jalan yang benar), lalu Ia memberikan hidayah petunjuk (dengan wahyu - Al-Quran)?",
            "verse 93:8": "Dan didapatiNya engkau miskin, lalu Ia memberikan kekayaan?",
            "verse 93:9": "Oleh itu, adapun anak yatim maka janganlah engkau berlaku kasar terhadapnya,",
            "verse 93:10": "Adapun orang yang meminta (bantuan pimpinan) maka janganlah engkau tengking herdik;",
            "verse 93:11": "Adapun nikmat Tuhanmu, maka hendaklah engkau sebut-sebutkan (dan zahirkan) sebagai bersyukur kepadaNya."
        },
        "Malayalam": {
            "verse 93:1": "പൂര്‍വ്വാഹ്നം തന്നെയാണ സത്യം;",
            "verse 93:2": "രാത്രി തന്നെയാണ സത്യം; അത് ശാന്തമാവുമ്പോള്‍",
            "verse 93:3": "(നബിയേ,) നിന്‍റെ രക്ഷിതാവ് നിന്നെ കൈവിട്ടിട്ടില്ല. വെറുത്തിട്ടുമില്ല.",
            "verse 93:4": "തീര്‍ച്ചയായും പരലോകമാണ് നിനക്ക് ഇഹലോകത്തെക്കാള്‍ ഉത്തമമായിട്ടുള്ളത്‌.",
            "verse 93:5": "വഴിയെ നിനക്ക് നിന്‍റെ രക്ഷിതാവ് (അനുഗ്രഹങ്ങള്‍) നല്‍കുന്നതും അപ്പോള്‍ നീ തൃപ്തിപ്പെടുന്നതുമാണ.്‌",
            "verse 93:6": "നിന്നെ അവന്‍ ഒരു അനാഥയായി കണെ്ടത്തുകയും , എന്നിട്ട് (നിനക്ക്‌) ആശ്രയം നല്‍കുകയും ചെയ്തില്ലേ?",
            "verse 93:7": "നിന്നെ അവന്‍ വഴി അറിയാത്തവനായി കണെ്ടത്തുകയും എന്നിട്ട് (നിനക്ക്‌) മാര്‍ഗദര്‍ശനം നല്‍കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 93:8": "നിന്നെ അവന്‍ ദരിദ്രനായി കണെ്ടത്തുകയും എന്നിട്ട് അവന്‍ ഐശ്വര്യം നല്‍കുകയും ചെയ്തിരിക്കുന്നു.",
            "verse 93:9": "എന്നിരിക്കെ അനാഥയെ നീ അടിച്ചമര്‍ത്തരുത്‌",
            "verse 93:10": "ചോദിച്ച് വരുന്നവനെ നീ വിരട്ടി വിടുകയും ചെയ്യരുത്‌.",
            "verse 93:11": "നിന്‍റെ രക്ഷിതാവിന്‍റെ അനുഗ്രഹത്തെ സംബന്ധിച്ച് നീ സംസാരിക്കുക."
        },
        "Norwegian": {
            "verse 93:1": "Ved formiddagens glød!",
            "verse 93:2": "Ved nattens stillhet!",
            "verse 93:3": "Ikke har din Herre forlatt deg, og ikke er Han misfornøyd med deg!",
            "verse 93:4": "Enden skal bli bedre for deg enn begynnelsen.",
            "verse 93:5": "Herren skal gi deg så du blir tilfreds!",
            "verse 93:6": "Fant Han deg ikke foreldreløs, og gav deg ly?",
            "verse 93:7": "Han fant deg villfarende, og veiledet deg!",
            "verse 93:8": "Han fant deg trengende, og gjorde deg uavhengig!",
            "verse 93:9": "Så vær ikke hard mot den faderløse,",
            "verse 93:10": "og vis ikke bort den som ber.",
            "verse 93:11": "Og hva Herrens godhet angår, så gjør den kjent!"
        },
        "Pashto": {
            "verse 93:1": "قسم دى په څاښت باندې",
            "verse 93:2": "او په شپه باندې كله چې قراره شي",
            "verse 93:3": "چې ته خپل رب نه پریښى يې او نه يې (درسره) بغض ساتلى دى",
            "verse 93:4": "او خامخا اخرت تا لپاره له دنیا نه ډېر غوره دى",
            "verse 93:5": "او خامخا ژر به تا ته ستا رب دركړي، نو ته به راضي (خوشحاله) شې",
            "verse 93:6": "ایا ته يې یتیم نه وې موندلى؟ پس پناه ځاى يې دركړ",
            "verse 93:7": "او ته يې ناخبره (او ناپوه) وموندلې، نو لار ښوونه يې (درته) وكړه",
            "verse 93:8": "او ته يې فقیر وموندلې، نو غني يې كړې",
            "verse 93:9": "نو هر چې یتیم دى، نو ته (ده ته) قهر مه كوه",
            "verse 93:10": "او هر چې سوالګرى دى، نو ته يې مه رټه",
            "verse 93:11": "او پاتې شو (نعمت) نو ته د خپل رب نعمت بیانوه"
        },
        "Persian": {
            "verse 93:1": "سوگند به آغاز روز،",
            "verse 93:2": "و سوگند به شب چون آرام و در خود شود،",
            "verse 93:3": "كه پروردگارت تو را ترك نكرده و بر تو خشم نگرفته است.",
            "verse 93:4": "هر آينه آخرت براى تو بهتر از دنياست.",
            "verse 93:5": "به زودى پروردگارت تو را عطا خواهد داد تا خشنود شوى.",
            "verse 93:6": "آيا تو را يتيم نيافت و پناهت داد؟",
            "verse 93:7": "آيا تو را گمگشته نيافت و هدايتت كرد؟",
            "verse 93:8": "آيا تو را درويش نيافت و توانگرت گردانيد؟",
            "verse 93:9": "پس يتيم را ميازار،",
            "verse 93:10": "و گدا را مَران،",
            "verse 93:11": "و از نعمت پروردگارت سخن بگوى."
        },
        "Polish": {
            "verse 93:1": "Na jasność poranka!",
            "verse 93:2": "Na noc, kiedy spokojnie zapada!",
            "verse 93:3": "Nie opuścił cię twój Pan ani cię nie znienawidził.",
            "verse 93:4": "I z pewnością ostateczne będzie lepsze dla ciebie aniżeli pierwsze!",
            "verse 93:5": "I z pewnością niebawem obdarzy cię twój Pan i będziesz zadowolony!",
            "verse 93:6": "Czyż nie znalazł cię sierotą i czy nie dał ci schronienia?",
            "verse 93:7": "Czy nie znalazł cię błądzącym i czy nie poprowadził cię drogą prostą?",
            "verse 93:8": "I czy nie znalazł cię biednym, i nie wzbogacił cię?",
            "verse 93:9": "Przeto sieroty - nie uciskaj!",
            "verse 93:10": "A żebraka - nie odpychaj!",
            "verse 93:11": "A o dobrodziejstwie twego Pana - opowiadaj!"
        },
        "Portuguese": {
            "verse 93:1": "Pelas horas da manhã,",
            "verse 93:2": "E pela noite, quando é serena,",
            "verse 93:3": "Que o teu Senhor não te abandonou, nem te odiou.",
            "verse 93:4": "E sem dúvida que a outra vida será melhor, para ti, do que a presente.",
            "verse 93:5": "Logo o teu Senhor te agraciará, de um modo que te satisfaça.",
            "verse 93:6": "Porventura, não te encontrou órgão e te amparou?",
            "verse 93:7": "Não te encontrou extraviado e te encaminhou?",
            "verse 93:8": "Não te achou necessitado e te enriqueceu?",
            "verse 93:9": "Portanto, não maltrates o órfão,",
            "verse 93:10": "Nem tampouco repudies o mendigo,",
            "verse 93:11": "Mas divulga a mercê do teu Senhor, em teu discurso."
        },
        "Punjabi": {
            "verse 93:1": "ਸਹੁੰ ਹੈ, ਪ੍ਰਕਾਸ਼ਮਈ ਦਿਨ ਦੀ।",
            "verse 93:2": "ਅਤੇ ਰਾਤ ਦੀ ਜਦੋਂ ਉਹ (ਦਿਨ ਤੇ) ਛਾ ਜਾਵੇ।",
            "verse 93:3": "ਤੁਹਾਡੇ ਰੱਬ ਨੇ ਤੁਹਾਨੂੰ ਨਹੀਂ ਛੱਡਿਆ ਅਤੇ ਨਾ ਉਹ ਤੁਹਾਡੇ ਤੋਂ ਬੇਮੁੱਖ ਹੋਇਆ ਹੈ।",
            "verse 93:4": "ਅਤੇ ਨਿਸਚਿਤ ਰੂਪ ਨਾਲ ਪ੍ਰਲੋਕ ਤੁਹਾਡੇ ਲਈ ਸੰਸਾਰ ਤੋਂ ਬਿਹਤਰ ਹੈ।",
            "verse 93:5": "ਅਤੇ ਜਲਦੀ ਹੀ ਅੱਲਾਹ ਤੁਹਾਨੂੰ ਦੇਵੇਗਾ। ਫਿਰ ਤੂੰ ਸਤੂੰਸ਼ਟ ਹੋ ਜਾਵੇਗਾ।",
            "verse 93:6": "ਕੀ ਅੱਲਾਹ ਨੇ ਤੁਹਾਨੂੰ ਅਨਾਥ ਨਹੀਂ ਦੇਖਿਆ, ਫਿਰ ਉਸ ਨੇ ਤੁਹਾਨੂੰ ਟਿਕਾਣਾ ਦਿੱਤਾ।",
            "verse 93:7": "ਅਤੇ ਤੁਹਾਨੂੰ ਲੱਭਣ ਵਾਲਾ ਦੇਖਿਆ, ਤਾਂ ਉਸ ਨੇ ਤੁਹਾਨੂੰ ਰਾਹ ਦਿਖਾਇਆ।",
            "verse 93:8": "ਅਤੇ ਤੁਹਾਨੂੰ ਧਨ ਹੀਨ ਦੇਖਿਆ, ਤਾਂ ਤੁਹਾਨੂੰ (ਧਨ ਦੌਲਤ ਨਾਲ) ਸੰਪੰਨ ਕਰ ਦਿੱਤਾ।",
            "verse 93:9": "ਤਾਂ ਤੁਸੀਂ ਅਨਾਥਾਂ ਤੇ ਸਖ਼ਤੀ ਨਾ ਕਰੋ।",
            "verse 93:10": "ਅਤੇ ਤੁਸੀਂ ਭਿਖਾਰੀਆਂ ਨੂੰ ਨਾ ਝਿੜਕੌ।",
            "verse 93:11": "ਅਤੇ ਤੁਸੀਂ ਆਪਣੇ ਰੱਬ ਦੇ ਉਪਕਾਰਾਂ ਦੀ ਉਸਤਤ ਕਰੋਂ।"
        },
        "Roman english": {
            "verse 93:1": "Wad duhaa",
            "verse 93:2": "Wal laili iza sajaa",
            "verse 93:3": "Ma wad da`aka rabbuka wa ma qalaa",
            "verse 93:4": "Walal-aakhiratu khairul laka minal-oola",
            "verse 93:5": "Wa la sawfa y`uteeka rabbuka fatarda",
            "verse 93:6": "Alam ya jidka yateeman fa aawaa",
            "verse 93:7": "Wa wa jadaka daal lan fahada",
            "verse 93:8": "Wa wa jadaka `aa-ilan fa aghnaa",
            "verse 93:9": "Fa am mal yateema fala taqhar",
            "verse 93:10": "Wa am mas saa-ila fala tanhar",
            "verse 93:11": "Wa amma bi ni`mati rabbika fahad dith"
        },
        "Russian": {
            "verse 93:1": "В знак (ореола) утреннего света,",
            "verse 93:2": "В знак все темнеющего крова ночи, -",
            "verse 93:3": "Тебя Господь твой не оставил, Тебя не разлюбил Владыка твой.",
            "verse 93:4": "И знай, что каждый будущий момент Счастливей для тебя, чем предыдущий.",
            "verse 93:5": "И скоро твой Господь пошлет тебе То, чем (безмерно) будешь ты доволен.",
            "verse 93:6": "Неужто не нашел тебя Он сиротой? Не дал приюта (и заботы)?",
            "verse 93:7": "Блуждал (в неведении) ты, Но разве не направил Он тебя по праведной стезе?",
            "verse 93:8": "В лишениях тебя увидев, Он разве не обогатил тебя?",
            "verse 93:9": "А потому ты сироту не притесняй,",
            "verse 93:10": "Просящего, (не выслушав), не отгоняй",
            "verse 93:11": "И возвещай всему и вся о мудрости Аллаха!"
        },
        "Sindhi": {
            "verse 93:1": "مٿي آيل ڏينھن جو قسم آھي.",
            "verse 93:2": "۽ رات جو (قسم) آھي، جڏھن ڍَڪي ٿي.",
            "verse 93:3": "ته (اي پيغمبر) تنھنجي پالڻھار توکي نه ڇڏيو ۽ نڪي ناراض ٿيو.",
            "verse 93:4": "۽ بيشڪ آخرت تولاءِ دنيا کان گھڻو چڱي آھي.",
            "verse 93:5": "۽ تنھنجو پالڻھار سگھوئي توکي (ايترو) ڏيندو جو (تون) خوش ٿيندين.",
            "verse 93:6": "توکي يتيم نه ڏٺائين ڇا پوءِ (توکي) جاءِ ڏنائين.",
            "verse 93:7": "۽ توکي ناواقف ڏٺائين پوءِ (شريعت جي) رستي لاتائين.",
            "verse 93:8": "۽ توکي مسڪين ڏٺائين پوءِ آسودو ڪيائين.",
            "verse 93:9": "تنھنڪري يتيم تي تون ڏاڍ نه ڪر.",
            "verse 93:10": "۽ سُوالي کي نه جھڻڪ.",
            "verse 93:11": "۽ پنھنجي پالڻھار جي نعمت جو بيان ڪندو رھ."
        },
        "Sinhalese": {
            "verse 93:1": "පෙරවරු ව මත දිවුරා දිවුරමින්,",
            "verse 93:2": "තවද රාත්‍රිය (දහවල) ආවරණය කරන විට, ඒ මත දිවුරමින්,",
            "verse 93:3": "නුඹගේ පරමාධිපති නුඹ ව අතහැර දැමුවේ නැත. එමෙන්ම ඔහු අමනාප වූයේ ද නැත.",
            "verse 93:4": "සැබැවින්ම, ආරම්භයට වඩා අවසානය නුඹට වඩාත් යහපත් ය.",
            "verse 93:5": "තවද නුඹගේ පරමාධිපති නුඹට මතුවට පිරිනමනු ඇත. එවිට නුඹ තෘප්තියට පත් වනු ඇත.",
            "verse 93:6": "ඔහු නුඹ ව අනාථයෙකු ලෙස දැක නුඹට රැකවරණය නොදුන්නේද?",
            "verse 93:7": "තවද නුඹ ව අතරමං වූවෙකු ලෙස දැක පසුව ඔහු මඟ පෙන්වූයේය.",
            "verse 93:8": "තවද ඔහු නුඹ ව අවශ්‍යතාව ඇත්තෙකු ලෙස දැක පසුව ඔහු ස්වයංපෝෂිත කළේය.",
            "verse 93:9": "එහෙයින් අනාථයාට කටුක ලෙස නොසළකනු.",
            "verse 93:10": "තවද අයදින්නා ව පලවා නොහරිනු.",
            "verse 93:11": "තවද නුඹගේ පරමාධිපතිගේ ආශිර්වාදයන් ගැන නුඹ ප්‍රකාශ කරනු."
        },
        "Somali": {
            "verse 93:1": "Eebe wuxuu ku dhaartay Barqinka.",
            "verse 93:2": "Iyo Habeenku markuu xasilo (Madoobaado).",
            "verse 93:3": "Inaan Eebe ka tagin Nabiyow kuuna cadhoonin.",
            "verse 93:4": "Aakharana kaaga khayr badan Aduunka.",
            "verse 93:5": "Eebaana ku siindoona (wanaag) waadna raalli noqon.",
            "verse 93:6": "Miyuusan ku helin Eebahaa Adigoo Agoon ah oosan ku dhawaynin.",
            "verse 93:7": "Miyuunase ku helin Adigoo baadi ah oosan ku hanuuninin.",
            "verse 93:8": "Miyuunase ku helin Adigoo caydhi ah oosna ku hodminin (kuu waxyoonin).",
            "verse 93:9": "Ee Agoonta ha xoogin (hana dhihin).",
            "verse 93:10": "Ka wax su'aalina ha canaanan.",
            "verse 93:11": "Nicmada Eebahaana ka sheekee (ku mahadi)."
        },
        "Spanish": {
            "verse 93:1": "Por la luz de la mañana!",
            "verse 93:2": "Por la noche cuando está en calma!",
            "verse 93:3": "Que tu Señor no ha prescindido de ti ni te desdeña.",
            "verse 93:4": "La Última Vida será mejor para ti que la primera.",
            "verse 93:5": "Tu Señor te dará y quedarás satisfecho.",
            "verse 93:6": "Acaso no te halló huérfano y te amparó?",
            "verse 93:7": "Y no te halló perdido y te guió?",
            "verse 93:8": "Y no te halló pobre y te enriqueció?",
            "verse 93:9": "Por eso, no abuses del huérfano.",
            "verse 93:10": "Ni ahuyentes al mendigo.",
            "verse 93:11": "Y habla del favor que tu Señor te ha dado."
        },
        "Swahili": {
            "verse 93:1": "Naapa kwa mchana!",
            "verse 93:2": "Na kwa usiku unapo tanda!",
            "verse 93:3": "Mola wako Mlezi hakukuacha, wala hakukasirika nawe.",
            "verse 93:4": "Na bila ya shaka wakati ujao utakuwa bora kwako kuliko ulio tangulia.",
            "verse 93:5": "Na Mola wako Mlezi atakupa mpaka uridhike.",
            "verse 93:6": "Kwani hakukukuta yatima akakupa makaazi?",
            "verse 93:7": "Na akakukuta umepotea akakuongoa?",
            "verse 93:8": "Akakukuta mhitaji akakutosheleza?",
            "verse 93:9": "Basi yatima usimwonee!",
            "verse 93:10": "Na anaye omba au kuuliza usimkaripie!",
            "verse 93:11": "Na neema za Mola wako Mlezi zisimlie."
        },
        "Swedish": {
            "verse 93:1": "VID DET klara morgonljuset",
            "verse 93:2": "och vid natten, när dess mörker tätnar!",
            "verse 93:3": "Din Herre har inte övergett dig och du har inte väckt Hans missnöje.",
            "verse 93:4": "Det liv som ligger framför dig skall förvisso bli lättare än det som hittills varit!",
            "verse 93:5": "Och din Herre skall skänka dig [Sitt goda i överflöd] och du skall bli helt nöjd.",
            "verse 93:6": "Fann Han dig inte faderlös och gav dig ett hem?",
            "verse 93:7": "Och såg Han dig inte vilsen och vägledde dig",
            "verse 93:8": "Och såg Han dig inte lida nöd och skänkte dig allt vad du behövde",
            "verse 93:9": "Var därför inte hård mot den faderlöse",
            "verse 93:10": "och stöt inte bort tiggaren med barska ord.",
            "verse 93:11": "Men berätta [för alla] om din Herres välgärningar!"
        },
        "Tajik": {
            "verse 93:1": "Савганд ба вақти чошт,",
            "verse 93:2": "ва савганд ба шаб, чун бипӯшад (бо торикии худ атрофро),",
            "verse 93:3": "ки Парвардигорат туро тарк накарда ва душман ҳам нагирифтааст.",
            "verse 93:4": "Албатта охират барои ту беҳтар аз дунёст.",
            "verse 93:5": "Ба зуди Парвардигорат туро ато хоҳад дод, то хушнуд шавӣ.",
            "verse 93:6": "Оё туро ятим наёфт ва паноҳат надод?",
            "verse 93:7": "Ва туро гумгашта ёфт ва ҳидоятат кард?",
            "verse 93:8": "Ва туро дарвеш ёфт ва тавонгарат гардонид?",
            "verse 93:9": "Пас ятимро маёзор",
            "verse 93:10": "ва гадоро марон",
            "verse 93:11": "ва аз неъмати Парвардигорат сухан бигӯй."
        },
        "Tamil": {
            "verse 93:1": "முற்பகல் மீது சத்தியமாக",
            "verse 93:2": "ஒடுங்கிக் கொள்ளும் இரவின் மீது சத்தியமாக-",
            "verse 93:3": "உம்முடைய இறைவன் உம்மைக் கை விடவுமில்லை; அவன் (உம்மை) வெறுக்கவுமில்லை.",
            "verse 93:4": "மேலும் பிந்தியது (மறுமை) முந்தியதை (இம்மையை) விட உமக்கு மேலானதாகும்.",
            "verse 93:5": "இன்னும், உம்முடைய இறைவன் வெகு சீக்கிரம் உமக்கு (உயர் பதவிகளைக்) கொடுப்பான்; அப்பொழுது நீர் திருப்தியடைவீர்.",
            "verse 93:6": "(நபியே!) அவன் உம்மை அநாதையாகக் கண்டு, அப்பால் (உமக்குப்) புகலிடமளிக்கவில்லையா?",
            "verse 93:7": "இன்னும், உம்மை வழியற்றவராகக் கண்டு அவன், (உம்மை) நேர்வழியில் செலுத்தினான்.",
            "verse 93:8": "மேலும், அவன் உம்மைத் தேவையுடையவராகக்கண்டு, (உம்மைச் செல்வத்தால்) தேவையில்லாதவராக்கினான்.",
            "verse 93:9": "எனவே, நீர் அநாதையைக் கடிந்து கொள்ளாதீர்.",
            "verse 93:10": "யாசிப்போரை விரட்டாதீர்.",
            "verse 93:11": "மேலும், உம்முடைய இறைவனின் அருட்கொடையைப் பற்றி (பிறருக்கு) அறிவித்துக் கொண்டிருப்பீராக."
        },
        "Tatar": {
            "verse 93:1": "Төшкә хәтле булган вакыт белән ант\" итәм.",
            "verse 93:2": "Вә төн белән ант итәм, һәркайчан ул төн караңгылыгы белән һәрнәрсәне капласа.",
            "verse 93:3": "Ий Мухәммәд г-м, Раббың сине ташламады һәм сиңа ачуланмады да. (Яһүдләр беркөнне Мухәммәд г-мнән Зүл карнәен вә асъхаб каһәф хәбәрен һәм рух рәвешене сорадылар. Мухәммәд г-м аларга: \"Иртәгә җавап бирермен\", диде, ләкин, Аллаһ теләсә димәде. Шуннан соң вәхий киселде, берничә вакытлар Җәбраил фәрештә иңмәде. Шул вакытта мөшрикләр: \"Мухәммәдне Раббысы ташлады һәм аңа ачуланды\", – диделәр. Бу сүрә шул хакта инде.)",
            "verse 93:4": "Сиңа, әлбәттә, ахирәт дөньядан хәерлерәкдер. (Ягъни Аллаһ сине патша кылмады һәм сине миллиардер да кылмады, чөнки болар һәммәсе бетә торган нәрсәләр. Бәлки сиңа Раббың дәрәҗәсе мәңгегә кала торган пәйгамбәрлекне бирде.)",
            "verse 93:5": "Вә тиздән сиңа Раббың өмет иткәнеңне һәм сораганыңны бирер дә, син Аның биргәненнән разый булырсың.",
            "verse 93:6": "Әйә Раббың сине ятим хәлендә табып тәрбия урынын насыйп итмәдеме? (Атасы белән бертуган кардәше Әбү Талиб тәрбияләп үстерде.)",
            "verse 93:7": "Дәхи Раббың сине пәйгамбәр булганчы хак диннән адашучы табып, аннары туры юлга күндерде түгелме?",
            "verse 93:8": "Дәхи Раббың сине бик фәкыйрь табып, аннары сине бай кылды түгелме?",
            "verse 93:9": "Башта үзең ятим булгач, ятимгә золым итмә, какма, сукма – бәлки хөрмәтлә.",
            "verse 93:10": "Һәм синнән сораучыга каты мөгамәлә кылма, ни сораса да җавап бир һәм теләген үтә.",
            "verse 93:11": "Һәм Раббыңның нигъмәте булган шәригать хөкемнәрен кешеләргә өйрәт һәм сөйләп төшендер! Чөнки шәригатьне белмәгән кешеләр Аллаһуның ґәзабына ашыгалар. Ә син аларны җәннәткә кызыктыр һәм чакыр!"
        },
        "Telugu": {
            "verse 93:1": "ప్రకాశవంతమైన ప్రొద్దుటి పూట (పూర్వాహ్ణం) సాక్షిగా",
            "verse 93:2": "మరియు చీకటి పడ్డ రాత్రి సాక్షిగా",
            "verse 93:3": "(ఓ ముహమ్మద్!) నీ ప్రభువు, నిన్ను త్యజించనూ లేదు మరియు నిన్ను ఉపేక్షించనూ లేదు",
            "verse 93:4": "మరియు రాబోయే కాలం (జీవితం) నీ కొరకు మొదటి కాలం (జీవితం) కంటే ఎంతో మేలైనది",
            "verse 93:5": "మరియు త్వరలోనే నీ ప్రభువు నీకు (నీవు కోరేది) ప్రసాదిస్తాడు. దానితో నీవు సంతోషపడతావు",
            "verse 93:6": "(ఓ ముహమ్మద్!) ఏమీ? నిన్ను అనాథునిగా చూసి, ఆయన (అల్లాహ్) నీకు ఆశ్రయం కల్పించలేదా",
            "verse 93:7": "మరియు నీకు మార్గం తోచనప్పుడు, ఆయన నీకు మార్గదర్శకత్వం చేయలేదా",
            "verse 93:8": "మరియు ఆయన, పేదవానిగా చూసి, నిన్ను సంపన్నుడిగా చేయలేదా",
            "verse 93:9": "కాబట్టి నీవు అనాథుల పట్ల కఠినంగా ప్రవర్తించకు",
            "verse 93:10": "మరియు యాచకుణ్ణి కసరుకోకు",
            "verse 93:11": "మరియు నీ ప్రభువు అనుగ్రహాలను బహిరంగంగా ప్రకటిస్తూ ఉండు"
        },
        "Thai": {
            "verse 93:1": "ขอสาบานด้วยเวลาสาย",
            "verse 93:2": "และด้วยเวลากลางคืนเมื่อมันมืด และสงัดเงียบ",
            "verse 93:3": "พระเจ้าของเจ้ามิได้ทรงทอดทิ้งเจ้า และมิได้ทรงโกรธเคืองเจ้า",
            "verse 93:4": "และแน่นอนเบื้องปลายเป็นการดียิ่งแก่เจ้ากว่าเบื้องต้น",
            "verse 93:5": "และความแน่นอนพระเจ้าของเจ้าจะให้แก่เจ้าจนกว่าจะพอใจ",
            "verse 93:6": "พระองค์มิได้ทรงพบเจ้าเป็นกำพร้าแล้วทรงให้ที่พึ่งดอกหรือ ?",
            "verse 93:7": "และทรงพบเจ้าระเหเร่ร่อน แล้วก็ทรงชี้แนะทาง (แก่เจ้า) ดอกหรือ ?",
            "verse 93:8": "และทรงพบเจ้าเป็นผู้ขัดสน แล้วให้มั่งคั่ง (แก่) เจ้าดอกหรือ ?",
            "verse 93:9": "ดังนั้นส่วนเด็กกำพร้าเจ้าอย่าข่มขี่",
            "verse 93:10": "และส่วนผู้เอ่ยขอนั้น เจ้าอย่าตวาดขับไล่",
            "verse 93:11": "และส่วนความโปรดปรานแห่งพระเจ้าของเจ้านั้น เจ้าจงแสดงออก"
        },
        "Turkish": {
            "verse 93:1": "Kuşluk vaktine and olsun;",
            "verse 93:2": "Sükun erdiği zaman geceye and olsun ki,",
            "verse 93:3": "Rabbin seni ne bıraktı ve ne de sana darıldı.",
            "verse 93:4": "Doğrusu ahiret senin için dünyadan daha hayırlıdır.",
            "verse 93:5": "Rabbin şüphesiz sana verecek ve sen de hoşnut olacaksın.",
            "verse 93:6": "Seni öksüz bulup da barındırmadı mı?",
            "verse 93:7": "Seni şaşırmış bulup, doğru yola eriştirmedi mi?",
            "verse 93:8": "Seni fakir bulup zenginleştirmedi mi?",
            "verse 93:9": "Öyleyse sakın öksüze kötü muamele etme;",
            "verse 93:10": "Ve sakın bir şey isteyeni azarlama;",
            "verse 93:11": "Yalnızca Rabbinin nimetini anlat."
        },
        "Urdu": {
            "verse 93:1": "آفتاب کی روشنی کی قسم",
            "verse 93:2": "اور رات (کی تاریکی) کی جب چھا جائے",
            "verse 93:3": "کہ (اے محمدﷺ) تمہارے پروردگار نے نہ تو تم کو چھوڑا اور نہ (تم سے) ناراض ہوا",
            "verse 93:4": "اور آخرت تمہارے لیے پہلی (حالت یعنی دنیا) سے کہیں بہتر ہے",
            "verse 93:5": "اور تمہیں پروردگار عنقریب وہ کچھ عطا فرمائے گا کہ تم خوش ہو جاؤ گے",
            "verse 93:6": "بھلا اس نے تمہیں یتیم پا کر جگہ نہیں دی؟ (بےشک دی)",
            "verse 93:7": "اور رستے سے ناواقف دیکھا تو رستہ دکھایا",
            "verse 93:8": "اور تنگ دست پایا تو غنی کر دیا",
            "verse 93:9": "تو تم بھی یتیم پر ستم نہ کرنا",
            "verse 93:10": "اور مانگنے والے کو جھڑکی نہ دینا",
            "verse 93:11": "اور اپنے پروردگار کی نعمتوں کا بیان کرتے رہنا"
        },
        "Uyghur": {
            "verse 93:1": "چاشگاھ ۋاقتى بىلەن قەسەمكى،",
            "verse 93:2": "قاراڭغۇلۇقى (ئەتراپنى قاپلىغان) چاغدىكى كېچە بىلەن قەسەمكى،",
            "verse 93:3": "(ئى مۇھەممەد!) پەرۋەردىگارىڭ سېنى تاشلىۋەتكىنىمۇ يوق، يامان كۆرۈپ قالغىنىمۇ يوق",
            "verse 93:4": "ساڭا ئاخىرەت ئەلۋەتتە دۇنيادىن ياخشىدۇر،",
            "verse 93:5": "پەرۋەردىگارىڭ ساڭا (ئاخىرەتتە ساۋاب، ھۆرمەت ۋە شاپائەت قاتارلىقلارنى) ئاتا قىلىدۇ، سەن مەمنۇن بولىسەن",
            "verse 93:6": "ئۇ سېنى يېتىم بىلىپ پاناھ بەرمىدىمۇ؟",
            "verse 93:7": "قايمۇققان بىلىپ ھىدايەت قىلمىدىمۇ؟",
            "verse 93:8": "سېنى يوقسىز بىلىپ (كىشىلەردىن) بىھاجەت قىلمىدىمۇ؟",
            "verse 93:9": "يېتىمنى خارلىما",
            "verse 93:10": "سائىلغا قوپاللىق قىلما",
            "verse 93:11": "پەرۋەردىگارىڭنىڭ (ساڭا بەرگەن) نېمىتىنى (كىشىلەرگە) سۆزلەپ بەرگىن (چۈنكى نېمەتنى سۆزلەپ بەرگەنلىك نېمەتكە شۈكۈر قىلغانلىق بولىدۇ)"
        },
        "Uzbek": {
            "verse 93:1": "Чошгоҳ билан қасам.",
            "verse 93:2": "Сукунатга чўмган тун билан қасам.",
            "verse 93:3": "Роббинг сени тарк қилмади ва ғазаб ҳам қилмади.",
            "verse 93:4": "Ва, албатта, охират сен учун бу дунёдан яхшидир.",
            "verse 93:5": "Ва тезда Роббинг сенга ато қиладир ва сен рози бўлурсан.",
            "verse 93:6": "У сени етим топиб, жойлаб қўймадими?",
            "verse 93:7": "Ва У сени ҳайрон топиб, ҳидоятга бошламадими?",
            "verse 93:8": "Ва У сени камбағал топиб, бой қилмадими?",
            "verse 93:9": "Аммо етимга қаҳр қилма.",
            "verse 93:10": "Ва, аммо, «соил»га зажр қилма.",
            "verse 93:11": "Ва, аммо, Роббингнинг берган неъмати ҳақида сўзла."
        },
        "Vietnamese": {
            "verse 93:1": "Thế bởi khoảng thời gian sau khi mặt trời đã mọc cao một sào.",
            "verse 93:2": "Thề bởi ban đêm khi nó bao phủ (mọi vật một cách yên bình).",
            "verse 93:3": "(Hỡi Thiên Sứ Muhammad!) Thượng Đế của Ngươi không bỏ rơi Ngươi cũng chẳng ghét Ngươi.",
            "verse 93:4": "Cuộc sống Đời Sau chắc chắn sẽ tốt hơn cho Ngươi so với cuộc đời này.",
            "verse 93:5": "Thượng Đế của Ngươi chắc chắn sẽ ban cho Ngươi điều mà Ngươi sẽ hài lòng.",
            "verse 93:6": "Chẳng phải Ngài thấy Ngươi mồ côi nên đã ban cho Ngươi một chỗ nương tựa?",
            "verse 93:7": "Chẳng phải Ngài thấy Ngươi lầm lạc nên đã hướng dẫn Ngươi?",
            "verse 93:8": "Chẳng phải Ngài thấy Ngươi nghèo nên đã ban cho Ngươi sự giàu có.",
            "verse 93:9": "Vì vậy, đối với trẻ mồ côi Ngươi chớ đừng bạc đãi.",
            "verse 93:10": "Đối với người ăn xin Ngươi cũng đừng đuổi xua.",
            "verse 93:11": "Và đối với ân huệ Thượng Đế của Ngươi, Ngươi hãy công khai tuyên bố."
        },
        "Yoruba": {
            "verse 93:1": "(Allahu bura pelu) iyaleta",
            "verse 93:2": "O tun bura pelu ale nigba ti (ile) ba su",
            "verse 93:3": "Oluwa re ko pa o ti, ko si binu si o",
            "verse 93:4": "Dajudaju orun loore fun o ju aye lo",
            "verse 93:5": "Dajudaju laipe Oluwa re maa fun o ni (oore pupo ni orun). Nitori naa, o si maa yonu si i",
            "verse 93:6": "Se (Allahu) ko ri o ni omo-orukan ni? O si fun o ni ibugbe",
            "verse 93:7": "O si ri o ni alaimona (iyen siwaju isokale imisi). O si fi ona mo o",
            "verse 93:8": "O tun ri o ni alaini, O si ro o loro",
            "verse 93:9": "Nitori naa, ni ti omo-orukan, ma se je gaba (le e lori)",
            "verse 93:10": "Ni ti alagbe, ma si se jagbe (mo on)",
            "verse 93:11": "Ni ti idera Oluwa re, so o jade"
        }
    }
}