{
    "id": 95,
    "name_simple": "At-Tin",
    "revelation_place": "makkah",
    "revelation_order": 28,
    "bismillah_pre": true,
    "verses_count": 8,
    "short_text": "The Surah has been so named after the very first word at-tin.",
    "text": [
        "\n",
        "The Surah has been so named after the very first word at-tin.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to Qatadah, this Surah is Madani. Two different views have been reported from Ibn Abbas: first that it is a Makki Surah, and second that it is Madani. But the majority of scholars regard it as a Makki revelation, a manifest symbol of which is the use of the words hadh-al-balad-il-amin (this city of peace) for Makkah. Obviously, if it had been revealed at Madinah, it would not be correct to use the words \"this city\" for Makkah Besides, a study of the contents of the Surah shows that it belongs to the earliest period of Makkah, for in it there is no sign whatever to indicate that during the period of its revelation any conflict had started between Islam and unbelief. Moreover, it reflects the same style of the earliest revelations of Makkah period in which briefly and succinctly the people have been made to realize that the judgment of the Hereafter is necessary and absolutely rational.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is the rewards and punishments of the Hereafter. For this purpose first swearing an oath by the habitats of some illustrious Prophets, it has been stated that Allah has created man in the most excellent of molds. Although at other places in the Quran, this truth has been expressed in different ways, for example, at some places it has been said: \"Allah appointed man His vicegerent on the earth and commanded the angels to bow down to him (Al-Baqarah: 30,34, Al-Anam: 165, Al-Araf: 11, Al-Hijr: 28-29, An-Naml: 62, Suad: 71-73);\" at others that: \"Man has become bearer of the Divine trust, which the earth and the heavens and the mountains did not have the power to bear (Al-Ahzab: 72);\" and at still others that: \"We honored the children of Adam and exalted them above many of Our other creatures (Bani Israil 70),\" yet here the statement made on oath in particular by the habitats of the Prophets that man has been created in the finest of molds, signifies that mankind has been\r\nblessed with such an excellent mold and nature that it gave birth to men capable of attaining to the highest position of Prophethood, a higher position than which has not been attained by any other creature of God.",
        "\n",
        "Then, it has been stated that there are two kinds of men. those who in spite of having been created in the finest of molds, become inclined to evil and their moral degeneration causes them to be reduced to the lowest of the low, and those who by adopting the way of faith and righteousness remain secure from the degeneration and consistent with the noble position, which is the necessary demand of their having been created in the best of molds. The existence among mankind of both these kinds of men is such a factual thing which no one can deny, for it is being observed and experienced in society everywhere at all times.",
        "\n",
        "In conclusion, this factual reality has been used as an argument to prove that when among the people there are these two separate and quite distinct kinds, how can one deny the judgment and retribution for deeds If the morally degraded are not punished and the morally pure and exalted are not rewarded and both end in the dust alike, it would mean that there is no justice in the Kingdom of God; whereas human nature and common sense demand that a judge should do justice. How then can one conceive that Allah, Who is the most just of all judges, would not do justice?",
        "\n"
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Fig and the olive, and other signs, representing the Holy Land in which God revealed the Evangel, the Torah, and the Quran, and thereby guided all mankind. It is named after “the fig” (al-tīn) mentioned in verse 1. The surah questions how man can deny the Judgement, and emphasizing the importance of faith and good deeds.The surah is also known as: The Figtree.",
    "name_translation": "The Fig",
    "name_complex": "At-Tîn",
    "surah_name_ar": "التين",
    "verses": {
        "Albanian": {
            "verse 95:1": "Betohem në fiq dhe ullinj,",
            "verse 95:2": "dhe malin e Sinajit,",
            "verse 95:3": "dhe në këtë qytet të sigurt,",
            "verse 95:4": "me të vërtetë, Na e kemi krijuar njeriun në formën (hrmoninë) më të bukur,",
            "verse 95:5": "pastaj, e kemi kthyer atë në gjendjen më të ulët (në këtë jetë dhe tjetrën),",
            "verse 95:6": "përveç atyre që besojnë dhe punojnë vepra të mira, për ta ka shpëblime të pandërprera.",
            "verse 95:7": "E, çka atëherë të shtyni ty (o njeri), që ta mohosh besimin?",
            "verse 95:8": "A nuk është Perëndia gjykatësi më i drejtë?!"
        },
        "Amharic": {
            "verse 95:1": "በበለስና በዘይት ወይራ እምላለሁ፡፡",
            "verse 95:2": "በሲኒን ተራራም፤",
            "verse 95:3": "በዚህ በጸጥተኛው አገርም (እምላለሁ)፡፡",
            "verse 95:4": "ሰውን በጣም በአማረ አቋም ላይ ፈጠርነው፡፡",
            "verse 95:5": "ከዚያም (ከፊሉን) ከዝቅተኞች ሁሉ በታች አድርገን መለስነው፡፡",
            "verse 95:6": "ግን እነዚያ ያመኑት መልካሞችንም የሠሩት ለእነርሱ ተቆራጭ ያልኾነ ምንዳ አልላቸው፡፡",
            "verse 95:7": "ታዲያ ከዚህ በኋላ በፍርዱ ምን አስተባባይ አደረገህ?",
            "verse 95:8": "አላህ ከፈራጆች ሁሉ ይበልጥ ፈራጅ አይደለምን? (ነው)፡፡"
        },
        "Arabic": {
            "verse 95:1": "ِنوُتْيَّزلاَو ِنيِّتلاَو",
            "verse 95:2": "َنيِنيِس ِروُطَو",
            "verse 95:3": "ِنيِمَأْلا ِدَلَبْلا اَذَٰهَو",
            "verse 95:4": "ٍميِوْقَت ِنَسْحَأ يِف َناَسنِإْلا اَنْقَلَخ ْدَقَل",
            "verse 95:5": "َنيِلِفاَس َلَفْسَأ ُهاَنْدَدَر َّمُث",
            "verse 95:6": "ٍنوُنْمَم ُرْيَغ ٌرْجَأ ْمُهَلَف ِتاَحِلاَّصلا اوُلِمَعَو اوُنَمآ َنيِذَّلا اَّلِإ",
            "verse 95:7": "ِنيِّدلاِب ُدْعَب َكُبِّذَكُي اَمَف",
            "verse 95:8": "َنيِمِكاَحْلا ِمَكْحَأِب ُهَّللا َسْيَلَأ"
        },
        "Azerbaijani": {
            "verse 95:1": "And olsun əncirə və zeytuna!",
            "verse 95:2": "And olsun Sinay dağına!",
            "verse 95:3": "And olsun bu təhlükəsiz şəhərə (Məkkəyə)!",
            "verse 95:4": "Biz insanı ən gözəl surətdə yaratdıq!",
            "verse 95:5": "Sonra isə onu aşağı qatların ən aşağısına (Cəhənnəmin dibinə) qaxacağıq.",
            "verse 95:6": "İman gətirib xeyirxah işlər görənlər istisna olmaqla! Onlar üçün tükənməz mükafat hazırlanmışdır.",
            "verse 95:7": "Bundan sonra dini yalanlamağa səni nə məcbur edir?",
            "verse 95:8": "Məgər Allah hakimlərin ən üstünü deyilmi?"
        },
        "Bengali": {
            "verse 95:1": "শপথ আঞ্জীর (ডুমুর) ও যয়তুনের,",
            "verse 95:2": "এবং সিনাই প্রান্তরস্থ তূর পর্বতের,",
            "verse 95:3": "এবং এই নিরাপদ নগরীর।",
            "verse 95:4": "আমি সৃষ্টি করেছি মানুষকে সুন্দরতর অবয়বে।",
            "verse 95:5": "অতঃপর তাকে ফিরিয়ে দিয়েছি নীচ থেকে নীচে।",
            "verse 95:6": "কিন্তু যারা বিশ্বাস স্থাপন করেছে ও সৎকর্ম করেছে, তাদের জন্যে রয়েছে অশেষ পুরস্কার।",
            "verse 95:7": "অতঃপর কেন তুমি অবিশ্বাস করছ কেয়ামতকে?",
            "verse 95:8": "আল্লাহ কি বিচারকদের মধ্যে শ্রেষ্টতম বিচারক নন?"
        },
        "Berber Amazigh": {
            "verse 95:1": "S tme$ôust akked tzemmurt!",
            "verse 95:2": "S udrar n Sina!",
            "verse 95:3": "Akked temdint agi n laman!",
            "verse 95:4": "Ni$ Nxelq ed amdan d ûûam.",
            "verse 95:5": "Sinna, Nerra t d aneggaru ineggura.",
            "verse 95:6": "Kkes ed wid iumnen, ixeddmen ayen ilhan, i nitni arraz imezgi.",
            "verse 95:7": "Ihi, d acu, deffir waya, ara k iskiddben f uqeîîi?",
            "verse 95:8": "Day Öebbi maççi d Imxeyyeô n yimêaddan?"
        },
        "Bosnian": {
            "verse 95:1": "Tako mi smokve i masline,",
            "verse 95:2": "i Sinajske gore,",
            "verse 95:3": "i grada ovog, sigurnog –",
            "verse 95:4": "Mi čovjeka stvaramo u skladu najljepšem,",
            "verse 95:5": "zatim ćemo ga u najnakazniji lik vratiti,",
            "verse 95:6": "samo ne one koji budu vjerovali i dobra djela činili, njih čeka nagrada neprekidna.",
            "verse 95:7": "Pa šta te onda navodi da poričeš onaj svijet –",
            "verse 95:8": "zar Allah nije sudija najpravedniji?!"
        },
        "Bulgarian": {
            "verse 95:1": "Кълна се в смоковницата и в маслината,",
            "verse 95:2": "и в Синайската планина,",
            "verse 95:3": "и в [Мека] този град на сигурност -",
            "verse 95:4": "Ние сътворихме човека с превъзходен облик.",
            "verse 95:5": "После го отхвърляме най-унизен от унизените,",
            "verse 95:6": "освен онези, които вярват и вършат праведни дела. За тях има безспирна награда.",
            "verse 95:7": "И какво тогава те кара [о, човече] да взимаш за лъжа Възмездието?",
            "verse 95:8": "Не е ли Аллах Най-мъдрият съдник?"
        },
        "Chinese": {
            "verse 95:1": "以无花果和橄榄果盟誓,",
            "verse 95:2": "以西奈山盟誓,",
            "verse 95:3": "以这个安宁的城市盟誓,",
            "verse 95:4": "我确已把人造成具有最美的形态,",
            "verse 95:5": "然后我使他变成最卑劣的;",
            "verse 95:6": "但信道而且行善者, 将受不断的报酬。",
            "verse 95:7": "此后, 你怎麽还否认报应呢？",
            "verse 95:8": "难道真主不是最公正的判决者吗？"
        },
        "Danish": {
            "verse 95:1": "Bij de vijg en de olijf",
            "verse 95:2": "Bij de berg Sinaï",
            "verse 95:3": "En bij deze stad van Vrede (Makka)",
            "verse 95:4": "Voorzeker, Wij hebben de mens in de beste vorm geschapen",
            "verse 95:5": "Daarna laten Wij hem vervallen tot het allerlaagste",
            "verse 95:6": "Behalve degenen die geloven en goede werken doen; hunner is een oneindige beloning",
            "verse 95:7": "Wat is de oorzaak die u het Gericht doet loochenen",
            "verse 95:8": "Is Allah niet de Rechter aller rechters"
        },
        "Dutch": {
            "verse 95:1": "Bij de vijg en de olijf.",
            "verse 95:2": "Bij de berg Sinaï.",
            "verse 95:3": "Bij deze veilige stad (Mekkah).",
            "verse 95:4": "Voorzeker, Wij hebben de mens in de beste vorm geschapen.",
            "verse 95:5": "Daarna doen Wij hem terugkeren tot het laagste van het laagste.",
            "verse 95:6": "Behalve degenen die geloven en goede daden verrichten. Voor hen is er een ononderbroken beloning.",
            "verse 95:7": "Wat doet jullie dan het oordeel nog loochenen?",
            "verse 95:8": "Is Allah niet de Rechtvaardigste der Rechters?"
        },
        "English": {
            "verse 95:1": "By the fig and the olive",
            "verse 95:2": "And [by] Mount Sinai",
            "verse 95:3": "And [by] this secure city [Makkah],",
            "verse 95:4": "We have certainly created man in the best of stature;",
            "verse 95:5": "Then We return him to the lowest of the low,",
            "verse 95:6": "Except for those who believe and do righteous deeds, for they will have a reward uninterrupted.",
            "verse 95:7": "So what yet causes you to deny the Recompense?",
            "verse 95:8": "Is not Allah the most just of judges?"
        },
        "Filipino": {
            "verse 95:1": "Sa pamamagitan ng Igos at sa pamamagitan ng oliba",
            "verse 95:2": "Sa pamamagitan ng Bundok ng Sinai",
            "verse 95:3": "At sa pamamagitan ng Lupain ng Kaligtasan (Makkah)",
            "verse 95:4": "Katotohanang Aming nilikha ang tao sa ganap na anyo (at sukat)",
            "verse 95:5": "At pagkatapos ay Aming ibinaba siya sa pinakamababa sa lahat ng mababa",
            "verse 95:6": "Maliban sa mga may pananalig (sa Islam at Kaisahan ni Allah) at may matutuwid na gawa, kung gayon, sasakanila ang gantimpala na walang hanggan (Paraiso)",
            "verse 95:7": "Kung gayon, ano (o sino) ang nagtulak sa inyo (o mga walang pananampalataya) na itatwa ang Kabayaran (alalaong baga, ang Araw ng Muling Pagkabuhay)",
            "verse 95:8": "Hindi baga si Allah ang Pinakamaalam sa lahat ng Hukom"
        },
        "French": {
            "verse 95:1": "Par le figuier et l'olivier!",
            "verse 95:2": "Et par le Mont Sînîn!",
            "verse 95:3": "Et par cette Cité sûre!",
            "verse 95:4": "Nous avons certes créé l'homme dans la forme la plus parfaite.",
            "verse 95:5": "Ensuite, Nous l'avons ramené au niveau le plus bas,",
            "verse 95:6": "sauf ceux qui croient et accomplissent les bonnes œuvres: ceux-là auront une récompense jamais interrompue.",
            "verse 95:7": "Après cela, qu'est-ce qui te fait traiter la rétribution de mensonge?",
            "verse 95:8": "Allah n'est-Il pas le plus sage des Juges?"
        },
        "Fulah": {
            "verse 95:1": "Mi woondiri e Tiin e jaytuun",
            "verse 95:2": "E fella Tuur ka Siina",
            "verse 95:3": "E ndi leydi koolii ndi",
            "verse 95:4": "Min tagii aade e mbaadi ɓurndi fortaade e feewde",
            "verse 95:5": "Refti Min ndutti mbo to ɓuri leesɗude",
            "verse 95:6": "Si wonah ɓeen gomɗimɓe ɓe golli moƴƴi ɗin, hino woodani ɓe njoɓdi ndi taƴondirtah",
            "verse 95:7": "Hol fennin ma ñalawma njobdi caggal ɗuum",
            "verse 95:8": "Mbela Alla wonah ɓurɗo nuunɗude e ñaawooɓe ɓe"
        },
        "German": {
            "verse 95:1": "Bei der Feige und der Olive",
            "verse 95:2": "und dem Berg Sinin",
            "verse 95:3": "und dieser sicheren Ortschaft!",
            "verse 95:4": "Wir haben den Menschen ja in schönster Gestaltung erschaffen,",
            "verse 95:5": "hierauf haben Wir ihn zu den Niedrigsten der Niedrigen werden lassen,",
            "verse 95:6": "außer denjenigen, die glauben und rechtschaffene Werke tun; für sie wird es einen Lohn geben, der nicht aufhört.",
            "verse 95:7": "Was läßt dich da weiterhin das Gericht für Lüge erklären?",
            "verse 95:8": "Ist nicht Allah der Weiseste derjenigen, die richten?"
        },
        "Hausa": {
            "verse 95:1": "Inã rantsuwa da Attinu da Azzaitũn.",
            "verse 95:2": "Da Dũr Sĩnĩna.",
            "verse 95:3": "Da wannan gari amintacce.",
            "verse 95:4": "Lalle ne, Mun halitta mutum a cikin mafi kyawon tsayuwa.",
            "verse 95:5": "Sa'an nan, Muka mayar da shi mafi ƙasƙantar masu rauni",
            "verse 95:6": "Face waɗanda suka yi imani, kuma suka aikata ayyukan ƙwarai, saboda haka suna da sakamako wanda bã ya yankewa.",
            "verse 95:7": "To, bãyan haka mẽ ya sanya ka ka ƙaryata sakamako (wanda za a yi a bãyan Tãshin ¡iyãma)?",
            "verse 95:8": "Ashe Allah bã Shi ne Mafi mãsu hukunci kyãwon hukunci ba?"
        },
        "Hindi": {
            "verse 95:1": "इन्जीर और ज़ैतून की क़सम",
            "verse 95:2": "और तूर सीनीन की",
            "verse 95:3": "और उस अमन वाले शहर (मक्का) की",
            "verse 95:4": "कि हमने इन्सान बहुत अच्छे कैड़े का पैदा किया",
            "verse 95:5": "फिर हमने उसे (बूढ़ा करके रफ्ता रफ्ता) पस्त से पस्त हालत की तरफ फेर दिया",
            "verse 95:6": "मगर जो लोग ईमान लाए और अच्छे (अच्छे) काम करते रहे उनके लिए तो बे इन्तेहा अज्र व सवाब है",
            "verse 95:7": "तो (ऐ रसूल) इन दलीलों के बाद तुमको (रोज़े) जज़ा के बारे में कौन झुठला सकता है",
            "verse 95:8": "क्या ख़ुदा सबसे बड़ा हाकिम नहीं है (हाँ ज़रूर है)"
        },
        "Indonesian": {
            "verse 95:1": "Demi (buah) Tin dan (buah) Zaitun,",
            "verse 95:2": "dan demi bukit Sinai,",
            "verse 95:3": "dan demi kota (Mekah) ini yang aman,",
            "verse 95:4": "sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.",
            "verse 95:5": "Kemudian Kami kembalikan dia ke tempat yang serendah-rendahnya (neraka),",
            "verse 95:6": "kecuali orang-orang yang beriman dan mengerjakan amal saleh; maka bagi mereka pahala yang tiada putus-putusnya.",
            "verse 95:7": "Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?",
            "verse 95:8": "Bukankah Allah Hakim yang seadil-adilnya?"
        },
        "Italian": {
            "verse 95:1": "Per il fico e per l'olivo,",
            "verse 95:2": "per il Monte Sinai",
            "verse 95:3": "e per questa contrada sicura!",
            "verse 95:4": "Invero creammo l'uomo nella forma migliore,",
            "verse 95:5": "quindi lo riducemmo all'infimo dell'abiezione,",
            "verse 95:6": "eccezion fatta per coloro che credono e fanno il bene: avranno ricompensa inesauribile.",
            "verse 95:7": "Dopo di ciò cosa mai ti farà tacciare di menzogna il Giudizio?",
            "verse 95:8": "Non è forse Allah il più Saggio dei giudici?"
        },
        "Japanese": {
            "verse 95:1": "無花果とオリーブにおいて，",
            "verse 95:2": "シナイ山において，",
            "verse 95:3": "また平安なこの町において（誓う）。",
            "verse 95:4": "本当にわれは，人間を最も美しい姿に創った。",
            "verse 95:5": "それからわれは，かれを最も低く下げた。",
            "verse 95:6": "信仰して善行に動しむ者は別である。かれらに対しては果てしない報奨があろう。",
            "verse 95:7": "なぜそれでも，おまえは宗教（真実）を否定するのか。",
            "verse 95:8": "アッラーは，最も優れた審判者ではないか。"
        },
        "Jawa": {
            "verse 95:1": "Dhemi woh Tiin, lan woh zaitun",
            "verse 95:2": "Dhemi gunung Thursina",
            "verse 95:3": "Dhemi negara (Mekkah) kang tata tentrem",
            "verse 95:4": "Temen Ingsun wis gawe manungsa ing dalem becik - becikeing dumadi",
            "verse 95:5": "Banjur Ingsun balekake dadi asoring asor",
            "verse 95:6": "Kejaba kang padha angestu lan anindakake panggawe becik iku padha oleh ganjarang kang tanpa pedhot",
            "verse 95:7": "Lan sawise mengkono sapa kang bisa maido marang sira prakara putusan",
            "verse 95:8": "Apa Allah iku dudu becik - becike juru hukum"
        },
        "Kazakh": {
            "verse 95:1": "Ант етемін әнжір және зәйтүнмен",
            "verse 95:2": "және Синин тауымен",
            "verse 95:3": "және осы қауіпсіз қаламен",
            "verse 95:4": "Ақиқатында, адамды көркем бейнеде жараттық",
            "verse 95:5": "Кейін оны төмендердің төменіне қайтардық",
            "verse 95:6": "Ал, сондай иманға келген және ізгі іс істегендер басқа. Оларға таусылмайтын сый бар",
            "verse 95:7": "Осыдан кейін Есеп беруді өтірік деуге сені не итермелейді",
            "verse 95:8": "Аллаһ үкім шығарушылардың ең әділ үкім берушісі емес пе"
        },
        "Korean": {
            "verse 95:1": "무화과와 올리브를 두고 맹세하사무화과와 올리브를 두고 맹세하사",
            "verse 95:2": "시나이 산을 두고 맹세하며시나이 산을 두고 맹세하며",
            "verse 95:3": "안전한 이 도읍을 두고 맹세 하나니안전한 이 도읍을 두고 맹세 하나니",
            "verse 95:4": "하나님은 인간을 제일 아름다 운 형상으로 빛으신 후하나님은 인간을 제일 아름다 운 형상으로 빛으신 후",
            "verse 95:5": "그의 위치를 가장 낮게 하였 노라그의 위치를 가장 낮게 하였 노라",
            "verse 95:6": "그러나 믿음으로 선을 행하는 의로운 자들은 제외되어 그들에게 는 끊임없는 보상이 있노라그러나 믿음으로 선을 행하는 의로운 자들은 제외되어 그들에게 는 끊임없는 보상이 있노라",
            "verse 95:7": "다가올 심판의 날에 관하여 그대를 부정하는 이유는 무엇이뇨다가올 심판의 날에 관하여 그대를 부정하는 이유는 무엇이뇨",
            "verse 95:8": "가장 훌륭한 심판자는 하나님 이 아니더뇨가장 훌륭한 심판자는 하나님 이 아니더뇨"
        },
        "Kurdish": {
            "verse 95:1": "Bi hêjîr û zeytûnanسوێند به هه‌نجیرو زه‌یتوون (که دوو میوه‌ی به‌سوودو به‌که‌ڵکن، سوێند خواردنی خوا به دروستکراوانی بۆ سه‌رنج ڕاکێشانمانه‌، به‌ڵام سوێند خواردنی ئێمه گه‌وره‌یی و گرنگی سوێند پێ خۆراوه‌که ده‌گه‌یه‌نێت).",
            "verse 95:2": "Û bi çîyayê Sîna yêبه‌کێوی طوری سینا (که خوا گفتوگۆی له‌گه‌ڵ حه‌زره‌تی موسا، له‌وێدا کرد).",
            "verse 95:3": "Û bi vî bajarê ewleسوێند به‌م شاره ئه‌مینه‌، که (مه‌ککه‌) یه‌.",
            "verse 95:4": "(Sond dixum!) ku me meriv bi rastî di rindê rûçikan da afirandîyeبه‌ڕاستی ئێمه ئینسانمان له جوانترین شێوه و ڕێکوپێکترین شێوازدا دروست کردووه له هه‌موو ڕوویه‌که‌وه‌.",
            "verse 95:5": "Me paşe ewa (meriva) li bal (tema pîr da) zivirandîye (ku ji pistî zanînê hemî tiştan bîrva bike)(ئه‌گه‌ر ڕێبازی خواناسی نه‌گرێت) سه‌ره‌نجام ده‌یخه‌ینه نزمترینی شوێنه نزمه‌کانه‌وه (له دۆزه‌خدا).",
            "verse 95:6": "Ji pêştirê wanê bawer kirine û karê aştî kirine, îdî ji bona wan ra jî kêreke bê paşî heyeجگه له‌وانه‌ی که باوه‌ڕیان هێناوه‌و کارو کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، پاداشتی هه‌میشه‌و نه‌بڕاوه بۆیان ئاماده‌یه‌.",
            "verse 95:7": "Îdî (Ji piştî van beratan) ka (merivo!) ji bona te ra çi bûye, ku tu bi ola (Xuda û bi roya xelat û celatan) viran dikîجا ئیتر (ئه‌ی ئینسانی سه‌ر که‌ش) چی وای لێکردوویت باوه‌ڕت به‌ڕۆژی قیامه‌ت و لێپرسینه‌وه نه‌بێت دوای ئه‌و هه‌موو نازو نیعمه‌ته‌؟",
            "verse 95:8": "Maqey tu (bawer nakî) ku berawanê berewanan Yezdan eئایا خوا چاکترین فه‌رمانڕه‌وا نیه‌؟ دادپه‌روه‌رترین فه‌رمانڕه‌وا نیه‌؟ (که‌چی تۆی سه‌ر که‌ش پێی ڕازیی نیت!!)."
        },
        "Kyrgyz": {
            "verse 95:1": "Анжирге ант, Зайтунга ант",
            "verse 95:2": "Жана Синай (өрөөнүндөгү) Тур тоосуна ант",
            "verse 95:3": "Жана мына бул тынч шаарга (Маккага) ант",
            "verse 95:4": "Чынында Биз инсанды эң сонун келбетте жараттык",
            "verse 95:5": "Кийин Биз аны (эгер ибадат кылбаса тозоктогу) эң төмөн жерге кайтарабыз",
            "verse 95:6": "Ал эми, ыйман келтирип салих амал кылгандарга (Бейиштеги бийик орундарда) түгөнгүс сооп-сыйлыктар бар",
            "verse 95:7": "(О,инсан! ) Ушундан кийин сени динди “жалган” дешке эмне мажбур кылды",
            "verse 95:8": "Аллаһ эң даанышман өкүмдар эмеспи"
        },
        "Malay": {
            "verse 95:1": "Demi buah Tiin dan Zaitun,",
            "verse 95:2": "Dan Gunung Tursina,",
            "verse 95:3": "Serta negeri (Makkah) yang aman ini, -",
            "verse 95:4": "Sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya (dan berkelengkapan sesuai dengan keadaannya).",
            "verse 95:5": "Kemudian (jika ia panjang umur sehingga tua atau menyalahgunakan kelengkapan itu), Kami kembalikan dia ke serendah-rendah peringkat orang-orang yang rendah,",
            "verse 95:6": "Kecuali orang-orang yang beriman dan beramal soleh, maka mereka beroleh pahala yang tidak putus-putus.",
            "verse 95:7": "(Jika demikian kekuasaanKu), maka apa pula yang menjadikan engkau seorang pendusta, (berkata tidak benar) mengenai hari pembalasan, sesudah (ternyata dalil-dalil yang membuktikan kekuasaanKu mengadakan hari pembalasan) itu?",
            "verse 95:8": "Bukankah Allah (yang demikian kekuasaanNya) seadil-adil Hakim?"
        },
        "Malayalam": {
            "verse 95:1": "അത്തിയും, ഒലീവും,",
            "verse 95:2": "സീനാപര്‍വ്വതവും,",
            "verse 95:3": "നിര്‍ഭയത്വമുള്ള ഈ രാജ്യവും തന്നെയാണ സത്യം.",
            "verse 95:4": "തീര്‍ച്ചയായും മനുഷ്യനെ നാം ഏറ്റവും നല്ല ഘടനയോടു കൂടി സൃഷ്ടിച്ചിരിക്കുന്നു.",
            "verse 95:5": "പിന്നീട് അവനെ നാം അധമരില്‍ അധമനാക്കിത്തീര്‍ത്തു.",
            "verse 95:6": "വിശ്വസിക്കുകയും സല്‍കര്‍മ്മങ്ങള്‍ പ്രവര്‍ത്തിക്കുകയും ചെയ്തവരൊഴികെ. എന്നാല്‍ അവര്‍ക്കാകട്ടെ മുറിഞ്ഞ് പോകാത്ത പ്രതിഫലമുണ്ടായിരിക്കും.",
            "verse 95:7": "എന്നിരിക്കെ ഇതിന് ശേഷം പരലോകത്തെ പ്രതിഫല നടപടിയുടെ കാര്യത്തില്‍ (നബിയേ,) നിന്നെ നിഷേധിച്ചു തള്ളാന്‍ എന്ത് ന്യായമാണുള്ളത്‌?",
            "verse 95:8": "അല്ലാഹു വിധികര്‍ത്താക്കളില്‍ വെച്ചു ഏറ്റവും വലിയ വിധികര്‍ത്താവല്ലയോ?"
        },
        "Norwegian": {
            "verse 95:1": "Ved fikentreet og oljetreet",
            "verse 95:2": "og ved Sinais berg!",
            "verse 95:3": "Ved denne fredlyste by!",
            "verse 95:4": "Vi skapte mennesket på beste måte.",
            "verse 95:5": "Så lot Vi ham synke dypt,",
            "verse 95:6": "unntatt dem som tror og lever rettskaffent, de skal få sin velfortjente lønn.",
            "verse 95:7": "Hva kan vel så få deg til å fornekte dommen?",
            "verse 95:8": "Er ikke Gud den rettferdigste dommer?"
        },
        "Pashto": {
            "verse 95:1": "قسم دى په انځر او زیتون (ښوون) باندې",
            "verse 95:2": "او په طور سینین (غره) باندې",
            "verse 95:3": "او په دې امان وركوونكي/امن والا ښار باندې",
            "verse 95:4": "چې یقینًا یقینًا مونږ انسان په ډېر ښكلي صورت (او اعتدال) كې پیدا كړى دى",
            "verse 95:5": "بیا دى مونږ وګرځاوه د ښكتو ډېر ښكته",
            "verse 95:6": "مګر هغه كسان چې ایمان يې راوړى دى او نېك عملونه يې كړې دي، نو د دوى لپاره نه ختمېدونكى اجر دى",
            "verse 95:7": "نو (اى د قیامت منكره!) له دې نه وروسته تا څه شى د قیامت په هكله دروغ ګڼلو ته اماده كوي؟",
            "verse 95:8": "ایا الله تر ټولو لوى حاكم نه دى؟"
        },
        "Persian": {
            "verse 95:1": "سوگند به انجير و زيتون،",
            "verse 95:2": "سوگند به طور مبارك،",
            "verse 95:3": "سوگند به اين شهر ايمن،",
            "verse 95:4": "كه ما آدمى را در نيكوتر اعتدالى بيافريديم.",
            "verse 95:5": "آنگاه او را فروتر از همه فروتران گردانيديم.",
            "verse 95:6": "مگر آنان كه ايمان آورده‌اند و كارهاى شايسته كرده‌اند كه پاداشى بى‌پايان دارند.",
            "verse 95:7": "پس چيست كه با اين حال تو را به تكذيب قيامت وامى‌دارد؟",
            "verse 95:8": "آيا خدا داورترين داوران نيست؟"
        },
        "Polish": {
            "verse 95:1": "Na drzewo figowe i oliwkowe!",
            "verse 95:2": "Na górę Synaj!",
            "verse 95:3": "Na to miasto bezpieczne!",
            "verse 95:4": "Stworzyliśmy człowieka w najpiękniejszej postaci.",
            "verse 95:5": "Potem uczyniliśmy go znowu najniższym spośród tych, którzy są na dole;",
            "verse 95:6": "Z wyjątkiem tych, którzy uwierzyli i czynili dobre dzieła - dla nich będzie nagroda nieustanna.",
            "verse 95:7": "Cóż więc po tym skłania cię jeszcze, by za kłamstwo uważać Sąd?",
            "verse 95:8": "Czyż Bóg nie jest najsprawiedliwszy z sędziów?!"
        },
        "Portuguese": {
            "verse 95:1": "Pelo figo e pela oliva,",
            "verse 95:2": "Pelo monte Sinai,",
            "verse 95:3": "E por esta metrópole segura (Makka),",
            "verse 95:4": "Que criamos o homem na mais perfeita proporção.",
            "verse 95:5": "Então, o reduzimos à mais baixa das escalas,",
            "verse 95:6": "Salvo os fiéis, que praticam o bem; estes terão uma recompensa infalível.",
            "verse 95:7": "Quem, então, depois disso, te contradirá, quanto ao Dia do Juízo?",
            "verse 95:8": "Acaso, não é Deus o mais prudente dos juízes?"
        },
        "Punjabi": {
            "verse 95:1": "ਇੰਜੀਰ ਅਤੇ ਜੈਤੂਨ ਦੀ ਸਹੁੰ ਹੈ।",
            "verse 95:2": "ਅਤੇ ਸੀਨਾ ਪਹਾੜ ਦੀ।",
            "verse 95:3": "ਅਤੇ ਇਸ ਸ਼ਾਂਤੀ ਵਾਲੇ ਨਗਰ (ਮੱਕਾ) ਦੀ।",
            "verse 95:4": "ਅਸੀਂ ਮਨੁੱਖ ਨੂੰ ਸੋਹਣੀ ਸ਼ਕਲ ਵਾਲਾ ਪੈਦਾ ਕੀਤਾ।",
            "verse 95:5": "ਫਿਰ ਉਸ ਨੂੰ ਸਾਰਿਆਂ ਤੋਂ ਥੱਲੇ ਸੁੱਟ ਦਿੱਤਾ।",
            "verse 95:6": "ਨਾ ਖ਼ਤਮ ਹੋਣ ਵਾਲਾ ਬਦਲਾ (ਜੰਨਤ) ਹੈ।",
            "verse 95:7": "ਤਾਂ ਹੁਣ ਕੀ ਹੈ, ਜਿਸ ਤੋਂ ਤੁਸੀਂ ਬਦਲਾ ਮਿਲਣ ਤੋਂ ਇਨਕਾਰ ਕਰਦੇ ਹੋ।",
            "verse 95:8": "ਕੀ ਅੱਲਾਹ ਸਾਰੇ ਹਾਕਮਾਂ ਤੋਂ ਵੱਡਾ ਹਾਕਮ ਨਹੀਂ"
        },
        "Roman english": {
            "verse 95:1": "Wat teeni waz zaitoon",
            "verse 95:2": "Wa toori sineen",
            "verse 95:3": "Wa haazal balad-il ameen",
            "verse 95:4": "Laqad khalaqnal insaana fee ahsani taqweem",
            "verse 95:5": "Thumma ra dad naahu asfala saafileen",
            "verse 95:6": "Ill-lal lazeena aamanoo wa `amilus saalihaati; falahum ajrun ghairu mamnoon",
            "verse 95:7": "Fama yu kaz zibuka b`adu bid deen",
            "verse 95:8": "Alai sal laahu bi-ahkamil haakimeen"
        },
        "Russian": {
            "verse 95:1": "Клянусь смоковницей (горы Иерусалимской), Маслинным деревом (Дамасского холма),",
            "verse 95:2": "Клянусь (святой) горой Синай",
            "verse 95:3": "И этим городом, Что (так великолепно) безопасен, -",
            "verse 95:4": "Мы сотворили человека в прекраснейшей из форм,",
            "verse 95:5": "Затем повергли Мы его в ничтожнейшее состоянье, -",
            "verse 95:6": "Помимо тех, которые уверовали (в Бога) И праведные действия вершат: Их ждет неисчислимая награда без попрека.",
            "verse 95:7": "Кто ж после этого способен возразить тебе О неизбежности Последнего Суда?",
            "verse 95:8": "Ужель Аллах - не лучший из судей?!"
        },
        "Sindhi": {
            "verse 95:1": "انجير ۽ زيتون جو قسم آھي.",
            "verse 95:2": "۽ طُور سينا جو.",
            "verse 95:3": "۽ ھِن اَمن واري شھر (مڪي) جو.",
            "verse 95:4": "ته بيشڪ ماڻھوءَ کي تمام سھڻي نموني پيدا ڪيوسون.",
            "verse 95:5": "وري سڀني ھيٺاھين کان ھيٺ موٽايوسونس.",
            "verse 95:6": "پر جن ايمان آندو ۽ چڱا ڪم ڪيا تن لاءِ اَڻ کُٽ اجر آھي.",
            "verse 95:7": "پوءِ (اي ماڻھو) ھن (نصيحت) پڄاڻا ڪھڙي شيءِ توکي عملن جي بدلي ملڻ بابت منڪر بڻائي ٿي؟",
            "verse 95:8": "حاڪمن جو وڏو حاڪم الله نه آھي ڇا؟"
        },
        "Sinhalese": {
            "verse 95:1": "අත්තික්කා හා ඔලිව් මත දිවුරමින්,",
            "verse 95:2": "සිනායි කන්ද මත ද දිවුරමින්,",
            "verse 95:3": "අභයදායී මෙම නගරය මත ද දිවුරමින්,",
            "verse 95:4": "සැබැවින්ම අපි මිනිසා ව ඉතා අලංකාර හැඩයකින් මැව්වෙමු.",
            "verse 95:5": "පසු ව පහත්වූවන්ගෙන් වඩා පහත් වු අයෙකු බවට අපි පත් කළෙමු.",
            "verse 95:6": "විශ්වාස කොට යහකම් කළවුන් හැර, ඔවුනට අවසන් නොවන ප්‍රතිඵල ඇත.",
            "verse 95:7": "ඉන් පසු ව විනිශ්චය බොරු යැයි නුඹට පැවසුවේ කුමක් ද?",
            "verse 95:8": "විනිශ්චකරුවන්ගෙන් මහා විනිශ්චයකරු අල්ලාහ් නොවේද?"
        },
        "Somali": {
            "verse 95:1": "Eebe wuxuu ka dhaartay Tiinka iyo Zeytuunka.",
            "verse 95:2": "Iyo Dhuuri Siina.",
            "verse 95:3": "Iyo Magaaladan Aaminka ah (Maka).",
            "verse 95:4": "Ee waxaana ku abuurray Dadka Muuqal toosan.",
            "verse 95:5": "Kaddibna waxaan u celinaynaa hoos (gabow dartiis).",
            "verse 95:6": "Hase yeeshee kuwa rumeeyey xaqa camalwanaagsanna falay, waxay mudan Ajri aan go'aynin.",
            "verse 95:7": "Ee Maxaa Gaalada u sababay beeninta Qiyaamada intaas ka dib.",
            "verse 95:8": "Miyuusan Eebe ahayn kan ugu xukun wanaagsan. (Eebaa xukun wanagsan)."
        },
        "Spanish": {
            "verse 95:1": "Por el fruto de la higuera y del olivo!",
            "verse 95:2": "Por el monte Sinin!",
            "verse 95:3": "Por esta tierra segura!",
            "verse 95:4": "Que en verdad creamos al hombre en la mejor armonía,",
            "verse 95:5": "y luego lo convertimos en uno de los más bajos.",
            "verse 95:6": "Excepto los que creen y llevan a cabo las acciones de bien, porque ellos tendrán una recompensa que no cesa.",
            "verse 95:7": "Y cómo podrás, después de ésto, negar la Rendición de Cuentas?",
            "verse 95:8": "Acaso no es Allah el más justo de los jueces?"
        },
        "Swahili": {
            "verse 95:1": "Naapa kwa tini na zaituni!",
            "verse 95:2": "Na kwa Mlima wa Sinai!",
            "verse 95:3": "Na kwa mji huu wenye amani!",
            "verse 95:4": "Bila ya shaka tumemuumba mtu kwa umbo lilio bora kabisa.",
            "verse 95:5": "Kisha tukamrudisha kuwa chini kuliko walio chini!",
            "verse 95:6": "Lakini wale walio amini na wakatenda mema, hao watapata ujira usio kwisha.",
            "verse 95:7": "Basi ni kipi baadaye kitacho kukukadhibishia malipo?",
            "verse 95:8": "Kwani Mwenyezi Mungu si muadilifu kuliko mahakimu wote?"
        },
        "Swedish": {
            "verse 95:1": "VID FIKONTRÄDET och oliven",
            "verse 95:2": "och Sinai berg",
            "verse 95:3": "och detta trygga land!",
            "verse 95:4": "Vi har sannerligen skapat människan i den bästa skepnad",
            "verse 95:5": "men därefter låtit henne sjunka lägre än de lägsta,",
            "verse 95:6": "utom dem som tror och lever ett rättskaffens liv; ja, deras lön skall vara utan ände!",
            "verse 95:7": "Vad kan hädanefter förmå dig [människa] att påstå att förkunnelsen [om uppståndelse, räkenskap och dom] är lögn?",
            "verse 95:8": "Är inte Gud den visaste av domare?"
        },
        "Tajik": {
            "verse 95:1": "Савганд ба анҷиру зайтун",
            "verse 95:2": "савганд ба Тури муборак,",
            "verse 95:3": "савганд ба ин шаҳри эмин,",
            "verse 95:4": "ки мо одамиро дар некӯтарин сурате биёфаридем.",
            "verse 95:5": "Он гоҳ ӯро фурӯтар аз ҳамаи фурӯтарон гардонидем, (пасттар аз ҳамаи пастҳо)",
            "verse 95:6": "ғайри онон, ки имон овардаанд ва корҳои шоиста кардаанд, ки музде бепоён доранд.",
            "verse 95:7": "Пас чист, ки бо ин ҳол туро ба дурӯғ шуморидани қиёмат вомедорад?",
            "verse 95:8": "Оё Худо довартарини доварон нест?"
        },
        "Tamil": {
            "verse 95:1": "அத்தியின் மீதும், ஒலிவத்தின் (ஜைத்தூன்) மீதும் சத்தியமாக-",
            "verse 95:2": "'ஸினாய்' மலையின் மீதும் சத்தியமாக-",
            "verse 95:3": "மேலும் அபயமளிக்கும் இந்த (மக்கமா) நகரத்தின் மீதும் சத்தியமாக-",
            "verse 95:4": "திடமாக, நாம் மனிதனை மிகவும் அழகிய அமைப்பில் படைத்தோம்.",
            "verse 95:5": "பின்னர் (அவன் செயல்களின் காரணமாக) அவனைத் தாழ்ந்தவர்களில், மிக்க தாழ்ந்தவனாக்கினோம்.",
            "verse 95:6": "எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்கிறார்களோ அவர்களைத் தவிர - (நல்லவர்களான) அவர்களுக்கு என்றும் முடிவில்லாத நற்கூலியுண்டு.",
            "verse 95:7": "எனவே (இதற்குப்) பின்னர், நியாயத் தீர்ப்பு நாளைப்பற்றி உம்மிடம் எது பொய்யாக்க முடியும்?",
            "verse 95:8": "அல்லாஹ் தீர்ப்புச் செய்வோரில் எல்லாம் மிக மேலாகத் தீர்ப்புச் செய்பவனில்லையா?"
        },
        "Tatar": {
            "verse 95:1": "Инҗир җимеше илә ант итәм вә зәйтүн агачы белән.",
            "verse 95:2": "Вә мүбарәк Тур тавы белән ант итәм.",
            "verse 95:3": "Вә ошбу иминлек шәһәре Мәккә белән ант итәм.",
            "verse 95:4": "Тәхкыйк, Без адәм баласын күркәмрәк сурәттә халык кылдык. (халык кылу – бар итү мәгънәсендә)",
            "verse 95:5": "Соңра ул итагатьсез кире кешене, ахирәттә түбәннәрнең түбәненә кайтардык, ягъни җәһәннәмгә. (Түбәннәрнең түбәненә кайтарылачак кешеләрне белергә һәм алар җөмләсеннән булудан сакланырга кирәк! Алар кәферләр, мөшрикләр, хаксыз золым итүче залимнәр, бозык вә пычрак эшне эшләүче фасыйклар, рыячылар, сихерчеләр, багучылар, бидеґәтчеләр, мал җыючы бик саран байлар, ышанып та дин тотмаучылар, тәкәбберләр, хәмер эчүчеләр, зина кылучылар, хаксыз кеше үтерүчеләр, гомумән Коръән белән гамәл кылмаучылар: куәтле вакытларында тәүбә итеп, Коръән белән гамәл кылып төзәлмәсәләр – һәммәсе болар җәһәннәмгә керәчәкләр.)",
            "verse 95:6": "Мәгәр иман китереп Аллаһуга вә расүлгә итагать иткән, гөнаһлардан сакланып изге гамәлләр кылган кешеләрне генә түбәннәрнең түбәненә төшермибез, аларга һич киселми, кимеми торган мәңгегә җәннәт нигъмәтләредер.",
            "verse 95:7": "Ий имансыз кире кеше, Коръәннең ачык вә көчле дәлилләре соңында сине нәрсә мәҗбүр итә ахирәттә булачак хисап вә ґәзаб көнен инкяр итәргә?",
            "verse 95:8": "Әйә Аллаһ хөкем итүчеләрнең гадел хөкем итүчерәге түгелме? Барча кешене гаделлек белән хөкем итмәсме?"
        },
        "Telugu": {
            "verse 95:1": "అంజూరం (అత్తిపండు) మరియు జైతూన్ సాక్షిగా",
            "verse 95:2": "సీనాయ్ (తూర్) కొండ సాక్షిగా",
            "verse 95:3": "ఈ శాంతి నగరం (మక్కా) సాక్షిగా",
            "verse 95:4": "వాస్తవంగా! మేము మానవుడిని సర్వశ్రేష్ఠమైన ఆకారంలో సృష్టించాము",
            "verse 95:5": "తరువాత మేము అతన్ని దిగజార్చి అధమాతి - అధమమైన స్థితికి మార్చాము",
            "verse 95:6": "కాని విశ్వసించి, సత్కార్యాలు చేసేవారు తప్ప! ఎందుకంటే అలాంటి వారికి అంతులేని ప్రతిఫలం ఉంది",
            "verse 95:7": "అయితే (ఓ మానవుడా!) దీని తరువాత కూడా నీవు ఎందుకు ప్రతిఫలదినాన్ని తిరస్కరిస్తున్నావు",
            "verse 95:8": "ఏమీ? అల్లాహ్ న్యాయాధిపతులలోకెల్లా సర్వోత్తమ న్యాయాధిపతి కాడా"
        },
        "Thai": {
            "verse 95:1": "ขอสาบานด้วยต้นมะเดื่อและต้นมะกอก",
            "verse 95:2": "และด้วยภูเขาฎูรซีนาย",
            "verse 95:3": "และด้วยเมืองนี้ที่ปลอดภัย",
            "verse 95:4": "โดยแน่นอนเราได้บังเกิดมนุษย์มาในรูปแบบที่สวยงามยิ่ง",
            "verse 95:5": "แล้วเราได้ให้เขากลับสู่สภาพที่ตกต่ำยิ่ง",
            "verse 95:6": "นอกจากบรรดาผู้ศรัทธาและประกอบสิ่งดีงามทั้งหลาย โดยที่สำหรับพวกเขาจะได้รับรางวัลอย่างไม่มีที่สิ้นสุด",
            "verse 95:7": "ดังนั้น อะไรเล่าเขาจึงปฏิเสธเจ้า หลังจากนี้เกี่ยวกับการตอบแทน",
            "verse 95:8": "มิใช่อัลลอฮฺดอกหรือ เป็นผู้ตัดสินที่ดีเยี่ยมในหมู่ผู้ตัดสินทั้งหลาย"
        },
        "Turkish": {
            "verse 95:1": "İncir ve zeytine and olsun,",
            "verse 95:2": "And olsun Sina dağına,",
            "verse 95:3": "And olsun bu güvenli Mekke şehrine ki:",
            "verse 95:4": "Biz insanı en güzel şekilde yarattık,",
            "verse 95:5": "Sonra onu aşağıların en aşağısı kıldık.",
            "verse 95:6": "Yalnız, inanıp yararlı iş işleyenler bunun dışındadır. Onlara kesintisiz ecir vardır.",
            "verse 95:7": "Öyleyken, sana dini yalan saydırtan nedir?",
            "verse 95:8": "Allah, hükmedenlerin en iyi hükmedeni değil midir?"
        },
        "Urdu": {
            "verse 95:1": "انجیر کی قسم اور زیتون کی",
            "verse 95:2": "اور طور سینین کی",
            "verse 95:3": "اور اس امن والے شہر کی",
            "verse 95:4": "کہ ہم نے انسان کو بہت اچھی صورت میں پیدا کیا ہے",
            "verse 95:5": "پھر (رفتہ رفتہ) اس (کی حالت) کو (بدل کر) پست سے پست کر دیا",
            "verse 95:6": "مگر جو لوگ ایمان لائے اور نیک عمل کرتے رہے انکے لیے بےانتہا اجر ہے",
            "verse 95:7": "تو (اے آدم زاد) پھر تو جزا کے دن کو کیوں جھٹلاتا ہے؟",
            "verse 95:8": "کیا خدا سب سے بڑا حاکم نہیں ہے؟"
        },
        "Uyghur": {
            "verse 95:1": "ئەنجۈر بىلەن ۋە زەيتۇن بىلەن قەسەمكى،",
            "verse 95:2": "سىنا تېغى بىلەن قەسەمكى،",
            "verse 95:3": "بۇ تىنچ شەھەر (يەنى مەككە مۇكەررەمە) بىلەن قەسەمكى،",
            "verse 95:4": "بىز ئىنساننى شەك - شۈبھىسىز ئەڭ چىرايلىق شەكىلدە ياراتتۇق",
            "verse 95:5": "ئاندىن ئۇنى (چىرايلىق ياراتقانلىق نېمىتىمىزگە شۈكۈر قىلماي ئاسىيلىق قىلغانلىقتىن) دوزاخقا قايتۇردۇق",
            "verse 95:6": "پەقەت ئىمان ئېيتقان، ياخشى ئەمەللەرنى قىلغانلار بۇنىڭدىن مۇستەسنا. بۇلارغا ئۈزۈلمەس ساۋاب بېرىلىدۇ",
            "verse 95:7": "(ئى ئىنسان!) بۇنىڭدىن كېيىن (يەنى روشەن دەلىللەر بايان قىلىنغاندىن كېيىن) يەنە نېمىشقا قىيامەتنى ئىنكار قىلىسەن؟",
            "verse 95:8": "اﷲ ئەڭ ئادىل ھۆكۈم قىلغۇچى ئەمەسمۇ؟"
        },
        "Uzbek": {
            "verse 95:1": "Анжир билан қасам ва зайтун билан қасам.",
            "verse 95:2": "Ва Тури Сийно билан қасам.",
            "verse 95:3": "Ва мана бу, эминлик юрти (Макка) билан қасам.",
            "verse 95:4": "Батаҳқиқ, Биз инсонни энг яхши суратда яратдик.",
            "verse 95:5": "Сўнгра уни асфала сафилинга қайтардик.",
            "verse 95:6": "Магар иймон келтирганлар ва яхши амаллар қилганларга миннатсиз ва узлуксиз ажрлар бордир.",
            "verse 95:7": "Бас, сени нима охиратни ёлғонга чиқаришга олиб келади (эй кофир)?",
            "verse 95:8": "Аллоҳ ҳукм қилгувчиларнинг энг ҳикматлиси эмасми?!"
        },
        "Vietnamese": {
            "verse 95:1": "Thề bởi cây Sung và cây Ô-liu.",
            "verse 95:2": "Thề bởi ngọn núi Sinai.",
            "verse 95:3": "Thề bởi thành phố an bình này (Makkah).",
            "verse 95:4": "Quả thật, TA (Allah) đã tạo ra con người với một hình thể tốt đẹp nhất.",
            "verse 95:5": "Sau đó, TA sẽ đưa y xuống nơi thấp nhất của mức thấp nhất (vì tội lỗi).",
            "verse 95:6": "Ngoại trừ những người có đức tin và hành thiện, họ sẽ được phần thưởng vô tận.",
            "verse 95:7": "Vậy điều gì khiến ngươi (hỡi con người) phủ nhận việc phán xét và thưởng phạt sau khi (ngươi chứng kiến nhiều dấu hiệu về quyền năng của Allah)?",
            "verse 95:8": "Không phải Allah là Đấng phân định công bằng nhất đó sao?"
        },
        "Yoruba": {
            "verse 95:1": "Allahu bura pelu eso tin ati eso zaetun",
            "verse 95:2": "O tun bura pelu apata Sinin",
            "verse 95:3": "O tun bura pelu ilu ifayabale yii",
            "verse 95:4": "Dajudaju A seda eniyan pelu irisi t’o dara julo",
            "verse 95:5": "Leyin naa, A maa da a pada si isale patapata (ninu Ina)",
            "verse 95:6": "Ayafi awon t’o gbagbo ni ododo, ti won si se awon ise rere. Nitori naa, esan ti ko nii pin (ti ko nii pedin) n be fun won",
            "verse 95:7": "Ta l’o tun n pe o ni opuro nipa Ojo esan leyin (oro yii)",
            "verse 95:8": "Se Allahu ko ni Eni t’O mo ejo da julo ninu awon adajo ni"
        }
    }
}