{
    "id": 96,
    "name_simple": "Al-'Alaq",
    "revelation_place": "makkah",
    "revelation_order": 1,
    "bismillah_pre": true,
    "verses_count": 19,
    "short_text": "The Surah is titled so, after the word 'alaq in the second verse.",
    "text": [
        "The Surah is titled so, after the word 'alaq in the second verse of this Surah.",
        "Period of Revelation",
        "This Surah has two parts: the first part consists of 1-5, and the second of 6-19. ",
        "About the first part: a great majority of the Islamic scholars are agreed that it forms the very first Revelation to be sent down to the Holy Prophet (upon whom be Allah's peace and blessings). In this regard, the Hadith from Hadrat Aishah, which Imam Ahmad, Bukhari, Muslim, and other traditionists have related with several chains of authorities, is one of the most authentic Ahadith on the subject. In it, Hadrat Aishah has narrated the full story of the beginning of revelation as she herself heard it from the Holy Messenger of Allah. Ibn Abbas, Abu Musa al-Ashari and a group of the Companions are also reported to have stated that these were the very first verses of the Quran to be revealed to the Holy Prophet. The second part was sent down afterwards when the Holy Prophet (upon whom be peace) began to perform the prescribed Prayer in the precincts of the Kabah and Abu Jahl tried to prevent him from this with threats.",
        "Beginning of Revelation",
        "The traditionists have related on the strength of their respective authorities the story of the beginning of revelation from Imam Az-Zuhri, who had it from Hadrat Urwah bin Zubair, who had it from Hadrat Aishah, his aunt. She states that revelations to the Holy Prophet (upon whom be peace) began in the form of true (according to other traditions, good) visions. Whichever vision he saw, it seemed as though he saw it in broad daylight. Afterwards solitude became dear to him and he would go to the Cave of Hira to engage in worship there for several days and nights (Hadrat Aishah has used the word tahannuth, which Imam Zuhri has explained as ta'abbud : devotional exercises. This was some kind of worship which he performed, for until then he had not been taught the method of performing the Prayer by Allah). He would take provisions with him and stay there for several days, then would return to Hadrat Khadijah who would again provide for him for a few more days. One day when he was in the Cave of Hira, Revelation came down to him unexpectedly and the Angel said, to him: \"Read\".",
        "After this Hadrat Aishah reports the words of the Holy Prophet himself, to the effect, \"I said: 'I cannot read!' Thereupon the Angel took me and pressed me until I could bear it no more. Then he left me and said: 'Read.' I said: 'I cannot read!' He pressed me a second time until I could bear it no more. Then he left me and said: 'Read.' I again said: 'I cannot read!' He pressed me for the third time until I could bear it no more. Then he left me and said: 'Iqra bismi Rabbi kal- ladhi khalaqa': (Read in the name of your Lord Who created) till he reached 'ma lam ya lam' (what he did not know).\"",
        "Then the Holy Messenger (upon whom be peace) returned home to Hadrat Khadijah trembling with fear, and said to her: \"Cover me, cover me\", and he was covered. When terror left him, he said: \"O Khadijah, what has happened to me?\" Then he narrated to her whatever had happened, and said: \"I fear for my life.\" She said: \"No never! Be of good cheer. By God, never will God debase you: you treat the kindred well, you speak the truth, (one tradition adds: you restore what is entrusted to you), you bear the burden of the helpless, you help the poor, you entertain the guests, and you cooperate in good works.\"",
        "Then she took him to Waraqah bin Naufal, who was her cousin. He had become a Christian in pre-Islamic days, wrote the Gospel in Arabic and Hebrew, and had become very old and blind. Hadrat Khadijah said: \"Brother, listen to the son of your brother.\" Waraqah said to the Holy Prophet: \"What have you seen, nephew?\" The Holy Prophet described what he had seen. Waraqah said: \"This is the same Gabriel (the Angel of Revelation) which Allah had sent down to Moses. Would that I were a young man during your Prophethood! Would that I were alive when your tribe would expel you!\" The Holy Prophet said: \"Will they expel me?\" Waraqah said: \"Yes, never has it so happened that a person brought what you have brought and was not treated as an enemy. If I live till then I would help you with all the power at my command.\" But not very long after this Waraqah died.",
        "This narrative is explicit that even until a moment before the arrival of the Angel, the Holy Messenger of Allah (upon whom be peace) was without any expectation that he was going to be appointed as a Prophet. Let alone this being a wish or expectation, he did not even have any idea that he would meet with such an experience. The sending down of the Revelation and appearance of the Angel face to face was an unexpected incident for him- the first effects of which on him were precisely the same as would naturally be on a person experiencing such a tremendous event, in the absence of any preparation. That is why when he proclaimed the message of Islam, the people of Makkah raised all sorts of objections, but no one said that they were already apprehending that he would make a claim, for he had been making preparations for a long time to become a Prophet.",
        "From this narrative another matter which also becomes obvious is how pure the Holy Prophet's life was, and how sublime his character was before Prophethood. Hadrat Khadijah was no young lady: she was 55 years old at the time this event took place and had been the Holy Prophet's life companion for 15 years. No weakness of the husband can remain hidden from the wife. She had during this long period of married life found him to be such a generous and noble man that when he told her of his experience in the Cave of Hira', she admitted without the least hesitation that it was indeed Allah's own Angel who had come to him with Revelation. Likewise, Waraqah bin Naufal was an old inhabitant of Makkah, who had seen the Holy Prophet grow up from childhood. Particularly, for the past 15 years because of the close relationship he was even more intimately aware of his life, his affairs and dealings. When he also heard of his experience, he did not regard it as an evil suggestion, but immediately said that it was the same Gabriel who had descended on Moses (upon whom be peace). This meant that even according to Waraqah, the Holy Prophet was such a sublime person that there was nothing surprising in his being elevated to the position of Prophethood.",
        "Occasion of Revelation of verses 6-19",
        "This second part of the Surah was revealed when the Holy Messenger of Allah began to perform the Prayer in the Islamic way in the Ka'bah and Abu Jahl threatened and tried to prevent him from this. It so happened that after his appointment to Prophethood and even before he could start preaching Islam openly, he began to perform the Prayer in the precincts of the Ka'bah in the way Allah taught him; from this, the Quraish felt for the first time that he had adopted a new religion. The other people were watching on with curiosity, but Abu Jahl in his arrogance and pride threatened the Holy Prophet and forbade him to worship in that way in the Ka'bah. A number of the Ahadith have been related from Hadarat Abdullah ibn Abbas and Hadrat Abu Huraira, which mention the foolish behaviour of Abu Jahl.",
        "Hadrat Abu Huraira says that Abu Jahl asked the people of Quraish: \"Does Muhammad (upon whom be Allah's peace and blessings) set his face on the ground before you?\" When they replied in the affirmative, he said: \"By Lat and Uzza, if I ever catch him in that act of worship, I would set my foot on his neck and rub his face in the dust.\"",
        "Then it so happened that he saw the Holy Messenger in that posture and came forward to set his foot on his neck, but suddenly turned back as if in a fright. When asked what the matter was, he said there was a ditch of fire and a terrible apparition between himself and Muhammad (upon whom be Allah's peace and blessings) and some wings. On hearing this the Holy Prophet remarked: \"Had he come near me, the angels would have smitten and torn him to pieces.\" (Ahmad, Muslim, Nasai, Ibn Jarir, Ibn AbI Hatim, Ibn al-Mundhir, lbn Marduyah, Abu Nu'aim Isfahani, Baihaqi).",
        "According to lbn Abbas, Abu Jahl said: \"If I caught Muhammad (upon whom be Allah's peace and blessings) performing his Prayer by the Ka'bah, I would trample his neck down.\" When the Holy Prophet heard of it, he said: \"If he acted so, the angels would seize him there and then.\" (Bukhari, Tirmidhi, Nasai, Ibn Jarir, Abdur Razzaq, Abd bin Humaid, Ibn al- Mundhir, Ibn Marduyah).",
        "According to another tradition from Ibn Abbas, the Holy Prophet was performing his Prayer at the Maqam Ibrahim. Abu Jahl passed that way and said: \"O Muhammad, did I not forbid you this?\" and then he started to threaten him. In reply, the Holy Prophet (upon whom be peace) rebuked him severely. Thereupon Abu Jahl said: \"O Muhammad, on what strength do you rebuke me? By God, my followers in this valley far exceed yours in number.\" (Ahmad, Tirmidhi, Nasai, Ibn Jarir, lbn Abi Shaibah, Ibn al-Mundhir, Tabarani, Ibn Marduyah).",
        "Because of these very incidents the portion of this Surah beginning with Kalla inn al-insana la yat gha was sent down. Naturally the position of this part should be the same as assigned to it in this Surah of the Quran, for after the coming down of the first Revelation, the Holy Prophet (upon whom be peace) had expressed Islam first of all by the act of Prayer, and his conflict with the pagans."
    ],
    "quran-source": "`https://surahquran.com`",
    "description": "The surah that contains the first revealed verses of the Quran, reminding the human being of The Clinging Mass, a stage that reflects the miracle of human creation in the womb of the mother. The surah is also known by the first Quranic instruction: Read. It is named after “the clining mass” (ʿalaq) mentioned in verse 2. The first five verses are known to be the first revelation of the Quran when the Prophet Muhammad was instructed to read. The second part came later to show that man transgresses when he becomes self-satisfied.The surah is also known as: Clots of Blood, Proclaim, Read, Recite, The Blood-clot, The Clinging Clot, The Clinging Form, The Clot, The Embryo.",
    "name_translation": "The Clinging Mass",
    "name_complex": "Al-‘Alaq",
    "surah_name_ar": "العلق",
    "verses": {
        "Albanian": {
            "verse 96:1": "Lexo në emër të Zotit tënd, i cili ka krijuar (të gjitha),",
            "verse 96:2": "i cili e krijoi njeriun nga gjaku i droçkuar (embrioni),",
            "verse 96:3": "lexo, se Zoti yt, është më bujari,",
            "verse 96:4": "që ia mësoi njeriut pendën (të shkruajë),",
            "verse 96:5": "që njeriut ia mësoi atë që nuk e diti.",
            "verse 96:6": "Jo, jo! (megjithatë), me të vërtetë, njeriu ka kalur kufirin (në të keqe),",
            "verse 96:7": "posa e ka ndier veten të pasur (se nuk i nevojitet askush),",
            "verse 96:8": "e, me të vërtetë, kthimi është te Zoti yt!",
            "verse 96:9": "A e ke parë ti atë që pengon",
            "verse 96:10": "njeriun (adhuruesin) kur falet (bënë namaz)?",
            "verse 96:11": "Më thuaj ti (o Muhammed!), nëse ai mendon se është në rrugën e drejtë,",
            "verse 96:12": "apo rekomandon që të adhurohen idhujt,",
            "verse 96:13": "e, çka mendon ti nëse ai i përgënjeshtron (argumentet Tona) dhe kthehet?",
            "verse 96:14": "A nuk e di ai – se Zoti i sheh të gjitha (e dhuron të mirin, ndërsa e dënon të keqin)?",
            "verse 96:15": "Jo, jo! Me të vërtetë, nëse nuk tërhiqet nga kjo, do ta kapim për flokësh (gërshetën),",
            "verse 96:16": "për flokët (gërshetin) e gënjeshtarit dhe fajtorit,",
            "verse 96:17": "e, ai le ta thërras shoqërinë e vet (në ndihmë).",
            "verse 96:18": "Na do t’i thërrasim Zebanijt (rojet e Skëterrës).",
            "verse 96:19": "Jo, jo! Mos iu përul ti atij; por bënë ti sexhde dhe afroju (Zotit tënd)!"
        },
        "Amharic": {
            "verse 96:1": "አንብብ በዚያ (ሁሉን) በፈጠረው ጌታህ ስም፡፡",
            "verse 96:2": "ሰውን ከረጋ ደም በፈጠረው (ጌታህ ስም)፡፡",
            "verse 96:3": "አንብብ፤ ጌታህ በጣም ቸር ሲኾን፤",
            "verse 96:4": "ያ በብርዕ ያስተማረ፡፡",
            "verse 96:5": "ሰውን ያላወቀውን ሁሉ ያሳወቀ ሲኾን፡፡",
            "verse 96:6": "በእውነቱ ሰው ወሰንን ያልፋል፡፡",
            "verse 96:7": "ራሱን የተብቃቃ (ባለ ሀብት) ኾኖ ለማየቱ፡፡",
            "verse 96:8": "መመለሻው ወደ ጌታህ ብቻ ነው፡፡",
            "verse 96:9": "አየህን? ያንን የሚከለክለውን፡፡",
            "verse 96:10": "ባሪያን በሰገደ ጊዜ፤",
            "verse 96:11": "አየህን? ንገረኝ (ተከልካዩ) በትክክለኛ መንገድ ላይ ቢኾን፤",
            "verse 96:12": "ወይም (ፈጣሪውን) በመፍራት ቢያዝ፤",
            "verse 96:13": "አየህን? ንገረኝ (ከልካዩ) ቢያስተባብልና (ከእምነት) ቢሸሽ፤",
            "verse 96:14": "አላህ የሚያይ መኾኑን አያውቅምን?",
            "verse 96:15": "ይተው ባይከለከል አናቱን ይዘን እንጎትተዋለን፡፡",
            "verse 96:16": "ውሸታም ስሕተተኛ የኾነችውን አናቱን፡፡",
            "verse 96:17": "ሸንጎውንም ይጥራ፡፡",
            "verse 96:18": "(እኛም) ዘበኞቻችንን እንጠራለን፡፡",
            "verse 96:19": "ይከልከል አትታዘዘው፡፡ ስገድም፤ (ወደ አላህ) ተቃረብም፡፡"
        },
        "Arabic": {
            "verse 96:1": "َقَلَخ يِذَّلا َكِّبَر ِمْساِب ْأَرْقا",
            "verse 96:2": "ٍقَلَع ْنِم َناَسنِإْلا َقَلَخ",
            "verse 96:3": "ُمَرْكَأْلا َكُّبَرَو ْأَرْقا",
            "verse 96:4": "ِمَلَقْلاِب َمَّلَع يِذَّلا",
            "verse 96:5": "ْمَلْعَي ْمَل اَم َناَسنِإْلا َمَّلَع",
            "verse 96:6": "ٰىَغْطَيَل َناَسنِإْلا َّنِإ اَّلَك",
            "verse 96:7": "ٰىَنْغَتْسا ُهآَّر نَأ",
            "verse 96:8": "ٰىَعْجُّرلا َكِّبَر ٰىَلِإ َّنِإ",
            "verse 96:9": "ٰىَهْنَي يِذَّلا َتْيَأَرَأ",
            "verse 96:10": "(ٰىَّلَص اَذِإ اًدْبَع",
            "verse 96:11": "(ٰىَدُهْلا ىَلَع َناَك نِإ َتْيَأَرَأ",
            "verse 96:12": "(ٰىَوْقَّتلاِب َرَمَأ ْوَأ",
            "verse 96:13": "(ٰىَّلَوَتَو َبَّذَك نِإ َتْيَأَرَأ",
            "verse 96:14": "(ٰىَرَي َهَّللا َّنَأِب مَلْعَي ْمَلَأ",
            "verse 96:15": "(ِةَيِصاَّنلاِب اًعَفْسَنَل ِهَتنَي ْمَّل نِئَل اَّلَك",
            "verse 96:16": "(ٍةَئِطاَخ ٍةَبِذاَك ٍةَيِصاَن",
            "verse 96:17": "(ُهَيِداَن ُعْدَيْلَف",
            "verse 96:18": "(َةَيِناَبَّزلا ُعْدَنَس",
            "verse 96:19": "(۩ بِرَتْقاَو ْدُجْساَو ُهْعِطُت اَل اَّلَك"
        },
        "Azerbaijani": {
            "verse 96:1": "Yaradan Rəbbinin adı ilə oxu!",
            "verse 96:2": "O, insanı qan laxtasından yaratdı.",
            "verse 96:3": "Oxu! Sənin Rəbbin müqayisəsiz səxavətə malikdir.",
            "verse 96:4": "O, qələmlə yazmağı öyrətdi.",
            "verse 96:5": "İnsana bilmədiklərini öyrətdi.",
            "verse 96:6": "Xeyr! İnsan, doğrudan da, həddini aşır –",
            "verse 96:7": "özünün ehtiyacsız olduğunu zənn etdiyinə görə.",
            "verse 96:8": "Axı son dönüşün Rəbbinədir!",
            "verse 96:9": "Gördünmü o kəsi ki, mane olur –",
            "verse 96:10": "bir bəndəyə namaz qıldığı zaman?",
            "verse 96:11": "Söylə görək, əgər o bəndə doğru yoldadırsa,",
            "verse 96:12": "yaxud Allahdan qorxmağı əmr edirsə, onda necə olsun?",
            "verse 96:13": "Söylə görək, əgər o kafir haqqı yalan sayıb üz döndəribsə, onda necə olsun?",
            "verse 96:14": "Məgər o bilmir ki, Allah görür?",
            "verse 96:15": "Xeyr! Əgər yaramaz əməlinə son qoymasa, Biz onun kəkilindən tutacağıq –",
            "verse 96:16": "yalançı, günahkar kəkilindən.",
            "verse 96:17": "Qoy öz yığnağını çağırsın.",
            "verse 96:18": "Biz də əzab mələklərini çağıracağıq.",
            "verse 96:19": "Xeyr, sən ona qulaq asma! Səcdə qıl və Allaha yaxınlaş!"
        },
        "Bengali": {
            "verse 96:1": "পাঠ করুন আপনার পালনকর্তার নামে যিনি সৃষ্টি করেছেন",
            "verse 96:2": "সৃষ্টি করেছেন মানুষকে জমাট রক্ত থেকে।",
            "verse 96:3": "পাঠ করুন, আপনার পালনকর্তা মহা দয়ালু,",
            "verse 96:4": "যিনি কলমের সাহায্যে শিক্ষা দিয়েছেন,",
            "verse 96:5": "শিক্ষা দিয়েছেন মানুষকে যা সে জানত না।",
            "verse 96:6": "সত্যি সত্যি মানুষ সীমালংঘন করে,",
            "verse 96:7": "এ কারণে যে, সে নিজেকে অভাবমুক্ত মনে করে।",
            "verse 96:8": "নিশ্চয় আপনার পালনকর্তার দিকেই প্রত্যাবর্তন হবে।",
            "verse 96:9": "আপনি কি তাকে দেখেছেন, যে নিষেধ করে",
            "verse 96:10": "এক বান্দাকে যখন সে নামায পড়ে?",
            "verse 96:11": "আপনি কি দেখেছেন যদি সে সৎপথে থাকে।",
            "verse 96:12": "অথবা খোদাভীতি শিক্ষা দেয়।",
            "verse 96:13": "আপনি কি দেখেছেন, যদি সে মিথ্যারোপ করে ও মুখ ফিরিয়ে নেয়।",
            "verse 96:14": "সে কি জানে না যে, আল্লাহ দেখেন?",
            "verse 96:15": "কখনই নয়, যদি সে বিরত না হয়, তবে আমি মস্তকের সামনের কেশগুচ্ছ ধরে হেঁচড়াবই-",
            "verse 96:16": "মিথ্যাচারী, পাপীর কেশগুচ্ছ।",
            "verse 96:17": "অতএব, সে তার সভাসদদেরকে আহবান করুক।",
            "verse 96:18": "আমিও আহবান করব জাহান্নামের প্রহরীদেরকে",
            "verse 96:19": "কখনই নয়, আপনি তার আনুগত্য করবেন না। আপনি সেজদা করুন ও আমার নৈকট্য অর্জন করুন।"
        },
        "Berber Amazigh": {
            "verse 96:1": "£eô, s yisem n Mass ik Ixelqen.",
            "verse 96:2": "Ixleq amdan seg urgen.",
            "verse 96:3": "£eô! Mass ik, Imxeyyeô n wukyisen,",
            "verse 96:4": "i Islemden s umru.",
            "verse 96:5": "Isselmed i umdan, ayen ur issin.",
            "verse 96:6": "Xaîi! War ccekk, ijuô umdan,",
            "verse 96:7": "mi iwala isâa.",
            "verse 96:8": "Ih, ar Mass ik, tu$alin.",
            "verse 96:9": "Twalav win ikksen",
            "verse 96:10": "taéallit i uxdim?",
            "verse 96:11": "Twalav ma illa di nnhaya?",
            "verse 96:12": "Ne$ ma iumeô $eô uêezzeb?",
            "verse 96:13": "Twalav ma iskaddeb, ma iwexxeô?",
            "verse 96:14": "Day ur iéôi ara, ar Öebbi Ipwali?",
            "verse 96:15": "Xaîi! Ma ur iffuk ara, si tgwenza, war ccekk, ara t Neîîef,",
            "verse 96:16": "tagwenza n ubekkav, tuccva.",
            "verse 96:17": "Anef ad isiwel i im²eddukwal.",
            "verse 96:18": "A Nenced iâssasen.",
            "verse 96:19": "Ur s ssemêas, eknu, qeôôeb."
        },
        "Bosnian": {
            "verse 96:1": "Čitaj, u ime Gospodara tvoga, koji stvara,",
            "verse 96:2": "stvara čovjeka od ugruška!",
            "verse 96:3": "Čitaj, plemenit je Gospodar tvoj,",
            "verse 96:4": "koji poučava peru,",
            "verse 96:5": "koji čovjeka poučava onome što ne zna.",
            "verse 96:6": "Uistinu, čovjek se uzobijesti",
            "verse 96:7": "čim se neovisnim osjeti,",
            "verse 96:8": "a Gospodaru tvome će se, doista, svi vratiti!",
            "verse 96:9": "Vidje li ti onoga koji brani",
            "verse 96:10": "robu da molitvu obavi?",
            "verse 96:11": "Reci mi ako on misli da je na Pravome putu,",
            "verse 96:12": "ili ako traži da se kumirima moli,",
            "verse 96:13": "reci mi, ako on poriče i glavu okreće –",
            "verse 96:14": "zar on ne zna da Allah sve vidi?",
            "verse 96:15": "Ne valja to! Ako se ne okani, dohvatićemo ga za kiku,",
            "verse 96:16": "kiku lažnu i grješnu,",
            "verse 96:17": "pa neka on pozove društvo svoje –",
            "verse 96:18": "Mi ćemo pozvati zebanije.",
            "verse 96:19": "Ne valja to! Ti njega ne slušaj, već molitvu obavljaj i nastoj da se Gospodaru svome približiš!"
        },
        "Bulgarian": {
            "verse 96:1": "Чети [о, Мухаммад] в името на твоя Господ, Който сътвори -",
            "verse 96:2": "сътвори човека от съсирек!",
            "verse 96:3": "Чети! Твоят Господ е Най-щедрия,",
            "verse 96:4": "Онзи, Който научи чрез калема,",
            "verse 96:5": "научи човека на онова, което не е знаел.",
            "verse 96:6": "Ала не! Човек престъпва,",
            "verse 96:7": "защото се е видял богат.",
            "verse 96:8": "Към твоя Господ е завръщането.",
            "verse 96:9": "Видя ли ти онзи, който пречи",
            "verse 96:10": "на раб, когато отслужва молитвата?",
            "verse 96:11": "Видя ли дали той бе на правия път,",
            "verse 96:12": "или повелява богобоязънта?",
            "verse 96:13": "Видя ли дали той отрича и се отмята?",
            "verse 96:14": "Не знае ли той, че Аллах вижда?",
            "verse 96:15": "Ала не! Ако не престане, ще го повлечем за перчема -",
            "verse 96:16": "перчема лъжлив, грешен.",
            "verse 96:17": "И да зове той своето сборище!",
            "verse 96:18": "Ние ще призовем стражата [от ангелите, които пазят Ада].",
            "verse 96:19": "Ала не! Не му се подчинявай! И свеждай чело до земята в суджуд, и [към Аллах] се приближавай!"
        },
        "Chinese": {
            "verse 96:1": "你应当奉你的创造主的名义而宣读，",
            "verse 96:2": "他曾用血块创造人。",
            "verse 96:3": "你应当宣读，你的主是最尊严的，",
            "verse 96:4": "他曾教人用笔写字，",
            "verse 96:5": "他曾教人知道自己所不知道的东西。",
            "verse 96:6": "绝不然，人确是悖逆的，",
            "verse 96:7": "因为他自己是无求的。",
            "verse 96:8": "万物必定只归於你的主。",
            "verse 96:9": "你告诉我吧！",
            "verse 96:10": "那个禁止我的仆人礼拜的人；",
            "verse 96:11": "你告诉我吧！如果他是遵循正道的，",
            "verse 96:12": "或是命人敬畏的；",
            "verse 96:13": "你告诉我吧！如果他是否认真理，背弃真理的，",
            "verse 96:14": "难道他还不知道真主是监察的吗？",
            "verse 96:15": "绝不然，如果他不停止，我一定要抓住他的额发--",
            "verse 96:16": "说谎者，犯罪者的额发。",
            "verse 96:17": "让他去召集他的会众吧！",
            "verse 96:18": "我将召集强悍的天神。",
            "verse 96:19": "绝不然，你不要顺从他，你应当为真主而叩头，你应当亲近真主。※"
        },
        "Danish": {
            "verse 96:1": "Verkondig de naam van uw Heer, de Schepper",
            "verse 96:2": "Die de mens uit geronnen bloed schiep",
            "verse 96:3": "Verkondig, want uw Heer is de meest Eerbiedwaardige",
            "verse 96:4": "Die (de mens) door middel van de pen onderwees",
            "verse 96:5": "Hij leerde aan de mens datgene wat deze niet kende",
            "verse 96:6": "In het geheel niet. Voorwaar, de mens wordt opstandig",
            "verse 96:7": "Omdat hij zich onafhankelijk denkt",
            "verse 96:8": "Voorwaar uw terugkeer is tot uw Heer",
            "verse 96:9": "Hebt gij degelle gezien die verbiedt",
            "verse 96:10": "Wanneer onze dienaar bidt",
            "verse 96:11": "Zeg mij, als hij de leiding volgt",
            "verse 96:12": "Of tot rechtvaardigheid maant",
            "verse 96:13": "Zeg mij, indien hij (de Waarheid) verloochent en zich afwendt",
            "verse 96:14": "Weet hij niet dat Allah alles ziet",
            "verse 96:15": "Neen, wanneer hij niet ophoudt, zullen Wij hem zeker bij de haren van zijn voorhoofd grijpen",
            "verse 96:16": "Van dat leugenachtige en schuldige voorhoofd",
            "verse 96:17": "Laat hij dan zijn raadgevers bij elkaar roepen",
            "verse 96:18": "Wij zullen ook Onze wachters bijeen brengen",
            "verse 96:19": "Neen, gehoorzaam hem niet, maar werp u neder en zoek Zijn nabijheid"
        },
        "Dutch": {
            "verse 96:1": "Lees voor! In de naam van jouw Heer, Die heeft geschapen.",
            "verse 96:2": "Hij heeft de mens geschapen van een bloedklomp.",
            "verse 96:3": "Lees voor! En jouw Heer is de Meest Edele.",
            "verse 96:4": "Degene Die onderwezen heeft met de pen.",
            "verse 96:5": "Hij heeft de mens onderwezen wat hij niet wist.",
            "verse 96:6": "Nee, voorwaar, de mens is zeker in overtreding.",
            "verse 96:7": "Omdat hij zichzelf als behoefteloos beschouwt.",
            "verse 96:8": "Voorwaar, tot jouw Heer is de terugkeer.",
            "verse 96:9": "Wat denk jij van hem die verbiedt?",
            "verse 96:10": "Een dienaar wanneer hij de shalât verricht.",
            "verse 96:11": "Wat denk je, als hij (Mohammed) de leiding volgt?",
            "verse 96:12": "Of hij tot Taqwa oproept?",
            "verse 96:13": "Wat denk jij, als hij (Abôe Djahl) loochent en zich afwendt?",
            "verse 96:14": "Weet hij dan niet dat Allah (hem) ziet?",
            "verse 96:15": "Nee, als hij niet ophoudt, dan zullen Wij hem bij zijn voorhoofdslok grijpen.",
            "verse 96:16": "Een leugenachtige, zondige voorhoofdslok.",
            "verse 96:17": "Laat hem dan zijn bondgenoten roepen.",
            "verse 96:18": "Wij zullen de Zabâniyah roepen.",
            "verse 96:19": "Nee, gehoorzaam hem niet, en kniel je neer en zoek toenadering (tot Allah)."
        },
        "English": {
            "verse 96:1": "Recite in the name of your Lord who created -",
            "verse 96:2": "Created man from a clinging substance.",
            "verse 96:3": "Recite, and your Lord is the most Generous -",
            "verse 96:4": "Who taught by the pen -",
            "verse 96:5": "Taught man that which he knew not.",
            "verse 96:6": "No! [But] indeed, man transgresses",
            "verse 96:7": "Because he sees himself self-sufficient.",
            "verse 96:8": "Indeed, to your Lord is the return.",
            "verse 96:9": "Have you seen the one who forbids",
            "verse 96:10": "A servant when he prays?",
            "verse 96:11": "Have you seen if he is upon guidance",
            "verse 96:12": "Or enjoins righteousness?",
            "verse 96:13": "Have you seen if he denies and turns away -",
            "verse 96:14": "Does he not know that Allah sees?",
            "verse 96:15": "No! If he does not desist, We will surely drag him by the forelock -",
            "verse 96:16": "A lying, sinning forelock.",
            "verse 96:17": "Then let him call his associates;",
            "verse 96:18": "We will call the angels of Hell.",
            "verse 96:19": "No! Do not obey him. But prostrate and draw near [to Allah]."
        },
        "Filipino": {
            "verse 96:1": "Ipahayag! Sa Ngalan ng iyong Panginoon at Tagapagtaguyod na lumikha sa lahat ng bagay",
            "verse 96:2": "Na lumikha sa tao mula sa namuong patak ng dugo",
            "verse 96:3": "Ipahayag! Ang iyong Panginoon ang Pinakamapagbigay",
            "verse 96:4": "Na nagturo sa tao (ng pagsulat) sa pamamagitan ng panulat (ang unang tao na sumulat ay si Propeta Idris [Enoch)",
            "verse 96:5": "Na nagturo sa tao ng hindi niya nalalaman",
            "verse 96:6": "Hindi! Katotohanan, ang tao ay lumabag sa lahat ng hangganan (ng pagsuway, kawalan ng pananalig at kasamaan, atbp)",
            "verse 96:7": "Sapagkat itinuturing niya ang kanyang sarili na may sariling kasapatan (hindi nangangailangan ng anumang tulong)",
            "verse 96:8": "Katiyakan! Sa iyong Panginoon ang pagbabalik (ng lahat)",
            "verse 96:9": "Nakikita mo ba (o Muhammad) siya na humahadlang (alalaong baga, si Abu Jahl)",
            "verse 96:10": "Sa isang alipin (Muhammad) kung siya ay nananalangin",
            "verse 96:11": "Sabihin mo sa akin, kung siya (Muhammad) ay nasa patnubay (ni Allah)",
            "verse 96:12": "o nagtatagubilin sa kabanalan",
            "verse 96:13": "Sabihin mo sa akin kung siya (na walang pananalig, si Abu Jahl) ay nagtatatwa (sa Katotohanan, alalaong baga sa Qur’an), at tumatalikod",
            "verse 96:14": "Hindi baga niya nababatid na si Allah ang nakakamasid (ng kanyang ginagawa)",
            "verse 96:15": "Hindi! Kung siya (Abu Jahl) ay hindi titigil, Aming kakaladkarin siya sa kanyang buhok na nakalawit sa noo",
            "verse 96:16": "Isang nagsisinungaling at makasalanang buhok na nakalawit sa noo",
            "verse 96:17": "At hayaan siyang tumawag (ng tulong) sa lipon (ng kanyang mga kapanalig)",
            "verse 96:18": "Tatawagin Namin ang mga tagapagbantay ng Impiyerno (anghel ng kaparusahan upang harapin siya)",
            "verse 96:19": "Hindi! (O Muhammad)! Huwag mo siyang sundin (Abu Jahl), bagkus ay magpatirapa ka at lumapit kay Allah"
        },
        "French": {
            "verse 96:1": "Lis, au nom de ton Seigneur qui a créé,",
            "verse 96:2": "qui a créé l'homme d'une adhérence.",
            "verse 96:3": "Lis! Ton Seigneur est le Très Noble,",
            "verse 96:4": "qui a enseigné par la plume [le calame],",
            "verse 96:5": "a enseigné à l'homme ce qu'il ne savait pas.",
            "verse 96:6": "Prenez-garde! Vraiment l'homme devient rebelle,",
            "verse 96:7": "dès qu'il estime qu'il peut se suffire à lui-même (à cause de sa richesse).",
            "verse 96:8": "Mais, c'est vers ton Seigneur qu'est le retour.",
            "verse 96:9": "As-tu vu celui qui interdit",
            "verse 96:10": "à un serviteur d'Allah [Muhammad] de célébrer la Salât?",
            "verse 96:11": "Vois-tu s'il est sur la bonne voie,",
            "verse 96:12": "ou s'il ordonne la piété?",
            "verse 96:13": "Vois-tu s'il dément et tourne le dos?",
            "verse 96:14": "Ne sait-il pas que vraiment Allah voit?",
            "verse 96:15": "Mais non! S'il ne cesse pas, Nous le saisirons certes, par le toupet,",
            "verse 96:16": "le toupet d'un menteur, d'un pécheur.",
            "verse 96:17": "Qu'il appelle donc son assemblée.",
            "verse 96:18": "Nous appellerons les gardiens [de l'Enfer].",
            "verse 96:19": "Non! Ne lui obéis pas; mais prosterne-toi et rapproche-toi."
        },
        "Fulah": {
            "verse 96:1": "janngu e Innde joo ma Oon takɗo",
            "verse 96:2": "Takɗo neɓɗɗo e heɓɗere",
            "verse 96:3": "janngu e joom ma ɓurɗo teddude",
            "verse 96:4": "Oon ganndanirɗo kuɗol",
            "verse 96:5": "O anndini aade ko o anndaana",
            "verse 96:6": "Kono tan pellet neɓɗo na bewa",
            "verse 96:7": "Si o yi*ii o yondaniima",
            "verse 96:8": "Pellet ko e joom ma woni ruttorde",
            "verse 96:9": "Mbela a yi*i oon kaɗoowo",
            "verse 96:10": "Maccuɗo si o juulii",
            "verse 96:11": "A yi*ii si o laatiima e peewal",
            "verse 96:12": "Wolla o yamiri kulol Alla. @Corrected",
            "verse 96:13": "Mbela a yi*i si o fennii o runti",
            "verse 96:14": "Mbela o anndah wonde Alla na yi*a",
            "verse 96:15": "Alah si o accaani ma Min nanngu mbo e tiin tiinol Min mbeddoo mbo e yiite",
            "verse 96:16": "Tiin tiinol penngol goopngol",
            "verse 96:17": "Yo o noddu wondiiɓe makko",
            "verse 96:18": "Ma Min noddu sokooɓe jahannama",
            "verse 96:19": "Alah woto ɗofto mbo sujju ɓattaɗa"
        },
        "German": {
            "verse 96:1": "Lies im Namen deines Herrn, Der erschaffen hat,",
            "verse 96:2": "den Menschen erschaffen hat aus einem Anhängsel.",
            "verse 96:3": "Lies, und dein Herr ist der Edelste,",
            "verse 96:4": "Der (das Schreiben) mit dem Schreibrohr gelehrt hat,",
            "verse 96:5": "den Menschen gelehrt hat, was er nicht wußte.",
            "verse 96:6": "Keineswegs! Der Mensch lehnt sich wahrlich auf,",
            "verse 96:7": "daß er von sich meint, unbedürftig zu sein.",
            "verse 96:8": "Gewiß, zu deinem Herrn wird die Rückkehr sein.",
            "verse 96:9": "Siehst du denjenigen, der abhält",
            "verse 96:10": "einen Diener, wenn er betet?",
            "verse 96:11": "Siehst du! Obwohl er nach der Rechtleitung verfährt,",
            "verse 96:12": "oder die Gottesfurcht gebietet?",
            "verse 96:13": "Siehst du! Wie (wäre es) wenn er (die Botschaft) für Lüge erklärt und sich abkehrt?",
            "verse 96:14": "Weiß er denn nicht, daß Allah sieht?",
            "verse 96:15": "Keineswegs! Wenn er nicht aufhört, werden Wir ihn ganz gewiß an der Stirnlocke packen und ziehen,",
            "verse 96:16": "einer Stirnlocke, einer lügnerischen, einer verfehlt handelnden.",
            "verse 96:17": "So soll er doch seine Genossen rufen.",
            "verse 96:18": "Wir werden die (Höllen)wache rufen.",
            "verse 96:19": "Keineswegs! Gehorche ihm nicht, sondern wirf dich nieder und sei (Allah) nah!"
        },
        "Hausa": {
            "verse 96:1": "Ka yi karatu da sunan Ubangijinka, wanda Ya yi halitta.",
            "verse 96:2": "Ya hahitta mutum daga gudan jini.",
            "verse 96:3": "Ka yi karatu, kuma UbangiJinka shi ne Mafi karimci.",
            "verse 96:4": "Wanda Ya sanar (da mutum) game da alƙalami.",
            "verse 96:5": "Ya sanar da mutum abin da bai sani ba.",
            "verse 96:6": "A'aha! Lalle, ne mutum haƙĩƙa, yana girman kai (ya ƙi karatu).",
            "verse 96:7": "Dõmin yã ga kansa, yã wadãta.",
            "verse 96:8": "Lalle ne zuwa ga Ubangijinka makoma take.",
            "verse 96:9": "Shin, kã ga wanda ke hana.",
            "verse 96:10": "Bãwã idan yã yi salla?",
            "verse 96:11": "Ashe, kã gani, idan (shi bãwan) ya kasance a kan shiriya?",
            "verse 96:12": "Ko ya yi umurni da taƙawa?",
            "verse 96:13": "Ashe, kã gani, idan (shi mai hanin) ya ƙaryata, kuma ya jũya bãya?",
            "verse 96:14": "Ashe, bai sani ba cewa Allah Yanã gani?",
            "verse 96:15": "A'aha! Lalle ne, idan bai hanu ba, lalle ne zã Mu ja gãshin makwarkwaɗa.",
            "verse 96:16": "Makwarkwaɗa maƙaryaciya, mai laifi.",
            "verse 96:17": "Sai ya kirayi ƙungiyarsa.",
            "verse 96:18": "Zã Mu kirayi zabaniyãwa (mala'iku mãsu girma).",
            "verse 96:19": "A'aha kada ka bĩ shi. Kuma ka yi tawali'u, kuma ka nemi kusanta (zuwa ga Ubangijinka)."
        },
        "Hindi": {
            "verse 96:1": "(ऐ रसूल) अपने परवरदिगार का नाम लेकर पढ़ो जिसने हर (चीज़ को) पैदा किया",
            "verse 96:2": "उस ने इन्सान को जमे हुए ख़ून से पैदा किया पढ़ो",
            "verse 96:3": "और तुम्हारा परवरदिगार बड़ा क़रीम है",
            "verse 96:4": "जिसने क़लम के ज़रिए तालीम दी",
            "verse 96:5": "उसीने इन्सान को वह बातें बतायीं जिनको वह कुछ जानता ही न था",
            "verse 96:6": "सुन रखो बेशक इन्सान जो अपने को ग़नी देखता है",
            "verse 96:7": "तो सरकश हो जाता है",
            "verse 96:8": "बेशक तुम्हारे परवरदिगार की तरफ (सबको) पलटना है",
            "verse 96:9": "भला तुमने उस शख़्श को भी देखा",
            "verse 96:10": "जो एक बन्दे को जब वह नमाज़ पढ़ता है तो वह रोकता है",
            "verse 96:11": "भला देखो तो कि अगर ये राहे रास्त पर हो या परहेज़गारी का हुक्म करे",
            "verse 96:12": "(तो रोकना कैसा)",
            "verse 96:13": "भला देखो तो कि अगर उसने (सच्चे को) झुठला दिया और (उसने) मुँह फेरा",
            "verse 96:14": "(तो नतीजा क्या होगा) क्या उसको ये मालूम नहीं कि ख़ुदा यक़ीनन देख रहा है",
            "verse 96:15": "देखो अगर वह बाज़ न आएगा तो हम परेशानी के पट्टे पकड़ के घसीटेंगे",
            "verse 96:16": "झूठे ख़तावार की पेशानी के पट्टे",
            "verse 96:17": "तो वह अपने याराने जलसा को बुलाए हम भी जल्लाद फ़रिश्ते को बुलाएँगे",
            "verse 96:18": "(ऐ रसूल) देखो हरगिज़ उनका कहना न मानना",
            "verse 96:19": "और सजदे करते रहो और कुर्ब हासिल करो (19) (सजदा)"
        },
        "Indonesian": {
            "verse 96:1": "Bacalah dengan (menyebut) nama Tuhanmu Yang menciptakan,",
            "verse 96:2": "Dia telah menciptakan manusia dari segumpal darah.",
            "verse 96:3": "Bacalah, dan Tuhanmulah Yang Maha Pemurah,",
            "verse 96:4": "Yang mengajar (manusia) dengan perantaran kalam,",
            "verse 96:5": "Dia mengajar kepada manusia apa yang tidak diketahuinya.",
            "verse 96:6": "Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas,",
            "verse 96:7": "karena dia melihat dirinya serba cukup.",
            "verse 96:8": "Sesungguhnya hanya kepada Tuhanmulah kembali(mu).",
            "verse 96:9": "Bagaimana pendapatmu tentang orang yang melarang,",
            "verse 96:10": "seorang hamba ketika mengerjakan shalat,",
            "verse 96:11": "bagaimana pendapatmu jika orang yang melarang itu berada di atas kebenaran,",
            "verse 96:12": "atau dia menyuruh bertakwa (kepada Allah)?",
            "verse 96:13": "Bagaimana pendapatmu jika orang yang melarang itu mendustakan dan berpaling?",
            "verse 96:14": "Tidaklah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya?",
            "verse 96:15": "Ketahuilah, sungguh jika dia tidak berhenti (berbuat demikian) niscaya Kami tarik ubun-ubunnya,",
            "verse 96:16": "(yaitu) ubun-ubun orang yang mendustakan lagi durhaka.",
            "verse 96:17": "Maka biarlah dia memanggil golongannya (untuk menolongnya),",
            "verse 96:18": "kelak Kami akan memanggil malaikat Zabaniyah,",
            "verse 96:19": "sekali-kali jangan, janganlah kamu patuh kepadanya; dan sujudlah dan dekatkanlah (dirimu kepada Tuhan)."
        },
        "Italian": {
            "verse 96:1": "Leggi! In nome del tuo Signore che ha creato,",
            "verse 96:2": "ha creato l'uomo da un'aderenza.",
            "verse 96:3": "Leggi, ché il tuo Signore è il Generosissimo,",
            "verse 96:4": "Colui Che ha insegnato mediante il calamo,",
            "verse 96:5": "che ha insegnato all'uomo quello che non sapeva.",
            "verse 96:6": "Invece no! Invero l'uomo si ribella,",
            "verse 96:7": "appena ritiene di bastare a se stesso.",
            "verse 96:8": "In verità il ritorno è verso il tuo Signore.",
            "verse 96:9": "Hai visto colui che proibisce",
            "verse 96:10": "al servo di eseguire l'orazione?",
            "verse 96:11": "Pensi che segua la guida,",
            "verse 96:12": "che comandi il timore [di Allah]?",
            "verse 96:13": "Non pensi piuttosto che rinneghi e volga le spalle?",
            "verse 96:14": "Non sa che, invero, Allah vede?",
            "verse 96:15": "Stia in guardia: se non smette, Noi lo afferreremo per il ciuffo,",
            "verse 96:16": "il ciuffo mendace peccaminoso.",
            "verse 96:17": "Chiami pure il suo clan:",
            "verse 96:18": "Noi chiameremo i guardiani.",
            "verse 96:19": "No, non gli obbedire, ma prosternati e avvicinati."
        },
        "Japanese": {
            "verse 96:1": "読め，「創造なされる御方，あなたの主の御名において。",
            "verse 96:2": "一凝血から，人間を創られた。」",
            "verse 96:3": "読め，「あなたの主は，最高の尊貴であられ，",
            "verse 96:4": "筆によって（書くことを）教えられた御方。",
            "verse 96:5": "人間に未知なることを教えられた御方である。」",
            "verse 96:6": "いや，人間は本当に法外で，",
            "verse 96:7": "自分で何も足りないところはないと考えている。",
            "verse 96:8": "本当にあなたの主に（凡てのものは）帰されるのである。",
            "verse 96:9": "あなたは，阻止する者を見たか，",
            "verse 96:10": "一人のしもべ（ムハンマド）が，礼拝を捧げる時に。",
            "verse 96:11": "あなたは，かれ（阻止する者）が，（正しい道）に導かれていると思うのか。",
            "verse 96:12": "敬神を勧めているか，",
            "verse 96:13": "（真理を）嘘であるとして背を向けたと思うのか。",
            "verse 96:14": "かれは，アッラーが見ておられることを知らないのか。",
            "verse 96:15": "断じてそうではない。もしかれが止ないならば，われは前髪でかれを捕えるであろう，",
            "verse 96:16": "嘘付きで，罪深い前髪を。",
            "verse 96:17": "そしてかれの（救助のために）一味を召集させなさい。",
            "verse 96:18": "われは看守（の天使）を召集するであろう。",
            "verse 96:19": "断じてそうあるべきではない。あなたはかれに従ってはならない。一途にサジダして（主に）近付け。〔サジダ〕"
        },
        "Jawa": {
            "verse 96:1": "(Muhammad) sira macaa kelawan asmaning Pangeranira Kang anitahake",
            "verse 96:2": "Panjenengane anitahake manungsa saka getih kenthel",
            "verse 96:3": "Macaa, lan Pangeranira iku Ingkang Maha Mulya",
            "verse 96:4": "Kang meruhake (carane nulis) nganggo kalam",
            "verse 96:5": "Kang meruhake marang manungsa, barang kang maune durung weruh",
            "verse 96:6": "Nanging satemene manungsa iku kebangeten",
            "verse 96:7": "Dene rumongsa awake wis cukup (ora butuh)",
            "verse 96:8": "Sira iku mesthi bakal bali disowanake ana pangayunaning Allah",
            "verse 96:9": "Kapriye penemunira wong kang menging",
            "verse 96:10": "Sawijining abdi samongsa sholat",
            "verse 96:11": "Apa sira weruh yen dheweke iku nglungguhi pituduh bener",
            "verse 96:12": "Utawa ajak - ajak jaga diri (saka ala)",
            "verse 96:13": "Apa sira weruh yen dheweke iku anggorohake lan mlengos",
            "verse 96:14": "Apa dheweke ora weruh yen Allah iku amirsani",
            "verse 96:15": "Temen menawa dheweke (Abu Jahal) Ora mareni anggone kafir ing tembe mesthi Ingsun candhak kuncunge (bathuke)",
            "verse 96:16": "Kuncunge wong goroh, kuncunge wong luput",
            "verse 96:17": "Yen wis mangkono mara ngundanga kanca - kancane jaluka pitulung",
            "verse 96:18": "Nanging Ingsun undangake malaekat Zabaniah",
            "verse 96:19": "Aja sira manut dheweke, sarta sumujuda (sholat) lan nyedhakka ing Allah kelawan sujud"
        },
        "Kazakh": {
            "verse 96:1": "Ей, Мұхаммед! Оқы, жаратқан Раббыңның атымен",
            "verse 96:2": "адам баласын ұйыған қаннан жаратқан",
            "verse 96:3": "Оқы! Әрі сенің Раббың аса Жомарт",
            "verse 96:4": "Ол қалам арқылы үйретті",
            "verse 96:5": "Адамға, ол білмегенді үйретті",
            "verse 96:6": "Жоқ, күмәнсіз, адам баласы шектен шығады",
            "verse 96:7": "өзін бай, мұқтажсыз санағанынан",
            "verse 96:8": "Ал, анығында, қайту Раббыңа",
            "verse 96:9": "Көрдің бе, кедергі жасағанды",
            "verse 96:10": "бір құлға, ол намаз оқыған кезде",
            "verse 96:11": "Айтшы, егер ол тура жолда болған болса",
            "verse 96:12": "немесе тақуалықты Аллаһтың жазасынан қорқып, сақтануды бұйырған болса",
            "verse 96:13": "Көрдің бе, оның өтірікке шығарғанын және теріс айналғанын",
            "verse 96:14": "сонда ол Аллаһтың көріп тұрғанын білмей ме",
            "verse 96:15": "Жоқ, олай емес! Егер ол осылай істегенін тоқтатпаса, сөзсіз Біз кекілден ұстаймыз",
            "verse 96:16": "Өтірікші, біле тұра қателесуші кекілден",
            "verse 96:17": "Қане, шақырсын ол жақтастарын",
            "verse 96:18": "Біз де сақшыларды шақырамыз",
            "verse 96:19": "Олай емес! Ей, Мұхаммеді Сен оған бағынба. Раббыңа сәжде қыл және жақындай түс"
        },
        "Korean": {
            "verse 96:1": "만물을 창조하신 주님의 이름으로 읽으라만물을 창조하신 주님의 이름으로 읽으라",
            "verse 96:2": "그분은 한방울의 정액으로 인 간을 창조하셨노라그분은 한방울의 정액으로 인 간을 창조하셨노라",
            "verse 96:3": "읽으라 주님은 가장 은혜로운 분으로읽으라 주님은 가장 은혜로운 분으로",
            "verse 96:4": "연필로 쓰는 것을 가르쳐 주 셨으며연필로 쓰는 것을 가르쳐 주 셨으며",
            "verse 96:5": "인간이 알지 못하는 것도 기 르쳐 주셨노라인간이 알지 못하는 것도 기 르쳐 주셨노라",
            "verse 96:6": "그러나 인간은 오만하여 범주 를 넘어서그러나 인간은 오만하여 범주 를 넘어서",
            "verse 96:7": "스스로 충만하다 생각하도다스스로 충만하다 생각하도다",
            "verse 96:8": "실로 모든 인간은 주님께로 귀의하노라실로 모든 인간은 주님께로 귀의하노라",
            "verse 96:9": "기도를 금지한 자를 보았느뇨기도를 금지한 자를 보았느뇨",
            "verse 96:10": "그는 바로 기도하는 하나님 의 종을 방해하였노라그는 바로 기도하는 하나님 의 종을 방해하였노라",
            "verse 96:11": "그가 복음의 길 위에 있었다생각하느뇨그가 복음의 길 위에 있었다생각하느뇨",
            "verse 96:12": "아니면 신앙에 경건하라 명 령을 받았다 생각하느뇨아니면 신앙에 경건하라 명 령을 받았다 생각하느뇨",
            "verse 96:13": "그가 진리를 거역하고 외면 하였다 생각하느뇨그가 진리를 거역하고 외면 하였다 생각하느뇨",
            "verse 96:14": "하나님께서 지켜 보심을 그 는 알지 못하느뇨하나님께서 지켜 보심을 그 는 알지 못하느뇨",
            "verse 96:15": "그로 하여금 알게 하리니 그가 단념하지 않는다면 그의 앞머 리를 끌어가리라그로 하여금 알게 하리니 그가 단념하지 않는다면 그의 앞머 리를 끌어가리라",
            "verse 96:16": "그 머리는 거짓과 죄악의 머리라그 머리는 거짓과 죄악의 머리라",
            "verse 96:17": "그런 후 그로 하여금 그를 도울 동료들을 불러 모이게 하고그런 후 그로 하여금 그를 도울 동료들을 불러 모이게 하고",
            "verse 96:18": "하나님은 그에게 다른 응벌 의 천사들을 부르리라하나님은 그에게 다른 응벌 의 천사들을 부르리라",
            "verse 96:19": "그러므로 그를 따르지 말라 부복하여 경배하고 하나님께 가까 이 하라그러므로 그를 따르지 말라 부복하여 경배하고 하나님께 가까 이 하라"
        },
        "Kurdish": {
            "verse 96:1": "(Muhemmed!) tu bi navê Xuda yê teyê, ku tu afirandîyî bi xûne(ئه‌ی محمد صلی الله علیه وسلم) بخوێنه به‌ناوی ئه‌و په‌روه‌ردگاره‌ته‌وه که هه‌موو شتێکی دروست کردووه‌.",
            "verse 96:2": "Ewî meriv ji zûryan afirandîyeئاده‌میزادی له چه‌ند خانه‌یه‌کی هه‌ڵواسراو (له‌ناو منداڵداندا) دروست کردووه‌.",
            "verse 96:3": "Tu bi xûne! Û Xuda yê te pir rûmetdareبخوێنه‌، له‌کاتێکدا هه‌ر په‌روه‌ردگاری تۆ به‌خشنده‌یه‌.",
            "verse 96:4": "Ewî (bi merivan nivîsandina) bi gilîgo û nivîsdarokî daye hînkirinêئه‌و زاته‌یه که به‌هۆی قه‌ڵه‌مه‌وه زانستی و زانیاری فێر کردووه‌.",
            "verse 96:5": "Tişta, ku merivan nizanbûye ewî bi wan daye hînkirinêئاده‌میزادی فێری ئه‌و شتانه کردووه که نه‌یزانیوون.",
            "verse 96:6": "Na! (di hemberê van qencîyan da) bi rastî meriv ji avarû derketîyeنه‌خێر (له‌گه‌ڵ ئه‌و هه‌موو چاکه‌و ڕێزه‌دا که خوا به‌خشیویه‌تی به ئینسان) به‌ڕاستی خه‌ڵکی سه‌رکه‌شی ده‌که‌ن، یاخی ده‌بن، سته‌م ده‌که‌ن.",
            "verse 96:7": "Ji ber, ku ewa (meriva) xwe ne hewce dîtîyeله‌به‌ر ئه‌وه‌ی هه‌ر ئاده‌میزاد هه‌ستی کرد ده‌وڵه‌مه‌ندو بێ نیازه (له‌ڕووی ئابووری، یان ته‌ندروستی، یان زانستی... هتد)یه‌وه‌.",
            "verse 96:8": "Bi rastî para zıvirandin hey li bal Xuda yê te dane (wê hijmara kirinê wan bibîne)(ئه‌وه فه‌رامۆش ده‌کات که‌): بێگومان سه‌ره‌نجام گه‌ڕانه‌وه هه‌ر بۆ لای په‌روه‌ردگارته‌و (له‌سه‌ر که‌ش و یاخیه‌کان ده‌پرسێته‌وه‌).",
            "verse 96:9": "Qey tu ewê, ku paradanê dike nabînîباشه‌، پێم بڵێ ئایا ئه‌و که‌سه‌ی که فه‌رمان ده‌دات و ڕێگری ده‌کات؟!...",
            "verse 96:10": "Gava bendek nimej dike (ewî dide para da na hêle nimej bike)له به‌نده‌یه‌کی خوا کاتێك نوێژ ده‌کات!!...",
            "verse 96:11": "Tu dibînî; heke;ewa (bendê nimêj; dike) li ser rêya rast beئه‌ی ئه‌گه‌ر ئه‌و که‌سه‌ی قه‌ده‌غه‌ی لێده‌کرێت له‌سه‌ر ڕێبازی هیدایه‌ت و چاکه بێت!!",
            "verse 96:12": "Yan jî ewa (benda) fermana bi Xuda parizî bikeیان فه‌رمان به خواناسی بکات!!...",
            "verse 96:13": "Tu di binî; heke ewa (bendê paradanê dike) pişta xwe bide (van şîretan û) bide derewdêrandine? (wê gavê ewê bizane ka wê çi bê serê wî)ئه‌ی ئه‌گه‌ر (کابرای خوانه‌ناس) به‌رنامه‌ی خوا به‌درۆ بزانێت و پشتی تێ بکات.",
            "verse 96:14": "Maqey ewa nizane, ku bi rastî Yezdan bi hemû kirinê wî (dizane û) dibîneئایا نه‌یزانیووه که خوا ده‌یبینێت و ئاگای (له گوفتارو کرداریه‌تی)؟!",
            "verse 96:15": "Na! heke ewa (ji wan kirinê xwe poşman nebe) parada nefitile, bi rastî emê bi tûncika wî bigirin (ewî li bal dojê da) bi kişîninنه‌خێر.. سوێند به‌خوا ئه‌گه‌ر کۆڵ نه‌دات و کۆتایی (به دوژمنکاری نه‌هێنێت)، ئێمه پێشه سه‌ری ده‌گرین (بۆ دۆزه‌خ کێشی ده‌که‌ین).",
            "verse 96:16": "Bi tûndcika wî virekê gunehkar (bigirin)ئه‌و پێشه سه‌ره درۆزنه تاوانکاره (پێشه سه‌ر: جێگه‌ی بیر کردنه‌وه‌و تێفکرانه‌).",
            "verse 96:17": "Îdî bi ra ewa (here) gazî hemnişînê xwe bikeئینجا وازی لێبهێنه‌، با هاوه‌ڵ و هاوبیرو باوه‌ڕانی بانگ بکات و (کۆیان بکاته‌وه بۆ دژایه‌تی ئیمانداران).",
            "verse 96:18": "Emê jî gazî feriştene xwene (parisvznê dojê bi navê) zabanî bikinئێمه‌ش فریشته‌کانی کاربه‌ده‌ستی دۆزه‌خی بۆ بانگ ده‌که‌ین (تا تۆڵه‌ی لێ بسێنن و له دۆزه‌خ توندی بکه‌ن).",
            "verse 96:19": "Na! (Muhemmed!) qe tu bi gotina wî (gunahkarî) neke ü tu (ji bona Xuda yê xwe ra) kunde bihere û nezîkê wî (Xuda yê xwe be)نه‌خێر به‌گوێی ئه‌و جۆره که‌سانه مه‌که‌، تۆ هه‌ر سه‌رگه‌رمی نوێژو سوژده ببه‌و به به‌ندایه‌تی خۆت له په‌روه‌ردگارت نزیك بکه‌ره‌وه‌."
        },
        "Kyrgyz": {
            "verse 96:1": "Оку, Жараткан Раббиңдин ысымы менен",
            "verse 96:2": "Алинсанды уюган кандан жаратты",
            "verse 96:3": "Оку, сенин Раббиң эң улук Зат",
            "verse 96:4": "Ал инсанга калем менен (жазууну) үйрөттү",
            "verse 96:5": "Инсанга билбегенин (Кураанды жана башка илимдерди) билгизди",
            "verse 96:6": "Жок! Чынында, инсан чектен ашат",
            "verse 96:7": "өзүн бай-беймуктаж көргөндө",
            "verse 96:8": "Аныгында, кайтып баруу Раббиңе гана",
            "verse 96:9": "Көрдүңбү сен тыюу салган кишини",
            "verse 96:10": "намаз окуган пендеге",
            "verse 96:11": "Эмне деп ойлойсуң, эгер ал (намаз окуучу) түз жолдо болсо",
            "verse 96:12": "Же (адамдарды) такыбалыкка буюрса",
            "verse 96:13": "(О, Мухаммад), эмне дейсиң, эгер ал (каапыр чындыкты) “жалган” десе жана жүз үйрүп кетсе",
            "verse 96:14": "Билбейби ал Аллаһ көрүп турганын",
            "verse 96:15": "Жок! Эгер (каршылыгын) токтотпосо, Биз анын маңдайынан катуу чапчып алабыз",
            "verse 96:16": "Дал ошол жалганчы, күнөөкөр маңдайынан",
            "verse 96:17": "Эми, ал өзүнүн (ишенген) адамдарын чакыра берсин",
            "verse 96:18": "Биз дагы (“Забаания периштелери” деп аталган) тозок сакчыларын чакырабыз",
            "verse 96:19": "Жок, сен ага! моюн сунба! (Раббиңе) сажда кыл жана (ушул сыяктуу саждалар жана башка ибадаттар менен Аллаһ Таалага) жакын бол"
        },
        "Malay": {
            "verse 96:1": "Bacalah (wahai Muhammad) dengan nama Tuhanmu yang menciptakan (sekalian makhluk),",
            "verse 96:2": "Ia menciptakan manusia dari sebuku darah beku;",
            "verse 96:3": "Bacalah, dan Tuhanmu Yang Maha Pemurah, -",
            "verse 96:4": "Yang mengajar manusia melalui pena dan tulisan, -",
            "verse 96:5": "Ia mengajarkan manusia apa yang tidak diketahuinya.",
            "verse 96:6": "Ingatlah! Sesungguhnya jenis manusia tetap melampaui batas (yang sepatutnya atau yang sewajibnya),",
            "verse 96:7": "Dengan sebab ia melihat dirinya sudah cukup apa yang dihajatinya.",
            "verse 96:8": "(Ingatlah) sesungguhnya kepada Tuhanmu lah tempat kembali (untuk menerima balasan).",
            "verse 96:9": "Adakah engkau nampak (baiknya) orang yang melarang (dan menghalang) -",
            "verse 96:10": "Seorang hamba Allah apabila ia mengerjakan sembahyang?",
            "verse 96:11": "Adakah engkau nampak (buruknya) jika ia berada di atas jalan yang betul? -",
            "verse 96:12": "Atau ia menyuruh orang bertaqwa (jangan melakukan syirik)?",
            "verse 96:13": "Adakah engkau nampak (terlepasnya dari azab) jika ia mendustakan (apa yang disampaikan oleh Nabi Muhammad kepadanya) serta ia berpaling ingkar?",
            "verse 96:14": "Tidakkah ia mengetahui bahawa sesungguhnya Allah melihat (segala amal perbuatannya dan membalasnya)?",
            "verse 96:15": "Jangan sekali-kali berlaku derhaka! Demi sesungguhnya jika ia tidak berhenti (dari perbuatannya yang buruk itu), nescaya Kami akan menyentap ubun-ubunnya (dan menyeretnya ke dalam neraka), -",
            "verse 96:16": "Ubun-ubun (orang) yang berdusta, yang bersalah.",
            "verse 96:17": "Kemudian biarlah ia memanggil kumpulannya (untuk menyelamatkannya),",
            "verse 96:18": "Kami pula akan memanggil malaikat Zabaniyah (untuk menyeksanya)!",
            "verse 96:19": "Ingatlah! Janganlah engkau (wahai Muhammad) menurut kehendaknya, dan (sebaliknya) sujudlah dan dampingkanlah dirimu kepada Allah (dengan taat dan beramal soleh)!"
        },
        "Malayalam": {
            "verse 96:1": "സൃഷ്ടിച്ചവനായ നിന്‍റെ രക്ഷിതാവിന്‍റെ നാമത്തില്‍ വായിക്കുക.",
            "verse 96:2": "മനുഷ്യനെ അവന്‍ ഭ്രൂണത്തില്‍ നിന്ന് സൃഷ്ടിച്ചിരിക്കുന്നു.",
            "verse 96:3": "നീ വായിക്കുക നിന്‍റെ രക്ഷിതാവ് ഏറ്റവും വലിയ ഔദാര്യവാനാകുന്നു.",
            "verse 96:4": "പേന കൊണ്ട് പഠിപ്പിച്ചവന്‍",
            "verse 96:5": "മനുഷ്യന് അറിയാത്തത് അവന്‍ പഠിപ്പിച്ചിരിക്കുന്നു.",
            "verse 96:6": "നിസ്സംശയം മനുഷ്യന്‍ ധിക്കാരിയായി തീരുന്നു.",
            "verse 96:7": "തന്നെ സ്വയം പര്യാപ്തനായി കണ്ടതിനാല്‍",
            "verse 96:8": "തീര്‍ച്ചയായും നിന്‍റെ രക്ഷിതാവിലേക്കാണ് മടക്കം.",
            "verse 96:9": "വിലക്കുന്നവനെ നീ കണ്ടുവോ?",
            "verse 96:10": "ഒരു അടിയനെ, അവന്‍ നമസ്കരിച്ചാല്‍.",
            "verse 96:11": "അദ്ദേഹം സന്‍മാര്‍ഗത്തിലാണെങ്കില്‍ , (ആ വിലക്കുന്നവന്‍റെ അവസ്ഥ എന്തായിരിക്കുമെന്ന്‌) നീ കണ്ടുവോ?",
            "verse 96:12": "അഥവാ അദ്ദേഹം സൂക്ഷ്മത കൈ കൊള്ളാന്‍ കല്‍പിച്ചിരിക്കുകയാണെങ്കില്‍",
            "verse 96:13": "അവന്‍ (ആ വിലക്കുന്നവന്‍) നിഷേധിച്ചു തള്ളുകയും തിരിഞ്ഞുകളയുകയും ചെയ്തിരിക്കയാണെങ്കില്‍ (അവന്‍റെ അവസ്ഥ എന്തായിരിക്കുമെന്ന്‌) നീ കണ്ടുവോ?",
            "verse 96:14": "അവന്‍ മനസ്സിലാക്കിയിട്ടില്ലേ, അല്ലാഹു കാണുന്നുണെ്ടന്ന്‌?",
            "verse 96:15": "നിസ്സംശയം. അവന്‍ വിരമിച്ചിട്ടില്ലെങ്കല്‍ നാം ആ കുടുമ പിടിച്ചു വലിക്കുക തന്നെ ചെയ്യും .",
            "verse 96:16": "കള്ളം പറയുന്ന , പാപം ചെയ്യുന്ന കുടുമ.",
            "verse 96:17": "എന്നിട്ട് അവന്‍ അവന്‍റെ സഭയിലുള്ളവരെ വിളിച്ചുകൊള്ളട്ടെ.",
            "verse 96:18": "നാം സബാനിയത്തിനെ (ശിക്ഷ നടപ്പാക്കുന്ന മലക്കുകളെ) വിളിച്ചുകൊള്ളാം.",
            "verse 96:19": "നിസ്സംശയം; നീ അവനെ അനുസരിച്ചു പോകരുത് , നീ പ്രണമിക്കുകയും സാമീപ്യം നേടുകയും ചെയ്യുക."
        },
        "Norwegian": {
            "verse 96:1": "Forkynn i din Herres navn! Han som skaper,",
            "verse 96:2": "skaper mennesket av en liten seig klump.",
            "verse 96:3": "Forkynn! Se, Herren er den store velgjører,",
            "verse 96:4": "som ved pennen har undervist,",
            "verse 96:5": "undervist mennesket om ting det ikke kjente.",
            "verse 96:6": "Nei, mennesket er sannelig oppsetsig,",
            "verse 96:7": "for det mener å være seg selv nok!",
            "verse 96:8": "Til Herren vender alt tilbake!",
            "verse 96:9": "Du har vel sett ham som forbyr",
            "verse 96:10": "en trell når han forretter bønnen?",
            "verse 96:11": "Mener du at han følger ledelsen,",
            "verse 96:12": "eller fremmer gudsfrykt?",
            "verse 96:13": "Eller mener du at han fornekter og vender seg bort?",
            "verse 96:14": "Vet han ikke at Gud ser!",
            "verse 96:15": "Nei, sannelig, hvis han ikke slutter, skal Vi ta ham i luggen,",
            "verse 96:16": "en løgnaktig, syndefull lugg!",
            "verse 96:17": "La ham bare tilkalle sin klikk,",
            "verse 96:18": "så skal Vi tilkalle vokterne!",
            "verse 96:19": "Nei! Adlyd ham ikke! Fall ned i bønn, og kom din Gud nær!"
        },
        "Pashto": {
            "verse 96:1": "ته د خپل هغه رب په نامه سره ولوله چې پیدا كړي يې دي (ټول مخلوقات)",
            "verse 96:2": "ده انسان له پرنې (ټوټې) وینې نه پیدا كړى دى",
            "verse 96:3": "ته ولوله، په داسې حال كې چې ستا رب تر ټولو لوى كریم دى",
            "verse 96:4": "هغه چې په قلم سره يې ښوونه كړې ده",
            "verse 96:5": "انسان ته يې هغه څه ښودلي دي چې دى پرې نه پوهېده",
            "verse 96:6": "حقه دا خبره ده چې یقینًا انسان خامخا سركشي كوي",
            "verse 96:7": "په دې وجه چې دى خپل ځان ویني چې دى بې پروا (بې حاجته) شو",
            "verse 96:8": "بېشكه خاص ستا رب ته بېرته ورتلل دي",
            "verse 96:9": "ته ما ته خبر راكړه د هغه كس چې منع كوي",
            "verse 96:10": "بنده (محمدﷺ) لره كله چې دى لمونځ كوي",
            "verse 96:11": "ته ما ته خبر راكړه كه چېرې دغه (بنده) په هدایت وي",
            "verse 96:12": "یا په تقوٰی (پرهېزګارۍ) سره حكم كوي",
            "verse 96:13": "ته ما ته خبر راكړه كه دغه (منع كوونكى) تكذیب كوي او (له حق نه) مخ اړوي",
            "verse 96:14": "ایا دى نه پوهېږي چې بېشكه الله ویني؟",
            "verse 96:15": "داسې نه ده! قسم دى كه دى منع نشو، (نو) مونږ به (دى) خامخا ضرور ډېر سخت راكاږو د تندي (وچولي) په وېښتانو سره",
            "verse 96:16": "داسې تندى چې دروغجن (او) خطا كار دى",
            "verse 96:17": "نو دى دې خپل مجلس والا راوبلي",
            "verse 96:18": "ژر ده چې مونږ به ډېر سخت تند خویه ملايك راوبلو",
            "verse 96:19": "داسې نه ده ته د ده خبره مه منه، او (الله ته) سجده كوه او (الله ته) ښه نژدې شه"
        },
        "Persian": {
            "verse 96:1": "بخوان به نام پروردگارت كه بيافريد.",
            "verse 96:2": "آدمى را از لخته‌خونى بيافريد.",
            "verse 96:3": "بخوان، و پروردگار تو ارجمندترين است.",
            "verse 96:4": "خدايى كه به وسيله قلم آموزش داد،",
            "verse 96:5": "به آدمى آنچه را كه نمى‌دانست بياموخت.",
            "verse 96:6": "حقا كه آدمى نافرمانى مى‌كند،",
            "verse 96:7": "هرگاه كه خويشتن را بى‌نياز بيند.",
            "verse 96:8": "هر آينه بازگشت به سوى پروردگار توست.",
            "verse 96:9": "آيا ديدى آن كس را كه منع مى‌كند",
            "verse 96:10": "بنده‌اى را كه نماز مى‌خواند؟",
            "verse 96:11": "چه مى‌بينى اگر آن مرد بر طريق هدايت باشد؟",
            "verse 96:12": "يا به پرهيزگارى فرمان دهد؟",
            "verse 96:13": "چه مى‌بينى اگر تكذيب كند و رويگردان شود؟",
            "verse 96:14": "آيا ندانسته است كه خدا مى‌بيند؟",
            "verse 96:15": "حقا، كه اگر بازنايستد موى پيش سرش را مى‌گيريم و مى‌كشيم.",
            "verse 96:16": "موى پيش سر دروغگوى خطاكار را.",
            "verse 96:17": "پس همدمان خود را بخواند.",
            "verse 96:18": "ما نيز كارگزاران دوزخ را فرا مى‌خوانيم.",
            "verse 96:19": "نه، هرگز، از او پيروى مكن و سجده كن و به خدا نزديك شو."
        },
        "Polish": {
            "verse 96:1": "Głoś! w imię twego Pana, który stworzył!",
            "verse 96:2": "Stworzył człowieka z grudki krwi zakrzepłej!",
            "verse 96:3": "Głoś! Twój Pan jest najszlachetniejszy!",
            "verse 96:4": "Ten, który nauczył człowieka przez pióro;",
            "verse 96:5": "Nauczył człowieka tego, czego on nie wiedział.",
            "verse 96:6": "Niestety, nie! Zaprawdę, człowiek się buntuje,",
            "verse 96:7": "Ponieważ czuje się niezależnym!",
            "verse 96:8": "Zaprawdę, powrócisz przecież do twojego Pana!",
            "verse 96:9": "Czy widziałeś tego, który zabrania",
            "verse 96:10": "Słudze modlić się?",
            "verse 96:11": "Czy sądzisz, iż on jest na drodze prostej",
            "verse 96:12": "Albo że zaleca bogobojność?",
            "verse 96:13": "Czy też sądzisz, iż on za kłamstwo uznaje prawdę i odwraca się?",
            "verse 96:14": "Czyż on nie wie, że Bóg widzi?",
            "verse 96:15": "Niech się ma na baczności! Jeśli nie zaprzestanie, to, zaprawdę, pociągniemy go za kosmyk;",
            "verse 96:16": "Za kosmyk kłamliwy i grzeszny!",
            "verse 96:17": "Niech on wezwie swoich popleczników!",
            "verse 96:18": "My wezwiemy strażników!",
            "verse 96:19": "Ależ nie! Nie słuchaj go! Wybijaj pokłony i zbliż się!"
        },
        "Portuguese": {
            "verse 96:1": "Lê, em nome do teu Senhor Que criou;",
            "verse 96:2": "Criou o homem de algo que se agarra.",
            "verse 96:3": "Lê, que o teu Senhor é Generosíssimo,",
            "verse 96:4": "Que ensinou através do cálamo,",
            "verse 96:5": "Ensinou ao homem o que este não sabia.",
            "verse 96:6": "Qual! Em verdade, o homem transgride,",
            "verse 96:7": "Quando se vê rico.",
            "verse 96:8": "Sabe (ó Mensageiro) que o retorno de tudo será para o teu Senhor.",
            "verse 96:9": "Viste aquele que impede",
            "verse 96:10": "O servo (de Deus) de orar?",
            "verse 96:11": "Viste se ele está na orientação?",
            "verse 96:12": "Ou recomenda a piedade?",
            "verse 96:13": "Viste se ele nega (a verdade) e a desdenha?",
            "verse 96:14": "Ignora, acaso, que Deus o observa?",
            "verse 96:15": "Qual! Em verdade, se não se contiver, agarrá-lo-emos pelo topete,",
            "verse 96:16": "Topete de mentiras e pecados.",
            "verse 96:17": "Que chamem, então, os seus conselheiros;",
            "verse 96:18": "Chamaremos os guardiões do inferno!",
            "verse 96:19": "Qual! Não os escutes; porém, prostra-te e aproxima-te (de Deus)!"
        },
        "Punjabi": {
            "verse 96:1": "ਪੜ੍ਹੋ, ਆਪਣੇ ਰੱਬ ਦੇ ਨਾਮ ਨਾਲ, ਜਿਸ ਨੇ ਪੈਦਾ ਕੀਤਾ ਹੈ।",
            "verse 96:2": "ਮਨੁੱਖ ਨੂੰ ਅਲਕ (ਜੰਮੇ ਹੋਏ ਲਹੂ) ਤੋਂ ਪੈਦਾ ਕੀਤਾ।",
            "verse 96:3": "ਪੜ੍ਹੋ, ਤੇਰਾ ਰੱਬ ਬਹੁਤ ਕਰੀਮ ਹੈ।",
            "verse 96:4": "ਜਿਸ ਨੇ ਕਲਮ ਨਾਲ ਗਿਆਨ ਸਿਖਾਇਆ।",
            "verse 96:5": "ਮਨੁੱਖ ਨੂੰ ਉਹ ਕੂਝ ਸਿਖਾਇਆ ਜਿਹੜਾ ਉਹ ਜਾਣਦਾ ਨਹੀਂ ਸੀ।",
            "verse 96:6": "ਕਦੇ ਵੀ ਨਹੀਂ, ਮਨੁੱਖ ਬਗ਼ਾਵਤ ਕਰਦਾ ਹੈ।",
            "verse 96:7": "ਇਸ ਅਧਾਰ ਤੇ, ਕਿ ਉਹ ਆਪਣੇ ਆਪ ਨੂੰ ਆਤਮ- ਨਿਰਭਰ ਦੇਖਦਾ ਹੈ।",
            "verse 96:8": "ਬੇਸ਼ੱਕ ਤੇਰੇ ਰੱਬ ਵੱਲ ਹੀ ਵਾਪਿਸ ਮੁੜਨਾ ਹੈ।",
            "verse 96:9": "ਕੀ ਤੁਸੀਂ ਉਸ ਬੰਦੇ ਨੂੰ ਦੇਖਿਆ, ਜੋ ਮਨ੍ਹਾ ਕਰਦਾ ਹੈ।",
            "verse 96:10": "ਇੱਕ ਬੰਦੇ ਨੂੰ ਜਦੋਂ ਉਹ ਨਮਾਜ਼ ਪੜ੍ਹਦਾ ਹੋਵੇ।",
            "verse 96:11": "ਤੁਹਾਡਾ ਕੀ ਵਿਚਾਰ ਹੈ, ਜੇਕਰ ਉਹ ਸਿੱਧੇ ਰਾਹ ਤੇ ਹੋਵੇ।",
            "verse 96:12": "ਜਾਂ ਭੈਅ ਦੀਆਂ ਗੱਲਾਂ ਸਿਖਾਉਂਦਾ ਹੋਵੇ।",
            "verse 96:13": "ਤੁਹਾਡਾ ਕੀ ਵਿਚਾਰ ਹੈ, ਜੇਕਰ ਉਸ ਨੇ ਝੁਠਲਾਇਆ ਅਤੇ ਮੂੰਹ ਮੋੜਿਆ।",
            "verse 96:14": "ਕੀ ਉਸ ਨੇ ਨਹੀਂ ਸਮਝਿਆ ਕਿ ਅੱਲਾਹ ਦੇਖ ਰਿਹਾ ਹੈ।",
            "verse 96:15": "ਕਦੇ ਵੀ ਨਹੀਂ ਜੇਕਰ ਉਹ ਨਹੀਂ ਮੰਨਿਆ, ਤਾਂ ਅਸੀਂ ਮੱਥੇ ਦੇ ਵਾਲ ਪਕੜ ਕੇ ਉਸ ਨੂੰ ਖਿੱਚਾਂਗੇ।",
            "verse 96:16": "ਉਸ ਮੱਥੇ ਨੂੰ ਜਿਹੜਾ ਪਾਪੀ ਅਤੇ ਝੂਠਾ ਹੈ।",
            "verse 96:17": "ਹੁਣ ਉਹ ਸ਼ੁਲਾ ਲੈਣ ਆਪਣੇ ਸਮਰੱਥਕਾਂ ਨੂੰ।",
            "verse 96:18": "ਅਸੀਂ ਵੀ ਨਰਕ ਦੇ ਫ਼ਰਿਸ਼ਤਿਆਂ ਨੂੰ ਸੱਦਾਂਗੇ।",
            "verse 96:19": "ਕਦੇ ਵੀ ਉਸ ਦੀ ਗੱਲ ਨਾ ਮੰਨਣਾ, ਅਤੇ ਸਿਜਦਾ ਕਰ ਅਤੇ (ਅੱਲਾਹ) ਦੇ ਨੇੜੇ ਹੋ ਜਾ।"
        },
        "Roman english": {
            "verse 96:1": "Iqra bismi rab bikal lazee khalaq",
            "verse 96:2": "Khalaqal insaana min `alaq",
            "verse 96:3": "Iqra wa rab bukal akram",
            "verse 96:4": "Al lazee `allama bil qalam",
            "verse 96:5": "Al lamal insaana ma lam y`alam",
            "verse 96:6": "Kallaa innal insaana layatghaa",
            "verse 96:7": "Ar-ra aahus taghnaa",
            "verse 96:8": "Innna ilaa rabbikar ruj`aa",
            "verse 96:9": "Ara-aital lazee yanhaa",
            "verse 96:10": "Abdan iza sallaa",
            "verse 96:11": "Ara-aita in kana `alal hudaa",
            "verse 96:12": "Au amara bit taqwaa",
            "verse 96:13": "Ara-aita in kaz zaba wa ta walla",
            "verse 96:14": "Alam y`alam bi-an nal lahaa yaraa",
            "verse 96:15": "Kalla la illam yantahi la nasfa`am bin nasiyah",
            "verse 96:16": "Nasiyatin kazi batin khaatiyah",
            "verse 96:17": "Fal yad`u naadiyah",
            "verse 96:18": "Sanad `uz zabaaniyah",
            "verse 96:19": "Kalla; la tuti`hu wasjud waqtarib"
        },
        "Russian": {
            "verse 96:1": "Читай (и возгласи)! Во имя Бога твоего, Кто сотворил -",
            "verse 96:2": "Кто создал человека из сгустка.",
            "verse 96:3": "Читай! Господь твой - самый щедрый!",
            "verse 96:4": "Он - Тот, Кто (человеку дал) перо и научил письму,",
            "verse 96:5": "А также обучил тому, что он не знал.",
            "verse 96:6": "Но нет же! Преступает все пределы человек,",
            "verse 96:7": "Себе приписывая все, чем он богат и знатен.",
            "verse 96:8": "Ведь к Господу вернется все, что суще.",
            "verse 96:9": "Видал ли ты того, кто воспрещает",
            "verse 96:10": "Служителю Господнему молиться?",
            "verse 96:11": "И знаешь ты, стоит ли он на праведном пути?",
            "verse 96:12": "Иль благочестие заповедает?",
            "verse 96:13": "Видал ли ты, он истину отверг и отвернулся?",
            "verse 96:14": "Неужто Он не знает, что Аллах всевидящ?",
            "verse 96:15": "Но если он не прекратит (все это), За волосы чела Мы (оскорбительно) его потянем -",
            "verse 96:16": "Такого грешного и лживого чела!",
            "verse 96:17": "Пусть он тогда своих друзей (на помощь) призовет,",
            "verse 96:18": "Мы ж созовем Своих блюстителей порядка.",
            "verse 96:19": "Не внемли же ему, (о Мухаммад!), А преклони (колени перед Богом) И ближе подойди к Нему!"
        },
        "Sindhi": {
            "verse 96:1": "(اي پيغمبر) پنھنجي پالڻھار جي نالي سان پڙھ جنھن (سارو جڳ) خلقيو.",
            "verse 96:2": "ماڻھوءَ کي رت جي دِڳ مان بڻايائين.",
            "verse 96:3": "پڙھ ۽ تنھنجو پالڻھار ڏاڍو سڳورو آھي.",
            "verse 96:4": "جنھن (ماڻھوءَ کي علم) قلم سان سيکاريو.",
            "verse 96:5": "ماڻھوءَ کي اُھو سيکاريائين جو نه ڄاڻندو ھو.",
            "verse 96:6": "سچ آھي ته بيشڪ ماڻھو سرڪشي ڪندو آھي.",
            "verse 96:7": "جڏھن اُھو پاڻ کي بي پرواھ ڏسندو آھي.",
            "verse 96:8": "بيشڪ تنھنجي پالڻھار ڏانھن موٽي وڃڻو آھي.",
            "verse 96:9": "اُھو ڏٺو اٿئي ڇا جيڪو جھليندو آھي.",
            "verse 96:10": "(منھنجي) ٻانھي کي جڏھن اھو نماز پڙھندو آھي.",
            "verse 96:11": "ڏٺو اٿئي ڇا ته جيڪڏھن (اُھو ماڻھو) سڌي رستي تي ھجي ھا.",
            "verse 96:12": "يا پرھيزگاريءَ جو حڪم ڪري ھا.",
            "verse 96:13": "ڏٺو اٿئي ڇا ته جيڪڏھن ڪوڙ ڀانيائين ۽ پٺيرو ٿيو.",
            "verse 96:14": "ته (ھيُ) نه ڄاتائين ڇا ته الله ڏسي ٿو.",
            "verse 96:15": "ائين نه آھي! قسم آھي ته جيڪڏھن پاڻ نه پليندو، ته ضرور پيشانيءَ جي وارن کان وٺي گھلينداسونس.",
            "verse 96:16": "اُھا پيشاني جا ڪوڙي گنھگار آھي.",
            "verse 96:17": "پوءِ ڀلي ته پنھنجي ڪچھريءَ وارن کي سڏي.",
            "verse 96:18": "اسين به دوزخ جي داروغن کي سڏينداسون.",
            "verse 96:19": "ائين نه آھي، تون چيو نه مڃيس ۽ سجدو ڪر ۽ (الله کي) ويجھو ٿيءُ."
        },
        "Sinhalese": {
            "verse 96:1": "මැවූ නුඹගේ පරමාධිපතිගේ නාමයෙන් කියවනු.",
            "verse 96:2": "ඔහු මිනිසා ව ලේ කැටියෙන් මැව්වේය.",
            "verse 96:3": "නුඹ කියවනු. නුඹේ පරමාධිපති අති ගෞරවනීය.",
            "verse 96:4": "ඔහු පන්හිඳෙන් (ලිවීමට) ඉගැන්වූයේය.",
            "verse 96:5": "මිනිසාට ඔහු නොදැන සිටි දෑ ඔහු ඉගැන්වූයේය.",
            "verse 96:6": "නොඑසේය, නියත වශයෙන්ම මිනිසා සීමාව ඉක්මවා යන්නේය.",
            "verse 96:7": "තමන් ස්වාධීන යැයි ඔහු සිතන්නේය.",
            "verse 96:8": "නියත වශයෙන්ම නැවත හැරී යාම නුඹගේ පරමාධිපති වෙතය.",
            "verse 96:9": "වළක්වන අය ව නුඹ දුටුවෙහිද?",
            "verse 96:10": "ගැත්තා සලාතය ඉටු කරන විට (ඔහුව වළක්වන අය ව නුඹ දුටුවෙහිද?)",
            "verse 96:11": "ඔහු යහමඟෙහි සිටන වග නුඹ දුටුවෙහිද?",
            "verse 96:12": "නැතහොත් බිය බැතිමත්භාවය පිළිබඳ අණ කර සිටින වග (නුඹ දුටුවෙහිද?)",
            "verse 96:13": "තවද ඔහු (සත්යය) බොරු කර පිටුපාන වග නුඹ දුටුවෙහි ද?",
            "verse 96:14": "නියත වශයෙන්ම අල්ලාහ් දකින්නේ යැයි ඔහු නොදැන සිටියා ද?",
            "verse 96:15": "නොඑසේය. ඔහු එයින් නොවැළකුණේ නම් අපි ඉදිරි නළල් කෙස් රොදින් (ඔහු ව) ඇදගෙන එන්නෙමු.",
            "verse 96:16": "එනම් වැරදි කරමින් ද බොරුකරමින් ද සිටි (ඔහුගේ) නළල් කෙස් රොදිනි.",
            "verse 96:17": "එබැවින් ඔහු ඔහුගේ කැඳවුම් කරුවන් කැඳවත්වා!",
            "verse 96:18": "මතුවට අපි ද අපගේ (නිරයේ භාරකාර මලක්වරුන් වන) zසබානියාවරුන් ව කැඳවන්නෙමු.",
            "verse 96:19": "නොඑසේය. නුඹ ඔහුට අවනත නොවනු. නුඹගේ (පරමාධිපතිට) සජදා කරනු. තවද ඔහුට සමීප වනු."
        },
        "Somali": {
            "verse 96:1": "Wax ku akhri Nabiyow Magaca Eebe ee abuuray (khaliqiga).",
            "verse 96:2": "Dadkana ka abuuray Calaq.",
            "verse 96:3": "Akhri Eebana waa kan Sharafta lehe.",
            "verse 96:4": "Ee Dadka baray sida Qalinka wax loogu qoro.",
            "verse 96:5": "Dadkana baray waxayna aqoonin.",
            "verse 96:6": "Saas ma aha ee Dadku (Gaaladu) waa gudbeen.",
            "verse 96:7": "Markuu isku ogaaday Hodontinnimo.",
            "verse 96:8": "Eebaha xaggiisaase loo noqon.",
            "verse 96:9": "Ka warrama midka ka reebaya.",
            "verse 96:10": "Addoon (Eebe) oo tukan Salaadda.",
            "verse 96:11": "Bal ka warrama hadduu ka laga reebi hanuunsanyahay (waa Nabiga).",
            "verse 96:12": "Ama uu fari Eeba ka yaabid.",
            "verse 96:13": "Balse ka warrama hadduu midka wax ka reebi uu beeniyay (xaqa) kana jeedsaday (waa AbuuJahal iyo wixii la mid ahe).",
            "verse 96:14": "Miyuusan ogayn in Eebe arko.",
            "verse 96:15": "Saas ma aha ee hadduusan joogin waxaannu qaban Foodda.",
            "verse 96:16": "Food beenaleey ah ghafna badan.",
            "verse 96:17": "Ha u yeedho gargaarihiisa.",
            "verse 96:18": "Waxaanu u yeedhi Malaa'ig darane.",
            "verse 96:19": "Saas ma aha ee warkiisa ha maqlin Sujuudna una dhawow (Eebe)."
        },
        "Spanish": {
            "verse 96:1": "Lee en el nombre de tu Señor que ha creado!",
            "verse 96:2": "Ha creado al hombre de un coágulo.",
            "verse 96:3": "Lee, que tu Señor es el más Generoso!",
            "verse 96:4": "El que enseñó por medio del cálamo,",
            "verse 96:5": "enseñó al hombre lo que no sabía.",
            "verse 96:6": "Sin embargo el hombre se rebela",
            "verse 96:7": "al verse enriquecer.",
            "verse 96:8": "Es cierto que a tu Señor has de volver.",
            "verse 96:9": "Qué opinión te merece quien entorpece",
            "verse 96:10": "a un siervo mientras reza?",
            "verse 96:11": "Y si éste estuviera bien guiado,",
            "verse 96:12": "o estuviera ordenando la temerosidad?",
            "verse 96:13": "No ves cómo niega la verdad y se aparta?",
            "verse 96:14": "Es que no sabe que Allah ve?",
            "verse 96:15": "Si no deja de hacerlo, lo agarraremos por un mechón de su frente,",
            "verse 96:16": "de su frente mentirosa y transgresora.",
            "verse 96:17": "Y que llame a los suyos,",
            "verse 96:18": "que nosotros llamaremos a los ángeles rudos.",
            "verse 96:19": "Pero no! No le obedezcas, póstrate y busca proximidad."
        },
        "Swahili": {
            "verse 96:1": "Soma kwa jina la Mola wako Mlezi aliye umba,",
            "verse 96:2": "Amemuumba binaadamu kwa tone la damu,",
            "verse 96:3": "Soma! Na Mola wako Mlezi ni Karimu kushinda wote!",
            "verse 96:4": "Ambaye amefundisha kwa kalamu.",
            "verse 96:5": "Kamfundisha mtu aliyo kuwa hayajui.",
            "verse 96:6": "Kwani! Hakika mtu bila ya shaka huwa jeuri",
            "verse 96:7": "Akijiona katajirika.",
            "verse 96:8": "Hakika kwa Mola wako Mlezi ndio marejeo.",
            "verse 96:9": "Umemwona yule anaye mkataza",
            "verse 96:10": "Mja anapo sali?",
            "verse 96:11": "Umeona kama yeye yuko juu ya uwongofu?",
            "verse 96:12": "Au anaamrisha uchamngu?",
            "verse 96:13": "Umeona kama yeye akikanusha na anarudi nyuma?",
            "verse 96:14": "Hajui ya kwamba Mwenyezi Mungu anaona?",
            "verse 96:15": "Kwani! Kama haachi, tutamkokota kwa shungi la nywele!",
            "verse 96:16": "Shungi la uwongo, lenye makosa!",
            "verse 96:17": "Basi na awaite wenzake!",
            "verse 96:18": "Nasi tutawaita Mazabania!",
            "verse 96:19": "Hasha! Usimt'ii! Nawe sujudu na ujongee!"
        },
        "Swedish": {
            "verse 96:1": "LÄS I din Herres namn, Han som har skapat -",
            "verse 96:2": "skapat människan av en grodd som sätter sig fast!",
            "verse 96:3": "Läs! Din Herre är den Främste Givaren,",
            "verse 96:4": "som har lärt [människan] pennans [bruk],",
            "verse 96:5": "lärt människan vad hon inte visste!",
            "verse 96:6": "Nej, människans högmod går verkligen över alla gränser",
            "verse 96:7": "då hon tror sig vara fri från allt beroende; -",
            "verse 96:8": "till din Herre måste alla återvända.",
            "verse 96:9": "VAD ANSER du om den som vill hindra",
            "verse 96:10": "en [Guds] tjänare från att förrätta bön?",
            "verse 96:11": "Följer han vägledningen",
            "verse 96:12": "eller anbefaller han gudsfruktan?",
            "verse 96:13": "Eller anser du att han [snarare] förnekar sanningen och vänder den ryggen?",
            "verse 96:14": "Vet han inte att Gud ser [allt]",
            "verse 96:15": "Nej! Om han inte upphör [med detta] skall Vi helt visst gripa honom i luggen -",
            "verse 96:16": "luggen på hans lögnaktiga, syndiga [panna] -",
            "verse 96:17": "och låt honom då kalla på de äldstes råd;",
            "verse 96:18": "Vi skall kalla på helvetets änglavakt!",
            "verse 96:19": "Nej [Profet]! Lyd honom inte, men fall ned i tillbedjan och sök komma [din Herre] nära!"
        },
        "Tajik": {
            "verse 96:1": "Бихон ба номи Парвардигорат, ки биёфарид,",
            "verse 96:2": "одамиро аз лахтаи хуне биёфарид.",
            "verse 96:3": "Бихон! Ва Парвардигори ту арҷмандтарин аст.",
            "verse 96:4": "Худое, ки ба воситаи қалам омӯзиш дод,",
            "verse 96:5": "ба одами он чиро, ки намедонист, биёмухт.",
            "verse 96:6": "Ҳаққо, ки одами аз ҳад мегузарад,",
            "verse 96:7": "ҳар гоҳ ки хештанро тавонгар бинад.",
            "verse 96:8": "Албатта бозгашт ба сӯи Парвардигори туст.",
            "verse 96:9": "Оё дидӣ он касро, ки, манъ мекунад,",
            "verse 96:10": "бандаеро, ки намоз мехонад?",
            "verse 96:11": "Канӣ бигӯ, агар он мард бар тариқи ҳидоят бошад?",
            "verse 96:12": "Ё ба парҳезгорӣ фармон диҳад?",
            "verse 96:13": "Канӣ бигӯ, агар дурӯғ барорад ва рӯйгардон шавад?",
            "verse 96:14": "Оё надонистааст, ки Худо мебинад?",
            "verse 96:15": "Ҳаққо, ки агар бознаистад, аз мӯи пеши сараш мегирему мекашем,",
            "verse 96:16": "мӯи пеши сари дурӯғгӯи хатокорро.",
            "verse 96:17": "Пас ҳамдамони худро даъват кунад.",
            "verse 96:18": "Мо низ коргузоронидӯзахро даъват мекунем!",
            "verse 96:19": "На, ҳаргиз, аз ӯ пайравӣ макун ва саҷда куну ба Худо наздик шав! (Саҷда)."
        },
        "Tamil": {
            "verse 96:1": "(யாவற்றையும்) படைத்த உம்முடைய இறைவனின் திருநாமத்தைக் கொண்டு ஓதுவீராக.",
            "verse 96:2": "'அலக்' என்ற நிலையிலிருந்து மனிதனை படைத்தான்.",
            "verse 96:3": "ஓதுவீராக: உம் இறைவன் மாபெரும் கொடையாளி.",
            "verse 96:4": "அவனே எழுது கோலைக் கொண்டு கற்றுக் கொடுத்தான்.",
            "verse 96:5": "மனிதனுக்கு அவன் அறியாதவற்றையெல்லாம் கற்றுக் கொடுத்தான்.",
            "verse 96:6": "எனினும் நிச்சயமாக மனிதன் வரம்பு மீறுகிறான்.",
            "verse 96:7": "அவன் தன்னை (இறைவனிடமிருந்து) தேவையற்றவன் என்று காணும் போது,",
            "verse 96:8": "நிச்சயமாக அவன் மீளுதல் உம்முடைய இறைவன்பாலே இருக்கிறது.",
            "verse 96:9": "தடை செய்கிறானே (அவனை) நீர் பார்த்தீரா?",
            "verse 96:10": "ஓர் அடியாரை - அவர் தொழும்போது,",
            "verse 96:11": "நீர் பார்த்தீரா? அவர் நேர்வழியில் இருந்து கொண்டும்,",
            "verse 96:12": "அல்லது அவர் பயபக்தியைக் கொண்டு ஏவியவாறு இருந்தும்,",
            "verse 96:13": "அவரை அவன் பொய்யாக்கி, முகத்தைத் திருப்பிக் கொண்டான் என்பதை நிர் பார்த்தீரா,",
            "verse 96:14": "நிச்சயமாக அல்லாஹ் (அவனைப்) பார்க்கிறான் என்பதை அவன் அறியவில்லையா?",
            "verse 96:15": "அப்படியல்ல: அவன் விலகிக் கொள்ளவில்லையானால், நிச்சயமாக நாம் (அவனுடைய) முன்னெற்றி ரோமத்தைப் பிடித்து அவனை இழுப்போம்.",
            "verse 96:16": "தவறிழைத்து பொய்யுரைக்கும் முன்னெற்றி ரோமத்தை,",
            "verse 96:17": "ஆகவே, அவன் தன் சபையோரை அழைக்கட்டும்.",
            "verse 96:18": "நாமும் நரகக் காவலாளிகளை அழைப்போம்.",
            "verse 96:19": "(அவன் கூறுவது போலல்ல) அவனுக்கு நீர் வழிபடாதீர்; (உம் இறைவனுக்கு) ஸுஜூது செய்து (வணங்கி அவனை) நெருங்குவீராக."
        },
        "Tatar": {
            "verse 96:1": "Ий Мухәммәд г-м Коръәнне укы һәрнәрсәне халык кылучы Раббың исеме илә!",
            "verse 96:2": "Ул халык кылды кешене оешкан каннан.",
            "verse 96:3": "Укыгыл, синең Раббың – Аллаһ бик хөрмәтле вә юмарттыр.",
            "verse 96:4": "Ул – Аллаһ каләм белән язуны өйрәтте.",
            "verse 96:5": "Кешегә белмәгән нәрсәләрен өйрәтте.",
            "verse 96:6": "Юк, Без кеше өчен никадәр мәрхәмәтле һәм юмарт булсак та, тәхкыйк кеше Без куйган чиктән үтәдер, аннары азып адашадыр.",
            "verse 96:7": "Үзен Аллаһуга мохтаҗ түгел дип белеп. (Әлбәттә, кеше дөньяда һәм ахирәттә Аллаһуга мохтаҗ икәнен белсә, һич Аллаһуга каршылык кыла алмый. Фәкать Аллаһуга үзенең мохтаҗ икәнлеген белмәгән кеше Аллаһуга карышып Аңа дошман буладыр, аннары җәһәннәмгә китә.)",
            "verse 96:8": "Тәхкыйк җәза өчен кыямәт көнне кубарылып кайту Раббыңадыр.",
            "verse 96:9": "Әйә күрдеңме, берәүнең намаз укучыны намаздан тыюы тиешме, яхшы эшме?",
            "verse 96:10": "Ул Аллаһ колы – Мухәммәд г-м үзенең, иң зур бурычын үтәү өчен намаз укыганда?",
            "verse 96:11": "Әйә ул намаз укучы Аллаһ колын намаз укудан тыю дөресме, ул һәркемгә яхшылыкны гына теләүче һәм хак туры юлда булса да.",
            "verse 96:12": "Әйә ул Аллаһ колын намаз укудан тыю дөрес булырмы, ул кешеләрне Аллаһудан куркырга һәм гөнаһлардан сакланып изге гамәлләр кылырга өндәсә дә? (Әбү Җәһел бервакытны, әгәр Мухәммәднең сәҗдә кылганын күрсәм, әлбәттә, башын кисәчәкмен, дип вәгъдә кылды, һәм Мухәммәднең сәҗдә кылганын күргәч, теләген үтәргә ашыгып килде ләкин барып җитмичә, барча» әгъзалары калтыраган хәлдә кире китте. Иптәшләре: сиңа ни булды, дип сорадылар, ул: минем белән Мухәммәд арасында уттан дивар килеп чыкты аз гына янмыйча калдым, диде.)",
            "verse 96:13": "Әйә ул намаздан тыючы кәфер, үзе Аллаһ китабы Коръәнне ялган дисә дә һәм Раббысына итагать итүдән вә Аңа гыйбадәт кылудан баш тартса да, намаздан тыямы, намаздан тыярга үзен хаклы саныймы?",
            "verse 96:14": "Әйә намаздан тыючы ул кәфер белмиме Аллаһуның һәркемне күргәнен?",
            "verse 96:15": "Юк, алай кирәкмәс, намаздан тыю ни кабахәт эшдер, әгәр ул бу эшеннән туктамаса, әлбәттә, маңгай чәченнән тотып җәһәннәмгә өстерәрбез.",
            "verse 96:16": "Һәр эшне хата, ялганчы һәм зур гөнаһ кылучының маңгай чәченнән өстерәрбез. (Ул кәфер минем дусларым күп, дип мактанды.)",
            "verse 96:17": "Ул намаздан тыючы кәфер, чакырсын үзенең ярдәмчеләрен!",
            "verse 96:18": "Без тиздән ґәзаб фәрештәләрен чакырырбыз, аларны җәһәннәмгә өстерәрбез.",
            "verse 96:19": "Юк, кирәкмәс, намаздан тыю бик яман кабахәт эштер, аңа итагать итмә сүзенә колак салма, сәҗдә кыл, намаз укы һәм Аллаһуга ятсын булуны кәсеп ит! (Беренче иңгән бу сүрәдә үк Аллаһ намаз укырга әмер бирде. Чөнки намаздан башка иман да, дин дә юк. Намаз – диннең йөрәге һәм башыдыр.)"
        },
        "Telugu": {
            "verse 96:1": "చదువు! నీ ప్రభువు పేరుతో, ఆయనే (సర్వాన్ని) సృష్టించాడు",
            "verse 96:2": "ఆయనే మానవుణ్ణి రక్తముద్దతో (జీవకణంతో) సృష్టించాడు",
            "verse 96:3": "చదువు! మరియు నీ ప్రభువు పరమదాత",
            "verse 96:4": "ఆయన కలం ద్వారా నేర్పాడు",
            "verse 96:5": "మానవుడు ఎరుగని జ్ఞానాన్ని అతనికి బోధించాడు",
            "verse 96:6": "అలా కాదు! వాస్తవానికి, మానవుడు తలబిరుసుతనంతో ప్రవర్తిస్తాడు",
            "verse 96:7": "ఎందుకంటే, అతడు తనను తాను నిరపేక్షాపరుడిగా భావిస్తాడు",
            "verse 96:8": "నిశ్చయంగా నీ ప్రభువు వైపునకే (అందరికీ) మరలి పోవలసి ఉంది",
            "verse 96:9": "నీవు నిరోధించే వ్యక్తిని చూశావా",
            "verse 96:10": "నమాజ్ చేసే (అల్లాహ్) దాసుణ్ణి",
            "verse 96:11": "ఒకవేళ అతను (ముహమ్మద్!) సన్మార్గంపై ఉంటే నీ అభిప్రాయమేమిటి",
            "verse 96:12": "ఇంకా, దైవభీతిని గురించి ఆదేశిస్తూ ఉంటే",
            "verse 96:13": "ఒకవేళ (ఆ నిరోధించే) వాడు సత్యాన్ని తిరస్కరించేవాడు మరియు సన్మార్గం నుండి విముఖుడయ్యేవాడైతే",
            "verse 96:14": "వాస్తవానికి, అల్లాహ్ అంతా చూస్తున్నాడని అతనికి తెలియదా",
            "verse 96:15": "అలా కాదు! ఒకవేళ అతడు మానుకోకపోతే, మేము అతడిని, నుదుటి జుట్టు వెంట్రుకలను పట్టి ఈడుస్తాము",
            "verse 96:16": "అది అబద్ధాలలో, అపరాధాలలో మునిగివున్న నుదురు",
            "verse 96:17": "అయితే, అతన్ని తన అనుచరులను పిలుచుకోమను",
            "verse 96:18": "మేము కూడా నరక దూతలను పిలుస్తాము",
            "verse 96:19": "అలా కాదు! నీవు అతని మాట వినకు మరియు ఆయనే (అల్లాహ్ కే) సాష్టాంగం (సజ్దా) చెయ్యి మరియు ఆయన (అల్లాహ్) సాన్నిధ్యాన్ని పొందటానికి ప్రయత్నించు"
        },
        "Thai": {
            "verse 96:1": "จงอ่านด้วยพระนามแห่งพระเจ้าของเจ้าผู้ทรงบังเกิด",
            "verse 96:2": "ทรงบังเกิดมนุษย์จากก้อนเลือด",
            "verse 96:3": "จงอ่านเถิด และพระเจ้าของเจ้านั้นผู้ทรงใจบุญยิ่ง",
            "verse 96:4": "ผู้ทรงสอนการใช้ปากกา",
            "verse 96:5": "ผู้ทรงสอนมนุษย์ในสิ่งที่เขาไม่รู้",
            "verse 96:6": "มิใช่เช่นนั้นแท้จริงมนุษย์นั้น ย่อมจะละเมิดขอบเขต",
            "verse 96:7": "เนื่องเพราะเขาคิดว่าเขาพอเพียงแล้ว",
            "verse 96:8": "แท้จริงยังพระเจ้าของเจ้าเท่านั้นคือ การกลับไป",
            "verse 96:9": "เจ้าเห็นแล้วมิใช่หรือ ผู้ที่ขัดขวาง",
            "verse 96:10": "บ่าวคนหนึ่ง เมื่อเขากำลังละหมาด",
            "verse 96:11": "เจ้าคิดบ้างไหมว่า หากบ่าวผู้นั้นอยู่บนแนวทางที่ถูกต้อง",
            "verse 96:12": "หรือใช้ให้ผู้คนมีความยำเกรง",
            "verse 96:13": "เจ้าคิดบ้างไหมว่า หากเขาปฏิเสธ และผินหลังให้",
            "verse 96:14": "เขาไม่รู้ดอกหรือว่า แท้จริงอัลลอฮฺ นั้นทรงเห็น",
            "verse 96:15": "มิใช่เช่นนั้น ถ้าเขายังไม่หยุดยั้ง เราจะจิกเขาที่ขม่อมอย่างแน่นอน",
            "verse 96:16": "ขม่อมที่โกหกที่ประพฤติชั่ว",
            "verse 96:17": "แล้วให้เขาเรียกที่ประชุมของเขา",
            "verse 96:18": "เราก็จะเรียกผู้คุมนรก",
            "verse 96:19": "มิใช่เช่นนั้น เจ้าอย่าได้เชื่อฟังมัน แต่จงสุญูด และเข้า"
        },
        "Turkish": {
            "verse 96:1": "Yaratan Rabbinin adıyla oku!",
            "verse 96:2": "O, insanı pıhtılaşmış kandan (alak'tan) yarattı.",
            "verse 96:3": "Oku! Kalemle öğreten, insana bilmediğini bildiren Rabbin, en büyük kerem sahibidir.",
            "verse 96:4": "Oku! Kalemle öğreten, insana bilmediğini bildiren Rabbin, en büyük kerem sahibidir.",
            "verse 96:5": "Oku! Kalemle öğreten, insana bilmediğini bildiren Rabbin, en büyük kerem sahibidir.",
            "verse 96:6": "Ama, insanoğlu kendini müstağni sayarak azgınlık eder.",
            "verse 96:7": "Ama, insanoğlu kendini müstağni sayarak azgınlık eder.",
            "verse 96:8": "Dönüş şüphesiz Rabbinedir.",
            "verse 96:9": "Sen, namaz kılan kulu bundan menedeni gördün mü?",
            "verse 96:10": "Sen, namaz kılan kulu bundan menedeni gördün mü?",
            "verse 96:11": "Söyle bakalım, o kul doğru yolda giden veya Allah'a karşı gelmekten sakınmayı buyuran bir kimse olsun; veya söyle, yalanlayıp yüz çeviren birisi olsun",
            "verse 96:12": "Söyle bakalım, o kul doğru yolda giden veya Allah'a karşı gelmekten sakınmayı buyuran bir kimse olsun; veya söyle, yalanlayıp yüz çeviren birisi olsun",
            "verse 96:13": "Söyle bakalım, o kul doğru yolda giden veya Allah'a karşı gelmekten sakınmayı buyuran bir kimse olsun; veya söyle, yalanlayıp yüz çeviren birisi olsun",
            "verse 96:14": "Allah'ın her şeyi görmekte olduğunu bilmez mi?",
            "verse 96:15": "Ama bundan vazgeçmezse, and olsun ki, onu perçeminden,",
            "verse 96:16": "Yalancı ve günahkar perçeminden cehenneme sürükleriz.",
            "verse 96:17": "O zaman, kafadarlarını çağırsın,",
            "verse 96:18": "Biz de zebanileri çağıracağız.",
            "verse 96:19": "Sakın ona uyma; sen secde et, Rabbine yaklaş."
        },
        "Urdu": {
            "verse 96:1": "(اے محمدﷺ) اپنے پروردگار کا نام لے کر پڑھو جس نے (عالم کو) پیدا کیا",
            "verse 96:2": "جس نے انسان کو خون کی پھٹکی سے بنایا",
            "verse 96:3": "پڑھو اور تمہارا پروردگار بڑا کریم ہے",
            "verse 96:4": "جس نے قلم کے ذریعے سے علم سکھایا",
            "verse 96:5": "اور انسان کو وہ باتیں سکھائیں جس کا اس کو علم نہ تھا",
            "verse 96:6": "مگر انسان سرکش ہو جاتا ہے",
            "verse 96:7": "جب کہ اپنے تیئں غنی دیکھتا ہے",
            "verse 96:8": "کچھ شک نہیں کہ (اس کو) تمہارے پروردگار ہی کی طرف لوٹ کر جانا ہے",
            "verse 96:9": "بھلا تم نے اس شخص کو دیکھا جو منع کرتا ہے",
            "verse 96:10": "(یعنی) ایک بندے کو جب وہ نماز پڑھنے لگتا ہے",
            "verse 96:11": "بھلا دیکھو تو اگر یہ راہِ راست پر ہو",
            "verse 96:12": "یا پرہیز گاری کا حکم کرے (تو منع کرنا کیسا)",
            "verse 96:13": "اور دیکھو تو اگر اس نے دین حق کو جھٹلایا اور اس سے منہ موڑا (تو کیا ہوا)",
            "verse 96:14": "کیااس کو معلوم نہیں کہ خدا دیکھ رہا ہے",
            "verse 96:15": "دیکھو اگر وہ باز نہ آئے گا تو ہم (اس کی) پیشانی کے بال پکڑ گھسیٹیں گے",
            "verse 96:16": "یعنی اس جھوٹے خطاکار کی پیشانی کے بال",
            "verse 96:17": "تو وہ اپنے یاروں کی مجلس کو بلالے",
            "verse 96:18": "ہم بھی اپنے موکلانِ دوزخ کو بلا لیں گے",
            "verse 96:19": "دیکھو اس کا کہا نہ ماننا اور قربِ (خدا) حاصل کرتے رہنا"
        },
        "Uyghur": {
            "verse 96:1": "ياراتقان پەرۋەردىگارىڭنىڭ ئىسمى بىلەن ئوقۇغىن",
            "verse 96:2": "ئۇ ئىنساننى لەختە قاندىن ياراتتى",
            "verse 96:3": "ئوقۇغىن، پەرۋەردىگارىڭ ئەڭ كەرەملىكتۇر",
            "verse 96:4": "ئۇ قەلەم بىلەن (خەت يېزىشنى) ئۆگەتتى",
            "verse 96:5": "ئىنسانغا بىلمىگەن نەرسىلەرنى بىلدۈردى",
            "verse 96:6": "شەك - شۈبھىسىز ئىنسان ئۆزىنى باي ساناپ (اﷲ قا بويسۇنۇشتىن باش تارتىپ)، راستلا ھەددىدىن ئاشىدۇ",
            "verse 96:7": "شەك - شۈبھىسىز ئىنسان ئۆزىنى باي ساناپ (اﷲ قا بويسۇنۇشتىن باش تارتىپ)، راستلا ھەددىدىن ئاشىدۇ",
            "verse 96:8": "(ئى ئىنسان!) بارىدىغان يېرىڭ پەرۋەردىگارىڭنىڭ دەرگاھىدۇر (قىلمىشىڭغا قاراپ جازاغا ياكى مۇكاپاتقا ئېرىشىسەن)",
            "verse 96:9": "ناماز ئوقۇۋاتقان بەندىنى (يەنى مۇھەممەد ئەلەيھىسسالامنى) توسقان ئادەمنىڭ (ھالىنى) ماڭا ئېيتىپ بەرسەڭچۇ؟",
            "verse 96:10": "ناماز ئوقۇۋاتقان بەندىنى (يەنى مۇھەممەد ئەلەيھىسسالامنى) توسقان ئادەمنىڭ (ھالىنى) ماڭا ئېيتىپ بەرسەڭچۇ؟",
            "verse 96:11": "ماڭا (ئۇنىڭ ھالىنى) ئېيتىپ بەرسەڭچۇ؟ ئەگەر ئۇ (ھەددىدىن ئاشقۇچى) (نامازنى توسۇشنىڭ ئورنىغا) توغرا يولدا بولغان بولسا،",
            "verse 96:12": "ياكى تەقۋادارلىققا ئەمر قىلغان بولسا (بۇ ئۇنىڭ ئۆزى ئۈچۈن ياخشى بولماسمىدى؟)",
            "verse 96:13": "ماڭا ئېيتىپ بەرسەڭچۇ؟ ئەگەر ئۇ (قۇرئاننى) ئىنكار قىلسا، ئىماندىن (يۈز ئۆرۈسە)،",
            "verse 96:14": "اﷲ نىڭ (ئۇنى) كۆرۈپ تۇرىدىغانلىقىنى بىلمىدىمۇ؟",
            "verse 96:15": "ئۇ گۇمراھلىقتىن يانسۇن، ئەگەر ئۇ بۇنىڭدىن يانمىسا، چوقۇم ئۇنىڭ كوكۇلىسىدىن - يالغانچى گۇناھكارنىڭ كوكۇلىسىدىن تۇتۇپ (جەھەننەمگە) سۆرەيمىز",
            "verse 96:16": "ئۇ گۇمراھلىقتىن يانسۇن، ئەگەر ئۇ بۇنىڭدىن يانمىسا، چوقۇم ئۇنىڭ كوكۇلىسىدىن - يالغانچى گۇناھكارنىڭ كوكۇلىسىدىن تۇتۇپ (جەھەننەمگە) سۆرەيمىز",
            "verse 96:17": "ئۇ ئۆزىنىڭ سورۇنداشلىرىنى ياردەمگە چاقىرسۇن!",
            "verse 96:18": "بىز زابانىيىلەر (يەنى جەھەننەمنىڭ كۈچلۈك - قاتتىق قول پەرىشتىلىرى) نى چاقىرىمىز",
            "verse 96:19": "(بۇ فاجىر گۇمراھلىقتىن) يانسۇن! ئۇنىڭغا ئىتائەت قىلمىغىن، (اﷲ قا) سەجدە قىلغىن (شۇنىڭ بىلەن اﷲ قا) يېقىنلىق ھاسىل قىلغىن"
        },
        "Uzbek": {
            "verse 96:1": "Яратган Роббинг номи билан ўқи.",
            "verse 96:2": "У инсонни алақдан яратди.",
            "verse 96:3": "Ўқи! Ва Роббинг энг карамлидир!",
            "verse 96:4": "У қалам билан илм ўргатгандир.",
            "verse 96:5": "У инсонга у билмаган нарсани ўргатди.",
            "verse 96:6": "Йўқ! Албатта инсон туғёнга кетадир.",
            "verse 96:7": "Ўзини бой кўргани учун.",
            "verse 96:8": "Албатта, қайтиб бориш Роббингадир.",
            "verse 96:9": "Қайтарганни кўрдингми?!",
            "verse 96:10": "Бандани намоз ўқиётганида?!",
            "verse 96:11": "Айт-чи, агар ўша ҳидоятда бўлса.",
            "verse 96:12": "Ёки тақвога амр қилса.",
            "verse 96:13": "Айт-чи, ўша ёлғонга чиқарса ва юз ўгирса.",
            "verse 96:14": "Албатта Аллоҳ уни кўришини билмасми?!",
            "verse 96:15": "Йўқ! Агар қайтмаса, пешонасидан шиддатла тутамиз.",
            "verse 96:16": "Ёлғончи, хатокор пешонасидан.",
            "verse 96:17": "Бас, ўз тўпини чақирсин.",
            "verse 96:18": "Биз ҳам забонияларни чақирамиз.",
            "verse 96:19": "Йўқ! Сен унга итоат қилма! Сажда қил ва қурбат ҳосил қил."
        },
        "Vietnamese": {
            "verse 96:1": "Hãy đọc! Nhân danh Thượng Đế của Ngươi, Đấng đã tạo.",
            "verse 96:2": "Đấng đã tạo ra con người từ một cục máu.",
            "verse 96:3": "Hãy đọc! Quả thật, Thượng Đế của Ngươi là Đấng Quảng Đại.",
            "verse 96:4": "Đấng đã dạy bằng cây viết.",
            "verse 96:5": "Đấng đã dạy con người điều y không biết.",
            "verse 96:6": "Không! Quả thật, con người thường vượt quá giới hạn.",
            "verse 96:7": "Vì y tự thấy mình giàu có và đầy đủ.",
            "verse 96:8": "Chắc chắn y sẽ quay về với Thượng Đế của y.",
            "verse 96:9": "Ngươi có thấy kẻ (Abu Jahal) đã ngăn cản",
            "verse 96:10": "Người bề tôi (Muhammad) dâng lễ nguyện Salah không?",
            "verse 96:11": "Ngươi thấy hắn là kẻ được hướng dẫn ư?",
            "verse 96:12": "Hoặc hắn là kẻ khuyên bảo người khác sợ (Allah) chăng?",
            "verse 96:13": "Ngươi có thấy hắn là kẻ đã phủ nhận và quay lưng với sự thật không?",
            "verse 96:14": "Có phải hắn tưởng rằng Allah không nhìn thấy hắn chăng?",
            "verse 96:15": "Không! Nếu hắn không chịu dừng lại (hành động phá rối), chắc chắn TA sẽ nắm lấy chùm tóc trên trán của hắn.",
            "verse 96:16": "Một chùm tóc dối trá và tội lỗi.",
            "verse 96:17": "Vì vậy, hãy để mặc hắn kêu gọi bè lũ của hắn.",
            "verse 96:18": "TA sẽ gọi các cảnh vệ Hỏa Ngục.",
            "verse 96:19": "Không! Ngươi (Thiên Sứ Muhammad) đừng nghe theo hắn, hãy cúi đầu quỳ lạy (Allah) và hãy đến gần (Ngài)!"
        },
        "Yoruba": {
            "verse 96:1": "Ke (al-Ƙur’an) pelu oruko Oluwa re, Eni ti O da eda",
            "verse 96:2": "O seda eniyan lati ara eje didi",
            "verse 96:3": "Ke e. Oluwa re ni Alapon-onle julo",
            "verse 96:4": "Eni ti O fi imo nipa gege ikowe mo eniyan",
            "verse 96:5": "O fi imo ti eniyan ko mo mo on",
            "verse 96:6": "Ni ti ododo, dajudaju eniyan kuku n tayo enu-ala",
            "verse 96:7": "nitori pe o rira re ni oloro",
            "verse 96:8": "Dajudaju odo Oluwa re ni abo eda",
            "verse 96:9": "So fun mi nipa eni t’o n ko",
            "verse 96:10": "fun erusin kan nigba ti (erusin naa) kirun",
            "verse 96:11": "So fun mi (nipa esan re) ti o ba je pe o wa lori imona (’Islam)",
            "verse 96:12": "tabi pe o pase iberu (Allahu)",
            "verse 96:13": "So fun mi (nipa iya re) ti o ba je pe o pe ododo niro, ti o si keyin si i",
            "verse 96:14": "Se ko mo pe dajudaju Allahu n ri (oun ni)",
            "verse 96:15": "Bee ni (Allahu n ri i.) Dajudaju ti ko ba jawo (nibi didi i lowo), dajudaju A maa fi aaso ori re wo o (sinu Ina)",
            "verse 96:16": "aaso ori opuro, elese",
            "verse 96:17": "Nitori naa, ki o pe awon olubajokoo re",
            "verse 96:18": "Awa maa pe awon molaika eso Ina",
            "verse 96:19": "Rara o, ma se tele tire. Fori kanle (ki o kirun), ki o sunmo (Allahu)"
        }
    }
}