{
    "name": "Al-Fatihah",
    "id": 1,
    "verse-count": 7,
    "verse-info": [
        {
            "verse-id": "[1:1]",
            "verse": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
            "description": [
                "One of the many practices taught by",
                " Islam is that its followers should begin",
                " their activities in the name of God.",
                " This principle, if consciously and earnestly followed,",
                " will necessarily yield three beneficial results. First,",
                " one will be able to restrain oneself",
                " from many misdeed, since the habit of",
                " pronouncing the name of God is bound",
                " to make one wonder when about to",
                " commit some offence how such an act",
                " can be reconciled with the saying of",
                " God's holy name. Second, if a man",
                " pronounces the name of God before starting",
                " good and legitimate tasks, this act will",
                " ensue that both his starting point and",
                " his mental orientation are sound. Third -",
                " and this is the most important benefit",
                " - when a man begins something by",
                " pronouncing God's name, he will enjoy God's",
                " support and succour; God will bless his",
                " efforts and protect him from the machinations",
                " and temptation of Satan. For whenever man",
                " turns to God, God turns to him",
                " as well."
            ]
        },
        {
            "verse-id": "[1:2]",
            "verse": "[All] praise is [due] to Allah, Lord of the worlds -",
            "description": [
                "As we have already explained, the character",
                " of this surah is that of a",
                " prayer. The prayer begins with praise of",
                " the One to whom our prayer is",
                " addressed. This indicates that whenever one prays",
                " one ought to pray in a dignified",
                " manner. It does not become a cultivated",
                " person to blurt out his petition. Refinement",
                " demands that our requests should be preceded",
                " by a wholehearted acknowledgement of the unique",
                " position, infinite benevolence and unmatched excellence of",
                " the One to Whom we pray. Whenever",
                " we praise someone, we do so for",
                " two reasons. First, because excellence calls for",
                " praise, irrespective of whether that excellence has",
                " any direct relevance to us or not.",
                " Second, we praise one who, we consider",
                " to be our benefactor; when this is",
                " the case our praise arises from a",
                " deep feeling of gratitude. God is worthy",
                " of praise on both counts. It is",
                " incumbent on us to praise Him not",
                " only in recognition of His infinite excellence",
                " but also because of our feeling of",
                " gratitude to Him, arising from our awareness",
                " of the blessings He has lavished upon",
                " us. It is important to note that",
                " what is said here is not merely",
                " that praise be to God, but that",
                " all praise be to God alone. Whenever",
                " there is any beauty, any excellence, any",
                " perfection-in whatever thing or in whatever shape",
                " it may manifest itself- its ultimate source",
                " is none other than God Himself. No",
                " human beings, angels, Demigods, heavenly bodies-in short,",
                " no created beings-are possessed of an innate",
                " excellence; where excellence exists, it is a",
                " gift from God. Thus, if there is",
                " anyone at all whom we ought to",
                " adore and worship, to whom we ought",
                " to feel indebted and grateful, towards whom",
                " we should remain humble and obedient, it",
                " is the creator of excellence, rather than",
                " its possessor.",
                "*3). In Arabic the word",
                " Rabb has three meanings: (i) Lord and",
                " Master; (ii) Sustainer, Provider, Supporter, Nourisher and",
                " Guardian, and (iii) Sovereign, Ruler, He Who",
                " controls and directs. God is the Rabb",
                " of the universe in all three meanings",
                " of the term."
            ]
        },
        {
            "verse-id": "[1:3]",
            "verse": "The Entirely Merciful, the Especially Merciful,",
            "description": [
                "Whenever we are deeply impressed by the",
                " greatness of something we try to express",
                " our feelings by using superlatives. If the",
                " use of one superlative does not do",
                " full justice to our feelings, we tend",
                " to re-emphasize the extraordinary excellence of the",
                " object of our admiration by adding a",
                " second superlative of nearly equivalent meaning.* This",
                " would seem to explain the use of",
                " the word Rahim following Rahman. The form",
                " of the word Rahman connotes intensity. Yet",
                " God's mercy and beneficence towards His creatures",
                " is so great, so extensive and of",
                " such an infinite nature that no one",
                " word, however strong its connotation, can do",
                " it full justice. The epithet Rahim was",
                " therefore added to that of Rahman."
            ]
        },
        {
            "verse-id": "[1:4]",
            "verse": "Sovereign of the Day of Recompense.",
            "description": [
                "God will be the Lord of the",
                " Day when all generations of mankind gather",
                " together on order to render an account",
                " of their conduct, and when each person",
                " will be finally rewarded or punished for",
                " his deeds. The description of God as",
                " Lord of the Day of Judgement following",
                " the mention of his benevolence and compassion",
                " indicates that we ought to remember another",
                " aspect of God as well-namely, that He",
                " will judge us all, that He is",
                " so absolutely powerful, that on the Day",
                " of Judgement no one will have the",
                " power either to resist the enforcement of",
                " punishments that He decrees or to prevent",
                " anyone from receiving the rewards that He",
                " decides to confer. Hence, we ought not",
                " only to love Him for nourishing and",
                " sustaining us and for His compassion and",
                " mercy towards us, but should also hold",
                " Him in awe because of His justice,",
                " and should not forget that our ultimate",
                " happiness or misery rests completely with Him.",
                ""
            ]
        },
        {
            "verse-id": "[1:5]",
            "verse": "It is You we worship and You we ask for help.",
            "description": [
                "The term ibadah is used in three",
                " sense: (i) worship and adoration; (ii) obedience",
                " and submission; and (iii) service and subjection.",
                " In this particular context the term carries",
                " all these meanings simultaneously. In other words,",
                " we say to God that we worship",
                " and adore Him, that we are obedient",
                " to Him and follow His will, and",
                " also that we are His servants. Moreover",
                " man is so bound to none save",
                " God, that none but He, may be",
                " the subject of man's worship and total",
                " devotion, of man's unreserved obedience, of man's",
                " absolute subjection and servitude.",
                "*7). Not only",
                " do we worship God, but our relationship",
                " with Him is such that we turn",
                " to Him alone for help and succour.",
                " We know that He is the Lord",
                " of the whole universe and that He",
                " alone is the Master of all blessings",
                " and benefactions. Hence, in seeking the fulfilment",
                " of our needs we turn to Him",
                " alone. It is towards Him alone that",
                " we stretch forth our hands when we",
                " pray and supplicate. It is in Him",
                " that we repose our trust. It is",
                " therefore to Him alone that we address",
                " our request for true guidance."
            ]
        },
        {
            "verse-id": "[1:6]",
            "verse": "Guide us to the straight path -",
            "description": [
                "We beseech God to guide us in",
                " all walks of life to a way",
                " which is absolutely true, which provides us",
                " with a properly-based outlook and sound principles",
                " of behaviour, a way which will prevent",
                " our succumbing to false doctrines and adopting",
                " unsound principles of conduct, a way that",
                " will lead us to our true salvation",
                " and happiness. This is man's prayer to",
                " God as he begins the study of",
                " the Qur'an. It is, in short, to",
                " illuminate the truth which he often tends",
                " to lose in a labyrinth of philosophical",
                " speculation; to enlighten him as to which",
                " of the numerous ethical doctrines ensures a",
                " sound course of conduct; to show which",
                " of the myriad ways and by-ways is",
                " the clear, straight, open road of sound",
                " belief and right behaviour."
            ]
        },
        {
            "verse-id": "[1:7]",
            "verse": "The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.",
            "description": [
                "This defines the 'straight way' which we",
                " ask God to open to us. It",
                " is the way which has always been",
                " followed by those who have enjoyed God's",
                " favours and blessings. This is the way",
                " which has been trodden from the beginning",
                " of time by all those individuals and",
                " communities that have unfailingly enjoyed God's favours",
                " and blessings.",
                "*10). This makes it clear",
                " that the recipients of God's favour are",
                " not those who appear, briefly, to enjoy",
                " worldly prosperity and success; all too often,",
                " these people are among those whom God",
                " has condemned because they have lost sight",
                " of the true path of salvation and",
                " happiness. This negative explanation makes it quite",
                " clear that in'am (favour) denotes all those",
                " real and abiding favours and blessings which",
                " one receives in reward for righteous conduct",
                " through God's approval and pleasure, rather than",
                " those apparent and fleeting favours which the",
                " Pharaohs, Nimrods and Korahs (Qaruns) used to",
                " receive in the past, and which are",
                " enjoyed even today by people notorious for",
                " oppression, evil and corruption."
            ]
        }
    ]
}