{
    "name": "Yunus",
    "verse-count": 109,
    "verse-info": [
        {
            "id": "[10:1]",
            "verse": "Alif, Lam, Ra. These are the verses of the wise Book",
            "description": [
                "This introductory statement carries a subtle note",
                " of warning. For the unbelievers, out of",
                " their sheer stupidity looked upon the Qur'an",
                " which was presented to them by the",
                " Prophet (peace be on him) as merely",
                " a literary masterpiece, an embodiment of spellbinding",
                " poetic imagination, a fascinating discourse on a",
                " very sublime, illusive plane in the manner",
                " of soothsayers. The unbelievers are told that",
                " such notions are pure misconceptions. On the",
                " contrary, the Qur'anic verses are part of",
                " a Book which abounds in wisdom. Hence,",
                " if they disregard the Qur'an, they are",
                " merely depriving themselves of a treasure-house of",
                " wisdom."
            ]
        },
        {
            "id": "[10:2]",
            "verse": "Have the people been amazed that We revealed [revelation] to a man from among them, [saying], \"Warn mankind and give good tidings to those who believe that they will have a [firm] precedence of honor with their Lord\"? [But] the disbelievers say, \"Indeed, this is an obvious magician.\"",
            "description": [
                "The unbelievers are asked why they are",
                " astonished that a human being has been",
                " designated to warn other human beings. Would",
                " it have been reasonable to designate some",
                " angel Jinn or animal rather than a",
                " human being to warn other human beings?",
                " Similarly, is there anything weird or exotic",
                " about the appointment of a Prophet? For",
                " if people are found engrossed in error",
                " and are oblivious to the truth, what",
                " then is truly strange: that their Creator",
                " and Lord should make arrangements to guide",
                " them or let them continue stumbling in",
                " their error? And if Divine Guidance is",
                " made available to human beings, does it",
                " not stand to reason that it is",
                " those who follow, rather than those who",
                " reject it, that deserve to be held",
                " in honour and esteem? Those who express",
                " their astonishment at this should reconsider what",
                " it is that truly merits astonishment.",
                "*3).",
                " The unbelievers' allegation that the Prophet (peace",
                " be on him) is a sorcerer is",
                " devoid of even an iota of truth.",
                " The mere fact that a person, by",
                " dint of his capacity to express himself",
                " effectively, influences people and captivates their hearts",
                " and minds does not warrant being called",
                " a sorcerer. What is worth considering is",
                " the purpose for which he employs his",
                " oratorical skill, and the kind of influence",
                " that his oration has on the audience.",
                " Any orator who uses his skill for",
                " an evil purpose will naturally be considered",
                " a demagogue, an unbridled and irresponsible speaker.",
                " For his only interest lies in casting",
                " a spell over his audience, even if",
                " he might have to resort to making",
                " false and exaggerated statements or saying things",
                " that are altogether unjust.",
                "The discourse of",
                " such speakers is bereft of all wisdom.",
                " For all it aims to do is",
                " to hoodwink and bamboozle the gullible masses.",
                " Such speakers have no coherent set of",
                " ideas to offer. What they say is",
                " full of contradiction and incoherence. Such speakers",
                " lack moderation and lean towards extremism. For",
                " their purpose is to prove their capacity",
                " to spellbind their audiences by verbal flamboyance",
                " or to intoxicate them with inflammatory eloquence",
                " in order to pit one group against",
                " another. Such oratory is not conducive to",
                " moral improvement, and the lives of the",
                " audience are by no means reformed. Neither",
                " does the eloquence of such speakers bring",
                " about any healthy change in the outlook",
                " of the audience nor in the quality",
                " of their lives. In fact, such eloquence",
                " may even have an evil and corrupting",
                " influence. In sharp contrast to all this,",
                " the Prophet's oration is characterized by wisdom",
                " and coherence, balance and moderation of the",
                " highest order, and strict adherence to the",
                " truth. Each word of the Prophet (peace",
                " be on him) is pregnant with purposiveness",
                " and manifests a keen sense of proportion.",
                " In addition, all his oration is directed",
                " to just on e purpose - to",
                " guide and reform mankind. In all that",
                " he says there is no trace of",
                " any concern for worldly interests - personal,",
                " familial or national. He only warns people",
                " against the evil consequences of their heedlessness",
                " and invites them to something that would",
                " lead to their own well-being. Furthermore, the",
                " effect of the Prophet's oration on his",
                " audience is radically different from that of",
                " sorcerers. For, all those who accept the",
                " Prophet's message undergo a change for the",
                " better; their moral conduct improves, and all",
                " in all they become oriented to righteousness",
                " and benevolence. It was, therefore, for the",
                " Prophet's detractors to consider whether sorcerers achieve",
                " such results and whether their professional skills",
                " are directed towards such noble purposes."
            ]
        },
        {
            "id": "[10:3]",
            "verse": "Indeed, your Lord is Allah, who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter [of His creation]. There is no intercessor except after His permission. That is Allah, your Lord, so worship Him. Then will you not remember?",
            "description": [
                "There is no reason to believe that",
                " after having created everything God chose to",
                " consign Himself to the limbo of unconcern.",
                " On the contrary, after His great act",
                " of creation He established Himself on the",
                " Throne and holds the reins of the",
                " entire universe so that He not only",
                " reigns but in fact also effectively rules",
                " over the universe. The Qur'an considers it",
                " a colossal error - an error to",
                " which the ignorant have succumbed - to",
                " believe that after creating the universe God",
                " either left it to run on its",
                " own, or entrusted its affairs to others",
                " to govern it as they please. On",
                " the contrary, the Qur'an emphasizes that it",
                " is God Who is directing all the",
                " affairs of His creation; that all power",
                " effectively rests with Him alone. The Qur'an",
                " constantly drives home the point that God",
                " alone has all authority so that all",
                " that takes place in the universe or",
                " in any part of it takes place",
                " by His command or His leave. God's",
                " relationship with the universe is not simply",
                " that He created it; rather the reins",
                " of the universe are with Him and",
                " He is in effective and continual control",
                " of its affairs. It is He alone",
                " Who keeps the universe in existence and",
                " it is He alone Who directs it",
                " as He pleases. {See Towards Understanding the",
                " Qur'an, vol. III, al-A'raf, nn. 41-2, pp.",
                " 33-4.)",
                "*5). No one is in a",
                " position to interfere with God in His",
                " governance of the universe, or has the",
                " power to effectively intercede with God on",
                " anyone else's behalf and to prevail upon",
                " Him to change any of His decisions.",
                " Nor is anyone in such a position",
                " of power with God that his intercession",
                " would make or unmake anyone else's destiny.",
                " The utmost that a person can do",
                " is to pray to God. However, the",
                " acceptance or non-acceptance of such prayers rests",
                " solely with Him. No one is so",
                " powerful that his desire will, of necessity,",
                " always prevail with God, nor does anyone's",
                " intercession bind God to act according to",
                " the former's desire.",
                "*6). After emphasizing the",
                " given fact of God's lordship in the",
                " first part of the verse, man is",
                " now informed of its logical consequences. Since",
                " all authority rests solely with God, it",
                " is incumbent upon man to serve Him",
                " exclusively. God's lordship embraces the three-fold attributes",
                " of His being",
                "(i) the Sustainer,",
                "(ii)",
                " the Master, and",
                "(iii) the Sovereign.",
                "In",
                " like manner, the term 'ibadah embraces the",
                " three-fold corresponding implications that man should",
                "(i)worship,",
                "",
                "(ii) serve, and",
                "(iii) obey God.",
                "*7).",
                " Since man has been informed of the",
                " fundamental truths and has been shown the",
                " right way, there is no justification for",
                " him to remain engrossed in those false",
                " conceptions which have caused him to act",
                " in a manner altogether inconsistent with the",
                " reality."
            ]
        },
        {
            "id": "[10:4]",
            "verse": "To Him is your return all together. [It is] the promise of Allah [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny.",
            "description": [
                "The Prophet's teachings comprise two fundamental doctrines:",
                " (i) that God alone is man's Lord",
                " and hence man should worship Him, and",
                " (ii) that man is bound to return",
                " to his Lord in the Next Life",
                " wherein he will be made to render",
                " an account to his Lord. This particular",
                " verse focuses on the second of these",
                " two doctrines.",
                "*9). This Qur'anic statement combines",
                " the enunciation of a basic doctrine with",
                " its supporting argument. The doctrine that is",
                " being enunciated here is that God will",
                " resurrect man. This is supported by the",
                " argument that it is God Who brought",
                " about the creation in the first place.",
                " All those who believe that the original",
                " creation was an act of God can",
                " neither consider it impossible nor",
                "*10). The",
                " present verse sets forth the rationale of",
                " resurrection. The preceding verses had conclusively established",
                " that resurrection is possible, that there is",
                " no reasonable ground to dub it as",
                " a far-fetched idea. Drawing upon the above,",
                " the verse under consideration points out that",
                " the requirements of justice and reason can",
                " only be fulfilled by resurrection, and that",
                " this calls for a repetition of the",
                " original act of creation by God.",
                "The",
                " point that is being made here is",
                " that those who accept God as their",
                " One and the Only Lord and truly",
                " live in service and devotion to Him",
                " deserve to be fully rewarded for their",
                " righteous conduct. Likewise, those who reject the",
                " truth and act according to their own",
                " whim deserve to be duly punished for",
                " their unrighteous conduct. The present life is",
                " so constituted that reward and punishment are",
                " not being meted out and cannot be",
                " meted out in the manner described above.",
                " This is a plain fact, and one",
                " which is evident to all except those",
                " who are obstinate, This being the case,",
                " reason and justice demand fresh creation in",
                " order that such reward and punishment be",
                " meted out. (For further"
            ]
        },
        {
            "id": "[10:5]",
            "verse": "It is He who made the sun a shining light and the moon a derived light and determined for it phases - that you may know the number of years and account [of time]. Allah has not created this except in truth. He details the signs for a people who know",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:6]",
            "verse": "Indeed, in the alternation of the night and the day and [in] what Allah has created in the heavens and the earth are signs for a people who fear Allah",
            "description": [
                "This provides yet another argument in support",
                " of the doctrine of the Hereafter. The",
                " argument is derived from the orderly nature",
                " of the universe. This vast universe -",
                " the handiwork of God - is spread",
                " out before our eyes. It is full",
                " of signs of God's power and wisdom",
                " such as those which underlie the sun",
                " and the moon and the alternation of",
                " night and day. Even a superficial glance",
                " at the universe is enough to convince",
                " one that the Creator of this enormous",
                " universe is not at all like a",
                " child who creates something to play with",
                " and after enjoying it for a while",
                " whimsically destroys it. For it is quite",
                " evident that every act of the Creator",
                " is characterized by order and wisdom, and",
                " that a strong purposiveness underlies everything, even",
                " a speck of dust. Now, since the",
                " Creator is All-Wise - as is evident",
                " from His creation - it is absurd",
                " to assume that He Who has also",
                " invested man with reason, moral consciousness and",
                " free-will, will not call man to account",
                " for his conduct; that He will altogether",
                " disregard the need for retribution arising from",
                " man's responsibility which in turn stems from",
                " his inherent rational and moral endowments.",
                "Apart",
                " from expounding the doctrine of the Hereafter,",
                " the above verses also adduce the following",
                " three arguments in support of that doctrine:",
                "",
                "First, a persuasive case is made out",
                " in support of the possibility of a",
                " second life. The basis of the argument",
                " is that the creation of man in",
                " the first instance is indicative of God's",
                " creative power. (There is no reason to",
                " believe that God has become bereft of",
                " that power of creation, and hence would",
                " be unable to create man afresh -",
                " Ed.) Second, the Next Life is needed",
                " in order that man might be rewarded",
                " or punished in consideration of his performance,",
                " whether good or bad. Both justice and",
                " reason seem to call for a new",
                " life wherein everyone would be able to",
                " see, in a fair manner, the consequence",
                " of his deeds.",
                "Third, that the Next",
                " Life, which is a requirement of justice",
                " and reason, will certainly come to pass.",
                " This is because the Creator, Who created",
                " man and the universe, is All-Wise, and",
                " it is inconceivable that such a Being",
                " will not respond to an unmistakable requirement",
                " of justice and reason.",
                "After careful consideration",
                " it appears that the above are the",
                " only possible arguments that might be adduced",
                " and they suffice to establish that there",
                " is life after death. The only possible",
                " question that remains, after having established that",
                " the Next Life is demanded by both",
                " reason and justice, and also that it",
                " is a requisite of God's wisdom, is",
                " whether it is possible to visually observe",
                " the Next Life in the manner in",
                " which people observe other objects. Now it",
                " should he clearly understood that this inability",
                " will remain during the present phase of",
                " existence. The reason for it is that",
                " God asks man to believe in cerium",
                " truths and such a demand in respect",
                " of objects which can be observed with",
                " human eyes would be utterly meaningless. The",
                " test to which man has been put",
                " consists precisely of this; whether man can",
                " affirm certain truths which belong to the",
                " suprasensory realm by the use of his",
                " rational faculties.",
                "Another point which has been",
                " stated in this context also deserves serious",
                " consideration. This is embodied in the following",
                " Qur'anic statement: 'He expounds His signs for",
                " the people who know' (Yunus 10: 5);'.",
                " . . and in all that Allah",
                " has created in the heavens and the",
                " earth there are signs for the people",
                " who seek to avoid (error of outlook",
                " and conduct)' (Yunus 10: 6). This means",
                " that God in His infinite wisdom has",
                " seen to it that in the multifarious",
                " phenomena of existence there should be plenty",
                " of signs which betoken the hidden realities",
                " underlying that phenomena. However, not all men",
                " will be able to benefit from those",
                " signs. Those who will be able to",
                " benefit are those",
                "(i) who liberate themselves",
                " from prejudices and seek knowledge with the",
                " help of the natural endowments bestowed upon",
                " them by God. and",
                "(ii) those who",
                " are Keen not to fall into error",
                " and who earnestly seek to adhere to",
                " the right way."
            ]
        },
        {
            "id": "[10:7]",
            "verse": "Indeed, those who do not expect the meeting with Us and are satisfied with the life of this world and feel secure therein and those who are heedless of Our signs",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:8]",
            "verse": "For those their refuge will be the Fire because of what they used to earn.",
            "description": [
                "Here again a doctrine has been put",
                " forth along with its supporting argument. (For",
                " another such instance seen. 9 above-Ed.)The statement",
                " that is being made here is that",
                " rejection of the doctrine of the Hereafter",
                " necessarily entails the punishment of Hell, and",
                " the argument that is being proffered in",
                " support of it is that those who",
                " are oblivious to the Hereafter commit, because",
                " of their disbelief in it, evil deeds",
                " which can only lead to them suffering",
                " the torments of Hell. This argument is",
                " corroborated by the entire record of man's",
                " past. It is quite clear that the",
                " lives of those who do not believe",
                " that they, will not be held to",
                " account by God for their deeds; who",
                " work on the assumption that life is",
                " merely confined to the span of worldly",
                " existence; who measure human success or failure",
                " only in terms of the extent of",
                " material comfort, fame and power that a",
                " person is able to enjoy: who under",
                " the influence of such materialistic notions do",
                " not even care to pay attention to",
                " those signs of God which point to",
                " reality, assume an altogether wrong direction with",
                " the result that their life is vitiated.",
                " Hence they live a totally unbridled life,",
                " develop the worst possible character traits, and",
                " fill God's earth with injustice and corruption,",
                " with sin and transgression, and ultimately end",
                " up meriting the punishment of Hell.",
                "It",
                " will be seen that whereas the three",
                " arguments mentioned earlier were of a theoretical",
                " nature the above argument about the Hereafter",
                " is drawn from. human experience itself. Although",
                " in the present verse the argument is",
                " found only in an implicit form, it",
                " is spelt out at several other places",
                " in the Qur'an. The argument essentially is",
                " that unless man's character rests on the",
                " consciousness and conviction that he will have",
                " to render an account for all his",
                " deeds to God, both man's individual and",
                " collective behaviour will fail to have sound",
                " basis and direction. It would seem, therefore,",
                " to be worth asking: why is this",
                " so? Why is it that once this",
                " consciousness and conviction are altogether ended or",
                " greatly enfeebled, the human character turns to",
                " iniquity and corruption? Had affirmation of the",
                " Hereafter not been in conformity with reality,",
                " and conversely, had its denial not been",
                " opposed to it, then the evil consequences",
                " flowing from the denial of the Hereafter",
                " would not have been found with such",
                " unfailing regularity. If adherence to a proposition",
                " invariably leads to good results, and failure",
                " to adhere to it invariably leads to",
                " evil consequences, then this definitely proves the",
                " proposition to be true.",
                "In an attempt",
                " to refute the above argument it is",
                " sometimes contended that even atheists who reject",
                " the Hereafter and follow a materialistic approach",
                " to life often lead lives that are",
                " on the whole good and decent, that",
                " they hold themselves free from corruption and",
                " injustice. Not only that but also that",
                " their actual conduct is characterized by righteousness",
                " and benevolence. However, only a little reflection",
                " will make apparent the fallacy underlying this",
                " argument. For if one were to examine",
                " any atheistic or materialistic philosophy or ideology",
                " one will not find in them any",
                " basis for righteous behaviour which draws such",
                " lavish praise from so-called 'righteous' atheists. Nor",
                " can it be established by logical reasoning",
                " that an atheistic philosophy of life provides",
                " any incentive to embrace such virtues as",
                " truthfulness, trustworthiness, honesty, faithfulness to one's commitment,",
                " benevolence, generosity, preferring the interests of others",
                " to one's own, self-restraint, chastity, recognition of",
                " the rights of others, and fulfilment of",
                " one's obligations. The fact is that once",
                " God and the Hereafter are relegated to",
                " oblivion, the only practicable course left for",
                " man is to anchor his morality on",
                " utilitarianism. All other philosophical ideas which are",
                " expounded are merely theoretical embellishments and have",
                " no relevance for man's practical life.",
                "As",
                " for utilitarian morality - no matter how",
                " hard we might try to broaden its",
                " scope - it does not go beyond",
                " teaching man that he ought to do",
                " that which will yield to him or",
                " to his society some worldly benefit. Now",
                " since utility is the criterion of all",
                " acts, such a philosophy tends to make",
                " man cynical, with the result that in",
                " order to derive benefits, he will not",
                " differentiate between truth and lie; between trustworthiness",
                " and treachery; between honesty and dishonesty; between",
                " loyalty and perfidy; between observing justice and",
                " committing wrong. In short, a person under",
                " the spell of utilitarian ideas will be",
                " ready to do a thing or its",
                " opposite, depending on what serves his interests",
                " best. The conduct of the British is",
                " illustrative of this stance. It is sometimes",
                " contended that though the British have a",
                " materialistic outlook on life and generally do",
                " not believe in the Hereafter, they are",
                " more truthful, fairer, and more straightforward and",
                " faithful to their commitment.",
                "The fact, however,",
                " is that the tenuous character of moral",
                " values under a utilitarian moral philosophy is",
                " amply illustrated by the character of the",
                " British.",
                "For their actual conduct clearly shows",
                " that they do not consider moral values",
                " to have any intrinsic worth. This is",
                " evident from the fact that even those",
                " values which are held by the British",
                " to be good in their individual lives",
                " are brazenly flouted when they act as",
                " a nation. Had the qualities of truthfulness,",
                " justice, honesty and faithfulness to one's committed",
                " word been regarded as intrinsic virtues, it",
                " would have been altogether out of the",
                " question for the elected rulers of Britain",
                " to cynically violate all moral principles in",
                " governmental and international affairs and yet continue",
                " to retain the confidence of the British",
                " people. Does such a behaviour of a",
                " people who do not take the Hereafter",
                " seriously prove that they do not believe",
                " in absolute moral values? Does it also",
                " not prove that, guided by concern for",
                " material interests, such people are capable of",
                " following mutually opposed views simultaneously?",
                "Nevertheless, if",
                " we do find some people who, in",
                " spite of their not believing in God",
                " and the Hereafter, consistently adhere to some",
                " moral virtues and abstain from evil, there",
                " should be no mistaking that their righteous",
                " conduct and piety represents the continuing influence",
                " which religious ideas and practices have over",
                " them - even if unconsciously - rather",
                " than their subscription to a materialistic philosophy",
                " of life. If they possess any portion",
                " of the wealth of morality, there can",
                " be no doubt that it was stolen",
                " from the treasure-house of religion. It is",
                " ironical that such persons are now using",
                " the same wealth derived from religious sources,",
                " to promote an irreligious way of life.",
                " We consider this an act of theft",
                " because irreligiousness and materialism are altogether bereft",
                " of morality."
            ]
        },
        {
            "id": "[10:9]",
            "verse": "Indeed, those who have believed and done righteous deeds - their Lord will guide them because of their faith. Beneath them rivers will flow in the Gardens of Pleasure",
            "description": [
                "This Qur'anic statement calls for serious reflection.",
                " The sequence of ideas presented here is",
                " also quite significant because answers have been",
                " systematically provided to a number of highly",
                " relevant basic questions. Let us look at",
                " these answers in their sequence. Why will",
                " the righteous enter Paradise? The answer is:",
                " because they have followed the straight way",
                " in their worldly life. That is, in",
                " all matters and in every walk of",
                " life, in all affairs relating to the",
                " personal or collective life they have been",
                " righteous and have abstained from false ways.",
                "",
                "This gives rise to another question: how",
                " were the righteous able to obtain a",
                " criterion that would enable them to distinguish,",
                " at every turn and crossroad of life,",
                " between right and wrong, between good and",
                " evil, between fair and unfair? And how",
                " did they come to have the strength",
                " to adhere to what is right and",
                " avoid what is wrong? All this, of",
                " course, came from their Lord Who bestowed",
                " upon them both the guidance which they",
                " needed to know the right way and",
                " the succour required to follow it. In",
                " answer to why their Lord bestowed upon",
                " them this guidance and succour, we are",
                " reminded that all this was in consideration",
                " for their faith.",
                "It is also made",
                " clear that this reward is not in",
                " lieu of merely a verbal profession to",
                " faith, a profession that is no more",
                " than a formal acceptance of certain propositions.",
                " Rather, the reward is in consideration for",
                " a faith that became the moving spirit",
                " of a believer's character and personality, the",
                " force that led him lo righteous deeds",
                " and conduct. We can observe in our",
                " own physical lives that a person's survival,",
                " state of health, level of energy, and",
                " joy of living all depend upon sustenance",
                " from the right kind of food. This",
                " food, once digested, provides blood to the",
                " veins and arteries, provides energy to the",
                " whole body and enables the different limbs",
                " to function properly.",
                "The same holds true",
                " of man's success in the moral domain.",
                " It is sound beliefs which ensure that",
                " he will have the correct outlook, sound",
                " orientation and right behaviour that will ultimately",
                " lead to his success. Such results, however,",
                " do not ensue from that kind of",
                " believing which either consists of a mere",
                " profession to faith, or is confined to",
                " some obscure corner of man's head or",
                " heart. The wholesome results mentioned above can",
                " only be produced by a faith which",
                " deeply permeates man's entire being, shaping his",
                " mental outlook, even becoming his instinct; a",
                " faith which is fully reflected in his",
                " character, conduct and outlook on life. We",
                " have just noted the importance of food.",
                " We know that the person who, in",
                " spite of eating remains like one who",
                " has not partaken of any food, would",
                " not be able to enjoy the healthy",
                " results that are the lot of the",
                " person who has fully assimilated what he",
                " ate. How can it be conceived that",
                " it would be different in the moral",
                " domain of human life? How can it",
                " be that he who remains, even after",
                " believing, like the one who does not",
                " believe, will derive the benefit and receive",
                " the reward meant for those whose believing",
                " leads to righteous living?"
            ]
        },
        {
            "id": "[10:10]",
            "verse": "Their call therein will be, \"Exalted are You, O Allah,\" and their greeting therein will be, \"Peace.\" And the last of their call will be, \"Praise to Allah, Lord of the worlds!\"",
            "description": [
                "This should remove any misconceptions about Paradise",
                " which seem to have been formed by",
                " some people of frail understanding. Subtly, the",
                " verse suggests that when people are admitted",
                " to Paradise, they will not instantly pounce",
                " upon the objects of their desire as",
                " the starved and hungry are wont to",
                " do when they observe food. Nor will",
                " they frantically go about giving vent to",
                " their lusts, impatiently demanding their cherished objects",
                " of enjoyment - beautiful women, wine, dissolute",
                " singing and music.",
                "The fact is that",
                " the men of faith and righteousness who",
                " are admitted to Paradise will be those",
                " who, during their life in the world,",
                " have embellished their lives with sublime ideas",
                " and noble deeds, who have refined their",
                " emotions, who have oriented their desires in",
                " the right direction, and who have purified",
                " their conduct and character. Thus, the nobility",
                " which they have developed in their personalities",
                " will shine in even greater splendour when",
                " they set their feet in the pure",
                " and clean environment of Paradise. Those same",
                " traits which characterized their behaviour in the",
                " world will appear with even greater lustre.",
                "",
                "The favourite occupation of such people in",
                " Paradise will be the same as during",
                " their life on the earth - to",
                " celebrate the praise of God. Likewise, their",
                " relationships in Paradise will be imbued with",
                " feelings of mutual harmony and concern for",
                " each other's well-being as had been the",
                " case in this world."
            ]
        },
        {
            "id": "[10:11]",
            "verse": "And if Allah was to hasten for the people the evil [they invoke] as He hastens for them the good, their term would have been ended for them. But We leave the ones who do not expect the meeting with Us, in their transgression, wandering blindly",
            "description": [
                "These introductory remarks are followed by a",
                " discourse which comprises the admonition and explanation",
                " of certain important points. For a fuller",
                " appreciation of the discourse, it is better",
                " to take note first of the following",
                " points about its background.",
                "First, that the",
                " prolonged and acute famine which had virtually",
                " destroyed the people of Makka had ended",
                " just a little before the revelation of",
                " these verses. The famine was so severe",
                " that even the most arrogant leaders of",
                " the Quraysh had been humbled. As a",
                " result, idol-worship had declined and people turned",
                " increasingly, with prayer and sincere supplication, to",
                " the One True God. The famine was",
                " so acute that at one stage Abu",
                " Sufyan had approached the Prophet (peace be",
                " on him) with a request to implore",
                " God to deliver them from the calamity.",
                " However, no sooner had the famine ended",
                " and heavy rains brought about a rich",
                " harvest and prosperity than the Makkans reverted",
                " to their old evil habits, to their",
                " rebellion against God, to their hostile machinations",
                " against",
                "Islam. Those who had turned to",
                " God for a short while once again",
                " became engrossed in their former apathy and",
                " wickedness. (See also al-Nahl 16: 113; al-Mu'minun23:",
                " 75-7; andal-Dukhan44: 10-16. See also al-Bukhari,Abwab al-lstisqa",
                " , Bab idha istashfa'a al-Mushrikun bi al-Muslimin",
                " 'ind al-Qaht -Ed.) Second, whenever the Prophet",
                " (peace be on him) warned the Makkans",
                " of God' s punishment as a consequence",
                " of their rejecting the truth, they retorted",
                " by asking: why had God's punishment not",
                " befallen them there and then? Why was",
                " it being delayed?",
                "In response, the Qur'an",
                " states that when it comes to punishing",
                " human beings God does not resort to",
                " the same haste which He resorts to",
                " when He wants to show mercy. The",
                " Makkans had seen that God had quickly",
                " halted the famine when they had prayed",
                " for its removal. They thought that if",
                " they were considered by God to be",
                " an evil people. He would have afflicted",
                " them with a calamitous punishment as soon",
                " as they had asked for it, or",
                " as soon as they engaged in rebellion",
                " against God. But that is not God's",
                " way. No matter how rebellious a people",
                " become, God grants them ample time to",
                " make amends. He also warns them over",
                " and over again and grants them a",
                " long respite. It is only when leniency",
                " has run its full course that His",
                " law of retribution comes into action. In",
                " sharp contrast to this is the attitude",
                " of men of low mettle. This is",
                " amply reflected in the ways of the",
                " rebellious ones among the Quraysh. When they",
                " encountered a disaster, they remembered God and",
                " bewailed and bemoaned of the same to",
                " Him. As soon as hard times were",
                " over, however, they forgot everything about God.",
                " It is precisely this kind of behaviour",
                " by different nations which invites God's punishment.",
                ""
            ]
        },
        {
            "id": "[10:12]",
            "verse": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:13]",
            "verse": "And We had already destroyed generations before you when they wronged, and their messengers had come to them with clear proofs, but they were not to believe. Thus do We recompense the criminal people",
            "description": [
                "In Arabic, the word qarn, which occurs",
                " in the above verse, usually denotes 'the",
                " people of a given age'. However, the",
                " word in its several usages in the",
                " Qur'an, connotes a 'nation' which, wielded in",
                " its heyday, whether fully or partially, the",
                " reins of world leadership. When it is",
                " said that a certain nation was 'destroyed'",
                " this does not necessarily mean its total",
                " annihilation. When any such nation suffers the",
                " loss of its ascendancy and leadership, when",
                " its culture and civilization become extinct, when",
                " its identity is effaced, in fact, when",
                " such a nation disintegrates and its component",
                " pans become assimilated into other nations, then",
                " it is fair to say that it",
                " has suffered destruction.",
                "*17). The expression zulm",
                " (wrong-doing, injustice) in the above verse has",
                " not been used in the limited sense",
                " in which it is generally used. Instead,",
                " here the word embraces the whole range",
                " of sins which consists of man exceeding",
                " the limits of service and obedience to",
                " God. (For further explanation see Towards Understanding",
                " the Qur'an, vol. I, al-Baqarah, 2, n.",
                " 49, p. 64 - Ed.)"
            ]
        },
        {
            "id": "[10:14]",
            "verse": "Then We made you successors in the land after them so that We may observe how you will do.",
            "description": [
                "One should not lose sight of the",
                " fact that the immediate addressees of the",
                " present discourse were the people of Arabia.",
                " Here they are told that all previous",
                " nations were granted the opportunity to show",
                " their potential to do good. Instead, they",
                " took to wrong-doing and rebellion and rejected",
                " the message of the Prophets who had",
                " been raised solely to guide them. Thus",
                " they failed in the test to which",
                " they were put by God and were",
                " accordingly removed from the scene of history.",
                " Now the turn of the Arabs has",
                " come and they have also been granted",
                " the opportunity to prove their worth. They",
                " have also been put to the same",
                " test to which the previous nations had",
                " been put and in which they had",
                " failed. If the people of Arabia want",
                " to avoid meeting a similarly tragic fate,",
                " they would be well advised to avail",
                " themselves of the opportunity granted them, to",
                " learn the lessons from the history of",
                " the previous nations, and to avoid the",
                " mistakes which led to the undoing of",
                " many in the past."
            ]
        },
        {
            "id": "[10:15]",
            "verse": "And when Our verses are recited to them as clear evidences, those who do not expect the meeting with Us say, \"Bring us a Qur'an other than this or change it.\" Say, [O Muhammad], \"It is not for me to change it on my own accord. I only follow what is revealed to me. Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "description": [
                "This statement of the unbelievers was based,",
                " first of all, on the misconception that",
                " the Qur'an, which the Prophet (peace he",
                " on him) presented in them as the",
                " 'Word of God'. was in fact a",
                " product of his own mind which he",
                " had ascribed to God merely to invest",
                " it with authority. Moreover, they wanted to",
                " impress upon the Prophet (peace he on",
                " him) that the contents of his message",
                " were of little practical, worldly use. The",
                " emphasis on the unity of God, on",
                " the Life to Come and on the",
                " moral principles which people were asked to",
                " follow -all these were of no practical",
                " consequence to them. They virtually told the",
                " Prophet 'peace be on him. that if",
                " he wanted to lead them he should",
                " come forth with something that would be",
                " of benefit to them and ameliorate their",
                " worldly life. And if this was not",
                " possible, then he should at least show",
                " some flexibility in his attitude which would",
                " enable them to strike a compromise with",
                " him by effecting mutual accommodation between the",
                " Makkan unbelievers and the Prophet (peace be",
                " on him) himself",
                "In other words, the",
                " Makkans felt that the Prophet's doctrine of",
                " God's unity should not totally exclude their",
                " polytheism: that his conception of devotion to",
                " God should be such as to allow",
                " them some scope for their worldliness and",
                " self-indulgence; that the call to believe in",
                " the Hereafter should be such that it",
                " might still be possible for them to",
                " behave in the world as they pleased",
                " and yet entertain the hope of somehow",
                " attaining salvation in the Next World. Likewise,",
                " the absolute and categorical nature of moral",
                " principles enunciated by the Prophet (peace be",
                " on him) was also unpalatable to them.",
                " They wanted moral principles to be propounded",
                " in a manner that would provide concessions",
                " to their predilections and biases, to their",
                " customs and usages, to their personal and",
                " national interests, and to the lusts and",
                " desires that they wished to satisfy.",
                "In",
                " effect, they suggested a compromise according to",
                " which one sphere of life should be",
                " earmarked as 'religious', and in this sphere",
                " men should render to God what rightfully",
                " belongs to Him. Beyond this sphere, however,",
                " it should be left to people's discretion",
                " to run their worldly affairs as they",
                " pleased, It seemed altogether outrageous to them",
                " that the doctrines of the unity of",
                " God and accountability in the Hereafter should",
                " embrace the whole gamut of human life,",
                " and that man should be asked to",
                " subject himself entirely to the Law of",
                " God.",
                "*20). This is the Prophet's response",
                " to what has been said above (see",
                " n. 19 above). It is made clear",
                " that the Prophet (peace be on him)",
                " was not the author of the Qur'an;",
                " and that since it had only been",
                " revealed to him, he had no authority",
                " therefore to make any alteration in it",
                " whatsoever. It is also made clear that",
                " the question was not one that could",
                " be the subject of any bargain. The",
                " unbelievers should either accept the faith propounded",
                " by the Prophet (peace be on him)",
                " in toto or reject it in toto.",
                ""
            ]
        },
        {
            "id": "[10:16]",
            "verse": "Say, \"If Allah had willed, I would not have recited it to you, nor would He have made it known to you, for I had remained among you a lifetime before it. Then will you not reason?\"",
            "description": [
                "This is indeed a very weighty argument",
                " in refutation of the unbelievers' allegation that",
                " the Prophet (peace be on him) had",
                " himself authored the Qur'an and subsequently ascribed",
                " it to God. So far as other",
                " arguments are concerned, they might be considered",
                " as somewhat remote. But the argument based",
                " on the life and character of the",
                " Prophet (peace be on him) was particularly",
                " weighty since the Makkans were thoroughly familiar",
                " with the whole of his life. Before",
                " his designation as a Prophet, he had",
                " spent a full forty years in their",
                " midst. He was born in their city.",
                " They had observed his childhood, and then",
                " his youth, and it was in their",
                " city that he had reached his middle",
                " age. He had also had a variety",
                " of dealings with them. He had had",
                " social interaction, business transactions, matrimonial ties, and",
                " relationships of every conceivable nature with his",
                " people so that no aspect of his",
                " life was hidden from their view. Could",
                " there be a more powerful testimony to",
                " the truth of his claim to prophethood",
                " than his blameless life and character?",
                "Two",
                " things about the life of the Prophet",
                " (peace be on him) were especially clear",
                " and were quite well known to all",
                " Makkans. First, that during the forty years",
                " of his life before his designation as",
                " a Prophet, he had received no instruction",
                " from, or even enjoyed the company of",
                " learned people which could have served as",
                " the source of the ideas which began",
                " to flow, as would a stream, from",
                " his lips as soon as he claimed,",
                " at the age of forty, that he",
                " had been designated as a Prophet. Before",
                " that he was never seen to have",
                " been concerned with the problems, or to",
                " have discussed the subjects, or to have",
                " expressed the ideas which frequently recur in",
                " the Qur'an. In fact none of his",
                " closest friends and relatives had foreseen in",
                " his pre-Prophetic life any signs indicative of",
                " the great message which he suddenly started",
                " to preach at the age of forty.",
                " These pieces of evidence, taken together, provide",
                " incontrovertible evidence that the Qur'an is not",
                " a product of the Prophet's mind; that",
                " it had come to the Prophet (peace",
                " be on him) from without. For no",
                " human being can produce something for which",
                " traces of growth and evolution are not",
                " found in the earlier period of his",
                " life.",
                "This explains the fact that when",
                " some of the more crafty Makkan unbelievers",
                " realized the sheer absurdity of their allegation",
                " that the Prophet (peace be on him)",
                " was the author of the Qur'an, they",
                " chose to propagate that there must be",
                " some other person who had taught the",
                " Prophet (peace be on him) the Qur'an.",
                " Such a statement, however, was even more",
                " preposterous since they failed to convincingly point",
                " out who that other person was who",
                " was the true source of the Qur'an.",
                " Even leaving aside Makka, the fact is",
                " that there was not a single person",
                " throughout the length and breadth of Arabia",
                " who possessed the competence needed for the",
                " authorship of the Qur'an. Had such an",
                " extraordinary person existed, how could he have",
                " remained hidden from the sight of others?",
                "",
                "Second, the pre-Prophetic life of Muhammad (peace",
                " be on him) clearly shows him to",
                " be a man of exceptionally high moral",
                " character for there was not the least",
                " trace of any evil - whether lies,",
                " deceit, vile cunning or trickery. On the",
                " contrary, all those who came into contact",
                " with the Prophet (peace be on him)",
                " were impressed by him as a person",
                " of flawless character, as one utterly truthful",
                " and trustworthy.",
                "An illustration in point is",
                " the incident related in connection with the",
                " re-building of the Ka'bah five years before",
                " his designation as a Prophet. There was",
                " a serious dispute between the various families",
                " of the Quraysh on the question as",
                " to who should have the privilege of",
                " placing the Black Stone in its place",
                " in the edifice of the Ka'bah, In",
                " order to reach an amicable accord, they",
                " resolved that they would abide by the",
                " ruling given by the first person who",
                " entered the Ka'bah the following day. The",
                " next day people saw it was the",
                " Prophet (peace be on him) who was",
                " the first to enter. They exclaimed: 'Here",
                " is a trustworthy man (amin). We agree",
                " [to follow his ruling]. He is Muhammad.'",
                " (Ibn Sa'd, al-Tabaqat, vol. 1, p. 146",
                " - Ed.) Thus, before designating",
                "Muhammad (peace",
                " be on him) as a Prophet, God",
                " had the whole body of the Quraysh",
                " testify to his trustworthiness. No room was",
                " left, therefore, for suspecting that he who",
                " had never resorted to lying or deceit",
                " throughout his life would suddenly resort to",
                " fabricating a gigantic lie; that he would",
                " first compose something, then deny that it",
                " was his work, and would then ascribe",
                " it to God.",
                "In view of the",
                " above, God directs the Prophet (peace be",
                " on him) to ask the unbelievers to",
                " use their brains before levelling such a",
                " stupid allegation against him. For the Prophet",
                " (peace be on him) was after all",
                " no stranger to them; he had spent",
                " virtually a whole lifetime in their midst.",
                " In view of the well-known and uniformly",
                " high level of his conduct and character,",
                " how could it even be conceived that",
                " he would falsely ascribe the Qur'an to",
                " God if God had not actually revealed",
                " it to him. (For further elaboration see",
                " al-Qasas 28, n. 109.)"
            ]
        },
        {
            "id": "[10:17]",
            "verse": "So who is more unjust than he who invents a lie about Allah or denies His signs? Indeed, the criminals will not succeed",
            "description": [
                "If the verses of the Qur'an were",
                " in fact not from God but had",
                " been composed by the Prophet (peace be",
                " on him) who then claimed them to",
                " be from God, the Prophet would be",
                " guilty of the worst kind of wrong.",
                " But if, on the contrary, the Qur'an",
                " was the word of God, those who",
                " rejected it as false must be regarded",
                " as the worst kind of wrong-doers.",
                "*23).",
                " The Qur'anic term falah (prosperity, success) used",
                " in the above verse has been understood",
                " by some to signify such things as",
                " longevity, worldly prosperity and other worldly attainments.",
                " Under this false impression, they tend to",
                " believe that if a claimant to prophethood",
                " attains material prosperity and longevity or if",
                " his message is spread around, then he",
                " ought to be considered a genuine Prophet",
                " because he has indeed attained 'prosperity'. Had",
                " he been an impostor, it is argued,",
                " he would soon have been assassinated, or",
                " would have starved to death, and, in",
                " any case, his message would not have",
                " spread around. Such an absurd line of",
                " argument can only be pursued by those",
                " who are altogether ignorant of the concept",
                " of falah (prosperity) as envisaged in the",
                " Qur'an, who are unaware of God's law",
                " of respite regarding evil-doers, and who are",
                " altogether unappreciative of the special meaning in",
                " which the term has been employed in",
                " the present context.",
                "In order to fully",
                " understand what is meant by saying that",
                " 'the guilty shall not prosper', a number",
                " of things ought to be borne in",
                " mind. In the first place, the Qur'anic",
                " statement that \"the guilty shall not prosper'",
                " is not made with a view to",
                " providing a yardstick that might be applied",
                " by people so as to determine the",
                " truth or falsity of the claimants of",
                " prophethood. The verse does not seek to",
                " stress that all those who 'prosper' after",
                " claiming to be a Prophet are truly",
                " Prophets, and that those who do not",
                " prosper after making such a claim are",
                " not so. The point of emphasis here",
                " is altogether different. Here the Prophet (peace",
                " be on him) is being made to",
                " say that since he knows fully that",
                " those guilty of inventing lies against Allah",
                " could not prosper, he would not dare",
                " make any claim to prophethood if such",
                " a claim was false.",
                "On the other",
                " hand, the Prophet (peace be on him)",
                " also knew that the unbelievers were guilty",
                " of rejecting the true signs of God",
                " and of declaring a true Prophet of",
                " God to be an impostor. In view",
                " of that monstrous guilt, it was quite",
                " apparent to the Prophet (peace be on",
                " him) that they would not prosper.",
                "Moreover,",
                " the Qur'anic term falah (prosperity, success) has",
                " not been used in the limited sense",
                " of worldly success. Rather, it denotes that",
                " enduring success which admits of no failure",
                " regardless of whether one is able to",
                " achieve success in the present phase of",
                " one's existence or not. it is quite",
                " possible that someone who calls people to",
                " falsehood might enjoy life and nourish in",
                " a worldly sense, and he might even",
                " be able to attain a substantial following",
                " for his message. But this is not",
                " true prosperity or success; rather it constitutes",
                " total loss and failure. Contrarily, it is",
                " also possible that someone who calls people",
                " to the truth might be exposed to",
                " much persecution and be overwhelmed by pain",
                " and suffering. It is possible that even",
                " before he is able to create any",
                " significant following, he is continually subjected to",
                " persecution and torture. In the Qur'anic view,",
                " such an apparently tragic end constitutes the",
                " very zenith of such a person's success",
                " rather than his failure.",
                "Moreover, it should",
                " be remembered that it has been amply",
                " elucidated in the Qur'an that God does",
                " not punish evil-doers instantly: that He rather",
                " grants them a fair opportunity to mend",
                " their ways. Not only that, if the",
                " evil-doers misuse the respite granted by God",
                " to perpetrate further wrongs, they are sometimes",
                " granted an even further respite. In fact,",
                " at times a variety of worldly favours",
                " are bestowed upon such evil-doers in order",
                " that the potential for wickedness inherent in",
                " them might be fully exposed by their",
                " actions, proving that they do indeed deserve",
                " a very severe punishment. Hence, if an",
                " impostor continues to enjoy periods of respite",
                " and if worldly favours are lavished upon",
                " him this should not in any way",
                " give rise to the notion that he",
                " is on the right path.",
                "In the",
                " same way as God grants respite to",
                " other evil-doers. He also grants respite to",
                " impostors. There are no grounds whatsoever for",
                " believing that the respite granted to other",
                " evil-doers would not be granted to those",
                " impostors who lay false claim to prophethood.",
                " We may well call to mind that",
                " Satan himself has been granted a respite",
                " until Doomsday, It has never been indicated",
                " that although Satan is granted a free",
                " hand to misguide human beings, as soon",
                " as he throws up an impostor claiming",
                " prophethood such a venture is instantly nipped",
                " in the bud.",
                "In order to refute",
                " the view expressed above it is possible",
                " that someone may refer to the following",
                " verse of the Qur'an: Now if he",
                " [i.e. Muhammad] would have made up, ascribed",
                " some sayings to Us, We would indeed",
                " have seized him by the right hand,",
                " and then indeed would have cut his",
                " life-vein (al-Haqqah 69: 44-6).",
                "Even a little",
                " reflection makes it obvious that the verse",
                " in question does not contradict the view",
                " we have expressed above. For, what the",
                " present verse says relates to a principle",
                " which God follows in dealing with true",
                " Prophets. Were any such Prophet to falsely",
                " claim something to be a revelation from",
                " God, he would instantly be seized by",
                " God's wrath. To argue to the contrary",
                " that all those who are not seized",
                " by God's wrath are necessarily genuine Prophets",
                " is simply a logical fallacy devoid of",
                " any justification. For the threat of instant",
                " Divine wrath embodied in this verse is",
                " applicable only to true Prophets, and not",
                " to impostors who, like other evil-doers, are",
                " granted a respite.",
                "This can be well",
                " understood if we bear in mind the",
                " disciplinary rules laid down by different governments",
                " for their officials. It is obvious that",
                " those rules are not enforced in respect",
                " of ordinary citizens. Were the latter to",
                " lay any false claim to being a",
                " government official, he would be subjected to",
                " the normal rules of the criminal code",
                " relating to the conviction of those who",
                " are guilty of fraud rather than to",
                " the disciplinary rules meant for government officials.",
                " Under this analogy, an impostor who claims",
                " to be a Prophet, would be dealt",
                " with by God along with other evil-doers",
                " who commit evil, and who, as we",
                " know, are not necessarily punished immediately.",
                "In",
                " any case, as we have pointed out",
                " earlier, the verses quoted above were not",
                " revealed so as to provide the criterion",
                " to judge the truth of anyone who",
                " lays claim to prophethood. This verse should",
                " not be considered to mean that if",
                " a celestial hand stretches forth to cut",
                " off the life-vein of a claimant to",
                " prophethood, such a person is an impostor;",
                " and if that does not happen, he",
                " is a genuine Prophet. Such a weird",
                " criterion would have been needed only if",
                " no other means were available to judge",
                " the genuineness of a claimant to prophethood.",
                " But as things stand, a Prophet is",
                " known by his character, by his work,",
                " and by the contents of his message.",
                ""
            ]
        },
        {
            "id": "[10:18]",
            "verse": "And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah \" Say, \"Do you inform Allah of something He does not know in the heavens or on the earth?\" Exalted is He and high above what they associate with Him",
            "description": [
                "To say that something is not known",
                " to God amounts to saying that it",
                " does not exist. For, quite obviously, all",
                " that exists is known to God. The",
                " above verse thus subtly points out the",
                " non-existence of any intercessors on behalf of",
                " unbelievers insofar as God does not know",
                " that there exist any in the heavens,",
                " or on the earth who would intercede",
                " on behalf of the unbelievers. That being",
                " so, who are those intercessors about whose",
                " existence and whose power of intercession with",
                " God the unbelievers wanted to inform the",
                " Prophet (peace be on him)?"
            ]
        },
        {
            "id": "[10:19]",
            "verse": "And mankind was not but one community [united in religion], but [then] they differed. And if not for a word that preceded from your Lord, it would have been judged between them [immediately] concerning that over which they differ.",
            "description": [
                "For further elaboration see Towards Understanding the",
                " Qur'an, vol. I, al-Baqarah 2, n. 230,",
                " pp. 165-6, and ibid., vol. II, al-An",
                " 'am 6, n. 24, pp. 228-9 -Ed.",
                "",
                "*26). The fact is that God has",
                " wilfully kept reality beyond the ken of",
                " man's sense-perception. This was done so as",
                " to test whether man, by making proper",
                " use of his reason, conscience and intuition,",
                " is able to find the right way.",
                " As a logical corollary of this, God",
                " allows those who decide to follow any",
                " other way rather than the right one",
                " to do so. Had this not been",
                " the case, the reality could have been",
                " instantly unmasked and that would have put",
                " an end to all disagreements relating to",
                " the issue.",
                "This statement has been made",
                " in order to remove a major misconception.",
                " Many people feel disconcerted today, as they",
                " felt disconcerted at the time when the",
                " Qur'an was revealed, by the fact that",
                " there are found different religions in the",
                " world and that the followers of each",
                " of these are convinced that their religion",
                " alone is the true one. People have",
                " been puzzled as to how to determine",
                " which religion is the right one and",
                " which is not.",
                "In this regard, the",
                " Qur'anic view which is being articulated here",
                " is that multiplicity of religions does not",
                " constitute the original state of things, that",
                " it is a relatively later development in",
                " human history. Initially, all mankind professed a",
                " single religion, and that religion was the",
                " true one. Later on, people began to",
                " disagree regarding the truth and this gave",
                " rise to different religions and creeds. Now",
                " it is not likely that God would",
                " dramatically appear before them and reveal the",
                " reality to them directly during the present",
                " phase of their worldly existence. For, the",
                " very purpose of the present life is",
                " to test people. And this test consists",
                " of finding out who discovers the reality",
                " - even though it is beyond the",
                " reach of the senses - with the",
                " help of his reason and common sense.",
                ""
            ]
        },
        {
            "id": "[10:20]",
            "verse": "And they say, \"Why is a sign not sent down to him from his Lord?\" So say, \"The unseen is only for Allah [to administer], so wait; indeed, I am with you among those who wait.\"",
            "description": [
                "The word 'sign' in the verse refers",
                " to the proof which supports a person's",
                " claim that he is a true Prophet",
                " and that his teaching is truly from",
                " God. In this connection it ought to",
                " be remembered that the demand of the",
                " unbelievers that the Prophet (peace be on",
                " him) should bring forth some sign to",
                " support his claim to be a Prophet",
                " was not made with sincerity, Their position",
                " was not that of a group of",
                " sincere people who were otherwise keen to",
                " accept the truth as soon as it",
                " became apparent to them, and who were",
                " ready to mould their own conduct, habits",
                " and social life according to its requirements,",
                " and all that they were waiting for",
                " was some sign, some proof, that would",
                " create in them a genuine conviction. The",
                " fact, on the contrary, was that the",
                " unbelievers' demand for miraculous signs was merely",
                " a pretext which they proffered in order",
                " to rationalize their disbelief. For they were",
                " sure to reject every sign, regardless of",
                " what that sign was, as unconvincing. Since",
                " they were hardened unbelievers, they were not",
                " prepared at all to accept such unseen",
                " truths as the unity of God and",
                " the Hereafter which would have led them",
                " to give up their",
                "*28). The Prophet's",
                " statement conveys the idea that he had",
                " faithfully presented to them whatever God had",
                " revealed to him. As for the things",
                " which had not been revealed to the",
                " Prophet (peace be on him) they constitute",
                " ghayb (the realm of the unseen). Now,",
                " it is only God and none else",
                " who can decide whether to reveal any",
                " part of the ghayb ('the unseen') or",
                " not. Hence, if some people's believing was",
                " contingent upon their observing the signs which",
                " God had not revealed, then they might",
                " as well keep waiting indefinitely for those",
                " signs. The Prophet (peace be on him)",
                " would also wait and see whether God",
                " would yield to their adamant demands for",
                " miraculous signs or not."
            ]
        },
        {
            "id": "[10:21]",
            "verse": "And when We give the people a taste of mercy after adversity has touched them, at once they conspire against Our verses. Say, \"Allah is swifter in strategy.\" Indeed, Our messengers record that which you conspire",
            "description": [
                "This again alludes to the famine which",
                " was referred to earlier in verses 11-12",
                " of the present surah. The unbelievers are",
                " virtually being told that it did not",
                " behove them to ask for any miraculous",
                " sign. For, not long ago they had",
                " suffered from a famine during which they",
                " had abjured faith in those very deities",
                " whom they had earlier considered their intercessors",
                " with God. They had seen with their",
                " own eyes how their cherished deities had",
                " failed them. They had clearly seen the",
                " extent of the supernatural powers of those",
                " very deities at whose altars they made",
                " offerings and sacrifices in the firm belief",
                " that their prayers would be answered and",
                " their wishes realized. They had seen -",
                " and that too in the recent past-that,",
                " one of those deities had any power;",
                " that all power in fact lay with",
                " God alone.",
                "It was because of this",
                " experience that they had begun to address",
                " all their prayers to God alone. Was",
                " all this not enough of a sign",
                " to convince the unbelievers about the truth",
                " of the teachings of the Prophet Muhammad",
                " (peace be on him)? And yet, despite",
                " clear signs, the unbelievers waxed arrogant. No",
                " sooner was the famine over and they",
                " were blessed with outpourings of rain which",
                " put an end to their misery than",
                " they reverted to their unbelief. They also",
                " sought to offer a wide variety of",
                " fanciful explanations about why the famine had",
                " hit them and why they were subsequently",
                " delivered from it. They resorted to all",
                " this in order that they might rationalize",
                " their adherence to polytheistic beliefs and practices",
                " and evade believing in the One True",
                " God. Quite obviously what good can any",
                " miraculous sign be to those who had",
                " corrupted their conscience so thoroughly?",
                "*30). It",
                " needs to he clearly understood as to",
                " what is meant by attributing 'scheming' to",
                " God in the present verse. It simply",
                " means that if the unbelievers refuse to",
                " accept the truth and to alter their",
                " conduct accordingly. God will still grant them",
                " the respite to go about their rebellious",
                " ways. God will also lavish upon them",
                " the means of subsistence and other bounties",
                " as long as they live. All this",
                " will keep them in a state of",
                " intoxication. However, whatever thev do during their",
                " state of intoxication will be imperceptibly recorded",
                " by the angels of God. All this",
                " will go on till the very last",
                " moments of their lives and then they",
                " will be seized by death and will",
                " be asked to render an account of",
                " their deeds."
            ]
        },
        {
            "id": "[10:22]",
            "verse": "It is He who enables you to travel on land and sea until, when you are in ships and they sail with them by a good wind and they rejoice therein, there comes a storm wind and the waves come upon them from everywhere and they assume that they are surrounded, supplicating Allah, sincere to Him in religion, \"If You should save us from this, we will surely be among the thankful.\"",
            "description": [
                "This particular 'sign' which testifies to the",
                " truth of belief in the One True",
                " God is innate in human nature and",
                " hence can be witnessed by all. However,",
                " as long as the means of self-indulgence",
                " are plentiful, man tends to forget God",
                " and exults in his worldly enjoyment. But",
                " as soon as the means which have",
                " led him to his worldly efflorescence are",
                " gone, even the most die-hard polytheists and",
                " atheists begin to appreciate this innate sign",
                " testifying that there indeed is a God",
                " Who has His firm grip over the",
                " universe, and that it is the One",
                " True God alone Who is all-powerful and",
                " Who holds sway over all that exists.",
                " (For details see Towards Understanding the Qur'an,",
                " vol. II, al-An 'am 6, n. 29,",
                " pp. 231-3-Ed.)"
            ]
        },
        {
            "id": "[10:23]",
            "verse": "But when He saves them, at once they commit injustice upon the earth without right. O mankind, your injustice is only against yourselves, [being merely] the enjoyment of worldly life. Then to Us is your return, and We will inform you of what you used to do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:24]",
            "verse": "The example of [this] worldly life is but like rain which We have sent down from the sky that the plants of the earth absorb - [those] from which men and livestock eat - until, when the earth has taken on its adornment and is beautified and its people suppose that they have capability over it, there comes to it Our command by night or by day, and We make it as a harvest, as if it had not flourished yesterday. Thus do We explain in detail the signs for a people who give thought.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:25]",
            "verse": "And Allah invites to the Home of Peace and guides whom He wills to a straight path",
            "description": [
                "God calls man to the path which",
                " would ensure for him his entry into",
                " the 'Abode of Peace1 in the Hereafter.",
                " The expression Dar al-salam which literally means",
                " the 'Abode of Peace', stands for Paradise,",
                " whose inhabitants shall be secure against every",
                " calamity, loss, sorrow or suffering."
            ]
        },
        {
            "id": "[10:26]",
            "verse": "For them who have done good is the best [reward] and extra. No darkness will cover their faces, nor humiliation. Those are companions of Paradise; they will abide therein eternally",
            "description": [
                "Apart from rewarding human beings in proportion",
                " to the good deeds that they have",
                " done, God also confers upon them, out",
                " of His sheer grace and bounty, a",
                " reward which is far in excess of",
                " their good deeds."
            ]
        },
        {
            "id": "[10:27]",
            "verse": "But they who have earned [blame for] evil doings - the recompense of an evil deed is its equivalent, and humiliation will cover them. They will have from Allah no protector. It will be as if their faces are covered with pieces of the night - so dark [are they]. Those are the companions of the Fire; they will abide therein eternally.",
            "description": [
                "The manner in which the evil ones",
                " will be treated is quite different from",
                " the way in which the righteous will",
                " be treated. As we have seen, the",
                " reward of the righteous will be far",
                " in excess of their good deeds. However,",
                " so far as the evil-doers are concerned,",
                " their punishment will be strictly in proportion",
                " to the evil they have committed, not",
                " even an iota more than that. (For",
                " further elaboration see a!-Nahl 16, n. 109a.)",
                "",
                "*35). This refers to the darkness and",
                " gloom that covers the faces of the",
                " criminals after they have been seized and",
                " after they have lost all hope of",
                " escaping God's punishment."
            ]
        },
        {
            "id": "[10:28]",
            "verse": "And [mention, O Muhammad], the Day We will gather them all together - then We will say to those who associated others with Allah, \"[Remain in] your place, you and your 'partners.' \" Then We will separate them, and their \"partners\" will say, \"You did not used to worship us,",
            "description": [
                "The words of the Qur'anic text are",
                " **** Some Qur'an- commentators have interpreted these",
                " words to signify that God will sunder",
                " the relationship that has come to exist",
                " in the worldly life between false deities",
                " and their polytheistic devotees with the result",
                " that one will not show any solicitude",
                " to the other. But such an interpretation",
                " is not consistent with the Arabic literary",
                " usage. According to Arabic usage, the words",
                " suggest that God will cause the one",
                " to become distinct from the other. It",
                " is this sense which is reflected in",
                " our translation: '. . . We shall",
                " remove the veil of strangeness from among",
                " them'. What is meant by this is",
                " that false deities and their devotees will",
                " confront each other, and it will become",
                " quite clear as to what distinguishes one",
                " group from the other. The polytheists will",
                " come to know those they considered to",
                " be their gods, and the false deities",
                " will also come to know those who",
                " had worshipped them."
            ]
        },
        {
            "id": "[10:29]",
            "verse": "And sufficient is Allah as a witness between us and you that we were of your worship unaware.\"",
            "description": [
                "This shows how the false gods will",
                " react to their worshippers. Angels who had",
                " been declared gods and goddesses and therefore,",
                " worshipped, the jinn, the spirits, the forefathers",
                " of yore, the Prophets, and the saints",
                " and martyrs who were considered to share",
                " with God some of His attributes, will",
                " all disavow their devotees. They will tell",
                " the latter in quite plain terms that",
                " they were not even aware that they",
                " were being worshipped; that even if they",
                " had been prayed to, called upon or",
                " cried out to, or had had offerings",
                " or sacrifices made in their name, or",
                " who had had reverence, adoration, prostration, rituals",
                " or ceremonies performed out of devotion for",
                " them, none of these had ever reached",
                " them."
            ]
        },
        {
            "id": "[10:30]",
            "verse": "There, [on that Day], every soul will be put to trial for what it did previously, and they will be returned to Allah, their master, the Truth, and lost from them is whatever they used to invent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:31]",
            "verse": "Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?\" They will say, \"Allah,\" so say, \"Then will you not fear Him?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:32]",
            "verse": "For that is Allah, your Lord, the Truth. And what can be beyond truth except error? So how are you averted?",
            "description": [
                "Since it is God alone Who has",
                " the power to do all that has",
                " been mentioned here - the provision of",
                " livelihood, the bestowing of vision and hearing,",
                " the granting of life and causing death,",
                " and since even the unbelievers affirmed that",
                " it is Allah alone Who causes all",
                " that, then it is obvious that He",
                " alone deserves to be held as the",
                " true Lord, Provider and Master of man,",
                " and hence the Only One Who deserves",
                " to be worshipped. How, then, can any",
                " others than Allah - those who have",
                " no share in any of the things",
                " mentioned above - be considered to have",
                " any share in His Lordship?",
                "*39). Addressing",
                " the generality of the unbelievers, the Qur'an",
                " inquires: 'How. then, are you, being turned",
                " away?' The question that is posed here",
                " makes it clear that it is not",
                " the unbelievers themselves who are guilty of",
                " turning away, rather they are being made",
                " to turn away from the right way",
                " and that this is happening under the",
                " influence of some person or group who",
                " is engaged in misleading people, It is",
                " for this reason that in effect people",
                " are being asked: 'Why should they go",
                " about blindly following those who are out",
                " to mislead people? Why should they not",
                " use their brains and think for themselves",
                " why they are being turned in a",
                " direction which is contrary to reality?'",
                "This",
                " mode of questioning, with some modifications, appears",
                " on a number of occasions in the",
                " Qur'an. On all such occasions the question",
                " has been asked in the passive voice.",
                " This was presumably to avoid a pointed",
                " reference to those who were actually engaged",
                " in misleading people. This should make it",
                " possible for people who had held these",
                " leaders of misguidance in considerable esteem to",
                " consider the matter dispassionately. Such a mode",
                " should also spare them any provocation that",
                " might impair their capacity to think about",
                " the issue coolly. For it is quite",
                " obvious that pointed references to specific persons",
                " might have been exploited so as to",
                " provoke people by pointing out that their",
                " venerated forefathers and religious mentors were being",
                " maliciously criticized and attacked.",
                "This manner of",
                " address - the use of the passive",
                " rather than the active voice and the",
                " avoidance of pointed references to specific persons",
                " as the ringleaders of misguidance and mischief",
                " - embodies a valuable piece of wisdom",
                " for those who seek to invite others",
                " to accept the Message of Islam."
            ]
        },
        {
            "id": "[10:33]",
            "verse": "Thus the word of your Lord has come into effect upon those who defiantly disobeyed - that they will not believe.",
            "description": [
                "Even though God's Message has been elaborated",
                " with the help of clear and easy-to-understand",
                " arguments, those who have already made up",
                " their minds against it will continue in",
                " their stubbornness and will simply refuse to",
                " accept it."
            ]
        },
        {
            "id": "[10:34]",
            "verse": "Say, \"Are there of your 'partners' any who begins creation and then repeats it?\" Say, \"Allah begins creation and then repeats it, so how are you deluded?\"",
            "description": [
                "The unbelievers did acknowledge that God alone",
                " had brought everything into existence in the",
                " first instance, that none of those who",
                " had been associated with God in His",
                " divinity had any part in it. As",
                " for resurrection, which simply amounts to repeating",
                " the initial act of creation, it is",
                " quite evident that He Who has the",
                " power to create, also has the power",
                " to repeat; anything else would be inconceivable.",
                " All this is so reasonable and clear",
                " that in their heart of hearts even",
                " rank polytheists were convinced of its truth.",
                " Yet they were hesitant to affirm it",
                " for if they did so, it would",
                " make it difficult for them to deny",
                " the existence of the Hereafter.",
                "It is",
                " for this reason that in response to",
                " the earlier question (see verse 31 above)",
                " it has been mentioned that the unbelievers",
                " acknowledge that God alone brought about the",
                " creation. But with regard to the question",
                " of repeating that creation, it is the",
                " Prophet (peace be on him) who has",
                " been asked here to proclaim that it",
                " is God alone Who brought about the",
                " original creation and it is He Who",
                " will create again.",
                "*42).The unbelievers are being",
                " asked to see reason. For on the",
                " one hand they themselves recognize that it",
                " is Allah alone Who causes their birth",
                " and death, and on the other, they",
                " are being misdirected by their so-called religious",
                " leaders into believing that they ought to",
                " worship and adore others than Allah."
            ]
        },
        {
            "id": "[10:35]",
            "verse": "Say, \"Are there of your 'partners' any who guides to the truth?\" Say, \"Allah guides to the truth. So is He who guides to the truth more worthy to be followed or he who guides not unless he is guided? Then what is [wrong] with you - how do you judge?\"",
            "description": [
                "This verse raises an important issue which",
                " should be grasped well. Man's necessities in",
                " his worldly life are not confined to",
                " subsistence, to the provision of shelter and",
                " clothing, to protection from calamities, hardships and",
                " losses. Man also needs something else, and",
                " this is his direst need. This is",
                " the need to know how to live",
                " in the world; how he should relate",
                " with himself and the powers and potentialities",
                " with which he has been endowed; how",
                " he should relate with the resources of",
                " the world which have been placed under",
                " his control, with the innumerable human beings",
                " with whom he comes into contact, and",
                " with the order of the universe as",
                " a whole within which, willy-nilly, he has",
                " to operate.",
                "Man needs to know all",
                " this so as to ensure the achievement",
                " of overall success in his life and",
                " to see to it that his energies",
                " and efforts do not count for naught.",
                " To ensure that his energies and efforts",
                " are not misdirected or employed in a",
                " manner that would lead to his destruction.",
                " This right way - the way that",
                " provides guidance concerning all the above questions",
                " -constitutes 'the truth', and the guidance which",
                " directs man to this truth is 'the",
                " true guidance'. Now. the Qur'an asks the",
                " unbelievers, who had rejected the Prophet's Message,",
                " whether any of their deities whom they",
                " worshipped besides God, could direct them to",
                " 'the truth\".1 The answer to this question",
                " is obviously in the negative. In order",
                " to understand this it must be remembered",
                " that the deities they worshipped besides God",
                " can be divided into two broad categories;",
                "",
                "1. The first category consists of the",
                " gods and goddesses, and those living or",
                " dead persons, whom people worship. People turn",
                " to them believing that they are capable",
                " of satisfying their needs in a supernatural",
                " way and of protecting them from calamities.",
                " But as far as guiding people to",
                " the right way is concerned, it is",
                " quite obvious that false gods had never",
                " provided any such guidance. Even the worshippers",
                " of those gods had never sought such",
                " guidance from them, nor did the polytheists",
                " ever claim that those gods taught them",
                " anything relating to morality, social conduct, culture,",
                " economy, polity, law and justice.",
                "2. The",
                " second category consists of those outstanding people",
                " who lay down the principles and laws",
                " which others follow. Such persons are doubtlessly",
                " leaders of others. But are they really",
                " those who lead people to the truth?",
                " Does the knowledge of any of those",
                " leaders encompass all that needs to be",
                " known in order to lay down sound",
                " principles for the guidance of mankind? Do",
                " any of them possess the breadth of",
                " vision that takes into account the whole",
                " gamut of issues relating to human life?",
                " Can any one of them claim to",
                " be free of those biases, those personal",
                " or national pre-occupations, those interests and desires,",
                " inclinations and predilections which prevent people from",
                " laying down perfectly just laws for human",
                " society? As it is, since the answer",
                " to these questions is in the negative",
                " - and .since the answer of any",
                " sensible person to these questions could never",
                " be in the positive - how can",
                " any of those human beings be considered",
                " to be dependable sources of guidance to",
                " the truth?",
                "It is for this reason",
                " that the Qur'an asks people whether any",
                " of their gods could lead them to",
                " the truth? This question, combined with the",
                " previous ones, helps man to arrive at",
                " a definitive conclusion concerning the whole question",
                " of religion. If one were to face",
                " the question with a clear mind, it",
                " is evident that man stands in dire",
                " need of One to Whom he could",
                " look up to as his Lord; One",
                " in Whom he could seek refuge and",
                " Whose protection he could solicit; One Who",
                " might answer his prayer and grant his",
                " supplication; One to Whom. notwithstanding the undependable",
                " nature of the worldly means of support,",
                " he could turn to for effective help",
                " and support. The questions posed above inevitably",
                " lead to the conclusion that this need",
                " can be met by none other than",
                " God.",
                "In addition, man also stands in",
                " need of a guide who might teach",
                " him the principles of righteous conduct, who",
                " might teach him the laws that he",
                " might follow with full confidence. Even here",
                " it is quite clear that God alone",
                " can meet this need of man. Once",
                " these matters become clear, there remains no",
                " justification to adhere either to polytheistic religions",
                " or to secular principles of morality. culture",
                " and polity."
            ]
        },
        {
            "id": "[10:36]",
            "verse": "And most of them follow not except assumption. Indeed, assumption avails not against the truth at all. Indeed, Allah is Knowing of what they do.",
            "description": [
                "Those who, in disregard of God's guidance,",
                " invented religions, developed philosophies and prescribed laws",
                " to govern human life did not do",
                " this with the help of any definite",
                " knowledge that they possessed; rather, it would",
                " be the result of their conjecture and",
                " fancy. Likewise, those who followed their religious",
                " and worldly leaders did so not because",
                " they fully knew and fully understood all",
                " that the latter espoused. Rather, they followed",
                " those leaders merely on the gratuitous assumption",
                " that whatever was being taught by those",
                " great people, and whatever had been recognized",
                " as 'right1 by their own forefathers, must",
                " indeed be true."
            ]
        },
        {
            "id": "[10:37]",
            "verse": "And it was not [possible] for this Qur'an to be produced by other than Allah, but [it is] a confirmation of what was before it and a detailed explanation of the [former] Scripture, about which there is no doubt, from the Lord of the worlds.",
            "description": [
                "The statement that it is 'a confirmation",
                " of the revelation made before it' underscores",
                " that the Qur'an lays no claim of",
                " introducing anything novel, of coming forth with",
                " any innovation at variance with the fundamental",
                " teachings already communicated to man through the",
                " Prophets (peace be on them). The Qur'anic",
                " claim merely consists of confirming and authenticating",
                " those teachings. Had the Qur'an been the",
                " product of the imagination of the founder",
                " of an altogether new religion, the outcome",
                " of a creative brain, it would have",
                " borne traces of novelty in order to",
                " emphasize its distinctiveness.",
                "The second part of",
                " the statement, namely that the Qur'an is",
                " a 'detailed exposition of the Book' is",
                " equally significant. What this means is that",
                " the Qur'an elaborates those fundamental teachings which",
                " constitute the core and essence of all",
                " the scriptures (al-Kitab); that is, those teachings",
                " which have been sufficiently elucidated in the",
                " Qur'an so that they might be grasped",
                " by people and penetrate their hearts; and",
                " additionally, it has been shown how those",
                " teachings could be applied to practical life.",
                ""
            ]
        },
        {
            "id": "[10:38]",
            "verse": "Or do they say [about the Prophet], \"He invented it?\" Say, \"Then bring forth a surah like it and call upon [for assistance] whomever you can besides Allah, if you should be truthful.\"",
            "description": [
                "It is generally believed that the challenge",
                " embodied in this verse has a reference",
                " merely to the eloquence, rhetoric and other",
                " literary qualities of the Qur'an. Were one",
                " to read the writings of Muslim scholars",
                " in connection with the explanation of this",
                " verse, it is not surprising that people",
                " should entertain such a misunderstanding.",
                "However, the",
                " Qur'an is far above claiming its uniqueness",
                " and inimitability merely on the grounds of",
                " its literary merits. Although there can be",
                " no doubt about the literary excellence of",
                " the Qur'an, the main ground on which",
                " it is claimed that no human being",
                " could produce a book like it has",
                " to do with its contents and teaching.",
                " The Qur'an alludes, in many places, to",
                " those characteristics of its inimitability which could",
                " not have been conferred upon it by",
                " man, thus hinting that those characteristics could",
                " have no other source but God Himself.",
                " We have explained, in the course of",
                " this work, all such allusions in the",
                " Qur'an. In order to avoid repetition, we",
                " would like at this stage to avoid",
                " engaging in any discussion on that subject.",
                " (For further explanation see al-Tur 52, nn.",
                " 26-7.)"
            ]
        },
        {
            "id": "[10:39]",
            "verse": "Rather, they have denied that which they encompass not in knowledge and whose interpretation has not yet come to them. Thus did those before them deny. Then observe how was the end of the wrongdoers.",
            "description": [
                "There can only be two justifiable grounds",
                " for those who wish to reject the",
                " Qur'an as a false scripture: either they",
                " should have definite knowledge to the effect",
                " that it is a fabrication or they",
                " should be able to demonstrate that the",
                " statements made by, or the information contained",
                " in it, are false. But as things",
                " stand, neither of these two reasons is",
                " available. For none can contend, on the",
                " basis of definite knowledge, that the Book",
                " had been authored by someone who, in",
                " his turn, falsely attributed it to God.",
                " Nor has anyone been able to penetrate",
                " the realms of the suprasensory world and",
                " claim, on that basis, that they know",
                " for sure that this Book contains false",
                " information; that whereas in fact there are",
                " several gods, this Book claims that there",
                " is none other than the One God;",
                " that all its statements about matters such",
                " as the existence of God and angels",
                " are counter to reality. Nor has anyone",
                " returned to life after having suffered death",
                " to contend that the Qur'anic statement about",
                " the reckoning and reward and punishment in",
                " the Next Life is false. Those who",
                " continue to decry the Qur'an as false",
                " are in fact doing so merely on",
                " grounds of conjecture, even though they do",
                " this with an air of confidence which",
                " at times creates the impression that statements",
                " about the fakeness and falsity of the",
                " Qur'anic teachings are scientifically established facts."
            ]
        },
        {
            "id": "[10:40]",
            "verse": "And of them are those who believe in it, and of them are those who do not believe in it. And your Lord is most knowing of the corrupters",
            "description": [
                "The statement that 'Your Lord knows best",
                " the mischief-makers' underscores art important fact about",
                " unbelievers. Those unbelievers could certainly silence others",
                " into not carrying the discussion any further",
                " by openly admitting that they had failed",
                " to grasp the teaching of the Qur'an",
                " and hence it was not possible for",
                " them to sincerely believe in it. God,",
                " however, is well aware even of the",
                " things that are hidden, even those that",
                " are in the deepest recesses of their",
                " hearts and minds. He knows how each",
                " person has sealed his mind and heart",
                " against accepting any truth; how he has",
                " sought to immerse himself in heedlessness; how",
                " he has managed to suppress his conscience;",
                " how he has prevented the testimony of",
                " the truth from affecting his heart; how",
                " he has destroyed the innate capacity of",
                " his mind to accept the truth; how",
                " he has heard the call of the",
                " truth and has turned a deaf ear",
                " to it; and how, despite his ability",
                " to understand the Message of God, he",
                " has made no effort to do so.",
                " Such people cherish their biases and prejudices,",
                " their lusts and desires, their worldly advantages",
                " and the interests which can be procured",
                " only by supporting falsehood, much more than",
                " by accepting the truth. Such people can",
                " hardly be considered to have innocently succumbed",
                " to a 'mistake'. On the contrary, they",
                " are rank 'mischief-makers'."
            ]
        },
        {
            "id": "[10:41]",
            "verse": "And if they deny you, [O Muhammad], then say, \"For me are my deeds, and for you are your deeds. You are disassociated from what I do, and I am disassociated from what you do.\"",
            "description": [
                "Since every individual is himself accountable for",
                " his deeds, there is no point in",
                " engaging in unnecessary discussions which are often",
                " actuated by obduracy. For if the Prophet",
                " (peace be on him) was indeed inventing",
                " lies, he would bear the evil consequence",
                " of such an action. On the other",
                " hand, if his opponents were denying the",
                " truth, their action will not hurt the",
                " Prophet (peace be on him), but rather",
                " hurt themselves."
            ]
        },
        {
            "id": "[10:42]",
            "verse": "And among them are those who listen to you. But can you cause the deaf to hear, although they will not use reason?",
            "description": [
                "In its most elementary sense even animals",
                " are possessed of the faculty of hearing.",
                " But 'hearing' in its true sense is",
                " applicable only when the act of hearing",
                " is accompanied with the attention required to",
                " grasp the meaning of what one hears,",
                " and with the readiness to accept it",
                " if it is found reasonable. Those who",
                " have fallen prey to prejudices, who have",
                " made up their minds that they will",
                " not hear, let alone accept anything, howsoever",
                " reasonable it might be, if it goes",
                " against their inherited beliefs and behaviour-patterns, or",
                " is opposed to living a life of",
                " heedlessness, as the animals do, or who",
                " focus all their attention on the gratification",
                " of their palate, or who recklessly pursue",
                " their lusts in total disregard of all",
                " consideration of right and wrong may also",
                " be rightly characterized as incapable of hearing.",
                " Such people are not deaf of hearing,",
                " but their minds and hearts are certainly",
                " deaf to the truth."
            ]
        },
        {
            "id": "[10:43]",
            "verse": "And among them are those who look at you. But can you guide the blind although they will not [attempt to] see?",
            "description": [
                "The import of the statement is substantially",
                " the same as that made above. The",
                " limb called the 'eye' is of little",
                " service if it serves no other purpose",
                " than that of observation. For the eye,",
                " as an instrument of observation, is also",
                " available to animals and they use it",
                " solely for that purpose. What is of",
                " true worth is the mental eye which",
                " ought to enable man to see not",
                " only that which is apparent and evident,",
                " but also that which is beyond that.",
                " If a man is not possessed of",
                " this mental eye - which is the",
                " true eye - then even though he",
                " might be able to observe in the",
                " literal sense of the word, he cannot",
                " be considered to be one who truly",
                " sees.",
                "Both these verses are addressed to",
                " the Prophet (peace be on him). But",
                " it is to those whom he wanted",
                " to reform rather than directly to himself",
                " that the reproach was directed. Moreover, the",
                " purpose of the statement is not just",
                " to reproach. The pinching sarcasm which has",
                " been employed in the statement aims at",
                " awakening the slumbering humanity of people so",
                " that they may be able to take",
                " heed.",
                "The manner of the discourse brings",
                " to mind the image of a righteous",
                " man who lives in the midst of",
                " a corrupt people. He is a man",
                " who maintains for himself extremely high standards",
                " of character and conduct. At the same",
                " time, he attempts, out of sincerity and",
                " goodwill, to awaken his fellow-beings to realize",
                " the low depths to which they have",
                " sunk. He also seeks to explain to",
                " them, out of sincere concern for them,",
                " how evil their ways of life are.",
                " And above all, he highlights for them",
                " the contours of the right way of",
                " life. But the people around him are",
                " such that they are neither inspired to",
                " righteousness by his practical and righteous example,",
                " nor do they pay any heed to",
                " his earnest counsel and admonition. The purpose",
                " of what has been said here, viz.'...",
                " will you, then, make the deaf hear",
                " even though they understand nothing?' should be",
                " understood in the above context.",
                "This statement",
                " resembles the remark of someone who, feeling",
                " disgusted when he finds his friend fails",
                " to make people hear his earnest exhortations,",
                " throws up his hands in exasperation and",
                " says: 'Are you not wasting your time,",
                " my friend, trying to make the deaf",
                " hear, or trying to direct the blind",
                " to the right path? The ears that",
                " would make them listen to the voice",
                " of the truth are sealed; the eyes",
                " that could have made them perceive the",
                " truth have been blinded.' The purpose of",
                " so saying is not to reproach that",
                " righteous person for his sincere exhortation nor",
                " to prevent him from making his efforts",
                " to reform people. What"
            ]
        },
        {
            "id": "[10:44]",
            "verse": "Indeed, Allah does not wrong the people at all, but it is the people who are wronging themselves.",
            "description": [
                "God has generously endowed people with all",
                " that is needed to help them distinguish",
                " between truth and falsehood - ears, eyes,",
                " and hearts. But some people have become",
                " virtual slaves to their lusts and are",
                " utterly spellbound by the allurements of a",
                " worldly life. By so doing, they have",
                " caused their eyes to go blind, their",
                " ears to become deaf, and have perverted",
                " their hearts to such a degree that",
                " they have become bereft of the capacity",
                " to distinguish between what is good and",
                " what is evil, what is right and",
                " what is wrong, and have debilitated their",
                " conscience to such a degree that it",
                " has ceased to have any effect on",
                " their lives."
            ]
        },
        {
            "id": "[10:45]",
            "verse": "And on the Day when He will gather them, [it will be] as if they had not remained [in the world] but an hour of the day, [and] they will know each other. Those will have lost who denied the meeting with Allah and were not guided",
            "description": [
                "A time will come when such people",
                " will, on the one hand, come face",
                " to face with the infinite life of",
                " the Hereafter, and on the other, they",
                " will took back at their past worldly",
                " life and realize how puny it was",
                " as compared to the life ahead. It",
                " is then that they will comprehend what",
                " folly they have committed by ruining their",
                " eternal future for the sake of ephemeral",
                " pleasures and benefits in this worldly life.",
                "",
                "*54). This refers to the unbelievers' rejection",
                " that a time will come when everyone",
                " will have to stand before God for",
                " His judgement."
            ]
        },
        {
            "id": "[10:46]",
            "verse": "And whether We show you some of what We promise them, [O Muhammad], or We take you in death, to Us is their return; then, [either way], Allah is a witness concerning what they are doing",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:47]",
            "verse": "And for every nation is a messenger. So when their messenger comes, it will be judged between them in justice, and they will not be wronged",
            "description": [
                "The Qur'anic expression ummah is not to",
                " be taken in the narrow sense in",
                " which the word 'nation' is used. The",
                " word ummah embraces all those who receive",
                " the message of a Messenger of God",
                " after his advent. Furthermore, this word embraces",
                " even those among whom no Messenger is",
                " physically alive, provided that they have received",
                " his message. All those who, after the",
                " advent of a Messenger, happen to live",
                " in an age when the teachings of",
                " that Messenger are extant or at least",
                " it is possible for people to know",
                " about what he had taught, constitute the",
                " ummah of that Messenger, Besides, all such",
                " people will be subject to the law",
                " mentioned here (see verse 47 and n.",
                " 56). In this respect all human beings",
                " who happen to live in the age",
                " which commences with the advent of Muhammad",
                " (peace be on him) onwards are his",
                " ummah and will continue to be so",
                " as long as the Qur'an is available",
                " in its pristine purity. Hence the verse",
                " does not say: 'Among every people there",
                " is a Messenger.' It rather says: 'There",
                " is a Messenger for every people.'",
                "*56).",
                " When the message of a Messenger of",
                " God reaches a people the stage is",
                " set and they are left with no",
                " valid excuse for not believing. Everything has",
                " already been done to communicate the truth",
                " to these people and so all that",
                " remains is to wait for God's decision",
                " to inflict His punishment upon them. And",
                " so far as God's judgement is concerned,",
                " it is marked with absolute justice. All",
                " those who obey that Messenger and mend",
                " their behaviour are deemed worthy of God's",
                " mercy. On the contrary, those who reject",
                " his teaching are considered deserving of His",
                " punishment, depending on God's will, both in",
                " this world and the Hereafter."
            ]
        },
        {
            "id": "[10:48]",
            "verse": "And they say, \"When is [the fulfillment of] this promise, if you should be truthful?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:49]",
            "verse": "Say, \"I possess not for myself any harm or benefit except what Allah should will. For every nation is a [specified] term. When their time has come, then they will not remain behind an hour, nor will they precede [it].\"",
            "description": [
                "In response to the unbelievers' query, the",
                " Prophet (peace be on him) makes it",
                " clear that he had never claimed that",
                " he himself would come forth with the",
                " judgement mentioned above, or that it lay",
                " in his power to afflict people with",
                " punishment. There was no point, therefore, in",
                " asking him when the final judgement against",
                " them would come to pass. The warning",
                " of punishment had been given by God",
                " rather than by the Messenger. Hence it",
                " lay only in God's power to decide",
                " when His judgement should come to pass,",
                " and in which form God would execute",
                " His warning to punish unbelievers.",
                "*58). God",
                " does not act in haste in judging",
                " a people. He does not summarily punish",
                " or reward people the very moment they",
                " reject or accept a Messenger's call. Instead,",
                " God grants a long respite both to",
                " individuals and to nations. He once that",
                " term - which has been determined by",
                " God with full justice - is over,",
                " and the individual or nation concerned does",
                " not give up its rebellious attitude, God's",
                " judgement is enforced. The time for the",
                " enforcement of such judgement can never come",
                " a moment before or after the time",
                " fixed for it by God."
            ]
        },
        {
            "id": "[10:50]",
            "verse": "Say, \"Have you considered: if His punishment should come to you by night or by day - for which [aspect] of it would the criminals be impatient?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:51]",
            "verse": "Then is it that when it has [actually] occurred you will believe in it? Now? And you were [once] for it impatient",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:52]",
            "verse": "Then it will be said to those who had wronged, \"Taste the punishment of eternity; are you being recompensed except for what you used to earn?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:53]",
            "verse": "And they ask information of you, [O Muhammad], \"Is it true?\" Say, \"Yes, by my Lord. Indeed, it is truth; and you will not cause failure [to Allah].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:54]",
            "verse": "And if each soul that wronged had everything on earth, it would offer it in ransom. And they will confide regret when they see the punishment; and they will be judged in justice, and they will not be wronged",
            "description": [
                "Throughout their lives the unbelievers denied that",
                " they would be resurrected and called to",
                " account by God. Considering the Next Life",
                " a mere illusion, they wasted their lives",
                " on vain pursuits and levelled all kinds",
                " of allegations against the Prophets who had",
                " forewarned them that the Next Life would",
                " inevitably come to pass. All this notwithstanding,",
                " a moment will come when they will",
                " find themselves face to face with the",
                " Next Life. When such a moment comes",
                " they will be totally unnerved. In view",
                " of their evil deeds, their conscience will",
                " intimate to them the end they are",
                " going to meet. Speechless and haggard, their",
                " hearts will begin to sink out of",
                " remorse and regret. Those who had staked",
                " their all on vain fancies, and had",
                " refused to take any heed of the",
                " admonition of their well-wishers, whom else can",
                " they blame except themselves for the catastrophe",
                " that will confront them?"
            ]
        },
        {
            "id": "[10:55]",
            "verse": "Unquestionably, to Allah belongs whatever is in the heavens and the earth. Unquestionably, the promise of Allah is truth, but most of them do not know",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:56]",
            "verse": "He gives life and causes death, and to Him you will be returned",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:57]",
            "verse": "O mankind, there has to come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:58]",
            "verse": "Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:59]",
            "verse": "Say, \"Have you seen what Allah has sent down to you of provision of which you have made [some] lawful and [some] unlawful?\" Say, \"Has Allah permitted you [to do so], or do you invent [something] about Allah?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:60]",
            "verse": "And what will be the supposition of those who invent falsehood about Allah on the Day of Resurrection? Indeed, Allah is full of bounty to the people, but most of them are not grateful.\"",
            "description": [
                "The word rizq is often used in",
                " daily parlance to denote 'eatables'. Hence, many",
                " people think that the reproach embodied in",
                " the present verse is directed merely against",
                " the wrong customs that have come into",
                " vogue in that narrow realm of behaviour",
                " which is confined to the dining room.",
                " It is not only those who are",
                " ignorant but also those who are learned",
                " about Islam that are victims of this",
                " misconception.",
                "However, use of the word rizq",
                " in Arabic is not confined to eatables.",
                " It is used in a broad sense,",
                " and covers all the things that are",
                " granted to man by God for his",
                " use. Whatever God has conferred on man",
                " thus constitutes his rizq, including his offspring.",
                " In the works of the branch of",
                " knowledge called Asma al-Rijal (which is part",
                " of the Hadith Sciences), we find, among",
                " the transmitters of traditions, several names such",
                " as Rizq, Ruzayq, and Rizq Allah which",
                " signify the recipients of God's bounty. In",
                " the famous invocative prayer ****. 'O God:",
                " Show us the truth and grant us",
                " the strength (urzuqna) to follow it', the",
                " rizq that a person seeks from God",
                " is the strength to follow the truth",
                " after God has enabled him to perceive",
                " it. Here rizq has been used to",
                " mean the conferment of the bounty of",
                " knowledge on someone. In a tradition we",
                " have been told that Allah sends an",
                " angel to the womb of every expectant",
                " mother and that he writes down what",
                " the rizq, the life-span, and deeds of",
                " the to-be-born child are to be (see",
                " al-Bukhari, Kitab Bad' al-Khalq, Bad Dhikr al-Mala'",
                " ikah -Ed.). It is quite obvious that",
                " the word rizq here does not signify",
                " merely the eatables that child will receive",
                " during its life-lime; it rather signifies the",
                " totality of the things that it will",
                " receive. We also find the expression ****j",
                " in the Qur'an. (See al-Baqarah 2: 3;",
                " al-Anfal 8: 3 - Ed.)",
                "It is,",
                " therefore, a serious mistake to consider rizq",
                " as being confined to the realm of",
                " the kitchen and the dining table. Likewise,",
                " it is a mistake, and quite a",
                " serious one to think that God disapproves",
                " only if those rules in the domain",
                " of food are broken and does not",
                " mind if people do so in other",
                " domains of life.",
                "The error that people",
                " so commit has very grave consequences. As",
                " a result of this misconception, an important",
                " principle of Islam has been lost sight",
                " of. For it is owing to this",
                " misconception that while lawfulness or otherwise in",
                " regard to eating and drinking is considered",
                " a seriously religious issue, even highly religious",
                " people, let alone ordinary Muslims, feel no",
                " serious repugnance about the notion that in",
                " the collective sphere of life man has",
                " the right to lay down the rules",
                " of his behaviour. Even the most learned",
                " and pious religious scholars feel no revulsion",
                " against legislating without reference to God and",
                " His Book. Nor do they feel that",
                " such legislation is as sharply in conflict",
                " with Islam as one's laying down what",
                " is lawful and what is unlawful in",
                " matters of food and drink.",
                "*61). The",
                " purpose of the verse is to make",
                " people realize what an enormous act of",
                " rebellion people are committing by laying down,",
                " of their own accord, the limits that",
                " are lawful and those that are unlawful.",
                " Are they not conscious of the fact",
                " that human beings and all that they",
                " possess belong to Allah? If they are",
                " conscious of it, how can it be",
                " considered justifiable for men to lay down",
                " as to how they should use the",
                " possessions bestowed upon them by Allah? What",
                " would their own opinion be about the",
                " servant who claims that he has the",
                " full right to lay down the rules",
                " for the disposal of his master's property,",
                " and who believes that his master has",
                " no right to determine anything? Were a",
                " person's own servant to make such a",
                " claim about his master, how would the",
                " latter react to it? As for the",
                " servant who goes so far as even",
                " to deny that he is a servant",
                " or denies that he is answerable to",
                " a master, or who denies that the",
                " property under his care belongs to his",
                " master, he is guilty of an even",
                " greater monstrosity, and is beyond the scope",
                " of our discussion here. What is being",
                " discussed is the case of one who,",
                " on the one hand, acknowledges that he",
                " is the servant of a master and",
                " that the property in his possession has",
                " been entrusted to him by the master,",
                " and rightfully belongs to the master. Notwithstanding",
                " this acknowledgement, the servant claims that he",
                " has the right to lay down, independently",
                " of the master, the rules for using",
                " that properly.",
                "*62). If the master had",
                " authorized the servant to use his property",
                " as the latter wished and to lay",
                " down the rules for so doing as",
                " he pleased, the servant, would have been",
                " justified in doing so. But do these",
                " people really have any evidence to prove",
                " that they had been granted any such",
                " authorization by their master? Or is it",
                " that such a claim was backed by",
                " no such authorization? If they do nut",
                " have any evidence to produce such an",
                " authorization, they are guilty not only of",
                " rebellious behaviour, but also of lies and",
                " fabrications.",
                "*63). It is indeed an act",
                " of utmost favour on the part of",
                " the master that he informs his servant",
                " of the attitude he should adopt to",
                " the master's house and to other belongings",
                " and even with regard to his own",
                " self as he is able to obtain",
                " God's good pleasure and how he would",
                " be able to escape his wrath and",
                " punishment, But many servants are not sufficiently",
                " grateful to their master for this favour.",
                " It seems that the right thing would",
                " have been for the master to have",
                " left his properties at the servant's disposal",
                " without informing him of what would lead",
                " to reward and what would lead to",
                " punishment. He should then have kept a",
                " secret watch over his servants and punished",
                " those who work contrary to his desire",
                " - a desire which had not even",
                " been made known to them. The fact",
                " is that if the master had put",
                " his servants to such a severe test",
                " none would have escaped his punishment."
            ]
        },
        {
            "id": "[10:61]",
            "verse": "And, [O Muhammad], you are not [engaged] in any matter or recite any of the Qur'an and you [people] do not do any deed except that We are witness over you when you are involved in it. And not absent from your Lord is any [part] of an atom's weight within the earth or within the heaven or [anything] smaller than that or greater but that it is in a clear register.",
            "description": [
                "The purpose of the statement is to",
                " console the Prophet (peace be on him)",
                " and to warn his enemies. On the",
                " one hand, the Prophet (peace be on",
                " him) is being reassured that the resoluteness,",
                " diligence and perseverance which characterize his efforts",
                " in preaching the truth and attempting to",
                " reform people is well known to God.",
                " It can hardly be conceived that after",
                " entrusting to the Prophet (peace be on",
                " him) a perilous task that God would",
                " leave him alone, unassisted. God knows full",
                " well all what the Prophet (peace be",
                " on him) does, and is also well",
                " aware of how others behave towards him.",
                " At the same time what is being",
                " said also constitutes a warning to the",
                " Prophet's opponents. If they obstruct the efforts",
                " of the Messenger of the truth, of",
                " one engaged in reforming mankind out of",
                " sincerity and goodwill, there is no reason",
                " for them to assume that no one",
                " is observing their deeds, or that they",
                " will never be called to account. They",
                " ought to take heed for all their",
                " deeds are being duly recorded on the",
                " Divine Scroll."
            ]
        },
        {
            "id": "[10:62]",
            "verse": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:63]",
            "verse": "Those who believed and were fearing Allah",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:64]",
            "verse": "For them are good tidings in the worldly life and in the Hereafter. No change is there in the words of Allah. That is what is the great attainment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:65]",
            "verse": "And let not their speech grieve you. Indeed, honor [due to power] belongs to Allah entirely. He is the Hearing, the Knowing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:66]",
            "verse": "Unquestionably, to Allah belongs whoever is in the heavens and whoever is on the earth. And those who invoke other than Allah do not [actually] follow [His] \"partners.\" They follow not except assumption, and they are not but falsifying",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:67]",
            "verse": "It is He who made for you the night to rest therein and the day, giving sight. Indeed in that are signs for a people who listen.",
            "description": [
                "What is being said here in a",
                " summary fashion requires some elaboration. The statement",
                " refers to philosophical inquiry which aims atdiscovering",
                " the reality underlying the physical phenomena of",
                " the universe. All those who do not",
                " look up to revelation in order to",
                " know what such reality is, have to",
                " fall back, willy-nilly, on philosophical inquiry. Whether",
                " a person ends up with atheism, polytheism",
                " or monotheism, he perforce has recourse to",
                " philosophical inquiry of some sort in order",
                " to arrive at some conclusion about reality.",
                " Likewise, the worth of the religious doctrines",
                " propounded by the Prophets can also be",
                " determined by resort to philosophical reflection after",
                " which a person is likely to arrive",
                " at some conclusion as to whether the",
                " reality to which the physical phenomena allude",
                " makes any sense or not. The soundness",
                " of the conclusion at which a person",
                " arrives totally depends, however, on the soundness",
                " of the method of philosophical inquiry that",
                " is adopted. If the method is sound,",
                " so would the conclusion be; and vice",
                " versa.",
                "Let us now examine the methods",
                " that were adopted by different groups in",
                " this pursuit. Of these, the method used",
                " by the polytheists is based on superstition.",
                " As for the gnostic and ascetic hermits,",
                " even though they flaunt meditation as their",
                " characteristic method and claim their ability to",
                " penetrate the reality that lies beyond the",
                " phenomenal veil, their quest is based merely",
                " on conjecture. Likewise, what they claim to",
                " have observed is actually a product of",
                " their fancy. Swayed by it, they mistake",
                " their fancies for the truth.",
                "Now, philosophers",
                " are guided in their quest for reality",
                " by speculation which, it would seem, is",
                " nothing less than conjecture. But realizing that",
                " their conjecture has no respectable ground upon",
                " which to stand, philosophers provide the crutches",
                " of logical reasoning and phoney rationalism to",
                " support their quest, and give it the",
                " imposing title of philosophical inquiry.",
                "Then we",
                " come across scientists. In their own field,",
                " they resort to scientific methods of inquiry,",
                " but as soon as they enter the",
                " realm of the metaphysical, they abandon this",
                " method and proceed with guesswork and conjecture.",
                " The outlook of all these groups is",
                " impaired, afflicted with bias and prejudice of",
                " one sort or another. This makes them",
                " impervious to everything which is alien to",
                " them with the net result that they",
                " cling adamantly to their cherished ways. The",
                " Qur'an brands this kind of intellectual quest",
                " as essentially fallacious. It tells such people",
                " that the real cause of their malady",
                " is guesswork and conjecture in their pursuit",
                " of reality, and that they do not",
                " heed the reasonable counsel of others because",
                " of their deep-seated prejudices. The result is",
                " not only are they incapable of independently",
                " grasping reality, but their prejudice renders them",
                " incapable of arriving at any sound judgement",
                " regarding it even when it is expounded",
                " by the Prophets.",
                "In sharp contrast to",
                " these fallacious methods, the Qur'an lays down",
                " an altogether different method to guide men",
                " in their quest of reality. This requires,",
                " first of all, that one should heed",
                " with open ears and consider with open",
                " minds the statements of those who claim",
                " to be expounding their doctrine about reality",
                " not on the basis of speculation or",
                " conjecture, nor on the basis of meditation",
                " or intuitive conviction, but on the basis",
                " of 'knowledge'. They should then proceed to",
                " consider the phenomena which form a part",
                " of man's observation or experience of the",
                " universe (called ayat - signs - in",
                " the Qur'anic parlance); to systematize all that",
                " they come to know in this manner",
                " and to seriously reflect whether the phenomena",
                " seem to testify to the reality underlying",
                " the phenomena to which these people [i.e.",
                " the Prophets] have drawn their attention. If",
                " one finds sufficient grounds to affirm the",
                " truths propounded by the Prophets, why on",
                " earth should anyone contradict such truths? In",
                " our view, this very method is the",
                " basis of the philosophy of Islam and",
                " it is regrettable that even Muslim philosophers",
                " abandoned it and set out to follow",
                " in the footsteps of Plato and Aristotle.",
                "",
                "Not only does the Qur'an urge people,",
                " over and over again, to follow this",
                " method, but by frequently drawing attention to",
                " the physical phenomena and then showing how",
                " right conclusions can be derived from them,",
                " it also seems to train them to",
                " follow this method. Were one to consider",
                " even the present verse by way of",
                " example one would encounter reference to a",
                " couple of physical phenomena - night and",
                " day. The alternation of day and night",
                " is the outcome of an absolutely precise",
                " and well-regulated movement of the earth around",
                " the sun. This is an incontrovertible sign",
                " of the existence of an all-encompassing controller,",
                " of an all-powerful Lord Whose dominion embraces",
                " the whole universe. This alternation of day",
                " and night is also indicative of the",
                " infinite wisdom and purposiveness of the Creator",
                " since a lot of creatures of the",
                " earth depend upon it. This alternation is",
                " also indicative of the Providence, Mercy and",
                " Lordship of the Creator since it is",
                " evident that He Who has created all",
                " beings on earth has also made arrangements",
                " to cater to all their requirements.",
                "What",
                " this unmistakably proves is that the Creator",
                " is the One Who fully controls the",
                " entire universe and that far from being",
                " arbitrary and capricious. He is Wise. His",
                " actions also go to show that in",
                " view of His benevolence and providence He",
                " alone deserves to be served and worshipped.",
                " Also, this alternation of day and night",
                " clearly reveals that anything which is subject",
                " to the system of alternation of night",
                " and day is a servant and not",
                " the Lord. All this being the testimony",
                " of the natural phenomena, how can it",
                " ever be entertained that the religious doctrines",
                " developed by polytheists on the basis of",
                " their guesswork and conjecture have even a",
                " shred of legitimacy?"
            ]
        },
        {
            "id": "[10:68]",
            "verse": "They have said, \"Allah has taken a son.\" Exalted is He; He is the [one] Free of need. To Him belongs whatever is in the heavens and whatever is in the earth. You have no authority for this [claim]. Do you say about Allah that which you do not know?",
            "description": [
                "In the preceding verses, the polytheists were",
                " reproached for basing their religious doctrines on",
                " guesswork and conjecture, and then failing to",
                " examine, on scientific grounds, whether those doctrines",
                " were backed up by any supporting proof",
                " or not. In this verse, the Christians",
                " and followers of some other religions are",
                " being taken to task for another error",
                " - for their designating someone, again by",
                " resort to sheer conjecture, as God's son.",
                "",
                "*67). This Arabic expression ***** is used",
                " both in its literal sense and also",
                " by way of exclamation. As an exclamatory",
                " expression it emphasizes one's utter amazement about",
                " God. In its literal sense, it signifies",
                " that God is free of every defect",
                " and flaw. The above verse in question",
                " employs both meanings. For, apart from expressing",
                " amazement at the notion that God took",
                " someone as His son, it also stresses",
                " the perfection, the absolute flawlessness of God.",
                " Since God is perfect and flawless, how",
                " does it make any sense to say",
                " that He took someone as His son?",
                "",
                "*68). In refuting the notion that God",
                " took anyone as His son, three arguments",
                " are advanced:",
                "(i) God is free of",
                " all defects;",
                "(ii) God is All-Sufficient; and",
                "",
                "(iii) all that is in the heavens",
                " and in the earth belongs to Him.",
                "",
                "A brief elucidation of these statements will",
                " enable one to appreciate the meaning and",
                " significance of what is being said here.",
                " To be a son can have only",
                " two meanings: either he has sprung from",
                " his father's loins, that is, he is",
                " his father's son in the true sense",
                " of the term, and thus of his",
                " father's loins, or that he is not",
                " a son in the literal sense of",
                " the word but has merely been adopted",
                " as such. Now, if someone is considered",
                " to be a son of God in",
                " its true, literal sense, that would obviously",
                " amount to considering God akin to a",
                " mortal. Like any other mortal, God is",
                " conceived to belong to one gender or",
                " the other, and to stand in need",
                " of a spouse, and of some sort",
                " of conjugal relationship to enable the birth",
                " of offspring, and thus to ensure the",
                " continuity of his progeny. Alternatively, God is",
                " believed to have adopted someone as His",
                " son. Such a statement could either mean",
                " that God is akin to that issueless",
                " human who resorts to adoption in order",
                " that the adopted son might inherit Him",
                " and thus secure Him against the loss",
                " that would ensue from his being issueless,",
                " or at least partially offset that loss.",
                " The other possibility is that God also",
                " has certain emotional predilections and it is",
                " for this reason that He has fallen",
                " in love with one of His creatures",
                " to the extent of adopting him as",
                " His son. In each of the above-mentioned",
                " cases, the concept of God is marred",
                " by investing Him with several flaws, defects",
                " and weaknesses, and He is conceived as",
                " One lacking self-sufficiency, as One Who perforce",
                " must depend on others.",
                "Hence, the opening",
                " part of the verse clearly proclaims God",
                " to be free of all defects, deficiencies",
                " and weaknesses which people ascribe to Him.",
                " This is followed by saying that God",
                " is All-Sufficient, that is, He is free",
                " of all those needs which impel an",
                " issueless mortal to adopt someone as his",
                " son. This is further followed by the",
                " assertion that all that is in the",
                " heavens and in the earth belongs to",
                " God and hence all human beings, without",
                " any exception, are His servants and bondsmen.",
                " This makes ii clear that there is",
                " no personal relationship between God and any",
                " of His creatures that would prompt Him",
                " to choose any, to the exclusion of",
                " others, for elevation to the level of",
                " godhead. For sure, He holds certain people,",
                " on grounds of their merit, to be",
                " dearer than others. But God's love for",
                " someone does not mean that he is",
                " lifted up from the rank of being",
                " God's servant to becoming His associate and",
                " partner in godhead. What God's special love",
                " for some person means can be gauged",
                " from the following verse of the Qur'an:",
                " 'Oh, surely the friends of Allah have",
                " nothing to fear, nor shall they grieve",
                " - the ones who believe and are",
                " God-fearing. For them are glad tidings in",
                " this world and in the Hereafter' (see",
                " verses 62-4 above)."
            ]
        },
        {
            "id": "[10:69]",
            "verse": "Say, \"Indeed, those who invent falsehood about Allah will not succeed.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:70]",
            "verse": "[For them is brief] enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment because they used to disbelieve",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:71]",
            "verse": "And recite to them the news of Noah, when he said to his people, \"O my people, if my residence and my reminding of the signs of Allah has become burdensome upon you - then I have relied upon Allah. So resolve upon your plan and [call upon] your associates. Then let not your plan be obscure to you. Then carry it out upon me and do not give me respite.",
            "description": [
                "In the preceding verses a combination of",
                " convincing arguments and persuasive instruction was employed",
                " to drive home to the people that",
                " their intellectual outlook and way of life",
                " were faulty. As opposed to that, the",
                " right way for mankind was highlighted and",
                " it was shown why that way was",
                " right. Thereafter, attention was paid to candidly",
                " exposing the attitude which the unbelievers had",
                " adopted during the past eleven years: instead",
                " of mending their ways in the light",
                " of the reasonable criticism to which they",
                " had been subjected and in response to",
                " the right guidance offered to them, they",
                " became inveterate enemies of the very man",
                " who was expounding a message that could",
                " ensure their salvation and who sought their",
                " well-being and had no axe of his",
                " own to grind. Regrettably, they responded to",
                " his arguments by throwing brickbats and answered",
                " his sincere counsels by hurling filthy abuses",
                " at him. They found even the existence",
                " of this man in their midst, of",
                " one whose main fault was that he",
                " called a spade a spade, absolutely insufferable.",
                " They virtually said that if in a",
                " group of blind persons there is anyone",
                " possessed of sight, the only right course",
                " for him is to blind himself rather",
                " than try to restore the vision of",
                " others. And if such a person refused",
                " to do so, it was for them",
                " to pluck out his eyes and make",
                " him blind like themselves.",
                "No direct comment",
                " is made here with regard to the",
                " attitude of those people. Instead, God asks",
                " His Prophet (peace be on him) to",
                " narrate to them the story of Noah.",
                " Through this story the unbelievers would be",
                " able to see clearly their own predicament",
                " as well as the predicament of the",
                " believers.",
                "*70). Faced with determined opposition from",
                " the unbelievers, Noah made it quite clear",
                " that he would not cease to strive",
                " for his cause, regardless of what the",
                " unbelievers might do for it is in",
                " God that he put his trust. (Cf.",
                " Hud 11: 55.)"
            ]
        },
        {
            "id": "[10:72]",
            "verse": "And if you turn away [from my advice] then no payment have I asked of you. My reward is only from Allah, and I have been commanded to be of the Muslims.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:73]",
            "verse": "And they denied him, so We saved him and those with him in the ship and made them successors, and We drowned those who denied Our signs. Then see how was the end of those who were warned.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:74]",
            "verse": "Then We sent after him messengers to their peoples, and they came to them with clear proofs. But they were not to believe in that which they had denied before. Thus We seal over the hearts of the transgressors",
            "description": [
                "'Those who transgress' mentioned in the present",
                " verse are those who, once they commit",
                " a wrong, cling to it out of",
                " adamance and obstinacy. These are the ones",
                " who, out of sheer arrogance and egotism,",
                " would like to stick to the stand",
                " they once took even if it was",
                " erroneous. Such people remain unmoved"
            ]
        },
        {
            "id": "[10:75]",
            "verse": "Then We sent after them Moses and Aaron to Pharaoh and his establishment with Our signs, but they behaved arrogantly and were a criminal people",
            "description": [
                "For a full appreciation of the story",
                " of Moses and Pharaoh, see the explanatory",
                " notes in Towards Understanding the Qur'an, vol.",
                " III, al-A'raf7, n. 83 ff. The points",
                " elucidated in these notes will not be",
                " repeated here.",
                "*73). Intoxicated by their riches,",
                " political power and glory they considered themselves",
                " to be well above the level of",
                " ordinary human beings. Thus, instead of humbly",
                " submitting themselves to God, they waxed proud.",
                ""
            ]
        },
        {
            "id": "[10:76]",
            "verse": "So when there came to them the truth from Us, they said, \"Indeed, this is obvious magic.\"",
            "description": [
                "The response of the Pharaonites to the",
                " Prophet Moses (peace be on him) was",
                " exactly the same as the response of",
                " (he Makkan unbelievers to the Prophet (peace",
                " be on him). This response bar, been",
                " mentioned earlier (see verse 2 above) in",
                " these words: 'This man is indeed an",
                " evident sorcerer.'",
                "The context makes it clear",
                " that the Prophets Moses and Aaron (peace",
                " be on them) were entrusted with the",
                " same mission which had formerly been entrusted",
                " to Prophet Noah (peace be on him),",
                " then to the Prophets who followed him",
                " and finally to the Prophet Muhammad (peace",
                " be on him) who was the last",
                " in the chain of such Prophets.",
                "From",
                " the outset, the thrust of the surah",
                " has been the same - that man",
                " should take God, the Lord of the",
                " universe, and Him alone, as his Lord",
                " and as the sole object of his",
                " worship, service and obedience, and that he",
                " has to render to Him an account",
                " of all his deeds. Now, those who",
                " had rejected the message of the Prophet",
                " (peace be on him) are being told",
                " that their well-being as well as that",
                " of all human beings rests on affirming",
                " their belief in the One True God",
                " and in the Hereafter, a belief which",
                " has been invariably expounded by the Prophets",
                " down the ages. Man's well-being depends on",
                " affirming this belief, and on fashioning his",
                " entire behaviour on the basis of that.",
                "",
                "This constitutes the pivotal point of the",
                " whole surah. The reference to other Prophets",
                " (peace be on them) in this surah",
                " by way of historical illustration indicates that",
                " the message of all the Prophets was",
                " the same as the one embodied in",
                " this surah. The Prophets Moses and Aaron",
                " (peace be on (hem) had conveyed the",
                " same message to Pharaoh and his chiefs.",
                " Had the mission of these two Prophets",
                " been merely to liberate a specific nation,",
                " as some people are inclined to believe,",
                " reference to this event for the purpose",
                " of historical illustration would have been quite",
                " discordant with the context in which it",
                " occurs. There can be no doubt that",
                " the mission of Moses and Aaron partially",
                " aimed at bringing about the liberation of",
                " the Israelites (then, a Muslim people) from",
                " the domination of an unbelieving nation. This",
                " was, however, a secondary rather than the",
                " central purpose of raising those Prophets. According",
                " to the Qur'an the main objective of",
                " the mission of these two Prophets was",
                " the same as that of all other",
                " Prophets. An objective which has been clearly",
                " set forth in the following verses of:",
                " 'Go to Pharaoh for he has certainly",
                " transgressed all bounds (of servitude to Allah).",
                " And say to him: \"Would you rather",
                " be purified; and that I guide you",
                " to your Lord that you may fear",
                " Him\" ' (al-Nazi'at 79: 17-19). Now, since",
                " Pharaoh and his nobles did not respond",
                " positively to this call, the Prophet Moses",
                " (peace be on him) was ultimately left",
                " with no other choice but to secure",
                " the liberation of his people, who were",
                " Muslims, and to take them away from",
                " the area dominated by Pharaoh. This was",
                " of course a fairly important event, and",
                " the Qur'anic narration of it also treats",
                " it as such. However, all those who",
                " are not inclined to view the detailed",
                " teachings of the Qur'an in isolation from",
                " its general principles, can never commit the",
                " mistake of considering the liberation of a",
                " people to be the basic purpose of",
                " raising a Prophet whereas inviting people to",
                " the true faith is of secondary significance,",
                " (For further details see Ta Ha 20:",
                " 44-52; al-Zukhruf 43: 46-56; and al-Muzzammil 73:",
                " 15-16.)"
            ]
        },
        {
            "id": "[10:77]",
            "verse": "Moses said, \"Do you say [thus] about the truth when it has come to you? Is this magic? But magicians will not succeed.\"",
            "description": [
                "In view of the apparent similarity between",
                " sorcery and miracle the Israelites hastily branded",
                " Moses (peace be on him) a sorcerer.",
                " In relegating Moses to the role of",
                " a sorcerer, however, these simpletons ignored the",
                " fact that the character and conduct as",
                " well as the motives underlying the activity",
                " of sorcerers are entirely different from those",
                " of the Prophets. Is it consistent with",
                " the known character of a sorcerer that",
                " he should fearlessly make his way to",
                " the court of a tyrant, reproach him",
                " for his error, and summon him to",
                " exclusively devote himself to God and to",
                " strive for his self-purification? What would rather",
                " seem to be consistent with the character",
                " of a sorcerer is that if he",
                " had gained access to the courtiers he",
                " would have gone about flattering them, soliciting",
                " their help in securing an opportunity to",
                " show his tricks. And if ever he",
                " succeeded in Finding his way to the",
                " royal court, he would probably have resorted",
                " to flattery in an even more abject",
                " and dishonourable manner, would have made himself",
                " hoarse in publicly praying for the long",
                " life and abiding glory of the ruler,",
                " and would then have humbly pleaded that",
                " he might be allowed to perform his",
                " show. And once the show was over,",
                " he would have disgracefully stretched forth his",
                " hands in the style of a beggar,",
                " entreating for an appropriate award.",
                "All this",
                " has been condensed into the succinct statement",
                " that 'sorcerers never come to a happy",
                " end'."
            ]
        },
        {
            "id": "[10:78]",
            "verse": "They said, \"Have you come to us to turn us away from that upon which we found our fathers and so that you two may have grandeur in the land? And we are not believers in you.\"",
            "description": [
                "Had the sole demand of Moses and",
                " Aaron (peace be on him) been the",
                " liberation of the Israelites, Pharaoh and his",
                " courtiers would not have suspected that the",
                " spread of these Prophets' message would transform",
                " the religion of the land and that",
                " the supremacy of Pharaoh and his courtiers",
                " would be undermined. What made them uneasy",
                " was the fact that Prophet Moses (peace",
                " be on him) was inviting the people",
                " of Egypt to the true faith and",
                " that this posed a threat to the",
                " whole polytheistic way of life which was",
                " the very cornerstone of the predominance of",
                " Pharaoh and his chiefs and clergy. (For",
                " further details see Towards Understanding the Qur'an,",
                " al-A'raf7, n. 44 and al-Mu'min 40, n.",
                " 43 -Ed.)"
            ]
        },
        {
            "id": "[10:79]",
            "verse": "And Pharaoh said, \"Bring to me every learned magician.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:80]",
            "verse": "So when the magicians came, Moses said to them, \"Throw down whatever you will throw.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:81]",
            "verse": "And when they had thrown, Moses said, \"What you have brought is [only] magic. Indeed, Allah will expose its worthlessness. Indeed, Allah does not amend the work of corrupters.",
            "description": [
                "What Moses (peace be on him) presented",
                " before the court was no sorcery; rather",
                " it was the sorcerers who had made",
                " a show of their tricks of sorcery.",
                ""
            ]
        },
        {
            "id": "[10:82]",
            "verse": "And Allah will establish the truth by His words, even if the criminals dislike it.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:83]",
            "verse": "But no one believed Moses, except [some] youths among his people, for fear of Pharaoh and his establishment that they would persecute them. And indeed, Pharaoh was haughty within the land, and indeed, he was of the transgressors",
            "description": [
                "The word dhurriyah used in this verse",
                " literally means 'offspring'. We have, however, rendered",
                " this into English as 'a few youths'.",
                " We have preferred this translation because the",
                " Qur'an employed this particular expression so as",
                " to convey the idea that it was",
                " a few youths - male and female",
                " - who had the courage of their",
                " convictions to embrace and champion the truth",
                " in those perilous times whereas their parents",
                " and the more elderly members of the",
                " community were unable to do so. The",
                " older segment of the population was too",
                " deeply concerned with its materialistic interests, too",
                " engrossed in worldliness and too eager to",
                " enjoy a life of security to stand",
                " by the truth when that seemed to",
                " invite all kinds of peril. On the",
                " contrary, this older generation tried to persuade",
                " the young ones to stay away from",
                " Moses for the simple reason that it",
                " would invite the wrath of Pharaoh upon",
                " themselves and upon others.",
                "The Qur'an underscores",
                " this point, for once again those who",
                " came forward and courageously supported the Prophet",
                " (peace be on him) were not the",
                " elderly. They were rather a few courageous",
                " Makkan youths. Those who embraced Islam at",
                " this very early period in its history",
                " - the period of revelation of these",
                " verses - and who supported the message",
                " of truth despite fierce persecution, were all",
                " young people. This group was altogether bereft",
                " of the aged doters of a life",
                " free of peril and hazard. 'Ali ibn",
                " abi Talib, Ja'far ibn al-'Aqil, Zubayr, Talhah,",
                " Sa'd ibn abi Waqqas, Mus'ab ibn 'Umayr,",
                " 'Abd",
                "Allah ibn Mas'ud were all young",
                " people and each one of them, at",
                " the time of embracing Islam, was under",
                " twenty. Likewise, 'Abd al-Rahman ibn 'Awf, Bilal",
                " and Suhayb were all in their twenties",
                " while Abu 'Ubaydah ibn al-Jarrah, Zayd ibn",
                " Harithah, 'Uthman ibn 'Affan and 'Umar ibn",
                " al-Khattab were between thirty and thirty-five years",
                " of age. The oldest among these Companions",
                " was Abu Bakr. and when he embraced",
                " Islam he too was no older than",
                " thirty-eight. 'Ammar ibn Yasir was the same",
                " age as the Prophet (peace be on",
                " him), and only one Companion, 'Ubaydah ibn",
                " Harith al-Muttalibi was older than he.",
                "*79).",
                " The words ***** which occur in the",
                " present verse have given rise to the",
                " misunderstanding that all the Israelites were unbelievers,",
                " and that in the early phases of",
                " Moses' 'prophethood' only a very few persons",
                " were believers. The use of the preposition",
                " ***** when applied to ***** signifies 'to",
                " obey and follow someone'. What these words,",
                " therefore, mean is that except for a",
                " few young people none in the whole",
                " nation of Israel was prepared to accept",
                " Moses as his leader, to follow him",
                " and support him in his Islamic mission.",
                " The part of the verse which follows",
                " makes it quite clear that this was",
                " not because they had any doubts about",
                " the veracity of Moses (peace be on",
                " him) or about the truth of his",
                " mission. The only reason for them not",
                " joining hands with him was that they",
                " - especially their elders and nobles -",
                " were unwilling to risk Pharaoh's fierce persecution.",
                "",
                "These people both in terms of pedigree",
                " and faith, belonged to the ummah of",
                " Abraham, Isaac, Jacob and Joseph (peace be",
                " on them) and were, therefore, Muslims. Yet",
                " the long subjugation of the Israelites had",
                " created such moral degeneration and faint-heartedness among",
                " them that they had been rendered altogether",
                " incapable of championing the cause of faith",
                " and truth or of opposing falsehood and",
                " unbelief, or even supporting those who had",
                " set out to champion that cause. The",
                " overall attitude of the Israelites during the",
                " whole of this conflict between Moses and",
                " Pharaoh may be gauged by the following",
                " statement in the Bible:",
                "They met Moses",
                " and Aaron, who were waiting for them,",
                " as they came forth from Pharaoh; and",
                " they said to them, 'The Lord look",
                " upon you and judge, because you have",
                " made us offensive in the sight of",
                " Pharaoh and his servants, and have put",
                " a sword in their hand to kill",
                " us' (Exodus 5: 20-1).",
                "According to the",
                " Talmud, the Israelites used to tell the",
                " Prophets Moses and Aaron (peace be on",
                " them): 'Yea', said the overburdened children of",
                " Israel to Moses and Aaron, 'we are",
                " like a lamb which the wolf has",
                " carried from its flock, the shepherd strives",
                " to take it from him, but between",
                " the two the lamb is pulled to",
                " pieces; between ye and Pharaoh will we",
                " all be killed' (H. Polano, The Talmud",
                " Selections, p. 152).",
                "The Qur'an also refers",
                " to much the same when it mentions",
                " what the Israelites said to Prophet Moses",
                " (peace he on him): We were oppressed",
                " before your coming to us and after",
                " it (al-A'raf 7: 129).",
                "*80). The word",
                " ***** which has been used here signifies",
                " transgressors, those who exceed the limits. But",
                " this literal translation hardly conveys the true",
                " spirit of the wored. For it has",
                " been used to refer to those who,",
                " in order to achieve their objectives, are",
                " not deterred from using any means, howsoever",
                " evil they may be. Such people do",
                " not mind committing injustice, or indulging in",
                " acts of moral turpitude. They are also",
                " wont to go to any extent in",
                " pursuing their desires. Once they have something",
                " in mind, they simply know no bounds.",
                ""
            ]
        },
        {
            "id": "[10:84]",
            "verse": "And Moses said, \"O my people, if you have believed in Allah, then rely upon Him, if you should be Muslims.\"",
            "description": [
                "Such an address could, obviously, not be",
                " directed to a community of unbelievers. The",
                " Prophet Moses' statement makes it absolutely clear",
                " that the Israelites of those days were",
                " believers. Accordingly, Moses; (peace be on him)",
                " exhorted them not to be unnerved by",
                " Pharaoh's might, that they put their trust",
                " in God's power if indeed they were",
                " true believers as they claimed,"
            ]
        },
        {
            "id": "[10:85]",
            "verse": "So they said, \"Upon Allah do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people",
            "description": [
                "This was the reply of the youths",
                " who came forward to support Moses (peace",
                " be on him). It is evident from",
                " the context that the ones who said:",
                " 'We place our reliance on Allah' were",
                " not the 'wrong-doing folk' [mentioned in the",
                " present verse] but the 'youths' [mentioned in",
                " verse 83 above].",
                "*83). The supplication of",
                " these devout youths: 'Our Lord! Do not",
                " make us a trial for the oppressors',",
                " covers a very wide range of meanings.",
                " Whenever a people rise to establish the",
                " truth in the midst of prevalent falsehood,",
                " they encounter oppressors of all sorts. On",
                " the one hand, there are protagonists of",
                " falsehood who would like to crush the",
                " standard-bearers of the truth with all the",
                " force at their disposal. There is also",
                " a sizeable group of people who claim",
                " to champion the truth but who, despite",
                " their claim to be its devotees, are",
                " so cowed by the all-round supremacy of",
                " falsehood that they look upon the struggle",
                " to make the truth prevail as an",
                " unnecessary, futile and absurd pursuit. Such people",
                " are inclined, in order to somehow justify",
                " their insincerity to the cause of the",
                " truth, to prove that those who are",
                " engaged in the struggle to make the",
                " truth prevail are in fact in error.",
                " By so doing they seek to calm",
                " the uneasiness felt by their conscience concerning",
                " the desirability of struggling for the cause",
                " of the truth. Over and above all",
                " these are the common people who observe,",
                " as silent spectators, the encounter between truth",
                " and falsehood, and ultimately support the party",
                " which appears to be winning regardless of",
                " what aspect that party supports.",
                "In this",
                " scenario, every reverse that the votaries of",
                " the truth suffer, every affliction or hardship",
                " that they endure, any mistake that they",
                " commit, and any weakness that they show",
                " becomes a cause of trial for all",
                " these groups. If the votaries of the",
                " truth are crushed or defeated, the protagonists",
                " of falsehood jubilantly claim that it was",
                " they, rather than those whom they opposed,",
                " who were in the right. The lukewarm",
                " supporters of the truth would cry: 'Look!",
                " Did we not foretell that the conflict",
                " with such mighty forces would merely result",
                " in a loss of many precious lives,",
                " that it would be an act of",
                " sheer self-destruction, an act of wanton suicide,",
                " which has not been made incumbent on",
                " us by the Law of God. So",
                " far as the fundamental requirements of faith",
                " are concerned, they are being fulfilled by",
                " the performance of basic religious duties and",
                " rituals. As for the rulers, however oppressive",
                " they may be, they did not prevent",
                " them from performing those duties.' As for",
                " the masses, their attitude is that the",
                " truth is known by the fact that",
                " it achieves victory. Hence, if a group",
                " comes forth as triumphant, the fact of",
                " its triumph proves that it was in",
                " the right. Similarly, if in the course",
                " of a struggle, the protagonists of the",
                " truth commit any lapse or betray any",
                " weakness in the face of heavy odds,",
                " or if even a single person succumbs",
                " to any act of immorality, this provides",
                " a good many opponents with a pretext",
                " to cling to falsehood. If the struggle",
                " meets with failure, people are so wont",
                " to lose heart that it becomes extremely",
                " difficult for any similar movement to rise",
                " for a very long time. Viewed against",
                " this background, the prayer of the companions",
                " of Moses (peace be on him) appears",
                " very meaningful: 'Our Lord! Do not make",
                " us a trial for the oppressors.' This",
                " prayer sought from God His grace that",
                " would protect them from their shortcomings and",
                " weaknesses, and would render their struggle successful",
                " in this world in order that their",
                " very existence might become a blessing for",
                " fellow human beings rather than a means,",
                " in the hands of oppressors, to inflict",
                " harm."
            ]
        },
        {
            "id": "[10:86]",
            "verse": "And save us by Your mercy from the disbelieving people.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:87]",
            "verse": "And We inspired to Moses and his brother, \"Settle your people in Egypt in houses and make your houses [facing the] qiblah and establish prayer and give good tidings to the believers.\"",
            "description": [
                "The Qur'an-commentators disagree about the meaning of",
                " this verse. After carefully considering the actual",
                " words of the verse and reflecting over",
                " the context in which these words were",
                " said, I have come to the conclusion",
                " that perhaps because of the oppression prevailing",
                " in Egypt, and because the faith of",
                " the Israelites had become quite weak, congregational",
                " prayer had become defunct among both the",
                " Israeli and Egyptian Muslims,* The abandonment of",
                " congregational prayer was a major cause of",
                " the disintegration of their collective entity and",
                " the virtual extinction of their religious life.",
                " That is why Moses (peace be on",
                " him) was directed to re-establish congregational prayer",
                " and to construct or acquire a few",
                " houses in Egypt specifically for that purpose.",
                "",
                "* The author's expression 'Egyptian Muslims' denotes",
                " those Egyptians who had embraced the faith",
                " of the Prophets, the faith of Moses",
                " (peace be on him) - Ed.",
                "The",
                " reason for such a directive is that",
                " when a group of Muslims falls prey",
                " to degeneration and dissolution, the necessary effort",
                " to revive their religious spirit and to",
                " restore their shattered integrity, if it is",
                " to conform to a truly Islamic pattern,",
                " must begin with the revival of congregational",
                " prayer.",
                "The directive to 'make your houses",
                " a direction for men to pray' suggests,",
                " in my opinion, that these prayer-houses should",
                " become pivotal points for the entire people.",
                " That the directive to 'establish Prayer' immediately",
                " follows this statement means that rather than",
                " offer Prayer at different places, they should",
                " congregate in the houses set aside for",
                " Prayer and perform it collectively. For certainly",
                " one of the implications of the expression",
                " 'to establish Prayer' which frequently occurs in",
                " the Qur'an, is its observance in congregation.",
                "",
                "*85). Moses (peace be on him) was",
                " directed to banish those feelings of despair,",
                " awe and dismay which had seized the",
                " believers. To 'give glad tidings' encompasses the",
                " whole range required by this task."
            ]
        },
        {
            "id": "[10:88]",
            "verse": "And Moses said, \"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"",
            "description": [
                "These verses are related to the early",
                " period of Moses' (peace be on him)",
                " mission whereas the prayer itself probably belongs",
                " to his last days in Egypt. The",
                " intervening period spans several years, the detailed",
                " events of which have not been mentioned",
                " here. At other places in the Qur'an,",
                " however, there are references to the events",
                " that took place in that intervening period.",
                "",
                "*87). This alludes to the pomp and",
                " splendour and the glamour of cultural refinement",
                " because of which people had become enamoured",
                " of them and their life-style, and which",
                " had created in the former an irrepressible",
                " urge to ape the ways of the",
                " latter.",
                "*88). This refers to the abundance",
                " of material resources which are available to",
                " the unbelievers to execute their plans, whereas",
                " the believers, insofar as they lack those",
                " resources, are forced to defer the execution",
                " of their plans.",
                "*89). This prayer, as",
                " we have pointed out earlier (see n.",
                " 86 above), was made by the Prophet",
                " Moses (peace be on him) during his",
                " very last days in Egypt. Moses resorted",
                " to this prayer when, although Pharaoh and",
                " his nobles had witnessed a series of",
                " signs betokening the truth, and even though",
                " Moses (peace be on him) had made",
                " the truth all too patently clear to",
                " them, they still obdurately persisted in their",
                " hostility to it. Moses' prayer that God",
                " may 'obliterate their riches and harden their",
                " hearts' is a prayer that Prophets are",
                " wont to make at a time when",
                " they are faced with opposition like that",
                " mentioned above. The prayer is substantially in",
                " accord with God 's own judgement against",
                " those who obdurately oppose the truth -",
                " that they may never be enabled to",
                " have faith."
            ]
        },
        {
            "id": "[10:89]",
            "verse": "[Allah] said, \"Your supplication has been answered.\" So remain on a right course and follow not the way of those who do not know.\"",
            "description": [
                "Those who are ignorant of reality and",
                " who have no grasp of the beneficent",
                " considerations underlying God's decisions are liable to",
                " misunderstand things. Such people observe the weakness",
                " of the forces that stand for truth",
                " as against the forces of falsehood. They",
                " observe that those who seek to make",
                " the truth prevail suffer a series of",
                " reverses. By way of contrast, they observe",
                " the dazzling worldly success of those who",
                " stand for falsehood. On such occasions they",
                " fall prey to several misconceptions. They begin",
                " to suspect that perhaps God Himself wants",
                " that His rebels should continue to hold",
                " sway over the earth, that perhaps even",
                " He - Who Himself is the Truth",
                " - is not willing to support the",
                " truth in its encounter with falsehood. Under",
                " the influence of such a fallacious line",
                " of reasoning, they conclude that the struggle",
                " for establishing the hegemony of the truth",
                " is an exercise in futility. They feel,",
                " therefore, satisfied with the freedom to practise",
                " religious principles in a very narrow domain",
                " of human life; this is provided within",
                " the framework of a system of life",
                " which is based on denial of the",
                " true faith and the 'right' to violate",
                " the injunctions of God.",
                "In the present",
                " verse God has directed Moses (peace be",
                " on him) and his followers not to",
                " fall prey to such erroneous ideas. God's",
                " directive, as embodied in this verse, amounts",
                " to saying that people should patiently persist",
                " in their efforts in the face of",
                " adverse circumstances, lest they also fall prey",
                " to the same mistake as committed by",
                " those who lack knowledge and wisdom."
            ]
        },
        {
            "id": "[10:90]",
            "verse": "And We took the Children of Israel across the sea, and Pharaoh and his soldiers pursued them in tyranny and enmity until, when drowning overtook him, he said, \"I believe that there is no deity except that in whom the Children of Israel believe, and I am of the Muslims.\"",
            "description": [
                "Though this event is not mentioned in",
                " the Bible, it is explicitly recorded in",
                " the Talmud in the following words: 'Who",
                " is like Thee, O Lord, among the",
                " gods?'",
                "We settled the Children of Israel",
                " in a blessed land,94 and provided them",
                " with all manner of good things. They",
                " only disagreed among themselves after knowledge (of",
                " the truth had) come to them.95 Surely",
                " your Lord will judge between them on",
                " the Day of Resurrection concerning their disagreements.",
                ""
            ]
        },
        {
            "id": "[10:91]",
            "verse": "Now? And you had disobeyed [Him] before and were of the corrupters?",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:92]",
            "verse": "So today We will save you in body that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless",
            "description": [
                "Even to this day the exact place",
                " where Pharaoh's dead body was found afloat",
                " on the surface of the sea is",
                " known. Lying on the western coast of",
                " the Sinaitic peninsula, it is presently known",
                " as the Mount of Pharaoh (Jabal Fir'awn).",
                " A warm spring, situated in its vicinity,",
                " is also still called the Bath of",
                " Pharaoh (Hammam Fir'awn) after Pharaoh. Located a",
                " few miles away, Abu Zanimah is identified",
                " as the precise spot at which Pharaoh's",
                " dead body was found. If the name",
                " of the Pharaoh who died by drowning",
                " was Minpetah, as has been established by",
                " current research, his embalmed body still lies",
                " in the museum of Cairo. In 1907",
                " when Sir Grafton Elliot Smith removed bandages",
                " from the mummified body of this Pharaoh,",
                " it was found to be coated with",
                " a layer of salt. This is clear",
                " proof of his death by drowning at",
                " sea."
            ]
        },
        {
            "id": "[10:93]",
            "verse": "And We had certainty settled the Children of Israel in an agreeable settlement and provided them with good things. And they did not differ until [after] knowledge had come to them. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ",
            "description": [
                "God continues to confront people with instructive",
                " signs, even though most of them, in",
                " total disregard of such signs, fail to",
                " derive any lesson from them.",
                "*94). That",
                " is, God provided an abode for them",
                " in Palestine for their exodus from Egypt.",
                "",
                "*95). Here reference is made to the",
                " schisms and dissensions which the Israelites caused",
                " and the ever new religious cults which",
                " they invented. It is pointed out here",
                " that they had not acted in ignorance",
                " of the truth; their actions rather emanated",
                " from mischievous designs. For they had been",
                " provided by God with the true religion",
                " and they knew its fundamental principles, its",
                " requirements, and the features which distinguish the",
                " true faith from the false ones. They",
                " were also well aware of what constitutes",
                " disobedience, on what matters man will be",
                " held to account by God, and on",
                " what principles man should fashion his life.",
                " Despite these clear directives the Israelites transformed",
                " their true faith into a multitude of",
                " religious cults, and developed them all on",
                " foundations altogether divergent from those provided by",
                " God."
            ]
        },
        {
            "id": "[10:94]",
            "verse": "So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:95]",
            "verse": "And never be of those who deny the signs of Allah and [thus] be among the losers.",
            "description": [
                "Though this admonition is apparently addressed to",
                " the Prophet Muhammad (peace be on him),",
                " in point of fact it is directed",
                " to those who entertained doubts about the",
                " Prophet's message. Reference is made to the",
                " People of the Book because the common",
                " Arabs were not conversant with the Scriptures.",
                " But so far as the People of",
                " the Book were concerned, there were doubtlessly",
                " some pious religious scholars among them who",
                " were in a position to corroborate the",
                " fact that the Qur'anic message was essentially",
                " the same as that delivered by the",
                " earlier Prophets."
            ]
        },
        {
            "id": "[10:96]",
            "verse": "Indeed, those upon whom the word of your Lord has come into effect will not believe,",
            "description": [
                "The statement 'the word of your Lord",
                " has been fulfilled' refers to those who",
                " are not interested in seeking truth; who,",
                " by dint of their apathy, bigotry, stubbornness,",
                " excessive worldliness and total unconcern about the",
                " After-life, make their hearts immune to the",
                " truth. God's judgement about such persons is",
                " that they will not be blessed with",
                " faith."
            ]
        },
        {
            "id": "[10:97]",
            "verse": "Even if every sign should come to them, until they see the painful punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:98]",
            "verse": "Then has there not been a [single] city that believed so its faith benefited it except the people of Jonah? When they believed, We removed from them the punishment of disgrace in worldly life and gave them enjoyment for a time.",
            "description": [
                "Even though the Prophet Yunus, called Jonah",
                " in the Bible (860-784 BC). was of",
                " Israeli descent, he was sent to Iraq",
                " in order to guide the Assyrians. The",
                " Assyrians are, therefore, called here 'the people",
                " of Yunus'. Ninevah. the famous ancient town,",
                " was their capital, a great many ruins",
                " of which are still to be found",
                " on the left bank of the Tigris,",
                " opposite the present city of Mosul. One",
                " of the mounds in this area is",
                " still named after the Prophet Jonah. The",
                " splendour of the Assyrians may be gauged",
                " from the fact that their capital, Ninevah.",
                " spread over a radius of sixty miles.",
                "",
                "*99). Although there are allusions to this",
                " incident in three places in the Qur'an,",
                " there is no mention of any detail.",
                " (See al-Anbiya', 21: 87-8; al-Saffat 37: 139-48;",
                " and al-Qalam 68: 48-50.) In view of",
                " the above, it cannot be stated with",
                " confidence why the Assyrians were singled out",
                " for being spared God's punishment even though",
                " God's Law is that if a people",
                " decide to believe after God has decided",
                " to punish them, their believing afterwards does",
                " not profit them.",
                "The 'Book of Jonah'",
                " in the Bible contains some material relevant",
                " to the matter, but unfortunately that information",
                " is barely reliable. For, the 'Book of",
                " Jonah' is in no sense a heavenly",
                " revelation, nor was it even authored by",
                " the Prophet Jonah (peace be on him).",
                " What actually happened is that some four",
                " or five hundred years after Jonah's death",
                " some anonymous person produced the 'Book of",
                " Jonah' and had it incorporated into the",
                " Bible. Moreover, some of the contents of",
                " the 'Book of Jonah' are too absurd",
                " to be acceptable. However, were one to",
                " reflect on the allusions to the people",
                " of Yunus in the Qur'an and on",
                " the information provided by the 'Book of",
                " Jonah', one is inclined to support the",
                " view of the Qur'an-commentators, namely that since",
                " the Prophet Jonah (peace be on him)",
                " had left his station without obtaining God's",
                " permission to do so and since the",
                " Assyrians repented and sought pardon from God",
                " as soon as they saw the signs",
                " of God's impending punishment, God pardoned them.",
                "",
                "One of the basic principles mentioned in",
                " the Qur'an concerning God's punishment of the",
                " world's nations is that He does not",
                " punish any nation until God's Message has",
                " been fully conveyed to them so that",
                " the people are left with no justification",
                " to claim that they were not aware",
                " of His Message. (See the Qur'an. al-Nisa'",
                " 4: 165 in conjunction with al-Isra' 17:",
                " 15-Ed.) Now in this case, as we",
                " can see, the admonition of the Assyrians",
                " did nor continue till the very end",
                " of the period granted to them by",
                " God because Prophet Yunus (peace be on",
                " him) migrated from his station. It is",
                " presumably for this reason that God in",
                " His justice decided not to punish them",
                " since all the requisite conditions of punishment",
                " had not been fulfilled. (For details see",
                " al-Saffat 37, n. 85.)",
                "*100). When the",
                " Assyrians embraced the true faith, they were",
                " granted a fresh lease of life. However,",
                " they once again became wayward both in",
                " matters of belief and conduct. Though the",
                " Prophet Nahum (720-698 BC) warned them, it",
                " still had no effect on them. The",
                " final warning was delivered to them by",
                " the Prophet Zephaniah (709-640 BC) but that",
                " too was of no avail. Ultimately, God",
                " sent the Medes against them in 612",
                " BC. The king of the Medes, with",
                " the assistance of the Babylonians, invaded Assyria,",
                " The Assyrian army was routed and besieged",
                " within the walls of Ninevah. Although they",
                " put up some resistance for a time,",
                " the flooded Tigris swept away the city",
                " walls, enabling the invaders to break through",
                " the defences and capture the city. Subsequently",
                " they set fire to the whole city",
                " and its environs. The Assyrian king set",
                " his own palace ablaze and was himself",
                " burnt to death. This brought to an",
                " end the Assyrian empire and civilization. However,",
                " recent excavations in the area have brought",
                " to light many traces of massive conflagration.",
                ""
            ]
        },
        {
            "id": "[10:99]",
            "verse": "And had your Lord willed, those on earth would have believed - all of them entirely. Then, [O Muhammad], would you compel the people in order that they become believers?",
            "description": [
                "Had it been God's will that only",
                " those who are true believers and obey",
                " God should inhabit the earth and that",
                " there should remain no trace of unbelief",
                " and disobedience, God would have caused only",
                " the faithful and obedient ones to be",
                " born. Nor would-it have been difficult for",
                " Him to providentially direct everyone to faith",
                " and obedience in such a manner that",
                " it would have been impossible for people",
                " to do otherwise. However, there is a",
                " profound wisdom underlying man's creation which would",
                " have been totally defeated by such a",
                " compulsion. For it was God's will to",
                " grant man the free-will to make his",
                " choice between faith and unbelief, between obedience",
                " and disobedience.",
                "*102). What has been said",
                " here does not mean that the Prophet",
                " (peace be on him) sought to compel",
                " people into believing whereas God had dissuaded",
                " him from doing so. The technique employed",
                " in the above verse is the same",
                " as employed at many places in the",
                " Qur'an, viz. that although at times certain",
                " things are addressed apparently to the Prophet",
                " (peace be on him), they are meant,",
                " in fact, for the instruction of others.",
                " What is being said here is that",
                " the Prophet (peace be on him) had",
                " been assigned the task of making the",
                " right way abundantly clear to people with",
                " the help of convincing arguments. Thus the",
                " Prophet (peace be on him) had fulfilled",
                " the task assigned to him. Now, if",
                " they have no intent to follow the",
                " right way, and they feel sure that",
                " unless they are overpoweringly compelled to they",
                " should know well that it is no",
                " part of a Prophet's task. Had God",
                " desired that people be made to have",
                " faith compulsively, He could have done so",
                " without raising any Prophet."
            ]
        },
        {
            "id": "[10:100]",
            "verse": "And it is not for a soul to believe except by permission of Allah, and He will place defilement upon those who will not use reason.",
            "description": [
                "All God's bounties are solely at His",
                " disposal and one can neither have access",
                " to any of these without His leave,",
                " nor can one confer them on others.",
                " The bounty of having faith and being",
                " directed to the right path is also",
                " fully contingent upon God's leave. Hence, it",
                " is simply inconceivable that without God's leave",
                " anyone can attain this bounty or confer",
                " it on anyone else. Even if the",
                " Prophet (peace be on him) sincerely wants",
                " people to believe, it does not lie",
                " in his power to accomplish that without",
                " God's leave and succour.",
                "*104). This fully",
                " explains that God's leave and succour are",
                " not bestowed on people arbitrarily. God does",
                " not capriciously permit or disallow people to",
                " embrace faith. There is a definite law",
                " - a law that is based on",
                " wisdom - according to which God disposes",
                " such matters. The law is that those",
                " who in their quest for the truth",
                " use their reason properly, and in an",
                " unbiased manner, are assisted by God. Owing",
                " to God's concern, the means of arriving",
                " at the truth are made available to",
                " them in proportion to the extent of",
                " the sincerity of their quest for the",
                " truth and their efforts to reach it.",
                " They are also granted the succour required",
                " for their success in grasping the truth.",
                " As for those who are not really",
                " in search of the truth, who keep",
                " their reason enmeshed in biases, or fail",
                " to make use of their reason in",
                " their search for the truth, such people",
                " are able to find nothing but the",
                " abomination of ignorance and misguidance, of false",
                " thinking and evil-doing. Their attitude makes it",
                " very clear that they merit nothing but",
                " ignorance and misguidance and, hence, that is",
                " what they are destined for."
            ]
        },
        {
            "id": "[10:101]",
            "verse": "Say, \"Observe what is in the heavens and earth.\" But of no avail will be signs or warners to a people who do not believe",
            "description": [
                "This is the final and categorical response",
                " to the unbelievers. The unbelievers had asked",
                " that they be shown some convincing sign",
                " that would make them confirm the truth",
                " of the Prophet's claim to prophethood. Here",
                " they are being told that if the",
                " unbelievers had any desire to seek and",
                " accept the truth, there are innumerable signs",
                " scattered throughout the heavens and the earth,",
                " signs that are more than sufficient to",
                " convince them about the truth of the",
                " Prophet's message. All one needed to do",
                " was to look around with open eyes",
                " and to reflect on what one observes.",
                " Conversely, if there are some people who",
                " have no inclination to seek the truth,",
                " then no signs - howsoever extraordinary and",
                " wonder-provoking they may be - will help",
                " them to have faith. For, whenever such",
                " people witness any such sign, they cry",
                " out, as did Pharaoh and his chiefs,",
                " that it is 'plain sorcery' (see verse",
                " 76 above). Those who are afflicted with",
                " such a sickness, wake up to the",
                " truth only when God's punishment befalls them",
                " in all its horror. An instance in",
                " point is Pharaoh's realization of the truth",
                " as he faced death by drowning (see",
                " verse 90 above). But to repent only",
                " when one is being seized by God's",
                " wrath is of no avail."
            ]
        },
        {
            "id": "[10:102]",
            "verse": "So do they wait except for like [what occurred in] the days of those who passed on before them? Say, \"Then wait; indeed, I am with you among those who wait.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:103]",
            "verse": "Then We will save our messengers and those who have believed. Thus, it is an obligation upon Us that We save the believers",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:104]",
            "verse": "Say, [O Muhammad], \"O people, if you are in doubt as to my religion - then I do not worship those which you worship besides Allah; but I worship Allah, who causes your death. And I have been commanded to be of the believers",
            "description": [
                "The theme broached at the beginning of",
                " (his discourse is now resumed at the",
                " point of its conclusion. (Cf. verses 1-10.)",
                "",
                "*107). The Qur'anic expression *****_ literally means",
                " 'who causes you to die'. This literal",
                " rendering, however, does not convey the spirit",
                " of the statement made here. For what",
                " is being said amounts to the following:",
                " God is the One Who has the",
                " power over your lives and Who enjoys",
                " such absolute control over you that as",
                " long as He wishes you to remain",
                " alive, you live, and no sooner than",
                " He signals you to surrender your lives",
                " to Him, you do so. It is",
                " Him alone that I worship, and it",
                " is to His service and obedience that",
                " I am bound.",
                "In this context, it",
                " should be borne in mind that the",
                " Makkan polytheists believed, as do the present-day",
                " polytheists, that only God, the Lord of",
                " the universe, has the absolute power to",
                " cause death, a power that no one",
                " else shares with Him. They also believed",
                " that even those whom they associated with",
                " God in His attributes and authority were",
                " all too helpless to avert their own",
                " death. It is to be noted that",
                " of the numerous divine attributes, this particular",
                " attribute of God - viz. that He",
                " alone has the power to cause death",
                " - is mentioned here alongside the doctrine",
                " that men ought to give themselves in",
                " total devotion and service to God alone.",
                " The reason for it seems to be",
                " that in addition to being the statement",
                " of an important fact, it also provides",
                " a rationale for exclusively serving and worshipping",
                " God.",
                "In other words, the statement of",
                " the Prophet here amounts to saying that",
                " he is exclusively devoted to the service",
                " of God since the latter alone has",
                " all power over life and death. Conversely,",
                " why should anyone devote himself to worshipping",
                " others who, let alone having power over",
                " the life and death of others, do",
                " not have power even over their own",
                " life and death? The rhetorical force of",
                " the verse is also significant, for instead",
                " of saying that 'He has power over",
                " my death', the verse says: 'He has",
                " power over your death'. Thus one simple",
                " sentence pithily embraces three things - the",
                " thesis, its supporting argument, and the exhortation",
                " to accept that thesis. Had it been",
                " said that: T only serve Allah Who",
                " has power over my death', its logical",
                " implication would have been that in view",
                " of the fact that He had control",
                " over the Prophet's life and death, the",
                " latter should have served only Allah. However,",
                " it has been said that: 'I only",
                " serve Allah Who has power over your",
                " death', in this form, the implication of",
                " the verse is that not only the",
                " Prophet but also others should serve only",
                " God and this even though they had",
                " succumbed to the error of serving others",
                " than God."
            ]
        },
        {
            "id": "[10:105]",
            "verse": "And [commanded], 'Direct your face toward the religion, inclining to truth, and never be of those who associate others with Allah;",
            "description": [
                "The emphatic form in which people have",
                " been urged to adhere to true faith",
                " is noteworthy. Here people are not simply",
                " being asked to 'embrace the faith', or",
                " to 'follow the faith', or to 'become",
                " adherents of the faith'. Apparently such expressions",
                " were too weak and feeble to convey",
                " the idea of a total, firm, and",
                " steady adherence to faith as required of",
                " man. The actual words of the verse,",
                " ***** suggest that one should focus one's",
                " attention on the true faith, that one",
                " ought not to waver and let one's",
                " attention wander, that one ought to refrain",
                " from, occasionally moving a step forward and",
                " another step backward, or turning alternately left",
                " and right. What one is rather required",
                " to do is to keep moving straight",
                " ahead on the path to which one",
                " has been directed. This is clear and",
                " forceful enough in itself. However, the Qur'an",
                " does not stop at that. It adds",
                " the condition that the attention should be",
                " *****, that is, one characterized by exclusive",
                " and sincere devotion. What is thus being",
                " demanded is that one should adhere to",
                " this religion, this way of serving God,",
                " this way of life comprising worship, service,",
                " servitude, and obedience and in such a",
                " way that man's devotion and service to",
                " God are total. Once the true faith",
                " has been adopted, there should remain no",
                " trace of any liking for the false",
                " ways which have been forsaken.",
                "*109). The",
                " Prophet (peace be on him) is asked",
                " not to be one of those who",
                " associate others with God in His being,",
                " His attributes, His claims against His creatures,",
                " and His authority over those who set",
                " up others than God as partners to",
                " God. These others could be either one's",
                " own self, or some other person, or",
                " a group of persons; a spirit, a",
                " jinn, an angel, or any tangible or",
                " imagined being. Thus, the demand is not",
                " just a positive one to follow the",
                " path of serving the One True God",
                " with total devotion and steadfastness - there",
                " is also a negative aspect of the",
                " demand - that one ought to detach",
                " oneself from those who associate others with",
                " God in His divinity in whatever form.",
                " Moreover, one is required to be exclusively",
                " devoted to God not only in the",
                " realm of belief but also in the",
                " realm of conduct; not only in the",
                " individual but also in the collective sphere",
                " of life; not only when one is",
                " in a mosque, but also when one",
                " is in an educational institution, or in",
                " a court of law, or a legislative",
                " body, or in stately palaces where political",
                " decisions are made, or in market places",
                " bristling with trade and commerce. In short,",
                " one should adhere wherever one might be,",
                " to the doctrine of exclusive devotion to",
                " God. This is a way that should",
                " be quite distinct from the way of",
                " those who have developed in their lives",
                " a hodgepodge of two opposites: devotion to",
                " God and devotion to others than God.",
                " In short, one who believes in worshipping",
                " the One True God alone can never",
                " go hand-in-hand with those who believe in",
                " polytheism. For how could a Muslim conceivably",
                " be satisfied to go step-by-step with, let",
                " alone follow the way of those who",
                " associate others with God in His divinity?",
                " For in the latter eventuality the believer",
                " will be unable to fulfil the basic",
                " requisite of his faith, viz. the doctrine",
                " of monotheism.",
                "Moreover, the Qur'an asks the",
                " believer not only to shun overt but",
                " also covert and subtle forms of polytheism.",
                " One should be especially cautious about the",
                " latter since the consequences of any kind",
                " of polytheism are dreadful. Some people, out",
                " of their naivety, however, are inclined to",
                " take a light view of covert polytheism,",
                " considering it to be of less consequence",
                " than the open variety. One should be",
                " wary of such complaisance for covert polytheism",
                " may, in fact, be even more serious",
                " than the open variety. For an enemy",
                " out in the open can be more",
                " effectively countered than the one who is",
                " hidden from sight, or one who masquerades",
                " as a friend. One may well ask:",
                " which disease is more fatal, the one",
                " with the obvious symptoms, or the insidious",
                " one which develops within, eating at the",
                " vital organs, and yet which shows no",
                " external symptoms?",
                "This analogy holds true for",
                " the subtle form of polytheism. For the",
                " danger of open polytheism, of one that",
                " can be easily identified, is obvious to",
                " all and sundry. However, it is the",
                " subtle form of polytheism whose diagnosis calls",
                " for unusual insight and a mature grasp",
                " of the requisites of monotheism. For polytheism",
                " in its subtle form goes about striking",
                " its roots imperceptibly. The result is that",
                " in the course of time the roots",
                " of the true faith are eaten away",
                " even before anyone is alerted to such",
                " a dangerous development."
            ]
        },
        {
            "id": "[10:106]",
            "verse": "And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers.'\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:107]",
            "verse": "And if Allah should touch you with adversity, there is no remover of it except Him; and if He intends for you good, then there is no repeller of His bounty. He causes it to reach whom He wills of His servants. And He is the Forgiving, the Merciful",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:108]",
            "verse": "Say, \"O mankind, the truth has come to you from your Lord, so whoever is guided is only guided for [the benefit of] his soul, and whoever goes astray only goes astray [in violation] against it. And I am not over you a manager.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[10:109]",
            "verse": "And follow what is revealed to you, [O Muhammad], and be patient until Allah will judge. And He is the best of judges.",
            "description": [
                ""
            ]
        }
    ]
}