{
    "name": "Al-Qariah",
    "verse-count": 11,
    "verse-info": [
        {
            "id": "[101:1]",
            "verse": "The Striking Calamity -",
            "description": [
                "\"Qari'ah \" literally means the \"striking one\"",
                " . Qar ` is to strike one",
                " thing upon another so severely as to",
                " produce a noise. In view of this",
                " literal meaning, the word qari'ah is used",
                " for a dreadful disaster and a great",
                " calamity. At another place in the Qur'an",
                " this word has been used for a",
                " great affliction befalling a nation. In Surah",
                " Ar-Ra`d 31, it has been said: \"As",
                " for the disbelievers, because of their misdeeds,",
                " one affliction or the other dces not",
                " cease to visit them every now and",
                " then.\" But, here the word al-Qari'ah has",
                " been for the Resurrection and in Surah",
                " AI-Haaqqah too the Resurrection has been described",
                " by this very epithet (v.4). One should",
                " remember that here the whole Hereafter, from",
                " the first stage of Resurrection to the",
                " last stage of judgement and meting out",
                " of rewards and punishments, is being depicted",
                " together."
            ]
        },
        {
            "id": "[101:2]",
            "verse": "What is the Striking Calamity?",
            "description": [
                ""
            ]
        },
        {
            "id": "[101:3]",
            "verse": "And what can make you know what is the Striking Calamity?",
            "description": [
                ""
            ]
        },
        {
            "id": "[101:4]",
            "verse": "It is the Day when people will be like moths, dispersed,",
            "description": [
                ""
            ]
        },
        {
            "id": "[101:5]",
            "verse": "And the mountains will be like wool, fluffed up.",
            "description": [
                "This will be the tirst stage of",
                " Resurrection, when in consequence of the Great",
                " Disaster the whole of the present order",
                " of the world will be overthrown; the",
                " people then will be running about in",
                " confusion and bewilderment like so many scattered",
                " moths around a light; and the mountains",
                " will be flying about like carded wool",
                " of different colours. The mountains have been",
                " compared to wool of different colours because",
                " of the existence of a variety of",
                " colours in them."
            ]
        },
        {
            "id": "[101:6]",
            "verse": "Then as for one whose scales are heavy [with good deeds],",
            "description": [
                "From here begins description of the second",
                " stage of Resurrection when after having been",
                " resurrected men will appear in the Court",
                " of God."
            ]
        },
        {
            "id": "[101:7]",
            "verse": "He will be in a pleasant life.",
            "description": [
                ""
            ]
        },
        {
            "id": "[101:8]",
            "verse": "But as for one whose scales are light,",
            "description": [
                "The word mawazin in the original can",
                " be plural of mauzun as well as,",
                " of mizan. In the first case, mawazin",
                " would imply the deeds which might have",
                " some weight in the sight of Allah",
                " and be, thus, worthy of appreciation; in",
                " the second case, mawazin would imply scales",
                " of a balance. In the first case,",
                " the meaning of the mawazin's being heavier",
                " or lighter is that the good deeds",
                " will be heavy or light as ,against",
                " the evil deeds, for in the sight",
                " of Allah only good deeds have any",
                " weight and worth. In the second case.",
                " the meaning of the mawazin's being heavy",
                " is that the scale of the good",
                " deeds will be heavier than the scale",
                " of evil deeds, in Allah Almighty's Balance",
                " of Justice, and their being light means",
                " that the scale of good deeds will",
                " be lighter than the scale of evil",
                " deeds. Besides, in Arabic idiom the word",
                " mizan is also used for weight (",
                " wazan); accordingly, the weight's being heavy of",
                " light implies the good deeds being heavy",
                " or light. In any case, whether mawazin",
                " is taken in the meaning of mauzun",
                " or of mizan, or of wazan, the",
                " intention remains the same, which is that",
                " the basis of judgement in the Divine",
                " Court will be whether the provision of",
                " the deeds that a matt has brought",
                " is weighty or weightless, or whether his",
                " good deeds are heavier than his evil",
                " deeds or lighter. This theme has occurred",
                " at several places in the Qur'an which",
                " explains the meaning fully well. In Surah",
                " Al-A'raf it has been said: \"On that",
                " Day the weight will be identical with",
                " the Truth: accordingly, those whose scales, will",
                " be heavy will alone come out successful;",
                " and those whose scales are light will",
                " be the ones who will have incurred",
                " loss upon themselves.\" (w. 8-9). In Surah",
                " Al-Kahf, it was said: 'O Prophet, say",
                " to them: Should we tell you who",
                " are the most un-successful people and miserable",
                " failures in regard to their deeds? They",
                " are those whose all endeavours in the",
                " worldly life had gone astray from the",
                " Right Way, but they were under the",
                " delusion that everything they were doing, was",
                " rightly directed: these are the people who",
                " rejected the Revelations of their Lord and",
                " did not believe that they would ever",
                " go before Him. Therefore, all their deeds",
                " were Lost, for We will assign no",
                " weight to them on the Day of",
                " Resurrection.\" (vv. 103-105). In Surah Al-Anbiya': \"On",
                " the Day of Resurrection, We will set",
                " up just and accurate balances so that",
                " no one will be wronged in the",
                " least in any way; even if it",
                " be an act equal in weight to",
                " a grain of mustard seed, We will",
                " bring it forth (to be weighed) and",
                " We suffice for reckoning\". (v.47). These verses",
                " show that kufr and denial of the",
                " truth is in itself such a stupendous",
                " evil that it will certainly lower the",
                " scale of evils, and there will be",
                " no good act of the disbelievers, which",
                " may have any weight in the scale",
                " of good deeds so that its scale",
                " of goodness may become heavy. However, in",
                " the scales of the believer there will",
                " be the weight of Faith as well",
                " as the weight of the good deeds",
                " which he performed in the world. On",
                " the other hand, every evil done by",
                " him will be placed in the scale",
                " of evil deeds and then it will",
                " be seen whether his scale of the",
                " good deeds is heavier or his scale",
                " of the evil deeds."
            ]
        },
        {
            "id": "[101:9]",
            "verse": "His refuge will be an abyss.",
            "description": [
                "The words in the original a\"re: ammu",
                " hu hawiyah: \"his mother will be hawiyah.",
                " \" Hawiyah is from hawa, which means",
                " to fall from a height to a",
                " depth, and bawiyah is the deep pit",
                " into which something falls. Hell has been",
                " called Hawiyah because it will be very",
                " deep and the culprits will be thrown",
                " into it from the height. As for",
                " the words, \"his mother will be Hawiyah",
                " \", they mean: Just as the mother's",
                " lap is the child's abode, so Hell",
                " will be the culprits' only abode in",
                " the Hereafter."
            ]
        },
        {
            "id": "[101:10]",
            "verse": "And what can make you know what that is?",
            "description": [
                ""
            ]
        },
        {
            "id": "[101:11]",
            "verse": "It is a Fire, intensely hot.",
            "description": [
                "That is, it will not merely be",
                " a deep pit but will also be",
                " full of raging fire."
            ]
        }
    ]
}