{
    "name": "At-Takathur",
    "id": 102,
    "verse-count": 8,
    "verse-info": [
        {
            "verse-id": "[102:1]",
            "verse": "Competition in [worldly] increase diverts you",
            "description": [
                "The words alhakum at-takathur of the original",
                " are too vast in meaning to be",
                " fully explained in a passage Alhakmn is",
                " from lahv which originally means heedlessness, but",
                " in Arabic this word is used for",
                " every occupation which engrosses man so completely",
                " that he becomes heedless of the more",
                " important things in life.",
                "When the word",
                " alhakum is made from this root, it",
                " will mean that man has become so",
                " obsessed with some occupation that he has",
                " lost sight of everything more important than",
                " it. He is pre-occupied with it, is",
                " wholly lost in pursuit of it and",
                " this obsession has rendered him heedless of",
                " everything else in life.",
                "Takathur is from",
                " kathrat, which has throe meanings: (1) That",
                " man should strive to gain more and",
                " more of everything; (2) that the people",
                " should vie with one another for gaining",
                " more and more; and (3) that they",
                " should brag and boast of possessing greater",
                " abundance of things than others.",
                "Therefore, alhakum",
                " at-takathur would mean: \" Takathur (greed for",
                " more and more) has so occupied you",
                " that its pursuit has made you heedless",
                " of every higher thing in Iife.\" In",
                " this sentence it has not been indicated",
                " as to abundance of what is meant",
                " in takathur, heedlessness of what is implied",
                " in alhakrun, and who are the addresses",
                " of alhakum. In the absence of such",
                " an explanation, the words become applicable in",
                " their most general and extensive meaning. Thus,",
                " takathur dces not remain restricted in meaning",
                " and application but applies to all the",
                " gains and benefits, pleasures and comforts, the",
                " passion for acquiring more and more means",
                " of power and authority, vying with others",
                " in pursuit of these and bragging and",
                " boasting of their abundance. Likewise, the addressees",
                " of alhakum also do not remain limited",
                " but the people of all ages, in",
                " their individual as well as collective capacity,",
                " become its addressees. It gives the meaning",
                " that the passion for acquiring more and",
                " more of the worldly wealth, vying with",
                " others in pursuit of it and bragging",
                " and boasting of its possession has affected",
                " individuals as well as societies. Like wise,",
                " since in alhakum at-takathur it has not",
                " been pointed out as to which people",
                " are engrossed in acquisitiveness and of what",
                " they are rendered heedless, it has also",
                " become very extensive in meaning. It means",
                " that the passion for piling up more",
                " and more has made the people heedless",
                " of everything more important than it. They",
                " have become heedless of God, of the",
                " Hereafter, of the moral bounds and moral",
                " responsibilities, of the rights of others and",
                " of their own obligations to render those",
                " rights. They are only after raising the",
                " standard of living and do not bother",
                " even if the standard of humanity be",
                " falling. They want to acquire more and",
                " more of wealth no matter how and",
                " by what means it is acquired. They",
                " desire to have more and more means",
                " of comfort and physical enjoyment and, overwhelmed",
                " by this greed, they have become wholly",
                " insensitive as to the ultimate end of",
                " this way of living. They are engaged",
                " in a race with others to acquire",
                " more and more of power, more and",
                " more of forces, more and more of",
                " weapons, and they have no idea that",
                " all this is a means of filling",
                " God`s earth with tyranny and wickedness and",
                " of destroying humanity itself. In short, takathur",
                " has many forms, which have engrossed individuals",
                " as well as societies so completely that",
                " they have become heedless of everything beyond",
                " the world, its benefits and pleasures."
            ]
        },
        {
            "verse-id": "[102:2]",
            "verse": "Until you visit the graveyards.",
            "description": [
                "That is, \"You expend your whole Iife",
                " in the same craze and endeavour, until",
                " the time comes when you must die",
                " and leave the world .\""
            ]
        },
        {
            "verse-id": "[102:3]",
            "verse": "No! You are going to know.",
            "description": [
                "That is, \"You are under the delusion",
                " that the abundance of the worldly goods",
                " and surpassing others in it, is real",
                " progress and success, whereas the opposite is",
                " the case. Soon you will know its",
                " evil end and you will realize that",
                " it was a stupendous error in which",
                " you remained involved throughout your Iife. \"Soon\"",
                " may mean the Hereafter, for, for the",
                " Being Whose sight comprehends alI ages, from",
                " eternity to eternity, a few thousand years",
                " or a few hundred thousand years can",
                " only be a short span of the",
                " eternal time. But it can also mean",
                " death, for death is not very far",
                " away from any man, and soon after",
                " death man will come to know whether",
                " the occupations which engaged him throughout life",
                " were a means of good fortune and",
                " success for him, or of misfortune and",
                " failure."
            ]
        },
        {
            "verse-id": "[102:4]",
            "verse": "Then no! You are going to know.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[102:5]",
            "verse": "No! If you only knew with knowledge of certainty...",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[102:6]",
            "verse": "You will surely see the Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[102:7]",
            "verse": "Then you will surely see it with the eye of certainty.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[102:8]",
            "verse": "Then you will surely be asked that Day about pleasure.",
            "description": [
                "\"Then\" in this sentence dces not mean",
                " that accountability will be held after the",
                " culprits have been cast into Hell, but",
                " it means: \"Then We give you the",
                " news that you will be questioned about",
                " these comforts of Iife,\" and obviously this",
                " questioning will be held at the time",
                " of accountability in the Divine Court. Its",
                " chief argument is that in several Ahadith",
                " it has been reported from the Holy",
                " Prophet (upon whom be peace) that the",
                " believers and the disbelievers, both will have",
                " to account for the blessings granted by",
                " Allah. However, the people who did not",
                " show ingratitude but spent their lives as",
                " grateful servants of Allah, will come out",
                " successful from the accountability, and those who",
                " proved thankless to Allah for His blessings",
                " and committed ingratitude by word or by",
                " deed, or by both; will emerge as",
                " failures.",
                "Hadrat Jabir bin `Abdullah says: \"The",
                " Holy Prophet once visited us and we",
                " served him with fresh dates and gave",
                " him cool water to drink. Thereupon he",
                " said: \"These are of the blessings about",
                " which you will be questioned.\" (Musnad Ahmad,",
                " Nasa'i, Ibn Jarir, Ibn al-Mundhir, Ibn Marduyah,",
                " `Abd bin Humaid, Baihaqi in Ash-Shu `ab).",
                "",
                "Hadrat Abu Hurairah has reported that the",
                " Holy Prophet once asked Hadrat Abu Bakr",
                " and Hadrat `Umar to accompany him to",
                " the place of AbulHaitham bin at-Tahan Ansari.",
                " Thus, he took them to the oasis",
                " of Ibn at-Taihan-The latter brought a bunch",
                " of dates and placed it before them.",
                " The Holy Prophet said: \"Why didn't you",
                " pluck the dates yourself? ` He said:",
                " \"1 thought you would yourselves select and",
                " eat dates of your choice.\" So, they",
                " ate the dates and drank cool water.",
                " At the end, the Holy Prophet said:",
                " \"By Him in Whose hand is my",
                " Iife: this is of the blessings about",
                " which you will be questioned on the",
                " Resurrection Day: the cool shade, the cool",
                " dates, the cool water.\" (This tradition has",
                " been narrated in different ways by Muslim,",
                " Ibn Majah, Abu Da'ud, Tirmidhi, Nasa'i, Ibn",
                " Jarir, Abu Ya`la and others, on the",
                " authority of Hadrat Abu Hurairah, in some",
                " of which the name of the Ansari",
                " Companion has been mentioned and in some",
                " he has been referred to as a",
                " person from among the Ansar. This incident",
                " has been related with several details by",
                " Ibn Abi Hatim from Hadrat `Umar and",
                " by Imam Ahmad from Abu `Asib, the",
                " Holy Prophet's freed slave. Ibn Hibban and",
                " Ibn Marduyah have related a tradition from",
                " Hadrat 'Abdullah bin 'Abbas, which shows that",
                " an almost similar thing had happened in",
                " the house of Hadrat Abu Ayyub Ansari.",
                "",
                "These Ahadith make it explicit that not",
                " only the disbelievers but the righteous believers",
                " too will be questioned. As for the",
                " blessings which Allah has bestowed on man,",
                " they are unlimited and countless. There are",
                " many blessings of which man is not",
                " even conscious. The Qur'an says: \"If you",
                " try to count the blessings of Allah,",
                " you will not be able to calculate",
                " them.\" (Ibrahim : 34). Countless of them",
                " are the blessings which Allah has granted",
                " directly to man, and a large number",
                " of these are the blessings which man",
                " is granted through his own skill and",
                " endeavour. About the blessings that accrue to",
                " man in consequence of his own labour",
                " and skill, he will have to render",
                " an account as to how he acquired",
                " them and in what ways he expended",
                " them. In respect of the blessings directly",
                " bestowed by Allah, he will have to",
                " give an account as to how he",
                " used them. And in respect of all",
                " the blessings, on the whole, he will",
                " have to tell whether he had acknowledged",
                " that those blessings had been granted by",
                " Allah and whether he had expressed gratitude",
                " for them to Allah with his heart,",
                " and by word and deed, or whether",
                " he thought he had received all that",
                " accidentally, or as' a gift from many",
                " gods, or whether he Geld the belief",
                " that although those were the blessings of",
                " One God, in their bestowal many other",
                " beings also had a part, and for",
                " that very reason he had taken them",
                " as his gods and worshipped and thanked",
                " them as such."
            ]
        }
    ]
}