{
    "name": "Al-Humazah",
    "verse-count": 9,
    "verse-info": [
        {
            "id": "[104:1]",
            "verse": "Woe to every scorner and mocker",
            "description": [
                "The words used in the original are",
                " humazat il-lumazah. In Arabic hamz and lamz",
                " are so close in meaning that they",
                " are sometimes used as synonyms and sometimes",
                " with a little difference in the shade",
                " of meaning. But this difference is not",
                " definite and clear, for the meaning given",
                " to lamz by some Arabic speaking people",
                " themselves is given to lamz by other",
                " Arabic speaking peoples. On the contrary, the",
                " meaning given to harm by some people",
                " is given to hamz by others. Here,",
                " since both the words appear together and",
                " the words humazat il-lumazat have been used,",
                " they give the meaning that it has",
                " become a practice with the slanderer that",
                " he insults and holds others in contempt",
                " habitually. He raises his finger and winks",
                " at one man, finds fault with the",
                " lineage and person of another, taunts one",
                " in the face and backbites another; creates",
                " differences between friends and stirs up divisions",
                " between brothers; calls the people names and",
                " satirizes and defames them."
            ]
        },
        {
            "id": "[104:2]",
            "verse": "Who collects wealth and [continuously] counts it.",
            "description": [
                "This second sentence after the first sentence",
                " by itself gives the meaning that he",
                " slanders others because of his pride of",
                " wealth. The words jama `a malan for",
                " collecting money suggest the abundance of wealth;",
                " then the words \"counting it over and",
                " over again\" depict the person's miserliness and",
                " his selfish hoarding of wealth."
            ]
        },
        {
            "id": "[104:3]",
            "verse": "He thinks that his wealth will make him immortal.",
            "description": [
                "Another meaning also can be: \"He thinks",
                " that his wealth will make him immortal.",
                " \" That is, he is so engrossed",
                " in amassing wealth and counting it over",
                " and over again that he has forgotten",
                " death and he never bothers to consider",
                " that a time will come when he",
                " will have to depart from the world",
                " empty-handed, leaving everything behind."
            ]
        },
        {
            "id": "[104:4]",
            "verse": "No! He will surely be thrown into the Crusher.",
            "description": [
                "The word in the original is la",
                " yrtnbadhanna. Nabdh in Arabic is used for",
                " throwing away a thing regarding it as",
                " worthless and mean. This by itself indicates",
                " that because of his wealth he thinks",
                " that he is a great man but",
                " on the Day Of Resurrection he will",
                " be hurled into Hell as a mean",
                " and contemptible object.",
                "*5) The word hutamah",
                " in the original is from hatm, which",
                " means to smash, crush and break into",
                " pieces. Hell has been described by this",
                " epithet because it will crush and break",
                " to pieces whatever is thrown into it",
                " because of its depth and its fire.",
                ""
            ]
        },
        {
            "id": "[104:5]",
            "verse": "And what can make you know what is the Crusher?",
            "description": [
                ""
            ]
        },
        {
            "id": "[104:6]",
            "verse": "It is the fire of Allah, [eternally] fueled,",
            "description": [
                "Nowhere else in the Qur'an has the",
                " fire of Hell been called the fire",
                " of Allah. Here, its ascription to Allah",
                " not only expresses its dreadfulness but it",
                " also shows how the wrath and contempt",
                " of Allah envelops those who become proud",
                " and arrogant with the worldly wealth. That",
                " is why Allah has described that fire",
                " as His own Fire into which they",
                " will be hurled."
            ]
        },
        {
            "id": "[104:7]",
            "verse": "Which mounts directed at the hearts.",
            "description": [
                "Tattali'u is from ittala a, which means",
                " to climb and mount to the top,",
                " and also to be aware and informed.",
                " Afidah is plural of fuwad, which means",
                " the heart. But this word is not",
                " used for the organ which throbs in",
                " the breast, but for the seat of",
                " man's understanding and consciousness, his'feelings and desires,",
                " beliefs and thoughts, motives and intentions, Thus,",
                " one meaning of the rising of the",
                " fire to the hearts is that this.",
                " fire will reach the place which is",
                " the centre of man's evil thoughts, false",
                " beliefs, impure desires and feelings, and wicked",
                " motives and intentions. The second meaning is",
                " that the Fire of AIIah will not",
                " be blind like the tire of the",
                " world, which burns up the deserving and",
                " the non-deserving alike, but it will reach",
                " the heart of every culprit and discover",
                " the nature of his crime and then",
                " punish him according to his guilt."
            ]
        },
        {
            "id": "[104:8]",
            "verse": "Indeed, Hellfire will be closed down upon them",
            "description": [
                "That is, after the culprits have been",
                " thrown into it, Hell will be closed",
                " in upon them without leaving any slit",
                " or opening anywhere, in order to choke",
                " and suffocate them."
            ]
        },
        {
            "id": "[104:9]",
            "verse": "In extended columns.",
            "description": [
                "Fi amad-im-mumaddahah can have several meanings (1)",
                " That the gates of Hell will be",
                " closed and tall columns will be erected",
                " on them; (2) that the culprits will",
                " be tied to the tall columns; (3)",
                " according to Ibn `Abbas, the flames of",
                " the fire shall be rising high like",
                " tall columns."
            ]
        }
    ]
}