{
    "name": "Al-Kawthar",
    "id": 108,
    "verse-count": 3,
    "verse-info": [
        {
            "verse-id": "[108:1]",
            "verse": "Indeed, We have granted you, [O Muhammad], al-Kawthar.",
            "description": [
                "The full meaning of the word kauthar,",
                " as used here, cannot perhaps be expressed",
                " in one word in any language of",
                " the world. This is an intensive form",
                " of the noun kathrat which literally means",
                " abundance, but the context in which it",
                " has been used does not give the",
                " meaning of mere abundance but abundance of",
                " good, of spiritual benefits and blessings, and",
                " of such abundance which is unbounded and",
                " limitless, and it dces not imply any",
                " one good or benefit or blessing but",
                " abundance of countless benefits and blessings. Have",
                " a look again at the background of",
                " this Surah given in the Introduction. The",
                " enemies thought that Muhammad (upon whom be",
                " Allah's peace and blessings) had been completely",
                " ruined: he was cut off from the",
                " community and had become utterly helpless and",
                " powerless; his trade was ruined; his male",
                " children who could perpetuate his name were",
                " dead; the message that he presented was",
                " such that except for a handful of",
                " the people no one in entire Arabia,",
                " not to speak of Makkah, was prepared",
                " to listen to it therefore, failure and",
                " disappointment would be his lot as long",
                " as he lived and there would be",
                " no one in posterity to remember him",
                " when he died. Under such conditions when",
                " Allah said: \"We have granted you the",
                " Kauthar,\" it by itself gave the meaning:",
                " Your foolish opponents think that you are",
                " ruined and deprived of the good things",
                " that .you enjoyed before Prophethood, but the",
                " fact is that We have favoured you",
                " with unbounded good and countless blessings.\" This",
                " included the matchless moral qualities which the",
                " Holy Prophet was blessed with; this included",
                " the great blessings of Prophethood and the",
                " Qur'an, the knowledge and wisdom that were",
                " granted to him; this included the blessing",
                " of Tauhid and also of such a",
                " system of life, whose simple and intelligible,",
                " rational and natural, and comprehensive principles had",
                " the potential to spread throughout the world",
                " and of continuing to spread for ever",
                " afarwards. This also included the blessing of",
                " the exaltation of renown because of which",
                " the holy Prophet's blessed name continues to",
                " be exalted throughout the world since 1400",
                " years and will continue to be so",
                " exalted till Resurrection. This also included the",
                " blessing that by his preaching eventually such",
                " a world-wide community came into being, which",
                " became the standard-bearer of Truth in the",
                " world for ever, which can claim to",
                " have produced the greatest number of the",
                " pious, virtuous and noble charactered rnen in",
                " any one nation, and which even when",
                " corrupted and deprived has the highest good",
                " in it as against every other nation",
                " of the world. This also included the",
                " blessing that the Holy Prophet during his",
                " very lifetime witnessed his invitation and message",
                " attaining to the highest success and the",
                " preparation of a community which had the",
                " power to dominate the world. This also",
                " included the blessing that although on his",
                " being deprived of the male offspring the",
                " enemies thought he would be lost to",
                " posterity, yet Allah not only blessed him",
                " with the spiritual offspring in the form",
                " of Muslims, who will continue to exalt",
                " his name in the world till Resurrection",
                " but also granted him from his one",
                " daughter, Hadrat Fatimah, the natural progeny, who",
                " have spread throughout world and whose only",
                " mark of distinction and pride is that",
                " they trace their descent from him.",
                "These",
                " are the blessings which the people have",
                " seen and witnessed as to how abundantly",
                " Allah has blessed His Holy prophet within",
                " the world. In addition, Kauthar also implies",
                " two udtrr great blessings which Allah will",
                " bestow on him in the Hereafter. We",
                " had no means of knowing these; therefore",
                " the Holy Prophet (upon whom be peace)",
                " himself gave us news of them, and",
                " told us that Kauthar also implied them.",
                " First, the Fountain of Kauthar, which he",
                " will be granted on the Resurrection Day",
                " in the Plain of Assembly; second, the",
                " River Kauthar, which he will be granted",
                " in Paradise. About both such a large",
                " number of the Ahadith have been reported",
                " from him through such a large number",
                " of the reporters that there remains no",
                " doubt about their authenticity.",
                "What the Holy",
                " Prophet said about the fountain of Kauthar",
                " is as follows:",
                "(1) This Fountain will",
                " be granted to him on the Resurrection",
                " Day when there will be the cry",
                " of al- atash, al- atash (thirst, thirst!)",
                " on every side. The Holy Prophet's community",
                " will gather together before him at it",
                " and will be watered thereby. He himself",
                " will be the first to arrive at",
                " it and will be occupying the central",
                " position. He has said: \"This is a",
                " Fountain at which my Ummah will assemble",
                " on the Resurrection Day.\" (Muslim: KItab as-",
                " Salat Abu Da'ud: Kitab as-Sunnah). \"I shall",
                " have arrived at the Fountain before you.",
                " \" (Bukhari: Kitab ar-Riqaq and Kitab al-Fitan;",
                " Muslim: Kitab a!-Fida and Kitab at-Taharah; lbn",
                " Majah,: Kitab al Manasik and Kitab az-Zuhd.",
                " Musnad Ahmad: Marwiyyat `Abdullah bin Mas'ud `Abdullah",
                " bin `Abbas, Abu Hurairah. \"I shall be",
                " there before you and shall bear witness",
                " on you, and by God, I am",
                " seeing my Fountain even at this time.\"",
                " (Bukhari: Kitab al-jana-iz Kitab al-Maghazi, Kitab ar-Riqaq).",
                " Addressing an assembly of the Ansar, the",
                " Holy Prophet once said: \"After me you",
                " will meet with selfishness and nepotism, endure",
                " it patiently until you meet me at",
                " the Fountain. \" (Bukhari: kitab Manaqib al-Ansar",
                " and Kitab al-Maghazi; Muslim: Kitab al-Iman; Tirmidhi:Kitab",
                " al-Fitan). \"I shall be near the middle",
                " of the Fountain on the Resurrection Day.\"",
                " Muslim: Kitab al-Fada'il). Hadrat Abu Barzah Aslami",
                " was asked: \"Have you heard something about",
                " the Fountain from the Holy Prophet? He",
                " replied: Not once, or twice, or thrice,",
                " or four or five times, but over",
                " and over again. May Allah deprive of",
                " its water the one who be lies",
                " it.\" (Abu Da'ud: Kitab as-Sunnah). \"Ubaidullah bin",
                " Ziyad thought that the traditions about the",
                " Fountain were false; so much so that",
                " he belied all the traditions reported by",
                " Hadrat Abu Barzah Aslami, Bara' bin 'Azib",
                " and `A'idh bin 'Amr. At last, Abu",
                " Sabrah brought out a writing which he",
                " had written down after hearing it from",
                " Hadrat `Abdullah bin 'Amr bin al-`As, and",
                " it contained this saying of the Holy",
                " Prophet: \"Beware! your place of meeting me",
                " will be my Fountain.\" (Musnad Ahmad: Marwiyyat",
                " 'Abdullah bin 'Amr bin al-'As).",
                "(2) Different",
                " dimensions of the Fountain have been given",
                " in different traditions, but according to a",
                " large number of the traditions it will",
                " extend from Aylah (the present Israeli seaport",
                " of Ilat) to Sana'a of Yaman, or",
                " from Aylah to Adan, or from 'Amman",
                " to `Adan in length, and from Aylah",
                " to Juhfah (a place between Jeddah and",
                " Rabigh) in breadth. (Bukhari: Kitab ar-Riqaq; Abu",
                " Da'ud at Tayalisi: Hadith No. 995; Musnad",
                " Ahmad: Marwiyyat Abu Bakr Siddiq and `Abdullah",
                " bin `Umar; Muslim: Kasab al-Taharah and Kitab",
                " al-Fads il; Tirmidhi Abwab Sifat al-Qiyamah; Ibn",
                " Majah: Kitab az-Zuhd). From this it appears",
                " that on the Resurrection Day the present",
                " Red Sea itself will be turned into",
                " the Fountain of Kauthar. And the correct",
                " knowledge is only with Allah!",
                "(3) About",
                " this Fountain the Holy Prophet hes told",
                " us that water will be supplied to",
                " it from the River Kauthar of Paradise",
                " (which is being mentioned below). \"Two channels",
                " from Paradise will flow into it and",
                " supply water to it.\" (Muslim: Kitab al-Fada",
                " il). According to another tradition: \"A canal",
                " from the River Kauthar of Paradise will",
                " be opened towards this Fountain. \" (Musnad",
                " Ahmad Marwiyyat `Abdullah bin Mas`ud).",
                "(4) According",
                " to the description of it given by",
                " the Holy Prophet its water will be",
                " whiter than milk (according to other traditions",
                " whiter than silver, and according to still",
                " others, whiter than snow), cooler than snow,",
                " sweeter than honey; the earth of its",
                " bed will be more fragrant than musk;",
                " the water jugs set at it will",
                " be as numerous as the stars in",
                " the sky; the one who drinks from",
                " it would never thirst; and the one",
                " who is deprived of it will never",
                " have his thirst satisfied. These things with",
                " a little variation in wording have been",
                " reported in numerous Ahadith (Bukhari: Kitab ar-Rigaq;",
                " Muslim: Kitab at-Taharah and Kitab al-Fada'il; Musnad",
                " Ahmad: Marwiyyat Ibn Mas`ud, Ibn `Umar, `Abdullah",
                " bin 'Amr bin al-`As; Tirmidhi: Abwab Sifat",
                " al-Qiyanmah: Ibn Majah: Kitab az-Zuhd; Abu Da'ud:",
                " Tayalisi, Ahadith No. 995, 2135).",
                "(5) Concerning",
                " it the Holy Prophet warned the people",
                " of his time again and again, saying:",
                " \"after me those from among you who",
                " would effect changes in my Way, will",
                " be removed from the Fountain and will",
                " be disallowed to approach it. I shall",
                " say: they are my companions, but it",
                " will be said: \"Don't you know what",
                " they did after you? Then I too",
                " shall discard them and tell them to",
                " keep away.\" This subject too has been",
                " expressed in many traditions. (Bukhari: Kitab ar-Rigaq,",
                " Kitab al-Fitan; Muslim: Kitab al-Tahara and Kitab",
                " al-Fada'it Musnad Ahmad: Marwiyyat !bn Mas`ud, Abu",
                " Hurairah; Ibn Majah: Kitab al-Manasik. The Hadith",
                " which Ibn Majah has related in this",
                " connection contains very pathetic words. The Holy",
                " Prophet said: \"Beware! I shall have arrived",
                " at the Fountain before you and shall",
                " pride myself by your means upon the",
                " greater numbers of my Ummah as against",
                " other ummahas Do not at that time",
                " cause my face to be blackened. Beware:",
                " I shall have some people released, and",
                " some people shall be separated from me.",
                " I shall say: O my Lord, they",
                " are my companions. He will reply: Don't",
                " you know what innovations they introduced after",
                " you?\" According to Ibn Majah, these words",
                " were said by the Holy Prophet (upon",
                " whom be peace) in his Sermon at",
                " `Arafat.",
                "(6) Likewise, the Holy Prophet has",
                " also warned the Muslims coming after him",
                " till Resurrection, saying: \"Whoever from among you",
                " will swerve from my Way and effect",
                " changes in it, will be removed from",
                " the Fountain. I shall say: O Lord,",
                " they belong to me, they are the",
                " people of my Ummah. In response it",
                " will be said: Don't you know what",
                " changes they effected after you and then",
                " turned back on their heels? Then I",
                " too shall turn them away and shall",
                " not allow them to approach the Fountain.",
                " \" Many traditions on this subject are",
                " found in the Hadith. (Bukhari: Kitab al-Musaqat,",
                " Kitab ar-Rigaq, Kitab al-Fitan; Muslim: Kitab at-Taharah.",
                " Katab as-Salat, Kitab al-Fada il; Ibn Majah:",
                " Kitab az-Zuhd; Musnad Ahmad: Marwiyyat Ibn `Abbas).",
                "",
                "Traditions about this Fountain have been related",
                " by more than 50 companions, and the",
                " earliest scholars generally have taken it to",
                " mean the Fountain of Kauthar. Imam Bukhari",
                " has named the last chapter of his",
                " Kitab ar-Rigaq as Babun fil hawd wa",
                " qual-Allahu inna a `tainak al-Kauthar, and in",
                " a tradition from Hadrat Anas there is",
                " the explanation that the Holy Prophet said",
                " about Kauthar: \"It is a Fountain at",
                " which my Ummah shall alight. \"",
                "The",
                " River Kauthar which the Holy Prophet (upon",
                " whom be peace) shall be granted in",
                " Paradise, also has been mentioned in a",
                " large number of the traditions cf Hadith.",
                " Many traditions have been related on the",
                " authority of Hadrat Anas in which he",
                " says (and in some he explains that",
                " he is reporting the exact words of",
                " the Holy Prophet himself) that on the",
                " occasion of mi'raj; the Holy Prophet was",
                " taken round Paradise and shown a river",
                " on the banks of which there were",
                " vaults of pearls or precious stones carved",
                " from within; the earth of its bed",
                " was of the strong scented musk. He",
                " asked Gabriel, or the angel who took",
                " him round, what it was. He replied",
                " that it was the River Kauthar, which",
                " Allah had granted him. (Musnad Ahmad, Bukhari,",
                " Muslim, Abu Da'ud, Tirmidhi, Abu Da'ud Tayalisi,",
                " Ibn Jarir) Again, according to Hadrat Anas,",
                " the Holy Prophet was asked (or a",
                " person asked him): \"What is the Kauthar?'",
                " He replied; \"It is a River which",
                " Allah has granted me in Paradise. Its",
                " earth is musk: its water is whiter",
                " than milk and sweeter than honey \"",
                " (Musnad Ahmad, Tirmidhi, lbn Jarir; according to",
                " another tradition of Musnad Ahmad, describing the",
                " merits of the River Kauthar the Holy",
                " Prophet said that at its bottom there",
                " are pearls instead of pebbles. Ibn `Umar",
                " says that the Holy Prophet said: \"The",
                " Kauthar is a river in Paradise the",
                " banks of which are golden; it flows",
                " on pearls and diamonds (i.e. its bed",
                " has diamonds instead of pebbles); its earth",
                " smells sweeter than musk; its water is",
                " whiter than milk (or snow), cooler than",
                " snow and sweeter than honey.\" (Musnad Ahmad,",
                " Tirmidhi, Ibn Majah, Ibn Abi Hatim, Darimi,",
                " Abu Da'ud Tayalisi, Ibn al-Mundhir, Ibn Marduyah,",
                " Ibn Abi Shaibah). Usamah bin Zaid says",
                " that the Holy Prophet once went to",
                " visit Hadrat Usamah; he was not at",
                " home; his wife entertained him and during",
                " the conversation said \"My husband has told",
                " me that you have been granted a",
                " river in Paradise, which is called the",
                " Kauthar.\" The Holy Prophet replied \"Yes, and",
                " its bed is of rubies and corals",
                " and emeralds and pearls\" (Ibn Jarir, Ibn",
                " Marduyah. Though the sanad of this tradition",
                " is weak, the presence of a large",
                " number of traditions dealing with this subject",
                " strengthens it). Besides these marfu traditions, a",
                " great many sayings of the Companions and",
                " their successors have been related in the",
                " Hadith to the effect that the Kauthar",
                " implies a river in Paradise. These traditions",
                " describe its qualities as have been mentioned",
                " above. For instance, the sayings of Hadrat",
                " 'Abdullah bin `Umar, Hadrat `Abdullah bin `Abbas,",
                " Hadrat Anas bin Malik, Hadrat `A'ishah, Mujahid",
                " and Abul `Aliysh are found in Musnad",
                " Ahmad, Bukhari, Tirmidhi, Nasa'i'; and the books",
                " of Ibn Marduyah, Ibn Jarir, Ibn Abi",
                " Shaibah and other traditionists."
            ]
        },
        {
            "verse-id": "[108:2]",
            "verse": "So pray to your Lord and sacrifice [to Him alone].",
            "description": [
                "Different commentaries of it have been reported",
                " from different scholars. Some of them take",
                " the Prayer to mean the five times",
                " obligatory Prayer (salat); some take it to",
                " imply the Prayer of `Id al-Adha, and",
                " some say that it implies the Prayer",
                " itself. Likewise, the meaning of wanhar and",
                " sacrifice according to some illustrious scholars, is",
                " to place the right hand over the",
                " left hand and to fold them on",
                " the chest in the Prayer; some say",
                " that it implies raising both hands with",
                " Allahu Akbar at the commencement of the",
                " Prayer; some say that it implies raising",
                " both hands at the commencement of the",
                " Prayer, at bowing for Ruku ` and",
                " after rising from Ruku `; and some",
                " say that it means performing the `Id",
                " al-Adha Prayer and then offering the animal",
                " sacrifice. But if the context in which",
                " this command has been enjoined, is considered,",
                " its meaning clearly seems to be: \"O",
                " Prophet, when your Lord has granted you",
                " so many and so splendid blessing, then",
                " you should perform the Prayer only for",
                " His sake and offer sacrifice only for",
                " His sake.\" This Command was given in",
                " the environment when not only the pagans",
                " of Quraish but the pagans of entire",
                " Arabia and the world worshipped their self-made",
                " gods and offered sacrifices at their shrines.",
                " Therefore, the intention of the Command is",
                " \"Contrary to the polytheistic practice, you should",
                " remain steadfast to your creed: your Prayer",
                " is only for Allah and your sacrifice",
                " also is for Him alone, as it",
                " has been said at another place: `Declare,",
                " O Prophet, my salat and my sacrifice",
                " and my life and my death are",
                " all for Allah, Lord of the universe,",
                " Who has no partner with Him. This",
                " is what I have been enjoined, and",
                " I am the first to surrender to",
                " Him.'(Al-An`am:162-163). This same meaning has been explained",
                " of it by Ibn 'Abbas. `Ata`, Mujahid,",
                " `Ikrimah, Hasan Bari, Qatadah, Muhammad bin Ka`b",
                " al-Kurzi, Dahhak, Rabi` bin Anas, `Ata` al-Khurasani",
                " and many other major commentators (may Allah",
                " bless them all) (Ibn Jarir). However, this",
                " by itself is correct that when the",
                " Holy Prophet (upon whom be peace) enforced",
                " by Allah's command the practice of the",
                " `Id al-Adha Prayer and the offering of",
                " animal sacrifice at Madinah, he himself gave",
                " the first place to the Prayer (salat",
                " and the second to the sacrifice, as",
                " commanded in the verses: Inna salati wa",
                " nusuki and fa-salli li-Rabbika wanhar, and enjoined",
                " an the Muslims also to do the",
                " same, i.e. they should first perform the",
                " Prayer and then offer the sacrifice. This",
                " is neither the explanation of this verse",
                " nor the occasion of its revelation but",
                " a deduction made by the Holy Prophet",
                " from these verses and his deduction of",
                " injunctions also is a kind of Divine",
                " inspiration."
            ]
        },
        {
            "verse-id": "[108:3]",
            "verse": "Indeed, your enemy is the one cut off.",
            "description": [
                "The word shani' as used, in the",
                " original is derived from sha 'n, which",
                " means the hatred and spite because of",
                " which a person may start ill-treating another.",
                " At another place in the Qur'an it",
                " has been said: \"(And O Muslims,) the",
                " enmity of any people should not so",
                " provoke you as to turn you away",
                " from justice.\" (AI-Ma'idah: 8). Thus, shani aka",
                " implies every such person who blinded by",
                " his enmity of the Holy Prophet (upon",
                " whom be peace) should bring false accusations",
                " against him, slander and defame him and",
                " vent his personal spite against him by",
                " taunting and scoffing at him in every",
                " possible way.",
                "*4) Huwa'/ abtar: \"He himself",
                " is abtar\", i.e. though he calls you",
                " abtar he in fact himself is abtar.",
                " Some explanations of abtar have already been",
                " given in the Introduction to the Surah.",
                " It is derived from batar which means",
                " to cut off, but idiomatically it is",
                " used in a comprehensive meaning. In the",
                " Hadith, the rak ah of the Prayer",
                " which is not coupled with another rak'ah",
                " is called butaira', i.e. the lonely rak",
                " ah. According to another Hadith \"Every piece",
                " of work, which is in any way",
                " important, is abtar if it is started",
                " without the glorification and praise of Allah\",",
                " implying that it is cut off from",
                " the root, It has no stability, and",
                " it is doomed to failure. A man",
                " who fails to achieve his object is",
                " abtar as also the one who is",
                " deprived of all means and resources. A",
                " person who is left with no hope",
                " of any good and success in life",
                " is also abtar. A person who has",
                " been cut off from his family, brotherhood,",
                " associates And helpers is also abtar. The",
                " word abtar is also used for the",
                " man who has no male child, or",
                " whose male child or children have died,",
                " for after him there remains no one",
                " to remember him and he is lost",
                " to posterity . after death. In almost",
                " alI these meanings the disbelieving Quraish called",
                " the Holy Prophet (upon whom be peace)",
                " abtar. At this, Allah said: \"O Prophet,",
                " not you but your enemies are abtar.\"",
                " This was not merely a \"reprisal\", but",
                " a prophecy out of the most important",
                " prophecies of the Qur'an, which literally proved",
                " true. when it was made, the people",
                " regarded the Holy Prophet as abtar, and",
                " no one could imagine how the big",
                " chiefs of the Quraish would become abtar,",
                " who were famous not only in Makkah",
                " but throughout Arabia, who were successful in",
                " life, rich in worldly wealth and children,",
                " who had their associates and helpers everywhere",
                " in the country, who enjoyed intimate relations",
                " with all the Arabian tribes, being monopolists",
                " in trade and managers of Hajj But",
                " not long afterwards the conditions altogether changed.",
                " There was a time when on the",
                " occasion of the Battle of the Trench",
                " (A.H. 5) the Quraish had invaded Madinah",
                " with the help of many Arabian and",
                " Jewish tribes, and the Holy Prophet being",
                " besieged had to resist the enemy by",
                " digging a trench around the city. After",
                " only three years, in A.H. 8, when",
                " he attacked Makkah, the Quraish had no",
                " helper and they had to surrender helplessy.",
                " After this within a year or so",
                " the whole Arabia came under his control,",
                " deputations of tribes from all over the",
                " country began to visit him to take",
                " the oaths of allegiance and his enemies",
                " were left utterly helpless and resourceless. Then",
                " they were so lost to posterity that",
                " even if their children survived, none of",
                " them today knows that he is a",
                " descendent of Abu Jahl, Abu Lahab, `As",
                " bin Wail, or `Uqbah bin Abi Mu`ait,",
                " the enemies of lslam, and even if",
                " he knows it, he is not prepared",
                " to claim that his ancestors were those",
                " people. On the contrary, blessings are being",
                " invoked on the children of the Holy",
                " Prophet (upon whom be peace)throughout the world;",
                " millions and millions of Muslims take pride",
                " in bearing relationship to him; hundreds of",
                " thousands of people regard it as a",
                " mark of honour and prestige to have",
                " descended not only from him but from",
                " his family and even the families of",
                " his Companions. Thus, some one is a",
                " Sayyid, another an 'Alavi, and `Abbasi, a",
                " Hashmi, a Siddiqi, a Faruqi, an `Uthmani,",
                " a Zubairi, or an Ansari, but no",
                " one is an Abu Jahli or Abu",
                " Lahabi. History has proved that not the",
                " Holy Prophet Muhammad (upon whom be Allah's",
                " peace and blessings) but his enemies were,",
                " and are, abtar."
            ]
        }
    ]
}