{
    "name": "Al-Kafirun",
    "verse-count": 6,
    "verse-info": [
        {
            "id": "[109:1]",
            "verse": "Say, \"O disbelievers,",
            "description": [
                "A few points in this verse are",
                " particularly noteworthy:",
                "(1)Although the Holy Prophet (upon",
                " whom be peace) has been commanded to",
                " tell this to the disbelievers plainly, the",
                " theme that follows makes it explicit that",
                " every believer should tell the disbelievers plainly",
                " what has been said in the following",
                " verses; so much so that the person",
                " who has just believed and repented of",
                " kufr is also bound to express similarly",
                " his disgust with and disapproval of the",
                " creed and rites of worship and gods",
                " of kufr. Thus, though the first addressee",
                " of the word qul (say) is the",
                " Holy Prophet (upon whom be peace) himself,",
                " the command is not restricted to him",
                " alone but it reaches every believer through",
                " him.",
                "(2)The word \"kafir' is no abuse,",
                " which might have been used for the",
                " addressees of this verse, but it implies",
                " the one who refuses to believe, or",
                " is an unbeliever. As against it the",
                " word \"mu min\" is used for the",
                " believer. Therefore, the Holy Prophet's saying, by",
                " Allah's command, \"O disbelievers, ... ', in",
                " fact, means: \"O you, who have refused",
                " to believe in my apostleship and in",
                " the teachings brought by me.\" Likewise. when",
                " a believer uses this word, it will",
                " imply those who do not believe in",
                " the Holy Prophet Mauhmmad (upon whom be",
                " Allah's peace and blessings),",
                "(3) The word",
                " used is \"O kafirs\" and not \"O",
                " muslmiks\"; therefore, the addressees are not only",
                " the mushriks but all those people who",
                " do not acknowledge Muhammad (upon whom be",
                " Allah's peace and blessings) as Allah's Messenger",
                " and the teachings and guidance brought by",
                " him as the teaching and guidance given",
                " by Allah Himself, whether they be Jews,",
                " Christians, Zoroastrians or the disbelievers, polytheists and",
                " pagans of the entire world. There is",
                " no reason why this address be restricted",
                " to the pagans of Quraish or of",
                " Arabia only.",
                "(4) To address the deniers",
                " with the word \"O kafirs\" is just",
                " like addressing certain people as \"O enemies\",",
                " or \"O opponents\". Such an address is",
                " not, in fact, directed to the person",
                " of the addressee but it is made",
                " on the basis of their characteristic of",
                " enmity and opposition, and lasts only until",
                " they are so characterised. If one of",
                " them gives up enmity and opposition, or",
                " turns a friend and supporter, he no",
                " longer remains the addressee of this word.",
                " Likewise, the address of \"O kafirs\" to",
                " the people also is in view of",
                " their characteristic of kufr and not their",
                " person. This address would be perpetual for",
                " him who continues to be a kafir",
                " till death, but the one who believes",
                " will no longer be its addressee.",
                "(5)",
                " Many scholars from among the commentators have",
                " expressed the opinion that in this Surah",
                " the address of \"O disbelievers\" applied only",
                " to a few persons of Quraish, who",
                " were visiting the Holy Prophet (upon whom",
                " be peace) with proposals of compromise regarding",
                " religion and about whom Allah had informed",
                " His Messenger than they would not believe.",
                " They have formed this opinion for two",
                " reasons. First, that it is followed by",
                " La a `budu ma to `budun: \"I",
                " do not worship him or those whom",
                " you worship\" . They say that this",
                " does not apply to the Jews and",
                " Christians, for they worship AIlah. Second, that",
                " this is also followed by: wa la",
                " antum `abiduna ma a`bud \"Nor are you",
                " worshippers of Him Whom 1 worship\". Their",
                " reasoning is that this statement does not",
                " apply to the people who at the",
                " revelation of this Surah were disbelievers but",
                " later believed. Both these arguments are incorrect.",
                " As for these verses, their explanation that",
                " follows will show that they do not",
                " bear the meaning which has been understood",
                " from them. Here, to point out the",
                " error of the reasoning it would be",
                " enough to say that if the addressees",
                " of this Surah were only these people,",
                " why then dces this Surah still continue",
                " to be recited when they are dead",
                " and gone from the world long long",
                " ago? And what was the need of",
                " making this Surah a part of the",
                " Qur'an permanently so that the Muslims should",
                " continue to read it for ever afterwards'?",
                ""
            ]
        },
        {
            "id": "[109:2]",
            "verse": "I do not worship what you worship.",
            "description": [
                "This includes aII those deities whom the",
                " disbelievers and the polytheists have been, and",
                " are still, worshipping everywhere in the world,",
                " whether they are the angels, the jinn,",
                " prophets, saints, spirits of the living or",
                " dead men, or the sun, the moon,",
                " stars, animals, trees, rivers, idols and imaginary",
                " gods and goddesses. One may say that",
                " the pagans of Arabia acknowledged Allah also",
                " as a Deity and the other pagans",
                " of the world also have never disacknowledged",
                " Allah as a Deity till today. As",
                " for the followers of the earlier scriptures,",
                " they also acknowledge Allah alone as the",
                " real Deity. How then can it be",
                " correct to exonerate oneself froth the worship",
                " of all the deities of all those",
                " people, without' exception, when AIIah too is",
                " included among them? The answer is that",
                " if AIlah is worshipped along with others",
                " regarding Him as a Deity among other",
                " deities, the believer in Tauhid will inevitably",
                " express his inmunity from this worship, for",
                " in his sight Allah is oat a",
                " Deity out of a collection of deities,",
                " but He alone is the real Deity,",
                " and the worship of the collection of",
                " deities is no worship of Allah, although",
                " worship of Allah also is included in",
                " it. The Qur'an has clearly stated that",
                " Allah's worship is only that which does",
                " not have any tinge of the worship",
                " of another and in which man makes",
                " his worship exclusively Allah's. \"And the only",
                " Command they were given, was to worship",
                " Allah, making their religion sincerely His, turning",
                " all their attention towards Him.\" (Al-Bayyinah: S).",
                " This subject has been explained at many",
                " places iu the Qur'an forcefully; for example,",
                " see Au-Nisa': 145-146, AI-A`raf :29, AzZumar: 2,",
                " 3, 11, 14, 15, A1-Mu'min: 14, 64-66.",
                " It has been further explained in a",
                " Hadith Qudsi (i.e. Divine Word revealed through",
                " the mouth of the Prophet) in which",
                " the messenger of Allah says: \"Allah says:",
                " I am Self-Sufficient of the association of",
                " every associate most of all. Whoever performed",
                " an act in which he associated another",
                " also with Me, 1 am free of",
                " it, and the entire act is for",
                " him who was associated.\" (Muslim, Musnad Ahmad,",
                " Ibn Majah). Thus, acknowledging Allah as one",
                " of the two, three or many gods",
                " and serving and worshipping others along with",
                " Him is, in fact, the real kufr,",
                " declaration of immunity from which is the",
                " object of this Surah."
            ]
        },
        {
            "id": "[109:3]",
            "verse": "Nor are you worshippers of what I worship.",
            "description": [
                "The words used are: ma a'budu. The",
                " word ma in Arabic, is generally used",
                " for lifeless or unintelligent things, and the",
                " word man for intelligent and rational beings.",
                " The question arises why has ma a",
                " `budu been used here instead of man",
                " a `budu? The commentators generally give four",
                " answers to it: (1) that ma here",
                " is in the meaning of man; (2)",
                " that ma here is in the meaning",
                " of alladhi (i.e. which or who); (3)",
                " that in both the sentences ma is",
                " in the meaning of a noun of",
                " action (masdar) and it means: \"1 do",
                " not perform the kind of worship that",
                " you perform, i. e. polytheistic worship, and",
                " you do not perform the kind of",
                " worship that I perform, i.e. worship of",
                " One God;\" (4) that since in the",
                " first sentence ma ta'buduna has been used,",
                " in the second ma a `budu has",
                " been used to keep the style; in",
                " both places there is only the uniformity",
                " of the word, there is no uniformity",
                " of meaning; instances of this are found",
                " elsewhere also in the Qur'an. For example,",
                " in AI-Baqarah: 194, it has been said:",
                " '\"Therefore, if anyone transgresses a prohibition by",
                " attacking you, you may do likewise.\" Obviously,",
                " to transgress likewise in retaliation is no",
                " transgression, but the word transgression (in retaliation)",
                " Gas been used only for the sake",
                " of uniformity in style. In Surah At-Taubah:",
                " 67, it has been said: \"They forgot",
                " Allah, so Allah forgot them\", whereas Allah",
                " does not forget. what meant to be",
                " said is that Allah ignored them. The",
                " word nisyan in respect of AIlah has",
                " been used corresponding to their nisyaa (forgetfulness)",
                " only to keep the uniformity of the",
                " study.",
                "Although all these four interpretations are",
                " correct in their own way, and there",
                " is room in Arabic to take all",
                " these meanings, yet none of these explains",
                " the real object for which ma a'budu",
                " has been used instead of man a",
                " `budu. As a matter of fact, when",
                " man is used for a person in",
                " Arabic, it is meant to say or",
                " ask something about his person, and when",
                " ma is used, it is meant to",
                " ask or express something about his characteristics",
                " and traits. This can be explained in",
                " English by the questions: who is he,",
                " and what is he?, about a person.",
                " When it is asked, who is he?,",
                " the object is to know something about",
                " his person. But when it is asked,",
                " what is he?, the object is to",
                " know whether, for example, he belongs to",
                " the army, and if so, what is",
                " his rank, or whether he belongs to",
                " some teaching organisation, and if so, whether",
                " he is a lecturer in it, or",
                " a reader, or a professor, what science",
                " or art subject he teaches, what are",
                " his qualifications, etc. Thus, if in this",
                " verse, it was said: La antum abiduna",
                " man a `bud, it would mean: \"You",
                " are not worshippers of the being whom",
                " I worship, and in response, the disbelievers",
                " and the polytheists could have said that",
                " they too believed in the Being of",
                " AIIah and also worshipped Him. But when",
                " it was said: La antum 'abiduna ma",
                " a `bud, it meant: \"You are not",
                " worshippers of the Deity who has the",
                " attributes of the Deity whom I worship.\"",
                " And this is the real point on",
                " the basis of which the religion of",
                " the Prophet Muhammad (upon whom be Allah's",
                " peace and blessings) is absolutely distinguish-ed from",
                " the religions of all kinds of disbelievers,",
                " besides the deniers of God, for his",
                " God is utterly different from the God",
                " of all of them. The God of",
                " some of them is such that He",
                " stood in need of rest on the",
                " seventh day after having created the world",
                " in six days, Who is not God",
                " of the universe but God of Israel,",
                " Who stands in a special relationship to",
                " the people of one particular race, which",
                " is not shared by other men, Who",
                " wrestles with the Prophet Jacob and cannot",
                " throw him, Who has also a son,",
                " named Ezra. The God of some others",
                " is father of an only son, called",
                " Jesus Christ, and He causes His son",
                " to be crucified in order to make",
                " him an atonement for the sins of",
                " others. The God of some has wife",
                " and children, but begets only daughters. The",
                " God of some assumes human form and",
                " shape and living in a human body",
                " on the earth works like men. The",
                " God of some is merely an Essence,",
                " or Cause of causes, or the First",
                " Cause, Who after giving the system of",
                " the universe the initial push is sitting",
                " aside unconcerned, the universe is working by",
                " itself according to some relentless laws, and",
                " now He and man have nothing to",
                " do with each other. In short, even",
                " the unbelievers who acknowledge God do not,",
                " in fact, acknowledge the God, Who is",
                " the Creator, . Master, Disposer, Administrator and",
                " Ruler of the entire universe, Who has",
                " not only set the system of the",
                " universe but is running and controlling it",
                " by Himself every moment, Who is above",
                " every defect, fault, weakness and error, Who",
                " is free from every similitude, every physical",
                " limitation, every likeness, Who is Self-Sufficient of",
                " every companion and associate, Who has no",
                " partner in His Being, attributes, powers and",
                " entitlement to worship, Who is far too",
                " Holy that He should have children, or",
                " should take some one for a son,",
                " or should have an exclusive relationship with",
                " a community or race, Who is directly",
                " related to each individual creature of His",
                " as His Providence, Sustainer and Guardian, Who",
                " hears the prayers and answers them, Who",
                " alone possesses all the powers to give",
                " Iife and death, to cause profit and",
                " loss, and to make and mar destinies,",
                " Who not only sustains His creatures but",
                " also guides each according to its nature",
                " and need, Who is not only our",
                " God Whom we worship but also enjoins",
                " commands and prohibitions through His Prophets and",
                " His Books, which we have to obey,",
                " before Whom we are accountable for our",
                " deeds, Who will resurrect us after death,",
                " call us to account and reward and",
                " punish us accordingly. No one in the",
                " world except for Muhammad (upon whom be",
                " Allah's peace and blessings) and his followers,",
                " is worshipping the God with these attributes.",
                " If at alI some others also are",
                " worshipping God, they are not worshipping the",
                " real and true God but the God",
                " who is their self-invented, imaginary God."
            ]
        },
        {
            "id": "[109:4]",
            "verse": "Nor will I be a worshipper of what you worship.",
            "description": [
                ""
            ]
        },
        {
            "id": "[109:5]",
            "verse": "Nor will you be worshippers of what I worship.",
            "description": [
                "A section of the commentators is of",
                " the view that both these sentences are",
                " a repetition of the theme of the",
                " first two sentences and the repetition is",
                " meant to strengthen the statement in the",
                " first two sentences. But many commentators do",
                " not regard it as a repetition. They",
                " say that a new theme has been",
                " expressed in these which is different from",
                " the theme of the first two sentences.",
                " In our opinion they arc correct in",
                " so far as there is no repetition",
                " in these sentences, for in these only",
                " \"nor are you worshippers of Him Whom",
                " 1 worship\" Gas been repeated, and this",
                " repetition also is not in the sense",
                " in which this sentence was used first.",
                " But after negating the repetition the meanings",
                " that this section of the commentators has",
                " given of these two sentenses are very",
                " different from each other. There is no",
                " occasion here to take up and discuss",
                " each of the meanings given by the",
                " conunentators. Avoiding details we shall only discuss",
                " the meaning which is correct in our",
                " opinion.",
                "In the first sentence, it has",
                " been said: \"Nor am 1 a worshipper",
                " of chase whom you have worshipped.\" Its",
                " theme is absolutely different from the theme",
                " of verse2, in which it was said:",
                " \"I do not worship those whom you",
                " warship,\" These two things widely differ in",
                " two aspects. First, that although there is",
                " denial, and a forceful denial, in saying",
                " that \"I do not, or shall not,",
                " do such and such a thing\", yet",
                " there is much greater force in saying",
                " that \"1 am not a doer of",
                " such and such a thing\", for it",
                " means: \"It is such an evil thing",
                " that nothing to say of committing it;",
                " it is not possible that I would",
                " even think of it, or have intention",
                " of doing it.\" Second, that the sentence",
                " \"whom you worship\" applies to only those",
                " gods whom the disbelievers are worshipping now.",
                " On the contrary, the sentence \"whom you",
                " have worshipped\" applies to aII those gods",
                " whom the disbelievers and their forefathers have",
                " been worshipping in the past. Now, it",
                " is a well known fact that the",
                " gods of the polytheists and disbelievers have",
                " always been changing and their number increasing",
                " and decreasing. In different ages different groups",
                " of them have been worshipping different gods",
                " and the gods of all the disbelievers",
                " have never always been the same everywhere.",
                " Therefore, the verse means: \"I exonerate myself",
                " not only from your gods of today",
                " but also from the gods of your",
                " forefathers, and I am not a person",
                " who would even think of worshipping such",
                " gods. \"",
                "As for the second sentence,",
                " although its words in verse 5 are",
                " the same as in verse 3, yet",
                " its meaning at the two places is",
                " different. In verse 3, it follows this",
                " sentence: \"I do not worship those whom",
                " you worship.\" Therefore, it means: \"Nor are",
                " you worshippers of the God having the",
                " attributes of the One God Whom I",
                " worship.\" And in verse 5, it follows",
                " this sentence: \"Nor am I a worshipper",
                " of those whom you have worshipped.\" Therefore,",
                " it means: \"Nor dces it seem you",
                " would become worshippers of the One God",
                " Whom I worship.\" Or, in other words,",
                " \"It is not possible that 1 should",
                " become a worshipper of each of those",
                " gods whom you and your forefathers have",
                " worshipped, and on account of your aversion",
                " to adopting worship of One God, instead",
                " of many gads, it cannot be expected",
                " that you would desist from this wrong",
                " worship and will become worshipper of Him",
                " Whom 1 worship.\""
            ]
        },
        {
            "id": "[109:6]",
            "verse": "For you is your religion, and for me is my religion.\"",
            "description": [
                "That is, \"My religion is entirely distinct",
                " and separate from your religion. I am",
                " not a worshipper of your gods and",
                " you are not worshippers of my God.",
                " I cannot worship your gods and you",
                " are not prepared to worship my God,",
                " Therefore, you and I can never follow",
                " and walk one and the same path",
                " together.\" This is not a message of",
                " tolerance to the disbelievers, but a declaration",
                " of immunity, disgust with and dissociation from",
                " them as long as they are disbelievers.",
                " Its object is to disappoint them absolutely",
                " and finally that in the matter of",
                " religion the party of Allah's Messenger and",
                " his followers would ever come to terms",
                " with them. This same declaration of immunity",
                " and expression of disgust has been made",
                " in the Makki Surahs revealed after this",
                " Surah successively. Thus, in Surah Yunus, it",
                " was said: \"If these people deny you,",
                " say to them: 1 am responsible for",
                " my deeds and you are responsible for",
                " yours: you are not accountable for what",
                " I do, and I am not accountable",
                " for what you do.\" (v. 41). Then",
                " further on in the same Surah it",
                " was said: \"O Prophet, say: O mankind,",
                " if you are still in doubt concerning",
                " my Faith, know that I do not",
                " worship those whom you worship beside Allah,",
                " but I worship that Allah alone, Who",
                " has the power to cause your death.\"",
                " (v. 104). In Surah Ash-Shu'ara it was",
                " said: \"If they disobey you, tell them:",
                " I am not responsible for what you",
                " do.\" (v. 216). In Surah Saba it",
                " was said: \"Say to them: you will",
                " not be questioned for the errors we",
                " have committed, nor shall we be answerable",
                " for what you are doing. Say, our",
                " Lord will gather us together, then He",
                " will judge between us rightly.\" (w. 25-26).",
                " In Surah az-Zumar: \"Tell them plainly: O",
                " my people, do whatever you will, so",
                " shall 1. Soon you shall come to",
                " know as to whom comes the disgraceful",
                " torment and who gets the enduring punishment.\"",
                " (w. 39-40). Then the same lesson was",
                " taught in Madinah to aII the Muslims:",
                " \"There is indeed an excellent example for",
                " you in Abraham and his companions when",
                " they said to their people plainly: `We",
                " have nothing to do with you and",
                " your gods, whom you worship beside God:",
                " we have renounced you and there has",
                " arisen between us and you enmity and",
                " hatred for ever, until you believe in",
                " Allah, the One.\" (Al-Mumtahinah: 4). These continuous",
                " explanations of the Qur'an do not leave",
                " any room whatever for the doubt that",
                " the verse Lakum dims kum wa liya",
                " din dces not mean: \"You may go",
                " on following your religion and allow me",
                " to follow mine\", but it is the",
                " kind of declaration made in Surah Az-Zumar:",
                " 14: \"O Prophet, say to them: I",
                " shall serve Allah alone, making my religion",
                " sincerely His. As for you, you may",
                " serve whomever you please beside Him.\" (v.",
                " 14).",
                "From this verse lmam Abu Hanifah",
                " and Imam Shafe`i have deduced that kufr",
                " (unbelief ), as a whole, is one",
                " community, however discordant and different from each",
                " other be the religions of the unbelievers;",
                " therefore, a Jew can inherit a Christian,",
                " and a Christian a Jew, and likewise",
                " the unbeliever of one religion can inherit",
                " the un-believer of another religion, if there",
                " exists between them a relationship by descent",
                " or marriage, or some other connection, which",
                " necessitates the passage of inheritance of one",
                " to another. On the contrary, Imam Malik,",
                " Imam Auza`i and Imam Ahmad hold the",
                " view that the followers of one religion",
                " cannot inherit the followers of another religion.",
                " They deduce this from the Hadith which",
                " has been related on the authority of",
                " Hadrat 'Abdullah bin 'Amr bin al-As, saying",
                " that Allah's Messenger (upon whom be peace)",
                " said: \"The people of two different communities",
                " cannot inherit each other.\" (Musnad Ahmad, Abu",
                " Da'ud, Ibn Majah, Daraqutni). A ,Hadith with",
                " almost the same content has been related",
                " by Tirmidhi from Hadrat Jabir, by Ibn",
                " Hibban from Hadrat `Ahdullah bin `Umar, and",
                " by Bazzar from Hadrat Abu Hurairah. Dealing",
                " with this legal problem comprehensively, the well",
                " known Hanafi Imam; Shamsul-A'immah Sarakhsi, writes: \"The",
                " unbelievers can inherit each other mutually for",
                " alI those reasons for which the Muslims",
                " inherit each other mutually, and they can",
                " also inherit each other in certain other",
                " cases in which the Muslims do not",
                " inherit each other ... The fact is",
                " that Allah recognizes only two ways of",
                " life, the religion of Truth and the",
                " religion of falsehood; that is why He",
                " has declared: Lakum dine-kum wa liya din.",
                " And He has classified the people also",
                " into two groups, one group will go",
                " to Paradise and this consists of the",
                " believers, and the second group will go",
                " to Hell and this consists of the",
                " disbelievers collectively. And He has declared the",
                " two groups only as the potential opponents",
                " of each other: \"These are the two",
                " parties who have disputed about their Lord.\"",
                " (AI-Hajj: 19). That is, one group comprises",
                " all the disbelievers collectively and they are",
                " opposed to the believers ... We do",
                " not admit that they are separate and",
                " distinct communities according to their beliefs, but",
                " as against the Muslims they all form",
                " one community. For the Muslims affirm faith",
                " in the apostleship of Muhammad (upon whom",
                " be Allah's peace and blessings) and in",
                " the Qur'an and they refuse to affirm",
                " faith. For this very reason they have",
                " been declared to be unbelievers and are",
                " one community as opposed to the Muslims",
                " ... The Hadith, La yata-warith ahl millatain,",
                " points to the same thing as explained",
                " above. For the Holy Prophet has explained",
                " the word millatain (two communities) by his",
                " saying: La yarithul Muslim al-kafir wa lal-kafir",
                " al-Maslim: \"The Muslim cannot inherit the disbeliever,",
                " nor the disbeliever can inherit the Muslim.\"",
                " (AIMabsut vol. 30, pp. 30-32). The Hadith",
                " cited here by Imam Sarakhsi has been",
                " related by Bukhari, Muslim, Nasa'i, Ahmad, Tirmidhi,",
                " Ibn Majah and Abu Da'ud on the",
                " authority of Hadrat Usamah bin Zaid."
            ]
        }
    ]
}