{
    "name": "Hud",
    "verse-count": 123,
    "verse-info": [
        {
            "id": "[11:1]",
            "verse": "Alif, Lam, Ra. [This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted.",
            "description": [
                "In keeping with the context, the word",
                " Kitab has here been rendered as 'Divine",
                " command'. The word Kitab in its Arabic",
                " usage denotes not only book or inscription,",
                " but also writ and command. There are",
                " several instances in the Qur'an of the",
                " use of the word in the latter",
                " sense. (See, for instance, al-Baqarah 2: 235,",
                " al-Ra'd 13: 38. The significance of 'command'",
                " is especially evident from the usage of",
                " k t b derivates in the passive",
                " tense: see al-Baqarah 2: 180, 183, 216,",
                " 246, etc. - Ed.)",
                "*2). The contents",
                " of this 'command' are firm and unalterable.",
                " In addition, the Qur'an is free from",
                " the verbosity of orators, the fanciful imagination",
                " of poets, the spellbinding rhetoric of litterateurs.",
                " Instead, the teachings of the Qur'an have",
                " been set forth with remarkable clarity and",
                " precision. Thus, in the Qur'anic text we",
                " do not find even a single word",
                " that is superfluous, nor a single word",
                " that is lacking. Moreover, the verses expound",
                " the teachings of the Qur'an in such",
                " a manner that they are at once",
                " elaborate and lucid."
            ]
        },
        {
            "id": "[11:2]",
            "verse": "[Through a messenger, saying], \"Do not worship except Allah. Indeed, I am to you from Him a warner and a bringer of good tidings,\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:3]",
            "verse": "And [saying], \"Seek forgiveness of your Lord and repent to Him, [and] He will let you enjoy a good provision for a specified term and give every doer of favor his favor. But if you turn away, then indeed, I fear for you the punishment of a great Day.",
            "description": [
                "If a person turns to God in",
                " sincere devotion, He will enable him to",
                " spend his life felicitously. God will lavish",
                " upon him His bounties, confer a variety",
                " of benedictions, provide a life of prosperity,",
                " grant peace and tranquillity, and cause him",
                " to live honourably rather than in ignominy",
                " and disgrace. The same idea has been",
                " brought forth elsewhere in the Qur'an in",
                " the following words:",
                "Whoever acts righteously -",
                " whether male or female - the while",
                " he is a believer, We will surely",
                " grant him a clean life . .",
                " . (al-Nahl 16: 97). This verse dispels",
                " the Satanic misconception to which simpletons often",
                " succumb. The misconception consists of believing that",
                " piety, honesty and responsible behaviour might at",
                " the most lead to man's well-being in",
                " the Next Life, but they certainly play",
                " havoc with his life in the present",
                " world. Under this mistaken notion it is",
                " believed that good people are inevitably destined",
                " to live in abject poverty and utter",
                " misery. In refuting this misconception, God makes",
                " it clear that righteous behaviour is conducive",
                " to man's success in both worlds. Those",
                " who live a righteous and God-fearing life",
                " will achieve success and esteemed position in",
                " this world as in the Next. For,",
                " a position of true honour in this",
                " world falls only to those who, out",
                " of their devotion to God, act righteously,",
                " who are known for their excellent morals,",
                " who adhere to propriety in their dealings",
                " with others, who are considered by people",
                " to be trustworthy, of whom all expect",
                " nothing but goodness and benevolence, and of",
                " whom none entertains the fear of any",
                " evil.",
                "Implicit in the Qur'anic expression 'a",
                " fair enjoyment of life' is another point",
                " which should not escape our attention. According",
                " to the Qur'an, 'enjoyment of life' is",
                " of two kinds: one. which leads people,",
                " who are heedless of God, to temptations",
                " with the result that they immerse themselves",
                " in worldliness and forget God even more.",
                " Thus, 'enjoyment of life', though apparently a",
                " divine blessing, proves a curse. It becomes",
                " the precursor of God's punishment. This is",
                " what the Qur'an brands as 'illusory enjoyment'.",
                " (See Al 'Imran 3: 185; al-Hadid 57:",
                " 20 - Ed.) By contrast, the other",
                " kind of enjoyment of life adds to",
                " a person's prosperity and physical vitality in",
                " such a way that he becomes even",
                " more grateful to God. This kind of",
                " 'enjoyment of life' prompts man to fulfil",
                " the obligations incumbent upon him towards God,",
                " towards God's creatures and towards himself. Strengthened",
                " by the resources provided by God, man",
                " finds himself in a stronger position to",
                " effectively promote the cause of good and",
                " righteousness and to strive to obliterate evil",
                " and mischief. This is the Qur'anic concept",
                " of 'fair enjoyment of life' - an",
                " enjoyment which does not end with the",
                " life of this world, but extends to",
                " the Next Life as well.",
                "*4). The",
                " more a person excels in moral conduct",
                " and good deeds, the higher will be",
                " the status that God confers upon him.",
                " God does not let anyone's good deeds",
                " go to waste. In the same way",
                " as God does not show any appreciation",
                " for evil, He does not show any",
                " lack of appreciation for goodness and virtue.",
                " In God's kingdom there is no place",
                " for the kind of atrocious injustice and",
                " stupidity to which a Persian poet has",
                " given expression in the following couplet:",
                "The",
                " Arabian steed lies suffering from the wounds",
                " of the saddle-pack while a golden necklace",
                " adorns the neck of a donkey! God",
                " deals with His creatures in such a",
                " way that anyone who deserves a reward,",
                " is fully granted that reward."
            ]
        },
        {
            "id": "[11:4]",
            "verse": "To Allah is your return, and He is over all things competent.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:5]",
            "verse": "Unquestionably, they the disbelievers turn away their breasts to hide themselves from Him. Unquestionably, [even] when they cover themselves in their clothing, Allah knows what they conceal and what they declare. Indeed, He is Knowing of that within the breasts.",
            "description": [
                "When the Prophet's mission became the talk",
                " of the day in Makka, some people",
                " showed considerable aversion to it, even if",
                " they did not actively oppose it. These",
                " people were unwilling to listen to the",
                " Prophet (peace be on him) and made",
                " a point of avoiding him. If they",
                " saw him somewhere they would turn their",
                " faces away or try to hide themselves.",
                " Such people made every effort to avoid",
                " any encounter with the Prophet (peace be",
                " on him) lest he might invite them",
                " to accept his teaching.",
                "The present verse",
                " refers precisely to such people; they are",
                " portrayed as being frightened at the prospect",
                " of facing the truth. Ostrich-like they dug",
                " their heads in the sand, fancying that",
                " the reality itself had vanished. The fact,",
                " however, is that the reality remains, and",
                " testifies to the folly of those who",
                " hide from it."
            ]
        },
        {
            "id": "[11:6]",
            "verse": "And there is no creature on earth but that upon Allah is its provision, and He knows its place of dwelling and place of storage. All is in a clear register.",
            "description": [
                "God is, on the one hand, All-Knowing.",
                " He knows exactly where each of His",
                " creatures is, be it the nest of",
                " a small bird or the hole of",
                " a tiny worm. On the other hand,",
                " God provides sustenance to all, and provides",
                " for them wherever they might be. He",
                " is aware at all times of where",
                " His creatures spend their lives and where",
                " they will breathe their last. It would",
                " be sheer stupidity if someone were to",
                " think that by resorting to methods such",
                " as covering one's face, or closing one's",
                " eyes one would be able to escape",
                " God's punishment. Even if someone succeeds in",
                " eluding the Prophet's observation it is to",
                " no avail. For no one can escape",
                " God's observation. Nor should anyone entertain the",
                " illusion that God is unaware of the",
                " fact that the Prophet (peace be on",
                " him) was doing his best to communicate",
                " the truth to the unbelievers, and that",
                " the latter were trying their utmost to",
                " clog their ears lest the truth reached",
                " them."
            ]
        },
        {
            "id": "[11:7]",
            "verse": "And it is He who created the heavens and the earth in six days - and His Throne had been upon water - that He might test you as to which of you is best in deed. But if you say, \"Indeed, you are resurrected after death,\" those who disbelieve will surely say, \"This is not but obvious magic.\"",
            "description": [
                "This is a parenthetical statement which was",
                " presumably made in response to some such",
                " query: 'If there was a time when",
                " the heavens and the earth did not",
                " exist, and then they were created -",
                " what is it that existed before?' Without",
                " explicitly mentioning any such query, an answer",
                " is briefly provided. The answer is: before",
                " all the heavens and the earth were",
                " created there was water everywhere. However, we",
                " are not in a position to state",
                " with certainty the meaning of the word",
                " 'water' used in the verse. Does it",
                " mean the 'water' known to us by",
                " that name now? Or has it been",
                " used metaphorically to refer to matter in",
                " its liquid form before it assumed its",
                " present form? As for the statement that",
                " God's Throne was on water, it means",
                " - as far as we have been",
                " able to grasp -that God's kingdom was",
                " over water.",
                "*8). God created the earth",
                " and the heavens because He wanted to",
                " create man. Furthermore, He created man so",
                " as to entrust him with moral responsibility",
                " and to invest him with the power",
                " of God's vicegerency. Thereafter, it was to",
                " be seen how each human being would",
                " acquit himself of that responsibility and how",
                " he would make use of the power",
                " entrusted to him. It is possible to",
                " imagine that this was not the purpose",
                " of creating man and that God had",
                " willed man to have the powers that",
                " he now has and yet not put",
                " him to any test, nor question him",
                " about whether he used the powers granted",
                " to him appropriately or not. It is",
                " also possible to imagine that man would",
                " not be required to render any account",
                " to God nor be rewarded or punished",
                " for his deeds. It is also possible",
                " to imagine that man. who has been",
                " encumbered with moral responsibility, would simply end",
                " in dust. If all this is true,",
                " then we have no alternative but to",
                " consider this entire act of creation a",
                " senseless ploy, and human life an absolute",
                " futility.",
                "*9). The unbelievers are so downright",
                " foolish that they consider the universe no",
                " more than the playhouse of some sportive",
                " fellow, and regard themselves merely as pranks",
                " to amuse him. They are so elated",
                " with this foolish concept that even when",
                " they are informed of the true purpose",
                " of creation and of their own life",
                " in it, they simply laugh it all",
                " away. They also go to the extent",
                " of flinging the gibe of sorcerer at",
                " the Prophet (peace be on him)."
            ]
        },
        {
            "id": "[11:8]",
            "verse": "And if We hold back from them the punishment for a limited time, they will surely say, \"What detains it?\" Unquestionably, on the Day it comes to them, it will not be averted from them, and they will be enveloped by what they used to ridicule.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:9]",
            "verse": "And if We give man a taste of mercy from Us and then We withdraw it from him, indeed, he is despairing and ungrateful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:10]",
            "verse": "But if We give him a taste of favor after hardship has touched him, he will surely say, \"Bad times have left me.\" Indeed, he is exultant and boastful -",
            "description": [
                "There are weaknesses in human beings which",
                " they themselves can observe if only they",
                " engage in self-introspection. It is a measure",
                " of man's shallowness and short-sightedness that whenever",
                " he has power and wealth he brags",
                " and swaggers. In times of prosperity, he",
                " becomes incapable of even imagining that his",
                " spring can suffer a winter. The result",
                " is that whenever he is afflicted with",
                " adversity, he is driven to utter despair,",
                " becomes an incarnation of grief and despondency",
                " so much so that at times he",
                " tries to make himself forget his misfortunes",
                " by flinging abuses and taunts at God.",
                " But when these bad days are over",
                " and good days return, he once again",
                " becomes boastful. Drunk with success and prosperity,",
                " he returns to his old intemperate revelries.",
                " Why has this despicable trait of man",
                " been mentioned at this point? The purpose",
                " is to subtly remind the Makkan unbelievers",
                " of the warning the Prophet (peace be",
                " on him) gave them while they enjoyed",
                " security and well-being. He warned them that",
                " if they continued to disobey God they",
                " would be struck by a severe punishment.",
                " On hearing this warning, they had burst",
                " into laughter and, in effect, said to",
                " the Prophet (peace be on him): 'Are",
                " you blind to the bounties that are",
                " being lavished upon us? Do you not",
                " see that the standards of our greatness",
                " are fluttering all around? What makes you,",
                " then, day-dream that a scourge is about",
                " to be let loose upon us?' This",
                " disparaging response to the Prophet's sincere counsel",
                " and admonition was an abject expression of",
                " man's despicable trait referred to above. God",
                " has deferred the infliction of punishment and",
                " granted the unbelievers a reprieve in order",
                " that they may mend their ways. They,",
                " however, failed to seize the opportunity on",
                " account of the illusion that their prosperity",
                " would endure."
            ]
        },
        {
            "id": "[11:11]",
            "verse": "Except for those who are patient and do righteous deeds; those will have forgiveness and great reward.",
            "description": [
                "This brings out another aspect of 'patience';",
                " a quality in sharp contrast to that",
                " undignified trait just mentioned. Those who are",
                " patient exhibit poise and equanimity in the",
                " midst of vicissitudes of fortune. They do",
                " not allow changes of fortune to change",
                " their attitude and character. If circumstances are",
                " favourable and they enjoy wealth, power and",
                " fame, that does not make them power-drunk.",
                " Again, when they are visited with adversity,",
                " their dignity is not crushed out of",
                " all existence. Whenever God puts them to",
                " any test - be it that of",
                " prosperity or of adversity - they maintain",
                " their dignified posture of moderation. Whatever the",
                " circumstance, their mettle never fails them.",
                "*12).",
                " God forgives the sins of those who",
                " are patient and do good and He",
                " also rewards them amply for their good",
                " deeds."
            ]
        },
        {
            "id": "[11:12]",
            "verse": "Then would you possibly leave [out] some of what is revealed to you, or is your breast constrained by it because they say, \"Why has there not been sent down to him a treasure or come with him an angel?\" But you are only a warner. And Allah is Disposer of all things.",
            "description": [
                "In order to fully understand the verse",
                " one should take mental note of the",
                " circumstantial background of its revelation. At the",
                " time this verse was revealed, Makka was",
                " the centre of the Quraysh who had",
                " a preponderant influence over the whole of",
                " Arabia because of their religious prestige, wealth,",
                " trade, and political power. At the very",
                " moment when the Quraysh were at the",
                " zenith of their power and authority, a",
                " Makkan - the Prophet - stood up",
                " and vehemently denounced the religion of which",
                " they were custodians as a bundle of",
                " ignorance and error. He also condemned the",
                " social system of which they were standard-bearers,",
                " calling it rotten to the core. He",
                " also warned them of an impending punishment",
                " from God. He emphasized that the only",
                " way to avert this punishment was to",
                " accept the true faith and righteous order",
                " of life which he had expounded to",
                " them on God's behalf.",
                "The only thing",
                " which this man had to make people",
                " believe he had been appointed by God",
                " to communicate His message, was the purity",
                " of his character and the utter reasonableness",
                " of his teaching. In addition, there was",
                " apparently nothing in the milieu except the",
                " deep-rooted wrongs which had corrupted the religious,",
                " moral and social life of the Quraysh",
                " that would suggest that God's punishment was",
                " close at hand. On the contrary, all",
                " portents indicated that the Makkans enjoyed God's",
                " plenteous favours and of the deities which",
                " they worshipped. Thus, apparently they had every",
                " reason to believe that they were on",
                " the right path.",
                "If, under such circumstances,",
                " someone in the manner of the Prophet",
                " (peace be on him) were to strongly",
                " denounce the prevalent way of life, it",
                " was hardly surprising that all except a",
                " very few right-thinking people who had access",
                " to the truth would become his inveterate",
                " enemies. This enmity found its expression in",
                " a myriad of forms. Some people sought",
                " to suppress the Prophet (peace be on",
                " him) by resorting to harsh methods of",
                " repression. Others tried to undermine his position",
                " by false accusations and vicious propaganda. Some",
                " discouraged him with their bigoted indifference and",
                " frowning, while others resorted to jests, pranks,",
                " taunts, and ridicule in order to dismiss",
                " his message as absurd.",
                "It is clear",
                " that such a hostile attitude would have",
                " been heart-breaking for the Prophet (peace be",
                " on him). This would have been especially",
                " so since the hostility persisted for several",
                " years. It is under these trying circumstances",
                " that God consoled the Prophet (peace be",
                " on him). He comforted him by saying",
                " that it is people of low mettle",
                " who turn boastful in prosperity and become",
                " downcast and despondent in adversity. A worthy",
                " person in God's sight pursues righteousness with",
                " patience and courage. Hence, the Prophet (peace",
                " be on him) should not be shaken",
                " by the bigoted opposition, the aversion, the",
                " ridicule and mockery, and the foolish objections",
                " which he was subjected to by the",
                " unbelievers. On the contrary, he should have",
                " no hesitation, despite all the opposition he",
                " faced, in calling people to the truth",
                " revealed by God. In fact, he should",
                " not even permit a moment's reluctance in",
                " proclaiming the truth for fear that he",
                " would be ridiculed for propagating those teachings.",
                " Nor should he shrink from performing his",
                " duty to preach because some of those",
                " teachings would be too unpalatable for his",
                " people even to hear. For the main",
                " task of the Prophet (peace be on",
                " him) was to continuously state the truth,",
                " uncompromisingly and fearlessly, and regardless of those",
                " who accepted it and those who did",
                " not. Once this duty had been performed,",
                " it was pointless worrying whether it would",
                " be of any effect. In that regard,",
                " the Prophet (peace be on him) ought",
                " to place his reliance entirely on God.",
                ""
            ]
        },
        {
            "id": "[11:13]",
            "verse": "Or do they say, \"He invented it\"? Say, \"Then bring ten surahs like it that have been invented and call upon [for assistance] whomever you can besides Allah, if you should be truthful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:14]",
            "verse": "And if they do not respond to you - then know that the Qur'an was revealed with the knowledge of Allah and that there is no deity except Him. Then, would you [not] be Muslims?",
            "description": [
                "The argument advanced here serves to establish",
                " the divine origin of the Qur'an as",
                " well as the oneness of God. The",
                " argument, put succinctly, is as follows:",
                "(i)",
                " If the unbelievers thought that the Qur'an",
                " had been authored by some human being,",
                " then it ought to be possible for",
                " them to compose something which would be",
                " the like of it. Now, unbelievers claim",
                " that it is the Prophet (peace be",
                " on him) - a human being rather",
                " than God - who has produced the",
                " Qur'an. In such a case it should",
                " be possible for them - for they",
                " too are human - to produce such",
                " a book. However, despite the repeated challenges",
                " for them to produce something like the",
                " Qur'an no one, not even all of",
                " them combined, has succeeded in achieving it.",
                " The conclusion is quite evident: the Book",
                " was revealed by God and there is",
                " no question that it is the work",
                " of any human being.",
                "(ii) The Qur'an",
                " quite openly and vehemently denounced the deities",
                " which the unbelievers worshipped, and urged them",
                " to abandon these as they had no",
                " share in God's godhead. The unbelievers were",
                " also asked to mobilize all whom they",
                " wished, including their deities - provided they",
                " had any power - to assist them",
                " in establishing the falsity of the Prophet's",
                " claim by producing a book equal to",
                " the Qur'an. But if at such a",
                " crucial stage, their deities fail to come",
                " to their aid and do not grant",
                " them the power to produce something like",
                " the Qur'an, what then does that prove?",
                " Quite obviously, it proves that these so-called",
                " deities had neither the power nor even",
                " a shred of the attributes necessary for",
                " godhead. The fact of their becoming deities",
                " was purely the work of a few",
                " human beings who had invested such weak,",
                " mortal creatures with godhead.",
                "Incidentally, this verse",
                " also establishes the fact that in terms",
                " of chronological sequence the present surah -",
                " Hud- was revealed before Surah Yunus. For",
                " in the present surah, the unbelievers have",
                " been challenged to produce ten surahs like",
                " the Qur'anic ones. Subsequently, after the unbelievers",
                " failed to do so, they were asked",
                " in Surah Yunus to produce just one",
                " surah like it. (See Yunus 10: 38,",
                " n. 46.)"
            ]
        },
        {
            "id": "[11:15]",
            "verse": "Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived.",
            "description": [
                "What prompted this Qur'anic remark is the",
                " fact that the kind of people who",
                " rejected the message of the Qur'an both",
                " in the time of the Prophet (peace",
                " be on him) and subsequently have one",
                " major characteristic in common - they are",
                " all steeped in worldliness. Many of the",
                " arguments which they advance in order to",
                " reject the Qur'an are probably after-thoughts, merely",
                " rationalized excuses for not accepting the truth.",
                " What lies at the root of these",
                " people's rejection is the hypothesis that everything",
                " other than this world and its gains",
                " are worthless, and that everyone should have",
                " the fullest opportunity to seize the optimum",
                " portion of worldly benefits."
            ]
        },
        {
            "id": "[11:16]",
            "verse": "Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do.",
            "description": [
                "Those who keep their attention focused on",
                " this world and its benefits will reap",
                " worldly benefits in proportion to their efforts.",
                " However, since such people have not been",
                " concerned with, nor did they direct their",
                " efforts to achieving success and well-being in",
                " the Hereafter, there is no reason to",
                " suppose that their efforts, aimed merely at",
                " achieving worldly benefits, will also embrace the",
                " benefits of the Hereafter. A person can",
                " expect that his action in this world",
                " will be of some benefit to him",
                " in the Next Life only if he",
                " has engaged himself in tasks which are",
                " beneficial in the Next Life as well.",
                " This can be illustrated by example. A",
                " person wants to have a stately mansion",
                " to live in and to that end",
                " he adopts the means that are ordinarily",
                " adopted for its construction.",
                "Now, if he",
                " has adopted the requisite means he will",
                " indeed have a stately mansion. Even if",
                " such a person happens to be an",
                " unbeliever, this fact will not prevent the",
                " mansion from being constructed. However, when such",
                " a person breathes his last, he will",
                " have to leave behind that mansion and",
                " its belongings and will be able to",
                " take nothing of it to the Next",
                " World. Now, if he has not taken",
                " the necessary steps to obtain a mansion",
                " in the Next World, he will simply",
                " not obtain any such mansion there. Only",
                " those who performed deeds which, according to",
                " God's Law, would make him deserve a",
                " mansion in the Next World will be",
                " able to have it.",
                "One might be",
                " inclined to say: \"This line of argument",
                " at best leads to the conclusion that",
                " such a person who cares only for",
                " this world, should be denied a mansion",
                " in the Next World. But does that",
                " also call for consigning him, in the",
                " Next World, to Hell-Fire?' On this point",
                " the Qur'an explains on more than one",
                " occasion that all those who work in",
                " total disregard of the Hereafter necessarily engage",
                " in acts which lead them to end",
                " up in a heap of Fire in",
                " the Next Life rather than in a",
                " mansion in Paradise. (See, for instance, Yunus",
                " 10, n. 12.)"
            ]
        },
        {
            "id": "[11:17]",
            "verse": "So is one who [stands] upon a clear evidence from his Lord [like the aforementioned]? And a witness from Him follows it, and before it was the Scripture of Moses to lead and as mercy. Those [believers in the former revelations] believe in the Qur'an. But whoever disbelieves in it from the [various] factions - the Fire is his promised destination. So be not in doubt about it. Indeed, it is the truth from your Lord, but most of the people do not believe.",
            "description": [
                "This shows that even apart from revelation,",
                " there is ample evidence in man's own",
                " self, in the structure of the heavens",
                " and the earth, and in the order",
                " that prevails in the universe to prove",
                " that God is the only creator, master,",
                " lord and sovereign of the universe. The",
                " evidence referred to above also inclines man",
                " to believe that the present life will",
                " be followed by another one in which",
                " man will be required to render an",
                " account of his deeds and wherein he",
                " might be requited.",
                "*18). The 'witness from",
                " Him' is the Qur'an. The testimony of",
                " the natural phenomena combined with that provided",
                " by man's own self had already created",
                " in man the disposition to affirm the",
                " truths mentioned earlier. All that was further",
                " reinforced by the Qur'an which came as",
                " reassurance that what he was predisposed to",
                " believe in was indeed true.",
                "*19). In",
                " the present context the verse means that",
                " those who are overly infatuated with the",
                " allurements of a worldly life will be",
                " inclined to reject the message of the",
                " Qur'an. Distinguishable from these are those who",
                " take full note of the testimony furnished",
                " by their own beings and by the",
                " structure and order prevailing in the universe",
                " in support of God's unity. This testimony",
                " was further reinforced by the heavenly books",
                " revealed before the Qur'an. How could such",
                " persons close their eyes to such overwhelming",
                " testimony as this and join their voice",
                " with those of the unbelievers?",
                "This verse",
                " clearly indicates that even before the Qur'an",
                " was revealed, the Prophet (peace be on",
                " him) had reached the stage of belief",
                " in the Unseen. We have seen in",
                " al-An'am (see 6: 75 ff.) the case",
                " of Abraham. Before being appointed a Prophet,",
                " Abraham (peace be on him) was led",
                " by a careful observation of the natural",
                " phenomena to knowledge of God's unity. Likewise,",
                " the present verse makes it clear that",
                " by his reflection, the Prophet (peace be",
                " on him), had been led to believe",
                " in the Unseen even before the Qur'an",
                " was revealed. Subsequently, when the Qur'an was",
                " revealed it not only confirmed what he",
                " had already become inclined to accept, but",
                " also provided definite knowledge about it."
            ]
        },
        {
            "id": "[11:18]",
            "verse": "And who is more unjust than he who invents a lie about Allah? Those will be presented before their Lord, and the witnesses will say, \"These are the ones who lied against their Lord.\" Unquestionably, the curse of Allah is upon the wrongdoers.",
            "description": [
                "To invent a lie against God consists",
                " of stating that beings other than God",
                " also have a share with God in",
                " His godhead, that like God they are",
                " also entitled to be served and worshipped",
                " by God's creatures. Inventing a lie against",
                " God also consists of stating that God",
                " is not concerned with providing guidance to",
                " His creatures, that He did not raise",
                " Prophets for that purpose, and that He",
                " rather left men free to behave as",
                " they pleased. Inventing a lie against God",
                " also consists of stating that God created",
                " human beings by way of jest and",
                " sport and that He will not have",
                " them render an account to Him, and",
                " that He will not requite them for",
                " their deeds.",
                "*21). Such a proclamation would",
                " be made on the Day of Judgement.",
                ""
            ]
        },
        {
            "id": "[11:19]",
            "verse": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they, concerning the Hereafter, were disbelievers.",
            "description": [
                "This is a parenthetical statement. That is,",
                " that God's curse will be proclaimed in",
                " the Hereafter against those who are guilty",
                " of the crimes mentioned.",
                "*23). Such persons",
                " do not like the Straight Way being",
                " expounded to them. They would rather have",
                " the Straight Way rendered crooked by altering",
                " it under the influence of lust, prejudice,",
                " fancy, and superstition. It is only after",
                " the way that was once straight has",
                " been rendered crooked that they will be",
                " willing to accept it."
            ]
        },
        {
            "id": "[11:20]",
            "verse": "Those were not causing failure [to Allah] on earth, nor did they have besides Allah any protectors. For them the punishment will be multiplied. They were not able to hear, nor did they see.",
            "description": [
                "This, again, refers to what will happen",
                " in the Next Life.",
                "*25). They will",
                " suffer punishment for being in error and",
                " for misleading others and leaving behind a",
                " legacy of error and misguidance for coming",
                " generations. (See Towards Understanding the Qur'an, vol.",
                " Ill, al-A'raf, n. 30, pp. 23-6 -Ed.)",
                ""
            ]
        },
        {
            "id": "[11:21]",
            "verse": "Those are the ones who will have lost themselves, and lost from them is what they used to invent.",
            "description": [
                "All their conjectures regarding God, the universe",
                " and their own selves will prove to",
                " be absolutely baseless in the Next Life.",
                " Similarly, the notions they entertained about the",
                " help and support they would receive from",
                " those they considered to be either their",
                " deities, or their intercessors with God, or",
                " their patrons will prove to be false.",
                " Likewise, it will become obvious that all",
                " their notions about the After-life were utterly",
                " untrue."
            ]
        },
        {
            "id": "[11:22]",
            "verse": "Assuredly, it is they in the Hereafter who will be the greatest losers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:23]",
            "verse": "Indeed, they who have believed and done righteous deeds and humbled themselves to their Lord - those are the companions of Paradise; they will abide eternally therein.",
            "description": [
                "This concludes the account about the Hereafter.",
                ""
            ]
        },
        {
            "id": "[11:24]",
            "verse": "The example of the two parties is like the blind and deaf, and the seeing and hearing. Are they equal in comparison? Then, will you not remember?",
            "description": [
                "Can the attitude and ultimate end of",
                " both these types of people be the",
                " same? Obviously, he who fails to see",
                " the right way and ignores the instruction",
                " of the guide who directs him to",
                " the right way will necessarily stumble and",
                " meet with some terrible mishap. However, he",
                " who perceives the right way and follows",
                " the instructions of his guide will reach",
                " his destination, and reach it safely.",
                "The",
                " same difference is found between the two",
                " parties mentioned here. One of these carefully",
                " observes the realities of the universe and",
                " pays heed to the teachings of God's",
                " Messengers. The other party, however, neither uses",
                " their eyes properly to perceive God's signs,",
                " nor pays heed to His Messengers. The",
                " behaviour of the two parties is, therefore,",
                " bound to be different. And when their",
                " behaviour is different, there is no reason",
                " to believe that their ultimate end will",
                " be identical."
            ]
        },
        {
            "id": "[11:25]",
            "verse": "And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner",
            "description": [
                "It is pertinent at this stage to",
                " bear in mind Towards Understanding the Qur'an,",
                " vol. III. al-A'raf 7: 59-64. nn. 47-50,",
                " pp. 37-42."
            ]
        },
        {
            "id": "[11:26]",
            "verse": "That you not worship except Allah. Indeed, I fear for you the punishment of a painful day.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:27]",
            "verse": "So the eminent among those who disbelieved from his people said, \"We do not see you but as a man like ourselves, and we do not see you followed except by those who are the lowest of us [and] at first suggestion. And we do not see in you over us any merit; rather, we think you are liars.\"",
            "description": [
                "Substantially, the same warning was delivered by",
                " the Prophet Muhammad (peace be on him)",
                " in the first few verses (viz. 2-3)",
                " of this surah.",
                "*31). This is exactly",
                " the same absurd objection which the Makkans",
                " raised against the Prophet Muhammad (peace be",
                " on him). They found it inconceivable that",
                " a mortal like themselves who ate arid",
                " drank, walked and slept, and who also",
                " had a family could be designated a",
                " Messenger by God. (See Ya Sin 36,",
                " n. Il;al-Shura42,n.41.)",
                "*32). Again, it is noteworthy",
                " that the same objection raised by Noah's",
                " people against him was raised by the",
                " Makkans against the Prophet (peace be on",
                " him). The objection being that it is",
                " only persons of insignificant position who joined",
                " the Prophet's (peace be on him) ranks.",
                " They, thus, tried to belittle both the",
                " Message and the Messenger by highlighting that",
                " his followers were either a few raw",
                " youths, a bunch of slaves, or a",
                " group of feeble-minded and superstitious commoners from",
                " the lower rungs of society. (See Towards",
                " Understanding the Qur'an, vol. Il,al-An'arn6,nn. 34-7,pp. 235-7,",
                " and Yunus 10, n. 78. p. 57",
                " above.)",
                "*33). The believers claimed that they",
                " enjoyed God's favour and mercy, and that",
                " those who chose to deviate from their",
                " way were subject to God's wrath."
            ]
        },
        {
            "id": "[11:28]",
            "verse": "He said, \"O my people have you considered: if I should be upon clear evidence from my Lord while He has given me mercy from Himself but it has been made unapparent to you, should we force it upon you while you are averse to it?",
            "description": [
                "This amounts to virtually repeating the statement",
                " mentioned earlier (see verse 17 and n.",
                " 17 ff. above). The statement suggested that",
                " the Prophet (peace be on him) had",
                " reached the stage of affirming the unity",
                " of God as a result of his",
                " own reflection. Whereafter, God favoured him by",
                " designating him a Prophet and providing him",
                " with direct knowledge of the truths about",
                " which his heart was already convinced.",
                "This",
                " also shows that the Prophets attain belief",
                " regarding the realm of the Unseen before",
                " they are appointed to the office of",
                " prophethood. When they are subsequently designated Prophets,",
                " they are endowed with faith in the",
                " truths belonging to the realm of the",
                " Unseen as a result of direct knowledge",
                " of those truths."
            ]
        },
        {
            "id": "[11:29]",
            "verse": "And O my people, I ask not of you for it any wealth. My reward is not but from Allah. And I am not one to drive away those who have believed. Indeed, they will meet their Lord, but I see that you are a people behaving ignorantly.",
            "description": [
                "The Prophet Noah (peace be on him)",
                " told his people that he had sincerely",
                " counselled his people about what was conducive",
                " to their well-being. Noah bore all kinds",
                " of hardship and suffering, and all for",
                " the well-being of his people. Noah sought",
                " to achieve no personal benefit out of",
                " his striving to call",
                "*36). The worth",
                " of the believers is best known only",
                " to their Lord which will become fully",
                " evident when they encounter Him on the",
                " Day of Judgement. If they indeed are",
                " true gems, they will not then become",
                " pieces of ordinary rock just because some",
                " people in this world had disparagingly thrown",
                " them aside. But if, on the contrary,",
                " they are indeed nothing but mere pieces",
                " of ordinary rock, their Lord has every",
                " right to cast them wherever He pleases.",
                " (See Towards Understanding the Qur'an, vol. II,",
                " al-An'am 6: 52, and al-Kahf 18:28.)"
            ]
        },
        {
            "id": "[11:30]",
            "verse": "And O my people, who would protect me from Allah if I drove them away? Then will you not be reminded?",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:31]",
            "verse": "And I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel, nor do I say of those upon whom your eyes look down that Allah will never grant them any good. Allah is most knowing of what is within their souls. Indeed, I would then be among the wrongdoers.\"",
            "description": [
                "This is a rejoinder to the Prophet",
                " Noah's opponents. His opponents tried to discredit",
                " him by saying that he appeared to",
                " them to be merely an ordinary human",
                " being just like any one of them.",
                " In response to this Noah acknowledges that",
                " he is indeed nothing more than a",
                " human being, and that he has never",
                " claimed to be anything other than that.",
                " Hence, any attack on him on the",
                " grounds that he was merely a human",
                " being was pointless.",
                "Noah (peace be on",
                " him), like other Prophets, had claimed no",
                " more than what God had intimated to",
                " him about the Straight Way comprising right",
                " beliefs and sound principles of behaviour. His",
                " people were free to test him in",
                " regard to that claim. It was strange,",
                " however, that they asked him about a",
                " matter which lay beyond the ken of",
                " human perception, something which he had never",
                " claimed to know They also made strange",
                " demands of him which suggested that he",
                " possessed the keys to God's treasures. They",
                " even taunted him on the grounds that",
                " like other human beings he also ate",
                " and drank and walked around.",
                "All this",
                " was meaningless for Noah (peace be on",
                " him) had never claimed to he an",
                " angel and that as such he could",
                " dispense with necessary physical and biological requirements.",
                " All that Noah (peace be on him)",
                " had claimed was that he possessed the",
                " knowledge needed to guide human beings in",
                " matters of belief, moral conduct, and social",
                " behaviour. Now, what sense did it make",
                " to ask such a person what gender",
                " a cow's calf would be? By what",
                " stretch of the imagination can one establish",
                " a nexus between the pregnancy of a",
                " cow and sound principles of individual and",
                " social conduct? (See also Towards Understanding the",
                " Qur'an, vol. II, al-An'am 6, nn. 31-2,",
                " pp. 234-5.)"
            ]
        },
        {
            "id": "[11:32]",
            "verse": "They said, \"O Noah, you have disputed us and been frequent in dispute of us. So bring us what you threaten us, if you should be of the truthful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:33]",
            "verse": "He said, \"Allah will only bring it to you if He wills, and you will not cause [Him] failure.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:34]",
            "verse": "And my advice will not benefit you - although I wished to advise you - If Allah should intend to put you in error. He is your Lord, and to Him you will be returned.\"",
            "description": [
                "Such was their obduracy, mischievousness and absolute",
                " disregard for righteous behaviour that quite understandably",
                " God should decide not to direct them",
                " to the right way and instead let",
                " them, as they wished, stumble in error.",
                " Once God had made such a decision",
                " no one's effort to direct them to",
                " the right way - not even the",
                " Prophet's - could be of any avail.",
                ""
            ]
        },
        {
            "id": "[11:35]",
            "verse": "Or do they say [about Prophet Muhammad], \"He invented it\"? Say, \"If I have invented it, then upon me is [the consequence of] my crime; but I am innocent of what [crimes] you commit.\"",
            "description": [
                "The context seems to suggest how the",
                " opponents reacted to the narration of Noah's",
                " story. It seems they would have objected",
                " to it on the grounds that the",
                " true purpose of narrating Noah's story was",
                " to show how it was applicable to",
                " the unbelievers. They presumably pointed out that",
                " the Prophet (peace be on him) had",
                " invented such stories merely to ridicule and",
                " disgrace them; that these stories were merely",
                " a means whereby he could malign them.",
                "",
                "The main theme of the discourse has",
                " been interrupted here in order to respond",
                " to this objection. Petty people are apt",
                " to misinterpret things. Their mental baseness allows",
                " them only to perceive that which is",
                " evil and to disregard those aspects which",
                " are good. If someone offers a piece",
                " of wisdom, or seeks to convey a",
                " piece of good advice, or draws the",
                " attention of someone to any of his",
                " weaknesses, a wise person will benefit from",
                " what is said and will reform himself.",
                " But a petty person will always be",
                " inclined to see something evil in it.",
                " Such an attitude will reduce to naught",
                " the wisdom or sincere counsel that was",
                " offered. Moreover, such a person will continue",
                " to adhere to his evil ways. Not",
                " only that but he is also likely",
                " to attribute some evil motive to the",
                " person who had sought to say a",
                " word of wisdom or to furnish him",
                " with sincere advice.",
                "Even the best advice",
                " goes to waste if someone misunderstands it.",
                " For it is possible that someone may",
                " construe a piece of advice as arising",
                " not out of sincere concern for but",
                " out of a desire to taunt. In",
                " such instances, instead of dispassionately examining his",
                " own life with a view to identifying",
                " his flaws and weaknesses, this person is",
                " likely to feel offended. Such a person",
                " will be wont to assume, and will",
                " often go about saying, that the advice",
                " was actuated by ulterior motives and was",
                " meant to insult him. Suppose a reformer",
                " mentions, for instructive purposes, what is going",
                " on in society. It is possible that",
                " some of the things mentioned might also",
                " be applicable to a person's case and",
                " might seem to allude to some actual",
                " flaw or shortcoming in his character. Now,",
                " it is quite possible that the reformer",
                " did not intend to point an accusing",
                " finger at any particular person. Instead, he",
                " merely wanted to bring to people's attention",
                " the unhealthy attitudes found in society. If",
                " the person concerned is wise, he will",
                " not enmesh himself with questions about whether",
                " the reformer's statement was meant to cast",
                " a slur on his character. He will",
                " recognize instead the worth of the statement,",
                " will seize its instructive aspects, and will",
                " make an effort to mend his behaviour",
                " accordingly.",
                "However, if a man has a",
                " warped mind and is given only to",
                " seeing evil intentions in people's actions, he",
                " is likely to fling accusations at the",
                " reformer. He will go about condemning his",
                " statement as a bundle of fabrications concocted",
                " with a view to bringing him into",
                " disrepute. It is for this reason that",
                " the Prophet (peace be on him) was",
                " asked to say that if he had",
                " fabricated something, he would be responsible for",
                " the sin of such a fabrication. This",
                " would not, however, absolve others of the",
                " guilt and evils they had committed in",
                " the past and which they continued to",
                " commit."
            ]
        },
        {
            "id": "[11:36]",
            "verse": "And it was revealed to Noah that, \"No one will believe from your people except those who have already believed, so do not be distressed by what they have been doing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:37]",
            "verse": "And construct the ship under Our observation and Our inspiration and do not address Me concerning those who have wronged; indeed, they are [to be] drowned.\"",
            "description": [
                "This demonstrates that when a Messenger communicates",
                " his Message to his people, they are",
                " granted respite from punishment only as long",
                " as it remains possible for the social",
                " milieu to produce a reasonable number of",
                " good people. As soon as that milieu",
                " becomes shorn of good people, and none",
                " but the iniquitous remain, then the term",
                " of respite ends. At this juncture, God's",
                " Mercy itself calls for the destruction of",
                " these incorrigible rogues lest they also contaminate",
                " others. For to show any further leniency",
                " to them would amount to perpetrating an",
                " injustice on the whole world and on",
                " future generations."
            ]
        },
        {
            "id": "[11:38]",
            "verse": "And he constructed the ship, and whenever an assembly of the eminent of his people passed by him, they ridiculed him. He said, \"If you ridicule us, then we will ridicule you just as you ridicule.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:39]",
            "verse": "And you are going to know who will get a punishment that will disgrace him [on earth] and upon whom will descend an enduring punishment [in the Hereafter].\"",
            "description": [
                "This fascinating story illustrates how man can",
                " be deluded by the appearance of things.",
                " When the Prophet Noah (peace be on",
                " him) was busy building the Ark on",
                " a tract of land far from any",
                " sea or river, it must have appeared",
                " a very silly thing to do. Noah's",
                " people would surely have laughed at him,",
                " mocking at the old fellow's apparently senile",
                " plan. They may even have called it",
                " an adventure of sailing on the Ark",
                " across dry land! At that moment it",
                " would have simply been inconceivable for anyone",
                " to think that the Ark would one",
                " day indeed sail on that very tract",
                " of land as it became flooded with",
                " water. Hence they perhaps went around telling",
                " people that if anyone needed proof of",
                " Noah's mental derangement, this was now no",
                " longer needed.",
                "The same act would, however,",
                " have been perceived quite differently by anyone",
                " who really knew what was going to",
                " happen, who knew that soon enough a",
                " ship would indeed be a necessity for",
                " anyone who wished to move around. Such",
                " a person could only have laughed at",
                " the ignorance and stupid complaisance of his",
                " people. Noah (peace be on him), who",
                " knew these things well, would often have",
                " said to himself: 'How stupid are these",
                " people! God's chastisement is just about to",
                " afflict them, and I have been warning",
                " them of this. That moment has all",
                " but come and they even see me",
                " making an effort to escape the impending",
                " chastisement. Is it not strange that they",
                " remain totally unperturbed? Not only that, but",
                " they look upon me as an utter",
                " lunatic.'",
                "This offers a good illustration of",
                " two contrasting attitudes. One is based on",
                " knowledge of the apparent, one that is",
                " grasped by the senses. The other is",
                " based on true knowledge, a knowledge of",
                " truths that lie beyond the range of",
                " the apparent. If one were to be",
                " satisfied with what is apparent, one would",
                " regard many a thing as sheer folly.",
                " Now, if there is someone who knows",
                " truths that lie beyond the range of",
                " the apparent, that person will consider these",
                " apparent follies the very zenith of wisdom.",
                " Such a person would indeed consider the",
                " flair of smartness displayed by the superficially",
                " knowledgeable to be no more than ignorance",
                " and stupidity."
            ]
        },
        {
            "id": "[11:40]",
            "verse": "[So it was], until when Our command came and the oven overflowed, We said, \"Load upon the ship of each [creature] two mates and your family, except those about whom the word has preceded, and [include] whoever has believed.\" But none had believed with him, except a few.",
            "description": [
                "Commentators on the Qur'an have offered different",
                " explanations of this incident. In our view,",
                " the place from which the Flood began",
                " was a particular oven. It is from",
                " beneath it that a spring of water",
                " burst forth. This was followed by both",
                " a heavy downpour and by a very",
                " large number of springs which gushed forth.",
                " Surah al-Qamar provides relevant information in some",
                " detail: So We opened the gates of",
                " the heaven, with water intermittently pouring forth,",
                " and We caused the earth to be",
                " cleaved and the springs to flow out",
                " everywhere. Then the water (from both the",
                " sources - the heaven and the earth)",
                " converged to bring about that which had",
                " been decreed (al-Qamar, 54: 11-12).",
                "In the",
                " present verse, the word tannur has been",
                " preceded by the article al: According to",
                " Arabic grammar, this indicates that the reference",
                " is to a particular tannur (oven). Thus,",
                " it is evident that God had determined",
                " that the Flood should commence from a",
                " particular oven. As soon as the appointed",
                " moment came, and as soon as God",
                " so ordained, water burst forth from that",
                " oven. Subsequently, it became known as the",
                " Flood-Oven. The fact that God had earmarked",
                " a certain oven to serve as the",
                " starting-point of the Flood is borne out",
                " by al-Mu'minun 23: 27.",
                "*43). Information that",
                " some members of Noah's family were unbelievers",
                " and so were unworthy of God's mercy",
                " had already been given. Noah (peace be",
                " on him) had also been directed not",
                " to provide them with space in the",
                " Ark. Presumably these were only two persons.",
                " One was Noah's own son; the story",
                " of his drowning will be referred to",
                " shortly (see verse 43 below). The other",
                " was Noah's wife (see al-Tahrim 66: 15).",
                " It is possible that some other members",
                " of Noah's family also belonged to this",
                " category. Be that as it may, the",
                " Qur'an does not expressly mention any others.",
                "",
                "*44). This refutes the opinion of those",
                " historians and genealogists who trace the ancestry",
                " of all human beings to Noah's three",
                " sons. This misconception has arisen from the",
                " Israelite traditions which suggest that Noah, his",
                " three sons and their wives were the",
                " only survivors of the Flood. (See Genesis",
                " 6: 18, 7: 7, p. 1 and",
                " 9: 19.) The Qur'an, however, repeatedly says",
                " that apart from Noah's family, at least",
                " some other people belonging to his nation",
                " - even if only a few -",
                " were also saved by God from the",
                " Flood. The Qur'an, therefore, considers the future",
                " generations of mankind to have descended not",
                " only from Noah, but also from those",
                " believers who, under God's directive, were accommodated",
                " in the Ark by Noah. It is",
                " significant that the Qur'an mentions post-Flood mankind",
                " as the 'offspring of those whom We",
                " carried along with Noah' (al-Isra 17: 3)",
                " and the 'offspring of Adam and those",
                " whom We carried along with Noah' (Maryam",
                " 19: 58). It does not refer to",
                " them simply as 'the offspring of Noah'.",
                ""
            ]
        },
        {
            "id": "[11:41]",
            "verse": "And [Noah] said, \"Embark therein; in the name of Allah is its course and its anchorage. Indeed, my Lord is Forgiving and Merciful.\"",
            "description": [
                "Trust in God is the quintessential characteristic",
                " of the believer. True, like any other",
                " person, the believer also has recourse to",
                " worldly measures. It is, in fact, necessary",
                " to use them on account of the",
                " laws of nature under which all human",
                " beings live and operate. One thing, however,",
                " differentiates a believer from a man of",
                " the world. A believer, while having recourse",
                " to worldly measures, places his reliance on",
                " God rather than on the measures he",
                " adopts. He is well aware that none",
                " of his measures can be of any",
                " avail unless they coincide with God's favour",
                " and mercy."
            ]
        },
        {
            "id": "[11:42]",
            "verse": "And it sailed with them through waves like mountains, and Noah called to his son who was apart [from them], \"O my son, come aboard with us and be not with the disbelievers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:43]",
            "verse": "[But] he said, \"I will take refuge on a mountain to protect me from the water.\" [Noah] said, \"There is no protector today from the decree of Allah, except for whom He gives mercy.\" And the waves came between them, and he was among the drowned.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:44]",
            "verse": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and the ship came to rest on the [mountain of] Judiyy. And it was said, \"Away with the wrongdoing people.\"",
            "description": [
                "Mount Judi is situated to the north-east",
                " of the Island of Ibn 'Umar in",
                " Kurdistan. According to the Bible, the Ark's",
                " resting place was Ararat, which is the",
                " name of a particular mountain as well",
                " as of a whole range of mountains",
                " in Armenia. Ararat, in the sense of",
                " a mountain range, extends from the Armenian",
                " plateau to southern Kurdistan. The mount called",
                " Judi is part of this range and",
                " is known even today by the same",
                " name. In ancient historical accounts, Mount Judi",
                " is mentioned as the place where the",
                " Ark rested. Around 250 B.C., a Babylonian",
                " priest, Berasus, wrote a history of his",
                " country based on Chaldean traditions. He mentions",
                " Judi as the resting-place of Noah's Ark.",
                " The history written by Abydenus, a disciple",
                " of Aristotle, also corroborates this. Abydenus further",
                " remarks that many people in Mesopotamia possessed",
                " pieces of the Ark which they used",
                " as a charm. They ground those pieces",
                " in water and gave the preparation to",
                " the sick so as to cure them",
                " of their ailments.",
                "In connection with this",
                " great incident one is also faced with",
                " the question of whether the Flood was",
                " universal or whether it was limited to",
                " the area inhabited by the people of",
                " Noah. This question remains unanswered to this",
                " day. Under the influence of Israelite traditions,",
                " it is believed that it was a",
                " universal Flood (Genesis 7: 18-24). The Qur'an,",
                " however, does not explicitly say so. There",
                " are several allusions in the Qur'an which",
                " indicate that subsequent generations of mankind are",
                " the descendants of those who were saved",
                " from the Flood. But that does not",
                " necessarily mean that the Flood covered the",
                " whole world. For, it is quite plausible",
                " that at that point in history the",
                " human population was confined only to the",
                " area which was overtaken by the Flood,",
                " and that those born after the Flood",
                " gradually dispersed to other parts of the",
                " world.",
                "This view is supported by two",
                " things. Firstly, ancient historical traditions, archaeological discoveries",
                " and geological data provide evidence that a",
                " great flood took place at some period",
                " in the distant past in the Tigris-Euphrates",
                " region. There is no such evidence for",
                " a universal flood. Secondly, traditions about a",
                " great flood have been popular among all",
                " communities of the world down the ages.",
                " Such traditions are found even in the",
                " folklore of such distant regions as Australia,",
                " America and New Guinea. One may thus",
                " conclude that at some time in the",
                " past the ancestors of all these communities",
                " lived together in some region which was",
                " overtaken by the Flood. Since presumably their",
                " descendants subsequently dispersed to, and settled down",
                " in. different parts of the world, they",
                " transmitted and preserved the traditions of this",
                " great Flood. (For details see Towards Understanding",
                " the Qur'an, vol. Ill, al-A'raf 7 n.",
                " 47, pp. 37-8.)"
            ]
        },
        {
            "id": "[11:45]",
            "verse": "And Noah called to his Lord and said, \"My Lord, indeed my son is of my family; and indeed, Your promise is true; and You are the most just of judges!\"",
            "description": [
                "Noah (peace be on him) reminds God",
                " of His promise to spare his family.",
                " Since his son was quite obviously part",
                " of his family. Noah requests of God",
                " that he be spared.",
                "*48). Noah (peace",
                " be on him) acknowledges that God's judgement",
                " is final; that it is one against",
                " which there can be no appeal. Moreover,",
                " God's judgement is also based on absolute",
                " knowledge and perfect justice."
            ]
        },
        {
            "id": "[11:46]",
            "verse": "He said, \"O Noah, indeed he is not of your family; indeed, he is [one whose] work was other than righteous, so ask Me not for that about which you have no knowledge. Indeed, I advise you, lest you be among the ignorant.\"",
            "description": [
                "The import of this Qur'anic verse may",
                " best be appreciated by analogy to the",
                " limbs on a person's body. A limb",
                " may become rotten and a physician may",
                " decide to remove it by surgical operation.",
                " Now, the patient may ask his doctor",
                " not to amputate because it is a",
                " part of his body. The natural reply",
                " of the physician would be that the",
                " rotten limb was not truly a part",
                " of his body. Such a reply does",
                " not amount to denying, in a literal",
                " sense, the obvious fact that the limb",
                " is a part of that person's body.",
                " What such a statement actually means is",
                " that a person's body requires sound and",
                " healthy limbs rather than those which are",
                " rotten. For rotten limbs are not only",
                " useless, they are even able to damage",
                " other healthy limbs. In view of the",
                " above, it makes sense that that limb",
                " be surgically removed. In a similar way",
                " a righteous father may be told that",
                " his corrupt son is not a part",
                " of his family. The biological fact of",
                " his being the son of his father",
                " is not being negated here. Rather, it",
                " is being said that on a moral",
                " plane the son has nothing to do",
                " with his father's righteous household.",
                "It is",
                " also pertinent to remember the context in",
                " which the present pronouncement was made. A",
                " judgement was needed in the encounter between",
                " faith and unbelief so as to determine",
                " who had faith and who was devoid",
                " of it. The righteous were to be",
                " saved and the evil were to be",
                " destroyed. The pronouncement was not intended to",
                " suggest that those of a certain stock",
                " would be saved while others would be",
                " destroyed.",
                "By mentioning Noah's son as 'one",
                " of unrighteous conduct', the Qur'an draws our",
                " attention to another significant fact. A worldly",
                " person brings up his children and holds",
                " them dear for the simple reason that",
                " they happen to be his offspring regardless",
                " of their conduct. However, for a believer,",
                " the main consideration is how his children",
                " actually behave. A believer's view of his",
                " children is governed by the conception that",
                " his children are God's trust placed in",
                " his care such that he may bring",
                " them up in a manner that allows",
                " them to pursue the end for which",
                " God has created man. It is possible,",
                " however, that in spite of their best",
                " efforts parents may not succeed in the",
                " proper upbringing of their children and that",
                " the latter, when they grow up, fail",
                " to obey their Lord. If this happens,",
                " parents should realize that all their efforts",
                " have been wasted and that there is",
                " no reason for them to hold such",
                " children dear to their hearts.",
                "The Qur'an",
                " is firm in its suggestion of such",
                " an attitude. It is obvious, therefore, that",
                " the same holds true for other relatives",
                " who are not as close as one's",
                " own children. For faith, as we know,",
                " is essentially an ideational and moral quality,",
                " and people are called believers or men",
                " of faith by dint of possessing that",
                " quality. It is man's faith which creates",
                " affinity between him and all other believers.",
                " The essential nexus of this relationship is",
                " thus ideational and moral. Those who happen",
                " to be a person's kin through blood",
                " ties are indeed relatives. If they do",
                " not share their faith, however, a believer",
                " will fulfil and be required to fulfil",
                " only the duties he owes to them",
                " on account of the accident of this",
                " blood relationship. This relationship, however, is bound",
                " to be devoid of the true cordiality",
                " and spiritual affinity which characterizes his relationship",
                " with believers. And should there be any",
                " conflict between belief and unbelief whereby a",
                " believer's relatives confront him, the believer is",
                " required to treat them exactly as any",
                " other unbeliever.",
                "*50). God's observation should not",
                " give even the slightest misunderstanding that Noah",
                " (peace be on him) in any way",
                " lacked the true spirit of faith or",
                " that his faith was, to any degree,",
                " tainted by Ignorance (Jahiliyah). What perhaps one",
                " ought to remember, in order to fully",
                " appreciate what is being said here is",
                " that even Prophets are human. As human",
                " beings, it is not always possible even",
                " for them to maintain the very high",
                " standards of excellence laid down for men",
                " of faith. At some psychologically-charged moment even",
                " Prophets, despite their extraordinary spiritual excellence and",
                " sublimity, become vulnerable albeit momentarily to human",
                " weaknesses. However, as soon as they realize",
                " or are made to realize by God",
                " that their conduct is falling short of",
                " the high standards required of them, they",
                " repent. Without the least hesitation or delay,",
                " they strive to mend their ways.",
                "In",
                " fact there cannot be any better proof",
                " of Noah's moral excellence than the present",
                " incident mentioned in the Qur'an. Just consider",
                " what had happened. Only a few moments",
                " previously Noah's son had drowned before his",
                " very eyes, something that would have simply",
                " shattered his father's whole being. At such",
                " an agonizing moment Noah (peace be on",
                " him) was reminded by God that his",
                " son had identified himself with falsehood rather",
                " than with truth. Noah (peace be on",
                " him) was told that this feeling that",
                " his son belonged to him merely because",
                " he was from his loins was a",
                " vestige jahiliyah. What is significant is that",
                " Noah (peace be on him) immediately re-oriented",
                " himself and fully adopted the attitude required",
                " of him by Islam, doing so despite",
                " the fact that the wound that he",
                " had sustained was fresh."
            ]
        },
        {
            "id": "[11:47]",
            "verse": "[Noah] said, \"My Lord, I seek refuge in You from asking that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.\"",
            "description": [
                "By relating the story of Noah's son,",
                " God has unequivocally and effectively made it",
                " clear that His justice is free from",
                " all biases, that His judgement is perfect",
                " and absolute. The Makkan unbelievers had entertained",
                " the illusion that God's wrath would not",
                " overtake them no matter how they behaved.",
                " They thought so because they happened to",
                " be the descendants of Abraham (peace be",
                " on him) and the devotees of a",
                " number of well-known gods and goddesses. In",
                " the past, Jews and Christians also entertained,",
                " as they still entertain, illusions of the",
                " same kind. In fact, there are also",
                " many deviant Muslims who place their reliance",
                " on false hopes. They believe that since",
                " they are descendants or devotees of some",
                " saints, the intercession of those saints will",
                " enable them to escape God's justice.",
                "However,",
                " the Qur'an portrays how one of the",
                " great Prophets helplessly watches his own flesh",
                " and blood drown. In a state of",
                " severe emotional agitation, he piteously implores God",
                " to forgive his son. In response, God",
                " rebukes him. Thus, we see that even",
                " a person of a Prophet's ranking failed",
                " to salvage an iniquitous son."
            ]
        },
        {
            "id": "[11:48]",
            "verse": "It was said, \"O Noah, disembark in security from Us and blessings upon you and upon nations [descending] from those with you. But other nations [of them] We will grant enjoyment; then there will touch them from Us a painful punishment.\"",
            "description": [
                "Noah (peace be on him) was directed",
                " to disembark on the mountain on which",
                " the Ark had rested."
            ]
        },
        {
            "id": "[11:49]",
            "verse": "That is from the news of the unseen which We reveal to you, [O Muhammad]. You knew it not, neither you nor your people, before this. So be patient; indeed, the [best] outcome is for the righteous.",
            "description": [
                "The Prophet Muhammad (peace be on him)",
                " is consoled by the statement that in",
                " the same way that Noah (peace be",
                " on him) and his righteous people ultimately",
                " succeeded, so will he and his Companions.",
                " It is God's law that the opponents",
                " of the truth seem to achieve some",
                " measure of success in the beginning. But",
                " ultimate success is the lot of those",
                " who, out of their God-fearing, avoid all",
                " erroneous ways while seeking to serve the",
                " cause of the truth. The import of",
                " the story, therefore, is that the believers",
                " should not feel heart-broken by their ephemeral",
                " sufferings or the successes of their opponents.",
                " Instead, they should persevere, with courage and",
                " fortitude, in their struggle for the cause",
                " of the truth."
            ]
        },
        {
            "id": "[11:50]",
            "verse": "And to 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. You are not but inventors [of falsehood].",
            "description": [
                "For a detailed account see Towards Understanding",
                " the Qur'an, vol. III, al-A'raf 7, nn.",
                " 51-6, pp. 42-5.",
                "*55). Those whom the",
                " Makkan unbelievers associated with God in His",
                " divinity actually possessed none of the attributes",
                " and powers of God. There was, therefore,",
                " no grounds whatsoever for anyone to worship",
                " them. Some people had mistakenly taken them",
                " as their deities, and looked to those",
                " deities to answer their prayers and fulfil",
                " their needs."
            ]
        },
        {
            "id": "[11:51]",
            "verse": "O my people, I do not ask you for it any reward. My reward is only from the one who created me. Then will you not reason?",
            "description": [
                "This is a very eloquent statement which",
                " also embodies a very weighty argument. The",
                " Makkan unbelievers had summarily rejected the Prophet's",
                " Message without even seriously considering it. This",
                " was indicative of the fact that they",
                " did not use their brains. For, had",
                " they used them, they would certainly have",
                " been impressed by the veracity of the",
                " Prophet (peace be on him) and the",
                " truth of his teachings. For here was",
                " someone who had gone through immense suffering",
                " in the course of his calling his",
                " people to the truth and in sincerely",
                " counselling and admonishing them. Again, it was",
                " quite evident from all the Prophet's activities",
                " that there was no intention of seeking",
                " any benefit for himself or his family.",
                " The conclusion was very clear. Such a",
                " person must have had a very strong",
                " reason to be totally convinced about the",
                " truth of his faith. For it is",
                " in the cause of his faith that",
                " he had renounced all his ease and",
                " comfort, eschewed the ambitions of material prosperity,",
                " and ventured to undertake the perilous task",
                " of challenging the beliefs, customs and ways",
                " of life which were so deeply rooted",
                " in the history of his people. Such",
                " an undertaking naturally exposed him both to",
                " the hostility of his own people and",
                " to many others. It is obvious that",
                " the teaching of such a person could",
                " not have been so flimsy and trivial",
                " as to be casually cast aside without",
                " giving it even a serious thought."
            ]
        },
        {
            "id": "[11:52]",
            "verse": "And O my people, ask forgiveness of your Lord and then repent to Him. He will send [rain from] the sky upon you in showers and increase you in strength [added] to your strength. And do not turn away, [being] criminals.\"",
            "description": [
                "This is a reiteration of what was",
                " said earlier, 'that you may seek forgiveness",
                " of your Lord and turn to Him",
                " in repentance whereupon He will grant you",
                " a fair enjoyment of life until an",
                " appointed term'. (See verse 3 above.) We",
                " learn from this that the rise and",
                " fall of a nation's fortunes depends on",
                " moral factors. For God's rule over the",
                " world is based on moral rather than",
                " physical laws which are bereft of all",
                " distinction between good and evil. The Qur'an",
                " has repeatedly mentioned that when a nation",
                " receives God's Message through a Prophet, the",
                " fate of that nation depends entirely on",
                " how it responds to it. If that",
                " nation accepts the Message, God lavishes His",
                " bounties and blessings upon it. However, if",
                " that nation spurns the Message, it is",
                " destroyed.",
                "This is a provision of the",
                " moral law according to which God deals",
                " with human beings. Another provision of this",
                " law is that any nation which, deluded",
                " by its worldly prosperity, has recourse to",
                " wrong-doing and sin, is doomed to destruction.",
                " However, if the people in question while",
                " proceeding speedily towards their tragic end, realize",
                " their mistake, give up their disobedience of",
                " God and sincerely return to His worship",
                " and service, their evil end is averted",
                " and their term is extended. Not only",
                " that but they are also judged to",
                " be deserving of reward instead of punishment,",
                " and God even ordains that they may",
                " attain well-being and ascendancy."
            ]
        },
        {
            "id": "[11:53]",
            "verse": "They said, \"O Hud, you have not brought us clear evidence, and we are not ones to leave our gods on your say-so. Nor are we believers in you.",
            "description": [
                "The unbelievers contended that Hud (peace be",
                " on him) had no clear evidence to",
                " prove that it is God Who had",
                " designated him to communicate a message, and",
                " that his teachings were true."
            ]
        },
        {
            "id": "[11:54]",
            "verse": "We only say that some of our gods have possessed you with evil.\" He said, \"Indeed, I call Allah to witness, and witness [yourselves] that I am free from whatever you associate with Allah",
            "description": [
                "The unbelievers presumably thought that because of",
                " his sacrilegious behaviour towards some saint or",
                " deity, Prophet Hud (peace be on him)",
                " had been smitten with madness. Consequently, both",
                " words of abuse and stones were hurled",
                " at him even though he had once",
                " enjoyed much esteem and respect.",
                "*60). In",
                " response to this. Hud (peace be on",
                " him) pointed out that it was true",
                " that he had not put forth specific",
                " evidence in support of his claim. He",
                " contended that rather than bring a set",
                " of minor evidence in support of his",
                " claim, he had instead brought the weightiest",
                " evidence of all - Almighty God Himself.",
                " For God and His entire universe bear",
                " witness to the truths he enunciated. The",
                " same evidence also established that the conceptions",
                " entertained by the unbelievers were pure concoctions",
                " and lacked even an atom's worth of",
                " truth.",
                "*61). The unbelievers were adamant. They",
                " would not forsake their deities just because",
                " Hud asked them to do so. In",
                " response, Prophet Hud (peace be on him)",
                " made it vehemently clear to them that",
                " he could not care less for their",
                " deities."
            ]
        },
        {
            "id": "[11:55]",
            "verse": "Other than Him. So plot against me all together; then do not give me respite.",
            "description": [
                "This is in answer to the unbelievers'",
                " contention that Hud was suffering because he",
                " had invited the wrath of their deities",
                " upon himself. (Cf. Yunus 10, n. 71.)",
                ""
            ]
        },
        {
            "id": "[11:56]",
            "verse": "Indeed, I have relied upon Allah, my Lord and your Lord. There is no creature but that He holds its forelock. Indeed, my Lord is on a path [that is] straight.\"",
            "description": [
                "Whatever God does is absolutely right. All",
                " His actions are rightly- directed and sound.",
                " None of His actions are arbitrary. He",
                " governs the universe, and metes out full",
                " justice to all. It is, thus, impossible",
                " for someone to follow erroneous doctrines, and",
                " to engage in evil-doing and still attain",
                " salvation. Nor is it possible that someone",
                " who is truthful and righteous will end",
                " up a loser."
            ]
        },
        {
            "id": "[11:57]",
            "verse": "But if they turn away, [say], \"I have already conveyed that with which I was sent to you. My Lord will give succession to a people other than you, and you will not harm Him at all. Indeed my Lord is, over all things, Guardian.\"",
            "description": [
                "This is a rejoinder to the unbelievers'",
                " statement that they would in no way",
                " forsake their deities and believe in the",
                " teachings of Hud."
            ]
        },
        {
            "id": "[11:58]",
            "verse": "And when Our command came, We saved Hud and those who believed with him, by mercy from Us; and We saved them from a harsh punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:59]",
            "verse": "And that was 'Aad, who rejected the signs of their Lord and disobeyed His messengers and followed the order of every obstinate tyrant.",
            "description": [
                "It is true that only one Messenger",
                " (viz. Hud) had come to them. However,",
                " his teachings were the same as those",
                " of all the other Messengers who had",
                " been raised among different nations and at",
                " different times. Hence their rejection of Hud's",
                " message is referred to here as a",
                " rejection of all Messengers."
            ]
        },
        {
            "id": "[11:60]",
            "verse": "And they were [therefore] followed in this world with a curse and [as well] on the Day of Resurrection. Unquestionably, 'Aad denied their Lord; then away with 'Aad, the people of Hud.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:61]",
            "verse": "And to Thamud [We sent] their brother Salih. He said, \"O my people, worship Allah; you have no deity other than Him. He has produced you from the earth and settled you in it, so ask forgiveness of Him and then repent to Him. Indeed, my Lord is near and responsive.\"",
            "description": [
                "For further information see Towards Understanding the",
                " Qur'an, vol. Ill, al-A'raf, nn. 57-62, pp.",
                " 45-8.",
                "*67). This substantiates the fact that",
                " there is no god other than the",
                " One True God; and that He should",
                " be the sole object of worship and",
                " service. Now, even those who associated others",
                " with God in His divinity acknowledged that",
                " it is Allah alone Who created them.",
                " Using this obvious premise, Prophet Salih (peace",
                " be on him) sought to persuade people",
                " to affirm that God alone should be",
                " worshipped. He emphasized that it is God",
                " alone Who had made them into human",
                " beings out of the lifeless materials from",
                " the earth, and had subsequently settled them",
                " on earth. In view of this, who",
                " else than God could claim godhead? Likewise,",
                " who else could claim that he ought",
                " to be served and worshipped?",
                "*68). The",
                " Thamud had been guilty of worshipping others",
                " besides God. They are now urged to",
                " seek God's forgiveness for this grave sin.",
                "",
                "*69). This verse is aimed at removing",
                " a major misconception which had been prevalent",
                " among the polytheists. This misconception is in",
                " fact one of the major reasons which",
                " prompted men to associate others with God",
                " in His divinity. One of man's most",
                " persistent faults is that he has conceived",
                " God to be similar to those worldly",
                " rulers who immerse themselves in a life",
                " of ease and luxury in their grand",
                " palaces. Such rulers are normally far removed",
                " from their subjects. To all intents and",
                " purposes they are well beyond the direct",
                " access of their subjects. The only way",
                " for their subjects to reach them is",
                " through the auspices of their favourite courtiers.",
                " And even if a subject succeeds in",
                " conveying his pleadings through a courtier, these",
                " rulers are often too arrogant to directly",
                " respond to such pleadings. This is one",
                " aspect of the function of a courtier",
                " - to communicate to a ruler the",
                " pleadings of his subjects, and also to",
                " communicate to the subjects the response of",
                " the ruler.",
                "Since God was often conceived",
                " in the image of such worldly rulers",
                " many people fell prey to the false",
                " belief that God is well above the",
                " reach of ordinary human beings. This belief",
                " spread further because many clever people found",
                " it quite profitable to propagate such a",
                " notion. No wonder many people felt God",
                " could only be approached through powerful intermediaries",
                " and intercessors. The only way that a",
                " person's prayer could reach God and be",
                " answered by Him was to approach Him",
                " through one of the holy men. It",
                " was, therefore, considered necessary to grease the",
                " palm of the religious functionaries who supposedly",
                " enjoyed the privilege of conveying a man's",
                " offerings and prayers to the One on",
                " high. This misconception gave birth to a",
                " pantheon of small and large deities and",
                " intercessors who are supposed to act as",
                " intermediaries between man and God. This misconception",
                " has given rise to institutionalized priesthood, according",
                " to which no ritual, whether relating to",
                " birth or death, can be performed without",
                " the active participation of the priests.",
                "Prophet",
                " Salih (peace be on him) strikes at",
                " the root of this ignorant system, and",
                " totally demolishes its intellectual infrastructure. This he",
                " does by emphasizing two facts: that God",
                " is extremely close to His creatures and",
                " that He answers their prayers. Thus he",
                " refutes many misconceptions about God: that He",
                " is far away, altogether withdrawn from human",
                " beings, and that He does not answer",
                " their prayers if they are to directly",
                " approach Him. God, no doubt, is transcendent,",
                " and yet He is extremely close to",
                " every person. Everyone will find Him just",
                " beside himself. Everyone can whisper to Him",
                " the innermost desires of his heart. Everyone",
                " can address his prayers to God both",
                " in public and in private, by verbally",
                " expressing those prayers or addressing them to",
                " Him without so much as uttering a",
                " single word. Moreover, God answers the prayers",
                " of all His creatures directly. The fact",
                " is that God's court with all its",
                " majesty is just around everyone's corner, so",
                " close to one's threshold, and always open",
                " to all. How silly it is, therefore,",
                " for people to search for those intercessors",
                " who they think will help them approach",
                " God, (See also Towards Understanding the Qur'an,",
                " vol. I, al-Baqarah 2, n. 188.)"
            ]
        },
        {
            "id": "[11:62]",
            "verse": "They said, \"O Salih, you were among us a man of promise before this. Do you forbid us to worship what our fathers worshipped? And indeed we are, about that to which you invite us, in disquieting doubt.\"",
            "description": [
                "The people of Salih (peace be on",
                " him) centred many expectations around him. On",
                " account of his wisdom, intelligence, maturity, and",
                " dignified personality they expected Salih to rise",
                " to great heights. They also believed that",
                " he would not only achieve personal greatness",
                " and prosperity, but would also assist his",
                " people in their bid to excel against",
                " other tribes and nations in terms of",
                " worldly benefits. However, no sooner had Salih",
                " begun to teach his people that they",
                " are obligated to exclusively worship and serve",
                " the One True God and pay due",
                " heed to the Hereafter than they became",
                " altogether disenchanted with him.",
                "It may be",
                " recalled that the predicament of the Makkan",
                " unbelievers was no different from that of",
                " the people of Salih (peace be on",
                " him). The Makkans also recognized that Muhammad",
                " (peace be on him) was a person",
                " of outstanding qualities. They were confident that",
                " he would grow into a very successful",
                " merchant and that they would also benefit",
                " from his trading acumen. But then they",
                " found that the Prophet (peace be on",
                " him), contrary to their expectations, began to",
                " invite them to serve and worship the",
                " One True God. He also began to",
                " urge (hem to pay heed to the",
                " Next Life and to observe moral excellence.",
                " They were instantly disappointed and became totally",
                " averse to him. They even began to",
                " give vent to the idea that the",
                " Prophet (peace be on him) who for",
                " so long had been a perfectly normal",
                " person, was now seized by some strange",
                " mental disease. In their view it was",
                " because of this mental derailment that he",
                " had ruined his own life and also",
                " threw cold water on the hopes and",
                " expectations of his people.",
                "*71). This was",
                " the main reason which the unbelievers advanced",
                " to support their view, the rationale they",
                " offered for the worship of the deities",
                " in which they believed. The simple reason",
                " was, as stated here and elsewhere in",
                " the Qur'an, that their ancestors had also",
                " worshipped them! This brings into sharp relief",
                " the fundamental difference between the rationale offered",
                " by Islam and that offered by jahiliyah.",
                " Salih (peace be on him) had said",
                " that none but God deserves to be",
                " worshipped. He argued that since God had",
                " created human beings and had enabled them",
                " to settle on earth, they, therefore, ought",
                " to worship Him. The unbelievers responded by",
                " saying that their deities also deserved to",
                " be worshipped, indeed had been worshipped by",
                " their ancestors and so they could not",
                " just forsake them. In other words, they",
                " proclaimed their commitment to follow in the",
                " footsteps of their ancestors even if those",
                " ancestors had been altogether ignorant and stupid.",
                "",
                "*72). The Qur'an does not specify the",
                " 'disquieting doubt' to which the unbelievers were",
                " subjected. The reason for this is that",
                " although all of them had doubts, the",
                " doubt entertained by each was different. It",
                " may even be said that whenever people",
                " are asked to accept the truth, all",
                " those who believe in one kind of",
                " falsehood or the other feel disturbed. The",
                " complacent faith which they had before they",
                " became acquainted with the truth is simply",
                " gone, and a 'disquieting doubt' creeps in",
                " and begins to agitate them. Although each",
                " of them may feel this differently, an",
                " amount of disquiet is nevertheless common to",
                " all unbelievers.",
                "Before the unbelievers were invited",
                " to the truth, they may never have",
                " felt the need to critically examine their",
                " position. But after the call to the",
                " truth has been made such an attitude",
                " can no longer persist. This is so",
                " because the trenchant criticism of jahiliyah made",
                " by the Prophet of the day together",
                " with his weighty arguments in support of",
                " his teachings is bound to have its",
                " effect. Moreover, his lofty morals, his firmness,",
                " his forbearance, his grace and dignity, his",
                " straightforward and honest ways, and his wisdom",
                " and sagacity create a certain respect for",
                " him even among his staunchest enemies. Not",
                " only that but the people concerned cannot",
                " help but notice that the best elements",
                " in the society of the day are",
                " continually drawn to the call of the",
                " truth. They also observe that as a",
                " result of embracing the truth the lives",
                " of these people are perceptibly transformed. Taken",
                " together, all these factors agitate the minds",
                " of those who wish to cling to",
                " and even promote the old jahiliyah even",
                " after the truth has been made known",
                " to them."
            ]
        },
        {
            "id": "[11:63]",
            "verse": "He said, \"O my people, have you considered: if I should be upon clear evidence from my Lord and He has given me mercy from Himself, who would protect me from Allah if I disobeyed Him? So you would not increase me except in loss.",
            "description": [
                "Prophet Salih (peace be on him) makes",
                " it clear to his people that if",
                " he were to follow the advice which",
                " they offered him, it would virtually lead",
                " to his perdition. Were Salih (peace be",
                " on him) to act contrary to his",
                " conscience and in opposition to the knowledge",
                " and guidance intimated to him by God,",
                " he would be liable to God's punishment,",
                " and his people would be helpless in",
                " their efforts to rescue him from that",
                " punishment. Moreover, Salih (peace be on him)",
                " was not an ordinary person but a",
                " Prophet. This made his dereliction in the",
                " sight of God even more grave. For,",
                " God would take him to task on",
                " the grounds that although he had been",
                " encumbered with the duty to direct his",
                " people to the right way, he had",
                " consciously led them to error."
            ]
        },
        {
            "id": "[11:64]",
            "verse": "And O my people, this is the she-camel of Allah - [she is] to you a sign. So let her feed upon Allah 's earth and do not touch her with harm, or you will be taken by an impending punishment.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:65]",
            "verse": "But they hamstrung her, so he said, \"Enjoy yourselves in your homes for three days. That is a promise not to be denied.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:66]",
            "verse": "So when Our command came, We saved Salih and those who believed with him, by mercy from Us, and [saved them] from the disgrace of that day. Indeed, it is your Lord who is the Powerful, the Exalted in Might.",
            "description": [
                "The folk traditions of the Sinaitic Peninsula",
                " indicate that when a severe punishment afflicted",
                " the Thamud, Salih (peace be on him)",
                " migrated to Sinai. Hence, close to the",
                " Mount of Moses there is a hillock",
                " called Nabi Salih. These traditions make one",
                " believe that it is here that Prophet",
                " Salih (peace be on him) lived."
            ]
        },
        {
            "id": "[11:67]",
            "verse": "And the shriek seized those who had wronged, and they became within their homes [corpses] fallen prone",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:68]",
            "verse": "As if they had never prospered therein. Unquestionably, Thamud denied their Lord; then, away with Thamud.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:69]",
            "verse": "And certainly did Our messengers come to Abraham with good tidings; they said, \"Peace.\" He said, \"Peace,\" and did not delay in bringing [them] a roasted calf.",
            "description": [
                "This shows that the angels visited Prophet",
                " Abraham (peace be on him) in human",
                " form and that initially they did not",
                " disclose their identity. Prophet Abraham (peace be",
                " on him), therefore, thought that they were",
                " strangers, and immediately arranged a good meal",
                " for them."
            ]
        },
        {
            "id": "[11:70]",
            "verse": "But when he saw their hands not reaching for it, he distrusted them and felt from them apprehension. They said, \"Fear not. We have been sent to the people of Lot.\"",
            "description": [
                "Some commentators on the Qur'an are of",
                " the view that when the guests hesitated",
                " to take food Prophet Abraham (peace be",
                " on him) felt suspicious about their intentions.",
                " He even became apprehensive that they had",
                " come with some hostile design. For, in",
                " Arabia when someone declines the food offered",
                " to him by way of hospitality, this",
                " gives rise to the fear that he",
                " has not come as a guest but",
                " rather with subversive purposes. The very next",
                " verse, however, does not lend any support",
                " to this view.",
                "*77). The words as",
                " well as the tone of the verse",
                " suggest that as soon as Abraham (peace",
                " be on him) noticed that his guests",
                " were disinclined to eat, he realized that",
                " they were angels. Since angels appear in",
                " human form only in very exceptional circumstances,",
                " what terrified Abraham (peace be on him)",
                " was the possibility that the angels may",
                " have been sent to inflict punishment on",
                " account of any lapses that he himself,",
                " his family, or his people may have",
                " committed. Had Abraham (peace be on him)",
                " not been sure about the identity of",
                " his guests - as some Qur'an-commentators believe",
                " - they would have said: 'Do not",
                " fear, we are angels sent by your",
                " Lord.' However, they did not say so.",
                " They rather tried to allay Abraham's fears",
                " by saying: 'Do not be afraid, we",
                " have been sent to the people of",
                " Lot.' It is, thus, clear that Abraham",
                " had become aware of their true identity.",
                " What caused Abraham (peace be on him)",
                " to worry was the idea that the",
                " angels had been sent to his people,",
                " that his people were about to suffer",
                " a severe chastisement. However, he was soon",
                " to feel relieved that the angels had",
                " been sent to the people of Lot",
                " rather than to his own. So there",
                " was no reason to fear that his",
                " own people would soon suffer destruction."
            ]
        },
        {
            "id": "[11:71]",
            "verse": "And his Wife was standing, and she smiled. Then We gave her good tidings of Isaac and after Isaac, Jacob.",
            "description": [
                "According to this verse, the whole of",
                " Abraham's family was worried about the visit",
                " of the angels in human form. From",
                " sheer anxiety Abraham's wife also came out.",
                " However, when she came to know that",
                " the coming of the angels did not",
                " forebode any evil, she was reassured and",
                " became joyful.",
                "*79). The angels gave the",
                " glad tidings of the birth of Isaac",
                " to Sarah rather than to Abraham. For",
                " Abraham (peace be on him) already had",
                " a son called Ishmael, born of his",
                " first wife Hagar. At that time Sarah",
                " was without any issue, and for this",
                " reason she felt sad. When the angels",
                " gave her the glad tidings they foretold",
                " her not only of the birth of",
                " Isaac, but also of her grandson, Jacob.",
                " It is needless to say, perhaps, that",
                " both of them - Isaac and Jacob",
                " - became Messengers of great standing."
            ]
        },
        {
            "id": "[11:72]",
            "verse": "She said, \"Woe to me! Shall I give birth while I am an old woman and this, my husband, is an old man? Indeed, this is an amazing thing!\"",
            "description": [
                "This expression does not, in any way,",
                " suggest that Sarah, instead of feeling happy,",
                " considered this prediction the foreboding of a",
                " calamity. In point of fact the expression",
                " is an exclamation to which women, in",
                " particular, resort to in a state of",
                " wonder and amazement. Thus, what is intended",
                " is not what the",
                "*81). According to",
                " the Bible, Abraham was one hundred years",
                " and Sarah ninety years old at that",
                " time."
            ]
        },
        {
            "id": "[11:73]",
            "verse": "They said, \"Are you amazed at the decree of Allah? May the mercy of Allah and His blessings be upon you, people of the house. Indeed, He is Praiseworthy and Honorable.\"",
            "description": [
                "Ordinarily, it is uncommon for women to",
                " bear children at such an advanced age.",
                " However, such a thing is not at",
                " all beyond the range of God's power.",
                " And since the tiding had been conveyed",
                " at the instance of God, there was",
                " no reason why a staunch believer such",
                " as Sarah should feel astonished, let alone",
                " entertain any doubts about it."
            ]
        },
        {
            "id": "[11:74]",
            "verse": "And when the fright had left Abraham and the good tidings had reached him, he began to argue with Us concerning the people of Lot.",
            "description": [
                "The word 'dispute' here expresses the nexus",
                " of affection and endearment between Abraham (peace",
                " be on him) and God. Perusal of",
                " this verse brings to one's mind Abraham's",
                " persistent pleading to God that He may",
                " spare Lot's people His chastisement. To this",
                " God replied that since they were totally",
                " devoid of all good and had exceeded",
                " all reasonable limits, they did not deserve",
                " any leniency. Yet Abraham (peace be on",
                " him) continued to plead for them and",
                " presumably submitted that if there was even",
                " the least bit of good left in",
                " them, their chastisement be deferred so that",
                " this good may come to the fore.",
                "",
                "It is interesting to note that the",
                " Bible also recounts this 'dispute' between God",
                " and Abraham. However, the Qur'anic account, though",
                " brief, is much more meaningful, and significant.",
                " (Cf. Genesis 18: 23-32.)"
            ]
        },
        {
            "id": "[11:75]",
            "verse": "Indeed, Abraham was forbearing, grieving and [frequently] returning [to Allah].",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:76]",
            "verse": "[The angels said], \"O Abraham, give up this [plea]. Indeed, the command of your Lord has come, and indeed, there will reach them a punishment that cannot be repelled.\"",
            "description": [
                "The mention of Abraham's story as a",
                " preamble to the story of the people",
                " of Lot may appear somewhat out of",
                " tune with the purpose for which the",
                " events of the past are being narrated",
                " here. However, to better appreciate this, two",
                " things should be borne in mind. Firstly,",
                " that the immediate addressees of She Qur'an",
                " were the Quraysh. The Quraysh, since they",
                " were the descendants of Abraham (peace be",
                " on him), were the custodians of the",
                " Ka'bah - the shrine of God. For",
                " the same reason, they also had a",
                " predominant influence over the religious, moral, cultural",
                " and political life of Arabia. The Quraysh",
                " believed that since they were the offspring",
                " of a Prophet who enjoyed God's favour,",
                " they would never be punished by God.",
                " They felt sure that Abraham (peace be",
                " on him) would intercede effectively with God",
                " on their behalf.",
                "The Qur'an strikes a",
                " powerful blow to the Makkans' misconceptions. They",
                " are told, in the first instance, the",
                " story of the Prophet Noah (peace be",
                " on him) in graphic detail: how he",
                " watched his own son drown and how",
                " he distressfully prayed to God to show",
                " mercy to him. And yet, as we",
                " know, Noah's prayer was to no avail.",
                " Not only was Noah's prayer not granted,",
                " he was even rebuked for praying on",
                " behalf of his unrighteous son.",
                "Noah's story",
                " is followed by a narration of Abraham's",
                " story. Abraham (peace be on him) enjoys,",
                " on the one hand, the innumerable blessings",
                " of God. He is also addressed by",
                " God in terms which are clearly indicative",
                " of God's special love and affection for",
                " him. On the other hand, when Abraham",
                " interferes in a manner that amounted to",
                " compromising justice with regard to an evil-doing",
                " nation, God sets his intercession aside.",
                "The",
                " second thing that ought to be borne",
                " in mind is that the present discourse",
                " emphasizes to the Quraysh that God's law",
                " of retribution has always been operative in",
                " history. The Quraysh had become altogether oblivious",
                " of that law and were no longer",
                " afraid of it. The Qur'an, therefore, drew",
                " their attention to its constant manifestation in",
                " human history, including the traces of its",
                " operation in their immediate surroundings.",
                "Their attention",
                " was also drawn to Abraham (peace be",
                " on him) who had migrated for the",
                " sake of the truth and had settled",
                " down in an alien land. Apparently, he",
                " had no power or resources at his",
                " disposal. Nonetheless, God rewarded him for his",
                " righteousness. He also caused Abraham's wife to",
                " deliver a child when she had reached",
                " the age of barrenness and when Abraham",
                " himself had also reached an advanced age.",
                " This child was Isaac (peace be on",
                " him) who was to become the father",
                " of another Prophet, Jacob (peace be on",
                " them). The progeny of Isaac and Jacob",
                " are known as the Children of Israel.",
                " They were indeed a great people who",
                " retained, for centuries, their ascendancy in the",
                " region - Palestine and Syria - where",
                " Abraham (peace be on him) had first",
                " set his foot as an uprooted, homeless",
                " refugee.",
                "Distinguishable from the Israelites were the",
                " people of Lot. They remained immersed in",
                " their evil deeds and continued to bask",
                " in the warmth of their prosperity. They",
                " had no idea at all that on",
                " account of this iniquity they would be",
                " overtaken by God's punishment in the near",
                " future. Hence, whenever the Prophet Lot (peace",
                " be on him) attempted to admonish them,",
                " they scornfully brushed his counsel aside. However,",
                " the same day on which it was",
                " decided to exalt the progeny of Abraham",
                " (peace be on him) into a very",
                " outstanding nation, it was also decided to",
                " annihilate the people of Lot who had",
                " become exceedingly wicked. So thorough was the",
                " destruction to which they were subjected that",
                " to-day there exists no trace of their",
                " habitation."
            ]
        },
        {
            "id": "[11:77]",
            "verse": "And when Our messengers, [the angels], came to Lot, he was anguished for them and felt for them great discomfort and said, \"This is a trying day.\"",
            "description": [
                "For details see Towards Understanding the Qur'an,",
                " vol. Ill, al-A'raf, nn. 63-8, pp. 49-53",
                " - Ed.",
                "*86). What seems to be",
                " evident from the story as related in",
                " the Qur'an is that the angels had",
                " come to Lot (peace be on him)",
                " in the form of handsome young boys.",
                " It also seems that Lot (peace be",
                " on him) was unaware that they were",
                " angels. He also felt quite disturbed, therefore,",
                " at the sight of the visiting young",
                " boys. His reaction was natural in view",
                " of the known degeneration and unabashed perversity",
                " prevalent among his people."
            ]
        },
        {
            "id": "[11:78]",
            "verse": "And his people came hastening to him, and before [this] they had been doing evil deeds. He said, \"O my people, these are my daughters; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not among you a man of reason?\"",
            "description": [
                "It is possible that Lot (peace be",
                " on him) used the word 'daughters' to",
                " refer to the totality of females in",
                " his nation as such. For a Messenger",
                " is indeed like a father to his",
                " people, and all the females of that",
                " nation are to him like his own",
                " daughters. It is also possible that when",
                " Lot used the word 'daughters' he meant",
                " his own daughters. Whatever is the correct",
                " interpretation, one should not misunderstand the statement",
                " and think it an invitation for Lot's",
                " people to indulge in illegitimate sex. For",
                " the very next part of his remark,",
                " viz. 'they are purer for you', excludes",
                " all justification for such a misunderstanding. The",
                " whole thrust of Lot's statement was that",
                " if they wished to satisfy their sex-urge,",
                " they should do so in the natural",
                " and legitimate manner as laid down by",
                " God. Lot (peace be on him) wished",
                " to underscore the fact that the natural",
                " and legitimate means of sexual satisfaction were",
                " readily available as there was no dearth",
                " of women in their society."
            ]
        },
        {
            "id": "[11:79]",
            "verse": "They said, \"You have already known that we have not concerning your daughters any claim, and indeed, you know what we want.\"",
            "description": [
                "This Qur'anic statement vividly portrays the moral",
                " degradation and perversity of those people. They",
                " had brazenly deviated from the natural way",
                " of satisfying their sexual desires and had",
                " adopted instead an altogether perverse and filthy",
                " way. What was even more heinous was",
                " that their interest had become confined only",
                " to those perverse forms of sexual gratification",
                " which had come into vogue in their",
                " society. This perversity had reached such a",
                " point where they felt no shame in",
                " stating that they were not interested at",
                " all in what was universally held to",
                " be the natural and legitimate way of",
                " sexual satisfaction.",
                "This is the lowest conceivable",
                " depth of moral degeneration and perversity. Such",
                " a case is very different from that",
                " of a person who might commit a",
                " sin in a moment of weakness when",
                " he is overwhelmed by his passions, but",
                " has not ceased to distinguish good from",
                " evil. For it is quite possible for",
                " such a person to mend his ways.",
                "",
                "But even if he does not mend",
                " his ways, he may, at the most,",
                " be considered a man who has lapsed",
                " into evil ways. But a person who",
                " becomes so thoroughly perverse that his interest",
                " is confined only to what is forbidden",
                " and sinful, and who believes that all",
                " that is right and permissible is simply",
                " not meant for him, is altogether a",
                " different situation. Such a person is not",
                " only wicked, but has sunk so low",
                " that he cannot be truly considered a",
                " human being. Such a person is a",
                " worm that thrives only on filth and",
                " finds all that is clean and pure",
                " totally disagreeable. Were such a worm to",
                " be found in the house of someone",
                " who loves cleanliness, he would use insecticide",
                " to get rid of it at the",
                " first available opportunity! Such being the case,",
                " how is it conceivable that God, the",
                " Lord of this universe, can allow such",
                " worms to concentrate and become strong at",
                " any given place or time?"
            ]
        },
        {
            "id": "[11:80]",
            "verse": "He said, \"If only I had against you some power or could take refuge in a strong support.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:81]",
            "verse": "The angels said, \"O Lot, indeed we are messengers of your Lord; [therefore], they will never reach you. So set out with your family during a portion of the night and let not any among you look back - except your wife; indeed, she will be struck by that which strikes them. Indeed, their appointment is [for] the morning. Is not the morning near?\"",
            "description": [
                "The warning implied in directing Lot (peace",
                " be on him) and his household to",
                " depart at their earliest was loud and",
                " clear. They were told not to tarry",
                " behind in the region which had been",
                " marked for total destruction.",
                "*90). This is",
                " the third instructive event related in this",
                " surah. The purpose of relating it is",
                " to underscore the fact that family connections",
                " with, and the intercession of, people of",
                " high spiritual standing can be of no",
                " avail in rescuing a people from the",
                " punishment they invite upon themselves by their",
                " evil deeds."
            ]
        },
        {
            "id": "[11:82]",
            "verse": "So when Our command came, We made the highest part [of the city] its lowest and rained upon them stones of layered hard clay, [which were]",
            "description": [
                "This scourge probably took the form of",
                " a severe earthquake combined with volcanic eruptions.",
                " The earthquake turned their dwellings upside down",
                " and by means of a volcanic eruption",
                " they were subjected to a severe rain",
                " of stones. The expression 'stones of baked",
                " clay' perhaps refers to the stones formed",
                " by the underground heat and lava in",
                " volcanic regions. The signs of this volcanic",
                " eruption can be noticed almost everywhere in",
                " the region south and east of the",
                " Dead Sea even today."
            ]
        },
        {
            "id": "[11:83]",
            "verse": "Marked from your Lord. And Allah 's punishment is not from the wrongdoers [very] far.",
            "description": [
                "This implies that each stone had been",
                " earmarked for a specific act of destruction.",
                "",
                "*93). The moral of the story is",
                " that those who engage in acts of",
                " transgression should not delude themselves into believing",
                " that they are safe from God's punishment.",
                " For, if the people of Prophet Lot",
                " (peace be on him) could be overtaken",
                " by a severe chastisement, so can they.",
                " For none can overwhelm God or frustrate",
                " His plan: neither the people of Lot",
                " nor any other."
            ]
        },
        {
            "id": "[11:84]",
            "verse": "And to Madyan [We sent] their brother Shu'ayb. He said, \"O my people, worship Allah; you have no deity other than Him. And do not decrease from the measure and the scale. Indeed, I see you in prosperity, but indeed, I fear for you the punishment of an all-encompassing Day.",
            "description": [
                "For details see Towards Understanding the Qur'an,",
                " vol. Ill, al-A'raf, nn. 69-75, pp. 53-7.",
                ""
            ]
        },
        {
            "id": "[11:85]",
            "verse": "And O my people, give full measure and weight in justice and do not deprive the people of their due and do not commit abuse on the earth, spreading corruption.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:86]",
            "verse": "What remains [lawful] from Allah is best for you, if you would be believers. But I am not a guardian over you.\"",
            "description": [
                "Shu'ayb (peace be on him) made it",
                " clear to his people that he had",
                " no power to compel them to adopt",
                " one kind of behaviour or another. His",
                " task was merely that of a sincere",
                " adviser. All he could do was to",
                " admonish and warn them. It was up",
                " to them either to pay heed to",
                " that advice or to disregard it. What",
                " really mattered was that one day all",
                " human beings will be mustered by God",
                " to render an account of their deeds.",
                " It is this - the rendering of",
                " an account before God - that people",
                " should truly fear. It matters little whether",
                " they care for Shu'ayb or not. What",
                " really matters is whether they have any",
                " fear of standing before God's judgement. If",
                " they do fear this, it is essential",
                " that they give up the iniquity in",
                " which they are engrossed."
            ]
        },
        {
            "id": "[11:87]",
            "verse": "They said, \"O Shu'ayb, does your prayer command you that we should leave what our fathers worship or not do with our wealth what we please? Indeed, you are the forbearing, the discerning!\"",
            "description": [
                "This, in fact, is a taunting remark.",
                " Remarks which are expressive of the same",
                " spirit are heard today among every group",
                " of people who are heedless of God",
                " and who are engrossed in sin and",
                " evil. Prayer is obviously the first and",
                " the most obvious symbol of man's religious",
                " orientation. That orientation is not simply considered",
                " a dangerous disease, but the most dangerous",
                " one by irreligious people. Hence, Prayer is",
                " looked upon by these people as a",
                " manifestation of mental derailment rather than what",
                " it actually is - an act of",
                " worship. Irreligious people are also aware that",
                " those who become religiously committed are not",
                " content merely with self-reform. Such people are",
                " wont to go a step further and",
                " strive to reform others. Not only that,",
                " but it even becomes difficult for such",
                " people to refrain from criticizing attitudes opposed",
                " to religion and morality. Hence, irreligious people",
                " feel jittery because they fear that Prayer",
                " is not simply performed as a religious",
                " ritual but that it is the precursor",
                " of endless sermonizing on religion and morality.",
                " In addition, it may even lead to",
                " scathing criticisms of every aspect of social",
                " life. It is for this reason that",
                " Prayer is often singled out for every",
                " kind of taunt and reproach. Moreover, if",
                " those who observe Prayer criticize the evils",
                " rampant in their society and urge people",
                " to act righteously, this inspires opponents of",
                " religion to direct every possible invective against",
                " Prayer and to lash out at it",
                " as the source of every conceivable evil.",
                "",
                "*97). This is a full-blooded expression of",
                " the world-view of Ignorance (Jahiliyah) as distinguished",
                " from that of Islam. The Islamic view",
                " is that all worship except the worship",
                " of God is erroneous. It is erroneous",
                " because worshipping any other than the One",
                " True God is supported by nothing -",
                " neither reason, knowledge, nor revelation. Moreover, God",
                " should not only be worshipped in the",
                " limited sphere of life called 'religion'. God's",
                " worship should extend to all aspects of",
                " life - social, cultural, economic and political.",
                " For all that man has in the",
                " world belongs only to God. Man, therefore,",
                " has no right to consider any aspect",
                " of his life to be independent of",
                " God's guidance.",
                "The contrary of this is",
                " Jahiliyah. According to this view, man ought",
                " to observe the customs and usages he",
                " inherits from his ancestors, and he ought",
                " to do so merely because they come",
                " down from the past. This world-view considers",
                " religion to be confined to the domain",
                " of ritual; the ritual of worship. As",
                " for the ordinary affairs of worldly life,",
                " man ought to act as he pleases.",
                "",
                "It is thus quite clear that there",
                " is nothing so 'modern' about the tendency",
                " of driving a wedge between the religious",
                " and secular spheres of life. For some",
                " three and a half thousand years ago",
                " the nation of Shu'ayb was as emphatically",
                " insistent on bifurcating life into two water-tight",
                " compartments - the secular and the religious",
                " - as Westerners and their Eastern disciples",
                " of our time are wont to do.",
                " There seems little justification, therefore, to characterize",
                " the attitude of the present-day secularists as",
                " something altogether novel, as an attitude that",
                " has emerged in modern times as a",
                " result of the cumulative intellectual progress of",
                " mankind. Far from it, the new-fangled ideology",
                " which is being played up everywhere for",
                " its freshness and newness is, in fact,",
                " the same stale, old-fashioned obscurantism which characterized",
                " Jahiliyah several thousand years ago. Likewise, the",
                " Islamic defiance of, and opposition to, Jahiliyah",
                " is also a perennial reality of human",
                " history."
            ]
        },
        {
            "id": "[11:88]",
            "verse": "He said, \"O my people, have you considered: if I am upon clear evidence from my Lord and He has provided me with a good provision from Him...? And I do not intend to differ from you in that which I have forbidden you; I only intend reform as much as I am able. And my success is not but through Allah. Upon him I have relied, and to Him I return.",
            "description": [
                "'Provision' in this context has two connotations.",
                " It might signify, in the first place,",
                " the provision of knowledge of the truth",
                " communicated by God to someone. Secondly, it",
                " might also signify, as it commonly does,",
                " the provision of the means bestowed by",
                " God on His creatures in order that",
                " they may be able to live.",
                "Were",
                " we to understand this word in the",
                " first sense, the verse substantially repeats the",
                " same point that has been expressed earlier",
                " in this surah through the Prophets Muhammad,",
                " Noah and Salih (peace be on them).",
                " Common to their statements is their affirmation",
                " that they found the signs of the",
                " truth in their own beings and in",
                " the universe around them. Those signs were",
                " corroborated by direct knowledge of the truth",
                " intimated to them by God. (See verses",
                " 17,28 and 63 above - Ed.) Hence",
                " it was not possible for them to",
                " join their people in their errors of",
                " belief and in their acts of wickedness.",
                "",
                "However, if the word is taken in",
                " the latter sense, it amounts to a",
                " response to the sarcastic remark hurled at",
                " Shu'ayb: 'Do you fancy that you, and",
                " only you, are forbearing and right-directed?' (See",
                " verse 87 above.) It is noteworthy that",
                " the answer to this most bitter and",
                " caustic query is couched in exceedingly moderate",
                " and dispassionate words. The answer amounts to",
                " telling his opponents that if his Lord",
                " had granted Shu'ayb knowledge of reality and",
                " also a livelihood that is pure and",
                " lawful, how could their sarcastic remarks change",
                " the fact that Shu'ayb had received God's",
                " favours? Also, in view of the favours",
                " which God had lavished upon Shu'ayb, how",
                " could it be appropriate for him to",
                " act ungratefully towards God by legitimizing their",
                " erroneous beliefs and acts of corruption?",
                "*99).",
                " Shu'ayb pointed out to his detractors that",
                " they could measure his integrity by only",
                " one thing: whether he practised what he",
                " preached. Had he forbidden others from visiting",
                " false deities, and then had become the",
                " custodian of some such shrine, people would",
                " have been justified in reproaching him for",
                " inconsistency and self-contradiction. They could have rightly",
                " criticized him for preaching something and practising",
                " its opposite. Had he asked them to",
                " abstain from unlawful earnings and had himself",
                " resorted to dishonest practices they would have",
                " been perfectly justified in accusing him of",
                " talking of honesty merely to build up",
                " a good image of himself and then",
                " exploiting it for his personal ends.",
                "It",
                " was clear, however, that Shu'ayb could be",
                " accused of nothing like that. It was",
                " crystal clear that he had stayed well",
                " away from all those vices which he",
                " asked others to abstain from. He had",
                " no stains on him of which he",
                " wanted others to remain free. Shu'ayb also",
                " practised all those acts of goodness to",
                " which he invited others. All this was",
                " sufficient to establish that Shu'ayb was fully",
                " sincere about his mission."
            ]
        },
        {
            "id": "[11:89]",
            "verse": "And O my people, let not [your] dissension from me cause you to be struck by that similar to what struck the people of Noah or the people of Hud or the people of Salih. And the people of Lot are not from you far away.",
            "description": [
                "Shu'ayb reminded his people of the story",
                " of the people of Lot (peace be",
                " on him). This tragic episode took place",
                " not far from where the people of",
                " Shu'ayb lived. In addition, it was no",
                " more than six or seven centuries previously",
                " that the people of Lot were utterly",
                " destroyed."
            ]
        },
        {
            "id": "[11:90]",
            "verse": "And ask forgiveness of your Lord and then repent to Him. Indeed, my Lord is Merciful and Affectionate.\"",
            "description": [
                "God is neither callous nor merciless. He",
                " has no enmity towards His own creatures.",
                " It cannot even be conceived that God",
                " would want to punish people just for",
                " the fun of it. It is only",
                " when people exceed all reasonable limits and",
                " exercise no restraint in their wickedness that",
                " God punishes them, and then only reluctantly.",
                " He is so prone to forgiveness that",
                " no matter how sinful a person may",
                " have become, God's mercy encompasses him if",
                " only he sincerely repents and turns to",
                " God. For God's love and compassion for",
                " His creatures is simply immense.",
                "The Prophet",
                " (peace be on him) fully illustrated this",
                " by two examples. One is that of",
                " a man who had a camel carrying",
                " his food and water provisions. The camel",
                " strays away in a dreary desert. The",
                " person continues to search for the camel",
                " until he retires under the shade of",
                " a tree in utter despair. Then, suddenly,",
                " he finds the camel standing right in",
                " front of him. When a sinner repents",
                " and turns to God, He is even",
                " more joyous than the owner of the",
                " camel who suddenly finds his lost beast",
                " in a moment of total despair. (See",
                " Muslin-, al-Tawbah, Bab fi al-Hadd 'ala al-Tawbah,",
                " traditions 1-8.)",
                "The second example is perhaps",
                " even more moving. 'Umar narrated that once",
                " a few prisoners of war were brought",
                " to the Prophet (peace be on him).",
                " One of them was a woman whose",
                " infant child had been left behind. Her",
                " motherly compassion overwhelmed her to such an",
                " extent that she would grab any baby",
                " she could lay her hands on, would",
                " clasp him to her bosom, and start",
                " suckling him. When the Prophet (peace be",
                " on him) saw that woman in such",
                " a state of mind he asked the",
                " Companions whether they thought she would cast",
                " her children into fire. The Companions replied",
                " in the negative. They said that rather",
                " than throw her children into a fire,",
                " she would make every possible effort lest",
                " they slide into it. The Prophet (peace",
                " be on him) added: 'God is even",
                " more merciful to His servants than this",
                " woman is to her child.' (Muslim, al-Tawbah,",
                " Bab Sa'at Rahmat Allah - Ed.)",
                "A",
                " little reflection may help one appreciate that",
                " it is God Who has created compassion",
                " in the hearts of parents for their",
                " children. Had God not created this compassion",
                " for children, their parents may, in fact,",
                " have been quite inimical to them. For",
                " a child is indeed one of the",
                " greatest causes of parents' discomfort and annoyance.",
                " If one remembers that it is God",
                " Who planted love and compassion for children",
                " in the hearts of parents it is",
                " quite easy to grasp the extent of",
                " God's love and compassion for His creatures.",
                ""
            ]
        },
        {
            "id": "[11:91]",
            "verse": "They said, \"O Shu'ayb, we do not understand much of what you say, and indeed, we consider you among us as weak. And if not for your family, we would have stoned you [to death]; and you are not to us one respected.\"",
            "description": [
                "When Shu'ayb's people stated that they did",
                " not understand much of what Shu'ayb said,",
                " they did not say so because Shu'ayb",
                " (peace be on him) spoke in some",
                " foreign language, or because he talked in",
                " an ambiguous or complicated manner. On the",
                " contrary, Shu'ayb's teaching was quite clear and",
                " simple and was conveyed to his people",
                " in a language they fully understood -",
                " their own. The difficulty in understanding Shu'ayb's",
                " teaching arose from the fact that his",
                " people had become simply too perverse to",
                " grasp it. It is always the case",
                " that when some people become fully seized",
                " by their prejudice, are overpowered by their",
                " lusts, or begin to move vehemently in",
                " one particular intellectual direction, they hardly have",
                " the patience to give ear to any",
                " idea which is different from their own.",
                " But even if they were to listen",
                " to any unfamiliar idea, it would only",
                " sound to them as gibberish, as something",
                " coming to them from some other planet.",
                "",
                "*103). It should be borne in mind",
                " that exactly the same situation that had",
                " obtained in the past among the people",
                " of Shu'ayb also obtained in Makka at",
                " the time these verses were revealed. The",
                " Quraysh were seething with enmity towards Prophet",
                " Muhammad (peace be on him) and wanted",
                " to put an end to his life",
                " in much the same way as Shu'ayb's",
                " people were inimical to him. The only",
                " reason which prevented the Quraysh from violently",
                " laying their hands on the Prophet (peace",
                " be on him) was that his clan,",
                " Hashim, stood firmly behind him.",
                "Thus, the",
                " story of Shu'ayb in relation to his",
                " people was exactly the same as that",
                " of Prophet Muhammad (peace be on him)",
                " in relation to the Quraysh. The story",
                " of Shu'ayb is narrated here precisely because",
                " of the obvious resemblance it bears to",
                " the predicament of Prophet Muhammad (peace be",
                " on him).",
                "Soon we will also come",
                " across (see verse 93) a very instructive",
                " statement of Shu'ayb's in response to the",
                " harsh expression of hostility (see verse 91).",
                " The implication is quite clear. The same",
                " statement would be addressed by Muhammad (peace",
                " be on him) to his own unbelieving",
                " people."
            ]
        },
        {
            "id": "[11:92]",
            "verse": "He said, \"O my people, is my family more respected for power by you than Allah? But you put Him behind your backs [in neglect]. Indeed, my Lord is encompassing of what you do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:93]",
            "verse": "And O my people, work according to your position; indeed, I am working. You are going to know to whom will come a punishment that will disgrace him and who is a liar. So watch; indeed, I am with you a watcher, [awaiting the outcome].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:94]",
            "verse": "And when Our command came, We saved Shu'ayb and those who believed with him, by mercy from Us. And the shriek seized those who had wronged, and they became within their homes [corpses] fallen prone",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:95]",
            "verse": "As if they had never prospered therein. Then, away with Madyan as Thamud was taken away.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:96]",
            "verse": "And We did certainly send Moses with Our signs and a clear authority",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:97]",
            "verse": "To Pharaoh and his establishment, but they followed the command of Pharaoh, and the command of Pharaoh was not [at all] discerning.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:98]",
            "verse": "He will precede his people on the Day of Resurrection and lead them into the Fire; and wretched is the place to which they are led.",
            "description": [
                "It clearly emerges from this verse as",
                " well as from other verses of the",
                " Qur'an that those who lead a nation",
                " or a group of people in the",
                " present world will also be their leaders",
                " on the Day of Resurrection. If the",
                " leaders had directed their people to truth,",
                " virtue and righteousness their followers will gather",
                " under their banner on the Day of",
                " Resurrection and will march to Paradise under",
                " their leadership. On the other hand, if",
                " these leaders called their people to erroneous",
                " beliefs, to immorality, or to false ways",
                " of conduct, they will continue to follow",
                " them even on the Day of Resurrection",
                " and until they end up in Hell.",
                " This seems evident from the remark made",
                " by the Prophet (peace be on him)",
                " about Imr al-Qays: 'Imr al-Qays will bear",
                " the standard of the poets of Jahiliyah",
                " to the Fire.' (Ahmad ibn Hanbal, Musnad,",
                " vol. 2, p. 228 - Ed.)",
                "Now",
                " everyone can visualize what kind of procession",
                " both these would be, each pressing on",
                " to their destined goal. There would be",
                " the procession of those who had been",
                " misled by their so-called leaders. On that",
                " Day they would be fully conscious of",
                " the dangerous end to which they would",
                " be in due course dragged. They would,",
                " therefore, quite naturally look upon those leaders",
                " as the ones responsible for all their",
                " suffering and misfortune. In the front line",
                " of the procession would be the so-called",
                " leaders and behind them would be throngs",
                " of their followers hurling abuses and curses",
                " at them. In sharp contrast, will be",
                " the other procession, the one led by",
                " those whose leadership made their followers merit",
                " entry into Paradise. With this blissful end",
                " in view, the followers will joyously press",
                " ahead, lavishing prayers and grateful tributes on",
                " their leaders."
            ]
        },
        {
            "id": "[11:99]",
            "verse": "And they were followed in this [world] with a curse and on the Day of Resurrection. And wretched is the gift which is given.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:100]",
            "verse": "That is from the news of the cities, which We relate to you; of them, some are [still] standing and some are [as] a harvest [mowed down].",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:101]",
            "verse": "And We did not wrong them, but they wronged themselves. And they were not availed at all by their gods which they invoked other than Allah when there came the command of your Lord. And they did not increase them in other than ruin.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:102]",
            "verse": "And thus is the seizure of your Lord when He seizes the cities while they are committing wrong. Indeed, His seizure is painful and severe.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:103]",
            "verse": "Indeed in that is a sign for those who fear the punishment of the Hereafter. That is a Day for which the people will be collected, and that is a Day [which will be] witnessed.",
            "description": [
                "In such incidents of history there are",
                " instructive signs for all people. Only a",
                " little reflection will make them realize that",
                " the punishment of the unrighteous is inevitable",
                " and that the information provided by the",
                " Prophets (peace be on them) in this",
                " respect is absolutely true. These signs can",
                " also help men have some idea of",
                " how horrible the Day of Judgement will",
                " be. This realization is likely to create",
                " in man's heart a fear which will",
                " direct him to righteous behaviour.",
                "One may",
                " well ask, what are the signs in",
                " human history which indicate that there is",
                " an After-life, one in which people are",
                " liable to suffer punishment? These signs can",
                " easily be appreciated by those who do",
                " not consider history to consist merely of",
                " a series of unrelated events and who",
                " are inclined to reflect over the underlying",
                " logic of those events and so derive",
                " some conclusion from them. What is most",
                " conspicuous in the long record of history",
                " is the constantly recurring phenomenon of the",
                " rise and fall of nations. Moreover, this",
                " rise and fall seems to be tied",
                " up with certain moral factors. The way",
                " in which certain nations have encountered significant",
                " falls and have suffered destruction clearly indicates",
                " that man, in this universe, is under",
                " a dispensation in which blind physical laws",
                " do not predominate. Instead, under that dispensation",
                " a moral law is also in operation.",
                " The result is that the nations which",
                " maintain a given minimum level of adherence",
                " to moral principles are rewarded. Those who",
                " slide below that minimum level of adherence",
                " to moral principles, are granted a temporary",
                " respite. However, once a nation falls perceptibly",
                " below that minimum level, it meets its",
                " tragic end and is made a lesson",
                " of for future generations. The occurrence and",
                " repetition of these events at regular intervals",
                " leaves no doubt whatsoever that retribution is",
                " a permanent feature, a fully-fledged law that",
                " operates in human history.",
                "Moreover, were one",
                " to carefully reflect upon the different forms",
                " of punishment which visited these different nations",
                " of the world, one would also realize",
                " that those punishments only partially accord with",
                " the requirements of justice and retribution. Were",
                " total justice to be meted out, it",
                " would be necessary to do a great",
                " deal more. For the punishments which struck",
                " the nations of the world in the",
                " past, struck only those generations which lived",
                " at the time when the punishment visited",
                " them. But there are generations of men",
                " who sowed the wind of wickedness but",
                " disappeared when that wind developed into a",
                " whirlwind. The consequences of their evil deeds",
                " were faced by the generations that followed",
                " after them. It is obvious in this",
                " case that the real culprits escaped retribution.",
                "",
                "Now, if we are able to grasp",
                " the inner workings of this universe by",
                " our study of history, this should lead",
                " us to the conclusion that the unfulfilled",
                " requirements of justice call for a new",
                " order of existence to be brought into",
                " being. It is only then that those",
                " transgressors and wrong-doers who escaped divine punishment",
                " in the worldly life can be duly",
                " punished and their punishment will be much",
                " more severe than that suffered by the",
                " evil-doers in the world. (See Towards Understanding",
                " the Qur'an, vol. Ill, al-A'raf, n. 30,",
                " pp. 23-6 and vol. IV, Yunus 10,",
                " n. 10, p. 9.)"
            ]
        },
        {
            "id": "[11:104]",
            "verse": "And We do not delay it except for a limited term.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:105]",
            "verse": "The Day it comes no soul will speak except by His permission. And among them will be the wretched and the prosperous.",
            "description": [
                "Some people entertain the misconception that their",
                " saintly patrons will intercede on their behalf",
                " and obtain salvation for them on the",
                " Day of Resurrection. They believe that some",
                " of the saints will simply stage a",
                " sit-in protest before God, and will thus",
                " virtually extract from Him a pardon for",
                " their devotees. All this, of course, is",
                " sheer nonsense. For in God's majestic court,",
                " everyone - howsoever great they may otherwise",
                " be, including angels - will be in",
                " a state of spellbinding awe. At that",
                " awe-inspiring moment - the Day of Judgement",
                " - none will even dare speak until",
                " God Himself permits him to do so.",
                "",
                "There are of course many in this",
                " world who make offerings at the altars",
                " of many beside God in the belief",
                " that they will simply have an overwhelming",
                " influence with God. Many people continue to",
                " commit misdeeds in the hope that the",
                " intercession of such beings will bring about",
                " their rescue. Such people will face utter",
                " disappointment on that Day."
            ]
        },
        {
            "id": "[11:106]",
            "verse": "As for those who were [destined to be] wretched, they will be in the Fire. For them therein is [violent] exhaling and inhaling.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:107]",
            "verse": "[They will be] abiding therein as long as the heavens and the earth endure, except what your Lord should will. Indeed, your Lord is an effecter of what He intends.",
            "description": [
                "There are two possible interpretations for the",
                " words, 'as long as the heavens and",
                " the earth endure'. One possibility is that",
                " they refer to the heavens",
                "*108). There",
                " is no power other than God's that",
                " can prevent the sinners from suffering eternal",
                " punishment. However, God may Himself will that",
                " someone may be spared His unending punishment.",
                " He may also decide to pardon such",
                " a person after he has been made",
                " to suffer a period of punishment in",
                " the After-life. In such cases, God certainly",
                " has both the authority and the power",
                " to do that. For if there is",
                " any law, it is God Who has",
                " made it, and hence that law can",
                " set no limit upon His power and",
                " authority."
            ]
        },
        {
            "id": "[11:108]",
            "verse": "And as for those who were [destined to be] prosperous, they will be in Paradise, abiding therein as long as the heavens and the earth endure, except what your Lord should will - a bestowal uninterrupted.",
            "description": [
                "A person's permanent stay in Paradise is",
                " equally not contingent upon some higher law",
                " that would compel God to facilitate this.",
                " On the contrary, people will be able",
                " to stay there permanently only by dint",
                " of God's grace and mercy. If God",
                " were to act otherwise, He obviously has",
                " both the power and the authority to",
                " do so."
            ]
        },
        {
            "id": "[11:109]",
            "verse": "So do not be in doubt, [O Muhammad], as to what these [polytheists] are worshipping. They worship not except as their fathers worshipped before. And indeed, We will give them their share undiminished.",
            "description": [
                "This does not mean that the Prophet",
                " (peace be on him) entertained any 'doubts'",
                " concerning the deities whom the unbelievers associated",
                " with God in His divinity. Though this",
                " verse is ostensibly addressed to the Prophet",
                " (peace be on him), it is really",
                " aimed at conveying a message to the",
                " people of Makka. The thrust of the",
                " verse is that no sensible person should",
                " entertain the notion that those who worship",
                " false gods and pray to them have",
                " any plausible grounds for doing so and",
                " for expecting some benefit from such worship.",
                "",
                "The fact of the matter is that",
                " the worship of false deities and the",
                " offerings, sacrifices and invocations addressed to them",
                " were supported neither by knowledge, careful observation,",
                " nor any scientific experimentation. The only basis",
                " for such worship was blind imitation of",
                " their ancestors. The same shrines found amongst",
                " today's polytheists were also found among several",
                " past nations of the world. The same",
                " miraculous feats which are popular today were",
                " equally popular in the past among other",
                " nations. However, when God's punishment seized those",
                " nations which worshipped false deities, they were",
                " utterly destroyed. Their shrines proved altogether unavailing.",
                ""
            ]
        },
        {
            "id": "[11:110]",
            "verse": "And We had certainly given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been judged between them. And indeed they are, concerning the Qur'an, in disquieting doubt.",
            "description": [
                "If people launch scurrilous attacks on the",
                " Qur'an, this is not altogether novel. The",
                " same happened before. When Moses (peace be",
                " on him) was granted the scripture, people",
                " raised a variety of objections against it.",
                " The Prophet Muhammad (peace be on him)",
                " should not, therefore, feel disheartened that his",
                " people rejected the teachings of the Qur'an",
                " despite their lucidity.",
                "*112). This is being",
                " said in order to comfort the Prophet",
                " (peace be on him) and his Companions.",
                " They are being asked to be patient",
                " and not to seek a hasty judgement",
                " from God concerning those who differ about",
                " the Qur'an. For God will soon come",
                " forth with His judgement. He has determined",
                " that this judgement will neither come a",
                " moment before, nor a moment after the",
                " expiry of the term. It is true",
                " human beings wish God's judgement to come",
                " hastily. As for God, He never judges",
                " hastily."
            ]
        },
        {
            "id": "[11:111]",
            "verse": "And indeed, each [of the believers and disbelievers] - your Lord will fully compensate them for their deeds. Indeed, He is Acquainted with what they do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:112]",
            "verse": "So remain on a right course as you have been commanded, [you] and those who have turned back with you [to Allah], and do not transgress. Indeed, He is Seeing of what you do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:113]",
            "verse": "And do not incline toward those who do wrong, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:114]",
            "verse": "And establish prayer at the two ends of the day and at the approach of the night. Indeed, good deeds do away with misdeeds. That is a reminder for those who remember.",
            "description": [
                "The 'two ends of the day' refer",
                " to the morning and the sunset. Similarly,",
                " the 'first hours of the night' refer",
                " to the time of the 'Isha' Prayer.",
                " We thus learn that this Qur'anic verse",
                " dates back to the time when the",
                " five daily Prayers had as yet not",
                " been prescribed. The Prophet's ascension took place",
                " at a later time than the revelation",
                " of these verses and it is then",
                " that the five daily Prayers were prescribed.",
                " (For further explanation see alIsra 17, n.",
                " 95; Ta Ha 20: 111; and al-Rum",
                " 30: 124.)",
                "*114). The Qur'an informs the",
                " believers of the best way to drive",
                " away the evils which are rampant in",
                " the world and how to obliterate the",
                " wrongs perpetuated by the inveterate enemies of",
                " Islam. It counsels the believers to become",
                " increasingly righteous. For the righteousness of the",
                " believers will ultimately overwhelm evil and corruption.",
                " Now, since Prayers constantly remind people of",
                " God, they are the best means of",
                " making people righteous. The power that the",
                " believers receive from Prayer will not only",
                " enable them to repulse the onslaught of",
                " the organized forces of evil, but also",
                " to establish a righteous and benevolent order",
                " in the world. (For further elaboration see",
                " al-'Ankabut 29, nn. 77-9.)"
            ]
        },
        {
            "id": "[11:115]",
            "verse": "And be patient, for indeed, Allah does not allow to be lost the reward of those who do good.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:116]",
            "verse": "So why were there not among the generations before you those of enduring discrimination forbidding corruption on earth - except a few of those We saved from among them? But those who wronged pursued what luxury they were given therein, and they were criminals.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:117]",
            "verse": "And your Lord would not have destroyed the cities unjustly while their people were reformers.",
            "description": [
                "These verses bring out, in a significantly",
                " instructive manner, the real factors which caused",
                " the destruction of those nations whose history",
                " has been narrated earlier (see verse 36",
                " ff. above). Reviewing that history, the Qur'an",
                " points out the single common denominator of",
                " all those nations which met their doom",
                " in the past. All those nations had",
                " formerly been favoured with God's blessings. But",
                " drunk with affluence, they resorted to mischief",
                " on earth. Their collective conscience was also",
                " completely vitiated. The result was that no",
                " righteous person was left among them to",
                " prevent them from committing evils. And if",
                " any such person did exist, their number",
                " was either too small, or their voice",
                " too feeble to prevent evils from predominating.",
                " This situation eventually invited God's wrath upon",
                " them. Had they not been so evil,",
                " there was no reason why God should",
                " punish them. After all, He bears no",
                " such grudge against His creatures that would",
                " prompt Him to punish people even when",
                " they act righteously.",
                "The above statement is",
                " intended to underscore three points. Firstly, that",
                " it is imperative that there should always",
                " be a good number of righteous people",
                " in every society; those who would invite",
                " people to righteousness and prevent them from",
                " evil. For God likes to see that",
                " there is righteousness in the world. And",
                " if God does tolerate the existence of",
                " evil in human society, He does so",
                " since the potential for righteousness continues to",
                " exist in that society. But such tolerance",
                " endures only as long as that potential",
                " remains. However, if the condition of a",
                " community deteriorates, rendering it altogether devoid of",
                " good people, or if the good people",
                " in that community become an insignificant minority,",
                " too weak to prevent it from proceeding",
                " along its evil ways, then God's chastisement",
                " begins to loom large over it. That",
                " much can be said for sure. However,",
                " it is difficult to say with any",
                " precision when God's chastisement will actually smite",
                " that community and destroy it.",
                "Secondly, a",
                " community that is prepared to put up",
                " with everything except a group of righteous",
                " people in its midst - people that",
                " call men to do good and forbid",
                " them from doing evil - is certainly",
                " destined for self-destruction. The attitude of that",
                " community clearly shows that it cherishes all",
                " that would lead to its destruction, and",
                " that it is intolerant of all that",
                " would ensure its survival.",
                "Thirdly, God's final",
                " decision whether to punish a community or",
                " not depends on the extent to which",
                " that community is possessed of the elements",
                " that would enable it to respond to",
                " the call of truth. If it has",
                " such people in good numbers that would",
                " suffice to extirpate evil and establish a",
                " righteous order, such a community is spared",
                " the kind of chastisement which embraces whole",
                " communities and totally destroys them. If it",
                " is subjected to some partial rather than",
                " an all-embracing chastisement, the purpose of it",
                " is to enable its righteous elements to",
                " mend their ways.",
                "It is possible, however,",
                " that in spite of continued efforts, the",
                " community will be unable to throw up",
                " a sufficient number of good people needed",
                " to bring about its reform. It is",
                " also possible that the community will demonstrate",
                " by its action that it is full",
                " of corrupt people and altogether bereft of",
                " virtuous ones. The community, in such a",
                " case, has obviously become a heap of",
                " coal in which no diamonds are left.",
                " When such a stage is reached God",
                " causes a fire to erupt, a fire",
                " that reduces this heap of coal to",
                " a heap of ashes. (For further elaboration",
                " see al-Dhariyat 51, n. 34.)"
            ]
        },
        {
            "id": "[11:118]",
            "verse": "And if your Lord had willed, He could have made mankind one community; but they will not cease to differ.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:119]",
            "verse": "Except whom your Lord has given mercy, and for that He created them. But the word of your Lord is to be fulfilled that, \"I will surely fill Hell with jinn and men all together.\"",
            "description": [
                "This is being said in order to",
                " remove misconceptions which are often put forward",
                " under the appellation 'fate'. The explanation of",
                " the destruction of those ancient nations mentioned",
                " above is liable to give rise to",
                " serious objections. For, in the context of",
                " the above explanation it might be pointed",
                " out that the non-existence of righteous persons",
                " in a nation, or their existence in",
                " very small numbers, depends entirely on God's",
                " will. If such is the case, how",
                " can any blame be directed at those",
                " nations'? For, after all, why did God",
                " not create a large number of good",
                " people in those nations?",
                "In the course",
                " of clarifying this misconception, it is pointed",
                " out here that God's will with regard",
                " to human beings does not consist of",
                " binding them to follow an inalterable course",
                " of conduct in the manner of plants,",
                " animals and other similar living beings who,",
                " as we know, have no choice except",
                " to follow the course determined for them",
                " either by the laws of nature or",
                " their instincts. Had such been the case,",
                " there would be no point in inviting",
                " human beings to believe, to raise Prophets,",
                " to reveal scriptures. All human beings would",
                " have been born as ones who would",
                " believe and submit to God's command. However,",
                " it was God's will regarding man that",
                " he should be granted free will and",
                " be vested with the power to follow",
                " the ways of his choice. It was",
                " God's will that the ways leading both",
                " to Paradise and Hell should remain open",
                " to him, and that everyone be provided",
                " with the opportunity to make a choice",
                " between them. Thus, whatever one is able",
                " to acquire is the fruit of his",
                " own labour.",
                "Now, the very scheme of",
                " man's creation consists of granting him free",
                " will and providing the opportunity to choose",
                " between belief and unbelief. In such a",
                " case it is simply inconceivable that a",
                " nation would wilfully decide to go astray",
                " and God compel it to righteousness. If",
                " a nation decides to set up a",
                " system that produces rogues who try to",
                " excel one another in their evil, wrong-doing",
                " and sin, how can God forcibly direct",
                " them, by means of His direct interference,",
                " to the course of righteousness? Such an",
                " interference is simply not apart of God's",
                " scheme of things. Members of a community",
                " become good or bad as a result",
                " of the measures taken by that nation",
                " itself. But a time may come when",
                " a community immerses itself so deeply in",
                " evil that no sizeable group of good",
                " people are left in it to champion",
                " righteousness. Alternatively, the social system of that",
                " community may be so geared as to",
                " leave no room for reform. When such",
                " a stage is reached, God simply lets",
                " that community proceed to the tragic end",
                " that it has chosen for itself.",
                "Those",
                " nations which deserve God's mercy are possessed",
                " of altogether different characteristics. Such nations abound",
                " in persons who respond to the call",
                " of righteousness. Moreover, their social values make",
                " it possible for righteous people to carry",
                " on their efforts to bring about reform.",
                " (For further elaboration see Towards Understanding the",
                " Qur'an, vol. II, al-An 'am o, n",
                " 24, pp. 228-9.)"
            ]
        },
        {
            "id": "[11:120]",
            "verse": "And each [story] We relate to you from the news of the messengers is that by which We make firm your heart. And there has come to you, in this, the truth and an instruction and a reminder for the believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:121]",
            "verse": "And say to those who do not believe, \"Work according to your position; indeed, we are working.",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:122]",
            "verse": "And wait, indeed, we are waiting.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[11:123]",
            "verse": "And to Allah belong the unseen [aspects] of the heavens and the earth and to Him will be returned the matter, all of it, so worship Him and rely upon Him. And your Lord is not unaware of that which you do.",
            "description": [
                "God is cognizant of all that is",
                " being done by the two panics engaged",
                " in the encounter between belief and unbelief.",
                " It is simply inconceivable that there should",
                " be chaos and disorder in God's realm.",
                " For God's realm is not the realm",
                " of a negligent, heedless sovereign who is",
                " unaware of what is going on, However,",
                " since God is Wise and Forbearing, He",
                " does not resort to punishing people hastily.",
                " However, justice is eventually meted out and",
                " those who deserve punishment are ultimately punished.",
                " Thus, all those who are engaged in",
                " the effort to bring about reform, should",
                " feel reassured that their efforts will not",
                " be wasted.",
                "On the other hand, there",
                " are also those who are engaged in",
                " making and perpetuating mischief, who have focused",
                " all their efforts on brutally persecuting reformers",
                " and suppressing their reform efforts. Such people",
                " should know that all their evil deeds",
                " are known to God, and that they",
                " will be made to pay very dearly",
                " for these misdeeds."
            ]
        }
    ]
}