{
    "name": "Al-Masad",
    "id": 111,
    "verse-count": 5,
    "verse-info": [
        {
            "verse-id": "[111:1]",
            "verse": "May the hands of Abu Lahab be ruined, and ruined is he.",
            "description": [
                "His real name was 'Abd al-'Uzza, and",
                " he was called Abu Lahab on account",
                " of his glowing, ruddy complexion. Lahab means",
                " the flame of fire, and Abu Lahab",
                " the one with a flaming, fiery face.",
                " His being mentioned here by his nickname",
                " (Kunyat), instead of his real name, has",
                " several reasons. First, that he was better",
                " known by his nickname than by his",
                " real name; second, that the Qur'an did",
                " not approve that he should be mentioned",
                " by his polytheistic name `Abd al 'Uzza",
                " (slave of 'Uzza); third, that his kunyat",
                " goes well with the fate that has",
                " been described of him in this Surah.",
                "",
                "Some commentators have translated tabbat yada Abi",
                " Lahab to mean: \"May the hands of",
                " Abu Lahab be broken\", and tabby to",
                " mean: 'may he perish\" or \"he perished\".",
                " But this, in fact, was not a",
                " curse which was invoked on him, but",
                " a prophecy in which an event taking",
                " place in the future, has been described",
                " in the past tense, to suggest that",
                " its occurrence in the future is certain",
                " and inevitable.",
                "In actual fact, at last",
                " the same thing happened as had been",
                " foretold in this Surah a few years",
                " earlier. Breaking of the hands obviously does",
                " not imply breaking of the physical hands,",
                " but a person's utterly failing in his",
                " aim and object for which he has",
                " exerted his utmost. And Abu Lahab indeed",
                " had exerted his utmost to defeat and",
                " frustrate the message of lslam presented by",
                " the Holy Prophet (upon whom be peace).",
                " But hardly seven or eight years after",
                " the revelation of this Surah most of",
                " the big chiefs of Quraish, who were",
                " a party with Abu Lahab in his",
                " hostility to Islam, were killed in the",
                " Battle of Badr. When the news of",
                " the defeat reached Makkah, he was so",
                " shocked that he could not survive for",
                " more than seven days. His death occurred",
                " in a pitiabie state. He became afflicted",
                " with malignant pustule and the people of",
                " his house left him to himself, fearing",
                " contagion. No one came near his body",
                " for three days after his death, until",
                " the body decomposed and began to stink.",
                " At last, when the people began to",
                " taunt his sons, according to one tradition,",
                " they hired some negroes, who lifted his",
                " body and buried it. According to another",
                " tradition, they got a pit dug out",
                " and threw his body into it by",
                " pushing it with wood, and covered it",
                " up with earth and stones. His utter",
                " failure became manifest when the religion which",
                " he had tried his utmost to impede",
                " and thwart, was accepted by his own",
                " children. First of all, his daughter, Darrah,",
                " migrated from Makkah to Madinah and embraced",
                " lslam; then on the conquest of Makkah,",
                " both his sons, `Utabh and Mu`attab, came",
                " before the Holy Prophet (upon whom be",
                " peace) through the mediation of Hadrat `Abbas,",
                " believed and took oath of allegiance to",
                " him."
            ]
        },
        {
            "verse-id": "[111:2]",
            "verse": "His wealth will not avail him or that which he gained.",
            "description": [
                "Abu Lahab was a stingy, materialistic man.",
                " Ibn Jarir has stated that once in",
                " the pre-Islamic days he was accused of",
                " having stolen two golden deer from the",
                " treasury of the Ka'bah. Though later the",
                " deer were recovered from another person, the",
                " fact that he was accused of stealing",
                " indicates the opinion the people of Makkah",
                " held of him. About his riches Qadi",
                " Rashid bin Zubair writes in his Adh-Dhakha'ir",
                " wat-Tuhaf. He was one of the four",
                " richest men of the Quraish, who owned",
                " one qintar (about 260 oz) of gold",
                " each. His love of wealth can be",
                " judged from the fact that when on",
                " the occasion of the battle of Badr",
                " the fate of his religion was going",
                " to be decided for ever, and all",
                " the Quraish chiefs had personally gone to",
                " fight, he sent `As bin Hisham to",
                " fight on his own behalf, telling him:",
                " This is in lieu of the debt",
                " of four thousand dirhams that you owe",
                " to me. Thus. he contrived a plan",
                " to realize his debt, for 'As had",
                " become bankrupt and there was no hope",
                " of the recovery of the debt from",
                " him.",
                "Some conunentators have taken ma kasaba",
                " in the meaning of the earning, i.r.",
                " the benefits that accrued to him from",
                " his wealth were his kasab(earning), and some",
                " other commentators have taken it to imply",
                " children, for the Holy Prophet (upon whom",
                " be peace) has said that a man's",
                " son also is his kasab(earning). (Abu Da'ud,",
                " Ibn Abi Hatim). Both these meanings fully",
                " correspond to the fate met by Abu",
                " Lahab. For when he was afflicted with",
                " the malignant pustule, his wealth availed him",
                " nothing, and his children also left him",
                " alone to die a miserable, wretched death.",
                " They did not even bury him honourably.",
                " Thus, within a few years the people",
                " witnessed how the prophecy which had been",
                " made in this Surah about Abu Lahab",
                " was literally fulfilled."
            ]
        },
        {
            "verse-id": "[111:3]",
            "verse": "He will [enter to] burn in a Fire of [blazing] flame",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[111:4]",
            "verse": "And his wife [as well] - the carrier of firewood.",
            "description": [
                "Her name was Arwa' and her nickname",
                " (kunyat) Umm Jamil. She was sister of",
                " Abu Sufyan and was no less bitter",
                " than her husband, Abu Lahab, in her",
                " enmity to the Holy Messenger (upon whom",
                " be peace) Hadrat Abu Bakr's daughter, Hadrat",
                " Asma', has related that when this Surah",
                " was revealed, and Umm Jamil heard it,",
                " she was filled with rage and went",
                " out in search of the Holy Prophet",
                " (upon whom be peace). She carried a",
                " handful of stones and she was crying",
                " some verses of her own, satirizing the",
                " Holy Prophet. She came to the Ka`bah,",
                " where the Holy Prophet was sitting with",
                " Hadrat Abu Bakr. The latter said: \"O",
                " Messenger of AIIah, there she comes and",
                " I fear lest she should utter something",
                " derogatory to you.\" The Holy Prophet replied:",
                " \"She will not see me.\" The same",
                " thing happened. She could not see the",
                " Holy Prophet although he was there. She",
                " said to Hadrat Abu Bakr: \"I hear",
                " that your Companion has satirized me.\" Hadrat",
                " Abu Bakr replied: \"No, by the Lord",
                " of this house, he has not satirized",
                " you.\" Hearing this she went off. (lbn",
                " Abi Hatim, Ibn Hisham; Bazzar has related",
                " an incident on the authority of Hadrat",
                " 'Abdullah bin `Abbas also, which closely resembles",
                " this). What Hadrat Abu Bakr meant was",
                " that she had not been satirized by",
                " the Holy Prophet (upon whom be peace),",
                " but by AIlah Himself.",
                "*4) The words",
                " in the original are hammalat al-hatab, which",
                " literally mean: \"carrier of the wood\". The",
                " commentators have given several meanings of it.",
                " Hadrat `Abdullah bin `Abbas, Ibn Zaid, Dahhak",
                " and Rabi` bin Anas say: She used",
                " to strew thorns at the Holy Prophet's",
                " door in the night; therefore, she has",
                " been described as carrier of the wood.",
                " Qatadah, Ikrimah Hasan Bari, Mujahid and Sufyan",
                " Thauri say: She used to carry evil",
                " tales and slander from one person to",
                " another in order to create hatred between",
                " them; therefore, she has been called the",
                " bearer of wood idiomatically. Sa`id bin Jubair",
                " says: The one who is loading himself",
                " with the burden of sin, is described",
                " idiomatically in Arabic as: Fulan-un Yahtatibu ala",
                " zahri bi (so and so is loading",
                " wood on his back); therefore, hummalat al-hatab",
                " means: 'The one who carries the burden",
                " of sin. Another meaning also which the",
                " commentators have given is: she will do",
                " this in the Hereafter, i.e. she will",
                " bring and supply wood to the fire",
                " in which Abu Lahab would be burning.",
                ""
            ]
        },
        {
            "verse-id": "[111:5]",
            "verse": "Around her neck is a rope of [twisted] fiber.",
            "description": [
                "The word used for her neck is",
                " jid, which in Arabic means a neck",
                " decorated with an ornament. Sa`id bin al-Musayyab,",
                " Hasan Basri and Qatadah say that she",
                " wore a valuable necklace and used to",
                " say: \"By Lat and `Uzza, I will",
                " sell away this necklace and expend the",
                " price to satisfy my enmity against Muhammad",
                " (Allah's peace and blessings be upon him).\"",
                " That is why the word jid has",
                " been used here ironically, thereby implying that",
                " in Hell she would have a rope",
                " of palm-fibre round her neck instead of",
                " that necklace upon which she prides herself",
                " so arrogantly. Another example of this ironical",
                " style is found at several places in",
                " the Qur'an in the sentence: Bashshir-hum bi-`adhab-in",
                " alima \"Give them the good news of",
                " a painful torment. \"",
                "The words babl-um",
                " min-masad have been used for the rope",
                " which will be put round her neck,",
                " i e. it will be a rope",
                " of the masad kind. Different meanings of",
                " this have been given by the lexicographers",
                " and commentators. According to some, masad means",
                " a tightly twisted rope; others say that:",
                " masad is the rope made from palm-fibre;",
                " still others say that it means the",
                " rope made from rush, or camel-skin, or",
                " camel-hair. Still another view is that it",
                " implies a cable made by twisted iron",
                " strands together."
            ]
        }
    ]
}