{
    "name": "Al-Falaq",
    "id": 113,
    "verse-count": 5,
    "verse-info": [
        {
            "verse-id": "[113:1]",
            "verse": "Say, \"I seek refuge in the Lord of daybreak",
            "description": [
                "As qul (say) is a part of",
                " the message which was conveyed to the",
                " Holy Prophet (upon whom be peace) by",
                " Revelation for preaching his prophetic message, its",
                " first addressee is the Holy Prophet himself",
                " but after him every believer too is",
                " its addressee.",
                "*2) The act of seeking",
                " refuge necessarily consists of three parts: (1)The",
                " act of seeking refuge itself; (2) the",
                " seeker of refuge; and (3) he whose",
                " refuge is sought. Seeking refuge implies feeling",
                " fear of something and seeking protection of",
                " another, or taking cover of it, or",
                " clinging to it, or going under its",
                " shelter for safety. The seeker after refuge",
                " in any case is the person, who",
                " feels that he cannot by himself resist",
                " and fight the thing that he fears,",
                " but stands in need of refuge with",
                " another for protection. Then the one whose",
                " refuge is sought must necessarily be a",
                " person or being about whom the seeker",
                " after refuge believes that he or it",
                " alone can protect him from the calamity.",
                " Now, one kind of refuge is that",
                " which is obtained according to natural laws",
                " in the physical world from a perceptible",
                " material object or person or power, for",
                " example, taking shelter in a fort for",
                " protection against the enemy's attack, or taking",
                " cover in a trench or behind a",
                " heap of earth, or walI, for protection",
                " against a shower of bullets, or taking",
                " refuge with a man or government, for",
                " protection from a powerful tyrant or taking",
                " refuge in the shade of a tree",
                " or building for protection from the sun.",
                " Contrary to this, the other kind of",
                " refuge is that which is sought in",
                " a supernatural Being from every kind of",
                " danger and every kind of material, moral",
                " or spiritual harm and injury on the",
                " basis of the belief that that Being",
                " is ruler over the physical world and",
                " can protect in supersensory ways the one",
                " who seeks His refuge. This second kind",
                " of refuge is the one that is",
                " implied not only in Surah AI-Falaq and",
                " Surah An-Nas but wherever in the Qur'an",
                " and the Hadith mention has been made",
                " of seeking refuge with Allah, it implies",
                " this particular kind of refuge, and it",
                " is a necessary corollary of the doctrine",
                " of Tauhid that this kind of refuge",
                " should be sought from no one but",
                " Allah. The polytheists sought this kind of",
                " protection, and seek even today, from other",
                " beings than Allah, e.g. the jinn, or",
                " gods and goddesses. The materialists turn for",
                " this also to material means and resources,",
                " for they do not believe in any",
                " supernatural power. But the believer only turns",
                " to Allah and seeks refuge only with",
                " Him, against all such calamities and misfortunes",
                " to ward off which he feels he",
                " has no power. For example, about the",
                " polytheists it has been said in the",
                " Qur'an: \"And that from among men some",
                " people used to seek refuge with some",
                " people from among the jinn (Al-Jinn: 16).\"",
                " And explaining it in E.N. 47 of",
                " Surah Al-Jinn we have cited Hadrat `Abdullah",
                " bin 'Abbas's tradition that when the polytheistic",
                " Arabs had to pass a night in",
                " an uninhabited valley, they would call out,",
                " saying: We seek refuge of the lord",
                " of this valley (i e. of the",
                " jinn who is ruler and master of",
                " this valley).\" Contrary to this, about Pharaoh",
                " it has been said: \"When he witnessed",
                " the great Signs presented by the Prophet",
                " Moses, he showed arrogance on account of",
                " his might.\" (Adh-Dhariyat: 39). As for the",
                " attitude and conduct of the God-worshippers the",
                " Qur'an says that they seek Allah's refuge",
                " for protection against the evil of everything",
                " that they fear, whether it is material",
                " or moral or spiritual. Thus, about Mary",
                " it has been said that when God's",
                " angel appeared before her suddenly in human",
                " guise (when she did not know that",
                " he was an angel), she cried out:",
                " \"I seek the merciful God's refuge from",
                " you, if you are a pious man.\"",
                " (Mary: 18). When the Prophet Noah made",
                " an improper petition to Allah, and was",
                " rebuked by Allah in response, he inunediately",
                " submitted: \"My Lord, I seek Your protection",
                " lest I should ask of You anything",
                " of which I have no knowledge.\" (Hud:",
                " 47) When the Prophet Moses commanded the",
                " children of Israel to sacrifice a cow,",
                " and they said that perhaps he was",
                " having a jest with them, he replied:",
                " \"I crave Allah's protection from behaving like",
                " ignorant people.\" (Al-Baqarah: 67)",
                "The same is",
                " the case with alI the acts of",
                " seeking refuge which have been reported in",
                " respect of the Holy Prophet (upon whom",
                " be peace) in the books of Hadith.",
                " For instance, consider the following prayers that",
                " the Holy Prophet made:",
                "Hadrat 'A'ishah has",
                " reported that the Holy Prophet (upon whom",
                " be peace) used to pray, saying: \"O",
                " God, I seek Your refuge from the",
                " evil of the works which I did",
                " and from the evil of the works",
                " which I did not do.\" (i.e. if",
                " I have done a wrong, I seek",
                " refuge from its evil results, and if.I",
                " have not done a work which I",
                " should have done, I seek refuge from",
                " the loss that 1 have incurred, or",
                " from that I should do what I",
                " should not do).\" (Muslim)",
                "Ibn Umar has",
                " reported that one of the supplications of",
                " the Holy Prophet (upon whom be peace)",
                " was to the effect: \"O God, i",
                " seek Your refuge front being deprived of",
                " a blessing that You have bestowed on",
                " me and front being deprived of the",
                " well-being that You have granted me and",
                " I seek refuge lest Your wrath should",
                " descend on me suddenly, and 1 seek",
                " refuge front every kind of Your displeasure.\"",
                " (Muslim)",
                "Zaid bin Arqam has reported that",
                " the Messenger Of Allah used to pray:",
                " \"O God, I seek Your refuge front",
                " the knowledge which is not beneficial, front",
                " the heart which dces not fear You,",
                " front me soul which is never satisfied,",
                " and front the prayer which is not",
                " answered.\" (Muslim)",
                "Hadrat Abu Hurairah has reported",
                " that the Holy Messenger used to pray:",
                " 'O God, I seek Your refuge from",
                " hunger, for it is a most evil",
                " thing with which one may have to",
                " pass a night, and I seek Your",
                " refuge from dishonesty, for it is sheer",
                " evil-mindedness.\" (Abu Da'ud).",
                "Hadrat Anas has reported",
                " that the Holy Prophet (upon whom be",
                " peace) used to pray: \"O God, I",
                " seek Your refuge from leprosy and madness",
                " and aII evil diseases.\" (Abu Da'ud).",
                "Hadrat",
                " 'A'ishah has reported that the Holy Prophet",
                " (upon whom be peace) used to pray",
                " in these words: \"O God, I seek",
                " Your refuge front the mischief of the",
                " fire and from the evil of affluence",
                " and poverty.\" (Tirmidhi, Abu Da'ud)",
                "Shakal bin",
                " Humaid requested the Holy Prophet (upon whom",
                " be peace) to teach him some prayer.",
                " He told hit' to say \"O God,",
                " I seek Your refuge front the evil",
                " of my hearing, from the evil of",
                " my sight, from the evil of lily",
                " tongue, from the evil of my heart,",
                " and front the evil of my lust,\"",
                " (Tirmidhi Abu Da'ud).",
                "Atlas bits Malik has",
                " reported that the Holy Prophet used to",
                " say: \"O God, I seek Your refuge",
                " from helplessness, indolence, cowardice, old age and",
                " stinginess, and I seek Your refuge from",
                " the torment of the grave and from",
                " the mischief of Iife and death, (and",
                " according to a tradition in Muslim also)",
                " from the burden of debt and that",
                " the people should overpower me. \" (Bukhari,",
                " Muslim),",
                "Khawla bint Hukaym Sulamiyyah says that",
                " she heard the Holy Prophet (upon whom",
                " be peace) as saying that the one",
                " who halts at a new stage (during",
                " the journey) and says: \"I seek refuge",
                " in the blameless Words of Allah from",
                " the evil of the creatures\", will not",
                " be caused .any harm until he departs",
                " from that stage. (Muslim)",
                "We have related",
                " these few prayers of the Holy Prophet",
                " (upon whom be peace) from the Hadith,",
                " which show that the believer should seek",
                " Allah's refuge from every danger and evil",
                " and not the refuge of anyone else,",
                " nor he should become self sufficient of",
                " Allah and place reliance only on himself.",
                "",
                "*3) The word used in the original",
                " is Rabbul- Falaq. Falaq actually means to",
                " split and to pierce through. A great",
                " majority of the commentators have taken it",
                " to mean bringing out the light of",
                " dawn by splitting the darkness of night,",
                " for in Arabic falaq as-subh is often",
                " used for the breaking of dawn, and",
                " in the Qur'an also the words :Faliq-ul-isbah",
                " (He Who causes the dawn to appear",
                " by splitting the darkness of night) have",
                " been used for Allah. (Al-An'am: 96). Another",
                " meaning of falaq also is to create,",
                " to bring into being, for everything created",
                " in the world appears by splitting something.",
                " All vegetation sprouts by splitting open the",
                " seed and the soil; all animals come",
                " out either from the womb of mother",
                " or by breaking open the egg, or",
                " some other obstruction. All springs gush out",
                " by splitting open the rock or soil.",
                " The day appears by piercing through the",
                " curtain of the night. The drops of",
                " rain pierce through the clouds and fall",
                " on the earth. In short, everything in",
                " the world comes into being as a",
                " result of breaking and splitting another thing;",
                " so much so that the earth and",
                " the heavens also in the beginning were",
                " one mass, then they were broken and",
                " parted. (Al-Anbiya': 30). Thus, according to this",
                " meaning the word falaq is common to",
                " all creations. Now, if the first meaning",
                " is adopted, the verse would mean: \"I",
                " seek refuge with the Lord of rising",
                " dawn\", and according to the second meaning,",
                " it would mean: \"I seek refuge with",
                " the Lord of all creation.\" Here the",
                " attribute of \"Rabb\" has been used for",
                " Allah instead of His proper Name, for",
                " Allah's attribute of being Rabb, i. e.",
                " Master, Sustainer and Providence, is more relevant",
                " to seeking and taking of His refuge.",
                " Then, if Rabbtrl-falaq implies Lord of the",
                " rising dawn, seeking His refuge would mean:",
                " \"I seek refuge with the Lord Who",
                " brings out the bright daylight from the",
                " darkness of night so that He may",
                " likewise bring well-being for me from all",
                " kinds of physical and psychical dangers.\" If",
                " it is taken to mean Rabb al-khalaq",
                " the meaning would be: \"1 seek refuge",
                " with the Lord of all creation, so",
                " that He may protect me from the",
                " evil of His creation.\""
            ]
        },
        {
            "verse-id": "[113:2]",
            "verse": "From the evil of that which He created",
            "description": [
                "In other words: \"I seek His refuge",
                " from the evil of all creatures.\" A",
                " few things in this sentence deserve consideration;",
                "",
                "First, that the creation of evil has",
                " not been attributed to Allah, but the",
                " creation of creatures has been attributed to",
                " Allah and of evil to the creatures.",
                " That is, it has not been said:",
                " \"I seek refuge from the evils that",
                " Allah has created\" but that \"I seek",
                " refuge from the evil of the things",
                " He has created.\" This shows that Allah",
                " has not created any creature for the",
                " sake of evil, but all His work",
                " is for the sake of good and",
                " a special purpose. However, from the qualities",
                " that He has created in the creatures",
                " to fulfil the purpose of their creation,",
                " sometimes evil appears from some kinds of",
                " creatures in most cases.",
                "Second, that even",
                " if this one sentence was given and",
                " no mention made of seeking Allah's refuge",
                " separately from the evils of some particular",
                " kinds of creatures in the following sentences,",
                " this one sentence alone would have sufficed",
                " to express the intent, for in it",
                " Allah's refuge has been sought from the",
                " evil of all creatures. After this general",
                " prayer for refuge making mention of seeking",
                " refuge from some particular evils by itself",
                " gives this meaning: \"Though I seek Allah's",
                " refuge from the evil of everything created",
                " by Allah, I stand in great need",
                " of Allah's refuge from the particular evils",
                " that have been mentioned in the remaining",
                " verses of Surah Al-Falaq and Surah An-Nas.\"",
                "",
                "Third, that the most suitable and effective",
                " prayer for seeking refuge from the evil",
                " of the creatures is that refuge should",
                " be sought with their Creator, for He",
                " is in any case dominant over His",
                " creatures and is aware of their evils,",
                " which we know, as well as of",
                " those which we do not know. Hence,",
                " His refuge is the refuge of the",
                " supreme Ruler Whom no power can fight",
                " and oppose, and with His refuge we",
                " can protect ourselves from every evil of",
                " every creature, whether we are aware of",
                " it or not. Moreover, this contains the",
                " prayer for refuge not only from the",
                " evils of the world but also from",
                " every evil of the Hereafter.",
                "Fourth, that",
                " the word sharr (evil) is used for",
                " loss, injury, trouble and affliction as well",
                " as for the means which cause losses",
                " and injuries and afflictions; for example, hunger,",
                " disease, injury in accident or war, being",
                " burnt by fire, being stung or bitten",
                " by a scorpion or snake, being involved",
                " in the grief of children's death and",
                " similar other evils which are evils in",
                " the first sense, for they are by",
                " themselves troubles and afflictions. Contrary to this,",
                " unbelief, polytheism and every kind of sin",
                " and wickedness, for instance, are evils in",
                " the second sense, for they cause loss",
                " and affliction, although apparently they do not",
                " cause any trouble at the moment, rather",
                " some sins give pleasure and bring profit.",
                " Thus, seeking refuge from evil comprehends both",
                " these meanings.",
                "Fifth, that seeking refuge from",
                " evil contains two other meanings also. First,",
                " that tnan is praying to his God",
                " to protect him from the evil that",
                " has already taken place; second, that man",
                " is praying to his God to protect",
                " him from the evil that has not",
                " yet taken place."
            ]
        },
        {
            "verse-id": "[113:3]",
            "verse": "And from the evil of darkness when it settles",
            "description": [
                "After seeking Allah's refuge generally from the",
                " evil of the creatures, now prayer is",
                " being taught for seeking refuge from the",
                " evil of some special creatures in particular.",
                " The word ghasiq in the verse literally",
                " means dark. Thus, at another place in",
                " the Qur'an it has been said: \"establish",
                " the salat from the declining of the",
                " sun to the darkness of the night",
                " (ila ghasaq-il- lain.\" (Bani lsra'il: 78), and",
                " wagab means to enter or to overspread.",
                " Prayer has been taught to seek refuge",
                " in particular from the evil of the",
                " darkness of night, for most of the",
                " crimes and acts of wickedness are committed",
                " at night, harmful animals also come out",
                " at night, and the night was a",
                " very dreadful thing in the days chaos",
                " prevailed in Arabia when these verses were",
                " revealed. Raiders came out in the dark",
                " of night and plundered and destroyed settlements.",
                " The people who were thinking of putting",
                " the Holy Prophet (upon whom be peace)",
                " to death, also made their secret plans",
                " at night, so that the murder could",
                " not be detected. Therefore, command was given",
                " to seek Allah's refuge from the evils",
                " and calamities which descend at night. Here,",
                " the subtle relation that exists between seeking",
                " refuge from the evil of the dark",
                " night with the Lord of breaking dawn",
                " cannot remain hidden from anybody having insight",
                " and understanding.",
                "A difficulty is confronted in",
                " the explanation of this verse' in view",
                " of several authentic traditions. Hadrat `A'ishah has",
                " reported: \"Once during a moon-lit night, the",
                " Holy Prophet (upon whom be peace) look",
                " hold of my hand and pointing to",
                " the moon said: `Seek Allah's refuge, for",
                " this is al ghasiq idha wagab'. (Tirmidhi,",
                " Ahmad, Nasa'i, lbn Jarir, Ibn al-Mundhir, Hakim,",
                " Ibn Marduyah). To explain this some scholars",
                " said that idha wagab here means idha",
                " khasaf, i. e. when the moon is",
                " eclipsed. But in no tradition has it",
                " been mentioned that when the Holy Prophet",
                " pointed to the moon, it was in",
                " eclipse. In the Arabic lexicon also idha",
                " wagab cannot mean idha khalaf. In our",
                " opinion the correct explanation of this Hadith",
                " is that since the moon rises in",
                " the night (in the daytime it does",
                " not shine even if it is there",
                " in the sky), what the Holy Prophet",
                " meant was this: 'Seek God's refuge from",
                " the night, the time when it (the",
                " moon) appears, for the light of the",
                " moon is not as helpful for the",
                " one who resists as for the one",
                " who attacks, and not as helpful for",
                " the victim of the crime as for",
                " the culprit.' On this very basis the",
                " Holy Prophet (upon whom be peace) is",
                " reported to have said: \"When the sun",
                " has set, devils scatter on every side.",
                " Therefore, gather your children together in the",
                " house and keep your animals tied down",
                " until the darkness of night disappears.\""
            ]
        },
        {
            "verse-id": "[113:4]",
            "verse": "And from the evil of the blowers in knots",
            "description": [
                "The word ' uqad in naffathat frl-'eqad",
                " is plural of 'uqdah, which means a",
                " knot that is tied on a string",
                " or piece of thread. Nafath means to",
                " blow. Naftathat is plural of naffathah, which",
                " may mean the men who blow much,",
                " and if taken as a feminine gender,",
                " women who blow much; it may as",
                " well relate to nufus (human beings) or",
                " to jama ats (groups of men), for",
                " both nafas and jama 'at are grammatically",
                " feminine. Blowing upon knots, according to most,",
                " rather all, comentators implies magic, for the",
                " magicians usually tie knots on a string",
                " or thread and blow upon them as",
                " they do so. Thus, the verse means:",
                " \"I seek refuge with the Lord of",
                " rising dawn from the evil of magicians,",
                " male and female.\" This meaning is also",
                " supported by the traditions which show that",
                " when magic was worked on the Holy",
                " Prophet (upon whom be peace), Gabriel (peace",
                " be on him) had come and taught",
                " hint to recite the Mu awwidhatayn, and",
                " in the Mu'awwidhatayn this is the only",
                " sentence which relates directly to magic. Abu",
                " Muslim Isfahani and Zamakhshari have given another",
                " meaning also of naffathat fil-'uqad, which is",
                " that it implies the deceitfulness of women",
                " and their influencing men's resolutions, views and",
                " ideas and this has been compared to",
                " a magic spell, for in the love",
                " of women man starts behaving as if",
                " he was under a spell. Though this",
                " explanation is interesting, it runs counter to",
                " the commentary given by the earliest scholars;",
                " and it also does not correspond to",
                " the conditions in which the Mu awwidhatayn",
                " were sent down as we have shown",
                " in the Introduction.",
                "About magic one should",
                " know that in it since help is",
                " sought of the satans and evil spirits",
                " or stars to influence the other person",
                " evilly, it has been called kufr (unbelief)",
                " in the Qur'an: \"Solomon was not involved",
                " in kufr but the satans who taught",
                " tragic to the people.\" (AI-Baqarah: 102). But",
                " even if it dces not contain any",
                " word of kufr, or any polytheistic element,",
                " it is forbidden and unlawful and the",
                " Holy Prophet (upon whom be peace) has",
                " counted it among the seven heinous sins",
                " which ruin the Hereafter of man. In",
                " Bukhari and Muslim a tradition has been",
                " related from Hadrat Abu Hurairah, saying that",
                " the Holy Prophet (upon whom be peace)",
                " said: \"Avoid seven deadly sins: associating another",
                " with Allah, magic, killing a soul, which",
                " AIIah has forbidden unjustly, devouring interest, eating",
                " the orphan's property, fleeing from the enemy",
                " in the battlefield, and slandering simple and",
                " chaste Muslim women with un-chastity.\""
            ]
        },
        {
            "verse-id": "[113:5]",
            "verse": "And from the evil of an envier when he envies.\"",
            "description": [
                "Hasad means that a person should feel",
                " unhappy at the better fortune, superiority or",
                " good quality that Allah has granted to",
                " another, and should wish that it should",
                " be taken away from the other person",
                " and given to him, or at least",
                " the other one should be deprived of",
                " it. However, hasad does not mean that",
                " a person should wish that he too",
                " should be blessed with the bounty that",
                " the other one has been blessed with.",
                " Here, Allah's refuge has been sought from",
                " the evil of the jealous one when",
                " he feels jealous, and takes a practical",
                " step with word or deed to satisfy",
                " his heart. For until he takes a",
                " practical step, his being unhappy may by",
                " itself be bad but it is not",
                " an evil for the other person so",
                " that he may seek refuge from it.",
                " When such an evil appears from a",
                " jealous person the best thing would be",
                " to seek Allah's refuge from it. Besides",
                " this, there are a few other things",
                " also which are helpful for obtaining immunity",
                " from the evil of the jealous person.",
                " First, that one should have trust in",
                " AIIah and the faith that unless AIIah",
                " so wills no one can harm him",
                " in any way. Second, that one should",
                " have patience over what the jealous person",
                " says and dces and should not start",
                " behaving impatiently so as to be degraded",
                " morally to the level of the jealous",
                " person. Third, that one should in any",
                " case maintain dignity and practise piety even",
                " if the jealous person behaves frivolously, being",
                " fearless of God and shameless of the",
                " people. Fourth, that one should free one's",
                " mind of every thought about the jealous",
                " person and should disregard him altogether, for",
                " making him a subject of one's thought",
                " is a prelude to being influenced by",
                " him. Fifth, that one should do the",
                " jealous person a good turn as and",
                " when one can, not to speak of",
                " treating him evilly, no matter whether this",
                " good behaviour mitigates his jealousy or not.",
                " Sixth, that one should understand rightly and",
                " remain steadfast to the doctrine of Tauhid",
                " for the heart which enshrines Tauhid, cannot",
                " be affected by anyone else's fear except",
                " the fear of Allah."
            ]
        }
    ]
}