{
    "name": "An-Nas",
    "verse-count": 6,
    "verse-info": [
        {
            "id": "[114:1]",
            "verse": "Say, \"I seek refuge in the Lord of mankind,",
            "description": [
                ""
            ]
        },
        {
            "id": "[114:2]",
            "verse": "The Sovereign of mankind.",
            "description": [
                ""
            ]
        },
        {
            "id": "[114:3]",
            "verse": "The God of mankind,",
            "description": [
                "Here also, as in Surah Al-Falaq, instead",
                " of saying A'udhu-billahi (I seek Allah's refuge),",
                " a prayer has beat taught to seek",
                " Allah's refuge by reference to His throe",
                " attributes: first, that He is Rabb-un nas,",
                " i.e. Sustainer, Providence and Master of all",
                " mankind; third, that He is Ilah-un-nas, i.e.",
                " real Deity of all mankind, (Here, one",
                " should clearly understand that the word ilah",
                " has been used in two meanings in",
                " the Qur'an: first for the thing or",
                " person who is practically being worshipped although",
                " it or he is not entitled to",
                " worship; second, for Him Who is '",
                " entitled to worship, Who is in fact",
                " the Deity whether the people worship Him",
                " or not, wherever this word is used",
                " for Allah; it has been used in",
                " the second meaning). Seeking refuge by means",
                " of these throe attributes means: \"I seek",
                " refuge with that God, Who being the",
                " Sustainer, King and Deity of men, has",
                " full power over them, can fully protect",
                " them and can really save them from",
                " the evil, to save myself and others",
                " from which 1 am seeking His refuge.",
                " Not only this: since He alone is",
                " Sustainer, King and Deity, therefore, there is",
                " no one beside Him with Whom I",
                " may seek refuge and he may give",
                " real refuge.\""
            ]
        },
        {
            "id": "[114:4]",
            "verse": "From the evil of the retreating whisperer -",
            "description": [
                "The word waswas in waswas-il-khannas means the",
                " one who whispers over and over again,",
                " and waswasa means to whisper into someone's",
                " heart an evil suggestion over and over",
                " again in such a way or ways",
                " that the one who is being inspired",
                " may not feel that the whisperer is",
                " whispering an evil suggestion into his heart.",
                " Waswasah by itself suggests repetition just as",
                " zalzalah contains the meaning of repetitive movement.",
                " Since man is not tempted by just",
                " one attempt but effort has to be",
                " made over and over again to seduce",
                " and tempt him, such aII attempt is",
                " called waswasah and the tempter waswas. As",
                " for the word khannas, it is derived",
                " from khunus, which means to hide after",
                " appearing and to retreat after coming into",
                " view. Since khannas is the intensive form,",
                " it would imply the one who behaves",
                " thus very frequently. Now, obviously the whisperer",
                " has to approach man for whispering again",
                " and again, and besides, when he is",
                " also described as khannas, the combination of",
                " the two words by 'itself gives the",
                " meaning that after whispering once he retreats",
                " and then again returns over and over",
                " again to repeat the act of whispering.",
                " In other words, when once he fails",
                " in his attempt to whisper evil, he",
                " withdraws, then he again returns to make",
                " the second and the third and the",
                " next attempt over and over again.",
                "After",
                " understanding the meaning of waswas-il-khannas, let us",
                " consider what is meant by seeking refuge",
                " from its evil. Its one meaning is",
                " that the seeker after refuge himself seeks",
                " God's refuge from its evil, i.e. from",
                " the evil lest it should whisper some",
                " evil suggestion into his own heart. The",
                " second meaning is that the caller to",
                " Truth seeks God's refuge from the evil",
                " of the one who whispers evil suggestions",
                " into the hearts of the people against",
                " himself. It is not in his own",
                " power to approach aII the people in",
                " whose hearts evil suggestions are being whispered",
                " against himself individually and remove the misunderstandings",
                " of every person. It is also not",
                " right and proper for him that he",
                " should give up his mission of inviting",
                " others to AIlah and should devote aII",
                " his tune and energy to removing the",
                " misunderstanding created by the whisperer and to",
                " answering their accusations. It is also below",
                " his dignity that he should stoop to",
                " the level of his opponents. Therefore, Allah",
                " has instructed the caller to Truth to",
                " seek only His refuge from the evil",
                " of the wicked people, and then to",
                " attend single-mindedly to his work of invitation",
                " and mission. For it is not for",
                " him to deal with them but for",
                " Allah, who is Sustainer of men, King",
                " of,men, God of men.",
                "Here, one should",
                " also understand that an evil suggestion is",
                " the starting , point of evil act.",
                " When it affects a careless or heedless",
                " person, it creates in him a desire",
                " for evil. Then, further whisperings change the",
                " evil desire into an evil intention and",
                " evil purpose. When the evil suggestion grows",
                " in intensity, the intention becomes a resolution,",
                " which then culminates in the evil act.",
                " Therefore, the meaning of seeking God's refuge",
                " from the evil of the whisperer is",
                " that Allah should nip the evil in",
                " the bud.",
                "If seen from another aspect,",
                " the order of the evil of the",
                " whisperers seems to be this: first. they",
                " incite one to open unbelief, polytheism, or",
                " rebellion against AIIah and His Messenger, and",
                " enmity of the righteous (godly) people. If",
                " they fail in this and a person",
                " dces enter Allah's religion, they misguide him",
                " to some innovation. If they fail in",
                " this too, they tempt him to sin.",
                " If they do not succeed even in",
                " this, they inspire the tnan with the",
                " suggestion that there is no haran in",
                " indulging in minor sins, so that if",
                " he starts committing these freely, he is",
                " over burdened with sin. If one escapes",
                " from this too, in the last resort",
                " they try that one should keep the",
                " true religion confined to oneself, and should",
                " do nothing to make it prevail, but",
                " if a person defeats all these plans,",
                " the whole party of the devils froth",
                " among men and jinn makes a common",
                " front against him incites and stirs up",
                " the people and makes them shower him",
                " with invective and accusation and slander, and",
                " defames him as widely as it can.",
                " Then, Satan comes to the believer and",
                " excites hisn to anger, saying: \"It is",
                " cowardly of you to have borne aII",
                " this insult: arise and clash with your",
                " opponents.\" This is the last and final",
                " device with Satan by which he tries",
                " to thwart the struggle of the caller",
                " to Truth and entangle him in difficulties",
                " and obstructions. If he succeeds in escaping",
                " from this too, Satan becomes powerless before",
                " him. About this same thing it has",
                " been said in the Qur'an: \"If Satan",
                " ever excites you to anger, seek refuge",
                " with Allah.\" (Al-A`raf: 200, Ha Mim As-Sajdah:",
                " 36); \"Say: Lord, I seek refuge with",
                " You from the promptings of satans.\" (Al-Mu'minun:",
                " 97); \"The fact is that if ever",
                " an evil suggestion from Satan so much",
                " as touches those, who are God-fearing people,",
                " they immediately get alerted and clearly see",
                " the right course they should adopt.\" (AI-A`raf:",
                " 201). And on this very basis about",
                " the people who escape from this last",
                " attack of Satan Allah says: \"None can",
                " attain to this rank except those who",
                " are men of great good fortune.\" (Ha",
                " Mim As-Sajdah: 35).",
                "In this connection, another",
                " thing also should be kept in mind,",
                " and it is this: EviL suggestion is",
                " not whispered into the heart of man",
                " only from outside by the satans from",
                " among men and jinn, but also by",
                " the self of man from within. His",
                " own wrong theories misguide his intellect, his",
                " own unlawful motives and desires lead his",
                " power of discrimination, will and power of",
                " judgement astray, and it is not only",
                " the satans from outside but within tnan",
                " his satan of the self also beguiles",
                " him. This same thing has been expressed",
                " in the Qur'an, thus: \"and We know",
                " the evil suggestions arising from his self.\"",
                " (Qaf : 16). On this very basis,",
                " the Holy Prophet (upon whom be peace)",
                " in his well-known Sermon said: \"We seek",
                " Allah's refuge from the evils of our",
                " self.\""
            ]
        },
        {
            "id": "[114:5]",
            "verse": "Who whispers [evil] into the breasts of mankind -",
            "description": [
                ""
            ]
        },
        {
            "id": "[114:6]",
            "verse": "From among the jinn and mankind.\"",
            "description": [
                "According to some scholars, these words mean",
                " that the whisperer whispers evil into the",
                " hearts of two kinds of people: the",
                " jinn and the men. If this meaning",
                " is admitted, the word nas would apply",
                " to both jinn and men. They say",
                " that this can be so, for when",
                " the word rijali (men) in the Qur'an",
                " has been used for the jinn, as",
                " in Al-Jinn: 6, and when nafar can",
                " be used for the group of jinn,",
                " as in A1-Ahqaf: 29, men and jinn",
                " both can be included metaphorically in the",
                " word nas also. But this view is",
                " wrong because the words nas, ins and",
                " ihsan are even lexically contrary in meaning",
                " to the word jinn. The actual meanutg",
                " of jinn is hidden creation and jinn",
                " is called jinn because he is hidden",
                " from man's eye. On the contrary, the",
                " words nas and ins are spoken for",
                " insan (man) only on the basis that",
                " he is manifest and visible and perceptible.",
                " In Surah Al-Qasas: 29, the word anasa",
                " has been used in the meaning of",
                " ra a, i.e. \"the Prophet Moses saw",
                " a fire in the direction of Tur.",
                " \" In Surah An-Nisa': 6, the word",
                " anastum has been used in the meaning",
                " of ahsastum or ra aytum (i.e. if",
                " you perceive or see that the orphans",
                " have become capable). Therefore, nas canot apply",
                " to jinn lexically, and the correct meaning",
                " of the verse is: \"from the evil",
                " of the whisperer who whispers evil into",
                " the hearts of men, whether he be",
                " from among the jinn or from the",
                " men themselves.\" In other words, whispering of",
                " evil is done by devils from among",
                " jinn as well as by devils from",
                " among rnen and the prayer in this",
                " Surah has been taught to seek refuge",
                " from the evil of both. This meaning",
                " is supported by the Qur'an as well",
                " as by the Hadith. The Qur'an says:",
                " \"And so it has always been that",
                " We set against every Prophet enemies from",
                " among devils of men and devils of",
                " jinn, who have been inspiring one another",
                " with charming things to delude the minds.\"",
                " (Al-An'am :112)",
                "And in the Hadith, lmam",
                " Ahmad, Nasa'i, and Ibn Hibban have related",
                " on the authority of Hadrat Abu Dharr",
                " a tradition, saying: \"I sat before the",
                " Holy Prophet (upon whom be peace), who",
                " was in the Mosque. He said: Abu",
                " Dharr, have you performed the Prayer? I",
                " replied in the negative. He said: Arise",
                " and perform the Prayer. So, I performed",
                " the Prayer. The Holy Prophet said: O",
                " Abu Dharr, seek Allah's refuge from the",
                " devils of men and the devils of",
                " jinn. I asked. are there devils among",
                " rnen also? O Messenger of Allah! He",
                " replied: Yes.\""
            ]
        }
    ]
}