{
    "name": "Yusuf",
    "verse-count": 111,
    "verse-info": [
        {
            "id": "[12:1]",
            "verse": "Alif, Lam, Ra. These are the verses of the clear Book.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:2]",
            "verse": "Indeed, We have sent it down as an Arabic Qur'an that you might understand.",
            "description": [
                "The Arabic word (Qur`an: \"to read\") is",
                " originally the infinitive form of the verb",
                " When the infinitive form of a verb",
                " in Arabic is used as a name,",
                " it implies that that thing (or person)",
                " possesses the characteristics in their perfection. This",
                " Book has been named \"Qur'an\" to indicate",
                " that it is meant to be read",
                " by all and sundry and is to",
                " be read often and over and over",
                " again.",
                "*2) This does not mean that",
                " this Book has been sent down exclusively",
                " for the Arabs. What it means is",
                " only this: \"Of all the people, O",
                " Arabs, you should understand the excellences of",
                " the Qur'an, which are a sure proof",
                " of its being Divine Revelation, for it",
                " is in your own language and you",
                " have no excuse to put forward that",
                " it is in a foreign language which",
                " you do not understand. \"",
                "Some people",
                " wrongly infer from this verse that this",
                " Book had been sent down for the",
                " Arabs and not for the non-Arabs; therefore,",
                " they assert, it cannot be claimed that",
                " it is the Guidance for the whole",
                " mankind. But obviously this is a frivolous",
                " objection raised by hose who do not",
                " understand its real significance. It is obvious",
                " that a book, though meant for universal",
                " guidance, will necessarily have to be put",
                " in words in some language so that",
                " the people speaking that language should understand",
                " its teachings and then become the means",
                " of conveying its guidance to other peoples.",
                " This is the only natural way of",
                " spreading the message of a movement on",
                " a universal scale."
            ]
        },
        {
            "id": "[12:3]",
            "verse": "We relate to you, [O Muhammad], the best of stories in what We have revealed to you of this Qur'an although you were, before it, among the unaware.",
            "description": [
                "This was to impress indirectly on the",
                " unbelievers of Makkah the fact that the",
                " Messenger did not know anything about the",
                " story of the settlement of the Israelites",
                " in Egypt, but was being informed of",
                " this by Revelation from Allah. This introduction",
                " was necessary because, as has been stated",
                " in the preface to this Surah, the",
                " disbelievers had put an abrupt question concerning",
                " this matter in order to \"expose\" the",
                " Holy Prophet by this test. The answer",
                " is to this effect: \"Tell them, O",
                " Muhammad, that, though you did not know",
                " anything about the settlement of the Israelites",
                " in Egypt before this, you have now",
                " received a Revelation about this from Us.\"",
                ""
            ]
        },
        {
            "id": "[12:4]",
            "verse": "[Of these stories mention] when Joseph said to his father, \"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:5]",
            "verse": "He said, \"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.",
            "description": [
                "As the meanings of the dream were",
                " quite obvious, Prophet Jacob had a genuine",
                " fear that Joseph's ten step-brothers would become",
                " all the more envious of him when",
                " they would hear this: So he warned",
                " his righteous son not to mention his",
                " dream to his brothers, for he knew",
                " that those sons of his did not",
                " bear the moral character worthy of the",
                " sons of a Prophet, and, therefore, they",
                " were up to any evil design against",
                " him out of mere envy. As regards",
                " the dream, the \"sun\" in it was",
                " Prophet Jacob, the \"moon\" his wife, (Prophet",
                " Joseph's step-mother) and the \"eleven stars\" his",
                " eleven brothers."
            ]
        },
        {
            "id": "[12:6]",
            "verse": "And thus will your Lord choose you and teach you the interpretation of narratives and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise.\"",
            "description": [
                "That is, \"Bless him with Prophethood.\"",
                "*6)",
                " The Arabic words of the Text do",
                " not mean merely \"the interpretation of dreams\",",
                " as has been generally understood. They are",
                " comprehensive and imply also this: \"Allah will",
                " bless you with the full understanding of",
                " the problems of life and their solutions",
                " and will give you the insight to",
                " reach at the reality of every matter.\"",
                "",
                "*7) Here it should be noted that",
                " the response of Prophet Jacob to the",
                " dream of Prophet Joseph, according to the",
                " Bible and the Talmud, was quite different",
                " froth this: \"And he told it to",
                " his father, and to his brethren: and",
                " his father rebuked him, and said unto",
                " him, What is this dream that thou",
                " hast dreamed? Shall I and thy mother",
                " and thy brethren indeed come to bow",
                " down ourselves to thee to the earth?\"",
                " (Gen. 37: 10). Even a little thinking",
                " will help one to arrive at the",
                " conclusion that his reaction as narrated in",
                " the Qur'an is worthy of the high",
                " character of Prophet Jacob and not the",
                " one found in the Bible and the",
                " Talmud. For Prophet Joseph had not expressed",
                " any personal ambition of his but merely",
                " narrated Iris dream. If the dream was",
                " a true one, and it is obvious",
                " that Prophet Jacob interpreted it, believing it",
                " to be true, there was no reason",
                " why he should rebuke his own son,",
                " for it meant that it was the",
                " will of God and no his own",
                " ambition that he should one day rise",
                " to a high rank. Can then one",
                " expect from any reasonable person, not to",
                " mention a Prophet, that he would take",
                " it ill and rebuke the one who",
                " dreamed such a dream? And can there",
                " ever be such a noble \"father\" who",
                " would say bitter and stinging things to",
                " his own son for the \"sin\" of",
                " telling him a true dream, prophesying his",
                " future greatness?"
            ]
        },
        {
            "id": "[12:7]",
            "verse": "Certainly were there in Joseph and his brothers signs for those who ask,",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:8]",
            "verse": "When they said, \"Joseph and his brother are more beloved to our father than we, while we are a clan. Indeed, our father is in clear error.",
            "description": [
                "This brother was Benjamin. He was the",
                " real younger brother of Prophet Joseph, and",
                " was his junior by many years. Their",
                " mother had died at the birth of",
                " Benjamin. That is why Prophet Jacob paid",
                " special attention to these two motherless children.",
                " Besides, Joseph was the only son, in",
                " whom he had discerned signs of righteousness",
                " and capabilities. Accordingly, when Prophet Joseph narrated",
                " his dream to him, he was all",
                " the more convinced of his future greatness,",
                " and was perturbed at the idea lest",
                " his brothers conspired against him out of",
                " envy, if they came to know of",
                " his dream, which was self-explanatory. For Prophet",
                " Jacob knew that his other ten sons",
                " were not of the right type, and",
                " this was proved by the subsequent events.",
                " Therefore, naturally he was not happy with",
                " them. It is, however, strange that the",
                " Bible gives a different reason for the",
                " envy his brothers bore against Prophet Joseph.",
                " They were filled with envy against him",
                " because \"Joseph gave unto his father their",
                " evil report.\"",
                "*9) In order to grasp",
                " the full significance of the \"grievance\" the",
                " ten sons had against their father for",
                " \"neglecting\" them, we should keep in view",
                " the conditions of the clannish life. As",
                " there was no established state, each clan",
                " led its own independent life side by",
                " side with other clans. It is abvious",
                " that the power of the head of",
                " the clan depended entirely on the number",
                " of sons and grand-sons, and brothers and",
                " nephews he had to defend the life,",
                " honour and property of the family. Therefore,",
                " the one leading the clannish life naturally",
                " paid more attention to one's own grown",
                " up sons, etc., than to children and",
                " women of the family. As Prophet Jacob",
                " was leading clannish life, these sons of",
                " his expected a preferential treatment from him,",
                " but the Prophet thought otherwise. So they",
                " remarked, \"Truly our father seems to have",
                " lost his balance of mind; otherwise he",
                " could not have neglected us, and loved",
                " our two younger brothers more than us,",
                " for we are strong young men and",
                " can stand him in good stead at",
                " the time of need while these youngsters",
                " are useless as they themselves stand in",
                " need of protection. \""
            ]
        },
        {
            "id": "[12:9]",
            "verse": "Kill Joseph or cast him out to [another] land; the countenance of your father will [then] be only for you, and you will be after that a righteous people.\"",
            "description": [
                "This sentence depicts the true psychology of",
                " those people who give themselves up to",
                " the lusts of their hearts, and, at",
                " the same time, do not want to",
                " break away completely from faith and religion.",
                " This is how a person of this",
                " type behaves. Whenever he is tempted to",
                " do a certain evil thing, he makes",
                " up his mind to do it first",
                " and puts off the demands of his",
                " faith for the time-being. And if his",
                " conscience pricks him, he tries to soothe",
                " it, saying, \"Have a little patience. Let",
                " me first do this evil thing, which",
                " is an obstacle in my way. Then",
                " I will repent and become as good",
                " as Thou desirest to see me.\" As",
                " the brothers of Prophet Joseph belonged to",
                " this type, they soothed their pricking consciences,",
                " saying, \"After doing away with Joseph, who",
                " is the chief obstacle in our way,",
                " we will again become righteous.\""
            ]
        },
        {
            "id": "[12:10]",
            "verse": "Said a speaker among them, \"Do not kill Joseph but throw him into the bottom of the well; some travelers will pick him up - if you would do [something].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:11]",
            "verse": "They said, \"O our father, why do you not entrust us with Joseph while indeed, we are to him sincere counselors?",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:12]",
            "verse": "Send him with us tomorrow that he may eat well and play. And indeed, we will be his guardians.",
            "description": [
                "In this thing also the Qur'an differs",
                " from the Bible and the Talmud, according",
                " to which it was not the brothers,",
                " who requested their father to send Joseph",
                " with them but Prophet Jacob himself sent",
                " him with an errand to Shechem, where",
                " they were feeding their father's flocks. Obviously",
                " the version of the Qur'an is more",
                " realistic, for Prophet Jacob could never have",
                " thought of sending his beloved son with",
                " there, because he knew it full well",
                " that they were envious of hue, and",
                " sending him there would have been sending",
                " Joseph deliberately into the jaws of death.",
                ""
            ]
        },
        {
            "id": "[12:13]",
            "verse": "[Jacob] said, \"Indeed, it saddens me that you should take him, and I fear that a wolf would eat him while you are of him unaware.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:14]",
            "verse": "They said, \"If a wolf should eat him while we are a [strong] clan, indeed, we would then be losers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:15]",
            "verse": "So when they took him [out] and agreed to put him into the bottom of the well... But We inspired to him, \"You will surely inform them [someday] about this affair of theirs while they do not perceive [your identity].\"",
            "description": [
                "The Arabic words (\"they do not understand\"",
                " ) may very appropriately mean three things.",
                " First, \"We were comforting Joseph, and his",
                " brothers were quite unaware of this that",
                " a Revelation was being sent to him.\"",
                " Second, \"You will Iet them know of",
                " this evil act of theirs in such",
                " circumstances that they can never even imagine",
                " you to be there.\" Third, \"Today they",
                " are committing an evil act, but they",
                " do not know its future consequences.\"",
                "There",
                " is no mention of this in the",
                " Bible and the Talmud that Allah sent",
                " a Revelation to comfort Prophet Joseph at",
                " that time of his affliction. On the",
                " contrary, the Talmud says that when he",
                " was thrown into the well, Prophet Joseph",
                " wept and cried aloud and implored his",
                " brothers for mercy, as if he was",
                " no better than any other lad of",
                " the desert, who would weep and cry",
                " if he were to be thrown into",
                " a well. But the picture the Qur'an",
                " depicts is that of a young man,",
                " who is destined to play the part",
                " of a great personality in history."
            ]
        },
        {
            "id": "[12:16]",
            "verse": "And they came to their father at night, weeping.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:17]",
            "verse": "They said, \"O our father, indeed we went racing each other and left Joseph with our possessions, and a wolf ate him. But you would not believe us, even if we were truthful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:18]",
            "verse": "And they brought upon his shirt false blood. [Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. And Allah is the one sought for help against that which you describe.\"",
            "description": [
                "The literal meaning of \"good patience\" which",
                " implies a patience that enables one to",
                " endure all kinds of troubles and afflictions",
                " in a calm, self-possessed and unrepining manner,",
                " without complaining or crying or weeping, as",
                " is worthy of great minds.",
                "*14) Prophet",
                " Jacob's reaction to the news of Joseph's",
                " death, as depicted in the Qur'an, is",
                " also different from that given in the",
                " Bible and the Talmud. According to them",
                " he was upset by the sad news",
                " and behaved like an ordinary father. The",
                " Bible says, \"And Jacob rent his clothes,",
                " and put sackcloth upon his loins. And",
                " mourned for his son many days.\" (Gen.",
                " 37: 34). And the Talmud says that",
                " at the sad news Jacob gave himself",
                " up to the abandonment of grief, and",
                " lay with his face to the ground....",
                " and refused to be comforted, and cried,",
                " 'Some wild beast has devoured Joseph and",
                " I shall never see him more'; and",
                " he mourned for Joseph for many years.",
                " (The Talmud, H. Polano, pp. 78, 79).",
                "",
                "When we contrast this picture with the",
                " one depicted in the Qur'an, we clearly",
                " see that the Qur'anic picture is that",
                " of a dignified and great personality. He",
                " is not upset in the least at",
                " hearing the sad news of his beloved",
                " son but at once gets to the",
                " bottom of the matter, and tells the",
                " envious brothers, \"Your tale is false and",
                " fabricated.\" Then he shows \"good patience\" as",
                " a Prophet should and puts his trust",
                " in the help of God."
            ]
        },
        {
            "id": "[12:19]",
            "verse": "And there came a company of travelers; then they sent their water drawer, and he let down his bucket. He said, \"Good news! Here is a boy.\" And they concealed him, [taking him] as merchandise; and Allah was knowing of what they did.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:20]",
            "verse": "And they sold him for a reduced price - a few dirhams - and they were, concerning him, of those content with little.",
            "description": [
                "Though the matter of the disposal of",
                " Prophet Joseph by his brothers was simple,",
                " the Bible has made this very complicated.",
                " It is obvious that the brothers threw",
                " Joseph into the well and went away.",
                " Afterwards a caravan came there and pulled",
                " him out and carried him to Egypt",
                " where they sold him. But the Bible",
                " says that the brothers cast him into",
                " a pit: then a company of Ishmaelites",
                " came there and they agreed to sell",
                " him to them. But in the meantime",
                " the Midianite merchantmen had drawn and lifted",
                " up Joseph and sold him to the",
                " Ishmaelites who brought him into Egypt. (Gen.",
                " 37: 25-28). But the authors of the",
                " Bible forget this sale transaction and further",
                " on in v. 36 say that Prophet",
                " Joseph was sold in Egypt by the",
                " Midianites and not by the Ishmaelites as",
                " stated in v. 28. But the Talmudic",
                " version of the matter is a little",
                " different from this. It says that the",
                " Midianites drew Joseph up from the pit",
                " and carried him along with them. As",
                " they passed by, the sons of Jacob",
                " saw Joseph with them and accused them",
                " of stealing their slave. At this a",
                " furious quarrel arose and they were ready",
                " to enter upon a bloody fray. But",
                " a bargain was concluded and the sons",
                " of Jacob sold their brother to the",
                " Midianites for twenty pieces of silver, who",
                " afterwards sold him to the Ishmaelites for",
                " the same amount. Then the Ishmaelites took",
                " him into Egypt and sold him there.",
                " Incidentally, it is this Talmudic version that",
                " has given rise to the tradition among",
                " the Muslims that the brothers of Joseph",
                " had sold him. But it should be",
                " noted that the Qur'an does not confirm",
                " this tradition."
            ]
        },
        {
            "id": "[12:21]",
            "verse": "And the one from Egypt who bought him said to his wife, \"Make his residence comfortable. Perhaps he will benefit us, or we will adopt him as a son.\" And thus, We established Joseph in the land that We might teach him the interpretation of events. And Allah is predominant over His affair, but most of the people do not know.",
            "description": [
                "According to the Bible his name was",
                " Potiphar. But the Qur'an mentions him merely",
                " by the title (AI-'Aziz). As the Qur'an",
                " uses the same title for Prophet Joseph,",
                " when he rose to a high rank,",
                " it appears that the person held a",
                " high office or rank in Egypt, for",
                " the word (`Aziz) stands for a powerful",
                " person who cannot be opposed and disobeyed.",
                " The Bible and the Talmud say that",
                " he was an officer of Pharaoh's body",
                " guards and captain of the guard. And",
                " according to a tradition from Hadrat Ibn",
                " `Abbas, related by Ibn Jarir, he was",
                " the officer of the royal treasury.",
                "*17)",
                " According to the Talmud the name of",
                " his wife was Zelicha and she is",
                " known by the same name in the",
                " Muslim traditions. As regards the other tradition",
                " among the Muslims that Prophet Joseph married",
                " her afterwards, it is neither based on",
                " the Qur'an nor on the history of",
                " the Israelites. And the fact is that",
                " it is below the dignity of a",
                " Prophet to have married such a woman",
                " about whom he had personal knowledge that",
                " she was of a bad character. And",
                " this opinion is confirmed by this general",
                " statement of the Qur'an: \"Women of bad",
                " character are for men of bad character",
                " and men of bad character are for",
                " women of bad character. And the women",
                " of pure character are for men of",
                " pure character, and the men of pure",
                " character for the women of pure character....",
                " \" (XXIV : 26. )",
                "*18) The",
                " fact that Potiphar had a very high",
                " opinion of Prophet Joseph from the very",
                " beginning is also confirmed by the Talmud",
                " and the Bible. The Talmud says that",
                " at this time Joseph was about eighteen",
                " years of age (and) Potiphar was very",
                " favourably impressed with his bearing and appearance.",
                " So he came to the conclusion that",
                " he belonged to some noble family and",
                " had been made a slave by the",
                " force of adverse circumstances. When the Midianites",
                " carried him before Potiphar, he said....\"He dces",
                " not look like a slave and I",
                " fear he has been stolen from his",
                " country and his home.\" That is why",
                " Potiphar did not treat him like a",
                " slave, but put him incharge of his",
                " house and all his possessions. Likewise the",
                " Bible says, \"And he left all that",
                " he had in Josep's hand; and he",
                " knew not ought he had, save the",
                " bread which he did eat.\" (Gen. 39:",
                " 6).",
                "*19) This verse alludes to the",
                " special training Prophet Joseph needed at that",
                " time for the performance of the duties",
                " of the high rank to which he",
                " was destined to rise. Up to that",
                " time, he had been brought up in",
                " the desert, under the environment of a",
                " semi-nomadic life of a shepherd. There was",
                " neither any settled state in Canaan and",
                " Northern Arabia nor had there been any",
                " appreciable progress in culture and civilization, for",
                " it was inhabited by different independent clans",
                " with no settled government. Thus it is",
                " obvious that the training that Prophet Joseph",
                " had received in Canaan, had equipped him",
                " with the good characteristics of nomadic life",
                " coupled with the qualities of God-worship and",
                " high morality of the family of Prophet",
                " Abraham. But this was not enough to",
                " enable him to direct the affairs of",
                " Egypt, which was at that time one",
                " of the most cultured and civilized countries",
                " of the known world and required a",
                " different experience and training for the conduct",
                " of its affairs. The All-Powerful AIIah made",
                " arrangements for this training and sent him",
                " to the house of an officer of",
                " a very high rank in Egypt, who",
                " entrusted him with full powers over his",
                " house and estate. This enabled him to",
                " develop all those latent abilities that were",
                " needed to fulfil his destiny, and he",
                " gained the experience that was required for",
                " the efficient conduct of the affairs of",
                " the kingdom of Egypt in the years",
                " to come."
            ]
        },
        {
            "id": "[12:22]",
            "verse": "And when Joseph reached maturity, We gave him judgment and knowledge. And thus We reward the doers of good.",
            "description": [
                "By the use of such words as",
                " the Qur'an usually means, \"We bestowed on",
                " him Prophethood,\" for the Arabic word (hukmun)",
                " stands for both judgement and \"authority\" and",
                " (`ilmun) hen stands for that Knowledge which",
                " is directly revealed to the Prophets by",
                " Allah. Thus, the Arabic words of the",
                " Text will mean: \"We gave him the",
                " power and the authority and the knowledge",
                " needed for judging rightly the affairs of",
                " the people.\""
            ]
        },
        {
            "id": "[12:23]",
            "verse": "And she, in whose house he was, sought to seduce him. She closed the doors and said, \"Come, you.\" He said, \"[I seek] the refuge of Allah. Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed.\"",
            "description": [
                "Generally the commentators and translators are of",
                " the opinion that Prophet Joseph used (Rabbi",
                " \"My Lord\") for the master of the",
                " house, and what he meant to imply",
                " by way of argument was this: \"My",
                " Lord has treated me very kindly and",
                " kept me well in the house. How",
                " can I, then, be so disloyal and",
                " ungrateful as to commit adultery with his",
                " wife?\" I, however, strongly differ with such",
                " a translation and commentary. Though the Arabic",
                " usage of (rabb) admits of such a",
                " meaning, I have two strong reasons against",
                " this here. First, it is far below",
                " the dignity of a Prophet to refrain",
                " from a sin because of the regard",
                " he had for some person other than",
                " AIlah. Second, there is not a single",
                " instance in the Qur'an that a Prophet",
                " ever called anyone other than Allah his",
                " \"rabb.\" Prophet Joseph himself differentiates between his",
                " creed and that of the Egyptians making",
                " it plain that his ( \"rabb\" :",
                " Lord) was Allah, while they had made",
                " other human beings their \"rabb\". Then this",
                " verse should be considered from another point",
                " of view: when (\"rabbi\") may also mean",
                " \"My Lord\", Prophet Joseph might have invoked",
                " Allah. Why should then one take the",
                " other meaning, \"my master\", which most surely",
                " implies something that is against the right",
                " creed?"
            ]
        },
        {
            "id": "[12:24]",
            "verse": "And she certainly determined [to seduce] him, and he would have inclined to her had he not seen the proof of his Lord. And thus [it was] that We should avert from him evil and immorality. Indeed, he was of Our chosen servants.",
            "description": [
                "\"His Lord's argument\" means inspiration from Allah",
                " to rouse his conscience to the fact",
                " that it was not worthy of him",
                " to yield to the temptation by the",
                " woman. As regards the question, \"What was",
                " that argument\", it has been stated in",
                " the preceding verse, that is, \"My Lord",
                " has shown much kindness towards me. Should",
                " I, then, misbehave like this? Such workers",
                " of iniquity never fare well. \" This",
                " was the \"Divine argument\" that saved Prophet",
                " Joseph in the prime of youth from",
                " that great temptation. The significance of \"Joseph",
                " also would have advanced towards her, had",
                " he not seen his Lord's argument\" is",
                " this: \"Even a Prophet like Joseph (Allah's",
                " peace be upon him) could not have",
                " been able to save himself from sin,",
                " had not Allah guided him rightly with",
                " His argument. Incidentally, this verse makes plain",
                " the nature of the \"Immunity\" of Prophets",
                " from sin. It does not mean that",
                " a Prophet is infallible and incapable of",
                " committing any error, offence or sin or",
                " doing wrong or making a mistake. What",
                " it means is this: though a Prophet",
                " possesses passions, emotions, and carnal desires like",
                " other human beings, and is capable of",
                " committing a sin, he is so virtuous",
                " and God-fearing that he never deliberately cherishes",
                " any evil intentions, for he is endowed",
                " with such great arguments from his Lord",
                " as do not allow the lusts of",
                " the flesh over-power the voice of his",
                " conscience. And if ever he succumbs inadvertently",
                " to any of the human weaknesses, Allah",
                " at once sends a Revelation to him",
                " to set him on the right path.",
                " For the consequences of his error do",
                " not remain confined to his own person",
                " but react on the whole mankind, for",
                " even his slightest error might mislead the",
                " world to the most horrible sins.",
                "*23)",
                " \"....so that We may remove indecency and",
                " immodesty from him\" implies two things. First,",
                " \"It was because of Our grace that",
                " he could perceive Our argument, and save",
                " himself from sin, for We willed to",
                " remove indecency and immodesty from Our chosen",
                " servant. \" The second meaning is rather",
                " deeper: This incident took place in the",
                " life of Joseph because this was essential",
                " for his spiritual training: \"It was Our",
                " will to pass him through this hard",
                " test so that he should become immune",
                " from indecency and immodesty, for he would",
                " have to apply all his powers of",
                " piety to withstand such a great temptation,",
                " and thus become really so strong as",
                " not to yield to such things in",
                " future as well\" . The importance and",
                " the need of such a hard training",
                " becomes quite obvious, if we keep in",
                " view the moral conditions of the Egyptian",
                " society of that period. We can have",
                " a glimpse of this from vv. 30-32.",
                " It appears that the women in general",
                " and the \"ladies\" of high society in",
                " particular, enjoyed almost the same sexual freedom",
                " as is rampant today in the \"civilized\"",
                " West and in the Westernized East. Allah",
                " made arrangements for the special training of",
                " Prophet Joseph in the house of his",
                " master because he had to perform his",
                " Divine Mission in a perverted society, and",
                " that too as a ruler and not",
                " as a common man. It is thus",
                " obvious from the behaviour of those \"ladies\"",
                " of high rank, who did not feel",
                " any shame nor modesty in openly admiring",
                " the beauty of the young slave and",
                " from that of the \"lady\" of the",
                " house who was not ashamed of confessing",
                " openly that she did her best to",
                " tempt him and would continue to do",
                " so, that they would have done all",
                " they could to allure the young handsome",
                " ruler. Thus Allah not only made Prophet",
                " Joseph strong enough to resist such temptations",
                " in future by passing him through the",
                " hard test, but also filled the ladies",
                " with despair of gaining any \"success\" in",
                " this matter."
            ]
        },
        {
            "id": "[12:25]",
            "verse": "And they both raced to the door, and she tore his shirt from the back, and they found her husband at the door. She said, \"What is the recompense of one who intended evil for your wife but that he be imprisoned or a painful punishment?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:26]",
            "verse": "[Joseph] said, \"It was she who sought to seduce me.\" And a witness from her family testified. \"If his shirt is torn from the front, then she has told the truth, and he is of the liars.",
            "description": [
                "It appears that when the master of",
                " the house came on the scene, he",
                " was accompanied by a person of his",
                " wife's household. When he heard the story",
                " of the incident, he made this proposal:",
                " \"As each of them accuses the other",
                " and there is no eye-witness of what",
                " happened between the two, the matter should",
                " be decided by the help of the",
                " circumstancial evidence, by examining the condition of",
                " Joseph's shirt.\" Obviously this was a very",
                " reasonable way of deciding the matter, and",
                " there was, therefore, no need to resort",
                " to a miracle. According to some traditions",
                " this witness was an infant, lying in",
                " the cradle, whom Allah had given the",
                " power of speech for giving this evidence.",
                " As this story is not supported by",
                " any authority, there is no reason why",
                " the obvious, plain and reasonable thing should",
                " not be accepted that the witness was",
                " a wise and experienced member of the",
                " family of the wife, instead of having",
                " resort to a miracle based on an",
                " unauthentic tradition."
            ]
        },
        {
            "id": "[12:27]",
            "verse": "But if his shirt is torn from the back, then she has lied, and he is of the truthful.\"",
            "description": [
                "This is what was implied in the",
                " evidence: \"If Joseph's shirt is rent from",
                " the front, it means that Joseph is",
                " the aggressor and she has struggled to",
                " defend her honour. But if the shirt",
                " is rent from the back, it is",
                " obvious that he must have been running",
                " away from her and she must have",
                " been tugging from behind\" . The circumstancial",
                " evidence implied another thing. As the witness",
                " invited the master's attention to Prophet Joseph's",
                " shirt only, it meant that there was",
                " no sign at al! of violence on",
                " the garments of the woman, for had",
                " he been the aggressor, there must have",
                " been some signs of violence on her",
                " garments."
            ]
        },
        {
            "id": "[12:28]",
            "verse": "So when her husband saw his shirt torn from the back, he said, \"Indeed, it is of the women's plan. Indeed, your plan is great.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:29]",
            "verse": "Joseph, ignore this. And, [my wife], ask forgiveness for your sin. Indeed, you were of the sinful.\"",
            "description": [
                "a. A comparative study of the story",
                " as given in the Qur'an and in",
                " the Bible and the Talmud will be",
                " worthwhile.",
                "The Bible says, \"And she caught",
                " him by his garment, saying, Lie with",
                " me: and he left his garment in",
                " her hand, and fled, and got him",
                " out. And it came to pass, when",
                " she saw that he had left his",
                " garment in her hand, and was fled",
                " forth, that she called unto the men",
                " of her house, and spake unto them,",
                " saying, See, he hath brought in an",
                " Hebrew unto us to mock us; he",
                " came in unto me to lie with",
                " me, and I cried with a loud",
                " voice: And it came to pass, when",
                " he heard that I lifted up my",
                " voice and cried, that he left his",
                " garment with me, and fled, and got",
                " him out. And she laid up his",
                " garment by her, until his lord came",
                " home...And it came to pass, when his",
                " master heard the words of his wife,",
                " which she spake unto him, saying, After",
                " this manner did thy servant to me;",
                " that his wrath was kindled. And Joseph's",
                " master took him, and put him into",
                " the prison, a place where the king's",
                " prisoners were bound.\" (Gen. 39: 12-16, 19-20).",
                "",
                "The clumsy manner of the above version",
                " is obvious. It appears from this that",
                " Prophet Joseph's garment was so shaped that",
                " the whole of it fell into her",
                " hands when she tugged it. Then he",
                " ran away all naked, leaving it with",
                " her, as if to supply her with",
                " a clear proof of his own guilt.",
                "",
                "Now let us turn to the Talmud.",
                " It says `....hearing the accusation, Potiphar commanded",
                " at once that the lad should be",
                " whipped severely. Then he carried Joseph before",
                " the judges............They ordered that the rent garmtent",
                " should be brought to them and upon",
                " an examination of the same, they pronounced",
                " Joseph \"not guilty\".' (The Talmud Selections, H.",
                " Polano, pp. 81-82). Obviously this version is",
                " also faulty, for it cannot be imagined",
                " that a person of such a high",
                " rank would himself take the case to",
                " a court that his own slave had",
                " tried to assault his wife criminally. Incidentally,",
                " this Qur'anic version of the story is",
                " a clear proof of the fact that",
                " it has no copied stories from the",
                " Israelite traditions as the pseudoorientalists allege, but",
                " has, on the other hand, corrected them",
                " and told the real facts to the",
                " world."
            ]
        },
        {
            "id": "[12:30]",
            "verse": "And women in the city said, \"The wife of al-'Azeez is seeking to seduce her slave boy; he has impassioned her with love. Indeed, we see her [to be] in clear error.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:31]",
            "verse": "So when she heard of their scheming, she sent for them and prepared for them a banquet and gave each one of them a knife and said [to Joseph], \"Come out before them.\" And when they saw him, they greatly admired him and cut their hands and said, \"Perfect is Allah! This is not a man; this is none but a noble angel.\"",
            "description": [
                "The ancient Egyptians used to place pillows",
                " and cushions in such feasts for the",
                " guests to recline. And this is confirmed",
                " by the archaeological remains in Egypt.",
                "There",
                " is no mention at all of this",
                " banquet in the Bible but it has",
                " been described in the Talmud in a",
                " way quite different from that of the",
                " Qur'an. Needless to say that while this",
                " narrative in the Qur'an is natural, life-like",
                " and teaches moral lessons, the one in",
                " the Talmud lacks all these things."
            ]
        },
        {
            "id": "[12:32]",
            "verse": "She said, \"That is the one about whom you blamed me. And I certainly sought to seduce him, but he firmly refused; and if he will not do what I order him, he will surely be imprisoned and will be of those debased.\"",
            "description": [
                "This open demonstration of her love and",
                " declaration of her immoral designs show that",
                " the moral condition of the higher class",
                " of the Egyptian society had declined to",
                " the lowest ebb. It is quite obvious",
                " that the women whom she had invited",
                " must have been ladies belonging to the",
                " upper most stratum of the society. The",
                " very fact that she presented her beloved",
                " before them without any hesitation in order",
                " to convince them of his beauty and",
                " youth that had urged her to fall",
                " in love with him, shows that there",
                " was nothing uncommon in this demonstration. Then",
                " these ladies did not reproach her but",
                " themselves practically demonstrated that, in those circumstances,",
                " they themselves would have done the same",
                " that she did. Above alI, the hostess",
                " did not feel that it was immodest",
                " to declare openly, \"No doubt, I sought",
                " to seduce him and he succeeded in",
                " escaping from me. Yet I am not",
                " going to give him up. If he",
                " will not do as I bid him,",
                " he shall be cast into prison and",
                " humbled and disgraced\" . Incidentally, this also",
                " shows that the modern Western people and",
                " their Westernised disciples in the East are",
                " not justified in claiming the credit for",
                " giving full \"freedom\" to the woman. For",
                " this \"progress\" is no new thing: it",
                " was in vogue in Egypt in its",
                " full glory thousands of years before this.",
                ""
            ]
        },
        {
            "id": "[12:33]",
            "verse": "He said, \"My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant.\"",
            "description": [
                "In order to grasp the full significance",
                " of this prayer of Prophet Joseph, we",
                " should try to form a mental picture",
                " of the circumstances in which he was",
                " placed at that time. In the light",
                " of this passage the picture will be",
                " something like this. \"There is the handsome",
                " young man of twenty in the prime",
                " of his life, who has brought health",
                " and vigour of youth from the desert",
                " into Egypt, after passing through the ordeal",
                " of forced slavery and exile. Fortune has",
                " placed him in the house of one",
                " of the highest dignitaries in the capital",
                " of the most civilized country of the",
                " world at the time. There this handsome",
                " young man meets in the prime of",
                " life with a strange experience. The lady",
                " of the house in which he has",
                " to live day and night falls passionately",
                " in love with him and begins to",
                " tempt and seduce him.Then the fame of",
                " his beauty spreads all over the capital",
                " and the other ladies of the town",
                " also become enamoured of him. Now this",
                " is the critical position. He is surrounded",
                " on all sides by hundreds of beautiful",
                " snares that have been spread to entrap",
                " and catch him unawares. All sorts of",
                " devices are employed to excite his passions",
                " and entice him: wherever he goes he",
                " encounters sin lying in ambush with all",
                " its charms and allurements and waiting for",
                " an opportune moment to make a surprise",
                " attack upon him. Such are the circumstances",
                " that are tempting him with sin, but",
                " the pious young man successfully passes through",
                " the ordeal, set for him by Satan,",
                " with the self-control that is praiseworthy indeed.",
                " But it is all the more praiseworthy",
                " that he does not feel any pride",
                " for showing such extraordinary piety in such",
                " trying and tempting circumstances. On the other",
                " hand, he very humbly invokes his Lord",
                " to protect him from those traps of",
                " sin, for he is afraid of the",
                " common human weaknesses and cries out, \"My",
                " Lord, I am weak ! I fear",
                " lest these temptations should over-power me, I",
                " would rather prefer imprisonment to doing such",
                " an evil thing into which they are",
                " tempting to ensnare me. \"",
                "In fact,",
                " that was the most important and critical",
                " period of Prophet Joseph's training, and this",
                " hard ordeal helped to bring forth all",
                " his latent virtues of which he himself",
                " was unaware up to that time. Then",
                " he himself realized that Allah had endowed",
                " him with the high and extraordinary qualities",
                " of honesty, fidelity, piety, charity, righteousness, self-control,",
                " balance of mind, and he made full",
                " use of these when he gained power",
                " in Egypt."
            ]
        },
        {
            "id": "[12:34]",
            "verse": "So his Lord responded to him and averted from him their plan. Indeed, He is the Hearing, the Knowing.",
            "description": [
                "Allah warded off their guile from Prophet",
                " Joseph by strengthening his character in such",
                " a way as to make ineffective all",
                " their devices to ensnare him, This also",
                " implies that Allah opened the door of",
                " prison for him in order to keep",
                " him safe from their tricks and temptations.",
                ""
            ]
        },
        {
            "id": "[12:35]",
            "verse": "Then it appeared to them after they had seen the signs that al-'Azeez should surely imprison him for a time.",
            "description": [
                "It occurred to them to imprison Prophet",
                " Joseph in order \"to save face\" after",
                " they had seen clear proofs of his",
                " innocence and of the guilt of their",
                " own women, for no other alternative was",
                " left, in their opinion, to undo the",
                " scandal that was spreading fast in the",
                " land. But it did not occur to",
                " them that in fact his imprisonment was",
                " his moral victory and the moral defeat",
                " of the rulers and the dignitaries of",
                " Egypt. By that time, Prophet Joseph had",
                " not remained an unknown person, for all",
                " and sundry had heard stories of his",
                " beauty and piety, and of the love",
                " the \"ladies\" had shown towards him. Therefore",
                " when those \"wise\" courtiers put into practice",
                " their plausible device to imprison him in",
                " order to reverse the doings of their",
                " \"ladies\", the common people must have drawn",
                " their own conclusions for they knew Prophet",
                " Joseph to be a man of pure,",
                " strong and high character. So it was",
                " obvious to them that he had committed",
                " no \"crime\" to merit imprisonment, and that",
                " he had been imprisoned because it was",
                " an easier way of escape for the",
                " chiefs of Egypt than to keep their",
                " own ladies under control.",
                "Incidentally, this shows",
                " that imprisonment of innocent people without trial",
                " and due procedure of law is as",
                " old as \"civilization\" itself. The dishonest rulers",
                " of to-day are not much different from",
                " the wicked rulers who governed Egypt some",
                " four thousand years ago. The only difference",
                " between the two is that they did",
                " not imprison people in the name and",
                " for the cause of \"democracy\" but they",
                " committed unlawful acts without any pretext of",
                " law. On the contrary, their modern descendants",
                " make use of the specious pretences of",
                " honesty when they are acting unjustly. They",
                " first enact the necessary unlawful laws to",
                " justify their unlawful practices and then \"lawfully\"",
                " imprison their victims. That is to say,",
                " the Egyptian rulers were honest in their",
                " dishonesty and did not hide the fact",
                " that they were imprisoning people to safeguard",
                " their own interests, and not those of",
                " the community. But these modern disciples of",
                " Satan cast innocent people into prison to",
                " ward off the \"danger\" they feel from",
                " them, but proclaim to the world that",
                " their victims are a menace to the",
                " country and the community. In short, they",
                " were mere tyrants but these are shameless",
                " liars as well."
            ]
        },
        {
            "id": "[12:36]",
            "verse": "And there entered the prison with him two young men. One of them said, \"Indeed, I have seen myself [in a dream] pressing wine.\" The other said, \"Indeed, I have seen myself carrying upon my head [some] bread, from which the birds were eating. Inform us of its interpretation; indeed, we see you to be of those who do good.\"",
            "description": [
                "At the time when Prophet Joseph was",
                " sent to prison, probably he was about",
                " twenty years old. This has been inferred",
                " from two statements in the Qur'an and",
                " the Talmud. The Qur'an (v. 42) says",
                " that `....he remained in the prison for",
                " a decade or so' and the Talmud",
                " says that `....Joseph was thirty years old",
                " when he was elevated to his honourable",
                " and trustworthy position' .",
                ">*32) One of",
                " the two prisoners, according to the Bible,",
                " was the chief of the butlers of",
                " the king of Egypt, and the other",
                " the chief of the bakers. And according",
                " to the Talmud, they were condemned to",
                " the prison because during a feast stone",
                " grits were found in the bread and",
                " a fly in the wine.",
                "*33) The",
                " fact that two prisoners attested his righteousness",
                " shows that Prophet Joseph was held in",
                " high esteem in the prison. Otherwise there",
                " was no reason why the two should",
                " have requested him alone to interpret the",
                " dreams and paid their homage like this:",
                " \"We have seen that you are a",
                " righteous man\". It clearly means that the",
                " events narrated in the preceding verses had",
                " reached all and sundry and the people",
                " inside the prison and outside it, knew",
                " that he had not been guilty of",
                " any crime or sin. On the other",
                " hand, he had proved himself to be",
                " a noble soul who had come out",
                " successful in the hardest test of his",
                " piety. So much so that there was",
                " not the like of him in piety,",
                " not even among their own religious leaders",
                " in the whole country. That was why",
                " not only the prisoners but also the",
                " officers and officials of the prison looked",
                " upon him as an honourable man and",
                " had full confidence in him. The Bible",
                " confirms this: \"And the keeper of the",
                " prison committed to Joseph's hand all the",
                " prisoners that were in the prison; and",
                " whatsoever they did there, he was the",
                " doer of it. The keeper of the",
                " prison looked not to anything that was",
                " under his hand.\" (Gen. 39: 22-23)."
            ]
        },
        {
            "id": "[12:37]",
            "verse": "He said, \"You will not receive food that is provided to you except that I will inform you of its interpretation before it comes to you. That is from what my Lord has taught me. Indeed, I have left the religion of a people who do not believe in Allah, and they, in the Hereafter, are disbelievers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:38]",
            "verse": "And I have followed the religion of my fathers, Abraham, Isaac and Jacob. And it was not for us to associate anything with Allah. That is from the favor of Allah upon us and upon the people, but most of the people are not grateful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:39]",
            "verse": "O [my] two companions of prison, are separate lords better or Allah, the One, the Prevailing?",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:40]",
            "verse": "You worship not besides Him except [mere] names you have named them, you and your fathers, for which Allah has sent down no authority. Legislation is not but for Allah. He has commanded that you worship not except Him. That is the correct religion, but most of the people do not know.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:41]",
            "verse": "O two companions of prison, as for one of you, he will give drink to his master of wine; but as for the other, he will be crucified, and the birds will eat from his head. The matter has been decreed about which you both inquire.\"",
            "description": [
                "This discourse, which is the soul of",
                " this story, and is one of the",
                " best on the doctrine of Tauhid in",
                " the Qur'an itself, finds no place at",
                " all in the Bible and the Talmud.",
                " This is because they regard him merely",
                " as a wise and pious man and",
                " not as a Prophet. That is why",
                " Rev. Rodwell has, in regard to this",
                " passage, accused Muhammad (Allah's peace be upon",
                " him) of putting his own doctrine and",
                " conviction into the mouth of Joseph (Allah's",
                " peace be upon him). But the Qur'an",
                " not only puts forward and presents these",
                " two aspects of his life in a",
                " much better and clearer way but also",
                " presents him as a Prophet, who had",
                " started propagating the Message even in the",
                " prison.",
                "As this discourse suggests several' very",
                " important things, it will be worthwhile to",
                " consider these one by one:",
                "(1) This",
                " is the first occasion on which Prophet",
                " Joseph appears to have begun the preaching",
                " of the true Faith. For before this,",
                " the Qur'an reveals him in the different",
                " stages of his life as a man",
                " of high morality but does not say",
                " anything to show that he conveyed the",
                " Message also. From this it is clear",
                " that those stages were of a preparatory",
                " nature and the mission of Prophethood was",
                " entrusted to him at the stage of",
                " his imprisonment and this was his first",
                " discourse as a Prophet.",
                "(2) Moreover, this",
                " was the first occasion when he revealed",
                " his identity to others. Before this, we",
                " fmd him bearing patiently everything that happened",
                " to him without revealing anything about his",
                " relationships with Prophet Abraham and others. He",
                " kept silent when the caravan made him",
                " a slave and carried him to Egypt:",
                " when AI-`Aziz bought him and when he",
                " was sent to prison. As Prophet Abraham,",
                " Isaac and Jacob (Allah's peace be upon",
                " them all) were quite well-known, he might",
                " have used their names to advantage. The",
                " members of the caravan, both the Ishmaelites",
                " and the Midianites, were closely related to",
                " his family, and the Egyptians were, at",
                " least, familiar with the name of Prophet",
                " Abraham. Nay, the way in which Prophet",
                " Joseph mentioned their names in this discourse,",
                " shows that the fame of. his father,",
                " grandfather and great grandfather had reached Egypt.",
                " But in spite of this, Prophet Joseph",
                " did not use their names on any",
                " of the critical occasions to save himself",
                " from the plight in which he was",
                " placed. This shows that probably he himself",
                " knew that these things were inevitable for",
                " his training for the Mission for which",
                " Allah had chosen him. Now it was",
                " absolutely necessary for him, for the sake",
                " of his Mission, to reveal this fact",
                " in order to show that he was",
                " not presenting any new Faith but the",
                " same Faith that was preached by Prophets",
                " Abraham, Isaac and Jacob (Allah's peace be",
                " upon them all). This was necessary because",
                " the Message demanded that it should not",
                " be presented with the claim that it",
                " was a new and novel thing but",
                " that it was the same universal and",
                " eternal Truth that has always been presented",
                " by its bearers.",
                "(3) This teaches us",
                " that one can, like Prophet Joseph, carve",
                " out a way for the propagation of",
                " the Message, if one has the intention",
                " and the required wisdom. The two men",
                " pay their homage to him and request",
                " him to interpret their dreams. In answer",
                " to this he says, \"I will tell",
                " their interpretations but Iet me first inform",
                " you about the source of my knowledge",
                " that enables me to understand dreams\" .",
                " Thus he takes advantage of their request",
                " and preaches his own Faith to them.",
                " We learn from this that if a",
                " person is imbued with the true and",
                " strong desire for propagating the Truth, he",
                " can very gracefully turn the direction of",
                " the conversation towards the Message he desires",
                " to convey. On the contrary, if a",
                " person has no strong desire for the",
                " propagation of the Message, he never \"finds\"",
                " any opportunity for it, even though hundred",
                " and one such opportunities might have come",
                " his way which could have been utilized",
                " for this purpose. But one must be",
                " on one's guard to discriminate between the",
                " right use of an opportunity by a",
                " wise man from the crude \"propagation\" of",
                " a foolish and un-cultured person, who tries",
                " to thrust the Message into the ears",
                " of unwilling hearers and succeeds only in",
                " creating aversion for it in their minds",
                " because of his crude way of presentation.",
                "",
                "(4) This also teaches the right procedure",
                " that should be followed in presenting the",
                " Message. Prophet Joseph does not present, at",
                " the very start, the details of the",
                " creed and regulations of the Faith but",
                " the most fundamental thing that distinguishes a",
                " Believer from a non-Believer, that is, the",
                " distinction between Tauhid and shirk. Then he",
                " presents it in such a rational manner",
                " as cannot fail to convince any tnan",
                " of common sense. And his argument must",
                " have impressed deeply on the minds of",
                " the two slaves. \"Which is better: various",
                " gods or One Omnipotent Allah?\" They knew",
                " it from their personal experience that it",
                " was much better to serve one master",
                " than a number of them. Therefore it",
                " was far better to serve the Lord",
                " of the universe than His servants. Moreover,",
                " he does not invite them directly to",
                " accept his Faith and discard their own",
                " faith, but he very wisely draws their",
                " attention to this fact; \"This is Allah's",
                " bounty upon us and upon alI mankind",
                " that He has not made us the",
                " servants of any other than Himself, yet",
                " most of the people are not grateful",
                " to Him. Instead of serving Him alone,",
                " they invent gods for themselves and worship",
                " them\" . Then it is also noteworthy",
                " that his criterion of the faith of",
                " his addressees is based on wisdom and",
                " has no tinge of bitterness in it.",
                " He says, \"The gods whom you call",
                " `the god of wealth' or `the god",
                " of health' or 'the god of prosperity'",
                " or `the god of rain' etc. are",
                " mere names you have given them without",
                " any reality behind them. The real Owner",
                " of everything is the Supreme Allah Whom",
                " you also acknowledge as the Creator and",
                " the Lord of the whole universe. He",
                " has sent no authority and given no",
                " sanction to anyone for Godhead and worship,",
                " but has reserved all the powers, all",
                " the rights and all the authorities for",
                " Himself, and commanded, `Serve and worship none",
                " but Me.'\"",
                "(5) It may also be",
                " inferred from this discourse that Prophet Joseph",
                " must havc made full use of this",
                " \"opportunity\" of a decade for the propagation",
                " of the Message. Some people think that",
                " that was the only time when he",
                " extended the invitation to the Message. This",
                " is wrong for two reasons. First, it",
                " is absurd to imagine that a Prophet",
                " could havc been neglectful of his Mission",
                " for a long period. Second, it cannot",
                " be imagined that the person who availed",
                " himself of the opportunity when two men",
                " approached him for the interpretation of their",
                " dreams, could ever have passed a decade",
                " of imprisonment without propagating the Message entrusted",
                " to him by his Lord."
            ]
        },
        {
            "id": "[12:42]",
            "verse": "And he said to the one whom he knew would go free, \"Mention me before your master.\" But Satan made him forget the mention [to] his master, and Joseph remained in prison several years.",
            "description": [
                "Some commentators have interpreted it like this:",
                " \"Satan made Prophet Joseph neglectful of his",
                " Lord, AIlah, so he placed his confidence",
                " in a man rather than Allah and",
                " desired him to mention him to his",
                " lord, the king, for his release. So",
                " AIlah punished him by letting him languish",
                " several years in the dungeon\" In fact,",
                " such an interpretation is absolutely erroneous for",
                " as 'Allamah Ibn Kathir and some early",
                " commentators like Mujahid, Muhammad-bin-Ishaq and some others",
                " say, the pronoun \"him\" refers to that",
                " person who he thought would be released.",
                " Therefore it will mean: \"Satan made him",
                " (the would-be free man) so neglectful that",
                " he forgot to mention him (Prophet Joseph)",
                " to his lord (the king).\" They also",
                " cite a tradition in support of their",
                " interpretation to this effect. The Holy Prophet",
                " said, \"If Prophet Joseph had not said",
                " that which he said, he would not",
                " have remained in imprisonment for several years.\"",
                " But `Allamah Ibn Kathir says, \"This Hadith",
                " cannot be accepted because all the ways",
                " in which it has been reported arc",
                " weak. Moreover, two of the reporters, Sufyan-bin-Waki`i",
                " and Ibrahim-bin-Yazid, are not trustworthy\". Besides being",
                " weak on technical grounds, it is also",
                " against the dictates of common sense: if",
                " a wronged person adopted some measures for",
                " his release, he cannot be considered to",
                " be neglectful of God and guilty of",
                " the lack of trust in Allah."
            ]
        },
        {
            "id": "[12:43]",
            "verse": "And [subsequently] the king said, \"Indeed, I have seen [in a dream] seven fat cows being eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry. O eminent ones, explain to me my vision, if you should interpret visions.\"",
            "description": [
                "Leaving the account of the events of",
                " the intervening years of imprisonment, the story",
                " has been resumed from the time when",
                " Prophct Joseph began to rise in worldly",
                " rank.",
                "*37) According to the Bible and",
                " the Talmud, the king was greatly disturbed",
                " troubled and confused in mind because of",
                " these dreams. So he proclaimed throughout the",
                " whole land of Egypt, and called upon",
                " all the wise men, and the sooth-sayers,",
                " and magicians of the land to interpret",
                " his dreams."
            ]
        },
        {
            "id": "[12:44]",
            "verse": "They said, \"[It is but] a mixture of false dreams, and we are not learned in the interpretation of dreams.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:45]",
            "verse": "But the one who was freed and remembered after a time said, \"I will inform you of its interpretation, so send me forth.\"",
            "description": [
                "The Qur'an has told in brief the",
                " essence of the request of the chief",
                " butler, but the Bible and the Talmud",
                " have given its details. According to these",
                " (and it stands to reason that it",
                " must have been so), he told the",
                " king of the life of Prophet Joseph",
                " in prison and how he interpreted their",
                " dreams rightly and prayed the king to",
                " give hits leave to see Prophct Joseph",
                " in prison for that purpose."
            ]
        },
        {
            "id": "[12:46]",
            "verse": "[He said], \"Joseph, O man of truth, explain to us about seven fat cows eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry - that I may return to the people; perhaps they will know [about you].\"",
            "description": [
                "The Arabic word pofeIoO (Siddiq) is used",
                " for the one who is an embodiment",
                " of truth and righteousness. Thus it shows",
                " that the butler had been so deeply",
                " impressed with the pure character of Prophet",
                " Joseph that even years had failed to",
                " blot it from his heart. (For its",
                " fuller meaning please refer to E.N. 99",
                " of An-Nusa).",
                "*40) That is, \"They might",
                " understand your true worth and realize their",
                " own error in keeping you in prison",
                " without any just cause. And in a",
                " way I may get the opportunity of",
                " fulfilling the promise I made with you",
                " during my imprisonment. \""
            ]
        },
        {
            "id": "[12:47]",
            "verse": "[Joseph] said, \"You will plant for seven years consecutively; and what you harvest leave in its spikes, except a little from which you will eat.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:48]",
            "verse": "Then will come after that seven difficult [years] which will consume what you saved for them, except a little from which you will store.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:49]",
            "verse": "Then will come after that a year in which the people will be given rain and in which they will press [olives and grapes].\"",
            "description": [
                "The literal meaning of is: \"they will",
                " press.\" Here it has been used to",
                " denote that state of verdure which was",
                " going to prevail after the famine years",
                " because of rainfall and flood in the",
                " Nile. For, when the land will be",
                " watered, there will be abundance of seed",
                " to press oil, and abundance of fruit",
                " to press juice and abundance of fodder",
                " for cattle to press milk out of",
                " them. It should be noted that Prophet",
                " Joseph not only interpreted the king's dream",
                " but also told them how to preserve",
                " and reserve grain during the first seven",
                " years of prosperity for the subsequent seven",
                " years of famine. Moreover he foretold the",
                " good news of prosperity after the seven",
                " years of famine, though there was no",
                " hint of this in the dream of",
                " the king."
            ]
        },
        {
            "id": "[12:50]",
            "verse": "And the king said, \"Bring him to me.\" But when the messenger came to him, [Joseph] said, \"Return to your master and ask him what is the case of the women who cut their hands. Indeed, my Lord is Knowing of their plan.\"",
            "description": [
                "There is no mention in the Bible",
                " and the Talmud of this most important",
                " part of the story that Prophet Joseph",
                " declined to quit the prison till his",
                " character was cleared. On the other hand,",
                " according to the Bible, \"Then Pharaoh sent",
                " and called Joseph, and they brought him",
                " hastily out of the dungeon; and he",
                " shaved himself, and changed his raiment, and",
                " came in unto Pharaoh\" . And the",
                " Talmud depicts even a more degrading picture",
                " of the event. It says, \"The king",
                " ordered that Joseph should be brought before",
                " him. But he commanded his officers to",
                " be careful not to frighten the lad,",
                " lest through fear he should be unable",
                " to interpret correctly. And the servant of",
                " the king brought Joseph forth from his",
                " dungeon, and shaved him and clothed him",
                " in new garments, and carried him before",
                " the king. The king was seated upon",
                " his throne, and the glare and glitter",
                " of the jewels which ornamented the throne",
                " dazzled and astonished the eyes of Joseph.",
                " Now the throne of the king was",
                " reached by seven steps, and it was",
                " the custom of Egypt for a prince",
                " or noble who held audience with the",
                " king, to ascend to the sixth step;",
                " but when an inferior or a private",
                " citizen of the land was called into",
                " his presence, the king descended to the",
                " third step and from there spoke with",
                " him.\" (The Talmud, H. Polano, pp. 87-88).",
                "",
                "A comparison of the degrading picture in",
                " the Talmud with this self -respecting grand,",
                " and noble picture depicted in the Qur'an",
                " will convince every unbiased critic that the",
                " one in the Qur'an is worthy of",
                " a Prophet of God. Moreover the picture",
                " in the Talmud is open to a",
                " grave objection: Had Prophet Joseph behaved like",
                " a frightened and cringing lad who was",
                " so dazzled by the glitter and glare",
                " of the jewels of the throne that",
                " he bowed to the ground, how was",
                " it that the king and the courtiers",
                " were so impressed by him that they",
                " declared, \"...... the Hebrew has proved himself",
                " wise and skilful and through his wisdom",
                " shall our country be saved the pangs",
                " of want\"? So much so that the",
                " king appointed him, without demur, as \"governor\"",
                " over the land, \"second only to himself\".",
                " All this shows that by that time",
                " he had proved his moral and mental",
                " superiority and had enhanced it by his",
                " refusal to quit the prison without proving",
                " his innocence. Otherwise, they would have never",
                " raised him to the highest rank in",
                " such a civilized and advanced country as",
                " Egypt.",
                "*43) He demanded an enquiry into",
                " the matter not because he himself had",
                " any doubt of his innocence, but because",
                " he was perfectly confident of this: \"My",
                " Lord has full knowledge of my innocence",
                " and of their cunning. But your lord",
                " should also make a thorough inquiry as",
                " to why I had been sent to",
                " prison, for I do not want to",
                " go before the public with any blemish",
                " or blot on my reputation. Therefore a",
                " public enquiry should be held to prove",
                " that I was an innocent victim of",
                " the injustice of the chiefs and nobles",
                " of the country, who had cast me",
                " into prison in order to cover up",
                " the guilt of their own ladies.\"",
                "The",
                " words in which the demand was made",
                " clearly show that the king was already",
                " fully acquainted with the details of the",
                " incident that had happened at the banquet",
                " of the wife of Al-'Aziz. That is",
                " why a mere reference to it was",
                " enough.",
                "Another note-worthy thing in this demand",
                " was that Prophet Joseph did not in",
                " any way hint at the part the",
                " wife of Al-`Aziz had played in the",
                " event. This is another proof of his",
                " noble character that he did not like",
                " to involve and entangle the wife of",
                " his benefactor in the matter, even though",
                " she had done him her worst."
            ]
        },
        {
            "id": "[12:51]",
            "verse": "Said [the king to the women], \"What was your condition when you sought to seduce Joseph?\" They said, \"Perfect is Allah! We know about him no evil.\" The wife of al-'Azeez said, \"Now the truth has become evident. It was I who sought to seduce him, and indeed, he is of the truthful.",
            "description": [
                "As regards the way in which this",
                " enquiry was held, it is just possible",
                " that the king might have summoned the",
                " women to his presence or got their",
                " evidence through a trusted officer of his",
                " court.",
                "*45) The enquiry and the evidences",
                " must have helped to pave the way",
                " for Prophet Josep's rise in the land",
                " by concentrating the public attention on him,",
                " especially under the circumstances when the enquiry",
                " had been demanded by him. He had",
                " interpreted the dream of the king, when",
                " all the wise men, sooth-sayers and the",
                " magicians had failed. Then he had refused",
                " to quit prison even though the king",
                " himself had ordered that he should be",
                " brought before him, and, instead of this,",
                " demanded an enquiry of the matter which",
                " had been the cause of his imprisonment.",
                " Naturally this thing would have filled the",
                " people with wonder and they would have",
                " been looking eagerly for the result of",
                " the enquiry. Thus it can be imagined",
                " how the evidences and the result of",
                " the enquiry raised his prestige so high",
                " that the king and his courtiers declared",
                " that he was the only fit person",
                " to save the country from the coming",
                " calamity. It is no wonder, then, that",
                " Prophet Joseph proposed that alI the resources",
                " of the land should be placed in",
                " his hands, and the king accepted this",
                " proposal as soon as it was made.",
                " For, had it been merely the matter",
                " of the interpretation of a dream, the",
                " most he would have deserved was some",
                " reward and Iris release from prison. But",
                " he could not have said, \"Place the",
                " resources of the land in my hands\"",
                " and the king would not have readily",
                " acceded to his proposal and given him",
                " all the powers in the land, as",
                " is contained in vv. 55-56, and confirmed",
                " by the Bible and the Talmud."
            ]
        },
        {
            "id": "[12:52]",
            "verse": "That is so al-'Azeez will know that I did not betray him in [his] absence and that Allah does not guide the plan of betrayers.",
            "description": [
                "Prophet Joseph might have said these words",
                " in the prison when he came to",
                " know the result of the enquiry. But",
                " some commentators, including great scholars like Ibn",
                " Taimiyyah and Ibn Kathir, regard this sentence",
                " to be a continuation of the preceding",
                " speech of the wife of AI-'Aziz. They",
                " argue that this sentence has been placed",
                " contiguous to her preceding speech without any",
                " dividing word between them to indicate that",
                " her speech had ended at \"he is",
                " absolutely in the right\", and that the",
                " succeeding words were spoken by Prophet Joseph.",
                " They construe that if two speeches made",
                " by two different persons are placed in",
                " contiguity, they must be separated by means",
                " of Borne definite word, or there must",
                " be some definite clue to it. As",
                " neither of these two things exists in",
                " this case, it may rightly be construed",
                " that the words contained in v. 52",
                " are the continuation of her preceding speech",
                " in v. 51. I, however, am surprised",
                " how a great scholar of Ibn Taimiyyah's",
                " insight has missed this point that the",
                " characteristic of a speech is in itself",
                " a clear and self-sufficient clue. Her confession",
                " in v. 51 fits in with her",
                " low character, but obviously the succeeding dignified",
                " and grand speech in v. 52 is",
                " too high for her. That fits in",
                " only with the noble character of Prophet",
                " Joseph. It is obvious that this must",
                " have been uttered by one, who was",
                " righteous, generous, humble and God-fearing. It is",
                " by itself a clear evidence that it",
                " could not have come out of the",
                " mouth of the one, who said, \"Come",
                " here\", and \"What punishment dces the one",
                " deserve, who shows evil intentions towards your",
                " wife?\" and \"......if he will not yield",
                " to my bidding, he shall be cast",
                " into prison.\" On the other hand, such",
                " a pure speech fitted in with the",
                " one who said, \"May AIlah protect me!",
                " My Lord has shown so much kindness",
                " towards me. Should I, then, misbehave like",
                " this?\" and \" my Lord! I prefer",
                " imprisonment to that to which they invite",
                " me. If Thou dost not ward off",
                " their cunning devices from me, I might",
                " be caught in their snares.\" Therefore one",
                " cannot ascribe such a pure speech to",
                " the wife of AI-'Aziz unless there is",
                " a clear clue showing that by that",
                " time she had repented and believed and",
                " mended her ways, but there is no",
                " such clue. Thus it is clear that",
                " this speech must have been made by",
                " Prophet Joseph (Allah's peace be upon him).",
                ""
            ]
        },
        {
            "id": "[12:53]",
            "verse": "And I do not acquit myself. Indeed, the soul is a persistent enjoiner of evil, except those upon which my Lord has mercy. Indeed, my Lord is Forgiving and Merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:54]",
            "verse": "And the king said, \"Bring him to me; I will appoint him exclusively for myself.\" And when he spoke to him, he said, \"Indeed, you are today established [in position] and trusted.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:55]",
            "verse": "[Joseph] said, \"Appoint me over the storehouses of the land. Indeed, I will be a knowing guardian.\"",
            "description": [
                "It implied this: \"We have such a",
                " high opinion of you that we can",
                " safely entrust you with the highest office",
                " of responsibility in the country.\"",
                "47a. As",
                " this verse has given rise to some",
                " important questions, Iet us consider these one",
                " by one.",
                "The first question is: \"Was",
                " it an application made by Prophet Joseph",
                " to the king for some post ?\"",
                " In the light of the preceding Explanatory",
                " Notes, it would have become obvious that",
                " it was neither an application nor a",
                " request made by an ambitious person who",
                " had been on the look-out for an",
                " opportune moment for its submission, and no",
                " sooner did the king express his approval",
                " of him than he presented his request",
                " before him. As a matter of fact,",
                " this was a sort of proposal, giving",
                " his assent to the great desire of",
                " the king and the courtiers that he",
                " should be appointed as governor over the",
                " land. For, according to the Talmud, \"the",
                " Hebrew has proved himself wise and skilful,\"",
                " and \" ....surely there can be none",
                " more discrete than myself to whom God",
                " has made known all these things.\" The",
                " king, his courtiers, his princes, officers, and",
                " men of rank, had by that time,",
                " come to know and recognize his true",
                " worth and had had experience of his",
                " moral superiority during the last decade of",
                " the vicissitudes of his life. He had",
                " proved that there was none equal to",
                " him in honesty, righteousness, forbearance, selfdiscipline, generosity,",
                " intelligence and understanding. They knew and believed",
                " that he was the only one who",
                " knew how to guard and utilize the",
                " resources of the land and could be",
                " safely entrusted with them. Therefore, as soon",
                " as he showed his willingness, they heartily",
                " put these in his trust. This is",
                " also confirmed by the Bible that the",
                " king had formed a very high opinion",
                " of Prophet Joseph. He said to his",
                " servants, \"Can we find such a one",
                " as this is, a man in whom",
                " the spirit of God is?\" Above all,",
                " he said to Prophet Joseph, \"There is",
                " none so discreet and wise as thou",
                " art.\" (Gen. 41: 38-39). Accordingly, therefore, the",
                " king, of his own accord, set him",
                " over his house and land. (Gen. 41:",
                " 41).",
                "Let us now take up the",
                " second question: \"What was the nature of",
                " the powers that were entrusted to Prophet",
                " Joseph?\" This is important because those who",
                " are not well versed in the Qur'an",
                " have been misled by the words aAECOIONCaC",
                " in this verse and by his subsequent",
                " work of the distribution of grain. They",
                " wrongly conclude from these that this post",
                " was like the present day posts of",
                " a \"Treasury Officer\" or a \"Famine Commissioner\"",
                " or a \"Finance Minister\" etc. etc. In",
                " fact, it was none of these, for,",
                " according to the Qur'an and the Bible",
                " and the Talmud, Prophet Joseph had been",
                " invested with the full powers and privileges",
                " of a ruler. That is why he",
                " sat on the throne ( v. 100)",
                " and they used the title of malik",
                " (king) for him. (v. 72). He himself",
                " was grateful to Allah for bestowing the",
                " kingdom on him. (v. 101). Above all,",
                " Allah Himself testifies to this fact: \"Thus",
                " We gave power to Joseph in the",
                " land, so he had every right to",
                " take possession of any piece of it,",
                " if he so desired.\" (v. 56). As",
                " regards the Bible, it says, \"And Pharaoh",
                " said unto Joseph, `Thou shalt be over",
                " my house, and according unto thy word",
                " shall all my people be ruled: See,",
                " I have set thee over all the",
                " land of Egypt.... and without thee shall",
                " no tnan lift up his hand or",
                " foot in all the land of Egypt,'",
                " and called Joseph's name Zaphnath-paaneah (saviour of",
                " the world).\" (Gen. 41: 40-45). And according",
                " to the Talmud, when his brothers returned",
                " w their father, Prophet Jacob, from Egypt,",
                " they said about Prophet Joseph, \"The king",
                " of Egypt is mighty potentate, over his",
                " people he is supreme; upon his word",
                " they go out and upon his word",
                " they come in; his word governs, and",
                " the voice of his master, Pharaoh, is",
                " not required.\"",
                "Another pertinent question is: What",
                " was the object for which Prophet Joseph",
                " made a proposal for powers in the",
                " land? Did he offer his services for",
                " the enforcement of the laws of a",
                " non-Muslim state? Or did he intend to",
                " establish the cultural, moral and political systems",
                " of Islam by taking the powers of",
                " government in his own hands? As for",
                " its answer let us quote the comments",
                " on this verse (55) by `Allamah Zamakhshari",
                " in his 'Kashshaf'. He says, \"When Prophet",
                " Joseph proposed, `Please place all the resources",
                " of the country under my trust', he",
                " meant to get an opportunity for enforcing",
                " the Commandments of Allah and for establishing",
                " truth and justice, and to gain that",
                " power which is essential for fulfilling the",
                " Mission for which the Messengers are sent.",
                " He did not make this demand for",
                " the love of kingdom or for worldly",
                " desires and ambitions. He did this because",
                " he knew full well that there was",
                " none else who could perform that work.",
                "",
                "To be frank, the above question leads",
                " to very important and basic issues. These",
                " are: Was Joseph a Prophet of Allah",
                " or not ? If he was, does",
                " the Qur'an put forward such a conception",
                " of a Prophet that he himself should",
                " (as they allege Prophet Joseph did) offer",
                " his services to a system of unbelief",
                " to carry on its work on un-Godly",
                " principles? Nay, it leads to a more",
                " delicate and important question Was he a",
                " righteous person or not ? and, if",
                " he was, could it ever be expected",
                " that he would (according to their interpretation,)",
                " practically accept the theory that Sovereignty belongs",
                " to the king and not to Allah,",
                " whereas in the prison he preached, \"Sovereignty",
                " belongs to none but AIlah (v. 40)",
                " ?\" for if, as they interpret, he",
                " submitted an application for service to the",
                " king, it meant that he did so",
                " against his own principles which he inculcated",
                " while in prison: \" . . .",
                " . which is better: various gods or",
                " the One Omnipotent Allah?\"As the king of",
                " Egypt was one of the \"gods\" they",
                " had set up, so to offer services",
                " to carry on the work of the",
                " unIslamic system under the existing un-Islamic law",
                " would have been tantamount to acknowledging the",
                " king as his Lord. Are they prepared",
                " to place Prophet Joseph in that position?",
                "",
                "It is an irony that such Muslims",
                " as interpret this verse in this way,",
                " lower the character of Prophet Joseph. They",
                " have evinced the same mentality that the",
                " Jews had developed during the period of",
                " their degeneration. When they became morally and",
                " mentally depraved, they deliberately began to represent",
                " their Prophets and saints as people of",
                " low character like themselves in order to",
                " justify their own degraded characters and to",
                " make room for excuses for going still",
                " lower. Likewise, when the Muslims came under",
                " the sway of non-Muslim governments, they wanted",
                " to serve under them, but the teachings",
                " of Islam and the patterns of their",
                " worthy forefathers stood in their way and",
                " they felt ashamed of this. So, in",
                " order to pacify their consciences, they sought",
                " refuge in this verse and by its",
                " misinterpretation thought that that great Prophet had",
                " made an application for a post to",
                " serve under a non-Muslim under un-lslamic laws.",
                " Whereas the Prophet's own life taught the",
                " lesson that even a single Muslim could",
                " all by himself bring about the Islamic",
                " revolution in a whole country by his",
                " pure Islamic character, his Faith, intelligence and",
                " wisdom and that a true Believer is",
                " able to conquer, by the proper use",
                " of his moral character, a whole country",
                " without any army, ammunition or material provisions.",
                ""
            ]
        },
        {
            "id": "[12:56]",
            "verse": "And thus We established Joseph in the land to settle therein wherever he willed. We touch with Our mercy whom We will, and We do not allow to be lost the reward of those who do good.",
            "description": [
                "This is to show that the whole",
                " land of Egypt was under his complete",
                " control, as if it belonged to him",
                " and he could claim any piece of",
                " it as his, and there was no",
                " piece of it that could be withheld",
                " from him. The early commentators have also",
                " made the same comment on this verse.",
                " For instance, 'Allamah Ibn Jarir Tabari, on",
                " the authority of Ibn Zaid, says that",
                " this verse means: \"We made Joseph the",
                " owner of alI those things that were",
                " in Egypt, and in this part of",
                " the world he could do whatever he",
                " liked and wherever he liked for he",
                " had been given complete authority over this",
                " land. So much so that he could",
                " bring Pharaoh under his sway and become",
                " his master, if he so desired\". He",
                " has quoted another thing from Mujahid, who",
                " is one of the most learned commentators,",
                " to the effect that the King of",
                " Egypt had embraced Islam through Prophet Joseph.",
                ""
            ]
        },
        {
            "id": "[12:57]",
            "verse": "And the reward of the Hereafter is better for those who believed and were fearing Allah.",
            "description": [
                "This is a warning against a misunderstanding",
                " that one might have had from the",
                " preceding verse that kingdom and power were",
                " the real ultimate rewards for virtue and",
                " righteousness, for the best reward that a",
                " Believer should desire and strive for will",
                " be the one that Allah will bestow",
                " upon Believers in the Hereafter."
            ]
        },
        {
            "id": "[12:58]",
            "verse": "And the brothers of Joseph came [seeking food], and they entered upon him; and he recognized them, but he was to them unknown.",
            "description": [
                "The events of several years after his",
                " coming into power have been left out",
                " for the sake of brevity, and the",
                " story has been resumed from the time",
                " when the brothers of Prophet Joseph came",
                " to Egypt, and paved the way for",
                " the eventual settlement of the Israelites in",
                " Egypt. It will, however, be worthwhile to",
                " have a glimpse of those events. During",
                " the first seven years of his reign,",
                " there was abundance of corn as he",
                " had predicted while interpreting the dream of",
                " the king. Accordingly he adopted all the",
                " measures he had put before the king",
                " concerning the years of plenty. Then the",
                " seven years of scarcity began and famine",
                " reigned not only over Egypt but all",
                " over the adjoining countries. Accordingly, Syria, Palestine,",
                " Trans-Jordan and the Northern part of Arabia",
                " began to suffer from the scarcity of",
                " food, but there was plenty of it",
                " in Egypt in spite of famine because",
                " of the wise steps Prophet Joseph had",
                " taken as a safeguard. That was why",
                " his brothers, like other neighbouring people, were",
                " forced by circumstances to go to Egypt",
                " and present themselves before him. It appears",
                " that Prophet Joseph had so arranged things",
                " that no foreigner was allowed to buy",
                " corn without a special permit from him.",
                " Therefore when the brothers reached Egypt, they",
                " might have had to present themselves before",
                " him for obtaining the special permit for",
                " buying the fixed quantity allowed under the",
                " famine regulations.",
                "*51) It is no wonder",
                " that his brothers could not recognize Prophet",
                " Joseph, for, when they cast him into",
                " the well, he was merely a lad",
                " of seventeen and at the time of",
                " their meeting, he was a grown up",
                " man of thirty-eight years or so. Naturally,",
                " he must have changed in form during",
                " this long period. Besides, they could never",
                " have imagined that the brother whom they",
                " had cast into the well had become",
                " the ruler of Egypt."
            ]
        },
        {
            "id": "[12:59]",
            "verse": "And when he had furnished them with their supplies, he said, \"Bring me a brother of yours from your father. Do not you see that I give full measure and that I am the best of accommodators?",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:60]",
            "verse": "But if you do not bring him to me, no measure will there be [hereafter] for you from me, nor will you approach me.\"",
            "description": [
                "As the Qur'an has omitted the details,",
                " someone might be at a loss to",
                " know as to how he brought Benjamin",
                " into the conversation with his brothers, and",
                " why he insisted on them to bring",
                " him with them, when he intended to",
                " keep his own identity secret from them.",
                " For, obviously these things might have led",
                " to the revelation of that secret. But",
                " a little thinking will show that he",
                " could have very easily and naturally led",
                " the conversation up to Benjamin without arousing",
                " their curiosity. As there were strict restrictions",
                " on the purchase of corn, everyone was",
                " permitted to buy only a fixed quantity",
                " of it. Most probably the ten brothers",
                " had applied for corn for their father",
                " and the eleventh brother as well. At",
                " this Prophet Joseph might have asked the",
                " reason why their father and brother had",
                " not personally come for it. Then he",
                " might have accepted the excuse for their",
                " father that he was old and blind",
                " but he would have expressed his doubts",
                " about their excuse for their brother that",
                " he was their step-brother and the father",
                " would not send him with them and",
                " so forth. Then he might have declared,",
                " \"Well, this time we give you as",
                " much corn as you have asked for,",
                " but the next time you come here",
                " you should bring your step-brother with you;",
                " otherwise you will not get any corn",
                " at all because of this false statement",
                " of yours.\" Along with this threat, he",
                " tried to win them over by reminding",
                " them of his liberal and generous treatment",
                " with them, because he yearned for the",
                " sight of his younger brother, and was",
                " anxious to know how his family had",
                " fared during his absence.",
                "The above is",
                " a simple and natural explanation of the",
                " matter. Thus this part of the story",
                " as given in the Bible (Gen. chapters",
                " 42 and 43) appears to be farfetched,",
                " exaggerated, unreal and, therefore, un-reliable."
            ]
        },
        {
            "id": "[12:61]",
            "verse": "They said, \"We will attempt to dissuade his father from [keeping] him, and indeed, we will do [it].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:62]",
            "verse": "And [Joseph] said to his servants, \"Put their merchandise into their saddlebags so they might recognize it when they have gone back to their people that perhaps they will [again] return.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:63]",
            "verse": "So when they returned to their father, they said, \"O our father, [further] measure has been denied to us, so send with us our brother [that] we will be given measure. And indeed, we will be his guardians.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:64]",
            "verse": "He said, \"Should I entrust you with him except [under coercion] as I entrusted you with his brother before? But Allah is the best guardian, and He is the most merciful of the merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:65]",
            "verse": "And when they opened their baggage, they found their merchandise returned to them. They said, \"O our father, what [more] could we desire? This is our merchandise returned to us. And we will obtain supplies for our family and protect our brother and obtain an increase of a camel's load; that is an easy measurement.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:66]",
            "verse": "[Jacob] said, \"Never will I send him with you until you give me a promise by Allah that you will bring him [back] to me, unless you should be surrounded by enemies.\" And when they had given their promise, he said, \"Allah, over what we say, is Witness.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:67]",
            "verse": "And he said, \"O my sons, do not enter from one gate but enter from different gates; and I cannot avail you against [the decree of] Allah at all. The decision is only for Allah; upon Him I have relied, and upon Him let those who would rely [indeed] rely.\"",
            "description": [
                "Prophet Jacob's great concern over this journey",
                " of his sons was due to the",
                " fact that his youngest son, Benjamin, was",
                " to accompany them. He was anxious about",
                " his safety because he had already had",
                " a sad experience of his son, Joseph.",
                " Naturally his heart must have been full",
                " of such misgivings that that might be",
                " his last meeting with his other beloved",
                " son. Though he had full trust in",
                " Allah and was patiently resigned to His",
                " will, he, as a human being, advised",
                " his sons to take certain precautionary measures.",
                " In order to understand the significance of",
                " this precautionary measure of entering the capital",
                " by different gates, we should have a",
                " glimpse of the political conditions of that",
                " period. As the Israelites lived on the",
                " Eastern frontier of Egypt as independent clans,",
                " they were looked at with suspicion like",
                " all frontier people. Therefore Prophet Jacob feared",
                " that if they entered the city in",
                " a group, they might be taken for",
                " a gang of suspects, especially during that",
                " time of famine. Thus there was an",
                " apprehension of some severe action being taken",
                " against them as if they had come",
                " there for organized robbery. That was why",
                " he gave them this allowance that if",
                " under such adverse circumstances there was any",
                " trouble, he would not accuse them of",
                " breach of the pledge for the safety",
                " of Benjamin."
            ]
        },
        {
            "id": "[12:68]",
            "verse": "And when they entered from where their father had ordered them, it did not avail them against Allah at all except [it was] a need within the soul of Jacob, which he satisfied. And indeed, he was a possessor of knowledge because of what We had taught him, but most of the people do not know.",
            "description": [
                "\"Most people do not understand. . .",
                " . \" how Prophet Jacob was able",
                " to hold the balance between \"trust in",
                " Allah\" and adoption of precautionary measures. This",
                " was because Allah had favoured him with",
                " the real knowledge. That was why he",
                " took all those measures which were dictated",
                " by common sense, deep thinking and experience.",
                " He admonished them for their ill treatment",
                " with their brother Joseph so that they",
                " should not dare repeat it in the",
                " case of Benjamin. He took a solemn",
                " pledge from them in the name of",
                " AIlah that they would take good care",
                " of the safety of their step-brother. Then",
                " he advised them to be on their",
                " guard against the dangerous political situation and",
                " to enter the capital by different gates",
                " so as not to give cause for",
                " alarm and suspicion. In short, as far",
                " as it was humanly possible, he took",
                " all the precautionary measures to avoid every",
                " possible risk. On the other hand, he",
                " always kept this thing in view (and",
                " expressed it) that no human precautionary measure",
                " could avert the enforcement of Allah's will,",
                " and that the real protection was Allah's",
                " protection: and that one should not rely",
                " on the precautionary measures but on the",
                " favour of AIlah. Obviously only that person",
                " who has the real knowledge can keep",
                " such a balance in his words and",
                " deeds, who knows what kind of efforts",
                " are demanded of his human faculties bestowed",
                " by Allah for the solution of worldly",
                " problems, who also realizes that it is",
                " Allah alone Who has the power to",
                " make them a success or a failure.",
                " This is \"what most people do not",
                " understand\" . Some of them rely merely",
                " on their efforts and measures and discard",
                " trust in Allah; while there are others",
                " who rely merely on \"trust in AIlah\"",
                " and do not adopt any practical measure",
                " to solve their problem."
            ]
        },
        {
            "id": "[12:69]",
            "verse": "And when they entered upon Joseph, he took his brother to himself; he said, \"Indeed, I am your brother, so do not despair over what they used to do [to me].\"",
            "description": [
                "The whole story of their reunion after",
                " a separation of twenty years or so",
                " has been summed up in this brief",
                " sentence. In all probability Prophet Joseph aught",
                " have told him the story of the",
                " vicissitudes that ultimately had led to his",
                " high rank, and Benjamin in his turn",
                " might have related the story of the",
                " iII-treatment of the heartless step-brothers. Then Prophet",
                " Joseph might have reassured him that Ire",
                " would not be allowed to go back",
                " with them but remain with him. It",
                " is also possible that the plan to",
                " retain him there, without disclosing the secret",
                " of Prophet Joseph's identity, would have then",
                " been thought out and decided upon."
            ]
        },
        {
            "id": "[12:70]",
            "verse": "So when he had furnished them with their supplies, he put the [gold measuring] bowl into the bag of his brother. Then an announcer called out, \"O caravan, indeed you are thieves.\"",
            "description": [
                "In all probability, Prophet Joseph put the",
                " cup in his brother's pack with his",
                " knowledge and consent, as may be inferred",
                " from the preceding verse. Obviously. Prophet Joseph",
                " desired to free his brother from the",
                " oppression of the cruel step-brothers and he",
                " himself was reluctant to go back with",
                " them. But this could not be done",
                " directly and openly without disclosing his own",
                " identity, which was not then expedient under",
                " the circumstances. Therefore both the brothers might",
                " have thought out this plan, though this",
                " would have put the younger brother in",
                " an embarrassing situation for the time being",
                " because of his involvement in a case",
                " of theft. But they had adopted this",
                " plan because afterwards both the brothers could",
                " clear it easily by disclosing the real",
                " matter.",
                "*57) There is nothing in this",
                " verse nor in the succeeding verses to",
                " show that Prophet Joseph took his servants",
                " in his confidence in regard to this",
                " matter, and instructed them to bring a",
                " false accusation against the travellers. The simple",
                " explanation of the incident may be this.",
                " The cup might have been quietly and",
                " secretly put in the pack. Afterwards when",
                " the servants did not find it, they",
                " might have come to the inevitable conclusion",
                " that it must have been stolen by",
                " the travellers who were staying there."
            ]
        },
        {
            "id": "[12:71]",
            "verse": "They said while approaching them, \"What is it you are missing?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:72]",
            "verse": "They said, \"We are missing the measure of the king. And for he who produces it is [the reward of] a camel's load, and I am responsible for it.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:73]",
            "verse": "They said, \"By Allah, you have certainly known that we did not come to cause corruption in the land, and we have not been thieves.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:74]",
            "verse": "The accusers said, \"Then what would be its recompense if you should be liars?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:75]",
            "verse": "[The brothers] said, \"Its recompense is that he in whose bag it is found - he [himself] will be its recompense. Thus do we recompense the wrongdoers.\"",
            "description": [
                "It should be kept in mind that",
                " these people were the descendants of Prophet",
                " Abraham. Therefore they put forward his law",
                " regarding a thief, that is, the thief",
                " should be made the bondsman of the",
                " one whose goods he had stolen."
            ]
        },
        {
            "id": "[12:76]",
            "verse": "So he began [the search] with their bags before the bag of his brother; then he extracted it from the bag of his brother. Thus did We plan for Joseph. He could not have taken his brother within the religion of the king except that Allah willed. We raise in degrees whom We will, but over every possessor of knowledge is one [more] knowing.",
            "description": [
                "Now Iet us consider the question: How",
                " did AIlah directly support Prophet Joseph with",
                " His plan? It is obvious that the",
                " plan of placing the cup in Benjamin's",
                " pack was thought out and executed by",
                " Joseph himself. And it is also obvious",
                " that the royal servants checked their packs",
                " as a matter of routine for such",
                " is the procedure that is generally followed",
                " on such occasions. There is nothing in",
                " this passage that might be called supernatural",
                " support by Allah except that the servants",
                " asked the brothers to prescribe the punishment",
                " for the thief, and they answered that",
                " he should be made a bondsman. The",
                " sentence that follows also confirms this interpretation.",
                "",
                "*60) Had AIIah willed it, He would",
                " not have removed the flaw in the",
                " plan of Prophet Joseph. It was this:",
                " he could seize his brother according to",
                " his plan only by the help of",
                " the king's law, but it was not",
                " worthy of a Prophet of Allah to",
                " apply that un-lslamic law to his own",
                " personal case. For he had taken political",
                " power in his hands in order to",
                " establish gradually the Islamic law and not",
                " to enforce and keep the king's law",
                " in vogue. Had Allah willed it, He",
                " would have left no other course for",
                " His Prophet except to have resort to",
                " the un-Islamic law. But He did not",
                " will it so because He did not",
                " like to tarnish the fair name of",
                " His Prophet. Therefore he made the servants",
                " enquire from the brothers (an unusual thing)",
                " about the punishment of a thief and",
                " they stated the Law of Prophet Abraham.",
                " Thus not only was the flaw removed,",
                " but also no room was left for",
                " the brothers to raise any objection against",
                " this on the plea that they were",
                " not Egyptians, and therefore the law of",
                " the land could not be applied against",
                " them. As has already been pointed out,",
                " this was the support of Allah to",
                " which He has referred in the two",
                " subsequent verses as a token of His",
                " favour and a sign of the perfection",
                " of His knowledge.",
                "The favour of Allah",
                " was that He saved Prophet Joseph from",
                " applying the un-Islamic law of the king",
                " of Egypt to his personal case, for",
                " he was liable to do so under",
                " the stress of human weakness. And there",
                " can be no greater favour for one",
                " than this that AIlah Himself should arrange",
                " to guard his high moral position. It",
                " should, however, be noted that such a",
                " high rank is awarded only to those",
                " who prove themselves to be \"righteous\" in",
                " very hard trials.",
                "By removing the flaw",
                " in his plan, Allah showed that His",
                " knowledge was far superior to the knowledge",
                " of those, whom (like Prophet Joseph) He",
                " had endowed with knowledge.",
                "In this connection,",
                " there are some other points worthy of",
                " consideration and we will deal with them",
                " briefly:",
                "(1) Generally the words BaaaC ail",
                " iY DYQia oaCoBcoa are translated like this:",
                " \"Joseph could not seize his brother by",
                " the law of the king\", or \"Joseph",
                " was not authorized to seize his brother",
                " according to the law of the king.",
                " \" In other words, it means, \"He",
                " could not do this, as there was",
                " no provision for it in the king's",
                " law.\" Whereas it means this: \"He ought",
                " not to have seized him by the",
                " king's law, as it did not behove",
                " him to do so.\" This version is",
                " open to two objections. Firstly, this is",
                " against the Qur'anic usage of as aCB",
                " Ca which usually means, \"It did not",
                " behove him\", \"It was not right for",
                " him\" and \"He ought not to have",
                " done this.\" For instance, this is what",
                " it means in the following verses",
                "\"Indeed,",
                " Islam alone is the Right Way in",
                " the sight of Allah.\" (III: 18). \"Whosoever",
                " will adopt any other way than the",
                " way of Islam, it shall not be",
                " accepted....\" (III:85).",
                "Secondly, such a version is",
                " meaningless, for there could have been no",
                " reason why he had not the power",
                " to seize him for theft according to",
                " the law of the king. Can there",
                " be any kingdom without having a law",
                " for taking action against a thief?",
                "(2)",
                " As the Qur'an uses the word BaaaC",
                " ai'I which connotes \"the king's way of",
                " life\" in addition to \"the king's law\",",
                " it helps to understand the meaning of",
                " the sentence under discussion. For it is",
                " obvious that the Prophet was sent to",
                " establish the way of Allah and not",
                " the un-Islamic way of the king. Though",
                " by that time he had only partially",
                " succeeded in this Mission, it was not",
                " proper and worthy of a Prophet to",
                " adopt \"the way of the king\" for",
                " his own personal case. Though there was",
                " no legal hindrance in his way to",
                " seize his brother according to the king's",
                " law, nevertheless, it was inappropriate for him,",
                " as a Prophet, to adopt the king's",
                " way which he had hitherto scrupulously avoided",
                " as far as his own person was",
                " concerned. Thus it is clear that its",
                " appropriate interpretation will be this: \"It did",
                " not behove Joseph to seize his brother",
                " by the king's law. \"",
                "(3) Besides",
                " this, by using the word for the",
                " \"law of the land\", AIlah has denoted",
                " the vast comprehension of the word (din)",
                " and this cuts at the root of",
                " the conception of din of those people",
                " who confine the scope of the Message",
                " of the Prophets to mere worship of",
                " One Allah and believe that it has",
                " nothing to do with the cultural, political,",
                " social, judicial, legal and other mundane affairs",
                " of life. Or, they opine that, if",
                " at all it has any concern with",
                " those matters, it is merely to give",
                " some instructions of an optional nature in",
                " regard to these, and leave it to",
                " the believers to adopt these or their",
                " own man-made laws, because, they think, there",
                " is no harm even in adopting the",
                " latter course. This erroneous conception of din,",
                " which has been in vogue among the",
                " Muslims for a long time, has been",
                " responsible for rendering them neglectful of making",
                " exertions for the establishment of the Islamic",
                " Way of life. As a result of",
                " this misconception of din, they became reconciled",
                " to un-Islamic ways of unbelief and ignorance.",
                " Nay, they considered this misconception of theirs",
                " to be the pattern set by Prophet",
                " Joseph and became willing helpers and servants",
                " of these un-Islamic systems. Whereas this verse",
                " categorically refutes this misconception by declaring that",
                " the \"law of the land\" is as",
                " much a part of the din of",
                " Allah as Salat, Haj, Fast, and Zakat",
                " are. Therefore, the demand of the acceptance",
                " of aiIaC (ad-Din) made in v. 19",
                " and v. 85 of Al-i'Imran, that is,",
                " \"Indeed, Islam alone is aiIaC the Right",
                " Way, in the sight of Allah\" and",
                " \"Whosoever will adopt any other way (aiI),",
                " than the' Way of Islam, it shall",
                " not be accepted\", includes laws as well",
                " as Salat and other obligatory duties prescribed",
                " by Allah. Therefore the exclusion of this",
                " part of din from any system would",
                " incur the displeasure of Allah.",
                "(4) The",
                " above interpretation, however, is open to one",
                " objection. It does, at least, imply that",
                " an un-Islamic way was in vogue in",
                " Egypt at the time, when Prophet Joseph",
                " was, even according to the present commentator,",
                " the supreme head of the country. It",
                " is, therefore, a proof that that Prophet",
                " himself was enforcing the un-Islamic law of",
                " the king. What difference, then, could it",
                " have made, if Prophet Joseph had followed,",
                " in his personal case too, the system",
                " of law of the king which he",
                " himself was enforcing instead of the system",
                " of law of Prophet Abraham? Most certainly",
                " this would have made a vast difference",
                " because it would have compromised his position",
                " as a Prophet, because he was trying",
                " to establish the Islamic Way of life,",
                " which naturally could have been accomplished gradually",
                " in course of time, during which the",
                " king's law would have inevitably remained in",
                " vogue. The same thing happened in Arabia",
                " during the Mission of the Holy Prophet",
                " in Madinah, which took nine years to",
                " establish the Islamic System in its entirety.",
                " During that period, several unIslamic laws remained",
                " in vogue. For instance, drinking, interest, the",
                " unIslamic laws of inheritance and marriage and",
                " some wrong ways of trade, etc., had",
                " to continue for some time. Likewise the",
                " civil and penal codes of Islam took",
                " some time for their complete introduction. So",
                " there is nothing strange in this that",
                " the king's law continued to be in",
                " vogue during the first nine years or",
                " so of Prophet Joseph's reign. But the",
                " continuance of the unIslamic law of the",
                " king during the period of transition is",
                " no argument to prove that Allah's Prophet",
                " was sent to follow the way of",
                " the king and not to establish the",
                " Way of Allah."
            ]
        },
        {
            "id": "[12:77]",
            "verse": "They said, \"If he steals - a brother of his has stolen before.\" But Joseph kept it within himself and did not reveal it to them. He said, \"You are worse in position, and Allah is most knowing of what you describe.\"",
            "description": [
                "As regards the question why it was",
                " not worthy of Prophet Joseph to apply",
                " the king's law to his personal case,",
                " its best answer is again found in",
                " the practice of the Holy Prophet. During",
                " the interim period, when the laws of",
                " ignorance had not yet been replaced by",
                " Islamic Laws, other Muslims went on drinking",
                " wine and taking interest as before, but",
                " the Holy Prophet never practiced any of",
                " these things. Likewise some un-Islamic laws of",
                " marriage, such as taking in marriage of",
                " real sisters at one and the same",
                " time, were practised, but the Holy Prophet",
                " never practised any such thing. Thus it",
                " is clear, that there was a difference",
                " between leaving in vogue some un-Islamic laws",
                " during the period of the evolution of",
                " the Islamic Law and practising the same.",
                " Had Prophet Joseph applied the king's law",
                " to his own case, it would have",
                " meant that he had lent his seeming",
                " sanction to that law. But it is",
                " obvious that a Prophet, who is sent",
                " to eliminate the ways of ignorance. cannot",
                " follow these even under the temporary leave",
                " that is given to others.",
                "Their position",
                " and dissociated themselves from Benjamin, declaring that",
                " he was a thief like his brother",
                " Joseph. It is obvious that this was",
                " a false accusation the clever brothers had",
                " invented on the spot. But it is",
                " an instance of the malice these brothers",
                " bore to their two step-brothers, and is",
                " also the answer to the question why",
                " Prophet Joseph desired to keep his brother",
                " with him."
            ]
        },
        {
            "id": "[12:78]",
            "verse": "They said, \"O 'Azeez, indeed he has a father [who is] an old man, so take one of us in place of him. Indeed, we see you as a doer of good.\"",
            "description": [
                "The use of the title (\"The exalted",
                " one\") with which they addressed Prophet Joseph",
                " has given rise to the confusion that",
                " he held the same office as the",
                " husband of Zelicha held before him. Then",
                " this misunderstanding Iet the commentators to the",
                " invention of further comments, such as. AI-'Aziz",
                " had died and Prophet Joseph was appointed",
                " in his place, and Zelicha was rejuvenated",
                " by a miracle and married to him",
                " by the king. They have not stopped",
                " at this: they have, somehow or other,",
                " discovered even the conversation that took place",
                " between Prophet Joseph and Zelicha in the",
                " first night of their marriage. In fact.",
                " aII this is mere fiction, for, as",
                " has already been pointed out, the word",
                " was the Arabic translation or equivalent of",
                " some Egyptian title, and was not the",
                " designation of any particular office. It was",
                " merely a title used for the high",
                " ones in Egypt like \"His Excellency\" or",
                " \"Your Excellency\", etc. As regards the said",
                " marriage, this fiction has been built on",
                " the story of Prophet Joseph's marriage in",
                " the Bible and the Talmud. According to",
                " these, he was married with Asenath, the",
                " daughter of Poti-pherah. As the name of",
                " the husband of Zelicha was Potiphar, the",
                " two names got confused together. Accordingly, when",
                " the story was handed down from the",
                " traditions of the Israelites from one commentator",
                " to the other, the name Potiphar got",
                " interchanged with Poti-pherah because the two were",
                " so like each other in sound. Consequently,",
                " the daughter in the story was replaced",
                " by \"wife\". Then Potiphar was \"killed\" in",
                " order to facilitate the marriage. Then the",
                " only remaining difficulty, that is,the disparity of",
                " their ages, was got over with the",
                " help of a miracle. She was rejuvenated",
                " so completely as to enable her to",
                " become the worthy wife of the \"ruler\"",
                " of the land."
            ]
        },
        {
            "id": "[12:79]",
            "verse": "He said, \"[I seek] the refuge of Allah [to prevent] that we take except him with whom we found our possession. Indeed, we would then be unjust.\"",
            "description": [
                "The use of the words \"with whom",
                " we have found our property\" instead of",
                " the word \"thief\" is very significant. Prophet",
                " Joseph avoided the use of the word",
                " \"thief\" for his brother because he was",
                " not really a thief. This is called",
                " aiNaeE (touriyah), that is, to put a",
                " cover over a reality or \"to hide",
                " a reality.\" Such a practice is allowed",
                " by the Muslim Law under certain conditions",
                " and with certain limitations. It may be",
                " practised not to gain any selfish end,",
                " but to ward off some evil or",
                " to protect and save an oppressed person",
                " from some oppressor, provided that no other",
                " course might have been left except saying",
                " something against the truth or of having",
                " a resort to a deceitful device. It",
                " is obvious that in such a case,",
                " a righteous person will not tell a",
                " blunt lie or resort to an open",
                " deceit. Instead, he will say something or",
                " do something that might not be strictly",
                " truthful or strictly right, yet at the",
                " same time is not a blunt lie,",
                " so that he might hide the reality",
                " to ward off the evil. Such a",
                " practice is lawful, legally and morally, provided",
                " that it is not practised to gain",
                " some personal or selfish ends but to",
                " ward off a greater evil with a",
                " lesser evil. Accordingly, Prophet Joseph scrupulously fulfilled",
                " all the conditions in this case. He",
                " placed the cup in the pack of",
                " his brother with his consent, but he",
                " did not ask his servants to make",
                " a search of his pack and accuse",
                " him of theft. After this, when the",
                " servants brought the brothers before him as",
                " suspects, he quietly rose from his seat",
                " and began to make a search of",
                " their packs. Then afterwards, when the brothers",
                " requested that one of them should be",
                " taken instead of Benjamin, he answered them",
                " back in their own words that he",
                " would detain only that person in whose",
                " possession the cup was found and none",
                " else.",
                "Instances of such a practice during",
                " his campaigns are found in the life",
                " history of the Holy Prophet. And this",
                " cannot be regarded as morally objectionable according",
                " to any moral or legal standard."
            ]
        },
        {
            "id": "[12:80]",
            "verse": "So when they had despaired of him, they secluded themselves in private consultation. The eldest of them said, \"Do you not know that your father has taken upon you an oath by Allah and [that] before you failed in [your duty to] Joseph? So I will never leave [this] land until my father permits me or Allah decides for me, and He is the best of judges.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:81]",
            "verse": "Return to your father and say, \"O our father, indeed your son has stolen, and we did not testify except to what we knew. And we were not witnesses of the unseen,",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:82]",
            "verse": "And ask the city in which we were and the caravan in which we came - and indeed, we are truthful,\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:83]",
            "verse": "[Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. Perhaps Allah will bring them to me all together. Indeed it is He who is the Knowing, the Wise.\"",
            "description": [
                "That is, \"You readily believed that my",
                " son, whom I know to be of",
                " a noble character, had committed the theft",
                " of a cup: you have behaved in",
                " his case just as you behaved in",
                " the case of his elder brother. You",
                " made away with him and then pretended,",
                " without any pangs of conscience, that a",
                " wolf had devoured him and now, with",
                " the same ease, you tell me that",
                " the other brother has committed a theft\".",
                ""
            ]
        },
        {
            "id": "[12:84]",
            "verse": "And he turned away from them and said, \"Oh, my sorrow over Joseph,\" and his eyes became white from grief, for he was [of that] a suppressor.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:85]",
            "verse": "They said, \"By Allah, you will not cease remembering Joseph until you become fatally ill or become of those who perish.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:86]",
            "verse": "He said, \"I only complain of my suffering and my grief to Allah, and I know from Allah that which you do not know.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:87]",
            "verse": "O my sons, go and find out about Joseph and his brother and despair not of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:88]",
            "verse": "So when they entered upon Joseph, they said, \"O 'Azeez, adversity has touched us and our family, and we have come with goods poor in quality, but give us full measure and be charitable to us. Indeed, Allah rewards the charitable.\"",
            "description": [
                "That is, \"It will be charitable of",
                " you if you give us that much",
                " grain as we require to fulfil our",
                " needs, because the goods we have brought",
                " for its barter are of less value",
                " than of the grain we require.\""
            ]
        },
        {
            "id": "[12:89]",
            "verse": "He said, \"Do you know what you did with Joseph and his brother when you were ignorant?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:90]",
            "verse": "They said, \"Are you indeed Joseph?\" He said \"I am Joseph, and this is my brother. Allah has certainly favored us. Indeed, he who fears Allah and is patient, then indeed, Allah does not allow to be lost the reward of those who do good.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:91]",
            "verse": "They said, \"By Allah, certainly has Allah preferred you over us, and indeed, we have been sinners.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:92]",
            "verse": "He said, \"No blame will there be upon you today. Allah will forgive you; and He is the most merciful of the merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:93]",
            "verse": "Take this, my shirt, and cast it over the face of my father; he will become seeing. And bring me your family, all together.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:94]",
            "verse": "And when the caravan departed [from Egypt], their father said, \"Indeed, I find the smell of Joseph [and would say that he was alive] if you did not think me weakened in mind.\"",
            "description": [
                "This is an instance of the extraordinary",
                " powers the Prophets possess. Prophet Jacob perceive",
                " in Cana'an the smell of Prophet Joseph's",
                " shirt from such a distant place as",
                " Egypt as soon as the caravan started",
                " on the journey. At the same time",
                " it also. shows, by contrast, that these",
                " powers of the Prophets are not inherent",
                " or personal characteristics but arc bestowed on",
                " them by Allah as and when He",
                " wills. That is why Prophet Jacob could",
                " not perceive the smell of the clothes",
                " of Prophct Joseph as long as Allah",
                " did not will it, when he had",
                " been living in Egypt.",
                "In this connection,",
                " it should also be noted that in",
                " contrast to the Qur'an which represents Prophct",
                " Jacob as a great Prophet who was",
                " able to perceive the smell of Prophet",
                " Joseph from such a long distance, the",
                " Bible represents him as an ordinary uncultured",
                " father. According tc Genesis 45: 26-27, when",
                " they told him, saying, \"Joseph is yet",
                " alive and he is governor over all",
                " the land of Egypt-Jacob's heart fainted, for",
                " he believed them not .... and only",
                " when he saw the wagons which Joseph",
                " had sent to carry him, the spirit",
                " of Jacob their father revived. \""
            ]
        },
        {
            "id": "[12:95]",
            "verse": "They said, \"By Allah, indeed you are in your [same] old error.\"",
            "description": [
                "This remark shows that no member of",
                " his family except Prophct Joseph appreciated the",
                " true worth of Prophet Jacob. He himself",
                " was aware of the low state of",
                " their mental and moral condition. And it",
                " is one of the ironies of fate",
                " that the majority of the great personalities",
                " who made history got very little appreciation",
                " at home."
            ]
        },
        {
            "id": "[12:96]",
            "verse": "And when the bearer of good tidings arrived, he cast it over his face, and he returned [once again] seeing. He said, \"Did I not tell you that I know from Allah that which you do not know?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:97]",
            "verse": "They said, \"O our father, ask for us forgiveness of our sins; indeed, we have been sinners.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:98]",
            "verse": "He said, \"I will ask forgiveness for you from my Lord. Indeed, it is He who is the Forgiving, the Merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:99]",
            "verse": "And when they entered upon Joseph, he took his parents to himself and said, \"Enter Egypt, Allah willing, safe [and secure].\"",
            "description": [
                "It is worthwhile to take notice of",
                " the total number of Prophet Jacob's family",
                " members that migrated to Egypt with him,",
                " for it is closely connected with the",
                " problem that is raised concerning the total",
                " number of the Israelites who emigrated from",
                " there some five hundred years after this.",
                " According to the Bible, the total number",
                " of the family members was 70, including",
                " Prophct Joseph and his two sons, and",
                " excluding those daughters-in-law who did not belong",
                " to the family of Prophet Jacob. But",
                " according to the census figures given in",
                " Numbers, their number was about two million",
                " when they were counted in the wilderness",
                " of Sinai in the second year, \"after",
                " they were come out of the land",
                " of Egypt\" . The problem is this:",
                " how is it possible that \"these three",
                " score and ten souls of his house\"",
                " had multiplied into two million souls during",
                " five hundred years or so?",
                "It is",
                " obvious that no family can multiply to",
                " such a large number in five hundred",
                " years merely by the generative process. Thus",
                " the only other way in which their",
                " number could have been increased was proselytism.",
                " And there are sound reasons to believe",
                " that this must have been so. The",
                " Israelites were the descendants of Prophets. They",
                " had migrated to Egypt because of the",
                " power Prophet Joseph enjoyed there. And we",
                " have seen that he made full use",
                " of every opportunity he got for carrying",
                " out the work of the Mission of",
                " Prophethood. Therefore it may reasonably be expected",
                " that the Israelites would have done their",
                " very best to convert the Egyptians to",
                " their faith of Islam during the five",
                " centuries of their power in Egypt. As",
                " a result of this the Egyptian converts",
                " to Islam would not only havc changed",
                " their religion but also their culture so",
                " as to make them look quite different",
                " from the other Egyptians and look like",
                " the Israelites. Naturally the non Muslim Egyptians",
                " would have declared them to be foreigners",
                " just as the Hindus treat the Indian",
                " Muslims of today. By and by they",
                " themselves would havc accepted this position and",
                " become members of the Israelite nationality. Afterwards,",
                " when the Egyptian nationalists began to persecute",
                " the alien Israelites, the Muslim Egyptians were",
                " also made a target of their tyranny.",
                " So when the Israelites migrated from Egypt,",
                " they, too, left their country along with",
                " them and began to be counted among",
                " them.",
                "The above mentioned explanation is confirmed",
                " by the Bible also. For instance, it",
                " says that when they left Egypt, \"the",
                " children of Israel journeyed from Remases to",
                " Suceoth....and a mixed multitude went up also",
                " with them....\" (Exodus 12: 37-38) and \"the",
                " mix multitude that was among them fell",
                " a lusting\" . (Numbers 11: 4). Then",
                " by and by these non-Israelite converts to",
                " Islam began to be called \"the stranger\".",
                " \"One ordinance shall be both for you",
                " of the congregation, and also for the",
                " stranger that sojourneth with you, an ordinance",
                " for ever in your generations: as ye",
                " are, so shall the stranger be before",
                " the Lord. One law and the one",
                " manner shall be for you, and for",
                " the stranger that sojourneth with you. \"",
                " (NUMBERS 15: 15-16). \"And I charged your",
                " judges at that time, saying, Hear the",
                " causes between your brethren, and judge righteously",
                " between every man and his brother, and",
                " the stranger that is with him.\" (DEUT.",
                " 1: 16).",
                "Now it is not an",
                " easy thing to fmd out the exact",
                " term which was applied in the original",
                " Scriptures to the Egyptian converts to Islam,",
                " and which was afterwards changed into the",
                " \"stranger\" by that translators."
            ]
        },
        {
            "id": "[12:100]",
            "verse": "And he raised his parents upon the throne, and they bowed to him in prostration. And he said, \"O my father, this is the explanation of my vision of before. My Lord has made it reality. And He was certainly good to me when He took me out of prison and brought you [here] from bedouin life after Satan had induced [estrangement] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.",
            "description": [
                "According to the Talmud, \"When Joseph learned",
                " that his father was upon the way,",
                " he gathered together his friends and officers,",
                " and soldiers of the realm, attired in",
                " rich garments, . . . . and",
                " formed a great company to meet Prophet",
                " Jacob on the way and escort him",
                " to Egypt. Music and gladness filled the",
                " land, and all the people, the women",
                " and the children, assembled on the house-tops",
                " to view the magnificent display.\" (H. Polano,",
                " p. 111).",
                "*70) The interpretation of this",
                " verse has given rise to some serious",
                " misunderstandings, which are against the very fundamentals",
                " of the Divine Guidance. So much so",
                " that some people have gone to the",
                " extreme of making it lawful to prostrate",
                " before kings and saints as a mark",
                " of respect. Others more strict on this",
                " point have explained it away, saying, \"In",
                " the former Divine Laws, it was unlawful",
                " only to prostrate in worship before others",
                " than Allah, though it was permissible to",
                " prostrate before others if it was done",
                " without the intention of worship, but now",
                " in the Divine Law given to Prophet",
                " Muhammad (Allah's peace be upon him) it",
                " has been made absolutely unlawful\".",
                "Such misunderstandings",
                " as these have resulted from taking the",
                " words in this verse to mean \"to",
                " perform sajadah\"in the technical sense in which",
                " it is now used in the Islamic",
                " code, that is, \"lying flat in such",
                " a way that the hands, the knees",
                " and the forehead touch the ground,\" whereas",
                " the word (sujjadan) has been used here",
                " in its literal meaning of sajud \"to",
                " bow down\". The parents and brothers of",
                " Prophet Joseph bowed down before him in",
                " accordance with the ancient custom among the",
                " people of the age, (and the custom",
                " is still in vogue among some people),",
                " who used to bow down before others",
                " to show their gratitude, or welcome them,",
                " or merely to salute them by placing",
                " their hand on the breast. There are",
                " many instances of this in the Bible.",
                " \"....and when he (Abraham) saw them (the",
                " three men) corning towards him, he ran",
                " to meet them from the tent door,",
                " and bowed himself towards the ground. \"",
                " (Please refer to Arabic translation: Gen. 18:",
                " 32). Further on it says that when",
                " the children of Heath gave a field",
                " and a cave as a burying place",
                " for Sarah, Prophet Abraham was so grateful",
                " to them that \"he stood up and",
                " bowed himself to the people of the",
                " land, even to the children of Heth,\"",
                " (Gen. 23: 7) and \"Abraham bowed down",
                " himself before the people of the land.\"",
                " (Gen. 23: 12). In both cases the",
                " words `bowed down' have been translated into",
                " (Sajada).",
                "These and other like instances in",
                " the Bible are a conclusive proof of",
                " the fact that in this verse (100),",
                " the Qur'an has not used the word",
                " in its technical Islamic sense but in",
                " its literal sense.",
                "Besides, those commentators arc",
                " absolutely wrong who suppose that in the",
                " former laws, sajadah in the present Islamic",
                " sense was allowed as a mark of",
                " respect laws. For instance, during the Babylonian",
                " captivity of the Children of Israel, king",
                " Ahasuerus promoted Haman above all the princes",
                " and commanded all his servants to bow",
                " and reverence him, but Mordecai, who was",
                " a holy and righteous man among the",
                " Jews, bowed not, nor did him reverence.",
                " (Esther3: 1-2). The Talmud has elaborated this",
                " point in a way that is worth",
                " reading:",
                "The servants of the king said",
                " to Mordecai: \"Why wilt thou refuse to",
                " bow before Haman, transgressing thus the wishes",
                " of the king? Do we not bow",
                " before him?\" \"Yea are foolish,\" answered Mordecai,",
                " \"aye, wanting in reason. Listen to me.",
                " Shall a mortal, who must return to",
                " dust be glorified? Shall I bow down",
                " before one born of woman, whose days",
                " are short? When he is small he",
                " cries and weeps as a child; when",
                " he grows older sorrow and sighing are",
                " his portion; his days arc full of",
                " wrath and anger, and at the end",
                " he returns to dust. Shall I bow",
                " to one like to him? No, I",
                " prostrate myself before the Eternal God, who",
                " lives for ever. To Hun the great",
                " Creator and Ruler of the Universe, and",
                " to no other will I bow. \"",
                " (The Talmud Selections by H. Polano, p.",
                " 172).",
                "This speech which was made by",
                " a Believer from among the Israelites a",
                " thousand years before the Revelation of the",
                " Qur'an, is conclusive on the point. Thus",
                " there is absolutely no room for the",
                " performance of \"sajadah\" before any other than",
                " Allah."
            ]
        },
        {
            "id": "[12:101]",
            "verse": "My Lord, You have given me [something] of sovereignty and taught me of the interpretation of dreams. Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous.\"",
            "description": [
                "The few sentences that were uttered by",
                " Prophet Joseph (Allah's peace be upon him)",
                " at the happiest occasion of his life",
                " help depict the most graceful pattern of",
                " the virtues of a true Believer. There",
                " is the man from the desert, whom",
                " his own brothers had, out of jealousy,",
                " attempted to kill, now sitting on the",
                " throne after passing through many vicissitudes of",
                " life. All the members of his family",
                " have been forced by famine to come",
                " before him for help. The same jealous",
                " brothers, who had made an attempt on",
                " his life, are now standing before him",
                " with down-cast heads. Had there been a",
                " \"successful man of the world\" in his",
                " place, he would have used this opportunity",
                " for boasting of his greatness and bragging",
                " of his successes, and giving vent to",
                " his grievances and hurling malicious taunts at",
                " his defeated enemies. In utter contrast to",
                " this, the we man of God behaves",
                " in a quite different way. Instead of",
                " boasting and bragging of his own greatness,",
                " he is grateful to his God Who",
                " had shown grace to him by raising",
                " him to such a high position of",
                " power, and for arranging his meeting with",
                " his people after such a long period",
                " of separation. Instead of giving vent to",
                " his grievances against his brothers, making taunts",
                " at them for their ill-treatment, he dces",
                " not make even a mention of such",
                " things but puts up a defense for",
                " them, saying that it was all due",
                " to Satan, who had stirred up strife",
                " between them: nay, he even puts it",
                " forward as a blessing in disguise, being",
                " one of the mysterious ways of Allah",
                " by which He had fulfilled His design",
                " of raising him to the throne. After",
                " saying these things in a few concise",
                " sentences, he at once turns to his",
                " Lord in gratitude for bestowing on him",
                " kingdom and wisdom, instead of letting him",
                " rot in the prison, and prays to",
                " Him to keep him as His faithful",
                " and obedient servant as long as he",
                " was alive, and to join him with",
                " the righteous people after his death. What",
                " a pure and high pattern of character!",
                "",
                "It is strange that this speech of",
                " Prophet Joseph has neither found a place",
                " in the Bible nor in the Talmud,",
                " though these books are full of irrelevant",
                " and unimportant details of this story and",
                " others. It is an irony that these",
                " Books are void of those things that",
                " teach moral values and throw light on",
                " the real characters and the Mission of",
                " the Prophets.",
                "Now that this story has",
                " come to an end, the readers arc",
                " again reminded that this story of Prophet",
                " Joseph as given in the Qur'an is",
                " not a copy of the story given",
                " in the Bible and the Talmud for",
                " there are striking differences between them. A",
                " comparative study of these Books will show",
                " that the story in the Qur'an differs",
                " from that given. in the other two",
                " Books in several very important parts. The",
                " Qur'an contains additional facts in some cases",
                " and omits certain facts in other cases",
                " or even refutes some parts as contained",
                " in the Bible and the Talmud. Therefore",
                " there is absolutely no room for anyone",
                " to allege that Prophet Muhammad (Allah's peace",
                " be upon him) related this story merely",
                " in the form he heard it from",
                " the Israelites."
            ]
        },
        {
            "id": "[12:102]",
            "verse": "That is from the news of the unseen which We reveal, [O Muhammad], to you. And you were not with them when they put together their plan while they conspired.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:103]",
            "verse": "And most of the people, although you strive [for it], are not believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:104]",
            "verse": "And you do not ask of them for it any payment. It is not except a reminder to the worlds.",
            "description": [
                "In order to grasp the full significance",
                " of the underlying admonition implied in it,",
                " we must keep in view the background",
                " of the Revelation of this story given",
                " in the introduction to this Surah. The",
                " Quraish themselves had invited the Holy Prophet",
                " to a meeting that had been arranged",
                " for putting him to a test which",
                " was to show whether he was a",
                " we Prophet or not. When he arrived",
                " there, they put him this question without",
                " any previous notice or intimation: why did",
                " the Israelites go to Egypt? In answer",
                " to this, the Holy Prophet recited this",
                " Surah then and there. As they themselves",
                " knew that this was an abrupt question",
                " and there had been no preparation for",
                " its answer beforehand, it was expected that",
                " they would 'believe in his Prophethood. But",
                " they were so obdurate that they did",
                " not believe in him even then. As",
                " Allah was aware of their intentions, he",
                " informed His Messenger beforehand, as if to",
                " say, \"Though you have come out successful",
                " in the test, to which they themselves",
                " put you, yet most of them are",
                " not going to believe it because they",
                " are not sincere in their quest for",
                " the truth. That is why they will",
                " not believe even now when the revelation",
                " of this Surah has proved conclusively that",
                " the Qur'an is not being forged by",
                " you but is being sent down by",
                " Allah Himself. As their real aim and",
                " intention is to reject your Message anyhow,",
                " they will now invent another excuse for",
                " their denial. \"",
                "This is not meant",
                " to remove any misunderstanding the Holy Prophet",
                " might have cherished, but is merely an",
                " indirect warning to the questioners that Allah",
                " knew their intentions well. This was meant",
                " to warn them like this: \"O obdurate",
                " people ! this Surah has been placed",
                " before you to serve as a mirror",
                " for you. You demanded a proof from",
                " Our Messenger that he was not forging",
                " the Qur'an: had you been reasonable and",
                " sincere people, you would have accepted the",
                " truth that has been established according to",
                " your own test, but you are obdurate",
                " people and are still denying it. \"",
                "",
                "*73) This is another admonition more subtle",
                " than the one given above. Though this,",
                " too, has been addressed to the Holy",
                " Prophet, it is meant for the unbelievers,",
                " as if to say, \"O people !",
                " consider your attitude towards the Message from",
                " another point of view. Had you noticed",
                " anything in the Mission and the Message",
                " of Our Prophet that might have smelt",
                " of any self-interest whatever, you would have",
                " been justified in rejecting it as the",
                " work of a selfish person. But you",
                " yourselves have experienced it that he has",
                " absolutely no self-interest in his work and",
                " demands no recompense for the Message, which",
                " is nothing but instruction for aII the",
                " people of the world. Therefore you should",
                " listen to it and consider it without",
                " prejudice and make your decisions about it",
                " on merit and merit alone. \""
            ]
        },
        {
            "id": "[12:105]",
            "verse": "And how many a sign within the heavens and earth do they pass over while they, therefrom, are turning away.",
            "description": [
                "Now that the story of Prophet Joseph",
                " (Allah's peace be upon him) has come",
                " to an end, the Qur'an has made",
                " use of the opportunity for conveying its",
                " basic Message, for it does not tell",
                " stories merely for the sake of story-telling.",
                " As they themselves had invited the Prophet",
                " and were attentively listening to the story,",
                " the essence of the Message was presented",
                " in a few concise sentences (vv. 105-111).",
                "",
                "*75) This is to arouse people from",
                " their apathy towards the Signs of AIIah",
                " that lie scattered all over the earth",
                " and the heavens and to urge them",
                " to make a search for the Reality",
                " by making right observations. As each and",
                " everything is not merely a \"thing\"' but",
                " also a Sign which points to the",
                " Reality, a seeker after it should look",
                " at these with a look different from",
                " that of animals. This is because even",
                " an animal sees a tree, a mountain",
                " and water and takes it as a",
                " mere tree, a mountain or water, and",
                " with the help of his senses makes",
                " use of these according to his needs.",
                " But Allah has endowed man with a",
                " mind that is able to consider things",
                " in other than their physical and material",
                " aspects so that he may think deeply",
                " and make a search for the Reality",
                " by means of these Signs of Allah.",
                " The reason why people fail to discover",
                " the Reality and go astray is that",
                " they do not consider things as \"Signs\"",
                " and pay no heed to this aspect.",
                " Had they not deliberately shut their minds",
                " against the Message of the Prophets, it",
                " would not have been difficult for them",
                " at all to understand it and get",
                " guidance from it."
            ]
        },
        {
            "id": "[12:106]",
            "verse": "And most of them believe not in Allah except while they associate others with Him.",
            "description": [
                "They associate other deities with Allah because",
                " they do not pay heed to His",
                " Signs, which serve as pointers to the",
                " Right Way. So they go astray from",
                " it and get lost in thorny bushes.",
                " Nevertheless, many of them do not lose",
                " sight of the Reality entirely, and do",
                " not disbelieve in Allah as their Creator",
                " and Sustainer,but they get involved in shirk.",
                " That is, they do not deny the",
                " existence of God, but they believe that",
                " there arc other deities who are also",
                " partners in His Being, His Attributes, His",
                " Powers, and His Rights. They should never",
                " have been involved in shirk, had they",
                " considered these Signs in the heavens and",
                " the earth from this point of view,",
                " for in that case they would have",
                " discovered everywhere, in each and every one",
                " of them, the proofs of the Oneness",
                " of Allah."
            ]
        },
        {
            "id": "[12:107]",
            "verse": "Then do they feel secure that there will not come to them an overwhelming [aspect] of the punishment of Allah or that the Hour will not come upon them suddenly while they do not perceive?",
            "description": [
                "This question has been posed to rouse",
                " the people from their care-fret attitude towards",
                " lift produced by temporary security from dangers,",
                " and by a feeling that there is",
                " a long life to enjoy: so the",
                " problems can be postponed safely to a",
                " distant \"future\". This is obviously a wrong",
                " attitude, for no man has any guarantee",
                " that he will live up to a",
                " certain age: for no one knows when,",
                " where and how one would die. Therefore",
                " the questions meant to ask, \"Dces not",
                " your daily experience tell you that you",
                " knew nothing even a minute beforehand what",
                " your. future was hiding for you ?",
                " Therefore, wisdom demands that you should make",
                " preparations for it now, and consider seriously",
                " whether the path you are treading is",
                " the right path. Have you any real",
                " proof to show that it is right?",
                " Do you find any sound argument in",
                " the heavens and the earth to support",
                " your decision? Did the people who trod",
                " such a path before you reach their",
                " destinations safely and securely? Finally, do the",
                " results of following such a path, which",
                " are appearing in your own time and",
                " culture, confirm that you are treading the",
                " right path?\""
            ]
        },
        {
            "id": "[12:108]",
            "verse": "Say, \"This is my way; I invite to Allah with insight, I and those who follow me. And exalted is Allah; and I am not of those who associate others with Him.\"",
            "description": [
                "That is \"Allah is absolutely fret from",
                " such things that are ascribed to Him:",
                " He is free from the weaknesses and",
                " shortcomings which every believer in shirk ascribes",
                " to Him; He is fret from all",
                " defects, evils and errors that must necessarily",
                " be ascribed to Him as a logical",
                " result of the conception of God hold",
                " by mushriks. \""
            ]
        },
        {
            "id": "[12:109]",
            "verse": "And We sent not before you [as messengers] except men to whom We revealed from among the people of cities. So have they not traveled through the earth and observed how was the end of those before them? And the home of the Hereafter is best for those who fear Allah; then will you not reason?",
            "description": [
                "A very comprehensive subject has been condensed",
                " here into a couple of sentences, which",
                " may be expanded like this: \"O Muhammad",
                " !these people do not listen to you",
                " because it is not an easy thing",
                " for them to believe you to be",
                " a Messenger of Allah just because you",
                " arc a mere human being who was",
                " born in their own city among themselves",
                " and brought up like other people. But",
                " there is nothing strange in this, for",
                " this is not the first instance of",
                " its kind. All the Prophets, whom We",
                " sent before you, were also human beings",
                " and lived in the same habitations to",
                " which they were sent. It never happened",
                " that a stranger came to a town",
                " and declared, \"I have been sent as",
                " a Messenger to you. On the other",
                " hand, all the Prophets-Jesus, Moses, Abraham and",
                " Noah (Allah's peace be upon them all)-who",
                " were raised for the reform of the",
                " people, were human beings who wen born",
                " and brought up in their own habitations\"",
                " . Then it addresses the disbelievers directly,",
                " as if to say, \"Now it is",
                " for you to judge and decide whether",
                " you should accept the Messenger or reject",
                " him on such ftimcy grounds as these.",
                " You have travelled abroad and seen the",
                " end of those people who rejected the",
                " Message of their Prophets and followed their",
                " own lusts. You have seen, on your",
                " journeys, the ruined habitations of the people",
                " of 'Ad, Thamud, Midian, Lot, and others.",
                " Have you not observed these as object",
                " lessons, for these warn you that they",
                " would meet with far worse consequences in",
                " the Hereafter, and that conversely, those who",
                " are pious and God-fearing will have a",
                " very happy life?\""
            ]
        },
        {
            "id": "[12:110]",
            "verse": "[They continued] until, when the messengers despaired and were certain that they had been denied, there came to them Our victory, and whoever We willed was saved. And Our punishment cannot be repelled from the people who are criminals.",
            "description": [
                ""
            ]
        },
        {
            "id": "[12:111]",
            "verse": "There was certainly in their stories a lesson for those of understanding. Never was the Qur'an a narration invented, but a confirmation of what was before it and a detailed explanation of all things and guidance and mercy for a people who believe.",
            "description": [
                "That is, \"It gives details of everything",
                " that is required for the guidance of",
                " man. \" Some people take \"details of",
                " everything\" to mean the details of everything",
                " in the world. So, when they do",
                " not find in it the details of",
                " mathematics, physics, medicine etc. etc. they become",
                " skeptical. Whereas the Qur'an claims to give",
                " the details of only one `subject', \"Guidance\",",
                " for which it has been sent down,",
                " and it does give the details of",
                " everything that is essential for it."
            ]
        }
    ]
}