{
    "name": "Ar-Rad",
    "id": 13,
    "verse-count": 43,
    "verse-info": [
        {
            "verse-id": "[13:1]",
            "verse": "Alif, Lam, Meem, Ra. These are the verses of the Book; and what has been revealed to you from your Lord is the truth, but most of the people do not believe.",
            "description": [
                "This is the introduction to this Surah,",
                " in which its aim and object has",
                " been enunciated in a few words. Allah",
                " has addressed the Holy Prophet to this",
                " effect: \"O Prophet ! most of your",
                " people arc rejecting the teachings of the",
                " Qur'an for one reason or the other,",
                " but the fact is that what We",
                " are sending down to you is the",
                " Truth whether people believe it or not.",
                " \"",
                "After this brief introduction, the discourse",
                " deals with the main subject of the",
                " Surah, which consists of three basic things.",
                " First,. \"The whole of the universe belongs",
                " to Allah alone, and none besides Him",
                " has any right to service and worship\"",
                " . Second, \"There is another life after",
                " this life, in which you shall have",
                " to render an account of all your",
                " actions.\" Third, \"I am a Messenger of",
                " Allah: whatever I am presenting before you",
                " is not from myself but from Allah.\"",
                " As the people were rejecting these three",
                " things, these have been reiterated over and",
                " over again in various forms to remove",
                " doubts and objections from the minds of",
                " the disbelievers."
            ]
        },
        {
            "verse-id": "[13:2]",
            "verse": "It is Allah who erected the heavens without pillars that you [can] see; then He established Himself above the Throne and made subject the sun and the moon, each running [its course] for a specified term. He arranges [each] matter; He details the signs that you may, of the meeting with your Lord, be certain.",
            "description": [
                "In other words, \"Allah keeps the myriad's",
                " of heavenly bodies in space without any",
                " visible and perceptible support.\" Though there is",
                " nothing apparent and visible that is supporting",
                " these bodies, yet there is an invariable",
                " and imperceptible Power which is not only",
                " holding and keeping each and everyone of",
                " these huge bodies including the earth we",
                " inhabit in their proper places and orbits",
                " but also does not let any collision",
                " take place between them.",
                "*3) For the",
                " fuller details of \"He sat Himself on",
                " the Throne of His Kingdom,\" please refer",
                " to E.N. 41 of AI-A araf. Here",
                " the purpose will be served if it",
                " is understood that this thing has been",
                " mentioned in the Qur'an at many places",
                " in order to bring out clearly the",
                " fact that Allah has not only created",
                " the earth, but also rules over His",
                " Kingdom, and that His universe is a",
                " factory that is not working automatically as",
                " some ignorant people seem to think nor",
                " is it being ruled by many gods",
                " as other ignorant people seem to believe.",
                " But it is a regular system that",
                " is being run and ruled over by",
                " its Creator.",
                "*4) It should be noted",
                " here that the addressees themselves accepted the",
                " truth of alI the claims that have",
                " been made in this verse. Therefore no",
                " proofs were required of the facts that",
                " it is Allah Who raised up the",
                " heavens without any visible support and subjected",
                " the sun and the moon to a",
                " fixed order. These things have been mentioned",
                " here only as arguments to prove that",
                " Allah is the sole Sovereign and ruler",
                " of the whole universe.",
                "Now let us",
                " consider this question: How can such an",
                " argument as this convince those who do",
                " not believe at aII in the existence",
                " of God nor acknowledge that He is",
                " the Creator of the universe and the",
                " Director of all its affairs ? The",
                " answer is that the arguments in support",
                " of the Doctrine of Tauhid advanced in",
                " the Qur'an to convince the mushriks equally",
                " apply against the atheists to prove the",
                " existence of God. It is like this:",
                " The whole of the universe-the earth, the",
                " moon, the sun and the countless heavenly",
                " bodies-constitute a perfect system which is working,",
                " under the same all-powerful Law. This is",
                " a proof that such a system must",
                " have been designed by some All-Powerful Sovereign,",
                " Who possesses wisdom and unerring knowledge. This",
                " proves conclusively the existence of that Allah",
                " Who has no other equal nor associate",
                " nor partner. For there can be no",
                " system without an administrator, no law without",
                " a ruler, no wisdom without a sage,",
                " and no knowledge without the possessor of",
                " that knowledge. Above all, no one can",
                " ever conceive that there can be any",
                " creation without a Creator except the one",
                " who is obdurate or has no sense",
                " left in him at all.",
                ">*5) This",
                " system is not only a standing proof",
                " of the fact that an All-Powerful Sovereign",
                " is ruling over it, but is also",
                " an evidence of the great wisdom underlying",
                " it; it also bears witness that there",
                " is nothing ever-lasting in it. Everything in",
                " it remains for a fixed term after",
                " which it comes to an end. This",
                " is equally true for each and every",
                " component part of it as well as",
                " for the whole system. It is quite",
                " evident from its physical structure that there",
                " is nothing ever-lasting and immortal. There must",
                " be some fixed term for the system",
                " as a whole, after the expiry of",
                " which it shall come to an end.",
                " Then there shall be another world: therefore",
                " it is most likely that there shall",
                " be Resurrection as predicted in the Qur'an:",
                " nay, its inevitability is beyond any doubt.",
                "",
                "*6) Allah makes plain those Signs which",
                " help prove the truth of what the",
                " Holy Prophet was informing them. These Signs",
                " are spread all over the universe and",
                " everyone who observes these with open eyes",
                " can perceive that the realities towards which",
                " the Qur'an invites the people are testified",
                " by these Signs.",
                "*7) The preceding Signs",
                " have been cited to prove two things.",
                " First, the universe has only one Creator",
                " and Administrator. Second, there shall be life",
                " in the Hereafter in which everyone shall",
                " be judged in the Divine Court and",
                " awarded rewards and punishments on merit. As",
                " the first thing was quite obvious, it",
                " has not been mentioned in the conclusion",
                " drawn from the Signs. But the second",
                " thing, life in the Hereafter, has been",
                " mentioned because that was rather hidden from",
                " perception. Therefore it has specifically been stated",
                " that these Signs have been made plain",
                " in order \"to convince you that you",
                " shall meet your Lord in the Hereafter",
                " and render an account of all your",
                " actions in this world. \"",
                "Now let",
                " us consider how these Signs help prove",
                " life in the Hereafter. These make it",
                " evident in two ways:",
                "(1) When we",
                " consider how big heavenly bodies as the",
                " sun and the moon are completely subject",
                " to the will of Allah, our hearts",
                " feel convinced that Allah Who has created",
                " these things and regulated their movements so",
                " orderly around their orbits, has undoubtedly the",
                " power to bring to life the whole",
                " human race after its death.",
                "(2) The",
                " terrestrial system also proves that its Creator",
                " is All-Wise. Therefore it can never be",
                " imagined that the All-Wise Creator could have",
                " created man and endowed him with wisdom",
                " and intelligence and invested him with power",
                " and authority, and then left him free",
                " to do what he liked with these,",
                " without being responsible and accountable for their",
                " use or abuse. For His Wisdom demands",
                " that He should take full account of",
                " alI the acts and deeds of man",
                " in this world. It requires that. He",
                " should take to task those who committed",
                " aggressions and compensate their victims and He",
                " should give rewards to those who practised",
                " virtue and punishments to those who did",
                " wicked deeds. In short, His Wisdom requires",
                " that He should call to account every",
                " human being and demand: \"How did you",
                " carry out the trust that was placed",
                " in your hands in the shape of",
                " your wonderful body with its wonderful faculties",
                " and the numerous resources of the earth?\"",
                " It may be that a foolish and",
                " unjust ruler of this world might entrust",
                " the affairs of his kingdom in the",
                " hands of his agents and then forget",
                " to call them to account, but such",
                " a thing can never be expected from",
                " the All-Wise and All-Knowing Allah.",
                "It is",
                " this way of observing and considering the",
                " heavenly bodies that can convince us that",
                " life in the Hereafter is both possible",
                " and inevitable."
            ]
        },
        {
            "verse-id": "[13:3]",
            "verse": "And it is He who spread the earth and placed therein firmly set mountains and rivers; and from all of the fruits He made therein two mates; He causes the night to cover the day. Indeed in that are signs for a people who give thought.",
            "description": [
                "After citing some heavenly Signs in support",
                " of the doctrines of Tauhid and the",
                " Hereafter, a few Signs are being cited",
                " from the earth for the same purpose.",
                " Briefly the following are the arguments for",
                " Tauhid, Resurrection and Accountability:",
                "(1) Tauhid: The",
                " fact that the earth is closely connected",
                " with the heavenly bodies (which help create",
                " life on it), and the fact that",
                " the mountains and the rivers are so",
                " inter-related with that life are clear proofs",
                " that all these things have not been",
                " created by separate and different gods nor",
                " are being governed, by gods with independent",
                " powers and authorities. Had it been so,",
                " there could not have been so much",
                " harmony, congruity, accord and unity of purpose",
                " among them; nor could these relationships have",
                " continued for such a long time. For",
                " it is quite obvious that if there",
                " had not been One All-Powerful and All-Wise",
                " Allah, it could not have been possible",
                " and practicable for different gods to sit",
                " together and evolve out such a harmonious",
                " system of the universe without any discord",
                " or conflict between its myriad's of bodies.",
                "",
                "(2) Resurrection: This wonderful planet, the earth,",
                " is itself a great proof that its",
                " Creator is All-Powerful and can, therefore, raise",
                " the dead whenever He will. For it",
                " is floating in space round the sun",
                " and it has high mountains fixed in",
                " it and has large rivers flowing on",
                " its surface: it produces countless fruit-bearing trees",
                " and it brings about the cycles of",
                " the day and the night with precise",
                " regularity.",
                "All these things bear witness to",
                " the boundless power of its Creator. It",
                " would, therefore, be sheer folly to doubt",
                " that such All-Powerful Creator is incapable of",
                " raising mankind to life after death.",
                "(3)",
                " Accountability: The earth, with all its wonderful",
                " and purposeful signs, is a clear evidence",
                " of the fact that its Creator is",
                " All-Wise. Therefore it cannot even be imagined",
                " that He has created man, His noblest",
                " creation, without any purpose. Just as His",
                " wisdom is apparent from the structure of",
                " the earth, its mountains, its rivers, the",
                " pairs of its trees and fruits, its",
                " night and day, so it is quite",
                " obvious that it has not been made",
                " the habitation of man without any purpose,",
                " nor will it be brought to nought",
                " without the fulfilment of that purpose. Clearly",
                " mankind shall be accountable to its Creator",
                " for the fulfilment of that Divine purpose.",
                ""
            ]
        },
        {
            "verse-id": "[13:4]",
            "verse": "And within the land are neighboring plots and gardens of grapevines and crops and palm trees, [growing] several from a root or otherwise, watered with one water; but We make some of them exceed others in [quality of] fruit. Indeed in that are signs for a people who reason.",
            "description": [
                "That is, \"If you observe carefully, you",
                " will find Divine wisdom, design and purpose",
                " in the diversity of the structure of",
                " the earth. Though it has countless regions",
                " adjoining one another, they are different from",
                " one another in their shapes, colours, component",
                " parts, characteristics, potentialities, productive capacity and source",
                " of minerals. This diversity has countless points",
                " of wisdom and advantage. Let alone other",
                " creatures, if we consider the diversity of",
                " regions from the point of the good",
                " it has done to mankind, we shall",
                " have to acknowledge that this is the",
                " result of the well-thought and well-planned design",
                " of the All-Wise Creator. For this diversity",
                " has helped the growth of human civilization",
                " so much that only an unreasonable person",
                " can assign this to mere accident.",
                "*10)",
                " Some of the date-palm trees have only",
                " a single trunk from the root while",
                " others have two or more stems from",
                " the same root.",
                "*11) The things mentioned",
                " in this verse contain many other Signs",
                " besides the proofs of Tauhid and the",
                " boundless powers and All-Comprehensive W isdom of",
                " Allah. Let us consider one of these,",
                " that is the diversity in the universe,",
                " including mankind. There is the one and",
                " the same earth but all its regions",
                " are quite different from one another. Then",
                " there is one and the same water",
                " but it helps to produce different kinds",
                " of corn and fruits. Then one and",
                " the same tree bears fruits which, in",
                " spite of likeness, differ from one another",
                " in shapes, sizes, and other features. Then",
                " there is one and the same root",
                " from which sometimes one and at others",
                " two trunks sprout up, with their own",
                " different characteristics. If one considers these aspects",
                " of diversity, one shall come to the",
                " conclusion that the Divine wisdom demands the",
                " same kind of diversity in the natures,",
                " temperaments and inclinations of human beings, and,",
                " therefore, in their conducts. So, one need",
                " not worry about the existence of this",
                " diversity. As it has been stated in",
                " v. 31, if Allah had willed, He",
                " could have created all human beings alike",
                " and virtuous by birth. But the wisdom",
                " that underlies the creation of the universe,",
                " including mankind, requires diversity and not uniformity.",
                " Otherwise, all this creation would have become",
                " meaningless."
            ]
        },
        {
            "verse-id": "[13:5]",
            "verse": "And if you are astonished, [O Muhammad] - then astonishing is their saying, \"When we are dust, will we indeed be [brought] into a new creation?\" Those are the ones who have disbelieved in their Lord, and those will have shackles upon their necks, and those are the companions of the Fire; they will abide therein eternally.",
            "description": [
                "They \"have denied their Lord\": their denial",
                " of the Hereafter is, in fact, the",
                " denial of the Power and Wisdom of",
                " Allah. As they say that it is",
                " impossible to bring them again to life",
                " after their death, it implies that, God",
                " forbid, their AIIah Who has created them",
                " lacks not only power but wisdom, too.",
                "",
                "*13) As a collar around the neck",
                " is a symbol of imprisonment, the words",
                " \"collars around their necks\" have been used",
                " here idiomatically to show that they are",
                " slaves of ignorance, obduracy, lust and are",
                " blind followers of their forefathers. As their",
                " thinking is influenced by their prejudices, they",
                " cannot believe in the Hereafter and would",
                " deny this, though there is every reason",
                " to believe that it is inevitable."
            ]
        },
        {
            "verse-id": "[13:6]",
            "verse": "They impatiently urge you to bring about evil before good, while there has already occurred before them similar punishments [to what they demand]. And indeed, your Lord is full of forgiveness for the people despite their wrongdoing, and indeed, your Lord is severe in penalty.",
            "description": [
                "This refers to the demand of the",
                " Quraish from the Holy Prophet \"If you",
                " are a true Prophet of God, why",
                " don't you hasten to bring that scourge",
                " of God on us of which you",
                " have been threatening us, when we are",
                " flouting and denying you ?\" They did",
                " this in different ways. Sometimes they would",
                " invoke God mockingly and say, \"O Lord,",
                " settle our accounts now and do not",
                " postpone these to the Day of Resurrection\"",
                " . At another time, they would say,",
                " \"Our Lord, if what Muhammad says be",
                " true, and be from Thee, then stone",
                " us from the sky or send down",
                " some other scourge upon us from the",
                " sky or send down some other painful",
                " torment upon us.\" In this verse an",
                " answer has been given to such impudent",
                " demands of the disbelievers. They have been",
                " admonished to refrain from such foolish demands",
                " and avail of the respite that was",
                " being given to them and mend their",
                " ways, for they were incurring the wrath",
                " of God by adopting the attitude of",
                " rebellion."
            ]
        },
        {
            "verse-id": "[13:7]",
            "verse": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" You are only a warner, and for every people is a guide.",
            "description": [
                "This showed their mentality. The only criterion",
                " of judging whether Muhammad (Allah's peace be",
                " upon him) was a true Prophet or",
                " not according to these disbelievers, was whether",
                " he would perform a miracle to order.",
                " This was because they would not judge",
                " his Message by rational arguments: they would",
                " not learn a lesson from his high",
                " character nor from the moral revolution that",
                " was being brought about among his Companions",
                " by his Message and noble example: nor",
                " would they carefully consider the rational arguments",
                " given in the Qur'an to prove the",
                " errors of their religion of shirk and",
                " superstitions of ignorance. They would ignore these",
                " rational things and demand a miracle to",
                " decide the issue.",
                "*16) This is the",
                " concise answer to their demand, though it",
                " has not been directly addressed to the",
                " disbelievers but to the Messenger. It is",
                " this: \"O Prophet, you should not worry",
                " at alI about some miracle which you",
                " might show to these people in order",
                " to convince them, for it is not",
                " a part of your Mission. Your duty",
                " is only to warn the people of",
                " their negligence and of the evil consequences",
                " of their wrong ways. And for this",
                " purpose, We have always sent a guide",
                " to every people. Now you, too, arc",
                " performing this duty, and it is for",
                " them to open their eyes and judge",
                " the truth of your Message.\" After giving",
                " this concise answer, Allah overlooks their demand",
                " but warns them, in the succeeding verses,",
                " that they have to deal with the",
                " All-Knowing AIlah Who has full knowledge about",
                " everyone of them from the time they",
                " were in the wombs of their mothers,",
                " and Who keeps a keen watch over",
                " everything they do. Therefore their fates shall",
                " be decided strictly with justice in accordance",
                " with their merits and that there is",
                " no power on the earth and in",
                " the heavens that can influence in the",
                " least His decisions and judgements."
            ]
        },
        {
            "verse-id": "[13:8]",
            "verse": "Allah knows what every female carries and what the wombs lose [prematurely] or exceed. And everything with Him is by due measure.",
            "description": [
                "When amplified the verse will mean :",
                " Allah remains fully aware of all the",
                " developments that take place in the child",
                " while in its mother's womb, and He",
                " watches over the decrease or increase in",
                " each of its limbs, and its potentialities,",
                " capabilities and powers."
            ]
        },
        {
            "verse-id": "[13:9]",
            "verse": "[He is] Knower of the unseen and the witnessed, the Grand, the Exalted.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:10]",
            "verse": "It is the same [to Him] concerning you whether one conceals [his] speech or one publicizes it and whether one is hidden by night or conspicuous [among others] by day.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:11]",
            "verse": "For each one are successive [angels] before and behind him who protect him by the decree of Allah. Indeed, Allah will not change the condition of a people until they change what is in themselves. And when Allah intends for a people ill, there is no repelling it. And there is not for them besides Him any patron.",
            "description": [
                "That is, 'Allah not only directly watches",
                " over whatever each person does, and is",
                " fully aware of everything he dces, but",
                " He has also appointed such Guardians as",
                " accompany him everywhere and keep a full",
                " record of all his deeds. \" This",
                " has been stated here to warn those",
                " people who live their lives under the",
                " delusion that they have been left absolutely",
                " free to do whatever they like and",
                " shall not be required to render an",
                " account of what they did in this",
                " worldly life. The warning is that such",
                " people invite their own retribution.",
                "*19) This",
                " is to warn them further that they",
                " should not remain under any delusion that",
                " some holy person or saint or angel",
                " has the power to rescue them froth",
                " Divine Retribution, for there is none who",
                " could defend them against Allah, even though",
                " they might have been paying homages and",
                " making offerings to their so-called patrons and",
                " protectors in the hope that they would",
                " rescue them froth punishment from Allah on",
                " the Day of Judgement."
            ]
        },
        {
            "verse-id": "[13:12]",
            "verse": "It is He who shows you lightening, [causing] fear and aspiration, and generates the heavy clouds.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:13]",
            "verse": "And the thunder exalts [Allah] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allah; and He is severe in assault.",
            "description": [
                "The thunder is a proclamation of Tauhid",
                " for those who have ears to hear",
                " the real meaning of its loud noise",
                " which follows the flash of lightning, though",
                " it is merely a kind of noise",
                " for those who hear it like animals.",
                " For it proclaims that Allah Who raises",
                " clouds from the oceans and carries them",
                " wherever He wills, and makes the lightning",
                " flash from the clouds and then turns",
                " them into rain so as to supply",
                " water to the dwellers of the earth,",
                " is perfect and worthy of all praise,",
                " is All-Wise and All-Powerful and is flawless",
                " in every respect and has do partner",
                " whatsoever.",
                "*21) The mention of the fact",
                " that the angels are filled with awe",
                " of their Lord, and they proclaim His",
                " praise has a special significance here. This",
                " is to refute the shirk of the",
                " ignorant people who have always worshipped the",
                " angels as gods and deities and believed",
                " them to be partners with God in",
                " His Godhead. It has been stated that",
                " they are not partners with Allah but",
                " His most obedient servants; so much so",
                " that they praise Him and are filled",
                " with awe of Him.",
                "*22) He has",
                " countless plans and measures which are so",
                " effective and sudden that He can smite",
                " any one with any one of them",
                " from any side He will. So much",
                " so that the intended victim is absolutely",
                " unaware of it. This is a proof",
                " that those people, who say absurd things",
                " about such All-Powerful Being, are absolutely void",
                " of sense."
            ]
        },
        {
            "verse-id": "[13:14]",
            "verse": "To Him [alone] is the supplication of truth. And those they call upon besides Him do not respond to them with a thing, except as one who stretches his hands toward water [from afar, calling it] to reach his mouth, but it will not reach it [thus]. And the supplication of the disbelievers is not but in error [i.e. futility].",
            "description": [
                "\"To invoke Him alone is the right",
                " thing,\" for AIlah alone has the power",
                " and the authority to give help and",
                " remove difficulties."
            ]
        },
        {
            "verse-id": "[13:15]",
            "verse": "And to Allah prostrates whoever is within the heavens and the earth, willingly or by compulsion, and their shadows [as well] in the mornings and the afternoons.",
            "description": [
                "\"... everything in the heavens and the",
                " earth bows down before Allah\" in the",
                " same sense that every creation of His",
                " has to obey and submit to His",
                " Physical Law in every detail. The only",
                " difference between the submission of a Believer",
                " and an unbeliever is that the former",
                " submits to it with a willing heart",
                " while the latter is forced to do",
                " so against his will, for it is",
                " absolutely beyond his power to oppose it.",
                "",
                "*25) \"The shadows bow down\" in the",
                " sense that they fall to the west",
                " in the morning and to the cast",
                " in the evening and so on. This",
                " shows that they, too, have to submit",
                " to some Law."
            ]
        },
        {
            "verse-id": "[13:16]",
            "verse": "Say, \"Who is Lord of the heavens and earth?\" Say, \"Allah.\" Say, \"Have you then taken besides Him allies not possessing [even] for themselves any benefit or any harm?\" Say, \"Is the blind equivalent to the seeing? Or is darkness equivalent to light? Or have they attributed to Allah partners who created like His creation so that the creation [of each] seemed similar to them?\" Say, \"Allah is the Creator of all things, and He is the One, the Prevailing.\"",
            "description": [
                "It will be worth while to note",
                " that though the question, \"Who is the",
                " Lord of the heavens and the earth?\"",
                " was put to the disbelievers, Allah told",
                " the Holy Prophet to answer it himself",
                " and say, \"Allah\". This was because the",
                " disbelievers hesitated to answer it one way",
                " or the other. They could not say",
                " that it was not Allah for they",
                " themselves believed that Allah was the Creator",
                " of everything. On the other hand, they",
                " could not acknowledge this fact in so",
                " many words in answer to such question,",
                " for, they would, then, have to acknowledge",
                " the doctrine of Tauhid for no basis",
                " could have been left in favour of",
                " shirk. As they realised their weak position,",
                " they would not give any answer to",
                " such questions. That is why Allah asks",
                " His Messenger to put such questions to",
                " the disbelievers: \"Who is the Creator of",
                " the heavens and the earth? Who is",
                " the Lord of the Universe? Who sustains",
                " you with provisions of life?\" When they",
                " do not give any answer to such",
                " questions, Allah asks His Messenger to say",
                " \"Allah\" in answer. He then proceeds on",
                " with this argument: \"When Allah does all",
                " these things, how do the deities you",
                " worship come in?\"",
                "*27) The blind tnan",
                " is the person who cannot see any",
                " of the countless signs of the Oneness",
                " of AIlah, though these lie spread over",
                " before him in the universe. On the",
                " other hand, the seeing man is the",
                " person who can see in every particle",
                " of the universe and in every leaf",
                " of grass and tree Signs pointing to",
                " their Creator. Thus the question that has",
                " been posed means: \"O disbelievers ! if",
                " you are blind to the Signs, why",
                " should the one who can see the",
                " Signs should behave like a blind man",
                " and stumble along like you?\"",
                "*28) Here",
                " \"light\" means the light of the knowledge",
                " of the Truth which the Holy Prophet",
                " and his followers possessed. In contrast to",
                " this, there was the \"darkness\" of ignorance",
                " in which the disbelievers were wandering about.",
                " The question that has been posed means",
                " to ask this: \"Why should those, who",
                " have got the `light', extinguish it and",
                " wander about in the darkness like you?",
                " Well, if you do not know the",
                " worth of the `light', you may choose",
                " to wander in the darkness, but how",
                " can you expect the one who has",
                " got the 'light', who appreciates the difference",
                " between the light and the darkness, and",
                " who is seeing the right way as",
                " if in broad daylight, to Dave the",
                " light and wander about in the darkness?\"",
                "",
                "*29) The question is intended to impress",
                " on the disbelievers that there is absolutely",
                " no reason why they should practice shirk.",
                " When they themselves admit that their gods",
                " did not create even an iota in",
                " the universe and that they have not",
                " even the smallest and most insignificant share",
                " in the creation, there remains no ground",
                " for them to cherish any doubts about",
                " it. Why should, then, their false gods",
                " and deities share the rights and powers",
                " of the Real Creator?",
                "*30) The Arabic",
                " word (Qah-har) literally means \"the one who",
                " rules over all by virtue of one's",
                " own power, and keeps all under one's",
                " complete control. \"",
                "This fact that \"He",
                " is the Unique, the Almighty\" follows naturally",
                " from the preceding fact that \"Allah alone",
                " is the Creator of everything,\" for this",
                " fact was also acknowledged by the mushriks",
                " and was never denied by them. This",
                " is so because the Creator of everything",
                " should logically be Unique, and every other",
                " thing or being must necessarily be His",
                " creation. Therefore nothing could be the equal",
                " of the Creator or partner in His",
                " Being, attributes, powers and rights. Likewise, the",
                " Creator must have complete power and control",
                " over His Creation.",
                "For it can never",
                " be imagined that the Creator would create",
                " anything over which He has not full",
                " control. Therefore, the one who acknowledges Allah",
                " to be the Creator must also acknowledge",
                " Him to be the Unique and the",
                " All-Powerful. After this, there remains no reason",
                " why one should worship any one other",
                " than the Creator or invoke some one",
                " else for help in resolving one's difficulties",
                " and fulfilling one's needs."
            ]
        },
        {
            "verse-id": "[13:17]",
            "verse": "He sends down from the sky, rain, and valleys flow according to their capacity, and the torrent carries a rising foam. And from that [ore] which they heat in the fire, desiring adornments and utensils, is a foam like it. Thus Allah presents [the example of] truth and falsehood. As for the foam, it vanishes, [being] cast off; but as for that which benefits the people, it remains on the earth. Thus does Allah present examples.",
            "description": [
                "In this simile the Knowledge which had",
                " been sent down. by Allah to the",
                " Holy Prophet has been likened to the",
                " rain from the sky, and the Believers",
                " to the streams, rivulets and rivers. Just",
                " as the streams etc. , fill themselves",
                " with rain-water, each according to its capacity,",
                " so his followers gained knowledge from him,",
                " each according to his ability. On the",
                " other hand, the hue and cry that",
                " was raised by the opponents of the",
                " Islamic Movement has been likened to the",
                " swelling foam etc. , that begins to",
                " dance about on the surface of flood",
                " water, but soon vanishes away.",
                "*32) As",
                " it is but natural that scum should",
                " appear on the surface when are melted",
                " in the furnace for purification, likewise bad",
                " people would come surface and take prominent",
                " part in persecuting the good people who",
                " are passed through the furnace of persecution",
                " for their purification."
            ]
        },
        {
            "verse-id": "[13:18]",
            "verse": "For those who have responded to their Lord is the best [reward], but those who did not respond to Him - if they had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby. Those will have the worst account, and their refuge is Hell, and wretched is the resting place.",
            "description": [
                "This shows that the disbelievers would be",
                " in such a sad plight that they",
                " would not hesitate to give their alI",
                " for their redemption.",
                "*34) \".... they shall",
                " have the heavy reckoning\": they shall have",
                " to bear the full consequences of their",
                " evil deeds. No sin, no shortcoming, in",
                " short, nothing will be forgiven and no",
                " evil shall go un-punished.",
                "We learn from",
                " the Qur'an that the rebels of AIIah",
                " shall have to render a reckoning, whereas",
                " there shall be a \"light\" reckoning from",
                " those who have been faithful and obedient",
                " to their Lord. In consideration of their",
                " loyal services, their cases will be dealt",
                " with leniently, and taking their general goodness",
                " into account many of their shortcomings will",
                " be forgiven.",
                "This is further amplified by",
                " a Tradition of the Holy Prophet. Hadrat",
                " 'A'ishah relates, \"I said, O Messenger of",
                " Allah !the most dreadful verse of the",
                " Qur'an is this: Whoso shall commit an",
                " evil, he shall be punished for it'.",
                " (IV :123). The Holy Prophet answered, O",
                " `A'ishah! don't you know how Allah clears",
                " the accounts of His faithful and obedient",
                " servant? Whatever harm or trouble he receives",
                " in this world-even so much as the",
                " pricking of a thorn-is taken by Allah",
                " as atonement for one or the other",
                " of his sins. As regards the Hereafter,",
                " everyone, who shall be called upon to",
                " render an account of any sin, shall",
                " be punished for it' . At this",
                " Hadrat `A'ishah asked, `Then what is meant",
                " by light reckoning in this verse: Whoso",
                " shall be given his `Conduct Register' in",
                " his right hand, he will render a",
                " light reckoning?' (LXXXIV:?-8). The Holy Prophet answered,",
                " `This means merely the presentation of his",
                " whole conduct, that is, all his deeds-good",
                " and bad-shall be presented before Allah but",
                " he shall not be called upon to",
                " clear the account of all his deeds;",
                " for the one who shall be called",
                " upon to clear the whole of his",
                " account, shall be totally ruined' . \"",
                "",
                "The same thing is happening even in",
                " this world. A master deals very leniently",
                " with his faithful and obedient servant and",
                " connives at his minor faults and even",
                " forgives his major faults in consideration of",
                " his meritorious services. On the other hand,",
                " if a servant is proved to be",
                " treacherous and dishonest, no consideration is given",
                " even to his services, and he is",
                " punished both for his minor and for",
                " major faults."
            ]
        },
        {
            "verse-id": "[13:19]",
            "verse": "Then is he who knows that what has been revealed to you from your Lord is the truth like one who is blind? They will only be reminded who are people of understanding -",
            "description": [
                "That is, \"As the attitude of the",
                " two in this world will be different",
                " from each other, so shall be their",
                " ultimate end in the Hereafter. \"",
                "*36)",
                " That is, \"Those who listen to the",
                " Message that has been sent down by",
                " Allah, and accept His Messenger, are really",
                " very wise people. This is why their",
                " conduct in this world is quite different",
                " from those foolish people who are blind",
                " to its merits: and so is their",
                " ultimate end in the Hereafter, as stated",
                " in the subsequent verses\"."
            ]
        },
        {
            "verse-id": "[13:20]",
            "verse": "Those who fulfill the covenant of Allah and do not break the contract,",
            "description": [
                "This Covenant is the same that was",
                " made by Allah with the whole of",
                " mankind at the beginning of the creation",
                " that they would worship Him alone. (Please",
                " refer to E.N.'s 134 and 135 of",
                " Al-A`araf). As this Covenant has been made",
                " with every human being, it has been",
                " imbued firmly in human nature. When a",
                " human being is born in this world,",
                " he, so to say, confines the same",
                " Covenant because he owes his creation to",
                " the same Allah with Whom he had",
                " made that Covenant: then he is brought",
                " up by His Providence and fed and",
                " nourished with His Provisions, and uses the",
                " powers and faculties endowed by Him. AII",
                " these things bind him by themselves into",
                " a covenant of bondage with his Lord.",
                " It is obvious that wise, loyal and",
                " faithful people fulfil their Covenant and dare",
                " not break it except that they might",
                " break it unconsciously and unwillingly."
            ]
        },
        {
            "verse-id": "[13:21]",
            "verse": "And those who join that which Allah has ordered to be joined and fear their Lord and are afraid of the evil of [their] account,",
            "description": [
                "That is, \"AII those social and civil",
                " relations that are conducive to the correct",
                " and right conduct of collective human life.\"",
                ""
            ]
        },
        {
            "verse-id": "[13:22]",
            "verse": "And those who are patient, seeking the countenance of their Lord, and establish prayer and spend from what We have provided for them secretly and publicly and prevent evil with good - those will have the good consequence of [this] home -",
            "description": [
                "\"They show fortitude\": they remain self-possessed and",
                " keep under control all their desires and",
                " lusts and do not transgress the bounds,",
                " and they do not yield to temptations",
                " to disobey their Lord in order to",
                " gain advantages and gratify their desires: nay,",
                " they bear with calm courage and endurance",
                " losses and afflictions that are inevitable in",
                " the obedience of AIIah. If we consider",
                " the life of a believer from this",
                " point of view, we shall find that",
                " the whole of his life is the",
                " life of endurance and fortitude, for he",
                " keeps himself under control in very trying",
                " circumstances in this world in the hope",
                " of winning the approval of his Lord",
                " and in the expectation of gaining permanent",
                " benefits in the Hereafter: so he fights",
                " with fortitude every temptation to sin.",
                "*40)",
                " That is, \"If others do evil to",
                " them, they do not do evil in",
                " return but do good instead: they do",
                " not fight mischief with mischief but with",
                " virtue. Howsoever unjust one may be to",
                " them, they do justice in every case.",
                " Likewise, they remain truthful and honest even",
                " in the cast of those who tell",
                " lies against them and show dishonesty towards",
                " them. \"",
                "There is a Tradition of",
                " the Holy Prophet to the same effect:",
                " \"You should not imitate others in your",
                " conduct towards other people, for it is",
                " wrong to say, 'We will do goodness",
                " to others, if they do goodness to",
                " us and we will do injustice to",
                " them if they are unjust to us.'",
                " (On the other hand,) you should follow",
                " this principle: if others do goodness to",
                " you, you should do goodness to them,",
                " but if they do evil to you,",
                " you should not be unjust to them'",
                " . \"",
                "There is another Tradition, which",
                " begins with the words: \"My Lord has",
                " bidden me to do nine things. Four",
                " of these things are, `I should behave",
                " justly towards everyone whether I am pleased",
                " or offended with him. I should render",
                " the right even of the one who",
                " violates my rights. I should pay the",
                " dues even of the one who depraves",
                " me of my due. I should forgive",
                " the one who has been unjust to",
                " me' . \" There is yet another",
                " Tradition to the same effect: \"Don't be",
                " faithless even to the one who has",
                " been faithless to you.\" There is also",
                " a saying of Hadrat 'Umar that amounts",
                " to the same thing. \"The best way",
                " of punishing the one, who does not",
                " fear God in his dealings with you,",
                " is that you should fear God in",
                " your dealings with him. \""
            ]
        },
        {
            "verse-id": "[13:23]",
            "verse": "Gardens of perpetual residence; they will enter them with whoever were righteous among their fathers, their spouses and their descendants. And the angels will enter upon them from every gate, [saying],",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:24]",
            "verse": "\"Peace be upon you for what you patiently endured. And excellent is the final home.\"",
            "description": [
                "This implies two things. The angels will",
                " come in large numbers from every side",
                " and give them this good news: \"Now",
                " you have come to a place where",
                " there is peace for you. Here you",
                " arc immune from every affliction, every trouble,",
                " every hardship, and every danger and worry.\"",
                " (For details please see E.N. 29 of",
                " Al-Hijr)."
            ]
        },
        {
            "verse-id": "[13:25]",
            "verse": "But those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and spread corruption on earth - for them is the curse, and they will have the worst home.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:26]",
            "verse": "Allah extends provision for whom He wills and restricts [it]. And they rejoice in the worldly life, while the worldly life is not, compared to the Hereafter, except [brief] enjoyment.",
            "description": [
                "This verse refutes the wrong criterion by",
                " which the disbelievers of Makkah (and all",
                " other foolish people of the world) judged",
                " whether one was or was not a",
                " favorite of God. They judged a man's",
                " worth by his wealth and worldly prosperity",
                " and not by his faith and righteous",
                " conduct. They thought that the one who",
                " was enjoying all the good things of",
                " life was a favorite of God, even",
                " if he had erroneous beliefs and did",
                " wicked deeds. On the other hand, they",
                " considered the one who was poor and",
                " indigent to be under the wrath of",
                " God, even though he was righteous. That",
                " is why in their judgement the chiefs",
                " of the Quraish were far superior to",
                " the followers of the Holy Prophet. They",
                " would say, \"You can see for yourselves",
                " that God is with the chiefs of",
                " the Quraish.\"",
                "In this verse, AIlah has",
                " warned there that they are absolutely wrong",
                " in drawing such a conclusion from the",
                " worldly conditions of the people. AIIah gives",
                " His provision to the people abundantly or",
                " sparingly for reasons different from those which",
                " they presumed and richness or poverty is",
                " no criterion by which to judge the",
                " worth of people. The real criterion of",
                " judging the worth of people is their",
                " beliefs and deeds. The one, who has",
                " righteous beliefs and dces good deeds, shall",
                " be higher in rank than the one",
                " who has wrong beliefs and does evil",
                " deeds. Thus the real criterion is the",
                " quality of one's deeds and not the",
                " possession or the lack of wealth."
            ]
        },
        {
            "verse-id": "[13:27]",
            "verse": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" Say, [O Muhammad], \"Indeed, Allah leaves astray whom He wills and guides to Himself whoever turns back [to Him] -",
            "description": [
                "Please also keep in view the answer",
                " that has been given to this question",
                " in v.7.",
                "*44) This is the answer",
                " to their question. It is not due",
                " to the lack of signs that they",
                " were going astray, but it is the",
                " lack of any desire in them to",
                " seek right guidance. For Allah dces not",
                " force one to follow the Right Way,",
                " if he deliberately turns away from it.",
                " He lets such persons wander on the",
                " wrong ways they choose to wander. Nay,",
                " even all those things that should serve",
                " as a means to guidance for a",
                " seeker of truth, become the means of",
                " deviation for the one who seeks deviation.",
                " So much so that that very torch",
                " which helps show the way to the",
                " former, dazzles the eyes of the latter.",
                " This is how Allah Leads astray a",
                " person.",
                "This answer to the demand of",
                " a Sign is matchless in its eloquence.",
                " It says to them, \"O foolish people!",
                " it is not due to the lack",
                " of Signs that you are not finding",
                " the right path, but it is due",
                " to the lack of any desire in",
                " you for it. You do not see",
                " any of the countless Signs that lie",
                " scattered all around you because you have",
                " no desire to go to the Right",
                " Way. How can then any Sign be",
                " helpful to you ? For you would",
                " not see any of those Signs. However,",
                " those who seek the Right Way to",
                " Allah, see these Signs and find the",
                " Right Way with their help.\""
            ]
        },
        {
            "verse-id": "[13:28]",
            "verse": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:29]",
            "verse": "Those who have believed and done righteous deeds - a good state is theirs and a good return.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:30]",
            "verse": "Thus have We sent you to a community before which [other] communities have passed on so you might recite to them that which We revealed to you, while they disbelieve in the Most Merciful. Say, \"He is my Lord; there is no deity except Him. Upon Him I rely, and to Him is my return.\"",
            "description": [
                "That is, \"In this way that We",
                " have not given you a Sign they",
                " demanded.",
                "*46) That is, \"Instead of serving",
                " that most Compassionate Lord, they are discarding",
                " His service and setting up other partners",
                " in His attributes, powers, rights and giving",
                " thanks to others for His blessings.\""
            ]
        },
        {
            "verse-id": "[13:31]",
            "verse": "And if there was any qur'an by which the mountains would be removed or the earth would be broken apart or the dead would be made to speak, [it would be this Qur'an], but to Allah belongs the affair entirely. Then have those who believed not accepted that had Allah willed, He would have guided the people, all of them? And those who disbelieve do not cease to be struck, for what they have done, by calamity - or it will descend near their home - until there comes the promise of Allah. Indeed, Allah does not fail in [His] promise.",
            "description": [
                "This verse has been addressed to the",
                " Believers who were feeling uneasy that no",
                " such Sign was being sent as was",
                " demanded by the disbelievers. They thought that",
                " such a Sign would convince the disbelievers",
                " and they would accept Islam. Therefore when",
                " no such Sign was sent, they became",
                " alI the more uneasy for the lack",
                " of the fulfilment of the demand that",
                " gave rise to doubts about the Prophethood",
                " of the Messenger. The question posed in",
                " this verse is meant to remove that",
                " uneasiness of the Muslims. It is like",
                " this: \"Do you think that they would",
                " have embraced Islam if such and such",
                " Signs had been shown to them all",
                " of a sudden along with a Surah",
                " of the Qur'an ? Are you under",
                " the delusion that they are quite ready",
                " to accept Islam and are waiting only",
                " for such a Sign ? Do you",
                " think that those people who have failed",
                " to see the light of the Truth",
                " in the teachings of the Qur'an, in",
                " the phenomena of the universe, in the",
                " pure and spotless life of the Holy",
                " Prophet and in the wonderful change in",
                " the lives of his Companions, would see",
                " the light of the Truth in the",
                " moving of the mountains, in the cleavage",
                " of the earth and in the coming",
                " out of the dead from the graves?\"",
                "",
                "*48) \"Allah has full power over everything\"",
                " and can show any Sign if He",
                " so desires. He is not showing any",
                " Sign for it dces not fit in",
                " the scheme laid down for the guidance",
                " of Man. As the real object is",
                " to show Guidance to mankind through the",
                " Prophet and not to compel them to",
                " believe in the Prophethood of a Prophet,",
                " He desires that the people should gain",
                " guidance by thinking and observing wisely and",
                " not by seeing Signs.",
                "*49) That is,",
                " \"If the object had been to make",
                " human beings Believers even without consciously understanding",
                " it, Allah could have created them Believers",
                " by birth. \""
            ]
        },
        {
            "verse-id": "[13:32]",
            "verse": "And already were [other] messengers ridiculed before you, and I extended the time of those who disbelieved; then I seized them, and how [terrible] was My penalty.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:33]",
            "verse": "Then is He who is a maintainer of every soul, [knowing] what it has earned, [like any other]? But to Allah they have attributed partners. Say, \"Name them. Or do you inform Him of that which He knows not upon the earth or of what is apparent of speech?\" Rather, their [own] plan has been made attractive to those who disbelieve, and they have been averted from the way. And whomever Allah leaves astray - there will be for him no guide.",
            "description": [
                "That is, \"They are so audacious that",
                " they set up partners with Allah Whose",
                " knowledge is All-Comprehensive and Who is aware",
                " of even the minutest details of the",
                " good and bad actions of each individual...\"",
                "",
                "*51) These are the audacious things they",
                " do. They ascribe partners and equals to",
                " Him: they believe that some of His",
                " creatures are a part and parcel of",
                " His Being, and have attributes and rights",
                " like Him: they presume that they shall",
                " not be called to account for whatever",
                " they do, even though they live in",
                " His Kingdom.",
                "*52) That is, \"You give",
                " empty names to the partners you ascribe",
                " to Him for you have no real",
                " knowledge about them\" . For you could",
                " get this knowledge only in one of",
                " the three following ways:",
                "First, You might",
                " have received some authentic information that Allah",
                " had made such and such people as",
                " His partners in His attributes, powers and",
                " rights. If it is so, please Iet",
                " us also know their names and the",
                " source of your information.",
                "The second possibility",
                " is that Allah might have remained ignorant",
                " that some beings have become His partners.",
                " Therefore you are going to inform Him",
                " about this. If it is so, please",
                " say it clearly in so many words",
                " so that it may be decided whether",
                " there are some foolish people who can",
                " believe in such a nonsensical claim.",
                "Obviously",
                " the above two suppositions are absurd. Therefore",
                " the only alternative is that, \"You are",
                " ascribing partners to Him without any rhyme",
                " or reason, and you without any knowledge",
                " make one the relative of God, another",
                " the hearer of supplications, and still another",
                " the helper and fulfiller of certain needs",
                " and the ruler of a certain region",
                " etc. etc.\"",
                "*53) Shirk has been called",
                " \"fraud\" because none of the angels, spirits,",
                " saints, heavenly bodies, to whom they ascribe",
                " Divine attributes and powers or render Divine",
                " rights, ever claimed to possess these attributes",
                " or powers, nor did they ever demand",
                " these rights from the people nor told",
                " the people that they would fulfil their",
                " desires and wants, if they would perform",
                " some rituals of worship before them. As",
                " a matter of fact, some clever people",
                " invented these gods in order to practice",
                " wilful deception and dishonesty so that they",
                " might wield powerful influence over the common",
                " people and exploit them and deprive them",
                " of a part of their hard earned",
                " possessions. Accordingly, they made the common people",
                " credulous followers of the gods of their",
                " inventions and set themselves up as their",
                " representatives to get money, etc.., from them",
                " by this fraud.",
                "The second reason why",
                " shirk has been called \"fraud\" is that",
                " a worldly man pretends to believe in",
                " it not because he wants to believe",
                " in it but in order to free",
                " himself from aII moral restraints to enable",
                " him to lead an irresponsible life of",
                " treed and lust.",
                "The third reason is",
                " given below in E. N . 54.",
                "",
                "*54) Shirk is also `fraud' in the",
                " sense that it has been made to",
                " appear fair for them and so leads",
                " them into deviation and prevents them from",
                " coming back to the Right Way. It",
                " is like this: When mushriks adopt wrong",
                " ways of deviation that suit the kind",
                " of lives they wish to lead, they",
                " have to invent arguments to pacify their",
                " consciences and convince other people that grey",
                " are on the right way. Naturally this",
                " fraud confirms them on the way of",
                " deviation and they are debarred from the",
                " Right Way."
            ]
        },
        {
            "verse-id": "[13:34]",
            "verse": "For them will be punishment in the life of [this] world, and the punishment of the Hereafter is more severe. And they will not have from Allah any protector.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:35]",
            "verse": "The example of Paradise, which the righteous have been promised, is [that] beneath it rivers flow. Its fruit is lasting, and its shade. That is the consequence for the righteous, and the consequence for the disbelievers is the Fire.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:36]",
            "verse": "And [the believers among] those to whom We have given the [previous] Scripture rejoice at what has been revealed to you, [O Muhammad], but among the [opposing] factions are those who deny part of it. Say, \"I have only been commanded to worship Allah and not associate [anything] with Him. To Him I invite, and to Him is my return.\"",
            "description": [
                "This is in reply to a specific",
                " objection which was then raised by the",
                " disbelievers. They would say, \"If he has",
                " brought the same Message that was brought",
                " by the Messengers before him (as he",
                " claims). why don't the Jews and the",
                " Christians who are the followers of the",
                " former Prophets come forward and welcome it?\"",
                " The verse answers the objection and says",
                " that the taste followers of the former",
                " Prophets really rejoice in the Message of",
                " the Qur'an, but the false ones have",
                " been offended at it. Then it asks",
                " the Holy Prophet not to worry at",
                " aII about this, saying, \"O Prophet, you",
                " should not mind at alI whether they",
                " are pleased or offended at it. Tell",
                " them plainly that this is the Guidance",
                " I have received from my Lord and",
                " I will follow it at alI costs.\"",
                ""
            ]
        },
        {
            "verse-id": "[13:37]",
            "verse": "And thus We have revealed it as an Arabic legislation. And if you should follow their inclinations after what has come to you of knowledge, you would not have against Allah any ally or any protector.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[13:38]",
            "verse": "And We have already sent messengers before you and assigned to them wives and descendants. And it was not for a messenger to come with a sign except by permission of Allah. For every term is a decree.",
            "description": [
                "This is the answer to another objection.",
                " The disbelievers said that Ire could not",
                " be a Prophet of AIIah because he",
                " had wives and children, for they argued",
                " that Prophets had nothing to do with",
                " carnal desires.",
                "*57) This is the answer",
                " to yet another objection: \"Had he been",
                " a taste Prophet, he would have shown",
                " a Sign like the shining hand a",
                " nd the miraculous staff of Prophet Moses",
                " or he would have restored sight to",
                " the blind or cured lepers like Prophet",
                " Jesus, or brought a Sign like the",
                " she-camel of Prophet Salih\". The answer is",
                " this: \"None of the former Messengers had",
                " any power to show any Sign nor",
                " has this Prophet: Allah showed a Sign",
                " whenever and through whomsoever He considered it",
                " to be necessary and will show any",
                " Sign whenever He will consider it necessary,",
                " and that I have not claimed to",
                " possess any such power that such a",
                " demand might be made from me .",
                " \""
            ]
        },
        {
            "verse-id": "[13:39]",
            "verse": "Allah eliminates what He wills or confirms, and with Him is the Mother of the Book.",
            "description": [
                "This is the answer to another objection",
                " raised against the Revelation of the Qur'an.",
                " The disbelievers said, \"What was the need",
                " of this new Book, when there already",
                " existed the former revealed Books? You say",
                " that this need has arisen because the",
                " former Books have been tampered with; therefore",
                " Allah has abrogated them and commanded that",
                " this new Book should be followed. This",
                " position you have taken is wrong for",
                " how can any one tamper with the",
                " Book of AIIah and how is it",
                " possible that any Book of Allah might",
                " be tampered with? Why did not AIIah",
                " protect these Books from such things as",
                " these? You say that this Book has",
                " been revealed by the same Allah Who",
                " revealed the Torah and the Gospel. Haw",
                " is it then that your way is",
                " different from that of the Torah? You",
                " consider certain things lawful while they are",
                " unlawful according to the Torah, etc. etc.\"",
                " Detailed answers to these objections have been",
                " given in other Surahs but here only",
                " a brief and comprehensive answer has been",
                " given to them.",
                "The Arabic word (",
                " (Umm-ul-Kitab) literally means \"the Mother Book\", that",
                " is, the Original Book which is the",
                " Source and Origin of alI the revealed",
                " Books."
            ]
        },
        {
            "verse-id": "[13:40]",
            "verse": "And whether We show you part of what We promise them or take you in death, upon you is only the [duty of] notification, and upon Us is the account.",
            "description": [
                "This is to console the Holy Prophet,",
                " as if to say, \"O Prophet, you",
                " need not concern yourself as to the",
                " end of these disbelievers who have rejected",
                " the Truth. You should go on performing",
                " with peace of mind the Mission that",
                " has been entrusted to you and leave",
                " it to Us to give them suitable",
                " punishment. \" Though this has been addressed",
                " to the Holy Prophet, it is obvious",
                " that it is really meant to warn",
                " the opponents of the Truth, who were",
                " demanding definitely from the Holy Prophet by",
                " way of a challenge to bring about",
                " the scourge about which threats were being",
                " held out to them."
            ]
        },
        {
            "verse-id": "[13:41]",
            "verse": "Have they not seen that We set upon the land, reducing it from its borders? And Allah decides; there is no adjuster of His decision. And He is swift in account.",
            "description": [
                "\" ......We are advancing in the land",
                " ...........\": this is a very subtle way",
                " of warning the opponents of the Truth:",
                " \"The fact that Our Message is spreading",
                " fast in Arabia does, in fact, mean",
                " that We Ourselves are advancing very fast",
                " in the country against you for We",
                " are with those who are carrying Our",
                " Message.\"",
                "\"...........We are shrinking its boundaries for",
                " them...........\": \"We are causing the influence of",
                " Islam to spread fast in the land",
                " and are thus reducing the boundaries of",
                " the influence of its opponents. Are not",
                " these things the portents of their coming",
                " disaster?\""
            ]
        },
        {
            "verse-id": "[13:42]",
            "verse": "And those before them had plotted, but to Allah belongs the plan entirely. He knows what every soul earns, and the disbelievers will know for whom is the final home.",
            "description": [
                "That is, \"These people, who are now",
                " devising schemes to defeat the Message of",
                " the Truth, do not take a lesson",
                " from the sad end of the people",
                " who devised similar schemes before them to",
                " suppress the voice of the Truth by",
                " falsehood, fraud and persecution.\""
            ]
        },
        {
            "verse-id": "[13:43]",
            "verse": "And those who have disbelieved say, \"You are not a messenger.\" Say, [O Muhammad], \"Sufficient is Allah as Witness between me and you, and [the witness of] whoever has knowledge of the Scripture.\"",
            "description": [
                "That is \"Everyone who has the knowledge",
                " of the Divinely revealed Books will bear",
                " witness to the fact that my teachings",
                " are the same that were imparted by",
                " the former prophets. \""
            ]
        }
    ]
}