{
    "name": "Al-Kahf",
    "id": 18,
    "verse-count": 110,
    "verse-info": [
        {
            "verse-id": "[18:1]",
            "verse": "[All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance.",
            "description": [
                "That is, \"There is nothing intricate or",
                " complicated in it that may be beyond",
                " anyone's understanding nor is there anything that",
                " deviates from the straight path of the",
                " Truth and thus cause hesitation in the",
                " mind of a truth-loving person.\""
            ]
        },
        {
            "verse-id": "[18:2]",
            "verse": "[He has made it] straight, to warn of severe punishment from Him and to give good tidings to the believers who do righteous deeds that they will have a good reward",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:3]",
            "verse": "In which they will remain forever",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:4]",
            "verse": "And to warn those who say, \"Allah has taken a son.\"",
            "description": [
                "\"Those people\" includes the Christians, the Jews",
                " and the mushrik Arabs who assigned offspring",
                " to Allah."
            ]
        },
        {
            "verse-id": "[18:5]",
            "verse": "They have no knowledge of it, nor had their fathers. Grave is the word that comes out of their mouths; they speak not except a lie.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:6]",
            "verse": "Then perhaps you would kill yourself through grief over them, [O Muhammad], if they do not believe in this message, [and] out of sorrow.",
            "description": [
                "This refers to the real cause of",
                " the anxiety of the Holy Prophet at",
                " the time of the revelation of this",
                " Surah . It clearly shows that the",
                " Holy Prophet did not grieve at the",
                " persecution from which he and his Companions",
                " were suffering but at the deviation and",
                " moral degeneration of his people. What was",
                " consuming him was that, though he was",
                " trying to bring them out from their",
                " disgraceful state, they persisted in it. He",
                " was grieved because he was convinced that",
                " their deviation would inevitably lead them to",
                " destruction and scourge of Allah. Therefore he",
                " was working day and night to save",
                " them but it appeared that they were",
                " bent upon incurring the chastisement of AIIah.",
                " The Holy Prophet himself has described this",
                " state of his mind in a Tradition",
                " to this effect: \"I may describe this",
                " thing in a parable. A person kindled",
                " a fire to spread light but the",
                " moths persist in falling over it to",
                " burn themselves alive. He vies to save",
                " them from the fire but the moths",
                " reduce his efforts to failure. The same",
                " is true of me and you. I",
                " hold you by your skirts to keep",
                " you away from the fire, but you",
                " are bent upon falling into it.\" (Bukhari,",
                " Muslim).",
                "Though apparently it is merely stated",
                " \"...... it may be that you will",
                " consume your life for their sake out",
                " of sorrow....\" it also contains a sort",
                " of consolation for the Holy Prophet, as",
                " if to say, \"As you are not",
                " responsible for forcing them to believe, why",
                " should you consume yourself for their sake?",
                " Your only duty is to give good",
                " news and warning and not to turn",
                " people into Believers. Therefore you may go",
                " on carrying out your mission of giving",
                " good news to the Believers and warning",
                " of the bad consequences to the disbelievers.\"",
                ""
            ]
        },
        {
            "verse-id": "[18:7]",
            "verse": "Indeed, We have made that which is on the earth adornment for it that We may test them [as to] which of them is best in deed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:8]",
            "verse": "And indeed, We will make that which is upon it [into] a barren ground.",
            "description": [
                "V. 6 was addressed to the Holy",
                " Prophet, but vv. 7-8 have been directed",
                " to the disbelievers indirectly, as if to",
                " say, \"You must understand it clearly that",
                " all the things that you see in",
                " the world and which allure you, are",
                " a transitory adornment which has been arranged",
                " merely to test you, but it is",
                " a pity that you have been involved",
                " in the misunderstanding that all these things",
                " have been created to cater for your",
                " pleasure and enjoyment. That is why the",
                " only aim and object of life you",
                " have set before you is: \"Eat, drink",
                " and be merry..\" As a result of",
                " this you do not pay any attention",
                " to your true and real well-wisher. You",
                " must understand it well that these things",
                " have not been provided for pleasure but",
                " are actually a means of testing you.",
                " You have been placed among them to",
                " see which of you is allured by",
                " these from the real aim of life",
                " and which of you keeps steadfast in",
                " the worship of Allah, for which you",
                " have been sent to the world. All",
                " these things and means of pleasure shall",
                " come to an end on the Day",
                " your examination is over and nothing will",
                " remain on the earth because it will",
                " be turned into a bare plain.\""
            ]
        },
        {
            "verse-id": "[18:9]",
            "verse": "Or have you thought that the companions of the cave and the inscription were, among Our signs, a wonder?",
            "description": [
                "The Arabic word (Kahaf) literally means a",
                " vast cave.",
                "*7) There is a difference",
                " of opinion about the meaning of ar-raqim.",
                " Some Companions and their followers opined that",
                " it was the name of that habitation",
                " where this event took place and that",
                " it was situated somewhere between Aylah and",
                " Palestine. There are other commentators who take",
                " it to mean the \"Inscription\" that had",
                " been set up at the Cave as",
                " a memorial to \"the Sleepers of the",
                " Cave\". Maulana Abul Kalam Azad, in his",
                " commentary, Tarjmanul-Qur'an, has preferred the first meaning",
                " and opined that it is the same",
                " place which has been called Rekem in",
                " the Bible (Joshua, 18: 27). Then he",
                " identifies it with the ancient historical city",
                " of Petra. But he has not considered",
                " the fact that Rekem, as mentioned in",
                " the Bible, belonged to the children of",
                " Benjamin and according to the Book of",
                " Joshua, the territory of this clan was",
                " situated to the west of river Jordan",
                " and the Dead Sea and that the",
                " ruins of Petra are situated to the",
                " south of Jordan. That is why the",
                " modern archaeologists do not believe that Petra",
                " and Rekem are one and the same",
                " place. (Please refer to Encyclopaedia Britannica, 1946,",
                " Vol XVII, page 658). We are also",
                " of the opinion that by \"Ar-raqim\"is meant",
                " \"the inscription\".",
                "*8) This question has been",
                " posed to expose the sceptical attitude of",
                " the disbelievers towards the \"Sleepers of the",
                " Cave\", as if to say, `Do you",
                " think that AIIah, Who has created the",
                " heavens and the earth, does not have",
                " the power to keep a few persons",
                " in a state of sleep for a",
                " couple of hundred years and then to",
                " raise them up as hale and hearty",
                " as they were at the time of",
                " going to sleep? If you ever had",
                " pondered over the wonderful creation of the",
                " sun and the moon and the earth,",
                " you would never have expressed any doubt",
                " that such a thing was anything difficult",
                " for Allah. \""
            ]
        },
        {
            "verse-id": "[18:10]",
            "verse": "[Mention] when the youths retreated to the cave and said, \"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:11]",
            "verse": "So We cast [a cover of sleep] over their ears within the cave for a number of years.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:12]",
            "verse": "Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:13]",
            "verse": "It is We who relate to you, [O Muhammad], their story in truth. Indeed, they were youths who believed in their Lord, and We increased them in guidance.",
            "description": [
                "The oldest evidence of this story is",
                " found in a homily written in Syriac",
                " by Jacob of Sarug, a Christian priest",
                " of Syria, who was born in A.D.",
                " 452, a few years after the death",
                " of \"the Companions of the Cave.\" The",
                " homily which describes the legend in great",
                " detail was composed by him in or",
                " about A.D. 474. On the one hand,",
                " this same Syriac version came into the",
                " hands of our early commentators, and Ibn",
                " Jarir Tabari cited it in his commentary",
                " with various authorities, and on the other,",
                " it reached Europe where its translations and",
                " abridged versions were published in Greek and",
                " Latin. The abridged story as told by",
                " Gibbon in Chapter 33 of his The",
                " Decline and Fall of the Roman Empire",
                " under the heading, \"The Seven Sleepers\", so",
                " closely resembles the story told by our",
                " commentators that both the versions seem to",
                " have been drawn from the same source.",
                " For instance, the name of the king,",
                " whose persecutions made the Seven Christian youths",
                " of Ephesus take refuge in the cave,",
                " was Emperor Decius according to Gibbon. He",
                " ruled the Roman Empire from A.D. 249",
                " to 251 and whose reign is very",
                " notorious because of his persecution of the",
                " followers of Prophet Jesus Christ, while our",
                " commentators call him `Decanus', `Decaus', etc. The",
                " city, where this event happened, was `Aphesus',",
                " or `Aphesos' according to our commentators, while",
                " according to Gibbon it was Ephesus, which",
                " was the biggest Roman city and sea-port",
                " on the west coast of Asia Minor.",
                " The ruins of this city can still",
                " be seen 20 to 25 miles south",
                " of the modern Turkish city of Izmir.",
                " (Please see Map No. 1 for reference).",
                " Again the name of the king, during",
                " whose reign \"the Companions of the Cave\"",
                " awoke was `Tezusius' according to the Muslim",
                " commentators and Theodosius II according to Gibbon.",
                " He ruled over Rome from A.D. 408",
                " to 450, after the Roman Empire had",
                " accepted Christianity.",
                "The resemblance between the two",
                " versions is so close that even the",
                " name of the companion whom the Sleepers",
                " sent to the city to buy food",
                " after waking up has been mentioned as",
                " `Jamblicha' by the Muslim scholars and Jamblichus",
                " by Gibbon. The details of the story",
                " in both the versions are also similar",
                " which are briefly as follows:",
                "When during",
                " the reign of the Emperor Decius the",
                " followers of Prophet Jesus Christ were being",
                " mercilessly persecuted, the Seven Christian youths hid",
                " themselves in a cave and fell into",
                " a sleep. Then in the 38th year",
                " of the reign of the Emperor Theodosius",
                " I1 (approximately in A.D. 445 or 446)",
                " they awoke when the whole of the",
                " Roman Empire had become Christian. Thus, they",
                " slept in the cave for nearly 196",
                " years.",
                "On this ground some orientalists have",
                " rejected that the above-mentioned story is the",
                " same as that given in the Qur'an",
                " because the period of their stay in",
                " the cave according to the Qur'an (v.",
                " 25) was 309 years. We have, however,",
                " answered this objection in E.N. 25.",
                "There",
                " are a few minor differences between the",
                " Quranic and Syriac versions, on the basis",
                " of which Gibbon has charged the Holy",
                " Prophet with \"ignorance\". However, the Syriac version,",
                " on the basis of whose authenticity he",
                " has committed this gross insolence, was even",
                " according to him written thirty to forty",
                " years after the event by a Syrian.",
                " He has not taken the trouble to",
                " consider the fact that verbal versions of",
                " events do change a bit during such",
                " a long time while they are communicated",
                " from one country to the other. Therefore",
                " it is wrong to take such a",
                " version of the story for granted and",
                " literally true and to charge the Qur'an",
                " with discrepancy for any main difference with",
                " it. Such an attitude is worthy only",
                " .of those people who are so blinded",
                " by religious prejudices that they discard even",
                " the most ordinary demands of reason.",
                "The",
                " city of Ephesus where the event of",
                " the Sleepers of the Cave took place,",
                " was built about 11th century B.C. and",
                " became a great centre of idolworship, its",
                " chief deity being the moon goddess, Diana,",
                " whose temple was regarded as a wonder",
                " of the ancient world. Most of her",
                " devotees belonged to Asia Minor and the",
                " Roman Empire also had accepted her as",
                " one of its deities.",
                "After Prophet Jesus",
                " when his message started reaching different parts",
                " of the Roman Empire, a few youths",
                " of Ephesus also gave up idolworship and",
                " accepted God as their only Lord. Gregory",
                " of Tours has collected details about these",
                " Christian youths in his Meraculorum Liber, which",
                " are briefly as follows:",
                "\"They were seven",
                " youths. When the Emperor Decius heard of",
                " their change of faith, he summoned them",
                " and questioned them about their new religion.",
                " ht spite of knowing that the Emperor",
                " was deadly against the followers of Christ,",
                " they frankly admitted before him that their",
                " Lord is the Lord of the earth",
                " and heavens, and that they recognised none",
                " else as Deity for if they did",
                " so, they would be committing a grave",
                " sin. The Emperor became furious to hear",
                " this, and warned that he would have",
                " them killed, but then considering their tender",
                " age, he granted them three days in",
                " which they were counselled to revert to",
                " their old faith, otherwise they would be",
                " put to death.",
                "\"The seven youths took",
                " advantage of the situation and fled the",
                " city to conceal themselves in a cave",
                " in the mountains. On the way a",
                " dog also followed them: they did their",
                " best to scare it away, but it",
                " would not leave them. At last they",
                " found a spacious cave as a suitable",
                " refuge and hid in it, and the",
                " dog sat at the entrance. Being tired",
                " they soon fell into a deep slumber.",
                " This happened in about 250 A.D. After",
                " about 197 years, in 447 A.D., during",
                " the reign of Emperor Theodosius II, they",
                " awoke suddenly when the whole Roman Empire",
                " had embraced Christianity and the Ephesians had",
                " given up idolatry.",
                "\"At this time a",
                " fierce controversy was going on among the",
                " Romans regardmg the reality of the life-after-death",
                " and Resurrection, and the Emperor himself was",
                " anxious to eradicate somehow the disbelief in",
                " the life-after-death from the minds of his",
                " people. So much so that one day",
                " he prayed that God in His mercy",
                " may show a sign which tray help",
                " restore and correct the people's belief. In",
                " precisely the same days the Seven Sleepers",
                " awoke in the cave.",
                "\"After waking up",
                " the youths started asking one another about",
                " how long they might have slept. Some",
                " said it might have been a day:",
                " others said it was a part of",
                " a day. When they reached no conclusion,",
                " they stopped arguing, leaving the knowledge of",
                " the exact period to God.",
                "Then they",
                " sent Jean, a companion, to the city",
                " with a few silver coins to buy",
                " food, and warned him to be on",
                " his guard lest the people should recognise",
                " him, for they feared that if they",
                " were discovered the Ephesians would force them",
                " to bow before Diana. But when Jean",
                " came to the city he was astonished",
                " to see that the world had changed:",
                " the whole population had embraced Christianity, and",
                " there was nobody in the city to",
                " worship Diana. He came to a shop",
                " and wanted to buy a few loaves",
                " of bread. When he paid in a",
                " coin bearing the image of Emperor Decius,",
                " the shopkeeper could not believe his eyes",
                " and asked the stranger wherefrom he had",
                " obtained that coin. When the young man",
                " said that it was his own, a",
                " dispute began between them and soon a",
                " crowd gathered around them, and the matter",
                " reached the chief officer of the city.",
                " The officer himself was puzzled and wanted",
                " to know the whereabouts of the treasure-house",
                " from where the young man had taken",
                " the coin, but the latter insisted that",
                " it belonged to him. The officer did",
                " not believe him because he thought that",
                " a young man like him could not",
                " possibly possess a centuries-old coin which had",
                " not even been seen by the elders",
                " in the city. When Jean came to",
                " know that the Emperor Decius had died.,",
                " he was pleasantly surprised. He told the",
                " crowd that he and his six companions",
                " had fled the city only the other",
                " day and taken refuge in a cave",
                " to escape Decius' persecution. The officer was",
                " greatly surprised and followed the young man",
                " to see the cave where his companions",
                " lay in hiding. And a great crowd",
                " followed behind them. When they came to",
                " the cave, it was fully established that",
                " the youths really belonged to the Emperor",
                " Decius' period. Consequently, Emperor Theodosius was informed",
                " and he also visited the cave to",
                " receive grace. Then the seven youths went",
                " back into the cave and lay down",
                " and breathed their last. Seeing this clear",
                " sign the people's belief in the life-after-death",
                " was restored, and a monument was ordered",
                " to be built over the cave by",
                " the Emperor.\"",
                "The story of the Sleepers",
                " of the Cave as narrated above, corresponds",
                " so closely with that mentioned in the",
                " Qur'an that the seven youths can easily",
                " be regarded as \"Ashab-i-Kahf\" (the Companions of",
                " the Cave). Some people, however, have raised",
                " the objection that this story concerns a",
                " city of Asia Minor, and the Qur'an",
                " does not discuss or refer to any",
                " event that might have taken place outside",
                " Arabia; therefore it would be against the",
                " Quranic style and spirit to label this",
                " Christian story as the story of Ashab-i-Kahf'.",
                " In our opinion this objection is not",
                " correct. The Qur'an means to impress and",
                " warn the Arabs by relating stories concerning",
                " the various ancient tribes who had transgressed",
                " from the right path and with whom",
                " they were familiar, whether they lived and",
                " flourished inside Arabia or outside it. It",
                " is for this very reason that a",
                " mention has been made of the ancient",
                " history of Egypt in the Qur'an, whereas",
                " Egypt has never been a part of",
                " Arabia. The question is that when the",
                " history of Egypt can be mentioned in",
                " the Qur'an, why cannot Rome and the",
                " Roman history with which the Arabs were",
                " as familiar as with the Egyptian history?",
                " The Roman frontiers adjoined the northern Hijaz",
                " and the Arab caravans traded with the",
                " Romans almost throughout the year. Then there",
                " were a number of Arab tribes who",
                " were directly under Roman domination and the",
                " Roman Empire was in no way unknown",
                " to the Arabs, a fact which is",
                " fully borne nut by Surah Ar-Rum. Another",
                " thing which should be borne in mind",
                " is that the story of the Sleepers",
                " of the Cave has been related in",
                " the Qur'an in response to a query",
                " raised by the disbelievers of Makkah, who",
                " had been prompted by the Jews and",
                " Christians to question the Holy Prophet on",
                " such matters as were wholly unknown to",
                " the Arabs in order to test his",
                " Prophethood.",
                "*10) That is, when they had",
                " believed sincerely, Allah increased their faith in",
                " the guidance and enabled them to become",
                " firm and steadfast on the way of",
                " the' Truth even at the risk of",
                " their lives rather than surrender before falsehood.",
                ""
            ]
        },
        {
            "verse-id": "[18:14]",
            "verse": "And We made firm their hearts when they stood up and said, \"Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:15]",
            "verse": "These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear authority? And who is more unjust than one who invents about Allah a lie?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:16]",
            "verse": "[The youths said to one another], \"And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility.\"",
            "description": [
                "When these God-worshipping youths fled the habitations",
                " to take refuge in the hills, the",
                " city of Ephesus was the principal centre",
                " of idol-worship and sorcery in Asia Minor.",
                " There was a great temple dedicated to",
                " the goddess Diana, which was well-known in",
                " the whole world and attracted devotees from",
                " far end wide. The sorcerers, workers of",
                " magic and occult arts, sooth-sayers and amuletwriters",
                " of Ephesus were well-known and their black",
                " business had spread throughout Syria and Palestine,",
                " even as far as Egypt. The Jews",
                " also had a big share in it,",
                " who attributed this art to Prophet Solomon.",
                " (Please see Cyclopaedia of Biblical Literature under",
                " `Ephesus', for details). The predicament in which",
                " the righteous people living in an environment",
                " of idolatry and superstition were involved can",
                " well be imagined from the remark of",
                " \"the Companions of the Cave' that occurs",
                " in v. 20: \"....... if they succeed",
                " in over-powering us, they will surely stone",
                " us to death or force us back",
                " into their Faith. \""
            ]
        },
        {
            "verse-id": "[18:17]",
            "verse": "And [had you been present], you would see the sun when it rose, inclining away from their cave on the right, and when it set, passing away from them on the left, while they were [laying] within an open space thereof. That was from the signs of Allah. He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide.",
            "description": [
                "It has not been mentioned that in",
                " accordance with this mutual resolve, they left",
                " the city and went to a secret",
                " Cave in the mountains in order to",
                " escape from death or forced apostasy.",
                "*13)",
                " This is to show that the mouth",
                " of the Cave faced the north. That",
                " is why the light of the sun",
                " could not enter inside the Cave and",
                " the one who passed by it could",
                " not see who was inside it."
            ]
        },
        {
            "verse-id": "[18:18]",
            "verse": "And you would think them awake, while they were asleep. And We turned them to the right and to the left, while their dog stretched his forelegs at the entrance. If you had looked at them, you would have turned from them in flight and been filled by them with terror.",
            "description": [
                "That is, \"If some one could have",
                " peeped at the Seven Persons from outside",
                " and seen them turning from one side",
                " to the other at intervals, he would",
                " have thought that they were not asleep",
                " but were relaxing themselves.\"",
                "*15) Allah had",
                " so arranged their refuge that none dared",
                " go inside the Cave and know about",
                " them for it was pitch dark in",
                " the Cave and the dog was keeping",
                " watch at the entrance. If someone ever",
                " peeped into the Cave and saw the",
                " Sleepers, he took them for some robbers",
                " and at once turned on his heels.",
                " This was the reason why their refuge",
                " remained a secret to the outer world",
                " for such a long perio"
            ]
        },
        {
            "verse-id": "[18:19]",
            "verse": "And similarly, We awakened them that they might question one another. Said a speaker from among them, \"How long have you remained [here]?\" They said, \"We have remained a day or part of a day.\" They said, \"Your Lord is most knowing of how long you remained. So send one of you with this silver coin of yours to the city and let him look to which is the best of food and bring you provision from it and let him be cautious. And let no one be aware of you.",
            "description": [
                "They were roused from their sleep in",
                " the same miraculous way that was employed",
                " in sending them to sleep and keeping",
                " them hidden from the outer world."
            ]
        },
        {
            "verse-id": "[18:20]",
            "verse": "Indeed, if they come to know of you, they will stone you or return you to their religion. And never would you succeed, then - ever.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:21]",
            "verse": "And similarly, We caused them to be found that they [who found them] would know that the promise of Allah is truth and that of the Hour there is no doubt. [That was] when they disputed among themselves about their affair and [then] said, \"Construct over them a structure. Their Lord is most knowing about them.\" Said those who prevailed in the matter, \"We will surely take [for ourselves] over them a masjid.\"",
            "description": [
                "The secret of their sleep was revealed",
                " when one of them went to Ephesus",
                " to buy food for them and offered",
                " a coin of the period of Emperor",
                " Decius. As it was a changed world,",
                " he naturally attracted attention for he was",
                " wearing a costume of 300-year old fashion",
                " and spoke a language different from that",
                " in vogue. This was because during those",
                " two centuries the language, culture, dress etc.,",
                " had undergone a marked change. So the",
                " shopkeeper looked askance at him and, according",
                " to a Syriac tradition, suspected that he",
                " had dug up some ancient treasure. Accordingly,",
                " he gathered some people of his neighbourhood",
                " and they took him before the ruler.",
                " On questioning, it was discovered that he",
                " was one of those followers of Christ,",
                " who had fled the city 300 years",
                " ago to save their Faith. As most",
                " of the population had embraced Christianity, the",
                " news immediately spread throughout the city and",
                " a big crowd of the people along",
                " with the Christian Roman Ruler, arrived at",
                " the Cave. It was then that the",
                " Sleepers of the Cave came to know",
                " that they had slept for about three",
                " hundred years. So after making salutations to",
                " their Christian brothers they lay down and",
                " their souls left their bodies.",
                "*18) According",
                " to the Syriac tradition, at the time",
                " of this occurrence, hot discussions were going",
                " on in Ephesus about Resurrection and the",
                " Hereafter. Though the people had embraced Christianity",
                " under the influence of the Roman Empire,",
                " yet traces of shirk and idolatry of",
                " the Romans and the effects of the",
                " Greek philosophy were still very powerful. So",
                " in spite of the Christian creed of",
                " the Hereafter, many people denied this, or",
                " at least were sceptical about this. To",
                " add to this the Sadducee sect of",
                " the Jews, who formed a great part",
                " of the population of the city, openly",
                " denied the Hereafter and professed to base",
                " this on the Torah. The Christian scholars,",
                " however, could not put forward any strong",
                " arguments to refute them: so much so",
                " that the reports of the polemical discussion",
                " given in Matthew, Mark and Luke, attributed",
                " to Prophet Christ, are admittedly very weak",
                " even according to the Christian scholars. (Please",
                " refer to Matthew 22: 23-33, Mark 12:",
                " 18-27, Luke 20: 27-40). That is why",
                " the disbelievers in the Hereafter were having",
                " the upper hand and even the believers",
                " were being involved in doubts about it.",
                " It was at that time that the",
                " Sleepers of the Cave were raised up",
                " and furnished an absolute proof of the",
                " life-after-death and turned the scales in favour",
                " of the believers in this dispute.",
                "*19)",
                " It appears from the context that this",
                " was the saying of the riglfteous people",
                " from among the Christians. They were of",
                " the opinion that a wall should be",
                " raised at the entrance of the Cave",
                " in order to let the Sleepers remain",
                " in the same condition in which they",
                " were, for they argued that their Lord",
                " alone knew best about their rank and",
                " position and the reward they deserved.",
                "*20)",
                " The people \"who prevailed in their matter\"",
                " were the Roman rulers and the priests",
                " of the Christian Church, who did not",
                " let the righteous Christians have their way.",
                " This was because by the middle of",
                " the fifth century, the common people, especially",
                " the orthodox among the Christians, had become",
                " fully involved in shirk and the worship",
                " of saints and tombs. They used to",
                " visit the tombs of the saints to",
                " worship them and kept the statues of",
                " Jesus, Mary and the apostles in their",
                " churches: so much so that a few",
                " years before the rising up of the",
                " Sleepers of the Cave, in 431 A.D.,",
                " a great council of the representatives of",
                " the Christian World had been held in",
                " Ephesus itself, in which it was resolved",
                " that the creed of the divinity of",
                " Christ and of Mary as the mother",
                " of God, should be included in the",
                " articles of the Christian Church. If we",
                " keep in view the year 431, it",
                " becomes clear that by \"those who prevailed",
                " in their matter\" are meant the leaders",
                " of the Church and the officers of",
                " the government, who had the reins of",
                " the religious and political powers in their",
                " hands. In fact these were the people",
                " who were the upholders of shirk and",
                " who decided that a mausoleum should be",
                " built over the Cave of the Sleepers",
                " to make it a place of worship.",
                "",
                "*21) It is an irony that some",
                " people among the Muslims have misconstrued this",
                " verse of the Qur'an so as to",
                " make it lawful for themselves to build",
                " mausoleums, monuments and mosques over the tombs",
                " of the righteous persons and saints. The",
                " Qur'an has, in fact, pointed out the",
                " deviation of the workers of iniquity who",
                " prevailed upon others and built a place",
                " of worship over the Cave of the",
                " Sleepers, who were indeed a Sign of",
                " Resurrection and of the life-after-death. But they",
                " abused this good opportunity and produced another",
                " means of practising shirk.",
                "One fails to",
                " understand how anyone can deduce from this",
                " verse an argument for the legality of",
                " building mosques over the tombs of the",
                " righteous people, when the Holy Prophet has",
                " categorically prohibited this:",
                "(1) \"Allah has cursed",
                " those women who visit tombs and those",
                " people who build mosques over them and",
                " burn lights over them\" (Ahmad, Tirmizi, Abu",
                " Dawud, Nasa'i, Ibn Majah).",
                "(2) \"Beware that",
                " the people, who have passed before you,",
                " made the tombs of their Prophets the",
                " places of their worship. I forbid you",
                " to do that.\" (Muslim)",
                "(3) \"AIIah has",
                " cursed the Jews and the Christians, for",
                " they made the tombs of their Prophets",
                " the places of their worship.\" (Ahmad, Bukhari,",
                " Muslim, Nasa'i).",
                "(4) \"The behaviour of those",
                " people was strange: if a righteous person",
                " from among them, died they would build",
                " a mosque over his grave and draw",
                " his pictures. They will be treated as",
                " worst criminals on the Day on Resurrection.\"",
                " (Ahmad, Bukhari, Muslim, Nasa'i).",
                "Thus, it is",
                " clear from the above Sayings of the",
                " Holy Prophet that building of the places",
                " of worship over the tombs is utterly",
                " unlawful; the Qur'an has merely stated as",
                " a historical fact the sinful act of",
                " the Christian priests and the Roman rulers",
                " and has not sanctioned such a thing.",
                " Therefore no God-fearing person can turn this",
                " into an argument for building mosques over",
                " the tombs.",
                "Incidentally, it will be worth",
                " while to cite a statement of Rev.",
                " T. Arundell who published his Discoveries in",
                " Asia Minor in 1834. He says that",
                " he had seen the remains of the",
                " Mausoleums of Mary and the Seven Sleepers",
                " on a hillock near the remains of",
                " the ancient city of Ephesus."
            ]
        },
        {
            "verse-id": "[18:22]",
            "verse": "They will say there were three, the fourth of them being their dog; and they will say there were five, the sixth of them being their dog - guessing at the unseen; and they will say there were seven, and the eighth of them was their dog. Say, [O Muhammad], \"My Lord is most knowing of their number. None knows them except a few. So do not argue about them except with an obvious argument and do not inquire about them among [the speculators] from anyone.\"",
            "description": [
                "This shows that about three hundred years",
                " after this event, at the time of",
                " the revelation of the Qur'an, different stories",
                " had become current among the Christians about",
                " the Sleepers of the Cave, but generally",
                " these stories had no authentic source behind",
                " them.' This was because that was not",
                " the age of the press in which",
                " authentic books might have been published. Therefore",
                " naturally the stories of events were carried",
                " from place to place by means of",
                " oral traditions, and with the passage of",
                " time many tales of fiction got mixed",
                " up with the real story.",
                "*23) This",
                " is meant to impress that the real",
                " thing in this story is not the",
                " number of the Sleepers but the lessons",
                " it teaches: (1) A true believer should",
                " not on any account turn away from",
                " the truth and bow before falsehood. (2)",
                " A believer should not merely rely on",
                " the material means but on AIIah. He",
                " should trust in God and follow the",
                " right way, even though the outward adverse",
                " circumstances might appear to be unfavourable. (3)",
                " It is wrong to suppose that Allah",
                " is bound by any so-called \"Law of",
                " Nature\", for He is able to do",
                " any thing He wills even though that",
                " might seem to be against some common",
                " experience. He has the power to change",
                " any so-called law of nature, whenever and",
                " wherever He wills and bring about any",
                " extraordinary \"supernatural\" thing. So much so that",
                " He can raise up anyone who might",
                " have been asleep for two hundred years,",
                " as if he had slept only for",
                " a few hours, without letting any change",
                " take place in his appearance, dress, health,",
                " indeed in anything, during the passage of",
                " time. (4) This teaches us that Allah",
                " has the power to bring to life",
                " all the generations-past, present and futureall together",
                " as asserted by the Prophets and Divine",
                " Scriptures. (5) It teaches us that ignorant",
                " people have always been perverting the Signs",
                " of Allah which are sent for the",
                " right guidance of the people. That is",
                " how the miracle of the Sleepers of",
                " the Cave, which had been shown as",
                " a proof of the Hereafter, had been",
                " turned into a means of shirk, as",
                " if they were some saints who had",
                " been sent only for this purpose.",
                "It",
                " is obvious from the above-mentioned real lessons,",
                " which one can learn from the story",
                " of the Sleepers, that a wise man",
                " will pay his attention to these things",
                " and not divert it in search of",
                " their number, their names, the colour of",
                " their dog and the like. Only those",
                " people, who have no interest for the",
                " reality but for superficial things, will spend",
                " their time and energy in making investigations",
                " about such things. That is why AIIah",
                " instructed the Holy Prophet: \"You should not",
                " enter into useless and irrelevant discussions about",
                " such things, if other people try to",
                " involve you in them. Instead of wasting",
                " your time in such useless things, you",
                " should concentrate your attention only on your",
                " mission.\" That is why Allah has not",
                " Himself told their exact number lest it",
                " should encourage such people as are always",
                " hankering after useless things."
            ]
        },
        {
            "verse-id": "[18:23]",
            "verse": "And never say of anything, \"Indeed, I will do that tomorrow,\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:24]",
            "verse": "Except [when adding], \"If Allah wills.\" And remember your Lord when you forget [it] and say, \"Perhaps my Lord will guide me to what is nearer than this to right conduct.\"",
            "description": [
                "This is a parenthetical clause which has",
                " been inserted here because of its relevancy",
                " to the preceding verse, in which it",
                " was asserted that the correct number of",
                " the Sleepers of the Cave is known",
                " only to Allah and a research into",
                " it is a useless task. Therefore one",
                " should refrain from investigating into unimportant things,",
                " nor enter into discussions about them. This",
                " has led to the instruction contained in",
                " the parenthetical clause for the benefit of",
                " the Holy Prophet and the Believers who",
                " have been told never to make a",
                " positive assertion like this: \"L will do",
                " this thing tomorrow\", for you do not",
                " know whether you will be able to",
                " do that thing or not: you have",
                " neither the knowledge of the unknown nor",
                " have full powers to do what you",
                " like. If ever inadvertently you utter anything",
                " like this, you should at once remember",
                " your Lord and say, \"lnsha Allah.\" Besides",
                " this you do not know whether there",
                " will be any good for you in",
                " the thing about which you say, \"1",
                " will do this.\" It is possible that",
                " you may do another thing better than",
                " that. Therefore you should trust in God",
                " and say, \"I hope that my Lord",
                " will guide me in this matter with",
                " that thing which is nearer to the",
                " right way for me.\""
            ]
        },
        {
            "verse-id": "[18:25]",
            "verse": "And they remained in their cave for three hundred years and exceeded by nine.",
            "description": [
                "This sentence is connected with the theme",
                " preceding the parenthetical clause like this: \"Some",
                " people wilt say, `They were three and",
                " the fourth was their do:.....' and some",
                " people will say that they remained in",
                " the Cave for three hundred years and",
                " some others would add nine more years",
                " (to the reckoning of the period)\". We",
                " are of the opinion that the number",
                " of the years \"300 and 309\" have",
                " not been stated by AIIah Himself but",
                " Allah has cited these as sayings of",
                " the people. \"this opinion is based on",
                " this succeeding sentence: \"Allah knows best about",
                " the period of their stay there. If",
                " the number of years, given in v.",
                " 25, had been from ;>Allah, this succeeding",
                " sentence would have been meaningless. hadrat `Abdullah",
                " bin 'Abbas has also opined that this",
                " is not the saying of Allah but",
                " that of the people which has been",
                " cited as a part of the story.",
                ""
            ]
        },
        {
            "verse-id": "[18:26]",
            "verse": "Say, \"Allah is most knowing of how long they remained. He has [knowledge of] the unseen [aspects] of the heavens and the earth. How Seeing is He and how Hearing! They have not besides Him any protector, and He shares not His legislation with anyone.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:27]",
            "verse": "And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.",
            "description": [
                "After relating the story of the Sleepers",
                " of the Cave, the Qur'an begins to",
                " review the condition of the Muslims of",
                " Makkah at the time of the revelation",
                " of the Surah.",
                "*27) This does not",
                " mean at alI that, God forbid, the",
                " Holy Prophet was inclined to make any",
                " changes in the Qur'an to please the",
                " disbelievers of Makkah and was thinking of",
                " some formula of compromise with the chiefs",
                " of the Quraish which necessitated a warning",
                " that he was not authorised to do",
                " so. As a matter of tact, though",
                " this was apparently addressed to the Holy",
                " Prophet, it was really meant for the",
                " disbelievers that they should not entertain any",
                " hope whatsoever for anything like this, as",
                " if to say, \"You must understand it",
                " once for all that Our Messenger is",
                " nut authorised to make any changes in",
                " Our Revelation, for he has to precisely",
                " just as it is sent down to",
                " him. If you want to accept it,",
                " you will have to accept it in",
                " its entirety as it is being sent",
                " by the Lord of the Universe: and",
                " if you want to reject it, you",
                " may do so but you must understand",
                " it well that no modification even in",
                " the least, will be made in it",
                " to please you. \" This was the",
                " answer to the repeated demand of the",
                " disbelievers. \"If you do insist, O Muhammad",
                " (Allah's peace be upon him), that we",
                " should accept your Message in its entirety,",
                " then make certain modifications in it to",
                " accommodate some creeds and customs of our",
                " forefathers, and we will accept your Message.",
                " This is our offer for a compromise",
                " and this will save our people from",
                " dis-union. \" This demand of the disbelievers",
                " has been cited in the Qur'an at",
                " several places and the same answer has",
                " been given, e.g. \"When Our clear Revelations",
                " are recited to them, those who do",
                " not expect to meet Us, say, `Bring",
                " an other Qur'an in its stead or",
                " make some amendments in it' ....\" (X:",
                " 15)"
            ]
        },
        {
            "verse-id": "[18:28]",
            "verse": "And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His countenance. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect.",
            "description": [
                "Though these words have also been addressed",
                " to the Holy Prophet, they are really",
                " meant for the chiefs of the Quraish.",
                " According to a Tradition related by Ibn",
                " `Abbas, the chiefs of the Quraish would",
                " say to the Holy Prophet that they",
                " considered it below their dignity to sit",
                " with such people as Bilal, Suhaib, 'Ammar,",
                " Khabbab, Ibn-Mas`ud and the like who generally",
                " remained in his company: and that if",
                " he should send them away, they would",
                " be willing to attend his meetings in",
                " order to learn about his Message. At",
                " this Allah revealed this verse: \"And keep",
                " yourself whole-heartedly content with those who pray",
                " to their Lord morning and evening in",
                " order to win His approval and do",
                " not turn your attention away from them:",
                " (Do you desire to discard these sincere",
                " but poor people so that the chiefs",
                " of the Quraish, the well-to-do people, should",
                " come and sit near you?)\" This was",
                " meant to warn the chiefs of the",
                " Quraish to this effect: \"Your wealth, your",
                " pomp and show of which you are",
                " so proud, has no value at all",
                " in the sight of Allah and His",
                " Messenger; nay, those poor people are really",
                " more worthy in their sight, for they",
                " are sincere and always remember Allah.\" The",
                " same was the attitude of the chiefs",
                " of Prophet Noah's people, who said, \"And",
                " we see also that none but the",
                " meanest and the most shallow of our",
                " people have become your followers. \" ....",
                " (Noah replied,) \"I am not going to",
                " drive away those who have believed in",
                " me, nor can I say about those",
                " whom you disdain, `Allah has not bestowed",
                " any good on them' . . .",
                " \" (XXI: vv. 27, 29, 31)",
                "*29)",
                " That is, \"Do not yield to what",
                " he says, nor submit to him, nor",
                " fulfil his desire, nor follow his bidding.\"",
                "",
                "*30) The original Arabic text may also",
                " mean, \"Who discards the truth, breaks all",
                " moral limits and rushes on headlong.\" But",
                " in both cases it comes to this:",
                " \"The one, who is neglectful of Allah",
                " and becomes a slave of his lust,",
                " inevitably transgresses all limits and becomes a",
                " victim of immoderation. Therefore the one,who will",
                " submit to him, will also follow the",
                " same way and wander about in deviation",
                " after him."
            ]
        },
        {
            "verse-id": "[18:29]",
            "verse": "And say, \"The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve.\" Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like murky oil, which scalds [their] faces. Wretched is the drink, and evil is the resting place.",
            "description": [
                "This verse makes it quite plain that",
                " the story of the Sleepers of the",
                " Cave has been related to tell the",
                " opponents of Islam: \"This is the Truth",
                " from your Lord: now whosoever wills, he",
                " may accept it and whosoever wills, he",
                " may reject it. But people must understand",
                " that no compromise will be made in",
                " regard to the Truth just as the",
                " Sleepers of the Cave did not make",
                " any compromise with regard to their creed.",
                " They did not make any compromise in",
                " regard to the Doctrine of Tauhid after",
                " they had believed in it and categorically",
                " declared, \"Our Lord is the One Who",
                " alone is the Lord of the heavens",
                " and the earth.\" After this declaration they",
                " did not in any way accede to",
                " the making of any compromise with their",
                " people, who had gone astray, but firmly",
                " declared, \"We will not give Him up",
                " and pray to other deities, because it",
                " will be the most improper thing, if",
                " we do so.\" After making this declaration",
                " they left their people and deities and",
                " took refuge in the Cave without taking",
                " any provisions with them. After' this when",
                " they rose up, the only thing about",
                " which they showed any anxiety, was that",
                " their people might not succeed in forcing",
                " them back to their own faith. After",
                " relating these things, the Qur'an addresses the",
                " Holy Prophet to the effect (though these",
                " words are really meant for the opponents",
                " of Islam): \"It is absolutely out of",
                " question whether any compromise can be made",
                " with mushriks and disbelievers. present the truth",
                " intact to them whether they accept it",
                " or not. If they do not accept",
                " it, they themselves will meet with an",
                " evil end. As regards those, who have",
                " accepted the Truth (whether they be youngsters",
                " or poor, indigent people or slaves or",
                " labourers,) they are really those people who",
                " have a worth with Allah, and they",
                " alone will be honoured. Therefore you should",
                " not discard them and prefer the chiefs",
                " and the rich people who may be",
                " neglectful of Allah and be slaves of",
                " their lust, even though they might be",
                " possessors of worldly grandeur. \" \n*32) The",
                " Arabic word ~l~ir' (Suradiq) literally means sides",
                " of a tent but, as used in",
                " the case of Hell, it may mean",
                " its external boundaries to which its flames",
                " and heat may reach. According to some",
                " commentators, it applies to the future reuse",
                " \".... its flames will encircle them\" so",
                " as to refer to the flames of",
                " Hell in the Hereafter. But we are",
                " of the opinion that its flames have",
                " already encircled, in this very world, these",
                " workers of iniquity, who have turned away",
                " from the Truth and that they cannot",
                " escape them.\n*33) The Arabic word ,}~",
                " (muhl) has several lexical meanings. According to",
                " some people, it means \"the residue of",
                " oil\"; according to others, \"lava\", which is",
                " formed by the melting of things in",
                " the earth; according to some, \"molten matter\"",
                " and according to others \"pus and blood\"",
                ""
            ]
        },
        {
            "verse-id": "[18:30]",
            "verse": "Indeed, those who have believed and done righteous deeds - indeed, We will not allow to be lost the reward of any who did well in deeds.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:31]",
            "verse": "Those will have gardens of perpetual residence; beneath them rivers will flow. They will be adorned therein with bracelets of gold and will wear green garments of fine silk and brocade, reclining therein on adorned couches. Excellent is the reward, and good is the resting place.",
            "description": [
                "The dwellers of Paradise will be adorned",
                " with bracelets of gold like the kings",
                " of ancient times. This will be to",
                " show that they will be adorned like",
                " the kings of this world, whereas an",
                " unbeliever and wicked king will be disgraced",
                " there.",
                "*35) The Arabic word .'~~~~ (ara",
                " aik) is plural of arikah which is",
                " that kind of throne that is covered",
                " with an umbrella. This is also to",
                " show that in Paradise the Believers will",
                " sit on thrones like the kings of",
                " this world."
            ]
        },
        {
            "verse-id": "[18:32]",
            "verse": "And present to them an example of two men: We granted to one of them two gardens of grapevines, and We bordered them with palm trees and placed between them [fields of] crops.",
            "description": [
                "In order to understand the significance of",
                " this parable we should keep in view",
                " v. 28 in which arrogant chiefs ,",
                " of Makkah were told that the poor",
                " Companions of the Holy Prophet would not",
                " be discarded to please them."
            ]
        },
        {
            "verse-id": "[18:33]",
            "verse": "Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:34]",
            "verse": "And he had fruit, so he said to his companion while he was conversing with him, \"I am greater than you in wealth and mightier in [numbers of] men.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:35]",
            "verse": "And he entered his garden while he was unjust to himself. He said, \"I do not think that this will perish - ever.",
            "description": [
                "He considered his gardens to be \"Paradise\".",
                " Thus he behaved like those mean persons,",
                " who, when rise to power and wealth,",
                " are always involved in the misunderstanding that",
                " they are enjoying \"Paradise\" in this world;",
                " therefore they do not stand in need",
                " of any other Paradise."
            ]
        },
        {
            "verse-id": "[18:36]",
            "verse": "And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\"",
            "description": [
                "That +s, \"I don't think there is",
                " any life-after-death, but supposing there be one,",
                " 1 shall fare even better there than",
                " in my present life, for my prosperity",
                " is a clear proof that I am",
                " a favourite of God.\""
            ]
        },
        {
            "verse-id": "[18:37]",
            "verse": "His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man?",
            "description": [
                "This shows that \"unbelief \" in Allah",
                " is not confined to the denial of",
                " the existence of God in so many",
                " words, but arrogance, pride, vanity and the",
                " denial of the Hereafter are also kufr.",
                " Although that person did not deny the",
                " existence of Allah, may be he professed",
                " it as is apparent from his words",
                " (\"If ever I am returned to my",
                " Lord-\"), yet in spite of his profession,",
                " his neighbour charged him with unbelief in",
                " Allah. This is because the person, who",
                " considers his wealth and his grandeur etc.,",
                " to be the fruits of his own",
                " power and capability and not the favours",
                " of Allah, and who thinks that they",
                " are everlasting and none can take than",
                " away from hint and that he is",
                " not accountable to anyone, is guilty of",
                " \"unbelief in AIIah\", even though he might",
                " profess belief in Him, for he acknowledges",
                " Allah as a Being and 'not as",
                " his Master, Owner and Sovereign. In fact,",
                " belief in Allah demands not merely the",
                " profession of His existence but also the",
                " acknowledgment of His Sovereignty, Mastery, Rule and",
                " the like."
            ]
        },
        {
            "verse-id": "[18:38]",
            "verse": "But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:39]",
            "verse": "And why did you, when you entered your garden, not say, 'What Allah willed [has occurred]; there is no power except in Allah '? Although you see me less than you in wealth and children,",
            "description": [
                "That is, \"If we are able to",
                " do anything, it is by the help",
                " and support of Allah alone.\""
            ]
        },
        {
            "verse-id": "[18:40]",
            "verse": "It may be that my Lord will give me [something] better than your garden and will send upon it a calamity from the sky, and it will become a smooth, dusty ground,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:41]",
            "verse": "Or its water will become sunken [into the earth], so you would never be able to seek it.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:42]",
            "verse": "And his fruits were encompassed [by ruin], so he began to turn his hands about [in dismay] over what he had spent on it, while it had collapsed upon its trellises, and said, \"Oh, I wish I had not associated with my Lord anyone.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:43]",
            "verse": "And there was for him no company to aid him other than Allah, nor could he defend himself.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:44]",
            "verse": "There the authority is [completely] for Allah, the Truth. He is best in reward and best in outcome.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:45]",
            "verse": "And present to them the example of the life of this world, [its being] like rain which We send down from the sky, and the vegetation of the earth mingles with it and [then] it becomes dry remnants, scattered by the winds. And Allah is ever, over all things, Perfect in Ability.",
            "description": [
                "\"Allah has power over everything\": He gives",
                " life and also death: He causes the",
                " rise and the downfall: It is by",
                " His conunand that the seasons change. Therefore,",
                " O disbelievers, if you are enjoying prosperity",
                " today, you should be under no delusion",
                " that this condition will remain for ever.",
                " That God, by Whose conunand these things",
                " have been bestowed on you, has the",
                " power to snatch away all this by",
                " another conunand."
            ]
        },
        {
            "verse-id": "[18:46]",
            "verse": "Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:47]",
            "verse": "And [warn of] the Day when We will remove the mountains and you will see the earth prominent, and We will gather them and not leave behind from them anyone.",
            "description": [
                "The mountains will begin to move about",
                " like clouds when the gravitation of the",
                " earth shall be brought to an end.",
                " The Qur'an has described the same thing",
                " in XXVII: 88 in this way: \"When",
                " you see the mountains, you consider them",
                " to be firmly fixed, but they shall",
                " be floating about like clouds at that",
                " time.\"",
                "*43) \"You will find the Earth",
                " quite naked\": You will find no vegetation",
                " and no building on it and it",
                " will become a barren plain. It is",
                " the same thing that has been stated",
                " in v. 8 of this Chapter.",
                "*44)",
                " That is, \"We will muster together every",
                " human being from the first Man, Adam,",
                " to the last one born in the",
                " last moment of the Day of Resurrection:",
                " even that child which had breathed the",
                " first breath after its birth, shall be",
                " resurrected and all shall be mustered at",
                " one and the same tune.\""
            ]
        },
        {
            "verse-id": "[18:48]",
            "verse": "And they will be presented before your Lord in rows, [and He will say], \"You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment.\"",
            "description": [
                "This thing will be addressed to those",
                " who denied the Hereafter, as if to",
                " say, \"Well, now you see that the",
                " information given by the Prophets has come",
                " out to be true. They told you",
                " that Allah would bring you to life",
                " again as He first brought you out",
                " from the wombs of your mothers but",
                " you disbelieved in it. Now say whether",
                " you have been brought to life for",
                " the second time or not.\""
            ]
        },
        {
            "verse-id": "[18:49]",
            "verse": "And the record [of deeds] will be placed [open], and you will see the criminals fearful of that within it, and they will say, \"Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?\" And they will find what they did present [before them]. And your Lord does injustice to no one.",
            "description": [
                "\"Your Lord will not be unjust to",
                " anyone in the least\": Neither will an",
                " evil deed not committed by someone have",
                " been recorded in his Conduct Register, nor",
                " shall anyone be punished more than one",
                " deserved for his crime, nor shall an",
                " innocent person be punished at all."
            ]
        },
        {
            "verse-id": "[18:50]",
            "verse": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange.",
            "description": [
                "The reference to the story of Adam",
                " and Iblis has been made here to",
                " warn the erring people of their folly.",
                " It is an obvious folly that people",
                " should discard their Prophets, who were their",
                " well-wishers, and get entangled in the snare",
                " set by their eternal enemy, Iblis, who",
                " has been jealous of man ever since",
                " he refused to bow down before Adam",
                " and became accursed.",
                "*48) It was possible",
                " for Iblis to disobey Allah because he",
                " was not one of the angels but",
                " one of the jinns. It must be",
                " noted that the Qur'an is very explicit",
                " that the angels are inherently obedient:",
                "(1)",
                " \"They do not show arrogance; they fear",
                " their Lord Who is above them, and",
                " do whatever they are bidden.\" (XVI: 50)",
                "",
                "(2) \"..... They do not disobey the",
                " Command that is given to them by",
                " their Lord and do whatever they are",
                " bidden to do.\" (LXVI: 6)",
                "In contrast",
                " to the angels, the jinns have been,",
                " like human beings, given the option to",
                " obey or not to obey. Therefore they",
                " have been given the power to believe",
                " or disbelieve, to obey or not to",
                " obey. This thing has been made explicit",
                " here by saying that Iblis was one",
                " of the jinns, so he deliberately chose",
                " the way of disobedience. Incidentally, this verse",
                " removes all those misunderstandings that are generally",
                " found among the common people that Iblis",
                " was one of the angels and not",
                " an ordinary angel but the instructor of",
                " the angels. As regards the difficulty that",
                " arises because of this statement of the",
                " Qur'an, \"When We said to the angels,",
                " `Bow down before Adam. They bowed down",
                " but Iblis did not',\" it should be",
                " noted that the Command to the angels",
                " was meant for all those on the",
                " Earth who were under the administration of",
                " the angels so that they should also",
                " be made submissive to man. Accordingly all",
                " these creatures bowed along with the angels",
                " but Iblis refused to bow down along",
                " with them."
            ]
        },
        {
            "verse-id": "[18:51]",
            "verse": "I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.",
            "description": [
                "This thing has been asserted to impress",
                " on the disbelievers that the satans were",
                " not entitled to their submission and worship,",
                " for they had no share at all",
                " in the creation of the heavens and",
                " the earth, nay, they themselves were the",
                " creation of Allah: therefore Allah alone was",
                " worthy of worship."
            ]
        },
        {
            "verse-id": "[18:52]",
            "verse": "And [warn of] the Day when He will say, \"Call 'My partners' whom you claimed,\" and they will invoke them, but they will not respond to them. And We will put between them [a valley of] destruction.",
            "description": [
                "This theme has already been stated at",
                " several places in the Qur'an. This is",
                " to impress that it is shirk to",
                " discard the commandments and the guidance of",
                " Allah and to follow the orders and",
                " guidance of any other than Allah, though",
                " one may not be professing with one's",
                " tongue that there is any partner of",
                " Allah: nay, if one might be cursing",
                " others but at the same time following",
                " their orders instead of Divine Commandments, even",
                " then that one shall be guilty of",
                " shirk. For instance, we see that everyone",
                " in this world curses satans but still",
                " follows them. According to the Qur'an, in",
                " spite of cursing them, if people follow",
                " satans, they shall be guilty of setting",
                " up satans as partners with Allah. Though",
                " this will not be shirk in so",
                " many words, it will be tantamount to",
                " the practice of shirk and the Qur'an",
                " denounces this as shirk.",
                "*51) Generally the",
                " commentators have assigned two meanings to this.",
                " The one is the same that we",
                " have adopted in our translation and the",
                " other is this: \"We will cause enmity",
                " between them.\" That is, \"Their friendship in",
                " this world shall be turned into bitter",
                " enmity in the Hereafter. \""
            ]
        },
        {
            "verse-id": "[18:53]",
            "verse": "And the criminals will see the Fire and will be certain that they are to fall therein. And they will not find from it a way elsewhere.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:54]",
            "verse": "And We have certainly diversified in this Qur'an for the people from every [kind of] example; but man has ever been, most of anything, [prone to] dispute.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:55]",
            "verse": "And nothing has prevented the people from believing when guidance came to them and from asking forgiveness of their Lord except that there [must] befall them the [accustomed] precedent of the former peoples or that the punishment should come [directly] before them.",
            "description": [
                "This is to warn the people that",
                " the Qur'an has left no stone unturned",
                " in making the Truth plain. It has",
                " employed all kinds of arguments, parables, similitudes",
                " and used all the possible effective ways",
                " to appeal to the heart and the",
                " mind of man, and adopted the best",
                " possible style. In short, nothing has been",
                " left that could persuade the people to",
                " accept the Truth. If, in spite of",
                " this, they do not accept the truth,",
                " it is obvious that they are waiting",
                " for God's scourge like the one that",
                " visited the former communities to make them",
                " realize their error."
            ]
        },
        {
            "verse-id": "[18:56]",
            "verse": "And We send not the messengers except as bringers of good tidings and warners. And those who disbelieve dispute by [using] falsehood to [attempt to] invalidate thereby the truth and have taken My verses, and that of which they are warned, in ridicule.",
            "description": [
                "This verse has two meanings:",
                "(1) We",
                " send Our Messengers to forewarn the people",
                " before the coming of the judgment of",
                " the good results of obedience and the",
                " evil consequences of disobedience. But these foolish",
                " people are not taking advantage of these",
                " forewarnings and insist on seeing the same",
                " evil end from which the Messengers desire",
                " to save them.",
                "(2) It' they insist",
                " on meeting with the scourge, they should",
                " not demand this from the Messenger because",
                " the Messenger is sent not to bring",
                " a scourge but to warn the people",
                " beforehand to escape from it."
            ]
        },
        {
            "verse-id": "[18:57]",
            "verse": "And who is more unjust than one who is reminded of the verses of his Lord but turns away from them and forgets what his hands have put forth? Indeed, We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if you invite them to guidance - they will never be guided, then - ever.",
            "description": [
                "Allah puts a covering over the heart",
                " of a person and makes his ears",
                " hard of hearing the Truth when he",
                " adopts the attitude of contention, dispute, wrangling",
                " and argumentation towards the admonition of a",
                " well-wisher and tries to defeat the truth",
                " with the weapons of falsehood and cunning.",
                " Naturally this attitude produces in him obduracy",
                " and obstinacy so that he turns a",
                " deaf ear towards guidance, and is unwilling",
                " to realize his error before seeing his",
                " evil end. For such people pay no",
                " heed to admonition and warning and insist",
                " on falling into the abyss of perdition:",
                " then and then alone they are convinced",
                " that it was perdition towards which they",
                " were rushing headlong."
            ]
        },
        {
            "verse-id": "[18:58]",
            "verse": "And your Lord is the Forgiving, full of mercy. If He were to impose blame upon them for what they earned, He would have hastened for them the punishment. Rather, for them is an appointment from which they will never find an escape.",
            "description": [
                "This is to warn the foolish people",
                " that they should not be deluded by",
                " the respite that is given to them",
                " and presume that they will never be",
                " taken to task whatever they may go",
                " on doing. They forget that Allah gives",
                " them respite because He is Forgiving and",
                " Forbearing and does not punish the evil-doers",
                " on the spot, for His Mercy demands",
                " that the evil-doers should be given respite",
                " so that they may mend their ways.",
                ""
            ]
        },
        {
            "verse-id": "[18:59]",
            "verse": "And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.",
            "description": [
                "The ruined habitations were of Saba, Thamud,",
                " Midian and the people of Prophet Lot,",
                " which were visited by the Quraish during",
                " their trade journeys, and which were quite",
                " well known to other Arabs also."
            ]
        },
        {
            "verse-id": "[18:60]",
            "verse": "And [mention] when Moses said to his servant, \"I will not cease [traveling] until I reach the junction of the two seas or continue for a long period.\"",
            "description": [
                "Though this story was told in answer",
                " to the question of the disbelievers, it",
                " has been used to impress a very",
                " important truth on the minds of both",
                " the disbelievers and the believers. It is",
                " this: those people who draw their conclusions",
                " only from the seeming aspects of events,",
                " make a very serious error in their",
                " deductions, for they only see what is",
                " apparent and do not go deep into",
                " the Divine Wisdom that underlies them. When",
                " they daily see the prosperity of the",
                " tyrants and the afflictions of the innocent",
                " people, the affluence of the disobedient people",
                " and the indigence of the obedient people,",
                " the enjoyments of the wicked people and",
                " the adversity of the virtuous people, they",
                " get involved in mental conflicts, nay, they",
                " become victims of misunderstandings because they do",
                " not comprehend the wisdom behind them. The",
                " disbelievers and the tyrants conclude from this",
                " that the world is functioning without any",
                " moral laws and has no sovereign, and,",
                " if there is one, he must be",
                " senseless and unjust: therefore one may do",
                " whatever one desires for there is none",
                " to whom one shall be accountable. On",
                " the other hand, when the believers see",
                " those things, they become so frustrated and",
                " disheartened that sometimes their faiths are put",
                " to x very hard trial. It was",
                " to unravel the wisdom behind this mystery",
                " that Allah slightly lifted the curtain from",
                " the Reality governing His factory, so that",
                " Moses might see the wisdom behind the",
                " events that are happening day and night",
                " and how their seeming aspect is quite",
                " different from the Reality.",
                "Now let us",
                " consider the question: when and where did",
                " this event take place? The Qur'an says",
                " nothing about this. There is a tradition",
                " related by 'Aufi in which he cites",
                " a saying of Ibn 'Abbas to this",
                " effect: \"This event happened after the destruction",
                " of Pharaoh when Prophet Moses had settled",
                " his people in Egypt\". But this is",
                " not supported by other more authentic traditions",
                " from Ibn 'Abbas which Dave been cited",
                " in the collection of Bukhari and other",
                " books of Traditions, nor is there any",
                " other source which may prove that Prophet",
                " Moses ever settled in Egypt after the",
                " destruction of Pharaoh. On the contrary, the",
                " Qur'an says explicitly that Prophet Moses passed",
                " the whole of his life after Exodus",
                " from Egypt in the desert (Sinai and",
                " At-Tilt). Therefore the tradition from 'Aufi cannot",
                " be accepted. However, if we consider the",
                " details of this story, two things are",
                " quite obvious: (1) These things would have",
                " been demonstrated to Prophet Moses in the",
                " earlier period of his Prophethood because such",
                " things are needed in the beginning of",
                " Prophethood for the teaching and training of",
                " the Prophets. (2) As this story has",
                " been cited to comfort the Believers of",
                " Makkah, it can be reasonably concluded that",
                " these demonstrations would have been shown to",
                " Prophet Moses, when the Israelites were encountering",
                " the same conditions as the Muslims of",
                " Makkah did at the time of the",
                " revelation of this Surah. On the basis",
                " of these two things, we are of",
                " the opinion (and correct Knowledge is with",
                " Allah alone) that this event relates to",
                " the period, when the persecution of the",
                " Israelites by Pharaoh was at its height",
                " and, like the chiefs of the Quraish,",
                " Pharaoh and his courtiers were deluded by",
                " delay in the scourge that there was",
                " no power above them to take them",
                " to task, and like the persecuted Muslims",
                " of Makkah, the persecuted Muslims of Egypt",
                " were crying in their agony, as if",
                " to say, \"Our Lord! how long will",
                " the prosperity of these tyrants and our",
                " adversity continue ?\" So much so that",
                " Prophet Moses himself cried out: \".... Our",
                " Lord, Thou hast bestowed on Pharaoh and",
                " his nobles splendour and possessions in the",
                " worldly life; O our Lord, hast Thou",
                " done this drat they might lead astray",
                " the people from Thy Way?...\" (X: 88)",
                "",
                "If our conjecture is correct, then it",
                " may be concluded that probably this event",
                " took place during Prophet Moses' journey to",
                " Sudan, and by the confluence of the",
                " rivers is meant the site of the",
                " present city of Khartum where the Blue",
                " Nile and the White Nile meet together.",
                "",
                "The Bible does not say anything about",
                " this event but the Talmud does relate",
                " this though it assigns it to Rabbi",
                " Jochanan, the son of Levi, instead of",
                " to Prophet Moses, and according to it",
                " the other person was Elijah who had",
                " been taken up alive to heaven and",
                " joined with the angels for the purpose",
                " of the administration of the world. (The",
                " Talmud Selections by H. Polano, pp. 313-16).",
                "",
                "It is just possible that like the",
                " events, which happened before the Exodus. this",
                " event also might not have remained intact",
                " but during the passage of centuries changes",
                " and alterations might have been made in",
                " it. But it is a pity that",
                " some Muslims have beenso influenced by the",
                " Talmud that they opine that in this",
                " story Moses does not refer to Prophet",
                " Moses but to some other person bearing",
                " the same name. They forget that every",
                " tradition of the Talmud is not necessarily",
                " correct, nor have we any reason to",
                " suppose that the Qur'an has related the",
                " story concerning some unknown person bearing the",
                " name \"Moses\". Above all, when we learn",
                " from an authentic Tradition related by Ubayy-bin-Ka`ab",
                " that the Holy Prophet himself made it",
                " clear that in this story, by Moses",
                " is meant Prophet Moses, there is absolutely",
                " no reason why any Muslim should consider",
                " any statement of the Talmud at all.",
                "",
                "The Orientalists have, as usual, tried to",
                " make a \"research\" into the \"sources\" of",
                " this story and have pointed out that",
                " \"The Kuranic story may be traced back",
                " to three main sources:'(1) The Gilgamesh Epic,",
                " (2) The Alexander Romance and (3) The",
                " Jewish Legend of Elijah and Rabbi Joshua",
                " hen Levi (Encyclopaedia of Islam new edition",
                " and Shorter Erlcyclopaedia of !slam under the",
                " heading AIKhadir). This is because these malicious",
                " \"scholars\" decide beforehand that their \"scientific research\"",
                " must lead to the conclusion that the",
                " Qur'an is not a revealed book: therefore",
                " they have, anyhow or other, to produce",
                " a proof that whatever Muhammad (Allah's peace",
                " be upon him) has presented as Revelation,",
                " has been plagiarized from such and such",
                " \"sources\". In this these people brazenfacedly use",
                " \"facts\" and \"quotations\" so cunningly and cleverly",
                " as to achieve their mean end and",
                " one begins to have nausea at their",
                " \"research\". If that is research what these",
                " bigoted forgers make, then one is compelled",
                " to curse their \"knowledge and research\" .",
                "",
                "We ask them to answer our questions",
                " in order to expose their \"research\":",
                "(I)",
                " What proof have you got to make",
                " the claim that the Qur'an has based",
                " a certain statement on the contents of",
                " a couple of ancient books ? Obviously",
                " it will not be \"research\" to build",
                " this claim on the scant basis that",
                " a certain statement trade in the Quran",
                " is similar to the one found in",
                " these books.",
                "(2) Do you possess any",
                " knowledge that at the time of the",
                " revelation of the Qur'an there was a",
                " library at Makkah from which the Holy",
                " Prophet collected material for the Qur'an? This",
                " question is pertinent because if a list",
                " were to be trade of the numerous",
                " books in different languages, which you allege",
                " were sources of the stories and statements",
                " contained in the Qur'an, it will become",
                " long enough for a big library. Have",
                " you got any proof that Muhammad (Allah's",
                " peace be upon him) had arranged for",
                " such translators as translated into Arabic those",
                " books from different languages for his use?",
                " If it is not so and your",
                " allegation is based on a couple of",
                " journeys which the Holy Prophet made outside",
                " Arabia, a question arises: How many books",
                " did the Holy Prophet copy or commit",
                " to memory during these trade journeys before",
                " his Prophethood? And how is it that",
                " even a day before he claimed to",
                " be a Prophet, no sign at all",
                " was displayed in. his conversation that he",
                " had gathered such information as was revealed",
                " in the Qur'an afterwards?",
                "(3) How is",
                " it then that the contemporary disbelievers of",
                " Makkah and the Jews and the Christians,",
                " who like you, were always in search",
                " of such a proof, could not put",
                " forward even a single instance of plagiarism?",
                " They had a goad reason to produce",
                " an instance of this because they were",
                " being challenged over and over again to",
                " refute the claim that the Qur'an was",
                " a revealed book and it had no",
                " other source than Divine Knowledge and that",
                " if they said that it was a",
                " human work, they were to prove this",
                " by bringing the like of it. Though",
                " this challenge had broken the back of",
                " the contemporary opponents of Islam, they could",
                " not point out even a single plausible",
                " source that might prove reasonably that the",
                " Qur'an was based on it. In the",
                " light of these facts one may ask,",
                " \"Why had the contemporaries of the Holy",
                " Prophet failed in their research and how",
                " have the opponents of Islam succeeded in",
                " their attempt today after the passage of",
                " more than a thousand years?\"",
                "(4) The",
                " last and the most important question is:",
                " Does it not show that it is",
                " bigotry and malice that has misled the",
                " opponents of Islam to discard the possibility",
                " that the Qur'an may be a revealed",
                " book of Allah and to concentrate all",
                " their efforts to prove that it is",
                " not so at all ? The tact",
                " that its stories are similar to those",
                " contained in the former books, could be",
                " considered equally in this light that the",
                " Qur'an was a revealed book and was",
                " relating them in order to correct those",
                " errors that had crept into them during",
                " the passage of time. Why should their",
                " research be confined to prove that those",
                " books are the real source of the",
                " stories of the Qur'an and not to",
                " consider the other possibility that the Qur'an",
                " itself was a revealed bOOk?",
                "An impartial",
                " person who will consider these questions will",
                " inevitably arrive at the conclusion that the",
                " \"research\" which the orientalists have presented in",
                " the name of \"knowledge\" is not worth",
                " any serious consideration."
            ]
        },
        {
            "verse-id": "[18:61]",
            "verse": "But when they reached the junction between them, they forgot their fish, and it took its course into the sea, slipping away.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:62]",
            "verse": "So when they had passed beyond it, [Moses] said to his boy, \"Bring us our morning meal. We have certainly suffered in this, our journey, [much] fatigue.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:63]",
            "verse": "He said, \"Did you see when we retired to the rock? Indeed, I forgot [there] the fish. And none made me forget it except Satan - that I should mention it. And it took its course into the sea amazingly\".",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:64]",
            "verse": "[Moses] said, \"That is what we were seeking.\" So they returned, following their footprints.",
            "description": [
                "That is, \"The same was the sign",
                " of the place of our destination\". This",
                " shows that Prophet Moses had taken this",
                " journey at Allah's behest to meet His",
                " Servant. He had been told that he",
                " would meet the Servant at the place",
                " where the fish would disappear."
            ]
        },
        {
            "verse-id": "[18:65]",
            "verse": "And they found a servant from among Our servants to whom we had given mercy from us and had taught him from Us a [certain] knowledge.",
            "description": [
                "The name of this Servant has been",
                " stated to be \"Khidr\" in all the",
                " authentic books of traditions. Thus there is",
                " no reason why it should be considered",
                " at all that his name was Elijah,",
                " as some people have asserted under the",
                " influence of the Israelite traditions. Their assertion",
                " is incorrect not only because it contradicts",
                " the assertion of the Holy Prophet but",
                " it is also absurd because Prophet Elijah",
                " was born several hundred years after Prophet",
                " Moses. Though the Qur'an does not mention",
                " the name of the attendant of Prophet",
                " Moses, according to some traditions he was",
                " Joshua, the son of Nun, who succeeded",
                " him."
            ]
        },
        {
            "verse-id": "[18:66]",
            "verse": "Moses said to him, \"May I follow you on [the condition] that you teach me from what you have been taught of sound judgement?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:67]",
            "verse": "He said, \"Indeed, with me you will never be able to have patience.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:68]",
            "verse": "And how can you have patience for what you do not encompass in knowledge?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:69]",
            "verse": "[Moses] said, \"You will find me, if Allah wills, patient, and I will not disobey you in [any] order.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:70]",
            "verse": "He said, \"Then if you follow me, do not ask me about anything until I make to you about it mention.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:71]",
            "verse": "So they set out, until when they had embarked on the ship, al-Khidh r tore it open. [Moses] said, \"Have you torn it open to drown its people? You have certainly done a grave thing.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:72]",
            "verse": "[Al-Khidh r] said, \"Did I not say that with me you would never be able to have patience?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:73]",
            "verse": "[Moses] said, \"Do not blame me for what I forgot and do not cover me in my matter with difficulty.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:74]",
            "verse": "So they set out, until when they met a boy, al-Khidh r killed him. [Moses] said, \"Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:75]",
            "verse": "[Al-Khidh r] said, \"Did I not tell you that with me you would never be able to have patience?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:76]",
            "verse": "[Moses] said, \"If I should ask you about anything after this, then do not keep me as a companion. You have obtained from me an excuse.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:77]",
            "verse": "So they set out, until when they came to the people of a town, they asked its people for food, but they refused to offer them hospitality. And they found therein a wall about to collapse, so al-Khidh r restored it. [Moses] said, \"If you wished, you could have taken for it a payment.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:78]",
            "verse": "[Al-Khidh r] said, \"This is parting between me and you. I will inform you of the interpretation of that about which you could not have patience.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:79]",
            "verse": "As for the ship, it belonged to poor people working at sea. So I intended to cause defect in it as there was after them a king who seized every [good] ship by force.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:80]",
            "verse": "And as for the boy, his parents were believers, and we feared that he would overburden them by transgression and disbelief.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:81]",
            "verse": "So we intended that their Lord should substitute for them one better than him in purity and nearer to mercy.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:82]",
            "verse": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience.\"",
            "description": [
                "In connection with this story, a very",
                " hard problem arises to which an answer",
                " must be found: Two of the three",
                " things done by Hadrat Khidr are obviously",
                " against those commandments of the Law which",
                " have always been in force since the",
                " creation of man. No law allows anyone",
                " the right to damage the property of",
                " another and kill an innocent person. So",
                " much so that if a man were",
                " to know by inspiration that some usurper",
                " would illegally seize a certain boat, and",
                " that a certain boy would be involved",
                " in a rebellion and unbelief, even then",
                " no law, sent down by Allah, makes",
                " it lawful that one should bore a",
                " hole in the boat and kill the",
                " innocent boy by virtue of one's inspiration.",
                " If in answer to this, one were",
                " to say that Hadrat Khidr committed these",
                " two acts by the Commands of Allah,",
                " this does not solve the problem, for",
                " the question is not this, \"By whose",
                " command did Hadrat Khidr commit these acts\"?",
                " but it is this: \"What was the",
                " nature of these commands\"? This is important",
                " because Hadrat Khidr did these acts in",
                " accordance with Divine Command, for he himself",
                " says that these acts of his were",
                " not done by his own authority, but",
                " were moved by the mercy of Allah,",
                " and Allah Himself has testified this by",
                " saying: \"We gave him a special knowledge",
                " from Ourselves\". Thus it is beyond any",
                " doubt that these acts were done by",
                " the Command of Allah, but the question",
                " about the nature of the command remains",
                " there, for it is obvious that these",
                " commands were not legal because it is",
                " not allowed by any Divine Law, and",
                " the fundamental principles of the Qur'an also",
                " do not allow that a person should",
                " kill another person without any proof of",
                " his guilt. Therefore we shall have to",
                " admit that these commands belonged to one",
                " of those decrees of Allah in accordance",
                " with which one sick person recovers, while",
                " another dies: one becomes prosperous and the",
                " other is ruined. If the Commands given",
                " to Hadrat Khidr were of this nature,",
                " then one must come to the conclusion",
                " that Hadrat Khidr was an angel (or",
                " some other kind of Allah's creation) who",
                " is not bound by the Divine Law",
                " prescribed for human beings, for such commands",
                " as have no legal aspect, can be",
                " addressed to angels only. This is because",
                " the question of the lawful or the",
                " unlawful cannot arise about them: they obey",
                " the Commands of Allah without having any",
                " personal power. In contrast to them, a",
                " man shall be guilty of a sin",
                " whether he does any such thing inadvertently",
                " by intuition or by some inspiration, if",
                " his act goes against some Divine Commandment.",
                " This is because a man is bound",
                " to abide by Divine Commandments as a",
                " tnan, and there is no room whatsoever",
                " in the Divine Law that an act",
                " may become lawful for a man merely",
                " because he had received an instruction by",
                " inspiration and had been informed in a",
                " secret way of the wisdom of that",
                " unlawful act.",
                "The above-mentioned principle has been",
                " unanimously accepted by scholars of the Divine",
                " Law and the leaders of Sufism. `Allamah",
                " Alusi has cited in detail the sayings",
                " of 'Abdul Wahhab Shi`irani, Muhy-ud-Din ibn-`Arabi, Mujaddid",
                " Alf Thani, Shaikh 'Abdul-Qadir Jilani, Junaid Baghdadi,",
                " Sirri Saqti, Abul-Hussain An-nuri, Abu Said-al-Kharraz, Ahmad",
                " ud-Dainauri and Imam Ghazzali to this effect",
                " that it is not lawful even for",
                " a sufi to act in accordance with",
                " that inspiration of his own which goes",
                " against a fundamental of law. (Ruh-ul-Ma ani,",
                " Vol. XVI, pp. 16-18). That is why",
                " we have come to the conclusion that",
                " Hadrat Khidr must be an angel, or",
                " some other kind of Allah's creation, exempted",
                " from human law, for he could not",
                " be the only exception to the above-mentioned",
                " formula. Therefore we inevitably come to the",
                " conclusion that he was one of those",
                " Servants of Allah who act in accordance",
                " with the will of Allah and not",
                " in accordance with the Divine Law prescribed",
                " for human beings.",
                "We would have accepted",
                " the theory that Hadrat Khidr was a",
                " human being, if the Qur'an had plainly",
                " asserted that the \"servant\" to whom Prophet",
                " moscs was sent for training, was a",
                " tnan, but the Qur'an does not specifically",
                " say that he was a human being",
                " but says that he was \"one of",
                " Our Servants\", which does not show that",
                " he was necessarily a human being. Besides",
                " this, there is no Tradition which specifically",
                " says that Hadrat Khidr was a human",
                " being. In the authentic traditions related by",
                " Said bin Jubair, Ibn `Abbas, Ubayy bin",
                " Ka`ab from the Holy Prophet, the Arabic",
                " word, ,}i~ (rajul) has been used for",
                " Hadrat Khidr, which though generally used for",
                " human beings, is not exclusively used for",
                " human beings. In the Holy Qur'an itself,",
                " this word has been used for Jinns",
                " also (LXXIII 6). It is also obvious",
                " that when a jinn or an angel",
                " or an invisible being will come before",
                " a human being, he will surely come",
                " in human shape and, in that form;",
                " he will be called a bashar (man),",
                " just like the angel who came before",
                " Mary in the shape of a human",
                " being (XIX: 17). Thus the word rajul,",
                " used for Hadrat Khidr in the abovementioned",
                " Tradition by the Holy Prophet, does not",
                " necessarily mean that he was a human",
                " being. Therefore we are quite justified in",
                " the light of the above discussion to",
                " believe that Hadrat Khidr was one of",
                " the angels or some other kind of",
                " Allah's creation who is not bound by",
                " the Divine Law prescribed for human beings.",
                " Some of the former scholars of the",
                " Qur'an have also expressed the same opinion",
                " which . has been cited by lbn",
                " Kathir in his Commentary on the authority",
                " of Mawardi."
            ]
        },
        {
            "verse-id": "[18:83]",
            "verse": "And they ask you, [O Muhammad], about Dhul-Qarnayn. Say, \"I will recite to you about him a report.\"",
            "description": [
                "It is quite obvious that the conjunction",
                " \"wao \" joins this story with the",
                " previous story of Khidr. Thus it is",
                " a self-evident proof that the previous two",
                " stories of the \"Sleepers of the Cave\"",
                " and \"Moses and Khidr\" were also related",
                " in answer to the queries of the",
                " disbelievers of Makkah who, in consultation with",
                " the people of the Book, had put",
                " these questions to Muammad (Allah's peace be",
                " upon him) as a test of his",
                " Prophethood.",
                "*62) The identification of Zul-Qarnain has",
                " been a controversial matter from the earliest",
                " times. in general the commentators have been",
                " of the opinion that he was Alexander",
                " the Great but the characteristics of Zul-Qarnain",
                " described in the Qur'an are not applicable",
                " to him. However, now the commentators are",
                " inclined to believe that Zul-Qarnain was Cyrus,",
                " an ancient king of Iran. We are",
                " also of the opinion that probably Zul-Qarnain",
                " was Cyrus, but the historical facts, which",
                " have come to light up to this",
                " time, are not sufficient to make any",
                " categorical assertion.",
                "Now let us consider the",
                " characteristics of Zul-Qarnain in the light of",
                " his story as given in the Quran:",
                "",
                "(1) The title Zul-Qarnain (\"The Two-Hotned\") should",
                " have been quite familiar to the Jews,",
                " for it was at their instigation that",
                " the disbelievers of Makkah put this question",
                " to the Holy Prophet. Therefore we must",
                " turn to the Jewish literature in order",
                " to learn who was the person known",
                " as \"The Two-Horned\" or which was the",
                " kingdom known as \"The Two-Horned.\"",
                "(2) Zul-Qarnain",
                " must have been a great ruler and",
                " a great conqueror whose conquests might have",
                " spread from the East to the West",
                " and on the third side to the",
                " North or to the South. Before the",
                " revelation of the Qur'an there had been",
                " several persons, who were such great conquerors.",
                " So we must confine our research for",
                " the other characteristics of Zul-Qarnain to one",
                " of these persons. '",
                "(3) This title",
                " should be applicable to such a ruler",
                " who might have constructed a strong wall",
                " across a mountain pass to protect his",
                " kingdom from the incursions of Gog and",
                " Magog. In order to investigate this thing,",
                " we will have to determine as to",
                " who were Gog and Magog. We will",
                " also have to find out when such",
                " a wall was built and by whom",
                " and to which territory it was adjacent.",
                "",
                "(4) Besides possessing the above-mentioned characteristics, he",
                " should also be a God-worshipper and a",
                " just ruler, for the Qur'an has brought",
                " into prominence these characteristics more than anything",
                " else.",
                "The first of these characteristics is",
                " easily applicable to Cyrus, for according to",
                " the Bible Prophet Daniel saw in his",
                " vision that the united kingdom of Media",
                " and Persia was like a two-horned ram",
                " before the rise of the Greeks. (Dan.",
                " 8: 3,\"20). The Jews had a very",
                " high opinion of \"The Two-horned\" one, because",
                " it was his invasion which brought about",
                " the downfall of the kingdom of Babylon",
                " and the liberation of the Israelites (Please",
                " also refer to E.N. 8 of Chapter",
                " XVII).",
                "The second characteristic is applicable to",
                " him to a great extent but not",
                " completely. Though his conquests spread to Syria",
                " and Asia Minor in the West and",
                " to Bakhtar (Balkh) in the East, there",
                " is no trace of any of his",
                " great expeditions to the North or to",
                " the South, whereas the Qur'an makes an",
                " explicit mention of his third expedition. Nevertheless,",
                " this third expedition is not wholly out",
                " of question for history tells us that",
                " his kingdom extended to Caucasia in the",
                " North. As regards Gog and Magog, it",
                " has been nearly established that they were",
                " the wild tribes of Central Asia who",
                " were known by different names: Tartars, Mongols,",
                " Huns and Scythians, who 'had been making",
                " inroads on settled kingdoms and empires from",
                " very ancient times. It is also known",
                " that strong bulwarks had been built in",
                " southern regions of Caucasia, though it has",
                " not been as yet historically established that",
                " these were built by Cyrus.",
                "As regards",
                " the last characteristic, Cyrus is the only",
                " known conqueror among the ancient rulers, to",
                " whom this may be applicable, for even",
                " his enemies have been full of praise",
                " for him for his justice, and, Ezra,",
                " a book of the Bible, asserts that",
                " he was a God-worshipper and a God-fearing",
                " king who set free the Israelites because",
                " of his God-worship, and ordered that the",
                " Temple of Solomon should be rebuilt for",
                " the worship of Allah, Who has no",
                " partner.",
                "In the light of the above,",
                " we admit that of all the conquerors,",
                " who had passed away before the revelation",
                " of the Qur'an, Cyrus alone is the",
                " one to whom the characteristics of \"Zul-Qarnain\"",
                " are most applicable, but we need more",
                " evidence to determine specifically that Cyrus is",
                " definitely \"Zul-Qarnain.\" Anyhow, there is no other",
                " conqueror to whom the characteristics stated in",
                " the Qur'an are as much applicable as",
                " to Cyrus.",
                "Historically it is enough to",
                " say that Cyrus was a Persian ruler,",
                " whose rise began about 549 B.C. In",
                " a few years, he conquered the kingdom",
                " of Media and Lydia and afterwards conquered",
                " Babylon in 539 B.C. After this no",
                " powerful kingdom was left to oppose him.",
                " His conquests extended to Sind and the",
                " territory known as Turkistan on one side,",
                " and to Egypt and Libya and to",
                " Thrace and Macedonia and to Caucasia and",
                " Khawarzam in the North. In fact, the",
                " whole civilized world was under his sway.",
                ""
            ]
        },
        {
            "verse-id": "[18:84]",
            "verse": "Indeed We established him upon the earth, and We gave him to everything a way.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:85]",
            "verse": "So he followed a way",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:86]",
            "verse": "Until, when he reached the setting of the sun, he found it [as if] setting in a spring of dark mud, and he found near it a people. Allah said, \"O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness.\"",
            "description": [
                "\"The limit where the sun set\" does",
                " not mean the \"place\" of the setting",
                " of the sun. According to Ibn Kathir,",
                " it means that he marched to the",
                " West conquering one country after the other",
                " till he reached the last boundary of",
                " the land, beyond which there was ocean.",
                "",
                "*64) \"He found the sun setting in",
                " black muddy waters of the sea\": if",
                " ZulQarnain was Cyrus, then that place would",
                " be the western limit of Asia Minor",
                " and the \"black waters\" would be the",
                " Aegean Sea. This interpretation is supported by",
                " the use of the word \"`ain\"instead of",
                " \"bahr\" in the Qur'an.",
                "<*65) \"We said",
                " to him\" does not necessarily mean that",
                " Allah directly revealed to him these words,",
                " and that Z, ul-Qarnain was a Prophet",
                " or was the one who received inspiration",
                " from Allah, and the same is the",
                " reasonable conjecture. This concerns the time when",
                " Zul-Qarnain had taken possession of the land",
                " as a conqueror and the conquered people",
                " were utterly at your mercy. Then Allah",
                " posed a question before his conscience, as",
                " if to say, \"Now is the time",
                " of your trial. These people are utterly",
                " at your mercy, and you have the",
                " option either to behave unjustly towards them",
                " or to treat them generously.\""
            ]
        },
        {
            "verse-id": "[18:87]",
            "verse": "He said, \"As for one who wrongs, we will punish him. Then he will be returned to his Lord, and He will punish him with a terrible punishment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:88]",
            "verse": "But as for one who believes and does righteousness, he will have a reward of Paradise, and we will speak to him from our command with ease.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:89]",
            "verse": "Then he followed a way",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:90]",
            "verse": "Until, when he came to the rising of the sun, he found it rising on a people for whom We had not made against it any shield.",
            "description": [
                "That is, \"When he advanced towards the",
                " East, conquering one country after the other,",
                " he reached a territory where the limits",
                " of the civilized world had come to",
                " an end and beyond which was the",
                " territory of barbaric people, who had no",
                " shelter at all of tents or buildings.\"",
                ""
            ]
        },
        {
            "verse-id": "[18:91]",
            "verse": "Thus. And We had encompassed [all] that he had in knowledge.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:92]",
            "verse": "Then he followed a way",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:93]",
            "verse": "Until, when he reached [a pass] between two mountains, he found beside them a people who could hardly understand [his] speech.",
            "description": [
                "The \"two mountains\" must have been parts",
                " of that mountain range which runs between",
                " the Caspian Sea and the Black Sea",
                " (as stated in v. 96). This must",
                " be so because beyond them was the",
                " territory of Gog and Magog.",
                "*68) That",
                " is, \"It was difficult to communicate with",
                " them: their language was almost foreign to",
                " Zul-Qarnain and his companions, and, as they",
                " were quite barbaric, none could understand their",
                " language, nor were they acquainted with any",
                " foreign language.\""
            ]
        },
        {
            "verse-id": "[18:94]",
            "verse": "They said, \"O Dhul-Qarnayn, indeed Gog and Magog are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?\"",
            "description": [
                "As has already been pointed out in",
                " E.N. 62, Gog and Magog were the",
                " wild tribes of North Eastern Asia which,",
                " from the very early times had been",
                " making inroads on settled kingdoms and empires",
                " in Asia and Europe and ravaging them.",
                " According to Genesis (Chapter 10), they were",
                " the descendants of Japheth, the sort of",
                " Noah, and the Muslim historians have also",
                " accepted this. And according to the book",
                " of Ezekiel (Chapters 38, 39), they inhabited",
                " the territories of Meshech (Moscow) and Tubal",
                " (Tubalsek). According to the Israelite historian Josephus,",
                " they were the Scythians and their territory",
                " spread to the north and the east",
                " of the Black Sea. According to Jerome,",
                " Magog inhabited the territory to the north",
                " of Caucasia near the Caspian Sea."
            ]
        },
        {
            "verse-id": "[18:95]",
            "verse": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength; I will make between you and them a dam.",
            "description": [
                "That is, \"As a ruler it is",
                " my duty to protect you from the",
                " ravages of your enemies: therefore it is",
                " not lawful for me to levy any",
                " extra taxes on you for this purpose.",
                " The treasury that Allah has placed in",
                " my custody, suffices for this purpose. You",
                " shall, however, have to help me with",
                " your manual labour.\""
            ]
        },
        {
            "verse-id": "[18:96]",
            "verse": "Bring me sheets of iron\" - until, when he had leveled [them] between the two mountain walls, he said, \"Blow [with bellows],\" until when he had made it [like] fire, he said, \"Bring me, that I may pour over it molten copper.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:97]",
            "verse": "So Gog and Magog were unable to pass over it, nor were they able [to effect] in it any penetration.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:98]",
            "verse": "[Dhul-Qarnayn] said, \"This is a mercy from my Lord; but when the promise of my Lord comes, He will make it level, and ever is the promise of my Lord true.\"",
            "description": [
                "That is, \"Though I have built a",
                " very strong iron-wall, as far as it",
                " was possible for me, it is not",
                " ever-lasting, for it will last only as",
                " long as Allah wills, and will fall",
                " down to pieces when the time of",
                " my Lord's promise shall come. Then no",
                " power in the world shall be able",
                " to keep it safe and secure.\"",
                "As",
                " regards the time of Allah's promise, it",
                " has two meanings: (1) It may mean",
                " the time of the destruction of the",
                " wall, and (2) it may also mean",
                " the time of the death and destruction",
                " of everything destined by Allah at the",
                " end of the world i.e., the Hour",
                " of Resurrection.",
                "Some people have entertained the",
                " misunderstanding that the wall attributed here to",
                " Zul-Qarnain refers to the famous Wall of",
                " China, whereas this wall was built between",
                " Derbent and Dar'yal, two cities of Daghestan",
                " in the Caucasus, the land that lies",
                " between the Black Sea and the Caspian.",
                " There are high mountains between the Black",
                " Sea and Dar'yal having deep gorges which",
                " cannot allow large armies to pass through",
                " them. Between Derbent and Dar'yal, however, there",
                " are no such mountains and the passes",
                " also are wide and passable. In ancient",
                " times savage hordes from the north invaded",
                " and ravaged southern lands through these passes",
                " and the Persian rulers who were scared",
                " of them had to build a strong",
                " wall, 50 miles long, 29 feet high",
                " and 10 feet wide, for fortification purposes,",
                " ruins of which can still be seen.",
                " Though it has not yet been established",
                " historically who built this wall in the",
                " beginning, the Muslim historians and geographers assign",
                " it to ZulQarnain because its remains correspond",
                " with the description of it given in",
                " the Qur'an. Ibn Jarir Tabari and Ibn",
                " Kathir have recorded the event, and Yaqut",
                " has mentioned it in his Mu jam-ul-Buldan",
                " that when after the conquest of Azerbaijan,",
                " Hadrat `Umar sent Suraqah bin `Amr, in",
                " 22 A.H. on an expedition to Derbent,",
                " the latter appointed `Abdur Rehman bin Rabi`ah",
                " as the chief of his vanguard. When",
                " 'Abdur Rehman entered Armenia, the ruler Shehrbraz",
                " surrendered without fighting. Then when `Abdur Rehman",
                " wanted to advance towards Derbent, Shehrbraz informed",
                " him that he had already gathered full",
                " information about the wall built by Zul-Qarnain,",
                " through a man, who could supply all",
                " the necessary details and then the man",
                " was actually presented before `Abdur Rehman. (Tabari,",
                " Vol. III, pp. 235-239; AI-Bidayah wan-Nihayah, Vol.",
                " VII, pp. 122-125, and Mu jam-ul-Buldan, under",
                " Bab-ul-Abwab: Derbent).",
                "Two hundred years later, the",
                " Abbasid Caliph Wathiq (227-233 A.H.) despatched a",
                " party of 50 men under Sallam-ul-Tarjuman to",
                " study the wall of ZulQarnain, whose observations",
                " have been recorded in great detail by",
                " Yaqut in Mu jam-ul-Buldan and by Ibn",
                " Kathir in AI-Bidayah. They write that this",
                " expedition reached Samarrah from where they reached",
                " Tiflis (the present Tbilisi) and then through",
                " As-Sarir and Al-Lan, they reached Filanshah, from",
                " where they entered the Caspian territory. From",
                " there they arrived at Derbent and saw",
                " the wall. (AIBidayah Vol. II, p. 111,",
                " Vol. VII, pp. 122-125; Mu jam-ul-Buldan: under",
                " Bab-ulAbwab). This clearly shows that even up",
                " till the third century of Hijrah the",
                " Muslim scholars regarded this wall of the",
                " Caucasus as the wall of Zul-Qarnain.",
                "Yaqut",
                " in his Mu jam-ul-Buldan has further confirmed",
                " the same view at a number of",
                " places. For instance, under Khazar (Caspian) he",
                " writes:",
                "\"This territory belongs to the Turks,",
                " which adjoins the Wall of ZulQarnain just",
                " behind Bab-ul-Abwab, which is also called Derbent.\"",
                " In the same connection, he records a",
                " report by Ahmad bin Fadlan, the ambassador",
                " of Caliph Al-Muqtadar-billah, who has given a",
                " full description of the Caspian land, saying",
                " that Caspian is the name of a",
                " country whose capital is Itil (near the",
                " present Astrakhan) right through which flows River",
                " Itil, which joins the Caspian front Russia",
                " and Bulghar.",
                "Regarding Bab-ul-Abwab he says that",
                " this city is called both Al-Bab and",
                " Derbent, which is a highly difficult passage",
                " for the people coming from the northern",
                " lands towards the south. Once this territory",
                " was a part of the kingdom of",
                " Nausherwan, and the Persian rulers paid particular",
                " attention to strengthening their frontiers on that",
                " side.",
                "*72) Here the story of Zul-Qarnain",
                " comes to an end. Though this story",
                " has been related in answer to the",
                " questions put by the disbelievers of Makkah",
                " as a test along with the stories",
                " of the \"Sleepers of the Cave\" and",
                " \"Moses and Khidr\", the Qur'an has utilized",
                " this story, too, for its own aim",
                " and object, as if to say, \"ZulQarnain,",
                " about whose glory you have heard from",
                " the people of the Book, was not",
                " merely a conqueror, but also a believer",
                " of the doctrines of Tauhid and the",
                " lifeafter-death and acted upon the principles of",
                " justice and generosity. He was not a",
                " mean person like you who have been",
                " puffed up by the possession of petty",
                " estates, and give yourselves airs of superiority.\"",
                ""
            ]
        },
        {
            "verse-id": "[18:99]",
            "verse": "And We will leave them that day surging over each other, and [then] the Horn will be blown, and We will assemble them in [one] assembly.",
            "description": [
                "\"On that Day\": \"The Day of Resurrection\".",
                " As if to continue the theme of",
                " life-after-death to which Zul-Qarnain referred as the",
                " \"time of my Lord's promise\", the Qur'an",
                " has added verses 99-101 to it."
            ]
        },
        {
            "verse-id": "[18:100]",
            "verse": "And We will present Hell that Day to the Disbelievers, on display -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:101]",
            "verse": "Those whose eyes had been within a cover [removed] from My remembrance, and they were not able to hear.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:102]",
            "verse": "Then do those who disbelieve think that they can take My servants instead of Me as allies? Indeed, We have prepared Hell for the disbelievers as a lodging.",
            "description": [
                "This is the conclusion of the whole",
                " Surah and is not connected with the",
                " story of Zul-Qarnain only but with the",
                " subject-matter of this Surah as a whole.",
                " That theme was enunciated at the beginning",
                " of the Surah (1-8): The Holy Prophet",
                " invited his people (1) to give up",
                " shirk and adopt the doctrine of Tauhid",
                " instead, (2) to give up the worship",
                " of the world and to believe in",
                " the life of the Hereafter. But the",
                " chiefs of his people, who were puffed",
                " up with their wealth and grandeur, not",
                " only rejected his invitation but also persecuted",
                " and insulted those righteous people who had",
                " accepted his invitation. The discourse deals with",
                " the Same themes and utilizes in an",
                " excellent manner the. three stories which were",
                " related in answer to the questions put",
                " by the opponents of Islam as a",
                " test of his Prophethood.",
                "*75) That is,",
                " \"Do they still stick to their presumption",
                " even after hearing all this, and believe",
                " that their attitude will be profitable for",
                " them?\""
            ]
        },
        {
            "verse-id": "[18:103]",
            "verse": "Say, [O Muhammad], \"Shall we [believers] inform you of the greatest losers as to [their] deeds?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:104]",
            "verse": "[They are] those whose effort is lost in worldly life, while they think that they are doing well in work.\"",
            "description": [
                "This verse has two meanings. The one",
                " is the same that we have adopted",
                " in the translation. The other meaning is",
                " this: \"...those who confined all their endeavours",
                " to the worldly life\". That is, whatever",
                " they did, they did for this world",
                " without paying any regard to God and",
                " the Hereafter. As they considered the worldly",
                " life to be the real life, they",
                " made the success and prosperity in this",
                " world their sole aim and object. Even",
                " if they professed the existence of Allah,",
                " they never paid any heed to the",
                " two implications of this profession: to lead",
                " their lives in a way to please",
                " Allah and to come out successful on",
                " the Day they shall have to render",
                " an account of what they did in",
                " this world. This was because they considered",
                " themselves to be mere rational animals who",
                " were absolutely independent and free from every",
                " kind of responsibility and had nothing else",
                " to do but to enjoy the good",
                " things of the world like animals in",
                " a meadow."
            ]
        },
        {
            "verse-id": "[18:105]",
            "verse": "Those are the ones who disbelieve in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any importance.",
            "description": [
                "\"All their deeds were lost\" in the",
                " sense that they will be of no",
                " avail to them in the life-after-death, even",
                " though they might have considered them as",
                " their great achievements but the fact is",
                " that they will lose all their value",
                " as soon as the world shall come",
                " to an end. When they will go",
                " before their Lord, and all their deeds",
                " shall be placed in the Scales, they",
                " will have no weight at all whether",
                " they had built great palaces, established great",
                " universities and libraries, set up great factories",
                " and laboratories, constructed highways and railways, in",
                " short, all their inventions, industries, sciences and",
                " arts and other things of which they",
                " were very proud in this world, will",
                " lose their weights in the Scales. The",
                " only thing which will have weight there",
                " will be that which had been done",
                " in accordance with the Divine instructions and",
                " with the intention to please AIIah. It",
                " is, therefore, obvious that if all of",
                " one's endeavours were confined to the worldly",
                " things and the achievement of worldly desires",
                " whose results one would see in this",
                " world, one should not reasonably expect to",
                " see their results in the Hereafter, for",
                " they would have gone waste with the",
                " end of this world. It is equally",
                " obvious, that only the deeds of the",
                " one, who performed them strictly in accordance",
                " with His instructions to win His approval",
                " with a view to avail of their",
                " results in the Hereafter, will find that",
                " his deeds had weight in the Scales.",
                " On the contrary, such a one will",
                " find that all his endeavours in the",
                " world had gone waste."
            ]
        },
        {
            "verse-id": "[18:106]",
            "verse": "That is their recompense - Hell - for what they denied and [because] they took My signs and My messengers in ridicule.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:107]",
            "verse": "Indeed, those who have believed and done righteous deeds - they will have the Gardens of Paradise as a lodging,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[18:108]",
            "verse": "Wherein they abide eternally. They will not desire from it any transfer.",
            "description": [
                "\"...they will never desire to go anywhere",
                " (else),\" because they will find no place",
                " and no condition better than those in",
                " Paradise."
            ]
        },
        {
            "verse-id": "[18:109]",
            "verse": "Say, \"If the sea were ink for [writing] the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.\"",
            "description": [
                "By \"Words\" are meant \"the marvellous works,",
                " the excellences and the wonders of His",
                " Power and Wisdom\"."
            ]
        },
        {
            "verse-id": "[18:110]",
            "verse": "Say, \"I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.\"",
            "description": [
                ""
            ]
        }
    ]
}