{
    "name": "Maryam",
    "verse-count": 98,
    "verse-info": [
        {
            "id": "[19:1]",
            "verse": "Kaf, Ha, Ya, 'Ayn, Sad.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:2]",
            "verse": "[This is] a mention of the mercy of your Lord to His servant Zechariah",
            "description": [
                "For comparison please see the story of",
                " Zachariah as given in vv. 3457 of",
                " Al-i-`Imran (III) and the E.N.'s there of.",
                "",
                "*2) In order to understand the position",
                " held by Hadrat Zachariah, a descendant '",
                " of Prophet Aaron, one should be acquainted",
                " with the system of priesthood among the",
                " children of Israel.",
                "After the conquest of",
                " Palestine, the whole land was divided among",
                " the 12 tribes of the descendants of",
                " Prophet Jacob as inheritance, and the 13th",
                " tribe (the Levites) were entrusted with religious",
                " services and duties. Even among the Levites,",
                " the house that was separated \"to sanctify",
                " the most holy things .... to burn",
                " incense before the Lord, to minister unto",
                " him, and to bless in his name",
                " for ever\" was the house of Prophet",
                " Aaron. The other Levites were not allowed",
                " to enter the Temple? \"Because their office",
                " was to wait on the sons of",
                " Aaron for the service of the house",
                " of the Lord, in the courts, and",
                " in the chambers, and in the purifying",
                " of all holy things, and the work",
                " of the service of the house of",
                " the God .... And to offer all",
                " burnt sacrifices unto the Lord in the",
                " Sabbaths, in the new moon, and on",
                " the set festivals.\" The descendants of Aaron",
                " were divided into 24 families, who came",
                " to serve the house of the Lord",
                " by turns. One of these families was",
                " of Abiah whose chief was Zachariah. Thus",
                " it was Zachariah's duty to go into",
                " the house on his family's turn and",
                " burn incense before the Lord. (For details,",
                " see I Chronicles, chapters 23, 24)."
            ]
        },
        {
            "id": "[19:3]",
            "verse": "When he called to his Lord a private supplication.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:4]",
            "verse": "He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:5]",
            "verse": "And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir",
            "description": [
                "That is, \"I see none among my",
                " kinsmen, the family of Abiah, who is",
                " religiously and morally sound and capable of",
                " carrying on the work of the mission",
                " that has been entrusted to me.\""
            ]
        },
        {
            "id": "[19:6]",
            "verse": "Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"",
            "description": [
                "That is, \"I do not pray for",
                " a successor to inherit me alone, but",
                " a successor who may inherit the good",
                " ways of the house of Jacob.\""
            ]
        },
        {
            "id": "[19:7]",
            "verse": "[He was told], \"O Zechariah, indeed We give you good tidings of a boy whose name will be John. We have not assigned to any before [this] name.\"",
            "description": [
                "In Luke the words are: \"There is",
                " none of thy kindred that is called",
                " by this name.\" (I: 61)"
            ]
        },
        {
            "id": "[19:8]",
            "verse": "He said, \"My Lord, how will I have a boy when my wife has been barren and I have reached extreme old age?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:9]",
            "verse": "[An angel] said, \"Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.' \"",
            "description": [
                "This dialogue is meant to impress that",
                " Allah is able to do whatever He",
                " wills and can make an impotent man",
                " and a barren woman give birth to",
                " a child, and likewise a virgin can",
                " be made to conceive a child."
            ]
        },
        {
            "id": "[19:10]",
            "verse": "[Zechariah] said, \"My Lord, make for me a sign.\" He said, \"Your sign is that you will not speak to the people for three nights, [being] sound.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:11]",
            "verse": "So he came out to his people from the prayer chamber and signaled to them to exalt [Allah] in the morning and afternoon.",
            "description": [
                "For the explanation of mihrab (sanctuary), see",
                " E.N. 36 of Al-i-`Imran",
                "*8) Below we",
                " reproduce the details of this event as",
                " given in Luke's Gospel so that the.",
                " reader may study and compare the Quranic",
                " with the Christian version. The references and",
                " additions within the brackets are ours:",
                "\"There",
                " was in the days of Herod, the",
                " king of Judaea, (see Bani Isra'il (XVII):",
                " E.N. 9) a certain priest named Zacharias,",
                " of the course of Abiah: and his",
                " wife was of the daughters of Aaron,",
                " and her name wag Elisabeth. And they",
                " were both righteous before God, walking in",
                " all the commandments and ordinances of the",
                " Lord blameless. And they had no child,",
                " because that Elisabeth was barren, and they",
                " both were now well stricken in years.",
                " And it came to pass, that while",
                " he executed the priest's office before God",
                " in the order of his course, according",
                " to the custom of the priest's office,",
                " his lot was to burn incense when",
                " he went into the temple of the",
                " Lord. And the whole multitude of the",
                " people were praying without at the time",
                " of incense. And there appeared unto him",
                " an angel of the Lord standing on",
                " the right side of the altar of",
                " incense. And when Zacharias saw him, he",
                " was troubled, and fear fell upon him.",
                " But the angel said unto him, Fear",
                " not, Zacharias: for thy prayer is heard;",
                " (there is no mention of Zacharias' prayer",
                " anywhere in the Bible) and thy wife",
                " Elisabeth shall bear thee a son, and",
                " thou shalt call his name John (that",
                " is, Yahya). And thou shalt have joy",
                " and gladness; and many shall rejoice at",
                " his birth. For he shall be great",
                " in the sight of the Lord (Sayyidan:",
                " a great Leader according to the Qur'an,",
                " III: 39), and shall drink neither wine",
                " nor strong drink (the Quranic version: Taqiyynr.",
                " pious and pure); and he shall be",
                " filled with the Holy Ghost, even from",
                " his mother's womb (the Qur'an says: `We",
                " blessed him with \"judgment\" while he was",
                " yet a child'). And many of the",
                " children of Israel shall he turn to",
                " the Lord their God. And he shall",
                " go before him in the spirit of",
                " the power of Elias, to turn the",
                " hearts of the fathers to the children,",
                " and the disobedient to the wisdom of",
                " the just; to make ready a people",
                " prepared for the Lord.",
                "\"And Zacharias said",
                " unto the angel, Whereby shall I know",
                " this for I am an old man,",
                " and my wife well stricken in years.",
                " And the angel answering said unto him,",
                " I am Gabriel, that stand in the",
                " presence of God; and am sent to",
                " speak unto thee, and to shew thee",
                " these glad tidings. And, behold, thou shalt",
                " be dumb, and not able to speak,",
                " until the day that these things shall",
                " be performed, because thou believest not my",
                " words, which shall be fulfilled in their",
                " season. (This is different from the Qur'an,",
                " which gives it as a Sign, whereas",
                " according to Luke, it was a punishment.",
                " Moreover, the Qur'an mentions it as the",
                " silence for `three consecutive days', but Luke",
                " says that Zacharias remained dumb till the",
                " birth of John). And the people .waited",
                " for Zacharias, and marvelled that he tarried",
                " so long in the temple. And when",
                " he came out, he could not speak",
                " unto them: and they perceived that he",
                " had seen a vision in the temple:",
                " for he beckoned unto them, and remained",
                " speechless.\" (Luke, I: 5-22)."
            ]
        },
        {
            "id": "[19:12]",
            "verse": "[Allah] said, \"O John, take the Scripture with determination.\" And We gave him judgement [while yet] a boy",
            "description": [
                "The details regarding the birth of Prophet",
                " John, according to the Divine will, and",
                " his coming of age, have been left",
                " out. Here, in one sentence, the Mission",
                " of Prophethood entrusted to him on attaining",
                " maturity has been stated, which was \"to",
                " observe and follow the Torah in letter",
                " and spirit, and to exhort the Israelites",
                " as well to do the same.\""
            ]
        },
        {
            "id": "[19:13]",
            "verse": "And affection from Us and purity, and he was fearing of Allah",
            "description": [
                "The Arabic word hukm implies ability (1)",
                " to make decisions, (2) to form right",
                " opinions, (3) to interpret the Divine Law,",
                " (4) to solve problems, and (5) it",
                " also means `authority from Allah to decide",
                " affairs'.",
                "*11) The Arabic word hanan is",
                " almost synonymous with `mother love'. In other",
                " words, Prophet John bore in his heart",
                " the same kind of intense love for",
                " Allah's servants as a mother has for",
                " her child."
            ]
        },
        {
            "id": "[19:14]",
            "verse": "And dutiful to his parents, and he was not a disobedient tyrant.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:15]",
            "verse": "And peace be upon him the day he was born and the day he dies and the day he is raised alive.",
            "description": [
                "In order to have a fuller understanding",
                " of the Mission and the pure character",
                " of Prophet John, about which brief references",
                " have been made in this Surah and",
                " Surah Al-i-`Imran, it will be useful to",
                " study this story as given in different",
                " Books of the New Testament in the",
                " following order:",
                "According to Luke, Prophet John",
                " was older than Prophet Jesus by six",
                " months and their mothers were cousins. He",
                " was appointed a Prophet at the age",
                " of 30 years, and according to the",
                " Gospel of John, he started his mission",
                " of inviting the people toward God in",
                " Jordan. He would say: \"I am the",
                " voice of one crying in the wilderness.",
                " Make straight the way of the Lord.\"",
                " (John, I: 23)",
                "According to Mark, \"John",
                " did baptize in the wilderness, and preach",
                " the baptizm of repentance for the remission",
                " of sins. And there went out unto",
                " him all the land of Judaea, and",
                " they of Jerusalem, and were all baptized",
                " of him in the river of Jordan,",
                " confessing their sins.\" (Mark, I: 45). He",
                " thus came to be known as John",
                " the Baptist, and the Israelites held him",
                " as a prophet. (Mat. 21: 26). Prophet",
                " Jesus said about John: \"Among them that",
                " are born of women there hath not",
                " risen a man greater than John the",
                " Baptist.\" (Mat. 11 : 11)",
                "\"John had",
                " his raiment of camel's hair, and a",
                " leather girdle about his loins; and his",
                " meat was locusts and wild honey.\" (Mat.",
                " 3: 4). He would say: \"Repent ye:",
                " for the kingdom of heaven is at",
                " hand.\" (Mat. 3: 2). By this he",
                " meant that very soon Prophet Jesus was",
                " going to start his Mission of Prophethood.",
                " The same thing has been said about",
                " him in the Qur'an: \". . .",
                " he (John) will come to confirm a",
                " Command from Allah.\" (III: 39). For the",
                " same reason he has been called `a",
                " sign of or pointer to' Prophet Jesus.",
                "",
                "He urged the people to observe the",
                " Fast and Prayers. (Mat. 9: 14, Luke,",
                " 5: 33, I1: 1). He would also",
                " tell them, \". . . He that",
                " hath two coats, let him -impart to",
                " him that hath none; and he that",
                " hath meat, let him do likewise.\" (Luke",
                " 3: 11). When the tax-collectors asked, \"Master,",
                " what shall we do?\" He said unto",
                " them, \"Exact no more than that what",
                " is appointed you.\" (12-13), and when the",
                " soldiers sought his guidance, he said: \"Do",
                " violence to no man, neither accuse any",
                " falsely; and be content with your wages.\"",
                " (Luke, 3: 14)'",
                "When the corrupt scholars,",
                " Pharisees and Sadducees of the Israelites, came",
                " to be baptized by him, he rebuked",
                " them, saying: \"O generation of vipers, who",
                " hath warned you to flee from the",
                " wrath to come?..think not to say within",
                " yourselves, We have Abraham to our father...",
                " now also the axe is laid unto",
                " the root of the trees: therefore every",
                " tree which bringeth not forth good fruit",
                " is hewn down, and cast into the",
                " fire.\" (Mat-3 :7-10)",
                "The Jewish ruler of",
                " his time, Herod Antipas, in whose tetrarchy",
                " he was performing his Mission of inviting",
                " the people to the Truth, had been",
                " so deeply influenced by the Roman civilization",
                " that he was causing sin and evil",
                " to spread freely in the land. He",
                " had kept Herodias, his brother Philip's wife,",
                " unlawfully in his house; when Prophet John",
                " reproved him for this and raised his",
                " voice against other evils being committed by",
                " him, Herod got him arrested and sent",
                " to jail. However, he held him in",
                " high esteem for his piety and righteousness",
                " and even feared him on account of",
                " the great respect he enjoyed among the",
                " people. On the contrary, Herodias thought that",
                " the moral consciousness that Prophet John was",
                " producing among the people was directly aimed",
                " at women like herself and pulling them",
                " down in the public eye. Thus she",
                " nursed a grudge against him and would",
                " have him killed but could not. Soon",
                " an opportunity came her way. On the",
                " birthday banquet of Herod, her daughter danced",
                " and so delighted Herod and others that",
                " the king said to her, 'Ask of",
                " me whatsoever thou wilt, and I will",
                " give it thee.' The girl asked her",
                " mother what she should ask for. The",
                " mother said, `Ask for the head of",
                " John the Baptist.' The girl went back",
                " to the king and requested to have",
                " there and then the head of John",
                " the Baptist on a dish. Herod felt",
                " sorry to hear this, but could not",
                " reject the demand of the daughter of",
                " his beloved. He at once got Prophet",
                " John killed in the prison and presented",
                " his head on a dish to the",
                " dancing girl. (Mat. 14: 3-12, Mark, 6",
                " :17-29, Luke, 3 :19-20)."
            ]
        },
        {
            "id": "[19:16]",
            "verse": "And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.",
            "description": [
                "For comparison, see Al-i-`Imran (III): 34-57, and",
                " An-Nina (IV) :156 and E.N.'s thereof."
            ]
        },
        {
            "id": "[19:17]",
            "verse": "And she took, in seclusion from them, a screen. Then We sent to her Our Angel, and he represented himself to her as a well-proportioned man.",
            "description": [
                "The Sanctuary where she had retired for",
                " devotion was an eastern chamber in the",
                " Temple, and as was customary she had",
                " hung a curtain to conceal herself from",
                " the people. It cannot be Nazareth as",
                " some people have wrongly taken it to",
                " be, because Nazareth is to the north",
                " of Jerusalem."
            ]
        },
        {
            "id": "[19:18]",
            "verse": "She said, \"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:19]",
            "verse": "He said, \"I am only the messenger of your Lord to give you [news of] a pure boy.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:20]",
            "verse": "She said, \"How can I have a boy while no man has touched me and I have not been unchaste?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:21]",
            "verse": "He said, \"Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.' \"",
            "description": [
                "The word \"So shall it be\" are",
                " very significant as has been stated in",
                " E.N. 6. The plain meaning is this:",
                " \"A pure son shall be born to",
                " you just as your Lord has decreed,",
                " even though no man has touched you.",
                " \" The same was the response to",
                " prophet Zachariah as stated in v. 9",
                " above. And it is a sheer perversion",
                " to interpret it as: \"So shall it",
                " be that a man will touch you",
                " and a son will be born to",
                " you.\" For, if it were to mean:",
                " \"You will bear a son like all",
                " other women of the world,\" the subsequent",
                " two sentences: \"Your Lord says, 'This is",
                " an easy thing for Me to do,",
                " and We will make that boy a",
                " Sign for the people',\" would have become",
                " meaningless: Had this birth been an ordinary",
                " birth like the birth of every other",
                " child, there would have been no occasion",
                " to boast: \"It is an easy thing,",
                " and that it will be made a",
                " Sign (miracle). This will be so because",
                " the child will speak in the cradle.",
                " \""
            ]
        },
        {
            "id": "[19:22]",
            "verse": "So she conceived him, and she withdrew with him to a remote place.",
            "description": [
                "When she conceived the child, she left",
                " the Sanctuary and went to a distant",
                " place (Bethlehem) in order to escape the",
                " bitter criticism of the people. They would",
                " have said, \"Look at the virgin daughter",
                " of the pious house of Aaron !",
                " She has conceived a child and that,",
                " too, in the Sanctuary where she had",
                " retired for devotion!\" Thus she temporarily succeeded",
                " in concealing the shame of the conception,",
                " but this event itself is a proof",
                " that prophet Jesus was born without a",
                " father. Had Mary been married and had",
                " a husband, she would not have left",
                " his or her parents' house by herself",
                " and chosen a distant place for the",
                " purpose of delivery."
            ]
        },
        {
            "id": "[19:23]",
            "verse": "And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\"",
            "description": [
                "The words \"Would that...\" show the extreme",
                " state of anxiety in which Mary found",
                " herself at the time. She did not",
                " utter these words on account of the",
                " labour pains but due to the pangs",
                " of sorrow as to how she would",
                " conceal the child from her people. The",
                " angel's words---\"Grieve not at all\"-explain why she",
                " had spoken these desperate words. When a",
                " married girl is delivering her first baby,",
                " she might be dying with pains, but",
                " she is never so sorrowful and grieved.",
                ""
            ]
        },
        {
            "id": "[19:24]",
            "verse": "But he called her from below her, \"Do not grieve; your Lord has provided beneath you a stream.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:25]",
            "verse": "And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:26]",
            "verse": "So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.' \"",
            "description": [
                "That is, \"You need not say anything",
                " with regard to the child. It is",
                " now Our responsibility to answer the critics.\"",
                " This also indicates why Mary was so",
                " sad and grieved. Had she been married",
                " and given birth to her first baby",
                " like any other mother, there was no",
                " occasion to tell her to observe \"a",
                " fast of silence\", though it was a",
                " common custom among the Jews."
            ]
        },
        {
            "id": "[19:27]",
            "verse": "Then she brought him to her people, carrying him. They said, \"O Mary, you have certainly done a thing unprecedented.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:28]",
            "verse": "O sister of Aaron, your father was not a man of evil, nor was your mother unchaste.\"",
            "description": [
                "\"Sister of Aaron\" may either mean that",
                " Mary had a brother of the name",
                " of Aaron, or it may mean that",
                " she belonged to the family of Prophet",
                " Aaron. The first meaning is supported by",
                " a tradition of the Holy Prophet and",
                " the second is plausible because that is",
                " supported by the Arabic idiom. But we",
                " are inclined to the second meaning, for",
                " the wording of the said tradition does",
                " not necessarily mean that she actually had",
                " a brother named Aaron. The tradition as",
                " related in Muslim, Nasa'i, Tirmizi, etc. says",
                " that when the Christians of Najran criticised",
                " the Quranic version of stating Mary as",
                " the sister of Aaron before Hadrat Mughirah",
                " bin Shu`bah, he was not able to",
                " satisfy them, because Prophet Aaron had passed",
                " away centuries earlier. When he presented the",
                " problem before the Holy Prophet, he replied,",
                " \"Why didn't you say that the Israelites",
                " named their children after their Prophets and",
                " other pious men?\" That is, \"You could",
                " have answered their objection like this as",
                " well.\" (See also E.N. 32 of Al--`Imran).",
                " *19)a. How can the people who reject",
                " the miraculous birth of Prophet Jesus, explain",
                " why Mary's whole community had come out",
                " to curse and condemn her when she",
                " had appeared before them with the child?",
                ""
            ]
        },
        {
            "id": "[19:29]",
            "verse": "So she pointed to him. They said, \"How can we speak to one who is in the cradle a child?\"",
            "description": [
                "People who misinterpret the Qur'an translate this",
                " verse as: \"How shall we talk with",
                " him, who is but a child of",
                " yesterday ?\".They attribute these words to the",
                " elderly people of the Jews, who said",
                " years later, when Jesus was a grown",
                " up boy, that they could not have",
                " any useful dialogue with a mere kid.",
                " But the person who keeps the whole",
                " context in view, will realize that this",
                " interpretation is absurd and has been given",
                " merely to avoid the miracle. As a",
                " matter of fact, the dialogue took place",
                " when the people were condemning Mary who",
                " being unmarried, had brought forth a child,",
                " and not when the child had grown",
                " up into manhood. V. 46 of AI-i-`Imran",
                " (III) and v. 110 of Al-Ma'idah (V)",
                " also support the view that Prophet Jesus",
                " had uttered these words as a baby",
                " in the cradle and not when grown",
                " up. In the first verse, the angel",
                " while giving the good news of a",
                " son to Mary, says: \"He will speak",
                " to the people alike when in the",
                " cradle and when grown up\"; in the",
                " other verse, Allah Himself says to Prophet",
                " Jesus: \".......you talked to the people even",
                " in the cradle as you talked when",
                " you were grown up.\""
            ]
        },
        {
            "id": "[19:30]",
            "verse": "[Jesus] said, \"Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:31]",
            "verse": "And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:32]",
            "verse": "And [made me] dutiful to my mother, and He has not made me a wretched tyrant.",
            "description": [
                "20a* The words used are: \"......dutiful to",
                " my mother\", and not.\"dutiful to my parents\"",
                " . This is another proof of the",
                " fact that Jesus had no father, and",
                " for the same reason he has been",
                " called `Jesus son of Mary' everywhere in",
                " the Qur'an."
            ]
        },
        {
            "id": "[19:33]",
            "verse": "And peace is on me the day I was born and the day I will die and the day I am raised alive.\"",
            "description": [
                "This speech in the cradle by Jesus",
                " was the `Sign' to which the angel",
                " referred in v. 21. As Allah intended",
                " to punish the children of Israel for",
                " their continuous wicked ways and evil deeds,",
                " He made a pious virgin girl of",
                " the family of Prophet Aaron, who had",
                " devoted herself to worship in the Temple",
                " under the patronage of Zachariah, bear a",
                " child and bring it before her people",
                " in order to concentrate the whole attention",
                " of the thousands of people assembled there",
                " on this extraordinary event. Then He made",
                " this new born child speak out even",
                " in the cradle that he had been",
                " appointed a Prophet. Though they had seen",
                " this wonderful Sign of Allah, they rejected",
                " the Prophethood of Jesus and brought him",
                " to the court for crucifixion, and thus",
                " incurred the wrath of Allah. (For further",
                " details, please see Al-i-`Imran (III): E.N.'s 44",
                " and 53, and An-Nina (IV): E.N.'s 212,213).",
                ""
            ]
        },
        {
            "id": "[19:34]",
            "verse": "That is Jesus, the son of Mary - the word of truth about which they are in dispute.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:35]",
            "verse": "It is not [befitting] for Allah to take a son; exalted is He! When He decrees an affair, He only says to it, \"Be,\" and it is.",
            "description": [
                "In vv.1-35, it has been shown that",
                " the \"Doctrine of the son of God\"",
                " in regard to Prophet Jesus is absolutely",
                " wrong. For just as the miraculous birth",
                " of Prophet John did not make him",
                " the `son of God', so the miraculous",
                " birth of Prophet Jesus could not make",
                " him the son of God. For the",
                " births of both were the result of",
                " the same sort of miracle as they",
                " have been mentioned together in the same",
                " context in the Gospel of Luke. Therefore,",
                " it is mere distortion that the Christians",
                " should regard one as the servant of",
                " God and the other as the son",
                " of God."
            ]
        },
        {
            "id": "[19:36]",
            "verse": "[Jesus said], \"And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path.\"",
            "description": [
                "This declaration by Jesus has been cited",
                " to tell the Christians that Jesus also",
                " taught the same Doctrine of Tauhid as",
                " was taught by all other Prophets. And",
                " it was they who had invented the",
                " doctrine of shirk by making him the",
                " son of God. (Please also refer to",
                " Al-i-`Imran (III): E.N. 68, and Al-Ma'idah (V):",
                " E.N.'s 100, 101 and 130)."
            ]
        },
        {
            "id": "[19:37]",
            "verse": "Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved - from the scene of a tremendous Day.",
            "description": [
                "That is, the sects of the Christians.",
                ""
            ]
        },
        {
            "id": "[19:38]",
            "verse": "How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:39]",
            "verse": "And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:40]",
            "verse": "Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.",
            "description": [
                "Here the address which was meant to",
                " be delivered before King Negus and his",
                " courtiers comes to an end. In the",
                " Introduction to this Surah, we have already",
                " stated the historical background of this address.",
                " In order to form an idea of",
                " its great significance, it should be kept",
                " in mind that:",
                "(a) this address was",
                " sent down at the time when the",
                " persecuted Muslims of Makkah were going to",
                " migrate to a Christian kingdom so that",
                " they may present before the Christians the",
                " true Islamic creed about Prophet Jesus. This",
                " shows that the Muslims under no circumstances",
                " should conceal the Truth; (b) it shows",
                " a most wonderful moral courage of the",
                " Muslim Migrants to Habash that they recited",
                " this address in the royal court at",
                " the critical moment, when the courtiers who",
                " had been bribed were bent on handing",
                " them over to their enemies. They indeed",
                " were faced with the real threat that",
                " this frank Islamic criticism of the basic",
                " articles of the Christian Faith might turn",
                " the king against them and he might",
                " hand them over to the Quraish. But",
                " in spite of this, they presented the",
                " whole truth before the king without the",
                " least hesitation."
            ]
        },
        {
            "id": "[19:41]",
            "verse": "And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.",
            "description": [
                "From here the address is directed towards",
                " the people of Makkah, who had forced",
                " their own near and dear relatives to",
                " emigrate from their homes, just as Prophet",
                " Abraham had been exiled by his own",
                " father and brethren. The story of Prophet",
                " Abraham has been selected for this purpose",
                " because the Quraish professed to accept him",
                " as their religious leader and were proud",
                " of being his descendants."
            ]
        },
        {
            "id": "[19:42]",
            "verse": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:43]",
            "verse": "O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:44]",
            "verse": "O my father, do not worship Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.",
            "description": [
                "It should be noted that the literal",
                " translation of the Arabic text is: \"Do",
                " not worship Satan\", though Abraham's father and",
                " the other people did not worship Satan",
                " in the same sense as they worshipped",
                " idols. But as they followed and obeyed",
                " Satan, he accused them of worshipping Satan.",
                " Thus it is clear that if somebody",
                " follows and obeys , Satan, he virtually",
                " worships him. For Satan has never been",
                " a deity in the sense that people",
                " have made him an object of worship;",
                " nay, they have always been cursing him",
                " and following him at the same time.",
                " (For further details see Surah Al-Kahf (XVIII)",
                " E.N.'s 49-50)."
            ]
        },
        {
            "id": "[19:45]",
            "verse": "O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:46]",
            "verse": "[His father] said, \"Have you no desire for my gods, O Abraham? If you do not desist, I will surely stone you, so avoid me a prolonged time.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:47]",
            "verse": "[Abraham] said, \"Peace will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.",
            "description": [
                "27a* For explanation, please see Surah At-Taubah",
                " (IX): E.N. 112."
            ]
        },
        {
            "id": "[19:48]",
            "verse": "And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:49]",
            "verse": "So when he had left them and those they worshipped other than Allah, We gave him Isaac and Jacob, and each [of them] We made a prophet.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:50]",
            "verse": "And We gave them of Our mercy, and we made for them a reputation of high honor.",
            "description": [
                "This is to give comfort to the",
                " Migrants who had been forced to migrate",
                " from their homes. They were told that",
                " they would be honoured and blessed with",
                " true renown just as Prophet Abraham had",
                " been blessed with true renown after his",
                " Migration."
            ]
        },
        {
            "id": "[19:51]",
            "verse": "And mention in the Book, Moses. Indeed, he was chosen, and he was a messenger and a prophet.",
            "description": [
                "The word used is mukhlas, which means",
                " \"purified\". In other words, Allah had specially",
                " chosen Prophet Moses for the Mission of",
                " Prophethood.",
                "*30) \"Rasul\" literally means `the one",
                " who is sent'; therefore it is used",
                " for an ambassador, envoy, messenger and representative.",
                " The Qur'an has used this title for",
                " angels, who are sent by Allah on",
                " a special mission, or for the human",
                " beings who brought His Message to mankind.",
                "",
                "As regards the word \"Nabi\", it literally",
                " means the one who brings news, or",
                " the one who is high in rank,",
                " or the one who shows the way.",
                " This title is used for the Prophets",
                " in all the three senses. Thus Moses",
                " was a Messenger Prophet because he was",
                " a Messenger of high rank who gave",
                " news from Allah and showed the Right",
                " Way to the people.",
                "The Qur'an does",
                " not necessarily differentiate between the use of",
                " the two titles, for sometimes it uses",
                " the title Rasul for one person at",
                " one place and the title Nabi for",
                " the same person at another place, and",
                " sometimes uses both the titles together for",
                " one and the same person. However, at",
                " some places each title has been used",
                " in a way as to show that",
                " there is some technical distinction between the",
                " two, though that has not been precisely",
                " marked out, except that every Rasul (Messenger)",
                " is a Nabi (Prophet) as well, but",
                " every Nabi may not be a Rasul,",
                " and that a Rasul has a special",
                " and more important mission to perform. This",
                " is supported by a Tradition of the",
                " Holy Prophet, which has been reported by",
                " Imam Ahmad from Abu Umamah and by",
                " Hakim from Hadrat Abu Zarr. When the",
                " Holy Prophet was asked how many \"Messengers\"",
                " and \"Prophets\" had been sent to the",
                " world, he said that the number of",
                " the Messengers was 313 or 315 and",
                " of the Prophets 1,24,000"
            ]
        },
        {
            "id": "[19:52]",
            "verse": "And We called him from the side of the mount at [his] right and brought him near, confiding [to him].",
            "description": [
                "\"The right side of Tur\" means the",
                " eastern side of the mountain. As Prophet",
                " Moses, on his way from Midian to",
                " Egypt, was passing from the southern side",
                " of Mt. Tur, the eastern side would",
                " lie on his right and the western",
                " on his left if he faced the",
                " mountain, otherwise a mountain by itself cannot",
                " have a right or a left side.",
                "",
                "*32) See E.N. 206 of Surah An-Nisa",
                " (1V)."
            ]
        },
        {
            "id": "[19:53]",
            "verse": "And We gave him out of Our mercy his brother Aaron as a prophet.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:54]",
            "verse": "And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:55]",
            "verse": "And he used to enjoin on his people prayer and zakah and was to his Lord pleasing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:56]",
            "verse": "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.",
            "description": [
                "There is a difference of opinion as",
                " to who Prophet Idris was. Some commentators",
                " opine that he was a Prophet from",
                " among the Israelites, but the majority of",
                " them are inclined to the view that",
                " he was a Prophet before Noah. There",
                " is no authentic Tradition which may help",
                " determine his identity. The next verse (58),",
                " however, supports the view that he appeared",
                " before Prophet Noah. For of alI the",
                " Prophets mentioned, he alone was the one",
                " who may be said to be \"from",
                " the descendants of Adam. \"",
                "The commentators",
                " are of the opinion that Idris was",
                " Enoch of the Old Testament, about whom",
                " it is said:",
                "\"And Enoch lived sixty",
                " and five years, and begat Methuselah: And",
                " Enoch walked with God after he begat",
                " Methuselah three hundred years.... and he was",
                " not; for God took him.\" (Gen. 5:",
                " 21-24)",
                "In Talmud, there are greater details",
                " about Enoch, which are briefly as follows:",
                " \"Before Noah when the descendants of Adam",
                " began to degenerate, the angel of God",
                " called to Enoch, who led a pious",
                " life away from the people, and said,",
                " 'O Enoch, arise, come out from seclusion,",
                " and go about among the people of",
                " the earth, guiding them to the path",
                " which they should follow and the ways",
                " which they should adopt.'",
                "\"Receiving this Divine",
                " Command, Enoch left his seclusion and gathered",
                " the people together and preached to them",
                " what he had been commanded, with the",
                " result that they listened to him and",
                " adopted the worship of God. Enoch ruled",
                " over mankind for 353 years: his rule",
                " was based on justice and truth, and",
                " consequently God favoured mankind with all kinds",
                " of blessings.\" (H. Polano: The Talmud Selections,",
                " pp. 18-21)"
            ]
        },
        {
            "id": "[19:57]",
            "verse": "And We raised him to a high station.",
            "description": [
                "The plain meaning is that God had",
                " favoured Idris with a high rank, but",
                " according to the Israelite traditions, God took",
                " up Idris (Enoch) to heavens. The Bible",
                " says: \"... and he was not; for",
                " God took him\", but the Talmud has",
                " a long story to tell, which ends",
                " with the words: \"Enoch ascended to heaven",
                " in a whirlwind, with chariot and horses",
                " of fire.\""
            ]
        },
        {
            "id": "[19:58]",
            "verse": "Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:59]",
            "verse": "But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil -",
            "description": [
                "It appears that the degenerate people totally",
                " discarded Salat, or they had become neglectful",
                " and careless in its observance. This is",
                " the first evil that is committed by",
                " a degenerate people; for, after this there",
                " remains no connection whatever between them and",
                " God. Here it has been stated as",
                " a universal principle that the degeneration of",
                " the people of all the former Prophets",
                " started with the abandonment of Salat by",
                " them.",
                "*36) This was the inevitable result",
                " of the loss of the connection with",
                " Allah. As they became more and more",
                " neglectful of their Salat, their lusts took",
                " complete hold of them and they fell",
                " to the lowest depths of moral depravity",
                " and began to follow their whims instead",
                " of the Divine Commands."
            ]
        },
        {
            "id": "[19:60]",
            "verse": "Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:61]",
            "verse": "[Therein are] gardens of perpetual residence which the Most Merciful has promised His servants in the unseen. Indeed, His promise has ever been coming.",
            "description": [
                "That is, the promised Gardens which are",
                " yet unseen by His servants."
            ]
        },
        {
            "id": "[19:62]",
            "verse": "They will not hear therein any ill speech - only [greetings of] peace - and they will have their provision therein, morning and afternoon.",
            "description": [
                "The word used is salam, which means",
                " ' free from defect and fault' .",
                " It implies to mean that the greatest",
                " blessing that man will enjoy in Paradise",
                " will be that there he will hear",
                " no idle, vile or indecent talk; all",
                " the dwellers of Paradise will be neat",
                " and clean and pure people and every",
                " individual will be gentle and right-minded by",
                " nature; everybody will be secure against backbiting,",
                " slander and indecent songs and other ugly",
                " sounds. Whatever men will hear will be",
                " good, sensible and right.",
                "This is indeed",
                " a great blessing which only that person",
                " can fully appreciate, who possesses a neat",
                " and fine taste, because only such a",
                " one can feel the misery of living",
                " among a dirty society, where his ears",
                " are never immune against lies, backbiting, slander,",
                " and mischievous and sensual talk."
            ]
        },
        {
            "id": "[19:63]",
            "verse": "That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allah.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:64]",
            "verse": "[Gabriel said], \"And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between. And never is your Lord forgetful -",
            "description": [
                "This paragraph is a parenthesis, which has",
                " been inserted at the end of one",
                " theme and before the commencement of the",
                " other. It is obvious from this that",
                " this Surah was sent down after a",
                " long delay. At that time the Holy",
                " Prophet and his Companions were passing through",
                " very hard times and were always expecting",
                " a Revelation to guide and comfort them.",
                " When Gabriel (peace be upon him) came",
                " with the angels with this Revelation, he",
                " at first delivered that part of the",
                " Message which was immediately needed. Then before",
                " proceeding further, he said these words by",
                " the leave of Allah as an explanation",
                " for the delay and to give them",
                " comfort from Allah and counsel of fortitude.",
                " This interpretation is not only borne out",
                " by the wording of the passage but",
                " also by some Traditions of the Holy",
                " Prophet, which have been cited by Ibn",
                " Jarir, Ibn Kathir, and the author of",
                " Ruh ulMa `ani in their commentary on",
                " this passage."
            ]
        },
        {
            "id": "[19:65]",
            "verse": "Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?\"",
            "description": [
                "That is, \"You should not only follow",
                " strictly the Way of service and face",
                " all the obstacles and afflictions with patience,",
                " but also should not get uneasy, if",
                " there is a delay in Revelation and",
                " help. You should rest content with His",
                " service as an obedient servant and perform",
                " persistently the duties and responsibilities entrusted to",
                " you as a Servant and Messenger.\"",
                "*41)",
                " The word Sami literally means `a name",
                " sake'. Here it implies: \"Allah is the",
                " only Deity: do you know of any",
                " other deity besides Him? If there is",
                " none, and you know that there is",
                " none, then you do not have any",
                " alternative but to serve Him and obey",
                " His Commands.\""
            ]
        },
        {
            "id": "[19:66]",
            "verse": "And the disbeliever says, \"When I have died, am I going to be brought forth alive?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:67]",
            "verse": "Does man not remember that We created him before, while he was nothing?",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:68]",
            "verse": "So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.",
            "description": [
                "The \"Satans\" are the leaders who persuade",
                " the wicked people to enjoy themselves in",
                " this worldly life, for there is no",
                " life in the Hereafter, where they shall",
                " have to present themselves before Allah and",
                " give an account of their deeds."
            ]
        },
        {
            "id": "[19:69]",
            "verse": "Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.",
            "description": [
                "The leader of every rebel band."
            ]
        },
        {
            "id": "[19:70]",
            "verse": "Then, surely it is We who are most knowing of those most worthy of burning therein.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:71]",
            "verse": "And there is none of you except he will come to it. This is upon your Lord an inevitability decreed.",
            "description": [
                "According to some traditions, \"to be presented",
                " before the confines of Hell\" means `to",
                " enter Hell', but none of these traditions",
                " is authentic. Then this interpretation goes against",
                " the Qur'an and a great many authentic",
                " Traditions, which clearly state that the true",
                " Believers will never be cast into Hell.",
                " Lexically also, vurud (being presented unto) is",
                " not synonymous with dukhul (causing to enter).",
                " Therefore, the correct meaning would be that",
                " every human being will be presented before",
                " Hell, but then, as the next verse",
                " clarifies, the pious people will be rescued",
                " and the transgressors left therein on their",
                " knees."
            ]
        },
        {
            "id": "[19:72]",
            "verse": "Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:73]",
            "verse": "And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, \"Which of [our] two parties is best in position and best in association?\"",
            "description": [
                "In response to the recital of clear",
                " Revelations, instead of accepting their Message, the",
                " unbelievers put such questions as these to",
                " the Believers to show that they were",
                " in the right: Who has grander houses",
                " to live in? Who has a higher",
                " standard of life? Who enjoys splendid meetings?",
                " If we are enjoying all these things",
                " while you are deprived of them, you",
                " may decide for yourselves whether we, who",
                " are enjoying happy worldly lives, are in",
                " the wrong, or you who are living",
                " miserable lives of indigence are in the",
                " right? (Also see Surah AI-Kahf (XVIII): E.N.'s",
                " 37-38)."
            ]
        },
        {
            "id": "[19:74]",
            "verse": "And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:75]",
            "verse": "Say, \"Whoever is in error - let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised - either punishment [in this world] or the Hour [of resurrection] - they will come to know who is worst in position and weaker in soldiers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:76]",
            "verse": "And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for recourse.",
            "description": [
                "That is, \"On every critical occasion, Allah",
                " guides them to make right decisions and",
                " helps them to adopt the right way,",
                " and protects them from evil and wrong",
                " things; thus they go on making more",
                " and more progress on the right way.\"",
                ""
            ]
        },
        {
            "id": "[19:77]",
            "verse": "Then, have you seen he who disbelieved in Our verses and said, \"I will surely be given wealth and children [in the next life]?\"",
            "description": [
                "The boastful person was not a particular",
                " man but a typical chief of the",
                " disbelievers of Makkah. Everyone of them claimed,",
                " \"Howsoever you may call the an erroneous",
                " and un-righteous person and threaten me with",
                " the Divine scourge, the tact is that",
                " I am more prosperous than you today",
                " and shall continue being blessed with favours",
                " in future as well. lust have a",
                " look at my riches, at my grandeur",
                " and at my estate, and at my",
                " well-known sons, and then say where you",
                " see any signs of the wrath of",
                " God."
            ]
        },
        {
            "id": "[19:78]",
            "verse": "Has he looked into the unseen, or has he taken from the Most Merciful a promise?",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:79]",
            "verse": "No! We will record what he says and extend for him from the punishment extensively.",
            "description": [
                "That is, the boastful words of his",
                " shall also be included in the record",
                " of his crimes and he shall have",
                " to bear the consequences of his arrogant",
                " claim."
            ]
        },
        {
            "id": "[19:80]",
            "verse": "And We will inherit him [in] what he mentions, and he will come to Us alone.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:81]",
            "verse": "And they have taken besides Allah [false] deities that they would be for them [a source of] honor.",
            "description": [
                "The Arabic word 'Izzan (from 'Izat) implies",
                " a powerful and strong person whom nobody",
                " may dare do any harm; here it",
                " means a person's having such a strong",
                " supporter that no enemy or opponent of",
                " his may even cherish an evil intention",
                " against him."
            ]
        },
        {
            "id": "[19:82]",
            "verse": "No! Those \"gods\" will deny their worship of them and will be against them opponents [on the Day of Judgement].",
            "description": [
                "That is, they will say, \"We never",
                " asked them to worship us nor were",
                " we aware that these foolish people were",
                " worshipping us.\""
            ]
        },
        {
            "id": "[19:83]",
            "verse": "Do you not see that We have sent the devils upon the disbelievers, inciting them to [evil] with [constant] incitement?",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:84]",
            "verse": "So be not impatient over them. We only count out to them a [limited] number.",
            "description": [
                "That is: \"Endure their persecutions patiently a",
                " little more, for the time of their",
                " punishment is coming near, for We have",
                " given them respite for a fixed term,",
                " and let that term expire.\""
            ]
        },
        {
            "id": "[19:85]",
            "verse": "On the Day We will gather the righteous to the Most Merciful as a delegation",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:86]",
            "verse": "And will drive the criminals to Hell in thirst",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:87]",
            "verse": "None will have [power of] intercession except he who had taken from the Most Merciful a covenant.",
            "description": [
                "This implies two things: (1) Intercession will",
                " be allowed only for the one who",
                " might have received permission for it from",
                " the Merciful, that is, the one who",
                " believed in Allah in the world and",
                " made himself deserving of His pardon. (2)",
                " Only that one will be able to",
                " plead intercession who might have got permission",
                " for this from the Merciful, and not",
                " those ones whom people themselves had made",
                " their intercessors without any reason."
            ]
        },
        {
            "id": "[19:88]",
            "verse": "And they say, \"The Most Merciful has taken [for Himself] a son.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:89]",
            "verse": "You have done an atrocious thing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:90]",
            "verse": "The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:91]",
            "verse": "That they attribute to the Most Merciful a son.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:92]",
            "verse": "And it is not appropriate for the Most Merciful that He should take a son.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:93]",
            "verse": "There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:94]",
            "verse": "He has enumerated them and counted them a [full] counting.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:95]",
            "verse": "And all of them are coming to Him on the Day of Resurrection alone.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:96]",
            "verse": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.",
            "description": [
                "This is to comfort the righteous people",
                " who were being persecuted and insulted in",
                " the streets of Makkah. They are being",
                " assured that the time is coming near",
                " when the people will honour and love",
                " them because of their righteous deeds and",
                " good conduct. Hearts will be attracted towards",
                " them and the world will hold them",
                " in high esteem. And this will happen",
                " according to a universal principle. Those who",
                " are wicked, proud and haughty and try",
                " to rule over the people with falsehood",
                " and hypocrisy can never captivate the hearts",
                " of the people; on the other hand,",
                " those who invite the people to the",
                " right way with truth, honesty, sincerity and",
                " good conduct succeed in winning their hearts",
                " in the end, even though at first",
                " they might have to face the indifference",
                " and opposition of the dishonest people."
            ]
        },
        {
            "id": "[19:97]",
            "verse": "So, [O Muhammad], We have only made Qur'an easy in the Arabic language that you may give good tidings thereby to the righteous and warn thereby a hostile people.",
            "description": [
                ""
            ]
        },
        {
            "id": "[19:98]",
            "verse": "And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?",
            "description": [
                ""
            ]
        }
    ]
}