{
    "name": "Ta-Ha",
    "id": 20,
    "verse-count": 135,
    "verse-info": [
        {
            "verse-id": "[20:1]",
            "verse": "Ta, Ha.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:2]",
            "verse": "We have not sent down to you the Qur'an that you be distressed",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:3]",
            "verse": "But only as a reminder for those who fear [Allah] -",
            "description": [
                "This verse makes plain the meaning of",
                " the previous one. The object of the",
                " Revelation of the Qur'an is riot to",
                " make the Holy Prophet do something impossible",
                " and to put him to unnecessary distress",
                " by demanding from him to imbue the",
                " hearts of the obdurate people with Faith,",
                " but to admonish those people who have",
                " fear of Allah. Therefore the Holy Prophet",
                " should not waste his efforts on those",
                " people who have no fear of God",
                " left in them, and who do not",
                " bother at all about what is Truth",
                " and what is falsehood."
            ]
        },
        {
            "verse-id": "[20:4]",
            "verse": "A revelation from He who created the earth and highest heavens,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:5]",
            "verse": "The Most Merciful [who is] above the Throne established.",
            "description": [
                "That is, \"After creating the universe, He",
                " is ruling over it and conducting all",
                " the affairs of its management.\""
            ]
        },
        {
            "verse-id": "[20:6]",
            "verse": "To Him belongs what is in the heavens and what is on the earth and what is between them and what is under the soil.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:7]",
            "verse": "And if you speak aloud - then indeed, He knows the secret and what is [even] more hidden.",
            "description": [
                "That 'is, \"You need not complain to",
                " Allah in a loud voice against the",
                " persecution from which you and your companions",
                " are suffering and the mischievous machinations your",
                " enemies are devising to defeat you for",
                " Allah is fully aware of all those",
                " things, and He hears even the complaints",
                " you cherish in your hearts.\""
            ]
        },
        {
            "verse-id": "[20:8]",
            "verse": "Allah - there is no deity except Him. To Him belong the best names.",
            "description": [
                "That is, \"He possesses all the excellent",
                " attributes and characteristics.\""
            ]
        },
        {
            "verse-id": "[20:9]",
            "verse": "And has the story of Moses reached you? -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:10]",
            "verse": "When he saw a fire and said to his family, \"Stay here; indeed, I have perceived a fire; perhaps I can bring you a torch or find at the fire some guidance.\"",
            "description": [
                "This happened when Prophet Moses was returning",
                " to Egypt after passing several years in",
                " exile in Midian, along with his wife",
                " whom he had married there. According to",
                " the early part of his history, which",
                " has been related in Surah XXVIII (A!-Qasas),",
                " an Egyptian had been killed by Prophet",
                " Moses; so he had to leave Egypt",
                " in order to escape arrest and had",
                " taken refuge in Midian.",
                "*6) It appears",
                " that this happened during a night of",
                " winter, when Prophet Moses was passing through",
                " the southern part of the Sinai Peninsula.",
                " When he saw a fire at a",
                " distance, he went towards it in the",
                " hope that he might get some of",
                " it to keep his wife and children",
                " warm during the night, or at least",
                " get some guidance concerning the direction of",
                " his journey. But instead of this it",
                " was his good fortune that he found",
                " the guidance to the Right Way."
            ]
        },
        {
            "verse-id": "[20:11]",
            "verse": "And when he came to it, he was called, \"O Moses,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:12]",
            "verse": "Indeed, I am your Lord, so remove your sandals. Indeed, you are in the sacred valley of Tuwa.",
            "description": [
                "Probably, it is because of this that",
                " the Jews do not say their prayers",
                " with their shoes on. The Holy Prophet,",
                " however, removed this misunderstanding, saying, \"Act in",
                " contrast to the practice of the Jews",
                " who do not say their prayers with",
                " their shoes or leather socks on.\" (Abu",
                " Da'ud). It does not, however, mean that",
                " one must say one's prayers with the",
                " shoes on, but it is merely to",
                " make it lawful to say prayers with",
                " shoes on. This is confirmed by another",
                " tradition, related by Abu Da'ud from `Amar",
                " bin `As, that he had seen the",
                " Holy Prophet saying his prayer both with",
                " and without the shoes.",
                "There are other",
                " traditions also to this effect but it",
                " should also be kept in mind that",
                " there were no carpets, mats, etc. in",
                " the mosques in those days, not even",
                " in the Holy Prophet's Mosque. Therefore it",
                " would be improper to go with shoes",
                " on into the mosques of today which",
                " have carpets, mats, etc. However, one may",
                " say one's prayer on grassy plots or",
                " open ground with shoes on.",
                "*8) In",
                " general, the commentators are of the opinion",
                " that Tuwa was the name of the",
                " valley, but according to some it means,",
                " \"The valley that had been made sacred",
                " for the time being. \""
            ]
        },
        {
            "verse-id": "[20:13]",
            "verse": "And I have chosen you, so listen to what is revealed [to you].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:14]",
            "verse": "Indeed, I am Allah. There is no deity except Me, so worship Me and establish prayer for My remembrance.",
            "description": [
                "This is the real object of Salat.",
                " It has been prescribed to remind people",
                " that they should not become neglectful of",
                " Allah by worldly diversions and that they",
                " should remember that man is not an",
                " unbridled free being but a servant of",
                " Allah. Salat has been prescribed five times",
                " a day to remind man of Allah's",
                " presence.",
                "Some people are of the opinion",
                " that it means: \"Establish Salat, so that",
                " I may remember you.\"",
                "Incidentally, according to",
                " this verse, if one forgets to offer",
                " a prayer in time, one should offer",
                " it when one recollects it. This is",
                " also supported by a tradition related by",
                " Hadrat Anas: \"If one forgets to offer",
                " a certain prayer at the proper time,",
                " he should offer it whenever he recollects",
                " this; for there is no other expiation",
                " for this omission.\" (Bukhari, Muslim, Ahmed). There",
                " is another tradition related by Abu Hurairah",
                " to the same effect. It was inquired",
                " from the Holy Prophet: \"What should we",
                " do if we remained asleep during the",
                " time of prayer?\" The Holy Prophet said,",
                " \"There is no sin if one remained",
                " asleep. The sin is that one should",
                " neglect one's prayer intentionally while awake. Therefore",
                " if one forgets to offer a prayer",
                " or remained asleep one should offer that",
                " prayer on remembering it or on awaking.\"",
                " (Tirmizi, Nasa'i, Abu Da'ud)."
            ]
        },
        {
            "verse-id": "[20:15]",
            "verse": "Indeed, the Hour is coming - I almost conceal it - so that every soul may be recompensed according to that for which it strives.",
            "description": [
                "After Tauhid the second thing that was",
                " revealed to alI the Prophets was the",
                " reality of the \"Hereafter\", and they were",
                " appointed to impart its knowledge to their",
                " peoples. Here its object Gas also been",
                " stated. The Hour of Resurrection is destined",
                " to come so that every one should",
                " get the recompense in the Hereafter of",
                " what one did in this world, and",
                " that Hour has been kept secret to",
                " fulfil the requirement of the trial. For",
                " the one who believes in the Hereafter",
                " will always be on his guard against",
                " any deviation from the Right Way, and",
                " the one who does not believe in",
                " the coming of that Hour will remain",
                " engaged in other things, for he will",
                " think that he did not see any",
                " sign of the coming of the Hour.",
                ""
            ]
        },
        {
            "verse-id": "[20:16]",
            "verse": "So do not let one avert you from it who does not believe in it and follows his desire, for you [then] would perish.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:17]",
            "verse": "And what is that in your right hand, O Moses?\"",
            "description": [
                "This question was not asked for the",
                " sake of getting any information, for Allah",
                " knew that Moses held a staff in",
                " his hand. The question was posed with",
                " a view to impressing upon him the",
                " fact that it was a staff so",
                " that he might be mentally prepared to",
                " see the miracle which was going to",
                " be performed with it."
            ]
        },
        {
            "verse-id": "[20:18]",
            "verse": "He said, \"It is my staff; I lean upon it, and I bring down leaves for my sheep and I have therein other uses.\"",
            "description": [
                "Prophet Moses deliberately prolonged his answer and",
                " did not stop at: \"It is my",
                " staff\". This was because he naturally wanted",
                " to prolong the dialogue to make the",
                " privilege meeting last longer."
            ]
        },
        {
            "verse-id": "[20:19]",
            "verse": "[Allah] said, \"Throw it down, O Moses.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:20]",
            "verse": "So he threw it down, and thereupon it was a snake, moving swiftly.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:21]",
            "verse": "[Allah] said, \"Seize it and fear not; We will return it to its former condition.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:22]",
            "verse": "And draw in your hand to your side; it will come out white without disease - another sign,",
            "description": [
                "That is, \"Your hand will shine brightly",
                " like the sun, but it will not",
                " cause any hurt to you. \" It",
                " is strange that the Bible interprets this",
                " miracle, saying that 'his hand was leprous",
                " as snow but it was turned again",
                " as his other flesh'. The Talmud also",
                " interprets the miracle in the same way",
                " and adds that this was a miracle",
                " which was meant for Pharaoh who was",
                " suffering from leprosy. It is a pity",
                " that the same interpretation has been adopted",
                " by our own commentators, though the correct",
                " interpretation is the one that has been",
                " adopted by us, and many former commentators.",
                " Obviously, it is bad taste to attribute",
                " to a Prophet the repugnant miracle of",
                " leprosy and that, too, before a king",
                " in his court."
            ]
        },
        {
            "verse-id": "[20:23]",
            "verse": "That We may show you [some] of Our greater signs.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:24]",
            "verse": "Go to Pharaoh. Indeed, he has transgressed.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:25]",
            "verse": "[Moses] said, \"My Lord, expand for me my breast [with assurance]",
            "description": [
                "That is, 'Fill my heart with the",
                " courage that may enable me to perform",
                " the obligations connected with the great Mission",
                " of a Messenger, and give me the",
                " confidence for its fulfilment\". Prophet Moses prayed",
                " for this because he realized the grave",
                " responsibilities of the great Mission."
            ]
        },
        {
            "verse-id": "[20:26]",
            "verse": "And ease for me my task",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:27]",
            "verse": "And untie the knot from my tongue",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:28]",
            "verse": "That they may understand my speech.",
            "description": [
                "Prophet Moses prayed to Allah for this",
                " because he was conscious that he was",
                " not a fluent speaker but was slow",
                " of speech. He also knew that as",
                " a Messenger he would have to be",
                " fluent in order to impress Pharaoh and",
                " his courtiers. This is confirmed by the",
                " Bible (Exodus 4: 10) but the Talmud",
                " gives a strange explanation for this impediment",
                " in his speech. According to it, when",
                " he was a child he burnt his",
                " tongue with a live coal to escape",
                " punishment from Pharaoh whose crown he had",
                " taken off from his head and put",
                " it on his own head. The same",
                " story has been adopted by many of",
                " our commentators though it is absurd on",
                " the face of it. Our interpretation is",
                " also confirmed by the Qur'an. The tact",
                " is, that at first he was not",
                " a fluent speaker and Pharaoh had also",
                " taunted him on this impediment (XLIII: 52).",
                " Prophet Moses realized the same for he",
                " said, \"My brother Aaron is more fluent",
                " than I, so send him with me",
                " as a helper, so that he may",
                " support me (with his fluent speech).\" (XXVIII:",
                " 34). Afterwards this impediment in his speech",
                " was removed and he was able to",
                " deliver very fluent speeches. This tray be",
                " testified by his speeches which have been",
                " cited both in the Bible and in",
                " the Qur'an for they are masterpieces of",
                " eloquence and rhetoric.",
                "Above all, it does",
                " not stand to reason that Allah should",
                " appoint a lisper or a stammerer or",
                " a stutterer as His Messenger. That is",
                " why the Messengers have always been the",
                " best of mankind in regard to their",
                " appearance, personality and capabilities for they had",
                " to be most impressive both in their",
                " appearance and conduct, so that they could",
                " not be made the target of ridicule",
                " and contempt by the people because of",
                " such personal defects as stammering or stuttering.",
                ""
            ]
        },
        {
            "verse-id": "[20:29]",
            "verse": "And appoint for me a minister from my family -",
            "description": [
                "Prophet Aaron was three years older than",
                " Prophet Moses (Exodus,7:7)."
            ]
        },
        {
            "verse-id": "[20:30]",
            "verse": "Aaron, my brother.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:31]",
            "verse": "Increase through him my strength",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:32]",
            "verse": "And let him share my task",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:33]",
            "verse": "That we may exalt You much",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:34]",
            "verse": "And remember You much.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:35]",
            "verse": "Indeed, You are of us ever Seeing.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:36]",
            "verse": "[Allah] said, \"You have been granted your request, O Moses.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:37]",
            "verse": "And We had already conferred favor upon you another time,",
            "description": [
                "Allah recounts the favours He had shown",
                " to Prophet Moses since his birth in",
                " order to impress on him the fact",
                " that he had been brought up under",
                " Divine care right from his birth for",
                " the purpose of appointing him as a",
                " Messenger. Here mere references have been made",
                " but in Surah XXVIII (AI-Qasas) details of",
                " the favours have been given."
            ]
        },
        {
            "verse-id": "[20:38]",
            "verse": "When We inspired to your mother what We inspired,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:39]",
            "verse": "[Saying], 'Cast him into the chest and cast it into the river, and the river will throw it onto the bank; there will take him an enemy to Me and an enemy to him.' And I bestowed upon you love from Me that you would be brought up under My eye.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:40]",
            "verse": "[And We favored you] when your sister went and said, 'Shall I direct you to someone who will be responsible for him?' So We restored you to your mother that she might be content and not grieve. And you killed someone, but We saved you from retaliation and tried you with a [severe] trial. And you remained [some] years among the people of Madyan. Then you came [here] at the decreed time, O Moses.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:41]",
            "verse": "And I produced you for Myself.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:42]",
            "verse": "Go, you and your brother, with My signs and do not slacken in My remembrance.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:43]",
            "verse": "Go, both of you, to Pharaoh. Indeed, he has transgressed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:44]",
            "verse": "And speak to him with gentle speech that perhaps he may be reminded or fear [Allah].\"",
            "description": [
                "The only two ways of bringing a",
                " man to the Right Way are: (",
                " 1 ) To convince him by argument",
                " and admonition, or (2) to warn him",
                " of the consequences of deviation.",
                "*18)a. It",
                " appears that they implored AIIah thus before",
                " going before Pharaoh when Prophet Moses had",
                " reached Egypt and Aaron had joined him",
                " in the propagation of the Mission."
            ]
        },
        {
            "verse-id": "[20:45]",
            "verse": "They said, \"Our Lord, indeed we are afraid that he will hasten [punishment] against us or that he will transgress.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:46]",
            "verse": "[Allah] said, \"Fear not. Indeed, I am with you both; I hear and I see.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:47]",
            "verse": "So go to him and say, 'Indeed, we are messengers of your Lord, so send with us the Children of Israel and do not torment them. We have come to you with a sign from your Lord. And peace will be upon he who follows the guidance.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:48]",
            "verse": "Indeed, it has been revealed to us that the punishment will be upon whoever denies and turns away.' \"",
            "description": [
                "A comparative study of this incident as",
                " given in the Bible and the Talmud",
                " will show that the Qur'an dces not",
                " copy the stories from these books, but",
                " gives its own version in order to",
                " portray the Messengers in their true glory",
                " and dignity. According to the Bible, when",
                " God said to Moses that He would",
                " send him to Pharaoh, Moses replied, \"Who",
                " am I, that I should go unto",
                " Pharaoh, and that I should bring forth",
                " the children of Israel out of Egypt?\"",
                " (Exodus 3: 11). God persuaded and encouraged",
                " Moses by giving him Signs but he",
                " was still reluctant and said, \"O my",
                " Lord, send, I pray thee, by the",
                " hand of him whom thou wilt send.\"",
                " (Exodus 4: 13). And the Talmud goes",
                " even further than this and says that",
                " there was an argument between God and",
                " Moses for seven days that he should",
                " become a Prophet but Moses did not",
                " accept the offer. At this God was",
                " angry with hlm and so made his",
                " brother Aaron a partner in his Prophethood.",
                " Moreover, He deprived the descendants of Moses",
                " of the office of priesthood and bestowed",
                " it on the descendants of Aaron. These",
                " two versions depict Allah to be suffering",
                " from human weaknesses and Prophet Moses from",
                " inferiority complex."
            ]
        },
        {
            "verse-id": "[20:49]",
            "verse": "[Pharaoh] said, \"So who is the Lord of you two, O Moses?\"",
            "description": [
                "Here the details have been omitted. These",
                " have been given in VII: 103-108, XXVI:",
                " 10-33, XXVIII: 28-40, LXXIX: 15-25.",
                "As regards",
                " the necessary information about Pharaoh, see E.N.",
                " 85 of Chapter VII.",
                "*21) Pharaoh addressed",
                " Prophet Moses because he was, in regard",
                " to Prophethood, the senior of the two.",
                " It is also possible that he deliberately",
                " addressed him in order to exploit his",
                " impediment in speech, and ignored Prophet Aaron,",
                " who was more fluent.",
                "As regards the",
                " implication of this question of Pharaoh, he",
                " meant to say, \"YOU say that you",
                " have brought a Message from my Lord",
                " to me. Who is that Lord? You",
                " should know that I am the Lord",
                " of Egypt and the people of Egypt\"",
                " . In regard to this claim of",
                " his, see LXXIX: 24, XLIII: 51, XXVIII:",
                " 38 and XXVI: 29.",
                "It may also",
                " be noted that by this claim Pharaoh",
                " did not mean to say that he",
                " was the sole deity of his people",
                " nor did it mean that none other",
                " was worshipped in Egypt. As a matter",
                " of fact, he himself based his right",
                " of sovereignty on his claim of being",
                " the incarnation of the sungod. And we",
                " also learn from the history of Egypt",
                " that there were many other gods and",
                " goddesses. In fact, what he claimed was",
                " that he was politically the Lord of",
                " not only Egypt but also of the",
                " whole of mankind theoretically. Therefore, he would",
                " not acknowledge that there was any supreme",
                " sovereign over him whose delegate might bring",
                " an order to him and demand its",
                " obedience from him."
            ]
        },
        {
            "verse-id": "[20:50]",
            "verse": "He said, \"Our Lord is He who gave each thing its form and then guided [it].\"",
            "description": [
                "That is, \"We acknowledge Him alone as",
                " our Lord in every sense: He is",
                " our Sustainer, our Maker, our Master, our",
                " Sovereign and is Supreme in everything, and",
                " there is no other lord in any",
                " sense but He.\"",
                "*23) This concise sentence",
                " needs serious attention. It means that it",
                " is Allah alone Who has created everything",
                " and given it its distinctive structure, form,",
                " capabilities, characteristics, etc.",
                "(1) For instance, tnan",
                " has been given the hands and feet",
                " which are given the most appropriate structure",
                " that was needed for their right functioning.",
                "",
                "(2) A human being, an animal, a",
                " plant, mineral and the like, air, water",
                " and light-everything has been given that particular",
                " form which was needed for its right",
                " functioning in the universe.",
                "(3) Then He",
                " has guided everything aright to function properly.",
                " It is He Who has taught everything",
                " the way to fulfil that object for",
                " which it has been created. He has",
                " taught the ear to hear and the",
                " eye to see; the fish to swim",
                " and the swallow to fly; the earth",
                " to grow vegetation and the tree to",
                " blossom and bear fruit. In short, He",
                " is not only the Creator of everything",
                " but also its Guide and Teacher.",
                "Prophet",
                " Moses employed this concise and meaningful sentence",
                " to convey the Message to Pharaoh and",
                " his people. He not only gave a",
                " suitable reply to Pharaoh as to who",
                " his Lord was, but also told him",
                " why He was his Lord, and how",
                " there was no other lord than He.",
                " The argument implied in it was this:",
                " As Pharaoh and every one of his",
                " subjects was obliged to Allah for his",
                " human form and could trot live even",
                " for a moment without the functioning of",
                " the different parts of his body which",
                " were performing their functions in accordance with",
                " the guidance of Allah, so Pharaoh's claim",
                " that he was the lord of the",
                " people was absurd, and its acknowledgment by",
                " his people that he was their Lord,",
                " a folly.",
                "Besides this, Prophet Moses also",
                " hinted at the need of Prophethood which",
                " was denied by Pharaoh. When Allah guides",
                " everything in the universe, He has also",
                " to fulfil the need of the guidance",
                " of mankind. Whereas the guidance of. the",
                " animals and birds has been provided by",
                " instinct, the guidance of rational human beings",
                " has been provided by sending Messengers who",
                " appealed to them by rational arguments."
            ]
        },
        {
            "verse-id": "[20:51]",
            "verse": "[Pharaoh] said, \"Then what is the case of the former generations?\"",
            "description": [
                "The question posed by Pharaoh was very",
                " subtle. He meant to say, \"If there",
                " is no other lord than the One",
                " Who has given a distinctive form to",
                " everyone, then what will be the position",
                " of our forefathers who had been worshipping",
                " other deities since centuries? Were all those",
                " people in error? Did all of them",
                " deserve torment'? Did they all lack common",
                " sense ?\" Thus Pharaoh perhaps wanted to",
                " give vent to his anger against Prophet",
                " Moses for showing disrespect to his forefathers.",
                " At the same time he also wanted",
                " to incite his courtiers and the common",
                " people of Egypt against the Message of",
                " Prophet Moses. And this trick has always",
                " been used against the people who propagate",
                " the Truth and has always proved very",
                " effective to incite those people who lack",
                " common sense. This same trick has been",
                " mentioned here for it was being employed",
                " at the very time against the Holy",
                " Prophet by the people of Makkah."
            ]
        },
        {
            "verse-id": "[20:52]",
            "verse": "[Moses] said, \"The knowledge thereof is with my Lord in a record. My Lord neither errs nor forgets.\"",
            "description": [
                "This answer is full of wisdom. If",
                " Prophet Moses had said, \"Yes, they all",
                " lacked common sense and had gone astray",
                " and would become the fuel of Hell\",",
                " this answer, though true, would have served",
                " the very purpose Pharaoh had in mind",
                " in putting the question. But the answer",
                " given by the Prophet was true and",
                " it frustrated the trick of Pharaoh as",
                " well. His answer was to this effect:",
                " \"Well, those people have now gone before",
                " their Lord, and I have no means",
                " of judging their deeds and intentions. However,",
                " their whole record is safe and secure",
                " with Allah, and nothing can escape Him.",
                " Allah alone knows how to deal with",
                " them. What concerns you and me is",
                " our own position and attitude to life.",
                " We should be more concerned about our",
                " own end than of those who have",
                " already passed away into Allah's presence.\""
            ]
        },
        {
            "verse-id": "[20:53]",
            "verse": "[It is He] who has made for you the earth as a bed [spread out] and inserted therein for you roadways and sent down from the sky, rain and produced thereby categories of various plants.",
            "description": [
                "It is quite obvious that vv, 53-55",
                " are an addition by Allah to the",
                " foregoing answer by Prophet Moses. There are",
                " other instances of this in the Qur'an",
                " that Allah added a few sentences to",
                " the speech of someone by way of",
                " admonition. Moreover, it is connected not only",
                " with the preceding verse but also with",
                " the whole reply of Prophet Moses (vv.",
                " 50-52)."
            ]
        },
        {
            "verse-id": "[20:54]",
            "verse": "Eat [therefrom] and pasture your livestock. Indeed, in that are signs for those of intelligence.",
            "description": [
                "That is, \"Those, who use their common",
                " sense in their search for the Truth,",
                " find a way to the Reality by",
                " the help of these Signs, which clearly",
                " show that the universe has One Lord",
                " Who alone is sustaining it, and there",
                " is no room here for any other",
                " lord.\""
            ]
        },
        {
            "verse-id": "[20:55]",
            "verse": "From the earth We created you, and into it We will return you, and from it We will extract you another time.",
            "description": [
                "That is, \"Every man has to pass",
                " through three stages: (1) from birth to",
                " death, (2) from death to Resurrection, and",
                " (3) from the Day of Resurrection to",
                " Eternity. According to this verse, all the",
                " three stages will take place on this",
                " Earth."
            ]
        },
        {
            "verse-id": "[20:56]",
            "verse": "And We certainly showed Pharaoh Our signs - all of them - but he denied and refused.",
            "description": [
                "\"Signs\" comprised those arguments which were based",
                " on natural phenomena and human life and",
                " those miracles which were given to Prophet",
                " Moses. These arguments are contained in the",
                " speeches of Prophet Moses which he delivered",
                " before Pharaoh, and the miracles which he",
                " showed and are mentioned at several places",
                " in the Qur'an."
            ]
        },
        {
            "verse-id": "[20:57]",
            "verse": "He said, \"Have you come to us to drive us out of our land with your magic, O Moses?",
            "description": [
                "Here by sorcery are meant the miracles",
                " of the staff and the shining hand,",
                " which according to the details given in",
                " Chapters VII and XXVI, were shown to",
                " Pharaoh by Prophet Moses in his first",
                " visit to his court. On seeing these",
                " miracles Pharaoh was so upset that he",
                " cried out, \"Have you come to drive",
                " us out of .our country by the",
                " power of your sorcery? although he knew",
                " that it had never happened in history",
                " that a magician had conquered a country",
                " by the power of sorcery. Moreover, there",
                " were hundreds of magicians in his own",
                " country, who used to show their feats",
                " to earn rewards and prizes. Accordingly, Pharaoh's",
                " statement that \"you are a sorcerer\" on",
                " the one hand, and his apprehension that",
                " \"you want to snatch my kingdom\" on",
                " the other, were a clear indication of",
                " his perturbed mind: In fact, Pharaoh had",
                " come to understand that the welt-reasoned speech",
                " of Moses and his miracles were bound",
                " to influence not only his courtiers, but",
                " also the common people and accordingly he",
                " tried to play upon their prejudices through",
                " falsehood and treachery. He did not admit",
                " that it was a miracle, but called",
                " it sorcery. He wanted to create an",
                " impression that any sorcerer of his empire",
                " could turn a staff into a serpent.",
                " He also incited the people, saying: \"Look!",
                " he says that your forefathers were on",
                " the wrong way and deserved perdition. So",
                " beware of him! He is not a",
                " Prophet. He simply aspires for power. He",
                " wants that the Israelites should again capture",
                " power here like the times of Joseph",
                " and wrest the reigns of government from",
                " the Copts.\" Pharaoh, in fact, wanted to",
                " suppress the invitation to the Truth through",
                " such devices. (For details please see E.N.'s",
                " 87 to 89 of Chapter VII; E.N.",
                " 75 of Chapter X)."
            ]
        },
        {
            "verse-id": "[20:58]",
            "verse": "Then we will surely bring you magic like it, so make between us and you an appointment, which we will not fail to keep and neither will you, in a place assigned.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:59]",
            "verse": "[Moses] said, \"Your appointment is on the day of the festival when the people assemble at mid-morning.\"",
            "description": [
                "The object of Pharaoh was this: \"Once",
                " the sorcerers are able to transform the",
                " staffs and ropes into serpents, the entire",
                " effect of the miracle performed by Moses",
                " would disappear from the people's minds. That",
                " was exactly to Moses' advantage, who suggested",
                " that it was no good fixing an",
                " ordinary day or place for the purpose.",
                " The Day of the Feast was at",
                " hand. People would flock on that occasion",
                " from all corners of the empire. Therefore,",
                " the encounter should be held in the",
                " open so that all might witness it,",
                " and in the day time so that",
                " every one should be able to see",
                " it clearly.\""
            ]
        },
        {
            "verse-id": "[20:60]",
            "verse": "So Pharaoh went away, put together his plan, and then came [to Moses].",
            "description": [
                "Pharaoh and his courtiers considered the coming",
                " encounter as a decisive one as far",
                " as their own future was concerned and,",
                " therefore, they attached the utmost importance to",
                " it. Courtiers were sent throughout the country",
                " to muster round all the magicians wherever",
                " available. People were especially encouraged to come",
                " in the largest numbers to witness the",
                " magic skills so as to keep them",
                " immune From the awe inspired by the",
                " staff of Moses. It was openly said",
                " that the fate of their religion hinged",
                " on the skill of their magicians: their",
                " religion could survive only if they won;",
                " otherwise the religion of Moses would have",
                " its sway (see XXVI: 34-51).",
                "Here one",
                " should bear in mind the fact that",
                " the religion of the royal family and",
                " the elite of Egypt was much different",
                " from that of the common people. They",
                " had separate gods and temples and different",
                " creeds and concepts about the life after",
                " death. They also differed in the practice",
                " of religion as well as in the",
                " ideologies. (Toynbee: A Study of History: Somervell's",
                " Abridgment Vols. I-VI, pp. 31-32). Moreover, there",
                " were sufficiently strong pockets of the population,",
                " who under the influence of various religious",
                " upheavels, were prone to prefer Monotheism to",
                " a creed of polytheism. Besides this, there",
                " was also a fairly large element of",
                " the worshippers of One God for the",
                " Israelites and their fellow believers were at",
                " least ten per cent of the total",
                " population. Pharaoh also remembered that about 150",
                " years earlier a religious revolution had been",
                " brought about by Pharaoh Amenophis IV or",
                " Akhenaton (1377-1360 B.C.) by military force, which",
                " had abolished all deities except Aton, a",
                " single, universal god, which was worshipped by",
                " the king and his family. Though this",
                " religious revolution had been reversed later by",
                " another king, yet its influence retrained, and",
                " Pharaoh dreaded that Moses might bring about",
                " yet another revolution."
            ]
        },
        {
            "verse-id": "[20:61]",
            "verse": "Moses said to the magicians summoned by Pharaoh, \"Woe to you! Do not invent a lie against Allah or He will exterminate you with a punishment; and he has failed who invents [such falsehood].\"",
            "description": [
                "The \"adversaries\" whom Prophet Moses addressed were",
                " Pharaoh and his courtiers who had dubbed",
                " him as a \"sorcerer\", and not the",
                " common people, who had yet to see",
                " the encounter between him and the magicians.",
                "",
                "*34) \"The falsehoods\" were that they had",
                " dubbed Allah's Messenger as a \"sorcerer\" and",
                " his miracles as \"a piece of sorcery\".",
                ""
            ]
        },
        {
            "verse-id": "[20:62]",
            "verse": "So they disputed over their affair among themselves and concealed their private conversation.",
            "description": [
                "This shows that those people felt in",
                " their hearts that their position was weak",
                " and knew that the miracle shown by",
                " Prophet Moses was not a piece of",
                " magic. Therefore, they had come for the",
                " encounter with hesitation and fear. But when",
                " the timely, sudden warning of Prophet Moses",
                " shook them to the core, they began",
                " to debate the wisdom of holding the",
                " encounter on the Feast Day in an",
                " open place in the broad day light.",
                " For they thought that if they were",
                " defeated in the presence of the common",
                " people, all would come to know of",
                " the difference between magic and a miracle",
                " and they would lose the battle once",
                " for all."
            ]
        },
        {
            "verse-id": "[20:63]",
            "verse": "They said, \"Indeed, these are two magicians who want to drive you out of your land with their magic and do away with your most exemplary way.",
            "description": [
                "Those who were of this view must",
                " have been a few fanatics of Pharaoh's",
                " party-who were prepared to go to any",
                " extent to oppose Prophet Moses. Those hot-headed",
                " people must have been preparing the public",
                " for a determined encounter, while the saner",
                " and experienced among them must have been",
                " advising caution and restraint.",
                "*37) Probably those",
                " people based their argument on two things:",
                "",
                "(1) If their magicians were also able",
                " to turn their staffs into serpents, it",
                " would be a clear proof that Moses",
                " too was a sorcerer.",
                "(2) If, on",
                " the other hand, Moses won, the rulers",
                " would lose their country, and their ideal",
                " way of life, which reflected their culture,",
                " their arts, their civilization, their recreations, etc.",
                " would automatically come to an end. Therefore",
                " they should do all they could to",
                " defeat Moses."
            ]
        },
        {
            "verse-id": "[20:64]",
            "verse": "So resolve upon your plan and then come [forward] in line. And he has succeeded today who overcomes.\"",
            "description": [
                "They also urged them to present a",
                " united front and not to show their",
                " differences on the very occasion of the",
                " encounter. For, they argued, any hesitation and",
                " secret consultation before the very eyes of",
                " the public would show that they did",
                " not consider themselves to be in the",
                " right."
            ]
        },
        {
            "verse-id": "[20:65]",
            "verse": "They said, \"O Moses, either you throw or we will be the first to throw.\"",
            "description": [
                "That confidence was subsequently restored among Pharaoh's",
                " party by the speech of the head-strong",
                " people, and the magicians were asked to",
                " come iota the field for the encounter,",
                " has been omitted."
            ]
        },
        {
            "verse-id": "[20:66]",
            "verse": "He said, \"Rather, you throw.\" And suddenly their ropes and staffs seemed to him from their magic that they were moving [like snakes].",
            "description": [
                "'In V11: 116, it was stated: \"When",
                " they threw down their devices they bewitched",
                " the eyes of the people and filled",
                " their hearts with terror.\" Here it is",
                " stated that it was not the common",
                " people alone who were terrified by their",
                " magic but Prophet Moses too suffered from",
                " its effect. He not only seemed to",
                " see that the staffs and cords were",
                " running about like serpents but he also",
                " felt a dread of them."
            ]
        },
        {
            "verse-id": "[20:67]",
            "verse": "And he sensed within himself apprehension, did Moses.",
            "description": [
                "It appears that no sooner did Prophet",
                " Moses say, \"Cast down\", than the magicians",
                " immediately cast their staffs and cords and",
                " it seemed as if hundreds of serpents",
                " were running towards him, and he instinctively",
                " felt e dread of them. And there",
                " is nothing strange in this because a",
                " Prophet is after all a human being.",
                " Besides this, it is also possible that",
                " Prophet Moses apprehended that the demonstration of",
                " the magic might create a misunderstanding among",
                " the people about his miracle.",
                "This is",
                " also a proof that a Prophet too",
                " can be influenced by magic to a",
                " certain extent like the common people, though",
                " magicians have no power to produce any",
                " effect on his Prophethood or interfere with",
                " Revelation, or misguide hint. Therefore there is",
                " no reason why one should consider as",
                " false those traditions in which it has",
                " been stated that the Holy Prophet suffered",
                " temporarily from the effect of magic."
            ]
        },
        {
            "verse-id": "[20:68]",
            "verse": "Allah said, \"Fear not. Indeed, it is you who are superior.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:69]",
            "verse": "And throw what is in your right hand; it will swallow up what they have crafted. What they have crafted is but the trick of a magician, and the magician will not succeed wherever he is.\"",
            "description": [
                "This is capable of two interpretations: (1)",
                " the staff, which was turned into a",
                " dragon by a miracle, actually swallowed up",
                " all the staffs and cords which had",
                " been trade to appear as serpents. (2)",
                " The dragon of the staff did not",
                " actually swallow up the serpents of the",
                " magicians but wiped out the effect of",
                " their magic from these things and they",
                " again became ordinary cords and staffs. We",
                " prefer the second interpretation because the wording",
                " of VII: 117 and XXVI: 45 is",
                " this: \"It swallowed up their false magic\",",
                " and here the wording is: \"It will",
                " swallow up all their sham creation\". Obviously,",
                " the staffs and cords were not their",
                " creation but the tragic which had made",
                " them appear like serpents."
            ]
        },
        {
            "verse-id": "[20:70]",
            "verse": "So the magicians fell down in prostration. They said, \"We have believed in the Lord of Aaron and Moses.\"",
            "description": [
                "When they saw the power of the",
                " staff of Moses, they involuntarily fell prostrate",
                " as if some one had trade them",
                " do so, because they were convinced that",
                " it was a miracle and not a",
                " feat of tragic.",
                "*44) This profession of",
                " faith by the magicians shows that every",
                " one was aware of the basic object",
                " of the encounter. It was not an",
                " encounter between the feats of the magicians",
                " and those of Prophet Moses, but it",
                " was to decide whether the claim of",
                " Prophet Moses that he was a Messenger",
                " of Allah was true or not. If",
                " this staff was actually turned into a",
                " dragon, it was by means of a",
                " miracle. On the other hand, Pharaoh intended",
                " to prove by the feats of his",
                " magicians that it was not a miracle",
                " but a feat of magic. Incidentally, this",
                " also shows that Pharaoh and his magicians",
                " and the common people fully understood the",
                " distinction between a miracle and a feat",
                " of magic. ,That is why when the",
                " magicians saw that it was a miracle",
                " shown by the power of Allah which",
                " had exposed their magic, they did not",
                " say that Moses was a more skilful",
                " magician, but straightway fell prostrate, saying, \"We",
                " believe in the Lord of Aaron and",
                " Moses.\"",
                "It is obvious that the defeat",
                " turned the tables on Pharaoh who had",
                " himself arranged the encounter \"to expose\" Prophet",
                " Moses. He had mustered all his magicians",
                " with a view to demonstrating before the",
                " public that there was nothing extraordinary in",
                " turning a staff into a serpent for",
                " this could be done by every magician.",
                " But the defeat of the magicians and",
                " their acknowledgment testified that Moses was real]y",
                " a Messenger of Allah and the transformation",
                " of the staff was not a feat",
                " of magic but a miracle."
            ]
        },
        {
            "verse-id": "[20:71]",
            "verse": "[Pharaoh] said, \"You believed him before I gave you permission. Indeed, he is your leader who has taught you magic. So I will surely cut off your hands and your feet on opposite sides, and I will crucify you on the trunks of palm trees, and you will surely know which of us is more severe in [giving] punishment and more enduring.\"",
            "description": [
                "In VII : 123, it has been",
                " stated : \"Indeed it was a plot",
                " you conspired in the city to ,deprive",
                " the rightful owners of their power.\" Here",
                " the same thing has been further explained,",
                " as if to say, \"It is not",
                " merely a plot between you and him",
                " but it appears that Moses is your",
                " master and leader. You conspired beforehand that",
                " you would be defeated by your master",
                " in the encounter to prove that he",
                " was a Messenger who had shown the",
                " miracle of the staff to frustrate your",
                " magic and bring about a political revolution",
                " in the country. \"",
                "*46) That is,",
                " \"Right hand and left foot or via",
                " versa. \"",
                "*47) This was a very",
                " cruel way of punishment in ancient times.",
                " They fixed a long pole in the",
                " ground or used the trunk of a",
                " tree for this purpose. Then a piece",
                " of wood was tied across it at",
                " the top. Then the hands of the",
                " criminal were nailed on to it and",
                " he was left hanging there for hours",
                " to die a slow, painful death.",
                "*48)",
                " This was the last trick played by",
                " Pharaoh to win the losing game. He",
                " held out the threat of a cruel",
                " punishment in order to coerce them to",
                " admit that there really was a conspiracy",
                " between Prophet Moses and them against the",
                " kingdom.But the fortitude and determination of the",
                " magicians turned the tables on him. The",
                " very fact that, they were ready to",
                " endure the terrible punishment proved to the",
                " world that they had sincerely believed in",
                " the Prophethood of Moses and that the",
                " charge of conspiracy was an impudent trick",
                " that had been invented as a device.",
                ""
            ]
        },
        {
            "verse-id": "[20:72]",
            "verse": "They said, \"Never will we prefer you over what has come to us of clear proofs and [over] He who created us. So decree whatever you are to decree. You can only decree for this worldly life.",
            "description": [
                "'It may also be interpreted like this:",
                " \"It cannot be that we should prefer",
                " you to these plain Signs which have",
                " come before us and to that Being",
                " Who has created us.\""
            ]
        },
        {
            "verse-id": "[20:73]",
            "verse": "Indeed, we have believed in our Lord that He may forgive us our sins and what you compelled us [to do] of magic. And Allah is better and more enduring.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:74]",
            "verse": "Indeed, whoever comes to his Lord as a criminal - indeed, for him is Hell; he will neither die therein nor live.",
            "description": [
                "This is a saying of Allah, which",
                " has been added to the foregoing words",
                " of the magicians.",
                "*51) This is the",
                " most terrible of all the punishments that",
                " have been mentioned in the Qur'an. The",
                " criminal will prefer death to the horrible",
                " life in Hell, but death will not",
                " come to him. He will remain in",
                " that state of agony without any hope",
                " of relief from it."
            ]
        },
        {
            "verse-id": "[20:75]",
            "verse": "But whoever comes to Him as a believer having done righteous deeds - for those will be the highest degrees [in position]:",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:76]",
            "verse": "Gardens of perpetual residence beneath which rivers flow, wherein they abide eternally. And that is the reward of one who purifies himself.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:77]",
            "verse": "And We had inspired to Moses, \"Travel by night with My servants and strike for them a dry path through the sea; you will not fear being overtaken [by Pharaoh] nor be afraid [of drowning].\"",
            "description": [
                "Here the details of the events which",
                " happened during the long period of Prophet",
                " Moses' stay in Egypt have been omitted.",
                " For these please see VII: 130-147, X:",
                " 83-92, XL: 23-5O and XLIII: 46-56.",
                "*53)",
                " This happened when God at last appointed",
                " a night for the exodus of the",
                " lsraelites and the other Muslims from Egypt.",
                " They were asked to gather at a",
                " fixed place and set forth as a",
                " caravan. Just at the time when they",
                " reached the coast of the Red Sea",
                " Prom where they had to cross to",
                " the Sinai Peninsula, Pharaoh arrived there with",
                " a large army in their pursuit. We",
                " learn from XXVI: 61 -63 that when",
                " they were literally between the devil and",
                " the deep sea, Allah commanded Moses to",
                " smite the sea with his staff and",
                " according to this verse the sea tore",
                " asunder and stood like two high walls",
                " on both sides, leaving a dry path",
                " between them for the caravan to pass.",
                " Thus, it is quite clear and plain",
                " that it was a miracle, and not",
                " the result of a wind storm or",
                " tide, for when the water rises in",
                " this way it does not remain standing",
                " like two high walls, leaving a dry",
                " path between them. ( For details see",
                " E.N. 47 of Chapter XXVI)."
            ]
        },
        {
            "verse-id": "[20:78]",
            "verse": "So Pharaoh pursued them with his soldiers, and there covered them from the sea that which covered them,",
            "description": [
                "According to XXVI: 64-66, Pharaoh with his",
                " hosts. followed the caravan on the dry",
                " path and they were all drowned. In",
                " II :50, it has been stated that",
                " the Israelites had reached the other shore",
                " and saw them drowning in the sea.",
                " From X: 90-92, we learn that Pharaoh",
                " professed to believe in God while he",
                " was drowning but this was rejected by",
                " God and he was told that his",
                " dead body would he preserved for the",
                " coming generations to serve as a lesson",
                " for them."
            ]
        },
        {
            "verse-id": "[20:79]",
            "verse": "And Pharaoh led his people astray and did not guide [them].",
            "description": [
                "This was a subtle warning to the",
                " disbelievers of Makkah, as if to say,",
                " \"Your chiefs and leaders are leading you",
                " on the same way on which Pharaoh",
                " led his people; now you may yourselves",
                " see that he did not guide them",
                " aright.\"",
                "In conclusion, it will be worth",
                " while to consider the version as given",
                " in the Bible, for this will make",
                " it plain that it is absolutely false",
                " and ridiculous to say that the Qur'an",
                " has copied these stories from the Israelite",
                " traditions. We learn from Exodus the following:",
                "",
                "(1) According to 4: 2-5, the miracle",
                " of the staff was given to Prophet",
                " Moses, and in 4:17 he was instructed:",
                " \"And thou shalt take this rod in",
                " throe hand, wherewith thou shalt do signs\",",
                " but according to 7: 9, the same",
                " rod was transferred to Prophet Aaron and",
                " then it remained with him to work",
                " miracles.",
                "(2) The first dialogue between Prophet",
                " Moses and Pharaoh has been given in",
                " Chapter 5, but there is no mention",
                " in it whatever of the Doctrine of",
                " Tauhid presented by Moses. In answer to",
                " Pharaoh's question: \"Who is the Lord that",
                " I should obey his voice to let",
                " Israel go? I know not the Lord\",",
                " Moses and Aaron merely said, \"The God",
                " of the Hebrews hath met with us\".",
                " (5: 2-3).",
                "(3) The encounter with the",
                " magicians has been summed up in a",
                " few sentences thus: \"And the Lord spake",
                " unto Moses and unto Aaron, saying, When",
                " Pharaoh shall speak unto you, saying, Shew",
                " a miracle for you: then thou shalt",
                " say unto Aaron, Take thy rod, and",
                " cast it before Pharaoh, and it shall",
                " become a serpent. And Moses and Aaron",
                " went in unto Pharaoh, and they did",
                " so as the Lord had commanded: and",
                " Aaron cast down his rod before Pharaoh,",
                " and before his servants, and it became",
                " a serpent. Then Pharaoh also called the",
                " wise men and the sorcerers: now the",
                " magicians of Egypt, they also did in",
                " like manner with their enchantments. For they",
                " cast down every man his rod, and",
                " they became serpents: but Aaron's rod swallowed",
                " up their rods.\" (7' 8-12)",
                "When we",
                " compare this with the version of it",
                " in the Qur'an, it becomes obvious that",
                " the description in the Bible lacks the",
                " real essence of the whole encounter, for",
                " it dces not mention that the encounter",
                " took place on the Day of the",
                " Feast in the open as a result",
                " of a regular challenge, and there is",
                " no mention at all that the magicians",
                " became believers in the Lord of Moses",
                " and Aaron and remained steadfast in their",
                " faith even in face of terrible threats.",
                "",
                "(4) According to the Qur'an, Prophet Moses",
                " demanded full freedom and liberty for the",
                " Israelites, but according to the Bible his",
                " demand was only this: \"Let us go,",
                " we pray thee, three days' journey into",
                " the desert, and sacrifice unto the Lord",
                " our God. \" (5:3)",
                "(5) In Chapters",
                " 11 to 14, the details of the",
                " events concerning the exodus from Egypt to",
                " the drowning of Pharaoh have been given.",
                " Though these contain some useful information and",
                " details about the events which have been",
                " briefly described in the Qur'an, they contain",
                " some strange contradictions as well. For instance,",
                " in 14:15-16 the staff (rod) again comes",
                " into the hands of Prophet Moses, who",
                " is commanded: \".... Iift thou up thy",
                " rod, and stretch out throe hand over",
                " the sea, and divide it; and the",
                " children of Israel shall go on dry",
                " ground through the midst of the sea.\"",
                " But in w. 21 -22, it is",
                " said: \"And Moses stretched out his hand",
                " over the sea; and the Lord caused",
                " the sea to go back by a",
                " strong east wind all the night, and",
                " made the sea dry /and, and the",
                " waters were divided. And the children of",
                " Israel went into the midst of the",
                " sea upon the dry ground.' and the",
                " waters were a wall unto them, on",
                " their right hand, and on their left.",
                " \" It is not clear whether the",
                " sea was divided by a miracle or",
                " by a strong \"east wind\" which incidentally",
                " has never been known to divide the",
                " sea into two parts leaving a dry",
                " path between them.",
                "It will also be",
                " worth while to make a study of",
                " these events as given in the Talmud.",
                " The Talmudic account differs from the Biblical",
                " version but is nearer to the one",
                " given in the Qur'an. A comparative study",
                " of the two clearly shows that the",
                " one is based on direct Revelation from",
                " Allah and the other on centuries old",
                " oral traditions which have been handed down",
                " from one generation to the other and",
                " thus considerably tampered with. (See H. Polano:",
                " The Talmud Selections, pp. 150-154)."
            ]
        },
        {
            "verse-id": "[20:80]",
            "verse": "O Children of Israel, We delivered you from your enemy, and We made an appointment with you at the right side of the mount, and We sent down to you manna and quails,",
            "description": [
                "The part of the story relating to",
                " their journey from the Red Sea to",
                " the toot of Mount Tur has been",
                " omitted. This has already been given in",
                " VII:138-147. It has also been stated there",
                " that the Israelites said to Moses, \"O",
                " Moses, make a god also for us",
                " like the gods these people have\". (See",
                " VII:138 and its E.N. 98).",
                "*57) That",
                " is, on the eastern side of Tur",
                "",
                "*58) According to II: 51 and VII:",
                " 142, Prophet Moses and the chiefs of",
                " the Israelites were summoned to Mount Tur",
                " for receiving the Divine Commandments on stone",
                " tablets for the guidance of the people.",
                " (See E.N. 71 of Chapter II).",
                "*59)",
                " For details please see E.N. 73 of",
                " Chapter II and E.N. 119 of Chapter",
                " VII. According to the Bible, manna and",
                " salva started being provided to the Israelites",
                " when they were passing through the wilderness",
                " between Elim and Sinai. According to Exodus,",
                " manna and salva were sent down thus:",
                "",
                "\"And it came to pass, that at",
                " even the quails came up, and covered",
                " the camp: and in the morning the",
                " dew lay round about the host. And",
                " when the dew that lay was gone",
                " up, behold upon the face of the",
                " wilderness there lay a small round thing,",
                " as small as the hoar frost on",
                " the ground. And when the children of",
                " Israel saw it, they said one to",
                " another, It is manna: for they wist",
                " not what it was. And Moses said",
                " unto them, This is the bread which",
                " the Lord hath given you to eat",
                " .....And the house of Israel called the",
                " name thereof Manna: and it was like",
                " coriander seed, white; and the taste of",
                " it was like wafers made with honey.\"",
                " (16: 13-15, 31).",
                "In Numbers, the following",
                " details have been given:",
                "\"And the people",
                " went about, and gathered it, and ground",
                " it in mills, or beat it in",
                " a mortar, and baked it in pans,",
                " and made cakes of it: and the",
                " taste of it was as the taste",
                " of fresh oil. And when the dew",
                " fell upon the camp in the bight,",
                " the manna fell upon it.\" (11: 8-9).",
                ""
            ]
        },
        {
            "verse-id": "[20:81]",
            "verse": "[Saying], \"Eat from the good things with which We have provided you and do not transgress [or oppress others] therein, lest My anger should descend upon you. And he upon whom My anger descends has certainly fallen.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:82]",
            "verse": "But indeed, I am the Perpetual Forgiver of whoever repents and believes and does righteousness and then continues in guidance.",
            "description": [
                "According to this verse (82), there are",
                " four conditions for forgiveness:",
                "(1) Repentance: to",
                " refrain from rebellion, disobedience, shirk or disbelief.",
                "",
                "(2) Faith: sincere belief in Allah and",
                " the Messenger and the Book and the'",
                " Hereafter.",
                "(3) Righteous works : to do",
                " good deeds according to the instructions of",
                " Allah and His Messenger.",
                "(4) Guidance: to",
                " follow the right way steadfastly and to",
                " refrain from straying into any wrong path.",
                ""
            ]
        },
        {
            "verse-id": "[20:83]",
            "verse": "[Allah] said, \"And what made you hasten from your people, O Moses?\"",
            "description": [
                "From here the same account is resumed",
                " that was interrupted by the parenthesis (vv.",
                " 81-82). The Israelites were told to stay",
                " on the right side of Mount Tur,",
                " and they would be given the Commandments",
                " after forty days.",
                "*62) This shows that",
                " in his eagerness to see his Lord",
                " as soon as possible, Prophet Moses had",
                " left them in the way and reached",
                " the meeting place alone. For the details",
                " of that meeting the reader should see",
                " VII: 143-145. Here only that portion has",
                " been mentioned which is connected with the",
                " calf-worship by the Israelites. This has been",
                " stated here to bring home to the",
                " disbelievers of Makkah how idol-worship starts and",
                " how deeply a Prophet of Allah is",
                " concerned about this evil."
            ]
        },
        {
            "verse-id": "[20:84]",
            "verse": "He said, \"They are close upon my tracks, and I hastened to You, my Lord, that You be pleased.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:85]",
            "verse": "[Allah] said, \"But indeed, We have tried your people after you [departed], and the Samiri has led them astray.\"",
            "description": [
                "It is obvious from the last letter",
                " `ya' that Samiri was not the proper",
                " name of the person, for this Arabic",
                " letter is always added to show a",
                " person's connection with his race or clan",
                " or place. Moreover, the prefix `al' (definite",
                " article 'the') in the original Arabic text",
                " clearly denotes that the Samiri was a",
                " particular man from among many other persons",
                " of the same race or clan or",
                " place, who had propagated (he worship of",
                " the golden calf. In fact, this does",
                " not require any further explanation than this,",
                " but this has been necessitated because many",
                " Christian missionaries and the Western Orientalists have",
                " tried to criticise the Holy Prophet and",
                " the Qur'an on this account. They say,",
                " (God forbid,) \"This is a proof of",
                " the grievous ignorance of history on the",
                " part of Muhammad, the author of the",
                " Qur'an, and is one of the anachronisms",
                " of the Qur'an.\" They base this absurd",
                " criticism on the assumption that this Samiri",
                " was the inhabitant of Samaria, the capital",
                " of the ancient kingdom of Israel, which",
                " was built in 925 B.C. long after",
                " this happening; then centuries after this, a",
                " generation of the Samaritans came into existence",
                " as a result of inter-marriage between the",
                " Israelites and the non-Israelites. As the Samaritans",
                " worshipped the golden calf, the critics accuse",
                " the Holy Prophet of inventing this story",
                " on the basis of mere hearsay. They",
                " say that the Holy Prophet might have",
                " heard something like this from the neighbouring",
                " Jews and inserted it in the Qur'an.",
                " This is not all. They also criticise",
                " that Haman who was a courtier of",
                " Cyrus has been mentioned in the Qur'an",
                " as a minister of Pharaoh. It is",
                " a pity that these so-called scholars seem",
                " to think that in the ancient times",
                " there used to be only one person",
                " bearing one name in a clan or",
                " a place, and there was absolutely no",
                " possibility of another person or persons having",
                " the same name. They do not know,",
                " or pretend they do not know, that",
                " during the time of Prophet Abraham, a",
                " famous people known as the Sumerians inhabited",
                " 'Iraq and the neighbouring regions, and it",
                " is just possible that during the time",
                " of Prophet Moses there were some people",
                " known as the Samiris who might have",
                " migrated to Egypt from 'Iraq. Besides this,",
                " according to the Bible (1 Kings, 16:",
                " 24), Samaria itself was built on a",
                " hill which was bought from Shemer and",
                " named Samaria after him. This is a",
                " clear proof that there were people named",
                " Shemer (or Sumer) even before Samaria came",
                " into existence and it is also just",
                " possible that some clans might have been",
                " called \"Samiri\""
            ]
        },
        {
            "verse-id": "[20:86]",
            "verse": "So Moses returned to his people, angry and grieved. He said, \"O my people, did your Lord not make you a good promise? Then, was the time [of its fulfillment] too long for you, or did you wish that wrath from your Lord descend upon you, so you broke your promise [of obedience] to me?\"",
            "description": [
                "That is, \"Did not Allah fulfil the",
                " promises He made with you of showing",
                " His favours to you? For instance, He",
                " safely brought you out of Egypt and",
                " not only freed you from the slavery",
                " of your enemy but also destroyed him",
                " totally. He provided you with provisions in",
                " the desert and in the mountainous regions.\"",
                " It may also be translated like this:",
                " \"Did not Allah make a good promise",
                " with you?\" In that case, it will",
                " mean: \"He made a promise that he",
                " will give you the Law and Guidance:",
                " was this not a good promise for",
                " your well being and betterment?\"",
                "*65) That",
                " is,\"Had a long time passed since those",
                " great favours were done to you that",
                " you forgot them? Had long ages passed",
                " since you were afflicted with persecution by",
                " your enemy that you committed such a",
                " blasphemy?\" It may also be translated like",
                " this : Had you to wait for",
                " a long time for the fulfilment of",
                " God's promise .that you became so impatient?\"",
                " In that case, the meaning is obvious:",
                " \"You had not to wait for a",
                " long time to see the fulfillment of",
                " the promise of Guidance. Therefore there was",
                " no excuse for what you did.\"",
                "*66)",
                " This Covenant was the one which every",
                " community makes with its Prophet and promises",
                " that it will steadfastly follow the Guidance",
                " brought by him and will not worship",
                " anyone except Allah."
            ]
        },
        {
            "verse-id": "[20:87]",
            "verse": "They said, \"We did not break our promise to you by our will, but we were made to carry burdens from the ornaments of the people [of Pharaoh], so we threw them [into the fire], and thus did the Samiri throw.\"",
            "description": [
                "This excuse was put forward by those",
                " people who were involved in the shirk",
                " fabricated by the Samiri. They meant to",
                " say, \"We did not throw down the",
                " ornaments with the intention of setting up",
                " a calf nor did we know what",
                " was going to be made of these,",
                " but when the calf was brought before",
                " us, we involuntarily got involved in shirk.",
                " \" The Arabic text which we have",
                " translated into: \"We felt burdened with the",
                " ornaments of the people\", simply means this:",
                " \"The heavy ornaments which our men and",
                " women were wearing like the Egyptians proved",
                " very burdensome to us in our wanderings",
                " in the desert and we did not",
                " know how to get rid of them",
                " for it appeared very difficult for us",
                " to travel in the desert with them.\"",
                " But according to the Bible these ornaments",
                " had been borrowed by every family of",
                " the Israelites from their Egyptian neighbours with",
                " this intention, \"....and ye shall put them",
                " upon your sons, and upon your daughters",
                " and ye shall spoil the Egyptians....and let",
                " every man borrow of his neighbour, and",
                " every woman of her neighbour, jewels of",
                " silver, and jewels of gold....And the Lord",
                " gave the people favour in the sight",
                " of the Egyptians....so that they lent unto",
                " them such things as they required. And",
                " they spoiled the Egyptians.\" And that, too,",
                " on the advice of Prophet Moses, whom",
                " God Himself had instructed to do this",
                " \"noble deed.\" (Exodus, 3: 1422, 11 :",
                " 2-3, and I 2 : 35-36).",
                "It",
                " is a pity that some of our",
                " commentators have interpreted this verse in the",
                " light of the above traditions of the",
                " Bible. They say that the Israelites felt",
                " burdened with the weight of those ornaments",
                " which they had borrowed from their Egyptian",
                " neighbours, with the intention of carrying them",
                " away as a \"spoil\" bestowed by God.",
                "",
                "We are of the opinion that the",
                " clause of the verse under discussion means",
                " this: \"When the people were tired of",
                " carrying their ornaments on their bodies, they",
                " decided by mutual consultation that all the",
                " ornaments should be gathered at one place",
                " and it should be noted down how",
                " much gold and silver belonged to each",
                " of the owners. Then it should be",
                " melted into bars and rods and placed",
                " on the backs of the beasts of",
                " burden.\" Accordingly, they might have brought their",
                " ornaments and thrown them in the common",
                " heap.",
                "*68) It is obvious from the",
                " context that the answer of the people",
                " ended with \"threw them down\", and Allah",
                " Himself has added the remaining story up",
                " to the end of the paragraph. It",
                " appears from this that the people including",
                " the Samiri went on bringing their ornaments",
                " and throwing them down into the heap",
                " while they were absolutely unaware of what",
                " was going to be done by the",
                " Samiri. After this the Samiri offered his",
                " services to melt it. Then he shaped",
                " it into a calf which lowed like",
                " a cow. Thus the Samiri deluded the",
                " people, saying, \"This god of yours has",
                " come into being by itself for I",
                " had simply thrown the gold in the",
                " fire.\""
            ]
        },
        {
            "verse-id": "[20:88]",
            "verse": "And he extracted for them [the statue of] a calf which had a lowing sound, and they said, \"This is your god and the god of Moses, but he forgot.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:89]",
            "verse": "Did they not see that it could not return to them any speech and that it did not possess for them any harm or benefit?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:90]",
            "verse": "And Aaron had already told them before [the return of Moses], \"O my people, you are only being tested by it, and indeed, your Lord is the Most Merciful, so follow me and obey my order.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:91]",
            "verse": "They said, \"We will never cease being devoted to the calf until Moses returns to us.\"",
            "description": [
                "Here the Qur'an exonerates Prophet Aaron from",
                " the sin of taking any pan in",
                " the calf-worship, but in contrast to this,",
                " the Bible makes him wholly responsible for",
                " making the golden calf and setting it",
                " up as a god. According to Exodus:",
                "",
                "\"And when the people saw that Moses",
                " delayed to come down out of the",
                " mount, the people gathered themselves together unto",
                " Aaron, and said unto him, Up, make",
                " us gods, which shall go before us;",
                " for as for this Moses, the man",
                " that brought us out of the land",
                " of Egypt, we wot not what is",
                " become of him. And Aaron said unto",
                " them, Break off the golden earrings, which",
                " are in the ears of your wives,",
                " of your sons, and of your daughters,",
                " and bring them unto me. And all",
                " the people broke off the golden earrings",
                " which were in their ears, and brought",
                " them unto Aaron. And he received them",
                " at his hand, and fashioned it with",
                " a graying tool, after he had made",
                " it a molten calf: and they said,",
                " These be thy gods, O israel, which",
                " brought thee up out of the land",
                " of Egypt. And when Aaron saw it,",
                " he built an altar. before it; and",
                " Aaron made proclamation, and said, Tomorrow is",
                " a feast to the Lord.\" 1,32: 1-5).",
                "",
                "It is just possible that the real",
                " name of the Samiri was also Aaron",
                " which later on might have misled the",
                " Israelites to attribute the making of the",
                " golden calf to Prophet Aaron. Thus it",
                " is obvious that the Qur'an has shown",
                " a favour to the Jews and Christians",
                " by exonerating Prophet Aaron from the sin,",
                " but it is an irony that the",
                " Christian missionaries and the Orientalists still insist",
                " that the Qur'an is guilty of anachronism",
                " and that the calf was made a",
                " deity of worship by a holy prophet",
                " of ,theirs. In their blind obduracy they",
                " forget that even according to the Bible",
                " this was a great sin. (Exodus, 32:",
                " 21). A little further on in the",
                " same chapter the Bible again contradicts itself.",
                " It says that Prophet Moses ordered the",
                " Levites to kill all their kinsfolk, their",
                " friends and their fellow country men who",
                " had been guilty of the sin of",
                " calf-worship. Accordingly, about three thousand men fell",
                " that day. (Exodus, 32: 27-29).",
                "Now the",
                " question arises: Why was Prophet Aaron not",
                " killed, if he was the inventor of",
                " the calf-worship? Why didn't the Levites ask",
                " Prophet Moses to kill his brother, Prophet",
                " Aaron, who was the real sinner, just",
                " as they were asked to kill theirs.",
                " The Bible also says that after this",
                " Moses went back to the Eternal and",
                " prayed Him to forgive their sins or",
                " blot him out of His list of",
                " the living, and the Eternal answered: \"Whosoever",
                " has sinned against me, him will I",
                " blot out of my book\" (Exodus, 32:",
                " 31-33). But we learn from the Bible",
                " that the name of Prophet Aaron was",
                " not blotted out, but, on the other",
                " hand, he and his sons and his",
                " family were given the charge of the",
                " sanctuary and the office of priesthood (Numbers,",
                " 18: 1-7). Thus it is quite evident",
                " from the internal testimony of the Bible",
                " itself, that it contradicts itself and supports",
                " the Qur'an in its exoneration of Prophet",
                " Aaron."
            ]
        },
        {
            "verse-id": "[20:92]",
            "verse": "[Moses] said, \"O Aaron, what prevented you, when you saw them going astray,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:93]",
            "verse": "From following me? Then have you disobeyed my order?\"",
            "description": [
                "The \"command\" refers to the instructions which",
                " Prophet Moses gave to his brother Aaron",
                " when he made him his deputy in",
                " his absence when he went up to",
                " Mount Tur: \"After me take my place",
                " and do the right and follow not",
                " the way of the mischief-makers\". (VII: 142).",
                ""
            ]
        },
        {
            "verse-id": "[20:94]",
            "verse": "[Aaron] said, \"O son of my mother, do not seize [me] by my beard or by my head. Indeed, I feared that you would say, 'You caused division among the Children of Israel, and you did not observe [or await] my word.' \"",
            "description": [
                "See VII: 150.",
                "*72) It can also",
                " be interpreted like this: \"You did not",
                " wait for orders from me\" In order",
                " to understand fully the statement of Prophet",
                " Aaron, one should read this verse along",
                " with verse 150 of Chapter VII, where",
                " he says: \"Son of my mother, these",
                " people overpowered me and were going to",
                " kill me: so, let not the enemies",
                " gloat over me: do not count the",
                " among the people who have done wrong.\"",
                " Now if both these verses are read",
                " together, one can easily see the true",
                " picture of the event: Prophet Aaron did",
                " his utmost to stop the people from",
                " committing the sin of calf-worship, but they",
                " revolted against him and might even have",
                " killed him. Fearing a clash between them,",
                " therefore, he held his peace lest Prophet",
                " Moses, on his return, might blame him",
                " for letting the situation worsen and failing",
                " to control it effectively in his absence.",
                " The last clause of VII: 150 also",
                " gives the hint that there existed among",
                " the people a good number of the",
                " enemies of the two brothers."
            ]
        },
        {
            "verse-id": "[20:95]",
            "verse": "[Moses] said, \"And what is your case, O Samiri?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:96]",
            "verse": "He said, \"I saw what they did not see, so I took a handful [of dust] from the track of the messenger and threw it, and thus did my soul entice me.\"",
            "description": [
                "here has been a good deal of",
                " divergence of opinion in regard to the",
                " interpretation of this verse. According to the",
                " majority of the early commentators and their",
                " followers, it means: \"The Samiri saw the",
                " Messenger (Angel Gabriel) when he was passing",
                " and took a handful of dust from",
                " his footprints. Then he sprinkled this upon",
                " the idol of the golden calf. This",
                " created life in it and it began",
                " to low like a living calf.\" The",
                " Qur'an, in fact, dces not say that",
                " this actually happened but merely cites the",
                " reply given by the Samiri to Prophet",
                " Moses when the latter took him to,",
                " task for the great sin he had",
                " committed.",
                "There are others who interpret the",
                " words of the Samiri; like this: \"I",
                " saw a Weakness in the Messenger (Prophet",
                " Moses) or in his Creed, which others",
                " did not see. Therefore I followed in",
                " his footsteps to a certain limit but",
                " afterwards I left his way.\" This interpretation",
                " was moat probably put forward first of",
                " alI by Abu Muslim Isfahani. Then Imam",
                " Razi not only cited it in his",
                " own Commentary but also approved of it.",
                " And now it is being followed by",
                " some modernistic commentators, who try to prove",
                " their own favourite theories by giving far-fetched",
                " interpretations to the obvious meaning of the",
                " words of the Qur'an. Such people forget",
                " that the Qur'an has not been sent",
                " down in the terminology of enigmas, riddles",
                " and puzzles but in clear, plain and",
                " intelligible Arabic. Therefore the Qur'an would have",
                " never employed the words it has used",
                " in the Text to convey the meaning",
                " given by them because their usage cannot",
                " support that far-fetched interpretation. What such interpreters",
                " really mean to imply is that Allah",
                " has failed to express Himself clearly and",
                " plainly; therefore, they wish to come to",
                " His rescue by their interpretations in order",
                " to save Him from the ridicule of",
                " the \"learned\" people.",
                "If we study the",
                " verse in the context in which it",
                " occurs, we shall be able to understand",
                " easily that the Samiri was a mischief-monger",
                " who had contrived his deceitful scheme after",
                " a good deal of consideration. As he",
                " appears to have been a good craftsman,",
                " he caused the golden calf he had",
                " made to produce a lowing sound, and",
                " successfully deluded the ignorant and simple people.",
                " He did not rest content with this",
                " but impudently invented the story that he",
                " had seen what the common people could",
                " not see and that he had taken",
                " a handful of the dust from the",
                " footprints of the Messenger and sprinkled it",
                " on the calf which made it low",
                " like a living calf. It is possible",
                " that by the \"Messenger\", he meant Prophet",
                " Moses himself and might have cunningly tried",
                " to flatter him, saying, that the dust",
                " of his footprints was miraculous. By saying",
                " so, he was playing the most subtle",
                " trick. He wanted to offer an intellectual",
                " bait to Moses so that he might",
                " feel elated about the miraculous effect of",
                " the dust trodden by his feet and",
                " utilize his services for propagating his own",
                " miraculous acts. Anyhow, the fact is that",
                " the Qur'an has presented the whole thing",
                " as a trick of the Samiri and",
                " has not given the account as if",
                " it were a real event by itself.",
                " The subsequent reaction of Prophet Moses to",
                " the statement of the Samiri clearly shows",
                " that he considered it as a deceitful",
                " story, and so laid the curse on",
                " him."
            ]
        },
        {
            "verse-id": "[20:97]",
            "verse": "[Moses] said, \"Then go. And indeed, it is [decreed] for you in [this] life to say, 'No contact.' And indeed, you have an appointment [in the Hereafter] you will not fail to keep. And look at your 'god' to which you remained devoted. We will surely burn it and blow it into the sea with a blast.",
            "description": [
                "The words show that he was not",
                " only made an outcast for life but",
                " was made to inform the people himself",
                " that he was an outcast, as given",
                " in Leviticus:",
                "\"And the leper in whom",
                " the plague is, his clothes shall be",
                " rent, and his head bare, and he",
                " shall put a covering upon his upper",
                " lip, and shall cry, Unclean, unclean. All",
                " the days wherein the plague shall be",
                " in him he shall be defiled; he",
                " is unclean: he shall dwell alone; without",
                " the camp shall his habitation be \".",
                " (13: 45-46).",
                "We conclude from this that",
                " either he was inflicted with leprosy as",
                " a scourge by . Allah or the",
                " punishment inflicted on him was that, being",
                " a moral \"leper\", he should be made",
                " an outcast and should himself proclaim to",
                " be an unclean and impure person, saying,",
                " \"Touch me not\""
            ]
        },
        {
            "verse-id": "[20:98]",
            "verse": "Your god is only Allah, except for whom there is no deity. He has encompassed all things in knowledge.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:99]",
            "verse": "Thus, [O Muhammad], We relate to you from the news of what has preceded. And We have certainly given you from Us the Qur'an.",
            "description": [
                "Now that the story of Prophet Moses",
                " comes to an end, the same theme,",
                " that was interrupted by this story, has",
                " been resumed.",
                "*76) That is, the Qur'an",
                " about which it was said at the",
                " beginning of the Surah that it had",
                " not been sent down to put the",
                " Holy Prophet in distress, and that it",
                " was an Admonition for the God-fearing."
            ]
        },
        {
            "verse-id": "[20:100]",
            "verse": "Whoever turns away from it - then indeed, he will bear on the Day of Resurrection a burden,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:101]",
            "verse": "[Abiding] eternally therein, and evil it is for them on the Day of Resurrection as a load -",
            "description": [
                "Here the people have been warned that",
                " whoso will turn away front the Qur'an",
                " and will reject its guidance, he shall",
                " do harm to himself only and not",
                " to Allah and His Messenger, and that",
                " the one, who rejects His Message, shall",
                " inevitably be punished in the Hereafter. And",
                " this warning holds good for every people,",
                " every country and every age. This is",
                " because there are only two alternatives for",
                " an individual or a community, whom the",
                " Message of the Qur'an reaches. They can",
                " either accept it or reject it; there",
                " is no third way."
            ]
        },
        {
            "verse-id": "[20:102]",
            "verse": "The Day the Horn will be blown. And We will gather the criminals, that Day, blue-eyed.",
            "description": [
                "As regards the nature of the blowing",
                " of the \"Trumpet\" on the Day of",
                " Resurrection, it may be likened to the",
                " blowing of the bugle in the army",
                " to muster or disperse the soldiers. It",
                " is obvious that these words and terms",
                " have been used because these are known",
                " to the people. Therefore it wilt be",
                " wrong to consider the \"Trumpet\" to be",
                " exactly like the bugles and trumpets of",
                " this world.",
                "*79) According to some Commentators,",
                " it means this: \"The bodies of the",
                " criminals will turn white as if no",
                " drop of blood had been left in",
                " them.\""
            ]
        },
        {
            "verse-id": "[20:103]",
            "verse": "They will murmur among themselves, \"You remained not but ten [days in the world].\"",
            "description": [
                "The original text tray also be interpreted",
                " to mean: \"After your death, you may",
                " have passed hardly ten days till now.\"",
                " As regards the interpretation adopted in the",
                " translation, it is supported by XXVI: 112-113:",
                " \"When Allah will ask them, 'For how",
                " many years did you stay on the",
                " Earth?' They will say, 'We stayed there",
                " for a day - or a pan",
                " of a day: You may ask those",
                " who have kept the record!\" The second",
                " interpretation is supported by XXX: 55-56: \"And",
                " on the day when Resurrection will take",
                " place, the criminals will declare on oaths,",
                " 'We have not remained in the state",
                " of dealt for more than an hour.'",
                " And likewise they were deluded on the",
                " Earth. On the other hand, those who",
                " have been given Knowledge and Faith will",
                " say, 'According to the Book of Allah,",
                " you have remained in this state up",
                " to the Day of Resurrection, and this",
                " is the very Day of Resurrection, but",
                " you did not know of it'. \"",
                " Both the interpretations are supported by other",
                " verses of the Qur'an. It is clear",
                " from these that they will consider both",
                " the life on the Earth and the",
                " life in the interval between death and",
                " Resurrection to be very short. They will",
                " consider the earthly life to be very",
                " short because, against alI their expectations, they",
                " will have to face the eternal life",
                " in the Hereafter which they denied in",
                " their earthly life. As they had made",
                " no preparation for this life, they will",
                " wring their hands with regret that they",
                " had ruined their eternal life for the",
                " sake of a few transitory pleasures of",
                " the short life they had been given",
                " on the Earth. As regards the duration",
                " of the interval between death and Resurrection,",
                " they will consider it to be very",
                " short, for they will imagine that they",
                " had been suddenly awakened by the \"Trumpet\"",
                " from their last sleep or unconsciousness in",
                " their earthly life. Thus, they will not",
                " at first realize that the \"Trumpet\" was",
                " the signal for the Day of Resurrection",
                " because they had no expectation whatever that",
                " the Day of Resurrection would ever come.",
                " As a matter of fact, they used",
                " to make fun of this Day as",
                " a nonsensical thing."
            ]
        },
        {
            "verse-id": "[20:104]",
            "verse": "We are most knowing of what they say when the best of them in manner will say, \"You remained not but one day.\"",
            "description": [
                "This is a parenthisis that has been",
                " inserted to remove this doubt of the",
                " hearers: \"How has it been known today",
                " what the people will be talking in",
                " whispers in the Plain of Resurrection?\"",
                "*82)",
                " This is another parenthisis which has been",
                " inserted in answer to another objection raised",
                " by some hearer. It appears that when",
                " this Surah was being recited, some one",
                " might have raised this question as a",
                " ridicule: 'Where will these high mountains go",
                " on the Day of Resurrection, for it",
                " appears from your description of Resurrection that",
                " all the people of the world will",
                " be running about in a level plain?'",
                " In order to understand the background of",
                " the question, it should be kept in",
                " mind that Makkah, where this Surah was",
                " first recited on the occasion of its",
                " revelation, is surrounded on all sides by",
                " high mountains. The answer to this question",
                " follows immediately: \"Allah will reduce them to",
                " fine dust and scatter it away. \"",
                ""
            ]
        },
        {
            "verse-id": "[20:105]",
            "verse": "And they ask you about the mountains, so say, \"My Lord will blow them away with a blast.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:106]",
            "verse": "And He will leave the earth a level plain;",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:107]",
            "verse": "You will not see therein a depression or an elevation.\"",
            "description": [
                "According to the Qur'an, the earth will",
                " take a new shape in the Hereafter:",
                "",
                "\"The earth will be spread.\" (LXXXIV: 3).",
                "",
                "\"The bottoms of the oceans will be",
                " split (and the whole water will sink",
                " down in the earth.)\" (LXXXII: 3).",
                "\"The",
                " oceans will be filled up\". (LXXXI: 6).",
                "",
                "\"The mountains will be reduced to fine",
                " dust and scattered away and there will",
                " be left no curve or crease in",
                " the earth\". (XX: 105-107).",
                "\"On that day",
                " the earth will be totally changed\". (XIV:",
                " 48).",
                "\"And it will be turned into",
                " a garden and given to the pious",
                " people to dwell therein for ever.\" (XXXIX:",
                " 74).",
                "This shows that ultimately this earth",
                " will be turned into Paradise which will",
                " be inherited by the pious and righteous",
                " servants of Allah. The whole earth will",
                " become one country, and there will be",
                " no mountains, oceans, rivers and deserts which",
                " today divide it into countless countries and",
                " homelands and divide mankind as well into",
                " as many tribes, races and classes. Hadrat",
                " Ibn 'Abbas and Qatadah have held this",
                " same view that Paradise will be established",
                " on this very earth."
            ]
        },
        {
            "verse-id": "[20:108]",
            "verse": "That Day, everyone will follow [the call of] the Caller [with] no deviation therefrom, and [all] voices will be stilled before the Most Merciful, so you will not hear except a whisper [of footsteps].",
            "description": [
                "The original Arabic word (hams) is used",
                " for the sound of footsteps, the sound",
                " of whispering and other low sounds. What",
                " it implies here is that the people",
                " will be so awe-stricken on that Day",
                " that there will be no sound other",
                " than that of footsteps and whispering."
            ]
        },
        {
            "verse-id": "[20:109]",
            "verse": "That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word.",
            "description": [
                "This has another interpretation also: \"On that",
                " Day intercession will not be effective except",
                " in the case of the one for",
                " whom the Merciful may allow it and",
                " be pleased to hear it for him.\"",
                " Both these interpretations are supported by the",
                " following:",
                "\"Who is there that can intercede",
                " with Him except by His own permission?\"",
                " (11: 255).",
                "\"On that Day when the",
                " spirit and the angels will stand with",
                " folded hands, they will not be able",
                " to say anything except what the Merciful",
                " will permit, and they will say the",
                " right thing.\" (LXXVIII: 38). \"They do not",
                " intercede for anyone except for whom the",
                " Merciful may be pleased to listen to,",
                " and they are always fearful of Him.\"",
                " (XXI: 28).",
                "\"There are many angels in",
                " the heavens whose intercession avails nothing at",
                " all except when it is made after",
                " getting permission from Allah, and for the",
                " one for whom He wills to hear",
                " and approves of it.\" (LIII: 26)."
            ]
        },
        {
            "verse-id": "[20:110]",
            "verse": "Allah knows what is [presently] before them and what will be after them, but they do not encompass it in knowledge.",
            "description": [
                "Here the reasons for the restrictions on",
                " intercession have been stated. On the one",
                " hand, no angel, no prophet, no saint,",
                " nor anyone else knows, nor can know,",
                " the full details about the records of",
                " others. On the other hand, Allah has",
                " full knowledge of all the deeds and",
                " misdeeds of everyone and He knows who",
                " deserves pardon or punishment, and how much.",
                " If, therefore, there had been full freedom",
                " for intercession the whole purpose of the",
                " creation of man would have become meaningless.",
                " According to this verse, the door against",
                " intercession has not been entirely closed. The",
                " righteous people will be allowed to show",
                " their sympathy for other human beings as",
                " they did in the world, but they",
                " will have to get permission for this",
                " beforehand and even then make only a",
                " right sort of recommendation ."
            ]
        },
        {
            "verse-id": "[20:111]",
            "verse": "And [all] faces will be humbled before the Ever-Living, the Sustainer of existence. And he will have failed who carries injustice.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:112]",
            "verse": "But he who does of righteous deeds while he is a believer - he will neither fear injustice nor deprivation.",
            "description": [
                "From this, it is clear that in",
                " the Hereafter the case of every individual",
                " will be decided on merits. If a",
                " man had been guilty of iniquity and",
                " injustice in regard to the rights of",
                " God or the rights of man or",
                " even his own rights, he shall be",
                " dealt with accordingly. On the other hand,",
                " those, who are both believers and workers",
                " of righteous deeds, shall have no fear",
                " that they would be deprived of their",
                " rights or punished even though they were",
                " innocent."
            ]
        },
        {
            "verse-id": "[20:113]",
            "verse": "And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance.",
            "description": [
                "\".... thus .. Qur'an\": This means that",
                " the Qur'an is full of such high",
                " themes, wise teachings and admonitions as are",
                " contained in the preceding portion of this",
                " Surah as well as in the other",
                " Surahs of the Book.",
                "*89) That is,",
                " \"The Arabic Qur'an might awaken them from",
                " their heedlessness and they might recollect the",
                " forgotten lessons and feel that they are",
                " going astray and might realize the consequences",
                " thereof.\""
            ]
        },
        {
            "verse-id": "[20:114]",
            "verse": "So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"",
            "description": [
                "Such sentences as this are usually found",
                " in the Qur'an at the end of",
                " a discourse so that it may end",
                " with the praise of Allah. It is",
                " plain from the context that the discourse",
                " ends with \"the True King.\"",
                "*91) At",
                " the end of the discourse, the Angel",
                " cautions the Holy Prophet by Allah's Command",
                " to guard against a thing that had",
                " been noticed during the Revelation, for it",
                " was not considered appropriate to do so",
                " during its recital. It is obvious from",
                " the wording of the caution that the",
                " Holy Prophet was trying to learn the",
                " revealed discourse and was repeating it during",
                " its recital by the Angel. Naturally this",
                " might have diverted his attention over and",
                " over again from listening to and grasping",
                " the Revelation. Therefore it was felt necessary",
                " that he should be taught the right",
                " method of the receipt of the message",
                " of Revelation and be asked not to",
                " try to commit it to memory during",
                " the Revelation.",
                "This sentence shows that this",
                " portion of Surah Ta Ha is one",
                " of the earliest Revelations, for we learn",
                " from the other early Surahs that the",
                " Holy Prophet tried to commit to memory",
                " the Qur'anic Revelation and Allah cautioned him",
                " against it. For instance in LXXV: 16-19,",
                " he was told: \"Do not move your",
                " tongue over and over again in order",
                " to learn the Revelation, for it is",
                " Our responsibility to cause you to remember",
                " it by heart and recite it. Therefore",
                " when it is being recited to you,",
                " listen to it carefully. Then it is",
                " also Our responsibility to make its meanings",
                " clear to you.",
                "Again in LXXXVII: 6,",
                " he was assured: \"We will teach you",
                " how to recite it and you will",
                " not forget it.\" It appears that afterwards",
                " when the Holy Prophet had learnt how",
                " to receive the messages of Revelation, this",
                " did not occur. That is why there",
                " is no such caution in the Surahs",
                " of the later period."
            ]
        },
        {
            "verse-id": "[20:115]",
            "verse": "And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.",
            "description": [
                "From here begins a new discourse, which",
                " probably was sent down some time after",
                " the preceding discourse (see E.N. 90), and",
                " it was incorporated in this Surah by",
                " the command of Allah because both deal",
                " with the same theme. The following are",
                " the similarities between the two: (1) Both",
                " the discourses remind mankind of the \"forgotten",
                " lesson\", the Admonition, which Allah had taught",
                " man on the occasion of his creation.",
                "",
                "(2) Both teach that it is Satan",
                " who seduces man to forget that lesson.",
                " He succeeded in this by causing his",
                " first parents to forget it; since then",
                " he has been forgetting it over and",
                " over again and, therefore, has been cautioned",
                " against this.",
                "(3) Both warn man that",
                " his ultimate success or failure depends upon",
                " his attitude towards this \"Admonition.\"",
                "(4) Both",
                " warn mankind to discriminate between an inadvertent",
                " error and an intentional rebellion and their",
                " consequences. If man (like Prophet Adam and",
                " his offspring and the magicians of Pharaoh)",
                " realizes that he has been seduced by",
                " Satan, his eternal enemy, and then repents",
                " of his error, he is forgiven. But",
                " there is no forgiveness for intentional rebellion",
                " as was the case with Satan, Pharaoh",
                " and the Samiri.",
                "*93) The story of",
                " Prophet Adam has already been stated in",
                " 11: 30-39, VII: 11-27, 189, XV: 28-42,",
                " XVII: 61-65 and XVIII: 51-52. But at",
                " every place only that part of the",
                " story which was relevant to the context",
                " has been cited. Therefore, in order to",
                " understand the whole story well, one should",
                " read it in all the Surahs along",
                " with the relevant E.N's.",
                "*94) This means",
                " that he disobeyed the Command because he",
                " lacked the firmness of purpose and not",
                " because of intentional rebellion. He did not",
                " say, \"I don't care a fig for",
                " Allah. If it is His Command, let",
                " it be. I will do whatever I",
                " like. Who is Allah to intervene in",
                " my private affairs?\"",
                "On the contrary, he",
                " disobeyed because he forgot Allah's Command, and",
                " did not show firmness of purpose and",
                " determination against the temptations presented by Satan.",
                " This is shown by his subsequent repentance.",
                ""
            ]
        },
        {
            "verse-id": "[20:116]",
            "verse": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except Iblees; he refused.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:117]",
            "verse": "So We said, \"O Adam, indeed this is an enemy to you and to your wife. Then let him not remove you from Paradise so you would suffer.",
            "description": [
                "Here the Command, which was given to",
                " Prophet Adam, has not been mentioned, which",
                " was: \"You must not eat the fruit",
                " of this tree.\" This has been mentioned",
                " at other places but has been omitted",
                " here because the emphasis here is on",
                " this weakness of man that he is",
                " easily seduced by Satan in spite of",
                " the forewarnings and admonitions to this effect.",
                "",
                "*96) Both knew that Satan was their",
                " enemy, for Adam himself had witnessed the",
                " demonstration of his enmity, when he had",
                " refused to bow down before him and",
                " declared in plain words, \"I am better",
                " than he; Thou didst create me of",
                " tire and him of clay\". (VII: 12,",
                " XXXVIII: 76, see also XV: 33). \"Should",
                " I bow before the one whom Thou",
                " hast created out of clay?\" And then",
                " added, \"Just consider was he worthy of",
                " this that Thou hast exalted him over",
                " me?\" (XVII: 61-b2). Then Satan did not",
                " rest content with this bragging of superiority",
                " but evinced his jealousy by giving an",
                " open challenge that he would prove it",
                " by seducing Adam. (VII: 16, 17; XV:",
                " 36-42; XVII: 62-6b; XXXVIII: 82-83).",
                "*97) This",
                " was to forewarn both of them of",
                " the consequences of disobedience of the Command.",
                ""
            ]
        },
        {
            "verse-id": "[20:118]",
            "verse": "Indeed, it is [promised] for you not to be hungry therein or be unclothed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:119]",
            "verse": "And indeed, you will not be thirsty therein or be hot from the sun.\"",
            "description": [
                "This is the explanation of the \"distress\"",
                " which they had to undergo inunediately after",
                " their expulsion from the Garden. Here instead",
                " of mentioning the high and perfect blessings",
                " of the Garden, only four basic necessities",
                " of life have been stated, namely, food,",
                " drink, dress, and shelter, as if to",
                " say, \"In the Garden you are being",
                " supplied with all these necessities without any",
                " labour from you. But if you succumb",
                " to the temptations and seduction of Satan,",
                " you will be totally deprived not only",
                " of these facilities but also of the",
                " higher blessings of the Garden. In that",
                " case, you will have to work so",
                " hard for these necessities that very little",
                " energy and time and leisure will be",
                " left with you to strive for higher",
                " aims of life.\""
            ]
        },
        {
            "verse-id": "[20:120]",
            "verse": "Then Satan whispered to him; he said, \"O Adam, shall I direct you to the tree of eternity and possession that will not deteriorate?\"",
            "description": [
                "According to this verse. it was Adam",
                " whom Satan primarily wanted to seduce and",
                " not Eve. Though according to VII: 20,",
                " he tempted both of them and both",
                " were seduced, but Satan's efforts were mainly",
                " directed to Adam. On the contrary, according",
                " to the Bible, the serpent first tempted",
                " the woman \"to eat the fruit of",
                " the forbidden tree and then she seduced",
                " her husband\". (Genesis, 3).",
                "*100) According to",
                " this verse, Satan tempted Adam to eat",
                " the fruit of the tree so that",
                " he might get eternal life and everlasting",
                " kingdom, and according to V 11: 20,",
                " he put an additional temptation in their",
                " way, saying that they would become angels",
                " and immortal."
            ]
        },
        {
            "verse-id": "[20:121]",
            "verse": "And Adam and his wife ate of it, and their private parts became apparent to them, and they began to fasten over themselves from the leaves of Paradise. And Adam disobeyed his Lord and erred.",
            "description": [
                "No sooner did they disobey the \"Command\"",
                " than they were deprived of all the",
                " facilities, but naturally the immediate effect of",
                " this as felt by them was. that",
                " they were stripped of their garments. Then",
                " gradually, as they felt thirsty, hungry etc.,",
                " they realized that they had been deprived",
                " of all the facilities that they enjoyed",
                " in the Garden.",
                "*102) It is worth",
                " while to understand the nature of human",
                " weakness which helped Satan to seduce Adam",
                " and Eve. They succumbed to seduction because",
                " Satan tempted them in the garb of",
                " a true friend and well-wisher even though",
                " they knew full well that he was",
                " their enemy. For Adam had a direct",
                " knowledge of the envy and enmity of",
                " Satan, who had challenged to seduce and",
                " ruin him in his very presence. Allah",
                " had also warned them to guard against",
                " the envy of and the temptations by",
                " Satan and had informed them of the",
                " consequences of disobedience. Above all, Adam and",
                " Eve still believed in Allah and never",
                " thought of intentional disobedience. But in spite",
                " of this, when Satan tempted them in",
                " the garb of a friend, they disobeyed",
                " their Lord: they forgot the \"Command\" for",
                " the time being for lack of fineness",
                " of purpose. And since then this human",
                " weakness has persisted in their descendants during",
                " all ages."
            ]
        },
        {
            "verse-id": "[20:122]",
            "verse": "Then his Lord chose him and turned to him in forgiveness and guided [him].",
            "description": [
                "\".........His Lord chose him\" because he did",
                " not disobey Him intentionally and did not",
                " persist in sin arrogantly. As soon as",
                " he realized his error he felt ashamed",
                " of it and asked Allah's pardon: \"O",
                " our Lord, we have wronged ourselves gravely;",
                " if Thou dost not forgive us and",
                " have mercy upon us, we shall be",
                " totally ruined\".(VII: 23). In contrast to Adam",
                " and Eve, Satan was cursed because he",
                " not only disobeyed his Lord but also",
                " persisted in his sin, and boldly challenged",
                " Him that it was He Who was",
                " responsible for his disobedience, for He had",
                " preferred Adam whom He had created of",
                " clay over him whom He had made",
                " of tire."
            ]
        },
        {
            "verse-id": "[20:123]",
            "verse": "[Allah] said, \"Descend from Paradise - all, [your descendants] being enemies to one another. And if there should come to you guidance from Me - then whoever follows My guidance will neither go astray [in the world] nor suffer [in the Hereafter].",
            "description": [
                "That is, \"Allah not only pardoned him",
                " but also gave him Guidance and taught",
                " him the way to follow it.\""
            ]
        },
        {
            "verse-id": "[20:124]",
            "verse": "And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind.\"",
            "description": [
                "\"Wretched life in this world\" does not",
                " mean a life of poverty. It means",
                " that such a one shall be deprived",
                " of the peace of mind, even though",
                " he may be a millionaire or the",
                " ruler of a vast empire, for the",
                " one, who will turn away from the",
                " \"Admonition\", will win all the worldly successes",
                " by unlawful means and, therefore, will always",
                " be suffering from pangs of a guilty",
                " conscience and deprived of the peace of",
                " mind and real happiness.",
                "*106) Here the",
                " story of Prophet Adam ends. In the",
                " light of this part of the story",
                " which has been related here and at",
                " other places in the Qur'an, I have",
                " come to the conclusion (and correct knowledge",
                " is with Allah alone) that the \"vicegerency",
                " of the Earth\" was the same as",
                " was initially bestowed on Adam in the",
                " Garden, which might have been created in",
                " the heavens or on this Earth. Anyhow",
                " the vicegerent of Allah was supplied gratis",
                " with all the necessities of life and",
                " the angels were placed under his command",
                " for service. This was to enable him",
                " to discharge the high and noble obligations",
                " of vicegerency, without any worry about the",
                " procurement of the necessities of life. But",
                " in order to make hire permanent in",
                " this office, it was necessary to put",
                " him to a test so that all",
                " his capabilities, excellences and weaknesses might be",
                " known. Accordingly, he had to take his",
                " test in which some of his weaknesses",
                " came to the surface: he was prone",
                " to be seduced by greed and temptation:",
                " he did not remain firm in obedience:",
                " he was capable of forgetfulness. That is",
                " why he was given the \"vicegerency\" as",
                " a trial in the Earth for a",
                " fixed term up to the Day of",
                " Judgment. During this period of trial, he",
                " had himself to make arrangements for the",
                " necessities of life though he was allowed",
                " to exploit all the resources of the",
                " Earth and to rule over other creatures.",
                " The trial is this: does he or",
                " does he not obey his Lord in",
                " spite of having the power to obey",
                " or not to obey? And if he",
                " forgets or is seduced by greed, dces",
                " he or dces he not repent through",
                " warning and admonition, when he realizes his",
                " error? At the same time, his Lord",
                " has warned him that a full and",
                " perfect record of all his deeds and",
                " misdeeds is being kept, and that he",
                " shall be judged on the Day of",
                " Reckoning in accordance with it. Those who",
                " will come out successful will be given",
                " permanent vicegerency and that eternal life and",
                " everlasting kingdom by which Satan seduced .",
                " him. The righteous servants will become the",
                " heirs to the Garden, if they had",
                " obeyed their Lord or repented after \"forgetfulness\".",
                " It should also be noted well that",
                " life in the Garden will not merely",
                " be to \"eat, drink and be merry\",",
                " but there will be such higher things",
                " to achieve as no human being can",
                " conceive in this world. That is why",
                " only those blessings of the Garden have",
                " been mentioned in the Qur'an which can",
                " be comprehended by human beings in this",
                " world.",
                "It will be worth while to",
                " make a comparative study of the account",
                " of Adam and Eve as given in",
                " the Qur'an with that given in the",
                " Bible. According to Genesis:",
                "\"And the Lord",
                " God formed man of the dust of",
                " the ground, and breathed into his nostrils",
                " the breath of life; and man became",
                " a living soul. And the Lord God",
                " planted a garden eastward in Eden; and",
                " there he put the tnan whom he",
                " had formed. And out of the ground",
                " made the Lord God to grow every",
                " tree....the tree of life....and the tree of",
                " knowledge of good and evil....And the Lord",
                " God commanded the man, saying, Of every",
                " tree of the garden thou mayst freely",
                " eat: But of the tree of the",
                " knowledge of good and evil, thou shalt",
                " not eat of it: for in the",
                " day that thou eatest thereof thou shalt",
                " surely die .... And the rib, which",
                " the Lord God had taken from tnan,",
                " made he a woman, and brought her",
                " unto the man.... And they were both",
                " naked, the man and his wife, and",
                " were not ashamed.\" (2:725). \"Now the serpent",
                " was more subtle than any beast of",
                " the field which the Lord God had",
                " made. And he said unto the woman,",
                " Yea, hath God said, Ye shall not",
                " eat of every tree of the garden?....",
                " And the serpent said unto the woman,",
                " Ye shall not surely die: For God",
                " doth know that in the day ye",
                " eat thereof, then your eyes shall be",
                " opened, and ye shall be as gods,",
                " knowing good and evil....she took of the",
                " fruit thereof, and did eat, and gave",
                " also unto her husband with her; and",
                " he did eat. And the eyes of",
                " them both were opened, and they knew",
                " that they were naked; and they sewed",
                " fig leaves together, and made themselves aprons.",
                " And they heard the voice of the",
                " Lord God walking in the garden in",
                " the cool of the day: and Adam",
                " and wife hid themselves from the presence",
                " of the Lord God amongst the trees",
                " of the garden. And the Lord God",
                " called unto Adam, and said unto him,",
                " Where art thou? And he said, I",
                " heard Thy voice in the garden, and",
                " I was afraid, because I was naked;",
                " and I hid myself. And He said,",
                " who told thee that thou west naked?",
                " Hast thou eaten, whereof I commanded thee",
                " that thou shouldest not eat? And the",
                " man said, The woman whom thou gayest",
                " to be with me, she gave me",
                " of the tree, and I did eat...........And",
                " the woman said, the serpent beguiled me,",
                " and I did eat. And the Lord",
                " God said unto the serpent, Because thou",
                " hast done this, thou art cursed above",
                " all cattle, and above every blast of",
                " the field; upon thy belly shalt thou",
                " go, and dust shalt thou eat all",
                " the days of thy life: And I",
                " will put enmity between thee and the",
                " woman, and between thy seed and her",
                " seed; it shall bruise thy head, and",
                " thou shalt bruise his heel. Unto the",
                " woman he said, 1 will greatly multiply",
                " thy sorrow and thy conception; in sorrow",
                " thou shah bring forth children; and thy",
                " desire shall be to thy husband, and",
                " he shall rule over thee. And unto",
                " Adam he said, Because thou hast hearkened",
                " unto the voice of thy wife, and",
                " hast eaten of the tree, of which",
                " 1 commanded thee, saying, Thou shalt not",
                " eat of it: cursed is the ground",
                " for thy sake; in sorrow shalt thou",
                " eat of it all the days of",
                " thy life:.... In the sweat of thy",
                " face shalt thou eat bread. Unto Adam",
                " also and to his wife did the",
                " Lord God make coats of skins, and",
                " clothed them. And the Lord God said,",
                " Behold, the man is become as one",
                " of us, to know good and evil:",
                " and now, lest he put forth his",
                " hand, and take also of the tree",
                " of life, and eat, and live for",
                " ever: Therefore the Lord God sent him",
                " forth from the garden of Eden, to",
                " till the ground from whence he was",
                " taken.\" (3 :1-23).",
                "It is obvious that",
                " the Bible has not done justice to",
                " Adam and Eve, nay, even to God",
                " Himself. On the other hand, the account",
                " given in the Qur'an is itself a",
                " clear proof that the stories given in",
                " it have not been copied from the",
                " Bible; for the Qur'an not only corroborates",
                " those parts of the Bible which have",
                " remained untampered but also corrects its wrong",
                " statements."
            ]
        },
        {
            "verse-id": "[20:125]",
            "verse": "He will say, \"My Lord, why have you raised me blind while I was [once] seeing?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:126]",
            "verse": "[Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten.\"",
            "description": [
                "The Qur'an has described the different conditions",
                " and experiences through which the criminals will",
                " pass from the Day of Resurrection to",
                " the time of their entry into Hell:",
                " \"You were neglectful of this; now We",
                " have removed the curtain from before you",
                " and your sight has become very sharp.\"",
                " (L: 22). \"He is only deferring them",
                " to the Day when alI eyes shall",
                " stare with consternation. They will be running",
                " in terror with heads uplifted and eyes",
                " fixed upwards and hearts void\". (XIV: 42-43).",
                " \"We have fastened the augury of every",
                " man to his own neck and on",
                " the Day of Resurrection We will bring",
                " forth a writing which he will find",
                " like an open book. (It will be",
                " said to him :) 'Here is your",
                " record: read it. Today you can yourself",
                " reckon your account'\". (XVII : 13-14). In",
                " the light of the above and this",
                " verse (126), it appears that in the",
                " Hereafter, the criminals shall be enabled to",
                " see the horrible sights and to realize",
                " the consequences of their evil deeds, but",
                " in other respects they will be like",
                " the blind man 'who cannot see his",
                " way and is deprived of even a",
                " staff to feel his way, nor is",
                " there anyone to guide him. So he",
                " stumbles and is knocked about and dces",
                " not know where to go and how",
                " to satisfy his needs. This very state",
                " has been expressed thus: \"You forgot Our",
                " Revelations when they came to you, so",
                " you are being forgotten today\", as if,",
                " \"you were blind and had no one",
                " to look after you.\""
            ]
        },
        {
            "verse-id": "[20:127]",
            "verse": "And thus do We recompense he who transgressed and did not believe in the signs of his Lord. And the punishment of the Hereafter is more severe and more enduring.",
            "description": [
                "This refers to the \"wretched life\" which",
                " will be the lot of those who",
                " turn away from the \"Admonition\" in this",
                " worldly life."
            ]
        },
        {
            "verse-id": "[20:128]",
            "verse": "Then, has it not become clear to them how many generations We destroyed before them as they walk among their dwellings? Indeed in that are signs for those of intelligence.",
            "description": [
                "\"These people\" of Makkah.",
                "*110) That is,",
                " \"In this lesson of History and in",
                " the observation of the archaeological remains and",
                " in this experience of mankind\"."
            ]
        },
        {
            "verse-id": "[20:129]",
            "verse": "And if not for a word that preceded from your Lord, punishment would have been an obligation [due immediately], and [if not for] a specified term [decreed].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:130]",
            "verse": "So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting; and during periods of the night [exalt Him] and at the ends of the day, that you may be satisfied.",
            "description": [
                "This is to comfort and console the",
                " Holy Prophet, as if to say, \"Allah",
                " does not intend to destroy them yet,",
                " for He has appointed for them a",
                " term of respite, so you should endure",
                " with patience whatever they do against you",
                " and hear their harsh talk and go",
                " on performing the obligations of your Mission.",
                " For this purpose you should offer Salat",
                " in accordance with the prescribed times because",
                " it will create in you necessary forbearance",
                " and fortitude\".",
                "\"Glorify your Lord\" means: \"Offer",
                " your prescribed Prayers\", as is clear from",
                " v. 132:",
                "Incidentally in this verse (130)",
                " the times of Salat have been prescribed:",
                " (1) Fajr Prayer before sunrise, (2) `Asr",
                " Prayer before sunset, (3) `Isha and Tahajjud",
                " Prayers during the hours of night. Morning",
                " and Afternoon (Dhuhr) and Evening (Maghrib) Prayers",
                " \"at the extremes of the day.\" (See",
                " also E.N.'s. 91 to 97 of Chapter",
                " XV11.)",
                "*112) The original Arabic Text admits",
                " of two meanings:",
                "(1) \"Rest content with",
                " your present condition in which you have",
                " to hear many unpleasant things for the",
                " sake of your Mission, and submit to",
                " this decree that they are not being",
                " punished for the time being, for they",
                " will continue to persecute you and at",
                " the same time lead prosperous lives.\"",
                "(2)",
                " \"Go on performing your Mission, for as",
                " a result of this, you will be",
                " fully satisfied.\"",
                "This second meaning is supported",
                " by (a) XVII: 79: \"That time is",
                " not far, when your Lord may exalt",
                " you to a laudable position,\" which follows",
                " the commandment about Salat, (b) XCIII: 45:",
                " \"Surely the later period of life will",
                " be better for you than the former,",
                " and in the near future your Lord",
                " will give you so much that you",
                " will be fully satisfied.\""
            ]
        },
        {
            "verse-id": "[20:131]",
            "verse": "And do not extend your eyes toward that by which We have given enjoyment to [some] categories of them, [its being but] the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring.",
            "description": [
                "It means: \"It does not behove you",
                " and your companions to be envious of",
                " the riches of the wicked people who",
                " are amassing wealth by unlawful means. The",
                " best thing for you is the lawful",
                " provision which you earn by your hard",
                " labour, even though this may be meagre",
                " in quantity. That is better for the",
                " pious and righteous and is of everlasting",
                " virtue.\""
            ]
        },
        {
            "verse-id": "[20:132]",
            "verse": "And enjoin prayer upon your family [and people] and be steadfast therein. We ask you not for provision; We provide for you, and the [best] outcome is for [those of] righteousness.",
            "description": [
                "That is, \"Teach your children also that",
                " lawful provision is much better than the",
                " unlawful riches of the wicked people. For",
                " this purpose, enjoin them to say their",
                " prescribed Prayers, for this will change their",
                " attitude, their standard of values, and make",
                " them contented with pure provisions and virtuous",
                " life in preference to the life of",
                " sin and luxury.\"",
                "*115) It implies this:",
                " \"We do not ask you to offer",
                " your Prayers for any benefit of Our",
                " own. We ask you to do that",
                " for your own good, because this will",
                " create piety in you which will bring",
                " about true success for you in this",
                " world and in the Hereafter.\""
            ]
        },
        {
            "verse-id": "[20:133]",
            "verse": "And they say, \"Why does he not bring us a sign from his Lord?\" Has there not come to them evidence of what was in the former scriptures?",
            "description": [
                "This means that the Qur'an itself is",
                " a great miracle, for though it is",
                " being presented by an unlettered person from",
                " among them, it contains the essence of",
                " the teachings and guidance of all tire",
                " previous Divine Books. Not only this: it",
                " makes those teachings and guidance so plain",
                " and clear that even a simple man",
                " of the desert can benefit from them.",
                ""
            ]
        },
        {
            "verse-id": "[20:134]",
            "verse": "And if We had destroyed them with a punishment before him, they would have said, \"Our Lord, why did You not send to us a messenger so we could have followed Your verses before we were humiliated and disgraced?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[20:135]",
            "verse": "Say, \"Each [of us] is waiting; so wait. For you will know who are the companions of the sound path and who is guided.\"",
            "description": [
                "That is, \"Ever since the Message of",
                " Islam is being presented in your city",
                " (Makkah), it is not only every person",
                " of this city who is waiting for",
                " its ultimate result but also every one",
                " outside it, who has heard of it,\"",
                ""
            ]
        }
    ]
}