{
    "name": "Al-Hajj",
    "verse-count": 78,
    "verse-info": [
        {
            "id": "[22:1]",
            "verse": "O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing.",
            "description": [
                "According to the early commentators, this earthquake",
                " will be a prelude to Resurrection. This",
                " will probably take place when the earth",
                " will begin to rotate in the reverse",
                " order, and the sun will rise in",
                " the west. In a lengthy Tradition reported",
                " by Ibn Jarir, 'Tabarani and Ibn Abi",
                " Hatim from Abu Hurairah, the Holy Prophet",
                " has stated that when the first Trumpet",
                " will be blown, there will be a",
                " general confusion; at the second all people",
                " will die and at the third they",
                " will be brought back to life and",
                " presented before Allah. At the first blowing",
                " of the Trumpet, the earth will begin",
                " to rock like a boat which is",
                " beaten about by huge waves, or like",
                " a hanging lamp which is moved from",
                " side to side by a strong wind.",
                "",
                "This condition has been depicted in the",
                " Qur'an at several other places. For instance",
                " LVI: 6; LXIX: 13-14; LXXIII: 14, 17-18;",
                " LXXIX : 6-9 and XCIX: 1-3.",
                "According",
                " to other commentators, this earthquake will occur",
                " when the dead will be brought back",
                " to life and presented before their Lord.",
                " Though this is supported by some Traditions,",
                " we prefer the first interpretation (in spite",
                " of the fact that the Tradition reported",
                " by Abu Hurairah is \"weak\") because that",
                " is supported by clear verses of the",
                " Qur'an."
            ]
        },
        {
            "id": "[22:2]",
            "verse": "On the Day you see it every nursing mother will be distracted from that [child] she was nursing, and every pregnant woman will abort her pregnancy, and you will see the people [appearing] intoxicated while they are not intoxicated; but the punishment of Allah is severe.",
            "description": [
                "This is to show the intensity and",
                " honor of the earthquake. At that time",
                " there will be so much confusion acid",
                " terror that mothers will forsake their dear",
                " children at the very time they will",
                " be suckling them.",
                "*3) It should be",
                " noted that it is not meant to",
                " depict here the condition of the Resurrection",
                " but to impress upon the people the",
                " dreadful torment of the Hour in order",
                " to admonish them to mend their ways.",
                " This is supported by the subsequent passage.",
                ""
            ]
        },
        {
            "id": "[22:3]",
            "verse": "And of the people is he who disputes about Allah without knowledge and follows every rebellious devil.",
            "description": [
                "They do not indulge in discussions or",
                " disputes about the Being or existence of",
                " Allah but about His rights and powers",
                " and His Revelations, as is evident from",
                " the succeeding passage. When the Holy Prophet",
                " tried to convince them of Tauhid and",
                " Resurrection, inevitably the dispute arose whether there",
                " is One Allah, the sole Sovereign or",
                " there were other partners as well in",
                " His Godhead and whether He has the",
                " power to bring about Resurrection, etc."
            ]
        },
        {
            "id": "[22:4]",
            "verse": "It has been decreed for every devil that whoever turns to him - he will misguide him and will lead him to the punishment of the Blaze.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:5]",
            "verse": "O People, if you should be in doubt about the Resurrection, then [consider that] indeed, We created you from dust, then from a sperm-drop, then from a clinging clot, and then from a lump of flesh, formed and unformed - that We may show you. And We settle in the wombs whom We will for a specified term, then We bring you out as a child, and then [We develop you] that you may reach your [time of] maturity. And among you is he who is taken in [early] death, and among you is he who is returned to the most decrepit [old] age so that he knows, after [once having] knowledge, nothing. And you see the earth barren, but when We send down upon it rain, it quivers and swells and grows [something] of every beautiful kind.",
            "description": [
                "\"..... created you .....sperm-drop\": The first man",
                " Adam was created directly from clay and",
                " after him the process of procreation started",
                " by means of sperm-drop. This has been",
                " stated in XXXII: 7-8 as well. It",
                " may also mean that man is created",
                " from sperm-drop but his body is made",
                " of those elements which are all available",
                " in the earth.",
                "*6) This refers to",
                " the different stages of development of the",
                " child in the womb of its mother.",
                " This description is based on observation and",
                " not on scientific research, and there was",
                " no need for it for the purpose",
                " for which reference to this has been",
                " made here.",
                "*7) That is, \"In old",
                " age man is again reverted to the",
                " same condition in which he was in",
                " childhood. He loses his senses and knows",
                " little or nothing like a child\"."
            ]
        },
        {
            "id": "[22:6]",
            "verse": "That is because Allah is the Truth and because He gives life to the dead and because He is over all things competent",
            "description": [
                "The Arabic Text may mean three things:",
                "",
                "(1) Allah is telling the Truth and",
                " you are wrong in presuming that there",
                " is no possibility of life-after-death.",
                "(2) Allah's",
                " existence is not merely a supposition but",
                " it is a Reality. He is not",
                " only the First Cause but has supreme",
                " authority, and is conducting every affair in",
                " the universe according to His Will, Knowledge",
                " and Wisdom.",
                "(3) All His designs and",
                " works are based on Truth and are,",
                " therefore, serious, meaningful and full of wisdom.",
                ""
            ]
        },
        {
            "id": "[22:7]",
            "verse": "And [that they may know] that the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves.",
            "description": [
                "In this passage, different stages of the",
                " life of man, the effects of rain",
                " on the earth and the growth of",
                " vegetation have been cited as pointers to",
                " five realities:",
                "(1) \"Allah alone is the",
                " Truth\".",
                "(2) \"He brings the dead to",
                " life\".",
                "(3) \"He has power over everything\".",
                "",
                "(4) \"The Day of Resurrection and the",
                " end of the world is inevitable\".",
                "(5)",
                " Most surely Allah will bring back to",
                " life all the people who have died\",",
                " Let us now consider how these signs",
                " point to the above five realities:",
                "(1)",
                " \"Allah is the Truth\": In order to",
                " prove this, let us first take the",
                " case of man. All the stages of",
                " his development are a clear proof that",
                " Allah has designed them with wisdom. He",
                " takes his birth from a sperm-drop which",
                " itself is produced in a wonderful manner.",
                " The food, which a man takes, turns",
                " into hair, flesh, bones and a part",
                " of it is turned into semen, which",
                " is potentially capable of producing millions of",
                " human beings. It is the Wise and",
                " True God Who decides which of these",
                " millions of seeds from the semen should",
                " be utilized to make a woman pregnant",
                " by mixing the seed with the egg-cell.",
                " This insignificant thing turns into a living",
                " child in nine months in the womb",
                " of the mother. If we consider the",
                " different stages of the child's birth we",
                " come to the inevitable conclusion that all",
                " these have been designed by the True,",
                " EverLiving Designer. For it is He Who",
                " decides whether it should be a male",
                " or a female, seeing or blind, etc.",
                " Then it is He Who decides how",
                " long a child is destined to live.",
                " All these things are a clear proof",
                " that Allah alone is the Truth.",
                "(2)",
                " \"He brings the dead to life\": Even",
                " a little thinking on the right lines",
                " will convince every sensible and honest man",
                " that this process of bringing the dead",
                " to life is continuously going on before",
                " our eyes. Every human being has been",
                " created from a \"dead\" sperm-drop. Then he",
                " gets life from \"dead things\" like food",
                " containing dead matter like coal, iron, lime,",
                " salts, gases, which help make him a",
                " living human being. Then let us consider",
                " our surroundings. Seeds of different things which",
                " had been scattered here and there by",
                " the wind nad birds, and the roots",
                " of different kinds of vegetation which lay",
                " rotten and dead in the soil, spring",
                " up to life as soon as there",
                " occurs a sprinkling of rain water. This",
                " process of the dead coming to life",
                " is observed during every rainy season year",
                " after year.",
                "(3) \"Allah has power over",
                " everything\": There are people who believe that",
                " no doubt Allah created everything and is",
                " governing the universe, but He cannot do",
                " anything in the future in addition to",
                " or apart from this. This is because",
                " they do not observe the phenomena of",
                " His powers which have been and are",
                " appearing every moment. They do not realize",
                " that if man-His creation ran perform wonderful",
                " feats of science which could not even",
                " be dreamt of in the former ages,",
                " why should Allah alone be held as",
                " having only limited powers ?",
                "(4) \"The",
                " Day of Resurrection is inevitable\" and \"Most",
                " surely Allah will bring back to life",
                " all the people who have died\": These",
                " two are the rational corollaries of the",
                " preceding three premises. Allah is All-Powerful and",
                " therefore can bring about Resurrection at any",
                " moment He wills. He can also bring",
                " back to life all the dead people",
                " just as He brought to life human",
                " beings out of nothing in the first",
                " instance. As He is All-Wise, He has",
                " not created human beings without any object",
                " and purpose. He will judge their worldly",
                " lives in accordance with the object and",
                " purpose for which He created them. He",
                " will call them to account for everything",
                " He entrusted to them. This is very",
                " simple: even human beings ask one another",
                " to render an account of the property",
                " etc. they entrust to others. Likewise, Allah's",
                " wisdom requires to call every human being",
                " to account for the things entrusted to",
                " him. Then human nature also demands that",
                " there should be a differentiation between good",
                " and bad, and it expects the reward",
                " of good works and dreads the punishment",
                " of bad deeds. That is why the",
                " people have set up judicial courts. Thus",
                " man cannot imagine that the Creator will",
                " not call him to account for the",
                " things, powers and faculties, etc. which He",
                " has entrusted to him. Therefore common sense",
                " confirms that Allah will hold the Last",
                " Judgment so that every one should get",
                " his due reward and his due punishment.",
                ""
            ]
        },
        {
            "id": "[22:8]",
            "verse": "And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book [from Him],",
            "description": [
                "That is, they are so stiff-necked, proud,",
                " arrogant, obdurate and obstinate that they do",
                " not pay any heed to \"Admonition\".",
                "*11)",
                " \"Knowledge\": that personal information which is gained",
                " directly through observation and experience.",
                "*12) \"Guidance\":",
                " that information which is gained .by reasoning",
                " or through another person who has knowledge.",
                "",
                "*13) `'Illuminating Book\": Source of information gained",
                " from Divine Revelation."
            ]
        },
        {
            "id": "[22:9]",
            "verse": "Twisting his neck [in arrogance] to mislead [people] from the way of Allah. For him in the world is disgrace, and We will make him taste on the Day of Resurrection the punishment of the Burning Fire [while it is said],",
            "description": [
                "V , 3 mentioned those people who",
                " have themselves gone astray, but v. 9",
                " mentions those who have not only deviated",
                " from the Right Way themselves but are",
                " also bent upon misleading others from it.",
                ""
            ]
        },
        {
            "id": "[22:10]",
            "verse": "\"That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:11]",
            "verse": "And of the people is he who worships Allah on an edge. If he is touched by good, he is reassured by it; but if he is struck by trial, he turns on his face [to the other direction]. He has lost [this] world and the Hereafter. That is what is the manifest loss.",
            "description": [
                "This type of man is a time",
                " server, who stands on the boundary line",
                " between Islam and kufr so that he",
                " may join the winning side whether it",
                " be Islam or kufr.",
                "*16) As this",
                " type of man has a weak character",
                " and wavers between kufr and Islam he",
                " becomes the slave of his \"self\". He",
                " accepts Islam for the sake of selfinterest:",
                " he is faithful to it if all",
                " his wishes are fulfilled and he has",
                " a life of ease and comfort; he",
                " is well-pleased with his Allah and is",
                " \"firm\" in his faith. On the contrary,",
                " if his \"faith\" demands some sacrifice from",
                " him, or he is visited by some",
                " affliction, or encounters some hardship and loss",
                " in the way of Allah, or he",
                " does not have his way, he begins",
                " to waver about the Godhead of Allah",
                " and the Prophethood of the Messenger and",
                " becomes sceptical about everything of the \"Faith\".",
                " Then he is ready to bow down",
                " before any power from which he expects",
                " some benefit and security from loss.",
                "*17)",
                " This is a great moral proposition that",
                " has been stated concisely. The fact is",
                " that the wavering man remains a loser",
                " in this world as well as in",
                " the Next World, and fares worse even",
                " than an unbeliever. The unbeliever applies himself",
                " exclusively to the benefits of this world",
                " and becomes more or less successful in",
                " his object because he is not handicapped",
                " by the fear of Allah, accountability of",
                " the Hereafter and restrictions of Divine Law.",
                " Likewise a true believer follows the way",
                " of Allah with fortitude and perseverance and",
                " may as well become successful in this",
                " world, but even if he loses it",
                " altogether, he is assured of success in",
                " the Next Y World. But the \"wavering",
                " Muslim\" becomes a loser both in this",
                " world and in the Next World because",
                " he is handicapped by doubt and indecision",
                " and cannot make his choice between the",
                " two worlds. As he cannot decide whether",
                " there is Allah and the Hereafter, he",
                " cannot apply himself exclusively to the worldly",
                " affairs with that single-mindedness which the unbeliever",
                " enjoys. And when he thinks of Allah",
                " and the Hereafter, the allurements of this",
                " world and the fear of the disadvantages",
                " here and the abhorrence of observing the",
                " Divine restrictions do not let him apply",
                " himself exclusively to the demands of the",
                " Hereafter. This conflict between \"Godworship\" and \"World-worship\"",
                " makes him a loser in this world",
                " as well as in the next."
            ]
        },
        {
            "id": "[22:12]",
            "verse": "He invokes instead of Allah that which neither harms him nor benefits him. That is what is the extreme error.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:13]",
            "verse": "He invokes one whose harm is closer than his benefit - how wretched the protector and how wretched the associate.",
            "description": [
                "Vv. 12-13 clarify two things about the",
                " deities whom the mushriks invoke. Firstly, they",
                " can do a person neither any good",
                " nor any harm; nay, it is more",
                " probable that they do harm rather than",
                " good. For when the mushrik invokes other",
                " deities than Allah, he loses his faith",
                " forthwith. Secondly, the mushrik himself knows that",
                " there is no guarantee or probability of",
                " any good from his `god' who is",
                " utterly helpless and powerless. As regards the",
                " occasional grant of his request through his",
                " god, this is done by Allah merely",
                " to test his faith.",
                " *19) That is,",
                " the one, who leads a person to",
                " the way of shirk is the worst",
                " guardian and the worst comrade, whether he",
                " be a human being or a satan.",
                ""
            ]
        },
        {
            "id": "[22:14]",
            "verse": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. Indeed, Allah does what He intends.",
            "description": [
                "\"Those who believed and did righteous deeds\"",
                " are quite different from the wavering Muslims,",
                " for they have a firm belief in",
                " Allah, His Prophet and the Hereafter. Therefore",
                " they follow the way of Truth both",
                " in prosperity and in adversity.",
                "*21) That",
                " is, \"Allah's powers are unlimited: He may",
                " bestow anything on anyone He wills in",
                " this world or in the Hereafter or",
                " in both, and bar anything from anyone.",
                " None has the power to interfere with",
                " what He wills and dces\"."
            ]
        },
        {
            "id": "[22:15]",
            "verse": "Whoever should think that Allah will not support [Prophet Muhammad] in this world and the Hereafter - let him extend a rope to the ceiling, then cut off [his breath], and let him see: will his effort remove that which enrages [him]?",
            "description": [
                "There is a great divergence of opinion",
                " about the exact meaning of this verse.",
                " Some of the interpretations are:",
                "(1) One",
                " who presumes that Allah will not help",
                " him (Muhammad: Allah's peace be upon him),",
                " he should hang himself by a rope",
                " from the ceiling.",
                "(2) One who presumes",
                " that Allah will not help him (Muhammad:",
                " Allah's peace be upon him), he should",
                " ascend thesky by a rope and try",
                " to stop Allah's help.",
                "(3) One who",
                " presumes that Allah will not help him",
                " (Muhammad: Allah's peace be upon him), he",
                " should ascend the sky and stop the",
                " process of Revelations.",
                "(4) One who presumes",
                " that Allah will not help him (Muhammad:",
                " Allah's peace be upon him), he should",
                " ascend the sky and stop his provisions.",
                "",
                "(5) The one who presumes that Allah",
                " will not help him (the presumer himself),",
                " he should hang himself by a rope",
                " from the ceiling of his house.",
                "(6)",
                " The one who presumes that Allah will",
                " not help him (the presumer himself), he",
                " should try to ascend the sky to",
                " seek help.",
                "The first four interpretations are",
                " obviously irrelevant to the context, and the",
                " last two, though they might fit in",
                " with the context, do not explain the",
                " real meaning of the verse. If we",
                " consider this in the context, it becomes",
                " obvious that the one who presumes is",
                " \"the one who serves Allah standing on",
                " the border\" . This is to rebuke",
                " him, as if to say, \"You may",
                " do whatever you can to change the",
                " decrees of Allah, but you will see",
                " that no device of yours can succeed,",
                " whether these decrees are favourable to your",
                " designs or unfavourable to them. \" Obviously,",
                " \"he should ascend the sky ...... cut",
                " a hole into it\" has not been",
                " used in the literal but in the",
                " figurative sense."
            ]
        },
        {
            "id": "[22:16]",
            "verse": "And thus have We sent the Qur'an down as verses of clear evidence and because Allah guides whom He intends.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:17]",
            "verse": "Indeed, those who have believed and those who were Jews and the Sabeans and the Christians and the Magians and those who associated with Allah - Allah will judge between them on the Day of Resurrection. Indeed Allah is, over all things, Witness.",
            "description": [
                "This means the \"Muslims\" of every age",
                " who believed in the Prophets of Allah",
                " and His Books upto the time of",
                " Prophet Muhammad (Allah's peace be upon him):",
                " they included both the sincere Muslims and",
                " the wavering Muslims.",
                "*24) See E.N. 72",
                " of Chapter IV (An-Nisa').",
                "*25) \"Sabaeans\": In",
                " ancient times two sects were known by",
                " this title:",
                "(1) The followers of Prophet",
                " John, who were found in upper Iraq",
                " in large numbers and practised baptism.",
                "(2)",
                " The worshippers of stars, who ascribed their",
                " creed to Prophets Shith and Idris (peace",
                " be upon them) and believed that the",
                " elements were governed by the planets and",
                " the planets by the angels. Their centre",
                " was at Harran with branches spread all",
                " over Iraq. These people have been well",
                " known for their knowledge of philosophy and",
                " science and their achievements in medicine.",
                "Probably",
                " here the first sect is referred to,",
                " because the second sect was not known",
                " by this name at the time the",
                " Qur'an was revealed.",
                "*26) See E. N.",
                " 36 of Chapter V (AI-Ma'idah).",
                "*27) That",
                " is, the fire-worshippers of Iran, who believed",
                " in two gods -one of light and",
                " the other of darknesses-and regarded themselves as",
                " the followers of Zoroaster. Their creed and",
                " morals were so corrupted by Mazdak that",
                " a brother could easily enter into matrimony",
                " with his sister.",
                "*28) That is, \"The",
                " mushriks of Arabia and of other countries,",
                " who had no special name like those",
                " mentioned above.\"",
                "*29) That is, \"Allah will",
                " pass His judgment on the Day of",
                " Resurrection in regard to all the differences",
                " and disputes which take place between different",
                " people and different religions and will decide",
                " which of them was right and which",
                " was wrong. \""
            ]
        },
        {
            "id": "[22:18]",
            "verse": "Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allah humiliates - for him there is no bestower of honor. Indeed, Allah does what He wills.",
            "description": [
                "See E.N. 25 Chapter XIII (Ar-Ra`d) and",
                " E.N. 41 of Chapter XVI (An-Nahl).",
                "*31)",
                " That is, \"Angels, stars, planets, etc. and",
                " all the creation that exists in other",
                " parts of the universe, whether it is",
                " rational and possesses freedom of will and",
                " choice like man, or irrational like animals,",
                " vegetation, solid matter, air and light.",
                "*32)",
                " That is, \"A large number of the",
                " people bow down before Allah not by",
                " compulsion but willingly. On the other hand,",
                " there are many other people who bow",
                " down before Him under compulsion along with",
                " everything else in the universe, but they",
                " deserve punishment because they refuse to obey",
                " Allah in those spheres of life in",
                " which they have the choice to obey",
                " or not to obey.",
                "*33) That is,",
                " though the Final Judgment will be passed",
                " on the Day of Resurrection, a discerning",
                " eye can see even today those \"who",
                " have already deserved the torment.\" For instance,",
                " the man who rejects the Message of",
                " the open book of Nature and the",
                " Message of the Prophets and adopts self-made",
                " false creeds and then disputes about them",
                " with the Believers, proves himself to be",
                " in manifest error in this world as",
                " well.",
                " *34) In this verse \"honour\" and",
                " \"disgrace\" mean the acceptance of the Truth",
                " and its rejection. It is obvious that",
                " the one who does not see manifest",
                " realities is doomed to disgrace: for Allah",
                " lets him attain what he desires and",
                " works for; and when Allah does not",
                " bestow on anyone the honour of following",
                " the Truth, there is none else who",
                " can bestow it on him",
                " *35) Here",
                " it is obligatory to perform a sajdah",
                " (prostration), which is agreed upon by all",
                " Jurists. For further details please See E.N.",
                " 157 of Chapter VII (AI-A'raf)."
            ]
        },
        {
            "id": "[22:19]",
            "verse": "These are two adversaries who have disputed over their Lord. But those who disbelieved will have cut out for them garments of fire. Poured upon their heads will be scalding water",
            "description": [
                "Here all the disputants about Allah have",
                " been divided into two main categories in",
                " spite of their large numbers:",
                "(1) Those",
                " who believe in the Message of the",
                " Prophets and adopt the righteous way of",
                " life.",
                "(2) Those who reject their Message",
                " and follow different ways of disbelief, though",
                " they may have countless differences and disputes",
                " among themselves.",
                "*37) See v. 50 and",
                " E.N. 58 of Chapter XIV (Ibrahim) for",
                " explanation."
            ]
        },
        {
            "id": "[22:20]",
            "verse": "By which is melted that within their bellies and [their] skins.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:21]",
            "verse": "And for [striking] them are maces of iron.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:22]",
            "verse": "Every time they want to get out of Hellfire from anguish, they will be returned to it, and [it will be said], \"Taste the punishment of the Burning Fire!\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:23]",
            "verse": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and pearl, and their garments therein will be silk.",
            "description": [
                "This is to show that they will",
                " be honoured like the kings and chiefs",
                " who used to wear ornaments of gold",
                " and jewelry in the period the Qur'an",
                " was revealed."
            ]
        },
        {
            "id": "[22:24]",
            "verse": "And they had been guided [in worldly life] to good speech, and they were guided to the path of the Praiseworthy.",
            "description": [
                "\"Pure Word\": though it may imply every",
                " pure thing, here it refers to the",
                " basic articles of the Faith.",
                "*40) As",
                " already stated in the Introduction, the portion",
                " of the Surah, which was sent down",
                " at Makkah, comes to an end here.",
                " Though its style is clearly that of",
                " the Makki Surahs and there is nothing",
                " to indicate that any part (or the",
                " whole) of it was revealed at al-Madinah,",
                " yet the words, \"these are the two",
                " parties\", have given rise to the misunderstanding",
                " that this verse was revealed at al-Madinah.",
                " Some commentators are of the opinion that",
                " the two parties referred to were the",
                " parties who met in the Battle of",
                " Badr, but there is nothing in the",
                " context to support this opinion. On the",
                " other hand, from the context in which",
                " these words occur, it becomes obvious that",
                " the two parties referred to were the",
                " \"Believers and the disbelievers.\" For the conflict",
                " between Belief and disbelief has always been",
                " going on ever since the creation of",
                " man and will go on upto the",
                " Day of Resurrection.",
                "Incidentally, this latter view",
                " helps prove that the Qur'an is a",
                " continuous whole and every part of it",
                " is closely connected with the other: whereas",
                " the comments mentioned earlier would imply that",
                " there is no continuous theme in the",
                " Qur'an but different parts of it have",
                " been put together without rhyme or reason.",
                ""
            ]
        },
        {
            "id": "[22:25]",
            "verse": "Indeed, those who have disbelieved and avert [people] from the way of Allah and [from] al-Masjid al-Haram, which We made for the people - equal are the resident therein and one from outside; and [also] whoever intends [a deed] therein of deviation [in religion] or wrongdoing - We will make him taste of a painful punishment.",
            "description": [
                "\"Those who disbelieved\" were the people who",
                " rejected the Message of the Holy Prophet.",
                " The subsequent theme clearly shows that they",
                " were the disbelievers of Makkah.",
                "*42) That",
                " is, \"They debarred the Holy Prophet and",
                " his followers from performing Hajj and 'Umrah\".",
                "",
                "*43) That is, \"This is not exclusively",
                " the property of any person or family",
                " or clan but is meant for all",
                " mankind alike. Therefore bone has any right",
                " to debar others from it.\"",
                "In this",
                " connection, two questions have arisen among the",
                " Jurists of Islam:",
                "(1) What is meant",
                " by the \"Sacred Mosque\" ? Dces it",
                " mean the mosque itself or includes the",
                " whole \"Inviolable Place\" of Makkah?.",
                "(2) What",
                " is meant by \"equal rights\" of its",
                " dwellers and the outsiders ?",
                "According to",
                " some jurists it means the \"Sacred Mosque\"",
                " itself and not the whole of Inviolable",
                " Makkah. They base this opinion on the",
                " apparent wording of the Qur'an, and say",
                " that by \"equal rights\" is meant equal",
                " rights only in regard to worship in",
                " it. They cite a Tradition of the",
                " Holy Prophet to support their opinion. He",
                " said: \"O children of 'Abd Manaf, those",
                " of you who will have authority over",
                " the affairs of the people, should not",
                " stop anybody from moving round the Ka'bah",
                " or froth offering prayers in it at",
                " any time of the day or night.\"",
                "",
                "Imam Shafi'i and others who support this",
                " view are of the opinion that it",
                " is wrong to conclude from this verse",
                " that the rights of the dwellers and",
                " the outsiders are equal in every respect,",
                " but they are equal only in regard",
                " to the right of worship and in",
                " nothing else, for the people of Makkah",
                " owned the lands and the houses of",
                " Makkah before Islam and also after it.",
                " So much so that during the time",
                " of Caliph 'Umar, the house of Safwan",
                " bin Umayyah was actually purchased from him",
                " for the purpose of making a prison",
                " in Makkah.",
                "The others who hold that",
                " the \"Sacred Mosque\" refers to the whole",
                " of the \"Inviolable Place\" of Makkah derive",
                " their authority from verses 196 and 217",
                " of Chapter lI (Al-Baqarah). They argue that",
                " Hajj is not performed only in the",
                " Ka'bah (the Sacred Mosque), but the pilgrim",
                " has to visit Mina, Muzdalifah, `Arafat, etc.",
                " for the performance of Hajj rites. Thus,",
                " they hold that equality is not merely",
                " in regard to worship in the \"Sacred",
                " Mosque\", but in regard to all other",
                " rights in Makkah. As this place has",
                " been appointed for Hajj by AIIah for",
                " all alike, none has any right of",
                " ownership in it. Anyone can stay anywhere",
                " he likes and node can prohibit him",
                " from doing so. They cite many Traditions",
                " in support of their opinion:",
                "(1) Abdullah",
                " bin `Umar reports that the Holy Prophet",
                " said: \"Makkah is the place where travellers",
                " have to stay: therefore its lands cannot",
                " be sold nor can anyone charge rent",
                " for its houses.\"",
                "(2) According to Ibrahim",
                " Nakha`i, the Holy Prophet said: \"Makkah has",
                " been made an \"Inviolable Place\" by Allah:",
                " therefore selling its land and charging of",
                " rent for its houses is unlawful\". Mujahid",
                " has also reported a tradition almost in",
                " similar words.",
                "(3) Alqamah says, \"During the",
                " time of the Holy Prophet, and of",
                " the first three Caliphs, the lands of",
                " Makkah were regarded as common property and",
                " one could live there or allow others",
                " to live therein.\"",
                "(4) `Abdullah bin `Umar",
                " says, \"Caliph `Umar had ordered that no",
                " resident of Makkah should close the door",
                " of his house during the Hajj season.\"",
                " According to Mujahid; Caliph `Umar had ordered",
                " that the people of Makkah should not",
                " put doors to enclose their courtyards but",
                " keep them open so that anyone who",
                " liked might come in and stay there.",
                " The same has been related by `Ata'",
                " with the addition that Suhail bin `Amr",
                " was the only exception to this rule,",
                " who was allowed to put a door",
                " in his courtyard in order to safeguard",
                " his camels in connection with his trade.",
                "",
                "(5) `Abdullah bin `Umar also says that",
                " the one who receives rent for his",
                " house in Makkah fills his belly with",
                " fire.",
                "(6) `Abdullah bin `Abbas says that",
                " Allah has made the whole of Makkah",
                " the \"Sacred Mosque\" where all have equal",
                " rights, Therefore the people of Makkah have",
                " no right to charge rent.",
                "(7) `Umar",
                " bin `Abdul `Aziz sent an order to",
                " the governor of Makkah to this effect:",
                " \"No rent should be charged for the",
                " houses of Makkah because it is unlawful\".",
                "",
                "On the basis of the above traditions,",
                " quite a few of the followers of",
                " the Companions and also, Imams Malik, Abu",
                " Hanifah, Sufyan Thauri, Ahmad bin Hanbal and",
                " Ishaq bin Rahawayah from among the Jurists,",
                " are of the opinion that it is",
                " unlawful to sell a piece of land",
                " and to charge rent, at least during",
                " the Hajj season, in Makkah. However, the",
                " majority of the Jurists are of the",
                " opinion that people can own houses in",
                " Makkah and can sell them as buildings",
                " but not as land. In my opinion,",
                " this last view seems to be the",
                " right one because it conforms with the",
                " Qur'an and the Sunnah and the practice",
                " of the rightly-guided Caliphs. It is obvious",
                " that Allah has not made Hajj obligatory",
                " for the Muslims of the whole world",
                " in order to provide a means of",
                " income for the people of Makkah. As",
                " Allah Has set apart the \"Inviolable Place\"",
                " for the benefit of all the Believers,.",
                " that land is not the property of",
                " anyone and every pilgrim has the right",
                " to stay anywhere he can find room",
                " for himself.",
                "*44) It dces not imply",
                " any specific act, but means every act",
                " that deviates from righteousness and falls under",
                " the definition of iniquity. Though all such",
                " acts are sins at alI times and",
                " places; their commission in the \"Inviolable Place\"",
                " makes them all the more heinous; so",
                " much so that the commentators are of",
                " the opinion that even taking of an",
                " unnecessary oath brings it under the same",
                " category.",
                "Besides common sins, there are certain",
                " other things whose commission in the \"",
                " Inviolable Place\" brings them under the same",
                " category. For instance:",
                "(l) It is prohibited",
                " to take legal action even against a",
                " murderer, etc. who takes shelter within the",
                " \"Inviolable Place\": so much so that he",
                " cannot be arrested as long as he",
                " retrains therein. This sanctity of the \"Inviolable",
                " Place\" is being observed since the time",
                " of Prophet Abraham. The Qur'an says, \"Whoso",
                " even enters it, he becomes safe and",
                " secure . . .\" (III: 97).",
                "(2)",
                " The consensus of opinion is that there",
                " can be no retribution within the \"Inviolable",
                " Place\" for the crimes committed outside it.",
                " Hadrat `Umar, `Abdullah bin `Umar and `Abdullah",
                " bin `Abbas declared, \"We will not take",
                " any action in it even against the",
                " murderer of our fathers.\"",
                "(3) It is",
                " unlawful to wage war or shed blood",
                " within it. On the second day of",
                " the conquest of Makkah, the Holy Prophet",
                " declared, \"O people, Allah has trade Makkah",
                " a Sanctuary since the very creation of",
                " this world, and it will remain so",
                " by Allah's ordinance up to the Day",
                " of Resurrection; therefore, it is not lawful",
                " for any man, who believes in Allah",
                " and the Day of Resurrection, to shed",
                " blood here\". Then he added, \"Suppose a",
                " man legalizes bloodshed here on the basis",
                " of the precedent that I waged war",
                " here, tell him, 'Allah made it lawful",
                " for His Messenger and not for you'.",
                " It was made lawful for me for",
                " a short interval of the day. Then",
                " it was again made \"Inviolable\" as before\".",
                "",
                "(4) It is unlawful to cut naturally",
                " growing trees or uproot the grass which",
                " has grown there. It is also prohibited",
                " to hunt birds and animals within the",
                " boundary or to drive them out from",
                " the \"Inviolable Place\" for hunting. It is,",
                " however, lawful to kill a serpent, a",
                " scorpion and other harmful animals and to",
                " uproot dry grass and \"Izkhir\" which is",
                " a kind of grass.",
                "(5) It is",
                " prohibited to pick up anything that has",
                " fallen to the ground. In a Tradition,",
                " reported by Abu Dawud, the Holy Prophet",
                " prohibited people to pick up, anything belonging",
                " to a pilgrim that had fallen to",
                " the ground.",
                "(6) It is unlawful for",
                " a pilgrim who comes with the intention",
                " of performing Hajj or 'Umrah\" to enter",
                " therein without Ihram. However, there is a",
                " divergence of opinion in regard to the",
                " entry of others than the pilgrims without",
                " Ihram. According to 'Abdullah bin `Abbas no",
                " one is allowed to enter therein without",
                " Ihram in any case, and this has",
                " been supported by a saying each of",
                " Imam Ahmad and Imam Shafi`i. According to",
                " other sayings of Imams Ahmad and Shafi`i,",
                " those people who have to visit the'",
                " \"Inviolable Place\" frequently in connection with trade",
                " and business, are excepted. Imam Abu Hanifah,",
                " however, holds the view that the person",
                " who lives within the limits of the",
                " appointed \"Miqats\" can visit Makkah without Ihram",
                " but the outsiders cannot enter it without",
                " Ihram."
            ]
        },
        {
            "id": "[22:26]",
            "verse": "And [mention, O Muhammad], when We designated for Abraham the site of the House, [saying], \"Do not associate anything with Me and purify My House for those who perform Tawaf and those who stand [in prayer] and those who bow and prostrate.",
            "description": [
                "Some commentators opine that the address to",
                " Prophet Abraham ends with v. 26 and",
                " say that the Command contained in v.",
                " 27 was addressed to the Holy Prophet;",
                " but this opinion does not fit in",
                " with the context. For it is obvious",
                " that this Command also was addressed to",
                " Prophet Abraham when he had built the",
                " Ka`bah. Moreover, the command implies that the",
                " House of Allah had been built for",
                " the worship of One Allah and there",
                " was general permission from the very first",
                " day for all worshippers to visit it",
                " for performing Hajj."
            ]
        },
        {
            "id": "[22:27]",
            "verse": "And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every distant pass -",
            "description": [
                "The expression \"lean camels\" has been deliberately",
                " used to depict the picture of the",
                " camels of pilgrims coming from far-off places",
                " to perform Hajj.",
                "*47) In my opinion",
                " the address to Prophet Abraham comes to",
                " an end with v. 27 and vv.",
                " 28-29 have been added to emphasize and",
                " give further instructions for the performance of",
                " Hajj. We have based this opinion on",
                " the use of the epithet \"Ancient House",
                " of the Ka`bah\". It could not have",
                " been used at the time when Prophet",
                " Abraham built it. (For further details about",
                " the construction of the Ka`bah see II:",
                " 125-129, III: 96, 97 and XIV: 35-41).",
                ""
            ]
        },
        {
            "id": "[22:28]",
            "verse": "That they may witness benefits for themselves and mention the name of Allah on known days over what He has provided for them of [sacrificial] animals. So eat of them and feed the miserable and poor.",
            "description": [
                "\"The benefits\" include both religious and worldly",
                " benefits. It was due mainly to the",
                " Ka`bah that during the period of 2500",
                " years between the times of Prophet Abraham",
                " and the Holy Prophet, the Arabs, in",
                " spite of their tribal life, remained attached",
                " to one central place and continued to",
                " visit it from all parts of Arabia",
                " for performing Hajj year after year. This",
                " in turn preserved their language, their culture",
                " and their Arab identity. Then during the",
                " course of the year they were afforded",
                " at least four months of perfect peace",
                " when anybody and everybody could safely travel",
                " alone or in trade caravans; thus the",
                " ritual of Hajj was directly beneficial to",
                " economic life of the country as well.",
                " For details see III: 97 and E.N's",
                " 80, 81 thereof, and V: 97 and",
                " E.N. 113 thereof.",
                "*49) \"The cattle\" here",
                " imply the camel, cow, sheep and goat",
                " as has been clearly mentioned in VI:142-144.\".",
                " . . they should mention the name",
                " of Allah over the cattle\" implies that",
                " they should slaughter the cattle for Allah's.",
                " sake and in His name, as is",
                " clear from the subsequent sentences. Allah's name",
                " should be recited at the time the",
                " cattle are slaughtered to show that the",
                " Muslims are to slaughter and sacrifice animals",
                " in Allah's name alone so as to",
                " distinguish them from the disbelievers who slaughtered",
                " animals without mentioning Allah's name or by",
                " mentioning other names than that of Allah.",
                "",
                "As regards \"the known appointed days\", there",
                " is a difference of opinion as to",
                " their exact identity. Some of the opinions",
                " as to what the \"appointed days\" mean",
                " are:",
                "(1) The first ten days of",
                " Zil-Hajj. This view is supported by Ibn",
                " `Abbas, Hasan Basri, Ibrahim Nakha`i, Qatadah and",
                " several other Companions and their followers. Imams",
                " Abu Hanifah, Shafi`i and Ahmad bin Hanbal",
                " have also favoured this view.",
                "(2) The",
                " tenth of Zil-Hajj and the three days",
                " following it. This view is supported by",
                " Ibn 'Abbas, Ibn `Umar, Ibrahim Nakha`i, Hasan",
                " and `Ata'. Imams Shafi`i and Ahmad are",
                " also reported to have favoured this in",
                " a saying each.",
                "(3) The tenth day",
                " of Zil-Hajj and the two following days.",
                " This view has been supported by Hadrat",
                " `Umar, `Ali, Ibn `Umar, Ibn `Abbas, Anas",
                " bin Malik, Abu Hurairah, Said bin Musayyab",
                " and Said bin Jubair. Sufyan Thauri, Imam",
                " Malik, Imam Abu Yusuf and Imam Muhammad",
                " from among the Jurists have also adopted",
                " it, and the Hanafites and the Malikites",
                " are also generally agreed on this.",
                " *50)",
                " The imperative mood of the verb has",
                " given rise to the misunderstanding that it",
                " is obligatory to eat their flesh and",
                " also to give of it to the",
                " needy people, Imams Shafi`i and Malik opine",
                " that it is good to eat of",
                " it and it is obligatory to give",
                " of it to others. According to Imam",
                " Abu Hanifah, both these things are permitted",
                " but are not obligatory. It is good",
                " to eat of it, for the people",
                " in the days of ignorance considered it",
                " unlawful to eat sacrificial meat of their",
                " own animals, and it is good to",
                " give of it to the poor by",
                " way of help. Ibn Jarir has cited",
                " instances from Hasan Basri, `Ata', Mujahid and",
                " Ibrahim Nakha`i to prove that the imperative",
                " mood dces not always imply a command,",
                " as for example in V: 2 and",
                " LXII: 10. Thus, \".... give of it",
                " to the indigent\" does not mean that",
                " the flesh cannot be given to a",
                " rich person for the Companions of the",
                " Holy Prophet used to give of it",
                " to their friends, neighbours, relatives whether they",
                " were rich or poor. According to Ibn",
                " `Umar, one-third of the flesh may be",
                " consumed at home, one-third may be given",
                " to the neighbours and the remaining one-third",
                " distributed among the needy."
            ]
        },
        {
            "id": "[22:29]",
            "verse": "Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House.\"",
            "description": [
                "It means that after performing the essential",
                " Hajj rites, one should put off Ihram,",
                " have a shave, bath, etc. for one",
                " is free from the restrictions of Ihram",
                " after Hajj. However, one is not allowed",
                " to have sexual relations with his wife",
                " till one has performed the Tawaf of",
                " Ziyarah or Ifadah.",
                "*52) That is, the",
                " vow one has made for that occasion.",
                "",
                "*53) The Arabic word `Atiq, which has",
                " been used for the Ka`bah, is very",
                " meaningful for it implies:",
                "(1) ancient,",
                "(2)",
                " free from the sovereignty and ownership of",
                " anyone,",
                "(3) honoured and revered.",
                "I am",
                " of the opinion that here the word",
                " Tawaf refers to the circumambulation performed on",
                " the tenth day of Zil-Hajj after setting",
                " aside Ihram, as the last ritual of",
                " Hajj, and is called Tawaf of Ifadah",
                " or Ziyarah (Visit)."
            ]
        },
        {
            "id": "[22:30]",
            "verse": "That [has been commanded], and whoever honors the sacred ordinances of Allah - it is best for him in the sight of his Lord. And permitted to you are the grazing livestock, except what is recited to you. So avoid the uncleanliness of idols and avoid false statement,",
            "description": [
                "Though the \"command\" is of a general",
                " nature, here it refers particularly to the",
                " prohibitions which are connected with the \"Sacred",
                " Mosque\", Hajj, 'Umrah and Makkah. Incidentally, there",
                " is a subtle hint in it to",
                " the Quraish; who had driven out the",
                " Muslims from Makkah and debarred them from",
                " Hajj and violated the sanctity of the",
                " \"Ancient House\" by associating indecent, filthy, and",
                " ungodly rites with Hajj and the House",
                " in contradiction to the ways of Abraham.",
                ""
            ]
        },
        {
            "id": "[22:31]",
            "verse": "Inclining [only] to Allah, not associating [anything] with Him. And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place.",
            "description": [
                "\"And the cattle have been made lawful",
                " for you ....\" has been cited here",
                " for two objects:",
                "(1) It is to",
                " refute the custom of the Quraish under",
                " which certain cattle-bahirah. saibah, wasilah and ham-were",
                " considered unlawful. They are being told that",
                " these are also lawful like other cattle.",
                "",
                "(2) It is not unlawful as was",
                " held by the Quraish to eat the",
                " flesh of the cattle even in the",
                " state of \"Ihram\".",
                "*56) This refers to",
                " VI: 145 and XVI: 11S in which",
                " Allah has forbidden the Muslims to eat",
                " what dies of itself, blood, flesh of",
                " swine or what has been slaughtered in",
                " any name other than Allah's.",
                "*57) That",
                " is, \"Refrain from and guard against the",
                " worship of idols just as you avoid",
                " filthy and dirty things\".",
                "*58) Though the",
                " expression \"false things\" is general and implies",
                " lies, false evidence, calumny, etc., here it",
                " particularly refers to those false creeds, rites,",
                " and rituals and superstitious things on which",
                " kufr and shirk have been founded. It",
                " is obvious that there is no greater",
                " lie than associating others with Allah in",
                " His Being, Attributes, Powers and Rights. It",
                " was a falsehood to make bahirah, etc.",
                " unlawful. . See also XVI :116.",
                "To",
                " take a false oath and give a",
                " false evidence also come under this Commandment.",
                " A Tradition from the Holy Prophet says:",
                "",
                "\"A false evidence is equal to shirk",
                " with Allah.\" That is why according to",
                " the Islamic Law, a false witness should",
                " be punished and disgraced. Imams Abu Yusuf",
                " and Muhammad have expressed the opinion that",
                " a person who brings a false witness",
                " in the court should be publicly exposed",
                " and sentenced to a long imprisonment. This",
                " was the actual practice in the time",
                " of Hadrat `Umar. According to Makhul, he",
                " said:",
                "\"Such a person should be whipped,",
                " his head shaved and face blackened and",
                " he should be sentenced to a long",
                " imprisonment.\"",
                "'Abdullah bin `Amir has reported from",
                " his father that a person's false evidence",
                " was established in Hadrat `Umar's court, whereupon",
                " the Caliph kept him exposed to public",
                " for a day, saying that he was",
                " so and so and a false witness",
                " so that people might recognize him, and",
                " then he imprisoned him. These days this",
                " can be done by publishing the culprit's",
                " name in the newspapers, etc.",
                "*59) In",
                " this parable \"heaven\" means the original human",
                " nature. Man by nature is the servant",
                " of none else but AIIah and inherently",
                " accepts the Doctrine of Tauhid. That is",
                " why the one who follows the guidance",
                " of the Prophets becomes firm in these",
                " dictates of his nature and soars higher",
                " and higher. On the other hand, the",
                " one who rejects Allah or associates a",
                " partner with Him falls down from the",
                " \"heaven\"of his nature. Then he either becomes",
                " a victim of satans and evil leaders",
                " like the birds of the parable, which",
                " snatch away the fallen man, or he",
                " becomes a slave of his lusts, passions,",
                " whims, etc., which have been likened to",
                " the wind i' the parable. They lower",
                " him down from one wrong position to",
                " the other till he falls into the",
                " deepest abyss of degradation."
            ]
        },
        {
            "id": "[22:32]",
            "verse": "That [is so]. And whoever honors the symbols of Allah - indeed, it is from the piety of hearts.",
            "description": [
                "\"Symbols of God worship\": the performance of",
                " Salat, Hajj, Fasting, etc., or things like",
                " a Mosque or sacrificial offerings, etc. (See",
                " V: 2 and E.N.'s 5-7 thereof).",
                "*61)",
                " That is, the observance of the sanctity",
                " of the \"Symbols\" by a man is",
                " a proof that there is piety in",
                " his heart. On the other hand, the",
                " man who violates their sanctity proves himself",
                " to be void of piety and fear",
                " of God. It shows that he either",
                " does not believe at all in Allah",
                " or adopts a rebellious attitude against Him.",
                ""
            ]
        },
        {
            "id": "[22:33]",
            "verse": "For you the animals marked for sacrifice are benefits for a specified term; then their place of sacrifice is at the ancient House.",
            "description": [
                "This is to remove the misunderstanding about",
                " getting any benefit from the animals dedicated",
                " for sacrifice as they were also included",
                " in the \"Symbols of Allah. This was",
                " necessitated because the Arabs believed that it",
                " was unlawful to get any benefit from",
                " them. One could neither ride on them",
                " nor carry any load on them nor",
                " consume their milk, after they had been",
                " dedicated for sacrifice during Hajj. In this",
                " verse that misunderstanding has been removed. Hadrat",
                " Abu Hurairah and Anas have reported that",
                " the Holy Prophet saw a tnan walking",
                " in a miserable condition on foot leading",
                " his camel by the nose-string. When the",
                " Holy Prophet asked him to ride on",
                " it, he replied that it was his",
                " sacrificial offering. The Holy Prophet again urged",
                " him to ride on his camel.",
                "There",
                " is a divergence of opinion in regard",
                " to the interpretation of \"an appointed time\".",
                " Some commentators, particularly Ibn `Abbas, Qatadah, Mujahid,",
                " Dahhak and `Ata' are of the view",
                " that it refers to the time of",
                " the dedication of the animals for sacrifice.",
                " Obviously this is not the correct view,",
                " because in that case the permission to",
                " get benefit from them becomes meaningless. There",
                " are other commentators including `Urwah bin Zubair",
                " and `Ala' bin Abi Rabah, who are",
                " of the view that \"appointed time\" means",
                " the time of sacrifice and one can",
                " get benefit from them up till then.",
                " One may ride on them, drink their",
                " milk, take their young ones for use",
                " and shear their hair, wool, etc. Imam",
                " Shaf`i has adopted this view. The Hanafites",
                " are of the opinion that one can",
                " get benefit from them, if need be,",
                " though it is preferable not to do",
                " so.",
                "*63) It does not mean that",
                " the sacrifice is to be made in",
                " the precincts of the \"Ancient House\" of",
                " the Ka`ah. The Qur'an uses the \"House",
                " of Allah\" or Masjid-i-Haram for the whole",
                " of the \"Inviolable Place\" of Makkah and",
                " not for that particular building. (V: 95).",
                ""
            ]
        },
        {
            "id": "[22:34]",
            "verse": "And for all religion We have appointed a rite [of sacrifice] that they may mention the name of Allah over what He has provided for them of [sacrificial] animals. For your god is one God, so to Him submit. And, [O Muhammad], give good tidings to the humble [before their Lord]",
            "description": [
                "This verse implies two things:",
                "(l) Sacrifice",
                " has been an essential part of the",
                " worship of One Allah in all the",
                " revealed religions. In order to inculcate Tauhid,",
                " Allah prohibited sacrifice for anyone other than",
                " Himself. This was in keeping with the",
                " other prohibitions which were made for others",
                " than Allah. For instance, \"prostration\" before anyone",
                " other than Allah, making vows for others",
                " than Allah, visiting holy places others than",
                " those prescribed by Allah, fasting in the",
                " name of others than of Alla, etc.,",
                " were alI prohibited.",
                "(2) The other thing",
                " which has been common in all the",
                " revealed religions was the object of the",
                " sacrifice in the name of Allah though",
                " its details have been different in different",
                " religions, times and countries.",
                "*65) The Arabic",
                " word `mukhbitin' has no equivalent in English.",
                " It includes those who 11) give up",
                " pride, arrogance and adopt humility before Allah,",
                " (2) surrender themselves to His service and",
                " slavery, and (3) accept His decrees sincerely.",
                ""
            ]
        },
        {
            "id": "[22:35]",
            "verse": "Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them.",
            "description": [
                "It means that righteous people spend their",
                " lawful provisions in the Way of Allah",
                " to meet their own and their dependents'",
                " lawful needs, to help their relatives, neighbours",
                " and other needy people, on public works",
                " and propagation of the Word of Allah.",
                " It dces not include expenditure in unlawful",
                " ways for unlawful purposes. The Qur'anic term",
                " lnfaq implies neither over-spending nor being miserly",
                " and stingy, but spending one's wealth on",
                " oneself and others according to one's means",
                " and status in society."
            ]
        },
        {
            "id": "[22:36]",
            "verse": "And the camels and cattle We have appointed for you as among the symbols of Allah; for you therein is good. So mention the name of Allah upon them when lined up [for sacrifice]; and when they are [lifeless] on their sides, then eat from them and feed the needy and the beggar. Thus have We subjected them to you that you may be grateful.",
            "description": [
                "Seven persons can become partners in the",
                " sacrifice of one camel and likewise in",
                " the sacrifice of one cow and the",
                " like, as enjoined by the Holy Prophet",
                " in a Tradition reported by Jabir bin",
                " `Abdullah in the Collection of Hadith by",
                " Muslim.",
                "*68) That is, \"You should sacrifice",
                " animals because you get many benefits front",
                " them to show your gratitude to AIIah,",
                " the Giver, and also to acknowledge His",
                " Supremacy and Sovereignty\".",
                "*69) It should be",
                " noted that a camel is sacrificed while",
                " it is standing. This was enjoined by",
                " the Holy Prophet and is supported by",
                " Ibn `Abbas, Mujahid, I)ahhak, etc. Muslim and",
                " Bukhar have reported a Tradition from Hadrat",
                " Ibn Umar, who saw a man slaughtering",
                " his camel in the sitting position. He",
                " said to him, \"Tie one foot of",
                " your camel and make it stand, because",
                " that is the way of Abul Qasim",
                " (peace be upon him)\". According to a",
                " tradition reported by Hadrat Jabir bin 'Abdullah,",
                " in Abu Dawud, the Holy Prophet and",
                " his Companions would tie a left foot",
                " of the camel and would make it",
                " stand on three feet; then they would",
                " slaughter it. The same is implied by",
                " the subsequent sentence: \" ...and after their",
                " backs lie still on the ground .......\",",
                " i.e. when they fall down to the",
                " ground after enough of their blood has",
                " run out.",
                "*70) \"Mention the name of",
                " Allah over them\" implies that animals should",
                " be slaughtered by pronouncing the name of",
                " Allah over them, because without that their",
                " flesh would be unlawful to eat. This",
                " shows that in the Islamic Law there",
                " is no conception of slaughtering an animal",
                " without pronouncing the name of Allah over",
                " it. According to Traditions, there are different",
                " wordings for pronouncing the name of Allah",
                " over the animals at the time of",
                " their slaughter. Some of these are:",
                "(I)",
                " Bismillahi Allahu Akbar; Allahumma minks wa laka:",
                " \"In the name of Allah, AIIah is",
                " most Great! O Allah, this is Thine",
                " and is presented to Thee\".",
                "(2) Allahu",
                " Akbar- La ilaha ill-Allahu; Allahumma minks wa",
                " laka: \"Allah is most Great: There is",
                " no god but Allah: O Allah, this",
                " is Thine and is presented to Thee\"",
                " .",
                "(3) Inni wajjahtu wajhiya lillazi fatar-as-sama",
                " wati wal-arda, hanif-an-wa ma ana min-al-mushrikin. Inns",
                " Salati wa nusuki wa mahyaya wa mamati",
                " lillahi Rabb-il- 'alamin. La sharika lahu wa",
                " bi-zalika umirtu wa ana min-al-Muslimin. A llahumma",
                " minks wa laka. \"I have turned my",
                " face sincerely towards the Being Who created",
                " the heavens and the earth, and I",
                " am not from among the idolatrous people.",
                " My Salat and my rites of worship",
                " and my life and my death are",
                " all for AIIah, the Lord of the",
                " universe, Who has no partner with Him.",
                " This is what I have been enjoined",
                " and I am the first to surrender",
                " to Him. O Allah! This is Thine,",
                " and is presented to Thee\" .",
                "*71)",
                " \".......lie still on the ground.......\" means till",
                " they die completely, for the Holy Prophet",
                " prohibited to cut off a piece of",
                " flesh, if there is still any sign",
                " of life in the slaughtered animal; if",
                " this is done, the piece of flesh",
                " would be unlawful.",
                "*72) This is another",
                " reason why animals should be sacrificed: \"They",
                " should be sacrificed as a mark of",
                " gratitude to Allah Who has subjected them",
                " to you\"."
            ]
        },
        {
            "id": "[22:37]",
            "verse": "Their meat will not reach Allah, nor will their blood, but what reaches Him is piety from you. Thus have We subjected them to you that you may glorify Allah for that [to] which He has guided you; and give good tidings to the doers of good.",
            "description": [
                "This prescribes a very important condition for",
                " the sacrifice made in the worship of",
                " Allah. A sacrifice is acceptable to Allah",
                " only if it is accompanied by piety",
                " and sincerity. Though sacrifice is a Symbol",
                " of Allah, yet it has been made",
                " plain that it is accepted only if",
                " it is accompanied by piety, saying, \"Neither",
                " their flesh reaches Allah nor their blood,",
                " but it is your piety ....\" This",
                " was also meant to condemn the ritual",
                " of the days of ignorance, when the",
                " Arabs took the flesh to the Ka'bah",
                " and smeard its walls with the blood",
                " of the sacrificed animal.",
                "*74) \".... you",
                " should glorify Allah\" at the time of",
                " sacrifice verbally also in order to acknowledge",
                " that the animals really belong to Allah",
                " and to no one else. One of",
                " the sentences uttered at the time of",
                " sacrifice is Allahumma minka wa laka (O",
                " Allah, this animal is Thine and is",
                " presented to Thee).",
                "It should be noted",
                " well that the command of sacrifice as",
                " contained in verses 36 and 37 is",
                " not for the pilgrims alone and that",
                " the performance of sacrifice is not confined",
                " to Makkah on the occasion of Hajj.",
                " It is a general command for all",
                " those Muslims who are well off. They",
                " have been enjoined to be grateful to",
                " Allah because He has subjected these animals",
                " for the good of all human beings.",
                " Therefore they are required to sacrifice the",
                " animals during these days so that they",
                " may spiritually join those who go to",
                " Makkah to perform Hajj.",
                "There are many",
                " authentic Traditions to the effect that the",
                " Holy Prophet made sacrifice on this occasion,",
                " while he was personally at al-Madinah:",
                "(1)",
                " \"The one who dces not perform sacrifice",
                " even though he can should not join",
                " us in the `Id Prayer\". (Musnad Ahmad,",
                " Ibn Majah).",
                "(2) According to a Tradition",
                " reported by Ibn 'Umar, the Holy Prophet",
                " dwelt at al-Madinah for ten years and",
                " performed sacrifice every year. (Tirmizi).",
                "(3) According",
                " to Hadrat Anas, the Holy Prophet said:",
                "",
                "\"The one who sacrificed an animal before",
                " the 'Id Prayer, should offer another sacrifice;",
                " but the one who sacrificed his animal",
                " after the 'Id Prayer, did the right",
                " thing and followed the way of the",
                " Muslims\". (Bukhari)",
                "It this connection, it is",
                " note-worthy that no `Id Prayer is held",
                " on the tenth of Zil-Hajj in Makkah:",
                " therefore the injunction was meant for all",
                " Muslims and not only for those performing",
                " Hajj at Makkah.",
                "Thus, it is clear",
                " that the sacrifice on the occasion of",
                " 'Id which is observed in the whole",
                " Muslim world is a Sunnah of the",
                " Holy Prophet and has been enjoined by",
                " him. The only dispute is whether it",
                " is obligatory in nature or only a",
                " Sunnah. Ibrahim Nakha'i, Imams Abu Hanifah, Malik,",
                " Muhammad and, according to a Tradition, Imam",
                " Abu Yusuf too, are of the opinion",
                " that it is Obligatory in nature. On",
                " the other hand, Imams Shafi`i and Ahmad",
                " bin Hanbal regard it only as a",
                " Sunnah of the Muslims, and Sufyan _Thauri",
                " has also agreed with them, saying that",
                " there will be no harm if a",
                " person dces not offer a sacrifice. It",
                " is, however, an irony that some of",
                " the \"learned\" Muslims of our time, who",
                " follow neither the Qur'an nor the Sunnah,",
                " and are only guided by personal whims,",
                " have declared that if there is a",
                " consensus of opinion of the Muslims, they",
                " can give up the practice of sacrifice",
                " on the occasion of 'Id."
            ]
        },
        {
            "id": "[22:38]",
            "verse": "Indeed, Allah defends those who have believed. Indeed, Allah does not like everyone treacherous and ungrateful.",
            "description": [
                "' From here the address for the",
                " first time prepares the Muslims for Jihad.",
                " In order to understand this, we should",
                " keep in view the preceding portion (vv.",
                " 19-24) in which the ideological conflict between",
                " the two parties (Believers and disbelievers) and",
                " the result thereof have been described. This",
                " naturally serves as a prelude to the",
                " armed conflict between the two parties. That",
                " is why in vv. 26-37 the immediate",
                " causes which necessitated war have been stated",
                " to serve as an introduction and justification",
                " for war with the disbelievers of Makkah.",
                "",
                "After the migration to al-Madinah, when the",
                " first Hajj season approached, it naturally brought",
                " along with it anguish and anger both",
                " for the Muhajirs and the Ansar, who",
                " had been debarred froth visiting Makkah and",
                " performing Hajj, That is why, in this",
                " passage (vv. ,26-37) the rituals and the",
                " objects of Hajj have been described to",
                " bring home to the disbelievers that they",
                " had no right to debar anyone from",
                " Hajj. On the other hand, the Muslims",
                " are being prepared to fight not with",
                " the intention of wreaking vengeance but for",
                " the sake of reform. At the same",
                " time sacrifice on the occasion of Hajj",
                " has been prescribed as a permanent rite",
                " to enable them (and the Muslims of",
                " the whole world) to commemorate Hajj and",
                " the rites conected with it, so that",
                " they might refrain from wreaking vengeance on",
                " the people of Makkah for the persecution",
                " to which they had been subjected. They",
                " have, therefore, been enjoined to fight to",
                " bring about better conditions and not to",
                " take. revenge on their persecutors.",
                "*76) The",
                " Arabic word mudafi at implies two things:",
                "",
                "(1) to fight with the enemy to",
                " ward off his aggressive attack;",
                "(2) to",
                " fight with the enemy not just once",
                " but whenever the need arises. Allah has",
                " assured the Believers that He will defend",
                " them against the enemy every tithe there",
                " is a conflict between Islam and kufr.",
                " This is to encourage the Believers that",
                " they will not be left alone in",
                " their defence, but Allah Himself will be",
                " a party with them and will help",
                " them to frustrate the cunning designs of",
                " the enemy and to ward off their",
                " attacks. Indeed this verse is a great",
                " encouragement for the Believers, for it imbues",
                " their hearts with spirit and strength which",
                " nothing else can.",
                "*77) Allah becomes a",
                " party with the Believers because they are",
                " justified in waging war against the disbelievers",
                " who are treacherous and ungrateful to Allah",
                " in spite of His marry blessings and",
                " favours to them."
            ]
        },
        {
            "id": "[22:39]",
            "verse": "Permission [to fight] has been given to those who are being fought, because they were wronged. And indeed, Allah is competent to give them victory.",
            "description": [
                "This (v. 39) is the first verse",
                " of the Qur'an in which permission to",
                " tight was given in the month of",
                " Zil-Hajj in the first year after Hijrah",
                " according to our research. Then the command",
                " to fight was given in vv. 190,",
                " 191, 193, 216 and 244 of Chapter",
                " II (Al-Baqarah) in Rajab or Sha`ban of",
                " A.H. 2.",
                "*79) \".....and Allah is certainly",
                " able to help them\": this assurance was",
                " urgently needed by the persecuted Muslims whose",
                " fighting strength at that time was very",
                " meagre-not even a thousand including all the",
                " migrants and the Muslims of al-Madinah. On",
                " the other hand, the fighting strength of",
                " the Quraish by themselves was much greater.",
                " Besides, they had all the other mushrik",
                " clans of Arabia at their back and",
                " were joined later by the Jews as",
                " well. Therefore, this assurance was most opportune",
                " and the challenge to the disbelievers was",
                " very significant, for itmeant to say that",
                " they were not fighting against a small",
                " number of the Muslims but against Allah.",
                " Therefore, \"You are. welcome to fight if",
                " you dare\". '"
            ]
        },
        {
            "id": "[22:40]",
            "verse": "[They are] those who have been evicted from their homes without right - only because they say, \"Our Lord is Allah.\" And were it not that Allah checks the people, some by means of others, there would have been demolished monasteries, churches, synagogues, and mosques in which the name of Allah is much mentioned. And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might.",
            "description": [
                "The mention of their expulsion from their",
                " homes in v. 40 is a clear",
                " proof that this portion of Surah al-Hajj",
                " was revealed at al-Madinah.",
                "*81) In order",
                " to have an idea of the severe",
                " persecution of the Muslims, a few instances",
                " of this are cited.",
                "(1) Hadrat Suhaib",
                " Rumi was deprived of everything, when he",
                " was about to migrate to al-Madinah. When",
                " he reached there, he had nothing with",
                " him except the clothes he was wearing.",
                " Though he had earned all that through",
                " his own labours he was deprived of",
                " everything by the disbelievers of Makkah.",
                "(2)",
                " When Hadrat Abu Salmah was about to",
                " leave Makkah with his wife and a",
                " suckling child, his in-laws forcibly separated his",
                " wife from him, and then the people",
                " of his own family tore away the",
                " child from them. Thus the poor woman",
                " had to pass one whole year in",
                " sorrow and grief. After a year, she",
                " secured the child somehow and journeyed from",
                " Makkah to al-Madinah with it all alone",
                " on a dangerous route.",
                "(3) `Ayyash bin",
                " Rabi`ah was a half brother of Abu",
                " Jahl: When he migrated to alMadinah, he",
                " was followed by Abu Jahl and another",
                " brother of his, and they told him",
                " the lie: \"Your mother has taken the",
                " oath that she will not move from",
                " the sun to the shade nor comb",
                " her hair until she should see you",
                " (`Ayyash) You should therefore go back with",
                " us to Makkah,' show her your face",
                " and then come back\". He was taken",
                " in by this trick. When they were",
                " journeying back the two brothers made him",
                " a prisoner, took him to Makkah with",
                " his hands and feet tied, and proclaimed,",
                " \"O people of Makkah, this is how",
                " these lads should be treated and set",
                " right\". He remained in that state for",
                " a long time and was at last",
                " rescued by a brave Muslim.",
                "*82) Saumah",
                " (pl. Swami), Biy`ah and Salawat in the",
                " original Text are the places of worship",
                " of the monks who have left the",
                " world, the Christians and the Jews respectively.",
                " Salawat was Salauta in Aramaic, which might",
                " be the origin of the English words",
                " salute and salutation.",
                "*83) In this sentence,",
                " a Divine principle has been stated:",
                "\"Allah",
                " dces not let a group of people",
                " or a community have authority for ever.",
                " Every now and then He repels one",
                " group by means of another\".",
                "If this",
                " had not been the case, the permanent",
                " dominator would have created chaos not only",
                " in the political and economic spheres, but",
                " would have encroached upon the places of",
                " worship as well. This \"principle\" has also",
                " been stated in v. 251 of Chapter",
                " II (Al-Baqarah)."
            ]
        },
        {
            "id": "[22:41]",
            "verse": "[And they are] those who, if We give them authority in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters.",
            "description": [
                "Those \"who help Allah\" are the people",
                " who invite mankind to Tauhid and exert",
                " their utmost to establish the \"True Faith\"",
                " and righteousness. For further explanation see E.N.",
                " 50 of Chapter III (AI-i-`Imran).",
                "*85) \".......if",
                " We give them power ...... evil\": In",
                " this one sentence, the real aim of",
                " the Islamic State and the characteristics of",
                " those who conduct its affairs have been",
                " stated concisely but comprehensively. Those who help",
                " Allah and deserve His succour behave righteously,",
                " establish Salat, make arrangements for the collection",
                " of Zakat and use their power and",
                " authority to propagate good and eradicate evil.",
                "",
                "*86) That is, \"It is Allah Who",
                " decides whom to give power in the",
                " land and when\" . This is meant",
                " to remove the misunderstanding of the proud",
                " and arrogant people who think that the",
                " destiny of the land and its dwellers",
                " is in their hands, and there is",
                " none to depose them from power. But",
                " Allah dethrones the most haughty ruler in",
                " supernatural ways and gives power to the",
                " most humble in order to show that",
                " He is All-Powerful, All-Mighty."
            ]
        },
        {
            "id": "[22:42]",
            "verse": "And if they deny you, [O Muhammad] - so, before them, did the people of Noah and 'Aad and Thamud deny [their prophets],",
            "description": [
                "\"The disbelievers of Makkah\"."
            ]
        },
        {
            "id": "[22:43]",
            "verse": "And the people of Abraham and the people of Lot",
            "description": [
                "*"
            ]
        },
        {
            "id": "[22:44]",
            "verse": "And the inhabitants of Madyan. And Moses was denied, so I prolonged enjoyment for the disbelievers; then I seized them, and how [terrible] was My reproach.",
            "description": [
                "The instances of some peoples who rejected",
                " their Prophets have been cited to impress",
                " that they were given respite to reform",
                " themselves before they were punished. Therefore, \"O",
                " people of Makkah, you should not be",
                " deluded by the delay in your punishment.",
                " When the term of respite comes to",
                " an end, you shall also be punished",
                " like the former people, if you do",
                " not mend your ways in the meantime\"",
                " .",
                "*89) The Arabic word Nakir is",
                " very comprehensive and implies two meanings:",
                "(1)",
                " Displeasure at the evil conduct of the",
                " other, and",
                "(2) a terrible punishment which",
                " disfigures the culprit so badly that he",
                " cannot even be recognized. The sentence therefore",
                " will mean: \"Just see when I seized",
                " them for this evil conduct, how terrible",
                " was My chastisement\"."
            ]
        },
        {
            "id": "[22:45]",
            "verse": "And how many a city did We destroy while it was committing wrong - so it is [now] fallen into ruin - and [how many] an abandoned well and [how many] a lofty palace.",
            "description": [
                "In Arabic a \"well\" is synonymous with",
                " a \"habitation\". Thus \"many a well ....",
                " useless\" means \"many a habitation has been",
                " destroyed\"."
            ]
        },
        {
            "id": "[22:46]",
            "verse": "So have they not traveled through the earth and have hearts by which to reason and ears by which to hear? For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts.",
            "description": [
                "The words \".... the hearts .... blind\"",
                " have been used in the metaphorical and",
                " not in the literal sense. Since the",
                " heart is regarded as the centre of",
                " emotions, feelings and of mental and moral",
                " qualities, these words have been used to",
                " imply that their obduracy has inhibited them",
                " from feeling and acting rationally."
            ]
        },
        {
            "id": "[22:47]",
            "verse": "And they urge you to hasten the punishment. But Allah will never fail in His promise. And indeed, a day with your Lord is like a thousand years of those which you count.",
            "description": [
                "This refers to the oft-repeated challenge by",
                " the disbelievers: \"Well, if you are a",
                " true prophet, why dces not that chastisement",
                " come with which you have been threatening",
                " us, for we have been rejecting your",
                " claim of being a true Prophet of",
                " Allah ?\"",
                "*93) That is, \"The decisions",
                " of Allah do not follow your time",
                " and calendar, nor do the consequences of",
                " your wrong attitudes appear immediately after the",
                " deeds\". Therefore it will be very foolish",
                " nn the part of a people to",
                " argue that the threat of punishment was",
                " empty just because a decade or a",
                " century had passed since they had adopted",
                " a wicked attitude and conduct with impurity.",
                ""
            ]
        },
        {
            "id": "[22:48]",
            "verse": "And for how many a city did I prolong enjoyment while it was committing wrong. Then I seized it, and to Me is the [final] destination.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:49]",
            "verse": "Say, \"O people, I am only to you a clear warner.\"",
            "description": [
                "That is, \"I am merely a warner",
                " and not the maker of your destinies.",
                " It is Allah Who passes judgement and",
                " decides about the punishment.\""
            ]
        },
        {
            "id": "[22:50]",
            "verse": "And those who have believed and done righteous deeds - for them is forgiveness and noble provision.",
            "description": [
                "\"The Believers shall have forgiveness\" means that",
                " Allah will overlook their faults, weaknesses, and",
                " acts of omission and commission. They will",
                " have \"honourable provisions\" means that they will",
                " have excellent supplies which will be given",
                " to them in an honourable way."
            ]
        },
        {
            "id": "[22:51]",
            "verse": "But the ones who strove against Our verses, [seeking] to cause failure - those are the companions of Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:52]",
            "verse": "And We did not send before you any messenger or prophet except that when he spoke [or recited], Satan threw into it [some misunderstanding]. But Allah abolishes that which Satan throws in; then Allah makes precise His verses. And Allah is Knowing and Wise.",
            "description": [
                "For the distinction between Nabi and Rasul,",
                " refer to E. N. 30 of Chapter",
                " XIX (Maryam).",
                "*97) The Arabic word tamanna",
                " has two meanings: \"desire\" and \"to recite\"",
                " something.",
                ">*98) If the first meaning is",
                " taken, it will imply: \"Satan tried to",
                " prevent the fulfilment of his desire.\" If",
                " the second meaning is taken, it will",
                " imply: \"When the Prophet recited the Revelations,",
                " Satan created different sorts of doubts about",
                " its truth and meanings in the minds",
                " of the people.\"",
                "*99) If the first",
                " meaning is adopted, it will imply: \"Allah",
                " fulfils the Prophet's desire and makes his",
                " Mission successful in spite of the obstacles",
                " of Satan and confirms the truth of",
                " His Revelations by fulfilling His promises to",
                " the Prophet\". In case of the second",
                " meaning, it will imply: \"Allah eradicates all",
                " the doubts and objections inspired by Satan",
                " in the hearts of the people and",
                " clarifies the confusion created about any verse",
                " of the Qur'an in subsequent Revelations\".",
                "*100)",
                " \"Allah is All-Knowing\" and has full knowledge",
                " of the mischief worked by Satan and",
                " of its effects, and being ;'All-Wise\", He",
                " counteracts every mischief of Satan."
            ]
        },
        {
            "id": "[22:53]",
            "verse": "[That is] so He may make what Satan throws in a trial for those within whose hearts is disease and those hard of heart. And indeed, the wrongdoers are in extreme dissension.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:54]",
            "verse": "And so those who were given knowledge may know that it is the truth from your Lord and [therefore] believe in it, and their hearts humbly submit to it. And indeed is Allah the Guide of those who have believed to a straight path.",
            "description": [
                "That is, \"Allah lets Satan work such",
                " mischiefs to put to the test both",
                " the righteous and the wicked people\". The",
                " people with a perverted mentality deduce wrong",
                " conclusions from these and deviate from the",
                " Right Way, while those, who think on",
                " the right lines, realize that all these",
                " things are the mischiefs of Satan and",
                " that the Message of the Prophet is",
                " based on the Truth. They conclude that",
                " the very fact that Satan has been",
                " so much agitated and become active against",
                " it is a clear proof of its",
                " being the Truth. It is very important",
                " to understand the real significance of this",
                " passage (vv. 52-54) for this has given",
                " rise to a grave misunderstanding .",
                "If",
                " we consider it in the context in",
                " which it occurs, it becomes obvious that",
                " it was sent down to refute the",
                " wrong appraisal of the casual observers that",
                " the Holy Prophet had \"failed\" to achieve",
                " his desired object. This was because he",
                " had striven for thirteen long years to",
                " persuade his people to accept his Message",
                " but the apparent result was that he",
                " had not only failed in this, but",
                " he and the small band of his",
                " followers had been forced to leave their",
                " homes. As this \"exile\" contradicted his claim",
                " that he was a Prophet of Allah",
                " and had His approval and succour with",
                " him, some people became sceptical about it.",
                " Moreover, they became doubtful about the truth",
                " of the Qur'an, because they were not",
                " being visited by the scourge, which was",
                " inflicted on those who treated the Prophet",
                " as false. His antagonists scoffed at him,",
                " saying, \"Where is that succour of Allah",
                " and the scourge with which we were",
                " threatened?\" The answer to these doubts of",
                " the disbelievers was given in the preceding",
                " passage, and in this passage the addressees",
                " were those who were influenced by this",
                " propaganda. Briefly the whole answer was to",
                " this effect:",
                "\"lt is not a new",
                " thing that the people of a Messenger",
                " have treated him as an impostor for",
                " it has always been happening like this:",
                " You can see from the remnants of",
                " those peoples who treated their Messengers as",
                " impostors how they were punished for their",
                " mischief. You can learn a lesson from",
                " them, if you will. As regards the",
                " delay in the coming of scourge, the",
                " Qur'an never threatened the disbelievers ' with",
                " immediate punishment, nor is it the job",
                " of the Messenger to inflict punishments. The",
                " scourge is sent by Allah, but He",
                " is not hasty in sending His torment.",
                " He gives respite to the people to",
                " mend their ways as He is giving",
                " you now. Therefore, you should not be",
                " under any delusion that the threats of",
                " scourge are empty threats.",
                "\"It is also",
                " not a new thing that the desires",
                " and wishes of a Prophet meet with",
                " obstacles or that false propaganda is made",
                " against his Message for the same has",
                " already happened with regard to the Messages",
                " of the former Prophets. But ultimately Allah",
                " eradicated the mischief worked by Satan and",
                " made the Message successful. Therefore you should",
                " take a warning from the past history",
                " of Satan's mischiefs and their ultimate failure.",
                " You should note it well that the",
                " obstacles and the mischiefs of Satan are",
                " a trial and means that help attract",
                " the righteous people towards Islam and winnow",
                " the dishonest people away from it\" .",
                "",
                "It is a pity that in spite",
                " of the above clear and simple meaning",
                " of the passage which fits in well",
                " with the context, a grave misunderstanding has",
                " arisen because of a tradition which has",
                " not only changed its meaning entirely and",
                " rendered it irrelevant in the context but",
                " has helped make doubtful the very basic",
                " Articles of the Faith. Therefore we are",
                " making a critical appraisal of the tradition",
                " in order to show how to make",
                " the right use of traditions for the",
                " correct interpretation of the Qur'an.",
                "According to",
                " this tradition, the Holy Prophet had a",
                " strong longing and desire to this effect:",
                " \"I wish some Revelations were sent down",
                " to tone down the abhorrence of the",
                " mushrik Quraish against Islam so as to",
                " bring them nearer to it, or at",
                " least the criticism against their creed may",
                " not be so severe as to arouse",
                " their enmity\" .",
                "While he was cherishing",
                " this desire, it so happened that one",
                " day when he was sitting in a",
                " big gathering of the Quraish, Surah An-Najm",
                " (LIII) was sent down and he began",
                " to recite it. When he came to",
                " vv. 19, 20: \"Have you ever considered",
                " about this Lat and this `Uzza, and",
                " a third (goddess) Manat, \"all of a",
                " sudden he recited, \"These are exalted goddesses;",
                " indeed their intercession may be expected\". After",
                " this he continued to recite Surah An-Najm",
                " up to the last verse and then",
                " fell down in prostration and all the",
                " Muslims and the mushriks of the Quraish",
                " also did the same, for the latter",
                " said, \"Now we have no difference with",
                " Muhammad; we also profess that Allah is",
                " the Creator and the Provider and that",
                " these deities of ours are merely our",
                " intercessors with Him\" . After this, when",
                " in the evening Angel Gabriel came, he",
                " said, \"What have you done? I did",
                " not bring these two sentences\". At this",
                " the Holy Prophet became very sad and",
                " Allah sent down vv. 73 75 of",
                " Surah Bani Isra`il (XVII): \"O Muhammad! these",
                " people have left no stone unturned to",
                " tempt you away from that which We",
                " have revealed to you so that you",
                " might fabricate something in Our name. Had",
                " you done that, they would have made",
                " you their friend. It was just possible",
                " that you might have inclined a little",
                " towards them, if We had not given",
                " you strength. But if you had done",
                " so, We would have made you taste",
                " double chastisement in this world as well",
                " as in the Hereafter: then you would",
                " have found no helper against Us\".",
                "But",
                " in spite of this, he continued to",
                " be grieved till Allah sent down v.",
                " 52 of this Surah (Al-Hajj) in which",
                " Allah consoled him, saying that the same",
                " had been happening to the former Prophets.",
                "",
                "Another thing that happened in the meantime",
                " was that the story reached the migrants",
                " to Habash that there had been a",
                " reconciliation between the Holy Prophet and the",
                " disbelievers of Makkah. Accordingly, many of them",
                " returned to Makkah only to learn that",
                " the news of reconciliation was wrong and",
                " the conflict between Islam and kufr was",
                " raging as furiously as before.",
                "Now let",
                " us make a critical study of this",
                " story which has been cited by Ibn",
                " Jarir and many other commentators and is",
                " even contained in many collections of Traditions.",
                "",
                "(1) None of its reporters, except Ibn",
                " `Abbas, is a Companion.",
                "(2) There are",
                " many major discrepancies and variations in its",
                " details.",
                "(3) The wording ascribed to the",
                " Holy Prophet in praise of the idols",
                " in each Tradition is different from that",
                " of others.",
                "Moreover, these words have been",
                " attributed to different sources according to different",
                " Traditions: (a) These words were put in",
                " by Satan during the Revelation and the",
                " Holy Prophet imagined that they were revealed",
                " by Gabriel. (b) He himself uttered these",
                " words inadvertently, being urged by his own",
                " desire. (c) He was dozing when he",
                " uttered these words. (d) He intentionally uttered",
                " these words but in a manner as",
                " to question their veracity. (e) Satan interpolated",
                " these words into the Revelation, giving an",
                " impression that the Holy Prophet himself had",
                " recited them. (f) It was one of",
                " the mushriks who had recited these words.",
                "",
                "Yet scholars of Tradition like Hafiz Ibn",
                " Hajar and jurists like Abu Bakr alJassas",
                " and rationalists like Zamakhshari and commentators like",
                " Ibn Jarir accept this story as true",
                " and consider it as a commentary on",
                " verse 52 of this Surah. Ibn Hajar",
                " argues like this:",
                "\"Even though the links",
                " by which this Tradition has been related",
                " are either weak or \"broken\", except in",
                " one case, the very fact that it",
                " has been related through so many \"links\"",
                " is a proof that there is some",
                " truth about it. The one which has",
                " strong links is by Said bin Jubair",
                " who has related it from Ibn `Abbas",
                " and the reporters of two more Traditions",
                " (which have been cited by Tabari) have",
                " been declared authentic by Bukhari and Muslim\".",
                "",
                "On the other side, there are other",
                " eminent scholars who declare this story to",
                " be utterly baseless. Ibn Kathir says, \"All",
                " the links of this Tradition are unauthentic",
                " and I have found no correct version",
                " of this with continuous links\". Baihaqi says,",
                " \"This story has not been proved to",
                " be correct by the rules of reporting\".",
                " When Ibn Khuzaimah was asked about it,",
                " he said, \"This story has been invented",
                " by heret cs\". Qazi `Ayad says, \"The",
                " very fact that this Tradition is neither",
                " contained in any of the six authentic",
                " collections of Hadith nor has it been",
                " related in an authentic way by authentic",
                " reporters shows its weakness\". Besides them, Imam",
                " Razi, Qazi Abu Bakr Ibn al-`Arabi, Alusi",
                " etc. have rejected it altogether.",
                "It is",
                " a pity that even those who reject",
                " this story have not done full justice",
                " to their cases. There are some who",
                " reject it because its \"links\" are weak.",
                " In other words, they would have accepted",
                " it, if its links were strong. Then",
                " there are others who reject it because",
                " its acceptance makes the whole Faith doubtful.",
                " This kind of reasoning may satisfy the",
                " believers but it cannot satisfy those who",
                " are already sceptical or intend to make",
                " a research into it with a view",
                " to making a correct appraisal of Islam.",
                " They will rather say, \"When a story",
                " is related by an eminent Companion and",
                " is contained in the collections of Traditions,",
                " there is no reason why we should",
                " reject it just because it makes your",
                " Faith doubtful\".",
                "Now let us consider the",
                " story critically and rationally to prove that",
                " it is unacceptable.",
                "(1) Its internal evidence",
                " proves it to be wrong: (a) According",
                " to the story the incident happened after",
                " the first migration to Habash, for according",
                " to it some of the migrants returned",
                " to Makkah after hearing the story. Now",
                " the fact is that the migration took",
                " place in the month of Rajab of",
                " the fifth year of Prophethood and some",
                " of the migrants returned to Makkah three",
                " months later, i.e. in Shawwal of the",
                " same year. (b) Verses 73-75 of Chapter",
                " XVII in which the Holy Prophet was",
                " \"reproved\" for this incident were revealed in",
                " the eleventh or twelfth year of Prophethood.",
                " In other words, he was \"reproved\" by",
                " Allah five or six years after the",
                " incident. (c) This verse (52) in which",
                " the interpolation by Satan was abrogated was",
                " sent down in the first year of",
                " Hijrah, i.e. about two years after the",
                " reproof. Can a person in his senses",
                " believe' that the Holy Prophet 'was reproved",
                " for the interpolation after six years, and",
                " it was abrogated after nine years ?",
                "",
                "(2) According to the story, this interpolation",
                " was made in Surah An-Najm. When the",
                " Holy Prophet was reciting the words, \"And",
                " a third (goddess) Manat'; he also recited",
                " the interpolated sentence, and then continued the",
                " recital up to the end of the",
                " Surah. It is said that the disbelievers",
                " of Makkah were so pleased with the",
                " interpolation that they declared, \"The differences between",
                " us and Muhammad (Allah's peace be upon",
                " him) have now come to an end\".",
                "",
                "Let us now read w. 19-23 of",
                " An-Najm along with the alleged interpolation (in",
                " italics): \"Have you ever considered about the",
                " reality of this Lat and ` Uzza",
                " and a third (goddess) Manat? These are",
                " exalted goddesses; indeed their intercession may be",
                " expected. What, do you have sons for",
                " yourselves add daughters for Him (Allah) ?",
                " This is indeed an unfair division. They",
                " are nothing but mere names which you",
                " and your forefathers have invented. Allah has",
                " sent down no authority in regard to",
                " them. They follow only conjectures and the",
                " whims of their own minds, although right",
                " guidance has come from their Lord\".",
                "Even",
                " a casual reader will detect an obvious",
                " contradiction in the passage. Immediately after \"praising\"",
                " the goddesses there is a hard hit",
                " on their worshippers, as if to say:",
                " \"O foolish people! How is it that",
                " you have ascribed daughters to Allah and",
                " sons to yourselves? All this is your",
                " own invention which has no authority from",
                " Allah\" . On the face of it,",
                " the interpolation makes the passage absurd which",
                " cannot be assigned even to a rational",
                " person not to speak of Allah. Then",
                " the story presumes that all the Quraish",
                " who were listening to it must have",
                " lost their senses; otherwise they could not",
                " have declared that their differences with Muhammad",
                " (Allah's peace be upon him) had been",
                " made up from thence.",
                "From this internal",
                " evidence it has become clear that this",
                " story is absurd and meaningless.",
                "(3) Now",
                " let us consider whether the occasions ascribed",
                " by the commentators to the revelation of",
                " the verses under discussion, fit in with",
                " the chronological order of the Qur'an. According",
                " to the story, the interpolation in Surah",
                " AnNajm (LIII) was made in the fifth",
                " year of Prophethood; the reproof was made",
                " in vv. 73-75 of Bani Isra'il (XV11)",
                " and then the interpolation was annulled and",
                " the incident explained in vv. 52-54 of",
                " Surah Al-Hajj (XXII). Now there could be",
                " only two possibilities about the time of",
                " their revelation: either the verses containing the",
                " reproof and the abrogation were sent down",
                " in the period in which the interpolation",
                " took place, or the verse containing the",
                " reproof was sent down along with Surah",
                " Al-Hajj (XXII). In the first case, the",
                " question arises: Why were these verses (XVII:",
                " 73-75) not inserted in An-Najm (LIII)? Why",
                " were they held in abeyance for six",
                " long years and then inserted in Surah",
                " Bani Isra'il (XVII), when it was revealed,",
                " and vv. 52-54 (containing the abrogation) inserted",
                " in Surah Al-Hajj (XXII) after a further",
                " delay of more than two years? Dces",
                " it mean that the verses were sent",
                " down on one occasion and inserted years",
                " later haphazardly in one Surah or the",
                " other? In the second case, the question",
                " would arise: Does it stand to reason",
                " that the verses containing the reproof (XVII:",
                " 73-75) were sent down six years after",
                " the interpolation, and the verse of abrogation",
                " (XXII: 52) nine years after the incident?",
                " Still another question arises: What was the",
                " occasion of the revelation of the verses",
                " of reproof and abrogation in Chapters XVII",
                " and XXII in the context in which",
                " they occur?",
                "(4) Now let us turn",
                " to the third principle of correct appraisal",
                " of the Qur'an.",
                "For a correct appreciation",
                " of the Qur'an it is essential to",
                " consider whether a particular commentary fits in",
                " with the relevant context of the Qur'an",
                " or not. If we make even a",
                " cursory study of XVII: 71-73, (Bani Isra'il),",
                " it will become obvious that there was",
                " no occasion for the alleged reproof in",
                " v. 73 and that there is no",
                " tinge of reproof in it, for the",
                " words of the verse refute the allegation",
                " that the Prophet was taken in by",
                " the mischief of the disbelivers. Then in",
                " Surah AI-Hajj (XXII), if we make a",
                " critical study of the verses that precede",
                " vv. 52-54 and follow them, it will",
                " become obvious that there was no occasion",
                " to console the Prophet for the \"interpolation\"",
                " and to annul it after nine years.",
                "",
                "(5) We reiterate that no Tradition, however",
                " strong links it might have, can be",
                " accepted when the Text itself is a",
                " clear evidence against it, and when it",
                " does not fit in with the wording,",
                " the context, the order etc. of the",
                " Qur'an. When the incident is considered in",
                " this background, even a sceptical research scholar",
                " would be convinced that the Tradition is",
                " absolutely wrong. As regards a believer, he",
                " can never accept it, when he knows",
                " that it contradicts not only one verse",
                " but a large number of other verses",
                " of the Qur'an. He would rather believe,",
                " that the reporters of the Tradition might",
                " have been deluded by Satan and not",
                " the Holy Prophet. He would never believe",
                " that the Holy Prophet could interpolate even",
                " a single word in the Qur'an under",
                " the influence of a desire of his",
                " own: or that there could ever occur",
                " such a desire in his mind that",
                " he should make a compromise with the",
                " disbelievers by associating shirk with Tauhid: or",
                " that he could ever wish that Allah",
                " might not say anything to displease the",
                " disbelievers: or that the Revelation was made",
                " in such an unsafe and doubtful manner",
                " as to enable Satan to mix with",
                " it even a word in a manner",
                " as if it was also brought by",
                " Gabriel. Each of these things is contradictory",
                " to the clear Revelation of the Qur'an",
                " and the basic Articles of the Faith",
                " which we have learnt from the Qur'an",
                " and the Holy Prophet. God forbid that",
                " we should accept any such Tradition that",
                " might lead to the abovementioned presumptions just",
                " because the Tradition seems to be \"authentic\"",
                " in every way.",
                "It will be worth-while",
                " to consider the question: How is it",
                " that so many reporters of Traditions have",
                " related this story? Dces it not show",
                " that there must have been some reality",
                " about it? Otherwise, so many reporters, who",
                " included many authentic and eminent scholars, could",
                " not have made such an heinous slander",
                " against the Qur'an and the Holy Prophet.",
                " Its answer is contained in the authentic",
                " collections of Traditions by Bukhari, Muslim, Abu",
                " Dawud, Nasa`i and Musnad Ahmad. The reality",
                " of the incident is this:",
                "The Holy",
                " Prophet recited Surah An-Najm and performed prostration",
                " at the end of it. At this,",
                " all the hearers, both the Muslims and",
                " the mushriks, fell down in prostration. This",
                " was what really happened and there is",
                " nothing strange about-it. Let us depict the",
                " occasion: The Holy Prophet was reciting a",
                " forceful piece of the eloquent Qur'an in",
                " a very impressive manner. Naturally the occasion",
                " produced an emotional effect and all the",
                " listeners instinctively fell down in prostration along",
                " with him. It was because of such",
                " ecstasies produced by the Holy Prophet's recital",
                " of the Qur'an as this that the",
                " disbelievers dubbed him a \"sorcerer\". As regards",
                " the story that the Holy Prophet praised",
                " the deities of the disbelievers, it appears",
                " that the Quraish concocted the story to",
                " hide their \"defeat\". Probably someone or other",
                " of them explained away their defeat, saying,",
                " \"We ourselves heard Muhammad praising our deities.",
                " Therefore we also fell down in prostration",
                " along with him\". As regards the migrants",
                " to Habash, they returned to Makkah when",
                " they heard the concocted story that there",
                " had been a compromise between the Holy",
                " Prophet and the Quraish. It appears that",
                " some of those people who had seen",
                " the Muslims and the mushriks falling down",
                " together in prostration, presumed that peace had",
                " been made between them, so the story",
                " travelled to the migrants in Habash who",
                " had no means to verify it and",
                " thus thirty-three of them returned to Makkah.",
                "",
                "Naturally these three things-prostration by the Quraish,",
                " their explanation of it, and the return",
                " of the migrants from Habash-combined to evolve",
                " that story. So much so that some",
                " authentic people were also deluded by it,",
                " for to err is human, and the",
                " pious and intelligent people are no exception",
                " to it. However, the error of the",
                " latter proves to be more harmful, because",
                " their credulous followers accept with closed eyes",
                " their misconceptions along with their right conclusions.",
                " On the other hand, mischief mongers collect",
                " all such errors of the righteous people",
                " and exploit them to prove that all",
                " the collections of Traditions are false and",
                " should be rejected forthwith."
            ]
        },
        {
            "id": "[22:55]",
            "verse": "But those who disbelieve will not cease to be in doubt of it until the Hour comes upon them unexpectedly or there comes to them the punishment of a barren Day.",
            "description": [
                "The epithet \"barren\" has been applied to",
                " the \"day\" in its metaphorical and not",
                " literal sense. :A \"day\" is barren if",
                " all the plans, hopes and devices remain",
                " unproductive in it, or it dces not",
                " bring forth its night. For instance, the",
                " days on which the people of Prophet",
                " Noah, the tribes of `Ad and _Thamud,",
                " the people of Lot and of Midian",
                " met with their destruction by scourge from",
                " Allah, were barren days in this sense,",
                " because those days did not bring forth",
                " any \"tomorrow\" for them, and no device",
                " of theirs could avert their doom."
            ]
        },
        {
            "id": "[22:56]",
            "verse": "[All] sovereignty that Day is for Allah; He will judge between them. So they who believed and did righteous deeds will be in the Gardens of Pleasure.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:57]",
            "verse": "And they who disbelieved and denied Our signs - for those there will be a humiliating punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:58]",
            "verse": "And those who emigrated for the cause of Allah and then were killed or died - Allah will surely provide for them a good provision. And indeed, it is Allah who is the best of providers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:59]",
            "verse": "He will surely cause them to enter an entrance with which they will be pleased, and indeed, Allah is Knowing and Forbearing.",
            "description": [
                "As Allah is All-Knowing, He knows well",
                " those who left their homes for His",
                " sake and what reward they deserve. He",
                " is Clement, and forgives minor errors and",
                " weaknesses of the people; therefore these things",
                " will not hinder Him from rewarding the",
                " Believers for their services and sacrifices."
            ]
        },
        {
            "id": "[22:60]",
            "verse": "That [is so]. And whoever responds [to injustice] with the equivalent of that with which he was harmed and then is tyrannized - Allah will surely aid him. Indeed, Allah is Pardoning and Forgiving.",
            "description": [
                "The preceding verses referred to those persecuted",
                " people who could not retaliate and here",
                " 'the reference is to those victims of",
                " persecution who could fight back.",
                "From this",
                " verse, Imam Shafi`i has concluded that \"retaliation\"",
                " will be effected in the way as",
                " life was taken in the original act.",
                " If a person is killed by immersion",
                " in water, the killer also should be",
                " put to death by immersion in water;",
                " or if a person is .burnt to",
                " death, the killer also will be burnt",
                " to death. The Hanafites dispute this. According",
                " to them, retaliation against a murderer will",
                " be incurred in one and the same",
                " established way no matter how life was",
                " taken by the culprit in the original",
                " act.",
                "*105) This verse (60) may imply",
                " two things:",
                "(1) Allah forgives that \"killing\"",
                " which is done in self-defence, though killing",
                " of people is not a good thing",
                " in itself. (2) As Allah, Whose slaves",
                " the Believers are, is Forgiving and Forbearing,",
                " they should also forgive and forbear as",
                " far as possible. Though they have the",
                " right of retaliation, they should not resort",
                " to carnage and massacre."
            ]
        },
        {
            "id": "[22:61]",
            "verse": "That is because Allah causes the night to enter the day and causes the day to enter the night and because Allah is Hearing and Seeing.",
            "description": [
                "\"So it is\" (as stated in the",
                " preceding paragraph) because Allah is the Ruler",
                " of the universe and has the power",
                " to give punishments and rewards to those",
                " who deserve them.",
                "*107) The fact that",
                " \"Allah brings forth .........day\" is a proof",
                " that He is the Master, Sovereign and",
                " Ruler of the universe. But the deeper",
                " meaning of the verse is that Allah,",
                " Who is able to bring forth the",
                " light of the day out of the",
                " darkness of the night, has the power",
                " to bring out the light of the",
                " Truth out of the darkness of disbelief",
                " and ignorance, and the light of justice",
                " out of the darkness of tyranny.",
                "*108)",
                " He hears everything and sees everything and",
                " is not unaware of anything."
            ]
        },
        {
            "id": "[22:62]",
            "verse": "That is because Allah is the Truth, and that which they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.",
            "description": [
                "As Allah is in fact the Sovereign",
                " of the universe, His worshippers will surely",
                " attain true success and the worshippers of",
                " false gods will meet with utter failure.",
                ""
            ]
        },
        {
            "id": "[22:63]",
            "verse": "Do you not see that Allah has sent down rain from the sky and the earth becomes green? Indeed, Allah is Subtle and Acquainted.",
            "description": [
                "This verse has a deeper meaning also,",
                " though apparently it merely declares that Allah",
                " alone has the power to send down",
                " rain which makes the land green. The",
                " deeper meaning is that the rainfall of",
                " the blessed Revelation will, in the near",
                " future, turn the barren land of Arabia",
                " into a garden of knowledge, morality and",
                " bring forth a high and righteous civilization.",
                "",
                "*111) The original word Latif in the",
                " Text has no equivalent in English. The",
                " word \"subtle\" has not been used because",
                " of its bad associations. Latif implies that",
                " Allah fulfils His designs in such fine",
                " ways that it is difficult to understand",
                " them till they become real and apparent.",
                "",
                "As He is fully aware of everything,",
                " He knows how to conduct the affairs",
                " of His Kingdom."
            ]
        },
        {
            "id": "[22:64]",
            "verse": "To Him belongs what is in the heavens and what is on the earth. And indeed, Allah is the Free of need, the Praiseworthy.",
            "description": [
                "He alone is \"All-Sufficient\" and does not",
                " stand in need of anyone in any",
                " way. He is \"All-praiseworthy\" because all praise",
                " belongs to Him alone whether anyone praises",
                " Him or not."
            ]
        },
        {
            "id": "[22:65]",
            "verse": "Do you not see that Allah has subjected to you whatever is on the earth and the ships which run through the sea by His command? And He restrains the sky from falling upon the earth, unless by His permission. Indeed Allah, to the people, is Kind and Merciful.",
            "description": [
                "Here \"the sky\" implies the whole of",
                " the universe above and below the earth",
                " where everything is held in its own",
                " place and sphere."
            ]
        },
        {
            "id": "[22:66]",
            "verse": "And He is the one who gave you life; then He causes you to die and then will [again] give you life. Indeed, mankind is ungrateful.",
            "description": [
                "That is, \"Though man sees every reality",
                " presented by the Prophets, yet he denies",
                " it\"."
            ]
        },
        {
            "id": "[22:67]",
            "verse": "For every religion We have appointed rites which they perform. So, [O Muhammad], let the disbelievers not contend with you over the matter but invite them to your Lord. Indeed, you are upon straight guidance.",
            "description": [
                "That is, \"The Community of every Prophet\"",
                " .",
                "*116) Here the Arabic word mansak",
                " has been used in its most comprehensive",
                " sense which also includes \"sacrifice\" (v. 34).",
                " It means service, worship, in short, \"the",
                " whole way of life\". The same theme",
                " has been expressed in V: 48: \"We",
                " prescribed a law and a way of",
                " life for each of you\".",
                ">*117) That",
                " is, \"Now you have brought a way",
                " of life just as the former Prophets",
                " brought \"ways of life\" for their people.",
                " Therefore the people have no right to",
                " dispute with you concerning the \"Law\" you",
                " have brought\".",
                "*118) This confirms the explanation",
                " given in E.N. 117 above."
            ]
        },
        {
            "id": "[22:68]",
            "verse": "And if they dispute with you, then say, \"Allah is most knowing of what you do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:69]",
            "verse": "Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:70]",
            "verse": "Do you not know that Allah knows what is in the heaven and earth? Indeed, that is in a Record. Indeed that, for Allah, is easy.",
            "description": [
                "In order to understand the significance of",
                " this paragraph, we should keep in view",
                " vv. 55- 57 with which this is",
                " connected."
            ]
        },
        {
            "id": "[22:71]",
            "verse": "And they worship besides Allah that for which He has not sent down authority and that of which they have no knowledge. And there will not be for the wrongdoers any helper.",
            "description": [
                "That is, \"Neither there is any mention",
                " of their deities in any revealed Book",
                " nor have they any other source of",
                " knowledge about them nor any authority to",
                " worship them. Therefore, it is sheer ignorance",
                " that they have associated their selfinvented deities",
                " with Allah and worship them, make vows",
                " and offer sacrifices to them and supplicate",
                " them for their needs etc.",
                "*121) This",
                " is to warn the foolish people that",
                " they are absolutely wrong in expecting that",
                " their deities would help them in this",
                " world and in the Hereafter? because they",
                " have no power to help them. Thus,",
                " they will find no helper, for Allah",
                " alone could help them and they have",
                " already displeased Him by their rebellious behaviour.",
                ""
            ]
        },
        {
            "id": "[22:72]",
            "verse": "And when Our verses are recited to them as clear evidences, you recognize in the faces of those who disbelieve disapproval. They are almost on the verge of assaulting those who recite to them Our verses. Say, \"Then shall I inform you of [what is] worse than that? [It is] the Fire which Allah has promised those who disbelieve, and wretched is the destination.\"",
            "description": [
                "That is, \"You will meet with a",
                " far worse state of anguish than that",
                " which you display against those who recite",
                " Divine Revelations to you."
            ]
        },
        {
            "id": "[22:73]",
            "verse": "O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for that purpose. And if the fly should steal away from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued.",
            "description": [
                "This parable has been cited to impress",
                " upon the idol-worshippers that their deities are",
                " absolutely powerless, for even if they all",
                " collaborated to create an insignificant thing like",
                " a fly, they could not; nay, even",
                " if a fly snatched away anything from",
                " them they could not prevent it. This",
                " shows how weak they themselves are and",
                " how powerless are the idols they supplicate.",
                ""
            ]
        },
        {
            "id": "[22:74]",
            "verse": "They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might.",
            "description": [
                ""
            ]
        },
        {
            "id": "[22:75]",
            "verse": "Allah chooses from the angels messengers and from the people. Indeed, Allah is Hearing and Seeing.",
            "description": [
                "In continuation of the refutation of shirk,",
                " Allah has taken two kinds of the",
                " most revered of \"deities\" to show their",
                " real status, as if to say, \"The",
                " angels and the Prophets whom you have",
                " set up as deities are mere Messengers",
                " of Allah. Allah has chosen them to",
                " convey His Messages to human beings and",
                " this does not make them God or",
                " partners in His Godhead. \""
            ]
        },
        {
            "id": "[22:76]",
            "verse": "He knows what is [presently] before them and what will be after them. And to Allah will be returned [all] matters.",
            "description": [
                "The Qur'an employs this sentence to refute",
                " the creed of the mushriks in regard",
                " to intercession, as if to say, \"You",
                " imagine that angels, prophets, saints,and the like",
                " can intercede with Allah on your behalf",
                " and therefore you worship them. You are",
                " absolutely wrong, for none of your deities",
                " knows what is good for you and",
                " what is not: Allah alone hears everything,",
                " sees everything and knows everything. Therefore He",
                " has not given the right of intercession",
                " and recommendation to anyone except when He",
                " Himself is pleased to give such permission.\"",
                "",
                "*126) This is to impress upon them",
                " that every affair and every matter, big",
                " or small, is presented before Allah for",
                " a decision. Therefore you should not invoke",
                " anyone else than Allah, for all others",
                " are utterly helpless and powerless and cannot",
                " even fulfil their own desires and needs.",
                ""
            ]
        },
        {
            "id": "[22:77]",
            "verse": "O you who have believed, bow and prostrate and worship your Lord and do good - that you may succeed.",
            "description": [
                "This is the right way of attaining",
                " we success, but even after adopting these",
                " ways of worship and performing good deeds",
                " one should not rest content or be",
                " proud that he would surely attain success",
                " because he is worshipping Allah and is",
                " doing good deeds. He should only expect",
                " that Allah will by His grace accept",
                " his services and bless him with we",
                " success.",
                "Imam Shafi`i, Ahmad bin Hanbal, `Abdullah",
                " bin Mubarak and Ishaq bin Rahawayah hold",
                " the view that this verse of Surah",
                " Al-Hajj requires a `prostration'. But Imam 'Abu",
                " Hanifah, Imam Malik, Hasan Basri, Said bin",
                " al-Musayyab, Said bin Jubair, Ibrahim Nakha`i and",
                " Sufyan Thauri dispute this. The arguments of",
                " the two sides are briefly as follows:",
                "",
                "The former group of commentators base their",
                " opinion on the following:",
                "(1) The verb",
                " in the verse is in the imperative",
                " mood.",
                "(2) The Tradition of `Uqbah bin",
                " `Amir, which has been reported by Imam",
                " Ahmad, Abu Dawud, Tirmizi, Ibn Marduyah and",
                " Baihaqi, says, \"I asked, `O Messenger of",
                " Allah ! Dces the merit of Surah",
                " Al-Hajj consist in the fact that it",
                " contains two verses requiring prostration?' He replied,",
                " `Yes, the one who does not prostrate",
                " on these two verses, should not recite",
                " them.' \"",
                "(3) The Tradition of Abu",
                " Dawud and Ibn Majah in which `Amr",
                " bin `As says that he was told",
                " by the Holy Prophet that there were",
                " two verses requiring prostration in Surah Al-Hajj.",
                "",
                "(4) Sayings of Hadrat `Umar, `Ali, `Uthman,",
                " Ibn `Umar, Ibn `Abbas, Abul Darda, Abu",
                " MUsa Ash`ari and `Ammar bin Yasir to",
                " the effect that Surah AIHajj contains two",
                " prostrations.'",
                "The latter group of commentators argue",
                " as follows;",
                "The verse contains a command",
                " both for Sajdah (prostration) and for Ruku'",
                " (bowing in prayer), which implies the whole",
                " Islamic Prayer according to the Qur'anic usage,",
                " and not `prostration' alone.",
                "(2) The tradition",
                " reported by 'Uqbah bin `Amir is unauthentic",
                " as it has weak links.",
                "(3) The",
                " Tradition of 'Amr bin `As is also",
                " unreliable, because its reporters are not well",
                " known.",
                "(4) As for the sayings of",
                " the Companions, Ibn 'Abbas has clearly explained",
                " that prostration in respect of the first",
                " verse (in Surah AI-Hajj) is obligatory, whereas",
                " in regard to the second, it is",
                " only suggestive."
            ]
        },
        {
            "id": "[22:78]",
            "verse": "And strive for Allah with the striving due to Him. He has chosen you and has not placed upon you in the religion any difficulty. [It is] the religion of your father, Abraham. Allah named you \"Muslims\" before [in former scriptures] and in this [revelation] that the Messenger may be a witness over you and you may be witnesses over the people. So establish prayer and give zakah and hold fast to Allah. He is your protector; and excellent is the protector, and excellent is the helper.",
            "description": [
                "The Arabic word Jihad is very comprehensive.",
                " It includes every kind of effort, exertion,",
                " conflict and war. Jihad for the cause",
                " of Allah means that it should be",
                " performed for .His service and for His",
                " approval against those who prevent others from",
                " following His Way. The performance of Jihad",
                " also requires that one should first of",
                " all fight against one's own self in",
                " order to subdue it. For there can",
                " be no true Jihad unless one fights",
                " against one's evil self and subdues one's",
                " desires and lusts to the obedience of",
                " AIIah. The Holy Prophet himself has emphasized",
                " the need for this Jihad. Once when",
                " the warriors for the cause of Allah",
                " returned from Jihad, he said: \"You have",
                " returned from the lesser Jihad to the'",
                " greater Jihad.\" They asked, \"What is that",
                " greater Jihad.'\" The Holy Prophet replied, \"It",
                " is the Jihad against one's own desires",
                " and lusts.\"",
                "Moreover, the battlefield for Jihad",
                " is, in fact, the whole world, and",
                " Islam demands that one should exert one's",
                " utmost against all the rebels of Allah",
                " and the wicked powers with all of",
                " one's heart and mind and body and",
                " wealth.",
                "*129) The direct addressees of this",
                " were the Companions of the Holy Prophet,",
                " for they were the first who had",
                " the honour to be chosen for this",
                " service; others have been addressed only indirectly",
                " being their followers. This thing has been",
                " mentioned in the Qur'an in other ways",
                " as well. For reference, see II: 143",
                " and III: 110.",
                "*130) \"..........(Allah) has not",
                " laid on you any hardship in your",
                " religion.\" That is, \"The creed you have",
                " been given is very simple and straightforward",
                " and the laws and regulations you have",
                " to obey are practicable. You are free",
                " within its bounds to make as much",
                " progress as you cap.\" This was to",
                " impress that the lives of the Muslims",
                " were free from all those useless and",
                " unnatural restrictions which had been imposed upon",
                " the former communities by their priests and",
                " law-givers. The negative aspect of the same",
                " thing has been mentioned in V1I: 157:",
                " \". . . He enjoins them to",
                " follow virtue and forbids them from evil:",
                " He makes pure things lawful for them",
                " and impure things unlawful. He relieves them",
                " of their burdens and frees thetas from",
                " the shackles that bound them.\"",
                "*131) Though",
                " Islam tray be called the religion of",
                " Prophets Noah, Moses, Jesus, etc., yet the",
                " Qur'an emphasizes over and over again that",
                " it is the religion of Prophet Abraham.",
                " Therefore, \"You should follow it.\" This is",
                " for three reasons:",
                "(1) The first addressees",
                " of the Qur'an were the Arabs who",
                " were more familiar with Prophet Abraham than",
                " with any other Prophet and acknowledged him",
                " to be a holy personage and their",
                " leader.",
                "(2) Prophet Abraham alone was the",
                " person whom the Jews, the Christians, the",
                " Muslims and the mushriks of Arabia and",
                " of the adjoining countries unanimously acknowledged as",
                " a great Prophet.",
                "(3) When the Qur'an",
                " invites all these communities to follow the",
                " way of Abraham, it in fact, admonishes",
                " them that all their religions had been",
                " invented long after Prophet Abraham and, therefore,",
                " were not trustworthy because they contradicted many",
                " things taught by him. As for the",
                " mushriks of Arabia, they also acknowledged that",
                " idol-worship among them had been started by",
                " 'Amr bin Luhayy, who was a leader",
                " of Bani Khuza`ah, and had brought an",
                " idol, called Hubal, from Moab in about",
                " 600 B.C. So the religion to which",
                " Prophet Muhammad (Allah's peace and blessings be",
                " upon him) invited them was the same",
                " pure, un-adulterated religion which was taught by",
                " Prophet Abraham (Allah's peace be upon him).",
                "",
                "For further details, see E.N.'s 134, 135",
                " of Chapter II (AI-Baqarah) and E.N.'s 58,",
                " 79 of Chapter III (Al-`Imran) and E.N.'s",
                " 119, 120 of Chapter XVI (An-Nahl)",
                "*132)",
                " Here the word \"you\" has not been",
                " addressed exclusively to those Believers who lived",
                " at the time of the revelation of",
                " this verse, or those who believed after",
                " its revelation. It includes all those human",
                " beings, who, from the beginning of human",
                " history, believed in Tauhid, the Hereafter, Prophethood",
                " and the Divine Books. They were not",
                " \"Jews\", \"Christians\", etc., but \"Muslims\" in the",
                " sense that they had surrendered themselves to",
                " Allah. Likewise the followers of the Holy",
                " Prophet Muhammad (Allah's peace and blessings be",
                " upon him) are not Muhammadens but \",Muslims\".",
                "",
                "*133) For Explanation, see E. N. 144",
                " of Chapter II (Al-Baqarah).",
                "*134) \".... hold",
                " fast to Allah\": Follow exclusively the Guidance",
                " and the law of Allah: obey Him",
                " alone: fear Him and have all your",
                " hopes and expectations in Him: invoke Him",
                " alone for help: trust in Him and",
                " pray to Him for all your needs.",
                ""
            ]
        }
    ]
}