{
    "name": "Al-Furqan",
    "verse-count": 77,
    "verse-info": [
        {
            "id": "[25:1]",
            "verse": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -",
            "description": [
                "The Arabic word tabaraka is very comprehensive,",
                " and cannot be understood fully and completely",
                " by \"highly blessed\", not even by a",
                " sentence. However, its meanings may be grasped",
                " by keeping in view the remaining portion",
                " of vv. 1-2. Here it has been",
                " used to convey the following meanings:",
                "(1)",
                " He is the most Beneficent: that is",
                " why He has bestowed the great blessing",
                " of Al-Furqan by degrees on His servant",
                " so that he may admonish all mankind.",
                "",
                "(2)He is the most Exalted and Great:",
                " for the Sovereignty of the heavens and",
                " the earth belongs to Him.",
                "(3) He",
                " is the most Holy, Pure and Perfect:",
                " He is free from every tinge of",
                " shirk and has neither a partner in",
                " His Godhead, nor needs a son to",
                " succeed Him; for He is Ever-Lasting.",
                "(4)",
                " He is the Highest and the Most",
                " Supreme in rank: the Kingdom and the",
                " Dominion wholly and solely belong to Him,",
                " and there is none who has any",
                " share in His Authority and Powers.",
                "(5)",
                " He is the sole Creator of the",
                " universe and has created each and everything",
                " in it and predetermined its destiny. For",
                " further details, see E.N. 14 of AIMu'minun",
                " and E.N. 19 of AI-Furgan.",
                "*2) Al-Furgan:",
                " The Criterion. The Qur'an has been called",
                " AI-Furgan because it is the Criterion for",
                " judging right and wrong virtue and vice,",
                " truth and falsehood.",
                "*3) The word nazzala",
                " implies revelation of the Qur'an piecemeal by",
                " degrees. The wisdom of this introductory remark",
                " will be explained in the study of",
                " verse 32, where the objection of the",
                " disbelievers of Makkah -as to why the",
                " Qur'an has not been sent down all",
                " at once-has been dealt with",
                "*4) .....",
                " warner to all mankind\": To warn all",
                " mankind of the evil consequences of their",
                " heedlessness and deviation. The warner may be",
                " AI-Furgan or the Holy Prophet to whom",
                " it was revealed. In fact, both were",
                " the warners because they were both sent",
                " for one and the same purpose. The",
                " message of the Qur'an and Prophethood of",
                " Muhammad (Allah's peace and blessings be upon",
                " him) were not meant for any particular",
                " country but for the whole world; and",
                " not for their own time, but for",
                " alI times to come. This has been",
                " stated at several places in the Qur'an;",
                " for instance: \"O Muhammad, say, O mankind,",
                " I am a Messenger to aII of",
                " you from Allah .....\" (Al-A`raf: 158); \".....",
                " and this Qur'an has been revealed to",
                " me so that I should thereby warn",
                " you aII and whom it may reach.\"",
                " (AlAn'am: 19); \"We have sent you only",
                " as a bearer of good news and",
                " as a warner to all mankind.\" (Saba:",
                " 28); and \"We have sent you as",
                " a mercy to all mankind.\" (AIAnbiya': 107)",
                " The Holy Prophet himself has stated this",
                " clearly in the Hadith; for instance, he",
                " said: \"I have been sent to aII",
                " men-the red and the black.\" \"Before me",
                " a Prophet was sent only to his",
                " own people, but 1 have been sent",
                " to all mankind.\" (Bukhari, Muslim). \"I have",
                " been sent to all mankind, and I",
                " am the Last of the Prophets.\" (Muslim).",
                ""
            ]
        },
        {
            "id": "[25:2]",
            "verse": "He to whom belongs the dominion of the heavens and the earth and who has not taken a son and has not had a partner in dominion and has created each thing and determined it with [precise] determination.",
            "description": [
                "Another translation may be: \"To Him belongs",
                " the Sovereignty of the heavens and the",
                " earth.\" That is, He alone has an",
                " exclusive right to it, and no one",
                " else has any right to it nor",
                " any share in it",
                "*6) That is,",
                " \"He has neither any relation of direct",
                " parenthood to anyone, nor has He taken",
                " anyone as a son. Therefore, none else",
                " in the universe is entitled to worship.",
                " He is Unique and there can be",
                " no partner in His Godhead. Thus alI",
                " those who associate with Him angels or",
                " jinns or saints as His offspring, are",
                " ignorant. Likewise, those who believe that some",
                " one, is His \"son\", are also ignorant.",
                " They have no true conception of the",
                " Greatness of AIIah and consider Him to",
                " be weak and needy like human beings,",
                " who require some one to become their",
                " inheritor. It is sheer ignorance and folly.\"",
                " For further details, see E.N.'s 66 to",
                " G8 of Surah Yunus .",
                "*7) The",
                " Arabic word mulk means Sovereignty, Supreme Authority,",
                " and Kingship. Thus the sentence will mean:",
                " \"AIIah is the Absolute Ruler of the",
                " whole universe and there is none other",
                " who may have any right to authority;",
                " therefore He alone is God.\" For whenever",
                " a man takes anything else as his",
                " lord, he does so under the presumption",
                " that his deity has the power to",
                " do good or bring harm and make",
                " or mar his fortune; nobody will like",
                " to worship a powerless deity. Now when",
                " it is recognized that none but AIIah",
                " has the real power and authority in",
                " the universe, nobody will bow before anyone",
                " other than Him in worship, nor will",
                " sing anybody else's hymns, nor commit the",
                " folly of bowing in worship before any",
                " thing else except his real God, or",
                " recognize any other as his ruler, because",
                " \"To AIIah belongs the Sovereignty of the",
                " heavens and the earth and to Him",
                " alone.\"",
                "*8) There may be other translations",
                " of this also: \"He has ordained it",
                " in due proportion\"; or \"He has appointed",
                " an exact measure for everything.\" But no",
                " translation can convey its real meaning, which",
                " is: \"Allah has not only created everything",
                " in the universe but also determined its",
                " shape, size, potentialities, characteristics, term of existence,",
                " the limitations and extent of its development",
                " and aII other things concerning it. Then,",
                " He has created the means and provisions",
                " to enable it to function properly in",
                " its own separate sphere. \" This is",
                " one of the most comprehensive verses of",
                " the Qur'an with regard to the Doctrine",
                " of Tauhid. According to Traditions, the Holy",
                " Prophet himself taught this verse to every",
                " child of his family as soon as",
                " it was able to speak and utter",
                " a few words. Thus, this verse is",
                " the best means of impressing the Doctrine",
                " of Tauhid on our minds, and every",
                " Muslim should use it for educating his",
                " children as soon as they develop understanding.",
                ""
            ]
        },
        {
            "id": "[25:3]",
            "verse": "But they have taken besides Him gods which create nothing, while they are created, and possess not for themselves any harm or benefit and possess not [power to cause] death or life or resurrection.",
            "description": [
                "The words are comprehensive and cover aII",
                " the false gods whom the mushriks worship",
                " whether they are angels, jinns, Prophets, saints,",
                " the sun, the moon, the stars, trees,",
                " rivers, animals etc., which have been created",
                " by AIIah, or those which have been",
                " created by man, as the idols of",
                " stone, wood, etc.",
                "*10) That is, \"Allah",
                " has sent down AI-Furqan on His servant",
                " so that he may invite the people",
                " to the Truth, which they have forsaken",
                " due to heedlessness and waywardness, and warn",
                " them of the evil consequences of their",
                " folly. The Furqan is being revealed piecemeal",
                " so that he may distinguish right from",
                " wrong and the genuine from the counterfeit.",
                " \""
            ]
        },
        {
            "id": "[25:4]",
            "verse": "And those who disbelieve say, \"This [Qur'an] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.",
            "description": [
                "Another translation may be: \"a great injustice.\"",
                ""
            ]
        },
        {
            "id": "[25:5]",
            "verse": "And they say, \"Legends of the former peoples which he has written down, and they are dictated to him morning and afternoon.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:6]",
            "verse": "Say, [O Muhammad], \"It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful.\"",
            "description": [
                "This is the same objection which the",
                " modern orientalists have raised against the Qur'an,",
                " but strange as it may seem, no",
                " contemporary of the Holy Prophet ever raised",
                " such an objection against him. Nobody, for",
                " instance, ever said that Muhammad (Allah's peace",
                " be upon him) as a boy had",
                " met Buhairah, the monk, and had attained",
                " religious knowledge from him, nor did anybody",
                " claim that he had obtained all that",
                " information from the Christian monks and Jewish",
                " rabbis during the trade journeys in his",
                " youth. In fact, they knew that he",
                " had never travelled alone but in the",
                " caravans and if they said such a",
                " thing, it would be refuted by hundreds",
                " of their own people from the city.",
                "",
                "Then, one could ask, if he had",
                " gained all that knowledge from Buhairah when",
                " he was about 12, and during trade",
                " journeys when he was 25, why did",
                " he keep it secret from the people",
                " till he became 40? whereas he did",
                " not leave his country even for a",
                " single day, but lived for years among",
                " his own people in the same city.",
                " That is why the people of Makkah",
                " dared not bring such an impudent and",
                " baseless charge against him. Their objections related",
                " to the time when he claimed to",
                " be a Prophet of Allah and not",
                " to the time preceding that claim. Their",
                " argument was like this: \"This man is",
                " illiterate and cannot obtain any knowledge through",
                " books. He has lived among us for",
                " forty years, but we have never heard",
                " from him anything that might have shown",
                " that he had any acquaintance with what",
                " he is preaching; therefore he must have",
                " had the help of other people who",
                " copied these things from the writings of",
                " the ancients for him: he learns these",
                " things from them and recites them as",
                " Divine Revelations: this is a fraud.\" So",
                " much so that according to some traditions,",
                " they named some of his \"helpers\", who",
                " were the people of the Book, were",
                " illiterate and lived in Makkah. They were:",
                " (1) Addas, a freed slave of Huvaitib",
                " bin `Abdul `Uzza(2) Yasar, a freed slave",
                " of 'Ala bin AlHadrami, and (3) Jabr,",
                " a freed slave of `Amir bin Rabbi`ah",
                " .",
                "Apparently this is a weighty argument.",
                " For there can be no greater proof",
                " of the \"fraud\" of Prophethood than to",
                " specify its source. But it looks strange",
                " that no argument has been put forward",
                " to refute this charge except a mere",
                " denial, as if to say, \"Your charge",
                " is an impudent lie: you are cruel",
                " and unjust to bring such a false",
                " charge against Our Messenger; for the Qur'an",
                " is the Word of Allah Who knows",
                " all the secrets in the heavens and",
                " the earth. \" Had their charge been",
                " based on facts, it would not have",
                " been rejected with contempt, for in that",
                " case the disbelievers would have demanded a",
                " detailed and clear answer. But they realized",
                " the strength of the arguments and did",
                " not make such a demand. Moreover, the",
                " fact that the \"weighty\" argument failed to",
                " produce any doubt in the minds of",
                " the new Muslims, was a clear proof",
                " that it was a lie.",
                "The enigma",
                " is clearly explained if we keep in",
                " view the prevalent circumstances",
                "(1) The disbelievers",
                " of Makkah did not take any decisive",
                " steps to prove their charge, although they",
                " could, had there been any truth in",
                " their charge. For instance, they could have",
                " made raids on the houses of the",
                " alleged helpers and on the house of",
                " the Holy Prophet himself and taken hold",
                " of the whole \"material\" which was being",
                " used in this \"fraud\", and made it",
                " public to expose his Prophethood. And this",
                " was not difficult for them because they",
                " never hesitated to resort to anything to",
                " defeat him, including persecution, as they were",
                " not bound by any moral code.",
                "(2)",
                " The alleged helpers were not strangers. As",
                " they lived in Makkah, everyone knew it",
                " well how learned they were. The disbelievers",
                " themselves knew that they could never have",
                " helped to produce a unique and sublime",
                " Book like the Qur'an which had the",
                " highest literary excellence and merit. That is",
                " why none of them challenged the answer",
                " to the charge. That is why even",
                " those people, who did not know them,",
                " considered this frivolous. Then if the alleged",
                " helpers were such geniuses, why did they",
                " not claim to be prophets themselves?",
                "(3)",
                " Then, aII the alleged helpers were freed",
                " slaves who were attached\"to their former masters",
                " even after their freedom according to the",
                " customs of Arabia; therefore they could not",
                " have become willing accomplices of the Holy",
                " Prophet in this \"fraud\" of false prophethood",
                " because their former masters could have coerced",
                " them to expose it. The only reason",
                " for them to help the Holy Prophet",
                " in his claim could have been some",
                " greed or interest which, under the circumstances,",
                " could not even be imagined. Thus, apparently",
                " there was no reason why they should",
                " have offended those whose protection and patronage",
                " they needed and enjoyed, and become accomplices",
                " in the \"fraud\".",
                "(4) Above all, all",
                " these alleged helpers embraced Islam. Could it",
                " be possible that those very persons, who",
                " had helped the Holy Prophet to make",
                " his \"fraud\" successful, could have possibly become",
                " his devoted followers? Moreover, if, for the",
                " sake of argument, it be admitted that",
                " they helped him, why was not any",
                " of them raised to a prominent rank",
                " as a reward of his help? Why",
                " were not 'Addas and Yasar and Jabr",
                " exalted to the same status as were",
                " Abu Bakr and 'Umar and Abu 'Ubaidah?",
                " Another odd flung is that if the",
                " \"fraud\" of prophethood was being carried on",
                " with the help of the alleged helpers,",
                " how could it remain hidden from Zaid",
                " bin Harithah, 'AIi bin Abi Talib, Abu",
                " Bakr and other people, who were the",
                " Holy Prophet's closest and most devoted Companions?",
                " Thus the charge was not only frivolous",
                " and false, but it was also below",
                " the dignity of the Qur'an to give",
                " any answer to it. The charge has",
                " been cited merely to prove that those",
                " people had been so blinded by their",
                " opposition to the Truth that they could",
                " say anything.",
                "*13) \"... He is very",
                " Forgiving and Merciful\" is very meaningful here.",
                " It means that Allah is giving full",
                " respite to the enemies of the Truth,",
                " for He is \"Forgiving and Merciful\"; otherwise",
                " He would have sent down a scourge",
                " to annihilate them because of the false",
                " charges they were bringing against the Messenger.",
                " It also contains an admonition, as if",
                " to say, \"O unjust people! if even",
                " now you give up your enmity and",
                " obduracy and accept the Truth, We shall",
                " forgive your previous misdeeds."
            ]
        },
        {
            "id": "[25:7]",
            "verse": "And they say, \"What is this messenger that eats food and walks in the markets? Why was there not sent down to him an angel so he would be with him a warner?",
            "description": [
                "That is, \"He cannot be a Messenger",
                " of AIIah because he is a human",
                " being like us. Had Allah willed to",
                " send a Messenger, He would have sent",
                " an angel, and f at aII a",
                " human being was to be sent, he",
                " should have been a king or a",
                " millionaire, who would have resided in a",
                " castle and been guarded by attendants. A",
                " Messenger could not be an ordinary person",
                " who has to move about in the",
                " market places like the common people, for",
                " it is obvious that such a human",
                " Messenger cannot attract the attention of the",
                " people. In other words, they thought that",
                " a Messenger was not meant to guide",
                " the people to the right path but",
                " to coerce them to obedience by show",
                " of worldly power and grandeur. For further",
                " details, see E.N. 26 of AI-Mu'minun.",
                "*15)",
                " That is, \"If a human being was",
                " to be sent as a Messenger, an",
                " angel should have been appointed to accompany",
                " him to proclaim: `If you do not",
                " believe in him, 1 will scourge you.\"",
                " But what son of a Messenger is",
                " he, who has to suffer from abuse",
                " and persecution?\""
            ]
        },
        {
            "id": "[25:8]",
            "verse": "Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?\" And the wrongdoers say, \"You follow not but a man affected by magic.\"",
            "description": [
                "That is, \"If nothing else, Allah should",
                " at least have made extraordinary arrangements for",
                " his livelihood. But this man has no",
                " treasure and no gardens; yet he claims",
                " to be a Messenger of the Lord",
                " of the universe.\"",
                "*17) The disbelievers of",
                " Makkah made the false propaganda against the",
                " Holy Prophet that he had been bewitched",
                " by some jinn or by the sorcery",
                " of an enemy or by the curse",
                " of some god or goddess for his",
                " insolence. But it is strange that they",
                " also admitted that he was a clever",
                " man who could make use of extracts",
                " from the ancient writings for the sake",
                " of his \"prophethood\", could practise sorcery and",
                " was also a poet."
            ]
        },
        {
            "id": "[25:9]",
            "verse": "Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.",
            "description": [
                "As these objections were frivolous and meaningless",
                " like others, the Qur'an has ignored them,",
                " saying, \"Your objections are irrelevant, unreasonable and",
                " void of sense. You bring no sound",
                " argument to prove your doctrine of shirk,",
                " ur to refute the Doctrine of Tauhid",
                " put forward by him, whereas the Messenger",
                " gives such proofs of the Doctrine of",
                " Tauhid that you cannot refute them except",
                " by saying, 'He is bewitched'. The same",
                " is true of the doctrine of the",
                " life-after-death and of the moral system of",
                " the Qur'an, which has produced men of",
                " high character. You cannot deny these things;",
                " you reject them, saying, \"He is a",
                " human being like us, etc. etc.\""
            ]
        },
        {
            "id": "[25:10]",
            "verse": "Blessed is He who, if He willed, could have made for you [something] better than that - gardens beneath which rivers flow - and could make for you palaces.",
            "description": [
                "Here again the word tabaraka has been",
                " used and in the context it means:",
                " \"AIIah has full control over everything and",
                " has unlimited powers: if he wills to",
                " favour somebody, He can do so as",
                " and when He wills without Iet or",
                " h indrance. \" ."
            ]
        },
        {
            "id": "[25:11]",
            "verse": "But they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.",
            "description": [
                "The word As-Sa'at, meaning the Time or",
                " the Hour, has been used in the",
                " Qur'an as a term for the promised",
                " Hour of Resurrection, when all human beings",
                " of all ages will be raised from",
                " the dead and gathered together before AIIah",
                " Almighty to account for their beliefs and",
                " deeds, right or wrong, and rewarded or",
                " punished accordingly. '",
                "*21) That is, \"The",
                " objections they are raising are not due",
                " to the reason that they doubt the",
                " authenticity of the Qur'an on some rational",
                " ground, or that they do not believe",
                " in you for the reason that you",
                " eat food and walk about in the",
                " streets like the common people, or that",
                " they did not accept your Message of",
                " Truth only because you were not escorted",
                " by an angel, or were not given",
                " a treasure. But the real reason why",
                " they are putting forward alI sorts of",
                " absurd arguments to reject your Message, is",
                " that they do not believe in the",
                " life-after-death, and this denial has made them",
                " free from alI moral obligations. For when",
                " one denies the life-afterdeath, there remains no",
                " need for him to consider and decide",
                " what is true or false, or what",
                " is right or wrong, etc. Their argument",
                " is like this: 'There is going to",
                " be no life after this one on",
                " the earth when we will be called",
                " to account for our deeds before God.",
                " Death will be the end of everything,",
                " and it will therefore make no difference",
                " whether one was a worshipper of God",
                " or a disbeliever or a mushrik or",
                " an atheist When the ultimate end is",
                " to become one with the dust, there",
                " is no need of judging what is",
                " right and what is wrong except by",
                " the criterion of \"success\" and \"failure\" in",
                " this life'. Those who deny the Hereafter",
                " also see that worldly success or failure",
                " does not entirely depend upon one's faith",
                " or conduct; nay, they very often see",
                " that the righteous and the wicked persons",
                " meet with the same end irrespective of",
                " their faith for which there is no",
                " ordained punishment or reward in this life;",
                " one righteous person may be living a",
                " life of hardship while another enjoying all",
                " the good things of life; one wicked",
                " person may be suffering for his misdeeds",
                " while the other enjoying a life of",
                " pleasure and plenty. As such, as far",
                " as the worldly consequences of adopting a",
                " particular moral attitude are concerned, the disbelievers",
                " in the Hereafter cannot be satisfied whether",
                " it is right or wrong. In view",
                " of this, those who deny the Hereafter,",
                " do not see any need to consider",
                " an invitation to faith and morality even",
                " if it is presented in a most",
                " forceful way.\""
            ]
        },
        {
            "id": "[25:12]",
            "verse": "When the Hellfire sees them from a distant place, they will hear its fury and roaring.",
            "description": [
                "\"The Fire will see them\" The words",
                " used in the Text may be metaphorical,",
                " or they may mean that the Fire",
                " of Hell will be endowed with the",
                " faculties of seeing, thinking and judging .",
                ""
            ]
        },
        {
            "id": "[25:13]",
            "verse": "And when they are thrown into a narrow place therein bound in chains, they will cry out thereupon for destruction.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:14]",
            "verse": "[They will be told], \"Do not cry this Day for one destruction but cry for much destruction.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:15]",
            "verse": "Say, \"Is that better or the Garden of Eternity which is promised to the righteous? It will be for them a reward and destination.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:16]",
            "verse": "For them therein is whatever they wish, [while] abiding eternally. It is ever upon your Lord a promise [worthy to be] requested.",
            "description": [
                "Literally: \"It is a promise whose fulfilment",
                " can be demanded (from AIIah)\". Here one",
                " ma ask the question: How can the",
                " promise of the Garden and the threat",
                " of the Fire produce any effect on",
                " the attitude of a parson who denies",
                " Resurrection and the existence of Paradise and",
                " Hell? In order to understand the wisdom",
                " of this method of admonition, one should",
                " keep in view that it is meant",
                " to appeal to the self-interest of an",
                " obdurate person, who dces not otherwise listen",
                " to such arguments. This is, as if",
                " to say, \"Even if, for the sake",
                " of argument, there is no proof of",
                " the reality of the life-after-death, there is",
                " also no proof that such an event",
                " will not occur at all, and there",
                " is a possibility for both. In the",
                " latter case, the Believer and the disbeliever",
                " both will be in one and the",
                " same position, but if there is life",
                " in the Hereafter, as the Prophet asserts,",
                " then the disbelievers will be doomed to",
                " utter ruin\". Therefore, such an approach breaks",
                " the stubbornness of the disbelievers and proves",
                " to be highly effective when the entire",
                " scene of Resurrection gathering of the people,",
                " their accountability and of Hell and Heaven",
                " is presented in a vivid manner as",
                " if the Prophet had himself seen it",
                " with his own eyes. Fur further explanation,",
                " see Ha Mim Sajdah: 52 and E.",
                " N. 69 thereof, and A I-Ahqaf: 10.",
                ""
            ]
        },
        {
            "id": "[25:17]",
            "verse": "And [mention] the Day He will gather them and that which they worship besides Allah and will say, \"Did you mislead these, My servants, or did they [themselves] stray from the way?\"",
            "description": [
                "Here, deities do not mean idols but",
                " the angels, the prophets; the saints, the",
                " martyrs and the pious men, whom the",
                " mushriks of different communities have made their",
                " deities.",
                "*25) Such dialogues between Allah and",
                " the gods of the disbelievers occur at",
                " several places in the Qur'an. For instance,",
                " in Surah Saba it has been stated:",
                " \"On the day when He will gather",
                " them all together, He will ask the",
                " angels, 'Did these people worship you?' They",
                " will answer, `Glory be to Thee !",
                " Thou art our Patron and not they:",
                " they in fact worshipped the jinns (that",
                " is, satans); most of these believed in",
                " them.\" (vv. 40-41). Similarly in Surah Al-Ma'idah,",
                " it is said:\" And when AIIah will",
                " say \"O Jesus, son of Mary, did",
                " you ever say to the people: `Make",
                " me and my mother gods instead of",
                " Allah?' He will answer, `Glory be to",
                " Thee ! It did not behove me",
                " to say that which I had no",
                " right to say...I told them only that",
                " which Thou didst bid me: 'Worship Allah,",
                " Who is myLord as well as your",
                " Lord'.\" (vv. 116, 117)."
            ]
        },
        {
            "id": "[25:18]",
            "verse": "They will say, \"Exalted are You! It was not for us to take besides You any allies. But You provided comforts for them and their fathers until they forgot the message and became a people ruined.\"",
            "description": [
                "That is, \"They were mean people: You",
                " gave them all the provisions of life",
                " so that they may show gratitude to",
                " You, but they became ungrateful and ignored",
                " all the admonitions given by the Prophets.",
                " \""
            ]
        },
        {
            "id": "[25:19]",
            "verse": "So they will deny you, [disbelievers], in what you say, and you cannot avert [punishment] or [find] help. And whoever commits injustice among you - We will make him taste a great punishment.",
            "description": [
                "That is, \"On that Day your religion,",
                " which you now believe, to be true.",
                " will prove to be false and even",
                " your gods, whom you yourselves have set",
                " up,' will declare it to be a",
                " lie; for none of them ever asked",
                " you to make them your deities and",
                " worship them as such. Consequently, instead of",
                " interceding on your behalf; they will bear",
                " witness against you.\"",
                "*28) \"... who will",
                " be guilty of iniquity ...\": \" ....",
                " who will be unjust to the Reality",
                " and the Truth and guilty of disbelief",
                " and shirk \"The context shows that those",
                " who reject the Prophet and set up",
                " other deities instead of Allah and deny",
                " life in the Hereafter, are guilty of",
                " zulm (iniquity)."
            ]
        },
        {
            "id": "[25:20]",
            "verse": "And We did not send before you, [O Muhammad], any of the messengers except that they ate food and walked in the markets. And We have made some of you [people] as trial for others - will you have patience? And ever is your Lord, Seeing.",
            "description": [
                "This is an answer to the objection",
                " of the disbelievers of Makkah that Muhammad",
                " (Allah's peace be upon him) could not",
                " be a Messenger of Allah because he",
                " ate food and moved about in the",
                " streets. They have been told that all",
                " the Messengers of Allah who came before",
                " Muhammad (Allah's peace be upon him)like Noah,",
                " Abraham, Ishmael, Moses and many others whom",
                " they knew and acknowledged as Prophets and",
                " Messengers of Allah also ate food and",
                " walked about in the streets. Nay, even",
                " Prophet Jesus, son of Mary, himself, whom",
                " the Christians had made the son of",
                " God (and whose image had also been",
                " placed in the Ka`bah by the disbelievers",
                " of Makkah) ate food and walked about",
                " in the streets like a common man",
                " even according to the Gospels themselves.",
                "*30)",
                " It is obvious that the Messenger and",
                " the Believers were a test for the",
                " disbelievers as to whether they would believe",
                " even after hearing the Divine Message and",
                " seeing their pure character. On the other",
                " hand, the disbelievers were a test for",
                " the Messenger and his followers in the",
                " sense that they were a means of",
                " proving and trying their true Faith by",
                " their persecution. For it is this test",
                " alone which helps to discriminate the true",
                " Believers from the hypocrites. That is why,",
                " at tirst, only the poor arid the",
                " helpless but sincere people embraced Islam. Had",
                " there been no persecution and hardships but",
                " prosperity, wealth and grandeur, the worshippers of",
                " the world and the selfish people would",
                " have been the first to embrace Islam.",
                "",
                "*31) That is, \"Now when you have",
                " understood the wisdom of the test by",
                " persecution, it is hoped that you will",
                " endure all kinds of hardships without complaint,",
                " and willingly undergo the persecutions that are",
                " inevitable.\"",
                "*32) It probably means two things:",
                " First, the way your Lord is conducting",
                " your affairs, is according to His will",
                " and nothing that happens is without His",
                " knowledge. Second, He is fully aware of",
                " your sincerity and righteousness in serving His",
                " cause under all kinds of hardships. You",
                " should therefore rest assured that you will",
                " have your full reward. He also sees",
                " the persecution and iniquity of the disbelievers;",
                " therefore they will not escape the consequences",
                " of their wickedness ."
            ]
        },
        {
            "id": "[25:21]",
            "verse": "And those who do not expect the meeting with Us say, \"Why were not angels sent down to us, or [why] do we [not] see our Lord?\" They have certainly become arrogant within themselves and [become] insolent with great insolence.",
            "description": [
                "That is, \"If Allah had really intended",
                " to convey His Message to us, He",
                " would not have chosen a prophet and",
                " sent an angel only to him, but",
                " to each one of us individually with",
                " the guidance, or He should have sent",
                " a deputation of angels to appear before",
                " the people with the Message\". The same",
                " objection has been stated in Surah Al-An`am",
                " thus: \"When a Revelation comes before them,",
                " they say, `We will not believe in",
                " it unless we are given the like",
                " of what has been given to the",
                " Messengers of Allah.' Allah knows best whom",
                " to entrust with His Mission and how",
                " it should be enforced.\" (v. 124) appeal",
                " . \"",
                "*34) That is. \"Allah Himself",
                " should appear before us and make the",
                " appeal.",
                "*35) Another translation could be: \"They",
                " have formed a very high opinion of",
                " their own selves.\""
            ]
        },
        {
            "id": "[25:22]",
            "verse": "The day they see the angels - no good tidings will there be that day for the criminals, and [the angels] will say, \"Prevented and inaccessible.\"",
            "description": [
                "This very theme has been expressed in",
                " much greater detail in AlAn'am: 8, Al-Hijr:",
                " 7-8 and 51-64, and also in Bani",
                " Isra`il: 90-95."
            ]
        },
        {
            "id": "[25:23]",
            "verse": "And We will regard what they have done of deeds and make them as dust dispersed.",
            "description": [
                "For explanation, see Ibrahim: 18 and E.",
                " N.'s 25, 26 thereof."
            ]
        },
        {
            "id": "[25:24]",
            "verse": "The companions of Paradise, that Day, are [in] a better settlement and better resting place.",
            "description": [
                "In contrast to the miserable plight of",
                " the disbelievers on the Day of Resurrection,",
                " the Believers will be protected from the",
                " hardships of that Day; they will be",
                " treated with honour and will have a",
                " blissful place for midday rest. According to",
                " a Tradition, the Holy Prophet said: \"I",
                " declare on oath by AIIah, in Whose",
                " hand is my life, that the long,",
                " horrible Day of Resurrection will be made",
                " very short and light for a Believer,",
                " as short and light as the time",
                " taken in offering an obligatory Prayer.\" (Musnad",
                " Ahmad)."
            ]
        },
        {
            "id": "[25:25]",
            "verse": "And [mention] the Day when the heaven will split open with [emerging] clouds, and the angels will be sent down in successive descent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:26]",
            "verse": "True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day.",
            "description": [
                "That is, \"On that Day all other",
                " kingdoms, which deluded man in the world,",
                " will come to an end, and there",
                " will be only the Kingdom of Allah,",
                " Who is the real Sovereign of the",
                " universe. In Surah Mu'min: 16, the same",
                " thing has been stated thus: \"On that",
                " Day when aII the people will stand",
                " exposed, and nothing of them will be",
                " hidden from Allah, it will be asked,",
                " `Whose is the Sovereignty today?' The response",
                " from every side will he: `Of Allah,",
                " the Almighty'.\" According to a Tradition, the",
                " Holy Prophet said, \"AIlah will take the",
                " heavens in one hand and the earth",
                " in the other, and will declare: `I",
                " am the Sovereign: I am the Ruler.",
                " Where are the other rulers of the",
                " earth? Where are those tyrants`? Where are",
                " the arrogant people?\" (Musnad Ahmad, Bukhari, Muslim,",
                " and Abu Da'ud, with slight variations)."
            ]
        },
        {
            "id": "[25:27]",
            "verse": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:28]",
            "verse": "Oh, woe to me! I wish I had not taken that one as a friend.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:29]",
            "verse": "He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter.\"",
            "description": [
                "\"Satan has proved very treacherous to man\"",
                " may also be a part of the",
                " disbelievers' lament, or it may be a",
                " remark by AIIah, in which case the",
                " meaning will be: \"And Satan is indeed",
                " the one who always deceives man.\""
            ]
        },
        {
            "id": "[25:30]",
            "verse": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned.\"",
            "description": [
                "The Arabic word mahjur is capable of",
                " several meanings. As such, the sentence may",
                " mean:\" \"these people did not regard the",
                " Qur'an as worthy of their consideration: they",
                " neither accepted it nor followed it\"; or",
                " \"They considered it to be a nonsense",
                " or the delirium of insanity: or \"They",
                " made it the target of their ridicule",
                " and mockery.\""
            ]
        },
        {
            "id": "[25:31]",
            "verse": "And thus have We made for every prophet an enemy from among the criminals. But sufficient is your Lord as a guide and a helper.",
            "description": [
                "That is, \"It is not a new",
                " thing that the disbelievers have become your",
                " enemies, for it has always been so",
                " with all the former Prophets and Messengers.",
                " (See also Al-An'am: 112-113). This is inevitable",
                " because it is Our Law that the",
                " criminals will always oppose the Truth. You",
                " should, therefore, pursue your mission with full",
                " confidence and determination without expecting any immediate",
                " results.\"",
                "*43) \"Guidance\" does not only imply",
                " bestowing of the knowledge of the Truth,",
                " but it also means giving the right",
                " guidance at the right time to guide",
                " the Islamic Movement on the right lines",
                " and to defeat the strategy and scheme",
                " of the enemies of Islam \"Help\" means",
                " all kinds of moral, spiritual and material",
                " help to the followers of the Truth",
                " in their conflict against falsehood. Thus, Allah",
                " is AllSufficient for the righteous people and",
                " they need no other support provided they",
                " have full faith in Allaln and fight",
                " falsehood with all their energies and strength.",
                " This meant to encourage the Holy Prophet,",
                " otherwise the previous assertion would have been",
                " very discouraging without this. It meant to",
                " say, \"Even :f the unbelievers have become",
                " your enemies, you should continue your mission,",
                " for We shall guide you in every",
                " stage and situation and help you against",
                " them. We shall defeat aII the schemes",
                " of your enemies and help you in",
                " every way in your conflict with falsehood.",
                " We shall provide you with material means",
                " also, but you should trust in Us",
                " and exert your utmost against falsehood.\""
            ]
        },
        {
            "id": "[25:32]",
            "verse": "And those who disbelieve say, \"Why was the Qur'an not revealed to him all at once?\" Thus [it is] that We may strengthen thereby your heart. And We have spaced it distinctly.",
            "description": [
                "As the disbelievers of Makkah considered this",
                " objection to be very strong, they repeated",
                " it over and over again. The Qur'an",
                " also has cited it with its answer",
                " at several places; for instance, see E.N.'s",
                " 101-106 of Surah An-Naml and E.N. 119",
                " of Bani Isra'il. Their question implied: \"Had",
                " the Qur'an been really the Word of",
                " Allah, it would have been sent as",
                " a complete book aII at once; for",
                " Allah has the knowledge of everything and",
                " every human affair. Thus it is obvious",
                " that nothing is being sent down from",
                " above; but this man himself fabricates all",
                " its themes or gets these from other",
                " people or other books. \"",
                "*45) Another",
                " translation can be: \"So that by it",
                " We may strengthen your heart and imbue",
                " it with courage.\" The words are comprehensive",
                " and imply both the meanings. This concise",
                " sentence contains the following explanation why the",
                " Qur'an was revealed piecemeal by degrees:",
                "(1)",
                " So that the Holy Prophet may commit",
                " it to memory perfectly and recite it",
                " to his people, who are illiterate, rather",
                " than present it in a written form.",
                "",
                "(2) So that its teachings and messages",
                " may be impressed deeply on the minds.",
                "",
                "(3) So that the way of life",
                " it teaches, may be followed with complete",
                " conviction, which would not be possible if",
                " all the Commandments and the whole system",
                " of life had been sent down all",
                " at once.",
                "(4) So that the hearts",
                " of the Prophet and his followers may",
                " be imbued with courage during the conflict",
                " between the Truth and falsehood. This required",
                " that the Divine Guidance and messages of",
                " encouragement should be revealed as and when",
                " needed according to the practical situation. Obviously,",
                " this could not have been possible if",
                " these had been sent down all at",
                " once. This also showed that Allah had",
                " not left His Messenger alone amidst persecution",
                " to counter all sorts of resistance and",
                " opposition after appointing him to the mission,",
                " but He Himself was watching the struggle",
                " with concern and guiding His Prophet through",
                " every difficulty by direct communion in every",
                " critical situation."
            ]
        },
        {
            "id": "[25:33]",
            "verse": "And they do not come to you with an argument except that We bring you the truth and the best explanation.",
            "description": [
                "This is yet another point of wisdom",
                " of sending down the Qur'an by degrees.",
                " Allah did not intend to produce a",
                " book on \"Guidance\" and spread its teachings",
                " through the agency of His Prophet. Had",
                " it been so the disbelievers would have",
                " been justified in their objection as to",
                " why the Qur'an had not been sent",
                " down as a complete book all at",
                " once. The real object of the revelation",
                " of the Qur'an was that Allah intended",
                " to start a Movement of faith, piety",
                " and righteousness to combat disbelief, ignorance and",
                " sin, and He had raised a Prophet",
                " to lead and guide the Movement. Then,",
                " on the one hand, Allah had taken",
                " it upon Himself to send necessary instructions",
                " and guidance to the leader and his",
                " followers as and when needed, and on",
                " the other, He had also taken the",
                " responsibility to answer the objections and remove",
                " the doubts of opponents and give the",
                " right interpretation of things which they misunderstood.",
                " Thus the Qur'an was the collection of",
                " the differentdiscourses that were being revealed by",
                " Allah; it was not merely meant to",
                " be a code of laws or of",
                " moral principles, but a Book, which was",
                " being sent down piecemeal to guide the",
                " Movement in all its stages to suit",
                " its requirements on different occasions. (See also",
                " Introduction: The Meaning of the Qur'an, Vol.",
                " I, pp. 9- 18)."
            ]
        },
        {
            "id": "[25:34]",
            "verse": "The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.",
            "description": [
                "That is, \"They will be driven towards",
                " Hell upon their faces because of their",
                " perversion and their perverted thinking.\""
            ]
        },
        {
            "id": "[25:35]",
            "verse": "And We had certainly given Moses the Scripture and appointed with him his brother Aaron as an assistant.",
            "description": [
                "Here by \"the Book\" is not meant",
                " the Torah, which was given to Prophet",
                " Moses after the exodus from Egypt, but",
                " it implies that Divine Guidance which was",
                " given to him after his appointment as",
                " a Prophet up to the Exodus. It",
                " included the orations delivered by him in",
                " the court of Pharaoh and also the",
                " instructions given to him during his conflict",
                " with Pharaoh as mentioned in the Qur'an",
                " here and there. Most probably, these things",
                " were not included in the Torah; the",
                " Torah began with the Ten Commandments which",
                " were given to Moses engraved on stone",
                " tablets on Mount Sinai after the Exodus.",
                ""
            ]
        },
        {
            "id": "[25:36]",
            "verse": "And We said, \"Go both of you to the people who have denied Our signs.\" Then We destroyed them with [complete] destruction.",
            "description": [
                "\"Revelations\": The Divine teachings which had reached",
                " them through Prophets Jacob and Joseph, and",
                " which had been preached to them by",
                " the righteous people of Israel for centuries",
                ""
            ]
        },
        {
            "id": "[25:37]",
            "verse": "And the people of Noah - when they denied the messengers, We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.",
            "description": [
                "They did not charge only Prophet Noah",
                " with imposture because he was a man,",
                " but, in fact, charged all the Prophets",
                " with imposture because they were aII human",
                " beings.",
                "*51) That is, a painful chastisement",
                " in the Hereafter."
            ]
        },
        {
            "id": "[25:38]",
            "verse": "And [We destroyed] 'Aad and Thamud and the companions of the well and many generations between them.",
            "description": [
                "There is no definite knowledge about \"the",
                " people of the Raas'' . Different commentators",
                " have said different things about them, but",
                " nothing is convincing. The only thing that",
                " may be said about them is that",
                " they were a people who had killed",
                " their Prophet by throwing him into or",
                " hanging him down a \"Rass \" (an",
                " old or dry well)."
            ]
        },
        {
            "id": "[25:39]",
            "verse": "And for each We presented examples [as warnings], and each We destroyed with [total] destruction.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:40]",
            "verse": "And they have already come upon the town which was showered with a rain of evil. So have they not seen it? But they are not expecting resurrection.",
            "description": [
                "The habitation referred to was that of",
                " the people of Prophet Lot, which was",
                " destroyed by a rain of stones. The",
                " people of Hijaz while traveling to Palestine",
                " and Syria, passed by its ruins and",
                " heard the horrible tales of its destruction",
                " .",
                "*54) As the disbelievers did not",
                " believe in the Hereafter, they looked at",
                " these ancient ruins as mere spectators and",
                " did not take any warning from them.",
                " Incidentally, this is the difference between the",
                " observation of a disbeliever and of a",
                " Believer in the Hereafter: the former looks",
                " at such things as a mere spectator",
                " or at the most as an archaeologist",
                " whereas the latter learns moral lessons from",
                " the same and obtains an insight into",
                " the realities beyond this worldly life."
            ]
        },
        {
            "id": "[25:41]",
            "verse": "And when they see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one whom Allah has sent as a messenger?",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:42]",
            "verse": "He almost would have misled us from our gods had we not been steadfast in [worship of] them.\" But they are going to know, when they see the punishment, who is farthest astray in [his] way.",
            "description": [
                "Obviously there is a contradiction between the",
                " question posed by the disbelievers and the",
                " assertion made by them about their deities.",
                " The question was meant to bring the",
                " Holy Prophet into contempt, as if to",
                " say, \"You are making a claim that",
                " is far above your low position.\" On",
                " the other hand, their assertion shows that",
                " ,they indirectly admitted the force of the",
                " arguments and the high character of the",
                " Holy Prophet and were even afraid of",
                " the effectiveness and success of his Message,",
                " because, according to them, it was going",
                " to turn them away from their false",
                " gods."
            ]
        },
        {
            "id": "[25:43]",
            "verse": "Have you seen the one who takes as his god his own desire? Then would you be responsible for him?",
            "description": [
                "\"...the person who makes his lust his",
                " god\" is the one who becomes the",
                " slave of his lusts and desires. As",
                " he serves his lust like the one",
                " who warships ' his deity, he becomes",
                " as much guilty of .shirk as the",
                " one who worships an idol. According to",
                " a Tradition, related by Hadrat Abu Hurairah,",
                " the Holy Prophet said, \"Of all the",
                " false gods being worshipped and served, instead",
                " of Allah, the worst in the sight",
                " of Allah is one's own lust.\" (Tabarani).",
                " For further explanation, see E.N. 50 of",
                " Al-Kahf, The man who keeps his desires",
                " under control, and uses his common sense",
                " to make decisions, can be expected to",
                " come to the right path by making",
                " an appeal to his reason even though",
                " he might have been involved in shirk",
                " or disbelief; for if. he decides to",
                " follow the right way he will remain",
                " firm and steadfast on it. On the",
                " other hand, the man who is the",
                " slave of his own lust, is like",
                " a ship without an anchor, who wanders",
                " about on any path where his lust",
                " leads him. He is least bothered about",
                " the distinction between the right and the",
                " wrong, the true and the false, and",
                " has no desire to choose one against",
                " the other. And, if ar alI, such",
                " a person is persuaded to accept the",
                " message of Guidance, no one can take",
                " the responsibility that he will observe any",
                " moral laws."
            ]
        },
        {
            "id": "[25:44]",
            "verse": "Or do you think that most of them hear or reason? They are not except like livestock. Rather, they are [even] more astray in [their] way.",
            "description": [
                "\"They are only like the cattle\" because",
                " they follow their lusts blindly. Just as",
                " the sheep and cattle do not know",
                " where their driver is taking them, to",
                " the meadow or to the slaughter house,",
                " so are these people also following their",
                " leaders blindly without knowing or judging where",
                " they are being led-to success or to",
                " destruction.. The only difference between the two",
                " is that the cattle have no intelligence",
                " and will not be accountable as to",
                " the place where they are being taken",
                " by the driver. But it is a",
                " pity that human beings who are endowed",
                " with reason, should behave like cattle; therefore",
                " their condition is worse than that of",
                " cattle.",
                "Incidentally it should be noted that",
                " this passage (w . 43, 44) is",
                " not meant to dissuade the Holy Prophet",
                " from conveying the Message to such people,",
                " but it is an indirect warning to",
                " the disbelievers of the consequences if they",
                " continued to behave like cattle ."
            ]
        },
        {
            "id": "[25:45]",
            "verse": "Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication.",
            "description": [
                "The word dalil has been used in",
                " the sense of the \"pilot\", who is",
                " a person trained to take ships safely",
                " in or out of a harbour, or",
                " along a waterway. The sun has been",
                " trade the pilot of the shadow because",
                " the lengthening out of the shadow and",
                " its being rolled up depends on the",
                " rising, declining and setting of the sun.",
                ""
            ]
        },
        {
            "id": "[25:46]",
            "verse": "Then We hold it in hand for a brief grasp.",
            "description": [
                "\"We roll it up......Curselves\": \"We annihilate it",
                " or cause it to disappear\", for everything",
                " which is annihilated returns to Allah, because",
                " everything comes from Elim and returns to",
                " Him.",
                "The Qur'an has used the phenomenon",
                " of the shadow caused by the sun",
                " for two purposes. (fit is taken literally,",
                " it is meant to warn the disbelievers",
                " that they should learn a lesson from",
                " this and should not behave like cattle,",
                " as if to say, \"If you had",
                " considered the benefits of the shadow in",
                " regard to your everyday experience, you would",
                " have accepted without any hesitation the Doctrine",
                " of Tauhid. Had the shadow been constant,",
                " there would have been no life en",
                " earth, for life depends on the light",
                " and heat of the sun. On the",
                " other hand, if there had been no",
                " shadow at all, the constant heat and",
                " light of the sun would have made",
                " life impossible. Besides this, if there had",
                " been sudden changes in the sun and",
                " the shadow, they would not have been",
                " able to endure it for long; therefore",
                " you should reflect on this phenomenon and",
                " understand it well that it has been",
                " so ordained by the AII-Wise and the",
                " AII-Powerful Creator so that it always increases",
                " or decreases gradually in accordance with fixed",
                " natural laws. Thus it is obvious that",
                " it could not have come into existence",
                " by itself nor produced by blind mechanisms",
                " nor functioned so regularly and continuously under",
                " many independent gods.\"",
                "But if it is",
                " taken in the metaphorical sense, there is",
                " between the lines a subtle suggestion, and",
                " it is this: Just as the shadow",
                " dces not remain in one and the",
                " same state, likewise the shadow of disbelief",
                " and shirk, which appears to have spread",
                " far and wide, will begin to shorten",
                " as the \"Sun\" of Guidance gradually rises;",
                " but it requires patience, for Allah never",
                " brings about sudden changes."
            ]
        },
        {
            "id": "[25:47]",
            "verse": "And it is He who has made the night for you as clothing and sleep [a means for] rest and has made the day a resurrection.",
            "description": [
                "The night is a \"garment\" in the",
                " sense that it covers and hides things.",
                "",
                "*61) This verse has three objects:",
                "(1)",
                " It provides a proof of Tauhid,",
                "(2)",
                " It furnishes a proof of the possibility",
                " of life-after-death from everyday human experience, and",
                "",
                "(3) It bears the good news that",
                " the night of ignorance has come to",
                " an end and now the bright day",
                " of Knowledge and Guidance has dawned. It",
                " is therefore inevitable that those who were",
                " sleeping the sleep of ignorance, will sooner",
                " or later wake up, but those who",
                " have slept the sleep of death, will",
                " not wake up and will themselves be",
                " deprived of life, while the business of",
                " the day will go on thriving even",
                " without them."
            ]
        },
        {
            "id": "[25:48]",
            "verse": "And it is He who sends the winds as good tidings before His mercy, and We send down from the sky pure water",
            "description": [
                "That is, such water as is pure",
                " and free from alI sorts of impurities,",
                " germs and poison, which cleanses and washes",
                " away filth and becomes a source of",
                " life for men, beasts as well as",
                " all kinds of plant life."
            ]
        },
        {
            "id": "[25:49]",
            "verse": "That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.",
            "description": [
                "This verse also gives proofs of the",
                " Doctrine of Tauhid and the Hereafter. Besides,",
                " it contains a subtle suggestion that the",
                " period of the \"drought\" of ignorance has",
                " been replaced through Allah's mercy by the",
                " \"blessed rain\" of Prophethood, which is showering",
                " the life-giving knowledge of Revelation from which",
                " many servants of AIlah will certainly benefit,",
                " if not all ."
            ]
        },
        {
            "id": "[25:50]",
            "verse": "And We have certainly distributed it among them that they might be reminded, but most of the people refuse except disbelief.",
            "description": [
                "\"We present...before them\" may have three meanings:",
                " (1)\"We have cited the phenomenon of rainfall",
                " over and over again in the Qur'an",
                " in order to make plain to them",
                " the Reality.\"",
                "(2) \"We are time and",
                " again showing them the wonderful phenomenon of",
                " the heat and drought, seasonal winds and",
                " clouds, rainfall and its lifeproducing effects.\"",
                "(3)",
                " \"We go on changing the system of",
                " the distribution of rainfall throughout the ,",
                " world year after year, so that the",
                " same place does not receive the same",
                " amount of rainfall every time: sometimes a",
                " place is left completely dry, another has",
                " more or less of rainfall than usual,",
                " while some other is flooded with rain",
                " water. They see all these different phenomena",
                " with their countless different results in their",
                " daily life.\"",
                "*65) The verse means to",
                " impress that the wonderful system of rainfall",
                " is by itself a proof of the",
                " existence of Allah, of One Lord of",
                " the universe, and of His attributes. Its",
                " wonderful distribution during the year and over",
                " different parts of the earth is a",
                " clear proof that there is an All-Wise",
                " Designer. But the obdurate disbelievers do not",
                " learn any lesson from it, and persist",
                " in their ingratitude, though this has been",
                " cited in the Qur'an repeatedly for this",
                " purpose.",
                "It is also a proof of",
                " the life-after-death, for the disbelievers themselves see",
                " and again that rainfall brings to life",
                " dead land year after year. This clearly",
                " that Allah has the power to bring",
                " the dead back to life, but the",
                " disbelievers it time proves do not learn",
                " any lesson from it and persist in",
                " their irresponsible ways .",
                "If verse 48",
                " is taken in the metaphorical sense, the",
                " \"pure water\" of rain will mean the",
                " blessings of Prophet hood. Human history shows",
                " that whenever this blessing as been sent",
                " down, ignorance has been replaced by knowledge,",
                " injustice by justice and wickedness by righteousness.",
                " The coming of Prophets has always proved",
                " to be the harbinger of a moral",
                " revolution. But only those who accepted their",
                " guidance benefited from it. This is the",
                " lesson of history, yet the disbelievers reject",
                " it because of their ingratitude."
            ]
        },
        {
            "id": "[25:51]",
            "verse": "And if We had willed, We could have sent into every city a warner.",
            "description": [
                "That is, \"If We had willed, We",
                " could have sent a separate Prophet to",
                " every habitation but We did not do",
                " so, because like the sun, Our Last",
                " Prophet suffices to enlighten the whole world.\"",
                ""
            ]
        },
        {
            "id": "[25:52]",
            "verse": "So do not obey the disbelievers, and strive against them with the Qur'an a great striving.",
            "description": [
                "The Arabic words Jihad-i-Kabir imply three meanings:",
                "",
                "(1) To exert one's utmost for the",
                " cause of Islam,",
                "(2) To dedicate all",
                " one's resources to this cause, and",
                "(3)",
                " To tight against the enemies of Islam",
                " on all possible fronts with all one's",
                " resources in order to raise high the",
                " \"Word of Allah\". This will include jihad",
                " with one's tongue, pen, wealth, life and",
                " every other available weapon ."
            ]
        },
        {
            "id": "[25:53]",
            "verse": "And it is He who has released [simultaneously] the two seas, one fresh and sweet and one salty and bitter, and He placed between them a barrier and prohibiting partition.",
            "description": [
                "This phenomenon has been perceived in many",
                " places in the sea and on the",
                " land that sweet water and bitter water",
                " has existed side by side. Turkish Admiral",
                " Syedi Ali Ra'is, in his book Mir",
                " 'at-al-Mamalik, written in the 16th century, has",
                " mentioned a place in the Persian Gulf,",
                " where springs of sweet waver exist under",
                " the bitter waters of the sea, where",
                " he could get drinking water for his",
                " fleet. The American Oil Company at first",
                " obtained water from the same springs in",
                " the Persian Gulf, before they dug up",
                " wells near Dhahran for supply of drinking",
                " water. Near Bahrain also there exist springs",
                " of sweet water at the sea bed",
                " from which people have been taking water",
                " until quite recently. Besides this apparent meaning",
                " which gives a rational proof of Allah's",
                " being the One and the only Lord",
                " of the universe, the verse contains a",
                " subtle suggestion as well: When Allah wills,",
                " He can raise up a righteous community",
                " from among a large wicked society just",
                " as He can cause springs of palatable",
                " and sweet water to gush out from",
                " under the salty waters of the sea.",
                ""
            ]
        },
        {
            "id": "[25:54]",
            "verse": "And it is He who has created from water a human being and made him [a relative by] lineage and marriage. And ever is your Lord competent [concerning creation].",
            "description": [
                "Here the miracle of the birth of",
                " man from a mere sperm drop and",
                " the procreation of his offspring from man",
                " and woman have been cited as a",
                " proof of Tauhid. Though both man and",
                " woman belong to the same genus, they",
                " are two species, having important common human",
                " characteristics but different physical structures and psychological",
                " traits. It is a proof of Tauhid",
                " that the All-Powerful Allah has used this",
                " \"difference\" for making the two as complements",
                " and not antagonists. ' It is also",
                " the design of the All-Powerful Creator that",
                " He is creating sons and daughters in",
                " the world in due proportion Then the",
                " sons marry and create blood relationships, and",
                " the daughters are married and become means",
                " of forming new relaticnships. This process goes",
                " on widening to produce families, tribes and",
                " nations belonging to the same race and",
                " bound by the same civilization. The verse",
                " has also a subtle suggestion: The whole",
                " of life is being run on the",
                " principle of \"differenc\", for example, the difference",
                " between the night and the day, the",
                " summer and the winter, etc. Therefore, \"",
                " O Muslims, you should patiently endure the",
                " differences you are having with your opponents",
                " for these are certain to produce good",
                " results.\""
            ]
        },
        {
            "id": "[25:55]",
            "verse": "But they worship rather than Allah that which does not benefit them or harm them, and the disbeliever is ever, against his Lord, an assistant [to Satan].",
            "description": [
                "This is a characteristic of the typical",
                " disbeliever: he is a helper and defender",
                " of all those who are rebels against",
                " AIIah and an enemy of aII those",
                " who may he striving to raise Allah's",
                " Word and enforce His Law in the",
                " world; he is associated directly or indirectly",
                " with all the works of Allah's disobedience",
                " and opposes and resists in one way",
                " or the other every effort that is",
                " made to bring people to the path",
                " of Allah's obedience and service."
            ]
        },
        {
            "id": "[25:56]",
            "verse": "And We have not sent you, [O Muhammad], except as a bringer of good tidings and a warner.",
            "description": [
                "This verse (56) was meant to comfort",
                " the Holy Prophet and to warn the",
                " disbelievers who opposed him and obstructed his",
                " work, as if to say, \"Your duty",
                " is only to convey the Message of",
                " good news to the people and to",
                " warn them of the consequences of disbelief:",
                " you are not responsible as to whether",
                " they accept .your Message or reject it,",
                " or to reward the Believers and punish",
                " the disbelievers.\"",
                "Such words occur in the",
                " Qur'an at other places also and are",
                " obviously directed to the disbelievers, as if",
                " to say, \"The Message of the Prophet",
                " is meant to reform the people without",
                " any tinge of selfishness. As he does",
                " not force the people to accept his",
                " Message, there is no reason why you",
                " should feel offended. If you accept the",
                " Message, it will be for your own",
                " good, and if you reject it, you",
                " will be harming yourselves alone. For after",
                " conveying the Message, he is relieved of",
                " his duty and responsibility; then the matter",
                " will be between you and Us.\"",
                "Although",
                " this is a very simple and clear",
                " interpretation of verse 56 (and of similar",
                " other verses), yet some people erroneously conclude",
                " from it that the only duty and",
                " responsibility of the Prophet is to convey",
                " the Message and nothing else. They forget",
                " that the Qur'an has stressed over and",
                " over again that the Prophet is not",
                " only a giver of good news to",
                " the Believers but he is also their",
                " teacher, their lawgiver, judge and guide, a",
                " purifier of their morals and a model",
                " of life for them, and that every",
                " word which he utters is law which",
                " they have to obey and follow willingly",
                " in all walks of life and for",
                " all times to come."
            ]
        },
        {
            "id": "[25:57]",
            "verse": "Say, \"I do not ask of you for it any payment - only that whoever wills might take to his Lord a way.\"",
            "description": [
                "71a. For explanation, see E.N. 70 of",
                " Al-Mu'minun."
            ]
        },
        {
            "id": "[25:58]",
            "verse": "And rely upon the Ever-Living who does not die, and exalt [Allah] with His praise. And sufficient is He to be, with the sins of His servants, Acquainted -",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:59]",
            "verse": "He who created the heavens and the earth and what is between them in six days and then established Himself above the Throne - the Most Merciful, so ask about Him one well informed.",
            "description": [
                "For explanation of \"Throne\", see E.N.'s 41,",
                " 42 of Al-A'raf, E.N. 4 of Yunus,",
                " and E.N. 7 of Hud. It is",
                " difficult to say what exactly is mean",
                " by \"six days\" Here a \"day\" thay",
                " mean a period of time or an",
                " ordinary day of this world. For explanation",
                " of the \"day\", see E.N.'s 11 to",
                " 15 of Surah Ha Mim Sajdah."
            ]
        },
        {
            "id": "[25:60]",
            "verse": "And when it is said to them, \"Prostrate to the Most Merciful,\" they say, \"And what is the Most Merciful? Should we prostrate to that which you order us?\" And it increases them in aversion.",
            "description": [
                "This they said due to their arrogance",
                " and stubbornness just as Pharaoh had said",
                " to Prophet Moses: \"What is the Lord",
                " of the universe?\" For the disbelievers of",
                " Makkah were not unaware of the Merciful",
                " (Rahman), nor was Pharaoh unaware of the",
                " \"Lord of the universe\". The wording of",
                " the verse itself chows that their question",
                " about the \"Merciful\" was not the result",
                " of their ignorance of Him but was",
                " due to their rebelliousness; otherwise Allah would",
                " not have punished them for this but",
                " would have informed them politely that He",
                " Himself is \"Merciful\". Besides this, it is",
                " well known istorically that the word Rahman",
                " (Merciful) for Allah had been in common",
                " usage in Arabia since the ancient times.",
                " Please see also E.N. 5 of As-Sajdah",
                " and E.N. 35 of Saba.",
                "*74) All",
                " scholars are agreed that here a `Prostration",
                " of Recital' (Sajdah Talawat) has been enjoined,",
                " which means that every reader and every",
                " hearer must prostrate himself on reciting or",
                " hearing the recital of this verse. According",
                " to traditions, the one who hears this",
                " verse being recited should say: Zadan Allahu,",
                " khudu an-anima zada, lil-a`daa-i nufura: \"May Allah",
                " increase us in humility even as the",
                " enemies are increased in their hatred.\""
            ]
        },
        {
            "id": "[25:61]",
            "verse": "Blessed is He who has placed in the sky great stars and placed therein a [burning] lamp and luminous moon.",
            "description": [
                "See E.N.'s 8 to 12 of A1",
                " Hijr.",
                "*76) That is, the sun, as",
                " mentioned clearly in Surah Nuh: 16: \"...",
                " and made the sun a lamp. \"",
                ""
            ]
        },
        {
            "id": "[25:62]",
            "verse": "And it is He who has made the night and the day in succession for whoever desires to remember or desires gratitude.",
            "description": [
                "The observation and deep consideration of the",
                " wonderful phenomenon of the alternation of the",
                " day and night is a proof of",
                " Tauhid and His Providence so that man",
                " may feel grateful to Him and prostrate",
                " himself before Him in all humility."
            ]
        },
        {
            "id": "[25:63]",
            "verse": "And the servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them [harshly], they say [words of] peace,",
            "description": [
                "That is, \"Though all human beings are",
                " by birth the servants of the Merciful",
                " before Whom you have been invited to",
                " prostrate yourselves, and which you disdain, his",
                " true servants are those who adopt the",
                " way of His obedience consciously and develop",
                " such desirable characteristics. Then the natural consequences",
                " of the prostration are those found in",
                " the lives of the Believers and the",
                " evil results of rejecting the invitation, those",
                " found in your lives.\" Here attention is",
                " being drawn to the two patterns of",
                " character and life: first of those who",
                " had accepted the Message of the Holy",
                " Prophet and were following it, and the",
                " second of those who persisted in the",
                " ways of ignorance. Here only the prominent",
                " characteristics of the true Believers have been",
                " cited, and for contrast, the characteristics of",
                " the disbelievers have been left to every",
                " discerning eye and mind which could see",
                " them all around in society and make",
                " its own decision.",
                "*79) That is; \"They",
                " do not walk haughtily and arrogantly like",
                " the tyrants and mischief-makers, but their \"gait\"",
                " is of a gentle, right-thinking and goodnatured",
                " person.\" \"Walking humbly\" does not mean walking",
                " like a weak or sick person, nor",
                " does it imply the gait of a",
                " hypocrite who walks ostentatiously to show humility",
                " or fear of God. According to Traditions,",
                " the Holy Prophet himself used to walk",
                " with firm, quick steps. One day Caliph",
                " `Umar saw a young man walking slowly",
                " like a weak, sick person, and asked",
                " him, \"Are you ill?\" When the man",
                " replied in the negative, the Caliph raised",
                " his whip, rebuked him and told him",
                " to walk like a healthy man. This",
                " shows that the \"humble gait\" is the",
                " natural gait of a noble and gentle",
                " person and not a gait which shows",
                " weakness and undue humility. In this connection,",
                " the first characteristic of the true servants",
                " of Allah to which attention has been",
                " drawn, is their \"gait\" This is because",
                " the gait indicates the character of an",
                " individual. If a man walks in a",
                " humble and dignified way, as opposed to",
                " a haughty, vain and proud manner, it",
                " shows that he is a noble and",
                " gentle person. Thus the different \"gaits\" of",
                " the different types of people show what",
                " sort of characters they possess. The verse",
                " means to imply that the true servants",
                " of the Merciful can be easily recognized",
                " by their \"gait\" among the people. Their",
                " attitude of Allah's worship and obedience has",
                " changed them so thoroughly that it can",
                " \"be seen at first sight from their",
                " \"gate that they are noble, humble and",
                " good natured people, who cannot be expected",
                " to indulge in any mischief. For further",
                " explanation, see E.N.43 of Bani Isra'il and",
                " L.N 33 of Luqman",
                "*80) \"Ignorant people\":",
                " Rude and insolent people and not uneducated",
                " and illiterate ones. The true servants of",
                " the \"Merciful\" do not believe in \"vengeance\",",
                " even though they may have to deal",
                " with the ignorant people who behave rudely",
                " and insolently towards them. If they happen",
                " to come across such people, they wish",
                " them peace and turn away. The same",
                " thing has been expressed in AI-Qasas: 55,",
                " thus: \"And when they hear something vain",
                " and absurd they turn away from it,",
                " saying, `Our deeds are for us and",
                " your deeds are for you: peace be",
                " to you: we have nothing to do",
                " with the ignorant'.\" For details see E.N.'s",
                " 72 to 78 ul AI-Qasas."
            ]
        },
        {
            "id": "[25:64]",
            "verse": "And those who spend [part of] the night to their Lord prostrating and standing [in prayer]",
            "description": [
                "That is, they neither spend their nights",
                " in fun and merry-making nor in gossips",
                " and telling tales, nor in doing wicked",
                " deeds, for these are the ways of",
                " the ignorant people. The true servants of",
                " Allah pass their nights in worshipping and",
                " remembering Him as much as they can.",
                " This characteristic of theirs has been brought",
                " out clearly at several places in the",
                " Qur'an, thus: \"their backs forsake their beds",
                " and they invoke their Lord in fear",
                " and in hope.\" (As-Sajdah: 16). \"These people",
                " (of Paradise) slept but little at night,",
                " and prayed for their forgiveness in the",
                " hours of the morning.\" (Az-Zariyat: 17, 18).",
                " And: \"Can the end of the one,",
                " who is obedient to AIlah, prostrates himself",
                " and stands before Him during the hours",
                " of the night, fears the Hereafter and",
                " places his hope in the mercy of",
                " his Lord, be like that of a",
                " mushrik;'\" (Az-Zumar: 9)."
            ]
        },
        {
            "id": "[25:65]",
            "verse": "And those who say, \"Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:66]",
            "verse": "Indeed, it is evil as a settlement and residence.\"",
            "description": [
                "That is, their worship has not made",
                " them vain and proud to presume that",
                " they are the beloved ones of AIIah",
                " and that the Fire of Hell will",
                " not touch them. On the other hand,",
                " in spite of all their worship and",
                " good deeds, they are so tilled with",
                " the fear of the torment of Hell",
                " that they pray to their Lord to",
                " save them from it, for they do",
                " not depend upon their own work for",
                " success in the Hereafter but upon the",
                " mercy of Allah."
            ]
        },
        {
            "id": "[25:67]",
            "verse": "And [they are] those who, when they spend, do so not excessively or sparingly but are ever, between that, [justly] moderate",
            "description": [
                "The true servants of Allah adopt \"the",
                " golden mean\" between the two extremes in",
                " spending their money. They neither go beyond",
                " prudence and necessity in expenditure nor live",
                " in wretched 'circumstances in order to save",
                " and hoard money but are frugal. This",
                " was the characteristic of the followers of",
                " the Holy Prophet, which distinguished them from",
                " the well-to-do people of Arabia, who were",
                " either spend-thrifts in regard to the gratific",
                " ation of their own lusts or niggardly",
                " in spending their money on good works.",
                " According to Islam extravagance is: (1) To",
                " spend even the smallest amount of money",
                " in unlawful ways, (2) to go beyond",
                " one's own resources in expenditure even in",
                " lawful ways, or to spend money for",
                " one's own pleasure, and (3) to spend",
                " money in righteous ways not for the",
                " sake of Allah but for mere show.",
                " On the other hand, one is miserly",
                " if one dces not spend money for",
                " one's own needs and requirements and those",
                " of one's family in accordance with one's",
                " resources and position, or if one dces",
                " not spend money for good works. The",
                " way taught by Islam is the golden",
                " mean between the two extremes. The Holy",
                " Prophet has said, \"It is a sign",
                " of wisdom to adopt the \"golden mean\"",
                " in one's living.\" (Ahmad, Tabarani)."
            ]
        },
        {
            "id": "[25:68]",
            "verse": "And those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty.",
            "description": [
                "The true servants refrain from three great",
                " sins: Shirk, murder and adultery. The Holy",
                " Prophet himself warned of their gravity. According",
                " to 'Abdullah bin Mas`ud, when some one",
                " asked him about the worst sins, he",
                " replied, (1) \"It is to set up",
                " someone as equal in rank with Allah,",
                " Who has created you, (2) to kill",
                " your own child for fear of its",
                " sustenance, and (3) to commit adultery with",
                " the wife of your neighbour.\" (Bukhari, Muslim,",
                " Tirmizi, Nasa`i, Ahmad). Obviously this is not",
                " a complete list of the \"heinous sins\".",
                " But these three instances have been cited",
                " because they were most prevalent in the",
                " Arab society of those days .",
                "As",
                " regards the inclusion of refraining from shirk",
                " among the excellences of the true servants,",
                " one may ask why it should be",
                " presented as virtue before the disbelievers who",
                " did not regard shirk as a vice.",
                " It is because the Arabs had doubts",
                " about the doctrine of shirk even though",
                " they appeared to be deeply involved in",
                " it. This is amply supported by their",
                " history. For instance, when Abraha invaded Makkah,",
                " the Quraish did not invoke their idols",
                " to save the Ka`bah from him, but",
                " they begged Allah to save it. Their",
                " contemporary poetry bears sufficient evidence that they",
                " regarded the destruction of the \"people of",
                " the elephant\" due to Allah's power and",
                " supernatural interference and not due to any",
                " help of their idols. The Quraish and",
                " the polytheists of Arabia had also come",
                " to know that when Abraha reached Ta`if",
                " on his way to Makkah, the people",
                " of Ta`if had offered him their services",
                " to destroy the Ka`bah and had even",
                " provided him guides to take him safely",
                " to Makkah through the hills, for fear",
                " that he might also destroy the temple",
                " of \"Lat\", their chief deity. This event",
                " so much offended the Arabs that for",
                " years after this they continued , pelting",
                " the grave of the chief guide with",
                " stones for retaliation. Moreover, the Quraish and",
                " the other Arabs attributed their creed to",
                " Prophet Abraham and looked upon their religious",
                " and social customs and their Hajj rites",
                " as part of Abraham's religion. They knew",
                " that Prophet Abraham was a worshipper 'of",
                " Allah and not of idols. They also",
                " had traditions to show as to when",
                " they had started idol-worship, and which idol",
                " had been brought from where, when and",
                " by whom. The fact is that the",
                " common Arab did not have much of",
                " reverence for his idols. He would even",
                " speak insultingly of it and withheld his",
                " offerings when it failed to fulfil his",
                " wishes and prayers. For instance, there is",
                " the story of an Arab who wanted",
                " to avenge the murder of his father.",
                " He went to the temple of his",
                " idol, Zul-Khalasah, and wanted to take an",
                " omen. The response came that he should",
                " abandon his intention. At this the Arab",
                " became furious and cried out: 'O Zul-Khalasah!",
                " Had you been in my place, and",
                " your father was murdered, you would not",
                " have said that the murderers should not",
                " be punished.\" Another Arab took his herd",
                " of camels to the shrine of his",
                " god, named Sa'd, for seeking its blessings.",
                " It was a tall idol which had",
                " been smeared with sacrificial blood. On seeing",
                " it, the camels became terrified and started",
                " running in all directions. The Arab was",
                " so filled with rage that he started",
                " pelting the idol with stones, shouting, \"May",
                " God destroy you ! I had come",
                " to you to seek blessings for my",
                " camels, but you have deprived me of",
                " all of them.\" There were certain idols",
                " about whose origin filthy stories were current.",
                " For instance, the story about Asaf and",
                " Na'ilah whose images had been placed at",
                " Safa and Marwa, was that they were",
                " actually a man and a woman, who",
                " had committed adultery inside the Holy Ka`bah",
                " and had been turned into stone by",
                " God as a punishment. When the deities",
                " had such reputation, no worshipper could cherish",
                " any reverence for them in his heart.",
                " From this one can easily understand that",
                " the Arabs did recognize the value of",
                " true God-worship deep in their hearts, but,",
                " on the one hand, it had been",
                " suppressed by ancient customs and ways of",
                " ignorance, and on the other, the priestly",
                " class among the Quraish had vested interests,",
                " who were busy creating prejudices against it",
                " among the people. They could not give",
                " up idol-worship because such a step would",
                " have brought to an end their supremacy",
                " in Arabia. That is why, refraining from",
                " shirk and worship of One AIlah has",
                " been mentioned as a mark of superiority",
                " of the followers of the Holy Prophet",
                " without any fear of contradiction by the",
                " disbelievers, for even they in their heart",
                " of hearts knew that it was a",
                " weighty argument against them."
            ]
        },
        {
            "id": "[25:69]",
            "verse": "Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated -",
            "description": [
                "This can have two meanings: (1) His",
                " punishment will never come to an end,",
                " but it will continue being inflicted relentlessly",
                " over and over again; and (2) the",
                " person who in addition to the sins",
                " of disbelief, shirk and atheism, would have",
                " committed murders, adultery and other sins, will",
                " get separate punishment for rebellion and for",
                " each other sin. He will be accountable",
                " for each of his major and minor",
                " sins none of which will be pardoned.",
                " For instance, for each murder and for",
                " each act of adultery he will be",
                " given a separate punishment, and likewise, there",
                " will be a separate punishment for every",
                " sin committed by him."
            ]
        },
        {
            "id": "[25:70]",
            "verse": "Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful.",
            "description": [
                "This is a good news for those",
                " people who repented and reformed themselves, for",
                " they will have the benefit of the",
                " \"general amnesty\" contained in verse 70. This",
                " was regarded as a great blessing by",
                " the true servants because very few of",
                " those who embraced Islam had been free",
                " from those vices during their 'ignorance', and",
                " were terrified by the threat contained in",
                " vv. 63-69, but this amnesty not only",
                " redeemed them but filled them with hope.",
                "",
                "Many instances of such people, who sincerely",
                " repented and reformed their lives, have been",
                " related in the traditions. For instance, Ibn",
                " Jarir and Tabarani have related an incident",
                " from Hadrat Abu Hurairah, who savs, \"One",
                " day when 1 returned home after offering",
                " the 'lsha prayer in the Prophet's Mosque,",
                " I saw a woman standing at my",
                " door. I saluted her and walked into",
                " my room, closed the door and busied",
                " myself in voluntary worship. After a while",
                " she knocked at the door. I opened",
                " the door and asked what she wanted.",
                " She said that she had come with",
                " a problem: She had committed zina, had",
                " become pregnant, given birth to a child",
                " and then killed it. She wanted to",
                " know if there was any chance of",
                " her sin being forgiven. I replied in",
                " the negative. She went back grief-stricken, exclaiming,",
                " \"Ah! this beautiful body was created for",
                " the fire!\" The next morning, after the",
                " prayer, when I related the night's incident",
                " before the Holy Prophet, he said, \"You",
                " gave a very wrong answer, Abu Hurairah:",
                " Haven't you read the Qur'anic verse which",
                " says: '(Those) who do not invoke any",
                " other deity than Allah...except the une who",
                " may have repented (after those sins) and",
                " have believed and done righteous deeds' `?\"",
                " Hearing this from the Holy Prophet, I",
                " went out in search of the woman,",
                " and had her traced again at the",
                " `Isha time. I gave her the good",
                " news and told her what the Holy",
                " Prophet had said in reply to her",
                " question. She immediately tell prostrate on the",
                " ground and thanked Allah, Who had opened",
                " a way for her forgiveness. Then she",
                " offered repentance and set a slave-girl, along",
                " with her son, tree.\" A similar incident",
                " about an old man has been related",
                " in the traditions. He came before the",
                " Holy Prophet and said, \"O Messenger of",
                " AIIah, aII my life has passed in",
                " sin: there is no sin which I",
                " have not committed; so much so that",
                " if my sins were to be distributed",
                " over the people of the whole world,",
                " they would alI be doomed. Is there",
                " any way out for my forgiveness?\" The",
                " Holy Prophet asked him, \"Have you embraced",
                " Islam?\" He said, \"I bear witness that",
                " there is no god but Allah, and",
                " that Muhammad is the Messenger of Allah.\"",
                " The Holy Prophet said, \"Go back, Allah",
                " is All-Forgiving and has the power to",
                " change your evil deeds into good deeds.\"",
                " He asked,\"Is it about alI my crimes",
                " and errors?'' The Holy Prophet replied, \"Yes,",
                " it is about aII your crimes and",
                " errors.\" ( Ibn Kathir) ."
            ]
        },
        {
            "id": "[25:71]",
            "verse": "And he who repents and does righteousness does indeed turn to Allah with [accepted] repentance.",
            "description": [
                "It has two meanings: (1) When he",
                " has repented sincerely, he will start a",
                " new life of belief and obedience to",
                " Allah and by His grace and help",
                " will start doing good deeds instead of",
                " evil deeds that he used to do",
                " in his life of unbelief, and his",
                " evil deeds will be replaced by good",
                " deeds; and (2) Not only will his",
                " evil deeds done in the past be",
                " written off, but it will also be",
                " recorded in his conduct register that he",
                " was the servant who gave up rebellion",
                " against his Lord and adopted the way",
                " of His obedience. Then, as he will",
                " feel more and more sorry for his",
                " past sins and offer repentance, more and",
                " more good deeds will be credited to",
                " him; for repenting of one's wrong doing",
                " and seeking forgiveness is in itself a",
                " good deed. Thus, good deeds will supersede",
                " all his evil deeds in his conduct",
                " register, and he will not only escape",
                " punishment in the Hereafter but, in addition,",
                " he will also be blessed with high",
                " favours by Allah.",
                "*88) That is. ultimately",
                " everyone has to return to AIIah for",
                " AIIah alone is man's last and real",
                " refuge: He alone can reward one for",
                " his good deeds or punish une for",
                " his evil deeds: He alone is All-Merciful",
                " and AlI Compassionate, Who receives the penitent",
                " with forgiveness and Who dces not rebuke",
                " him for his past errors provided that",
                " he has repented sincerely, and adopted the",
                " right attitude and reformed himself."
            ]
        },
        {
            "id": "[25:72]",
            "verse": "And [they are] those who do not testify to falsehood, and when they pass near ill speech, they pass by with dignity.",
            "description": [
                "This also has two meanings: (1) They",
                " do not give evidence ( in a",
                " law court etc.) in regard to a",
                " false thing in order to prove it",
                " right, when in tact it is a",
                " falsehood, or at best a doubtful thing;",
                " and (2) they have no intention to",
                " witness any thing which is false, evil",
                " or wicked as spectators. In this sense,",
                " every sin and every indecency, every sham",
                " and counterfeit act is a falsehood. A",
                " true servant of AIlah recognizes it as",
                " false and shuns it even if it",
                " is presented in the seemingly beautiful forms",
                " of \"art\" .",
                "*90) The Arabic word",
                " laghv implies aII that is vain, useless",
                " and meaningless and it also covers \"falsehood\".",
                " The true servants pass by in a",
                " dignified manner if ever they come across",
                " \"what is vain\", as if it were",
                " a heap of tilth. They do not",
                " tarry there to enjoy the \"filth\" of",
                " moral impurity, obscenity or foul language, nor",
                " do they intentionally go anywhere to hear",
                " or see or take part in any",
                " sort of \"filth\". For further details, see",
                " E.N. 4of AI-Mu\"minun."
            ]
        },
        {
            "id": "[25:73]",
            "verse": "And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind.",
            "description": [
                "The true servants of Allah do not",
                " behave like the blind and the deaf",
                " towards the Revelations of Allah, when they",
                " are recited to them for their admonition.",
                " They do not turn a deaf ear",
                " to their teachings and Message and do",
                " not deliberately close their eyes to the",
                " Signs that they are asked to observe,",
                " but are deeply moved by them. They",
                " follow and practise what they are enjoined",
                " and retrain from what is forbidden."
            ]
        },
        {
            "id": "[25:74]",
            "verse": "And those who say, \"Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.\"",
            "description": [
                "The most distinctive characteristic of the true",
                " servants is their eagerness for prayer to",
                " Allah. In verse 65 their \"prayer\" for",
                " their own salvation and in verse 74",
                " their prayer for their wives and children",
                " have been cited: \"Our Lord, make our",
                " wives and children true believers so that",
                " they should practise righteousness and become a",
                " source of comfort for us.\" Their prayer",
                " shows that the true servants of Allah",
                " are more concerned about the salvation of",
                " their beloved ones in the Hereafter than",
                " the enjoyment of the world. It should",
                " be noted that this characteristic has been",
                " cited here to show that the true",
                " servants had sincerely believed in the Message.",
                " That is why they were so concerned",
                " about the \"Faith\" of their beloved ones.",
                " It should also be kept in mind",
                " that many of the near and dear",
                " ones of the Believers had not as",
                " yet embraced Islam. If a husband had",
                " embraced Islam, the wife was still an",
                " unbeliever, and if a youth had accepted",
                " Islam, his parents and brothers and sisters",
                " were still involved in disbelief, and vice",
                " versa. Therefore, the true servants wept and",
                " prayed for them, whenever the picture of",
                " their horrible state in Hell came before",
                " their mind's eyes.",
                "*93) That is,\"We should",
                " excel in piety, righteousness and good works;",
                " nay, we should become the leaders of",
                " the pious people so that we may",
                " lead them in the propagation of virtue",
                " and piety in the world. \" Incidentally,",
                " this characteristic of the true servants was",
                " in great contrast to that of the",
                " disbelievers, who strove in competition and rivalry",
                " with one another for superiority in worldly",
                " power and wealth. But it is a",
                " pity that some people in our time",
                " have misinterpreted this verse as containing sanction",
                " for seeking candidature for political leadership. According",
                " to them, the verse means: \"Our Lord,",
                " make us rulers over the pious people.\"",
                ""
            ]
        },
        {
            "id": "[25:75]",
            "verse": "Those will be awarded the Chamber for what they patiently endured, and they will be received therein with greetings and [words of] peace.",
            "description": [
                "The word sabr (fortitude) has been used",
                " here in its most comprehensive sense. The",
                " true servants courageously endured their persecution by",
                " the enemies of the Truth; they remained",
                " firm and steadfast in their struggle to",
                " establish Allah's way in the land; they",
                " carried out their duties enjoined by Allah",
                " sincerely and tearlessly without any concern for",
                " the worldly losses and deprivation; and they",
                " withstood all temptations held out by Satan",
                " and all the lusts of the flesh.",
                "",
                "*95) \"Ghurfah \" is a high mansion",
                " and the word is generally used for",
                " the \"upper chamber\" of a double-storeyed house.",
                " But the reality is that the highest",
                " buildings made by tnan in this world,",
                " even the Taj Mahal of India and",
                " the skyscrapers of New York, are an",
                " ugly imitation of the \"excellent abodes\" in",
                " Paradise. They are so magnificent, grand and",
                " beautiful that human imagination cannot form any",
                " picture of their grandeur."
            ]
        },
        {
            "id": "[25:76]",
            "verse": "Abiding eternally therein. Good is the settlement and residence.",
            "description": [
                ""
            ]
        },
        {
            "id": "[25:77]",
            "verse": "Say, \"What would my Lord care for you if not for your supplication?\" For you [disbelievers] have denied, so your denial is going to be adherent.",
            "description": [
                ""
            ]
        }
    ]
}