{
    "name": "Al Imran",
    "verse-count": 200,
    "verse-info": [
        {
            "id": "[3:1]",
            "verse": "Alif, Lam, Meem.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:2]",
            "verse": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence.",
            "description": [
                "For explanation see Surah 2, n. 278",
                " above."
            ]
        },
        {
            "id": "[3:3]",
            "verse": "He has sent down upon you, [O Muhammad], the Book in truth, confirming what was before it. And He revealed the Torah and the Gospel.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:4]",
            "verse": "Before, as guidance for the people. And He revealed the Qur'an. Indeed, those who disbelieve in the verses of Allah will have a severe punishment, and Allah is exalted in Might, the Owner of Retribution.",
            "description": [
                "The Torah is generally taken to signify",
                " the first five books of the Old",
                " Testament, and the Injil (Gospel), to mean",
                " the four Gospels of the New Testament,",
                " even though those books form a part",
                " of it. This has sometimes caused people",
                " to wonder if these books were indeed",
                " revealed by God. If they are accepted",
                " as revealed, one may wonder if the",
                " Qur'an really verifies their contents as this",
                " verse says. The fact is, however, that",
                " the Torah is not identical with the",
                " first five books of the Old Testament",
                " even though those books form a part",
                " of the Torah. Likewise, the Injil is",
                " not identical with the four Gospels of",
                " the New Testament. The fact is that",
                " the Torah, in the Qur'anic usage, signifies",
                " the revelations made to Moses (peace be",
                " on him), in about forty years, from",
                " the time he was appointed a Prophet",
                " until his death. These include the Ten",
                " Commandments', which were handed over to him",
                " inscribed on stone tablets. Moses took down",
                " the rest of the revealed injunctions and",
                " handed over one copy to each of",
                " the twelve tribes of Israel, and one",
                " copy to the Levites for safe keeping.",
                " It is this book which was known",
                " as the Torah and it existed until",
                " the first destruction of Jerusalem. The copy",
                " entrusted to the Levites was put beside",
                " the Ark of the Covenant along with",
                " the Commandment tablets, and the Israelites knew",
                " it as the Torah. The Jews, however,",
                " neglected the Book: during the reign of",
                " Josiah the King of Judah the Temple",
                " of Solomon was under repair and the",
                " high priest, Hilkiah, chanced to find the",
                " Book lying in the construction area. He",
                " gave it to the King's secretary, Shaphan,",
                " who in turn took it to the",
                " King as if it were a strange",
                " find (see 2 Kings 22: 8-13). Hence,",
                " when the Babylonian King, Nebuchadnezzar, conquered Jerusalem",
                " and razed it and the Temple of",
                " Solomon to the ground, the Israelites lost",
                " for ever the few original copies of",
                " the Torah which they possessed, and which",
                " they had consigned to obscurity. At the",
                " time of Ezra the priest, some Israelites",
                " returned from captivity in Babylon, and when",
                " Jerusalem was rebuilt the entire history of",
                " Israel, which now comprises the first seventeen",
                " books of the Old Testament, was recorded",
                " by Ezra with the assistance of some",
                " other elders of the community. Four of",
                " these books, Exodus, Leviticus, Numbers and Deuteronomy,",
                " consist of a biographical narrative of Moses.",
                " In this biography those verses of the",
                " Torah available to Ezra and the other",
                " elders are also recorded and in the",
                " contexts in which they were revealed. The",
                " present Torah, therefore, comprises those fragments of",
                " the original book which are interspersed throughout",
                " the biography of Moses (composed in the",
                " manner described above). In locating these fragments",
                " of the original Torah there are certain",
                " expressions which help us. These are interspersed",
                " between the different pieces of biographical narration",
                " and usually open with words such as:",
                " 'Then the Lord said to Moses', and",
                " 'Moses said, the Lord your God commands",
                " you.' These expressions, then, are fragments of",
                " the original Torah. When the biographical narration",
                " re-commences, however, we can be sure that",
                " the fragment of the true Torah has",
                " concluded. Wherever authors and editors of the",
                " Bible have added anything of their own",
                " accord, by way of either elaboration or",
                " elucidation, it has become very difficult for",
                " an ordinary reader to distinguish the original",
                " from the explanatory additions. Those with insight",
                " into Divine Scripture, however, do have the",
                " capacity to distinguish between the original revealed",
                " fragments and the later, human interpolations. It",
                " is these scattered fragments of the original",
                " revealed Book which the Qur'an terms as",
                " the Torah, and it is these which",
                " it confirms. When these fragments are compared",
                " with the Qur'an, there is no difference",
                " between the two as regards the fundamental",
                " teachings. Whatever differences exist relate to legal",
                " matters and are of secondary importance. Even",
                " today a careful reader can appreciate that",
                " the Torah and the Qur'an have sprung",
                " from one and the same Divine source.",
                " Likewise, Injil signifies the inspired orations and",
                " utterances of Jesus (peace be on him),",
                " which he delivered during the last two",
                " or three years of his life in",
                " his capacity as a Prophet. There are",
                " no certain means by which we can",
                " definitively establish whether or not his statements",
                " were recorded during his lifetime. It is",
                " possible that some people took notes of",
                " them and that some followers committed them",
                " to memory. After a period of time,",
                " however, several treatises on the life of",
                " Jesus were written. The authors of these",
                " treatises recorded, in connection with the biographical",
                " account, those sayings of his which they",
                " had received from the previous generation of",
                " co-religionists, in the form of either oral",
                " traditions or written notes about events in",
                " his life. As a result the Gospels",
                " of Matthew, Mark, Luke and John are",
                " not identical with the Injil. Rather, the",
                " Injil consists of those statements by Jesus",
                " which form part of these Gospels. Unfortunately",
                " we have no means of distinguishing the",
                " fragments of the original Injil from the",
                " pieces written by the authors themselves. All",
                " we can say is that only those",
                " sections explicitly attributed to Jesus, for example",
                " in statements such as: 'And Jesus said'",
                " and 'And Jesus taught', constitute the true",
                " Injil. It is the totality of such",
                " fragments which is designated as the Injil",
                " by the Qur'an, and it is the",
                " teachings contained in these fragments that the",
                " Qur'an confirms. If these fragments are put",
                " together and compared with the teachings of",
                " the Qur'an one notices very few discrepancies",
                " between the two, and any discrepancies that",
                " are found can be resolved easily by",
                " unbiased reflection."
            ]
        },
        {
            "id": "[3:5]",
            "verse": "Indeed, from Allah nothing is hidden in the earth nor in the heaven.",
            "description": [
                "That is, God knows all the facts",
                " of the universe. Hence the Book which",
                " He has revealed is, of necessity, true.",
                " It may be more appropriate to say",
                " that the unadulterated Truth can be made",
                " available to man only through this Book,",
                " which has been revealed by the All-Knowing,",
                " All-Wise God."
            ]
        },
        {
            "id": "[3:6]",
            "verse": "It is He who forms you in the wombs however He wills. There is no deity except Him, the Exalted in Might, the Wise.",
            "description": [
                "This refers to two important facts. The",
                " first is that no being knows human",
                " nature as well as God does; it",
                " is thus imperative that man should depend",
                " on the guidance revealed by God, something",
                " man needs the most. The second is",
                " that the Being Who takes care of",
                " all of man's requirements, major and minor,",
                " from the time of conception onwards, will",
                " not fail to provide guidance for man's",
                " conduct in this life."
            ]
        },
        {
            "id": "[3:7]",
            "verse": "It is He who has sent down to you, [O Muhammad], the Book; in it are verses [that are] precise - they are the foundation of the Book - and others unspecific. As for those in whose hearts is deviation [from truth], they will follow that of it which is unspecific, seeking discord and seeking an interpretation [suitable to them]. And no one knows its [true] interpretation except Allah. But those firm in knowledge say, \"We believe in it. All [of it] is from our Lord.\" And no one will be reminded except those of understanding.",
            "description": [
                "Muhkam means that which has been made",
                " firmly and perfectly. The muhkam verses mentioned",
                " here are those Qur'anic verses which are",
                " embodied in clear and lucid language and",
                " whose meaning is not liable to any",
                " ambiguity and equivocation. The words of these",
                " verses are clear pointers to their true",
                " meaning and, therefore, it is difficult to",
                " subject them to arbitrary interpretation. Such verses",
                " form the core of the Holy Book;",
                " they are the verses which fulfil the",
                " true purpose for which the Qur'an was",
                " revealed, and they invite the whole world",
                " to Islam. They embody admonition and instruction",
                " as well as the refutation of erroneous",
                " doctrines and the elucidation of the Right",
                " Way. They also contain the fundamentals of",
                " the true faith; teachings relating to belief,",
                " worship and morality, and mandatory duties and",
                " prohibitions. These are the verses which will",
                " guide the genuine seeker after Truth who",
                " turns to the Qur'an in order to",
                " find out what he ought and ought",
                " not to do.",
                "*6). 'Ambiguous' verses are",
                " those whose meaning may have some degree",
                " of equivocation. It is obvious that no",
                " way of life can be prescribed for",
                " man unless a certain amount of knowledge",
                " explaining the truth about the universe, about",
                " its origin and end, about man's position",
                " in it and other matters of similar",
                " importance, is intimated to him. It is",
                " also evident that the truths which lie",
                " beyond the range of human perception have",
                " always eluded and will continue to elude",
                " man; no words exist in the human",
                " vocabulary which either express or portray them.",
                " In speaking about such things, we necessarily",
                " resort to words and expressions generally employed",
                " in connection with tangible objects. In the",
                " Qur'an, too, this kind of language is",
                " employed in relation to supernatural matters; the",
                " verses which have been characterized as 'ambiguous'",
                " refer to such matters. At best, such",
                " expressions may serve to either bring man",
                " close to or enable him to formulate",
                " some view of reality, even if it",
                " is a faint one. The more one",
                " tries to determine the precise meaning of",
                " such verses, the more their ambiguities proliferate,",
                " and the more one is confronted with",
                " choosing between several plausible interpretations. All this",
                " is likely to alienate one progressively further",
                " away' from the Truth instead of bringing",
                " one closer to it. Those who seek",
                " the Truth and do not hanker after",
                " the satisfaction of their egocentric quest for",
                " exotic superfluities, will be satisfied with the",
                " dim vision of reality derived from these",
                " verses. They will concentrate their attention instead",
                " on the clear and lucid 'core' verses",
                " of the Qur'an. It will be left",
                " to those who are either out to",
                " make mischief and mislead people or who",
                " have an abnormal passion for superfluities to",
                " devote their attention to hair-splitting discussions about",
                " the contents of the 'ambiguous\" verses.",
                "*7).",
                " This might give rise to an unnecessary",
                " problem: How can people believe in 'ambiguous'",
                " verses when the contents of these cannot",
                " be grasped? The fact is that a",
                " reasonable person will believe that the Qur'an",
                " is the Book of God through his",
                " reading of its clear and lucid verses,",
                " rather than by learning fanciful interpretations of",
                " the ambiguous verses. Once so convinced, he",
                " is not likely to be worried by",
                " doubts and anxieties caused by the ambiguities",
                " of the verses concerned. One who seeks",
                " the Truth is satisfied with the obvious",
                " meaning of these verses, and wherever he",
                " encounters complications and ambiguities he abstains from",
                " pursuing their solution too far. Instead of",
                " wasting his time splitting hairs, he is",
                " content to believe in the things laid",
                " down in the Book of God, without",
                " seeking to know them precisely and in",
                " detail. He turns his attention, in the",
                " main, to questions of a practical nature.",
                ""
            ]
        },
        {
            "id": "[3:8]",
            "verse": "[Who say], \"Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:9]",
            "verse": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:10]",
            "verse": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all. And it is they who are fuel for the Fire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:11]",
            "verse": "[Theirs is] like the custom of the people of Pharaoh and those before them. They denied Our signs, so Allah seized them for their sins. And Allah is severe in penalty.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:12]",
            "verse": "Say to those who disbelieve, \"You will be overcome and gathered together to Hell, and wretched is the resting place.\"",
            "description": [
                "For explanation see Surah 2, n. 161",
                " above."
            ]
        },
        {
            "id": "[3:13]",
            "verse": "Already there has been for you a sign in the two armies which met - one fighting in the cause of Allah and another of disbelievers. They saw them [to be] twice their [own] number by [their] eyesight. But Allah supports with His victory whom He wills. Indeed in that is a lesson for those of vision.",
            "description": [
                "The actual disparity between the two armies",
                " was roughly three to one, but even",
                " a cursory glance was enough to tell",
                " the casual observer that the army of",
                " unbelievers was about twice as large as",
                " that of the believers."
            ]
        },
        {
            "id": "[3:14]",
            "verse": "Beautified for people is the love of that which they desire - of women and sons, heaped-up sums of gold and silver, fine branded horses, and cattle and tilled land. That is the enjoyment of worldly life, but Allah has with Him the best return.",
            "description": [
                "*10). The events and results of the",
                " Battle of Badr are briefly reviewed so",
                " as to bring home certain lessons to",
                " the Muslims. There are three important lessons",
                " to be learnt. First, the manner in",
                " which the believers and the unbelievers advanced",
                " to the battlefield clearly demonstrated the difference",
                " in the moral fibre of the two",
                " armies. In the army of the unbelievers,",
                " the soldiers held drinking parties and were",
                " entertained by the songs and dances of",
                " slave girls. The prevalent mood of that",
                " army was one of self-indulgence. On the",
                " other hand, piety, fear of God and",
                " moral restraint of the highest order characterized",
                " the Muslim army. The soldiers were busy",
                " in devotion and remembrance of God, to",
                " Whom they addressed all their prayers and",
                " supplication. It was obvious to anyone which",
                " army was fighting in God's cause. Second,",
                " the believers won a resounding victory against",
                " an army of unbelievers superior to them",
                " in numbers, and in the quality and",
                " the quantity of arms. So the victory",
                " clearly indicated which of the two armies",
                " enjoyed the support of God. Third, the",
                " outcome of the battle came as a",
                " shocking humiliation for those who, heedless of",
                " God's might, had been exulting in the",
                " strength of their arms and the number",
                " of their supporters. It came as a",
                " shock to such people when God subjected",
                " a tribe like the Quraysh, foremost in",
                " influence and power throughout Arabia, to an",
                " ignominious defeat at the hands of a",
                " few ill-equipped Makkan fugitives and peasants from",
                " Madina."
            ]
        },
        {
            "id": "[3:15]",
            "verse": "Say, \"Shall I inform you of [something] better than that? For those who fear Allah will be gardens in the presence of their Lord beneath which rivers flow, wherein they abide eternally, and purified spouses and approval from Allah. And Allah is Seeing of [His] servants -",
            "description": [
                "For explanation see Surah 2, n. 27",
                " above.",
                "*12). This shows that God neither",
                " showers His favours on people arbitrarily nor",
                " makes casual and superficial judgements. He knows",
                " full well the deeds and intentions of",
                " people. He also knows who merits His",
                " rewards and who does not."
            ]
        },
        {
            "id": "[3:16]",
            "verse": "Those who say, \"Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:17]",
            "verse": "The patient, the true, the obedient, those who spend [in the way of Allah], and those who seek forgiveness before dawn.",
            "description": [
                "That is, they are those who remain",
                " steadfast in the cause of Truth; who",
                " do not lose heart when they either",
                " suffer losses or are subjected to afflictions;",
                " who do not despair when they encounter",
                " reverses; who are not seduced by temptations.",
                " They are the ones who remain faithful",
                " to the Truth, even when it apparently",
                " stands no chance of prevailing (see also",
                " Surah 2, n. 60 above)."
            ]
        },
        {
            "id": "[3:18]",
            "verse": "Allah witnesses that there is no deity except Him, and [so do] the angels and those of knowledge - [that He is] maintaining [creation] in justice. There is no deity except Him, the Exalted in Might, the Wise.",
            "description": [
                "The testimony in question is from God",
                " Himself, Who knows directly all the realities",
                " of the universe, Who observes every existing",
                " thing without obstruction. It is the testimony",
                " of the One from Whose sight nothing",
                " is hidden, and who can be a",
                " better first-hand witness than He? His testimony",
                " is that no one but He is",
                " possessed of the attributes of godhead; no",
                " one has the power to govern the",
                " universe, and no one has the right",
                " to claim the rights which belong exclusively",
                " to God.",
                "*15). After God, the most",
                " trustworthy testimony is that of the angels,",
                " for they carry out the administration of",
                " the universe. The testimony of the angels,",
                " based on their own observations, is that",
                " the Will of God alone reigns supreme",
                " in the universe, and they turn to",
                " Him alone in the governance of the",
                " heavens and the earth. Moreover, all creatures",
                " possessing knowledge of reality have testified, unanimously,",
                " that no one except the One True",
                " God reigns and rules over the universe.",
                ""
            ]
        },
        {
            "id": "[3:19]",
            "verse": "Indeed, the religion in the sight of Allah is Islam. And those who were given the Scripture did not differ except after knowledge had come to them - out of jealous animosity between themselves. And whoever disbelieves in the verses of Allah, then indeed, Allah is swift in [taking] account.",
            "description": [
                "In the sight of God there is",
                " only one system of life and way",
                " of conduct which is both in accord",
                " with reality and morally right. This consists",
                " of man's acknowledging God as his Lord",
                " and the sole object of his worship",
                " and devotion; of surrendering himself unreservedly to",
                " God in obedience and service. In doing",
                " so he should follow in toto the",
                " guidance communicated by God through His Messengers",
                " rather than try to devise ways of",
                " serving God according to his own lights.",
                " This mode of thought and action is",
                " known as Islam, and it is only",
                " reasonable that the Lord and Creator of",
                " the universe should accept nothing less from",
                " His creatures and servants. In his folly",
                " man thinks that he has the right",
                " to believe in and follow every doctrine",
                " that comes his way whether it be",
                " atheism or idolatry. In the sight of",
                " the Sovereign of the universe, however, all",
                " such attitudes amount to nothing short of",
                " rebellion against God.",
                "*17). This shows that",
                " the religion of every Messenger of God,",
                " in every age and clime, was none",
                " other than Islam (submission to God). Likewise,",
                " every Divine book, in whichever language it",
                " was revealed, and to whichever people it",
                " was addressed, contained the teachings of Islam.",
                " The various religions which have spread among",
                " mankind are distortions of this true, original",
                " religion, and are the result of tampering.",
                " Coveting privileges over and above those to",
                " which they were entitled, people altered the",
                " beliefs, principles and injunctions of the true",
                " religion in a manner conducive to their",
                " own interests."
            ]
        },
        {
            "id": "[3:20]",
            "verse": "So if they argue with you, say, \"I have submitted myself to Allah [in Islam], and [so have] those who follow me.\" And say to those who were given the Scripture and [to] the unlearned, \"Have you submitted yourselves?\" And if they submit [in Islam], they are rightly guided; but if they turn away - then upon you is only the [duty of] notification. And Allah is Seeing of [His] servants.",
            "description": [
                "The Prophet (peace be on him) is",
                " asked to tell them in effect: I",
                " and my followers have embraced the original,",
                " unadulterated Islam which is the true religion",
                " enjoined by God. Tell us, now, if",
                " you are prepared to give up the",
                " accretions introduced by your forefathers, and embrace",
                " this original, true religion?'"
            ]
        },
        {
            "id": "[3:21]",
            "verse": "Those who disbelieve in the signs of Allah and kill the prophets without right and kill those who order justice from among the people - give them tidings of a painful punishment.",
            "description": [
                "This is a sarcastic remark. Its purpose",
                " is to bring home to them that",
                " the misdeeds about which they are so",
                " jubilant, and which they regard as their",
                " proud achievements, will ultimately lead them to",
                " a painful end."
            ]
        },
        {
            "id": "[3:22]",
            "verse": "They are the ones whose deeds have become worthless in this world and the Hereafter, and for them there will be no helpers.",
            "description": [
                "They have spent their efforts and energies",
                " in a manner leading to catastrophic results",
                " in this world and the Next.",
                "*21).",
                " No power can make these misdeeds either",
                " bear good fruit or prevent them bearing",
                " evil fruit. The powers upon which the",
                " wrong-doers rely for support in this world",
                " and in the World to Come will",
                " not be of any help to them.",
                ""
            ]
        },
        {
            "id": "[3:23]",
            "verse": "Do you not consider, [O Muhammad], those who were given a portion of the Scripture? They are invited to the Scripture of Allah that it should arbitrate between them; then a party of them turns away, and they are refusing.",
            "description": [
                "They are asked to acknowledge the Book",
                " of God as the final arbiter in",
                " all matters, and to submit to its",
                " judgement, accepting as right whatever this Book",
                " holds to be right, and as wrong",
                " whatever it holds to be wrong. The",
                " Book of God referred to here is",
                " the Torah and the Injil, while the",
                " expression 'those who have been given a",
                " portion of the Book' refers to the",
                " Jewish and Christian religious scholars. (For the",
                " Quranic view of the Torah and the",
                " Injil see n. 2 above - Ed.)",
                ""
            ]
        },
        {
            "id": "[3:24]",
            "verse": "That is because they say, \"Never will the Fire touch us except for [a few] numbered days,\" and [because] they were deluded in their religion by what they were inventing.",
            "description": [
                "These people considered themselves to be God's",
                " favourites and cherished the illusion that, regardless",
                " of what they did, they were bound",
                " to enter Paradise. They took the view",
                " that since they were believers, were descended",
                " from pious people, followed noble Prophets, and",
                " were disciples and admirers of holy men,",
                " Hell would not dare touch them. They",
                " also thought that even if they were",
                " thrown into Hell they would remain there",
                " for a few days only, to be",
                " purged of the impurity of the sins",
                " which had afflicted them, and would then",
                " be sent straight to Paradise. Such notions",
                " had made them so bold that even",
                " when they committed the most atrocious crimes",
                " and the most mortal of sins, and",
                " brazenly deviated from Truth and rectitude, their",
                " hearts remained utterly unmoved by the fear",
                " of God."
            ]
        },
        {
            "id": "[3:25]",
            "verse": "So how will it be when We assemble them for a Day about which there is no doubt? And each soul will be compensated [in full for] what it earned, and they will not be wronged.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:26]",
            "verse": "Say, \"O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:27]",
            "verse": "You cause the night to enter the day, and You cause the day to enter the night; and You bring the living out of the dead, and You bring the dead out of the living. And You give provision to whom You will without account.\"",
            "description": [
                "Those who disbelieved and disobeyed were seen",
                " to be prosperous, whereas the believers, with",
                " their devotion and loyalty to God, suffered",
                " all the deprivation, persecution and torment to",
                " which the Prophet and his followers were",
                " subjected around the year 3 A.H. The",
                " contrasting states of the two groups of",
                " men were the reverse of what would",
                " naturally be expected. This raised disturbing questions",
                " in people's minds about the underlying wisdom",
                " of this phenomenon. The verse conveys God's",
                " answer."
            ]
        },
        {
            "id": "[3:28]",
            "verse": "Let not believers take disbelievers as allies rather than believers. And whoever [of you] does that has nothing with Allah, except when taking precaution against them in prudence. And Allah warns you of Himself, and to Allah is the [final] destination.",
            "description": [
                "This means that it is lawful for",
                " a believer, helpless in the grip of",
                " the enemies of Islam and in imminent",
                " danger of severe wrong and persecution, to",
                " keep his faith concealed and to behave",
                " in such a manner as to create",
                " the impression that he is on the",
                " same side as his enemies. A person",
                " whose Muslim identity is discovered is permitted",
                " to adopt a friendly attitude owards the",
                " unbelievers in order to save his life.",
                " If he considers himself incapable of enduring",
                " the excesses to which he may be",
                " subjected, he may even state that he",
                " is not a believer.",
                "*26). One should",
                " not be overwhelmed by the fear of",
                " other human beings to the extent of",
                " losing the fear of God. Human beings",
                " can harm a man but the most",
                " they can do is to ruin his",
                " transient, earthly life. God, on the other",
                " hand, can subject him to everlasting torment.",
                " If one is constrained in extraordinary circumstances",
                " to resort to a prudent concealment of",
                " faith (taqiyah) in order to save one's",
                " life, this concealment should remain within reasonable",
                " limits. The most one is permitted to",
                " do is to protect one's life and",
                " property without jeopardizing either the interests of",
                " Islam or of the Muslim community as",
                " a whole, and without causing loss of",
                " life and property to other Muslims. One",
                " must never allow saving one's own life",
                " to lead to the propagation of unbelief",
                " at the expense of Islam and to",
                " the dominance of unbelievers over Muslims. Here",
                " the believers are warned that, no matter",
                " how dangerous the circumstances surrounding them, they",
                " cannot escape God's reproach if they give",
                " substantial aid to those rebelling against Him,",
                " and cause any harm to God's chosen",
                " religion, to the community of believers or",
                " to any individual believer. For, it is",
                " to God that one will ultimately return",
                " for reckoning."
            ]
        },
        {
            "id": "[3:29]",
            "verse": "Say, \"Whether you conceal what is in your breasts or reveal it, Allah knows it. And He knows that which is in the heavens and that which is on the earth. And Allah is over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:30]",
            "verse": "The Day every soul will find what it has done of good present [before it] and what it has done of evil, it will wish that between itself and that [evil] was a great distance. And Allah warns you of Himself, and Allah is Kind to [His] servants.\"",
            "description": [
                "It is out of sheer goodwill that",
                " God warns people against deeds likelyto have",
                " devastating consequences for them."
            ]
        },
        {
            "id": "[3:31]",
            "verse": "Say, [O Muhammad], \"If you should love Allah, then follow me, [so] Allah will love you and forgive you your sins. And Allah is Forgiving and Merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:32]",
            "verse": "Say, \"Obey Allah and the Messenger.\" But if they turn away - then indeed, Allah does not like the disbelievers.",
            "description": [
                "This marks the conclusion of the first",
                " discourse. Reflection upon its contents, particularly the",
                " reference to the Battle of Badr, leads",
                " one to the conclusion that this section",
                " was probably revealed between the battles of",
                " Badr and Uhud, i.e. sometime in 3.A.H.",
                " The tradition mentioned by Muhammad b. Ishaq",
                " has led to the common misunderstanding that",
                " the first eighty verses of this surah",
                " were revealed on the occasion of the",
                " arrival of the deputation from Najran in",
                " 9 A.H. (See Ibn Hisham. Sirah, vol.",
                " 1, pp. 573 ff., especially p. 576;",
                " Ibn Ishaq, Life of Muhammad, tr. A.",
                " Guillaume, second impression, London, Oxford, 1968. pp.",
                " 270 ff.. especially p. 272 - Ed.)",
                " This is not true. In the first",
                " place, the introductory section indicates that the",
                " surah was revealed much earlier. Second, the",
                " Tradition narrated by Muqatil b. Sulayman states",
                " explicitly that on the occasion of the",
                " arrival of the deputation from Najran only",
                " those verses which concern the Prophets John",
                " (Yahya) and Jesus ('Isa) (peace be on",
                " them) were revealed, and the number of",
                " those verses is about thirty."
            ]
        },
        {
            "id": "[3:33]",
            "verse": "Indeed, Allah chose Adam and Noah and the family of Abraham and the family of 'Imran over the worlds -",
            "description": [
                "This marks the beginning of the second",
                " discourse. The period of its revelation is",
                " about 9 A.H., when a delegation from",
                " the Christian republic of Najran visited the",
                " Prophet. Najran lies between the Hijaz and",
                " Yaman, and comprised, at that time, seventy-three",
                " towns and villages. Its population can be",
                " gauged from the fact that an estimated",
                " one hundred and twenty thousand men could",
                " bear arms. The entire population was Christian",
                " and was under the hegemony of three",
                " Christian chiefs. The first of these, 'aqib,",
                " was the head of the community. The",
                " second, sayyid, looked after the collective and",
                " political affairs of the people. The third,",
                " usquf (bishop), was their religious leader. (See",
                " Ibn Hisham, vol. 1, p. 573; Ibn",
                " Ishaq, Life of Muhammad, tr. A. Guillaume,",
                " pp. 270 f. - Ed.) When the",
                " Prophet annexed Makka, the whole of Arabia",
                " became convinced that the future of the",
                " area was bound up with him, and",
                " deputations from all parts of the peninsula",
                " began to visit him. In this connection",
                " the three chiefs of Najran came to",
                " Madina accompanied by sixty people. As they",
                " were not prepared to go to war,",
                " the alternatives before them were either to",
                " embrace Islam or to live as dhimmis",
                " (protected non-Muslim subjects of the Islamic state).",
                " It was on this occasion that God",
                " revealed this discourse; it served as an",
                " invitation to the people of Najran to",
                " accept Islam.",
                "*30). 'Imran was the father",
                " of Moses and Aaron, and has been",
                " mentioned in the Bible as Amram."
            ]
        },
        {
            "id": "[3:34]",
            "verse": "Descendants, some of them from others. And Allah is Hearing and Knowing.",
            "description": [
                "The real error of the Christians lies",
                " in considering Jesus to be the son",
                " of God and a partner in His",
                " godhead, rather than His servant and Messenger.",
                " If this misunderstanding was removed it would",
                " become quite easy for them to advance",
                " towards Islam. Hence at the very outset",
                " of the discourse it is mentioned that",
                " Adam, Noah and the Prophets in the",
                " house of Abraham and 'Imran were all",
                " human beings. Even though many Prophets were",
                " born in the same family, one from",
                " the other, none of them was God.",
                " Their merit lay in the fact that",
                " God had chosen them to preach His",
                " religion and reform the world."
            ]
        },
        {
            "id": "[3:35]",
            "verse": "[Mention, O Muhammad], when the wife of 'Imran said, \"My Lord, indeed I have pledged to You what is in my womb, consecrated [for Your service], so accept this from me. Indeed, You are the Hearing, the Knowing.\"",
            "description": [
                "If the 'woman of 'Imran' is interpreted",
                " as the wife of 'Imran, this 'Imran",
                " must be different from the 'Imran just",
                " mentioned (see the preceding verse). In the",
                " Christian tradition the name of the father",
                " of Mary is mentioned as Joachim. If",
                " this expression, however, is interpreted to mean",
                " 'a woman of the house of 'Imran',",
                " it would mean that the mother of",
                " Mary belonged to that tribe. There is,",
                " unfortunately, no definite source of information that",
                " would lead us to prefer one interpretation",
                " to the other, as there is no",
                " historical record either about who the parents",
                " of Mary were, or to which tribes",
                " they belonged. Were we to accept the",
                " tradition that the mother of John (Yahya)",
                " and the mother of Jesus were cousins,",
                " then it would be valid to interpret",
                " the expression as meaning 'a woman of",
                " the tribe of 'Imran' for, according to",
                " the Gospel of Luke, the mother of",
                " John was one of the daughters of",
                " Aaron (Luke 1:5).",
                "*33). That is, God",
                " heeds the prayers of His creatures and",
                " is well aware of their intentions."
            ]
        },
        {
            "id": "[3:36]",
            "verse": "But when she delivered her, she said, \"My Lord, I have delivered a female.\" And Allah was most knowing of what she delivered, \"And the male is not like the female. And I have named her Mary, and I seek refuge for her in You and [for] her descendants from Satan, the expelled [from the mercy of Allah].\"",
            "description": [
                "Since a boy is free from some",
                " of the physical shortcomings and social disabilities",
                " associated with a girl, the mother of",
                " Mary thought that had the child been",
                " a boy he would have been more",
                " able to achieve the purpose for which",
                " she had consecrated the child."
            ]
        },
        {
            "id": "[3:37]",
            "verse": "So her Lord accepted her with good acceptance and caused her to grow in a good manner and put her in the care of Zechariah. Every time Zechariah entered upon her in the prayer chamber, he found with her provision. He said, \"O Mary, from where is this [coming] to you?\" She said, \"It is from Allah. Indeed, Allah provides for whom He wills without account.\"",
            "description": [
                "This section refers to that period of",
                " Mary's life when she attained her majority",
                " and was admitted to the Temple of",
                " Jerusalem, and devoted all her time to",
                " remembering God. Zechariah, into whose care she",
                " was given, was perhaps the husband of",
                " her maternal aunt, and was one of",
                " the guardians of the Temple. This Zechariah",
                " is not to be confused with the",
                " Prophet Zechariah whose assassination is mentioned in",
                " the Old Testament.",
                "*36). The word mihrab",
                " usually refers to that niche in mosques",
                " where the leader of the prayer stands.",
                " In this instance, however, the term signifies",
                " the apartments usually built in synagogues and",
                " sanctuaries on a raised platform adjacent to",
                " the place of congregational worship, which served",
                " as the residence of caretakers, servants and",
                " beggars. Mary lived in an apartment of",
                " this kind and devoted all her time",
                " to worship and prayer."
            ]
        },
        {
            "id": "[3:38]",
            "verse": "At that, Zechariah called upon his Lord, saying, \"My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.\"",
            "description": [
                "Until then Zechariah had no issue. The",
                " sight of this pious young girl made",
                " him yearn for a child just as",
                " virtuous and devout. When he saw that",
                " God sent food to her, by dint",
                " of His limitless power, he felt hopeful",
                " that God might also bless him with",
                " issue, despite his old age."
            ]
        },
        {
            "id": "[3:39]",
            "verse": "So the angels called him while he was standing in prayer in the chamber, \"Indeed, Allah gives you good tidings of John, confirming a word from Allah and [who will be] honorable, abstaining [from women], and a prophet from among the righteous.\"",
            "description": [
                "In the Bible his name is mentioned",
                " as John the Baptist. For information about",
                " him see Matthew 3, 9 and 14:",
                " Mark 1 and 6; Luke 1 and",
                " 3.",
                "*39). The 'command from Allah' signifies",
                " Jesus (peace be on him). His birth",
                " took place as the result of an",
                " extraordinary command from God and in an",
                " unusual manner, hence he is designated as",
                " 'the command' or 'word' from Allah."
            ]
        },
        {
            "id": "[3:40]",
            "verse": "He said, \"My Lord, how will I have a boy when I have reached old age and my wife is barren?\" The angel said, \"Such is Allah; He does what He wills.\"",
            "description": [
                "God granted Zechariah a son despite his",
                " old age and despite the barrenness of",
                " his wife."
            ]
        },
        {
            "id": "[3:41]",
            "verse": "He said, \"My Lord, make for me a sign.\" He Said, \"Your sign is that you will not [be able to] speak to the people for three days except by gesture. And remember your Lord much and exalt [Him with praise] in the evening and the morning.\"",
            "description": [
                "Here the request is made for some",
                " specific sign to be given by means",
                " of which Zechariah would come to know",
                " in advance when the unusual incident of",
                " the birth of a child to a",
                " couple, where the male was old and",
                " the female both old and barren, would",
                " take place.",
                "*42). The real purpose of",
                " this discourse is to disclose to the",
                " Christians the error of their belief in",
                " Jesus as God and as the son",
                " of God. The subject is introduced by",
                " mentioning the birth of John (peace be",
                " on him), anothermiraculous birth which had taken",
                " place only six months before the birth",
                " of the Messiah (peace be on him)",
                " and among his own relatives. God wants",
                " to make the Christians ask themselves why",
                " the miraculous birth of Jesus should make",
                " him God when the similarly miraculous birth",
                " of John did not make him so.",
                ""
            ]
        },
        {
            "id": "[3:42]",
            "verse": "And [mention] when the angels said, \"O Mary, indeed Allah has chosen you and purified you and chosen you above the women of the worlds.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:43]",
            "verse": "O Mary, be devoutly obedient to your Lord and prostrate and bow with those who bow [in prayer].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:44]",
            "verse": "That is from the news of the unseen which We reveal to you, [O Muhammad]. And you were not with them when they cast their pens as to which of them should be responsible for Mary. Nor were you with them when they disputed.",
            "description": [
                "They drew lots to decide who should",
                " be the guardian of Mary, whose mother",
                " had consecrated her to the service of",
                " God in the Temple. Since she was",
                " a girl, it was a delicate matter",
                " as to who from among the priests",
                " of the Temple would be the appropriate",
                " person to take care of her."
            ]
        },
        {
            "id": "[3:45]",
            "verse": "[And mention] when the angels said, \"O Mary, indeed Allah gives you good tidings of a word from Him, whose name will be the Messiah, Jesus, the son of Mary - distinguished in this world and the Hereafter and among those brought near [to Allah].",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:46]",
            "verse": "He will speak to the people in the cradle and in maturity and will be of the righteous.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:47]",
            "verse": "She said, \"My Lord, how will I have a child when no man has touched me?\" [The angel] said, \"Such is Allah; He creates what He wills. When He decrees a matter, He only says to it, 'Be,' and it is.",
            "description": [
                "Thus it was affirmed that a child",
                " would be born to Mary despite the",
                " fact that no man had touched her.",
                " The angel's answer mentioned here, 'Thus shall",
                " it be', was exactly the same as",
                " the response given to Zechariah. Both the",
                " following sentences and the preceding section support",
                " the view that the angel had conveyed",
                " to Mary the glad tidings that a",
                " son would be born to her without",
                " normal sexual contact, and it was thus",
                " that Jesus was born. For, if Mary's",
                " child was to be born to her",
                " in the usual manner in which children",
                " are born to women, and if the",
                " birth of Jesus did take place in",
                " the normal way, the entire narrative from",
                " verse 35 of this surah to verse",
                " 63 would have to be declared absurd.",
                " Indeed, one would be forced to treat",
                " as meaningless all those statements about the",
                " birth of Jesus which are found scattered",
                " elsewhere in the Qur'an. The Christians had",
                " begun to regard Jesus as God and",
                " the son of God because of this",
                " fatherless birth. The Jews, in turn, cast",
                " aspersions on Mary's chastity on the grounds",
                " that she had given birth to a",
                " child despite being unmarried. If the fatherless",
                " birth of Jesus was itself false, it",
                " would have been sufficient to tell the",
                " Christians that they were indulging in sheer",
                " mis-statement, that Mary had indeed been married,",
                " that she had a legitimate husband, and",
                " that it was as a result of",
                " that wedlock that Jesus was born. If",
                " this fact could have been stated plainly,",
                " there would have been no need for",
                " long preparatory statements and complicated propositions, and",
                " no need to call Jesus the son",
                " of Mary instead of naming his father.",
                " For far from resolving the issue such",
                " statements add to the confusion. Those who",
                " believe the Qur'an to be the word",
                " or command from God and yet try",
                " to prove that the birth of Jesus",
                " took place in the normal manner, as",
                " a result of union between his father",
                " and mother, end up by proving only",
                " that God is less capable of clear",
                " expression than they are!"
            ]
        },
        {
            "id": "[3:48]",
            "verse": "And He will teach him writing and wisdom and the Torah and the Gospel",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:49]",
            "verse": "And [make him] a messenger to the Children of Israel, [who will say], 'Indeed I have come to you with a sign from your Lord in that I design for you from clay [that which is] like the form of a bird, then I breathe into it and it becomes a bird by permission of Allah. And I cure the blind and the leper, and I give life to the dead - by permission of Allah. And I inform you of what you eat and what you store in your houses. Indeed in that is a sign for you, if you are believers.",
            "description": [
                "It is hinted here that these signs",
                " are sufficient proof that Jesus was designated",
                " by God, the Creator and Sovereign of",
                " the universe, provided people are prepared to",
                " accept the truth instead of obstinately clinging",
                " to their prejudiced views. This is further",
                " proof that Jesus had been entrusted with",
                " a mission by God. Had he not",
                " been designated by God but by an",
                " imposter he would surely have attempted to",
                " found an independent religion, exploiting his miracles",
                " to lead people away from their original",
                " faith. However, Jesus believed in, and confirmed,",
                " the validity of the teachings of the",
                " original religion which had been preached at",
                " God's behest by the earlier Prophets."
            ]
        },
        {
            "id": "[3:50]",
            "verse": "And [I have come] confirming what was before me of the Torah and to make lawful for you some of what was forbidden to you. And I have come to you with a sign from your Lord, so fear Allah and obey me.",
            "description": [
                "The fact that Jesus preached the same",
                " religion as that expounded earlier by Moses",
                " and the other Prophets is also borne",
                " out by the statements of the existing",
                " Gospels: According to Matthew, in his Sermon",
                " on the Mount the Messiah categorically declared:",
                " 'Think not that I have come to",
                " abolish the law and the prophets; I",
                " have come not to abolish them but",
                " to fulfil them' (Matthew 5: 17). And",
                " when a Jewish lawyer enquired: 'Teacher, which",
                " is the greatest commandment in the Law?',",
                " Jesus replied: 'You shall love the Lord",
                " your God with all your heart, and",
                " with all your soul, and with all",
                " your mind. This is the greatest and",
                " the first commandment. And a second is",
                " like it, you shall love your neighbour",
                " as yourself. On these two commandments depends",
                " the law and the prophets' (ibid., 22:",
                " 37-40). He also instructed his disciples: The",
                " scribes and the Pharisees sit on Moses'",
                " seat, so practise and observe whatever they",
                " tell you, but not what they do;",
                " for they preach, but do not practise'",
                " (ibid., 23: 2-3).",
                "*47). What Jesus wanted",
                " to impress upon them was that he",
                " would abolish the prohibitive innovations which had",
                " infiltrated the original Divine Law (Shari'ah}. These",
                " were the results of the superstitions of",
                " their ignorant commoners, the legal hair-splitting of",
                " their lawyers, the extremism of their world-renouncing",
                " pietists, and the ascendancy and predominance of",
                " non-Muslim peoples over them. In determining what",
                " is lawful and unlawful, Jesus would be",
                " guided by the injunctions of God and",
                " not by the inventions of human beings.",
                ""
            ]
        },
        {
            "id": "[3:51]",
            "verse": "Indeed, Allah is my Lord and your Lord, so worship Him. That is the straight path.\"",
            "description": [
                "This shows that as with the other",
                " Prophets, the fundamental points of Jesus' mission",
                " were the following: (1) Man should acknowledge-",
                " the exclusive sovereignty of God which demands",
                " absolute service and obedience to Him, and",
                " Him alone. This principle serves as the",
                " basis for the entire structure of human",
                " morality and social behaviour. (2) Man should",
                " obey the Prophets since they are the",
                " representatives of the true Sovereign. (3) The",
                " Law which should regulate man's conduct by",
                " elaborating what is right and what is",
                " wrong should be none other than the",
                " Law of God. The laws devised by",
                " others should be abrogated. There is, thus,",
                " no difference between the missions of Jesus,",
                " Moses and Muhammad (peace be on them",
                " all). Those who think that the missions",
                " of the Prophets differ from one another",
                " and who believe that their objectives vary",
                " have fallen into serious error. Whoever is",
                " sent by the Lord of the Universe",
                " to His creatures can have no other",
                " purpose than to dissuade God's subjects from",
                " disobeying Him and assuming an attitude of",
                " vanity and disregard towards Him, and to",
                " admonish them against associating anyone with God",
                " in His divinity (that is, either holding",
                " anyone to be a partner with the",
                " Lord of the Universe in His Sovereignty",
                " or recognizing others beside God as having",
                " a rightful claim on part of man's",
                " loyalty, devotion and worship), and to invite",
                " them all to be loyal to, and",
                " to serve, obey and worship God alone.",
                " It is unfortunate that the Gospels in",
                " their present form do not offer as",
                " clear a picture of the mission of",
                " Jesus as that presented by the Qur'an.",
                " Nevertheless, we find scattered throughout the Gospels",
                " all the three fundamentals mentioned above. The",
                " notion that man ought to submit himself",
                " totally to God is embodied in the",
                " following statement: 'You shall worship the Lord",
                " your God and Him only shall you",
                " serve' (Matthew 4: 10). In addition, Jesus",
                " believed that the object of his efforts",
                " was that God's commands relating to the",
                " moral realm should be obeyed in this",
                " world in the sphere of human conduct",
                " just as His commands about the operation",
                " of the physical universe are obeyed in",
                " the heavens: 'Thy kingdom come, Thy will",
                " be done, On earth as it is",
                " in heaven' (ibid., 6: 10). The fact",
                " that Jesus presented himself as a Prophet",
                " and a representative of the Kingdom of",
                " Heaven, and that in this capacity he",
                " asked people to follow him is borne",
                " out by several statements. When, for instance,",
                " he began his mission in Nazareth and",
                " when his own kith, kin and compatriots",
                " turned against him, he remarked: 'A prophet",
                " is not without honour except in his",
                " own country . . .' (Matthew 13:",
                " 57; see also Luke 4: 24 and",
                " Mark 6: 4). And when conspiracies were",
                " hatched in Jerusalem to put an end",
                " to his life, and people counselled him",
                " to go away, he replied: 'Nevertheless I",
                " must go on my way . .",
                " . for it cannot be that a",
                " prophet should perish away from Jerusalem' (Luke",
                " 13: 33). When Jesus entered Jerusalem for",
                " the last time the disciples cried with",
                " a loud voice: 'Blessed be the King",
                " who comes in the name of the",
                " Lord' (Luke 19: 38). This angered the",
                " Pharisees, who asked Jesus to rebuke his",
                " disciples. But he replied: 'I tell you,",
                " if these were silent the very stones",
                " would cry out' (ibid., 19: 40). On",
                " another occasion he said: 'Come to me,",
                " all who labour and are heavy laden,",
                " and I will give you rest. Take",
                " my yoke upon you. For my yoke",
                " is easy, and my burden is light'",
                " (Matthew 11: 28-30). The fact that he",
                " invited people to obey the Laws of",
                " God rather than the laws made by",
                " man is evident from his response (found",
                " in both Matthew and Mark) to the",
                " objection raised by the Pharisees to the",
                " conduct of their disciples who ate with",
                " defiled hands, that is, without washing. 'Well",
                " did Isiah prophesy of you hypocrites, as",
                " it is written: This people honours me",
                " with their lips, but their heart is",
                " far from me; in vain do they",
                " worship me, teaching as doctrines the precepts",
                " of men.' And he said to them:",
                " 'You have a fine way of rejecting",
                " the commandment of God in order to",
                " keep your tradition. For Moses said, \"Honour",
                " your father and your mother\", and \"He",
                " who speaks evil of his father or",
                " mother, let him surely die\", but you",
                " say, \"If a man tells his father",
                " or mother what you would have gained",
                " from me is Corban (that is, given",
                " to God), and then you no longer",
                " permit him to do anything for his",
                " father or mother, thus making void the",
                " word of God through your tradition which",
                " you hand on\"' (Mark 7: 6-13; see",
                " also Matthew 15: 2-9)."
            ]
        },
        {
            "id": "[3:52]",
            "verse": "But when Jesus felt [persistence in] disbelief from them, he said, \"Who are my supporters for [the cause of] Allah?\" The disciples said, \"We are supporters for Allah. We have believed in Allah and testify that we are Muslims [submitting to Him].",
            "description": [
                "The word hawari means approximately the same",
                " as the word ansar in the Islamic",
                " tradition. In the Bible the usual terms",
                " are 'apostles' and 'disciples'. Jesus' chosen disciples",
                " were called apostles in the sense that",
                " they had been entrusted with a mission",
                " by him rather than in the sense",
                " of having been entrusted with a mission",
                " by God.",
                "*50). At various places the",
                " Qur'an characterizes man's participation in the effort",
                " to establish the supremacy of Islam as",
                " 'helping God'. This needs a little explanation.",
                " God has endowed man with the freedom",
                " of will and choice, with the result",
                " that He does not resort to His",
                " omnipotent will to compel man either to",
                " do certain things or to refrain from",
                " others. He rather leaves man free to",
                " adopt the course that pleases him -",
                " be it that of either belief or",
                " unbelief, of either obedience or disobedience. God",
                " prefers to instruct man by means of",
                " persuasive argument and admonition, so as to",
                " bring home to him that even though",
                " he is free to disbelieve, disobey and",
                " defy the Will of God, his own",
                " interest and well-being lie in serving and",
                " obeying his Creator. Hence, directing people to",
                " the right path by persuasion and admonition",
                " is of concern to God, He regards",
                " those who contribute to this cause as",
                " His allies and helpers. This is, in",
                " fact, the most exalted position attainable by",
                " man. When a man performs Prayers, keeps",
                " his fast and worships God in other",
                " ways, he is merely on the level",
                " of service and subjection to God. But",
                " when a man strives to spread God's",
                " true religion and to enthrone it in",
                " actual life, he is honoured with the",
                " status of God's ally and helper, which",
                " is the zenith of man's spiritual growth.",
                " 'Literally, 'and be our witness that we",
                " are Muslims' - Ed."
            ]
        },
        {
            "id": "[3:53]",
            "verse": "Our Lord, we have believed in what You revealed and have followed the messenger Jesus, so register us among the witnesses [to truth].\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:54]",
            "verse": "And the disbelievers planned, but Allah planned. And Allah is the best of planners.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:55]",
            "verse": "[Mention] when Allah said, \"O Jesus, indeed I will take you and raise you to Myself and purify you from those who disbelieve and make those who follow you [in submission to Allah alone] superior to those who disbelieve until the Day of Resurrection. Then to Me is your return, and I will judge between you concerning that in which you used to differ.",
            "description": [
                "The expression used is mutawaffika. The original",
                " meaning of tawaffa is to take and",
                " receive. To 'seize a person's sou!' constitutes",
                " the figurative rather than the literal meaning",
                " of the word. Here the word is",
                " used in the sense of 'recall', for",
                " example, the recall of an official from",
                " his work. The Israelites had persisted in",
                " their disobedience, and despite repeated warnings and",
                " admonitions their collective behaviour had become increasingly",
                " corrupt. They had killed a succession of",
                " Prophets and were out to shed the",
                " blood of all those who invited them",
                " to righteousness and moral rectitude. In order",
                " to complete His argument against them, and",
                " to give them a last chance to",
                " reform themselves, God sent to them two",
                " great Prophets, Jesus and John the Baptist.",
                " These Prophets carried with them such overwhelming",
                " proof of their designation by God that",
                " no ground was left for anyone to",
                " disbelieve in them, except those who were",
                " obstinately hostile to the Truth and who",
                " had become exceedingly bold in their opposition",
                " to it. Yet the Israelites let this",
                " last opportunity slip away. They not only",
                " spurned the message of the Prophets but",
                " also brazenly indulged in many other atrocious",
                " crimes. One of their chiefs had John",
                " beheaded at the behest of a dancing",
                " girl, and their priests and scribes conspired",
                " to have Jesus put to death by",
                " the Roman authorities. Further admonition would have",
                " been a sheer waste of time. God,",
                " therefore, decided to recall His Prophet and",
                " condemned the Israelites to perpetual disgrace. It",
                " should be noted that this whole discourse",
                " (verses 3: 33 ff.) is devoted to",
                " repudiating the Christian belief in the godhead",
                " of Jesus, and to reforming their beliefs.",
                " The main reasons for the spread of",
                " these false beliefs were: (i) the miraculous",
                " birth of Jesus; (ii) the miracles which",
                " he performed; and (iii) his ascension into",
                " heaven (which is mentioned categorically in the",
                " Christian scriptures). The Qur'an confirms the miraculous",
                " birth of Jesus and asserts that this",
                " fatherless birth is a manifestation of God's",
                " omnipotence. God creates whomsoever He wills and",
                " in the manner He chooses. This extraordinary",
                " birth neither proves that Jesus was God",
                " nor that he had any share in",
                " God's godhead. The miracles of Jesus are",
                " also verified by the Qur'an; in fact",
                " it enumerates them one by one. The",
                " Qur'an, however, makes it clear that Jesus",
                " performed these miracles in accordance with God's",
                " will, and not of his own innate",
                " power. Had the traditions cherished by the",
                " Christians regarding Jesus' ascension into heaven been",
                " without foundation, they would have been told",
                " that he whom they regarded as either",
                " God or the son of God had",
                " died long ago and become part of",
                " the earth, and that if they wanted",
                " to satisfy themselves on that score they",
                " could go and witness for themselves his",
                " grave at a certain place. But not",
                " only does the Qur'an not make any",
                " categorical statement that Jesus died, it employs",
                " an expression which, to say the least,",
                " contains the possibility of being interpreted as",
                " meaning that he had been raised into",
                " heaven alive. Further, the Qur'an tells the",
                " Christians that Jesus, contrary to their belief,",
                " was not crucified. This means that the",
                " man who cried out at the end",
                " of his life: 'Eli, Eli, lama sabach-thani?',",
                " that is, 'My God, my God, why",
                " hast thou forsaken me?' (Matthew 27: 46),",
                " and the one whose image was seen",
                " on the cross was not Christ; God",
                " had already raised Christ into heaven. As",
                " for those who try to interpret these",
                " Qur'anic verses as indicating the death of",
                " Jesus, they actually prove only that God",
                " is incapable of expressing His ideas in",
                " clear, lucid terms.",
                "*52). The words 'those",
                " who disbelieve' here refer to the Jews",
                " whom Jesus had invited to believe, and",
                " who had refused that invitation. The expression:",
                " 'your followers', if it denotes the true",
                " followers of Jesus, can only mean Muslims.",
                " Should 'followers' signify all those who profess",
                " allegiance to Jesus, it would include both",
                " Christians and Muslims."
            ]
        },
        {
            "id": "[3:56]",
            "verse": "And as for those who disbelieved, I will punish them with a severe punishment in this world and the Hereafter, and they will have no helpers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:57]",
            "verse": "But as for those who believed and did righteous deeds, He will give them in full their rewards, and Allah does not like the wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:58]",
            "verse": "This is what We recite to you, [O Muhammad], of [Our] verses and the precise [and wise] message.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:59]",
            "verse": "Indeed, the example of Jesus to Allah is like that of Adam. He created Him from dust; then He said to him, \"Be,\" and he was.",
            "description": [
                "This means that if Jesus' miraculous birth",
                " is sufficient proof that he should be",
                " regarded either as God or as the",
                " son of God then there are even",
                " stronger grounds to apply this to Adam.",
                " For, while Jesus was born without a",
                " father, Adam was born with neither father",
                " nor mother."
            ]
        },
        {
            "id": "[3:60]",
            "verse": "The truth is from your Lord, so do not be among the doubters.",
            "description": [
                "The main points set before the Christians",
                " so far are the following: First, it",
                " was impressed upon them that none of",
                " the various arguments which gave rise to",
                " the doctrine of the divinity of Jesus",
                " provided valid grounds to support that doctrine.",
                " Jesus was merely a human being whom",
                " God had created in an extraordinary manner",
                " for reasons best known to Him. God",
                " had also invested Jesus with the power",
                " to perform certain miracles by means of",
                " which he could categorically establish his claim",
                " to prophethood. It seems perfectly reasonable that",
                " God should not have allowed such an",
                " extraordinary person to be crucified by unbelievers",
                " and should have raised him up to",
                " Himself. As the Sovereign, God has the",
                " power to treat any of His subjects",
                " as He wishes. How can this extraordinary",
                " treatment of Jesus justify the conclusion that",
                " the subject was himself either the Sovereign,",
                " the son of the Sovereign or an",
                " associate with Him in His Sovereignty? Second,",
                " the message of Muhammad (peace be on",
                " him) is the same as that of",
                " Jesus. The missions of the two are",
                " identical. Third, even after [the ascension of]",
                " Jesus the religion of his disciples remained",
                " the same, namely, Islam, which is now",
                " expounded by the Qur'an. What has happened",
                " is that, in the course of time,",
                " the Christians have abandoned the teachings of",
                " Christ, and have deviated from the religion",
                " followed by the early disciples of Jesus.",
                ""
            ]
        },
        {
            "id": "[3:61]",
            "verse": "Then whoever argues with you about it after [this] knowledge has come to you - say, \"Come, let us call our sons and your sons, our women and your women, ourselves and yourselves, then supplicate earnestly [together] and invoke the curse of Allah upon the liars [among us].\"",
            "description": [
                "The real aim in suggesting this procedure",
                " for deciding the dispute was to prove",
                " that the attitude of those amongst the",
                " delegation of Najran was one of deliberate",
                " stubbornness and intransigence. They had no sound",
                " arguments to contradict any of the points",
                " mentioned above, and they could not find",
                " any shred of evidence in their own",
                " scriptures upon which they could claim, with",
                " firm conviction, that their beliefs were true.",
                " Moreover, all that the members of the",
                " deputation had come to know of the",
                " character, teachings and achievements of the Prophet",
                " had made them more or less convinced",
                " of his prophethood, and at least caused",
                " their disbelief to waver. When they were",
                " told that if they had full confidence",
                " in the truth of their beliefs they",
                " should come forward and pray to God",
                " that His curse should fall on the",
                " deniers of the truth, none of them",
                " came forward. It thus became clear all",
                " over Arabia that the priests and leaders",
                " of Christianity in Najran, whose holiness was",
                " celebrated far and wide, followed beliefs, the",
                " truth of which, they themselves were not",
                " fully confident in."
            ]
        },
        {
            "id": "[3:62]",
            "verse": "Indeed, this is the true narration. And there is no deity except Allah. And indeed, Allah is the Exalted in Might, the Wise.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:63]",
            "verse": "But if they turn away, then indeed - Allah is Knowing of the corrupters.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:64]",
            "verse": "Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah.\" But if they turn away, then say, \"Bear witness that we are Muslims [submitting to Him].\"",
            "description": [
                "This marks the beginning of the third",
                " discourse of this surah. Its contents invite",
                " the conclusion that the surah was revealed",
                " sometime between the battles of Badr and",
                " Uhud. The subjects of these three discourses",
                " are so closely interrelated that some commentators",
                " have wrongly understood the verses which follow",
                " to be part of the foregoing discourse.",
                " From the whole tenor of the discourse",
                " which now begins, however, it is evident",
                " that it is addressed to the Jews.",
                "",
                "*57). The invitation here is for the",
                " two parties to agree on something believed",
                " in by one of them, the Muslims,",
                " and the soundness of which could hardly",
                " be denied by the other party, the",
                " Christians. For this was the belief of",
                " their own Prophets and had been taught",
                " in their own scriptures."
            ]
        },
        {
            "id": "[3:65]",
            "verse": "O People of the Scripture, why do you argue about Abraham while the Torah and the Gospel were not revealed until after him? Then will you not reason?",
            "description": [
                "That is, both Judaism and Christianity came",
                " into existence after the Torah and the",
                " Injil had been revealed; Abraham had lived",
                " much earlier than that. Thus it can",
                " easily be grasped that the religion of",
                " Abraham could not have been that of",
                " either Judaism or Christianity. If Abraham was",
                " on the right path and had attained",
                " salvation it is obvious that one need",
                " not follow either, Judaism or Christianity in",
                " order to be on the right path",
                " and to attain salvation. (See also Surah",
                " 2, nn. 135 and 141 above.)"
            ]
        },
        {
            "id": "[3:66]",
            "verse": "Here you are - those who have argued about that of which you have [some] knowledge, but why do you argue about that of which you have no knowledge? And Allah knows, while you know not.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:67]",
            "verse": "Abraham was neither a Jew nor a Christian, but he was one inclining toward truth, a Muslim [submitting to Allah]. And he was not of the polytheists.",
            "description": [
                "The word hanif denotes someone who turns",
                " his face away from all other directions",
                " in order to follow one particular course.",
                " We have tried to convey this sense",
                " through the expression: 'a Muslim, wholly devoted",
                " to God'."
            ]
        },
        {
            "id": "[3:68]",
            "verse": "Indeed, the most worthy of Abraham among the people are those who followed him [in submission to Allah] and this prophet, and those who believe [in his message]. And Allah is the ally of the believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:69]",
            "verse": "A faction of the people of the Scripture wish they could mislead you. But they do not mislead except themselves, and they perceive [it] not.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:70]",
            "verse": "O People of the Scripture, why do you disbelieve in the verses of Allah while you witness [to their truth]?",
            "description": [
                "Another rendering of this could be, 'and",
                " you yourselves bear witness' to Muhammad's prophethood.",
                " However it is translated the sense remains",
                " the same. In fact, the impeccable purity",
                " of the life of the Prophet, the",
                " astounding impact of his teachings and training",
                " on the lives of his Companions, and",
                " the loftiness of the teachings of the",
                " Qur'an all constituted such illustrious signs of",
                " God that it was very difficult for",
                " anyone conversant with the lives of the",
                " Prophets and the tenor of Divine Scriptures",
                " to doubt the prophethood of Muhammad (peace",
                " be on him). It is a fact",
                " that many Jews and Christians (especially their",
                " scholars) came, to recognize in their hearts",
                " that Muhammad was the very Prophet whose",
                " coming had been announced by the preceding",
                " Prophets. This fact was so overwhelming that,",
                " despite their intransigence, they could not help",
                " but give verbal expression, at times, to",
                " the truth of the Prophet's teachings. This",
                " is why the Qur'an repeatedly blames them",
                " for maliciously misrepresenting the signs of God",
                " which they saw with their own eyes",
                " and to which they themselves attested."
            ]
        },
        {
            "id": "[3:71]",
            "verse": "O People of the Scripture, why do you confuse the truth with falsehood and conceal the truth while you know [it]?",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:72]",
            "verse": "And a faction of the People of the Scripture say [to each other], \"Believe in that which was revealed to the believers at the beginning of the day and reject it at its end that perhaps they will abandon their religion,",
            "description": [
                "This was one of the devices adopted",
                " by the leaders and rabbis of the",
                " Jews who lived on the outskirts of",
                " Madina in order to damage the mission",
                " of Islam. To demoralize the Muslims and",
                " create misgivings about the Prophet (peace be",
                " on him), they sent their agents to",
                " embrace Islam publicly, then to renounce it,",
                " and subsequently to go about telling people",
                " they had done so because of the",
                " faults they had found in Islam, the",
                " Muslims and their Prophet."
            ]
        },
        {
            "id": "[3:73]",
            "verse": "And do not trust except those who follow your religion.\" Say, \"Indeed, the [true] guidance is the guidance of Allah. [Do you fear] lest someone be given [knowledge] like you were given or that they would [thereby] argue with you before your Lord?\" Say, \"Indeed, [all] bounty is in the hand of Allah - He grants it to whom He wills. And Allah is all-Encompassing and Wise.\"",
            "description": [
                "The word wasi' which is used here",
                " occurs in the Qur'an in three contexts.",
                " The first context is the narrow-mindedness and",
                " mean outlook of certain people, in contrast",
                " to which God is not 'narrow'. The",
                " second context is the denunciation of miserliness,",
                " meanness and niggardliness, in contrast to which",
                " God is Generous and Munificent. The third",
                " context is the ascription of finite, limited",
                " concepts to God as a result of",
                " their limitedimagination, whereas the truth is that",
                " God is infinite (see Surah 2, n.",
                " 116 above)."
            ]
        },
        {
            "id": "[3:74]",
            "verse": "He selects for His mercy whom He wills. And Allah is the possessor of great bounty.",
            "description": [
                "*63). That is, God knows who deserves",
                " to be honoured and exalted."
            ]
        },
        {
            "id": "[3:75]",
            "verse": "And among the People of the Scripture is he who, if you entrust him with a great amount [of wealth], he will return it to you. And among them is he who, if you entrust him with a [single] silver coin, he will not return it to you unless you are constantly standing over him [demanding it]. That is because they say, \"There is no blame upon us concerning the unlearned.\" And they speak untruth about Allah while they know [it].",
            "description": [
                "This was not merely the misconception of",
                " the ignorant mass of Jews. Their religious",
                " teaching was the same and the legal",
                " doctrines of their accepted religious authorities and",
                " jurists reflected this idea. With regard to",
                " injunctions on loans and interest the Bible",
                " makes a clear distinction between an Israelite",
                " and a non-Israelite (Deuteronomy 15: 1-3; 23:",
                " 20). It is stated in the Talmud",
                " that if the bullock of an Israelite",
                " injures the bullock of a non-Israelite the",
                " former is not liable to any penalty,",
                " but not vice versa. Similarly, it is",
                " laid down that if anyone finds an",
                " unclaimed article he should enquire amongst the",
                " people who live nearby. If they are",
                " Israelites he should announce his find; if",
                " not he may keep it without saying",
                " anything further. Rabbi Samuel Ishmael says that",
                " if a dispute between a Jew and",
                " a Gentile is brought before a judge,",
                " he should base his verdict on Jewish",
                " law if it is favourable; if the",
                " law of the Gentiles goes in favour",
                " of the Jew he should justify his",
                " judgement by saying that the Gentile has",
                " no valid ground for complaint since judgement",
                " was given according to his own law.",
                " Even if both laws are unfavourable towards",
                " the Jew the judge should still find",
                " some pretext for deciding in his favour.",
                " Rabbi Samuel says that benefit should be",
                " derived from every mistake the non-Israelite may",
                " make. (See Paul Isaac Hershon, Talmudic Miscellany,",
                " London, 1880, pp. 37 and 210-21.)"
            ]
        },
        {
            "id": "[3:76]",
            "verse": "But yes, whoever fulfills his commitment and fears Allah - then indeed, Allah loves those who fear Him.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:77]",
            "verse": "Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price will have no share in the Hereafter, and Allah will not speak to them or look at them on the Day of Resurrection, nor will He purify them; and they will have a painful punishment.",
            "description": [
                "The reason is that, despite their worst",
                " crimes, they still thought that on the",
                " Day of Judgement they alone would be",
                " honoured with God's favour, and that towards",
                " them alone He would turn His gracious",
                " attention. They also entertained the belief that",
                " if they had been stained by any",
                " trace of sin, it would be washed",
                " away by the grace of their pious",
                " elders. Such people are warned here that",
                " the treatment meted out to them in",
                " the Next Life will be altogether contrary",
                " to their expectations."
            ]
        },
        {
            "id": "[3:78]",
            "verse": "And indeed, there is among them a party who alter the Scripture with their tongues so you may think it is from the Scripture, but it is not from the Scripture. And they say, \"This is from Allah,\" but it is not from Allah. And they speak untruth about Allah while they know.",
            "description": [
                "This could mean that they either distort",
                " the meaning of the Scriptures or twist",
                " the words of the text in order",
                " to misinterpret it. Its real meaning, however,",
                " seems to be that when, during their",
                " reading of the Scriptures, they encounter any",
                " word or sentence which goes against their",
                " interests, and the beliefs and notions which",
                " they cherish, they distort the meaning of",
                " it by deliberately twisting their tongues. Instances",
                " of such tongue-twisting are not altogether wanting",
                " among those who, despite their belief in",
                " the Qur'an, share some of these people's",
                " characteristics. For instance, some people who stress",
                " the superhuman character of the Prophet (peace",
                " be on him) misread the following verse:",
                " innama ana basharun mithlukum (Qur'an 18: 110)",
                " (I am nothing but a human being",
                " like you), replacing innama by inna ma",
                " ana and translate it: '(O Prophet), say",
                " to them: \"I am not a human",
                " being like you.\""
            ]
        },
        {
            "id": "[3:79]",
            "verse": "It is not for a human [prophet] that Allah should give him the Scripture and authority and prophethood and then he would say to the people, \"Be servants to me rather than Allah,\" but [instead, he would say], \"Be pious scholars of the Lord because of what you have taught of the Scripture and because of what you have studied.\"",
            "description": [
                "The term rabbani is used here to",
                " denote Jewish religious scholars and functionaries who",
                " were supposed to provide true religious guidance",
                " to establish their rites of worship, implement",
                " religious laws, and so on. The same",
                " word occurs in Surah 5: 44 and",
                " 63. In the Christian tradition the word",
                " 'divine' is used as an equivalent to",
                " the word rabbani."
            ]
        },
        {
            "id": "[3:80]",
            "verse": "Nor could he order you to take the angels and prophets as lords. Would he order you to disbelief after you had been Muslims?",
            "description": [
                "This refutation is directed at all the",
                " false concepts which were attributed to the",
                " Messengers of God by various nations, and",
                " then made an integral part of the",
                " religious scriptures. These concepts were false in",
                " that they elevated either the Prophets or",
                " the angels to the level of deities",
                ""
            ]
        },
        {
            "id": "[3:81]",
            "verse": "And [recall, O People of the Scripture], when Allah took the covenant of the prophets, [saying], \"Whatever I give you of the Scripture and wisdom and then there comes to you a messenger confirming what is with you, you [must] believe in him and support him.\" [Allah] said, \"Have you acknowledged and taken upon that My commitment?\" They said, \"We have acknowledged it.\" He said, \"Then bear witness, and I am with you among the witnesses.\"",
            "description": [
                "A party of the People of the",
                " Book would fain lead you astray, whereas",
                " in truth they lead none astray except",
                " themselves, but they do not realize it.",
                ""
            ]
        },
        {
            "id": "[3:82]",
            "verse": "And whoever turned away after that - they were the defiantly disobedient.",
            "description": [
                "People of the Book! Why do you",
                " reject the signs of Allah even though",
                " you yourselves witness them?60"
            ]
        },
        {
            "id": "[3:83]",
            "verse": "So is it other than the religion of Allah they desire, while to Him have submitted [all] those within the heavens and earth, willingly or by compulsion, and to Him they will be returned?",
            "description": [
                "The basic principle characterizing the universe, in",
                " other words the religion of the universe",
                " and of every part of it, is",
                " Islam; insofar as the universe is in",
                " a state of total obedience and service",
                " to the Will of God. Here people",
                " are asked if they would follow a",
                " way of life different from Islam though",
                " they are part of the universe which",
                " is characterized by submission to God (islam).",
                ""
            ]
        },
        {
            "id": "[3:84]",
            "verse": "Say, \"We have believed in Allah and in what was revealed to us and what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Descendants, and in what was given to Moses and Jesus and to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [submitting] to Him.\"",
            "description": [
                "They are told that it is not",
                " the habit of Muslims either to believe",
                " in Prophets and disbelieve in others or",
                " to affirm to the truth of some",
                " call others false. Muslims are free from",
                " narrow prejudices and chauvinistic loyalties. The true",
                " attitude of Muslims is to bear witness",
                " to truth of every Messenger of God,",
                " irrespective of where and when he appears.",
                ""
            ]
        },
        {
            "id": "[3:85]",
            "verse": "And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:86]",
            "verse": "How shall Allah guide a people who disbelieved after their belief and had witnessed that the Messenger is true and clear signs had come to them? And Allah does not guide the wrongdoing people.",
            "description": [
                "This is a repetition of the statement",
                " made earlier, namely that the Jewish rabbis",
                " of Arabia in the time of the",
                " Prophet (peace be on him) knew, and",
                " sometimes even testified to verbally, that Muhammad",
                " was a true Prophet and that his",
                " teachings were the same as those of",
                " the earlier Prophets. (See for instance Qur'an",
                " 2: 89 - Ed.) Their subsequent attitude",
                " - namely that of rejection and opposition",
                " - was the outcome of prejudice and",
                " intransigence, born out of their centuries-old hostility",
                " to the Truth."
            ]
        },
        {
            "id": "[3:87]",
            "verse": "Those - their recompense will be that upon them is the curse of Allah and the angels and the people, all together,",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:88]",
            "verse": "Abiding eternally therein. The punishment will not be lightened for them, nor will they be reprieved.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:89]",
            "verse": "Except for those who repent after that and correct themselves. For indeed, Allah is Forgiving and Merciful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:90]",
            "verse": "Indeed, those who reject the message after their belief and then increase in disbelief - never will their [claimed] repentance be accepted, and they are the ones astray.",
            "description": [
                "They were not content with just rejecting",
                " the call to the Truth but stood",
                " in vehement opposition and hostility to it",
                " and spared no efforts in obstructing people",
                " from following the way of God. They",
                " created doubts, spread misgivings, sowed the seeds",
                " of distrust and engaged in the worst",
                " conspiracies and machinations in order to frustrate",
                " the mission of the Prophet (peace be",
                " on him)."
            ]
        },
        {
            "id": "[3:91]",
            "verse": "Indeed, those who disbelieve and die while they are disbelievers - never would the [whole] capacity of the earth in gold be accepted from one of them if he would [seek to] ransom himself with it. For those there will be a painful punishment, and they will have no helpers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:92]",
            "verse": "Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love. And whatever you spend - indeed, Allah is Knowing of it.",
            "description": [
                "The purpose of this verse is to",
                " remove the misconception of the Jews concerning",
                " 'righteousness'. The Jews had inherited an elaborate",
                " legal code which had accumulated as a",
                " result of the casuistry and hair-splitting legalism",
                " of their jurists. Their notion of 'righteousness'",
                " consisted of outward, formal conformity to that",
                " code and they evaluated all day-to-day actions,",
                " especially the trivial ones, in terms of",
                " conformity to that code. Narrow-mindedness, greed, covetousness,",
                " meanness, concealment of the Truth and readiness",
                " to barter with it lay beneath this",
                " veneer of formal piety. They were, nevertheless,",
                " considered pious in the minds of the",
                " people; Jewish public opinion condoned their conduct",
                " because it conformed to its concept of",
                " 'righteousness'. In order to remove this misconception",
                " they are told that the things they",
                " considered fundamental to righteous conduct are of",
                " little consequence. The real spirit of righteousness",
                " consists in the love of God -",
                " a love which makes man value the",
                " good pleasure of God above all worldly",
                " acquisitions. If the love of anything seizes",
                " a man's mind to such an extent",
                " that he is unable to sacrifice it",
                " for the sake of the love of",
                " God, then that thing has virtually become",
                " an idol, and until he smashes it",
                " the door to righteousness will remain closed",
                " to him. If a man lacks this",
                " spirit, then his excessively formal and legalistic",
                " approach in religious matters can be considered",
                " no more than glossy paint over a",
                " piece of hollow, worm-eaten wood. It may",
                " be possible to deceive human beings by",
                " the sheer lustre of the outer paint,",
                " but not God."
            ]
        },
        {
            "id": "[3:93]",
            "verse": "All food was lawful to the Children of Israel except what Israel had made unlawful to himself before the Torah was revealed. Say, [O Muhammad], \"So bring the Torah and recite it, if you should be truthful.\"",
            "description": [
                "When the Jewish rabbis found no grounds",
                " for criticizing the fundamental teachings of the",
                " Prophet (there was no difference between the",
                " teachings of the previous Prophets and that",
                " of the Arabian Prophet on matters which",
                " constitute the core of religion), they raised",
                " objections about the details of religious law.",
                " The first objection was that the Prophet",
                " (peace be on him) had declared lawful",
                " a number of things which had been",
                " reckoned as unlawful since the time of",
                " the ancient Prophets. What is said here",
                " is a refutation of that objection.",
                "*77).",
                " If 'Israel' is taken to mean the",
                " 'Children of Israel' then the interpretation of",
                " this verse must be that before the",
                " revelation of the Torah they treated a",
                " number of things as prohibited on the",
                " grounds of custom and usage alone. If,",
                " however, 'Israel' signifies Jacob (Ya'qub) then, the",
                " meaning is that he avoided the use",
                " of certain foods, which his descendants wrongly",
                " understood to be religiously prohibited, as a",
                " result of either a temperamental dislike or",
                " an ailment. This latter version is more",
                " commonly accepted. It becomes clear from the",
                " next verse that the Biblical injunction regarding",
                " the prohibition of the flesh of camels",
                " and rabbits was not part of the",
                " original Torah but an interpolation by Jewish",
                " doctors. (For a detailed discussion see Surah",
                " 6, n. 122 below.)"
            ]
        },
        {
            "id": "[3:94]",
            "verse": "And whoever invents about Allah untruth after that - then those are [truly] the wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:95]",
            "verse": "Say, \"Allah has told the truth. So follow the religion of Abraham, inclining toward truth; and he was not of the polytheists.\"",
            "description": [
                "The Jews had enmeshed themselves in legalistic",
                " minutiae and these had become their major",
                " concern. They had abandoned service to the",
                " One True God and had allowed their",
                " religious life to become corrupted by polytheism.",
                " Instead of attending to the fundamentals of",
                " religion they indulged in discussions about questions",
                " that had only arisen because of the",
                " hair-splitting legalism of their scholars during their",
                " centuries of decadence."
            ]
        },
        {
            "id": "[3:96]",
            "verse": "Indeed, the first House [of worship] established for mankind was that at Makkah - blessed and a guidance for the worlds.",
            "description": [
                "The second objection raised by the Jews",
                " was that the direction for Prayer had",
                " been changed from Jerusalem to the Ka'bah.",
                " This objection is answered in Surah 2",
                " (see verses 142 ff. and nn. 142",
                " and 147 above). The Bible, itself, testifies",
                " that Jerusalem was built by Solomon more",
                " than four and a half centuries after",
                " Moses (see 1 Kings 6: 1), and",
                " that it was during his time that",
                " the worshippers of the One God began",
                " to pray towards it (1 Kings 8:",
                " 29-30). It is established by traditions from",
                " numerous sources which are undisputed throughout Arabia,",
                " however, that the Ka'bah was constructed by",
                " Abraham who lived some eight or nine",
                " centuries before Moses. That the Ka'bah was",
                " older than the Temple of Jerusalem was",
                " beyond dispute."
            ]
        },
        {
            "id": "[3:97]",
            "verse": "In it are clear signs [such as] the standing place of Abraham. And whoever enters it shall be safe. And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds.",
            "description": [
                "Here it is stressed that there are",
                " several clear signs which prove that the",
                " Makkan sanctuary enjoys God's blessing and has",
                " been chosen by Him as His sanctuary.",
                " Even though it is located in the",
                " middle of wide expanses of desert God",
                " has seen to it that its inhabitants",
                " enjoy a satisfactory living. Although the rest",
                " of Arabia was plunged into chaos and",
                " disorder for about two and a half",
                " thousand years, peace and tranquillity reigned in",
                " both the precincts and the environs of",
                " the Ka'bah. Thanks to the Ka'bah the",
                " entire Arabian peninsula enjoyed four months of",
                " peace and order every year. These were",
                " the sacred months when people went on",
                " Pilgrimage. Moreover, barely a half century before",
                " the revelation of these verses, people had",
                " seen how Abrahah, the Abyssinian invader, fell",
                " prey to God's scourge when he attacked",
                " Makka with the intention of destroying the",
                " Ka'bah. At that time, this incident was",
                " known to everybody in Arabia. Its memory",
                " was fresh and many eye-witnesses were still",
                " alive at the time of the Prophet",
                " (peace be on him).",
                "*81). Even during",
                " the pre-Islamic era - the Age of",
                " Ignorance in Arabia - this sanctuary enjoyed",
                " such veneration that even those who thirsted",
                " for each other's blood saw their enemies",
                " in the sacred territory but dare not",
                " attack them."
            ]
        },
        {
            "id": "[3:98]",
            "verse": "Say, \"O People of the Scripture, why do you disbelieve in the verses of Allah while Allah is Witness over what you do?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:99]",
            "verse": "Say, \"O People of the Scripture, why do you avert from the way of Allah those who believe, seeking to make it [seem] deviant, while you are witnesses [to the truth]? And Allah is not unaware of what you do.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:100]",
            "verse": "O you who have believed, if you obey a party of those who were given the Scripture, they would turn you back, after your belief, [to being] unbelievers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:101]",
            "verse": "And how could you disbelieve while to you are being recited the verses of Allah and among you is His Messenger? And whoever holds firmly to Allah has [indeed] been guided to a straight path.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:102]",
            "verse": "O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him].",
            "description": [
                "They should remain steadfast in their obedience",
                " and loyalty to God."
            ]
        },
        {
            "id": "[3:103]",
            "verse": "And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.",
            "description": [
                "The expression 'cable of Allah', in this",
                " verse, refers to the 'religion of God'.",
                " The reason for use of the word",
                " 'cable' (habl) is that it both establishes",
                " a bond between man and God and",
                " joins all believers together. To take a",
                " firm hold on this cable means that",
                " the believers should attach profound importance to",
                " their religion: this should always be the",
                " centre of their concerns; they should continually",
                " strive to establish it; and the common",
                " desire to serve it should make them",
                " co-operate with each other. As soon as",
                " Muslims turn their attentions away from the",
                " fundamental teachings of their religion and lose",
                " sight of establishing its hegemony in life",
                " they begin to concern themselves with matters",
                " of secondary importance. And, just as they",
                " rent the communities of the former Prophets,",
                " enticing people away from their true objective",
                " in life, so schisms and dissensions are",
                " bound to plague their lives. If Muslims",
                " do this they are bound to suffer",
                " indignity and disgrace both in this world",
                " and the Next as happened with the",
                " followers of the previous Prophets.",
                "*84). This",
                " refers to the state of the Arabs",
                " on the eve of the advent of",
                " Islam. There were animosities among the tribes",
                " which regularly broke out into fighting; every",
                " now and then there was much bloodshed.",
                " Things had reached a point that the",
                " entire Arabian nation seemed to be on",
                " the verge of destroying itself. It was",
                " due to the blessings of Islam alone",
                " that it was saved from being consumed",
                " by the fire to which this verse",
                " alludes. The people of Madina had embraced",
                " Islam some three or four years before",
                " these verses were revealed. They had witnessed",
                " the blessing of Islam as it unified",
                " into one brotherhood the Aws and Khazraj,",
                " two tribes which had long been sworn",
                " enemies. Moreover, both tribes treated the migrants",
                " from Makka in a spirit of sacrifice",
                " and love seldom seen even among members",
                " of the same family.",
                "*85). If they",
                " had eyes to see they could conclude",
                " for themselves whether their salvation lay in",
                " adhering firmly to this religion or in",
                " abandoning it and reverting to their former",
                " state; i.e. decide whether their true well-wishers",
                " were God and His Messenger or those",
                " Jews, polytheists and hypocrites who strove to",
                " plunge them back into their former state.",
                ""
            ]
        },
        {
            "id": "[3:104]",
            "verse": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:105]",
            "verse": "And do not be like the ones who became divided and differed after the clear proofs had come to them. And those will have a great punishment.",
            "description": [
                "The reference is to those communities which",
                " received clear and straightforward teachings of the",
                " true religion but who had abandoned the",
                " fundamentals, forming separate sects around trivial and",
                " subsidiary questions; they became so engrossed in",
                " quarrelling over superfluous and insignificant questions that",
                " they lost sight of the mission God",
                " had entrusted to them, and even lost",
                " interest in those fundamentals of belief and",
                " righteous conduct which are essential for man's",
                " salvation and felicity."
            ]
        },
        {
            "id": "[3:106]",
            "verse": "On the Day [some] faces will turn white and [some] faces will turn black. As for those whose faces turn black, [to them it will be said], \"Did you disbelieve after your belief? Then taste the punishment for what you used to reject.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:107]",
            "verse": "But as for those whose faces will turn white, [they will be] within the mercy of Allah. They will abide therein eternally.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:108]",
            "verse": "These are the verses of Allah. We recite them to you, [O Muhammad], in truth; and Allah wants no injustice to the worlds.",
            "description": [
                "Since God does not want to subject",
                " people to any wrong He illuminates the",
                " straight path of their salvation, and forewarns",
                " them of the matters for which they",
                " will be asked to render an account",
                " in the Hereafter. It is clear that",
                " if people abandon the path of rectitude",
                " they wrong no one but themselves."
            ]
        },
        {
            "id": "[3:109]",
            "verse": "To Allah belongs whatever is in the heavens and whatever is on the earth. And to Allah will [all] matters be returned.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:110]",
            "verse": "You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah. If only the People of the Scripture had believed, it would have been better for them. Among them are believers, but most of them are defiantly disobedient.",
            "description": [
                "This is the same declaration that was",
                " made earlier (see verse 2: 143 above).",
                " The Arabian Prophet (peace be on him)",
                " and his followers are informed that they",
                " are being assigned the guidance and leadership",
                " of the world, a position the Israelites",
                " had been relieved of because they had",
                " shown themselves unsuitable. The Muslims were charged",
                " with this responsibility because of their competence.",
                " They were the best people in terms",
                " of character and morals and had developed",
                " in theory and in practice the qualities",
                " essential for truly righteous leadership, namely the",
                " spirit and practical commitment to promoting good",
                " and suppressing evil and the acknowledgement of",
                " the One True God as their Lord",
                " and Master. In view of the task",
                " entrusted to them, they had to become",
                " conscious of their responsibilities and avoid the",
                " mistakes committed by their predecessors (see Surah",
                " 1, nn. 123 and 144 above).",
                "*89).",
                " 'People of the Book' refers here to",
                " the Children of Israel."
            ]
        },
        {
            "id": "[3:111]",
            "verse": "They will not harm you except for [some] annoyance. And if they fight you, they will show you their backs; then they will not be aided.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:112]",
            "verse": "They have been put under humiliation [by Allah] wherever they are overtaken, except for a covenant from Allah and a rope from the Muslims. And they have drawn upon themselves anger from Allah and have been put under destitution. That is because they disbelieved in the verses of Allah and killed the prophets without right. That is because they disobeyed and [habitually] transgressed.",
            "description": [
                "If the Jews have ever enjoyed any",
                " measure of peace and security anywhere in",
                " the world they owe it to the",
                " goodwill and benevolence of others rather than",
                " to their own power and strength. At",
                " times Muslim governments granted them refuge while",
                " at others non-Muslim powers extended protection. Similarly,",
                " if the Jews ever emerged as a",
                " power it was due not to their",
                " intrinsic strength but to the strength of",
                " others."
            ]
        },
        {
            "id": "[3:113]",
            "verse": "They are not [all] the same; among the People of the Scripture is a community standing [in obedience], reciting the verses of Allah during periods of the night and prostrating [in prayer].",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:114]",
            "verse": "They believe in Allah and the Last Day, and they enjoin what is right and forbid what is wrong and hasten to good deeds. And those are among the righteous.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:115]",
            "verse": "And whatever good they do - never will it be removed from them. And Allah is Knowing of the righteous.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:116]",
            "verse": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all, and those are the companions of the Fire; they will abide therein eternally.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:117]",
            "verse": "The example of what they spend in this worldly life is like that of a wind containing frost which strikes the harvest of a people who have wronged themselves and destroys it. And Allah has not wronged them, but they wrong themselves.",
            "description": [
                "The term 'harvest' in this parable refers",
                " to this life which resembles a field",
                " of cultivation the harvest of which one",
                " will reap in the World to Come.",
                " The 'wind' refers to the superficial appearance",
                " of righteousness, for the sake of which",
                " unbelievers spend their wealth on philanthropic and",
                " charitable causes. The expression 'frost' indicates their",
                " lack of true faith and their failure",
                " to follow the Divine Laws, as a",
                " result of which their entire life has",
                " gone astray. By means of this parable",
                " God seeks to bring home to them",
                " that while wind is useful for the",
                " growth of cultivation if that wind turns",
                " into frost it destroys it. So it",
                " is with man's acts of charity: they",
                " can prove helpful to the growth of",
                " the harvest one will reap in the",
                " Hereafter but are liable to be destructive",
                " if mixed with unbelief. God is the",
                " Lord and Master of man as well",
                " as of all that man owns, and",
                " the world in which he lives. If",
                " a man either does not recognize the",
                " sovereignty of his Lord and unlawfully serves",
                " others or disobeys God's Laws then his",
                " actions become crimes for which he deserves",
                " to be tried; his acts of 'charity'",
                " are but the acts of a servant",
                " who unlawfully helps himself to his master's",
                " treasure and then spends it as he",
                " likes."
            ]
        },
        {
            "id": "[3:118]",
            "verse": "O you who have believed, do not take as intimates those other than yourselves, for they will not spare you [any] ruin. They wish you would have hardship. Hatred has already appeared from their mouths, and what their breasts conceal is greater. We have certainly made clear to you the signs, if you will use reason.",
            "description": [
                "The Jews living on the outskirts of",
                " Madina had long enjoyed friendly relations with",
                " the two tribes of Aws and Khazraj.",
                " In the first place this was the",
                " result of relations between individuals. Later, they",
                " were bound by ties of neighbourliness and",
                " allegiance as a result of tribal inter-relationship.",
                " Even after the people of Aws and",
                " Khazraj embraced Islam, they maintained their old",
                " ties with the Jews and continued to",
                " treat them with the same warmth and",
                " cordiality. However, the hostility of the Jews",
                " towards the Arabian Prophet (peace be on",
                " him) and towards his mission was far",
                " too intense to allow them to maintain",
                " a cordial relationship with anyone who had",
                " joined the new movement. Outwardly, the Jews",
                " maintained the same terms of friendship with",
                " the Ansar (Helpers) as before but at",
                " heart they had become their sworn enemies.",
                " They made the best use of this",
                " pretended friendship, and remained constantly on the",
                " look-out for opportunities to create schisms and",
                " dissensions in the Muslim body-politic, and to",
                " draw out the secrets of the Muslims",
                " and pass them on to their enemies.",
                " Here God warns the Muslims to note",
                " this hypocrisy and take the necessary precaution.",
                ""
            ]
        },
        {
            "id": "[3:119]",
            "verse": "Here you are loving them but they are not loving you, while you believe in the Scripture - all of it. And when they meet you, they say, \"We believe.\" But when they are alone, they bite their fingertips at you in rage. Say, \"Die in your rage. Indeed, Allah is Knowing of that within the breasts.\"",
            "description": [
                "It is strange that although the Muslims",
                " had reason to feel aggrieved by the",
                " Jews it was the latter who felt",
                " aggrieved by the Muslims. Since the Muslims",
                " believed in the Torah along with the",
                " Qur'an the Jews had no justifiable ground",
                " for complaint. If anyone had cause to",
                " complain it was the Muslims for the",
                " Jews did not believe in the Qur'an.",
                ""
            ]
        },
        {
            "id": "[3:120]",
            "verse": "If good touches you, it distresses them; but if harm strikes you, they rejoice at it. And if you are patient and fear Allah, their plot will not harm you at all. Indeed, Allah is encompassing of what they do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:121]",
            "verse": "And [remember] when you, [O Muhammad], left your family in the morning to post the believers at their stations for the battle [of Uhud] - and Allah is Hearing and Knowing -",
            "description": [
                "This marks the beginning of the fourth",
                " discourse of this surah. It was revealed",
                " after the Battle of Uhud and contains",
                " comments on it. The previous section ended",
                " with the assurance: 'But if you remain",
                " steadfast and mindful of Allah their designs",
                " will not cause you harm.' (See verse",
                " 120 above.) The Muslims did suffer a",
                " setback in the Battle of Uhud precisely",
                " because of this lack of patience, and",
                " because of a few mistakes committed by",
                " some of them which were indicative of",
                " insufficient piety. This discourse, therefore, is quite",
                " appropriate and warns the Muslims against such",
                " weaknesses. The discourse contains a precise and",
                " instructive commentary on all the main events",
                " connected with the Battle of Uhud. In",
                " order to appreciate this it is appropriate",
                " to refresh our minds as to the",
                " situational context of its revelations. In the",
                " beginning of Shawwal 3 A.H., the Quraysh",
                " attacked Madina with an army of three",
                " thousand men. In addition to their numerical",
                " superiority they were also much better equipped.",
                " Moreover, they sought to avenge their losses",
                " in the Battle of Badr. The Prophet",
                " (peace be on him) and his closest",
                " Companions were of the opinion that they",
                " should defend themselves from within the boundaries",
                " of Madina, There were, however, several young",
                " people who longed for martyrdom and felt",
                " aggrieved at, not having had the opportunity",
                " to fight in the Battle of Badr.",
                " They insisted that the enemy should be",
                " resisted outside the confines of Madina. The",
                " Prophet gave in to their demands and",
                " decided to march out of the city",
                " to meet their enemies. A thousand people",
                " accompanied him. Of these, 'Abd Allah b.",
                " Ubayy broke away along with his three",
                " hundred followers after reaching the place called",
                " Shawt. This, happening as it did just",
                " before the commencement of the battle, created",
                " such perplexity and confusion that the people",
                " of Banu Salamah and Banu Harithah wanted",
                " to turn back, and it took some",
                " effort on the part of the Companions",
                " to persuade them not to. The Prophet",
                " advanced with the remaining seven hundred Muslims",
                " and lined up his troops at the",
                " foot of Mount Uhud (a distance of",
                " approximately four miles from Madina) in such",
                " a manner that the mountain was behind",
                " and the Quraysh army in front of",
                " them. There was only one mountain pass",
                " from where the Muslims could be subjected",
                " to a surprise attack. The Prophet posted",
                " fifty archers there as guards under the-",
                " command of 'Abd Allah b. Jubayr, instructing",
                " him neither to let anyone approach nor",
                " to move away from that spot. 'Even",
                " if you see birds fly off with",
                " our flesh', the Prophet said, 'still you",
                " must not move away from this place'.",
                " (For such instructions from the Prophet see",
                " Ibn Sa'd, Tabaqat, vol. 2, pp. 39-40",
                " and 47, and Waqidi, Maghazi, vol. 1,",
                " pp. 224 and 229 - Ed.) Then",
                " the battle commenced. In the beginning the",
                " Muslims proved the better side but instead",
                " of maintaining their onslaught until they had",
                " assured complete victory, they were overcome by",
                " the temptation of booty and turned to",
                " collecting the spoils. When the archers whom",
                " the Prophet had posted to repel the",
                " attack of the enemy from the rear",
                " saw that the enemy had taken to",
                " its heels and that people were collecting",
                " booty, they too joined the melee and",
                " began to do the same. 'Abd Allah",
                " b. Jubayr tried to persuade them not",
                " to leave their posts by reminding them",
                " of the Prophet's directive. Hardly anyone heeded",
                " him. Khalid b. Walld, who was at",
                " that time an unbeliever and who commanded",
                " the Quraysh cavalry, seized his opportunity. He",
                " rode with his men around Mount Uhud",
                " and attacked the flank of the Muslim",
                " army through the pass. 'Abd Allah b.",
                " Jubayr's depleted forces tried unsuccessfully to resist",
                " the attack. The fleeing soldiers of the",
                " enemy also returned and joined the attack",
                " from the front and the scales of",
                " the battle turned against the Muslims. The",
                " suddenness of these attacks, from both the",
                " rear and the front, caused such confusion",
                " that many fled. Then the rumour spread",
                " that the- Prophet, himself, had been martyred.",
                " This news shattered whatever presence of mind",
                " the Companions had left, and led many",
                " who had stood firm to lose courage",
                " altogether. At this moment there remained around",
                " the injured and bleeding Prophet (peace be",
                " on him) no more than ten or",
                " twelve loyal persons who had staked their",
                " lives for his sake. Defeat seemed inevitable.",
                " Fortunately, however, the Companions realized that the",
                " Prophet was still alive. They therefore advanced",
                " towards him from all sides, rallied around",
                " him, and led him to the safety",
                " of the mountain. (For an account of",
                " the Battle of Uhud in early Islamic",
                " sources, see Ibn Hisham, Slrah, yol, 1,",
                " pp. 61 ff., Waqidi, Maghazi, vol. 1,",
                " pp. 199 ff., especially pp. 224, 229",
                " f. and 237 ff., and Ibn Sa'd,",
                " Tabaqat, vol. 2, pp. 36-48, etc. -",
                " Ed.) It remains a mystery why the",
                " unbelievers of Makka held back when victory",
                " was within their grasp. The Muslim ranks",
                " were in such disarray that they would",
                " have been hard pushed to resist further.",
                " (Cf. the account and conclusion of W.",
                " M. Watt regarding the Battle of Uhud",
                " in Muhammad at Medina, Oxford University Press,",
                " 1956, pp. 21 ff., especially pp. 26-9",
                " -Ed.)"
            ]
        },
        {
            "id": "[3:122]",
            "verse": "When two parties among you were about to lose courage, but Allah was their ally; and upon Allah the believers should rely.",
            "description": [
                "This refers to Banu Salamah and Banu",
                " Harithah, whose morale had been undermined as",
                " a result of the withdrawal of 'Abd",
                " Allah b. Ubayy and his followers."
            ]
        },
        {
            "id": "[3:123]",
            "verse": "And already had Allah given you victory at [the battle of] Badr while you were few in number. Then fear Allah; perhaps you will be grateful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:124]",
            "verse": "[Remember] when you said to the believers, \"Is it not sufficient for you that your Lord should reinforce you with three thousand angels sent down?",
            "description": [
                "When the Muslims saw that their enemies",
                " numbered three thousand while three hundred out",
                " of their army of one thousand had",
                " departed they began to lose heart. It",
                " was on this occasion that the Prophet",
                " spoke these words to them."
            ]
        },
        {
            "id": "[3:125]",
            "verse": "Yes, if you remain patient and conscious of Allah and the enemy come upon you [attacking] in rage, your Lord will reinforce you with five thousand angels having marks [of distinction]",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:126]",
            "verse": "And Allah made it not except as [a sign of] good tidings for you and to reassure your hearts thereby. And victory is not except from Allah, the Exalted in Might, the Wise -",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:127]",
            "verse": "That He might cut down a section of the disbelievers or suppress them so that they turn back disappointed.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:128]",
            "verse": "Not for you, [O Muhammad, but for Allah], is the decision whether He should [cut them down] or forgive them or punish them, for indeed, they are wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:129]",
            "verse": "And to Allah belongs whatever is in the heavens and whatever is on the earth. He forgives whom He wills and punishes whom He wills. And Allah is Forgiving and Merciful.",
            "description": [
                "When the Prophet was injured he uttered",
                " words of imprecation against the unbelievers: 'How",
                " can a people that injures its own",
                " Prophet attain salvation?' These verses are in",
                " response to that utterance."
            ]
        },
        {
            "id": "[3:130]",
            "verse": "O you who have believed, do not consume usury, doubled and multiplied, but fear Allah that you may be successful.",
            "description": [
                "The major cause of the setback suffered",
                " at Uhud was that precisely at the",
                " moment of their victory the Muslims succumbed",
                " to the desire for worldly possessions, and",
                " turned to collecting booty rather than completing",
                " their task of crushing the enemy. Hence",
                " God thought fit to raise a barrier",
                " against this excessive adoration of money, and",
                " to urge them to give up usury",
                " which keeps man constantly absorbed in considering",
                " ways and means of amassing wealth and",
                " generally whets his appetite for money."
            ]
        },
        {
            "id": "[3:131]",
            "verse": "And fear the Fire, which has been prepared for the disbelievers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:132]",
            "verse": "And obey Allah and the Messenger that you may obtain mercy.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:133]",
            "verse": "And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:134]",
            "verse": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good;",
            "description": [
                "The existence of interest in a society",
                " generates two kinds of moral disease. It",
                " breeds greed and avarice, meanness and selfishness",
                " among those who receive interest. At the",
                " same time, those who have to pay",
                " interest develop strong feelings of hatred, resentment,",
                " spite and jealousy. God intimates to the",
                " believers that the attributes bred by the",
                " spread of interest are the exact opposite",
                " of those which develop as a result",
                " of spending in the way of God,",
                " and that it is through the latter",
                " rather than the former that man can",
                " achieve God's forgiveness and Paradise. (For further",
                " explanation see Surah 2, n. 320 above.)",
                ""
            ]
        },
        {
            "id": "[3:135]",
            "verse": "And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins - and who can forgive sins except Allah? - and [who] do not persist in what they have done while they know.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:136]",
            "verse": "Those - their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:137]",
            "verse": "Similar situations [as yours] have passed on before you, so proceed throughout the earth and observe how was the end of those who denied.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:138]",
            "verse": "This [Qur'an] is a clear statement to [all] the people and a guidance and instruction for those conscious of Allah.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:139]",
            "verse": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:140]",
            "verse": "If a wound should touch you - there has already touched the [opposing] people a wound similar to it. And these days [of varying conditions] We alternate among the people so that Allah may make evident those who believe and [may] take to Himself from among you martyrs - and Allah does not like the wrongdoers -",
            "description": [
                "This alludes to the Battle of Badr.",
                " The intention is to point out to",
                " the Muslims that if the unbelievers were",
                " not demoralized by the setback they suffered",
                " at Badr then the Muslims should not",
                " be disheartened by the setback thev suffered",
                " in the Battle of Uhud.",
                "*101). The",
                " actual words of this verse, can be",
                " interpreted in two ways. One meaning could",
                " be that God wanted to select some",
                " of them so that He could bestow",
                " upon them the honour of martyrdom. The",
                " second meaning could be that out of",
                " the hotch-potch of true believers and hypocrites",
                " which their community consisted of at that",
                " moment, God wanted to sift those who",
                " were truly His witnesses over all mankind.",
                " (See Qur'an 2: 143 - Ed.)"
            ]
        },
        {
            "id": "[3:141]",
            "verse": "And that Allah may purify the believers [through trials] and destroy the disbelievers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:142]",
            "verse": "Or do you think that you will enter Paradise while Allah has not yet made evident those of you who fight in His cause and made evident those who are steadfast?",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:143]",
            "verse": "And you had certainly wished for martyrdom before you encountered it, and you have [now] seen it [before you] while you were looking on.",
            "description": [
                "This is with reference to those Companions",
                " who had urged the Prophet to go",
                " out of Madina and take on the",
                " enemy there because of their ardent desire",
                " for martyrdom. (See Ibn Sa'd, Tabaqat, vol.",
                " 2, p. 38 - Ed.)"
            ]
        },
        {
            "id": "[3:144]",
            "verse": "Muhammad is not but a messenger. [Other] messengers have passed on before him. So if he was to die or be killed, would you turn back on your heels [to unbelief]? And he who turns back on his heels will never harm Allah at all; but Allah will reward the grateful.",
            "description": [
                "When the rumour of the Prophet's martyrdom",
                " spread during the battle, it disheartened most",
                " of the Companions. The hypocrites who were",
                " in the Muslim camp began to advise",
                " the believers to approach 'Abd Allah b.",
                " Ubayy so that he might secure protection",
                " for them from Abu Sufyan. Some went",
                " so far as to say that had",
                " Muhammad really been the Messenger of God",
                " he would not have been put to",
                " death, and for that reason they counselled",
                " people to revert to their ancestral faith.",
                " It is in this context that the",
                " Muslims are now told that if their",
                " devotion to the truth is wholly bound",
                " up with the person of Muhammad (peace",
                " be on him), and if their submission",
                " to God is so lukewarm that his",
                " demise would cause them to plunge back",
                " into the disbelief they had cast off,",
                " then they should bear in mind the",
                " fact that Islam does not need them.",
                ""
            ]
        },
        {
            "id": "[3:145]",
            "verse": "And it is not [possible] for one to die except by permission of Allah at a decree determined. And whoever desires the reward of this world - We will give him thereof; and whoever desires the reward of the Hereafter - We will give him thereof. And we will reward the grateful.",
            "description": [
                "The purpose of this directive is to",
                " bring home to the Muslims that it",
                " would be futile for them to try",
                " to flee from death. No one can",
                " either die before or survive the moment",
                " determined for death by God. Hence one",
                " should not waste one's time thinking how",
                " to escape death. Instead, one should take",
                " stock of one's activities and see whether",
                " one's efforts have either been directed merely",
                " to one's well-being in this world or",
                " to well-being in the Hereafter.",
                "*105). The",
                " word thawab denotes recompense and reward. The",
                " 'reward of this world' signifies the totality",
                " of benefits and advantages which a man",
                " receives as a consequence of his actions",
                " and efforts within the confines of this",
                " world. The 'reward of the Other World'",
                " denotes the benefits that a man will",
                " receive in the lasting World to Come",
                " as the fruits of his actions and",
                " efforts. From the Islamic point of view,",
                " the crucial question bearing upon human morals",
                " is whether a man keeps his attention",
                " focused on the worldly results of his",
                " endeavours or on the results which will",
                " acrue to him in the Next World.",
                "",
                "*106). The 'ones who are grateful' are",
                " those who fully appreciate God's favour in",
                " making the true religion available to them,",
                " and thereby intimating to them knowledge of",
                " a realm that is infinitely vaster than",
                " this world. Such people appreciate that God",
                " has graciously informed them of the truth",
                " so that the consequences of human endeavour",
                " are not confined to the brief span",
                " of earthly life but cover a vast",
                " expanse, embracing both the present life and",
                " the much more important life of the",
                " Hereafter. A grateful man is he who,",
                " having gained this breadth of outlook and",
                " having developed this long-range perception of the",
                " ultimate consequences of things, persists in acts",
                " of righteousness out of his faith in",
                " God and his confidence in God's assurance",
                " that they will bear fruit in the",
                " Hereafter. He does so even though he",
                " may sometimes find that, far from bearing",
                " fruit, righteousness leads to privation and suffering",
                " in this world. The ungrateful ones are",
                " those who persist in a narrow preoccupation",
                " with earthly matters. They are those who",
                " disregard the evil consequences of unrighteousness in",
                " the Hereafter, seizing everything which appears to",
                " yield benefits and advantages in this world,",
                " and who are not prepared to devote",
                " their time and energy to those acts",
                " of goodness which promise to bear fruit",
                " in the Hereafter and which are either",
                " unlikely to yield earthly advantages or are",
                " fraught with risks. Such people are ungrateful",
                " and lack appreciation of the valuable knowledge",
                " vouchsafed to them by God."
            ]
        },
        {
            "id": "[3:146]",
            "verse": "And how many a prophet [fought and] with him fought many religious scholars. But they never lost assurance due to what afflicted them in the cause of Allah, nor did they weaken or submit. And Allah loves the steadfast.",
            "description": [
                "They did not surrender to the followers",
                " of falsehood merely because of their numerical",
                " inferiority and lack of resources."
            ]
        },
        {
            "id": "[3:147]",
            "verse": "And their words were not but that they said, \"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:148]",
            "verse": "So Allah gave them the reward of this world and the good reward of the Hereafter. And Allah loves the doers of good.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:149]",
            "verse": "O you who have believed, if you obey those who disbelieve, they will turn you back on your heels, and you will [then] become losers.",
            "description": [
                "That is, they would push them back",
                " into the same state of unbelief from",
                " which they had extricated themselves. Since the",
                " Battle of Uhud the hypocrites and the",
                " Jews had constantly propagated the idea that,",
                " had Muhammad been a true Prophet, he",
                " would not have suffered the reverse that",
                " he encountered in that battle. This reverse",
                " was offered as proof that Muhammad (peace",
                " be on him) was an ordinary person",
                " whose fortunes varied, like those of other",
                " men, between victory and defeat. They further",
                " contended that the support and patronage of",
                " God which Muhammad claimed to enjoy was",
                " a sham."
            ]
        },
        {
            "id": "[3:150]",
            "verse": "But Allah is your protector, and He is the best of helpers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:151]",
            "verse": "We will cast terror into the hearts of those who disbelieve for what they have associated with Allah of which He had not sent down [any] authority. And their refuge will be the Fire, and wretched is the residence of the wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:152]",
            "verse": "And Allah had certainly fulfilled His promise to you when you were killing the enemy by His permission until [the time] when you lost courage and fell to disputing about the order [given by the Prophet] and disobeyed after He had shown you that which you love. Among you are some who desire this world, and among you are some who desire the Hereafter. Then he turned you back from them [defeated] that He might test you. And He has already forgiven you, and Allah is the possessor of bounty for the believers.",
            "description": [
                "The failure of the Muslims was of",
                " such a serious nature that had God",
                " not pardoned them they might have been",
                " obliterated there and then. It was out",
                " of God's grace, support and patronage that",
                " after the Muslims had been overpowered by",
                " the enemy the latter were seized with",
                " perplexity and confusion, and withdrew."
            ]
        },
        {
            "id": "[3:153]",
            "verse": "[Remember] when you [fled and] climbed [the mountain] without looking aside at anyone while the Messenger was calling you from behind. So Allah repaid you with distress upon distress so you would not grieve for that which had escaped you [of victory and spoils of war] or [for] that which had befallen you [of injury and death]. And Allah is [fully] Acquainted with what you do.",
            "description": [
                "When subjected to a sudden two-pronged attack",
                " the Muslims scattered; some fled to Madina",
                " while others climbed Mount Uhud. Despite this,",
                " the Prophet (peace be on him) did",
                " not move from his position. The enemy",
                " surrounded him on all sides and only",
                " a small party of ten to twelve",
                " followers was left with him. Even at",
                " that critical moment his feet remained firm",
                " and he continued to summon his fleeing",
                " followers towards himself. (See Waqidi, Maghazi, vol.",
                " 1, pp. 237, 240 and 241 -",
                " Ed.)",
                "*111). The 'grief referred to in",
                " this verse had many causes: (i) by",
                " the setback the Muslims suffered on the",
                " battlefield and by the rumour that the",
                " Prophet (peace be on him) had been",
                " martyred; (ii) by the fact that a",
                " large number of believers had been killed",
                " and wounded; and (iii) by the fact",
                " that nothing was known about what was",
                " happening to the Muslim families left behind",
                " in Madina. For it was possible that",
                " the enemy was greater in numbers than",
                " the total population of Madina, and that",
                " it might break through the defences of",
                " the battered"
            ]
        },
        {
            "id": "[3:154]",
            "verse": "Then after distress, He sent down upon you security [in the form of] drowsiness, overcoming a faction of you, while another faction worried about themselves, thinking of Allah other than the truth - the thought of ignorance, saying, \"Is there anything for us [to have done] in this matter?\" Say, \"Indeed, the matter belongs completely to Allah.\" They conceal within themselves what they will not reveal to you. They say, \"If there was anything we could have done in the matter, some of us would not have been killed right here.\" Say, \"Even if you had been inside your houses, those decreed to be killed would have come out to their death beds.\" [It was] so that Allah might test what is in your breasts and purify what is in your hearts. And Allah is Knowing of that within the breasts.",
            "description": [
                "A strange phenomenon was then experienced by",
                " certain Muslim soldiers. Abu Talhah, who took",
                " part in the battle, states that the",
                " Muslims were seized by such drowsiness that",
                " their swords were slipping from their hands.",
                " (For several Traditions stating this incident, including",
                " one related by Abu Talhah, see Waqidi,",
                " Maghazi, vol. 1, pp. 295-6 - Ed.)",
                ""
            ]
        },
        {
            "id": "[3:155]",
            "verse": "Indeed, those of you who turned back on the day the two armies met, it was Satan who caused them to slip because of some [blame] they had earned. But Allah has already forgiven them. Indeed, Allah is Forgiving and Forbearing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:156]",
            "verse": "O you who have believed, do not be like those who disbelieved and said about their brothers when they traveled through the land or went out to fight, \"If they had been with us, they would not have died or have been killed,\" so Allah makes that [misconception] a regret within their hearts. And it is Allah who gives life and causes death, and Allah is Seeing of what you do.",
            "description": [
                "Such ideas had no solid ground. God's",
                " decree regarding the time of one's death",
                " cannot be deferred. Those who lack faith",
                " in God and think that everything is",
                " dependent on their own scheming and effort",
                " rather than on the overpowering Will of",
                " God become victims of perpetual remorse, since",
                " they never cease to reflect how a",
                " slightly different circumstance or slightly altered strategy",
                " could have led to an altogether different",
                " and wholesome result."
            ]
        },
        {
            "id": "[3:157]",
            "verse": "And if you are killed in the cause of Allah or die - then forgiveness from Allah and mercy are better than whatever they accumulate [in this world].",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:158]",
            "verse": "And whether you die or are killed, unto Allah you will be gathered.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:159]",
            "verse": "So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him].",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:160]",
            "verse": "If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:161]",
            "verse": "It is not [attributable] to any prophet that he would act unfaithfully [in regard to war booty]. And whoever betrays, [taking unlawfully], will come with what he took on the Day of Resurrection. Then will every soul be [fully] compensated for what it earned, and they will not be wronged.",
            "description": [
                "When the archers, whom the Prophet had",
                " posted to defend the army against any",
                " attack from the rear, saw that the",
                " spoils of the enemy were being collected,",
                " they feared that the spoils might fall",
                " in their entirety to the lot of",
                " the soldiers who were then collecting them,",
                " and that they might, therefore, be deprived",
                " of their share. It was this idea",
                " which had impelled them to leave their",
                " posts. When the Prophet returned to Madina",
                " after the battle he asked them to",
                " explain the cause of their disobedience. When",
                " he had heard their unconvincing stories he",
                " told them: 'You thought that we would",
                " act dishonestly and would not deliver you",
                " your share.' (See Alusi. Ruh al-Ma'ani, commentary",
                " on this verse - Ed.) The verse",
                " alludes to this here. The purpose is",
                " to impress upon them that the Messenger",
                " of God himself was the commander of",
                " their army and that all their affairs",
                " were in his hands alone. What made",
                " them feel that their interests were not",
                " secure even in the hands of God's",
                " Messenger? Did they think that a division",
                " of spoils under the direct supervision of",
                " the Prophet Would be made in any",
                " manner other than that dictated by absolute",
                " honesty, trustworthiness and justice?"
            ]
        },
        {
            "id": "[3:162]",
            "verse": "So is one who pursues the pleasure of Allah like one who brings upon himself the anger of Allah and whose refuge is Hell? And wretched is the destination.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:163]",
            "verse": "They are [varying] degrees in the sight of Allah, and Allah is Seeing of whatever they do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:164]",
            "verse": "Certainly did Allah confer [great] favor upon the believers when He sent among them a Messenger from themselves, reciting to them His verses and purifying them and teaching them the Book and wisdom, although they had been before in manifest error.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:165]",
            "verse": "Why [is it that] when a [single] disaster struck you [on the day of Uhud], although you had struck [the enemy in the battle of Badr] with one twice as great, you said, \"From where is this?\" Say, \"It is from yourselves.\" Indeed, Allah is over all things competent.",
            "description": [
                "The more high ranking Companions were too",
                " well aware of reality to fall prey",
                " to any misunderstandings. The ordinary believers, however,",
                " had thought that as long as God's",
                " Messenger was in their midst and as",
                " long as they enjoyed God's support and",
                " help the unbeliever, could never triumph over",
                " them. Hence, when they suffered defeat at",
                " the Battle of Uhud, their expectations were",
                " shaken and they began to wonder why",
                " things had taken the course they had.",
                " They wondered why they had been defeated",
                " even though they had fought for the",
                " sake of God's true religion with God's",
                " support, and the Messenger of God was",
                " with them on the battlefield. Furthermore, they",
                " were worried that the defeat had been",
                " at the hands of those who were",
                " out to destroy God's true religion. These",
                " verses seek to allay this sense of",
                " anxiety and rid their minds of doubt",
                " and suspicion.",
                "*116). In the Battle of",
                " Uhud seventy Muslims were martyred. In the",
                " Battle of Badr. seventy unbelievers were killed",
                " and seventy taken as captives.",
                "*117). The",
                " calamity that had befallen them was the",
                " outcome of their own weaknesses and mistakes.",
                " They had not remained sufficiently patient, they",
                " had acted, in certain respects, in a",
                " manner inconsistent with the dictates of piety,",
                " they had disobeyed the command that had",
                " been given them, they were lured by",
                " material wealth and they disputed and quarrelled",
                " among them-selves. After all this, was it",
                " still necessary to ask what caused the",
                " debacle?",
                "*118). If God has the power",
                " to make them victorious He also has",
                " the power to bring about their defeat.",
                ""
            ]
        },
        {
            "id": "[3:166]",
            "verse": "And what struck you on the day the two armies met was by permission of Allah that He might make evident the [true] believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:167]",
            "verse": "And that He might make evident those who are hypocrites. For it was said to them, \"Come, fight in the way of Allah or [at least] defend.\" They said, \"If we had known [there would be] fighting, we would have followed you.\" They were nearer to disbelief that day than to faith, saying with their mouths what was not in their hearts. And Allah is most Knowing of what they conceal -",
            "description": [
                "When 'Abd Allah b. Ubayy decided to",
                " withdraw from the battlefield with his men",
                " several Muslims attempted to persuade him not",
                " to do so. Ibn Ubayy replied that",
                " he was sure that there would be",
                " no fighting that day, and he assured",
                " them that had he expected fighting to",
                " take place, he would have gone along",
                " with them."
            ]
        },
        {
            "id": "[3:168]",
            "verse": "Those who said about their brothers while sitting [at home], \"If they had obeyed us, they would not have been killed.\" Say, \"Then prevent death from yourselves, if you should be truthful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:169]",
            "verse": "And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision,",
            "description": [
                "For an explanation see Surah 2. n.",
                " 155 above."
            ]
        },
        {
            "id": "[3:170]",
            "verse": "Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them - that there will be no fear concerning them, nor will they grieve.",
            "description": [
                "There is a Tradition from the Prophet",
                " that he who leaves the world after",
                " having lived righteously is greeted with a",
                " life so felicitous that he never wishes",
                " to return to the world. The only",
                " exception to this are martyrs who wish",
                " to be sent back to the world",
                " so that they may once again attain",
                " martyrdom and thereby enjoy that unique joy,",
                " bliss and ecstasy which one experiences at",
                " the time of laying down one's life",
                " for God. (Ahmad b. Hanbal, Musnad, vol.",
                " Ill, 103, 126, 153, 173, 251, 276,",
                " 278, 284, 289; Bukhari, 'Tafsir al-Qur'an', 6",
                " and 21: Muslim, 'Al-Imarah', 108, 109. 121",
                " - Ed.)"
            ]
        },
        {
            "id": "[3:171]",
            "verse": "They receive good tidings of favor from Allah and bounty and [of the fact] that Allah does not allow the reward of believers to be lost -",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:172]",
            "verse": "Those [believers] who responded to Allah and the Messenger after injury had struck them. For those who did good among them and feared Allah is a great reward -",
            "description": [
                "When, after the Battle of Uhud, the",
                " Makkan polytheists had travelled several stages of",
                " their journey, they began to tell themselves",
                " what a mistake they had made in",
                " allowing the opportunity to crush the power",
                " of Muhammad to slip out of their",
                " hands. At one place they halted and",
                " deliberated among themselves about launching a second",
                " attack on Madina. They failed, however, to",
                " muster sufficient courage and carried on to",
                " Makka. The Prophet, for his part, also",
                " realized that they might attack once again.",
                " On the second day of Uhud, therefore,",
                " he gathered the Muslims and urged them",
                " to pursue the unbelievers. Even though this",
                " was a highly critical moment, the true",
                " men of faith girded their loins and",
                " were prepared to lay down their lives",
                " at the behest of the Prophet. They",
                " accompanied him to Hamra' al-Asad, eight miles",
                " from Madina. The present verse refers to",
                " these dedicated men.",
                "*123). These few verses",
                " were revealed almost one year after the",
                " Battle of Uhud. As they are connected",
                " with the events of the battle they",
                " were included in the present discourse."
            ]
        },
        {
            "id": "[3:173]",
            "verse": "Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [merely] increased them in faith, and they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:174]",
            "verse": "So they returned with favor from Allah and bounty, no harm having touched them. And they pursued the pleasure of Allah, and Allah is the possessor of great bounty.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:175]",
            "verse": "That is only Satan who frightens [you] of his supporters. So fear them not, but fear Me, if you are [indeed] believers.",
            "description": [
                "While returning from the Battle of Uhud,",
                " Abu Sufyan challenged the Muslims to another",
                " encounter at Badr the following year. But",
                " when the appointed time arrived, Abu Sufyan's",
                " courage failed him on account of the",
                " famine prevailing in Makka that year. As",
                " a face-saving device he arranged to send",
                " an agent to Madina who spread the",
                " rumour that tremendous war preparations were afoot",
                " among the Quraysh, and that they were",
                " trying to muster a huge army which",
                " would be so powerful that no other",
                " power in the whole of Arabia would",
                " resist it. The purpose of this rumour",
                " was to overawe the Muslims and discourage",
                " them from advancing towards Makka, so that",
                " when the confrontation did not take place",
                " it would be blamed on the timidity",
                " of the Muslims. The effect of this",
                " measure was such that when the Prophet",
                " (peace be on him) urged the Muslims",
                " to accompany him to Badr the initial",
                " response was not encouraging. Finally, the Prophet",
                " publicly announced that if no one would",
                " accompany him, he would go alone. In",
                " response, fifteen hundred devotees expressed their willingness",
                " and accompanied him to Badr. Abu Sufyan",
                " set out with two thousand men but",
                " after travelling for two days he told",
                " his men that it seemed unwise to",
                " fight and that they would return the",
                " following year for the proposed encounter. Thus",
                " he and his men retreated. The Prophet",
                " and his Companions stayed at Badr for",
                " eight days awaiting the threatened encounter. Meanwhile,",
                " they conducted business with a trade caravan",
                " which yielded them considerable profit. Later, when",
                " it became known that the unbelievers had",
                " gone back to Makka, the Prophet returned",
                " to Madina. (See Ibn Hisham, vol. 2,",
                " pp. 209 f.; Ibn Ishaq, Life of",
                " Muhammad, pp. 447 f. - Ed.)"
            ]
        },
        {
            "id": "[3:176]",
            "verse": "And do not be grieved, [O Muhammad], by those who hasten into disbelief. Indeed, they will never harm Allah at all. Allah intends that He should give them no share in the Hereafter, and for them is a great punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:177]",
            "verse": "Indeed, those who purchase disbelief [in exchange] for faith - never will they harm Allah at all, and for them is a painful punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:178]",
            "verse": "And let not those who disbelieve ever think that [because] We extend their time [of enjoyment] it is better for them. We only extend it for them so that they may increase in sin, and for them is a humiliating punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:179]",
            "verse": "Allah would not leave the believers in that [state] you are in [presently] until He separates the evil from the good. Nor would Allah reveal to you the unseen. But [instead], Allah chooses of His messengers whom He wills, so believe in Allah and His messengers. And if you believe and fear Him, then for you is a great reward.",
            "description": [
                "That is, God does not want to",
                " see the Muslim community in a hotch-potch",
                " condition with the true men of faith",
                " indistinguishable from the hypocrites.",
                "*126). This means",
                " that God does not resort to revelation",
                " to provide information as to whether specific",
                " individuals are true men of faith or",
                " hypocrites. God creates, instead, certain situations in",
                " which the faith of those who profess",
                " to believe is severely tested. The result",
                " is that the man of faith stands",
                " out clearly from the hypocrite."
            ]
        },
        {
            "id": "[3:180]",
            "verse": "And let not those who [greedily] withhold what Allah has given them of His bounty ever think that it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection. And to Allah belongs the heritage of the heavens and the earth. And Allah, with what you do, is [fully] Acquainted.",
            "description": [
                "Everything in the heavens and the earth",
                " belongs to God alone. Hence the possession",
                " and use of anything by man is",
                " purely transient. For everyone will be dispossessed",
                " of his temporary belongings, and everything will",
                " ultimately return to and abide with God.",
                " If anyone therefore spends openheartedly in the",
                " way of God out of his temporary",
                " possessions he does so from property which,",
                " ultimately, belongs to God alone. Anyone who",
                " hoards his possessions and fails to spend",
                " them in the way of God is",
                " indeed stupid."
            ]
        },
        {
            "id": "[3:181]",
            "verse": "Allah has certainly heard the statement of those [Jews] who said, \"Indeed, Allah is poor, while we are rich.\" We will record what they said and their killing of the prophets without right and will say, \"Taste the punishment of the Burning Fire.",
            "description": [
                "This statement was made by the Jews.",
                " On the revelation of the Qur'anic verse",
                " (2: 245): 'Who of you will lend",
                " Allah a goodly loan?', the Jews began",
                " to ridicule it and said: 'Look, God",
                " has now gone bankrupt and has begun",
                " to beg of His creatures for loans.'",
                " (For this statement made by the Jews",
                " see the Tradition mentioned by Ibn Kathir",
                " in his comments on this verse -",
                " Ed.)"
            ]
        },
        {
            "id": "[3:182]",
            "verse": "That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:183]",
            "verse": "[They are] those who said, \"Indeed, Allah has taken our promise not to believe any messenger until he brings us an offering which fire [from heaven] will consume.\" Say, \"There have already come to you messengers before me with clear proofs and [even] that of which you speak. So why did you kill them, if you should be truthful?\"",
            "description": [
                "The Bible mentions at several places that",
                " the token of Divine acceptance of a",
                " person's sacrificial offering was the appearance of",
                " a mysterious fire which consumed the offering.",
                " (See Judges 6: 20-1 and 13: 19-20;",
                " 2 Chronicles 7: 1-2.) The Bible does",
                " not state, however, that the consuming fire",
                " was an indispensable token of prophethood and",
                " that anyone not endowed with that miracle",
                " could not be a Prophet. The Jews",
                " in discussing the claim of Muhammad (peace",
                " be on him) to be a Messenger",
                " of God brought up the question of",
                " this miraculous sign, and used it as",
                " a pretext for denying that claim. There",
                " was even clearer evidence of the Jews'",
                " hostility to Truth: they had not hesitated",
                " to murder a number of Prophets who",
                " had been endowed with the miracle of",
                " consuming fire. The Bible mentions, for example,",
                " the Prophet Elijah who had challenged the",
                " worshippers of Ba'l to sacrifice a bull,",
                " promising that he too would sacrifice a",
                " bull. He stated that the offering of",
                " the one who was truthful would be",
                " consumed by the miraculous fire. The confrontation",
                " took place before a large crowd and",
                " it was Elijah's sacrifice which was consumed",
                " by the fire. This so antagonized the",
                " Ba'1-worshipping Queen that the henpecked King decided",
                " to put the Prophet Elijah to death.",
                " Elijah was forced to leave his homeland",
                " and take refuge in the mountains of",
                " Sinai. (See 1 Kings 18 and 19.)",
                " The Jews are told in effect: 'How",
                " dare you ask for the miracle of",
                " the consuming fire when in the past",
                " you have not even refrained from murdering",
                " Prophets who performed that miracle?'"
            ]
        },
        {
            "id": "[3:184]",
            "verse": "Then if they deny you, [O Muhammad] - so were messengers denied before you, who brought clear proofs and written ordinances and the enlightening Scripture.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:185]",
            "verse": "Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained [his desire]. And what is the life of this world except the enjoyment of delusion.",
            "description": [
                "Whoever considers the effects of his actions",
                " in this earthly life to be of",
                " crucial significance, and sees in them the",
                " criteria of right and wrong, the criteria",
                " of that which leads either to one's",
                " ultimate salvation or to one's doom, falls",
                " prey to a serious misconception. The fact",
                " that a person is outstandingly successful in",
                " life does not necessarily prove that he",
                " is either not prove that he has",
                " either strayed from the right way or",
                " is out of favour with God. The",
                " earthly results of a man's actions are",
                " often quite different from the ones he",
                " will see in the Next Life. What",
                " is of true importance is what will",
                " happen in that eternal life rather than",
                " in this transient one."
            ]
        },
        {
            "id": "[3:186]",
            "verse": "You will surely be tested in your possessions and in yourselves. And you will surely hear from those who were given the Scripture before you and from those who associate others with Allah much abuse. But if you are patient and fear Allah - indeed, that is of the matters [worthy] of determination.",
            "description": [
                "Muslims should not lose their self-control in",
                " the face of the Jews' invidious taunts",
                " and slander. The Jews' accusations, debased talk",
                " and false propaganda should not provoke the",
                " Muslims into adopting a posture either inconsistent",
                " with truth and justice or with the",
                " dignity, decorum and high standards of moral",
                " conduct that become men of faith."
            ]
        },
        {
            "id": "[3:187]",
            "verse": "And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\" But they threw it away behind their backs and exchanged it for a small price. And wretched is that which they purchased.",
            "description": [
                "Although the Jews remembered that some Prophets",
                " had been endowed with the miracle of",
                " consuming fire, they conveniently forgot their covenant",
                " with God at the time they were",
                " entrusted with the Scripture, and their mission",
                " as the bearers of the Scripture. The",
                " 'covenant' to which this verse alludes is",
                " mentioned at several places in the Bible.",
                " In the last sermon of Moses, cited",
                " in Deuteronomy, he again and again calls",
                " the attention of Israel to the covenant",
                " in the following words: 'Hear, O Israel:",
                " The Lord our God is one Lord;",
                " and you shall love the Lord your",
                " God with all your heart, with all",
                " your soul, with all your might. And",
                " these words which I command shall be",
                " upon your heart; and you shall teach",
                " them diligently to your children, and shall",
                " talk of them when you sit in",
                " your house, and when you walk by",
                " the way, and when you lie down,",
                " and when you rise. And you shall",
                " bind them as a sign upon your",
                " hand, and they shall be as frontlets",
                " between your eyes. And you shall write",
                " them on the doorposts of your house",
                " and on your gates.' (Deuteronomy 6: 4-9.)",
                " Then, in his last testament Moses said:",
                " 'And on the day you pass over",
                " the Jordan to the land which the",
                " Lord your God gives you, you shall",
                " set up large stones, and plaster them",
                " with plaster and you shall write upon",
                " them all the words of this law,",
                " when you pass over to enter the",
                " land which the Lord your God gives",
                " you, a land flowing with milk and",
                " honey, as the Lord, the God of",
                " your fathers, has promised you. And when",
                " you have passed over the Jordan, you",
                " shall set up these stones, concerning which",
                " I command you this day, on Mount",
                " Ebal, and you shall plaster them with",
                " plaster.' (Deuteronomy 27: 2-4.) When the Levites",
                " were handed a copy of the Torah,",
                " they were instructed to gather men, women",
                " and children every seventh year on the",
                " occasion of the Feast of Tabernacles and",
                " to recite the entire text to them.",
                " But their indifference to the Book of",
                " God grew to such a point that",
                " seven hundred years later even the priests",
                " of the Temple of Solomon and the",
                " Jewish ruler of Jerusalem did not know",
                " that they had the Book of God",
                " with them. (See 2 Kings 22: 8-13.)",
                ""
            ]
        },
        {
            "id": "[3:188]",
            "verse": "And never think that those who rejoice in what they have perpetrated and like to be praised for what they did not do - never think them [to be] in safety from the punishment, and for them is a painful punishment.",
            "description": [
                "Such people expected praises to be lavished",
                " upon them for being God-fearing, devout and",
                " pious, for being sincere servants of the",
                " true faith, for being defenders of God's",
                " Law and for having reformed and purified",
                " the lives of people, even though none",
                " of this might be true. They wanted",
                " people to go about trumpeting that such",
                " and such a person had made great",
                " sacrifices in the cause of God and",
                " had sincerely guided people to the right",
                " way even though the facts might be",
                " the reverse of what they claimed."
            ]
        },
        {
            "id": "[3:189]",
            "verse": "And to Allah belongs the dominion of the heavens and the earth, and Allah is over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:190]",
            "verse": "Indeed, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding.",
            "description": [
                "This section constitutes the conclusion of the",
                " present surah. It is related not so",
                " much to the verses which immediately precede",
                " it as to the entire surah. In",
                " order to grasp its significance one should",
                " particularly bear in mind our introductory remarks",
                " to this surah. (See pp. 229 ff.",
                " above.)"
            ]
        },
        {
            "id": "[3:191]",
            "verse": "Who remember Allah while standing or sitting or [lying] on their sides and give thought to the creation of the heavens and the earth, [saying], \"Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.",
            "description": [
                "This means that with the help of",
                " those signs one can easily arrive at",
                " the Truth, provided one is not indifferent",
                " to God and looks at the phenomenon",
                " of the universe thoughtfully.",
                "*136). When people",
                " look carefully at the order of the",
                " universe, it becomes clear to them that",
                " it is an order permeated by wisdom",
                " and intelligent purpose. It is altogether inconsistent",
                " with wisdom that the man endowed with",
                " moral consciousness and freedom of choice, the",
                " man gifted with reason and discretion, should",
                " not be held answerable for his deeds.",
                " This kind of reflection leads people to",
                " develop a strong conviction that the After-life",
                " is a reality. Thanks to this conviction,",
                " they begin to seek God's refuge from",
                " His punishment."
            ]
        },
        {
            "id": "[3:192]",
            "verse": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:193]",
            "verse": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
            "description": [
                "Many eras have passed before you. Go",
                " about, then, in the land and behold",
                " the end of those who gave the",
                " lie to (the directives and ordinances of",
                " Allah)."
            ]
        },
        {
            "id": "[3:194]",
            "verse": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\"",
            "description": [
                "Such people do not doubt the fact",
                " that God will fulfil His promises. What",
                " they do doubt is whether they will",
                " be reckoned among those for whom those",
                " promises were made. Hence they pray to",
                " God to make them worthy of His",
                " promised rewards. They are afraid lest they",
                " remain targets of slander and ridicule by",
                " the unbelievers in this world, and then",
                " be disgraced in the Hereafter before the",
                " same unbelievers who may mock them once",
                " again saying that their faith has been",
                " of no avail to them."
            ]
        },
        {
            "id": "[3:195]",
            "verse": "And their Lord responded to them, \"Never will I allow to be lost the work of [any] worker among you, whether male or female; you are of one another. So those who emigrated or were evicted from their homes or were harmed in My cause or fought or were killed - I will surely remove from them their misdeeds, and I will surely admit them to gardens beneath which rivers flow as reward from Allah, and Allah has with Him the best reward.\"",
            "description": [
                "All humans are equal in the sight",
                " of God. God does not have separate",
                " criteria for judging the male and the",
                " female, the master and the slave, the",
                " high and the low.",
                "*140). It is",
                " reported that some non-Muslims came to the",
                " Prophet and said that Moses had produced",
                " his staff and had been endowed with",
                " the miracle of the shining hand (see",
                " Qur'an 7: 108; 20: 22), and that",
                " Jesus restored sight to the blind and",
                " cured the lepers (see Qur'an 31 49).",
                " Other Prophets had also been granted miracles.",
                " What miracles, they enquired, could the Prophet",
                " perform? In response the Prophet recited all",
                " the verses from verse 190 to the",
                " end of this surah, adding that that",
                " was what he had brought."
            ]
        },
        {
            "id": "[3:196]",
            "verse": "Be not deceived by the [uninhibited] movement of the disbelievers throughout the land.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:197]",
            "verse": "[It is but] a small enjoyment; then their [final] refuge is Hell, and wretched is the resting place.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:198]",
            "verse": "But those who feared their Lord will have gardens beneath which rivers flow, abiding eternally therein, as accommodation from Allah. And that which is with Allah is best for the righteous.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:199]",
            "verse": "And indeed, among the People of the Scripture are those who believe in Allah and what was revealed to you and what was revealed to them, [being] humbly submissive to Allah. They do not exchange the verses of Allah for a small price. Those will have their reward with their Lord. Indeed, Allah is swift in account.",
            "description": [
                ""
            ]
        },
        {
            "id": "[3:200]",
            "verse": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
            "description": [
                "The original Arabic word is \" sabiru\".",
                " This has two possible meanings. One is",
                " that whenever they are in confrontation with",
                " unbelievers, the believers should endure even greater",
                " hardships for their cause, and display a",
                " higher degree of fortitude than the unbelievers.",
                " The other is that the believers should",
                " try to excel one another in facing",
                " the opposition and hostility of unbelievers with",
                " courage and fortitude."
            ]
        }
    ]
}