{
    "name": "Luqman",
    "id": 31,
    "verse-count": 34,
    "verse-info": [
        {
            "verse-id": "[31:1]",
            "verse": "Alif, Lam, Meem.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[31:2]",
            "verse": "These are verses of the wise Book,",
            "description": [
                "That is, \"verses of the Book which",
                " is full of wisdom and whose every",
                " teaching is based on wisdom.\""
            ]
        },
        {
            "verse-id": "[31:3]",
            "verse": "As guidance and mercy for the doers of good",
            "description": [
                "That is, \"These verses give guidance to",
                " the Right Way and have been sent",
                " down as a mercy from God. But",
                " the people who can profit by this",
                " mercy and guidance are only those who",
                " adopt a righteous attitude, who wish to",
                " become good, who crave for their own",
                " well-being, whose quality is that they avoid",
                " the evil when they are warned of",
                " it, and follow the good when they",
                " are shown the ways to it. As",
                " for the wicked and mischievous people, they",
                " will neither profit by this guidance nor",
                " receive any share from this mercy. \"",
                ""
            ]
        },
        {
            "verse-id": "[31:4]",
            "verse": "Who establish prayer and give zakah, and they, of the Hereafter, are certain [in faith].",
            "description": [
                "It does not mean that \"the righteous",
                " people\" bear only these three qualities. By",
                " using the common epithet of \"righteous\" for",
                " them, it has been pointed out that",
                " they refrain from aII those evils which",
                " this Book forbids and practise aII those",
                " good things which this Book enjoins. Then,",
                " the three qualities of the \"righteous\" have",
                " been especially mentioned in order to show",
                " that alI other good acts depend on",
                " these three things. They establish the Salat",
                " which engenders God-worship and piety as a",
                " permanent habit with them; they pay the",
                " Zakat which strengthens the spirit of sacrifice",
                " in them, subdues the love of the",
                " world and arouses a desire for the",
                " goodwill of Allah; and they believe in",
                " the Hereafter, which instils the sense of",
                " responsibility _and answerability, which does not allow",
                " them to live like an animal, which",
                " is free to graze at will in",
                " the pasture, but like a man who",
                " is fully conscious of the fact that",
                " he is not independent but the slave",
                " of a Master before Whom he is",
                " answerable for all his activities of life.",
                " Owing to these three qualities, these \"righteous\"",
                " people are not the kind of the",
                " righteous persons who happen to do good",
                " just by chance, who may commit evil",
                " as often and as freely as they",
                " would do good. Contrary to this, these",
                " qualities inculcate in them an enduring system",
                " of thought and morality owing to which",
                " goodness issues forth from them in a",
                " regulated and systematic manner, and the evil,",
                " if at alI committed, is committed just",
                " by chance. They do not have any",
                " deep-rooted motives, which might be arising from",
                " their own system of thought and morality",
                " and leading them on to the evil",
                " way under their own nature impulse."
            ]
        },
        {
            "verse-id": "[31:5]",
            "verse": "Those are on [right] guidance from their Lord, and it is those who are the successful.",
            "description": [
                "At the time when these verses were",
                " sent down, the disbelieves of Makkah thought,",
                " and said so openly, that Muhammad (upon",
                " whom be Allah's peace) and those who",
                " accepted his message were wasting and mining",
                " their lives. Therefore, it was rejoined with",
                " full force and emphasis: \"..these are the",
                " ones who will attain true success.\" That",
                " is, 'They will not ruin themselves as",
                " you seem to dunk in your ignorance,",
                " but they in fact are the ones",
                " who alone will attain true success, and",
                " the utter failures will be those who",
                " have refused to adopt this way.\"",
                "Here",
                " the one who regards 'true success\" as",
                " confined to the world, in the sense",
                " of material prosperity, will be wholly missing",
                " the Qur'anic concept of it. To understand",
                " the real concept of the true success",
                " one should study the following verses of",
                " the Qur'an along with the relevant E.N.'s:",
                " AI-Baqarah: 2-5, AI-'Imran: 102, 130, 200, AI-Ma'idah:",
                " 35, 90, AI-An'am: 21, AI-A'raf; 7, 8,",
                " 157, At-Taubah: 88, Yunus: 17, An-Nahl: 116,",
                " Al-Hajj: 77, Al-Mu'minun: 117, An-Nur: ,51, Ar-Rum:",
                " 38."
            ]
        },
        {
            "verse-id": "[31:6]",
            "verse": "And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah without knowledge and who takes it in ridicule. Those will have a humiliating punishment.",
            "description": [
                "That is, \"On the one hand, there",
                " is this Mercy and Guidance sent down",
                " by Allah, of which some people arc",
                " taking full advantage, and on the other,",
                " there are also some unfortunate people living",
                " side by side with the fortunate ones,",
                " who are adopting this sort of attitude",
                " as against the Revelations of Allah. \"",
                "",
                "*6) The words lahv al-hadith in the",
                " Text imply such a thing as may",
                " allure and absorb a listener completely and",
                " make him heedless of everything else around",
                " him. Lexically, there is nothing derogatory in",
                " these words, but in custom and usage",
                " they apply to evil and useless and",
                " vain things, such as gossip, nonsensical talk,",
                " joking and jesting, legends and tales, singing",
                " and merry-making, etc.",
                "\"To buy\" alluring tales",
                " may also mean that the person concerned",
                " adopts falsehood instead of the Truth, turns",
                " away from the guidance and turns to",
                " those things which can neither benefit him",
                " in the world nor in the Hereafter.",
                " But this is the metaphorical meaning. The",
                " real meaning of the sentence is that",
                " a person should purchase an absurd and",
                " useless thing for his money, and this",
                " is supported by many traditions. Ibn Hisham",
                " has related on the authority of Ibn",
                " Ishaq that when the disbelievers of Makkah",
                " could not stop the message of the",
                " Holy Prophet from spreading in spite of",
                " their best efforts, Nadr bin Harith said",
                " to the people of Quraish: \"The way",
                " you are counteracting this man will avail",
                " you nothing. He has lived a lifetime",
                " among you. Until now he was the",
                " best of your men morally: he was",
                " the most truthful and the most trustworthy",
                " person among you. Now you say that",
                " he is a sorcerer and enchanter and",
                " a poet and a madman. Who will",
                " believe aII this? Don't the people know",
                " the way the sorcerers talk? Don't they",
                " know the enchanters and the way they",
                " conduct their business? Are they unaware of",
                " poetry and of. the states of madness?",
                " Which of these accusations sticks to Muhammad",
                " (upon whom be Allah's peace) by exploiting",
                " which you would turn the people's attention",
                " away from him? Look! I will tell",
                " you how to deal with him.\" Then",
                " he left Makkah for Iraq and managed",
                " to get from there legends and tales",
                " about the kings of Iran and Rustam",
                " and Isfandyar and started to arrange tale-telling",
                " parties to distract the people from the",
                " Qur'an and to absorb them in the",
                " tales. (Ibn Hisham. vol. I, pp. 320-321).",
                " The same tradition has been cited by",
                " Vahidi in Asbab un Nazul on the",
                " authority of Kalbi and Muqatil. And according",
                " to Ibn 'Abbas, Nadr had bough singing",
                " girls also for the purpose. Whenever he",
                " heard that someone was coming under the",
                " Holy Prophet's influence, he would impose a",
                " singing girl an him with the instruction:",
                " \"Feed him and entertain him with your",
                " songs so that he is absorbed in",
                " you and distracted from the other side.\"",
                " This was the same device which the",
                " arch-criminals of the nations have been employing",
                " in every age. They try to get",
                " the common people so absorbed in fun",
                " and sport and musical entertainment's in the",
                " name of culture that they are left",
                " with no time and sense to attend",
                " to the serious problems of life, and",
                " in their heedlessness they do not even",
                " feel what destruction they are being driven",
                " to.",
                "The same commentary of lahv al-hadith",
                " has been reported from a large number",
                " of the Companions and their immediate followers.",
                " 'Abdullah bin Mas'ud was asked, 'What does",
                " lahv al-hadith mean in this verse ?\"",
                " He said thrice emphatically. 'By God! it",
                " means singing.\" (Ibn Jarir, Ibn Abi Shaibah.",
                " Hakim, Baihaqi). Similar traditions have been reported",
                " from scholars like 'Abdullah bin' Abbas, Jabir",
                " bin 'Abdullah, Mujahid, 'Ikrimah, Said bin Jubair,",
                " Hasan Basri: and Makhul. Ibn Jarir, Ibn",
                " Abi Hatim and Tirmidhi have related on",
                " the authority of Hadrat Abu Umamah Baheli",
                " that the Holy Prophet said, \"It is",
                " not lawful to buy and sell and",
                " trade in singing girls nor is it",
                " lawful to take their price.\" In another",
                " tradition, the last sentence is to the",
                " effect: ... it is unlawful to eat",
                " their price\" . Yet another tradition from",
                " Abu Umamah is to the effect: To",
                " teach music to slave-girls and to trade",
                " in them is not lawful and their",
                " price is forbidden.\" AII these Ahadith also",
                " elucidate that the verse containing lahv al-hadith",
                " was sent down in this very connection.",
                " Qadi Abu Bakr Ibn al-'Arabi has related",
                " in the Ahkam alQur'an a Hadith from",
                " Hadrat 'Abdullah bin Mubarak and Imam Malik",
                " on the authority of Hadrat Anas, saying,",
                " that the Holy Prophet said: 'He who",
                " hears the song of a singing-girl in",
                " a musical concert, will have molten lead",
                " poured into his ear on the Day",
                " of Judgement\" (In this connection, one should",
                " also note that the culture\" of music",
                " in those days flourished almost entirely through",
                " the slave-girls: Free women had not yet",
                " become \"artists\" . That is why the",
                " Holy Prophet spoke about trading in slave-girls,",
                " and described their wages and earnings as",
                " their price. and used the word qaynah",
                " for the singing-girl, which is specifically used",
                " for a slave-girl in Arabic).",
                "*7) \"Without",
                " any knowledge\" may be connected with \"buys\"",
                " and also \"lead...astray\". In the first case,",
                " it would mean: 'The ignorant foolish person",
                " buys this alluring thing and dces not",
                " know that he is buying a ruinous",
                " thing at the cost of a highly",
                " valuable thing. On the one hand, there",
                " are the Divine verses which are full",
                " of wisdom and guidance, which he can",
                " obtain without any cost, but he turns",
                " away from them. On the other, there",
                " are these absurd things, which are disastrous",
                " for his morals and he is expending",
                " his wealth to obtain them. \" In",
                " the second case, it would mean: \"He",
                " has come out to guide the people",
                " without any knowledge: he does not know",
                " what burden of sin he is taking",
                " on himself by trying to lead the",
                " people astray from Allah's Way.\"",
                "*8) That",
                " is, This person wants to make fun",
                " of the Divine Revelations by alluring and",
                " absorbing the people in legends and tales",
                " and music. He intends that the invitation",
                " of the Qur'an should be derided and",
                " ridiculed and laughed away. He plans to",
                " fight the Religion of God with the",
                " strategy that as soon as Muhammad (upon",
                " whom be Allah's peace) should come out",
                " to recite Revelations of God to the",
                " people, there should be a charming, sweet-voiced",
                " damsel giving her performance in a musical",
                " concert. on the one hand, and a",
                " glib-tongued story teller telling tales and legends",
                " of Iran, on the other, and the",
                " people should become so absorbed in these",
                " cultural activities\" that they may not be",
                " in a mood to hear anything about",
                " God and the morals and the Hereafter.",
                " \"",
                "*9) This punishment will be in",
                " accordance with their crime. They want to",
                " debase and disgrace Go's Religion, His Revelations",
                " and His Messenger; God will rake His",
                " vengeance on them by giving them a",
                " disgraceful torment."
            ]
        },
        {
            "verse-id": "[31:7]",
            "verse": "And when our verses are recited to him, he turns away arrogantly as if he had not heard them, as if there was in his ears deafness. So give him tidings of a painful punishment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[31:8]",
            "verse": "Indeed, those who believe and do righteous deeds - for them are the Gardens of Pleasure.",
            "description": [
                "Instead of saying 'There are blessings of",
                " Paradise (Gardens) for them,\" it has been",
                " said, there are blissful Gardens for them.\"",
                " In the first case, it would have",
                " meant this: \"They will enjoy the blessings",
                " but the Gardens will not belong to",
                " them.\" In the second case, it automatically",
                " becomes evident that the whole Gardens will",
                " be handed over to them, and they",
                " will take advantage of their blessings as",
                " an owner does of his own possession,",
                " and not like the one who is",
                " allowed to use something without giving him",
                " ownership rights over it.\""
            ]
        },
        {
            "verse-id": "[31:9]",
            "verse": "Wherein they abide eternally; [it is] the promise of Allah [which is] truth. And He is the Exalted in Might, the Wise.",
            "description": [
                "That is, \"Nothing can withhold Him from",
                " fulfilling His promise, and whatever He does,",
                " He does strictly according to the demands",
                " of wisdom and justice. The object of",
                " mentioning these two attributes of Allaln after",
                " saying: This 'is a true promise of",
                " AIIah\", is to stress that AIIah neither",
                " violates His promise wilfully nor is there",
                " in this universe any such power as",
                " can prevent Him from fulfilling His promise.",
                " Therefore, there can be no chance that",
                " one may not receive what AIIah has",
                " promised to give as a reward for",
                " faith and righteous deeds. Moreover, Allah's open",
                " promise to bestow this reward is wholly",
                " based on His wisdom and His justice.",
                " He does not misjudge: it cannot be",
                " that He may deprive a deserving person",
                " of his reward, and reward a non-deserving",
                " one instead. The people characterised by taste",
                " faith and righteous deeds indeed deserve this",
                " reward and AIIah will bestow this on",
                " them only.\""
            ]
        },
        {
            "verse-id": "[31:10]",
            "verse": "He created the heavens without pillars that you see and has cast into the earth firmly set mountains, lest it should shift with you, and dispersed therein from every creature. And We sent down rain from the sky and made grow therein [plants] of every noble kind.",
            "description": [
                "After the above introductory sentence, the discourse",
                " now turns to the real theme, i.e..,",
                " the refutation of shirk and the invitation",
                " to Tauhid.",
                "*13) The actual words bi",
                " -ghair i amad-in tarauna-ha in the Text",
                " may havc two meanings: (1) \"You can",
                " see for yourself that they stand without",
                " pillar\"; and (2) 'they stand on the",
                " pillars which you cannot see\" Ibn 'Abbas",
                " and Mujahid havc favoured the second meaning,",
                " and many other commentators take the first",
                " meaning. If the meaning is expressed in",
                " terms of the natural sciences of the",
                " present day, it can be said that",
                " the countless stars and planets in the",
                " heaven have been established in their positions",
                " and orbits without any visible support and",
                " prop: there are no strings and wires",
                " which might have tied them together; there",
                " are no iron bars which might be",
                " withholding them from falling on one another.",
                " It is the law of gravitation which",
                " is supporting the system. This interpretation is",
                " according to the present-day knowledge. It may",
                " be that tomorrow some new addition to",
                " our knowledge enables us to interpret the",
                " reality better.",
                "*14) For explanation, see E.",
                " N . 12 of Surah An-Nahl .",
                ""
            ]
        },
        {
            "verse-id": "[31:11]",
            "verse": "This is the creation of Allah. So show Me what those other than Him have created. Rather, the wrongdoers are in clear error.",
            "description": [
                "\"These others\" 'the beings whom you havc",
                " set up as your deities, whom you",
                " regard as makers and un-makers of your",
                " destinies, whom you have been worshipping as",
                " such persistently\"",
                "*16) That is, \"When they",
                " do not point out in this universe",
                " any creation of anyone else than Allah,",
                " and obviously they cannot, their setting up",
                " the noncreators as associates in Godhead and",
                " bowing before them in worship and invoking",
                " them for help, is nothing but mere",
                " stupidity, because their foolish conduct cannot be",
                " explained in any other way. Unless a",
                " person has taken leave of his senses",
                " he cannot commit the folly that he",
                " should himself admit before you that his",
                " deities are non-creators and that AIIah alone",
                " is the Creator, and yet insist on",
                " their being the deities. If somebody has",
                " a little of the common sense, he",
                " will inevitably think how the one who",
                " has no power to create anything, and",
                " who has no share whatever in the",
                " creation of anything in the earth and",
                " heavens, can be our deity. Why should",
                " man bow before it and adore it",
                " as a deity? Does it possess any",
                " power that it could fulfil one's needs",
                " and requirements? Even if it hears one's",
                " prayers, whet could it do to answer",
                " them when it did not havc any",
                " power to create anything? For, evidently, afflictions",
                " can be removed only by him who",
                " can create something and not by him",
                " who can create nothing.\""
            ]
        },
        {
            "verse-id": "[31:12]",
            "verse": "And We had certainly given Luqman wisdom [and said], \"Be grateful to Allah.\" And whoever is grateful is grateful for [the benefit of] himself. And whoever denies [His favor] - then indeed, Allah is Free of need and Praiseworthy.",
            "description": [
                "After presenting a rational argument to refute",
                " shirk the Arabs arc being told that",
                " this rational point of view is not",
                " being presented before them for the first",
                " time, but the wise and learned people",
                " before them also have been saying the",
                " same thing, including their own famous sage,",
                " Luqman. Therefore, they cannot refute the Holy",
                " Prophet's message, saying, \"If shirk was an",
                " irrational creed, why didn't it strike so",
                " to somebody else before?\"",
                "Luqman was well",
                " known as a wise and Iearned man",
                " in Arabia. He has been mentioned in",
                " the poetry of the pre-Islamic poets like",
                " Imra'ul-Qais, Labid, A'asha, Tarafa and others. Some",
                " educated Arabs also possessed a collection of",
                " the wise sayings of Luqman. According to",
                " traditions, three years before the Hijrah the",
                " very first person of Madinah to be",
                " influenced by the Holy Prophet was Suwaid",
                " bin Samit. He went to Makkah for",
                " Hajj. There the Holy Prophet was as",
                " usual preaching Islam to the pilgrims coming",
                " from different places, at their residences. When",
                " Suwaid heard his speech, he submitted, \"I",
                " have also got a thing similar to",
                " what you preach,\" When the Holy Prophet",
                " asked what it was, he said, \"The",
                " roll of Luqman.\" Then on the Holy",
                " Prophet's instance, he read out a portion",
                " of it, whereupon the Holy Prophet said,",
                " \"This discourse is fine, but that which",
                " I have is better still.' Then he",
                " recited the Qur'an to him, and Suwaid",
                " admitted that that was certainly better than",
                " the wisdom of Luqman. (Ibn Hisham, vol.",
                " II, p. 3781. According to the historians,",
                " this person (Suwaid bin Samit) was known",
                " by the title of Kamil (Perfect) in",
                " Madinah on account of his ability, bravery,",
                " nobility and poetry. Bet when after his",
                " meeting with the Holy Prophet he returned",
                " to Madinah. He was killed in the",
                " battle of Bu'ath, which was fought some",
                " time afterwards. His tribesmen were of the",
                " opinion that he had become a Muslim",
                " after his meeting with the Holy Prophet",
                "",
                "Historically. Luqman is a disputed personage. In",
                " the dark centuries of ignorance there was",
                " no compiled history. The only source of",
                " information were the traditions that were being",
                " handed down since centuries. According to these,",
                " some people thought that Luqman belonged to",
                " the people of 'Ad and was a",
                " king of Yaman. Relying on these traditions,",
                " Maulana Sayyid Suleman Nadvi has expressed the",
                " opinion in the Ard al-Qar'an that Luqman",
                " was a descendent of the believers who",
                " remained safe with the Prophet Hud after",
                " the destruction of the people of 'Ad",
                " by a Divine torment, and he was",
                " one of the kings of Yaman when",
                " it was ruled by the 'Ad. But",
                " other traditions which have been reported from",
                " sane Iearned Companions and their immediate followers",
                " do not support this view. Ibn 'Abbas",
                " says Luqman was a negro slave, and",
                " the same is the opinion of Hadrat",
                " Abu Hurairah, Mujahid, 'Ikrimah and Khalid ar-Rabi.",
                " According to Hadrat Jabir bin'Abdullah Ansari, he",
                " belonged to Nirbah. S'id bin al-Musayyib says",
                " that Ire was an Egyptian negro. These",
                " three sayings closely resemble one another. The",
                " Arabs generally called the black people negroes",
                " (Habashis) in those days, and Nirbah is",
                " the country south of Egypt and north",
                " of Sudan. Therefore, calling the same person",
                " an Egyptian and a Nubian and a",
                " negro, in spite of the difference in",
                " words. is one and the same thing.",
                " Then the elucidations made by Suhayli in",
                " Raud al-Unuf nd Mas'udi in Muruj adh-Dhahab",
                " also throw some light on the question",
                " as to how the wisdom of this",
                " Sudanese slave spread in Arabia. They both",
                " agree that this person though originally a",
                " Nubian was an inhabitant of Madyan and",
                " Aylah (modern, 'Aqabah). That is why he",
                " spoke Arabic and his wisdom spread in",
                " Arabia. Besides, Suhayli also elucidates that Luqman",
                " the Sage and Luqman bin 'Ad were",
                " two different persons, and it is not",
                " correct to regard them as one and",
                " the same man. (Raud al-Unuf, vol. I,",
                " p. 266; Mas'udi, vol. I, p. 57).",
                "",
                "Another thing may also be made clear",
                " here. The Arabic manuscript from the Library",
                " of Paris, which the orintalist Derenbourg has",
                " published under the title Amthal Luqman Hakim",
                " (Fables De Luqman Le Sage) is a",
                " fabricated thing which has nothing to do",
                " with the Roll of Luqman. These Fables",
                " were compiled by somebody in the 13th",
                " century A.D. Its Arabic is poor, and",
                " a perusal shows that it is, in",
                " fact, a translation of some other book",
                " in a different language, which the author",
                " or translator has himself ascribed to Luqman",
                " the Sage. The orientalists make such researches",
                " with a special object in view. They",
                " bang out such forged and fake things",
                " in order to prove that the narratives",
                " of the Quran are unhistorical legends and",
                " therefore unreliable. Anyone who reads B. Helle's",
                " article on 'Luqman\" in the Encyclopeadia of",
                " Islam will not fail to understand the",
                " real motive of these people.",
                "*18) That",
                " is, \"The very first demand of the",
                " wisdom and knowledge, insight and sagacity, granted",
                " by AIIah was that man should have",
                " adopted the attitude of gratefulness and obedience",
                " before his Lord, and not of ingratitude",
                " and thanklessness. And this gratefulness should not",
                " have merely been lip-service but expressed and",
                " translated in thought and word and deed.",
                " One should have the conviction in the",
                " depths of one's heart and mind that",
                " whatever one has got, has been given",
                " by God. One's tongue should always be",
                " acknowledging the favours of God; and practically",
                " also one should be trying to prove",
                " by carrying out His Commands, by avoiding",
                " sins, by striving to achieve His good-will,",
                " by conveying His blessings and favours to",
                " His servants and by fighting those who",
                " have rebelled against Him that one is",
                " really a grateful servant of one's God.\"",
                "",
                "*19) That is,\"The one who is ungrateful",
                " and unbelieving, his unbelief is harmful to",
                " his own self. Allah does not lose",
                " anything. He is Independent and does not",
                " stand in need of anyone's gratitude. The",
                " gratitude of someone dces not add anything",
                " to His Godhead, nor does anyone's ingratitude",
                " and disbelief change the factual reality that",
                " whatever the servants have got, has been",
                " granted by Him. He is Self-Praiseworthy whether",
                " someone praises Him or not. Every particle",
                " in the universe bears testimony to His",
                " Perfection and Beauty, His Creativity and Providence,",
                " and every creature is paying homage to",
                " His glory perpetually.\""
            ]
        },
        {
            "verse-id": "[31:13]",
            "verse": "And [mention, O Muhammad], when Luqman said to his son while he was instructing him, \"O my son, do not associate [anything] with Allah. Indeed, association [with him] is great injustice.\"",
            "description": [
                "This particular admonition from the wisdom of",
                " Luqman has been cited here for two",
                " reasons: (1) He gave this admonition to",
                " his son, and obviously, no one can",
                " be insincere to one's own children. A",
                " person may deceive others, may behave hypocritically",
                " towards them, but no one, not even",
                " a most depraved person, will try to",
                " deceive and defraud his own children. Therefore,",
                " Luqman's admonishing his son thus is a",
                " clear proof of the fact that in",
                " his sight shirk was indeed the most",
                " heinous sin, and for that very reason",
                " he first admonished his dear son to",
                " refrain from this iniquity. (2) The second",
                " reason for this narration is that many",
                " parents from among the disbelievers of Makkah",
                " were compelling their children to turn away",
                " from the message of Tauhid being preached",
                " by the Holy Prophet Muhammad (upon whom",
                " be Allah's peace) and remain steadfast on",
                " the creed of shirk, as is being",
                " stated in the following verses. Therefore, those",
                " foolish people are being told, as if",
                " to say, The well-known sage of your",
                " own land had wished his children well",
                " by admonishing thetas to avoid shirk, now",
                " you should judge it for yourself whether",
                " you arc wishing your children well or",
                " ill when you compel them to follow",
                " the same creed of shirk.\"",
                "*21) Zulm",
                " means to deprive someone of his right",
                " and to act unjustly. Shirk is a",
                " grave iniquity because man sets up such",
                " beings as equals with his Creator and",
                " Providence and Benefactor as have no share",
                " whatever in creating him, nor in providing",
                " for him, nor in bestowing the blessings",
                " on him, which he is enjoying in",
                " the world. There could be no greater",
                " injustice than this. The Creator's right on",
                " man is that he should worship Him",
                " alone, but he worships others and so",
                " deprives Him of His right. Then, in",
                " whatever he does in connection with the",
                " worship of others than Allah, he exploits",
                " many things, from his own mind and",
                " body to the earth and heavens, whereas,",
                " all these things have been created by",
                " Allah, the One. and man has no",
                " right to use any of them in",
                " the worship of any other than Allah",
                " Then, the right of man's own self",
                " on him is that he should not",
                " debase and involve it in punishment. But",
                " when he worships others than his Creator.",
                " he debases his self as well as",
                " makes it deserving of the punishment. Thus,",
                " the entire life of a mushrik becomes",
                " Zulm in every aspect and at all",
                " times and his every breath becomes an",
                " expression of injustice and iniquity."
            ]
        },
        {
            "verse-id": "[31:14]",
            "verse": "And We have enjoined upon man [care] for his parents. His mother carried him, [increasing her] in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents; to Me is the [final] destination.",
            "description": [
                "The whole passage from lure to the",
                " end of the paragraph is a parenthesis,",
                " which AIIah has inserted as a further",
                " explanation of the saying of Luqman.",
                "*23)",
                " From these words, Imam Shafe'i, Imam Ahmad,",
                " Imam Abu Yusuf. and Imam Muhammad have",
                " drawn the conclusion that the suckling period",
                " of the child is two years. If",
                " a child has been suckled by a",
                " woman within this period, they will be",
                " forbidden for each other, but if outside",
                " and beyond this period, they will not",
                " be so. A saying of Imam Malik",
                " also supports this. But Imam Abu Hanifah",
                " has proposed the period of two and",
                " a half years as a precaution, and",
                " has added that it' the child has",
                " been weaned after two years, or even",
                " earlier, and it is no longer dependent",
                " upon suckling for its food, no woman",
                " would be forbidden for him If she",
                " gave him suck after that period, However,",
                " if the real food of the child",
                " is still milk. suckling during the period",
                " will render him and her forbidden for",
                " each other in spite of his eating",
                " the other food in a more or",
                " less quantity. For, the verse does not",
                " mean that the child should be suckled",
                " necessarily for two years. In Surah AI",
                " Baqarah it has been said: 'The mothers",
                " shall suckle their children for two whole",
                " years, if the fathers desire the suckling",
                " to be completed.\" (v. 233). Ibn 'Abbas",
                " from these words has concluded, and other",
                " scholars have agreed with him in this,",
                " that the shortest period of pregnancy is",
                " six months, for the Qur'an at another",
                " place says: \"His bearing (ita the womb)",
                " and his weaning took thirty months.\" (Ahqaf:",
                " 15) This is an important legal point",
                " which helps resolve many disputes concerning legitimate",
                " and illegitimate births."
            ]
        },
        {
            "verse-id": "[31:15]",
            "verse": "But if they endeavor to make you associate with Me that of which you have no knowledge, do not obey them but accompany them in [this] world with appropriate kindness and follow the way of those who turn back to Me [in repentance]. Then to Me will be your return, and I will inform you about what you used to do.",
            "description": [
                "That is, \"About wham you have no",
                " knowledge that he is My associate.\"",
                "*25)",
                " \"All of you\": the children as well",
                " as the parents.",
                "*26) For explanation, see",
                " E. N.'s 11 and 12 of Surah",
                " Al-'Ankabut."
            ]
        },
        {
            "verse-id": "[31:16]",
            "verse": "[And Luqman said], \"O my son, indeed if wrong should be the weight of a mustard seed and should be within a rock or [anywhere] in the heavens or in the earth, Allah will bring it forth. Indeed, Allah is Subtle and Acquainted.",
            "description": [
                "The other admonitions of Luqman are being",
                " narrated here to imply that like the",
                " basic beliefs, the teachings pertaining to morals",
                " that the Holy Prophet is presenting, are",
                " not anything new in Arabia.",
                "*28) That",
                " is, \"Nothing can escape Allah's knowledge and",
                " His grasp. A seed in the rock",
                " may be hidden for you, but it",
                " is known to AIIah. A particle in",
                " the heavens may be very distant for",
                " you, but for AIIah it is very",
                " near. A thing lying in the layers",
                " of the earth may be lying in",
                " darkness for you but for him it",
                " is in full light. Therefore, you cannot",
                " do anything good or bad, anywhere or",
                " any time, which may remain hidden from",
                " AIIah. He is not only aware of",
                " it, but when the time for accountability",
                " coms, He will place before you a",
                " full record of each act of yours.",
                " \""
            ]
        },
        {
            "verse-id": "[31:17]",
            "verse": "O my son, establish prayer, enjoin what is right, forbid what is wrong, and be patient over what befalls you. Indeed, [all] that is of the matters [requiring] determination.",
            "description": [
                "In this there is a subtle allusion",
                " to this that whoever will enjoin good",
                " and forbid evil, will inevitably have to",
                " face and undergo afflictions and hardships in",
                " the world.",
                "*30) Another meaning can be:",
                " \"These are things which require courage and",
                " resolution. To rise for the reformation of",
                " the people and to brave the hardships",
                " of the way cannot 1>e the job",
                " of a mean-spirited and cowardly person.\""
            ]
        },
        {
            "verse-id": "[31:18]",
            "verse": "And do not turn your cheek [in contempt] toward people and do not walk through the earth exultantly. Indeed, Allah does not like everyone self-deluded and boastful.",
            "description": [
                "Tusa'ir in the original is from se",
                " 'ar. a disease in the camel's neck",
                " clue to which it keeps its face",
                " turned to one side. The idiom implies",
                " the attitude of a person who shows",
                " arrogance and vanity, turns his face away",
                " and treats others with scant respect.",
                "*32)",
                " Mukhtal in the original implies a person",
                " who has an over-high opinion of himself,",
                " and fakhur is the one who boasts",
                " of his superiority over others. A man",
                " becomes haughty and arrogant and vain in",
                " his gait only when he is puffed",
                " up with pride, and wants that others",
                " should feel his superiority."
            ]
        },
        {
            "verse-id": "[31:19]",
            "verse": "And be moderate in your pace and lower your voice; indeed, the most disagreeable of sounds is the voice of donkeys.\"",
            "description": [
                "According to some commentators it means this:",
                " 'Walk neither fast nor slow but at",
                " a moderate pace :\" but the context",
                " shows that here the pace or the",
                " rate of walking is not the question.",
                " There is nothing morally wrong with a",
                " fast or a slow pace in itself,",
                " nor can there be a rule made",
                " for it. When a man is in",
                " a hurry. he has to walk fast,",
                " and there is nothing wrong if one",
                " walks slow when walking for pleasure. Even",
                " if there is a standard for the",
                " moderate pace, it cannot be made a",
                " law for every person at aII times.",
                " What is actually meant by this is",
                " to reform the state of the self",
                " under which a person walks haughtily. The",
                " haughtiness and arrogance of a person inevitably",
                " manifests itself in his gait and style",
                " of walking, which shows the state of",
                " his mind and also the cause of",
                " his pride and haughtiness. Wealth, authority, beauty.",
                " knowledge, power and such other things cause",
                " a man to became proud and vain,",
                " and each of these gives him a",
                " special style of gait. Contrary to this,",
                " manifestation of humility in the gait is",
                " also the result of one or the",
                " other morbid mental state. Sometimes the hidden",
                " conceit of the self of a man",
                " takes on the form of ostentatious humility,",
                " piety and godliness and this is shown",
                " by his gait; and sometimes man really",
                " feels so embittered by the frustrations of",
                " the world that he adopts a sick",
                " man's gait. What Luqman means to say",
                " is this: \"Avoid these states of the",
                " mind and self and walk the gait",
                " of a simple, honest and noble person,",
                " which neither shows any vanity and haughtiness",
                " nor weakness nor ostentatious piety and humility.\"",
                "",
                "The taste of the Holy Prophet's great",
                " Companions in this regard can be judged",
                " from a few instances. When Hadrat Umar",
                " once saw a man walking with his",
                " head hung down, he shouted out to",
                " him, saying, \"walk with your head raised",
                " up. Islam is not sick. \"He saw",
                " another person walking like a weak, sick",
                " man, and said, wretch! Do not sully",
                " our religion! \" Both these incidents show",
                " that in the sight of Hadrat 'Umar",
                " religious piety did not at aII require",
                " that one should walk cautiously. like the",
                " sick man and show undue humility by",
                " one's gait. Whenever he saw a Muslim",
                " walking such a gait, he would have",
                " the apprehension that it would misrepresent Islam",
                " and would depress the other Muslims. A",
                " similar incident was once met with by",
                " Hadrat 'A'ishah. She saw a person walking",
                " as if run down and exhausted. She",
                " asked what was the matter. It was",
                " said, 'He is one of the reciters",
                " of the Qur'an (i e a person",
                " who remains engaged in reciting and teaching",
                " the Qur'an and in worship).\" At this",
                " she said, 'Umar was the chief of",
                " the reciters of the Qur'an, but as",
                " it was he would walk with a",
                " firm foot, and he would speak with",
                " force and strength, and he would give",
                " a good beating if he had to.\"",
                " (For further explanation. see E.N. 43 of",
                " Bani Isra'il and E.N. 79 of AI-Furqan).",
                "",
                "*34) This does not mean that one",
                " should always speak in a low voice",
                " and should never raise one's voice. By",
                " citing the braying of the asses, it",
                " has been clearly indicated what son of",
                " the tone and voice in speech is",
                " meant to be discouraged. One kind of",
                " lowness and loudness'roughness and softness, of the",
                " rove and voice is that which is",
                " needed under natural and genuine requirements. For",
                " example, when speaking to a man close",
                " at hand, or to a small group",
                " of the people, one would speak in",
                " a low voice, and when speaking to",
                " a man at a distance or to",
                " a large number of the people, one",
                " would inevitably have to speak loudly. Similar",
                " is inevitably the difference in tones depending",
                " on the occasion and situation. The tone",
                " of praise has to be different from",
                " the tone of condemnation. and of the",
                " expression of goodwill from that of indignation.",
                " This thing is in no way objectionable.",
                " Nor does the admonition of Luqman imply",
                " that one should always speak in a",
                " soft and low voice and tone regardless",
                " of the occasion and requirement. What is",
                " objectionable is that one should shout oneself",
                " hoarse and produce a voice like the",
                " ass's braying in order to bully and",
                " debase and browbeat the other person."
            ]
        },
        {
            "verse-id": "[31:20]",
            "verse": "Do you not see that Allah has made subject to you whatever is in the heavens and whatever is in the earth and amply bestowed upon you His favors, [both] apparent and unapparent? But of the people is he who disputes about Allah without knowledge or guidance or an enlightening Book [from Him].",
            "description": [
                "A thing can be subjected to somebody",
                " in two ways: (11 The thing may",
                " be made subordinate to him and he",
                " may be authorised to use and exploit",
                " it as he likes, and 12) the",
                " thing may be subjected to a law",
                " and system so that it becomes useful",
                " for him and serves his interests accordingly.",
                " AIIah has not subjected everything in the",
                " earth and heavens to man in one",
                " and the same sense, but has subjected",
                " certain things in the first sense and",
                " certain others in the second sense. For",
                " example, He has subjected the air, water,",
                " earth, fire, vegetation, minerals, cattle and many",
                " other things in the first sense, and",
                " the sun, the moon, etc. in the",
                " second sense.",
                "*36) \"Visible favours\" imply those",
                " favours which are perceived by man in",
                " one way or the other, or arc",
                " known to him. And the \"invisible favours\"",
                " arc those which are neither perceived by",
                " him nor arc known to him. There",
                " are countless things in mans own body",
                " and in the world outside him, which",
                " are working in his interest, but man",
                " is utterly unaware of the means which",
                " his Creator has provided for his protection",
                " and safety, for his development and provision",
                " of sustenance to him, and for his",
                " well-being and happiness. Research of man in",
                " the different branches of science is revealing",
                " many such favours of God as were",
                " hidden from him before. And the favours",
                " and blessings which have so far been",
                " revealed are insignificant as against those which",
                " still lie hidden froth man.",
                "*37) 'Who",
                " wrangle about AIIah\": Who wrangle and dispute",
                " aborts questions such as these: Dces AIIah",
                " exist or not? Is He One God",
                " alone, or are there other gods also?",
                " What are His attributes and what is",
                " their nantre? What is the nantre of",
                " His relationship with His creations etc.?",
                "*38)",
                " That is, `They neither have any means",
                " of knowledge by which they might themselves",
                " have observed or experienced the reality directly,",
                " nor do they have the guidance of",
                " a guide available to them, who might",
                " have guided them after observing the reality,",
                " nor do they possess a Divine Book,",
                " which might be the basis of their",
                " belief.\""
            ]
        },
        {
            "verse-id": "[31:21]",
            "verse": "And when it is said to them, \"Follow what Allah has revealed,\" they say, \"Rather, we will follow that upon which we found our fathers.\" Even if Satan was inviting them to the punishment of the Blaze?",
            "description": [
                "That is, It is not at aII",
                " necessary that the forefathers of every person",
                " and every family and nation should have",
                " been on the right path. The mere",
                " argument that a particular way of life",
                " had been bequeathed by the elders cannot",
                " be a proof of its being right",
                " also. No sane person can commit the",
                " folly that he should blindly go on",
                " following the way of his forefathers even",
                " if they were not rightly guided, and",
                " should never bother to find out where",
                " the way is leading him.\""
            ]
        },
        {
            "verse-id": "[31:22]",
            "verse": "And whoever submits his face to Allah while he is a doer of good - then he has grasped the most trustworthy handhold. And to Allah will be the outcome of [all] matters.",
            "description": [
                "\"Whoever........Allah\": Who submits himself wholly to the",
                " service of AIIah, entrusts alI his affairs",
                " to Him and makes His Guidance the",
                " law of his entire life.",
                "*41) That",
                " is, practically also he should adopt the",
                " attitude of an obedient servant of Allah.",
                "",
                "*42) That is, 'He will neither have",
                " the apprehension that he will be misguided,",
                " nor the fear that he will meet",
                " an evil end after having served Allah.\"",
                ""
            ]
        },
        {
            "verse-id": "[31:23]",
            "verse": "And whoever has disbelieved - let not his disbelief grieve you. To Us is their return, and We will inform them of what they did. Indeed, Allah is Knowing of that within the breasts.",
            "description": [
                "This means to say, \"O Prophet, the",
                " one who refuses to listen to you,",
                " thinks that by rejecting Islam and insisting",
                " on unbelief he has harmed you, but",
                " in fact he has not harmed you",
                " but harmed only himself. If he does",
                " not listen to you, you need not",
                " bother yourself about him at all. \"",
                ""
            ]
        },
        {
            "verse-id": "[31:24]",
            "verse": "We grant them enjoyment for a little; then We will force them to a massive punishment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[31:25]",
            "verse": "And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\" Say, \"[All] praise is [due] to Allah \"; but most of them do not know.",
            "description": [
                "That is, \"Thank God that you at",
                " least know this and believe in this.",
                " But if this be the reality, all",
                " praise should then belong to AIIah alone.",
                " How can any other being deserve praise",
                " when it has no share whatever in",
                " the creation of the universe?\"",
                "*45) That,",
                " is, Most of the people do not",
                " know what are the inevitable results and",
                " demands of accepting Allah as the Creator",
                " of the universe, and what contradicts it.",
                " When a person acknowledges Allah as the",
                " Creator of the earth and the heavens.",
                " He should also acknowledge that Allah alone",
                " is the Deity and Lord: that He",
                " alone is worthy of worship and obedience:",
                " that He alone can be invoked for",
                " needs, and no one other than He",
                " can be the Law-Giver and Ruler of",
                " His creation. To acknowledge one as the",
                " Creator and another as the deity is",
                " contrary to reason and a contradiction in",
                " terms, which can be upheld only by",
                " an ignorant person. Likewise, it would be",
                " a contradiction in terms to believe in",
                " one Being as the Creator and to",
                " regard another from among the creation as",
                " remover of hardships or as a deity",
                " and possessor of power and authority and",
                " sovereignty. which no reasonable will acknowledge and",
                " accept.\"",
                "*46) That is, 'The reality is",
                " not merely this that AIIah is the",
                " reator of the earth and the heavens,",
                " but in fact He alone is the",
                " Master of aII things found in the",
                " earth and heavens. AIIah has not created",
                " '.his universe and left it to others",
                " to become masters of the whole or",
                " a part of it, but He Himself",
                " is Master of His creation and everything",
                " that exists in this universe is His.",
                " Here. He alone possesses Divine rights and",
                " powers and no one else. \""
            ]
        },
        {
            "verse-id": "[31:26]",
            "verse": "To Allah belongs whatever is in the heavens and earth. Indeed, Allah is the Free of need, the Praiseworthy.",
            "description": [
                "This has been explained in E. N.",
                " 19 above."
            ]
        },
        {
            "verse-id": "[31:27]",
            "verse": "And if whatever trees upon the earth were pens and the sea [was ink], replenished thereafter by seven [more] seas, the words of Allah would not be exhausted. Indeed, Allah is Exalted in Might and Wise.",
            "description": [
                "\"Allah's Words\": Allah's creative works and the",
                " manifestations of His power and wisdom. This",
                " very theme has been presented in Surah",
                " AI-Kahf: l()<) above a little differently. A",
                " person might think there is exaggeration in",
                " this. but if one considers the matter",
                " a little deeply, one will feel that",
                " there is in tact no exaggeration whatever",
                " in it. AII the pens that can",
                " be made from the trees of the",
                " world and aII the ink that can",
                " be provided by the oceans of the",
                " world, which are replenished by seven more",
                " oceans, cannot perhaps help prepare a complete",
                " list of aII the reations in the",
                " universe, not to speak of aII the",
                " manifestations of Allah's power and wisdom and",
                " creative works. When it is impossible even",
                " to count aII the things found on",
                " the earth only, how can one bring",
                " into writing aII the creations found in",
                " this limitless universe?",
                "Here, the object is",
                " to make man realize that no creature",
                " can become a deity and an associate",
                " in the works of AIIah. Who has",
                " brought into being such a vast Universe,",
                " Who is administering its affairs and Whose",
                " powers and resources are limitless. Not to",
                " speak of becoming an associate in the",
                " administration of this vast Kingdom, it is",
                " not within the power of any creation",
                " to obtain a mere nodding acquaintance with",
                " the minutest portion of it. How can",
                " then one imagine that one or the",
                " other creation can have any share in",
                " the Divine powers and authority on the",
                " basis of which it may answer prayers",
                " and make or un-make destinies?"
            ]
        },
        {
            "verse-id": "[31:28]",
            "verse": "Your creation and your resurrection will not be but as that of a single soul. Indeed, Allah is Hearing and Seeing.",
            "description": [
                "That is, 'He is hearing every sound",
                " in the universe distinctly at one and",
                " the same time, and no sound can",
                " absorb his hearing so completely that He",
                " may hear no other sound. Likewise, He",
                " is seeing the whole universe in each",
                " of its details as to thing and",
                " event at one and the same time",
                " and nothing can absorb His sight so",
                " completely that He may see nothing else.",
                " The same precisely is the case concerning",
                " the creation of men and their re-creation",
                " also. He can re-create instantaneously aII the",
                " men who have been born since the",
                " beginning of the creation and will be",
                " born till the end of time, His",
                " creative power is not absorbed so completely",
                " in the creation of one man that",
                " He may be unable to create other",
                " men at the same time. For Him",
                " the creation of one man and of",
                " the billions of men. therefore, is equal",
                " and one and the same thing."
            ]
        },
        {
            "verse-id": "[31:29]",
            "verse": "Do you not see that Allah causes the night to enter the day and causes the day to enter the night and has subjected the sun and the moon, each running [its course] for a specified term, and that Allah, with whatever you do, is Acquainted?",
            "description": [
                "That is, \"The appearance and alternation of",
                " the day and night consistently and regularly",
                " by itself shows that the sun and",
                " the moon have been subjected to a",
                " system. \" The sun and the moon",
                " have been mentioned here in particular because",
                " both these are the most prominent bodies",
                " of the heaven, which man has been",
                " worshipping as deities since the earliest times,",
                " and which many people worship as gods",
                " even today. The fact, however, is that",
                " Allah has bound aII the stars and",
                " planets of the universe including the earth",
                " into an unalterable system from which they",
                " cannot deviate even by an inch.",
                "*51)",
                " That is, nothing in the world, whether",
                " the sun or the moon, or any",
                " other star or planet, in the universe,",
                " is eternal and ever-lasting. Everything has a",
                " term for it and can function only",
                " till its expiry. Everything has a beginning",
                " in time before which it was not",
                " there and an end in time after",
                " which it will not be there. This",
                " means to imply that such temporal and",
                " powerless things cannot become the deities of",
                " men."
            ]
        },
        {
            "verse-id": "[31:30]",
            "verse": "That is because Allah is the Truth, and that what they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.",
            "description": [
                "That is, the real Sovereign is Allah.",
                " He alone is the real Owner of",
                " power and authority over the creation and",
                " its disposal.",
                "*53) That is, \"They are",
                " figments of your own imagination. You have",
                " yourselves presumed that so-and-so has got a",
                " share in Godhead, and so-and-so has been",
                " given the powers to remove hardships and",
                " fulfil needs, whereas in fact none of",
                " them has any power to make or",
                " un-make anything.\"",
                "*54) That is, 'He is",
                " the Highest of aII before Whom everything",
                " is low, and He is the Greatest",
                " of aII before Whom everything is small\".",
                ""
            ]
        },
        {
            "verse-id": "[31:31]",
            "verse": "Do you not see that ships sail through the sea by the favor of Allah that He may show you of His signs? Indeed in that are signs for everyone patient and grateful.",
            "description": [
                "That is, \"Such Signs as show that",
                " aII powers rest only with Allah. Man",
                " may make as strong and suitable ships",
                " for his sea journeys as he likes,",
                " and may achieve whatever perfection in marine",
                " science and in the related knowledge and",
                " experience, these by themselves cannot avail him",
                " anything to perform safe voyages especially when",
                " confronted by the terrible forces at the",
                " sea, unless he is succoured by the",
                " grace of Allah. As soon as Allah's",
                " grace is withdrawn, man immediately realizes how",
                " meagre and insufficient are the means and",
                " resources and knowledge of the sciences. Similarly,",
                " man in the state of peace and",
                " security may be a hardened atheist or",
                " polytheist, but when his boat loses balance",
                " in the storm at sea, even the",
                " atheist comes to realize that there is",
                " God and the polytheist that there is",
                " only One God. \"",
                "*56) That is",
                " When the people who possess these two",
                " qualities, recognize the reality by these signs,",
                " they come to understand Tauhid clearly and",
                " stick to it firmly. The first qualitiy",
                " is that they should be patient: they",
                " should not be fickle but fine and",
                " persistent: they should remain steadfast on the",
                " righteous belief under aII circumstances, pleasant or",
                " unpleasant, difficult or easy, favourable or unfavourable.",
                " They should not have the weakness that",
                " when the hard times come they Stan",
                " imploring God humbly, and when they change",
                " into good times, they forget God altogether.",
                " Or that, to the contrary, they should",
                " worship God in good times and start",
                " cursing Him when touched by afflictions and",
                " misfortunes. The other quality is that they",
                " should be grateful: they should not prove",
                " ungrateful and thankless: but appreciative of favour",
                " and should remain perpetually disposed from within",
                " to render thanks to the one who",
                " conferred the favour.\""
            ]
        },
        {
            "verse-id": "[31:32]",
            "verse": "And when waves come over them like canopies, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, there are [some] of them who are moderate [in faith]. And none rejects Our signs except everyone treacherous and ungrateful.",
            "description": [
                "\"Iqtisad\" in the original may mean uprightness",
                " or moderateness. In the first case, the",
                " verse would mean: \"A few of them",
                " only remain steadfast on Tauhid, which they",
                " had promised to follow when overwhelmed by",
                " the stone, and this makes them adhere",
                " to uprightness ever afterwards.\" If it is",
                " taken to mean moderateness, it would mean:",
                " Some of them become moderate and less",
                " rigid in their creed of atheism and",
                " polytheism, or they lose some of their",
                " fervour and enthusiasm that had been caused",
                " by the incident of calamity.\" Most probably",
                " AIlah has used this0 meaningful sentence here",
                " in order to allude to aII the",
                " three states simultaneously. The object probably is",
                " to point out the fact that during",
                " the storm at sea the mind of",
                " everybody is automatically set right, and everybody",
                " gives up atheism and polytheism and starts",
                " invoking One AIIah for help. But as",
                " soon as they safely land on the",
                " shore, only a few of them seem",
                " to have learnt any enduring lesson from",
                " their experience. Then, this small number also",
                " is divided into three groups: those who",
                " adopt uprightness ever afterwards, and those who",
                " become moderate in their disbelief, and Those",
                " who retain some of the spirit of",
                " enthusiasm caused temporarily by the calamity.",
                "*58)",
                " These two qualities are the antithesis of",
                " the two qualities mentioned in the preceding",
                " verse. A treacherous person is he who",
                " is utterly disloyal and who has no",
                " regard for his promise and pledge, and",
                " the ungrateful he who does not acknowledge",
                " the good and the gains and the",
                " benefits received by him, and even behaves",
                " rebelliously towards his benefactor. The people having",
                " these qualities return to their disbelief, their",
                " atheism and their polytheism without any hesitation",
                " as soon as the danger has been",
                " averted. They do not admit that they",
                " had perceived some signs in their own",
                " selves as well as outside themselves of",
                " Allah's existence and of His being only",
                " One when overwhelmed by the stone, and",
                " their invoking aIlah was in fact the",
                " result of their recognition of the same",
                " reality. The atheists among them explain away",
                " their act, saying, \"It was a weakness",
                " which we manifested in the state of",
                " confusion and bewilderment, whereas there exists no",
                " God, Who might have saved us from",
                " the storm: we in fact succeeded in",
                " escaping by virtue of such and such",
                " a device and means and resources. \"",
                " As for the mushriks, they generally say,",
                " \"We had the succour and protection of",
                " such and such a saint or god",
                " and goddess available to us by virtue",
                " of which we escaped. \" Therefore, as",
                " soon as they land on the shore,",
                " they start giving thanks to these false",
                " gods and presenting offerings at their shrines.",
                " They do not bother to think that",
                " when they had lost hope, there was",
                " none beside Allah, the One, whom they",
                " might have implored and invoked for help.",
                ""
            ]
        },
        {
            "verse-id": "[31:33]",
            "verse": "O mankind, fear your Lord and fear a Day when no father will avail his son, nor will a son avail his father at all. Indeed, the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.",
            "description": [
                "That is, \"The relationship of a person",
                " with his friend, or his leader, or",
                " his spiritual guide, etc. is not so",
                " close and intimate as the relationship that",
                " exists between the children and their parents.",
                " But on the Day of Resurrection even",
                " the son and the father will not",
                " be able to help each other. The",
                " father will not have the courage to",
                " come forward and say that he may",
                " be seized instead of the son for",
                " his sins, nor will the son have",
                " the nerve to say that he may",
                " be sent to Hell instead of the",
                " father. How can then a person expect",
                " that one will be able to avail",
                " something for the other there? Therefore, foolish",
                " is the person who spoils his Hereafter",
                " in the world for the sake of",
                " another, or adopts the way of sin",
                " and deviation by dependence on others. Here,",
                " one should keep in view the theme",
                " of verse 15, in which the children",
                " have been admonished not to accept deviation",
                " in the matter of the faith and",
                " religion on behest of the parents, though",
                " in affairs of mundane life they are",
                " duty bound to serve them as best",
                " as they can. \"",
                "*60) \"Allah's promise\"",
                " : the promise of Resurrection, when the",
                " Court of AIIah will be established and",
                " everyone will be called to render an",
                " account of his deeds.",
                "*61) The life",
                " of the world involves the people, who",
                " only see the superficial, in different kinds",
                " of misunderstandings. Someone thinks that life and",
                " death only belong to this world, and",
                " there is no life hereafter; therefore, whatever",
                " one has to do, one should do",
                " it here and now. Another one who",
                " is lost in his wealth and power",
                " and prosperity, forgets his death and gets",
                " involved in the foolish idea that his",
                " grandees and his power are everlasting. Another",
                " one overlooking the moral and spiritual objectives",
                " regards the material gains and pleasures in",
                " themselves as the only objectives and dces",
                " not give anything any importance but the",
                " \"standard of living\", no matter whether his",
                " standard of humanity gas on falling lower",
                " and lower as a result thereof. Someone",
                " thinks that worldly prosperity is the real",
                " criterion of truth and falsehood: every way",
                " of life that ensures this is the",
                " truth and everything contradictory to it is",
                " falsehood. Someone regards this very prosperity as",
                " a sign of being Allah's favourite, and",
                " assumes the law that whoever is leading",
                " a prosperous life here is Allah's beloved",
                " no matter by what means he might",
                " have achieved this prosperity, and whoever is",
                " leading a miserable life in the world,",
                " even if it be so due to",
                " his love of the truth and his",
                " uprightness, will live a miserable life in",
                " the Hereafter, too. These and other such",
                " misunderstandings have been called \"deceptions of the",
                " worldly life\" by Allah.",
                "*62) Al-gharur (the",
                " deceiver) may be Satan or a man",
                " or a group of then, or even",
                " man's own self, or something else. The",
                " reason for using this comprehensive and meaningful",
                " word in its absolute form without identifying",
                " a particular person or thing, is that",
                " for different people there are different means",
                " that cause them deception. Any particular means",
                " or cause that deceived a person to",
                " be misled and misguided from the right",
                " way to the wrong way, will be",
                " al-gharur in his particular Case.",
                "\"To deceive",
                " (someone) concerning Allah\" are also comprehensive words,",
                " which include countless kinds of deceptions. \"The",
                " deceiver\" deceives one man with the idea",
                " that there is no God at all,",
                " and another man with the idea that",
                " God after making the world has handed",
                " over its control and administration to the",
                " men and is no more concerned with",
                " it; he misleads another one, saying, \"There",
                " arc some favourite ones of God: if",
                " you attain nearness to them, you will",
                " surely win your forgiveness whatever you may",
                " do, or may have done, in the",
                " world; \" he deceives another one, saying,",
                " \"God is AII-Forgiving and All-Merciful: you may",
                " go on committing sins freely, and He",
                " will go on forgiving each sin of",
                " yours. \" He gives another person the",
                " idea of determinism and misguides him, saying,",
                " \"Everything that you do is pre-ordained: if",
                " you commit evil, it is God Who",
                " makes you commit it: if you avoid",
                " goodness, it is God Who makes you",
                " avoid it.\" Thus, there are countless kinds",
                " of such deceptions with which tnan is",
                " being deceived concerning God. When analyzed it",
                " comes to light that the basic cause",
                " of all errors and sins and crimes",
                " is that man has been deceived concerning",
                " God in one way or the other,",
                " and that is how he has been",
                " misled to some ideological deviation or moral",
                " error. \""
            ]
        },
        {
            "verse-id": "[31:34]",
            "verse": "Indeed, Allah [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, Allah is Knowing and Acquainted.",
            "description": [
                "This verse is, in fact an answer",
                " to the disbelievers' question as to when",
                " the Hour of Resurrection will come, which",
                " they asked when they heard the Holy",
                " Prophet mention it and the promise of",
                " the Hereafter, again and again. The Qur'an",
                " has answered this sometimes by citing the",
                " question and sometimes without citing it, because",
                " the addressees knew what they were asking.",
                " This is one of those verses which",
                " answer the question without citing the question",
                " itself.",
                "The first sentence: 'AIIah alone has",
                " the knowledge of the Hour\", is the",
                " real answer to the question. The four",
                " sentences that follow constitute the argument to",
                " support it. The argument means this: \"O",
                " man. you do not have the knowledge",
                " even about those things with which you",
                " are most closely and intimately concerned in",
                " life. How then can it be possible",
                " for you to know as to when",
                " will the whole world cane to an",
                " end? Your prosperity and adversity mainly depend",
                " on the rain. But its control and",
                " regulation is entirely in the hand of",
                " Allah. He sends down the rain whenever",
                " and wherever and in whatever measure He",
                " pleases and withholds it whenever he pleases.",
                " You do not at aII know how",
                " much of the rain will fall at",
                " a particular place at a particular time",
                " and which land will remain without it,",
                " and which land will be adversely affected",
                " in spite of it. Your wives conceive",
                " by your own sperm-drop, which perpetuates your",
                " race in the future, but you do",
                " not know what is taking shape in",
                " their wombs, and in what form and",
                " with what good or evil it will",
                " emerge. You do not even know what",
                " you are going to meet with the",
                " next day A sudden accident can change",
                " your destiny; but you are unaware of",
                " it even a minute before its occurence.",
                " You do not know where your present",
                " life will eventually cane to an end.",
                " AIlah has kept all this information with",
                " Himself alone; and has not given you",
                " any knowledge of any of these. You",
                " actually desire that you should have the",
                " knowledge of each of these things so",
                " that you may make necessary preparations beforehand,",
                " but you have no other course open",
                " to you than to depend only on",
                " Allah's decree and disposal in these matters.",
                " Likewise, about the end of the world",
                " also there is no alternative but to",
                " rely on Allah's decree and decision. The",
                " knowledge of this also has neither been",
                " given to anybody, nor can it be",
                " given.\" Here, another thing also should be",
                " understood well, and it is this: This",
                " verse dces not give a list of",
                " the unseen and hidden things, which are",
                " known to no one but Allah. Here",
                " only some of the most apparent things",
                " have been pointed out only to serve",
                " as an illustration. These are the things",
                " with which man is most deeply and",
                " intimately concerned, yet he is unaware of",
                " them. From this it would be wrong",
                " to conclude that these are the only",
                " five unseen and hidden things which are",
                " known to no one but AIIah. As",
                " a matter of fact, ghaib applies to",
                " every such thing which is hidden from",
                " the creation but is in the knowledge",
                " of Allah, and such things are countless",
                " and limitless. (For a detailed discussion of",
                " this, see An-Naml: 65 and the E.N.'s",
                " thereof)."
            ]
        }
    ]
}