{
    "name": "Az-Zumar",
    "verse-count": 75,
    "verse-info": [
        {
            "id": "[39:1]",
            "verse": "The revelation of the Qur'an is from Allah, the Exalted in Might, the Wise.",
            "description": [
                "This is a brief introduction to the",
                " Surah which only stresses the point that",
                " the Qur'an is not Muhammad's word, as",
                " the disbelievers assert, but it is Allah's",
                " Word, which He Himself has sent down.",
                " Along with this, two of Allah's attributes",
                " have been mentioned to warn the listeners",
                " of two realities so that they do",
                " not underestimate this Word but understand its",
                " full importance: (1) That Allah Who has",
                " sent it down, is All-Mighty; that is,",
                " He is so powerful that no power",
                " can prevent His will and decisions from",
                " being enforced and none can dare resist",
                " Him in any way; (2) that He",
                " is All-wise; that is, the guidance He",
                " is giving in this Book, is wholly",
                " based on wisdom, and only an ignorant",
                " and foolish person can turn away from",
                " it. (For further explanation, sec E.N. 1",
                " of Surah As-Sajdah)."
            ]
        },
        {
            "id": "[39:2]",
            "verse": "Indeed, We have sent down to you the Book, [O Muhammad], in truth. So worship Allah, [being] sincere to Him in religion.",
            "description": [
                "That is, it contains nothing but the",
                " truth, and there is no element of",
                " falsehood in it.",
                "*3) This is a",
                " very important verse, which stasis the real",
                " objective of the message of Islam. Therefore,",
                " one should not pass over it superficially,",
                " but should try to understand its meaning",
                " and intention well. It has two basic",
                " points without grasping which one cannot understand",
                " the verse: (1) That the demand is",
                " to worship Allah; and (2) that the",
                " demand is of such worship as may",
                " be performed by making religion exclusively Allah's.",
                " Ibadat is derived from 'abd, and this",
                " word is used as an antonym of",
                " freeman\" for the \"slave\" and `bondsman\" in",
                " Arabic. Accordingly, 'ibadat contains two meanings: (I)",
                " Worship and devotion; and (2) humble and",
                " willing obedience, as is borne out by",
                " the well-known and authoritative Arabic Lexicon. Lisan",
                " al-'Arab. Thus, according to the authentic lexical",
                " explanation, the demand is not only of",
                " Allah's worship but also of willing and",
                " sincere obedience to His Commands and His",
                " Law. The Arabic word din contains several",
                " meanings: (1) Domination and sovereignty, rulership and",
                " political power and authority to enforce one's",
                " decisions on others. (2) Obedience, compliance with",
                " commands and servitude. (3) The practice and",
                " the way that a man follows. In",
                " view of these three meanings, din in",
                " this verse means: \"The way of life",
                " and attitude which a man adopts after",
                " acknowledging the supremacy and accepting the obedience",
                " of another; \" and `to worship Allah",
                " making one's religion exclusively His\" means that",
                " one should refrain from combining another's worship",
                " with the worship of Allah, but should",
                " worship Allah alone, should follow His Guidance",
                " alone, and should comply with His Commands",
                " and injunctions only."
            ]
        },
        {
            "id": "[39:3]",
            "verse": "Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\" Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.",
            "description": [
                "This is an actual fact and reality,",
                " which has been presented as an argument",
                " for the above demand. It means: \"You",
                " should worship Allah, making din exclusively His,",
                " for it is only Allah's right that",
                " He should be obeyed and worshipped sincerely",
                " and exclusively.\" In other words, there is",
                " no one else who may deserve to",
                " be worshipped so that he also should",
                " be served and worshipped besides Allah and",
                " his commands and laws also obeyed. If",
                " a person serves another, apart from Allah,",
                " sincerely and exclusively, he does wrong. Likewise,",
                " if he combines the worship of another",
                " with his worship of Allah, this also",
                " is against the truth. The best commentary",
                " of this verse is the Hadith which",
                " Ibn Marduyah has related from Yazid ar-Raqashi.",
                " He says: A person asked the Holy",
                " Prophet: \"We give away our wealth so",
                " that we become well-known. Shall we get",
                " a reward for this?\" The Holy Prophet",
                " replied: No. He asked: \"What, if one",
                " has the intention both of Allah's reward",
                " and of reputation in the world?\" The",
                " Holy Prophet replied: `Allah does not accept",
                " any deed unless it is performed exclusively",
                " for His sake.\" After this he recited",
                " this same verse.",
                "*5) The disbelievers of",
                " Makkah said, and the polytheists the world",
                " over generally say the same, \"We do",
                " not worship other beings regarding them as",
                " our creators: the Creator is only Allah,",
                " and He alone is the real Deity;",
                " but He is too high for us",
                " to have access to Him. Therefore, we",
                " make these saintly beings a means to",
                " convey our prayers and our petitions to",
                " Allah. \"",
                "*6) One should understand it",
                " well that unity and concord is possible",
                " only through Tauhid: there can be no",
                " unity through shirk. The polytheists the world",
                " over have never agreed as to which",
                " beings are the definite means of access",
                " to Allah. Some people have taken some",
                " particular gods and goddesses as the means,",
                " but even among them there is no",
                " agreement on alI the gods and goddesses;",
                " some others have taken the moon, the",
                " sun, Mars, Jupiter, etc. as the means,",
                " and they also are not agreed as",
                " to which of them holds what rank",
                " and which is the real means of",
                " approach to Allah; some others have taken",
                " the dead saints as the means, but",
                " they also differ widely about them: one",
                " believes in one saint and another in",
                " another. The reason is that the belief",
                " about these different beings is neither based",
                " on any knowledge, nor has Allah ever",
                " sent down a list telling that such",
                " and such persons are His special favourites;",
                " therefore, they only should be made the",
                " means to have access to Him. This",
                " is a creed which has spread among",
                " the people only on occount of superstitions",
                " and whims and blind imitation of the",
                " elders. Hence the differences.",
                "*7) Here, Allah",
                " has used two words for these people,",
                " kazib (liar) and kaffar (denier). They have",
                " been called kazib because they have falsely",
                " invented this creed by themselves, and then",
                " they spread falsehood among others. As for",
                " kaffar. it has two meanings: (1) A",
                " stubborn disbeliever, i.e.. the people who insist",
                " on their false creed even after the",
                " doctrine of Tauhid has come before them;",
                " and (2) ungrateful for blessings, i.e. they",
                " arc receiving all kinds of blessings from",
                " Allah, but are thanking those other beings",
                " about whom they have assumed that these",
                " blessings are reaching them through their agency",
                " and influence."
            ]
        },
        {
            "id": "[39:4]",
            "verse": "If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing.",
            "description": [
                "That is, \"It is just impossible that",
                " Allah should havc begotten a son. The",
                " only possibility is that Allah should choose",
                " someone for Himself; and whomever He chooses",
                " will inevitably be from among the creatures,",
                " for everything in the world, apart from",
                " Allah, is His creation. Now, evidently, however",
                " exalted and chosen a creature might be,",
                " it cannot havc the position of the",
                " offspring. For between the Creator and the",
                " created there exists a great disparity of",
                " nature and essence and character, and parenthood",
                " necessarily demands that there should be the",
                " unity of nature and essence between a",
                " father and his offspring.\" Besides, one should",
                " also bear in mind the point that",
                " the words: \"Had Allah willed to take",
                " a son, He would......\" themselves give the",
                " meaning that Allah has never willed so.",
                " Here the object is to impress that",
                " not to speak of taking a son,",
                " Allah has never even willed so.",
                "*9)",
                " The following are the arguments by which",
                " the doctrine of parenthood has been refuted:",
                " First, that Allah is free from every",
                " defect and fault and weakness. Obviously, children",
                " are nee ded by the one who",
                " is defective and weak; the one who",
                " is mortal stands in need of them,",
                " so that his progeny should continue to",
                " live after him in the world. Likewise,",
                " he who adopts a son does so",
                " either because he feels the need of",
                " having an heir, being childless himself, or",
                " he adopts a son being overpowered by",
                " love of somebody. Attributing such human weaknesses",
                " to Allah and forming religious creeds on",
                " their basis is nothing but ignorance and",
                " shortsightedness. The second argument is that Allah",
                " in His essence and Being is unique:",
                " He is not a member of a",
                " species, whereas, evidently, offspring must necessarily belong",
                " to a species. Furthermore, there can be",
                " no concept of offspring without marriage, and",
                " marriage can take place only between homogeneous",
                " individuals. Therefore, the one who proposes offspring",
                " for the Unique and Matchless Being like",
                " Allah, is ignorant and foolish: The third",
                " argument is that Allah is Omnipotent, i.e.",
                " whatever is there in the world is",
                " subdued to Him and is held in",
                " His powerful grasp. No one in this",
                " Universe has any resemblance with Him in",
                " any way or degree on account of",
                " which it may be imagined that he",
                " has some relation with Allah."
            ]
        },
        {
            "id": "[39:5]",
            "verse": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.",
            "description": [
                "For explanation, sec Ibrahim: 19, An-Nahl: 3,",
                " Al-'Ankabut: 44, and the E.N.'s thereof.",
                "*11)",
                " That is, \"He is All-Mighty: if He",
                " wills to punish you, no power can",
                " resist Him. But it is His kindness",
                " that He dces not seize you forthwith",
                " in spilt of your arrogant and insolent",
                " behaviour, but He goes on giving you",
                " respite after respite.\" Here, Allah's making no",
                " haste in seizing people in punishment and",
                " His giving them respite has been called",
                " forgiveness."
            ]
        },
        {
            "id": "[39:6]",
            "verse": "He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates. He creates you in the wombs of your mothers, creation after creation, within three darknesses. That is Allah, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?",
            "description": [
                "This dces not mean that first He",
                " created the human beings from Adam and",
                " then created his wife, Eve. But here,",
                " instead of the chronological order, there is",
                " the order of presentation, examples of which",
                " arc found in every language. For instance,",
                " we say, \"Whatever you did today is",
                " known to me, and whatever you did",
                " yesterday is also in my knowledge.\" This",
                " cannot mean that what happened yesterday has",
                " happened after today.",
                "*13) That is, the",
                " camel, cow, sheep and goat whose four",
                " males and four females together make eight",
                " heads of cattle.",
                "*14) The three dark",
                " veils are: the belly, the womb and",
                " the caul or membrane enclosing the foetus.",
                "",
                "*15) \"Your Lord\" : your Master, Ruler",
                " and Providence.",
                "*16) That is, \"All powers",
                " and authority rest with Him and it",
                " is He Who is ruling over the",
                " whole Universe. \"",
                ">*17) In other words,",
                " the reasoning is this: \"When Allah alone",
                " is your Lord and His is the",
                " sovereignty, then inevitably your Deity also is",
                " He. How can another be your deity",
                " when he has neither any share in",
                " providence nor any role in sovereignty? After",
                " all, how can it be reasonable for",
                " you to take others as your deities",
                " when Allah alone is the Creator of",
                " the heavens and the earth, when Allah",
                " alone has subjected the sun and the",
                " moon for you, when He alone brings",
                " the day after the night and the",
                " night after the day, and when He",
                " alone is your own Creator and Lord",
                " as well as of all animals and",
                " cattle?\"",
                "*18) These words need deep consideration.",
                " It has not been said: \"Where are",
                " you turning away?\" but 'where are you",
                " being turned away?\" That is, \"There is",
                " someone else who is misleading you, and",
                " being thus deceived you do not understand",
                " such a simple and reasonable thing. \"",
                " The other thing which by itself becomes",
                " evident from the style is: The word",
                " \"you\" is not addressed to the agents",
                " but to those who were turning away",
                " under their influence. Their is a subtle",
                " point in this which can be understood",
                " easily after a little thought. Those who",
                " were working to turn away others (from",
                " the Right Way) were present in the",
                " same society and were doing whatever they",
                " could openly and publicly. Therefore, there was",
                " no need to mention them by name.",
                " It was also useless to address them,",
                " for they were trying to turn away",
                " the people from the service of Allah,",
                " the One, and entrapping them for the",
                " service of others, and keeping them entrapped",
                " for selfish motives. Obviously, such people could",
                " not be made to see reason by",
                " argument, for it lay in their own",
                " interest not' to understand and see reason,",
                " and even after understanding they could hardly",
                " be inclined to sacrifice their interests. However,",
                " the condition of the common people who",
                " were being deceived and cheated, was certainly",
                " pitiable. They had no interest involved in",
                " the business; therefore, they could be convinced",
                " by reasoning and argument, and after a",
                " little understanding they could also see what",
                " advantages were being gained by those who",
                " were showing them the way to other",
                " deities, after turning them away from Allah.",
                " That is why the address has been",
                " directed to the common people, who were",
                " being misguided rather than those few who",
                " were misguiding them."
            ]
        },
        {
            "id": "[39:7]",
            "verse": "If you disbelieve - indeed, Allah is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves it for you; and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you about what you used to do. Indeed, He is Knowing of that within the breasts.",
            "description": [
                "That is, \"Your disbelief cannot cause any",
                " decrease or deficiency in His Kingdom. He",
                " will be God if you believe in",
                " Him, and He will still be God",
                " if you deny Him. He is ruling",
                " over His Kingdom by His own power;",
                " your believing or denying Him dces not",
                " affect His Sovereignty in any way.\" According",
                " to a Hadith. Allah says: \"O My",
                " servants, if all of you, the former",
                " and the latter, the men and the",
                " jinns, become like the heart of a",
                " most sinful person among you, it will",
                " cause no deficiency whatever in My Kingdom.",
                " \" (Muslim).",
                "*20) That is, \"He does",
                " not approve, not for any interest of",
                " His own but for the interest and",
                " benefit of the servants themselves, that they",
                " should disbelieve, for disbelief is harmful for",
                " them.\" Here, one should bear in mind",
                " the fact that AIlah's will is one",
                " thing and His approval and pleasure another.",
                " Nothing in the world can happen against",
                " Allah's will, but many things can happen",
                " against His approval, and arc happening day",
                " and night. For example, the dominance of",
                " the tyrants and the wicked in the",
                " world, the existence of thieves and robbers,",
                " the presence of murderers and adulterers, are",
                " possible only because Allah has made room",
                " for the occurrence of these evils and",
                " the existence of these criminals in the",
                " scheme of things ordained by Him. Then",
                " He provides opportunities also of committing evil",
                " just as He provides opportunities to the",
                " good of doing good. Had He made",
                " no room for these evils and had",
                " provided no opportunities of committing wrongs to",
                " the evildoers, no evil would have ever",
                " occurred in the world. All this is",
                " based on Allah's Will. But the occurrence",
                " of an act under Divine Will dces",
                " not mean that Allah's approval also goes",
                " with it. This may be explained by",
                " an example. If a person tries to",
                " obtain his living only by lawful means,",
                " Allah provides him his living through those",
                " means. This is His will. But providing",
                " for the thief or the robber or",
                " the corrupt person under the will dces",
                " not mean that Allah also likes stealing",
                " and robbery and taking of bribes. Allah",
                " says the same thing here, as if",
                " to say: \"If you want to disbelieve,",
                " you may do so: We will not",
                " stop you from this nor make you",
                " believe forcibly. But We do not approve",
                " that you should deny your Creator and",
                " Providence, being His servants, for it is",
                " harmful for yourselves: Our Godhead is not",
                " harmed and affected by it in any",
                " way.\"",
                "*21) The word shukr (gratitude) has",
                " been used here as against kufr (disbelief)",
                " instead of Iman (belief). This by itself",
                " shows that kufr is, in fact, ingratitude",
                " and disloyalty, and faith is the necessary",
                " requirement of gratitude. The person who has",
                " any feeling of the favours of Allah",
                " Almighty, cannot adopt any other way than",
                " that of belief and faith. Therefore, gratitude",
                " and faith are correlatives: wherever there is",
                " gratitude there will be faith also. On",
                " the contrary, wherever there is disbelief, there",
                " will be no question of gratitude at",
                " all, for gratitude along with disbelief is",
                " meaningless.",
                "*22) It means this: \"Each one",
                " of you is himself responsible for his",
                " deeds, If a person adopts disbelief in",
                " order to please others, or to avoid",
                " their displeasure, those others will never bear",
                " the burden of his disbelief, but will",
                " leave him to bear his own burden.",
                " Therefore, anyone who comes to know that",
                " disbelief is wrong and belief is right,",
                " should give up the wrong attitude. and",
                " adopt the right attitude, and avoid making",
                " himself liable for Allah's punishment by associating",
                " himself with his family or brotherhood or",
                " nation. \""
            ]
        },
        {
            "id": "[39:8]",
            "verse": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\"",
            "description": [
                "\"The man\": the disbeliever who adopted the",
                " way of ingratitude.",
                "*24) That is, \"At",
                " that time he dces not remember those",
                " other deities whom he used to invoke",
                " in good times; but he despairs of",
                " them all and turns only to Allah,",
                " Lord of the worlds.\" This is a",
                " clear proof of the fact that in",
                " the depths of his heart he has",
                " the feeling that all other deities are",
                " helpless, and the realization that Allah alone",
                " is the Possessor of all powers and",
                " authority, lies buried and hidden deep in",
                " his mind. \"",
                "*25) That is, \"He",
                " again forgets the bad times when abandoning",
                " all other deities he was invoking only",
                " Allah, the One.\"",
                "*26) That is, \"He",
                " again starts serving others: he obeys them,",
                " prays to them and makes offerings before",
                " them.\"",
                "*27) That is, \"He is not",
                " content with his own self having gone",
                " astray, but also leads others astray, telling",
                " them that the affliction which had befallen",
                " him, had been averted by the help",
                " of such and such a pious man",
                " or saint, or god and goddess.\" Thus,",
                " many other people also put their faith",
                " in these deities besides Allah, and are",
                " further misled as the ignorant and foolish",
                " people describe their experiences before them."
            ]
        },
        {
            "id": "[39:9]",
            "verse": "Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Only they will remember [who are] people of understanding.",
            "description": [
                "It should be noted that two kinds",
                " of the men are being contrasted here.",
                " First, those who turn to Allah when",
                " a calamity befalls them, but worship others",
                " than Allah normally. Second, those who have",
                " made it their permanent way of life",
                " to obey Allah and worship and serve",
                " Him, and their worshipping Him in solitude",
                " during the night is a proof of",
                " their sincerity. The first kind of the",
                " men have been called ignorant by Allah,",
                " even if they might have devoured whole",
                " libraries. And the second kind of the",
                " men have been called the learned, even",
                " if they might be illiterate. For the",
                " real supremely important thing is the knowledge",
                " of the Truth and man's action according",
                " to it, and on this depends his",
                " true success. Allah asks: How can these",
                " two be equal? How can they possibly",
                " follow the same way together in the",
                " world, and meet with the same end",
                " in the Hereafter?"
            ]
        },
        {
            "id": "[39:10]",
            "verse": "Say, \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.\"",
            "description": [
                "That is, 'Do not rest content with",
                " belief but follow it up with piety",
                " and fear of God. Act according to",
                " what Allah has enjoined and avoid what",
                " He has forbidden and live in the",
                " world fearing His accountability . \"",
                "*30)",
                " Good and well-being both of this world",
                " and of the Hereafter.",
                "*31) That is,",
                " \"If one city, territory or land has",
                " become difficult for the worshippers of Allah,",
                " they may emigrate to another place where",
                " they may not have to face any",
                " such hardship. \"",
                "*32) \"Those . .",
                " . measure\" : Those who brave all",
                " kinds of hardships and persecutions in following",
                " the way of God-worship and piety but",
                " do not abandon the way of the",
                " Truth. This also includes those people who",
                " emigrate to other countries and experience hardships",
                " in the foreign land for the sake",
                " of religion and faith, and those also",
                " who continue to face every kind of",
                " temptation and calamity firmly and patiently in",
                " the land where they are being persecuted.\"",
                ""
            ]
        },
        {
            "id": "[39:11]",
            "verse": "Say, [O Muhammad], \"Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:12]",
            "verse": "And I have been commanded to be the first [among you] of the Muslims.\"",
            "description": [
                "That is, \"My mission is not only",
                " to exhort others but also to practise",
                " what I preach myself: I first myself",
                " follow the way which I call others",
                " to follow.\""
            ]
        },
        {
            "id": "[39:13]",
            "verse": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:14]",
            "verse": "Say, \"Allah [alone] do I worship, sincere to Him in my religion,",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:15]",
            "verse": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\"",
            "description": [
                "Bankruptcy is loss of a person's capital",
                " and failure of his business so that",
                " he is unable to pay his debts",
                " in full. This same metaphor Allah has",
                " used here for the disbelievers and polytheists,",
                " The sum total of whatever man has",
                " got in this world-his life, his intellect,",
                " body, powers, capabilities, means and opportunities-is in",
                " fact, the capital, which he invests in",
                " the business of the worldly life. If",
                " a person invested this whole capital on",
                " the hypothesis that there is no God,",
                " or that there are many gods, whose",
                " servant he is, and that he is",
                " not accountable to anyone, or that someone",
                " else will rescue him on Judgment Day,",
                " it would mean that he made a",
                " losing bargain and lost all his capital.",
                " This is his first loss. His second",
                " loss is that in everything that he",
                " did, on the basis of the wrong",
                " hypothesis, he went on wronging himself and",
                " many other men, and the coming generations",
                " and many other creatures of Allah, throughout",
                " his life. Thus, he got into countless",
                " debts, but has no money with which",
                " he may fully pay his debts. Over",
                " and above this, he has not only",
                " himself incurred this loss, but has caused",
                " the same loss to his children and",
                " near and dear once and friends and",
                " fellow countrymen by his wrong education and",
                " training and wrong example. It is these",
                " three losses together which Allah has called",
                " khusran-i-mubin (utter bankruptcy) in this verse."
            ]
        },
        {
            "id": "[39:16]",
            "verse": "They will have canopies of fire above them and below them, canopies. By that Allah threatens His servants. O My servants, then fear Me.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:17]",
            "verse": "But those who have avoided Taghut, lest they worship it, and turned back to Allah - for them are good tidings. So give good tidings to My servants",
            "description": [
                "Taghut is from tughyan and means rebellion.",
                " If someone is called taghut (rebellion) instead",
                " of taghi (rebel), it would mean that",
                " he is a rebel incarnate. For example,",
                " if a person is called husn (beauty)",
                " instead of hasin (beautiful), it would mean",
                " that he has reached perfection in beauty.",
                " The other deities than Allah have been",
                " called taghut because it is rebellion to",
                " worship others besides Allah, but the one",
                " who has others worship him, is a",
                " rebel of the worst kind. (For further",
                " explanation, see AI-Baqarah: 256, Al-Nisa: 60, 76,",
                " An-Naml: 36 and the E.N.'s thereof)."
            ]
        },
        {
            "id": "[39:18]",
            "verse": "Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding.",
            "description": [
                "This verse can have two meanings: (1)",
                " That they do not follow every voice",
                " but ponder over what every man says",
                " and accept only what is right and",
                " true; and (2) that they do not",
                " try to give a false meaning to",
                " what they hear but adopt its good",
                " and righteous aspects."
            ]
        },
        {
            "id": "[39:19]",
            "verse": "Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?",
            "description": [
                "That is, the person who has made",
                " himself worthy of Allah's punishment and about",
                " whom Allah has already decided that he",
                " will be punished."
            ]
        },
        {
            "id": "[39:20]",
            "verse": "But those who have feared their Lord - for them are chambers, above them chambers built high, beneath which rivers flow. [This is] the promise of Allah. Allah does not fail in [His] promise.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:21]",
            "verse": "Do you not see that Allah sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding.",
            "description": [
                "The word yanabi` in the Text is",
                " comprehensive and applies to all the three",
                " sources of water.",
                "*39) That is, \"A",
                " man of understanding learns this lesson from",
                " it that the life of this world",
                " and its adornments are all transitory: the",
                " end of every spring is autumn; the",
                " fate of every youth is weakness and",
                " death; and every rise has a fall.",
                " Therefore, this world is not something of",
                " which one should be charmed and enamoured",
                " so as to forget God and the",
                " Hereafter and should conduct himself here in",
                " a manner as to nun his Hereafter,",
                " only for the sake of enjoying the",
                " short lived pleasures of this world. Then",
                " a man of understanding also learns this",
                " lesson from these phenomena that the spring",
                " and autumn of this world are only",
                " under Allah's control: Allah allows to grow",
                " and prosper whomever He wills and ruins",
                " and lays waste whomever He wills. Neither",
                " it is in anybody's power to stop",
                " the growth of someone whom Allah wills",
                " to grow, nor has anyone the power",
                " to save him from destruction whom Allah",
                " wills to destroy."
            ]
        },
        {
            "id": "[39:22]",
            "verse": "So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error.",
            "description": [
                "\"Whose breast... Islam\": Whom Allah helps to",
                " learn a lesson from these realities and",
                " to be satisfied with Islam as based",
                " on the Truth. Opening of a man's",
                " breast for something is, in fact, a",
                " state in which there remains no anxiety",
                " or ambiguity or suspicion and doubt in",
                " his mind about the thing, nor has",
                " he the feeling of any danger and",
                " loss in accepting and adopting it, but",
                " he decides with full satisfaction of the",
                " heart that it is the Truth; therefore,",
                " he must follow it whatever be the",
                " consequences. Having made such a decision when",
                " a person adopts the way of Islam,",
                " he obeys whatever Command he receives from",
                " Allah and His Messenger willingly and with",
                " pleasure, without any hesitation. He accepts whatever",
                " beliefs and ideas, rules and regulations, he",
                " comes across in the Book of Allah",
                " and the Sunnah of His Prophet as",
                " if they were the voice of his",
                " own heart. He does not feel any",
                " compunction on giving up an unlawful gain,",
                " because he believes that it was no",
                " gain for him at all; it was",
                " rather a loss from which Allah saved",
                " him by His grace. Likewise, even if",
                " he incurs a loss while following the",
                " way of righteousness, he dces not feel",
                " sad about this but bears it with",
                " patience and regards it as an ordinary",
                " loss as compared to the loss of",
                " turning away from the Way of Allah.",
                " The same is his behaviour on confronting",
                " dangers. He believes that there is no",
                " other way for him, which he may",
                " follow in order to avoid the danger.",
                " The Straight Way of AIlah is only",
                " one, which he has to follow in",
                " any case: if there is a danger",
                " in following it, let it be.",
                "*41)",
                " \"In the light shown by his Lord\"",
                " : In the light of the knowledge",
                " of the Book of Allah and the",
                " Sunnah of His Prophet, by the help",
                " of which he sees clearly at every",
                " step which is the straight path of",
                " the Truth among the countless by-paths of",
                " life.",
                "*42) As against the opening of",
                " the breast there can be two other",
                " states of man's heart: (1) The state",
                " of narrowing of the breast and squeezing",
                " of the heart; and in this state",
                " there still remains some room for the",
                " truth to permeate it; and (2) the",
                " state of hardening or petrifying of the",
                " heart; in this there is left no",
                " room whatever for the truth to permeate.",
                " About this second state Allah says that",
                " the person who reaches such a stage",
                " is totally ruined. This means that if",
                " a person becomes inclined to accept the",
                " truth, even though with an unveiling and",
                " squeezed heart, there remains some possibility for",
                " him to be redeemed. This second theme",
                " becomes obvious from the style and tenor",
                " of the verse itself, though Allah has",
                " not stated it directly. For the real",
                " intention of the verse was to warn",
                " those who were bent upon stubbornness in",
                " their antagonism towards the Holy Prophet, and",
                " had made up their mind not to",
                " listen to him at all. For this",
                " they have been warned, as if to",
                " say: \"You take pride in this stubbornness",
                " of yours, but, as a matter of",
                " fact, there cannot be a greater misfortune",
                " and unworthiness of man than that his",
                " heart should become even more hardened, instead",
                " of becoming soft, when he hears Allah",
                " being mentioned and the admonition sent by",
                " Him. \""
            ]
        },
        {
            "id": "[39:23]",
            "verse": "Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide.",
            "description": [
                "That is, there is no contradiction and",
                " disagreement between them. The whole Book, from",
                " the beginning to the end, projects one",
                " and the same aim, one and the",
                " same belief, and one and the same",
                " system of thought and action. Each of",
                " its parts confirms and supports and explains",
                " the other themes; and there is perfect",
                " consistency in it both in meaning and",
                " in style."
            ]
        },
        {
            "id": "[39:24]",
            "verse": "Then is he who will shield with his face the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, \"Taste what you used to earn.\"",
            "description": [
                "One takes a blow on one's face",
                " only when one is absolutely helpless and",
                " powerless, otherwise until one has some power",
                " to resist, one goes on receiving the",
                " blows on the other parts of one's",
                " body but saves one's face. Therefore, here",
                " the extreme state of helplessness of a",
                " person has been depicted, saying that he",
                " will receive the severe punishment on his",
                " face.",
                "*45) The word kasab, in the",
                " Qur'anic terminology, implies one's descrying and earning",
                " a reward and punishment in consequence of",
                " one's actions and deeds. The real earning",
                " of a doer of good is that",
                " he becomes worthy of Allah's reward, and",
                " the earning of the evil-doer is the",
                " punishment that he will receive in the",
                " Hereafter."
            ]
        },
        {
            "id": "[39:25]",
            "verse": "Those before them denied, and punishment came upon them from where they did not perceive.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:26]",
            "verse": "So Allah made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:27]",
            "verse": "And We have certainly presented for the people in this Qur'an from every [kind of] example - that they might remember.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:28]",
            "verse": "[It is] an Arabic Qur'an, without any deviance that they might become righteous.",
            "description": [
                "That is, \"It has not been sent",
                " down in a foreign language so that",
                " the people of Makkah and Arabia should",
                " stand in need of a translator or",
                " interpreter, but it is in their own",
                " language, which they can understand directly.\"",
                "*47)",
                " That is, \"There is nothing of double-dealing",
                " in it so that a common man",
                " should find it difficult to understand, but",
                " everything has been presented in it in",
                " a straightforward manner, from which everyone can",
                " know what this Book states as wrong",
                " and why, what it states as right",
                " and on what ground, what it wants",
                " the people to accept and what it",
                " wants them to reject, and what it",
                " enjoins and what it forbids.\""
            ]
        },
        {
            "id": "[39:29]",
            "verse": "Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allah! But most of them do not know.",
            "description": [
                "Allah in this parable has explained the",
                " difference between shirk and Tauhid and the",
                " impact each has on human life so",
                " clearly that it is not possible to",
                " put across such a vast theme so",
                " concisely and effectively in other words. Everyone",
                " will admit that the person who has",
                " many masters, each one pulling hire to",
                " himself, and the masters also so ill-tempered",
                " that no one spares him time in",
                " his service to obey the other, and",
                " no one rests content only with threatening",
                " and cursing him if he fails to",
                " carry out his command from among the",
                " contradictory commands of the other masters, but",
                " is bent upon punishing him, his life",
                " would certainly be in great anguish. On",
                " the contrary, the person who is the",
                " slave or servant of only one master,",
                " would be living a life of ease",
                " and comfort because he will not have",
                " to serve and seek the pleasure of",
                " another master. This is such a straightforward",
                " thing which dces not need deep consideration",
                " for its understanding. After this it remains",
                " no longer difficult for a person to",
                " understand that the peace of mind and",
                " satisfaction that accrue to him from the",
                " service of One God, can never accrue",
                " from the service of many gods. Here,",
                " it should be understood well that the",
                " parable of many ill-tempered and contesting masters",
                " cannot apply to the images of stone,",
                " but it only applies to living masters,",
                " who practically give contradictory commands to man",
                " and keep pulling him to themselves in",
                " actual reality. One such master sits in",
                " one's own self, which presents before him",
                " desires of every kind and compels him",
                " to fulfil them. Other countless masters are",
                " there in the house, in the family,",
                " in the brotherhood, in the society, among",
                " the religious guides and the rulers and",
                " legislators, in the business and economic circles",
                " and among the dominant powers of civilization",
                " whose contradictory demands and requirements keep on",
                " pulling man to themselves at All times;",
                " then any god whose demand he fails",
                " to fulfll in any way, dces not",
                " Iet him go unpunished in his own",
                " circle. However, each one's instrument of punishment",
                " is different. Someone causes a heart-break, another",
                " takes offence, another humiliates, another boycotts, another",
                " bankupts, another makes a religious or a",
                " legal attack. Man has no other way",
                " of being saved from this anguish and",
                " agony but to adopt the Way of",
                " Tauhid and become the slave of One",
                " God, and throw off the yoke of",
                " servitude of every other god. Adoption of",
                " the Way of Tauhid also has two",
                " forms, which lead to different results: First,",
                " that an individual should decide to become",
                " the servant of One God individually but",
                " his environment is hostile. In this case",
                " the external conflict and his anguish and",
                " agony might increase, but if he has",
                " adopted the Way sincerely, internal peace and",
                " satisfaction will necessarily accrue. He will turn",
                " down every such desire of the self",
                " as goes against the Divine Commands, or",
                " whose fulfillment may clash with the demands",
                " of God-worship. He will also reject every",
                " such demand of the family, society, nation,",
                " government, religious guides and economic powers that",
                " conflicts with the Divine Law. Consequently, he",
                " might have to face extreme hardships, rather",
                " he will surely face, but his heart",
                " will have full satisfaction that he is",
                " fulfilling the demand of the servitude of",
                " that God Whose servant he actually is,",
                " and that those whose servant he is",
                " not, have no right on him, because",
                " of which he may have to serve",
                " them against the Command of his God.",
                " No power of the world can deprive",
                " him of this satisfaction of the heart",
                " and peace of mind; so much so",
                " that even if he has to go",
                " to the gallows for its sake, he",
                " will go to it with a clear",
                " conscience, and he will have no compunction",
                " as to why he did not save",
                " his life by bowing before the false",
                " gods. The second form is that the",
                " whole society be established on the basis",
                " of the Tauhid imbibing the principles of",
                " morality, civilization, culture, education, religion, law, social",
                " custom, politics, economics in every sphere of",
                " life as a creed, which the Master",
                " of the Universe has given through His",
                " Book and His Messenger. The law should",
                " declare as a crime everything which God's",
                " religion has declared sinful and the government",
                " administration should try to eradicate the same;",
                " the system of education and training should",
                " prepare the minds and character to avoid",
                " the same; the same should be condemned",
                " from the religious pulpit, and regarded as",
                " vicious and forbidden in every economic enterprise.",
                " Likewise, everything that Allah's religion has declared",
                " as good and virtuous should be protected",
                " and defended by the law, developed by",
                " the administrative forces, impressed in the minds",
                " and instilled in character by the entire",
                " system of education and training, infused from",
                " the religious pulpit, admired by the society",
                " and followed by it practically and enforced",
                " in every economic enterprise. This is how",
                " man can attain to perfect internal and",
                " external peace and satisfaction, and all the",
                " doors to material and spiritual progress are",
                " thrown open, for the conflict in it",
                " between God-worship and the worship of others",
                " would be reduced to the minimum. Although",
                " Islam invites every single individual to adopt",
                " Tauhid as his creed and to worship",
                " Allah alone, braving every danger and hardship,",
                " even in the absence of the established",
                " order, it cannot be denied that Islam's",
                " ultimate aim and object is to establish",
                " this second order, and the same has",
                " been the objective of the endeavors of",
                " all the Prophets: to bring into existence",
                " a community of the Muslims, who should",
                " follow Allah's religion collectively, free from the",
                " domination and influence of unbelief and the",
                " unbelievers, No one. unless he is unaware",
                " of the Qur'an and the Sunnah and",
                " senseless, can say that the objective of",
                " the Prophets' struggle has been only the",
                " faith and obedience of the individual, and",
                " that it has never been their aim",
                " to enforce and establish Islam in the",
                " society and state.",
                "*49) Here, in order",
                " to understand the real significance of al-hamdu-lillah",
                " (praise be to Allah), one should visualise",
                " this scene: after presenting the above question",
                " before the people the speaker observed a",
                " pause so that the opponents of Tauhid",
                " could give an answer to it if",
                " they had any. Then, when they could",
                " not give any answer, and from nowhere",
                " it was said that both were equal,",
                " the speaker said: \"AI-hamdu-lillah: Thank God that",
                " you too appreciate the difference between the",
                " two situations and none among you can",
                " dare say that slavery to many masters",
                " is better than slavery to one master,",
                " or that both are equal. \"",
                "*50)",
                " That is, \"You fully understand and appreciate",
                " the difference between to many masters, but",
                " when you arc made to God-worship and",
                " the worship of many gods, slavery to",
                " one master and slavery understand the difference",
                " between you show lack of understanding. \"",
                ""
            ]
        },
        {
            "id": "[39:30]",
            "verse": "Indeed, you are to die, and indeed, they are to die.",
            "description": [
                "There is a subtle gap between the",
                " preceding sentence and this, which can be",
                " filled by every intelligent person himself by",
                " a little consideration of the context. It",
                " contains this theme: \"You are making every",
                " effort to make the people understand a",
                " simple thing in a simple way, but",
                " they are not only showing stubbornness with",
                " regard to what you say and rejecting",
                " it but are also bent upon harming",
                " you in order to suppress the manifest",
                " truth. Well, neither you are immortal nor",
                " they : both you and they have",
                " to die one day: then, each of",
                " you will experience his own end.\""
            ]
        },
        {
            "id": "[39:31]",
            "verse": "Then indeed you, on the Day of Resurrection, before your Lord, will dispute.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:32]",
            "verse": "So who is more unjust than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:33]",
            "verse": "And the one who has brought the truth and [they who] believed in it - those are the righteous.",
            "description": [
                "It means this: \"As to who will",
                " receive punishment in the trial before Allah",
                " on the day of Resurrection, you should",
                " note it well that the punishment inevitably",
                " will be inflicted on those wicked people",
                " who invented a false creed that there",
                " were other associates also with AIlah, who",
                " had a share in His Being, authority,",
                " powers and rights, and worse than that,",
                " when the truth was presented before them,",
                " they not only paid no heed to",
                " it, but, on the contrary, treated the",
                " one who presented it as an impostor.",
                " As far as the person who came",
                " with the truth, and those who affirmed",
                " faith in him, are concerned there can",
                " obviously be no question of their receiving",
                " any punishment from the Court of Allah.",
                " \""
            ]
        },
        {
            "id": "[39:34]",
            "verse": "They will have whatever they desire with their Lord. That is the reward of the doers of good -",
            "description": [
                "One should note that the words used",
                " here are inch Rabbi-him (with their Lord)",
                " and not fil-jannah (in Paradise), and obviously",
                " man reaches in the presence of his",
                " Lord just after death. Therefore, the intention",
                " of the verse seems to be: Not",
                " only after entering Paradise but right from",
                " the time of death till his entry",
                " into Paradise also AIlah will treat the",
                " righteous believer in the same kind manner.",
                " The believer will certainly desire to be",
                " saved from the torment of barzakh. from",
                " the severities of the Day of Resurrection",
                " and Judgment, from the humiliation of the",
                " Plain of Gathering and from the punishment",
                " of his errors and shortcomings, and Allah",
                " Almighty will fulfil all his desires."
            ]
        },
        {
            "id": "[39:35]",
            "verse": "That Allah may remove from them the worst of what they did and reward them their due for the best of what they used to do.",
            "description": [
                "The people who believed in the Holy",
                " Prophet had happened to commit most heinous",
                " sins, both ideological and moral, in the",
                " days of ignorance, and after affirmation of",
                " the faith the good that they did",
                " was not only that they gave up",
                " the falsehood they had been professing and",
                " accepted the Truth that the Holy Prophet",
                " had presented, but in addition, they had",
                " performed the best righteous acts in morality.",
                " devotion and in their dealing's with others,",
                " Allah says: The worst deeds that they",
                " had committed in the days of ignorance",
                " will be wiped off from their account,",
                " and they will be rewarded for the",
                " best of their deeds found in their",
                " conduct book."
            ]
        },
        {
            "id": "[39:36]",
            "verse": "Is not Allah sufficient for His Servant [Prophet Muhammad]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allah leaves astray - for him there is no guide.",
            "description": [
                "The disbelievers of Makkah used to say",
                " to the Holy Prophet, \"You behave insolently",
                " in respect of our deities and utter",
                " rude words against them : you do",
                " not know how powerful they are and",
                " what miraculous powers they possess. Anybody who",
                " dishonoured them was ruined. If you also",
                " do not desist from what you say",
                " against them, you too will be annihilated.",
                " \""
            ]
        },
        {
            "id": "[39:37]",
            "verse": "And whoever Allah guides - for him there is no misleader. Is not Allah Exalted in Might and Owner of Retribution?",
            "description": [
                "That is, \"This also is a result",
                " of their lack of guidance that the",
                " foolish people esteem highly the power and",
                " honour of their deities but they never",
                " think that Allah also is Almighty and",
                " they can also be punished for insulting",
                " Him by the shirk they are committing",
                " against Him. \""
            ]
        },
        {
            "id": "[39:38]",
            "verse": "And if you asked them, \"Who created the heavens and the earth?\" they would surely say, \"Allah.\" Say, \"Then have you considered what you invoke besides Allah? If Allah intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?\" Say, \"Sufficient for me is Allah; upon Him [alone] rely the [wise] reliers.\"",
            "description": [
                "Ibn Abi Hatim has related from Ibn",
                " `Abbas that the Holy Prophet said: 'The",
                " person who desires that he should become",
                " most powerful among men should repose his",
                " trust in Allah; and the person who",
                " desires that he should become the wealthiest",
                " among men should have more trust in",
                " that which is with Allah than that",
                " which is in his own hand; and",
                " the person who desires that he should",
                " become most honourable among men should fear",
                " Allah Almighty.\""
            ]
        },
        {
            "id": "[39:39]",
            "verse": "Say, \"O my people, work according to your position, [for] indeed, I am working; and you are going to know",
            "description": [
                "That is, 'You may go on doing",
                " what you can in order to harm",
                " me and do not give me any",
                " respite."
            ]
        },
        {
            "id": "[39:40]",
            "verse": "To whom will come a torment disgracing him and on whom will descend an enduring punishment.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:41]",
            "verse": "Indeed, We sent down to you the Book for the people in truth. So whoever is guided - it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager over them.",
            "description": [
                "That is, 'It is not for you",
                " to bring them to the Right Path.",
                " Your only duty is to present the",
                " Right Path before them. If they prefer",
                " to remain astray after that, you are",
                " not responsible for it.\""
            ]
        },
        {
            "id": "[39:42]",
            "verse": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.",
            "description": [
                "\"Taking the souls during sleep\" implies the",
                " suspension of the powers of feeling and",
                " consciousness, understanding and will.",
                "*61) By this",
                " Allah wants every man to realize how",
                " life and death are entirely in His",
                " own hand. No one has the guarantee",
                " that he will certainly get up alive",
                " in the morning when he goes to",
                " sleep at night. No one knows what",
                " disaster could befall him within a moment,",
                " and whether the next moment would be",
                " a moment of life for him or",
                " of death. At any time, while asleep",
                " or awake, in the house or outside",
                " it, some unforeseen calamity, from inside his",
                " body or from outside, can, suddenly cause",
                " his death: Thus, man who is so",
                " helpless in the hand of God, .would",
                " be foolish if he turned away from",
                " the same God or became heedless of",
                " Him."
            ]
        },
        {
            "id": "[39:43]",
            "verse": "Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\"",
            "description": [
                "That is, \"In the first place, these",
                " people have foolishly presumed that there are",
                " some beings who wield great influence with",
                " Allah, and whose intercession is never turned",
                " down, whereas there is no proof of",
                " their being intercessors at all, nor has",
                " Allah ever said that they hold such",
                " a position with Him, nor did these",
                " beings themselves ever claim that they would",
                " use their influence with Allah and help",
                " them out in every case. Another folly",
                " of these people is that they have",
                " ignored the real Master and have believed",
                " the imaginary beings to be allpowerful, who",
                " deserve to receive all their devotion and",
                " dedication. \""
            ]
        },
        {
            "id": "[39:44]",
            "verse": "Say, \"To Allah belongs [the right to allow] intercession entirely. To Him belongs the dominion of the heavens and the earth. Then to Him you will be returned.\"",
            "description": [
                "That is, \"Not to speak of getting",
                " his intercession granted, no one has the",
                " power to stand before Allah as an",
                " intercessor. The right to grant or not",
                " to grant anyone the permission to intercede",
                " with Him exclusively rests with Allah. Then",
                " He may allow intercession for whomever He",
                " may please and forbid for whomever He",
                " may please. \" (For understanding the difference",
                " between the Islamic concept of intercession and",
                " the polytheistic concept, see Al-Baqarah: 255, Al-An`am:",
                " 51, Yunus: 3, 18, Hud: 105, Ar-Ra`d",
                " 11, An-Naml: 73, 84, Ta Ha: 109-110,",
                " Al-Anbiya': 23, Al-Hijr: 76, and the E.N.'s",
                " thereof and E.N. 40 of Saba."
            ]
        },
        {
            "id": "[39:45]",
            "verse": "And when Allah is mentioned alone, the hearts of those who do not believe in the Hereafter shrink with aversion, but when those [worshipped] other than Him are mentioned, immediately they rejoice.",
            "description": [
                "This evil is common to almost all",
                " polytheistic people of the world, and even",
                " some unfortunate Muslims also suffer from it,",
                " They profess with the tongue that they",
                " believe in Allah, but when One Allah",
                " alone is mentioned before them, their faces",
                " arc distorted, and they say, \"This man",
                " certainly does not believe in the saints",
                " and holy men; that is why he",
                " talks of Allah and Allah alone. \"",
                " And if others besides Allah arc mentioned,",
                " they are delighted, and their faces brighten",
                " up with joy. Their this attitude shows",
                " as to who is the actual object",
                " of their love and esteem. 'Allama Alusi,",
                " in his commentary Ruh al-Ma ani, has",
                " related his own experience here. He says:",
                " \"One day I saw that a man",
                " was invoking the help of a dead",
                " saint in his affliction. I said; O",
                " bondsman of Allah, invoke Allah, for He",
                " Himself says: 'If My servants ask you,",
                " O Prophet, concerning Me, tell them I",
                " am quite near to them. I hear",
                " and answer the prayer of the supplicant",
                " when he calls to Me,\" (AI-Baqarah: 186),",
                " Hearing this the man became angry, the",
                " people told me afterwards that he said:",
                " This man is a denier of the",
                " saints; and some others heard him also",
                " say: The saints answer the prayers more",
                " promptly than does Allah.\""
            ]
        },
        {
            "id": "[39:46]",
            "verse": "Say, \"O Allah, Creator of the heavens and the earth, Knower of the unseen and the witnessed, You will judge between your servants concerning that over which they used to differ.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:47]",
            "verse": "And if those who did wrong had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby from the worst of the punishment on the Day of Resurrection. And there will appear to them from Allah that which they had not taken into account.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:48]",
            "verse": "And there will appear to them the evils they had earned, and they will be enveloped by what they used to ridicule.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:49]",
            "verse": "And when adversity touches man, he calls upon Us; then when We bestow on him a favor from Us, he says, \"I have only been given it because of [my] knowledge.\" Rather, it is a trial, but most of them do not know.",
            "description": [
                "\"The man\" : the one who has",
                " aversion to Allah and whose face is",
                " distorted on hearing Allah alone being mentioned.",
                "",
                "*66) This sentence can have two meanings:",
                " (1) \"That Allah knows that I stn",
                " worthy of this blessing; that is why",
                " He has given me All this, otherwise",
                " He would not have blessed me if",
                " I had been an evil and wicked",
                " person in His sight;\" and (2) `that",
                " I have attained to this by virtue",
                " of my ability.\"",
                "*67) People ignorantly think",
                " that whoever is being blessed by Allah",
                " in some way is being so blessed",
                " necessarily on account of his worth and",
                " ability and that the same is a",
                " sign or proof of his being a",
                " favourite in His sight; whereas the fact",
                " is that whoever is being given something",
                " here, is being given it for the",
                " sake of a trial by Allah. This",
                " is a means of the test, and",
                " not any reward for ability, otherwise many",
                " able and worthy people would not be",
                " living in poverty and many unworthy people",
                " would not be rolling in prosperity. Likewise,",
                " these worldly blessings arc not a sign",
                " of one's being a favourite with AIlah",
                " either. Everyone can see that many good",
                " people whose goodness is unquestionable arc living",
                " in hardships in the world, and many",
                " wicked people whose evil-doing is well known",
                " arc enjoying the pleasures of life, Now,",
                " can a sensible man take the affliction",
                " of the one and the life of",
                " ease and comfort of the other as",
                " an argument to say that Allah hates",
                " the good matt and prefers the bad",
                " man?"
            ]
        },
        {
            "id": "[39:50]",
            "verse": "Those before them had already said it, but they were not availed by what they used to earn.",
            "description": [
                "That is, \"When they were seized for",
                " evil-doing, the ability of which they were",
                " so proud, did not avail them anything,",
                " and this also became known that they",
                " were not Allah's favourites. Evidently, if their",
                " earning had been due to their capability",
                " and their being favourites with Allah, they",
                " would not have been seized for evil-doing",
                " at all.\""
            ]
        },
        {
            "id": "[39:51]",
            "verse": "And the evil consequences of what they earned struck them. And those who have wronged of these [people] will be afflicted by the evil consequences of what they earned; and they will not cause failure.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:52]",
            "verse": "Do they not know that Allah extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe.",
            "description": [
                "That is, \"The Abundance or restriction of",
                " the provisions is based on another law",
                " of Allah, which has some other wisdom.",
                " The distribution of the provisions dces not",
                " at all depend on man's worthiness and",
                " ability, or on his being a favourite",
                " of Allah, or for being under His",
                " wrath. \" (For details, see At-Taubah: 55,",
                " 69, 85; Yunus: 17; Hud: 3, 27;",
                " Ar-Ra`d: 26; Al-Kahf: 34-36; Ta Ha: 131-132;",
                " AI-Anbiya': 105; Al-Mu`min: Introductian and vv. 55-56;",
                " Ash-Shu'ara`: 111; AI-Qasas: 78, 89 and the",
                " E N. thereof. and E.N.'s 54 to",
                " 60 of Saba)."
            ]
        },
        {
            "id": "[39:53]",
            "verse": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\"",
            "description": [
                "Some commentators have given a strange interpretation",
                " to these words. They say that Allah",
                " Himself has commanded the Holy Prophet to",
                " address the people as \"My servants\" therefore,",
                " all men are the servants of the",
                " Holy Prophet. This interpretation is no interpretation",
                " at all but a worst distortion of",
                " the meaning of the Qur'an and indeed",
                " tampering with the Word of Allah. If",
                " this interpretation were correct, it would falsify",
                " and negate the whole Qur'an. For the",
                " Qur'an, from the beginning to the end,",
                " establishes the concept that men are the",
                " servants of Allah alone, and its whole",
                " message revolves around the point that they",
                " should serve none but One Allah alone.",
                " The Holy Prophet (upon whom be Allah's",
                " peace) himself was Allah's servant. Allah had",
                " sent him not as rabb (sustainer, providence)",
                " but as a Messenger so that he",
                " should himself serve Him and teach the",
                " other people also to serve Him alone.",
                " After all, how can a sensible person",
                " believe that the Holy Prophet might have",
                " one day stood up before the disbelieving",
                " Quraish of Makkah and made the sudden",
                " proclamation: \"You are in fact the slaves",
                " of Muhammad and not of al- `Uzzah",
                " and ash-Shams.\" (We seek Allah's refuge from",
                " this)",
                "*71) The address here is to",
                " all mankind. There is no weighty argument",
                " to regard only the believers as the",
                " addressees. As has been observed by 'Allama",
                " Ibn Kathir, to address such a thing",
                " to the common men does not mean",
                " that Allah forgives all sins without repentance,",
                " but Allah Himself has explained in the",
                " following verses that sins are forgiven only",
                " when the sinner turns to Allah's worship",
                " and service and adopts obedience to the",
                " message sent down by Him. As a",
                " matter of fact, this verse brought a",
                " message of hope for those people who",
                " had committed mortal sins like murder, adultery,",
                " theft, robbery, etc. in the days of",
                " ignorance, and had despaired whether they would",
                " ever be forgiven. To them it has",
                " been said: \"Do not despair of Allah's",
                " mercy: whatever you might have done in",
                " the past, if you sincerely turn to",
                " your Lord's obedience, you will be forgiven",
                " every sin.\" The same interpretation of this",
                " verse has been given by Ibn `Abbas,",
                " Qatadah, Mujahid and Ibn Zaid. (Ibn Jarir,",
                " Bukhari, Muslim, Abu Da'ud, Tirmidhi). For further",
                " explanation, see AI-Furqan: 70-71 and the E.N.'s",
                " thereof."
            ]
        },
        {
            "id": "[39:54]",
            "verse": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:55]",
            "verse": "And follow the best of what was revealed to you from your Lord before the punishment comes upon you suddenly while you do not perceive,",
            "description": [
                "\"To follow the best aspect of the",
                " Book of Allah\" means that one should",
                " carry out the Commands Allah has given",
                " and refrain from what He has forbidden,",
                " and learn lessons from what He has",
                " brought out in the parables and narratives.",
                " As against this, the one who turns",
                " away from Allah's Commands, indulges in the",
                " forbidden things, and dces not heed His",
                " admonitions, follows the worst aspect of the",
                " Book of AIlah, i.e. that aspect which",
                " the Divine Book has declared as the",
                " most evil."
            ]
        },
        {
            "id": "[39:56]",
            "verse": "Lest a soul should say, \"Oh [how great is] my regret over what I neglected in regard to Allah and that I was among the mockers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:57]",
            "verse": "Or [lest] it say, \"If only Allah had guided me, I would have been among the righteous.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:58]",
            "verse": "Or [lest] it say when it sees the punishment, \"If only I had another turn so I could be among the doers of good.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:59]",
            "verse": "But yes, there had come to you My verses, but you denied them and were arrogant, and you were among the disbelievers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:60]",
            "verse": "And on the Day of Resurrection you will see those who lied about Allah [with] their faces blackened. Is there not in Hell a residence for the arrogant?",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:61]",
            "verse": "And Allah will save those who feared Him by their attainment; no evil will touch them, nor will they grieve.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:62]",
            "verse": "Allah is the Creator of all things, and He is, over all things, Disposer of affairs.",
            "description": [
                "That is, \"He did not just create",
                " the world and then left it alone,",
                " but He is constantly guarding and watching",
                " over everything. Just as everything in the",
                " world came into being by His act",
                " of creation so everything is living and",
                " surviving by His leave, and flourishing and",
                " functioning only under His protection and care.\"",
                ""
            ]
        },
        {
            "id": "[39:63]",
            "verse": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:64]",
            "verse": "Say, [O Muhammad], \"Is it other than Allah that you order me to worship, O ignorant ones?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:65]",
            "verse": "And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.\"",
            "description": [
                "That is, \"No act which is performed",
                " along with shirk will be adjudged as",
                " a righteous act, and no one who,",
                " being a mushrik, performs many acts as",
                " good acts in his personal judgement, will",
                " deserve any reward for them, and his",
                " whole life work will be deemed to",
                " have gone waste.\""
            ]
        },
        {
            "id": "[39:66]",
            "verse": "Rather, worship [only] Allah and be among the grateful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:67]",
            "verse": "They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him.",
            "description": [
                "That is, \"They have no conception of",
                " the greatness and glory of Allah; they",
                " have never tried to understand how high",
                " is the position of the Lord of",
                " the Universe and how insignificant arc the",
                " beings whom these foolish people have made",
                " associates in Godhead and worthy of their",
                " worship.\"",
                "*76) This is a figurative way",
                " of describing the complete control and authority",
                " of AIlah over the earth and heavens.",
                " Just as a man encloses a small",
                " ball in the hollow of his hand",
                " with perfect ease, or a person rolls",
                " up an handkerchief in his hand without",
                " any difficulty, so will All men (who",
                " fail to conceive the greatness and glory",
                " of Allah) sec with their own eyes,",
                " on the Day of Resurrection, that the",
                " earth and the heavens arc like an",
                " ordinary ball and a small scroll in",
                " the hand of Allah. Traditions have been",
                " related in Musnad Ahmad, Bukhari, Muslim, Nasa'i,",
                " Ibn Majah, Ibn Jarir and others, on",
                " the authority of Hadrat 'Abdullah bin 'Umar",
                " and Hadrat Abu Hurairah, that once during",
                " a sermon the Holy Prophet recited this",
                " verse and then said: \"Allah will hold",
                " the heavens and the earths (i.e. the",
                " planets) in His grasp and will roll",
                " them about in such a way as",
                " a child rolls a ball, and will",
                " say: 'I am God, the One: I",
                " am the King: I am the All-Mighty,",
                " Owner of glory: Where arc the kings",
                " of the world? Where are the tyrants?",
                " Where are the arrogant?\" -Saying these words",
                " he started so shaking that we feared",
                " that he might topple over alongwith the",
                " pulpit.\"",
                "*77) That is, there is no",
                " comparison whatever between Allah's greatness and glory",
                " and the insignificance of those who are",
                " associated with Him in Godhead."
            ]
        },
        {
            "id": "[39:68]",
            "verse": "And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on.",
            "description": [
                "For the explanation of Sur (Trumpet), see",
                " AI-An`am: 73, Ibrahim: 48, AI-Kahf: 99, Ta",
                " Ha: 102-103, Al-Hajj: 1, AI-Mu'minun: 101. An-Naml:",
                " 87 and the E,N.'s thereof.",
                "*79) Here,",
                " mention has been made of the Turmpet's",
                " being blown only twice. Besides, in Surah",
                " An-Naml there is the mention of another",
                " blowing of the Trumpet before these two,",
                " on hearing which everything in the earth",
                " and the heavens will be struck with",
                " terror (v. 87). On this very basis,",
                " the Ahadith mention that the Trumpet will",
                " be blown thrice: (1) Nafakhat al-Faza`on hearing",
                " which everything will be struck with terror,",
                " (2) nafakhat as-Sa `q, on which everyone",
                " will fall down dead, and (3) nafakhat",
                " al-qiyam li-Rabbit- alamin, i.e. the Trumpet on",
                " the blowing of which all dead men",
                " will return to life and arise from",
                " their graves to present themselves before their",
                " Lord."
            ]
        },
        {
            "id": "[39:69]",
            "verse": "And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged.",
            "description": [
                "\"The witnesses\" : those who will bear",
                " witness to the effect that the Message",
                " of Allah had been conveyed to the",
                " people as well as those who will",
                " bear witness to the acts and deeds",
                " of the people. It is not necessary",
                " that these witnesses will be only human",
                " beings. The angels, the jinns, the beasts,",
                " men's own limbs, their dwelling places and",
                " the trees and stones, will all be",
                " included among the witnesses."
            ]
        },
        {
            "id": "[39:70]",
            "verse": "And every soul will be fully compensated [for] what it did; and He is most knowing of what they do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:71]",
            "verse": "And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, \"Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?\" They will say, \"Yes, but the word of punishment has come into effect upon the disbelievers.",
            "description": [
                "That is, the gates of Hell will",
                " not have already been opened but will",
                " be opened on their arrival there just",
                " as the gate of a prison is",
                " opened on the arrival of the culprits",
                " and is closed as soon as they",
                " have entered it."
            ]
        },
        {
            "id": "[39:72]",
            "verse": "[To them] it will be said, \"Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:73]",
            "verse": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter].",
            "description": [
                ""
            ]
        },
        {
            "id": "[39:74]",
            "verse": "And they will say, \"Praise to Allah, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.\"",
            "description": [
                "For explanation, sec Ta Ha: 106-107, 124;",
                " Al-Anbiya': 106-107 and the E.N.'s thereof.",
                "*83)",
                " That is, \"The Paradise which has been",
                " granted to each of us, is now",
                " our property and we possess full rights",
                " over it.\"",
                "*84) Maybe this is said",
                " by the dwellers of Paradise, or maybe",
                " this sentence is added by Allah to",
                " what the dwellers of Paradise will say.",
                ""
            ]
        },
        {
            "id": "[39:75]",
            "verse": "And you will see the angels surrounding the Throne, exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allah, Lord of the worlds.\"",
            "description": [
                "That is, the entire Universe will proclaim",
                " the praises of Allah Almighty."
            ]
        }
    ]
}