{
    "name": "Fussilat",
    "verse-count": 54,
    "verse-info": [
        {
            "id": "[41:1]",
            "verse": "Ha, Meem.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:2]",
            "verse": "[This is] a revelation from the Entirely Merciful, the Especially Merciful -",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:3]",
            "verse": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:4]",
            "verse": "As a giver of good tidings and a warner; but most of them turn away, so they do not hear.",
            "description": [
                "This is a brief introduction to the",
                " Surah. A study of the following discourse",
                " can show what relevance the things mentioned",
                " in it have with the theme that",
                " follows. The first thing said is that",
                " this Word is being sent down by",
                " God, as if to say: \"You, O",
                " people, may go on saying again and",
                " again that this Word is being composed",
                " by Muhammed (upon whom be Allah's peace)",
                " but the fact is that its revelation",
                " is from God, Lord of the worlds.",
                " \" Furthermore, the addressees have also been",
                " warned, so as to say: \"If you",
                " express your displeasure on hearing this discourse.",
                " this displeasure is not against Muhammad (upon",
                " whom be Allah's peace) tart against God.",
                " If you reject it, you reject Allah's",
                " Word, not of a man, and if",
                " you turn away from it, you do",
                " not turn away from a mart but",
                " from Allah.\" Secondly, that the one sending",
                " it down is that God, Who is",
                " extremely Merciful (Rehman and Rahim) to His",
                " creatures. The mention of the attribute of",
                " mercy of the Sender of Revelation, instead",
                " of any other attributes, points to the",
                " truth that He has sent down this",
                " Word under the requirement of His mercifulness.",
                " By this the addressees have been warned,",
                " so as to say: 'If someone spurns",
                " this Word, or rejects it. or expresses",
                " displeasure at it, he in fact is",
                " his own enemy \"Thts is indeed a",
                " supreme blessing. which God has sent down,",
                " out of this infinite mercy, for the",
                " guidance and well-being and happiness of man.",
                " if God were merciless to mankind, He",
                " would have left them to wander about",
                " in darkness and would have least cared",
                " what pit they fell into. But this",
                " is His bounty and beneficence that along",
                " with bringing men into existence and providing",
                " for them He has taken on Himself",
                " the responsibility to show them the light",
                " of knowledge also in order to adorn",
                " their lives, and is sending down this",
                " Word to a servant of His for",
                " the same purpose. Now, who could be",
                " more ungrateful and a greater enemy of",
                " himself than the ono who instead of",
                " benefiting from this mercy made up his",
                " mind to fight it?\" Thirdly that the",
                " verses of this Book are well-expounded. That",
                " is, there is nothing confusing and ambiguous",
                " in it so that somebody might excuse",
                " himself from accepting it on the ground",
                " that he was unable to understand the",
                " contents of the Book.It has been plainly",
                " told m it what is the truth",
                " and what is the falsehood, what arc",
                " the right beliefs and what are the",
                " wrong beliefs, what is good and what",
                " is evil, what is high morality and",
                " what is vice, in what way lies",
                " the good of tnan and in what",
                " he incurs loss for himself. If a",
                " person rejects such clear and manifest guidance,",
                " or pays no heed to it, he",
                " cannot offer any excuse for it. His",
                " attitude clearly unplies that he wants to",
                " remain in the wrong wilfully. Fourthly, that",
                " this is an Arabic Qur'an, which implies",
                " this: \"If this Qur'an had been sent",
                " down in some other language, the Arabs",
                " would have presented the excuse that they",
                " were ignorant of the language in which",
                " God had sent His Book. But this",
                " is their own language. They cannot put",
                " forward the excuse that they cannot understand",
                " it. (Here, one should keep in view",
                " verse 44 also, in which the same",
                " theme has been expressed in a different",
                " way, and the suspicion that in that",
                " case there is a reasonable excuse for",
                " the non-Arabs not to accept the message",
                " of the Qur'an, we have already removed",
                " in our commentary of Surah Yusuf: 2",
                " and E.N. 2 on it. Please also",
                " see Rasa'il-o-Masa'il. Vol. I, pp. 19-23). Fifthly,",
                " that this Book is for those who",
                " possess knowledge. That is, only the people",
                " of understanding can draw any benefit from",
                " this Book. For the ignorant it is",
                " as useless as a precious diamond for",
                " the one who cannot distinguish it from",
                " a mere stone. Sixthly, that this Book",
                " gives good news and administers warning. That",
                " is, it does not consist of mere",
                " fantasy, or a philosophy, or a specimen",
                " of good literary composition, which one may",
                " accept or reject without entailing any consequence,",
                " but it is openly administering a warning",
                " to the whole world that the results",
                " of accepting and believing in it are",
                " marvellous and of rejecting it very dreadful.",
                " Thus only a fool could reject it",
                " with scant attention."
            ]
        },
        {
            "id": "[41:5]",
            "verse": "And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"",
            "description": [
                "That is, \"It has no way open",
                " to reach our hearts.\"",
                "*3) That is",
                " \"This invitation has divided us: it has",
                " cut us off from you it leas",
                " become a hindrance for us to join",
                " you.\"",
                "*4) It has two meanings: (1)",
                " \"That we have nothing to do with",
                " you ;\" and (2) \"that if you",
                " do not desist from your preaching, you",
                " may go on doing your mission, we",
                " also will not stop our opposition to",
                " you, and we will do whatever we",
                " can to defeat and frustrate your mission.",
                " \""
            ]
        },
        {
            "id": "[41:6]",
            "verse": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -",
            "description": [
                "That is, \"It is not in my",
                " power to remove the covering that envelops",
                " your hearts, open your ears, and tear",
                " away the curtain which you have drawn",
                " between me and yourselves, I am only",
                " a tnan: I can make only him",
                " understand who is inclined to listen, and",
                " can only meet him who is ready",
                " to meet me.\"",
                "*6) That is. \"You",
                " may if you so like put coverings",
                " on your hearts and make your ears",
                " deaf, but the fact is that you",
                " don't have many gods: then is only",
                " One God, whose servants you are. And",
                " this is no philosophy, which I might",
                " have thought out myself, and which might",
                " have equal probability of being true or",
                " false, but this reality has been made",
                " known to me through revelation, which cannot",
                " admit of any likelihood of error. \"",
                "",
                "*7) That is, \"Do not make any",
                " other your God: do not serve and",
                " worship any other deity: do not invoke",
                " and bow to any other for help:",
                " and do not obey and follow the",
                " customs and laws and codes made and",
                " set by others. \"",
                "*8) \"Ask for",
                " His forgiveness\": Ask for His forgiveness for",
                " the unfaithfulness that you have been showing",
                " so far towards Him, for the shirk",
                " and disbelief and disobedience that you have",
                " been committing till now, and for the",
                " sins that you happened to comfit due",
                " to forgetfulness of God."
            ]
        },
        {
            "id": "[41:7]",
            "verse": "Those who do not give zakah, and in the Hereafter they are disbelievers.",
            "description": [
                "Here, the meaning of the word zakat",
                " has been disputed by the commentators. Ibn",
                " `Abbas and his illustrious pupils, `Ikrimah and",
                " Mujahid, say that zakat here implies the",
                " purity of the soul and self which",
                " accrues from belief in Tauhid and obedience",
                " to Allah. According to this explanation, the",
                " translation of the verse would be: \"Woe",
                " to the mushriks, who do not adopt",
                " purity.\" The other group which includes commentators",
                " like Qatadah, Suddi, Hasan Basri, Dahhak, Muqatil",
                " and Ibn as-Sa'ib take this word here",
                " also in the meaning of the zakat",
                " on property and wealth. According to this",
                " explanation, the verse means: \"Woe to those",
                " who do not fulfil the right of",
                " Allah by committing shirk and the right",
                " of the men by withholding the zakat.",
                ""
            ]
        },
        {
            "id": "[41:8]",
            "verse": "Indeed, those who believe and do righteous deeds - for them is a reward uninterrupted.",
            "description": [
                "The words ajrun ghaira mamnun in the",
                " original have two other meanings also: (1)",
                " That it will be a reward which",
                " will never decrease and diminish; and (2)",
                " that this reward will not be given",
                " with reminders of good done, like the",
                " gift made by a miserly person, who",
                " keeps on reminding the beneficiary of his",
                " favour if at all he gives away",
                " anything."
            ]
        },
        {
            "id": "[41:9]",
            "verse": "Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:10]",
            "verse": "And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction - for [the information] of those who ask.",
            "description": [
                "\"Blessings of the earth\" imply those measureless",
                " and countless things which have been continuously",
                " coming out of it since millions and",
                " millions of years, and are fulfilling the",
                " ever increasing needs and requirements of all",
                " the creatures from the microscopic germs to",
                " the highly civilized man. Among these the",
                " principal blessings are the air and the",
                " water by which alone vegetable, animal and",
                " then human life became possible on the",
                " earth.",
                "*12) This sentence has been interpreted",
                " by the commentators in different ways: Some",
                " of them interpret it to mean: \"The",
                " provisions of the earth were placed in",
                " it precisely according to the needs and",
                " requirements of those who ask, in exactly",
                " four days.\" That is, it took exactly",
                " four days, neither more nor less. Ibn",
                " `Abbas, Qatadah and Suddi interpret it to",
                " mean: \"The provisions of the earth were",
                " placed in it in four days. The",
                " answer to those who ask is completed.",
                " \" That is, whoever asks as to",
                " how long it took, his complete answer",
                " is that it took four days. According",
                " to Ibn Zaid it means: \"The provisions",
                " of the earth were placed in it",
                " for those who ask within four days,",
                " precisely in accordance with the demand and",
                " need of everyone. \" As far as",
                " the rules of the language are concerned,",
                " the words of the verse admit of",
                " all these three meanings, but in our",
                " opinion the first two meanings have no",
                " merit. In view of the context, it",
                " is immaterial whether the work was completed",
                " in exactly four days and not in",
                " more or less four days. There is",
                " no need whatever for such an addition",
                " to make up for any deficiency in",
                " supporting the description of Allah's perfect power,",
                " perfect providence and perfect wisdom. Likewise, the",
                " commentary: \"The answer to those who ask",
                " is completed,\" is a very weak commentary.",
                " There is no indication in the theme",
                " preceding the verse and following it, to",
                " show that at that time somebody had",
                " asked the question as to how long",
                " it had taken for those works to",
                " be completed, and this verse was sent",
                " down as an answer to it. That",
                " is why we have adopted the third",
                " meaning in our translation. In our opinion",
                " the correct meaning of the verse is",
                " this: \"Allah placed within the earth the",
                " full provisions of food precisely and exactly",
                " in accordance with the demands andneeds of",
                " every kind of creature that AIIah had",
                " to create in the earth from the",
                " beginning of the creation till Resurrection. There",
                " are countless kinds of vegetation found on",
                " land and in water and the food",
                " requirements of each kind are different from",
                " those of other kinds. Allah has created",
                " countless species of living creatures in the",
                " air and on land and in water,",
                " and every species demands a different kind",
                " of food. Then unique among all these",
                " is the species of man, who requires",
                " different kinds of food not only for",
                " the development and nourishment of his body",
                " but also for the satisfaction of his",
                " taste. Who beside Allah could know how",
                " many members of the different kinds of",
                " creatures would be born on this globe,",
                " from the beginning of life till its",
                " end, and when and where they would",
                " be born and how much and what",
                " kind of food would be required for",
                " their nourishment? Just as He had made",
                " the plan of creating those creatures who",
                " stood in need of food in His",
                " scheme of creation, so He made full",
                " arrangements of food also to meet their",
                " requirements and demands. In the modern age,",
                " the people who have brought out the",
                " Islamic edition of the Marxist conception of",
                " Socialism in the name of \"the Qur'anic",
                " order of providence\", translate the words sawa-al-lis-sa'-ilin",
                " as `equal for all those who ask\",",
                " and raise the edifice of reasoning on",
                " it, saying that Allah has kept equal",
                " provisions for All the people in the",
                " earth; therefore, in order to fulfil the",
                " intention of the verse a system of",
                " the state is needed which may provide",
                " equal rations of food to everybody. For",
                " in the system of individual ownership the",
                " equality which the 'Qur'anic law\" demands cannot",
                " be established. But these people, in their",
                " enthusiasm to press the Qur'an in the",
                " service of their theories, forget that 'those",
                " who ask\", who have been mentioned in",
                " this verse, are not only human beings",
                " but All those different species of animals",
                " and plants who need food for survival.",
                " Has Allah really established equality among all",
                " of them, or even among all the",
                " members of each different species of the",
                " creatures, in the matter of the provision",
                " of food? Do you find anywhere in",
                " this entire system of nature the arrangement",
                " of the distribution of equal rations of",
                " food? If that is not the case,",
                " it means that in the vegetable and",
                " animal kingdom, where the distribution of the",
                " provisions is dicectly being arranged by the",
                " State of Allah, and not by the",
                " human state, Allah Himself is violating His",
                " own this \"Qur'anic law\", rather, God forbid,",
                " is practicing injustice! Then, they also forgo",
                " that \"those who ask\" also include those",
                " animals which man domesticates and arranging provisions",
                " for which is also his responsibility, e.g.",
                " sheep, goats, cows, buffaloes, horses, asses, mules,",
                " camels, etc: If the Qur'anic law is",
                " that equal food be given to all",
                " those who ask, and to enforce the",
                " same law a state is needed, which",
                " may administer the order of providence, will",
                " that state establish economic equality between men",
                " and animals also?",
                "*13) Here, the commentators",
                " generally have been confronted with this question:",
                " If it is admitted that the creation",
                " of the earth took two days and",
                " the setting up of the mountains and",
                " placing of the provisions and blessings in",
                " it took four days, and the creation",
                " of the heavens, as mentioned below, took",
                " another two days, the total number of",
                " the days would be eight, whereas at",
                " several places in the Qur'an Allah has",
                " said that the creation of the earth",
                " and heavens took six days in all.",
                " (For example, see AI-A `raf: 54, Yunus:",
                " 3, Hud: 7, AI-Furqan: 59). On this",
                " very basis, almost all the commentators agree",
                " that these four days include the two",
                " days of the creation of the earth.",
                " That is, two days were taken for",
                " the creation of the earth and two",
                " days for the creation of the rest",
                " of the things within the earth, as",
                " mentioned below. Thus, the earth along with",
                " its provisions became complete in four days",
                " in all. But this not only is",
                " against the apparent words of the Qur'an,",
                " but the difficulty also is, in fact,",
                " an imaginary difficulty, to avoid which need",
                " for this interpretation has been felt. The",
                " two days of the creation of the",
                " earth arc, in fact, not separate from",
                " the two days in which this universe",
                " as a whole was created. If we",
                " consider the following verses, we see that",
                " in them the creation of both the",
                " earth and the heavens has been mentioned",
                " together, and then it has been stated",
                " that Allah made the seven heavens in",
                " two days. These seven heavens imply the",
                " whole universe, one part of which is",
                " also our earth. Then, when like the",
                " other countless stars and planets of the",
                " universe this earth also took the shape",
                " of a unique globe within two days,",
                " Allah began to prepare it for animate",
                " creatures, and in four days created in",
                " it all those provisions which have been",
                " mentioned in the above verse. What development",
                " works were carried out in the other",
                " stars and planets in these four days",
                " have not been mentioned by Allah, for",
                " not to speak of the man of",
                " the period of the revelation of the",
                " Qur'an, even the man of the present",
                " age does not have the capability to",
                " digest and assimilate this information."
            ]
        },
        {
            "id": "[41:11]",
            "verse": "Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"",
            "description": [
                "Three things need to be explained here:",
                " First, by \"heaven\" is meant the whole",
                " universe, as becomes obvious from the following",
                " sentences. In other words, \"turning to the",
                " heaven\" means that Allah turned to the",
                " creation of the universe. Second, by \"smoke\"",
                " is implied the initial and primary stage",
                " of matter, in which it lay diffused",
                " in space in a shapeless, dust like",
                " condition before the formation of the universe.",
                " Scientists of the modern age describe the",
                " same thing as nebulae, and the same",
                " also is their view about the beginning",
                " of the universe: that is, before creation",
                " the matter of which the universe was",
                " built lay diffused in smoke-like nebulous form.",
                " Third, it would be wrong to interpret",
                " \"then He turned to the heaven\" to",
                " mean that first He created the earth,",
                " then set mountains in it, then arranged",
                " blessings and provisions of food in it,",
                " and then, at the end, He turned",
                " towards the crcation of the universe. This",
                " misunderstanding is removed by the following sentence:",
                " \"He said to the heavens and the",
                " earth: Come into being; and they said:",
                " we come in submission. \" This makes",
                " it clear that in this verse and",
                " in the following verses, mention is being",
                " made of the time when there was",
                " neither the earth nor the heaven, but",
                " the creation of the universe was being",
                " started. Only the word thumma (then) cannot",
                " be made the argument to say that",
                " the earth had been created before the",
                " heavens. There are several instances of this",
                " in the Qur'an that the word thumma",
                " is not necessarily used w show the",
                " chronological order but it is also used",
                " for the order of Presentation. (Please see",
                " E.N. 12 of Surah Az-Zumar). Among the",
                " earliest commentators the dispute has been going",
                " on for ages as to what was",
                " created first according to the Qur'an, the",
                " earth or the heavens. One group of",
                " them argues on the basis of this",
                " verse and verse 29 of AI-Baqarah that",
                " the earth was created first. The other",
                " group argues from verses 27-33 of AnNazi'at",
                " that the heavens were created first, because",
                " there it has been clearly stated that",
                " the earth was created after the heavens.",
                " But the fact is that nowhere in",
                " the Qur'an has the mention of the",
                " creation of the universe been made to",
                " teach Physics or Astronomy, but while inviting",
                " towards belief in the doctrines to Tauhid",
                " and the Hereafter, like countless other Signs,",
                " the creation of the heavens and the",
                " earth also has been presented as food",
                " for thought. For this purpose it was",
                " not at All necessary that the chronological",
                " order of the creation of the heavens",
                " and the earth should have been presented,",
                " and it should have been told whether",
                " the heavens were created first or the",
                " earth. No matter whether this was created",
                " first or that, in any case both",
                " are an evidence of Allah Almighty's being",
                " the One and only Deity, and are",
                " a testimony that their Creator has not",
                " created this whole universe as a plaything",
                " for a care-fret person. That is why",
                " the Qur'an sometimes mentions the creation of",
                " the earth first and sometimes the creation",
                " of the heavens first. Where the object",
                " is to make man realize the blessings",
                " of God, there generally it has mentioned",
                " the earth first, for it is closer",
                " to man; and where the object is",
                " to give man the concept of God's",
                " greatness and His omnipotence there it has",
                " generally mentioned the heavens first, for the",
                " scene of the revolving heavens has always",
                " been awe-inspiring for man.",
                "*15) In these",
                " words Allah has described the nature of",
                " His method of creation in a manner",
                " as to differentiate between Divine creation and",
                " human workmanship. When man wants to make",
                " something, he prepares a plan for it",
                " in his mind: then gathers together the",
                " necessary material; then works persistently hard to",
                " mould the material according to his plan,",
                " and in the process of his effort",
                " the material which he wants to mould",
                " according to his mental plan constantly resists",
                " lute; so much so that sometimes the",
                " resistance of the material succeeds and the",
                " thing is not made precisely according to",
                " the desired plan, and sometimes man's effort",
                " overcomes the resistance and he succeeds in",
                " giving it the desired form and shape.",
                " For example, when a tailor wants to",
                " make a shirt, he first conceives in",
                " his mind the shape of the shirt,",
                " then arranging the cloth he tries to",
                " cut and sew it according to his",
                " concept of the shirt, and during this",
                " effort, he has constantly to face the",
                " resistance of the cloth, for it does",
                " not easily yield to be moulded according",
                " to the tailor's concept; so much so",
                " that sometimes the resistance of the cloth",
                " dominates and the shirt doesn't take the",
                " desired shape, and sometimes the tailor's effort",
                " dominates and he is able to shape",
                " it precisely according to his concept. Now,",
                " consider Allah's mode of creation. The matter",
                " of the universe lay scattered and diffused",
                " in the form of smoke. Allah willed",
                " to give it the shape of the",
                " universe as it is now. For this",
                " purpose, He did not have to sit",
                " down, like a human artisan, and chisel",
                " and mould the earth and the moon",
                " and the sun and the other stars",
                " and planets, but He only commanded the",
                " scheme of the universe that was in",
                " His Mind to cane into being, i.e.",
                " the smoke like diffused matter to take",
                " the shape of the galaxies and stars",
                " and planets, which He wanted to create.",
                " This . matter did not have the",
                " power to resist the Command of Allah.",
                " Allah did not have to make any",
                " effort to give it the shape of",
                " the universe.No sooner was the Command given",
                " than the matter started contracting and condensing",
                " and taking shape obediently according to the",
                " scheme of its Master, so that the",
                " whole universe including the earth became ready",
                " in 48 hours. This same scheme of",
                " Allah's method of creation has been described",
                " at several other places in the Qur'an",
                " like this: When Allah decides to do",
                " something He only commands it to be",
                " and it is done. (See AI-Baqarah: 117,",
                " AI-'Imran: 47, 59: An-Nahl: 40. Maryam: 35,",
                " Ya Sin: 82, Al-Mu'min: 68)."
            ]
        },
        {
            "id": "[41:12]",
            "verse": "And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.",
            "description": [
                "To understand these verses well, it would",
                " be useful to study the following portions",
                " of the Tafhim al-Qur'an: AI-Baqarah: 29, Ar-Ra'd:",
                " 2, AI-Hijr: 1G-18, AI-Anbiya': 30-33, Al-Hajj: 65.",
                " Al-Mu'minun: 17, Ya Sin: E.N. 37, and",
                " E.N.'s 5, G of As-Saaffat."
            ]
        },
        {
            "id": "[41:13]",
            "verse": "But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.",
            "description": [
                "That is, \"Ifthey do not believe that",
                " God and Deity is One and only",
                " One, who has created this earth and",
                " the whole universe, and still persist in",
                " their ignorance that they would make others",
                " also, who are in fact His creatures",
                " and slaves, deities beside Him, and regard",
                " them as His associates in His Being",
                " and rights and powers."
            ]
        },
        {
            "id": "[41:14]",
            "verse": "[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah.\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"",
            "description": [
                "This sentence can have several meanings: (1)",
                " That the Messengers continued to come to",
                " them one after the other; (2) that",
                " the Messengers tried in every wav to",
                " make them understand the truth and did",
                " not leave any stone unturned to bring",
                " them to the Right Path; and (3)",
                " that the Messengers came to them in",
                " their own country as well as in",
                " the adjoining countries.",
                "*19) That is \"If",
                " Allah had disapproved of our religion, and",
                " had willed to send a messenger to",
                " us to keep us away from it,",
                " He would have sent the angels. As",
                " you are not an angel but a",
                " man like us, we do not believe",
                " that you have been sent by God,",
                " and sent for the purpose that we",
                " give up our religion and adopt the",
                " way of life that you arc presenting.\"",
                " The disbelievers' saying that they deny \"what",
                " you have been sent with\", was only",
                " sarcastic. It does not mean that they",
                " believed him to have been sent by",
                " God and then denied what he said.",
                " But this is a sarcastic expression of",
                " the type that Pharaoh had uttered before",
                " his courtiers about the Prophet Moses: \"This",
                " messenger of yowl, who has been sent",
                " to you, seems to be utterly mad.\"",
                " (Ash-Shua'ra' 27). For further explanation, see E.N.",
                " 11 of Surah Ya Sin."
            ]
        },
        {
            "id": "[41:15]",
            "verse": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:16]",
            "verse": "So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.",
            "description": [
                "\"III-omened days\" does not mean that the",
                " days in themselves were illomened, and the",
                " torrent came because the people of 'Ad",
                " met with those illomened days. If this",
                " were the meaning and there were some",
                " ill omen in the days themselves, the",
                " torment would have visited all the nations",
                " of the world. The cornet meaning, therefore,",
                " is that since in those days God's",
                " torment descended on this nation, the days",
                " were ill-omened for the people of 'Ad.",
                " It is not cornet to argue on",
                " the basis of the verse that some",
                " days are iII-omened and some auspicious. The",
                " lexicographers have disputed the meaning of the",
                " words rih-an sarsaran, which have been used",
                " for the stormy wind. Some say that",
                " they imply an intensely hot wind; others",
                " say that they imply an extremely cold",
                " wind; and some others say that they",
                " imply a wind which produces a great",
                " noise when it blows. In any cast,",
                " they All agree that the words are",
                " used for a severe storm. The details",
                " of this torment given at other places",
                " in the Qur'an show that this wind",
                " continued to rage for seven nights and",
                " eight days consecutively. It swept the people",
                " off the ground and they fell down",
                " dead and lay scattered here and there",
                " like hollow trunks of the palm-tree. (AI-Haaqqah:",
                " 7). It left rotting everything on which",
                " it blew. (Adh-Dhariyat 42). When the people",
                " of 'Ad saw it advancing, they rejoiced",
                " with the hope that the dense clouds",
                " would bring much rain, which would water",
                " their withering crops. But when it came",
                " it laid waste the entire land.\" (Al-Ahqaf:",
                " 24-25).",
                "*21) This ignominious torment was an",
                " answer to their arrogance and vanity because",
                " of which they had assumed greatness in",
                " the land without any right, and would",
                " boast that there was none more powerful",
                " than they on the entire earth. Allah",
                " disgraced them and destroyed the major part",
                " of their population along with their civilization.",
                " The remnant of their population was humbled",
                " and debased before those very nations whom",
                " they used to overawe by their show",
                " of power and might (for the details",
                " of the story of 'Ad see AI-A'raf",
                " : 65-72; Hud: 50-60; AlMu'minun: 32-41; Ash-Shua'ra'",
                " : 123-140; AI-'Ankabut; 40 and the relevant",
                " E.N.'s)."
            ]
        },
        {
            "id": "[41:17]",
            "verse": "And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:18]",
            "verse": "And We saved those who believed and used to fear Allah.",
            "description": [
                "For the details of the story of",
                " Thamud see AI-A'raf: 73-79; Hud: 61.68; AI-ZHjr:",
                " 80-84; Bani Isra'il: 59; Ash-Shua`ara' :141.159; An-Naml:",
                " 45-53 and the E.N.'s."
            ]
        },
        {
            "id": "[41:19]",
            "verse": "And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,",
            "description": [
                "What is meant to be said have",
                " is: \"When they will be rounded up",
                " to be presented in the Court of",
                " Allah,\" though the words used are to",
                " the effect: \"When they will be gathered",
                " to be driven to Hell,\" for Hell",
                " in any case will be their final",
                " destination.",
                "*24) That is, All the former",
                " and latter generations and races will be",
                " gathered together at a time and called",
                " to account together, For whatever a person",
                " does in his lifetime, whether good yr",
                " evil, its influence and impact dces not",
                " end with his life; but continues to",
                " operate even after his death for long",
                " periods of time, for which he is",
                " totally responsible. Likewise, whatever a generation does",
                " in its own time, its influence continues",
                " to affect the later generations for. centuries,",
                " and it is responsible for its heritage.",
                " It is inevitable to examine All these",
                " influences and their results and to collect",
                " their evidences. For that very reason, generation",
                " after generation of the people will go",
                " on arriving and will be withheld. The",
                " Court will start its work when All",
                " the former and latter generations will have",
                " assembled together in the Plain of Resurrection.",
                " (For further explanation, see AI-A'raf: 3839 and",
                " E.N. 30 on it)."
            ]
        },
        {
            "id": "[41:20]",
            "verse": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.",
            "description": [
                "The explanation of this given in the",
                " Hadith is that when a stubborn culprit",
                " will go on denying his crimes, and",
                " will even belie All the witnesses, then",
                " the limbs of his body will bear",
                " the witness, one after the other, by",
                " the Command of Allah, and will tell",
                " what offences he had committed through them.",
                " This thing has been reported by Hadrat",
                " Anas, Hadrat Abu Musa Ash'ari, Hadrat Abu",
                " Said Khudri and Hadrat Ibn 'Abbas from",
                " the Holy Prophet, and traditionists like Muslim,",
                " Nasa'i, Ibn Jarir, Ibn Abi Hatim, Bazzar",
                " and others have related these in their",
                " books. (For further explanation, see E.N. 55",
                " of Surah Ya Sin). This verse is",
                " one of those many verses which prove",
                " that the Hereafter will nor only be",
                " a spiritual world but human beings will",
                " be resurrected with the body and soul",
                " as they are now in this world.",
                " Not only this: they will be given",
                " the same body in which they live",
                " now. The same particles and atoms which",
                " composed their bodies in the world, will",
                " be collected on the Day of Resurrection,",
                " and they will be resurrected with the",
                " same previous bodies in which they had",
                " lived and worked in the world. Evidently,",
                " the limbs of man can bear the",
                " witness in the Hereafter only in case",
                " they are the same limbs with which",
                " he committed a crime in his previous",
                " lift. This subject is borne out decisively",
                " and absolutely by the following verses of",
                " the Qur'an: Bani Isra'il: 49 51, 98;",
                " AI-Mu'minun: 35-38, 82-83; An-Nur: 24; AsSajdah: 10;",
                " Ya Sin: 65, 78, 79; As-Saafat: 16-18;",
                " AI-Waqi'ah: 47-50; AnNazi'at: 10-14."
            ]
        },
        {
            "id": "[41:21]",
            "verse": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.",
            "description": [
                "This shows that not only man's own",
                " limbs will bear witness on the Day",
                " of Resurrection, but every such thing before",
                " which man would have committed any crime",
                " will also speak out. The same thing",
                " has been said in Surah AI-Zilzal, thus:",
                " \"The earth will cast out all the",
                " burdens, which lie within her, and man",
                " will say:what has befallen her? On that",
                " Day shall she relate whatever had happened",
                " (on her), because your Lord will have",
                " commanded her (to do so).\" (vv. 2-5).",
                ""
            ]
        },
        {
            "id": "[41:22]",
            "verse": "And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:23]",
            "verse": "And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"",
            "description": [
                "Hadrat Hasan Basri (may Allah bless him)",
                " has explained this verse thus \"Every. man's.",
                " attitude and conduct is determined by the",
                " thought and conjecture that he has about",
                " his God. The conduct of a righteous",
                " believer is right because his thought and",
                " conjecture about his Lord is right, and",
                " the conduct of a disbeliever and a",
                " hypocrite and a sinful person is wrong",
                " because his thought and conjecture about his",
                " Lord is wrong. \" This same theme",
                " has the Holy Prophet expressed in a",
                " comprehensive and brief Hadith, thus: \"Your Lord",
                " says: I am with the thought and",
                " conjecture that My servant holds about Me.\"",
                " (Bukhari, Muslim)."
            ]
        },
        {
            "id": "[41:24]",
            "verse": "So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease.",
            "description": [
                "It can also mean this: \"If they",
                " would want to return to the world,",
                " they would not be able to return,\"",
                " and this: \"If they would want to",
                " come out from Hell, they would not",
                " be able to come out of it,\"",
                " and this: \"If they would want to",
                " offer an excuse or repentance, it would",
                " not be accepted.\""
            ]
        },
        {
            "id": "[41:25]",
            "verse": "And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
            "description": [
                "This is the permanent and eternal way",
                " of Allah that He dots not let",
                " the men with evil intentions and desires",
                " have good companions, but lets them have",
                " bad companions according to their own inclinations.",
                " Then, as they go on descending into",
                " the depths of vice, more and more",
                " evil and wicked men and devils go",
                " on joining them as their associates and",
                " advisers and companions. Some people's saying that",
                " so-and-so is himself a very good man",
                " but happens to have bad companions is,",
                " in fact, contrary to fact. The law",
                " of nature is that every man gets",
                " the same sort of friends as he",
                " himself is. If bad people happen to",
                " be associated with a good man, they",
                " cannot remain associated with him for long.",
                " Likewise, if good and noble men happen",
                " to be associated with evil intentioned and",
                " immoral men by chance, their association cannot",
                " last long. An evil man naturally attracts",
                " only evil men to himself and only",
                " evil men become attracted towards him just",
                " as filth attracts flits and flits are",
                " attracted by the filth. The meaning of:",
                " \"They made every thing, in front of",
                " them and behind them, seem fair to",
                " them,\" is this: They assured them that",
                " their past had been glorious and their",
                " future would also be bright; they made",
                " them see everything attractive and pleasant on",
                " every side; they told them that those",
                " who criticised them were foolish, because they",
                " were not doing anything novel or strange:",
                " those who had made any progress in",
                " the world before them had been doing",
                " the same that they were doing; ahead",
                " of them there was no Hereafter at",
                " all in which they might have to",
                " be called to account for their deeds,",
                " but if at all the Hereafter did",
                " take place, as some foolish people assert",
                " it would, the God who was blessing",
                " them in the world, would bless them",
                " there too. Hell had not been made",
                " for them but for those whom God",
                " had deprived of His blessings here."
            ]
        },
        {
            "id": "[41:26]",
            "verse": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"",
            "description": [
                "This was one of those plans of",
                " the disbelievers of Makkah with which they",
                " wanted to frustrate the Holy Prophet's mission",
                " of preaching his message. They knew fully",
                " well haw impressive was the Qur'an, how",
                " high was the character of the man",
                " presenting it, and how effective and inspiring",
                " the style of his preaching. They knew",
                " that anyone who heard such matchless discourses",
                " in such an attractive style from such",
                " a noble person could not help being",
                " hued and charmed. Therefore, they planned that",
                " they should neither hear it themselves nor",
                " Iet anyone else hear it; whenever Muhammad",
                " (upon whom be Allah's peace) should start",
                " reciting it, they should create noise, clap",
                " hands, pass taunting remarks and raise All",
                " sorts of objections and such a hue",
                " and cry as to drown his voice.",
                " By this plan they hoped they would",
                " be able to defeat the Prophet of",
                " Allah."
            ]
        },
        {
            "id": "[41:27]",
            "verse": "But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:28]",
            "verse": "That is the recompense of the enemies of Allah - the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:29]",
            "verse": "And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"",
            "description": [
                "That is, \"In the world these people",
                " were at the beck and call of",
                " their leaders and religious guides and deceitful",
                " devils, but when on the Day of",
                " Resurrection they will come to know where",
                " their leaders had led them, they will",
                " curse them and would wish that they",
                " should somehow get hold of them so",
                " that they may trample them under their",
                " foot.\""
            ]
        },
        {
            "id": "[41:30]",
            "verse": "Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.",
            "description": [
                "After warning the disbelievers of the consequences",
                " of their opposition to the truth and",
                " their stubbornness, the address now turns to",
                " the believers and the Holy Prophet.",
                "*33)",
                " That is, they did not call Allah",
                " their Lord merely incidentally, nor were they",
                " involved in the error to regard Allah",
                " as their Lord and at the same",
                " time others 'as well as their lords,",
                " but they embraced the Faith sincerely and",
                " stood by it steadfastly: neither adopted a",
                " creed contrary to it later nor mixed",
                " it up with a false creed, but",
                " they fulfilled the demands of the doctrine",
                " of Tauhid in their practical lives as",
                " well. \"Standing steadfast on Tauhid\" has been",
                " explained by the Holy Prophet and the",
                " eminent Companions thus: Hadrat Anas has reported",
                " that the Holy Prophet said: \"Many people",
                " called Allah their Lord, but most of",
                " them became disbelievers. Firm and steadfast is",
                " he who remained firm on this creed",
                " till his death.\" (Ibn Jarir, Nasa'i, Ibn",
                " Abi Hatim). Hadrat Abu Bakr Siddiq (may",
                " Allah be pleased with him) has explained",
                " it thus: \"Then he did not associate",
                " another with Allah: did not attend to",
                " any other deity beside Him. \" (Ibn",
                " Jarir). Hadrat `Umar (may Allah be pleased",
                " with him) once recited this verse on",
                " the pulpit and said: \"By God, the",
                " steadfast are those who remained firm on",
                " obedience to Allah: did not run about",
                " from place to place like foxes.\" (Ibn",
                " Jarir). Hadrat 'Uthman (may Allah be pleased",
                " with him) says \"Performed his deeds sincerely",
                " for the sake of Allah only.\" (Kashsaf)",
                " Hadrat `Ali (may Allah be pleased with",
                " him) says: \"Performed the duties enjoined by",
                " Allah faithfully and obediently.\" (Kashshaf)",
                "*34) It",
                " is not necessary that the coming down",
                " of the angels may be perceptible, and",
                " the believers may see them with the",
                " eyes, or hear their voices with the",
                " ears. Although Allah also sends the angels",
                " openly for whomever He wills, generally their",
                " coming down for the believers, especially in",
                " hard times when they are being persecuted",
                " by the enemies of the Truth, takes",
                " place in imperceptible ways and their voices",
                " penetrate into the depths of the heart",
                " as peace and tranquility instead of just",
                " striking the ear-drums. Some commentators have regarded",
                " this coming down of the angels as",
                " restricted to the time of death or",
                " grave, or the Plain of Resurrection. But",
                " if the conditions in which these verses",
                " were sent ' down arc kept in",
                " view there remains no doubt that the",
                " real object of stating this thing here",
                " is to mention the coming down of",
                " the angels on those who struggle with",
                " their lives in this world in the",
                " cause of the Truth, so that they",
                " are consoled and encouraged and they rest",
                " assured that they are not helpless but",
                " the angels of Allah are at their",
                " back. Although the angels also come to",
                " receive the believers at the time of",
                " death and they also welcome them in",
                " the grave (in the state of bearzakh),",
                " and They will also accompany them constantly",
                " on the Day of Resurrection, from the",
                " time Resurrection takes place till their entry",
                " into Paradise, yet their company is not",
                " particularly restricted to the Hereafter but remains",
                " available in this world also. The context",
                " clearly shows that in the conflict between",
                " the Truth and falsehood just as the",
                " worshippers of falsehood are accompanied by the",
                " devils and mischievous people, so arc the",
                " believers accompanied by the angels. On the",
                " one hand, the companions of the worshippers",
                " of falsehood show their misdeeds seem fair",
                " to them and assure them that the",
                " tyrannical and dishonest acts that they are",
                " committing arc the very means of their",
                " success and through them only will their",
                " leadership and dominance remain safe in the",
                " world. On the other, the angels come",
                " down to the worshippers of the Truth",
                " and give them the message that is",
                " being mentioned in the following sentences.",
                "*35)",
                " These are very comprehensive words, which contain",
                " a new theme of consolation and peace",
                " for the believers, in every stage of",
                " life, from the world till the Hereafter.",
                " This counsel of the angels in this",
                " world means: \"No matter' how strong and",
                " powerful be the forces of falsehood, you",
                " should not be afraid of them, and",
                " whatever hardships and deprivations you may have",
                " to experience on account of your love",
                " of the Truth, you should not grieve",
                " on account of them, for ahead there",
                " lie in store for you such things",
                " against which every blessing of the world",
                " is insignificant.\" When the angels say the",
                " same words at the time of death,",
                " they mean this: \"There is no cause",
                " of fear for you in the destination",
                " you are heading for, for Paradise awaits",
                " you there, and you have no cause",
                " of grief for those whom you are",
                " leaving behind in the world, for we",
                " are your guardians and companions here.\" When",
                " the angels will say these very words",
                " in the intermediary state between death and",
                " Resurrection and in the Plain of Resurrection,",
                " they will mean: `Here, there is nothing",
                " but peace for you. Do not grieve",
                " for the hardships you had to suffer",
                " in the world, and do not fear",
                " what you are going to face in",
                " the Hereafter, for we are giving you",
                " the good news of Paradise, which used",
                " to be promised to you in the",
                " world. \""
            ]
        },
        {
            "id": "[41:31]",
            "verse": "We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:32]",
            "verse": "As accommodation from a [Lord who is] Forgiving and Merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[41:33]",
            "verse": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"",
            "description": [
                "After consoling and encouraging the believers, now",
                " they are being exhorted towards their real",
                " duty. In the preceding verse they were",
                " told: \"Being firm in the service to",
                " Allah and standing steadfast on this way",
                " after adopting it is by itself the",
                " basic good, which makes man a friend",
                " of the angels and worthy of Paradise.\"",
                " Now they are being told: \"The next",
                " thing which wins man the highest place",
                " of honour is that he should do",
                " good deeds himself and should invite others",
                " to the service of Allah, and even",
                " in the environment of severe antagonism where",
                " to proclaim Islam is tantamount to inviting",
                " hardships for oneself, one should firmly say",
                " that one is a Muslim.\" To understand",
                " the full significance of these words, one",
                " should keep in view the conditions in",
                " which they were said. The conditions were",
                " that anyone who proclaimed to be a",
                " Muslim, would feel as if he had",
                " stepped into a jungle of beasts, where",
                " everyone was rushing at him to tear",
                " him into pieces. More than that: if",
                " anyone opened his mouth to preach Islam",
                " he would feel as if he had",
                " called on the beasts to come and",
                " devour him. Such were the conditions when",
                " it was said: \"A person's believing in",
                " Allah as his Lord and adopting the",
                " Right Way and standing steadfast on it",
                " is indeed a great and fundamental good,",
                " but the greatest good is that man",
                " should boldly say that he is a",
                " Muslim and should invite others towards Allah's",
                " service, fearless of the consequences, and while",
                " performing this duty should remain so pure",
                " and pious in conduct and character that",
                " no one should have a cause to",
                " find fault with Islam and with those",
                " who uphold it."
            ]
        },
        {
            "id": "[41:34]",
            "verse": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.",
            "description": [
                "To understand the full significance of these",
                " words also, one should keep in view",
                " the conditions in which the Holy Prophet",
                " and, through him, his followers were given",
                " this instruction. The conditions were that the",
                " invitation to the Truth was being resisted",
                " and opposed with extreme stubbornness and severe",
                " antagonism, in which All bounds of morality,",
                " humanity and decency were being transgressed. Every",
                " sort of lie was being uttered against",
                " the Holy Prophet and his Companions; every",
                " kind of evil device was being employed",
                " to defame him and to create suspicions",
                " against him in the minds of the",
                " people; every kind of accusation was being",
                " levelled against him and a host of",
                " the propagandists were busy creating doubts against",
                " him in the hearts; in short, he",
                " and his Companions were being persecuted in",
                " every possible way because of which a",
                " substantial number of the Muslims had been",
                " compelled to emigrate from the country. Then",
                " the programme that had been prepared to",
                " stop him from preaching was that a",
                " hand of the mischievous people was set",
                " behind him, who would raise such a",
                " hue and cry that no one should",
                " be able to hear anything as soon",
                " as he opened his mouth to preach",
                " his message. In such discouraging conditions when",
                " apparently every way of extending invitation to",
                " Islam seemed to be blocked, the Holy",
                " Prophet was taught this recipe for breaking",
                " the opposition. First, it was said that",
                " goodness and evil are not equal, as",
                " if to say: \"Although apparently your opponents",
                " might have raised a dreadful storm of",
                " mischief and evil, as against which goodness",
                " might seem absolutely helpless and powerless, yet",
                " evil in itself has a weakness which",
                " ultimately causes its own destruction. For as",
                " long as man is man, his nature",
                " cannot help hating evil. Not only the",
                " companions of evil, even its own upholders",
                " know in their hearts that they arc",
                " liars and wicked people and arc being",
                " stubborn for selfish motives. Not to speak",
                " of creating dignity and honour for them",
                " in the hearts of others, it lowers",
                " them in their own esteem, and causes",
                " their morale to be weakened and destroyed",
                " in the event of every conflict. As",
                " against this evil, the good which appears",
                " to be utterly helpless and powerless, goes",
                " on operating and working and it becomes",
                " dominant in the long run. For, in",
                " the first place, the good has a",
                " power of its own which wins the",
                " hearts and no man however perverted and",
                " corrupted, can help esteeming it in his",
                " own heart. Then, when the good and",
                " evil are engaged in a face to",
                " face conflict and their nature and merits",
                " become apparent and known, after a long",
                " drawn out struggle, not many people would",
                " be Ieft, who would not start hating",
                " the evil and admiring the good. Second,",
                " it was said that evil should be",
                " resisted not by the mere good but'",
                " by a superior good, as if to",
                " say: \"If a person treats you unjustly",
                " and you forgive him, it is the",
                " mere good. The superior good is that",
                " you treat the one who iII-treats you",
                " wich kindness and lout. \" The result",
                " would be that \"your worst enemy would",
                " become your closest friend,\" for that is",
                " human nature itself. If you remain quiet",
                " in response to an abuse, it will",
                " be mere goodness but it will not",
                " silence the abuser. But if you express",
                " good wishes for him in response to",
                " his abuses, even the most shameless opponent",
                " will feel ashamed, and then would hardly",
                " ever be able to employ invectives against",
                " you. If a person doesn't miss any",
                " opportunity to harm you, and you go",
                " on tolerating his excesses, it may well",
                " make him even bolder in his mischiefs.",
                " But if on an occasion he gets",
                " into trouble and you come to his",
                " rescue, he will fall down at your",
                " feet, for no mischief can hold out",
                " against goodness. However, it would be wrong",
                " to take this general principle in the",
                " meaning that every enemy will necessarily become",
                " a close friend when you have treated",
                " him with the superior good. There are",
                " such wicked people also in the world,",
                " whose inimical nature will never change for",
                " the better no matter how tolerantly you",
                " may overlook their excesses and how benevolently",
                " you may react and respond to every",
                " evil committed by them. But such devil-incarnates",
                " are as few in the world as",
                " the embodiments of goodness are."
            ]
        },
        {
            "id": "[41:35]",
            "verse": "But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].",
            "description": [
                "Although a very efficacious recipe, it is",
                " not easy to use. It requires a",
                " great will power, resolution, courage, power of",
                " endurance and full control over one's own",
                " self. A man may act benevolently in",
                " response to an evil done, on an",
                " impulse, and there is nothing extraordinary in",
                " it. But when a person has to",
                " fight for years and years, for the",
                " sake of the Truth, those mischievous worshippers",
                " of falsehood, who do not feel any",
                " hesitation in violating any bond of morality,",
                " and are also intoxicated with power, it",
                " requires extraordinary grit to go on resisting",
                " the evil with good, and that too",
                " with the superior good, without ever showing",
                " any lack of restraint and self-control. Such",
                " a work can be accomplished only by",
                " him who has resolved with a cool",
                " mind to work for the cause of",
                " upholding the Truth, who has subdued his",
                " self to intellect and sense and in",
                " whom good and righteousness have taken such",
                " deep roots that no malice and mischief",
                " of the opponents can succeed in deposing",
                " him from his high position.",
                "*39) This",
                " is a law of nature. Only a",
                " man of very high rank is characterised",
                " by. these qualities; and the one who",
                " possesses these qualities cannot be prevented by",
                " any power of the world from attaining",
                " to his goal of success. It is",
                " in no way possible that the depraved",
                " people may defeat him with their mean",
                " machinations and shameless devices."
            ]
        },
        {
            "id": "[41:36]",
            "verse": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.",
            "description": [
                "Satan feels grieved when he sees that",
                " in the conflict between the Truth and",
                " falsehood meanness is being resisted with nobility",
                " and evil with goodness. He wants that",
                " he should somehow incite the fighters for",
                " the sake of the Truth and their",
                " prominent men in particular, and especially their",
                " leaders, to commit such a mistake, even",
                " if once, on the basis of which",
                " he may tell the common people that",
                " evil is not being committed by one",
                " side only: if mean acts are being",
                " committed by one side, the people of",
                " the other side also are not morally",
                " any better: they too have committed such",
                " and such a shameless act. The common",
                " people do not have the capability that",
                " they may assess and counterbalance fairly the",
                " excesses being committed by one party by",
                " the reactions of the other. As long",
                " as they sec that while the opponents",
                " ate adopting every mean act yet these",
                " people do not swerve at All from",
                " the path of decency and nobility, goodness",
                " and righteousness, they continue to regard and",
                " esteem them highly. But if at some",
                " time they happen to commit an unworthy",
                " act, even if it is in retaliation",
                " against a grave injustice, both the sides",
                " become equal in their esteem, and the",
                " opponents also get an excuse to counter",
                " one blameable act with a thousand abuses.",
                " That is why it has been said:",
                " 'Be on your guard against the deceptions",
                " of Satan. He will incite you as",
                " a wellwisher to take note of every",
                " abuse and every insult and attack and",
                " urge you to pay the opponent in",
                " the same coin, otherwise you would be",
                " regarded as a coward and weaken your",
                " image of strength. \" On every such",
                " occasion whenever you feel any undue provocation,",
                " you should take care that this is",
                " an incitement of Satan who is arousing",
                " you to anger and wants you to",
                " commit a mistake. And after having been",
                " warned do not be involved in the",
                " misunderstanding that you have full control over",
                " yourself, and Satan cannot make you commit",
                " any mistake. This high opinion of ones",
                " own power of judgement and will is",
                " another and more dangerous deception of Satan.",
                " Instead of it you should seek Allah's",
                " refuge, for man can save himself from",
                " mistakes only if Allah helps and grants",
                " him protection. The beat commentary of this",
                " subject is the event which Imam Ahmad",
                " has related in his Musnad on the",
                " authority of Hadrat Abu Hurairah. He says",
                " that once a man started uttering invectives",
                " against Hadrat Abu Bakr, in the presence",
                " of the Holy Prophet. Hadrat Abu Bakr",
                " kept on hearing the invectives quietly and",
                " the Holy Prophet kept on smiling at",
                " it. At last, whcn Hadrat Abu Bakr",
                " could restrain himself no longer, he also",
                " uttered a harsh word for the person",
                " in response. No sooner did he utter",
                " the word than the Holy Prophet was",
                " seized by restraint, which appeared on his",
                " face, and he rose and left the",
                " place immediately. Hadrat Abu Bakr also rose",
                " and went behind him. On the way",
                " he asked, 'How is it that as",
                " long as the person went on abusing",
                " me, you kept quiet and smiling, but",
                " whcn I also said a word in",
                " retaliation, you were annoyed\" The Holy Prophet",
                " replied, \"Until you were quiet an angel",
                " remained with you, who went on replying",
                " to him on your behalf, but when",
                " you spoke out Satan came in place",
                " of the angel: I could not sit",
                " with Satan. \"",
                "*41) After seeking Allah's",
                " refuge against the storm of opposition, the",
                " thing that brings patience and peace and",
                " tranquillity to the heart of the believer",
                " is this conviction: \"Allah is not unaware:",
                " He knows whatever we arc doing as",
                " well as that which is being done",
                " against us. He is hearing whatever we",
                " and our opponents utter and watches the",
                " conduct of both of us.\" On the",
                " basis of this very conviction the believer",
                " entrusts his own and the opponents of",
                " the truth's affair to Allah and remains",
                " satisfied. ' This is the fifth place",
                " where the Holy Prophet and, through him,",
                " the believers have been taught this wisdom",
                " of preaching and reforming the people. For",
                " the other four places, see AI-A'raf: 199-204,",
                " An-Nahl: 125-128, Al Mu'minun: 96-98, Al-'Ankabut: 46-47",
                " and the E.N.'s."
            ]
        },
        {
            "id": "[41:37]",
            "verse": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship.",
            "description": [
                "Now the discourse turns to the common",
                " people and they are made to understand",
                " the truth in a few sentences.",
                "*43)",
                " That is, \"They are not the objects",
                " of Divine power that you may start",
                " worshipping them, thinking that Allah is manifesting",
                " Himself in their form, but they are",
                " the Signs of Allah by pondering over",
                " which you can understand the reality of",
                " the universe and its system, and can",
                " know that the doctrine of the Oneness",
                " of God which the Prophets arc teaching",
                " is the actual Reality. The mention of",
                " the night and day before the sun",
                " and moon has been made to give",
                " the warning that the hiding of the",
                " sun and appearing of the moon at",
                " night, and the hiding of the moon",
                " and appearing of the sun in the",
                " day clearly point to the fact that",
                " neither of them is God or object",
                " of Divine power, but both are helpless",
                " and powerless objects, and are moving subject",
                " to the law of God.",
                "*44) This",
                " is an answer to the philosophy that",
                " the intelligent among the polytheists generally used",
                " to propound to prove that polytheism was",
                " rational. They said that they did not",
                " bow to these objects but bowed to",
                " God through them. An answer to this",
                " has been given, so as to say:",
                " \"If you really are Allah's worshippers, there",
                " is no need of these intermediaries: why",
                " don't you bow down to Him directly?'",
                ""
            ]
        },
        {
            "id": "[41:38]",
            "verse": "But if they are arrogant - then those who are near your Lord exalt Him by night and by day, and they do not become weary.",
            "description": [
                "\"If they show arrogance\": If they think",
                " it is beneath them to listen to",
                " you and persist still in the ignorance",
                " in which they are involved.",
                "*46) It",
                " means this: \"The system of this whole",
                " universe, whose agents these' angels are, is",
                " running on the basis of Allah's Oneness",
                " and His servitude. The angels who are",
                " its agents are testifying every moment that",
                " their Lord is pure and exalted far",
                " above that another should be His associate",
                " in His Divinity and worship. Now, if",
                " a few foolish persons do not believe",
                " even after admonition, and turn away from",
                " the way that is being followed by",
                " the whole universe and persist in following",
                " the way of shirk only, Iet them",
                " remain involved in their folly.\" The consensus",
                " is that it is obligatory to perform",
                " sajdah (prostration) here, but the jurists differ",
                " as to which of the two preceding",
                " verses requires the performance of sajdah. Hadrat",
                " 'Ali and Hadrat 'Abdullah bin Mas'ud performed",
                " the sajdah at the end of v.",
                " 37, while Hadrat Ibn 'Abbas, Ibn 'Umar,",
                " Said bin Musayyab, Masruq, Qatadah, Hasan Basri,",
                " Abu 'Abdur Rahman as-Sulami, Ibn Sirin, Ibrahim",
                " Nakha'i and several other prominent jurists have",
                " expressed the opinion that it should be",
                " performed at the end of v. 38.",
                " The same also is the opinion of",
                " Imam Abu Hanifah, and the Shafe'ites also",
                " have held the same view as preferable.",
                ""
            ]
        },
        {
            "id": "[41:39]",
            "verse": "And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.",
            "description": [
                "For explanation, see An--Nahl: 65, Ai-Hijr: 5-7,",
                " Ar-Rum:19 and E.N. 19 of Al-Fatir."
            ]
        },
        {
            "id": "[41:40]",
            "verse": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do.",
            "description": [
                "After telling the common people in a",
                " few sentences that the doctrine of Tauhid",
                " and the Hereafter to which Muhammad (upon",
                " whom be Allah's peace) is inviting them,",
                " is rational and the signs of the",
                " universe testify to its being right and",
                " true, the discourse again tunes to the",
                " opponents who were determined to oppose it",
                " stubbornly.",
                "*49) The word yulhidun in the",
                " original is derived from ilhad which means",
                " to deviate, to turn away from the",
                " right to the wrong path, to adopt",
                " crookedness. Thus, ilhad in the Revelations of",
                " Allah would mean that instead of understanding",
                " them in their clear and straightforward meaning",
                " one should misconstrue them and go astray",
                " and also lead others astray. One of",
                " the devices being adopted by the disbelievers",
                " of Makkah to defeat the message of",
                " the Qur'an was that they would hear",
                " the verses of the Qur'an and then",
                " would isolate one verse from its context,",
                " tamper with another, misconstrue a word or",
                " a sentence and thus raise every sort",
                " of objection and would mislead the people,",
                " saying that the Prophet had said such",
                " and such a thing that day.",
                "*50)",
                " These words imply a severe threat. The",
                " All-Powerful Ruler's saying that the acts of",
                " such and such a person are not",
                " hidden from Him by itself contains the",
                " meaning that he cannot escape their consequences.",
                ""
            ]
        },
        {
            "id": "[41:41]",
            "verse": "Indeed, those who disbelieve in the message after it has come to them... And indeed, it is a mighty Book.",
            "description": [
                "\"A mighty Book\": An unchanging Book, which",
                " cannot be defeated by tricks and cunning",
                " devices, which the worshippers of falsehood are",
                " employing against it. It has the force",
                " of the Truth in it, the force",
                " of true knowledge, the force of argument",
                " and reason, the force of eloquence and",
                " style, the force of Divinity of God",
                " Who sent it, and the force of",
                " the personality of the Messenger who presented",
                " it. No one, therefore, can defeat it",
                " by falsehood and hollow propaganda ."
            ]
        },
        {
            "id": "[41:42]",
            "verse": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy.",
            "description": [
                "\"Falsehood . . . . from before",
                " it\" means that none can succeed in",
                " proving anything wrong or any teaching false",
                " in the Qur'an by making a frontal",
                " attack on it; . . . .",
                " nor from behind it\" means that nothing",
                " can be discovered till Resurrection which may",
                " be opposed to the truths and realities",
                " presented by the Qur'an; no new science,",
                " if it is really a \"science\", can",
                " be propounded, which may contradict the knowledge",
                " contained in the Qur'an; no new experiment",
                " or observation can be made to prove",
                " that the guidance given to man by",
                " the Qur'an in respect of the beliefs,",
                " morality, law, civilization or culture, and economic,",
                " social and political lift is wrong. That",
                " which this Book has declared as the",
                " Truth can never be proved to be",
                " falsehood and that which it has declared",
                " as falsehood can never be proved to",
                " be the truth. Furthermore, it also means",
                " that whether falsehood makes a frontal attack,",
                " or makes a surprise attack by deception,",
                " it cannot defeat the message which the",
                " Qur'an has brought. In spite of all",
                " sorts of open and secret machinations of",
                " the opponents the message will spread and",
                " none shall be able to defeat and",
                " frustrate it."
            ]
        },
        {
            "id": "[41:43]",
            "verse": "Nothing is said to you, [O Muhammad], except what was already said to the messengers before you. Indeed, your Lord is a possessor of forgiveness and a possessor of painful penalty.",
            "description": [
                "That is, \"It is all due to",
                " His clemency and forgiveness that although His",
                " Messengers were opposed, abused and persecuted yet",
                " He went on giving respite to their",
                " opponents for years and years on end.",
                " \""
            ]
        },
        {
            "id": "[41:44]",
            "verse": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.",
            "description": [
                "This is the kind of the stubbornness",
                " that the Holy Prophet was confronting. The",
                " disbelievers said, \"Muhammad (upon whom be Allah's",
                " peace) is an Arab. Arabic is his",
                " mother tongue. How can one believe that",
                " the Arabic Qur'an that he presents has",
                " not been forged by himself but has",
                " been revealed to him by God? The",
                " Qur'an could be believed to be the",
                " Revelation of God if he had started",
                " speaking fluently in a foreign language unknown",
                " to him, like Persian, Latin, or Greek.",
                " \" This argument of theirs has been",
                " refuted by Allah, saying, \"Now when the",
                " Qur'an has been sent down in their",
                " own tongue so that they may understand",
                " it, they raise the objection: Why has",
                " it been sent down to an Arab",
                " in Arabic? But if it had been",
                " sent down in a foreign tongue, these",
                " very people would have said, `How strange!",
                " An Arab Messenger has been sent to",
                " the Arabs, but the Revelations being sent",
                " to him are in a tongue which",
                " is neither understood by him nor by",
                " his people. \"",
                "*55) When a person",
                " is summoned from afar, he hears a",
                " voice but dces not understand what is",
                " being said to him. This is a",
                " wonderful simile which filly depicts the psychology",
                " of the stubborn opponents. Naturally when you",
                " talk to a person who is free",
                " from prejudice, he will listen to you,",
                " will try to understand what you say,",
                " will accept it if it is reasonable,",
                " with an open mind. On the contrary,",
                " the person who is not only prejudiced",
                " against you but is also malicious and",
                " spiteful, will not at all listen to",
                " you however hard you may try to",
                " make him understand your viewpoint. In spite",
                " of hearing you all the time he",
                " will not understand at all what you",
                " had been saying."
            ]
        },
        {
            "id": "[41:45]",
            "verse": "And We had already given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been concluded between them. And indeed they are, concerning the Qur'an, in disquieting doubt.",
            "description": [
                "That is, some people had believed in",
                " it and some others had made up",
                " their minds to oppose it.",
                "*57) It",
                " has two meanings' (1) If Allah had",
                " not already decreed that the people would",
                " be given enough respite for consideration the",
                " disputants would have long been destroyed; (2)",
                " if AIlah had not already decreed that",
                " the disputes would finally be decided on",
                " the Day of Judgement, the reality would",
                " have been made plain as to who",
                " is in the right and who is",
                " in the wrong.",
                "*58) In this brief",
                " sentence the spiritual disease of the disbelievers",
                " of Makkah has been clearly diagnosed. It",
                " says that they are involved in doubt",
                " about the Qur'an and the Holy Prophet",
                " Muhammad (upon whom be Allah's peace ),",
                " and this doubt has caused them great",
                " anguish and confusion. That is, although apparently",
                " they deny the Qur'an's being Allah's Word",
                " and the Holy Prophet's being His Messenger",
                " very vehemently, yet this denial is not",
                " based on any conviction, but their minds",
                " arc afflicted with great vacillation, and doubt.",
                " On the one hand, their selfish motives,",
                " their interests and their prejudices demand that",
                " they should belie the Qur'an and the",
                " Prophet Muhammad (upon whom be Allah's peace)",
                " and oppose them strongly; on the other,",
                " their hearts are convened from within, that",
                " the Qur'an is, in fact, a unique",
                " and un-paralleled Word the like of which",
                " has never been heard from any literary",
                " man or poet. Neither can the insane",
                " utter such things in their madness, nor",
                " can devils come to teach God-worship, piety",
                " and righteousness to the people. Likewise, when",
                " they say that Muhammad (upon whom be",
                " Allah's peace) is a liar, their heaps",
                " from within put them to shame, and",
                " ask: Can such a person ever be",
                " a liar? When they brand him a",
                " madman, their hearts cry out from within",
                " and ask: Do you really think that",
                " he is mad? When they accuse that",
                " Muhammad (upon whom be Allah's peace) is",
                " not interested in the truth but is",
                " working for selfish motives, their hearts from",
                " within curse them and ask: Do you",
                " call this virtuous man selfish, whom you",
                " have never seen striving for the sake",
                " of wealth and power and fame, whose",
                " life has been free from every tract",
                " of self-interest, who has always been working",
                " to bring about goodness and piety, but",
                " has never acted from any selfish motives.",
                ""
            ]
        },
        {
            "id": "[41:46]",
            "verse": "Whoever does righteousness - it is for his [own] soul; and whoever does evil [does so] against it. And your Lord is not ever unjust to [His] servants.",
            "description": [
                "That is, \"Your Lord can never be",
                " so unjust as to Iet go to",
                " waste the good deeds of a good",
                " man and fail to punish the evil-doers",
                " for their evil.\""
            ]
        },
        {
            "id": "[41:47]",
            "verse": "To him [alone] is attributed knowledge of the Hour. And fruits emerge not from their coverings nor does a female conceive or give birth except with His knowledge. And the Day He will call to them, \"Where are My 'partners'?\" they will say, \"We announce to You that there is [no longer] among us any witness [to that].\"",
            "description": [
                "That is, \"None but Allah knows when",
                " the Hour would occur. \" This is",
                " the answer to the disbelievers' question as",
                " to when the threat being given them",
                " of meeting with the consequences of their",
                " evil deeds will be carried out. Allah",
                " has answered their question without citing it.",
                "",
                "*61) \"The Hour\": the Hour of Resurrection,",
                " i.e. the Hour when the evildoers will",
                " be punished for their evil and the",
                " grievances of the oppressed good people will",
                " be redressed.",
                "*62) By this the listeners",
                " have been made to realize two things:",
                " (1) That not only of Resurrection but",
                " the knowledge of all unseen things is",
                " reserved for Allah alone; there is no",
                " other knower of the unseen; and (2)",
                " that God Who possesses the detailed knowledge",
                " of the most minor things cannot remain",
                " unaware of the acts and deeds of",
                " anybody. Therefore, no one in His Kingdom",
                " should act fearlessly, with impunity. Only according",
                " to this second meaning the sentence becomes",
                " relevant to what follows. If one studies",
                " the following sentences the theme that immediately",
                " becomes obvious is: \"Don't concern your selves",
                " about finding our the date of the",
                " coming of Resurrection; you should, however, be",
                " anxious about the consequences of your deviations",
                " you will have to bear when it",
                " comes. \"This same thing had the Holy",
                " Prophet once said to a person, who",
                " asked him the date of the coming",
                " of Resurrection. All the major collections of",
                " Hadith contain a commonly reported Tradition to",
                " the effect: \"Once when the Holy Prophet",
                " was on a journey, a man on",
                " the way shouted his name from a",
                " distance. The Holy Prophet asked what he",
                " wanted to say. He said: When will",
                " Resurrection come? The Holy Prophet replied: It",
                " must come in any case! What preparations",
                " have you made for it?\"",
                "*63) That",
                " is, \"Now we have realized that what",
                " we had in our minds was absolutely",
                " wrong. Now none among us is of",
                " the view that there is another one",
                " also who is Your associate in Godhead.\"",
                " The words \"we have submitted\" show that",
                " on the Day of Resurrection the disbelievers",
                " will be asked again and again, on",
                " every occasion, \"In the world you went",
                " on refusing to believe what the Messengers",
                " of God said: now say who was",
                " in the right: they or you? And",
                " the disbelievers will every time confess that",
                " the truth indeed was that which the",
                " Messengers preached and they themselves were in",
                " the wrong because they forsook the knowledge",
                " and persisted in their own ignorance."
            ]
        },
        {
            "id": "[41:48]",
            "verse": "And lost from them will be those they were invoking before, and they will be certain that they have no place of escape.",
            "description": [
                "That is, \"In their utter hopelessness they",
                " will look around to see if they",
                " could find any one of those whom",
                " they used to serve and worship in",
                " the world, who could come to their",
                " rescue and save them from God's torment,",
                " or at least have their punishment reduced,",
                " but they will find no helper on",
                " any side.\""
            ]
        },
        {
            "id": "[41:49]",
            "verse": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing.",
            "description": [
                "\"For good\": For prosperity, abundance of provisions,",
                " good health, well-being of children, etc. And",
                " \"man\" here does not imply every human",
                " being for it also includes the prophet",
                " and the righteous people , who are",
                " free from this weakness as is being",
                " mentioned below But here it implies the",
                " mean and shallow person who stars imploring",
                " God humbly when touched by harm and",
                " is beside himself with joy when he",
                " receives the good things of life As",
                " most human beings are involved in this",
                " weakness ,it has been called a weakness",
                " of man."
            ]
        },
        {
            "id": "[41:50]",
            "verse": "And if We let him taste mercy from Us after an adversity which has touched him, he will surely say, \"This is [due] to me, and I do not think the Hour will occur; and [even] if I should be returned to my Lord, indeed, for me there will be with Him the best.\" But We will surely inform those who disbelieved about what they did, and We will surely make them taste a massive punishment.",
            "description": [
                "That is 'I have got all this",
                " because of my being worthy of it",
                " :it is my right that I should",
                " receive all this.\""
            ]
        },
        {
            "id": "[41:51]",
            "verse": "And when We bestow favor upon man, he turns away and distances himself; but when evil touches him, then he is full of extensive supplication.",
            "description": [
                "That is, \"He turns away from Our",
                " obedience and worship, and thinks it is",
                " below his dignity to bow to Us.",
                " \"",
                "*68) For other verses on this",
                " subject, see Yunus: 12, Bani Isra'il: 83,",
                " ArRum: 33-36, Az.Zumar: 8-9, 49 and the",
                " E.N.'s."
            ]
        },
        {
            "id": "[41:52]",
            "verse": "Say, \"Have you considered: if the Qur'an is from Allah and you disbelieved in it, who would be more astray than one who is in extreme dissension?\"",
            "description": [
                "It dces not mean that they should",
                " believe in it only owing to the",
                " danger that if it were really from",
                " Allah they would be inviting their own",
                " doom by denying it, but it means",
                " this \"It is not wisdom that you",
                " should be bent upon opposing it stubbornly",
                " without seriously trying to understand what it",
                " says. You cannot assert that you have",
                " come to know that this Qur'an is",
                " not from God, and you have known",
                " with certainty that God has not sent",
                " it. Obviously, your refusal to believe in",
                " it as Divine Word is not based",
                " on knowledge, but on conjecture, which may",
                " possibly be right as well as wrong.",
                " Now consider both the possibilities. If your",
                " conjecture were right, then, according to your",
                " own thinking, both the believers and the",
                " unbelievers would be equal, because both will",
                " became dust after death, and there is",
                " no life hereafter where belief and unbelief",
                " might be distinguished. But, if their Qur'an",
                " were really from God, and that of",
                " which it is forewarning did really take",
                " place, then think what doom you would",
                " invite for yourselves by denying it and",
                " opposing it like that. Therefore, your own",
                " interest demands that you should give up",
                " stubbornness and consider this Qur'an seriously; if",
                " even after due consideration, you decide not",
                " to believe in it, you may not,",
                " but you should not oppose it to",
                " the extent that you start employing falsehood",
                " and deception and persecution to bar the",
                " way of its message and prevent others",
                " from believing in it, not being content",
                " with your own unbelief."
            ]
        },
        {
            "id": "[41:53]",
            "verse": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a Witness?",
            "description": [
                "This verse has two meanings and both",
                " have been given by the major commentators:",
                " First, that they will soon see wit",
                " their own eyes that the message of",
                " the Qur'an has spread in all the",
                " adjoining lands, and they themselves have yielded",
                " to it. Then they will realize that",
                " what they arc being told today, which",
                " they are denying, was absolutely true. Some",
                " people have objected to this meaning, saying",
                " that a message's being dominant and overwhelming",
                " vast areas is no argument to prove",
                " that it is the truth. False messages",
                " also become dominant and their adherents also",
                " go on subduing one country after the",
                " other. But this is a superficial objection",
                " which has been raised without a thorough",
                " study of the matter. The wonderful conquests",
                " that Islam achieved in the period of",
                " the Holy Prophet and the rightlyguided Caliphs,",
                " were not the Signs of Allah only",
                " in the sense that the believers conquered",
                " one country after the other, but in",
                " the sense that this conquest of the",
                " countries was not like other conquests of",
                " the world, which make one man or",
                " one family or one nation master of",
                " the life and property of others and",
                " God's earth is filled with tyranny and",
                " injustice. Contrary to this, this conquest brought",
                " with it a great religious, . moral,",
                " intellectual, cultural, political, economic and social revolution;",
                " whose influence, wherever it reached, elicited what",
                " was best in man and suppressed what",
                " was worst in him. This revolution developed",
                " and nurtured the moral excellences which the",
                " world could hope to see only in",
                " the hermits and the meditating recluses and",
                " could never imagine that they could also",
                " be found among the people responsible for",
                " running the worldly affairs-in the politics of",
                " the rulers, in the chambers of justice,",
                " in the wars and conquests of the",
                " commanders of forces, in the work of",
                " the tax collectors and in the commerce",
                " of the big businessmen. This revolution so",
                " raised the common people in the society",
                " created by it in respect of the",
                " sense of morality, character, cleanliness and purity",
                " that even the select people of other",
                " societies seemed to be much inferior to",
                " them. It took man out of the",
                " labyrinths of superstition and whim and put",
                " him on the broad highway of scientific",
                " research and rational thought and action. It",
                " treated and cured these diseases of the",
                " collective life of whose treatment no idea",
                " existed in the other systems, or if",
                " at all they tried to treat them,",
                " they did not succeed in it. For",
                " example, separation between men on the basis",
                " of colour, race, country and language, classification",
                " of men in the same society and",
                " discrimination among them, non existence of legal",
                " rights and equality in practical life, degeneration",
                " of women and their deprivation of the",
                " basic rights, prevalence of crime, liqour drinking",
                " and use of all intoxicating drugs, the",
                " governments being above criticism and accountability, deprivation",
                " of the fundamental human rights the masses',",
                " disrespect of agreements in international relations, barbarism",
                " in wars, and such other diseases. In",
                " Arabia itself this revolution brought about order",
                " in place of chaos, peace in place",
                " of bloodshed and anarchy, piety in place",
                " of wickedness, justice in place of tyranny",
                " and injustice, purity and culture in place",
                " of filth and indecency, knowledge in place",
                " of ignorance, brotherhood and love in place",
                " of long-standing feuds, and it made a",
                " nation whose people could not dream of",
                " anything beyond chiefship of their tribe, leaders",
                " of the world. These were the Signs",
                " which the very generation before whom the",
                " Holy Prophet had recited this verse for",
                " the first time, saw with their own",
                " eyes, and after that till today Allah",
                " has been constantly showing those Signs. The",
                " Muslims, even during their downfall, displayed such",
                " high morals as could never be attained",
                " by those people who represent as the",
                " leaders of civilization and culture No precedent",
                " can be found from any period of",
                " the history of the Muslims of the",
                " tyrannical treatment that has been meted out",
                " by the European nations to the subdued",
                " nations of Africa, America, Asia and of",
                " Europe itself. This is the blessing of",
                " the Qur'an which has so humanised Muslims",
                " that they could not become so tyrannical",
                " even when they had attained domination as",
                " the non-Muslims have been in all periods",
                " of history and are even today. A",
                " person who has eyes can himself see",
                " how the Muslims treated the Christians in",
                " Spain when they ruled it for centuries,",
                " and how the Christians treated the Muslims",
                " when they gained power there; how the",
                " Muslims behaved towards Hindus during their eight",
                " hundred year long rule in India and",
                " how the Hindus are now treating them",
                " after they have attained power; how the",
                " Muslims treated the Jews during the past",
                " 1300 years and how the Jews are",
                " treating the Muslims in Palestine. The other",
                " meaning of this verse is that Allah",
                " will show the people in the external",
                " world around them as well as in",
                " their own selves such signs as will",
                " make manifest that the teaching the Qur'an",
                " is giving is the very truth. Some",
                " people have raised the objection that the",
                " people even at that time were observing",
                " the world around them and also their",
                " own selves; therefore, it would be meaningless",
                " to show them any such Signs in",
                " the future. But this objection also is",
                " as superficial as the objection against the",
                " first meaning. No doubt, the external world",
                " is the same as man has been",
                " seeing in the past and his own",
                " self also is of the same nature",
                " as has been seen in every age,",
                " yet in these the Signs of God",
                " are so numerous that man has never",
                " comprehended them fully nor will ever be",
                " able to do so. In every age",
                " man has met with many new Signs",
                " and this will go on happening till",
                " the Resurrection Day.",
                "*71) That is, \"Is",
                " it not enough to warn the people",
                " of their evil end that Allah is",
                " watching whatever they are doing to belie",
                " and defeat the Message of the truth?\"",
                ""
            ]
        },
        {
            "id": "[41:54]",
            "verse": "Unquestionably, they are in doubt about the meeting with their Lord. Unquestionably He is, of all things, encompassing.",
            "description": [
                "That is, \"The basic cause of their",
                " attitude and conduct is that they are",
                " not sure that they will ever have",
                " to appear before their Lord and be",
                " held accountable for their deeds and actions.\"",
                "",
                "*73) That is, \"They cannot escape His",
                " grasp nor can anything of their deeds",
                " be prevented from being recorded by Him.",
                " \""
            ]
        }
    ]
}