{
    "name": "Az-Zukhruf",
    "id": 43,
    "verse-count": 89,
    "verse-info": [
        {
            "verse-id": "[43:1]",
            "verse": "Ha, Meem.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:2]",
            "verse": "By the clear Book,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:3]",
            "verse": "Indeed, We have made it an Arabic Qur'an that you might understand.",
            "description": [
                "The object of taking an oath by",
                " the Qur'an is to impress this fact:",
                " \"We are the Author of this Book",
                " and not Muhammad (upon whom be Allah's",
                " peace),\" and the attribute of the Qur'an",
                " chosen for the oath is that it",
                " is a \"lucid Book\". To swear by",
                " the Qur'an itself with its this attribute",
                " in order to impress that the Qur'an",
                " is Divine Word by itself implies this:",
                " \"O people, this is an open Book",
                " before you. Read it intelligently. Its clear",
                " and un-ambiguous themes, its language and literary",
                " style, its teaching which distinguishes the truth",
                " from falsehood, all arc testifying to the",
                " fact that none but the Lord of",
                " the Universe could be its Author. \"",
                " Then the sentence: '\"We have made it",
                " an Arabic Qur'an so that you may",
                " understand it.\" has two meanings:(1) \"It is",
                " not in any foreign tongue but in",
                " your own language; therefore, you can have",
                " no difficulty in assessing its value and",
                " worth. Had it been in a non-Arabic",
                " language, you could have offered the excuse",
                " that you could not determine its being",
                " Divine, or otherwise, for you did not",
                " understand it. But you cannot offer this",
                " excuse about this Arabic Qur'an. Its each",
                " word is clear to you: its each",
                " passage and discourse, both in language and",
                " in theme, is plain for you. Now",
                " you may see it for yourself whether",
                " this could be the word of Muhammad",
                " (upon whom be Allah's peace) or of",
                " some other Arab.\" (2) \"We have sent",
                " this Book in Arabic because We are",
                " addressing the Arabs, who can only understand",
                " an Arabic Qur'an. The person who disregards",
                " this expressly rational ground for sending down",
                " the Qur'an in Arabic and regards it",
                " as the word of Muhammad (upon whom",
                " be Allah's peace) instead of Divine Word",
                " only because Muhammad's mother tongue is also",
                " Arabic, commits a grave injustice. \" (To",
                " understand this second meaning, please see Surah",
                " Ha-Mim As-Sajdah: 44 and its E.N.'s)."
            ]
        },
        {
            "verse-id": "[43:4]",
            "verse": "And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.",
            "description": [
                "\"Umm al-Kitab\": the \"Original Book\": the Book",
                " from which alI the Books sent down",
                " to the Prophets have been derived. In",
                " Surah AI-Waqi`ah the same thing has been",
                " described as Kitab-um-Maknun (the hidden and preserved",
                " Book) and in Surah AI-Buruj 22 as",
                " Lauh-i Mahfuz (the Preserved Tablet), that is,",
                " the Tablet whose writing cannot be effaced,",
                " which is secure from every kind of",
                " interference. By saying that the Qur'an is",
                " inscribed in Umm al-Kitab, attention has been",
                " drawn to an important truth. Different Books",
                " had been revealed by Allah in different",
                " ages to different Prophets for the guidance",
                " of different nations in different languages, but",
                " aII these Books invited mankind to one",
                " and the same Faith: they regarded one",
                " and the same thing as the Truth;",
                " they presented one and the same criterion",
                " of good and evil; they propounded the",
                " same principles of morality and civilization; in",
                " short, they brought one and the same",
                " Din (Religion). The reason was that their",
                " source and origin was the same, only",
                " words were different; they had the same",
                " meaning and theme which is inscribed in",
                " a Source Book with Allah, and whenever",
                " there was a need, He raised a",
                " Prophet and sent down the same meaning",
                " and subject-matter clothed in a particular diction",
                " according to the environment and occasion. Had",
                " Allah willed to raise the Prophet Muhammad",
                " (upon whom be His peace) in another",
                " nation instead of the Arabs, He would",
                " have sent down the same Qur'an in",
                " the language of that nation. In it",
                " the meaning and content would have been",
                " expressed according to the environments and conditions",
                " of the people and land; the words",
                " would have been different and the language",
                " also different but the teaching and guidance",
                " the same basically, and it would be",
                " the same Qur'an though not the Arabic",
                " Qur'an. This same thing has been expressed",
                " in Surah Ash-Shu`ara, thus: \"This (Book) has",
                " been revealed by the Lord of the",
                " worlds. The trustworthy Spirit has come down",
                " with it upon your heart so that",
                " you may become one of those who",
                " are (appointed by God) to warn (the",
                " people) in plain Arabic language; and this",
                " is also contained in the scriptures of",
                " the former peoples.\" (vv. 192-196). (For explanation,",
                " see Ash-Shu`ara: 192196 and the E.N.'s on",
                " it).",
                "*3) This sentence is related both",
                " to Kitab-i mubin and to Umm al-Kitab.",
                " Thus, it is in praise of boththe",
                " Qur'an and the Original Book from which",
                " the Qur'an has been derived. This praise",
                " is meant to impress the fact that",
                " if a person dces not recognize the",
                " true worth of this Book and dces",
                " not benefit from its wise teachings because",
                " of his own folly, it would be",
                " his own misfortune. If someone tried to",
                " degrade it and found fault with it,",
                " it would be his own meanness. It",
                " cannot become worthless on account of someone's",
                " lack of appreciation of it, and its",
                " wisdom cannot be eclipsed by anyone's throwing",
                " dust at it. This is by itself",
                " a glorious Book, which stands exalted by",
                " its matchless teaching, miraculous eloquence, faultless wisdom",
                " and the sublime personality of its great",
                " Author. Therefore, none can succeed in minimizing",
                " its value and worth. In verse 44",
                " below the Quraish in particular and the",
                " Arabs in general have been told that",
                " the revelation of the Book for which",
                " they are showing such lack of appreciation",
                " had provided them a unique opportunity of",
                " honour, which if they lost, would subject",
                " them to a severe accountability before God.",
                " (Please see E.N. 39 below)."
            ]
        },
        {
            "verse-id": "[43:5]",
            "verse": "Then should We turn the message away, disregarding you, because you are a transgressing people?",
            "description": [
                "In this one sentence the whole history",
                " that had taken place since the time",
                " the Holy Prophet Muhammad (upon whom be",
                " Allah's peace) had proclaimed to be a",
                " Prophet till the revelation of these verses",
                " during the past few years has been",
                " compressed. This sentence depicts the following picture:",
                " A nation has been involved in ignorance,",
                " backwardness and depravity for centuries. Suddenly, Allah",
                " looks at it with favour. He raises",
                " in it an illustrious guide and sends",
                " down His own Word to take it",
                " out of the darkness of ignorance so",
                " that it is aroused from slumber, it",
                " gives up superstitions of ignorance and it",
                " becomes aware of the truth and adopts",
                " the right way of life. But the",
                " ignorant people of the nation and the",
                " tribal chiefs turn hostile to the guide,",
                " and try their utmost to defeat him",
                " and his mission. With the passage of",
                " time their hostility and mischief go on",
                " increasing; so much so that they make",
                " up their mind to kill him. At",
                " this, it is being said: \"Should We",
                " stop making any efforts to reform you",
                " because you are proving to be un-worthy",
                " people? Should We withhold sending down this",
                " Admonition, and leave you lying in the",
                " same wretched state in which you have",
                " been lying since centuries ? Do you",
                " really think that should be the demand",
                " of Our Mercy ? Have you ever",
                " considered what doom you would meet when",
                " you have turned down the bounty of",
                " Allah and persisted in falsehood after the",
                " truth has come before you?\""
            ]
        },
        {
            "verse-id": "[43:6]",
            "verse": "And how many a prophet We sent among the former peoples,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:7]",
            "verse": "But there would not come to them a prophet except that they used to ridicule him.",
            "description": [
                "That is, if such absurdity and senselessness",
                " had barred the sending of a Prophet",
                " or a Book, no Prophet would ever",
                " have come to any nation nor a",
                " Book sent to it."
            ]
        },
        {
            "verse-id": "[43:8]",
            "verse": "And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded.",
            "description": [
                "That is, the result of the senselessness",
                " of some particular people could not be",
                " that the entire mankind should be deprived",
                " of the guidance of the Prophethood and",
                " the Book, but its result always has",
                " been that the worshippers of falsehood who,",
                " being drunk with the pride of power,",
                " did not desist from mocking the Prophets,",
                " were ultimately destroyed. When Allah's wrath descended",
                " even the people, who possessed thousands of",
                " times greater power than that possessed by",
                " the puny chiefs of the Quraish, were",
                " crushed to annihilation like mosquitoes and fleas.",
                ""
            ]
        },
        {
            "verse-id": "[43:9]",
            "verse": "And if you should ask them, \"Who has created the heavens and the earth?\" they would surely say, \"They were created by the Exalted in Might, the Knowing.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:10]",
            "verse": "[The one] who has made for you the earth a bed and made for you upon it roads that you might be guided",
            "description": [
                "At other places the earth has been",
                " described as a bed, but here as",
                " a cradle. That is, just as a",
                " child lies resting in its cradle, so",
                " is this great globe meant to be",
                " a place of rest for you, which",
                " is suspended in space, which is spinning",
                " on its axis at a speed of",
                " 1,000 miles an hour, which is revolving",
                " around the sun at a speed of",
                " 66,000 miles an hour. Its interior is",
                " so intensely hot that it can melt",
                " the stones and it manifests its power",
                " sometimes in the form of volcano eruptions.",
                " But, in spite of that, the Creator",
                " has made it so tranquil that one",
                " sleeps on it. in fill peace and",
                " there is no jerk whatever. One lives",
                " on it and does not at all",
                " feel that this globe is suspended and",
                " one is hanging from it with one's",
                " head pointing downward. One moves about on",
                " it with satisfaction and never thinks that",
                " one is riding on a vehicle moving",
                " faster than a bullet. You dig it",
                " at will and turn it inside out",
                " and beat it as you like to",
                " obtain your sustenance, whereas a little shaking",
                " of it in an earthquake makes you",
                " feel what a terrible giant it is,",
                " which Allah has subdued for you. (For",
                " further explanation, sec AI-Naml: 61 and E.N.",
                " 74 on it).",
                "*8) The passes in",
                " the mountains and the rivers in the",
                " hill and plain regions are the natural",
                " paths, which Allah has provided on the",
                " surface of the earth. Man has spread",
                " on, the earth by means of these.",
                " If the mountainous ranges had been created",
                " erect, without a crevice, and there had",
                " been no rivers and streams, man would",
                " have been confined to the same areas",
                " where he was born. Then, Allah through",
                " another grace has not made the whole",
                " surface of the earth uniform in nature,",
                " but has created different marks of distinction",
                " by means of which man recognizes different",
                " lands and feels the difference between one",
                " land and another. This is the second",
                " important means by which man became able",
                " to move about on the earth. This",
                " blessing can be appreciated by the one",
                " who has had a chance of going",
                " on a vast desert, where for thousands",
                " of milts the earth is without any",
                " landmarks and one does not know where",
                " one has reached and where one has",
                " to go.",
                "*9) This sentence gives two",
                " meanings simultaneously: (1) \"That by means of",
                " these natural paths and land-marks you may",
                " fmd your way and reach the place",
                " you want to reach: \" and (2)",
                " \"that you may obtain guidance from the",
                " observation of this craftsmanship of Allah Almighty:",
                " may reach the underlying reality and understand",
                " that this sysum of the earth is",
                " not functioning haphazardly, nor has been devised",
                " by many gods jointly, but there is",
                " one All-Wise Creator, Who has made these",
                " paths in the hills and on the",
                " plains in view of the needs and",
                " requirements of His creatures, and has given",
                " each region of the earth a different",
                " form in countless different ways by means",
                " of which man can distinguish one region",
                " from the other."
            ]
        },
        {
            "verse-id": "[43:11]",
            "verse": "And who sends down rain from the sky in measured amounts, and We revive thereby a dead land - thus will you be brought forth -",
            "description": [
                "That is, \"For each region He has",
                " ordained an average measure of the rain,",
                " which falls year after year for long",
                " ages regularly. It does not happen that",
                " an area may have two inches of",
                " the rainfall one year and 200 inches",
                " of it the next year. Then He",
                " spreads the rainfall over different places in",
                " different times in such a way that",
                " it becomes beneficial on the whole for",
                " the products of the earth. And this",
                " is also His wisdom that He has",
                " deprived some parts of the earth of",
                " the rainfall almost wholly and turned them",
                " into dry, barren deserts, and in some",
                " other parts, He sometimes causes famines w",
                " occur and sometimes sends torrential rains so",
                " that man may know what a great",
                " blessing the rain and its general regularity",
                " is for the populated areas, and he",
                " may also remember that this sysum is",
                " under the control of another power, whose",
                " decrees cannot be changed by anyone. No",
                " one has the power that he may",
                " change the general average of the rainfall",
                " of a country, or effect a variation",
                " in its distribution over vast areas of",
                " the earth, or avert an impending storm,",
                " or attract the displeased clouds towards one's",
                " own land and compel them to rain.\"",
                " (For further explanation, see AI Hijr: 21-22,",
                " Al-Mu'minun: 18-20).",
                "*11) Here, the birth of",
                " vegetation in the earth by means of",
                " water has been presented as an argument",
                " for two things simultaneously: (1) That these",
                " things are happening by the power and",
                " wisdom of One God; no one else",
                " is His associate in these works; and",
                " (2) that there can be life after",
                " death, and it will be. (For further",
                " explanation. see An-Nahl: 65-67, Al-Hajj: 5-7, An-Naml:",
                " 60, Ar-Rum: 19, 24; Fatir: E.N. 19",
                " and Ya Sin: E.N. 29)."
            ]
        },
        {
            "verse-id": "[43:12]",
            "verse": "And who created the species, all of them, and has made for you of ships and animals those which you mount.",
            "description": [
                "Pairs here does not imply only pairs",
                " of men and women among human beings",
                " and of males and females among animals",
                " and vegetation, but there are countless other",
                " things which the Creator has made as",
                " matching partners of each other and by",
                " whose coming together and combination new and",
                " ever new things come into being in",
                " the world. For example, among the elements,",
                " some can be combined with others and",
                " some cannot be. The combination of these",
                " which can combine is resulting into various",
                " compositions, e.g. the negative and positive charges",
                " in electricity are the matching partners of",
                " each other and their mutual attraction is",
                " causing wonderful things to happen in the",
                " world. If man considers the structure and",
                " the mutual relationships and the different forms",
                " of cooperation and the results of the",
                " combination of this and other countless pairs",
                " which Allah has created among countless of",
                " His creations. He cannot help testifying to",
                " the truth that this great workshop of",
                " the world is the creation of one",
                " and only one Almighty, AlI-Wise Designer, and",
                " is functioning only under His care and",
                " control, Only a man of mean intelligence",
                " could suppose that all this happened, and",
                " is happening, without a Wise Being, or",
                " there is the possibility in it of",
                " the agency and interference of more gods",
                " than one."
            ]
        },
        {
            "verse-id": "[43:13]",
            "verse": "That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. \"Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it.",
            "description": [
                "That is, \"Only man from among all",
                " the creatures of the earth was not",
                " given this power by Allah to use",
                " boats and ships and animals as conveyance",
                " so that he may be loaded on",
                " them like bags of grain and should",
                " never think as to who it is",
                " who created possibilities for him to run",
                " boats in the mighty oceans, and who",
                " created some animals of the countless kinds",
                " of animals, with a nature that they",
                " become his servants in spite of being",
                " far stronger than him in power, and",
                " he rides on them and drives them",
                " wherever he likes. To benefit by these",
                " blessings and to forget the Benefactor is",
                " a sign of the heart's becoming dead",
                " and the conscience's being insensitive. For when",
                " a man endowed with a living heart",
                " and a sensitive conscience will sit on",
                " these conveyances, he will be filled with",
                " the feelings of the blessings and with",
                " the gratitude for it, and will cry",
                " out: \"Glorified is the Being Who subjected",
                " these things to me: Glorified is He",
                " from that another should be His associate",
                " in His Being and attributes and powers:",
                " Glorified is He and free from the",
                " weakness that He should become helpless of",
                " performing the functions of His Godhead by",
                " Himself and should stand in need of",
                " other associate gods: Glorified is He that",
                " I should make another an associate with",
                " Him in rendering thanks for these blessings.\"",
                "",
                "The best practical commentary of the intention",
                " and meaning of this verse are the",
                " words that the Holy Prophet (upon whom",
                " be Allah's peace) used to pronounce at",
                " the time he sat on the conveyance.",
                " Hadrat 'Abdullah bin 'Umar says that whenever",
                " the Holy Prophet sat on a conveyance",
                " for a journey, he would pronounce Allah-u",
                " Akbar thrice, then would recite this verse,",
                " and then pray: \"O God, I implore",
                " You to grant me in this journey",
                " the grace of goodness and piety and",
                " such acts as may please You. O",
                " God, make the journey easy and roll",
                " up the long distance for us; O",
                " God, You alone are the Companion during",
                " the journey and Guardian of the family",
                " in ow absence. O God, take care",
                " of us during, the journey and our",
                " household in ow absence. \" (Musnad Ahmed,",
                " Muslim, Abu Da'ud, Nasa'i, Darimi, Tirmidhi).",
                "Hadrat",
                " 'Ali says: Once the Holy Prophet put",
                " his foot in the stirrup with bismillah,",
                " and then, after riding, said: Al-,hamd-u lillah,",
                " subhan-alladhi sakhkhara lana hadha . . .",
                " . , then pronounced al-,hamd-u-lillah thrice, and",
                " Allah-u Akbar thrice; then said: Subhana-ka, la-ilaha",
                " ills anta, qad zalamtu nafsi fagh fir-li.",
                " Then he laughed. I asked: What made",
                " you laugh. O Messenger of Allah? He",
                " replied: When a servant says: Rabb-ighfir-li, Allah",
                " Almighty is very pleased with this. He",
                " says: My servant knows that there is",
                " none beside Me who can forgive sins.\"",
                " (Ahmed, Abu Da'ud, Tirmidhi, Nasa'i, and others)",
                "",
                "Abu Mijlaz says: \"Once I rode on",
                " my animal and recited this verse: Subhan-alladhi",
                " sakhkhara lane hadha . . . ;",
                " Hadrat Hasan (may Allah be pleased with",
                " him) said: Have you been commanded to",
                " say so ? I said: What should",
                " I say then? He replied: Say, thank",
                " God, Who guided us to Islam: Thanks",
                " to Him, Whodid us a favour by",
                " sending Muhammad (upon whom be Allah's peace):",
                " Thanks to Him, Who admitted us into",
                " the best community that has been raised",
                " for the people; then recite this verse.\"",
                " (Ibn Jarir, Ahkam al-Qur'an by Jassas)"
            ]
        },
        {
            "verse-id": "[43:14]",
            "verse": "And indeed we, to our Lord, will [surely] return.\"",
            "description": [
                "That is, \"While embarking on every journey",
                " one should remember that there is ahead",
                " a longer and final journey also. Besides",
                " there is the possibility in the use",
                " of every conveyance that an accident may",
                " turn that very journey into one's last",
                " journey; therefore, every time one should remember",
                " one's return to one's Lord so that",
                " if something untoward happens, one does not",
                " die unawares. Let us pause here for",
                " a while and consider the moral results",
                " of this teaching. Can one imagine that",
                " a person who while sitting on a",
                " conveyance starts his journey consciously with Rill",
                " remembrance of Allah and his return and",
                " accountability before Him, would commit sins and",
                " injustices and tyrannies on the way? Can",
                " a person think or utter these words",
                " from his mouth when he intends to",
                " go to meet a prostitute, or to",
                " visit a club for the purpose of",
                " drinking and gambling? Can a ruler, or",
                " a government official, or a merchant who",
                " has stepped out of his house with",
                " such thoughts and such words at his",
                " lips, usurp the rights of others when",
                " he reaches his destination? Can a soldier",
                " utter these words while boarding his aircraft",
                " or tank when he goes out to",
                " shed blood of the innocent and deprive",
                " the weak of their freedom? If not,",
                " then this one thing alone is enough",
                " to bar every movement undertaken for the",
                " commission of a sin."
            ]
        },
        {
            "verse-id": "[43:15]",
            "verse": "But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful.",
            "description": [
                "\"To make part of Allah\" implies declaring",
                " a servant of Allah His offspring, for",
                " an offspring inevitably is homogeneous with and",
                " a part of the father's body, and",
                " regarding somebody as Allah's son or daughter",
                " means that he or she is being",
                " made a partner in Allah's Being. Besides,",
                " another form of making a creature a",
                " part of Allah is that it should",
                " be regarded as possessor of the attributes",
                " and powers as are specifically Allah's own,",
                " and it should be invoked under the",
                " same concept, or rites of worship performed",
                " before it, or its sanctities observed and",
                " regarded as imperative and binding, for in",
                " that case man divides divinity and providence",
                " between Allah and His servants and hands",
                " over a part of it to the",
                " servants."
            ]
        },
        {
            "verse-id": "[43:16]",
            "verse": "Or has He taken, out of what He has created, daughters and chosen you for [having] sons?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:17]",
            "verse": "And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief.",
            "description": [
                "Here, the folly of the polytheists of",
                " Arabia has been fully exposed. They said",
                " that the angels were the daughters of",
                " Allah. They had carved out their images",
                " as females, and these were their goddesses",
                " whom they worshipped. About this Allah says:",
                " In the first place, in spite of",
                " knowing and recognizing that the Creator of",
                " the earth and heavens is Allah and",
                " it is He Who has made this",
                " earth a cradle for you and it",
                " is He Who sends down the rain",
                " from the sky. and it is He",
                " Who has created these animals for your",
                " service, yet you have taken others as",
                " gods beside Him, whereas those whom you",
                " serve as deities are not God but",
                " creatures of God. Then, further more, you",
                " have made some of the servants associates",
                " of Allah not only in His attributes",
                " but in His Being as well, and",
                " invented the creed that they were Allah's",
                " offspring. Then, not resting content with this,",
                " you assigned to Allah that kind of",
                " the offspring which you regard as disgraceful",
                " for your own selves: When a daughter",
                " is born in your house, your face",
                " grows dark, you feel distressed, and sometimes",
                " you bury her alive. This offspring you",
                " assign to Allah and reserve for yourselves",
                " the sons, whom you regard as a",
                " source of joy and pride. Even then",
                " you claim that you believe in Allah.",
                ""
            ]
        },
        {
            "verse-id": "[43:18]",
            "verse": "So is one brought up in ornaments while being during conflict unevident [attributed to Allah]?",
            "description": [
                "In other words, 'You have assigned to",
                " AIlah the offspring that is by nature",
                " delicate, weak and frail, and adopted for",
                " yourselves the offspring that is bold, courageous",
                " and fearless. \"",
                "This verse shows permissibility",
                " of the ornaments for the women, for",
                " Allah has mentioned the ornaments as a",
                " natural thing for them. The same is",
                " also confirmed by the Hadith. Imam Ahmad,",
                " Abu Da'ud and Nasa'i have related on",
                " the authority of Hadrat `Ali that the",
                " Holy Prophet took silk in one hand",
                " and gold in the other and said",
                " that both were forbidden to be used",
                " in dress by the men of his",
                " Ummah. Tirmidhi and Nasa'i have related from",
                " Hadrat Abu Musa Ash`ari a tradition, saying",
                " that the Holy Prophet said: \"Silk and",
                " gold have been forbidden for the men",
                " but made lawful for the women of",
                " my Ummah.\" `Allama Abu Bakr al-Jassas has",
                " discussed this question in his Ahkam ai-Qur'an",
                " and related the following traditions:",
                "Hadrat 'A'ishah",
                " says: Once Usamah, son of Zaid bin",
                " Harithah, was hurt and started bleeding. The",
                " Holy Prophet loved him tike his own",
                " children. He sucked his blood and spat",
                " it out, and cheered him saying, \"Had",
                " Usamah been a daughter we would have",
                " adorned him with ornaments! Had Usamah been",
                " a daughter, we would have dressed him",
                " in fine clothes !\"",
                "Hadrat Abu Musa",
                " Ash'ari has related that the Holy Prophet",
                " said: 'Wearing of silken clothes and ornaments",
                " of gold is unlawful for the men",
                " of my Unmah but lawful for the",
                " women. \" . Hadrat 'Amr bin `As",
                " has related: `Once two women came before",
                " the Holy Prophet, and they were wearing",
                " bracelets of gold. He said: Would you",
                " like that Allah should make you wear",
                " bracelets of the fire instead of these?",
                " They replied that they would not. Thereupon",
                " he said: Pay their dues, i.e. the",
                " zakat due on them. \"",
                "Hadrat `A'isha",
                " has stated that there is no harm",
                " in wearing the ornaments if the zakat",
                " due on them is paid.",
                "Hadrat 'Umar",
                " wrote to Hadrat Abu Musa Ash'ari: Order",
                " the Muslim women who live in the",
                " areas under your administrative control that they",
                " should pay the zakat dues on their",
                " ornaments.",
                "Imam Abu Hanifah has related the",
                " following traditions on the authority of 'Amr",
                " bin Dinar: Hadrat 'A'ishah had arranged ornaments",
                " of gold for her sisters and Hadrat",
                " 'Abdullah bin 'Umar for his daughters.",
                "After",
                " citing all these traditions 'Allama Jassas writes:",
                " \"The traditions that have been related from",
                " the Holy Prophet and the Companions about",
                " the permissibility and lawfulness of gold and",
                " silk for the women are better known",
                " and more common than those that are",
                " there about their unlawfulness, and the above",
                " . verse also points to their lawfulness.",
                " Then the practice of the Muslims also",
                " from the time of the Holy Prophet",
                " and his Companions till our time (i.e.",
                " till the latter part of the 4th",
                " century of hijrah) has been the same,",
                " and no one ever objected to it.",
                " In such matters, no objection can be",
                " admitted on the basis of the isolate",
                " reports (Akhbar ahab).\""
            ]
        },
        {
            "verse-id": "[43:19]",
            "verse": "And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned.",
            "description": [
                "That is, who are fret from this",
                " that they should be males or females.",
                "",
                "*19) Another translation can be: \"were they",
                " present at the time of their creation?\"",
                ""
            ]
        },
        {
            "verse-id": "[43:20]",
            "verse": "And they said, \"If the Most Merciful had willed, we would not have worshipped them.\" They have of that no knowledge. They are not but falsifying.",
            "description": [
                "This was their reasoning from destiny to",
                " cover up their deviation and error, and",
                " this has been the argument of the",
                " wrong-doers in every age. They argued that",
                " their worshipping the angels became possible only",
                " because Allah allowed them to do so.",
                " Had He not willed so they could",
                " not have done it; and then it",
                " had been a practice with them for",
                " centuries and no torment from Allah had",
                " descended on them, which meant that Allah",
                " did not disapprove of their this practice.",
                ""
            ]
        },
        {
            "verse-id": "[43:21]",
            "verse": "Or have We given them a book before the Qur'an to which they are adhering?",
            "description": [
                "It means this: \"These ignorant people think",
                " that whatever is happening in the world",
                " has the approval of Allah for it,",
                " because it is happening according to His",
                " will. This argument, however, is wrong. For",
                " it is not only shirk which is",
                " being committed in the world, but countless",
                " other crimes like stealing, robbery, murder, bribery,",
                " etc. also are taking place, which nobody",
                " likes. Then, can it be said by",
                " the same reasoning that all such acts",
                " are lawful and good only because Allah",
                " is letting them happen in His world,",
                " and when He allows them to happen,",
                " He must have approved of them also?",
                " The means of knowing what Allah likes",
                " and what He hates are not the",
                " events that are happening in the world,",
                " but the Book of Allah, which comes",
                " through His Messenger and in which Allah",
                " Himself states as to what beliefs, what",
                " deeds and what morals He likes and",
                " what He dislikes. If these people have",
                " a Book, which came before the Qur'an,",
                " and which tells that Allah has appointed",
                " the angels also as deities beside himself",
                " and that they should worship them also,",
                " they should cite it.\" (For further explanation,",
                " see Al-An'am: 107 112, 137, 148-149; AI-A'raf:",
                " 28; Yunus: 99; Hud: 118-119; Ar-Ra'd: 31;",
                " An-Nahl: 9, 35-36, 93; and E.N. 20",
                " of Az-Zumar and E.N. 11 of Ash-Shura).",
                ""
            ]
        },
        {
            "verse-id": "[43:22]",
            "verse": "Rather, they say, \"Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided.\"",
            "description": [
                "That is, \"They have no authority of",
                " any divine book; the only authority they",
                " have is that it has becn the",
                " practice since the time of their forefathers:",
                " therefore, they have taken the angels as",
                " goddesses in imitation of them.\""
            ]
        },
        {
            "verse-id": "[43:23]",
            "verse": "And similarly, We did not send before you any warner into a city except that its affluent said, \"Indeed, we found our fathers upon a religion, and we are, in their footsteps, following.\"",
            "description": [
                "Here, the point worth consideration is why",
                " the well-to-do people of every community only",
                " have resisted the Prophets and upheld the",
                " imitation of their forefathers in every age.",
                " Why have they alone been in the",
                " forefront to oppose the Truth and to",
                " endeavor to maintain the established falsehood and",
                " to beguile and incite the common people",
                " against them ? Its basic causes were",
                " two: (1) The well to-do and affluent",
                " people are so absorbed in making and",
                " enjoying the world of their own that",
                " they are not inclined to bother themselves",
                " about the useless debate (as they assume",
                " it to be) between the Truth and",
                " falsehood. Their love of ease and mental",
                " lethargy renders them so heedless of religion",
                " and conservative that they want the established",
                " order, no matter whether it is based",
                " on truth or falsehood, to retrain in",
                " force so that they do not have",
                " to take the trouble of thinking about",
                " the new order at all for themselves.",
                " (2) Their interests become so dependent on",
                " the established order that when they get",
                " the first glimpse of the order presented",
                " by the Prophets they start feeling that",
                " if it came, it would not only",
                " put an end to their leadership but",
                " also would deprive them of the freedom",
                " to consume the lawful and commit the",
                " unlawful. (For further details, sec AI-An`am: 103;",
                " Al-A'raf: 66-70. 75, 88 109, 127; Hud:",
                " 27-28; Bani Isra`il : 16; AI-Mu'minun: 24-33,",
                " 46; Saba: 34 and the corresponding E.N.'s).",
                ""
            ]
        },
        {
            "verse-id": "[43:24]",
            "verse": "[Each warner] said, \"Even if I brought you better guidance than that [religion] upon which you found your fathers?\" They said, \"Indeed we, in that with which you were sent, are disbelievers.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:25]",
            "verse": "So we took retribution from them; then see how was the end of the deniers.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:26]",
            "verse": "And [mention, O Muhammad], when Abraham said to his father and his people, \"Indeed, I am disassociated from that which you worship",
            "description": [
                "For details, sec AI-Baqarah 124-133, AI-An'am 74-84,",
                " Ibrahim: 3541, Maryam: 41-50, Al-Anbiya': 51-73, Ash-Shu'ara:",
                " 69-89, AI-'Ankabut: 1627, As-Saaffat: 83-100 and the",
                " corresponding E.N `s."
            ]
        },
        {
            "verse-id": "[43:27]",
            "verse": "Except for He who created me; and indeed, He will guide me.\"",
            "description": [
                "In these words not only did the",
                " Prophet Abraham state his creed but also",
                " gave the argument for it. The reason",
                " for not having any connection with the",
                " other deities is that they neither havc",
                " created nor they give right guidance in",
                " any matter, nor they can; and the",
                " reason for having a connection only with",
                " Allah Almighty is that He alone is",
                " the Creator and He alone gives, and",
                " can give, the right guidance to mankind.",
                ""
            ]
        },
        {
            "verse-id": "[43:28]",
            "verse": "And he made it a word remaining among his descendants that they might return [to it].",
            "description": [
                "\"The same word\" : the word that",
                " none but the Creator is worthy of",
                " worship in the world.",
                "*27) That is,",
                " \"Whenever they swerve from the right path,",
                " this word should be there to guide",
                " them so that they return to it",
                " again. \" This event has been mentioned",
                " here in order to expose the foolishness",
                " of the disbelieving Quraish and to put",
                " them to shame, as if to say:",
                " \"When you have adopted obedience of your",
                " ancestors, ,you have selected the most depraved",
                " of them for the purpose instead of",
                " the most righteous and illustrious, who were",
                " the Prophets Abraham and Ishmael (peace be",
                " upon them). \" The basis of the",
                " leadership of the Quraish in Arabia was",
                " that they were the descendants of the",
                " Prophets Abraham and Ishmael and were the",
                " attendants of the Ka'bah built by them.",
                " Therefore, they should have followed them and",
                " not their ignorant forefathers who had given",
                " up the way of the Prophets and",
                " adopted polytheism from the neighboring idol-worshippers. Furthermore,",
                " by mentioning this event another error of",
                " those people has been pointed out. That",
                " is, if the blind imitation of the",
                " fore-fathers, without the distinction of good and",
                " evil, had been the right thing, the",
                " Prophet Abraham should have done so in",
                " the first instance. But he had plainly",
                " told his father and his people that",
                " he could not follow their creed of",
                " ignorance in which they had abandoned the",
                " Creator and made those imaginary beings their",
                " deities, who were not the creator. This",
                " shows that the Prophet Abraham did not",
                " believe in following the forefathers, but his",
                " creed was that before one followed the",
                " forefathers one should see whether they were",
                " following the right way or not, and",
                " if it became known by reason that",
                " they were following the wrong way, one",
                " should give up their way and adopt",
                " the way that was proved right."
            ]
        },
        {
            "verse-id": "[43:29]",
            "verse": "However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger.",
            "description": [
                "Another meaning of the word \"rasulum-mubin can",
                " be: \"A Messenger whose being a Messenger",
                " was obvious and apparent: whose lift before",
                " and after the Prophet hood clearly testified",
                " that he was certainly Allah's Messenger.\""
            ]
        },
        {
            "verse-id": "[43:30]",
            "verse": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\"",
            "description": [
                "For explanation, see Surah. Al-Anbiya' : 3",
                " and E.N. 5 on it, and E.N.",
                " 5 of Surah Suad."
            ]
        },
        {
            "verse-id": "[43:31]",
            "verse": "And they said, \"Why was this Qur'an not sent down upon a great man from [one of] the two cities?\"",
            "description": [
                "\"The two cities\": Makkah and Ta`if. What",
                " the disbelievers meant was: \"Had Allah really",
                " willed to send a messenger and intended",
                " to send down a book to him,",
                " He would have selected a great man",
                " from our these central, cities for the",
                " purpose. For Allah could not have selected",
                " for this great mission a person who",
                " was born an orphan, who did not",
                " inherit much property, who passed his youth",
                " by tending goats, who even at present",
                " earned his living through business with his",
                " wife's money, and who was neither the",
                " chief of a tribe nor the head",
                " of a family. Were not there well",
                " known chiefs like Walid bin Mughirah and",
                " 'Utbah bin Rabi'ah in Makkah, and nobles",
                " like `Urwah bin Mas'ud, Habib bin 'Amr,",
                " Kinanah bin 'Abd-i -'Amr and Ibn 'Abd",
                " Yalil in Ta'if? This was their reasoning.",
                " in the first instance, they were also",
                " not inclined to believe that a man",
                " could be a Messenger. But when the",
                " Qur'an refuted this misconception by argument and",
                " reason and they were told that in",
                " the past only men had come as",
                " Messengers and a man only could be",
                " a Messenger for the guidance of the",
                " people, and not another kind of being",
                " and the Messenger who came did not",
                " descend, suddenly from heavens, but were born",
                " in the same ordinary dwellings, walked about",
                " in the streets, had children and families",
                " and stood in need of food and",
                " drink (see AnNahl: 43, Bani Isra'il: 94-95,",
                " Yusuf: 109, Al-Furqan: 7, 20; Al-Anbiya: 7-8;",
                " Ar-Ra'd: 38), they took this stand, saying:",
                " \"Well, even if a human being, he",
                " should be a big man, who should",
                " be wealthy, influential and awe-inspiring and having",
                " a large following. How could Muhammad bin",
                " `Abdullah (upon whom be Allah's peace) be",
                " fit for this appointment?\""
            ]
        },
        {
            "verse-id": "[43:32]",
            "verse": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate.",
            "description": [
                "This is the answer to their objection,",
                " which briefly mentions many important things: First,",
                " it asks: \"Since when Dave these people",
                " become responsible for distributing the mercy of",
                " your Lord ? Is it for them",
                " to decide whom Allah should favour with",
                " His mercy and whom He should not",
                " ? (Here, by Allah's mercy is implied",
                " His general mercy from which everyone has",
                " a share).",
                "Second, Allah says: 'Prophethood is",
                " a great blessing: We have even kept",
                " the distribution of the common means of",
                " life in the world in Our own",
                " hand, and have not entrusted it to",
                " anyone else. We create someone beautiful and",
                " another ugly, someone with a sweet voice",
                " and another with a harsh voice, someone",
                " robust and strong and another weak and",
                " frail, someone intelligent and another dull, someone",
                " with a strong memory and another forgetful,",
                " some with healthy limbs and another a",
                " cripple, or blind or deaf and dumb,",
                " someone in a rich family and another",
                " among the poor, someone in an advanced",
                " country and another in a backward community.",
                " No one can do anything about this",
                " destiny concerning birth. One is compelled to",
                " be what We have made him. And",
                " it is in no one's power to",
                " avert the impact one's circumstances of birth",
                " have on one's destiny. Then it is",
                " We our self Who arc distributing provisions,",
                " power, honor, fame, wealth, government, etc. among",
                " men. No one can degrade the one",
                " whom We have blessed with good fortune,",
                " and no one can save from ruin",
                " the one whom We have afflicted with",
                " misfortune. All plans and schemes of man",
                " become ineffective against Our decrees. In this",
                " universal Divine System, therefore, how can these",
                " people decide as to whom should the",
                " Master of the unive rse make His",
                " Prophet and whom He should not?",
                "Thirdly,",
                " \"An abiding principle that We have kept",
                " in view in this Divine System is",
                " that everything should not be given to",
                " one and the same person, or everything",
                " should not be given to everybody. If",
                " you look around carefully, you will see",
                " that great differences exist between the people",
                " in every respect. We have given one",
                " thing to one person but deprived him",
                " of another, and given the same to",
                " another one. This is based on the",
                " wisdom that no human being should become",
                " independent of others, but everyone should remain",
                " dependent on the other in one way",
                " or the other. Now if would be",
                " foolish on your part to think that",
                " We should have given the Prophet hood",
                " also to the same person whom We",
                " had blessed with wealth and nobility. Likewise,",
                " will you also say that wisdom, knowledge,",
                " wealth, beauty, power, authority and alI other",
                " excellences should be assembled in one and",
                " the same person, and the one who",
                " has not been given one thing, should",
                " not be given anything else?\"",
                "*32) \"Your",
                " Lord's mercy\": the Prophet hood. It means:",
                " \"Your leaders and chiefs whom you regard",
                " as big people because of their wealth",
                " and dignity and chief ship, arc not",
                " worthy of this wealth, which has been",
                " given to Muhammad bin 'Abdullah (upon whom",
                " be Allah's peace). This wealth is far",
                " superior to that and for this the",
                " criterion is different. If you think that",
                " every noble and rich man is worthy",
                " of becoming a prophet, it would only",
                " show your own thinking. Why do you",
                " expect Allah to be so ignorant and",
                " simple?\""
            ]
        },
        {
            "verse-id": "[43:33]",
            "verse": "And if it were not that the people would become one community [of disbelievers], We would have made for those who disbelieve in the Most Merciful - for their houses - ceilings and stairways of silver upon which to mount",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:34]",
            "verse": "And for their houses - doors and couches [of silver] upon which to recline",
            "description": [
                "That is, \"This silver and gold whose",
                " possession by somebody is the highest blessing",
                " and the very climax of good fortune",
                " in your sight, is so base and",
                " contemptible a thing in the sight of",
                " Allah that had there been no danger",
                " of alI human beings being inclined towards",
                " unbelief, He would have made every disbeliever's",
                " house of gold and silver. Since when",
                " has the abundance of this worthless commodity",
                " become proof of man's nobility and his",
                " piety and his spiritual purity? This kind",
                " of wealth is even found in the",
                " possession of those foul and wicked people",
                " whose filthy characters make the whole society",
                " stink. And this you have made the",
                " criterion of man's greatness of character. \"",
                ""
            ]
        },
        {
            "verse-id": "[43:35]",
            "verse": "And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:36]",
            "verse": "And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion.",
            "description": [
                "\"Dhikr of the Merciful\" : His remembrance",
                " as well as His admonition and the",
                " Qur'an."
            ]
        },
        {
            "verse-id": "[43:37]",
            "verse": "And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:38]",
            "verse": "Until, when he comes to Us [at Judgement], he says [to his companion], \"Oh, I wish there was between me and you the distance between the east and west - how wretched a companion.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:39]",
            "verse": "And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment.",
            "description": [
                "That is, \"In this there is no",
                " aspect of consolation for you that the",
                " one who misguided you is being punished,",
                " for you also are receiving the same",
                " punishment for accepting and following the deviation.",
                " \""
            ]
        },
        {
            "verse-id": "[43:40]",
            "verse": "Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?",
            "description": [
                "It means to say: \"Pay attention to",
                " those who are inclined to listen and",
                " have not closed their eyes to the",
                " realities, and do not consume yourself in",
                " showing the way to the blind and",
                " making the deaf to hear, nor consume",
                " yourself with the grief as to why",
                " your near and dear ones are not",
                " coming to the right path, and why",
                " they are making themselves worthy of Allah's",
                " torment.\""
            ]
        },
        {
            "verse-id": "[43:41]",
            "verse": "And whether [or not] We take you away [in death], indeed, We will take retribution upon them.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:42]",
            "verse": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.",
            "description": [
                "This thing can be understood fully only",
                " by keeping in view the background in",
                " whicjit was said. The disbelievers of Makkah",
                " thought that the person of the Prophet",
                " Muhammad (upon whom be Allah's Peace) had",
                " become a source of trouble for them.",
                " If they could somehow get rid of",
                " him, matters would become normal. On the",
                " basis of this evil thought they were",
                " holding consultations day and night and planning",
                " to kill him. At this, Allah addresses",
                " His Prophet so as to tell them",
                " indirectly: \"It doesn't make any difference whether",
                " you remain among them or not: if",
                " you live, you will see them meet",
                " their doom with your own eyes; if",
                " you are recalled from the world, they",
                " will be sent to their doom in",
                " your absence, because they cannot in any",
                " case escape the consequences of their misdeeds.",
                " \""
            ]
        },
        {
            "verse-id": "[43:43]",
            "verse": "So adhere to that which is revealed to you. Indeed, you are on a straight path.",
            "description": [
                "That is, \"You should not worry as",
                " to what punishment do those who are",
                " resisting and opposing the truth with injustice",
                " and dishonesty receive and when, nor should",
                " you worry whether Islam flourishes during your",
                " lifetime or not. For you this satisfaction",
                " is qute enough that you are on",
                " the Right Path. Therefore, you should go",
                " on fulfilling your mission unconcerned about the",
                " results, and leave it to Allah whether",
                " He defeats falsehood in front of you",
                " or after you. \""
            ]
        },
        {
            "verse-id": "[43:44]",
            "verse": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.",
            "description": [
                "That is, \"There can be no greater",
                " good fortune for a person than that",
                " Allah should choose him from among all",
                " men to become the recipient of His",
                " Book, and there can be no greater",
                " good fortune also for a nation than",
                " that Allah should raise His Prophet in",
                " it, apart from all other nations of",
                " the world, and should send down His",
                " Book in its tongue, and give it",
                " the opportunity to rise as the standard-bearer",
                " of Divine Message in the world. If",
                " the Quraish and the people of Arabia",
                " have no sense of this great honour,",
                " and spurn it, a time will come",
                " when they will be called upon to",
                " account for it.\""
            ]
        },
        {
            "verse-id": "[43:45]",
            "verse": "And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?",
            "description": [
                "\"Ask the Messengers\": Find out from the",
                " Books brought by them. Just as the",
                " meaning of: \"If there arises any dispute",
                " among you about anything, refer it to",
                " Allah and His Prophet,\" is not that",
                " the dispute should be taken before Allah",
                " and His Messenger, but that one should",
                " turn to the Book of Allah and",
                " the Sunnah of His Messenger for a",
                " decision, so \"asking the .Messengers\" also does",
                " not mean that one should approach all",
                " the Messengers who have left the world",
                " and ask them, but the right meaning",
                " is: \"Discover what teachings the Messengers of",
                " Allah have left in the world as",
                " to which of them taught that another",
                " than Allah also is worthy of worship",
                " and service.\""
            ]
        },
        {
            "verse-id": "[43:46]",
            "verse": "And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, \"Indeed, I am the messenger of the Lord of the worlds.\"",
            "description": [
                "This story has been narrated here for",
                " three objects: (1) That when Allah sends",
                " His Prophet to a country and nation",
                " and affords it the opportunity which He",
                " has now given to the Arabs by",
                " appointing the Prophet Muhammad (upon whom be",
                " Allah's peace) to Prophet hood, and it,",
                " instead of taking advantage of it, commits",
                " the folly of Pharaoh and his people,",
                " it meets the same. fate which has",
                " become an object lesson in history. (2)",
                " That just as Pharaoh also on account",
                " of his arrogance and pride of kingdom",
                " and grandeur and wealth and possessions had",
                " belittled the Prophet Moses as mean and",
                " contemptible, so the unbelieving Quraish now are",
                " regarding Muhammad (upon whom be Allah's peace)",
                " as insignificant as against their chiefs. But",
                " God's judgment was different which ultimately proved",
                " who was really great. (3) That to",
                " mock Allah's Revelations and show stubbornness against",
                " His warnings is not a mere joke,",
                " but a very serious sin. If you",
                " do not learn a lesson from the",
                " fate of those who have been doomed",
                " on account of this, you also would",
                " go to your doom on account of",
                " the same.\"",
                "*42) This implies the signs",
                " with which the Prophet Moses had gone",
                " to the court of Pharaoh, i.e. the",
                " Signs of the staff and the shining",
                " hand. (For explanation, see AI-A'raf: 107-108, Ta",
                " Ha: 20-22, Ash-Shu'ara: 32-33, AnNaml: 10-12, Al-Qasas:",
                " 31-32)."
            ]
        },
        {
            "verse-id": "[43:47]",
            "verse": "But when he brought them Our signs, at once they laughed at them.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:48]",
            "verse": "And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith].",
            "description": [
                "This implies the Signs which Allah showed",
                " them through the Prophet Moses afterwards, and",
                " these were the following:",
                "(1) A public",
                " encounter of Allah's Prophet with the magicians,",
                " who believed after their defeat. For details,",
                " see Al-A'raf: 112-126, Ta Ha: 68-73. AshShu'ara:",
                " 37-51.",
                "(2) A severe famine which hit",
                " the land of Egypt according to the",
                " Prophet Moses' announcement and which left the",
                " country only on his prayer.",
                "(3) Dreadful",
                " rain and hail-storms accompanied by lightning and",
                " thunder struck the country even as the",
                " Prophet had announced, which destroyed the crops",
                " and dwellings and which also was removed",
                " only on his prayer.",
                "(4) The sudden",
                " appearance of locusts in the land. This",
                " calamity also was not removed till the",
                " Prophet prayed to Allah.",
                "(5) Lice and",
                " weavils spread throughout the country according to",
                " the announcement made by Moses, which afflicted",
                " men and animals on the one hand,",
                " and destroyed granaries on the other. This",
                " torment also was averted when the Prophet",
                " Moses was requested to pray for its",
                " removal.",
                "(6) Frogs appeared everywhere in the",
                " country according to the warning given by",
                " Moses, which put the whole population to",
                " great distress; this calamity also did not",
                " retreat till the Prophet prayed for it.",
                "",
                "(7) The torment of blood appeared precisely",
                " as foretold by Moses, which turned the",
                " water of all canals, wells, springs, pools",
                " and cisterns into blood. The fish died",
                " and the water smelled so bad that",
                " the Egyptians could not drink from it",
                " for a full week. This evil also",
                " was averted when the Prophet Moses was",
                " asked to pray for its removal. For",
                " details, see AIA'raf: 130-136. An-Naml: 12 and",
                " E.N. 37 of Al-Mu'min.",
                "Chapters 7 to",
                " 10 of Exodus also contain the details",
                " of these calamities, but it is a",
                " combination of gossip and truth. It says",
                " that when the calamity of blood appeared,",
                " the magicians also worked a similar miracle,",
                " but when the calamity of the lice",
                " came, the magicians could not produce lice",
                " in response, and they said that it",
                " was God's work. Even more strange than",
                " this is that when the storm of",
                " the frogs came, the magicians also brought",
                " about frogs, but in spite of that",
                " Pharaoh requested only the Prophet Moses to",
                " pray to God to take away the",
                " frogs. The question is when the magicians",
                " could produce frogs, why didn't Pharaoh get",
                " the frogs taken away through them? And",
                " how did it become known which of",
                " the frogs were Allah's work and which",
                " of the magicians'? The same question arises",
                " about the blood. When according to the",
                " warning of Moses water became blood everywhere,",
                " which water did the magicians turn into",
                " blood? And how was it known that",
                " the water of a particular place had",
                " turned blood by the power of the",
                " magicians? Such are the things which show",
                " that the Bible does not consist of",
                " purely Divine revelation, but the people who",
                " wrote it mixed up many things in",
                " it from their own imagination. The pity,",
                " however, is that the authors also were",
                " people of ordinary intelligence, who did not",
                " even know how to invent a story.",
                ""
            ]
        },
        {
            "verse-id": "[43:49]",
            "verse": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:50]",
            "verse": "But when We removed from them the affliction, at once they broke their word.",
            "description": [
                "The stubbornness of Pharaoh and the chiefs",
                " of his people can be judged from",
                " the fact that when distressed by the",
                " torment they wanted the Prophet Moses to",
                " pray for its removal, even then they",
                " did not recognize him as a Prophet",
                " but addressed him as a magician, whereas",
                " they were not unaware of the truth",
                " about magic, and they also knew that",
                " those miraculous things could not be brought",
                " about by the power of magic. The",
                " most that a magician can do is",
                " that in a limited area he can",
                " so influence the people present in front",
                " of him as to make them feel",
                " that water has become blood, or frogs",
                " are coming out in large numbers or",
                " swarms of locusts are advancing. And within",
                " this limited place also no water will",
                " actually become blood, but water will remain",
                " water as soon as it comes outside",
                " it; no frog will be produced in",
                " actual fact, but will prove to be",
                " an imaginary thing as soon as brought",
                " outside the circle; locusts also would be",
                " imaginary: they would not be able to",
                " destroy any crop. As for this that",
                " a famine appears throughout a country, or",
                " that the canals and springs and wells",
                " of the country are filled with blood,",
                " or that swarms of locusts spread over",
                " thousands of square miles and eat up",
                " crops growing over lakhs of acres, this",
                " has neither been accomplished by a magician",
                " so far, nor can it ever happen",
                " by the power of magic. Should such",
                " magicians be there in the service of",
                " a king, he need not keep forces",
                " and fight wars; he could conquer the",
                " whole world by the power of magic.",
                " Even if the magicians possessed such power,",
                " they would not seek service under the",
                " kings, but would assume kingship themselves.",
                "The",
                " commentators in general have been perplexed as",
                " to why Pharaoh and his courtiers addressed",
                " the Prophet Moses as \"O sorcerer,\" when",
                " they requested him to pray for the",
                " removal of the calamity, for the one",
                " who seeks another's help in a hard",
                " time flatters him and does not condemn",
                " him. They have given the interpretation that",
                " sorcery in the Egypt of those days",
                " was held as a very respectable art,",
                " and when they addressed Moses as \"O",
                " sorcerer\" they did not condemn him, but",
                " honored him because it amounted w calling",
                " him as \"O Learned man\" But this",
                " interpretation is absolutely wrong on the ground",
                " that wherever at other places in the",
                " Qur'an Pharaoh's sayings have been cited in",
                " which he had called the Prophet Moses",
                " a sorcerer and the miracles presented by",
                " him sorcery, the sense of condemnation and",
                " contempt becomes apparent, and it becomes manifestly",
                " clear that sorcery was false in his",
                " sight, which he imputed to the Prophet",
                " Moses so as to prove his claim",
                " to the Prophet hood to be false",
                " !Therefore, it cannot be acceptable that suddenly",
                " at this time \"sorcerer\" became the title",
                " of an honorable and Learned man in",
                " his sight. As for the question: Why",
                " did the Prophet Moses accede to his",
                " request at all when even while requesting",
                " him for the prayer, Pharaoh insulted him",
                " publicly, the answer is that the object",
                " before the Prophet Moses was to strengthen",
                " the case against those people by Allah's",
                " command. Their request to him to pray",
                " for the removal of the torment by",
                " itself proved that in their heart of",
                " hearts they had come to know why",
                " the torments were occurring, who was sending",
                " them and who could avert them. In",
                " spite of that, when they called him",
                " a \"sorcerer\" stubbornly, and went back on",
                " their word of following the right way",
                " as soon as the torment was averted,",
                " they in fact, did not do any",
                " harm to Allah's Prophet, but only caused",
                " the case and argument to be strengthened",
                " against themselves, which Allah at last decided",
                " against them with their total destruction. When",
                " they called him a sorcerer, this did",
                " not mean that they believed in their",
                " hearts as well that the torments against",
                " them were coming by the power of",
                " sorcery, but they realized it fully well",
                " that those were Allah's Signs and yet",
                " they denied them deliberately. The same thing",
                " has been said in Surah An-Naml: 14:",
                " \"They rejected those Signs out of sheer",
                " injustice and vanity, whereas in their heart",
                " of hearts they were convinced. \""
            ]
        },
        {
            "verse-id": "[43:51]",
            "verse": "And Pharaoh called out among his people; he said, \"O my people, does not the kingdom of Egypt belong to me, and these rivers flowing beneath me; then do you not see?",
            "description": [
                "Pharaoh probably sent heralds to the cities",
                " and towns throughout the country to proclaim",
                " what he said in his address to",
                " his ministers and courtiers in the capital.",
                " Pharaoh could not have availed of the",
                " services of a sycophantic press, controlled news",
                " agencies and official radio.",
                "*46) The words",
                " of the proclamation clearly show that ground",
                " was slipping from under the Pharaoh's feet.",
                " The miracles performed one after the other",
                " by the Prophet Moses had caused the",
                " common people's beliefs in their gods to",
                " waver and the Pharaoh's spell under which",
                " their dynasty was ruling over Egypt as",
                " representatives of the gods, was shattered. Thereupon,",
                " Pharaoh cried out: \"O wretched people, can't",
                " you see who is ruling over this",
                " land and under whose control are the",
                " canals which have been dug out from",
                " the Nile, upon which depends your whole",
                " economy ? All these developments in this",
                " country have been brought about by me",
                " and my predecessors, but you arc being",
                " devoted, charmed and fascinated 6y this pauper!",
                " \""
            ]
        },
        {
            "verse-id": "[43:52]",
            "verse": "Or am I [not] better than this one who is insignificant and hardly makes himself clear?",
            "description": [
                "\"Wretched person\" : the person who has",
                " neither wealth, power nor authority. This same",
                " objection had been raised by the disbelieving",
                " Quraish against the Holy Prophet Muhammad (upon",
                " whom be Allah's peace).",
                "*48) Some commentators",
                " have expressed the opinion that Pharaoh referred",
                " to the impediment of speech from which",
                " the Prophet Moses suffered since childhood. But",
                " this is not a correct opinion. As",
                " has been mentioned in Surah Ta Ha",
                " above, when the Prophet Moses was being",
                " appointed to Prophet hood, he had implored",
                " Allah Almighty to remove the defect from",
                " his tongue so that the people might",
                " understand his speech, and at that very",
                " time his request had also been granted",
                " along with his other requests (vv. 27-36).",
                " Moreover, orations of the Prophet Moses that",
                " have been cited at different places in",
                " the Qur'an, point to his perfect eloquence",
                " and fluency. Therefore, the basis of Pharaoh's",
                " objection was not any impediment of speech",
                " from which Moses might be suffering but",
                " what he meant was: \"This person talks",
                " confusedly at least I have never been",
                " able to understand what he says.\""
            ]
        },
        {
            "verse-id": "[43:53]",
            "verse": "Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?\"",
            "description": [
                "In the ancient times when a person",
                " was appointed to be governor of a",
                " land or sent as an ambassador to",
                " a foreign country, a robe of honor",
                " was conferred on him by the king,",
                " which also included bracelets of gold, and",
                " he was also accompanied by a contingent",
                " of soldiers and servants for over-awing the",
                " people and for showing the glory and",
                " grandeur of the king who had appointed",
                " him. What Pharaoh meant to say was:",
                " \"If the King of the heavens had",
                " really sent Moses (peace be upon him)",
                " as His ambassador to His counterpart on",
                " the earth, he should have been dressed",
                " in a robe of honor and come",
                " with several contingents of angels in attendance.",
                " How strange that a poor man should",
                " appear with a staff in his hand",
                " and say that he was the messenger",
                " of the Lord of the worlds!\""
            ]
        },
        {
            "verse-id": "[43:54]",
            "verse": "So he bluffed his people, and they obeyed him. Indeed, they were [themselves] a people defiantly disobedient [of Allah].",
            "description": [
                "A tremendous reality has been expressed in",
                " this brief sentence. When a person wishes",
                " to become autocratic in a country, and",
                " contrives every plan openly to achieve his",
                " object-practices every deception and trick, buys and",
                " sells consciences, and persecutes and crushes ruthlessly",
                " those who cannot be purchased-he, in fact,",
                " shows by his actions, whatever he may",
                " say to the contrary, that he takes",
                " the people of the country to be",
                " light as regards their intellect, morals and",
                " manliness, and has formed the impression that",
                " he can drive the foolish, unscrupulous and",
                " cowardly people wherever he likes. Then, when",
                " he has succeeded in his designs and",
                " the people have become his obedient servants,",
                " they prove by their conduct and behavior",
                " that they are actually what the wicked",
                " man had taken them to be, and",
                " the main cause of their depravity is",
                " that they arc basically a \"sinful people.\"",
                " They are not in the least concerned",
                " as to what is the truth and",
                " what is falsehood, what is justice and",
                " what is injustice, whether the noble traits",
                " of character are truthfulness and honesty or",
                " falsehood and dishonesty and meanness. Instead of",
                " this, only their personal interests are of",
                " real importance to them, for the sake",
                " of which they remain ever ready to",
                " cooperate with every wicked person, to yield",
                " to every tyrant, to accept every falsehood",
                " and to suppress every protest that is",
                " voiced in favor of the truth."
            ]
        },
        {
            "verse-id": "[43:55]",
            "verse": "And when they angered Us, We took retribution from them and drowned them all.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:56]",
            "verse": "And We made them a precedent and an example for the later peoples.",
            "description": [
                "That is, \"They are a precedent for",
                " those who do not learn any lesson",
                " from their example, and an object lesson",
                " for those who are keen to learn",
                " a lesson. \""
            ]
        },
        {
            "verse-id": "[43:57]",
            "verse": "And when the son of Mary was presented as an example, immediately your people laughed aloud.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:58]",
            "verse": "And they said, \"Are your gods better, or is he?\" They did not present the comparison except for [mere] argument. But, [in fact], they are a people prone to dispute.",
            "description": [
                "In verse 45 above, it was said:",
                " \"You may ask all other Messengers whom",
                " We sent before you whether We had",
                " appointed any other gods to be worshipped",
                " beside the Merciful God.\" When this discourse",
                " was being presented before the people of",
                " Makkah, a person called `Abdullah ibn az-Ziba'ra",
                " in the traditions, put forward the objection:",
                " \"Well, is it not a fact that",
                " the Christians regard the son of Mary",
                " as the son of God and worship",
                " him ? What is then wrong with",
                " our gods?\" This caused much laughter among",
                " the crowd of the disbelievers and they",
                " started clamoring for an answer to this",
                " objection. But at this foolish behavior, the",
                " continuity of the revelation was not broken,",
                " but was first completed and then the",
                " objection of the questioner was taken up.",
                " (It should be borne in mind that",
                " this incident has been reported in the",
                " books of commentaries in different ways which",
                " contain great variations, but after a study",
                " of the context and the traditions the",
                " real incident in our view is the",
                " same as we have mentioned above)."
            ]
        },
        {
            "verse-id": "[43:59]",
            "verse": "Jesus was not but a servant upon whom We bestowed favor, and We made him an example for the Children of Israel.",
            "description": [
                "\"Making an example of Our power\" implies",
                " causing the Prophet Jesus to be born",
                " without a father, and then granting him",
                " such miracles as had not been granted",
                " to anyone before him nor to anyone",
                " after him. He would make a bird",
                " of clay and then breathe into it",
                " and it would become a living bird;",
                " he would give sight to those born",
                " blind; he would cure the lepers; so",
                " much so that he would raise the",
                " dead back to life. What Allah means",
                " to say is: \"It is wrong to",
                " worship him as son of God and",
                " regard him as above servitude only because",
                " of his extraordinary birth and the great",
                " miracles granted to him. He was no",
                " more than a mere servant, whom We",
                " had blessed and made an example of",
                " Our power.\" (For details, see Al`Imran: 42-49,",
                " 59; An-Nisa: 156; Al-Ma`idah: 17, 110; Maryam:",
                " 17-35; AIAnbiya`: 91, Al-Mu'minun: SO)."
            ]
        },
        {
            "verse-id": "[43:60]",
            "verse": "And if We willed, We could have made [instead] of you angels succeeding [one another] on the earth.",
            "description": [
                "Another translation can be: \".............make some of",
                " you angels."
            ]
        },
        {
            "verse-id": "[43:61]",
            "verse": "And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path.",
            "description": [
                "Another translation of this sentence can be:",
                " \"He is a means of the knowledge",
                " of Resurrection.\" Here the question arises: What",
                " is implied by \"he'? According to Hadrat",
                " Hasan Basri and Said bin Jubair it",
                " implies the Quran. That is, one can",
                " learn from the Qur'an that Resurrection will",
                " come. But this commentary is irrelevant to",
                " the context. There is nothing in the",
                " context on the basis of which it",
                " may be said that it refers to",
                " the Qur'an. Other commentators almost unanimous]y have",
                " expressed the opinion that it implies the",
                " prophet Jesus Christ, and this is suitable",
                " to the context. Now the question is:",
                " In what sense has Jesus Christ been",
                " called a Sign or a means of",
                " the knowledge of Resurrection? Ibn 'Abbas, Mujahid,",
                " `Ikrimah, Qatadah, Suddi, Dahhak, Abul `Aliyah and",
                " Abu Malik say that this refers to",
                " the second coming of the Prophet Jesus",
                " as has been foretold in a large",
                " number of the Traditions, and the verse",
                " means that when he comes the second",
                " time to the world, it wilt become",
                " known that Resurrection is not far behind.",
                " But in spite of the great authority",
                " that these scholars hold it is difficult",
                " to believe that in this verse the",
                " second advent of the Prophet Jesus has",
                " been called a Sign of Resurrection, or",
                " a means of its knowledge. For it",
                " is contradicted by the next verse. His",
                " second advent, indeed, can be a means",
                " of the knowledge of Resurrection only for",
                " those people who will be living in",
                " that future period or will be born",
                " after that. How could he be regarded",
                " as a means of the knowledge for",
                " the pagans of Makkah, who are being",
                " asked \"not to have any doubt about",
                " it\"? Therefore, the correct interpretation in our",
                " opinion is the one that has been",
                " given by some other commentators, according to",
                " which the Prophet Jesus' birth without a",
                " father and his making a bird out",
                " of clay and his raising the dead",
                " back to life has been presented as",
                " a proof of the possibility of Resurrection.",
                " So, the Divine Words would mean: why",
                " do you think it is impossible for",
                " God to raise you and alI mankind",
                " from death when He can create a",
                " child without a father and a servant",
                " of His can breathe life into an",
                " image of clay and raise the dead",
                " back to life?\""
            ]
        },
        {
            "verse-id": "[43:62]",
            "verse": "And never let Satan avert you. Indeed, he is to you a clear enemy.",
            "description": [
                "\" ...... hinder you from this\" :",
                " hinder you from believing in Resurrection."
            ]
        },
        {
            "verse-id": "[43:63]",
            "verse": "And when Jesus brought clear proofs, he said, \"I have come to you with wisdom and to make clear to you some of that over which you differ, so fear Allah and obey me.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:64]",
            "verse": "Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path.\"",
            "description": [
                "That is, \"The Prophet Jesus himself had",
                " never claimed that he was God or",
                " son of God, and that the people",
                " should worship him, but, on the contrary,",
                " his message was the same as of",
                " all other Prophets, the same as was",
                " now being conveyed to you through Muhammad",
                " (upon whom be Allah's peace).\" (For explanation,",
                " see Al-`Imran: 50-51, An-Nisa: 171-172, Al-Ma'idah: 72,",
                " 116-117, Maryam: 30-36)."
            ]
        },
        {
            "verse-id": "[43:65]",
            "verse": "But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day.",
            "description": [
                "That is, one group of the people",
                " denied him and in their antagonism went",
                " to the extent of accusing him of",
                " illegitimate birth and got him crucified as",
                " they thought; the other group believed in",
                " him but owing to exaggerated reverence made",
                " him son of God, and then the",
                " question of man's being God became such",
                " a riddle for it that every effort",
                " to resolve it caused it to be",
                " divided into countless sects. (For explanation, see",
                " An-Nisa: 171, AI-Ma'idah 17, 77,116-117 and the",
                " corresponding E.N.'s),"
            ]
        },
        {
            "verse-id": "[43:66]",
            "verse": "Are they waiting except for the Hour to come upon them suddenly while they perceive not?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:67]",
            "verse": "Close friends, that Day, will be enemies to each other, except for the righteous",
            "description": [
                "In other words, only those friendships will",
                " remain unaffected which are based on righteousness",
                " and piety in the world; alI other",
                " friendships will turn into enmities, and those",
                " who are cooperating with one another in",
                " deviation, tyranny and wickedness today, will on",
                " the Day of Resurrection, put the blame",
                " on others and try to escape. This",
                " subject has been treated repeatedly at many",
                " places in the Qur'an so that every",
                " person in this very world may fully",
                " realize with whom it would be beneficial",
                " for him to cooperate and with whom",
                " it is harmful."
            ]
        },
        {
            "verse-id": "[43:68]",
            "verse": "[To whom Allah will say], \"O My servants, no fear will there be concerning you this Day, nor will you grieve,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:69]",
            "verse": "[You] who believed in Our verses and were Muslims.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:70]",
            "verse": "Enter Paradise, you and your kinds, delighted.\"",
            "description": [
                "The word azwaj as used in the",
                " original can be used both for the",
                " wives and for those people who are",
                " a person's close associates, friends and peers.",
                " This comprehensive word has been used so",
                " as to cover both the meanings. The",
                " believers will be accompanied both by their",
                " believing wives and by their believing friends",
                " in Paradise."
            ]
        },
        {
            "verse-id": "[43:71]",
            "verse": "Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:72]",
            "verse": "And that is Paradise which you are made to inherit for what you used to do.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:73]",
            "verse": "For you therein is much fruit from which you will eat.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:74]",
            "verse": "Indeed, the criminals will be in the punishment of Hell, abiding eternally.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:75]",
            "verse": "It will not be allowed to subside for them, and they, therein, are in despair.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:76]",
            "verse": "And We did not wrong them, but it was they who were the wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:77]",
            "verse": "And they will call, \"O Malik, let your Lord put an end to us!\" He will say, \"Indeed, you will remain.\"",
            "description": [
                "\"Malik\" : a keeper of Hell as",
                " is evident from the context."
            ]
        },
        {
            "verse-id": "[43:78]",
            "verse": "We had certainly brought you the truth, but most of you, to the truth, were averse.",
            "description": [
                "That is, \"We made the reality plain",
                " to you, but you were fond of",
                " the imaginary, and you had an aversion",
                " to the truth. Now, why do you",
                " lament at the fate of your foolish",
                " choice?\" It may be a part of",
                " the Hell-keeper's answer, and it may also",
                " be that his answer ended with: \"Here",
                " you must remain ! \" and this",
                " second sentence an addition by Allah. In",
                " the first case, the keeper's saying: \"We",
                " had brought the Truth to you,\" is",
                " just like an official's using the word",
                " \"we\" nn behalf of his government, when",
                " he wants to say, \"Our government did",
                " this or gave such and such an",
                " order. \""
            ]
        },
        {
            "verse-id": "[43:79]",
            "verse": "Or have they devised [some] affair? But indeed, We are devising [a plan].",
            "description": [
                "The allusion is to the plans that",
                " the chiefs of the Quraish were devising",
                " in their secret assemblies in order to",
                " take a decisive action against the Holy",
                " Prophet."
            ]
        },
        {
            "verse-id": "[43:80]",
            "verse": "Or do they think that We hear not their secrets and their private conversations? Yes, [We do], and Our messengers are with them recording.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:81]",
            "verse": "Say, [O Muhammad], \"If the Most Merciful had a son, then I would be the first of [his] worshippers.\"",
            "description": [
                "It means: \"My rejection of somebody's being",
                " God's offspring and my refusal to worship",
                " those whom you regard as His offspring",
                " is not due to any stubbornness and",
                " obduracy. My reason for the refusal is",
                " only this that God has no son",
                " or daughter, and your such beliefs are",
                " against the reality; otherwise I am such",
                " a faithful servant of my Lord that",
                " if at all the reality had been",
                " the same as you state I would",
                " have submitted myself in worship before you.",
                " \""
            ]
        },
        {
            "verse-id": "[43:82]",
            "verse": "Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:83]",
            "verse": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[43:84]",
            "verse": "And it is Allah who is [the only] deity in the heaven, and on the earth [the only] deity. And He is the Wise, the Knowing.",
            "description": [
                "That is, \"The gods of the heavens",
                " and the earth are not separate, but",
                " there is only One God of the",
                " entire universe. It is His wisdom that",
                " is working in the whole system of",
                " the universe and only He has the",
                " knowledge of all realities.\""
            ]
        },
        {
            "verse-id": "[43:85]",
            "verse": "And blessed is He to whom belongs the dominion of the heavens and the earth and whatever is between them and with whom is knowledge of the Hour and to whom you will be returned.",
            "description": [
                "That is, \"He is far above it",
                " that another should be His associate in",
                " Godhead and may have any share whatever",
                " in ruling this great universe. Whatever is",
                " there in the earth and the heavens,",
                " whether the Prophets, the saints, the angels,",
                " jinn, spirits, stars or planets, they are",
                " His servants and slaves and subjects.. It",
                " is impossible for them to be characterized",
                " with a Divine attribute or be possessed",
                " with a Divine power.\"",
                "*67) That is,",
                " \"You may have taken anyone as your",
                " helper and patron in the world, but",
                " after death you will have to face",
                " only One God and render an account",
                " of your deeds before Him alone.\""
            ]
        },
        {
            "verse-id": "[43:86]",
            "verse": "And those they invoke besides Him do not possess [power of] intercession; but only those who testify to the truth [can benefit], and they know.",
            "description": [
                "This sentence has several meanings:",
                "(1) Those",
                " whom the people have made their deities",
                " in the world, will not at all",
                " be their intercessors before Allah. Those of",
                " them who were wicked, will themselves be",
                " presented as culprits there. However, those who",
                " had borne witness to the Truth by",
                " virtue of knowledge (and not unconsciously) will",
                " certainly be able to intercede for others.",
                "",
                "(2) Those who will be permitted to",
                " intercede, will be able to do so",
                " only for those who had testified to",
                " the Truth consciously (and not heedlessly). They",
                " will neither intercede of their own will,",
                " nor will have the permission to intercede",
                " for anyone who had gone and been",
                " led astray from the Truth in the",
                " world, or had been affirming the faith",
                " in Allah as the only Deity unconsciously",
                " as well as serving other deities at",
                " the same tithe",
                "(3) If a person",
                " says that those whom he has made",
                " gods necessarily possess the powers of intercession,",
                " and they wield such an influence with",
                " Allah that they can have anyone they",
                " like forgiven, irrespective of his beliefs and",
                " deeds, is totally wrong. No one enjoys",
                " such a position with Allah. If the",
                " one who claims that another has such",
                " powers of intercession, can testify to the",
                " truth of this matter by virtue of",
                " knowledge, one should have the courage to",
                " say so. But if one is not",
                " in a position to bear such a",
                " testimony, and one is certainly not, it",
                " would be sheer folly to invent such",
                " a creed on the basis of mere",
                " hearsay, or conjecture, and risk one's life",
                " hereafter relying only on an imaginary support.",
                "",
                "Incidentally, this verse also gives two important",
                " principles: First, it shows that bearing a",
                " testimony to the truth without knowledge may",
                " be reliable in the world, but it",
                " is not so before Allah. In the",
                " world, whoever affirms the Faith verbally will",
                " be regarded as a Muslim and treated",
                " as such unless he openly commits an",
                " act expressly contradictory to belief. But as",
                " before Allah only such a one will",
                " be counted as a Muslim, who has",
                " uttered L8 ilaha ill-Allah consciously, with full",
                " understanding of what he is denying and",
                " what he is affirming according to his",
                " best knowledge.",
                "Secondly, it gives this principle",
                " of the law of cvidence that knowledge",
                " is a pre-requisite of bearing the cvidence.",
                " If the bearer of an evidencc has",
                " no knowledge of the event to which",
                " he is bearing evidence, his evidencc is",
                " meaningless. The same is borne out by",
                " a decision given by the Holy Prophet.",
                " He said to a witness: \"If you",
                " saw what happened with your own eyes",
                " as you are seeing the sun, then",
                " you may bear the witness, otherwise not.\"",
                " (Ahkam al-Qur an by al Jassas)."
            ]
        },
        {
            "verse-id": "[43:87]",
            "verse": "And if you asked them who created them, they would surely say, \"Allah.\" So how are they deluded?",
            "description": [
                "This verse has two meanings: (1) \"If",
                " you ask them who has created them,",
                " they will say: Allah\"; and (2) \"lf",
                " you ask them who is the Creator",
                " of their gods, they will say: Allah.\"",
                ""
            ]
        },
        {
            "verse-id": "[43:88]",
            "verse": "And [Allah acknowledges] his saying, \"O my Lord, indeed these are a people who do not believe.\"",
            "description": [
                "This is one of the most difficult",
                " verses of the Qur'an as it involves",
                " the complicated syntactic question of the kind",
                " of waw that has been used in",
                " wa qil-i-hi. From the translation of Shah",
                " 'Abdul Qadir it appears that the waw",
                " here is not conjunctive but for taking",
                " oath, and is related to fa-anna yu'fakun,",
                " and the pronoun in gili-hi turns to",
                " the Holy Prophet of Allah. Therefore, the",
                " verse means this: \"By this saying of",
                " the Messenger: `O my Lord, these arc",
                " a people who would not believe'\": they",
                " are so utterly deluded that although they",
                " themselves admit that Allah alone is their",
                " Creator and Creator of their gods, yet",
                " they abandon the Creator and persist in",
                " worshipping His creatures.\" The object of swearing",
                " by this saying of the Messenger is",
                " that the conduct of the people clearly",
                " shows that they are, in fact, stubborn,",
                " for the foolishness of their attitude is",
                " apparent from their own admission, and such",
                " an irrational attitude can be adopted only",
                " by such a person, who is resolved",
                " not to believe. In other words, the",
                " oath implies: `The Messenger has rightly said",
                " so: indeed these people world not believe,\"",
                ""
            ]
        },
        {
            "verse-id": "[43:89]",
            "verse": "So turn aside from them and say, \"Peace.\" But they are going to know.",
            "description": [
                "That is, \"You should neither curse them",
                " for their scornful words and attitude of",
                " mockery and derision, nor respond with harsh",
                " words: just wish them well and take",
                " your leave.\""
            ]
        }
    ]
}