{
    "name": "Al-Jaathiyah",
    "verse-count": 37,
    "verse-info": [
        {
            "id": "[45:1]",
            "verse": "Ha, Meem.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:2]",
            "verse": "The revelation of the Book is from Allah, the Exalted in Might, the Wise.",
            "description": [
                "In this brief introduction to the Surah,",
                " the listeners have been warned of two",
                " things: (1) That this Book is not",
                " the composition of Muhammad (upon whom be",
                " Allah's peace) himself, but it is being",
                " sent down to him by Allah; and",
                " (2) that it is being sent down",
                " by that Allah Who is All-Mighty as",
                " well as All-Wise. His being the Almighty",
                " demands that man should not dare disobey",
                " His Commands, for if he disobeys Him,",
                " he cannot escape His punishment; and His",
                " being the All-Wise demands that man should",
                " obey and follow His Guidance and His",
                " Commands with full satisfaction and willingness of",
                " the heart, for there can be no",
                " possibility of His teachings being wrong or",
                " inadequate or harmful in any way."
            ]
        },
        {
            "id": "[45:3]",
            "verse": "Indeed, within the heavens and earth are signs for the believers.",
            "description": [
                "To begin the discourse like this after",
                " the introduction, indicates that in the background",
                " there are the objections of the people",
                " of Makkah, which they were raising against",
                " the teachings of the Holy Prophet. They",
                " said: 'After alI, how can we believe",
                " this one man when he says that",
                " all those great beings to whose shrines",
                " we have been dedicated and devoted so",
                " far, are nothing and that Godhead belongs",
                " to only One God ?\" About this",
                " it is being said that the world",
                " is replete with the signs of the",
                " Reality to which they are being invited.",
                " If on]y they saw with open eves,",
                " they would find those signs in themselves",
                " and outside them everywhere, which testify that",
                " this whole universe is the creation of",
                " One and only One God, and He",
                " alone is its Master and Ruler and",
                " Controller. It didn't need to be pointed",
                " out what was the nature of the",
                " signs in the earth and heavens, for",
                " the dispute at that time centred around",
                " the point that the polytheists were insisting",
                " on believing in other gods and deities",
                " also besides Allah and the Qur'an gave",
                " the message that there was neither a",
                " god nor a deity beside One God.",
                " Therefore, it was apparent by itself from",
                " the content that the signs were of",
                " the truth of Tauhid and of the",
                " refutation of shirk. As for the sentence:",
                " \"The signs are for those who believe,\"",
                " it means that although the signs arc",
                " meant for all human beings, only those",
                " people can reach the right conclusion from",
                " their observation, who are inclined to believe;",
                " as for the heedless people, who live",
                " like animals and the stubborn people who",
                " are resolved not to believe, the existence",
                " and the non-existence of the signs is",
                " equal. The splendour and beauty of the",
                " garden is for those who can sec;",
                " a blind man cannot perceive any splendour",
                " and beauty; for him even the existence",
                " of the garden is meaningless."
            ]
        },
        {
            "id": "[45:4]",
            "verse": "And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].",
            "description": [
                "That is, \"The case of those who",
                " have made up their minds not to",
                " believe, or of those who have chosen",
                " for themselves to remain lost in the",
                " blind alleys of doubt, is different, but",
                " when those who have not locked up",
                " their hearts against belief and conviction, will",
                " consider seriously their own creation, the structure",
                " of their own body, and the variety",
                " of animals found on the earth, they",
                " will see countless such signs as will",
                " leave no doubt in their minds that",
                " all this did not come into being",
                " without a God, or that it stood",
                " in need of more than one Cod",
                " for its creation. (For explanation, see A1",
                " An`am: 37-38, An-Nahl: 5.8, AI-Hajj: 57, AI-Mu'minun:",
                " 12-14, AI-Furqan: 54, Ash-Shu'ara': 78-81, An-Naml: 64,",
                " Ar-Rum: 20-21, 54, E.N.'s 14 to 18",
                " of As-Sajdah, Ya Sin: 71-73, Az-Zumar: 6,",
                " and E.N.'s 97, 98,110 of Al-Mu'min)."
            ]
        },
        {
            "id": "[45:5]",
            "verse": "And [in] the alternation of night and day and [in] what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.",
            "description": [
                "The difference of the night and day",
                " is a sign because one follows the",
                " other with full regularity, because one is",
                " bright and the other dark, because over",
                " a certain period the day goes on",
                " shortening and the night lengthening gradually till",
                " the two become equal in duration, then",
                " again the day goes on lengthening and",
                " the night shortening till the two again",
                " become equal in duration. These different kinds",
                " of variations found in the night and",
                " the day and the great aspects of",
                " wisdom that accrue from these, arc a",
                " clear pointer to the fact that the",
                " Creator of the sun and the earth",
                " and of every thing on the earth",
                " is one and that one AII-Powerful Being",
                " is keeping both these spheres under His",
                " control; that that Being is not deaf",
                " and blind and unwise but All-Wise, Who",
                " has established this unalterable system and made",
                " His earth a suitable place for the",
                " countless species of life, which He has",
                " created here in the form of vegetables,",
                " animals and men. (For explanation, see Yunus:",
                " 67, An Naml: 86, Al-Qasas: 71-73, Luqman:",
                " 29 and E.N. S0, Ya Sin: 37",
                " and E.N. 32)",
                "*5) \"Provisions\": rainfall as",
                " becomes evident from the following sentence.",
                "*6)",
                " For explanation, see Al-Mu'minun: 18-20, Al-Furqan: 48-49,",
                " AshShu'ara': 7, An-Naml: 61, Ar-Ruth: 24, 48,",
                " Ya Sin: E.N.'s 26 to 31.",
                "*7)",
                " The circulation of the winds implies the",
                " circulation of the different kinds of winds",
                " at different times, on different parts of",
                " the earth and at different heights, which",
                " cause change of the seasons. What deserves",
                " attention is not only that above the",
                " surface of the earth there is a",
                " thick atmosphere, which contains all those elements",
                " needed by living beings for breathing, and",
                " this thick covering has kept the earth's",
                " population safe from many of the heavenly",
                " calamities. Besides, another noteworthy thing is that",
                " the air is not just filled inertly",
                " in the atmosphere, but it blows occasionally",
                " in different ways. Sometimes a cool wind",
                " blows and sometimes a hot wind; sometimes",
                " it stops blowing and sometimes it starts",
                " blowing; sometimes it blows soft and sometimes",
                " strong, and sometimes it assumes the proportions",
                " of a storm, sometimes a dry wind",
                " blows and sometimes a moist wind; sometimes",
                " it brings the rain and sometimes it",
                " drives away the clouds. These different kinds",
                " of the winds do not blow without",
                " a purpose, but under a law and",
                " a system, which testifies that this arrangement",
                " is based on perfect wisdom, and it",
                " is serving great objectives. Then it is",
                " deeply related with coolness and heat, which",
                " go on increasing and decreasing according to",
                " the changing conditions and relationships between the",
                " earth and the sun. Furthermore, it has",
                " a deep relation with the seasonal changes",
                " and the distribution of the rain. All",
                " these facts proclaim that these arrangements have",
                " not been made haphazardly by some blind",
                " nature, nor have the sun and the",
                " earth and the air and water and",
                " vegetation and animals separate controllers, but inevitably",
                " One God alone is the Creator of",
                " them aII, and it is His Wisdom",
                " that has established this system for a",
                " great objective, and it is His power",
                " that it is functioning regularly according to",
                " a pre-ordained law."
            ]
        },
        {
            "id": "[45:6]",
            "verse": "These are the verses of Allah which We recite to you in truth. Then in what statement after Allah and His verses will they believe?",
            "description": [
                "That is, \"When these people have not",
                " believed even after Allah's own arguments have",
                " been presented for His Existence and His",
                " Unity, what else can be there by",
                " which they will gain the faith ?",
                " For Allah's Word is the final thing",
                " by which a person can attain to",
                " this blessing, and the maximum of the",
                " rational arguments that could possibly be given",
                " to convince someone of an unseen reality",
                " have been presented in this Divine Word.",
                " In spite of this if a person",
                " is bent upon denial, he may persist",
                " in his denial, for his denial cannot",
                " change the reality.\""
            ]
        },
        {
            "id": "[45:7]",
            "verse": "Woe to every sinful liar",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:8]",
            "verse": "Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.",
            "description": [
                "In other words, there is a marked",
                " difference between the person who listens to",
                " Allah's Revelations sincerely with an open mind",
                " and ponders over them seriously and the",
                " person who listens to them resolved that",
                " he would deny them, and then persists",
                " in the resolve already made without any",
                " serious thought. If the first person dces",
                " not believe in the Revelations immediately, it",
                " does not mean that he wants to",
                " remain an unbeliever, but because he wants",
                " to have greater satisfaction. Therefore, even if",
                " he is taking time to believe, it",
                " is just possible that another Revelation might",
                " enter his heart and he might believe",
                " sincerely with full satisfaction. As for the",
                " other person, he would never believe in",
                " any Revelation whatever, for he has already",
                " locked his heart up to every Revelation",
                " of Allah. In this state such people",
                " generally arc involved as arc characterised by",
                " the following three qualities: (1) They arc",
                " liars; therefore, the truth does not appeal",
                " to them; (2) they are wrongdoers; therefore,",
                " it is very hard for them to",
                " believe in a teaching or guidance that",
                " may impose moral restrictions on them; and",
                " (3) they arc involved in the conceit",
                " that they know everything, and that none",
                " can teach them anything; therefore, they do",
                " not regard as worthy of attention and",
                " consideration Allah's Revelations that are recited to",
                " them, and it is all the same",
                " for them whether they listen to there",
                " or not."
            ]
        },
        {
            "id": "[45:9]",
            "verse": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.",
            "description": [
                "That is, \"He dons not rest content",
                " with mocking any one particular Revelation, but",
                " mocks all the Revelations. For example, when",
                " he hears that a particular thing has",
                " been mentioned in the Qur'an, he does",
                " not take it in its straight-forward meaning,",
                " but first puts a crooked meaning on",
                " it in order to make it a",
                " subject of ridicule and mockery, then after",
                " making fun of it, says: \"These arc",
                " strange things: one daily hears one or",
                " the other funny thing from them. \"",
                ""
            ]
        },
        {
            "id": "[45:10]",
            "verse": "Before them is Hell, and what they had earned will not avail them at all nor what they had taken besides Allah as allies. And they will have a great punishment.",
            "description": [
                "The word wara' is used for every",
                " such thing as is hidden from man,",
                " whether it is before. him or behind",
                " him. Therefore, another translation can be: \"They",
                " have Hell behind them.\" In the first",
                " case, the meaning would be: \"They are",
                " unconsciously running on this way and have",
                " no idea that there is Hell in",
                " front of them in which they would",
                " fall ; \" in the second case,",
                " it would mean: \"They are engaged in",
                " this mischief of theirs, thoughtless of the",
                " Hereafter, and they have no idea that",
                " Hell is in pursuit of them.\"",
                "*12)",
                " Here, the word wali (guardian) has been",
                " used in two meanings; (1) For those",
                " gods and goddesses and living and dead",
                " guides about whom the polytheists thought that",
                " anybody who was devoted to them, would",
                " escape Allah's punishment, whatever he might have",
                " done in the world, for their intercession",
                " will save them from Allah's wrath; and",
                " (2) for those chiefs and leaders and",
                " rulers whom the people took as their",
                " guides and patrons independent of God and",
                " followed them blindly and tried to please",
                " them even if they had to displease",
                " God. This verse warns all such people",
                " that when they will face Hell in",
                " consequence of this way of lift, neither",
                " of the two kinds of the guardians",
                " will come forward to save them from",
                " it. (For further explanation, see E. N",
                " . 6 of Surah Ash- Shura)."
            ]
        },
        {
            "id": "[45:11]",
            "verse": "This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:12]",
            "verse": "It is Allah who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.",
            "description": [
                "For explanation, see Bani Isra'il: 66-67, Ar-Rum:",
                " 46 and the corresponding E.N.'s, and E.N.",
                " 55 of Luqman, E.N. 110 of Al",
                " Mu'min, and E.N. 54 of Ash-Shura.",
                "*14)",
                " \"Seek His bounty\": Seek lawful provisions by",
                " trade, fishing, diving, navigation and other means",
                " in the sea."
            ]
        },
        {
            "id": "[45:13]",
            "verse": "And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought.",
            "description": [
                "For explanation, see Ibrahim: 32 and E.N.",
                " 44 on it, and E.N. 35 of",
                " Luqman.",
                "*16) This sentence has two meanings:",
                " (1) `This gift and favor of AIlah",
                " is not like the gift of the",
                " worldly kings, who favor their favorites with",
                " the wealth that they have collected from",
                " the people themselves, but, on the contrary,",
                " aII the good things, in the universe",
                " have been created by Allah Himself, and",
                " He has granted these to man from",
                " Himself ; \" and (2) `neither is",
                " anyone a partner of Allah in the",
                " creation of these good things, nor has",
                " anyone anything to do in making them",
                " subservient to man. Allah alone is their",
                " Creator and He alone has granted these",
                " to man from Himself. \"",
                "*17) That",
                " is, `In their subjection and in making",
                " them beneficial for tnan there are many",
                " signs for those who think and reflect.",
                " These signs clearly point to the truth",
                " that the Creator and Master and Administrator",
                " of everything and of every power in",
                " the universe, from the earth to the",
                " heavens, is One God alone Who has",
                " subjected them to a law; and that",
                " God alone is Lord of man Who",
                " has made aII these things and powers",
                " favourable and helpful for man's life his",
                " sustenance, his convenience, his development and his",
                " civilization and social life by His power",
                " and wisdom and mercy, and that God",
                " alone is worthy of man's service and",
                " gratitude and devotion and not some other",
                " beings, who have neither any share in",
                " creating the things and powers nor anything",
                " to do with subjecting them to man",
                " and making them beneficial for him. \"",
                ""
            ]
        },
        {
            "id": "[45:14]",
            "verse": "Say, [O Muhammad], to those who have believed that they [should] forgive those who expect not the days of Allah so that He may recompense a people for what they used to earn.",
            "description": [
                "Literally: `Who do not except the days",
                " of Allah.\" But in Arabic usage on",
                " such occasions ayyam does not merely mean",
                " days but those memorable days in which",
                " important historical events may have taken place.",
                " For example, the word ayyam-ul 'Arab is",
                " used for the important events of the",
                " history of the Arabs and the major",
                " battles of the Arab tribes, which the",
                " later generations remember for centuries. Here, ayyam-AIlah",
                " implies the evil days of a nation",
                " when the wrath of Allah may descend",
                " on it and ruin it in consequence",
                " of its misdeeds. That is who we",
                " have translated it: \"Those who do not",
                " fear the coming of evil days from",
                " Allah,\" i.e. those who do not fear",
                " that a day will come when they",
                " will be called to account for their",
                " actions and deeds, and this same fearlessness",
                " has made them bold and stubborn in",
                " acts of wickedness.",
                "*19) The commentators have",
                " given two meanings of this verse and",
                " the words of the verse admit of",
                " both: (I) \"That the believers should pardon",
                " the excesses of this wicked group so",
                " that AIlah may reward them for their",
                " patience and forbearance and nobility from Himself",
                " and recompense them for the persecutions they",
                " have suffered for His sake.\" (2) \"That",
                " the believers should pardon these people so",
                " that Allah may Himself punish them for",
                " their persecutions of them.\"",
                "Some other commentators",
                " have regarded this verse as repealed. They",
                " say that this command was applicable only",
                " till the Muslims had not been permitted",
                " to fight. Then, when they were permitted",
                " to fight, this command became abrogated. But",
                " a careful study of the words of",
                " the verse shows that the claim about",
                " abrogation is not correct. The word \"pardon\"",
                " is never used in the sense that",
                " when a person is not able to",
                " retaliate upon another for the tatter's excesses,",
                " he should pardon him, but on such",
                " an occasion the usual words are patience",
                " and forbearance. Instead of them, when the",
                " word \"pardon\" has been used here, it",
                " by itself gives the meaning that the",
                " believers, in spite of their ability for",
                " retaliation, should refrain from retaliating upon the",
                " people for their excesses, whom fearlessness of",
                " God has made to transgress all limits",
                " of morality and humanity. This command does",
                " not contradict those verses in which the",
                " Muslims have been permitted to fight. Permission",
                " to fight pertains to the condition when",
                " the Muslim government has a reasonable ground",
                " for taking military action against an unbelieving",
                " people, and the command concerning forgiveness and",
                " pardon pertains to the common conditions in",
                " which the believers have to live in",
                " contact with a people who are fearless",
                " of God and have to suffer persecutions",
                " by them in different ways. The object",
                " of this command is that the Muslims",
                " should keep their moral superiority and should",
                " not stoop to the Level of the",
                " morally inferior people by indulging in disputes",
                " and wrangling with them and resort to",
                " retaliation for every frivolity. As long as",
                " it is possible to respond to an",
                " accusation or objection gently and rationally, or",
                " to defend oneself against an excess, one",
                " should not refrain from this, but when",
                " things seem to be crossing these limits,",
                " one should hold one's peace and entrust",
                " the matter to Allah. If the Muslims",
                " themselves become involved in a fight or",
                " quarrel with them, Allah will leave them",
                " alone to deal with them; but if",
                " they pardon and forbear, Allah will Himself",
                " deal with the wicked people and reward",
                " the oppressed ones for their patience."
            ]
        },
        {
            "id": "[45:15]",
            "verse": "Whoever does a good deed - it is for himself; and whoever does evil - it is against the self. Then to your Lord you will be returned.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:16]",
            "verse": "And We did certainly give the Children of Israel the Scripture and judgement and prophethood, and We provided them with good things and preferred them over the worlds.",
            "description": [
                "Hukm (judgement) implies three things: (1) Knowledge",
                " and understanding of the Book and Religion;",
                " (2) wisdom to act according to the",
                " intention of the Book; and (3) capability",
                " to give right decisions in disputes.",
                "*21)",
                " It does not mean that they were",
                " given preference over all the people of",
                " the world for ever, rather it means:",
                " Allah had chosen the children of Israel",
                " from among all the contemporary nations of",
                " the world for the service that they",
                " should hold fast to the Divine Book",
                " and should rise as the standard-bearers of",
                " God-worship in the world."
            ]
        },
        {
            "id": "[45:17]",
            "verse": "And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
            "description": [
                "For explanation, see AI-Baqarah: 213, AI-'Imran: 19",
                " and E.N.'s 22, 23 of Ash-Shura."
            ]
        },
        {
            "id": "[45:18]",
            "verse": "Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.",
            "description": [
                "It means: \"The mission that had been",
                " entrusted to the children of Israel before",
                " you has now been entrusted to you.",
                " They, in spite of receiving knowledge, created",
                " such differences in religion out of selfish",
                " motives and stirred up such divisions among",
                " themselves that they became disqualified to call",
                " the people to God's way. Now you",
                " have been set upon the clear highway",
                " of Religion so that you may perform",
                " the service which the children of Israel",
                " have failed to perform and become disqualified",
                " to perform it. \" (For further explanation,",
                " see Ash-Shura: 13-15 and E.N.'s 20 to",
                " 26)."
            ]
        },
        {
            "id": "[45:19]",
            "verse": "Indeed, they will never avail you against Allah at all. And indeed, the wrongdoers are allies of one another; but Allah is the protector of the righteous.",
            "description": [
                "That is, \"If you make any changes",
                " in Allah's Religion only to please them,",
                " they will not be able to save",
                " you from Allah's accountability and punishment. \"",
                ""
            ]
        },
        {
            "id": "[45:20]",
            "verse": "This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].",
            "description": [
                "That is, \"This Book and this Shari`ah",
                " present such a light for all the",
                " people of the world, which distinguishes the",
                " truth from falsehood, but only such people",
                " receive any guidance from it who believe",
                " in its truth; for them only it",
                " is a mercy. \""
            ]
        },
        {
            "id": "[45:21]",
            "verse": "Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge.",
            "description": [
                "After the invitation to Tauhid, the discourse",
                " now turns to the theme of the",
                " Hereafter.",
                "*27) This is the moral reasoning",
                " for the truth of the Hereafter. The",
                " difference of good and evil in morals",
                " and of goodness and wickedness in deeds",
                " necessarily demands that the good and the",
                " evil people should not meet with one",
                " and the same end, but the good",
                " should be rewarded for their good and",
                " the wicked punished for their evil deeds.",
                " Otherwise, if the good and the evil",
                " end up similarly, the distinction of virtue",
                " and vice in morals becomes meaningless and",
                " God becomes unjust. The people who follow",
                " evil ways in the world do want",
                " that there should be no accountability and",
                " no rewards and punishments, for this concept",
                " goes against their enjoyment of life, but",
                " it is against the justice and wisdom",
                " of the Lord of the worlds that",
                " He should treat the good and the",
                " evil alike, and should not care to",
                " see how the righteous believer has lived",
                " his life in the world and how",
                " the sinful unbeliever has been enjoying it.",
                " One of them kept himself subjected to",
                " moral restrictions aII his life, rendered the",
                " rights of those to whorl they were",
                " due, restrained himself from the unlawful benefits",
                " and pleasures, and continued to incur losses",
                " for the sake of the truth; the",
                " other fulfilled his desires in every possible",
                " wary: neither recognized the rights of God",
                " nor hesitated froth violating the rights of",
                " the people, but watt un collecting benefits",
                " and good things of life in every",
                " possible way. Can it be expected of",
                " God that He would overlook the difference",
                " between the lives of the two kinds",
                " of men? If the end of both",
                " be the same, no greater injustice could",
                " be conceived. (For further explanation, sec Yunus:",
                " 4, Hud: 106 An-Nahl: 38 39, AI-Hajj:",
                " E N. 9, An-Naml: E,N. 86, Ar-Rum:",
                " 7-8, Suad: 28 and E.N. 30 on",
                " it)."
            ]
        },
        {
            "id": "[45:22]",
            "verse": "And Allah created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.",
            "description": [
                "That is, 'Allah has not created the",
                " earth and the heavens for mere sport,",
                " but it is a wise system with",
                " a purpose. In this system it is",
                " absolutely unimaginable that the people who may",
                " have accomplished good deeds by the right",
                " use of the powers and means and",
                " resouces granted by AIlah and the people",
                " who may have spread mischief and wickedness",
                " by their wrong use, should end up",
                " ultimately in the dust after death, and",
                " there should be no life hereafter in",
                " which their good and bad deeds should",
                " lead to good or bad results according",
                " to justice. If this were so, this",
                " universe would be the plaything of a",
                " thoughtless being, and not a purposeful system",
                " devised by a Wise Being.\" (For further",
                " explanation, sec AIAn'am: 73, Yunus: 5-6, Ibrahim:",
                " 19, An-Nahl: 3, AI-'Ankabut: 44 and E.N.'s",
                " 75, 76; Ar-Rum: 8 and E.N. 6",
                " on it).",
                "*29) In this context the",
                " sentence clearly means: 'If the good people",
                " are not rewarded for their goodness, and",
                " the wicked are not punished for their",
                " wickedness, and the grievances of the oppressed",
                " are not redressed, it would be injustice.",
                " There cannot be such an injustice in",
                " the Kingdom of God. Likewise, there cannot",
                " also be the other kind of injustice",
                " that a good man be given a",
                " lesser reward Matt what is due to",
                " him, or a bad man given a",
                " greater punishment than what he deserves. \"",
                ""
            ]
        },
        {
            "id": "[45:23]",
            "verse": "Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?",
            "description": [
                "\"To make one's lust one's god\" implies",
                " that one should become a slave of",
                " one's lusts and desires: one should do",
                " whatever one likes whether God has forbidden",
                " it, and should not do what one",
                " dislikes, whether God has made it obligatory.",
                " When a man starts obeying somebody like",
                " this, it means that his deity is",
                " not God but the one whom he",
                " is obeying without question, no matter whether",
                " he calls him his Iord (with the",
                " tongue) or not, and carves out an",
                " image of him and worship: him or",
                " not. For when he has worshipped him",
                " directly without question, it is enough to",
                " make him a deity and after this",
                " practical shirk one cannot be absolved from",
                " the guilt of shirk only because one",
                " did not call the object of one's",
                " worship one's deity with the tongue, nor",
                " prostrated oneself before it. The other major",
                " commentators also have given the same commentary",
                " of this verse. Ibn Jarir says: the",
                " forbidden things by Allah as forbidden, nor",
                " regarded the things made lawful by Him",
                " as lawful.\" Abu Bakr al-Jassas gives this",
                " meaning: \"He obeys his lusts as one",
                " should obey one's God.\" Zamakhshari explains it,",
                " thus: \"He is obedient to the lusts",
                " of his self: He follows his self",
                " wherever it beckons him, as if he",
                " serves him as one should serve one's",
                " God. \" (For further explanation, scc E.N.",
                " 56 of AIFurqan, E.N. 63 of Saba,",
                " E N. 53 of Ya Sin, and",
                " E.N. 38 of Ash-Shura).",
                "*31) The words",
                " adalla hulla-hu 'ala 'ilm-in may either mean:",
                " \"The person in spite of being knowledgeable",
                " was driven astray by Allah, for he",
                " had become a slave of his lusts",
                " ;\" or \"Allah, by virtue of His",
                " knowledge that he had made his lusts",
                " his god, drove him astray.\"",
                "*32) For",
                " the commentary of letting a person go",
                " astray and setting a seal upon his",
                " heart and ears and a coveting on",
                " his eyes, scc AI-Baqarah: 7, 18, AIAn'am:25",
                " and E.N. 28, Al-A'raf: 100, At-Taubah: 87,",
                " 93, Yunus: 74 and E.N. 73, Ar-Ra'd:",
                " 27, Ibrahim: 4, 27, An-Nahl: 108, Bani",
                " Isra'il: 46, Ar-Rum; 59, Fatir: 8 and",
                " E.N.'s 16, 17, and E.N. 54 of",
                " Al-Mu'minun).",
                "*33) From the context in which",
                " this verse occurs, it becomes obvious that",
                " only those people deny the Hereafter, who",
                " want to serve their lusts and who",
                " regard belief in the Hereafter as an",
                " obstacle to their freedom. Then, once they.",
                " have denied the Hereafter, their servitude of",
                " the self goes on increasing and they",
                " go on wandering further into deviation. They",
                " commit every kind of evil without feeling",
                " any qualms; they do not hesitate to",
                " usurp the rights of others; they cannot",
                " be expected to restrain themselves when there",
                " is an opportunity for them to commit",
                " an excess or injustice only because of",
                " a regard for justice and truth in",
                " their hearts. The events and incidents that",
                " can serve as a warning for a",
                " man, are witnessed by them too, but",
                " they draw the wrong conclusion that whatever",
                " they are doing is right and they",
                " should do the same. No word of",
                " advice moves them; no argument, which can",
                " stop a man from evil, appeals to",
                " them; but they go on devising and",
                " furnishing more and more arguments to justify",
                " their unbridled freedom, and their minds remain",
                " day and night engaged only in devising",
                " ways and means of fulfilling their own",
                " interests and desires in every possible way",
                " instead of engaging in a good thought.",
                " This is an express proof of the",
                " fact that the denial of the Hereafter",
                " is destructive for human morals. The only",
                " thing that can restrain man within the",
                " bounds of humanity is the feeling that",
                " tnan is not irresponsible but has to",
                " render an account of his deeds before",
                " God. Being devoid of this feeling even",
                " if a person is highly Iearned, he",
                " cannot help adopting an attitude and behaviour",
                " worse than that of the animals."
            ]
        },
        {
            "id": "[45:24]",
            "verse": "And they say, \"There is not but our worldly life; we die and live, and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.",
            "description": [
                "This is, \"There is no means of",
                " knowledge by which they might have known",
                " with certainty that after this life there",
                " is no other life for Tnan, and",
                " that man's soul is not seized by",
                " the Command of God, but he dies",
                " and perishes merely in the course of",
                " time. The deniers of the Hereafter say",
                " these things not on the basis of",
                " any knowledge but on mere conjecture. The",
                " maximum that they could say scientifically is:",
                " \"We do not know whether there is",
                " any life after death or not;\" but",
                " they cannot say: \"We know that there",
                " is no other life after this life.\"",
                " Likewise, they cannot make the claim of",
                " knowing scientifically that man's soul is not",
                " seized by God's Command but he perishes",
                " after death just like a watch which",
                " suddenly stops functioning. The most they can",
                " say is just this: \"We do not",
                " know what exactly happens in either cast.\"",
                " Now the question is: When to the",
                " extent of the means of human knowledge",
                " there is an equal possibility of there",
                " being life after death or there being",
                " no life after death, and the soul's",
                " being seized by Allah's Command, or man's",
                " dying of himself in the course of",
                " time, what is the reason that these",
                " people abandon the probability of the possibility",
                " of the Hereafter and give their judgement",
                " in favour of its denial? Do they",
                " have any other reason than this that",
                " they, in fact, decide this question on",
                " the basis of their desire and not",
                " by any argument? As they do not",
                " like that there should be any life",
                " after death and death should mean total",
                " annihilation and not seizure of the soul",
                " by Allah's Command, they make their heart's",
                " desire their creed and deny the other",
                " probability.\""
            ]
        },
        {
            "id": "[45:25]",
            "verse": "And when Our verses are recited to them as clear evidences, their argument is only that they say, \"Bring [back] our forefathers, if you should be truthful.\"",
            "description": [
                "\"Our clear Revelations\": the Revelations in which",
                " strong arguments have been given for the",
                " possibility of the Hereafter and in which",
                " it has been stated that its occurrence",
                " is the demand of both wisdom and",
                " justice, and its nonoccurrence renders the whole",
                " system of the universe meaningless and absurd.",
                "",
                "*36) In other words, what they meant",
                " to say was: When somebody tells them",
                " that there is life after death, he",
                " must raise a dead person from the",
                " grave and present him before them. And",
                " if this is not done, they cannot",
                " believe that the dead would ever be",
                " raised to life once again at same",
                " time in the future, whereas nobody ever",
                " told them that the dead would be",
                " raised to life in this world as",
                " and when required separately, but what was",
                " said was: On the Day of Resurrection",
                " Allah will raise . aII human beings",
                " to life simultaneously and will subject them",
                " to accountability and punish and reward them",
                " accordingly."
            ]
        },
        {
            "id": "[45:26]",
            "verse": "Say, \"Allah causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know.\"",
            "description": [
                "This is the answer to their saying",
                " that death comes to man automatically in",
                " the course of time. It means: \"Neither",
                " you get life accidentally nor your death",
                " occurs automatically. It is God Who gives",
                " you life and it is He Who",
                " takes it away.\"",
                "*38) This is the",
                " answer to their demand: \"Bring back our",
                " forefathers if you are truthful.\" To this",
                " it has been said: \"This will not",
                " happen now separately for individuals, but a",
                " Day has been fixed for gathering all",
                " mankind together. \"",
                "*39) That is, \"It",
                " is lack of knowledge and right understanding",
                " which is the real cause of the",
                " people's denying the Hereafter; otherwise it is",
                " not its coming but its not coming",
                " which is against reason. If a person",
                " reflects rightly on the system of the",
                " universe and on his own self, he",
                " will himself realize that there can be",
                " no doubt about the coming of the",
                " Hereafter. \""
            ]
        },
        {
            "id": "[45:27]",
            "verse": "And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.",
            "description": [
                "In view of the context, this sentence",
                " by itself gives the meaning that it",
                " is not at all beyond the power",
                " of God Who is ruling over this",
                " great and marvellous universe that He should",
                " bring the human beings whom He has",
                " created in the first instance back into",
                " existence once again."
            ]
        },
        {
            "id": "[45:28]",
            "verse": "And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.",
            "description": [
                "That is, the dread and terror of",
                " the Plain of Resurrection and the awe",
                " of the Divine Court will be etch",
                " that it will break the stubbornnese of",
                " the most arrogant and boastful people, and",
                " everyone will be found fallen on his",
                " knees humbly."
            ]
        },
        {
            "id": "[45:29]",
            "verse": "This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do.\"",
            "description": [
                "The only possible way of getting a",
                " thing recorded is not by means of",
                " the pen and paper only. Man himself",
                " has discovered in this world several other",
                " forms of recording human words and actions",
                " and reproducing them exactly and accurately; and",
                " we cannot even imagine what other possibilities",
                " of it lie yet undiscovered, which man",
                " himself will discover and exploit in the",
                " future. Now, who can know how and",
                " by what means is Allah getting recorded",
                " man's every word, his every movement and",
                " action, even his hidden intentions and motives",
                " and desires and ideas, and how He",
                " will place before every man and every",
                " group and every nation his or its",
                " whole lifework accurately and exactly ?"
            ]
        },
        {
            "id": "[45:30]",
            "verse": "So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:31]",
            "verse": "But as for those who disbelieved, [it will be said], \"Were not Our verses recited to you, but you were arrogant and became a people of criminals?",
            "description": [
                "That is, \"You thought it was below",
                " your dignity to believe in Allah's Revelations",
                " and submit to them, and considered yourselves",
                " to be above subjection and servitude.\""
            ]
        },
        {
            "id": "[45:32]",
            "verse": "And when it was said, 'Indeed, the promise of Allah is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.' \"",
            "description": [
                "The people mentioned in verse 24 above",
                " were those who denied the Hereafter openly",
                " and absolutely, here those who are not",
                " sure of it although they do not",
                " deny its possibility because of conjecture. Apparently",
                " there is a vast difference between the",
                " two groups in that one of them",
                " denies the Hereafter absolutely and the other",
                " regards it as possible on the basis",
                " of conjecture. But as for the result",
                " and final end, there is no difference",
                " between them, for the moral consequences of",
                " the denial of the Hereafter and of",
                " lack of the faith in it are",
                " the same. A person whether he disbelieves",
                " in the Hereafter or lacks faith in",
                " it, will in either case be inevitably",
                " devoid of the feeling of accountability before",
                " God, and this lack of feeling will",
                " necessarily involve him in the error and",
                " deviation of thought and action. Only faith",
                " and belief in the Hereafter can keep",
                " a man on the right track in",
                " the world. In the absence of it,",
                " both doubt and denial give him a",
                " similar attitude of irresponsibility, and since this",
                " same attitude of irresponsibility is the real",
                " cause of man's being doomed in the",
                " Hereafter, therefore neither the denier of it",
                " can escape I loll nor the one",
                " who lacks faith in it."
            ]
        },
        {
            "id": "[45:33]",
            "verse": "And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.",
            "description": [
                "That is, \"There they will come to",
                " know that their ways of behaviour, their",
                " practices and manners, and their actions and",
                " pastimes, which they regarded as very good",
                " in the world were, in fact, very",
                " bad: they had committed a basic mistake",
                " in thinking that they were not answerable",
                " to anyone, and this had rendered their",
                " whale lifework fruitless and vain.\""
            ]
        },
        {
            "id": "[45:34]",
            "verse": "And it will be said, \"Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:35]",
            "verse": "That is because you took the verses of Allah in ridicule, and worldly life deluded you.\" So that Day they will not be removed from it, nor will they be asked to appease [Allah].",
            "description": [
                "This last sentence depicts the manner of",
                " a master who after rebuking some of",
                " his servants turns to others and says:",
                " \"Well, these wretched people now deserve such",
                " and such punishment!\""
            ]
        },
        {
            "id": "[45:36]",
            "verse": "Then, to Allah belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.",
            "description": [
                ""
            ]
        },
        {
            "id": "[45:37]",
            "verse": "And to Him belongs [all] grandeur within the heavens and the earth, and He is the Exalted in Might, the Wise.",
            "description": [
                ""
            ]
        }
    ]
}