{
    "name": "Al-Ahqaaf",
    "id": 46,
    "verse-count": 35,
    "verse-info": [
        {
            "verse-id": "[46:1]",
            "verse": "Ha, Meem.",
            "description": [
                "For explanation, sec E. N. 1 of",
                " Surah Az-Zumar, E. N. 1 of AI-Jathiyah",
                " and also E. N. 1 of As-Sajdah",
                " for understanding the true spirit of this",
                " introduction."
            ]
        },
        {
            "verse-id": "[46:2]",
            "verse": "The revelation of the Book is from Allah, the Exalted in Might, the Wise.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:3]",
            "verse": "We did not create the heavens and earth and what is between them except in truth and [for] a specified term. But those who disbelieve, from that of which they are warned, are turning away.",
            "description": [
                "For explanation, ace Al-An'am: 73, Yunus: 5-6,",
                " Ibrahim: 19, Al-Hijr: 85, An-Nahl: 3, AI-Anbiya,:",
                " 16-18. Al-Mu'minun: 115, AI-`Ankabut: 44, ArRum: 8",
                " and the corresponding E.N.'s.",
                "*3) That is,",
                " \"The actual fact is that this universe",
                " is not a purposeless plaything but a",
                " purposeful, wise system in which the decisions",
                " regarding the good and the bad, the",
                " oppressor and the oppressed, will necessarily be",
                " based on justice; and the present system",
                " of the universe is not permanent and",
                " eternal, but it has a fixed term",
                " appointed for it on the expiry of",
                " which it will inevitably come to an",
                " end. For the Court of Allah also",
                " there is a settled time and it",
                " will certainly be established when the time",
                " for it reaches its term. But the",
                " people who have refused to believe in",
                " Allah's Prophet and His Book, have an",
                " aversion to these truths. They are least",
                " mindful of this that a time has",
                " to come when they will have to",
                " render an account of their deeds. They",
                " think that the Messenger of Allah has",
                " done them a great wrong by warning",
                " them of these truths, whereas he has",
                " done them a great good by fore-warning",
                " them not only of the time when",
                " they will be subjected to accountability but",
                " also of what they will be questioned",
                " at that time so that they 'may",
                " prepare themselves accordingly.\"",
                "To understand the following",
                " discourse it should be borne in mind",
                " that man's basic error is the one",
                " that he commits with regard to determining",
                " his belief about God. In this regard,",
                " the adoption of a creed carelessly on",
                " the basis of mere hearsay, without any",
                " serious and deep thought and investigation, is",
                " a stupendous folly, which vitiates man's whole",
                " attitude to life in the world and",
                " ruins his destiny for ever afterwards. But",
                " the reason why man becomes involved in",
                " this dangerous kind of heedlessness is that",
                " he regards himself as irresponsible and un-answerable",
                " and develops the misunderstanding that whatever creed",
                " he may adopt about God, it would",
                " make no difference, because either there is",
                " no life after death in which he",
                " might have to face accountability, or if",
                " there is any such life and he",
                " is also called to account, the beings",
                " of whom he is a devotee, will",
                " save him from any evil fate. This",
                " same lack of the sense of responsibility",
                " renders him frivolous in the selection of",
                " a religious creed, and on the basis",
                " of the same he fabricates all sorts",
                " of absurd creeds, from atheism to every",
                " form of polytheism, or adopts the creeds",
                " fabricated by others."
            ]
        },
        {
            "verse-id": "[46:4]",
            "verse": "Say, [O Muhammad], \"Have you considered that which you invoke besides Allah? Show me what they have created of the earth; or did they have partnership in [creation of] the heavens? Bring me a scripture [revealed] before this or a [remaining] trace of knowledge, if you should be truthful.\"",
            "description": [
                "As the addresses are a polytheistic people",
                " they are being told the reality of",
                " the irrational crced in which they persisted",
                " carelessly due to lack of the sense",
                " of responsibility. Along with acknowledging Allah as",
                " the Creator of the universe they had",
                " made many other beings their deities: they",
                " invoked them, regarded them as fulfillers of",
                " their needs and removers of hardships: prostrated",
                " themselves and made offerings before them, and",
                " thought they had the powers of making",
                " and unmaking of heir destinies. About the",
                " same beings, they are being asked: \"On",
                " what basis have you made them your",
                " deities ?\" Obviously, there can be only",
                " two bases for regarding someone as an",
                " associate in worship along with Allah: either",
                " man himself should know through some means",
                " of knowledge that his deity too has",
                " a share in making the earth and",
                " heavens, or Allah Himself may have stated",
                " that soand-so also is His associate in",
                " the functions of Godhead. Now, if a",
                " polytheist can neither make the claim that",
                " he possesses direct knowledge of his deity's",
                " being an associate of God, nor he",
                " can show in a Book sent by",
                " God that God Himself has appointed somebody",
                " as His associate, his creed would inevitably",
                " be baseless.",
                "In this verse, \"a Book",
                " revealed before this\" implies a Book sent",
                " by Allah before the Qur'an, and \"some",
                " remnant\" of knowledge implies some part of",
                " the teachings of the Prophets and righteous",
                " men of the ancient times, which may",
                " have reached the later generations reliably. There",
                " is no tinge of shirk in whatever",
                " man has received through these two means.",
                " All the heavenly Books unanimously present the",
                " same Tauhid to which the Qur'an invites",
                " the people, and no existing remnant of",
                " the ancient lore bears evidence to this",
                " that some Prophet or saint or righteous",
                " man might have taught the people to",
                " serve and worship any other than God.",
                " Even if we do not take a",
                " Book to mean a Divine Book and",
                " remnant of knowledge the knowledge bequeathed by",
                " the Prophets and righteous men, no authentic",
                " book or the research made by a",
                " scholar of religious or secular lore has",
                " pointed out that such and such a",
                " thing in the earth or the heavens",
                " has been created by such and such",
                " a saint or god, or a certain",
                " blessing of the-blessings of life which man",
                " 'is benefiting from in the universe has",
                " been created by such and such a",
                " deity instead of God."
            ]
        },
        {
            "verse-id": "[46:5]",
            "verse": "And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware.",
            "description": [
                "\"Cannot answer him\": Cannot answer the supplications",
                " of any one. That is, these gods",
                " do not possess the powers by virtue",
                " of which they could give decisions on",
                " the prayers and petitions of their devotees.",
                " (For further explanation, see E.N. 33 of",
                " Az-Zumar). \"Till the Day of Resurrection\" means",
                " that as long as the world lasts",
                " they will get no answer to their",
                " supplications and prayers from their deities, but",
                " when Resurrection will have taken place, the",
                " deities will turn hostile to their worshippers",
                " themselves, as becomes explicit from the next",
                " verse.",
                "*6) That is, \"they do not",
                " even hear the supplications of the supplicants,",
                " neither through their own ears nor through",
                " any other means. \" This thing can",
                " be elaborated like this: The being whom",
                " the polytheists the world over have been",
                " invoking are divided into three categories: (1)",
                " Lifeless and inanimate creation; (2) the pious",
                " men who have passed away; and (3)",
                " the wicked men who had themselves gone",
                " astray, and who misled others and passed",
                " away. As for the first category of",
                " the deities they will naturally remain unaware",
                " of the supplications of their worshippers. As",
                " for the deities of the second kind,",
                " who were favourites with their God, there",
                " arc two reasons of their remaining unaware:",
                " (a) They are in the presence of",
                " AIIah in a state where human voices",
                " cannot reach them directly; and (b) even",
                " Allah and His angels do not inform",
                " them that the people whom they had",
                " been teaching to invoke Allah alone in",
                " the world, were invoking them instead, for",
                " no information could cause them a greater",
                " shock than this, and Allah does not",
                " at alI like to vex the souls",
                " of His righteous servants. Now if we",
                " consider the case of the third kind",
                " of the deities, we shall sec that",
                " there are two reasons also of their",
                " remaining unaware: (a) That they have been",
                " placed in confinement as the accused, and",
                " no voice from the world can reach",
                " them; and (b) that even Allah and",
                " His angels do not convey to them",
                " the news that their mission is flourishing",
                " in the world, and the people have",
                " set them up as deities, for this",
                " news would be a happy news for",
                " them, and Allah does not like to",
                " make the wicked people happy.",
                "In this",
                " connection, one should also understand that Allah",
                " conveys to His righteous servants the greetings",
                " of peace and prayers of mercy from",
                " the people of the world, for these",
                " things arc a source of joy and",
                " pleasure for them; likewise, He informs the",
                " culprits of the curses, censures and condemnations",
                " of the people of the world, as",
                " the disbelievers killed in the Battle of",
                " Badr were made to hear the curse",
                " of the Holy Prophet according to a",
                " Hadith, for it is a cause of",
                " anguish for them. But anything which might",
                " cause distress to the righteous people and",
                " joy to the culprits is not conveyed",
                " to them. This explanation makes the truth",
                " about the,. question of hearing by the",
                " dead plain and easy to understand."
            ]
        },
        {
            "verse-id": "[46:6]",
            "verse": "And when the people are gathered [that Day], they [who were invoked] will be enemies to them, and they will be deniers of their worship.",
            "description": [
                "That is, they will say: 'We had",
                " neither told the people to invoke us",
                " for help, nor are we aware that",
                " they used to invoke us. They themselves",
                " had presumed that we could fulfil their",
                " needs and so had started invoking us.\"",
                ""
            ]
        },
        {
            "verse-id": "[46:7]",
            "verse": "And when Our verses are recited to them as clear evidences, those who disbelieve say of the truth when it has come to them, \"This is obvious magic.\"",
            "description": [
                "It means: When the Revelations of the",
                " Qur'an were recited before the disbelievers of",
                " Makkah, they realized that the Qur'an was",
                " far superior to human speech. The compositions",
                " of their greatest poets, orators and literary",
                " men were no match with the un-paralleled",
                " eloquence, enchanting oratory, sublime themes and heart-moving",
                " style of the Qur'an. Above all, even",
                " the Holy Prophet's own words and speech",
                " were not comparable with the discourses that",
                " were being sent down to him by",
                " God. Those who had known him since",
                " childhood knew full well the vast difference",
                " that was there between his language and",
                " words and the words of the Qur'an,",
                " and it was not possible for them",
                " to believe that a man who had",
                " been living day and night among them",
                " for forty years would suddenly one day",
                " forge a speech .whose diction and style",
                " would bear no resemblance with his familiar",
                " and known manner of speech and style.",
                " This thing trade the truth plain before",
                " them, but since they were bent upon",
                " denial, they would say: \"This is plain",
                " magic,\" instead of acknowledging it as Divine",
                " Word after witnessing this manifest Sign. (They",
                " regarded the Qur'an as magic from another",
                " aspect also, which we have explained in",
                " our commentary of Al-Anbiya' :3 and E:.N.",
                " 5 of Surah Suad)."
            ]
        },
        {
            "verse-id": "[46:8]",
            "verse": "Or do they say, \"He has invented it?\" Say, \"If I have invented it, you will not possess for me [the power of protection] from Allah at all. He is most knowing of that in which you are involved. Sufficient is He as Witness between me and you, and He is the Forgiving the Merciful.\"",
            "description": [
                "This interrogative tone expresses great surprise and",
                " amazement. It means to say: \"Are these",
                " people so shameless that they accuse Muhammad",
                " (upon whom be Allah's peace) of fabricating",
                " the Qur'an himself? Whereas they know that",
                " it cannot be his word; and their",
                " calling it magic is by itself an",
                " express proof that they regard it as",
                " an extraordinary word, which cannot be of",
                " human composition even according to themselves.\"",
                "*10)",
                " As it was quite evident that their",
                " accusation was baseless and motivated by stubbornness,",
                " there was no need to present arguments",
                " to refute it. Therefore, only this much",
                " was regarded as a sufficient response: 'If",
                " I have really fabricated something and committed",
                " a grave crime by imputing it to",
                " Allah, as you accuse me of, you",
                " will not be able to rescue me",
                " from Allah's punishment. But if it is",
                " really Allah's Word, and you are rejecting",
                " it by bringing false accusations, Allah Himself",
                " will deal with you. For the reality",
                " is not hidden from Allah, and He",
                " is sufficient to decide between the truth",
                " and falsehood. If the whole world calls",
                " some one a liar, although he is",
                " truthful in Allah's knowledge, the final decision",
                " will be in his favour. On the",
                " country: if the whole world regards some",
                " one as truthful though he is a",
                " liar in the knowledge of AIIah, he",
                " will be regarded as a liar in",
                " the final judgement. Therefore, do not confuse",
                " things but pay heed to your final",
                " end.\"",
                "*11) Here, this sentence gives two",
                " meanings: (1) \"It is in fact Allah's",
                " mercy and His forbearance that these people",
                " arc surviving in the world, although they",
                " have no hesitation in declaring Allah's Word",
                " as falsehood; otherwise if a merciless and",
                " cruel god had been the master of",
                " this universe, he would not have allowed",
                " such insolent people to live even for",
                " a moment in the world. \" (2)",
                " \"O unjust people, if you give up",
                " your stubbornness even now, the door of",
                " God's mercy is still open for you,",
                " and whatever misdeeds you may have committed",
                " heretofore can be forgiven.\""
            ]
        },
        {
            "verse-id": "[46:9]",
            "verse": "Say, \"I am not something original among the messengers, nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am not but a clear warner.\"",
            "description": [
                "Its background is this: When the Holy",
                " Prophet presented himself as Allah's Messenger, the",
                " people of Makkah raised different kinds of",
                " objections against it. They said: \"what kind",
                " of a Messenger he is who has",
                " a family, who moves about in the",
                " streets, eats and drinks and lives a",
                " common man's life. There is nothing special",
                " about him, which might distinguish him above",
                " the other people and therefore we may",
                " know that Allah has specially made this",
                " man His Messenger. \" Then they said:",
                " \"Had he ban appointed a Messenger by",
                " God, He would have sent an angel",
                " as an attendant with him who would",
                " have announced that he was God's Messenger,",
                " and would have punished with a scourge",
                " every such person who had behaved insolently",
                " Towards him. How strange that God should",
                " appoint a person as His Messenger and",
                " then should leave him alone to roam",
                " the streets of Makkah and suffer every",
                " kind of humiliation. If nothing else Allah",
                " should at Ieast have created a magnificent",
                " palace and a blooming garden for His",
                " Messenger. He should not have been left",
                " to depend on his wife's resources so",
                " that 'when they exhausted the Messenger should",
                " be forced to go without food and",
                " should not even afford a conveyance to",
                " Ta'if.\" Besides, these people demanded different kinds",
                " of miracles from him and asked news",
                " of the unseen. They thought that a",
                " person's being God's Mcsscngcr meant that he",
                " should possess supernatural powers so that mountains",
                " should move at his bidding and deserts",
                " at once turn into green fields; he",
                " should have the knowledge of the past",
                " and the future events and of everything",
                " hidden from others.",
                "An answer to the",
                " same has been given in these sentences,",
                " and each sentence contains a world of",
                " meaning.",
                "First, it is said: 'Tell them:",
                " I am not a novel Messenger. \"",
                " That is, \"My being appointed as a",
                " Messenger is not a novel event of",
                " its kind in the world so that",
                " you may have some confusion about the",
                " characteristics of a Messenger. Many Messengers have",
                " come to the world before me, and",
                " I am not any different from them.",
                " Never has a Messenger come, who did",
                " not have a family, who did not",
                " eat and drink, or who did not",
                " live a common man's life. Never has",
                " an angel descended as an attendant with",
                " a Mcsscngcr, heralding his prophethood and carrying",
                " a whip before him. Never have gardens",
                " and palaces been created for a Messenger",
                " and never has a Messenger ban spared",
                " of the hardships which I am suffering.",
                " Never has a Messenger shown a miracle",
                " by his own power, or known everything",
                " by his own knowledge. Then, how is",
                " it that you are bringing forth these",
                " strange criteria only to judge my Prophethood?\"",
                "",
                "Then it is said: Tell them also",
                " : \"I do not know what shall",
                " befall you tomorrow nor what shall befall",
                " me. I only follow that which is",
                " revealed to me.\" That is, \"I am",
                " not a knower of the unseen so",
                " that everything of the past and present",
                " and future should be known to me,",
                " and I should have the knowledge of",
                " everything in the world. Not to speak",
                " of your future, I do not even",
                " know my own future. I only know",
                " that of which I am given knowledge",
                " by revelation. More than that I have",
                " never claimed to know, nor has there",
                " ever been a Messenger in the world,",
                " who made that claim. It is not",
                " a Messenger's job to tell the whereabouts",
                " of the lost articles, or tell whether",
                " a pregnant woman will deliver a boy",
                " or a girl, or whether a sick",
                " patient will live or die.\" In conclusion,",
                " it is said: \"Say to them: I",
                " am no more than a plain warner.\"",
                " That is, \"I do not possess Divine",
                " powers so that I may show you",
                " the wonderful miracles that you demand from",
                " me every next day. My only mission",
                " is that I should present the right",
                " way before the people, and should warn",
                " of an evil end those who do",
                " not accept it. \""
            ]
        },
        {
            "verse-id": "[46:10]",
            "verse": "Say, \"Have you considered: if the Qur'an was from Allah, and you disbelieved in it while a witness from the Children of Israel has testified to something similar and believed while you were arrogant...?\" Indeed, Allah does not guide the wrongdoing people.",
            "description": [
                "This same theme has been expressed in",
                " another way in Surah Ha-Mim As-Sajdah: 62",
                " above. For explanation, see E.N. 69 of",
                " the said Surah.",
                "*14) A large number",
                " of the commentators have taken this \"witness\"",
                " to imply Hadrat 'Abdullah bin Salam, who",
                " was a famous Jewish scholar of Madinah,",
                " and who believed in the Holy Prophet",
                " after the migration. As this thing happened",
                " in Madinah, these commentators say that this",
                " verse was revealed at Madinah. This commentary",
                " is based on a statement of Hadrat",
                " Sa`d bin Abi Waqqas according to which",
                " this verse was sent down in respect",
                " of Hadrat `Abdullah bin Salam (Bukhari, Muslim,",
                " Nasa'i Ibn Jarir); and on the same",
                " basis have several major commentators like Ibn",
                " `Abbas, Mujahid, Qatadah, Dahhak, Ibn Sirin, Hasan",
                " Basri, Ibn Zaid and `Auf bin Malik",
                " al-Ashja`i accepted this commentary. But, on the",
                " other hand, 'Ikrimah and Sha`bi and Masruq",
                " say that this verse cannot be about",
                " `Abdullah bin Salam (may Allah be pleased",
                " with him) for this entire Surah was",
                " sent down at Makkah. Ibn Jarir Tabari",
                " also has preferred this view. He says:",
                " The whole previous discourse is an address",
                " directed to the pagans of Makkah and",
                " the following discourse also is directed to",
                " them. In this context it is not",
                " conceivable that a verse revealed at Madinah",
                " was inserted here. The later commentators who",
                " have accepted this second version, do not",
                " reject the tradition of Hadrat Sa'd bin",
                " Abi Waqqas, but have opined that as",
                " this verse also applies to Hadrat 'Abdullah",
                " bin Salam's affirmation of the faith, Hadrat",
                " Sa`d expressed the opinion, in the tradition",
                " of the ancients, that it was sent",
                " down with regard to him. This does",
                " not, however, mean that when he believed,",
                " it was revealed then about him only,",
                " but that this verse precisely applied to",
                " him and his acceptance of Islam.",
                "Apparently,",
                " this second view seems to be more",
                " correct and reasonable. Now. the question that",
                " remains to be answered is: Who is",
                " implied by this witness?\" Some of the",
                " commentators who have accepted the second view",
                " say that it implies the Prophet Moses",
                " (peace be upon him), but the following",
                " sentence: 'He believed white you showed arrogance\",",
                " bears no relevance to this explanation. What",
                " seems to be nearer the truth is",
                " that which the commentator Nisaburi and Ibn",
                " Kathir have stated. They say: Here, by",
                " \"a witness\" is not meant any particular",
                " person but a common Israelite.. The meaning",
                " is this; \"The teachings that the Qur'an",
                " is presenting before you are not new",
                " so that you could deny them by",
                " offering the excuse that they were novel",
                " teachings which had never been presented before",
                " man in the past. Before this these",
                " very teachings have been similarly revealed and",
                " exist with the Israclites in the form",
                " of the Torah and other scriptures, and",
                " a common Israelite has already believed in",
                " them, and also admitted that Allah's Revelation",
                " is a means of the coming down",
                " of these teachings. Therefore, you cannot make",
                " the claim that Revelation and these teachings",
                " are incomprehensible. The only thing that hinders",
                " you from believing is your arrogance and",
                " baseless conceit. \""
            ]
        },
        {
            "verse-id": "[46:11]",
            "verse": "And those who disbelieve say of those who believe, \"If it had [truly] been good, they would not have preceded us to it.\" And when they are not guided by it, they will say, \"This is an ancient falsehood.\"",
            "description": [
                "This is one of those arguments that",
                " the chiefs of the Quraish employed to",
                " beguile and mislead the common people against",
                " the Holy Prophet. They said: If the",
                " Qur'an were really based on the truth",
                " and Muhammad (upon whom be Allah's peace)",
                " were inviting towards a right thing, the",
                " chiefs and the elders and the noblemen",
                " of the community would have been in",
                " the forefront to accept it. How could",
                " it be that a few young boys",
                " and mean slaves only should accept a",
                " reasonable thing but the distinguished men of",
                " the nation, who are wise and experienced,",
                " and who have been held as reliable",
                " by others, would reject it? This was",
                " the deceptive reasoning by which they tried",
                " to make the common people believe that",
                " there was something wrong with the new",
                " message; that is why the ciders of",
                " the people were not believing it; therefore,",
                " they also should avoid it.",
                "*16) That",
                " is, \"They regard themselves as a criterion",
                " of the truth and falsehood. They think",
                " that whatever (guidance) they reject must be",
                " falsehood. But accepting them since thousands of",
                " years also were devoid of wisdom and",
                " knowledge, and the whole wisdom has now",
                " become these people's monopoly.\""
            ]
        },
        {
            "verse-id": "[46:12]",
            "verse": "And before it was the scripture of Moses to lead and as a mercy. And this is a confirming Book in an Arabic tongue to warn those who have wronged and as good tidings to the doers of good.",
            "description": [
                "\"To warn the wrongdoers :\" To warn",
                " of the evil end those who are",
                " being unjust to themselves and to the",
                " truth itself by disbelieving in Allah and",
                " serving others than Allah, and are involved",
                " because of this deviation of theirs in",
                " the evils of morals and deeds, which",
                " have filled human society with every kind",
                " of wickedness and injustice."
            ]
        },
        {
            "verse-id": "[46:13]",
            "verse": "Indeed, those who have said, \"Our Lord is Allah,\" and then remained on a right course - there will be no fear concerning them, nor will they grieve.",
            "description": [
                "For explanation, see E.N.'s 33 to 35",
                " of Ha-Mim As-Sajdah."
            ]
        },
        {
            "verse-id": "[46:14]",
            "verse": "Those are the companions of Paradise, abiding eternally therein as reward for what they used to do.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:15]",
            "verse": "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\"",
            "description": [
                "This verse tells that although the children",
                " should serve both the mother and the",
                " father, the mother's right is greater in",
                " importance, on the ground that she undergoes",
                " greater hardships for the sake of the",
                " children. The same is borne out by",
                " a Hadith, which has been related with",
                " a little variation in wording in Bukhari,",
                " Muslim, Abu Da'ud, Tirmidhi, Ibn Majah, Musnad",
                " Ahmad, and in Adab al-Mufrad of Imam",
                " Bukhari, to the effect that a person",
                " asked the Holy Prophet: \"Who has got",
                " a greater right to my service? The",
                " Holy Prophet replied: Your mother. He asked:",
                " Who after her? He replied: Your mother.",
                " He asked: Who after her? He replied:",
                " Your mother. He asked: Who after her?",
                " He replied: Your father; \" This Hadith",
                " precisely explains this verse, for in it",
                " also allusion has been made to the",
                " triple right of the mother: His mother",
                " bore him with hardship; (2) she gave",
                " him birth with hardship; and (3) his",
                " bearing and his weaning took thirty months.",
                "",
                "Another legal point also is derived from",
                " this verse and verse 14 of Surah",
                " Luqman and verse 233 of Al-Baqarah, which",
                " was pointed out by Hadrat `Ali and",
                " Hadrat Ibn 'Abbas in a law case",
                " and made Hadrat `Uthman change his decision.",
                " The story goes that during the caliphate",
                " of Hadrat `Uthman (may Allah be pleased",
                " with him) a person married a woman",
                " from the Juhainah tribe, and just six",
                " months after the marriage she gave birth",
                " to a healthy and sound child. The",
                " man took the case before Hadrat `Uthman,",
                " who declared the woman to be an",
                " adultress and ordered that she be stoned",
                " to death. On hearing this Hadrat `Ali",
                " immediately came to Hadrat `Uthman and asked:",
                " What sort of a decision have you",
                " given ? He replied: She has given",
                " birth to a sound child six months",
                " after marriage. Is it not a clear",
                " .proof of her being an adultress? Hadrat",
                " `Ali did not agree, and recited the",
                " three above mentioned verses in their sequence.",
                " In Surah Al-Baqarah Allah says: 'The mothers",
                " shall suckle their children for two whole",
                " inyears, if the fathers desire the suckling",
                " to be completed.\" In Surah Luqman it",
                " is said: \"And his weaning took two",
                " years,\" and in Surah AI-Ahqaf: \"And his",
                " bearing and his weaning took thirty months.\"",
                " Now, if two years of suckling are",
                " taken away from 30 months, six months",
                " of bearing remain. This shows that the",
                " minimum period of pregnancy in which a",
                " sound child can be born is six",
                " months. Therefore, the woman who has given",
                " birth to a child six months after",
                " the marriage cannot be declared an adultress",
                " . On hearing this reasoning of Hadrat",
                " 'Ali, Hadrat 'Uthman admitted that he had",
                " not considered that thing at all. Then",
                " he recalled the woman and changed his",
                " decision. According to another tradition, Ibn 'Abbas",
                " also supported the reasoning of Hadrat 'Ali",
                " and then Hadrat 'Uthman changed his decision.",
                " (Ibn Jarir, Ahkam al-Qur an by al-Jassas",
                " Ibn Kathir).",
                "The following legal injunctions are",
                " derived from the three verses when they",
                " are read together: The woman who gives",
                " birth to a sound and complete child",
                " in less than six months after marriage",
                " (i.e. in a proper delivery and not",
                " abortion) will be declared an adultress and",
                " her child's lineage from her husband will",
                " not be established.",
                "(2) The woman who",
                " delivers a sound and complete child six",
                " months or more after marriage, cannot be",
                " accused of adultery only on the basis",
                " of the child birth, nor can her",
                " husband have the right to slander her,",
                " nor can he refuse to acknowledge fatherhood",
                " of the child; the child will certainly",
                " be recognized as his, and the woman",
                " will not be punished.",
                "(3) The maximum",
                " period for fosterage is two years. If",
                " a woman has suckled a child after",
                " this age, she will not be regarded",
                " as his foster mother, nor will the",
                " injunctions pertaining to fosterage (An-Nisa: 23) be",
                " applicable to her. In this regard, Imam",
                " Abu Hanifah has out of caution proposed",
                " the period of two and a half",
                " years instead of two years so that",
                " there remains no chance of error in",
                " a delicate matter like the prohibition of",
                " the foster relations. (For explanation, see E",
                " N. 23 of Surah Luqman). Here, it",
                " would be useful to know that according",
                " to the latest medical research a child",
                " needs at least 28 weeks to remain",
                " in the mother's womb to be developed",
                " and delivered as a living baby. This",
                " period amounts to a little more than",
                " 6 months. The Islamic law has allowed",
                " a concession of about half a month,",
                " because a woman's being declared an adultress",
                " and a child's being deprived of lineage",
                " is a grave matter, and its gravity",
                " demands that maximum period be allowed to",
                " save both the mother and the child",
                " from its legal consequences. Furthermore, no physician",
                " and no judge, not even the pregnant",
                " woman herself and the man impregnating her,",
                " can know as to when exactly did",
                " the conception take place. This thing also",
                " demands that a few more days be",
                " allowed in determining the minimum Legal period",
                " of pregnancy.",
                "*20) That is, \"O Lord,",
                " grant me the grace of such righteous",
                " deeds as may conform to Your Law",
                " in the apparent form as well as",
                " be acceptable to You in their actual",
                " worth.\" If an action, however good in",
                " the sight of the people, does not",
                " conform to obedience to Allah's Law, it",
                " cannot have any value in the sight",
                " of AIIah, no matter how highly it",
                " is praised by the people. On the",
                " contrary, another action which conforms to the",
                " Shari 'ah exactly and has no flaw",
                " or deficiency in its apparent form, becomes",
                " hollow from within, on account of an",
                " evil intention, conceit, arrogance and greed of",
                " the world, and so worthless in the",
                " sight of Allah."
            ]
        },
        {
            "verse-id": "[46:16]",
            "verse": "Those are the ones from whom We will accept the best of what they did and overlook their misdeeds, [their being] among the companions of Paradise. [That is] the promise of truth which they had been promised.",
            "description": [
                "That is, \"Their ranks in the Hereafter",
                " will be determined by the best deeds",
                " they would have done in the world,",
                " and their lapses and weaknesses and errors",
                " will be overlooked. It is just like",
                " a generous and appreciative master who determines",
                " the worth of his loyal and obedient",
                " servant not by the petty services that",
                " he renders but by some work of",
                " merit that he might accomplish or a",
                " feat of devotion and dedication that he",
                " might perform. He will not call his",
                " servant to account for his minor shortcomings",
                " and overlook his major services.\""
            ]
        },
        {
            "verse-id": "[46:17]",
            "verse": "But one who says to his parents, \"Uff to you; do you promise me that I will be brought forth [from the earth] when generations before me have already passed on [into oblivion]?\" while they call to Allah for help [and to their son], \"Woe to you! Believe! Indeed, the promise of Allah is truth.\" But he says, \"This is not but legends of the former people\" -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:18]",
            "verse": "Those are the ones upon whom the word has come into effect, [who will be] among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
            "description": [
                "Here, two types of the character have",
                " been placed side by side and the",
                " listeners asked the silent question as to",
                " which of them is better. At that",
                " time both these types of character practically",
                " existed in the society, and it was",
                " not at aII difficult for the people",
                " to know where they could find the",
                " first type of the character and where",
                " the second. This is the answer to",
                " this saying of the chiefs of the",
                " Quraish: \"If it had been any good",
                " to believe in this Book, these few",
                " youngsters and slaves would not have believed",
                " in it before they did.\" In the",
                " light of this answer everyone could see",
                " for himself as to what was the",
                " character of the believers and what of",
                " the unbelievers."
            ]
        },
        {
            "verse-id": "[46:19]",
            "verse": "And for all there are degrees [of reward and punishment] for what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged.",
            "description": [
                "That is, \"Neither will the good deeds",
                " and sacrifices of the good people be",
                " lost, nor the evildoers awarded a greater",
                " punishment than what they will actually deserve.",
                " If a good man is deprived of",
                " his reward and receives a lesser reward",
                " than what is actually his due, it",
                " is injustice. Likewise, if an evildoer is",
                " not punished appropriately for his evil deeds,",
                " or receives a greater punishment than deserved,",
                " it is also injustice. \""
            ]
        },
        {
            "verse-id": "[46:20]",
            "verse": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient.\"",
            "description": [
                "\"A torment of disgrace\", because of the",
                " arrogance that they showed. They thought they",
                " were big people and it was below",
                " their dignity to believe in the Messenger",
                " and join the group of the poor",
                " and indigent believers. They were involved in",
                " the false pride that if the big",
                " people like them would believe in a",
                " thing which a few slaves and poor",
                " men had believed in, they would incur",
                " infamy. That is why AIIah will disgrace",
                " them in the Hereafter and will destroy",
                " their pride."
            ]
        },
        {
            "verse-id": "[46:21]",
            "verse": "And mention, [O Muhammad], the brother of 'Aad, when he warned his people in the [region of] al-Ahqaf - and warners had already passed on before him and after him - [saying], \"Do not worship except Allah. Indeed, I fear for you the punishment of a terrible day.\"",
            "description": [
                "As the chiefs of the Quraish had",
                " a false pride of their superiority and",
                " exulted in their wealth and prosperity, the",
                " story of `Ad is being related to",
                " them about whom it was well known",
                " that they had been the mightiest people",
                " in Arabia.",
                "Literally, Ahqaf (pl. of hiqf)",
                " are long dunes of sand less in",
                " height than mountains, but technically it is",
                " a name given to the southern-western part",
                " of the Arabian desert (Ar-Rub'ul-khali) which is",
                " wholly un-inhabited. Please see the map on",
                " page 672.",
                "Ibn Ishaq says that the",
                " territory of 'Ad extended from 'Oman to",
                " Yaman, and the Qur'an tells us that",
                " they actually belonged to Al-Ahqaf from where",
                " they spread to the adjoining lands and",
                " subdued weak nations. 125 miles to the",
                " north of the present-day city of Makkah",
                " there is a place in Hadramaut, where",
                " the people have built a tomb to",
                " the Prophet Hud, and the place is",
                " well known as the Grave of Hud.",
                " A religious festival is held there on",
                " the 15th of Sha'ban and thousands of",
                " people from different parts of Arabia gather",
                " there annually. Although it is not historically",
                " established, the grave's being built there and",
                " the southern Arabs' visiting it in large",
                " numbers is at least a proof that",
                " local tradition regards this very territory as",
                " the land of `Ad. Besides, there are",
                " several nuns in Hadramaut which the natives",
                " still call by the name of Dar-'Ad",
                " (Abode of 'Ad).",
                "From the present condition",
                " of Al-Ahqaf no one can even imagine",
                " that this land might have been the",
                " home of a mighty people boasting of",
                " magnificent civilization. Probably it was a green",
                " and fertile land thousands of years ago,",
                " and then the change of climate might",
                " have turned it into a sandy desert.",
                " Today it is a vast, wind-swept desert,",
                " and no one can dare go into",
                " its interior. In 1843 A.D. a Bavarian",
                " soldier was able to reach its southern",
                " edge. He says that if one looks",
                " down from the northern plateau of Hadramaut",
                " one can see this desert about a",
                " thousand feet in the depression. Here and",
                " there in it there are white areas",
                " where if a thing falls it goes",
                " on sinking into the sand and decays.",
                " The Arab Beduins fear this land and",
                " arc never willing to step into it",
                " at any cost. Once when the Bedouins",
                " were not ready to take him there,",
                " he went by himself. He says that",
                " the sand there is very fine powder,",
                " and when he threw a plummet into",
                " it from a distance, it sank into",
                " it within five minutes and the end",
                " of the line to which it was",
                " attached, also decayed.",
                "For detailed information, sec:",
                "",
                "Arabia and The Isles, Harold Ingrams, London,",
                " 1946.",
                "The Unveiling of Arabia, R H.",
                " Kirnan, London, 1937.",
                "The Empty Quarter. Philby.",
                " London, 1933."
            ]
        },
        {
            "verse-id": "[46:22]",
            "verse": "They said, \"Have you come to delude us away from our gods? Then bring us what you promise us, if you should be of the truthful.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:23]",
            "verse": "He said, \"Knowledge [of its time] is only with Allah, and I convey to you that with which I was sent; but I see you [to be] a people behaving ignorantly.\"",
            "description": [
                "That is, \"Allah alone knows as to",
                " when the torment will descend on you",
                " and for how long you will be",
                " granted respite.\"",
                "*27) That is, \"You are",
                " taking my warning as a joke in",
                " your ignorance and are demanding the torment",
                " for fun. You have no idea of",
                " how dreadful is God's torment and how",
                " near at hand it might have approached",
                " because of your misdeeds. \""
            ]
        },
        {
            "verse-id": "[46:24]",
            "verse": "And when they saw it as a cloud approaching their valleys, they said, \"This is a cloud bringing us rain!\" Rather, it is that for which you were impatient: a wind, within it a painful punishment,",
            "description": [
                "Here, there is no indication as to",
                " who gave them this answer. However, the",
                " style shows explicitly that this was the",
                " answer they were given by the existing",
                " conditions. They thought it was a cloud",
                " which was coming to give rain to",
                " their valleys, but in reality it was",
                " a windstorm that was coming on to",
                " completely exterminate them."
            ]
        },
        {
            "verse-id": "[46:25]",
            "verse": "Destroying everything by command of its Lord. And they became so that nothing was seen [of them] except their dwellings. Thus do We recompense the criminal people.",
            "description": [
                "For the details of the story of",
                " 'Ad, see AI-A'raf: 65-72, Hud: 50-60, AI-Mu'minun:",
                " 31-41. Ash-Shu'ara: 123-140, AI-'Ankabut: 40, Iii-Mim AsSajdah:",
                " 15-16 and the corresponding E.N.'s."
            ]
        },
        {
            "verse-id": "[46:26]",
            "verse": "And We had certainly established them in such as We have not established you, and We made for them hearing and vision and hearts. But their hearing and vision and hearts availed them not from anything [of the punishment] when they were [continually] rejecting the signs of Allah; and they were enveloped by what they used to ridicule.",
            "description": [
                "That is, \"You are no match for",
                " them as far as wealth, power, authority",
                " and other things are concerned: your sphere",
                " of authority is restricted to the bounds",
                " of the city of Makkah, but they",
                " had dominated a large part of the",
                " earth. \"",
                "*31) An important truth has",
                " been stated in this brief sentence. It",
                " is only the Revelations of Allah which",
                " give the right knowledge and understanding of",
                " the truth and reality to man. If",
                " man has this understanding and knowledge he",
                " sees the right thing with his eyes,",
                " hears the right thing with his ears,",
                " thinks the right thing with his mind",
                " and intellect and takes the right decisions.",
                " But when he refuses to believe in",
                " the Revelations of Allah, he fails to",
                " see the truth in spite of the",
                " eyes, becomes deaf to every word of",
                " admonition in spite of the ears, and",
                " misuses the blessings of the mind and",
                " intellect that God has granted him, and",
                " goes on drawing wrong conclusions one after",
                " the other; so much so that he",
                " starts 'sing aII his capabilities for his",
                " own destruction."
            ]
        },
        {
            "verse-id": "[46:27]",
            "verse": "And We have already destroyed what surrounds you of [those] cities, and We have diversified the signs [or verses] that perhaps they might return [from disbelief].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:28]",
            "verse": "Then why did those they took besides Allah as deities by which to approach [Him] not aid them? But they had strayed from them. And that was their falsehood and what they were inventing.",
            "description": [
                "That is, \"They had put faith in",
                " those things in the beginning with the",
                " idea that they were favourite servants of",
                " God and through them they would attain",
                " nearness to Him, but then gradually they",
                " made them their gods. They started invoking",
                " them for help; they formed the belief",
                " that they had the powers to change",
                " their destinies and could answer their prayers",
                " and remove their hardships.\" To deliver them",
                " from this error Allah sent His Revelations",
                " through His Messengers over and over again",
                " in different ways to bring them to",
                " the right path, but they persisted m",
                " the worship of their gods, and continued",
                " to insist that they would still invoke",
                " them instead of Allah. Now consider this:",
                " When the torment of Allah visited these",
                " polytheists because of their deviation, where had",
                " their redressers of grievances and removers of",
                " hardships disappeared? Why didn't they come to",
                " their rescue at the time of affliction?",
                ""
            ]
        },
        {
            "verse-id": "[46:29]",
            "verse": "And [mention, O Muhammad], when We directed to you a few of the jinn, listening to the Qur'an. And when they attended it, they said, \"Listen quietly.\" And when it was concluded, they went back to their people as warners.",
            "description": [
                "The traditions that have been related from",
                " Hadrat `Abdullah bin Mas'ud, Hadrat Zubair, Hadrat",
                " 'Abdullah bin 'Abbas, Hasan Basri, Said bin",
                " Jubair, Zarr bin Hubaish, Mujahid, 'ikrimah and",
                " others in connection with the commentary of",
                " this verse concur that this incident of",
                " the first visit of the jinns, which",
                " has been mentioned in this verse, had",
                " occurred in the valley of Nakhlah. And",
                " according to Ibn Ishaq, Abu Nu`aim Isfahaini",
                " and Waqidi, this incident occurred during the",
                " Holy Prophet's return journey from Ta'if to",
                " Makkah. On the way, when he halted",
                " at Nakhlah, and was reciting the Qur'an",
                " in the 'Isha' or the Fajr or",
                " the Tahajjud Prayer, a group of the",
                " jinns happened to pass by and stopped",
                " to listen to him. In this connection,",
                " all the traditions agree that on this",
                " occasion the jinns did not appear before",
                " the Holy Prophet, nor did he feel",
                " their presence, but AIIah informed him afterwards",
                " by revelation that they had come and",
                " listened to the Qur'anic recitation.",
                "The place",
                " where this incident took place was either",
                " Az-Zaimah or AsSayl-ul-Kabir, for both these places",
                " are situated in the valley of Nakhlah",
                " and at both water is available and",
                " are green; if the travellers from Ta'if",
                " have to halt in this valley, they",
                " can halt at either of the places.",
                " Please see the map for the location",
                " of these places."
            ]
        },
        {
            "verse-id": "[46:30]",
            "verse": "They said, \"O our people, indeed we have heard a [recited] Book revealed after Moses confirming what was before it which guides to the truth and to a straight path.",
            "description": [
                "This shows that these jinns had already",
                " had faith in the Prophet Moses and",
                " in the Divine Books. After hearing the",
                " Qur'an they felt that it gave the",
                " same teachings as the former Prophets had",
                " been preaching. Therefore, they believed in this",
                " Book forthwith and also in the Holy",
                " prophet who had brought it."
            ]
        },
        {
            "verse-id": "[46:31]",
            "verse": "O our people, respond to the Messenger of Allah and believe in him; Allah will forgive for you your sins and protect you from a painful punishment.",
            "description": [
                "Authentic traditions show that after this several",
                " deputations of the jinns visited the Holy",
                " Prophet, one after the other, and met",
                " him face to face. When all the",
                " traditions related in the collections of Hadith",
                " on this subject are read together, it",
                " appears that at least six deputations had",
                " visited him in Makkah before the Hijrah.",
                "",
                "About one of these deputations Hadrat 'Abdullah",
                " bin Mas'ud relates: 'One day the Holy",
                " Prophet remained missing from Makkah for the",
                " whole night. We could not know his",
                " whereabouts and feared he might have been",
                " attacked by somebody. Early in the morning",
                " we saw him coming from the direction",
                " of Hira'. On enquiring he said that",
                " a jinn had come to invite him",
                " and he had accompanied him and recited",
                " the Qur'an to a gathering of them",
                " there.\" (Muslim, Musnad Ahmad, Tirmidhi, Abu Da'ud).",
                "",
                "Hadrat 'Abdullah bin Mas'ud has related another",
                " tradition, saying: \"Once the Holy Prophet asked",
                " his Companions in Makkah as to which",
                " of them would accompany him that night",
                " to meet the jinns. I became ready",
                " to go with him. At a place",
                " in the upper quarters of Makkah the",
                " Holy Prophet drew a line and told",
                " me not to cross it. Then he",
                " went forward and stood and began to",
                " recite the Qur'an. I saw that a",
                " number of the people had gathered around",
                " him and they stood between me and",
                " him.\"' (Ibn Jarir, Baihaqi: Dala`il an-Nubuwwat, Abu",
                " Nu`aim Isfahani: Dale Il an-Nubuwuat).",
                "On another",
                " occasion also during the night Hadrat `Abdullah",
                " bin Mas'ud was with the Holy Prophet",
                " and he decided a case of the",
                " jinns at Hajun in Makkah. Many years",
                " later Ibn Mas'ud saw a group of",
                " the villagers at Kufa and said that",
                " the group of the jinns he had",
                " seen at Hajun closely resembled those people.",
                " (Ibn Jarir)."
            ]
        },
        {
            "verse-id": "[46:32]",
            "verse": "But he who does not respond to the Caller of Allah will not cause failure [to Him] upon earth, and he will not have besides Him any protectors. Those are in manifest error.\"",
            "description": [
                "This sentence might also be a part",
                " of the saying of the jinns, or",
                " it might be an addition by Allah",
                " to their saying. In view of the",
                " context the second view seems to be",
                " more reasonable."
            ]
        },
        {
            "verse-id": "[46:33]",
            "verse": "Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:34]",
            "verse": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will say, \"Then taste the punishment because you used to disbelieve.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[46:35]",
            "verse": "So be patient, [O Muhammad], as were those of determination among the messengers and do not be impatient for them. It will be - on the Day they see that which they are promised - as though they had not remained [in the world] except an hour of a day. [This is] notification. And will [any] be destroyed except the defiantly disobedient people?",
            "description": [
                "That is, \"Just as the Prophets before",
                " you went on enduring with patience and",
                " ceaseless struggle the indifference, opposition, resistance and",
                " persecutions of their people for years on",
                " end, so should you also do the",
                " same, and do not entertain the idea",
                " that either the people should believe in",
                " you immediately or. if they do not",
                " believe, Allah should visit them with His",
                " torment \""
            ]
        }
    ]
}