{
    "name": "Al-Fath",
    "verse-count": 29,
    "verse-info": [
        {
            "id": "[48:1]",
            "verse": "Indeed, We have given you, [O Muhammad], a clear conquest",
            "description": [
                "When after the treaty of Hudaibiyah this",
                " good news of the victory was announced,",
                " the people wondered as to how the",
                " treaty could be called a victory. The",
                " Muslims did believe in this Divine Revelation",
                " as true on the basis of their",
                " Faith, but no one could understand what",
                " aspect of the victory it had. On",
                " hearing this verse, Hadrat 'Umar asked: \"Is",
                " it a victory, O Messenger of Allah?\"",
                " The Holy Prophet replied: \"Yes.\" (lbn Jarir)",
                " Another Companion came before the Holy Prophet",
                " and he also put the same question;",
                " whereupon the Holy Prophet replied: \"By Him",
                " in Whose hand is the life of",
                " Muhammad, this indeed is a victory.\" (Musnad",
                " Ahmad, Abu Da'ud) On arriving at Madinah",
                " still another person said to his companions:",
                " \"What sort of a victory is it?",
                " We were debarred from the House of",
                " Allah; our sacrificial camels also could not",
                " go to their right places; the Holy",
                " Messenger of Allah had to halt at",
                " Hudaibiyah, and in consequence of this truce",
                " two of our oppressed brothers (Abu Jandal",
                " and Abu Basir) were handed over to",
                " their oppressors.\" When this thing reached the",
                " Holy Prophet, he said; \"A vary wrong",
                " thing has been uttered: it indeed is",
                " a great victory. You reached the very",
                " home of the polytheists, and they had",
                " to persuade you to go back by",
                " soliciting you to perform 'Umrah the following",
                " year; they themselves expressed the desire to",
                " suspend hostilities and have peace with you,",
                " whereas-their malice and enmity against you is",
                " too well-known. Allah has granted you the",
                " upper hand over them. Have you forgotten",
                " the day when you were fleeing from",
                " Uhud and I was calling you back",
                " from behind? Have you forgotten the day",
                " when the enemy had descended on us",
                " from every side in the Battle of",
                " the Trench and the hearts were coming",
                " up to the throats?\" (Baihaqi on the",
                " authority of 'Urwah bin Zubair) . But",
                " not long after this the truce's being",
                " a victory began to become manifest, and",
                " everyone realized that the triumph of Islam",
                " had begun with the treaty of Hudaibiyah.",
                " Almost one and the same thing has",
                " been related from Hadrat 'Abdullah bin Mas'ud,",
                " Hadrat Jabir bin `Abdullah and Hadrat Bara'",
                " bin 'Azib. They are reported to have",
                " said: \"The people look upon the Conquest",
                " of Makkah as the victory, but we",
                " regard the truce of Hudaibiyah as the",
                " real victory.\" (Bukhari, Muslim, Musnad Ahmad, Ibn",
                " Jarir)."
            ]
        },
        {
            "id": "[48:2]",
            "verse": "That Allah may forgive for you what preceded of your sin and what will follow and complete His favor upon you and guide you to a straight path",
            "description": [
                "If the context in which this sentence",
                " occurs is kept in view, one will",
                " certainly feel that the faults referred to",
                " here imply those shortcomings and weaknesses that",
                " had remained in the struggle that the",
                " Muslims had been making for the success",
                " and victory of Islam, under the leadership",
                " of the Holy Prophet, for the past",
                " nineteen years or so. These shortcomings are",
                " not known to any one because the",
                " intellect is absolutely helpless to find out",
                " any weakness in that struggle. But according",
                " to the highest standards of perfection in",
                " the sight of Allah there had remained",
                " some such weakness in it because of",
                " which the Muslims could not attain a",
                " decisive victory so soon over the pagans",
                " of Arabia. What AIlah means to say",
                " is this: 'If you had carried on",
                " your struggle along with those weaknesses, it",
                " would have taken you much longer to",
                " subdue Arabia, but We have overlooked all",
                " those weaknesses and shortcomings and compensated for",
                " them only through Our grace, and opened",
                " for you at Hudaibiyah the door to",
                " victory and conquest which you could not",
                " have achieved only by your ordinary endeavors\"",
                " . Here, this thing also should be",
                " understood well that for the weaknesses that",
                " might occur and remain in the struggle",
                " and endeavor that a group might be",
                " making for an object, the leader and",
                " guide of the group only is addressed.",
                " This does not mean that the weaknesses",
                " are the leader's personal weaknesses. Those are,",
                " in fact, the weaknesses of the struggle",
                " that the group is making as a",
                " whole; but the address is made to",
                " the leader to tell him that his",
                " work suffers from such and such a",
                " weakness. However, as the address is directed",
                " to the Holy Prophet and declared that",
                " AIIah has forgiven him all his former",
                " and latter faults, the general words also",
                " give this meaning that Allah pardoned all",
                " the shortcomings (which were the shortcomings in",
                " view of his high position) of His",
                " Holy Messenger. That is why when the",
                " Companions saw that he took extraordinary pains",
                " over his worship, they would say: `Why",
                " do you subject yourself to such hardships",
                " when alI your former and latter errors",
                " and shortcomings have been pardoned ?\" the",
                " Holy Prophet would reply: \"Should I not",
                " behave as a grateful servant ?\" (Ahmad,",
                " Bukhari, Muslim, Abu Da'ud).",
                "*3) \"Perfection of",
                " his blessings\" implies that the Muslims should",
                " become wholly free to live their lives",
                " in accordance with Islamic civilization, Islamic law",
                " and commandments, secure from every fear, every",
                " resistance and every external interference, and they",
                " should also be blessed with the power",
                " that they may uphold Allah's Word throughout",
                " the world. Dominance of disbelief and wickedness",
                " which may be a hindrance in the",
                " way of Allah's worship and an obstacle",
                " in the struggle in propagating Allah's Word,",
                " is the greatest calamity for the believers;",
                " the Qur'an calls it 'fitnah \" (mischief).",
                " Delivered and freed from this calamity when",
                " they arc able to achieve an abode",
                " of Islam (dare/-Islam) in which the Divine",
                " Religion is enforced in its entirety, and",
                " along with that they are also provided",
                " with the means and resources by which",
                " they may establish faith and righteousness on",
                " Allah's earth in place of disbelief and",
                " wickedness, this would be the perfection of",
                " Allah's blessing on them. As this blessing",
                " was achieved by the Muslims only through",
                " the Holy Prophet, AIIah addressed only him",
                " and said: \"We willed to complete Our",
                " blessing on you; therefore we have granted",
                " this victory to you.\"",
                "*4) 'The right",
                " way\": the way to conquest and success.",
                " In other words, it implies that by",
                " causing the treaty to be concluded at",
                " Hudaibiyah AIIah paved the way for and",
                " inspired the Holy Prophet with the plan",
                " by which he could subdue aII the",
                " forces that were resisting Islam."
            ]
        },
        {
            "id": "[48:3]",
            "verse": "And [that] Allah may aid you with a mighty victory.",
            "description": [
                "Another translation can be: \"Bestow on you",
                " an unprecedented victory,\" for the word aziz",
                " in the original may mean mighty as",
                " well as unprecedented and unparalleled. According to",
                " the first meaning, the sentence means: \"By",
                " means of this treaty AIIah has helped",
                " you in a way as to make",
                " your enemies helpless\"; and according to the",
                " second, it means: \"Seldom has this novel",
                " method ever been adopted to help somebody,",
                " that a thing which apparently is a",
                " mere peace treaty, and that too a",
                " treaty concluded from a weak position, would",
                " turn into a decisive victory.\""
            ]
        },
        {
            "id": "[48:4]",
            "verse": "It is He who sent down tranquillity into the hearts of the believers that they would increase in faith along with their [present] faith. And to Allah belong the soldiers of the heavens and the earth, and ever is Allah Knowing and Wise.",
            "description": [
                "\"Sakinat\" in Arabic is calmness and tranquillity",
                " and peace of mind. Here AIIah calls",
                " its being sent into the hearts of",
                " the believers an important factor in the",
                " victory that Islam and the Muslims achieved",
                " at Hudaibiyah. From a study of the",
                " conditions of the tuns one comes to",
                " know what kind of a Sakinat it",
                " was that was sent down into the",
                " hearts of the Muslims during that period",
                " and how it became a source of",
                " victory. If at the time when the",
                " Holy Prophet expressed his intention to go",
                " for 'Umrah to Makkah, the Muslims had",
                " become terror-stricken and started behaving like the",
                " hypocrites as if they were going into",
                " the very jaws of death, or if",
                " at the time when they heard the",
                " news on the way that the disbelieving",
                " Quraish were coming out in great strength",
                " to fight them, they had been alarmed",
                " as to how they would face the",
                " enemy un-armed, and thus become panic-stricken, obviously",
                " no benefits would have resulted from Hudaibiyah",
                " at all. Then, if at the time",
                " when at Hudaibiyah the disbelievers had stopped",
                " the Muslims from going any further, and",
                " when they had tried to provoke them",
                " by launching against them repeated sudden attacks,",
                " and when the rumor of Hadrat 'Uthman's",
                " martyrdom had spread, and when Abu Jandal",
                " had appeared on the scene as the",
                " very image of oppression and persecution, the",
                " Muslims had actually become provoked and broken",
                " the discipline that the Holy Prophet had",
                " instilled in them, the result would have",
                " been disastrous. Above all, if at the",
                " time when the Holy Prophet was going",
                " to conclude the treaty on the conditions",
                " which were un-acceptable to the entire party",
                " of the Muslims, the Muslims had happened",
                " to disobey him, the great victory of",
                " Hudaibiyah would have turned into a humiliating",
                " defeat. Thus, it was alI because of",
                " Allah's bounty that on all these critical",
                " moments the Muslims were blessed with full",
                " peace of mind with regard to the",
                " leadership and guidance of the Holy Prophet,",
                " the truth of Islam and the truthfulness",
                " of their mission. This is why they",
                " decided with a cool mind that they",
                " would face and accept whatever hardships they",
                " would encounter in the way of Allah;",
                " that is why they remained safe from",
                " fear, confusion, provocation and despair; that is",
                " why perfect discipline continues to prevail in",
                " the camp; and that is why, in",
                " spite of being deeply grieved at the",
                " conditions of peace, they submitted to the",
                " decision taken by the Holy Prophet. This",
                " was the sakinat that AIIah had sent",
                " down into the hearts of the Muslims,",
                " and it was aII because of this",
                " that the dangerous step of undertaking a",
                " journey for performing 'Umrah became the prelude",
                " to a unique victory.",
                "*7) That is,",
                " \"One Faith they already had before they",
                " set out on this expedition; they attained",
                " the additional Faith when they remained steadfast",
                " on the way of sincerity, piety and",
                " obedience in every trial that they faced",
                " in connection with the expedition. \" This",
                " verse is one of those verses which",
                " show that Faith is not a static",
                " state which is incapable of growth, but",
                " it develops as well as decays and",
                " deteriorates. After embracing Islam till death the",
                " believer at every step in his life",
                " continues to be confronted with such tests",
                " and trials in which he has to",
                " take a decision whether in following the",
                " Divine Religion he is prepared to sacrifice",
                " his life, his wealth, his sentiments, desires,",
                " time, comforts and interests or not. If",
                " at the time of every such trial",
                " he adopts the way of sacrifice, his",
                " Faith progresses and develops, and if he",
                " turns away his Faith decays and deteriorates",
                " till a time may also come when",
                " the initial state of the Faith with",
                " which he had entered Islam is even",
                " endangered to be lost and destroyed. (For",
                " further explanation. see E.N. 2 of Surah",
                " AI-Anfal and E.N. 38 of AI-Ahzab).",
                "*8)",
                " It means this: AIIah has such hosts",
                " by which He can destroy and exterminate",
                " the disbelievers completely whenever He wills, but",
                " He has deliberately and by wisdom only",
                " placed this responsibility on the believers that",
                " they should enter a conflict with the",
                " disbelievers and struggle to make the Religion",
                " of AIIah prevail and prosper in the",
                " world. In this way alone does a",
                " door to the enhancement of their ranks",
                " and successes in the Hereafter open as",
                " is being indicated in the following verse'.",
                ""
            ]
        },
        {
            "id": "[48:5]",
            "verse": "[And] that He may admit the believing men and the believing women to gardens beneath which rivers flow to abide therein eternally and remove from them their misdeeds - and ever is that, in the sight of Allah, a great attainment -",
            "description": [
                "In the Qur'an generally mention of the",
                " rewards for the believers is made collectively",
                " and separate mention is not made of",
                " the rewards for the men and the",
                " women But here, since the general mention",
                " of giving the rewards could cause the",
                " doubt that this reward may perhaps be",
                " only meant for the men. Allah has",
                " made a separate mention of the believing",
                " women, saying that they too would be",
                " equal partners in this reward with the",
                " believing men. The reason is obvious. Those",
                " God-fearing women who encouraged their husbands, sons,",
                " brothers and fathers to proceed on the",
                " dangerous journey instead of stopping them from",
                " it and discouraging them by crying and",
                " wailing, who looked after their houses, their",
                " properties, their honor and children in their",
                " absence faithfully, who did not even feel",
                " the alarm lest at the sudden departure",
                " of 1,400 of the Companions the disbelievers",
                " and hypocrites of the surrounding areas would",
                " attack the city, should certainly have become",
                " equal partners with their men in the",
                " reward of Jihad although they stayed behind",
                " in their homes.",
                "*10) That is, that",
                " He may pardon whatever errors they might",
                " have committed because of human weaknesses, remove",
                " every trace and mark of the errors",
                " from them before admitting them into Paradise",
                " so that they may enter Paradise absolutely",
                " free from every evil that may cause",
                " them embarrassment."
            ]
        },
        {
            "id": "[48:6]",
            "verse": "And [that] He may punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women - those who assume about Allah an assumption of evil nature. Upon them is a misfortune of evil nature; and Allah has become angry with them and has cursed them and prepared for them Hell, and evil it is as a destination.",
            "description": [
                "The hypocrites living in the suburbs of",
                " Madinah were thinking, as has been stated",
                " in verse 12 below, that the Holy",
                " Prophet and his Companions would not return",
                " alive from that journey. As for the",
                " polytheists of Makkah and their pagan companions,",
                " they were thinking that they had successfully",
                " put to rout the Holy Prophet and",
                " his Companions by preventing them from performing",
                " `Umrah. In fact, whatever these two groups",
                " had thought they had this misunderstanding about",
                " Allah that He would not help His",
                " Messenger and in the conflict between the",
                " Truth and falsehood would allow falsehood to",
                " defeat and frustrate the Truth.",
                "*12) That",
                " is, \"They were encompassed by the same",
                " evil fate which they wanted to avoid",
                " and against which they had devised all",
                " those plans, and their same plans caused",
                " the evil fate to be hastened.\""
            ]
        },
        {
            "id": "[48:7]",
            "verse": "And to Allah belong the soldiers of the heavens and the earth. And ever is Allah Exalted in Might and Wise.",
            "description": [
                "Here the theme of verse 4 has",
                " been reiterated for another object. There, the",
                " object was to state that AIlah instead",
                " of employing His supernatural hosts to fight",
                " the disbelievers had employed the believers for",
                " it only because He willed to favor",
                " them. Here, the theme has been repeated",
                " to say that in order to punish",
                " the one whom Allah wills to punish",
                " He can employ whichever of His countless",
                " hosts He likes for the purpose; no",
                " one has the power to avert His",
                " punishment by his own plans."
            ]
        },
        {
            "id": "[48:8]",
            "verse": "Indeed, We have sent you as a witness and a bringer of good tidings and a warner",
            "description": [
                "Shah Waliyullah has translated shahid as \"a",
                " bearer of witness to the truth\", and",
                " other translators translate it as \"a bearer",
                " of the witness\". The word shahadat comprehends",
                " both these meanings. For explanation, sec E.N.",
                " 82 of Surah Al-Ahzab.",
                "*15) For explanation,",
                " see E.N. 33 of Surah Al-AhzaB."
            ]
        },
        {
            "id": "[48:9]",
            "verse": "That you [people] may believe in Allah and His Messenger and honor him and respect the Prophet and exalt Allah morning and afternoon.",
            "description": [
                "According to some commentators the verse means:",
                " \".... and help the Messenger, and honour",
                " him, and glorify Allah morning and evening\",",
                " and according to others: \"... and help",
                " Allah, and honour Him and glorify Him",
                " morning and evening. \" Glorifying Allah morning",
                " and evening does not mean glorifying Him",
                " only in the morning and the evening",
                " but at all times. It is just",
                " like saying about something that it is",
                " well-known in the east and the west",
                " when one actually means to say that",
                " it is well-known everywhere in the world.",
                ""
            ]
        },
        {
            "id": "[48:10]",
            "verse": "Indeed, those who pledge allegiance to you, [O Muhammad] - they are actually pledging allegiance to Allah. The hand of Allah is over their hands. So he who breaks his word only breaks it to the detriment of himself. And he who fulfills that which he has promised Allah - He will give him a great reward.",
            "description": [
                "The reference is to the pledge that",
                " the Holy Prophet took from his Companions",
                " at Hudaibiyah at the rumor that Hadrat",
                " `Uthman had been killed at Makkah. According",
                " to some traditions it was a pledge",
                " unto death, and according to others it",
                " was an undertaking that they would not",
                " nut away from the battlefield. The first",
                " thing has been reported from Hadrat Salamah",
                " bin Akwa' and the second from Hadrat",
                " Ibn `Umar, Jabir bin `Abdullah and Ma'qil",
                " bin Yasar. The purport of both is",
                " the same. The Companions had pledged allegiance",
                " on the Holy Prophet's hand with the",
                " express object that if the news of",
                " Hadrat `Uthman's martyrdom proved to be true,",
                " they would settle the matter with the",
                " Quraish there and then even if they",
                " were cut to pieces in the clash.",
                " As on this occasion it was not",
                " yet certain whether Hadrat `Uthman actually had",
                " been killed or was still living, the",
                " Holy Prophet placed one of his own",
                " hands on the other and pledged allegiance",
                " on his behalf, and thus bestowed a",
                " unique honour on Hadrat `Uthman in that",
                " he made Hadrat 'Uthman a partner in",
                " the pledge by making his own sacred",
                " hand represent the hand of Hadrat `Uthman.",
                " The Holy Prophet's taking the pledge of",
                " allegiance on his behalf necessarily meant that",
                " he had full confidence that if Hadrat",
                " `Uthman had been present he would certainly",
                " have pledged the allegiance.",
                "*18) That is,",
                " the hand on which the Muslims were",
                " swearing allegiance was not the hand of",
                " the Prophet's person but of Allah's representative,",
                " and this allegiance was in fact being",
                " sworn to Allah through His Messenger. .",
                "",
                "*19) Here, instead of `alaih-illah the words",
                " used in the original are alaihullah, which",
                " is a departure from the general rule",
                " of Arabic. `Allama Alusi has given two",
                " reasons for the unusual use of the",
                " vowel points here. First, the object on",
                " this special occasion is to express the",
                " great glory, eminence and majesty of the",
                " Being to Whom the pledge was being",
                " sworn for which alaih-u is more appropriate",
                " than `alaih-i; second, the ha in alaih-i",
                " actually represents howe; therefore, adhering here to",
                " the vowel points of the original goes",
                " well with the theme of the aIlegiance.",
                ""
            ]
        },
        {
            "id": "[48:11]",
            "verse": "Those who remained behind of the bedouins will say to you, \"Our properties and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not within their hearts. Say, \"Then who could prevent Allah at all if He intended for you harm or intended for you benefit? Rather, ever is Allah, with what you do, Acquainted.",
            "description": [
                "This refers to the people living in",
                " the suburbs of Madinah whom the Holy",
                " Prophet had invited to accompany him in",
                " his march out for `Umrah, but they",
                " had not left their homes in spite",
                " of their claim to Faith just because",
                " they were afraid of death. Traditions show",
                " that these were the people of the",
                " tribes of Aslam, Muzainah, Juhainah, Ghifar, Ashja`,",
                " Dil and others.",
                "*21) This has two",
                " meanings: (1) \"That after your returning to",
                " Madinah the excuse that these people will",
                " present for not going out with you,",
                " would only be a lame excuse, because",
                " they know in their hearts why they",
                " had stayed behind\"; and (2) 'that their",
                " imploring the Messenger of Allah for a",
                " prayer of forgiveness would only be an",
                " empty word of mouth, for in fact,",
                " they are neither feeling remorse for their",
                " failure to accompany you, nor have they",
                " any feeling that they committed a sin",
                " by not going out with the Messenger,",
                " nor are ,they seeking forgiveness sincerely. As",
                " for thetttselves they think that they did",
                " a wise thing by not going on",
                " the dangerous journey; had they any desire",
                " for Allah and His forgiveness, they would",
                " not have stayed behind at home. \"",
                "",
                "*22) That is, \"Allah's decision will be",
                " on the basis of the knowledge that",
                " He has about the reality of your",
                " actions. If your actions deserve the punishment",
                " and I pray for your forgiveness, my",
                " this prayer will not save you from",
                " Allah's punishment; and if your actions do",
                " not deserve the punishment, and I do",
                " not pray for your forgiveness, my failure",
                " to pray will not do any harm",
                " to you. Everything is in Allah's control,",
                " not mine, and no one's empty words",
                " can deceive Him. Therefore, even if I",
                " accept as true what you say and",
                " then also pray for your forgiveness on",
                " its basis, it will be vain and",
                " without result. \""
            ]
        },
        {
            "id": "[48:12]",
            "verse": "But you thought that the Messenger and the believers would never return to their families, ever, and that was made pleasing in your hearts. And you assumed an assumption of evil and became a people ruined.\"",
            "description": [
                "That is,\"You were delighted to think that",
                " you had saved yourselves from the danger",
                " into which the Messenger and his believing",
                " supporters were going. You thought you had",
                " done so by dint of your great",
                " wisdom; and you also did not feel",
                " any compunction in rejoicing at the thought",
                " that the Messenger and the believers would",
                " not return alive from their expedition. You",
                " did not feel uneasy in spite of",
                " your claim to the Faith but were",
                " pleased to think that you did not",
                " put yourselves in the danger by accompanying",
                " the Messenger. \"",
                "*24) The word ba-",
                " ir (pl.bur in the original) has two",
                " meanings: (1) A sinful, perverted and evil-minded",
                " person, who is incapable of doing anything",
                " good; and (2) one who is doomed",
                " to an evil end, who is following",
                " the path of destruction,"
            ]
        },
        {
            "id": "[48:13]",
            "verse": "And whoever has not believed in Allah and His Messenger - then indeed, We have prepared for the disbelievers a Blaze.",
            "description": [
                "Here, Allah in clear words is declaring",
                " alI such people disbelievers and devoid of",
                " the faith, who are not sincere with",
                " regard to AIlah and His Religion, who",
                " shirk endangering their interests, their lives and",
                " wealth for the sake of Allah's Religion",
                " when the time comes of their trial",
                " and test. But one should remember that",
                " this is not the .sort of disbelief",
                " on the basis of which somebody in",
                " the world may be regarded as excommunicated",
                " from Islam, but this is the disbelief",
                " because of which he will be declared",
                " a disbeliever in the Hereafter. The reason",
                " is that the Holy Prophet even after",
                " the revelation of this verse did not",
                " regard as outside Islam those people in",
                " respect of whom it was sent down,",
                " nor treated them like the disbelievers."
            ]
        },
        {
            "id": "[48:14]",
            "verse": "And to Allah belongs the dominion of the heavens and the earth. He forgives whom He wills and punishes whom He wills. And ever is Allah Forgiving and Merciful.",
            "description": [
                "The mention of Allah's being All-Forgiving and",
                " All-Merciful after the foregoing warning, contains in",
                " it a subtle aspect of admonition. It",
                " means this: 'Even now if you give",
                " up your insincere attitude and way of",
                " life and adopt sincerity, you will fmd",
                " Allah All- Forgiving and All-Merciful. He will",
                " forgive you your previous shortcomings and will",
                " treat you according to the quality of",
                " your sincerity in the future.\""
            ]
        },
        {
            "id": "[48:15]",
            "verse": "Those who remained behind will say when you set out toward the war booty to take it, \"Let us follow you.\" They wish to change the words of Allah. Say, \"Never will you follow us. Thus did Allah say before.\" So they will say, \"Rather, you envy us.\" But [in fact] they were not understanding except a little.",
            "description": [
                "That is, `The time is approaching when",
                " these very people who were shirking accompanying",
                " you on the dangerous journey, would see",
                " you going on an expedition in which",
                " there would be the possibility of attaining",
                " easy victory and much booty. Then they",
                " would come running and request you to",
                " take them also along.\" Such a time",
                " came just three months after the truce",
                " of Hudaibiyah, when the Holy Prophet invaded",
                " Khaiber and took it easily. At that",
                " time everyone could see that after the",
                " truce with the Quraish not only Khaiber",
                " but the Jewish settlements of Taima, Fadak,",
                " Wadi-al-Qura' and others also of northern Arabia",
                " would not be able to withstand the",
                " might of the Muslims and would easily",
                " fall to the Islamic State. Therefore, Allah",
                " in these verses forewarned the Holy Prophet",
                " that the opportunists of the suburbs of",
                " Madinah would come up to take part",
                " in and receive their share when they",
                " would see easy victories being attained, and",
                " that he should tell them plainly: \"You",
                " will never be allowed to take part",
                " in these, because only those who had",
                " gone forth to offer their lives in",
                " the conflict at Hudaibiyah regardless of every",
                " danger would be entitled o them. \"",
                "",
                "*28) \"Allah's decree\" implies the decree that",
                " only those people would be allowed to",
                " accompany the Holy Prophet in the expedition",
                " to Khaiber, who had taken part in",
                " the expedition to Hudaibiyah and sworn the",
                " pledge there for AIIah has reserved the",
                " spoils of Khaiber cxclusively for them; as",
                " has been stated clearly in verse 18",
                " blow.",
                "*29) The words \"Allah has already",
                " said this before\" caused the people the",
                " misunderstanding that this refers to some other",
                " command bearing upon the same subject that",
                " might have been sent down before this",
                " verse, and since no such command is",
                " found in this Surah before this verse,",
                " they started looking for it at other",
                " places in the Qur'an till they found",
                " verse 84 of Surah At-Taubah, in which",
                " this very subject has been dealt with",
                " for another occasion. But that verse, in",
                " fact, does not apply to this, for",
                " it was sent down in connection with",
                " the Battle of Tabuk, and its period",
                " of revelation is three years after the",
                " period of revelation of Surah AI-Fat-h. The",
                " fact of the matter is that this",
                " verse refers to vv. 18-19 of this",
                " Surah itself, and Allah's already having said",
                " this does not mean its having been",
                " said before this verse but its having",
                " boon said to the laggards before this",
                " conversation. This conversation with the laggards about",
                " which advance instructions are being given to",
                " the Holy Prophet was to take place",
                " at the time of the expedition to",
                " Khaiber, and this whole Surah, including vv.",
                " 18-19, had been sent down three months",
                " earlier on return from Hudaibiyah on the",
                " way. A careful study of the context",
                " shows that Allah here is giving this",
                " instruction to His Messenger: \"When after your",
                " return at Madinah the laggards come to",
                " you with their excuses, you should give",
                " them this reply, and when they express",
                " their desire to accompany you in the",
                " expedition to Khaiber, you should tell them",
                " this. \""
            ]
        },
        {
            "id": "[48:16]",
            "verse": "Say to those who remained behind of the bedouins, \"You will be called to [face] a people of great military might; you may fight them, or they will submit. So if you obey, Allah will give you a good reward; but if you turn away as you turned away before, He will punish you with a painful punishment.\"",
            "description": [
                "The words au yuslimun in the original",
                " can have two meanings and both are",
                " implied: (1) 'That they should accept Islam\";",
                " and (2) 'that they should submit to",
                " the Islamic rule.\""
            ]
        },
        {
            "id": "[48:17]",
            "verse": "There is not upon the blind any guilt or upon the lame any guilt or upon the ill any guilt [for remaining behind]. And whoever obeys Allah and His Messenger - He will admit him to gardens beneath which rivers flow; but whoever turns away - He will punish him with a painful punishment.",
            "description": [
                "That is, the one who has a",
                " genuine excuse for not joining Jihad is",
                " not accountable, but if the able-bodied, strong",
                " people make excuses for not joining it,",
                " they cannot be regarded as sincere with",
                " regard to AIIah and His Religion, and",
                " they cannot be given the opportunity to",
                " take advantage of the gains as members",
                " of the Muslim community, but when time",
                " comes for making sacrifices for Islam, they",
                " should lag behind and seek the safety",
                " of their lives and properties.\" Here, one",
                " should know that two kinds of the",
                " people have been exempted from Jihad duty",
                " by the Shari ah: (1) Those who",
                " are not physically fit for Jihad. e.g.",
                " young boys, women, the insane, the blind",
                " and such patients as cannot perform military",
                " duties, and such disabled people as cannot",
                " take part in war; and (2) those",
                " for whom it may be difficult to",
                " join Jihad for other sound reasons, e.g.",
                " the slaves, or those persons who may",
                " be ready for Jihad but may not",
                " afford weapons of war and other necessary",
                " equipment, or such debtors who may have",
                " to pay their debts at the earliest",
                " opportunity and the creditors may not be",
                " willing to allow them more time, or",
                " such people whose parents (or a parent)",
                " might be alive, who stand in need",
                " of the children's help. In this regard,",
                " it should also be known that the",
                " children should not join Jihad without the",
                " permission of their parents if they are",
                " Muslims, but if they are non-Muslims it",
                " is not permissible for a person to",
                " stay away from Jihad in case they",
                " refuse permission."
            ]
        },
        {
            "id": "[48:18]",
            "verse": "Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquillity upon them and rewarded them with an imminent conquest",
            "description": [
                "Here again the pledge taken from the",
                " Companions at Hudaibiyah has been mentioned. This",
                " is called Bai 'at Ridwan. for AIIah",
                " in this verse has given the good",
                " news that he became well pleased with",
                " those who on this dangerous occasion did",
                " not show the least hesitation in offering",
                " their lives for the cause of Islam",
                " and gave an express proof of their",
                " being true in their faith by taking",
                " the pledge on the hand of the",
                " Holy Prophet. The Muslims at this time",
                " were equipped only with a sword each.",
                " numbered only 1,400, were unprepared for warfare,",
                " but were donning the pilgrim garments, were",
                " 25 miles away from their military headquarters",
                " (Madinah), while the enemy's stronghold (Makkah) wherefrom",
                " it could get any kind of help",
                " was just 13 miles off. Had these",
                " people been lacking in their sincerity fo",
                " AIIah and His Messenger and His Religion",
                " in any degree, they would have abandoned",
                " the Messenger on this extremely dangerous occasion,",
                " and Islam would have been vanquished for",
                " ever. Apart from their own sincerity there",
                " was no external pressure under which they",
                " might have been compelled to take the",
                " pledge. Their becoming ready at that time",
                " to fight in the cause of Allah's",
                " Religion regardless of the dangers, is a",
                " clear proof that they were true and",
                " sincere in their Faith and loyal to",
                " th ' cause of AIIah and His",
                " Messenger in the highest degree. That is",
                " why AIIah honoured them with this certificate",
                " of His good pleasure. Now it some",
                " one becomes angry with them after they",
                " have been honoured with this certificate of",
                " Allah's good pleasure, or slanders and vilifies",
                " them, his enmity is with Allah, not",
                " with them. Those who say that at",
                " that time when Allah honoured them with",
                " this certificate of His good pleasure, they",
                " were sincere, but afterwards they became disloyal",
                " to AIlah and His Messenger, perhaps harbour",
                " a mistrust about Allah that while sending",
                " down this verse He was unaware of",
                " their future; therefore, He awarded them this",
                " warrant only in view of their state",
                " at that time, and probably due to",
                " the same unawareness inscribed this verse in",
                " His Holy Book as well so that",
                " afterwards also, when those people have turned",
                " disloyal, the world should continue reading this",
                " verse about them and praising the knowledge",
                " of the unseen of that AIlah Who,",
                " God forbid, had granted these faithless and",
                " disloyal people the warrant of His good",
                " pleasure. About the Tree under which this",
                " pledge was taken Ibn `Umar's slave Hadrat",
                " Nafi's tradition has generally spread saying that",
                " the people had started visiting it and",
                " offering Prayers by it, so that when",
                " Hadrat 'Umar came to know of it,",
                " he rebuked and warned the people and",
                " ordered it to be cut down .",
                " ( Tabaqat Ibn Sa'd, vol. II, p.",
                " l00). But there are several other traditions",
                " which contradict it. A tradition from Hadrat",
                " Nafi' himself has been reported in Tabaqat",
                " of Ibn S`ad to the effect that",
                " many years after the Bai at Ridwan",
                " the Companions looked for the Tree but",
                " they could not recognize it and differed",
                " as to which tree it was. (p.",
                " 106). The second tradition has been reported",
                " in Bukhari, Muslim, and Tabaqat on the",
                " authority of Hadrat Said bin al-Musayyab. He",
                " says that his father was one of",
                " those who had participated in the Bai",
                " `at Ridwan. He told him that when",
                " they had gone for 'Umrah al-Qada the",
                " following year, they had forgotten the Tree,",
                " and they could not locate it even",
                " after looking for it. The third tradition",
                " is from lbn Jarir. He says that",
                " when Hadrat `Umar during his caliphate passed",
                " by Hudaibiyah, he enquired about the Tree",
                " under which the pledge had been sworn.",
                " Someone pointed to one tree and another",
                " one to another tree. At this Hadrat",
                " `Umar told the people to forget it",
                " as there was no real need to",
                " bother about it.",
                "*33) Here, sakinat means",
                " that state of the heart on whose",
                " strength a man throws himself into dangers",
                " with complete calm and peace of mind",
                " for the sake of a great objective",
                " and resolves without fear and consternation to",
                " undertake it regardless of the consequences."
            ]
        },
        {
            "id": "[48:19]",
            "verse": "And much war booty which they will take. And ever is Allah Exalted in Might and Wise.",
            "description": [
                "The reference is to the conquest of",
                " Khaiber and its rich spoils and this",
                " verse expressly points out that AIlah had",
                " reserved this reward only for those People",
                " who had taken part in the Bai",
                " at Ridwan; apart from them no one",
                " else was entitled to take part in",
                " the victory and have a share in",
                " the spoils. That is why when the,",
                " Holy Prophet marched out to attack Khaiber",
                " in Safar, A.H. 7, he took only",
                " those people with him. No doubt afterwards",
                " he gave some of the spoils of",
                " Khaiber to those emigrants also who returned",
                " from Habash and to some Companions from",
                " the Dus and Ash'ar tribes as well,",
                " but this was given either from Khums",
                " (one fifth of the spoils of war",
                " given into the public treasury), or with",
                " the approval of the Companions who had",
                " taken the pledge of Ridwan; no one",
                " else was given any share of it.",
                ""
            ]
        },
        {
            "id": "[48:20]",
            "verse": "Allah has promised you much booty that you will take [in the future] and has hastened for you this [victory] and withheld the hands of people from you - that it may be a sign for the believers and [that] He may guide you to a straight path.",
            "description": [
                "This refers to the other victories that",
                " the Muslim achieved successively after Khaiber.",
                "*36)",
                " This implies the treaty of Hudaibiyah which",
                " has been described as \"a manifest victory\"",
                " in the beginning of the Surah.",
                "*37)",
                " That is, \"He restrained the disbelieving Quraish",
                " from attacking you at Hudaibiyah although from",
                " all appearances they were in a much",
                " better position and yours was a much",
                " weaker side militarily.\" Furthermore, it also implies",
                " that no enemy power could muster courage",
                " to attack Madinah in those days, whereas",
                " after the departure of 1,400 soldiers the",
                " Madinah front had become very weak, and",
                " the Jews, the polytheists and hypocrites could",
                " take advantage of the situation.",
                "*38) Sign",
                " of this as to how Allah helps",
                " the one who remains steadfast on obedience",
                " to Allah and His Messenger and comes",
                " out to support and defend the Truth",
                " and righteousness with his trust and faith",
                " in Allah.",
                "*39) \"To the right way\"",
                " : \"To the way of greater insight",
                " and faith so that you may remain",
                " steadfast on obedience to Allah and His",
                " Messenger in the future and may go",
                " on marching on the way of truth",
                " with trust in AIlah, and may learn",
                " this lesson from these experiences that the",
                " believer should take practical steps to do",
                " whatever is demanded by Allahs Religion with",
                " his trust in Him, and should not",
                " overestimate either his own strength or the",
                " strength of the unbelievers.\""
            ]
        },
        {
            "id": "[48:21]",
            "verse": "And [He promises] other [victories] that you were [so far] unable to [realize] which Allah has already encompassed. And ever is Allah, over all things, competent.",
            "description": [
                "Most probably this is a reference to",
                " the Conquest of Makkah. The same is",
                " the opinion of Qatadah and Ibn Jarir.",
                " It seems to mean this: \"Though Makkah",
                " has not yet fallen to you, Allah",
                " has encircled it, and as a result",
                " of this victory at Hudaibiyah, it will",
                " also fall to you. \""
            ]
        },
        {
            "id": "[48:22]",
            "verse": "And if those [Makkans] who disbelieve had fought you, they would have turned their backs [in flight]. Then they would not find a protector or a helper.",
            "description": [
                "That is, \"Allah did not prevent fighting",
                " at Hudaibiyah because there was a possibility",
                " of your being defeated there, but there",
                " were other reasons for it, which are",
                " being stated in the following verses. Had",
                " that factor not been there and AIlah",
                " had allowed the war to take place,",
                " the disbelievers would surely have been routed",
                " and Makkah would have fallen to you",
                " at that very time. \""
            ]
        },
        {
            "id": "[48:23]",
            "verse": "[This is] the established way of Allah which has occurred before. And never will you find in the way of Allah any change.",
            "description": [
                "Here, \"the Way of Allah\" means: Allah",
                " disgraces the disbelievers who fight His Messenger",
                " and helps His own Messenger."
            ]
        },
        {
            "id": "[48:24]",
            "verse": "And it is He who withheld their hands from you and your hands from them within [the area of] Makkah after He caused you to overcome them. And ever is Allah of what you do, Seeing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[48:25]",
            "verse": "They are the ones who disbelieved and obstructed you from al-Masjid al-Haram while the offering was prevented from reaching its place of sacrifice. And if not for believing men and believing women whom you did not know - that you might trample them and there would befall you because of them dishonor without [your] knowledge - [you would have been permitted to enter Makkah]. [This was so] that Allah might admit to His mercy whom He willed. If they had been apart [from them], We would have punished those who disbelieved among them with painful punishment",
            "description": [
                "That is, \"Allah was seeing the sincerity",
                " and the selfless devotion with which you",
                " had become ready to lay down your",
                " lives in the cause of the true",
                " Faith and were obeying the Prophet without",
                " any question. Allah was also seeing that",
                " the disbelievers were being unfair and high-handed.",
                " The demand of this situation was that",
                " they should have been punished there and",
                " then through you, but in spite of",
                " that. AIIah restrained your hands from them",
                " and their hands from you.\"",
                "*44) This",
                " was the reason why Allah did not",
                " allow fighting to take place at Hudaibiyah.",
                " This has two aspects: (I) That at",
                " that time there were quite a number",
                " of the Muslim men and women living",
                " in Makkah, who were either hiding their",
                " faith, or were being persecuted because of",
                " their faith as they had no means",
                " to emigrate. Had there been fighting and",
                " the Muslims had pushed back the disbelievers",
                " and entered Makkah, these Muslims also would",
                " have been killed in ignorance along with",
                " the disbelievers. This would not only have",
                " grieved the Muslims but the Arab polytheists",
                " also would have got an opportunity to",
                " say that the Muslims did not even",
                " spare their own brethren in faith during",
                " wartime. Therefore, Allah took pity on the",
                " helpless Muslims and averted the war in",
                " order to save the Companions from grief",
                " and infamy. The other aspect of the",
                " expedience was that Allah did not will",
                " that Makkah should fall to the Muslims",
                " as a result of the defeat of",
                " the Quraish after a bloody clash but",
                " He willed that they should be encircled",
                " from all sides so that within two",
                " years or so they should become absolutely",
                " helpless and subdued without offering any resistance,",
                " and then the whole tribe should accept",
                " Islam and enter Allah's mercy as it",
                " actually happened on the Conquest of Makkah.",
                " Here the juristic dispute has arisen that",
                " if during a war between the Muslims",
                " and the disbelievers, the disbelievers should bring",
                " out some Muslim men and women, children",
                " and old men, in their possession and",
                " put them in the forefront as a",
                " shield for themselves, or if there is",
                " some Muslim population also in the non-Muslim",
                " city under attack by the Muslim forces,",
                " or if in a warship of the",
                " disbelievers, which is within our gun-fire, the",
                " disbelievers have taken some Muslims also on",
                " board, can the Muslim army open fire",
                " on it? In answer to it the",
                " nulings given by different jurists are as",
                " follows: Imam Malik says that in such",
                " a case fire should not be opened,",
                " and for this he cites this very",
                " verse as an argument. He contends that",
                " Allah prevented the war at Hudaibiyah only",
                " in order to save the Muslims. (Ibn",
                " al-`Arabi, Ahkam al Qur'an). But this in",
                " fact is a weak argument. There is",
                " no word in the verse which may",
                " support the view that launching an attack",
                " on the enemy in this case is",
                " unlawful and forbidden. At the most what",
                " one can say on the basis of",
                " this verse is that the launching of",
                " an sttack in such a case should",
                " be avoided in order to save the",
                " Muslims, provided that it does not put",
                " the disbelievers in an advantageous position against",
                " the Muslims militarily, or does not diminish",
                " the Muslims' chances of gaining an upper",
                " hand in the conflict. Imam Abu Hanifah,",
                " Imam Abu Yusuf, Imam Zufar and Imam",
                " Muhammad saythat it is lawful to open",
                " fire in such a case; so much",
                " so that even if the disbelievers use",
                " the children of the Muslims as a",
                " shield by putting them in the forefront,",
                " there is no harm in shooting at",
                " them, and it is not obligatory for",
                " the Muslims to expiate and pay any",
                " blood-money for the Muslims thus killed, (AIJassas,",
                " Ahkam al-Qur'an; Imam Muhammad, :Kitab as-Siyar). Imam",
                " Sufyan Thauri also in this case regards",
                " opening of the fire as lawful, but",
                " he says that although the Muslims will",
                " not pay the blood-money of the Muslims",
                " thus killed, it is obligatory for them",
                " to expiate the sin. (AI-Jassas, Ahkam al-Qur",
                " an). Imam Auza`i and Laith bin Sa`d",
                " say that if the disbelievers use the",
                " Muslims as a shield, fire should not",
                " be opened on them. Likewise, if it",
                " is known that in their warship ow",
                " own prisoners also are on board, it",
                " should not be sunk. But if we",
                " attack a city of theirs and we",
                " know that there are Muslims also in",
                " the city, it is lawful to open",
                " fire on the city, for it is",
                " not certain that our shells will only",
                " hit the Muslims, and if a Muslim",
                " becomes a victim of this shelling, it",
                " will not be wilful murder of a",
                " Muslim but an inadvertant accident. (Al-Jassas, Ahkam",
                " alQur an). Imam Shafe`i holds the view",
                " that in such a case if it",
                " is not inevitable to open fire it",
                " is better to try to save the",
                " Muslims from destruction; although it is not",
                " unlawful to open fire in this case,",
                " it is undesirable. But if it is",
                " really necessary and it is feared that",
                " in case fire is not opened it",
                " will put the disbelievers in a better",
                " position militarily against the Muslims, it is",
                " lawful to resort to shelling, but even",
                " then every effort should be made to",
                " save the Muslims as far as possible.",
                " Furthermore, Imam Shafe'i also says that if",
                " during a conflict the disbelievers put a",
                " Muslim in front as a shield and",
                " a Muslim kills him, there can be",
                " two possible alternatives: either the killer knew",
                " that the murdered person was a Muslim,",
                " or he did not know that he",
                " was a Muslim. In the first case,",
                " he will be under obligation to pay",
                " compensation for manslaughter as well as do",
                " expiation; in the second case he will",
                " only do expiation. (Mughni al-Muhtaj)."
            ]
        },
        {
            "id": "[48:26]",
            "verse": "When those who disbelieved had put into their hearts chauvinism - the chauvinism of the time of ignorance. But Allah sent down His tranquillity upon His Messenger and upon the believers and imposed upon them the word of righteousness, and they were more deserving of it and worthy of it. And ever is Allah, of all things, Knowing.",
            "description": [
                "The words hamiyyat al -jahiliyyah mean that",
                " a man should wilfully do something unworthy",
                " and improper only for the sake of",
                " his honour and prestige. The dilsbelievers of",
                " Makkah themselves acknowledged and admitted that everybody",
                " ,had a right to visit the Ka`bah",
                " for performing Hajj and `Umrah, and that",
                " they had no right to slop anyone",
                " from this duty. This was an ancient",
                " admitted law of Arabia. But in spite",
                " of knowing that they were absolutely in",
                " the wrong and the Muslims in the",
                " right, they prevented the Muslims from performing",
                " `Umrah only for the sake of their",
                " prestige. The righteous even among the polytheists",
                " also were saving that preventing the people",
                " who had come in the pilgrim garbs",
                " along with sacrificial camels from performing pilgrimage",
                " was an improper act. Yet the Quraish",
                " leaders persisted in their resistance only under",
                " the idea that if Muhammad (upon whom",
                " be Allah's peace) entered Makkah along with",
                " a large number of his followers, it",
                " would mean loss of prestige for them",
                " among the Arabs. This was their arrogance.",
                " .",
                "*46) Here, sakinat means the patience",
                " and dignity with which the Holy Prophet",
                " and the Muslims resisted the disbelievers' rancour",
                " and spirit of paganism. They did not",
                " get provoked at their stubborn and insolent",
                " behaviour and did not do anything which",
                " might have violated the spirit of Truth",
                " and righteousness, or which might have further",
                " complicated the situation instead of settling it",
                " amicably."
            ]
        },
        {
            "id": "[48:27]",
            "verse": "Certainly has Allah showed to His Messenger the vision in truth. You will surely enter al-Masjid al-Haram, if Allah wills, in safety, with your heads shaved and [hair] shortened, not fearing [anyone]. He knew what you did not know and has arranged before that a conquest near [at hand].",
            "description": [
                "This is the answer to the question",
                " that was constantly agitating the minds of",
                " the Muslim. They said, \"The Holy Prophet",
                " had seen in his vision that he",
                " had entered the Masjid al-Haram and moved",
                " round the Ka`bah in worship. Then how",
                " is it that they were returning without",
                " performing `Umrah?\" In answer to this, although",
                " the Holy Prophet had told them that",
                " in his vision he had not seen",
                " that they would perform the `Umrah that",
                " very year, still there remained some suspicion",
                " in the hearts. Therefore, Allah Himself explained",
                " that it was He Who had shown",
                " the vision and it was a true",
                " vision and it would certainly be fulfilled.",
                "",
                "*48) Here, about the words insha'-Allah (if",
                " Allah so wills), which Allah Himself has",
                " used with His promise, one can raise",
                " the objection that when Allah Himself is",
                " making this promise, what is the meaning",
                " of making it conditional upon His own",
                " willing it? The answer is: Here the",
                " words insha'-Allah have not been used in",
                " the sense that if AIlah dces not",
                " will, He will not fulfil His promise,",
                " but in fact these relate to the",
                " background in which this promise was made.",
                " The presumption on the basis of which",
                " the disbelievers of Makkah had played the",
                " drama of preventing the Muslims from `Umrah",
                " was that only he whom they would",
                " allow would perform `Umrah, and would perform",
                " it only when they would allow it",
                " At this AIIah has said: \"This depends",
                " on Our, not on their, will. The",
                " reason why 'Umrah has not been performed",
                " this year is not because the disbelievers",
                " of Makkah did not allow it to",
                " be performed, but because We did not",
                " will it to be performed; in the",
                " future 'Umrah will be performed if We",
                " will, no matter whether the disbelievers allow",
                " it or disallow it.\" Besides, these words",
                " also contain the meaning that the Muslims",
                " too, will perform `Umrah not by their",
                " own power but because We would will",
                " that they should perform it; otherwise if",
                " We do not will, they do not",
                " possess any power to perform it by",
                " themselves.\"",
                "*49) This promise was fulfilled in",
                " the following year in Dhil-Qa'dah A. H.",
                " 7. This `Umrah is well known in",
                " history as 'Umrah al-Qada `.",
                "*50) The",
                " words clearly point out that it is",
                " not obligatory to get the head shaved",
                " in `Umrah and Hajj, but it is",
                " also right to get the hair cut",
                " short. However, it is better to have",
                " the head shaved, for Allah has mentioned",
                " it first and then mentioned having the",
                " hair cut short."
            ]
        },
        {
            "id": "[48:28]",
            "verse": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion. And sufficient is Allah as Witness.",
            "description": [
                "The reason why this thing has been",
                " mentioned here is that when at Hudaibiyah",
                " the peace treaty was going to be",
                " written down, the disbelievers had objected to",
                " the use of the words Rasul-Allah (Messenger",
                " of Allah) with the name of the",
                " Holy Prophet, and on their insistence the",
                " Holy Prophet himself had wiped off these",
                " words from the document. At this Allah",
                " says: \"Our Messenger's being a Messenger is",
                " a reality which remains unaffected whether someone",
                " believes in it or not. If some",
                " people do not believe in it, they",
                " may not, for \"AIIah is enough for",
                " a witness\" over it. Their denial will",
                " not change the reality, but the Guidance",
                " and the true Faith which this Messenger",
                " has brought from Us, shall prevail over",
                " all religion, no matter how hard the",
                " deniers try to obstruct its progress.\" \"All",
                " religion\" implies alI those ways of life",
                " which include the nature of din (religion).",
                " We have explained it fully in E.N.",
                " 3 of Surah Az-Zumar and E.N. 20",
                " of Surah Ash-Shura above. Here what Allah",
                " has stated in clear words is: The",
                " purpose of the Holy Prophet's appointment as",
                " a Prophet was not merely to preach",
                " this Religion but to make it prevail",
                " over all others. In other words, he",
                " did not bring this Religion so that",
                " it might survive in a limited compartment",
                " of life which is allowed it by",
                " the dominant religion, while the rest of",
                " the spheres of life, by and large,",
                " should remain under the relentless control of",
                " some false religion. But he had brought",
                " it so that it should be the",
                " dominant Religion of life and any other",
                " religion should survive, if at all it",
                " survives, only within the limits in which",
                " it allows it to survive. (For further",
                " explanation, sec E.N. 48 of Surah Az-Zumar).",
                ""
            ]
        },
        {
            "id": "[48:29]",
            "verse": "Muhammad is the Messenger of Allah; and those with him are forceful against the disbelievers, merciful among themselves. You see them bowing and prostrating [in prayer], seeking bounty from Allah and [His] pleasure. Their mark is on their faces from the trace of prostration. That is their description in the Torah. And their description in the Gospel is as a plant which produces its offshoots and strengthens them so they grow firm and stand upon their stalks, delighting the sowers - so that Allah may enrage by them the disbelievers. Allah has promised those who believe and do righteous deeds among them forgiveness and a great reward.",
            "description": [
                "\"The Companions (of the Holy Prophet) are",
                " hard on the disbelievers\" : they are",
                " not \"wax that the disbelievers may mould",
                " them as they like; they can neither",
                " be cowed nor. purchased by any inducement.",
                " The disbelievers have no power to turn",
                " them away from the great objective for",
                " the sake of which they have joined",
                " and followed the Holy Prophet even at",
                " the cost of their lives.\"",
                "*53) That",
                " is, \"Whatever their hardness and severity, it",
                " is only for the disbelievers, not for",
                " the believers. As regards the believers they",
                " are soft, merciful, affectionate, sympathetic and compassionate.",
                " Their unity of aim and object has",
                " produced in them love and harmony and",
                " complete accord among themselves.\"",
                "*54) This does",
                " not imply the mark that appears on",
                " the forehead of some people on account",
                " of prostrations, but it implies the marks",
                " and traces of the fear of God,",
                " munificence, nobility and goodness of manner that",
                " naturally appears on the face of a",
                " person on account of bowing down before",
                " God. Man's face is an open book",
                " on the pages of which different states",
                " of a man's self can be seen",
                " easily. A vain and arrogant person's face",
                " is different from the face of a",
                " humble, modest and unassuming person; an immoral",
                " person's face is clearly distinguished from the",
                " face of a righteous and well-mannered person;",
                " and there is a marked difference between",
                " the facial appearance of a wicked man",
                " and of a noble and virtuous man.",
                " What AIlah means to say is: \"The",
                " Companions of Muhammad (upon whom be Allah's",
                " peace) are such that one can recognize",
                " them on first sight to be the",
                " best of mankind, because their faces shine",
                " forth with the light of God-worship and",
                " God -consciousness.\" This is the same thing",
                " about which Imam Malik has said that",
                " when the armies of the Companions entered",
                " Syria, the Syrian Christians remarked: \"These people",
                " possess the very same qualities and characteristics",
                " of the disciples of the Prophet Jesus",
                " Christ.\"",
                "*55) The allusion probably is to",
                " Deuteronorny, 33: 2-3, in which the Holy",
                " Prophet's advent has been foretold and the",
                " word \"saints\" has been used for his",
                " Companions. Apart from this, if some other",
                " quality of the Companions has been mentioned",
                " in the Torah, it is not found",
                " in the existing, corrupted Torah.",
                "*56) This",
                " parable is found in a sermon of",
                " the Prophet Jesus that has been reported",
                " in the New Testament, thus: \"And he",
                " said, So is the kingdom of God,",
                " as if a man should east seed",
                " into the ground: And should sleep, and",
                " rise night and day, and the seed",
                " should spring and grow up, he knoweth",
                " not how. For the earth bringeth forth",
                " fruit of herself; first the blade, then",
                " the ear, after that the full corn",
                " in the ear. But when the fruit",
                " is brought forth, immediately he putteth in",
                " the sickle, because the harvest is come.",
                " And he said, Whereunto shall we liken",
                " the kingdom of God? or with what",
                " comparison shall we compare it? It is",
                " like a grain of mustard seed, which,",
                " when it is sewn in the earth,",
                " is less than all the seeds that",
                " be in the earth: Hut when it",
                " is sown, it groweth up, and becometh",
                " greater than all herbs, and shouted out",
                " great branches; so that the fowls of",
                " the air may lodge under the shadow",
                " of it.\" The last portion of this",
                " sermon is also found in Matthew, 13:",
                " 31-32.",
                "*57) A section of the Muslims",
                " translates this verse, thus: \"Allah has promised",
                " forgiveness and a great reward to those",
                " from among these people who have believed",
                " and done good works.\" Thus, they invent",
                " a way to vilify and slander the",
                " Companions, and claim that according to this",
                " verse many people among the Companions were",
                " not believers and righteous. But this commentary",
                " goes against vv. 4, 5, 18 and",
                " 26 of this very Sarah, and dces",
                " not even accord with the initial sentences",
                " of this verse itself. In vv. 4-5,",
                " Allah has made mention of sending down",
                " sakinat (tranquillity) and of effecting increase in",
                " the Faith of all those Companions who",
                " were present with the Holy Prophet at",
                " Hudaibiyah, and given them without any exception",
                " the good news of admission into Paradise.",
                " In verse 18, AIIah has expressed His",
                " good pleasure for aII those who took",
                " the pledge to the Holy Prophet under",
                " the Tra, and in this also there",
                " is no exception. In verse 26 also",
                " AIIah has used the word mu 'minin",
                " (believers) for aII the Companions, has made",
                " mention of sending down His sakinat to",
                " there, and obliged them to be righteous",
                " and pious, for they were most worthy",
                " and deserving of aII mankind. Here also",
                " it was not said that the news",
                " was being given only abut those who",
                " were believers among them. Then in the",
                " initial sentences also of this verse itself",
                " the characteristics mentioned arc of alI those",
                " people who were with the Holy Prophet",
                " Muhammad (upon whom be Allah's peace and",
                " blessings). The words are to the effect",
                " that aII the people who are with",
                " him have this and this quality and",
                " characteristic. After this, suddenly in the last",
                " sentence there could be no excuse to",
                " say that some of them were the",
                " believers and others were not."
            ]
        }
    ]
}