{
    "name": "Al-Maidah",
    "verse-count": 120,
    "verse-info": [
        {
            "id": "[5:1]",
            "verse": "O you who have believed, fulfill [all] contracts. Lawful for you are the animals of grazing livestock except for that which is recited to you [in this Qur'an] - hunting not being permitted while you are in the state of ihram. Indeed, Allah ordains what He intends.",
            "description": [
                "People should abide by the limitations and",
                " prohibitions laid down in this surah and",
                " elsewhere in the law of God. This",
                " brief introductory statement is followed by an",
                " enunciation of those prohibitions which people are",
                " required to observe.",
                "*2). The Arabic word",
                " an'am (cattle) denotes camels, oxen, sheep and",
                " goats, whereas the word bahimah means all",
                " grazing quadrupeds. Had God said that an'am",
                " had been made lawful for them, this",
                " permission would have included only those animals",
                " to which the term an'am is applicable.",
                " But the terms in which the injunction",
                " is conveyed are bahimat al-an'am (all grazing",
                " beasts of the flock). Hence the permission",
                " is of wider import and embraces all",
                " grazing quadrupeds of the cattle type, i.e.",
                " which do not possess canine teeth, which",
                " feed on plants rather than animals, and",
                " which resemble the cattle found in Arabia",
                " in other characteristics. This implies that the",
                " flesh of those animals which have canine",
                " teeth and are carnivorous is not permissible.",
                " This implication was elucidated by the Prophet",
                " (peace be on him) and is embodied",
                " in a tradition in which he prohibited",
                " those beasts which kill and eat other",
                " animals. Likewise, the Prophet (peace be on",
                " him) also prohibited birds with claws and",
                " those that feed on carrion. According to",
                " a tradition transmitted by Ibn 'Abbas: \"The",
                " Messenger of Allah (peace be on him)",
                " prohibited all beasts with canine teeth and",
                " all birds with claws.' (Bukhari, 'Dhaba'ih', 28,",
                " 29; 'Tibb', 53; Abu Da'ud, 'At'imah', 32;",
                " Tirmidhi, 'At'imah', 9, 11; Muslim, 'Sayd', 11-16;",
                " Nasa'i, 'Sayd wa Dhaba'ih', 28, 30, 33;",
                " Ibn Majah, 'Sayd', 13; etc. - Ed.)",
                "",
                "*3). Ihram is the name of the",
                " simple apparel worn at the time of",
                " Pilgrimage. In every direction around the Ka'bah,",
                " there are certain fixed points beyond which",
                " no Pilgrim may proceed without donning this",
                " special Pilgrim's garment in place of his",
                " normal clothes. This apparel consists of two",
                " sheets of untailored cloth, one of which",
                " is wrapped around the lower part of",
                " the body while the other is thrown",
                " over the upper part. This manner of",
                " dressing is termed ihram because once a",
                " man has assumed it he must treat",
                " as prohibited a number of things which",
                " are ordinarily lawful, for example either shaving",
                " or trimming the hair, or using perfumes",
                " and other items of toiletry and the",
                " gratification of sexual desires. These restrictions also",
                " extend to both killing and hunting, and",
                " to leading anyone else to either kill",
                " or hunt an animal.",
                "*4). God is",
                " the absolute sovereign and has absolute authority",
                " to issue whatever command He might will.",
                " His creatures do not have the right",
                " to complain about any of these orders.",
                " Even though wisdom (hikmah) underlies the ordinances",
                " of God, a true believer does not",
                " obey them because he considers them either",
                " appropriate or conducive to his best interests.",
                " He obeys them simply because they are",
                " the ordinances of his Lord. He holds",
                " unlawful all that God has declared unlawful,",
                " because God has so decreed it; whatever",
                " He has declared lawful is regarded as",
                " such for no other reason than that",
                " God, the Lord of all, has allowed",
                " His servants the use of it. Hence",
                " the Qur'an establishes very firmly the principle",
                " that nothing except permission from the Lord",
                " - or lack of it - is",
                " to be taken into consideration in deciding",
                " what is lawful and what is not.",
                ""
            ]
        },
        {
            "id": "[5:2]",
            "verse": "O you who have believed, do not violate the rites of Allah or [the sanctity of] the sacred month or [neglect the marking of] the sacrificial animals and garlanding [them] or [violate the safety of] those coming to the Sacred House seeking bounty from their Lord and [His] approval. But when you come out of ihram, then [you may] hunt. And do not let the hatred of a people for having obstructed you from al-Masjid al-Haram lead you to transgress. And cooperate in righteousness and piety, but do not cooperate in sin and aggression. And fear Allah; indeed, Allah is severe in penalty.",
            "description": [
                "Whatever characteristically represents either a particular doctrine,",
                " creed, way of thought or conduct is",
                " recognized as its symbol. For example, official",
                " flags, uniforms of the armed forces, coins,",
                " notes and stamps are symbols used by",
                " governments so that their subjects - in",
                " fact all those who live within their",
                " sphere of influence - treat them with",
                " proper respect. Cathedrals, altars and crosses are",
                " symbols of Christianity. A special bunch of",
                " hair on the head, a special kind",
                " of bead-rosary and the temple are symbols",
                " of Hinduism. A turban, bracelet and Kirpan",
                " (a special dagger kept by the Sikhs)",
                " are symbols of the Sikh religion. The",
                " hammer and sickle are the symbols of",
                " Communism. The swastika has been the symbol",
                " of Aryan racialism. The followers of these",
                " ideologies are required to treat these symbols",
                " with respect. If a man insults any",
                " symbol associated with a particular ideology it",
                " is regarded as an act of hostility;",
                " and if the person concerned is himself",
                " a follower of that ideology then that",
                " insult is considered tantamount to an abandonment",
                " of, and a revolt against it.",
                "The",
                " expression 'sha'a'ir Allah' refers to all those",
                " rites which, in opposition to polytheism and",
                " outright disbelief and atheism, are the characteristic",
                " symbols of an exclusive devotion to God.",
                " Muslims are required to respect these symbols,",
                " regardless of the people among whom they",
                " are found, provided their underlying spirit is",
                " one of godliness and that they have",
                " not been tainted by either polytheistic or",
                " pagan associations. Hence, whenever a Muslim encounters",
                " something in either the creed or practice",
                " of a non-Muslim, which embodies any element",
                " of devotion and service to the One",
                " True God, he will identify himself with",
                " it and show respect to the symbols",
                " which represent it. For this true element",
                " in their religious life constitutes the point",
                " of agreement between them and the Muslims.",
                " The point of dispute is not that",
                " they serve God, but that they associate",
                " others in that service.",
                "It should be",
                " recalled that this directive to treat the",
                " symbols of God with due respect was",
                " given at a time when a state",
                " of belligerency existed between the Muslims and",
                " the polytheists of Arabia, and Makka was",
                " under the occupation of the latter. Polytheistic",
                " tribes from all over Arabia used to",
                " visit the Ka'bah for Pilgrimage, and the",
                " routes of many of these tribes were",
                " within the reach-of the Muslims if they",
                " decided to attack. It was in such",
                " circumstances that the Muslims were told that,",
                " even though those people were polytheists, they",
                " should not be molested if they were",
                " proceeding towards the 'House of God'; that",
                " they should not be attacked during the",
                " months of Pilgrimage; and that the animals",
                " which they were carrying for sacrificial offering",
                " should not be touched. The element of",
                " godliness which persisted in their otherwise distorted",
                " religious life deserved to be respected.",
                "*6).",
                " Following a general directive that the symbols",
                " of God should be treated with proper",
                " respect a few such symbols are mentioned",
                " specifically lest war fever lead even to",
                " the desecration of religious rites and symbols.",
                " The enumeration of these particular symbols does",
                " not mean that respect is due to",
                " these alone.",
                "*7). Ihram is also one",
                " of the symbols of God and violation",
                " of any of the prohibitions which should",
                " be observed in that state is an",
                " act of sacrilege. The prohibition of hunting",
                " while in the state of ihram is",
                " mentioned in connection with the desecration of",
                " the symbols of God. When ihram is",
                " over, the prohibitions become void, and one",
                " is permitted to hunt.",
                "*8). The unbelievers",
                " had prevented the Muslims from visiting the",
                " Ka'bah. In fact, in violation of the",
                " ancient usage of Arabia they had even",
                " deprived them of their right to make",
                " Pilgrimage. As a result, the Muslims felt",
                " inclined to prevent the pagan tribes from",
                " making their pilgrimage by not letting them",
                " pass along the routes to Makka which",
                " lay close to the Islamic domains, and",
                " to attack their trading caravans during the",
                " time of Pilgrimage (Hajj). God prevented them",
                " from carrying out this plan through the",
                " revelation."
            ]
        },
        {
            "id": "[5:3]",
            "verse": "Prohibited to you are dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah, and [those animals] killed by strangling or by a violent blow or by a head-long fall or by the goring of horns, and those from which a wild animal has eaten, except what you [are able to] slaughter [before its death], and those which are sacrificed on stone altars, and [prohibited is] that you seek decision through divining arrows. That is grave disobedience. This day those who disbelieve have despaired of [defeating] your religion; so fear them not, but fear Me. This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion. But whoever is forced by severe hunger with no inclination to sin - then indeed, Allah is Forgiving and Merciful.",
            "description": [
                "'Carrion' signifies the animal which has died",
                " a natural death.",
                "*10). This refers to",
                " the practice of pronouncing the name of",
                " anyone or anything other than God and",
                " dedicating the animal, as an offering, to",
                " either a holy personage, god or goddess",
                " before slaughtering. (For details see Towards Understanding",
                " the Qur'an, vol. I, Surah 2, n.",
                " 171.)",
                "*11). It is lawful to eat",
                " the flesh of an animal which may",
                " have suffered from any of the above-mentioned",
                " accidents providing it was still alive until",
                " slaughtered. This verse also makes it clear",
                " that the flesh of an animal becomes",
                " lawful only by slaughtering ritually, and that",
                " no other method of killing is valid.",
                " The words dhabh and dhakah belong to",
                " the technical terminology of Islam and denote",
                " slitting the throat so that the blood",
                " is completely drained from the animal's body.",
                " The disadvantage of killing an animal by",
                " either guillotine or strangulation is that the",
                " greater part of the blood remains within",
                " the body, and at various places it",
                " sticks to the flesh and forms congealed",
                " lumps. If an animal is slaughtered by",
                " slitting the throat, on the other hand,",
                " the connection between mind and body remains",
                " intact for a short while, with the",
                " result that the blood is thoroughly drained",
                " out from all the veins and the",
                " flesh becomes fully cleansed of blood. We",
                " have just come across the injunction prohibiting",
                " the eating of blood. So only that",
                " flesh which has been purged of blood",
                " is declared lawful.",
                "*12). The word nusub",
                " signifies all the places consecrated for offerings",
                " to others than the One True God,",
                " regardless of whether they are images of",
                " wood, stone or something else.",
                "*13). The",
                " division of objects of eating and drinking",
                " into lawful and unlawful is based on",
                " their moral rather than their medicinal properties.",
                " God has left matters relating to the",
                " physical world to be tackled by man's",
                " own effort and striving. It is for",
                " man himself to discover by his own",
                " efforts which items of food and drink",
                " provide him with healthy nourishment and which",
                " are useless and harmful. The Law (Shari'ah)",
                " does not take upon itself to guide",
                " man in such matters. Had it undertaken",
                " such a task, perhaps one of the",
                " first things for it to do would",
                " have been to pronounce the prohibition of",
                " arsenic oxide. But one will notice that",
                " the Qur'an and Hadith mention neither arsenic",
                " oxide nor other things which either singly",
                " or jointly are fatal for man. The",
                " underlying considerations of the Law with regard",
                " to the various items of eating and",
                " drinking are their possible effects on man's",
                " morals and on the purity of his",
                " soul. This is in addition to the",
                " judgements that the Law makes with regard",
                " to the various means adopted by man",
                " in his quest for food - whether",
                " they are appropriate according to Islamic standards",
                " or not. It is impossible for man",
                " to determine what is beneficial and what",
                " is harmful for his morals; he has",
                " not been endowed with the capacities needed",
                " to arrive at sound conclusions on these",
                " matters, and so he frequently stumbles into",
                " error. Hence the Law undertakes to guide",
                " him in these matters and these matters",
                " alone. Whatever has been prohibited by Islam",
                " has been prohibited because of its bad",
                " effects on human morals, because of its",
                " repugnance to spiritual purity, and because of",
                " its association with false beliefs. Things which",
                " have been declared lawful have been so",
                " declared because they are untainted by these",
                " evils.",
                "It may be asked why God",
                " did not specify the considerations underlying the",
                " prohibition of various things for this would",
                " have afforded us very valuable insights. In",
                " reply, it must be pointed out that",
                " it is impossible for us to fully",
                " grasp such considerations. The kind of questions",
                " we face are for instance: What are",
                " the corrupting effects of the consumption of",
                " either blood or the flesh of swine",
                " and carrion on our morals? The extent",
                " to which this corruption affects our morals,",
                " and the way in which certain things",
                " affect our morals is a matter that",
                " we are incapable of investigating, for we",
                " do not possess the means of weighing",
                " and measuring the moral properties of various",
                " things. To mention some of these bad",
                " effects would carry little weight with the",
                " sceptic, for how could he test the",
                " soundness of statements on such questions? Hence,",
                " God considers faith rather than man's own",
                " judgement as the main basis for observing",
                " the standards of lawfulness and prohibition. Whoever",
                " is fully convinced that the Qur'an is",
                " the Book of God, that the Prophet",
                " (peace be on him) was designated by",
                " Him, and that God is All-Knowing and",
                " All-Wise, will necessarily commit himself to observe",
                " the restrictions enjoined by God regardless of",
                " whether he is able to grasp the",
                " wisdom underlying them or not. Whoever lacks",
                " this basic conviction will avoid only those",
                " evils which are fully evident to human",
                " beings, and will remain a prey to",
                " all those which have not yet become",
                " apparent but which in fact are intrinsically",
                " harmful.",
                "*14). The things which are prohibited",
                " in this verse fall into the following",
                " categories:",
                "(1) Polytheistic divination, which is a",
                " form of omen-seeking whereby knowledge either about",
                " one's future or about matters beyond human",
                " perception, is sought from gods and goddesses.",
                " The polytheists of Makka had consecrated the",
                " idol Hubal in the Ka'bah for this",
                " purpose. Seven arrows had been placed at",
                " its altars and on each of them",
                " different words and sentences had been inscribed.",
                " Whenever people were faced with the question",
                " whether a certain course was wise or",
                " not, or they wanted to trace something",
                " lost, or sought a judgement in a",
                " murder case, or had other similar problems,",
                " they would approach the oracle of Hubal,",
                " present him with an offering as his",
                " fee, and pray to Hubal to issue",
                " a verdict on the question concerned. Then",
                " the oracle would draw arrows, and the",
                " inscription on the arrow which fell to",
                " a person's lot was deemed to represent",
                " the verdict of Hubal.",
                "(2) Superstitious divination,",
                " which has also been prohibited, means that",
                " instead of deciding the problems of life",
                " in a rational way one should decide",
                " them on fanciful grounds. Or it could",
                " mean deciding matters by arbitrary interpretation of",
                " accidental events, or to have one's future",
                " prophesied by means which have not been",
                " reasonably established as adequate for obtaining knowledge",
                " about the future. This includes geomancy, astrology,",
                " fortune-telling and the numerous other methods adopted",
                " to determine omens.",
                "(3) Games of chance",
                " are also prohibited and include all those",
                " transactions in which what one receives depends",
                " on chance and other purely accidental factors",
                " rather than on rational considerations such as",
                " either due payment or recompense for services",
                " rendered. This applies, for instance, to lotteries",
                " where the holder of an arbitrarily-drawn number",
                " receives a huge amount of money which",
                " has been obtained from thousands of other",
                " people. It also applies to crossword puzzles",
                " were the award of prizes does not",
                " depend on the actual correctness of the",
                " solution (since several correct solutions are possible)",
                " but on accidental conformity with the particular",
                " solution which is arbitrarily chosen as the",
                " only correct one by the sponsors of",
                " the puzzle. After prohibiting each of these",
                " three categories, the only kind of lot-drawing",
                " which Islam permits is that which one",
                " resorts to when obliged to make a",
                " decision either in favour of one of",
                " numerous permissible options or in favour of",
                " one out of two or more equally",
                " legitimate claimants. For instance, two persons have",
                " an equal claim over a thing which",
                " neither of them is prepared to relinquish,",
                " and at the same time there is",
                " no reasonable basis for preferring one to",
                " the other. In such a case, with",
                " the consent of the claimants, the matter",
                " may be settled by drawing lots. The",
                " Prophet (peace be on him) himself used",
                " to resort to drawing lots when he",
                " had to make a decision between two",
                " equal claimants, and when preferring one of",
                " them would cause distress and grievance to",
                " the other. (For such instances see Ahmad",
                " b. Hanbal, Musnad, vol. 4, p. 373;",
                " Bukhari, 'Nikah', 97 and 'Shahadat', 30; Muslim,",
                " 'Fada'il al-Sahabah', 88; Ibn Majah, 'Ahkam', 20,",
                " etc. - Ed.)",
                "*15). 'This day', here,",
                " does not signify a particular day or",
                " specific date. It refers to that period",
                " of time when these verses were revealed.",
                " In our own usage, too, expressions like",
                " 'today' or 'this day' often have the",
                " sense of the 'present time'. 'This day",
                " the unbelievers have fully despaired of your",
                " religion' refers to the fact that the",
                " Muslims' religion had developed into a full-fledged",
                " system of life, reinforced by the authority",
                " and governmental power which it had acquired.",
                " The unbelievers who had hitherto resisted its",
                " establishment now despaired of destroying Islam and",
                " of forcing the believers back to their",
                " former state of Ignorance. The believers therefore",
                " no longer needed to fear men: they",
                " should fear God alone instead. Indeed, the",
                " Muslims were repeatedly asked to fear God,",
                " for they would not be treated lightly",
                " if they failed to carry out His",
                " commands, especially as there was no longer",
                " any justifiable excuse for such failure. If",
                " they still violated the law of God,",
                " there could be no basis for supposing",
                " that they did so under constraint: it",
                " must mean that they simply had no",
                " intention of obeying Him.",
                "*16). The 'perfection",
                " of religion' mentioned in this verse refers",
                " to making it a self-sufficient system of",
                " belief and conduct, and an order of",
                " social life providing its own answers to",
                " the questions with which man is confronted.",
                " This system contains all necessary guidance for",
                " man, either by expounding fundamental principles from",
                " which detailed directives can be deduced or",
                " by spelling out such directives explicitly so",
                " that in no circumstances would one need",
                " to look for guidance to any extraneous",
                " source.",
                "The bounty referred to in the",
                " statement: 'I have bestowed upon you My",
                " bounty in full measure', is the bounty",
                " of true guidance.",
                "The statement: 'I have",
                " been pleased to assign for you Islam",
                " as your religion' means that, since the",
                " Muslims had proved by their conduct and",
                " their striving that they were honest and",
                " sincere about the commitment they had made",
                " to God in embracing Islam - the",
                " commitment to serve and obey Him -",
                " He had accepted their sincerity and created",
                " conditions in which they were no longer",
                " yoked in bondage to anyone but Him.",
                " Thus the Muslims were not prevented from",
                " living in submission to God out of",
                " extraneous constraints just as there were no",
                " constraints preventing them from subscribing to true",
                " beliefs. Having recounted these favours, God does",
                " not point out what should be the",
                " proper response to those favours. But the",
                " implication is obvious: the only appropriate response",
                " on the part of the believers must",
                " be unstinting observance of the law of",
                " God out of gratitude to Him.",
                "According",
                " to authentic traditions this verse was revealed",
                " in 10 A.H. on the occasion of",
                " the Prophet's Farewell Pilgrimage. The context however,",
                " seems to indicate that it was revealed",
                " soon after the conclusion of the Treaty",
                " of Hudaybiyah (i.e. in 6 A.H.). All",
                " parts of the discourse in which this",
                " verse occurs are so tightly interwoven and",
                " so closely inter-connected that it hardly seems",
                " conceivable that it should have been inserted",
                " here several years later. My own estimate",
                " - and true knowledge of this lies",
                " with God alone - is that this",
                " verse was originally revealed in its present",
                " context (i.e. commenting upon the conditions prevailing",
                " at the time of the Treaty of",
                " Hudaybiyah). It is conceivable that the true",
                " significance of the verse was not then",
                " fully appreciated. But later on, when Islam",
                " prevailed over the whole of Arabia and",
                " the power of Islam reached a high",
                " point, God once again revealed this sentence",
                " to His Messenger and ordered him to",
                " proclaim it.",
                "*17). See Towards Understanding the",
                " Qur'an, vol. I, Surah 2, n. 172.",
                ""
            ]
        },
        {
            "id": "[5:4]",
            "verse": "They ask you, [O Muhammad], what has been made lawful for them. Say, \"Lawful for you are [all] good foods and [game caught by] what you have trained of hunting animals which you train as Allah has taught you. So eat of what they catch for you, and mention the name of Allah upon it, and fear Allah.\" Indeed, Allah is swift in account.",
            "description": [
                "There is a certain subtlety in how",
                " the query is answered. Religious- minded people",
                " often fall into a prohibitionist mentality by",
                " tending to regard as unlawful everything not",
                " expressly declared as lawful. This makes them",
                " excessively fastidious and over-suspicious, and inclined to",
                " ask for a complete list of all",
                " that is lawful and permitted. The Qur'an's",
                " response to this question seems to be",
                " aimed, in the first place, at the",
                " reform of this mentality. The questioners want",
                " a list of what is lawful so",
                " they can treat everything else as prohibited,",
                " but the Qur'an provides them with a",
                " list of what is prohibited and then",
                " leaves them with the guiding principle that",
                " all 'clean things' are lawful. This means",
                " a complete reversal of the old religious",
                " outlook according to which everything that has",
                " not been declared lawful is considered prohibited.",
                " This was a great reform, and it",
                " liberated human life from many unnecessary constraints.",
                " Henceforth, except for a few prohibitions, the",
                " lawful domain embraced virtually everything.",
                "The lawfulness",
                " of things has been tied, however, to",
                " the stipulation of their being clean so",
                " that no one can argue for the",
                " lawfulness of things which are unclean. The",
                " question which arises at this point is:",
                " How are we to determine which things",
                " are clean? The answer is that everything",
                " is clean apart from those things which",
                " can be reckoned unclean either according to",
                " any of the principles embodied in the",
                " Law or which are repellent to man's",
                " innate sense of good taste or which",
                " civilized human beings have generally found offensive",
                " to their natural feelings of cleanliness and",
                " decency.",
                "*19).The expression 'hunting animals' signifies hounds,",
                " cheetahs, hawks and all those beasts and",
                " birds which men use in hunting. It",
                " is a characteristic of animals which have",
                " been trained to hunt that they hold",
                " the prey for their masters rather than",
                " devour it. It is for this reason",
                " that while the catch of these trained",
                " animals is lawful, that of others is",
                " prohibited.",
                "There is some disagreement among the",
                " jurists as to the hunting animals whose",
                " catch is lawful. Some jurists are of",
                " the opinion that if the hunting animal,",
                " whether bird or beast, eats any part",
                " of the game, it becomes prohibited since",
                " the act of eating signifies that the",
                " animal hunted for its own sake rather",
                " than for the sake of its master.",
                " This is the doctrine of Shafi'i. Other",
                " jurists hold that the prey is not",
                " rendered unlawful even if the hunting animal",
                " has eaten part of the game; even",
                " if it has devoured one-third of the",
                " animal, the consumption of the remaining two-thirds",
                " is lawful, irrespective of whether the hunting",
                " animal is a bird or a beast.",
                " This is the view of Malik. A",
                " third group of jurists is of the",
                " opinion that if the hunting animal which",
                " has eaten part of the game is",
                " a beast it becomes prohibited, but not",
                " so if the hunting animal is a",
                " bird. The reason for this distinction is",
                " that hunting beasts can be trained to",
                " hold the game for their master whereas",
                " experience shows that hunting birds are not",
                " fully capable of receiving such instruction. This",
                " is the opinion of Abu Hanifah and",
                " his disciples. 'Ali, however, is of the",
                " opinion that it is unlawful to eat",
                " the catch of hunting birds because they",
                " cannot be trained to refrain from eating",
                " the game and to hold it merely",
                " for the sake of their master. (See",
                " the commentaries of Ibn Kathir, Jassas, Ibn",
                " al-'Arabi and Qurtubi on this verse. See",
                " also Ibn Rushd, Bidayat al-Mujtahid, vol. 2,",
                " pp. 440 ff. -Ed.)",
                "*20).They should pronounce",
                " the name of God at the time",
                " of dispatching animals to the hunt. It",
                " is mentioned in a tradition that 'Adi",
                " b. Hatim asked the Prophet (peace be",
                " on him) whether he could use hounds",
                " for hunting. The Prophet (peace be on",
                " him) replied: 'If you have pronounced the",
                " name of God while dispatching your trained",
                " hound, eat what he has caught for,",
                " you. And if it has eaten from",
                " the game, then do not eat for",
                " I fear that the hound had caught",
                " the game for itself.' Then he inquired",
                " what should be done if one had",
                " pronounced the name of God while dispatching",
                " one's own hound, but later found another",
                " hound close to the prey. The Prophet",
                " (peace be on him) replied: 'Do not",
                " eat that, for you have pronounced the",
                " name of God on your own hound,",
                " but not on the other one.' (For",
                " relevant traditions see Bukhari, 'Dhaba'ih', 4, 10;",
                " Ibn Majah, 'Sayd', 3; Ahmad b. Hanbal,",
                " Musnad, vol. 1, p. 231 and vol.",
                " 4, p. 195 - Ed.) The verse",
                " under discussion makes it clear that it",
                " is necessary to pronounce the name of",
                " God while dispatching a hound to the",
                " hunt. If a man later finds the",
                " prey alive he should slaughter it. But",
                " if he does not find it alive",
                " it will still be lawful to eat",
                " it since the name of God has",
                " already been pronounced. The same rule applies",
                " with regard to shooting arrows in hunting.",
                ""
            ]
        },
        {
            "id": "[5:5]",
            "verse": "This day [all] good foods have been made lawful, and the food of those who were given the Scripture is lawful for you and your food is lawful for them. And [lawful in marriage are] chaste women from among the believers and chaste women from among those who were given the Scripture before you, when you have given them their due compensation, desiring chastity, not unlawful sexual intercourse or taking [secret] lovers. And whoever denies the faith - his work has become worthless, and he, in the Hereafter, will be among the losers.",
            "description": [
                "The food of the People of the",
                " Book includes the animals slaughtered by them.",
                " The rule that 'our food is lawful",
                " to them and theirs lawful to us'",
                " signifies that there need be no barriers",
                " between us and the People of the",
                " Book regarding food. We may eat with",
                " them and they with us. But this",
                " general proclamation of permission is preceded by",
                " a reiteration of the statement: 'All good",
                " things have been made lawful to you.'",
                " This indicates that if the People of",
                " the Book either do not observe those",
                " principles of cleanliness and purity which are",
                " considered obligatory by the Law or if",
                " their food includes prohibited items, then one",
                " should abstain from eating them. If, for",
                " instance, they either slaughter an animal without",
                " pronouncing the name of God or if",
                " they slaughter it in the name of",
                " anyone else but God it is not",
                " lawful for us to eat that animal.",
                " Likewise, if intoxicating drinks, the flesh of",
                " swine, and any other prohibited thing is",
                " found on their dining table we may",
                " not justify our partaking of such items",
                " on the ground that the persons concerned",
                " are People of the Book.",
                "The same",
                " applies to those non-Muslims who are not",
                " People of the Book, except for one",
                " difference - that whereas the animals slaughtered",
                " by the People of the Book are",
                " lawful provided they have pronounced the name",
                " of God at the time of slaughtering",
                " them, we are not permitted to eat",
                " the animals killed by non-Muslims who are",
                " not People of the Book.",
                "*22).This expression",
                " signifies the Jews and the Christians. Of",
                " non-Muslim women, Muslims may marry only Christians",
                " and Jews, and of them only those",
                " who have been characterized as muhsanat (i.e.",
                " 'well-protected women').",
                "There are differences among jurists",
                " as to the detailed application of this",
                " rule. The view of Ibn 'Abbas is",
                " that the expression 'People of the Book'",
                " here signifies only those People of the",
                " Book who are subjects of the Domain",
                " of Islam (Dar al-Islam). It is also",
                " unlawful to marry Jewish and Christian women",
                " who are either living in the Domain",
                " of War (Dar al-Harb) or in the",
                " Domain of Disbelief (Dar al-Kufr). The Hanafi",
                " jurists hold a slightly different opinion. Although",
                " they disapprove of marrying such women, it",
                " is not considered unlawful. Sa'id b. al-Musayyib",
                " and Hasan al-Basri are of the opinion",
                " that the verse warrants general application and",
                " hence there is no need to differentiate",
                " between those who are ahl al-Dhimmah (the",
                " non-Muslim subjects of the Islamic State) and",
                " those who are not.",
                "There is also",
                " disagreement among the jurists about the connotation",
                " of the term muhsanat. 'Umar considered this",
                " word to signify only those women who",
                " are chaste and possess good moral character,",
                " and hence ahl al-Kitab women who are",
                " of loose character are excluded from this",
                " permission. This is also the opinion of",
                " Hasan al-Basri, Sha'bi and Ibrahim al-Nakha'i and",
                " of the Hanafi jurists. But Shafi'i considers",
                " this expression to have been used as",
                " an antonym of 'slave women', and hence",
                " it signifies all those ahl al-Kitab women",
                " who are not slaves. (Cf. the commentaries",
                " of Ibn Kathir, Ibn al-'Arabi and Qurtubi",
                " - Ed.)",
                "*23).The declaration that marriage to",
                " ahl al-Kitab women is permitted is immediately",
                " followed by this warning which, in effect,",
                " means that those who avail themselves of",
                " this permission ought to be mindful of",
                " their faith and morals. They are urged",
                " to beware of infatuation with disbelieving women",
                " lest they also become enamoured of the",
                " ideas and beliefs which they cherish, thereby",
                " allowing their faith to dissipate. They are",
                " warned against adopting social patterns and modes",
                " of conduct inconsistent with the true requirements",
                " of their faith."
            ]
        },
        {
            "id": "[5:6]",
            "verse": "O you who have believed, when you rise to [perform] prayer, wash your faces and your forearms to the elbows and wipe over your heads and wash your feet to the ankles. And if you are in a state of janabah, then purify yourselves. But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful.",
            "description": [
                "The explanation of this injunction by the",
                " Prophet (peace be on him) indicates that",
                " washing of the face includes rinsing one's",
                " mouth and inhaling water into the nostrils.",
                " Unless this is done the washing of",
                " the face is not considered complete. Likewise,",
                " since the ears are part of the",
                " head, 'wiping the head' includes wiping one's",
                " hands over the external and internal parts",
                " of the ears as well. Moreover, before",
                " starting to wash the other parts one",
                " should first wash one's hands so that",
                " the instruments of washing are themselves clean.",
                "",
                "*25). Janabah (the state of major ritual",
                " impurity) - whether caused by the sexual",
                " act or merely by seminal discharge -",
                " renders it unlawful to perform the ritual",
                " Prayer and to touch the Qur'an (for",
                " further details see Surah 4, nn. 67-9",
                " above).",
                "*26). For explanation see Surah 4,",
                " nn. 69-70 above.",
                "*27). Just as purity",
                " of the soul is a blessing, so",
                " is cleanliness of the body. God's favour",
                " to man can be completed only when",
                " he has received comprehensive direction in respect",
                " of both spiritual purity and physical cleanliness.",
                ""
            ]
        },
        {
            "id": "[5:7]",
            "verse": "And remember the favor of Allah upon you and His covenant with which He bound you when you said, \"We hear and we obey\"; and fear Allah. Indeed, Allah is Knowing of that within the breasts.",
            "description": [
                "The 'favour' mentioned here denotes illuminating the",
                " Straight Way, and entrusting to the believers",
                " the task of guidance and leadership of",
                " the whole world."
            ]
        },
        {
            "id": "[5:8]",
            "verse": "O you who have believed, be persistently standing firm for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness. And fear Allah; indeed, Allah is Acquainted with what you do.",
            "description": [
                "See Surah 4, nn. 164-5 above."
            ]
        },
        {
            "id": "[5:9]",
            "verse": "Allah has promised those who believe and do righteous deeds [that] for them there is forgiveness and great reward.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:10]",
            "verse": "But those who disbelieve and deny Our signs - those are the companions of Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:11]",
            "verse": "O you who have believed, remember the favor of Allah upon you when a people determined to extend their hands [in aggression] against you, but He withheld their hands from you; and fear Allah. And upon Allah let the believers rely.",
            "description": [
                "This alludes to the incident reported by",
                " Ibn 'Abbas when a group of Jews",
                " invited the Prophet (peace be on him)",
                " and a number of his close Companions",
                " to dinner. They had in fact hatched",
                " a plot to pounce upon the guests",
                " and thus undermine the very foundation of",
                " Islam. But by the grace of God",
                " the Prophet (peace be on him) came",
                " to know of the plot at the",
                " eleventh hour and did not go. Since",
                " the following section is addressed to the",
                " Children of Israel, this incident is alluded",
                " to here in order to mark the",
                " transition to a new subject.",
                "The discourse",
                " which begins here has two purposes. The",
                " first is to warn the Muslims against",
                " following the ways of their predecessors, the",
                " People of the Book. The Muslims are",
                " told, therefore, that the Israelites and the",
                " followers of Jesus had made a covenant",
                " with God in the past, in the",
                " manner that the Muslims had recently done",
                " so. The Muslims should, therefore, take heed",
                " lest they also break their covenant and",
                " fall a prey to error and misguidance",
                " as their predecessors had done.",
                "The second",
                " is to sensitize the Jews and Christians",
                " to the errors they have committed and",
                " invite them to the true religion."
            ]
        },
        {
            "id": "[5:12]",
            "verse": "And Allah had already taken a covenant from the Children of Israel, and We delegated from among them twelve leaders. And Allah said, \"I am with you. If you establish prayer and give zakah and believe in My messengers and support them and loan Allah a goodly loan, I will surely remove from you your misdeeds and admit you to gardens beneath which rivers flow. But whoever of you disbelieves after that has certainly strayed from the soundness of the way.\"",
            "description": [
                "The word naqib in Arabic denotes supervisor",
                " and censor. There were twelve tribes among",
                " the Israelites and each tribe was required",
                " to appoint one of its members as",
                " a naqib, to look after their affairs",
                " and try to prevent them from becoming",
                " victims of irreligiousness and moral corruption. Although",
                " the Book of Numbers in the Bible",
                " does mention these twelve men, it does",
                " not seem to convey the sense of",
                " their being religious and moral mentors, as",
                " the term naqib employed by the Qur'an",
                " does. The Bible simply mentions them as",
                " the chiefs and dignitaries of their tribes.",
                "",
                "*32). The assurance of God's support is",
                " made conditional upon their continuous response to",
                " the call of God and for support",
                " of His Prophets.",
                "*33). This expression signifies",
                " spending one's wealth for the sake of",
                " God. Since God has promised to return",
                " to man every penny that he spends",
                " in His way along with His reward,",
                " which will be several-fold, the Qur'an characterizes",
                " this spending as a loan to God.",
                " This spending is considered a loan provided",
                " it is a 'good loan', that is,",
                " provided the money spent in the cause",
                " of God has been acquired by legitimate",
                " means and has been spent in accordance",
                " with the laws of God and with",
                " sincerity and earnestness.",
                "*34). To efface someone's",
                " evil deeds signifies two things. First, that",
                " if a man decides to follow the",
                " Straight Path and strives to follow God's",
                " directives in both thought and action his",
                " soul will be purged of many evils",
                " and his way of life will gradually",
                " become free of corruption. Second, if, in",
                " spite of this reform, weaknesses still persist",
                " in a man's life he is assured",
                " that God will not punish him and",
                " will have his failing erased from his",
                " record. For God is not too exacting",
                " over trivial errors, providing a man has",
                " sincerely accepted the basic guidance and reformed",
                " his character.",
                "*35). That is, they once",
                " found the 'right way' and then allowed",
                " it to be lost and thus put",
                " themselves on the road to perdition. We",
                " have translated the Qur'anic expression 'sawa' al-sabil'",
                " as the 'right way' for the sake",
                " of brevity. A better rendering could be,",
                " 'the highroad of balance and moderation', but",
                " even this would fail to bring out",
                " the meaning fully.",
                "In order to grasp",
                " the full significance of what is being",
                " said here one should bear in mind",
                " that in himself man constitutes a microcosm",
                " of society. He has innumerable powers and",
                " potentialities, myriad desires, feelings and inclinations, and",
                " a host of divergent urges. Social life",
                " consists of a huge network of complex",
                " relationships, and with the growth of civilization",
                " and culture the complexity of these relationships",
                " increases. There is also a rich fund",
                " of resources in the world and there",
                " are countless possibilities for their utilization; as",
                " a result, man is confronted with a",
                " plethora of choices and problems.",
                "The fact",
                " that man has inherent limitations means that",
                " he is incapable of viewing in one",
                " sweep and in a balanced way the",
                " entire span of existence. Hence, man is",
                " in no position to prescribe for his",
                " kind a judicious way of life -",
                " a way of life wherein justice is",
                " done to all his powers and capacities;",
                " in which a wholesome balance is maintained",
                " between all his inherent potentialities; in which",
                " all his urges are given their due;",
                " in which his two-fold need for inner",
                " satisfaction and external self-realization is fully met;",
                " in which various aspects of human life",
                " are taken into proper consideration, giving birth",
                " to an integrated scheme with a built-in",
                " capacity to harmonize the multifarious strains and",
                " stresses of social life; in which material",
                " resources are fully exploited in the best",
                " interests of both the individual and society",
                " and within the framework of equity, justice",
                " and righteousness. When man takes upon himself",
                " the task of prescribing the guidelines for",
                " his life and becomes his own law-maker,",
                " his mind tends to become preoccupied with",
                " one specific aspect of human life, with",
                " one of the numerous demands of his",
                " nature, with one of the myriad problems",
                " calling for solution. His mental involvement is",
                " liable to be so intense that he",
                " adopts - consciously or otherwise - an",
                " unjust attitude towards all the other aspects,",
                " requirements and problems of human life. Consequently,",
                " when such opinions are imposed, the balance",
                " which ought to prevail in man's life",
                " is disrupted and he begins to swing",
                " either towards one extreme or the other.",
                " Gradually, this deviation assumes intolerable proportions. A",
                " reaction sets in, and justice is demanded",
                " for the neglected aspects of human life.",
                " Still, human life remains deprived of justice.",
                " The reason for this failure is that",
                " man's reaction to imbalance is itself devoid",
                " of balance. The new dispensation in turn",
                " persists in excessive preoccupation with either one",
                " specific aspect, problem or requirement of human",
                " life at the expense of all the",
                " others. Thus human life is denied judicious",
                " and balanced progress. Man continues to stumble",
                " hither and thither; from one form of",
                " self-destruction to another. All courses of life",
                " charted by man himself are winding and",
                " crooked. They move in the wrong direction,",
                " reach the wrong end and then turn",
                " back in another wrong direction.",
                "Among these",
                " numerous ways - all false - there",
                " is just one way that lies exactly",
                " in the middle. This way alone does",
                " full justice to all of man's various",
                " potentialities and urges, to all his instincts",
                " and predispositions, to all the multifarious claims",
                " of both the body and the spirit;",
                " in short, to all aspects of his",
                " life. In this way there is no",
                " crookedness; it is the one course of",
                " life in which nothing is given either",
                " too much consideration or too little, and",
                " nothing suffers inequity and injustice. Man's very",
                " nature thirsts for such a way, and",
                " the succession of revolts against false ways",
                " of life is merely a manifestation of",
                " his constant quest for this right and",
                " straight way. Left to himself, man is",
                " incapable of charting this way. It is",
                " God alone Who can direct him to",
                " it; and indeed the Prophets were sent",
                " for this very purpose.",
                "The Qur'an designates",
                " this way as sawa al-sabil ('the right",
                " way') in the present verse and elsewhere",
                " as al-sirat al-mustaqim ('the straight way'). (See",
                " Towards Understanding the Qur'an, vol. I, Surah",
                " 1, verse 5, and n. 8.) This",
                " is the road which goes amidst the",
                " countless winding and crooked paths of life;",
                " the road which leads man, disregarding all",
                " the curved and crooked paths, straight on",
                " to his success, right from this world",
                " to the Hereafter. Whoever goes along it",
                " enjoys rectitude in this world and success",
                " and felicity in the Next, but whoever",
                " loses this road is bound to become",
                " a victim of false beliefs and false",
                " ways of conduct and thus comes to",
                " have a wrong orientation in life. This",
                " will lead him to Hell, where all",
                " bent and crooked paths end. The following",
                " illustrates man's dilemma.",
                "In modern times some",
                " philosophers have been so impressed by this",
                " constant swinging in human life, from one",
                " extreme to another, as to have mistakenly",
                " argued that the dialectical process is the",
                " natural course of human life. They conclude,",
                " therefore, that the only way for human",
                " life to progress is that a thesis",
                " should first swing it in one direction,",
                " and then an antithesis swing it in",
                " the opposite direction, after which there will",
                " emerge a synthesis which constitutes the course",
                " of human progress. These curved lines from",
                " one extreme to the other do not",
                " indicate the correct course of human progress.",
                " Rather they represent the tragic stumblings which",
                " again and again obstruct the true progress",
                " of human life. Every extreme thesis sets",
                " life on a certain course and continues",
                " to pull it in that direction for",
                " some time. When human life is thus",
                " thrown off its 'right course' the result",
                " is that certain realities of life -",
                " which had not received their due -",
                " rise up in revolt, and this revolt",
                " often assumes the form of an antithesis.",
                " This revolt begins to pull life in",
                " the opposite direction. As the 'right way'",
                " is approached the conflicting ideas - the",
                " thesis and antithesis - begin to effect",
                " some kind of mutual compromise, leading to",
                " the emergence of a synthesis. This synthesis",
                " comprises many elements conducive to the good",
                " of mankind. But since societies which do",
                " not submit to the guidance of the",
                " Prophets are deprived both of the signposts",
                " that might indicate the 'right way' and",
                " of faith to help steady man's feet",
                " thereon this synthesis does not permit human",
                " life to maintain the golden mean. Its",
                " momentum is so powerful that it once",
                " more pushes life to the opposite extreme.",
                " At this point, certain realities are once",
                " again denied their due, with the result",
                " that another antithesis emerges in reaction to",
                " the iniquities of the earlier ideology. Had",
                " the light of the Qur'an been available",
                " to these short-sighted philosophers, and had they",
                " been able to perceive the 'right way'",
                " envisaged by the Qur'an, they would have",
                " realized that this was the true course",
                " of human progress."
            ]
        },
        {
            "id": "[5:13]",
            "verse": "So for their breaking of the covenant We cursed them and made their hearts hard. They distort words from their [proper] usages and have forgotten a portion of that of which they were reminded. And you will still observe deceit among them, except a few of them. But pardon them and overlook [their misdeeds]. Indeed, Allah loves the doers of good.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:14]",
            "verse": "And from those who say, \"We are Christians\" We took their covenant; but they forgot a portion of that of which they were reminded. So We caused among them animosity and hatred until the Day of Resurrection. And Allah is going to inform them about what they used to do.",
            "description": [
                "Some are of the opinion that the",
                " word Nasara (meaning Christians) is derived from",
                " Nasirah (Nazareth), the birth-place of the Messiah.",
                " In fact this word is not derived",
                " from Nasirah (Nazareth) but from the word",
                " nusrah, and the basis of this derivation",
                " is the question posed by the Messiah",
                " to his disciples: 'Who are my supporters",
                " (ansari) in the way of God?' In",
                " response to this they had said: 'We",
                " are the supporters (ansar) (in the way)",
                " of God.' Christian authors have been misled",
                " by the resemblance between the words Nasirah",
                " and Nasara into believing that the name",
                " of the sect founded in the early",
                " history of Christianity, and contemptuously characterized as",
                " either Nazarenes or Ebonites served as the",
                " basis of the Qur'anic designation of the",
                " Christians. But here the Qur'ijo categorically states",
                " that they had declared that they were",
                " 'Nasara' and it is obvious that the",
                " Christians never called themselves 'Nazarenes'.",
                "In this",
                " connection it should be recalled that Jesus",
                " never called his followers 'Christians' for he",
                " had not come to found a new",
                " religion named after him. His mission was",
                " to revive the religion of Moses and",
                " of all the Prophets who preceded him",
                " as well as of the one who",
                " was to appear after him. Hence, he",
                " neither formed any cult divorced from the",
                " Israelites and the followers of the Mosaic",
                " Law nor designated his followers by any",
                " distinctive name. Likewise, his early followers neither",
                " considered themselves to be separate from the",
                " Israelite community nor developed into an independent",
                " group nor adopted any distinctive symbol and",
                " name. They worshipped in the temple of",
                " Jerusalem along with other Jews and considered",
                " themselves to be followers of the Mosaic",
                " Law (see Acts 3:1-10; 21: 14-15,21). Later",
                " on the process of alienation began to",
                " operate on both sides. On the one",
                " hand, Paul, one of the followers of",
                " Jesus, declared independence from the Mosaic Law",
                " holding that faith in Christ was all",
                " that one needed for salvation. On the",
                " other hand, the Jewish rabbis declared the",
                " followers of Christ to be heretics and",
                " excommunicated them. Despite this, for some time",
                " the new sect had no distinct appellation",
                " of its own. The followers of Christ",
                " variously described themselves as 'disciples', as 'brethren',",
                " as 'those who believed', and as 'saints'",
                " (see Acts 2: 44; 4: 32; 9:",
                " 26; 11: 29; 13: 52; 15: 1;",
                " 23: 1 and Romans 15: 25 and",
                " Colossians 1: 2). The Jews sometimes designated",
                " them as 'Galileans' and as 'the sect",
                " of Nazarenes' (see Acts 24: 5; Luke",
                " 13: 2). These nicknames, which were originally",
                " contrived in,.ojder to ridicule them, referred to",
                " Nazareth, the home town of Jesus in",
                " the district of Galilee. These names, however,",
                " did not gain sufficient popularity to become",
                " the permanent names of the followers of",
                " Christ. They were called 'Christians' for the",
                " first time by the people of Antioch",
                " in 43 A.D. or 44 A.D. when",
                " Paul and Barnabas went there and began",
                " to preach their religion (Acts 11: 26).",
                " This appellation was flung at them by",
                " the opponents of the followers of Christ",
                " precisely in order to tease them by",
                " using an appellation which was unacceptable to",
                " them. But when their enemies began to",
                " call them consistently by this name their",
                " leaders reacted by saying that if they",
                " were called Christians because of their allegiance",
                " to Christ they had no reason to",
                " be ashamed of it (1 Peter 4:",
                " 16). It was thus that the followers",
                " of Christ also gradually began to call",
                " themselves by the same name which had",
                " originally been conferred upon them sarcastically. In",
                " the course of time the Christians ceased",
                " to realize that theirs had originally been",
                " a derogatory appellation chosen for them by",
                " outsiders rather than by themselves.",
                "The Qur'an,",
                " therefore, does not refer to the followers",
                " of Christ as Christians. It reminds them",
                " rather that they belong to those who",
                " responded to the query of Jesus: 'Who",
                " are my supporters (ansari) in the way",
                " of God?' by saying that they were",
                " his ansar (supporters) in God's cause. (See",
                " Surah al-Saff 61: 14 - Ed.) It",
                " is an irony of fate that far",
                " from feeling grateful at being referred to",
                " by a dignified appellation Christian missionaries take",
                " offence at the fact that the Qur'an",
                " designates them as Nasara rather than as",
                " 'Christians'."
            ]
        },
        {
            "id": "[5:15]",
            "verse": "O People of the Scripture, there has come to you Our Messenger making clear to you much of what you used to conceal of the Scripture and overlooking much. There has come to you from Allah a light and a clear Book.",
            "description": [
                "God discloses some of the dishonest and",
                " treacherous dealings of theirs where He deems",
                " it necessary in order to strengthen the",
                " cause of the true religion, and ignores",
                " the disclosure of those which are not",
                " truly indispensable."
            ]
        },
        {
            "id": "[5:16]",
            "verse": "By which Allah guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path.",
            "description": [
                "The word 'safety' here denotes safety from",
                " false perception and outlook, safety from misdeeds",
                " and their consequences. Whoever seeks guidance from",
                " the Book of God and from the",
                " example of the Messenger (peace be on",
                " him) can find out how to keep",
                " himself safe from errors at each of",
                " life's crossroads."
            ]
        },
        {
            "id": "[5:17]",
            "verse": "They have certainly disbelieved who say that Allah is Christ, the son of Mary. Say, \"Then who could prevent Allah at all if He had intended to destroy Christ, the son of Mary, or his mother or everyone on the earth?\" And to Allah belongs the dominion of the heavens and the earth and whatever is between them. He creates what He wills, and Allah is over all things competent.",
            "description": [
                "The original mistake committed by the Christians",
                " in declaring Jesus to be a combination",
                " of human and divine essences turned Jesus",
                " into a mystery for them, and the",
                " more the Christian scholars tried to solve",
                " this mystery by resorting to conjecture and",
                " rhetorical extravagance the more involved the whole",
                " matter became. Those who were more impressed",
                " by the humanity of Jesus stressed his",
                " being the son of God and considered",
                " him to be one of the three",
                " gods. Those who were more impressed by",
                " the divinity of Jesus considered him to",
                " be none other than God, stressing that",
                " he was the human incarnation of God,",
                " and worshipped him as God. Those who",
                " tried to strike a middle path spent",
                " all their efforts hammering out subtle verbal",
                " formulations of the Trinity that would allow",
                " people to consider the Messiah to be",
                " God and man at one and the",
                " same time, to affirm that God and",
                " the Messiah are independent and simultaneously constitute",
                " an inseparable whole (see Surah 4, nn.",
                " 212, 213, 215 above).",
                "*40). This statement",
                " hints at the childishness of those who",
                " have been misled into believing that the",
                " Messiah himself is God either because of",
                " his miraculous birth or because of his",
                " flawless moral character or because of the",
                " miracles which he performed. The Messiah is",
                " merely a sign of the innumerable wonders",
                " of God's creation; a sign which somehow",
                " dazzled the eyes of those superficial people.",
                " Had their perception been wider they would",
                " have been able to see that there",
                " are even more inspiring examples of His",
                " creation and infinite power. If anything their",
                " attitude was indicative of the intellectual puerility",
                " of those who were so overawed by",
                " the excellence of a creature as to",
                " mistake him for the Creator. Those whose",
                " intelligence penetrates through the excellence of creatures,",
                " who look upon them merely as signs",
                " of the magnificent power of God, and",
                " who are led by such observations to",
                " a reinforcement of faith in the Creator",
                " are truly wise."
            ]
        },
        {
            "id": "[5:18]",
            "verse": "But the Jews and the Christians say, \"We are the children of Allah and His beloved.\" Say, \"Then why does He punish you for your sins?\" Rather, you are human beings from among those He has created. He forgives whom He wills, and He punishes whom He wills. And to Allah belongs the dominion of the heavens and the earth and whatever is between them, and to Him is the [final] destination.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:19]",
            "verse": "O People of the Scripture, there has come to you Our Messenger to make clear to you [the religion] after a period [of suspension] of messengers, lest you say, \"There came not to us any bringer of good tidings or a warner.\" But there has come to you a bringer of good tidings and a warner. And Allah is over all things competent.",
            "description": [
                "In the present context this sentence is",
                " extremely eloquent and subtle. It signifies that",
                " the same God who had sent warners",
                " and bearers of glad tidings to men",
                " in the past has now sent Muhammad",
                " (peace be on him) with the same",
                " task. At the same time it also",
                " means that they {should not treat the",
                " message of this warner and bearer of",
                " glad tidings lightly. They should bear in",
                " mind that if they disregard the injunctions",
                " of God, He can chastise them as",
                " He wills, for He is All-Powerful and",
                " All-Mighty."
            ]
        },
        {
            "id": "[5:20]",
            "verse": "And [mention, O Muhammad], when Moses said to his people, \"O my people, remember the favor of Allah upon you when He appointed among you prophets and made you possessors and gave you that which He had not given anyone among the worlds.",
            "description": [
                "This refers to the glory the Israelites",
                " enjoyed before the time of Moses. There",
                " had appeared among them such great Prophets",
                " as Abraham, Isaac, Jacob and Joseph. Moreover,",
                " from the time of Joseph they were",
                " able to achieve very considerable power and",
                " authority in Egypt. For a considerable period",
                " they were the greatest rulers of the",
                " civilized world, reigning supreme in Egypt and",
                " the surrounding territories. People are generally inclined",
                " to regard the time of Moses as",
                " the starting point for the rise of",
                " the Israelites. The Qur'an, however, states categorically",
                " that the truly glorious period of their",
                " history had passed long before Moses, and",
                " that Moses himself drew the attention of",
                " his people to that period as their",
                " time of glory."
            ]
        },
        {
            "id": "[5:21]",
            "verse": "O my people, enter the Holy Land which Allah has assigned to you and do not turn back [from fighting in Allah 's cause] and [thus] become losers.\"",
            "description": [
                "This signifies Palestine which had been the",
                " homeland of Abraham, Isaac and Jacob. After",
                " their exodus from Egypt, God ordered the",
                " Israelites to go forth to Egypt and",
                " conquer it.",
                "*44). This statement of Moses",
                " refers to the second year after they",
                " had come out of Egypt when he",
                " and his people lived in tents in",
                " the wilderness of Paran. This desert lies",
                " in the Sinai peninsula adjacent to the",
                " northern borders of Arabia and the southern",
                " borders of Palestine."
            ]
        },
        {
            "id": "[5:22]",
            "verse": "They said, \"O Moses, indeed within it is a people of tyrannical strength, and indeed, we will never enter it until they leave it; but if they leave it, then we will enter.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:23]",
            "verse": "Said two men from those who feared [to disobey] upon whom Allah had bestowed favor, \"Enter upon them through the gate, for when you have entered it, you will be predominant. And upon Allah rely, if you should be believers.\"",
            "description": [
                "This could have two meanings: either that",
                " two of those who feared the high-handed",
                " people of the Promised Land made that",
                " statement or that two of those who",
                " feared God did so. (However, most Qur'anic",
                " commentators subscribe to the latter meaning -",
                " Ed.)"
            ]
        },
        {
            "id": "[5:24]",
            "verse": "They said, \"O Moses, indeed we will not enter it, ever, as long as they are within it; so go, you and your Lord, and fight. Indeed, we are remaining right here.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:25]",
            "verse": "[Moses] said, \"My Lord, indeed I do not possess except myself and my brother, so part us from the defiantly disobedient people.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:26]",
            "verse": "[Allah] said, \"Then indeed, it is forbidden to them for forty years [in which] they will wander throughout the land. So do not grieve over the defiantly disobedient people.\"",
            "description": [
                "The details of this incident are found",
                " in the Bible in Numbers, Deuteronomy and",
                " Joshua. The essence of the story is",
                " that Moses sent twelve heads of Israel",
                " to spy out Palestine. They returned after",
                " forty days and said: 'We came to",
                " the land to which you sent us;",
                " it flows with milk and honey. Yet",
                " the people who dwell in the land",
                " are strong, and the cities are fortified",
                " and very large; and besides, we saw",
                " the descendants of Anak there . .",
                " . and all the people that we",
                " saw in it are men of great",
                " stature. And there we saw the Nephilim",
                " (the sons of Anak, who come from",
                " the Nephilim); and we seemed to ourselves",
                " like grasshoppers, and so we seemed to",
                " them.' Then all the congregation cried out:",
                " 'Would that we had died in the",
                " land of Egypt; or would that we",
                " had died in this wilderness; why does",
                " the Lord bring us into this land,",
                " to fall by the sword? Our wives",
                " and our little ones will become a",
                " prey; would it not be better for",
                " us to go back to Egypt?' At",
                " this they were censured for cowardice by",
                " two of the twelve heads who had",
                " spied out Palestine, Joshua and Caleb. Caleb",
                " suggested that they should go and seize",
                " Palestine. Then both of them said: 'If",
                " the Lord delights in us, He will",
                " bring us into this land and give",
                " it to us, a land which flows",
                " with milk and honey. Only do not",
                " rebel against the Lord; and do not",
                " fear the people of the land ...",
                " for the Lord is with us; do",
                " not fear them' (Numbers 14: 1-9). But",
                " the congregation responded to this by crying",
                " out that both ought to be stoned.",
                " This so provoked the wrath of God",
                " that He commanded that their bodies would",
                " fall dead in the wilderness and that",
                " of all their numbers numbered from twenty",
                " years old and upward, who had murmured",
                " against Him, none would come into the",
                " promised land except Caleb and Joshua; that",
                " only after an entire generation had passed",
                " away and a new generation had sprung",
                " up would they be enabled to conquer",
                " Palestine. Because of this divine decree, it",
                " took the people of Israel thirty-eight years",
                " to reach Transjordan from Paran. During this",
                " period all those who had left Egypt",
                " in their youth had perished. After the",
                " conquest of Transjordan Moses died (Ibid., 14:",
                " 10 ff.).",
                " WANDERINGS OF THE ISRAELITES IN",
                " THE SINAI PENINSULA",
                "The Prophet Moses (peace",
                " be on him) led the Israelites out",
                " of Egypt and brought them to Mount",
                " Sinai by way of Marah, Elim and",
                " Rephaim in the Sinai Peninsula. Here he",
                " stayed for a little over a year",
                " and received most of the Commandments of",
                " the Torah. Then he was commanded to",
                " lead the Israelites towards Palestine and conquer",
                " it, for that land was to be",
                " given to them as an inheritance. So,",
                " he led them through Taberah and Nazareth",
                " and came to the desert of Paran",
                " from where he despatched a deputation of",
                " prominent Israelites to spy out Palestine. The",
                " deputation returned after forty days and made",
                " their report at Kadesh. Except for the",
                " encouraging picture presented by Joshua and Caleb,",
                " the report made by the other members",
                " was so disappointing that the Israelites cried",
                " out in disgust and refused to march",
                " on to Palestine. Thereupon God decreed that",
                " they would wander for forty years in",
                " the wilderness and none of their older",
                " generation except Joshua and Caleb would see",
                " Palestine. Thus, the Israelites wandered homeless in",
                " the wilderness of Paran, Shur and Zin,",
                " fighting and struggling against the Amalekites, the",
                " Amorites, the Edomites, the Midianites and the",
                " Moabites. When the forty years was about",
                " to end, the Prophet Aaron (peace be",
                " on him) died in Mount Hor, near",
                " the border of Edom. At about this",
                " time the Prophet Moses (peace be on",
                " him) entered Moab at the head of",
                " the Israelites, conquered the whole area and",
                " reached Heshbon and Shittim. After him Joshua,",
                " his first successor, crossed the River Jordan",
                " from the east and captured Jericho, the",
                " first Palestinian city to fall to the",
                " Israelites. Later on the whole of Palestine",
                " was conquered by them within a short",
                " period.",
                "Ailah (present-day Aqaba) on this map",
                " is the place where probably the well-known",
                " incident of the Sabbath-breakers, as mentioned in",
                " Surah al-Baqarah 2: 65 and Surah al-A'raf",
                " 7: 166, took place.",
                "Later on during",
                " the caliphate* (sic) of Joshua the Israelites",
                " became capable of conquering Palestine.",
                "*47). The",
                " purpose of referring to this event becomes",
                " clear if we reflect upon the context.",
                " It seems to be to bring home",
                " to the Israelites that the punishment to",
                " which they would be subjected if they",
                " adopted a rebellious attitude towards Muhammad (peace",
                " be on him) would be even more",
                " severe than the .one to which they",
                " had been subjected in the time of",
                " Moses."
            ]
        },
        {
            "id": "[5:27]",
            "verse": "And recite to them the story of Adam's two sons, in truth, when they both offered a sacrifice [to Allah], and it was accepted from one of them but was not accepted from the other. Said [the latter], \"I will surely kill you.\" Said [the former], \"Indeed, Allah only accepts from the righteous [who fear Him].",
            "description": [
                "God's refusal to accept the sacrifice of",
                " one of the two brothers was not",
                " due to any wrong the other brother",
                " might have committed but to his own",
                " lack of piety. Hence, rather than attempt",
                " to kill his brother he should be",
                " concerned with cultivating piety."
            ]
        },
        {
            "id": "[5:28]",
            "verse": "If you should raise your hand against me to kill me - I shall not raise my hand against you to kill you. Indeed, I fear Allah, Lord of the worlds.",
            "description": [
                "This does not mean, that his brother",
                " assured him that when the latter stepped",
                " forward to kill him he would keep",
                " his hands tied and stretch out his",
                " own neck to be cut down rather",
                " than defend himself. What this statement amounts",
                " to is an assurance on the part",
                " of the first brother that, even though",
                " the other was intent on killing him,",
                " he himself had no such intention. In",
                " other words, he assured his brother that",
                " even though the latter was busy planning",
                " his murder he would not take the",
                " initiative in killing him despite his knowledge",
                " of the latter's intent.",
                "*In view of",
                " the fact that the followers of all",
                " the Prophets are Muslims, the author has",
                " used a peculiarly Islamic term - caliphate,",
                " rather than kingship, etc. - to signify",
                " the predominantly religious (or shall we say,",
                " Islamic) quality of his rule and to",
                " distinguish it from systems of government not",
                " animated by the religious spirit - Ed.",
                "",
                "Righteousness does not demand at all that",
                " when a man is subjected to wrongful",
                " aggression he should surrender to the aggressor",
                " rather than defend himself. Righteousness, however, demands",
                " that a man should not take the",
                " initiative and try to kill someone even",
                " though he knows him to be bent",
                " on killing him. He should rather wait",
                " for the act of aggression to be",
                " initiated by the other person. And this",
                " is exactly what was intended by the",
                " statement of the righteous son of Adam.",
                ""
            ]
        },
        {
            "id": "[5:29]",
            "verse": "Indeed I want you to obtain [thereby] my sin and your sin so you will be among the companions of the Fire. And that is the recompense of wrongdoers.\"",
            "description": [
                "The righteous son of Adam told his",
                " brother that rather than both of them",
                " becoming sinners by trying to kill each",
                " other, he would prefer to see the",
                " entire sin fall on the lot of",
                " the one who was intent on the",
                " murder - the sin of the aggressor's",
                " attempt to murder, as well as the",
                " sin of any injury that might be",
                " inflicted on him in self-defence."
            ]
        },
        {
            "id": "[5:30]",
            "verse": "And his soul permitted to him the murder of his brother, so he killed him and became among the losers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:31]",
            "verse": "Then Allah sent a crow searching in the ground to show him how to hide the disgrace of his brother. He said, \"O woe to me! Have I failed to be like this crow and hide the body of my brother?\" And he became of the regretful.",
            "description": [
                "In this way God made this errant",
                " son of Adam realize his ignorance and",
                " folly. Once his attention turned to self-appraisal,",
                " his regret was not confined to realizing",
                " that in his effort to hide his",
                " brother's corpse he proved to be even",
                " less efficient than the raven. He also",
                " began to feel how foolish he was",
                " to have killed his own brother. The",
                " later part of the sentence indicates this",
                " remorse.",
                "*52).The purpose of mentioning this particular",
                " incident is to reproach the Jews subtly",
                " for the plot they had hatched to",
                " assassinate the Prophet (peace be on him)",
                " and some of his illustrious Companions (see",
                " n. 30 above). The resemblance between the",
                " two incidents is evident. God honoured some",
                " of the illiterate people of Arabia and",
                " disregarded the ancient People of the Book",
                " because the former were pious while the",
                " latter were not. But rather than reflect",
                " upon the causes of their rejection by",
                " God, and do something to overcome the",
                " failings which had led to that rejection,",
                " the Israelites were seized by the same",
                " fit of arrogant ignorance and folly which",
                " had once seized the criminal son of",
                " Adam, and resolved to kill those whose",
                " good deeds had been accepted by God.",
                " It was obvious that such acts would",
                " contribute nothing towards their acceptance by God.",
                " They would rather earn them an even",
                " greater degree of God's disapproval."
            ]
        },
        {
            "id": "[5:32]",
            "verse": "Because of that, We decreed upon the Children of Israel that whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely. And whoever saves one - it is as if he had saved mankind entirely. And our messengers had certainly come to them with clear proofs. Then indeed many of them, [even] after that, throughout the land, were transgressors.",
            "description": [
                "Since the same qualities which had been",
                " displayed by the wrong doing son of",
                " Adam were manifest in the Children of",
                " Israel, God strongly urged them not to",
                " kill human beings and couched His command",
                " in forceful terms. It is a pity",
                " that the precious words which embody God's",
                " ordinance are to be found nowhere in",
                " the Bible today. The Talmud, however, does",
                " mention this subject in the following words:",
                "",
                "To him who kills a single individual",
                " of Israel, it shall be reckoned as",
                " if he had slain the whole race",
                " and he who preserves a single individual",
                " of Israel, it shall be reckoned in",
                " the Book of God as if he",
                " had preserved the whole world. The Talmud",
                " also mentions that in trials for murder,",
                " the Israelite judges used to address the",
                " witnesses as follows:",
                "Whoever kills one person,",
                " merits punishment as if he had slain",
                " all the men in the world.",
                "*54).",
                " This means that the survival of human",
                " life depends on everyone respecting other human",
                " beings and in contributing actively to the",
                " survival and protection of others. Whosoever kills",
                " unrighteously is thus not merely guilty of",
                " doing wrong to one single person, but",
                " proves by his act that his heart",
                " is devoid of respect for human life",
                " and of sympathy for the human species",
                " as such. Such a person, therefore, is",
                " an enemy of all mankind. This is",
                " so because he happens to be possessed",
                " of a quality which, were it to",
                " become common to all men, would lead",
                " to the destruction of the entire human",
                " race. The person who helps to preserve",
                " the life of even one person, on",
                " the other hand, is the protector of",
                " the whole of humanity, for he possesses",
                " a quality which is indispensable to the",
                " survival of mankind."
            ]
        },
        {
            "id": "[5:33]",
            "verse": "Indeed, the penalty for those who wage war against Allah and His Messenger and strive upon earth [to cause] corruption is none but that they be killed or crucified or that their hands and feet be cut off from opposite sides or that they be exiled from the land. That is for them a disgrace in this world; and for them in the Hereafter is a great punishment,",
            "description": [
                "The 'land' signifies either the country or",
                " territory wherein the responsibility of establishing law",
                " and order has been undertaken by an",
                " Islamic state. The expression 'to wage war",
                " against Allah and His Messenger' denotes war",
                " against the righteous order established by the",
                " Islamic state. It is God's purpose, and",
                " it is for this very purpose that",
                " God sent His Messengers, that a righteous",
                " order of life be established on earth;",
                " an order that would provide peace and",
                " security to everything found on earth; an",
                " order under whose benign shadow humanity would",
                " be able to attain its perfection; an",
                " order under which the resources of the",
                " earth would be exploited in a manner",
                " conducive to man's progress and prosperity rather",
                " than to his ruin and destruction. If",
                " anyone tried to disrupt such an order,",
                " whether on a limited scale by committing",
                " murder and destruction and robbery and brigandry",
                " or on a large scale by attempting",
                " to overthrow that order and establish some",
                " unrighteous order instead, he would in fact",
                " be guilty of waging war against God",
                " and His Messenger. All this is not",
                " unlike the situation where someone tries to",
                " overthrow the established government in a country.",
                " Such a person will be convicted of",
                " 'waging war against the state' even though",
                " his actual action may have been directed",
                " against an ordinary policeman in some remote",
                " part of the country, and irrespective of",
                " how remote the sovereign himself is from",
                " him.",
                "*56). These penalties are mentioned here",
                " in brief merely to serve as guidelines",
                " to either judges or rulers so they",
                " may punish each criminal in accordance with",
                " the nature of his crime. The real",
                " purpose is to indicate that for any",
                " of those who live in the Islamic",
                " realm to attempt to overthrow the Islamic",
                " order is the worst kind of crime,",
                " for which any of the highly severe",
                " punishments may be imposed."
            ]
        },
        {
            "id": "[5:34]",
            "verse": "Except for those who return [repenting] before you apprehend them. And know that Allah is Forgiving and Merciful.",
            "description": [
                "If they give up subversion and abandon",
                " their endeavour to disrupt or overthrow the",
                " righteous order, and their subsequent conduct shows",
                " that they have indeed become peace-loving, law-abiding",
                " citizens of good character, they need not",
                " be subjected to the punishments mentioned here",
                " even if any of their former crimes",
                " against the state should come to light.",
                " If their crime involves violation of the",
                " rights of other men they may not",
                " be absolved from their guilt. If, for",
                " instance, they have either killed a person,",
                " seized someone's property or committed any other",
                " crime against human life or property they",
                " will be tried according to the criminal",
                " law of Islam. They will not, however,",
                " be accused of either rebellion and high",
                " treason or of waging war against God",
                " and His Messenger."
            ]
        },
        {
            "id": "[5:35]",
            "verse": "O you who have believed, fear Allah and seek the means [of nearness] to Him and strive in His cause that you may succeed.",
            "description": [
                "People are urged to solicit all means",
                " which might bring them close to God",
                " and enable them to please Him.",
                "*59).",
                " The English imperative 'strive hard' does not",
                " do full justice to the actual word",
                " used in the Qur'an: jahidu. The verbal",
                " form mujahadah signifies and carries the nuance",
                " of doing something in defiance of, or",
                " in opposition to someone. The true sense",
                " of the Qur'anic injunction 'strive hard' in",
                " the way of Allah is that the",
                " Muslims ought to use all their strength",
                " and engage in vigorous struggle against those",
                " forces which either forcefully prevent them from",
                " living in obedience to God or force",
                " them to live in obedience to others",
                " than God. It is this struggle which",
                " is likely to lead man to his",
                " true success and bring him to a",
                " close relationship with God.",
                "This verse directs",
                " the believer to engage in a ceaseless,",
                " multifrontal struggle. On one side is the",
                " accursed Satan with his horde. Then comes",
                " the animal spirit of man, with its",
                " defiant and refractory desires. Then there are",
                " many men who have turned away from",
                " God, but with whom one is linked",
                " by social, cultural and economic ties. Then",
                " there are false religious, cultural and social",
                " systems which rest on rebellion against God",
                " and which force man to worship falsehood",
                " rather than Truth. These rebellious forces use",
                " different means to achieve their end, but",
                " those ends are always the same -",
                " to make men serve them rather than",
                " God. But man's true progress and his",
                " attainment of close communion with God depends",
                " entirely on his total obedience to God,",
                " on his serving God unreservedly in the",
                " inner as well as in the external",
                " aspects of his life. He cannot achieve",
                " this objective without engaging in simultaneous combat",
                " with all the forces which are defiant",
                " and rebellious towards God, carrying on an",
                " unceasing struggle against them and trampling down",
                " all obstructions to his advancement along God's",
                " path."
            ]
        },
        {
            "id": "[5:36]",
            "verse": "Indeed, those who disbelieve - if they should have all that is in the earth and the like of it with it by which to ransom themselves from the punishment of the Day of Resurrection, it will not be accepted from them, and for them is a painful punishment",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:37]",
            "verse": "They will wish to get out of the Fire, but never are they to emerge therefrom, and for them is an enduring punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:38]",
            "verse": "[As for] the thief, the male and the female, amputate their hands in recompense for what they committed as a deterrent [punishment] from Allah. And Allah is Exalted in Might and Wise.",
            "description": [
                "The injunction is to cut off one",
                " not both hands. There is consensus among",
                " jurists that in the event of the",
                " first theft the right hand should be",
                " cut off. This punishment has been laid",
                " down for theft alone. The Prophet (peace",
                " be on him) declared: \"There is no",
                " cutting off of a hand for he",
                " who embezzles.' (Abu Da'ud, 'Hudud', 14; Tirmidhi,",
                " 'Hudud', 18; Ibn Majah, 'Hudud', 36; Nasa'i,",
                " 'Qat' al-Sariq', 13 - Ed.) This shows",
                " that the punishment prescribed for theft does",
                " not cover acts involving embezzlement and other",
                " dishonest practices. It is applicable only to",
                " acts involving the seizure, by stealth, of",
                " someone else's property.",
                "The Prophet (peace be",
                " on him) also instructed that the punishment",
                " of cutting off a hand should not",
                " be applied in cases where the value",
                " of the article stolen is less than",
                " that of a shield. In the time",
                " of the Prophet (peace be on him)",
                " according to a tradition from Ibn 'Abbas,",
                " this was ten dirhams; according to a",
                " tradition from Ibn 'Umar, it was three",
                " dirhams; according to a tradition from Anas",
                " b. Malik, it was five dirhams; and",
                " according to another tradition from 'A'ishah, it",
                " was a quarter of a dinar. Owing",
                " to this discrepancy, there is disagreement among",
                " jurists regarding the minimum value of the",
                " goods stolen which merits the punishment of",
                " cutting off a hand. This value, according",
                " to Abu Hanifah, is ten dirhams whereas",
                " according to Malik, Shafi'i and Ahmad b.",
                " Hanbal, it is one quarter of a",
                " dinar (three dirhams). (For traditions on objects",
                " and amounts of things on which the",
                " hand of the thief is to be",
                " cut off, see Bukhari, 'Hudud', 13; Muslim,",
                " 'Hudud', 1-7; Abu Da'ud, 'Hudud', 12, 13;",
                " Tirmidhi, 'Hudud', 16; Nasa'i, 'Qat' al-Sariq', 5,",
                " 8-10 - Ed.) Moreover, there are several",
                " things the theft of which would not",
                " necessitate cutting off a hand. The Prophet",
                " (peace be on him) directed, for instance,",
                " that no hand should be cut off",
                " if the stolen article was food. According",
                " to a tradition from 'A'ishah: '(The hand",
                " of) the thief was not cut off",
                " during the time of the Messenger of",
                " Allah for the theft of trivial things.'",
                " (Ahmad b. Hanbal, Musnad, vol. 3, p.",
                " 464; Darimi, 'Hudud', 4, 7 - Ed.)",
                " Furthermore, 'Ali and 'Uthman gave the judgement",
                " - and none of the Companions disagreed",
                " with it - that a person's hand",
                " should not be cut off for stealing",
                " birds. 'Umar and 'Ali did not cut",
                " off the hands of those who had",
                " stolen from the public treasury, and on",
                " this question no disagreement on the part",
                " of any Companion has been reported. On",
                " these grounds the founders of the schools",
                " of Islamic Law exempted certain things from",
                " the application of this penal injunction.",
                "According",
                " to Abu Hanifah a man's hand should",
                " not be cut off for stealing vegetables,",
                " fruit, meat, cooked food, grain which is",
                " not stored in a barn, and instruments",
                " of music and play. Likewise, he is",
                " of the opinion that a hand should",
                " not be cut off for either stealing",
                " animals grazing in the forest or for",
                " stealing from the public treasury. The founders",
                " of the other schools of Islamic Law",
                " have also exempted the stealing of certain",
                " things from the punishment of cutting off",
                " a hand. But this exemption does not",
                " mean that the guilty parties should receive",
                " no punishment at all. (See the commentaries",
                " of Ibn Kathir, Ibn al-'Arabi, Qurtubi and",
                " Jassas on this verse. See also Ibn",
                " Rushd, Bidayat al-Mujtahid, vol. 2, pp. 441",
                " ff. - Ed.)"
            ]
        },
        {
            "id": "[5:39]",
            "verse": "But whoever repents after his wrongdoing and reforms, indeed, Allah will turn to him in forgiveness. Indeed, Allah is Forgiving and Merciful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:40]",
            "verse": "Do you not know that to Allah belongs the dominion of the heavens and the earth? He punishes whom He wills and forgives whom He wills, and Allah is over all things competent.",
            "description": [
                "Forgiveness on the part of Allah does",
                " not mean that the hand of the",
                " thief should not be cut off. It",
                " means rather that one who repents and",
                " becomes righteous by purging his soul of",
                " the sin of stealing will be spared",
                " the wrath of God, Who will remove",
                " the stain of that sin from him.",
                " But if after his hand has been",
                " cut off the person concerned does not",
                " purge himself of evil intent and continues",
                " to nurture the same impure feelings which",
                " led to his stealing and thus to",
                " the cutting off of his hand, it",
                " is evident that even though his hand",
                " has been severed from his body, stealing",
                " remains ingrained in his soul. The result",
                " will be that he will continue to",
                " merit God's wrath as he did before",
                " his hand was cut off. The Qur'an",
                " therefore directs the thief to seek pardon",
                " from God and to try to reform",
                " himself. For the hand of that thief",
                " was cut off for the sake of",
                " the judicious administration of human society and",
                " the cutting off of a hand did",
                " not automatically purify the soul of the",
                " person on whom the punishment was carried",
                " out. Purity of soul can be achieved",
                " only by repentance and turning oneself to",
                " God. Traditions mention that after the hand",
                " of a thief had been cut off",
                " in compliance with the Prophet's order, he",
                " was summoned by the Prophet (peace be",
                " on him) himself who said to him:",
                " 'Say: \"I seek pardon from God, and",
                " to Him do I turn in repentance.'\"",
                " The thief uttered these words as directed",
                " by the Prophet (peace be on him)",
                " who then prayed for the thief, saying:",
                " 'O God, accept his repentance.' (Abu Da'ud,",
                " 'Hudud', 8 - Ed.)"
            ]
        },
        {
            "id": "[5:41]",
            "verse": "O Messenger, let them not grieve you who hasten into disbelief of those who say, \"We believe\" with their mouths, but their hearts believe not, and from among the Jews. [They are] avid listeners to falsehood, listening to another people who have not come to you. They distort words beyond their [proper] usages, saying \"If you are given this, take it; but if you are not given it, then beware.\" But he for whom Allah intends fitnah - never will you possess [power to do] for him a thing against Allah. Those are the ones for whom Allah does not intend to purify their hearts. For them in this world is disgrace, and for them in the Hereafter is a great punishment.",
            "description": [
                "This verse refers to those who devoted",
                " all their capacities and efforts to ensure",
                " that the status quo ante of Jahiliyah",
                " remained intact, and that the reformative mission",
                " of Islam should fail to set right",
                " the corruption that had come down to",
                " them from the past. Disregarding all moral",
                " scruples, these people used the vilest methods",
                " against the Prophet (peace be on him).",
                " They deliberately suppressed the truth and resorted",
                " to lying, deceit, treachery and low cunning",
                " in order to frustrate the mission of",
                " the Prophet (peace be on him) who",
                " was engaged in a tireless struggle actuated",
                " by absolute selflessness and benevolence, and who",
                " sought the welfare of all human beings,",
                " including that of his opponents. All this",
                " naturally hurt the Prophet (peace be on",
                " him). A sincere person must feel heartbroken",
                " when he sees men of low moral",
                " character, driven by ignorance, blind selfishness and",
                " bigotry, resort to vile methods in opposition",
                " to his mission, which is actuated by",
                " charity and goodwill towards all men. Hence",
                " the purpose of God's directive here is",
                " not to ask the Prophet (peace be",
                " on him) to abstain from this natural",
                " feeling of grief but rather that he",
                " should not allow such feelings to undermine",
                " his morale and that he should persevere",
                " in his task. As for the opponents",
                " of the Prophet (peace be on him),",
                " in view of their low morals, their",
                " mean conduct was not at all contrary",
                " to expectations.",
                "*63). This has two meanings.",
                " First, that since such people are slaves",
                " to their desires they cannot have the",
                " least interest in the Truth, falsehood alone",
                " gratifies them. It is with falsehood alone",
                " that they like to fill their ears,",
                " for nothing else quenches the thirst of",
                " their souls. Second, it is the same",
                " love of falsehood which motivates them when",
                " they come and spend some time in",
                " the company of the Prophet (peace be",
                " on him) and the Muslims. They want",
                " to distort whatever they see or hear,",
                " to taint the facts with their fabrications,",
                " and then circulate them among those who",
                " have had no contact with the Prophet",
                " (peace be on him) and the Muslims",
                " in order to scandalize them.",
                "*64). This",
                " also has two meanings. First, that they",
                " socialized with the Prophet (peace be on",
                " him) and the Muslims in order to",
                " pry into their affairs and communicate them",
                " to the enemy. Second, that they went",
                " about collecting information to try to slander",
                " them. Their objective was to create misgivings",
                " about the Prophet (peace be on him)",
                " and the Muslims among those who were",
                " unacquainted with them.",
                "*65). They deliberately tamper",
                " with those injunctions of the Torah that",
                " do not accord with their desires, and",
                " by altering the meanings of the words",
                " occurring in the text they deduce laws",
                " that suit their interests.",
                "*66). This refers",
                " to the Jews who went about telling",
                " the ignorant masses that they should follow",
                " the teachings of the Prophet (peace be",
                " on him) only if they conformed to",
                " the teachings of the Jews.",
                "*67).God's will",
                " to put someone to the test means",
                " that God confronts one in whom He",
                " sees the growth of evil with the",
                " opportunities of doing just that, so that",
                " he experiences the struggle between good and",
                " evil. If the person is not yet",
                " fully inclined towards evil, his moral health",
                " improves and his latent potentialities for resisting",
                " evil are revived. But if he has",
                " become excessively inclined towards evil, and goodness",
                " has been totally crushed from within his",
                " being, then every such test is bound",
                " to entangle him still more tightly in",
                " evil. The well-wisher is now powerless to",
                " rescue him. It might be added that",
                " not only individuals but also nations are",
                " put to this kind of test.",
                "*68).",
                " God did not will that their hearts",
                " be purified for they themselves did not",
                " want them to be purified. It is",
                " not God's way to deprive of purity",
                " those who love it and strive for",
                " it; but God does not wish to",
                " purify those who do not seek their",
                " own purification."
            ]
        },
        {
            "id": "[5:42]",
            "verse": "[They are] avid listeners to falsehood, devourers of [what is] unlawful. So if they come to you, [O Muhammad], judge between them or turn away from them. And if you turn away from them - never will they harm you at all. And if you judge, judge between them with justice. Indeed, Allah loves those who act justly.",
            "description": [
                "Here pointed reference is made to judges",
                " and jurisconsults who accept false evidence and",
                " invent reports in order to issue verdicts",
                " contrary to justice and in favour of",
                " either those who bribe them or with",
                " whom their illegitimate interests lie.",
                "*70). Until",
                " then the Jews had not become full-fledged",
                " subjects of the Islamic state. Their relations",
                " with that state were based on agreements",
                " according to which the Jews were to",
                " enjoy internal autonomy, and their disputes were",
                " to be decided by their own judges",
                " and in accordance with their own laws.",
                " They were not legally bound to place",
                " their disputes either before the Prophet (peace",
                " be on him) for adjudication or before",
                " the judges appointed by him. But in",
                " cases where it appeared against their interests",
                " to have their disputes judged according to",
                " their own religious law they approached the",
                " Prophet (peace be on him) in the",
                " hope that the Prophet might have a",
                " different ruling.",
                "The particular case referred to",
                " here was that of a woman belonging",
                " to a respectable family, who was found",
                " to be involved in an unlawful sexual",
                " relationship with a man. The punishment for",
                " this in the Torah was that both",
                " be stoned to death (see Deuteronomy 22:",
                " 23-4). But the Jews did not want",
                " to enforce this punishment. Hence they deliberated",
                " among themselves and decided to put the",
                " case before the Prophet (peace be on",
                " him), with the reservation that his judgement",
                " be accepted only if it was other",
                " than stoning. The Prophet (peace be on",
                " him) decided that the punishment should, in",
                " fact, be stoning. When the Jews declined",
                " to accept the judgement, the Prophet (peace",
                " be on him) asked their rabbis what",
                " punishment had been prescribed for such a",
                " case in their religion. They replied that",
                " it was to strike the culprit with",
                " lashes, to blacken the face and to",
                " make the person concerned ride on a",
                " donkey. The Prophet (peace be on him)",
                " asked them under oath if the Torah",
                " had indeed prescribed that as punishment for",
                " adultery committed by married men and women.",
                " They repeated the same false reply. However,",
                " one of them called Ibn Sawriya who,",
                " according to the Jews themselves, was the",
                " greatest living scholar of the Torah at",
                " that time, kept silent. The Prophet (peace",
                " be on him) asked him to state",
                " on oath in the name of God,",
                " Who had emancipated them from Pharaoh and",
                " had given them the Law, whether the",
                " punishment for adultery provided for in the",
                " Torah was what they had mentioned. He",
                " replied: 'Had you not put me under",
                " such a heavy oath, I would not",
                " have volunteered the correct information. The fact",
                " is that the prescribed punishment for adultery",
                " is indeed stoning, but when adultery became",
                " common among us our rulers adopted the",
                " rule that when respectable people committed adultery",
                " they were left unpunished, whereas when ordinary",
                " people were convicted they were punished by",
                " stoning. Later on when this caused resentment",
                " among the common people we altered the",
                " law of the Torah and adopted the",
                " rule that adulterers and adulteresses would be",
                " lashed, their faces would be blackened, and",
                " they would be made to ride on",
                " donkeys, seated in a backward-looking position.' This",
                " left the Jews with nothing to say",
                " and the adulterer and adulteress were, in",
                " accordance with the order of the Prophet",
                " (peace be on him), stoned to death.",
                " (Ibn Kathir, Tafsir, vol. 3, pp. 574-5",
                " - Ed.)"
            ]
        },
        {
            "id": "[5:43]",
            "verse": "But how is it that they come to you for judgement while they have the Torah, in which is the judgement of Allah? Then they turn away, [even] after that; but those are not [in fact] believers.",
            "description": [
                "In this verse, God unmasks completely the",
                " dishonesty of these people. It shows how",
                " these so-called religious people who had cast",
                " the spell of their religious piety and",
                " knowledge of the Scriptures over the whole",
                " of Arabia had set aside a categorical",
                " injunction of the book which they themselves",
                " recognized to be the Book of God,",
                " and which they professed to believe in.",
                " They had referred that judicial case to",
                " the Prophet (peace be on him) for",
                " his decision even though they vehemently denied",
                " his prophethood. This made it quite clear",
                " that there was nothing to which they",
                " subscribed sincerely. Their true religion consisted merely",
                " of worshipping their interests and desires. They",
                " were ready to turn their backs upon",
                " the very book which they recognized as",
                " the Book of God merely because some",
                " of its injunctions were unpalatable to them,",
                " and in such cases they did not",
                " mind approaching one whom they regarded as",
                " an imposter (may God be our refuge",
                " from such a blasphemy) in the hope",
                " that they might be able to obtain",
                " a judgement to their liking."
            ]
        },
        {
            "id": "[5:44]",
            "verse": "Indeed, We sent down the Torah, in which was guidance and light. The prophets who submitted [to Allah] judged by it for the Jews, as did the rabbis and scholars by that with which they were entrusted of the Scripture of Allah, and they were witnesses thereto. So do not fear the people but fear Me, and do not exchange My verses for a small price. And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers.",
            "description": [
                "Here the verse tells the Jews that",
                " all the Prophets were muslims (submitters to",
                " God) whereas the Jews had deviated from",
                " islam (submission to God), and true to",
                " their chauvinistic sectarianism, were content with remaining",
                " merely 'Jews'.",
                "*73).Rabbani = religious scholars, theologians.",
                " Ahbar = religious jurists."
            ]
        },
        {
            "id": "[5:45]",
            "verse": "And We ordained for them therein a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds is legal retribution. But whoever gives [up his right as] charity, it is an expiation for him. And whoever does not judge by what Allah has revealed - then it is those who are the wrongdoers.",
            "description": [
                "Cf. Exodus 21: 23-5.",
                "*75). Whoever forgoes",
                " his right of retaliation does a good",
                " deed which will atone for many of",
                " his sins. The same is confirmed by",
                " a tradition of the Prophet (peace be",
                " on him) in which he said: 'Whoever",
                " receives an injury on his body, then",
                " pardons (the inflictor of the injury), his",
                " sins are atoned for to the measure",
                " of his pardoning.' (Ahmad b. Hanbal, Musnad,",
                " vol. 5, pp. 316, 329 - Ed.)",
                ""
            ]
        },
        {
            "id": "[5:46]",
            "verse": "And We sent, following in their footsteps, Jesus, the son of Mary, confirming that which came before him in the Torah; and We gave him the Gospel, in which was guidance and light and confirming that which preceded it of the Torah as guidance and instruction for the righteous.",
            "description": [
                "The Messiah did not expound a new",
                " religion. That very religion which had been",
                " the religion of all the Prophets was",
                " also his religion, and it is towards",
                " that religion that he called people. He",
                " believed in the true teachings of the",
                " Torah which were extant in his time,",
                " and the Gospels (Injil) confirm this (see,",
                " for example, Matthew 5: 17-18). The Qur'an",
                " repeatedly stresses the fundamental fact that none",
                " of the Prophets of God, no matter",
                " in which part of the world they",
                " appeared, denied the Prophets who had preceded",
                " them. On the contrary, each Prophet confirmed",
                " the message of his predecessors and sought",
                " to promote the mission which was the",
                " sacred legacy of them all. God did",
                " not reveal any of the Books in",
                " order to repudiate the previous ones; each",
                " confirmed and supported the preceding ones."
            ]
        },
        {
            "id": "[5:47]",
            "verse": "And let the People of the Gospel judge by what Allah has revealed therein. And whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient.",
            "description": [
                "Here three judgements are issued against those",
                " who do not judge in accordance with",
                " the Law revealed by God. The first",
                " is that they are kafir (unbelievers); the",
                " second, that they are zalim (wrong-doers); and",
                " the third, that they are fasiq (transgressors).",
                " This clearly means that one who, in",
                " disregard of God's commandments and of the",
                " Laws revealed by Him, pronounces judgements according",
                " to man-made laws (whether made by himself",
                " or by others) is guilty of three",
                " major offences. First, his act amounts to",
                " rejecting the commandment of God, and this",
                " rejection is equivalent to kufr (infidelity, unbelief).",
                " Second, his act is contrary to justice,",
                " for only the laws made by God",
                " are in complete accord with the dictates",
                " of justice. Any judgement in contravention of",
                " God's injunctions amounts, therefore, to committing injustice",
                " (zulm). Third, when he enforces either his",
                " own or anyone else's law in disregard",
                " of the Laws of his Lord he",
                " steps out of the fold of subjection",
                " and obedience, and this constitutes fisq (transgression).",
                "",
                "Kufr, zulm and fisq are essential elements",
                " in deviation from God's commandments. One finds",
                " them wherever there is deviation from the",
                " commandment of God. There is variation in",
                " the degree of deviation and hence in",
                " the degree of these three offences. Whoever",
                " passes judgement on something in opposition to",
                " an injunction of God, believing that injunction",
                " to be false, and holds either his",
                " own or anyone else's judgement to be",
                " sound, is an unbeliever (kafir), wrong-doer (zalim)",
                " and transgressor (fasiq). A man who is",
                " convinced that the injunctions of God are",
                " right but makes judgements contrary to them",
                " in practice is not an unbeliever in",
                " the sense that he ceases to remain",
                " a member of the Islamic community, but",
                " he is guilty of adulterating his faith",
                " by blending it with kufr, zulm and",
                " fisq. In the same manner, those who",
                " deviate from the injunctions of God in",
                " all matters are unbelievers, wrong-doers and transgressors.",
                " For those who are obedient in some",
                " respects and disobedient in others, the blending",
                " of faith and submission to God with",
                " the opposite attributes of unbelief, wrong-doing and",
                " transgression in their lives will be exactly",
                " in proportion to the mixture of their",
                " obedience to and their deviation from God's",
                " commands.",
                "Some commentators have attempted to restrict",
                " the application of these verses to the",
                " People of the Book alone. The verses,",
                " however, hardly lend themselves to such a",
                " restrictive interpretation. The best answer to such",
                " a restrictive interpretation has been given by",
                " the Companion Hudhayfah. When someone told him",
                " that these verses related merely to the",
                " Israelites, meaning that the unbelievers, wrong-doers and",
                " transgressors were only the Jews who passed",
                " judgement contrary to the injunctions revealed by",
                " God, Hudhayfah remarked: 'What good brothers these",
                " Israelites are to you! Whatever is bitter",
                " goes to them; whatever is sweet comes",
                " to you. Nay, by God, you will",
                " follow their way, your steps following theirs.'",
                ""
            ]
        },
        {
            "id": "[5:48]",
            "verse": "And We have revealed to you, [O Muhammad], the Book in truth, confirming that which preceded it of the Scripture and as a criterion over it. So judge between them by what Allah has revealed and do not follow their inclinations away from what has come to you of the truth. To each of you We prescribed a law and a method. Had Allah willed, He would have made you one nation [united in religion], but [He intended] to test you in what He has given you; so race to [all that is] good. To Allah is your return all together, and He will [then] inform you concerning that over which you used to differ.",
            "description": [
                "This points to a fact of major",
                " significance. It could also have been said",
                " that the Qur'an confirms all those parts",
                " of the earlier divine books which are",
                " still extant in their true and original",
                " form. But the sense has been conveyed",
                " by employing the word 'the Book' rather",
                " than 'the previous Books'. This expression reveals",
                " that the Qur'an and all those Books",
                " sent down by God at various times",
                " and in different languages in reality constitute",
                " one and the same Book. Their Author",
                " is one and the same; their aim",
                " and purpose are the same; their teaching",
                " is the same; and the knowledge which",
                " they seek to impart to mankind is",
                " the same. The difference between these Books",
                " lies in their modes of expression, and",
                " this was necessarily so since they were",
                " addressed to different audiences. It is, therefore,",
                " not merely that these divine books support",
                " rather than contradict each other but that",
                " they are actually different editions of one",
                " and the same book - 'the Book'.",
                "",
                "*79). In Arabic, haymana, yuhayminu, hayamanah signify",
                " 'to protect, to witness, to keep trust,",
                " to back and to support'. The expression",
                " 'haymana al-rajul al-shay' means that the man",
                " protected and guarded the thing. Likewise, 'haymana",
                " al-ta'ir 'alafirdkhih' means that the bird took",
                " its young ones under the protection of",
                " its wings. Once 'Umar said to the",
                " people: 'Inni da'in fa hayminu' ('I am",
                " praying; support me by saying amen'). To",
                " say that the Qur'an is muhaymin of",
                " al-kitab means that it preserves all the",
                " true teachings of the earlier divine books;",
                " that it has secured them from loss.",
                " The Qur'an also confirms those Books in",
                " that the contents of the Qur'an testify",
                " to the truth of those parts which",
                " are indeed from God. The Qur'an is,",
                " further, a witness over those Books in",
                " the sense that, with its help, the",
                " elements which embody true revelations from God",
                " can be distinguished from the accretions which",
                " have corrupted them. Whatever in these Books",
                " accords with the Qur'an is from God,",
                " and whatever is not in conformity with",
                " it is from human beings.",
                "*80). This",
                " is a parenthetical phrase, the purpose of",
                " which is to elucidate a question which",
                " is likely to arise in the mind",
                " of the reader who has read the",
                " above section and might feel uneasy. The",
                " question is: Why do the religious laws",
                " propounded by the various Prophets differ in",
                " matters of detail even though the Prophets",
                " and their Books preach one and the",
                " same religion (din) and even confirm and",
                " support each other? Why is it that",
                " in regard to the prescribed forms of",
                " worship, the regulations concerning what is permitted",
                " and what is prohibited, and the detailed",
                " legal regulations governing the social and collective",
                " life, there is some disagreement among the",
                " various laws propounded by the different Prophets",
                " and the divine Books?",
                "*81). This constitutes",
                " a detailed answer to the above question",
                " (see n. 80). It consists of the",
                " following points:",
                "(1) It is a mistake",
                " to think that variations in religious laws",
                " result from a difference of source. It",
                " is God Himself Who altered the legal",
                " prescriptions to suit different nations at different",
                " times and in different circumstances.",
                "(2) It",
                " was indeed possible, by divising one legal",
                " code for all human beings, for all",
                " men to have been made into one",
                " nation (ummah). But one of the many",
                " benevolent considerations keeping the religious laws of",
                " various Prophets different from one another was",
                " that God wanted this difference to become",
                " a means of testing people. Those who",
                " understand true religion, who have grasped its",
                " spirit and essence, and who are aware",
                " of the true importance of the different",
                " legal prescriptions, always recognize the Truth and",
                " accept it whatever its form. They have",
                " no hesitation in accepting the new ordinances",
                " of God in place of the old",
                " ones, in contrast to those who are",
                " not conversant with the spirit of true",
                " religion and who seem to identify it",
                " with a specific body of legal minutiae.",
                " Such people have overlaid God-given principles with",
                " their own legal deductions, and have sub",
                " sequently fossilized this entire amalgam, seeking to",
                " preserve it in its entirety. They have",
                " grown so attached to it that, in",
                " order to preserve it, they spurn every",
                " directive which subsequently comes to them from",
                " God. In order to distinguish the people",
                " of the first category from those of",
                " the second God made the legal prescriptions",
                " of the various Prophets vary.",
                "(3) The",
                " real purpose of all the divine religious",
                " laws is the attainment of goodness and",
                " righteousness. This purpose can be achieved only",
                " when a man obeys whatever commandment he",
                " receives from God at a particular time.",
                " The proper mode of conduct for people",
                " who keep their eyes fixed on this",
                " true purpose is to strive for God's",
                " good pleasure rather than quarrel about differences",
                " in the legal prescriptions of the various",
                " Prophets.",
                "(4) The differences which have arisen",
                " because of the unjustified rigidity, prejudice, obduracy",
                " and erroneous attitudes of the human mind",
                " can be finally settled neither in the",
                " debating hall nor on the battlefield. The",
                " final judgement will be made by God",
                " Himself. Then the reality of everything will",
                " be fully uncovered, and it will be",
                " clear how much truth and falsehood underlay",
                " the squabbles which whole lives were wasted",
                " over."
            ]
        },
        {
            "id": "[5:49]",
            "verse": "And judge, [O Muhammad], between them by what Allah has revealed and do not follow their inclinations and beware of them, lest they tempt you away from some of what Allah has revealed to you. And if they turn away - then know that Allah only intends to afflict them with some of their [own] sins. And indeed, many among the people are defiantly disobedient.",
            "description": [
                "Following this parenthetical clause, the previous subject",
                " is resumed."
            ]
        },
        {
            "id": "[5:50]",
            "verse": "Then is it the judgement of [the time of] ignorance they desire? But who is better than Allah in judgement for a people who are certain [in faith].",
            "description": [
                "The word jahiliyah (literally 'ignorance') is used",
                " as an antonym to Islam. Islam is",
                " the way of 'ilm (true knowledge), since",
                " it is God Himself Who has shown",
                " this way, and His knowledge embraces everything.",
                " In contrast is the way that diverges",
                " from Islam - the path of Ignorance",
                " (jahiliyah). The pre-Islamic period in Arabia is",
                " designated as jahiliyah because this was the",
                " era when human beings derived their norms",
                " from either superstitious beliefs, conjectures and imagination",
                " or from their desires. Whenever such an",
                " attitude is adopted, it is bound to",
                " be designated as Ignorance. The appellation 'jahiliyah'",
                " will apply to every aspect of life",
                " which is developed in disregard of the",
                " knowledge made available by God, based only",
                " on man's partial knowledge blended with imagination,",
                " superstitious fancies, conjectures and desires."
            ]
        },
        {
            "id": "[5:51]",
            "verse": "O you who have believed, do not take the Jews and the Christians as allies. They are [in fact] allies of one another. And whoever is an ally to them among you - then indeed, he is [one] of them. Indeed, Allah guides not the wrongdoing people.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:52]",
            "verse": "So you see those in whose hearts is disease hastening into [association with] them, saying, \"We are afraid a misfortune may strike us.\" But perhaps Allah will bring conquest or a decision from Him, and they will become, over what they have been concealing within themselves, regretful.",
            "description": [
                "The outcome of the conflict in Arabia",
                " between Islam and unbelief (kufr) had not",
                " crystallized. Although Islam had become a formidable",
                " force owing to the daring, courage and",
                " sacrifices of its followers, the forces opposed",
                " to it were also tremendously powerful. To",
                " an objective observer it must have seemed",
                " that either party had an equal chance",
                " of success, and so the hypocrites, apparently",
                " an integral part of the Muslim body",
                " politic, sought to maintain good relations with",
                " the Jews and the. Christians as well.",
                " They expected refuge and protection from the",
                " Jews in case Islam was defeated. Moreover,",
                " the Jews and Christians held the greatest",
                " economic power in Arabia insofar as the",
                " banking system and the greenest and most",
                " fertile regions of Arabia were in their",
                " possession. For these reasons the hypocrites were",
                " keen to maintain good relations with them:",
                " they thought that to regard the conflict",
                " between Islam and unbelief as crucially important,",
                " and to sever their relations with all",
                " those currently in conflict with Islam, would",
                " be too great a risk both politically",
                " and economically.",
                "*85). They were looking for",
                " a conclusive victory, or at least something",
                " not far short of it, to inspire",
                " confidence that the conflict would end in",
                " favour of Islam."
            ]
        },
        {
            "id": "[5:53]",
            "verse": "And those who believe will say, \"Are these the ones who swore by Allah their strongest oaths that indeed they were with you?\" Their deeds have become worthless, and they have become losers.",
            "description": [
                "However much they might profess to follow",
                " Islam - by performing Prayers, by observing",
                " Fasts, by paying Zakah, by taking part",
                " in wars in the cause of God",
                " - all was reduced to naught because",
                " they had not devoted themselves to the",
                " service of the One True God. In",
                " pursuit of their worldly ambitions they had",
                " split their souls into two, distributing half",
                " to God and half to those in",
                " rebellion against Him."
            ]
        },
        {
            "id": "[5:54]",
            "verse": "O you who have believed, whoever of you should revert from his religion - Allah will bring forth [in place of them] a people He will love and who will love Him [who are] humble toward the believers, powerful against the disbelievers; they strive in the cause of Allah and do not fear the blame of a critic. That is the favor of Allah; He bestows it upon whom He wills. And Allah is all-Encompassing and Knowing.",
            "description": [
                "To be 'humble towards believers' signifies that",
                " a person should never use his strength",
                " against the believers. His native intelligence, shrewdness,",
                " ability, influence, wealth, physical prowess should not",
                " be used for the purpose of either",
                " suppressing, persecuting or causing harm to the",
                " Muslims. Among themselves, the Muslims should always",
                " find him gentle, merciful, sympathetic and mild",
                " tempered.",
                "To be 'firm towards unbelievers', on",
                " the contrary, means that by virtue of",
                " the intensity of his faith, the sincerity",
                " of his conviction, his strict adherence to",
                " his principles, his strength of character and",
                " his insight and perspicacity born of faith,",
                " a man should be firm as a",
                " rock in his dealings with the opponents",
                " of Islam, so that they find it",
                " impossible to dislodge him. There should be",
                " no doubt in their minds that the",
                " believer would rather lay down his life",
                " than compromise his position by yielding to",
                " external pressures.",
                "*88).In following the religion of",
                " God, in implementing His injunctions, in judging",
                " things to be either right or wrong",
                " according to the criteria of the faith,",
                " the believer will be afraid of nothing.",
                " He will be impervious to opposition, reproach,",
                " denunciation, name-calling and scorn. Even when public",
                " opinion happens to be hostile, and his",
                " efforts to follow Islam single him out",
                " for the scorn of the whole world,",
                " the man of faith will still follow",
                " the way which he recognizes in his",
                " heart to be true."
            ]
        },
        {
            "id": "[5:55]",
            "verse": "Your ally is none but Allah and [therefore] His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship].",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:56]",
            "verse": "And whoever is an ally of Allah and His Messenger and those who have believed - indeed, the party of Allah - they will be the predominant.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:57]",
            "verse": "O you who have believed, take not those who have taken your religion in ridicule and amusement among the ones who were given the Scripture before you nor the disbelievers as allies. And fear Allah, if you should [truly] be believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:58]",
            "verse": "And when you call to prayer, they take it in ridicule and amusement. That is because they are a people who do not use reason.",
            "description": [
                "When they hear the call to Prayer",
                " the unbelievers make fun of it by",
                " mimicry, pervert its words to ridicule it,",
                " and utter disparaging and taunting remarks about",
                " it.",
                "*90). These are merely acts of",
                " stupidity on the part of unbelievers. Had",
                " they not been ignorant and foolish they",
                " would not have stooped to such base",
                " tactics, despite their significant differences with the",
                " Muslims on religious questions. After all, can",
                " any reasonable person be happy to see",
                " the people who call to the worship",
                " of God be ridiculed and mocked?"
            ]
        },
        {
            "id": "[5:59]",
            "verse": "Say, \"O People of the Scripture, do you resent us except [for the fact] that we have believed in Allah and what was revealed to us and what was revealed before and because most of you are defiantly disobedient?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:60]",
            "verse": "Say, \"Shall I inform you of [what is] worse than that as penalty from Allah? [It is that of] those whom Allah has cursed and with whom He became angry and made of them apes and pigs and slaves of Taghut. Those are worse in position and further astray from the sound way.\"",
            "description": [
                "This alludes to the Jews whose history",
                " shows that they were subjected, over and",
                " over again, to the wrath and scourge",
                " of God. When they desecrated the law",
                " of the Sabbath the faces of many",
                " of them were distorted, and subsequently their",
                " degeneration reached such a low point that",
                " they took to worshipping Satan quite openly.",
                " The purpose of saying all this is",
                " to draw attention to their criminal boldness",
                " while they had sunk to the lowest",
                " level of evil, transgression and moral decadence,",
                " they vigorously opposed all those who, thanks",
                " to their faith, lived a truly pious",
                " and righteous life."
            ]
        },
        {
            "id": "[5:61]",
            "verse": "And when they come to you, they say, \"We believe.\" But they have entered with disbelief [in their hearts], and they have certainly left with it. And Allah is most knowing of what they were concealing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:62]",
            "verse": "And you see many of them hastening into sin and aggression and the devouring of [what is] unlawful. How wretched is what they have been doing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:63]",
            "verse": "Why do the rabbis and religious scholars not forbid them from saying what is sinful and devouring what is unlawful? How wretched is what they have been practicing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:64]",
            "verse": "And the Jews say, \"The hand of Allah is chained.\" Chained are their hands, and cursed are they for what they say. Rather, both His hands are extended; He spends however He wills. And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. And We have cast among them animosity and hatred until the Day of Resurrection. Every time they kindled the fire of war [against you], Allah extinguished it. And they strive throughout the land [causing] corruption, and Allah does not like corrupters.",
            "description": [
                "To say that someone's hands are tied,",
                " in Arabic usage, is to say that",
                " he is niggardly, that something prevents him",
                " from being generous and bountiful. Thus the",
                " Jewish observation does not mean that God's",
                " Hand is literally tied but that He",
                " is niggardly and miserly. For centuries the",
                " Jews had lived in humiliation and misery.",
                " Their past greatness had become legend, seemingly",
                " too remote ever to be restored, and",
                " so they would blasphemously lament that God",
                " had become a miser and that as",
                " the door to His treasury was now",
                " permanently locked, that He had nothing to",
                " offer them except suffering and calamity. This",
                " attitude, however, is not confined to the",
                " Jews. When confronted with trials and tribulations",
                " foolish people of other nations, too, are",
                " prone to utter such blasphemies rather than",
                " turn to God with humble prayer and",
                " supplication.",
                "*93). They accused God of the",
                " miserliness from which they themselves had suffered",
                " and had become notorious for.",
                "*94). If",
                " they entertained the hope that by such",
                " insolent and taunting expressions they might evoke",
                " God's munificence, and that His bounties would",
                " begin to shower upon them, they were",
                " dreaming of the impossible. Indeed, such insolence",
                " was bound to have the opposite effect",
                " - to alienate them further from God's",
                " bounty, to cast them even further from",
                " His mercy.",
                "*95). Instead of learning any",
                " lessons from the Book of God, instead",
                " of recognizing their own mistakes and wrongs",
                " and then trying to make amends for",
                " them, instead of probing their miserable situation",
                " and then turning to reform, they reacted",
                " by launching a violent campaign of opposition",
                " to truth and righteousness. Rather than take",
                " to the right way as a result",
                " of being reminded of the forgotten lesson",
                " of righteousness, they attempted to suppress the",
                " voice which sought to remind them and",
                " others of such things."
            ]
        },
        {
            "id": "[5:65]",
            "verse": "And if only the People of the Scripture had believed and feared Allah, We would have removed from them their misdeeds and admitted them to Gardens of Pleasure.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:66]",
            "verse": "And if only they upheld [the law of] the Torah, the Gospel, and what has been revealed to them from their Lord, they would have consumed [provision] from above them and from beneath their feet. Among them are a moderate community, but many of them - evil is that which they do.",
            "description": [
                "In the Old Testament, Leviticus (chapter 26)",
                " and Deuteronomy (chapter 28) record a sermon",
                " of Moses in which he impresses upon",
                " Israel, in great detail, the bounties and",
                " blessings of God with which they would",
                " be endowed if they obeyed His commandments,",
                " and the afflictions, scourges and devastations that",
                " would descend upon them if they disobeyed",
                " Him and rejected the Book of God.",
                " That sermon of Moses is the best",
                " explanation of this verse of the Qur'an.",
                ""
            ]
        },
        {
            "id": "[5:67]",
            "verse": "O Messenger, announce that which has been revealed to you from your Lord, and if you do not, then you have not conveyed His message. And Allah will protect you from the people. Indeed, Allah does not guide the disbelieving people.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:68]",
            "verse": "Say, \"O People of the Scripture, you are [standing] on nothing until you uphold [the law of] the Torah, the Gospel, and what has been revealed to you from your Lord.\" And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. So do not grieve over the disbelieving people.",
            "description": [
                "By 'establishing the Torah and the Gospel'",
                " is meant observing them honestly and making",
                " them the law of life.",
                "It should",
                " be noted here that the Scriptures which",
                " comprise the Bible consist of two kinds",
                " of writings. One was composed by the",
                " Jewish and Christian authors themselves. The second",
                " consists of those portions which have been",
                " recorded as either the injunctions of God",
                " or as the utterances of Moses, Jesus",
                " and other Prophets. Such portions are those",
                " in which it has been categorically stated",
                " that God said so and so, or",
                " that a particular Prophet said so and",
                " so. If we were to exclude the",
                " portions belonging to the first category and",
                " carefully study those belonging to the second",
                " we would notice that their teachings are",
                " not perceptibly different from those of the",
                " Qur'an. It is true that the second",
                " category has not altogether escaped the tamperings",
                " of translators, scribes and exegetes, and the",
                " errors of oral transmitters. Nevertheless, one cannot",
                " help feeling that the teachings embodied in",
                " the second category call man to the",
                " same pure monotheism as the Qur'an, that",
                " they propound those very beliefs propounded by",
                " the Qur'an and that they direct man",
                " to the same way of life as",
                " that to which the Qur'an seeks to",
                " direct him. Hence, had the Jews and",
                " the Christians adhered to the teaching attributed",
                " in their Scriptures to God and the",
                " Prophets they would certainly have become a",
                " truth-loving and truth-oriented group of people and",
                " would have been able to see in",
                " the Qur'an that very light which illuminates",
                " the earlier divine Scriptures. There would then",
                " have been no question of their abandoning",
                " their religion in order to follow the",
                " Prophet (peace be on him). To follow",
                " him would have caused neither break nor",
                " discontinuity; they would simply have gone one",
                " stage further along the same road.",
                "*98).",
                " Instead of reflecting on this seriously and",
                " dispassionately, they were seized by a fit",
                " of intransigence which intensified their opposition."
            ]
        },
        {
            "id": "[5:69]",
            "verse": "Indeed, those who have believed [in Prophet Muhammad] and those [before Him] who were Jews or Sabeans or Christians - those [among them] who believed in Allah and the Last Day and did righteousness - no fear will there be concerning them, nor will they grieve.",
            "description": [
                "See Towards Understanding the Qur'an, vol. I,",
                " Surah 2, verse 62, and n 80.",
                ""
            ]
        },
        {
            "id": "[5:70]",
            "verse": "We had already taken the covenant of the Children of Israel and had sent to them messengers. Whenever there came to them a messenger with what their souls did not desire, a party [of messengers] they denied, and another party they killed.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:71]",
            "verse": "And they thought there would be no [resulting] punishment, so they became blind and deaf. Then Allah turned to them in forgiveness; then [again] many of them became blind and deaf. And Allah is Seeing of what they do.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:72]",
            "verse": "They have certainly disbelieved who say, \"Allah is the Messiah, the son of Mary\" while the Messiah has said, \"O Children of Israel, worship Allah, my Lord and your Lord.\" Indeed, he who associates others with Allah - Allah has forbidden him Paradise, and his refuge is the Fire. And there are not for the wrongdoers any helpers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:73]",
            "verse": "They have certainly disbelieved who say, \"Allah is the third of three.\" And there is no god except one God. And if they do not desist from what they are saying, there will surely afflict the disbelievers among them a painful punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:74]",
            "verse": "So will they not repent to Allah and seek His forgiveness? And Allah is Forgiving and Merciful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:75]",
            "verse": "The Messiah, son of Mary, was not but a messenger; [other] messengers have passed on before him. And his mother was a supporter of truth. They both used to eat food. Look how We make clear to them the signs; then look how they are deluded.",
            "description": [
                "In these few words the Christian doctrine",
                " of the divinity of Christ is repudiated.",
                " The nature of the Messiah is clear",
                " from the indications given here; he was",
                " merely a human being. He was one",
                " born from the womb of a woman,",
                " who had a known genealogy, who possessed",
                " a physical body, who was subject to",
                " all the limitations of a human being",
                " and who had all the attributes characteristic",
                " of human beings. He slept, ate, felt",
                " the discomfort of heat and cold and",
                " was so human that he was even",
                " put to the test by Satan. How",
                " could any reasonable person believe that such",
                " a being was either God or a",
                " partner or associate of God in His",
                " godhead? But the Christians continue to insist",
                " on the divinity of the Messiah, whose",
                " life has been portrayed in their own",
                " Scriptures as that of a human. The",
                " fact of the matter is that they",
                " do not believe at all in the",
                " historical Messiah. They have woven a Messiah",
                " out of their imagination and have deified",
                " that imaginary being."
            ]
        },
        {
            "id": "[5:76]",
            "verse": "Say, \"Do you worship besides Allah that which holds for you no [power of] harm or benefit while it is Allah who is the Hearing, the Knowing?\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:77]",
            "verse": "Say, \"O People of the Scripture, do not exceed limits in your religion beyond the truth and do not follow the inclinations of a people who had gone astray before and misled many and have strayed from the soundness of the way.\"",
            "description": [
                "This refers to those misguided nations from",
                " whom the Christians derived their false beliefs",
                " and ways, particularly to the Hellenistic philosophers",
                " under the spell of whose ideas the",
                " Christians had veered from the straight way",
                " they had originally followed. The beliefs of",
                " the early followers of the Messiah were",
                " mainly in conformity with the reality they",
                " had witnessed, and conformed to the teachings",
                " they had received from their guide and",
                " mentor. But they later resorted to an",
                " exaggerated veneration of Jesus, and interpreted their",
                " own beliefs in the light of the",
                " philosophical doctrines and superstitious ideas of the",
                " neighbouring nations. Thus they invented an altogether",
                " new religion not even remotely related to",
                " the original teachings of the Messiah. In",
                " this connection the observations of a Christian",
                " theologian, the Reverend Charles Anderson Scott are",
                " significant. In a lengthy article entitled 'Jesus'",
                " Christ', published in the fourteenth edition of",
                " Encyclopaedia Britannica, he writes:",
                ". . .",
                " there is nothing in these three Gospels",
                " to suggest that their writers thought of",
                " Jesus as other than human, a human",
                " being specially endowed with the Spirit of",
                " God and standing in an unbroken relation",
                " to God which justified His being spoken",
                " of as the 'Son of God'. Even",
                " Matthew refers to Him as the carpenter's",
                " son and records that after Peter had",
                " acknowleged Him as Messiah he 'took Him",
                " aside and began to rebuke Him' (Matthew,",
                " xvi. 22). And in Luke the two",
                " disciples on the way to Emmaus can",
                " still speak of Him as 'a prophet",
                " mighty in deed and word before God",
                " and all the people' (Luke, xxiv. 19).",
                " It is very singular that in spite",
                " of the fact that before Mark was",
                " composed 'the Lord' had become the description",
                " of Jesus common among Christians, He is",
                " never so described in the second Gospel",
                " (nor yet in the first, though the",
                " word is freely used to refer to",
                " God). All three relate the Passion of",
                " Jesus with a fullness and emphasis of",
                " its great significance; but except the 'ransom'",
                " passage (Mark, x. 45) and certain words",
                " at the Last Supper there is no",
                " indication of the meaning which was afterwards",
                " attached to it. It is not even",
                " suggested that the death of Jesus had",
                " any relation to sin or forgiveness.",
                "A",
                " little further on he writes:",
                "That He",
                " ranked Himself as a prophet appears from",
                " a few passages such as 'It cannot",
                " be that a prophet perish out of",
                " Jerusalem'. He frequently referred to Himself as",
                " the Son of Man; but while this",
                " must be maintained in face of influential",
                " opinions to the contrary, the result for",
                " our purpose is less important than we",
                " might expect, for the possible meanings of",
                " the phrase are as numerous as the",
                " sources from which it may possibly have",
                " been derived. They range from simple 'man'",
                " through 'man in his human weakness' and",
                " the representative 'Man' to the supernatural man",
                " from heaven foreshadowed in Daniel. If we",
                " had to postulate one source and one",
                " meaning for the phrase as used by",
                " Jesus of Himself, it would probably be",
                " found in Psalm Ixxx., where the poignant",
                " appeal to God for the redemption of",
                " Israel runs out on the hope of",
                " a 'son of man whom thou madest",
                " strong for thyself. The same author adds:",
                "",
                "Certain words of Peter spoken at the",
                " time of Pentecost, 'A man approved of",
                " God', described Jesus as He was known",
                " and regarded by His contemporaries. He was",
                " 'found in fashion as a man', that",
                " is, in all particulars which presented themselves",
                " to outward observation He Appeared and behaved",
                " as one of the human race. He",
                " 'was made man'. The Gospels leave no",
                " room for doubt as to the completeness",
                " with which these statements are to be",
                " accepted. From them we learn that Jesus",
                " passed through the natural stages of development,",
                " physical and mental, that He hungered, thirsted,",
                " was weary and slept, that He could",
                " be surprised and require information, that He",
                " suffered pain and died. He not only",
                " made no claim to omniscience, He distinctly",
                " waived it. This is not to deny",
                " that He had insight such as no",
                " other ever had, into human nature, into",
                " the hearts of men and the purposes",
                " and methods of God. But there is",
                " no reason to suppose that He thought",
                " of the earth as other than the",
                " centre of the solar system, of any",
                " other than David as the author of",
                " the Psalms, or did not share the",
                " belief of His age that demons were",
                " the cause of disease. Indeed, any claim",
                " to omniscience would be not only inconsistent",
                " with the whole impression created by the",
                " Gospels, it could not be reconciled with",
                " the cardinal experiences of the Temptation, of",
                " Gethsemane and of Calvary. Unless such experiences",
                " were to be utterly unreal, Jesus must",
                " have entered into them and passed through",
                " them under the ordinary limitations of human",
                " knowledge, subject only to such modifications of",
                " human knowledge as might be due to",
                " prophetic insight or the sure vision of",
                " God.",
                "There is still less reason to",
                " predicate omnipotence of Jesus. There is no",
                " indication that He ever acted independently of",
                " God, or as an independent God. Rather",
                " does He acknowledge dependence upon God, by",
                " His habit of prayer and in such",
                " words as 'this kind goeth not forth",
                " save by prayer'. He even repudiates the",
                " ascription to Himself of goodness in the",
                " absolute sense in which it belongs to",
                " God alone. It is a remarkable testimony",
                " to the truly historical character of these",
                " Gospels that though they were not finally",
                " set down until the Christian Church had",
                " begun to look up to the risen",
                " Christ as to a Divine Being, the",
                " records on the one hand preserve all",
                " the evidence of His true humanity and",
                " on the other nowhere suggest that He",
                " thought of Himself as God.",
                "The same",
                " author also observes that:",
                "He proclaimed that",
                " at and through the Resurrection Jesus had",
                " been publicly installed as Son of God",
                " with power; and if the phrase has",
                " not wholly lost its official Messianic connotation,",
                " it certainly includes a reference to the",
                " personal Sonship, which Paul elsewhere makes clear",
                " by speaking of Him as God's 'own",
                " Son' . . .",
                "It may not",
                " be possible to decide whether it was",
                " the primitive community or Paul himself who",
                " first put full religious content into the",
                " title 'Lord' as used of Christ. Probably",
                " it was the former. But the Apostle",
                " undoubtedly adopted the title in its full",
                " meaning, and did much to make that",
                " meaning clear by transferring to 'the Lord",
                " Jesus Christ' many of the ideas and",
                " phrases which in the Old Testament had",
                " been specifically assigned to the Lord Jehovah.",
                " God 'gave unto Him that name that",
                " is above every name - the name",
                " of \"Lord\"'. At the same time by",
                " equating Christ with the Wisdom of God",
                " and with the Glory of God, as",
                " well as ascribing to Him Sonship in",
                " an absolute sense, Paul claimed for Jesus",
                " Christ a relation to God which was",
                " inherent and unique, ethical and personal, eternal.",
                " While, however, Paul in many ways and",
                " in many aspects, equated Christ with God,",
                " he definitely stopped short of speaking of",
                " him as 'God'.",
                "In another article in",
                " Encyclopaedia Britannica (xiv edition), under the title",
                " 'Christianity', the Reverend George William Knox writes",
                " as follows about the fundamental beliefs of",
                " the Church:",
                "Its moulds of thought are",
                " those of Greek philosophy, and into these",
                " were run the Jewish teachings. We have",
                " thus a peculiar combination - the religious",
                " doctrines of the Bible, as culminating in",
                " the person of Jesus, run through the",
                " forms of an alien philosophy.",
                "The Doctrine",
                " of the Trinity. The Jewish sources furnished",
                " the terms Father, Son and Spirit. Jesus",
                " seldom employed the last term and Paul's",
                " use of it is not altogether clear.",
                " Already in Jewish literature it had been",
                " all but personified (Cf. the Wisdom of",
                " Solomon). Thus the material is Jewish, though",
                " already doubtless modified by Greek influence: but",
                " the problem is Greek; it is not",
                " primarily ethical nor even religious, but it",
                " is metaphysical. What is the ontological relationship",
                " between these three factors? The answer of",
                " the Church is given in the Nicene",
                " formula, which is characteristically Greek, . .",
                " . Also significant in this connection are",
                " the following passages of another article in",
                " Encyclopaedia Britannica (xiv edition), entitled 'Church History':",
                " The recognition of Christ as the incarnation",
                " of the Logos was practically universal before",
                " the close of the 3rd century, but",
                " His deity was still widely denied, and",
                " the Arian controversy which distracted the Church",
                " of the 4th century concerned the latter",
                " question. At the Council of Nicaea in",
                " 325 the deity of Christ received official",
                " sanction and was given formulation in the",
                " original Nicene Creed. Controversy continued for some",
                " time, but finally the Nicene decision was",
                " recognised both in East and West as",
                " the only orthodox faith. The deity of",
                " the Son was believed to carry with",
                " it that of the Spirit, who was",
                " associated with Father and Son in the",
                " baptismal formula and in the current symbols,",
                " and so the victory of the Nicene",
                " Christology meant the recognition of the doctrine",
                " of Trinity as part of the orthodox",
                " faith. The assertion of the deity of",
                " the Son incarnate in Christ raised another",
                " problem which constituted the subject of dispute",
                " in the Christological controversies of the 4th",
                " and following centuries. What is the relation",
                " of the divine and human natures in",
                " Christ? At the Council of Chalcedon in",
                " 451 it was declared that in the",
                " person of Christ are united two complete",
                " natures, divine and human, which retain after",
                " the union all their properties unchanged. This",
                " was supplemented at the 3rd Council of",
                " Constantinople in 680 by the statement that",
                " each of the natures contains a will,",
                " so that Christ possesses two wills. The",
                " Western Church accepted the decisions of Nicaea,",
                " Chalcedon and Constantinople, and so the doctrines",
                " of the Trinity and of the two",
                " natures in Christ were handed down as",
                " orthodox dogma in West as well as",
                " East.",
                "Meanwhile in the Western Church the",
                " subject of sin and grace, and the",
                " relation of divine and human activity in",
                " salvation, received special attention; and finally, at",
                " the 2nd Council of Orange in 529,",
                " after both Pelagianism and semi-Pelagianism had been",
                " epudiated, a moderate form of Augustinianism was",
                " adopted, involving the theory that every man",
                " as a result of the Fall is",
                " in such a condition that he can",
                " take no steps in the direction of",
                " salvation until he has been renewed by",
                " the divine grace given in baptism, and",
                " that he cannot continue in the good",
                " thus begun except by the constant assistance",
                " of that grace, which is mediated only",
                " by the Catholic Church.",
                "It is evident",
                " from these statements of Christian scholars that",
                " it was exaggerated love and veneration of",
                " Christ which led the early Christians astray.",
                " This exaggeration and the use of expressions",
                " such as 'Lord' and 'Son of God'",
                " led to Jesus being invested with divine",
                " attributes and to the peculiar Christian notion",
                " of redemption, even though these could not",
                " be accommodated into the body of the",
                " teachings of Christ. When the Christians came",
                " to be infected with philosophical doctrines, they",
                " did not abandon the original error into",
                " which they had fallen, but tried to",
                " accommodate the errors of their predecessors through",
                " apologetics and rational explanations. Thus, instead of",
                " returning to the true teachings of Christ,",
                " they used logic and philosophy to fabricate",
                " one false doctrine after another. It is",
                " to this error that the Qur'an calls",
                " the Christians' attention in these verses."
            ]
        },
        {
            "id": "[5:78]",
            "verse": "Cursed were those who disbelieved among the Children of Israel by the tongue of David and of Jesus, the son of Mary. That was because they disobeyed and [habitually] transgressed.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:79]",
            "verse": "They used not to prevent one another from wrongdoing that they did. How wretched was that which they were doing.",
            "description": [
                "The corruption of any nation begins with",
                " that of a few individuals. If the",
                " collective conscience of that nation is alive,",
                " the pressure of public opinion keeps those",
                " persons in check and prevents the nation",
                " as a whole from becoming corrupted. But",
                " if instead of censuring such individuals, the",
                " nation leaves them free to behave corruptly,",
                " the corruption originally confined to a few",
                " continues to spread till it engulfs the",
                " whole nation. It was this which ultimately",
                " caused the degeneration of Israel. (For the",
                " curse against Israel in the words of",
                " David and Jesus see Psalms 10, 50",
                " and Matthew 23.)"
            ]
        },
        {
            "id": "[5:80]",
            "verse": "You see many of them becoming allies of those who disbelieved. How wretched is that which they have put forth for themselves in that Allah has become angry with them, and in the punishment they will abide eternally.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:81]",
            "verse": "And if they had believed in Allah and the Prophet and in what was revealed to him, they would not have taken them as allies; but many of them are defiantly disobedient.",
            "description": [
                "It seems natural that those who believe",
                " in God and the Prophets and the",
                " Scriptures, compared with the polytheists, would naturally",
                " be more sympathetic to those who at",
                " least share with them belief in God,",
                " in prophethood and in .revelation (whatever their",
                " disagreements on other religious issues). It was",
                " ironic, therefore, that the Jews should openly",
                " support the polytheists in the struggle between",
                " polytheism and monotheism, and that their sympathies",
                " in the conflict between those who rejected",
                " prophethood and those who believed in it",
                " should lie expressly with the former. Despite",
                " all this, they brazenly claimed to be",
                " true believers in God, in the Prophets",
                " and in the Scriptures."
            ]
        },
        {
            "id": "[5:82]",
            "verse": "You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah; and you will find the nearest of them in affection to the believers those who say, \"We are Christians.\" That is because among them are priests and monks and because they are not arrogant.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:83]",
            "verse": "And when they hear what has been revealed to the Messenger, you see their eyes overflowing with tears because of what they have recognized of the truth. They say, \"Our Lord, we have believed, so register us among the witnesses.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:84]",
            "verse": "And why should we not believe in Allah and what has come to us of the truth? And we aspire that our Lord will admit us [to Paradise] with the righteous people.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:85]",
            "verse": "So Allah rewarded them for what they said with gardens [in Paradise] beneath which rivers flow, wherein they abide eternally. And that is the reward of doers of good.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:86]",
            "verse": "But those who disbelieved and denied Our signs - they are the companions of Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:87]",
            "verse": "O you who have believed, do not prohibit the good things which Allah has made lawful to you and do not transgress. Indeed, Allah does not like transgressors.",
            "description": [
                "This verse embodies two directives. The first",
                " is that man should not attribute to",
                " himself the authority to proclaim things either",
                " lawful or unlawful according to his own",
                " wishes. Only that which God has held",
                " to be lawful is lawful, and only",
                " that which God has declared unlawful is",
                " unlawful. If men were to declare certain",
                " things either lawful or unlawful on their",
                " own authority, they would not be following",
                " the law of God but their own",
                " laws. The second directive is that they",
                " should not adopt the course of world-renunciation",
                " and abstention from worldly pleasures as the",
                " Christian monks, Hindu mendicants, Buddhist bhikshus and",
                " illuminist mystics did. Religious-minded and virtuous people",
                " have always tended to consider their physical",
                " and carnal desires an impediment to spiritual",
                " growth. They have considered suffering, deprivation from",
                " worldly pleasures and abstention from the means",
                " of worldly sustenance to be acts of",
                " goodness and indispensable for achieving proximity to",
                " God. Even some of the Companions leaned",
                " in this direction. The Prophet (peace be",
                " on him) once came to know that",
                " some Companions had resolved that they would",
                " fast without interruption, that instead of spending",
                " the night on their beds they would",
                " remain awake praying, that they would consume",
                " neither meat nor fat, and would have",
                " no (sexual) relations with women. The Prophet",
                " (peace be on him) addressed the people",
                " on this subject and said: 'I have",
                " not been commanded to do so. Even",
                " your own self has rights against you.",
                " So, fast on certain days and refrain",
                " from fasting on others. Stay awake praying",
                " at night and also sleep. Look at",
                " me; 1 sleep as well as stay",
                " awake (praying); sometimes I fast and sometimes",
                " I don't. I consume meat as well",
                " as fat. Whosoever dislikes my way does",
                " not belong to me.' He then added:",
                " 'What has happened to people that they",
                " have prohibited for themselves women, good food,",
                " perfumes, sleep and the pleasures of the",
                " world, whereas I have not taught you",
                " to become monks and priests. In my",
                " religion there is neither abstention from women",
                " nor from meat, neither seclusion nor withdrawal.",
                "",
                "For the purposes of self-control my religion",
                " has fasting. As for monasticism, all its",
                " benefits can be derived from jihad (struggle",
                " in the way of God). Serve God",
                " and associate none with Him. Perform Hajj",
                " and 'Umrah, establish Prayers, dispense Zakah and",
                " observe the fasts of Ramadan. Those who",
                " were destroyed before you were destroyed because",
                " they were severe with themselves, and when",
                " they became severe with themselves God became",
                " severe with them as well. It is",
                " the remnants of such people who you",
                " see in the oratories and hermitages of",
                " monks.' (Ibn Kathir, vol. 2, pp. 626",
                " and 628-9 - Ed.)",
                "There are traditions",
                " to the effect that the Prophet (peace",
                " be on him) once came to know",
                " that one of his Companions was always",
                " so preoccupied with worship and devotion that",
                " he did not approach his wife for",
                " long periods. The Prophet (peace be on",
                " him) called for him and directed him",
                " to go to his wife. On being",
                " told that he was fasting, the Prophet",
                " (peace be on him) asked him to",
                " break the fast and proceed to his",
                " wife. During the reign of 'Umar a",
                " lady once lodged the complaint that her",
                " husband fasted all day and prayed all",
                " night and had no relations with her.",
                " 'Umar appointed the famous Successor (Tabi'i), Ka'b",
                " b. Thawr al-Azdi to look into the",
                " matter. He issued the judgement that the",
                " husband had the right to spend three",
                " nights in Prayer if he so wished,",
                " but every fourth night was the right",
                " of his wife. (Fiqh al-Sunnah, vol. 2,",
                " p. 164 - Ed.)",
                "*105). 'Do not",
                " exceed the bounds of right' has a",
                " broad signification. To hold the things which",
                " are lawful to be unlawful, and to",
                " shun the things declared by God to",
                " be clean as if they were unclean,",
                " is in itself an act of wrongful",
                " excess. It should be remembered, at the",
                " same time, that extravagant indulgence even in",
                " clean things is an act of wrongful",
                " excess. Likewise, to overstep the limits of",
                " the permissible is also an act of",
                " wrongful excess. God disapproves of all three",
                " kinds of excess."
            ]
        },
        {
            "id": "[5:88]",
            "verse": "And eat of what Allah has provided for you [which is] lawful and good. And fear Allah, in whom you are believers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:89]",
            "verse": "Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days [is required]. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful.",
            "description": [
                "Since some people had taken an oath",
                " prohibiting for themselves the things which He",
                " had permitted, God laid down this injunction",
                " regarding oaths made inadvertently. The injunction makes",
                " it unnecessary to feel bound by the",
                " terms of inadvertent oaths, and for which",
                " one will not be reproached by God.",
                " And if a person had deliberately made",
                " an oath which entails sin he should",
                " not abide by his oath and should",
                " expiate it (see Towards Understanding the Qur'an,",
                " vol. I, Surah 2, nn. 243-4; for",
                " expiation see Surah 4, n. 125 above).",
                "",
                "*107). To be mindful of one's oaths",
                " has several meanings. First, one should make",
                " proper use of oaths and should not",
                " employ them either frivolously or sinfully. Second,",
                " when a person takes an oath, he",
                " should take care not to forget it",
                " lest he be led to break it.",
                " Third, when a man deliberately takes an",
                " oath regarding something sound in itself he",
                " should pay the penalty if he happens",
                " to violate it."
            ]
        },
        {
            "id": "[5:90]",
            "verse": "O you who have believed, indeed, intoxicants, gambling, [sacrificing on] stone alters [to other than Allah], and divining arrows are but defilement from the work of Satan, so avoid it that you may be successful.",
            "description": [
                "For 'altars' and divination by arrows see",
                " nn. 12 and 14 above. For games",
                " of chance see n. 14 above.",
                "While",
                " divination by arrow-shooting essentially constitutes a game",
                " of chance there is nevertheless a certain",
                " difference between the two, since divination by",
                " arrow-shooting, in addition to being a game",
                " of chance, is also tainted with polytheistic",
                " beliefs and superstitions. As for games of",
                " chance, this expression is applied to those",
                " games and acts in which accidental factors",
                " are considered the criteria for acquisition, fortune-making",
                " and the division of goods and property.",
                "",
                "*109). In this verse four things are",
                " categorically prohibited:",
                "(1) intoxicants;",
                "(2) games of",
                " chance;",
                "(3) places consecrated for the worship",
                " of anyone else besides God, and altars",
                " for either sacrifices or offerings in the",
                " name of others than God; and",
                "(4)",
                " polytheistic divination by arrow-shooting.",
                "The last three",
                " items have already been explained. (See Towards",
                " Understanding the Qur'an, vol. I, Surah 2:",
                " 219, n. 235 and Surah 5: 3,",
                " n. 14 above). Two injunctions had already",
                " been revealed concerning the prohibition of intoxicants",
                " (See Surahs 2: 219 and 4: 43).",
                " Before the revelation of the last injunction,",
                " the Prophet (peace be on him) had",
                " warned the people that intoxicants were highly",
                " displeasing to God. Hinting at the possibility",
                " of their being prohibited, he advised people",
                " to dispose of intoxicants if they had",
                " any. A little later on the present",
                " verse was revealed and the Prophet (peace",
                " be on him) then proclaimed that those",
                " who had intoxicants should neither consume nor",
                " sell them, but rather destroy them. Intoxicating",
                " liquors were poured into the streets of",
                " Madina. When asked if such liquor might",
                " be offered to the Jews as a",
                " gift the Prophet (peace be on him)",
                " replied in the negative and said: 'He",
                " Who has prohibited it has also required",
                " it not to be given away as",
                " a gift.' Some people inquired whether it",
                " was permitted to make vinegar out of",
                " such liquor. The Prophet (peace be on",
                " him) told them not to do so,",
                " but to throw it away instead. Another",
                " person asked insistently whether or not an",
                " intoxicant could be used as medicine. The",
                " Prophet (peace be on him) replied that",
                " far from being a remedy for any",
                " malady it was in itself a malady.",
                " Others sought permission to consume intoxicating liquor",
                " on the plea that they lived in",
                " a very cold region and had to",
                " work very hard, and that the people",
                " of that region habitually drank intoxicants to",
                " combat exhaustion and cold. The Prophet (peace",
                " be on him) inquired if the drink",
                " concerned did cause intoxication. On being told",
                " that it did, he said that they",
                " should abstain from it. They pointed out",
                " that the people of their region would",
                " not accept this, to which the Prophet",
                " (peace be on him) replied that they",
                " should fight them.",
                "It is reported by",
                " 'Abd Allah Ibn 'Umar that the Prophet",
                " (peace be on him) said: 'God has",
                " cursed khamr (wine) and him who drinks",
                " it, him who provides it to others",
                " and him who buys or sells it,",
                " him who squeezes (the grapes) into wine",
                " and him who causes others to squeeze",
                " grapes (in order to make wine), him",
                " who carries it and him to whom",
                " it is carried.' (See Ahmad b. Hanbal,",
                " Musnad, vol. 2, p. 97; vol. 1,",
                " p. 316; Abu Da'ud, 'Ashribah', 2 -",
                " Ed.)",
                "According to another tradition the Prophet",
                " (peace be on him) instructed not to",
                " eat at the table where intoxicating drinks",
                " were being taken. In the beginning the",
                " Prophet (peace be on him) even forbade",
                " the use of vessels in which intoxicating",
                " drinks had either been made or served.",
                " Later on, when the prohibition of drinks",
                " was completely observed the Prophet (peace be",
                " on him) withdrew the interdiction regarding the",
                " use of these vessels. (See Abu Da'ud,",
                " 'At'imah', 18; Tirmidhi, 'Adab', 43; Darimi, 'Ashribah',",
                " 15; Ahmad b. Hanbal, Musnad, vol. 1,",
                " p. 20; vol. 3, p. 339 -",
                " Ed.) Though the word khamr in Arabic",
                " means literally 'the drink made from grapes',",
                " it was also used figuratively for intoxicating",
                " liquors made from wheat, barley, raisins, dates",
                " and honey. The Prophet (peace be on",
                " him) applied the prohibition of wine to",
                " all intoxicants. In this regard we find",
                " categorical statements from the Prophet (peace be",
                " on him) embodied in traditions: 'Every intoxicant",
                " is khamr, and every intoxicant is prohibited.'",
                "",
                "'Every drink which causes intoxication is prohibited.'",
                " 'I forbid everything which intoxicates.' In a",
                " Friday sermon 'Umar defined khamr in the",
                " following manner: 'Whatever takes hold of the",
                " mind is khamr.' (See Bukhari, 'Wudu\", 71;",
                " 'Maghazi', 60, 'Ashribah', 4,10, 'Adab', 8, 'Ahkam',",
                " 22; Muslim, 'Ashribah', 67-9; Abu Da'ud, 'Ashribah',",
                " 5, 71; Ibn Majah, 'Ashribah', 9, 13,",
                " 14; Darimi, 'Ashribah', 8, 9; Muwatta', 'Dahaya',",
                " 8; Ahmad b. Hanbal, Musnad, vol. 1,",
                " pp. 274, 289, 350; vol. 2, pp.",
                " 16, 158, 171, 185, 429, 501; vol.",
                " 3, pp. 63, 66, 112, 119, 361;",
                " vol. 4, pp. 41, 416; vol. 6,",
                " pp. 36, 71, 72, 97, 131, 190",
                " and 226 - Ed.)",
                "The Prophet (peace",
                " be on him) also enunciated the following",
                " principle: 'If anything causes intoxication when used",
                " in large quantity, even a small quantity",
                " of it is prohibited.' 'If a large",
                " quantity of something causes intoxication, to drink",
                " even a palmful of it is prohibited.'",
                " (See Abu Da'ud, 'Ashribah', 5; Ibn Majah,",
                " 'Ashribah', 10; Ahmad b. Hanbal, Musnad, vol.",
                " 2, pp. 167, 179 and vol. 3,",
                " p. 343 - Ed.)",
                "In the time",
                " of the Prophet (peace be on him)",
                " no specific punishment had been laid down",
                " for drinking. A person caught drunk would",
                " be struck with shoes, fists, and whips",
                " made of twisted cloth and palm sticks.",
                " The maximum number of lashes to which",
                " any culprit was subjected was forty. In",
                " the time of Abu Bakr the punishment",
                " continued to be forty lashes. In the",
                " time of 'Umar the punishment initially remained",
                " at forty lashes also, but when he",
                " saw people persist in drinking he fixed",
                " the punishment at eighty lashes after consulting",
                " the Companions. This was considered the prescribed",
                " legal punishment for drinking by Malik and",
                " Abu Hanifah, and even by Shafi'i according",
                " to one tradition. But Ahmad b. Hanbal,",
                " and, according to a variant tradition, Shafi'i,",
                " considered the punishment to consist of forty",
                " lashes, and 'Ali is reported to have",
                " preferred this opinion.",
                "According to Islamic Law,",
                " it is the bounden duty of an",
                " Islamic government to enforce this prohibition. In",
                " the time of 'Umar the shop of",
                " a member of the Thaqif tribe, by",
                " the name of Ruwayshid, was burnt down",
                " because he carried on the sale of",
                " liquor. On another occasion a whole hamlet",
                " was set on fire because it had",
                " become a center of illegal traffic in",
                " liquor."
            ]
        },
        {
            "id": "[5:91]",
            "verse": "Satan only wants to cause between you animosity and hatred through intoxicants and gambling and to avert you from the remembrance of Allah and from prayer. So will you not desist?",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:92]",
            "verse": "And obey Allah and obey the Messenger and beware. And if you turn away - then know that upon Our Messenger is only [the responsibility for] clear notification.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:93]",
            "verse": "There is not upon those who believe and do righteousness [any] blame concerning what they have eaten [in the past] if they [now] fear Allah and believe and do righteous deeds, and then fear Allah and believe, and then fear Allah and do good; and Allah loves the doers of good.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:94]",
            "verse": "O you who have believed, Allah will surely test you through something of the game that your hands and spears [can] reach, that Allah may make evident those who fear Him unseen. And whoever transgresses after that - for him is a painful punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:95]",
            "verse": "O you who have believed, do not kill game while you are in the state of ihram. And whoever of you kills it intentionally - the penalty is an equivalent from sacrificial animals to what he killed, as judged by two just men among you as an offering [to Allah] delivered to the Ka'bah, or an expiation: the feeding of needy people or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns [to violation], then Allah will take retribution from him. And Allah is Exalted in Might and Owner of Retribution.",
            "description": [
                "When a person is in the state",
                " of pilgrim sanctity (ihram) it is prohibited",
                " for him both to hunt and to",
                " assist in hunting animals. Indeed, even if",
                " an animal has been hunted for him",
                " by someone else he may not eat",
                " it. However, if someone hunts an animal",
                " for himself and makes a gift of",
                " it to such a person, there is",
                " no harm in his eating it. There",
                " is an exception to this injunction and",
                " that is with regard to harmful animals.",
                " Snakes, scorpions, mad dogs and other such",
                " animals which cause injury to man may",
                " be killed even by one in the",
                " state of ihram. (See Bukhari, 'Talaq', 24;",
                " 'Sayd', 2; Abu Da'ud, 'Manasik', 40, 41;",
                " Tirmidhi, 'Hajj', 27; 'Sayd', 26 - Ed.)",
                "",
                "*111). It would also be 'two men",
                " of equity' (Surah al-Ma'idah 5: 95) to",
                " judge as to the number of persons",
                " one should feed or the number of",
                " days one should fast by way of",
                " expiation for killing a certain animal."
            ]
        },
        {
            "id": "[5:96]",
            "verse": "Lawful to you is game from the sea and its food as provision for you and the travelers, but forbidden to you is game from the land as long as you are in the state of ihram. And fear Allah to whom you will be gathered.",
            "description": [
                "Since one often runs out of provisions",
                " during a voyage and is left with",
                " no alternative but to catch sea creatures,",
                " fishing in the sea has been made",
                " lawful."
            ]
        },
        {
            "id": "[5:97]",
            "verse": "Allah has made the Ka'bah, the Sacred House, standing for the people and [has sanctified] the sacred months and the sacrificial animals and the garlands [by which they are identified]. That is so you may know that Allah knows what is in the heavens and what is in the earth and that Allah is Knowing of all things.",
            "description": [
                "In Arabia, the Ka'bah was not merely",
                " a sacred place of worship. Thanks to",
                " its central position and its sanctity, it",
                " nurtured the economic and cultural life of",
                " the whole peninsula. Since the entire populace",
                " was drawn towards the Ka'bah for the",
                " performance of Hajj and 'Umrah, their coming",
                " together brought about a measure of unity",
                " in the life of the Arabs which",
                " was otherwise rent with disunity. This enabled",
                " the people of various regions and tribes",
                " to establish social and cultural ties among",
                " themselves. Moreover, the security which reigned in",
                " the vicinity of the Ka'bah provided an",
                " impetus to creative literary activity, with the",
                " result that in the fairs held in",
                " the sacred territory, poets placed their poetic",
                " compositions before the audience, trying to excel",
                " one another. This led to the growth",
                " and flowering of their language and literature.",
                " Thanks, again, to the peace and security",
                " which reigned in the sacred territory, it",
                " became a major centre of trade and",
                " commerce. Moreover, since certain months of the",
                " year were regarded as sacred months in",
                " which there could be no bloodshed, the",
                " Arabs enjoyed peace and security for about",
                " a quarter of the year. It was",
                " during this period that caravans moved in",
                " freedom and with ease from one end",
                " of the peninsula to the other. The",
                " custom of consecrating animals for sacrifice, marked",
                " off from others by the collars around",
                " their necks, also facilitated the movement of",
                " caravans, for whenever the Arabs saw those",
                " animals with their collars signifying consecration for",
                " sacrifice, they-bent their heads in reverence and",
                " no predatory tribe had the courage to",
                " molest them.",
                "*114). Were they to consider",
                " even the social and economic aspects of",
                " the life of their people, the existing",
                " arrangements would provide them with clear testimony",
                " to the fact that God has deep",
                " and thorough knowledge of the interests and",
                " requirements of His creatures, and that He",
                " can ensure immensely beneficial effects on many",
                " sectors of human life by just one",
                " single commandment. During the several centuries of",
                " anarchy and disorder which preceded the advent",
                " of the Prophet (peace be on him),",
                " the Arabs were themselves unaware of their",
                " own interests and seemed bent upon self-destruction.",
                " God, however, was aware of their needs",
                " and requirements and by merely investing the",
                " Ka'bah with a central position in Arabia",
                " He ensured their national survival. Even if",
                " they disregarded innumerable other facts and reflected",
                " on this alone they would become convinced",
                " that the injunctions revealed by God were",
                " conducive to their well-being, and that underlying",
                " them were a great many benefits and",
                " advantages for them which they themselves could",
                " neither have grasped nor achieved by their",
                " own contriving."
            ]
        },
        {
            "id": "[5:98]",
            "verse": "Know that Allah is severe in penalty and that Allah is Forgiving and Merciful.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:99]",
            "verse": "Not upon the Messenger is [responsibility] except [for] notification. And Allah knows whatever you reveal and whatever you conceal.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:100]",
            "verse": "Say, \"Not equal are the evil and the good, although the abundance of evil might impress you.\" So fear Allah, O you of understanding, that you may be successful.",
            "description": [
                "This verse enunciates a standard of evaluation",
                " and judgement quite distinct from the standards",
                " employed by superficial people. For the latter,",
                " for instance, a hundred dollars are worth",
                " more than five dollars, since a hundred",
                " is more than five. But, according to",
                " this verse, if those hundred dollars have",
                " been earned in a manner entailing the",
                " disobedience of God the entire amount becomes",
                " unclean. If, on the contrary, a man",
                " earns five dollars while obeying God then",
                " this amount is clean; and anything which",
                " is unclean, whatever its quantity, cannot be",
                " worth that which is clean. A drop",
                " of perfume is more valuable than a",
                " heap of filth; a palmful of clean",
                " water is much more valuable than a",
                " huge cauldron brimming with urine. A truly",
                " wise person should therefore necessarily be content",
                " with whatever he acquires by clean, permissible",
                " means, however small and humble its quantity",
                " may be. He should not reach out",
                " for what is prohibited, however large in",
                " quantity and glittering in appearance."
            ]
        },
        {
            "id": "[5:101]",
            "verse": "O you who have believed, do not ask about things which, if they are shown to you, will distress you. But if you ask about them while the Qur'an is being revealed, they will be shown to you. Allah has pardoned that which is past; and Allah is Forgiving and Forbearing.",
            "description": [
                "People used to ask the Prophet (peace",
                " be on him) many questions which were",
                " of no practical relevance to either religious",
                " or day-to-day affairs. Once, for instance, a",
                " person asked the Prophet (peace be on",
                " him) in the presence of a crowd:",
                " 'Who is my real father?' Likewise, many",
                " people used to ask unnecessary questions about",
                " legal matters. By these uncalled for inquiries",
                " they sought knowledge of matters which had",
                " for good reasons, been deliberately left undetermined",
                " by the Law-giver. In the Qur'an, for",
                " example. Pilgrimage had been declared obligatory. A",
                " person who became aware of this came",
                " to the Prophet (peace be on him)",
                " and inquired: 'Has it been made obligatory",
                " to perform it every year?' To this",
                " the Prophet (peace be on him) made",
                " no reply. When he inquired for the",
                " second time the Prophet (peace be on",
                " him) again stayed silent. On being asked",
                " for the third time, he said: 'Pity",
                " on you! Had I uttered \"Yes\" in",
                " reply to your question, it would have",
                " become obligatory to perform it every year.",
                " And then you would not have been",
                " able to observe it and would have",
                " been guilty of disobedience.' (See Bukhari, 'Riqaq',",
                " 22; 'Zakah', 53; I'tisam', 3; 'Adab', 6;",
                " Muslim, 'Aqdiyah', 10, 11, 13, 14; Darimi,",
                " 'Riqaq', 38; Muwatta', 'Kalam', 20; Ahmad b.",
                " Hanbal, Musnad, vol. 2, pp. 327, 360,",
                " 367; vol. 4, pp. 246, 249, 250,",
                " 251, 255 - Ed.)",
                "The Prophet (peace",
                " be on him) discouraged people from being",
                " over-inquisitive and unnecessarily curious about every question.",
                " We find in the Hadith the following",
                " saying from the Prophet (peace be on",
                " him): 'The worst criminal among the Muslims",
                " is the one who inquired about something",
                " which had not been made unlawful, and",
                " then it was declared so, because of",
                " his inquiry.' (Bukhari, I'tisam', 3; Muslim, Fada'il',",
                " 132, 133; Abu Da'ud, 'Sunnah', 6 -",
                " Ed.) According to another tradition the Prophet",
                " (peace be on him) said: 'God has",
                " imposed upon you certain obligations, do not",
                " neglect them; He has imposed certain prohibitions,",
                " do not violate them; He has imposed",
                " certain limits, do not even approach them;",
                " and He has remained silent about certain",
                " matters - and has not done so",
                " out of forgetfulness - do not pursue",
                " them.' (See Towards Understanding the Qur'an, vol.",
                " I, Surah 2, n. 110 - Ed.)",
                "",
                "In both these traditions an important fact",
                " has been called to our attention. In",
                " matters where the Law-giver has chosen to",
                " lay down certain injunctions only broadly, without",
                " any elaborate details, or quantitative specifications, He",
                " has done so not because of neglect",
                " or forgetfulness. Such seeming omissions are deliberate,",
                " and the reason thereof is that He",
                " does not desire to place limitations upon",
                " people, but prefers to allow them latitude",
                " and ease in following His commandments. Now",
                " there are some people who make unnecessary",
                " inquiries, cause elaborately prescribed, inflexibly determined and",
                " restrictive regulations to be added to the",
                " Law. Some others, in cases where such",
                " details are in no way deducible from",
                " the text, resort to analogical reasoning, thereby",
                " turning a broad general rule into an",
                " elaborate law full of restrictive details, and",
                " an unspecified into a specified rule. Both",
                " sorts of people put Muslims in great",
                " danger. For, in the area of belief,",
                " the more detailed the doctrines to which",
                " people are required to subscribe, the more",
                " problematic it becomes to do so. Likewise,",
                " in legal matters, the greater the restriction,",
                " the greater the likelihood of violation."
            ]
        },
        {
            "id": "[5:102]",
            "verse": "A people asked such [questions] before you; then they became thereby disbelievers.",
            "description": [
                "Some people first indulged in hair-splitting arguments",
                " about their laws and dogma, and thereby",
                " wove a great web of credal elaborations",
                " and legal minutiae. Then they became enmeshed",
                " in this same web and thus became",
                " guilty of dogmatic errors and the violation",
                " of their own religious laws. The people",
                " referred to here are the Jews, and",
                " the Muslims who followed in their footsteps",
                " and left no stone unturned, despite the",
                " warnings contained in the Qur'an and in",
                " the sayings of the Prophet Muhammad (peace",
                " be on him)."
            ]
        },
        {
            "id": "[5:103]",
            "verse": "Allah has not appointed [such innovations as] bahirah or sa'ibah or wasilah or ham. But those who disbelieve invent falsehood about Allah, and most of them do not reason.",
            "description": [
                "Just as, in the Indian subcontinent, cows,",
                " oxen and goats are set free after",
                " being consecrated either to God or to",
                " some idol or shrine or to some",
                " saintly person, and just as people consider",
                " it prohibited either to put them to",
                " work, to slaughter them or to derive",
                " any other kind of benefit from them,",
                " so the Arabs of the Jahiliyah period",
                " also let loose certain animals after consecrating",
                " them. Such animals were variously named.",
                "Bahirah",
                " was the name of a female camel",
                " which had already borne five young, the",
                " last of which was a male. The",
                " practice was to slit the ear of",
                " such a camel and then let her",
                " loose. Thereafter no one could ride her,",
                " use her milk, slaughter her or shear",
                " her hair. She was entitled to graze",
                " and drink water wherever she liked.",
                "Sa'ibah",
                " was the name of either a male",
                " or female camel which had been let",
                " loose after consecration as a mark of",
                " gratitude in fulfilment of a vow taken",
                " for either the recovery from some ailment",
                " or delivery from some danger. In the",
                " same way the female camel which had",
                " borne ten times, and each time a",
                " female, was also let loose.",
                "Wasilah. If",
                " the first kid born to a goat",
                " was a male, it was slaughtered in",
                " the name of the deities; but if",
                " it was a female, it was kept",
                " by the owners for themselves. If twins",
                " were born and one of them was",
                " a male and the other a female",
                " goat, the male was not slaughtered but",
                " rather let loose in the name of",
                " the deities. This male goat was called",
                " wasilah.",
                "Ham. If the young of camels",
                " in the second degree of descent had",
                " become worthy of riding they were let",
                " loose. Likewise, if ten offspring had been",
                " borne by a female camel she was",
                " also let loose, and called ham."
            ]
        },
        {
            "id": "[5:104]",
            "verse": "And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" they say, \"Sufficient for us is that upon which we found our fathers.\" Even though their fathers knew nothing, nor were they guided?",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:105]",
            "verse": "O you who have believed, upon you is [responsibility for] yourselves. Those who have gone astray will not harm you when you have been guided. To Allah is you return all together; then He will inform you of what you used to do.",
            "description": [
                "What is stressed here is that rather",
                " than occupying himself unduly with examining faults",
                " in the belief and conduct of others,",
                " a man should pay greater attention to",
                " a critical examination of his own conduct.",
                " His primary concern should be with his",
                " own faith and conduct. If a man",
                " is himself obedient to God, observes his",
                " duties to Him and to His creatures",
                " including his duty to promote what is",
                " good and forbid what is evil, and",
                " lives according to the dictates of righteousness",
                " and honesty, he has fulfilled his obligation",
                " and if others persist either in false",
                " beliefs or in moral corruption their errors",
                " cannot harm him.",
                "This verse in no",
                " way means that a man should care",
                " only for his own salvation and should",
                " remain unconcerned with the reform of others.",
                " Abu Bakr removed this misconception in one",
                " of his sermons when he remarked: 'You",
                " recite this verse but interpret it erroneously.",
                " I have heard the Messenger of Allah",
                " (peace be on him) say that when",
                " people see corruption but do not try",
                " to change it; and when they see",
                " a wrong-doer commit wrong but do not",
                " prevent him from doing so, it is",
                " not unlikely that God's chastisement will seize",
                " them all. By God, it is incumbent",
                " upon you that you bid what is",
                " good and forbid what is evil or",
                " else God will grant domination upon you",
                " to those who are the worst among",
                " you. They will greatly chastise you and",
                " then when your righteous ones pray to",
                " God, their prayers will not be answered.'",
                ""
            ]
        },
        {
            "id": "[5:106]",
            "verse": "O you who have believed, testimony [should be taken] among you when death approaches one of you at the time of bequest - [that of] two just men from among you or two others from outside if you are traveling through the land and the disaster of death should strike you. Detain them after the prayer and let them both swear by Allah if you doubt [their testimony, saying], \"We will not exchange our oath for a price, even if he should be a near relative, and we will not withhold the testimony of Allah. Indeed, we would then be of the sinful.\"",
            "description": [
                "That is, pious, straightforward and trustworthy Muslims.",
                " *That is, non-Muslims - Ed.",
                "*121). This",
                " shows that the testimony of non-Muslim witnesses",
                " in cases involving Muslims is appropriate only",
                " when no Muslim is available as a",
                " witness."
            ]
        },
        {
            "id": "[5:107]",
            "verse": "But if it is found that those two were guilty of perjury, let two others stand in their place [who are] foremost [in claim] from those who have a lawful right. And let them swear by Allah, \"Our testimony is truer than their testimony, and we have not transgressed. Indeed, we would then be of the wrongdoers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:108]",
            "verse": "That is more likely that they will give testimony according to its [true] objective, or [at least] they would fear that [other] oaths might be taken after their oaths. And fear Allah and listen; and Allah does not guide the defiantly disobedient people.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:109]",
            "verse": "[Be warned of] the Day when Allah will assemble the messengers and say, \"What was the response you received?\" They will say, \"We have no knowledge. Indeed, it is You who is Knower of the unseen\"",
            "description": [
                "This refers to the Day of Judgement.",
                "",
                "*123). The reference here is to the",
                " response of the world to the call",
                " of the Prophets.",
                "*124). This reply indicates",
                " that the Prophets would say that their",
                " knowledge was confined to that limited, outward",
                " response which they had encountered during their",
                " lifetimes. The true reaction to their call",
                " at various places and in different forms",
                " would only be known completely to God",
                " Himself."
            ]
        },
        {
            "id": "[5:110]",
            "verse": "[The Day] when Allah will say, \"O Jesus, Son of Mary, remember My favor upon you and upon your mother when I supported you with the Pure Spirit and you spoke to the people in the cradle and in maturity; and [remember] when I taught you writing and wisdom and the Torah and the Gospel; and when you designed from clay [what was] like the form of a bird with My permission, then you breathed into it, and it became a bird with My permission; and you healed the blind and the leper with My permission; and when you brought forth the dead with My permission; and when I restrained the Children of Israel from [killing] you when you came to them with clear proofs and those who disbelieved among them said, \"This is not but obvious magic.\"",
            "description": [
                "The initial question would be addressed to",
                " all Prophets as such. Then each of",
                " them would be called upon to bear",
                " witness separately, as stated in several places",
                " in the Qur'an. In this connection the",
                " question that will be addressed to Jesus",
                " is specifically mentioned here.",
                "*126). That is,",
                " with God's command Jesus brought people to",
                " life from the state of death."
            ]
        },
        {
            "id": "[5:111]",
            "verse": "And [remember] when I inspired to the disciples, \"Believe in Me and in My messenger Jesus.\" They said, \"We have believed, so bear witness that indeed we are Muslims [in submission to Allah].\"",
            "description": [
                "Jesus is being told that the faith",
                " of the disciples in him was also",
                " the result of God's grace and succour,",
                " for he, himself, did not have the",
                " power to produce even one man of",
                " faith in that land of disbelief. It",
                " is also made clear that the true",
                " religion of the disciples of Jesus was",
                " Islam."
            ]
        },
        {
            "id": "[5:112]",
            "verse": "[And remember] when the disciples said, \"O Jesus, Son of Mary, can your Lord send down to us a table [spread with food] from the heaven? [Jesus] said,\" Fear Allah, if you should be believers.\"",
            "description": [
                "Since the disciples have been mentioned here,",
                " the continuity of the subject is interrupted",
                " momentarily in order to introduce another incident",
                " connected with the disciples. This clearly shows",
                " that those who had been directly instructed",
                " by Jesus considered him merely a human",
                " being and a slave of God; they",
                " had no conception of their master either",
                " being God or a partner of God",
                " or the son of God. Jesus had,",
                " rather, presented himself to them as a",
                " slave of God with no claims to",
                " divine authority.",
                "One might feel inclined here",
                " to raise the question: What is the",
                " occasion for this parenthetical interjection in a",
                " conversation that is to take place on",
                " the Day of Judgement? This parenthesis, in",
                " my opinion, is not in fact part",
                " of such a conversation, but rather forms",
                " part of a discussion in this world",
                " regarding a conversation that will take place",
                " on the Day of Judgement. The conversation",
                " that will take place on the Day",
                " of Judgement is mentioned here precisely in",
                " order that the Christians may derive a",
                " lesson from it and direct themselves to",
                " the right way. Hence, the mention of",
                " this incident regarding the disciples - even",
                " though it seems to interrupt the continuity",
                " of narration - is in no sense",
                " out of place.*That is, are Muslims -",
                " Ed."
            ]
        },
        {
            "id": "[5:113]",
            "verse": "They said, \"We wish to eat from it and let our hearts be reassured and know that you have been truthful to us and be among its witnesses.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:114]",
            "verse": "Said Jesus, the son of Mary, \"O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:115]",
            "verse": "Allah said, \"Indeed, I will sent it down to you, but whoever disbelieves afterwards from among you - then indeed will I punish him with a punishment by which I have not punished anyone among the worlds.\"",
            "description": [
                "The Qur'an is silent on the question",
                " of whether this meal was sent down",
                " in response to this prayer. There is",
                " also no other authoritative basis to help",
                " us arrive at a clear conclusion. It",
                " is possible that the repast was actually",
                " sent down. It is also possible that",
                " the disciples withdrew their prayer after hearing",
                " the stern warning in response to it.",
                ""
            ]
        },
        {
            "id": "[5:116]",
            "verse": "And [beware the Day] when Allah will say, \"O Jesus, Son of Mary, did you say to the people, 'Take me and my mother as deities besides Allah?'\" He will say, \"Exalted are You! It was not for me to say that to which I have no right. If I had said it, You would have known it. You know what is within myself, and I do not know what is within Yourself. Indeed, it is You who is Knower of the unseen.",
            "description": [
                "The Christians were not content merely with",
                " deifying Jesus and the Holy Spirit. They",
                " even turned Mary, the mother of Jesus,",
                " into a full-fledged object of worship. The",
                " Bible does not contain even the remotest",
                " suggestion that Mary was in any way",
                " either divine or superhuman. During the first",
                " three centuries after the Messiah, such a",
                " concept was totally alien to Christian thinking.",
                " Towards the end of the third century",
                " of the Christian era, however, some theologians",
                " of Alexandria employed, for the first time,",
                " the expression 'Mother of God' in connection",
                " with Mary. Subsequently, belief in Mary's divinity",
                " and the practice of Mariolatry began to",
                " spread among Christians. Even then, however, the",
                " Church was not prepared to accord official",
                " approval to this belief and denounced the",
                " Mariolaters as heretics. It was not until",
                " the Council of Ephesus in 431 that",
                " the Church officially used the expression 'Mother",
                " of God' for Mary. The result was",
                " that Mariolatry began to spread fast within",
                " the Church itself, so much so that,",
                " by the time of the revelation of",
                " the Qur'an, Mary had become so important",
                " a deity that she obscured even the",
                " Father, the Son and the Holy Ghost.",
                " Statues of Mary adorned the cathedrals. She",
                " became the object of rites and worship.",
                " People addressed their prayers to her. She",
                " was regarded as the one who responded",
                " to people's supplications, who heeded people's grievances",
                " and complaints, who relieved them in distress,",
                " who provided support and succour to the",
                " helpless. For a devout Christian there could",
                " be no greater source of comfort and",
                " inner strength than the belief that he",
                " enjoyed the support and patronage of the",
                " 'Mother of God'. In the preamble of",
                " his code, Justinian had declared Mary to",
                " be the defender and supporter of his",
                " empire, and his general, Marses, sought Mary's",
                " guidance on the battlefield. Heraclius, a contemporary",
                " of the Prophet (peace be on him),",
                " had a picture of Mary on his",
                " standard and he was confident that by",
                " her grace the standard would never be",
                " lowered. Several centuries later the Protestants argued",
                " strongly against Mariolatry during the movement which",
                " led to the Reformation. The Roman Catholic",
                " Church has, nevertheless, managed so far to",
                " cling to Mariolatry in one form or",
                " another."
            ]
        },
        {
            "id": "[5:117]",
            "verse": "I said not to them except what You commanded me - to worship Allah, my Lord and your Lord. And I was a witness over them as long as I was among them; but when You took me up, You were the Observer over them, and You are, over all things, Witness.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:118]",
            "verse": "If You should punish them - indeed they are Your servants; but if You forgive them - indeed it is You who is the Exalted in Might, the Wise.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:119]",
            "verse": "Allah will say, \"This is the Day when the truthful will benefit from their truthfulness.\" For them are gardens [in Paradise] beneath which rivers flow, wherein they will abide forever, Allah being pleased with them, and they with Him. That is the great attainment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[5:120]",
            "verse": "To Allah belongs the dominion of the heavens and the earth and whatever is within them. And He is over all things competent.",
            "description": [
                ""
            ]
        }
    ]
}