{
    "name": "An-Najm",
    "id": 53,
    "verse-count": 62,
    "verse-info": [
        {
            "verse-id": "[53:1]",
            "verse": "By the star when it descends,",
            "description": [
                "In the original the word \"an-najm\"has been",
                " used. Ibn `Abbas, Mujahid and Sufyan Thauri",
                " opine that it implies the Pleides. Ibn",
                " Jarir and Zamakhshari have held this same",
                " interpretation as preferable, for in Arabic when",
                " the word an -najm is used absolutely",
                " it usually implies the Pleides. Suddi says",
                " that it implies Venus; and Abu `Ubaidah,",
                " the grammarian, holds that here the word",
                " an-najm has been used generically so as",
                " to express this idea: \"When the day",
                " dawned, and the stars set.\" In view",
                " of the context we are of the",
                " opinion that this last interpretation is more",
                " preferable."
            ]
        },
        {
            "verse-id": "[53:2]",
            "verse": "Your companion [Muhammad] has not strayed, nor has he erred,",
            "description": [
                "\"Your Companion\" implies the Holy Messenger of",
                " Allah (upon whom be peace) and the",
                " addressees are the Quraish. The word Sahib",
                " as used in the original means a",
                " friend, a companion, a close associate. Here,",
                " making mention of the Holy Prophet by",
                " the word Sahib-u-kum (yew Companion) instead of",
                " \"Our Messenger\" is very meaningful. This is",
                " meant to make the people of the",
                " Quraish realize: \"The person being mentioned is",
                " no stranger to you: he is not",
                " an outsider whom you may not be",
                " knowing or recognizing already. He is a",
                " man of your own clan and tribe;",
                " he lives and moves among you; even",
                " your children know who and what he",
                " is, what is his character, what are",
                " his dealings, what are his ways and",
                " habits and characteristics, and how he has",
                " passed his life among you so far.",
                " If same one of you were to",
                " say an improbable thing about him, there",
                " would be a thousand men among you",
                " who knew him, who could see for",
                " themselves whether what was said actually applied",
                " to him or not. \"",
                "*3) This",
                " is the thing for which an oath",
                " has been sworn by the setting star",
                " or stars. \"Going astray\" means a person's",
                " adopting a wrong way being unaware of",
                " the right way, and \"being deluded\" means",
                " his adopting the wrong way knowingly and",
                " consciously. The verse means: \"Muhammad (upon whom",
                " be Allah's peace and blessings) is a",
                " well-known man among you. Your accusation that",
                " he has gone astray, or is misguided,",
                " is utterly wrong. In fact, he is",
                " neither gone astray nor misguided.\" Here, the",
                " propriety of swearing by the setting stars",
                " is that in the darkness of the",
                " starry night a person cannot see the",
                " things of his surroundings clearly, and from",
                " their vague appearances can form wrong judgments",
                " about them, e.g.. he may take a",
                " tra for a ghost in the dark,",
                " a string for a snake, a rock",
                " in the sand for a beast of",
                " prey. But when the stars have set",
                " and the day has dawned, everything appears",
                " before man in its real form and",
                " shape, and there remains no doubt whatever",
                " about the reality of anything. The same",
                " is the case also of Muhammad (upon",
                " whom be Allah's peace and blessings) among",
                " you. His life and personality is. not",
                " hidden in darkness, but is manifest like",
                " the bright dawn. You are aware that",
                " this \"companion of yours\" is a right-minded,",
                " wise and sagacious man. How can somebody",
                " from among the Quraish have the misunderstanding",
                " that he has gone astray? You also",
                " know how well-intentioned and honest and righteous",
                " person he is. How can one of",
                " you form the view that he has",
                " knowingly adopted a crooked way not only",
                " for himself but has started inviting others",
                " also to the same falsehood?"
            ]
        },
        {
            "verse-id": "[53:3]",
            "verse": "Nor does he speak from [his own] inclination.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:4]",
            "verse": "It is not but a revelation revealed,",
            "description": [
                "It means this: \"The things for which",
                " you accuse him of having gone astray",
                " or been misled and deceived, have neither",
                " been fabricated by himself nor motivated by",
                " any selfish desire on his part, but",
                " they have been sent down, and are",
                " being sent down, to him by God.",
                " He did not intend to become a",
                " Prophet of his own desire so that",
                " he might have laid a claim to",
                " Prophet hood in order to satisfy his",
                " desire, but when Allah appointed him to",
                " that office through Revelation, then only did",
                " he rise to preach his mission and",
                " to tell you that he had been",
                " appointed God's Messenger to you. Likewise, this",
                " invitation to Islam, this teaching of the",
                " doctrine of Tauhid, this news about the",
                " gathering together of all mankind on the",
                " Day of Resurrection and their accountability, the",
                " truths that he is presenting about the",
                " Universe and Man and the principles of",
                " leading a pure life, are not a",
                " philosophy propounded by himself, but the knowledge",
                " of all this has been bestowed on",
                " him by Revelation. Likewise, this Qur'an that",
                " he recites before you, is also not",
                " of his own composition but it is",
                " Divine Word which is sent down to",
                " him by Revelation.\"",
                "Here, the question arises:",
                " To which of the words spoken by",
                " the Holy Prophet do Allah's Words: \"He",
                " does not speak of his own desire;",
                " it is only a Revelation which is",
                " sent down to him,\" apply? Do they",
                " apply to everything that he spoke, or",
                " to sonic of his words and not",
                " to others? The answer is: As far",
                " as the Qur'an is concerned, the Divine",
                " Words apply to it most completely. As",
                " for the other words, apart from the",
                " Qur'an, which the Holy Prophet (upon whom",
                " be peace) spoke, they could inevitably be",
                " of three kinds: First, those words which",
                " he employed for preaching religion and inviting",
                " others to Allah, and for explaining the",
                " themes, teachings and commands of the Qur'an,",
                " or for giving admonition and instruction to",
                " the people to fulfil the object for",
                " which the Qur'an was revealed. In this",
                " regard, obviously nobody can have the doubt",
                " that, God forbid, he fabricated these things",
                " from his own mind. In these matters,",
                " his position, in fact, was of the",
                " official interpreter of the Qur'an and of",
                " Allah's authorised representative. Although these things were",
                " not revealed to him literally as the",
                " Qur'an was revealed; yet these were necessarily",
                " based on the same knowledge that he",
                " had been given by Revelation. The only",
                " difference between the Qur'an and these was",
                " that the Qur'an, both in word and",
                " in meaning, was entirely from Allah, and",
                " in these other things the meanings were",
                " those taught by AIIah and the words",
                " those which he himself employed to express",
                " those meanings. On the basis of this",
                " very distinction, the Qur'an has been described",
                " as wahi-jali (manifest Revelation) and the Holy",
                " Prophet's other sayings as wahi-khafi (concealed Revelation).",
                "",
                "The second kind of the words were",
                " those which the Holy Prophet spoke in",
                " connection with the struggle of raising Allah's",
                " Word and his services for establishing Islam.",
                " In this regard, he had to perform",
                " countless duties of different kinds as the",
                " leader and guide of the Muslim community.",
                " In this many a time he took",
                " counsel with his Companions as well, and",
                " followed their advice instead of his own",
                " view. On being asked he sometimes told",
                " them that he was expressing a particular",
                " view not under Allah's command but as",
                " his personal opinion, and on several occasions",
                " it so happened that he said something",
                " on the basis of his own opinion",
                " and later. an instruction came down against",
                " it from Allah. None of the things",
                " of this nature that he said or",
                " did could be based on a selfish",
                " motive. As for the question whether these",
                " sayings were based on Divine inspiration, the",
                " answer is that except for the things",
                " in regard to which he made it",
                " explicit that they were not based on",
                " Divine command, or about which he took",
                " counsel with his Companions and accepted their",
                " advice, or with regard to a thing",
                " against which AIlah sent down an instruction",
                " after he had said or done something",
                " on the basis of his personal judgment,",
                " all other things were based on concealed",
                " Revelation (wahi khafi) just like the things",
                " of the first kind. For the office",
                " of the leader and guide of the",
                " Islamic Movement and the chief of the",
                " believing community and the ruler of the",
                " Islamic State, which he held, was not",
                " self-invented or bestowed by the people, but",
                " he had been appointed to it by",
                " Allah, and whatever he said and did",
                " in carrying out the duties of this",
                " office, his position in it was of",
                " the representative of Divine, Will. In this",
                " matter, whatever he said on the basis",
                " of his personal judgment, his judgment in",
                " those matters was approved by Allah, and",
                " was, derived from the light of the",
                " knowledge which Allah had blessed him with.",
                " That is why whenever his personal judgment",
                " was even slightly turned away from Allah's",
                " pleasure, it was immediately rectified by manifest",
                " Revelation (wahi jali; ). This rectification of",
                " some of his personal judgments is itself",
                " a proof that all the rest of",
                " his religious judgments and interpretations were precisely",
                " in accordance with Divine Will.",
                "The third",
                " kind of the things were those he",
                " said concerning common matters of life as",
                " a man, which had nothing to do",
                " with the duties of Prophet hood, which",
                " he said before being appointed a Prophet",
                " as well as continued saying even after",
                " having been appointed a Prophet. About this",
                " kind of the Things it should be",
                " understood at the outset that there was",
                " no dispute with the disbelievers concerning them.",
                " They had not accused him of being",
                " a misled and misguided person because of",
                " these but because of the first two",
                " kinds of the things. These things were",
                " not disputed and therefore could not become",
                " the cause of a verse from Allah.",
                " But although they were not the subject",
                " of any dispute, yet the fact is",
                " that in this private aspect of his",
                " life also never did the Holy Prophet",
                " (upon whom be peace) utter a word",
                " that was opposed to the truth, but",
                " at alI times, under all conditions, his",
                " words and deeds remained within the bounds",
                " that Allah had prescribed for living his",
                " life as a Prophet and righteous man.",
                " Therefore, the light of Revelation shone in",
                " that sphere as well. This same thing",
                " has been reported from the Holy Prophet",
                " (upon whom be peace) in some authentic",
                " Ahadith. In Musnad Ahmad a Tradition has",
                " been related on the authority of Hadrat",
                " Abu Hurairah, saying that the Holy Prophet",
                " once said: \"I never say anything but",
                " what is true and right. \" A",
                " Companion said, \"O Messenger of Allah, you",
                " say things sometimes in jest also.' The",
                " Holy Prophet replied: \"Indeed, I never say",
                " anything but the truth. \" According to",
                " Musnad Ahmad and Abu Da'ud, Hadrat `Abdullah",
                " bin `Amr bin 'As is reported to",
                " have said: \"I used to write down",
                " whatever I heard from the sacred tongue",
                " of the Holy Prophet (upon whom be",
                " peace) so as to preserve it. The",
                " people of the Quraish forbade me to",
                " do this, saying: 'You arc writing down",
                " everything whereas the Holy Prophet is a",
                " man: he sometimes says things in the",
                " state of anger too'. At this I",
                " gave up writing. Afterwards when I mentioned",
                " this before the Holy Prophet, he said:",
                " 'You should continue writing: By Him in",
                " Whose hand is my life, never have",
                " I said anything but the truth'.\" (For",
                " a complete discussion of this question, see",
                " my book Tafhimat vol. I, Article: Prophethood",
                " and Its Injunctions)."
            ]
        },
        {
            "verse-id": "[53:5]",
            "verse": "Taught to him by one intense in strength -",
            "description": [
                "That is, \"There is no human being",
                " who teaches him this, as you seem",
                " to think, but he obtains this knowledge",
                " through a supernatural source. \" According to",
                " some people, \"mighty in power\" implies AIIah",
                " Himself, but a great majority of the",
                " commentators are agreed that it implies the",
                " Angel Gabriel (upon whom be peace). This",
                " same view has been reported from Hadrat",
                " 'Abdullah bin Mas'ud, Hadrat 'A'ishah, Hadrat Abu",
                " Hurairah, Qatadah, Mujahid and Rabi` bin Anas.",
                " Ibn Jarir, Ibn Kathir, Razi, Alusi and",
                " others also have adopted this very view.",
                " Shah Waliyullah and Maulana Ashraf 'Ali Thanwi",
                " also have followed this same view in",
                " their translations. And the fact is that",
                " from the other explanations of the Qur'an",
                " itself also this very thing is confirmed.",
                " In Surah Takvir it has been said:",
                " \"This indeed is the word of a",
                " noble Messenger, who has great power and",
                " high rank with the Owner of the",
                " Throne: there he is obeyed and held",
                " as trustworthy. And (O people of Makkah),",
                " your Companion is not mad. He has",
                " seen that Messenger on the bright horizon.\"",
                " (vv. 19-23). Then, in Surah Al-Baqarah: 97,",
                " the Angel has been mentioned by name",
                " through whom this teaching had been revealed",
                " on the heart of the Prophet: \"Say",
                " to them: Whoever is enemy to Gabriel",
                " should understand that he has, by Allah's",
                " Command, revealed to your heart the Qur'an.\"",
                " If these verses are read with this",
                " verse of Surah An-Najm, there remains no",
                " doubt that here \"mighty in power\" implies",
                " the Angel Gabriel and not AIIah. More",
                " about, it to follow.",
                "Here, some people",
                " express the doubt as to how the",
                " Angel Gabriel can be regarded as the",
                " Holy Prophet Muhammad's teacher. For this would",
                " mean that he was the teacher and",
                " the Holy Prophet (upon whom be peace)",
                " his pupil, and this would place him",
                " above the Holy Prophet in rank. But",
                " this suspicion is misplaced, because Gabriel did",
                " not impart instruction to the Holy Prophet",
                " from any personal knowledge of his own,",
                " which might give him superiority over the",
                " Holy Prophet. AIlah, in fact, had made",
                " him a means of conveying knowledge to",
                " the Holy Prophet, and he was the",
                " Holy Prophet's teacher in the metaphoric sense",
                " for being only a medium of instruction.",
                " That dces not give him any superiority",
                " whatever. To quote an example: After the",
                " Prayer was prescribed five times a day,",
                " AIlah sent Gabriel (peace be upon him)",
                " to teach the Holy Prophet (upon whom",
                " be peace) the correct times of the",
                " Prayers, and he led him in the",
                " Prayers five times daily for two days.",
                " This has been related in Bukhari, Muslim,",
                " Abu Da'ud, Tirmidhi and Mu'watta and other",
                " collections of the Ahadith, with authentic chains",
                " of reporters, and in this the Holy",
                " Prophet (upon whom be peace) himself has",
                " explained that he was the follower and",
                " Gabriel his leader in the Prayers. But",
                " his being made the leader only for",
                " the purpose of instruction does not mean",
                " that he was superior to the Holy",
                " Prophet in rank."
            ]
        },
        {
            "verse-id": "[53:6]",
            "verse": "One of soundness. And he rose to [his] true form",
            "description": [
                "Ibn `Abbas and Qatadah take dhu mirra-tin",
                " of the Text in the meaning of",
                " beautiful and grand. Mujahid, Hasan Basri, Ibn",
                " Zaid and Sufyan Thauri say that it",
                " mean: strong and powerful. Said bin Musayyab",
                " has expressed the opinion that it means",
                " wise. In a Hadith the Holy Prophet",
                " has used this word in the sense",
                " of healthy and sound. In Arabic usage",
                " this word is used in the meaning",
                " of sound in judgement, wise and learned",
                " also. Allah has chosen this word for",
                " Gabriel (peace be upon him) here because",
                " he possesses both intellectual and physical powers",
                " to the highest degree. We have adopted",
                " only one of these meanings in the",
                " translation, for his physical powers have been",
                " mentioned in the preceding sentence."
            ]
        },
        {
            "verse-id": "[53:7]",
            "verse": "While he was in the higher [part of the] horizon.",
            "description": [
                "The horizon means the eastern edge of",
                " the sky where the sun rises and",
                " the day dawns. The same has been",
                " referred to as ufuq mubin (bright horizon)",
                " in Surah Takvir: 23. Both the verses",
                " make it explicit that when the Holy",
                " Prophet (upon whom be peace) saw Gabriel",
                " (peace be upon him) for the first",
                " time, he had appeared on the eastern",
                " horizon of the sky; and there are",
                " several authentic Traditions which show that at",
                " that time he was in his real",
                " shape in which Allah has created him.",
                " We shall quote all such Traditions below.",
                " -"
            ]
        },
        {
            "verse-id": "[53:8]",
            "verse": "Then he approached and descended",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:9]",
            "verse": "And was at a distance of two bow lengths or nearer.",
            "description": [
                "That i:, \"After appearing on the uppermost",
                " edge of the sky, Gabriel started advancing",
                " towards the Prophet till he reached and",
                " hung suspended about him in mid air.",
                " Then he bent down to him and",
                " came within just two bow-lengths or even",
                " closer. \" The commentators generally have taken",
                " qaba qausain in the meaning of \"two",
                " bow-lengths\", but Hadrat `Abdullah bin `Abbas and",
                " Hadrat `Abdullah bin Mas`ud have taken qaus",
                " in the meaning of a dhira'(an amm-length,",
                " cubit), and have interpreted the words kama",
                " qaba qausain, saying that the distance between",
                " them was reduced to only two arm-lengths.",
                " And since all bows are not equal",
                " in length, the approximate distance has been",
                " expressed by \"two bow-lengths away or even",
                " closer."
            ]
        },
        {
            "verse-id": "[53:10]",
            "verse": "And he revealed to His Servant what he revealed.",
            "description": [
                "The sentence fa auha ila `abd-i -hi",
                " ma auha of the Text can have",
                " two translations: (1) \"He revealed to His",
                " (Allah's) servant whatever he revealed\"; and (2)",
                " \"He (Allah) revealed to His own servant",
                " whatever He revealed. \" According to the",
                " first translation, the meaning would be: Gabriel",
                " revealed to the servant of Allah whatever",
                " he had to reveal\"; according to the",
                " second: \"Allah revealed through Gabriel to His",
                " servant whatever He had to reveal. \"",
                " The commentators have given both these meanings;",
                " the first meaning, however, fits in better",
                " with the context, .and the same has",
                " been reported from Hadrat Hasan Basri and",
                " lbn Zaid. Here, the question may be",
                " asked: \"How can the pronoun of abd-i-hi",
                " turn to Allah instead of to the",
                " subject of auha, whereas Allah has nowhere",
                " been mentioned from the beginning of the",
                " Surah to this place ?\" The answer",
                " is that wherever it becomes apparent from",
                " the context that the antecedent of a",
                " pronoun refers to a particular person, the",
                " pronoun turns to him automatically whether it",
                " has been mentioned before or not. There",
                " are several instances of this available in",
                " the Qur'an itself. In Surah AI-Qadr: l,",
                " AIIah says: \"We have sent it down",
                " in the Night of Glory.\" There is",
                " no mention of the Qur'an in this",
                " sentence, but the context explicitly shows that",
                " the antecedent of the pronoun is the",
                " Qur'an. At another place Allah says: 'If",
                " Allah were to seize the people because",
                " of their misdeeds, He would not leave",
                " any creature (unpunished) on its back. \"",
                " In this sentence there is no mention",
                " of the earth anywhere, but the context",
                " clearly shows that \"its back\" implies \"the",
                " earth's back\". In Surah Ya Sin: 69,",
                " it has been said: \"We have not",
                " taught him poetry, nor does poetry behove",
                " him.\" Here, there is no mention of",
                " the Holy Prophet, neither before this sentence",
                " nor after it, yet the context is",
                " explicit that the antecedent of the pronouns",
                " is the Holy Prophet himself. In Surah",
                " Ar-Rahman: 26, it has been said: \"Whatever",
                " exists on it shall perish.\" There is",
                " no mention of the earth either before",
                " or after it, but the style clearly",
                " shows that the pronoun of 'alaika turns",
                " to it. In Surah AI-Waqi'ah: 35, it",
                " has been said: \"We shall have created",
                " them especially.\" There is no noun or",
                " pronoun before or after it to which",
                " the pronoun of hunna may be referring.",
                " It is apparent from the context that",
                " it signifies the women of Paradise. Thus,",
                " as auha ila `abd-i hi cannot at",
                " all mean that Gabriel revealed to his",
                " servant, the meaning necessarily would be that",
                " \"Gabriel revealed w the servant of AIlah\",",
                " or that \"Allah revealed to His own",
                " servant through Gabriel. \""
            ]
        },
        {
            "verse-id": "[53:11]",
            "verse": "The heart did not lie [about] what it saw.",
            "description": [
                "That is, \"As the Holy Prophet Muhammad",
                " (upon whom be peace) observed all this",
                " in broad daylight in the waking condition,",
                " with open eyes, his heart did not",
                " deem it was a delusion, or that",
                " it was a jinn or a devil,",
                " who had appeared before him, or that",
                " it was an imaginary figure, or a",
                " vision that he was seeing while awake,",
                " but his heart fully confirmed what his",
                " eyes saw. He did not for a",
                " moment doubt that it was the Angel",
                " Gabriel and the Message he was conveying",
                " was indeed God's Revelation to him.\" Here,",
                " the question arises: How is it that",
                " the Holy Prophet (upon whom be peace)",
                " did not entertain any doubt at all",
                " concerning such a wonderful and extraordinary observation,",
                " and he confirmed with full faith that",
                " whatever his eyes saw was an actual",
                " fact and not an imaginary figure, nor",
                " a jinn or devil ? When we",
                " consider this question deeply we are led",
                " to five reasons for it:",
                "First, that",
                " the external conditions in which this observation",
                " was made, testified to its truth and",
                " validity. The Holy Prophet did not observe",
                " this in darkness, or in a state",
                " of meditation, or in a vision, or",
                " in a sleep-like condition, but the day",
                " had dawned and he was fully awake,",
                " and he was seeing the whole scene",
                " in the broad daylight in the open",
                " with his own eyes precisely in the",
                " way as one sees the other things",
                " in the world. If doubt is cast",
                " on this, then whatever we see in",
                " the day time, e.g. rivers, mountains, men,",
                " houses, etc., also would become doubtful and",
                " illusory. Second, that the Holy Prophet's own",
                " internal condition also testified to its validity.",
                " He was in his full senses. He",
                " had no idea whatever in his mind",
                " that he should observe, or that he",
                " was going to observe, such a thing.",
                " His mind was absolutely free from such",
                " a thought and any longing for it,",
                " and in this state he met with",
                " this experience suddenly. There was no room",
                " for doubting that the eyes were seeing",
                " an actual scene, but that an imaginary",
                " thing had appeared before his eyes.",
                "Third,",
                " that the being who had appeared before",
                " him in that condition was so marvelous",
                " and magnificent, so beautiful and bright, that",
                " neither had he ever had any concept",
                " of such a being before that he",
                " could take it for a product of",
                " his own imagination, nor could a jinn",
                " or a devil have such an appearance",
                " that he would have taken him for",
                " a being other than an angel. Hadrat",
                " 'Abdullah bin Mas'ud has reported that the",
                " Holy Prophet (upon whom be peace) said:",
                " 'I saw Gabriel in the shape that",
                " he had six hundred wings.\" (Musnad Ahmad),",
                " In another Tradition Ibn Mas`ud has further",
                " explained that each single wing of Gabriel",
                " (on whom be peace) was so extensive",
                " that it seemed to be covering the",
                " whole horizon (Musnad Ahmad), Allah Himself has",
                " described him as shadid al-quwa (one mighty",
                " in power) and dhu-mirra (one endowed with",
                " great wisdom).",
                "Fourth, that the teaching that",
                " the being was imparting alsa testified to",
                " the validity of the observation. The Holy",
                " Prophet had no concept of the knowledge",
                " that he received suddenly through him, a",
                " knowledge that comprehended the realities and truths",
                " of the whole Universe. About it he",
                " could not have the doubt that it",
                " consisted of his own ideas which were",
                " being set and arranged by his own",
                " mind. Likewise, there was no ground for",
                " thinking either that it was Satan who",
                " was imparting that knowledge to him and",
                " thus deluding him, for it is not",
                " for Satan that he should teach, nor",
                " can he ever teach, the doctrine of",
                " Tauhid to man as against polytheism and",
                " idol-worship, that he should warn of the",
                " accountability of the Hereafter, that he should",
                " create contempt against ignorance and its practices,",
                " that he should invite people to moral",
                " excellences, and should exhort a person not",
                " only to accept that teaching himself but",
                " should also rise to ' eradicate polytheism,",
                " injustice, wickedness and sin from the world",
                " and replace these evils by the virtues",
                " of Tauhid, justice, equity and piety.",
                "The",
                " fifth and by far the most important",
                " reason is that when Allah chooses a",
                " certain person for His Prophet hood, He",
                " cleanses his heart of doubts and suspicions",
                " and evil suggestions and fills it with",
                " faith and conviction. In this state no",
                " hesitation or vacillation is caused in his",
                " mind about the validity of whatever his",
                " eyes see and his ears hear. He",
                " accepts with complete satisfaction of the heart",
                " every truth that is revealed to him",
                " by his Lord, whether it is in",
                " the form of an observation that he",
                " is made to witness with the eyes,",
                " or in the form of knowledge which",
                " he is inspired with, or in the",
                " form of a Revelation that is recited",
                " to him literally. In all these cases",
                " the Prophet is fully aware that he",
                " is absolutely safe and secure against Satanic",
                " interference of every kind, and whatever he",
                " is receiving in any form is precisely",
                " and definitely from his Lord. Like all",
                " God-given feelings this sense and feeling of",
                " the Prophet also is a certainty which",
                " does not admit of any misunderstanding. Just",
                " as the fish has a God-given sense",
                " of being a swimmer, the bird of",
                " being a bird, and the man of",
                " being a man, and there can be",
                " no likelihood of any misunderstanding in this",
                " regard, so has the Prophet also a",
                " Godgiven sense of his being a Prophet.",
                " He does not even for a moment",
                " entertain the doubt that he has perhaps",
                " been involved in the misunderstanding of being",
                " a Prophet."
            ]
        },
        {
            "verse-id": "[53:12]",
            "verse": "So will you dispute with him over what he saw?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:13]",
            "verse": "And he certainly saw him in another descent",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:14]",
            "verse": "At the Lote Tree of the Utmost Boundary -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:15]",
            "verse": "Near it is the Garden of Refuge -",
            "description": [
                "This is about the Holy Prophet's second",
                " meeting with Gabriel (upon whom be peace)",
                " in which he appeared before him in",
                " his real shape and nature. The place",
                " where this meeting took place has been",
                " described as Sidrat-al-muntaha, along with which it",
                " has been said that nearby it is",
                " located Jannat al ma'va (Garden of Repose).",
                "",
                "Sidrah in Arabic means the lote-tree and",
                " muntaha the extreme edge or limit. Thus,",
                " literally, sidrat al-muntaha means \"the lote-tree that",
                " is situated on the extreme edge or",
                " limit\". 'Allama Alusi in his Ruh al-Ma'ani",
                " has explained it thus: \"At this the",
                " knowledge of every learned man comes to",
                " an end; whatever is beyond it is",
                " known to none but Allah. \" Almost",
                " the same explanation of it has been",
                " given by Ibn Jarir in his commentary,",
                " and by Ibn kathir in An-Nihayah fi",
                " Gharib alHadith wal-Athar. It is difficult for",
                " us to know what kind of a",
                " lote-tree it is that is situated at",
                " the farthest end of this physical world",
                " and what is its nature and state.",
                " These are the mysteries of the Divine",
                " Universe which are incomprehensible for us. In",
                " any case, it is some such thing",
                " for which there was no more appropriate",
                " word than \"sidrah \" in human language,",
                " in the sight of AIIah.",
                "\" Jannat",
                " al-ma'va' literally means \"the Jannat (Garden) that",
                " is to be an abode. \" Hadrat",
                " Hasan Basri says that this is the",
                " same Jannat which the believers and righteous",
                " will be given in the Hereafter, and",
                " from this same verse he has argued",
                " that that Jannat is in the heavens.",
                " Qatadah says that this is the Jannat",
                " in which the souls of the martyrs",
                " are kept; it does not imply the",
                " Jannat that is to be given in",
                " the Hereafter. Ibn 'Abbas also says the",
                " same but adds that the Jannat to",
                " be granted to the believers in the",
                " Hereafter is not in the heavens but",
                " here on the earth."
            ]
        },
        {
            "verse-id": "[53:16]",
            "verse": "When there covered the Lote Tree that which covered [it].",
            "description": [
                "That is, \"its Splendor and Glory exceeds",
                " aII description. The Divine Glory and effulgence",
                " was such as can neither be conceived",
                " by man nor can any haman language",
                " depict it adequately."
            ]
        },
        {
            "verse-id": "[53:17]",
            "verse": "The sight [of the Prophet] did not swerve, nor did it transgress [its limit].",
            "description": [
                "That is, \"On the one hand, the",
                " Holy Messenger of Allah was so firm",
                " and steadfast that even in the Presence",
                " of the great Divine Splendor and Glory",
                " his sight was not dazzled and he",
                " went on gazing at it with great",
                " composure. On the other, he was in",
                " such complete control of himself and so",
                " exclusively attentive that he kept his mind",
                " and his sight focused upon the object",
                " for which he had been summoned, and",
                " he did not let his sight wander",
                " to any side like a spectator's to",
                " have a glimpse of the wonderful objects",
                " present there. This can be understood by",
                " the example of a person who gets",
                " an opportunity to be present in the",
                " court of a mighty and powerful king,",
                " where he comes across such glory and",
                " splendor that had never cven been conceived",
                " by him before. Now, if he be",
                " a shallow person, he would be struck",
                " with amazement, and if he be un-initiated",
                " in the court coquette, he would become",
                " heedless of the royal presence and would",
                " turn his gaze to every side to",
                " look at the embellishments of the court.",
                " But a noble, reverent and dutiful person",
                " will neither be stupefied and confounded, nor",
                " will become lost in witnessing the court,",
                " but will present himself with full dignity",
                " and will keep his mind concentrated on",
                " the object for which he had been",
                " summoned in the royal court. This very",
                " virtue and quality of the Holy Prophet",
                " (upon whom be peace) has been esteemed",
                " in this verse."
            ]
        },
        {
            "verse-id": "[53:18]",
            "verse": "He certainly saw of the greatest signs of his Lord.",
            "description": [
                "This verse clearly starts that the Holy",
                " Prophet had not seen AIIah but His",
                " wonderful Sings. Even according to the context,",
                " this second meeting also took place with",
                " the same being with whom the first",
                " meeting had taken place. Therefore, one will",
                " have to admit that neither the one",
                " whom he had first seen on the",
                " uppermost horizon was Allah nor he whom",
                " he saw afterwards by the farthest lote-tree",
                " was AIIah. Had he seen Allah Almighty",
                " on either occasion it would have been",
                " a great thing and must certainly have",
                " been mentioned here explicitly. About the Prophet",
                " Moses it has been said in the",
                " Qur'an that he had besought to see",
                " AIIah And the reply given was: Lan",
                " tarani \"You cannot sec Me.\" (Al-A'raf 143).",
                " Now, obviously if this honour that was",
                " not granted to the Prophet Moses, had",
                " been granted to the Holy Prophet Muhammad",
                " (upon whom be Allah's peace and blessings),",
                " it would by itself have been such",
                " an important thing which must have been",
                " stated in clear words. But we see",
                " that nowhere in the Qur'an has it",
                " been said that the Holy Prophet had",
                " seen his Sustainer and Lord. But in",
                " Surah Bani Isra'il also, where mention has",
                " been made of the event of Mi`raj",
                " (Ascension), it has been said that \"We",
                " had transported Our servant...so that We may",
                " show him some of Our Signs\" (li-nuriya",
                " -hu min ayat-i na), and here in",
                " connection with his visit at Sidrat al-muntaha",
                " also it has been said: \"He saw",
                " of the greatest Signs of His Lord\"",
                " (laqad ra a min ayat-i Rabb-i-hil kubra).",
                "",
                "In view of these reasons apparently there",
                " was no ground for the dispute whether",
                " the Holy Prophet (upon whom be peace)",
                " on both these occasions had seen Allah",
                " Almighty or the Angel Gabriel (on whom",
                " be peace). But, the reason that has",
                " given rise to this dispute is that",
                " the traditions of Hadith differ on this",
                " question. Below we reproduce in their sequence",
                " the Ahadith that have been reported from",
                " the different Companions in this regard:",
                "(1)",
                " Traditions of Hadrat `A'ishah:",
                "Hadrat Masruq has",
                " stated in Kitab at-Tafsir of Bukhari asked",
                " Hadrat 'A'ishah: O mother of the faithful!",
                " Had Muhammad (upon whom be Allah's peace)",
                " seen his Lord and Sustainer? She replied:",
                " Your question has terrified me. Why do",
                " you forget that if a person lays",
                " claim to three of the things, he",
                " would lay a false claim ? (The",
                " first of these things that Hadrat `A'ishah",
                " mentioned was): Whoever among you says that",
                " Muhammad (upon whom be Allah's peace) had",
                " seen his Lord and Sustainer, tells a",
                " lie. Then Hadrat `A'ishah recited these verses:",
                " La tudriku-hul-absar \"Eyes cannot comprehend Him; \"",
                " and: Ma kana li-bashar-in anyyukallima-hullah-u ills wahy-an",
                " au min-wara-i-hijab- in au yursila rasul an",
                " fayu-hia bi-idhni hi ma yasha-u: \"It is",
                " not given to any mortal that Allah",
                " should speak to him, face to face;",
                " He, speaks either through Revelation (secret instruction),",
                " or from behind a curtain, or He",
                " sends a messenger (an angel), who by",
                " Allah's Command, reveals whatever He wills.\" (Ash-Shura:",
                " 51). Then she said: 'The Holy Prophet",
                " (upon whom be peace) in fact had",
                " seen Gabriel (on whom be peace) in",
                " his real shape twice.\"",
                "A part of",
                " this Hadith is also found in Bukhari",
                " (chapter 4 of Kitab atTauhid) And in",
                " the tradition that Bukhari has cited from",
                " Masruq in Kitab Bida 'aI-Khalq, he states:",
                " \"Hearing this thing from Hadrat `A'ishah, I",
                " asked: What would then Allah's words, Thumma",
                " dana fa-tadalla, fa-Kana qaba qausain-i au adha.",
                " mean ? She replied: This refers to",
                " Gabriel; he always appeared before the Holy",
                " Prophet in human shape, but on this",
                " occasion he had appeared before him in",
                " his real shape and nature and the",
                " whole horizon was filled with him. \"",
                "",
                "In Muslim (Kitab al-Iman, Babu fi Dhikr",
                " Sidrat al-muntaha) this conversation between Hadrat `A'ishah",
                " and Masruq has been related in greater",
                " detail, its most important part being this:",
                " \"Hadrat `A'ishah said: The one who claims",
                " that Muhammad (upon whom be Allah's peace",
                " and blessings) had seen his Lord and",
                " Sustainer imputes a lie to Allah. Masruq",
                " says: I was leaning back. Hearing this",
                " I sat up and said: Mother of",
                " the faithful, do not make haste: Has",
                " not Allah said: wa lagad ra'a-hu bi/-ufuq-i/",
                " mubin? and lagad ra'a-hu nazlat-an ukhra ''",
                " Hadrat 'A'ishah replied: I was the first",
                " one in this Ummah who inquired of",
                " the Holy Prophet (upon whom be peace)",
                " about this. He had replied: \"It was",
                " Gabriel (on whom be peace). I have",
                " never seen him in his real shape",
                " and form in which Allah has created",
                " him except on these two occasions. On",
                " these two occasions I saw him descending",
                " from the heavens and his great presence",
                " was covering the whole space between the",
                " earth and the heavens.\"",
                "Ibn Marduyah has",
                " related this tradition of Masruq, thus: \"Hadrat",
                " `A'ishah said: I was indeed the first",
                " person who asked the Holy Prophet: Did",
                " you ever sec your Lord and Sustainer?",
                " He replied: No, I had only seen",
                " Gabriel descending from the heavens.\"",
                "(2) Traditions",
                " of Hadrat `Abdullah bin Mas`ud:",
                "Bukhari (Kitab",
                " at-Tafsir), Muslim (Kitab al Iman) and Tirmidhi",
                " (Abwab' at-Tafsir) contain a tradition on the",
                " authority of Zin bin Hubaish, saying that",
                " Hadrat `Abdullah bin Mas`ud gave this commentary",
                " of fa-kana qaba qausain-i au adha: \"The",
                " Holy Prophet (upon whom be peace) saw",
                " Gabriel (on whom be peace) in the",
                " shape that he had six hundred wings.\"",
                "",
                "In the other traditions of Muslim, Zirr",
                " bin Hubaish has reported this very commentary",
                " of Ma kadhab al-fu adu ma ra'a",
                " and lagad ra a min ayat-i Rabbi-hil",
                " kubra from Hadrat `Abdullah bin Mas`ud. In",
                " Musnad Ahmad this commentary of Ibn Mas`ud",
                " has been reported by 'Abdur Rahman bin",
                " Yazid and Abu Wail also besides Zirr",
                " bin Hubaish. Furthermore, in Musnad Ahmad two",
                " more traditions of Zirr bin Hubaish have",
                " been related in which Hadrat `Abdullah bin",
                " Mas`ud commenting upon wa lagad ra a-hu",
                " nazlat-an ukhra, 'inda-sidrat-il muntaha stated: \"The Holy",
                " Messenger of AIIah said that he saw",
                " Gabriel by the lote-tree he had six",
                " hundred wings. \"Imam Ahmad has cited a",
                " tradition on the same subject, on the",
                " authority of Shaqiq bin Salamah also, in",
                " which he states that he heard Hadrat",
                " `Abdullah bin Mas'ud saying that the Holy",
                " Prophet himself had said that he had",
                " seen Gabriel (on whom be peace) in",
                " that shape at sidrat al-muntaha.",
                "(3) When",
                " 'Ata' bin Abi Rabah asked Hadrat Abu",
                " Hurairah the meaning of the verse lagad",
                " ra a-hu nazlat-an ukhra, he replied: \"The",
                " Holy Prophet had seen Gabriel (on whom",
                " be peace).\": (Muslim: Kitab al lman).",
                "(4)",
                " Imam Muslim has related in kitab al-Iman",
                " two traditions of `Abdullah bin Shaqiq on",
                " the authority of Hadrat Abu Dharr Ghifari,",
                " in one of which he says that",
                " he asked the Holy Prophet: \"Did you",
                " ever see your Lord?\" The Holy Prophet",
                " replied: Nur-un anna ara-hu; and in the",
                " other he says that the Holy Prophet",
                " gave this answer to his question: Ra",
                " 'aitu nur-an. Of the first answer of",
                " the Holy Prophet Ibn al-Qayyim has given",
                " this meaning in his Zad al-Ma ad:",
                " \"Between me and the sight of my",
                " Lord there was Light,\" and of the",
                " second this: \"I did not see my",
                " Lord but only a Light.\" Nasa'i and",
                " Ibn Abi Hatim have reported the saying",
                " of Hadrat Abu Dharr, thus: \"The Holy",
                " Prophet had seen his Lord with the",
                " heart (mind), not with the eyes.",
                "(5",
                " ) Imam Muslim in his Kitab al-Iman",
                " has related this tradition from Hadrat Abu",
                " Musa al-Ash`ari: \"The Holy Prophet said: The",
                " sight of no one from among His",
                " creatures has reached Allah Almighty.\"",
                "(6) Traditions",
                " of Hadrat `Abdullah bin `Abbas:",
                "According to",
                " Muslim, when Hadrat `Abdullah bin `Abbas was",
                " asked the meaning of: Ma kadhab al-fu",
                " 'adu ma ar'a, wa lagad ra'a hu",
                " nazlat-an ukhra, he said: \"The Holy Messenger",
                " of Allah saw his Lord twice with",
                " his heart. \" This tradition is also",
                " contained in Musnad Ahmad.",
                "Ibn Marduyah has",
                " cited this saying of Ibn `Abbas, on",
                " the authority of 'Ata' bin Abi Rabah:",
                " The Holy Messenger of Allah had not",
                " seen Allah with the eyes but with",
                " the heart. \"",
                "Nasa'i contains a tradition",
                " from `Ikrimah saying that Ibn `Abbas said",
                " \"Do you wonder at this that Allah",
                " made the Prophet Abraham (peace be upon",
                " him) His friend, blessed Moses with His",
                " Word and honoured Muhammad (upon whom be",
                " Allah's peace and blessings) with His sight?\"",
                " Hakim also has cited this tradition and",
                " held it as authentic.",
                "In Tirmidhi, there",
                " is a tradition from Sha`bi to the",
                " effect that Ibn `Abbas said in a",
                " gathering: \"Allah had distributed His Sight and",
                " His Word between Muhammad (upon whom be",
                " Allah's peace) and Moses (upon whom be",
                " peace). He spoke to Moses twice, and",
                " Muhammad saw Him twice \" Hearing these",
                " very words of lbn 'Abbas, Masruq had",
                " approached Hadrat `A'ishah with the question: \"Had",
                " Muhammad (upon whom be Allah's peace) seen",
                " his Lord?\" She had replied: What you",
                " have said has made my hair stand",
                " on end.\" After this the same dialogue",
                " that we have cited above under the",
                " tradition of Hadrat 'A'ishah tool place between",
                " Hadrat 'A'ishah and Masruq. In one of",
                " the traditions reported in Tirmidhi from lbn",
                " `Abbas, he says: \"The Holy Prophet had",
                " seen Allah Almighty.\" In yet another he",
                " says: \"He had seen Him twice\", and",
                " in a third one; \"He had seen",
                " Him with the heart.\"",
                "In Musnad Ahmad",
                " a tradition from Ibn `Abbas is to",
                " the effect: \"The Holy Prophet said: I",
                " saw my Lord, the blessed, the exalted.",
                " \" In another tradition he says: \"The",
                " Holy Messenger of Allah said: Tonight my",
                " Lord came to me in the best",
                " shape. \" I think that by this",
                " the Holy Prophet meant that he saw",
                " Allah Almighty in a vision. Tabarani and",
                " Ibn Marduyah have related this tradition also",
                " from Ibn `Abbas: \"The Holy Messenger of",
                " Allah had seen his Lord twice, once",
                " with the eyes and the second time",
                " with the heart. \"",
                "(7) Muhammad bin",
                " Ka'b al-Qurzi states that when some of",
                " the Companions asked the Holy Prophet,: 'Did",
                " you ever see your Lord? he replied:",
                " I have seen Him twice with my",
                " heart.\" (Ibn Abi Hatim) Ibn Jarir has",
                " related this very tradition, thus: \"He said:",
                " I have not seen Him with the",
                " eye, but with the heart twice. \"",
                "",
                "(8) A tradition of Hadrat Anas bin",
                " Malik which Imam Bukhari has cited in",
                " his Kitab at-Tauhid in connection with the",
                " event of the Mi'raj, on the authority",
                " of Sharik bin `Abdullah, contains words to",
                " the effect: \"When the Holy Prophet reached",
                " sidrat al-muntaha, Allah Almighty drew near him",
                " and hung suspended above him till there",
                " remained between the Holy Prophet and Him",
                " a distance equal to two bow-lengths or",
                " even Iess. Then, what Allah revealed to",
                " him included the Command for SO Prayers.\"",
                " But, besides the objections that Imam Khattabi,",
                " Hafiz lbn Hajar, Ibn Hazm and Hafiz",
                " `Abdul Haq (author of Al-Jam' bain al-Sahihain)",
                " have raised in respect of the authenticity",
                " and subject-matter of this tradition, the main",
                " objection against it is that it clearly",
                " contradicts the Qur'an, for the Qur'an mentions",
                " two separate occasions when the experience of",
                " the vision took place, the first initially",
                " at the uppermost horizon to which reference",
                " has been made in: Dane fa-tadalla, fa-kana",
                " qaba qausain-i au adna, and a second",
                " time near sidrat al muntaha. But this",
                " tradition mixes up the two occasions and",
                " presents them both as one occasion of",
                " the vision. Therefore, because of its being",
                " contradictory to the Qur'an, it cannot be",
                " acceptable in any case. As for the",
                " other traditions that we have cited above,",
                " the weightiest among them are those that",
                " have been related from Hadrat `Abdullah bin",
                " Mas'ud and Hadrat `A'ishah, for both of",
                " them have unanimously reported this saying of",
                " the Holy Prophet (upon whom be peace)",
                " himself that on neither occasion he had",
                " seen AIIah but Gabriel (peace be on",
                " him), and these traditions fully conform to",
                " the explanations and allusions of the Qur'an.",
                " Furthermore, they are also confirmed by the",
                " sayings of the Holy Prophet which Hadrat",
                " Abu Dharr and Hadrat Abu Musa al-Ash'ari",
                " have reported from him. On the contrary",
                " the traditions that have been cited from",
                " Hadrat 'Abdullah bin `Abbas in the books",
                " of Hadith are self-eontradictory. In some he",
                " regards both the experiences as a vision",
                " with the eyes, in some both as",
                " a vision with the heart, in some",
                " one with the eyes and the other",
                " with the heart, and in some he",
                " wholly negates the vision with the eyes.",
                " In none of these traditions he has",
                " cited any saying of the Holy Prophet",
                " himself and where he has cited such",
                " a saying, it contains no mention of",
                " either of the two experiences stated in",
                " the Qur'an; besides, the explanation of one",
                " of his traditions givcn by the other",
                " indicates that the Holy Prophet at some",
                " time bad seen Allah Almighty not in",
                " the waking condition but in a vision",
                " during sleep. Therefore, in fact, for the",
                " commentary of these verses the traditions ascribed",
                " to Hadrat 'Abdullah bin 'Abbas cannot be",
                " held as reliable. Likewise, although the traditions",
                " of Muhammad bin Ka'b al-Qurzi cite a",
                " saying of the Holy Prophet, they do",
                " not mention the names of the Companions",
                " who might have heard this thing from",
                " the Holy Prophet himself. Moreover, in one",
                " of them it has been said that",
                " the Holy Prophet had clearly denied having",
                " seen Allah with the eyes."
            ]
        },
        {
            "verse-id": "[53:19]",
            "verse": "So have you considered al-Lat and al-'Uzza?",
            "description": [
                "That is, \"You regard the teachings being",
                " givcn to you by Muhammad (upon whom",
                " be Allah's peace and blessings) as erroneous",
                " and falsehood, whereas he is being given",
                " this knowledge by Allah, and Allah has",
                " made him see with his own eyes",
                " the verities to which he is testifying",
                " before you. Now consider it for yourself",
                " as to how irrational are the beliefs",
                " that you are following persistently and'' as",
                " to whom you arc causing loss by",
                " opposing and resisting the person who is",
                " guiding you to the Right Way. In",
                " this connection, especially the three goddesses that",
                " were worshipped generally by the people of",
                " Makkah, Ta'if and other parts of Hejaz",
                " have been taken as an example. About",
                " them, they have been asked: Have you",
                " ever considered rationally whether they could have",
                " even the slightest role in the affairs",
                " of the Godhead of the earth and",
                " heavens? Or could they bear any relationship",
                " whatever with the Lord of the Universe?",
                " The shrine of Lat was in Ta'if",
                " and the Bani Thaqif were so devoted",
                " to it that when Abraha was advancing",
                " to Makkah with his army of elephants",
                " to destroy the Ka'bah, the people only",
                " in order to save the temple of",
                " their deity had provided the wicked man",
                " with guides to lead him w Makkah",
                " so that he should spare Lat, whereas",
                " like all the Arabs the people of",
                " Thaqif also believed that the Ka'bah is",
                " Allah's House. Scholars have disputed the meaning",
                " of Lat. According to Ibn Jarir Tabari,",
                " it is the feminine gender of AIlah,",
                " i.e. originally this word was allahatun which",
                " became al-Lat. According to Zamakhshari, it is",
                " derived from hva yalvi, . which means",
                " to turn to or bow to somebody.",
                " As the polytheists turned to it for",
                " worship and bowed to it and circumambulated",
                " it, it began to be called Lat.",
                " Ibn 'Abbas _reads it as left (with",
                " a stress on t) and holds it",
                " is derived from latt yalittu, which means",
                " to churn and mix together. He and",
                " Mujahid state that this, in fact, was",
                " a man, who lived on a rock",
                " near Ta'if, and used to entertain the",
                " pilgrims to Makkah with barley drinks and",
                " food. When he died the people built",
                " a shrine to him on the same",
                " rock and began to worship him. But",
                " this explanation of Lat, in spite of",
                " having been reported on the authority of",
                " scholars like Ibn 'Abbas and Mujahid, is",
                " not acceptable for two reasons. First, that",
                " in the Qur'an it has been called",
                " Lat and not Latt; second, that the",
                " Qur'an describes all the three as goddesses,",
                " and according to this tradition Lat was",
                " a man, not a woman.",
                "'Uzza is",
                " derived from 'izzat, and it means the",
                " one (female) enjoying veneration and respect. This",
                " was the special goddess of the Quraish",
                " and her shrine was situated at Hurad",
                " in the valley of Nakhlah, between Makkah",
                " and Ta'if. (For the location of Nakhlah,",
                " see E.N. 33 of Surah AL-Ahqaf). The",
                " people of Bani Shaiban, who were the",
                " allies of the Bani Hashim, were its",
                " attendants. The Quraish and the people of",
                " other tribes paid visits to it and",
                " presented offerings and made sacrifices to it.",
                " As for the Ka`bah sacrificial animals were",
                " driven to it also and it was",
                " held in the highest esteem. Ibn Hisham",
                " relates that when Abu Uhaihah was on",
                " the point of death, Abu Lahab paid",
                " him a visit and found him weeping.",
                " Abu Lahab asked, 'Why do you weep,",
                " Abu Uhaihah ? Are you afraid of",
                " death ?-and death is the destiny of",
                " everybody !\" He said, `By God, I",
                " do not weep because of the fear",
                " of death, but I am grieved to",
                " think as to how 'Uzza will be",
                " worshipped after me. \" Abu Lahab said,",
                " \"It was neither worshipped for your sake",
                " in your lifetime, nor will it be",
                " given up after you have left the",
                " world.\" Abu Uhaihah said, 'Now I am",
                " satisfied that there are people who will",
                " take my place after me.\" The shrine",
                " of Manat was situated at Qudaid by.",
                " the Red Sea between Makkah and Madinah,",
                " and the people of Khuza`ah and Aus",
                " and Khazraj were in particular its great",
                " devotees. People visited it as pilgrims, circumambulated",
                " it and made offerings and sacrifices before",
                " it. In the Hajj months as soon",
                " as the pilgrims became free from their",
                " visit to the Ka`bah and the religious",
                " services at Mina and 'Arafat, they would",
                " start raising cries of 'Labbaik, labbaik\"even there",
                " for the purpose of visiting Manat, and",
                " the people who intended to go on",
                " this second \"hajj\" did not run between",
                " the Safa and the Marwah."
            ]
        },
        {
            "verse-id": "[53:20]",
            "verse": "And Manat, the third - the other one?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:21]",
            "verse": "Is the male for you and for Him the female?",
            "description": [
                "That is, \"You held these goddesses as",
                " daughters of Allah, Lord of the worlds,",
                " and did not consider while inventing this",
                " absurd creed that as for yourselves you",
                " regarded the birth of a daughter as",
                " disgraceful, and desired to have only male",
                " children, but as for Allah you assign",
                " w Him only daughters!\""
            ]
        },
        {
            "verse-id": "[53:22]",
            "verse": "That, then, is an unjust division.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:23]",
            "verse": "They are not but [mere] names you have named them - you and your forefathers - for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance.",
            "description": [
                "That is, \"Those whom you call gods",
                " and goddesses are neither gods nor goddesses,",
                " nor do they possess any attribute of",
                " divinity, nor any share whatever in the",
                " powers of Godhead. You have of your",
                " own whim made them children of God",
                " and deities and associates in Godhead. Allah",
                " has sent down no authority which you",
                " may, produce as a proof in support",
                " of your presumptions. \"",
                "*18) In other",
                " words, the basic causes of their deviation",
                " are two: First, that they do not",
                " feel any need for the knowledge of",
                " reality for the purpose of adopting a",
                " creed and religion, but make a supposition",
                " on the basis of a mere conjecture",
                " and then put belief in it as",
                " though it were the reality, Second, that",
                " they have, in fact, adopted this attitude",
                " in order to follow the lusts of",
                " their souls: they desire that they should",
                " have such a deity as should help",
                " them attain their aims and objects in",
                " the world, and if at aII there",
                " is to be a Hereafter, it should",
                " take the responsibility to have them granted",
                " forgiveness there too, But it should not",
                " impose any restriction of the lawful and",
                " the unlawfirl on them nor should bind",
                " them in any discipline of morality. That",
                " is why they do not feel inclined",
                " to worship One God as taught by",
                " the Prophets, and only like to worship",
                " these invented gods and goddesses.",
                "*19) That",
                " is, in every age the Prophets appointed",
                " by Allah have been guiding these wicked",
                " people to the Truth, and now Muhammad",
                " (upon whom be Allah's peace and blessings)",
                " has come to tell them as to",
                " whom belongs Godhead in reality in the",
                " Universe."
            ]
        },
        {
            "verse-id": "[53:24]",
            "verse": "Or is there for man whatever he wishes?",
            "description": [
                "Another meaning of this verse can be:",
                " \"Is man entitled to take anyone he",
                " pleases as his god ?\" Still another",
                " meaning can be: \"Can the desire of",
                " man to have his prayers answered by",
                " these gods ever be fulfilled?\""
            ]
        },
        {
            "verse-id": "[53:25]",
            "verse": "Rather, to Allah belongs the Hereafter and the first [life].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:26]",
            "verse": "And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves.",
            "description": [
                "That is, \"Even if all the angels",
                " together intercede for a person, it cannot",
                " be beneficial for him not to speak",
                " of the intercession by these invented deities",
                " of yours, which can do no one",
                " any good. AlI the powers of Godhead",
                " rest with AIIah. Even the angels cannot",
                " dare intercede for somebody before Him unless",
                " He permits it and is pleased to",
                " hear their intercession in his behalf.\""
            ]
        },
        {
            "verse-id": "[53:27]",
            "verse": "Indeed, those who do not believe in the Hereafter name the angels female names,",
            "description": [
                "That is, \"Their first folly is that",
                " they have taken these powerless angels who",
                " cannot even intercede for anyone before AIIah",
                " as their deities; their second folly is",
                " that they regard them as female and",
                " daughters of Allah. The basic reason for",
                " these errors is that they do not",
                " believe in the Hereafter. For had they",
                " been believers in the Hereafter, they would",
                " never have behaved so irrationally and irresponsibly.",
                " Their denial of the Hereafter has made",
                " them heedless of their end, and they",
                " think that believing or disbelieving in God,",
                " or believing in a thousand gods, dces",
                " not make any difference, for none of",
                " these creeds seems to entail any good",
                " or bad result in the present life",
                " of the world. Whether the people are",
                " deniers of God, or believers in many",
                " gods, or in One God, their crops",
                " ripen as well as fail, they fall",
                " iII as well as recover from illness,",
                " and they pass through all kinds of",
                " circumstances, good as well as bad. Therefore",
                " it is not at aII an important",
                " and serious matter for them that man",
                " should or should not take some one",
                " as a deity, or should take as",
                " many deities or of any kind as",
                " he likes of his choice. When according",
                " to them the decision as to what",
                " is truth and what is falsehood is",
                " to take place in this very world,",
                " depending on the results thereof appearing here,",
                " obviously the results here do not decide",
                " absolutely that one creed is true and",
                " another false. Therefore, the adoption of one",
                " creed and rejection of another is a",
                " matter of men whim with these people.\"",
                ""
            ]
        },
        {
            "verse-id": "[53:28]",
            "verse": "And they have thereof no knowledge. They follow not except assumption, and indeed, assumption avails not against the truth at all.",
            "description": [
                "That is, \"They have not adopted this",
                " creed about the angels on the ground",
                " that they had found through some means",
                " of knowledge that they were females and",
                " daughters of God, but they have presumed",
                " this on mere conjecture and have set",
                " up these shrines at which they pray",
                " for fulfillment of desires, make offerings and",
                " pay tributes.\""
            ]
        },
        {
            "verse-id": "[53:29]",
            "verse": "So turn away from whoever turns his back on Our message and desires not except the worldly life.",
            "description": [
                "Dhikr here may imply the Qur'an as",
                " well as mere admonition; it may also",
                " mean that he does not like that",
                " even God be mentioned before him.",
                "*25)",
                " That is, \"You should not waste your",
                " time in making him understand the truth,",
                " for such a person will never be",
                " inclined to accept any invitation which is",
                " based on God-worship, which calls to objects",
                " and values higher than the material benefits",
                " of the world, and according to which",
                " the real aim of life may be",
                " the eternal success and well-being of the",
                " Hereafter. Instead of expending your time and",
                " energy on such a materialistic and ungodly",
                " person, you should devote attention to the",
                " people who arc inclined to heed the",
                " remembrance of Allah and arc not involved",
                " in the worship of the world. \"",
                ""
            ]
        },
        {
            "verse-id": "[53:30]",
            "verse": "That is their sum of knowledge. Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of who is guided.",
            "description": [
                "This is a parenthetical sentence which has",
                " been inserted here as an explanation of",
                " the preceding verse.",
                "*27) That is, \"These",
                " people neither know nor can think anything",
                " beyond the world and its immediate gains;",
                " therefore, it is futile merely to expend",
                " time and energy on them. \""
            ]
        },
        {
            "verse-id": "[53:31]",
            "verse": "And to Allah belongs whatever is in the heavens and whatever is in the earth - that He may recompense those who do evil with [the penalty of] what they have done and recompense those who do good with the best [reward] -",
            "description": [
                "In other words, neither the question whether",
                " a person is gone astray or is",
                " on right guidance, is to be decided",
                " in this world, nor has its decision",
                " been left to the judgement of the",
                " people of the world; the decision rests",
                " with Allah. He alone is the Master",
                " of the earth and heavens and He",
                " alone knows which way out of the",
                " different ways being followed by the people",
                " of the world, is the way of",
                " guidance and which of error and deviation.",
                " Therefore, you should least bother if the",
                " polytheistic Arabs and the Makkan disbelievers think",
                " you are deluded and misguided and regard",
                " their own ignorance as truth and guidance.",
                " Leave them alone if they wish to",
                " remain lost in their falsehood. You need",
                " not waste your time in disputing with",
                " them.",
                "*29) The theme is resumed here",
                " and connected as a continuous whole with",
                " verse 29. Without the parenthesis, it would",
                " read: 'Leave him alone so that AIlah",
                " may requite the evildoers for their evil",
                " deeds.\""
            ]
        },
        {
            "verse-id": "[53:32]",
            "verse": "Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him.",
            "description": [
                "For explanation, see E.N. 53 of An-Nisa.",
                "",
                "*31) For explanation, sec E.N. 130 of",
                " AI-An'am and E.N. 89 of An-Nahl.",
                "*32)",
                " The word lamam as found in the",
                " original is used for a small quantity",
                " of something, or its slight effect, or",
                " its mere closeness, or its existence for",
                " a short time. This word is used",
                " to express the sense that a person",
                " did not commit an act but was",
                " very near to committing it.",
                "On the",
                " basis of its usages some commentators have",
                " taken the word lamam in the meaning",
                " of minor sins. Some others have taken",
                " it in the meaning that a person",
                " should practically reach very near a grave",
                " sin but -should desist from actually committing",
                " it. Still others take it in the",
                " sense of a person's remaining involved in",
                " a sin temporarily and then desisting from",
                " it. And according to some it implies",
                " that a person should think of, or",
                " wish, or intend to commit a sin",
                " but should rake no practical steps towards",
                " it. In this regard, the views of",
                " the Companions and their immediate followers are",
                " as follows:",
                "Zaid bin Aslam and Ibn",
                " Zaid opine, and a saying of Hadrat",
                " 'Abdullah bin 'Abbas also is to the",
                " same effect, that it signifies those sins",
                " which the people had committed in the",
                " pre-Islamic days of ignorance, then alter embracing",
                " Islam they refrained from them.'",
                "Another view",
                " of Ibn `Abbas is, and the same",
                " is also the view of Hadrat Abu",
                " Hurairah, Hadrat 'Abdullah bin 'Amr bin 'As,",
                " Mujahid, Hasan Basri and Abu Salih, that",
                " it implies a person's being involved in",
                " a grave sin or indecency temporarily, or",
                " occasionally, and then giving it up.",
                "Hadrat",
                " 'Abdullah bin Mas'ud, Masruq and Sha'bi say,",
                " and the same also has been reported",
                " from Hadrat Abu Hurairah and Hadrat 'Abdullah",
                " bin `Abbas in authentic traditions, that this",
                " implies a person's approaching the very point",
                " of a grave sin and crossing alI",
                " its preliminaries but then restraining himself at",
                " the final stage, e.g. a person goes",
                " out with the intention of stealing but",
                " refrains from it in the end, or",
                " has colse association with other women, but",
                " refrains from committing adultery. Hadrat 'Abdullah bin",
                " Zubair, `Ikrimah, Qatadah and Dahhak say that",
                " this signifies those minor sins for which",
                " no punishment has been prescribed in the",
                " world nor any threat of punishment held",
                " out in the Hereafter. Said bin al-Musayyab",
                " says that this implies one's thinking of",
                " a sin in the mind but restraining",
                " oneself from committing it practically .",
                "These",
                " arc the different explanations which have been",
                " reported in the traditions from the Companions",
                " and their immediate followers. The majority of",
                " the later commentators and doctors of law",
                " and jurists arc of the opinion that",
                " this verse and verse 31 of Surah",
                " An-Nisa classify sins into two main kinds:",
                " the major sins and the minor sins,",
                " and these two verses give man the",
                " hope that if he abstains from the",
                " major sins and open indecencies, AIlah will",
                " overlook his minor errors. Although some distinguished",
                " scholars have also opined that no sin",
                " is minor and the disobedience of Allah",
                " is by itself a major sin, yet",
                " as stated by Imam Ghazali the distinction",
                " between the major and the minor sins",
                " is something which cannot be denied, for",
                " the sources of knowledge of the Shari'ah",
                " values and injunctions aII point to this.",
                "",
                "As for the question, what is the",
                " distinction between the major and the minor",
                " sins, and what kinds of sins are",
                " major and what kinds of them minor",
                " ? we are satisfied that: \"Every such",
                " act is a major sin which has",
                " been forbidden by a clear ordinance of",
                " the Divine Book and the Shari'ah of",
                " the Prophet, or for which AIIah and",
                " His Messenger have prescribed a punishment in",
                " the world, or have held out a",
                " threat of punishment in the Hereafter, or",
                " have cursed the one guilty of committing",
                " it, or given the news of infliction",
                " of punishment on those guilty of committing",
                " it. \" Apart from this class of",
                " sins all other acts which are disapproved",
                " by the Shari'ah, come under the definition",
                " of minor sins. Likewise, the mere desire",
                " for a major sin, or an intention",
                " to commit it, also is not a",
                " major sin but a minor sin; so",
                " much so that even crossing all the",
                " preliminaries of a major sin does not",
                " constitute a major sin unless one has",
                " actually committed it. However, even a minor",
                " sin becomes a major sin in case",
                " it is committed with a feeling of",
                " contempt for religion and of arrogance against",
                " Allah, and the one guilty of it",
                " does not consider the Shari`ah that has",
                " declared it an evil worthy of any",
                " attention and reverence.",
                "*33) That is, \"The",
                " forgiveness for the one guilty of minor",
                " sins is not for the reason that",
                " a minor sin is no sin, but",
                " for the reason that AIIah Almighty does",
                " not treat His servants narrow-mindedly and does",
                " not seize them on trifling faults; if",
                " the servants adopt piety and abstain from",
                " major sins and indecencies, He will not",
                " seize them for their minor errors and",
                " will forgive them magnanimously on account of",
                " His infinite mercy.\""
            ]
        },
        {
            "verse-id": "[53:33]",
            "verse": "Have you seen the one who turned away",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:34]",
            "verse": "And gave a little and [then] refrained?",
            "description": [
                "The reference is to Walid bin Mughirah",
                " who was one of the prominent chiefs",
                " of the Quraish. According to Ibn Jarir",
                " Tabari, this person had first become inclined",
                " to accept the invitation of the Holy",
                " Prophet (upon whom be peace), but when",
                " a polytheist friend of his came to",
                " know of his intention to become a",
                " Muslim, he counselled him not to give",
                " up his ancestral faith, and asked him",
                " that if he was afraid of the",
                " punishment of the Hereafter, he should pay",
                " him a certain amount of money and",
                " he would take the responsibility to suffer",
                " the punishment on his behalf. Walid accepted",
                " the offer and turned away from Allah's",
                " way. Then he paid only a little",
                " of the amount that he had promised",
                " to pay his polytheist friend and withheld",
                " the rest, The allusion to this incident",
                " was meant to toll the disbelievers of",
                " Makkah what kind of errors and follies",
                " they were involved in because of their",
                " heedlessness of the Hereafter and their ignorance",
                " of the Divine Religion. \""
            ]
        },
        {
            "verse-id": "[53:35]",
            "verse": "Does he have knowledge of the unseen, so he sees?",
            "description": [
                "That is, 'Does he know that this",
                " conduct is in any way beneficial for",
                " him? Does he know that a person",
                " can save himself even in this way",
                " from the punishment of the Hereafter?\""
            ]
        },
        {
            "verse-id": "[53:36]",
            "verse": "Or has he not been informed of what was in the scriptures of Moses",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:37]",
            "verse": "And [of] Abraham, who fulfilled [his obligations] -",
            "description": [
                "In the following verses a resume is",
                " being given of the teachings sent down",
                " in the Books of the Prophets Abraham",
                " and Moses. The Books of Moses signify",
                " the Torah. As for the Books of",
                " the Prophet Abraham they have become extinct",
                " and no mention of them is found",
                " even in the holy scriptures of the",
                " Jews and Christians. Only in the Qur'an",
                " at two places have some parts of",
                " the teachings contained in the Books of",
                " the Prophet Abraham been cited, here and",
                " in the concluding verses of Surah AI-A`la.",
                ""
            ]
        },
        {
            "verse-id": "[53:38]",
            "verse": "That no bearer of burdens will bear the burden of another",
            "description": [
                "From this verse three cardinal principles are",
                " derived: (1) That every person is himself",
                " responsible for what he does; (2) that",
                " the responsibility of one man's act cannot",
                " be transferred to another unless he has",
                " a share in the commission of the",
                " act; and (3) that even if a",
                " person wishes he cannot take on himself",
                " the responsibility of another man's act, nor",
                " can the actual culprit be Iet off",
                " on the ground that another person is",
                " willing to suffer the punishment on his",
                " behalf."
            ]
        },
        {
            "verse-id": "[53:39]",
            "verse": "And that there is not for man except that [good] for which he strives",
            "description": [
                "From this verse also three important principles",
                " are derived: (1) That every person will",
                " get only the fruit of his own",
                " deeds; ,(2) that the fruit of one",
                " man's deeds cannot be given to another",
                " unless he has a share in that",
                " deed, and (3) that none can attain",
                " anything without striving for it.",
                "Some people",
                " wrongly apply these three principles to the",
                " economic problems of the world and conclude",
                " that no person can become the lawful",
                " owner of anything except of his own",
                " earned income. But this conclusion clashes with",
                " several laws and injunctions given by the",
                " Qur'an itself, e.g. the law of inheritance,",
                " according to which many individuals inherit a",
                " person and are regarded as his lawful",
                " heirs, whereas the heritage is not their",
                " earned income. As for a suckling for",
                " instance, it cannot be proved by any",
                " stretch of imagination that its labour had",
                " any share in the wealth left by",
                " its father. Likewise, there arc the injunctions",
                " about the zakat and voluntary charities according",
                " to which the wealth of one man",
                " is transferred to others only on the",
                " basis of their legal and moral entitlement",
                " and they become its lawful owners, whereas",
                " in the production of this wealth they",
                " did not make any contribution at aII.",
                " Thus, it is against the intention of",
                " the Qur'an to take a verse of",
                " it and derive from it such conclusions",
                " as clash with the other teachings of",
                " the Qur'an itself.",
                "Some other people regard",
                " these principles as concerning the Hereafter and",
                " raise the question whether, according to these",
                " principles, the deeds of one man can",
                " in some way be also beneficial for",
                " the other person, and whether the deeds",
                " of a person which he dces for",
                " another person, or on his behalf, can",
                " be accepted from him, and whether it",
                " is also possible that a person may",
                " transfer the reward of his act to",
                " another. If the answer to these questions",
                " be in the negative the sending of",
                " spiritual rewards (isal thawab) for the dead",
                " and performing Hajj on behalf of another,",
                " would be inadmissible; even the prayer of",
                " forgiveness for the other person would be",
                " meaningless, for this prayer also is not",
                " the concerned person's own act and decd.",
                " However, this extreme point of view has",
                " been adopted by none among the followers",
                " of Islam except the Mu`tazilites. Only they",
                " take this verse in the meaning that",
                " one man's acts and deeds can in",
                " no case be beneficial for the other.",
                " On the contrary, the followers of the",
                " Sunnah are unanimous that the prayer of",
                " one man is beneficial for the other",
                " because it is confirmed by the Qur'an;",
                " however, they differ only in details, and",
                " not in principles, as to whether the",
                " sending of spiritual rewards for another and",
                " doing a good work on behalf of",
                " another is beneficial or not.",
                "(1) The",
                " tern isal thawab means that after a",
                " person has performed a good act, he",
                " may pray to Allah to grant its",
                " rewards to another. In this regard, Imam",
                " Malik and Imam Shafe'i have expressed the",
                " opinion that the rewards of the pure",
                " bodily acts of worship, e.g, the Prayer,",
                " the Fasting and recitals of the Qur'an,",
                " etc. cannot reach the other person; however,",
                " the rewards of one's monetary acts of",
                " worship, e.g. charities, or Hajj, which is",
                " a combination of the monetary and bodily",
                " worships, can reach the other, for the",
                " principle is that one man's act should",
                " not be beneficial for the other. But",
                " since according to authentic Ahadith the rewards",
                " of charities can be conveyed and Hajj",
                " on behalf of another also can be",
                " performed, they admit the permissibility of conveying",
                " of rewards to the extent of this",
                " kind of the acts of worship only.",
                " On the contrary, the Hanafi viewpoint is",
                " that a man can send the reward",
                " of each of his virtuous acts as",
                " a gift to the other, whether it",
                " is the Prayer, or the Fast, or",
                " the recitation of the Qur'an, or remembrance",
                " of Allah, or charity, or Hajj and",
                " `Umrah. The argument is that just as",
                " a man after carrying out a piece",
                " of work can tell the master to",
                " pay the wages to such and such",
                " other person instead of him, so after",
                " performing a good deed also he can",
                " pray to Allah to grant its rewards",
                " to such and such other person instead",
                " of him. In this there is no",
                " rational ground for making exception of some",
                " kinds of virtues and keeping it restricted",
                " to some other kinds of virtues. The",
                " same is confirmed by a large number",
                " of the traditions:",
                "A Tradition, on the",
                " unanimous authority of Hadrat 'A'ishah, Hadrat Abu",
                " Hurairah, Hadrat Jabir bin 'Abdullah. Hadrat Abu",
                " Rafi', Hadrat Abu Talhah Ansari and Hudhaifah",
                " bin Usaid al-Ghifari has been reported in",
                " Bukhari, Muslim. Musnad Ahmad, Ibn Majah, Tabari",
                " (in Awsat, Musradrik and Ibn Abi Shaibah",
                " saying that the Holy Prophet (upon whom",
                " be peace) got two rams and sacrificed",
                " one on behalf of himself and his",
                " family and the other on behalf of",
                " his, Ummah. Muslim, Bukhari, Musnad Ahmad, Abu",
                " Da'ud and Nasa'i have related a Tradition",
                " from Hadrat 'A'ishah to the effect that",
                " a person said to the Holy Prophet:",
                " \"My mother has died suddenly. I think",
                " if she had a chance to speak,",
                " she would have asked me giving away",
                " something in charity. Now, if I give",
                " away something in charity on her behalf,",
                " will she get a reward for it",
                " ?\" The Holy Prophet replied: \"Yes, she",
                " will. \" In Musnad Ahmad there is",
                " a Tradition from Hadrat 'Abdullah bin 'Amr",
                " bin 'As to the effect. that his",
                " grandfather, `As bin Wail, had vowed in",
                " the preIslamic days of ignorance to sacrifice",
                " 100 camels. His uncle, Hisham bin 'As,",
                " sacrificed fifty camels of his own share.",
                " Hadrat 'Amr bin 'As, asked the Holy",
                " Prophet as to what he should do.",
                " The Holy Prophet replied: \"If your father",
                " had affirmed faith in the Oneness of",
                " God, you may observe fasts on his",
                " behalf. or give something in charity: this",
                " would be beneficial for him.\"",
                "A Tradition",
                " has been reported in Musnad Ahmad, Abu",
                " Da'ud, Nasa'i and Ibn Majah, on the",
                " authority of Hadrat Hasan Basri, to the",
                " effect that Hadrat Sa'd bin 'Ubadah asked",
                " the Holy Prophet: \"My mother has died.",
                " Should I give something in charity on",
                " her behalf?\" The Holy Prophet replied in",
                " the affirmative. Several other traditions bearing on",
                " the same subject also have been related",
                " in Bukhari, Muslim, Musnad Ahmad, Nasa'i, Tirmidhi,",
                " Abu Da'ud, Ibn Majah, etc. on the",
                " authority of Hadrat 'A'ishah, Hadrat Abu Hurairah",
                " and Hadrat Ibn 'Abbas, According to which",
                " the Holy Prophet permitted giving away of",
                " something in charity on behalf of the",
                " deceased person describing it as beneficial for",
                " him.",
                "According to Daraqutni a person said",
                " to the Holy Prophet: ''I have been",
                " serving my parents while they were alive;",
                " what should I do now when they",
                " are dead?\" The Holy Prophet replied; \"This",
                " would also be their service if you",
                " offered the Prayer on their behalf along",
                " with your own Prayers, and observed the",
                " Fast on their behalf along with your",
                " own Fast.\" Another tradition in Daraqutni has",
                " been related from Hadrat `Ali according to",
                " which the Holy Prophet said: \"If a",
                " person passing by the graveyard recites \"Qul",
                " huwallah-u ahad\" eleven times and gives away",
                " its reward for the dead, all the",
                " dead ones will be granted their due",
                " shares of the rewards. \"",
                "This large",
                " number of the traditions which support one",
                " another explicitly state that the transfer of",
                " the spiritual rewards is not only possible",
                " but rewards of aII kinds of acts",
                " of worship and virtuous deeds can be",
                " sent and conveyed and in it there",
                " is no specification of any particular kind",
                " of acts and deeds. In this connection,",
                " however, four things should be understood well:",
                "",
                "First, that the reward of that act",
                " only can be transferred, which may have",
                " been performed purely for the sake of",
                " Allah and according to the Shari'ah injunctions;",
                " otherwise obviously an act which is performed",
                " for the sake of another than Ailah,",
                " or in contravention of the Shari 'ah",
                " injunctions, cannot even entitle its doer himself",
                " to any reward, nothing to say of",
                " its transfer to another person.",
                "Secondly, the",
                " gift of the rewards will certainly reach",
                " those righteous persons who are staying as",
                " guests with AIIah, but no rewards are",
                " expected to reach those culprits who are",
                " placed in confinement there. The gift can",
                " reach the guests of AIlah but the",
                " criminals of Allah cannot be expected to",
                " receive it. If a person sends his",
                " rewards to him because of a misunderstanding,",
                " it will not go waste but instead",
                " of reaching the culprit it will return",
                " to the actual worker himself just like",
                " the money-order which returns to the sender",
                " in case it does not reach the",
                " one to whom it has been sent.",
                " Thirdly, the transfer of the reward is",
                " possible but not the transfer of punishment.",
                " That is, it is possible that one",
                " may do a good deed and may",
                " willingly transfer its reward to the other",
                " and it reaches him, but it is",
                " not possible that one may commit a",
                " sin and transfer its punishment to the",
                " other and it reaches him, The fourth",
                " thing is that a virtuous act s",
                " beneficial in two ways: First, on account",
                " of its those results which accrue to",
                " the soul and morality of the doer",
                " himself because of which he becomes worthy",
                " of a reward in the sight of",
                " Allah; second, on account of the reward",
                " which Allah grants him as a gift",
                " and favour. The transfer of the spiritual",
                " reward does not concern the first but",
                " only the second. This can be understood",
                " by an example. A person tries to",
                " attain proficiency in the art of wrestling",
                " by constant practice. The strength and skill",
                " thus gained is in any way specially",
                " meant for his own self; it cannot",
                " be transferred to another. Similarly, if he",
                " is attached to a royal court, and",
                " there is a stipend fixed for him",
                " as a wrestler, he alone will receive",
                " it and no one else. However, in",
                " respect of the prizes and gifts that",
                " his patron may like to grant him",
                " as an appreciation for his creditable performance,",
                " he may request that they may be",
                " given to his coach, or parents, or",
                " some other benefactor, on his behalf. The",
                " same is the case with the virtuous",
                " deeds: their spiritual benefits are not transferable",
                " and their rewards also cannot be transferred",
                " to another, but as for their rewards",
                " and gifts he can pray to AIIah",
                " that these may be granted to a",
                " near and dear one, or a benefactor",
                " of his. That is why it is",
                " termed as isal thawab (conveying of spiritual",
                " rewards) and not as isal jaza' (conveying",
                " of material reward).",
                "(2) Another form of",
                " a person's work being beneficial for another",
                " is that one should either do a",
                " virtuous deed on the desire or beckoning",
                " of another, or without his desire or",
                " beckoning, on his behalf, which, in fact,",
                " was obligatory for him to carry out,",
                " but which he was unable to carry",
                " out himself. In this regard, the Hanafi",
                " jurists say that the acts of worship",
                " are of three kinds: purely physical, e.g.",
                " the Prayer; purely monetary, e.g. the zakat;",
                " and the compound acts of bodily and",
                " monetary worship, e.g. Hajj. As for the",
                " first kind, nobody can act as an",
                " agent of another. As for the second",
                " kind, one can act as an agent",
                " of the other, e.g. the husband can",
                " pay the zakat due on the ornaments",
                " of the wife. As for the third",
                " kind, one can act as an agent",
                " of the other only in case the",
                " actual person on whose behalf the act",
                " is being performed, is permanently, and not",
                " just temporarily, unfit to carry out his",
                " obligation himself. For example, Hajj can be",
                " performed on behalf of another only in",
                " case the person concerned . is unable",
                " to go for Hajj himself nor-may have",
                " the hope that he would ever be",
                " able to perform it himself. The Malikis",
                " and the Shafe is also concur on,",
                " this, However, Imam Malik lays down the",
                " condition that if the father has willed",
                " that his son should perform Hajj after",
                " him, on his behalf, the son can",
                " perform Hajj on his father's behalf, otherwise",
                " not, But the traditions in this regard",
                " are very explicit. Whether the father has",
                " expressed the desire, or made a will",
                " or not, the son can perform Hajj",
                " on his behalf.",
                "Ibn 'Abbas has related",
                " that a woman _from the tribe of",
                " Khath'am said to the Holy Prophet: \"The",
                " command for Hajj has reached my father",
                " at a time when he has become",
                " very old: he cannot even sit on",
                " the camel's back. \" The Holy Prophet",
                " replied: \"You then may perform Hajj on",
                " his behalf. \" (Bukhari, Muslim, Ahmad, Tirmidi,",
                " Nasa'i). A tradition bearing on the same",
                " subject has also been related by Hadrat",
                " 'AIi. (Ahmad, Tirmidhi).",
                "Hadrat 'Abdullah bin Zabair",
                " has made mention of a tnan of",
                " the same tribe of Khath'am, who also",
                " put a similar question to the Holy",
                " Prophet concerning his aged father. The Holy",
                " Prophet asked: 'Are you his eldest son",
                " ?\" He answered in the affirmative. Thereupon",
                " the Holy Prophet said \"If your father",
                " had left behind a debt and you",
                " paid it off, would it stand paid",
                " on his behalf?\" He replied that it",
                " would. The Holy Prophet said: \"Then you",
                " should likewise perform Hajj also on his",
                " behalf.\" (Ahmad, Nasa'i). Ibn 'Abbas relates that",
                " a woman from the tribe of Juhainah",
                " came to the Holy Prophet and said:",
                " \"My mother had vowed to perform Hajj",
                " but she died before performing her vow.",
                " Now, can I perform Hajj on her",
                " behalf ?\" The Holy Prophet replied: \"If",
                " your mother had left behind a debt,",
                " would you not have paid it? Likewise,",
                " you should also discharge the vow made",
                " to Allah, and Allah has a greater",
                " right that the vows made to Him",
                " be performed.\" (Bukhari, Nasa'i). Bukhari and Musnad",
                " Ahmad contain another tradition to the effect",
                " that a man came and put the",
                " same question to the Holy Prophet concerning",
                " his sister as has been mentioned above,",
                " and the Holy Prophet gave him also",
                " the same answer.",
                "These traditions provide a",
                " clear proof that so far as the",
                " compound acts of bodily and monetary worships",
                " are concerned, one can act on behalf",
                " of another. As for the purely bodily",
                " acts of worship, there are some Ahadith",
                " which prove the permissibility of acting on",
                " behalf of another in this kind of",
                " worship as well. For example, Ibn 'Abbas",
                " has related that a woman from the",
                " tribe of Juhainah asked the Holy Prophet:",
                " 'My mother had vowed to observe the",
                " Fast and she died without performing her",
                " vow. Now, can I observe the Fast",
                " on her behalf?\" The Holy Prophet replied:",
                " \"Observe the Fast on her behalf.\" (Bukhari,",
                " Muslim, Ahmad, Abu Da'ud). And Hadrat Buraidah's",
                " tradition that a woman asked concerning her",
                " mother: \"She had one month's (according to",
                " another tradition two months') Fasts to observe;",
                " can I observe those Fasts on her",
                " behalf?\" The Holy Prophet said that she",
                " could.\" (Muslim, Ahmad, Tirmidhi, Abu Da'ud). And",
                " Hadrat 'A'ishah's tradition that the Holy Prophet",
                " said: 'If a person dies and he",
                " had some Fasts to observe, his guardian",
                " should observe those Fasts on his behalf.\"",
                " (Bukhari, Muslim, Ahmad). In the tradition related",
                " by Bazzar the Holy Prophet's words are",
                " to the effect: \"If his guardian may",
                " so like, he may observe those Fasts",
                " on his behalf). \" On the basis",
                " of these very traditions the Ashab al-",
                " Hadith and Imam Auza'i and the Zahiris",
                " have formed the view that one is",
                " permitted to perform bodily acts of worship",
                " also on behalf of the other. But",
                " Imam Abu Hanifah, Imam Malik, Shafe'i and",
                " Imam Zaid bin 'Ali have given the",
                " ruling that a fast cannot be observed",
                " on behalf of a dead person, and",
                " Imam Ahmad, Imam Laith and Ishaq bin",
                " Rahawaih opine that this can be done",
                " only in case the deceased person might",
                " have so vowed but might not have",
                " been able to perform his vow. Those",
                " who oppose this give the argument that",
                " the reporters of the Ahadith, which prove",
                " its permissibility, have themselves given their rulings",
                " against it. Ibn 'Abbas's ruling has been",
                " related by Nasa'i, thus: \"No one should",
                " offer a Prayer or observe a Fast",
                " on behalf of another.\" And Hadrat 'A'ishah's",
                " ruling, according to 'Abdur Razzaq, is: \"Do",
                " not observe the Fast on behalf of",
                " your dead ones; feed (the needy) instead.\"",
                " The same has been related from Hadrat",
                " 'Abdullah bin 'Umar also by 'Abdur Razzaq",
                " that the Fast should not be observed",
                " on behalf of the deceased person. This",
                " shows that in the beginning it was",
                " permissible to perform acts of bodily worship",
                " on behalf of others, but the practice",
                " that became established in the end was",
                " that it was not permissible to do",
                " so; otherwise it was not possible that",
                " those who have reported these Ahadith from",
                " the Holy Prophet, should have themselves given",
                " rulings against them.",
                "In this connection, it",
                " should be understood well that fulfilment of",
                " an obligation on behalf of another can",
                " be beneficial only to those people who",
                " have themselves been keen and desirous of",
                " fulfilling their obligations and might have been",
                " unable to do so being rendered helpless",
                " by circumstances. But a person who deliberately",
                " shirked going for Hajj although he had",
                " the necessary means for it and had",
                " no feeling whatever of this obligation in",
                " his heart either, cannot be benefited even",
                " if several Hajj be performed on his",
                " behalf afterwards. This would be analogous to",
                " the case of a person who deliberately",
                " avoided paying his debts and had no",
                " intention to pay them till the last.",
                " Afterwards even if every penny is paid",
                " off on his behalf, he would remain",
                " a debtor in the sight of AIIah.",
                " The payment of the debts by another",
                " can relieve only such a person who",
                " in his lifetime was desirous of paying",
                " off his debts but was unable to",
                " do so due to straitened circumstances."
            ]
        },
        {
            "verse-id": "[53:40]",
            "verse": "And that his effort is going to be seen -",
            "description": [
                "That is, ' In the Hereafter the",
                " people's deeds shall be examined and judged",
                " in order to see what provisions they",
                " have brought with them. \" As this",
                " sentence occurs immediately after the preceding sentence,",
                " it by itself indicates that the preceding",
                " sentence relates to the rewards and punishments",
                " of the Hereafter, and the view of",
                " those who present it as an economic",
                " principle relating to this world is not",
                " correct. To interpret a verse of the",
                " Qur'an in a way as is irrelevant",
                " to the context as well as clashes",
                " with the other ordinances of the Qur'an",
                " cannot be right."
            ]
        },
        {
            "verse-id": "[53:41]",
            "verse": "Then he will be recompensed for it with the fullest recompense",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:42]",
            "verse": "And that to your Lord is the finality",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:43]",
            "verse": "And that it is He who makes [one] laugh and weep",
            "description": [
                "That is, 'AIIah provides the means both",
                " for joy and for grief. He controls",
                " good and iII Iuck. There is no",
                " one else in the Universe, who may",
                " have anything to do with making or",
                " marring of destinies. \""
            ]
        },
        {
            "verse-id": "[53:44]",
            "verse": "And that it is He who causes death and gives life",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:45]",
            "verse": "And that He creates the two mates - the male and female -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:46]",
            "verse": "From a sperm-drop when it is emitted",
            "description": [
                "For. explanation, see E.N.'s 27 to 30",
                " of Surah Ar-Rum, E.N. 77 of Surah",
                " Ash-Shura."
            ]
        },
        {
            "verse-id": "[53:47]",
            "verse": "And that [incumbent] upon Him is the next creation",
            "description": [
                "When this verse is read with the",
                " two preceding verses, the sequence by itself",
                " seems to provide the argument for the",
                " life-after-death also. The God Who has the",
                " power to give death and grant lift",
                " and the God Who brings about a",
                " creature like man from an insignificant sperm-drop,",
                " rather brings about two separate sexes -",
                " malt and female - from the same",
                " substance and by the same method of",
                " creation, cannot be helpless to resurrect man",
                " once again."
            ]
        },
        {
            "verse-id": "[53:48]",
            "verse": "And that it is He who enriches and suffices",
            "description": [
                "Different meanings have been given by the",
                " lexicographers and commentators of the word aqna",
                " as used in the original. According to",
                " Qatadah, Ibn 'Abbas took it in the",
                " meaning of arda (pleased), and according to",
                " `Ikrimah in the meaning of qanna'a (satisfied).",
                " According to Imam Razi, whatever is given",
                " to a person over and above his",
                " need and requirement is iqna `. Abu",
                " `Ubaidah and several other lexicographers have expressed",
                " the view that aqua is derived from",
                " qunya-tun, which means lasting and secured property,",
                " e.g, the house, lands, gardens, cattle, etc.",
                " Ibn Zaid, however, has given quite a",
                " different meaning of it. He says that",
                " aqua here has been used in the",
                " sense of afqara (made penniless), and the",
                " verse means: He made whomever He pleased",
                " rich and whomever He pleased penniless."
            ]
        },
        {
            "verse-id": "[53:49]",
            "verse": "And that it is He who is the Lord of Sirius",
            "description": [
                "Shi ra is the brightest star in",
                " the heavens, which is also known by",
                " the names of Mirzam al- Jawza `,",
                " al-Kalb al-Akbar, al-Kalb al-Jabbar, Ash-Shi 'ra al-'Abur,",
                " etc. In English it is called Sirius,",
                " Dog Star and Canis Majoris. It is",
                " 23 tunes as luminous as the Sun,",
                " but as it shines over eight light-years",
                " away from the earth, it appears to",
                " be smaller and less luminous than the",
                " Sun. The Egyptians worshipped it, for it",
                " made its appearance at about the time",
                " of the season when the annual floods",
                " were beginning in the Nile; the Egyptians",
                " believed that Sirius caused the Nile floods.",
                " The pagan Arabs also held the belief",
                " that this star influenced human destinies. That",
                " is why they worshipped it as a",
                " deity, and the Bani Khuza`ah, the neighbouring",
                " tribe of the Quraish, were particularly well-known",
                " for being its devotees. What Allah says",
                " means: 'Your destinies are not made and",
                " controlled by Shi is but by the",
                " Lord of Shi'ra."
            ]
        },
        {
            "verse-id": "[53:50]",
            "verse": "And that He destroyed the first [people of] 'Aad",
            "description": [
                "'Ad Ula signifies the ancient 'Ad to",
                " whom the Prophet Hud (peace be upon",
                " him) had been appointed a Prophet. When",
                " those people were inflicted with the torment",
                " in consequence of denying the Prophet Hud,",
                " the believers only escaped the punishment. Their",
                " descendants are called `Ad Ukhra, or the",
                " latter 'Ad, in history."
            ]
        },
        {
            "verse-id": "[53:51]",
            "verse": "And Thamud - and He did not spare [them] -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:52]",
            "verse": "And the people of Noah before. Indeed, it was they who were [even] more unjust and oppressing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:53]",
            "verse": "And the overturned towns He hurled down",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[53:54]",
            "verse": "And covered them by that which He covered.",
            "description": [
                "'The subdued settlements\": the settlements of the",
                " people of Lot, and \"covered them that",
                " which covered them\" probably imply the waters",
                " of the Dead Sea, which spread over",
                " their settlements after they had sunk underground,",
                " and cover the region even till this",
                " day."
            ]
        },
        {
            "verse-id": "[53:55]",
            "verse": "Then which of the favors of your Lord do you doubt?",
            "description": [
                "According to some commentators this sentence also",
                " is a part of the resume of",
                " the Books of the Prophets Abraham and",
                " Moses, and according to others it ended",
                " with Fa ghashsha-ha ma ghashsha, and with",
                " this begins a new theme. According to",
                " the context, however, the first view seems",
                " to be preferable, for the following words",
                " \"This is a warning of the warnings",
                " already given,\" point out that the whole",
                " preceding passage is \"of the warnings already",
                " given\", which had been sent down in",
                " the Books of the Prophets Abraham and",
                " Moses.",
                "*48) The word tatamara, as used",
                " in the Text, means both to doubt",
                " and to wrangle. The address is directed",
                " to every listener. To every person who",
                " may be listening to this discourse, it",
                " is being said: Even after witnessing what",
                " has been the fate in human history",
                " of denying the bounties of Allah and",
                " of wrangling with the Prophets concerning them,",
                " will you still commit the same folly?",
                " What the former peoples had doubted was",
                " whether the bounties and blessings they were",
                " enjoying in the world, had been bestowed",
                " by One God, or by other associates",
                " of His, or by no one, but",
                " had become available by themselves. On account",
                " of this they wrangled with the Prophets.",
                " The Prophets asserted that all these blessings",
                " had been granted to them by God,",
                " and by One God alone; therefore, they",
                " should be grateful to Him and should",
                " serve Him alone; but the people did",
                " not believe this and wrangled with the",
                " Prophets on this very count. Now, O",
                " man: \"Don't you see in history what",
                " fate these nations met for entertaining this",
                " doubt and for their wrangling ? Will",
                " you entertain the same doubt and indulge",
                " in the same wrangling as proved disastrous",
                " for others?\"",
                "In this connection, one should",
                " also bear in mind that the 'Ad",
                " and the Thamud and the people of",
                " Noah had passed long before the Prophet",
                " Abraham, and the people of Lot had",
                " met with the torment during his own",
                " lifetime. Therefore, there can be no difficulty",
                " in regarding this passage as a part",
                " of the resume of the Prophet Abraham's",
                " Books."
            ]
        },
        {
            "verse-id": "[53:56]",
            "verse": "This [Prophet] is a warner like the former warners.",
            "description": [
                "The words in the original are: Hadha",
                " nadhir-un-min-an-nudhur-il-ula. The commentators have expressed three points",
                " of view in the explanation of this",
                " sentence. First, that nadhir here implies the",
                " Prophet Muhammad (upon whom be Allah's peace);",
                " second, that it implies the Qur'an; third,",
                " that it implies the fate of the",
                " peoples already destroyed, which has been referred",
                " to in the foregoing verses. In view",
                " of the context, we arc of the",
                " opinion that this last commentary is preferable.",
                ""
            ]
        },
        {
            "verse-id": "[53:57]",
            "verse": "The Approaching Day has approached.",
            "description": [
                "That is, \"Do not be under the",
                " delusion that there is yet enough time",
                " for thinking and consideration; therefore, you may",
                " not give immediate and serious attention to",
                " these things and may not decide that",
                " you should accept them without further delay.",
                " Nay: no one among you knows how",
                " much of the respite of life is",
                " left to him. Any one of you",
                " can die at any time and the",
                " Last Hour can also take place suddenly.",
                " Therefore, do not think that the Hour",
                " of Judgement is yet far off. Whoever",
                " has any concern for the Hereafter, should",
                " mend his ways forthwith, for one may",
                " not have a chance to take a",
                " second breath after the present breath. \"",
                ""
            ]
        },
        {
            "verse-id": "[53:58]",
            "verse": "Of it, [from those] besides Allah, there is no remover.",
            "description": [
                "That is, when the Hour of Judgement",
                " dces arrive, you will not be able",
                " to stop it, nor your deities other",
                " than Allah have the power to avert",
                " it. Allah alone can stop it but",
                " He will not."
            ]
        },
        {
            "verse-id": "[53:59]",
            "verse": "Then at this statement do you wonder?",
            "description": [
                "The word hadh-al-Hadith as used in the",
                " original, signifies the whole teaching that was",
                " . being presented in the Qur'an through",
                " the Holy Prophet Muhammad (upon whom be",
                " Allah's peace and blessings) and \"marvel\" implies",
                " the marvel that man expresses on hearing",
                " a novel and incredible thing. The verse",
                " means this: \"That to which Muhammad (upon",
                " whom be Allah's peace and blessings) is",
                " inviting you is the same that you",
                " have already heard. Now, is it this",
                " very thing at which you marvel and",
                " feel alarmed, and express wonder as if",
                " something very strange and novel was being",
                " presented before you?\""
            ]
        },
        {
            "verse-id": "[53:60]",
            "verse": "And you laugh and do not weep",
            "description": [
                "That is, \"Instead of weeping at your",
                " ignorance and deviation you, on the contrary,",
                " are mocking, the Truth\"."
            ]
        },
        {
            "verse-id": "[53:61]",
            "verse": "While you are proudly sporting?",
            "description": [
                "Two meanings have been given of the",
                " word samidun by the lexicographers. Ibn `Abbas,",
                " `Ikrimah and Abu.`Ubaidah, the grammarian, are of",
                " the view that in the Yarnanite tongue",
                " sumud means singing and playing, and the",
                " verse alludes that the disbelievers of Makkah,",
                " in order to suppress the recitation of",
                " the Qur'an and to divert the people's",
                " attention away from it, would start singing",
                " in a loud voice. The other meaning",
                " of it given by lbn `Abbas and",
                " Mujahid is: `Sumud means bending down the",
                " head out of arrogance; when the disbelievers",
                " of Makkah passed by the Holy Prophet,",
                " they would pass by him angrily with",
                " their faces lifted up. \" Raghib Isphahani",
                " in his Mafradat also has adopted the",
                " same meaning; accordingly, Qatadah has translated samidun",
                " into ghafilun and Said bin Jubair into",
                " mu'ridun."
            ]
        },
        {
            "verse-id": "[53:62]",
            "verse": "So prostrate to Allah and worship [Him].",
            "description": [
                "According to Imam Abu Hanifah, Imam Shafe`i",
                " and many other scholars it is obligatory",
                " to perform a sajdah on the recitation",
                " of this verse. Although Imam Malik himself",
                " used to perform a sajdah here (as",
                " cited by Qadi Abu Bakr ibn al-`Arabi",
                " in Ahkam al-Qur 'an), yet he held",
                " the view that it was not obligatory",
                " to perform a sajdah here, the basis",
                " of his view being this tradition of",
                " Hadrat Zaid bin Thabit: \"I recited Surah",
                " an-Najm before the Holy Prophet, and he",
                " did not perfom a sajdah. ' (Bukhari,",
                " Muslim, Ahmad, Tirmidhi, Abu Da'ud, Nasa'i). But",
                " this Hadith dces not negate the incumbency",
                " of the prostration here, for it is",
                " likely that the Holy Prophet did not",
                " perform the sajdah then due to some",
                " reason but might have performed it later.",
                " Other traditions on the subject are explicit",
                " that the prostration was always performed on",
                " this verse. Hadrat `Abdullah bin Mas'ud, Ibn",
                " `Abbas and Muttalib bin Abi Wada`ah have",
                " unanimously stated that when the Holy Prophet",
                " recited this Surah for the first time",
                " in the Ka`bah, he had prostrated himself",
                " and along with him the whole assembly",
                " of the believers and the disbelievers also",
                " had fallen down prostrate. (Bukhari, Ahmad, Nasa'i)",
                " Ibn 'Umar has reported that the Holy",
                " Prophet recited Surah an-Najm in the Prayer",
                " and prostrated himself and lay long in",
                " that state. (Baihaqi, Ibn Marduyah). Saburat al-",
                " Juhani states that Hadrat 'Umar recited Surah",
                " an-Najm in the Fajr Prayer and performed",
                " a sajdah, then stood up, recited Surah",
                " al-Zilzal and performed the ruku'. (Sa'id bin",
                " Mansur). Imam Malik himself has related this",
                " act of Hadrat Umar in his Mu'watta",
                " (Bab Ma Ja `fi Sajud al-Qar en).",
                ""
            ]
        }
    ]
}