{
    "name": "Ar-Rahman",
    "verse-count": 78,
    "verse-info": [
        {
            "id": "[55:1]",
            "verse": "The Most Merciful",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:2]",
            "verse": "Taught the Qur'an,",
            "description": [
                "That is, the teaching of this Qur'an",
                " is not the production of a man's",
                " mind but its Teacher is the Merciful",
                " God Himself. Here, there was no need",
                " to tell as to whom AIIah had",
                " imparted this Qur'anic teaching for the people",
                " were hearing it from the tongue of",
                " the Prophet Muhammad (upon whom be Allah's",
                " peace and blessings). Therefore, the situation by",
                " itself made it evident that the teaching",
                " had been imparted to Muhammad (upon whom",
                " be Allah's peace and blessings). To begin",
                " the discourse with this sentence is meant,,first",
                " of aII, to tell that the Prophet",
                " Muhammad (upon whom be Allah's peace and",
                " blessings) himself is not its author, but",
                " its Teacher is AIlah Almighty. Furthermore, there",
                " is another object also to which the",
                " word Rahman (Merciful) is pointing. If the",
                " purpose was only to say that that",
                " teaching is from Allah, and not the",
                " production of the Prophet's mind, there was",
                " no need to use an attribute of",
                " AIIah instead of His proper name, acid",
                " for that purpose any attribute from among",
                " the Divine attributes could have been adopted,",
                " But when, instead of saying that AIIah,",
                " or the Creator, or the Providence, has",
                " taught this, it was said: 'The Merciful",
                " (Ar-Rahman) has taught this Qur'an,' it by",
                " itself gave the meaning that the revelation",
                " of the Qur'an for the guidance of",
                " mankind was nothing but Allah's mercy and",
                " grace, As He is most kind and",
                " Merciful to His creation, He did not",
                " like that He should leave them wandering",
                " in the darkness, and His mercy demanded",
                " that He should send down this Quran",
                " to bleu them with the knowledge on",
                " which depends their right guidance and conduct",
                " in the world and their success and",
                " well-being in the Hereafter, \""
            ]
        },
        {
            "id": "[55:3]",
            "verse": "Created man,",
            "description": [
                "In other words, as Allah is the",
                " Creator of man, and it is the",
                " Creator's responsibility to provide guidance to His",
                " creation and show it the way by",
                " following which it may fulfil the object",
                " of its erection, the revelation of this",
                " Qur'anic teaching from Allah is not only",
                " the demand of Allah's mercifulness but also",
                " the necessary and natural demand of His",
                " being the Creator. Who else would provide",
                " guidance to the creation if not the",
                " Creator ? And if the Creator did",
                " not provide guidance, who else could? And",
                " what greater defect could there be for",
                " a creator that he should not teach",
                " his creation the method of fulfilling the",
                " object, for which it has been created?",
                " Thus, in fact, the arrangement and' provision",
                " of the teaching for tnan by Allah",
                " is not anything strange; it would be",
                " strange if no such arrangement had been",
                " made at all, Allah has not just",
                " left alone whatever He has created in",
                " the Universe, but has given it the",
                " most appropriate structure by which it may",
                " play its role in the system of",
                " nature and has taught it the method",
                " of playing that role effectively and successfully.",
                " Thus, each single hair and each single",
                " cell of man's own body has been",
                " born with the knowledge of how it",
                " has to carry out the task in",
                " the human body for which it has",
                " been created, Then, after aII how could",
                " man himself remain deprived and independent of",
                " his Creator's teaching and guidance? This theme",
                " has been presented in the Qur'an at",
                " different places in different ways, In Surah",
                " Al-lail; 12, it has been said; \"Indeed,",
                " it is for Us to toll the",
                " Way\" in surah An-Nahl: 9, it is",
                " said Allah has taken upon Himself to",
                " show the Right Way, when there exist",
                " erooked ways too:12 In surah Ta Ha",
                " (vv: 47-50) it has been stated that",
                " when the Pharaoh heard the prophetic message",
                " from the Prophet Moses and asked who",
                " was his Lord who had sent him",
                " as a Messenger to him, the Prophet",
                " replied: \"Our Lord is He Who has",
                " given a distinctive form to everything and",
                " then guided it aright. \" That is,",
                " He has taught it the method by",
                " which it could carry out and fulfil",
                " the object of its creation in the",
                " system of existence. This is the reasoning",
                " by which an unbiased mind is satisfied",
                " that the coming of the Prophets and",
                " the Books from AIIah for the instruction",
                " of man is the very demand of",
                " nature."
            ]
        },
        {
            "id": "[55:4]",
            "verse": "[And] taught him eloquence.",
            "description": [
                "One meaning of the word bayan, as",
                " used in the original, is the expressing",
                " of one'e own mind, i e. speaking",
                " and expressing one's thoughts and intentions. Its",
                " other meaning is to make distinction between",
                " things, which here signifies the distinction between",
                " good and evil, virtue and vice. According",
                " to those two meanings this brief sentence",
                " completes the above reasoning. Speech is the",
                " distinctive quality which distinguishes man from the",
                " animals and other earthly creatures, It is",
                " not merely the power of speech, but",
                " there are working behind It the faculties",
                " of reasoning and intellect, understanding and discernment,",
                " will and Judgement, and other mental powers",
                " without which man's power of speech could",
                " not operate at all. Therefore, speech is",
                " in fact an express symbol of man's",
                " being an intelligent being who has been",
                " endowed with freedom and authority, and when",
                " AIIah has blessed man with this distinctive",
                " quality, evidently the nature of instruction for",
                " him also cannot be the same a:",
                " would be suitable for the guidance of",
                " other creatures. LIkewise, another distinctive quality of",
                " vital Importance in man is that AIlah",
                " has placed in him moral sense by",
                " virtue of which he can naturally distinguish",
                " between good and evil, truth and falsehood,",
                " Justice and injustice, right and wrong, and",
                " this intuition and sense does not leave",
                " hlm even when he degrades himself to",
                " the lowest state of error and ignorance.",
                " The Inevitable demand of these two distinctive",
                " qualities is that the method of instruction",
                " for man's conscious and voluntary life should",
                " be different from the innate, natural mode",
                " of instruction under which the fish has",
                " been taught to swim, the bird to",
                " fly, and the eye in the human",
                " body itself to wink and see, the",
                " ear to hear and the stomach to",
                " digest, Man in this sphere of his",
                " life himself recognizes the means like the",
                " teacher, the book, the school, the verbal",
                " and written instruction and reasoning and discussion",
                " as the modes of instrutction, and does",
                " not regard the innate knowledge and intelligence",
                " as enough. Why should It then appear",
                " arrange that for fulfilling the responsibility that",
                " falls upon the Creator of educating man,",
                " He has made the Messenger and the",
                " Book the means of his education and",
                " instruction ? The mode of education has",
                " to suit the nature of the creation,",
                " And very rationally so; The \"Qur'An\" alone",
                " cart be the means of educating the",
                " creation that has been taught 'bayan\"(speech) and",
                " not my other means that might salt",
                " the creatures which have not been taught",
                " the speech"
            ]
        },
        {
            "id": "[55:5]",
            "verse": "The sun and the moon [move] by precise calculation,",
            "description": [
                "That is, \"It is a powerful law",
                " and unalterable system that binds the great",
                " planets together. Man is able to calculate",
                " and measure time, days, dates, and crops",
                " and seasons only because no change takes",
                " place in the rule that Has been",
                " laid down for the rising and setting",
                " of the sun and of its passing",
                " through different stages. The innumerable creatures found",
                " on the earth are staying alive only",
                " because the sun and the moon have",
                " been accurately and precisely placed at particular",
                " distances from the earth and any increase",
                " or decrease in this distance is made",
                " in the right measure, in a particular",
                " order; otherwise if their distance from the",
                " earth increased or decreased haphazardly, no one,",
                " could possibly survive here. Likewise, the perfect",
                " relationship and harmony that has been established",
                " between the movements of the moon round",
                " the earth and the sun, has made",
                " the moon a universal calendar, which announces",
                " the lunar date every night to the",
                " whole world with perfect regularity."
            ]
        },
        {
            "id": "[55:6]",
            "verse": "And the stars and trees prostrate.",
            "description": [
                "The word used in the original is",
                " an-najm, the well-known meaning of which is",
                " the star; but in the Arabic lexicon",
                " this word is also used for the",
                " plants and creepers which do not have",
                " a stem, e.g. vegetable, melons, water melons,",
                " etc. The commentators have disputed the sense",
                " in which this word has been used",
                " here. Ibn 'Abbas, Sa'id bin Jubair, Suddi,",
                " and Sufyan Thauri have taken it in",
                " the meaning of stemless vegetation, for just",
                " after it the word ash-shajar (the tree)",
                " has been used and this meaning is",
                " more relevant to it. On the contrary,",
                " Mujahid, Qatadah and Hasan Basri have expressed",
                " the opinion that an-najm here does not",
                " imply the plants of the earth, but",
                " the stars of the sky, for this",
                " is its well-known meaning. On hearing this",
                " word, the mind first turns to this",
                " very meaning, and the mention of the",
                " sun and the moon has been followed",
                " by the stars very naturally and relevantly.",
                " Though the majority of the commentators and",
                " translators have preferred the first meaning, and",
                " it cannot be held wrong either, we",
                " hold Hafiz Ibn Kathir's this opinion as",
                " sound that in view of both the",
                " language and the subject-matter the second meaning",
                " seems to be preferable. At another place",
                " in the Qur'an (AI-Hajj: 18) also mention",
                " has been made of the stars and",
                " the trees prostrating themselves, and there the",
                " word nujum (pl. of najm) cannot be",
                " taken in any other meaning than of",
                " the stars. The words of the verse",
                " are: Alam fara annallaha yasjudu lahu man",
                " fis sma wat-i wa man fil ardi",
                " wash-shamsu wal-qamaru walnujumu wal jibalu wash-shajaru wad-da",
                " wabbu wa kathir-um-min-annasi. . . . (AI-Hajj:",
                " 18). In this verse nujum (stars) have",
                " been mentioned along with shams (sun) and",
                " qamar (moon), and shajar (trees) along with",
                " mountains and animals and it has been",
                " said that they all bow down to",
                " AIIah.",
                "*6) That is, \"The stars of",
                " the heavens and the trees of the",
                " earth, alI are subject to Allah's Command",
                " and obedient to His Law. They cannot",
                " exceed the rule that has been set",
                " for them.\" What is meant to be",
                " impressed in these two verses is that",
                " the whole system of the Universe has",
                " been created by Allah and is fimctioning",
                " in His obedience. Nothing front the earth",
                " to the heavens is independent, nor functioning",
                " under another's godhead, nor has anyone any",
                " share in God's Kingdom, nor has anyone",
                " the position that it should be made",
                " a deity. AII are servants and slaves:",
                " the Master is One Almighty Lord alone.",
                " Hence, Tauhid alone is the Truth which",
                " is being taught by this Qur'an. Apart",
                " from this, any one who is involved",
                " in polytheism and denial of God is,",
                " in fact, at war with the whole",
                " system of the Universe."
            ]
        },
        {
            "id": "[55:7]",
            "verse": "And the heaven He raised and imposed the balance",
            "description": [
                "Almost aII the commentators have interpreted mizan",
                " (balance) to mean justice, and '...set the",
                " balance\" to imply that AIIah has established",
                " the entire system of the Universe on",
                " justice. Had there been no harmony and",
                " balance and justice established among the countless",
                " stars and planets moving in space, and",
                " the mighty forces working in this Universe,",
                " and the innumerable creatures and things found",
                " here, this life on earth would not",
                " have functioned even for a moment. Look",
                " at the creatures existing in the air",
                " and water and on land for millions",
                " and millions of years on this earth.",
                " They continue to exist only because full",
                " justice and balance has been established in",
                " the means and factors conducive to life;",
                " in case there occurs a slight imbalance",
                " of any kind, every tract of lift",
                " would become extinct."
            ]
        },
        {
            "id": "[55:8]",
            "verse": "That you not transgress within the balance.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:9]",
            "verse": "And establish weight in justice and do not make deficient the balance.",
            "description": [
                "That is, \"As you are living in",
                " a balanced Universe, whose entire system has",
                " been established on justice, you also should",
                " adhere to justice. For if you act",
                " unjustly within the sphere in which you",
                " have been given authority, and fail to",
                " render the rights of others, you would",
                " indeed be rebelling against the nature of",
                " the Universe; for the nature of this",
                " Universe does not admit of injustice and",
                " perversion and violation of the rights. Not",
                " to speak of a major injustice, even",
                " if a person fraudulently deprives another of",
                " an ounce of something, by giving him",
                " short measure, he disturbs the balance of",
                " the entire Universe.-This is the second important",
                " part of the Qur'anic teaching that has",
                " been presented in these three verses. The",
                " first teaching is Tauhid and the second",
                " is justice. Thus, in a few brief",
                " sentences the people have been told what",
                " teaching has been brought by the Qur'an",
                " which the Merciful God has sent for",
                " the guidance of man.\""
            ]
        },
        {
            "id": "[55:10]",
            "verse": "And the earth He laid [out] for the creatures.",
            "description": [
                "Now from here to verse 20, mention",
                " is being made of the blessing and",
                " bounties of God and of those manifestations",
                " of His might by which both man",
                " and jinn are benefiting, and whose natural",
                " and moral demand is that although they",
                " have the option to believe or not",
                " to believe, they should adopt the way",
                " of their Lord's service and obedience willingly",
                " by their own free choice.",
                "*10) The",
                " word wade ` in the original means",
                " to compost, make, prepare, keep. and inscribe,",
                " and anam the creatures, which includes man",
                " and all other living things. According to",
                " Ibn 'Abbas, anam includes every thing which",
                " has a soul. Mujahid takes it in",
                " the meaning of the living creatures. Qatadah,",
                " Ibn Zaid and Sha'bi say that all",
                " living things are anam. Hasan Basri says",
                " that both the men and the jinn",
                " are included in its meaning. The same",
                " meanings have been~given by the lexicographers. This",
                " shows that the people who deduce from",
                " this verse the command of making land",
                " the state property, are in error. This",
                " is an ugly attempt to introduce alien",
                " theories forcibly into the Qur'an which arc",
                " neither supported by the words of the",
                " verse nor by the context. Anam is",
                " not used only for human society but",
                " it includes aII other creatures of the",
                " earth as well, and setting of the",
                " earth for anam dces not mean that",
                " it should be the common property of",
                " aII. Besides, the context here also dces",
                " not indicate that the object of the",
                " verse is to state some economic principle.",
                " This, in fact, is meant to impress",
                " the truth that AIIah made and prepared",
                " this earth in such a way that",
                " it became a fit abode for every",
                " kind of living being. It has not",
                " become so by itself, but by the",
                " will and power of the Creator. He",
                " in His wisdom placed it at a",
                " suitable distance and created such conditions on",
                " it which made it possible for the",
                " different species to exist and stay alive",
                " on it. (For explanation, see E.N.'s 73,",
                " 74 of An-Naml, E.N.'s 29, 32 of",
                " Ya Sin, E.N.'s 90, 91 of Al-Mu'min,",
                " E.N.'s 11 to 13 of Ha Mim",
                " As-Sajdah, E.N.'s 7 to 10 of Az.Zukhruf,",
                " E.N. 7 of AI-Jathiyah)."
            ]
        },
        {
            "id": "[55:11]",
            "verse": "Therein is fruit and palm trees having sheaths [of dates]",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:12]",
            "verse": "And grain having husks and scented plants.",
            "description": [
                "That is, grain for men and husk",
                " for the animals."
            ]
        },
        {
            "id": "[55:13]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "The word alaa' in the refrain as",
                " repeated over and over again in the",
                " subsequent verses has been translated differently at",
                " different places. Therefore, it would be useful",
                " to understand at the outset how vast",
                " this word is in meaning and what",
                " different shades of meaning it contains. The",
                " lexicographers and commentators generally have explained alaa'",
                " to mean \"blessings\" and \"bounties\". The translators",
                " also have given this same meaning of",
                " this word, and the same has been",
                " reported from Ibn 'Abbas, Qatadah and Hasan",
                " Basri. The major argument that supports this",
                " meaning is the Holy Prophet's own statement",
                " that the jinn on hearing this verse",
                " being recited would respond to it, saying",
                " La bi-shai in-min-ni maatika Rabba-na nukadhdhib: \"O",
                " our Lord, we do not deny any",
                " of Your blessings.\" Therefore, we do not",
                " subscribe to the view of some present-day",
                " scholars, who say that alaa' is never",
                " used in the meaning of the blessing.",
                " Another meaning of this word is power",
                " and wonders of power, or excellent manifestations",
                " of power. Ibn Jarir Tabari has reported",
                " that Ibn Zaid took the words fa-bi-ayyi",
                " alaa i Rabbi kuma in the meaning",
                " of fa bi-ayyi qudrat-Allah. Ibn Jarir himself",
                " has taken alaa' in the meaning of",
                " power and might in his commentary of",
                " vv. 37-38. Imam Razi also has made",
                " this observation in his commentary of vv.14-16:",
                " \"These verses do not describe the blessings",
                " but the powers of AIIah, and in",
                " the commentary of vv. 22-23, this; \"These",
                " describe the wonders of power and not",
                " the blessings.\" Its third meaning is virtue,",
                " praiseworthy qualities, and prefections. Though this meaning",
                " has not been mentioned by the lexicographers",
                " and commentators, this word has often been",
                " used in this meaning in Arabic poetry.",
                " ( Examples omitted). Thus, we have taken",
                " this word in its vastest meaning and",
                " translated it suitably keeping in view the",
                " context in which it occurs. However, at",
                " some places the word alaa ' may",
                " have several senses in one and the",
                " same place, but due to limitations of",
                " translation we have had to adopt only",
                " one meaning. For example, in this verse",
                " after making mention of the creation of",
                " the earth and of making the best",
                " arrangements for the supply of provisions to",
                " the creatures, it has been said: 'Which",
                " of the alaa' of your Lord will",
                " you deny?\" Here, alaa' has not been",
                " used in the meaning of the blessings",
                " only but also in the meaning of",
                " the manifestations of AIIah Almighty's power and",
                " His praiseworthy attributes. It is a wonder",
                " of His might that He fashioned this",
                " earth in such a marvellous manner that",
                " countless species of creatures live here and",
                " an endless variety of fruits and grain",
                " are grown on it. And it is",
                " due to His praiseworthy qualities that He",
                " not only created these creatures but also",
                " made arrangements for their sustenance and the",
                " supply of provisions for them; and the",
                " arrangements also so perfect that their food",
                " is not only nutritious but also pleasing",
                " to the taste and sight. In this",
                " connection, reference has been made to only",
                " one excellence of AIlah Almighty's workmanship for",
                " the sake of example, viz., the creation",
                " of the date-palm fruit in sheaths. Keeping",
                " this one example in view one may",
                " consider what excellences of art have been",
                " devised and shown in the packing of",
                " banana, pomegranates, orange, coconut and other fruits,",
                " and how each of the different sorts",
                " of the grains and pulses which we",
                " so thoughtlessly cook and eat, are produced",
                " hotly packed and covered in ears and",
                " pods and clusters.",
                "*13) \"Denying\" implies the",
                " several attitudes that the people adopt in",
                " respect of AIlah Almighty's blessings and manifestations",
                " of His might and His praiseworthy attributes.",
                " For example, some people do not at",
                " all admit that the Creator of aII",
                " things is Allah Almighty. They think that",
                " aII this is a mere byproduct of",
                " the matter, or an accidental happening, which",
                " is un-related with any wisdom and skill",
                " and workmanship. This is open denial. Some",
                " other people do admit that the Creator",
                " of these things is Allah, but regard",
                " others beside Him also as associates in",
                " Godhead: they render thanks to others for",
                " His blessings: they adore others although they",
                " eat His provisions. This is another form",
                " of denial. Obviously, it would be the",
                " height of ingratitude if a person while",
                " admitting that a certain person had done",
                " him a favour rendered thanks to another,",
                " who had not in fact dent him",
                " that favour, for this act of his",
                " would be an express proof that he",
                " regarded the other person as his benefactor",
                " whom he was rendering the thanks. There",
                " are still others. who acknowledge Allah alone",
                " as the Creator of all things and",
                " the Bestower of all blessings, but do",
                " not admit that they should obey the",
                " Commands of their Creator and Sustainer and",
                " follow His injunctions. This is another form",
                " of ingratitude and denial of the blessings,",
                " for the person who behaves so denies",
                " the right of the Bestower of the",
                " blessing although he acknowledges the blessing itself.",
                " Some other people neither disavow the blessing",
                " nor deny the right of the Bestower",
                " of the blessing, but in practice there",
                " is no appreciable difference between their conduct",
                " and the conduct of a denier. This",
                " is not verbal denial but denial in",
                " practice."
            ]
        },
        {
            "id": "[55:14]",
            "verse": "He created man from clay like [that of] pottery.",
            "description": [
                "The order of the initial stages of",
                " the creation of man, as given at",
                " different places in the Qur'an seems to",
                " be as follows: (1) Turab, i.e. earth",
                " or dust; (2) Tin, i.e. clay made",
                " by mixing water with earth; (3) tin-i-lazib:",
                " sticky clay, i.e. a clay which becomes",
                " sticky when left alone for a long",
                " time; (4) hama in musnun, i.e. clay",
                " with a stink in it; (S) salsal-im-min",
                " hems in masnun kalfakhkhar. i.e. the rotten",
                " clay which when dried becomes like baked",
                " pottery; (ti) bashar, i.e.. the one who",
                " was made from this last form of",
                " the earth, in whom Allah breathed of",
                " His Spirit, to whom the angels were",
                " commanded to bow down, and from whose",
                " species his mate was created; (7) thumma",
                " ja ala nasla-hu min sulala-tin-min-ma 'in mahin:",
                " 'then spread his progeny by means of",
                " an extract of the nature of a",
                " despicable water', for which the word nutfah",
                " has been used at other places. For",
                " these stages one may look up the",
                " following verses of the Qur'an in sequence:",
                " ka-melba/-i Adalla khalaqa-hu min turab (AI-'Imran :",
                " 59); bed's khalqal-insan-i min tin (As Sajdah:",
                " 7); Inna khalaq-na hum min tin-il-/azib (As-Saaffat:",
                " 11): the fourth and fifth stages have",
                " been described in the verse being explained,",
                " and the later stages in the following",
                " verses : Inni khaliq-un bashar an-nun tin.",
                " Faidha sa wwaitu-hu wa nafakhtu-fi -hi min-ruhi",
                " fa-qa ,u-lahu sajidin. (Suad : 71-72); khalaqa-kum",
                " min-nafs in wahidatin wa khalaqa nun-ha zauja-ha",
                " wa baththa minhuma rijal-an kathir-an wa nisa-an.",
                " (An -Nisa':1) ; thumma Ja ala nasla-hu",
                " min sulata-tin-min mmaa'-in -mahin. (As-Sajdah: 8); fa-inna",
                " khalaq-na-kum min turabin thumma min nutfs-tin. (AI-Hajj:5).",
                ""
            ]
        },
        {
            "id": "[55:15]",
            "verse": "And He created the jinn from a smokeless flame of fire.",
            "description": [
                "The words in the original are: mim-marij-im-min-nar.",
                " Nar signifies fire of a special nature",
                " and not the fire which is produced",
                " by burning wood or coal, and marij",
                " means a pure, smokeless flame. The verse",
                " means that just as the first man",
                " was created out of earth, then passing",
                " through various stages of creation, the clay",
                " model adopted the shape of a living",
                " man of flesh and blood, and then",
                " his progeny spread by means of the",
                " sperm-drop, so was the first jinn created",
                " from a pure flame of fire, or",
                " a fire free of smoke, and then",
                " the species of jinn spread from his",
                " progeny. The position of the first jinn",
                " among the jinn is the same as",
                " of Adam (peace be upon him) among",
                " human beings. After taking the shape of",
                " a living man, the body of Adam",
                " and the human beings born of his",
                " progeny retained no relationship with the dust",
                " from which. they were originally created. Though",
                " even now our body is entirely a",
                " compound of the earthly substances, these substances",
                " have taken the from of flesh and",
                " blood and after being made a living",
                " body it has become quite a different",
                " thing from a mere lump of clay.",
                " The same also is true of the",
                " jinn. Their being also is essentially fiery.",
                " But just as we are not a",
                " mere lump of earth, so also they",
                " arc not a mere flame of fire.",
                " This verse proves two things. First, that",
                " the jinn are not simply spirit, but",
                " are material beings of a special nature,",
                " but since they have been composed of",
                " pure fiery substances, they remain invisible to",
                " human beings who have bean created of",
                " earthly substances. The same has been referred",
                " to in this verse: \"Satan and his",
                " party see you from where you cannot",
                " see them.\" (AI-A`raf: 27) Likewise, the jinn's",
                " being fast-moving, their adopting different shapes and",
                " forms easily and their penetrating into different",
                " places imperceptibly where things made of earthly",
                " substances cannot penetrate, or if they do,",
                " their.penetration becomes perceptible, all these things are",
                " possible and understandable only because they are",
                " essentially a fiery creation. The other thing",
                " that we come to know from this",
                " verse is that the jinn are not",
                " only a creation of a wholly different",
                " nature from human beings, but the substance",
                " of their creation also is absolutely different",
                " from that of man, animal, vegetable and",
                " solid matter. This verse explicitly points out",
                " the error of the viewpoint of those",
                " people who regard the jinn as a",
                " kind of haman beings. According to their",
                " interpretation, the meaning of creating man of",
                " the dust and the jinn of the",
                " fire is to describe the difference of",
                " the temperamental nature of the two kinds",
                " of the people; one kind of them",
                " are humble by nature, and they are",
                " men in the true sense, and the",
                " other kind of the people are wicked",
                " by nature and fiery in temper, who",
                " may better be called devils. This is,",
                " however, no commentary of the Qur'an but",
                " its distortion. In E.N. 14 above we",
                " have shown in detail how the Qur'an",
                " itself has fully described the meaning of",
                " creating man from the earth. After reading",
                " aII these details, can a reasonable person",
                " understand that the object of aII this",
                " is only to define the humility of",
                " the good men ? Moreover, how can",
                " a sound-minded person understand that the meaning",
                " of creating man of rotten, dry clay",
                " and the jinn of the flame of",
                " pure fire is the difference of the",
                " separate moral characteristics of the two individuals",
                " or groups with different temperaments belonging to",
                " the same human species? (For further explanation,",
                " see E.N. 53 of Surah Adh-Dhariyat)."
            ]
        },
        {
            "id": "[55:16]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here, in view of the context, It",
                " is more appropriate to translate alaa' as",
                " 'wonders of power\", but in this the",
                " aspect of the blessing is also present.",
                " Just as it is a wonderful manifestation",
                " of Allah's power to have brought into",
                " existence marvellous creatures like man from the",
                " dust and the jinn from the flame",
                " of fire, so for both these creatures",
                " this is a great blessing also that",
                " Allah not only granted them a body",
                " but gave each such a structure and",
                " endowed each with such powers and capabilities",
                " that they became able to perform unique",
                " works in the world. Though we do",
                " not know much about the jinn, man",
                " is present before us. Had he been",
                " given the body of a fish or",
                " a bird or a monkey along with",
                " the human brain, he could not have",
                " with that body used the mental powers",
                " to any advantage. Then, is it not",
                " a supreme blessing of AIIah that He",
                " blessed man with the most suitable body",
                " also, so that he may exploit the",
                " mental powers granted to him efficiently? Consider",
                " the hands, the feet, the eyes, the",
                " ears, the tongue and the erect stature",
                " as againts the intellect and reason, and",
                " the capabilities of workmanship and artistic skill,",
                " and one will feel that the Creator",
                " has provided a deep relationship and harmony",
                " between them without which the human body",
                " would have remained useless. Then, the same",
                " thing points out Allah's praiseworthy qualities too.",
                " How could the men and jinn of",
                " such quality and rank be brought into",
                " existence without knowledge, wisdom, mercy and a",
                " profound creative power ? For such miracles",
                " of creation cannot be performed by accidents",
                " and automatic blind and deaf laws of",
                " nature."
            ]
        },
        {
            "id": "[55:17]",
            "verse": "[He is] Lord of the two sunrises and Lord of the two sunsets.",
            "description": [
                "'Both the Easts and both the Wests\"",
                " may mean the two points of sunrise",
                " and the two points of sunset on",
                " the shortest day of winter and the",
                " longest day of summer as well as",
                " the easts and the wests of the",
                " two hemispheres of the earth. On the",
                " shortest day of winter the sun rises",
                " and sets making a small acute angle:",
                " on the contrary, on the longest day",
                " of summer-it rises and sets making a",
                " wide obtuse angle. Between them its points",
                " of rising and setting go on shifting",
                " every day, for which at another place",
                " in the Qur'an (AI-Ma'arij: 40) the words",
                " Rabbul-mashariq wal-magharib have been used. Likewise, at",
                " the time the sun rises in one",
                " hemisphere of the earth, it sets in",
                " the other hemisphere, thus producing two easts",
                " and two wests of the earth. There",
                " arc several meanings of calling AIIah Lord",
                " of both the Easts and both the",
                " Wests. Firstly, that it is by His",
                " Command that the system of the rising",
                " and setting of the sun and their",
                " changing pattern during the year is fimctioning.",
                " Second, that AIIah alone is the Master",
                " and Ruler of the earth and the",
                " sun; had they their own separate lords,",
                " this regular system of the rising and",
                " setting of the sun on the earth",
                " could not have functioned and continued to",
                " function permanently. Third, that the Master and",
                " Sustainer of both the Easts and both",
                " the Wests is One Allah alone; to",
                " Him belong the creations living between them.",
                " He alone is nourishing them, and it",
                " is for their sustenance that He has",
                " established this wise system of the rising",
                " and setting of the sun on the",
                " earth."
            ]
        },
        {
            "id": "[55:18]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here also, although in view of the",
                " context, \"power\" seems to be a more",
                " conspicuous meaning of alaa', yet, besides, the",
                " aspect of \"blessing\" and 'praiseworthy qualities\" also",
                " is present in it. It is a",
                " great blessing that Allah Almighty has prescribed",
                " the rule of the rising and setting",
                " of the sun, for by means of",
                " it the changes of the crops and",
                " seasons arc regulated with which countless interests",
                " of the men and animals and vegetables",
                " are attached. Likewise, it is Allahs mercy",
                " and providence and wisdom that He has",
                " made these arrangements by His power to",
                " meet the respective needs and requirements of",
                " the creatures He has created on the",
                " earth."
            ]
        },
        {
            "id": "[55:19]",
            "verse": "He released the two seas, meeting [side by side];",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:20]",
            "verse": "Between them is a barrier [so] neither of them transgresses.",
            "description": [
                "For explanation, see E. N . 68",
                " of Surah AI-Furqan."
            ]
        },
        {
            "id": "[55:21]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:22]",
            "verse": "From both of them emerge pearl and coral.",
            "description": [
                "According to Ibn 'Abbas, Qatadah, Ibn Zaid",
                " and Dahhak (may AIIah bless them), marjan",
                " implies small pearls, but according to Hadrat",
                " 'Abdullah bin Mas'ud, this word is used",
                " for corals in Arabia.",
                "*21) Literally: \"From",
                " both these seas come out...\" The objectors",
                " say that pearls and corals come out",
                " only from salt waters. How is it",
                " then that they are stated to come",
                " out from both the sweet and salt",
                " waters ? The answer is that the",
                " seas contain both the sweet and the",
                " salt waters; therefore, whether it is said",
                " that these things come out from the",
                " combination of both, or from both kinds",
                " of waters, it would be one and",
                " the same thing. And it may well",
                " be that further investigations might reveal that",
                " both these things originate in the sea",
                " at the place where springs of sweet",
                " water gush outs from the sea bed;",
                " and in their birth and development combination",
                " of both kinds of the water plays",
                " its part. Near Bahrain which has been",
                " famous for its pearl-fisheries for centuries, there",
                " exist springs of sweet water at the",
                " bottom of the Gulf."
            ]
        },
        {
            "id": "[55:23]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here also though the aspect of power",
                " in alaa' is conspicuous, the aspect of",
                " the blessing and praiseworthy qualities also is",
                " not hidden. It is a blessings of",
                " God that these valuable things come out",
                " from the sea, and it is His",
                " Providence that for the satisfaction of the",
                " aesthetic taste of the creatures whom He",
                " had blessed with the taste for beauty",
                " and the lout and longing for adornment,",
                " He created ali sorts of these beautiful",
                " things in His world."
            ]
        },
        {
            "id": "[55:24]",
            "verse": "And to Him belong the ships [with sails] elevated in the sea like mountains.",
            "description": [
                "\"His are the ships...\": Ships became possible",
                " only by His power. It is He",
                " Who blessed man with the capability and",
                " skill that he may build ships for",
                " crossing the oceans; it is He Who",
                " created on the earth the material from",
                " which ships could be built; and it",
                " is He Who subjected water to the",
                " laws by which it became possible for",
                " the mountain-like ships to sail on the",
                " surface of the surging oceans."
            ]
        },
        {
            "id": "[55:25]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here, the aspect of the blessing; and",
                " bounty is conspicuous in alaa', but the",
                " explanation given above shows that the aspect",
                " of power and good qualities also is",
                " present in it."
            ]
        },
        {
            "id": "[55:26]",
            "verse": "Everyone upon the earth will perish,",
            "description": [
                "From hero to vane 30, the jinn",
                " and the men have been informed of",
                " two realities; First, 'Neither you arc immortal",
                " nor the provisions that you arc enjoying",
                " in this world everlasting. Immortal and Everlasting",
                " is the Being of the High and",
                " Supreme God alone Whose greatness this Universe",
                " testifies, and by Whose grace and kindness",
                " you have been favoured with these bounties.",
                " Now, if some one among you behaves",
                " arrogantly, it would be due to his",
                " own meanness. If a foolish person assumes",
                " haughtiness in his tiny sphere of authority,",
                " or becomes god of a sew helpless",
                " men who fall into his hand, this",
                " farce would not last long. A godhead",
                " that lag: for a mere score or",
                " two score years in a corner of",
                " the earth whose size in this limitless",
                " Universe is not even equal to a",
                " pea seed, and then becomes a legend",
                " of the past, is not something of",
                " which one may feel proud and arrogant.",
                " \" The other important truth of which",
                " both these creations have been warned is:",
                " 'None of those whom you have set",
                " up as deities and removers of hardships",
                " and fulfiller: of needs, apart from AIlah,",
                " whether they are angels or prophets or",
                " the moon and the sun, or some",
                " other creation, can fulfil any of your",
                " needs. These lulpless creatures and things themselves",
                " stand in need of Allah's help for",
                " their needs and requirements. They themselves pray",
                " to Him for help; when they are",
                " not nble to remove their own hardships",
                " how wIll they remove your hardships? Whatever",
                " Is happening In this limitless Universe, from",
                " the earth to the heavens, Is happening",
                " under rite Command of One God alone,",
                " No one else has any sham In",
                " His Godhead; no one therefore can lunfluence",
                " anyone else's destiny In any way"
            ]
        },
        {
            "id": "[55:27]",
            "verse": "And there will remain the Face of your Lord, Owner of Majesty and Honor.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:28]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here, as the context itself shows, the",
                " word alaa' has been used in the",
                " sense of excellences and perfections. Whoever of",
                " the mortal creatures is involved in vanity",
                " and self-arrogance and struts about thinking that",
                " his false godhead is everlasting, disavows Lord",
                " of the world's glory and majesty by",
                " his conduct, if not by his tongue.",
                " His pride and arrogance by itself is",
                " a denial of AIlah Almighty's greatness and",
                " glory. Whatever claim he may make to",
                " an excellence by his tongue, or arrogate",
                " to himself such an excellence, it is",
                " indeed a disavowal of the rank and",
                " station of the real Possessor of excellences",
                " and perfections."
            ]
        },
        {
            "id": "[55:29]",
            "verse": "Whoever is within the heavens and earth asks Him; every day He is bringing about a matter.",
            "description": [
                "That is, \"He is continuously and endlessly",
                " fimctioning in this Universe and creating countless",
                " new things with new and yet new",
                " forms and designs and qualities, He is",
                " giving death to one and life to",
                " another, exalting one and debasing another, causing",
                " one to recover and another to remain",
                " ill, rescuing a drowning one and drowning",
                " a floating one. He is providing sustenance",
                " to countless creatures in a variety of",
                " ways, His world never stays In the",
                " same state: it is changing every moment",
                " and its Creator arranges it in a",
                " new state and fashion every time, which",
                " is different from every previous form and",
                " fashion and state, \""
            ]
        },
        {
            "id": "[55:30]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here, alaa seems to have been treed",
                " in the sense of qualities and glories",
                " Every person who commits polytheism of any",
                " kind, in fact, disavows one or the",
                " other of Allah's attributes, A person's saying",
                " that such and such a saint has",
                " removed his disease, in fact, amounts to",
                " saying that Allah is not the Remover",
                " of disease and Restorer of health but",
                " the saint, Another one's saying that such",
                " and such a holy one has got",
                " him a job, in fact, amounts to",
                " saying that AIIah is not the Sustainer",
                " and Lord but the particular holy person.",
                " Still another one's saying that his prayer",
                " has been answered at a particular shrine,",
                " in fact, amounts to saying that the",
                " command governing the world is not Allah's",
                " but the shrine's, In short, every polytheistic",
                " belief and utterance, in the final analysis,",
                " leads up to the disavowal of the",
                " Divine attributes. Polytheism is nothing but that",
                " one should ascribe the Divine attributes of",
                " being All-Hearing and AII-Seeing, Almighty and All-Powerful,",
                " etc.. to others than Allah, and should",
                " deny that AIIah alone is the Possessor",
                " of all these attributes."
            ]
        },
        {
            "id": "[55:31]",
            "verse": "We will attend to you, O prominent beings.",
            "description": [
                "Thaqalan is derived from thiql which means",
                " a burden, and thaqal is the burden",
                " loaded on a conveyance. Thaqalan (dual) therefore",
                " would mean: \"two loaded burdens\". Here this",
                " word refers to the jinn and then;",
                " who are both loaded on the earth.",
                " As the addressees here are those jinn",
                " and men who have turned away from",
                " the service and obedience of their Lord",
                " and Sustainer, they have been addressed as:",
                " \"0 burdens of the earth,\" In other",
                " words, the Creator is warning these two",
                " unworthy groups of His creation, saying; \"'",
                " you who have become a burden for",
                " My earth, I am soon going to",
                " take you to task,\"",
                "*30) This dces",
                " not mean that AIIah at this time",
                " is too busy to call the disobedient",
                " servants to account, but it means that",
                " AIIah has arranged a special time-table according",
                " to which He will first bring into",
                " existence generation after generation of the jinn",
                " and men in the world till an",
                " appointed time, and will provide theist with",
                " an opportunity to work in this examination",
                " centre of the world; then at a",
                " specific Hour the examination will be suddenly",
                " brought to a close, and alI the",
                " jinn and men living at that time",
                " will be given death simultaneously. Then at",
                " another time which is preordained with Allah",
                " for calling the jinn and men to",
                " account, all the former and the latter",
                " generations of both the species will be",
                " resurrected and mustered at one and the",
                " same time. In view of this time-table",
                " the two species have been warned, as",
                " if to say: `We are yet busy",
                " with the work of the first period,",
                " and the time for the second period",
                " has not yet come, not to speak",
                " of embarking on the work of the",
                " third period. But you may rest assured.",
                " The time is fast approaching when We",
                " shall be free to take you to",
                " task.\" This lack of leisure does not",
                " mean that AIIah is too occupied with",
                " one kind of work to attend to",
                " another kind of work. But its nature",
                " is analogous to the occupation of a",
                " person who has set a time-table for",
                " different sorts of the works and in",
                " respect of a work whose time has",
                " not yet arrived according to the time-table,",
                " he may say that he at the",
                " moment is not free for it."
            ]
        },
        {
            "id": "[55:32]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Here, alaa' can also be taken in",
                " the meaning of powers. In view of",
                " the context, each meaning seems to be",
                " appropriate in its own way. According to",
                " the first meaning, it would mean: \"Today",
                " you are being ungrateful for Our blessings",
                " and are being treacherous and disloyal by",
                " adopting the different attitudes of disbelief, polytheism,",
                " atheism, sin and disobedience, but tomorrow when",
                " the time comes for accountability, We shall",
                " sec which of Our blessings you prove",
                " to be the result of a mere",
                " accident, or the fruit of your own",
                " ability, or manifestation of the kindness of",
                " a god or goddess or saint.\" In",
                " the second case, the meaning would be:",
                " `Today you are mocking the doctrine of",
                " Resurrection and the gathering together of all",
                " mankind and jinn on the Day of",
                " Judgement and the accountability and the Heaven",
                " and Hell, and are harbouring the misunderstanding",
                " that such things arc not at all",
                " possible, but when We gather you together",
                " for accountability and all that you deny",
                " today will appear before you, then We",
                " shall see which of Our powers you",
                " deny.\""
            ]
        },
        {
            "id": "[55:33]",
            "verse": "O company of jinn and mankind, if you are able to pass beyond the regions of the heavens and the earth, then pass. You will not pass except by authority [from Allah].",
            "description": [
                "'The earth and the heavens\": the Universe",
                " or the Kingdom of God. The verse",
                " means to impress this: `It is not",
                " in your power to escape Allah's grasp.",
                " When the time for the accountability of",
                " which you are being foretold comes, you",
                " will be seized and brought before God",
                " in any case wherever you may be.",
                " To go out of God's reach you",
                " will have to flee from the Universe",
                " of God for which you do trot",
                " have the required power. If you feel",
                " that you have the power, then you",
                " may use that power if you so",
                " will. \""
            ]
        },
        {
            "id": "[55:34]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:35]",
            "verse": "There will be sent upon you a flame of fire and smoke, and you will not defend yourselves.",
            "description": [
                "The word shuwaz, as used in the",
                " original, means the pure, smokeless dame, and",
                " nuhas is the gross smoke without a",
                " flame. These two things, one after the",
                " other, will be Iet loose upon the",
                " men and jinn, when they try to",
                " escape the accountability of AIIah."
            ]
        },
        {
            "id": "[55:36]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:37]",
            "verse": "And when the heaven is split open and becomes rose-colored like oil -",
            "description": [
                "This refers to the Day of Resurrection.",
                " Bursting of the heavens implies loosening of",
                " the discipline of the heavens, scattering of",
                " the celestial bodies, upsetting of the system",
                " of the heavens. And the meaning of",
                " `reddening like red leather\" is that during",
                " that great upheaval anyone who looks up",
                " towards the sky, will feel as though",
                " the entire heavens were on fire."
            ]
        },
        {
            "id": "[55:38]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                "That is, \"Today you deem Resurrection impossible;",
                " you think Allah has no power to",
                " bring it about. But when it will",
                " have taken place and you see with",
                " your eyes aII that you are being",
                " foretold, which of the powers of Allah",
                " will you then deny ?"
            ]
        },
        {
            "id": "[55:39]",
            "verse": "Then on that Day none will be asked about his sin among men or jinn.",
            "description": [
                "This is being explained by the subsequent",
                " sentence: \"The culprits there shall be recognized",
                " by their faces.\" It means that in",
                " that great assembly where aII the former",
                " and the latter generations will have gathered",
                " together, there will be no need to",
                " ask as to who are the culprits,",
                " nor will any man or jinn need",
                " be asked whether he is a culprit",
                " or not. The dejected faces of the",
                " culprits, their terror-stricken eyes, their disturbed and",
                " alarmed countenances will themselves be enough to",
                " expose the secret that they are the",
                " culprits. When a crowd comprising both the",
                " guilty and the innocent people, is encircled",
                " by the police, the calm and tranquil",
                " of the innocent people and the bewildered",
                " and disturbed state of the guilty ones",
                " tell at one glance as to who",
                " in the crowd is the culprit and",
                " who is innocent. This general rule is",
                " in most cases belied in the world,",
                " because the worldly police do not enjoy",
                " the reputation of being fair and just,",
                " rather on many an occasion they have",
                " turned out to be more bothersome for",
                " the gentle and innocent people than for",
                " the culprits. Therefore, here it is possible",
                " that when encircled by the police the",
                " gentle and innocent people might become even",
                " more terror-stricken than the criminals, but in",
                " the Hereafter, when every noble person will",
                " have complete faith in the justice of",
                " AIlah, bewilderment will afflict only those whose",
                " conscience will be conscious of their being",
                " the culprits themselves, and who on their",
                " very arrival in the Court of God",
                " will become certain of their doom, which",
                " they had regarded as impossible or doubtful",
                " in the world and so had been",
                " committing every heinous sin and crime."
            ]
        },
        {
            "id": "[55:40]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "The real basis of the crime according",
                " to the Qur'an is that the servant",
                " who is benefiting by the Blessings of",
                " his Sustainer; should harbour the misunderstanding that",
                " the blessings have been bestowed by no",
                " one, but have reached him of their",
                " own accord, or that the blessings are",
                " not the gift of God but the",
                " fruit of his own ability or good",
                " fortune, or that they are the gift",
                " of God, but God has no right",
                " on His servants, or that God Himself",
                " has not done him those favours but",
                " some other being has got these done",
                " him. These are the wrong concepts on",
                " account of which man becomes independent of",
                " God and being free from His obedience",
                " and service performs acts which He has",
                " forbidden. and avoids acts which He has",
                " enjoined. Seen in this light every crime",
                " and every sin Is, in reality. o",
                " disavowal of the favours of AIIah whether",
                " a person denies them by the word",
                " of (mouth or not. But the person",
                " who, in fact, has no intention of",
                " the denial. but acknowledges the favours in",
                " the depths of his heart, commits an",
                " error occasionally because of human weakness, he",
                " shows repentance on it and tries to",
                " ovoid it. This saves him from being",
                " included among the deniers. Apart from this.",
                " aII other culprits are, in fact, beliers",
                " of Allah's blessings and deniers of His",
                " favours. That is why it has been",
                " said: \"When you will have been seized",
                " as culprits, then We shall see as",
                " to which of Our favours you deny.\"",
                " In Surah Takathur: 8 the same thing",
                " has been put thus: \"On that Day",
                " you will certainly be culled to account",
                " for the blessings you had been granted.\"",
                " That is, it will be asked: Had",
                " We granted you these blessings or not",
                " ? Then, what attitude did you adopt",
                " towards your Benefactor, and in what ways",
                " did you use His Blessings?\""
            ]
        },
        {
            "id": "[55:41]",
            "verse": "The criminals will be known by their marks, and they will be seized by the forelocks and the feet.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:42]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:43]",
            "verse": "This is Hell, which the criminals deny.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:44]",
            "verse": "They will go around between it and scalding water, heated [to the utmost degree].",
            "description": [
                "That is, \"In Hell they will feel",
                " oppressed with thirst again and again. and",
                " will rush towards the springs of water,",
                " but will find only boiling water, which",
                " will not satisfy their thirst, and they",
                " will thus continue to wander to and",
                " fro between Hell and the springs for",
                " ever and ever. \""
            ]
        },
        {
            "id": "[55:45]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "That is, \"Will you even at that",
                " time be able to deny that God",
                " can bring about Resurrection, can give you",
                " another life after death, can call you",
                " to account, and can also make this",
                " Hell in which you are suffering punisment",
                " today?\""
            ]
        },
        {
            "id": "[55:46]",
            "verse": "But for he who has feared the position of his Lord are two gardens -",
            "description": [
                "'Who dreads... Lord\": who fears God in",
                " whatever he dces in the world, and",
                " dreads his accountability before Him in the",
                " Hereafter. Whoever holds this belief will inevitably",
                " avoid serving the lusts of his self,",
                " will avoid following every path blindly, will",
                " distinguish between the truth and falsehood, justice",
                " and injustice, pure and impure, and the",
                " lawful and the unlawful, and will not",
                " turn away deliberately from following the Commands",
                " of God. This is the real ground",
                " for the reward that is being mentioned",
                " below.",
                "*41) Jannat actually means a garden.",
                " At sane places in the Qur'an the",
                " entire world in which the righteous people",
                " will be kept, has boon called Jannat,",
                " as though the whole of it WAS",
                " a garden. And at others it has",
                " been said that they will have Jannat",
                " (Gardens) under which canals will be flowing.",
                " This means that that big Garden will",
                " comprise countless other gardens; and here precisely",
                " it has been stated that every pious",
                " man will be given two gardens in",
                " that big Garden, which will be particularly",
                " meant for him; it will have his",
                " own palaces in which he will live",
                " with his family and attendants like a",
                " king, and in it he will be",
                " provided with aII that is being mentioned",
                " below."
            ]
        },
        {
            "id": "[55:47]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                "From here till the end, the word",
                " alaa ' has been used both for",
                " the blessings and forthe powers, and there",
                " is an aspect of the praiseworthy qualities",
                " too. in it. If we take the",
                " first meaning, the meaning of repeating the",
                " refrain in this context will be: \"If",
                " you like to deny the blessings of",
                " AIIah, you may do so. The righteous",
                " will certainly receive these blessings from their",
                " Lord.\" In the second case the meaning",
                " would be: \"If you think it is",
                " impossible for AIIah to create the Garden",
                " and bless His righteous servants with these",
                " bounties in it, you may think so.",
                " AIIah certainly lass the power to do",
                " this work and He will surely accomplish",
                " it.\" According to the third meaning, it",
                " means: \"You think that after having created",
                " this big world Allah now doesn't bother",
                " whether a person behaves unjustly here or",
                " justly. works to promote the truth or",
                " falsehood, spreads evil or good: He will",
                " neither punish the oppressor nor redress the",
                " grievances of the oppressed, will neither appreciate",
                " good nor abhor evil. Then, as you",
                " think, He is helpless too. He can",
                " build the heavens and the earth but",
                " cannot prepare Hell for punishing the wicked",
                " and cannot make Heaven for rewarding the",
                " followers of the Truth. Thus. you may",
                " deny His praiseworthy attributes as you may,",
                " but tomorrow when He hurls the evildoers",
                " into Hell and blesses the worshippers of",
                " the trnth in Heaven. will you even",
                " then be able to deny His these",
                " attributes?\""
            ]
        },
        {
            "id": "[55:48]",
            "verse": "Having [spreading] branches.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:49]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:50]",
            "verse": "In both of them are two springs, flowing.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:51]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:52]",
            "verse": "In both of them are of every fruit, two kinds.",
            "description": [
                "This can have two meanings: (1) \"The",
                " fruits of the two gardens will have",
                " their own special flavors and tastes. In",
                " one garden he will find one kind",
                " of the fatir clustering on its branches,",
                " and in the other, another kind.\" (2)",
                " 'In each garden there will be two",
                " kinds of fruit; one kind of the",
                " familiar fath known and tasted in the",
                " world, though much superior to that found",
                " in the world, and the other kind",
                " of the rare fruit never imagined and",
                " tasted before.\""
            ]
        },
        {
            "id": "[55:53]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:54]",
            "verse": "[They are] reclining on beds whose linings are of silk brocade, and the fruit of the two gardens is hanging low.",
            "description": [
                "That is, \"When their lining will be",
                " of such superior quality, you may magine",
                " what will be the quality of the",
                " outer layer of the carpets.\""
            ]
        },
        {
            "id": "[55:55]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:56]",
            "verse": "In them are women limiting [their] glances, untouched before them by man or jinni -",
            "description": [
                "This is the real character of the",
                " woman: she should neither be shameless nor",
                " immodest, but should have modesty in her",
                " looks. That is why AIIah while making",
                " a mention of women among the blessings",
                " ofParadise has first of aII praised their",
                " modesty and chastity and not their beauty",
                " and physical charms. Beautiful women can get",
                " together in mixed clubs and film studios",
                " and beauty contests where the select beautiful",
                " women onlv are admitted. but a person",
                " of low taste and mentality only can",
                " show any interest in them. No noble",
                " person can find any charm in the",
                " beauty that attracts every evil look and",
                " is ready to tall in every lap!",
                "",
                "*46) This means that in the worldly",
                " life whether a woman died a spinster.",
                " or as the wife of somebody. or",
                " died young, or as an old woman,",
                " in the Hereafter when aII the righteous",
                " women enter Paradise, they will be made",
                " young and virgins: and any of the",
                " women who is made a lift-partner of",
                " a righteous man, will not have heen",
                " possessed by anyone before that husband, in",
                " Paradise. This verse also shows that the",
                " righteous jinn too will enter Paradise like",
                " the righteus men. Men will havc women",
                " from their own kind and the jinn",
                " their wives from their own kind: both",
                " the kinds will have their mates from",
                " their own particular kind. No person of",
                " one kind will be made a partner",
                " of a member of :mother kind with",
                " whom he cannot live as husband or",
                " wife naturally. The words of the verse",
                " \"...whom neither man nor jinn will havc",
                " touched before them,\" do not mean that",
                " the women there will only be of",
                " human species and they will not havc",
                " heen touched by any man or jinn",
                " before their husbands, but its real meaning",
                " is: In Paradise there will be women",
                " of both the jinn and the human",
                " species; they aII will he modest and",
                " untouched: neither a jinn female will have",
                " been touched by a jinn male before",
                " her husband in Paradise, nor a human",
                " female will have been touched by a",
                " human male before her husband in Paradise.",
                ""
            ]
        },
        {
            "id": "[55:57]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:58]",
            "verse": "As if they were rubies and coral.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:59]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:60]",
            "verse": "Is the reward for good [anything] but good?",
            "description": [
                "That is, \"How, after aII, is it",
                " possible that AIIah should allow to go",
                " waste the sacrifices of those righteous servants",
                " and should deny them their rewards, who",
                " kept themselves subjected to restrictions throughout their",
                " lives for the sake of AIIah, who",
                " avoided the unlawfirl and remained content with",
                " the lawful, who performed their duties faithfully",
                " and sincerely, rendered the rights of those",
                " to whom rights were due, and endured",
                " hardships against evil and upheld good ?",
                ""
            ]
        },
        {
            "id": "[55:61]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                "Obviously, the parson who is a denier",
                " of Paradise and its rewards, actually denies",
                " many of AIIah Almighty's praiseworthy attributes. Even",
                " if he believes in Allah, he holds",
                " a bad opinion about Him In his",
                " view He is a perverse ruler in",
                " whose lawless kingdom doing good is an",
                " exercise in futility. He is either blind",
                " and deaf and is, therefore, wholly unaware",
                " as to who in his kingdom is",
                " making sacrifices of life, wealth and labour",
                " for His sake; or He is un-appreciative",
                " and cannot distinguish between good and evil;",
                " or. as he scents to think. He",
                " is helpless and powerless: He may be",
                " very appreciative of the good but is",
                " unable to reward the doer of it.",
                " That is why u has been said:",
                " 'When in the Hereafter good will be",
                " rewarded with good in front of your",
                " very eyes. will you even then disavow",
                " the praiseworthy attributes of your Lord?\""
            ]
        },
        {
            "id": "[55:62]",
            "verse": "And below them both [in excellence] are two [other] gardens -",
            "description": [
                "The word dun as used in min",
                " dun-i-hima Jannatan. is employed in three different",
                " meanings in Arabic (1) To be situated",
                " at a lower level than another thing;",
                " (2) to be inferior to something of",
                " better and nobler quality; and (3) to",
                " be over and above something else. On",
                " account of this difference in meaning, one",
                " probable meaning of these words is that",
                " every dweller of Paradise will be given",
                " two more gardens besides the two previously",
                " mentioned; another probable meaning is that these",
                " two gardens will be inferior in quality",
                " and rank to both the tirst mentioned",
                " gardens: that is, the tirst two gardens",
                " will either be situated at a higher",
                " Ievel than these two, or the tirst",
                " two gardens will be of a superior",
                " kind and these two of an inferior",
                " kind as compared to them. If the",
                " first probability is adopted, it would mean",
                " that these two additional gardens also will",
                " be for those dwellers of Paradise, who",
                " have been mentioned above, And in case",
                " the second probability is adopted, the meaning",
                " would be that the first two gardens",
                " will be for 'those nearest to Allah\",",
                " and these two for \"the people of",
                " the right hand.\" This second probability is",
                " strengthened by the two kinds of the",
                " righteous inert as mentioned in Surah AI-Waqi'ah.",
                " First, the foremost, who have also been",
                " called the \"muqarrabun \"; second, the people",
                " of the right hand, who havc also",
                " been entitled \"ashab al-maimanah \"; and for",
                " both these separate qualities of the two",
                " kinds of the gardens have been mentioned.",
                " Furthermore, this probability is also strengthened by",
                " the Hadith which Abu Bakr has related",
                " on the authority of his father, Hadrat",
                " Abu Musa al-Ash'ari, In this he says:",
                " The Holy Prophet said: 'Two jannats (gardens)",
                " will be for the foremost among the",
                " righteous (or the muqarrabin), in which the",
                " utensils and articles of decoration will be",
                " of gold, and two jannats for the",
                " followers (or the ashab al gamin), in",
                " which everything will be of silver,\" (Fath",
                " al-Bari, Kitab at-Tafsir: Surah Ar-Rahman)."
            ]
        },
        {
            "id": "[55:63]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:64]",
            "verse": "Dark green [in color].",
            "description": [
                "The word madhammatan has been used in",
                " praise of these gardens. Mudhamma is such",
                " luxuriant vegetation which because of its extreme",
                " luxuriance assumes a darkish hue."
            ]
        },
        {
            "id": "[55:65]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:66]",
            "verse": "In both of them are two springs, spouting.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:67]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:68]",
            "verse": "In both of them are fruit and palm trees and pomegranates.",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:69]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:70]",
            "verse": "In them are good and beautiful women -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:71]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:72]",
            "verse": "Fair ones reserved in pavilions -",
            "description": [
                "For the explanation of her see E.",
                " N's 28, 29 of Surah As-Saaffat and",
                " E.N. 42 of Surah Ad-Dukhan the tents",
                " probably will be similar to those pitched",
                " for the nobles and rich people in",
                " the public parks. Most probably the wives",
                " of the dwellers of Paradise will live",
                " with them in their palaces and in",
                " their parks there will be tents pitched",
                " here and there in which there will",
                " be the houris to entertain them. Our",
                " this presumption is based on this that",
                " in the foregoing verses beautiful and chase",
                " wives havc been mentioned; now, here, mention",
                " of the houris signifies that they will",
                " be a different kind of women from",
                " the wives. This presumption is further strengthened",
                " by the Hadith which Hadrat Umm Salamah",
                " has reported. She says: 'I asked: O",
                " messenger of AIIah, who are better: the",
                " women of the world or the houris!",
                " The Holy Prophet replied: The women of",
                " the world are superior to the houris",
                " in the same way as the outer",
                " layer of a garment is superior to",
                " its lining. I asked: On what grounds",
                " ? he replied: On the ground that",
                " the women have offered their Prayers, observed",
                " their Fasts, and performed other devotions.\" (Tabarani).",
                " This shows that the wives of the",
                " dwellers of Paradise will be the women",
                " who affirmed the faith in the world",
                " and left the world while they practised",
                " good and right. They will enter Paradise",
                " in consequence of their faith and good",
                " deeds, and will deserve the blessings of",
                " Paradise on merit. They would either become",
                " the wives of their previous husbands of",
                " their own free will and choice. if",
                " they too happened to be dwellers of",
                " Paradise, or AIIah will wed them to",
                " some other dweller of Paradise, if the",
                " two would like to live together as",
                " husband and wife. As for the houris",
                " they will not be entitled to dwell",
                " in Paradise as a result of any",
                " righteous deed of their own, but AIIah",
                " will create them as young, beautiful women",
                " and bestow them also as a blessing",
                " among the other blessings on the dwellers",
                " of Paradise so that they may enjoy",
                " their companionship. But they will not in",
                " any case be creatures of the kind",
                " of the jinn and fairies, for man",
                " cannot cohabit with a kind other than",
                " his own. Therefore, most probably these would",
                " be those innocent girls who died immature,",
                " and whose parents did not deserve Paradise",
                " so that they could be admitted to",
                " Paradise with them as the children of",
                " their righteous torrents."
            ]
        },
        {
            "id": "[55:73]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:74]",
            "verse": "Untouched before them by man or jinni -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:75]",
            "verse": "So which of the favors of your Lord would you deny? -",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:76]",
            "verse": "Reclining on green cushions and beautiful fine carpets.",
            "description": [
                "The word abqari in the original is",
                " from abqar. the capital city of the",
                " jinn in the legends of the pre-Islamic",
                " Arabia. It was on that account that",
                " the Arabs called every fine and rare",
                " thing abqari as if it belonged to",
                " the fairyland and had no match in",
                " the material world. So mach so that",
                " in their idiom the man who possessed",
                " extraordinary abilities and who performed wonderful works",
                " was also called abqari The English word",
                " genius also is spoken in the same",
                " sense and is also derived from genii",
                " which is a synonym of jinn. That",
                " is why the word abqari; has been",
                " used here to give an idea of",
                " the extraordinary exquisiteness of the provisions of",
                " Paradise to the Arabs."
            ]
        },
        {
            "id": "[55:77]",
            "verse": "So which of the favors of your Lord would you deny?",
            "description": [
                ""
            ]
        },
        {
            "id": "[55:78]",
            "verse": "Blessed is the name of your Lord, Owner of Majesty and Honor.",
            "description": [
                ""
            ]
        }
    ]
}