{
    "name": "Al-Hadid",
    "id": 57,
    "verse-count": 29,
    "verse-info": [
        {
            "verse-id": "[57:1]",
            "verse": "Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise.",
            "description": [
                "'That is, \"It has always been so",
                " that everything in the universe has proclaimed",
                " the truth that its Creator and Sustainer",
                " is free from every blemish and defect,",
                " every weakness, error and evil. He is",
                " glorified in His essence, He is glorified",
                " in His attributes, He is glorified in",
                " His works as well as His commands",
                " whether they relate to the creation, or",
                " to the religious law for mankind. Here",
                " sabbaha has been used in the past",
                " tense; at other places yusabbihu has been",
                " used which includes both the present and",
                " the future tenses. This would signify that",
                " every particle in the universe has always",
                " been extolling the glory of its Creator",
                " and Sustainer in the past, is doing",
                " 60 at present and will continue to",
                " do the same in the future for",
                " ever and ever.\"",
                "*2) That is, not",
                " only is He All-Mighty and All-Wist, but",
                " the truth is that He afoot is",
                " AII-Mighty and All-Wise. The word 'Aziz signifies",
                " a mighty and powerful Being Whose decrees",
                " cannot be prevented by any power in",
                " the world from being enforced, Whom no",
                " one can oppose and resist, Who has",
                " to be obeyed by every one whether",
                " one likes it or not, Whose rebel",
                " cannot escape His accountability and punishment in",
                " any way; and Hakim signifies that whatever",
                " He does He does it wisely. His",
                " creation, His administration and rule, His commands",
                " and guidance, all are based on wisdom.",
                " None of His works is tarnished by",
                " any tract of folly or ignorance.",
                "There",
                " is another fine point here, which one",
                " should fully understand. Seldom in the Qur'an",
                " has Allah's attribute of `Aziz (AII-Mighty) been",
                " accompanied by His attributes of being Qawi",
                " (Strong), Mugtadir(Powerful), Jabber (Omnipotent), Dhuntiqam (Avenger) and",
                " the like, which only signify His absolute",
                " power, and this has been so only",
                " in places where the context demanded that",
                " the wicked and disobedient be warned of",
                " Allah's relentless punishment. Apart from such few",
                " places, wherever the word 'Aziz has been",
                " used for Allah, it has everywhere been",
                " accompanied by one Or other of His",
                " attributes of being Hakim (Wise), Alim (Knower),",
                " Rahim (Merciful), Ghafur (Forgiving), Wahhab (Generous) and",
                " Hamid (Praiseworthy). The reason is that if",
                " a being who wields un-limited power is",
                " at the same time foolish, ignorant, un-forgiving",
                " as well as stingy and devoid of",
                " character, its power and authority cannot but",
                " lead to injustice and wickedness Thus, wherever",
                " injustice and wickedness is being committed in",
                " the world, it is only because the",
                " one who wields authority over Others, is",
                " either using his power un-wisely and foolishly,",
                " or he is merciless and hardhearted, or",
                " evil-minded and wicked. Wherever power is coupled",
                " with these evil traits of character, no",
                " good can be expected to result. That",
                " is why in the Holy Qur'an Allah's",
                " attribute of `Aziz has necessarily been accompanied",
                " by His attributes of being All-Wise and",
                " Knowing, Compassionate and Forgiving, Praiseworthy and Generous,",
                " so that man may know that the",
                " God Who is ruling this universe has,",
                " on the' one hand, such absolute power",
                " that no one, from the earth to",
                " the heavens, can prevent His decrees from",
                " being enforced, but, on the other, He",
                " is also AlI-Wise: His each decision is",
                " based on perfect wisdom; He is also",
                " AII-Knowing whatever decision He makes, it precisely",
                " according to knowledge; He is also Compassionate:",
                " He does not use infinite power mercilessly;",
                " He is Forgiving as well: He does",
                " not punish His creatures for trifling faults,",
                " but overlooks their errors; He is also",
                " Generous: He does not treat His subjects",
                " stingily, but liberally and benevolently; and He",
                " is also Praiseworthy: He combines in Himself",
                " all praiseworthy virtues and excellences.",
                "The full",
                " importance of this statement of the Qur'an",
                " can be better understood by those people",
                " who are aware of the discussions of",
                " the philosophy of politics and law on",
                " the question of sovereignty. Sovereignty connotes that",
                " the one who possesses it should wield",
                " un-limited power: there should be no internal",
                " and external power to change or modify",
                " his decision or prevent it from being",
                " enforced, and none should have any alternative",
                " but to obey him. At the mere",
                " concept of this infinite and un-limited power,",
                " man's common-sense necessarily demands that whoever attains",
                " to such power, should be faultless and",
                " perfect in knowledge and wisdom, for if",
                " the one holding this power is ignorant,",
                " merciless and evil, his sovereignty will inevitably",
                " lead to wickedness and corurption. That is",
                " why the philosophers who regarded a single",
                " man, or a man-made institution, or an",
                " assembly of men as the holder of",
                " this power, have had to presume that",
                " he or it would be infallible. But",
                " obviously, neither can un limited sovereignty be",
                " actually attained by a human power, nor",
                " is it possible for a king, or",
                " a parliament, or a nation, or a",
                " party that it may use the sovereignty",
                " attained by it in a limited circle",
                " faultlessly and harmlessly. The reason is that",
                " the wisdom that is wholly free of",
                " every trace of folly, and the knowledge",
                " that fully comprehends all the related truths,",
                " is not at all possessed even by",
                " entire mankind, not to speak of its",
                " being attain d by an individual, or",
                " an institution, or a nation. Likewise, as",
                " long as man is man, his being",
                " wholly free of and above selfishness, sensuality,",
                " fear, greed, desires, prejudice and sentimental love,",
                " anger and hate is also not possible.",
                " If a person ponders over these truths,",
                " he will realize that the Qur'an is",
                " indeed presenting here a correct and perfect",
                " view of sovereignty. It says that no",
                " one except Allah in this universe is",
                " possessor of absolute power, and with this",
                " unlimited power He alone is faultless, All-Wise",
                " and All-Knowing, Compassionate and Forgiving, and Praiseworthy",
                " and Generous in His dealings with Hid",
                " subjects."
            ]
        },
        {
            "verse-id": "[57:2]",
            "verse": "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[57:3]",
            "verse": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
            "description": [
                "That is, \"When there was nothing, He",
                " was, and when there will be nothing,",
                " He will be. He is the most",
                " Manifest of all the manifest, for whatever",
                " manifests itself in the world, does 50",
                " only by His attributes and His works",
                " and His light. And He is the",
                " Most Hidden of all the hidden, for",
                " not only do the senses fail to",
                " percieve Him but the intellect and thought",
                " and imagination also cannot attain to His",
                " essence and reality. The best commentary in",
                " this regard are the words of a",
                " supplication of the Holy Prophet (upon whom",
                " be Allah's peace and blessings). which Imam",
                " Ahmad, Muslim, Tirmidhi, and Baihaqi have related",
                " on the authority of Hadrat Abu Hurairah,",
                " and Hafiz Abu Ya'la Mosuli in his",
                " Musnad on the authority of Hadrat 'A'ishah:",
                "",
                "\"Antal Awwal, fa-laisa qablaka shai'in; wa Antal",
                " Akhir fa-laisa ba 'daka shai 'in; wa",
                " Antal Zahir, fa-laisa fauqaka shai in; wa",
                " Anfal Batin, fa laisa dunaka shai'in. \"",
                " \"You alone are the First; none is",
                " before You; You alone are the Last:",
                " none is after You; You alone are",
                " the Exalted none is above You; You",
                " alone are the Hidden: none is more",
                " hidden than You. \"",
                "Here, the question",
                " arises: How does this accord with the",
                " immortality and eternal life of the dwellrs",
                " of Paradise and Hell mentioned in the",
                " Qur'an when Allah alone is the Last",
                " and Eternal? Its answer has been provided",
                " by the Qur'an itself: \"Everything is perishable",
                " except Allah Himself.\" (AI-Qasas: 88). In other",
                " words no creature is immortal in its",
                " personal capacity; if a thing exists or",
                " continuos to exist, it does so because",
                " Allah keeps it so, and can exist",
                " only by His letting it exist; otherwise",
                " in its own capacity everything is perishable",
                " except Allah, Immortality in Heaven and Hell",
                " will not be bestowed upon somebody because",
                " he is immortal by himself, but because",
                " AIIah will grant him eternal life. The",
                " same is true of the angels: they",
                " are not immortal by themselves. When Allah",
                " willed they came into existence, and will",
                " continue to exist only as long as",
                " Her wills."
            ]
        },
        {
            "verse-id": "[57:4]",
            "verse": "It is He who created the heavens and earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you wherever you are. And Allah, of what you do, is Seeing.",
            "description": [
                "That is, He alone is the Creator",
                " of the universe as well as Its",
                " Ruler. (For further explanation, see E.N.'s 41,",
                " 42 of AI-A'raf, E.N.4 of Yunus, E.N.'s",
                " 2 to 5 of Ar-Ra'd, E.N,'s 11",
                " to 15 of Ha Mim As-Sajdah).",
                "*5)",
                " In other words, He is not only",
                " the Knower of the wholes but also",
                " of the parts. He knows each seed",
                " that goes under the layers of the",
                " soil, each leaf and bud that comes",
                " out of the soil, each rain-drop that",
                " falls from the sky, and each molecule",
                " of the vapour that ascends from the",
                " seas and lakes to the sky. He",
                " is aware of every seed Iying anywhere",
                " under the soil. That is how He",
                " causes it to split and sprout up",
                " and develop. He Is aware of how",
                " much vapour has risen from each different",
                " place and where it has reached. That",
                " is how he collects it into cloud",
                " and distributes it and causes it to",
                " fall as rain in due measure on",
                " different place of the earth. The same",
                " is true of the details of everything",
                " that goes into the earth and comes",
                " out of it, and of everything that",
                " ascends to the sky and descends from",
                " it. If aII this were not comprehended",
                " by Allah in His knowledge, it would",
                " not be possible for Him to plan",
                " and order each thing separately and to",
                " regulate and control it in a wise",
                " manner.",
                "*6) That is, \"Nowhere are you",
                " outside Allah's knowledge, His power, His rule,",
                " His management and administration. Allah knows wherever",
                " you are, whether in the earth, or",
                " the air, or the water, or in",
                " a secret place. Your being alive there",
                " is by itself a proof that Allah",
                " is providing for you in that very",
                " place. If yow heart is beating, if",
                " your lungs are breathing, if yow hearing",
                " and yow sight arc functioning, it is",
                " only because all parts of yow body",
                " are working under Allah's rule. And if",
                " death comes to you at any place;",
                " it comes because Allah takes a decision",
                " to stop providing for you and to",
                " recall you from the world.\""
            ]
        },
        {
            "verse-id": "[57:5]",
            "verse": "His is the dominion of the heavens and earth. And to Allah are returned [all] matters.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[57:6]",
            "verse": "He causes the night to enter the day and causes the day to enter the night, and he is Knowing of that within the breasts.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[57:7]",
            "verse": "Believe in Allah and His Messenger and spend out of that in which He has made you successors. For those who have believed among you and spent, there will be a great reward.",
            "description": [
                "The addressees here are not the non-Muslims,",
                " but, as is borne out by the",
                " whole subsequent discourse, the Muslims who had",
                " affirmed the Faith and joined the ranks",
                " of the believers, but were not fulfilling",
                " the demands of the Faith and conducting",
                " themselves as true believers should. It is",
                " obvious that non-Muslims cannot be invited to",
                " affirm the Faith and then immediately asked",
                " to subscribe generously to the cause of",
                " Jihad for the sake of Allah, nor",
                " can they be told that whoever would",
                " fight and spend his wealth in the",
                " cause of Allah before the victory, would",
                " attain to a higher rank than him",
                " who would perform these services later, For,",
                " when a non-Muslim is invited to the",
                " Faith, the preliminary demands of it only",
                " are presented before him and not the-ultimate",
                " once, Therefore,. in view of the context,",
                " the meaning of saying \"Believe in Allah",
                " and His messenger\" here would be: \"O",
                " people, who profess to have affirmed the",
                " Faith and have joined the ranks of",
                " the Muslims,. believe in Allah and Messenger",
                " sincerely and conduct yourselves as the true",
                " and sincere believers should. \"",
                "*8) Here,",
                " by spending is not implied spending on",
                " public welfare, but, as is clearly borne",
                " out by the words of verse 10,",
                " it implies subscribing to the cause of",
                " the war effort that was being waged",
                " at that time under the leadership of",
                " the Holy Prophet (upon whom be Allah's",
                " peace and blessings) to uphold Islam against",
                " paganism. Two things, in particular, were such",
                " for which the Islamic Government at that",
                " time stood in great need of financial",
                " help. First, the war equipment; second, supporting",
                " and sustaining the oppressed Muslims, who, due",
                " to persecution by the disbelievers had emigrated,",
                " and were still emigrating, to Madinah from",
                " every corner of Arabia, The sincere Muslims",
                " were trying their best to render as",
                " much help as they could but meeting",
                " the entire expenses in this regard was",
                " much beyond their means and resources, and",
                " their this same spirit of sacrifice has",
                " been commended in vv. 10, 12, 18",
                " and 19 below. But among the Muslims",
                " there were quite a number of well-to-do",
                " people, who were watching this struggle between",
                " Islam and paganism as mere spectators and",
                " had no feeling whatever that the faith",
                " they claimed to believe in imposed certain",
                " rights also on their life and wealth.",
                " This second kind of people are the",
                " addressees of this verse, They have been",
                " exhorted to believe sincerely, and to spend",
                " their wealth in the cause of Allah.",
                "",
                "*9) This has two meanings and both",
                " are implied here. The first meaning is",
                " \"The wealth that you possess is not,",
                " in fact, your personal property but has",
                " been givers to you by Allah. You",
                " are not its exclusive master and owner.",
                " Allah has given you proprietary right over",
                " it as His vicegerent. Therefore, you should",
                " have no hesitation in spending it in",
                " the service of the real Master. It",
                " is not for the vicegerent to withhold",
                " the Master's wealth from being spent for",
                " the Master's own sake..\" The second: \"Neither",
                " bas this wealth been with you since",
                " ever nor will it remain in your",
                " possession for ever, Yesterday it was in",
                " some other people's possession; then Allah made",
                " you their successor and entrusted it to",
                " you, A time will come when it",
                " will not remain with you but some",
                " other people will succeed you as its",
                " owners, Therefore, in this short-lived ownership, when",
                " you are its trustees, spend it in",
                " the cause of AIlah so that in",
                " the Hereafter You may be rewarded for",
                " it permanently and eternally. This same thing",
                " has been stated by the Holy Prophet",
                " (upon whom be Allah's peace) in a",
                " Hadith. Tirmidhi relates that once a goat",
                " was slaughtered in the Holy Prophet's house",
                " and its flesh was given away to",
                " the poor. When he came to the",
                " house and asked: \"What remains of the",
                " goat?\" Hadrat `A'ishah replied: \"Nothing but a",
                " shoulder.\" Thereupon the Holy Prophet remarked: \"Nay,",
                " the whole goat but the shoulder !\"",
                " That is, \"Whatever has been given away",
                " for the sake of Allah, has, in",
                " fact, been saved. \" According to another",
                " Hadith, a person asked: \"O Messenger of",
                " Allah, what kind of charity brings the",
                " highest reward? He replied: That you should",
                " give away a thing In charity when",
                " you are hale and hearty: when you",
                " feel it could be saved and may",
                " like to invest it in the hope",
                " of earning more. Do not wait till",
                " death when you may say: Give this",
                " to so and so and that to",
                " so and so, for at that time",
                " the wealth has in any case to",
                " pass on to so and so. \"(Bukhari,",
                " Muslim). According to still another Hadith, the",
                " Holy Prophet said: \"Man says: `My wealth!",
                " My wealth!' whereas his own share in",
                " his wealth is no more than what",
                " he has eaten up, or worn away,",
                " or passed on in charity? Whatever remains",
                " will leave him and will be passed",
                " on to others. \" (Muslim)",
                "*10) Here",
                " again, expending wealth in the cause of",
                " Jihad has been regarded as an essential",
                " demand of the Faith and a proof",
                " of one's sincerity in it, as if",
                " to say: \"The true and sincere believer",
                " is he who does not shirk spending",
                " wealth on such an occasion.\""
            ]
        },
        {
            "verse-id": "[57:8]",
            "verse": "And why do you not believe in Allah while the Messenger invites you to believe in your Lord and He has taken your covenant, if you should [truly] be believers?",
            "description": [
                "That is, \"You are adopting this unbelieving",
                " attitude and conduct at a time when",
                " the Messenger of Allah is present among",
                " you, and you are receiving the invitation",
                " to the Faith not through an indirect",
                " and remote means but directly through the",
                " Messenger of Allah himself.\"",
                "*12) Some commentators",
                " have taken this pledge to imply the",
                " pledge of service to Allah, which had",
                " been taken at the beginning of creation",
                " from the future offspring of Adam (peace",
                " be upon him), and some others take",
                " it for the pledge with which man",
                " has been naturally endowed to serve and",
                " obey Allah. But the trnth is that",
                " it implies the conscious pledge of obedience",
                " to Allah and His Messenger that every",
                " Muslim makes to his Lord by the",
                " affirmation of the Faith At another place",
                " in the Qur'an this same pledge has",
                " been referred to thus;",
                "\"Keep in mind",
                " the blessing Allah has bestowed upon you",
                " and do not forget the solemn covenant",
                " which He made with you (and which",
                " you confirmed), when you said: `We have",
                " heard and submitted.' Fear Allah for Allah",
                " knows the very secrets of the hearts,\"",
                " (AI-Ma'idah: 7)",
                "Hadrat `Ubadah bin Samit relates:",
                " \"The Holy Messenger of Allah (upon whom",
                " be His peace and blessings) had made",
                " us pledge that we would listen and",
                " obey both in sound health and in",
                " ill health; would spend in the cause",
                " of Allah both in prosperity and in",
                " adversity would enjoin the good and forbid",
                " the evil; would proclaim the truth for",
                " the sake of Allah and would not",
                " fear the blame of any one in",
                " this regard.\" (Musnad Ahmad)"
            ]
        },
        {
            "verse-id": "[57:9]",
            "verse": "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allah is to you Kind and Merciful.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[57:10]",
            "verse": "And why do you not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allah has promised the best [reward]. And Allah, with what you do, is Acquainted.",
            "description": [
                "This has two meanings: (1) \"Your wealth",
                " is not going to stay with you",
                " for ever. One day you will leave",
                " it behind; then Allah alone will inherit",
                " it. Thus the best thing would be",
                " that you should spend it yourself in",
                " the cause of Allah so that. your",
                " reward for it is guaranteed with Allah.",
                " If you do not spend it yourself,",
                " it will in any case return to",
                " Allah, but then you will not be",
                " entitled to any reward from Him. \"",
                " (2) \"You should have no fear of",
                " indigence and poverty when you spend it",
                " in the cause of Allah, because Allah",
                " for Whose sake you would spend your",
                " wealth, is the Owner of aII the",
                " treasures of the heavens and the earth.",
                " He possessed not only what He has",
                " bestowed on you today but has much",
                " more to bestow on you tomorrow. \"",
                " This same thing bas been expressed at",
                " another place, thus",
                "\"O Prophet, say to",
                " there: `My Lord gives abundantly to whomever",
                " of His servants He wills and sparingly",
                " to whomever He wills. Whatever you spend,",
                " He replenishes it by other provisions: He",
                " is the best of Providers'.\" (Saba: 39)",
                "",
                "*14) That is, \"Although both are entitled",
                " to the reward, yet the former are",
                " necessarily higher in rank than the latter,",
                " for they faced greater risks for the",
                " sake of Allah in difficult circumstances, which",
                " the latter not. They spent their wealth",
                " at a time when there appeared no",
                " remote chance of victory that would compensate",
                " for their expenditure, and they fought the",
                " disbelieves at a critical tune when there",
                " was an ever present apprehension that the",
                " enemy might overpower and crush the followers",
                " of Islam completely.\" Mujahid, Qatadah and Zaid",
                " bin Aslam, from among the commentators, say",
                " that the word 'victory\" in this verso",
                " has been used for the Conquest of",
                " Makkah, and `Amir Sha'bi says that it",
                " refers to the Truce of Hudaibiyah. The",
                " former view has been adopted by most",
                " of the commentators, and in support of",
                " the latter this tradition from Hadrat Abu",
                " Sa'id Khudri is presented: \"During the time",
                " when the Truce of Hudaibiyah was concluded,",
                " the Holy Prophet (upon whom be Allah's",
                " peace) said to us: `In the near",
                " future there will appear the people, whose",
                " deeds will make you look upon your",
                " own deeds as mean and trifling, but",
                " even if one of them possessed a",
                " mountain of gold and he expended all",
                " of it in the cause of Allah,",
                " he would not attain to your spending",
                " two pounds, or even one pound of",
                " it.\" (Ibn Jarir, Ibn Abi Hatim, Ibn",
                " Marduyah, Abu Nu'aim Isfahani). Further. more, it",
                " is also supported by the ,Hadith which",
                " Imam Ahmad has related on the authority",
                " of Hadrat Anas. He says: \"Once a",
                " dispute arose between Hadrat Khalid bin Walid",
                " and Hadrat `Abdur Rahman bin `Auf, in",
                " the course of which Hadrat Khalid said",
                " w Hadrat `Abdur Rahman: \"You people assume",
                " your superiority over us on account of",
                " your past services. ` When this thing",
                " came to the Holy Prophet's notice, he",
                " said: `By God in whose hand is",
                " my lift, even if you people spent",
                " gold equal (in weight) to Mount Uhud,",
                " or equal to other mountains, you would",
                " not attain to the deeds of these",
                " people.\" From this it is argued that",
                " in this verse \"victory\" refers to the",
                " Truce of Hudaibiyah, for Hadrat Khalid bin",
                " Walid had embraced Islam after this Truce",
                " and had participated in the Conquest of",
                " Makkah. However, whether \"victory\" in this particular",
                " case is taken to imply the Truce",
                " of Hudaibiyah or the Conquest of Makkah,",
                " in any case the verse dces not",
                " mean that the distinction of the ranks",
                " is confined to this one victory alone,",
                " but as a general principle it shows",
                " that those who fight and spend in",
                " the cause of Islam at the time",
                " when disbelief and disbelievers appear to be",
                " dominant and Islam seems to have no",
                " remote chance of victory, are far superior",
                " in rank to those who make sacrifices",
                " after the conflict between Islam and paganism",
                " has been decided in favour of Islam.\"",
                "",
                "*15) That is, \"Allah dces not bestow",
                " His favours blindly. Ho sees who has",
                " performed what deeds, under what kind of",
                " circumstances, and with what motive and then",
                " determines the rank and the reward of",
                " the deed of each person with full",
                " justice and awareness,\""
            ]
        },
        {
            "verse-id": "[57:11]",
            "verse": "Who is it that would loan Allah a goodly loan so He will multiply it for him and he will have a noble reward?",
            "description": [
                "How Generous and Beneficent is Allah that",
                " if a man spends the wealth granted",
                " by Himself in His way, He calls",
                " it a loan Himself, provided that it",
                " is a good loan, that is, a",
                " loan which in given with a pure",
                " intention, without any selfish motive of winning",
                " reputation and renown, or of doing favour",
                " to somebody, but only for the sake",
                " of Allah's approval and to win His",
                " good-will and rewards. Allah makes two promises",
                " in this regard: (1) That He will",
                " repay it increasing it manifold; and (2)",
                " that He will also give from Himself",
                " the best reward for it.",
                "According to",
                " a Hadith reported by Hadrat `Abdullah bin",
                " Mas'ud, when this verse was revealed and",
                " the people heard it from the Holy",
                " Prophet (upon whom be Allah's peace), Hadrat",
                " Abud-Dahdah Ansari asked: \"O Messenger of Allah,",
                " dces Allah want a loan from us?",
                " The Holy Prophet replied: Yes, O Abud-Dahdah,.",
                " He said Kindly show me your hand.",
                " The Holy Prophet extended his hand towards",
                " him. He took his hand in his",
                " own hand and said: I give away",
                " my garden in loan to my Lord.\"",
                " Hadrat 'Abdullah bin Mas'ud says that the",
                " garden had 600 date-palms and his own",
                " house also in which his family lived-",
                " Saying this to the Holy Prophet (upon",
                " whom be Allah's peace) he went straight",
                " back home, and calling out to his",
                " wife said: \"Come out, O mother of",
                " Dahdah, I have loaned this garden to",
                " my Lord.\" She replied: \"Dahdah's father, you",
                " have made a, good bargain !' and",
                " she immediately vacated and left the garden",
                " with her effects and children.\" (Ibn Abi",
                " Hatim). This incident throws light on the",
                " conduct of the sincere believers of that",
                " time, and from this one can also",
                " understand the kind of the \"good loan\"",
                " that Allah has promised to return increasing",
                " it manifold with a rich reward in",
                " addition."
            ]
        },
        {
            "verse-id": "[57:12]",
            "verse": "On the Day you see the believing men and believing women, their light proceeding before them and on their right, [it will be said], \"Your good tidings today are [of] gardens beneath which rivers flow, wherein you will abide eternally.\" That is what is the great attainment.",
            "description": [
                "This and the following verses show that",
                " the Light on the Day of Judgement",
                " will be specifically meant for the righteous",
                " believers only. As for the disbelievers and",
                " the hypocrites and the wicked people, they",
                " will be wandering about in the darkness",
                " as they had been in the world.",
                " The light there will be the light",
                " of righteous deeds. The sincerity of the",
                " faith and the piety of the character",
                " and conduct will turn into light that",
                " will lend brightness to the personality of",
                " the virtuous. The brighter the deed the",
                " more luminous will be his person, and",
                " when he will walk towards Paradise, his",
                " light will be running forward before him.",
                " The best explanation of it is Qatadah's",
                " mursal tradition in which he says; \"The",
                " Holy Prophet (upon whom be Allah's peace",
                " and blessings) said: \"The light of some",
                " one will be so .strong and sharp",
                " that it will be running on before",
                " him equal to the distance between Madinah",
                " and `Aden, of another equal to the",
                " distance between Madinah and San'a, and of",
                " another even less than that; to much",
                " so that there will be a believer",
                " whose light will Dot extend beyond his",
                " steps.\" (Ibn Jarir). In other words, the",
                " intensity of the light of a person",
                " will be proportionate to the extent of",
                " the good done and spread by him",
                " in the world, and the beams of",
                " his light will be running on before",
                " him in the Hereafter extending as far",
                " as his good will have extended in",
                " the world.",
                "Here, a question may arise",
                " in the mind of the reader \"One",
                " can understand the meaning of their light",
                " running on before the believers but what",
                " does their light running on only on",
                " their right hand mean? Will there be",
                " darkness on their left side? The answer",
                " is: When a man is walking with",
                " a light on his right hand, his",
                " left side also will be bright, though",
                " the fact of the matter is that",
                " the light will be on his right",
                " hand. This has been explained by the",
                " Hadith, which Hadrat Abu Dharr and Abu",
                " Darda' have reported, saying that the Holy",
                " Prophet (upon whom be Allah's peace;) said:",
                " \"I shall recognize the righteous people of",
                " my Ummah by their light which will",
                " be running on before them and on",
                " their right and on their left.\" Hakim,",
                " Ibn Abi Hatim, Ibn Marduyah)."
            ]
        },
        {
            "verse-id": "[57:13]",
            "verse": "On the [same] Day the hypocrite men and hypocrite women will say to those who believed, \"Wait for us that we may acquire some of your light.\" It will be said, \"Go back behind you and seek light.\" And a wall will be placed between them with a door, its interior containing mercy, but on the outside of it is torment.",
            "description": [
                "It means that when the believers will",
                " be going towards Paradise, the light will",
                " be before them, and the hypocrites will",
                " be stumbling about in the darkness behind.",
                " At that time they will call out",
                " to the believers, who lived with than",
                " together in the same Muslim society in",
                " the world, saying: \"Look back towards us",
                " awhile so that we also may get",
                " some light.\"",
                "*19) This means that the",
                " people of Paradise will enter it awhile",
                " this gate and the gate will then",
                " be closed. On one side of the",
                " gate there will be the blessings of",
                " Paradise and on the other the torment",
                " of Hell. For the hypocrites it will",
                " not be possible to cross the barrier",
                " that will stand between them and Paradise.",
                ""
            ]
        },
        {
            "verse-id": "[57:14]",
            "verse": "The hypocrites will call to the believers, \"Were we not with you?\" They will say, \"Yes, but you afflicted yourselves and awaited [misfortune for us] and doubted, and wishful thinking deluded you until there came the command of Allah. And the Deceiver deceived you concerning Allah.",
            "description": [
                "That is, \"Did we not live with",
                " you together in the same Muslim society?",
                " Did we not affirm the Faith? Did",
                " we not offer the Prayers along with",
                " you and observe the Fast and perform",
                " the Hajj and pay the Zakat? Did",
                " we not sit with you in your",
                " assemblies and were we not bound in",
                " marriage ties and kinship with you? Then,",
                " how is it that we have been",
                " separated from you today?\"",
                "*21) That is",
                " In spite of yew claim to be",
                " Muslims, you never believed like true and",
                " ,sincere Muslims and remained suspended between belief",
                " and unbelief. You still had your interests",
                " attached to disbelief and the disbelievers and",
                " you never gave yourselves up wholly to",
                " Islam.\"",
                "*22) Tarabbus (from which tarabbastum of",
                " the Text is derived) means to wait",
                " and tarry for an opportunity. When a",
                " person is unable to decide which of",
                " the two alternative ways he should choose",
                " but stands and waits to consider which",
                " way should be more favorable for him",
                " to follow, he is involved in tarabbus.",
                " The hypocrites, had adopted the same attitude",
                " during the critical time of the conflict",
                " between Islam and un-Islam. Neither were they",
                " siding with disbelief openly nor were spending",
                " their energy to support and help Islam",
                " with full conviction. They were sitting on",
                " the fence, waiting to set which party",
                " in the conflict became dominant, so that",
                " if it was Islam they may join",
                " it on the basis of their affimlation",
                " of the faith, and if it was",
                " unbelief they may side -with its supporters",
                " taking advantage of their neutral position in",
                " the conflict.",
                "*23) This implies different kinds",
                " of doubts that a hypocrite suffers from,",
                " and the same also are the actual",
                " causes of his hypocrisy. He doubts the",
                " existence of God, the Prophethood of the",
                " Prophet, the Qur'an's being Allah's book, the",
                " Hereafter, its accountability, and its rewards and",
                " punishments, and he doubts whether the conflict",
                " between the Truth and falsehood is real,",
                " or a mere delusion; as for himself",
                " he considers the only truth to be",
                " that one should enjoy lift and its",
                " pleasures to the full, For unless a",
                " person is involved in such doubts he",
                " can never be a hypocrite.",
                "*24) This",
                " can have two meanings: (1) \"Until death",
                " came to him, you could not shed",
                " this delusion till the last moment\"; and",
                " (2) \"that Islam became dominant, while you",
                " looked on unconcerned.\"",
                "*25) That is, Satan.",
                ""
            ]
        },
        {
            "verse-id": "[57:15]",
            "verse": "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination.",
            "description": [
                "This clearly shows that in the Hereafter",
                " the hypocrites will be doomed to the",
                " same fate as the disbelievers.",
                "*27) The",
                " words hiya maula kum (Hell is your",
                " maula) can have two meanings: (1) \"That",
                " Hell is the only proper place for",
                " you\"; and (2) \"that you never took",
                " Allah as your maula (friend, patron) so",
                " that He may look after you; now",
                " Hell only is your maula; therefore, Hell",
                " now will look after you \""
            ]
        },
        {
            "verse-id": "[57:16]",
            "verse": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient.",
            "description": [
                "Here again, the word \"believers\" is general,",
                " but it dces not apply to alI",
                " the Muslims; it refers to those particular",
                " Muslims who had professed the faith verbally",
                " and joined the followers of the Holy",
                " Prophet (upon whom be Allah's peace) though",
                " their hearts were devoid of any concern",
                " for Islam. They were watching that the",
                " pagan forces were bent upon wiping out",
                " Islam; they had encircled the handful of",
                " Muslims from all sides, who were being",
                " made the target of persecution everywhere in",
                " Arabia, and thus oppressed the Muslims were",
                " fleeing to Madinah empty-handed for refuge; the",
                " sincere Muslims were extending to them whatever",
                " economic help they could; yet they were,",
                " at the same time, engaged in a",
                " life and-death struggle with the enemy. But,",
                " in spite of this, these people who",
                " professed the faith were not being moved",
                " at all. So, here, they are being",
                " put to shame. as if to say:",
                " \"What kind of believers are you? At",
                " this critical juncture for Islam, is it",
                " not yet time that your hearts should",
                " melt at the mention of AIlah and",
                " be filled with the spirit of sacrifice",
                " for the sake of His Religion? Can",
                " the believers be such that they may",
                " 'have no feeling for Islam when it",
                " is confronted with hard times, that they",
                " may sit un-concerned when they are summoned",
                " in the name of Allah, that the",
                " hearts may neither tremble out of fear",
                " of Allah nor bow to His Command",
                " when He Himself should make an appeal",
                " for contributions in the Book sent down",
                " by Him, declaring it as a loan",
                " on Himself and plainly telling that the",
                " one who would regard his wealth as",
                " dearer than the cause of the true",
                " Faith would be a hypocrite and not",
                " a believer?\"",
                "*29) That is, \"The Jews",
                " and Christians seem to have lost fervour",
                " and degenerated spiritually and morally hundreds of",
                " years after the passing away of their",
                " Prophets; but have you already become so",
                " depraved that while the Prophet is still",
                " present among you, and the Book of",
                " God is still being revealed, and not",
                " much time has passed over you since",
                " you affirmed the Faith, and you have",
                " started behaving like the Jews and Christians",
                " who have reached this state through centuries",
                " of playing and tempering with the Book",
                " of Allah and its verses?\""
            ]
        },
        {
            "verse-id": "[57:17]",
            "verse": "Know that Allah gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand.",
            "description": [
                "The point contained here should be well",
                " understood, At several places in the Qur'an",
                " the Prophethood and the revelation of the",
                " Book have been compared to the rainfall,",
                " for the effects produced by them on",
                " humanity are precisely like those produced by",
                " rain on the soil. Just as the",
                " dead earth swells and blooms as soon",
                " -as it receives a shower of rain,",
                " so it is with the dead humanity",
                " in a country where a Prophet is",
                " raised through Allah's mercy and Revelation begins",
                " to be sent down to him. It",
                " starts revealing those virtues which lay hidden",
                " and suppressed for ages; it starts manifesting",
                " from within itself excellent morals and good",
                " deeds and virtues of every kind. Allusion",
                " has been made to this truth here",
                " so as to open the eyes of",
                " the Muslims of the weak faith and",
                " to make them ponder their state. The",
                " way humanity was being reformed by the",
                " blessed rainfall of the Prophethood and Revelation",
                " and the way it was being richly",
                " and generously blessed in every way was",
                " not a remote story for them. They",
                " were observing it themselves in the pious",
                " and righteous society of the Companions and",
                " experiencing it day and night around them.",
                " Polytheism with alI its evils was present",
                " before them while the virtues and good",
                " things emanating from Islam also were blooming",
                " and flourishing before their eyes. Therefore, they",
                " did not need to be told any",
                " details. An allusion was enough to the",
                " effect, \"The signs of how Allah grants",
                " life to the dead earth through the",
                " rainfall of His mercy have been shown",
                " to you; now you should use your",
                " common sense and consider it for yourself",
                " as to what benefit you arc deriving",
                " from this blessing. \""
            ]
        },
        {
            "verse-id": "[57:18]",
            "verse": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward.",
            "description": [
                "Sadagah, as an Islamic term, is the",
                " charity given sincerely and with a pure",
                " intention only with a view to seek",
                " Allah's good pleasure without making any show",
                " of it, and without the intention of",
                " doing any favour to the recipient. The",
                " donor should give it only because he",
                " has a true feeling of the service",
                " of his Lord. The word is derived",
                " from sidq; therefore, sadaqat(sincerity) is of its",
                " essence. No charity and no expending of",
                " the wealth can be a sadaqah unless",
                " it springs from a sincere and pure",
                " motive of spending only for the sake",
                " of Allah."
            ]
        },
        {
            "verse-id": "[57:19]",
            "verse": "And those who have believed in Allah and His messengers - those are [in the ranks of] the supporters of truth and the martyrs, with their Lord. For them is their reward and their light. But those who have disbelieved and denied Our verses - those are the companions of Hellfire.",
            "description": [
                "Here, the believers imply those people of",
                " true faith whose attitude and conduct was",
                " absolutely different from that of the people",
                " of weak faith and the false claimants",
                " to Islam, and who were at that",
                " time vying with one another in making",
                " monetary sacrifices and were struggling with their",
                " lives in the cause of the true",
                " Faith.",
                "*33) Siddiq (most truthful) is the",
                " superlative from sidq; however, one should clearly",
                " understand that sidq Is not merely a",
                " statement conforming to the truth, but a",
                " statement which is not only true in",
                " itself but its Bayer also upholds it",
                " as a truth sincerely. For instance, if",
                " a person says that Muhammad (upon whom",
                " be Allah's peace and blessings) is Allah's",
                " Messenger, this is by itself precisely according",
                " to 'the truth for the Holy Prophet",
                " is truly Allah's Messenger, but the person",
                " would be true in his statement only",
                " if he also believed and upheld him",
                " as Allah's Messenger. Therefore, a thing would",
                " be sidq if what was said was",
                " in conformity with the truth as well",
                " as with the Bayer's own conscience. Likewise,",
                " sidq also contains the sense of faithfulness,",
                " sincerity and practical righteousness. Sadiq-ul-wa d would",
                " be the person who kept his promise",
                " practically, who never broke it. Sadiq (true",
                " friend) would be he who did full",
                " justice to friendship in the time of",
                " need, and who never proved faithless to",
                " any, body in any way. In war,",
                " sadiq fil-qital (true soldier) would be the",
                " one who fought with all his heart",
                " and body and established his valour practically.",
                " Thus, sidq in essence implies that one's",
                " deed should fully conform to one's word.",
                " The one who acts contrary to his",
                " word cannot be Sadiq. On that very",
                " basis, the one who preaches one thing",
                " and acts contrary to it, is regarded",
                " as a false preacher. With this meaning",
                " of sidq and sadiq in view one",
                " can fully appreciate the meaning of the",
                " superlative sadiq. It would inevitably imply a",
                " righteous person who is free from every",
                " impurity, who has never swerved from the",
                " truth and piety, who could never be",
                " expected to say anything against his conscience.",
                " who believed in whatever he believed with",
                " full sincerity and remained faithful to it",
                " under all circumstances, and who has practically",
                " proved that he is a true believer",
                " in the full sense of the word.",
                " (For further explanation, see E.N. 99 of",
                " An-Nisa).",
                "*34) The early commentators have differed",
                " about the explanation of this verse. Ibn",
                " 'Abbas, Masruq, Dahhak, Muqatil bin Hayyan and",
                " others say that the previous sentence ended",
                " with humsssiddiqun; and wash-shuhada'-u `inda Rabbihim la-hum",
                " ajru-hum wa nuru-hum is a separate and",
                " independent sentence According to this explanation, the",
                " translation of the sentence would be: \"Those",
                " who have believed in Allah and His",
                " Messenger, are indeed the most truthful (as",
                " siddiqun); as for the true witnesses (ash-shuhada",
                " ), they will have their reward and",
                " their light from their Lord. \" Contrary",
                " to this, Mujahid and several other commentators",
                " regard this whole expression as one sentence.",
                " According to them the translation would be",
                " that which we have given in the",
                " text above. The two commentaries differ because",
                " the first group has taken the word",
                " Shahid in the meaning of the martyr",
                " in the way of Allah. and seeing",
                " that every believer is not a shahid",
                " in this sense, has taken wash-shuhada'-u `inda",
                " Rabbi-him as a separate sentence. But the",
                " other group takes shahid in the meaning",
                " of the witness of the Truth, and",
                " not in the sense of the martyr,",
                " and in this sense every believer is",
                " a shahid. We are of the opinion",
                " that this second commentary is preferable and",
                " this is",
                "\"Thus have We made you",
                " a community of the 'Golden Mean' so",
                " that you may be witnesses in regard",
                " to mankind and the Messenger may be",
                " a witness in regard to you.\" (AI-Baqarah;",
                " 143).",
                "\"AIIah had called you \"Muslims\" before",
                " this ant has called you (by the",
                " same name) in this (Qur'an) also so",
                " that the Messenger may be a witness",
                " in regard to you and you may",
                " be witnesses in regard to the rest",
                " of mankind.\" (Al-Hajj: 78)",
                "In a Hadith,",
                " Hadrat Bara' bin 'Azib has related that",
                " he heard the Holy Prophet (upon whom",
                " be Allah's peace) say: 'The believers of",
                " my Ummah are shahid (the witnesses); then",
                " he recited this very verse of Surah",
                " AI-Hadid. \" (Ibn Jarir). Ibn Marduyah has",
                " related on the authority of Hadrat Abu",
                " ad-Darda' the tradition that the Holy Prophet",
                " (upon whom be Allah's peace) said: \"The",
                " one who emigrates from a land in",
                " order to save his life and his",
                " faith from temptation, is recorded as a",
                " Siddiq (most truthful), and when he dies,",
                " AIIah takes his soul as a shahid",
                " (true witness). Then aftar this, the Holy",
                " Prophet recited this very verse. \" (For",
                " 'the explanation of this meaning of shahadat,",
                " see E:N. 144 of AI-Baqarah, E.N 99",
                " of An-Nisa', E.N. 82 of Al-Ahzab).",
                "*35)",
                " That is, \"Each one of them will",
                " receive the reward and the light of",
                " the measure and degree he deserves. They",
                " will all get their own respective rewards",
                " and lights, and their shares have already",
                " been reserved for them,\""
            ]
        },
        {
            "verse-id": "[57:20]",
            "verse": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allah and approval. And what is the worldly life except the enjoyment of delusion.",
            "description": [
                "To understand this theme fully one should",
                " keep the following verses of the Qur'an",
                " in mind: Imran; 14- 15, Yunus: 24-25,",
                " ibrahim: 18, AI-Kahf: 45-46, An-Nur: 39. In",
                " aII those verses the truth that has",
                " been impressed on the mind is: The",
                " life of this world is a temporary",
                " life: its spring as well as its",
                " autumn is temporary, Them is much here",
                " to allure man. but this, in fact,",
                " consists of base and insignificant things which",
                " man because of his shallowness of mind",
                " regards as great and splendid and is",
                " deluded into thinking that in attaining them",
                " lies supreme success, The truth however is",
                " that the highest benefits and means of",
                " pleasure and enjoyment that one can possibly",
                " attain in the world, arc indeed bast",
                " and insignificant and confined to a few",
                " years of temporary life, and can be",
                " destroyed by just one turn of fate.",
                " Contrary to this, the lift hereafter is",
                " a splendid and eternal life: its benefits",
                " are great and permanent and its losses",
                " too are great and permanent. The one",
                " who attains Allah's forgiveness and His goodwill",
                " there, will indeed have attained the everlasting",
                " bliss beside which the whole wealth of",
                " the world and its kingdom become pale",
                " and insignificant. And the one who is",
                " seized in God's torment there, will come",
                " to know that he had made a",
                " bad bargain even if he had attained",
                " aII that he regarded as great and",
                " splendid in the world."
            ]
        },
        {
            "verse-id": "[57:21]",
            "verse": "Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, and Allah is the possessor of great bounty.",
            "description": [
                "Musabagat (from which sabiqu of the original",
                " is derived) means to compete and vie",
                " with each other in order to excel.",
                " The meaning is: \"Give up your rivalries",
                " with one another for amassing wealth, and",
                " pleasures and benefits, of the world and",
                " instead make the forgiveness of your Lord",
                " and Paradise the object of your struggle",
                " and rivalries.'",
                "*38) Some commentators have taken",
                " the word ard in 'arduha ka- 'ard-is-",
                " sama '-I wal-ard in the sense of",
                " breadth, but actually this word has been",
                " used here in the meaning of spaciousness",
                " and extensiveness. In Arabic the word ard",
                " is not only used for breadth, as",
                " a counterpart of length, but also for",
                " spaciousness, as it has been used in",
                " Ha Mim As-Sajdah: 51: fa-dhu du'a in",
                " 'arid: \"Then he is full of wordy",
                " supplications.\" Besides, one should also understand that",
                " the object here is not to foretell",
                " the area or extent of Paradise, but",
                " to give an idea of its vastness",
                " and extensiveness. Here its vastness has been",
                " described as the vastness of the heaven",
                " and earth, and in Surah . AI-'Imran",
                " it has been said: \"Hasten to follow",
                " the path that leads to your Lord's",
                " forgiveness and to Paradise whose vastness is",
                " that of the universe, which has been",
                " prepared for the righteous \"' (v. 133)",
                " When both these verses are read together,",
                " one gets the idea that the; gardens",
                " and palaces man will receive in Paradise",
                " will only serve as his dwelling-place t",
                " but the entire universe will be his",
                " home He will not be restricted to",
                " one place as be is in this",
                " world, where just for reaching the Moon,",
                " his nearest neighbour in space, he has",
                " had to struggle hard for years and",
                " expend excessive resources only to overcome the",
                " difficulties of a short journeny. There the",
                " whole universe will be accessible to him:",
                " he will be able to see whatever",
                " he would desire from his station and",
                " be able to visit whichever place he",
                " would like easily."
            ]
        },
        {
            "verse-id": "[57:22]",
            "verse": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy -",
            "description": [
                "\"A Book\": the Writ of destiny,",
                "*40)",
                " Here, \"it\" may be referring to the",
                " affliction as well as to the earth,",
                " or the self of man, or in",
                " view of the context, to all the",
                " creatures.",
                "*41) That is, it is not",
                " at all difficult for Allah to pre-ordain",
                " the destiny of each and every one",
                " of His creatures."
            ]
        },
        {
            "verse-id": "[57:23]",
            "verse": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful -",
            "description": [
                "In order to understand why this has",
                " been said in that context, one should",
                " keep in mind the conditions through which",
                " the Muslims were passing at the time",
                " this Surah was revealed. 'An ever present",
                " danger of attack by the enemy, battles",
                " in quick succession, a state of constant",
                " siege, hardships caused by economic boycott by",
                " the disbelievers, persecution of the converts to",
                " Islam everywhere in Arabia, these were the",
                " conditions that the Muslims were confronted with",
                " at that time. The disbelievers looked upon",
                " these as a proof of the Muslims",
                " having been forsaken and rejected, and the",
                " hypocrites took these as a confirmation of",
                " their own suspicions and doubts. As for",
                " the sincere Muslims, they were facing these",
                " bravely and resolutely, yet the excess of",
                " hardship and suffering would sometimes become trying",
                " even for them. So, the Muslims are",
                " being consoled, as if to say: \"No",
                " affliction, God forbid, has befallen you without",
                " the knowledge of your Lord. Whatever you",
                " are experiencing is according to the pre-ordained",
                " scheme of Allah, which is already recorded",
                " in the Writ of destiny. And you",
                " are being made to pass through these",
                " trials and tribulations for the sake of",
                " your own training for the great service",
                " that Allah wills to take from you.",
                " If you are made to attain to",
                " success without passing through these hardships, weaknesses",
                " will remain in your character due to",
                " which you will neither be able to",
                " digest power and authority nor withstand the",
                " tempests and furies of falsehood.\""
            ]
        },
        {
            "verse-id": "[57:24]",
            "verse": "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.",
            "description": [
                "The allusion is to the trait of",
                " character that everyone could experience among the",
                " hypocrites in the Muslim society itself. As",
                " regards the outward affirmation of the Faith,",
                " they could not be distinguished from the",
                " true Muslims. But owing to lack of",
                " sincerity they were not receiving the sort",
                " of training that was being given to",
                " the sincere Muslims. Therefore, the little prosperity",
                " and leadership that they were enjoying in",
                " an ordinary town of Arabia, was causing",
                " them to be swollen with pride. As",
                " for their stinginess, not only were they",
                " fhcmsc1vee unwilling to give away a penny",
                " in the cause of God Whom they",
                " professed to believe in and the Messenger",
                " whom they professed to follow and the",
                " Faith which they professed to have accepted,",
                " but tried to prevent others also from",
                " making any contribution, for, they thought, it",
                " was a useless cause. Obviously, if there",
                " had been no trials and tribulations, these",
                " worthless people, who were of no use",
                " to Allah, could not be separated from",
                " the sincere and worthy believers, and without",
                " weeding them out a mixed crowd of",
                " sincere and insincere Muslims could not be",
                " entrusted with the high office of leadership",
                " of the world, the great blessings of",
                " which the world subsequently witnessed in the",
                " rightly-guided Caliphate.",
                "*44) That is, \"Even if",
                " after hearing these words of admonition a",
                " person does not adopt the way of",
                " sincerity, faithfulness and sacrifice for the sake",
                " of AIIah and His Religion, and wishes",
                " to persist in his stubbornness, which Allah",
                " disapproves, then AIlah has no use for",
                " him, for AIIah is AII-Sufficient and Independent",
                " of His creatures: He does not stand",
                " in need of their help in any",
                " way. And He is All-Praiseworthy: people of",
                " good qualities only arc acceptable to Him;",
                " people of evil character cannot be entitled",
                " to receive any favour from Him. \"",
                ""
            ]
        },
        {
            "verse-id": "[57:25]",
            "verse": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allah may make evident those who support Him and His messengers unseen. Indeed, Allah is Powerful and Exalted in Might.",
            "description": [
                "In this brief sentence the whole essence",
                " of the mission of the Prophets bas",
                " been compressed, which one should clearly understand.",
                " It says that all the Messengers who",
                " came to the world from AIIah, brought",
                " three things:",
                "(1) Bauuomatat: manifest signs which",
                " clearly showed that they were really Allah's",
                " Messengers, and were not impostors; convincing arguments",
                " which made it evident that what they",
                " tore presenting as Truth was really the",
                " Truth, and what they condemned as falsehood",
                " was really falsehood clear instructions which told",
                " without any ambiguity what was the. right",
                " way for the people in respect of",
                " beliefs, morals, acts of worship and dealings,",
                " which they should adopt, and what were",
                " the wrong ways which they should shun",
                " and avoid.",
                "(2) Kitab: the Book which",
                " contained all the teachings required for the",
                " guidance of man so that people may",
                " turn w it for enlightenment.",
                "(3) Mizan:",
                " the Criterion of truth and falsehood which",
                " may precisely indicate, like a balance, the",
                " golden mean between t40 extremes in matters",
                " of thought, morals and dealings.",
                "The object",
                " for which the Prophets were sent with",
                " these three things was that man's conduct",
                " in the world and the system of",
                " human life, individually as well as collectively,",
                " should be established with justice. On the",
                " in hand, every man should precisely know",
                " the rights of God, the rights of",
                " his self and the rights of all",
                " . these people with whom ne may",
                " have w deal in any way, and",
                " should fulfil them faithfully; and, on the",
                " other, the system of collective life should",
                " be built on such principles as should",
                " eliminate every kind of injustice from society,",
                " should safeguard every aspect of civilization and",
                " locial life against extremism, should establish correct",
                " balance and equity in all spheres of",
                " collective life, so that all elements of",
                " society should receive their rights equitably and",
                " fulfil their obligations and duties responsibly. In",
                " other words, the object of sending the",
                " prophets was to establish individual as well",
                " as collective justice They wanted to establish",
                " justice in the personal lift of each",
                " individual so as w bring about poise",
                " and equilibrium in his mind, his character,",
                " his conduct and his dealings. They also",
                " wanted to establish the whole system of",
                " human society on justice so that both",
                " the individual and the society should assist",
                " and cooperate with each other in their",
                " spiritual, moral and material well-being instead of",
                " being a hindrance and obstacle.",
                "*46) Sending",
                " down iron means creating iron in the",
                " earth just as in Az-Zumar:6 it has",
                " been said: \"He Scat down for you",
                " eight heads of cattle, male and female.\"",
                " As whatever exists in the earth, has",
                " come hero by Allah's command, and has",
                " not appeared by itself, its being created",
                " has been expressed in the Qur'an as",
                " its being sent down. The mention of",
                " \"sending down iron which has greath strength",
                " and other benefits for men\" immediately after",
                " stating the object of the mission of",
                " the Prophets by itself indicates that by",
                " iron here is meant political and military",
                " power. Thus the verse means: \"Allah did",
                " not raise His Prophets in the world",
                " just to present a scheme for the",
                " establishment of justice, but it was also",
                " a part of their mission w endeavour",
                " to enforce it practically, w collect necessary",
                " power to establish justice in all spheres",
                " of life, w punish those who might",
                " disrupt it and to break the power",
                " of those who might resist it. \"",
                "",
                "*47) That is, \"Allah does not need",
                " this help because He is weak and",
                " cannot use His power to accomplish this",
                " work, but He has adopted this method",
                " for the trial of men: man can",
                " advance on the way of his progress",
                " and well-being only by passing through this",
                " trial. Allah indeed has the power w",
                " subdue all the disbelievers by one command",
                " whenever He wills and give to His",
                " Messengers complete dominance over them, but in",
                " that case the believers in the Messcngers",
                " would have - nothing to do for",
                " which they should become entitled to rewards.",
                " That is why Allah instead of accomplishing",
                " this mission through His dominant power adopted",
                " the method of sending His Messengers to",
                " human beings with the Signs and the",
                " Book and the Criterion, and enjoined them",
                " to present the way of justice before",
                " the people and exhort them to refrain",
                " and desist from wickedness sad injustice At",
                " the same time He gave us full",
                " option to accept the message of the",
                " Messengers or to reject it. He summoned",
                " those who accepted the invitation to come",
                " forward and help Him and His Messengers",
                " to establish justice, and to exert their",
                " utmost against those the were bent upon",
                " retaining the unjust system. Thus, Allah wants",
                " to see who among us reject: the",
                " invitation to justice, who exert with their",
                " lives in order to retain injustice as",
                " against justice, who shirk: supporting d struggling",
                " for the cause of the message of",
                " justice after they have accepted it, and",
                " who stake their lives and their possessions",
                " for the sake of unseen God to",
                " help the truth become dominant in the",
                " world. Only for those who emerge successful",
                " in this test will avenues to fixture",
                " progress be opened up. \""
            ]
        },
        {
            "verse-id": "[57:26]",
            "verse": "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture; and among them is he who is guided, but many of them are defiantly disobedient.",
            "description": [
                "Now it is being told what corruptions",
                " appeared among those who believed in the",
                " Prophets who came to the world before",
                " the Prophet Muhammad (upon whom be Allah's",
                " peace and blessings) with the Signs and",
                " the Book and the Criterion.",
                "*49) that",
                " is, whichever Messenger came with Allah's Book,",
                " was from the progeny of the Prophet",
                " Noah and, after him, from the progeny",
                " of the Prophet Abraham.",
                "*50) 'Became transgressors\"",
                " became disobedient."
            ]
        },
        {
            "verse-id": "[57:27]",
            "verse": "Then We sent following their footsteps Our messengers and followed [them] with Jesus, the son of Mary, and gave him the Gospel. And We placed in the hearts of those who followed him compassion and mercy and monasticism, which they innovated; We did not prescribe it for them except [that they did so] seeking the approval of Allah. But they did not observe it with due observance. So We gave the ones who believed among them their reward, but many of them are defiantly disobedient.",
            "description": [
                "The words in the Text are rafat",
                " and rahmat, which are almost synonymous: But",
                " when they are used together, rafat implies",
                " the compassion that a person feels on",
                " seeing another person in pain and distress,",
                " and rahmat is the feeling under which",
                " be tries to- help him. As the",
                " Prophet Jesus was highly compassionate and merciful",
                " towards the people, his this trait of",
                " character deeply influenced his disciples: therefore, they",
                " treated the people with pity ant-sympat by",
                " and served them with aII their heart",
                " and soul.",
                "*52) The root rahb (from",
                " which rabaniyyat or ruhbaniyyat is derived) means",
                " fear; thus rahbaniyyat means a mode of",
                " life which reflects fear and terror, and",
                " ruhbaniyyat means the mode of life of",
                " the terrified. As a term it implies",
                " a person's abandoning the world out of",
                " fear (whether it is the fear of",
                " somebody's tyranny, or far of the worldly",
                " temptations and distractions, or fear of one's",
                " personal weaknesses) and taking refuge in the",
                " jungles and mountains, or living alone as",
                " a hermit.",
                "*53) The words in the",
                " original can havc two meanings: (I) \"That",
                " We did not enjoin monasticism rahbanit) upon",
                " them: We enjoined upon them only the",
                " seeking of Allah's good pleasure:\" and (2)",
                " that monasticism was not enjoined by Us:",
                " they of their own accord enjoined it",
                " on themselves, to seek Allah's good pleasure.\"",
                " In both cases this verse makes it",
                " explicit that monasticism is an unIslamic crced,",
                " and it has never been part of",
                " the true Faith. The same thing has",
                " been stated by the Holy Prophet thus:",
                " \"There is no monasticism in Islam.\" (Musnad",
                " Ahmed). In another Hadith the Holy Prophet",
                " said: \"The monasticism of this Ummah is",
                " to fight in the way of Allah.\"",
                " (Musnad Ahmed Musnad'Abi Ya'la That is, he",
                " way for this Ummah to attain to",
                " spiritual piety lies not in abandoning the",
                " world but in fighting in Allah's way:",
                " this Ummah does not flee to the",
                " jungles and mountains out of fear of",
                " temptations and distractions but counteracts them by",
                " resort to fighting in Allah's way. According",
                " to a tardition related both by Bukhari",
                " ant by Muslim, one of the Companions",
                " said that he would keep up Prayers",
                " throughout the night; another said that he",
                " would fast perpetually without ever observing a",
                " break; and a third one said the",
                " he would never marry and would have",
                " nothing to do with women. When the",
                " Holy Prophet (upon whom be Allah's peace)",
                " came to know of what they had",
                " resolved, he said: 'By God, I fear",
                " Allah the most and remain conscious of",
                " Him at all times; yet my way",
                " is that I observe the fast as",
                " well as break it; I keep up",
                " the Prayer during the night as well",
                " as have sleep; and I marry the",
                " women also. The one who dces not",
                " follow my way, does not belong to",
                " me \" .Hadrat Anas says that the",
                " Holy Prophet (upon whom be Allah's peace)",
                " used to say: \"Do not be- hard",
                " and severe to yourselves lest AIIah should",
                " be hard and severe to you. A",
                " community had adopted this way of severity",
                " towards itself; then Allah also seized it",
                " in severity. Look, the remainder of them",
                " are found in the monasteries and churches.",
                " \" (Abu Da 'ud).",
                "*54) That is,",
                " they were involved in a double error:",
                " first, they imposed on themselves the restrictions",
                " which Allah had not imposed; second, They",
                " did not observe in the right spirit",
                " the restrictions that they had imposed upon",
                " themselves with a view to attain to",
                " Allah's goodwill, and conducted themselves in a",
                " way as to earn Allah's wrath instead",
                " of His good pleasure.",
                "To understand this",
                " theme fully we should havc a look",
                " at the history of Christian Monasticism.",
                "Until",
                " 200 years after the Prophet Jesus (peace",
                " be upon him) the Christian Church knew",
                " no monasticism. Its germs, however, were found",
                " in Christianity from the very beginning. To",
                " look upon asceticism as a moral ideal",
                " and to regard celibacy as superior to",
                " matrimonial and mundane life is the basis",
                " of monasticism. Both these existed in Christianity",
                " from the beginning. Owing to the sanctification",
                " of celibacy in particular, it was considered",
                " undesirable for those the performed religious services",
                " in the church to marry, have children",
                " and be involved in domestic chores; so",
                " much so that by the 3rd century",
                " monasticism began to spread like an epidemic",
                " in Christiandom. Historically, it had three main",
                " causes!:",
                "First, sensuality, immorality and worship of",
                " the world had so permeated the ancient",
                " polytheistic society that in their zeal to",
                " counteract it the Christian scholars adopted the",
                " extremist way instead of the way of",
                " moderation. They so stressed chastity that the",
                " relationship between man and woman by itself",
                " came to be looked upon as filthy,",
                " even if it was within marriage. They",
                " reacted so violently to mammonism that to",
                " possess property of any kind ultimately was",
                " considered a sin for a religious person",
                " and to live like a poor man",
                " and ascetic the criterion of moral excellence.",
                " Likewise, in their reaction to the sensualism",
                " of the polytheistic society they touched the",
                " other extreme. They made withdrawal from pleasure",
                " and all material comforts, self denial and",
                " curbing of the desires the object of",
                " morality and regarded torturing the body by",
                " different sorts of harsh discipline as the",
                " climax and proof of a person's spirituality.",
                "",
                "Secondly, when Christianity started achieving successes and",
                " spreading rapidly among the common people, the",
                " Church in its zeal to attract more",
                " and more adherents went on imbibing every",
                " evil that was prevalent in society. Thus,",
                " saint-worship replaced the ancient deities. Images of",
                " Christ and Mary began to be worshipped",
                " instead of the idols of Horus and",
                " Isis. Chrismas took the place of Saturnalia.",
                " Christian monks began to practise every kind",
                " of occult art like curing the sick",
                " by amulets and magic incantations, taking omens",
                " and fortune-telling, driving out spirits, etc. as",
                " were prevalent in ancient days. Likewise, since",
                " the COmmOn people looked upon a ditty",
                " and naked person who lived in a",
                " cave or den As a holy and",
                " godly man, this very concept of saintlihood",
                " became prevalent in the Christian Church, and",
                " legends of their miraculous powers began to",
                " abound in the memoirs of the Christian",
                " saints,",
                "Thirdly, the Christians possessed no detailed",
                " law and definite traditions and practices to",
                " determine the bounds of religion. They had",
                " given up Mosaic Law and the Gospel",
                " by itself afforded no perfect code of",
                " guidance. Therefore, the Christian doctors went on",
                " permitting every kind of innovation to enter",
                " the religion partly under the influence of",
                " alien philosophies, customs and practices and partly",
                " under their personal preference and whim. Monasticism",
                " was one such innovation. Christian scholars and",
                " doctors of law took its philosophy and",
                " rules and practices from the Buddhist monks,",
                " Hindu Yogis and ascetics, Egyptian Anchorites, Iranian",
                " Manicheans, and the followers of Plato and",
                " Plotinus, and made the same the means",
                " ant methods of attaining self-purification, spiritual loftiness",
                " and nearness to AIIah. Those who committed",
                " this error were not ordinary men. From",
                " the 3rd to the 7th century (i.e..",
                " till about the time the Qur'an began",
                " to be revealed) the religious personalities who",
                " were recognized as the foremost scholars and",
                " religious guides and leaders of Christendom, both",
                " in the East and in the West,-St.",
                " Athanasius, St. Basil, St. Gregory of Bazianzus,",
                " St. Chrysostom, St. Ambrose, St. Jerome, St.",
                " Augustine St. Benedict, St. Gregory the Great-all",
                " were monks themselves and great upholders of",
                " monasticism. It was under their influence that",
                " monasticism became popular in the Church.",
                "Historically,",
                " monasticism among the Christians started from Egypt.",
                " Its founder was St. Anthony (A.D. 250",
                " -350) who is regarded as the father",
                " of Christian Monasticism. He set up the",
                " first monastery at Pispir (now Der al",
                " Memum) in the Fayum. Later he established",
                " another monastery on the coast of the",
                " Rod Sea, which is now called Der",
                " Mar Antonius The basic cults of Christian",
                " Monasticism are derived from his writings and",
                " instructions. After this beginning the monastic movements",
                " spread like a f flood in Egypt",
                " and monasteries for monks and nuns were",
                " set up everywhere in the land in",
                " some of which lived three thousand monks",
                " at a time. In 325 another ascetic,",
                " pachomius, appeared in Egypt, who founded ten",
                " major monasteries and nunneries for the monks",
                " and nuns. The monastic movement then began",
                " to spread in Palestine and Syria and",
                " different countries of Africa and Europe. The",
                " Christian Church in the beginning experienced some",
                " confusion in connection with monasticism, for although",
                " it recognized abandonment of the world, celibacy",
                " and voluntary poverty as an ideal of",
                " spiritual life, yet it could not declare",
                " marriage, producing children and possessing property or",
                " money to be sinful as the monks",
                " did. Subsequently, under the influence of holy",
                " men like St. Athanasius (d. 373), St.",
                " Basil (d. 379), St. Augustine (d. 430)",
                " and Gregory the Great (d. 609) many",
                " of the monastic rules became part and",
                " parcel of the Church.",
                "This monastic innovation",
                " has some characteristics which are briefly as",
                " follows:",
                "(1) Inflicting pain on the body",
                " by severe exercises and novel methods. In",
                " this thing every monk tried to surpass",
                " the other. The achievements of these holy",
                " men as related in the memoirs of",
                " the Christian saints are to this effect:",
                " St. Macarius of Alexandria constantly carried on",
                " himself a weight of 80 pounds. For",
                " six months he slept in a swamp",
                " while poisonous flies preyed on his naked",
                " body. His disciple, St. Eusebius, even surpassed",
                " his master in suffering severities and rigours.",
                " He moved about carrying a weight of",
                " 150 pounds, and lay in a dry",
                " well for three years. St. Saba ate",
                " the maize that would start stinking having.",
                " been soaked in water for a whole",
                " Month. St. Bassarion lay in thorny bushes",
                " for 40 days and did not rest",
                " his back on the ground for 40",
                " years. St. Pachomius passed 15 years of",
                " his life, and according to another tradition",
                " 50 years, without rating his back on",
                " the round St. John remained standing in",
                " worship for three years during which he",
                " neither sat nor (ay down; he would",
                " only recline at times against a rock.",
                " His food consisted of the offering that",
                " was brought for him every Sunday. St.",
                " Simeon Styiltes (390-449) who is counted among",
                " the most illustrious Christian saints, used to",
                " observe an un-broken 40 days fast and",
                " smiling. Owing to such concepts the bond",
                " of marriage between man and woman came",
                " to be looked upon as filthy. A",
                " monk was forbidden even to look at",
                " a woman, not to speak of marriage,",
                " and was required to abandon his wife",
                " if he was married. As for men",
                " it was also impressed on the women",
                " that if they wished to enter the",
                " Kingdom of Heaven, they should shun marriage",
                " and remain spinsters and if they were",
                " married, they should separate from their husbands.",
                " St. Jerome, the distinguished Christian scholar, ruled",
                " that the woman who remained a spinster",
                " as a nun for the sake of",
                " Christ, was the bride of Christ, and",
                " her mother was the mother-in-law of Christ,",
                " i.e. God. Elsewhere St. Jerome says: \"To",
                " cut asunder the bond of marriage with",
                " the axe of chastity is the primary",
                " duty of the true devotee of God.",
                " \" The first impact these teachings had",
                " on a Christian man or Christian woman,",
                " under religious fervour, was that his or",
                " her married life was ruined. And since",
                " there was no provision for divorce or",
                " separation in Christianity, the husband and the",
                " wife would separate from each other while",
                " they remained bound in wed-lock. St. Nilus",
                " was father of two children. When he",
                " came under the spell of monasticism, he",
                " immediately separated from his wife. St. Ammon,",
                " on the first night of his marriage,",
                " gave his bride a sermon on the",
                " filthiness of the marriage bond and then",
                " the two between themselves decided to keep",
                " aloof from each other throughout life. St.",
                " Abraham abandoned his wife on the very",
                " first night of marriage. The same was",
                " done by St. Alexis. The memoirs of",
                " the Christian saints are full of such",
                " incidents.",
                "The Church continued to resist in",
                " one way or the other these extremist",
                " concepts for three centuries. In those days",
                " it was not required of a priest",
                " to be single and unmarried. If he",
                " was married before being appointed a minister,",
                " he could keep his wife. However, he",
                " was forbidden to marry after his appointment.",
                " Moreover, a person could not be appointed",
                " a minister if he had married a",
                " widow, or a divorced woman, or had",
                " two wives, or possessed a concubine. Gradually,",
                " by the 4th century, the concept became",
                " firm that for a married person it",
                " was odious to perform religious services in",
                " the Church. The Council of Gengra (A.D.",
                " 362) was the last one in which",
                " such ideas wen held as anti-religious, but",
                " a little lour in 386, Roman Synod",
                " counselled the priests to avoid marriage relations",
                " and the following year Pope Siricius decreed",
                " that the priest who married, or continued",
                " to have sex relations with his wife",
                " if already married should be dismissed from",
                " office. Illustrious scholars like St. Ambrose, and",
                " St. Augustine upheld this decision most fervently,",
                " and after a little resistance it became",
                " fully enforced in the Western Church. In",
                " this period several councils were convened to",
                " consider the complaints to the effect that",
                " the people who were already marred were",
                " having \"illicit\" relations with their wives even",
                " after their appointment to perform religious duties.",
                " Consequently, with a view to reform them,",
                " rules were made to the effect that",
                " they should sleep in the open, should",
                " never meet their wives in private, and",
                " should meet them only in the presence",
                " of at (cast two other men. St.",
                " Gregory has made mention of a wonderful",
                " priest who did not have any relation",
                " with his wife for 40 years, and",
                " when the woman approached him at his",
                " death-bed, he rebuked her, saying: 'Woman. keep",
                " away !\"",
                "(4) The most painful and",
                " pathetic chapter of ascetic monasticism is that",
                " it cut asunder man's relations with his",
                " parents, with his brothers and sisters, and",
                " even his children For the Christian saints",
                " love of the parents for son, love",
                " of the brothers and sisters for brother",
                " and love of the children for father",
                " also was sinful. They believed it was",
                " necessary for man to break off aII",
                " those relations for the sake of spiritual",
                " progress. In the biographies of the Christian",
                " saints one comes across highly pathetic and",
                " heart-rending incidents. A monk, St. Evagrius, had",
                " been undergoing severe exercises in the desert",
                " for many years. Suddenly one day letters",
                " reached him from his father and mother,",
                " who were passing their days in great",
                " agony without him. The saint, fearing that",
                " the letters might arouse feelings of human",
                " love in his heart, cast the letters",
                " immediately into the fire, without even opening",
                " them. The mother and sister of St.",
                " Theodorus came to the monastery where he",
                " was staying, with recommendatory letters from many",
                " priests, and desired to have only a",
                " glimpse of him, but the saint refused",
                " to come out before them. St. Marcus'",
                " mother went to the monastery to sec",
                " him. She somehow obtained the abbot's permission",
                " for it and requested him to order",
                " her son to come out before her,",
                " but the son was adamant to her",
                " prayers. At last, be implemented the abbot's",
                " orders by appearing before his mother disguised",
                " and with closed eyes. Thus, neither was",
                " the mother able to recognize her son,",
                " nor the son saw his mother. Another",
                " saint, St. Poemen ant his six brothers",
                " lived in a desert tnonastery of Egypt.",
                " Years later their old mother came to",
                " know of their whereabouts and went to",
                " sec them in the monastery. As soon",
                " as the brothers saw their mother coming,",
                " they hurried into their cell and shut",
                " the door. The mother started crying and",
                " wailing outside saying: \"I have travelled in",
                " this old age from a distant place",
                " only to have a glimpse of you.",
                " There will be no harm if only",
                " I see you. Am I not your",
                " mother ?\" But the saints did not",
                " open the door and told the mother",
                " that they would meet her in the",
                " next world. Even more painful and piteous",
                " is the story of St. Simeon Stylites,",
                " who left his parents and remained away",
                " from them without any trace of his",
                " where abouts for 27 years. The father",
                " died of grief. When the fame of",
                " the son's piety and holiness spread the",
                " mother, who was still living in agony,",
                " came to know of his whereabouts. She",
                " came to the monastery to see him",
                " but women were not allowed to enter.",
                " She prayed that either the son should",
                " call her in, or he should himself",
                " conic out to let her have a",
                " glimpse of him, but \"the saint\" before",
                " Easter every year. Once he kept standing",
                " on one leg for a whole year.",
                " Often he would leave his monastery and",
                " retire to a well. Later he got",
                " a 60 foot high pillar erected near",
                " Antioch, which was three feet wide at",
                " the top and railed round. He spent",
                " the last 30 years of his life",
                " on this pillar and remained permanently exposed",
                " to the elements. His disciples carried food",
                " to him by ladder and removed his",
                " filth. He had even tied himself to",
                " the pillar by a string, which cut",
                " into his flesh; when the flesh became",
                " rotten, it bred worms; whenever a worm",
                " fell out, he would restore it to",
                " the sore, saying: \"Eat what God has",
                " given you Crowds of pilgrims flocked to",
                " him from far and near. When he",
                " died the Christian world proclaimed that he",
                " was the best model of a Christian",
                " saint.",
                "The memoirs of the Christian saints",
                " of this period are full of such",
                " instances. One particular saint had the characteristic",
                " that he observed silence for 30 years:",
                " he was never seen speaking. Another had",
                " tied himself to a rock; another roamed",
                " the jungles and lived on grass; another",
                " moved about carrying a heavy load; another",
                " kept his limbs and body tied in",
                " fetters and chains; some saints lived in",
                " the dens of beasts, or in dry",
                " wells, or in old graves; and some",
                " others remained naked and concealed their private",
                " parts under long hair and would crawl",
                " on the ground. After death the bones",
                " of the illustrious saints were preserved in",
                " monastery. I saw a full library decked",
                " with such bones in St. Catherine's monastery",
                " at the foot of Mount Sinai. There",
                " were skulls and foot-bones and handbones arranged",
                " separately. A glass-case contained the whole skeleton",
                " of a saint.",
                "(2) Their second characteristic",
                " was that they were dirty and strictly",
                " cleanliness and bodily care. Washing or applying",
                " water to the body was regarded as",
                " opposed to God-worship, for according to them",
                " puriflcation of the body was tantamount to",
                " pollution of the soul. St. Athanasius has",
                " faithfully described this virtue of St. Anthony",
                " that he never washed his feet during",
                " life. St. Abraham from the day he",
                " entered Christianity neither washed his face nor",
                " feet for 50 years. A famous nun",
                " Virgin Sylvia, never allowed any part of",
                " her body except the fingers to become",
                " wet with water throughout life It is",
                " said of 130 nuns of 8 convent",
                " that they never washed their feet and",
                " would shudder with horror at a mere",
                " reference to bath.",
                "(3) Monasticism practically forbade",
                " married life and ruthlessly discarded the institution",
                " of marriage. All religious writings of the",
                " 4th and 5th centuries are replete with",
                " the thought that celibacy is the highest",
                " moral virtue, and chastity meant that one",
                " should strictly abstain from sexual relation even",
                " if it was between husband and wife.",
                " The perfection of a pure spiritual life",
                " lay in complete self-denial, with no desire",
                " for physical pleasure. It was . necessary",
                " to suppress any carnal desire because it",
                " strengthened animality. For them pleasure and sin",
                " were synonymous so much so that being",
                " happy was regarded as being forgetful of",
                " God. St. Basil forbade even laughing refused",
                " to oblige her. The woman lay at",
                " the entrance for three days and three",
                " nights and at last breathed her last",
                " in the same state. Then the holy",
                " man emerged from his seclusion, mourned his",
                " mother's death and prayed for her forgiveness.",
                "",
                "In the same harsh way these saints",
                " treated their sisters and children. There is",
                " the story of Mutius, a prosperous man",
                " by aII means. Drawn out suddenly by",
                " the religious impulse, he took his 8-year-old",
                " son and went to a monastery. But",
                " for the sake of his progress to",
                " holiness it was necessary that he should",
                " give up love of his son. Therefore,",
                " first the son was separated from him",
                " Then the innocent child was subjected to",
                " harsh treatment before his very eyes and",
                " he watched it patiently. Then, the. abbot",
                " of the monastery ordered him to go",
                " and Cast the child into the river.",
                " He became ready even for this; then",
                " right at the time when he was",
                " going to throw the child into the",
                " river, the monks saved the child's life.",
                " then it was admitted that he had",
                " actually attained td the rank of a",
                " holy man.",
                "The viewpoint of Christian monasticism",
                " in these matters was that the one",
                " who sought love of God, should break",
                " off all relations of human love that",
                " bound him in the world to his",
                " parents, his brothers and sisters and his",
                " children. St. Jerome says, \"Even if your",
                " nephew clings to you with his hands",
                " round your neck; even if your mother",
                " calls you back in the name of",
                " having suckled you; even if your father",
                " obstructs your way and lies down before",
                " you, you should hasan out to the",
                " banner of the cross, trampling the body",
                " of your father, without shedding a tear.",
                " Ruthlessness in this mater is piety itself.\"",
                " St. Gregory writes, \"A young monk who",
                " could not give up love of his",
                " parents, left the monastery one night in",
                " order to pay them a visit. God",
                " punished him for this error, for as",
                " soon as he returned to the monastery,",
                " he died. His body was buried in",
                " the grave but the earth did not",
                " accept it. He was placed in the",
                " grave again and again, and the earth",
                " threw him out every time. At last,",
                " St. Benedict placed a sacred offering on",
                " his chest, and then the grave accepted",
                " him.\" Of a nun it is said",
                " that for three days after her death,",
                " she remained subject to a torment because",
                " she had not been able to cleanse",
                " her heart of her mother's lout. About",
                " a saint it is written that he",
                " never treated anyone harshly except his relatives.",
                "",
                "(5) Their practice of meting out ruthless,",
                " cruel and harsh treatment to their nearest",
                " relatives, made their human feeling dead, with",
                " the result that they would treat with",
                " utmost enmity those with whom they had",
                " any religious differences. By the beginning of",
                " the 4th century, 80 to 90 religious",
                " sects had arisen in Christianity. St. Augustine",
                " has made mention of 88 sects of",
                " his own time, each of which regarded",
                " the other with extreme hatred. And the",
                " fire of this hatred also was fanned",
                " by the monks, who were always in",
                " the forefront to hahtt and destroy the",
                " opponent sects by their machinations. Alexandria was",
                " a great cenur of this sectarian conflict.",
                "",
                "There, in the beginning the Bishop of",
                " the Arian sect attacked the Athanasius party.",
                " Virgin nuns were dragged out of their",
                " convents, stripped naked and beaten with thorny",
                " branches and branded in order to make",
                " them give up their creed. Then, when",
                " the Roman Catholics came to power in",
                " Egypt, they treated the Arian' sect likewise;",
                " so much so that according to the",
                " prevalent view Arius himself also was poisoned.",
                " Once on the same city of Alexandria",
                " the monks of St.' Cyril created a",
                " turmoil They seized a nun of the",
                " opponent sect and took her into their",
                " church; they killed her, backed her body",
                " to pieces, and cast it into the",
                " fire. Rome was not any different from",
                " this. In 366, at the death of",
                " Pope Liberius, two sects nominated their respective",
                " candidates for papacy; this resulted in great",
                " bloodshed; so much so that in one",
                " day 137 dead bodies were taken out",
                " from one church.",
                "(6) Side by side",
                " with this retreat from the world and",
                " life of seclusion and poverty, wealth of",
                " the world also was amassed most avariciously.",
                " By the b-ginning of the 5th century",
                " the condition was that the bishop of",
                " Rome lived in his palace like kings,",
                " and when his conveyance emerged in the",
                " city, it would be as stately and",
                " splendid as of the emperor himself. St.",
                " Jerome complains of the conditions of his",
                " time (later part of the 4th century)",
                " saying that the feast hosted by many",
                " of the bishops out-classed the feasts of",
                " the governors. The flow of wealth to",
                " monasteries and churches had assumed the proportions",
                " of a deluge by the beginning of",
                " the 7th century (the age of the",
                " revelation of the Qur'an). It had been",
                " deeply impressed on the minds that a",
                " person who happened to commit a grave",
                " sin could be redeemed only by making",
                " an offering at a saint's shrine, or",
                " a sacrifice at the altar of a",
                " church or monastery. Then the same world",
                " and its luxuries and comforts abstention from",
                " which was the mark of distinction of",
                " the monks, lay at their feet. The",
                " factor which, in particular, caused this decline",
                " was that when the common people developed",
                " extreme reverence for the monks because of",
                " their undergoing severe exercises of self-discipline and",
                " self-denial, hosts of world seeking people also",
                " donned the monk's garments and entered their",
                " ranks. Then under the garb of feigned",
                " poverty they turned acquisition of worldly wealth",
                " and possessions into a flourishing business.",
                "(7)",
                " In the matter of chastity also monasticism",
                " was repeatedly defeated in its fight against",
                " nature and defeated well and proper. In",
                " the monasteries some exercises of self-mortification were",
                " such as required the monks and nuns",
                " to live together in one and the",
                " same place, and they had often to",
                " pass the night in the same bed",
                " in their enthusiasm for more and more",
                " temptations. St. Evagarius, the well-known monk, has",
                " praised the self-control acquired by the Palestinian",
                " monks, saying: \"They had mastered their passion",
                " so completely that although they bathed with",
                " the women together, looked at their bodice,",
                " touched them, even embraced them, yet they",
                " remained invincible to nature.\" Although bathing was",
                " an odious thing in monasticism, such baths",
                " were also taken for the sake of",
                " exercise in self-control. At last, about the",
                " same Palestine, St. Gregory of Nyssa (d.",
                " 396) writes that it bas become a",
                " centre of wickedness and immorality. Human nature",
                " avenges itself on those who fight it.",
                " Monasticism fought it and ultimately fell in",
                " the pit of immorality the story of",
                " which is a most shameful blot on",
                " the religious history of the 8th to",
                " 11th centuries. An Italian bishop of the",
                " 10th century writes: \"If the penal law",
                " for misconduct is practically enforced against those",
                " who perform religious services in the church,",
                " none would escape punishment except the boys,",
                " and if the law to remove illegitimate",
                " children from religious services was also enforced,",
                " there might perhaps be left no boy",
                " among the attendants of the church. \"",
                " Books of the medieval authors are replete",
                " with the complaints that the nunneries had",
                " become houses of prostitution. Within their four",
                " walls newborn babies were being massacred; the",
                " priests and religious attendants of the church",
                " had developed illicit connections even with forbidden",
                " relatives; the crime of the mtnatural act",
                " had spread like an epidemic in the",
                " monasteries; and the practice of confession had",
                " become a means of immorality in the",
                " churches.",
                "From these details one can fully",
                " appreciate what corruption of Christianity is the",
                " Qur'iin alluding to when it says: \"The",
                " Christians themselves invented monasticism, but they did",
                " not observe it as it should have",
                " been observed.\""
            ]
        },
        {
            "verse-id": "[57:28]",
            "verse": "O you who have believed, fear Allah and believe in His Messenger; He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you; and Allah is Forgiving and Merciful.",
            "description": [
                "The commentators differ in the explanation of",
                " this verse, One group says that the",
                " address here is directed to the people",
                " who believed in the Prophet Jesus. It",
                " is being said to them, \"Believe in",
                " the Holy Prophet Muhammad (upon whom be",
                " Allah's peace and blessings) now; for this",
                " you will be given a double reward,",
                " one reward for believing in the Prophet",
                " Jesus (peace be upon him) and the",
                " other reward for believing in the Prophet",
                " Muhammad (upon whom be Allah's peace and",
                " blessings). The second group says that the",
                " followers of the Holy Prophet Muhammad (upon",
                " whom be Allah's peace and blessings) are",
                " being addressed. They are being admonished to",
                " the effect: \"Do not rest content with",
                " your verbal affirmation of the Faith only,",
                " but you should believe sincerely and truly",
                " For this you will be given .",
                " a double reward: one reward for giving",
                " up disbelief and turning to Islam, and",
                " the second reward for believing sincerely in",
                " Islam and remaining steadfast to it. \"The",
                " first commentary is supported by vv. 52-S4",
                " of Surah AI-Qasas, and furthermore by the",
                " tradition reported by Hadrat Abu Musa al-Ash'ari,",
                " according to which the Holy Prophet (upon",
                " whom be peace) said: \"There are throe",
                " men who will get a double reward,",
                " one of them is a person from",
                " among the followers of the earlier Books",
                " who believed in this earlier Prophet and",
                " then believed in the Prophet Muhammad (upon",
                " whom be Allah's peace).\" (BukhAri Muslim). The",
                " second commentary is supported by verse 37",
                " of Surah Saba, which says that the",
                " righteous believers will have a double reward.",
                " From the point of view of argument",
                " both the commentaries are equally weighty. However,",
                " considering the theme that follows, one feels",
                " that the second commentary is more in",
                " keeping with the context here; and in",
                " fact the whole theme of this Surah,",
                " from beginning to end, supports this very",
                " commentary. From the beginning of this Surah-",
                " the addressees are the people who had",
                " entered Islam after affirming the Prophethood of",
                " the Holy Prophet and it is they",
                " whom the Surah invites to believe sincerely",
                " and truly and not merely verbally with",
                " the tongue",
                "*56) That is, \"He will",
                " bless you with such a light of",
                " knowledge and vision in the world by",
                " which you will be able clearly distinguish",
                " at every step the straight way of",
                " Islam from the crooked paths of ignorance",
                " in different matters of life, and in",
                " the Hereafter He will grant you the",
                " Light that has been mentioned in verse",
                " 12 above.'",
                "*57) That is, \"He will",
                " forgive you your errors that you may",
                " happen to commit due to human weaknesses",
                " in spite of your sincere efforts to",
                " fulfil the demands of the Faith, and",
                " will also forgive those sins of yours",
                " that you had committed in the pre-Islamic",
                " days of ignorance.\""
            ]
        },
        {
            "verse-id": "[57:29]",
            "verse": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allah and that [all] bounty is in the hand of Allah; He gives it to whom He wills. And Allah is the possessor of great bounty.",
            "description": [
                ""
            ]
        }
    ]
}