{
    "name": "Al-Anam",
    "id": 6,
    "verse-count": 165,
    "verse-info": [
        {
            "verse-id": "[6:1]",
            "verse": "[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.",
            "description": [
                "Remember that, although polytheists, the Arabs to",
                " whom these verses are addressed did acknowledge",
                " God as the Creator of the heavens",
                " and the earth, Who causes day to",
                " alternate with night, and Who has brought",
                " into existence the sun and the moon.",
                " None of them attributed any of these",
                " acts to either al-LAt, al-Hubal, al-'UzzA or",
                " any other deities. Why, then,'should they prostrate",
                " themselves before others beside the Creator? Why",
                " should they offer their prayers and supplicatiom",
                " to any but God? (See Towards Understanding",
                " the Qur'an, vol. I, Surah 1, n.2,",
                " and Surah 2, n.163) The actual word",
                " that has been used in the original",
                " text for 'darkness' is in the plural.",
                " The contrast with the singular 'light' is",
                " significant: whereas light is one, there can",
                " be innumerable degrees of darkness, which is",
                " the absence of light."
            ]
        },
        {
            "verse-id": "[6:2]",
            "verse": "It is He who created you from clay and then decreed a term and a specified time [known] to Him; then [still] you are in dispute.",
            "description": [
                "The elements composing the human organism are",
                " all, without exception, derived from the earth.",
                " Hence it is said that man has",
                " been created out of clay.",
                "*3). This",
                " alludes to the Hour of Judgement when",
                " human beings, regardless of the age in",
                " which they lived, will be broought back",
                " to life and summoned to render an",
                " account before their Lord."
            ]
        },
        {
            "verse-id": "[6:3]",
            "verse": "And He is Allah, [the only deity] in the heavens and the earth. He knows your secret and what you make public, and He knows that which you earn.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:4]",
            "verse": "And no sign comes to them from the signs of their Lord except that they turn away therefrom.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:5]",
            "verse": "For they had denied the truth when it came to them, but there is going to reach them the news of what they used to ridicule.",
            "description": [
                "The allusion is to the Migration (Hijrah)",
                " and the numerous victories destined to follow",
                " it in quick succession. When this allusion",
                " was made, the unbelievers could not have",
                " guessed what kind of news they would",
                " receive, and even the Muslims could not",
                " have imagined those developments. Infact, the Prophet",
                " himself (peace be on him) was not",
                " fully aware of the posibilities which lay",
                " in store."
            ]
        },
        {
            "verse-id": "[6:6]",
            "verse": "Have they not seen how many generations We destroyed before them which We had established upon the earth as We have not established you? And We sent [rain from] the sky upon them in showers and made rivers flow beneath them; then We destroyed them for their sins and brought forth after them a generation of others.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:7]",
            "verse": "And even if We had sent down to you, [O Muhammad], a written scripture on a page and they touched it with their hands, the disbelievers would say, \"This is not but obvious magic.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:8]",
            "verse": "And they say, \"Why was there not sent down to him an angel?\" But if We had sent down an angel, the matter would have been decided; then they would not be reprieved.",
            "description": [
                "The unbelievers were saying that if Muhammed",
                " (peace be on him) had indeed been",
                " endowed with prophethood, an angel should have",
                " been sent down from heaven to announce",
                " that he was the Messenger of God,",
                " and that that people would be punished",
                " if they did not follow his directives.",
                " It was atonishing to these ignorant objectors",
                " that the Creator of the heavens and",
                " the earth should appoint someone as His",
                " Messenger and then leave him without protection",
                " against the physical hurts and insults that",
                " were flung at him. They would have",
                " expected the envoy of a Sovereign as",
                " great as the Creator of the universe",
                " to be accomplied by at least some",
                " heavenly constable, if not a large retinue,",
                " to protect him!",
                "*6). The unbelievers' objection",
                " is refuted by this remark. it warns",
                " them that the time available for accepting",
                " the true faith and bringing about the",
                " required reform in their lives will last",
                " only as long as Ultimate Reality remains",
                " concealed from human perception by the wheel",
                " of the Unseen. Once that wheel is",
                " removed, there will be no more respite:",
                " the summons to God's rekoning will have",
                " come. This earthly life is a test",
                " of whether a man is able to",
                " recognize the Ultimate Reality - even though",
                " it lies hidden from his sence perception",
                " - by the correct excecise of his",
                " reason and intelect and of whether, having",
                " once recognized it, he is able to",
                " behave in conformity with that Reality by",
                " exercising control over his animal self and",
                " its lusts. This test necessarily requires that",
                " the Reality should remain concealed. Thereafter man",
                " will be confronted with the result of",
                " the test rather than by any further",
                " test. Until God has decided to bring",
                " the term of their test to a",
                " close, it is not possible to respond",
                " to such requests by sending angels to",
                " them in their true form. (See also",
                " Towards Understanding the Qur'an, vol. I, Surah",
                " 2, n.228.)"
            ]
        },
        {
            "verse-id": "[6:9]",
            "verse": "And if We had made him an angel, We would have made him [appear as] a man, and We would have covered them with that in which they cover themselves.",
            "description": [
                "This is the second point in response",
                " to the unbelievers' objection. One possible form",
                " in which the angel could have appeared",
                " is in its true, non-terrestrial form. It",
                " has already been pointed out that the",
                " time for this has not arrived. Alternatively,",
                " angels could have come down in human",
                " form. But this would have left the",
                " unbelievers facing the same difficulty as they",
                " faced with regard to whether the Prophet",
                " Muhammad (peace be on him) had been",
                " designated by God or not."
            ]
        },
        {
            "verse-id": "[6:10]",
            "verse": "And already were messengers ridiculed before you, but those who mocked them were enveloped by that which they used to ridicule.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:11]",
            "verse": "Say, \"Travel through the land; then observe how was the end of the deniers.\"",
            "description": [
                "The archaeological remains and historical records of",
                " the ancient nations testify to how they",
                " met their tragic ends through turning away",
                " from truth and honesty and stubbornly persisting",
                " in their devotion to falsehood."
            ]
        },
        {
            "verse-id": "[6:12]",
            "verse": "Say, \"To whom belongs whatever is in the heavens and earth?\" Say, \"To Allah.\" He has decreed upon Himself mercy. He will surely assemble you for the Day of Resurrection, about which there is no doubt. Those who will lose themselves [that Day] do not believe.",
            "description": [
                "The subtlety of this expression should not",
                " go unnoticed. The unbelievers are asked to",
                " whom belongs whatever exists in either the",
                " heavens or on the earth. The inquirer",
                " then pauses to wait for the answer.",
                " Those questioned are themselves convinced that all",
                " belongs to God, yet while they dare",
                " not respond falsely, they are nevertheless not",
                " prepared to give the correct answer. Fearing",
                " that their response may be used as",
                " an argument against their polytheistic beliefs, they",
                " keep quiet. At this, the inquirer is",
                " told to answer the question himself and",
                " to say that all belongs to God.",
                ""
            ]
        },
        {
            "verse-id": "[6:13]",
            "verse": "And to Him belongs that which reposes by night and by day, and He is the Hearing, the Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:14]",
            "verse": "Say, \"Is it other than Allah I should take as a protector, Creator of the heavens and the earth, while it is He who feeds and is not fed?\" Say, [O Muhammad], \"Indeed, I have been commanded to be the first [among you] who submit [to Allah] and [was commanded], 'Do not ever be of the polytheists.' \"",
            "description": [
                "10. This remark contains a subtle sarcasm.",
                " Far from providing sustenance to their followers,",
                " the beings whom the polytheists set up",
                " as deities beside the true God were",
                " dependent upon them for their sustenance. No",
                " Pharaoh can maintain the pomp and splendour",
                " connected with his godhead unless his subjects",
                " pay their tax dues and make him",
                " other offerings. No deity can attract worshippers",
                " unless some of its devotees make an",
                " idol, place it in some magnificent temple,",
                " and decorate it lavishly. All these counterfeit",
                " gods are totally dependent upon their own",
                " servants. It is the Lord of the",
                " Universe alone Who is the True God,",
                " Whose godhead rests solely upon His.own power;",
                " Who needs the help of no one,",
                " whereas no one can dispense with His.",
                ""
            ]
        },
        {
            "verse-id": "[6:15]",
            "verse": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:16]",
            "verse": "He from whom it is averted that Day - [Allah] has granted him mercy. And that is the clear attainment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:17]",
            "verse": "And if Allah should touch you with adversity, there is no remover of it except Him. And if He touches you with good - then He is over all things competent.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:18]",
            "verse": "And He is the subjugator over His servants. And He is the Wise, the Acquainted [with all].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:19]",
            "verse": "Say, \"What thing is greatest in testimony?\" Say, \"Allah is witness between me and you. And this Qur'an was revealed to me that I may warn you thereby and whomever it reaches. Do you [truly] testify that with Allah there are other deities?\" Say, \"I will not testify [with you].\" Say, \"Indeed, He is but one God, and indeed, I am free of what you associate [with Him].\"",
            "description": [
                "God Himself witnesses that the Prophet (peace",
                " be on him) has been designated by",
                " Him and that what he communicated was",
                " by His command.",
                "*12). In order to",
                " bear witness to something, mere guesswork and",
                " imagination are not sufficient. What is required",
                " is knowledge on the basis of which",
                " a person can state something with full",
                " conviction. Hence. the question means: Did they",
                " really have knowledge of anyone other than",
                " God who could lay claim to man's",
                " worship and absolute service by dint of",
                " being the omnipotent sovereign, the one whose",
                " will prevailed throughout the universe?",
                "*13). The",
                " interlocutor is instructed to tell people that",
                " if they wanted to bear false witness",
                " and testify without knowledge, they could do",
                " so, but that he himself could not",
                " do something so unreasonable."
            ]
        },
        {
            "verse-id": "[6:20]",
            "verse": "Those to whom We have given the Scripture recognize it as they recognize their [own] sons. Those who will lose themselves [in the Hereafter] do not believe.",
            "description": [
                "Those who have knowledge of the Scriptures",
                " know for sure that God is One",
                " alone and that no one shares His",
                " godhead with Him. It is true that",
                " one can spot one's own child even",
                " in the midst of a large crowd",
                " of children. The same can be said",
                " about those well-versed in the Scriptures. Even",
                " if the true concept of godhead were",
                " interspersed among numerous false beliefs and concepts",
                " about God, those well-versed in the scriptural",
                " lore would be able to recognize without",
                " doubt which doctrine was true."
            ]
        },
        {
            "verse-id": "[6:21]",
            "verse": "And who is more unjust than one who invents about Allah a lie or denies His verses? Indeed, the wrongdoers will not succeed.",
            "description": [
                "This refers to those who asserted that",
                " there were also other beings which shared",
                " with God in His godhead, were possessed",
                " of divine attributes and powers, and rightly",
                " deserved to claim from man worship and",
                " absolute service. It is also a slander",
                " to claim that God has selected certain",
                " beings to be His chosen intimates and",
                " that lie has commanded - or is",
                " at least agreeable to the idea -",
                " that they should he considered to possess",
                " divine attributes, and that people should serve",
                " and revere them as they would serve",
                " and revere God, their Lord.",
                "*16). By",
                " 'signs of God' are meant the signs",
                " found within man's own being, as well",
                " as those scattered throughout the universe. They",
                " also include the signs which are manifest",
                " from the lives and achievements of the",
                " Prophets, as well as those embodied in",
                " the Scriptures. All these point towards one",
                " and the same truth - that in",
                " the entire realm of existence there is",
                " one God alone and that all else",
                " are merely His subjects. Who could be",
                " more unjust than one who, in utter",
                " disregard of all these signs, invests others",
                " than the One True God with attributes",
                " of godhead, considering them to merit the",
                " same rights as God. And does so",
                " merely on grounds of either conjecture, or",
                " speculation or out of blind adherence to",
                " the beliefs of his forefathers although there",
                " is not so much as a shred",
                " of evidence founded on true knowledge, observation",
                " or experience in support of such beliefs.",
                " Such a person subjects truth and reality",
                " to grave injustice. He also wrongs his",
                " own self and everything else in this",
                " universe with which he has to deal",
                " on the basis of this false assumption.",
                ""
            ]
        },
        {
            "verse-id": "[6:22]",
            "verse": "And [mention, O Muhammad], the Day We will gather them all together; then We will say to those who associated others with Allah, \"Where are your 'partners' that you used to claim [with Him]?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:23]",
            "verse": "Then there will be no [excuse upon] examination except they will say, \"By Allah, our Lord, we were not those who associated.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:24]",
            "verse": "See how they will lie about themselves. And lost from them will be what they used to invent.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:25]",
            "verse": "And among them are those who listen to you, but We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if they should see every sign, they will not believe in it. Even when they come to you arguing with you, those who disbelieve say, \"This is not but legends of the former peoples.\"",
            "description": [
                "It is noteworthy that God attributes to",
                " Himself all that happens in the world",
                " as a result of the laws of",
                " nature. Since these laws were made by",
                " God Himself, the effects which result from",
                " their operation are also ultimately due to",
                " the will and permission of God. The",
                " refusal on the part of unbelievers to",
                " heed the call of the Truth even",
                " when it is clear and audible stems",
                " from their obstinacy, prejudice, mental rigidity and",
                " inertia. It is a law of nature",
                " that when a man is not prepared",
                " to rise above prejudice in his quest",
                " for the Truth, his heart closes to",
                " every truth which is opposed to his",
                " desires. We can describe this condition by",
                " saying that the heart of that person",
                " has become sealed and when God describes",
                " it He does so by saying that",
                " He had sealed the heart of the",
                " person concerned. The explanation of this Paradox",
                " is that whereas we describe merely an",
                " incident, God describes its ultimate cause.",
                "*18).",
                " Whenever ignorant people are called to the",
                " Truth they are liable to say that",
                " there is nothing novel about it, that",
                " it is merely a repetition of things",
                " that have come down from the past,",
                " as if in their view every truth",
                " must be new, and whatever is old",
                " must of necessity be false, although Truth",
                " has always been one and the same",
                " and will remain so. All those who",
                " have come forward to lead people in",
                " the light of God-given knowledge have been",
                " preaching one and the same Truth from",
                " time immemorial, and all those who will",
                " benefit from this valuable source of human",
                " knowledge in the future are bound to",
                " repeat the same old truths. Novelties can",
                " be invented only by those who, being",
                " bereft of the light of Divine guidance,",
                " are incapable of perceiving the eternal Truth,",
                " preferring to weave altogether new ideas out",
                " of their imagination and to put them",
                " forward as truth."
            ]
        },
        {
            "verse-id": "[6:26]",
            "verse": "And they prevent [others] from him and are [themselves] remote from him. And they do not destroy except themselves, but they perceive [it] not.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:27]",
            "verse": "If you could but see when they are made to stand before the Fire and will say, \"Oh, would that we could be returned [to life on earth] and not deny the signs of our Lord and be among the believers.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:28]",
            "verse": "But what they concealed before has [now] appeared to them. And even if they were returned, they would return to that which they were forbidden; and indeed, they are liars.",
            "description": [
                "At that moment such a statement on",
                " their part would not be indicative of",
                " either any true change of heart or",
                " of any genuinely revised judgement based on",
                " serious reflection and reasoning. It would rather",
                " be the result of direct observation of",
                " reality at a time when even the",
                " staunchest unbeliever would find it impossible to",
                " deny it."
            ]
        },
        {
            "verse-id": "[6:29]",
            "verse": "And they say, \"There is none but our worldly life, and we will not be resurrected.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:30]",
            "verse": "If you could but see when they will be made to stand before their Lord. He will say, \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will [then] say, \"So taste the punishment because you used to disbelieve.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:31]",
            "verse": "Those will have lost who deny the meeting with Allah, until when the Hour [of resurrection] comes upon them unexpectedly, they will say, \"Oh, [how great is] our regret over what we neglected concerning it,\" while they bear their burdens on their backs. Unquestionably, evil is that which they bear.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:32]",
            "verse": "And the worldly life is not but amusement and diversion; but the home of the Hereafter is best for those who fear Allah, so will you not reason?",
            "description": [
                "This does not mean that earthly life",
                " has nothing serious about it and that",
                " it has been brought into being merely",
                " as a sport and pastime. What this",
                " observation means is that, compared with the",
                " true and abiding life of the Hereafter,",
                " earthly life seems, as it were, a",
                " sport, a transient pastime with which to",
                " amuse oneself before turning to serious business.",
                "",
                "Earthly life has been likened to a",
                " sport and pastime for another reason as",
                " well. Since Ultimate Reality is hidden in",
                " this world, the superficially minded ones who",
                " lack true perception encounter many a thing",
                " which causes them to fall a prey",
                " to misconceptions. As a result of these",
                " misconceptions such persons indulge in a variety",
                " of actions which are so blatantly opposed",
                " to reality that their life seems to",
                " consist merely of sport and pastime. One",
                " who assumes the position of a king",
                " in this world, for instance, is no",
                " different from the person who plays the",
                " part of a king on the stage",
                " of a theatre. His head is bedecked",
                " with a crown and he goes about",
                " commanding people as if he were a",
                " king, even though he has no royal",
                " authority. He may later, if the director",
                " of the theatre wishes, be either dismissed",
                " from his royal office, put into prison",
                " or even be sentenced to death Plays",
                " of this kind go on all over",
                " the world. Saints and man-made deities are",
                " deemend to respond to human supplications even",
                " though they do not have a shred",
                " of authority to do so. Again, some",
                " people try to unravel the Unseen even",
                " though to do so lies altogether beyond",
                " their reach. There are those who claim",
                " to provide sustenance to others despite the",
                " fact that they are themselves dependent on",
                " others for their own sustenance. There are",
                " still others who think that they have",
                " the power either to bestow honour and",
                " dignity on human beings or to degrade",
                " them, either to confer benefits or to",
                " harm them. Such people go about trumpeting",
                " their own glory but their own foreheads",
                " bear the stamp of their humble bondage",
                " to their Creator. By just one twist",
                " of fortune such people may fall of",
                " their pededstrals and be trampled under the",
                " feet of those upon whom they have",
                " been imposing their God-like authority.",
                "All these",
                " people come to a sudeen end with",
                " death.As soon as man crosses the boundaries",
                " of this world and steps into the",
                " Next, the reality will be fully manifest,",
                " all the misconceptions that he has entertained",
                " will be peeled away, and he will",
                " be shown the true worth of his",
                " belief and actions."
            ]
        },
        {
            "verse-id": "[6:33]",
            "verse": "We know that you, [O Muhammad], are saddened by what they say. And indeed, they do not call you untruthful, but it is the verses of Allah that the wrongdoers reject.",
            "description": [
                "The fact is that before the Prophet",
                " Muhammad (peace be on him) began to",
                " preach the message of God, all his",
                " people regarded him as truthful and trustworthy",
                " and had full confidence in his veracity.",
                " Only after he had begun to preach",
                " the message of God did they call",
                " him a liar. Even during this period",
                " none dared to say that the Prophet",
                " (peace be on him) had ever been",
                " guilty of untruthfullness in personal matters. Even",
                " his worst enemies never accused him of",
                " lying in any worldly affairs. When they",
                " did accuse him of falsehood, they did",
                " so in respect of his prophetic mission.",
                " Abu Jahl for instance, was one of",
                " his staunchest enemies. According to a tradition",
                " from 'Ali, Abu Jahl once said to",
                " the Prophet (peace be on him): 'We",
                " do not disbelieve you. We disbelieve your",
                " message.' On the occasion of the Battle",
                " of Badr, Akhnas b. Shariq asked Abu",
                " Jahl, when they were alone, to confide",
                " whether he considered Muhammad to be truthful",
                " or not. He replied: ' By God,",
                " Muhammad is a veracious person. He has",
                " never lied in all his life. But",
                " if every honorable office-liwa' (standard-bearing in war),",
                " siqayah ( provision of water to the",
                " pilgrims), hijabah (gaurdian ship of the ka'bah",
                " ) and nubuwah ( prophethood ) -",
                " were to fall to the share of",
                " the decendents of Qusayy, what would be",
                " left for the rest of the Quraysh?'*",
                " (Ibn Kathir,vol.3, pp.17-18-Ed.)",
                "Here God consoled the",
                " Prophet(peace be on him) by telling him",
                " that by charging him with falsehood the",
                " unbelievers were calling God untruthful. Since God",
                " has endured this accusation with mild forbearance,",
                " leaving them free to persist in their",
                " blasphemy, the Prophet ( peace be on",
                " him ) need not feel undue disquiet.",
                ""
            ]
        },
        {
            "verse-id": "[6:34]",
            "verse": "And certainly were messengers denied before you, but they were patient over [the effects of] denial, and they were harmed until Our victory came to them. And none can alter the words of Allah. And there has certainly come to you some information about the [previous] messengers.",
            "description": [
                "The point emphasized here is that no",
                " one has the power to change God's",
                " Law regarding the conflict between Truth and",
                " falsehood. Lovers of Truth must of necessity",
                " pass through trials and persecution so as",
                " to be gradually tempered. Their endurance, their",
                " honastyy of conviction, their readiness to sacrifice",
                " and to undertake all risk for their",
                " cause, the strength of their faith and",
                " the extent of their trust in God",
                " must be tested. They must pass through",
                " this phase of persecution to develop in",
                " thenselves those qualities which can be developed",
                " nowhere else but on earth. They are",
                " also required to defeat the forces of",
                " ignorance by virtue of their moral excellence",
                " and the nobility of their character. Only",
                " after they have established their moral superiority",
                " over their adversaries will God's help arrive.",
                " No one can secure that help before",
                " hand."
            ]
        },
        {
            "verse-id": "[6:35]",
            "verse": "And if their evasion is difficult for you, then if you are able to seek a tunnel into the earth or a stairway into the sky to bring them a sign, [then do so]. But if Allah had willed, He would have united them upon guidance. So never be of the ignorant.",
            "description": [
                "The Prophet (peace be on him) saw",
                " that even though he had spent a",
                " long time admonishing his people, they did",
                " not seem inclined to heed his call.",
                " As a result he sometimes wished for",
                " the appearance of some extraordinary sign of",
                " God that would undermine the stubbornness of",
                " his people and lead them to accept",
                " his guidance. This verse embodies God's response",
                " to the Prophet's desire. He is told",
                " not to be impatient. He must persist",
                " in his striving and continue to work.",
                " in conformity with God's directive. Had it",
                " been God's purpose to work miracles, He",
                " would have done so. But God did",
                " not consider that to be either the",
                " appropriate method for bringing to a successful",
                " completion the required intellectual and moral revolution",
                " or for the evolution of a sound,",
                " healthy civilization. Well, then, if the Prophet",
                " (peace be on him) could not bear",
                " patiently with the attitude of stubbornness and",
                " rejection prevalent among his people, and if",
                " he thought it necessary to make them",
                " witness a tangible sign of God, let",
                " him muster all his strength and try",
                " to cleave the earth, or climb a",
                " ladder to the heaven and bring forth",
                " a miracle powerful enough to change the",
                " unbelief of the unbelievers into belief. He",
                " is told, however, that in this regard",
                " he should not expect God to fulfil",
                " his wish, for such things have no",
                " place in God's scheme.",
                "*24). Had it",
                " been required that all people should be",
                " driven to the Truth, there would have",
                " been no need to send Prophets, to",
                " reveal heavenly Books, to direct believers to",
                " engage in struggles against unbelievers, and to",
                " make the message of Truth pass through",
                " the necessary stages until fulfilment is reached.",
                " The result could have been achieved by",
                " a single sign of God's creative will.",
                " God, however, did not want things to",
                " happen that way. He preferred the Truth",
                " to be set before people with its",
                " supporting arguments so that by a proper",
                " exercise of their rational judgement, they should",
                " recognize it for what it was and",
                " thereafter freely choose to embrace it as",
                " their faith. By moulding their lives in",
                " conformity with this Truth such people should",
                " demonstrate their moral superiority over the devotees",
                " of falsehood. They should continually attract men",
                " of sound morals by the force of",
                " their arguments, by the loftiness of their",
                " ideals, by the excellence of their principles",
                " and by the purity of their lives.",
                " They should thus reach their goal -",
                " the establishment of the hegemony of the",
                " true faith - by the natural and",
                " gradual escalation of strife against falsehood. God",
                " will guide them in the performance of",
                " this task and will provide them with",
                " whatever help they merit during the various",
                " stages of their struggle. But if anyone",
                " wishes to evade this natural course and",
                " wants God to obliterate corrupt ideas and",
                " to spread healthy ones in their stead,",
                " to root out a corrupt civilization and",
                " put a healthy one in its place",
                " by exercising His omnipotent will, let him",
                " know that this will not come about.",
                " The reason is that such is contrary",
                " to the scheme according to which God",
                " has created man as a responsible being,",
                " bestowed upon him a degree of power",
                " which he may exercise, granted him the",
                " freedom to choose between obedience and disobedience",
                " to God, awarded him a certain term",
                " of life in order to demonstrate his",
                " worth, and determined that at an appointed",
                " hour He will judge him for either",
                " reward or punishment in the light of",
                " his deeds."
            ]
        },
        {
            "verse-id": "[6:36]",
            "verse": "Only those who hear will respond. But the dead - Allah will resurrect them; then to Him they will be returned.",
            "description": [
                "'Those who hear' refers to those whose",
                " consciences are alive, who have not atrophied",
                " their intellect and reason, and who have",
                " not closed their hearts to the Truth",
                " out of irrational prejudice and menta! inflexibility.",
                " In contrast to such people are those",
                " who are characterized as 'dead' - who",
                " blindly follow the old familiar beaten tracks,",
                " and can never deviate from the ways",
                " they have inherited, even when these ways",
                " are plainly at variance with the Truth.",
                ""
            ]
        },
        {
            "verse-id": "[6:37]",
            "verse": "And they say, \"Why has a sign not been sent down to him from his Lord?\" Say, \"Indeed, Allah is Able to send down a sign, but most of them do not know.\"",
            "description": [
                "The word ayah here signifies a tangible",
                " miracle. The purpose of the verse is",
                " to point out that the reason for",
                " not showing a miraculous sign is not",
                " God's powerlessness. The true reason is something",
                " else which those people in their immaturity,",
                " have failed to comprehend."
            ]
        },
        {
            "verse-id": "[6:38]",
            "verse": "And there is no creature on [or within] the earth or bird that flies with its wings except [that they are] communities like you. We have not neglected in the Register a thing. Then unto their Lord they will be gathered.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:39]",
            "verse": "But those who deny Our verses are deaf and dumb within darknesses. Whomever Allah wills - He leaves astray; and whomever He wills - He puts him on a straight path.",
            "description": [
                "If they are concerned with miraculous signs",
                " in order to determine whether or not",
                " the message of the Prophet (peace be",
                " on him) is indeed true, then, let",
                " them look around with open and attentive",
                " eyes. If they actually do so they",
                " will find the world full of such",
                " signs. Let them take any species of",
                " animal or bird they like. They can",
                " reflect upon the superbness of its organic",
                " structure. They will notice how its instinctive",
                " urges are in complete conformity with its",
                " natural requirements. They will also observe how",
                " wonderfully adequate are the arrangements for providing",
                " it with nourishment; how marvellously well-determined are",
                " the limits within which -it lives; how",
                " tremendously efficient is the system under which",
                " each living creature is protected, provided for,",
                " looked after and directed towards self-fulfilment; how",
                " strictly each one is fitted into the",
                " framework of the discipline devised for it,",
                " and how very smooth is the operation",
                " of the whole system of birth, procreation",
                " and death. Were one to reflect on",
                " this alone from among the innumerable signs",
                " of God, one would perceive fully how",
                " true the teaching of the Prophet (peace",
                " he on him) is concerning the unity",
                " and other attributes of God and how",
                " necessary it is to live a righteous",
                " life in conformity with the concept of",
                " God propounded by him. But their eyes",
                " were neither open to perceive the Truth",
                " nor their ears open to heed admonition.",
                " Instead, they remained ignorant, preferring to be",
                " entertained by the performance of wondrous feats.",
                "",
                "*28). God's act of misguiding a man",
                " consists in not enabling one who cherishes",
                " his ignorance to observe the signs of",
                " God. The fact is that if a",
                " biased person - one who has no",
                " real love of the Truth - were",
                " to observe the signs of God, he",
                " might still fail to perceive it. Indeed,",
                " all those things which cause misconception and",
                " confusion would probably continue to alienate him",
                " from it. God's act of true guidance",
                " consists in enabling a seeker after the",
                " Truth to benefit from the sources of",
                " true knowledge, so that he constantly discovers",
                " sign after sign, leading him ultimately to",
                " the Truth.",
                "A myriad of cases are",
                " encountered daily to illustrate this. We notice",
                " that a great many people pass inattentively",
                " over the countless signs of God that",
                " are scattered all over the world, and",
                " ignore even those signs which are manifest",
                " in human beings as well as in",
                " animals. It is little wonder, then, that",
                " they derive no lesson from all these",
                " signs. There are many who study zoology,",
                " botany, biology, geology, astronomy, physiology, anatomy and",
                " other branches of natural science. Others study",
                " history, archaeology and sociology. During the course",
                " of such studies they come across many",
                " signs of God which, if they cared",
                " to look at them in the correct",
                " perspective, might fill their hearts with faith.",
                " But since they commence their study with",
                " a bias, and are actuated only by",
                " the desire to acquire earthly advantages, they",
                " fail to discover the signs which could",
                " lead them to the Truth. On the",
                " contrary, each of those very signs of",
                " God contributes to pushing them towards atheism,",
                " materialism and naturalism. At the same time,",
                " the world is not empty of those",
                " truly wise ones who view the universe",
                " with open eyes. For them even the",
                " most ordinary phenomenon of the universe directs",
                " them to God."
            ]
        },
        {
            "verse-id": "[6:40]",
            "verse": "Say, \"Have you considered: if there came to you the punishment of Allah or there came to you the Hour - is it other than Allah you would invoke, if you should be truthful?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:41]",
            "verse": "No, it is Him [alone] you would invoke, and He would remove that for which you invoked Him if He willed, and you would forget what you associate [with Him].",
            "description": [
                "Attention is now drawn towards another sign",
                " - one observable even in the lives",
                " of those who deny the Truth. When",
                " either some great calamity befalls a man",
                " or when death starkly stares him in",
                " the face, it is only to God",
                " that he turns for refuge. On such",
                " occasions even the staunchest polytheists forget their",
                " false gods and cry out to the",
                " One True God, and even the most",
                " rabid atheists stretch out their hands in",
                " prayer to Him. This phenomenon is mentioned",
                " here in order to draw an instructive",
                " lesson. It shows that devotion to God",
                " and monotheism are ingrained in the human",
                " soul. No matter how overlaid this truth",
                " might be, some day it shakes off",
                " man's heedlessness and ignorance and manifests itself",
                " fully. It was the observation of this",
                " sign which had led 'Ikrimah, the son",
                " of Abu Jahl, to the true faith.",
                " For when Makka was conquered at the",
                " hands of the Prophet (peace be on",
                " him), 'Ikrimah fled to Jeddah and sailed",
                " from there towards Abyssinia. During the voyage",
                " the boat ran into a severe storm",
                " which threatened to capsize it. At first",
                " people began calling on their gods and",
                " goddesses. Later on, when the storm grew",
                " even worse and the passengers were sure",
                " that the boat would sink, they began",
                " to feel it was time to call",
                " on God alone, for He alone could",
                " save them. This opened the eyes of",
                " 'Ikrimah, whose heart cried out to him",
                " that if there was no effective helper",
                " for them in that situation, how could",
                " there he one elsewhere? He also recalled",
                " that this was precisely what the Prophet",
                " (peace be on him) had constantly told",
                " people, and that it was precisely because",
                " of this preaching that they had been",
                " engaged in unnecessary violent conflict with him.",
                " This was a turning-point in 'Ikrimah's life.",
                " He instantly made up his mind that",
                " if he survived the storm he would",
                " go straight to the Prophet Muhammad (peace",
                " be on him) and place his hand",
                " in his, binding himself in allegiance. Thereafter",
                " he not only remained true to his",
                " word by becoming a Muslim, but spent",
                " the rest of his life struggling in",
                " the cause of Islam."
            ]
        },
        {
            "verse-id": "[6:42]",
            "verse": "And We have already sent [messengers] to nations before you, [O Muhammad]; then We seized them with poverty and hardship that perhaps they might humble themselves [to Us].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:43]",
            "verse": "Then why, when Our punishment came to them, did they not humble themselves? But their hearts became hardened, and Satan made attractive to them that which they were doing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:44]",
            "verse": "So when they forgot that by which they had been reminded, We opened to them the doors of every [good] thing until, when they rejoiced in that which they were given, We seized them suddenly, and they were [then] in despair.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:45]",
            "verse": "So the people that committed wrong were eliminated. And praise to Allah, Lord of the worlds.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:46]",
            "verse": "Say, \"Have you considered: if Allah should take away your hearing and your sight and set a seal upon your hearts, which deity other than Allah could bring them [back] to you?\" Look how we diversify the verses; then they [still] turn away.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:47]",
            "verse": "Say, \"Have you considered: if the punishment of Allah should come to you unexpectedly or manifestly, will any be destroyed but the wrongdoing people?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:48]",
            "verse": "And We send not the messengers except as bringers of good tidings and warners. So whoever believes and reforms - there will be no fear concerning them, nor will they grieve.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:49]",
            "verse": "But those who deny Our verses - the punishment will touch them for their defiant disobedience.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:50]",
            "verse": "Say, [O Muhammad], \"I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel. I only follow what is revealed to me.\" Say, \"Is the blind equivalent to the seeing? Then will you not give thought?\"",
            "description": [
                "Feeble-minded people have always entertained the foolish",
                " misconception that the more godly a man",
                " is, the more liberated he should be",
                " from the limitations of human nature. They",
                " expect a godly person to be able",
                " to work wonders. By a mere sign",
                " of his hand, whole mountains should be",
                " transmuted into gold. At his command, the",
                " earth should begin to throw up all",
                " its hidden treasures. He should have miraculous",
                " access to all relevant facts about people.",
                " He should be able to point out",
                " the locations of things which have been",
                " lost, and show how they can be",
                " retrieved. He should be able to predict",
                " whether or not a patient will survive",
                " his disease; whether a pregnant woman will",
                " deliver a boy or a girl. Moreover,",
                " he should be above all human disabilities",
                " and limitations. How can a genuinely godly",
                " person feel hunger or thirst? How can",
                " he be overcome by sleep? How can",
                " he have a wife and children? How",
                " can he engage in buying and selling",
                " to meet his material requirements? How can",
                " he be impelled by force of circumstances",
                " to resort to such mundane acts as",
                " making money? How can he feel the",
                " pinch of poverty and paucity of resources?",
                " False conceptions such as these dominated the",
                " minds of the contemporaries of the Prophet",
                " (peace be on him). When they heard",
                " of his claim, in order to test",
                " his veracity they asked him regarding things",
                " that lie beyond the ken of human",
                " perception and to work wonders, and blamed",
                " him when they saw him engaged in",
                " such acts as eating and drinking, and",
                " taking care of his wife and children,",
                " and walking about the bazaars like other",
                " ordinary human beings. It is misconceptions such",
                " as these that this verse seeks to",
                " remove.",
                "*32). The statement of a Prophet",
                " in such matters amounts to a testimony",
                " based on first-hand observation. For the truths",
                " which a Prophet propounds are those which",
                " he himself has observed and experienced and",
                " which have been brought within the range",
                " of his knowledge by means of revelation.",
                " On the contrary, those who are opposed",
                " to the truths propounded by the Prophets",
                " are blind since the notions they entertain",
                " are based either on guess-work and conjecture",
                " or on blind adherence to ideas hallowed",
                " by time. Thus the difference between a",
                " Prophet and his opponents is as that",
                " between a man who has sound vision",
                " and a man who is blind. Obviously",
                " the former is superior, by dint of",
                " this gift of knowledge from God rather",
                " than because he has access to hidden",
                " treasures, because of his knowledge of the",
                " unseen world, and because of his freedom",
                " from physical limitations."
            ]
        },
        {
            "verse-id": "[6:51]",
            "verse": "And warn by the Qur'an those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.",
            "description": [
                "Those who are too deeply immersed in",
                " the allurements of earthly life to think",
                " either of death or of their being",
                " brought to stand before God for His",
                " judgement can hardly benefit from such admonitions.",
                " Likewise, such admonitions can have no wholesome",
                " effect on those who cherish the illusion",
                " that because of their attachment to some",
                " holy personage who will intercede on their",
                " behalf, they will come to no harm",
                " in the Hereafter. The same applies to",
                " those who believe that someone has already",
                " obtained their redemption by expiating their sins.",
                " The Prophet (peace be on him) is",
                " therefore asked to disregard such persons and",
                " to attend to those who are conscious,",
                " those with no false illusions. Only these",
                " people are susceptible to admonitions and can",
                " be expected to reform themselves."
            ]
        },
        {
            "verse-id": "[6:52]",
            "verse": "And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.",
            "description": [
                "One of the objections raised by the",
                " chiefs and the affluent members of the",
                " Quraysh was that the Prophet (peace be",
                " on him) had gathered around him a",
                " host of slaves, clients (mawali) and others",
                " belonging to the lower strata of society.",
                " They used to scoff at the fact",
                " that men of such humble social standing",
                " as Bilal, 'Ammar. Suhayb and Khabbab had",
                " joined his ranks. They wondered if they",
                " happened to be the only chosen ones",
                " of the Quraysh in the sight of",
                " God! They not only poked fun at",
                " the financial distress of these people but",
                " also attacked them for any weakness of",
                " character they had before accepting Islam. They",
                " went about saying sarcastically that those who",
                " had been such and such in the",
                " past had now become part of the",
                " 'chosen' community.",
                "*35). That is, everyone is",
                " personally responsible for his deeds, whether good",
                " or bad. The Prophet (peace he on",
                " him) is told that he will neither",
                " have to explain to God the conduct",
                " of the converts nor will the latter",
                " be required to explain his conduct. They",
                " can neither usurp his good deeds, nor",
                " transfer their own misdeeds to his account.",
                " There is, therefore, no reason for the",
                " Prophet (peace be on him) to alienate",
                " those who approach him as seekers after",
                " Truth."
            ]
        },
        {
            "verse-id": "[6:53]",
            "verse": "And thus We have tried some of them through others that the disbelievers might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?",
            "description": [
                "By enabling the poor and the indigent,",
                " the people who have a low station",
                " in society to precede others in believing,",
                " God has put those who wax proud",
                " of wealth and honour to a severe",
                " test."
            ]
        },
        {
            "verse-id": "[6:54]",
            "verse": "And when those come to you who believe in Our verses, say, \"Peace be upon you. Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful.\"",
            "description": [
                "Several of those who came to believe",
                " in the Prophet (peace be on him)",
                " had committed many serious sins before they",
                " embraced Islam. Even though their lives had",
                " altogether changed following their conversion, the opposition",
                " continued to play up the weaknesses and",
                " misdeeds of their past life. The Prophet",
                " (peace he on him) is asked to",
                " comfort such persons and to tell them",
                " that God does not punish those who",
                " sincerely repent their sins and mend their",
                " ways."
            ]
        },
        {
            "verse-id": "[6:55]",
            "verse": "And thus do We detail the verses, and [thus] the way of the criminals will become evident.",
            "description": [
                "'And thus' refers to the whole of",
                " the foregoing discussion, beginning with verse 37:",
                " 'And they say: Why has no miraculous",
                " sign been sent down to him?' The",
                " purpose of this remark is to stress",
                " that the persistence of some people in",
                " their denial of the Truth and in",
                " their disbelief, in spite of a host",
                " of unmistakably clear signs and arguments, was",
                " sufficient to prove beyond doubt that they",
                " were merely a bunch of criminals. If",
                " they persisted in error and transgression it",
                " was neither through any lack of strong",
                " arguments in support of the Truth nor,",
                " conversely, because of strong arguments in support",
                " of falsehood. The reason was rather that",
                " they had delilibrately chosen to fall into",
                " error and transgression."
            ]
        },
        {
            "verse-id": "[6:56]",
            "verse": "Say, \"Indeed, I have been forbidden to worship those you invoke besides Allah.\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:57]",
            "verse": "Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient. The decision is only for Allah. He relates the truth, and He is the best of deciders.\"",
            "description": [
                "This alludes to God's punishment. The adversaries",
                " questioned why it was that they had",
                " openly rejected a Prophet sent by God,",
                " but had not been struck down by",
                " God's wrarth? They said that the fact",
                " of his appointment by God meant that",
                " anyone who either disbelieved or insulted him",
                " would, at once, be either plunged into",
                " the earth or struck by lightning. And",
                " yet, they pointed out, the Messenger of",
                " God and his followers faced new sufferings",
                " and humiliations whereas those who abused and",
                " persecuted him enjoyed prosperity."
            ]
        },
        {
            "verse-id": "[6:58]",
            "verse": "Say, \"If I had that for which you are impatient, the matter would have been decided between me and you, but Allah is most knowing of the wrongdoers.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:59]",
            "verse": "And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:60]",
            "verse": "And it is He who takes your souls by night and knows what you have committed by day. Then He revives you therein that a specified term may be fulfilled. Then to Him will be your return; then He will inform you about what you used to do.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:61]",
            "verse": "And He is the subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers take him, and they do not fail [in their duties].",
            "description": [
                "The angels who keep watch and maintain",
                " a record of everything, i.e. all their",
                " movements, deeds and so on."
            ]
        },
        {
            "verse-id": "[6:62]",
            "verse": "Then they His servants are returned to Allah, their true Lord. Unquestionably, His is the judgement, and He is the swiftest of accountants.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:63]",
            "verse": "Say, \"Who rescues you from the darknesses of the land and sea [when] you call upon Him imploring [aloud] and privately, 'If He should save us from this [crisis], we will surely be among the thankful.' \"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:64]",
            "verse": "Say, \"It is Allah who saves you from it and from every distress; then you [still] associate others with Him.\"",
            "description": [
                "That God alone possesses all power and",
                " authority, and has full control over the",
                " things which cause either benefit or harm",
                " to men, and that He alone holds",
                " the reins of their destiny are facts",
                " to which there is ample testimony in",
                " man's own being. For instance, whenever man",
                " is faced with a really hard time,",
                " and when the resources upon which he",
                " normally fails back seem to fail him,",
                " he instinctively turns to God. In spite",
                " of such a clear sign, people set",
                " up partners to God without any shred",
                " of evidence that anyone other than God",
                " has any share in His power and",
                " authority."
            ]
        },
        {
            "verse-id": "[6:65]",
            "verse": "Say, \"He is the [one] Able to send upon you affliction from above you or from beneath your feet or to confuse you [so you become] sects and make you taste the violence of one another.\" Look how We diversify the signs that they might understand.",
            "description": [
                "God's punishment can strike in an instant.",
                " This is the warning to those who,",
                " supposing such punishment to he remote, were",
                " growing bolder in their hostility towards the",
                " Truth. They could be destroyed in a",
                " moment by a hurricane. Just a few",
                " earthquake trernors could raze villages and cities",
                " to the ground. Likewise, a few spark,",
                " of hostility could ultimately wreak such havoc",
                " among tribes. nations and countries that bloodshed",
                " and lawlessness plague them for years on",
                " end. Hence if they are spared punishments",
                " for a while that should not drug",
                " them to heedlessness and lead them to",
                " live in total disregard of distinctions between",
                " right and wrong. They should rather he",
                " grateful that God had given thern respite",
                " and by means of a number of",
                " signs He was making it possible for",
                " thern to recognize the Truth and foliow",
                " it."
            ]
        },
        {
            "verse-id": "[6:66]",
            "verse": "But your people have denied it while it is the truth. Say, \"I am not over you a manager.\"",
            "description": [
                "A Prophet is neither required to compel",
                " People to see what they are not",
                " prepared to see nor to force into",
                " their hearts what they fail to comprehend.",
                " It is not a Prophet's task to",
                " chastise people for failing to see and",
                " comprehend the Truth. His task is merely",
                " to proclaim Truth as distinct from falsehood.",
                " If people fail thereafter to accept it,",
                " they will be overwhelmed by the very",
                " misfortunes against which that Prophet had warned.",
                ""
            ]
        },
        {
            "verse-id": "[6:67]",
            "verse": "For every happening is a finality; and you are going to know.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:68]",
            "verse": "And when you see those who engage in [offensive] discourse concerning Our verses, then turn away from them until they enter into another conversation. And if Satan should cause you to forget, then do not remain after the reminder with the wrongdoing people.",
            "description": [
                "In case the Muslims fail to remember",
                " this directive and mistakenly continue to remain",
                " in the company of those who were",
                " indulging in making fun of their faith,",
                " they should withdraw from such company as",
                " soon as they remember this directive."
            ]
        },
        {
            "verse-id": "[6:69]",
            "verse": "And those who fear Allah are not held accountable for the disbelievers at all, but [only for] a reminder - that perhaps they will fear Him.",
            "description": [
                "Those who avoid disobedience to God will",
                " not be held responsible for the errors",
                " of those who disobey. This being the",
                " case, the former have no justification for",
                " taking it upon themselves to persuade the",
                " latter to obedience or to consider themselves",
                " obliged to answer all their questions, however",
                " absurd and flimsy, until the Truth is",
                " forced down their throats. Their duty is",
                " merely to admonish and place the Truth",
                " before those whom they find stumbling about",
                " in error. If there is no response",
                " to this call except remonstration and obstinate",
                " argument they are under no obligation to",
                " waste their time and energy on them.",
                " They should rather devote their time and",
                " energy to instructing and admonishing those who",
                " have an urge to seek out the",
                " Truth."
            ]
        },
        {
            "verse-id": "[6:70]",
            "verse": "And leave those who take their religion as amusement and diversion and whom the worldly life has deluded. But remind with the Qur'an, lest a soul be given up to destruction for what it earned; it will have other than Allah no protector and no intercessor. And if it should offer every compensation, it would not be taken from it. Those are the ones who are given to destruction for what they have earned. For them will be a drink of scalding water and a painful punishment because they used to disbelieve.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:71]",
            "verse": "Say, \"Shall we invoke instead of Allah that which neither benefits us nor harms us and be turned back on our heels after Allah has guided us? [We would then be] like one whom the devils enticed [to wander] upon the earth confused, [while] he has companions inviting him to guidance, [calling], 'Come to us.' \" Say, \"Indeed, the guidance of Allah is the [only] guidance; and we have been commanded to submit to the Lord of the worlds.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:72]",
            "verse": "And to establish prayer and fear Him.\" And it is He to whom you will be gathered.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:73]",
            "verse": "And it is He who created the heavens and earth in truth. And the day He says, \"Be,\" and it is, His word is the truth. And His is the dominion [on] the Day the Horn is blown. [He is] Knower of the unseen and the witnessed; and He is the Wise, the Acquainted.",
            "description": [
                "It has been asserted again and again",
                " in the Qur'an that God created the",
                " heavens and the earth 'in truth'. This",
                " covers a wide range of meanings:",
                "First,",
                " that the heavens and the earth have",
                " not been created just for the fun",
                " of it. This existence is not a",
                " theatrical play. This world is not a",
                " child's toy with which to amuse oneself",
                " as long as one wishes before crushing",
                " it to bits and throwing it away.",
                " Creation is rather an act of great",
                " seriousness. A great objective motivates it, and",
                " a wise purpose underlies it. Hence, after",
                " the lapse of a certain stage it",
                " is necessary for the Creator to take",
                " full account of the work that has",
                " been done and to use those results",
                " as the basis for the next stage.",
                " This is stated at various places in",
                " the Qur'an in the following manner:",
                "Our",
                " Lord, You did not create this in",
                " vain (Surah Al 'Imran 3:191).",
                "And We",
                " did not create the heavens and the",
                " earth and whatever lies in between them",
                " playfully (Surah Al-Anbiya' 21:16).",
                "And did you",
                " think that We created you out of",
                " play and that you will not be",
                " brought back to Us? (Surah al-Mu'minun 23:115).",
                "",
                "Second, it means that God has created",
                " this entire system of the universe on",
                " solid foundations of truth. The whole of",
                " the universe is based on justice, wisdom",
                " and truth. Hence, there is no scope",
                " in thesystem for falsehood to take root",
                " and prosper. The phenomenon of the prosperity",
                " of falsehood which we observe, is to",
                " be ascribed to the will of God,",
                " Who grants the followers of falsehood the",
                " opportunity, if they so wish, to expend",
                " their efforts in promoting unrighteousness, injustice and",
                " untruth. In the end, however, the earth",
                " wfll throw up all the seeds of",
                " untruth that have been sown, and in",
                " the final reckoning every follower of falsehood",
                " will see that the efforts he devoted",
                " to cultivating and watering this pernicious tree",
                " have all gone to waste.",
                "Third, it",
                " means that God has founded the universe",
                " on the basis of right, and it",
                " is on the ground of being its",
                " Creator that He governs it. His command",
                " in the universe is supreme since He",
                " alone has the right to govern it,",
                " the universe being nothing but His creation.",
                " If anyone else's commands seem to be",
                " carried out in this world, this should",
                " not cause any misunderstanding. For in reality",
                " the will of no one prevails, and",
                " cannot prevail in the universe, for no",
                " one has any right to enforce his",
                " will.",
                "*47). This does not mean that",
                " the present dominion is not His. The",
                " purpose of this statement is rather to",
                " stress that when the veil which keeps",
                " things covered during the present phase of",
                " existence is lifted and the Truth becomes",
                " fully manifest, it will become quite clear",
                " that all those who seemed or were",
                " considered to possess power and authority are",
                " absolutely powerless, and that the true dominion",
                " belongs to the One True God Who",
                " created the universe.",
                "*48). In what manner",
                " the Trumpet will be blown is difficult",
                " for us to grasp.What we know through",
                " the Qur'an is that on the Day",
                " of Judgement the Trumpet will be blown",
                " on God's command, whereupon all will die.",
                " Then after an indefinite period of time",
                " - a period that is known to",
                " God alone - the second Trumpet will",
                " be blown, whereupon all people of all",
                " epochs will be resurrected and will find",
                " themselves on the Plane of the Congregation.",
                "",
                "Thus, when the first Trumpet is blown",
                " the entire order of the universe will",
                " be disrupted, while on the blowing of",
                " the second Trumpet a fresh order will",
                " be established, in a new form and",
                " with a new set of laws governing",
                " it.",
                "*49). Ghayb signifies all that is",
                " hidden from, and is beyond the ken",
                " of man's knowledge. Shahadah, as opposed to",
                " ghayb, signifies that which is manifest and",
                " thus can be known to man."
            ]
        },
        {
            "verse-id": "[6:74]",
            "verse": "And [mention, O Muhammad], when Abraham said to his father Azar, \"Do you take idols as deities? Indeed, I see you and your people to be in manifest error.\"",
            "description": [
                "The incident relating to Abraham (peace be",
                " on him) is adduced in order to",
                " confirm and reinforce the view that just",
                " as Muhammad (peace he on him) and",
                " his Companions - thanks to the guidance",
                " vouchsafed by God - had denounced polytheism",
                " and had turned away from all false",
                " gods, bowing their heads in obedience to",
                " the One True Lord of the universe,",
                " so had been done by Abraham in",
                " his time. In the same way as",
                " ignorant people were then opposing the Prophet",
                " Muhammad (peace be on him) and those",
                " who believed in him, Abraham, too, had",
                " been opposed in his day by the",
                " people among whom he lived. Furthermore, the",
                " answer Abraham gave to his people in",
                " the past can also be given by",
                " Muhammad (peace be on him) and his",
                " followers, for he was on the same",
                " path as Noah, Abraham and the other",
                " Prophets who had descended from Abraham. Those",
                " who had refused to follow the Prophet",
                " (peace be on him) should therefore take",
                " note that they had deviated from the",
                " way of the Prophets and were lost",
                " in error.",
                "At this point it should",
                " also be noted that Abraham was generally",
                " acknowledged by the Arabs to be their",
                " patriarch and their original religious leader. The",
                " Quraysh, in particular, were proud of their",
                " devotion to Abraham, of being his progeny",
                " and of being servants to the shrine",
                " built by him. Hence, the mention of",
                " Abraham's doctrine of monotheism, of his denunciation",
                " of polytheism and his remonstration with his",
                " polytheistic people, amounted to demolishing the very",
                " basis on which the Quraysh had prided",
                " themselves. It also amounted to destroying the",
                " confidence of the people of Arabia in",
                " their polytheistic religion. This also proved to",
                " them that the Muslims stood in the",
                " shoes of Abraham himself, whereas their own",
                " position was that of an ignorant nation",
                " which had remonstrated with Abraham out of",
                " ignorance and folly."
            ]
        },
        {
            "verse-id": "[6:75]",
            "verse": "And thus did We show Abraham the realm of the heavens and the earth that he would be among the certain [in faith]",
            "description": [
                "**51). The adversaries are told that they",
                " can observe God's signs in the phenomena",
                " of the universe, just as Abraham could.",
                " The difference is that they see nothing,",
                " as if they were blind, whereas Abraham",
                " saw with open eyes. The sun, moon",
                " and stars which rise and set before",
                " their eyes day after day and night",
                " after night witness them as misguided at",
                " their setting as at their rising. Yet",
                " the same signs were observed by the",
                " perceptive Abraham, and the physical phenomena helped",
                " him arrive at the Truth.",
                "*52). To",
                " obtain a full understanding of this section,",
                " as well as of those verses which",
                " mention the dispute between Abraham and his",
                " people, it is necessary to cast a",
                " glance at the religious and cultural condition",
                " of the latter. Thanks to recent archaeological",
                " discoveries, not only has the, city where",
                " Abraham is said to have been born",
                " been located, but a good deal of",
                " information is also available about the condition",
                " of the people of that area during",
                " the Abrahamic period. We reproduce below a",
                " summary of the conclusions which Sir Leonard",
                " Wooley arrived at as a result of",
                " the researches embodied in his work, Abraham",
                " (London, 1935).",
                "It is estimated that around",
                " 2100 B.C., which is now generally accepted",
                " by scholars as the time of the",
                " advent of Abraham, the population of the",
                " city of Ur was at least two",
                " hundred and fifty thousand, maybe even five",
                " hundred thousand. The city was a large",
                " industrial and commercial metropolis. Merchandise was brought",
                " to Ur from places as far away",
                " as Palmir and Nilgiri in one direction,",
                " and in the other it had developed",
                " trade relations with Anatolia. The state, of",
                " which this city was the capital, extended",
                " a little beyond the boundaries of modern",
                " Iraq in the north, and exceeded its",
                " present borders further to the west. The",
                " great majority of the population were traders",
                " and craftsmen. The inscriptions of that period,",
                " which have been discovered in the course",
                " of archaeological research, make it clear that",
                " those people had a purely materialistic outlook",
                " on life. Their greatest concern was to",
                " earn the maximum amount of wealth and",
                " enjoy the highest degree of comfort and",
                " luxury. Interest was rampant among them and",
                " their devotion to money-making seemed all-absorbing. They",
                " looked at one another with suspicion and",
                " often resorted to litigation. In their prayers",
                " to their gods, too, they generally asked",
                " for longer life, prosperity and greater commercial",
                " success, rather than for spiritual growth, God's",
                " pardon and reward in the Hereafter.",
                "The",
                " population comprised three classes of people: (1)",
                " amelu, the priests, the government and military",
                " officers; (2) mushkinu, the craftsmen and farmers;",
                " and (3) the slaves.",
                "The people of",
                " the first class mentioned, i.e. amelu, enjoyed",
                " special privileges. In both criminaI and civil",
                " matters, their rights were greater than those",
                " of the others, and their lives and",
                " property were deemed to be of higher",
                " value. It was in such a city",
                " and in such a society that Abraham",
                " first saw the light of day. Whatever",
                " information we possess with regard to him",
                " and his family through the Talmud shows",
                " that he belonged to the amelu class",
                " and that his father was the highest",
                " functionary of the state. (See also Towards",
                " Understanding the Qur'an, vol. 1, Surah 2,",
                " n.290.)",
                "In the inscriptions of Ur there",
                " are references to about five thousand deities.",
                " Each city had its own deity. Each",
                " city had a chief deity which it",
                " considered its chief protector and, therefore, that",
                " deity was considered worthy of greater reverence",
                " than all the others. 'The chief deity",
                " of Ur was Nannar (the moon god),",
                " and it is for this reason that",
                " the city later became known as Kamarina.*",
                " The other major city was Larsa, which",
                " replaced Ur as the capital of the",
                " kingdom. Its chief deity was Shamash (the",
                " sun god). Under these major deities there",
                " was a myriad of minor deities which",
                " had generally been chosen from among the",
                " heavenly bodies - stars and planets. People",
                " considered them responsible for granting their innumerable",
                " minor prayers. Idols had been carved in",
                " the image of these celestial and terrestrial",
                " gods and goddesses and were made objects",
                " of ritual worship.",
                "*Qamar is the Arabic",
                " word for 'moon'- Ed.",
                "The idol of",
                " Nannar had been placed in a magnificent",
                " building on the top of the highest",
                " hill. Close to it was the temple",
                " of Nin-Gal, the wife of Nannar. The",
                " temple of Nannar resembled a royal palace.",
                " Every night a female worshipper went to",
                " its bedroom, adorned as a bride. A",
                " great number of women had been consecrated",
                " in the name of this deity and",
                " their position was virtually that of religious",
                " prostitutes. The woman who would sacrifice her",
                " virginity for the sake of her 'god'",
                " was held in great esteem. For a",
                " woman to give herself to some unrelated",
                " person 'for the sake of God' was",
                " considered a means to salvation. Needless to",
                " say, it was generally the priests who",
                " made most use of this institution. Nannar",
                " was not merely a deity, but the",
                " biggest landlord, the biggest trader, the biggest",
                " industrialist and the most powerful ruler. Many",
                " orchards, buildings and huge estates had been",
                " consecrated to his temple. In addition to",
                " this, cereals, milk, gold, cloth, etc., were",
                " brought as offerings to the temple by",
                " peasants, landlords and merchants, and there was",
                " a large staff in the temple to",
                " receive the offerings. Many a factory had",
                " been established on behalf of the temple.",
                " Large-scale trading was also carried out on",
                " its behalf. All these activities were conducted",
                " by the priests in the name of",
                " the deity. Moreover, the country's main court",
                " was also located in the temple. The",
                " priests functioned as judges and their judgements",
                " were equated with those of God. The",
                " authority of the royal family was derived",
                " from Nannar. The concept was that Nannar",
                " was the true sovereign and that the",
                " ruler of the country governed merely on",
                " his behalf. Because of this relationship, the",
                " king himself was raised to the rank",
                " of a deity and was worshipped.",
                "The",
                " founder of the dynasty which ruled over",
                " Ur at the time of Abraham was",
                " Ur-Nammu. In 2300 B.C. he had established",
                " an extensive kingdom, stretching from Susa in",
                " the east to Lebanon in the west.",
                " Hence the dynasty acquired the name 'Nammu',",
                " which became Nimrud in Arabic. After the",
                " emigration of Abraham, both the ruling dynasty",
                " and the nation of Ur were subjected",
                " to a succession of disasters. Firstly, the",
                " Elamites sacked Ur and captured Nimrud along",
                " with the idols of Nannar. Later on,",
                " an Elamite state was established in Larsa",
                " which governed Ur as well. Later still,",
                " Babylon prospered under a dynasty of Arabian",
                " origin and both Larsa and Ur came",
                " under its hegemony. These disasters shook the",
                " people of Ur's faith in Nannar, for",
                " he had failed to protect them.",
                "It",
                " is difficult to say much, with certainty,",
                " about the extent of the subsequent impact",
                " of the teachings of Abraham on these",
                " people. The laws which were codified by",
                " the Babylonian King Hammurabi in 1910 B.C.",
                " show the impress of the prophetic influence,",
                " whether direct or indirect. An inscription of",
                " this code was discovered in 1902 by",
                " a French archaeologist and its English translation",
                " by C. H. W. John was published",
                " in 1903 under the title The Oldest",
                " Code of Law. Many articles of this",
                " code, both fundamental principles and substantive laws,",
                " bear some resemblance to the Mosaic Law.",
                "",
                "If the conclusions of these archaeological researchers",
                " are correct, it becomes quite evident that",
                " polytheism did not consist merely of a",
                " set of religious beliefs and polytheistic rites,",
                " it rather provided the foundation on which",
                " the entire order of economic, cultural, political",
                " and social life rested. Likewise, the monotheistic",
                " mission which was undertaken by Abraham was",
                " not merely directed against the practice of",
                " idol-worship. It had far wider implications, so",
                " much so that it affected the position",
                " of the royal family both as rulers",
                " and deities. It also affected the social,",
                " economic and, political status and interests of",
                " the priestly class, and the aristocracy in",
                " general, and in fact the entire fabric",
                " of the social life of the kingdom.",
                " To accept the teaching of Abraham meant",
                " that the entire edifice of the existing",
                " society should be pulled down and raised",
                " anew on the basis of belief in",
                " the One God. Hence, as soon as",
                " Abraham launched his mission, ordinary people as",
                " well as the privileged classes, ordinary devotees",
                " as well as Nimrud. rose at once",
                " to oppose and suppress it."
            ]
        },
        {
            "verse-id": "[6:76]",
            "verse": "So when the night covered him [with darkness], he saw a star. He said, \"This is my lord.\" But when it set, he said, \"I like not those that disappear.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:77]",
            "verse": "And when he saw the moon rising, he said, \"This is my lord.\" But when it set, he said, \"Unless my Lord guides me, I will surely be among the people gone astray.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:78]",
            "verse": "And when he saw the sun rising, he said, \"This is my lord; this is greater.\" But when it set, he said, \"O my people, indeed I am free from what you associate with Allah.",
            "description": [
                "Here some light is thrown on the",
                " mental experience through which Abraham passed in",
                " the beginning and which led him to",
                " an understanding of the Truth before prophethood",
                " was bestowed on him. This experience shows",
                " how a right-thinking and sound-hearted man, who",
                " had opened his eyes in a purely",
                " polytheistic environment and had received no instruction",
                " in monotheism, was ultimately led to discover",
                " the Truth by careful observation of, and",
                " serious reflection on the phenomena of the",
                " universe. The account of the conditions prevailing",
                " among the people of Abraham shows that",
                " when he began to think seriously the",
                " scene was dominated by the worship of",
                " the heavenly bodies - the moon, the",
                " sun and the stars. It was natural,",
                " therefore, that when Abraham began his quest",
                " for the Truth, he should have been",
                " faced with the question: Is it possible",
                " that any of these - the sun,",
                " the moon and the stars - is",
                " God? He concentrated his reflection on this",
                " central question and by observing that all",
                " the gods of his nation were bound",
                " by a rigid law under which they",
                " moved about like slaves, he concluded that",
                " those so-called gods were not possessed of",
                " even a shadow of the power of",
                " the One True Lord, Who alone had",
                " created them all and had yoked them",
                " to serve His will.",
                "The Qur'anic passage",
                " describing Abraham's reactions on observing first a",
                " star, then the moon, and finally the",
                " sun, has puzzled some readers because the",
                " words seem to suggest that Abraham had",
                " never before witnessed these common phenomena. This",
                " misconception has made the whole narration such",
                " a riddle for some scholars that they",
                " could only solve it by inventing the",
                " strange anecdote that Abraham was born and",
                " grew to maturity in a cave and",
                " was thus deprived of the opportunity to",
                " observe the heavenly bodies. What is said,",
                " however, is so plain that one need",
                " not fall back on any such incident",
                " in order to comprehend it. It is",
                " well known, for instance, that when Newton",
                " saw an apple fall from a tree",
                " in his orchard this incident instantly raised",
                " in his mind the question: Why do",
                " things always fall to the ground? As",
                " a result of his reflection on this",
                " question he arrived at his theory of",
                " gravity. On reading this incident one might",
                " wonder if Newton had never before seen",
                " anything fall to the ground! Obviously, he",
                " must have seen things fall. For what",
                " reason, then, should the failing of an",
                " apple cause in his mind a reaction",
                " quite different irom those caused by hundreds",
                " of earlier observations of similar things failing?",
                " The answer is that a reflecting mind",
                " does not react uniformly to similar observations.",
                " A man may observe something over and",
                " over again without this observation creating any",
                " stir in his mind, but then there",
                " comes a moment when suddenly the same",
                " observation agitates his mind and his mental",
                " faculty begins to work in a different",
                " direction. It may also happen that while",
                " a man's mind is wrestling with a",
                " problem, he encounters something which is otherwise",
                " quite ordinary but which suddenly seems to",
                " provide the key. Something to this effect",
                " happened with Abraham. Certainly, he was as",
                " familiar as anyone else with nightfall and",
                " the ensuing daybreak. The sun, the moon",
                " and the stars had all risen before",
                " his eyes in the past and had",
                " then disappeared from sight. But on one",
                " particular day his observation of a star",
                " was to stimulate his thinking in a",
                " certain direction and to lead him in",
                " the end to perceive the truth of",
                " God's Oneness. It is possible that Abraham's",
                " mind was already engrossed in reflecting on",
                " whether, and if so to what extent,",
                " the beliefs which served as the foundation",
                " of the entire life-system of his people",
                " embodied the Truth. when he spotted a",
                " star which provided him with the initial",
                " key to the solution of the problem.",
                " It is also possible that the observation",
                " of a particular star first set him",
                " thinking about the problem.",
                "Another question that",
                " arises is whether Abraham's statements about the",
                " star, the moon and the sun show",
                " that he lapsed into polytheism temporarily. The",
                " answer must be that, while a seeker",
                " after the Truth may pause on the",
                " way to his goal, what really matters",
                " is his direction and the end-point of",
                " his journey rather than the intermediary stages.",
                " These stages are inevitable for every seeker",
                " of the Truth. A man stops at",
                " them to inquire and question rather than",
                " to pronounce his final judgement. During these",
                " stages of the quest a man may",
                " seem to express the opinion: 'That is",
                " so', but what he is really doing",
                " is asking himself the question: 'Is it",
                " really so?' When serious investigation leads to",
                " a negative answer, he proceeds further and",
                " continues the quest. Hence, it would be",
                " wrong to think of such a seeker",
                " having temporarily fallen victim to polytheism and",
                " unbelief whenever he paused at an intermediary",
                " stage for critical reflection."
            ]
        },
        {
            "verse-id": "[6:79]",
            "verse": "Indeed, I have turned my face toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:80]",
            "verse": "And his people argued with him. He said, \"Do you argue with me concerning Allah while He has guided me? And I fear not what you associate with Him [and will not be harmed] unless my Lord should will something. My Lord encompasses all things in knowledge; then will you not remember?",
            "description": [
                "The word used here is tadhakkur which",
                " conveys the sense that somebody who had",
                " been either heedless or negligent of something",
                " suddenly wakes up to its true meaning.",
                " The purpose of Abraham's statement was to",
                " recall them to their senses by reminding",
                " them that their true Lord was not",
                " uninformed about their deeds, for His knowledge",
                " encompasses everything."
            ]
        },
        {
            "verse-id": "[6:81]",
            "verse": "And how should I fear what you associate while you do not fear that you have associated with Allah that for which He has not sent down to you any authority? So which of the two parties has more right to security, if you should know?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:82]",
            "verse": "They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided.",
            "description": [
                "This entire section shows that those people",
                " did not deny the existence of God",
                " as the creator of the heavens and",
                " earth. Their real guilt was that they",
                " associated others in His attributes and His",
                " rights over man. In the first place,",
                " Abraham himself clearly states that they associated",
                " others with God as His partners. In",
                " the second place, the way in which",
                " Abraham mentions God in addressing these people",
                " is suitable only for a people who",
                " did not deny the existence of God.",
                " We must, therefore, regard as incorrect the",
                " opinion of those Qur'anic commentators who try",
                " to explain this verse on the assumption",
                " that the people of Abraham either denied",
                " or were unaware of the existence of",
                " God, and considered their own deities to",
                " be the exclusive possessors of godhead.",
                "The",
                " expression 'and did not tarnish their faith",
                " with wrong-doing' led some Companions to the",
                " misapprehension that perhaps this 'wrong-doing' signified 'disobedience'.",
                " But the Prophet (peace be on him)",
                " has made it clear that this wrong-doing",
                " signifies shirk (associating others with God in",
                " His divinity). The verse means, therefore, that",
                " they alone are fully secure and rightly-guided",
                " who believe in God and do not",
                " mix their faith with any polytheistic belief",
                " and practice.",
                "It is interesting to learn",
                " that this incident, which is the starting-point",
                " of Abraham's prophetic career, has found no",
                " place in the Bible. It is mentioned",
                " only in the Talmud. The Talmudic version,",
                " however, is different from the Qur'anic version",
                " in two ways. First, in the Talmudic",
                " version Abraham's quest for the Truth begins",
                " with the sun and then proceeds by",
                " way of the stars to his discovery",
                " of the One True God. Second. it",
                " states that Abraham not only held the",
                " sun to be his Lord but even",
                " worshipped it, and that the same happened",
                " in connection with the moon."
            ]
        },
        {
            "verse-id": "[6:83]",
            "verse": "And that was Our [conclusive] argument which We gave Abraham against his people. We raise by degrees whom We will. Indeed, your Lord is Wise and Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:84]",
            "verse": "And We gave to Abraham, Isaac and Jacob - all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:85]",
            "verse": "And Zechariah and John and Jesus and Elias - and all were of the righteous.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:86]",
            "verse": "And Ishmael and Elisha and Jonah and Lot - and all [of them] We preferred over the worlds.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:87]",
            "verse": "And [some] among their fathers and their descendants and their brothers - and We chose them and We guided them to a straight path.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:88]",
            "verse": "That is the guidance of Allah by which He guides whomever He wills of His servants. But if they had associated others with Allah, then worthless for them would be whatever they were doing.",
            "description": [
                "Had those people also ascribed partners to",
                " God like the people of Arabia, they",
                " would not have achieved the positions they",
                " had attained.Some might perhaps have earned places",
                " in the rogues' gallery of history as",
                " either ruthless conquerors or monuments to greed.",
                " But had they not shunned polytheism and",
                " adhered to their exclusive and unadulterated devotion",
                " to God, they would certainly neither have",
                " had the honour of becoming the source",
                " of light and guidance to others nor",
                " of assuming the leadership of the pious",
                " and the God-fearing."
            ]
        },
        {
            "verse-id": "[6:89]",
            "verse": "Those are the ones to whom We gave the Scripture and authority and prophethood. But if the disbelievers deny it, then We have entrusted it to a people who are not therein disbelievers.",
            "description": [
                "Here the Prophets are mentioned as having",
                " been endowed with three things: first, the",
                " revealed guidance embodied in the Book; second,",
                " hukm, i.e. the correct understanding of the",
                " revealed guidance, the ability to apply its",
                " principles to the practical affairs of life,",
                " the God-given capacity to arrive at right",
                " opinions regarding human problems; and third, prophethood,",
                " the office by virtue of which they",
                " are enabled to lead human beings in",
                " the light of the guidance vouchsafed to",
                " them.",
                "*58). God does not care if",
                " the unbelievers and polytheists choose to reject",
                " the guidance which has come down from",
                " Him, for He had already raised a",
                " sizeable group of men of faith to",
                " truly appreciate its worth."
            ]
        },
        {
            "verse-id": "[6:90]",
            "verse": "Those are the ones whom Allah has guided, so from their guidance take an example. Say, \"I ask of you for this message no payment. It is not but a reminder for the worlds.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:91]",
            "verse": "And they did not appraise Allah with true appraisal when they said, \"Allah did not reveal to a human being anything.\" Say, \"Who revealed the Scripture that Moses brought as light and guidance to the people? You [Jews] make it into pages, disclosing [some of] it and concealing much. And you were taught that which you knew not - neither you nor your fathers.\" Say, \"Allah [revealed it].\" Then leave them in their [empty] discourse, amusing themselves.",
            "description": [
                "In the light of the foregoing discussion",
                " and commentary, it is quite evident that",
                " this statement comes from the Jews. Since",
                " the Prophet (peace be on him) had",
                " asserted that he was a Prophet and",
                " that a Book had been revealed to",
                " him, the unbelieving Quraysh and other polytheists",
                " of Arabia naturally used to approach the",
                " Jews and the Christians - who believed",
                " in the Prophets and in the Scriptures",
                " - and tried to solicit a candid",
                " answer from them as to whether God's",
                " words had indeed been revealed to Muhammad",
                " (peace be on him). Whatever answer they",
                " gave was then disseminated on all sides",
                " by the active opponents of the Prophet",
                " (peace be on him) in order to",
                " create revulsion against Islam. This is the",
                " reason for mentioning, and then refuting, this",
                " statement by the Jews, which had been",
                " used by the opposition as an argument",
                " against Islam.",
                "One might wonder how a",
                " Jew, who believes in the Torah as",
                " a revealed Book of God, could say",
                " that God had revealed nothing to anyone.",
                " At times blind obstinacy and bigotry cause",
                " people to resort to arguments which strike",
                " at the roots of their own belief.",
                " These people were bent upon denying the",
                " prophethood of Muhammad (peace be on him),",
                " and this fanaticism had come to dominate",
                " them so much that they went so",
                " far as to deny the very institution",
                " of prophethood.",
                "To say that peopte have",
                " not formed any proper estimate of God",
                " means that they have erred grossly in",
                " assessing His wisdom and power. Whoever says",
                " that God did not reveal knowledge of",
                " Reality and the code for man's guidance",
                " has fallen into one of two errors.",
                " Either he considers it impossible for man",
                " to become the recipient of God's revelation,",
                " and this constitutes a gross misjudgement of",
                " God's power, or he thinks that even",
                " though God has equipped man with intelligence",
                " and with the power to act as",
                " he chooses, He has nevertheless made no",
                " arrangement for his guidance, but has left",
                " him in this world altogether unguided and",
                " thus conferred upon him the right to",
                " behave in any way he likes. This",
                " is obviously a misjudgement of God's wisdom.",
                "",
                "*60). The revelation of the Torah to",
                " Moses (peace be on him) is adduced",
                " by way of evidence since the Jews,",
                " to whom this response is addressed, believed",
                " that it had been revealed. It is",
                " obvious that their recognition of the Torah",
                " as the Book revealed to Moses negated",
                " their standpoint that God had never revealed",
                " anything to any human being. Their belief",
                " in the Torah at least proved that",
                " revelation to man is possible, and had",
                " actually taken place."
            ]
        },
        {
            "verse-id": "[6:92]",
            "verse": "And this is a Book which We have sent down, blessed and confirming what was before it, that you may warn the Mother of Cities and those around it. Those who believe in the Hereafter believe in it, and they are maintaining their prayers.",
            "description": [
                "The point argued above was that God's",
                " word can be, and in the past",
                " has been, revealed to human beings. The",
                " next point is that the message of",
                " Muhammad (peace be on him) is indeed",
                " the revealed word of God. In order",
                " to establish this, four things are adduced",
                " as evidence: First, that this Book is",
                " overflowing with God's grace and beneficence. In",
                " other words, it contains the best possible",
                " principles for the well-being and salvation of",
                " mankind. It lays down the true doctrines",
                " of belief. It urges man to righteous",
                " conduct and inspires him to moral excellence.",
                " It contains guidance as to how one",
                " may live a life of purity. And",
                " above all, it is free from any",
                " trace of the ignorance, egocentricity, narrow-mindedness, iniquity,",
                " obscenity and other corruptions with which the",
                " Jews and the Christians had overlaid their",
                " revealed Scriptures. Second, this Book does not",
                " propound any guidance which is essentially divergent",
                " from that previously revealed; rather it confirms",
                " and supports it. Third, the purpose of",
                " the revelation of this Book is the",
                " same as that of the revelation of",
                " Scriptures in the past, viz., to shake",
                " people out of their heedlessness and warn",
                " them of the evil consequences of their",
                " corruption. Fourth, that the call of this",
                " Book did not attract those who merely",
                " worshipped worldly advantages and were slaves of",
                " their animal desires. On the contrary, it",
                " attracted those whose vision goes beyond the",
                " narrow limits of worldly life. Moreover, the",
                " revolution wrought in the lives of people",
                " under the influence of this Book has",
                " rendered them conspicuously distinct from others in",
                " respect of piety and godliness.",
                "A Book",
                " with such characteristics and with such a",
                " wholesome impact on human beings can only",
                " be from God."
            ]
        },
        {
            "verse-id": "[6:93]",
            "verse": "And who is more unjust than one who invents a lie about Allah or says, \"It has been inspired to me,\" while nothing has been inspired to him, and one who says, \"I will reveal [something] like what Allah revealed.\" And if you could but see when the wrongdoers are in the overwhelming pangs of death while the angels extend their hands, [saying], \"Discharge your souls! Today you will be awarded the punishment of [extreme] humiliation for what you used to say against Allah other than the truth and [that] you were, toward His verses, being arrogant.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:94]",
            "verse": "[It will be said to them], \"And you have certainly come to Us alone as We created you the first time, and you have left whatever We bestowed upon you behind you. And We do not see with you your 'intercessors' which you claimed that they were among you associates [of Allah]. It has [all] been severed between you, and lost from you is what you used to claim.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:95]",
            "verse": "Indeed, Allah is the cleaver of grain and date seeds. He brings the living out of the dead and brings the dead out of the living. That is Allah; so how are you deluded?",
            "description": [
                "The one who causes the seed-grain to",
                " split open under the surface of the",
                " earth and then makes it grow and",
                " appear on the surface as a plant",
                " is no other than God.",
                "*63). To",
                " 'bring forth the living from the dead'",
                " means creating living beings out of dead",
                " matter. Likewise, 'to bring out the dead",
                " from the living' means to remove the",
                " lifeless elements from a living organism."
            ]
        },
        {
            "verse-id": "[6:96]",
            "verse": "[He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation. That is the determination of the Exalted in Might, the Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:97]",
            "verse": "And it is He who placed for you the stars that you may be guided by them through the darknesses of the land and sea. We have detailed the signs for a people who know.",
            "description": [
                "By 'signs' are meant all that support",
                " the proposition that there is only one",
                " God, that is, no one has either",
                " the attributes of God or any share",
                " in His authority or can rightfully claim",
                " any of the rights which belong exclusively",
                " to Him. But the ignorant cannot benefit",
                " from these signs, which are scattered all",
                " around, in order to arrive at an",
                " understanding of the Truth. Only those who",
                " observe the phenomena of the universe in",
                " a careful and systematic manner, and do",
                " so with a correct perspective, can truly",
                " benefit from these signs."
            ]
        },
        {
            "verse-id": "[6:98]",
            "verse": "And it is He who produced you from one soul and [gave you] a place of dwelling and of storage. We have detailed the signs for a people who understand.",
            "description": [
                "This means that God caused the human",
                " race to originate from one human being.",
                "",
                "*66). If one were to observe carefully",
                " the creation of the human species, its",
                " division into male and female, the proliferation",
                " of the human race by procreation, the",
                " passing of life through its several stages",
                " in the womb of the mother from",
                " conception to childbirth, one would perceive innumerable",
                " signs to help one grasp the truth",
                " mentioned above. But only those who make",
                " proper use of their intellect can be",
                " led by means of these signs to",
                " an understanding of Reality. Those who live",
                " like animals, who are concerned merely with",
                " the satisfaction of their lusts and desires,",
                " can perceive nothing significant in these phenomena.",
                ""
            ]
        },
        {
            "verse-id": "[6:99]",
            "verse": "And it is He who sends down rain from the sky, and We produce thereby the growth of all things. We produce from it greenery from which We produce grains arranged in layers. And from the palm trees - of its emerging fruit are clusters hanging low. And [We produce] gardens of grapevines and olives and pomegranates, similar yet varied. Look at [each of] its fruit when it yields and [at] its ripening. Indeed in that are signs for a people who believe.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:100]",
            "verse": "But they have attributed to Allah partners - the jinn, while He has created them - and have fabricated for Him sons and daughters. Exalted is He and high above what they describe",
            "description": [
                "Because of man's imaginativeness and superstitious disposition,",
                " he has often held other invisible beings",
                " to be associated with God in His",
                " governance of the universe and in making",
                " and marring man's destiny. For example, the",
                " deity of rain, and the deity of",
                " vegetation, the god of wealth and the",
                " god of health, and so on. Such",
                " beliefs are found among all the polytheistic",
                " nations of the world.",
                "*68). The ignorant",
                " Arabs considered angels to be the daughters",
                " of God. In the same way, other",
                " polytheistic nations wove a network of bloodrelationships",
                " with God, producing thereby a whole crop",
                " of gods and goddesses descended from the",
                " Creator."
            ]
        },
        {
            "verse-id": "[6:101]",
            "verse": "[He is] Originator of the heavens and the earth. How could He have a son when He does not have a companion and He created all things? And He is, of all things, Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:102]",
            "verse": "That is Allah, your Lord; there is no deity except Him, the Creator of all things, so worship Him. And He is Disposer of all things.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:103]",
            "verse": "Vision perceives Him not, but He perceives [all] vision; and He is the Subtle, the Acquainted.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:104]",
            "verse": "There has come to you enlightenment from your Lord. So whoever will see does so for [the benefit of] his soul, and whoever is blind [does harm] against it. And [say], \"I am not a guardian over you.\"",
            "description": [
                "Even though this statement is from God,",
                " it is expressed through the mouth of",
                " the Prophet (peace be on him). We",
                " observe that in the Qur'an the speaker",
                " frequently changes - sometimes it is God",
                " Who is speaking, sometimes it is the",
                " angel who carries the revelation, and sometimes",
                " a group of angels; on some occasions",
                " it is the Prophet (peace be on",
                " him) who is speaking, while on others",
                " it is the men of faith. Likewise,",
                " those addressed by the Qur'an also change",
                " - sometimes it is the Prophet (peace",
                " be' on him); sometimes it is the",
                " men of faith; sometimes it is the",
                " People of the Book; sometimes it is",
                " the unbelievers and the polytheists; sometimes it",
                " is the Quraysh; sometimes it is the",
                " Arabs; and sometimes, mankind as a whole.",
                " Regardless of these changes, however, the content",
                " of the message always remains the same",
                " - it consists of God's guidance to",
                " mankind.",
                "The statement 'I am not your",
                " keeper' signifies that the task of the",
                " Prophet is confined to carrying the light",
                " of true guidance to others, it is",
                " then up to them either to use",
                " it to perceive Reality for themselves or",
                " to keep their eyes closed. The Prophet",
                " (peace he on him) is not asked",
                " to compel those who deliberately kept their",
                " eyes shut to open them, forcing them",
                " to see what they did not wish",
                " to see."
            ]
        },
        {
            "verse-id": "[6:105]",
            "verse": "And thus do We diversify the verses so the disbelievers will say, \"You have studied,\" and so We may make the Qur'an clear for a people who know.",
            "description": [
                "The same has been said earlier, viz.",
                " that genuine seekers after the Truth arrive",
                " at it even when it is couched",
                " in parables about such apparently trivial things",
                " as flies and gnats (see surah al-Baqarah",
                " 2:24). As for those who have been",
                " seized by a biased negativism, they are",
                " prone to ask, sarcastically: What have these",
                " trivial things to do with the Book",
                " of God? The same idea is expressed",
                " here in a slightly different form. The",
                " import of the statement is that the",
                " Book of God has become a touchstone,",
                " which helps mark off the true from",
                " the false. These include the sort of",
                " people who, once they have ceme to",
                " know the teachings of the Book of",
                " Ged, try in earnest to reflect on",
                " its substance and seek to benefit from",
                " the wisdom and admonition it contains. Another",
                " group reacts quite differently. When they hear",
                " or read the Book, their minds are",
                " not attracted by the substance of its",
                " message. Rather, their curiosity is aroused and",
                " they begin probing as to where this",
                " Prophet, who had no formal education, derived",
                " the teachings which the Book contains. And",
                " since a negative prejudice has already seized",
                " their hearts, they find it reasonable to",
                " conceive of any possibility except the possibility",
                " that the Qur'An is a revelation from",
                " God. Such people proclaim their opinion with",
                " such strong conviction that one might feel",
                " inclined to believe that they had indeed",
                " discovered the real 'source' of the Book",
                " by means of scientific investigation."
            ]
        },
        {
            "verse-id": "[6:106]",
            "verse": "Follow, [O Muhammad], what has been revealed to you from your Lord - there is no deity except Him - and turn away from those who associate others with Allah.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:107]",
            "verse": "But if Allah had willed, they would not have associated. And We have not appointed you over them as a guardian, nor are you a manager over them.",
            "description": [
                "It is emphasized that the Prophet (peace",
                " be on him) is only required to",
                " preach the Truth and try to call",
                " people to embrace it. His responsibility ends",
                " at that for he is, after all,",
                " not their warden. His task is to",
                " present this guidance and spare no effort",
                " in elucidating the Truth. Anyone who still",
                " rejects it does so on his own",
                " responsibility. It is not part of the",
                " Prophet's task to compel anybody to follow",
                " the Truth, and he will not be",
                " held accountable for not having been able",
                " to bring an individual out of the",
                " fold of falsehood. Hence he should not",
                " overstrain his mind by his desire to",
                " make the blind see, or compel those",
                " bent on keeping their eyes shut, to",
                " observe. For, had it been an objective",
                " of God's universal plan not to allow",
                " anyone to remain devoted to falsehood, He",
                " need not have sent Prophets for that",
                " purpose. Could He not have turned all",
                " human beings, instantly, into devotees of the",
                " Truth by His mere will? Quite obviously",
                " God did not intend to do so.",
                " The entire basis of the Divine plan",
                " is that men should have free-will and",
                " be allowed to choose between the Truth",
                " and falsehood; that the Truth should be",
                " explained to them in order that they",
                " be tested with regard to their choice",
                " between truth and falsehood. The right attitude,",
                " therefore, is for them to follow the",
                " Straight Way which has been illuminated by",
                " the light bequeathed to them and to",
                " keep on calling others towards it. They",
                " should naturally value very highly all those",
                " who respond to the message of the",
                " Truth. Such persons should not be forsaken",
                " or neglected, however humble their station in",
                " the world. As for those who wilfully",
                " reject the message of God, one need",
                " not pursue them too far. They should",
                " rather be left alone to proceed towards",
                " their doom since they themselves wish so,",
                " and are insistent on doing so."
            ]
        },
        {
            "verse-id": "[6:108]",
            "verse": "And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge. Thus We have made pleasing to every community their deeds. Then to their Lord is their return, and He will inform them about what they used to do.",
            "description": [
                "The Prophet (peace be on him) and",
                " his followers are admonished not to allow",
                " their proselytizing zeal to dominate them so",
                " that their polemics and controversial religious discussions",
                " either lead them to be offensive to",
                " the beliefs of non-Muslims or to abuse",
                " their religious leaders and deities. Far from",
                " bringing people closer to the Truth, such",
                " an attitude is likely to alienate them",
                " from it further.",
                "*73). Here we should",
                " bear in mind, as we have pointed",
                " out earlier, that God declares those things",
                " which take place as a result of",
                " the operation of the laws of nature",
                " to be His own acts, for it",
                " is He Who has made those laws.",
                " Whatever results from the operation of those",
                " laws, therefore, results from His command. Whenever",
                " God states that a certain act was",
                " His, the same might be described by",
                " humans as occurring in the natural course",
                " of things."
            ]
        },
        {
            "verse-id": "[6:109]",
            "verse": "And they swear by Allah their strongest oaths that if a sign came to them, they would surely believe in it. Say, \"The signs are only with Allah.\" And what will make you perceive that even if a sign came, they would not believe.",
            "description": [
                "'Sign' in this context signifies a tangible",
                " miracle which is so impressive that it",
                " leaves people with no alternative but to",
                " believe in the veracity of the Prophet",
                " (peace be on him) and the truth",
                " of his claim to have been appointed",
                " by God.",
                "*75). The Prophet (peace be",
                " on him) denies his ability to perform",
                " miracles.** That power lies with God alone.",
                " If God wants a miracle to take",
                " place, He has the power; if He",
                " does not want miracles to take place,",
                " none will.",
                "**And so indeed does every",
                " Prophet of God - Ed.",
                "*76). These",
                " words are addressed to the Muslims. Driven",
                " by the restless yearning to see people",
                " embrace Islam - a yearning which they",
                " sometimes expressed in words - they wished",
                " some miracle to happen which might lead",
                " their erring brethren to the true faith.",
                " In response to this wish and longing",
                " they are told that their embracing the",
                " true faith does not depend upon their",
                " observing any miraculous sign."
            ]
        },
        {
            "verse-id": "[6:110]",
            "verse": "And We will turn away their hearts and their eyes just as they refused to believe in it the first time. And We will leave them in their transgression, wandering blindly.",
            "description": [
                "This shows that they still suffer from",
                " the same mentality which had made them",
                " reject the call of the Prophet (peace",
                " be on him) at the outset. Their",
                " outlook has undergone no change. The same",
                " mental confusion, the same opacity of vision",
                " which had kept them from developing sound",
                " understanding and.a correct perspective still warps their",
                " understanding and clouds their vision."
            ]
        },
        {
            "verse-id": "[6:111]",
            "verse": "And even if We had sent down to them the angels [with the message] and the dead spoke to them [of it] and We gathered together every [created] thing in front of them, they would not believe unless Allah should will. But most of them, [of that], are ignorant.",
            "description": [
                "The people under discussion are so perverse",
                " that they do not prefer to embrace",
                " the Truth in preference to falsehood by",
                " rightly exercising their choice and volition. The",
                " only way that is left for them",
                " to become lovers of the Truth is,",
                " therefore, that by His overpowering will God",
                " should render them truth-loving not by their",
                " choice and volition, but by metamorphizing their",
                " very nature. Such a course, however, goes",
                " against the wisdom which underlies the creation",
                " of man. Hence it is futile to",
                " expect God to intervene in the matter",
                " and to force those people to believe",
                " by the exercise of His will."
            ]
        },
        {
            "verse-id": "[6:112]",
            "verse": "And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and that which they invent.",
            "description": [
                "The Prophet (peace be on him) is",
                " told that he should not be unnerved",
                " even if the evil ones among both",
                " mankind and the jinn stood united against",
                " him and opposed him with all their",
                " might. For this was not the first",
                " time that such a thing had happened.",
                " Whenever a Prophet came and tried to",
                " lead people to the Truth, all the",
                " satanic forces joined hands to defeat his",
                " mission. 'Specious talk' signifies all the trickery",
                " and manoeuvring to which the enemy resorts,",
                " all his efforts aimed at sowing doubts",
                " about Islam and undermining people's faith in",
                " it, so as to arouse them against",
                " both the Prophet (peace be on him)",
                " and his message. Taken as a whole,",
                " these are characterized as 'delusion', for the",
                " weapons used in their crusade by the",
                " opponents of the Truth have the effect",
                " of deluding others as well as themselves,",
                " no matter how beneficial and successful those",
                " weapons may appear to be.",
                "*80). Furthermore,",
                " we should always bear in mind that,",
                " according to the Qur'an, there is a",
                " tremendous difference between 'God's will' and 'God's",
                " good pleasure'. The failure to differentiate between",
                " the two often gives rise to serious",
                " misconceptions. If a certain thing takes place",
                " in accord with the universal will of",
                " God, and thus by His sanction, that",
                " does not necessarily mean that God is",
                " pleased with it. Nothing at all takes",
                " place in the world unless God permits",
                " it to take place, unless He makes",
                " it a part of His scheme, and",
                " unless He makes it possible for that",
                " event to take place by creating its",
                " necessary conditions. The act of stealing on",
                " the part of a thief, the act",
                " of homicide on the part of a",
                " murderer, the wrong and corruption of the",
                " wrong-doer and the corrupt, the unbelief of",
                " the unbeliever and the polytheism of the",
                " polytheist - none of these are possible",
                " without the will of God. Likewise, the",
                " faith of the believer and the piety",
                " of the pious are inconceivable without the",
                " will of God. In short, both these",
                " require the will of God. But whereas",
                " the things in the first category do",
                " not please Him, those in the second",
                " do.",
                "Even though the will of God",
                " is oriented to ultimate good, the course",
                " of the realization of that good is",
                " paved with conflict between the forces of",
                " light and darkness, of good and evil,",
                " of what is sound and pure on",
                " the one hand and what is corrupt",
                " and defiled on the other. With larger",
                " interests in view, God has endowed man",
                " with the disposition of obedience as well",
                " as of disobedience. He has created in",
                " man Abrahamic and Mosaic as well as",
                " Nimrodic and Pharaonic potentialities. Both the pure,",
                " unadulterated human nature and the satanic urges",
                " are ingrained in man's being and have",
                " been provided with the opportunity to work",
                " themselves out by coming into conflict with",
                " each other. He has granted those species",
                " of His creatures who are possessed of",
                " authority (viz. man and jinn) the freedom",
                " to choose between good and evil. Whosoever",
                " chooses to act righteously has been given",
                " the power to do so, and the",
                " same is the case with him who",
                " chooses to be evil. People of both",
                " categories are in a position to use",
                " material resources within the framework of the",
                " broader considerations underlying God's- governance of His",
                " universe. God will be pleased, however, only",
                " with those who are working for good.",
                " God likes His creatures to exercise their",
                " freedom of choice properly and commit themselves",
                " to good of their own volition.",
                "Unlike",
                " the angels, who carry out God's commands",
                " without resistance from any quarter, the task",
                " entrusted to men is to strive to",
                " establish the way of life sanctioned by",
                " God in the face of opposition and",
                " hostility from evil-doers and rebels against Him.",
                " In the framework of His universal will,",
                " God allows even those who have chosen",
                " the path of rebellion to strive for",
                " the realization of their goals, even as",
                " He grants the believers every opportunity to",
                " strive along the path of obedience and",
                " service to God. Despite this granting of",
                " freedom and choice to all there is",
                " no doubt that God is pleased with,",
                " and guides, directs, supports and strengthens the",
                " believers alone because their overall direction is",
                " to His liking. Nevertheless, they should not",
                " expect that by His supernatural intervention God",
                " will either force those who are disinclined",
                " to believe into believing or that He",
                " will forcibly remove the satanic forces -",
                " among both men and jinn - who",
                " are resolved to spare neither their mental",
                " and physical energy nor their material resources",
                " to impede the triumph of the Truth.",
                " Those determined to strive in the cause",
                " of the Truth, and of virtue and",
                " righteousness are told that they must prove",
                " their earnest devotion by waging a fierce",
                " struggle against the devotees of falsehood. For",
                " had God wanted to use miracles to",
                " obliterate falsehood and usher in the reign",
                " of the Truth, He would not have",
                " required human beings to accomplish the task.",
                " He could have simply seen to it",
                " that no evil one remained in the",
                " world, leaving no possibility for polytheism and",
                " unbelief to exist."
            ]
        },
        {
            "verse-id": "[6:113]",
            "verse": "And [it is] so the hearts of those who disbelieve in the Hereafter will incline toward it and that they will be satisfied with it and that they will commit that which they are committing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:114]",
            "verse": "[Say], \"Then is it other than Allah I should seek as judge while it is He who has revealed to you the Book explained in detail?\" And those to whom We [previously] gave the Scripture know that it is sent down from your Lord in truth, so never be among the doubters.",
            "description": [
                "The implied speaker in this sentence is",
                " the Prophet (peace be on him) and",
                " the words are addressed to the Muslims.",
                " The purpose of the sentence is to",
                " impress upon the Muslims that God has",
                " elucidated the relevant truths, and has also",
                " proclaimed that in their endeavour to make",
                " the Truth prevail they will have to",
                " follow the path of striving and struggle.",
                " The devotees of the Truth should, therefore,",
                " resort to those means which human beings",
                " normally employ for the successful achievement of",
                " their objectives rather than wait for any",
                " supernatural intervention that would enable them to",
                " achieve their mission without struggle and sacrifice.",
                " Moreover, since God Himself had chosen that",
                " human effort rather than supernatural intervention should",
                " lead to the prevalence of the Truth,",
                " who had the power to change this",
                " basic fact and bring about the victory",
                " of the Truth without any resort to",
                " human effort and sacrifice.",
                "*82). This is",
                " no mere concoction designed to explain away",
                " the current problems. All those versed in",
                " the Scriptures, and possessing true understanding of",
                " the mission of the Prophets (peace be",
                " on them all), will confirm that everything",
                " in the Qur'an is perfectly true and",
                " in fact constitutes that eternal truth which",
                " cannot suffer any change or modification."
            ]
        },
        {
            "verse-id": "[6:115]",
            "verse": "And the word of your Lord has been fulfilled in truth and in justice. None can alter His words, and He is the Hearing, the Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:116]",
            "verse": "And if you obey most of those upon the earth, they will mislead you from the way of Allah. They follow not except assumption, and they are not but falsifying.",
            "description": [
                "One need not follow the way of",
                " life of the majority, for the majority",
                " tend to follow their conjectures and fancies",
                " rather than sound knowledge. Their beliefs, their",
                " ideas and concepts, their philosophies of life,",
                " the guiding principles of their conduct, their",
                " laws - all these are founded on",
                " conjecture. On the contrary, the way of",
                " life which pleases God, was revealed by",
                " Him and hence is based on true",
                " knowledge rather than conjecture. Instead of trying",
                " to discover the way of life of",
                " the majority, a seeker after truth should,",
                " therefore, persevere in the way prescribed by",
                " God, even if he finds himself to",
                " be a solitary traveller."
            ]
        },
        {
            "verse-id": "[6:117]",
            "verse": "Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of the [rightly] guided.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:118]",
            "verse": "So eat of that [meat] upon which the name of Allah has been mentioned, if you are believers in His verses.",
            "description": [
                "Many nations have imposed on themselves superfluous",
                " religious taboos, which include a variety of",
                " dietary restrictions. On the one hand, they",
                " have declared lawful many of the things",
                " which God has forbidden. On the other,",
                " there are many things which God has",
                " made lawful but which some people have",
                " forbidden to themselves. Some people have even",
                " gone so far as to consider eating",
                " animals slaughtered in the name of God",
                " as unlawful, while those slaughtered with no",
                " mention of God's name may be eaten.",
                " God repudiates this and urges the Muslims",
                " - if they really believe in Him",
                " and obey His injunctions - to smash",
                " the superstitious and prejudiced notions contrived by",
                " human beings in disregard of God's revealed",
                " guidance, and to recognize as unlawful all",
                " that God has declared to be unlawful,",
                " and as lawful all that God has",
                " declared to be lawful."
            ]
        },
        {
            "verse-id": "[6:119]",
            "verse": "And why should you not eat of that upon which the name of Allah has been mentioned while He has explained in detail to you what He has forbidden you, excepting that to which you are compelled. And indeed do many lead [others] astray through their [own] inclinations without knowledge. Indeed, your Lord - He is most knowing of the transgressors.",
            "description": [
                "See Surah al-Nahl 16:15. We may observe",
                " in passing that this allusion indirectly establishes",
                " that Surah al-Nahl was revealed before the",
                " present surah."
            ]
        },
        {
            "verse-id": "[6:120]",
            "verse": "And leave what is apparent of sin and what is concealed thereof. Indeed, those who earn [blame for] sin will be recompensed for that which they used to commit.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:121]",
            "verse": "And do not eat of that upon which the name of Allah has not been mentioned, for indeed, it is grave disobedience. And indeed do the devils inspire their allies [among men] to dispute with you. And if you were to obey them, indeed, you would be associators [of others with Him].",
            "description": [
                "It has been reported in a tradition",
                " transmitted by 'Abd Allah b. 'Abbas that",
                " the Jewish religious scholars used to prompt",
                " the ignorant people of Arabia to address",
                " many enquiries to the Prophet (peace be",
                " on him) so as to discredit him.",
                " One of the questions they taught them",
                " to ask was: 'Why is it that",
                " an animal killed by (the act of)",
                " God should be deemed prohibited, while one",
                " killed by us is considered lawful?'This is",
                " a common example of the warped mentality",
                " of the People of the Book. They",
                " strained their minds to contrive such questions",
                " so as to create doubts in people's",
                " minds and to provide them with intellectual",
                " weapons in their fight against the Truth.",
                "",
                "*87). To acknowledge the overlordship of God,",
                " yet to follow at the same time",
                " the orders and ways of those who",
                " have turned away from Him, amounts to",
                " associating others with God in His divinity.",
                " True belief in the unity of God",
                " consists in orienting one's entire life to",
                " the obedience and service of God. Those",
                " who believe that any other being besides",
                " God is to he acknowledged in principle",
                " as having an independent claim on man's",
                " unreserved obedience should know that such acknowledgement",
                " amounts to associating others with God in",
                " His divinity at the level of belief.",
                " On the other hand, if they actually",
                " do obey those who, in sheer disregard",
                " of God's guidance and injunctions, arrogate to",
                " themselves the right to declare according to",
                " their whims certain things to be lawful",
                " and others to be unlawful, and to",
                " bid and forbid people as they please,",
                " this amounts to associating others with God",
                " in His divinity at the level of",
                " action."
            ]
        },
        {
            "verse-id": "[6:122]",
            "verse": "And is one who was dead and We gave him life and made for him light by which to walk among the people like one who is in darkness, never to emerge therefrom? Thus it has been made pleasing to the disbelievers that which they were doing.",
            "description": [
                "'Death' signifies here the state of ignorance",
                " and lack of consciousness, whereas 'life' denotes",
                " the state of knowledge and true cognition,",
                " the state of awareness of Reality. He",
                " who cannot distinguish between right and wrong",
                " and does not know the Straight Way",
                " for human life, may be alive on",
                " the biological plane, but his essential humanity",
                " is not. He may be a living",
                " animal but is certainly not a living",
                " human being. A living human being is",
                " one who can distinguish right from wrong,",
                " good from evil, honesty from dishonesty.",
                "*89).",
                " The question is: 'How can they expect",
                " one who has been able to attain",
                " genuine consciousness of his true human nature",
                " and who, by virtue of his knowledge",
                " of the Truth, can clearly discern the",
                " Straight Way among the numerous crooked ways,",
                " to live like those who lack true",
                " consciousness and go on stumbling in the",
                " darkness of ignorance and folly?'",
                "*90). The",
                " law of God with regard to those",
                " to whom light is presented but who",
                " wilfully refuse to accept it, preferring to",
                " follow their crooked paths even after they",
                " have been invited to follow the Straight",
                " Way, is that in the course of",
                " time such people begin to cherish darkness,",
                " and to enjoy groping their way in",
                " the dark, stumbling and falling as they",
                " proceed. They tend to mistake cacti for",
                " orchids, thorns for roses. They find pleasure",
                " in every act of evil and corruption.",
                " They look forward to renewed experiences of",
                " corruption, hoping that where they were previously",
                " unsuccessful they will now find success."
            ]
        },
        {
            "verse-id": "[6:123]",
            "verse": "And thus We have placed within every city the greatest of its criminals to conspire therein. But they conspire not except against themselves, and they perceive [it] not.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:124]",
            "verse": "And when a sign comes to them, they say, \"Never will we believe until we are given like that which was given to the messengers of Allah.\" Allah is most knowing of where He places His message. There will afflict those who committed crimes debasement before Allah and severe punishment for what they used to conspire.",
            "description": [
                "This shows that they were unwilling to",
                " believe in the statement of the Prophets",
                " that an angel of God came to",
                " each of them and delivered the message",
                " of God. They would believe, they said,",
                " only if the angel approached them directly",
                " and intimated God's message to them."
            ]
        },
        {
            "verse-id": "[6:125]",
            "verse": "So whoever Allah wants to guide - He expands his breast to [contain] Islam; and whoever He wants to misguide - He makes his breast tight and constricted as though he were climbing into the sky. Thus does Allah place defilement upon those who do not believe.",
            "description": [
                "'To open someone's breast to Islam' means",
                " to make him feel fully convinced of",
                " the truth of Islam and to remove",
                " all his doubts, hesitations and reluctance."
            ]
        },
        {
            "verse-id": "[6:126]",
            "verse": "And this is the path of your Lord, [leading] straight. We have detailed the verses for a people who remember.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:127]",
            "verse": "For them will be the Home of Peace with their Lord. And He will be their protecting friend because of what they used to do.",
            "description": [
                "The righteous will enjoy 'the Abode of",
                " Peace' since there he will be safe",
                " from every misfortune and evil."
            ]
        },
        {
            "verse-id": "[6:128]",
            "verse": "And [mention, O Muhammad], the Day when He will gather them together [and say], \"O company of jinn, you have [misled] many of mankind.\" And their allies among mankind will say, \"Our Lord, some of us made use of others, and we have [now] reached our term, which you appointed for us.\" He will say, \"The Fire is your residence, wherein you will abide eternally, except for what Allah wills. Indeed, your Lord is Wise and Knowing.\"",
            "description": [
                "The term finn here refers to the",
                " evil ones among the jinn.",
                "*95). This",
                " means that they had derived unfair benefit",
                " from one another and had served their",
                " selfish ends by mutual deception.",
                "*96). Even",
                " though God has the right to punish",
                " whoever He wishes and to forgive whoever",
                " He wishes, His punishing and forgiving will",
                " be neither arbitrary nor whimsical. It will",
                " rather be founded on absolute knowledge and",
                " wisdom. God will forgive those whom He",
                " knows not to be responsible for their",
                " guilt, and thus not liable to punishment",
                " according to His wisdom and justice.",
                "*97).",
                " Just as the wrong-doers had been accomplices",
                " in sin and evil during their earthly",
                " life, they would remain companions in the",
                " After-life as well and share its punishment.",
                ""
            ]
        },
        {
            "verse-id": "[6:129]",
            "verse": "And thus will We make some of the wrongdoers allies of others for what they used to earn.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:130]",
            "verse": "\"O company of jinn and mankind, did there not come to you messengers from among you, relating to you My verses and warning you of the meeting of this Day of yours?\" They will say, \"We bear witness against ourselves\"; and the worldly life had deluded them, and they will bear witness against themselves that they were disbelievers.",
            "description": [
                "The wrong-doers would confess that even though",
                " the Prophets had come, in succession, in",
                " order to inform them of the Truth,",
                " it was their own fault that they",
                " did not respond to their call.",
                "*99).",
                " They were deniers of, and disbelievers in,",
                " rather than ignorant of the Truth. They",
                " acknowledged tha! the Truth had been conveyed",
                " to them and that they had refused",
                " to accept it."
            ]
        },
        {
            "verse-id": "[6:131]",
            "verse": "That is because your Lord would not destroy the cities for wrongdoing while their people were unaware.",
            "description": [
                "God does not want His creatures to",
                " have any valid reason to complain that",
                " He had left them ignorant of the",
                " Right Way, and then convicted them of",
                " error. God has forestalled any such grievance",
                " by sending Prophets and revealing Holy Books",
                " to warn both jinn and human beings.",
                " If people continue to falter in spite",
                " of God's arrangements for their guidance, they",
                " themselves are to blame for the punishment",
                " they will receive, and they have no",
                " justification for blaming their misfortune on God.",
                ""
            ]
        },
        {
            "verse-id": "[6:132]",
            "verse": "And for all are degrees from what they have done. And your Lord is not unaware of what they do.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:133]",
            "verse": "And your Lord is the Free of need, the possessor of mercy. If He wills, he can do away with you and give succession after you to whomever He wills, just as He produced you from the descendants of another people.",
            "description": [
                "The Qur'anic statement: 'Your Lord is Self-Sufficient'",
                " signifies that God is in need of",
                " nothing from anyone, that none of His",
                " interests will be jeopardized by disobedience to",
                " Him, and that no benefit will accrue",
                " to Him from obedience. Even if all",
                " human beings became disobedient, God's dominion will",
                " not shrink. Nor will His dominion expand",
                " if everybody were to become obedient and",
                " serve and worship Him as they ought",
                " to. God is dependent neither upon their",
                " show of veneration nor upon their offerings.",
                " He lavishes His limitless treasures on human",
                " beings and seeks nothing in return.",
                "The",
                " other statement, namely that 'Your Lord is",
                " full of compassion', has been made here",
                " to emphasize two things. First, that when",
                " God urges human beings to follow the",
                " Right Way, and asks them not to",
                " do anything in conflict with Ultimate Reality,",
                " He does not do so because their",
                " good behaviour benefits Him or their misconduct",
                " harms Him. He does so because good",
                " conduct is beneficial to man himself, as",
                " evil conduct is harmful to him. Hence",
                " it is out of sheer benevolence that",
                " God urges man to develop righteous conduct,",
                " for it will raise him to great",
                " heights, and He urges him to avoid",
                " evil conduct because it will lead to",
                " his own degradation. Second, that God is",
                " not unduly stern in judging man. He",
                " gets no pleasure from punishing people. He",
                " is not on the look-out for slight",
                " lapses for which to convict and persecute",
                " people. God is highly compassionate towards all",
                " His creatures and governs with utmost mercy",
                " and benevolence, and the same characterizes His",
                " dealings with human beings as well. Hence,",
                " He constantly forgives the sins of people.",
                " Many disobey, indulge in sins, commit crimes,",
                " disregard God's commands, even though they are",
                " nourished by the sustenance He provides. God,",
                " nevertheless, continually treats them with forbearance and",
                " forgives them. Again and again, He grants",
                " them respite in order that they may",
                " take heed, understand things properly and reform",
                " themselves. Had He been excessively stern, He",
                " could even have obliterated them instantly and",
                " raised up another people. He could have",
                " put an end to humanity and brought",
                " into being an altogether different species of",
                " creation."
            ]
        },
        {
            "verse-id": "[6:134]",
            "verse": "Indeed, what you are promised is coming, and you will not cause failure [to Allah].",
            "description": [
                "This refers to the Resurrection, when human",
                " beings of every epoch will be raised",
                " anew and made to stand before God",
                " for final judgement."
            ]
        },
        {
            "verse-id": "[6:135]",
            "verse": "Say, \"O my people, work according to your position; [for] indeed, I am working. And you are going to know who will have succession in the home. Indeed, the wrongdoers will not succeed.",
            "description": [
                "If people prefer to ignore the Prophet's",
                " admonition and do not recant their misconduct,",
                " they are at liberty to follow their",
                " chosen path, but they should let the",
                " Prophet (peace be on him) follow his.",
                " The ultimate results of their conduct will,",
                " in due time, become evident to all",
                " - to the Prophet (peace be on",
                " him) as well as to his opponents.",
                ""
            ]
        },
        {
            "verse-id": "[6:136]",
            "verse": "And the polytheists assign to Allah from that which He created of crops and livestock a share and say, \"This is for Allah,\" by their claim, \"and this is for our partners [associated with Him].\" But what is for their \"partners\" does not reach Allah, while what is for Allah - this reaches their \"partners.\" Evil is that which they rule.",
            "description": [
                "There now follows an elucidation of the",
                " 'ignorance' which those people-insistently clung to, and",
                " which they were not prepared to forsake.",
                " They are also told about that major",
                " 'wrong' which, if not abandoned, will bar",
                " their way to salvation.",
                "*105). They themselves",
                " acknowledged that the earth belongs to God,",
                " and that it is He Who causes",
                " the vegetation to grow. They also affirmed",
                " that God is the creator of the",
                " animals which were yoked to their service.",
                " They believed, however, that the grace of",
                " God for them was the outcome of",
                " the blessing and benediction of the angels,",
                " jinn, heavenly stars, spirits of their pious",
                " ancestors and so on, who cared for",
                " their well-being and were their patrons. They",
                " therefore used to make a two-fold division",
                " of their harvest and livestock offerings. One",
                " part was devoted to God in recognition",
                " of their gratitude to Him for having",
                " granted them farms and animals, while the",
                " rest was devoted to the household gods",
                " of either their family or tribes in",
                " order to ensure their continuing grace and",
                " benediction.",
                "First, God censures them for this",
                " iniquity and asks them - since all",
                " those animals were created and had been",
                " granted to them by God alone -",
                " what justification there is for making offerings",
                " to others. Is it not sheer ingratitude",
                " to ascribe the acts of benevolence and",
                " grace of the true Benefactor to the",
                " intercession of others, and to associate them",
                " with God in thanksgiving? Second, they are",
                " censured indirectly for assigning quite an arbitrary",
                " share in their offerings to God, as",
                " if they themselves were the law-maker who",
                " could ascribe shares to God and others",
                " as they wished. To God alone belong",
                " all the bounties He has given man,",
                " and only His Law should therefore determine",
                " what part of those bounties should be",
                " offered to Him in thanksgiving and how",
                " the remaining should be spent. Hence even",
                " if they spend something in the way",
                " of Allah, for the poor and the",
                " deprived, but according to their own will,",
                " that does not deserve to be accepted",
                " by Him.",
                "*106). This is subtle sarcasm",
                " at the trickery to which the polytheists",
                " resorted while dividing the offerings between God",
                " and the partners whom they had set",
                " up with Him. By one device and",
                " another they increased the share of the",
                " false deities, which only showed that their",
                " heart lay with those sham partners of",
                " God rather than with Him.",
                "It is",
                " instructive to recall those tricks. If, while",
                " they were apportioning God's share of cereals",
                " and fruits, anything belonging to His share",
                " fell out of its place, it used",
                " to be added to the portion earmarked",
                " for the share of God's partners. On",
                " the contrary, if any part of the,",
                " partners' share fell out or got mixed",
                " up with the portion earmarked for God,",
                " they were most careful to return it",
                " to where it belonged. Whenever they were",
                " criticized for this, they had a number",
                " of interesting apologies to offer. They said,",
                " for instance, that being the Creator, God",
                " is Self-Sufficient and hence He does not",
                " care if His portion is in some",
                " way reduced. As for the 'partners', they",
                " were not after all self-sufficient and would",
                " therefore take them to task for the",
                " slightest diminution in their share.",
                "In order",
                " to grasp what lay at the root",
                " of these superstitions, it is essential to",
                " know that the portion which these ignorant",
                " people earmarked for God was devoted to",
                " helping the indigent, the poor, travellers, orphans",
                " and so on. On the other hand,",
                " the portion earmarked for offerings to the",
                " partners' actually went either directly to the",
                " coffers of the priestly class or was",
                " offered at the shrines and thus ultimately",
                " reached the priests and caretakers of those",
                " shrines. Over the course of centuries these",
                " selfish religious leaders had impressed upon those",
                " simple-minded people that there was no harm",
                " in God's share being reduced, but that",
                " of God's dear ones, far from being",
                " diminished, should be increased."
            ]
        },
        {
            "verse-id": "[6:137]",
            "verse": "And likewise, to many of the polytheists their partners have made [to seem] pleasing the killing of their children in order to bring about their destruction and to cover them with confusion in their religion. And if Allah had willed, they would not have done so. So leave them and that which they invent.",
            "description": [
                "The word 'partners' is now used in",
                " a different sense. In this verse the",
                " word 'partners' denotes those human beings and",
                " devils who had legitimized infanticide and even",
                " represented it as a commendable act.",
                "The",
                " reason for calling such people 'partners' is",
                " that just as God alone deserves to",
                " be worshipped, so He alone has the",
                " right to make laws for His creatures",
                " and to determine the limits of what",
                " is lawful and what is unlawful. Also,",
                " just as consecrating acts of devotion to",
                " anyone other than God amounts to setting",
                " up partners with Him, so to follow",
                " man-made laws in the belief that human",
                " beings have the right to be their",
                " own law-makers amounts to acknowledging others as",
                " partners of God. Both these acts amount",
                " to setting up partners with Him, irrespective",
                " of whether or not man applies the",
                " word 'God' to those before whom he",
                " makes ritual offerings, or to those whose",
                " laws he considers to be essentially right",
                " and binding for men.",
                "It is pertinent",
                " to recall that three forms of infanticide",
                " were practised among the Arabs, and the",
                " Qur'an alludes to each:",
                "(1) Girls were",
                " put to death either to forestall the",
                " intrusion of a son-in-law, to prevent them",
                " from falling into the hands of enemies",
                " in the event of an outbreak of",
                " tribal feuding or to stop them from",
                " becoming a source of disgrace for any",
                " other reason.",
                "(2) Both male and female",
                " children were killed if parents thought they",
                " would not be able to support them",
                " and that they would thus become an",
                " unendurable burden.",
                "(3) Children of both sexes",
                " were placed as sacrificial offerings on the",
                " altars of the deities in order to",
                " gratify them.",
                "*108). The use of the",
                " word 'ruin' in this verse is significant.",
                " It denotes, in the first place, the",
                " moral ruination of a people. A man",
                " whose callousness and cruelty reach the point",
                " where he begins to kill his offspring",
                " with his own hands not only becomes",
                " bereft of the essence of humanity, but",
                " has sunk even lower than the animals.",
                " Moreover, this signifies the ruin of a",
                " people and of the human race. This",
                " is because infanticide necessarily leads to loss",
                " of population which is detrimental to the",
                " interests of mankind and also of each",
                " nation, since it prevents those who could",
                " have carried the legacy of a nation",
                " from either being born or puts an",
                " end to their lives after ,they are",
                " born. This rule also signifies the ultimate",
                " ruin, i.e. in the Hereafter. For indeed",
                " anyone who treats innocent children with such",
                " high-handedness, who cold-bloodedly slaughters the essence of",
                " his humanity, who acts so sordidly towards",
                " the human species as such, and even",
                " towards his own people, deserves severe punishment",
                " from God.",
                "*109). In the Jahiliyah, the",
                " Age of Ignorance, the Arabs both identified",
                " themselves with Abraham and Ishmael and were",
                " quite convinced that they were indeed followers",
                " of Abraham and Ishmael. They therefore considered",
                " their religion to be one that had",
                " been prescribed by God. The fact, however,",
                " was that over the course of centuries",
                " a number of innovations had overgrown the",
                " religion preached by Abraham and Ishmael. These",
                " innovations, which had been introduced by their",
                " religious leaders, the tribal chiefs and the",
                " elders of noted families, had become hallowed",
                " with the passage of time, and were",
                " considered an integral part of their original",
                " religion. No authentic traces of this original",
                " religion, however, existed in the Arab traditions,",
                " nor in written sources nor in historical",
                " records as such. Hence, when innovations made",
                " their inroads into their religious life, they",
                " failed to perceive both the innovations and",
                " the innovators. This rendered the entire religious",
                " tradition of the Arabs unauthentic in the",
                " sight of the people of Arabia themselves.",
                " They could not assert with conviction which",
                " elements were part of the original God-given",
                " religion, and which were mere innovations.",
                "*110).",
                " Had God not so willed, they could",
                " never have kept to their false ways.",
                " But God willed that everybody should be",
                " allowed to pursue his own choice. Hence,",
                " if people do not believe in spite",
                " of the Prophet's admonition, and persist in",
                " their false ways, they must be allowed",
                " to do as they please. One need",
                " not hound such people and pester them",
                " into accepting the Truth."
            ]
        },
        {
            "verse-id": "[6:138]",
            "verse": "And they say, \"These animals and crops are forbidden; no one may eat from them except whom we will,\" by their claim. And there are those [camels] whose backs are forbidden [by them] and those upon which the name of Allah is not mentioned - [all of this] an invention of untruth about Him. He will punish them for what they were inventing.",
            "description": [
                "There was a practice among the people",
                " of Arabia whereby they used to consecrate",
                " certain animals and farms to certain shrines,",
                " and at offerings at certain altars. These",
                " consecrated offerings could not be used by",
                " everybody. An elaborate code laid down what",
                " kind of offering could be used by",
                " what kind of people. God not only",
                " judges such practices to be polytheistic, but",
                " also censures them as man-made innovations. God",
                " was the master of all that they",
                " had consecrated as offerings to the deities.",
                " He had neither encumbered human beings with",
                " the need to make any of those",
                " offerings and consecrations nor imposed those restrictions",
                " on what they might consume. These were",
                " the wilful inventions of headstrong and rebellious",
                " people who attributed to themselves the authority",
                " to make laws as they pleased.",
                "*112).",
                " Traditions indicate that there were certain ritual",
                " offerings, and that on certain occasions animals",
                " were consecrated for sacrifice at which it",
                " was deemed unlawful to pronounce the name",
                " of God. It was also prohibited to",
                " ride such animals during the Pilgrimage, since",
                " at that time the pilgrim pronounced the",
                " name of God when he recited the",
                " formula: Labbayk Allahumma Labbayk. Every care was",
                " taken not to pronounce the name of",
                " God at the time of milking, mounting,",
                " slaughtering and eating of such animals.",
                "*113).",
                " Even though those rules had not been",
                " laid down by God, people followed them",
                " under the false impression that they had",
                " been prescribed by Him. They could not",
                " adduce any injunction from God in support",
                " of such a belief, and all that",
                " they could claim was that it was",
                " an integral part of their ancestors' way",
                " of life."
            ]
        },
        {
            "verse-id": "[6:139]",
            "verse": "And they say, \"What is in the bellies of these animals is exclusively for our males and forbidden to our females. But if it is [born] dead, then all of them have shares therein.\" He will punish them for their description. Indeed, He is Wise and Knowing.",
            "description": [
                "One of the provisions of this self-contrived",
                " religious code of the Arabs was that",
                " the flesh of the young, born of",
                " the animals consecrated as offerings to the",
                " deities, might be eaten by males but",
                " not by females. Persons of both sexes",
                " were allowed to eat its flesh if",
                " it had died either a natural death",
                " or was dead at birth."
            ]
        },
        {
            "verse-id": "[6:140]",
            "verse": "Those will have lost who killed their children in foolishness without knowledge and prohibited what Allah had provided for them, inventing untruth about Allah. They have gone astray and were not [rightly] guided.",
            "description": [
                "It is put to them plainly that",
                " even though such practices had been introduced",
                " by their forefathers, religious guides and outstanding",
                " leaders, the fact remained that those practices",
                " were inherently unsound. That those practices had",
                " come down from their ancestors and venerated",
                " elders did not necessarily legitimize them. These",
                " callous people had introduced such inhuman customs",
                " as infanticide, and, without any justification whatsoever,",
                " had prohibited to the creatures of God",
                " food and drink which He had created.",
                " They had also introduced many innovations themselves,",
                " making them part of their religion and",
                " ascribing them to God. How could such",
                " people be considered either to have attained",
                " salvation or to be rightlyguided? Even though",
                " venerated by them as their ancestors, they",
                " were nevertheless misguided and were destined to",
                " see the evil consequences of their misdeeds.",
                ""
            ]
        },
        {
            "verse-id": "[6:141]",
            "verse": "And He it is who causes gardens to grow, [both] trellised and untrellised, and palm trees and crops of different [kinds of] food and olives and pomegranates, similar and dissimilar. Eat of [each of] its fruit when it yields and give its due [zakah] on the day of its harvest. And be not excessive. Indeed, He does not like those who commit excess.",
            "description": [
                "Tle Arabic expression \"Jannaatim Ma'rushaatin wa khairu",
                " ma'rushatin\" signifies two kinds of gardens: first,",
                " those consisting of trellised plants and, second,",
                " those consisting of trees which stand on",
                " their own."
            ]
        },
        {
            "verse-id": "[6:142]",
            "verse": "And of the grazing livestock are carriers [of burdens] and those [too] small. Eat of what Allah has provided for you and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.",
            "description": [
                "The word \"Farasha\" (which means 'to spread,",
                " to pave, to cover the ground, floor",
                " or path') has been used in the",
                " context of cattle either (1) because they",
                " are relatively short, and in moving about",
                " seem to be touching the ground, (2)",
                " because when they are slaughtered, they have",
                " to be laid on the ground, or",
                " (3) because their skins and hair are",
                " used for furnishing purposes.",
                "*118). It becomes",
                " clear from the context that God wants",
                " to emphasize three things. First, that the",
                " orchards, fields and cattle are all bounties",
                " of God. No one else has made",
                " any contribution to them and hence no",
                " one is entitled to any share in",
                " the thanks that man ought to give",
                " Him in return for these bounties. Second,",
                " since all those things are bounties of",
                " God, one ought to follow the laws",
                " of God alone while making use of",
                " them. No one else has the right",
                " to regulate their use. To acknowledge oneself",
                " bound by customs and practices laid down",
                " by others than God, and to make",
                " offerings out of a feeling of gratitude",
                " for beneficence to someone other than God",
                " constitute acts of rebellion and amount to",
                " following Satan. Third, as God has created",
                " all these things for the fulfilment of",
                " man's needs, they should not be unnecessarily",
                " suspended from use or be regarded as",
                " prohibited. All restrictions on the use of",
                " the means of sustenance and other bounties",
                " of God based on conjecture or superstition,",
                " are not to His liking at all.",
                ""
            ]
        },
        {
            "verse-id": "[6:143]",
            "verse": "[They are] eight mates - of the sheep, two and of the goats, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Inform me with knowledge, if you should be truthful.\"",
            "description": [
                "That is, they should come forward with",
                " arguments based on sound, reliable knowledge, rather",
                " than with arguments which have no authority",
                " except that of ancestral tradition, conjecture or",
                " superstition."
            ]
        },
        {
            "verse-id": "[6:144]",
            "verse": "And of the camels, two and of the cattle, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Or were you witnesses when Allah charged you with this? Then who is more unjust than one who invents a lie about Allah to mislead the people by [something] other than knowledge? Indeed, Allah does not guide the wrongdoing people.\"",
            "description": [
                "Questions as to whether the male offspring",
                " is lawful and the female is unlawful",
                " are presented in some detail to show",
                " how unreasonable their superstitions are. That the",
                " male offspring of an animal should be",
                " considered lawful for eating while the female",
                " be prohibited, or vice versa; and that",
                " an animal should itself be considered lawful,",
                " but not its offspring, is so manifestly",
                " unreasonable that common sense simply refuses to",
                " accept it, and no intelligent man can",
                " ever conceive such absurdities to have been",
                " sanctioned by God. Just as the superstitions",
                " in vogue among the Arabs were absurd,",
                " as the Qur'an stresses, likewise many other",
                " nations of the world follow even now",
                " irrational dietary restrictions, and believe that food",
                " and drink become polluted merely by the",
                " touch of some other people."
            ]
        },
        {
            "verse-id": "[6:145]",
            "verse": "Say, \"I do not find within that which was revealed to me [anything] forbidden to one who would eat it unless it be a dead animal or blood spilled out or the flesh of swine - for indeed, it is impure - or it be [that slaughtered in] disobedience, dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], then indeed, your Lord is Forgiving and Merciful.\"",
            "description": [
                "See for this Surah al-Baqarah 2: 173,",
                " Surah al-Md'idah 5: 3 and Surah al-Nahl",
                " 16: 115. The slight difference between this",
                " verse and Surah al-Baqarah 2:173 is that",
                " whereas the latter mentions 'blood' as prohibited,",
                " the present verse qualifies it with 'outpoured',",
                " i.e. the blood which has flowed as",
                " a result of either injuring or slaughtering",
                " an animal. This, in fact, constitutes an",
                " elucidation of the former injunction rather than",
                " the revelation of a different one. Likewise,",
                " Surah al-Ma'idah 5: 3 mentions the prohibition",
                " of certain other categories - animals strangled",
                " or killed by blows, those which have",
                " died from either falling or goring, and",
                " those devoured by a beast of prey,",
                " in addition to the four classes mentioned",
                " here. This is not an independent, divergent",
                " injunction; it is rather an explanation signifying",
                " that the animals thus killed fall into",
                " the category of 'carrion'.",
                "There is a",
                " group of Muslim jurists who believe that",
                " prohibition is confined to these four classes",
                " of animal food, and that the eating",
                " of everything else is lawful. This was",
                " also the view of 'Abd Allah b.",
                " 'Abbas and 'A'ishah. Several traditions, however, indicate",
                " that the Prophet (peace be on him)",
                " either told people not to eat certain",
                " things or expressed his disapproval at their",
                " eating them, for example, domesticated donkeys, beasts",
                " with canine teeth and birds with claws.",
                " It is for this reason that the",
                " majority of jurists do not consider prohibition",
                " confined to these four classes but extend",
                " it to several others. These jurists disagree,",
                " however, on which of those things are",
                " unlawful and which are lawful. Abu Hanifah,",
                " Malik and Shafi'i, for example, consider domesticated",
                " donkeys to be unlawful. Others argue that",
                " the Prophet (peace be on him) forbade",
                " them on a special occasion and because",
                " of a special reason. To cite another",
                " example, the Hanafi jurists hold wild beasts,",
                " birds of prey and animals which feed",
                " on carrion to be absolutely unlawful, whereas",
                " Milik and Awza'i hold birds of prey",
                " to be lawful. Layth considers the cat",
                " to be lawful. In the same way,",
                " Shafi'i considers prohibition to be confined only",
                " to those beasts which actually attack man,",
                " such as lion, wolf, tiger and so",
                " on. In the opinion of another jurist,",
                " 'Ikrimah, both crow and badger are lawful.",
                " Likewise, whereas the Hanafi jurists declare all",
                " crawling creatures to be prohibited, Ibn Abi",
                " Layla, Malik and Awza'i hold the snake",
                " to be lawful.",
                "Upon reflection of these",
                " divergent opinions and the arguments adduced in",
                " support of them, it becomes clear that",
                " categorical prohibition embraces only those four classes",
                " mentioned in the Qur'an. As for other",
                " types of animal food, regarding which the",
                " jurists have expressed a negative view, they",
                " seem to carry varying degrees of religious",
                " disapprobation. The things whose disapprobation is established",
                " by statements of the Prophet (peace be",
                " on him) transmitted to us through sound",
                " traditions, are relatively close to 'prohibition'. As",
                " for things regarding which them is disagreement",
                " among jurists, their religious disapprobation becomes doubtful.",
                "",
                "Temperamental dislike, however, is quite a different",
                " matter. The Law Of God does not",
                " force anyone to eat everything which is",
                " not prohibited. At the same time, the",
                " Law does not entitle anybody to exalt",
                " his personal likes and dislikes into a",
                " criterion of what is lawful and unlawful.",
                " No one is justified in reproaching others",
                " for consuming lawful things which offend his",
                " tastes."
            ]
        },
        {
            "verse-id": "[6:146]",
            "verse": "And to those who are Jews We prohibited every animal of uncloven hoof; and of the cattle and the sheep We prohibited to them their fat, except what adheres to their backs or the entrails or what is joined with bone. [By] that We repaid them for their injustice. And indeed, We are truthful.",
            "description": [
                "This is discussed at three places in",
                " the Qur'an. Surah AI 'Imran 3:93 states:",
                " 'All food was lawful to the Children",
                " of Israel except what Israel made unlawful",
                " to themselves before the revelation of the",
                " Torah. Tell them: \"Bring the Torah and",
                " recite any passage of it if you",
                " are truthful\".' Surah al-Nisa' 4:160 mentions that",
                " because of the misdeeds of the Children",
                " of Israel: 'We forbade them many clean",
                " things which had earlier been made lawful",
                " to them.' And now the present verse",
                " says that because of the transgression of",
                " the Jews, God forbade unto them 'all",
                " beasts with claws; and the fat of",
                " oxen and the sheep except the fat",
                " which is either on their backs or",
                " their entrails or that which sticks to",
                " the bones'. If these three verses are",
                " taken together, it becomes clear that the",
                " differences between Islamic law and Jewish law",
                " with regard to what is lawful and",
                " what is unlawful in animal foods stem",
                " from two considerations. First, that several centuries",
                " before the revelation of the Torah, Isra'il",
                " (Jacob, peace be on him) had given",
                " up the use of certain things, which",
                " his descendants also abstained from consuming. The",
                " result was that Jewish jurists considered them",
                " to be absolutely unlawful and recorded their",
                " prohibition in the Torah. They included the",
                " camel, the hare and the rock-badger, the",
                " prohibition of which is mentioned in the",
                " fragments of the Torah embodied in the",
                " Bible. (See Leviticus ll: 4; Deuteronomy 14:",
                " 7) But the Our'an challenges the Jews",
                " to come forward with the Torah itself",
                " and show where any of those things",
                " had been declared unlawful. Their inability to",
                " do so shows that those interdictions must",
                " have been later interpolations into the Torah.",
                "",
                "Second, when the Jews rebelled against the",
                " Law revealed by God and set themselves",
                " up as their own law-givers, they made",
                " several things unlawful for themselves, and as",
                " a punishment God allowed them to remain",
                " a prey to that misunderstanding. These include",
                " birds with claws such as the ostrich,",
                " seagull and water-hen, and also the fat",
                " of oxen and sheep. In the Bible",
                " prohibitions of these kinds have been interpolated",
                " among the injunctions of the Torah. (See",
                " Leviticus 3:17; 7:22-3; ll:16-18; Deuteronomy 14:14-16.) But",
                " Surah al-Nisa' 4:160 shows that those things",
                " had not been made unlawful by the",
                " Torah itself. They had rather been prohibited",
                " after the time of Jesus, and history",
                " bears witness to the fact that the",
                " present Jewish law was given a definitive",
                " formulation by the Jewish jurist, Yehudah, towards",
                " the end of the second century of",
                " the Christian calendar.",
                "It might be asked",
                " in view of what has been mentioned",
                " above, why the expression 'We forbade for",
                " them' is employed in Surah al-Nisa' 4:160",
                " The answer is that declaration through a",
                " Prophet or a heavenly Book is not",
                " God's only way of prohibiting. Another way",
                " is to allow fraudulent law-makers and sham",
                " jurists to gain predominating influence upon God's",
                " rebels. These in turn deprive them of",
                " many good, clean things of life by",
                " making them believe that they are prohibited.",
                " The first kind of prohibition is an",
                " act of His mercy, whereas the second",
                " kind is in the nature of a",
                " curse and punishment from God."
            ]
        },
        {
            "verse-id": "[6:147]",
            "verse": "So if they deny you, [O Muhammad], say, \"Your Lord is the possessor of vast mercy; but His punishment cannot be repelled from the people who are criminals.\"",
            "description": [
                "If they could still give up their",
                " disobedience and return to the true service",
                " of God, they would find Him ready",
                " to embrace them with His mercy. But",
                " if they persisted, they should remember that",
                " no one could save them from His",
                " wrath."
            ]
        },
        {
            "verse-id": "[6:148]",
            "verse": "Those who associated with Allah will say, \"If Allah had willed, we would not have associated [anything] and neither would our fathers, nor would we have prohibited anything.\" Likewise did those before deny until they tasted Our punishment. Say, \"Do you have any knowledge that you can produce for us? You follow not except assumption, and you are not but falsifying.\"",
            "description": [
                "Their apology for their crimes and misdeeds",
                " would be that which has always been",
                " advanced by criminals and wrong-doers - an",
                " apology based on the assumption of absolute",
                " determinism. They would plead that when they",
                " associated others with God in His divinity,",
                " or unwarrantedly regarded certain things as prohibited,",
                " they did so because those acts had",
                " been willed for them by God. Had",
                " He not so willed, they would not",
                " have been able to do what they",
                " did. Hence, since they were doing everything",
                " according to the will of God, everything",
                " was proper. If anyone was to blame,",
                " it was God and not they. They",
                " were under compulsion to do what they",
                " did, for the ability to do otherwise",
                " lay beyond their power."
            ]
        },
        {
            "verse-id": "[6:149]",
            "verse": "Say, \"With Allah is the far-reaching argument. If He had willed, He would have guided you all.\"",
            "description": [
                "This provides a complete refutation of their",
                " apology. In order to appreciate it fully,",
                " careful analysis is required. In the first",
                " place they are told that citing God's",
                " will to justify one's errors and misdeeds,",
                " and making it a pretext for refusing",
                " to accept true guidance was the practice",
                " of the evil-doers before them. But they",
                " should remember that this had led to",
                " their ruin and they themselves were witnesses",
                " to the evil consequences of deviation from",
                " the Truth.",
                "Furthermore, it is being clarified",
                " that the plea of the unbelievers that",
                " the only reason for their error was",
                " that God had not willed that they",
                " be guided to the Truth, is based",
                " on fancy and conjecture rather than on",
                " sound knowledge. They refer to God's will",
                " without understanding the relationship between God's will",
                " and man's action. They entertain the misconception",
                " that if a man commits theft under",
                " the will of God, that does not",
                " mean that he will not be reckoned",
                " a criminal. For the fact is that",
                " whichever path a man chooses, be it",
                " that of gratitude or ungratitude to God",
                " of guidance or error, obedience or disobedience,",
                " God will open that path for him,",
                " and thereafter God will permit and enable",
                " him within the framework of His universal",
                " scheme, and to the extent that He",
                " deems fit - to do whatever he",
                " chooses to do whether it is right",
                " or wrong.",
                "If their forefathers had been",
                " enabled by God's will to associate others",
                " with Him in His divinity and prohibit",
                " clean things, that did not mean that",
                " they were not answerable for their misdeeds.",
                " On the contrary, everyone will be held",
                " responsible for choosing false ways, for having",
                " a false intent, and for having striven",
                " for false ends.",
                "The crucial point is",
                " succinctly made at the end in the",
                " words: 'Then say to- them, (As against",
                " your argument) Allah's is the conclusive argument.",
                " Surely, had He willed, He would have",
                " guided you all to the Truth.' The",
                " argument which they put forward, viz. 'If",
                " Allah had willed, neither we nor our",
                " forefathers could have associated others with Allah",
                " in His divinity', does not embody the",
                " whole truth. The whole truth is that",
                " 'had He willed, He would have guided",
                " you all to the Truth'. In other",
                " words, they were not prepared to take",
                " the Straight Way of their own choice",
                " and volition. As it was not God's",
                " intent to create them with inherent right",
                " guidance like the angels, they would be",
                " allowed to persist in the error they",
                " had chosen for themselves."
            ]
        },
        {
            "verse-id": "[6:150]",
            "verse": "Say, [O Muhammad], \"Bring forward your witnesses who will testify that Allah has prohibited this.\" And if they testify, do not testify with them. And do not follow the desires of those who deny Our verses and those who do not believe in the Hereafter, while they equate [others] with their Lord.",
            "description": [
                "A person who is conscious that he",
                " should testify only to that which he",
                " knows, can never testify that the taboos",
                " regarding food and other customs prevalent in",
                " their society had been enjoined by God.",
                " But if some people are brazen enough",
                " to feel no compunction in bearing false",
                " witness, then at least the believers should",
                " not become their partners in lying. The",
                " real purpose in asking them to testify",
                " honestly whether their customs and practices had",
                " in fact been sanctioned by God, is",
                " to stimulate those with some sense of",
                " honesty to reflect on the character of",
                " their customs and practices. Perhaps when they",
                " realize that there is no evidence of",
                " those prohibitions having been prescribed by God,",
                " some of them may decide to get",
                " rid of them."
            ]
        },
        {
            "verse-id": "[6:151]",
            "verse": "Say, \"Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him, and to parents, good treatment, and do not kill your children out of poverty; We will provide for you and them. And do not approach immoralities - what is apparent of them and what is concealed. And do not kill the soul which Allah has forbidden [to be killed] except by [legal] right. This has He instructed you that you may use reason.\"",
            "description": [
                "The restrictions which had shackled their lives",
                " were not those imposed by God. The",
                " really worthwhile restrictions are those prescribed by",
                " God in order to regulate human life.",
                " These have always served as the essential",
                " basis of all God-given codes (cf. Exodus.",
                " chapter 20).",
                "*128). lle first principle is",
                " that they should associate none with God",
                " in His divinity: neither in His essence,",
                " nor in His attributes, nor in His",
                " powers and authority, nor in the rights",
                " He has against His creatures.",
                "To associate",
                " someone with God in His divinity is",
                " to declare that the former shares the",
                " essence of God's divinity. Instances of associating",
                " others in God's essence are the Christian",
                " doctrine of the Trinity, the belief of",
                " the pagan Arabs that angels are daughters",
                " of God, and the belief of other",
                " polytheists in the divine character of their",
                " self-styled gods and goddesses and, in some",
                " cases, of their royalty. Likewise, a person",
                " associates others in the attributes of God",
                " when he considers someone other than God",
                " to be invested with those attributes which",
                " belong exclusively to God. One becomes guilty",
                " of this kind of polytheism if one",
                " believes somebody either to know all the",
                " mysteries of the Unseen or to be",
                " all-seeing and all-hearing or to be free",
                " of all defects and weaknesses and thus",
                " infallible. Again, a person associates others in",
                " the authority of God when he recognizes",
                " someone to be possessed of authority which",
                " belongs to God alone by virtue of",
                " His godhead; for example, the power to",
                " either benefit or harm people in a",
                " supernatural manner, to fulfil the needs of",
                " people and rescue them from distress. to",
                " protect and shield them, to hear their",
                " prayers, to make or mar their fate.",
                " A person is guilty of the same",
                " when he recognizes someone as possessing the",
                " rightful authority to determine what is lawful",
                " and what is unlawful, and to make",
                " laws for the regulation of human life.",
                " Such authority belongs to God alone, and",
                " recognizing anyone other than God as possessing",
                " it is tantamount to associating others with",
                " God in His authority.",
                "Moreover, to associate",
                " others with God in His divine rights",
                " means that one recognizes someone beside God",
                " as legitimately deserving that which may he",
                " asked of man by God alone, viz.",
                " bowing and prostrating, standing in awe and",
                " reverence with folded hands, devotional greeting and",
                " kissing the earth, slaughtering animals and making",
                " any other offerings in thanksgiving for his",
                " grace and benevolence and in acknowledgement of",
                " his overlordship, vowing offerings in his name,",
                " calling him to rescue one from one's",
                " affliction and misfortune, and all the other",
                " forms of worship, adoration and reverence which",
                " are exclusively for God. In the same",
                " way, no one has the-right to be",
                " loved to the exclusion of all other",
                " attachments, or to be held in such",
                " awe that one always fears his wrath",
                " and dreads the violation of his command,",
                " both openly and in secret. Likewise, it",
                " is God - and God alone -",
                " Who has the right to be obeyed",
                " unconditionally, and Whose guidance should be considered",
                " the only criterion of right and wrong.",
                " In the same way, man should not",
                " commit himself to obey any authority which",
                " is either independent of obedience to God",
                " or whose command lacks the sanction of",
                " God.",
                "If someone accords any of these",
                " rights to anyone other than God, he",
                " is guilty of associating others with God",
                " in His divinity. His guilt is the",
                " same whether or not he calls such",
                " beings divine.",
                "*129). Accordingly, good treatment of",
                " one's parents includes showing them respect and",
                " reverence, obeying them, trying to keep them",
                " pleased, and serving them. The Qur'an always",
                " mentions this right of the parents immediately",
                " after mentioning the duty one owes to",
                " God alone. This makes it quite clear",
                " that the rights of parents have precedence",
                " over those of other human beings.",
                "*130).",
                " The word fawahish applies to all those",
                " acts whose abominable character is self-evident. In",
                " the Qur'an all extra-marital sexual relationships, sodomy,",
                " nudity, false accusations of unchastity, and taking",
                " as one's wife a woman who had",
                " been married to one's father, are specifically",
                " reckoned as 'shameful deeds' (fawahish). In Hadith,",
                " theft, taking intoxicating drinks and begging have",
                " been characterized as fawahish, as have many",
                " other brazenly indecent acts. Man is required",
                " to abstain from them both openly and",
                " in secret.",
                "*131). This means that human",
                " life, which has been declared inviolable by",
                " God, can only be destroyed for just",
                " cause. As for what is meant by",
                " 'just cause', we ought to remember that",
                " three cases are embodied in the Qur'an",
                " whereas two additional cases have been stated",
                " by the Prophet (peace be on him).",
                " The cases mentioned by the Qur'an are",
                " the following: (1) That a man is",
                " convicted of deliberate homicide and thus the",
                " claim of retaliation is established against him.",
                "",
                "(2) That someone resists the establishment of",
                " the true faith so that fighting against",
                " him might become necessary.",
                "(3) That someone",
                " is guilty of spreading disorder in the",
                " Domain of Islam and strives to overthrow",
                " the Islamic order of government.",
                "The two",
                " cases mentioned in the Hadith are:",
                "(1)",
                " That a person commits illegitimate sexual intercourse",
                " even after marriage. > (2) That a",
                " Muslim is guilty of apostasy and rebellion",
                " against the Muslim body-politic.",
                "Except for these",
                " five reasons, slaying a human being is",
                " not permissible, regardless of whether he is",
                " a believer, a protected non-Muslim (dhimmi) or",
                " an ordinary unbeliever."
            ]
        },
        {
            "verse-id": "[6:152]",
            "verse": "And do not approach the orphan's property except in a way that is best until he reaches maturity. And give full measure and weight in justice. We do not charge any soul except [with that within] its capacity. And when you testify, be just, even if [it concerns] a near relative. And the covenant of Allah fulfill. This has He instructed you that you may remember.",
            "description": [
                "That is, one's handling of the property",
                " of orphans should be based on maximum",
                " selflessness, sincerity and well-wishing for the orphans;",
                " it should be of a kind which",
                " lends itself to no reproach, either from",
                " God or man.",
                "*133). Even though this",
                " is a full-fledged postulate of the law",
                " of God, it is mentioned here in",
                " order to stress that one who tries",
                " to remain fair and just to the",
                " utmost of his ability, in giving weight",
                " and measure and in his dealings with",
                " people, will be acquitted of responsibility for",
                " error. If any mistakes in weight or",
                " measure occur out of oversight, and thus",
                " involuntarily, he will not be punished.",
                "*134).",
                " 'Covenant of Allah' signifies, in the first",
                " place, the commitment to God, as well",
                " as to human beings, to which man",
                " binds himself in His name. It also",
                " signifies that covenant between man and God,",
                " as well as between one human being",
                " and another which automatically takes place the",
                " moment a person is born onto God's",
                " earth and into human society. The first",
                " two covenants mentioned are voluntary and deliberate",
                " whereas the last one is natural. The",
                " last one is no less binding than",
                " the first two, even though man does",
                " not make it of his own volition.",
                " For when man enjoys his own existence,",
                " makes use of his physical and mental",
                " energy, benefits from the means of sustenance",
                " and natural resources - in other words,",
                " when he benefits from the world created",
                " by God and avails himself of the",
                " opportunities provided for him by the operation",
                " of natural laws - he incurs certain",
                " obligations towards God. In the same way,",
                " when one derives nourishment and sustenance from",
                " the blood of one's mother while in",
                " her womb, when one opens one's eyes",
                " in a family which is supported by",
                " the toil of one's father, when one",
                " benefits from the various institutions of human",
                " society, one is placed in varying degrees",
                " of obligation towards those individuals and institutions.",
                " This covenant between man and God and",
                " between man and society is inscribed, not",
                " on a piece of paper, but on",
                " every fibre of man's being. Man has",
                " not entered into this covenant consciously and",
                " deliberately, yet the whole of his being",
                " owes itself to it. Surah al-Baqarah 2:27",
                " alludes to this covenant when it says",
                " that it is the transgressors 'who break",
                " the covenant of Allah after its firm",
                " binding, and cut asunder what Allah has",
                " commanded to be joined, and spread mischief",
                " on earth'. It is also mentioned in",
                " Surah al-A'raf 7:172 in the following words:",
                " 'And recall when your Lord took the",
                " children of Adam from their loins and",
                " made them testify as to themselves saying,",
                " \"Am I not your Lord?\" (to which)",
                " they answered, \"Yes, we do bear witness",
                " thereto. \""
            ]
        },
        {
            "verse-id": "[6:153]",
            "verse": "And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way. This has He instructed you that you may become righteous.",
            "description": [
                "It is an essential corollary of the",
                " natural covenant mentioned above that man should",
                " follow the way prescribed by his Lord;",
                " any deflection from the orders of God,",
                " or serving anyone other than Him, constitutes",
                " a primary breach of that covenant. Once",
                " this breach has been committed every single",
                " article of the covenant is likely to",
                " be violated one after the other. Moreover,",
                " it should also be remembered that man",
                " cannot acquit himself of the highly delicate,",
                " extensive and complex set of responsibilities entailed",
                " by this covenant unless he accepts the",
                " guidance of God and tries to follow",
                " the way prescribed by Him.",
                "Non-acceptance of",
                " God's guidance necessarily produces two grave and",
                " damaging consequences. First, by following any other",
                " way, one is inevitably led away from",
                " the true path and is thus deprived",
                " of the opportunity to approach God and",
                " please Him. Second, as soon as man",
                " deviates from the Straight Way prescribed by",
                " God, he encounters a whole labyrinth of",
                " highways and byways, causing the entire human",
                " species to fall a prey to total",
                " bewilderment and perplexity, and which shatters all",
                " dreams of a steady advance towards maturity",
                " and betterment. The words 'follow not other",
                " paths for they will scatter you away",
                " from His path' hint at this damage.",
                " (See Surah al-Ma'idah 5, n. 35 above.)",
                ""
            ]
        },
        {
            "verse-id": "[6:154]",
            "verse": "Then We gave Moses the Scripture, making complete [Our favor] upon the one who did good and as a detailed explanation of all things and as guidance and mercy that perhaps in [the matter of] the meeting with their Lord they would believe.",
            "description": [
                "To believe in 'meeting with the Lord'",
                " signifies the conviction that one is answerable",
                " to God, and which leads one to",
                " adopt responsible behaviour in life.",
                "The statement",
                " made here could mean two things. It",
                " might mean that the teachings of the",
                " heavenly Book vouchsafed to Moses could itself",
                " create a sense of responsibility among the",
                " Israelites. Alternatively, it might mean that when",
                " ordinary people observe the wonderful way of",
                " life prescribed by God, and note the",
                " beneficial effects of its merciful dispensation in",
                " the lives of righteous people, they will",
                " come to realize that belief in the",
                " After-life is, in all respects, a better",
                " basis for human life than its denial.",
                " In this way, their observation and study",
                " might turn them from rejection to true",
                " faith."
            ]
        },
        {
            "verse-id": "[6:155]",
            "verse": "And this [Qur'an] is a Book We have revealed [which is] blessed, so follow it and fear Allah that you may receive mercy.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:156]",
            "verse": "[We revealed it] lest you say, \"The Scripture was only sent down to two groups before us, but we were of their study unaware,\"",
            "description": [
                "The allusion is to the Jews and",
                " the Christians."
            ]
        },
        {
            "verse-id": "[6:157]",
            "verse": "Or lest you say, \"If only the Scripture had been revealed to us, we would have been better guided than they.\" So there has [now] come to you a clear evidence from your Lord and a guidance and mercy. Then who is more unjust than one who denies the verses of Allah and turns away from them? We will recompense those who turn away from Our verses with the worst of punishment for their having turned away.",
            "description": [
                "'Signs of Allah' include the teachings embodied",
                " in the Qur'an. They are also manifest",
                " in the noble life of the Prophet",
                " (peace be on him), and the pure",
                " lives of those who believed in him.",
                " Tley also include the natural phenomena to",
                " which the Qur'an refers in support of",
                " its message."
            ]
        },
        {
            "verse-id": "[6:158]",
            "verse": "Do they [then] wait for anything except that the angels should come to them or your Lord should come or that there come some of the signs of your Lord? The Day that some of the signs of your Lord will come no soul will benefit from its faith as long as it had not believed before or had earned through its faith some good. Say, \"Wait. Indeed, we [also] are waiting.\"",
            "description": [
                "That is, either tokens of the approach",
                " of the Day of Reckoning or God's",
                " scourge or any other sign that will",
                " uncover the Truth, after which there will",
                " be no reason left for testing man.",
                "",
                "*140). Those tokens will be so clear",
                " that after their appearance it will neither",
                " avail the unbeliever to repent of his",
                " unbelief nor the disobedient to forsake his",
                " disobedience. For faith and obedience have meaning",
                " and value only as long as the",
                " Truth remains hidden, as long as the",
                " tenure of life granted to people does",
                " not seem to have approached its end",
                " and the world with all its vanities",
                " continues to delude man that, as there",
                " may neither be God nor After-life, one",
                " should eat, drink and enjoy oneself as",
                " best one can."
            ]
        },
        {
            "verse-id": "[6:159]",
            "verse": "Indeed, those who have divided their religion and become sects - you, [O Muhammad], are not [associated] with them in anything. Their affair is only [left] to Allah; then He will inform them about what they used to do.",
            "description": [
                "This is addressed to the Prophet (peace",
                " be on him) and through him to",
                " all followers of the true faith. The",
                " import of this statement is that true",
                " faith has always consisted, and still consists,",
                " in recognizing the One True God as",
                " one's God and Lord; in associating none",
                " with God in His divinity - neither",
                " in respect of His essence, nor of",
                " His attributes, nor of His claims upon",
                " His creatures; in believing in the Hereafter",
                " and hence considering oneself answerable before God;",
                " and in living according to those principles",
                " and values which have been communicated by",
                " God to mankind through His Prophets and",
                " Books. This was the religion entrusted to",
                " man at the beginning of human life.",
                " The religions which emerged later stemmed from",
                " the perverted ingenuity of man, from his",
                " baser lusts, and from an exaggerated sense",
                " of devotion to venerable personalities. Such factors",
                " corrupted the original religion and overlaid it",
                " with harmful innovations. Hence, people modified and",
                " distorted the original beliefs by mixing them",
                " with products of their conjecture and philosophical",
                " thinking. More and more innovations were added",
                " to the original laws of the true",
                " religion. Putting aside the Law of God,",
                " men set themselves up as their own",
                " law-makers, indulged in hair-splitting elaborations, and exaggerated",
                " the importance of disagreements in minor legal",
                " problems. They showed excessive veneration for some",
                " Prophets of God and some standard-bearers of",
                " the true religion, and directed their rancour",
                " and hatred against the others. Thus there",
                " emerged innumerable religions and sects, the birth",
                " of each leading to the fragmentation of",
                " humanity into an ever-increasing number of mutually",
                " hostile groups. Anyone who decides to follow",
                " the true religion must therefore cut himself",
                " off from all factions and chart an",
                " independent course."
            ]
        },
        {
            "verse-id": "[6:160]",
            "verse": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:161]",
            "verse": "Say, \"Indeed, my Lord has guided me to a straight path - a correct religion - the way of Abraham, inclining toward truth. And he was not among those who associated others with Allah.\"",
            "description": [
                "The 'Way of Abraham' is one further",
                " indication of the way of true religion",
                " which one is required to follow. This",
                " way could also have been designated as",
                " the way of Moses or of Jesus",
                " But since their names have become falsely",
                " associated with Judaism and Christianity respectively, it",
                " was necessary to call it the 'Way",
                " of Abraham'. Moreover, Abraham was acknowledged by",
                " both the Jews and the Christians as",
                " rightly-guided and both knew, of course, that",
                " he lived long before either Judaism or",
                " Christianity was born. In the same way,",
                " the polytheists of Arabia also considered Abraham",
                " to be rightly-guided. Despite their ignorance, they",
                " at least acknowledged that that righteous man,",
                " who had founded the Ka'bah, was a",
                " worshipper of God exclusively and no idolator.",
                ""
            ]
        },
        {
            "verse-id": "[6:162]",
            "verse": "Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds.",
            "description": [
                "'The Arabic word nusuk used here signifies",
                " ritual sacrifice as well as the other",
                " forms of devotion and worship."
            ]
        },
        {
            "verse-id": "[6:163]",
            "verse": "No partner has He. And this I have been commanded, and I am the first [among you] of the Muslims.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[6:164]",
            "verse": "Say, \"Is it other than Allah I should desire as a lord while He is the Lord of all things? And every soul earns not [blame] except against itself, and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you concerning that over which you used to differ.\"",
            "description": [
                "Since God is the Lord of the",
                " entire universe, how could anyone be His",
                " lord? Since the entire universe is yoked",
                " to obedience to God, man is an",
                " integral part of the universe, how can",
                " he reasonably, look for another lord in",
                " that area of his life in which",
                " he uses his own volition,ind judgement? Is",
                " it appropriate for him to move in",
                " diametrical opposition to the entire universe?",
                "*145).",
                " Every person is responsible for whatever he",
                " does; and no one is responsible for",
                " the deeds of others."
            ]
        },
        {
            "verse-id": "[6:165]",
            "verse": "And it is He who has made you successors upon the earth and has raised some of you above others in degrees [of rank] that He may try you through what He has given you. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.",
            "description": [
                "This statement embodies three important truths: First,",
                " that human beings as such are vicegerents",
                " of God on earth, so that God",
                " has entrusted them with many things and",
                " endowed them with the power to use",
                " them. Second, it is God Himself Who",
                " has created differences of rank among His",
                " vicegerents. The trust placed in some is",
                " more than that of others. Some men",
                " have been granted control of more resources",
                " than others. Some are more gifted in",
                " respect of their abilities. Likewise, some human",
                " beings have been placed under the trust",
                " of others. Third, all this is indeed",
                " designed to test man. The entire life.",
                " of man is in fact, a vast",
                " examination wherein man is being tested about",
                " the trust he has received from God:",
                " how sensitive he is to that trust,",
                " to what extent he lives up to",
                " it, and to what extent he proves",
                " to be competent with it. What position",
                " man will be able to attain in",
                " the Next Life depends on the result",
                " of this test."
            ]
        }
    ]
}