{
    "name": "Al-Mumtahanah",
    "verse-count": 13,
    "verse-info": [
        {
            "id": "[60:1]",
            "verse": "O you who have believed, do not take My enemies and your enemies as allies, extending to them affection while they have disbelieved in what came to you of the truth, having driven out the Prophet and yourselves [only] because you believe in Allah, your Lord. If you have come out for jihad in My cause and seeking means to My approval, [take them not as friends]. You confide to them affection, but I am most knowing of what you have concealed and what you have declared. And whoever does it among you has certainly strayed from the soundness of the way.",
            "description": [
                "It would be appropriate to give at",
                " the outset the details of the incident",
                " concerning which these verses were sent down",
                " so that the subject that follows is",
                " understood easily. The commentators are agreed, and",
                " Ibn 'Abbas, Mujahid, Qatadah, 'Urwah bin Zubair",
                " and others also have unanimously reported, that",
                " these verses were revealed at the time",
                " when a letter of Hadrat Hatib bin",
                " Abi Balta'a to the pagans of Makkah",
                " was intercepted.",
                "It so happened that, when",
                " the Quraish broke the Treaty of Hudaibiyah,",
                " the Holy Prophet (upon whom be Allah's",
                " peace) started making preparations for an invasion",
                " of Makkah, but he did not tell",
                " anyone, except a few close Companions, what",
                " was the goal of the expedition. By",
                " chance at about the same time a",
                " woman arrived from Makkah, who had been",
                " a slave-girl of the Bani 'Abdul Muttalib,",
                " and then after her freedom had adopted",
                " singing as her profession. She complained of",
                " poverty to the Holy Prophet and requested",
                " for financial help. The Holy Prophet appealed",
                " to the Bani 'Abdul Muttalib and the",
                " Bani al-Muttalib and satisfied her need. When",
                " she was about to leave for Makkah,",
                " Hadrat Hatib bin Abi Balta'a met her",
                " and quietly gave her a letter addressed",
                " to some of the.Makkah chiefs and paid",
                " her ten dinars so that she kept",
                " the secret and carried the letter to",
                " the addressees secretly. When she had just",
                " left Madinah, Allah informed the Holy Prophet",
                " (Upon whom be Allah's peace) of it.",
                " So the Holy Prophet immediately sent Hadrat",
                " 'AIi, Hadrat Zubair and Hadrat Miqdad bin",
                " Aswad after her with the instruction: \"Make",
                " haste: At Raudah khaki (12 rules from",
                " Madinah on the road to Makkah) you",
                " will meet a woman, who carries a",
                " letter from Hatib to the pagans of",
                " Makkah Seize that letter by any means",
                " you like. If she delivers the letter",
                " willingly, Iet her go; if she refuses",
                " to deliver it, kill her.\" When these",
                " Companions reached the place, they found the",
                " woman there They demanded the letter from",
                " her. She replied that she had a",
                " letter. They searched her but could find",
                " no letter. At last, they told her",
                " to deliver the letter, otherwise they would",
                " strip her and search her. Whe she",
                " saw that there was no way of",
                " escape, she took out the letter from",
                " her hair-plait and delivered it to them,",
                " and they brought it to the Holy",
                " Prophet. When the letter was opened and",
                " read it was found to contain information",
                " to the Quraish that the Holy Prophet",
                " (upon whom be Allah's peace) was making",
                " preparations to attack them. (In different traditions",
                " different wordings of the letter have been",
                " reported but the purport of all is",
                " one and the same). The Holy Prophet",
                " asked Hadrat Hatib what induced him to",
                " act thus. He replied: \"Sir, do not",
                " make haste in this matter of mine.",
                " I have not done this because I",
                " have become a disbeliever or an apostate,",
                " and have started preferring disbelief to Islam.",
                " But the truth is that my near",
                " and dear ones arc still in Makkah.",
                " I do not belong to the tribe",
                " of the Quraish, but had settled there",
                " under the guardianship of some of them.",
                " The families of the Emigrants, which are",
                " still in Makkah, will be defended and",
                " protected by their tribes and clans, but",
                " 1 have no tribe, which could give",
                " protection to my family. Therefore, I sent",
                " this letter in order to keep the",
                " Quraish under obligation so that they did",
                " not harm my children. \" (According to",
                " Hadrat Hatib's .son `Abdur Rahman, Hadrat Habit",
                " had his children and brother still in",
                " Makkah at that time, and according to",
                " Hadrat Hatib's own report his mother also",
                " was there). Hearing what Hatib had to",
                " say, the Holy Prophet (upon whom be",
                " Allah's peace) said to the people: \"Hatib",
                " has told you the truth. \" That",
                " is, the real motive of his action",
                " was this and not any treachery against",
                " Islam or any intention to support disbelief.",
                " Hadrat `Umar rose and said: \"Permit me,",
                " O Messenger of AIlah, that I should",
                " cut off this hypocrite's head: he has",
                " been treacherous to Allah and His Messenger",
                " and the Muslims.\" The Holy Prophet said:",
                " \"This man has participated in the Battle",
                " of Badr: You may not know, O",
                " `Umar, Allah may have looked favourably at",
                " the people of Badr and said: \"Do",
                " as you please, I have forgiven you.",
                " \" (The words in the last sentence",
                " are different in different traditions. In some",
                " these are to the effect: \"I have",
                " granted you forgiveness\"; in some other: I",
                " am your Forgiver\"; and in still an",
                " other: \"I will forgive you.\") Hearing this",
                " Hadrat 'Umar wept and said: \"Allah and",
                " His Messenger have the best knowledge. \"",
                " This is a resume of those many",
                " traditions which Bukhari, Muslim, Ahmad, Abu Da'ud,",
                " Timidhi Nasa'i, Ibn Jarir Tabari, Ibn Hisham,",
                " Ibn Hibban and Ibn Abi Hatim have",
                " related on the authority of several reliable",
                " transmitters. The most authentic of these is",
                " the tradition which Hadrat `Ali's secretary, 'Ubaidullah",
                " bin Abu Rafi', heard from Hadrat `Ali",
                " himself, and from him Hadrat 'Ali's grandson,",
                " Hasan bin Muhammad bin Hanafiyah, heard and",
                " conveyed to the later reporters. In none",
                " of these there is .any mention that",
                " Hadrat Hatib was pardoned when he presented",
                " this excuse. But there is no hint",
                " either to show that he was awarded",
                " some punishment. That is why the Muslim",
                " scholars have concluded that Hadrat Hatib's excuse",
                " was accepted and he was pardoned."
            ]
        },
        {
            "id": "[60:2]",
            "verse": "If they gain dominance over you, they would be to you as enemies and extend against you their hands and their tongues with evil, and they wish you would disbelieve.",
            "description": [
                "Although what has been said up to",
                " here, and what follows in this regard,",
                " was sent down in connection with the",
                " incident relating to Hadrat Hatib, Allah, instead",
                " of dwelling on his case only, has",
                " given the believers this lesson for ever",
                " and ever: \"It is contrary to the",
                " profession of the Faith that a person",
                " should act, out of any motive or",
                " reason, in a way detrimental to the",
                " interests of Islam and subservient to the",
                " interests of disbelief when a conflict is",
                " going on between Islam and disbelief and",
                " some people have adopted a hostile attitude",
                " towards the Muslims only because they are",
                " Muslims. Even if a person be wholly",
                " free from any ill-will against Islam and",
                " acts thus not with an evil intention",
                " but for the sake of a dire",
                " personal need, the act anyhow is unbecoming",
                " of a believer, and whoever acts thus",
                " strays from the right way.\""
            ]
        },
        {
            "id": "[60:3]",
            "verse": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allah, of what you do, is Seeing.",
            "description": [
                "The allusion is to Hadrat Hatib. As",
                " he had acted thus only in order",
                " to ensure that his mother and brother",
                " and children remained safe in the event",
                " of a war, it is being said:",
                " \"The relations for whose sake you have",
                " committed this grave error, will not save",
                " you on the Day of Resurrection. No",
                " one will dare come forward in the",
                " Court of Allah and say: `Our father,",
                " or our son, or our brother had",
                " committed this sin for ow sake; therefore,",
                " we may be punished instead of him.",
                " At that time everyone will be worried",
                " only about himself, and weighed down with",
                " the anxiety of somehow saving himself from",
                " the consequences of his own acts, not",
                " to speak of being ready to take",
                " the burden of another's sins on his",
                " head,\" This thing has been expressed in",
                " clearer words at several other places in",
                " the Qur'an. At one place it has",
                " boon said: \"To save oneself froth the",
                " torment of that Day, the culprit will",
                " wish to give his children, his wife,",
                " his brother, his kinsfolk, who gave him",
                " shelter, and all the people of the",
                " earth, in ransom that this device might",
                " rescue him.\" (Al-Ma'arij -11-14). At another place:",
                " `On the Day man shall flee froth",
                " his brother and his mother and his",
                " father and his wife and his children.",
                " Each one of them? an that Day,",
                " shall have enough to occupy him so",
                " as to make him heedless of others.\"",
                " ('Abasa: 34-37). *4) That is, \"All worldly",
                " relationships and bonds of lout and friendship",
                " shall be rendered void in the Hereafter.",
                " The people will not be judged as",
                " groups and parties and families, but every",
                " person will have to present himself as",
                " an individual and render his own account",
                " only. Therefore, no one in the world",
                " should commit a wrong for the sake",
                " of a relationship or friendship or fraternity,",
                " for he will himself have to face",
                " alI its consequences, and no one else",
                " will become a partner in a matter",
                " of his personal responsibility.\" *5) The following",
                " conclusions arc deduced from the details of",
                " the cast of .Hadrat Hatib, as mentioned",
                " above, and the verses which were sent",
                " down in this connection:",
                "(1) Whatever the",
                " motive of the person, it was in",
                " itself an act of espionage, and a",
                " very dangerous kind of espionage on a",
                " critical occasion. The enemy, who was absolutely",
                " unaware, had been informed of the immanent",
                " attack from Madinah. Then it was not",
                " a case based on suspicion but a",
                " letter written by the concerned person himself",
                " had been intercepted, after which no other",
                " proof of the guilt was required. These",
                " were not peace but war time conditions;",
                " yet the Holy Prophet (upon whom be",
                " Allah's peace) did not place Hadrat Hatib",
                " in confinement without giving-him a chance of",
                " self-defence: This chance also was not given",
                " him in camera but publicly before the",
                " people. This makes it manifest that there",
                " is no room in Islam for such,",
                " laws and regulations under which the ruler",
                " may have the right in any case",
                " to imprison a person only on the",
                " basis of his own knowledge or '",
                " suspicion. Islam also does not recognize the",
                " method of trying a person secretly in",
                " camera.",
                "(2) Hadrat Hatib was not only",
                " one of the Emigrants but also a",
                " participant in the Battle of Badr, and",
                " enjoyed a distinguished place among the Companions.",
                " But despite this a serious crime happened",
                " to be committed by him and Allah",
                " took him to task for this in",
                " the Qur'an as is evident from the",
                " above verses. In the Hadith too, his",
                " case has been narrated in detail and",
                " among the commentators also there may be",
                " none who has not made a reference",
                " to it. These arc some of the",
                " evidences which prove that the Companions were",
                " not innocent. They also could commit errors",
                " because of human weaknesses, and errors happened",
                " to be committed by them practically. The",
                " teaching of regarding them with respect and",
                " reverence that Allah and His Messenger have",
                " given, does not at all require that",
                " if one of them happened to conunit",
                " an error, it should not be mentioned,",
                " for evidently, if this were their demand,",
                " neither would Allah have mentioned them in",
                " His Book, nor the Companions and their",
                " successors and the traditionists and the commentators",
                " would have related their details in their",
                " traditions and books.",
                "(3) The view that",
                " Hadrat `Umar expressed in the case of",
                " Hadrat Hatib concerned the apparent aspect of",
                " the act. His reasoning was that the",
                " act was clearly in the nature of",
                " treachery to Allah and His Messenger and",
                " the Muslims; therefore, Hatib was a hypocrite",
                " and deserved to be put to death.",
                " But the Holy Prophet (upon whom be",
                " Allah's peace) rejected his viewpoint and explained",
                " the viewpoint of the Islamic Shari'ah, saying:",
                " \"Decision should not be given only on",
                " the outward form of the act but",
                " it should also be seen what evidence",
                " is given by the past lift and",
                " general character of the person, who happens",
                " to commit the act and the circumstances",
                " under which he commits it. The act,",
                " no doubt, smacked of espionage, but did",
                " the attitude of the person concerned towards",
                " Islam and the followers of Islam until",
                " then indicate that he could do such",
                " a thing with the intention of treachery",
                " to AIlah and His Messenger and the",
                " Muslims? He was one of those who",
                " had emigrated for the sake of the",
                " Faith. Could he have made such a",
                " sacrifice without sincerity? He fought in a",
                " critical battle like Badr for the sake",
                " of his Faith when the Muslims were",
                " facing an enemy much better equipped and",
                " three times their number, Could the sincerity",
                " of such a person be doubted? Or,",
                " could it be believed that he had",
                " the slightest inclination towards the Quraish? He",
                " was telling the plain truth that his",
                " family at Makkah did not enjoy the",
                " protection of any tribe or clan, which",
                " the families of the other Emigrants enjoyed;",
                " therefore, he acted thus during war time",
                " only in order to safeguard his children",
                " from the persecution of the disbelievers. The",
                " facts confirmed that he did not really",
                " belong to any tribe at Makkah and",
                " this too was known that his family",
                " members were still back at Makkah. Therefore,",
                " there was no reason why his statement",
                " should be taken as false and the",
                " opinion formed that his actual motive was",
                " not this but the intention of treachery.",
                " No doubt, for a sincere Muslim even",
                " with a good intention it was not",
                " lawful that he should inform the enemy",
                " of the military plans of the Muslims",
                " only for the sake of his personal",
                " interests, yet there is a great difference",
                " between the error of a sincere Muslim",
                " and the treachery of a hypocrite. Both",
                " cannot be awarded the same punishment only",
                " on the basis of the similarity between",
                " their acts. This was the Holy Prophet's",
                " decision in this case, and Allah confirmed",
                " it in the verses of Surah AIMumtahinah.",
                " A careful study of the above three",
                " verses will show that in these Allah",
                " has certainly reprimanded Hatib, but it is",
                " a kind of a reprimand administered to",
                " a believer and not the one administered",
                " to a hypocrite. Moreover, no penalty, or",
                " physical punishment was awarded to him, but",
                " he was administered a severe rebuke publicly",
                " and lot off, which meant that in",
                " a Muslim society even a blot on",
                " the honour of a guilty believer and",
                " his falling into disrepute also was a",
                " very severe punishment.",
                "(4) About the great",
                " merit of tile Companions who fought at",
                " Badr, the Holy Prophet (upon whom be",
                " Allah's peace) said: You may not know",
                " Allah might have looked favourably at tilt",
                " people of Badr and said: 'Do as",
                " you please, I have forgiven you'.\" This",
                " does not moan that the Companions of",
                " Badr were forgiven each and . every",
                " sin and they were at liberty to",
                " commit whatever sin and crime they pleased,",
                " for forgiveness had already been guaranteed to",
                " them This was neither meant by the",
                " Holy Prophet (upon whom be Allah's peace)",
                " nor the Companions ever understood it in",
                " this meaning, nor any Canpartion of Badr",
                " after hearing this good news ever thought",
                " that he was free to commit any",
                " sin, nor ever any rule was made",
                " on the basis of this in the",
                " Islamic Shari'ah that if a Companion of",
                " Badr happened to commit a sin, he",
                " should not be given ally punishment for",
                " it. As a matter of fact, if",
                " one considers the circumstances under which this",
                " was said and the words that the",
                " Holy Prophet used on this occasion carefully,",
                " one can clearly understand the meaning to",
                " be this: \"It would not be anything",
                " impossible if in view of the great",
                " and meritorious services that the Companions rendered",
                " at Badr out of sincerity and devotion",
                " and at the very risk of their",
                " lives for the sake of Allah and",
                " His Religion, Allah might have forgiven all",
                " their former and latter sins mercifully. Therefore,",
                " you should not suspect such a Companion",
                " of treachery and hypocrisy, and should accept",
                " the excuse that he himself is presenting",
                " for his crime.\"",
                "(5) From the Qur'an",
                " and the Holy Prophet's sayings it also",
                " becomes evident that a Muslim's being involved",
                " in espionage for the disbelievers by itself",
                " is not a sufficient basis for the",
                " conclusion that he has become an apostate,",
                " or is devoid of the Faith, or",
                " is a hypocrite. For reaching such a",
                " conclusion if there arc some other circumstances",
                " and evidences, it would be a different",
                " thing; otherwise by itself this act is",
                " only a crime, not a sigin of",
                " disbelief.",
                "(6) From these verses of the",
                " Qur'an it also becomes evident that for",
                " a Muslim it is in no case",
                " permissible that he should spy for the",
                " disbelievers, no matter how gravely his own",
                " life and property, or that of his",
                " near and dear ones, might be endangered.",
                "",
                "(7) When Hadrat `Umar asked for the",
                " Holy Prophet's permission to put Hadrat Hatib",
                " to death for the crime of espionage,",
                " the Holy Prophet did not say that",
                " the crime was not punishable with -death,",
                " but declined permission on the ground that",
                " Hatib's being a Companion of Badr was",
                " an express proof of his being sincere,",
                " and the statement given by him was",
                " correct that be had acted thus not",
                " out of any good wishes for the",
                " enemies but for the sake of safeguarding",
                " his family from any possible persecution to",
                " death. From this one section of the",
                " jurists has argued that the general law",
                " in respect of a Muslim spy is",
                " that he should be put to death,",
                " unless there are very weighty-reasons for awarding",
                " him a lesser punishment or a mere",
                " reprimand. But the jurists have disputed this",
                " question. Imam Shafe'i and some other jurists",
                " hold the view that the Muslim spy",
                " is punishable, but not with death. Imam",
                " Abu Hanifah and Imam Auza'i maintain that",
                " he will be subjected to corporal punishment",
                " and long imprisonment. ImamMalik says that he",
                " will be put to death, but the",
                " Malik; jurists hold different views on this",
                " question. Ash'hab says that the Muslim ruler",
                " has vast powers in this matter. He",
                " can exercise his judgement keeping in view",
                " the circumstances of the crime and the",
                " culprit and award him any punishment. A",
                " saying of Imam Malik and Ibn al-Qasim",
                " also is to the same effect. Ibn",
                " al Majishun and `Abdul Malik bin Habib",
                " say that if the culprit is a",
                " habitual spy, he should be put to",
                " death. Ibn Wahb says that the punishment",
                " of the spy is death, but if",
                " he repents of spying, he may be",
                " pardoned. Sahnun says that one cannot know",
                " whether his repentance is genuine or deceptive;",
                " therefore, he should be put to death.",
                " There is a saying of Ibn al-Qasim",
                " also in support of this. And Asbagh",
                " says that the belligerent spy is punishable",
                " with death, but the Muslim or dhimmi",
                " spy should be given corporal punishment instead",
                " of the death sentence, unless he be",
                " helping the enemies openly as against the",
                " Muslims. (Ibn al-`Arabi, Ahkam al-Qur'an; 'Umdat al-Qari;",
                " Fath al-Bari.)",
                "(8) The Hadith that has",
                " been cited above also permits that for",
                " the investigation of the crime not only",
                " the male but the female accused also",
                " can be stripped if so required. Although",
                " Hadrat `Ali, Hadrat Zubair and Hadrat Miqdad",
                " had not stripped the woman, yet they",
                " had threatened her that if she did",
                " not produce the letter, thay would strip",
                " and search her.. Obviously, if it were",
                " not lawful, the three illustrious Companions could",
                " not have threatened her thus. And one",
                " can understand that they must have reported",
                " the story of their expedition on their",
                " return to the Holy Prophet (upon whom",
                " be Allah s peace). Had he expressed",
                " his displeasure, it must have been reported.",
                " That is why the jurists have held",
                " it as permissible. ('Umdat al-Qari)."
            ]
        },
        {
            "id": "[60:4]",
            "verse": "There has already been for you an excellent pattern in Abraham and those with him, when they said to their people, \"Indeed, we are disassociated from you and from whatever you worship other than Allah. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allah alone\" except for the saying of Abraham to his father, \"I will surely ask forgiveness for you, but I have not [power to do] for you anything against Allah. Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.",
            "description": [
                "That is, \"We reject you: we neither",
                " consider you to be in the right",
                " nor your religion. \" The inevitable demand",
                " of the faith in Allah is denial",
                " of taghut (Satan): \"Whoever rejects taghut and",
                " believes in Allah has taken a firm",
                " support that never gives way.\" (Al-Baqarah: 256).",
                " *7) In other words, it means: \"Though",
                " there is an excellent example for you",
                " in Abraham's conduct in that he expressed",
                " disapproval of his pagan people and broke",
                " off all connections with them, yet his",
                " promise to pray for the forgiveness of",
                " his pagan father and then carrying it",
                " out practically is not worth following, for",
                " the believers should not have even this",
                " much relationship of love and sympathy with",
                " the disbelievers. In At-Taubah: 113, Allah has",
                " clearly warned: \"It does not behove the",
                " Prophet and those who have believed that",
                " they should pray for the forgiveness of",
                " the polytheists even though they be near",
                " kinsmen. \" Thus, no Muslim is allowed",
                " to pray for the forgiveness of his",
                " unbelieving kinsmen on the basis of the",
                " argument that the Prophet Abraham had done",
                " so. As for the question, why did",
                " the Prophet Abraham pray thus, and did",
                " he carry out his promise practically? the",
                " answer has been provided by the Qur'an",
                " in full detail. When his father expelled",
                " him from the house, he had said",
                " on his departure: \"I bid you farewell:",
                " I will pray to my Lord for",
                " your forgiveness.\" (maryam: 47). On the basis",
                " of this very promise he prayed for",
                " him twice. One prayer is contained in",
                " Surah IbrMhim: 41: \"Lord, forgive me and",
                " my parents and the believers on the",
                " Day when reckoning will be hold. \"",
                " And the second prayer is in Surah",
                " AshShua'ra 86: \"Forgive my father, for indeed",
                " he is from among those who have",
                " strayed and do not disgrace the an",
                " the Day when the people will be",
                " raised back to life.\" But afterwards when",
                " he realized that the father for whose",
                " forgiveness he was praying, wan an enemy",
                " of Allah, he excused himself from it",
                " and broke off even this relationship of",
                " love and sympathy with him:",
                "\"As regards",
                " the prayer of Abraham for his father,",
                " it was only to fulfil a promise",
                " he bad made to him, but when",
                " he realized that he was an enemy",
                " of Allah, he disowned him. The fact",
                " is that Abraham was a tender-hearted, Godfearing",
                " and forbearing man (AT-Taubah: 114).",
                "A study",
                " of these verses make: the principle manifest",
                " that only that act of the prophets",
                " u worthy of following, which they persistently",
                " practised till the end. As regards those",
                " atta which they themselves gave up, or",
                " which Allah restrained them from practising or",
                " which were forbidden in the Divine Shari",
                " ah, they are not worth following, and",
                " no one shoWd follow such acts of",
                " theirs on the basis of the argument",
                " that that was such and such a",
                " prophet's practice.",
                "Here, another question also arises,",
                " which may create confusion in some minds.",
                " In the verse under discussion, the saying",
                " of the Prophet Abraham which Allah has",
                " declared as not worth following, has two",
                " parts. The first part is that he",
                " said to his father: \"I will pray",
                " for your forgiveness,\" and the second: `I",
                " have no power to get anything for",
                " you from Allah. \" Of these the",
                " first thing's not being a worthy examples",
                " to be. followed is understandable, but, what",
                " is wrong with the second thing that",
                " that too has been made an exception",
                " from being an example worthily of imitation,",
                " whereas it by itself is a truth?",
                " The answer is that the saying of",
                " the Prophet Abraham has been included in",
                " the exception for the reason that when",
                " a person after making a promise with",
                " another to do something, says that it",
                " is riot in his power to do",
                " anything beyond that for him, it automatically",
                " gives the meaning that if it were",
                " in his power to do anything further",
                " for him, he would have done that",
                " too for his sake. This makes his",
                " relationship of sympathy with the other person",
                " even more manifest. On that very basis",
                " this second part of the saying of",
                " the Prophet Abraham also deserved to be",
                " included in the exception, although its subject",
                " was true in so far as it",
                " does not lit even in the power",
                " of a Prophet to have a person",
                " forgiven by Allah. 'Allama Alusi also in",
                " his Ruh al-Ma ani has given this",
                " same answer to this question."
            ]
        },
        {
            "id": "[60:5]",
            "verse": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\"",
            "description": [
                "There are several ways in which the",
                " believers can become a cause of trial",
                " for the disbelievers, for which every believer",
                " should seek Allah's refuge. For example, (1)",
                " the disbelievers may gain in upper hand",
                " over them and consider it a proof",
                " of their being in the right and",
                " the believers' being in the wrong; otherwise",
                " it could not be that in spite",
                " of Allah's good pleasure that they claim",
                " to enjoy, the disbelievers would have been",
                " able to gain an upper hand over",
                " them; (2) the persecution of the believers",
                " by the disbelievers may become unbearable with",
                " the result that they may yield to",
                " them and abandon their Faith and moral",
                " values this would subject the believers to",
                " public ridicule and would provide the disbelievers",
                " with an opportunity w humiliate and debase",
                " than and their religion: (3) in spite",
                " of being the standard-bearers of the true",
                " Faith the believers may lose their moral",
                " superiority that should accrue W than as",
                " believers. and the people ma! ste the",
                " same defects and deficiencies in their character",
                " as are commonly found in an unIslamic",
                " community: this would give the disbelievers an",
                " opportunity to say that the Faith of",
                " the believers was in no way superior",
                " W their disbelief. (For further details sec",
                " E.N. 8.3 of Surah Yunus)."
            ]
        },
        {
            "id": "[60:6]",
            "verse": "There has certainly been for you in them an excellent pattern for anyone whose hope is in Allah and the Last Day. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.",
            "description": [
                "\"Who is hopeful Or Allah and the",
                " Last Day\": who expects that one Day",
                " he will have to present himself before",
                " AIIah and is hopeful that Allah will",
                " treat him benevolently and help him attain",
                " to success in the Hereafter. *10) That",
                " is, \"Allah has be need of such",
                " believers, who profess to believe in His",
                " Religion as well as maintain friendly relations",
                " with His enemies. He is Self Sufficient:",
                " His Godhead does not require that they",
                " should acknowledge Him as God. He is",
                " Self-Praiseworthy, i.e.'His being praiseworthy is not dependent",
                " on the people's praising and glorifying Him.",
                " , If they affirm the faith, they",
                " faith, they do so not for any",
                " good of AIlah, but for their own",
                " good: and they cannot gain anything from",
                " their affirmation of the faith until they",
                " break off all connections of love and",
                " friendship with the enemies of Allah as",
                " the Prophet Abraham and his companions did.",
                " \""
            ]
        },
        {
            "id": "[60:7]",
            "verse": "Perhaps Allah will put, between you and those to whom you have been enemies among them, affection. And Allah is competent, and Allah is Forgiving and Merciful.",
            "description": [
                "Although the true believers were following the",
                " exhortation to sever their connections with the",
                " unbelieving kinsmen patiently, yet Allah knew how",
                " hard it was to break off one's",
                " connections with one's parents, brothers and sisters",
                " and near relations. Therefore, Allah consoled them",
                " with the hope that a time would",
                " soon come when their same relations would",
                " become Muslims and their today's enmity would",
                " again change into love tomorrow. When this",
                " thing was said no one could understand",
                " how this would happen. But hardly a",
                " few weeks had passed after the revelation",
                " of these verses when Makkah fell and",
                " the people of Quraish began to enter",
                " Islam in large numbers, and the Muslims",
                " witnessed with their own eyes how the",
                " hope they were given materialized."
            ]
        },
        {
            "id": "[60:8]",
            "verse": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly.",
            "description": [
                "Here a doubt may arise in the",
                " minds. It is all right to treat",
                " the disbelievers, who are not hostile, kindly,",
                " but should only they be treated un-justly?",
                " And should the disbelievers, who arc hostile,",
                " be treated un-justly? The answer is that",
                " in this context, the word justice, in",
                " fact, has been used in a special",
                " sense. It means: \"Justice demands that you",
                " should not be hostile to those who",
                " are not hostile to you, for it",
                " is not justice to treat the enemy",
                " and the non-enemy alike. You have every",
                " right to adopt a stem attitude towards",
                " those who persecuted you for embracing Islam",
                " and compelled you to leave yew homes",
                " and pursued you even after your expulsion.",
                " But as for those who were not",
                " partners in persecuting you, you should treat",
                " them well and should fulfil the right",
                " they have on you because of blood",
                " and other relationships. \""
            ]
        },
        {
            "id": "[60:9]",
            "verse": "Allah only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion - [forbids] that you make allies of them. And whoever makes allies of them, then it is those who are the wrongdoers.",
            "description": [
                "The instructions to sever relations with the",
                " disbelievers given in the preceding verses, could",
                " cause the people the misunderstanding that this",
                " was because of their being the disbelievers.",
                " Therefore, in these verses it has been",
                " made clear that its actual cause is",
                " not their disbelief but their hostility to",
                " Islam and their tyrannical treatment of the",
                " followers of Islam. The Muslims, therefore, should",
                " distinguish between the hostile disbeliever and the",
                " non-hostile disbeliever, and should treat those disbelievers",
                " well who have never treated them evilly.",
                " Its best explanation is the incident that",
                " took place between Hadrat Asma', daughter of",
                " Abu Bakr, and her disbelieving mother. A",
                " wife of Hadrat Abu Bakr's was Qutaylah",
                " bint 'Abdul `Uzza, who wax a disbeliever",
                " and had remained behind in Makkah after",
                " the migration. Hadrat Asma' had been born",
                " of her. After the peace treaty of",
                " Hudaibiyah when the traffic opened between Makkah",
                " and Madinah, she came to Madinah to",
                " see her daughter and also brought sane",
                " gifts. Hadrat Asma' herself has related that",
                " she went to the Holy Prophet and",
                " asked: \"Should I see my mother? And",
                " can I treat her as a daughter",
                " should treat her mother?\" The Holy Prophet",
                " replied: \"Yes, treat her as your mother.",
                " \" (Musnad Ahmad, Bukhari, Muslim). Hadrat Asma's",
                " son, 'Abdullah bin Zubair, has given further",
                " details of this incident. He says that",
                " Hadrat Asma' in the beginning had refused",
                " to sec her mother. Then, when she",
                " received Allah and His Messenger's permission she",
                " met her. (Musnad Ahmad, Ibn Jarir, Ibn",
                " Abi Hatim). This by itself leads to",
                " the conclusion that a Muslim's serving his",
                " unbelieving parents and his helping his unbelieving",
                " brothers and sisters and relatives is permissible",
                " when they are not hostile to Islam;",
                " Likewise one can spend one s charities",
                " also on the indigent among the dhimmis",
                " (Al-Jassas, Ahkam al-Qur'an; Ruh al-Ma ani)"
            ]
        },
        {
            "id": "[60:10]",
            "verse": "O you who have believed, when the believing women come to you as emigrants, examine them. Allah is most knowing as to their faith. And if you know them to be believers, then do not return them to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers what they have spent. And there is no blame upon you if you marry them when you have given them their due compensation. And hold not to marriage bonds with disbelieving women, but ask for what you have spent and let them ask for what they have spent. That is the judgement of Allah; He judges between you. And Allah is Knowing and Wise.",
            "description": [
                "The background of this injunction is that",
                " after the peace treaty of Hudaibiyah, in",
                " the beginning, the Muslim men started fleeing",
                " Makkah and arriving at Madinah and they",
                " were sent back according to the terms",
                " of the treaty. Then the Muslim women",
                " started arriving and, first of all, Umm",
                " Kulthum Uqbah bin Abi Mu'ait emigrated to",
                " Madinah, The disbelievers invoked the treaty and",
                " demanded return, ands two brothers of Umm",
                " Kulthum, Walid bin `Uqbah and 'Amarah bin",
                " `Uqbah, came to Madinah to take her",
                " back. At this the question arose whether",
                " the treaty of Hudaibiyah applied to the",
                " women as well. Allah has answered this",
                " very question here, saying: \"If they are",
                " Minims, and it is ascertained that they",
                " have emigrated only for the sake of",
                " the Faith? and for no other motive,",
                " they arc not to be returned \"",
                "",
                "Here, a complication has arisen on account",
                " of the narration of the Hadith from",
                " the viewpoint of the meaning and content,",
                " and it must be resolved. The traditions",
                " that are found in the Ahadith about",
                " the conditions of the treaty of Hudaibiyah",
                " are mostly traditions narrated from the viewpoint",
                " of the meaning and purport, About the",
                " condition under discussion the words in the",
                " different traditions are different. In same the",
                " words are to the effect: \"Whoever reaches",
                " us from you, we will not return",
                " hira, but whoever reaches you from us,",
                " you shall return. \" In some others",
                " the words arc to the effect: \"Whoever",
                " of his Companions comes to the Messenger",
                " of AIIah without the permission of his",
                " guardian, he will send him back.\" And",
                " in still another the words are: \"Whoever,from",
                " the Quraish goes to Muhammad without the",
                " permission of his guardian, he will return",
                " him to Quraish. \" The style of",
                " these traditions by itself shows that this",
                " condition of the treaty has not been",
                " reported in the actual words of the",
                " treaty, but the reporters have reported its",
                " purport in their own words. But since",
                " most of the traditions arc of the",
                " same nature, the commentators and traditionists generally",
                " have understood that the treaty was general,",
                " which applied to both men and women,",
                " and the women too were to be",
                " returned according to it. Later, when this",
                " injunction of the Qur'an that the believing",
                " women were not to be returned, came",
                " to their knowledge, they interpreted it to",
                " mean that AIIah in this verse had",
                " decided to break the treaty in so",
                " far as it related to the believing",
                " women But this was not an ordinary",
                " thing which should be accepted so easily.",
                " If the treaty was general, without any",
                " exception in respect of men and women,",
                " it could not be lawful for one",
                " party to amend it unilaterally ar change",
                " a part of it by itself. And",
                " even if such a thing happened, it",
                " is strange that the Quraish did not",
                " protest against it, whereas they remained on",
                " the lookout for an opportunity to raise",
                " objections against everything that the Holy Prophet",
                " (upon whom be Allah's peace) and the",
                " Muslims did. Had they found that the",
                " Holy Prophet had committed a breach of",
                " the treaty conditions, they would have raised",
                " a loud clamour. But we do not",
                " find any trace of it in any",
                " tradition that they took an exception to",
                " this ruling of the Qur'an. Had this",
                " question been carefully considered the problem could",
                " have been resolved by reference to the",
                " actual words of the treaty. But many",
                " people paid no attention they it; if",
                " some scholars (e.g Qadi Abu Bakr Ibn",
                " al-'Arabi) did pay any attention, they did",
                " not hesitate to say that the reason",
                " why the Quraish did not raise any",
                " objection was that AIIah had miraculously scaled",
                " their mouths in this matter. It is",
                " strange how these scholars felt satisfied at",
                " this explanation.",
                "The fact of the matter",
                " is that this condition of the peace",
                " treaty had been proposed by the disbelieving",
                " Quraish, and not by the Muslims, and",
                " the words that Suhail bin 'Amr, their",
                " representative, had-got included in the treaty were:",
                " \"And that whichever man (rajul) cornea to",
                " you from us, even if he be",
                " on your religion, you will return him",
                " to us.\" These words of the treaty",
                " have been reproduced in Bukhari (Kitab ash-Shurut:",
                " Bab ash-Shurut fil-Jihad wal-Masalahah) through authentic channels.",
                " It may be that Suhail used the",
                " word rajul in the meaning of a",
                " person, but this might be the meaning",
                " he had in his mind. The word",
                " written in the treaty was rajul, which",
                " is used for a full-grown man in",
                " Arabic. That is why when the brothers",
                " of Umm Kulthum bint 'Uqbah came to",
                " the Holy Prophet (upon whom be Allah's",
                " peace) and demanded her return, (according to",
                " Imam Zuhri's tradition) the Holy Prophet (upon",
                " whom be Allah's peace) refused return her,",
                " saying: \"The condition was about the men,",
                " not the women. \" (Ibn al- Arabi,",
                " Ahkam al-Qur an; Loam Razi, Tafsir Kabir)",
                " Until then the people of Quraish themselves",
                " were under the delusion that the treaty",
                " applied to all kinds of emigrants, men",
                " or women; But when the Holy Prophet",
                " drew their attention to these words of",
                " the treaty, they were struck dumb and",
                " had to accept this decision.",
                "According to",
                " this condition of the treaty the Muslims",
                " had the right to decline return of",
                " any woman who emigrated from Makkah to",
                " Madinah, for any reason whatever. But Islam",
                " was interested only in safeguarding the believing",
                " omen and not to make the holy",
                " city of Madinah a place of refuge",
                " for every kind of female fugitive. Therefore,",
                " Allah enjoined: \"Ascertain by examination the faith",
                " of the women who emigrated to you",
                " and profess to have believed; and when",
                " it is fully ascertained that they have",
                " emigrated with genuine faith, and no other",
                " motive, do not return them.\" Thus, the",
                " procedure adopted for carrying out this Command",
                " was was that the women who emigrated",
                " were questioned whether they believed in the",
                " oneness of Allah and the Prophethood of",
                " Muhammad (upon whom be Allah's peace) and",
                " had emigrated only for the sake of",
                " Allah and His Messenger, and not out",
                " of any worldly consideration, e.g. hatred of",
                " the husband, or love of somebody in",
                " Madinah, or some other worldly motive. Only",
                " those women who gave satisfactory answers to",
                " these questions were detained, others were sent",
                " back. (Ibn Jarir on the authority of",
                " Iba `Abbas, Qatadah, Mujahid, `Ikrimah, Ibn Zaid).",
                "",
                "In this verse a basic principle of",
                " the Law of Evidence also bas been",
                " stated and its further clarification has been",
                " made by the procedure that the Holy",
                " Prophet (upon whom be Allah's peace) had",
                " prescribed for implementing it, The verse enjoins",
                " three things: (1) Examine the faith of",
                " the emigrating women who present themselves as",
                " believers; (2) Allah alone knows the truth",
                " about their faith; the Muslims have no",
                " means to find out whether they have",
                " really believed or not; and (3) when",
                " it has been ascertained that they are",
                " believers, they are not to be returned.",
                " Then, in accordance with this injunction, the",
                " method that the Holy Prophet prescribed for",
                " examining and ascertaining the faith of the",
                " women was that the statement given by",
                " them on oath should be relied on",
                " and it should be made sure after",
                " necessary examination that they had no other",
                " motive of emigration than the Faith. First,",
                " it gives the principle that for taking",
                " decision on different matters it is not",
                " necessary for the court to have direct",
                " knowledge of the truth; for the court",
                " only that knowledge is sufficient which is",
                " obtained through evidence. Second, the statement given",
                " by a person on oath will be",
                " regarded as reliable until it is proved",
                " to be false by a clear evidence.",
                " Third, whatever declaration a person himself may",
                " make about his creed and faith, will",
                " be accepted and no search will be",
                " made into finding out,whether what he states",
                " actually constitutes his faith or not, unless",
                " there is a clear indication to the",
                " contrary. And fourth, in the personal affairs",
                " of a person, which no one else",
                " can know, his own statement will be",
                " trusted. e.g. in the matters of divorce",
                " and the waiting period (iddat) the woman's",
                " own statement about her menstrual course and",
                " state of purity will be regarded as",
                " reliable, whether it is true or false.",
                " According to these very rules, in the",
                " science of the Hadith also, those traditions",
                " will be accepted, the apparent state of",
                " whose reporters testifies to their being righteous,",
                " unless, of course, there are other circumstances",
                " which forbid the acceptance of a particular",
                " tradition. *15) This means that a Muslim",
                " who wants to marry any of these",
                " women should pay a fresh dower and",
                " marry her. The dowers to he repaid",
                " to their unbelieving husbands will not be",
                " considered their dowers. *16) Four very important",
                " injunctions have been, laid down in these",
                " verses, which relate both to the family",
                " law of Islam and to the international",
                " law.",
                "First, that the woman who becomes",
                " a Muslim is no longer lawful for",
                " her unbelieving husband nor her unbelieving husband",
                " is lawful for her.",
                "Second, that the",
                " marriage of the married woman who becomes",
                " a Muslim and emigrates from the abode",
                " of disbelief (dar al-kufr to the abode",
                " of Islam (dar al-lslam) is automatically annulled,",
                " and any Muslim who likes can marry",
                " her after paying her dower.",
                "Third, that",
                " it is not lawful for a man",
                " who becomes a Muslim to retain his",
                " wife in wedlock if she likes to",
                " remain an infidel.",
                "Fourth that if there",
                " exist relations of peace between the abode",
                " of disbelief and the abode of Islam,",
                " the Islamic government should try to settle",
                " the question of the return of dowers",
                " with the non-Muslim government, thus: The dowers",
                " of the married women of the disbelievers,",
                " who become Muslims and emigrate to the",
                " abode of Islam, should be returned by",
                " the Muslims, and the dowers of the",
                " unbelieving married women of the Muslims. who",
                " are left behind is the abode of",
                " disbelief, should be got back from the",
                " disbelievers.",
                "The historical background of these injunctions",
                " is as follows: In the beginning of",
                " Islam, there were many such men, who",
                " accepted Islam but their wives did not",
                " become Muslim, and there were many such",
                " women who became Muslim but their husbands",
                " did not accept Islam. Abul-'As, the husband",
                " of Zainab, a daughter of the Holy",
                " Prophet (upon whom be Allah's peace), was",
                " a non-Muslim and he remained non-Muslim for",
                " several years. In the early period no",
                " command had been given to the effect",
                " that the pagan husband was unlawful for",
                " the Muslim wife and the pagan wife",
                " was unlawful for the Muslim husband. Therefore,",
                " the marital relations continued to exist between",
                " them, Even after the migration for several",
                " years, it so happened that many women",
                " became Muslim and emigrated Madinah while their",
                " pagan husbands remained in the abode of",
                " disbelief. Likewise, many Muslim men emigrated and",
                " their pagan wives were left in the",
                " abode of disbelief. But in spite of",
                " this their marriage continued. This was creating",
                " complications for the women in particular, for",
                " the men could marry other women, but",
                " this was not possible for the women.",
                " Until their marriage with their previous husbands",
                " was dissolved, they could not remarry. After",
                " the peace treaty of Hudaibiyah when these",
                " verses came down, they annulled the previous",
                " marriage between the Muslims and the pagans,",
                " and laid down an absolute and clear",
                " law for guidance in future. The jurists",
                " of Islam have codified this law under",
                " four major heads:",
                "First, the case when",
                " both the man and the wife are",
                " in the abode of Islam and one",
                " of them becomes a Muslim and the",
                " of her remains an infidel.",
                "Second, the",
                " case when both the man and the",
                " wife are in the abode of disbelief,",
                " and one of them becomes a Muslim",
                " and the other remains an infidel.",
                "Third,",
                " the cast when one of the spouses",
                " becomes a Muslim and emigrates to the",
                " abode of Islam and the other remains",
                " an infidel in the abode of disbelief.",
                "",
                "Fourth, the case when either of the",
                " Muslim spouses becomes an apostate.",
                "Below we",
                " give the viewpoints of the jurists with",
                " regard to a 11 the four cases",
                " separately:",
                "(1) In the first case, if",
                " the husband has accepted Islam and' his",
                " wife is a Christian or a Jewess,",
                " and she remains faithful to her religion,",
                " their marriage will endure, for it is",
                " permissible for a Muslim to have a",
                " wife who is a follower of the",
                " earlier scriptures. This is agreed upon by",
                " all jurists.",
                "And if the wife of",
                " the man, who has accepted Islam, is",
                " not a follower of the 'earlier Books,",
                " and she adheres to her Faith, the",
                " Hanafis say that Islam will be presented",
                " before her; if she accepts it, the",
                " marriage will endure; if she refuses to",
                " accept it, separation will be effected between",
                " them. In this case, if consummation between",
                " them had taken place, the woman will",
                " be entitled to the dower; if there",
                " was no consummation, she will not be",
                " entitled to any dower, for separation has",
                " been caused because of her refusal. (AI-Mabsut;",
                " Hedayah; Fath al-Qadir). Imam Shafe'i and Imam",
                " Ahmad say that if the spouses did",
                " not have had consummation, the woman would",
                " be outside wedlock as soon as the",
                " man accepted Islam, and if . consummation",
                " had taken place; the woman will remain",
                " in wedlock till three menstruations. During this",
                " period if she accepts Islam of her",
                " own tree wills the marriage will continue,",
                " otherwise it will become void automatically as",
                " soon as she is free from her",
                " third menstrual course. Imam Shafei also adds",
                " that it is not right to present",
                " Islam before the woman an the basis",
                " of the pledge of non-interference in religion",
                " that the dhimmis have been given by",
                " the Muslims. But this, in fact, is",
                " a weak argument for interference in the",
                " dhimmi woman's rcligion would be if she",
                " wascompelled to accept Islam. It is no",
                " interference to tell her that if she",
                " accepted Islam, she would continue to be",
                " her husband's wife, otherwise she would be",
                " separated from him. In Hadrat Ali's time",
                " there has been a precedent of this",
                " nature An Iraqi landowner who was a",
                " Majusi by rcligion accepted Islam and his",
                " wife remained an unbeliever, Hadrat 'AIi presented",
                " Islam before her, and when she refused",
                " to accept it, he effected separation between",
                " them. (Al-Mabsut). Imam Malik says that if",
                " consummation has not taken place, the unbelieving",
                " wife would forthwith cease to be the",
                " wife as soon as the man embraced",
                " Islam, and if consummation has taken place,",
                " Islam would be presented before the woman,",
                " and in case she refuses to accept",
                " it. separation will result. (Ibn Qudamah, Al-Mughni",
                " ).",
                "And if Islam has been accepted",
                " by the woman and the Fan remains",
                " an infidel. whether he is a follower",
                " of an earlier scripture or a non-follower,",
                " the Hanafis say that Islam will be",
                " presented before the husband whether consummation between",
                " them has taken place or not. If",
                " he accepts it, the woman will continue",
                " to be his wife; if he rejects",
                " it the qadi will effect separation between",
                " them. So long as the man does",
                " not refuse to acecpt Islam, the woman",
                " will remain his wife, but he will",
                " not have the right to have sexual",
                " relations with her. In cast the husband",
                " refuses, separation will become effective just like",
                " an irrevocable divorce. If consummation has not",
                " taken place before this, the woman will",
                " be entitled to half the dower, and",
                " if it has taken place, the woman",
                " will be entitled to full dower as",
                " well as maintenance during the waiting period",
                " ( iddat). (AI-Mabsut; Hedayah; Fath at-Qadir). According",
                " to Imam Shafe`i, marriage will dissolve as",
                " soon as the woman accepted lslam in",
                " case consummation has not taken place, and",
                " in case it has taken place, the",
                " woman will continue to be the man's",
                " wife till the end of the waiting",
                " period. If in the mean-time he accepts",
                " Islam, marriage will remain valid, otherwise separation",
                " will take place as soon as the",
                " waiting period comes to an end. But",
                " in the case of the man also",
                " Imam Shafe'i has expressed the same opinion",
                " as he has expressed about the woman",
                " as cited above. That is, it is",
                " not right to present Islam before him.",
                " But this is a weak opinion. In",
                " the time of Hadrat 'Umar, on several",
                " occasions, the woman accepted Islam and the",
                " man was invited to Islam; when he",
                " refused to accept it, separation was effected",
                " between the spouses There is, for examples",
                " the case of the wife of a",
                " Christian of the Bani Taghlib, which was",
                " brought before him. Hadrat `Umar said to",
                " the man, \"Accept Islam, otherwise I will",
                " effect separation between you two.\" He declined,",
                " and the Caliph enforced the decree. The",
                " case of a newly converted lady of",
                " Bahz al-Malik was sent to him. In",
                " her case too he ordered that Islam",
                " be presented before her husband; if he",
                " accepts it well and good, otherwise separation",
                " be effected between them. These incidents had",
                " happened in front of the Companions and",
                " no dispute or difference of opinion has",
                " been reported. (AI-Jassas, Ahkam al-Qur an; Al",
                " Mabsut; Fath al-Qadir). Imam Malik's opinion in",
                " this connection is that if the woman",
                " becomes a Muslim before the consummation of",
                " marriage Islam should be presented before the",
                " husband; if he accepts it, well and",
                " 'good; otherwise separation should be effected forthwith.",
                " An!? if consummation has taken place, and",
                " the woman has accepted Islam afterwards, she",
                " will have to wait till the end",
                " of the waiting period. If the husband",
                " accepts Islam in the meantime, marriage will",
                " continue otherwise separation will take place as",
                " soon as the waiting period expires. A",
                " saying of Imam Ahmad is in support",
                " of Imam Shafe'i. His other saying is",
                " to the effect that the event of",
                " the difference of religion between the spouses",
                " will in any case lead to immediate",
                " separation, whether consummation between them has taken",
                " place or not. (AI-Mughni).",
                "(2) If in",
                " dar al-kufr (abode of disbelief ) the",
                " woman becomes a Muslim and the man",
                " remains an infidel, or the man becomes",
                " a Muslim and the wife (who neither",
                " is Christian nor Jew but is follower",
                " of a non-revealed religion) remains an infidel",
                " the Hanafi viewpoint is that separation will",
                " not take place, whether consuummation between them",
                " has taken place or not, until the",
                " woman completes three menstrual courses, or until",
                " she passes three months in case she",
                " is non-menstruating. If in the meantime the",
                " other spouse is also converted, marriage will",
                " remain valid, otherwise separation will take place",
                " on the expiry of the term. Imam",
                " Shafe'i, in this case also, distinguishes between",
                " the occurrence of consummation and its nonoccurrence",
                " He maintains that if there was no",
                " consummation, separation would occur immediately on the",
                " event of the difference of religion between",
                " the spouses. And if the difference of",
                " religion has occurred after the consummation, marriage",
                " will continue valid until the end of",
                " the waiting period. If in the meantime",
                " the other spouse does.not accept Islam, marriage",
                " will dissolve as soon as the waiting",
                " period comes to an end. (AIMabsut, Fath",
                " al-Qadir, AI-Jassas Ahkam al-Qur an).",
                "In case",
                " where along with the difference of religion",
                " between the spouses the separation of abode",
                " also takes place, i.e. one of them",
                " remains an infidel in daral-kufr(the non-Muslim state)",
                " and the other emigrates to dar aI-lslam",
                " (the Islamic state), the Hanafi viewpoint is",
                " that marriage between them will automatically dissolve.",
                " If the emigrant is the woman, she",
                " has the right to remarry immediately; she",
                " does not have to observe any waiting",
                " period. However, her husband will have to",
                " abstain from sexual intercourse until after she",
                " has discharged the menses once; and if",
                " she is pregnant, even then marriage can",
                " be contracted, but the husband must abstain",
                " from cohabitation until after the delivery. Imam",
                " Muhammad and Imam Abu Yusuf have differed",
                " from Imam Abu Hanifah in this. They",
                " say that the woman has to observe",
                " the waiting period; and if she is",
                " pregnant, she cannot contract marriage before the",
                " delivery. (Al-Mabsut; Hedayah; AI-Jassas, Ahkam al-Qur'an). Imam",
                " Shafe.'i, Imam Ahmad and Imam Malik maintain",
                " that the separatIon of abode has nothing",
                " to do with this, for the real",
                " thing is only the deference of religion.",
                " If this difference takes place between the",
                " spouses, the injunctions to govern this are",
                " the same as those which govern it",
                " in case such a difference takes place",
                " between the spouses in the Islamic state",
                " (AI-Mughni). Imam Shafe`i along with his above-cited",
                " opinion has also expressed the view that",
                " if the emigrant Muslim woman has emigrated",
                " after a quarrel with her infide I",
                " husband, with the intention of dissolving his",
                " marital right, an immediate separation will take",
                " place not on the basis of the",
                " separation of abode (ikhtilaf dar) but on",
                " the basis of her this intention. (Al-Mabsut'",
                " Hedayah).",
                "But a careful consideration of the",
                " Qur'anic verse under discussion clearly shows that",
                " in this matter the most sound opinion",
                " is the one that Imam Abu Hanifah",
                " has expressed. AIlah has sent down this",
                " verse concerning the believing women who emigrated",
                " and about them He has said that",
                " they are no longer lawful for the",
                " pagan husbands whom they have left behind",
                " in dar al-k-kufr, and has allowed the",
                " Muslims of the Islamic state to marry",
                " them after they have paid them the",
                " dowers. On the other hand, the emigrant",
                " Muslims have been addressed and enjoined not",
                " to keep those of their pagan wives",
                " in wedlock, who are left is dar",
                " al-kufr, and to ask of the disbelievers",
                " the dowers that they had given to",
                " those women. Obviously, these injunctions do not",
                " pertain only to the difference of religion,",
                " but it is the difference of abode",
                " that has given these injunctions this particular",
                " form. If on account of migration the",
                " marriages of the Muslim women with. their",
                " pagan husbands had not become dissolved, how",
                " could the Muslims be permitted to marry",
                " them, and .that too in a way",
                " that the permission does not contain any",
                " reference to the observance of the waiting",
                " period by them? Likewise, if even after",
                " the revelation of the Command, \"and you",
                " also should not hold back unbelieving women",
                " in marriage the pagan wives of the",
                " Muslim emigrants had continued to be their",
                " wives, they also would have been commanded",
                " to divorce them. But there is no",
                " reference here to this either. No doubt,",
                " it is correct that after the revelation",
                " of this verse, Hadrat `Umar and Hadrat",
                " Talhah and some other Emigrants had divorced",
                " their wives, but this is no proof",
                " that such a thing was at aII",
                " necessary, and their severing of the marital",
                " relationship with those wives depended on their",
                " pronouncing divorce on them, and if they",
                " had not pronounced the divorce, the wives",
                " would have continued to be their legal",
                " wives.",
                "In response to this, three events",
                " of the Holy Prophet's time arc quoted",
                " as precedents, which arc regarded as a",
                " proof that even after the revelation these",
                " verses the Holy prophet (upon whom be",
                " Allah's peace), in spite of the separation",
                " of abode, allowed the marriage relationship to",
                " continue between the believing and the unbelieving",
                " spouses. The first event .is - this,",
                " A little before the conquest of Makkah,",
                " Abu Sufyan visited the Islamic army at",
                " Marr az-Zahran (present Wadi Fatimah) and accepted",
                " Islam, and his wife, Hind, remained a",
                " pagan in Makkah. Then Hind accepted Islam",
                " after the conquest of Makkah, and the",
                " Holy Prophet (upon whom be peace) ruled",
                " that their previous marriage would continue to",
                " be valid. The second event is that",
                " after the conquest of Makkah, `Ikrimah bin",
                " Abu Jahl and Hakim bin Hizam fled",
                " Makkah and in their absence the wives",
                " of both became Muslims Then they sought",
                " the Holy Prophet's protection for their husbands",
                " and went and brought them back. Both",
                " the men come before the Holy Prophet",
                " and accepted Islam and in their case",
                " too he held their previous marriages as",
                " valid. The third event relates to the",
                " Holy Prophet's own daughter, Hadrat Zainab, who",
                " emigrated to Madinah and her husband, Abul-'As,",
                " was left an infidel in Makkah. About",
                " him Musnad Ahmad, Abu Da'ud, Tirmidhi and",
                " Ibn Majah contain a tradition on the",
                " authority of Ibn `Abbas, saying that he",
                " came to Madinah in A.H. 8 and",
                " became a Muslim, and the Holy Prophet",
                " allowed his daughter to continue in marriage",
                " with him, without renewal of marriage. But",
                " the first two of these events, in",
                " fact, do not come under the definition",
                " of the difference of abode. For the",
                " difference of abode does not mean a",
                " person's .temporarily leaving one place for another,",
                " or his fleeting to another place, but",
                " the difference takes place only in case",
                " a person emigrates from one place and",
                " settles down in another place and the",
                " difference of nationality takes place between him",
                " and his wife. As for the event",
                " relating to Hadrat Zainab (may Allah bless",
                " her), there arc two traditions, one related",
                " on the authority of Ibn `Abbas, as",
                " referred to above, and the other related",
                " by Imam Ahmad, Tirmidhi and Ibn Majah",
                " on the authority of Hadrat 'Abdullah bin",
                " 'Amr bin `As. In this second tradition",
                " it has been stated that the Holy",
                " Prophet (upon whom be Allah's peace) allowed",
                " his daughter to continue as the wife",
                " of Abul-'As after renewal of the marriage,",
                " and with a fresh dower. Thus, in",
                " the first place, this precedent, due to",
                " the difference in reporting, no longer remains",
                " a definite argument with those who deny",
                " the legal effect of the separation of",
                " abode. Secondly, if they insist on the",
                " authenticity of Ibn `Abbas's tradition, it contradicts",
                " their own viewpoint. For, according to their",
                " viewpoint, the marriage of the spouses between",
                " whom difference of religion takes place and",
                " who have consummated their marriage remains valid",
                " only until three menstruations. In the meantime",
                " if the other party also accepts Islam",
                " the marriage continues to be valid, otherwise",
                " it dissolves automatically as soon as the",
                " third menstrual course starts. But in the",
                " case of Hadrat Zainab from which they",
                " take their argument, the difference of religion",
                " between the spouses had taken place several",
                " years earlier. Abul-'As had affirmed the faith",
                " six years after Hadrat Zainab's emigration, and",
                " at least two years before his conversion",
                " to Islam the injunction had been revealed'",
                " in the Qur'an, according to which the",
                " Muslim woman had been forbidden for the",
                " pagans. (4) The fourth case is of",
                " apostasy. Its one form is that both",
                " the husband and the wife should become",
                " apostates together, and the other that one",
                " of them becomes an apostate and the",
                " other remains a Muslim.",
                "If both the",
                " husband and the wife become apostates together,",
                " the Shafe'is and the Hanbalis say that",
                " their marriage contracted in Islam will dissolve",
                " immediately if this happened before consummation, and",
                " after the lapse of the waiting period",
                " if it happened after consummation. On the",
                " contrary, the Hanafis hold the view that.",
                " although according to common sense their marriage",
                " should dissolve, yet in the time of",
                " Hadrat Abu Bakr, when thousands of people",
                " became apostates, and then again became Muslims,",
                " the Companions did not direct anyone to",
                " renew the marriage; therefore, we accept this",
                " unanimous decision of the ('companions and admit,",
                " contrary to common sense, that in case",
                " both the husband and the wife become",
                " apostates together, their ' marriages do not",
                " dissolve.\"(AIMabsut; Hedayah; Fath al-Qadir Al-Fiqh 'alal-Madhahib al-",
                " Arba'h).",
                "If the husband becomes an apostate",
                " and the wife continues to be Muslim,",
                " according to the Hanafis and the Malikis,",
                " the marriage will dissolve immediately, whether this",
                " happens before consummation or after it. But",
                " the Shafe'is and the Hanbalis in this",
                " connection make a distinction between the two",
                " states. If it happens before consummation, the",
                " marriage will dissolved immediately, and if it",
                " happens after consumation it will endure till",
                " the end of the waiting period, In",
                " the meantime ii' the person returns to",
                " Islam, marriage will continue to hold good,",
                " otherwise, on teh expiry of the waiting",
                " period, it will be deemed to have",
                " dissolved since he became an apostate. That",
                " is, the woman will not have to",
                " observe another waiting period afresh. AlI the",
                " four jurists are agreed that if this",
                " happened before consummation, the woman would be",
                " entitled to half the dower, and if",
                " after consumation to full dower.",
                "And if",
                " the woman became an apostate, the old",
                " ruling of the Hanafis was that in",
                " this case too. marriage would dissolve immediately.",
                " But later the scholars of Balkh and",
                " Samarkand gave the ruling that in case",
                " the woman becomes an apostate, separation does",
                " not take place immediately; and by this",
                " their object was to discourage the women",
                " from adopting this course in order to",
                " get rid of their husbands. The Malikis'",
                " verdict is somewhat similar. They say that",
                " if circumstances testify that the woman adopted",
                " this course only as a pretence to",
                " win separation from the husband, separation will",
                " not take place. The Shafe'is and the",
                " Hanbalis say that in case of the",
                " woman's turning an apostate too, the law",
                " is the same as in case of",
                " the husband's turning an apostate. That is,",
                " if she became an apostate before consummation,",
                " marriage would dissolve immediately and if after",
                " consummation, Marriage will endure till the end",
                " of the waiting period. If conversion takes",
                " place in the meantime marriage will continue",
                " to hold good, otherwise it will be",
                " deemed to have dissolved since the time",
                " of apostasy. There is consensus with regard",
                " to the dower. If the woman became",
                " an apostate, before consumation she would not",
                " be entitled to any dower, and if",
                " she adopted apostasy after consummation, she would",
                " be entitled to full dower. (AI-Mabsut.' Hedayah;",
                " Fath al-Qadlr, AI Mughni; Al-Fiqh alal-Madhahib al-Arb",
                " ah)."
            ]
        },
        {
            "id": "[60:11]",
            "verse": "And if you have lost any of your wives to the disbelievers and you subsequently obtain [something], then give those whose wives have gone the equivalent of what they had spent. And fear Allah, in whom you are believers.",
            "description": [
                "This thing had two alternatives and the",
                " verse applies to both. First, with the",
                " disbelievers with whom the Muslims had treaty",
                " relations, they wanted to settle the matter,",
                " thus: \"We shall return the dowers of",
                " the women who have emigrated to us,",
                " and you will return the dowers of",
                " the pagan wives of our men) who",
                " have been left on your side.\" But",
                " the disbelievers did not agree to this.",
                " However, according to Imam Zuhri, the Muslims,",
                " in obedience to the Divine Command became",
                " ready to return the dowers of the",
                " women who were left behind with the",
                " pagans in Makkah, but the pagans refused",
                " to return the dowers of the women",
                " who had emigrated to the Muslims in",
                " Madinah. Thereupon Allah enjoined that the dowers",
                " of the emigrant women, which were to",
                " be returned to the pagans, should be",
                " collected together in Madinah instead of sending",
                " these to pagans; then from these collections",
                " disbursements should be made to those to",
                " whom the dowers were due from the",
                " pagans according to what was due to",
                " them.",
                "The second alternative was that there",
                " were several converts to Islam, who had",
                " emigrated to the abode of Islam from",
                " the territories of the disbelievers with whom",
                " the Muslims had no treaty relations, leaving",
                " their pagan wives behind. Likewise, some women",
                " also had become converts and emigrated, leaving",
                " their pagan husbands behind. About them it",
                " was decreed that the matter should be",
                " settled in the abode of Islam itself",
                " on the bargain basis. That is, when",
                " the dowers were not being returned by",
                " the disbelievers, no dowers should be returned",
                " to them Instead, the dower of the",
                " woman who had emigrated to the abode",
                " of Islam, should be paid to the",
                " person, whose wife had been left with",
                " the disbelievers.",
                "But in case the account",
                " could not be settled equitably thus, and",
                " the amount of the dower due on",
                " behalf of the disbelieving wives of Muslims,",
                " who were left in the abode of",
                " disbelief, exceeded the amount of the dowers",
                " of the Muslim women who had emigrated,",
                " it was en joined that the deficiency",
                " be made up from the spoils that",
                " the Muslims took in the wars against",
                " the disbelievers. Ibn 'Abbas has related that",
                " the Holy Prophet (upon whom be Allah's",
                " peace) would command that the loss of",
                " the person who did not receive his",
                " share of the dower be made up",
                " from the spoils. (Ibn Jarir). This same",
                " view has been adopted by 'Ata', Mujahid,",
                " Zuhri, Masruq Ibrahim Nakha'i, Qatadah, Muqatil and",
                " Dahhak. All these scholars say, that the",
                " people whose dowers are left with the",
                " disbelievers, should be paid these from the",
                " collective spoils taken from the enemy. That",
                " is, before the booty is distributed, the",
                " dead dowers of the people should be",
                " paid and then the distribution made in",
                " which these people too should be given",
                " their equal shares along with the other",
                " soldiers. Some jurists say that the loss",
                " of such people can be made up",
                " not only from the spoils but even",
                " from the fai properties But a largo",
                " section of the scholars does not subscribe",
                " to this view."
            ]
        },
        {
            "id": "[60:12]",
            "verse": "O Prophet, when the believing women come to you pledging to you that they will not associate anything with Allah, nor will they steal, nor will they commit unlawful sexual intercourse, nor will they kill their children, nor will they bring forth a slander they have invented between their arms and legs, nor will they disobey you in what is right - then accept their pledge and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful.",
            "description": [
                "As we have explained above, this verse",
                " was sent down some time before the",
                " conquest of Makkah. After the conquest the",
                " Quraish stated coming to the Holy Prophet",
                " in large numbers to take the oath",
                " of allegiance. From the men he took",
                " the oath himself on Mount Safa, As",
                " for the woman he appointed Hadrat 'Umar",
                " to administer the oath to them on",
                " his behalf and to ask them to",
                " pledge that they would refrain from the",
                " things mentioned in this verse. (Ibn Jarir,",
                " on the authority Of Ibn 'Abbas; Ibn",
                " Abi Hatim, on the authority of Qatadah).",
                " Then. on his return to Madinah he",
                " ordered the Muslim women of Madinah to",
                " be gathered together in a house and",
                " he sent Hadrat Umar to take the",
                " oath from them. (Ibn Jarir, Ibn Marduyah,",
                " Bazzar, Ibn Hibban, on the authority of",
                " Umm 'Atiyyah Ansariah). On the 'Id day",
                " also, after his address to men, he",
                " went to the assembly of women and",
                " in his sermon to than he recited",
                " this verse and asked them to pledge",
                " that they would refrain from the things",
                " mentioned in it. (Bukhari on the authority",
                " of Ibn `Abbas's tradition). Apart from these",
                " occasions. at different other tithes also, the",
                " women came before the Holy Prophet individually",
                " as well as collectively to take the",
                " oath of allegiance, as mentioned in several",
                " Ahadith. *19) In Makkah, when the oath",
                " of allegiance was being administered, Hind bint",
                " `Utbah. wife of Abu Sufyan, asked the",
                " Holy Prophet its explanation and said: \"Messenger",
                " of Allah, Abu Sufyan is rather stingy.",
                " Will it be sinful if I take",
                " out something from his wealth without his",
                " permission to meet my own and my",
                " children's needs?\" The Holy Prophet replied: \"Nay,",
                " but only ,lastly and lawfully; i.e. take",
                " only that much as may actually suffice",
                " for your needs.\" (Ibn al--'Arabi, Ahkam al-Qur'an).",
                " *20) This also includes abortion, whether ii",
                " is abortion of the legitimate or of",
                " the illegitimate foetus. *21) This implies two",
                " kinds of calumny: (1) a woman's accusing",
                " other women of having illicit relations with",
                " other men and her spreading such stories",
                " among the people, for the women are",
                " generally prone to spreading such things; and",
                " (2) a woman's delivering a child by",
                " somebody else and making her husband believe",
                " that it is his. Abu Da'ud has",
                " related a tradition from Abu Hurairah saying",
                " that he heard the Holy Prophet say:",
                " \"The woman who brings such a child",
                " into a family as does not actually",
                " belong to it, has no connection with",
                " Allah, and Allah will never admit her",
                " to Paradise.\" *22) In this brief sentence",
                " two important points of the law have",
                " been stated:",
                "First, that obedience even to",
                " the Holy Prophet (upon whom be Allah",
                " s peace) has boon restricted to \"in",
                " what is good\", although about the Holy",
                " Prophet no one could imagine that he",
                " would order somebody 10 do an evil",
                " From this it automatically follows that no",
                " one in the world can be obeyed",
                " outside the bounds of Divine law. For",
                " when obedience to Allah's Messenger-himself is conditional",
                " upon \"in what is good\". who else",
                " can have a position to demand unconditional",
                " obedience and require the people to obey",
                " and follow each of his commands laws,",
                " rules or customs, which are opposed to",
                " the law of Allah? The Holy Prophet",
                " (upon whom be Allah's peace) has stated",
                " this principle, thus: \"There is no obedience",
                " in the disobedience of Allah; obedience is",
                " only in what is good and right.\"",
                " (Muslim, Abu Da'ud, Nasa'i). Our great doctors",
                " have derived this very theme from this",
                " verse, Hadrat 'Abdur Rehman bin Zaid bin",
                " Aslam says:",
                "\"Allah has not said that",
                " they should not disobey you (the Holy",
                " Prophet) but that they should not disobey",
                " you in what is good.",
                "Then, when",
                " Allah Almighty has made obedience even to",
                " the Holy Prophet himself conditional upon this,",
                " how can another person have the right",
                " that he should be obeyed in anything",
                " but what is good?\" (Ibn Jarir).",
                "Imam",
                " Abu Bakr al-Jassas writes:",
                "\"Allah knew that",
                " His Prophet never enjoined anything but what",
                " was good. Still He restricted obedience to",
                " him only in what is good, so",
                " that no one ever may find a",
                " provision to obey the kings when they",
                " enjoined something outside the obedience of AIIah.",
                " The Holy Prophet (upon whom be Allah's",
                " peace) has said: 'He who obeys a",
                " creature in disobedience to the Creator, Allah",
                " appoints the. same c creature over him",
                " in power' . \" (Ahkam al-Qur an).",
                "",
                "'Allama Alusi says:",
                "\"This command refutes the",
                " view of those ignorant people who think",
                " that obedience to the ruler is absolutely",
                " necessary. Allah has restricted even obedience to",
                " His Messenger only in what is good,",
                " whereas the Messenger never enjoins anything but",
                " what is good. This is meant to",
                " wam the people that obedience to no",
                " one is lawful in disobedience to the",
                " Creator. \" (Ruh al-Ma ani).",
                "Thus, this",
                " command in fact, is the foundation stone",
                " of the rule of law in Islam.",
                " The rule is that anything which is",
                " opposed to the law of Islam is",
                " a crime, and no one has the",
                " right to enjoin any such thing on",
                " any one. Anyone who enjoins anything against",
                " the law, is a culprit; and the",
                " one who obeys such a command is",
                " . also a culprit. No subordinate can",
                " escape the punishment on the basis of",
                " the excuse that his superior officer had",
                " ordered him to do something which was",
                " a crime in the law.",
                "The other",
                " thing which has great legal import is",
                " that in this verse after enjoining five",
                " prohibitions only one positive command has been",
                " given, namely that the Holy Prophet (upon",
                " whom be Allah's peace) will be obeyed",
                " in aII good things. As for the",
                " evils, the major evils in which women",
                " of the pre-Islamic days were generally involved,",
                " have been mentioned and a pledge taken",
                " from them to refrain from them. But",
                " as for the good works, they have",
                " neither been mentioned nor any pledge taken",
                " to observe them. The only pledge that",
                " has been taken is that they will",
                " have to obey the Holy Prophet in",
                " every good work that he enjoins. Now",
                " obviously, if the good works be only",
                " those which AIIah Almighty has enjoined in",
                " the Qur'an,.the pledge should have been to",
                " the effect: \"You will not disobey AIIah,\"",
                " or \"You will not disobey the injunctions",
                " of the Qur'an.\" But when the pledge",
                " taken was to the effect: \"You will",
                " not disobey any good work that is",
                " enjoined by the Messenger of Allah\", it",
                " automatically leads to the conclusion that the",
                " Holy Prophet has been given vast powers",
                " for the reformation of society, and it",
                " is obligatory to obey aII his commands,",
                " whether they are found in the Qur'an",
                " or not.",
                "On the basis of this",
                " very legal authority the Holy Prophet (upon",
                " whom be Allah's peace) asked the women",
                " to pledge that they would refrain from",
                " all those evils which were prevalent among",
                " the women of .he Arabian society at",
                " that time, and gave several such commands",
                " as havc not been mentioned in the",
                " Qur'an. One may study the following AhadIth",
                " in this connection",
                "Ibn 'Abbas, Umm Salamah,",
                " Umm `Atiyyah Ansariah and others have reported",
                " that the Holy Prophet (upon whom be",
                " Allah's peace) while administering the oath of",
                " allegiance to the women asked them to",
                " pledge that they would refrain from mourning",
                " over the dead. These traditions havc been",
                " related by Bukhari, Muslim, Nasa'i and Ibn",
                " Jarir.",
                "A tradition reported by Ibn `Abbas",
                " contains this detal: \"The Holy Prophet appointed",
                " Hadrat `Umar to administer the oath of",
                " allegiance to the women and commanded that",
                " he should forbid them to mourn over",
                " the dead, for in the days of",
                " pre-Islamic ignorance women used to tear their",
                " clothes and hair, scratched their faces and",
                " bewailed in aloud voice.\" (Ibn Jarir).",
                "Zaid",
                " bin Aslam has reported that the Holy",
                " Prophet white administering the oath of allegiance",
                " forbade the women to scratch their faces",
                " tear their garments, bewail and sing verses",
                " while mourning over the dead. (Ibn Jarir).",
                " Another tradition bearing on the same subject",
                " has been reported by Ibn Abi Hatim",
                " and Ibn Jarir from a woman who",
                " was among the women taking the oath",
                " of allegiance .",
                "Qatadah and Hasan Basri",
                " (may Allah bless them) say that one",
                " of the things that the Holy Prophet",
                " (upon whom be Allah's peace) had made",
                " the women to pledge also was that",
                " they would refain from talking with the",
                " other men freely. Ibn 'Abbas has explained",
                " it in a tradition, thus: \"That they",
                " would not talk with the other men",
                " in private.\" Qatadah has further explained it",
                " thus: hearing this command Hadrat 'Abdur Rahman",
                " bin 'Auf said; `O Messenger of Allah.",
                " sometimes it so happens that we are",
                " not present in the house and somebody",
                " comes to see us.' The Holy Prophet",
                " replied: 'I do not mean this. \"That",
                " is, the woman is not forbidden to",
                " tell the visitor that the master of",
                " the house is not present.\" (These traditions",
                " have been cited by Ibn Jarir and",
                " Ibn Abi Hatim).",
                "Hadrat 'Abdullah bin 'Amr",
                " bin al-'As has reported another tradition from",
                " Umaimah bint-Rugaiqah, maternal aunt of Hadrat Fatimah",
                " (may AIlah be pleased with her), saying:",
                " \"The Holy Prophet made me to pledge",
                " that I would neither bewail the dead",
                " nor display myself like the women of",
                " the pre-Islamic paganism.\" (Musnad Ahmad, Ibn Jarir).",
                "",
                "Salmah bint Qais, a maternal aunt of",
                " the Holy Prophet, says: °I went before",
                " the Holy Prophet with some other women",
                " of the Ansar to take the oath",
                " of allegiance. He made us to pledge",
                " that we would abstain from the things",
                " mentioned in this verse, and then said:",
                " `Do not defraud your husbands.' When we",
                " were about to leave, a woman said",
                " to me: `Go and ask the Holy",
                " Prophet what is meant by defrauding the",
                " husbands?' When I went and asked the",
                " explanation, he replied: 'This that you should",
                " defraud him of his money and expend",
                " it on others.\" (Musnad Ahmad).",
                "Umm 'Atiyyah",
                " says: \"The Holy Prophet after administering to",
                " us the oath commanded us that we",
                " would attend the `Id congregational prayers, but",
                " the Friday prayer is not obligatory for",
                " us, and he forbade us to follow",
                " the bier.\" (Ibn Jarir).",
                "The people who",
                " think that the constitutional powers and authority",
                " that the Holy Prophet possessed emanated from",
                " his position as a ruler instead of",
                " his position as a Messenger of Allah,",
                " and say that since he was also",
                " the ruler at the time, whatever commands",
                " he gave in that capacity were only",
                " meant to be obeyed during his time,",
                " say an absurd thing. Consider the Holy",
                " Prophet's commands and intructiions that we have",
                " cited above. If these instructions given by",
                " him for the reformation of the woman",
                " had emanated only from his position as",
                " a ruler how could these reforms then",
                " be introduced and enforced among the women",
                " of the Muslim society of the entire",
                " world for ever? Which ruler has there",
                " been in the world, who might have",
                " had the position that a command issued",
                " by him just once for a reform",
                " might have become enforced in the Muslim",
                " society everywhere in the world for ever?",
                " (For further explanation, see E. N .",
                " 15 of Surah Al-Hashr). *23) Several authentic",
                " Ahadith show that in the Holy Prophet's",
                " time the procedure of administering the oath",
                " of allegiance to the women was different",
                " from that to the men. For the",
                " men the procedure was that the ones",
                " pledging allegiance would give their hand in",
                " the hand of the Holy Prophet and",
                " take the oath. As for the women;",
                " the Holy Prophet never took any woman's",
                " hand in his own hand, but adopted",
                " different other methods. In this connection, the",
                " following traditions have been reported:",
                "Hadrat 'A'ishah",
                " says: \"By God, in connection with the",
                " oath of allegiance the Holy Prophet's hand",
                " never touched any other woman's hand. While",
                " administering the oath of allegiance to a",
                " woman, he would only say to her:",
                " 'I have accepted your allegiance' .\" (Bukhari,",
                " Ibn Jarir).",
                "Umaimah bint Ruqaiqah has stated:",
                " \"I along with some other wvmcn went",
                " before the Holy Prophet to pledge allegiance,",
                " and ho made us to pledge according",
                " to this verse of the Qur'iin. When",
                " we said: `We will not disobey you",
                " in what is good and right', he",
                " said: 'As far as it is in",
                " your power.' We submitted: `AIIah and His",
                " Messenger arc more kind to us than",
                " we could be to ourselves.' Then we",
                " said: 'O Messenger of Allah, stretch your",
                " hand so that we may pledge allegiance.'",
                " He replied: 'I do not shake hands",
                " with women: I only make them take",
                " the pledge. So he made us to",
                " pledge.\" In another tradition she has stated:",
                " \"The Holy Prophet did not take the",
                " hand of any of us in his",
                " own hand. \" (Musnad Ahmad, Tirmidhi, Nasa'i,",
                " Ibn Majah, Ibn Jarir, Ibn Abi Hatim).",
                "",
                "Abu Da'ud, in Marasi, has related this",
                " from Sha'bi: \"While administering the oath of",
                " allegiance to the women, a sheet of",
                " cloth was stretched towards the Holy Prophet,",
                " which he took in his hand and",
                " said: `I do not take the woman's",
                " hand in my hand'.\" This same subject",
                " has been related by Ibn Abi Hatim",
                " from Sha'bi, by 'Abdur Razzaq from Ibrahim",
                " Nakha`i and by Sa'id bin Mansur from",
                " Qais bin Abi Hazim.",
                "Ibn Ishaq, in",
                " Maghazi has related this from Aban bin",
                " Salih.: \"The Holy Prophet would put his",
                " hand in a vessel full of water",
                " and then the woman also would put",
                " her hand in the same vessel. \"",
                " In Bukhari, a tradition from `Abdullah bin",
                " 'Abbas is to the effect: \"After giving",
                " the 'Id congregational sermon, the Holy Prophet",
                " went through the rows of the then",
                " to the place where the women were",
                " sitting. There, in his address, he recited",
                " this verse of the Qur'an, then asked",
                " the women: `Do you promise to act",
                " according to it?' A woman from the",
                " assembly replied: `Yes, O Messenger of Allah'",
                " .",
                "In a tradition related by Ibn",
                " Hibban, Ibn Jarir, Bazzar and others, Umm",
                " 'Atiyyah Ansariah has stated this: \"The Holy",
                " Prophet extended his hand from outside the",
                " house and we extended our hands from",
                " inside the house. \" But this does",
                " not prove that the wvmcn might have",
                " shaken hands with the Holy Prophet, for",
                " Hadrat Umm `Atiyyah has not made any",
                " mention of the shaking of hands. Probably",
                " on this occasion for the purpose of",
                " taking the pledge the Holy Prophet might",
                " have extended his hand from outside and",
                " the women their hands from inside the",
                " house towards him without any of their",
                " hands touching his."
            ]
        },
        {
            "id": "[60:13]",
            "verse": "O you who have believed, do not make allies of a people with whom Allah has become angry. They have despaired of [reward in] the Hereafter just as the disbelievers have despaired of [meeting] the inhabitants of the graves.",
            "description": [
                "The words in the original can have",
                " two meanings: First, that they have despaired",
                " of their well-being and rewards in the",
                " Hereafter just as the deniers of the",
                " life-after-death have despaired of the resurrection of",
                " their near and dear ones, who are",
                " dead and gone into the graves. This",
                " meaning has been given by Hadrat 'Abdullah",
                " bin 'Abbas and Hadrat Hasan Basri, Qatadah",
                " and Dahak (may AIlah bless them). The",
                " second meaning can.be: They have despaired of",
                " the mercy and forgiveness of the Hereafter",
                " just as the disbelievers, who are Iying",
                " in the graves, have despaired of every",
                " good, for they are certain of their",
                " being involved in the punishment. This meaning",
                " has been related from Hadrat `Abdullah bin",
                " Mas'ud and from Mujahid, 'Ikrimah, Ibn Zaid,",
                " Kalbi, Muqatil, Mansur (may Allah bless them",
                " all)."
            ]
        }
    ]
}