{
    "name": "Al-Munafiqun",
    "verse-count": 11,
    "verse-info": [
        {
            "id": "[63:1]",
            "verse": "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars.",
            "description": [
                "That is, \"Although the thing they. are",
                " uttering with the tongue is true by",
                " itself, it dces not reflect their belief.",
                " Therefore they lie when they say that",
                " they bear witness that you are a",
                " Messenger of AIIah.\" Here, one should clearly",
                " understand that an evidence or witness is",
                " composed of two things: first, the actual",
                " thing to which one bears the witness;",
                " second, the concerned person's own belief about",
                " the thing to which he bears the",
                " witness, Now, if the thing by itself",
                " is true and the belief of the",
                " bearer of witness also correspons to what",
                " he says, he will be truthful in",
                " every respect. And if the thing in",
                " itself is false; but the beater of",
                " the witness believes it to be right",
                " and true, he will be regarded as",
                " truthful in one way, for he is",
                " truthful in expressing his belief, and liar",
                " in another way, for the thing he",
                " is bearing witness to is by itself",
                " false. Contrary to this, if the thing",
                " by itself is true but the belief",
                " of the bearer of the witness is",
                " opposed to it, he will be regarded",
                " as truthful because he is testifying to",
                " the right thing, and a liar because",
                " his own belief is contrary to what",
                " he is saying with the tongue. For",
                " instance, if a Believer states that Islam",
                " is a taste religion, he is truthful",
                " in every respect, but if a Jew,",
                " while he is steadfast in his Judaism,",
                " states the same thing, he would be",
                " stating the right thing but his evidence",
                " would be regarded 8s false, for he",
                " is testifying against his faith and belief.",
                " And if he calls it a false",
                " religion, he would be uttering a false",
                " thing but he would be beating a",
                " true witness according to his belief."
            ]
        },
        {
            "id": "[63:2]",
            "verse": "They have taken their oaths as a cover, so they averted [people] from the way of Allah. Indeed, it was evil that they were doing.",
            "description": [
                "That is, they use the oaths that",
                " they swear to convince others of their",
                " Islam and faith as a shield to",
                " save themselves from the wrath of the",
                " Muslims so that they do not treat",
                " them as they treat their open enemies.",
                "",
                "These oaths may imply the oaths which",
                " they usually swear to convince others of",
                " their faith as well as those which",
                " they swore when they were caught committing",
                " some hypocritical act, and also those oaths",
                " which 'Abdullah bin Ubayy had sworn to",
                " contradict the report given by Hadrat Zaid",
                " bin Arqam. Besides these, there is another",
                " probability that Allah might have regarded this",
                " statement of theirs as an oath: \"We",
                " bear witness that you are Allah's Messenger.\"",
                " This last probability has given rise to",
                " a dispute among the jurists, namely: If",
                " a person states something with the words:",
                " \"I bear witness,\" will it be regarded",
                " as an oath or not? Imam Abu",
                " Hanifah and his companions (except Imam Zufar),",
                " Imam Sufyan Thauri and Imam Auza'i regard",
                " it as an oath (Yamin in the",
                " Shari'ah terminology). Imam Zufar says that it",
                " is not an oath. Two sayings from",
                " Imam Malik have been reported in this",
                " connection: first' that it is an oath",
                " absolutely, and second, that if while saying:",
                " \"I bear witness,\" his intention was to",
                " say: y God, I bear witness,\" or",
                " \"I bear witness before God,\" it would",
                " he a statement on oath, otherwise not.",
                " Imam Shafe'i says: 'Even if the person",
                " says the words: \"I bear witness before",
                " God.\" it would not be a statement",
                " made on oath, unless he uttered these",
                " words with the intention of swearing an",
                " oath,\" (AI-Jassas_, Ahkam al-Qur an; Ibn al'.Arabi.",
                " Ahkam al-Qur an).",
                "*3) The verb sadd",
                " in Arabic is transitive as well as",
                " intransitive. Therefore, saddu 'an sabil-Allah means; \"They",
                " turn away from the Way of Allah,\"",
                " as well as: 'they turn others away",
                " from the Way of AIIah.\" According to",
                " the first meaning the verse would 'mean:",
                " \"By means of these oaths they first",
                " plant themselves firmly among the Muslims and",
                " then invent ways to escape fulfilling demands",
                " of the faith and to avoid obedience",
                " to AIlah and His Messenger. \" According",
                " to the second meaning it would mean:",
                " \"They use their false oaths as a",
                " cover for committing evil deeds. Posing as",
                " Muslims they weaken the Muslim community from",
                " within: find out the secrets of the",
                " Muslims and convey these to their enemies,",
                " create doubts about Islam among the non-Muslims",
                " and use such devices for inspiring the",
                " simple Muslims with evil suggestions which a",
                " hypocrite in the guise of a Muslim",
                " only could do, for an open enemy",
                " of Islam cannot use them."
            ]
        },
        {
            "id": "[63:3]",
            "verse": "That is because they believed, and then they disbelieved; so their hearts were sealed over, and they do not understand.",
            "description": [
                "In this verse \"believing\" means professing the",
                " faith in order to be counted among",
                " Muslims, and 'disbelieving\" means not to believe",
                " sincerely and to persist in disbelief as",
                " usual. The verse means to say that",
                " when they, after due thought, decided to",
                " adopt this hypocritical attitude instead of adopting",
                " either belief or disbelief plainly, Allah caused",
                " a seal to be set on their",
                " hearts and deprived them of the grace",
                " to adopt the attitude and conduct of",
                " a true, sincere and noble person. Now,",
                " their power of understanding has been lost,",
                " their moral sense has become dead, and",
                " while following this way they never even",
                " feel that their habit of always telling",
                " lies, their deceitful behaviour and the ever",
                " present contradictions between their word and deed",
                " is a wretched state in which they",
                " have involved themselves. This is one of",
                " those verses in which the meaning of",
                " ';causing a seal to be set on",
                " the heart of somebody by Allah\" has",
                " been made clear. These people did not",
                " become hypocrites because Allah .had set a",
                " seal on their hearts; so faith did",
                " not enter them, and they became hypocrites",
                " under compulsion. But, in fact, Allah set",
                " a seal on their hearts only when",
                " they decided to persist in disbelief in",
                " spite of professing the faith outwardly. Then,",
                " they were deprived of the capacity to",
                " believe sincerely and of the grace of",
                " the moral attitude resulting from it. and",
                " were helped to persist in the hypocrisy",
                " and hypocritical morals, which they had chosen",
                " to adopt for themselves."
            ]
        },
        {
            "id": "[63:4]",
            "verse": "And when you see them, their forms please you, and if they speak, you listen to their speech. [They are] as if they were pieces of wood propped up - they think that every shout is against them. They are the enemy, so beware of them. May Allah destroy them; how are they deluded?",
            "description": [
                "Hadrat 'Abdullah bin 'Abbas has stated that",
                " 'Abdullah bin Ubayy WAS a strongly built,",
                " healthy, handsome and smooth-tongued person, and the",
                " same was the case will most .of",
                " his companions. They were aII the nobles",
                " of Madinah. When they came to sit",
                " in the Holy Prophet's assembly, they would",
                " sit reclining on cushions against the walls",
                " and would talk agreeably and convincingly. From",
                " their outward appearance and manner of speech",
                " no one could imagine that those honourable",
                " people of the city would be so",
                " wretched and degraded in their character.",
                "*6)",
                " That is, \"Those who sit reclining on",
                " cushions against the walls, are not nun",
                " but pieces of timber. Comparing them to",
                " timber is meant to imply that they",
                " are devoid of the moral sense which",
                " is the essence of humanity Then by",
                " comparing them to blocks of timber propped",
                " up against the walI, it has also",
                " been pointed out that they are absolutely",
                " worthless, for the timber would be useful",
                " only when it has been utilized in",
                " making of a ceiling, or a doorframe,",
                " or a piece of furniture. A block",
                " of timber that has just been placed",
                " against a walI serves no useful purpose",
                " at all. \"",
                "*7) This brief sentence",
                " portrays the state of their guilty conscience.",
                " Since they fully well knew what game",
                " of hypocrisy they were playing tinder the",
                " screen of their superficial faith, they always",
                " remained in a state of alarm, thinking",
                " as to when the secret of their",
                " treason might be exposed, or the believers",
                " might feel disgusted with their evil deeds",
                " and machinations and take them co task",
                " for them. If ever a cry was",
                " raised anywhere in the city, or a",
                " noise was heard; they inunediately grew alarmed",
                " and thought it was directed against themselves.",
                "",
                "*8) In other words, these hidden enemies",
                " arc more dangerous than the open enemies.",
                "",
                "*9) That is, \"Do not be deceived",
                " by their outward appearances. Beware of them,",
                " for they can deceive you any moment.",
                " \"",
                "*10) This is not a curse",
                " but a declaration of the verdict about",
                " them by Allah that they have become",
                " worthy of His punishment and He will",
                " certainly inflict His punishment on them. It",
                " is also possible that AIIah may not",
                " have used these words in their literal",
                " sense but in the meaning of a",
                " curse and condemnation according to Arabic idiom.",
                "",
                "*11) It has not been pointed out",
                " as to who perverts them from belief",
                " to hypocrisy. This by itself makes it",
                " clear that there is not one but",
                " manu factors responsible for their perversion. There",
                " is Satan, there are their evil friends,",
                " and there are their own selfish motives.",
                " Someone's wife or children become his motive,",
                " and someone is driven to perversion by",
                " the evil ones in his society, or",
                " by jealousy, spite and pride."
            ]
        },
        {
            "id": "[63:5]",
            "verse": "And when it is said to them, \"Come, the Messenger of Allah will ask forgiveness for you,\" they turn their heads aside and you see them evading while they are arrogant.",
            "description": [
                "That is, they not only refuse to",
                " come to the Messenger to seek forgiveness,",
                " but also on hearing the invitation they",
                " shake their heads with arrogance and pride,",
                " and remain adamant, thinking that it would",
                " be disgraceful for them to approach the",
                " Messenger to seek forgiveness. This is a",
                " clear sign that they are not believers.",
                ""
            ]
        },
        {
            "id": "[63:6]",
            "verse": "It is all the same for them whether you ask forgiveness for them or do not ask forgiveness for them; never will Allah forgive them. Indeed, Allah does not guide the defiantly disobedient people.",
            "description": [
                "This thing was reiterated in Surah At-Taubah,",
                " which was sent down three years after",
                " Surah Al-Mtutafiqun, cven in stronger words. In",
                " that Surah AIIah, while addressing the Holy",
                " Prophet (upon whom be Allah's peace) said",
                " this about the hypocrites: 'O Prophet (it",
                " will be aII the same) whether you",
                " beg forgiveness for them or not, for",
                " AIIah will not forgive them even if",
                " you beg forgiveness for them seventy times.",
                " This is because they have disbelieved in",
                " AIIah and His Messenger, and AIlah does",
                " not show guidance to the wrongdoers.\" (AtTaubah:",
                " 80). A little further on in that",
                " Surah it was again said: 'And never",
                " perform the funeral prayer for anyone of",
                " them W;10 dies nor stand at his",
                " grave, for they have denied Allah and",
                " His Messenger and diod while they were",
                " transgressors. \" (At-Taubah: 84)",
                "*14) Two things",
                " have been stated in this verse. First,",
                " that the prayer of forgiveness can be",
                " beneficial only for those who are guided",
                " aright. Let alone a common man, even",
                " if Allah's Messenger himself prays for the",
                " forgiveness of the person, who has turned",
                " away from guidance and adopted the way",
                " of sin and transgression instead of obedience,",
                " he cannot be forgiven. Second, that it",
                " is not Allah's way to bless with",
                " guidance those who do not seek His",
                " guidance. If a person himself turns away",
                " from Allah's guidance, rather shakes his head",
                " with arrogance and rejects the invitation when",
                " he is called towards guidance, Allah has",
                " no need that He should go after",
                " him with His guidance and implore him",
                " to come to the right path."
            ]
        },
        {
            "id": "[63:7]",
            "verse": "They are the ones who say, \"Do not spend on those who are with the Messenger of Allah until they disband.\" And to Allah belongs the depositories of the heavens and the earth, but the hypocrites do not understand.",
            "description": [
                ""
            ]
        },
        {
            "id": "[63:8]",
            "verse": "They say, \"If we return to al-Madinah, the more honored [for power] will surely expel therefrom the more humble.\" And to Allah belongs [all] honor, and to His Messenger, and to the believers, but the hypocrites do not know.",
            "description": [
                "Hadrat Zaid bin Arqam says: \"When I",
                " reported these words of Abdullah bin Ubayy",
                " to the Holy Prophet, and 'Abdullah bin",
                " Ubayy came and disowned them on oath,",
                " the elderly people of the Ansar, and",
                " cven my own uncle, reproved me for",
                " this; so much so that I felt",
                " that the Holy Prophet also had mistaken",
                " me for a liar and 'Abdullah bin",
                " Ubayy for a truthful person. This caused",
                " me great anguish and grief. Then, when",
                " these verses were revealed, the Holy Prophet",
                " call-d me, and taking hold of my",
                " car, said: \"The boy's ear was truthful",
                " AIIah has himself testified to what it",
                " had heard.\" (Ibn Jarir. In Tirmidhi also",
                " there is a tradition on the same",
                " subject).",
                "*16) That is, \"All honour belongs",
                " to Allah in virtue of His essence,",
                " to the Apostle in virtue of his",
                " Apostleship, and to the Believers in virtue",
                " of their faith. As for the disbelievers",
                " and the wicked people and the hypocrites,",
                " they have no share whatever in the",
                " real, true honour. \""
            ]
        },
        {
            "id": "[63:9]",
            "verse": "O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers.",
            "description": [
                "Now a word of admonition is being",
                " addressed to aII those people, who have",
                " entered Islam, whether they are true and",
                " sincere believers, or those who profess the",
                " faith merely verbally. As we have explained",
                " at several places above. the words alladhina",
                " amanu in the Qur'an are sometimes used",
                " to address the true believers and sometimes",
                " to address the hypocrites, for they profess",
                " the faith only with the tongue, and",
                " sometimes to address the Muslims of aII",
                " kinds in general The context itself shows",
                " which group is the audience at a",
                " particular place.",
                "*18) The mention of the",
                " possessions and the children, in particular, has",
                " been made, for man mostly turns away",
                " from the demands of the faith for",
                " the sake of their well-being and interests",
                " and becomes involved in hypocrisy, weakness of",
                " faith, or wickedness and disobedience; otherwise it",
                " implies everything of the world that allures",
                " and absorbs tnan so completely that he",
                " becomes heedless of the remembrance of God.",
                " This heedlessness in respect of the remembrance",
                " of God is indeed the root cause",
                " of all evil. If man only remembers",
                " that he is not free but the",
                " servant of One God, and that God",
                " is fully aware of all his actions",
                " and deeds, and he will by held",
                " accountable one day before Him for aII",
                " his actions and deeds, he would never",
                " be involved in any deviation and wickedness,",
                " and if ever he commits an error",
                " due to a human weakness, he will",
                " immediately rectify it as soon as he",
                " comes to realize his wrongdoing and repent.",
                ""
            ]
        },
        {
            "id": "[63:10]",
            "verse": "And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, \"My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[63:11]",
            "verse": "But never will Allah delay a soul when its time has come. And Allah is Acquainted with what you do.",
            "description": [
                ""
            ]
        }
    ]
}