{
    "name": "At-Tahreem",
    "verse-count": 12,
    "verse-info": [
        {
            "id": "[66:1]",
            "verse": "O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.",
            "description": [
                "This is not, in fact, a question",
                " but an expression of disapproval. The object",
                " is not to ask the Holy Prophet",
                " (upon whom be Allah's peace) why he",
                " had done so, but to warn him",
                " that his act to make unlawful for",
                " himself what AIIah had made lawful is",
                " not approved by Allah. This by itself",
                " gives the meaning that nobody has the",
                " power to make unlawful what Allah has",
                " made lawful; so much so that the",
                " Holy Prophet (upon whom be peace) himself",
                " also did not possess any such power.",
                " Although the Holy Prophet did not regard",
                " this as unlawful as a matter of",
                " faith nor legally but only forbade himself",
                " its use, yet since he was not",
                " an ordinary man but Allah's Messenger, and",
                " his forbidding himself something could have the",
                " effect that his followers too would have",
                " regarded it as forbidden, or at least",
                " reprehensible, or the people of his community",
                " might have thought that there was no",
                " harm in forbidding oneself something his AIIah",
                " had made lawful, Allah pointed it out",
                " to him and commanded him to refrain",
                " from such prohibition.",
                "*2) This shows that",
                " in this case the Holy Prophet had",
                " not made a lawful thing unlawfirl because",
                " of a personal desire but because his",
                " wives had wanted him to do so,",
                " and he had made it unlawful for",
                " himself only in order to please them.",
                " Here, the question arises: why has Allah",
                " particularly made mention of the cause of",
                " making the thing unlawful besides pointing out",
                " the act of prohibition? Obviously, if the",
                " object had been to make him refrain",
                " from making a lawful thing unlawfirl, this",
                " could be fulfilled by the first sentences",
                " and there was no need that the",
                " motive of the act also should have",
                " been stated. Making mention of it in",
                " particular clearly shows that the object was",
                " not to check the Holy Prophet only",
                " for making a lawful thing unlawful, but",
                " along with that to warn the holy",
                " wives also to the effect that in",
                " their capacity as the Prophet's wives they",
                " had not understood their delicate responsibilities and",
                " had made the Holy Prophet do a",
                " thing which could lead to making a",
                " lawful thing unlawful.",
                "Although it has not",
                " been mentioned ill the Qur'an as to",
                " what it was that the Holy Prophet",
                " had forbidden himself yet the traditionists and",
                " commentators have mentioned in this regard two",
                " differ. ent incidents, which occasioned the revelation",
                " of this verse. One of these relates",
                " to Hadrat Mariyah Qibiyyah (Mary, the Copt",
                " lady) and the other to his forbidding",
                " himself the use of honey.",
                "The incident",
                " relating to Hadrat Mariyah is that after",
                " concluding the peace treaty of Hudaibiyah one",
                " of the letters that the Holy Prophet",
                " (upon whom be Allah's peace) sent to",
                " the rulers of the adjoining countries was",
                " addressed to the Roman Patriarch of Alexandria",
                " also, whom the Arabs called Muqawqis. When",
                " Hadrat Hatib bin Abi Balta a took",
                " this letter to him, he did not",
                " embrace Islam but received him well, and",
                " in reply wrote: \"I know that a",
                " Prophet is yet to rise, but 1",
                " think he will appear in Syria. However,",
                " 1 have treated your messenger with due",
                " honour, and am sending two slave-girls to",
                " you, who command respect among the Coptics.",
                " \" (Ibn Sa'd). One of those slave-girls",
                " was Sirin and the other Mariyah (Mary).",
                " Un his way back from Egypt Hadrat",
                " Hatib presented Islam before both and they",
                " believed. When they came before the Holy",
                " Prophet (upon whom be peace) he gave",
                " Sirin in the ownership of Hadrat Hassan",
                " bin Thabit and admitted Hadrat Mariyah into",
                " his own household. In Dhil-Hijjah, A.H. 8",
                " she gave birth to the Holy Prophet's",
                " son, Ibrahim. (Al-Isti'ab; Al-Isabah). This lady was",
                " very beautiful. Hafiz Ibn Hajar in Al-Isabah",
                " has rclated this saying of Hadrat 'A'ishah",
                " about her: \"No woman's entry into the",
                " Holy Prophet's household vexed me so much",
                " as of Mariyah, because she was very",
                " beautiful and pleased him much. \" Concerning",
                " her the story that has been narrated",
                " in several ways in the Hadith is",
                " briefly as follows:",
                "One day the Holy",
                " Prophet (upon whom be peace) visited the",
                " house of Hadrat Hafsah when she was",
                " not at home. At that time Hadrat",
                " Mariyah carne to him there and stayed",
                " with him in seclusion. Hadrat Hafsah took",
                " it very iII and complained of it",
                " bitterly to him. Thereupon, in order to",
                " please her the Holy Prophet vowed that",
                " he would have no conjugal relation with",
                " Mariyah in future. According to some traditions,",
                " he forbade Mariyah for himself, and according",
                " to others, he also swore an oath",
                " on it. These traditions have been mostly",
                " reported by the immediate successors of the",
                " Companions without mentioning any intermediary link. But",
                " some of these have been reported from",
                " Hadrat 'Umar,. Hadrat `Abdullah bin 'Abbas and",
                " Hadrat Abu Hurairah also. In view of",
                " the plurality of the methods of narration,",
                " Hafiz Ibn Hajar in Fath al-Bari has",
                " expressed the view that there is some",
                " truth in the story. But in none",
                " of the six authentic collections of the",
                " Hadith has this story been narrated. In",
                " Nasa'i only this much has been rclated",
                " from Hadrat Anas: \"The Holy Prophet had",
                " a slave-girl with whom he had conjugal",
                " relations. Then, Hadrat Hafsah and Hadrat `A'ishah",
                " began to point out this to him",
                " repeatedly until he forbade her for himself.",
                " There upon, Allah sent down this verse:",
                " 'O Prophet. why do you maKe unlawful",
                " that which AIlah has made lawful for",
                " you?\"",
                "The other incident has been related",
                " in Bukhari, Muslim, Abu Da'ud, Nasa'i and",
                " several other books of Hadith from Hadrat",
                " `A'ishah herself and its purport is as",
                " follows:",
                "\"The Holy Prophet (upon whom be",
                " peace) usually paid a daily visit to",
                " aII his wives after the `Asr Prayer",
                " Once it so happened that he began",
                " to stay in the house of Hadrat",
                " Zainab bint-Jahsh longer than usual, for she",
                " had received sane honey from somewhere as",
                " a gift and the Holy Prophet was",
                " very fond of sweet things; therefore, he",
                " would have a drink of honey at",
                " her house. Hadrat 'A'ishah states that she",
                " felt envious of this and spoke to",
                " Hadrat Hafsah, Hadrat Saudah and Hadrat Safiyyah",
                " about it and together they decided that",
                " whoever of them was visited by the",
                " Holy Prophet, she should say to him:",
                " 'Your mouth smells of maghafir ' Maghafir",
                " is a kind of flower, which gives",
                " out an offensive smell, and if the",
                " bee obtains honey from it, it is",
                " also tainted by the same odour. They",
                " all knew that the Holy Prophet was",
                " a man of very fine taste and",
                " he abhorred that he should emit any",
                " kind of unpleasant smell. There fore, this",
                " device was contrived to stop him from",
                " staying in the house of Hadrat Zainab",
                " and it worked. When several of his",
                " wives told him that his mouth smelt",
                " of Maghafir, he made a promise not",
                " to use the honey any longer. In",
                " one tradition his words are to the",
                " effect \"Now, I will never have a",
                " drink from it: I have sworn an",
                " oath. \" In another tradition he only",
                " said: \"I will never have a drink",
                " from it,\" and there is no mention",
                " of the oath And in the tradition",
                " which Ibn al Mundhir, Ibn Abi Hatim,",
                " Tabarani and Ibn Marduyah have related from",
                " Ibn 'Abbas the words are to the",
                " effect: \"By God, I will not drink",
                " it!\"",
                "Our eminent scholars regard this second",
                " version as correct and the first as",
                " unreliable. Imam Nasa'i says: \"About honey the",
                " Hadith reported from Hadrat 'A'ishah is authentic,",
                " and the story of forbidding Hadrat Mariyah",
                " for himself by the Holy Prophet has",
                " not been narrated in a reliable way.\"",
                " Qadi 'Iyad says: \"The truth is that",
                " this verse was sent down concerning honey",
                " and not Mariyah.\" Qadi Abu Bakr Ibn",
                " al-'Arabi; also regards the story about honey",
                " as correct and the same is the",
                " opinion of Imam Nawawi and Hafiz Badruddiu",
                " 'Aini. Ibn Humam writes in Fath al-Qadir",
                " \"The story of the prohibition of honey",
                " has been narrated in Bukhari and Muslim",
                " from Hadrat `A'ishah who was herself a",
                " party to it; therefore, it is much",
                " more reliable.\" Hafiz Ibn Kathir says: \"The",
                " truth is that this verse was sent",
                " down about forbidding honey for himself by",
                " the Holy Prophet. \"",
                "*3) That is,",
                " \"Although the act of making a lawful",
                " thing unlawful only in order to please",
                " your wives was an act unbecoming of",
                " your high and responsible office, yet it",
                " was no sin, which might have entailed",
                " a punishment. Therefore, Allah has only pointed",
                " it out to you and corrected it,",
                " and has forgiven you for this error.",
                " \""
            ]
        },
        {
            "id": "[66:2]",
            "verse": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.",
            "description": [
                "It means: \"Act according to the method",
                " AIIah has prescribed for absolution from oaths",
                " by cxpiation in AI-Ma'idah :89 and break",
                " your promise that you have trade to",
                " forbid yourself a lawful thing. \" Here,",
                " an important legal question arises and it",
                " is this: Is this Command applicable to",
                " the case when a person has forbiddcn",
                " himsclf a lawful thing on oath, or",
                " is forbidding oncsclf a lawful thing by",
                " itsclf tantamount to swearing an oath, whether",
                " the words of the oath have been",
                " used or not'? The jurists in this",
                " regard have expressed different opinions:",
                "One section",
                " of them says that mere forbidding oncsclf",
                " a lawful thing is not an oath.",
                " If a person without swearing an oath",
                " has forbiddcn himself a wife, or some",
                " other lawful thing, it is an absurd",
                " thing which does not entail any expiation,",
                " but he can resume without any expiation",
                " the use of the thing that he",
                " had forbidden himself. This is the opinion",
                " of Masruq, Sha'bi, Rabi'ah and Abu Salamah;",
                " and the same view is held by",
                " Ibn Jarir and all the Zahiris. According",
                " to them forbidding oneself something would be",
                " an oath only in case express words",
                " of oath are used when forbidding it",
                " for oneself. In this regard, their reasoning",
                " is that since the Holy Prophet (upon",
                " whom be peace) while forbidding himself a",
                " lawful thing had also sworn an oath,",
                " as has been reported in several traditions,",
                " AIIah told him to act according to",
                " the method that had been appointed for",
                " absolving oneself from oaths.",
                "The second group",
                " says that to forbid oncsclf something without",
                " using the words of oath is not",
                " an oath by itself, but the case",
                " of the wife is an exception. If",
                " a person has . forbiddcn himself a",
                " garment, or an article of food, it",
                " is meaningless, and one can use it",
                " without expiation. But if concerning a wifc",
                " or a slave-girl he has said: \"I",
                " forbid myself an intercourse with her,\" she",
                " would not become unlawfirl and forbiddcn, but",
                " one would have to expiate the oath",
                " before going in to her. This is",
                " the opinion of the Shafe'is. (Mugni al-Muhtaj).",
                " And a similar opinion on this question",
                " is held by the Malikis. (Ibn al-'Arabi,",
                " Ahkam al-Qur an).",
                "The third group says",
                " that to forbid oneself something is by",
                " itsclf an oath even if the words",
                " of oath have not been used. This",
                " is the opinion of Hadrat Abu Bakr.",
                " Hadrat 'A'ishah, Hadrat 'Umar, Hadrat 'Abdullah bin",
                " Mas'ud, Hadrat Zaid bin Thabit and Hadrat",
                " 'Abdullah bin 'Abbas (may Allah bless them",
                " aII). Although from Ibn 'Abbas another opinion",
                " has been reported in Bukhari to the",
                " effect: \"If a tnan has forbidden himsclf",
                " his wifc, it is meaningless,\" yet it",
                " has been interpreted to mean that according",
                " to him this is not divorce but",
                " an oath which entails an expiation. For",
                " in Bukhari, Muslim and Ibn Majah, another",
                " saying of Ibn 'Abbas has been reported",
                " that to forbid oneself one's wife entails",
                " an expiation, and in Nasa'i the tradition",
                " is to the effect that when Ibn",
                " 'Abbas was asked his opinion on this,",
                " he said: \"She is not forbidden to",
                " you, but you must pay the expiation.\"",
                " and in Ibn Jarir's tradition the words",
                " of Ibn 'Abbas are to the effect:",
                " \"If the people forbid themselves what Allah",
                " has made lawful for them, they must",
                " expiate their oath.\" This same is the",
                " opinion of Hasan Basri, 'Ata, Ta'us. Suleman",
                " bin Yasar. Ibn Jubair and Qatadah, and",
                " the same has been adopted by the",
                " Hanafis. Imam Abu Bakr al-Jassas says: `The",
                " words of the verse lima tuharrimu do",
                " not indicate that the Holy Prophet (upon",
                " whom be peace) along with forbidding himself",
                " the lawful thing had also sworn an",
                " oath, therefore, one will have to admit",
                " that tahrim (to forbid oneself something) itself",
                " is an oath; for after it Allah",
                " made obligatory the expiation of the oath",
                " in connection with the prohibition.\" Farther on",
                " he writes again: 'Our companions (i.e. the",
                " Hanafis) regard tahrim as an oath in",
                " case it is not accompanied by the",
                " intention of divorce. If a person forbade",
                " himself his wife, he in fact said:",
                " \"By God, I will not come near",
                " you,\" thus, he committed ila' (act of",
                " temporary separation! . And if he forbade",
                " himself an article of food. etc, he",
                " in a wav said: \"By God, I",
                " will not use that article.\" For Allah",
                " first said: \"Why do you forbid that",
                " which AIIah has made lawful?\" and then",
                " said. \"AIIah has appointed a way to",
                " absolve you from your oaths.\" Thus, Allah",
                " has regarded tahrim as an oath, and",
                " the word tahrim in its meaning and",
                " legal effect becomes synonymous with an oath.\"",
                "",
                "Here, for the benefit of the common",
                " man, it would be useful to tell",
                " what is the legal command according to",
                " the jurists in respect of forbidding oneself",
                " one's wife and forbidding oneself other things",
                " besides the wife.",
                "The Hanafis say that",
                " if without the intention of divorce somebody",
                " forbade himself his wife, or swore an",
                " oath that he would not have conjugal",
                " relations with her, this would be ila",
                " (temporary separation), and in this cast he",
                " would have to expiate his oath before",
                " having the sexual relation . But if",
                " wit h the intention Of divorce he",
                " said: \"You are unlawful to me,\" it",
                " will have to be ascertained what was",
                " his actual intention. If his intention was",
                " of three divorces, the three divorces will",
                " take place, and if the intention was",
                " of a lesser number, of one or",
                " two divorces, only one divorce will take",
                " place in either case. And if some",
                " body says: \"I have forbidden myself whatever",
                " was lawful for me, this would not",
                " apply to the wife unless he said",
                " these words with the intention of forbidding",
                " himself the wife. Apart from the wife,",
                " one cannot use the thing O11e has",
                " forbidden oneself until one has expiated the",
                " oath. Badai as-Sana'i: Hedayah; Fath Al-Qadir,' al-Jassas,",
                " Ahkam al-Qur an.",
                "The Shafe'is say that",
                " if one forbids oneself the wife with",
                " the intention of divorce or zihar, the",
                " intended thing would become effective, whether it",
                " is a revocable divorce or an irrevocable",
                " divorce, or zihar. And if a person",
                " used the words of tahrim with the",
                " intention of both divorce and zihar, he",
                " would be asked to choose one, or",
                " the other, for both divorce and zihar",
                " cannot be established at one and the",
                " same time. Divorce dissolves marriage but in",
                " case of zihar it continues and if",
                " without any intention the wife is forbidden,",
                " she would not become forbidden, but expiation",
                " of the oath would become necessary. And",
                " if another thing, apart from the wife,",
                " is forbidden, it would be meaningless; there",
                " is no expiation for it. (Mughni al-Muhtaj).",
                "",
                "The Malikis say that if a person",
                " forbids himself anything other than the wife,",
                " it neither becomes forbidden nor entails an",
                " expiation. But if he says to the",
                " wife, \"You are unlawful, or unlawfirl for",
                " me, or I am unlawful for you,\"",
                " this would amount to a triple divorce",
                " in any case whether this was said",
                " to a wife with whom marriage has",
                " been consummated, or to one with whom",
                " it has not yet been consummated, unless",
                " his intention was of less than three",
                " divorces. Asbagh says: 'If a person says:",
                " whatever was lawful for me, is unlawful,",
                " the wife also becomes forbidden unless he",
                " makes an exception of the wife.\" In",
                " al-Mudawwanah, distinction has been made between the",
                " wife with whom marriage has been consummated",
                " and the wife with whom it has",
                " not been consummated. If one forbids oneself",
                " the former, a threefold divorce will take",
                " place irrespective of the intention, but in",
                " case of the latter the same number",
                " of divorces would take effect as was",
                " intended, and if there was no intention",
                " of any particular number, it would be",
                " considered a triple divorce (Hashiyah ad-Dusuqi). Qadi",
                " Ibn al-'Arabi in his Ahkam al-Qur'an has",
                " cited three statements of Imam Malik: (1)",
                " That forbidding oneself the wife amounts to",
                " an irrevocable divorce; (2) that it amounts",
                " to three divorces; and (3) that in",
                " case of the wife with whom marriage",
                " has been consummated it amounts to three",
                " divorces, bat in case of the one",
                " with whom it has not been consummated,",
                " to only one divorce if one was",
                " intended Then he says: 'The correct thing",
                " is that forbidding oneself the wife amounts",
                " to one divorce only. for if the",
                " man uses the word divorce instead of",
                " calling her unlawfirl without specifying the number,",
                " only one divorce will take place.\"",
                "Three",
                " different views in this regard have been",
                " reported from Imam Ahmad bin Hanbal: (1)",
                " That to forbid oneself the wife, or",
                " to make a lawful thing absolutely unlawful",
                " for oneself, is zihar, whether zihar was",
                " intended or not; (2) that this is",
                " an express allusion to divorce, and it",
                " amounts to pronouncing a triple divorce whether",
                " only one divorce was intended; and (3)",
                " that it is an oath, unless The",
                " man had the intention of divorce or",
                " zihar and in this case the same",
                " would take effect as was intended. Of",
                " these only the first one is the",
                " best known view among the Hanbalis. (Al-Insaf)",
                "",
                "*5) That is, \"Allah is your Master",
                " and Guardian of your affairs. He knows",
                " best in what lies your own good,",
                " and whatever Commands He has given, they",
                " are aII based on wisdom. \"The first",
                " thing means: \"You are not independent in",
                " this world, but you are servant of",
                " Allah and He is your Master; therefore,",
                " none of you possesses any power to",
                " alter or change the ways and methods",
                " prescribed by Him; the best thing for",
                " you is to entrust your affairs to",
                " Him and continue to obey Him. \"",
                "",
                "The second thing means that all the",
                " methods and laws that AIIah has enjoined,",
                " are based on knowledge and wisdom, Whatever",
                " He has made lawful, has been made",
                " lawful on the basis of knowledge and",
                " wisdom and whatever He has made unlawful",
                " also has been made unlawful on the",
                " basis of knowledge and wisdom. Nothing has",
                " been made lawful or unlawful at random.",
                " Therefore, those who believe in AIIah should",
                " understand that it is Allah Who is",
                " AII-Knowing and All-Wist and not they. and",
                " their well-being lies only in carrying out",
                " duly the Commands given by Him."
            ]
        },
        {
            "id": "[66:3]",
            "verse": "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\"",
            "description": [
                "Different things have been reported in different",
                " traditions, saying that the Holy Prophet had",
                " told such and such a thing to",
                " one of his wivcs in confidence, which",
                " she disclosed to another wife. But for",
                " us, in the first place, it is",
                " not right to investigate it, for it",
                " is on the disclosure of a secret",
                " that AIIah is taking a wife to",
                " task it cannot therefore be right for",
                " us to enquire into it and try",
                " to uncover it. Secondly, in view of",
                " the object for which this verse wa:",
                " sent down, it is not at alI",
                " important to know what the secret was.",
                " Had it any connection with the object",
                " of the discourse, Allah would Himself have",
                " mentioned it The real object for which",
                " this incident has been related in the",
                " Qur'iin is to warn the Holy Prophet's",
                " wives and. through them, the wives of",
                " the responsible people among the Muslims not",
                " to be careless in the matter of",
                " guarding secrets. Had it been only a",
                " private and personal affair, as is generally",
                " the case between the husband and the",
                " wife in the world there was no",
                " need that AIIah should have directly informed",
                " the Holy Prophet of it through revelation,",
                " and then did not rest content only",
                " with giving the information, but should also",
                " have recorded it in the Holy Book",
                " which the whole world has to recite",
                " forever. The reason why it was given",
                " such importance was that this wifc was",
                " not the wifc of an ordinary husband",
                " but of that illustrious husband, whom AIIah",
                " had appointed to the office of the",
                " highest responsibility, who was locked in an",
                " incessant battle with the disbelievers, polytheists and",
                " hypocrites at aII times and under whose",
                " leadership a fierce conflict was going on",
                " for establishing Islam in place of paganism.",
                " In the house of such an illustrious",
                " man there could be countless things which",
                " if not kept secret but disclosed before",
                " time, could harm the great mission which",
                " he was performing. Therefore, when a lady",
                " of the house happened to show this",
                " weakness for the first time in that",
                " she disclosed a secret that had been",
                " told her in confidence, to another (a",
                " member of her own household), the weakness",
                " was immediately pointed out to her, not",
                " secretly but openly in the Qur'an, so",
                " as to impart training in the guarding",
                " of secrets not only to the wivcs",
                " of the Holy Prophet but also to",
                " the wives of aII responsible people of",
                " the Muslim community. In the verse the",
                " question whether the secret disclosed pertained to",
                " a matter of any consequence or not,",
                " and whether its disclosure could cause any",
                " Iran' to the mission or not, has",
                " been altogether ignored. What has been disapproved",
                " and pointed out in particular is that",
                " the secret was disclosed to another. The",
                " higher the position of responsibility a person",
                " holds the more dangerous would be the",
                " leakage of secrets from his house. No",
                " matter whether a thing is of any",
                " consequence or not, once a person becomes",
                " careless in the matter of guarding secrets,",
                " he may reveal important things as well",
                " as trivial matters."
            ]
        },
        {
            "id": "[66:4]",
            "verse": "If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.",
            "description": [
                "The word saghat in the original is",
                " from Baghy which means to swerve and",
                " to become crooked. Shah Waliyullah and Shah",
                " Rafi'uddin have translated this sentence thus: \"Crooked",
                " have become your hearts.\" Hadrat 'Abdullah bin",
                " Mas'ud, 'Abdullah bin 'Abbas, Sufyan Thauri and",
                " Dahhak have given this meaning of it:",
                " \"Your hearts have swerved from the right",
                " path.\" Imam Razi explains it thus: \"Your",
                " hearts have swerved from what is right,",
                " and the right implies the right of",
                " the Holy Prophet (upon whom be Allah's",
                " peace).\" And 'Allama Alusi's commentary is Although",
                " it is incumbent on you that you",
                " should approve what the Holy Messenger (upon",
                " whom he peace) approves and disapprove what",
                " he disapproves, yet in this matter your",
                " hearts have swerved from conformity with him",
                " and turned in opposition to him. \"",
                "",
                "*8) The word tazahur means to cooperate",
                " mutually in opposition to another person, or",
                " to be united against another person. Shah",
                " Waliyullah has translated this sentence, thus: \"If",
                " you mutually join together to cause distress",
                " to the Prophet. \" Shah 'Abdul Qadir's",
                " translation is: \"If you both overwhelm him.\"",
                " Maulana Ashraf 'AII Thanwi's translation urns: \"And",
                " if you both continued to work thus",
                " against the Prophet. \" And Maulana Shabbir",
                " Ahmad 'Uthmami has explained it thus: ,\"lf",
                " you two continued to work and behave",
                " thus (against the Prophet).\"",
                "The verse is",
                " clearly addressed to two ladies and the",
                " context shows that these ladies arc from",
                " among the wives of the Holy Prophet",
                " (upon whom be peace) for in vv.",
                " 1-5 of this Surah the affairs concerning",
                " the Holy Prophet's wives only have been",
                " discussed continuously, and this becomes obvious from",
                " the style of the Qur'an itself. .As",
                " for the question who were the wives,",
                " and what was the matter which caused",
                " Allah's displeasure, the details are found in",
                " the Hadith. In Musnad Ahmad, Bukhari, Muslim,",
                " Tirmidhi and Nasa'i, a detailled tradition of",
                " Hadrat 'Abdullah bin 'Abbas has been related,",
                " which describes the incident with sane variation",
                " in wording. Ibn 'Abbas says:",
                "\"I had",
                " been thinking a long time to ask",
                " Hadrat 'Umar as to who were the",
                " two of the Holy Prophet's wives, who",
                " had joined each other against him, and",
                " about whom Allah sent down this verse:",
                " In tatuba.....; but I could not muster",
                " courage because of his awe-inspiring personality until",
                " he left for Hajj and I accompanied",
                " him. On our way back while helping",
                " him to perform ablutions for the Prayer",
                " at one place I had an opportunity",
                " to ask him this question. He replied:",
                " they were 'A'ishah and Hafsah. Then he",
                " began to relate the background, saying: \"We,",
                " the people of Quraish, were used to",
                " keeping our women folk under strict control.",
                " Then. when we came to Madinah, we",
                " found that the people here were under",
                " the control of their wives, and the",
                " women of Quraish too started learning the",
                " same thing from them. One day when",
                " I became angry with my wife, I",
                " was amazed to see that she argued",
                " with me. I felt badly about her",
                " conduct. She said, 'Why should you feel",
                " so angry at my behaviour? By God,",
                " the wives of the Holy Prophet (upon",
                " whom be peace) answer him back face",
                " to face,' (the word in the original",
                " is li yuraji nahu) and some one",
                " of them remains angrily apart from hire",
                " for the whole day. (According to Bukhari:",
                " the Holy Prophet remains angry and- apart",
                " from her the whole day). Hearing this",
                " I came out of my house and",
                " went to Hafsah (who was Hadrat `Umar's",
                " daughter and the Holy Prophet's wife). I",
                " asked her. Do you answer back to",
                " the Holy Prophet (upon whom be peace)",
                " face to face? She said: Yes. asked:",
                " And does one of you remain apart",
                " from him for the whole day (According",
                " to Bukhiiri: the Holy Prophet remains angry",
                " and apart from her for the entire",
                " day). She said: Yes. I said: Wretched",
                " is the one from among you, who",
                " behaves thus. Has one of you become",
                " so fearless of this that AIIah should",
                " afflict her with His wrath because of",
                " the wrath of His Prophet and she",
                " should perish? So, do not be rude",
                " to the Prophet (here also the words",
                " are: la turaji-'i), nor demand of him",
                " anything, but demand of me whatever you",
                " desire. Do not be misled by this",
                " that your neighbor (i.e. Hadrat `A'ishah) is",
                " more beautiful and dearer to the Holy",
                " Prophet. After this I left her house",
                " and went to the house of Umm",
                " Salamah, who was related to me, and",
                " talked to her on this subject. She",
                " said: Son of Khattab, you are a",
                " strange man: you have meddled in every",
                " matter until you are now interfering in",
                " the affair between Allah's Messenger and his",
                " wives. She discouraged me. Then it so",
                " happened that an Ansari neighbor came to",
                " my house at night and he called",
                " out to me. We used to sit",
                " in the Holy Prophet's assembly by turns",
                " and each used to pass on to",
                " the other the news of the day",
                " of his turn. It was the time",
                " when we were apprehending an attack by",
                " the Ghassanids any time. On his call",
                " when I came out of my house,",
                " he said that something of grave significance",
                " had happened. 1 said: Have the Ghassanids",
                " launched an attack? He said: No, but",
                " something even more serious! The Holy Prophet",
                " (upon whom be peace) has divorced his",
                " wives. I said: Doomed is Hafsah (the",
                " words in Bukhari are: Raghima anfu Hafsah",
                " wa `Aishah). I already had a premonition",
                " of this.\"",
                "We have left out what",
                " happened after this, how next morning Hadrat",
                " 'Umar went before the Holy Prophet and",
                " tried to appease his anger. We have",
                " described this incident by combining the traditions",
                " of Musnad Ahmad and Bukhari. In this",
                " the word muraj`at which Hadrat `Umar has",
                " used cannot be taken in its literal",
                " sense, but the context shows that the",
                " word has been used in the sense",
                " of answering back face to face and",
                " Hadrat `Umar's saying to his daughter: La",
                " turaji- `I Rasul Allah clearly has the",
                " meaning: Do not be impudent to the",
                " Messenger of Allah, Some people say that",
                " this is a wrong translation, and their",
                " objection is: Although it is correct to",
                " translate muraja `at as answering hack, or",
                " answering hack face to face, yet it",
                " is not correct to translate it as",
                " \"bing impudent\" . These objectors do not",
                " understand that if a person of a",
                " lower rank or position answers back or",
                " retorts to a person of a higher",
                " rank and position, or answers him back",
                " face to face this very thing is",
                " described as impudence. For example, if a",
                " father rebukes his son for something or",
                " feels angry at his behaviour, and the",
                " son instead of keeping quiet or offering",
                " an excuse, answers back promptly this could",
                " only he described as impudence. Then, when",
                " the matter is not between a father",
                " and a son, but between the Messenger",
                " of Allah and an individual of his",
                " community, only a foolish person could say",
                " that it was not impudence.",
                "Some other",
                " people regard this translation of ours as",
                " disrespectful, whereas it could be disrespectful in",
                " case we had had the boldness to",
                " use such words in respect of Hadrat",
                " Hafsah from ourselves. We have only given",
                " the correct meaning of the words of",
                " .Hadrat 'Umar, and these words he had",
                " used while scolding and reproving his daughter",
                " for her error. Describing it as disrespectful",
                " would mean that either the father should",
                " treat his daughter with due respect and",
                " reverence even when scolding and rebuking her",
                " or else the translator should render his",
                " rebuke and reproof in a way as",
                " to make it sound respectful and reverent.",
                "",
                "Here, what needs to be considered carefully",
                " is that if it was such an",
                " ordinary and trivial matter that when the",
                " Holy Prophet said something to his wives",
                " they would retort to Him, why was",
                " it given so much importance that in",
                " the Qur'an AIIah administered a severe warning",
                " directly to the wives themselves? And why",
                " did Hadrat 'Umar take it as such",
                " a grave matter that first he reproved",
                " his own daughter, then visited the house",
                " of the other wives and asked them",
                " to fear the wrath of Allah? And,",
                " about alI, was the Holy Prophet (upon",
                " whom be peace) also so sensitive that",
                " he would take offence at minor things",
                " and become annoyed with his wives, and",
                " was he, God forbid, so irritable that",
                " once having been annoyed at such things",
                " he had severed his connections with all",
                " his wives and retired to his private",
                " apartment in seclusion? If a person considers",
                " these questions deeply, he will inevitably have",
                " to adopt one of the two views",
                " in the explanation of these verses Either",
                " on account of his excessive concern for",
                " reverence for the holy wives he should",
                " not at aII mind if a fault",
                " is imputed to AIIah and His Messenger,",
                " or else he should admit in a",
                " straightforward way that at that time the",
                " attitude and behaviour of these holy wives",
                " has actually become so objectionable that the",
                " Holy Prophet (upon whom be peace) was",
                " justified in becoming annoyed over it, and",
                " more than that, AIIah Himself was justified",
                " that He should administer a severe warning",
                " to the wives on their unseemly behaviour",
                " and attitude.",
                "*9) That is, \"You would",
                " only harm yourselves if you upheld and",
                " supported each other against the Messenger of",
                " AIlah (upon whom be Allah's peace), for",
                " none could succeed against him whose Protector",
                " was Allah and who had Gabriel and",
                " the angels and alI the righteous Believers",
                " on his side. \""
            ]
        },
        {
            "id": "[66:5]",
            "verse": "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.",
            "description": [
                "This shows that the fault did not",
                " lie only with Hadrat 'A'isha and Hadrat",
                " Hafsah but the other wives also had",
                " some share in it. That is why,",
                " after them, aII the other wives too,",
                " have been warned in this verse. No",
                " light has been thrown on the nature",
                " of the error in the Qur'an. However,",
                " some details are found in the Hadith,",
                " which we shall relate below.",
                "In Bukhari,",
                " a tradition has been reported from Hadrat",
                " Anas, saying that Hadrat 'Umar said: \"The",
                " Holy Prophet's wives because of their mutual",
                " envies and rivalries had utterly displeased him.",
                " At this 1 said to them: It",
                " may well be that if the Holy",
                " Prophet divorced you, Allah would give him",
                " in your place better wives than you.",
                " \" Ibn Abi Hatim has, on the",
                " authority of Hadrat Anas, reported the statement",
                " of H_ adrat Umar in these words:",
                " \"I was informed that a discord had",
                " been created between the Holy Prophet (upon",
                " whom be peace) and his wives. At",
                " this I went to each of them",
                " and asked them to refrain from vexing",
                " the Holy Prophet; otherwise Allah would give",
                " him in their stead better wives than",
                " them selves. So much so that when",
                " I went to the last of them",
                " (and according to a tradition of Bukhari,",
                " to Umm Salamah), she said to me:",
                " O `Umar, is not the Holy Prophet",
                " (upon whom be peace) himself enough to",
                " admonish his wives? Then why should you",
                " come out to counsel them? This made",
                " me quiet, and after this Allah sent",
                " down this verse.'",
                "In Muslim, Hadrat `Abdullah",
                " bin 'Abbas has related that Hadrat 'Umar",
                " said to him: \"When the Holy Prophet",
                " (upon whom be Allah's peace) separated himself",
                " from his wives, I went to the",
                " Mosque and found the people worried and",
                " upset and playing with pebbles and saying",
                " to one another: 'The Holy Prophet (upon",
                " whom be peace) has divorced his wives.'",
                " After this Hadrat `Umar related his visiting",
                " the apartments of Hadrat 'A'ishah and Hafsah",
                " and admonishing them. then said: I went",
                " before the Holy Prophet (upon whom be",
                " peace) and said: Why do you feel",
                " upset with regard to your wives? If",
                " you divorce them, AIIah is with you,",
                " alI the angels and Gabriel and Michael",
                " arc with you, and I and Abu",
                " Bakr and all the Believers are with",
                " you. I thank Allah that seldom has",
                " it so happened that I said a",
                " thing and did not have hope from",
                " AIIah that He would testify to what",
                " I said. So, after this these verses",
                " of Surah At-Tahrim were sent down. Then",
                " I asked the Holy Prophet: Have you",
                " divorced your wives'? He said: No. Thereupon",
                " I stood at the entrance of the",
                " Mosque and announced in a loud voice:",
                " The Holy Prophet has not divorced his",
                " wives.\"",
                "The traditions related in Bukhari from",
                " Hadrat Anas and in Musnad Ahmad from",
                " Hadrat 'Abdullah bin `Abbas, Hadrat 'A'ishah and",
                " Hadrat Abu Hurairah say that the Holy",
                " Prophet had pledged to remain away from",
                " his wives for a month and he",
                " retired in seclusion to his apartment. When",
                " 29 days passed, Gabriel carne and said;",
                " \"You have fulfilled your oath: a month",
                " has come to completion.\"",
                "Hafiz Badruddin 'Aini",
                " in 'Umdat al-Qari has related this on",
                " the authority of Hadrat 'A'ishah: The wives",
                " of the Holy Prophet had become divided",
                " into two parties. one party consisted of",
                " Hadrat 'A'ishah herself and Hadrat Hafsah. Hadrat",
                " Saudah and Hadrat Safiyyah, and the other",
                " of Hadrat Zainab, Hadrat.Umm Salamah and the",
                " rest of the wives.",
                "These traditions indicate",
                " to some extent the conditions ,that existed",
                " in the Holy Prophet's domestic life at",
                " that time, which made it necessary that",
                " AIIah Almighty should intervene and reform the",
                " attitude of the holy wives. Although the",
                " wives were the best ladies of society,",
                " yet they were human beings and were",
                " not tree from human weaknesses. Sometimes when",
                " it became difficult for them to lead",
                " a life of continous poverty and hardship,",
                " they would become restive, impatient and would",
                " start pressing the Holy Prophet for better",
                " maintenance. At this AIIah sent down vv.",
                " 28-29 of Surah AI-Ahzah and admonished them",
                " to the effect: 'If you seek the",
                " world and it adotnments,.0ur Messenger will give",
                " you of these and send you of",
                " in a good way. But if you",
                " seek AIIah and His Messenger and the",
                " Hereafter, you should bear up against the",
                " hardships with patience, which you might have",
                " to face when living with the Messenger.\"",
                " (For details, see E.N. 41 of Surah",
                " Al-Ahzab and the Introduction to it). Then",
                " on account of the feminine nature they",
                " sometimes happened to behave in a way,",
                " which though not unusual in everyday human",
                " life, did not go well with the",
                " unique dignity and great responsibilities of the",
                " house to which AIIah had given them",
                " the honour to belong. So, when it",
                " was apprehended that those things might embitter",
                " the Holy Prophet's domestic life and might",
                " even adversely affect the great mission that",
                " AIIah had entrusted to him, He sent",
                " down this verse in the Qur'an, and",
                " reformed them so that the holy wives",
                " may realize the responsibilities of the position",
                " and rank which they had attained as",
                " the life-companions of the Last Messenger of",
                " Allah, and should not regard themselves as.ordinary",
                " women and their household as a common",
                " household. The very first sentence of this",
                " verse was such as might have caused",
                " Their hearts to shudder. There could be",
                " no severer warning for them than ,this:",
                " `It may well be that if the",
                " Prophet divorces aII of you, Allah will",
                " give him in your place better wives",
                " than yourselves.\" In the first place, even",
                " the thought of being divorced by the",
                " Prophet (upon whom be Allah's peace) was",
                " unbearable for them: more than that, this",
                " would deprive them of the honour of",
                " being Mothers of the Believers, and the",
                " other women whom Allah would give as",
                " wives to the Prophet would be better",
                " than them, After this it was no",
                " longer possible for the holy wives to",
                " behave in a way as would have",
                " occasioned a reproof from AIlah. That is",
                " why we find only two places in",
                " the Qur'an where these select and distinguished",
                " ladies have been administered a warning, in",
                " Surah Al-Ahzab and here in Surah ,At-Taltrim.",
                "",
                "*11) In the places where the words",
                " .muslim and mu min have been used",
                " together, muslim means the one who carries",
                " out Divine commands practically, and mu min",
                " the one who believes sincerely and truly",
                " Thus, the foremost quality of the best",
                " Muslim wives is that they should be",
                " believing in AIIah and His Messenger and",
                " His Religion (din) sincerely and also practically",
                " following Allah's Religion in their morals, habits,",
                " customs and conduct.",
                "*12) \"Obedient\" has two",
                " meanings and both are implied here (1)",
                " They are obedient to AIIah and His",
                " Messenger: (2) they are obedient to their",
                " husbands.",
                "*13) The word ta'ib when used",
                " as attribute of a man does not",
                " imply the one who offers repentance only",
                " once but the one who continues to",
                " implore AIIah again and again for the",
                " forgiveness of his mistakes, whose conscience is",
                " alive and active, who is always a",
                " are of his weaknesses and errors and",
                " is penitent for them. Such a person",
                " never feels proud, arrogant and conceited, but",
                " is gentle and clement by nature.",
                "*14)",
                " A worshipper can never be so heedless",
                " of God as a non-worshipper. This also",
                " helps much in making a woman a",
                " good wife. Being devout she adheres to",
                " the bounds set by AIIah, recognizes and",
                " discharges the rights of others and keeps",
                " her faith fresh and alive at aII",
                " times. Because of these qualities she can",
                " better be expected that she would not",
                " reject obedience to Divine Commands.",
                "*15) The",
                " word sa ihat in the original has",
                " been interpreted by several companions and large",
                " number of their successors to mean the",
                " same as sa imat 1 those given",
                " to fasting). The reason why the word",
                " siyahat journeying has been used for fasting",
                " is that in the ancient times journeys",
                " were mostly undertaken by the monks and",
                " ascetics, who had no provisions and had",
                " to go without food till they got",
                " something to eat from somewhere. On that",
                " account fasting also is a kind of",
                " asceticism, for a faster has to remain",
                " hungry until the time of breaking the",
                " fast. Ibn Jarir in his Commentary of",
                " At-Taubah 12 has cited a saying of",
                " Hadrat 'A'ishah, saying: \"The journeying (i.e. asceticism)",
                " of the Ummah is fasting. Here, making",
                " mention of fasting as an attribute of",
                " the pious wives dces not mean that",
                " they observe the obligatory fasting month of",
                " Ramadan only but that they observe voluntary",
                " fasts also besides the obligatory fasts.",
                "Addressing",
                " the holy wives Allah's saying: \"If the",
                " Holy Messenger divorces aII of you, AIIah",
                " will give him in your place better",
                " wives who will have this quality\" does",
                " not mean that the wives were not",
                " virtuous, but it means; \"Give up your",
                " wrong conduct which is causing so much",
                " distress to the Holy Prophet; instead, pay",
                " attention to developing in yourselves these noble",
                " qualities to the highest degree.'"
            ]
        },
        {
            "id": "[66:6]",
            "verse": "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.",
            "description": [
                "Thts verse tells that a person's responsibility",
                " is not confined to making effort to",
                " save himself from the punishment of God",
                " but it is also his responsibility that",
                " he should so educate and train to",
                " the best of his ability members of",
                " his family also to become Allah's favourite",
                " servants, who have been entrusted to his",
                " care in the natural process of life;",
                " and if they might be following a",
                " path to Hell, he should try. as",
                " far as he can, to correct them.",
                " His concern should not only be that",
                " his children should lead a happy and",
                " prosperous life in the world but; more",
                " than that, he should be anxious to",
                " see that they do not become fuel",
                " of Hell in the Hereafter. According to",
                " a tradition reported in Bukhiiri by Hadrat",
                " `Abdullah bin 'Umar, the Holy Prophet (upon",
                " whom be peace) said: \"Each one of",
                " you is a herdsman and is accountable",
                " with regard to his herd: the ruler",
                " is a herdsman and is accountable with",
                " regard to his subjects; the man is",
                " a herdsman of his family and is",
                " accountable with regard to them; and the",
                " woman is a herdsman of her husband's",
                " house and his children and is accountable",
                " with regard to them.\"",
                "Whose fuel...stone\" probably",
                " implies coal. Ibn Mas' ud, Ibn 'Abbas,",
                " Mujahid, Imam Muhammad al-Baqir and Suddi say",
                " that this will be brimstone.",
                "*17) That",
                " is, they will enforce on every culprit",
                " precisely the same punishment which they will",
                " be commanded to enforce on him without",
                " making any alteration in it, or showing",
                " any pity for him."
            ]
        },
        {
            "id": "[66:7]",
            "verse": "O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do.",
            "description": [
                "The style of both these verses contains",
                " a severe warning for the Muslims. In",
                " the first verse the Muslims have been",
                " addressed and told that they should save",
                " themselves and their households from the dreadful",
                " punishment; in the second that this will",
                " be said to the disbelievers while subjecting",
                " them to punishment in Hell. This by",
                " itself gives the meaning that the Muslims",
                " in the world should avoid adopting that",
                " conduct and behaviour in consequence of which",
                " they may have to meet with the",
                " fate as the disbelievers in the Hereafter:",
                ""
            ]
        },
        {
            "id": "[66:8]",
            "verse": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"",
            "description": [
                "Literally, \"taubat an-nasuh-an \"may either mean that",
                " one should offer such true repentance as",
                " may have no tinge of pretence and",
                " hypocrisy in it, or that one should",
                " wish one's own self well and repenting",
                " of sin should save oneself from the",
                " evil end, or that one should so",
                " adorn and improve one's life after repentance",
                " as to become a cause of admonition",
                " for others, and seeing his example others",
                " also may reform themselves accordingly. These are",
                " the meanings of taubat an-nasuh which- are",
                " indicated by its literal sense. As for",
                " its religious meaning, its explanation is found",
                " in the Hadith which Ibn Abi, Hatim",
                " has related on the authority of Zirr",
                " bin Hubaish. He says: \"When I asked",
                " Hadrat Ubayy bin Ka'b the meaning of",
                " taubat an-nasuh, he said that he had",
                " asked the Holy Prophet (upon whom be",
                " peace) the same question, and he had",
                " replied: 'It implies that when you happen",
                " to commit an error, you should feel",
                " penitent for it, then should implore Allah",
                " for forgiveness remorsefully, and then should refrain",
                " from committing the same error again.\" This",
                " same meaning has been reported from hadrat",
                " 'Umar. Hadrat 'Abdullah bin Mas'ud and Hadrat",
                " 'Abdullah bin `Abbas also, and in a",
                " tradition Hadrat 'Umar has defined taubat an-nasuh,",
                " thus: 'After offering repentance one should not",
                " even think of committing the sin, not",
                " to speak of repeating it.\" (Ibn Jarir)",
                " Hadrat 'Ali once heard a desert Arab",
                " chanting the words of repentance and forgiveness",
                " quickly and mechanically and remarked: `This is",
                " the repentance of the liars.\" The man",
                " asked: 'What is true repentance? Hadrat 'AIi",
                " replied: It should be accompanied by six",
                " things:",
                "(1) You should feel penitent for",
                " the wrong you have done: (2) you",
                " should carry out the duties that you",
                " havc ignored; t3) restore the rights that",
                " you have usurped; (4) ask forgiveness of",
                " him whom you have wronged; (S) make",
                " a resolve not to repeat the sin",
                " again; and (6) consume yourself in obedience",
                " to AIlah as you have so far",
                " been consuming it in wrongdoing, and cause",
                " it to taste the bitterness of obedience",
                " as you havc so far been causing",
                " it to enjoy the sweet taste of",
                " disobedience and sin. \" (Al-Kashshaf)",
                "In connection",
                " with repentance there are some other points",
                " also which should be well understood: (I)",
                " That repentance, in fact, is to show",
                " remorse for an act of disobedience only",
                " because it is a disobedience of Allah;",
                " otherwise to make a resolve to refrain",
                " from a sin because it is harmful",
                " for health, for instance, or it is",
                " likely to cause defamation or financial loss,",
                " is no repentance; (2) that man should",
                " offer repentance as soon as he realizes",
                " that he has committed disobedience of Allah",
                " and should compensate for it without delay",
                " in whatever form possible and should not",
                " defer it in any way; (3) that",
                " violating one's repentance again and making a",
                " jest of repentance and repeating the sin",
                " again and again of which one has",
                " repented, is a proof of the falsity",
                " of one's repentance, for the essence of",
                " repentance, is penitence, and breaking one's repentance",
                " repeatedly is a sign that it has",
                " not been motivated by penitence; (4) that",
                " if the person who has repented sincerely",
                " and resolved not to repeat the sin",
                " again, happens to repeat it once again",
                " because of human weakness, it will not",
                " revive his past sin: however, he should",
                " offer a fresh repentance for the latter",
                " sin sod should resolve more firmly that",
                " he would not commit the sin in",
                " future; (5) that it is not necessary",
                " to renew one's repentance again everytime one",
                " remembers the disobedience committed in the past,",
                " but if one's self derives pleasure from",
                " the remembrance of the past, sinful life,",
                " one should offer repentance again and again",
                " until the remembrance of the sins causes",
                " remorse instead of pleasure and enjoyment. For",
                " the person who has actually repented of",
                " disobedience because of fear of God cannot",
                " derive pleasure from the thought chat he",
                " has been disobeying God. His deriving pleasure",
                " from it is a sign that fear",
                " of God has not taken root in",
                " his heart.",
                "*20) The words of the",
                " verse deserve deep consideration. It has not",
                " been said chat if you repeat, you",
                " will surely be forgiven and will certainly",
                " be admitted to Paradise, but that: \"If",
                " you offer true repentance, it may well",
                " be that AIIah will treat you kindly.\"",
                " It means that it is not incumbent",
                " upon AIIah to accept the repentance of",
                " the sinner and to grant him Paradise",
                " instead of subjecting him to punishment but",
                " it will be His kindness and compassion",
                " that He may forgive well as reward",
                " His servant. One should have hope of",
                " Hit forgiveness, but one should not commit",
                " a sin with the confidence that one",
                " will achieve forgiveness by repentance.",
                "*21) That",
                " is, `He will not allow the reward",
                " of their good deeds to go to",
                " waste. He will not let the disbelievers",
                " and the hypocrites taunt the believers that",
                " they had gained nothing n spite of",
                " their worship. Humilitation will be the fate",
                " of the rebels and the disobedient and",
                " not of the faithful and obedient.\"",
                "*22)",
                " When this verse is read along with",
                " w. 12-13 of Surah AI-Hadid, it becomes",
                " clear that the running on of the",
                " light before the believers will take place",
                " when they will be proceeding towards Paradise",
                " from the Plain of Resurrection. There it",
                " will be pitch dark alI around and",
                " those who will have been condenmed to",
                " Hell, will be groping; about in it;",
                " the light will only be with the",
                " believers by which they will be travelling",
                " on their way. On this critical occasion,",
                " hearing the wailings and groanings of those",
                " groping in the dark the believers will",
                " be feeling terrorstricken- In view of their",
                " past errors and short-comings they will be",
                " afraid lest they too should be deprived",
                " of their light and made to grope",
                " about like those-wretched people. Therefore, they will",
                " pray: \"O our Lord, forgive us our",
                " sins and Iet our light remain with",
                " us until we reach Paradise.\" Ibn Jarir",
                " has cited Hadrat Abdullah bin 'Abbas as",
                " explaining the meaning of Rabbana-atimim lava nurana",
                " thus They will implore AIIah AI-mighty that",
                " their light be allowed to remain with",
                " thetas and kept from going out until",
                " they have crossed the bridge across Hell.\"",
                " The commentary given by Hadrat Hasan Basri,",
                " Mujahid and Dahhak also is almost the",
                " same. Ibn Kathir has cited their this",
                " saying: 'When the believers see that the",
                " hypocrites have been deprived of the light,",
                " they will pray to Allah for the",
                " perfection of their light.\" (For further explanation,",
                " see E.N. 17 of Surah Al Hadid).",
                ""
            ]
        },
        {
            "id": "[66:9]",
            "verse": "O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.",
            "description": [
                "For explanation, see E. N . ,",
                " 82 of Surah At-Taubah."
            ]
        },
        {
            "id": "[66:10]",
            "verse": "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\"",
            "description": [
                "This betrayal\" was not in the sense",
                " that they had committed an indecency but",
                " in the sense that they did not",
                " follow the Prophets Noah and Lot on",
                " the way of faith but sided with",
                " their enemies against them. Ibn 'Abbas say:",
                " 'No Prophet's wife has ever been wicked",
                " and immoral The betrayal of these two",
                " women in fact was in the matter",
                " of faith and religion: they did not",
                " acknowledge the religion of the Prophets Noah",
                " and Lot. The Prophet Noah's wife used",
                " to convey news about the believers to",
                " the wicked of her people, and the",
                " Prophet Lot's wife used to inform the",
                " immoral people about those who visited him",
                " in his house. \"(Ibn Jarir)."
            ]
        },
        {
            "id": "[66:11]",
            "verse": "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"",
            "description": [
                "From Pharaoh and his work\": from the",
                " evil end that Pharaoh would meet in",
                " consequence of his evil deeds."
            ]
        },
        {
            "id": "[66:12]",
            "verse": "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.",
            "description": [
                "It may be that the name of",
                " Mary's father was 'Imran, or she may",
                " have been called \"daughter of 'Imran\" because",
                " she belonged to the family of 'Imran.",
                "",
                "*27) This is a refutation of the",
                " accusation by the Jews that the birth",
                " of ,lesus was, God forbid, the result",
                " of a sin of his mother. Their",
                " same accusation has been called a monstrous",
                " calumny\" in An-Nisa`: 156. (For explanation, see",
                " E.N. 190 of An-Niasa').",
                "*28) That is,",
                " without her having any connection with a",
                " man, AIIah breathed into her womb a",
                " Spirit from Himself. (For explanation, see E.N.'s",
                " 212, 213 of An-Nisa' and E.N. 89",
                " of Al-Anbiya').",
                "*29) For the explanation of",
                " the object for which these three kinds",
                " of women have been cited as an",
                " example, see the Introduction to the Surah.",
                ""
            ]
        }
    ]
}