{
    "name": "Al-Qalam",
    "verse-count": 52,
    "verse-info": [
        {
            "id": "[68:1]",
            "verse": "Nun. By the pen and what they inscribe,",
            "description": [
                "The great commentator Mujahid says that by",
                " pen here is meant the Pen with",
                " which the Qur'an was being written down.",
                " From this it automatically follows that that",
                " which was being written implies the Holy",
                " Qur'an itself."
            ]
        },
        {
            "id": "[68:2]",
            "verse": "You are not, [O Muhammad], by the favor of your Lord, a madman.",
            "description": [
                "That is for which an oath has",
                " been sworn by the Pen and by",
                " the Book. It means that this Qur'an",
                " which is being inscribed by the hands",
                " of the writers of Revelation, is by",
                " itself enough to refute the slander of",
                " the disbelievers who say that the Holy",
                " Prophet (upon whom be peace) is, God",
                " forbid, a madman, Before his claim to",
                " the Prophethood, the people of Makkah looked",
                " upon him as the best of their",
                " men and trusted his honesty, intelligence and",
                " sagacity. But when he started reciting the",
                " Qur'an before them they began to call",
                " him a madman. This meant that the",
                " Qur'an itself in their sight was the",
                " cause because of which they accused him",
                " of madness; Therefore, it was said: \"The",
                " Qur'an by itself is a sufficient proof",
                " for the refutation of this slander. The",
                " presentation of this highly eloquent Revelation which",
                " consists of sublime themes, is an argument",
                " which proves that Muhammad (upon whom be",
                " Allah's peace and blessings) has been especially",
                " favoured by Allah, and nor an argument",
                " which might be used to prove that",
                " he has, God forbid, gone mad.\" Here,",
                " one should remember that although the address",
                " apparently is directed to the Holy Prophet,",
                " yet the real object is to nail",
                " the calumny of the disbelievers. Therefore, no",
                " ane should have the doubt that this",
                " verse was sent down only to assure",
                " the Holy Prophet that he was not",
                " mad. Obviously, the Holy Prophet himself had",
                " no such doubt for removing which he",
                " might have stood in need of such",
                " an assurance. The object was to tell",
                " the disbelievers, as if to say: \"The",
                " Qur'an because of which you-are calling the",
                " one presenting it a madman, is by",
                " itself an argument that your accusation is",
                " false.\" (For further explanation' see E.N. 22",
                " of Surah At-Tur)"
            ]
        },
        {
            "id": "[68:3]",
            "verse": "And indeed, for you is a reward uninterrupted.",
            "description": [
                "That is, \"You will get an unlimited",
                " and continuous reward, for although you have",
                " to hear discouraging and disturbing things in",
                " response to the efforts that you are",
                " making for the instruction and guidance of",
                " the people, yet you are steadfastly performing",
                " your Mission of calling them to the",
                " Right Way.\""
            ]
        },
        {
            "id": "[68:4]",
            "verse": "And indeed, you are of a great moral character.",
            "description": [
                "Here, this sentence gives two meanings: (1)",
                " \"That you stand exalted to a high",
                " and noble character; that is why you",
                " are enduring all these hardships in your",
                " mission of guiding the people to the",
                " Right Way, otherwise a tnan of weak",
                " character could not have done so;\" and",
                " (2) \"that besides the Qur'an, your high",
                " and noble character also is a clear",
                " proof that the accusation of madness that",
                " the disbelievers bring against you is absolutely",
                " false, for high morals and madness cannot",
                " co-exist in one and the same person.",
                " \" A madman is he whose balance",
                " of mind is upset, who has lost",
                " his temperamental equilibrium. Contrary to this, the",
                " high morals of a person testify that",
                " he is a right-minded and sound-natured person,",
                " who possesses perfect temperamental equilibrium. The people",
                " of Makkah were not unaware of the",
                " morals and character possessed by the Holy",
                " Messenger of AIIah. Therefore, it was enough",
                " just to make a reference to them",
                " so that every reasonable man of Makkah",
                " was made to think how shameless were",
                " those people who were calling a man",
                " of such sublime morals and character a",
                " madman. Their absurd conduct was not at",
                " all harmful for the Holy Prophet (upon",
                " whom be peace) but for themselves, for",
                " maddened in their craze for opposition they",
                " were saying such a thing about him",
                " which could not be regarded as credible",
                " by any man of understanding. The same",
                " also is the case with those men",
                " of knowledge and scholarship, who in the",
                " modern time are accusing the Holy prophet",
                " (upon whom be peace) of having fits",
                " of madness and epilepsy. The Qur'an is",
                " available everywhere in the world and the",
                " Holy Prophet's life also exists in the",
                " written form in entire detail. Every person",
                " can see it for himself what a",
                " foolish and meaningless thing is being uttered",
                " in their blind enmity by those who",
                " regard the man who brought this unique",
                " and matchless Book and who possessed such",
                " sublime morals and character as a mentally",
                " deranged person. The best description of the",
                " Holy Prophet's character has been given by",
                " Hadrat 'A'ishah in her statement: Kana khuluqu-hul-Qur",
                " an: the Qur'an was his character.\" Imam",
                " Ahmad, Muslim, Abu Da'ud. Nasa'i, Ibn Majah,",
                " Darimi and Ibn Jarir have cited, with",
                " a little variation in wording, this saying",
                " with several chains of transmitters. This means",
                " that the Holy Prophet had not merely",
                " presented the teaching of the Qur'an before",
                " the world but also given its practical",
                " demonstration by his personal example. Whatever was",
                " enjoined in the Qur'an was acted upon",
                " practically by himself in the first instance;",
                " whatever was forbidden in it was shunned",
                " and avoided by himself most of aII.",
                " His own self was characterised most of",
                " all by the moral qualities which were",
                " declared as sublime by it, and his",
                " own self was most free from those",
                " qualities which were declared as abhorrent and",
                " reprehensible by it. In another tradition Hadrat",
                " 'A'ishah has stated: \"The Holy Prophet (upon",
                " whom be peace) never hit a servant,",
                " never raised his hand on a woman",
                " never used his hand to kill a",
                " person outside the battlefield, never avenged himself",
                " on anyone for an injury caused unless",
                " someone violated a sanctity enjoined by AIlah",
                " and he avenged it for the sake",
                " of Allah. His practice was that whenever",
                " he had to choose between two things,",
                " he would choose the easier one unless",
                " it was a sin; and if it",
                " was a sin he would keep away",
                " from it most of all\" (Musnad Ahmad).",
                " Hadrat Anas says: \"I served the Holy",
                " Prophet (upon whom be peace) for ten",
                " years. He never did so much as",
                " express even a slight disgust over what",
                " I did or said: he never asked",
                " why I had done what I had",
                " done, and never inquired why I had",
                " not done what I had not done.\"",
                " (Bukhari, Muslim)."
            ]
        },
        {
            "id": "[68:5]",
            "verse": "So you will see and they will see",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:6]",
            "verse": "Which of you is the afflicted [by a devil].",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:7]",
            "verse": "Indeed, your Lord is most knowing of who has gone astray from His way, and He is most knowing of the [rightly] guided.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:8]",
            "verse": "Then do not obey the deniers.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:9]",
            "verse": "They wish that you would soften [in your position], so they would soften [toward you].",
            "description": [
                "That is, \"If you slackened a little",
                " in your propagation of Islam, they also",
                " would slacken in their opposition to you.",
                " Or, if you became inclined to effect",
                " some changes in your Faith to suit",
                " these people, they too would effect a",
                " compromise with you.\""
            ]
        },
        {
            "id": "[68:10]",
            "verse": "And do not obey every worthless habitual swearer",
            "description": [
                "The word mahin is used for a",
                " contemptible, degraded and mean person. This is",
                " indeed a necessary quality of a person",
                " who swears many oaths. He swears an",
                " oath for every minor thing because he",
                " himself has the feeling that the people",
                " take him for a liar and would",
                " not believe him until he swore an",
                " oath. For this reason he is not",
                " only degraded in his own eyes but",
                " commands no respect in society either."
            ]
        },
        {
            "id": "[68:11]",
            "verse": "[And] scorner, going about with malicious gossip -",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:12]",
            "verse": "A preventer of good, transgressing and sinful,",
            "description": [
                "Khayr in Arabic is used both for",
                " wealth and for good. If it is",
                " taken in the meaning of wealth the,",
                " meaning would be that he is miserly",
                " and stingy; he would not even spend",
                " a farthing on anyone; and if khayr",
                " is taken in the meaning of goodness",
                " and virtue, it would mean that he",
                " creates a hindrance in every good work",
                " as . ell as that he is",
                " very active in hindering the people from",
                " accepting Islam.",
                "*8) The word `utul is",
                " used for a person who is stout",
                " and strong and greedy in eating and",
                " drinking and is also ill-mannered, quarrelsome and",
                " cruel at the same tune."
            ]
        },
        {
            "id": "[68:13]",
            "verse": "Cruel, moreover, and an illegitimate pretender.",
            "description": [
                "The word zanim is used to describe",
                " a person of illegitimate birth, who does",
                " not, in fact, belong to a family",
                " but has joined it. Sa`id bin Jubair",
                " and Sha`bi say that this word is",
                " used for a person who is notorious",
                " among the people for his evildoing. The",
                " views of the commentators with regard to",
                " the person who has been described in",
                " these verses are different. Some one says",
                " it was Walid bin Mughirah; another one",
                " says it was Aswad bin `Abd-i Yaghuth,",
                " and still another has applied this description",
                " to Akhnas bin Shurayq, and some other",
                " people have pointed to some other persons.",
                " But the Qur'an has only described his",
                " attributes without naming him. This shows that",
                " in Makkah the man concerned was so",
                " notorious for his such qualities that there",
                " was no need to name him definitely.",
                " Hearing his description every person could understand",
                " who was being referred to."
            ]
        },
        {
            "id": "[68:14]",
            "verse": "Because he is a possessor of wealth and children,",
            "description": [
                "This sentence may be connected with the",
                " preceding theme as well as with the",
                " following sentence. In the first case, it",
                " would mean: \"Do not yield to the",
                " influence of such a person just because",
                " he has plenty of wealth and children.",
                " \" In the second: \"He has become",
                " proud because he possesses abundance of wealth",
                " and children; so when Our Revelations are",
                " recited to him, he says, \"These are",
                " tales of ancient times.\""
            ]
        },
        {
            "id": "[68:15]",
            "verse": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:16]",
            "verse": "We will brand him upon the snout.",
            "description": [
                "Because he thought he was a man",
                " of high prestige, his nose has been",
                " called a snout, and \"branding him on",
                " the snout means disgracing him. That is,",
                " \"We shall so disgrace him in the",
                " world and in the Hereafter that his",
                " mark of disgrace will become indelible.\""
            ]
        },
        {
            "id": "[68:17]",
            "verse": "Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning",
            "description": [
                "Here, one should also keep Al-Kahf: 32-44",
                " in view, in which the parable of",
                " the owners of two gardens has been",
                " cited for teaching a lesson."
            ]
        },
        {
            "id": "[68:18]",
            "verse": "Without making exception.",
            "description": [
                "That is, \"They were so sure and",
                " confident of their power and authority that",
                " they swore they would surely pluck the",
                " fruit of their garden next morning, without",
                " feeling any need to say, \"We shall",
                " do so if Allah so willed.\""
            ]
        },
        {
            "id": "[68:19]",
            "verse": "So there came upon the garden an affliction from your Lord while they were asleep.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:20]",
            "verse": "And it became as though reaped.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:21]",
            "verse": "And they called one another at morning,",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:22]",
            "verse": "[Saying], \"Go early to your crop if you would cut the fruit.\"",
            "description": [
                "The word tilth probably has been used",
                " because in the garden there were fields",
                " of crops also in between the trees.",
                ""
            ]
        },
        {
            "id": "[68:23]",
            "verse": "So they set out, while lowering their voices,",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:24]",
            "verse": "[Saying], \"There will surely not enter it today upon you [any] poor person.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:25]",
            "verse": "And they went early in determination, [assuming themselves] able.",
            "description": [
                "The word hard in Arabic is used",
                " for hindering and withholding, for a purpose",
                " and resolution, and for making haste; hence,",
                " the composite rendering adopted by us."
            ]
        },
        {
            "id": "[68:26]",
            "verse": "But when they saw it, they said, \"Indeed, we are lost;",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:27]",
            "verse": "Rather, we have been deprived.\"",
            "description": [
                "That is, on seeing the garden they",
                " didn't believe it was their own garden,",
                " and they said: \"Perhaps we have lost",
                " our way and come to another place.\"",
                " But, when they considered it seriously and",
                " found it was their own garden, they",
                " cried out: \"Alas we are undone!\""
            ]
        },
        {
            "id": "[68:28]",
            "verse": "The most moderate of them said, \"Did I not say to you, 'Why do you not exalt [Allah]?' \"",
            "description": [
                "This means that when they were saying",
                " on oath: \"We shall surely pluck the",
                " fruit of our garden tomorrow,\" this person",
                " had warned them at that time, saying:",
                " \"Have you forgotten God? Why don't you",
                " say: If Allah so wills?\" But they",
                " did not listen to him. Then, while",
                " they were making up their mind not",
                " to give away anything to the needy.",
                " he again advised them to remember Allah",
                " and to desist from their evil intention,",
                " but they persisted in what they had",
                " resolved."
            ]
        },
        {
            "id": "[68:29]",
            "verse": "They said, \"Exalted is our Lord! Indeed, we were wrongdoers.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:30]",
            "verse": "Then they approached one another, blaming each other.",
            "description": [
                "That is, each reproached and blamed the",
                " other that because of his wrong counsel",
                " they had forgotten God and resolved upon",
                " an evil course."
            ]
        },
        {
            "id": "[68:31]",
            "verse": "They said, \"O woe to us; indeed we were transgressors.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:32]",
            "verse": "Perhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous.\"",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:33]",
            "verse": "Such is the punishment [of this world]. And the punishment of the Hereafter is greater, if they only knew.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:34]",
            "verse": "Indeed, for the righteous with their Lord are the Gardens of Pleasure.",
            "description": [
                "This is. a rejoinder to the chiefs",
                " of Makkah, who argued with the Muslims,",
                " thus: \"The blessings that we are enjoying",
                " in the world are a sign that",
                " we are favourites of AIlah, and the",
                " miserable lives that you are living are",
                " a proof that you are under the",
                " wrath of AIIah. Therefore, even if there",
                " was any life after death, as you",
                " say, we shall have good time there",
                " too, and the torment would be imposed",
                " on you, not on us!\""
            ]
        },
        {
            "id": "[68:35]",
            "verse": "Then will We treat the Muslims like the criminals?",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:36]",
            "verse": "What is [the matter] with you? How do you judge?",
            "description": [
                "That is, \"lt is against reason that",
                " God should not differentiate between the obedient",
                " servant and the guilty. How do you",
                " regard this as reasonable that the Creator",
                " of the universe should, like a blind",
                " ruler, not judge which people in the",
                " world obeyed His commands and refrained from",
                " evildoing, and which people committed every sin",
                " and crime and perpetrated every cruelty fearless",
                " of His punishment? You have seen the",
                " adversity of the believers and your own",
                " prosperity, but you have not appreciated the",
                " distinction between their good morals and your",
                " own evildoing, and have given your judgement",
                " without the thought that these obedient people",
                " will be treated like culprits by God",
                " and the guilty like you will be",
                " granted Paradise. \""
            ]
        },
        {
            "id": "[68:37]",
            "verse": "Or do you have a scripture in which you learn",
            "description": [
                "That is, the Book sent down by",
                " Allah."
            ]
        },
        {
            "id": "[68:38]",
            "verse": "That indeed for you is whatever you choose?",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:39]",
            "verse": "Or do you have oaths [binding] upon Us, extending until the Day of Resurrection, that indeed for you is whatever you judge?",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:40]",
            "verse": "Ask them which of them, for that [claim], is responsible.",
            "description": [
                "Za'im in Arabic is used for a",
                " person who stands a surety on behalf",
                " of another, or is a spokesman of",
                " others. Thus, the verse means to ask:",
                " \"Which of you will come forward and",
                " say that he has made such and",
                " such a covenant with Allah on your",
                " behalf?\""
            ]
        },
        {
            "id": "[68:41]",
            "verse": "Or do they have partners? Then let them bring their partners, if they should be truthful.",
            "description": [
                "That is, \"The judgement you are passing",
                " concerning yourselves has no basis whatever. It",
                " is against reason and you cannot show",
                " any such thing written in any Divine",
                " Book either. No one can make the",
                " claim that he has made Allah promise",
                " some such thing, and you cannot make",
                " any of your deities vouch that it",
                " would take the responsibility of securing Paradise",
                " for you from God. How then have",
                " you been involved in such a misunderstanding?",
                ""
            ]
        },
        {
            "id": "[68:42]",
            "verse": "The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able,",
            "description": [
                "Literally: \"The Day the shin shall be",
                " uncovered\". A section of the Companions and",
                " their successors says that these words have",
                " been used idiomatically, for according to Arabic",
                " idiom, kashf-i saq implies befalling of an",
                " affliction. Hadrat `Abdullah bin 'Abbas also has",
                " given this same meaning of this and",
                " has supported it by evidence from Arabic",
                " poetry. According to another saying that has",
                " been cited from Ibn 'Abbas and Rabi'",
                " bin Anas, kashf-i saq implies uncovering the",
                " facts and truths. In view of this",
                " interpretation, the meaning would be: \"The Day",
                " when all truths shall be bared and",
                " the people's deeds shall become open and",
                " manifest. \""
            ]
        },
        {
            "id": "[68:43]",
            "verse": "Their eyes humbled, humiliation will cover them. And they used to be invited to prostration while they were sound.",
            "description": [
                "It means: On the Resurrection Day it",
                " will be openly and publicly demonstrated as",
                " to who in the world had actually",
                " worshipped Allah and who was disinclined to",
                " do so. For this purpose the people",
                " will be called upon to prostrate themselves",
                " before Allah. Then, those who had been",
                " sincerely worshipping Allah in the world, would",
                " prostrate themselves, and those who had declined",
                " to bow before Him in the world,",
                " would be unable to do so. It",
                " will become impossible for them to put",
                " up a false show of being worshippers.",
                " Therefore, they will remain standing, degraded and",
                " downcast with shame."
            ]
        },
        {
            "id": "[68:44]",
            "verse": "So leave Me, [O Muhammad], with [the matter of] whoever denies the Qur'an. We will progressively lead them [to punishment] from where they do not know.",
            "description": [
                "That is, \"Do not worry yourself as",
                " to how to deal with them; it",
                " is for Me to see how to",
                " chastise them. \"",
                "*27) A form of",
                " leading somebody to ruin in imperceptible ways",
                " is that an enemy of the Truth",
                " and wicked person may be blessed in",
                " the world, and be granted health, wealth,",
                " children and worldly successes, by which he",
                " may be deluded into believing that whatever",
                " he is doing, he is doing well",
                " and right: there is nothing wrong with",
                " his acts and deeds. Thus, he may",
                " go on getting more and more deeply",
                " involved in enmity of the truth and",
                " wickedness and rebellious conduct and may not",
                " realize that the blessings he is being",
                " favoured with are not a reward but,",
                " in fact, a means of his own",
                " ruin."
            ]
        },
        {
            "id": "[68:45]",
            "verse": "And I will give them time. Indeed, My plan is firm.",
            "description": [
                "The word kayd in the original means",
                " to devise a secret scheme against another.",
                " It is an evil only in case",
                " it is devised to harm somebody unjustly,",
                " otherwise there is nothing wrong with it,",
                " especially when such a scheme is adopted",
                " against a person who has made himself",
                " worthy of it."
            ]
        },
        {
            "id": "[68:46]",
            "verse": "Or do you ask of them a payment, so they are by debt burdened down?",
            "description": [
                "The question apparently is being asked of",
                " the Holy Prophet (upon whom be peace),",
                " but its real audience are the people,",
                " who were crossing all limits in their",
                " opposition to him. They are being asked:",
                " \"is Our Messenger asking you for a",
                " reward which makes you feel so upset?",
                " You yourself know that he is absolutely",
                " selfless in his invitation and is exerting",
                " himself only for your own benefit and",
                " well-being. If you do not want to",
                " believe in what he says, you may",
                " not, but why are you feeling so",
                " enraged at his this invitation to you?",
                " (For further explanation, see E.N. 31 of",
                " Surah At-Tur)."
            ]
        },
        {
            "id": "[68:47]",
            "verse": "Or have they [knowledge of] the unseen, so they write [it] down?",
            "description": [
                "This second question also appears to be",
                " directed to the Holy Prophet, but, in",
                " fact, its audience are his opponents. It",
                " means: \"Have you, O people, peered behind",
                " the unseen and found that the Messenger,",
                " in fact, is not a Messenger sent",
                " by God, and the truths that he",
                " is presenting before you are also false;",
                " that is why you are being so",
                " stubborn in belying what he says?\" (For",
                " explanation, see E.N. 32 of At-Tur)."
            ]
        },
        {
            "id": "[68:48]",
            "verse": "Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed.",
            "description": [
                "That is, \"The time when Allah will",
                " issue His decree about your success and",
                " victory and your opponents' defeat, is yet",
                " far off. Till then you should go",
                " on enduring with patience whatever hardships and",
                " afflictions you may have to face in",
                " the way of preaching the Faith. \"",
                "",
                "*32) That is, \"Do not behave impatiently",
                " as did the Prophet Jonah (peace be",
                " on him), who an account of his",
                " impatience was driven into the fish's belly.\"",
                " Immediately after exhorting the Holy Prophet (upon",
                " whom be peace) to have patience until",
                " Allah issued forth His decree, to tell",
                " him not to behave like the Prophet",
                " Jonah by itself gives the meaning that",
                " the latter had shown some kind of",
                " impatience before Allah gave His decision and",
                " thus had incurred His wrath. (For explanation,",
                " see Yunus; 98, and E.N, 99 on",
                " it; Al-Anbiya': 87-88 and E.N.'s 82 to",
                " 85; As-Saaffat: 139-148 and E.N.'s 78 to",
                " 85).",
                "*33) In Surah Al-Anbiya' it has",
                " been explained thus: \"From inside the fish's",
                " belly and the darkness of the sea,",
                " the Prophet Jonah invoked Allah, saying: La",
                " ilaha ills ants subhanaka inni kuntu min-az-zalimin:",
                " `There is no god but You; glory",
                " be to You: I had indeed committed",
                " a wrong.' Thereupon Allah heard his prayer",
                " and delivered him from this affliction.\" (vv.",
                " 87-88)."
            ]
        },
        {
            "id": "[68:49]",
            "verse": "If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.",
            "description": [
                "When this verse is read with As-Saaffat:",
                " 142-146, one learns that at the tune",
                " the Prophet Jonah was caused to be",
                " swallowed by the fish, he was blameworthy.",
                " But when he glorified Allah and confessed",
                " his fault, although he was spat up",
                " by the fish on a bare beach",
                " in a state of sickness, he was.not",
                " blameworthy at that time. Allah by His",
                " mercy caused a creeper to grow over",
                " him so that its leaves should provide",
                " him shade and its fruit food and",
                " drink."
            ]
        },
        {
            "id": "[68:50]",
            "verse": "And his Lord chose him and made him of the righteous.",
            "description": [
                ""
            ]
        },
        {
            "id": "[68:51]",
            "verse": "And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, \"Indeed, he is mad.\"",
            "description": [
                "\"Would trip you up\": \"Would eat you",
                " up with their eyes\". For a similar",
                " expression of the Makkan disbelievers' rage and",
                " fury against the Holy Prophet, see also",
                " Bani Isra'il: 73-77."
            ]
        },
        {
            "id": "[68:52]",
            "verse": "But it is not except a reminder to the worlds.",
            "description": [
                ""
            ]
        }
    ]
}