{
    "name": "Al-Maarij",
    "verse-count": 44,
    "verse-info": [
        {
            "id": "[70:1]",
            "verse": "A supplicant asked for a punishment bound to happen",
            "description": [
                "Some commentators have taken the verb sa'ala",
                " in the Text in the meaning of",
                " asking, and have interpreted the verse to",
                " mean: \"The asker has asked: whom will",
                " the torment with which we are being",
                " threatened befall'\" And AIIah has answered it,",
                " saying: \"!t will befall the disbelievers.\" But",
                " most of the conunentators have taken sa",
                " ala here in the meaning of demanding.",
                " Nasa'i and other traditionists have related a",
                " tradition from Ibn 'Abbas, and Hakim hold",
                " it as authentic, that Nadr bin al-Harith",
                " Kaladah had said \"O God, if it",
                " is really the Truth sent dawn by",
                " You, then rain down stones on us",
                " from the heavens, or send down any",
                " other painful torment on us.\" (AI-Anfal: 32).",
                " Apart from this, at several places in",
                " the Qur'an the disbelievers' this challenge has",
                " been related: \"Why don't you bring down",
                " on us the torment that you threaten",
                " us with?\" For instance, see Yunus: 4b-48,",
                " Al-Anbiya': 36-41, An-Naml; 67-72, Saba: 26-30, Ya",
                " Sin: 45-52, Al-Mink: 24-27."
            ]
        },
        {
            "id": "[70:2]",
            "verse": "To the disbelievers; of it there is no preventer.",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:3]",
            "verse": "[It is] from Allah, owner of the ways of ascent.",
            "description": [
                "Ma'arij is plural of Mi'raj, which means",
                " a stairway, or a ladder, or something",
                " by which one may go up. To",
                " call Allah dhil-Ma'aij (Owner of the Steps",
                " of Ascent) means that He is Most",
                " High and in order to go up",
                " into His Presence the angels have to",
                " ascend many heights, one above the other,",
                " as has been stated in the following",
                " verses."
            ]
        },
        {
            "id": "[70:4]",
            "verse": "The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years.",
            "description": [
                "\"The Spirit\": the Angel Gabriel (peace be",
                " on him), who has been mentioned separately",
                " from the angels in order to impress",
                " his unique glory and greatness. In Surah",
                " Ash-Shu'ara' it has been said: \"The trustworthy",
                " Spirit has came down with this Qur'an",
                " upon your heart\", (v. 193), and in",
                " Surah AI-Baqarah \"Say to them: whoever is",
                " an enemy to Gabriel, should understand that",
                " he has, by .Allah's command. revealed upon",
                " your heart this Qur'an.\" (v. 97). These",
                " verses when read together show that Ar-Ruh",
                " (the Spirit) implies the Angel Gabriel.",
                "*4)",
                " This is an ambiguous theme the meaning",
                " of which cannot be determined precisely. We",
                " neither have any knowledge of the reality",
                " of the angels, nor can understand the",
                " nature of their ascent, nar can conceive",
                " the stairways on which they ascend. Besides,",
                " about AIIah also it cannot be imagined",
                " that He lives in a particular place,",
                " for He is exalted and free froth",
                " the restrictions of space and time.",
                "*5)",
                " In Al-Hajj: 47, it has heen said:",
                " \"These people are demanding of you to",
                " hasten the torment; AIIah will never tail",
                " to fulfil His threat, but a day",
                " with ycur Lord is equal to a",
                " thousand years as you reckon.\" In Surah",
                " As-Sajdah: 5, it has been said: \"He",
                " administers the affairs of the world from",
                " the heavens to the earth, and the",
                " report of this administration ascends (to be",
                " presented) before Him in a Day whose",
                " length, according to your reckoning, is a",
                " thousand years\". And here, in response to",
                " the demand for the torment, the measure",
                " of Allah's one day has been stated",
                " to be fifty thousand years. Then the",
                " Holy Prophet (upon whom be peace) has",
                " been consoled, saying: \"Have patience at the",
                " demand for the torment which the people",
                " make out of jest and fun,\" and",
                " then it is said: \"They think it",
                " is far off, but We see it",
                " as near at hand.\" When all these",
                " verses are read together, what becomes obvious",
                " is: \"The people, because of their narrow",
                " and restricted outlook, measure the time of",
                " Allah's decrees by their own scales of",
                " time and, therefore, consider a hundred years",
                " or so to be a very lengthy",
                " period, whereas in the Divine conduct of",
                " affairs there are schemes spreading over a",
                " thousand years each, or fifty thousand years",
                " each, as you reckon, and this measure",
                " also is only by way of example;",
                " otherwise schemes in the universe may extend",
                " over millions and billions of years as",
                " well. Of these one is the scheme",
                " under which Mankind has been created on",
                " the earth, and a time limit has",
                " been set during which it has been",
                " allowed to function here. No man can",
                " know when this scheme began, what time-limit",
                " has been decreed for its completion, what",
                " Hour has been appointed for bringing it",
                " to an end, when Resurrection will take",
                " place, and what time has been fixed",
                " for raising all men, born since the",
                " beginning of creation till Resurrection, from death",
                " simultaneously and calling them to account for",
                " their deeds. We only know to some",
                " extent that part of the scheme which",
                " is passing before us, or a partial",
                " history of the past ages which exists",
                " with us. As for its beginning and",
                " end, to say nothing of knowing it,",
                " we do not even have the power",
                " to understand it, not to speak of",
                " understanding the wisdom which works behind and",
                " underlies it. Now the people who demand",
                " that the scheme be cut short and",
                " its conclusion be brought immediately before them,",
                " and if this is not done. they",
                " use it for an argument to prove",
                " that the universe has no end and",
                " conclusion, in fact, present a proof of",
                " their own ignorance and folly. (For further",
                " explanation, see E.N.'s 92, 93 of Surah",
                " Al-Hajj, E.N. 9 of As-Sajdah)."
            ]
        },
        {
            "id": "[70:5]",
            "verse": "So be patient with gracious patience.",
            "description": [
                "\"A goodly patience\": \"A kind of patience",
                " that behoves a magnanimous person like you.\"",
                ""
            ]
        },
        {
            "id": "[70:6]",
            "verse": "Indeed, they see it [as] distant,",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:7]",
            "verse": "But We see it [as] near.",
            "description": [
                "This can have two meanings: (1) \"That",
                " these people think it cannot possibly take",
                " place, and in Our view it is",
                " going to take place very soon\"; and",
                " (2) \"that these people think Resurrection is",
                " yet remote and far off, and in",
                " Our sight it is close at hand",
                " and may occur any moment. \""
            ]
        },
        {
            "id": "[70:8]",
            "verse": "On the Day the sky will be like murky oil,",
            "description": [
                "A section of the commentators regard this",
                " sentence as related to \"a day whose",
                " measure is fifty thousand years\"; they say",
                " that the day whose measure has been",
                " stated to be fifty thousand years is",
                " the Day of Resurrection. In Musnad Ahmad",
                " and in the Tafsir by Ibn Jarir,",
                " a tradition has been related on the",
                " authority of Hadrat Abu Sa'id Khudri, saying:",
                " \"When wonder and amazment was expressed before",
                " the Holy Prophet (upon whom be peace)",
                " about the length of this Day with",
                " reference to this verse, he replied: 'By",
                " Him in Whose hand is my life,",
                " the believer will find the Day even",
                " lighter (of shorter duration) than the time",
                " he takes in performing an obligatory Prayer",
                " in the world\" . \" Had this",
                " tradition been reported through authentic channels, this",
                " verse could not be interpreted in any",
                " other way, but two of its transmitters,",
                " Darraj and his teacher Abul Haytham, are",
                " both weak and untrustworthy.",
                "*9) That is,",
                " it will change its colour over and",
                " over again."
            ]
        },
        {
            "id": "[70:9]",
            "verse": "And the mountains will be like wool,",
            "description": [
                "As the colours of the mountains are",
                " different, when they are uprooted and they",
                " drift about weight less, they will appear",
                " like flakes of carded wool of different",
                " colours."
            ]
        },
        {
            "id": "[70:10]",
            "verse": "And no friend will ask [anything of] a friend,",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:11]",
            "verse": "They will be shown each other. The criminal will wish that he could be ransomed from the punishment of that Day by his children",
            "description": [
                "Not so that they will not see",
                " each other, therefore they will not ask",
                " after each other's welfare, but each will",
                " be seeing the other in agony and",
                " distress, yet will ignore him, being wholly",
                " preoccupied with his own torment."
            ]
        },
        {
            "id": "[70:12]",
            "verse": "And his wife and his brother",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:13]",
            "verse": "And his nearest kindred who shelter him",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:14]",
            "verse": "And whoever is on earth entirely [so] then it could save him.",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:15]",
            "verse": "No! Indeed, it is the Flame [of Hell],",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:16]",
            "verse": "A remover of exteriors.",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:17]",
            "verse": "It invites he who turned his back [on truth] and went away [from obedience]",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:18]",
            "verse": "And collected [wealth] and hoarded.",
            "description": [
                "Here also, as in Al-Haaqqah: 33-34, two",
                " causes have been mentioned of a person's",
                " evil end in the Hereafter: (1) His",
                " repudiation of the Truth and refusal to",
                " affirm faith; and (2) his worship of",
                " the world and stinginess because of which",
                " he amasses wealth and refuses to spend",
                " it on any good cause."
            ]
        },
        {
            "id": "[70:19]",
            "verse": "Indeed, mankind was created anxious:",
            "description": [
                "\"Man has been created impatient\": It is",
                " man's nature, or his natural weakness, to",
                " be impatient. Here, one should keep in",
                " view that at many places in the",
                " Qur'an, after making mention of mankind's common",
                " moral weaknesses, those who believe and adopted",
                " righteousness have been made an exception; the",
                " same theme is being expressed in the",
                " following verses. This by itself explains the",
                " truth that these hereditary weaknesses are not",
                " unalterable; if man accepts the guidance sent",
                " down by God and tries to reform",
                " himself practically, he can remove them, and",
                " if he gives a free rope to",
                " his self these become ingrained in him",
                " deeply. (For further explanation, see E.N. 41",
                " of Al-Anbiya', E.N.'s 23-28 of Az-Zumar, E.N.",
                " 75 of Ash-Shura)."
            ]
        },
        {
            "id": "[70:20]",
            "verse": "When evil touches him, impatient,",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:21]",
            "verse": "And when good touches him, withholding [of it],",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:22]",
            "verse": "Except the observers of prayer -",
            "description": [
                "A person's performing the salat necessarily implies",
                " that he believes in Allah, His Messenger,",
                " His Book and the Hereafter as well",
                " as tries to act according to his",
                " belief."
            ]
        },
        {
            "id": "[70:23]",
            "verse": "Those who are constant in their prayer",
            "description": [
                "That is, no laziness, or love of",
                " ease and comfort, no occupation, or interest,",
                " hinders them from being punctual and regular",
                " at the prayer. When the Prayer time",
                " comes, they abandon every occupation and activity",
                " and stand up to perform worship of",
                " their God. Another meaning which Hadrat 'Uqbah",
                " bin 'Amir has given of ala salat-i-him",
                " daa imun is that they perform the",
                " Prayer with full peace of mind, tranquillity",
                " and humility; they do not try to",
                " offer the Prayer in a hurry in",
                " order to get rid of it somehow,",
                " nor think irrelevant things during the Prayer.",
                ""
            ]
        },
        {
            "id": "[70:24]",
            "verse": "And those within whose wealth is a known right",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:25]",
            "verse": "For the petitioner and the deprived -",
            "description": [
                "In Surah Adh-Dhariyat: 19, it has been",
                " said: \"In their wealth there is a",
                " right of the beggar and the needy\",",
                " and here: \"In their wealth there is",
                " a due share of the beggar and",
                " the needy. \" Some people have understood",
                " this to mean that the \"due share\"",
                " implies the obligatory zakat, for in the",
                " zakat both the exemption limit and the",
                " rate have been fixed. But this commentary",
                " cannot be accepted on the ground that",
                " the Surah AI-Ma`arij is unanimously a Makkan",
                " Revelation, and the zakat with its specific",
                " exemption limit and rate was enjoined at",
                " Madinah. Therefore, the correct meaning of the",
                " \"due share' is that they have of",
                " their own accord set aside a share",
                " in their possessions of the beggar and",
                " needy, which they discharge regularly and honestly.",
                " This same meaning of this verse has",
                " been given by Hadrat 'Abdullah bin `Abbas,",
                " Hadrat `Abdullah bin `Umar, Mujahid, Sha`bi and",
                " Ibrahim Nakha`i. Here, sail dces not imply",
                " a beggar but a needy person, who",
                " asks someone for help, and mahrum implies",
                " a person who is jobless, or the",
                " one who tries to earn a living",
                " but does not earn enough to meet",
                " his needs, or the one who has",
                " become disabled because of an accident or",
                " calamity, and is unable to make a",
                " living. About such people when it becomes",
                " known that they are destitute, a God",
                " - worshipper dces not wait that they",
                " should ask for help, but helps them",
                " of his own accord as soon as",
                " he comes to know that they are",
                " needy and stand in need of help.",
                " (For further explanation, see E.N. 17 of",
                " Surah Adh-Dhariyat)."
            ]
        },
        {
            "id": "[70:26]",
            "verse": "And those who believe in the Day of Recompense",
            "description": [
                "\"Who believe ... Day of Recompense\": who",
                " do not think they are irresponsible but",
                " believe that one Day they will have",
                " to appear before their God and render",
                " to Him an account of their deeds.",
                ""
            ]
        },
        {
            "id": "[70:27]",
            "verse": "And those who are fearful of the punishment of their Lord -",
            "description": [
                "In other words, they are not like",
                " the disbelievers, who do not fear God",
                " even after they have committed every heinous",
                " sin and crime and perpetrated every cruelty",
                " in the world, but they, in spite",
                " of having adopted a righteous attitude in",
                " morals and deeds as best as they",
                " could, fear God and continue to remain",
                " in constant awe lest their shortcomings should",
                " exceed their good works before Him and",
                " they should be declared as worthy of",
                " punishment. (For further explanation, see E N.",
                " 54 of Al-Mu'minun, E.N. 19 of Adh-Dhariyat).",
                ""
            ]
        },
        {
            "id": "[70:28]",
            "verse": "Indeed, the punishment of their Lord is not that from which one is safe -",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:29]",
            "verse": "And those who guard their private parts",
            "description": [
                "\"Who guard their private parts\": who abstain",
                " from adultery as well as from nudity",
                " and exposing their private parts before others.",
                " (For explanation, see E.N 6 of Al-Mu'minun,",
                " E.N.'s 30, 32 of An-Nur E.N. 62",
                " of Al-Ahzab)."
            ]
        },
        {
            "id": "[70:30]",
            "verse": "Except from their wives or those their right hands possess, for indeed, they are not to be blamed -",
            "description": [
                "For explanation, see E.N. 7 of Al-Mu'minun.",
                ""
            ]
        },
        {
            "id": "[70:31]",
            "verse": "But whoever seeks beyond that, then they are the transgressors -",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:32]",
            "verse": "And those who are to their trusts and promises attentive",
            "description": [
                "\"Trusts\" imply those trusts which Allah has",
                " entrusted to men as well as those",
                " which one man entrusts to another because",
                " of faith and confidence. Likewise, \"promises\" imply",
                " those promises which man makes with his",
                " God as well as those which one",
                " man makes with another. Keeping and fulfilling",
                " both these kinds of trusts and promises",
                " is a necessary characteristic of a believer.",
                " In a Hadith Hadrat Anas (may Allah",
                " bless him) has reported that when ever",
                " the Holy Prophet (upon whom be peace)",
                " addressed his Companions, he would always give",
                " them the instruction: \"Beware, the one who",
                " does not keep his trust has no",
                " faith, and one who does not fulfil",
                " his pledges, has no religion.\" (Baihaqi. Ash-Shu",
                " ab al-Imam)."
            ]
        },
        {
            "id": "[70:33]",
            "verse": "And those who are in their testimonies upright",
            "description": [
                "That is, they neither conceal evidence nor",
                " change it in any way for selfish",
                " motives."
            ]
        },
        {
            "id": "[70:34]",
            "verse": "And those who [carefully] maintain their prayer:",
            "description": [
                "This gives an idea of the importance",
                " of the Prayer (salat). The description of",
                " the merits of the high and sublime",
                " character of those who have been declared",
                " as worthy of Paradise, began with the",
                " Prayer and has been concluded with it.",
                " To be a performer of the Prayer",
                " is their first characteristic, to be steadfast",
                " and ever constant with regard to the",
                " Prayer is their second characteristic, and to",
                " guard their Prayer is their last characteristic.",
                " \"Guarding the Prayer\" implies many things: to",
                " perform the Prayer at its right time,",
                " to make sure before the Prayer that",
                " one's body and clothes are clean and",
                " pure, to have performed the ablutions and",
                " to have washed the limbs well, to",
                " perform the basic elements of the Prayer",
                " with its obligatory and desirable parts with",
                " due care and attention, to observe the",
                " requisite rites of the Prayer carefully, to",
                " avoid disobedience of God, which is destructive",
                " of the Prayer; all these are included",
                " in the guarding of the Prayer."
            ]
        },
        {
            "id": "[70:35]",
            "verse": "They will be in gardens, honored.",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:36]",
            "verse": "So what is [the matter] with those who disbelieve, hastening [from] before you, [O Muhammad],",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:37]",
            "verse": "[To sit] on [your] right and [your] left in separate groups?",
            "description": [
                "This refers to those disbelievers who would",
                " rush in towards the Holy Prophet (upon",
                " whom be peace) from every side to",
                " mock and ridicule him when they heard",
                " him preach Islam and recite the Qur'an.",
                ""
            ]
        },
        {
            "id": "[70:38]",
            "verse": "Does every person among them aspire to enter a garden of pleasure?",
            "description": [
                "It means that God's Paradise is only",
                " for those righteous people whose characteristics have",
                " just been described above, Now, can these",
                " people who are not at aII inclined",
                " to listen to the truth and who",
                " are rushing in towards the Prophet in",
                " order to suppress every invitation to the",
                " truth, be candidates for Paradise? Has God",
                " prepared His Paradise only for such people",
                " as they? Here, one should also keep",
                " in view vv. 34-41 of Surah AI-Qalam",
                " in which an answer has been given",
                " to this saying of the disbelievers of",
                " Makkah: \"Even if there is any life",
                " after death, we shall have good time",
                " there too, as we are having in",
                " the world, and the torment would befall",
                " Muhammad (upon whom be Allah's peace and",
                " blessings) and his followers and not us.",
                " \""
            ]
        },
        {
            "id": "[70:39]",
            "verse": "No! Indeed, We have created them from that which they know.",
            "description": [
                "Here, this sentence can have two meanings:",
                " (1) If it is taken to be",
                " related to the preceding theme, it will",
                " mean: As for the substance these people",
                " have been created from, aII men are",
                " equal. For if the substance itself be",
                " the cause of man's entry into Paradise,",
                " then the good and the bad, the",
                " wicked and the just, the guilty and",
                " the innocent, all should go to Paradise.",
                " But a little common sense is enough",
                " to decide that man's qualifications for Paradise",
                " are created not on the basis of",
                " the substance of his creation but only",
                " on the basis of his merit and",
                " excellence. (2) If this sentence is regarded",
                " as an introduction to the following theme,",
                " it would mean: \"These people think they",
                " are secure from Our torment and mock",
                " the one who warns them of Our",
                " punishment, whereas We can punish them even",
                " in this world as and when We",
                " please, as well as resurrect them after",
                " death as and when We like. They",
                " themselves know that We began their creation",
                " from an insignificant sperm-drop and developed them",
                " into a living man. If they had",
                " only considered this mode of their creation,",
                " they would never have been involved in",
                " the misunderstanding that they now have escaped",
                " Our grasp, or that We have no",
                " power to create them over again.\""
            ]
        },
        {
            "id": "[70:40]",
            "verse": "So I swear by the Lord of [all] risings and settings that indeed We are able",
            "description": [
                "That is, the truth is not that",
                " which these people think it is.",
                "*28)",
                " Here, Allah has sworn an oath by",
                " Himself. The words Easts and Wests have",
                " been used because the sun rises and",
                " sets at a new angle every day",
                " during the year, and goes on rising",
                " and setting successively at different times around",
                " the globe. Thus considered the Easts and",
                " the Wests are not one but many.",
                " From another point of view as against",
                " the north and the south there is",
                " a direction of east and a direction",
                " of west. On this basis in Surah",
                " Ash-Shu`ara': 28 and AlMuzzammi1:19 the words Rabb-ul-rnashriqi",
                " wal-maghrib have been used. From still another",
                " view-point the earth has two easts and",
                " two wests, for when the sun sets",
                " on one hemisphere, it rises on the",
                " other. On this basis the words Rabb-ul-mashriqayn",
                " wa Rabb-ul-maghribayn (Lord of two easts and",
                " two wests) have been used in Surah",
                " Ar-Rahman: 17. (For further explanation, see E.N.",
                " 17 of Ar-Rahman)."
            ]
        },
        {
            "id": "[70:41]",
            "verse": "To replace them with better than them; and We are not to be outdone.",
            "description": [
                "This is that for which Allah Almighty",
                " has sworn an oath of His being",
                " Lord of the Easts and Wests. It",
                " means: \"As We are Owners of the",
                " Easts and Wests, the whole earth is",
                " under Our control and power, and you",
                " have no power to escape Our punishment:",
                " We can destroy you as and when",
                " We like and can create another people",
                " that may be better than you. \"",
                ""
            ]
        },
        {
            "id": "[70:42]",
            "verse": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised -",
            "description": [
                ""
            ]
        },
        {
            "id": "[70:43]",
            "verse": "The Day they will emerge from the graves rapidly as if they were, toward an erected idol, hastening.",
            "description": [
                "There is a difference of opinion among",
                " the commentators about the meaning of the",
                " word nusub. SAme have interpreted it to",
                " mean idols, according to which the meaning",
                " would be: \"They would be racing towards",
                " the place appointed by the Lord of",
                " Resurrection as they race today towards the",
                " shrines of their idols\" ; and some",
                " others have taken nusub to mean the",
                " goal signs which are set for the",
                " competitors in a race, so that each",
                " tries to reach and touch the appointed",
                " post before the other."
            ]
        },
        {
            "id": "[70:44]",
            "verse": "Their eyes humbled, humiliation will cover them. That is the Day which they had been promised.",
            "description": [
                ""
            ]
        }
    ]
}