{
    "name": "Nuh",
    "id": 71,
    "verse-count": 28,
    "verse-info": [
        {
            "verse-id": "[71:1]",
            "verse": "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"",
            "description": [
                "\"Warm your people ... \": Warn them",
                " that the errors and moral evils that",
                " they were involved in, would only earn",
                " them Allah's punishment, if they did not",
                " desist from them, and tell them what",
                " way they should adopt in order to",
                " ward off that punishment."
            ]
        },
        {
            "verse-id": "[71:2]",
            "verse": "He said, \"O my people, indeed I am to you a clear warner,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:3]",
            "verse": "[Saying], 'Worship Allah, fear Him and obey me.",
            "description": [
                "The three things which the Prophet Noah",
                " presented before his people at the outset",
                " of his mission of Prophethood were: (1)",
                " Worship of Allah, (2) adoption of piety",
                " (tagwa) and (3) obedience of the Messenger.",
                " Worship of AIIah meant that they should",
                " give up worship and service of all",
                " others and should acknowledge Allah alone as",
                " their Deity and should worship and carry",
                " out His commands alone. Taqwa (piety) meant",
                " that they should refrain from alI those",
                " works which caused Allah's anger and displeasure,",
                " and should instead adopt such attitude in",
                " their lives as the God fearing people",
                " should adopt. As for \"obey me\", it",
                " meant that they should obey the commands",
                " that he gave them as Allah's Messenger.",
                ""
            ]
        },
        {
            "verse-id": "[71:4]",
            "verse": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"",
            "description": [
                "The sentence yaghfir la-kum min dhunub-i-kum in",
                " the original does not mean that Allah",
                " will forgive some of their sins, but",
                " its correct meaning is: \"If you accept",
                " and acknowledge the three things which are",
                " being presented before you, He will forgive",
                " all the sins that you have committed",
                " in the past.\"",
                "*4) That is, \"If",
                " you accepted these three things, you would",
                " be given respite to live in the",
                " world until the time that Allah has",
                " appointed for your natural death.\"",
                "*5) \"The",
                " appointed time of Allah .. \": the",
                " time fixed by Allah for sending down",
                " a torment on a people. In this",
                " regard the Qur'an has at several places",
                " stated explicitly that when Allah's torment has",
                " been decreed for a certain people, they",
                " are not pardoned even if they affirm",
                " the faith after it.",
                "*6) That is,",
                " \"If you come to know fully well",
                " that the time which is now passing",
                " after you have received Allah's message through",
                " me, is, in fact, a period of",
                " respite that has been granted to you",
                " for affirming the faith-and there is no",
                " chance of escape from Allah's torment after",
                " the term of respite has elapsed-you would",
                " testify to the faith without delay and",
                " would not like to postpone it until",
                " the torment actually started descending on you.\"",
                ""
            ]
        },
        {
            "verse-id": "[71:5]",
            "verse": "He said, \"My Lord, indeed I invited my people [to truth] night and day.",
            "description": [
                "Omitting the history of a long period",
                " of preaching, now the Prophet Noah's petition",
                " that he made to Allah in the",
                " last stage of his worldly mission is",
                " being related."
            ]
        },
        {
            "verse-id": "[71:6]",
            "verse": "But my invitation increased them not except in flight.",
            "description": [
                "That is, \"As I went on calling",
                " them towards You, they went on fleeing",
                " farther and farther away from You.\""
            ]
        },
        {
            "verse-id": "[71:7]",
            "verse": "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.",
            "description": [
                "\"That you might pardon them\": that they",
                " might give up their attitude of disobedience",
                " and beg forgiveness of Allah, for in",
                " that way alone they could be forgiven",
                " by Allah.",
                "*10) They covered their faces",
                " either because they did not even like",
                " to have a look at the Prophet",
                " Noah's face, not to speak of listening",
                " to what he said, or they did",
                " so in order to hide their own",
                " faces from him as they passed by",
                " him so that he could not recognize",
                " and address them. This precisely was the",
                " attitude and conduct which the disbelievers of",
                " Makkah were adopting towards the Holy Prophet",
                " (upon whom be peace). In Surah Hud:",
                " 5, their attitude has been described thus:",
                " \"Behold, they turn aside their chests in",
                " order to hide themselves from him: Beware,",
                " even when they cover themselves up with",
                " their garments, Allah knows alike what they",
                " hide and what they show; He indeed",
                " knows even the secrets they conceal in",
                " their breasts.\" (For explanation, see E.N, 5,",
                " 6 of Hud).",
                "*11) \"Arrogance\" implies that",
                " they thought it was below their dignity",
                " to bow before the Truth and accept",
                " the admonition of Allah's Messenger. As for",
                " example, if a gentlmen admonishes a perverted",
                " person and he, in response, shakes his",
                " head and walks away haughtily, this would",
                " amount to rejecting the admonition with arrogance.",
                ""
            ]
        },
        {
            "verse-id": "[71:8]",
            "verse": "Then I invited them publicly.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:9]",
            "verse": "Then I announced to them and [also] confided to them secretly",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:10]",
            "verse": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:11]",
            "verse": "He will send [rain from] the sky upon you in [continuing] showers",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:12]",
            "verse": "And give you increase in wealth and children and provide for you gardens and provide for you rivers.",
            "description": [
                "This theme has been expressed at several",
                " places in the Qur'an that the rebellious",
                " attitude against God causes man to lead",
                " a wretched life not only in the",
                " Hereafter but also in this world, Contrary",
                " to this, if a nation adopts the",
                " way of faith and piety and obedience",
                " to Divine Commands, instead of disobedience, it",
                " benefits it not only in the Hereafter",
                " but also in the world; it is",
                " favoured with every kind of blessing. In",
                " Surah Ta Ha it has been said:",
                " \"And whoever turns away from My Admonition,",
                " will have a wretched life in the",
                " world, and We shall raise him up",
                " blind on the Day of Resurrection.\" (v.",
                " 124). In Surah AI-Ma'idah it has been",
                " said: \"Had the people of the Book",
                " observed the Torah and the Gospel and",
                " the other Books which had been sent",
                " down by their Lord, abundance of provisions",
                " would have been given to them from",
                " above and from beneath.\" (v. 66). In",
                " Al-A`raf: \"Had the people of the settlements",
                " believed and adopted the way of piety,",
                " We would have opened on them doors",
                " of blessings from the heavens and the",
                " earth.\" (v. 96). In Surah Hud, the",
                " Prophet Hud addressed his people, saying: \"And",
                " O my people, beg forgiveness of your",
                " Lord, then turn to Him in penitence,",
                " and He will open the gates of",
                " heavens for you and add more strength",
                " to your present strength.\" (v. 52). Through",
                " the Holy Prophet himself in this very",
                " Surah Hud, the people of Makkah have",
                " been admonished to the effect: \"And you",
                " should beg forgiveness of your Lord, then",
                " return to Him, and He will provide",
                " you with good provisions of life till",
                " an appointed term.\" (v. 3). According to",
                " the Hadid, the Holy Prophet said to",
                " the Quraish: \"There is a word which.",
                " if you accept, would enable you to",
                " rule over the Arab as well as",
                " the non-Arab world.\" (For explanation, see E.N.",
                " 96 of Al-Ma'idah, E.N.'s 3, 57 of",
                " Hud, E.N. 105 of Ta Ha; Introduction",
                " to Surah Suad), Acting on this same",
                " instruction from the Qur'an, once during a",
                " famine Hadrat `Umar came out to invoke",
                " Allah for the rain and begged only",
                " forgiveness of Him. The people said: \"O",
                " Commander of the Faithful. you have not",
                " prayed for the rain.\" He replied: \"I",
                " have knocked at the doors of heaven",
                " wherefrom the rain is sent down\", and",
                " then he recited these verses of Surah",
                " Nuh to them. (Ibn Jarir, Ibn Kathir).",
                " Likewise, when in the assembly of Hadrat",
                " Hasan Basri, a person complained of drought,",
                " he said to him \"Beg forgiveness of",
                " Allah.\" Another person complained of poverty, a",
                " third one said .that he was not",
                " being blessed with children, a fourth one",
                " said that his harvest had failed, and",
                " he continued to remind everyone to beg",
                " forgiveness of Allah. The people asked: \"How",
                " is it that you have suggested to",
                " all the people one and the same",
                " cure for the different complaints? He in",
                " response recited these verses of Surah Nuh",
                " to them\" (Al-Kashshaf)."
            ]
        },
        {
            "verse-id": "[71:13]",
            "verse": "What is [the matter] with you that you do not attribute to Allah [due] grandeur",
            "description": [
                "It means: \"As for the petty chiefs",
                " of the world, you think it would",
                " be dangerous to do anything against their",
                " dignity, but as for the Creator and",
                " Lord of the universe, you do not",
                " expect that He would also be a",
                " Being endowed with dignity. You rebel against",
                " Him, associate others in His Divinity, disobey",
                " His Commands, and yet you are not",
                " at all afraid that He would punish",
                " you for your misconduct. \""
            ]
        },
        {
            "verse-id": "[71:14]",
            "verse": "While He has created you in stages?",
            "description": [
                "That is, \"He has brought you to",
                " the present stage after passing you through",
                " different stages of creation and phases of",
                " development. In the beginning you lay in",
                " the form of sperm and ovum separately",
                " in the loins of your father and",
                " mother. Then the two were combined by",
                " the power of Allah and you were",
                " conceived. Then for nine months in the",
                " womb of the mother you were gradually",
                " formed into a perfect human form and",
                " were endowed with all those capabilities which",
                " you needed to function as a man",
                " in the world. Then you came out",
                " as a child from the mother's womb,",
                " and you were developed from one state",
                " to another constantly until you attained to",
                " full youth and then old age. While",
                " passing through all these stages you lay",
                " wholly in the power of Allah at",
                " all times. Had He so willed He",
                " would not have allowed you to be",
                " conceived but allowed another person to be",
                " conceived in your place. Had He so",
                " pleased He would have made you blind,",
                " deaf, dumb, or a cripple, in the",
                " mother's womb itself, or made you mentally",
                " deficient. Had He so liked you would",
                " not have been born as a living",
                " child. Even after your birth He could",
                " have destroyed you any time by causing",
                " you to fall a victim to one",
                " or other accident suddenly. About that God",
                " under Whose power you are so powerless,",
                " how could you have taken it into",
                " your head that you could commit any",
                " insolence against Him, could regard Him with",
                " every treachery and ingratitude, could rebel against",
                " Him as and when you pleased, and",
                " could do all this with impunity?"
            ]
        },
        {
            "verse-id": "[71:15]",
            "verse": "Do you not consider how Allah has created seven heavens in layers",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:16]",
            "verse": "And made the moon therein a [reflected] light and made the sun a burning lamp?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:17]",
            "verse": "And Allah has caused you to grow from the earth a [progressive] growth.",
            "description": [
                "Here, the creation of man out of",
                " the substances of the earth has been",
                " compared to the growth of vegetation. Just",
                " as at one time there was no",
                " vegetation on the earth, then Allah caused",
                " it to grow, so at one time",
                " man did not exist, then Allah created",
                " him."
            ]
        },
        {
            "verse-id": "[71:18]",
            "verse": "Then He will return you into it and extract you [another] extraction.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:19]",
            "verse": "And Allah has made for you the earth an expanse",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:20]",
            "verse": "That you may follow therein roads of passage.' \"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:21]",
            "verse": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:22]",
            "verse": "And they conspired an immense conspiracy.",
            "description": [
                "\"Mighty plot\": AlI those deceits, deceptions and",
                " frauds which the cheifs and religious guides",
                " were employing in an attempt to mislead",
                " the common people against the teachings of",
                " the Prophet Noah. For example, they said;",
                " \"Noah is no more than a mere",
                " man like yourselves. How can one believe",
                " that AIIah sends down Revelations to him?",
                " (Al-A'raf: 63, Hud: 27). \"We also see",
                " that only the meanest of us have",
                " become his followers without due thought. Had",
                " there been some weight in what he",
                " says, the elders of the people would",
                " have believed in him.\" (Hud: 27). \"Had",
                " Allah willed, He would have sent down",
                " angels.\" (A1Mu'minun: 24). \"Had he been sent",
                " by Allah, he would possess treasures, he",
                " would know the un-seen, and he would",
                " be free from all human needs, like",
                " the angels (Hud: 31). \"We tied nothing",
                " in him that might give him superiority",
                " over us. \" (Hud: 27). \"He merely",
                " intends to obtain superiority over you. \"",
                " (AlMu'minun: 24). \"Obviously, this man is possessed.\"",
                " (AI-Mu'minun: 25). Similar were the things that",
                " the Quraish chiefs said to mislead the",
                " people against the Holy Prophet (upon whom",
                " be peace)."
            ]
        },
        {
            "verse-id": "[71:23]",
            "verse": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.",
            "description": [
                "Of the gods of the Prophet Noah's",
                " people only those gods have been mentioned",
                " whom later the people of Arabia also",
                " had started worshipping and whose shrines were",
                " found all over the country at the",
                " advent of Islam. It is not impossible",
                " that the later generations heard the names",
                " of the ancient gods of Noah's people",
                " from the people who were saved from",
                " the flood, and when ignorance once again",
                " spread among their children, they made idols",
                " of the same gods and started worshipping",
                " them again. Wadd was the god of",
                " the Bani Kalb bin Wabash, a branch",
                " of the Quda`ah tribe, whose shrine had",
                " been built at Daumat al-Jandal. In the",
                " ancient Arabian inscriptions he has been named",
                " as Waddam ibam (father Wadd). Kalbi has",
                " stated that the image built to him",
                " was of a tnan of enormous size.",
                " The Quraish also acknowledged him as god",
                " and called him Wudd. It is after",
                " him that a person has been named",
                " 'Abd-i Wudd (slave of Wudd) in history.",
                " Suwa was the goddess of the Hudhayl",
                " tribe and her idol was a female",
                " figure. Her temple was situated at Ruhat",
                " near Yanbu. Yaghuth was the god of",
                " An'um, a branch of the Tay tribe,",
                " and of some branches of the Madhjih",
                " tribe. The people of Madhjih had installed",
                " its idol, the image of a lion,",
                " at Jurash, a place between Yaman and",
                " Hijaz. Among the Quraish also some people",
                " had been named `Abd-i Yaghuth. Ya'uq was",
                " the god of Khaywan, a branch of",
                " the Hamdan tribe, in the territory of",
                " Hamdan in Yaman; its idol was of",
                " the horse's figure. Nasr was the god",
                " of AI-i dhul-Kula', a branch of the",
                " Himyar tribe, in the territory of Himyar;",
                " it had its idol installed at Balkha`",
                " and had the image of the vulture.",
                " In the ancient inscriptions of Saba its",
                " name has been written as Nasor. Its",
                " temple was called bayt Nasor (house of",
                " Nasor) and its devotees ahl Nasor (people",
                " of Nasor). The ruins of the ancient",
                " temples that are found in Arabia and",
                " in the adjoining lands have the image",
                " of the vulture made on the doors",
                " of most of them."
            ]
        },
        {
            "verse-id": "[71:24]",
            "verse": "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"",
            "description": [
                "As we have explained in the introduction",
                " to this Surah, the Prophet Noah did",
                " not invoke this curse out of impatience",
                " but he invoked it when, after doing",
                " full justice to the preaching of his",
                " mission for many centuries, he became totally",
                " despaired of any success with his people.",
                " Similar were the conditions under which the",
                " Prophet Moses also had cursed Pharaoh and",
                " his people, thus: \"Lord, destroy their wealth",
                " and harden their hearts in a manner",
                " so that they do not believe until",
                " they see the painful torment.\" And Allah,",
                " in response, had said: \"The prayer of",
                " you both has been granted\" Yunus: 88-89).",
                " Like the Prophet Moses', the Prophet Noah's",
                " curse also was in complete conformity with",
                " Divine Will. Thus, in Surah Hud it",
                " has been said: \"And it was revealed",
                " to Noah: No more of your people",
                " will believe in you now than those",
                " who have already believed. So, do not",
                " grieve at their misdeeds.\" (v. 36)."
            ]
        },
        {
            "verse-id": "[71:25]",
            "verse": "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.",
            "description": [
                "That is, \"Drowning was not their end,",
                " but after death their souls were immediately",
                " subjected to the punishment of the Fire.\"",
                " This precisely was the treatment that was",
                " meted out to Pharaoh and his people,",
                " as has been stated in Surah Al-Mu'min:",
                " 45-46. (For explanation, see E.N. 63 of",
                " Al-Mu'min). This verse also is of those",
                " verses which prove the punishment of barzakh",
                " (intermediary stage between death and Resurrection).",
                "*20)",
                " That is, \"None of the gods whom",
                " they looked upon as their supporters and",
                " helpers came to their rescue.\" This, in",
                " fact, was a warning to the people",
                " of Makkah, as if to say: \"If",
                " you too are subjected to the torment",
                " of Allah, these gods on whom you",
                " have placed all your reliance, will avail",
                " you absolutely nothing. \""
            ]
        },
        {
            "verse-id": "[71:26]",
            "verse": "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:27]",
            "verse": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[71:28]",
            "verse": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"",
            "description": [
                ""
            ]
        }
    ]
}