{
    "name": "Al-Jinn",
    "id": 72,
    "verse-count": 28,
    "verse-info": [
        {
            "verse-id": "[72:1]",
            "verse": "Say, [O Muhammad], \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an.",
            "description": [
                "This shows that the jinn at that",
                " tithe were not visible to the Holy",
                " Prophet (upon whom be peace), nor he",
                " knew that they were hearing the Qur'an",
                " being recited, but AIIah informed him of",
                " the incident afterwards by Revelation. Hadrat 'Abdullah",
                " bin 'Abbas also has, in connection with",
                " this incident, stated: \"The Holy Messenger of",
                " AIIah had not recited the Qur'an before",
                " the jinn, nor did he see them.\"",
                " (Muslim, Tirmidhi, Musnad Ahmad, Ibn Jarir)."
            ]
        },
        {
            "verse-id": "[72:2]",
            "verse": "It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone.",
            "description": [
                "The words in the original are: Qur",
                " an-an 'ajaba. Qur an means \"something which",
                " is read again and again\", and the",
                " jinn probably used this word in this",
                " very meaning, for they were introduced to",
                " this Divine Revelation for the first time,",
                " and they did not perhaps know then",
                " that what they were hearing, was the",
                " Qur'an itself. 'Ajab is a superlative, which",
                " is used in Arabic for a wonderful",
                " thing. So, what the jinn said means:",
                " \"We have heard such a wonderful recital",
                " which is unique both in its language",
                " and in its subject-matter. \" This also",
                " shows that the jinn not only hear",
                " what human beings say but also understand",
                " their language fully, although it is not",
                " necessary that alI the jinn might know",
                " all the human languages. It is possible",
                " that those of them who live in",
                " a particular region of the earth might",
                " know the language of the people of",
                " that region. But in any case this",
                " statement of the Qur'an clearly shows that",
                " the jinn who listened to the Qur'an",
                " at that time were so conversant with",
                " the Arabic language that they not only",
                " appreciated the matchless eloquence of the Divine",
                " Word but also understood its sublime subject-matter",
                " fully well.",
                "*3) This throws light on",
                " several things: (1) That the jinn do",
                " not deny Allah's existence and His being",
                " Lord and Sustainer; (2) that among them",
                " also there are polytheists, who like polytheistic",
                " human beings ascribe divinity to others than",
                " AIlah: thus, the community of the jinn",
                " whose members heard the Qur'an was polytheistic;",
                " (3) that the Prophethood and revelation of",
                " Divine scriptures dces not exist among the",
                " jinn, but whoever of them believe, they",
                " believe in the Prophets raised among human",
                " beings and in the Books brought by",
                " them. This same thing is confirmed by",
                " Al-Ahqaf: 29-30, where it has been stated",
                " that the jinn who had then heard",
                " the Qur'an, were from among the followers",
                " of the Prophet Moses, and they after",
                " having heard the Qur'an, had invited their",
                " people to believe in the Revelation that",
                " had been sent down by God confirming",
                " the previous scriptures. Surah ArRahman also points",
                " to the same, for its whole subject-matter",
                " shows that the audience of the Holy",
                " Prophet's invitation are both the men and",
                " the jinn."
            ]
        },
        {
            "verse-id": "[72:3]",
            "verse": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son",
            "description": [
                "From this we know two things; (1)",
                " That these jinn were either from among",
                " the Christian jinn, or they were followers",
                " of a different religion in which Allah",
                " was regarded as having children and families.",
                " (2) That at that time the Holy",
                " Prophet (upon whom be peace) was reciting",
                " some such part of the Qur'an hearing",
                " which they realized the error of their",
                " creed and knew that it was sheer",
                " ignorance and impudence to ascribe wife and",
                " children to the High and Exalted Being",
                " of Allah."
            ]
        },
        {
            "verse-id": "[72:4]",
            "verse": "And that our foolish one has been saying about Allah an excessive transgression.",
            "description": [
                "The word safihuna as used in the",
                " Text can be spoken for an individual",
                " as well as for a group. If",
                " it is taken for a foolish individual,",
                " it would imply Iblis and if for",
                " a group, it would imply a group",
                " of foolish jinn who said such things.",
                ""
            ]
        },
        {
            "verse-id": "[72:5]",
            "verse": "And we had thought that mankind and the jinn would never speak about Allah a lie.",
            "description": [
                "That is, \"We were misled by those",
                " falsehoods because we could never think that",
                " the men or the jinn could ever",
                " dare forge a lie about Allah, but",
                " having heard this Qur'an we now know",
                " that they were, in fact, liars.\""
            ]
        },
        {
            "verse-id": "[72:6]",
            "verse": "And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden.",
            "description": [
                "Ibn `Abbas says that in the pre-lslamic",
                " days of ignorance when the Arabs had",
                " to spend a night in some uninhabited,",
                " desolate valley, they would shout out: \"We",
                " seek refuge of the jinn, who is",
                " owner of this valley.\" In other traditions",
                " of the pre-Islamic ignorance also the same",
                " thing has been reported frequently. For example,",
                " if in a place they ran short",
                " of water and fodder, the wandering Bedouins",
                " would send one of their men to",
                " some other place to see if water",
                " and fodder were available; and when they",
                " reached the new site under his direction,",
                " they would shout out before they halted",
                " to pitch the camp: \"We seek refuge",
                " of the sustainer of this valley so",
                " that we may live here in peace",
                " from every calamity.\" They believed that every",
                " un-inhabited place was under the control of",
                " one or another jinn, and if someone",
                " stayed there without seeking his refuge, the",
                " jinn would either himself trouble the settlers,",
                " or would let others trouble them. These",
                " believing jinn are referring to this very",
                " thing. They meant that when man, the",
                " vicegerent of the earth, started fearing them",
                " without any reason, and started seeking their",
                " refuge instead of God's, it caused their",
                " people to become even more arrogant, haughty",
                " and wicked, and they became even more",
                " fearless and bold in adopting error and",
                " disbelief."
            ]
        },
        {
            "verse-id": "[72:7]",
            "verse": "And they had thought, as you thought, that Allah would never send anyone [as a messenger].",
            "description": [
                "Another meaning of this sentence can be:",
                " \"Allah will not resurrect anyone after death.\"",
                " As the wards are comprehensive they can",
                " be taken to mean that, as among",
                " human beings, so among the jinn too",
                " there were the people who denied both",
                " the Prophethood and the Hereafter. However, in",
                " view of the theme that follows, the",
                " meaning that we have given in the",
                " text above is preferable, for according to",
                " it these believing jinn tell the people",
                " of their community: \"Your view is proved",
                " wrong that AIlah will not appoint anyone",
                " as a Messenger. In fact, the gates",
                " of heavens have been closed on us",
                " only because AIIah has already appointed a",
                " Messenger. \""
            ]
        },
        {
            "verse-id": "[72:8]",
            "verse": "And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[72:9]",
            "verse": "And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him.",
            "description": [
                "This is the reason why these jinn",
                " were now out searching as to what",
                " particularly had happened, or was going to",
                " happen, on the earth, which had necessitated",
                " strict security measures against eavesdropping so that",
                " they were driven away from wherever they",
                " tried to eavesdrop in any way."
            ]
        },
        {
            "verse-id": "[72:10]",
            "verse": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.",
            "description": [
                "This shows that such extraordinary measures were",
                " adopted in the heavens only on two",
                " kinds of occasions: first, when Allah might",
                " decide to inflict the dwellers of the",
                " earth with a torment, and the Divine",
                " will might be that before it was",
                " actually inflicted the jinn might not know",
                " and convey its news to warn their",
                " friendly human beings of the impending disaster.",
                " Second, that Allah might appoint a Messenger",
                " on the earth, and strict security measures",
                " might be adopted so that neither the",
                " messages being conveyed to him be interfered",
                " with by the satans nor should they",
                " be able to know beforehand what instructions",
                " were being given to the Messenger. Thus,",
                " the saying of the jinn means: \"When",
                " we noticed that strict security measures had",
                " been adopted in the heavens for the",
                " safeguard of the news, and the meteorites",
                " were being showered profusely, we wanted to",
                " know which of the two things had",
                " happened: whether Allah had caused a torment",
                " to descend suddenly on some people of",
                " the earth, or a Messenger had been",
                " raised somewhere on the earth. We were",
                " on the lookout for the same when",
                " we heard the wonderful Revelation, which guides",
                " to the Right Path, and we came",
                " to know that Allah had not sent",
                " down a torment but had raised a",
                " Messenger to show the Right Way to",
                " the people.\" For further explanation, see E.N.'s",
                " 8 to 12 of Al-Hijr, E.N. 7",
                " of ASSaaffat, E.N. I 1 of Al-Mulk).",
                ""
            ]
        },
        {
            "verse-id": "[72:11]",
            "verse": "And among us are the righteous, and among us are [others] not so; we were [of] divided ways.",
            "description": [
                "That is, \"Morally also there are good",
                " and bad jinn among us, and from",
                " the viewpoint of creed as well all",
                " do not follow one and the same",
                " religion, but we are divided into different",
                " groups.\" With these words the believing jinn",
                " want to convince the other jinn of",
                " their community that they certainly stood in",
                " need of finding out the right way",
                " and could not dispense with this need.",
                ""
            ]
        },
        {
            "verse-id": "[72:12]",
            "verse": "And we have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight.",
            "description": [
                "That is, \"We were led by this",
                " very idea to the way of success.",
                " As we were not fearless of AIlah",
                " and we believed that we would not",
                " be able to avoid His punishment if",
                " we disobeyed Him, so when we heard",
                " the Divine Revelation that had been sent",
                " to show the right way, we could",
                " not have the courage and boldness to",
                " persist in the beliefs that our foolish",
                " people had spread among us, afar we",
                " had known the truth. \""
            ]
        },
        {
            "verse-id": "[72:13]",
            "verse": "And when we heard the guidance, we believed in it. And whoever believes in his Lord will not fear deprivation or burden.",
            "description": [
                "\"Fear of loss\": fear of being given",
                " a lesser reward than what one actually",
                " deserves for one's good deeds, and \"injustice\"",
                " that one may be deprived of the",
                " reward for the good deeds done but",
                " duly punished for the errors committed or",
                " punished innocent; no believer has any fear",
                " of such an injustice from Allah."
            ]
        },
        {
            "verse-id": "[72:14]",
            "verse": "And among us are Muslims [in submission to Allah], and among us are the unjust. And whoever has become Muslim - those have sought out the right course.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[72:15]",
            "verse": "But as for the unjust, they will be, for Hell, firewood.'",
            "description": [
                "Here, one may ask: when, according to",
                " the Qur'an, the jinn have been created",
                " from the fire, what harm can the",
                " fire of Hell do them? The answer",
                " is: Even according to the Qur'an, man",
                " has been created out of the earth;",
                " why does then man feel hurt when",
                " a clod of earth is thrown at",
                " him? The truth is that although the",
                " whole body of man has been made",
                " from the earthly substances, when a living",
                " man of flesh and blood is moulded",
                " from them he becomes an entirely different",
                " thing from those substances; then other things",
                " made from the same substances become a",
                " means of causing harm to him. Likewise,",
                " although the jinn also have been created",
                " from the fire, when a living and",
                " sentient creation has been made from it,",
                " the same fire becomes a means of",
                " causing harm and hurt for it. (For",
                " further explanation, see E.N. 15 of Surah",
                " Ar-Rahman)."
            ]
        },
        {
            "verse-id": "[72:16]",
            "verse": "And [Allah revealed] that if they had remained straight on the way, We would have given them abundant provision",
            "description": [
                "The conversation of the jinn having come",
                " to an end, with this begins the",
                " speech of Allah.",
                "*16) This is the",
                " same thing as has been said above",
                " in Surah Nuh: 10-11. \"Seek forgiveness of",
                " Allah. .. He will send abundant rains",
                " for you from heaven. \" (For explanation,",
                " see E.N. 12 of Surah Nuh). Abundance",
                " of water has been used for abundance",
                " of blessings metaphorically for human life and",
                " habitation depend on water. Without water there",
                " can be no human settlement, nor can",
                " man's basic needs be fulfilled, nor his",
                " industries work and prosper."
            ]
        },
        {
            "verse-id": "[72:17]",
            "verse": "So We might test them therein. And whoever turns away from the remembrance of his Lord He will put into arduous punishment.",
            "description": [
                "\"We might try them by that blessing\":",
                " \"We might see whether they remain grateful",
                " after having received the blessing or not,",
                " and whether they put Our blessing to",
                " right use or not. \"",
                "*18) \"To",
                " turn away from Allah's remembrance\" means that",
                " one may reject the advice and admonition",
                " sent down by Allah, or one may",
                " disdain giving ear to Allah's remembrance, or",
                " one may turn away from the worship",
                " of Allah."
            ]
        },
        {
            "verse-id": "[72:18]",
            "verse": "And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone.",
            "description": [
                "The commentators generally have taken \"mosques\" to",
                " mean the places of worship. Accordingly, the",
                " verse means: \"None should he associated in",
                " the worship of Allah in the places",
                " of worship. Hadrat Hasan Basri says: The",
                " entire earth is a place of worship,",
                " and the verse means to say: polytheism",
                " ought not to be committed anywhere on",
                " God's earth,\" He has reasoned out this",
                " meaning from the Holy Prophet's Hadith \"For",
                " me the entire earth has been made",
                " a place of worship and a means",
                " of obtaining purity:\" Hadrat Sa`id bin Jubair",
                " has interpreted masajid to imply the parts",
                " of the body on which one prostrates",
                " oneself, i.e. the hands, the knees, toes",
                " and forehead. According to this explanation, the",
                " verse means: These limbs have been made",
                " by Allah; no one should prostrate oneself",
                " on these before anyone other than Allah.",
                ""
            ]
        },
        {
            "verse-id": "[72:19]",
            "verse": "And that when the Servant of Allah stood up supplicating Him, they almost became about him a compacted mass.\"",
            "description": [
                "\"Servant of AIIah\": the Holy Prophet (upon",
                " whom be peace)."
            ]
        },
        {
            "verse-id": "[72:20]",
            "verse": "Say, [O Muhammad], \"I only invoke my Lord and do not associate with Him anyone.\"",
            "description": [
                "That is, to call upon Allah is",
                " no objectionable thing, which may so provoke",
                " the people. The evil thing, however, is",
                " that one should associate another with Allah",
                " in His divinity, and this I never",
                " do; this is done by those who",
                " mob and surround me when they hear",
                " God mentioned by me."
            ]
        },
        {
            "verse-id": "[72:21]",
            "verse": "Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[72:22]",
            "verse": "Say, \"Indeed, there will never protect me from Allah anyone [if I should disobey], nor will I find in other than Him a refuge.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[72:23]",
            "verse": "But [I have for you] only notification from Allah, and His messages.\" And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever.",
            "description": [
                "That is, \"I do not claim to",
                " have any share or role in the",
                " Godhead of AIIah, nor that I possess",
                " any power in making or marring the",
                " people's destinies. I am only a Messenger",
                " and the mission that has been entrusted",
                " to me is no more than that",
                " I should convey the messages of Allah",
                " to you. As for the powers of",
                " Godhead, they wholly belong to Allah. Not",
                " to speak of benefiting or harming others,",
                " I do not have the power to",
                " cause good or harm even to myself.",
                " If I disobey AIlah, I cannot seek",
                " and have refuge anywhere from His punishment,",
                " and 1 have no helper and protector",
                " beside AIIah.\" (For further explanation, see E.N.",
                " 7 of Ash-Shura).",
                "*23) This does not",
                " mean that every sin and act of",
                " disobedience will cause one to live in",
                " Hell for ever, but in view of",
                " the context in which this thing bas",
                " been said, the verse means: the one",
                " who dces not accept the invitation to",
                " Tauhid given by AIlah and His Messenger",
                " and does not refrain from polytheism will",
                " suffer in Hell for ever."
            ]
        },
        {
            "verse-id": "[72:24]",
            "verse": "[The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number.",
            "description": [
                "The background of this verse is that",
                " those of the Quraish who used to",
                " mob and surround the, Holy Prophet (upon",
                " whom be peace) as soon as they",
                " heard his invitation calling to Allah, were",
                " under the delusion that they had a",
                " strong band at their back and that",
                " the Holy Prophet had only a handful",
                " of men with him, and therefore, they",
                " would easily overwhelm him. At this it",
                " is being said: Today these people find",
                " the Messenger helpless and friendless and themselves",
                " supported and strengthened by great hosts and,",
                " therefore, feel encouraged and emboldened to suppress",
                " the invitation to the Truth. But when",
                " the evil time with which they are",
                " being threatened comes, they will know who",
                " in actual fact is helpless and friendless.",
                ""
            ]
        },
        {
            "verse-id": "[72:25]",
            "verse": "Say, \"I do not know if what you are promised is near or if my Lord will grant for it a [long] period.\"",
            "description": [
                "The style itself shows that this is",
                " an answer which has been given without",
                " citing the question. Probably, hearing what has",
                " been said above, the opponents might have",
                " asked mockingly and tauntingly: \"When will the",
                " time with which you are threatening us",
                " come?\" In response, the Holy Prophet (upon",
                " whom be peace) was commanded to say:",
                " \"The time will certainly come, but I",
                " have not been told the date of",
                " its coming. AIIah alone knows whether is",
                " will come soon, or whether a distant",
                " term has been set for it. \"",
                ""
            ]
        },
        {
            "verse-id": "[72:26]",
            "verse": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone",
            "description": [
                "That is, the knowledge of the unseen",
                " wholly rests with Allah: He does not",
                " give the whole of this knowledge to",
                " anyone."
            ]
        },
        {
            "verse-id": "[72:27]",
            "verse": "Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers",
            "description": [
                "That is, the Messenger by himself is",
                " no knower of the unseen, but when",
                " AIIah chooses him to perform the mission",
                " of Prophethood, He grants him the knowledge",
                " of those of the unseen truths which",
                " He is pleased to grant.",
                "*28) \"Guards\":",
                " Angels. That is, when Allah sends down",
                " the knowledge of the unseen realities to",
                " the Messenger by revelation, He appoints angels",
                " on every side to safeguard it so",
                " that the knowledge reaches the Messenger in",
                " a safe condition, free from every kind",
                " of adulteration. This is the same thing",
                " which has been expressed in vv. 8-9",
                " above, saying: After the appointment of the",
                " Holy Messenger the jinn found that all",
                " the doors to the heavens had been",
                " closed, and they noticed that strict security",
                " measures had been adopted because of which",
                " no room had been left for them",
                " to eavesdrop."
            ]
        },
        {
            "verse-id": "[72:28]",
            "verse": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number.",
            "description": [
                "This can have three meanings: (1) That",
                " the Messenger may know that the angels",
                " have delivered the messages of AIIah to",
                " him precisely and accurately; (2) that Allah",
                " may know that the angels have conveyed",
                " the messages of their Lord to His",
                " Messenger precisely and accurately; and (3) that",
                " AIIah may know that the Messenger has",
                " conveyed the messages of his Lord to",
                " His servants precisely and accurately. The words",
                " of the verse are comprehensive and may",
                " possibly imply all the three meanings. Besides,",
                " the verse also points out two other",
                " things: first, that the Messenger is given",
                " that knowledge of the unseen, which is",
                " necessary for him to perform his mission",
                " of Prophethood; second, that the angels keep",
                " watch that the Revelation reaches the Messenger",
                " safely and also that the Messenger conveys",
                " the messages of his Lord to His",
                " servants precisely and accurately.",
                "*30) That is,",
                " Allah's power so encompasses the Messenger as",
                " well as the angels that if they",
                " swerve even a little from His will,",
                " they can be detected immediately. Moreover, a",
                " complete record has been kept of each",
                " letter of the messages sent down by",
                " Allah. The Messengers and the angels cannot",
                " dare add or subtract even a letter",
                " from them."
            ]
        }
    ]
}