{
    "name": "Al-Muddaththir",
    "id": 74,
    "verse-count": 56,
    "verse-info": [
        {
            "verse-id": "[74:1]",
            "verse": "O you who covers himself [with a garment],",
            "description": [
                "A study of the background of the",
                " revelation of these verses given in the",
                " introduction above can help one understand why",
                " the Holy Prophet (upon whom be peace)",
                " on this occasion has been addressed with",
                " Ya ayyuhal-Muddaththiru instead of Ya ayyuhar-Rasulu (O",
                " Messenger), or Ya ayyuhan-Nabiyyu (O Prophet). As",
                " the Holy Prophet had been terrified when",
                " he had suddenly seen the Angel Gabriel",
                " (on whom be peace), sitting on a",
                " throne between heaven and earth, and had",
                " returned hastily home and asked the people",
                " of the house to cover him up,",
                " so Allah addressed him with Ya ayyuhal-Muddaththiru.",
                " From this fine way of address the",
                " meaning which automatically follows is: \"O My",
                " dear Servant, why have you lain down",
                " thus enwrapped? You have been put under",
                " the. burden of a great mission: you",
                " must now arise from your solitude to",
                " perform this mission with resolution and courage.\"",
                ""
            ]
        },
        {
            "verse-id": "[74:2]",
            "verse": "Arise and warn",
            "description": [
                "A command of this very nature had",
                " been given to the prophet Noah (peace",
                " be on him) while appointing him to",
                " the office of Prophet hood; \"Warn the",
                " people of your nation before they are",
                " overtaken by a painful torment.\" (Nuh: 1)",
                " The verse means: \"O you who lies",
                " enwrapped, stand up and arouse the people",
                " who live in heedlessness around you: warn",
                " them of the fate which would certainly",
                " overtake them if they remained involved in",
                " the same heedlessness, Warn them that they",
                " are not living in a lawless kingdom",
                " where they are free to conduct themselves",
                " as they like and where they can",
                " do wherever they please without any fear",
                " or being called to account for it.",
                " \""
            ]
        },
        {
            "verse-id": "[74:3]",
            "verse": "And your Lord glorify",
            "description": [
                "This is the primary duty of a",
                " Prophet, which he has to perform in",
                " this world. His foremost duty is to",
                " refute the greatness of alI those whom",
                " the ignorant people might be holding as",
                " great, and publicly proclaim that we greatness",
                " in this universe belongs to none but",
                " Allah alone. For this very reason the",
                " phrase Allahu Akbar has been Geld as",
                " of supreme importance in Islam. The adhan",
                " (call to prayer) begins with the proclamation",
                " of Allahu Akbar. The Muslim enters the",
                " Prayer itself with Allahu Akbar and repeats",
                " Allahu Akbar every time he sits or",
                " stands, He pronounces Bismillahi Allahu Akbar also",
                " when slaughtering an animal. The slogan of",
                " Allahu Akbar has become a most distinctive",
                " and prominent emblem of Muslims throughout the",
                " world today, for the Prophet of this",
                " Ummah himself had embarked on his mission",
                " with the magnification and glorification of Almighty",
                " Allah. Here, there is another fine point,",
                " which must be understood well. As we",
                " have learnt from the background of the",
                " revelation of these verses, this was the",
                " first occasion when the Holy Prophet (upon",
                " whom be peace) had been commanded to",
                " arise for performing the duties of the",
                " great mission of Prophethood, and it was",
                " obvious that the city and society in",
                " which he was commanded to perform this",
                " mission, was the centre of polytheism. Not",
                " only were the people around him polytheistic",
                " like the common Arabs but, more than",
                " that, the city of Makkah had become",
                " the most sacred place of pilgrimage for",
                " the polytheistic Arabs, and the Quraish were",
                " its attendants. Arising of a person in",
                " such a place all by himself and",
                " proclaiming the Oneness of God in the",
                " face of polytheism was full of risks.",
                " That is why the exhortation to \"proclaim",
                " the greatness of your Lord\" just after",
                " \"arise and wam\" contains this meaning also:",
                " \"Do not at all mind the terrifying",
                " and dreadful forces that seem to be",
                " obstructing and impeding your work and proclaim",
                " publicly that your Lord is the greatest",
                " of all those who can hinder and",
                " resist you from giving your message. This",
                " is indeed the greatest encouragement for a",
                " person who embarks on a Divine mission.",
                " The one who has Allah's greatness and",
                " majesty deeply embedded in his heart will",
                " feel no hesitation at all in facing",
                " and fighting the entire world by himself",
                " for the sake of Allah."
            ]
        },
        {
            "verse-id": "[74:4]",
            "verse": "And your clothing purify",
            "description": [
                "These are very comprehensive words, which are",
                " full of meaning. They mean this: \"Keep",
                " your garments free from every filth and",
                " impurity, for the purity of the body",
                " and garments and the purity of the",
                " spirit are inter-linked and inter-dependent. \" A",
                " pure spirit and an impure body with",
                " impure garments cannot live together. The society",
                " in which the Holy Prophet (upon whom",
                " be peace) had arisen with the invitation",
                " to Islam, was not only steeped in",
                " the evils of unbelief and immorality, but",
                " was also devoid of even the most",
                " elementary concepts of purity and cleanliness, and",
                " the Holy Prophet's task was to teach",
                " its members cleanliness in every way of",
                " life. Therefore he was instructed to establish",
                " and present a high standard of purity",
                " in his external life as well. Thus,",
                " it is the result of the same",
                " instruction that the Holy Prophet (upon whom",
                " be peace) gave mankind such detailed teaching",
                " about the cleanliness of the body and",
                " garments as is not possessed even by",
                " the most civilized nations of today, not",
                " to speak of the Arabs of the",
                " pre-Islamic days of ignorance. So much so",
                " that in most of the languages of",
                " the world there is no word synonymous",
                " with \"taharat\" \". On the contrary, in",
                " Islam every book of the Hadith and",
                " Fiqh begins with injunctions and instructions on",
                " taharat (purity), which distinguishes between purity and",
                " impurity and gives minute details about the",
                " methods and means of obtaining purity. The",
                " second meaning of these words is: \"Keep",
                " your garments neat and clean.\" The criterion",
                " of religiosity given to the world by",
                " the monastic concepts was that a man",
                " was holy to the extent he was",
                " unclean. If a person happened to put",
                " on neat clothes, he was looked upon",
                " as a worldly man, whereas the fact",
                " is that human nature abhors filth and",
                " uncleanness and even a person of ordinary",
                " fine taste loves to be associated only",
                " with a neat and clean person. On",
                " this very basis, for the one calling",
                " the people to Allah it was made",
                " imperative that externally also he should look",
                " so neat and clean that the people",
                " should regard him with esteem and his",
                " personality should not be stained in any",
                " way so as to repel others. The",
                " third meaning of this Divine Command is:",
                " \"Keep your garments free from moral evils:",
                " your dress should be neat and clean",
                " but it should bear no tinge of",
                " vanity and pride, display and exhibition, pomp",
                " and show. \" The dress is the",
                " first thing that introduces the personality of",
                " a person to others. The kind of",
                " dress a person wears makes the people",
                " judge at first sight what kind of",
                " a man he is. The dresses of",
                " the rulers and princes, the dresses of",
                " the religious functionaries, the dresses of the",
                " vain and conceited people, the dresses of",
                " the mean and shallow people, the dresses",
                " of the evil-natured and characterless people, all",
                " represent the tastes and tempers of those",
                " who wear them. The temper of the",
                " one calling to Allah is naturally different",
                " from all such people. Therefore, his dress",
                " also should necessarily be different from all",
                " of them. He should wear such a",
                " dress as .should make everyone else feel",
                " that he is a noble and refined",
                " person, who is not involved in any",
                " evil of the self. Its fourth meaning",
                " is: Keep away from moral evils. Ibn",
                " `Abbas, Ibrahim Nakha`i, Sha`bi, `Ata', Mujahid. Qatadah,",
                " Sa`id bin Jubair, Hasan Basri and other",
                " major commentators have given this very meaning",
                " to this verse: keep yourself morally pure",
                " and avoid all that is blameworthy. In",
                " Arabic usage also when it is said:",
                " \"So and so is clean in his",
                " garments\", it implies that he is morally",
                " good and pure; on the contrary, when",
                " it is said: \"He is filthy in",
                " his garments\", it means that he is",
                " dishonest and fraudulent in his dealings: he",
                " is unreliable."
            ]
        },
        {
            "verse-id": "[74:5]",
            "verse": "And uncleanliness avoid",
            "description": [
                "\"Filth\" implies every kind of filth, whether",
                " of belief and thought, of morals and",
                " deeds, of the body, dress or mode",
                " of life. The versemeans: \"Keep yourself free",
                " from the filth of evils which are",
                " prevalent in society around you: no one",
                " should ever impute to you the blame",
                " that your own life itself is stained",
                " in some degree with the evils that",
                " you tell others to avoid.\""
            ]
        },
        {
            "verse-id": "[74:6]",
            "verse": "And do not confer favor to acquire more",
            "description": [
                "The words wa Ia tamnun tastakthir in",
                " the original are so vast.in meaning that",
                " no one sentence can convey their full",
                " sense in translation. Their one meaning is:",
                " \"Whomever you favour, you should favour him",
                " without any selfish motive. Your bestowal of",
                " an endowment and donation, your generosity and",
                " good treatment should be only for the",
                " sake of Allah: there should be no",
                " trace in it of the desire that",
                " you should receive any worldly gains in",
                " return for the favour done. In other",
                " words, do good to others for the",
                " sake of Allah, not for seeking any",
                " benefits.\" The second meaning is: \"Although the",
                " mission of Prophethood that you are performing",
                " is a great favour in itself, for",
                " the people are obtaining true guidance because",
                " of it, do not remind the people",
                " of this favour, nor try to obtain",
                " any personal benefits from it. \" The",
                " third meaning is: \"Although you are performing",
                " a great service, you should never gloat",
                " over it, nor should ever have the",
                " idea that by performing your prophetic duties,",
                " at the risk of life, you are",
                " doing any favour to your Lord.\""
            ]
        },
        {
            "verse-id": "[74:7]",
            "verse": "But for your Lord be patient.",
            "description": [
                "That is, \"The task that is being",
                " entrusted to you is full of hazards:",
                " you will meet with great hardships and",
                " difficulties and troubles on this way: even",
                " your own people will turn hostile to",
                " you and the whole of Arabia will",
                " become your enemy. Yet you should endure",
                " with patience, for the sake of your",
                " Lord, whatever you may have to face",
                " in this way, and carry out all",
                " your duties firmly and resolutely. Fear, greed,",
                " friendship, enmity, love, all these will hinder",
                " your way, but you should stand your",
                " ground firmly and steadfastly.\" These were the",
                " very preliminary instructions which Allah gave His",
                " Messenger (upon whom be peace) at the",
                " time when He commanded him to arise",
                " and start the work of Prophethood. If",
                " a person ponders over these brief sentences",
                " and their meaning his heart will testify",
                " that no better instructions could be given",
                " W a Prophet at the commencement of",
                " his prophetic mission. In these he was",
                " told what he was required to do,",
                " what kind of life, morals and dealings",
                " he should adopt, and taught with what",
                " intention, mentality and mode of thought he",
                " should go about his mission and also",
                " forewarned what kind of conditions he would",
                " meet with in the performance of his",
                " mission and how he would have to",
                " face and overcome them Today the people",
                " who, blinded by their prejudices, say that",
                " these words were. God forbid, uttered by",
                " the Holy Prophet (upon whom be peace)",
                " during epileptic fits, should study these sentences",
                " carefully and judge for themselves whether these",
                " are the product of any epileptic fits,",
                " or the instructions of a God, which",
                " He gave to His Servant while appointing",
                " him to the mission of Apostleship."
            ]
        },
        {
            "verse-id": "[74:8]",
            "verse": "And when the trumpet is blown,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:9]",
            "verse": "That Day will be a difficult day",
            "description": [
                "As already explained in the introduction, this",
                " part of the Surah wa:. sent down",
                " a few months after the initial verses",
                " when at the beginning of the first",
                " ever Hajj season, after the advent of",
                " Islam, the Quraish chiefs decided in a",
                " conference to start a powerful propaganda campaign",
                " to dissuade the outsiders, who came to",
                " visit the Ka`bah, from the Qur'an and",
                " the Holy Prophet Muhammad (upon whom be",
                " Allah's peace and blessings). In these verses,",
                " this very scheming of the Quraish has",
                " been reviewed, and the review has begun",
                " with the words, as if to ay:",
                " \"You thay act as you please, but",
                " even if you succeed in achieving your",
                " object by these devices in the world,",
                " how will you save yourselves from your",
                " evil end un the Day when the",
                " Trumpet will be sounded and Resurrection established?\"",
                " (For explanation of the Trumpet, see E.N.",
                " 47 of Al-An`am, E.N. 57 of Ibrahim,",
                " E.N. 78 of Ta Ha, E.N. 1",
                " of Al-Hajj, E.N.'s 46, 47 of Ya",
                " Sin, E.N. 79 of Az-Zumar, E.N. 52",
                " of Qaf)."
            ]
        },
        {
            "verse-id": "[74:10]",
            "verse": "For the disbelievers - not easy.",
            "description": [
                "These words by themselves support the conclusion",
                " that that Day will be light for",
                " the believers, and its hardships will be",
                " specially intended only for the deniers of",
                " the Truth. Moreover, these words also contain",
                " the meaning that the severity of that",
                " Day will be of an enduring and",
                " permanent nature for disbelievers it will not",
                " be a severity which might be expected",
                " to become mild with the passage of",
                " time."
            ]
        },
        {
            "verse-id": "[74:11]",
            "verse": "Leave Me with the one I created alone",
            "description": [
                "The address is directed to the Holy",
                " Prophet (upon whom be peace) and it",
                " means: \"O Prophet, leave the case of",
                " the person (Walid bin al-Mughirah) to Me,",
                " who in the disbelievers' conference proposed that",
                " you should be branded as a sorcerer",
                " among the pilgrims coming from different parts",
                " of Arabia; it is now for Me",
                " to deal with him; you need not",
                " bother yourself about it at all. \"",
                "",
                "*11) This sentence can have two meanings",
                " and both are correct: (1) \"That when",
                " I created him, he was not at",
                " that time born with any wealth and",
                " children and position of authority and chieftainship;",
                " ' and (2) \"that I alone was",
                " his Creator: those other gods whose godhead",
                " he is so ardently trying to keep",
                " established and is opposing your invitation to",
                " One God for the same object, were",
                " not My associates in creating him. \"",
                ""
            ]
        },
        {
            "verse-id": "[74:12]",
            "verse": "And to whom I granted extensive wealth",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:13]",
            "verse": "And children present [with him]",
            "description": [
                "Walid bin al-Mughirah had ten or twelve'",
                " sons of whom Hadrat Khalid bin Walid",
                " became most famous. For these sons the",
                " word shuhud has been used, which can",
                " have several meanings: (1) That they do",
                " not have to run about and go",
                " abroad in search of their livelihood: they",
                " have enough provisions at home; therefore, they",
                " can always remain at the beck and",
                " call of their father; (2) that all",
                " his sons are prominent and influential people:",
                " they sit in assemblies and conferences with",
                " him; and (3) that they are the",
                " people of high rank and position and",
                " their testimony is accepted in all matters",
                " of life."
            ]
        },
        {
            "verse-id": "[74:14]",
            "verse": "And spread [everything] before him, easing [his life].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:15]",
            "verse": "Then he desires that I should add more.",
            "description": [
                "Its one meaning is that there is",
                " still no end to his greed. In",
                " spite of having all this he still",
                " desires that he should be granted every",
                " good thing of the world. Another meaning",
                " which Hadrat Hasan Basri, and some other",
                " scholars have given is:, \"He used to",
                " say: If what Muhmmad (upon whom be",
                " peace) says is really true that there",
                " is another life after death, and there",
                " will be a Paradise also in it,",
                " then that Paradise too has been prepared",
                " for me.\""
            ]
        },
        {
            "verse-id": "[74:16]",
            "verse": "No! Indeed, he has been toward Our verses obstinate.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:17]",
            "verse": "I will cover him with arduous torment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:18]",
            "verse": "Indeed, he thought and deliberated.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:19]",
            "verse": "So may he be destroyed [for] how he deliberated.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:20]",
            "verse": "Then may he be destroyed [for] how he deliberated.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:21]",
            "verse": "Then he considered [again];",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:22]",
            "verse": "Then he frowned and scowled;",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:23]",
            "verse": "Then he turned back and was arrogant",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:24]",
            "verse": "And said, \"This is not but magic imitated [from others].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:25]",
            "verse": "This is not but the word of a human being.\"",
            "description": [
                "The reference is to what happened in",
                " the conference of the disbelievers of Makkah.",
                " From the details of it that we",
                " have given in the Introduction, it becomes",
                " obvious that this man in his heart",
                " had become fully convenced of the Qur'an's",
                " being Divine Word, but in order to",
                " save his position as a chief of",
                " his people, he was not prepared to",
                " affirm faith. When in the conference he",
                " himself turned down all the accusations that",
                " the Quraish chiefs were proposing against the",
                " Holy Prophet (upon whom be peace), he",
                " was compelled to devise an accusation from",
                " himself, which could be spread among the",
                " Arabs in order to bring a bad",
                " name to the Holy Prophet. Then, the",
                " way he struggled against his conscience, and",
                " the way he devised an accusation at",
                " last after a prolonged mental conflict, has",
                " been vividly depicted here."
            ]
        },
        {
            "verse-id": "[74:26]",
            "verse": "I will drive him into Saqar.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:27]",
            "verse": "And what can make you know what is Saqar?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:28]",
            "verse": "It lets nothing remain and leaves nothing [unburned],",
            "description": [
                "This can have two meanings: first, that",
                " it will bum to ashes whoever is",
                " cast into it, but even after death",
                " he will not escape from punishment: he",
                " will be given life once again and",
                " burnt once again, This very subject has",
                " been treated at another place thus: He",
                " will neither die in it nor live.\"",
                " (AI-A`la: 13) Another meaning also can be:",
                " \"It will leave none who has deserved",
                " the punishment and it will spare none",
                " from being punished. \""
            ]
        },
        {
            "verse-id": "[74:29]",
            "verse": "Blackening the skins.",
            "description": [
                "After saying that it will leave nothing",
                " of the body unconsumed, making mention of",
                " \"scorching of the skin\" separately seems to",
                " be somewhat unnecessary. But this form of",
                " the punishment has been mentioned separately in",
                " particular because it is the skin of",
                " a man's face and body which actually",
                " makes his personality prominent, and it is",
                " its ugliness which makes him feel most",
                " ill at ease. He is not so",
                " grieved at the internal troubles of his",
                " body as, for instance, at his face",
                " being ugly, or that there should be",
                " spots on the skin of the exposed",
                " parts of his body, abhorrent to others.",
                " That is why it has been said:",
                " If the people who feel proud of",
                " their personalities in the world because of",
                " having handsome faces and splendid bodies, treat",
                " the Revelations of Allah mockingly, as did",
                " Walid bin al-Mughirah, their faces will be",
                " scorched and their skins burnt black."
            ]
        },
        {
            "verse-id": "[74:30]",
            "verse": "Over it are nineteen [angels].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:31]",
            "verse": "And We have not made the keepers of the Fire except angels. And We have not made their number except as a trial for those who disbelieve - that those who were given the Scripture will be convinced and those who have believed will increase in faith and those who were given the Scripture and the believers will not doubt and that those in whose hearts is hypocrisy and the disbelievers will say, \"What does Allah intend by this as an example?\" Thus does Allah leave astray whom He wills and guides whom He wills. And none knows the soldiers of your Lord except Him. And mention of the Fire is not but a reminder to humanity.",
            "description": [
                "The whole passage from here to \"none",
                " knows the hosts of your Lord but",
                " He Himself\", is a parenthetical sentence, which",
                " has been inserted here to answer an",
                " objection of the disbelievers, who had started",
                " mocking it when they heard the Holy",
                " Prophet (upon whom be peace) say that",
                " 19 keepers had been appointed over Hell.",
                " Their objection was: \"How strange that, on",
                " the one hand, we are told that",
                " all human beings, from the time of",
                " the Prophet Adam till Resurrection, who disbelieved",
                " and committed evil, will be cast into",
                " Hell. and, on the other, that there",
                " will be only 19 keepers, who will",
                " administer punishment to the countless numbers of",
                " men in such a huge Hell. \"",
                " This caused a huge laughter among the",
                " chiefs of Quraish. Abu Jahl said: \"Brothers,",
                " are you so powerless that even as",
                " many as ten of you at a",
                " time will not be able to overpower",
                " a single policeman of Hell?\" At this",
                " a wrestler of the Bani Jumha said:",
                " ` Well I will deal with and",
                " overpower at least 17 of them by",
                " myself; as for the remaining two, you",
                " all together can tackle them. \" In",
                " response these sentences have been inserted as",
                " a parenthetical clause.",
                "*18) That is, \"It",
                " is foolish on your part to compare",
                " the angelic powers to human powers. They",
                " will be angels, not men, and you",
                " cannot imagine what tremendous powers Allah has",
                " granted to the angels He has created.\"",
                "",
                "*19) That is, \"Although apparently there was",
                " no need to mention the number of",
                " the keepers of Hell, yet We have",
                " mentioned it so that it becomes a",
                " trial for every such person who may",
                " be concealing any kind of unbelief in",
                " his heart. Such a man may be",
                " making a great display of his faith",
                " but if he conceals even a tinge",
                " of the doubt about the Godhead and",
                " supreme powers of God, or about Revelation",
                " and Prophethood, anywhere in his heart, his",
                " disbelief would immediately be exposed as soon",
                " as he would hear that only 19",
                " policemen would control countless numbers of the",
                " culprits from among the jinn and men",
                " in such a huge jail and would",
                " also administer punishment to each of them",
                " individually. \"",
                "*20) Some commentators have explained",
                " it thus: \"As in the scriptures of",
                " the Jews and Christians themselves also the",
                " same number of the angels has been",
                " mentioned as keepers of Hell, they would",
                " be convinced of this thing's being truly",
                " from Allah as soon as they heard",
                " it.\" But in our opinion this commentary",
                " is not correct for two reasons. First,",
                " we have not been able to see",
                " anywhere in the existing scriptures of the",
                " Jews and Christians in spite of search",
                " that the number of the angels appointed",
                " over Hell is 19. Second, there are",
                " many things in the Qur'an, which also",
                " have been mentioned in the scriptures of",
                " the Jews and Christians, yet they explain",
                " them away, saying that the Prophet Muhammad",
                " (upon whom be Allah's peace and blessings)",
                " has plagiarized these from their books. For",
                " these reasons the correct meaning of this",
                " statement in our opinion is: The Holy",
                " Prophet Muhammad (upon whom be Allah's peace",
                " and blessings) knew fully well that he",
                " would be ridiculed as soon as the",
                " disbelievers heard that 19 angels had been",
                " appointed over Hell, but in spite of",
                " this, he presented without the least hesitation",
                " and fear publicly before the people what",
                " had been revealed to him from Allah,",
                " and did not at all mind the",
                " jesting and mocking by the people. The",
                " pagans of Arabia were unaware of the",
                " unique distinction of the Prophets, but the",
                " followers of the earlier scriptures were fully",
                " aware that the Prophets in every age",
                " used to convey to their people intact",
                " whatever they received from God, whether it",
                " pleased them or displeased them. On this",
                " very basis it was to be expected",
                " of the Jews and the Christians that",
                " they would be convinced of the Prophet",
                " Muhammad's truth for only a Prophet could",
                " present an apparently strange thing without any",
                " hesitation before the people in an environment",
                " charged with antagonism and hostility. This also",
                " is evident that such a thing was",
                " shown by the Holy Prophet on many",
                " other occasions. Its most prominent example is",
                " the event of the mi'raj (ascension) which",
                " he related openly before a general assembly",
                " of the disbelievers and did not at",
                " all care how his opponents would behave",
                " and react after they had heard the",
                " story of the wonderful event.",
                "*21) It",
                " has been explained at several places in",
                " the Qur'an above that on the occasion",
                " of every trial when a believer remains",
                " steadfast to his faith, and forsaking the",
                " way of doubt and denial, disobedience or",
                " disloyalty to the faith, adopts the way",
                " of faith, obedience and loyalty to it,",
                " it increases and strengthens him all the",
                " more in faith and resignation (For explanation,",
                " see 'Al-Imran: 173, Al-Anfal: 2, At-Taubah: 124125,",
                " Al-Ahzab: 22, Al-Fath: 4 and the corresponding",
                " E.N.'s).",
                "*22) As \"sickness of the heart\"",
                " in the Qur'an is generally understood to",
                " imply hypocrisy, seeing this word here some",
                " commentators have expressed the view that this",
                " verse was revealed at Madinah, for the",
                " hypocrites appeared at Madinah. But this view",
                " is not correct for several reasons. In",
                " the first place, the assertion itself that",
                " there were no hypocrites at Makkah is",
                " false, and its false-hood has been exposed",
                " in the Introduction to the Surah Al-`Ankabut",
                " and in its vv. 1011. Secondly, in",
                " our opinion it is not a correct",
                " way of writing commentary that in respect",
                " of a certain sentence occurring in a",
                " particular discourse which was revealed on a",
                " particular occasion, under particular circumstances, one should",
                " declare that it had been sent down",
                " on another occasion but has been inserted",
                " here without any relevance. The historical background",
                " of this part of Surah AlMuddaththir is",
                " fully well known to us from authentic",
                " traditions. This was revealed in connection with",
                " a particular event of the earliest period",
                " of the life at Makkah. The whole",
                " context bears full relevance to the event.",
                " What could, therefore, be the occasion in",
                " this context that this one sentence, if",
                " it was revealed many years later at",
                " Madinah, should have been inserted here? As",
                " for the question what is implied by",
                " the disease of the heart here, its",
                " answer is that it implies the disease",
                " of doubt. Not only in Makkah but",
                " in the entire world also there have",
                " been, and are, very few such people,",
                " who might deny God, Hereafter, Revelation, Prophethood,",
                " Heaven. Hell, etc. absolutely. In every age",
                " the greater majority by far has been",
                " of those people, who have been involved",
                " in the doubt whether there is God,",
                " or no God, Hereafter or no Hereafter,",
                " whether Heaven and Hell really exist, or",
                " are mere figments of the imagination, and",
                " whether the Messengers did really come and",
                " receive Revelation or not. This same doubt",
                " has led most people to unbelief, otherwise",
                " the number of such people in the",
                " world who denied these truths absolutely has",
                " never been great. For a person who",
                " has any common sense knows that there",
                " is no rational ground whatever for denying",
                " the possibility of the existence of these",
                " things, or of declaring them absolutely impossible.",
                "",
                "*23) This dces not mean that they",
                " accepted it as Divine word but wondered",
                " why Allah had said such a thing.",
                " But what they actually meant was: \"A",
                " discourse which contained such an irrational and",
                " impossible thing could not be a Revelation",
                " from Allah.\"",
                "*24) That is, AIlah in",
                " this very way sometimes sends down in",
                " the course of His Revelations and Commandments",
                " such things as become a means of",
                " test and trial for the people. It",
                " is one and the same thing which",
                " a truth-loving, good-natured and right-minded person hears",
                " and understanding its right meaning in the",
                " right way, adopts the straight path, but",
                " which when heard by an obstinate, perverse",
                " and wilful wrongdoer, makes him to misconstrue",
                " it and make it a new excuse",
                " for fleeing from the truth. Since the",
                " first man is himself a lover of",
                " the truth, Allah grants him guidance, for",
                " it is not the way of Allah",
                " to lead the seekers after truth forcibly",
                " astray; and since the second man himself",
                " does not want guidance, but chooses only",
                " error for himself, Allah also pushes him",
                " on to the way of error and",
                " deviation, for it is also not the",
                " way of Allah to forcibly pull to",
                " the way of the truth him who",
                " has an aversion to the truth. (The",
                " question of Allah's granting guidance and misguidance",
                " has been fully explained at many places",
                " for example, see E.N.'s 10. 16, 19,",
                " 20 of Al-Baqarah; E.N. 173 of An-Nisa',",
                " E.N.'s 17, 28, 90 of AlAn`am, E.N.",
                " 13 of Yunus, E.N. 54 of Al-Kahf,",
                " E..N. 71 of Al-Qasas)",
                "*25) That is,",
                " none knows but Allah what different kinds",
                " and how many of the creatures He",
                " has created in the universe, what powers",
                " He has granted them, and what services",
                " He is taking from them. If the",
                " man clinging to the tiny globe of",
                " the earth seeing the tiny world around",
                " himself with his limited sight, is involved",
                " in the misunderstanding that the universe of",
                " God contains nothing but what he can",
                " perceive by his senses or by his",
                " instruments, this would only be his own",
                " shortsightedness, other wise this universe is so",
                " vast and limitless that it is not",
                " in the power of man to obtain",
                " full knowledge about any of the things",
                " here, not to speak of comprehending mentally",
                " the concept of all its vastnesses.",
                "*26)",
                " \"The people may take heed\" the people",
                " may recover their senses and wake up",
                " before they make themselves worthy of Hell",
                " and suffer its punishment, and should think",
                " of saving themselves from it."
            ]
        },
        {
            "verse-id": "[74:32]",
            "verse": "No! By the moon",
            "description": [
                "That is, it is not a hollow",
                " thing which may be mocked like that.",
                ""
            ]
        },
        {
            "verse-id": "[74:33]",
            "verse": "And [by] the night when it departs",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:34]",
            "verse": "And [by] the morning when it brightens,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:35]",
            "verse": "Indeed, the Fire is of the greatest [afflictions]",
            "description": [
                "That is, \"Just as the moon and",
                " the night and the day are the",
                " great signs of the powers of Allah,",
                " so also is Hell a great sign",
                " of His powers. If the existence of",
                " the moon and the alternation of the",
                " night and day so regularly were not",
                " impossible, why should the existence of Hell",
                " be impossible as you think it is?",
                " You see these phenomena day and night;",
                " therefore, they do not surprise you: otherwise",
                " these things in themselves also are great",
                " marvels of the powers of Allah. If",
                " you had not observed them and somebody",
                " were to tell you that there is",
                " also such a thing as the moon",
                " in the world, or, there is a",
                " sun which leaves the world dark when",
                " it hides and makes the world shine",
                " forth with light when it appears, then",
                " the people like you would have made",
                " jests of it too as you make",
                " jests of Hell.\""
            ]
        },
        {
            "verse-id": "[74:36]",
            "verse": "As a warning to humanity -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:37]",
            "verse": "To whoever wills among you to proceed or stay behind.",
            "description": [
                "That is, the people have been warned",
                " to this effect. Now, let him who",
                " heeds the warning go forward on the",
                " right way, and let him who wills",
                " still lag behind."
            ]
        },
        {
            "verse-id": "[74:38]",
            "verse": "Every soul, for what it has earned, will be retained",
            "description": [
                "For explanation, see E.N. 16 of Surah",
                " At-Tur."
            ]
        },
        {
            "verse-id": "[74:39]",
            "verse": "Except the companions of the right,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:40]",
            "verse": "[Who will be] in gardens, questioning each other",
            "description": [
                "In other words, the people of the",
                " left hand will be seized in consequence",
                " of their misdeeds, but the people of",
                " the right hand will have their debts",
                " settled. (For explanation of the people of",
                " the right hand and the left hand,",
                " see E.N.'s 5, 6 of Surah Al-Waqi`ah).",
                ""
            ]
        },
        {
            "verse-id": "[74:41]",
            "verse": "About the criminals,",
            "description": [
                "At several places in the Qur'an above,",
                " it has been stated that the dwellers",
                " of Paradise and the dwellers of Hell",
                " will be able to see and commune",
                " with each other directly without the agency",
                " of any instrument whenever they will so",
                " desire, although they will be living hundreds",
                " of thousands of miles away from each",
                " other. For instance, see Al-A`raf: 44-50 and",
                " E.N. 35, As-Saaffat: 50-57 and E.N. 32",
                " on it."
            ]
        },
        {
            "verse-id": "[74:42]",
            "verse": "[And asking them], \"What put you into Saqar?\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:43]",
            "verse": "They will say, \"We were not of those who prayed,",
            "description": [
                "That is, \"We were not of those",
                " who after having believed in Allah and",
                " His Messenger and His Boo , performed",
                " the foremost duty imposed by Allah, i.e.",
                " the Prayer. \" Here, it should be",
                " understood well that unless a person has",
                " believed he cannot offer the Prayer at",
                " all. Therefore, one's being of those who",
                " performed the Prayer, by itself implies that",
                " one is a believer. But by attributing",
                " one's going to Hell to one's not",
                " being of those who performed their Prayer,",
                " it has been made explicit that one",
                " cannot escape Hell even after having believed",
                " if one dces not perform one's Prayers",
                " regularly."
            ]
        },
        {
            "verse-id": "[74:44]",
            "verse": "Nor did we used to feed the poor.",
            "description": [
                "This shows how grave a sin it",
                " is in Islam to see a hungry",
                " man and fail to feed him even",
                " if one can, for this has been",
                " particularly mentioned as one of the causes",
                " of one's going to Hell."
            ]
        },
        {
            "verse-id": "[74:45]",
            "verse": "And we used to enter into vain discourse with those who engaged [in it],",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:46]",
            "verse": "And we used to deny the Day of Recompense",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:47]",
            "verse": "Until there came to us the certainty.\"",
            "description": [
                "\"Till the inevitable overtoo us\" : till",
                " death came upon us. Here, \"the inevitable\"",
                " implies death as well as the Hereafter.",
                ""
            ]
        },
        {
            "verse-id": "[74:48]",
            "verse": "So there will not benefit them the intercession of [any] intercessors.",
            "description": [
                "That is, \"Even if an intercessor interceded",
                " for a person who persisted in this",
                " way of life till death, he would",
                " not be forgiven.\" The question of intercession",
                " has been so fully explained at so",
                " many places in the Qur'an that no",
                " one can have any difficulty in nowing",
                " and understanding as to who can intercede",
                " and who cannot, when one can intercede",
                " and when one cannot, for whom one",
                " can intercede and for whom one cannot,",
                " and for whom intercession is beneficial and",
                " for whom it is not. As one",
                " of the major causes of the people's",
                " deviation in the world, is their false",
                " concept about intercession, it has been explained",
                " at such length in the Qur'an as",
                " to leave no room for any doubt",
                " and ambiguity. For example, see Al-Baqarah; 255,",
                " Al-An`am: 94, Al-A`raf: 53. Yunus: 3-18, Maryam:",
                " 87, Ta Ha: 109, Al-Anbiya': 28, Saba:",
                " 23, Az-Zumar: 43-44, Al-Mu'min: 18, Ad-Dukhan: 86,",
                " An-Najm: 26, An-Naba: 37-38."
            ]
        },
        {
            "verse-id": "[74:49]",
            "verse": "Then what is [the matter] with them that they are, from the reminder, turning away",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:50]",
            "verse": "As if they were alarmed donkeys",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:51]",
            "verse": "Fleeing from a lion?",
            "description": [
                "This is an idiomatic expression in Arabic",
                " which depicts the character of wild asses",
                " who flee stupefied and stunned as soon",
                " as they smell a lion or hear",
                " a hunter."
            ]
        },
        {
            "verse-id": "[74:52]",
            "verse": "Rather, every person among them desires that he would be given scriptures spread about.",
            "description": [
                "That is, they desire that if Allah",
                " really has appointed Muhammad (upon whom be",
                " Allah's peace and blessings) as His Prophet,",
                " He should send a letter to each",
                " one of the chiefs and elders of",
                " Makkah telling him that Muhammad is Allah's",
                " Prophet; therefore he should obey and follow",
                " him. And these letters should be such",
                " as may convince them that they have",
                " been written by Allah Himself. At another",
                " place in the Qur'an, this saying of",
                " the disbelievers of Makkah has been cited:",
                " \"We will not believe in it unless",
                " we are given the like of what",
                " has been given to the Messengers of",
                " Allah.\" (Al-An`am: 124). At still another place",
                " their this demand has been cited: \"Or",
                " you ascend the sky ... and bring",
                " down to us a writing that we",
                " may read.\" (Bani lsra'il: 93)."
            ]
        },
        {
            "verse-id": "[74:53]",
            "verse": "No! But they do not fear the Hereafter.",
            "description": [
                "That is, the real cause of their",
                " failure to affirm the faith is not",
                " that their demands are not fulfilled, but",
                " the real cause is that they are",
                " fearless of the Hereafter. They think that",
                " this world is an end in itself",
                " and they do not have any idea",
                " that there is another life after this",
                " worldly life in which they will have",
                " to render an account of their deeds.",
                " This very thing has made them careless",
                " and irresponsible in the world. They regard",
                " the question of truth and falsehood as",
                " utterly meaningless, for they do not see",
                " any truth following which may have necessarily",
                " led to a good result in the",
                " world, nor do they see any falsehood",
                " which might have always led to an",
                " evil result in the world. Therefore, they",
                " think it is useless merely to consider",
                " as to what is really true and",
                " what is false. This question can be",
                " worthy of serious consideration only for the",
                " person who regards the present life of",
                " the world as transitory and admits that",
                " the real and everlasting life is the",
                " life hereafter, where the truth will necessarily",
                " lead to a good result and falsehood",
                " necessarily to an evil result. Such a",
                " person will certainly believe when he sees",
                " the rational arguments and the pure teachings",
                " presented in the Qur'an and will use",
                " his common sense to understand what is",
                " actually wrong with the beliefs and deeds",
                " which the Qur'an calls wrong. But the",
                " denier of the Hereafter who is not",
                " at all serious in his search for",
                " the truth, will present ever new demands",
                " every day for not believing, and will",
                " present a new excuse for his denial",
                " even if all his demands are fulfilled.",
                " This same thing has been expressed in",
                " Surah AI-An`am: 7 thus: \"O Prophet, even",
                " if We had sent down to you",
                " a Book written in paper, and even",
                " if they had touched it with their",
                " own hands. the disbelievers would have said:",
                " `This is nothing but manifest sorcery. \"",
                ""
            ]
        },
        {
            "verse-id": "[74:54]",
            "verse": "No! Indeed, the Qur'an is a reminder",
            "description": [
                "That is, no such demand of theirs",
                " will ever be fulfilled."
            ]
        },
        {
            "verse-id": "[74:55]",
            "verse": "Then whoever wills will remember it.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[74:56]",
            "verse": "And they will not remember except that Allah wills. He is worthy of fear and adequate for [granting] forgiveness.",
            "description": [
                "That is, a person's taking heed dces",
                " not wholly depend upon his own will,",
                " but he takes heed only when Allah",
                " also wills to grant him the grace",
                " to take heed. In other words, the",
                " truth that has been expressed here is",
                " that no act of man takes a",
                " concrete shape solely by his own will,",
                " but each act is implemented only when",
                " the will of God combines with the",
                " will of the man. This is a",
                " very delicate question, failure to understand which",
                " has often made human thought falter. Briefly",
                " it can be understood thus: If in",
                " this world every man had the power",
                " to accomplish whatever he wanted to accomplish,",
                " the system of the world would be",
                " disturbed. This system continua to hold only",
                " because the will of Allah is .dominant",
                " over all other wills. Man can accomplish",
                " whatever he wants to accomplish only when",
                " Allah also wills that he be allowed",
                " to accomplish it. The same is also",
                " the case with guidance and error. Only",
                " man's own desiring to have guidance is",
                " not enough for him to have guidance;",
                " he receives guidance only when Allah also",
                " takes a decision to fulfil his desire.",
                " Likewise, only man's desiring to go astray",
                " by itself is also not enough, but",
                " when Allah in view of his desire",
                " decides that he be allowed to wander",
                " into evil ways, then he wanders into",
                " the evil ways in which Allah allows",
                " him to wander. As for example, if",
                " a person wants to become a thief,",
                " only his desire is not enough that",
                " he may enter into any house he",
                " likes and matte away with whatever he",
                " likes, but he can fulfil his desire",
                " only at the time and to the",
                " extent and in the form that AIlah",
                " allows him to fulfil it, according to",
                " His supreme wisdom and expedience.",
                "*42) That",
                " is, \"The admonition being given to you",
                " to avoid Allah's displeasure is not for",
                " the reason that Allah needs it, and",
                " if you did not take it, AIlah",
                " would be harmed, but you are being",
                " so admonished because it is Allah's right",
                " that His servants should seek His pleasure",
                " and good will and should avoid doing",
                " anything against His will.\"",
                "*43) That is,",
                " \"It behoves only Allah that He should",
                " receive into His mercy whoever desists from",
                " evil no matter how many acts of",
                " disobedience he might have committed in the",
                " past. Allah is not vengeful to His",
                " servants so that He may refuse to",
                " forgive their errors and be bent upon",
                " punishing them in any case.\""
            ]
        }
    ]
}