{
    "name": "An-Naziat",
    "id": 79,
    "verse-count": 46,
    "verse-info": [
        {
            "verse-id": "[79:1]",
            "verse": "By those [angels] who extract with violence",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:2]",
            "verse": "And [by] those who remove with ease",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:3]",
            "verse": "And [by] those who glide [as if] swimming",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:4]",
            "verse": "And those who race each other in a race",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:5]",
            "verse": "And those who arrange [each] matter,",
            "description": [
                "Here, the object for which an oath",
                " has been sworn by beings having five",
                " qualities has not been mentioned; but the",
                " theme that follows by itself leads to",
                " the conclusion that the oath has been",
                " sworn to affirm that the Resurrection is",
                " a certainty, which must come to pass,",
                " when all dead men shall be resurrected.",
                " Nor is there any mention as to",
                " what are the beings possessed of the",
                " qualities. However, a large number of the",
                " Companions and their immediate successors and most",
                " of the commentators have expressed the opinion",
                " that they are the angels. Hadrat `Abdullah",
                " bin Mas`ud, Hadrat `Abdullah bin `Abbas, Masruq,",
                " Sa`id bin Jubair, Abu salih Abud-Duha and",
                " Suddi; say that \"those who pluck out",
                " from the depths and those who draw",
                " out gently\" imply the angels, who wrench",
                " out the soul of man at death",
                " from the very depths of his body,",
                " from its every fibre. \"Those who glide",
                " about swiftly\", according to Hadrat Ibn Mas`ud,",
                " Mujahid, Sa`id bin Jubair and Abu Salih,",
                " also imply the angels, who hurry about",
                " swiftly in execution of Divine Commands as",
                " though they were gliding through space. The",
                " same meaning of \"those who hasten out",
                " as in a race\" has been taken",
                " by Hadrat `Ali, Mujahid, Masruq, Abu Salih",
                " and Hasan Bari, and hastening out implies",
                " that each one of them hurries on",
                " his errand as soon as he receives",
                " the first indication of Divine Will. \"Those",
                " who conduct the affairs\" also imply the",
                " angels as has been reported from Hadrat",
                " `Ali, Mujahid, 'Ata' Abu -Salih, Hasan Bari;,",
                " Qatadah, Rabi` bin Anas and Suddi. In",
                " other words, these are the workers of",
                " the Kingdom of the Universe, who are",
                " conducting all the affairs of the world",
                " in accordance with Allah's Command and Will.",
                " Though this meaning of these verses has",
                " not been reported in any authentic Hadith",
                " from the Holy Prophet, while this meaning",
                " has been given by some major Companions",
                " and their immediate successors and pupils, one",
                " is led to form the view that",
                " they must have obtained this knowledge from",
                " the Holy Prophet himself.",
                "Now the question",
                " arises: On what basis has the oath",
                " been sworn by these angels for the",
                " occurrence of the Resurrection and life after",
                " death when they themselves are as imperceptible",
                " as the thing for the occurrence of",
                " which they have been presented as an",
                " evidence and as an argument. In our",
                " opinion the reason is (and Allah has",
                " the best knowledge) that the Arabs were",
                " not deniers of the existence of the",
                " angels. They themselves admitted that at the",
                " death the soul was taken out by",
                " the angels; they also believed that the",
                " angels moved at tremendous speeds; they could",
                " reach any place between the earth and",
                " the heavens instantly and promptly execute any",
                " errand that was entrusted to them. They",
                " also acknowledged that the angels are subordinate",
                " to Divine Will and they conduct the",
                " affairs of the universe strictly and precisely",
                " in accordance with Divine Will; they are",
                " not independent and masters of their will.",
                " They regarded them as daughters of Allah",
                " out of ignorance and worshipped them as",
                " deities, but they did not believe that",
                " they possessed the real authority as well.",
                " Therefore, the basis of the reasoning from",
                " the abovementioned attributes for the occurrence of",
                " the Resurrection and life after death is",
                " that the angels who took the soul",
                " by the order of God, could also",
                " restore the soul by the order of",
                " the same God; and the angels who",
                " conducted the affairs of the universe by",
                " the order of God could also upset",
                " this universe by the order of the",
                " same God whenever . He so ordered",
                " them and could also bring about a",
                " new world order. They would not show",
                " any negligence or delay in the execution",
                " of His Command."
            ]
        },
        {
            "verse-id": "[79:6]",
            "verse": "On the Day the blast [of the Horn] will convulse [creation],",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:7]",
            "verse": "There will follow it the subsequent [one].",
            "description": [
                "The first jolt implies the jolt which",
                " will destroy the earth and everything on",
                " it, and the second jolt at which",
                " all dead men will rise up from",
                " death and from their graves. This same",
                " state has been described in Surah Az-Zumar,",
                " thus: \"And when the Trumpet shall be",
                " blown on that Day, all those who",
                " are in the heavens and the earth",
                " shall fall down dead except those whom",
                " Allah may allow (to live). Then the",
                " Trumpet shall be blown again and they",
                " will all stand up, looking around.\" (v.",
                " 68)"
            ]
        },
        {
            "verse-id": "[79:8]",
            "verse": "Hearts, that Day, will tremble,",
            "description": [
                "\"Some hearts\", because, according to the Qur'an,",
                " only the disbelievers, the wicked people and",
                " the hypocrites will be terror-stricken on the",
                " Resurrection Day, the righteous believers will remain",
                " secure from this tenor. About them in",
                " Surah Al-Anbiya' it has been said: \"The",
                " time of great fright will not trouble",
                " them at all; the angels will rush.",
                " forth to receive them, saying: `This is",
                " the very Day which you were promised'.\"",
                " (v. 103)"
            ]
        },
        {
            "verse-id": "[79:9]",
            "verse": "Their eyes humbled.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:10]",
            "verse": "They are [presently] saying, \"Will we indeed be returned to [our] former state [of life]?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:11]",
            "verse": "Even if we should be decayed bones?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:12]",
            "verse": "They say, \"That, then, would be a losing return.\"",
            "description": [
                "That is, when they were told that",
                " they would surely be raised back to",
                " life after death, they started mocking it,",
                " saying to one another, \"Well, if we",
                " have really to be restored to our",
                " former state of life, then we would",
                " certainly be doomed. \""
            ]
        },
        {
            "verse-id": "[79:13]",
            "verse": "Indeed, it will be but one shout,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:14]",
            "verse": "And suddenly they will be [alert] upon the earth's surface.",
            "description": [
                "That is, \"They are mocking it as",
                " an impossibility, whereas it is not at",
                " all a difficult task for Allah for",
                " the performance of which He may have",
                " to make lengthy preparations. For it only",
                " a single shout or cry is enough",
                " at which your dust of ash will",
                " gather together from wherever it lay, and",
                " you will suddenly find yourself alive on",
                " the back of the earth. Thinking this",
                " return to be a return to loss,",
                " you may try to escape from it",
                " however hard you may, but it will",
                " inevitably take place; it cannot be averted",
                " by your denial, escape or mockery.\""
            ]
        },
        {
            "verse-id": "[79:15]",
            "verse": "Has there reached you the story of Moses? -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:16]",
            "verse": "When his Lord called to him in the sacred valley of Tuwa,",
            "description": [
                "As the denial of the Resurrection and",
                " Hereafter by the disbelievers of Makkah and",
                " their mockery of it was not, in",
                " fact, rejection of a philosophy but belying",
                " Allah's Messengers, and the tricks that they",
                " were employing against the Holy Prophet (upon",
                " whom be Allah's peace) were not against",
                " an ordinary man but were meant to",
                " frustrate the mission of Allah's Messenger, the",
                " story of the Prophet Moses and the",
                " Pharaoh is being related before giving additional",
                " arguments for the occurrence of the Hereafter",
                " so that they are warned of the",
                " consequences of fighting with the Messenger and",
                " resisting the God Who sent him."
            ]
        },
        {
            "verse-id": "[79:17]",
            "verse": "\"Go to Pharaoh. Indeed, he has transgressed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:18]",
            "verse": "And say to him, 'Would you [be willing to] purify yourself",
            "description": [
                "According to general opinion among the commentators",
                " \"the sacred . valley of 'Tuwa\" means",
                " \"the sacred valley which was named Tuwa\".",
                " But, besides this, two other meanings of",
                " it also have been given: (1) \"The",
                " valley that was blessed and made sacred",
                " twice\" . for it was first made",
                " sacred when Allah spoke to Moses in",
                " it for the first time, and it",
                " was blessed and made sacred for the",
                " second time when the Prophet Moses led",
                " the children of Israel out of Egypt",
                " and brought them into it; and (2)",
                " \"called out to him in the sacred",
                " valley in the night,\" and this is",
                " according to the meaning of tuwa in",
                " the Arabic idiom."
            ]
        },
        {
            "verse-id": "[79:19]",
            "verse": "And let me guide you to your Lord so you would fear [Him]?'\"",
            "description": [
                "Here, one should understand a few things",
                " well:",
                "(1) The dialogue that took place",
                " between the Prophet Moses and Allah Almighty",
                " at the time of appointing him to",
                " the office of Prophethood has been related",
                " at some places briefly and at others",
                " in full detail in the Qur'an as",
                " the occasion demanded. Here; brevity was the",
                " need; therefore, only a resume has been",
                " given. Fuller details are found in Ta",
                " Ha: 9-48, Ash-Shua`ra': 10-17, An=Naml: 7-12, AI-Qasas:",
                " 29-35.",
                "(2) The rebellion of the Pharaoh",
                " referred to here relates to his transgressing",
                " the bounds of service and rebelling both",
                " against the Creator and against His creatures.",
                " As for his rebellion against the Creator,",
                " it is being mentioned a little below",
                " when he gathered his people together and",
                " prolaimed: \"I am your lord, the supreme.\"",
                " As against the creatures his rebellion was",
                " that he had divided his subjects into",
                " classes; he treated the weak classes tyrannically",
                " and had reduced his entire nation to",
                " slavery as has been mentioned in Al-Qasas:",
                " 4 and Az-Zukhruf: 54.",
                "(3) The instruction",
                " given to Moses was: \"Go, you and",
                " your brother Aaron, to Pharaoh for he",
                " has transgressed all bounds. Talk to him",
                " gently; maybe that he is convinced by",
                " admonition or is imbued with fear.\" (Ta",
                " Ha: 44). One model of the gentle",
                " speech has been given in these verses,",
                " which shows what right method a preacher",
                " should adopt when preaching to a perverted",
                " man. Other models are given in Ta",
                " Ha: 49-52, Ash-Shua`ra': 23-28, and Al-Qasas: 37.",
                " These verses are of those in which",
                " Allah has taught the correct methods of",
                " preaching Islam in the Qur'an.",
                "(4) The",
                " Prophet Moses had not been sent to",
                " Pharaoh only for the deliverance of the",
                " children of Israel as some people seem",
                " to think but the primary object of",
                " his appointment was to show Pharaoh and",
                " his people the right way, and the",
                " second object was that if he did",
                " not accept the right way, the children",
                " of Israel (who in fact were a",
                " Muslim people) should be taken out of",
                " his slavery and from Egypt. This thing",
                " becomes plain from these verses too, for",
                " there is no mention whatever in these",
                " of the deliverance of the children of",
                " Israel, but the Prophet Moses has been",
                " commanded to present the message of the",
                " Truth before Pharaoh, and this is confirmed",
                " by those verses also in which the",
                " Prophet Moses has preached Islam as well",
                " as demanded freedom of the children of",
                " Israel, e.g. see Al-A`raf 104-105, Ta Ha:",
                " 47-52, Ash-Shua ara': 16-17, 23-28. (For further",
                " explanation, see E.N. 74 of Yunus).",
                "(5)",
                " Here, \"to adopt purity\" means to adopt",
                " purity of belief, morals and deeds, or,",
                " in other words, to accept Islam. Ibn",
                " Zaid says: \"Wherever in the Qur'an the",
                " word tazakka (purity) has been use, it",
                " implies acceptance of Islam.\" As an example",
                " of this he has cited the following",
                " three verses: \"And this is the reward",
                " of him who adopts purity\", i.e. accepts",
                " Islam; \"and what would make you know",
                " that he might adopt purity\", i.e. becomes",
                " a Muslim (`Abasa:3); \"And you would not",
                " be responsible if he did not adapt",
                " purity\", i.e. did not become a Muslim",
                " (`Abasa: 7). (Ibn Jarir).",
                "(6) \"That I",
                " may guide you to your Lord so",
                " that you may have fear (of Him)\"",
                " means: \"When you recognize your Lord and",
                " come to know that you are His",
                " slave, and not a free man, you",
                " will inevitably have fear of Him in",
                " your heart, for fear of God is",
                " the thing on which depends the right",
                " attitude of man in the world. Without",
                " the knowledge and fear of God no",
                " purity of the self can be possible.\"",
                ""
            ]
        },
        {
            "verse-id": "[79:20]",
            "verse": "And he showed him the greatest sign,",
            "description": [
                "\"The great Sign\" : the turning of",
                " the staff into a serpent, as has",
                " been mentioned at several places in the",
                " Qur'an. Obviously there could be no greater",
                " sign than that a lifeless staff should",
                " turn into a living serpent right in",
                " front of the eyes of the people,",
                " that it should devour the artificial serpents",
                " produced by the magicians out of their",
                " staffs and cords, and vKhen the Prophet",
                " Moses should pick it up, it should",
                " become a walking stick again. This was",
                " proof that it was Allah, Lord of",
                " the worlds, Who had sent Moses as",
                " a Prophet."
            ]
        },
        {
            "verse-id": "[79:21]",
            "verse": "But Pharaoh denied and disobeyed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:22]",
            "verse": "Then he turned his back, striving.",
            "description": [
                "According to the details given at other",
                " places in the Qur'an, he summoned skilful",
                " magicians from all over Egypt and made",
                " them produce serpents out of sticks and",
                " cords in front of the assembled people",
                " so that they were convinced that Moses",
                " (peace be upon him was not a",
                " Prophet but a magician, and that the",
                " miracle worked by him of turning a",
                " staff into a serpent, could also be",
                " worked by other magicians. But this device",
                " of his recoiled upon himself and the",
                " defeated magicians themselves admitted that what Moses",
                " (peace be on him) had displayed was",
                " no magic but a miracle."
            ]
        },
        {
            "verse-id": "[79:23]",
            "verse": "And he gathered [his people] and called out",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:24]",
            "verse": "And said, \"I am your most exalted lord.\"",
            "description": [
                "This proclamation of Pharaoh has been mentioned",
                " at several places in the Qur'an. On",
                " one occasion he said to the Prophet",
                " Moses: \"lf you took another one as",
                " a deity beside me, I would cast",
                " you in the prison.\" (Ash-Shua`ra': 29). On",
                " another occasion he had addressed his courtiers,",
                " saying: \"O chiefs, I do not know",
                " of any other god of yours than",
                " myself. (Al-Qasas.: 38). By this Pharaoh did",
                " not mean, nor could he ever mean,",
                " that he himself was the creator of",
                " the universe and he had made the",
                " world, nor that he denied the existence",
                " of Allah and claimed to be lord",
                " of the universe, nor that he regarded",
                " only himself as a deity of the",
                " people in the religious sense. In the",
                " Qur'an itself there is a clear testimony",
                " that as regards religion he himself worshipped",
                " other gods. Once his courtiers said to",
                " him: \"Will you leave Moses and his",
                " people free to spread chaos in the",
                " land, and let them discard you and",
                " your deities?\" (Al A`raf: 127). And in",
                " the Qur'an itself this saying of the",
                " Pharaoh also has been cited: \"Had Moses",
                " been sent by Allah, why were not",
                " bracelets of gold sent down to him,",
                " or a company of angels as attendants?\"",
                " (AzZukhruf: 53). Thus, in fact, he called",
                " himself a god and supreme deity not",
                " in the religious but in the political",
                " sense. What he meant was that he",
                " possessed the sovereign rights: no one beside",
                " him had the right to rule in",
                " his kingdom and there was no superior",
                " power whose orders could be enforced in",
                " the land. (For further explanation. see E.N.",
                " 85 of Al-A`raf, E.N. 21 of Ta",
                " Ha, E.N.'s 24, 26 of AshShua'ra', E-N.'s",
                " 52, 53 of Al-Qasas E.N. 49 of",
                " Az-Zukhruf)."
            ]
        },
        {
            "verse-id": "[79:25]",
            "verse": "So Allah seized him in exemplary punishment for the last and the first [transgression].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:26]",
            "verse": "Indeed in that is a warning for whoever would fear [Allah].",
            "description": [
                "\"...who fears\": who fears the consequences of",
                " denying God's Messenger, which the Pharaoh experienced",
                " in the past."
            ]
        },
        {
            "verse-id": "[79:27]",
            "verse": "Are you a more difficult creation or is the heaven? Allah constructed it.",
            "description": [
                "Now arguments are being given for the",
                " possibility of Resurrection and life after death",
                " and their being the very demand and",
                " requirement of wisdom.",
                "*14) Here, creation implies",
                " the recreation of men, and the heaven",
                " the entire firmament which contains countless stars",
                " and planets, and innumerable solar systems and",
                " galaxies. means to say: \"You think that",
                " your resurrection after death is something extremely",
                " improbable and you express wonder saying: `How",
                " is it possible that when our very",
                " bones will have decayed and become rotten",
                " the scattered particles of our bodies will",
                " be reassembled and made living once again?'",
                " But have you ever also considered whether",
                " the great universe is harder to create",
                " or your own re-creation in the form",
                " in which you were created in the",
                " first instance? The God Who created you",
                " in the first instance cannot be powerless",
                " to create you once again.\" This same",
                " argument for life after death has been",
                " given at several places in the Qur'an.",
                " For example, in Surah Ya Sin it",
                " has been said: \"Is not He Who",
                " created the heavens and the earth able",
                " to create the like of them (again)?",
                " Why not, when He is the skilful",
                " Creator.\" (v. 81) And in Surah Al-Mu'min",
                " it was said: \"Surely the creation of",
                " the heavens and the earth is a",
                " greater task than the creation of man,",
                " but most people do not know. (v.",
                " S7)"
            ]
        },
        {
            "verse-id": "[79:28]",
            "verse": "He raised its ceiling and proportioned it.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:29]",
            "verse": "And He darkened its night and extracted its brightness.",
            "description": [
                "The night and the day have been",
                " attributed to the heaven, for the night",
                " falls when the sun of the heavens",
                " sets and the day dawns when it",
                " rises. The word \"cover\" has been used",
                " for the night in the sense that",
                " after the sun has set the darkness",
                " of the night so spreads over the",
                " earth as though it has covered it",
                " from above by a curtain."
            ]
        },
        {
            "verse-id": "[79:30]",
            "verse": "And after that He spread the earth.",
            "description": [
                "\"After that He spread out the earth\"",
                " does not mean that Allah created the",
                " earth after the creation of the heavens,",
                " but it is a style of expression",
                " just like our saying after making mention",
                " of something: \"Then this is noteworthy.\" The",
                " object is not to express the sequence",
                " of occurrence between the two things but",
                " to draw attention from the first to",
                " the second thing although both may exist",
                " together. Several instances of this style are",
                " found in the Qur'an, e.g. in Surah",
                " Al-Qalam it is said: \"(He is) oppressive,",
                " and after that, ignoble by birth.\" This",
                " dces not mean that first he became",
                " oppressive and then he turned ignoble by",
                " birth, but it means: \"He is oppressive,",
                " and above alI, ignoble by birth.\" Likewise,",
                " in Surah Al-Balad it is said: \"Should",
                " free a slave...then be of those who",
                " believe.\" This also dces not mean that",
                " first he should act righteously and then",
                " believe. but that along with doing righteous",
                " deeds he should also be characterised by",
                " belief. Here, one should also understand that",
                " at some places in the Qur'an the",
                " creation of the earth has been mentioned",
                " first and then the creation of the",
                " heavens, as in Al-Baqarah: 29, and at",
                " others the creation of the heavens has",
                " been mentioned first and then of the",
                " earth, as in these verses. There is,",
                " in fact, no contradiction in this. At",
                " no place the object is to tell",
                " what was created first and what afterwards,",
                " but wherever the context requires that the",
                " excellences of the power of AIlah be",
                " made prominent, the heavens have been mentioned",
                " first and then the earth, and where",
                " the context requires that the people be",
                " made to appreciate and acknowledge the blessings",
                " that they are benefiting by on the",
                " earth, the mention of the earth has",
                " been made before that of the heavens.",
                " (For further explanation, see E.N's 13,14 of",
                " Ha Mim As-Sajdah)."
            ]
        },
        {
            "verse-id": "[79:31]",
            "verse": "He extracted from it its water and its pasture,",
            "description": [
                "\"Pasture\" here dces not only imply pasture",
                " and fodder for the animals but all",
                " kinds of herbal produce suitable for consumption",
                " both by man and by animal. An",
                " example of the use of rat'. which",
                " is generally used in Arabic for the",
                " grazing animals, is found in Surah Yusuf:",
                " 12, signifying that this word is sometimes",
                " used for man also. The brothers of",
                " Joseph said to their father: \"Send Joseph",
                " with us tomorrow that he may frcely",
                " graze and enjoy sport. \" Here, the",
                " word grace (rat`) for the child has",
                " been used in the meaning that he",
                " thay move about freely in the jungle",
                " and pluck and eat fruit."
            ]
        },
        {
            "verse-id": "[79:32]",
            "verse": "And the mountains He set firmly",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:33]",
            "verse": "As provision for you and your grazing livestock.",
            "description": [
                "In these verses arguments have been given",
                " for the Resurrection and life after death",
                " from two aspects: first, that it is",
                " not at all difficult to establish these",
                " for the power of that God Who",
                " has made this vast and huge universe",
                " with such wonderful balance and this earth",
                " with such provisions. Second, that the pointers",
                " to the perfect wisdom of Allah which",
                " are clearly visible in the universe and",
                " the earth, point out that nothing is",
                " happening here purposelessly. The balance that exists",
                " between countless of the stars and planets",
                " and galaxies in the heavens testifies that",
                " all this has not happened haphazardly but",
                " there is a well thought-out plan working",
                " behind it. The regular alternation of the",
                " night and day is an evidence that",
                " this system has been established with supreme",
                " wisdom and knowledge for making the earth",
                " a home and place of settlement. On",
                " this very earth are found regions where",
                " the alternation of the night and day",
                " takes place within 24 hours and also",
                " those regions where there are longer days",
                " and longer nights. A very large part",
                " of the earth's population lives in the",
                " first kind of the regions. Then as",
                " the days and nights go on becoming",
                " longer and longer, life goes on becoming",
                " harder and harder and population thinner and",
                " thinner. So much so that the regions",
                " where there are six-month-long days and six-month-long",
                " nights, are not at all fit for",
                " human settlement. Arranging both these types of",
                " the land on this very earth Allah",
                " has provided the evidence that this regular",
                " order of the alternation of night and",
                " day has not come about accidentally but",
                " has been brought about with great wisdom",
                " precisely in accordance with a scheme to",
                " make the earth a place fit for",
                " human settlement. Likewise, spreading out the earth",
                " so that it becomes a fit place",
                " to live in, providing in it that",
                " water which should be palatable for man",
                " and animal and a cause of growth",
                " for vegetation, setting in it mountains and",
                " creating all those things which may become",
                " a means of life for both man",
                " and animal- all these are a manifest",
                " sign that they are not chance happenings",
                " of the purposeless works of a care-free",
                " person but each one of these has",
                " been arranged purposefully by a Supreme, Wise",
                " Being. Now every sensible and intelligent man",
                " can consider for himself whether the necessity",
                " and occurrence of the Hereafter is the",
                " requirement of wisdom or its negation. The",
                " person who in spite of seeing all",
                " this says that there is no Hereafter,",
                " in fact, says that everything in the",
                " universe is happening wisely and purposefully, but",
                " only the creation of man on the",
                " earth as a being endowed with sense",
                " and power is meaningless and foolish. For",
                " there could be nothing more purposeless than",
                " delegating to man vast powers of appropriation",
                " in the earth and providing him an",
                " opportunity to do good as well as",
                " evil deeds but then failing to ever",
                " subject him to accountability."
            ]
        },
        {
            "verse-id": "[79:34]",
            "verse": "But when there comes the greatest Overwhelming Calamity -",
            "description": [
                "This implies the Resurrection for which the",
                " words at-Taammat alkubra have been used. Taammah",
                " by itself is a grievous calamity which",
                " afflicts everybody. Then it has been further",
                " qualified by the word kubra (great), which",
                " shows that the mere word taammah is",
                " not enough to describe fully its intensity",
                " and severity."
            ]
        },
        {
            "verse-id": "[79:35]",
            "verse": "The Day when man will remember that for which he strove,",
            "description": [
                "That is, \"When man will see that",
                " the same Day of accountability of which",
                " he was being foretold in the world,",
                " has come, he will start remembering each",
                " one of his misdeeds done in the",
                " world even before his records are handed",
                " over to him. Some people experience this",
                " even in the world. if at some",
                " time they come across a dangerous situation",
                " suddenly when death seems to be staring",
                " them in the face, their whole life-film",
                " flashes across their mind's eye all at",
                " once."
            ]
        },
        {
            "verse-id": "[79:36]",
            "verse": "And Hellfire will be exposed for [all] those who see -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:37]",
            "verse": "So as for he who transgressed",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:38]",
            "verse": "And preferred the life of the world,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:39]",
            "verse": "Then indeed, Hellfire will be [his] refuge.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:40]",
            "verse": "But as for he who feared the position of his Lord and prevented the soul from [unlawful] inclination,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:41]",
            "verse": "Then indeed, Paradise will be [his] refuge.",
            "description": [
                "Here, in a few words, it has",
                " been told briefly what shall be the",
                " criterion of the final judgement in the",
                " Hereafter. One kind of the conduct of",
                " life in the world is that transgressing",
                " all bounds of service man should rebel",
                " against his God and should make up",
                " his mind that he would seek only",
                " the benefits and pleasures of this world",
                " in whatever way they could be sought",
                " and achieved. The other kind of conduct",
                " is that while man passes life in",
                " the world he should constantly keep in",
                " view the truth that ultimately one day",
                " he has to stand before his Lord,",
                " and should refrain from fulfilling the evil",
                " desires of the self only for the",
                " fear that if he earned an unlawful",
                " benefit in obedience to his self, or",
                " enjoyed an evil pleasure, what answer he",
                " would give to his Lord. The criterion",
                " of the judgement in the Hereafter will",
                " be which of the two kinds of",
                " conduct he adopted in the world. If",
                " he had adopted the first kind of",
                " conduct, his permanent abode would be Hell,",
                " and if he had adopted the second",
                " kind of conduct, his permanent home would",
                " be Paradise."
            ]
        },
        {
            "verse-id": "[79:42]",
            "verse": "They ask you, [O Muhammad], about the Hour: when is its arrival?",
            "description": [
                "The disbelievers of Makkah asked this question",
                " of the Holy Prophet over and over",
                " again. By this they did not mean",
                " to know the time and date of",
                " the coming of Resurrection but to mock",
                " it. (For further explanation, see E.N. 35",
                " of Surah Al-Mulk)."
            ]
        },
        {
            "verse-id": "[79:43]",
            "verse": "In what [position] are you that you should mention it?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:44]",
            "verse": "To your Lord is its finality.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[79:45]",
            "verse": "You are only a warner for those who fear it.",
            "description": [
                "This also we have explained in E.N.",
                " 36 of Surah Al-Mulk above. As for",
                " the words \"you are only a Warner",
                " to him who fears it\", they do",
                " not mean that it is not your",
                " duty to warn those who do not",
                " fear, but it means: \"Your warning will",
                " benefit only him who fears the coming",
                " of that Day.\""
            ]
        },
        {
            "verse-id": "[79:46]",
            "verse": "It will be, on the Day they see it, as though they had not remained [in the world] except for an afternoon or a morning thereof.",
            "description": [
                "This theme has occurred at several places",
                " in the Qur'an and been explained in",
                " the corresponding Notes. For it, see E.N.",
                " 53 of Yunus, E.N. 56 of Bani",
                " Isra'il, E.N. 80 of Ta Ha, E.N.",
                " 101 of Al-Mu'minun, E.N.'s 81, 82 of",
                " ArRum, E.N. 48 of Ya Sin. Besides,",
                " this theme has also occurred in Al-Ahqaf:",
                " 35 but we have not explained it",
                " there for fear of repetition."
            ]
        }
    ]
}