{
    "name": "Al-Anfal",
    "id": 8,
    "verse-count": 75,
    "verse-info": [
        {
            "verse-id": "[8:1]",
            "verse": "They ask you, [O Muhammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allah and the Messenger.\" So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.",
            "description": [
                "The critique of the battle opens with",
                " this unusual note. Some disagreements had arisen",
                " among the Muslims with regard to sharing",
                " the spoils of war. As it was",
                " their first experience of fighting under the",
                " banner of Islam, the Muslim soldiers had",
                " scarcely any notion of the regulations they",
                " were required to follow on the battlefield",
                " and for settling problems arising from warfare.",
                " Doubtlessly some preliminary instructions had been laid",
                " down for them in Surah al-Baqarah 2",
                " and Surah Muhammad 47, (See 2: 190",
                " ff. and 47: 4 ff. - Ed.)",
                " However the full set of regulations that",
                " could contribute to civilizing the conduct of",
                " warfare had yet to be laid down.",
                " Hence, when it came to war as",
                " with several other societal matters, the Muslims",
                " were still under the influence of pre-Islamic",
                " ideas and concepts. Going by the age-old",
                " Arab customs, those who had seized the",
                " spoils of war considered themselves their sole",
                " and legitimate owners. On the other hand,",
                " the Muslims who had concentrated on driving",
                " away the enemy rather than on collecting",
                " the spoils, claimed that they deserved an",
                " equal share of the spoils. They contended",
                " that had they slackened in their duty",
                " of pursuing the enemy, the latter might",
                " have struck back, turning the Muslim victory",
                " into a defeat. Similarly, another group of",
                " Muslims who had escorted the Prophet (peace",
                " he on him) on the battlefield, also",
                " laid claim to an equal share, For,",
                " they believed, it was they who had",
                " rendered an invaluable service insofar as neglect",
                " of duty on their part might have",
                " resulted in endangering the precious life of",
                " the Prophet (peace be on him), in",
                " which case the possibility of victory and",
                " its attendant spoils and their distribution would",
                " all have been totally out of the",
                " question. Nonetheless, the group of Muslims who",
                " already possessed the spoils saw no merit",
                " in these claims. Arguments and counter-arguments gave",
                " rise to bitterness and bad blood. (For",
                " disagreements among Muslims on the question of",
                " distribution of spoils of war see Ibn",
                " Hisham, vol. 1. pp. 641-2; al-Waqadi, vol.",
                " 1, p. 78. See also the comments",
                " on the verse in Qurtubi and Ibn",
                " Kathir - Ed.)",
                "It was at this",
                " juncture that God revealed the present surah.",
                " The opening verse takes up this issue.",
                " 'They ask you concerning anfal' is the",
                " query with which the surah opens. The",
                " very use of the word anfal instead",
                " of ghana'im in the query implies the",
                " answer. For the word anfal, which is",
                " the plural of nafl, stands for that",
                " which is extra, that which is over",
                " and above what is obligatory. If this",
                " extra is from the servant, it denotes",
                " that additional service which he voluntarily renders",
                " over and above what is obligatory. On",
                " the other hand, when this extra is",
                " from the master, it denotes the additional",
                " reward which the master awards his servant",
                " over and above what he is entitled",
                " to. What is being conveyed here by",
                " using the word anfal is, in fact,",
                " that all wrangling about spoils is out",
                " of place since it concerns not their",
                " rights, but the additional rewards they might",
                " receive from God. Any and all heated",
                " discussion in which they engaged was irrelevant",
                " since it was entirely for God to",
                " decide whether He should grant any extra",
                " reward or not; and if He should",
                " grant it, then how much, and to",
                " whom. In short, it was not for",
                " men to say who should and who",
                " should not receive any party of the",
                " spoils.",
                "This was a major conceptual reform.",
                " The war that a Muslim wages is",
                " not in order to accumulate worldly benefits.",
                " He resorts to it for the moral",
                " and social reform of the world and",
                " does so when the opposing forces make",
                " it impossible to bring about reform by",
                " means of persuasion and preaching. Being reformers,",
                " the Muslims should focus their attentions on",
                " their goal - the reform of the",
                " world - rather than on the material",
                " benefits which accrue to them incidental by",
                " way of God's additional reward in lieu",
                " of their strivings. If the attention of",
                " Muslims is not diverted from material benefits",
                " to their true mission, it is likely",
                " that material benefits would become an end",
                " in themselves.",
                "Moreover, the concept introduced by",
                " the Qur'an (see the verse above) also",
                " brought about a major administrative reform pertaining",
                " to war and the spoils of war.",
                " Before the advent of Islam, a soldier",
                " used to appropriate all that he could",
                " lay his hands on, claiming to be",
                " its rightful owner, or else spoils were",
                " seized either by; the king or the",
                " commander of the army. In the former",
                " case, mutual conflicts ensued among soldiers of",
                " the victorious army, with the frequent result",
                " that their victory turned into defeat. On",
                " the other hand, if the spoils were",
                " seized by the commander of the army",
                " or the ruler, soldiers often concealed and",
                " stole the spoils. By declaring that the",
                " spoils belong to God and His Messenger,",
                " the Qur'an made it obligatory on all",
                " soldiers to commit all the spoils of",
                " war to the custody of the commander,",
                " concealing not even something as trivial as",
                " a sewing needle. Subsequently the Qur'an laid",
                " down an elaborate set of laws to",
                " distribute the spoils of war. According to",
                " it, one-fifth of the spoils is to",
                " be deposited in the public treasury for",
                " public welfare and to provide support for",
                " the poor, while four-fifths is to be",
                " distributed among the soldiers. (al-Anfal 8: 41",
                " - Ed.) It thus put an end",
                " to the evils inherent in the old",
                " system.",
                "A subtle point implicit in the",
                " above verse should not he overlooked. In",
                " the opening verse of the Surah nothing",
                " has been said beyond affirming the principle",
                " that the spoils belong to God and",
                " His Messenger. The problem as to how",
                " the spoils should be distributed was not",
                " touched upon. The Qur'an does however subsequently",
                " treat the question of distribution (see verse",
                " 41 below). It is significant that in",
                " this second instance the word used is",
                " a verbal derivative of ghanimah (spoils, booty)",
                " (see verse 41 below) whereas in the",
                " opening verse the word used is anfal.",
                ""
            ]
        },
        {
            "verse-id": "[8:2]",
            "verse": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -",
            "description": [
                "A man's faith grows as he is",
                " able to confirm and submit to the",
                " command of God which he comes across.",
                " This is especially so where he submits",
                " to commands which go against his own",
                " personal predilections. A man's faith attains great",
                " heights if instead of trying to twist",
                " and distort the commands of God and",
                " the Prophet (peace he on him), he",
                " develops the habit of accepting and submitting",
                " to all the commands of God and",
                " the Prophet (peace be on him); if",
                " he strives to shape his conduct to",
                " the teachings which go against his personal",
                " opinions and conceptions, which are contrary to",
                " his habits, interests and convenience, which are",
                " not in consonance with his loyalties and",
                " friendships. For if he hesitates to respond",
                " positively to God's command, his faith is",
                " diminished. One thus learns that faith is",
                " not a static, immobile object. Nor is",
                " every, act of belief, or unbelief, of",
                " the same quality. An act of belief",
                " may be better or worse than another",
                " act of belief. Likewise, an act of",
                " unbelief may differ in quality from another",
                " act of unbelief. For both belief and",
                " unbelief, are capable of growth and decline.",
                "",
                "All this concerns the essence of belief",
                " and unbelief. However, when belief and unbelief",
                " are mentioned as a basis for membership",
                " of the Muslim community or in connection",
                " with legal rights and responsibilities as necessary",
                " corollaries of that membership, a clear line",
                " of demarcation has to be drawn between",
                " those who believe and those who do",
                " not. In this respect the determination of",
                " who is a believer and who is",
                " not will depend on the basic minimum",
                " of belief regardless of quality of belief.",
                " In an Islamic society all those who",
                " believe will be entitled to the same",
                " legal rights and will be required to",
                " fulfil the same duties regardless of the",
                " differences in the quality of their faith.",
                " Likewise, all unbelievers - regardless of the",
                " differences in the quality of their unbelief",
                " - will be placed in the category",
                " of unbelievers disregarding the question whether their",
                " unbelief is of an ordinary quality or",
                " an extremely serious one."
            ]
        },
        {
            "verse-id": "[8:3]",
            "verse": "The ones who establish prayer, and from what We have provided them, they spend.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:4]",
            "verse": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.",
            "description": [
                "Even the best and the most devoted",
                " believers are liable to commit lapses. As",
                " long as man is man, it is",
                " impossible for his record to be filled",
                " exclusively with righteousness of the highest order",
                " and to be free from all lapses,",
                " shortcomings and weaknesses. Out of His infinite",
                " mercy, however, God overlooks man's shortcomings as",
                " long as he fulfils the basic duties",
                " incumbent upon him as God's servant, and",
                " favours him with a reward far greater",
                " than that warranted by his good works.",
                " Had it been a rule that man",
                " would be judged strictly on the basis",
                " of his deeds, that he would be",
                " punished for every evil deed and rewarded",
                " for every good deed, no man, howsoever",
                " righteous, would have escaped punishment."
            ]
        },
        {
            "verse-id": "[8:5]",
            "verse": "[It is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:6]",
            "verse": "Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on.",
            "description": [
                "When the people in question were required",
                " to fight, they were disinclined to do",
                " so for they felt that they were",
                " being driven to death and destruction. Their",
                " condition is somewhat similar for they are",
                " now required not to contend about spoils",
                " of war and wait for God's command",
                " as to how the spoils of war",
                " should be distributed.",
                "This verse could also",
                " mean that if Muslims obeyed God and",
                " followed the Prophet (peace be on him)",
                " rather than their own desires, they would",
                " witness as good a result as they",
                " witnessed on the occasion of the Battle",
                " of Badr. On this occasion too many",
                " were reluctant to take on the Quraysh",
                " and considered it nothing short of suicide",
                " (see verse 6). But when they obeyed",
                " the command of God and His Prophet",
                " (peace be on him), it proved to",
                " be a source of life and survival.",
                "",
                "Incidentally, this statement in the Qur'in implicitly",
                " negates reports usually mentioned in the works",
                " of Sirah and Maghazi and which suggest",
                " that the Prophet (peace be on him)",
                " and his Companions had initially set out",
                " from Madina in order to raid the",
                " trading caravan of the Quraysh, and that",
                " it was only when they came to",
                " know that the Quraysh army was advancing",
                " to provide protection to the trading caravan",
                " that the Muslims were faced with the",
                " option of either attacking the caravan or",
                " the Quraysh army. The Qur'anic version is",
                " quite contrary. Accordingly, from the moment when",
                " the Prophet (peace be on him) set",
                " out from his house, he was intent",
                " upon a decisive battlewith the Quraysh. In",
                " addition, the decision as to whether the",
                " Muslims should confront the trading caravan or",
                " the army was taken at the very",
                " beginning rather than later on. It is",
                " also evident that even though it was",
                " quite clear that it was essential to",
                " confront the Quraysh army, a group of",
                " Muslims tried to avoid it and kept",
                " pleading for their viewpoint. Even when a",
                " firm decision had been taken that the",
                " Muslims would attack the Quraysh army rather",
                " than the caravan, this group set out",
                " for the encounter with the view that",
                " they were being driven to death and",
                " destruction. (See verses 5-8. Cf. al-Waqidi. vol.",
                " 1, pp. 19-21; Ibn Sa'd, vol. 2.",
                " pp. 11-14 - Ed.)"
            ]
        },
        {
            "verse-id": "[8:7]",
            "verse": "[Remember, O believers], when Allah promised you one of the two groups - that it would be yours - and you wished that the unarmed one would be yours. But Allah intended to establish the truth by His words and to eliminate the disbelievers",
            "description": [
                "God's promise was that the Muslims would",
                " be able to overcome whichever of the",
                " two parties they wished to attack -",
                " the trading caravan or the Quraysh army.",
                "",
                "*6). This refers to the trading caravan",
                " which had some 30 to 40 armed",
                " guards for protection."
            ]
        },
        {
            "verse-id": "[8:8]",
            "verse": "That He should establish the truth and abolish falsehood, even if the criminals disliked it.",
            "description": [
                "This gives some idea of the prevalent",
                " situation at the time. As we have",
                " said earlier (see above, p. 128), the",
                " march of the Quraysh towards Madina meant",
                " that only one of the two would",
                " survive in Arabia - either Islam or",
                " the entrenched system of Jahiliyah (Ignorance). Had",
                " the Muslims not taken up the challenge,",
                " the very survival of Islam would have",
                " been imperilled. But since the Muslims took",
                " the initiative and dealt a severe blow",
                " to the military strength of the Quraysh",
                " it became possible for Islam to consolidate",
                " itself and subsequently the forces of Ignorance",
                " suffered a succession of humiliating reverses."
            ]
        },
        {
            "verse-id": "[8:9]",
            "verse": "[Remember] when you asked help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:10]",
            "verse": "And Allah made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allah. Indeed, Allah is Exalted in Might and Wise.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:11]",
            "verse": "[Remember] when He overwhelmed you with drowsiness [giving] security from Him and sent down upon you from the sky, rain by which to purify you and remove from you the evil [suggestions] of Satan and to make steadfast your hearts and plant firmly thereby your feet.",
            "description": [
                "In the Battle of Uhud the Muslims",
                " passed through a similar experience (see Al'lmran",
                " 3: 154 above). On both occasions, when",
                " prevalent conditions should have produced intense fear",
                " and panic among them, God filled their",
                " hearts with such peace and tranquillity that",
                " they were overpowered with drowsiness.",
                "*9). This",
                " refers to the heavy downpour on the",
                " night preceding the Battle of Badr. It",
                " helped the Muslims in three ways. First,",
                " it provided them with an abundant water",
                " supply which they quickly stored in large",
                " reservoirs. Second, rain compacted the loose sand",
                " in the upper part of the valley",
                " where the Muslims had pitched their tents.",
                " This helped the Muslims plant their feet",
                " firmly and facilitated their movement. Third, where",
                " the Quray'sh army was stationed in the",
                " lower part of the valley, the ground",
                " turned marshy.",
                "The defilement caused by Satan",
                " which occurs in the verse refers to",
                " the fear and panic which initially, afflicted",
                " the Muslims."
            ]
        },
        {
            "verse-id": "[8:12]",
            "verse": "[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"",
            "description": [
                "In view of the general principle propounded",
                " in the Qur'an we presume that the",
                " angels did not take part in the",
                " actual fighting. What we may suggest is",
                " that the angels helped the Muslims and",
                " as a result their blows became more",
                " accurate and effective."
            ]
        },
        {
            "verse-id": "[8:13]",
            "verse": "That is because they opposed Allah and His Messenger. And whoever opposes Allah and His Messenger - indeed, Allah is severe in penalty.",
            "description": [
                "In recounting the events of the Battle",
                " of Badr, the Qur'an aims to explain",
                " the significance of the word al-anfal (spoils",
                " of war). In the opening verse of",
                " the surah the Muslims were told that",
                " they should not deem the spoils to",
                " be a reward for their toil. Rather,",
                " the spoils should constitute a special reward",
                " granted to the Muslims by God, to",
                " Whom the spoils rightfully belong. The events",
                " recounted here support this. The Muslims could",
                " reflect on the course of events and",
                " see for themselves to what extent the",
                " victory they had achieved was due to",
                " God's favour, and to what extent it",
                " was due to their own efforts."
            ]
        },
        {
            "verse-id": "[8:14]",
            "verse": "\"That [is yours], so taste it.\" And indeed for the disbelievers is the punishment of the Fire.",
            "description": [
                "Here the discourse is suddenly directed to",
                " the unbelievers who we mentioned (in verse",
                " 13) as deserving of God's punishment."
            ]
        },
        {
            "verse-id": "[8:15]",
            "verse": "O you who have believed, when you meet those who disbelieve advancing [for battle], do not turn to them your backs [in flight].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:16]",
            "verse": "And whoever turns his back to them on such a day, unless swerving [as a strategy] for war or joining [another] company, has certainly returned with anger [upon him] from Allah, and his refuge is Hell - and wretched is the destination.",
            "description": [
                "The Qur'an does not forbid orderly retreat",
                " under strong pressure from the enemy provided",
                " it is resorted to as a stratagem",
                " of war, for example seeking reinforcements or",
                " joining another party in the rear. What",
                " the Qur'an does forbid is disorderly flight",
                " produced by sheer cowardice and defeatism. Such",
                " a retreat takes place because the deserter",
                " holds his life dearer than his cause.",
                " Such cowardice has been characterized as one",
                " of those three major sins which, if",
                " committed, can be atoned for by no",
                " other good deed whatsoever. These three sins",
                " are: ascription of divinity to anyone or",
                " anything other than God, violation of the",
                " rights of parents, and flight from the",
                " battlefield during fighting in the way of",
                " God. (See al-Mundhiri, 'Kitab al-Jihad', 'Bab al-Tarhib",
                " min al-Firar min al-Zahf'- Ed.) In another",
                " tradition the Prophet (peace be on him)",
                " has mentioned seven deadly sins which totally",
                " ruin a man's Next Life. One of",
                " these is flight from the battlefield in",
                " an encounter between Islam and Unbelief. (Muslim,",
                " 'K. al-lman', 'Bab al-Kabi'ir wa Akbaruha'; Bukhari,",
                " 'K. al-Wasaya', 'bab - fi Qawl Allah",
                " - Tala: inna al-ladhina Ya'kuluna Amwal al-Yatami",
                " Zulman' - Ed.) This has been declared",
                " a deadly sin because in addition to",
                " being an act of sheer cowardice, it",
                " demoralizes others and can generate demoralization which",
                " can have disastrous consequences. An individual soldier's",
                " desertion might cause a whole platoon, or",
                " even a whole regiment, and ultimately the",
                " whole army, to take flight. For once",
                " a soldier flees in panic, it is",
                " hard to control the others."
            ]
        },
        {
            "verse-id": "[8:17]",
            "verse": "And you did not kill them, but it was Allah who killed them. And you threw not, [O Muhammad], when you threw, but it was Allah who threw that He might test the believers with a good test. Indeed, Allah is Hearing and Knowing.",
            "description": [
                "This refers to the occasion wnen the",
                " armies of the Muslims and the unbelievers",
                " stood face to face in the Battle",
                " of Badr and were on the verge",
                " of actual fighting. At that moment, the",
                " Prophet (peace be on him) threw a",
                " handful of dust at the enemy saying:",
                " 'May, their faces be scorched.' So saying",
                " the Prophet (peace be on him) made",
                " a gesture and the Muslims started their",
                " charge. (See Ahmad b. Hanbal, Musnad, vol.",
                " 1, p. 368; Ibn Hisham, vol. 1,",
                " p. 668; Ibn Kathir, comments on the",
                " verse - Ed.)"
            ]
        },
        {
            "verse-id": "[8:18]",
            "verse": "That [is so], and [also] that Allah will weaken the plot of the disbelievers.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:19]",
            "verse": "If you [disbelievers] seek the victory - the defeat has come to you. And if you desist [from hostilities], it is best for you; but if you return [to war], We will return, and never will you be availed by your [large] company at all, even if it should increase; and [that is] because Allah is with the believers.",
            "description": [
                "Before marching out from Makka the unbelievers",
                " held the covering of the Ka'bah and",
                " prayed: 'O God! Grant victory to the",
                " better of the two parties.' Abu Jahl,",
                " in particular invoked God's judgement: 'O God!",
                " Grant victory to the one who is",
                " in the right and cause humiliation to",
                " the wrong-doer.' God answered these prayers fully",
                " and the outcome of the battle clearly",
                " pointed to the party which was in",
                " the right."
            ]
        },
        {
            "verse-id": "[8:20]",
            "verse": "O you who have believed, obey Allah and His Messenger and do not turn from him while you hear [his order].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:21]",
            "verse": "And do not be like those who say, \"We have heard,\" while they do not hear.",
            "description": [
                "In the present context, 'hearing' means taking",
                " heed with a view to obey'. The",
                " verse alludes to those hypocrites who professed",
                " to believe and yet were not willing",
                " to carry out the commands of God.",
                ""
            ]
        },
        {
            "verse-id": "[8:22]",
            "verse": "Indeed, the worst of living creatures in the sight of Allah are the deaf and dumb who do not use reason.",
            "description": [
                "These are the ones who neither hear",
                " nor speak the truth. So far as",
                " truth is concerned, their ears are deaf",
                " and their mouths dumb."
            ]
        },
        {
            "verse-id": "[8:23]",
            "verse": "Had Allah known any good in them, He would have made them hear. And if He had made them hear, they would [still] have turned away, while they were refusing.",
            "description": [
                "Such people have neither any love for",
                " the truth nor any desire to strive",
                " for it. Hence even if they were",
                " enabled by God to go forth to",
                " the battlefield. they would have turned on",
                " their heels at the very first sight",
                " of danger. That such people should be",
                " a part of the Muslim army might",
                " have led to greater harm than good.",
                ""
            ]
        },
        {
            "verse-id": "[8:24]",
            "verse": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.",
            "description": [
                "The most effective means of preventing man",
                " from failing prey to hypocrisy is to",
                " implant two ideas in his mind. First,",
                " that he will have to face the",
                " reckoning and judgement of God Who knows",
                " what is in the deep recesses of",
                " his heart. Even man's intentions and desires,",
                " the purposes which he seeks to achieve,",
                " the ideas that he seeks to keep",
                " hidden in his heart, are all well",
                " known to God. Second, that ultimately every",
                " man will be mustered to God; that",
                " He is so powerful that none can",
                " escape His judgement. The deeper the roots",
                " of these convictions. the further is man",
                " removed from hypocrisy. Hence, while admonishing Muslims",
                " against hypocrisy, the Qur'an frequently resorts to",
                " emphasizing these two articles oi belief."
            ]
        },
        {
            "verse-id": "[8:25]",
            "verse": "And fear a trial which will not strike those who have wronged among you exclusively, and know that Allah is severe in penalty.",
            "description": [
                "This refers to those widespread social evils",
                " whose baneful effects are not confined only",
                " to those addicted to them, but which",
                " affect even those who, although they might",
                " not be addicted to those sins, are",
                " a part of that society. For example,",
                " if filth is found at just a",
                " few places in a locality it will",
                " possibly affect only those who have not",
                " kept themselves or their houses clean. However,",
                " if it becomes widespread and no one",
                " is concerned with removing uncleanliness and maintaining",
                " sanitary conditions, then everything including water and",
                " soil will become contaminated. As a result,",
                " if epidemics break out, they will not",
                " only afflict those who were responsible for",
                " spreading filth and themselves lived in unsanitary",
                " conditions, but virtually all the residents of",
                " that locality.",
                "What is true of unsanitary",
                " conditions in a physical sense, also holds",
                " true for filth and uncleanliness in a",
                " moral sense. If immoral practices remain confined",
                " to a few people here and there",
                " but the overall moral concern of the",
                " society prevents those practices from becoming widespread",
                " and public, their harmful effects remain limited.",
                " But when the collective conscience of the",
                " society is weakened to a point whereby",
                " immoral practices are not suppressed, when people",
                " indulge in evils without any sense of",
                " shame and even go around vaunting their",
                " immoral deeds, when good people adopt a",
                " passive attitude and are content with being",
                " righteous merely in their own lives and",
                " are unconcerned with or silent about collective",
                " evils, then the entire society invites its",
                " doom. Such a society then becomes the",
                " victim of a scourge that does not",
                " distinguish between the grain and the chaff.",
                "",
                "What God's directive seeks to impress upon",
                " people is that the reformatory mission of",
                " the Prophet (peace be on him) and",
                " the cause he was inviting people to",
                " was the source of life and well-being",
                " for them both individually and collectively. People",
                " should bear in mind that if they",
                " fail to participate wholeheartedly in the task",
                " to which they were invited and remain",
                " silent spectators to rampant evils, that would",
                " invite a scourge that would embrace all.",
                " It would afflict even those individuals who",
                " neither themselves committed evils nor were instrumental",
                " in spreading them and who might in",
                " fact have been righteous in their personal",
                " conduct. This point was emphasized earlier (see",
                " al-A'raf 7: 163-6) and was illustrated by",
                " reference to the Sabbath-breakers, and constitutes the",
                " underlying Islamic philosophy for waging war for",
                " purposes of reform."
            ]
        },
        {
            "verse-id": "[8:26]",
            "verse": "And remember when you were few and oppressed in the land, fearing that people might abduct you, but He sheltered you, supported you with His victory, and provided you with good things - that you might be grateful.",
            "description": [
                "The reference to gratefulness in the verse",
                " is worthy of reflection. Bearing in mind",
                " the subject under discussion, it appears that",
                " gratefulness does not simply mean that Muslims",
                " should acknowledge God's favour to them insofar",
                " as He rescued them from their state",
                " of abject weakness. God had not only",
                " salvaged them from an insecure life in",
                " Makka and provided them with a haven",
                " of security in Madina where they enjoyed",
                " an abundance of livelihood. Gratefulness does not",
                " simply require all that. Apart from acknowledging",
                " God's favour, gratefulness also demands that Muslims",
                " should faithfully obey God and His Messenger",
                " out of a consciousness of God's munificence,",
                " out of loyalty and devotion to the",
                " Prophet's mission, and should cast aside all",
                " dangers, hardships and misfortunes that might confront",
                " them. In their struggle for God's cause",
                " Muslims should have complete trust in God",
                " Who has helped them on earlier occasions",
                " and Who has delivered them from dangers.",
                " The Muslims should also have faith that",
                " if they work sincerely in God's cause",
                " He will certainly help and protect them.",
                " Hence, the gratefulness expected of the Muslims",
                " does not simply consist of a verbal",
                " acknowledgement of God's benefaction. Gratefulness to God",
                " should manifest itself in actual deeds as",
                " well. If someone were to acknowledge the",
                " favour of his Lord, and yet is",
                " slack in seeking His good pleasure, lacks",
                " sincerity in serving Him, and entertains doubts",
                " that God's benefaction will continue in the",
                " future, then that can hardly be characterized",
                " as gratitude."
            ]
        },
        {
            "verse-id": "[8:27]",
            "verse": "O you who have believed, do not betray Allah and the Messenger or betray your trusts while you know [the consequence].",
            "description": [
                "'Trusts' embrace all the responsibilities which are",
                " imparted to someone because he is trusted.",
                " These might consist of obligations arising out",
                " of an agreement or collective covenant. It",
                " might also consist of the secrets of",
                " a group. It might also consist of",
                " personal or collective property, or any office",
                " or position which might be bestowed upon",
                " a person by the group. (For further",
                " explanation see Towards Undersranding the Qur' an,",
                " vol. 11. al-Nisa' 4, n. 88, pp.",
                " 49 f - Ed.)"
            ]
        },
        {
            "verse-id": "[8:28]",
            "verse": "And know that your properties and your children are but a trial and that Allah has with Him a great reward.",
            "description": [
                "Excessive love of money and one's children",
                " often impair the sincerity of a person's",
                " faith and often lead man to hypocrisy,",
                " treachery and dishonesty. The Qur'an, therefore, clearly",
                " points out ihat since 1ove of wealth",
                " or children drives people off the right",
                " path, it constitutes a considerable test for",
                " them. One's property, one's business and one's",
                " offspring constitute a test for man since",
                " they have been in his custody so",
                " as to judge to what extent he",
                " observes the limits of propriety laid down",
                " by God and adequately performs his responsibilities.",
                " What is tested is how far man",
                " is able to control his animal self",
                " - which is strongly attached to worldly",
                " purposes - so that he is able",
                " to act as God's servant and render",
                " all the rights of worldly life in",
                " the manner laid down by God."
            ]
        },
        {
            "verse-id": "[8:29]",
            "verse": "O you who have believed, if you fear Allah, He will grant you a criterion and will remove from you your misdeeds and forgive you. And Allah is the possessor of great bounty.",
            "description": [
                "'Criterion' signifies that which enables one to",
                " distinguish between true and false; between real",
                " and fake. This is the shade of",
                " meaning conveyed by the Qur'anic term 'furqan'.",
                " If a man is God-fearing and tries",
                " his best to refrain from acts which",
                " displease God, God will create in him",
                " the ability to discern for himself at",
                " every step which actions are proper and",
                " which are not; which attitude conduces to",
                " God's good pleasure and which is likely",
                " to incur His wrath. This inner light",
                " will serve as a pointer at every",
                " turn and crossing, at every up and",
                " down in life, guiding him as to",
                " when he should proceed and when he",
                " should refrain, telling him which is the",
                " path of truth and leads to God,",
                " and which is false and leads to",
                " Satan."
            ]
        },
        {
            "verse-id": "[8:30]",
            "verse": "And [remember, O Muhammad], when those who disbelieved plotted against you to restrain you or kill you or evict you [from Makkah]. But they plan, and Allah plans. And Allah is the best of planners.",
            "description": [
                "Apprehending the Prophet's migration to Madina, the",
                " Quraysh convened a high-level council attended by",
                " all the tribal chiefs at Dar al-Nadwah",
                " (Council House) to decide on a decisive",
                " course of action against the Prophet (peace",
                " be on him). They realized that once",
                " the Prophet (peace be on him) left",
                " Makka, he would be beyond their reach,",
                " rendering them helpless in face of a",
                " formidable threat. A group of them was",
                " of the view that the Prophet (peace",
                " be on him) should be imprisoned for",
                " life and kept in chains. This proposal",
                " was, however, turned down on the ground",
                " that the Prophet's detention would not deter",
                " his followers from preaching Islam and that",
                " they would seize the first opportunity to",
                " release the Prophet (peace be on him)",
                " even at the risk to their own",
                " lives. Another group suggested that the Prophet",
                " (peace be on him) should be exiled,",
                " for this would remove the mischief and",
                " subversion far from Makka, and it would",
                " not matter where he spent his days",
                " nor what he did, for Makka would",
                " be immune from his influence. This proposal,",
                " too, was discarded for fear of the",
                " Prophet's persuasiveness and eloquence, and his ability",
                " to win the hearts of the people",
                " of other tribes and thus pose a",
                " greater threat in the future. Finally, Abu",
                " Jahl suggested that a band of young",
                " men drawn from all the different clans",
                " of the Quraysh should jointly pounce upon",
                " the Prophet (peace be on him) and",
                " kill him. In such a case the",
                " responsibility for his blood would rest upon",
                " all the clans of the Quray'sh. It",
                " would thus become impossible for 'Abd Manaf,",
                " the Prophet's clan. to take revenge on",
                " any one particular clan. Such a move",
                " would compel the Prophet's relatives to drop",
                " their claims for retaliation and force them",
                " to settle for blood-money. Accordingly, the young",
                " men charged with the execution of this",
                " plan were selected, and were advised of",
                " the exact place and time at which",
                " they were expected to carry out the",
                " crime. Not only that, the would-be assassins",
                " did indeed arrive at the appointed place",
                " at the appointed time. However, before they",
                " could harm him the Prophet (peace be",
                " on him) managed to escape safely. The",
                " Ouraysh plot was thus frustrated at the",
                " eleventh hour. (See Ibn Hisham, vol. 1,",
                " pp. 480-2. See also Ibn Kathir's comments",
                " on the verse - Ed.)"
            ]
        },
        {
            "verse-id": "[8:31]",
            "verse": "And when Our verses are recited to them, they say, \"We have heard. If we willed, we could say [something] like this. This is not but legends of the former peoples.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:32]",
            "verse": "And [remember] when they said, \"O Allah, if this should be the truth from You, then rain down upon us stones from the sky or bring us a painful punishment.\"",
            "description": [
                "These words were uttered by way of",
                " challenge rather than a prayer to God.",
                " What they meant was that had the",
                " message of the Prophet (peace be on",
                " him) been true, and from God, its",
                " rejection would have entailed a heavy scourge,",
                " and stones would have fallen on them",
                " from heaven. Since nothing of the sort",
                " happened, it was evident that the message",
                " was neither true nor from God."
            ]
        },
        {
            "verse-id": "[8:33]",
            "verse": "But Allah would not punish them while you, [O Muhammad], are among them, and Allah would not punish them while they seek forgiveness.",
            "description": [
                "This is a rejoinder to the challenge",
                " implicit in the above-mentioned remark of the",
                " unbelievers. In response it was explained why",
                " people were spared heavenly scourge during the",
                " Makkan period of the Prophet's life. The",
                " first reason being that God does not",
                " punish a people as long as the",
                " Prophet is in their midst, busy inviting",
                " them to the truth. Such people are",
                " rather granted respite and are not deprived",
                " of the opportunity to reform themselves by",
                " sending a scourge all too quickly. Second,",
                " if there are a good number of",
                " people in a land who recognize that",
                " they have been negligent and heedless and",
                " have been guilty of iniquity, who seek",
                " God's forgiveness and strive to reform themselves,",
                " there remains no legitimate ground for subjecting",
                " them to a heavenly scourge. The time",
                " for such a scourge comes when a",
                " Prophet who has spared no efforts to",
                " reform his people feels that he has",
                " exhausted all his efforts, and concludes that",
                " his people have no justification to persist",
                " in their iniquity, and departs from that",
                " land or is banished from it by",
                " its people or is murdered by them.",
                " A scourge from on high then becomes",
                " imminent since the people of that land",
                " have proven by their deeds their inability",
                " to tolerate any righteous element in their",
                " midst."
            ]
        },
        {
            "verse-id": "[8:34]",
            "verse": "But why should Allah not punish them while they obstruct [people] from al-Masjid al- Haram and they were not [fit to be] its guardians? Its [true] guardians are not but the righteous, but most of them do not know.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:35]",
            "verse": "And their prayer at the House was not except whistling and handclapping. So taste the punishment for what you disbelieved.",
            "description": [
                "This is to dispel a misconception common",
                " among the Arabs of those days. They",
                " were generally inclined to assume that since",
                " the Quraysh were the guardians and keepers",
                " of the Ka'bah and were also engaged",
                " in worship at that holy spot, they",
                " were recipients of God's special favours. Here",
                " people are told that the defacto guardianship",
                " of the Ka'bah should not be confused",
                " with its de jure guardianship. For only",
                " the God-fearing and pious are the rightful",
                " guardians of the Ka,bah. As for the",
                " Quraysh, far from behaving in a manner",
                " becoming of the guardians of the Ka'bah,",
                " they had virtually installed themselves as its",
                " masters, and were guilty of preventing people",
                " from worshipping there at will. This attitude",
                " blatantly betrayed their impiety, and un righteousness.",
                " As for their worship in the Ka'bah.",
                " it was altogether devoid of religious devotion",
                " and sincerity. They neither turned earnestly to",
                " God, nor displayed any genuine submission or",
                " humility, nor engaged in worshipfully remembering Him.",
                " Their worship consisted of meaningless noise and",
                " clamour, of acts which seemed closer to",
                " play and jest than acts of religious",
                " devotion. How could such a guardianship of",
                " the Ka'bah and such non-serious acts in",
                " the name of worship win God's favour",
                " for them, or secure for them immunity",
                " from God's scourge?",
                "*29). The Quraysh believed",
                " that God's punishment necessarily takes the form",
                " of some natural calamity or a rain",
                " of stones from the sky. They are,",
                " however, told that their decisive defeat in",
                " the Battle of Badr, which ensured the",
                " survival of Islam and spelled death for",
                " their much-cherished Jahiliyah was a form of",
                " God's punishment for them."
            ]
        },
        {
            "verse-id": "[8:36]",
            "verse": "Indeed, those who disbelieve spend their wealth to avert [people] from the way of Allah. So they will spend it; then it will be for them a [source of] regret; then they will be overcome. And those who have disbelieved - unto Hell they will be gathered.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:37]",
            "verse": "[This is] so that Allah may distinguish the wicked from the good and place the wicked some of them upon others and heap them all together and put them into Hell. It is those who are the losers.",
            "description": [
                "What can be more calamitous than a",
                " person's discovery at the end of the",
                " road that all the time, energy, ability",
                " and the very quintessence of his life",
                " which he has devoted has driven him",
                " straight to his utter ruin; that his",
                " investments far from yielding any interest or",
                " dividend will require from him the payment",
                " of a grievous penalty instead."
            ]
        },
        {
            "verse-id": "[8:38]",
            "verse": "Say to those who have disbelieved [that] if they cease, what has previously occurred will be forgiven for them. But if they return [to hostility] - then the precedent of the former [rebellious] peoples has already taken place.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:39]",
            "verse": "And fight them until there is no fitnah and [until] the religion, all of it, is for Allah. And if they cease - then indeed, Allah is Seeing of what they do.",
            "description": [
                "This is a reiteration of the purpose,",
                " mentioned earlier in al-Baqarah 2: 193, for",
                " which Muslims are required to wage war.",
                " The purpose is two-fold. Negatively speaking, the",
                " purpose is to eradicate 'mischief'. The positive",
                " purpose consists of establishing a state of",
                " affairs wherein all obedience is rendered to",
                " God alone. This alone is the purpose",
                " for which the believers may, rather should,",
                " fight. Fighting for any other purpose is",
                " not lawful. Nor does it behove men",
                " of faith to take part in wars",
                " for worldly purposes. (For further explanation see",
                " Towards Understanding the Qur'an, vol. 1, al-Baqarah",
                " 2, nn.. 204 and 205, pp. 152-3",
                " - Ed.)"
            ]
        },
        {
            "verse-id": "[8:40]",
            "verse": "But if they turn away - then know that Allah is your protector. Excellent is the protector, and Excellent is the helper.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:41]",
            "verse": "And know that anything you obtain of war booty - then indeed, for Allah is one fifth of it and for the Messenger and for [his] near relatives and the orphans, the needy, and the [stranded] traveler, if you have believed in Allah and in that which We sent down to Our Servant on the day of criterion - the day when the two armies met. And Allah, over all things, is competent.",
            "description": [
                "This verse lay's down the law for",
                " distributing the spoils of war. Spoils of",
                " war, as mentioned earlier, essentially belong to",
                " God and His Messenger. They alone have",
                " the right to dispose of them. As",
                " for the soldiers who fight, they are",
                " not the rightful owners of the spoils;",
                " whatever they do receive should be considered",
                " an extra reward from God rather than",
                " their legitimate right.",
                "Here it is stated",
                " how God and His Messenger decided to",
                " dispose of the spoils. The prescribed rule",
                " is that the soldiers should depbsit all",
                " the spoils with the ruler or the",
                " commander without making any effort to conceal",
                " anything. One-fifth of the spoils thus deposited",
                " would be assigned for the purposes mentioned",
                " in the present verse and four-fifths would",
                " be distributed among the soldiers who had",
                " taken part in the fighting. In keeping",
                " with the directive contained in the present",
                " verse, after every battle the Prophet (peace",
                " be on him) used to proclaim: 'These",
                " are your spoils. My own share in",
                " them is no more than one-fifth and",
                " even that fifth is spent on you.",
                " Bring everything, even if it be a",
                " piece of thread or a needle, or",
                " anything bigger or smaller, and take nothing",
                " by stealth (gulal), for taking by stealth",
                " is a shameful deed, and would lead",
                " to Hell.' (Ahmad b. Hanbal, Musnad, vol.",
                " 5, p. 316 - Ed.)",
                "It is",
                " pertinent to remember that the share of",
                " God and His Messenger (peace be on",
                " him) in the spoils signifies that a",
                " part of the spoils should be earmarked",
                " for the struggle to exalt the Word",
                " of God and to establish Islam as",
                " an operational system of life..",
                "As to",
                " the word 'kinsmen' in the verse, during",
                " the Prophet's lifetime, it stood for his",
                " relatives. Since the Prophet (peace be on",
                " him) devoted all his time to the",
                " cause of Islam, he was not in",
                " a position to earn his own living.",
                " Hence, some arrangement had to be made",
                " for the maintenance of the Prophet (peace",
                " be on him) as well as for",
                " his family, and the relatives dependent upon",
                " him for financial support. Hence a part",
                " of khums (one-fifth of the spoils of",
                " war) was specified for that purpose. There",
                " is, however, some disagreement among jurists as",
                " to whom this share should go to",
                " after the Prophet's death. Some jurists are",
                " of the view that after the Prophet's",
                " death the rule stands repealed. According to",
                " other jurists, this part should go to",
                " relatives of those who succeeded him to",
                " Caliphate. Other jurists are of the view",
                " that this share should be distributed among",
                " the poor members of the Prophet's family.",
                " To the best of my knowledge, the",
                " Rightly-Guided Caliphs followed the last practice. (See",
                " the comments of Qurtubi, Ibn Kathir and",
                " Jassas on the verse. See also Ibn",
                " Rushd, Bidayat al-Mujtahid, vol. 1, pp. 377-8",
                " - Ed. )",
                "*33). This refers to",
                " the support and help from God which",
                " brought about victory for the Muslims."
            ]
        },
        {
            "verse-id": "[8:42]",
            "verse": "[Remember] when you were on the near side of the valley, and they were on the farther side, and the caravan was lower [in position] than you. If you had made an appointment [to meet], you would have missed the appointment. But [it was] so that Allah might accomplish a matter already destined - that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence; and indeed, Allah is Hearing and Knowing.",
            "description": [
                "The living and the dead spoken of",
                " in the above verse do not signify",
                " the individuals who survived the battle or",
                " those killed during it. The reference here",
                " is to the ideological entities of Islam",
                " and Jahiliyah.",
                "*35). God is neither blind",
                " nor deaf nor ignorant. On the contrary,",
                " He is All-Knowing, All-Seeing, All-Wise. Hence, we",
                " find reflection of God's knowledge, wisdom and",
                " justice in history."
            ]
        },
        {
            "verse-id": "[8:43]",
            "verse": "[Remember, O Muhammad], when Allah showed them to you in your dream as few; and if He had shown them to you as many, you [believers] would have lost courage and would have disputed in the matter [of whether to fight], but Allah saved [you from that]. Indeed, He is Knowing of that within the breasts.",
            "description": [
                "This refers to the time when the",
                " Prophet (peace be on him) was leaving",
                " Madina along with the Muslims, or was",
                " on his way to Badr for the",
                " encounter with the Quraysh and did not",
                " have any definite information about the strength",
                " of the enemy. In a dream, however,",
                " the Prophet (peace be on him) had",
                " a vision of the enemy. On the",
                " basis of that vision, the Prophet (peace",
                " he on him) estimated that the enemy,",
                " was not too powerful. Later when the",
                " Prophet (peace be on him) narrated his",
                " dream to the Muslims, they; were also",
                " encouraged and boldly went ahead to confront",
                " the enemy,"
            ]
        },
        {
            "verse-id": "[8:44]",
            "verse": "And [remember] when He showed them to you, when you met, as few in your eyes, and He made you [appear] as few in their eyes so that Allah might accomplish a matter already destined. And to Allah are [all] matters returned.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:45]",
            "verse": "O you who have believed, when you encounter a company [from the enemy forces], stand firm and remember Allah much that you may be successful.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:46]",
            "verse": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.",
            "description": [
                "The believers were asked to exercise self-restraint.",
                " They were required to refrain from haste,",
                " panic, consternation, creed and uncalled-for enthusiasm. They",
                " were counselled to proceed cool-headedly and to",
                " take well-considered decisions. They were also asked",
                " not to relent an inch even in",
                " the face of crave dangers: refrain from",
                " acting rashly under provocation; to desist from",
                " taking hasty action out of impatience. They",
                " were also asked to exercise control over",
                " themselves lest they were tempted by worldly",
                " gains. All these instructions are implicit in",
                " the Qur'anic directive of patience given to",
                " the Muslims. God extends all help and",
                " support to those who exercise 'patience' (sabr)",
                " in the above sense."
            ]
        },
        {
            "verse-id": "[8:47]",
            "verse": "And do not be like those who came forth from their homes insolently and to be seen by people and avert [them] from the way of Allah. And Allah is encompassing of what they do.",
            "description": [
                "This alludes to the army of the",
                " disbelieving Qurayash, which, when it proceeded on",
                " a military expedition against the Muslims, was",
                " accompanied by singing and dancing minstrels. (See",
                " Ibn Sa'd. vol. 2, p. 13 -",
                " Ed.) Whenever the army halted, dancing and",
                " drinking parties were held. Also the army",
                " arrogantly vaunted its military power and numerical",
                " strength before the tribes and localities which",
                " fell on the way, and boasted of",
                " its invincibility. (See al-Waqidi, vol. 1, p.",
                " 39 - Ed.) This much is about",
                " the moral state of the Quraysh army.",
                " What was even worse was the object",
                " of their fighting. They were not fighting",
                " for any lofty ideal. What they aimed",
                " at was merely to defeat the forces",
                " of truth and justice, to suppress and",
                " obliterate the only group which sought to",
                " uphold the truth. They simply did not",
                " want any one to champion the cause",
                " of truth and justice.",
                "This occasion was",
                " considered appropriate to warn the Muslims not",
                " to let themselves degenerate into a group",
                " like the Quraysh. God had favoured them",
                " with faith and devotion to the truth.",
                " and gratitude to God for this favour",
                " required that they should purify both their",
                " conduct and their reason for fighting.",
                "This",
                " directive was not meant just for the",
                " time in which it was revealed. It",
                " is equally applicable today, and will remain",
                " applicable in all times to come. The",
                " forces of Unbelief today are no different",
                " from those in the time of the",
                " Prophet (peace he on him) for the",
                " moral state of the present-day armies is",
                " no better than of armies in the",
                " past. Arrangements for prostitution and drinking are",
                " as much a part of the present-day",
                " armies of unbelievers as ever before. The",
                " soldiers in these armies feel no shame",
                " in openly demanding the maximum amount of",
                " alcoholic drinks and as many call-girls as",
                " possible. Without any sense of shame the",
                " soldiers virtually ask their compatriots to make",
                " available to them their daughters and sisters",
                " for the gratification of their lust. That",
                " being the case how can one expect",
                " that the soldiers of today would not",
                " go about committing debauchery and polluting the",
                " life of the people in the lands",
                " which they happen to conquer?",
                "Apart from",
                " moral corruption, the soldiers of the present-day",
                " armies are known for their arrogance and",
                " affrontery to the conquered peoples. Their gestures",
                " and conversation - both of ordinary soldiers",
                " and officers - bespeak of their arrogance.",
                " Arrogance is also reflected in the statements",
                " made by the statesmen of the militarily-strong",
                " and triumphant nations who in effect boastfully",
                " say to their people, in the words",
                " of the Quran: 'No one shall overcome",
                " you today' (al-Anfal 8: 48) and challenging",
                " the whole world in their vainglory: 'Who",
                " is greater than us in strength?' (Fusilat",
                " 41: 15).",
                "These powers are evidently wicked,",
                " but the purposes for which they wage",
                " war are even more so. These powers",
                " are keen, out of sheer trickery, to",
                " assure the rest of the world that",
                " in waging war they are prompted only",
                " by the welfare of mankind. In actual",
                " fact, they might have either one motive",
                " for waging war or another, but it",
                " is absolutely certain that the motive is",
                " not the welfare of mankind. Their purpose",
                " is to establish their exclusive control and",
                " to exploit the resources created by God",
                " for all mankind. Their goal is to",
                " reduce other nations to the position of",
                " hewers of wood and drawers of water",
                " and to subject them to thraldom and",
                " servitude. Here Muslims are being told, in",
                " effect, that they should eschew the ways",
                " of non-Muslims and desist from devoting their",
                " lives, energy, and resources to the evil",
                " purposes for which non-Muslims engage in warfare.",
                ""
            ]
        },
        {
            "verse-id": "[8:48]",
            "verse": "And [remember] when Satan made their deeds pleasing to them and said, \"No one can overcome you today from among the people, and indeed, I am your protector.\" But when the two armies sighted each other, he turned on his heels and said, \"Indeed, I am disassociated from you. Indeed, I see what you do not see; indeed I fear Allah. And Allah is severe in penalty.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:49]",
            "verse": "[Remember] when the hypocrites and those in whose hearts was disease said, \"Their religion has deluded those [Muslims].\" But whoever relies upon Allah - then indeed, Allah is Exalted in Might and Wise.",
            "description": [
                "Observing that a small band of resourceless",
                " Muslims was getting ready to confront the",
                " powerful Quraysh, the hypocrites as well as",
                " those who were heedless of God and",
                " cared only for worldly interests, often tended",
                " to say to one another that the",
                " religious passion of the Muslims had driven",
                " them to utter fanaticism and zealotry. They",
                " were sure that the Muslims would face",
                " a total rout on the battlefield. They",
                " were puzzled by how the Prophet (peace",
                " be on him), in whom the Muslims",
                " believed, had cast such a spell over",
                " them that they were altogether incapable of",
                " rational calculation and were hence rushing straight",
                " into the very mouth of death."
            ]
        },
        {
            "verse-id": "[8:50]",
            "verse": "And if you could but see when the angels take the souls of those who disbelieved... They are striking their faces and their backs and [saying], \"Taste the punishment of the Burning Fire.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:51]",
            "verse": "That is for what your hands have put forth [of evil] and because Allah is not ever unjust to His servants.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:52]",
            "verse": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They disbelieved in the signs of Allah, so Allah seized them for their sins. Indeed, Allah is Powerful and severe in penalty.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:53]",
            "verse": "That is because Allah would not change a favor which He had bestowed upon a people until they change what is within themselves. And indeed, Allah is Hearing and Knowing.",
            "description": [
                "Unless a nation renders itself totally unworthy",
                " of God's favour, it is not deprived",
                " of it."
            ]
        },
        {
            "verse-id": "[8:54]",
            "verse": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They denied the signs of their Lord, so We destroyed them for their sins, and We drowned the people of Pharaoh. And all [of them] were wrongdoers.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:55]",
            "verse": "Indeed, the worst of living creatures in the sight of Allah are those who have disbelieved, and they will not [ever] believe -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:56]",
            "verse": "The ones with whom you made a treaty but then they break their pledge every time, and they do not fear Allah.",
            "description": [
                "This refers especially to the Jews. After",
                " arriving in Madina, the Prophet (peace be",
                " on him) concluded a treaty of mutual",
                " co-operation and good neighbourliness with them. Not",
                " only did the Prophet (peace be on",
                " him) take the initiative in this connection,",
                " he also tried his best to maintain",
                " pleasant relations with them. The Prophet (peace",
                " be on him) also felt greater affinity",
                " with the Jews than with the polytheists",
                " of Makka. As a rule he always",
                " showed preference to the customs and practices",
                " of the People of the Book over",
                " those of the polytheists. But somehow the",
                " Jewish rabbis and scholars were irked by",
                " the Prophet's preaching of pure monotheism and",
                " moral uprightness, let alone his scathing criticism",
                " of the deviations which appeared in Jewish",
                " belief and conduct. They were constantly engaged,",
                " therefore, in efforts to sabotage the new",
                " religious movement. In this respect, theyleft no",
                " stone unturned. They collaborated with the hypocrites",
                " who were apparently an integral part of",
                " the Muslim body-politic. To serve the same",
                " end they fanned flames to rejuvenate the",
                " old animosities between the Aws and Khazraj",
                " which had brought about bloodshed and fratricide",
                " in pre-Islamic times. They attempted to hatch",
                " conspiracies against Islam in collaboration with the",
                " Quraysh and other tribes. What was all",
                " the more deplorable was that they indulged",
                " in these nefarious activities despite their treaty",
                " of friendship and co-operation with the Prophet",
                " (peace be on him).",
                "When the Battle",
                " of Badr took place, they took it",
                " for granted that the Muslims would not",
                " be able to survive the very first",
                " attack of the Quraysh. However, when the",
                " outcome of the battle dashed their hopes,",
                " they became all the more spiteful. Apprehending",
                " that the victory in the Battle of",
                " Badr would help the Muslims consolidate their",
                " position, they carried out their hostile activities",
                " against Islam even more vigorously'. Ka'b b.",
                " Ashraf, a Jewish chief, went to Makka",
                " personally and recited stirring elegies for their",
                " dead warriors with a view to provoking",
                " the Quray'sh into hostile action against the",
                " Muslims. It was the same Ka'b b.",
                " Ashraf who considered the Muslim victory in",
                " the Battle of Badr such a catastrophe",
                " that he regarded death to be better",
                " than life. In his own words: 'The",
                " belly of the earth has become preferable",
                " to us than its back.' (Ibn Hisham,",
                " vol. 2. p. 51 - Ed.) Banu",
                " Qaynuqa', a Jewish tribe, in brazen violation",
                " of their agreement of friendship and alliance",
                " with the Muslims, took to indecent molestation",
                " and teasing the Muslim women who passed",
                " through their quarters. When the Prophet (peace",
                " be on him) reproached them for this",
                " shameful conduct, they threatened the Prophet (peace",
                " be on him), saying: 'Do not be",
                " deluded by your encounter with a people",
                " who had no knowledge of warfare, and",
                " so you had good luck with them.",
                " By God, if we were to wage",
                " war against you, you will know that",
                " we are the men.'(lbn Hisham, vol. 2,",
                " p. 47 - Ed.)"
            ]
        },
        {
            "verse-id": "[8:57]",
            "verse": "So if you, [O Muhammad], gain dominance over them in war, disperse by [means of] them those behind them that perhaps they will be reminded.",
            "description": [
                "The verse makes it lawful for Muslims",
                " to feel absolved of the obligations of",
                " a treaty with a people who, despite",
                " that alliance, threw the obligations of the",
                " treaty overboard and engaged in hostile actions",
                " against the Muslims. It would even be",
                " lawful for the Muslims to engage in",
                " hostilities against them. Likewise, if the Muslims",
                " are engaged in hostilities against a people",
                " and the non-Muslims who are bound in",
                " treaties of alliance or friendship with the",
                " Muslims, array themselves on the side of",
                " the enemy and fight against the Muslims,",
                " it would he lawful for the Muslims",
                " to treat them as enemies and kill",
                " them. For by their brazen violation of",
                " the obligations of the treaty concluded with",
                " their people, they had made it absolutely",
                " lawful for Muslims to disregard the terms",
                " of that treaty concerning the inviolability of",
                " the lives and properties of at least",
                " those individuals."
            ]
        },
        {
            "verse-id": "[8:58]",
            "verse": "If you [have reason to] fear from a people betrayal, throw [their treaty] back to them, [putting you] on equal terms. Indeed, Allah does not like traitors.",
            "description": [
                "According to the above verse, it is",
                " not lawful for Muslims to decide unilaterally",
                " that their treaty with an ally is",
                " annulled either because of their grievance that",
                " their ally did not fully observe the",
                " terms of the treaty in the past",
                " or on ground of the fear that",
                " he would treacherously breach it in the",
                " future. There is no justification for Muslims",
                " to make such a decision nor to",
                " behave as if no treaty bound the",
                " two parties. On the contrary, whenever the",
                " Muslims are forced into such a situation",
                " they are required to inform the other",
                " party, before embarking on any hostile action,",
                " that the treaty was terminated. This step",
                " is necessary in order that both parties",
                " are clear in their minds as to",
                " where things stand. Guided by this principle,",
                " the Prophet (peace be on him) laid",
                " down a basic rule of Islamic international",
                " law in the following words: 'Whoever is",
                " bound in treaty with a people may",
                " not dissolve it until either its term",
                " expires, or he flings it at them",
                " (i.e. publicly declares that it had been",
                " annulled).' (Abu Da'ud, 'Jihad', Babfi al-Iman yakunbaynaha",
                " al-'Aduw 'Ahad, vol. 2, p. 75; Ahmad",
                " b. Hanbal, Musnad, vol. 4, pp. 111",
                " and 113 - Ed.) The Prophet (peace",
                " be on him) further elucidated this by",
                " sayling: 'Do not be treacherous even to",
                " him who is treacherous to you' (Abu",
                " Da'ud, Kitab al-Buyu', 'Bab fi al-Rajul Ya'khudh",
                " Hakkahu man tahe Yadih', vol. 2, p.",
                " 260 - Ed.)",
                "These directives were not",
                " given merely in order that preachers might",
                " preach them from the pulpit or embellish",
                " them in religious books. On the contrary,",
                " Muslims were required to foliow these directive",
                " in their everyday lives, and they did",
                " in fact do so. Once Mu'awiyah during",
                " his reign, concentrated his troops on the",
                " borders of the Roman Empire in order",
                " to carry out a sudden attack immediately",
                " after the expiry of the treaty. 'Amr",
                " b. 'Anbasah, a Companion, strongly opposed this",
                " manoeuvre. He supported his opposition by reference",
                " to a tradition from the Prophet (peace",
                " he on him) in which he condemned",
                " such an act of treachery. Ultimately Mu'awiyah",
                " had to yield and call off his",
                " troops. (See the comments on the verse",
                " by Qurtubi and Ibn Kathir. See also",
                " Ahmad b. Hanbal, Musnad , vol. 4,",
                " pp. 113 and 389 - Ed,)",
                "To",
                " annul a treaty unilaterally and to launch",
                " an armed attack without any warning was",
                " common practice in the time of ancient",
                " jahiliyah (Ignorance). That practice remains in vogue",
                " in the civilized jahiliyah of the present",
                " day as well. Recent instances in point",
                " are the Russian invasion of Germany and",
                " the Russian and British military action against",
                " Iran during the Second World War. Such",
                " actions are usually justified on the ground",
                " that a previous warning would have put",
                " the enemy on the alert and would",
                " have enabled him to put up even",
                " stiffer resistance. It is also justified by",
                " saying that a military initiative has the",
                " effect of pre-empting a similar military initiative",
                " by the enemy. If such pleading can",
                " absolve people of their moral obligations, then",
                " every offence is justifiable. In such a",
                " case even those who commit theft, robbery,",
                " illegitimate sexual intercourse, homicide, or forgery can",
                " proffer either one pretext or the other",
                " for so doing. It is also amazing",
                " that acts which are deemed unlawful for",
                " individuals are deemed perfectly lawful when they",
                " are committed by nations.",
                "It should also",
                " be pointed out that an unannounced attack.",
                " according to Islamic law, is lawful in",
                " one situation: when the ally has clearly",
                " violated the treaty and has blatantly indulged",
                " in hostile action. Only in such an",
                " eventuality it is not binding on Muslims",
                " to first declare the dissolution of the",
                " treaty. Not only that, in such a",
                " circumstance it is also lawful to launch",
                " an unannounced military action. In deriving this",
                " legal rule, Muslim jurists have drawn on",
                " the Prophet's own conduct in regard to",
                " the Quraysh who had breached the Hudaybiyah",
                " Treaty in dealing with Bana Khuza'ah. In",
                " this instance the Prophet (peace be on",
                " him) did not notify them that the",
                " treaty had been annulled. On the contrary,",
                " he invaded Makka without warning. (See Qurtubi's",
                " comments on the verse - Ed.) Nonetheless,",
                " while acting on this exceptional provision one",
                " should be cautious and take into account",
                " the totality of circumstances in which the",
                " Prophet (peace be on him) took this",
                " step. That alone will help one to",
                " properly follow the Prophet's example. For one",
                " should try to imitate the Prophet's example",
                " in its totality rather than just one",
                " or other aspect of it depending on",
                " one's whim. What we know from the",
                " Sirah and Hadith with regard to this",
                " is the following:",
                "First, that the Quraysh",
                " had so openly violated the treaty that",
                " its annulment had become absolutely clear. Even",
                " men of the Quraysh themselves acknowledged that",
                " the treaty was no longer in operation.",
                " It is because of this realization that",
                " the Qurayrsh had deputed Abu Sufyan to",
                " Madina to negotiate for its renewal (Al-Tabari.",
                " Ta'rikh, vol. 3, p. 46 -Ed.) This",
                " fact clearly indicates that the Quraysh were",
                " in no doubt that the treaty stood",
                " dissolved. It is immaterial whether the party",
                " which annulled the treaty verbally declared so",
                " or not for it had been violated",
                " so blatantly that no room for doubt",
                " was left.",
                "Second, after the annulment of",
                " the treaty the Prophet (peace be on",
                " him) did not say anything, either in",
                " clear or ambiguous terms, which could justify",
                " the impression that he still regarded the",
                " Quraysh to be his allies or that",
                " the treaty relations with them were still",
                " intact. All relevant reports, on the contrary,",
                " suggest that when Abu Sufyan pleaded for",
                " the renewal of the treaty, the Prophet",
                " (peace be on him) did not accede",
                " to that request, (Ibn Hisham. vol. 2,",
                " p. 395 - Ed.)",
                "Third, the Prophet",
                " (peace he on him) himself initiated military",
                " action against the Quraysh and he did",
                " so openly. There was no element of",
                " duplicity or fraud in the Prophet's behaviour;",
                " there was no trace of pretence to",
                " be at peace while secretly engaging in",
                " belligerent activities.",
                "This is the full picture",
                " of the Prophet's attitude on the occasion.",
                " Hence the directive of flinging the treaty",
                " in the face of the other party",
                " as embodied in the above verse (i.e.",
                " informing the other party that the treaty",
                " had been terminated) may only be disregarded",
                " in very special circumstances such as those",
                " existing then. And should it be disregarded",
                " then this should be done in the",
                " straightforward and graceful manner adopted by the",
                " Prophet (peace be on him).",
                "Moreover, if",
                " some dispute arises with a people with",
                " whom the Muslims have a treaty and",
                " the dispute remains unresolved even after direct",
                " negotiations or international mediation; or if the",
                " other party appears bent upon forcing a",
                " military solution to the problem, it would",
                " be lawful for Muslims to resort to",
                " force. However, according to the above verse,",
                " force may be used by Muslims after",
                " making a clear proclamation of the annulment",
                " of the treaty, and that the action",
                " taken should be overt. To carry out",
                " military action by stealth is an immoral",
                " act and can nowhere be found among",
                " the teachings of Islam."
            ]
        },
        {
            "verse-id": "[8:59]",
            "verse": "And let not those who disbelieve think they will escape. Indeed, they will not cause failure [to Allah].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:60]",
            "verse": "And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy and others besides them whom you do not know [but] whom Allah knows. And whatever you spend in the cause of Allah will be fully repaid to you, and you will not be wronged.",
            "description": [
                "Muslims should he equipped with military resources",
                " and should have a standing army in",
                " a state of preparedness, in order that",
                " it may be used when needed. Never",
                " should it happen that the Muslims are",
                " caught unawares and have to hurriedly look",
                " around right and left to build up",
                " their defences and collect arms and supplies",
                " in order to meet the challenge of",
                " the enemy. For then it might be",
                " too late and the enemy might have",
                " accomplished its purpose."
            ]
        },
        {
            "verse-id": "[8:61]",
            "verse": "And if they incline to peace, then incline to it [also] and rely upon Allah. Indeed, it is He who is the Hearing, the Knowing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:62]",
            "verse": "But if they intend to deceive you - then sufficient for you is Allah. It is He who supported you with His help and with the believers",
            "description": [
                "In international dealings Muslims should not act",
                " with timidity. They should rather have faith",
                " in God and should act with courage",
                " and bravery. However, as soon as the",
                " enemy is inclined to reconciliation, they should",
                " welcome the move and should not he",
                " reluctant to make peace even if they",
                " are unsure whether or not the enemy",
                " is sincere about peace, and whether or",
                " not he intends to use the settlement",
                " as a ruse to Commit later treachery.",
                "",
                "Since it is impossible to know the",
                " true intention of others, allowance should be",
                " made for their words. If the enemy",
                " is sincere in his offer of reconcoliation,",
                " the Muslims should not continue bloodshed because",
                " his sincerity, in their eyes, is suspect.",
                " On the contrary, if the enemy is",
                " insincere, the Muslims should have courage, thanks",
                " to their trust in God, and should",
                " go forth for reconciliation. They should stretch",
                " out the hand of peace in answer",
                " to the enemy's outstretched hand, for that",
                " is an index of their moral superiority.",
                " As for the hand of friendship which",
                " has been hypocritically stretched out in enemity,",
                " Muslims should have the strength to smash",
                " that hand to pieces."
            ]
        },
        {
            "verse-id": "[8:63]",
            "verse": "And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together. Indeed, He is Exalted in Might and Wise.",
            "description": [
                "Here the allusion is to that strong",
                " bond of love and brotherhood that developed",
                " among the Arabs who embraced Islam and",
                " whose conversion brought them solidarity. This strong",
                " solidarity existed despite the fact that they",
                " came from a variety of tribes which",
                " had long-standing traditions of mutual enmity. This",
                " was a special favour of God on",
                " the Muslims, especially evident in the case",
                " of the Aws and Khazraj. It was",
                " barely a couple of years before their",
                " acceptance of Islam that the two clans",
                " virtually thirsted for each other's blood. During",
                " the battle of Bu'ath both seemed set",
                " to exterminate each other. (Ibn Hisham, vol.",
                " 1. pp. 427-8-Ed.) To turn such severe",
                " enmity into deep cordiality and brotherhood within",
                " a span of two or three years",
                " and to join together mutually repellent elements",
                " into a unity as firm as that",
                " of a solid wall as was witnessed",
                " in regards to the Muslim community during",
                " the life of Prophet (peace be upon",
                " him) was doubtlessly beyond the power of",
                " any mortal. Were anyone to depend on",
                " worldly factors alone, it would have been",
                " impossible to bring about such an achievement.",
                " God's support was the deciding factor in",
                " this development and this only serves to",
                " emphasize that Muslims should always seek and",
                " depend on God's support and favour rather",
                " than on worldly factors."
            ]
        },
        {
            "verse-id": "[8:64]",
            "verse": "O Prophet, sufficient for you is Allah and for whoever follows you of the believers.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:65]",
            "verse": "O Prophet, urge the believers to battle. If there are among you twenty [who are] steadfast, they will overcome two hundred. And if there are among you one hundred [who are] steadfast, they will overcome a thousand of those who have disbelieved because they are a people who do not understand.",
            "description": [
                "What is nowadays called morale has been",
                " described as 'understanding' in the Qur'an. The",
                " Qur'anic expression is more scientific than the",
                " currently used word 'morale'. For the word",
                " in this context refers to the one",
                " who is fully cognizant of his objective,",
                " who is quiet clear in his mind",
                " that the cause for which he has",
                " staked his life is much more valuable",
                " than his own life, and hence if",
                " that cause is left unrealized, his life",
                " will lose all its worth and meaning.",
                " Such a conscious, comitted person actually becomes",
                " many times more powerful than he who",
                " fights without any consciousness of his cause,",
                " even though the two might be comparable",
                " in physical strength. Above all, he who",
                " has a clear understanding of reality of",
                " his own being, of God, of his",
                " relationship with God, of the reality of",
                " life and death, and of life after",
                " death, who is also well aware of",
                " the difference between truth and falsehood, and",
                " of the consequences of the victory of",
                " falsehood over truth, his strength surpasses by",
                " far the strength of others for whom,",
                " even though they 'understand', their consciousness is",
                " related to nationalism or patriotism or class",
                " conflict. It is for this reason that",
                " the Qur'an declares that a believer with",
                " understanding is ten times stronger than an",
                " unbeliever. For the believer understands the truth",
                " and a non-believer does not. It may",
                " be remembered, however, that the verse also",
                " mentions another important factor in addition to",
                " 'understanding' which makes a believer much stronger",
                " than an unbeliever, and that is 'patience'.",
                ""
            ]
        },
        {
            "verse-id": "[8:66]",
            "verse": "Now, Allah has lightened [the hardship] for you, and He knows that among you is weakness. So if there are from you one hundred [who are] steadfast, they will overcome two hundred. And if there are among you a thousand, they will overcome two thousand by permission of Allah. And Allah is with the steadfast.",
            "description": [
                "This does not mean that since the",
                " faith of Muslims had declined, their ten",
                " times superiority ove the unbelievers has been",
                " reduced to twice only. What it means",
                " is that ideally a Muslim is ten",
                " times stronger than an unbeliever. However, since",
                " the Muslims had not as yet been",
                " throughly trained and had reached the desire",
                " level of maturity in their understanding, they",
                " are asked not to feel uneasy at",
                " least of challenging an enemy which is",
                " twice as strong. It should be borne",
                " in mind that the Qur'anic directive was",
                " given in 2A.H./624 C.E. when most of",
                " the Muslims, being recent converts to Islam,",
                " had undergone little trainning. As they gained",
                " maturity under the Prophet's guidance, the desired",
                " ratio of one to ten between the",
                " Muslims and the unbelievers was established. That",
                " Muslims are ten times stronger than unbelievers",
                " is a fact witnessed frequently in the",
                " battles during the life of the Prophet",
                " (peace be upon him) and of the",
                " Rightly-Guided Caliphs."
            ]
        },
        {
            "verse-id": "[8:67]",
            "verse": "It is not for a prophet to have captives [of war] until he inflicts a massacre [upon Allah 's enemies] in the land. Some Muslims desire the commodities of this world, but Allah desires [for you] the Hereafter. And Allah is Exalted in Might and Wise.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:68]",
            "verse": "If not for a decree from Allah that preceded, you would have been touched for what you took by a great punishment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:69]",
            "verse": "So consume what you have taken of war booty [as being] lawful and good, and fear Allah. Indeed, Allah is Forgiving and Merciful.",
            "description": [
                "In attempting to explain the circumstantial background",
                " of the above verse, some commentators on",
                " the Qur'an have referred to the deliberations",
                " for deciding the fate of the Quraysh",
                " captives after the Battle of Badr. In",
                " that council Abu Bakr pleaded to release",
                " the captives in return for ransom while",
                " 'Umar suggested that they should be put",
                " to the sword. Preferring Abu Bakr's suggestion,",
                " the Prophet (peace be on him) set",
                " all the captives free in return for",
                " ransom. However, God disapproved the decision as",
                " is evident from the above-quoted verse. (See",
                " Muslim, 'Jihad', 'Bab al-lmdad bi al-Mala'ikah fi",
                " Ghazwah Badr'; and the comments on verses",
                " 67 and 68 by Ibn Kathir; and",
                " on verse 67 by Jassas and Qurtubi",
                " - Ed.) The viewpoint of the commentators",
                " can be faulted on the grounds that",
                " they failed to offer any persuasive explanation",
                " of this part of the same Qur'anic",
                " verse: 'Had it not been for a",
                " previous decree from Allah.' This could mean",
                " either the Divine decree in eternity which",
                " determines all that will happen, or, God's",
                " decree in eternity to make the spoils",
                " of war lawful for the Muslims. Now,",
                " it is evident that it is unlawful",
                " to take anything from someone unless it",
                " has been declared lawful according to Revealed",
                " Law. Hence, were the above view to",
                " be accepted, it would mean that all,",
                " including the Prophet (peace be on him),",
                " had committed a sin. Such an interpretation",
                " can hardly he entertained especially since this",
                " view is dependent on the authority of",
                " isolated ('ahad) traditions.",
                "In my opinion, in",
                " order to understand the above verse it",
                " should be borne in mind that preliminary",
                " instructions about war had already been given",
                " in Surah Muhammad which was revealed before",
                " the Battle of Badr:",
                "Therefore, when you",
                " meet, the Unbelievers (in fight), smite at",
                " their necks. At length, when you have",
                " thoroughly subdued them, bind a bond firmly",
                " (on them). Thereafter, either resort to generosity",
                " or to ransom until the war lays",
                " down its burden (Muhammad 47: 4).",
                "This",
                " verse had already made it lawful for",
                " the Muslims to hold the enemy in",
                " captivity or to accept ransom contingent on",
                " the total suppression of the enemy. The",
                " Muslims had, therefore, acted in accordance with",
                " the permission granted by God to accept",
                " ransom. However, in so doing they had",
                " neglected the stipulation that the enemy should",
                " be fully subdued before the acceptance of",
                " ransom. (See the comments of Jassas on",
                " verses 67- 9-Ed.) While the Quraysh army",
                " was retreating, many Muslims took to collecting",
                " the spoils and taking the unbelievers as",
                " captives. It was only a few Muslims",
                " who chased the fleeing enemy. Had the",
                " Muslims made a concerted pursuit, a death-blow",
                " could have been struck at the Quraysh",
                " power, once and for all. God, therefore",
                " expressed His disapproal of this manner of",
                " dealing with the situation as the above-quoted",
                " verse suggests. It is obvious that it",
                " is not the Prophet (peace be on",
                " him) but the generality of Muslims at",
                " whom the reproach is directed.",
                "The purpose",
                " of the verse is to impress upon",
                " the Muslims that they had not yet",
                " imbibed the mission of the Prophet (peace",
                " be on him). Prophets are not concerned",
                " with filling their coffers with spoils and",
                " ransom money. Rather their mission is to",
                " crush the power of the unbelievers. This",
                " was not the first instance when the",
                " Muslims had showed their worldliness. They had",
                " earlier expressed their preference to raid the",
                " trade caravan to fighting against the Quraysh",
                " army. Then, rather than try to crush",
                " the enemy, they turned to collecting spoils",
                " and taking captives, and later remonstrated about",
                " the distribution of booty. Had it not",
                " been that God had granted them permission",
                " to accept ransom (see Muhammad 47: 4),",
                " He would have severely punished them on",
                " that count. God, howeve, was merciful to",
                " them and permitted them to enjoy whatever",
                " they had seized. They should, therefore, refrain",
                " from behaviour which might be displeasing to",
                " God. It is pertinent to point out",
                " that Jassas in his Ahkam al-Qur'an, considers",
                " the above view a plausible interpretation of",
                " the verse. (See the comments of Jassas",
                " on this verse, vol. 3, pp. 72-3",
                " - Ed.) Ibn Hisham also contains a",
                " report which supports the view. The report",
                " mentions that while the Muslims were engaged",
                " in seizing captives of war and collecting",
                " booty, the Prophet ( peace be on",
                " him) observed signs of disapproval on the",
                " face of Sa'd b. Mu'adh. The Prophet",
                " (peace be on him) asked him: 'O",
                " Sa'd! It appears that you do not",
                " approve of the behaviour of these people.'",
                " He replied: 'Yes, O Messenger of God!",
                " It is the first encounter in which",
                " God has caused the rout of the",
                " unbelivers. This opportunity should have been better",
                " utilized for crushing the unbelievers thoroughly rather",
                " than for amassing captives of war.' (Ibn",
                " Hisham. vol. 1, p. 628 - Ed.)",
                ""
            ]
        },
        {
            "verse-id": "[8:70]",
            "verse": "O Prophet, say to whoever is in your hands of the captives, \"If Allah knows [any] good in your hearts, He will give you [something] better than what was taken from you, and He will forgive you; and Allah is Forgiving and Merciful.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:71]",
            "verse": "But if they intend to betray you - then they have already betrayed Allah before, and He empowered [you] over them. And Allah is Knowing and Wise.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:72]",
            "verse": "Indeed, those who have believed and emigrated and fought with their wealth and lives in the cause of Allah and those who gave shelter and aided - they are allies of one another. But those who believed and did not emigrate - for you there is no guardianship of them until they emigrate. And if they seek help of you for the religion, then you must help, except against a people between yourselves and whom is a treaty. And Allah is Seeing of what you do.",
            "description": [
                "The above verse is an important provision",
                " in Islamic constitutional law. For it prescribes",
                " that any agreement on guardianship would be",
                " applicable exclusively to Muslims who are either",
                " the original inhabitants of the territory which",
                " has become Dar al-Islam (the Domain of",
                " Islam) or Muslims who have migrated to",
                " the Dar al-Islam. As to Muslims living",
                " outside the jurisdiction of the Islamic state,",
                " the bond of religious brotherhood would doubtlessly",
                " exist between them and Muslim residents of",
                " the Islamic state. The two groups, however,",
                " would not have the relationship of walayah",
                " (mutual alliance). Likewise, a walayah relationship would",
                " not exist between Muslims who do not",
                " migrate to Dar al-Islam but come to",
                " it as Muslim subjects of a non-Muslim",
                " state.",
                "The Arabic word walayah denotes the",
                " relationship of kinship, support, succour, protection, friendship,",
                " and guardianship. In the context of the",
                " present verse the word signifies the relationship",
                " of mutual support between the Islamic state",
                " and its citizens, and between the citizens",
                " themselves. Thus, this verse lays down that",
                " in a political and constitutional sense, only",
                " those Muslims who live within the territorial",
                " boundaries of the Islamic state will enjoy",
                " the privileges of walayah (guardianship) of the",
                " Islamic state. As for Muslims who are",
                " settled in a non-Islamic state, they are",
                " excluded from its political and constitutional guardianship.",
                "",
                "It is difficult to spell out in",
                " detail the implications of this rule. Just",
                " to give some idea of it. it",
                " should be pointed out that because they",
                " lack guardianship the Muslims of Dar al-Kufr",
                " (the Domain of Unbelief) cannot inherit the",
                " property of a deceased Muslim in the",
                " Islamic state. Nor may they act as",
                " guardians of Muslim citizens of an Islamic",
                " state. Nor is it lawful for a",
                " matrimonial contract to be made between Muslims,",
                " one of whom is living in an",
                " Islamic state and the other outside of",
                " it. Likewise, the Islamic state may not",
                " appoint to an office of authority those",
                " who have not surrendered their citizenship of",
                " the non-Islamic state. Above all, these provisions",
                " of Islamic law determine the foreign policy",
                " of the Islamic state. (Cf. Ibn Qudimah,",
                " al-Mughni, vol. 8, pp. 456-8 - Ed.)",
                " Since this clause restricts the role and",
                " control of the Islamic state over Muslims",
                " living within that state, the Islamic state",
                " is not obliged to look after the",
                " Muslims outside its domain. The following tradition",
                " embodies this point: 'I am acquit of",
                " every Muslim living among the polytheists.' (Abu",
                " Da'ud. 'Jihad', 'Bab al-Nahy'an, 'katl man i'tasama",
                " bi al-Sujud - Ed.) Islamic law, therefore,",
                " strikes at the root cause of the",
                " conflict which bedevils the relationship between different",
                " nations. For, whenever a state tries to",
                " champion the cause of the minority living",
                " outside its territory, it gives rise to",
                " intricate problems which cannot be resolved even",
                " by a succession of wars.",
                "*51). The",
                " above verse makes it clear that the",
                " Muslims living outside the Islamic state have",
                " no political bond with the Islamic state.",
                " This verse, however, does emphasize that those",
                " Muslims are not free of the bond",
                " of religious brotherhood. If Muslims living in",
                " a non-Islamic state are persecuted and seek",
                " help from the Islamic state or its",
                " citizens, it is incumbent upon the latter",
                " to help the persecuted Muslims.",
                "While helping",
                " one's brethren-in-faith the Muslims are expected to",
                " act scrupulously. This help should be rendered",
                " without iritermitional oblioations and with due regard",
                " to the requirements of rnoral propriety.",
                "If",
                " the Islamic state happens to be bound",
                " in a treaty relationship with a nation",
                " which inflicts wrong on Muslims, the oppressed",
                " Muslims will not be helped in a",
                " manner which is inconsistent with the moral",
                " obligations incumbent on the Islamic state as",
                " a result of that treaty .",
                "The",
                " Qur'an uses the word mithaq for treaty.",
                " This expression is a derivative of an",
                " Arahic word which stands for trust and",
                " confidence. The expression, therefore, implies that the",
                " two parties trust each other, that there",
                " is no difference between-them irrespective of whether",
                " a no-war agreement has been formally, concluded",
                " or not.",
                "The actual words of the",
                " verse \"bainakum wa bainahum mithaq\" ('[unless there",
                " be] a pact between you and them')",
                " make it plain that the treaty concluded",
                " by the Islamic state with a non-Muslim",
                " state does not merely bind the two",
                " governments. The moral obligations arising from that",
                " treaty are binding upon the Muslim nation",
                " as a whole including its individuals not",
                " to violate the obligations of the treaty",
                " into which an Islamic state has entered",
                " with some other state. However, it is",
                " only the Muslims of the Islamic state",
                " who are bound by the agreement signed",
                " by the Islamic state. Muslims living outside",
                " the Islamic state have no such obligations.",
                " This accounts for the fact that Abu",
                " Basir and Abu Jandal were not bound",
                " by the Hudaybiyah treaty concluded between the",
                " Prophet (peace he on him) and the",
                " Makkan unbelievers."
            ]
        },
        {
            "verse-id": "[8:73]",
            "verse": "And those who disbelieved are allies of one another. If you do not do so, there will be fitnah on earth and great corruption.",
            "description": [
                "If the words 'unless you also help",
                " one another' in the verse are regarded",
                " as a continuation of the preceding verse,",
                " they would mean that if Muslims do",
                " not support each other in the way,",
                " unbelielers do, this would give rise to",
                " much mischief and disorder in the world.",
                " However, if these words are considered to",
                " be connected with the directives embodied in",
                " verse 72 onwards, their purpose would be",
                " to emphasize that the world would become",
                " full of mischief and disorder if the",
                " Muslims of Dar al-Islam (a) failed to",
                " help one another; (b) failed to provide",
                " political support and protection to the Muslims",
                " who have settled down in non-Islamic states",
                " and have not migrated to Dar al-lslam;",
                " (c) failed to help the Muslims living",
                " under oppression in territories outside Dar al-Islam",
                " when they ask for it, and (d)",
                " failed to sever their friendly ties with",
                " the unbelievers."
            ]
        },
        {
            "verse-id": "[8:74]",
            "verse": "But those who have believed and emigrated and fought in the cause of Allah and those who gave shelter and aided - it is they who are the believers, truly. For them is forgiveness and noble provision.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[8:75]",
            "verse": "And those who believed after [the initial emigration] and emigrated and fought with you - they are of you. But those of [blood] relationship are more entitled [to inheritance] in the decree of Allah. Indeed, Allah is Knowing of all things.",
            "description": [
                "The purpose of the verse is to",
                " make it clear that the basis of",
                " inheritance is blood relationship and marriage rather",
                " than the mere bond of Islamic brotherhood.",
                " What occasioned this statement was the misunderstanding",
                " which had arisen after migration to Madina,",
                " when the Prophet (peace be on him)",
                " established fraternal relations between the Ansar and",
                " the Muhajirun and made pairs of them",
                " declaring that they were 'brothers' of each",
                " other. (See Ibn Hisham, vol. 1, pp.",
                " 504-6 - Ed.)"
            ]
        }
    ]
}