{
    "name": "Abasa",
    "verse-count": 42,
    "verse-info": [
        {
            "id": "[80:1]",
            "verse": "The Prophet frowned and turned away",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:2]",
            "verse": "Because there came to him the blind man, [interrupting].",
            "description": [
                "The style of this first sentence is",
                " elegant and subtle. Although in the following",
                " sentences the Holy Prophet (upon whom be",
                " peace) has been directly addressed, which by",
                " itself shows that the act of frowning",
                " and turning aside had issued forth from",
                " him, the discourse has been opened in",
                " a manner as though it was not",
                " he but some one else who had",
                " so acted. By this style the Holy",
                " Prophet (upon whom be peace), by a",
                " subtle method, has been made to realize",
                " that it was an act unseemly for",
                " him. Had somebody familiar with his high",
                " morals witnessed it, he would have thought",
                " that it was not he but some",
                " other person who had behaved in that",
                " manner. The blind man referred to here",
                " implies, as we have explained in the",
                " Introduction, the well-known Companion, Hadrat Ibn Umm",
                " Maktum. Hafiz Ibn 'Abdul Barr in Al-Isti'ab",
                " and Hafiz Ibn Hajar in AI-Isbah have",
                " stated that he was a first cousin",
                " of the Holy Prophet's wife, Hadrat Khadijah.",
                " His mother, Umm Maktum, and Hadrat Khadijah's",
                " father, Khuwailid, were sister and brother to",
                " each other. After one knows his relationship",
                " with the Holy Prophet, there remains no",
                " room for the doubt that he had",
                " turned away from him regarding him as",
                " a poor man having a low station",
                " in life, and attended to the high-placed",
                " people, for he was the Holy Prophet's",
                " brother-in-law and a man of noble birth.",
                " The reason why the Holy Prophet had",
                " shown disregard for him is indicated by",
                " the word a ma (blind man), which",
                " Allah Himself has used as the cause",
                " of the Holy Prophet's inattention. That is,",
                " the Holy Prophet thought that even if",
                " a single man from among the people",
                " whom he was trying to bring to",
                " the right path, listened to him and",
                " was rightly guided, be could become a",
                " powerful means of strengthening Islam. On the",
                " contrary, Ibn Umm Maktum was a blind",
                " man, who could not prove to be",
                " so useful for Islam because of his",
                " disability as could one of the Quraish",
                " elders on becoming a Muslim. Therefore, he",
                " should not interrupt the conversation at that",
                " time; whatever he wanted to ask or",
                " learn, he could ask or learn at",
                " some later time."
            ]
        },
        {
            "id": "[80:3]",
            "verse": "But what would make you perceive, [O Muhammad], that perhaps he might be purified",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:4]",
            "verse": "Or be reminded and the remembrance would benefit him?",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:5]",
            "verse": "As for he who thinks himself without need,",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:6]",
            "verse": "To him you give attention.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:7]",
            "verse": "And not upon you [is any blame] if he will not be purified.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:8]",
            "verse": "But as for he who came to you striving [for knowledge]",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:9]",
            "verse": "While he fears [Allah],",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:10]",
            "verse": "From him you are distracted.",
            "description": [
                "This is the real point which the",
                " Holy Prophet (upon whom be peace) had",
                " overlooked in the preaching of Islam on",
                " that occasion, and for teaching him the",
                " same Allah first reproved him on his",
                " treatment of Ibn Umm Maktum, and then",
                " ' told him what really deserved to",
                " occupy his attention as preacher of the",
                " Truth and what did not. There is",
                " a man whose apparent state clearly shows",
                " that he is a seeker after truth:",
                " he fears lest he should follow falsehood",
                " and invite Allah's wrath; therefore, he comes",
                " all the way in search of the",
                " knowledge of the true faith. There is",
                " another man, whose attitude clearly reflects that",
                " he has no desire for the truth;",
                " rather on the contrary, he regards himself",
                " as self-sufficient, having no desire to be",
                " guided to the right way. Between these",
                " two kinds of men one should not",
                " see whose becoming a Muslim would be",
                " of greater use for Islam and whose",
                " becoming a believer could not be of",
                " any use in its propagation. But one",
                " should see as to who was inclined",
                " to accept the guidance and reform himself,",
                " and who was least interested in this",
                " precious bargain. The first kind of man,",
                " whether he is blind, lame, crippled. or",
                " an indigent mendicant, who might apparently seem",
                " incapable of rendering any useful service in",
                " the propagation of Islam, is in any",
                " case a .valuable man for the preacher",
                " to the Truth. To him therefore he",
                " should attend, for the real object of",
                " this invitation is to reform the people,",
                " and the apparent state of the person",
                " shows that if he was instructed he",
                " would accept guidance. As for the other",
                " kind of man, the preacher has no",
                " need to pursue him, no matter how",
                " influential he is in society. For his",
                " attitude and conduct openly proclaim that he",
                " has no desire for reform; therefore, any",
                " effort made to reform him would be",
                " mere waste of time. If he has",
                " no desire to reform himself, he may",
                " nor the loss would be his, the",
                " preacher would not at all be accountable",
                " for it."
            ]
        },
        {
            "id": "[80:11]",
            "verse": "No! Indeed, these verses are a reminder;",
            "description": [
                "That is, \"You should never do so:",
                " do not give undue importance to those",
                " who have forgotten God and become proud",
                " of their high worldly position. The teaching",
                " of Islam is not such that it",
                " should be presented solicitously before him who",
                " spurns it, nor should a man like",
                " you try to invite these arrogant people",
                " to Islam in a way as may",
                " cause them the misunderstanding that you have",
                " a selfish motive connected with them, and",
                " that your mission would succeed only if",
                " they believed, otherwise not, whereas the fact",
                " is that the Truth is as self-sufficient",
                " of them as they are of the",
                " Truth.\"",
                "*4) The allusion is to the",
                " Qur'an."
            ]
        },
        {
            "id": "[80:12]",
            "verse": "So whoever wills may remember it.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:13]",
            "verse": "[It is recorded] in honored sheets,",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:14]",
            "verse": "Exalted and purified,",
            "description": [
                "\"Purified\" : free from all kinds of",
                " mixtures of false ideas and thoughts, and",
                " presenting nothing but the pure Truth. There",
                " is no tinge whatever in these scrolls",
                " of the impurities with which the other",
                " religious boors of the we -ld have",
                " boon polluted. They have been kept pure",
                " and secure from all kinds of human",
                " speculation and evil suggestions."
            ]
        },
        {
            "id": "[80:15]",
            "verse": "[Carried] by the hands of messenger-angels,",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:16]",
            "verse": "Noble and dutiful.",
            "description": [
                "This refers to the angels who were",
                " writing the scrolls of the Qur'an under",
                " the direct guidance of Allah, were guarding",
                " them and conveying them intact to the",
                " Holy Prophet (upon whom be peace). Two",
                " words have been used to qualify them:",
                " karim, i.e. noble, and barr, i.e. virtuous.",
                " The first word is meant to say",
                " that they are . so honoured and",
                " noble that it is not possible that",
                " such exalted beings would commit even the",
                " slightest dishonesty in the trust reposed in",
                " them. The second word has been used",
                " to tell that they carry out the",
                " responsibility entrusted to them of writing down",
                " the scrolls, guarding them and conveying them",
                " to the Messenger with perfect honesty and",
                " integrity.",
                "*7) If the context in which",
                " these verses occur, is considered deeply, it",
                " becomes obvious that here the. Qur'an has",
                " not been praised for the sake of",
                " its greatness and glory but to tell",
                " the arrogant people, who were repudiating its",
                " message with contempt, plainly: \"The glorious Qur'an",
                " is too holy and exalted a Book",
                " to be presented before you humbly with",
                " the request that you may kindly accept",
                " it if you so please. For it",
                " dces not stand in need of you",
                " as you stand in need of it.",
                " If you really seek your well-being, you",
                " should clear your head of the evil",
                " thoughts and submit to its message humbly;",
                " otherwise you are not so self-sufficient of",
                " this Book as this Book is self-sufficient",
                " of you. Your treating it with scorn",
                " and contempt will not affect its glory",
                " and greatness at all, rather your own",
                " pride and arrogance will be ruined on",
                " account of it."
            ]
        },
        {
            "id": "[80:17]",
            "verse": "Cursed is man; how disbelieving is he.",
            "description": [
                "From here the rebuke turns directly against",
                " the disbelievers, who were treating the message",
                " of the Truth with scant attention. Before",
                " this, from the beginning of the Surah",
                " to verse 16, the address though apparently",
                " directed to the Holy Prophet (upon whom",
                " be peace), was actually meant to reprimand",
                " the disbelievers, as if to say: \"O",
                " Prophet, why are you ignoring a seeker",
                " after truth and paying all your attention",
                " to those who are worthless from your",
                " mission's point of view? they do not",
                " deserve that a great Prophet like you",
                " should present a sublime thing like the",
                " Qur'an before them.\"",
                "*9) At all such",
                " places in the Qur'an, \"man\" does not",
                " imply every individual of the human race",
                " but the people whose evil traits of",
                " character are intended to be censured. At",
                " some places the word \"tnan\" is used",
                " because the evil traits are found in",
                " most of human beings, and at others",
                " for the reason that if the particular",
                " people are pin-pointed for censure, it engenders",
                " stubbornness. Therefore, admonition is given in general",
                " terms so as to be more effective.",
                " (For further explanation, see E.N. 65 of",
                " Ha Mim As-Sajdah, E.N. 75 of Ash-Shura).",
                "",
                "*10) Another meaning also can be: \"What",
                " caused him to be inclined to kufr?\"",
                " Or, in other words: \"On what strength",
                " dces he commit kufr?' Kufr?\" hen means",
                " denial of the Truth as well as",
                " ingratitude for the favours of one's benefactor",
                " and also rebellious attitude against one's Creator,",
                " Providence and Master."
            ]
        },
        {
            "id": "[80:18]",
            "verse": "From what substance did He create him?",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:19]",
            "verse": "From a sperm-drop He created him and destined for him;",
            "description": [
                "That is, let him first consider out",
                " of what he was created, where he",
                " was nourished and developed, by what way",
                " he came into the world, and from",
                " what helpless state he began his life",
                " in the world. Why dces he forget",
                " his such beginning and becomes involved in",
                " conceit and haughtiness and why does he",
                " feel so puffed up as to resist",
                " his Creator and stand before Him as",
                " an adversary? (The same theme has been",
                " expressed in Ya Sin 77-78 above).",
                "*12)",
                " That is, he was yet developing and",
                " taking shape in his mother's womb when",
                " his destiny was set for him. It",
                " was determined what would be his sex,",
                " his colour, his size; the extent and",
                " volume of his body, the extent to",
                " which his limbs would be sound or",
                " unsound, his appearance and voice, the degree",
                " of Physical strength and mental endowments, what",
                " would be the land, the family, the",
                " conditions and environments in which he would",
                " take birth, develop and be moulded into",
                " a specific person, what would be the",
                " hereditary influences and effects of the surroundings",
                " and the role and impact of his",
                " own self in the make-up of his",
                " personality, the part he would play in",
                " his life of the world, and how",
                " long he would be allowed to function",
                " on the earth. He cannot swerve even",
                " a hair-breadth from his destiny, nor can",
                " effect the slightest alteration in it. Then,",
                " how strange is his daring and stubbornness!",
                " He commits disbelief of the Creator before",
                " Whose destiny he is so helpless and",
                " powerless!"
            ]
        },
        {
            "id": "[80:20]",
            "verse": "Then He eased the way for him;",
            "description": [
                "That is, He created all those means",
                " and provisions in the world, which he",
                " could utilize, otherwise all the capabilities of",
                " his body and mind would have remained",
                " useless, had not the Creator provided the.",
                " means and created the possibilities on the",
                " earth to employ them. Furthermore, the Creator",
                " also gave him the opportunity to choose",
                " and adopt for himself whichever of the",
                " ways, good or evil, of gratitude or",
                " ingratitude, of obedience or disobedience, that he",
                " pleased. He opened up both the ways",
                " before him and made each way smooth",
                " and easy so that he could follow",
                " any way that he liked."
            ]
        },
        {
            "id": "[80:21]",
            "verse": "Then He causes his death and provides a grave for him.",
            "description": [
                "That is, not only in the matter",
                " of birth and destiny but in the",
                " matter of death also he is absolutely",
                " helpless before his Creator. Neither he can",
                " take birth by his choice nor die",
                " by his choice, nor can defer his",
                " death even by a moment. He dies",
                " precisely at the appointed time, in the",
                " appointed place, under the appointed circumstances that",
                " have been decreed for his death, and",
                " he is deposited in the type of",
                " grave destined for him whether it is",
                " the belly of the earth, the depths",
                " of the sea, a bonfire. or the",
                " stomach of a beast. Nothing to say",
                " of the man, even the whole world",
                " together cannot change the Creator's decree in",
                " respect of any person."
            ]
        },
        {
            "id": "[80:22]",
            "verse": "Then when He wills, He will resurrect him.",
            "description": [
                "That is, he does not either have",
                " the power to refuse to rise up",
                " when the Creator may will to resurrect",
                " him after death. When he was first",
                " created, he was not consulted: he was",
                " not asked whether he wanted to be",
                " created or not. Even if he had",
                " refused, he would have been created. Likewise,",
                " his resurrection also is not dependent upon",
                " his will and assent that he may",
                " rise from death if he so likes,",
                " or refuse to rise if he does",
                " not like. In this matter also he",
                " is absolutely helpless before the Creator's will.",
                " Whenever He wills He will resurrect him,",
                " and he will have to rise whether",
                " he likes it or not."
            ]
        },
        {
            "id": "[80:23]",
            "verse": "No! Man has not yet accomplished what He commanded him.",
            "description": [
                "\"Duty\" implies the duty that Allah has",
                " enjoined on every man in the form",
                " of natural guidance as well as the",
                " duty to which man's own existence and",
                " every particle of the universe, from the",
                " earth to the heavens, and every manifestation",
                " of Divine power are pointing, and that",
                " duty also which Allah has conveyed in",
                " every age through His Prophets and Books",
                " and disseminated through the righteous people of",
                " every period. (For explanation, see E.N. 5",
                " of Surah Ad- Dahr). In the present",
                " context the object is to express the",
                " meaning that on the basis of the",
                " truths stated in the above verses, it",
                " was man's duty to have obeyed his",
                " Creator, but, contrary to this, he adopted",
                " the way of disobedience and did not",
                " fulfil the demand of his being His",
                " creature."
            ]
        },
        {
            "id": "[80:24]",
            "verse": "Then let mankind look at his food -",
            "description": [
                "That is, let him consider the food,",
                " which he regards as an ordinary thing,",
                " how it is created. Had God not",
                " provided the means for it, it was",
                " not in the power of man himself",
                " to have created the food on the",
                " earth in any way."
            ]
        },
        {
            "id": "[80:25]",
            "verse": "How We poured down water in torrents,",
            "description": [
                "This refers to rainwater: water vapours are",
                " raised in vast quantities from the oceans",
                " by the heat of the sun: then",
                " they are turned into thick clouds; then",
                " the winds blow and spread them over",
                " different parts of the earth; then because",
                " of the coolness in the upper atmosphere",
                " the vapours turn back to water and",
                " fall as rain in every area in",
                " a particular measure. The water not only",
                " falls as rain directly on the earth",
                " but also collects underground in the shape",
                " of wells and fountains, flows in the",
                " form of rivers and streams, freezes on",
                " the mountains as snow and melts and",
                " flows into rivers in other seasons as",
                " well than the rainy season. Has man",
                " himself made all these arrangements? Had his",
                " Creator not arranged this for his sustenance,",
                " could man survive on the earth ?",
                ""
            ]
        },
        {
            "id": "[80:26]",
            "verse": "Then We broke open the earth, splitting [it with sprouts],",
            "description": [
                "\"Cleaving the earth asunder\" implies cleaving it",
                " in a way that the seeds, or",
                " seed-stones, or vegetable seedlings that man sows",
                " or plants in it, or which are",
                " deposited in it by winds or birds,",
                " or by some other means, should sprout",
                " up. Man can do nothing more than",
                " to dig the soil, or plough it,",
                " and bury in it the seeds that",
                " God has already created. Beyond this everything",
                " is done by God. It is He",
                " Who has created the seeds of countless",
                " species of vegetable; it is He Who",
                " has endowed these seeds with the quality",
                " that when they are sown in the",
                " soil, they should sprout up and from",
                " every seed vegetable of its own particular",
                " species should grow. Again it is He",
                " Who has created in the earth the",
                " capability that in combination with water it",
                " should break open the seeds and develop",
                " and nourish every species of vegetable with",
                " the kind of food suitable for it.",
                " Had God not created the seeds with",
                " these qualities and the upper layers of",
                " the earth with these capabilities, man could",
                " not by himself have arranged any kind",
                " of food on the earth."
            ]
        },
        {
            "id": "[80:27]",
            "verse": "And caused to grow within it grain",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:28]",
            "verse": "And grapes and herbage",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:29]",
            "verse": "And olive and palm trees",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:30]",
            "verse": "And gardens of dense shrubbery",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:31]",
            "verse": "And fruit and grass -",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:32]",
            "verse": "[As] enjoyment for you and your grazing livestock.",
            "description": [
                "That is, \"A means of sustenance not",
                " only for you but also for those",
                " animals from which you obtain items of",
                " food like meat, fat, milk, butter, etc.",
                " and which perform countless other services also",
                " for your living. You benefit by all",
                " this and yet you disbelieve in God",
                " Whose provisions sustain you.\""
            ]
        },
        {
            "id": "[80:33]",
            "verse": "But when there comes the Deafening Blast",
            "description": [
                "The final terrible sounding of the Trumpet",
                " at which all dead men shall be",
                " ressurected to life."
            ]
        },
        {
            "id": "[80:34]",
            "verse": "On the Day a man will flee from his brother",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:35]",
            "verse": "And his mother and his father",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:36]",
            "verse": "And his wife and his children,",
            "description": [
                "A theme closeay resembling this has already",
                " occurred in AI-Ma'arij: 10-14 above. \"Fleeing\" may",
                " also mean that when he sees those",
                " nearest and dearest to him in the",
                " .world, involved in distress, instead of rushing",
                " forth to help them, he will run",
                " away from them lest they should call",
                " out to him for help; and it",
                " may also mean that when they see",
                " the evil consequences of committing sin for",
                " the sake of one another and misleading",
                " one another, fearless of God and heedless",
                " of the Hereafter, in the world, each",
                " one would flee from the other lest",
                " the other should hold him responsible for",
                " his deviation and sin. Brother will fear",
                " brother, children their parents, husband his wife,",
                " and parents their children lest they should",
                " become witnesses in the case against them.",
                ""
            ]
        },
        {
            "id": "[80:37]",
            "verse": "For every man, that Day, will be a matter adequate for him.",
            "description": [
                "A tradition has been reported in the.",
                " Hadith by different methods and through different",
                " channels, saying that the Holy Prophet (upon",
                " whom be peace) said: \"On the Day",
                " of Resurrection all men will rise up",
                " naked.\" One of his wives (according to",
                " some reporters, Hadrat `A'ishah, according to others,",
                " Hadrat Saudah, or a woman) asked in",
                " bewilderment: \"O Messenger of Allah, shall we",
                " (women) appear naked on that Day before",
                " the people ?' The Holy prophet recited",
                " this very verse and explained that on",
                " that Day each one will have enough",
                " of his own troubles to occupy him,",
                " and will be wholly unmindful of others.",
                " (Nasa'i, Tirmidhi, Ibn Abi Hatim, Ibn Jarir,",
                " Tabarani Ibn Marduyah, Baihaqi, Hakim)."
            ]
        },
        {
            "id": "[80:38]",
            "verse": "[Some] faces, that Day, will be bright -",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:39]",
            "verse": "Laughing, rejoicing at good news.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:40]",
            "verse": "And [other] faces, that Day, will have upon them dust.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:41]",
            "verse": "Blackness will cover them.",
            "description": [
                ""
            ]
        },
        {
            "id": "[80:42]",
            "verse": "Those are the disbelievers, the wicked ones.",
            "description": [
                ""
            ]
        }
    ]
}