{
    "name": "Al-Infitar",
    "verse-count": 19,
    "verse-info": [
        {
            "id": "[82:1]",
            "verse": "When the sky breaks apart",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:2]",
            "verse": "And when the stars fall, scattering,",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:3]",
            "verse": "And when the seas are erupted",
            "description": [
                "In Surah At-Takwir it has been said:",
                " \"When the oceans are set ablaze,\" and",
                " here: \"When the oceans are torn apart.\"",
                " When the two verses are read together,",
                " and this fact also is kept in",
                " view that even according to the Qur'an",
                " a terrible earthquake will occur on the",
                " Resurrection Day, which will shake up the",
                " entire earth alI at once, the state",
                " of the splitting of the oceans and",
                " their being set ablaze ' seems to",
                " be as follows: first, because of the",
                " terrible convulsion, the bottom of the oceans",
                " will split asunder and their water will",
                " start sinking into the interior of the",
                " earth where an intensely hot lava is",
                " constantly boiling up. Coming into contact with",
                " the lava, water will dissolve into its",
                " two constituent parts, oxygen which helps combustion,",
                " and hydrogen, which is itself combustible. Thus,",
                " in the process pf dissolution and combustion,",
                " a chain reaction will start, which will",
                " set all the oceans 'of the world",
                " ablaze. This is our conjecture, the correct",
                " knowledge is only with Allah."
            ]
        },
        {
            "id": "[82:4]",
            "verse": "And when the [contents of] graves are scattered,",
            "description": [
                "In the first three verses, the first",
                " stage of the Resurrection has been mentioned,",
                " and in this verse the second stage",
                " is being described. \"Opening of the graves\"",
                " implies resurrection of the dead then."
            ]
        },
        {
            "id": "[82:5]",
            "verse": "A soul will [then] know what it has put forth and kept back.",
            "description": [
                "The words ma qaddamat wa akhkharat can",
                " have several meanings and all are implied",
                " here: (1) Ma qaddamat is the good",
                " or evil act which man has sent",
                " forward, and ma akhkharat is what he",
                " refrained from doing. Thus, these Arabic words",
                " correspond to the acts of commission and",
                " omission in one's life. (2) Ma qaddainat",
                " is what one did earlier and ma",
                " akhkharat what one did later; i.e. the",
                " whole life-work of man will appear before",
                " him date-wise and in proper sequence (3)",
                " Whatever good and evil deeds a man",
                " did in his life is ma qaddamat",
                " and whatever effects and influences of his",
                " acts he left behind for human society",
                " is ma akhkharat."
            ]
        },
        {
            "id": "[82:6]",
            "verse": "O mankind, what has deceived you concerning your Lord, the Generous,",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:7]",
            "verse": "Who created you, proportioned you, and balanced you?",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:8]",
            "verse": "In whatever form He willed has He assembled you.",
            "description": [
                "That is, \"In the first place, the",
                " bounty and favour of your Beneficent Sustainer",
                " required that you should have acknowledged his",
                " bounties and become an obedient servant and",
                " should have felt shy of disobeying Him,",
                " but you were deluded into thinking that",
                " you have become whatever you are by",
                " your own effort, and you never thought",
                " that you should acknowledge that favour of",
                " Him Who gave you life. Secondly, it",
                " is your Lord's bounty and kindness that",
                " you can freely do whatever you like",
                " in the world and it never so",
                " happens that whenever you happen to commit",
                " an error, He should punish you with",
                " paralysis, or blind your eyes, or cause",
                " lightning to strike you. But you took",
                " His bountifulness for weakness and were beguiled",
                " into thinking that the Kingdom of your",
                " God was devoid of justice \""
            ]
        },
        {
            "id": "[82:9]",
            "verse": "No! But you deny the Recompense.",
            "description": [
                "That is, \"There is no reasonable ground",
                " for you to be deluded. Your own",
                " physical existence itself tells that you did",
                " not come into being by yourself; your",
                " parents also did not make you. Man",
                " also did not come about as a",
                " result of the elements combining together by",
                " themselves accidentally; but a Wise and Powerful",
                " God has composed you into this perfect",
                " human shape and form. There are other",
                " kinds of animals in the world compared",
                " with which your excellent form and structure",
                " and your superior powers and faculties stand",
                " out in sharp contrast. Reason demanded that",
                " in view of all this you should",
                " have submitted gratefully and should never have",
                " dared commit disobedience of your beneficent Sustainer.",
                " You also know that your Lord and",
                " Sustainer is not only Compassionate and Bountiful",
                " but Almighty and Omnipotent as well. When",
                " an earthquake, cyclone or flood occurs by",
                " His Command, all your devices and measures",
                " tail to be effective. You also know",
                " that your Lord and Sustainer is not",
                " ignorant and foolish but Wise and knowing,",
                " and the necessary demand of wisdom and",
                " knowledge is that whoever is given intellect",
                " should also be held responsible for his",
                " acts; whoever is given powers should also",
                " be held accountable as to how he",
                " used those powers; and whoever is given",
                " the choice to do good or evil",
                " on his own responsibility, should also be",
                " rewarded for his good act and punished",
                " for his evil act. All these truths",
                " are clearly and plainly known to you;",
                " therefore, you cannot say that there exists",
                " a reasonable ground for you to be",
                " deluded concerning your Lord. Your own nature",
                " is sufficient evidence that the beneficence of",
                " the Master should never cause the servant",
                " to be fearless of Him, and be",
                " involved in the misunderstanding that he may",
                " do whatever he pleases, no one can",
                " harm him in any way.",
                "*6) That",
                " is,\"You have not been deluded and beguiled",
                " by any good reason but by your",
                " foolish concept that there is going to",
                " be no meting out of rewards and",
                " punishments after the life of this world.",
                " It is this wrong and baseless concept",
                " which has made you heedless of God,",
                " fearless of His justice and irresponsible in",
                " your moral attitude. \""
            ]
        },
        {
            "id": "[82:10]",
            "verse": "And indeed, [appointed] over you are keepers,",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:11]",
            "verse": "Noble and recording;",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:12]",
            "verse": "They know whatever you do.",
            "description": [
                "That is, \"whether you deny the meting",
                " out of rewards and punishments, belie it,",
                " or mock it, the reality cannot change.",
                " The reality is .that your Lord has",
                " not left you to your self in",
                " the world, but has appointed over each",
                " one of you honest and upright guardians,",
                " who are recording objectively and faithfully all",
                " your good and evil acts, and none",
                " of your acts is hidden from them,",
                " whether you commit it in darkness, or",
                " in private, or in far off jungles,",
                " or in secret when you are fully",
                " satisfied that whatever you have done bas",
                " remained hidden from human eye. For these",
                " guardian angels Allah has used the words",
                " kiram-an katibin, i.e. writers who are honorable",
                " and noble They are neither attached in",
                " personal love with somebody, nor are inimical",
                " to anybody, so that they would prepare",
                " a fictitious record on the basis of",
                " their favouring one man and disfavouring another",
                " unduly. They are neither dishonest that without",
                " being present on duty they would make",
                " wrong entries by themselves; nor are they",
                " bribable so that they would take bribes",
                " and make false reports in favour of",
                " or against somebody. They are far above",
                " these moral weaknesses. Therefore, both the good",
                " and the bad people should be fully",
                " satisfied that each man's good acts will",
                " be recorded without any omission, and no",
                " one will have an evil act recorded",
                " in his account which he has not",
                " done. Then the second quality that has",
                " been mentioned of these angels is: \"They",
                " know whatever you do \" That is,",
                " they are not like the secret, intelligence",
                " agencies of the world, from which, despite",
                " all their search and scrutiny, many things",
                " remain hidden. They are fully aware of",
                " everyone's deeds. They accompany every person, at",
                " all places, under all conditions, in such",
                " a way that he himself does not",
                " know that someone is watching him, and",
                " they also know with what intention has",
                " somebody done a certain thing. Therefore the",
                " record prepared by them is a complete",
                " record in which nothing has been left",
                " un-recorded. About this very thing it has",
                " been said in Surah Al-Kahf 49: \"Woe",
                " to us! What sort of a book",
                " it is, it has left mothing unrecorded",
                " of our doings, small or great. They",
                " will see before them everything, whatever they",
                " had done.\""
            ]
        },
        {
            "id": "[82:13]",
            "verse": "Indeed, the righteous will be in pleasure,",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:14]",
            "verse": "And indeed, the wicked will be in Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:15]",
            "verse": "They will [enter to] burn therein on the Day of Recompense,",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:16]",
            "verse": "And never therefrom will they be absent.",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:17]",
            "verse": "And what can make you know what is the Day of Recompense?",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:18]",
            "verse": "Then, what can make you know what is the Day of Recompense?",
            "description": [
                ""
            ]
        },
        {
            "id": "[82:19]",
            "verse": "It is the Day when a soul will not possess for another soul [power to do] a thing; and the command, that Day, is [entirely] with Allah.",
            "description": [
                "That is, no one there will have",
                " the power to save anyone from suffering",
                " the consequences of his deeds; no one",
                " there will be so influential, strong, or",
                " such a favourite with AIIah that he",
                " should behave stubbornly in the Divine Court",
                " and say: \"Such and such a one",
                " is a close relative or associate of",
                " mine; he will have to be forgiven,",
                " no matter what evils He might have",
                " committed in the world.\""
            ]
        }
    ]
}