{
    "name": "Al-Mutaffifin",
    "id": 83,
    "verse-count": 36,
    "verse-info": [
        {
            "verse-id": "[83:1]",
            "verse": "Woe to those who give less [than due],",
            "description": [
                "In the original the word mutaffifin has",
                " been used, which is derived from tatfif,",
                " a word used for an inferior and",
                " base thing in Arabic. Terminologically, tatfif is",
                " used for giving short weight and short",
                " measure fraudulently, for the person who acts",
                " thus while measuring or weighing, does not",
                " defraud another by any substantial amount, but",
                " skimps small amounts from what is due",
                " to every customer cleverly, and the poor",
                " customer dces not know of what and",
                " of how much he is being deprived",
                " by the seller."
            ]
        },
        {
            "verse-id": "[83:2]",
            "verse": "Who, when they take a measure from people, take in full.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:3]",
            "verse": "But if they give by measure or by weight to them, they cause loss.",
            "description": [
                "At several places in the Qur'an giving",
                " of short measure and weight has been",
                " condemned and measuring fully and weighing rightly",
                " has been stressed. In Surah AI-An'am, it",
                " has been enjoined: \"You should use a",
                " full measure and a just balance. We",
                " charge one only with that much responsibility",
                " that one can bear.\" (v. 152). In",
                " Surah Bani Isra'il it has been said:",
                " \"Give full measure when you measure and",
                " weigh with even scales.\" (v. 35). In",
                " Surah Ar-Rehman it has been stressed: Do",
                " not upset the balance: weigh with equity",
                " and do not give short weight.\" (vv.",
                " 8-9). The people of the Prophet Shu`aib",
                " were punished for the reason that the",
                " evil of giving short measure and weight",
                " had become widespread among them and in",
                " spite of his counsel and advice they",
                " did not refrain from it."
            ]
        },
        {
            "verse-id": "[83:4]",
            "verse": "Do they not think that they will be resurrected",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:5]",
            "verse": "For a tremendous Day -",
            "description": [
                "\"A Great Day\": the Day of Resurrection",
                " when all men and jinn will be",
                " called to account together in the Divine",
                " Court and decisions of vital importance will",
                " be made pertaining to rewards and punishments.",
                ""
            ]
        },
        {
            "verse-id": "[83:6]",
            "verse": "The Day when mankind will stand before the Lord of the worlds?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:7]",
            "verse": "No! Indeed, the record of the wicked is in sijjeen.",
            "description": [
                "That is, \"These people are wrong in",
                " thinking that they will be let off",
                " without being called to account when they",
                " have committed such and such crimes in",
                " the world. \"",
                "*5) The word sijjin",
                " in the original is derived from sijn",
                " (a prison) and the explanation of it",
                " that follows shows that it implies the",
                " general Register in which the actions and",
                " deeds of the people worthy of punishment",
                " are being recorded."
            ]
        },
        {
            "verse-id": "[83:8]",
            "verse": "And what can make you know what is sijjeen?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:9]",
            "verse": "It is [their destination recorded in] a register inscribed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:10]",
            "verse": "Woe, that Day, to the deniers,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:11]",
            "verse": "Who deny the Day of Recompense.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:12]",
            "verse": "And none deny it except every sinful transgressor.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:13]",
            "verse": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"",
            "description": [
                "\"Our Revelations\": those verses in which news",
                " of the Day of Recompense has been",
                " given."
            ]
        },
        {
            "verse-id": "[83:14]",
            "verse": "No! Rather, the stain has covered their hearts of that which they were earning.",
            "description": [
                "That is, they have no good reason",
                " for regarding the meting out of rewards",
                " and punishments as unreal. What has made",
                " them say this, is that their hearts",
                " have become rusty because of their sins;",
                " therefore, a thing which is thoroughly reasonable",
                " appears unreal and unreasonable to them. The",
                " explanation of this rust as given by",
                " the Holy Prophet (upon whom be peace)",
                " is as follows: \"When a servant commits",
                " a sin, it marks a black stain",
                " on his heart. If he offers repentance,",
                " the stain is washed off, but if",
                " he persists in wrongdoing. it spreads over",
                " the whole heart.\" (Musnad Ahmad, Tirmidhi, Nasa'i,",
                " Ibn Majah, Ibn Jarir, Hakim, Ibn Abi",
                " Hatim, Ibn Hibban and others)."
            ]
        },
        {
            "verse-id": "[83:15]",
            "verse": "No! Indeed, from their Lord, that Day, they will be partitioned.",
            "description": [
                "That is, these people will remain deprived",
                " of the vision of Allah with which",
                " the righteous will be blessed. (For further",
                " explanation, see E.N. 17 of Al -",
                " Qiyamah)."
            ]
        },
        {
            "verse-id": "[83:16]",
            "verse": "Then indeed, they will [enter and] burn in Hellfire.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:17]",
            "verse": "Then it will be said [to them], \"This is what you used to deny.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:18]",
            "verse": "No! Indeed, the record of the righteous is in 'illiyyun.",
            "description": [
                "That is, they are wrong in thinking",
                " that there is going to be no",
                " meting out of rewards and punishments."
            ]
        },
        {
            "verse-id": "[83:19]",
            "verse": "And what can make you know what is 'illiyyun?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:20]",
            "verse": "It is [their destination recorded in] a register inscribed",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:21]",
            "verse": "Which is witnessed by those brought near [to Allah].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:22]",
            "verse": "Indeed, the righteous will be in pleasure",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:23]",
            "verse": "On adorned couches, observing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:24]",
            "verse": "You will recognize in their faces the radiance of pleasure.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:25]",
            "verse": "They will be given to drink [pure] wine [which was] sealed.",
            "description": [
                "One meaning of the words khltamu-hu misk",
                " is that the vessels containing the wine",
                " will carry the seal of musk instead",
                " of clay or wax. Accordingly the verse",
                " means: This will be the choicest kind",
                " of wine, which will be superior to",
                " the wine flowing in the canals, and",
                " it will be served by the attendants",
                " of Paradise in vessels sealed with musk",
                " to the dwellers of Paradise. Another meaning",
                " also can be: When that wine will",
                " pass down the throat, its final effect",
                " will be of the flavour of musk.",
                " This state is contrary to the wines",
                " of the world which give out an",
                " offensive smell as soon as the bottle",
                " opens and one feels its horrid smell",
                " even while drinking and also when it",
                " passes down the throat."
            ]
        },
        {
            "verse-id": "[83:26]",
            "verse": "The last of it is musk. So for this let the competitors compete.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:27]",
            "verse": "And its mixture is of Tasneem,",
            "description": [
                "\"Tasnim \".: height. Thus, Tasnim will be",
                " a fountain flowing down from a height.",
                ""
            ]
        },
        {
            "verse-id": "[83:28]",
            "verse": "A spring from which those near [to Allah] drink.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:29]",
            "verse": "Indeed, those who committed crimes used to laugh at those who believed.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:30]",
            "verse": "And when they passed by them, they would exchange derisive glances.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:31]",
            "verse": "And when they returned to their people, they would return jesting.",
            "description": [
                "That is, they returned home rejoicing, thinking",
                " that they had made fun of such",
                " and such a Muslim, had passed evil",
                " remarks against him and subjected him to",
                " ridicule among the people."
            ]
        },
        {
            "verse-id": "[83:32]",
            "verse": "And when they saw them, they would say, \"Indeed, those are truly lost.\"",
            "description": [
                "That is, they have lost their reason:",
                " they have deprived themselves of the gains",
                " and enjoyments of the world and have",
                " experienced dangers and undergone hardships only for",
                " the reason that Muhammad (upon whom be",
                " Allah's peace and blessings) has deluded them",
                " with the Hereafter, Heaven and Hell. They",
                " are giving up whatever is present and",
                " here on the false hope that the",
                " promise of some Paradise has been held",
                " out to them after death, and they",
                " are enduring the hardships in the present",
                " life only for the reason that they",
                " have been threatened with some Hell in",
                " the next world."
            ]
        },
        {
            "verse-id": "[83:33]",
            "verse": "But they had not been sent as guardians over them.",
            "description": [
                "In this brief sentence the mockers and",
                " jesters have been given an instructive warning",
                " to the effect: \"Even if what the",
                " Muslims have believed in, is false, they",
                " are not harming you at all They",
                " regard something as we and are accordingly",
                " adopting a certain moral attitude for themselves,",
                " for their own good. AIIah has not",
                " appointed you to be keepers over them",
                " so that you may be free to",
                " criticise and persecute those who are not",
                " harming you in any way.\""
            ]
        },
        {
            "verse-id": "[83:34]",
            "verse": "So Today those who believed are laughing at the disbelievers,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:35]",
            "verse": "On adorned couches, observing.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[83:36]",
            "verse": "Have the disbelievers [not] been rewarded [this Day] for what they used to do?",
            "description": [
                "There is a subtle satire in this",
                " sentence. In the world, the disbelievers used",
                " to persecute the believers, thinking it was",
                " an act of virtue. In the Hereafter,",
                " the believers will be enjoying life in",
                " Paradise, and watching the disbelievers being punished",
                " in Hell, will say to themselves what",
                " a reward they have earned for their",
                " acts of virtue!"
            ]
        }
    ]
}