{
    "name": "Al-Inshiqaq",
    "id": 84,
    "verse-count": 25,
    "verse-info": [
        {
            "verse-id": "[84:1]",
            "verse": "When the sky has split [open]",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:2]",
            "verse": "And has responded to its Lord and was obligated [to do so]",
            "description": [
                "Literally: \"... and hears its Lord's Conmtand.\"",
                " However, according to Arabic usage adhina lahu",
                " dces not only mean: \"He heard the",
                " Command but it means: \"Hearing the Command",
                " he carried it out promptly like an",
                " obedient servant. \""
            ]
        },
        {
            "verse-id": "[84:3]",
            "verse": "And when the earth has been extended",
            "description": [
                "\"When the earth is spread out\": when",
                " the oceans and rivers are filled up,",
                " the mountains are crushed to pieces and",
                " scattered away, and the earth is levelled",
                " and turned into a smooth plain. In",
                " Surah Ta Ha, the same thing has",
                " been expressed, thus: \"He will turn the",
                " earth into an empty level plain, wherein",
                " you will neither see any curve nor",
                " crease.\" (vv 106-107) Hakim in Mustadrak has",
                " related through authentic channels on the authority",
                " of Hadrat Jabir bin 'Abdullah a saying",
                " of the Holy Prophet (upon whom be",
                " peace) to the effect: \"On the Resurrection",
                " Day the earth will be flattened out",
                " and spread out like the table-cloth; then",
                " there will hardly be room on it",
                " for men to place their feet.\" To",
                " understand this saying one should keep in",
                " mind the fact that ou that Day",
                " aII men who will have been born",
                " from the first day of creation till",
                " Resurrection, will be resurrected simultaneously and produced",
                " in the Divine Court. For gathering together",
                " such a great multitude of the people",
                " it is inevitable that the oceans, rivers,",
                " mountains, jungles, ravines and aII high and",
                " low areas be levelled and the entire",
                " globe of the earth be turned into",
                " a vast plain so that aII individuals",
                " of human race may have room on",
                " it to stand on their feet."
            ]
        },
        {
            "verse-id": "[84:4]",
            "verse": "And has cast out that within it and relinquished [it]",
            "description": [
                "That is, it will throw out aII",
                " dead bodies of men and also the",
                " traces and evidences of their deeds lying",
                " within it. so that nothing remains hidden",
                " and buried in it."
            ]
        },
        {
            "verse-id": "[84:5]",
            "verse": "And has responded to its Lord and was obligated [to do so] -",
            "description": [
                "Here, it has not been expressly told",
                " what will happen when such and such",
                " an event takes place, for the subsequent",
                " theme by itself explains this, as if",
                " to say: \"O man, you are moving",
                " towards your Lord and are about to",
                " meet Him; you will be given your",
                " conduct book; and rewarded or punished according",
                " to your deeds.\""
            ]
        },
        {
            "verse-id": "[84:6]",
            "verse": "O mankind, indeed you are laboring toward your Lord with [great] exertion and will meet it.",
            "description": [
                "That is, \"You may if you so",
                " like think that alI your efforts and",
                " endeavours in the world are confined to",
                " worldly life and motivated by worldly desires,",
                " yet the truth is that you are",
                " moving, consciously or unconsciously, towards your Lord",
                " and you have ultimately to appear before",
                " Him in any case..\""
            ]
        },
        {
            "verse-id": "[84:7]",
            "verse": "Then as for he who is given his record in his right hand,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:8]",
            "verse": "He will be judged with an easy account",
            "description": [
                "That is, his reckoning will be less",
                " severe: he will not be asked why",
                " he had done such and such a",
                " thing and what excuses he had to",
                " offer for it. Though his evil deeds",
                " also will be there alongwith his good",
                " deeds in his records, his errors will",
                " be overlooked and pardoned in view of",
                " his outweighing good deeds . ln the",
                " Holy Qur'an, for the severe reckoning of",
                " the wicked people the words su-al-hisab (heavy",
                " reckoning) have been used (Ar-Ra'd: 181, and",
                " concerning the righteous it has been said:",
                " \"From such people We accept the best",
                " of their deeds and overlook their evils.\"",
                " (AI-Ahqaf: 16). The explanation of it given",
                " by the Holy Prophet (upon whom be",
                " peace) has been related in different words",
                " by lmam Ahmad Bukhari, Muslim, Tirmidhi, Nasa'i,",
                " Abu Da'ud, Hakim, Ibn Jarir, `Abd bin",
                " Humaid, and Ibn Marduyah on the authority",
                " of Hadrat 'A'ishah. According to one of",
                " these traditions the Holy Prophet (upon whom",
                " be peace) said: \"Doomed will be he",
                " who is called to account for his",
                " deeds. Hadrat 'A'ishah said: O Messenger of",
                " AIIah, has not AIlah said: 'He whose",
                " record is given in his right hand",
                " shall have an easy reckoning?' The Holy",
                " Prophet replied: That is only about the",
                " presentation of the deeds, but the one",
                " who is questioned would be doomed.\" In",
                " another tradition Hadrat 'A'ishah has related: \"I",
                " once heard the Holy Prophet supplicate during",
                " the prayer, thus: O God, call me",
                " to a light reckoning. When he brought",
                " his Prayer to conclusion, I asked what",
                " he meant by that supplication. He replied:",
                " Light reckoning means that one's conduct book",
                " will be seen and one's errors will",
                " be overlooked. O 'A'ishah, the one who",
                " is called to account for his deeds",
                " on that Day, would be doomed."
            ]
        },
        {
            "verse-id": "[84:9]",
            "verse": "And return to his people in happiness.",
            "description": [
                "\"His kinsfolk\": his family and relatives and",
                " companions who will have been pardoned even",
                " like himself."
            ]
        },
        {
            "verse-id": "[84:10]",
            "verse": "But as for he who is given his record behind his back,",
            "description": [
                "In Surah Al Haaqqah: 25, it was",
                " said that his record will be given",
                " him in his left hand but here",
                " \"behind his back. ! This will probably",
                " be for the reason that he would",
                " already have lost aII hope that he",
                " would be given his record in his",
                " right hand, for he would be well",
                " aware of his misdeeds and sure to",
                " receive his record in his left hand.",
                " However, in order to avoid the humiliation",
                " of receiving it iu the left hand,",
                " in front of all mankind, he will",
                " withdraw his hand behind and so would",
                " receive it 'behind his back.\""
            ]
        },
        {
            "verse-id": "[84:11]",
            "verse": "He will cry out for destruction",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:12]",
            "verse": "And [enter to] burn in a Blaze.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:13]",
            "verse": "Indeed, he had [once] been among his people in happiness;",
            "description": [
                "That is, his way of life was",
                " different from that of God's righteous men,",
                " about whom in Surah At-Tur: 26, it",
                " has been said that they lived among",
                " their kinsfolk in fear and dread of",
                " God, i.e. they fear lest they should",
                " ruin their own Hereafter on account of",
                " their absorption in the love of children",
                " and endeavours for the sake of their",
                " well-being and prosperity in the world. On",
                " the contrary, this tnan lived a life",
                " free from every care and worry and",
                " helped his children and kinsfolk also to",
                " enjoy life fully, no matter what wicked",
                " and inunoral methods he had to use",
                " to procure the means of enjoyment, how",
                " he had to usurp the rights of",
                " others and transgress the bounds set by",
                " AIIah for the sake of the worldly",
                " pleasures."
            ]
        },
        {
            "verse-id": "[84:14]",
            "verse": "Indeed, he had thought he would never return [to Allah].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:15]",
            "verse": "But yes! Indeed, his Lord was ever of him, Seeing.",
            "description": [
                "That is, it was against God's justice",
                " and His wisdom that He should overlook",
                " the misdeeds that he was committing and",
                " should not summon him before Himself to",
                " render his account of the deeds."
            ]
        },
        {
            "verse-id": "[84:16]",
            "verse": "So I swear by the twilight glow",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:17]",
            "verse": "And [by] the night and what it envelops",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:18]",
            "verse": "And [by] the moon when it becomes full",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:19]",
            "verse": "[That] you will surely experience state after state.",
            "description": [
                "That is, \"You will not remain in",
                " one and the same state, but will",
                " have to pass through countless stages gradually,",
                " from youth to old age, from old",
                " age to death, from death to barzakh",
                " (the intermediary state between death and Resurrection),",
                " from barzakh to Resurrections from Resurrection to",
                " the Plain of Assembly, then to the",
                " Reckoning, and then to the meting out",
                " of rewards and punishments. An oath has",
                " been sworn by three things to confine",
                " this:",
                "(1) by the twilight,",
                "(2) by",
                " the darkness of night and the gathering",
                " together in it of aII those human",
                " beings and animals who remain scattered in",
                " the day time, and",
                "(3) by the",
                " moon's passing through different phases to become",
                " full. These are some of those things",
                " which testify that rest and stillness is",
                " unknown in the universe in which man",
                " lives. There is a continuous and gradual",
                " change taking place everywhere. Therefore, the disbelievers",
                " are wrong in thinking that life comes",
                " to an end after man has breathed",
                " his last."
            ]
        },
        {
            "verse-id": "[84:20]",
            "verse": "So what is [the matter] with them [that] they do not believe,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:21]",
            "verse": "And when the Qur'an is recited to them, they do not prostrate [to Allah]?",
            "description": [
                "\"They do not fall prostrate\": they do",
                " not bow down to God out of",
                " fear of Him. To perform a sajdah",
                " (prostration) here is confirmed by the practice",
                " of the Holy Prophet (upon whom be",
                " peace). lmam Malik, Muslim and Nasa'i have",
                " related a tradition concerning Hadrat Abu Huraira",
                " (may Allah be pleased with him>, saying",
                " that he recited this Surah in the",
                " Prayer and performing a sajdah here said:",
                " \"The Holy Prophet (upon whom be peace)",
                " performed a sajdah at this point.\" Bukhari;",
                " Muslim, Abu Da'ud and Nasa'i have cited",
                " this statement of Abu Rafi`: \"Hadrat Abu",
                " Huraira recited this Surah in the 'Isha'",
                " Prayer and performed a sajdah When I",
                " asked why he had done so, he",
                " replied: I prayed under the leadership of",
                " Abul Qasim (upon whom be Allah's peace)",
                " and he performed a sajdah here. Therefore,",
                " I will continue to perform this sajdah",
                " likewise as long as 1 live.\" Muslim,",
                " Abu Da'ud, Tirmidhi, Nasa'i, Ibn Majah and",
                " others have related another tradition saying that",
                " Hadrat Abu Huraira said: \"We performed sajdah",
                " behind the Holy Messenger of Allah in",
                " this Surah and in Iqra' bi-ismi Rabbik-alladhi",
                " khalaq."
            ]
        },
        {
            "verse-id": "[84:22]",
            "verse": "But those who have disbelieved deny,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:23]",
            "verse": "And Allah is most knowing of what they keep within themselves.",
            "description": [
                "Another meaning also can be: \"Allah knows",
                " best what tilth of disbelief, malice, hostility",
                " to the Truth and evil intentions and",
                " designs they keep tilled in their breasts.\"",
                ""
            ]
        },
        {
            "verse-id": "[84:24]",
            "verse": "So give them tidings of a painful punishment,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[84:25]",
            "verse": "Except for those who believe and do righteous deeds. For them is a reward uninterrupted.",
            "description": [
                ""
            ]
        }
    ]
}