{
    "name": "At-Tariq",
    "id": 86,
    "verse-count": 17,
    "verse-info": [
        {
            "verse-id": "[86:1]",
            "verse": "By the sky and the night comer -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:2]",
            "verse": "And what can make you know what is the night comer?",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:3]",
            "verse": "It is the piercing star -",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:4]",
            "verse": "There is no soul but that it has over it a protector.",
            "description": [
                "\"A Guardian\": Allah Almighty Himself, Who is",
                " looking after and watching over every creature,",
                " big or small, in the earth and",
                " heavens. He it is Who has brought",
                " everything into existence, Who is maintaining and",
                " sustaining everything in its place and position,",
                " and Who has taken the responsibility to",
                " provide for every creature and to protect",
                " it from calamities till an appointed tune.",
                " On this, an oath has been sworn",
                " by the heaven and by every star",
                " and planet which appears in the darkness",
                " of the night. (Although lexically, an-najm ath-thaqib",
                " is singular, it does not imply any",
                " one star but the star in the",
                " generic sense). The oath signifies that the",
                " existence of each of the countless stars",
                " and planets that shines in the sky",
                " at 'night, testifies to the fact that",
                " there is a Being Who has created",
                " it, illuminated it, suspended it in space,",
                " and thus is watching over it in",
                " a manner that neither it falls from",
                " its place nor collides with any other",
                " of the countless stars in their movements,",
                " nor does any other star collide with",
                " it."
            ]
        },
        {
            "verse-id": "[86:5]",
            "verse": "So let man observe from what he was created.",
            "description": [
                "After making man ponder over the heavens,",
                " he is now being invited to consider",
                " his ownself and see how he has",
                " been created, Who is it Who selects",
                " one spermatozoon from among billions of spermatozoa",
                " emitted by the father and combines it",
                " at some time with one ovum out",
                " of a large number of the ova",
                " produced by the mother, and thus causes",
                " a particular human being to be conceived?",
                " Then, Who is it Who after conception",
                " develops it gradually in the mother's womb",
                " Until it is delivered in the form",
                " of a living child? Then, Who is",
                " it Who in the mother's womb itself",
                " brings about a certain proportion and harmony",
                " between its bodily structure and its physical",
                " and mental capabilities? Then, Who is it",
                " Who watches over it continuously from birth",
                " till death-protects it from disease, accidents and",
                " calamities and provides him with countless means",
                " of life and opportunities for survival in",
                " the world of which he is not",
                " even conscious, not to speak of having",
                " the power to provide these for himself.",
                " Is all this happening without the planning",
                " and supervision of One God?"
            ]
        },
        {
            "verse-id": "[86:6]",
            "verse": "He was created from a fluid, ejected,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:7]",
            "verse": "Emerging from between the backbone and the ribs.",
            "description": [
                "\"Sulb\" is the backbone and \"tara'ib\"the breast-",
                " bones, i.e. the ribs. Since the procreative",
                " fluid in both man and woman is",
                " discharged from that part of the body",
                " which is between the back and the",
                " breast, it is said that tnan has",
                " been created from the fluid issuing out",
                " froth between the back and the breast.",
                " This fiuid is produced even in case",
                " the hands and feet are cut off.",
                " Therefore, it is not correct to say",
                " that it issues out from the whole",
                " body of man. In fact, the principal",
                " organs of the body are its source",
                " and all these are located in the",
                " trunk. The brain has not been mentioned",
                " separately because the back-bone is that part",
                " of the brain through which connection between",
                " the body and the brain is established.",
                " (Also see Appendix I)."
            ]
        },
        {
            "verse-id": "[86:8]",
            "verse": "Indeed, Allah, to return him [to life], is Able.",
            "description": [
                "That is, His bringing tnan into existence",
                " and watching over him from the tithe",
                " conception takes place until death, is a",
                " clear proof that He can create him",
                " once again after death. If He had",
                " the power to create him in the",
                " first instance and man stays alive in",
                " the world by His power alone, what",
                " rational arguments can be presented for the",
                " conjecture that He dces not have the",
                " power to do the same thing a",
                " second time? To deny this power man",
                " will even have to deny that God",
                " has brought him into existence, and the",
                " one who denies this may well come",
                " out one day with the claim that",
                " aII books in the world have been",
                " printed accidentally, all cities of the world",
                " have been built accidentally, and there has",
                " occurred on the earth an explosion by",
                " chance which made aII the factories start",
                " functioning automatically. The fact is that the",
                " creation of man, the structure of his",
                " body, the existence of the powers and",
                " capabilities working within him, and his survival",
                " as a living being ' all this",
                " is a much more complex process than",
                " all those works that have come to",
                " be accomplished through man, or are still",
                " in the process of being accomplished. If",
                " such a complex work with such wisdom,",
                " proportion and order could be accomplished just",
                " through a chance accident, what else could",
                " not be regarded as accidental by a",
                " mentally deranged person?"
            ]
        },
        {
            "verse-id": "[86:9]",
            "verse": "The Day when secrets will be put on trial,",
            "description": [
                "\"The hidden secrets\": the acts of every",
                " person which remained a secret to the",
                " world as well as those affairs which",
                " came before the world only in their",
                " apparent form, but the intentions, aims and",
                " secret motives working behind them remained hidden",
                " from the people. On the Resurrection Day",
                " aII this will be laid bare and",
                " not only will the acts and deeds",
                " of every person be examined but it",
                " will also be seen what was his",
                " motive and intention and object of so",
                " acting. Likewise, it also remained hidden from",
                " the world, even from the doer of",
                " the act himself, what effects and influences",
                " of his act appeared in the world,",
                " to what extent they spread and for",
                " how long they continued to work. This",
                " secret too will be revealed on the",
                " Resurrection Day and it will be fully",
                " examined as to what were the consequences",
                " of the seed that a person sowed",
                " in the world, what fruit it bore",
                " and for how long it affected the",
                " later generations for better or far worse.",
                ""
            ]
        },
        {
            "verse-id": "[86:10]",
            "verse": "Then man will have no power or any helper.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:11]",
            "verse": "By the sky which returns [rain]",
            "description": [
                "The words dhat ar-raj`e have been used",
                " for the sky. Literally raj`e means to",
                " return, but metaphorically this word is used",
                " for the rain in Arabic, for rain",
                " does not fall just once, but returns",
                " over and over again in the season",
                " and of season as well. Another reason",
                " for calling the rain raj `e is",
                " that vapour from the oceans of the",
                " earth and then falls back as rain",
                " on the sometimes out water rises as",
                " the same earth."
            ]
        },
        {
            "verse-id": "[86:12]",
            "verse": "And [by] the earth which cracks open,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:13]",
            "verse": "Indeed, the Qur'an is a decisive statement,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[86:14]",
            "verse": "And it is not amusement.",
            "description": [
                "That is, just as the falling of",
                " rain froth the sky and the splitting",
                " of the earth to put out shoots",
                " is no jest but a serious reality,",
                " so also the news which the Qur'an",
                " gives that ntan has to return to",
                " his God is no jest but a",
                " definite and decisive reality and an unchangeable",
                " truth which has to be fulfilled."
            ]
        },
        {
            "verse-id": "[86:15]",
            "verse": "Indeed, they are planning a plan,",
            "description": [
                "That is, these disbelievers are devising every",
                " kind of plan to defeat the invitation",
                " of the Qur'an; they wish to blow",
                " out this candle; they are creating aII",
                " sorts of doubts In the people's minds:",
                " they are inventing false accusations against the",
                " Prophet who has brought it, so as",
                " to frustrate his mission in the world",
                " and perpetuate the darkness of ignorance and",
                " unbelief which hr is struggling so hard",
                " to remove."
            ]
        },
        {
            "verse-id": "[86:16]",
            "verse": "But I am planning a plan.",
            "description": [
                "That is, \"I am planning that none",
                " of their devices should succeed so that",
                " they are utterly defeated in their designs,",
                " and the light which they are trying",
                " their utmost to put out, spreads far",
                " and wide."
            ]
        },
        {
            "verse-id": "[86:17]",
            "verse": "So allow time for the disbelievers. Leave them awhile.",
            "description": [
                "That is, \"Leave them for a while",
                " to have their will. Before long the",
                " result will be before them and they",
                " will realize how far their scheming has",
                " become successful against My plan."
            ]
        }
    ]
}