{
    "name": "Al-Ghashiyah",
    "verse-count": 26,
    "verse-info": [
        {
            "id": "[88:1]",
            "verse": "Has there reached you the report of the Overwhelming [event]?",
            "description": [
                "\"The over-shadowing calamity\": the Resurrection which will",
                " overshadow the whole world. One should know",
                " that here the Hereafter as a whole",
                " is being depicted, which comprehends aII the",
                " stages from the upsetting of the present",
                " system to the resurrection of all human",
                " beings and the dispensation of rewards and",
                " punishments from the Divine Court."
            ]
        },
        {
            "id": "[88:2]",
            "verse": "[Some] faces, that Day, will be humbled,",
            "description": [
                "Some faces : some persons, so said",
                " for the face is the most conspicuous",
                " part of the human body by which",
                " man s personality is judged and which",
                " reflects the good or bad states through",
                " which man passes."
            ]
        },
        {
            "id": "[88:3]",
            "verse": "Working [hard] and exhausted.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:4]",
            "verse": "They will [enter to] burn in an intensely hot Fire.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:5]",
            "verse": "They will be given drink from a boiling spring.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:6]",
            "verse": "For them there will be no food except from a poisonous, thorny plant",
            "description": [
                "At some places in the Qur'an it",
                " has been stated that the dwellers of",
                " Hell will be given zaqqum to eat;",
                " at another place it has been said",
                " that they will have no other food",
                " but glhislin (washing from wounds), and here",
                " that \"their only food will he thorny,",
                " dry grass.\" There is, in fact, no",
                " contradiction between these statements. This may as",
                " welt mean that Hell will have many",
                " different compartment in which different categories of",
                " the criminals will be lodged according to",
                " their crimes, and subjected to different punishments.",
                " This may also mean that if they",
                " try to avoid zaqqum they will be",
                " given ghislin, and if they try to",
                " avoid even that, they will only get",
                " thorny grass. In short, they would get",
                " nothing to suit their taste."
            ]
        },
        {
            "id": "[88:7]",
            "verse": "Which neither nourishes nor avails against hunger.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:8]",
            "verse": "[Other] faces, that Day, will show pleasure.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:9]",
            "verse": "With their effort [they are] satisfied",
            "description": [
                "That is. they will be overjoyed to",
                " see the best results in the Hereafter",
                " of their endeavours and deeds in the",
                " world; they will be satisfied to see",
                " that they had, in fact, made a",
                " profitable bargain in that they had adopted",
                " a life of faith, virtue and piety,",
                " by sacrificing the desires of the flesh,",
                " undergone hardships in carrying out their obligations,",
                " endured afflictions in obeying the Divine Commands,",
                " incurred losses and suffered deprivation of benefits",
                " and pleasures while trying to avoid sins",
                " and acts of disobedience."
            ]
        },
        {
            "id": "[88:10]",
            "verse": "In an elevated garden,",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:11]",
            "verse": "Wherein they will hear no unsuitable speech.",
            "description": [
                "This thing has been mentioned at several",
                " places in the Qur'an as a major",
                " blessing of Paradise. (For explanation, see E.N.",
                " 38 of Maryam, E.N. 18 of At-Tur,",
                " E.N. 13 of Al-Wiiqi`ah, E.N. 21 of",
                " An-Naba)."
            ]
        },
        {
            "id": "[88:12]",
            "verse": "Within it is a flowing spring.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:13]",
            "verse": "Within it are couches raised high",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:14]",
            "verse": "And cups put in place",
            "description": [
                "That is, filled goblets already supplied so",
                " that they do not have to ask",
                " for them."
            ]
        },
        {
            "id": "[88:15]",
            "verse": "And cushions lined up",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:16]",
            "verse": "And carpets spread around.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:17]",
            "verse": "Then do they not look at the camels - how they are created?",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:18]",
            "verse": "And at the sky - how it is raised?",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:19]",
            "verse": "And at the mountains - how they are erected?",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:20]",
            "verse": "And at the earth - how it is spread out?",
            "description": [
                "That is, \"If they deny the possibility",
                " of the Hereafter, have they never looked",
                " around themselves and considered how the camels",
                " were created, how the heaven was raised",
                " high, how the mountains were firmly set",
                " and how the earth was spread out?",
                " When aII these things could be created,",
                " and exist before them in their finished",
                " form, why can the Resurrection not take",
                " place? Why cannot a new world come",
                " about, and why cannot .Hell and Heaven",
                " be possible'? Only a foolish and thoughtless",
                " person would think that the coming into",
                " existing of only those things which he",
                " has found existing on opening his eyes",
                " in the world, is possible. bacause they",
                " already exist. As for the things, which",
                " he has not yet observed and experienced,",
                " he should thoughtlessly pass the judgement that",
                " their coming into being is impossible. If",
                " he has any common sense, he should",
                " think as to how he things which",
                " already exist, carne into being? How did",
                " the camel possessing precisely the same Characteristics",
                " as needed for the beast required by",
                " the desert dwellers of Arabia come into",
                " being'' How did the sky whose atmosphere",
                " is filled with air to breathe in,",
                " whose clouds bring rain, whose sun provides",
                " light and warmth in the day, whose",
                " moon and stars shine at night, come",
                " into being'' How did the earth spread",
                " out on which man lives and passes",
                " his life, whose products fulfil aII his",
                " needs and requirements on whose springs and",
                " wells his life depends? How did the",
                " mountains rise up from the surface of",
                " the earth, which stand fixed with earth",
                " and stones of different colours and a",
                " variety of minerals in them '? Has",
                " all this happened without the artistic skill",
                " of an AlI-Powerful, AI-Wise Designer No thinking",
                " and intellingent mind can answer this question",
                " in the negative. Unless it is stubborn",
                " and obstinate, it will have to acknowledge",
                " that each one of these things was",
                " impossible, had an Omnipotent; Wise Being not",
                " made it possible. And when an All-Powerful,",
                " Wise Being created these things, there is",
                " no reason why the Hereafter should be",
                " regarded as remote from reason and impossible.\"",
                ""
            ]
        },
        {
            "id": "[88:21]",
            "verse": "So remind, [O Muhammad]; you are only a reminder.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:22]",
            "verse": "You are not over them a controller.",
            "description": [
                "That is, \"If a person does not",
                " listen to reason, he may not. You",
                " have not been appointed to force the",
                " will of the deniers: your only task",
                " is to distinguish the right from the",
                " wrong for the people and warn them",
                " of the consequences of following the wrong",
                " way; so this is the task you",
                " should continue to perform.\""
            ]
        },
        {
            "id": "[88:23]",
            "verse": "However, he who turns away and disbelieves -",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:24]",
            "verse": "Then Allah will punish him with the greatest punishment.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:25]",
            "verse": "Indeed, to Us is their return.",
            "description": [
                ""
            ]
        },
        {
            "id": "[88:26]",
            "verse": "Then indeed, upon Us is their account.",
            "description": [
                ""
            ]
        }
    ]
}