{
    "name": "Al-Fajr",
    "id": 89,
    "verse-count": 30,
    "verse-info": [
        {
            "verse-id": "[89:1]",
            "verse": "By the dawn",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:2]",
            "verse": "And [by] ten nights",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:3]",
            "verse": "And [by] the even [number] and the odd",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:4]",
            "verse": "And [by] the night when it passes,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:5]",
            "verse": "Is there [not] in [all] that an oath [sufficient] for one of perception?",
            "description": [
                "Much difference of opinion has been expressed",
                " by the commentators in the commentary of",
                " these verses, so much so that in",
                " respect of \"the even and the odd\"",
                " there are as many as 36 different",
                " views. In some traditions the commentary of",
                " these verses has also been attributed to",
                " the Holy Prophet lupon whom be peace),",
                " but the fact is that no commentary",
                " is confirmed from him, otherwise it was",
                " not possible that anyone from among the",
                " Companions, their immediate successors, and later conunentators",
                " would have dared to determine the meaning",
                " of these verses by himself after the",
                " conmentary by the Holy Prophet.",
                "After a",
                " study of the style one clearly feels",
                " that there was an argument alredly in",
                " progress in which the Holy Prophet (upon",
                " whom be peace) was presenting some thing",
                " and the disbelievers were denying it. At",
                " this, affirming what the Holy Prophet presented,",
                " it was said: By such and such",
                " a thing\", so as to say: \"By",
                " these things, what Muhanunad (upon whom be",
                " Allah's peace and blessings) says is wholly",
                " based on the truth ' Then, the",
                " argument is concluded with the question: \"Is",
                " there an oath in it for a",
                " man of understanding ?\" That is, \"is",
                " there need for yet another oath to",
                " testify to the truth of this matter",
                " ''\" Is this oath not enough to",
                " persuade a sensible man to accept that",
                " which Muhanunad (upon whom be Allah's peace",
                " and blessings) is presenting '?\"",
                "Now the",
                " question arises: what was the argument for",
                " the sake of which an oath was",
                " sworn by these four things '? For",
                " this we shall have to consider the",
                " whole theme which, in the following verses,",
                " commences with: \"Have you not seen how",
                " your Lord dealt with the 'Ad\" and",
                " continues till the end of the Surah.",
                " It shows that the argument concerned the",
                " rewards and punishments of the Hereafter, which",
                " the people of Makkah were refusing to",
                " acknowledge and the Holy Messenger (upon whom",
                " be peace) was trying to convince them",
                " of this by constant preaching and instruction.",
                " At this oaths were sworn by the",
                " dawn, the ten nights, the even and",
                " the odd, and the departing night to",
                " assert: Are these four things not enough",
                " to convince a sensible man of the",
                " truth of this matter so that he",
                " may need yet another evidence for it?",
                "",
                "After having determined the significance of these",
                " oaths in the context, we would inevitably",
                " have to take each of these in",
                " the meaning relevant to the subsequent theme.",
                " First of all, it is said: \"By",
                " Fajr.\" Fajr is the breaking of day,",
                " i.e. the time when the first rays",
                " of the light of day appear in",
                " the midst of the darkness of night",
                " as a white streak from the east.",
                " Then, it is said: \"By the ten",
                " nights.\" If the context is kept in",
                " view, it will become plain that it",
                " implies each group of the ten nights",
                " among the thirty nights of the month,",
                " the first ten nights being those during",
                " which the crescent moon starting as a",
                " thin nail. goes on waxing every night",
                " until its major portion becomes bright; the",
                " second group of the ten nights being",
                " those during which the greater part of",
                " the night remains illumined by the moon,",
                " and the last ten nights being those",
                " during which the moon goes on waning",
                " and the nights becoming more and more",
                " dark until by the end of the",
                " month the whole night becomes absolutely dark.",
                " Then, it is said : \"By the",
                " even and the odd.\" Even is the",
                " number which is divisible into two equal",
                " parts, as 2, 4, 6, 8, and",
                " the odd the number which is not",
                " so divisible, as l, 3, 5, 7.",
                " Generally, it may imply everything in the",
                " universe, for things in the universe either",
                " exist in pairs or as singles. But",
                " since the context here concerns the day",
                " and the night, the even and the",
                " odd mean the alternation of day and",
                " night in the sense that the dates",
                " of the month go on changing from",
                " the first to the second, and from",
                " second to the third, and every change",
                " brings with it a new state. Last",
                " of all, it is said: \"By the",
                " night when it is departing\", i.e. when",
                " the darkness which had covered the world",
                " since sunset may be at the verge",
                " of disappearing and the day be dawning.",
                "",
                "Now let us consider as a whole",
                " the four things an oath by which",
                " has been sworn to assert that the",
                " news which Muhammad (upon whom be Allah's",
                " peace and blessings) is giving of the",
                " meting out of rewards and punishments is",
                " wholly based on the truth. All these",
                " things point to the reality that an",
                " all-Powerful Sustainer is ruling over this universe,",
                " and nothing of what He is doing",
                " is absurd, purposeless, or lacking wisdom; on",
                " the contrary, a wise plan clearly underlies",
                " whatever He does. In His world one",
                " will never see that while it is",
                " night, the midday sun should suddenly appear",
                " overhead, or that the moon should appear",
                " one evening in the shape of the",
                " crescent and be followed next evening by",
                " the full moon, or that the night,",
                " when it falls, should never come to",
                " an end, but should become perpetual, or",
                " that there should be no system in",
                " the alternation of the day and night",
                " so that one could keep a record",
                " of the dates and know what month",
                " was passing, what was the date, on",
                " what date a particular work is to",
                " begin, and when it is to finish,",
                " what are the dates of the summer",
                " season and what of the rainy or",
                " winter season. Apart from countless other things",
                " of the universe if man only considers",
                " this regularity of the day and night",
                " intelligently and seriously, he will find evidence",
                " of the truth that this relentless discipline",
                " and order has been established by an",
                " Omnipotent Sovereign God; with it are connected",
                " countless of the advantages of the creatures",
                " whom He has created on the earth.",
                " Now, if a person living in the",
                " world of such a Wise, Omnipotent and",
                " All-Mighty Creator denies the rewards and punishments",
                " of the Hereafter, he inevitably commits one",
                " of the two errors: either he is",
                " a denier of His powers and thinks",
                " that though He has the power to",
                " create the universe with such matchless order",
                " and discipline, He is powerless to recreate",
                " man and mete out rewards and punishments",
                " to him or he denies His wisdom",
                " and knowledge and thinks that although He",
                " has created man with intellect and powers",
                " in the world, vet He will neither",
                " ever call him to account as to",
                " how he used his intellect and his",
                " powers, nor will reward him for his",
                " good deeds, nor punish him for his",
                " evil deeds. The one who believes in",
                " either, is foolish in the extreme."
            ]
        },
        {
            "verse-id": "[89:6]",
            "verse": "Have you not considered how your Lord dealt with 'Aad -",
            "description": [
                "After reasoning out the judgement from the",
                " system of day and night, now an",
                " argument is berg given from man's own",
                " history for its being a certainty The",
                " mention of the conduct of a few",
                " well known tribes of history and their",
                " ultimate end is meant to point out",
                " that the universe is not working under",
                " some deaf and blind law of nature,",
                " but a Wise God is ruling over",
                " it, and in the Kingdom of that",
                " God only one law, which man describes",
                " as the law of nature is not",
                " working, but a moral law also is",
                " operative, which necessarily calls for retribution and",
                " rewards and punishments. The results of the",
                " working of the law have been appearing",
                " over and over again even in this",
                " world, which poinnt out to the people",
                " of understanding as to what is the",
                " nature of the Kingdom of the Universe.",
                " Any nation which carved out a system",
                " of life for itself heedless of the",
                " Hereafter and of the rewards and punishments",
                " of God, was ultimately corrupted and depraved,",
                " and whichever nation followed this way, was",
                " eventually visited with the scourge of punishment",
                " by the Lord of the universe. This",
                " continuous experience of man's own history testifies",
                " to two things clearly: (1) That denial",
                " of the Hereafter has been instrumental in",
                " corrupting every nation and sending it ultimately",
                " to its doom; therefore, the Hereafter indeed",
                " is a reality clashing with which leads,",
                " as it has always led, to the",
                " same inevitable results; and (2) that retribution",
                " for deeds will at some time in",
                " the future take place in its full",
                " and complete form also, for the people",
                " who touched the extreme limits of corruption",
                " and depravity and were visited with punishment",
                " had been preceded be many others who",
                " had sown seeds of corruption for centuries",
                " and left the world without being visited",
                " by any scourge. The justice of God",
                " demands that all those people also should",
                " be called to account at some time",
                " and they too should suffer for their",
                " misdeeds. (Argument from history and morals for",
                " the Hereafter has been given at many",
                " places in the Qur'an and we have",
                " explained it everywhere accordingly. For example, see",
                " E.N.'s 5, 6 of AI-A'raf, E.N. 12",
                " of Yunus,, E.N.'s 57, 105, 115 of",
                " Hud, E.N. 9 of Ibrahim, E.N.'s 66,",
                " 86 of An-Naml, E.N. 8 of Ar-Rum",
                " E.N. 25 of Saba, E.N.'s 29. 30",
                " of Suad, E.N. 80 of Al-Mu'min, E.N.'s",
                " 33, 34 of Ad-Dukhan, E.N.'s 27, 28",
                " of Al-Jathiah, E.N. 17 of Qaf, E.N.",
                " 21 of Adh-Dhariyat)."
            ]
        },
        {
            "verse-id": "[89:7]",
            "verse": "[With] Iram - who had lofty pillars,",
            "description": [
                "`Ad Iram implies the ancient tribe of",
                " `Ad, who have been called 'Ad Ula",
                " in the Qur'an and Arabian history. In",
                " Surah An-Najm, it has been said: \"And",
                " that We destroyed the ancient people of",
                " `Ad\" (v. 50), i.e. the `Ad to",
                " whom the Prophet Hud had been sent,",
                " and who were punished with a scourge.",
                " As against thetas the people of `Ad",
                " who retrained safe and flourished afterwards are",
                " remembered as Ad Ukhra in Arabian history.",
                " The ancient `Ad are called Ad lram",
                " for the reason that they belonged to",
                " that branch of the Semetic race which",
                " descended from Iram son of Shem son",
                " of Noah (peace be upon him). Several",
                " other sub-branches of this main branch are",
                " well known in history one of which",
                " were the Thamud, who have been mentioned",
                " in the Qur'an; another are the Aramaeans,",
                " who in the beginning inhabited the northern",
                " parts of Syria and whose language Aramaic",
                " occupies an important place among the Semetic",
                " languages. The words dhat-ul-`imad (of lofty pillars)",
                " have been. used for the 'Ad because",
                " they built high buildings and the pattern",
                " of architecture of erecting edifices on lofty",
                " pillars was introduced by them in the",
                " world. At another place in the Qur'an",
                " this characteristic has been mentioned in connection",
                " with the Prophet Hud, who said to",
                " them: \"What, you erect for mere pleasure",
                " a monument on every high spot, and",
                " build huge castles as if you were",
                " immortal!\" (Ash-Shu`ara': 128-129)."
            ]
        },
        {
            "verse-id": "[89:8]",
            "verse": "The likes of whom had never been created in the land?",
            "description": [
                "That is, they were a matchless people",
                " of their time; no other nation in",
                " the world compare with them in strength,",
                " glory and grandeur. At other places in",
                " the Qur'an, it has been said about",
                " them: \"Your Lord made you very robust.\"",
                " (Al-A`raf: 69) \"As for the `Ad, they",
                " became arrogant with pride in the land,",
                " without any right, and said: `Who is",
                " stronger than us in might\"? (Ha MIm",
                " As-Sajdah: 15). \"When you seized somebody, you",
                " seized him like a tyrant.\" (Ash-Shu`ara' 130)",
                ""
            ]
        },
        {
            "verse-id": "[89:9]",
            "verse": "And [with] Thamud, who carved out the rocks in the valley?",
            "description": [
                "\"The valley\": Wad-il-Qura, where the Thamud carved",
                " out dwellings in the mountains, and probably",
                " in history they were the first people",
                " who started cutting out such buildings into",
                " the rocks. (For details, see E.N.'s 57,",
                " 59 of AlA'raf, E.N. 45 of Al-Hijr,",
                " E.N.'s 95, 99 of Ash-Shu`ara' along with",
                " the photographs) ."
            ]
        },
        {
            "verse-id": "[89:10]",
            "verse": "And [with] Pharaoh, owner of the stakes? -",
            "description": [
                "The words dhul-autad (of the stakes) for",
                " Pharaoh have also been used in Surah",
                " Suad: 12 above. This can have several",
                " meanings. Possibly his forces have been compared",
                " to the stakes, and \"of the stakes\"",
                " means \"of great forces\", for it was",
                " by their power and might that he",
                " ruled a firmly established kingdom; it might",
                " also imply multiplicity of forces and the",
                " meaning be that wherever his large armies",
                " camped, pegs of the tents were seen",
                " driven into the ground on every side;",
                " it may also imply the stakes at",
                " which he punished the people, and it",
                " is also possible that the pyramids of",
                " Egypt have been compared to the stakes,",
                " for they are the remnants of the",
                " grandeur and glory of the Pharaohs, and",
                " seem to have been driven into the",
                " ground like stakes for centuries."
            ]
        },
        {
            "verse-id": "[89:11]",
            "verse": "[All of] whom oppressed within the lands",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:12]",
            "verse": "And increased therein the corruption.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:13]",
            "verse": "So your Lord poured upon them a scourge of punishment.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:14]",
            "verse": "Indeed, your Lord is in observation.",
            "description": [
                "The words \"ever lying in ambush\" have",
                " been used metaphorically for keeping watch on",
                " the movements and activities of the wicked",
                " and mischievous people. An ambush is a",
                " place where a person lies hiding in",
                " wait to attack somebody by surprise. The",
                " victim, thoughtless of his fate, comes and",
                " falls a prey. The same is the",
                " case against AIlah of those wicked people",
                " who spread mischief in the world and",
                " have no sense and tear that there",
                " is God above them, Who is watching",
                " alI their misdeeds. Therefore, they go on",
                " committing everyday more and more evils fearlessly",
                " until they reach the limit which Allah",
                " dces not permit them to transgress. At",
                " that very moment His scourge descends upon",
                " them suddenly."
            ]
        },
        {
            "verse-id": "[89:15]",
            "verse": "And as for man, when his Lord tries him and [thus] is generous to him and favors him, he says, \"My Lord has honored me.\"",
            "description": [
                "Now, criticizing the general moral state of",
                " the people, it is being said: \"After",
                " all, why shouldn't the men who have",
                " adopted such an attitude in the life",
                " of the world, be ever called to",
                " account, and how can it be regarded",
                " as a demand of reason and justice",
                " that when man has left the world,",
                " after doing alI he could, he should",
                " never receive any reward or suffer any",
                " punishment for his deeds?\""
            ]
        },
        {
            "verse-id": "[89:16]",
            "verse": "But when He tries him and restricts his provision, he says, \"My Lord has humiliated me.\"",
            "description": [
                "This then is man's materialistic view of",
                " life. He regards the wealth and position",
                " and power of this world alone as",
                " everything. When he has it, he is",
                " filled with pride and says God has",
                " honoured me; and when he fails to",
                " obtain it, he says: God has humiliated",
                " me. Thus, the criterion of honour and",
                " humiliation in his sight is the possession",
                " of wealth and position and power, or",
                " the absence of it, whereas the actual",
                " truth which he does not understand is",
                " that whatever Allah has given anybody in",
                " the world has been given for the",
                " sake of a trial. If he has",
                " given him wealth and power, it has",
                " been given for a trial to see",
                " whether he becomes grateful for it, or",
                " commits ingratitude. If he has made him",
                " poor, in this too there is a",
                " trial for him to see whether he",
                " remains content and patient in the will",
                " of God and faces his hardships bravely",
                " within permissible bounds, or becomes ready to",
                " transgress every limit of morality and honesty",
                " and starts cursing his God."
            ]
        },
        {
            "verse-id": "[89:17]",
            "verse": "No! But you do not honor the orphan",
            "description": [
                "That is, this is not all the",
                " criterion of honour and disgrace, for the",
                " real criterion is the moral good and",
                " evil.",
                "*11) That is, \"As long as",
                " his father is alive, your treatment of",
                " him is attentive and when his rather",
                " dies, even the paternal and maternal uncles",
                " and the elder brothers, to say nothing",
                " of the neighbours and distant relatives, neglect",
                " him.\""
            ]
        },
        {
            "verse-id": "[89:18]",
            "verse": "And you do not encourage one another to feed the poor.",
            "description": [
                "That is, \"Nobody in your society feels",
                " any urge to feed the poor. Neither",
                " a tnan himself feels inclined to feed",
                " a hungry person, nor is there among",
                " the people any urge to do something",
                " to satisfy the hunger of the hungry,",
                " nor do they exhort one another to",
                " do so\" ."
            ]
        },
        {
            "verse-id": "[89:19]",
            "verse": "And you consume inheritance, devouring [it] altogether,",
            "description": [
                "In Arabia, the women and children were",
                " as a rule deprived of inheritance and",
                " the people's idea in this regard was",
                " that the right to inheritance belonged only",
                " to those male members who were fit",
                " to fight and safeguard the family. Besides,",
                " the one who was more powerful and",
                " influential among the heirs of the deceased,",
                " would annex the whole inheritance without qualms,",
                " and usurp the shares of all those",
                " who did not have the power to",
                " secure their shares. They did not give",
                " any importance to the right and duty",
                " so that they should honestly render the",
                " right to whom it was due as",
                " a duty whether he had the power",
                " to secure it or not."
            ]
        },
        {
            "verse-id": "[89:20]",
            "verse": "And you love wealth with immense love.",
            "description": [
                "That is, \"You have no regard for",
                " the permissible or the forbidden, the lawful",
                " or the unlawful. You feel no qualms",
                " about acquiring wealth in any way or",
                " by any means, fair or foul, and",
                " your greed is never satisfied however much",
                " you may have acquired and amassed. \"",
                ""
            ]
        },
        {
            "verse-id": "[89:21]",
            "verse": "No! When the earth has been leveled - pounded and crushed -",
            "description": [
                "That is, \"You are wrong in thinking",
                " that you may do whatever you like",
                " in your life of the world, but",
                " you will never be called to account",
                " for it. The meting out of rewards",
                " and punishment denying which you have adopted",
                " this mode of life, is not anything",
                " impossible and fictitious, but it has to",
                " come to pass and it will certainly",
                " come to pass at the time being",
                " mentioned below.\""
            ]
        },
        {
            "verse-id": "[89:22]",
            "verse": "And your Lord has come and the angels, rank upon rank,",
            "description": [
                "Although literally the words jaa Rabbuka mean",
                " \"your Lord will come\", obviously there cannot",
                " be any question of Allah Almighty's moving",
                " from one place to another; therefore, this",
                " will inevitably have to be understood as",
                " au allegoric expression, which is meant to",
                " give an idea that at that time",
                " the manifestations of Allah Almighty's power and",
                " His majesty and sovereignty will appear fully,",
                " as, for example, in the world the",
                " arrival of a king in person in",
                " the court is more awe-inspiring than the",
                " mere array of his forces and chiefs",
                " and nobles."
            ]
        },
        {
            "verse-id": "[89:23]",
            "verse": "And brought [within view], that Day, is Hell - that Day, man will remember, but what good to him will be the remembrance?",
            "description": [
                "The words in the original can have",
                " two meanings:",
                "(1) That on that Day",
                " man will remember whatever he had done",
                " in the world and will regret, but",
                " what will remembrance and regretting avail him",
                " then?",
                "(2) That on that Day man",
                " will take heed and accept admonition: he",
                " will realize that whatever he had been",
                " told by the Prophets was true and",
                " he committed a folly when he did",
                " not listen to them; but what will",
                " taking heed and accepting the admonition and",
                " realizing one's errors avail one then ?",
                ""
            ]
        },
        {
            "verse-id": "[89:24]",
            "verse": "He will say, \"Oh, I wish I had sent ahead [some good] for my life.\"",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:25]",
            "verse": "So on that Day, none will punish [as severely] as His punishment,",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:26]",
            "verse": "And none will bind [as severely] as His binding [of the evildoers].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:27]",
            "verse": "[To the righteous it will be said], \"O reassured soul,",
            "description": [
                "\"Peaceful .. satisfied soul\": the man who",
                " believed in Allah, the One, as his",
                " Lord and Sustainer, and adopted the Way",
                " of Life brought by the Prophets as",
                " his way of life, with full satisfaction",
                " of the heart, and without the least",
                " doubt about it, who acknowledged as absolute",
                " truth whatever creed and command he received",
                " from Allah and His Messenger, who withheld",
                " himself from whatever he was forbidden by",
                " Allah's Religion, not unwillingly but with perfect",
                " conviction that it was really an evil",
                " thing, who offered without sacrifice whatever sacrifice",
                " was required to be offered for the",
                " sake of the truth. who endured with",
                " full peace of mind whatever difficulties, troubles",
                " and hardships he met on this way",
                " and who felt no remorse on being",
                " deprived of the gains and benefits and",
                " pleasures in the world which seemed to",
                " accrue to those who followed other ways",
                " but remained fully satisfied that adherence to",
                " true Faith had safeguarded him against those",
                " errors. This very state has been described",
                " at another place in the Qur'an as",
                " sharh Badr. (Al-An'am 125)"
            ]
        },
        {
            "verse-id": "[89:28]",
            "verse": "Return to your Lord, well-pleased and pleasing [to Him],",
            "description": [
                "This he will be told at the",
                " time of his death as well as",
                " on the Day of Resurrection when he",
                " will rise from the dead and move",
                " towards the Plain of Assembly and also",
                " on the occasion when he will be",
                " presented in the Divine Court; at every",
                " stage he will be assured that he",
                " is moving towards the Mercy of Allah",
                " Almighty."
            ]
        },
        {
            "verse-id": "[89:29]",
            "verse": "And enter among My [righteous] servants",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[89:30]",
            "verse": "And enter My Paradise.\"",
            "description": [
                ""
            ]
        }
    ]
}