{
    "name": "Ad-Dhuha",
    "id": 93,
    "verse-count": 11,
    "verse-info": [
        {
            "verse-id": "[93:1]",
            "verse": "By the morning brightness",
            "description": [
                "Here, the word duha has been used",
                " in contrast to the night; therefore, it",
                " implies the bright hours of the day.",
                " A precedent of it are vv. 97-98",
                " of Surah AI-A'raf, which say: Do the",
                " people of the settlements now feel secure",
                " that Our punishment will not come to",
                " them all of a sudden at night,",
                " while they might be fast asleep? Or,",
                " do they feel secure that Our punishment",
                " will not smite them all of a",
                " sudden during the day while they might",
                " be engaged in pastimes?\" In these verses",
                " also since the word duha has been",
                " used in contrast to the night, it",
                " implies the day and not just forenoon.",
                ""
            ]
        },
        {
            "verse-id": "[93:2]",
            "verse": "And [by] the night when it covers with darkness,",
            "description": [
                "The word raja in the original does",
                " not only signify the spreading of darkness",
                " but it also contains the meaning of",
                " stillness and peace that prevails at night.",
                " This quality of night deeply relates to",
                " the theme that follows."
            ]
        },
        {
            "verse-id": "[93:3]",
            "verse": "Your Lord has not taken leave of you, [O Muhammad], nor has He detested [you].",
            "description": [
                "Traditions show that Revelations to the Holy",
                " Prophet (upon whom be peace) had remained",
                " suspended. for some period of time. Different",
                " traditions have mentioned different durations of this",
                " period. Ibn Juraij has mentioned it to",
                " be 12 days, Kalbi 15 days, Ibn",
                " 'Abbas 25 days, and Suddi and Muqatil",
                " have stated that it extended to 40",
                " days. In any case the period was",
                " so long that it made the Holy",
                " Prophet (upon whom be peace) sorrowful, and",
                " the opponents also had the opportunity to",
                " taunt him. For whenever a new Surah",
                " came down, the Holy Prophet would recite",
                " it before the people. Therefore, when he",
                " did not recite any new Revelation to",
                " them for quite some days, the opponents",
                " thought that the fountainhead from where the",
                " revelation came, had dried up. Jundub bin",
                " 'Abdullah al-Bajali has related that when Gabriel",
                " (peace he on him) stopped coming, the",
                " pagans started saying that Muhammad (upon whom",
                " be Allah's peace and blessings) had been",
                " forsaken by his Lord. (Ibn Jarir, Tabarani,",
                " 'Abd bin Humaid, Sa'id bin Mansur, Ibn",
                " Marduyah). Other traditions show that Umm Jamil,",
                " wife of Abu Lahab, who was an",
                " aunt of the Holy Prophet and whose",
                " house adjoined his, said to him: \"It",
                " appears your satan has forsaken you.\" `Aufi",
                " and Ibn Jarir have related, on the",
                " authority of Ibn `Abbas, that when Gabriel",
                " did not visit him for several days,",
                " the Holy Prophet became anxious and distressed,",
                " and the pagans began to say that",
                " his Lord had become angry with him",
                " and had forsaken him. In the mursal",
                " traditions of Qatadah and Dahhak almost the",
                " same theme has been expressed. The Holy",
                " Prophet's extreme grief and anguish in this",
                " condition has also been referred to in",
                " several tradhions. And this was natural. The",
                " apparent indifference on the part of the",
                " beloved, the apparent deprivation of the contact",
                " with the source of power, which was",
                " his chief support, in the soul-destroying conflict",
                " between belief and unbelief, and above all,",
                " the taunts and jeers of the enemy,",
                " when all these things combined they must",
                " have caused great anguish to the Holy",
                " Prophet, and he must be thinking that",
                " because of some error that he might",
                " have committed his Lord had become displeased",
                " with him and had forsaken and left",
                " him to fight the battle between truth",
                " and falsehood alone. This was the state",
                " when this Surah was sent down to",
                " console the Holy Prophet. In it, swearing",
                " an oath by the light of the",
                " day and the peacefulness of the night,",
                " he has been told: \"Your Lord has",
                " neither forsaken you, nor is He displeased",
                " with you.\" The relevance of the oath",
                " by these two things to the theme",
                " is: \"Just as brightening up of the",
                " day and spreading of the night with",
                " darkness and stillness is not for the",
                " reason tha Allah is pleased with the",
                " people during the day and displeased with",
                " them during the night but both states",
                " are based on supreme wisdom and expedience,",
                " so sending down of revelation to you",
                " at one-time and suspending it at another",
                " time, also is based on wisdom and",
                " expedience; it has nothing to do with",
                " Allah's being pleased with you when He",
                " sends down revelation and his being displeased",
                " with you when He suspends it. Besides,",
                " another relevance of the oath to the",
                " subject is that if man is constantly",
                " exposed to the light of days it",
                " wearies him; so, it is necessary that",
                " night should fall after the day has",
                " remained bright for a certain period so",
                " that man may have rest and peace",
                " in it. Likewise, if you are constantly",
                " exposed to the light of revelation, your",
                " nerves would not stand it. Therefore, fatrah",
                " (break or gap in the revelation) also",
                " has been provided by Allah on account",
                " of expedience so that the effects of",
                " the strain of revelation that you have",
                " to bear pass away and complete peace",
                " is restored to you. In other words,",
                " rising of the sun of -revelation is",
                " analogous to the bright day and the",
                " period of the fatrah to the stillness",
                " and peace of the night. \""
            ]
        },
        {
            "verse-id": "[93:4]",
            "verse": "And the Hereafter is better for you than the first [life].",
            "description": [
                "This good news was given by Allah",
                " to the Holy Prophet (upon whom be",
                " peace) in a state when he had",
                " only a handful of Muslims with him,",
                " the entire nation was hostile and there",
                " was no remote chance of success even.",
                " The candle of lslam was flickering only",
                " in Makkah and storms were brewing all",
                " around to blow it out. At that",
                " juncture Allah said to His Prophet \"Do",
                " not at all grieve at the hardships",
                " of the initial stage: every later period",
                " of life will be better for you",
                " than the former period. Your power and",
                " glory, your honour and prestige, will go",
                " on enhancing and your influence will go",
                " on spreading. This promise is not only",
                " confined to the world, but it also",
                " includes the promise that the rank and.",
                " position you will be granted in the",
                " Hereafter will be far higher and nobler",
                " than the rank and position you attain",
                " in the world. \" Tabarani in A",
                " wsat and Baihaqi in Ad-dala il have",
                " related, on the authority of Ibn `Abbas",
                " .that the Holy Prophet said: \"All the",
                " victories which would be attained by my",
                " Ummah after me, were presented before me.",
                " This pleased me much. Then, Allah sent",
                " down this Word, saying: 'The Hereafter is",
                " fat better for you than the world'.\"",
                ""
            ]
        },
        {
            "verse-id": "[93:5]",
            "verse": "And your Lord is going to give you, and you will be satisfied.",
            "description": [
                "That is \"Although it will take some",
                " time, yet the time is not far",
                " when your Lord will bless you with",
                " so much that you will be well",
                " pleased \"This promise was fulfilled during the",
                " lifetime of the Holy Prophet and all",
                " Arabia, from the southern coasts to the",
                " Syrian frontiers of the Byzantine empire and",
                " the Iraqi frontiers of the Persian empire",
                " in the north, and from the Persian",
                " Gulf in the east to the Red",
                " Sea in the west, carne under his",
                " control. For the first time in the",
                " history of Arabia this land became subject",
                " to one law and rule. Whichever power",
                " clashed with it was doomed to destruction.",
                " The slogan La ilaha ill-allah-u Muhammad ur-Rasul-Allah",
                " reverberated throughout the land where the polytheists",
                " and the followers of the earlier scriptures",
                " had tried their utmost to keep their",
                " false creeds and slogans aloft till the",
                " last. The people not only bowed their",
                " heads in obedience, their hearts also were",
                " conquered, and their .beliefs, morals and acts",
                " were revolutionised. There is no precedent in",
                " human history that nation sunk in paganism",
                " might have completely changed in only 33",
                " years. Then the movement started by the",
                " Holy Prophet gathered such power that it",
                " spread over a large part of Asia,",
                " Africa and Europe and its influence reached",
                " every nook and corner of the world.",
                " This much Allah gave His Messenger in",
                " the world, the glory and extent of",
                " what he will give him in the",
                " Hereafter cannot be imagined.\" (Also see E.N.",
                " 112 of Surah Ta Ha)."
            ]
        },
        {
            "verse-id": "[93:6]",
            "verse": "Did He not find you an orphan and give [you] refuge?",
            "description": [
                "That is, \"There can be no question",
                " of forsaking you and being displeased with",
                " you; We have, in fact, been good",
                " to you ever sinCe the time you",
                " were born an orphan.\" The Holy Prophet's",
                " father passed away three months before his",
                " birth; thus he was an orphan at",
                " birth. But Allah did not leave him",
                " without support even for a day. Up",
                " to six years of age his mother",
                " nourished and looked after him. After her",
                " death, his grandfather took him and brought",
                " him up with great love. He would",
                " proudly tell the people; \"My this son",
                " has a great future.' When he also",
                " died, his uncle, Abu Talib, became his",
                " guardian and treated him with such rare",
                " love that one father could treat his",
                " son better. So much so that when",
                " after his proclamation to be a Prophet",
                " the entire nation turned hostile, Abu Talib",
                " alone stood firm as his chief supporter",
                " for as long as tea years."
            ]
        },
        {
            "verse-id": "[93:7]",
            "verse": "And He found you lost and guided [you],",
            "description": [
                "The word daallan as used in the",
                " original is derived from dalalat, which has",
                " several meanings in Arabic. Its one meaning",
                " is to be lost in error and",
                " deviation; another, to be unaware of the",
                " way and to be bewildered at the",
                " crossroads as to which way one should",
                " choose; still another meaning is of being",
                " lost and astray. The tree also is",
                " daallah which stands alone and lonely in",
                " the desert; the word dalal is also",
                " used for a thing which is wasting",
                " in unfavourable and uncongenial condition and climate,",
                " and also for heedlessness, of which there",
                " is an example in the Qur'an itself:",
                " La yadillu Rabbi wa la yansa:. \"My",
                " Lord is neither heedless nor He forgets.\"",
                " ('Ta Ha: 52). Out of these different",
                " meanings. The first meaning does not apply",
                " here, for in the historical accounts of",
                " the Holy Prophet's life, from childhood till",
                " just before Prophethood, there is no trace",
                " that he ever might have been involved",
                " in idolatry, polytheism or atheism, or in",
                " any of the acts, customs and practices",
                " of paganism prevalent among his people. Therefore,",
                " inevitably wa wa. jadaka daallan cannot mean",
                " that Allah had found him erring and",
                " astray in respect of creed or deed.",
                " The other meanings, however, can be applicable",
                " here in one or other aspect, and",
                " possibly all are applicable in their own",
                " particular aspect. Before Prophethood the Holy Prophet",
                " was certainly a believer in the existence",
                " of Allah and His Unity, and his",
                " Iife was free from sin and reflected",
                " excellent morals, yet he was unaware of",
                " true Faith, its principles and injunctions, as",
                " it has been pointed out in the",
                " Qur'an: \"You did not know at all",
                " what was the Book and what was",
                " the Faith.\" (Ash-Shura: 52). This verse may",
                " also mean that the Holy Prophet was",
                " lost in a society, engrossed in ignorance,",
                " and his personality as a guide and",
                " leader was not in anyway prominent before",
                " Prophethood. It may as well mean that",
                " in the desert of ignorance, he was",
                " standing like a lonely tree, which had",
                " the capability to bear fruit and turn",
                " the whole desert into a garden, but",
                " this capability was not being put to",
                " any use before Prophethood. It may also",
                " imply that the extraordinary powers that Allah",
                " had blessed him with, were going waste",
                " in the unfavourable environment of ignorance. Dalal",
                " can also be taken in the meaning",
                " of heedlessness, so as to say: \"You",
                " were heedless of the truths and sciences",
                " of which Allah made you aware after",
                " Prophethood.\" This thing also has been referred",
                " to in the Qur'an itself: \"Though before",
                " this you were utterly unaware of these",
                " truths.\" (Yusuf: 3). (Also see AI-Baqarah: 282,",
                " Ash-Shu'ara: 20)."
            ]
        },
        {
            "verse-id": "[93:8]",
            "verse": "And He found you poor and made [you] self-sufficient.",
            "description": [
                "The Holy Prophet's father had left only",
                " a she-camel and a slave-girl in heritage",
                " for him; so he started his life",
                " in a state of poverty. Then a",
                " time came when the wealthiest lady among",
                " the Quraish, Hadrat Khadijah, first made him",
                " her partner in trade, then married him,",
                " and he took charge of all her",
                " trade and business. Thus, he not only",
                " became wealthy but his riches in no",
                " way were dependent on the resources of",
                " his wife; his own hardwork and ability",
                " had gone a long way towards promoting",
                " her trade and commerce."
            ]
        },
        {
            "verse-id": "[93:9]",
            "verse": "So as for the orphan, do not oppress [him].",
            "description": [
                "That is, \"As you yourself have been",
                " an orphan, and Allah graced you with",
                " the bounty that he made the best",
                " possible arrangements to help you in that",
                " state, therefore, in gratitude you should see",
                " that no orphan is treated unjustly and",
                " harshly.\""
            ]
        },
        {
            "verse-id": "[93:10]",
            "verse": "And as for the petitioner, do not repel [him].",
            "description": [
                "It has two meanings. (1) If sa",
                " Ul is taken in the sense of",
                " a needy person, who asks for help,",
                " it would mean that if you can,,",
                " you should help him; if you cannot",
                " you should excuse yourself politely, but should",
                " never scold him. In this sense the",
                " instruction corresponds to Allah's this favour: \"You",
                " were poor, then Allah enriched you. \"",
                " And if sa'il is taken in the",
                " sense of the one who inquires, i.",
                " e. asks for enlightenment on a religious",
                " matter or injunction, it would mean that",
                " even if such a person be extremely",
                " ignorant and ill-mannered and might put the",
                " question, or present his problem, impolitely, you",
                " should in any case answer him politely",
                " and kindly, and should not turn him",
                " away like the rude people proud of",
                " their knowledge. In this meaning, the instruction",
                " corresponds to Allah's this favour: \"You were",
                " unaware of the Way, then he guided",
                " you.\" Hadrat Abud-Darda`, Hasan Basri, Sufyan Thauri",
                " and some other scholars have preferred this",
                " second meaning, for in view of the",
                " order and sequence this instruction corresponds to:",
                " wa wajadaka daalllan fa hada."
            ]
        },
        {
            "verse-id": "[93:11]",
            "verse": "But as for the favor of your Lord, report [it].",
            "description": [
                "The word ni 'mat . (bounty) is",
                " general, which also implies those bounties, which",
                " Allah had bestowed on His Messenger until",
                " the revelation of this Surah as well",
                " as those which He bestowed on him",
                " afterwards according to the promise made in",
                " this Surah, which He fulfilled completely. Then,",
                " it is enjoined:\"O Prophet, mention and proclaim",
                " every bounty that Allah has favoured you",
                " with.\" Now, obviously, there can be different",
                " forms and ways of mentioning and proclaiming",
                " the bounties and every bounty in view",
                " of its nature, requires a special form",
                " or its mention and proclamation. As a",
                " whole, the way of proclaiming the bounties",
                " is that Allah be thanked with the",
                " tongue and the truth be acknowledged that",
                " all the bounties received are only due",
                " to His grace and favour and none",
                " is the result of any personal excellence",
                " and merit on his part. The blessing",
                " of Prophethood can be proclaimed by preaching",
                " and conveying its message in the best",
                " way possible. The blessing of the Qur'an",
                " can be proclaimed by publicising it widely",
                " and impressing its teachings on the peoples",
                " minds as far as one can. The",
                " blessing of Allah's guidance can be proclaimed",
                " by showing the right way to the",
                " people who are gone astray and by",
                " enduring patiently all the bitternesses and hardships",
                " of the way. The favour that AIIah",
                " has done of helping during orphanhood, demands",
                " that the orphans be treated well. The",
                " favour that Allah did of enriching after",
                " poverty requires that Allah's needy servants be",
                " helped and supported. In short, this is",
                " a very comprehensive instruction which Allah gave",
                " His Messenger (upon whom be His peace)",
                " in this brief sentence after having described",
                " His bounties and blessings."
            ]
        }
    ]
}