{
    "name": "Ash-Sharh",
    "id": 94,
    "verse-count": 8,
    "verse-info": [
        {
            "verse-id": "[94:1]",
            "verse": "Did We not expand for you, [O Muhammad], your breast?",
            "description": [
                "To begin the discourse with this question,",
                " and then the subsequent theme, shows that",
                " the Holy Messenger (upon whom be Allah's",
                " peace) at that time was very disturbed",
                " and distressed at the great hardships that",
                " he was passing through in the initial",
                " stage of his mission of calling the",
                " people to Islam. Under those conditions Allah",
                " addressed him and consoling him, said: \"O",
                " Prophet, have We not blessed you with",
                " such and such favour? Then, why do",
                " you feel so disturbed and distressed at",
                " these initial difficulties?\"",
                "A little consideration of",
                " the context wherever the word sharh sadr",
                " (opening up of the breast) has occurred",
                " in the Qur'an, shows that it has",
                " two meanings:",
                "(1) In Surah Al-An'am: 125,",
                " it was said: \"So whomever Allah wills",
                " to guide aright, He makes his breast",
                " wide open to Islam (yashrah sadrahu lil-lslam)\";",
                " and in Surah Az-Zumar; 22: \"Can the",
                " person whose breast Allah has opened for",
                " Islam (sharahallabu sadrahu liI-Islam) and he is",
                " walking in the light shown by his",
                " Lord..\" At both.these places sharh sadr implies",
                " to free oneself from every kind of",
                " distraction and vacillation and to be satisfied",
                " with Islam as the only right way",
                " of Iife, and to regard the beliefs,",
                " principles of morality and civilization, religious instructions",
                " and injunctions, which Islam has given to",
                " man, as right and true.",
                "(2) In",
                " Surah Ash-Shu`ara': 12-13, it has been mentioned",
                " that when Allah appointed the Prophet Moses",
                " to the great office of Prophethood and",
                " commanded him to go and confront the",
                " Pharaoh and his mighty empire, he submitted:",
                " \"My Lord, I fear that they will",
                " treat me as a liar, and my",
                " breast straitens.\" And in Surah Ta Ha:",
                " 2526, it has been stated that on",
                " this very occasion the Prophet Moses implored",
                " Allah, saying: \"Lord, open up my breast",
                " for me (Rabbisbrah-li sadri) and make my",
                " task easy for me.\" Here, straitening of",
                " the breast implies a person's finding it",
                " too hard for himself to shoulder the",
                " onerous responsibilities of Prophethood and going out",
                " to clash with a mighty and tyrannical",
                " power of disbelief all by himself, and",
                " sharh sadr implies that his morale be",
                " boosted so that he is ready to",
                " undertake any campaign and any task however",
                " difficult and hard, without any hesitation, and",
                " he develops the nerve and courage to",
                " shoulder the great responsibilities of Prophethood.",
                "A",
                " littie consideration will show that in this",
                " verse \"opening up of the Holy Prophet's",
                " breast\" contains both these meanings. According to",
                " the first meaning, it implied that before",
                " the Prophethood the Holy Prophet (upon whom",
                " be peace) looked upon the religion of",
                " the polytheistic Arabs, Christians, Jews and fireworshippers",
                " as false, and was not even satisfied",
                " with the hanifiyyat prevalent among some of",
                " the Arab monotheists, for it was an",
                " ambiguous creed which contained no detail of",
                " the right way. (This we have explained",
                " in E.N.'s of AsSajdah). But since he",
                " himself did not know what was the",
                " right way, he was mentally confused and",
                " distracted. With the blessing of Prophethood Allah",
                " removed his mental agitation and opened up",
                " before him the way of right guidance,",
                " which brought him full peace of mind.",
                " According to the second meaning, it implies",
                " that along with the blessing of Prophethood",
                " Allah also blessed him with the courage,",
                " spirit ,of resolution and broad mindedness which",
                " were needed for shouldering the onerous responsibilities",
                " of the great office. He became bearer",
                " of the vast knowledge, which no other",
                " human mind could encompass and contain. He",
                " was blessed with the wisdom which could",
                " rectify any evil however grave and wide",
                " spread. He developed the capability to stand",
                " up without any equipmern and the apparent",
                " help and support of a worldy power",
                " as the standard-bearer of Islam in a",
                " society sunk in ignorance and barbarism, to",
                " brave any storm of hostility without the",
                " least hesitation, to endure patiently all the",
                " difficulties and hardships of the way 'so",
                " that no power might cause him to",
                " abandon his position and standpoint. Thus, The",
                " verse means to impress the point: \"When",
                " Allah has blessed you, O Prophet, with",
                " this invaluable wealth of sharh sadr, why",
                " do you feel distressed and depressed at",
                " the hardships you are experiencing in the",
                " initial stage of your mission.\"",
                "Some commentators",
                " have taken sharh sadr to mean shaqq",
                " Sadr (splitting up of the breast) and",
                " have declared this verse to be a",
                " proof of the miracle of sharh sadr",
                " as related in the traditions of the",
                " Hadith. But the fact is that the",
                " proof of that miracle is dependent only",
                " on the traditions of the Hadith, it",
                " is not correct to prove it from",
                " the Qur'an. According to the Arabic language,",
                " sharh sadr can in no way be",
                " taken to mean shaqq sadr. `Allama Alusi",
                " in the Ruh al-Ma'ani says:\"In the sight",
                " of the research scholars it is a",
                " weak thing to regard sharh sadr as",
                " shaqq sadr. \""
            ]
        },
        {
            "verse-id": "[94:2]",
            "verse": "And We removed from you your burden",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[94:3]",
            "verse": "Which had weighed upon your back",
            "description": [
                "Some of the commentators have interpreted this",
                " to mean that before Prophethood, in the",
                " days of ignorance, the Holy Prophet (upon",
                " whom be peace) had happened to commit",
                " certain errors because of which he was",
                " feeling disturbed, and Allah by sending down",
                " this verse consoled and satisfied him, saying",
                " that He had forgiven him those errors.",
                " But jn our opinion it is a",
                " grave mistake to interpret this verse thus.",
                " In the first place, the word vizr",
                " dces not necessarily mean a sin, but",
                " it is also used for a heavy",
                " burden. Therefore, there is no reason why",
                " it should in every case be taken",
                " in the bad sense. Secondly, the Holy",
                " Prophet's life before Prophethood also was so",
                " clean and pure that it had been",
                " presented in the Qur'an as a challenge",
                " before the opponents.. So much so that",
                " the Holy Prophet (upon whom be peace)",
                " was made to point out to the",
                " disbelievers: \"1 have already lived a lifetime",
                " among you before the revelation of this",
                " Qur'an.\" (Yunus 16). and he was also",
                " not the type of a person who",
                " would commit a sift secretly. God forbid,",
                " had he been such a man, Allah",
                " would not have been unaware of it,",
                " and would not have made him proclaim",
                " the thing before the people openly, which",
                " He made him proclaim in the above-mentioned",
                " verse of Sarah Yunus, if his person",
                " carried the blot of a sin committed",
                " secretly. Thus, in fact, in this verse",
                " vizr means a heavy burden and it",
                " implies the burden of distress, anguish and",
                " anxiety that was, telling on his sensitive",
                " nature when he saw- his nation deeply",
                " sunk in ignorance and barbarism. Idols were",
                " being worshipped, the community was engrossed in",
                " idolatry and polytheistic customs and practices, filth",
                " of immorality and indecency prevailed all around,",
                " wickedness and corrupt practices were rampant in",
                " society, the powerful were suppressing the powerless;",
                " girls were being-buried alive, tribes were subjecting,",
                " one another to surprise attacks, and sometimes",
                " the wars of vengeance continued for a",
                " hundred years at a stretch. No one's",
                " Iife, property and honour was safe unless",
                " he had a strong band at his",
                " back. This grieved the Holy Prophet (upon",
                " whom be peace) but he could find",
                " no way to cure the malady. This",
                " same anxiety was weighing down his back.",
                " Allah by showing him the way to",
                " Guidance removed its burden from him. Then",
                " as soon as he was appointed to",
                " the office of Prophethood, . he came",
                " to know that belief in the doctrine",
                " of Tauhid, the Hereafter and Prophethood was",
                " the master-key by which each corruption in",
                " human life could be eradicated and the",
                " way to reform opened in every aspect",
                " of life. This guidance front Allah relieved",
                " him of his burden and he felt",
                " re-assured that by means of it he",
                " would not only be able to cure",
                " the maladies of Arabia but also of",
                " all mankind outside Arabia as well."
            ]
        },
        {
            "verse-id": "[94:4]",
            "verse": "And raised high for you your repute.",
            "description": [
                "This was said at a time when",
                " o one could even conceive how the",
                " renown of the one unique individual who",
                " had only a few followers confined only",
                " to the city of Makkah, would be",
                " exalted throughout the world, and what high",
                " fame he would achieve. But Allah Almighty",
                " gave His Messenger (upon whom be peace)",
                " this good news under those very conditions",
                " and then fulfilled it in a strange",
                " way. In the first place, he took",
                " from his enemies themselves the task of",
                " exalting his renown. One of the methods",
                " that the disbelievers of Makkah adopted to",
                " defeat his mission was that in the",
                " Hajj season when the pilgrims from every",
                " corner of Arabia were attracted to their",
                " city, they would visit them at their",
                " halting places and would warn them to",
                " beware of a dangerous man called Muhammad",
                " (upon whom be Allah's peace and blessings),",
                " who they alleged, worked such magic on",
                " the people that father was separated from",
                " son, brother from brother, and husband from",
                " wife; therefore, they should keep away from",
                " him, The same thing they said to",
                " all other people, who visited Makkah on",
                " other than Hajj days in connection with",
                " pilgrimage or on other business. In this",
                " way although they were trying to defame",
                " the Holy Prophet, yet the result was",
                " that his name reached every nook and",
                " comer of Arabia and the enemies themselves.",
                " took him out of his seclusion in",
                " Makkah and introduced him among all the",
                " tribes of the country. After this, it",
                " was but natural that .'the people should",
                " become curious to know as to who",
                " was this man, what he preached, what",
                " was his character like and who were",
                " the people influenced by his magic and",
                " what sort of effect his \"magic\" had",
                " on them. As the propaganda of the",
                " Makkan disbelievers spread the people's curiosity also",
                " grew. When as a result of this",
                " curiosity the people came to know of",
                " the Holy Prophet's morals, his character and",
                " conduct, when they heard the Qur'an and",
                " found what teachings it presented and when",
                " the people saw how different the lives",
                " of those who had been influenced by",
                " what was being described as .magic had",
                " become from the lives of the common",
                " Arabs, the bad name started being changed",
                " into good name. So much so that",
                " by the time the Hijrah took place",
                " there was perhaps no tribe left anywhere",
                " in Arabia from which one or another",
                " person, one or another clan had not",
                " accepted Islam and in which at least",
                " some people had not developed sympathy and",
                " interest in the Holy Prophet and his",
                " message. This was the first stage of",
                " the exaltation of his renown. Then from",
                " the Hijrah started the second stage in",
                " which on the one hand the hypocrites,",
                " the Jews and the prominent polytheists of",
                " Arabia were actively engaged in defaming him",
                " and on the other the Islamic State",
                " of Madinah was presenting such a practical",
                " model of God-worship, God consciousness, piety and",
                " devotion, purity of morals and community life,",
                " justice and equity, equality of man and",
                " man, generosity of the rich, care of",
                " the poor, fulfilment of pledges and promises",
                " and righteousness in dealings, which was conquering",
                " the hearts, The enemies tried by resort",
                " to war to impede the growing influence",
                " of the Holy Prophet, but the party",
                " of the believers, trained and developed under",
                " his own leadership, proved its superiority by",
                " their discipline, their bravery, their fearlessness of",
                " death, and their adherence to restrictions of",
                " morality even in the state of war;",
                " so convincingly that entire Arabia had to",
                " recognize it as a power to be",
                " reckoned with. Within ten years the Holy",
                " Prophet's renown become so exalted that the",
                " same land in which the opponents had",
                " exerted their utmost to defame him, reverberated",
                " with the slogan of Ash hadu anna",
                " Muhammad ar-Rasul Allah from one end to",
                " the other. Then the third stage commenced",
                " with the establishment of the righteous Caliphate",
                " when his holy name started eing mentioned",
                " and praised everywhere in the world. This",
                " process continues till today, nd will continue",
                " till Resurrection if Allah so wills. Wherever",
                " in the world there exists a settlement",
                " of the Muslims, the apostleship of Muhammad",
                " (Upon whom be Allah's peace) is being",
                " proclaimed aloud in the call to the",
                " Prayer five times a day, blessings of",
                " Allah are being invoked on him in",
                " the Prayers, and his sacred remembrance is",
                " being made in the Friday Sermons. There",
                " is no moment in the 12 months",
                " of the year and in the 24",
                " hours of the day when at one",
                " or another place in the world, the",
                " oly Prophet's holy name is not being",
                " mentioned. This is a clear proof of",
                " the truth of the Qur'an that when",
                " in the initial stage of the Prophet",
                " hood Allah proclaimed wa rafa `na Iaka",
                " dhikrak, no one could estimate and imagine",
                " with what esteem and to what great",
                " extent the Holy Prophet's renown would be",
                " exalted. In a Hadith Hadrat Abu Sa`id",
                " Khudri has reported that the Holy Prophet",
                " (upon whom be peace) said: \"Gabriel came",
                " to me and said: My Lord and",
                " your Lord asks: In what ways have",
                " I exalted your renown? I submitted: Allah",
                " alone has the best. knowledge. He said:",
                " Allah says: Whenever mention 1S made of",
                " Me, yon too will be mentioned along",
                " with Me.\" (Ibn Jarir, lbn Abi Hatim,",
                " Musnad Abu Ya`la, Ibn al-Mundhir, Ibn Hibban",
                " Ibn Marduyah, Abu Nu`aim). The whole later",
                " history stands witness that this prediction has",
                " proved literally true."
            ]
        },
        {
            "verse-id": "[94:5]",
            "verse": "For indeed, with hardship [will be] ease.",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[94:6]",
            "verse": "Indeed, with hardship [will be] ease.",
            "description": [
                "This has been repeated twice so as",
                " to reassure the Holy Prophet that the",
                " bad times hp was passing through at",
                " that time would not last for ever,",
                " but were going to be replaced by",
                " good times in the near future. On",
                " the surface this appears to be a",
                " contradiction that hardship should be accompanied by",
                " ease, for these two things do not",
                " co-exist. But the words \"hardship with ease\"",
                " instead of \"ease after hardship\" have been",
                " used in the sense that the period",
                " of ease is so close to it",
                " as if it were a concomitant of",
                " it."
            ]
        },
        {
            "verse-id": "[94:7]",
            "verse": "So when you have finished [your duties], then stand up [for worship].",
            "description": [
                ""
            ]
        },
        {
            "verse-id": "[94:8]",
            "verse": "And to your Lord direct [your] longing.",
            "description": [
                "When you are free,\": When you are",
                " free from other occupations, whether occupations in",
                " connection with the preaching of Divine message,",
                " or teaching and training of the new",
                " converts, or domestic occupations of mundane nature.\"",
                " The commandment means: \"When you are no",
                " more occupied, you should spend your time",
                " in the labour and toil of Allah's",
                " worship and turn all your attention exclusively",
                " to your Lord.\""
            ]
        }
    ]
}