{
    "name": "Al-Alaq",
    "verse-count": 19,
    "verse-info": [
        {
            "id": "[96:1]",
            "verse": "Recite in the name of your Lord who created -",
            "description": [
                "As we have explained in the Introduction,",
                " when the Angel said to the Holy",
                " Prophet, \"Read\", the latter replied, \"I cannot",
                " read!\"\" This indicates that the Angel had",
                " presented these words of the Revelation before",
                " him in the written form and had",
                " asked him to read them. For if",
                " the Angel had meant that he should",
                " repeat what he recited, he should not",
                " have replied, saying \"I cannot read!\"",
                "*2)",
                " \"Read in the name of your Lord\":",
                " Bismillah and read. This shows that the",
                " Holy Prophet (upon whom be peace) even",
                " before the coming down of this Revelation",
                " regarded and acknowledged Allah alone as his",
                " Lord. That is why there was no",
                " need to ask who his Lord was,",
                " but it was said: \"Read in the",
                " name of your Lord.\"",
                "*3) Only the",
                " word khalaqa (created) 'has been used absolutely,",
                " and the object of creation has not",
                " been mentioned, This automatically gives the meaning:",
                " \"Read in the name of the Lord,",
                " Who is the Creator, Who created the",
                " whole universe and everything in it.\""
            ]
        },
        {
            "id": "[96:2]",
            "verse": "Created man from a clinging substance.",
            "description": [
                "After making mention generally of the creation",
                " of the universe, mention has been made",
                " of man in particular, saying how Allah",
                " made him a perfect tnan starting his",
                " creation from an insignificant and humble state.",
                " 'Alaq is plural of 'alaqah, which means",
                " congealed blood. This is the primary state",
                " of the embryo which appears a few",
                " days after conception. Then it assumes the",
                " form of a lump of flesh, then",
                " afterwards it gradually takes human shape. (For",
                " details, see AI-Hajj: 5 and the corresponding",
                " E.N.'s 5 to 7)."
            ]
        },
        {
            "id": "[96:3]",
            "verse": "Recite, and your Lord is the most Generous -",
            "description": [
                ""
            ]
        },
        {
            "id": "[96:4]",
            "verse": "Who taught by the pen -",
            "description": [
                "That is, \"It is a great favour",
                " of Allah that starting man's creation from",
                " a most insignificant state He made him",
                " possessor of knowledge which is the noblest",
                " attribute of creation, and He made him",
                " not only possessor of knowledge but also",
                " taught him the art of writing by",
                " the use of pen, which became the",
                " means of propagation, progress, dissemination and preservation",
                " of knowledge on a large scale. Had",
                " He not given tnan the knowledge of",
                " the art of pen and writing (by",
                " inspiration) his intellectual faculty would have stagnated,",
                " and it would have had no opportunity",
                " to develop, expand and become a means",
                " of transmission of knowledge from one generation",
                " to the next and make future progress.",
                ""
            ]
        },
        {
            "id": "[96:5]",
            "verse": "Taught man that which he knew not.",
            "description": [
                "That is, Man originally was absolutely illiterate.",
                " Whatever of knowledge he obtained, he obtained",
                " it as a gift from Allah. Whatever",
                " doors of knowledge at any stage did",
                " Allah will to open for man, they",
                " went on opining up before him. This",
                " same thing has been expressed in the",
                " verse of the Throne, thus: \"And the",
                " people cannot comprehend anything of His knowledge",
                " save what He Himself may please to",
                " reveal.\" (Al-Baqarah: 255). Whatever man looks upon",
                " as his own scientific discovery was, in",
                " fact, unknown to him before. Allah gave",
                " him its knowledge whenever He willed without",
                " his realizing that Allah by His grace",
                " had blessed him with the knowledge of",
                " it.",
                "These verses were the very first",
                " to be revealed to the Holy Prophet",
                " (upon whom be peace), as is stated",
                " in the Hadith reported by Hadrat `A'ishah.",
                " This first experience was so intense and",
                " tremendous that the Holy Prophet could not",
                " bear it any more. Therefore, at that",
                " time he was only made aware that",
                " the Being Whom he already knew and",
                " acknowledged as his Lord and Sustainer was",
                " in direct communion with him, had started",
                " sending down Revelations to him, and had",
                " appointed him as His Prophet. Then after",
                " an intermission the opening verses of Surah",
                " al-Muddaththir were revealed in which he was",
                " told what mission he had to perform",
                " after his appointment to Prophethood. (For explanation,",
                " see Introduction to Al-Muddaththir)"
            ]
        },
        {
            "id": "[96:6]",
            "verse": "No! [But] indeed, man transgresses",
            "description": [
                "That is, man should never adopt an",
                " attitude of ignorance and rebellion against the",
                " Bountiful God Who has been so generous",
                " to him"
            ]
        },
        {
            "id": "[96:7]",
            "verse": "Because he sees himself self-sufficient.",
            "description": [
                "That is, when the man has attained",
                " wealth, honour and rank and whatever else",
                " he desired to attain in the world,",
                " he becomes rebellious instead of being grateful",
                " and transgresses the boundaries of servitude to",
                " Allah."
            ]
        },
        {
            "id": "[96:8]",
            "verse": "Indeed, to your Lord is the return.",
            "description": [
                "That is, \"Whatever he might have attained",
                " in the world, which makes ,him behave",
                " arrogantly and rebelliously, in the end he",
                " has to return to your Lord. Then",
                " he will realize what fate awaits him",
                " in consequence of his such attitude and",
                " behaviour.\""
            ]
        },
        {
            "id": "[96:9]",
            "verse": "Have you seen the one who forbids",
            "description": [
                ""
            ]
        },
        {
            "id": "[96:10]",
            "verse": "A servant when he prays?",
            "description": [
                "\"A Servant\" : the Holy Messenger of",
                " Allah himself. The Holy Prophet has been",
                " mentioned by this epithet at several places",
                " in the Qur'an. For example, \"Glory be",
                " to Him Who transported His servant one",
                " night from the Masjid alHaram to the",
                " distant Temple.\" (Bani Isra'il: 1); \"All praise",
                " is for Allah Who has sent down",
                " this Book to His servant.\" (AI-Kahf: 1);",
                " \"And that when the servant of Allah",
                " stood up to pray, the people got",
                " ready to assault him.\" (Al-Jinn: 19). This",
                " shows that it is a special style",
                " of love by which Allah makes mention",
                " of His Messenger Muhammad (upon whom be",
                " His peace and blessings) in His Book.",
                " Besides, it also shows that AIiah after",
                " appointing His Messenger to Prophethood had taught",
                " him the method of performing the Prayer.",
                " There is no mention of this method",
                " anywhere in the Qur'an, saying: \"O Prophet,",
                " perform the Prayer in this and this",
                " way.\" Hence, this is another proof that",
                " the Revelation sent down to the Holy",
                " Prophet did not only consist of what",
                " has been recorded in the Qur'an, but",
                " besides this, other things also were taught",
                " to him by revelation, which are not",
                " recorded in the Qur'an."
            ]
        },
        {
            "id": "[96:11]",
            "verse": "Have you seen if he is upon guidance",
            "description": [
                ""
            ]
        },
        {
            "id": "[96:12]",
            "verse": "Or enjoins righteousness?",
            "description": [
                ""
            ]
        },
        {
            "id": "[96:13]",
            "verse": "Have you seen if he denies and turns away -",
            "description": [
                ""
            ]
        },
        {
            "id": "[96:14]",
            "verse": "Does he not know that Allah sees?",
            "description": [
                "The audience here apparently is every just",
                " man, who is being asked: Have you",
                " watched the act of the person who",
                " prevents a Servant from God's worship? What",
                " do you think: if the Servant be",
                " rightly guided, or warning the people to",
                " fear God and refrain from evil, and",
                " this forbidden be denying the Truth and",
                " turning away from it, what will his",
                " act be like? Could this man adopt",
                " such an attitude had he known that",
                " Allah is watching the man who is",
                " exhorting others to piety as well as",
                " him who is denying the truth and",
                " turning away from it? Allah's watching the",
                " oppressor and his wrongdoing and the oppressed",
                " and his misery by itself implies that",
                " He will punish the oppressor and redress",
                " the grievances of the wronged and down-trodden",
                " person."
            ]
        },
        {
            "id": "[96:15]",
            "verse": "No! If he does not desist, We will surely drag him by the forelock -",
            "description": [
                "That is, the person who threatens that",
                " he would trample the neck of Muhammad",
                " (upon whom be Allah's peace and blessings)",
                " down when he performed the Prayer, would",
                " never be able to do so."
            ]
        },
        {
            "id": "[96:16]",
            "verse": "A lying, sinning forelock.",
            "description": [
                "\"The forelock\" here implies the person with",
                " the forelock."
            ]
        },
        {
            "id": "[96:17]",
            "verse": "Then let him call his associates;",
            "description": [
                "As we have explained in the Introduction,",
                " when the Holy Prophet (upon whom be",
                " peace) rebuked Abu Jahl on his foolish",
                " behaviour, he had retorted: \"O Muhammad, on",
                " what strength do you threaten me? By",
                " God, my supporters in this valley far",
                " exceed yours in number.\" At this it",
                " is being said: \"Let him call his",
                " band of supporters.\""
            ]
        },
        {
            "id": "[96:18]",
            "verse": "We will call the angels of Hell.",
            "description": [
                "According to the explanation given by Qatadah,",
                " the word zabaniyah in the original, is",
                " used for the police in Arabic idiom,",
                " and zaban actually means to push away.",
                " The kings too kept armed attendants who",
                " would push out the one with whom",
                " the king was annoyed and angry. Therefore,",
                " what Allah means is: \"Let him call",
                " his supporters; We too shall summon Our",
                " Police, i.e. the angels of torment, to",
                " deal with him and his supporters.\""
            ]
        },
        {
            "id": "[96:19]",
            "verse": "No! Do not obey him. But prostrate and draw near [to Allah].",
            "description": [
                "\"Sajdah\" (prostration) here implies the Prayer, so",
                " as to say: \"O Prophet, continue to",
                " perform your Prayer fearlessly as you have",
                " been in the past, and seek your",
                " Lord's presence through it.\" In the Sahih",
                " of Muslim and other books of Hadith",
                " there is a tradition from Hadrat Abu",
                " Huraira to the effect: \"The servant is",
                " nearest to his Lord when he is",
                " in the state of prostration\", and in",
                " Muslim there is also a tradition from",
                " Hadrat Abu Hurairah that when the Holy",
                " Prophet recited this verse, he performed a",
                " sajdah of recital."
            ]
        }
    ]
}