{
    "Summary": [
        "Among Sunni Muslims, the key practices of Islam are referred to",
        " as “The Five Pillars” and include: shahadah(statement of faith), salat (prayer",
        " five times a day), zakat (giving a portion of one’s possession,",
        " usually 2.5% of annualwealth, through local mosques or organizations), sawm (fasting",
        " from sunrise to sunset in the month of Ramadan), and Hajj(pilgrimage",
        " to the Ka’bah in Mecca during the month of Dhu’l-Hijjah). Though",
        " these five key practices are observed by otherMuslim denominations, Shi’a Muslims",
        " add others like khums (yearly tax given to the Imams) and",
        " walayah (acceptance andadoration of the Imams). Islamic practices are also constantly",
        " in dialogue with societal changes and advancements."
    ],
    "Verse": [
        "“Righteousness does not consist in turning your face towards the East or West. The truly good are those",
        "who believe in God and the Last Day, in the angels, the Scripture, and the prophets; who give away",
        "some of their wealth, however much they cherish it, to their relatives, to orphans, the needy, travelers",
        "and beggars, and to liberate those in bondage; those who keep up the prayer (salat) and pay the",
        "prescribed alms (zakat); who keep pledges whenever they make them; who are steadfast in misfortune,",
        "adversity, and times of danger. These are the ones who are true, and it is they who are aware of God.”",
        "(Qur'an 2:177, trans. Abdel Haleem)."
    ],
    "Description": [
        "Muslims are called to perform certain regular acts of worship which increase their sense of",
        "God-consciousness (taqwa), and discipline their attitudes toward others as well as the use of their time",
        "and property. These acts of worship according to Sunni Muslims are called the \"Five Pillars of Islam”.",
        "They are based on the Qur’an and Sunnah as interpreted by scholars of Islamic law (‘ulama). The Five",
        "Pillars are: the shahadah, salat, zakat, sawm, and Hajj. These grounding commitments shape the lives",
        "and practices of Muslims throughout the world, including in America."
    ],
    "5-Pillars": {
        "1-Shahadah": [
            "The shahadah, “witness” or profession of faith, is repeated with every",
            " prayer: “I bearwitness that there is no god but God, and",
            " Muhammad is God’s Messenger.” The belief in God’s oneness,or tauhid, and",
            " the prophethood of Muhammad is the first step of one’s lifelong",
            " journey as a Muslim."
        ],
        "2-Salat": [
            "Muslims perform the ritual prayers—salat—five times a day, just as Muhammad",
            " did. Standing,bowing, kneeling, and prostrating the body before God and reciting",
            " Qur’anic passages teach humilityand trust in God. Prayers are performed five",
            " times a day: at dawn, midday, afternoon, sunset, andnightfall. While it",
            " is preferable to pray in a mosque with fellow believers, it",
            " is also permissible to prayalone in a clean place. Many families",
            " pray together in their homes, at least in the morning and",
            " evening.Before the prayers, Muslims remove their shoes, perform ritual ablutions, and",
            " state their intention toworship. In the mosque, prayers are often led",
            " by an imam, or the religious leader. Prayers are performedin cycles",
            " of bowing and prostration called rak’at. Muslims, wherever they are, pray",
            " in the direction ofthe Ka’bah in Mecca (qiblah), usually marked by",
            " a niche in a mosque wall (mihrab). The Fridaycommunal prayer, known",
            " as salat al-jumu’ah, occurs every week and includes a sermon followed",
            " by aspecial prayer, which replaces the midday salat. Around the world,",
            " millions of Muslims pray five timesdaily, orienting their lives—individually and collectively—toward",
            " God."
        ],
        "3-Zakat": [
            "Zakat literally means “purification”—a payment of a portion of one’s wealth",
            " to purify the restand to ensure justice in society. Used to",
            " help the needy members of a community or those working forjust",
            " causes, the zakat is part of the larger Islamic vision of",
            " social justice. While Muslims are encouragedto pursue economic and social gain,",
            " they are also reminded to use their wealth unselfishly and to",
            " care forothers less fortunate. The rate of zakat is generally 2.5",
            " percent of annual accumulated wealth, includingsavings and nonessential property; in some",
            " countries it is collected and distributed by the government.American Muslims often",
            " distribute their zakat through local mosques and Muslim organizations.Muslim relief agencies",
            " are at work throughout the world today, and American Muslims run",
            " specialprograms through zakat contributions—from soup kitchens to refugee relief."
        ],
        "4-Sawm": [
            "The first revelation of the Qur’an came to Muhammad during the",
            " lunar month of Ramadan.Every year during this month, Muslims perform a",
            " daily fast (sawm). They are obliged to abstain fromfood, water, sexual",
            " activity and evil thoughts during the daylight fasting hours. Ramadan is",
            " a time ofdiscipline for the spirit as well as the body,",
            " a time to cultivate patience and commitment. The fast alsoreminds the",
            " faithful of those who are hungry every day, underscoring the need",
            " for social justice. ManyMuslims perform special nightly prayers during this time,",
            " known as salat al-tarawih, in which theentirety of the Qur’an is",
            " recited throughout the month. Ramadan is also a time of community",
            " solidarity,as meals and festivities are shared with family and friends after",
            " sunset. "
        ],
        "5-Hajj": [
            "The final pillar of Islam is the Hajj, or pilgrimage to",
            " the Ka’bah in Mecca, performed duringDhu’l-Hijjah, the last lunar month of",
            " the Muslim calendar. The Hajj recalls the faithfulness of ProphetAbraham who",
            " was ready to sacrifice his son Ishmael at God’s command, though",
            " it was only a trial fromGod. It is both joy and",
            " faithfulness that brings millions of Muslims from all over the world",
            " to Mecca forthis pilgrimage. The Hajj is required at least once",
            " of every Muslim in good health and with the financialmeans. It",
            " brings together the world-wide Muslim community (ummah), making clear that Muslims",
            " of allraces, ethnic groups, and cultures are equal in God’s presence,",
            " all wearing the same simple whitegarment, walking and praying and eating",
            " together in the most holy places.Though non-Sunni denominations practice these same",
            " five pillars, they may add to or interpret themslightly differently. For",
            " instance, Twelver Shi’as recognize khums, a yearly tax of 1/5th of",
            " one’s surplusannual income (after expenses) paid to the Imams, the twelve",
            " patrilineal descendants of Muhammad, asa primary practice. Since the twelfth Imam’s",
            " disappearance in the 9th century CE, khums is paid insteadto marjas",
            " (also referred to as the Grand Ayatollahs) who act as representatives",
            " of the Imams. Theydistribute it to the needy and orphans, and",
            " spend it for the upkeep of the community. Isma’ili Shi’as paya",
            " khums amount of 1/10th directly to the presently living Imam. While",
            " zakat is also paid by Shi’aMuslims, khums is restricted to the",
            " needy and orphans who are descendants of the Prophet Muhammad’sfamily. Another",
            " primary difference is walaya. This refers to accepting the religious and",
            " spiritualauthority of the Imams, in addition to expressing love and adoration",
            " of them. Due to the importance ofthis pillar, a third profession",
            " of faith is often added to the shahadah for Shi’a Muslims:",
            " “I bear witnessthat Ali is the vicegerent (wali) of God.”Though the",
            " form of these practices has remained constant since the earliest period,",
            " their implementationand finer details are in constant dialogue with societal, technological,",
            " and scientific changes. Forinstance, Muslims and scholars of Islamic law today",
            " discuss whether stocks should be counted underzakat, if medical injections break",
            " the fast or not, and how Hajj should be adapted to",
            " accommodate theincreasing number of pilgrims."
        ]
    }
}