{
    "Source": "https://madrasatelquran.com/",
    "Description": [
        "The Faith or Iman in the Arabic language means to affirm something",
        " and to comply with it. Accordingly, faith is an affirmation and not",
        " merely belief. Affirmation includes the words of the heart, which is the",
        " belief, and the actions of the heart, which is compliance."
    ],
    "6-Pillars": {
        "Pillar-1": {
            "Belief in the existence and unicity of Allah": [
                "It’s the first and most important pillar. To believe in Allah",
                " is to believe that there is only one God worthy of",
                " worship, with no partner, or son. This concept is known as",
                " Tawheed. Also, it is to completely believe in the way he",
                " is described in the Quran, Sunnah and in his 99 names.Allah",
                " clearly explains Tawheed in the Holy Qur’an as He says in",
                " Surah Ikhlas:“قُلْ هُوَ اللَّهُ أَحَدٌ ، اللَّهُ الصَّمَدُ ، لَمْ يَلِدْ",
                " وَلَمْ يُولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ”“Say, He is Allah,",
                " [who is] One, Allah, the Eternal Refuge. He neither begets nor",
                " is born, Nor is there to Him any equivalent.”"
            ]
        },
        "Pillar-2": {
            "Belief in the existence of Angels": [
                "The second pillar is to believe in Allah’s angels. They are",
                " not his children as some may think. They were created from",
                " light and were created before humans for the purpose of worshipping",
                " Allah.Angels do not sleep, eat or suffer from illnesses. It is",
                " crucial to believe in the angels, as they keep a record",
                " of our deeds. Some of the other duties of angles include:",
                " blowing the trumpet on judgment day, taking people’s souls (i.e. angel",
                " of death) and to be the keepers of heaven and hell.Allah",
                " clearly confirmed the importance of this pillar in the Holy Qur’an",
                " as He says in Surah An-Nisa:“يَا أَيُّهَا الَّذِينَ آمَنُواْ آمِنُواْ بِاللَّهِ",
                " وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِيَ أَنزَلَ مِن قَبْلُ",
                " وَمَن يَكْفُرْ بِاللَّهِ وَمَلائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الآخِرِ فَقَدْ ضَلَّ ضَلالاً",
                " بَعِيدًا”“O you who have believed, believe in Allah and His Messenger",
                " and the Book that He sent down upon His Messenger and",
                " the Scripture which He sent down before. And whoever disbelieves in",
                " Allah, His angels, His books, His messengers, and the Last Day",
                " has certainly gone far astray.”"
            ]
        },
        "Pillar-3": {
            "Belief in the books of Allah": [
                "The third pillar is to believe in the books of Allah",
                " which delivered to the nations by the messengers. Allah revealed books",
                " to his messengers as a form of guidance and proof for",
                " mankind. Among these books, is the Quran, which was revealed to",
                " Prophet Muhammad.Allah has guaranteed the protection of the Quran from any",
                " distortion or corruption and clearly mentioned that in the Holy Qur’an",
                " as He says in Surah Al-Hijr:“إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ",
                " لَحَافِظُونَ”“Indeed, it is We who sent down the Qur’an and indeed,",
                " We will be its guardian.”The books that were sent and known",
                " to mankind are:The Scrolls (Suhof) that Allah revealed to the Prophet",
                " Ibrahim, peace be upon himThe Psalms (Zaboor) that Allah revealed to",
                " the Prophet Dawud (David), peace be upon himThe Torah (Torah) that",
                " Allah revealed to the Prophet Musa (Moses), peace be upon himThe",
                " Gospel (Injeel) that Allah revealed to the Prophet Isa (Jesus), peace",
                " be upon himThe Quran which sent with the last Prophet Muhammad,",
                " peace be upon himMuslims believe in all of the books revealed",
                " to the messengers. However, they only follow the Quran, as it",
                " is the final revelation, and aims to implement the rulings into",
                " their daily lives."
            ]
        },
        "Pillar-4": {
            "Belief in Allah’s messengers and that Muhammad is the last of them": [
                "The fourth pillar is to believe in all prophets and messengers",
                " sent by Allah and that the prophet Muhammad, peace be upon",
                " him, is the last of them.Most of the messengers of Allah",
                " were sent to a specific nation except Prophet Muhammad, who was",
                " sent to guide all of mankind. It is a duty of",
                " Muslims to send salaams (Peace and Blessings of Allah) when mentioning",
                " the names of any of the Prophets.Allah clearly mentioned that he",
                " sent the messengers in the Holy Qur’an as He says in",
                " Surah An-Nahl:“وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولاً أَنِ اعْبُدُواْ اللَّهَ وَاجْتَنِبُواْ",
                " الطَّاغُوتَ فَمِنْهُم مَّنْ هَدَى اللَّهُ وَمِنْهُم مَّنْ حَقَّتْ عَلَيْهِ الضَّلالَةُ فَسِيرُواْ",
                " فِي الأَرْضِ فَانظُرُواْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ”And We certainly sent into",
                " every nation a messenger, [saying], “Worship Allah and avoid Taghut.” And",
                " among them were those whom Allah guided, and among them were",
                " those upon whom error was [deservedly] decreed. So proceed through the",
                " earth and observe how was the end of the deniers."
            ]
        },
        "Pillar-5": {
            "Belief in the Day of Judgment": [
                "Muslims attest to the truth of everything Allah or his messenger,",
                " sallallahu ‘alayhi wa sallam, said about death.Allah has not created his",
                " creation in vain. He created men and jinn to worship him",
                " and promised paradise as a reward to those who obey him",
                " and his messengers, and promised hellfire to those who disobey him",
                " or his messengers.Allah has set a certain period for the whole",
                " universe, whose end will be the final hour. During the final",
                " hour, humans will be questioned about their deeds in this world.",
                " Those deeds will be weighed for them. One whose good deeds",
                " overweigh his evil deeds will prosper, while whose bad deeds outweigh",
                " his good ones will be condemned to hellfire – unless he",
                " died in the state of Islam. Then, Allah would either forgive",
                " him or punish him, and eventually, he would enter paradise.Allah described",
                " justice of the judgment day in the Holy Qur’an as He",
                " says in Surah Al-Anbya:“وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلا تُظْلَمُ نَفْسٌ",
                " شَيْئًا وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا وَكَفَى بِنَا",
                " حَاسِبِينَ”“And We place the scales of justice for the Day of",
                " Resurrection, so no soul will be treated unjustly at all. And",
                " if there is [even] the weight of a mustard seed, We",
                " will bring it forth. And sufficient are We as accountant.”"
            ]
        },
        "Pillar-6": {
            "Belief in the Qadhaa’ & Qadr (Doom & Divine Decree)": [
                "Doom (Qadhaa’) is the general decree of Allah that every human",
                " shall die, whereas a divine decree (Qadr) is a particular decree",
                " of Allah or the execution of Qadhaa’, that a certain person",
                " is to die at a particular time and place. Hence, believing",
                " in this pillar entails believing that Allah has created everything and",
                " has foreordained its proper measure.Moreover, The belief in Divine Predestination includes",
                " belief in four things:Allah is well acquainted with everything taking place,",
                " and His Knowledge encompasses everything.Allah has pre-assigned portions of everything in",
                " the preserved tablet.Nothing takes place in the heavens or on the",
                " earth without the will of Allah and his wish. Whatever Allah",
                " wills, takes place and whatever he does not, will do not",
                " take place.Allah is the creator of all things. There is no",
                " other creator besides him."
            ]
        }
    }
}