{
    "title": [
        "The six Kalmas or Kalimas in Islam are integral to the Islamic",
        " faith. These Kalmas highlight Islam's primary and most essential principles that form",
        " the core of the religion. The second Kalmah, Kalma-e-Shahadat, is so essential",
        " that it must be recited to become a Muslim."
    ],
    "kalimas": {
        "1": {
            "description": "The First Kalma (Tayyab) reinforces the fundamental belief required by a Muslim to be a true believer, i.e., the Oneness of Allah.",
            "ar-text": [
                "لَآ اِلٰهَ اِلَّا اللّٰهُ مُحَمَّدٌ رَّسُوْلُ اللّٰهِ ؕ"
            ],
            "en-text": [
                "lā ilāha illā-llāh, muhammadu rasūl u-llāh"
            ],
            "transliteration": [
                "There is no god but Allah, [and] Muhammad [PBUH] is the",
                " messenger of Allah"
            ]
        },
        "2": {
            "description": "The Second Kalma (Shahadat) testifies that a Muslim believes in the Oneness of Allah and that the Prophet Muhammad (ﷺ) is His last Messenger.",
            "ar-text": [
                "اَشْهَدُ اَنْ لَّآ اِلٰهَ اِلَّا اللّٰهُ وَحْدَهٗ لَا شَرِيْكَ لَهٗ وَاَشْهَدُ اَنَّ",
                " مُحَمَّدًا عَبْدُهٗ وَرَسُوْلُهٗ ؕ"
            ],
            "en-text": [
                "Ashadu an lā ilāha illā-llāh waḥdahu lā sarīka lahu, wa ashadu anna",
                " muḥammadan ʿabduhu wa rasūluhu"
            ],
            "transliteration": [
                "I bear witness that (there is) no god except Allah; One",
                " is He, no partner hath He, and I bear witness that",
                " Muhammad [PBUH] is His Servant and Messenger"
            ]
        },
        "3": {
            "description": "The Third Kalma (Tamjeed) narrates the glorification of Allah (سُبْحَانَهُ وَتَعَالَى).",
            "ar-text": [
                "سُبْحَانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَآ اِلٰهَ اِلَّااللّٰهُ وَاللّٰهُ اَكْبَرُ ؕ وَلَآ حَوْلَ",
                " وَلَا قُوَّةَ اِلَّا بِاللّٰهِ الْعَلِىِّ الْعَظِيْم ؕ"
            ],
            "en-text": [
                "Subḥāna-llāhi, wa-l-ḥamdu li-llāhi, wa lā ilāha illā-llāhu, Wa-llāhu akbar, Wa lā ḥawla",
                " wa lā quwwata illā bi-llāhi-l-ʿalīyyi-l-ʿaẓīm"
            ],
            "transliteration": [
                "Exalted is Allah, and praise be to Allah, and there is",
                " no deity except Allah, and Allah is the Greatest. And there",
                " is no might nor power except in Allah, the Most High,",
                " the Most Great"
            ]
        },
        "4": {
            "description": "The Fourth Kalma (Tauheed) strengthens faith in the Oneness of Allah (سُبْحَانَهُ وَتَعَالَى).",
            "ar-text": [
                "لَآ اِلٰهَ اِلَّا اللّٰهُ وَحْدَهٗ لَا شَرِيْكَ لَهٗ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ",
                " يُحْىٖ وَيُمِيْتُ وَهُوَ حَئٌّ لَّا يَمُوْتُ اَبَدًا اَبَدًاؕ ذُوالْجَلَالِ وَالْاِكْرَامِؕ بِيَدِهِ الْخَيْرُ",
                " وَهُوَ عَلٰى كُلِّ شَىْءٍ قَدِیْرٌ ؕ"
            ],
            "en-text": [
                "lā ilāha illā-llāhu waḥdahu lā sharīka lahu lahu l-mulku wa lahu l-ḥamdu",
                " yuḥyi wa yumītu wa huwa ḥayyu lā yamūtu abadan abadan dhu l-jalāli",
                " wa l-ʾikrām biyadihi-l khayr wa-huwa ʿala-kulli shayʾin qadīr"
            ],
            "transliteration": [
                "(There is) no god except Allah - One is He, no",
                " partners hath He. His is the Dominion, and His is the",
                " Praise. He gives life and causes death, and He is Living,",
                " who will not die, never. He of Majesty and Munificence. Within",
                " His Hand is (all) good. And He is, upon everything, Able",
                " (to exert His Will)"
            ]
        },
        "5": {
            "description": "The Fifth Kalma (Astaghfaar) asks for repentance and forgiveness from Allah (سُبْحَانَهُ وَتَعَالَى).",
            "ar-text": [
                "اَسْتَغْفِرُ اللّٰهَ رَبِّىْ مِنْ كُلِّ ذَنْۢبٍ اَذْنَبْتُهٗ عَمَدًا اَوْ خَطَاءً سِرًّا اَوْعَلَانِيَةً",
                " وَّاَتُوْبُ اِلَيْهِ مِنَ الذَّنْۢبِ الَّذِیْٓ اَعْلَمُ وَمِنَ الذَّنْۢبِ الَّذِىْ لَآ اَعْلَمُ اِنَّكَ",
                " اَنْتَ عَلَّامُ الْغُيُوْبِ وَسَتَّارُ الْعُيُوْبِ وَغَفَّارُ الذُّنُوْبِ وَلَا حَوْلَ وَلَا قُوَّةَ اِلَّا",
                " بِاللّٰهِ الْعَلِىِّ الْعَظِيْم ؕ"
            ],
            "en-text": [
                "astaghfiru-llāha rabbī min kulli dhanbin adnabtuhu ʿamadan ʾaw khaṭāʾan sirran ʾaw ʿalāniyyataw",
                " wa atūbu ʾilayhi minal dhanbi-lladhī aʿlamu wa minal dhanbi-lladhī lā aʿlamu innaka",
                " ʾanta ʿallāmul-ghuyūbi wa sattārul-ʿuyūbi wa ghaffāru dhunūbi wa lā ḥawla wa lā",
                " quwwata illā billāhil-ʿalīyyil-ʿaẓīm"
            ],
            "transliteration": [
                "I seek forgiveness from Allah, my Lord, from every sin I",
                " committed knowingly or unknowingly, secretly or openly, and I turn towards",
                " Him from the sin that I know and from the sin",
                " that I do not know. Certainly You, You (are) the knower",
                " of the hidden things and the Concealer (of) the mistakes and",
                " the Forgiver (of) the sins. And (there is) no power and",
                " no strength except from Allah, the Most High, the Most Great",
                ""
            ]
        },
        "6": {
            "description": "The Sixth Kalma (Radd-e-Kufr) discards disbelief and submits completely to Allah (سُبْحَانَهُ وَتَعَالَى).",
            "ar-text": [
                "اَللّٰهُمَّ اِنّىِ اَعُوْذُبِكَ مِنْ اَنْ اُشْرِكَ بِكَ شَيْئًا وَّاَنَآ اَعْلَمُ بِهٖ وَاَسْتَغْفِرُكَ",
                " لِمَا لَآ اَعْلَمُ بِهٖ تُبْتُ عَنْهُ وَتَبَرَّأْتُ مِنَ الْكُفْرِ وَالشِّرْكِ وَالْكِذْبِ وَالْغِيْبَةِ",
                " وَالْبِدْعَةِ وَالنَّمِيْمَةِ وَالْفَوَاحِشِ وَالْبُهْتَانِ وَالْمَعَاصِىْ كُلِّهَا وَاَسْلَمْتُ وَاَقُوْلُ لَآ اِلٰهَ اِلَّا اللّٰهُ",
                " مُحَمَّدٌ رَّسُوْلُ اللّٰهِ ؕ"
            ],
            "en-text": [
                "Allāhumma innī aʿūḏu bika min an usrika bika sayʾaw-wwa-anā aʿlamu bihi wa-staġfiruka",
                " limā lā aʿlamu bihi tubtu ʿanhu wa tabarra'tu mina-l-kufri wa-s-sirki wa-l-kiḏhbi wa-l-ġībati",
                " wa-l-bidʿati wa-nnamīmati wa-l-fawāḥisi wa-l-buhtāni wa-l-maʿāṣī kullihā wa aslamtu wa aqūlu lā ilāha",
                " illā-llāhu Muḥammadu-r-rasūlu llāh"
            ],
            "transliteration": [
                "O Allah! I seek protection in You from that I should",
                " not join any partner with You and I have knowledge of",
                " it. I seek Your forgiveness from that which I do not",
                " know. I repent from it (ignorance) and I reject disbelief and",
                " joining partners with You and of falsehood and slandering and innovation",
                " in religion and tell-tales and evil deeds and the blame and",
                " the disobedience, all of them. I submit to Your will and",
                " I believe and I declare: There is none worthy of worship",
                " except Allah and Muhammad [PBUH] is His Messenger"
            ]
        }
    }
}