{
    "title": "Attending A Muslim Funeral – A Guide For Non‐Muslims",
    "contents": {
        "Near Death": [
            "When a Muslim is near death, those around him or her are called upon to give comfort, and reminders of God's mercy and",
            "forgiveness. They are encouraged to recite verses from the Holy Qur’ãn, and the dying may also recite words of prayer. It is",
            "recommended, for a Muslim's last words to be the declaration of faith, that is, \"I bear witness that there is no god but Allãh.\"",
            "However, there should be no coercion to recite this statement. Beyond this, efforts should be made to make the last moments",
            "as comfortable for the individual as possible. Offering water and physical comfort is recommended."
        ],
        "Upon Death": [
            "Upon death, those with the deceased are encouraged to remain calm, pray for the departed, and begin preparations for",
            "burial. Grief is normal when one has lost a loved one, and it is natural and permitted to cry. One should strive to be patient",
            "and to remember that God is the One who gives life and takes it away – at a time He decides – and that it is not for us to",
            "question His wisdom."
        ],
        "The Funeral": [
            "A loss of an individual is not just regarded as a loss to the family but to the whole Muslim community as well. For this reason,",
            "it is common for people who may not know an individual personally to attend his/her funeral. In fact, Muslims are encouraged",
            "to attend any Muslim’s funeral due to the profound personal, social and spiritual significance of such an event.",
            "Muslims strive to bury the deceased as soon as possible after death therefore it is not unusual for the deceased to be buried",
            "within 24 hours of their death. The main steps involved are washing the body of the deceased, shrouding it, performance of",
            "the funeral prayer and finally burial. The first two steps are performed only by selected relatives and community members",
            "due  to  the  intimacy  involved  with  the  body. The  funeral  prayer  is  a Muslim ritual  which must  be  performed  by Muslims,",
            "though observers are welcome."
        ],
        "Etiquettes": [
            "There are also some matters regarding etiquette that one should be aware of when attending the burial. Women from the",
            "Muslim faith commonly do not attend the burial however should non-Muslim women wish to attend the advice given below",
            "should be noted.",
            "The dress code for Men and Women should be modest. This means shirt and trousers for men and an ankle length skirt for",
            "women,  which  should  not  be  tight  or  transparent,  together  with  a  long  sleeved  and high‐necked  top  for  the  women.  A",
            "headscarf is also essential for women. Shoes are removed before going into the prayer hall. Clean and presentable socks,",
            "stockings, or tights are therefore a good idea.",
            "The congregation will line up in rows behind the deceased coffin to perform the Funeral prayer. It should be noted here that",
            "the funeral prayer is performed for the deceased and not to the deceased. Following its completion, the congregation will",
            "form two lines and pass the coffin from shoulder to shoulder taking it towards the grave site.",
            "Visitors are welcome to follow the congregation as they move the coffin towards the grave however a short distance should",
            "be kept thereby allowing the congregation walking space to carry the coffin.",
            "Once at the grave the coffin will be lowered, usually by members of the family, and the gravesite filled. The Imam will then",
            "say a few final prayers at the graveside and following this, the congregation will disperse.",
            "The  immediate  members  of  the  family  will  most  likely  remain  at  the  graveside  for  a  short  while  longer;  this  may  be  an",
            "opportune time for visitors to convey their condolences if they so wish.",
            "It should be noted that grief and the way it is handled is dependent on people’s cultural influences and therefore the above",
            "advice should be treated as general guidance.",
            "The above guide has been produced by the Muslim Burial Council of Leicester which has kindly given permission for it to be reproduced",
            "here."
        ]
    }
}