{
    "6th Century (500-599) C.E.": [
        "545 - Birth of Abdullah, the Holy Prophet's father.",
        "571 - Birth of the Holy Prophet. Year of the Elephant. Invasion of Makkah by Abraha the Viceroy of Yemen, his retreat.",
        "577 - The Holy Prophet visits Madina with his mother. Death of his mother.",
        "580 - Death of Abdul Muttalib, the grandfather of the Holy Prophet.",
        "583 - The Holy Prophet's journey to Syria in the company of his uncle Abu Talib. His meeting with the monk Bahira at Bisra who foretells of his prophethood.",
        "586 - The Holy Prophet participates in the war of Fijar.",
        "591 - The Holy Prophet becomes an active member of \"Hilful Fudul\", a league for the relief of the distressed.",
        "594 - The Holy Prophet becomes the Manager of the business of Lady Khadija, and leads her trade caravan to Syria and back.",
        "595 - The Holy Prophet marries Hadrat Khadija."
    ],
    "7th Century (600-699) C.E.": [
        "605 - The Holy Prophet arbitrates in a dispute among the Quraish about the placing of the Black Stone in the Kaaba.",
        "610 - The first revelation in the cave at Mt. Hira. The Holy Prophet is commissioned as the Messenger of God.",
        "613 - Declaration at Mt. Safa inviting the general public to Islam.",
        "614 - Invitation to the Hashimites to accept Islam.",
        "615 - Persecution of the Muslims by the Quraish. A party of Muslims leaves for Abyssinia.",
        "616 - Second Hijrah to Abysinnia.",
        "617 - Social boycott of the Hashimites and the Holy Prophet by the Quraish. The Hashimites are shut up in a glen outside Makkah.",
        "619 - Lifting of the boycott. Deaths of Abu Talib and Hadrat Khadija. Year of sorrow.",
        "620 - Journey to Taif. Ascension to the heavens.",
        "621 - First pledge at Aqaba.",
        "622 - Second pledge at Aqaba. The Holy Prophet and the Muslims migrate to Yathrib.",
        "623 - Nakhla expedition.",
        "624 - Battle of Badr. Expulsion of the Bani Qainuqa Jews from Madina.",
        "625 - Battle of Uhud. Massacre of 70 Muslims at Bir Mauna. Expulsion of Banu Nadir Jews from Madina. Second expedition of Badr.",
        "626 - Expedition of Banu Mustaliq.",
        "627 - Battle of the Trench. Expulsion of Banu Quraiza Jews.",
        "628 - Truce of Hudaibiya. Expedition to Khyber. The Holy Prophet addresses letters to various heads of states.",
        "629 - The Holy Prophet performs the pilgrimage at Makkah. Expedition to Muta (Romans).",
        "630 - Conquest of Makkah. Battles of Hunsin, Auras, and Taif.",
        "631 - Expedition to Tabuk. Year of Deputations.",
        "632 - Farewell pilgrimage at Makkah.",
        "632 - Death of the Holy Prophet. Election of Hadrat Abu Bakr as the Caliph. Usamah leads expedition to Syria. Battles of Zu Qissa and Abraq. Battles of Buzakha, Zafar and Naqra. Campaigns against Bani Tamim and Musailima, the Liar.",
        "633 - Campaigns in Bahrain, Oman, Mahrah Yemen, and Hadramaut. Raids in Iraq. Battles of Kazima, Mazar, Walaja, Ulleis, Hirah, Anbar, Ein at tamr, Daumatul Jandal and Firaz.",
        "634 - Battles of Basra, Damascus and Ajnadin. Death of Hadrat Abu Bakr. Hadrat Umar Farooq becomes the Caliph. Battles of Namaraq and Saqatia.",
        "635 - Battle of Bridge. Battle of Buwaib. Conquest of Damascus. Battle of Fahl.",
        "636 - Battle of Yermuk. Battle of Qadsiyia. Conquest of Madain.",
        "637 - Conquest of Syria. Fall of Jerusalem. Battle of Jalula.",
        "638 - Conquest of Jazirah.",
        "639 - Conquest of Khuizistan. Advance into Egypt.",
        "640 - Capture of the post of Caesaria in Syria. Conquest of Shustar and Jande Sabur in Persia. Battle of Babylon in Egypt.",
        "641 - Battle of Nihawand. Conquest Of Alexandria in Egypt.",
        "642 - Battle of Rayy in Persia. Conquest of Egypt. Foundation of Fustat.",
        "643 - Conquest of Azarbaijan and Tabaristan (Russia).",
        "644 - Conquest of Fars, Kerman, Sistan, Mekran and Kharan.Martyrdom of Hadrat Umar. Hadrat Othman becomes the Caliph.",
        "645 - Campaigns in Fats.",
        "646 - Campaigns in Khurasan, Armeain and Asia Minor.",
        "647 - Campaigns in North Africa. Conquest of the island of Cypress.",
        "648 - Campaigns against the Byzantines.",
        "651 - Naval battle of the Masts against the Byzantines.",
        "652 - Discontentment and disaffection against the rule of Hadrat Othman.",
        "656 - Martyrdom of Hadrat Othman. Hadrat Ali becomes the Caliph. Battle of the Camel.",
        "657 - Hadrat Ali shifts the capital from Madina to Kufa. Battle of Siffin. Arbitration proceedings at Daumaut ul Jandal.",
        "658 - Battle of Nahrawan.",
        "659 - Conquest of Egypt by Mu'awiyah.",
        "660 - Hadrat Ali recaptures Hijaz and Yemen from Mu'awiyah. Mu'awiyah declares himself as the Caliph at Damascus.",
        "661 - Martyrdom of Hadrat Ali. Accession of Hadrat Hasan and his abdication. Mu'awiyah becomes the sole Caliph.",
        "662 - Khawarij revolts.",
        "666 - Raid of Sicily.",
        "670 - Advance in North Africa. Uqba b Nafe founds the town of Qairowan in Tunisia. Conquest of Kabul.",
        "672 - Capture of the island of Rhodes. Campaigns in Khurasan.",
        "674 - The Muslims cross the Oxus. Bukhara becomes a vassal state.",
        "677 - Occupation of Sarnarkand and Tirmiz. Siege of Constantinople.",
        "680 - Death of Muawiyah. Accession of Yazid. Tragedy of Kerbala and martyrdom of Hadrat Hussain.",
        "682 - In North Africa Uqba b Nafe marches to the Atlantic, is ambushed and killed at Biskra. The Muslims evacuate Qairowan and withdraw to Burqa.",
        "683 - Death of Yazid. Accession of Mu'awiyah II.",
        "684 - Abdullah b Zubair declares himself aS the Caliph at'Makkah. Marwan I becomes the Caliph' at Damascus. Battle of Marj Rahat.",
        "685 - Death of Marwan I. Abdul Malik becomes the Caliph at Damascus. Battle of Ain ul Wada.",
        "686 - Mukhtar declares himself as the Caliph at Kufa.",
        "687 - Battle of Kufa between the forces of Mukhtar and Abdullah b Zubair. Mukhtar killed.",
        "691 - Battle of Deir ul Jaliq. Kufa falls to Abdul Malik.",
        "692 - The fall of Makkah. Death of Abdullah b Zubair. Abdul Malik becomes the sole Caliph.",
        "695 - Khawarij revolts in Jazira and Ahwaz. Battle of the Karun. Campaigns against Kahina in North Africa. The' Muslims once again withdraw to Barqa. The Muslims advance in Transoxiana and occupy Kish."
    ],
    "8th Century (700-799) C.E.": [
        "700 - Campaigns against the Berbers in North Africa.",
        "702 - Ashath's rebellion in Iraq, battle of Deir ul Jamira.",
        "705 - Death of Abdul Malik. Accession of Walid I as Caliph.",
        "711 - Conquest of Spain, Sind and Transoxiana.",
        "712 - The Muslims advance in Spain, Sind and Transoxiana.",
        "713 - Conquest of Multan.",
        "715 - Death of Walid I. Accession of Sulaiman.",
        "716 - Invasion of Constantinople.",
        "717 - Death of Sulaiman. Accession of Umar b Abdul Aziz.",
        "720 - Death of Umar b Abdul Aziz. Accession of Yazid II.",
        "724 - Death of Yazid II. Accession of Hisham.",
        "725 - The Muslims occupy Nimes in France.",
        "732 - The battle of Tours in France.",
        "737 - The Muslims meet reverse at Avignon in France.",
        "740 - Shia revolt under Zaid b Ali. Berber revolt in North Africa. Battle of the Nobles.",
        "741 - Battle of Bagdoura in North Africa.",
        "742 - The Muslim rule restored in Qiarowan.",
        "743 - Death of Hisham. Accession of Walid II. Shia revolt in Khurasan under Yahya b Zaid.",
        "744 - Deposition of Walid I1. Accession of Yazid II1 and his death. Accession of Ibrahim and his overthrow. Battle of Ain al Jurr. Accession of Marwan II.",
        "745 - Kufa and Mosul occupied by the Khawarjites.",
        "746 - Battle of Rupar Thutha, Kufa and Mosul occupied by Marwan II.",
        "747 - Revolt of Abu Muslim in Khurasan.",
        "748 - Battle of Rayy.",
        "749 - Battles of lsfahan and Nihawand. Capture of Kufa by the Abbasids. As Saffah becomes the Abbasid Caliph at Kufa.",
        "750 - Battle of Zab. Fall of Damascus. End of the Umayyads.",
        "751 - Conquest of Wasit by the Abbasid. Murder of the Minister Abu Salama.",
        "754 - Death of As Saffah. Accession of Mansur as the Caliph.",
        "755 - Revolt of Abdullah b Ali. MUrder of Abu Muslim. Sunbadh revolt in Khurasan.",
        "756 - Abdul Rahman founds the Umayyad state in Spain.",
        "762 - Shia revolt under Muhammad (Nafs uz Zakia) and Ibrahim.",
        "763 - Foundation of Baghdad. Defeat of the Abbasids in Spain.",
        "767 - Khariji state set up by Ibn Madrar at Sijilmasa. Ustad Sees revolt in Khurasan.",
        "772 - Battle of Janbi in North Africa. Rustamid. state set up in Morocco.",
        "775 - Death or the Abbasid Caliph Mansur, Accession of Mahdi,",
        "777 - Battle of Saragossa in Spain.",
        "785 - Death of the Caliph Mahdi. Accession of Hadi.",
        "786 - Death of Hadi. Accession of Harun ur Rashid.",
        "788 - Idrisid state set up in the Maghrib. Death of Abdul Rahman of Spain, and accession of Hisham.",
        "792 - Invasion of South France.",
        "796 - Death of Hisham in Spain; accession of al Hakam.",
        "799 - Suppression of the revolt of the Khazars."
    ],
    "9th Century (800-899) C.E.": [
        "800 - The Aghlabid rule is established in North Africa.",
        "803 - Downfall of the Barmakids. Execution of Jafar Barmki.",
        "805 - Campaigns against the Byzantines. Capture of the islands of Rhodes and Cypress.",
        "809 - Death of Harun ur Rashid. Accession of Amin.",
        "814 - Civil war between Amin and Mamun. Amin killed and Mamun becomes the Caliph.",
        "815 - Shia revolt under Ibn Tuba Tabs.",
        "816 - Shia revolt in Makkah; Harsama quells the revolt. In Spain the Umayyads capture the island of Corsica.",
        "817 - Harsama killed.",
        "818 - The Umayyads of Spain capture the islands of Izira, Majorica, and Sardinia.",
        "819 - Mamun comes to Baghdad.",
        "820 - Tahir establishes the rule of the Tahirids in Khurasan.",
        "822 - Death of AI Hakam in Spain; accession of Abdul Rahman. II.",
        "823 - Death of Tahir in Khurasan. Accession of Talha and his deposition. Accession of Abdullah b Tahir.",
        "827 - Mamun declares the Mutazila creed as the state religion.",
        "833 - Death of Mamun. Accession of Mutasim.",
        "836 - Mutasim shifts the capital to Samarra. 837 Revolt of the Jats.",
        "838 - Revolt of Babek in Azarbaijan suppressed.",
        "839 - Revolt of Maziar in Tabaristan. The Muslims occupy South Italy. Capture of the city of Messina in Sicily.",
        "842 - Death of Mutasim, accession of Wasiq.",
        "843 - Revolts of the Arabs.",
        "847 - Death of Wasiq, accession of Mutawakkil.",
        "849 - Death of the Tahirid ruler Abdullah b Tahir; accession of Tahir II.",
        "850 - Mutawakkil restores orthodoxy.",
        "852 - Death of Abdur Rahman II of Spain;. accession of Muhammad I.",
        "856 - Umar b Abdul Aziz founds the Habbarid rule in Sind.",
        "858 - Mutawakkil founds the town of Jafariya.",
        "860 - Ahmad founds the Samanid rule in Transoxiana.",
        "861 - Murder of the Abbasid Caliph Mutawakkil; accession of Muntasir.",
        "862 - Muntasir poisoned to death; accession of Mutasin.",
        "864 - Zaidi state established in Tabaristan by Hasan b Zaid.",
        "866 - Mutasim flies from Samarra, his depostion and accession of Mutaaz.",
        "866 - Death of Muhammad I the Umayyad ruler of Spain, accession of Munzir. Death of Abdullah b Umar the Habbari ruler of Sind.",
        "867 - Yaqub b Layth founds the Saffarid rule in Sistan.",
        "868 - Ahmad b Tulun founds the Tulunid rule in Egypt.",
        "869 - The Abbasid Caliph Mutaaz forced to abdicate, his death and accession of Muhtadi.",
        "870 - Turks revolt against Muhtadi, his death and accession of Mutamid.",
        "873 - Tahirid rule extinguished.",
        "874 - Zanj revolt in South Iraq. Death of the Samanid ruler Ahmad, accession of Nasr.",
        "877 - Death of Yaqubb Layth in Sistan, accession of Amr b Layth.",
        "885 - Death of Ahmad b Tulun in Egypt, accession of Khamar- wiyiah.",
        "888 - Death of Munzir the Umayyad ruler of Spain, accession of Abbullah.",
        "891 - The Qarmatian state established at Bahrain.",
        "892 - Death of the Samanid ruler Nasr, accession of Ismail.",
        "894 - The Rustamids become the vassals of Spain.",
        "896 - Death of the Tulunid ruler Khamarwiyiah; accession of Abul Asakir Jaish.",
        "897 - Assassination of Abul Asakir Jaish; accession of Abu Musa Harun.",
        "898 - Qarmatians sack Basra,"
    ],
    "10th Century (900-999) C.E.": [
        "902 - Death of the Abbasid Caliph Muktafi; death of the Saffarid ruler Amr.",
        "903 - Assassination of the Qarmatian ruler Abu Said; accession of Abu Tahir.",
        "905 - Abdullah b Hamdan founds the Hamdanid rule in Mosul and Jazira. End of the Tulunid rule in Egypt.",
        "907 - Death of the Abbasid Caliph Muktafi; accession of Muqtadir,",
        "908 - End of the Saffarid rule, annexation of their territories by the Samanids.",
        "909 - Ubaidullah overthrows the Aghlablds and founds the Fatimid rule in North Africa.",
        "912 - Death of the Umayyad Amir Abdullah in Spain, accession of Abdur Rahman III.",
        "913 - Assassination of the Samanid ruler Ahmad II, accession of Nasr II.",
        "928 - Mardawij b Ziyar founds the Ziyarid rule in Tabaristan.",
        "929 - Qarmatians sack Makkah and carry away the Black Stone from the Holy Kaaba. In Spain, Abdur Rahman III declares himself as the Caliph.",
        "931 - Deposition and restoration of the Abbasid Caliph Muqtadir. Death of the Qarmatian ruler Abu Tahir; accession of Abu Mansur.",
        "932 - Death of the Abbasid Caliph Muqtadir; accession of Al Qahir.",
        "934 - Deposition of the Abbasid Caliph AI Qahir; accession of Ar Radi. Death of the Fatimid Caliph Ubaidullah ; accession of Al Qaim.",
        "935 - Assassination of the Ziyarid ruler Mardawij; accession of Washimgir. Death of Hamdanid ruler Abdullah b Hamdan accession of Nasir ud Daula.",
        "936 - By coup Ibn Raiq becomes the Amir ul Umara.",
        "938 - By another coup power at Baghdad is captured by Bajkam.",
        "940 - Death of the Abbasid Caliph Ar Radi, accession of Muttaqi.",
        "941 - Assassination of Bajkam, capture of power by Kurtakin.",
        "942 - Ibn Raiq recaptures power.",
        "943 - Al Baeidi captures power. The Abbasid Caliph Muttaqi is forced to seek refuge with the Hamdanids. Sail ud Daula captures power at Baghdad and the Caliph returns to' Baghdad. Power is captured by Tuzun and Sail ud Daula retires' to Mosul. Death of the Samanid ruler Nasr II, accession of Nuh.",
        "944 - Muttaqi is blinded and deposed, accession of Mustakafi.",
        "945 - Death of Tuzun. Shirzad becomes Amir ul Umra. The Buwayhids capture power. Deposition of the Abbasid Caliph Mustakafi.",
        "946 - Death of the Fatimid Caliph A1 Qaim. accession of Mansur. Death of the Ikhshid ruler Muhammad b Tughj, accession of Abul' Qasim Ungur. 951: The Qarnaatiana restore the Black Stone to the Holy Kaaba.",
        "954 - Death of the Sasanid ruler Nuh, accession of Abdul Malik.",
        "961 - Death of the Samanid ruler Abdul Malik, accession of Manauf. Alptgin founds the rule of the Ghazanavids. Death of the Umayyad Caliph Abdul Rahman III in Spain; accession of Hakam. Death of the Ikhshid ruler Ungur accession of Abul Hasan Ali.",
        "965 - Death of the Qarmatian ruler Abu Mansur; accession of Hasan Azam. Assassination of the Ikhshid ruler Abul Hasan Ali; power captured by Malik Kafur.",
        "967 - Death of the Buwayhid Sultan Muiz ud Daula, accession of Bakhtiar. Death of the Hamdanid ruler Sail ud Daula.",
        "968 - Byzantines occupy Aleppo. Death of the Ikhshid ruler Malik Kafur; accession of Abul Fawaris.",
        "969 - The Fatimids conquer Egypt.",
        "972 - Buluggin b Ziri founds the rule of the Zirids Algeria.",
        "973 - Shia Sunni disturbances in Baghdad; power captured in Baghdad by the Turkish General Subuktgin.",
        "974 - Abdication of the Abbasid Caliph AI Muttih; accession of At Taii.",
        "975 - Death of the Turk General Subuktgin. Death of the Fatimid Caliph Al Muizz.",
        "976 - The Buwayhid Sultan Izz ud Daula recaptures power with the help of his cousin Azud ud Daula. Death of the Samanid ruler Mansur, accession of Nuh II. In Spain death of the Umayyad Caliph Hakam, accession of Hisham II.",
        "978 - Death of the Buwayhid Sultan Izz ud Daula, power captured by Azud ud Daula. The Hamdanids overthrown by the Buwayhids.",
        "979 - Subkutgin becomes the Amir of Ghazni.",
        "981 - End of the Qarmatian rule at Bahrain.",
        "982 - Death of the- Buwayhid Sultan Azud ud Daula; accession of Samsara ud Daula.",
        "984 - Death of the Zirid ruler Buluggin, accession of Mansur.",
        "986 - The Buwyhid Sultan Samsara ud Daula overthrown by Sharaf ud Daula.",
        "989 - Death of the Buwayhid Sultan Sharaf ud Daula, accession of Baha ud Daula.",
        "991 - Deposition of the Abbasid Caliph At Taii, accession of AI Qadir.",
        "996 - Death of the Zirid ruler Mansur, accession of Nasir ud Daula Badis.",
        "997 - Death of the Samanid ruler Nuh II, accession of Mansur II.",
        "998 - Death of the Samanid ruler Mansur II, accession of Abdul Malik II. Mahmud becomes the Amir of Ghazni. 999 End of the Samanids."
    ],
    "11th Century (1000-1099) C.E.": [
        "1001 - Mahmud Ghazanavi defeats the Hindu Shahis.",
        "1004 - Mahmud captures Bhatiya.",
        "1005 - Mahmud captures Multan and Ghur.",
        "1008 - Mahmud defeats the Rajput confederacy.",
        "1010 - Abdication of Hisham II in Spain. accession of Muhammad.",
        "1011 - In Spain Muhammad is overthrown by Sulaiman.",
        "1012 - In Spain power is captured by Bani Hamud. Death of the Buwayhid Baha ud Daula, accession of Sultan ud Daula.",
        "1016 - Death of the Zirrid ruler Nasir ud Daula Badis; accession of AI Muizz.",
        "1018 - In Spain power is captured by Abdul Rahman IV.",
        "1019 - Conquest of the Punjab by Mahmud Ghazanavi.",
        "1020 - The Buwayhid Sultan ud Daula is Overthrown by Musharaf ud Daula, Death of the Fatimid Caliph AI Hakim, accession of Al Zahir.",
        "1024 - In Spain assassination of Abdul Rahman IV, accession of Mustafi.",
        "1025 - Death of the Buwayhid Mushgraf ud Daula, accession of Jalal ud Daula.",
        "1029 - In Spain death of Mustaft, accession of Hisham III.",
        "1030 - Death of Mahmud Ghazanavi.",
        "1031 - In Spain deposition of Hisharn III, and end of the Umayyad rule. Death of the Abbasid Caliph Al Qadir, accession of Al Qaim.",
        "1036 - Death of the Fatimid Caliph AI Zahir, accession of Mustansir. Tughril Beg is crowned as the king of the Seljuks.",
        "1040 - Battle of Dandanqan, the Seljuks defeat the Ghazanavids. Deposition of Masud the Ghazanavid Sultan, accession of Muhammad. AI Moravids come to power in North Africa.",
        "1041 - The Ghazanavid Sultan Muhammad is overthrown by Maudud.",
        "1044 - Death of the Buwayhid Jalal ud Daula, accession of Abu Kalijar.",
        "1046 - Basasiri captures power in Baghdad.",
        "1047 - The Zirids in North Africa repudiate allegiance to the Fatimid and transfer allegiance to-the Abbasids.",
        "1048 - Death of the Buwayhid Abu Kalijar, accession of Malik ur Rahim.",
        "1050 - Yusuf b Tashfin comes to power .in the Maghrib.",
        "1055 - Tughril Beg overthrows the Buwayhids.",
        "1057 - Basasiri recaptures power in Baghdad, deposes Al Qaim and offers allegiance to the Fatimid Caliph.",
        "1059 - Tughril Beg recaptures power in Baghdad, al Qaim is restored as the Caliph.",
        "1060 - Ibrahim becomes the Sultan of Ghazni. Yusuf b Tashfin founds the city of Marrakesh. The Zirids abandon their capital Ashir and establish their capital at Bougie.",
        "1062 - Death of the Zirid ruler AI Muizz, accession of Tamin.",
        "1063 - Death of the Seljuk Sultan Tughril Beg; accession of Alp Arsalan.",
        "1071 - Battle of Manzikert, the Byzantine emperor taken captive by the Seljuks.",
        "1073 - Death of Alp Arsalan, accession of Malik Shah.",
        "1077 - Death of the Abbasid Caliph AI Qaim, accession of AI Muqtadi.",
        "1082 - The A1 Moravids conquer Algeria.",
        "1086 - Battle of Zallakha. The AI Moravids defeat the Christians in Spain. Death of the Rum Sejuk Sultan Sulaiman, accession of Kilij Arsalan.",
        "1091 - The Normans conquer the island of Sicily; end of the Muslim rule.",
        "1092 - Death of the Seljuk Sultan Malik Shah, accession of Mahmud.",
        "1094 - Death of Mahmud; accession of Barkiaruk. Death of the Abbasid Caliph AI Muqtadi, accession of Mustahzir.",
        "1095 - The first crusade.",
        "1099 - The crusaders capture Jerusalem."
    ],
    "12th Century (1100-1199) C.E.": [
        "1101 - Death or the Fatimid Caliph Al Mustaali, accession of Al Aamir.",
        "1105 - Death of the Seljuk Sultan Barkiaruk, accession Of Muhammad.",
        "1106 - Death of the AI Motavid Yusuf b Tashfin.",
        "1107 - Death of the Rum Seljuk Sultan Kilij Arsalan, succession of Malik Shah.",
        "1108 - Death of the Zirid ruler Tamin, accession of Yahya.",
        "1116 - Death of the Rum Seljuk Sultan Malik Shah. accession of Rukn ud Din Masud.",
        "1118 - Death of the Seljuk Sultan Muhammad; accession of Mahmud II. Death of the Abbasid Caliph Mustahzir, accession of Mustarshid. In Spain the Christians capture Saragossa.",
        "1121 - Death of the Fatimid Caliph AI Aamir, accession of AI Hafiz.",
        "1127 - Imad ud Din Zangi establishes the Zangi rule In Mosul.",
        "1128 - Death of the Khawarzam Shah Qutb ud Din Muhammad; accession of Atsiz.",
        "1130 - Death of the Seljuk Sultan Mahmud II; accession of Tughril Beg II.",
        "1134 - Assassination of the Abbasid Caliph Mustarshid; accession of Al Rashid. Death of the Seljuk Sultan Tughril Beg II, accession of Masud.",
        "1135 - Deposition of the Abbasid Caliph AI Rashid, accession of AI Muktafi.",
        "1144 - Imad ud Din Zangi captures Edessa from the Christians, second crusade.",
        "1146 - Death of Imad ud Din Zangi, accession of Nur ud Din Zangi.",
        "1147 - In the Maghrib AI Moravids overthrown by the Al Mohads under Abul Mumin.",
        "1148 - End of the Zirid rule' in North Africa.",
        "1149 - Death of the Fatimid Caliph AI Hafiz, accession of AI Zafar.",
        "1152 - Death of the Seljuk Sultan Masud, accession of Malik Shah II. Hamadid rule extinguished in North Africa.",
        "1153 - Death of the Seljuk Sultan Malik Shah I1, accession of Muhammad II.",
        "1154 - Death of the Fatimid Caliph AI Zafar, accession of AI Faiz.",
        "1156 - Death of the Rum Seljuk Sultan Rukn ud Din Masid, accession of Arsalan II.",
        "1159 - Death of the Seljuk Sultan Muhammad II, accession of Gulaiman.",
        "1160 - Death of the Abbasid Caliph AI Mukta, accession of Al Mustanjid. Death of the Fatimid Caliph Al Faiz, accession of Al Azzid.",
        "1161 - Death of the Seljuk Sulaiman, accession of Arsalan Shah.",
        "1163 - Death of the AI Mohad ruler Abul Mumin, accession of Abu Yaqub Yusuf.",
        "1170 - Death of the Abbasid Caliph Mustanjid, accession of Al Mustazii.",
        "1171 - Death of the Fatimid Caliph AI Azzid. End of the Fatimids. Salah ud Din founds the Ayyubid dynasty in Egypt.",
        "1172 - Death of the Khawarzam Shah Arsalan, accession of Sultan Shah.",
        "1173 - The Khawarzam Shah Sultan Shah is overthrown by Tukush Shah.",
        "1174 - Salah ud Din annexes Syria.",
        "1175 - The Ghurids defeat the Guzz Turks and occupy Ghazni.",
        "1176 - Death of the Seljuk Sultan Arsalan Shah, accession of Tughril Beg III.",
        "1179 - Death of the Abbasid Caliph AI Mustazaii, accession of AI Nasir. Shahab ud Din Ghuri captures Peshawar.",
        "1185 - Death of the AI Mohad ruler Abu Yaqub Yusuf, accession of Abu Yusuf Yaqub.",
        "1186 - The Ghurids overthrow the Ghaznvaids in the Punjab.",
        "1187 - Salah ud Din wrests Jerusalem from the Christians, third crusade.",
        "1191 - Battle of Tarain between the Rajputs and the Ghurids.",
        "1193 - Death of Salah ud Din; accession of Al Aziz. Second battleof Tarain.",
        "1194 - Occupation of Delhi by the Muslims. End of the Seljuk rule.",
        "1199 - Death of the Khawarzam Shah Tukush Shah; accession of Ala ud Din. Death of the AI Mohad ruler Abu Yusuf Yaqub; accession of Muhammad Nasir. Conquest of Northern India and Bengal by the Ghurids."
    ],
    "13th Century (1200-1299) C.E.": [
        "1202 - Death of the Ghurid Sultan Ghias ud Din; accession of Mahmud.",
        "1204 - Shahab ud Din Ghuri defeated by the Ghuzz Turks.",
        "1206 - Death of Shahab ud Din Ghuri. Qutb ud Din Aibik crowned king in Lahore.",
        "1210 - Assassination of the Ghurid Sultan MahmUd, accession of Sam. Death of Qutb ud Din Aibak, accession of Aram Shah in India.",
        "1211 - End of the Ghurid rule, their territories annexed by the Khawarzam Shahs. In India Aram Shah overthrown by Iltutmish.",
        "1212 - Battle of AI Uqab in Spain, end of the AI Mohad rule in Spain. The AI Mohads suffer defeat by the Christians in Spain at the Al-Uqba. The AI Mohad Sultan An Nasir escapes to Morocco where he dies soon after. Accession of his son Yusuf who takes over title of AI Mustansir.",
        "1214 - In North Africa death of the AI Mohad ruler Al Nasir, accession of Al Mustansir. The Banu Marin under their leader Abdul Haq occupy the north eastern part of Morocco.",
        "1216 - The Banu Marin under their leader Abdul Haq occupy north eastern part of Morocco. The AI Mohads suffer defeat by the Marinids at the battle of Nakur. The Banu Marin defeat the AI Mobads at the battle of Nakur.",
        "1217 - The Marinids suffer defeat in the battle fought on the banks of the Sibu river. Abdul Haq is killed and the Marinids evacuate Morocco. In the battle of Sibu the Marinids suffer defeat; their leader Abdul Haq is killed and they evacuate Morocco.",
        "1218 - Death of the Ayyubid ruler AI Adil, accession of AI Kamil. The Marinids return to Morocco under their leader Othman and occupy Fez.",
        "1220 - Death of the Khawarzam Shah Ala ud Din, accession of Jalal ud Din Mangbarni.",
        "1222 - Death of the Zangi ruler Nasir ud Din Mahmud, power captured by Badr ud Din Lulu.",
        "1223 - Death of the Al Mohad ruler Muntasir, accession of Abdul Wahid. Death of Yusuf AI Mustansir, accession of Abdul Wahid in Morocco.. In Spain a brother of Yusuf declares his independence and assumes the title of AI Adil. In Spain Abu Muhammad overthrows AI Adil. AI Adil escapes to Morocco and overthrows Abdul Wahid.",
        "1224 - Death of the AI Mohad ruler Abdul Wahid, accession of Abdullah Adil.",
        "1225 - Death of the Abbasid Caliph AI Nasir, accession of AI Mustansir.",
        "1227 - Death of the AI Mohad ruler Abdullah Adil, accession of Mustasim. Assassination of Al Adil, accession of his son Yahya who assumes the throne under the name of Al Mustasim.",
        "1229 - Death of the AI Mohad ruler Mustasim, accession of Idris. The Ayyubid AI Kamil restores Jerusalem to the Christians. Abu Muhammad dies in Spain and is succeeded by Al Mamun. AI Mamun invades Morocco with Christian help. Yahya is defeated and power is captured by Al Mamun. He denies the Mahdiship of Ibn Tumarat.",
        "1230 - End of the Khawarzam Shah rule.",
        "1232 - Death of the AI Mohad ruler Idris, accession, of Abdul Wahid II. Assassination of Al Mamun; accession of his son Ar-Rashid.",
        "1234 - Death of the Ayyubid ruler AI Kamil, accession of AI Adil.",
        "1236 - Death of Delhi Sultan Iltutmish. Accession of Rukn ud Din Feroz Shah.",
        "1237 - Accession of Razia Sultana as Delhi Sultan.",
        "1240 - Death of Ar-Rashid; accession of his son Abu Said.",
        "1241 - Death of Razia Sultana, accession of Bahram Shah.",
        "1242 - Death of Bahram Shah, accession of Ala ud Din Masud Shah as Delhi Sultan. Death of the AI Mohad rules Abdul Wahid, accession of Abu Hasan. Death of the Abbasid Caliph Mustansir, accession of Mustasim.",
        "1243 - Death of the AI Mohad ruler Abdul Walid II, accession of",
        "1244 - The Al Mohads defeat the Marinids at the battle of Abu Bayash. The Marinids evacuate Morocco.",
        "1245 - The Muslims reconquer Jerusalem.",
        "1246 - Death of the Delhi Sultan Ala ud Din Masud Shah, accession of Nasir ud Din Mahmud Shah.",
        "1248 - Death of the AI Mohad ruler Abul Hasan, accession of Omar Murtaza. Abu Said attacks Tlemsen, but is ambushed and killed; accession of his son Murtada.",
        "1250 - The Marinids return to Morocco, and occupy a greatar part thereof.",
        "1258 - The Mongols sack Baghdad. Death of the Abbasid Caliph Mustasim. End of the Abbasid rule. Fall of Baghdad, end of the Abbasid caliphate. The Mongol II-Khans under Halaku establish their rule in Iran and Iraq with the capital at Maragah. Berek Khan the Muslim chief of the Golden Horde protests against the treatment meted out to the Abbasid Caliph and withdraw his Contingent from Baghdad.",
        "1259 - Abu Abdullah the Hafsid ruler declares himself as the Caliph and assumes the name of AI Mustamir.",
        "1260 - Battle of Ayn Jalut in Syria. The Mongols are defeated by the Mamluks of Egypt, and the spell of the invincibility of the Mongols is broken. Baybars becomes the Mamluk Sultan.",
        "1262 - Death of Bahauddin Zikriya in Multan who is credited with the introduction of the Suhrawardi Sufi order in the IndoPakistan sub-continent.",
        "1265 - Death of Halaku. Death of Fariduddin Ganj Shakkar the Chishti saint of the Indo-Pakistan sub-continent.",
        "1266 - Death of Berek Khan the first ruler of the Golden Horde to be converted to Islam. The eighth crusade. The crusaders invade Tunisia. Failure of the crusade.",
        "1267 - Malik ul Salih establishes the first Muslim state of Samudra Pasai in Indonesia. Murtada seeks the help of the Christians, and the Spaniards invade Morocco. The Marinids drive away the Spaniards from Morocco. Assassination of Murtada; accession of Abu Dabbas.",
        "1269 - Abu Dabbas is overthrown by the Marinida, End of the Al Mohads. End of the rule of the AI Mohads in Morocco, the Marinids come to power in Morocco under Abu Yaqub.",
        "1270 - Death of Mansa Wali the founder of the Muslim rule in M ali.",
        "1272 - Death of Muhammad I the founder of the state of Granada. Yaghmurason invades Morocco but meets a reverse at the battle",
        "1273 - Death of Jalaluddin Rumi.",
        "1274 - Death of Nasiruddin Tusi. The Marinids wrest Sijilmasa from the Zayenids. Ninth crusade under Edward I of England. The crusade ends in fiasco and Edward returns to England.",
        "1277 - Death of Baybars.",
        "1280 - Battle of Hims.",
        "1283 - Death of Yaghmurasan. Accession of his son Othman.",
        "1285 - Tunisis splits in Tunis and Bougie.",
        "1286 - Death of Ghiasuddin Balban. Death of Abu Yusuf Yaqub. Bughra Khan declares his independence in Bengal under the name of Nasiruddin.",
        "1290 - End of the slave dynasty Jalaluddin Khilji comes into power. Othman embarks on a career of conquest and by 1290 C.E. most of the Central Maghreb is conquered by the Zayanids.",
        "1291 - Saadi.",
        "1296 - Alauddin Ghazan converted to Islam.",
        "1299 - Mongols invade Syria. The Marinids besiege Tlemsen the capital of the Zayanids."
    ],
    "14th Century (1300-1399) C.E.": [
        "1301 - In Bengal, Death of Ruknuddin the king of Bengal, succeeded by brother Shamsuddin Firuz.",
        "1302 - In Granada, Death of Muhammad II; succession of Muhammad III.",
        "1304 - In the Mongols II Khans empire, Death of Ghazan, succession of his brother Khudabanda Ul Jaytu. In Algeria, Death of Othman, succession of his son Abu Zayan Muhammad.",
        "1305 - In the Khiljis empire, Alauddin Khilji conquers Rajputana.",
        "1306 - In the Chughills empire, Death of Dava, succession of his son Kunjuk.",
        "1307 - In the Marinids empire, Assassination of the Marinid Sultan Abu Yaqub Yusuf; accession of Abu Thabit",
        "1308 - In the Chughills empire, Deposition of Kunjuk, power captured by Taliku. In Algeria, Death of Abu Zayan Muhammad, succession of his brother Abu Hamuw Musa. In the Marinids empire, Abu Thabit overthrown by Abu Rabeah Sulaiman.",
        "1309 - In the Chughills empire, Assassination of Taliku, accession of Kubak. In Granada, Muhammad III overthrown by his uncle Abul Juyush Nasr.",
        "1310 - In the Chughills empire, Kubak overthrown by his brother Isan Buga. In the Marinids empire, Abu Rabeah Sulaiman overthrown by Abu Said Othman. In the Khiljis empire, Alauddin conquers Deccan.",
        "1312 - In Tunisia, In Tunis Abul Baqa is overthrown by Al Lihiani.",
        "1313 - In the Mongols II Khans empire, Invasion of Syria, the Mongols repulsed. In the Golden Horde empire, Death of Toktu, accession of his nephew Uzbeg.",
        "1314 - In Kashmir, Rainchan an adventurer from Baltistan overthrows Sinha Deva the Raja of Kashmir. Rainchan is converted to Islam and adopts the name of Sadrud Din. In Granada, Abul Juyush overthrown by his nephew Abul Wahid Ismail.",
        "1315 - In Tunisia, War between Bougie and Tunis, Lihani defeated and killed. Abu Bakr becomes the ruler of Bougie and Tunis.",
        "1316 - In the Mongols II Khans empire, Death of Khudabanda Ul Jaytu, succession of Abu Said. In the Khiljis empire, Death of Alauddin, accession of Shahabuddin Umar, usurpation of power by Malik Kafur, a Hindu convert.",
        "1318 - In the Khiljis empire, Assassination of Malik Kafur, deposition of Shahabuddin Umar, accession of Qutbuddin Mubarak. In the Chughills empire, Isan Buga overthrown by Kubak.",
        "1320 - In the Khiljis empire, Assassination of Qutbuddin Mubarak, usurpation of power by Khusro Khan a Hindu convert. Khusro Khan overthrown by Ghazi Malik. End of the rule of Khiljis. In Tunisia, Abu Bakr expelled from Tunis by Abu Imran. In the Tughluqs empire, Ghazi Malik founds the rule of the Tughluq dynasty.",
        "1321 - In the Chughills empire, Death of Kubak, succession of Hebbishsi who is overthrown by Dava Temur.",
        "1322 - In the Chughills empire, Dava Temur overthrown by Tarmashirin, who is converted to Islam. In Bengal, Death of Shamsuddin Firuz. The kingdom divided into two parts. Ghiasuddin Bahadur became the ruler of East Bengal with the capital at Sonargaon, Shahabuddin became the ruler of West Bengal with the capital at Lakhnauti.",
        "1324 - In Bengal, Shahabuddin dies and is succeeded by his brother Nasiruddin.",
        "1325 - In the Tughluqs empire, Death of Ghazi Malik (Ghiasuddin Tughluq); accession of his son Muhammad Tughluq. In Granada, Assassination of Abul Wahid Ismail, succession of his son Muhammad IV. Assassination of Muhammad IV. Accession of his brother Abul Hallaj Yusuf. In the Samudra Pasai empire, Death of Malik al Tahir I, accession of Malik al Tahir II. In Bengal, With the help of Ghiasuddin Tughluq, Nasiruddin over-throws. Ghiasuddin Bahadur and himself become's the ruler of United Bengal.",
        "1326 - In the Ottoman Turks empire, Death of Othman, succession of Orkhan. Orkhan conquers Bursa and makes it his capital.",
        "1327 - In the Ottoman Turks empire, The Turks capture the city of Nicaea.",
        "1329 - In the Tughluqs empire, Muhammad Tughluq shifts the capital from Delhi to Daulatabad in Deccan.",
        "1330 - In the Chughills empire, Death of Tramashirin, succession of Changshahi. Amir Hussain establishes the rule of the Jalayar dynasty at Baghdad. In Tunisia, Abu Bakr overthrows Abu Imran and the state is again united, under him. In Bengal, Muhammad b Tughluq reverses the policy of his father and restores Ghiasuddin Bahadur to the throne of Sonargeon.",
        "1331 - In the Marinids empire, Death of Abu Said Othman, sucession of Abul Hasan. In Bengal, Annexation of Bengal by the Tughluqs.",
        "1335 - In the Mongols II Khans empire, Death of Abu Said, power captured by Arpa Koun. In the Chughills empire, Assassination of Changshahi, accession of Burun.",
        "1336 - In the Mongols II Khans empire, Arpa defeated and killed, succeeded by Musa. Birth of Amir Temur. In the Jalayar empire, Death of Amir Hussain, succession of Hasan Buzurg. In the Ottoman Turks empire, The Turks annex the state of Karasi. In Bengal, The Tughluq Governor at Sonargeon assassinated by armour bearer who captured power and declared his independence assuming the name of Fakhruddin Mubarak Shah.",
        "1337 - In the Mongols II Khans empire, The rule of Musa overthrown, Muhammad becomes the Sultan. In the Sarbadaran empire, On the disintegration of the II-Khan rule, Abdur Razaq a military adventurer establishes an independent principality in Khurasan with the capital at Sabzwar. In the Muzaffarids empire, On the disintegration of the II Khan rule Mubarazud Din Muhammad established the rule of the Muzaffarid dynasty. In the Ottoman Turks empire, The Turks capture the city of Nicomedia. In Algeria, Algeria is occupied by Marinids.",
        "1338 - In the Mongols II Khans empire, Muhammad overthrown, succession of Sati Beg. Sati Beg marries Sulaiman who becomes the co-ruler.",
        "1339 - In Kashmir, Death of Sadrud Din, throne captured by a Hindu Udyana Deva. In the Chughills empire, Deposition of Burun, accession of Isun Temur. In Bengal, The Tughluq Governor at Lakhnauti-Qadr Khan assassinated and power is captured by the army commander-in-chief who declares his independence and assumes the title of Alauddin Ali Shah.",
        "1340 - In the Muzaffarids empire, The Muzaffarids conquer Kirman. In the Chughills empire, Deposition of Isun Temur, accession of Muhammad.",
        "1341 - In the Golden Horde empire, Death of Uzbeg, succession of his son Tini Beg.",
        "1342 - In the Golden Horde empire, Tini Beg overthrown by his brother Jani Beg.",
        "1343 - In the Chughills empire, Muhammad overthrown, power captured by Kazan. In Bengal, Ilyas an officer of Alauddin murders his patron and captures the throne of West Bengal.",
        "1344 - In the Mongols II Khans empire, Deposition of Sulaiman, succession of Anusherwan.",
        "1345 - In the Samudra Pasai empire, Death of Malik al Tahir II, accession of Tahir III. His rule lasted throughout the fourteenth century. In Bengal, llyas captures East Bengal and under him Bengal is again united. He establishes his capital at Gaur.",
        "1346 - In the Chughills empire, Deposition of Kazan, accession of Hayan Kuli. In Tunisia, Death of Abu Bakr, succession of his son Fadal. In Kashmir, Death of Udyana Deva, throne captured by Shah Mirza who assumed the name of Shah Mir, and rounded the rule of Shah Mir dynasty.",
        "1347 - The Marinids capture Tunisia. In the Bahmanids empire, Hasan Gangu declares his independence and establishes a state in Deccan with the capital at Gulbarga.",
        "1349 - In Kashmir, Death of Shah Mir, accession of his son Jamsbed. In Algeria, The Zayanids under Abu Said Othman recapture Algeria.",
        "1350 - In the Sarbadaran empire, Revolt against Abdur Razaq. Power captured by Amir Masud. In Tunisia, Deposition of Fadal, succession of his brother Abu Ishaq. In Kashmir, Jamshed overthrown by his step brother Alauddin Ali Sher.",
        "1351 - In the Marinids empire, Death of Abul Hasan, succession of Abu Inan. In the Tughluqs empire, Death of Muhammad Tughluq accession of Firuz Shah Tughluq.",
        "1352 - In Algeria, The Marinids again capture Algeria. Abu Said Othman is taken captive and killed.",
        "1353 - End of the Mongol II Khan rule. In the Ottoman Turks empire, The Turks acquire the fortress of Tympa on the European side of the Hollespoint. In the Muzaffarids empire, The Muzaffarids conquer Shiraz and establish their capital there.",
        "1354 - In the Muzaffarids empire, The Muzaffarids annex Isfahan. In Granada, Assassination of Abu Hallaj Yusuf, succession of his son Muhammad V.",
        "1356 - In the Jalayar empire, Death of Hasan Buzurg, succession of his son Owaia.",
        "1357 - In the Golden Horde empire, Death of Jani Beg, succession of Kulpa.",
        "1358 - In the Bahmanids empire, Death of Hasan Gangu, accession of his son Muhammad Shah. In the Muzaffarids empire, Death of Mubarazuddin Muhammad; accession of Shah Shuja. In the Marinids empire, Assassination of Abu Inan, succession of Abu Bakr Said. In Bengal, Death of Ilyas, succession of his son Sikandar Shah.",
        "1359 - In the Ottoman Turks empire, Death of Orkhan, succession of Murad. In the Muzaffarids empire, Shah Shuja deposed by his brother Shah Mahmud. In Tunisia, Abul Abbas a nephew of Abu Ishaq revolts and establishes his rule in Bougie. In Algeria, The Zayanids under Abu Hamuw II recapture Algeria. In the Marinids empire, Abu Bakr Said overthrown by Abu Salim Ibrahim. In Granada, Muhammad V loses the throne in palace revolution, succeeded by Ismail.",
        "1360 - In the Muzaffarids empire, Death of Shah Mahmud. Shah Shuja recaptures power. In the Chughills empire, Power captured by Tughluq Temur. In Granada, Ismail overthrown by his brother-in-law Abu Said.",
        "1361 - In the Ottoman Turks empire, Murad conquers a part of Thrace and establishes his capital at Demolika in Thrace. In the Golden Horde empire, Kulpa overthrown by his brother Nauroz. In the Marinids empire, Abu Salim Ibrahim overthrown by Abu Umar. Abu Umar overthrown by Abu Zayyan.",
        "1362 - In the Golden Horde empire, State of anarchy. During 20 years as many as 14 rulers came to the throne and made their exit. In Granada, Abu Said overthrown by Muhammad V who comes to rule for the second time. In Kashmir, Death of Alauddin Ali Sher, succeeded by his brother Shahabuddin.",
        "1365 - In the Ottoman Turks empire, The Turks defeat the Christians at the battle of Matiza, the Byzantine ruler becomes a vassal of the Turks.",
        "1366 - In the Marinids empire, Assassination of Abu Zayyan, succession of Abu Faris Abdul Aziz.",
        "1369 - Power captured by Amir Temur. End of the rule of the Chughills. Amir Temur captures power in Transoxiana. In Tunisia, Death of Abu Ishaq. Succession of his son Abu Baqa Khalid.",
        "1370 - In Tunisia, Abu Baqa overthrown by Abul Abbas under whom the state is reunited. In the Sarbadaran empire, Death of Amir Masud, succession of Muhammad Temur.",
        "1371 - In the Ottoman Turks empire, Invasion of Bulgaria, Bulgarian territory upto the Balkans annexed by the Turks.",
        "1372 - In the Marinids empire, Death of Abu Faris, succession of Abu Muhammad.",
        "1374 - In the Marinids empire, Abu Muhammad overthrown by Abul Abbas.",
        "1375 - In the Sarbadaran empire, Deposition of Muhammad Temur, power captured by Shamsuddin. In the Jalayar empire, Death of Owais, succession by his son Hussain.",
        "1376 - In Kashmir, Death of Shahabuddin, succeeded by his brother Qutbuddin.",
        "1377 - In the Bahmanids empire, Death of Muhammad Shah, succeeded by his son Mujahid.",
        "1378 - In the Bahmanids empire, Mujahid assassinated, throne captured by his uncle Daud.",
        "1379 - Turkomans of the Black Sheep empire, Bairam Khawaja found the independent principality of the Turkomans of the Black Sheep and established his capital at Van in Armenia. In the Bahmanids empire, Assassination of Daud; accession of Muhammad Khan.",
        "1380 - In the Golden Horde empire, Power is captured by Toktamish, a prince of the White Horde of Siberia. In Amir Temur's empire, Amir Temur crosses the Oxus and conquers Khurasan and Herat. Amir Temur invades Persia and subjugates the Muzaffarids and Mazandaran.",
        "1381 - In Amir Temur's empire, Annexation of Seestan, capture of Qandhar.",
        "1384 - In Amir Temur's empire, Conquest of Astrabad, Mazandaran, Rayy and Sultaniyah. In the Muzaffarids empire, Death of Shah Shuja, accession of his son Zainul Abdin. In the Marinids empire, Abul Abbas overthrown by Mustansir. Turkomans of the Black Sheep empire, Death of Bairam Khawaja, succession of Qara Muhammad.",
        "1386 - In Amir Temur's empire, Annexation of Azarbaijan, Georgea overrun. Subjugation of Gilan and Shirvan. Turkomans of the Black Sheep defeated. In the Marinids empire, Death of Mustansir, succession of Muhammad.",
        "1387 - In the Marinids empire, Muhammad overthrown by Abul Abbas who comes to power for the second time.",
        "1388 - In Algeria, Death of Abu Hamuw II, succession of Abu Tashfin. In the Tughluqs empire, Death of Firuz Shah Tughluq, succeeded by his grandson Ghiasuddin Tughluq II.",
        "1389 - In the Muzaffarids empire, Death of the poet Hafiz Shirazi. In the Tughluqs empire, Death of Ghiasuddin Tughluq II, accession: of Abu Bakr Tughluq Shah. Turkomans of the Black Sheep empire, Death of Qara Muhammad. succession of Qara Yusuf.",
        "1390 - In the Tughluqs empire, Abu Bakr overthrow by Nasiruddin Tughluq. In Bengal, Death of Sikandar Shah, accession of his son Ghiasud. In the Burji Mamluks empire, The rule of the Burji Mamluks rounded by Saifuddin Barquq.",
        "1391 - In Amir Temur's empire, Annexation of Fars. In the Muzaffarids empire, Annexation of the Muzaffarids by Amir Temur. In Granada, Death of Muhammad V, succession of his son Abu Hallaj Yusuf II.",
        "1392 - In the Jalayar empire, Death of Hussain, succession of his son Ahmad. In Granada, Death of Abu Hallaj ; succession of Muhammad VI.",
        "1393 - Amir Temur defeats Tiktomish, the ruler of the Golden Horde. Capture of the Jalayar dominions by Amir Temur. In the Marinids empire, Death of Abul Abbas; succession of Abu Faris II.",
        "1394 - Amir Temur defeats the Duke of Moscow. In the Tughluqs empire, Death of Nasiruddin Tugluq, accession of Alauddin Sikandar Shah. In Kashmir, Death of Qutbuddin. Turkomans of the White Sheep empire, Qara Othman established the rule of the White Sheep Turkomans in Diyarbekr.",
        "1395 - In the Golden Horde empire, Amir Temur defeated Toktamish and razes Serai to the ground. End of the rule of the Golden Horde. Annexation of Iraq by Amir Temur. In the Tughluqs empire, Death of Sikandar Shah. Accession of Muhammad Shah.",
        "1396 - In the Amir Temur's empire, Destruction of Sarai, and of the rule of the Golden Horde. In the Sarbadaran empire, Principality annexed by Amir Temur.",
        "1397 - In the Bahmanids empire, Death of Muhammad Khan.",
        "1398 - In the Amir Temur's empire, Campaign in India. In the Marinids empire, Death of Abu Faris II. In the Tughluqs empire, Invasion of Amir Timur, Mahmud Shah escapes from the capital. In Morocco, Death of the Marinid Sultan Abu Faris II; succession of his son Abu Said Othman.",
        "1399 - In the Amir Temur's empire, Campaign in Iraq and Syria. In the Burji Mamluks empire, Death of Saifuddin Barquq, succession of his son Nasiruddin in Faraj."
    ],
    "15th Century (1400-1499) C.E.": [
        "1400 - In the Burji Mamluks empire, The Mamluks lost Syria which was occupied by Amir Timur.",
        "1401 - In the Golden Horde empire, Death of Timur Qutluq, the ruler, installed by Amir Timur. accession of Shadi Beg.",
        "1402 - In the Ottoman Turks empire, Defeat of Bayazid at the battle of Ankara, taken captive Amir Timur.",
        "1403 - In the Ottoman Turks empire, Muhammad I, the son of Bayazid ascended the throne.",
        "1405 - In the Timurids empire, Death of Amir Timur, succession of his son Shah Rukh.",
        "1407 - In the Golden Horde empire, Deposition of Shadi Beg, installation of Faulad Khan by the king maker Edigu.",
        "1410 - In the Golden Horde empire, Deposition of Faulad Khan, installation of Timur.",
        "1412 - In the Golden Horde empire, Deposition of Timur, installation of Jalaluddin. In the Burji Mamluks empire, Death of Nasiruddin Faraj, succession of Al Muayyad.",
        "1413 - In the Golden Horde empire, Deposition of Jalaluddin, installation of Karim Bardo.",
        "1414 - In the Golden Horde empire, Deposition of Karim Bardo, installation of Kubak Khan.",
        "1416 - In the Golden Horde empire, Deposition of Kubak Khan, installation of Jahar Balrawi. Deposition of Jahar Balrawi, installation of Chaighray.",
        "1419 - In the Golden Horde empire, Death of Edigu, overthrow of Chaighray, power captured by Ulugh Muhammad.",
        "1420 - In the Golden Horde empire, Ulugh Muhammad overthrown by Daulat Bairawi. 1420: Turkomans of the Black Sheep empire, Death of Qara Yusuf; succession of his son Qara Iskandar. In Morocco, Assassination of Abu Said Othman; succession of his infant son Abdul Haq.",
        "1421 - In the Ottoman Turks empire, Death of Muhammad I; accession of his son Murad II. In the Burji Mamluks empire, Death of Al Muayyad, succession of Muzaffar Ahmad. Muzaffar Ahmad overthrown by Amir Saifuddin Tata, Death of Saifuddin Tata, succession of his son Muhammad. Muhammad overthrown by Amir Barsbay.",
        "1424 - In the Golden Horde empire, Death of Daulat Bairawi, succession of Berk. In Algeria, The Halsida of Tunisia occupy Algeria. This state of affairs continued throughout the fifteenth century.",
        "1425 - In the Uzbegs empire, Abul Khayr, a prince of the house of Uzbeg declare his independence in the western part of Siberia,",
        "1427 - In the Golden Horde empire, Berk overthrown by Ulugh Muhammad who captured power for the second time.",
        "1430 - In the Uzbegs empire, Abul Khayr occupies Khawarazm.",
        "1434 - Turkomans of the Black Sheep empire, Deposition of Qara Iskandar; installation of his brother Jahan Shah. Turkomans of the White Sheep empire, Death of Qara Othman, succession of his son Ali Beg. In Tunisia, Death of Abul Faris after a rule of forty years, succession of his son Abu Abdullah Muhammad.",
        "1435 - In Tunisia, Deposition of Abu Abdullah Muhammad, power captured by Abu Umar Othman.",
        "1438 - In the Burji Mamluks empire, Death of Barsbay, accession of his minor son Jamaluddin Yusuf; Yusuf overthrown and power captured by the Chief Minister Saifuddin Gakmuk. Turkomans of the White Sheep empire, Ali Beg overthrown by his brother Hamza.",
        "1439 - In the Golden Horde empire, Ulugh Muhammad withdrew from Sarai and found the principality of Qazan. Said Ahmad came to power in Sarai.",
        "1440 - Turkomans of the White Sheep empire, Hamza overthrown by Jahangir a son of Ali Beg.",
        "1441 - In the Golden Horde empire, Crimea seceded from Sarai.",
        "1446 - In the Timurids empire, Death of Shah Rukh, succession of Ulugh Beg. In the Ottoman Turks empire, Second battle of Kossova resulting in the victory of the Turks. Serbia annexed to Turkey and Bosnia became its vassal.",
        "1447 - In the Golden Horde empire, Astra Khan seceded from Sarai.",
        "1449 - In the Uzbegs empire, Abul Khayr captures Farghana. In the Timurids empire, Death of Ulugh Beg, succession of Abdul Latif.",
        "1450 - In the Timurids empire, Assassination of Abdul Latif, accession of Abu Said.",
        "1451 - In the Ottoman Turks empire, Death of Murad II; accession of his son Muhammad II.",
        "1453 - In the Ottoman Turks empire, Capture of Constantinople by the Turks. Turkomans of the White Sheep empire, Death of Jahangir; accession of his son Uzun Hasan. In the Burji Mamluks empire, Death of Gakmuk. succession of his son Fakhruddin Othman. Othman overthrown by the Mamluk General Saifuddin Inal.",
        "1454 - In the Ottoman Turks empire, Attack against Wallachia, Wallachia became a vassal state of Turkey.",
        "1456 - In the Ottoman Turks empire, Annexation of Serbia.",
        "1461 - In the Ottoman Turks empire, Annexation of Bosnia and Herzogovina. In the Burji Mamluks empire, Death of Saifuddin Inal, succession of his son Shahabuddin Ahmad. Shahabuddin Ahmad overthrown by the Mamluk General Saifuddin Khushqadam.",
        "1462 - In the Ottoman Turks empire, Annexation of Albania.",
        "1465 - In the Golden Horde empire, Death of Said Ahmad, succession of his son Khan Ahmad. In Morocco, Assassination of Abdul Haq. End of the Marinid rule. Power snatched by Sharif Muhammad al Jati.",
        "1467 - Turkomans of the Black Sheep empire, Death of Jahan Shah, end of the rule of the Black Sheep Turkoman rule. Turkomans of the White Sheep empire, Jahan Shah of the Black Sheep attacked the White Sheep. Jahan Shah was defeated and the Black Sheep territories annexed by the White Sheep. In the Burji Mamluks empire, Death of Khushqadam, accession of his son Saifuddin Yel Bey. Deposition of Yel Bey, power captured by the Mamluk General Temur Bugha.",
        "1468 - In the Uzbegs empire, Death of Abul Khayr, succession of his son Haidar Sultan. Turkomans of the White Sheep empire, Uzun Hasan defeated the Timurids at the battle of Qarabagh whereby the White Sheep became the masters of Persia and Khurasan. In the Burji Mamluks empire, Deposition of Femur Bugha, power captured by the Mamluk General Qait Bay.",
        "1469 - In the Timurids empire, Death of Abu Said, disintegration of the Timurid state. In Khurasan Hussain Baygara came to power and he ruled during the remaining years of the fifteenth century.",
        "1472 - In Morocco, Sharif Muhammad al Jati overthrown by the Wattisid chief Muhammad al Shaikh who establishes the rule of the Wattisid dynasty.",
        "1473 - In the Ottoman Turks empire, War against Persia; Persians defeated.",
        "1475 - In the Ottoman Turks empire, Annexation of Crimea. War against Venice. Tukey became the master of the Aegean Sea.",
        "1478 - Turkomans of the White Sheep empire, Death of Uzun Hasan, succession of his son Khalil.",
        "1479 - Turkomans of the White Sheep empire, Khalil overthrown by his uncle Yaqub.",
        "1480 - In the Golden Horde empire, Assassination of Khan Ahmad, succession of his son Said Ahmad II.",
        "1481 - In the Golden Horde empire, Said Ahmad I1 overthrown by his brother Murtada. In the Ottoman Turks empire, Death of Muhammad II, accession of Bayazid II.",
        "1488 - In the Uzbegs empire, Death of Haider Sultan, succession of his nephew Shaybani Khan. In Tunisia, Death of Abu Umar Othman after a rule of 52 years, succession of Abu Zikriya Yahya.",
        "1489 - In Tunisia, Abu Zikriya Yahya overthrown by Abul Mumin.",
        "1490 - In Tunisia, Abul Mumin overthrown, power recaptured by Abu Yahya.",
        "1493 - Turkomans of the White Sheep empire, Death of Yaqub. accession of his son Bayangir.",
        "1495 - Turkomans of the White Sheep empire, Bayangir overthown by his cousin Rustam.",
        "1496 - In the Burji Mamluks empire, Abdication of Qait Bay, succession of his son Nasir Muhammad.",
        "1497 - Turkomans of the White Sheep empire, Rustam overthrown by Ahmad. Anarchy and fragmentation.",
        "1498 - In the Burji Mamluks empire, Deposition of Nasir Muhammad, power captured by Zahir Kanauh.",
        "1499 - In the Uzbegs empire, Shayhani Khan conquered Transoxiana. In the Golden Horde empire, Death of Murtada, succession of Said Ahmad III.\" In the Ottoman Turks empire, The Turks defeated the Venetian fleet in the battle of Lepanto."
    ],
    "16th Century (1500-1599) C.E.": [
        "1500 - In the Burji Mamluks empire, Zahir Kanauh overthrown by Ashraf Gan Balat.",
        "1501 - Isamil I establishes the Safavid dynasty in Persia, and the Twelve-Imam Shi'ism becomes the state religion.",
        "1507 - The Portuguese under d'Albuquerque establish strongholds in the Persian Gulf.",
        "1508 - Turkomans of the White Sheep empire, End of the White Sheep dynasty and the annexation of their territories by the Safawids.",
        "1511 - D'Albuquerque conquers Malacca from the Muslims.",
        "1517 - The Ottoman Sultan Selim Yavuz (\"the Grim\") defeats the Mamluks and conquers Egypt.",
        "1520 - The reign of Sulayman the Magnificent begins.",
        "1526 - Louis of Hungary dies at the Battle of Mohacs.",
        "1526 - The Battle of Panipat in India, and the Moghul conquest; Babur makes his capital at Delhi and Agra.",
        "1528 - The Ottomans take Buda in Hungary.",
        "1529 - Unsuccessful Ottoman siege of Vienna.",
        "1550 - The architect Sinan builds the Suleymaniye mosque in Istanbul.",
        "1550 - The rise of the Muslim kingdom of Atjeh in Sumatra.",
        "1550 - Islam spreads to Java, the Moluccas, and Borneo.",
        "1556 - The death of Sulayman the Magnificent.",
        "1568 - Alpujarra uprising of the Moriscos (Muslims forcibly converted to Catholicism) in Spain.",
        "1571 - The Ottomans are defeated at the naval Battle of Lepanto, and their dominance in the Mediterranean is brought to a close.",
        "1578 - The Battle of the Three Kings at Qasr al-Kabir in Morocco. King Sebastian of Portugal is killed.",
        "1588 - Reign of Safavid Sultan Shah Abbas I begins.",
        "1591 - Mustaili Ismailis split into Sulaymanis and Daudis."
    ],
    "17th Century (1600-1699)": [
        "C.E. 1600 - Sind annexed by the Mughals. End of the Arghun rule in Sind.",
        "1601 - Khandesh annexed by the Mughals.",
        "1603 - Battle of Urmiyah. Turks suffer defeat. Persia occupies Tabriz, Mesopotamia. Mosul and Diyarbekr. Death of Muhammad III, Sultan of Turkey, accession of Ahmad I. In Morocco al Shaikh died.",
        "1604 - In Indonesia death of Alauddin Rayat Shah, Sultan of Acheh, accession of Ali Rayat Shah III.",
        "1605 - Death of the Mughal emperor Akbar; accession of Jahangir.",
        "1607 - Annexation of Ahmadnagar by the Mughals.",
        "1609 - Annexation of Bidar by the Mughals",
        "1611 - Kuch Behar subjugated by the Mughals.",
        "1612 - Kamrup annexed by the Mughals.",
        "1617 - Death of Ahmad I, Sultan of Turkey, accession of Mustafa; Deposition of Mustafa: accession of Othman II.",
        "1618 - Tipperah annexed by the Mughals.: '",
        "1620 - In Turkey deposition of Mustafa, accession of Othman II.",
        "1623 - In Turkey Mustafa recaptured power.",
        "1625 - In Turkey deposition of Mustafa, accession of Murad IV.",
        "1627 - Death of the Mughal emperor Jahangir, accession of Shah Jahan.",
        "1628 - Reign of Safavid Sultan Shah Abbas I comes to an end.",
        "1629 - In Persia death of Shah Abbas; accession of grandson Safi.",
        "1631 - Death of Mumtaz Mahal, wife of Mughal Emperor Shah Jahan and the lady of Taj Mahal, Agra.",
        "1637 - Death of Iskandar Muda in Indonesia; accession of Iskandar II.",
        "1640 - Death of Otthman Sultan Murad IV. accession of his brother Ibrahim.",
        "1641 - Turks capture Azov. In Indonesia death of Iskandar II; accession of the Queen Tajul Alam.",
        "1642 - In Persia death of Shah Safi, accession of Shah Abbas II.",
        "1648 - In Turkey Ibrahim deposed; accession of Muhammad IV.",
        "1656 - Muhammad Kuiprilli becomes the Grand Minister in Turkey.",
        "1658 - Deposition of the Mughal emperor Shah Jahan, accession of Aurangzeb.",
        "1661 - Death of Muhammad Kuiprilli, accession of his son Ahmad Kuiprilli.",
        "1667 - Death of Shah Abbas II; accession of Shah Sulaiman.",
        "1675 - Execution of the Sikh Guru Tegh Bahadur. In Indonesia death of the queen Tajul Alam, accession of the queen Nur ul Alam.",
        "1676 - Death of the Grand Wazir of Turkey Ahmad Kuiprilli, succession by Kara Mustafa.",
        "1678 - In Indonesia death of the queen Nur ul Alam, accession of the queen Inayat Zakia.",
        "1680 - Death of Marhatta chieftain Shivaji.",
        "1682 - Assam annexed by the Mughals. Aurangzeb shifts the capital to Aurangabad in the Deccan.",
        "1683 - The Turks lift the siege of Vienna and retreat. Kara Mustafa the Grand Wazir executed for the failure of the expedition.",
        "1686 - Annexation of Bijapur by the Mughals.",
        "1687 - Golkunda annexed by the Mughals. Second battle of Mohads. Defeat of the Turks by Austria. Deposition of Muhammad IV. Accession of Sulaiman II.",
        "1688 - In Indonesia death of queen Inayat Zakia, accession of the queen Kamalah.",
        "1690 - Death of the Ottoman Sultan Sulaiman II, accession of Ahmad II.",
        "1692 - Death of the Turk Sultan Ahmad II, accession of Mustafa II.",
        "1694 - In Persia death of Shah Safi, accession of Shah Hussain.",
        "1699 - In Indonesia death of Queen Kamalah."
    ],
    "18th Century (1700-1799) C.E.": [
        "1700 - Murshid Quli Khan declares the independence of Bengal and establishes his capital at Murshidabad.",
        "1703 - Ahmad 11I becomes the Ottoman Sultan. Birth of Shah Wali Ullah. Birth of the religious reformer Muhammad b Abdul Wahab.",
        "1707 - Death of the Mughal emperor Aurangzeb, accession of his son Bahadur Shah.",
        "1711 - War between Turkey and Russia. Russia defeated at the battle of Pruth.",
        "1712 - Death of the Mughal emperor Bahadur Shah, accession of Jahandar Shah.",
        "1713 - Jahandar Shah overthrown by his nephew Farrukh Siyar.",
        "1718 - In the war against Austria, Turkey suffers defeat. By the treaty of Passarowich Turkey loses Hungary.",
        "1719 - Deposition of the Mughal emperor Farrukh Siyar Muhammad Shah ascends the throne. In Sind the Kalhoras came to power under Nur Muhammad Kalhora.",
        "1722 - Saadat Khan found the independent state of Oudh. Battle of Gulnabad between the Afghans and the Persians. The Persians were defeated and the Afghans under Shah Mahmud became the masters of a greater part of Persia. Shah Hussain taken captive, accession of Shah Tahmasp II.",
        "1730 - Zanzibar freed from Portugese rule and occupied by Oreart.",
        "1747 - Ahmad Shah Durrani established Afghan rule in Afghanistan.",
        "1752 - Death of Shah Abdul Latif Bhitai, writer of Sassi Pannu, Sohni Mahinwal and Umer Marvo.",
        "1752 - Ahmed Shah Durrani captured Punjab, Kashmir and Sind.",
        "1761 - Death of Shah Waliullah Dehlavi.",
        "1761 - Battle of Panipat. Ahmad Shah Durrani came to India at the invitation of Shah Waliullah Dehlavi and smashed rising Maratha power in the battle of Panipat.",
        "1764 - Conversion to Islam of Areadi Gaya. ruler of Futa Bandu State in West Sudan.",
        "1773 - Death of Ahmad Shah Durrani.",
        "1783 - End of Kalhora rule in Sind.",
        "1797 - Death of Muhammad Khan Qachar, king of Persia.",
        "1797 - Russia occupied Daghestan.",
        "1799 - Ranjit Singh declared himself Maharajah of Punjab defeating Afghans.",
        "1799 - Khoqand declared independent Islamic State."
    ],
    "19th Century (1800-1899) C.E.": [
        "1803 - Shah Abdul Aziz ibn Saud assassinated by a Shia fanatic. Shah Shuja proclaimed as King of Afghanistan.",
        "1804 - Othman Dan Fodio established Islamic State of Sokoto in Central Sudan.",
        "1805 - Ibn Saud captured Madinah defeating the Turk garrison.",
        "1805 - Faraizi movement launched in Bengal. Muhammad Ali appointed Pasha of Egypt by the Turks.",
        "1806 - Khanate of Khiva came into limelight under the rule of Muhammad Rahim Khan.",
        "1807 - Darqawi sect revolted against Turkish domination. Tunisia repudiated suzerainty of Algeria.",
        "1811 - Birth of Ali Muhammad Bab founder of Bab movement.",
        "1811 - British occupied Indonesia.",
        "1812 - Madina fell to Egyptians.",
        "1813 - Makkah and Taif captured by Egyptian forces and Saudis expelled from Hijaz.",
        "1814 - Iran executed treaty of alliance with the British known as Definitive Treaty.",
        "1814 - Death of Ibn Saud II.",
        "1814 - King Othman of Tunisia assassinated by his cousin Mahmud.",
        "1816 - British withdrew from Indonesia restoring it to the Dutch.",
        "1822 - Death of Maulay Ismail in Morocco.",
        "1827 - Malaya became a preserve of the British according to Anglo- Netherland treaty in 1824.",
        "1828 - Russia declared war against Turkey.",
        "1829 - Treaty of Adrianople.",
        "1830 - French forces landed near Algiers and occupied Algeria ending 313 years rule of Turks.",
        "1831 - Syed Ahmad Barelvi and Shah Ismail leaders of Jihad movement in India fell fighting the Sikhs in Balakot.",
        "1832 - Turks defeated in the battle of Konia by Egyptian forces.",
        "1832 - Sayyid Said, King of Oman, shifted his capital to Zanzibar.",
        "1834 - Abdul Qadir recognised as ruler of the area under his control by the French.",
        "1839 - Defeat of Turkey by the Egyptians in the battle of Nisibin.",
        "1840 - Quadruple Alliance by the European powers to force Egypt to relinquish Syria.",
        "1840 - British frees occupied Aden.",
        "1841 - State of Adamawa established by Adams adjacent to Nigeria.",
        "1842 - Amir Abdul Qadir, ousted from Algeria by the French. crossed over to Morocco.",
        "1842 - Shah Shuja assassinated ending the Durrani rule in Afghanistan.",
        "1847 - Amir Abdul Qadir surrendred to France under the condition of safe conduct to a Muslim country of his choice but France violated its pledge and sent him as a captive to France.",
        "1849 - Death of Muhammad Ali pasha.",
        "1850 - Ali Muhammad Bab arrested and executed by Iranian government. Qurratul Ain Tabira, a renowned poetess and staunch advocate of Babism also shot dead.",
        "1852 - Release of Amir Abdul Qadir by Napolean III. He settled in Turkey.",
        "1855 - Khiva annexed by Russia.",
        "1857 - British captured Delhi and eliminated Mughal rule in India after 332 years. Last Mughal Emperor Bahadur Shah Zafar was exiled to Rangoon in Burma. This was also the end of 1000 years of Muslim rule over India.",
        "1859 - Imam Shamil laid down arms before Russian forces and the Islamic State of Daghestan became a Russian province.",
        "1860 - Maulay Muhammad defeated by Spain.",
        "1861 - Death of Sultan Abdul-Majid of Turkey.",
        "1862 - Faraizi movement fizzled out after the death of Dadu Miyan..",
        "1865 - Khoqand State liquidated by Russia.",
        "1869 - Jamaluddin Afghani exiled from Afghanistan. He proceeded to Egypt.",
        "1871 - Tunisia recognised suzerainty of Turkey through a Firman.",
        "1876 - Britain purchased shares of Khediv Ismail in the Suez canal and got involved in Egyptian affairs.",
        "1878 - Turkey handed over Cyprus to Britain.",
        "1878 - Adrianople fell to Russia.",
        "1879 - Jamaluddin Afghani exiled from Egypt.",
        "1879 - Treaty of Berlin. Turkey lost 4/5 th of its territory in Europe.",
        "1881 - France invaded Tunisia and the Bey acknowledged supremacy of France as a result of the treaty of Bardo.",
        "1881 - Muhammad Ahmad declared himself Mahdi in northern Sudan.",
        "1882 - Egypt came under British military occupation.",
        "1883 - Death of Amir Abdul Qadir in Damascus.",
        "1885 - Muhammad Ahmad declared free Government of Sudan under his rule.",
        "1885 - Death of Mahdi Sudani five months after the occupation of Khartum.",
        "1890 - End of Banbara State.",
        "1895 - Afghanistan got Wakhan corridor by an understanding with Russia and British India making Afghan border touch China.",
        "1895 - Mirza Ghulam Ahmad of Qadian claimed prophethood.",
        "1897 - State of Bagirimi occupied by the French,",
        "1899 - Fall of Mahdi State occupied by the British and the Egyptians jointly."
    ],
    "Credits": "By Professor Masud-ul-Hasan"
}