[
    {
        "A": [
            {
                "Term": "A.H.",
                "Definition": "Means after hijrah. It is the reference used in the islamic calendar, instead of a.d. Which is used in the christian calendar."
            },
            {
                "Term": "Abna",
                "Definition": "Means sons or children. It is used for children who had persian fathers and arab mothers."
            },
            {
                "Term": "Adhan",
                "Definition": "The muslim call to prayer. It is used to signify the time of prayer for the five obligatory prayers."
            },
            {
                "Term": "Ahl ar-Ra'y",
                "Definition": "Means people of opinion. It is refers to people that are consulted on islamic matters. These people are highly learned in islam."
            },
            {
                "Term": "Ahzab",
                "Definition": "Means parties. Ahzab is used to describe the different tribes that fought the muslims in the battle of the ditch in 627 c.e, 5 ah."
            },
            {
                "Term": "Al-asharatu Mubashshirun",
                "Definition": "The ten people that were given the glad tidings of assurance of entering paradise. They were abu bakr, umar, uthman, ali, abdur rahman ibn awf, abu ubaydah ibn al-jarrah, talhah ibn ubaydullah, az-zubayr ibn al-awwam, sa'd ibn abi waqqas, sa'id ibn zayd."
            },
            {
                "Term": "Alim",
                "Definition": "A learned person in islam, scholar."
            },
            {
                "Term": "Allahu Akbar",
                "Definition": "Allah is great (god is great). It was frequently used by the muslim forces as their battle cry."
            },
            {
                "Term": "Amin",
                "Definition": "Means custodian or guardian. Someone who is loyal or faithful."
            },
            {
                "Term": "Amir",
                "Definition": "Means leader or commander."
            },
            {
                "Term": "Amir al-Mumineen",
                "Definition": "Means commander of the believers. This title was given to the khalifa."
            },
            {
                "Term": "Ansar",
                "Definition": "Means helpers. These were the people of madinah who responded to the prophet's call to islam and offered islam a city-state power."
            },
            {
                "Term": "Aqabah",
                "Definition": "A place just outside of mecca, in mina where the first muslims from yathrib madinah pledged allegiance to the prophet in the year 621 c.e.. A similar meeting took place the next year when more muslims from yathrib pledged their allegiance to the prophet."
            },
            {
                "Term": "Arafat",
                "Definition": "A plain north of mecca. It is on this plain that humanity will be raised on the day of judgement for questioning and judgement. During the hajj on the ninth day of the month of zhu-l-hijjah, muslim pilgrims gather on this plain for one day."
            },
            {
                "Term": "Asabiyyah",
                "Definition": "Means tribal loyalty, nationalism."
            },
            {
                "Term": "Asr",
                "Definition": "The late afternoon obligatory salat, prayer."
            },
            {
                "Term": "Awqiyyah",
                "Definition": "Means weight, like the ones used to weigh items."
            },
            {
                "Term": "Awrah",
                "Definition": "Parts of the body that are not supposed to be exposed to others. For men this is from the navel to the knee. For the women it is all of her body except the hands, feet, and face."
            },
            {
                "Term": "Ayah",
                "Definition": "Means a sign which leads or directs one to something important. An individual verse in the quran."
            },
            {
                "Term": "Ayat",
                "Definition": "It is the plural form of ayah."
            },
            {
                "Term": "Ayat-ul-Kursi",
                "Definition": "Surah baqara ayah 256 of the quran. It is called the throne of the quran."
            }
        ]
    },
    {
        "B": [
            {
                "Term": "Badiyyah",
                "Definition": "A desert or semi-arid environment."
            },
            {
                "Term": "Badr",
                "Definition": "The first full military confrontation between the muslims and the enemies of allah. The battle took place between the muslims and the quraysh of mecca in the second year of hijrah (624 ce). Even though the muslims were outnumbered, the final result was to their favor."
            },
            {
                "Term": "Bakka'in",
                "Definition": "Means weepers. These were the people that could not accompany the prophet on his campaign to tabuk because they lacked the resources to do so. They started to weep when they could not go."
            },
            {
                "Term": "Baqi",
                "Definition": "The cemetery where a good many of the sahaba are buried. It is in the south-east side of madinah."
            },
            {
                "Term": "Barakah",
                "Definition": "Means blessing or divine grace."
            },
            {
                "Term": "Batil",
                "Definition": "Means false of falsehood."
            },
            {
                "Term": "Batul",
                "Definition": "Means ascetic. It is ascribed to fatimah (the prophets daughter) and the virgin mary."
            },
            {
                "Term": "Bawadi",
                "Definition": "Plural form of badiyyah."
            },
            {
                "Term": "Bay'ah",
                "Definition": "It is an oath of allegiance. To make a pledge."
            },
            {
                "Term": "Bayt al-Mal",
                "Definition": "The state treasury in an islamic state."
            },
            {
                "Term": "Bi'thah",
                "Definition": "The beginning of the prophet's mission, his call to prophethood in 610 c.e.."
            },
            {
                "Term": "Bismillah",
                "Definition": "In the name of allah (god)."
            },
            {
                "Term": "Busr",
                "Definition": "Means partially ripe dates."
            }
        ]
    },
    {
        "C": [
            {
                "Term": "C.E.",
                "Definition": "Stands for christian era. It is used instead of a.d. In islamic text referring to the dates before the hijrah."
            },
            {
                "Term": "Covenant",
                "Definition": "A solemn agreement between two or more persons or groups, a compact between god and man. The old testament tells of the covenant the jews made with allah."
            }
        ]
    },
    {
        "D": [
            {
                "Term": "Da'iy",
                "Definition": "Muslim missionary involved in da'wah. It can also have a general meaning referring to someone who calls others to a certain belief."
            },
            {
                "Term": "Da'wah",
                "Definition": "Inviting others to islam. Missionary work."
            },
            {
                "Term": "Daff",
                "Definition": "Tambourine used in arabia."
            },
            {
                "Term": "Dhikr",
                "Definition": "Remembrance for the sake of allah."
            },
            {
                "Term": "Dhimmi",
                "Definition": "A non-muslim living under the protection of a muslim state. He is exempt from duties of islam like military and zakat but must instead pay a tax called jizya."
            },
            {
                "Term": "Dhu-n Nurayn",
                "Definition": "It means 'possessor of the two lights'. It is used to refer to uthman ibn affan because he married two of the prophet's daughters."
            },
            {
                "Term": "Din",
                "Definition": "Means way of life or religion."
            },
            {
                "Term": "Dirham",
                "Definition": "A silver coin."
            },
            {
                "Term": "Du'a",
                "Definition": "A prayer."
            },
            {
                "Term": "Du'at",
                "Definition": "Plural of da'iy."
            },
            {
                "Term": "Dunya",
                "Definition": "This world or life, as opposed to the here after."
            }
        ]
    },
    {
        "E": null
    },
    {
        "F": [
            {
                "Term": "Fajr",
                "Definition": "The obligatory salat, prayer, before sunrise."
            },
            {
                "Term": "Faqih",
                "Definition": "A person who is an expert on islamic jurisprudence (law), fiqh."
            },
            {
                "Term": "Fard",
                "Definition": "Something which is obligatory on a muslim. It is sometimes used in reference to the obligatory part of salat."
            },
            {
                "Term": "Faruq",
                "Definition": "This was the name given to umar ibn al-khattab. It means 'one who distinguishes the truth from falsehood'."
            },
            {
                "Term": "Fatwa",
                "Definition": "Legal opinion concerning islamic law."
            },
            {
                "Term": "Fiqh",
                "Definition": "Islamic law."
            },
            {
                "Term": "Fitnah",
                "Definition": "Means civil strife, war, riots."
            },
            {
                "Term": "Fuqaha",
                "Definition": "Plural form of faqih."
            }
        ]
    },
    {
        "G": [
            {
                "Term": "Ghazi",
                "Definition": "Muslim soldier, warrior."
            },
            {
                "Term": "Ghazwah",
                "Definition": "Military expedition."
            }
        ]
    },
    {
        "H": [
            {
                "Term": "Hadith",
                "Definition": "Sayings of the prophet."
            },
            {
                "Term": "Hadith Qudsi",
                "Definition": "The hadith qudsi are hadith's in which the prophet says the allah says so and so. The meaning of the these hadith was revealed to the prophet but he put them in his own words, unlike the quran which is the word of almighty allah and the prophet conveyed it exactly as it was revealed to him."
            },
            {
                "Term": "Hajj",
                "Definition": "Means effort. The hajj is the pilgrimage to mecca that is obligatory on every muslim. It is one of the five pillars of islam and takes place during the islamic month of zhul al-hijjah. A muslim must perform the hajj at least once in his life. The exception to this is financial and health reasons."
            },
            {
                "Term": "Halal",
                "Definition": "Something that is lawful and permitted in islam."
            },
            {
                "Term": "Halif",
                "Definition": "A person who enjoys the protection of a tribe but does not belong to it by blood."
            },
            {
                "Term": "Halqah",
                "Definition": "A group of students involved in the study of islam."
            },
            {
                "Term": "Hanif",
                "Definition": "People who during the time of jahiliyyah rejected the idolatry in their society. These people were in search for the true religion of prophet abraham."
            },
            {
                "Term": "Haqq",
                "Definition": "The truth."
            },
            {
                "Term": "Haraam",
                "Definition": "Something which is unlawful or prohibited in islam."
            },
            {
                "Term": "Haram",
                "Definition": "A haram is a sanctuary, a sacred territory. Mecca has been considered a haram since the time of abraham. All things within the limit of the haram are protected and considered inviolable madinah was also declared a haram by the prophet."
            },
            {
                "Term": "Hijra",
                "Definition": "Means migration. The hijra refers to the prophet's migration from mecca to madinah. This journey took place in the twelfth year of his mission (622 ce). This is the beginning of the muslim calendar. The word hijra means to leave a place to seek sanctuary or freedom from persecution or freedom of religion or any other purpose. Hijra can also mean to leave a bad way of life for a good or more righteous way."
            },
            {
                "Term": "Hudud",
                "Definition": "The limits ordained by allah. This includes the punishment for crimes."
            }
        ]
    },
    {
        "I": [
            {
                "Term": "Imam",
                "Definition": "Leader of the congregational prayer, salat, that the muslims offer five times a day. It is sometimes used to refer to the head of an islamic state."
            },
            {
                "Term": "Iman",
                "Definition": "Faith and trust in allah."
            },
            {
                "Term": "Injil",
                "Definition": "The revelations that were sent down during the time of prophet isa (jesus). It is referred to as the new testament."
            },
            {
                "Term": "Iqamah",
                "Definition": "Means establishing. It is similar to the adhan with the addition of a phrase that signifies that a compulsory prayer, fard, is about to begin."
            },
            {
                "Term": "Isha",
                "Definition": "The obligatory salat, prayer, after sunset later in the evening."
            },
            {
                "Term": "Istighfar",
                "Definition": "To seek allah's forgiveness. It is something that must be done continuously in a muslims life."
            }
        ]
    },
    {
        "J": [
            {
                "Term": "Jahannam",
                "Definition": "Means hell."
            },
            {
                "Term": "Jahiliyyah",
                "Definition": "Means ignorant. Jahiliyyah refers to the pre-islamic era that existed in arabia. It is a combination of views, ideas, and practices that totally defy and reject the guidance sent down by god through his prophets."
            },
            {
                "Term": "Jalbab",
                "Definition": "This is a long loose fitting garment worn by the arabs."
            },
            {
                "Term": "Jannah",
                "Definition": "Means paradise."
            },
            {
                "Term": "Jihad",
                "Definition": "Means to strive. This can be any kind of striving in the way of god which involves either spiritual or personal effort, material resources, or arms. Jihad is also used to refer to a war waged by the muslims for the defense or advancement of islam; it's interests and ideals."
            },
            {
                "Term": "Jizyah",
                "Definition": "A tax paid by non-muslims living in a muslim state. Since the non-muslims are exempt from military service and taxes imposed on muslims, they must pay this tax to compensate. It guarantees them security and protection. If the state cannot protect those who paid jizyah, then the amount they paid is returned to them."
            }
        ]
    },
    {
        "K": [
            {
                "Term": "Ka'bah",
                "Definition": "The first house of worship built for mankind. It was originally built by adam and later on reconstructed by abraham and isma'il. It is a cubed shaped structure based in the city of mecca to which all muslims turn to in their five daily prayers."
            },
            {
                "Term": "Kafir",
                "Definition": "A person who refuses to submit himself to allah (god), a disbeliever in god."
            },
            {
                "Term": "Khalifa",
                "Definition": "In the beginning it was a reference to the successor of the prophet. Later on it began to take on the meaning of head of state for a muslim nation."
            },
            {
                "Term": "Khandaq",
                "Definition": "Means ditch."
            },
            {
                "Term": "Khatib",
                "Definition": "Orator, speaker."
            },
            {
                "Term": "Khutbah",
                "Definition": "A speech or sermon. It is sometimes used to refer to the sermon given during the friday congregational prayer."
            },
            {
                "Term": "Kuffar",
                "Definition": "Plural form of kafir."
            },
            {
                "Term": "Kufr",
                "Definition": "To show ungratefulness to allah and not to believe in him and his religion."
            }
        ]
    },
    {
        "L": [
            {
                "Term": "Laat",
                "Definition": "A chief goddess in the religion of the pre-islamic arabs during the days of jahiliyyah."
            }
        ]
    },
    {
        "M": [
            {
                "Term": "Madinah",
                "Definition": "The first city-state that came under the banner of islam. It is where the prophet's masjid and grave are situated."
            },
            {
                "Term": "Maghazi",
                "Definition": "The military campaigns of the prophet."
            },
            {
                "Term": "Maghrib",
                "Definition": "The obligatory salat, prayer, that is performed right after the sun sets over the horizon."
            },
            {
                "Term": "Mahr",
                "Definition": "A dowry given by the man to the woman he is about to marry. It is part of the muslim marriage contract. It can never be demanded back under any circumstances."
            },
            {
                "Term": "Marwah",
                "Definition": "A mount near the ka'bah that is referred to in the quran as one of the symbols of allah. It is in conjunction with safa."
            },
            {
                "Term": "Masjid",
                "Definition": "A place of worship and salat. The life of the early muslims used to revolve around the masjid. Meetings would be held there, discussions would take place there. It is called a 'mosque' in english."
            },
            {
                "Term": "Mawla",
                "Definition": "A person of slave origin who does not have tribal protection. It is a word with dual meaning. It can mean either master or servant."
            },
            {
                "Term": "Mawlaya",
                "Definition": "A form of address to a ruler implying protector."
            },
            {
                "Term": "Mihrab",
                "Definition": "A recess in the masjid that indicates the direction of salat."
            },
            {
                "Term": "Mina",
                "Definition": "A plain within the bounds of the haram of mecca, within five kilometers outside the city. During the hajj the pilgrims pass the night between the eighth and ninth day proceed to arafat on the ninth day."
            },
            {
                "Term": "Minbar",
                "Definition": "A pulpit."
            },
            {
                "Term": "Mu'min",
                "Definition": "A person who has deep faith in allah and is a righteous and obedient servant of his."
            },
            {
                "Term": "Muadh-dhin",
                "Definition": "The person who calls the adhan."
            },
            {
                "Term": "Muhajir",
                "Definition": "A person who does hijrah."
            },
            {
                "Term": "Mujahid",
                "Definition": "Someone who is active and fights for islam. A muslim fighter. The opposite of qaideen."
            },
            {
                "Term": "Munafiq",
                "Definition": "A hypocrite, more dangerous and worse than a kafir."
            },
            {
                "Term": "Murabit",
                "Definition": "A person who is on the road spreading islam."
            },
            {
                "Term": "Musad'afin",
                "Definition": "A weak and oppressed person."
            },
            {
                "Term": "Musalaymah",
                "Definition": "Undefined."
            },
            {
                "Term": "Mushaf",
                "Definition": "A copy of the quran."
            },
            {
                "Term": "Mushawarah",
                "Definition": "Means consultation."
            },
            {
                "Term": "Mushrik",
                "Definition": "A polytheist. A person who ascribes partners to allah."
            }
        ]
    },
    {
        "N": [
            {
                "Term": "Nasab",
                "Definition": "Means lineage or genealogy."
            },
            {
                "Term": "Nasihah",
                "Definition": "Means sincere good advice."
            }
        ]
    },
    {
        "O": null
    },
    {
        "P": null
    },
    {
        "Q": [
            {
                "Term": "Qadi",
                "Definition": "Judge."
            },
            {
                "Term": "Qaideen",
                "Definition": "People who remain inactive and do not actively fight. The opposite of mujahid."
            },
            {
                "Term": "Qard",
                "Definition": "A loan given for a good cause in the name of allah, in hopes of repayment or reward in the hereafter."
            },
            {
                "Term": "Qari",
                "Definition": "Someone who recites the quran."
            },
            {
                "Term": "Qiblah",
                "Definition": "It is the direction that muslims face when they do their salat. It is in the direction of the ka'bah in mecca."
            },
            {
                "Term": "Qisas",
                "Definition": "Retaliation in kind (eye for an eye). In islam though, retaliation should be forgone as an act of charity surah 5, ayah 48."
            },
            {
                "Term": "Qiyamah",
                "Definition": "Day of judgement, resurrection."
            },
            {
                "Term": "Qudah",
                "Definition": "Plural form of qadi."
            },
            {
                "Term": "Quraysh",
                "Definition": "The most powerful and prominent tribe in all of arabia in the prophet's era. The quraysh were the keepers of the ka'bah  and therefore one of the wealthiest and most powerful tribes. The prophet was from among the quraysh. When he started to preach the true religion of allah, the quraysh violently persecuted him and his followers. They were badly defeated at the battle of badr by the muslims and their days of jahiliyyah were finally ended when the muslims liberated mecca and destroyed all the idols in the ka'bah in the year 630 ce"
            }
        ]
    },
    {
        "R": [
            {
                "Term": "Read Arabic",
                "Definition": "Read mushaf"
            },
            {
                "Term": "Read Mushaf",
                "Definition": "Transliteration"
            },
            {
                "Term": "Ra'kat",
                "Definition": "An individual unit of salat."
            },
            {
                "Term": "Ramadan",
                "Definition": "The holy month of prescribed fasting for the muslims. It was during this month that the quranic revelations began."
            },
            {
                "Term": "Rasulullah",
                "Definition": "The messenger of allah (god)."
            },
            {
                "Term": "Ruku",
                "Definition": "The position in salat in which the person prostrates himself in a standing position with his body bent forward at the waist and his hands on his knees."
            },
            {
                "Term": "Rutb",
                "Definition": "Ripe dates, opposite busr."
            }
        ]
    },
    {
        "S": [
            {
                "Term": "Surah introductions Maududi ",
                "Definition": "Surah introductions malik"
            },
            {
                "Term": "Sa'yee",
                "Definition": "The going back and forth seven times between safa and marwah that is done during the hajj or the umrah. It is done to symbolize hajar's search for water for her son ismael."
            },
            {
                "Term": "Sabirin",
                "Definition": "People who are patient and steadfast."
            },
            {
                "Term": "Sabr",
                "Definition": "Patience, steadfastness."
            },
            {
                "Term": "Sadaq",
                "Definition": "Same meaning as mahr."
            },
            {
                "Term": "Sadaqah",
                "Definition": "Means charity."
            },
            {
                "Term": "Safa",
                "Definition": "A mount near the ka'bah that is referred to in the quran as one of the symbols of allah. It is in conjunction with marwah."
            },
            {
                "Term": "Sahabah",
                "Definition": "Companions of the prophet."
            },
            {
                "Term": "Sahifah",
                "Definition": "A page or manuscript."
            },
            {
                "Term": "Salat",
                "Definition": "The five obligatory prayers that a muslim must perform everyday."
            },
            {
                "Term": "Saqifah",
                "Definition": "A shelter with a roof. The companions of the prophet met in a saqifah in madinah to pledge their loyalty to abu bakr after the death of the prophet."
            },
            {
                "Term": "Sayyid",
                "Definition": "Leader or chief."
            },
            {
                "Term": "Seerah",
                "Definition": "Biography of the prophet."
            },
            {
                "Term": "Shahadah",
                "Definition": "Declaration of faith. A person must recite the shahadah to convert to islam. The shahadah in islam is:: \"i testify that there is no god but allah and i testify that muhammad is the messenger of allah.\""
            },
            {
                "Term": "Shaheed",
                "Definition": "A martyr. Someone who dies in the way of allah."
            },
            {
                "Term": "Shahid",
                "Definition": "Means a witness or martyr."
            },
            {
                "Term": "Shariah",
                "Definition": "Islamic law."
            },
            {
                "Term": "Shirk",
                "Definition": "Associating partners with allah. Shirk can also encompass any object that a person may hold in regard higher than allah. It is the most severe of sins and will not be forgiven."
            },
            {
                "Term": "Shura",
                "Definition": "Consultation."
            },
            {
                "Term": "Sirwal",
                "Definition": "Long under garment worn by the arabs."
            },
            {
                "Term": "Siwak",
                "Definition": "A piece of a branch or root of a tree that is used as a toothbrush. Also called a miswak."
            },
            {
                "Term": "Suffah",
                "Definition": "A raised platform that was used by the prophet as a welcoming point for newcomers or destitute people. It was part of his masjid."
            },
            {
                "Term": "Suhuf",
                "Definition": "Pages or manuscripts."
            },
            {
                "Term": "Sujud",
                "Definition": "The position in salat in which the person prostrates on the ground with his hands, knees, feet, and face touching the ground."
            },
            {
                "Term": "Sunnah",
                "Definition": "The examples of the prophet's life what he said, did, implemented, how he implemented... Almost the same as the hadith."
            },
            {
                "Term": "Surah",
                "Definition": "A chapter in the quran."
            }
        ]
    },
    {
        "T": [
            {
                "Term": "Transliteration",
                "Definition": "Recitation"
            },
            {
                "Term": "Translation by Mustafa Khattab",
                "Definition": "Translation by asad"
            },
            {
                "Term": "Translation by Asad",
                "Definition": "Translation by yusuf-ali"
            },
            {
                "Term": "Translation by Yusuf-Ali",
                "Definition": "Translation by malik"
            },
            {
                "Term": "Translation by Malik",
                "Definition": "Translation by picktal"
            },
            {
                "Term": "Translation by Picktal",
                "Definition": "Compare translation of al-qur'an"
            },
            {
                "Term": "Tafsir Maududi",
                "Definition": "Tafsir ibn-kathir"
            },
            {
                "Term": "Tahajjud",
                "Definition": "The tahajjud prayer is an optional prayer that is supposed to be performed in the middle of the night. It is required that a person sleep a little before he gets up for the tahajjud prayer. It can be performed anytime between isha and fajr."
            },
            {
                "Term": "Talbiyah",
                "Definition": "Undefined."
            },
            {
                "Term": "Tamr",
                "Definition": "Means dates."
            },
            {
                "Term": "Taqwa",
                "Definition": "The love and fear that a muslim feels for allah. A person with taqwa desires to be in the good pleasures of allah and to stay away from those things that would displease allah. He is careful not to go beyond the bounds and limits set by allah."
            },
            {
                "Term": "Tauhid",
                "Definition": "Confirming the oneness of allah. It is the basis of islam."
            },
            {
                "Term": "Tawaf",
                "Definition": "The circumferencing of the ka'bah seven times. People usually do this during umrah or hajj."
            },
            {
                "Term": "Tayammum",
                "Definition": "Undefined."
            },
            {
                "Term": "Thawab",
                "Definition": "Reward of blessing."
            },
            {
                "Term": "Torah",
                "Definition": "The revelation that allah sent down to moses. It is the jewish holy book"
            }
        ]
    },
    {
        "U": [
            {
                "Term": "Ulama",
                "Definition": "The learned, knowledgeable people in islam. Plural form of alim."
            },
            {
                "Term": "Umm al-Mu'mineen",
                "Definition": "Means 'mother of the believers'. This was the title of the prophet's wives; surah 33 ayah 6 stipulated that they could not marry after the prophet's death because all of the believers were their spiritual children."
            },
            {
                "Term": "Ummah",
                "Definition": "An ummah is a community or a people. It is used in reference to the community of believers or muslims."
            },
            {
                "Term": "Umrah",
                "Definition": "This is the lesser pilgrimage which is optional and can be performed at any time."
            },
            {
                "Term": "Urdu",
                "Definition": "The official language of pakistan."
            },
            {
                "Term": "Uzzah",
                "Definition": "A chief goddess in the religion of the pre-islamic arabs during the days of jahiliyyah."
            }
        ]
    },
    {
        "V": null
    },
    {
        "W": [
            {
                "Term": "Wakil",
                "Definition": "A person who is an authorized representative or proxy. Also can mean lawyer in urdu."
            },
            {
                "Term": "Wali",
                "Definition": "Legal guardian. A friend or protector. Someone who is supposed to look out for your interest."
            },
            {
                "Term": "Walimah",
                "Definition": "A feast after the wedding. The reception."
            },
            {
                "Term": "Wudu",
                "Definition": "A purification (ablution) that must be performed before someone does their salat or reads the quran."
            }
        ]
    },
    {
        "X": null
    },
    {
        "Y": [
            {
                "Term": "Yathrib",
                "Definition": "The area where the city of madinah is situated."
            }
        ]
    },
    {
        "Z": [
            {
                "Term": "Zakat",
                "Definition": "The obligatory tax that every muslim must give. It is one of the five pillars of islam. The zakat is used to provide for the poor and destitute."
            },
            {
                "Term": "Zuhr",
                "Definition": "The obligatory salat, prayer, that is performed in the afternoon right after the sun moves away from it's zenith."
            }
        ]
    }
]