{
    "Title": "Life and Death",
    "Author": "Sheik Muhammad Mitwaly Ash-Sha‘râwy",
    "Chapters": {
        "Chapter One": {
            "Chapter One": [],
            "What Was The Beginning?": [
                "No issue has ever raised more controversy among people as that of life",
                "and  death.  And  no  issue  the  scientists  have  ever  meddled  in  by",
                "introducing unveracious knowledge as the issue of life and death! This",
                "is  because  death  is  a  metaphysical  matter  to  us,  and  we  should  seek",
                "the knowledge and characteristics of whatever is unknown only from",
                "Allah, all praise and glory be to Him. For as long as it is invisible it",
                "should  not  be  definitely  included  in  the  knowledge  man  possesses.",
                "Still, it is incorporated based on mere hypothesis and illusions, which",
                "subjects it to many forged lies.",
                "That is what misled the scientists – since the beginning of creation –",
                "and  made  them  suffer  a  state  of  confusion,  loss,  even  contrariety.",
                "Some of them adopted the theory of evolution; alleging that man has",
                "descended from an ape called ‘Lucy’!",
                "To  such  liars  we  say:  ‘Who  told  you  so?’  None  of  the  historical",
                "records that narrated to us the world events since most ancient times",
                "informed us that a monkey once turned to a human! Did this monkey",
                "turn to a human being then such a transformation process stopped? Or",
                "what did truly happen? Furthermore, did this monkey turn to a male or",
                "a female human being! If it has turned to a male, it would extinct. The",
                "end is the same if it has turned to a female. And where is the evidence",
                "they have relied on to make such a judgment?!",
                "The  different  branches  of  sciences  and  scientific  researches  have",
                "witnessed extensive development in all domains, on a scale definitely",
                "incomparable to the means available during old ages. Technology has",
                "become the main trend of the modern age. But still we are challenging",
                "them, in spite of all this, to prove their claims substantially; show us",
                "how the monkey could turn to a human?!",
                "Allah, all praise and glory be to Him, has informed us of such forged",
                "lies  in  His  Noble  Book  (the  Noble  Qur’an)  and  warned  us  against",
                "them saying (what means):",
                "“I (Allah) made them (Iblîs and his offspring) not to witness (nor",
                "took  their  help  in)  the  creation  of  the  heavens  and  the  earth  and",
                "not  (even)  their  own  creation,  nor  was  I  (Allah)  to  take  the",
                "misleaders as helpers.” (Al-Kahf, 18: 51)",
                "Allah,  all  praise  and  glory  be  to  Him,  has  told  us  that  there  would",
                "come misleaders who  would  speak  about  the creation  of  the heavens",
                "and the earth, and the creation of people, and how they happened? The",
                "sole  aim  behind  the  falsehood  uttered  by  such  misleaders  is  to  lead",
                "people astray. They have never witnessed the creation of the heavens",
                "and  the  earth,  nor  their  own  creation  to  be  able  to  speak  about  it",
                "knowledgably.",
                "The emergence of such misleaders who claim that man evolved from a",
                "monkey,  and  those  who  maintained  scientific  theories  about  human",
                "creation, is itself a substantiating poof of the question of Faith in the",
                "universe. For if they had not come and misled people, we would have",
                "said that Allah, all praise and glory be to Him, has informed us in the",
                "Noble  Qur’an  that  there  would  come  misleaders  who  would  tell  us",
                "that the heavens and the earth were created in such and such fashion,",
                "that  man  was  created  in  such  and  such  fashion  but  they  came  not.",
                "Hence, their appearance is a must, for strengthening Faith."
            ],
            "A fruitless debate and sophistry": [
                "Mankind was at a loss with respect to a trivial philosophical dilemma",
                "for which they had no proof; the dilemma of what was born first the",
                "egg or the chicken? Such an issue aroused many fruitless debates, and",
                "schools after schools were founded discussing such a topic. In reply to",
                "them  all,  we  say,  ‘No  need  for  such  sophistry,  Allah,  all  praise  and",
                "glory  be  to  Him,  has  saved  us  (from  such  a  maze)  and  pointed  to  us",
                "how  the  very  beginning  of  creation  was.’  Allah,  The  Most  Exalted,",
                "says (what means):",
                "“And  of  everything  We  have  created  pairs,  that  you  may",
                "remember (the Grace of Allah).”(Az-Zâriyât, 51: 49)",
                "In  the  light  of  the  knowledge  we  gain  from  Almighty  Allah,  the",
                "glorious  Qur’anic  verse  means  that  no  creation  can  subsist  unless",
                "through  a  male  and  a  female.  So,  that  fruitless  debate,  and  that",
                "scientific  nonsense  (so  to  speak)  are  worthless.  Allah,  all  praise  and",
                "glory be  to  Him,  has  told  us  that  He  has  created of  everything  pairs.",
                "Therefore, without the hen, which fertilizes the egg inside the womb",
                "of the chicken, the egg will remain unfertilized and will yield nothing.",
                "Allah,  all  praise  and  glory  be  to  Him,  has  willed  that  the  process  of",
                "creation be of four stages. Each stage is considered to be an indication",
                "of  the  Divine  Inimitability  of  Allah  and  His  endless  Power.  The",
                "Prophet Adam (peace be upon him) was the first created human being,",
                "as  indicated  by  the  noble  Qur’anic  verse  in  which  The  Truth  [Al-",
                "Haqq:  one of the Beautiful Names of Allah], Blessed and Exalted be",
                "He, says (what means):",
                "“(Remember)  when  your  Lord  said  to  the  angels:  ‘Truly,  I  am",
                "going to create man from clay’. So when I have fashioned him and",
                "breathed  into  him  (his)  soul  created  by  Me,  then  you  fall  down",
                "prostrate to him.”(Sâd, 38: 71-72)",
                "That was the beginning of creation as Allah, all praise and glory be to",
                "Him,  has  informed  us.  By  breathing  the  soul  that  Allah  created  into",
                "Adam, He originated in the loin of Adam (peace be upon him) all his",
                "offspring till the Day of Resurrection, having the form of very minute",
                "creatures  written  on  them  by  a  Divine  code  all  the  characteristics  of",
                "the  human  being.  This  is  the  creation  Allah,  The  Exalted  and  Ever-",
                "Majestic,  has  revealed  to  us  in  the  Noble  Qur’an,  saying  (what",
                "means):",
                "“And  (remember)  when  your  Lord  brought  forth  from  the",
                "Children  of  Adam,  from  their  loins,  their  seed  (or  from  Adam's",
                "loin his offspring) and made them testify as to themselves (saying):",
                "‘Am  I  not  your  Lord?’  They  said:  ‘Yes!  We  testify,’  lest  you",
                "should  say  on  the  Day  of  Resurrection:  ‘Verily,  we  have  been",
                "unaware of this.’ Or lest you should say: ‘It was only our fathers",
                "afortime who took others as partners in worship along with Allah,",
                "and we were (merely their) descendants after them; will You then",
                "destroy  us  because  of  the  deeds  of  men  who  practised  Al-Bâtil",
                "(i.e.  polytheism  and  committing  crimes  and  sins,  invoking  and",
                "worshipping others besides Allah)?’” (Al-A‘râf, 7: 172-173)",
                "Some  people  may  wonder  saying,  ‘What  relates  me  to  the  Prophet",
                "Adam  (peace  be  upon  him)  after  the  passage  of  all  those  long",
                "centuries?’ To them we say: In you there is a trace of the soul Allah",
                "has breathed into Adam (peace be upon him), which granted you life.",
                "Still,  they  ask,  ‘How?’  We  say  that  life  is  a  continuous  chain,  if",
                "severed  it  would  end.  You  were  brought  into  being  through  a",
                "spermatozoon  from  you  father,  and  unless  your  father  existed  you",
                "would  not  have  been  born.  And  your  father  is  brought  into  being",
                "owing  to  a  precedent  life,  which  is  your  grandfather’s  life.  So,  you",
                "exist  as  a  result  of  another  life  that  preceded  your  own  and  your",
                "grandfather also existed as a result of another preceding life and so on.",
                "This  way,  the  chain  of  life  continues  till  it  is  traced  back  to  Adam",
                "(peace be upon him). It means if Adam (peace be upon him) did not",
                "come to life first, his offspring would not have existed. His offspring",
                "has obtained life from a spermato zoon in the loin of Adam (p eace be ",
                "upon him). From  the life of Adam (p eace be upon him) h is offspring ",
                "has obtained life and in turn transmitted it to their posterities.",
                "Life proceeded thus, just as Allah has willed for it, until it passed to us ",
                "and would pass to our children and our grandsons till the Last Hour is ",
                "established."
            ],
            "Witnessing Allah in the immaterial existence": [
                "From  the b eginning  Allah  made all His creatures witness Him (and ",
                "made them testify that He is their Lord), and none of mankind whether ",
                "from the previous or future generations failed  to witness Him.  Unless ",
                "mankind witnessed their lord they",
                "comprehend the question of belief in  the  Unseen,  and on top of it, ",
                "belief in the Presence of Allah. Why? Because the human mind cannot ",
                "grasp the meaning of abstract things, except by witnessing them.",
                "You would not realize what does ‘a mountain’ mean, unless you really ",
                "saw  or climbed a mountain; similarly, you would not realize what ",
                "does ‘a lake’ mean,  unless you beheld it or saw a picture of it.",
                "all praise and glory be to Him, has not been seen by any human being ",
                "and no mind can ever grasp Him. Nevertheless, when the Name of ",
                "Allah is mentioned, you find no difficulty in understanding the ",
                "meaning. That He is th",
                "e Omnipotent  Power that  has created , ",
                "originated, maintained, and provided every thing. Also in worshipping ",
                "Allah, you feel you r  heart is overwhelmed with serenity. All this ",
                "proves  that Allah has made us witness Him in the ",
                "immaterial ",
                "existence at the creation of Adam (peace be upon him). We also know ",
                "that He is Omnipresent and is The Creator of everything. This is what ",
                "we call the instinct of true faith.",
                "We are all born having a pure instinct of mon otheistic faith that fills ",
                "our souls and hearts, and attracts  us to The Supreme Creator. Each  ",
                "baby is born with su ch an instinct,  as the Hadith of the Prophet",
                "Muhammad (may Allah bless him and grant him peace) says, ",
                "of  Islam  (i.e. to worship  no ne  but ",
                "child is born with a true faith ",
                "Allah Alone) but his parents convert him to Judaism, Christianity or ",
                "Magainism.’"
            ],
            "Forms of the creation of mankind": [
                "We return to the forms of the creation of mankind, which are four:",
                "The first is the creation with out a male and a ",
                "female; that is to say ",
                "directly by Allah without cau ses, which  is the creatio n of Adam ",
                "(peace be upon him).",
                "The second is the creation from a male only, that is ",
                "Hawwa (Eve,  may Allah be pleased with her) who has been created ",
                "from the rib of Adam (peace be upon him), as ",
                "the Noble Qur’an has ",
                "told us in the verse in which Allah, The Truth, Blessed and Exalted be ",
                "He, says (what means):",
                "the creation of ",
                "“O mankind! Be dutiful to  your Lord, Who created  you from a ",
                "single  person (Adam), and fro m him  (Adam) He created his wife ",
                "[Hawwa (Ev e)], and from them both He created many men and ",
                "women and fear Alla h through Whom you demand your mutual ",
                "(rights), and  (do not cut the  relations of)  the wombs (kinship). ",
                "Surely, Allah is Ever an All-Watcher over you.” (An-Nisâ’, 4: 3)",
                "The third is the creation from a  male and a female, which  takes place ",
                "by the Will of Allah",
                "causations.",
                "and glory be to Him, and",
                ", all praise ",
                "The causative factors behind the third form of creation is the presence ",
                "of a male and a female,",
                "and glory be to  Him, made such  factors not function   independently, ",
                "but  through the Will of The Causer and Originator. So,",
                "marry  a  woman,  and  both  have  all  the  causative  factors  for  having",
                "children,  but  they  never  do,  owing  to  the  Will  of  Allah  that  towers",
                "highly  above  all  causes.  Recite  the  noble  Qur’anic  verse  in  which",
                "Allah, The Most Exalted, says (what means):",
                "“To Allah belongs the kingdom of the heavens and the earth. He",
                "creates what He wills. He bestows  female (offspring) upon whom",
                "He  wills,  and  bestows  male  (offspring)  upon  whom  He  wills.  Or",
                "He bestows both males and females, and He renders barren whom",
                "He  wills.  Verily,  He  is  the  All-Knower  and  is  Able  to  do  all",
                "things.”(Ash-Shûra, 42: 49-50)",
                "It  is  to  understand  well  that  even  with  the  presence  of  the  causative",
                "factors,  represented  in  the  male  and  female,  reproduction  may  never",
                "occur, save by the Divine Will and the absolute Power of Allah. Thus,",
                "the union of a male and female may produce no offspring, because it",
                "is  not  a mechanical process  that completely depends  on  man,  for  the",
                "Will of The Originator reigns supreme over all causes.",
                "To complete the forms of creation comes the fourth kind, which is the",
                "creation  of  Îesâ,  (Jesus,  peace  be  upon  him),  son  of  Maryum  (Mary,",
                "may Allah be pleased with her) who has been created from a female",
                "only,  without  the  male  factor,  whereby  the  four  miracles  of  creation",
                "are perfected: creation without either a male or a female, creation from",
                "a male without a female, creation with the union of both, and creation",
                "from a female without a male. These are the four forms of creation.",
                "Allah,  all  praise  and  glory  be  to  Him,  has  originated  two  different",
                "stages to be undergone by His Creation: life and death. Life is one of",
                "the  Creations  of  Allah,  all  praise  and  glory  be  to  Him,  as  well  as",
                "death.",
                "The Truth, all praise and glory be to Him, says (what means):",
                "“Who  has  created  death  and  life,  that  He  may  test  you  which  of",
                "you is best in deed.”(Al-Mulk, 67: 2)",
                "Each of these two stages (life and death) is governed by certain laws,",
                "about which we do not know but the very least that Allah, Blessed and",
                "Exalted  be  He,  has  imparted  to  us.  Nevertheless,  through  this  quite",
                "insignificant  knowledge,  we  generalize  our  concepts  concerning  life",
                "and death.",
                "Some people assume that nothing exists in this world beyond what we",
                "really see in everyday life, though those who endorse such sayings do",
                "die  and  come  back  to  life  everyday.  In  a  second,  they  unconsciously",
                "move  from  one  law  of  existence  to  another.  The  Truth,  Blessed  and",
                "Exalted be He, says (what means):",
                "and  those  that  die  not  during  their  sleep.  He  keeps  those  (souls)",
                "for  which  He  has  ordained  death  and  sends  the  rest  for  a  term",
                "appointed. Verily, in this are signs for a people who think deeply.”",
                "(Az-Zumar, 39:42)"
            ],
            "Laws of life and death": [
                "When  man  goes  to  sleep  he  moves  from  one  law  of  existence  to",
                "another. While awake he is governed by certain laws; he sees material",
                "matters and proceeds with the daily activities of life depending on his",
                "mental power. This is the present world visible to man, the world that",
                "all  mankind  share.  Nevertheless,  when  we  go  to  sleep,  we  move  to",
                "another  world,  a  world  that  does  not  submit  neither  to  reason,  logic",
                "nor  the  laws  of  worldly  life.  We  move  out  of  the  wheel  of  time.  So,",
                "man  cannot  tell  how  long  he  has  slept  without  resorting  to  an",
                "instrument  for  measuring  time  or  natural  phenomena.  As  when  he",
                "sleeps by day and awakes to find it dark or sleeps by night, then the",
                "sunlight shines forth. Unless he depends on such means he will never",
                "know how long he has slept.",
                "Sleep  removes  man  from  the  realms  of  this  life,  thus  he  neither",
                "perceives  it  nor  knows  anything  about  it.  He  becomes  completely",
                "separated from it. And as he becomes detached from the events of life,",
                "he becomes also detached from its laws. In dreams, man sees things,",
                "while  his  eyes  are  closed.  He  may  feel  as  if  he  is  running  while  his",
                "legs  lie  on  bed  unmoved.  In  dreams,  he  may  also  fall  from  a  high",
                "mountain  without  being  injured,  and  he  may  see  himself  flying  or",
                "sinking into the ground. Moreover, while asleep, man remains sensible",
                "so  he  may  laugh,  cry,  or  have  a  nightmare  that  makes  him  shout  or",
                "rouse  from  sleep  scared.  Hence,  man  during  sleep  submits  neither  to",
                "reason, logic, nor the laws that govern our daily life. For instance, if",
                "you  said  to  someone  that  you  went  to  America  and  returned  twenty",
                "times in one night, could he belie you? The answer is no. And if you",
                "told  him  that  in  your  dreams  you  talked  to  so  and  so,  who  has  died",
                "long ago, could he belie you? Again the answer is no."
            ],
            "What are the laws of sleep?": [
                "As  we  have  mentioned  previously  during  sleep,  man  submits  to",
                "certain  laws,  that  science  can  never  discover.  People  agreed  upon",
                "excluding whatever man sees while asleep from debatable laws. None",
                "can  argue  the  reasonability  of  dreams,  no  matter  how  illogical  they",
                "sounded or how deep they delved into the realms of the incredible.",
                "Different  psychological  schools  have  tried  hard  to  find  a  reasonable",
                "interpretation for what man sees in his dreams, but they all failed. In",
                "spite  of  the  great  achievements  of  psychology,  all  that  has  been",
                "achieved  in  this  field  is  just  mere  guesswork  and  assumptions  that",
                "never reached the truth.",
                "Science has indicated that the maximum time during which the human",
                "mind is active while sleeping is seventeen seconds only. Nevertheless,",
                "man may see dreams that need an hour or more to be narrated.",
                "Such  kind  of  transmission  from  one  law  to  another  happens  to  all  of",
                "us. Allah, all praise and glory be to Him, being merciful to our minds,",
                "wanted to let us know that when man goes to sleep, he moves to the",
                "death  world,  and  when  he  awakes,  Allah,  all  praise  and  glory  be  to",
                "Him,  restores  his  soul  to  him,  but  why?  So  that  man  realizes  that  he",
                "can  move  from  one  law  of  existence  to  another,  and  another.",
                "Therefore, when man is informed that he is going to be immortalized",
                "in the Hereafter, we should understand that he is going to be governed",
                "by other laws, and thus never wonder.",
                "But how can man be immortal? Through a life governed by its special",
                "laws to which man shall submit.",
                "Thus, each of us unconsciously moves from one law to another every",
                "night, then by the Power of Allah, we come back to the first law of life",
                "that  governs  us  while  awake,  and  then  we  sleep  to  move  to  another",
                "law.",
                "I do not think that any of those who professes to have knowledge can",
                "tell us what are the laws to which man submits during sleep, or how",
                "can he see while his eyes are closed! Or how can he run while his legs",
                "are motionless! Or how can he travel when he has not left his place!",
                "Hence, man possesses other hidden faculties, we are unaware of, that",
                "function  during  sleep;  and  there  are  laws  unknown  to  us  which  man",
                "passes through during his life journey."
            ],
            "The beginning of life": [
                "ow life started on ",
                "Many scientists have tried hard to depict for us h",
                "earth, introducing many visions: as  claiming that it has started with a ",
                "unicellular creature and then the cell has und",
                "ergone fission and ",
                "developments, and so forth.",
                "life only b y The One ",
                "In answering  them, we say that we are given ",
                "Who has created us, and the creator of a thing is the only on",
                "e from ",
                "whom we should seek an interpretation. Allah, all praise and glory be ",
                "to Him, The Creator, has informed us that he has created man from the ",
                "clay of the earth. The modern science, which Allah has revealed to His ",
                "creatures, has lately proved that this clay is ",
                "composed of  eighteen ",
                "elements, all found in the human body.",
                "The proportions of such   elements may vary from one person to ",
                "another. In some bodies, iron, magnesium or calcium can be less than ",
                "other elements. Such   deficiency can be discovered through mod ern ",
                "chemical analyses, and then the docto r prescribes the medicine that ",
                "compensates such   kind  of  shortage.  But in every body there always ",
                "exists eighteen elements.",
                "Allah, all praise and glory be to Him, has informed us that He created ",
                "man from clay and pottery clay of altered  black smoo th mud, as the ",
                "noble Qur’anic verse states (what means):",
                "“(Remember)  when  your  Lord  said  to  the  angels:  ‘Truly,  I  am ",
                "going to create man from clay’.” (Sâd, 38:71)",
                "And the noble Qur’anic verse saying (what means):",
                "“And (remember) when your Lord said to the angels: ‘I am going ",
                "to create a man (Adam) from ",
                "smooth mud. So, when I have fashioned him completely and ",
                "breathed  into  him  (Adam)  the  soul  which  I  created  for  him,  then ",
                "sounding clay of altered black ",
                "fall  (you)  down  prostrating  yourselves  unto  him.’” (Al-Hijr,  15:",
                "Thus,  Allah,  all  praise  and  glory  be  to  Him,  has  specified  to  us  the",
                "composing  elements  of  the  human  body  and  the  stages  of  creation.",
                "When a metaphysical issue is tackled Allah, all praise and glory be to",
                "Him, out of mercifulness to our minds, approximates the meaning by",
                "setting forth examples from palpable realties. We have not witnessed",
                "the  process  of  creation,  but  we  do  witness  death  everyday,  it  is  a",
                "matter we all see.",
                "Indeed, the destruction of anything is the opposite of its construction.",
                "For  instance,  if  you  are  erecting  a  building  you  start  by  constructing",
                "the first floor and end up by the last floor. But in destruction you start",
                "by  the  last  floor.  Also,  when  traveling  to  Alexandria,  your  last",
                "destination  would  be  Alexandria.  But  if  you  wanted  to  return,  your",
                "first  place  of  departure  would  be  Alexandria.  Hence,  death  happens",
                "contrarily to life, because it destroys it.",
                "The last thing that enters man’s body is the soul, as Allah, glory be to",
                "Him,  has  told  us.  It  is  also  the  first  thing  to  depart  the  body.",
                "Afterwards, man’s body hardens, and becomes just like the hardened",
                "pottery clay of altered black smooth mud, then the body decomposes",
                "and becomes just like argil. Then water separates from mud; the water",
                "goes down the earth, and the mud turns to dust. That is the truth stated",
                "by the Noble Qur’an that death comes to bear witness to it.",
                "Man desires to know what is Death? But we advice him first to know",
                "what  is  life?  What  inspires  life  in  your  body  is  the  soul,  which  is  a",
                "creature  within  you,  though  invisible  to  you.  You  perceive  the  soul",
                "neither by its shape nor figure, but rather by its effect, as it is the thing",
                "that inspires sense in you and endows you with life."
            ],
            "Bestowal of life in the soul": [
                "Where  is  that  soul?  Is  it  in  your  mind  that  thinks?  Or  in  your  hands",
                "wherewith you hold? Or in your heart that beats with life? Or in your",
                "feet  wherewith  you  walk?  Where  is  it?  And  how  does  it  look  like?",
                "Actually, nobody knows.",
                "So,  if  you  were  unable  to  reveal  the  hidden  secret  of  one  of  the",
                "Creations  of  Allah  that  exists  inside  your  body,  would  you  be  able",
                "then to reveal the secret of the whole creation? That is impossible.",
                "We  hope  that  you  first  discover  the  secret  within  your  own  self  and",
                "being,  before  passing  your  judgment  on  the  entire  humanity.  But  if",
                "you failed to unveil one of the Secrets of the Creations of Allah that",
                "He  has  placed  inside  your  body,  would  you  be  able  to  reveal  the",
                "Secrets of Allah in His Universe? The answer is that you would not be",
                "able to, but man is defiant and tries to interfere in what surpasses the",
                "capacities of the human mind.",
                "The  human  mind  is  bounded  by  set  limits;  its  task  is  to  choose",
                "between alternatives in life and to differentiate the good from the evil.",
                "Man  is  created  having  the  power  of  free  choice,  and  his  mind  is  the",
                "tool of realizing it. Nevertheless, by the power of this mind, man can",
                "never go beyond what Allah has decreed to remain hidden or unseen."
            ],
            "Existence … and the perception of existence": [
                "Philosophers  have  strained  their  minds  trying  to  discover  what  is",
                "beyond  the  matter.  But  they  did  not  pose  for  a  moment  to  question",
                "themselves  about  what  has  inspired  in  them  the  belief  that  there  is",
                "something  beyond  the  matter?  It  is  the  believing  human  instinct  that",
                "says  so,  because  it  realizes  and  perceives  that  there  exist  things",
                "beyond  the  matter.  But  could  its  secret  be  attained  by  the  human",
                "intellect?",
                "The answer is, ‘No,’ unless Allah, all glory be to Him, willed to reveal",
                "to His servants one of the secrets of His Universe. In every generation,",
                "Allah, all glory be to Him, reveals one of the secrets of this universe,",
                "which humanity has never known before. If a scientist happens to be",
                "after that secret, Allah may reveal it to him. If not, Allah may reveal it",
                "to us through what we call the  precept  of  coincidence.  Actually,  that",
                "precept is an imaginary one and only exists in the human mind.",
                "This  universe  together  with  all  its  destinies  and  incidents,  whether",
                "trivial  or  grand,  is  meticulously  arranged  by  Allah,  all  glory  be  to",
                "Him, one incident after the other; nothing whatsoever is hidden from",
                "Him  no  matter  how  petty  it  is,  and  nothing  in  this  universe  happens",
                "except  by  His  Will.  Indeed,  a  solemn  sign  of  the  Grandeur  of  Allah,",
                "all praise and glory be to Him, is that He has recorded all the events to",
                "happen in the universe from the beginning of creation till the Day of",
                "Resurrection  in  a  Book  before  creation  took  place.  Recite  the  noble",
                "Qur’anic  verse  in  which  Allah,  all  glory  be  to  Him,  says  (what",
                "means):",
                "“No calamity befalls on the earth or in yourselves but is inscribed",
                "in  the  Book  of  Decrees  (Al-Lauh  Al-Mahfûz),  before We  bring  it",
                "into existence. Verily, that is easy for Allah.” (Al-Hadîd, 57: 22)",
                "And  the  noble  Qur’anic  verse  in  which  Allah,  all  glory  be  to  Him,",
                "says (what means):",
                "“And with Him are the keys of the Ghaib (all that is hidden), none",
                "knows  them  but  He.  And  He  knows  whatever  there  is  in  (or  on)",
                "the earth and in the sea; not a leaf falls, but he knows it. There is",
                "not a grain in the darkness of the earth nor anything fresh or dry,",
                "but is written in a Clear Record.” (Al-An‘âm, 6: 59)",
                "The fact that Allah, all praise and glory be to Him, has recorded all the",
                "events to take place in the universe means that there is no such thing",
                "as  coincidence.  But  rather  everything  happens  according  to  a  highly",
                "accurate  order  and  exquisite  organization.  Thus,  nothing  happens  by",
                "chance, but owing to our inability to perceive the secrets of existence",
                "we claim that events happen by coincidence.",
                "Allah,  all  praise  and  glory  be  to  Him,  gradually  reveals  to  the  mind,",
                "from  the  secrets  of  the  universe,  what  we  have  never  known  before,",
                "but  certainly  have  existed  before  we  became  aware  of  them.",
                "Therefore,  there  is  a  difference  between  actual  existence  and  the",
                "perception of existence. Millions of things exist around us, performing",
                "their role in life, but though we benefit from them we do not perceive",
                "their  existence.  Allah,  all  glory  be  to  Him,  willed  to  inform  us  that",
                "there  exists  million  of  things  that  perform  their  role  in  the  universe",
                "even if we have not known them before. Moreover, our unawareness",
                "of them does not signify that they do not exist.",
                "Briefly,  we  sum  up  what  we  have  detailed  in  this  chapter:  Allah,  all",
                "praise  and  glory  be  to  Him,  has  caused  life  to  be  from  a  male  and  a",
                "female,  thus  of  everything  Allah  has  created  pairs.  Second,",
                "reproduction  does  not  take  place  by  one  gender  but  by  two,  and  the",
                "Absolute Power of Allah is unbound by causes.",
                "Afterwards, we have illustrated that life has continued as a chain since",
                "the creation of the Prophet Adam (peace be upon him) till the Day of",
                "Resurrection, moving from a living human being to another, but when",
                "seized by death it shall stop.",
                "Then, we have illustrated that man can never unveil the secret of life",
                "or  the  beginning  of  creation  and  how  it  occurred,  because  he  never",
                "witnessed it. Furthermore, if man failed to discover one secret of his",
                "body, which is the soul, how can he aspire to know the secret behind",
                "the creation of the entire universe?",
                "Allah,  all  praise  and  glory  be  to  Him,  has  not  made  the  mind  the",
                "means  to  learn  the  secret  of  life,  but  the  mind  is  to  mediate  on  the",
                "Signs  of  Allah  in  His  universe;  to  absolutely  realize  that  Allah,  all",
                "glory  be  to  Him,  is  the  Creator  of  this  universe.  So,  when  comes  to",
                "man a Messenger of Allah conveying His Divine Law, he should hail",
                "him with belief, but regretfully man has hailed him with disbelief, we",
                "seek the Refuge of Allah from it (disbelief).",
                "When we desire to know the secret of life and death we must seek its",
                "knowledge only from Allah, Who has created life and death. Everyday",
                "we move from life to death when we go to sleep, and from death back",
                "to  life  when  we  wake  up,  but  we  are  heedless  of  that  owing  to  our",
                "negligence and weakness. Nevertheless, man definitely submits in his",
                "life at least to two laws: that of wakefulness and that of sleep.",
                "But what is life? That is what we shall discuss, by the Will and Help",
                "of Allah, in the next chapter."
            ]
        },
        "Chapter 2": {
            "Chapter 2": [],
            "What Is Life?": [
                "In  our  attempt  to  know  the  meaning  of  life  we  have  to  bear  in  mind",
                "that  Allah,  all  praise  and  glory  be  to  Him,  has  not  restricted  life  to",
                "mankind and jinn alone, but life extends to every spot in this universe.",
                "We  deem  life  as  being  only  sense  and  motion.  Actually,  life  means",
                "that everything performs its role in this universe.",
                "We judge that man is living because he moves, walks, and talks. We",
                "also  judge  that  animals  are  living  because  they  move  and  feel.",
                "Furthermore, we say that plants are living because they breathe. As for",
                "the rest of the universe, we believe that it is lifeless, which is untrue,",
                "but how can that be?",
                "The concept of life in this universe entirely differs from our own. In",
                "fact,  the  species  of  the  universe  are  classified  into  four:  inanimate",
                "beings,  plants,  animals  and  mankind.  Every  species  among  the",
                "aforementioned  serves  the  other  and  does  not  surpass  its  special",
                "characteristics.",
                "For instance, inanimate beings serve plants, animals and mankind. Its",
                "last  distinguishing  characteristic  is  growth,  which  we  perceive  in  the",
                "coral reeves within seas. They grow in spite of the fact that growth is",
                "not  among  the  distinctive  characteristics  of  inanimate  beings.  But",
                "every species among the species of the universe has higher classes that",
                "cease and end where begin the distinctive characteristics of the species",
                "succeeding  it.  Inanimate  beings  stop  in  their  development  at  the",
                "characteristics  of  growth,  which  are  the  first  to  distinguish  plants.",
                "Naturally, plants start with growth and stop at sensation, but there is a",
                "plant that senses like the mimosa; the coy lady as countrymen calls it.",
                "It is a flower when you approach with your finger folds its leaves.",
                "As  for  animals,  they  start  with  sense  till  the  more  advanced  classes",
                "among  them  verge  on  the  basics  of  reason,  instinctively  formed  in",
                "them. Thus, we find that some of the advanced breeds of monkeys are",
                "able to mimic man, but with neither understanding nor by heredity.",
                "Man can train animals on performing some games that involve some",
                "sort  of  primitive  thinking.  But  animals  do  not  inherit  such  skills.",
                "Meaning, the monkey that learned to jump over the hurdles would not",
                "give  birth  to  a  monkey  that  could  do  the  same  without  training.  It",
                "ascertains  that  all  the  acts  that  the  trained  animals  perform  are",
                "individually acquired skills.",
                "Afterwards  comes  man,  the  master  of  the  universe,  whom  Allah,  all",
                "praise and glory be to Him, has distinguished by the power of reason",
                "in order for him to mediate on the Universe of Allah, to comprehend",
                "the Signs of Allah, and to pursue His Course, all praise and glory be to",
                "Him.",
                "We consider  inanimate beings  as  having  neither life nor  motion,  and",
                "we  do  not  heed  the  fact  that  their  duty  in  life  dictates  so.  On",
                "contemplating  the  Qur’anic  Statement  of  The  Almighty  inscribed  in",
                "His Noble Book, which falsehood cannot come to it from before it or",
                "behind it, that says (what means):",
                "“Everything will perish save His Face.” (Al-Qasas, 28: 88)",
                "We will realize for sure that all that is called a thing in this universe",
                "will perish on the Day the Trumpet will be blown. Since Allah, praise",
                "be to Him, has said (everything) will perish then everything has life in",
                "it, because perishing, as we have already said, is the opposite of life or",
                "its antithesis. Recite the noble Qur’anic verse in which Allah, all glory",
                "be to Him, says (what means):",
                "“So  that  those  who  were  to  be  destroyed  (for  their  rejecting  the",
                "Faith)  might  be  destroyed  after  a  clear  evidence,  and  those  who",
                "were to live (i.e. believers) might live after a clear evidence.” (Al-",
                "Anfâl, 8: 42)",
                "This  noble  Qur’anic  verse  shows  us  that  destruction  opposes  life.",
                "When Allah, all praise and glory be to Him, says (part of the Qur’anic",
                "verse  that  means):  “Everything  will  perish.”  (Al-Qasas,  28:  88),  it",
                "means  that  ‘everything’  that  have  lived  would  be  destroyed,  save",
                "(what is done for the sake of) the Honorable Face of Allah, all praise",
                "be to Him.",
                "We  approach  life  based  on  its  being  sense  and  motion  only,  because",
                "we  are  measuring  it  compared  to  ourselves,  but  life  has  to  be",
                "measured  based  on  the  role  that  everything  plays  in  this  universe.",
                "Inanimate beings have a (form of) life that suits them, whereas plants",
                "have a (form of) life that suits them and animals have a (form of) life",
                "that suits them. So, there subsists a truth that bears neither ambiguity",
                "nor  controversy,  that  those  things  celebrate  the  Glory  of  Allah,  The",
                "Almighty,  as  verified  by  the  noble  Qur’anic  verse  in  which  Allah,",
                "glory be to Him, says (what means):",
                "“There is not a moving (living) creature on earth, nor a bird that",
                "flies  with  its  two  wings,  but  are  communities  like  you.  We  have",
                "neglected nothing in the Book, then unto their Lord they (all) shall",
                "be gathered.” (Al-An‘âm, 6: 38)",
                "And  the  noble  Qur’anic  verse  in  which  Allah,  all  glory  be  to  Him,",
                "says (what means):",
                "“And  there  is  not  a  thing  but  glorifies  His  Praise.  But  you",
                "understand not their glorification.” (Al-Isrâ’, 17: 44)",
                "Let us start with inanimate beings. They have a (form of) life that suits",
                "their  task,  even  if  we  do  not  understand  it.  We  see  inanimate  beings",
                "before us still, motionless, but is it their reality?",
                "While  in  school,  they  used  to  teach  us  how  to  magnetize  iron,",
                "meaning,  to  make  it  magnetic.  We  used  to  bring  a  tube  containing",
                "some iron filings, and then we used to bring a magnet and pass it over",
                "them unidirectionally. Consequently, we find that the iron filings have",
                "changed  their  movement  and  were  regulated  in  one  row,  thus",
                "becoming  magnetized.  This  process,  in  which  the  iron  particles  have",
                "moved, occurs in every iron bar over which we pass a magnet in one",
                "direction.  This  simple  process,  which  we  have  noticed  in  (the  iron",
                "filings)  is  the  same  that  occurs  when  passing  a  magnet  over  an  iron",
                "bar,  even  if  we  fail  to  notice  it  because  of  the  iron  bulk  and  its",
                "cohesiveness."
            ],
            "Inanimate beings cry, hear and talk": [
                "Hence,  there  is  motion  in  inanimate  beings,  which  the  eye  fails  to",
                "notice  and  we  know  nothing  about.  But  it  occurs  in  order  for",
                "inanimate beings to carry out their role in life as a living entity, not as",
                "dead inanimate objects. We assume that there is not life in inanimate",
                "beings,  but  those  inanimate  beings  we  claim  to  be  lifeless  have",
                "sentiments we  are  unaware  of.  Recite the  Qur’anic  Statement of  The",
                "Truth, all praise and glory be to Him, (which means):",
                "“And the heavens and the earth wept not for them, nor were they",
                "given a respite.” (Ad-Dukhân, 44: 29)",
                "Indeed,  the  heavens  and  the  earth  have  sentiments.  They  cry  and",
                "perhaps laugh, even if we do not perceive it and think them inanimate,",
                "neither  sense  nor  cry.  The  heavens  and  the  earth  can  also  hear  the",
                "Words  of  Allah,  understand  them  and  answer  them,  as  the  Lord  of",
                "Majesty and Sovereignty, all praise and glory be to Him, has told us in",
                "His Noble Book, (what means):",
                "“Then  He  Istawâ  (rose  over)  towards  the  heaven  when  it  was",
                "smoke, and said to it and to the earth: ‘Come both of you willingly",
                "or unwillingly.’ They both said: ‘We come, willingly.’”   (Fussilat,",
                "Allah  has  addressed  His  Words  to  the  heavens  and  the  earth,  which",
                "understood the Command of the Most Exalted, and they spoke with a",
                "language that none but Allah knows. If so, we have no right to say that",
                "the  heavens  and  the  earth  are  deaf.  Even  more,  the  earth  has  what",
                "resembles  the  ears  whereby  it  listens  and  obeys.  Recite  the  noble",
                "Qur’anic verse in which Allah, glory be to Him, says (what means):",
                "“When the heaven is split asunder, and listens and obeys its Lord,",
                "and it must do so; and when the earth is stretched forth, and has",
                "cast  out  all  that  was  in  it  and  became  empty,  And  listens  and",
                "obeys its Lord, and it must do so.” (Al-Inshiqâq, 84: 1-5)",
                "What  is  then  meant  by  ‘Listens  and  obeys’  (in  the  noble  Qur’anic",
                "verse)? It means that it heard by its own ear, that is to say the heaven",
                "has  an  ear  wherewith  it  hears,  and  the  earth  has  an  ear  wherewith  it",
                "hears. So, when Allah commands them, they listen and obey. But we",
                "know nothing about all this.",
                "Furthermore,  Allah  reveals  to  us  that  such  inanimate  beings  have",
                "emotions and show due fear of Allah that transcend the emotions and",
                "fear  evinced  by  the  human  heart.  Allah,  all  praise  be  to  Him,  says",
                "(what means):",
                "“Then,  after  that,  your  hearts  were  hardened  and  became  as",
                "stones or even worse in hardness. And indeed, there are stones out",
                "of which rivers gush forth, and indeed, there are of them (stones)",
                "which  split  asunder  so  that  water  flows  from  them,  and  indeed,",
                "there are of them (stones) which fall down for fear of Allah.” (Al-",
                "Baqarah, 2: 74)",
                "Thus, we have seen that inanimate beings have forms of life, some of",
                "which  are  mentioned  in  the  Noble  Qur’an,  and  we  knew  nothing",
                "about,  whereas  others  are  stated  in  the  Hadiths  of  the  Messenger  of",
                "Allah, Muhammad (may Allah bless him and grant him peace) about",
                "the pebbles glorifying Allah between his hands and the mountains that",
                "used to glorify the Praises of Allah along with Dawûd (David, peace",
                "be upon him). In this Regard, the Noble Qur’an says (what means):",
                "“And  We  subjected  the  mountains  and  the  birds  to  glorify  Our",
                "Praises along with Dawûd (David), And it was We Who were the",
                "doers (of all these things).” (Al-Anbiyâ’, 21: 79)"
            ],
            "Plants as well": [
                "If we move from inanimate beings to plants we will find life pulsing",
                "in  them  also.  Plant  is  also  a  glorifier  and  rememberer  of  Allah.  The",
                "story  of  the  date  palm  trunk,  which  the  Messenger  of  Allah  (may",
                "Allah  bless  him  and  grant  him  peace)  used  to  deliver  sermons  while",
                "leaning  his  back  on  it,  is  a  famous  one.  When  they  made  for  him  a",
                "pulpit afterwards, instead of it, the trunk whined out of grief for being",
                "parted from the Prophet (may Allah bless him and grant him peace). It",
                "indicates the sensibility and feelings of plants, even if we are unaware",
                "of  their  language.  Also,  the  date  palm  that  kissed  the  hand  of  the",
                "Messenger of Allah (may Allah bless him and grant him peace) is one",
                "of his several miracles.",
                "All this draws to us a picture of the life of plants we are unaware of.",
                "We know that plants grow but there is also a Divine power of choice",
                "created in them. The plants imbibe water from the soil through small",
                "capillaries known as (osmotic pressure) which causes the water to rise",
                "in these capillaries.",
                "We have conducted this experiment while in school: they brought us",
                "some capillary tubes and placed them in a vessel containing water and",
                "the  water  rose  in  the  capillary  tubes  by  osmotic  pressure.  They",
                "inferred that plants feed in this manner but they forgot something. If",
                "plants were fed in this manner, there would not have existed different",
                "fruits  since  the  water  and  the  land  are  one.  But  Allah,  all  praise  and",
                "glory be to Him, has granted plants the particularity of choice besides",
                "that of kind. Therefore, we find that every tree chooses from land the",
                "elements appropriate to its kind and its fruits.",
                "An  apple  tree,  for  instance,  chooses  from  the  elements  of  the  land",
                "what  ensures  endowing  a  sweet  taste,  color  and  a  special  charming",
                "fragrant to its fruits, while having a colocynth tree growing just by its",
                "side. On the other hand, the colocynth tree chooses what makes it hard",
                "and  bitter  with  a  special  color,  while  a  pepper  tree  is  growing  by  its",
                "side;  which  in  turn  chooses  what  makes  it  hot  with  a  special  flavor.",
                "All  this  is  watered  with  the  same  water,  yet  the  life  that  Allah,  all",
                "praise and glory be to Him, has endowed the plants with makes every",
                "kind of tree chooses from the elements of the land what suits it. Recite",
                "the  noble  Qur’anic  verse  in  which  Allah,  all  glory  be  to  Him,  says",
                "(what means):",
                "“And  in  the  earth  are  neighbouring  tracts,  and  gardens  of  vines,",
                "and green crops (fields etc.), and date-palms, growing out two or",
                "three  from  a  single  stem  root,  or  otherwise  (one  stem  root  for",
                "every  palm),  watered  with  the  same  water,  yet  some  of  them  We",
                "make more excellent than others to eat.” (Ar-Ra‘d, 13: 4)",
                "These are some colors of life in plants that we pay them no attention:",
                "sense, movement, choice and fulfillment of their role."
            ],
            "The ant speaks and the hoopoe has knowledge?": [
                "If we move after that to the insects we will find that they have a highly",
                "accurate system and a language whereby they communicate with their",
                "species.  Has  not  an  ant  said  when  it  saw  the  armies  of  Sulaimân",
                "(Solomon, peace be upon him) (what means):",
                "“O  ants!  Enter  your  dwellings,  lest  Sulaimân  (Solomon)  and  his",
                "hosts crush you, while they perceive not.” (An-Naml, 27: 18)",
                "What made the ant knows that it was Sulaimân (peace be upon him)",
                "and  those  with  him  were  his  armies?  What  made  it  know  that  when",
                "the armies of Sulaimân (peace be upon him) would tread on the ants",
                "they would crush and kill them, while they perceive not? What made",
                "the ant perceive that and by what mental power had it perceived, if it",
                "has not a life that we know nothing about, and perceptions that we do",
                "not understand?",
                "When you read the story of the hoopoe and Sulaimân (peace be upon",
                "him),  you  would  perceive  the  extent  of  the  knowledge  that  the",
                "Creations  of  Allah,  other  than  mankind,  could  possess.  What  did  the",
                "hoopoe  say  to  Sulaimân  (peace  be  upon  him)?  The  Noble  Qur’an",
                "narrates to us (what means):",
                "“I  have  grasped  (the  knowledge  of  a  thing)  which  you  have  not",
                "grasped  and  I  have  come  to  you  from  Saba’  (Sheba)  with  true",
                "news. I found a woman ruling over them, and she has been given",
                "all  things  that  could  be  possessed  by  any  ruler  of  the  earth,  and",
                "she  has  a  great  throne.  I  found  her  and  her  people  worshipping",
                "the sun instead of Allah, and Shaitân (Satan) has made their deeds",
                "fair-seeming to them, and has barred them from (Allah’s) Way, so",
                "they have no guidance.”  (An-Naml, 27: 22-24)",
                "Let  us  contemplate  what  came  in  these  noble  Qur’anic  verses.  Allah",
                "has bestowed upon Sulaimân (peace be upon him) a kingdom the like",
                "of  it  shall  never  belong  to  any  other  among  mankind  or  jinn.",
                "Nevertheless,  He,  all  praise  be  to  Him,  made  the  hoopoe  grasp  of",
                "knowledge what Sulaimân (peace be upon him) was held unaware of,",
                "so that Sulaimân (peace be upon him) might learn that Allah, all praise",
                "be  to  Him,  does  not  restrict  the  bestowal  of  His  Knowledge  to",
                "someone and if man learns a certain thing he is incognizant of many",
                "others.",
                "Who has taught the hoopoe that this kingdom is called the kingdom of",
                "Saba’  (Sheba);  that  those  people  were  ruled  by  a  woman  who  had  a",
                "great throne and that they worshipped the sun instead of Allah, which",
                "was  of  Satan’s  handiwork  who  made  their  deeds  fair-seeming  to",
                "them?  All  this  is  the  knowledge  that  Allah,  all  glory  be  to  Him,  has",
                "bestowed  upon  the  hoopoe,  whereas  we  believe  that  birds  have  no",
                "knowledge! That they only roam the sky searching for their provision",
                "and that is all what they can do!",
                "Allah  informs  us  that  ants  have  a  language  with  which  they  speak.",
                "Undoubtedly,  had  we  known  it,  we  would  have  understood  what  an",
                "ant says. That the hoopoe possesses knowledge, had we known how to",
                "talk to it, we would have learned a great deal about what is unknown",
                "to  us.  Moreover,  all  of  them  celebrate  the  Glory  of  Allah,  all  praise",
                "and  glory  be  to  Him!  For  life  does  not  comprise  man  alone,  but",
                "comprises the species of the entire universe, even if we knew but little",
                "about them."
            ],
            "A life… yet unknown to us": [
                "There  exists  living  beings  we  know  nothing  about,  save  what  Allah,",
                "all glory be to Him, has told us. Angels are creatures of light, which",
                "we  neither  see  nor  hear.  The  jinn  are  creatures  of  fire,  which  we",
                "neither  see  nor  hear,  unless  materialized.  The  Truth,  Blessed  and",
                "Exalted  be  He,  warns  us  against  Satan  through  the  glorious  verse",
                "saying (what means):",
                "“Verily, he and Qabîluhu (his soldiers from the jinn or his tribe)",
                "see you from where you cannot see them.” (Al-A‘râf, 7: 27)",
                "But  we  wonder:  how  can  we  believe  in  the  existence  of  species  and",
                "things that we do not see?",
                "The answer is that man’s perception of a thing is not the sole means",
                "whereby its existence is proved. Moreover, there are things that exist",
                "but we do not perceive their existence. In other words, the existence of",
                "a  thing  is  independent  of  our  awareness  of  such  an  existence.",
                "Therefore, Allah, all praise and glory be to Him, has prepared for the",
                "revelation of the things that we now perceive their existence, but we",
                "were ignorant of them in the past.",
                "For instance, if you looked at a drop of water, you would see nothing,",
                "but  if  you  put  this  drop  of  water  under  the  microscope  you  would",
                "perceive  life  in  it  and  bodies  moving.  Look  at  a  drop  of  blood,  you",
                "would  see  nothing  in  it,  but  if  you  sent  it  to  the  laboratory,  it  would",
                "report  to  you  multitude  of  things  it  contains:  as  the  red  and  white",
                "blood  cells,  the  hemoglobin,  besides  other  things.  Furthermore,  the",
                "microbe that penetrates the body is so minute but we can observe it in",
                "blood and specify its type.",
                "Modern  sciences  have  allowed  us  to  learn  from  the  secrets  of  the",
                "heavens what we have not known before. Everyday, we disclose new",
                "secrets, unknown planets and stars. Have these things been created the",
                "moment  we  discovered  them.  The  answer  is  no,  they  definitely  have",
                "preexisted, performing their role ever since in the universe.",
                "The microbes, which the modern microscopes have allowed us to see,",
                "count  and  categorize,  have  preexisted  and  inflicted  people  with",
                "diseases  but  none  knew  a  thing  about  them  until  these  microscopes",
                "that  magnify  things  by  hundreds  of  thousands  of  times  emerged.  So,",
                "we  discovered  that  there  exists  a  stupendous  life  we  know  nothing",
                "about.  A  life  that  includes  reproduction,  multiplication  and  is",
                "governed by laws, but so minute that you cannot see even though the",
                "microbes  penetrate  your  body,  inflict  you  with  fever  and  may  cause",
                "your death.",
                "For instance, the laser rays that specify distances so accurately and we",
                "use  in  agriculture,  surgery  and  many  other  fields,  is  man  the  one",
                "behind  their  existence  in  the  universe?  Of  course  not,  they  were",
                "created  since  eternity  and  have  kept  performing  their  role  precisely,",
                "but we have discovered them only a few years ago."
            ],
            "The Knowledge of Allah and that of mankind": [
                "What  did  Sulaimân  (peace  be  upon  him)  say  to  his  supporters  from",
                "jinn  and  mankind  when  he  wanted  to  bring  the  throne  of  Balqîs  (the",
                "Queen  of  Sheba)  after  she  had  left  her  kingdom  on  her  way  to  meet",
                "him? He said as the Noble Qur’an relates to us (what means):",
                "“Which  of  you  can  bring  me  her  throne  before  they  come  to  me",
                "surrendering themselves in obedience?” (An-Naml, 27: 38)",
                "Species have rivaled with one another to bring forward the throne of",
                "Balqîs to Sulaimân (peace be upon him). Man kept silent; because he",
                "is  made  of  clay,  neither  have  agility  nor  speedy  movement.  The",
                "ordinary jinn also kept silent, but the one who spoke was a stalwart of",
                "the  jinn,  so  what  did  he  say?  The  Noble  Qur’an  relates  that  incident",
                "through the verse saying (what means):",
                "“An Ifrît (strong) from the jinn said: ‘I will bring it to you before",
                "you rise from your place (council).’” (An-Naml, 27: 39)",
                "In  other  words,  before  Sulaimân  (peace  be  upon  him)  leave  his",
                "council,  but  for  how  long  would  the  council  of  Sulaimân  (peace  be",
                "upon  him)  last?  Perhaps  for  one,  two  or  three  hours,  what  matters  is",
                "that  before  Sulaimân  (peace  be  upon  him)  rise  from  his  place  he",
                "would  find  the  throne  before  him.  But  what  did  the  one  with  whom",
                "was  knowledge  of  the  Scripture  say?  He  said  as  the  Noble  Qur’an",
                "relates (what means):",
                "“I will bring it to you within the twinkling of an eye!” (An-Naml,",
                "And  before  finishing  his  sentence  the  throne  of  Balqîs  was  before",
                "Sulaimân (peace be upon him)!!",
                "It  follows  then  that  there  exists  of  knowledge  what  makes  man",
                "capable  of  bringing  a  thing  from  one  place  to  another  within  a  few",
                "seconds.  But  such  knowledge  is  not  attainable  except  to  those",
                "specially favored by Almighty Allah with its mastery. In order for him",
                "to bring the throne within seconds, he must have called it or issued an",
                "order  whereby  it  moved  from  the  palace  of  Balqîs  in  Yemen  to  the",
                "council of Sulaimân (peace be upon him) in Syria!",
                "This urges us to believe in all what Allah, praise be to Him, has told",
                "us  about  the  things  unseen  to  us.  We  should  neither  deny  their",
                "existence  nor  their  life  just  because  we  do  not  perceive  them,  why?",
                "Because  we  definitely  have  hundreds  of  things,  which  we  could  not",
                "see  or  perceive  their  existence  and  afterwards  we  perceived  such",
                "existence. Consequently, it is an established fact in the universe.",
                "There is also an unperceived life within our bodies. The organs of the",
                "body: the hand, the foot, the tongue, the skin and all the organs of our",
                "bodies  have  a  life,  which  we  believe  to  be  derived  from  us.  In  other",
                "words, we order them and they obey. You order the foot to walk to the",
                "Masjid and it obeys, and you order it to walk to a bar and it obeys. The",
                "hand also may help a cripple in crossing the road or you may use it in",
                "oppressing,  killing  and  assaulting  people.  The  tongue  also,  you  utter",
                "the truth and it obeys you and you utter falsehood and it obeys you as",
                "well.",
                "Seemingly, you are mastering those organs, which do as you wish, but",
                "actually they have a life of their own. They are glorifiers of Allah and",
                "believers  in  Him.  They  also  have  a  language  with  which  they  talk.",
                "They  are  subjugated  to  you  only  in  the  life  of  this  world.  But  when",
                "they  come  to  an  end,  you  would  have  no  control  over  them.  In  the",
                "Hereafter,  they  would  neither  obey  nor  submit  to  your  will,  but  they",
                "would  bear  testimony  against  you  and  curse  you  if  you  have",
                "subjugated  them  in  what  may  incur  the  Wrath  of  Allah.  Recite  the",
                "Qur’anic  Statement  of  The  Truth,  all  praise  and  glory  be  to  Him",
                "(which means):",
                "“Till, when they reach it (Hell-fire), their hearing (ears) and their",
                "eyes, and their skins will testify against them as to what they used",
                "to do. And they will say to their skins, ‘Why do you testify against",
                "us?’ They will say: ‘Allah has caused us to speak, as He causes all",
                "things to speak.’” (Fussilat, 41: 20-21)",
                "Whoever  has  performed  the  enjoined  duty  of  Hajj  would  wonder  at",
                "the vigor that overwhelms the pilgrims. In spite of the hardships and",
                "the fact that they do not get enough sleep you find them highly active,",
                "whereas  at  their  homeland  they  lack  such  vivacity  though  they  have",
                "much rest.",
                "This  happens  because  the  body  organs  desire  neither  sleep  nor  rest,",
                "but  always  want  to be engaged  in the  Remembrance and  Worship  of",
                "Allah, simply because during the performance of the Hajj rituals man",
                "is  engaged  with  nothing  except  the  Remembrance  of  Allah.  Those",
                "organs wish that they do not miss His Remembrance by going to sleep",
                "so as to remain a glorifier of Allah, whereas, the organs of a sinning",
                "disbeliever force him to go to sleep so as to rest from his wrongdoing.",
                "Some  people  may  wonder  how  could  those  deaf  organs  speak?  We",
                "reply by quoting the noble Qur’anic verse, which says (what means):",
                "“Allah  has  caused  us  to  speak,  as  He  causes  all  things  to  speak.”",
                "(Fussilat, 41: 21)",
                "It  follows  that  all  what  is  termed  a  ‘thing’  in  this  worldly  life  has  a",
                "language  whereby  Allah  makes  it  speaks,  for  the  entire  universe",
                "celebrates  the  Glory  of  Allah,  praise  be  to  Him.  If  you  wonder  that",
                "your  skin,  hands,  feet  and  tongue  would  bear  testimony  against  you",
                "and would have a language and a power of discrimination, we say that",
                "Allah, all praise and glory be to Him, has called our attention to such",
                "reality.  We  find  that  the  organs  of  the  one  body  perfectly  know  one",
                "another  through  a  special  language  or  code.  So,  if  you  lost,  for",
                "instance,  a  part  of  your  skin  and  wanted  to  graft  it  with  the  skin  of",
                "another  human,  the  body  would  reject  it,  whereas  if  you  got  hurt  or",
                "lost a number of cellular tissues as a result of a wound or a burn, your",
                "whole body would work so powerfully to weave new tissues same as",
                "your old tissues to compensate what you have lost.",
                "Accordingly,  every  body  knows  its  organs  quite  well  and  repels  the",
                "foreign  cells.  This  means  that  Allah,  all  praise  and  glory  be  to  Him,",
                "has taught it how to distinguish between its own cells and that of other",
                "bodies."
            ],
            "All what is in the universe is alive": [
                "Briefly,  we  summarize  what  we  have  detailed  by  saying  that",
                "everything in this universe is alive and everything enjoys a (form of)",
                "life that suits its mission. Neither the inanimate beings, nor the plants,",
                "nor  the  animals  are  dead  but  we  simply  do  not  perceive  their  lives.",
                "Furthermore, the inanimate beings sense, feel and cry. When a son of",
                "Adam  (man)  dies,  two  places  mourn  his  death:  the  place  where  he",
                "used  to  prostrate  himself  (in  worship)  and  the  place  where  his  deeds",
                "ascend to heaven. Allah, all praise and glory be to Him, has set forth",
                "in  the  Noble  Qur’an  examples  of  the  knowledge  acquired  by  other",
                "species  as  well  as  their  lives.  For  the  ant  knew  that  the  man  coming",
                "forward  was  the  Prophet  Sulaimân  (peace  be  upon  him)  and  that  he",
                "might tramp on them with his army.",
                "Life exists in all the species of the universe. It exists in what we see",
                "before  us  solid  and  motionless  as  mountain  rocks,  sand  particles",
                "besides the other species of the universe that we know nothing about",
                "their lives. We have also shown the evidence that these species have a",
                "role to play in the universe.",
                "We have also clarified that existence is one thing and its perception is",
                "another,  as  life  is  not  limited  to  mankind  alone  but  it  extends  to",
                "comprise all the species of the universe.",
                "But is this the life that Allah, praise be to Him, wishes for us, merely a",
                "worldly  life?  Or  is  there  another  life  beyond  this  worldly  life  which",
                "the Lord of Majesty, all praise and glory be to Him, has indeed meant",
                "for us. That is what we shall discuss, by the Will and Help of Allah, in",
                "the next chapter"
            ]
        },
        "Chapter 3": {
            "Chapter 3": [],
            "What Is Death?": [
                "Before starting to discuss death, we have to state that life in the Sight",
                "of  Allah  is  not  worldly  life,  but  it  is  the  Hereafter.  That  is  because",
                "when Allah, all praise and glory be to Him, created man and breathed",
                "into  him  the  soul  He  created  for  him,  He  granted  him  immortality.",
                "That  is  to  say,  everyone  who  is  born  and  brought  to  this  life  would",
                "remain everlastingly immortal, be it in Paradise or Hellfire, may Allah",
                "save  us  from  such  an  end  (Hellfire).  Even  an  infant  that  dies  at  the",
                "prime of its life will be resurrected and will be immortal in Paradise.",
                "Moreover, it will accompany its parents and admit them into Paradise.",
                "When  Allah,  all  praise  and  glory  be  to  Him,  breathed  into  man  the",
                "soul  He  created  for  him,  He  granted  him  immortality.  Thus,  he  lives",
                "his  destined  days  or  years  of  worldly  life,  then  dies,  and  then  is",
                "resurrected to live eternally in the Hereafter according to his deeds in",
                "adhering to the Divine Law or violating it. He is either to be blessed or",
                "tortured.  The  Noble  Qur’an  expresses  that  meaning  through  the",
                "glorious verse saying (what means):",
                "“Verily, the home of the Hereafter, that is the life indeed (i.e. the",
                "eternal life that will never end), if they but knew.” (Al-‘Ankabût,",
                "The  abode  of  the  Hereafter  is  the  true  life  that  man  will  live.  As  for",
                "worldly life, it is limited no matter how long we live in it; it is man’s",
                "abode of trial where there is no immortality. Allah, all praise and glory",
                "be to Him, says in His Noble Book (what means):",
                "“Answer  Allah  (by  obeying  Him)  and  (His)  Messenger  when  he",
                "calls you to that which will give you life.”  (Al-Anfâl, 8: 24)",
                "The aforesaid speech is addressed to the believers, however, Allah, all",
                "praise and glory be to Him, addressed it to them while they were still",
                "alive, so how could He say to them (what means), ‘To that which will",
                "give you life’, although they were actually living?",
                "We reply by saying that this life is not the eternal life, which Allah has",
                "prepared for man. It is an abode of trial where man is to be tested in",
                "obeying the Divine Law. If he succeeded, he would be admitted into",
                "Paradise, but if he were engulfed by his desires and sins, he would be",
                "cast into Hellfire.",
                "Allah, all praise and glory be to Him, calls every living being in this",
                "life  ‘dead’,  which  signifies  that  it  is  definitely  destined  to  die.",
                "Therefore, Allah addressed His Messenger (may Allah bless him and",
                "grant him peace) by saying (what means):",
                "“Verily,  you  (O  Muhammad)  will  die  and  verily,  they  (too)  will",
                "die.” (Az-Zumar, 39: 30)",
                "Why  did  Allah,  all  glory  be  to  Him,  address  the  Messenger  of  Allah",
                "(may  Allah  bless  him  and  grant  him  peace)  and  his  Companions  as",
                "being  dead  though  the  Qur’anic  verse  was  addressed  to  them  while",
                "still alive? Because  that  is  their  destined  fate,  when  man  is  born  and",
                "his  life  begins,  the  death  arrow  darts  at  the  same  moment  and  death",
                "keeps  pursuing  the  targeted  person  until  the  appointed  death  term",
                "comes and the arrow pierces through.",
                "Death  is  not  intrinsic  in  the  universe  but  a  transient  journey.  In  the",
                "immaterial  existence  we  were  dead,  then  we  came  to  worldly  life",
                "alive,  then  we  would  die  once  again,  then  we  would  be  resurrected.",
                "Allah, all praise and glory be to Him, says (what means):",
                "“How can you disbelieve in Allah? Seeing that you were dead and",
                "He  gave  you  life.  Then  He  will  give  you  death,  then  again  will",
                "bring you to life (on  the Day of Resurrection) and then unto Him ",
                "you will return.” (Al-Baqarah, 2:28)",
                "The stages  of  man’s life  or the life journey that h",
                "e und ertakes  is ",
                "divided into four: the first stage is death  in the immaterial ex istence. ",
                "The second is worldly life. The third is death in the Barzakh [the grave ",
                "as the barrier  or the intermediate realm that ",
                "separates between this ",
                "world and the other world,",
                "Resurrection] life.  And the fourth is eternal life, whether in  Paradise ",
                "or Hellfire. On the Day of Resu rrection, death wou ld be brought and ",
                "its soul would be seized or slain as the Messenger of Allah (may Allah ",
                "bless him and grant him peace) has informed us in his noble Hadith:",
                "“Death would be brought on the Day of Resurrection having the ",
                "form of a ram then it would be slaughtered and a  crier from Allah, ",
                "all glory be to Him,   would call: ‘O people of Parad ise, immorta lity ",
                "without death. O people of Hellfire, immortality without death.’”",
                "So, death has an end. Allah, all praise and glory be to Him, says about ",
                "the people of Paradise (what means):",
                "“They will never taste death therein except the first death (of this ",
                "world), and He will sa ve  them from the torment  of the blazing ",
                "Fire.” (Ad-Dukhân, 44:56)",
                "We thus learn that death has an end, whereas life wou",
                "eternally  forever  and  that  life is  the on e intrinsic in the universe, ",
                "whereas death is incidental upon it.",
                "ld remain "
            ],
            "Life within the grave!!": [
                "With imminence  of death, the destined hour comes and is succeeded  ",
                "by the life of the grave, an interval that ends by Resurrection. Through ",
                "close inspection, we perceive that this stage  or interval is brief and ",
                "cannot be compared with the life that will follow after Resurrectio",
                "n.",
                "The Noble Qur’an expresses that meaning through the word ‘visit’ in",
                "the verse saying (what means):",
                "“The  mutual  rivalry  for  piling  up  of  worldly  things  diverts  you,",
                "until you visit the graves (i.e. till you die).” (At-Takâthur, 102: 1-",
                "It means that man in the grave is but a visitor and will not stay there",
                "forever. As long as he is a visitor not a habitant, then no matter how",
                "long the visit will last, there will come the time when it will end. It is a",
                "visit  that  will  end  by  the  Day  of  Crowding. Death  is  transition from",
                "certain  laws  to  other  different  laws.  Man  while  alive  has  a  material",
                "being,  that  is  the  body,  but  at  death  the  body  returns  once  again  to",
                "earth and is restored to its owner on the Day of Resurrection.",
                "Death begins with drawing the last breaths, which means that the life",
                "of  human  choice  has  come  to  an  end.  Man  in  this  worldly  life  has",
                "choices as well as a reasoning power to choose between alternatives.",
                "But the hour he dies, the time of free choice, set as a trial and test for",
                "him, ends and a new stage without choices and in which he is subdued",
                "begins.  When man is suffering the agonies of death he knows for sure",
                "that he is dying, because he now can see the angels and sees from the",
                "Universe  of  Allah  what  has  been  kept  veiled  from  him.  Recite  the",
                "noble Qur’anic verse in which Allah, all glory be to Him, says (what",
                "means):",
                "“(It will be said to the sinners): ‘Indeed you were heedless of this,",
                "now We have removed your covering, and sharp is your sight this",
                "Day!’” (Qâf, 50: 22)",
                "At  those  moments  humanity  dies  down  and  fates  are  definitely",
                "decided,  either  to  Paradise  or  Hellfire,  either  to  see  the  angels  of",
                "mercy or the angels of torture. Allah, all praise and glory be to Him,",
                "has informed us thus in His Noble Book regarding what would happen",
                "to the inhabitants of Paradise when death approaches them. The Most",
                "Exalted says, (what means):",
                "“Those whose lives the angels take while they are in a pious state",
                "(i.e.  pure  from  all  evil,  and  worshipping  none  but  Allah  Alone)",
                "saying (to them): Salâmun ‘Alaikum (peace be on you) enter you",
                "Paradise,  because  of  (the  good)  which  you  used  to  do  (in  the",
                "world).” (An-Nahl, 16: 32)",
                "Hence,  we  learn  that  the  believers,  who  have  done  righteous  deeds,",
                "see the angels of mercy at their death hour, which is the first herald of",
                "glad tidings to them of entering Paradise. So, their souls are relieved",
                "and they smile joyfully because they are departing to that which is far",
                "better.  If  you  looked  at  their  faces  after  death,  you  would  find  them",
                "tranquil  and  peaceful  for  what  they  saw  of  the  fulfillment  of  Allah’s",
                "Promise, Who never breaks His Word.",
                "As  for  those  who  disbelieved  in  Allah,  sinned  against  Him,  joined",
                "others  in  worship  with  Him  and  warred  against  His  Religion,  their",
                "meeting with death would certainly differ. The Noble Qur’an informs",
                "thus in the glorious verse saying (what means):",
                "“And if you could see when the angels take away the souls of those",
                "who  disbelieve  (at  death),  they  smite  their  faces  and  their  backs,",
                "(saying): ‘Taste the punishment  of the blazing Fire.’”   (Al-Anfâl,",
                "Allah, all praise and glory be to Him, sets forth to us another picture",
                "of  the  disbelievers  through  the  noble  Qur’anic  verse  saying  (what",
                "means):",
                "“And  if  you  could  but  see  when  the  Zâlimûn  (polytheists  and",
                "wrongdoers, etc.) are in the agonies of death, while the angels are",
                "stretching  forth  their  hands  (saying):  ‘Deliver  your  souls!  This",
                "day  you  shall  be  recompensed  with  the  torment  of  degradation",
                "because  of  what  you  used  to  utter  against  Allah  other  than  the",
                "truth. And you used to reject His Ayât (proofs, evidences, verses,",
                "lessons,  signs,  revelations,  etc.)  with  disrespect!’”  (Al-An‘âm,  6:",
                "We learn from these noble Qur’anic verses that as the believer sees his",
                "blessed end and his abode in Paradise while dying, the disbeliever also",
                "sees  his  doom  and  his  abode  in  Hellfire  while  dying.  Moreover,  the",
                "angels  of  torture  disgrace  the  disbeliever  as  a  retribution  for  his",
                "disbelief.  They  smite  his  face  and  back  and  make  him  taste  the",
                "torment  of  Hellfire.  They  defy  him  saying  that  if  ever  he  possessed",
                "any power or might in worldly life to free himself from the torture and",
                "disgrace  he  now  faces.  But  he  would  never  be  able  to,  because  he",
                "neither has the power nor the might.",
                "The  power  of  human  free  choice  has  ended,  and  he  became",
                "overpowered, as the rest of the species in the universe, after enjoying",
                "free  will  in  worldly  life.  Amongst  the  signs  of  an  evil  end,  we  seek",
                "refuge  with  Allah  from  it,  is  to  see  the  face  of  the  disbeliever  or  the",
                "wrongdoer has gloomed, his body has convulsed and his features have",
                "contorted from the horrors he sees of the torment that awaits him.",
                "The  Messenger  of  Allah  (may  Allah  bless  him  and  grant  him  peace)",
                "warn the people against such a fate by saying O people:",
                "“You  have  milestones  so  be  you  guided  by  your  milestones,",
                "and you have an end so be you guided by your end. A believer",
                "is betwixt two dreads, betwixt a term that has passed knowing",
                "not  what  Allah  will  judge  in  it  and  a  term  that  still  remains",
                "knowing  not  what  Allah  will  destine  in  it.  So,  let  a  servant",
                "takes  provision  for  himself  from  his  own  self,  and  from  his",
                "worldly life for his afterlife, and from hoariness before old age",
                "and from life before death. By the One in Whose Hands the",
                "soul of Muhammad is, none shall be allowed to make amends",
                "after death, nor there shall be an abode after life save Paradise",
                "or Hellfire.”",
                "The  hour  of  death  as  depicted  by  the  Noble  Qur’an,  reveals  the",
                "Unseen, lifts the screening veils and renders the sight sharp. All that is",
                "hidden from us is disclosed, as verified by the noble Qur’anic verse in",
                "which Allah, all glory be to Him, says (what means):",
                "“Then  why  do  you  not  (intervene)  when  (the  soul  of  a  dying",
                "person)  reaches  the  throat?  And  you  at  the  moment  are  looking",
                "on, but We (i.e. Our angels who take the soul) are nearer to him",
                "than you, but you see not.” (Al-Wâqi‘ah, 56: 83-85)",
                "At  that  moment  the  first  abodes  of  the  Hereafter  begins,  because  the",
                "dead person is to experience the befalling of his Doomsday and learns",
                "his end. When he dies, he hears but he will not be able to answer. He",
                "sees, but he will not be able to relate what he sees. The dead have a",
                "perception of their own just as the living do.",
                "The  Messenger  of  Allah  (may  Allah  bless  him  and  grant  him  peace)",
                "says to us,  “If you visit the graves, greet their inhabitants, and say:",
                "Peace  be  upon  you!  Abodes  of  believing  people.”  Since  the",
                "Messenger  of  Allah  (may  Allah  bless  him  and  grant  him  peace)  has",
                "ordered  us  to  do  so,  then  definitely  the  inhabitants  of  the  grave",
                "somehow  perceive  that  salutation,  otherwise  the  Messenger  of  Allah",
                "(may Allah bless him and grant him peace) would not have instructed",
                "us thus.",
                "Hence,  the  inhabitants  of  the  grave  somehow  perceive  their  visitors",
                "and  the  greeting  they  offer  them.  They  have  another  perceiving",
                "faculty; a mental or a reasoning power that makes them distinguishes",
                "between hope and despair. Allah, all praise and glory be to Him, says",
                "(what means):",
                "“O you who believe! Take not as friends the people who incurred",
                "the  Wrath  of  Allah  (i.e.  the  Jews).  Surely,  they  have  been  in",
                "despair  to  receive  any  good  in  the  Hereafter,  just  as  the",
                "disbelievers  (buried)  in  graves  have  been  in  despair.”  (Al-",
                "Mumtahinah, 60: 13)",
                "Reaching  such  a  degree  of  despair  needs  some  kind  of  perception.",
                "None can verge on despair or experience it except a perceiving person,",
                "who can distinguish between things to realize that this is a degree of",
                "despair and this is a degree of hope. Allah, all glory be to Him, says",
                "(what means):",
                "“Just as the disbelievers (buried) in graves have been in despair.”",
                "(Al-Mumtahinah, 60: 13)"
            ],
            "The Barzakh life… out of the span of time": [
                "The  Barzakh  [the  grave  as  the  barrier  or  the  intermediate  realm  that",
                "separates  between  this  world  and  the  other  world,  from  the  time  of",
                "death  till  the  time  of  Resurrection]  life  involves  certain  conceptions",
                "realized  by  the  dead.  The  life  of  the  grave  is  ungoverned  by  time.",
                "Therefore,  if  man  were  interred  from  the  prime  of  worldly  life  and",
                "continued till the Day of Resurrection, he would think that he spent a",
                "day or a part of a day. Allah, all praise and glory be to Him, set forth a",
                "vivid  example  for  that  in  the  story  of  the  People  of  the  Cave.  He",
                "caused them to sleep for three hundred and nine years and when they",
                "woke  up  they  wondered  as  the  Noble  Qur’an  narrates  to  us,  saying",
                "(what means):",
                "“Likewise,  We  awakened  them  (from  their  long  deep  sleep)  that",
                "they  might  question  one  another.  A  speaker  from  among  them",
                "said:  ‘How  long  have  you  stayed  (here)?’  They  said:  ‘We  have",
                "stayed (perhaps) a day or part of a day.’” (Al-Kahf, 18: 19)",
                "Why did they say that they stayed for a day or part of a day? Because",
                "when they looked at the faces and clothes of one another, they found",
                "them same as when they entered the cave. If, when they woke up they",
                "found that their nails had grown long, their hair and beards had turned",
                "white  and  their  faces  had  mirrored  the  imprints  of  time,  they  would",
                "not have remarked that perhaps they have stayed for a day or part of a",
                "day. But during those three hundred years they were out of the span of",
                "time, therefore it did not leave its imprints on them.",
                "Similarly,  the  inhabitants  of  the  grave  will  rise  with  the  same",
                "appearance  they  had  when  they  were  buried.  Hence,  no  human  dies",
                "while still a child and is resurrected an old man, no matter how many",
                "years have elapsed. Therefore, The Patron, all praise  be  to  Him,  will",
                "ask His servants saying (what means):",
                "“He  (Allah)  will  say:  ‘What  number  of  years  did  you  stay  on",
                "earth?’ They will say: ‘We  stayed  a  day  or  part  of  a  day.  Ask  of",
                "those who keep account.’” (Al-Mu’minûn, 23: 112-113)",
                "We learn from this that amongst the laws of the Barzakh [the grave as",
                "the barrier or the intermediate realm that separates between this world",
                "and  the  other  world,  from  the  time  of  death  till  the  time  of",
                "Resurrection] that no time leaves its imprints on the inhabitants of the",
                "grave because they live out of the span of time.",
                "But  is  there  torture  for  the  inhabitants  of  the  grave?  No,  there  is  no",
                "torture  save  after  Judgment.  Nevertheless,  while  engraved,  man  sees",
                "his abode whether in Hellfire or Paradise, but why? So that a believer",
                "feels the grace that Allah, The Most Exalted, has bestowed on him by",
                "saving  him  from  Hellfire  and  appreciates  it  even  more  when  he  sees",
                "the  Hellfire  and  its  blaze  versus  Paradise  and  its  delights.  Hence,  a",
                "comparison is drawn between the good-doer and the evildoer: the one",
                "who  has  wronged  himself  thus  depriving  it  from  everlasting  delight",
                "and the demeaning torture that he ended in.",
                "The  believer  feels  the  grace  and  mercy  that  Allah  has  bestowed  on",
                "him; that Allah has guarded him form Hellfire, so his heart is relieved",
                "and he realizes the greatness of the Blessings of Allah on him.",
                "The  Truth,  all  praise  and  glory  be  to  Him,  has  depicted  to  us  what",
                "would  happen  to  the  people  of  Fir‘aun  (Pharaoh)  while  engraved",
                "through the noble Qur’anic verse saying (what means):",
                "“The Fire; they are exposed to it, morning and afternoon, and on",
                "the  Day  when  the  Hour  will  be  established  (it  will  be  said  to  the",
                "angels):  ‘Cause  Fir‘aun’s  (Pharaoh)  people  to  enter  the  severest",
                "torment!’” (Ghâfir, 40: 46)",
                "When  are  the  people  of  Pharaoh  are  exposed  to  Hellfire?  Were  they",
                "exposed to it in worldly life? If they were exposed to it and saw it but",
                "for  a  moment  they  would  not  have  worshipped  Pharaoh,  surely  they",
                "would have been the ones to kill him and cast him into the sea.",
                "Exposure to Hellfire regarding the people of Pharaoh did not occur in",
                "worldly  life.  Would  it  then  happen  in  the  Hereafter?  No,  because  in",
                "the  Hereafter  there  would  be  no  exposure,  rather  the  people  of",
                "Pharaoh would be cast into Hellfire to be tortured.",
                "Hence,  they  were  not  exposed  to  Hellfire  in  worldly  life,  and  they",
                "would  not  be  exposed  to  it  in  the  Hereafter  because  they  would",
                "actually be cast into it.",
                "There  remains  the  B a r z a k h  [the  grave  as  the  barrier  or  the",
                "intermediate  realm  that  separates  between  this  world  and  the  other",
                "world, from the time of death till the time of Resurrection] life or the",
                "life  of  the  grave.  The  people  of  Pharaoh  are  exposed  to  Hellfire",
                "morning and afternoon in the Barzakh life or the life of the grave, but",
                "do  the  people  of  Pharaoh  come  forth  twice  a  day  to  be  exposed  to",
                "Hellfire? Or are they exposed to it while engraved?",
                "No  one  can  tell!  Except  that  there  exists  some  kind  of  torment  to",
                "which  man  is  exposed  while  engraved.  But  true  torment  will  not  be",
                "inflicted  save  after  Judgment  on  the  Day  of  Resurrection.  Indeed,",
                "enough  of  torment  that  the  people  of  Pharaoh  twice  see  the  fire",
                "wherein they will be tortured, in the morning and afternoon, because",
                "expecting distress is severer than its actual befalling. Therefore, they",
                "become  certain  that  they  will  be  tortured  in  that  Hellfire.  Whenever",
                "they looked at it, it would afflict them with a horrible torment, perhaps",
                "severer than the torment of Hellfire itself.",
                "Your Lord, all praise and glory be to Him, has decreed that whoever",
                "departs from this world would never return to it again, till the Day of",
                "Resurrection. The Most Exalted says (what means):",
                "“Until, when death comes to one of them (those who join partners",
                "with  Allah),  he  says:  ‘My  Lord!  Send  me  back,  so  that  I  may  do",
                "good in that which I have left behind!’ No! It is but a word that he",
                "speaks,  and  behind  them  is  Barzakh  (a  barrier)  until  the  Day",
                "when they will be resurrected.” (Al-Mu’minûn, 23: 99-100)",
                "What  is  the  Barzakh? The Barzakh  is  the  barrier  between  the  living",
                "and the dead, whereby the dead can never return to worldly life once",
                "again. When the martyrs saw the great delights that Allah has prepared",
                "for them, they begged Allah, all glory be to Him, to return to worldly",
                "life just to inform their brethren about what they have seen. But, The",
                "Almighty told them (the Divine Hadith saying): ‘I have decreed that",
                "whoever departs from it, shall never return to it.’ And The Almighty",
                "pledged Himself to inform the believers about the merit of martyrdom",
                "and the elevated status that awaits martyrs."
            ],
            "Him Alone gives life and causes death": [
                "Allah,  all  praise  and  glory  be  to  Him,  is  The  Originator  of  life  and",
                "death. That is to say, Allah, The Most Exalted, is the only One Who",
                "brings  man  from  life  to  death  and  from  death  to  life.  Therefore,",
                "amongst His Divine Names, all praise be to Him, is The Giver of life",
                "and The Causer of death. The Noble Qur’an conveys to us the words",
                "of  the  Prophet  Ibrâhîm  (Abraham,  peace  be  upon  him),  who  said",
                "(what means):",
                "“Verily!  They  are  enemies  to  me,  save  the  Lord  of  the  ‘Alamîn",
                "(mankind, jinn and all that exists); ‘Who has created me, and it is",
                "He  Who  guides  me;  And  it  is  He  Who  feeds  me  and  gives  me  to",
                "drink.  And  when  I  am  ill,  it  is  He  who  cures  me;  And  Who  will",
                "cause me to die, and then will bring me to life (again); And Who, I",
                "hope  will  forgive  me  my  faults  on  the  Day  of  Recompense,  (the",
                "Day of Resurrection).’” (Ash-Shu‘arâ’, 26: 77-82)",
                "We  notice  in  these  noble  Qur’anic  verses  that  Allah,  all  praise  and",
                "glory be to Him, has emphasized the matters that some people believe",
                "that  others  than  Almighty  Allah  have  a  hand  in  them.  But  as  for  the",
                "matters which man can never claim to have a hand in, He stated them",
                "without emphasis.",
                "The  Most  Exalted  says  (in  His  Noble  Book  the  words  of  Ibrâhîm",
                "which  means):  ‘Who  has  created  me,’  as  no  one  can  claim  that  he",
                "creates.  But  The  Almighty  says  (in  His  Noble  Book  the  words  of",
                "Ibrâhîm which means): ‘It is He Who guides me,’ stating the stressed",
                "subject pronoun ‘He’ because there are claimers of securing guidance,",
                "who  practice  deceit  so  as  to  induce  people  to  follow  them  and  adopt",
                "their  course.  Therefore,  The  Most  Exalted  has  not  stated  the  subject",
                "pronoun  ‘He’  in  the  first  part  of  verse  78;  he  did  not  say,  ‘It  is  He",
                "Who  has  created  me,’ but said, ‘Who  has  created  me,’  because  the",
                "issue  of  creation  is  utterly  decided  as  solely  pertaining  to  Allah,  all",
                "praise  and  glory  be  to  Him.  The  subject  pronoun  also  recurs  in  the",
                "Qur’anic  statement  of  Ibrâhîm  (peace  be  upon  him),  when  he  said",
                "(what means): ‘It is He Who feeds me and gives me to drink.’ Here,",
                "The  Almighty  also  stated  the  pronoun,  ‘He’  because  man  has  some",
                "action to do as bringing food or delivering water to people.",
                "Then Allah, Whose Majesty reigns supreme, says (in His Noble Book",
                "the words of Ibrâhîm which means): ‘And when I am ill, it is He who",
                "cures me,’ where The Almighty also used the pronoun ‘He’, so that no",
                "one  claims  that  the  doctor  is  the  one  who  cures.  The  truth  is  the",
                "absolute  opposite.  The  doctor  only  gives  medical  aid,  whereas  the",
                "only  One  Who  cures  is  Allah,  all  praise  and  glory  be  to  Him.",
                "Moreover,  the  doctor  can  be  one  of  the  causes  behind  death.  It  may",
                "happen that the doctor prescribes to the patient a wrong medication or",
                "inject him with what he believes to be his cure, thus causes his death.",
                "Therefore,  Allah,  all  glory  be  to  Him,  placed  a  stress  on  it  with  the",
                "pronoun ‘He’ that is used, as mentioned previously, for emphasis, so",
                "The  Almighty  says  (in  His  Noble  Book  the  words  of  Ibrâhîm  which",
                "means): ‘It is He who cures me.’",
                "But when it comes to life and death, there is no need to use a stressing",
                "subject  pronoun.  Therefore,  The  Almighty  says  (in  His  Noble  Book",
                "the words of Ibrâhîm which means): ‘And Who will cause me to die,",
                "and then will bring me to life (again).’ Why? Because life and death",
                "belong to Allah alone and none can ever lay claim to them."
            ],
            "Nimrod and his claim of causing death and giving life": [
                "The Noble Qur’an narrates to us the story of Nimrod, on whom Allah",
                "has  bestowed  sovereignty,  but  instead  of  showing  gratefulness  to",
                "Allah for His Blessings and performing righteous good deeds, he was",
                "misled by the conceit of worldly life, so he claimed that he gives life",
                "and causes death. Recite the noble Qur’anic verse in which Allah, all",
                "glory be to Him, says (what means):",
                "“Have  you  not  looked  at  him  who  disputed  with  Ibrâhîm",
                "(Abraham)  about  his  Lord  (Allah),  because  Allah  had  given  him",
                "the kingdom? When Ibrâhîm (Abraham) said (to him): ‘My Lord",
                "(Allah) is He Who gives life and causes death.’ He said, ‘I give life",
                "and cause death.’ Ibrâhîm (Abraham) said, ‘Verily! Allah causes",
                "the  sun  to  rise  from  the  east;  then  cause  it  you  to  rise  from  the",
                "west.’  So  the  disbeliever  was  utterly  defeated.  And  Allah  guides",
                "not  the  people,  who  are  Zâlimûn  (wrong-doers,  etc.).”  )  Al-",
                "Baqarah, 2: 258)",
                "Nimrod summoned one of his subjects, then ordered his soldiers to kill",
                "him and said, ‘I caused him to die!!’ And just before the execution he",
                "said, ‘Pardon him,’ and then he said, ‘I caused him to live!!’",
                "We say to him, ‘You have not differentiated between the two events,",
                "and you have not differentiated between life and death.’ Killing is not",
                "death,  but  it  is  a  destruction  of  the  physical  structure  of  the  body  so",
                "the soul departs it, because the soul does not dwell except in a sound",
                "body  having  special  characteristics.  Therefore,  Allah,  all  praise  and",
                "glory be to Him, says about His Messenger (may Allah bless him and",
                "grant him peace) (what means):",
                "“Muhammad (may Allah bless him and grant him peace) is no",
                "more  than  a  Messenger,  and  indeed  (many)  Messengers  have",
                "passed away before him. If he dies or is killed, will you then turn",
                "back  on  your  heels  (as  disbelievers)?  And  he  who  turns  back  on",
                "his heels, not the least harm will he do to Allah, and Allah will give",
                "reward to those who are grateful.” (Âl-‘Imrân, 3: 144)",
                "Therefore, death differs from killing; death is the departure of the soul",
                "from the body while the physical structure is sound and only Allah, all",
                "praise and glory be to Him, causes death. But man can commit murder",
                "either by a sharp knife or a gunshot. In both cases the soul departs the",
                "body,  but  in  the  first  case  (that  is  death)  the  soul  departs  the  body",
                "while the physical structure is perfect, whereas in murder the physical",
                "structure has to be destroyed before the soul departs the body. In both",
                "cases, the dead and the murdered shall be gathered unto Allah on the",
                "Day of Resurrection as verified by the noble Qur’anic verse in which",
                "Allah, all glory be to Him, says (what means):",
                "“And  whether  you  die,  or  are  killed,  verily,  unto  Allah  you  shall",
                "be gathered.” (Âl-‘Imrân, 3: 158)",
                "r be the end of man, whether through",
                "We can thus see that whateve",
                "murder  or  death,  he  will  meet  Allah  on  the  Day  of  Resurrection.  As",
                "we said before, death annuls life and life annuls death, therefore they",
                "never exist together in a thing. It is either life or death. Allah, all glory",
                "be to Him, says (what means):",
                "“Who  has  created  death  and  life,  that  He  may  test  you  which  of",
                "you is best in deed. And He is the All-Mighty, the Oft-Forgiving.”",
                "(Al-Mulk, 67: 2)",
                "As if life is but a trial that is to be followed by death, then begins the",
                "first stages of the Hereafter and then comes Judgment. But Allah, all",
                "praise and glory be to Him, has concealed from all of us the time of",
                "death. Allah, glory be to Him, says (what means):",
                "“No  person  knows  what  he  will  earn  tomorrow,  and  no  person",
                "knows  in  what  land  he  will  die.  Verily,  Allah  is  All-Knower,  All-",
                "Aware (of things).” (Luqmân, 31: 34)",
                "Such concealment by Allah has a great wisdom. First, that man is to",
                "expect  death  at  any  moment  and  such  an  expectation  is  a",
                "consciousness of death. You know that you may die the next hour, so",
                "you hasten to the performance of good deeds lest your decreed time of",
                "death does not give you respite and your soul is taken while your good",
                "deeds  are  but  few.  You  also  forbear  from  committing  misdeeds  lest",
                "you do wrong and fate does not give you respite to repent and you die",
                "a sinner.",
                "So, the concealment of death time is the greatest announcement of it;",
                "at  the  same  time  it  is  the  highest  alertness  to  meet  it  any  moment.",
                "Whereupon, we hasten to good deeds and abandon sin, thus prosperity",
                "prevails and sin dwindles.",
                "We  have  to  be  absolutely  certain  that  there  is  no  cause  behind  death",
                "except the appointed term (of Allah). Never believe that sickness may",
                "kill or a bullet may shoot dead except when the term of man’s life in",
                "this world has come to an end. When man falls ill he may take a tablet",
                "of aspirin or a cup of tea and he gets cured because he still has time to",
                "live.  On  the  other  hand,  he  may  be  transported  to  the  hospital  where",
                "he  is  surrounded  by  many  doctors  and  yet  dies,  because  death  is",
                "predestined  by  Allah,  and  the  Predestinations  of  Allah  are  never",
                "overpowered.",
                "Allah, all glory be to Him, says (what means):",
                "“Say (O Muhammad): ‘I have no power over any harm or profit",
                "to  myself  except  what  Allah  may  will.  For  every  Ummah  (a",
                "community  or  a  nation),  there  is  a  term  appointed;  when  their",
                "term is reached, neither can they delay it nor can they advance it",
                "an hour (or a moment).’” (Yûnus, 10: 49)",
                "Do not consider causes in death, because when death comes the entire",
                "universe is considered its cause and none can ever stop it. When ‘Ali",
                "bin  Abu  Tâlib  (may  Allah  be  pleased  with  him)  was  asked,  ‘Do  not",
                "you fear death?’ He said, ‘No, the day it comes none can stop it, and",
                "the day it does not, none can bring it.’",
                "The causes of death we usually list: as sickness, senility and others are",
                "unreal, because when death comes it needs no cause. But it is truthful",
                "to say, ‘He died because his appointed lifetime has ended.’",
                "Allah, The Truth, all praise and glory be to Him, says (what means):",
                "“Wheresoever you may be, death will overtake you even if you are",
                "in fortresses built up strong and high!”  (An-Nisâ’, 4: 78)",
                "We summarize what we have detailed by saying that life and death are",
                "two antitheses, where one annuls the other. That Allah, all praise and",
                "glory be to Him, has granted man the aspect of perpetuity in life, but",
                "death  is  transient  and  will  end  and  be  slaughtered  on  the  Day  of",
                "Resurrection.  That  man  is  immortal  in  this  universe,  whether  in",
                "Paradise  or  Hellfire;  we  seek  refuge  with  Allah  from  such  an  end",
                "(Hellfire).  That  life  of  the  grave  involves  some  kind  of  perception;",
                "therefore we greet the inhabitants of the grave on visiting them. That",
                "those buried in graves from disbelievers are in despair of receiving the",
                "Mercy of Allah. That life in the grave also involves a detachment from",
                "time,  because  the  inhabitants  of  the  grave  are  neither  influenced  by",
                "time nor feel its passage. It also involves a sort of witnessing torment.",
                "That death is the end of the interval that Allah has granted to man and",
                "empowered  him  with  freedom  of  choice  during  it.  But  when  he  dies",
                "the power of human choice ends and the time of trial terminates.",
                "When the believer dies the angels of mercy receive him with the glad",
                "tidings of entering Paradise, so he dies with a relieved soul because he",
                "is  going  to  a  far  better  place.  But  when  the  angels  of  torture  receive",
                "the  disbeliever  they  smite  his  face  and  back  and  make  him  taste  the",
                "colors of torment so he dies with a gloomy face because he is going to",
                "a far worse place. That Allah, all praise and glory be to Him, is The",
                "Creator of life and death. None can lay claim to them nor say that he",
                "can give life nor cause death, because only Allah, all praise and glory",
                "be to Him, brings out the living from the dead, and brings out the dead",
                "from the living.",
                "We  have  discussed  man’s  death,  but  what  about  his  immortality?",
                "What is the truth of that immortality? That is what we shall discuss in",
                "details in the next chapter, by the Will of Allah."
            ]
        },
        "Chapter four": {
            "Chapter four": [],
            "Man And Immortality": [
                "Allah, all praise and glory be to Him, has created man to enjoy eternal",
                "life; a fact many people omit. People measure the lifetime of man by",
                "his worldly life, which is a false claim. Worldly life is nothing but a",
                "minor  stage  in  the  life  of  man.  The  whole  universe  together  with  its",
                "sun, its moon and stars created to be in the service of man millions of",
                "years  ago,  their  age  can  in  no  way  be  longer  than  the  one  for  whose",
                "sake Allah has created them and subjugated to his service. Moreover,",
                "the life of man cannot be measured by the few or several years that he",
                "spends in this universe but it extends far beyond to be eternal.",
                "Allah,  all  praise  and  glory  be  to  Him,  has  granted  immortality  to  all",
                "that  came  to  this  universe  from  man  and  jinn,  no  difference  made",
                "between a believer and a nonbeliever. The only difference is that the",
                "believer  will  abide  forever  in  Paradise,  whereas  the  nonbeliever  will",
                "abide  forever  in  Hellfire.  So,  he  difference  will  be  in  the  abode  of",
                "eternity.",
                "Allah, Blessed and Exalted be He, has granted man immortality when",
                "He breathed into him the soul He created for him. But it is the Will of",
                "Allah that our life be stages: first comes death, followed by life, then",
                "death, and then eternity. Being oblivious, we care only for one stage:",
                "that of worldly life and deem it the only life we have. The truth is that",
                "worldly life, as we have said earlier, is just a stage or a minor part in",
                "the great eternal life journey.",
                "We were dead in the immaterial existence, then The Truth, all praise",
                "and glory be to Him, willed that we should come to this life. Then, He",
                "would cause us to die to undergo the Barzakh [the grave as the barrier",
                "or  the  intermediate  realm  that  separates  between  this  world  and  the",
                "other world, from the time of death till the time of Resurrection] life",
                "while  dead.  Then  would  follow  Resurrection  and  Judgment  upon",
                "which  everything  would  be  settled,  and  we  would  become  immortal",
                "either in Paradise or Hellfire, we seek refuge with Allah from such an",
                "end (Hellfire).",
                "When  Allah,  all  praise  and  glory  be  to  Him,  speaks  about  life,  He",
                "means  the  eternal  life  in  the  Hereafter.  The  worldly  life  is  but  an",
                "abode  of  trial  and  the  Hereafter  is  the  true  life  that  every  one  of  us",
                "must  seek.  The  Messenger  of  Allah  (may  Allah  bless  him  and  grant",
                "him peace) said in his noble Hadith:",
                "“What  have  I  to  do  with  worldly  life.  In  worldly  life  I  am  but  a",
                "traveler who sought shade under a tree then he departed and left it",
                "behind.”",
                "Life and death belongs only to Allah, unrivaled. Allah, all praise and",
                "glory be to Him, has unveiled to man from the secrets of His Universe",
                "whatever He willed with the exception of three things that He kept for",
                "Himself: (namely) (i) life, (ii) the factors of maintaining life, (iii) and",
                "death.  None  can  ever  lay  claim  to  these  three  things,  because  Allah,",
                "Blessed and Exalted be He, is the One Who created and guaranteed to",
                "His creatures the factors of the continuity of their survival. When the",
                "appointed term is due Allah will destine them to die and they will. The",
                "beginning  of  the  creation  is  only  in  the  Hands  of  Allah;  an",
                "indisputable truth, and none can grant life to any creature save Allah,",
                "all praise and glory be to Him, Who challenged the entire humanity in",
                "this regard.",
                "The Truth, all praise and glory be to Him, says (what means):",
                "“O  mankind!  A  similitude  has  been  coined,  so  listen  to  it",
                "(carefully): Verily! Those on whom you call besides Allah, cannot",
                "create  (even)  a  fly,  even  though  they  combine  together  for  the",
                "purpose.  And  if  the  fly  snatched  away  a  thing  from  them,  they",
                "would have no power to release it from the fly. So weak are (both)",
                "the seeker and the sought.” (Al-Hajj: 22: 73)",
                "Allah, Blessed and Exalted be He, has challenged the entire humanity",
                "with all its scientists, veterans and every mighty person, to create but a",
                "single fly and Allah is indeed The Omniscient of their incapability and",
                "weakness.  The  call  challenges  both  science  and  scientists  since  the",
                "revelation of the Noble Qur’ân till the establishment of the Last Hour",
                "that they will never be able to do it.",
                "Allah  has  revealed  some  of  the  secrets  of  His  Creation  to  some",
                "scientists in the field of heredity or genealogy. The attainment of such",
                "knowledge is supposed to deepen their belief that Allah, all praise and",
                "glory  be  to  Him,  has  specified  to  every  creature  the  code  of  its  life.",
                "But  instead,  they  used  this  knowledge  in  an  attempt  to  distort  the",
                "Creation  of  Allah,  wherefrom  ensued  a  fly  having  wings  in  its  eye.",
                "They  claimed  that  they  are  able  to  change  the  sex  of  a  baby  from",
                "female  to  male,  but  it  results  in  a  deformed  good  for  nothing  male.",
                "Satan is ever to tempt man to change and distort the Creation of Allah",
                "in  order  to  spoil  the  enjoined  duty  of  the  creatures  on  earth.  Allah,",
                "Blessed and Exalted be He, depicts this to us in through the Qur’anic",
                "verse saying (what means):",
                "‘“Verily,  I  will  mislead  them,  and  surely,  I  will  arouse  in  them",
                "false  desires;  and  certainly,  I  will  order  them  to  slit  the  ears  of",
                "cattle, and indeed I will order them to change the nature created",
                "by Allah.’ And whoever takes Shaitân (Satan) as a Walî (protector",
                "or  helper)  instead  of  Allah,  has  surely  suffered  a  manifest  loss.”",
                "(An-Nisâ’, 4: 119)",
                "If  genealogy  achieved  something  in  the  sixties,  it  would  achieve",
                "nothing regarding animals and mankind. It would bring about nothing",
                "but  useless  distortion  of  the  creatures.  If  trifling  with  genes  has",
                "resulted in a fly having wings in place of its eyes, this would neither",
                "lead to enhancing its role in the universe nor make it more powerful. It",
                "is only an act of spoiling and deforming."
            ],
            "The secret of life and its end": [
                "Allah,  all  praise  and  glory  be  to  Him,  is  the  Sole  Possessor  of  the",
                "secret of life. There is no Creator other than Him. He is also the Only",
                "Maintainer of the factors ensuring the continuity of life represented in",
                "air,  water  and  food.  Allah,  Whose  Majesty  reigns  supreme,  is  the",
                "Creator of the atmosphere. Certainly, the air that we all breathe is not",
                "created by man but by Allah, all praise and glory be to Him; also the",
                "water that we all drink is the Creation of Allah, all praise and glory be",
                "to Him.",
                "The  process  of  rainfall,  starting  from  evaporation  that  takes  place",
                "under  the  effect  of  sunrays,  to  the  condensation  of  that  vapor  at  the",
                "higher  atmospheric  layers  followed  by  the  formation  of  clouds,  then",
                "the winds that push the clouds to wherever Allah wills for rain to fall.",
                "All this is the creation of Allah, all praise and glory be to Him.",
                "We say to those who claim that man can cause rainfall, ‘We will not",
                "argue with you. The world is full of deserts and Allah, all praise and",
                "glory  be  to  Him,  has  created  rivers  that  run  for  thousands  of",
                "kilometers and has originated the sources of water that guarantee the",
                "continuity of their flowing. We shall not ask you to create a river for",
                "us, but all we ask from those who claim the ability to cause rainfall to",
                "create a small canal, not a river, just a small canal in the desert. When",
                "you succeed in doing so, you may come ahead and claim that you are",
                "able to cause rainfall. But before this you have nothing to say to us.’",
                "We  do  not  want  to  be  engaged  in  mere  sophistry  based  on  no",
                "objectivity  for  we  are  real  tired  of  empty  talk.  Allah,  all  praise  and",
                "glory  be  to  Him,  is  the  One  Who  created  sustenance.  He  is  the  One",
                "Who supplied plant with water and the necessary elements present in",
                "the soil. From the miracles of the Creation of Allah manifested in the",
                "seed  is  its  dependency  in  its  nutrition  on  a  food  store  present  within",
                "the  same  seed.  That  store  keeps  nourishing  the  seed  till  it  gives  off",
                "leaves through which it respires, and roots through which it sucks food",
                "from the soil.",
                "None can claim that he created the first seed of everything that exists",
                "in the universe. For instance, Allah created the first wheat seed, then it",
                "was transmitted from one generation to another same as everything on",
                "earth.  However,  man  can  develop  the  species  in  order  to  get  a  better",
                "harvest  and  increase  productivity,  but  the  beginning  remains  only  in",
                "the Possession of Allah, for man can never create even a single seed.",
                "The factors of the continuity of life are all in the Hands of Allah, all",
                "praise and glory be to Him. In this regard Allah says (what means):",
                "“Then  tell Me  (about)  the  human  semen  that  you  emit.  Is  it  you",
                "who create it (i.e. make this semen into a perfect human being), or",
                "are We the Creator?” (Al-Wâqi‘ah, 56: 58- 59)",
                "The semen is one of the causes of creation. Allah, all praise and glory",
                "be to Him, is the One Who created and originated it, maintaining life",
                "by  it  from  the  lifetime  of  Adam  (peace  be  upon  him)  till  the  Day  of",
                "Resurrection.  Allah,  Whose  Majesty  reigns  supreme,  says  (what",
                "means):",
                "“Tell  Me! The  water  that  you  drink.  Is  it  you  who  cause  it  from",
                "the rainclouds to come down, or are We the Causer of it to come",
                "down?” (Al-Wâqi‘ah, 56: 68-69)",
                "Allah, all praise and glory be to Him, wants to draw our attention to",
                "the fact that rainfall is only in His Power. Anything else that is said is",
                "untrue. Allah, all glory be to Him, is the only One Who is capable of",
                "providing us with sweet water from the saline. With respect to sowing,",
                "The Truth says in His entirely clear Qurânic verses (what means):",
                "“Tell Me! The seed that you sow in the ground. Is it you that make",
                "it grow, or are We the Grower?” (Al-Wâqi‘ah, 56: 63-64)",
                "Man’s  task  is  only  to  sow,  whereas  the  seeds  to  be  cultivated  are  a",
                "direct  creation  by  Allah.  Similarly,  the  water  by  which  the  seeds  are",
                "supplied  and  the  life  cycle  of  the  plant  until  it  becomes  a  tree  and",
                "yields fruits are from Allah. We only sow the seed in the ground then",
                "stand and wait until it becomes a fruitful tree. We have no hand in its",
                "growth  or  its  life  cycle.  Afterwards,  the  tree  yields  fruits  and  we",
                "gather them."
            ],
            "The two cycles of creation: death and life": [
                "We then move to the ending of life, also decreed by Allah. For no one",
                "is  capable  of  granting  immortality  to  himself  or  to  others.  Allah,  all",
                "praise and glory be to Him, says to His Messenger  (may Allah bless",
                "him and grant him peace) (in His Noble Book what means): “And We",
                "granted  not  to  any  human  being  immortality  before  you  (O",
                "Muhammad),  then  if  you  die,  would  they  live  forever?”  (Al-",
                "Anbiyâ’, 21: 34)",
                "In spite of the progress that the entire world has achieved in culture,",
                "science  and  technology,  it  stands  powerless  when  it  comes  to  death.",
                "People  may  talk  about  the  apparent  causes  behind  death  but  the",
                "indisputable  fact  is  that  man  dies  only  because  it  is  the  end  of  his",
                "lifetime.",
                "But there remains one point that we have to discuss. Allah, all praise",
                "and glory be to Him, says (what means): “He brings forth the living",
                "from  the  dead,  and  it  is  He  Who  brings  forth  the  dead  from  the",
                "living.” (Al-An‘âm, 6: 95)",
                "Some of the scientists have tried to interpret this noble Qur’anic verse",
                "in a naive way saying, ‘Allah brings forth the egg from the hen. The",
                "egg is a dead matter, thus, Allah brings forth the dead from the living.",
                "And He brings forth the living from the dead, that is to say, He brings",
                "forth the chick from the egg.’",
                "We  have  previously  discussed  this  issue  and  said  that  this  is  a  naive",
                "interpretation,  simply  because  all  that  exists  in  this  worldly  life  is",
                "living and has a life of its own, even the inanimate beings. But who is",
                "the dead from whom life is to be brought forth?",
                "We answer by saying that the death phase precedes life and follows it.",
                "In  other  words,  we  were  dead  before  coming  to  this  world.  At  birth",
                "moment, our life cycle begins and when it ends we return dead once",
                "more.",
                "Thus,  all  that  exists  in  this  universe  falls  between  two  cycles  of",
                "creation:  death  and  life.  Allah,  all  praise  and  glory  be  to  Him,  says",
                "(what means): “How  can  you  disbelieve  in  Allah?  Seeing  that  you",
                "were dead and He gave you life. Then He will give you death, then",
                "again will bring you to life (on the Day of Resurrection) and then",
                "unto Him you will return.” (Al-Baqarah, 2: 28)",
                "Every  living  thing  has  a  duty  in  this  worldly  life.  When  this  duty",
                "comes to an end, it will depart worldly life and become dead. The tree,",
                "for instance, after yielding all the fruits it is ordained to give, will die",
                "and leave life because it has fulfilled its duty. And every animal has an",
                "assigned duty in life; it fulfills it then departs to the world of the dead.",
                "Similarly, man has a duty in this life, which is the period of trial that",
                "Allah  has  ordained  for  him.  After  being  put  to  trial  once  or  many",
                "times, life ends for him because the duty for whose sake he has been",
                "brought to life has come to an end.",
                "But we again wonder: if all what exists in worldly life is living, who is",
                "dead?",
                "Names of the Supreme Self of Allah and Timelessness of His"
            ],
            "Divine Attributes": [
                "Worth mentioning, before answering this question, to pinpoint the fact",
                "that  amongst  the  Divine  Names  of  Allah  is  the  Giver  of  life  and  the",
                "Causer of death. The Divine Names of Allah, all praise and glory be to",
                "Him,  denote  timelessness  and  fulfillment  together.  The  Divine",
                "Attributes  of  Almighty  Allah  pertain  to  His  Supreme  Self  and  to  all",
                "that is related to His Supreme Self.",
                "When we say that Allah is The All-Provider this means that His",
                "Majesty is The All-Provider before creating those whom He provides,",
                "in other words, before there exists a creature (of Allah) that He",
                "provides. Allah, The Exalted and Ever-Majestic, has provided",
                "sustenance to the first creature for being The All-Provider. Had not",
                "His Majesty been The All-Provider before creating those whom He",
                "provides, how could He have provided sustenance to His creatures the",
                "moment He created them?",
                "Almighty Allah is The Creator before creating, because in the name of",
                "being the Creator, He created. Such a Divine Attribute of Allah",
                "preceded the existence of any single creature. The Attribute is",
                "eternally inherent to His Supreme Self.",
                "Life is a creation and death as well, and we live through both",
                "creations. We experience life in this world and in the Hereafter. And",
                "we experience death before coming to this world and after departing",
                "from it till Resurrection.",
                "As long as Allah, all praise and glory be to Him, is The Creator then",
                "everything that is brought into existence is of His Creation, and",
                "everything that departs this worldly life and passes to death belongs to",
                "Allah. The passage of a thing from the world of life to the world of",
                "death is what Allah calls life and death."
            ],
            "We were…before coming to be": [
                "Truly, before coming to this worldly life, we were already created, as",
                "proven when Allah, all praise and glory be to Him, addressed us and",
                "made us testify as to ourselves and took our pledge that He is our",
                "Lord. We were already created in the death world then we moved, by",
                "the Command and Leave of Allah, all praise and glory be to Him, to",
                "worldly life, so we became alive after being dead, but how?",
                "We moved from the death world to the world of earthly life. As",
                "mentioned previously, all that exist in this worldly life is alive, so just",
                "by moving from the world of death to that of life made us alive. Also,",
                "when we depart this world, we would move once more from the world",
                "of life to that of death. Then after our resurrection, we would move",
                "from the world of death to that of life.",
                "This does not mean that death is a nonexistence, but it means that we",
                "have moved from a world having rules of its own to another world",
                "having other special rules. That transition does not take place to any",
                "creature amongst the creatures of Allah except by the Leave and Will",
                "of Allah, all praise and glory be to Him.",
                "In other words, we were dead, then we became alive, then we would",
                "move from the world of earthly life to the Barzakh [the grave as the",
                "barrier or the intermediate realm that separates between this world and",
                "the other world, from the time of death till the time of Resurrection]",
                "world, becoming dead again. Then we would return once again to the",
                "world of life on the hour of Resurrection for Judgment.",
                "No one can claim that during the Barzakh life we are unconscious.",
                "That is untrue; we have consciousness but of a special kind. We ",
                "perceive and realize other realties. At the moment of death, the unseen",
                "realms are disclosed to man and he sees the hidden. He would then",
                "beg Allah to return to worldly life once more after seeing the requital,",
                "after seeing Paradise and Hellfire, seeing them for real. Recite the",
                "Qur’anic verse in which Allah, The Most Exalted, says (what means):",
                "“Until, when death comes to one of them (those who join partners",
                "with Allah), he says: ‘My Lord! Send me back, So that I may do",
                "good in that which I have left behind!’ No! It is but a word that he",
                "speaks,  and  behind  them  is  Barzakh  (a  barrier)  until  the  Day",
                "when they will be resurrected.” (Al-Mu’minûn, 23: 99-100)",
                "At  that  moment  man  –  whether  a  believer  or  a  disbeliever  –  would",
                "surely  know  his  destiny.  He  would  know  whether  his  abode  is  in",
                "Paradise  or  in  Hellfire,  we  seek  refuge  with  Allah  from  it  (Hellfire).",
                "He would be fully aware that the journey of his life has not ended by",
                "his  death.  That  he  is  going  to  a  nonexistence  to  be  followed  by",
                "existence.  Otherwise,  he  would  not  have  begged  Allah  to  send  him",
                "back to worldly life so that he may do good deeds. While in the death",
                "world we become certain of the continuity of existence, besides many",
                "other realities that man comes to learn. For instance, man learns that",
                "there is no escape from the Fate of Allah, and that he would become",
                "alive once more."
            ],
            "Suicide and immortality in Hellfire": [
                "No doubt, life and death are two antitheses. None can combine",
                "between them nor move himself from one stage to another. Some may",
                "say that it is true that man can never step from death to life, a truth we",
                "all know and none can dispute it, however, man can step from life to",
                "death by committing suicide: whether by shooting himself, or simply",
                "by throwing himself from a high building or from a mountaintop, or",
                "by drowning himself.",
                "My answer to the one who claims thus would be: Why confuse",
                "between death and killing? Indeed, the one who kills himself is",
                "doomed to abide in Hellfire forever, why? Because man has not",
                "created his self so why destroys it? Allah, all praise and glory be to",
                "Him, is the One Who created him, so man together with his body,",
                "soul, and life belong to Allah. By committing suicide he surely has",
                "wasted what he does not own.",
                "Whoever kills someone unintentionally, his recompense is to pay the",
                "due blood money. On the other hand, he who premeditatedly kills a",
                "person, not in retaliation of murder or for spreading mischief on earth,",
                "certainly his retribution will be Hellfire to abide therein forever.",
                "Accordingly, the suicide has intentionally killed himself, therefore",
                "torment is justified against him.",
                "Allah, all praise and glory be to Him, wants us to learn that life with",
                "respect to man is preceded by death, which means that man will not",
                "begin this worldly life unless he has previously experienced its",
                "antithesis, which is death, so as to learn that this life will surely end up",
                "at the stage that preceded it before its own course has begun.",
                "Thereupon, if it were preceded by death, then death would surely",
                "succeed it.",
                "There is a great difference between life from our own perspective and",
                "the real life. From our own perspective, life could be play,",
                "amusement, mutual boasting and rivalry regarding wealth and",
                "children. This can be our conception of worldly life; therefore we pass",
                "this life aiming to fulfill our desires. However, Allah, all praise and",
                "glory be to Him, has not created this world to us for such play and",
                "amusement, but The Almighty made it for a purpose which He willed",
                "that it should be fulfilled. Recite the Qur’anic verse in which Allah, all",
                "glory be to Him, says (what means):",
                "“We created not the heavens and the earth and all that is between",
                "them for a (mere) play. Had We intended to take a pastime (i.e. a",
                "wife or a son, etc.), We could surely have taken it from Us, if We",
                "were going to do (that).” (Al-Anbiyâ’, 21:16-17)",
                "Allah, Blessed and Exalted be He, has planned a role to be performed",
                "by every living being. Such a role is the purpose of life; moreover, it is",
                "the purpose of the entire creation.",
                "If you want to discover the role of anything, you should ask its creator",
                "or maker why did he create it? Same as when we ask the manufacturer",
                "to first assign the purpose of his machine.",
                "For example, the washing machine is designed to facilitate the process",
                "of washing for any housewife. This machine has its own system. After",
                "assigning its role, the manufacturer, started to design the machine,",
                "which could achieve such a role. Afterwards, he determined the",
                "technique of its operation in addition to its maintenance, in case of",
                "damage. So, if we face any problem that causes it not to function",
                "properly, we should refer to the instructions found in the catalogue or",
                "the manual designed by the manufacturer to know the cause of the",
                "damage. But if we decided to repair the machine by ourselves,",
                "regardless of any instructions given by the manufacturer, surely the",
                "machine would be damaged instead of being repaired.",
                "The point is, when it comes to human industries (i.e., cars,",
                "refrigerators…etc.) we follow the instructions given by the",
                "manufacturer, however when trying to reform human life we import",
                "other destructive systems regardless of the system set by The Creator",
                "of mankind, who is the Best Knower of what He has created. We lay",
                "aside the Divine Law claiming that we are more capable of reforming",
                "our lives than Almighty Allah. Allah, Blessed and Exalted be He,",
                "illustrates that meaning to us through the noble Qur’anic verse saying",
                "(which means):",
                "“And when it is said to them: ‘Make not mischief on the earth,’",
                "they say: ‘We are only peacemakers.’ Verily! They are the ones",
                "who make mischief, but they perceive not.” (Al-Baqarah, 2:11-12)",
                "In brief, we summarize what we have detailed by saying that Allah, all",
                "praise and glory be to Him, has created man to be immortal. Every",
                "breathing soul, since Adam (peace be upon him) till the Day of",
                "Resurrection, is given immortality by Allah, either in Paradise to",
                "enjoy great pleasure and luxury, or in Hellfire to be tormented. Man is",
                "to remain immortal; none in this world will die without being",
                "resurrected, and none will be resurrected without Judgment, and none",
                "will receive Judgment without being admitted either into Paradise or",
                "to be cast into Hellfire.",
                "Allah, all praise and glory be to Him, has made death the first stages",
                "of life. We all came to life after death in the immaterial existence, thus",
                "moving from death to life; a process that only Allah, all praise and",
                "glory be to Him, is capable of. He is the sole Creator of life and death,",
                "and only Allah has the power to resurrect those who are in the graves.",
                "No power in this world, implicit or explicit, individual or collective,",
                "can transfer man from death to life, or can stop his journey from life to",
                "death.",
                "Mankind and all the creatures in the universe are incapable to grant",
                "life or inhibit death. Life and death are two antitheses. He, who is in",
                "life, surely is not dead and he, who is in death, is surely not alive.",
                "Each has his rules and his own world.",
                "We have also illustrated that there is death and there is killing, and",
                "how each of them differs from the other. Afterwards, we have",
                "discussed the purpose of creating this world, and the reason why",
                "Allah, all praise and glory be to Him, has created it. We asserted the",
                "fact that the maker of a thing is the only one who can fulfill the aim of",
                "his manufacture. But man believes that he can assign himself a"
            ],
            "www.islambasics.com": [
                "purpose other than the one he has been created for, under the pretext",
                "of reforming earth, while in fact he is corrupting it.",
                "But why has Allah created worldly life? That is what we shall discuss",
                "in detail in the next chapter, by the Will of Allah."
            ]
        },
        "Chapter five": {
            "Chapter five": [],
            "The Life Of This World": [
                "Allah,  all  praise  and  glory  be  to  Him,  has  created  the  universe  for  a",
                "specific  purpose.  He  informed  us  with  it  in  order  to  know  why  the",
                "creation  has  been  brought  about?  What  is  the  aim?  And  what  is  the",
                "end?",
                "Allah, Whose Majesty reigns supreme, says (what means):",
                "“And  I  (Allah)  created  not  the  jinn  and  humans  except  they",
                "should  worship Me  (Alone).  I  seek  not  any  provision  from  them",
                "(i.e.  provision  for  themselves  or  for  My  creatures)  nor  do  I  ask",
                "that  they  should  feed  Me  (i.e.  feed  themselves  or  My  creatures).",
                "Verily,  Allah  is  the  All-Provider,  Owner  of  Power,  the  Most",
                "Strong.” (Az-Zâriyât, 51: 56-58).",
                "The aim behind creating this universe is to worship Allah, praise Him,",
                "celebrate His Glory, and exalt Him. In these glorious Qur’anic verses",
                "The  Truth,  all  praise  and  glory  be  to  Him,  did  not  assign  by  name",
                "except  ‘The  jinn  and  humans’,  while  excluding  the  rest  of  the",
                "creatures in the universe, but why?",
                "Because Allah has given freedom of choice only to those two species",
                "amongst the creatures: they can believe in Allah and they can – Allah",
                "forbid – disbelieve in Him. They can obey Allah and they can – Allah",
                "forbid  –  disobey  Him.  As  for  the  rest  of  the  species  in  the  universe,",
                "they  are  made  to  obey  and  never  can  disobey.  They  continually",
                "glorify the Praises of Allah, the Exalted and Ever-Majestic; they never",
                "forget His Glorification or slacken in it. Recite the Qur’anic verse in",
                "which Allah, Blessed and Exalted be He, says (what means):",
                "“See  you  not  that  to  Allah  prostrates  whoever  is  in  the  heavens",
                "and whoever is on the earth, and the sun, and the moon, and the",
                "stars,  and  the  mountains,  and  the  trees,  and  Ad-Dawâb  (moving",
                "living  creatures,  beasts,  etc.),  and  many  of  mankind?  But  there",
                "are  many  (men)  on  whom  the  punishment  is  justified.  And",
                "whomsoever Allah disgraces, none can honour him. Verily! Allah",
                "does what He wills.” (Al-Hajj, 22:18)",
                "The  noble  Qur’anic  verse  generalized  prostration,  which  include  all",
                "the  creatures,  whether  in  the  heavens  or  on  the  earth.  None  of  them",
                "leave  submission,  showing  obedience,  remembering  Allah  and",
                "Glorifying  His  Praises.  But  mankind  did  not  attain  such  a",
                "generalization.  Instead,  they  are  divided  into  two  parties:  one  that",
                "obeys  and  believes  and  the  other  that  disobeys  and  disbelieves.  This",
                "division  came  only  when  Allah  mentioned  mankind,  why?  Because,",
                "as we have said before, Allah, Blessed and Exalted be He, has given",
                "mankind as well as jinn freedom of choice.",
                "Allah  has  created  this  great  universe  to  serve  man,  the  viceroy  on",
                "earth.  The  entire  universe  willingly  obeyed  their  Creator,  but  many",
                "among mankind whom Allah has given sovereignty over His universe",
                "did not comply!",
                "Allah, Whose Majesty reigns supreme, has offered the trust, which is",
                "freedom of choice, to all species of the universe, but they were afraid",
                "to  bear  such  a  responsibility  and  said,  ‘O  Lord!  We  want  to  be",
                "compelled to obey.’ Allah, all praise and glory be to Him, says (what",
                "means):",
                "“Truly,  We  did  offer  Al-Amânah  (the  trust  or  moral",
                "responsibility  or  honesty  and  all  the  duties  which  Allah  has",
                "ordained)  to  the  heavens  and  the  earth,  and  the  mountains,  but",
                "they declined to bear it and were afraid of it (i.e. afraid of Allah’s",
                "Torment). But man bore it. Verily, he was unjust (to himself) and",
                "ignorant (of its results).” (Al-Ahzâb, 33: 72)",
                "This  was  the  first  and  the  last  choice  that  all  the  species  in  this",
                "universe made. As for man, he chose to bear the trust, because Allah",
                "has willed that man should come to Him willingly not compulsorily.",
                "Man  can  disbelieve,  but  he  believes  out  of  loving  Allah;  he  can",
                "disobey,  but  he  obeys  out  of  loving  Allah.  Therefore,  mankind  and",
                "jinn  are  the  species  that  prove  the  attribute  of  loving  Allah  for  His",
                "Sake.  They  willingly  choose  to  follow  His  Way,  out  of  love  not",
                "compulsion.  Hence,  they  glorify  the  Praises  of  Allah,  prostrate",
                "themselves  to  Him,  exalt  Him,  pray  to  Him  and  invoke  Him  as  a",
                "confession of their love to Allah, all praise and glory be to Him.",
                "The  Truth,  Blessed  and  Exalted  be  He,  says  (what  means):  “And  I",
                "(Allah)  created  not  the  jinn  and  humans  except  they  should",
                "worship Me (Alone).” (Az-Zâriyât, 51: 56). For worship to be real,",
                "it should comprise all the activities of life. In other words, all man’s",
                "actions  should  reflect  his  love  for  Allah  and  every  movement  in  life",
                "should  be  a  vivid  proof  of  this  love.  The  Divine  Law  should  be  his",
                "guiding  light,  devotion  should  be  his  leader  and  no  crookedness",
                "should  be  in  the  path  he  follows.  Allah  should  never  see  him  where",
                "He prohibited him, nor miss him where He ordered him to be."
            ],
            "True worship and how it should be?": [
                "People think that worship is only the Five Pillars of Islam, “Testifying",
                "that there is no god but Allah and that Muhammad is the Messenger",
                "of  Allah,  offering  Prayer  dutifully  and  perfectly,  Paying  Zakâh",
                "(Obligatory  Charity),  fasting  Ramadan,  and  performing  Hajj",
                "(pilgrimage to Mecca) for whoever has the means to do so.” We say",
                "that these are the bases on which our religion is established.",
                "Our lord has chosen Islam for us to be always with Him and not to be",
                "overtaken  by  Satan  and  in  order  to  receive  His  Blessings,  His",
                "Bestowments and Generosities all the time. For  offering prayer after",
                "prayer  gives  us  the  power  of  faith  that  would  guard  us  against",
                "deviation  from  the  right  path  and  draw  us  closer  to  Allah,  be  He",
                "highly  blessed  and  exalted.  The  same  applies  to  Fasting,  paying  the",
                "Zakâh and performing Hajj. Every act of worship amongst them is a",
                "Light from Allah, so whenever we feel languor or gloominess in the",
                "soul, we should resort to a brand from the Light of Allah that would",
                "restore our stability of faith. Same thing when your battery runs low,",
                "you  connect  it  to  a  powerful  electric  source  to  get  it  recharged.",
                "Indeed, Islam encompasses the entire course of life, and covers every",
                "movement in it.",
                "I do not want to get involved in a futile debate with those who say that",
                "the Pillars of Islam are just Islam; that so long you offer prayers, pay",
                "Zakâh, fast and perform Hajj, you have guaranteed that you are with",
                "Allah,  so  you  can  do  as  you  please  and  leave  the  movement  of  life",
                "uncontrolled by any of the regulations dictated by faith!",
                "I say to all those people that I shall not discuss or debate what you are",
                "saying.  I  will  only  talk  about  one  of  the  Pillars  (of  Islam),  which  is",
                "offering  prayers  (Al-Salat).  To  perform  our  prayers  we  need  some",
                "basic elements that help us stand between the Hands of Allah",
                "The  first  thing  we  must  do  in  order  to  stand  between  the  Hands  of",
                "Allah and for our prayer to be valid is to cover the private parts of our",
                "bodies. I would not say that I would need a garment or the like, just a",
                "piece  of  cloth  to  cover  our  private  parts.  This  piece  of  cloth  needs",
                "cotton;  the  cotton  in  turn  needs  someone  to  cultivate  it  and  the",
                "cultivation  needs  plowing,  seeds  and  irrigation.  Seeds  could  be",
                "available or not. In case they were not, we must import them. In order",
                "to plow the land there must be a plow made of steel, that simple plow,",
                "which the primitive man used.",
                "Further,  we  may  need  to  search  for  an  iron  ore  in  mountains,  which",
                "has  to  be  melted  for  the  plow  to  be  made.  We  will  also  need  a",
                "blacksmith to take this melted iron and shape it into a sharp tool, and",
                "then  someone  to  bring  it  for  us  to  use  it.  After  the  cotton  ripen,  we",
                "will need someone to harvest it, then someone to carry it to the cotton",
                "gin,  then  someone  to  take  it  to  the  cotton  mill  where  it  is  spun  into",
                "thread, then to the weaver who would interlace it into cloth, and then",
                "to the merchant who would sell it to us. All these stages are necessary",
                "so  that  I  can  stand  in  front  of  Allah  having  the  private  parts  of  my",
                "body covered for my prayer to be accepted."
            ],
            "Who prepares food for us?": [
                "In  order  to  be  strong  to  perform  prayers  I  need  what  sustains  me;  a",
                "mouthful  to  eat  in  order  to  be  able  to  bow  and  prostrate  myself;  a",
                "mouthful  that  strengthens  me  to  do  so.  This  loaf  of  bread  that  I  buy",
                "from the grocery store has a long story of work behind it; beginning",
                "with  the  one  who  cultivated  the  wheat,  to  the  one  who  grounded  it",
                "into  flour,  to  the  one  who  kneaded  it  and  baked  it  and  finally  to  the",
                "one who brought it to the grocery store for me to buy.",
                "We can see thus that much work is actually done in order to perform",
                "prayer.  Imagine  if  we  all  remained  praying  in  the  Masjids  doing",
                "nothing else, who would bring us a piece of cloth to cover our private",
                "parts and a loaf of bread to sustain ourselves? Whatever is needed to",
                "perform a certain duty is itself a duty. Therefore, worship comprises",
                "every action in this universe. So long as Allah, all praise and glory be",
                "to  Him,  wants  man  a  worshipper,  He  wants  him  a  worshipper  in  his",
                "house,  a  worshipper  in  his  office,  a  worshipper  in  the  Masjid  and  a",
                "worshipper on the road; he should be a worshipper in every step of his",
                "life. Islam exhorts to the observance of decorum, it has even set some",
                "proprieties for people to follow while being on the road.",
                "Allah, all praise and glory be to Him, has shared out His Reward on",
                "the entire movement of life, because the course of Islam comprises all",
                "this movement. Thus, He has decreed a reward for he who visits the",
                "sick,  he  who  maintains  justice  in  judging  between  people,  he  who",
                "treats  his  neighbor  kindly,  he  who  removes  whatever  might  be",
                "harmful from the road, he who helps a disabled to cross the road, he",
                "who  spends  on  his  family,  he  who  answers  people’s  needs,  he  who",
                "puts an end to an act of injustice, he who utters kind words, he who",
                "gives a sincere advice, he who seeks to gain his living and that of his",
                "children, and he who forbids what is wrong and enjoins what is right.",
                "All that besides tens of thousands of other deeds, not included in the",
                "Pillars of Islam but cause the winning of a great reward.",
                "When we restrict our deeds to the performance of the Five Pillars of",
                "Islam,  we  deprive  ourselves  from  ninety  percent  of  the  reward  that",
                "Allah has promised us for sincerity in performing the activities of life.",
                "So long as The Truth, praise be to Him, has said (what means): “And",
                "I  (Allah)  created  not  the  jinn  and  humans  except  they  should",
                "worship Me (Alone).” (Az-Zâriyât, 51:65), then His entire Ordained",
                "Course  is  worship.  This  Course  controls  a  believer’s  actions  in  the",
                "universe; thus, every single action is an act of worship as long as it is",
                "dedicated to the end of earning the Good Pleasure of Allah."
            ],
            "The Divine Law set before creation": [
                "Before Allah, all praise be to Him, created man, He established a Law",
                "for  him  and  assigned  his  duty  in  life.  As  mentioned  before,  anyone",
                "who creates anything must first determine its purpose. As long as life",
                "is the capability of a thing to perform its duty, we must know the duty",
                "Allah  has  created  us  for.  Allah,  Blessed  and  Exalted  be  He,  has",
                "established the Law of our life to be capable to perform the duty for",
                "whose sake we have been created.",
                "It is real strange that the source of the world’s blights is man. Because",
                "he  has  a  free  will  and  a  reasoning  power  to  choose  between",
                "alternatives,  whereas  other  creatures,  that  are  made  to  obey  Allah,",
                "cause no mischief.",
                "They  perform  the  role  they  were  created  for  compulsorily  without",
                "choice. But what ruins life and the entire universe are the matters in",
                "which man interferes with his power of choice.",
                "Allah, Blessed and Exalted be He, wants us to follow in life the Law",
                "of our Creator, whereby we fulfill our duty exactly as the rest of the",
                "species  of  the  universe.  Allah,  all  praise  and  glory  be  to  Him,  says",
                "(what means):",
                "“(And)  if  you  differ  in  anything  amongst  yourselves,  refer  it  to",
                "Allah  and  His  Messenger  (may  Allah  bless  him  and  grant  him",
                "peace).” (An-Nisâ’, 4:59)",
                "All  the  creatures  in  the  universe,  including  inanimate  beings,  plants,",
                "and  animals  are  all  subjugated  to  perform  their  duty  in  life;  that  is",
                "serving  man.  But  what  is  man’s  duty?  His  sole  duty  is  to  worship",
                "Allah. Allah, Blessed and Exalted be He, says in the Divine Hadith:",
                "“O son of Adam! I have created this world for you, and created you",
                "for Myself, so do not be occupied by what is yours in place of what",
                "you are for.”",
                "What  is  the  essence  of  worship?  Does  Allah  want  us  just  to  say,",
                "‘Subhân-Allâh’  (glorified  be  Allah),  all  daylong  and  that  is  it?  No,",
                "actually  worshipping  Allah  is  man’s  wholehearted  occupation  with",
                "the duty that Allah has created him for. Every move in the universe is",
                "an act of worship. We resort to the Five Pillars of Islam to charge the",
                "faith ‘battery’ inside us. Therefore, the meaning of ‘worship,’ would",
                "be obeying Allah in the entire established Divine Law."
            ],
            "Man’s duty in life": [
                "All the creatures on the earth, including plants, inanimate beings and",
                "animals, are subjugated to you man, servile, obeying you in anything",
                "asked  of  them.  Their  duty  in  life  is  to  serve  the  believer  and  the",
                "disbeliever, the pious and the impious until the Hour of Resurrection",
                "is established. Only then, man loses this privilege and this subjugation",
                "ends.",
                "In worldly life, the sun does not shine on the believers only, nor does",
                "the earth gives forth its plants to the believers and withholds it from",
                "the disbelievers. The species of the earth interact for man and through",
                "him,  regardless  of  his  creed  and  his  faith  in  his  Lord.  So,  whoever",
                "succeed  in  adopting  the  means,  would  receive  their  yield,  without",
                "differentiating between he who says, ‘Lâ ilâha ill-Allâh’ (There is no",
                "God save Allah), and he who refuses to say it.",
                "But  in  the  Hereafter  things  would  be  much  different.  The  species",
                "would  serve  the  believer  alone  and  would  not  serve  the  disbeliever.",
                "When the disbeliever would attempt to lie to Allah and claims that he",
                "has  obeyed  Him,  his  legs  would  say,  ‘No  my  Lord,  he  used  me",
                "everyday to walk to the bar.’ And his hands would say, ‘No my Lord,",
                "he  used  me  to  smite  the  weak.’  And  his  tongue  would  say,  ‘No  my",
                "Lord, he used me to utter the word of disbelief.’ Thereby, he loses all",
                "mastery even over his own body. Recite the Qur’anic verse in which",
                "Allah, says (what means):",
                "“Till, when they reach it (Hell-fire), their hearing (ears) and their",
                "eyes, and their skins will testify against them as to what they used",
                "to do. And they will say to their skins, ‘Why do you testify against",
                "us?’ They will say: ‘Allah has caused us to speak, as He causes all",
                "things to speak, and He created you the first time, and to Him you",
                "are made to return.’” (Fussilat, 41: 20-21)",
                "Thus,  man’s  freedom  of  choice  and  the  creatures’  serviceability  to",
                "him are given to all mankind in worldly life, but in the Hereafter it is",
                "for the believers only.",
                "If the disbeliever tried to escape on the Day of Resurrection, his feet",
                "would  not  move;  if  he  wanted  to  run  away  from  Hellfire,  his  legs",
                "would  drive  him  towards  it  in  defiance  of  his  will.  If  he  wanted  to",
                "drink,  he  would  be  given  scalding  water  that  would  tear  up  his",
                "bowels;  if  he  wanted  to  clothe  himself,  the  angels  of  fire  would  cut",
                "out for him a garment from Hellfire sticking to his body.",
                "The  species  of  the  universe  would  not  serve  the  disbeliever  on  the",
                "Day of Resurrection, but would curse him, burn him and torture him.",
                "Allah,  all  praise  and  glory  be  to  Him,  has  honored  man  by  granting",
                "him  another  life,  a  life  not  given  through  means,  but  is  directly",
                "bestowed by Almighty Allah. A life of delights not to forsake man nor",
                "is he to leave it; a life befitting in its bestowments the believer whom",
                "Allah has vested with power in the universe; an eternal life that knows",
                "no death.",
                "Man’s  lifetime  does  not  end  by  his  death  after  worldly  life.  He  has",
                "another life, which is the meant one. But who is to attain such life and",
                "such delights? He is the one who fulfills in this worldly life the duty",
                "that  Allah  has  created  him  for.  That  is,  obeying  Allah  in  what  to  do",
                "and what not to do, such obedience that will lead man to immortality",
                "in heavenly delights.",
                "Allah  has  created  this  world  to  be  obeyed  in  it  and  to  have  all  the",
                "creatures  celebrating  His  Praises.  If  you  joined  the  creatures  of  the",
                "universe  and  you  became  a  worshipper  of  Allah,  you  would  be  in",
                "harmony with those glorifying species in worldly life, and then Allah,",
                "all glory be to Him, would grant you immortality in the Hereafter.",
                "But if Allah, all praise and glory be to Him, has created us to worship",
                "Him,  does  this  mean  that  Allah,  all  glory  be  to  Him,  needs  this",
                ", Allah stands Rich ",
                "worship? We say, ‘With His Graceful Being",
                "least ",
                "beyond need of any of His creatures.",
                "harm, and He will profit none by any act of obedience. He ha",
                "s ",
                "created us free to choose, then whosoever wills, let him believe, and ",
                "whosoever wills, let him disbelieve. Whosoever wills, let him come to ",
                "Allah willingly a nd not by force.’ Allah,",
                "supreme, says (what means):",
                "“If We will, We could send down to them from the heaven a sign, ",
                "to which they would bend their necks in humility.” (Ash-Shu‘arâ’, "
            ],
            "The Divine Law and the work of the human mind": [
                "What did man do after Allah has made him the master of this world ",
                "and  subjugated  to  him all the species of the universe? Did he justly ",
                "perceive the meanin g  of worldly life an d hastened to practice the ",
                "Divine Law? On the contrary, man abandoned the Divine Law and ",
                "began passing his own laws. Consequently,  misery overwhelmed the ",
                "universe because of manmade laws, which p eople adopted instead  of ",
                "the Divine Law. Thus, man became miserable because he deserted the ",
                "Law decreed by Allah and followed his own intellect.",
                "Certainly, there  is sharp differen ce  between having th e laws that ",
                "govern your life established by The All-Knowing, The All-Wise, The ",
                "Omnipotent God and  having them established by a h",
                "uman with ",
                "limited capab ilities, understanding and lifetime, who knows some ",
                "things and is ignorant of many others.",
                "The Divine Laws are stable, neither change nor alter, for the One Who ",
                "established them knows what would hap pen in the en tire universe till ",
                "the Last Hour is established . Nothing is unforeseen o r  unexpected to ",
                "Him, because Allah, all glory be to Him, is the All-Knowing and ",
                "comprehends everything in His Knowledge.",
                "On  the  other  hand,  we  see  that  manmade  laws,  for  their  deficiency,",
                "undergo  many  amendments  and  changes.  Hardly  a  few  years  pass",
                "before we are surprised by the fact that the causes for which the law",
                "was established were not remedied; that new unexpected aspects have",
                "emerged.  Thus,  we  undergo  the  painstaking  procedure  of  amending",
                "the  law.  But  those  who  amend  the  laws  are  also  humans  whose",
                "knowledge is limited. So, after a few years those laws would require",
                "amendment once more. Thus, humanity would continue to suffer the",
                "hardship  of  amending  the  laws  till  the  Command  of  Allah  would",
                "come to pass.",
                "Misery in the universe stems from the fact that we do not carry out the",
                "duty for which we are created; that is worshipping Allah and adopting",
                "His Divine Law, which falsehood cannot come to it from before it or",
                "behind  it,  because  it  is  sent  down  by  The  All-Wise,  Worthy  of  all",
                "Praise.",
                "We  have  forsaken  the  Divine  Law,  which  is  the  best  for  us  and  we",
                "began to amend, moralize, and be misled by our human arrogance and",
                "belief that we are more capable of reforming the universe than Allah,",
                "all praise and glory be to Him. But we ruined everything, we wasted",
                "our life, we wasted the purpose behind it, and that is the main crime",
                "that humanity perpetrates against itself and against the right owed to",
                "its Creator.",
                "We deviated from the purpose for which this universe, and ourselves",
                "as well, are created and our life became vain. Since we have wasted",
                "our first life, then our second life is definitely wasted, as the first life",
                "is  the  path  ushering  to  the  delights  of  the  real  life  in  the  Hereafter,",
                "provided  that  we  fulfill  our  duty  in  worldly  life  just  as  Allah  has",
                "commanded  us.  But  if  we  vainly  wasted  the  first  life  and  began",
                "moralizing  depending  on  our  fallibility,  rendering  what  is  lawful",
                "unlawful, and what is unlawful lawful, describing those who abide by",
                "the  Law  of  Allah  as  old-fashioned  savage  people,  though  real",
                "savagery is to abandon the Law of Allah. If we do so then regretfully",
                "we have indeed wasted the Hereafter too."
            ],
            "Life from a male and a female": [
                "When Allah, all praise and glory be to Him, has created this life, He",
                "established  laws  for  it.  Among  these  laws,  is  that  no  life  originates",
                "except  from  a  male  and  a  female,  each  of  which  is  created",
                "independently  from  the  other.  Mankind,  plants,  animals  and  all  the",
                "species  on  the  earth  are  created  from  a  male  and  a  female,  where",
                "masculinity  and  femininity  exist  independently  in  two  creatures.",
                "Unquestionably,  no  creature  springs  from  another  creature,  as",
                "Darwinism  falsely  claims.  Recite  the  Qu’anic  verse  in  which  The",
                "Truth, all praise be to Him, says (what means):",
                "“And  of  everything  We  have  created  pairs,  that  you  may",
                "remember (the Grace of Allah).” (Az-Zâriyât, 51: 49)",
                "There has also existed another polarity that remained unknown to us",
                "and  we  learned  about  it  only  recently.  We  have  learned  that  in",
                "electricity there should be a positive and a negative pole for the spark",
                "to be emitted. If both poles were either negative or positive, electricity",
                "would not be produced. We have also learned that clouds are bipolar,",
                "upon joining together rain comes down. We have also learned that the",
                "atom  contains  positive  and  negative  particles.  Still,  there  exist  other",
                "things  we  have  not  known  yet.  Surely,  when  Allah  reveals  their",
                "secrets  to  us  we  will  learn  that  all  the  creatures  of  the  universe,",
                "without exception, are from a male and a female.",
                "But, there are two main issues that Allah has revealed His Judgment",
                "pertaining  to  them  and  ordered  us  not  to  subject  them  to  our",
                "reasoning,  nor  to  think  about  them;  simply  because  the  human",
                "intellect can never gain any knowledge regarding them. The first issue",
                "is  that  you  would  never  know  how  the  universe  was  created.  The",
                "second issue is that you would never how you were created.",
                "We  say  to  those  who  have  their  own  theories  concerning  the",
                "beginning  of  creation  and  how  the  universe  seemed  before  the",
                "beginning of life: From where did you deduce your theories and from",
                "where did you get such information? Did you witness their creation or",
                "have  there  come  to  you  of  knowledge  that  which  did  not  come  to",
                "others?  Those  who  say  that  man  evolved  from  an  ape  are  surely",
                "wrong. Anyone who tackles the issue of creation and the origin of the",
                "universe  is  wrong  no  matter  how  many  false  evidences  he  has",
                "gathered, that do not surpass being mere conjectures and guesswork.",
                "We summarize what we have detailed by saying that Allah, all praise",
                "and  glory  be  to  Him,  has  created  this  universe  to  prostrate  itself  to",
                "Him and to celebrate His Praises, glorified be He. The entire universe",
                "obeys Allah by forced submission, but Allah, Blessed and Exalted be",
                "He, wants to be worshipped willingly, out of loving Him.",
                "Allah,  all  praise  and  glory  be  to  Him,  has  established  a  Divine  Law",
                "revealed  through  the  sent  messengers,  which  comprises  every",
                "movement  in  life. Worship  is  not  limited to  offering  prayers,  paying",
                "the Zakah (obligatory charity), Fasting and performing Hajj, but every",
                "single movement in life is an act of worship and is a law.",
                "Allah wants us to be active in life and populate the earth. In order, for",
                "instance,  to  engage  in  the  worship  of  offering  prayers,  extensive",
                "activities have  to  be  carried out  that  comprises  many  aspects  of  life.",
                "Allah,  Blessed  and  Exalted  be  He,  does  not  want  us  to  just  glorify",
                "Him night and day, but He wants us to work hard and be active. And",
                "whatever  is  indispensable  to  perform  a  certain  duty  is  indeed  a  duty",
                "itself.",
                "Man was mischievous on the earth by his free will. He abandoned the",
                "Divine  laws  and  began  passing  his  own  laws.  Humanity  became",
                "miserable  because  of  manmade  laws.  Man  has  forsaken  the  Divine",
                "Law in order to formulate laws based on his reasoning power. He kept",
                "arguing about issues that are far beyond his mental capacity. Indeed,",
                "no  matter  how  long  we  debated  regarding  the  origin  of  the  universe",
                "and the creation of man we would reach no truth.",
                "That is concerning our worldly life restricted by our short lifetime. As",
                "for the life to come, the true one that would not be followed by either",
                "death or perishing, the eternal life, that would be the topic of the next",
                "chapter."
            ]
        },
        "Chapter six": {
            "Chapter six": [],
            "The Life Of The Hereafter": [
                "Before concluding our discussion about life and death, we have to talk",
                "about the Hereafter in details. This is man’s real life. Worldly life is",
                "merely the abode of trial. No matter how long man stays in it, he will",
                "surely leave it at the end, and then will come man’s eternal life.",
                "This  worldly  life  is  preceded  by  death  and  is  followed  by  death,",
                "whereas  the  Hereafter  is  preceded  by  death  and  is  followed  by",
                "immortality. This worldly life is a world of vicissitudes where man’s",
                "state  is  never  the  same.  The  strong  therein  becomes  weak,  the  rich",
                "becomes poor and the powerful becomes helpless.",
                "As  for  life  in  the  Hereafter,  it  is  characterized  by  permanence  in",
                "everything;  in  its  pleasures,  its  torment,  its  delights,  and  all  that  it",
                "offers. Man before coming to this worldly life experienced a period of",
                "death  in  the  immaterial  existence.  For  man  to  reach  the  life  of  the",
                "Hereafter,  he  has  to  experience  a  death  period  in  the  Barzakh [the",
                "grave  as  the  barrier  or  the  intermediate  realm  that  separates  between",
                "this world and the other world from the time of death till the time of",
                "Resurrection]  world.  The  Barzakh  is  the  barrier  between  death  and",
                "resurrection,  between  life  and  afterlife.  After  it,  there  would  be  no",
                "return to worldly life.",
                "We  have  to  keep  in  mind  that  everything  about  man,  whether  in  the",
                "immaterial existence, the life of this world, the death world, or in the",
                "Hereafter, is chronicled in accurate records with Allah, all praise and",
                "glory  be  to  Him.  None  among  these  phases  goes  haphazardly  or",
                "elapses without an order or an accurate arrangement. Allah, all praise",
                "and  glory  be  to  Him,  possesses  an  utmost  accurate  record  of",
                "everything He has created. No secret in this world is concealed from",
                "Him. Nothing is hidden from Him so much as the weight of an atom",
                "on the earth or in the heavens. Everything is in a Clear Book, which is",
                "the  foundation  of  the  Book,  Al-Lauh  Al-Mahfûz  (The  Preserved",
                "Tablet). Recite the noble Qur’anic verse in which Allah, all praise be",
                "to Him, says (what means):",
                "“Verily, We give life to the dead, and We record that which they",
                "send  before  (them),  and  their  traces  [their  footsteps  and  walking",
                "on the earth with their legs to the mosques for the five compulsory",
                "congregational prayers, Jihâd (holy fighting in the Cause of Allah)",
                "and  all  other  good  and  evil  they  did,  and  that  which  they  leave",
                "behind],  and  all  things  We  have  recorded  with  numbers  (as  a",
                "record) in a Clear Book.” (Yâsîn, 36: 12)",
                "For  each  one  of  us  there  is  a  preserved  record  kept  with  Allah.  It",
                "encloses all the events of man’s life and it would be a witness against",
                "him on the Day of Resurrection, but how would it bear witness against",
                "him?  A  witness  against  him  through  vivid  images,  as  he  would",
                "certainly  see  and  hear  all  the  events  of  his  life  exactly  as  they",
                "happened to him, and observe them meticulously in a way that inhibits",
                "him  from  denying  any  of  them.  Allah  thus  makes  man  bear  witness",
                "against himself on the Day of Resurrection. Recite the noble Qur’anic",
                "verse  in  which  Allah,  Whose  Majesty  reigns  supreme,  says  (what",
                "means):",
                "“Read  your  book.  You  yourself  are  sufficient  as  a  reckoner",
                "against you this Day.” (Al-Isrâ’, 17: 14)",
                "This  record  and  the  registered  life  of  each  man  are  so  accurate  to",
                "extent  that  it  resembles  eyeing  our  selfsame  worldly  lives  and  be",
                "amazed from the accuracy of such recording, because we would find",
                "recorded  in  that  book  certain  matters  and  details  we  have  forgotten.",
                "Allah, all praise and glory be to Him, says concerning the accuracy of",
                "recording (what means),",
                "“Allah  has  kept  account  of  it,  while  they  have  forgotten  it.”  (Al-",
                "Mujâdalah, 58:6)",
                "We would also discern the seriousness of Judgment from the accuracy",
                "of  recording,  that  Allah,  all  praise  and  glory  be  to  Him,  misses",
                "nothing.  Therefore,  we  have  to  carefully  deliberate  on  the  Qur’ânic",
                "verse in which Allah, praise be to Him, says (what means),",
                "“They will say: ‘Woe to us! What sort of Book is this that leaves",
                "neither  a  small  thing  nor  a  big  thing,  but  has  recorded  it  with",
                "numbers!’ And they will find all that they did, placed before them,",
                "and your Lord treats no one with injustice.” (Al-Kahf, 18: 49)",
                "Deep  deliberation  on  this  Qur’ânic  verse  makes  us  ashamed  of",
                "committing any sin while knowing that it will be recorded against us",
                "and  be  exposed  on  the  Day  of  the  Great  Scene  in  front  of  Allah,  all",
                "praise and glory be to Him, witnessed by all the creatures.",
                "Beyond the capacity of mind…but true indeed when it comes",
                "to the Power of Allah",
                "Those who disbelieve in the Unseen may stop and ask themselves: Is",
                "it possible? Is it possible that each one of us would be brought from",
                "among billions of persons that lived and would still live on earth since",
                "the beginning of creation till the establishment of the Last Hour? Is it",
                "possible that each one of us would be brought with our very selfsame",
                "being  although  the  earth  consumes  our  bodies  and  erases  it  leaving",
                "nothing whatsoever of man?",
                "We reply by saying that when  we  talk about the Power  of Allah, we",
                "never  talk  in  terms  of  reason.  That  is  because  Allah,  all  praise  and",
                "glory  be  to  Him,  is  beyond  the  capacity  of  mind.  There  is  nothing",
                "whatsoever  like  unto  Him.  All  His  Divine  Attributes  and  Power  are",
                "likewise beyond man’s grasp of intellect. But surely every one of us is",
                "created with an accurate balance so exact that is never upset nor lost.",
                "Allah,  all  praise  and  glory  be  to  Him,  being  merciful  to  our  minds,",
                "revealed to us some of the secrets He has placed in this universe that",
                "may approximate to our minds the prodigious matters of the Unseen,",
                "in order not to go astray, nor fall into distress.",
                "Originally, man is created from a sperm and all mankind were brought",
                "forth  from  the  loin  of  Adam  (peace  be  upon  him).  This  sperm  is  so",
                "minute  that  it  cannot  be  seen  with  the  naked  eye.  To  perceive  how",
                "accurate  the  process  of  creation  is,  it  suffices  to  imagine  that  all",
                "mankind – since the creation of Adam till the Day of Resurrection –",
                "existed  in  the  loin  of  Adam.  That  was  the  beginning.  Every  sperm",
                "represents  a  human’s  life,  on  which  his  entire  life  is  written  with  a",
                "highly accurate code: his age, his lifetime, and all the events that will",
                "happen  to  him,  whether  a  male  or  a  female,  whether  miserable  or",
                "happy and all other things.",
                "If  we  were  made  to  know  this  code,  take  it,  and  then  input  it  in  a",
                "computer  to  solve  its  riddles  we  would  be  faced  in  minuets  with  a",
                "human’s figure, his gender, and the story of his whole life. Although",
                "such  a  scientific  fact  has  started  to  be  known  to  us  only  recently,  it",
                "existed since the creation of Adam. But Allah, all praise and glory be",
                "to  Him,  has  not  willed  to  reveal  some  of  its  secrets  except  at  the",
                "present time.",
                "This sperm chosen with utmost accuracy is emitted, enters the womb,",
                "fertilizes the egg, and causes pregnancy. The code continues to output",
                "what has been recorded in it till the time of death is due then it stops."
            ],
            "The record is never lost": [
                "This is the only record that is never erased, lost, or obliterated. When",
                "Allah resurrects people on the Day of Resurrection, He will say to this",
                "sperm, “Be!” so the code is deciphered and all what is written on it is",
                "fulfilled and comes the very selfsame man.",
                "Allah, all praise and glory be to Him, draws our attention to the fact",
                "that Resurrection is the bringing back of creation, not a new creation.",
                "Allah, Whose Majesty reigns supreme, says (what means),",
                "“Then, they will say: ‘Who shall bring us back (to life)?’ Say: ‘He",
                "Who  created  you  first!’  Then,  they  will  shake  their  heads  at  you",
                "and say: ‘When will that be?’ Say: ‘Perhaps it is near!’” (Al-Isrâ’,",
                "Allah, all praise and glory be to Him, will order those sperms present",
                "on  the  earth  to  return  creatures  as  before,  and  they  will  comply.  The",
                "only difference will be the time, because in the Hereafter there is no",
                "time. What takes place during worldly life in thirty, forty, fifty years,",
                "or more or less, will happen in a second. This is the only difference.",
                "Other  than  that,  Resurrection  is  a  bringing  back  of  a  creation  that",
                "already  existed.  Although  mankind  is  alike  in  appearance,  physical",
                "structure  and  characteristics,  you  will  never  find  two  typically",
                "identical persons. Two persons will never be totally identical in every",
                "thing from the time of Adam (peace be upon him) till the Last Hour is",
                "established, though we are almost repeated duplicates.",
                "Allah,  all  praise  and  glory  be  to  Him,  being  merciful  to  our  minds,",
                "gave  us  the  clue  to  this  in  many  things.  Take  for  an  instance  the",
                "fingerprint; although our hands are similar, the fingerprint of each one",
                "of  us  is  different  from  that  of  the  other.  It  is  also  true  between  the",
                "fingers of the same hand. I believe that this is an undeniable fact and",
                "an acquired worldly knowledge whose miracles are unfolded with the",
                "passage  of  time.  In  every  age  the  Noble  Qur’ân  offers  special",
                "bestowments,  which  are  not  brought  about  by  coincidence.  Allah,",
                "Blessed and Exalted be He, has called our attention to it in the Noble",
                "Qur’ân through the verse saying (what means):",
                "“Does  man  (a  disbeliever)  think  that  We  shall  not  assemble  his",
                "bones? Yes, We are Able to put together in perfect order the tips",
                "of his fingers.” (Al-Qiyâmah, 75: 3-4)",
                "This means that the Power of Allah, Blessed and Exalted be He, does",
                "not lie only in assembling the bones, which had dissolved and turned",
                "into dust, but His Power is far beyond that. With His infinite Power,",
                "The  Almighty  put  together  the  fingertips  and  fingerprints,  which",
                "distinguishes a human from another since the time of Adam (peace be",
                "upon him) till the Day of Resurrection.",
                "Modern science has proven, as Allah has already revealed to us, that",
                "just as fingers have a unique print, the body has also its print, its scent",
                "that distinguishes a human from the rest of his race. It is identified by",
                "trained dogs that have a very sensitive sense of smell. Man has also a",
                "voiceprint,  tooth  print,  and  other  distinctive  features.  In  fact  every",
                "body has its own code identified by all the members of the one body",
                "in  a  manner  that  never  allows  the  mingling  of  a  single  body  with",
                "another.",
                "We  come  across  this  fact  in  organ  and  skin  transplantations.  Every",
                "body perfectly knows its organs and tissues. So, if man is injured, you",
                "find  the  skin  coalescing  and  weaving  a  new  tissue  to  replace  the  cut",
                "and close it. Similarly, if any bodily organ is afflicted with a microbe,",
                "the  whole  body  is  united  to  fight  this  microbe  till  it  destroys  it.  But",
                "what  happens  if  we  placed  an  organ  or  a  tissue  taken  from  another",
                "person? Immediately the body identifies it, knows that it is not its own",
                "and  starts  fighting  this  foreign  intruder  till  it  expels  it,  even  if  this",
                "organ  is  taken  from  the  man’s  brother,  son,  or  daughter;  in  other",
                "words, is of the same origin. This proves to us that each body has its",
                "unique code.",
                "Perhaps the surgeons who perform transplanting operations are the ",
                "people most familiar with this fact.",
                "similar cases, a mother’s body rejecting the dau",
                "ghter’s k idney, a ",
                "father’s body not acceptin g  the son’s skin tissues. Th en it is not a ",
                "matter of kinship or origin, but every body has its own code that does ",
                "not agree with that of another body. Verily, the Work of Allah , Who ",
                "perfected all things."
            ],
            "Proving Resurrection with tangible evidences": [
                "ecial code on the sperm,",
                "Faced with all these evidences that approximate to the mind how each ",
                "human being is a n one recurrent image of the others, and how he is ",
                "distinguished  by special attributes that characterize him ",
                "inscribed with a sp",
                "commencement of brin ging man from the immaterial existence or the ",
                "death world to the worldly life in order to perform his  duty, we learn ",
                "for sure that recreation is easier ",
                "than  starting it. Alth ough there is ",
                "nothing deemed easy or difficult o n Almighty Allah, for He ju st says ",
                "to a  thing: ‘Be!’ and it is.  But we mention this because recreation of ",
                "an  existent, for us, is easier than bringing it into being. In order to ",
                "clarify this meaning to us, Allah, all  praise and glory b e to Him, says ",
                "in the Noble Qur’an (what means):",
                "alone, ",
                "“And He  it is Who  originates the creation, then will ",
                "repeat it ",
                "(after it has been  perished), and this is  easier for Him. His is the ",
                "highest description (i.e. none has  the right to be worshipped but ",
                "He,  and  there is no thing comparable unto Him) in the heavens ",
                "and in the earth. And  He is the All-Mig hty, the All-Wise.”  (Ar--",
                "Rûm, 30: 27)",
                "Moving from one phase to the other in our journey towards eternal life ",
                "does not occur except with the Power of Allah, all praise and glory be ",
                "to Him, Alone. Rising from our graves does not signify the beginning",
                "of the afterlife, rather it is rising to face the Day of Judgment; the Day",
                "when  all  people  would  be  resurrected  from  the  graves  they  were",
                "buried inside. They would all come forth by the same word that was",
                "said  to  the  sperm  ‘Be’.  For  as  the  sperm  was  surrounded  in  the",
                "immaterial  existence  by  the  signs  of  death,  till  Almighty  Allah",
                "permitted  it  to  come  to  life  by  the  word  ‘Be,’  and  life  was  breathed",
                "into  it  so  as  to  perform  what  is  fated  for  it,  from  conception,  birth,",
                "childhood, till finally reaching the predestined age of death. The same",
                "applies  to  the  Hour  of  Resurrection,  when  it  would  be  said  to  the",
                "sperm  ‘Be,’  and  people  would  start  rising  from  their  graves,  but  the",
                "question is how they would come forth?",
                "Would  man  keep  on  trying  to  get  out,  and  keep  removing  the  soil",
                "above him to get out? Never, for the land would split asunder for him",
                "by the Command of Allah, all praise and glory be to Him. Recite the",
                "noble Qur’anic verse in which Allah, all praise be to Him, says (what",
                "means):",
                "“On  the  Day  when  the  earth  shall  be  cleft,  from  off  them,  (they",
                "will come out) hastening forth. That will be a gathering, quite easy",
                "for Us.”  (Qâf, 50: 44)",
                "But  why  Allah,  all  praise  and  glory  be  to  Him,  has  called  it  Hashir",
                "‘crowding  or  gathering’?  Because  all  who  were  engraved  within  the",
                "earth would come forth of it, although they were not buried all at the",
                "same time, but they were buried throughout many centuries and their",
                "parts  were  scattered  in  distant  places  after  turning  into  dust.  They",
                "would  all  come  forth  in  the  same  breath,  and  the  earth  would  be",
                "crammed  with  them.  Therefore,  Allah  has  called  it  the  Day  of",
                "Crowding, because the overcrowding would be so intense.",
                "Imagine  a  land  like  Egypt  for  instance;  many  dead  people  were",
                "interred in it throughout so many centuries, and all of a sudden these",
                "dead  people  would  come  out  in  the  same  breath.  Indeed,  what  a ",
                "horrible great crowd and what a frightful day!",
                "In America someone once asked me  where does the so ul g o after ",
                "death? I answered him saying, ‘To where it was before it came to life,’ ",
                "are ",
                "and then another asked how all the events of the universe ",
                "recorded? I told him that it is not just recorded, but are predestined by ",
                "Allah, all praise and glory be to Him, before they occur. And this is a ",
                "proof of the Divine Omnipotence and the Perfection o",
                "f  Allah’s ",
                "Knowledge. Each deed and event h appens according to the Decree of ",
                "Allah. Recite the noble Qur’anic verse in which Allah, all praise be to ",
                "Him, says (what means):",
                "“No calamity befalls on the earth or in yourselves but is inscribed ",
                "in  the  Book of Decrees  (Al-Lauh Al-Mahfûz), before We bring it ",
                "into existence. Verily, that is easy for Allah.”) Al-Hadîd, 57: 22)",
                "Such recording is so accurate to the extent that the eyes of a murdered ",
                "victim record in its iris the image of the killer, and if we succeeded to ",
                "reach the iris of the  murdered victim, we would b e able to see the ",
                "image of the k iller. Indeed , everything ",
                "is recorded  and has its ",
                "substantiating proof.",
                "Before Allah, all praise an d glory be to Him, created life, He created  ",
                "death. When man is born the angel of death goes out in search for him. ",
                "The age of man is the time it takes the angel of death to find him, and ",
                "when they meet it is the moment of death."
            ],
            "Paradise": [
                "Allah, all praise and   glory be to Him, h",
                "especially for the afterlife, even if they",
                "Paradise there is what an eye has never seen, nor an ear has ever heard ",
                "of, nor ever crossed the mind of a human  soul, it is thus difficu lt  to",
                "as created many ",
                "things ",
                "express life in Paradise by words, for the image must first exist in the",
                "human mind, and then one can choose the suitable words to express it.",
                "Before  inventing  the  television  for  example,  this  word  had  no",
                "existence  in  any  of  the  languages,  but  when  it  was  invented  and",
                "became a tangible reality, the linguistics chose for it this name",
                "When Allah, Blessed and Exalted be He, describes life in Paradise for",
                "us, He says (what means), ‘The likeness of (this) worldly life’, thus it",
                "is  not  life  itself,  but  just  a  simile  whereby  He  approximates  it  to  the",
                "mind by something known. When someone wants to communicate to",
                "the mind an unknown thing, he likens it to something familiar so that",
                "the hearer can understand. As when trying to inform someone that the",
                "earth  is  round  shaped,  you  bring  him  a  map  of  the  earth  drawn  on  a",
                "ball, and tell him that the earth is similar to this ball.",
                "When  the  inhabitants  of  Paradise  would  enter  it,  things  would  seem",
                "similar  to  them;  they  would  imagine  that  the  fruits  are  akin  to  those",
                "with  which  they  were  provided  before  in  worldly  life,  but  in  reality",
                "they are certainly different. Allah, The Most Exalted, would command",
                "them to eat them and they would find them totally different from what",
                "they had in worldly life. Thus, all the descriptions that Allah gives for",
                "life  in  Paradise,  is  an  attempt  to  approximate  the  meaning  to  the",
                "human mind, so that man can envisage how it would be. It is enough",
                "to know that in Paradise one obtains whatever it occurs to his mind by",
                "the mere thinking of it, which is something none can attain in worldly",
                "life.",
                "Once  I  was  visiting  the  United  States,  when  they  took  me  to  a  hotel",
                "where  the  kings  usually  stay;  they  wanted  to  fascinate  me  with  the",
                "scientific  progress,  where  everything  in  the  room  is  prepared  for",
                "accommodation. Just by pressing a button you get a cup of coffee, and",
                "by pressing another you get a cup of tea, food or the like. When they",
                "asked me my opinion, I told them that if such were manmade luxury,",
                "just  imagine  how  much  the  more  the  Lord  of  mankind  has  prepared",
                "for us?",
                "In Paradise, when man dreams of something he finds it before him; all",
                "what  man  wishes  for  is  fulfilled,  and  Allah  has  ever  more  than  what",
                "any heart can crave for, therefore The Truth, all praise be to Him, says",
                "(what means):",
                "“There they will have all that they desire, and We have more (for",
                "them, i.e. a glance at the All-Mighty, the All-Majestic).”(Qâf, 50:",
                "Meaning  that  Allah,  all  praise  and  glory  be  to  Him,  grants  man  in",
                "Paradise all what he wishes, and whatever the mind can dream of, and",
                "then  there  would  be  more  and  more.  Yes  indeed!  The  ultimate",
                "happiness  and  ecstasy  will  be  seeing  Allah  on  the  Day  of",
                "Resurrection. This is the greatest blessing, which any man can attain",
                "in  this  universe.  When  man  sees  Allah,  he  will  wish  for  no  other",
                "delights,  nor  desire  anything  more  than  enjoying  the  pleasure  of",
                "looking  at  Allah,  all  praise  and  glory  be  to  Him.  The  Truth,  Whose",
                "Majesty reigns supreme, says in the Noble Qur’an (what means):",
                "“Some  faces  that  Day  shall  be  Nâdirah  (shining  and  radiant).",
                "Looking at their Lord (Allah).”(Al-Qiyâmah, 75: 22-23)",
                "The  worst  punishment  that  can  befall  a  man  on  the  Day  of",
                "Resurrection  is  to  be  deprived  from  seeing  Allah,  neither  will  Allah",
                "look  at  him,  nor  speak  to  him.  Indeed,  an  intolerable  punishment",
                "afflicted  on  the  dwellers  of  the  Hellfire.  The  Truth,  Blessed  and",
                "Exalted be He, says about the denizens of Hellfire (what means):",
                "“Neither will Allah speak to them, nor look at them on the Day of",
                "Resurrection.”(Âl-‘Imrân, 3: 77)",
                "And Allah, Whose Majesty reigns supreme, says (what means):",
                "“Nay!  Surely,  they  (evil-doers)  will  be  veiled  from  seeing  their",
                "Lord that Day.”(Al-Mutaffifîn, 83: 15)",
                "We have to understand that in the life of Paradise or Hell, the structure",
                "of our bodies will change in a way that shifts them from mortality to",
                "immortality, and helps make the body cope with the new conditions of",
                "the  life  it  shall  live.  Thus,  the  body  structure  of  the  inhabitants  of",
                "Paradise  will  change  to  suit  life  in  Paradise,  enabling  them  to  see",
                "Allah, talk to Him and listen to Him. As for the inhabitants of Hellfire,",
                "we  seek  the  Refuge  of  Allah  from  such  an  end,  the  time  the  skin  of",
                "their bodies gets burned, it will be renewed and revived once more, so",
                "that  they  feel  the  pain  and  torment,  for  the  sensory  nerves  exist",
                "directly  beneath  the  skin,  as  science  has  discovered  just  recently.",
                "Allah, Blessed and Exalted be He, says (what means):",
                "“Surely!  Those  who  disbelieved  in  Our  Ayât  (proofs,  evidences,",
                "verses,  lessons,  signs,  revelations,  etc.)  We  shall  burn  them  in",
                "Fire. As often as their skins are roasted through, We shall change",
                "them  for  other  skins  that  they  may  taste  the  punishment.  Truly,",
                "Allah is Ever Most Powerful, All-Wise.” (An-Nisâ’, 4:56)",
                "Thus,  we  see  that  all  of  us  will  be  endowed  with  a  new  creation,  so",
                "that Allah, Blessed and Exalted be He, may grant us the fruits of our",
                "deeds in worldly life, and grant us the eternal life that suits the human",
                "being  whom  Allah,  all  praise  and  glory  be  to  Him,  has  honored  and",
                "created the whole universe for his sake. This is the true life that Allah,",
                "all praise and glory be to Him, wants for us. As for the inhabitants of",
                "Hellfire,  we  seek  the  Refuge  of  Allah  from  such  an  end,  they  only",
                "enjoyed themselves in this worldly life a little, and they incurred upon",
                "themselves  an  eternal  torture  in  the  Hereafter.  They  have  ruined",
                "themselves by disobeying Allah, all praise and glory be to Him. They",
                "have  wasted  the  real  life  that  Allah,  Whose  Majesty  reigns  supreme,",
                "has prepared for them.",
                "Here we reach the end of this discussion, hoping that Allah, all praise",
                "and  glory  be  to  Him,  has  guided  me  to  what  He  loves  and  may  earn",
                "His Good Pleasure, and I beg The Most Exalted, that this book serves",
                "as guidance to all those who reads it, and ushers them to the true life",
                "in  Paradise,  verily  He  is  the  All-Hearer,  the  One  Who  answers  the",
                "prayers."
            ]
        }
    }
}